{
  "id": 474,
  "title": {
    "ar": "الباب الرابع والسبعون وأربعمائة في حال قطب كان منزله ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ",
    "en": "Chapter Four Hundred and Seventy-Four: Concerning the spiritual state (حال) of a Pole (قطب) whose station (منزل) was <<What is with you is exhausted, and what is with Allah is lasting.>>",
    "ur": "باب چار سو چوہتر (۴۷۴) ایک قطب (قطب) کی حالت (حالت) کے بارے میں جس کا روحانی مقام یہ تھا: \"جو کچھ تمہارے پاس ہے وہ ختم ہو جائے گا اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے\" (ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ)",
    "fa": "باب چهارصد و هفتاد و چهارم در بیان حال قطبی که منزل او این آیه بود: «آنچه نزد شماست از بین می‌رود و آنچه نزد خداست باقی است» (ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ)."
  },
  "content": {
    "ar": "## «الباب الرابع والسبعون وأربعمائة في حال قطب كان منزله ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ»\n\n\n> أنا عند الذي ما زال عندي *** فزال نفادنا فلنا البقاء\n\n\n> تقاسمنا الوجود على سواء *** فكان له السنا ولنا السناء\n\n\n> به فانظر إذا ما قلت أنا *** فنحن به له فلنا الثناء\n\n\n> رأيناه بغير اسمي وحيدا *** نزيها لا ينهنهه اللقاء\n\n\n> فلما أن تسمى غاب عنا *** وأسبل دون أعيننا الغطاء\n\n\n### [البقاء مختص بما هو عند الله‏]\n\n\nقال الله عز وجل الله نُورُ السَّماواتِ والْأَرْضِ فله السناء وقال إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ فله ولنا السناء بصعودنا إليه وقال وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ‏\n\n\n> فنحن وما عندنا عنده *** وليس الذي عنده عندنا\n\n\nوما عِنْدَ الله باقٍ قلنا ولما عندنا البقاء فهو وإن نفد ما عندنا من عندنا فإنه لا ينفد من عنده وما عِنْدَ الله خَيْرٌ وأَبْقى‏ وما عند الله إلا العالم والله خير وأبقى ممن هو عنده كذا قال الله سبحانه في كتابه خَيْرٌ وأَبْقى‏ لأن بقاء العالم إذا وصف بالوجود بإبقائه وإذا أبقيناه على حاله مع ظهور أحكامه في عين الوجود فله البقاء وهو بكل حال لم يزل في درجة الإمكان‏\nفهي له باقية فهو خير وأبقى لأن له الحكم في عين الوجود والحكم لا يزال باقيا فهو خير وأبقى ممن هو منه خير وأبقى في هذا الحكم لما أعطى من العلم بنفسه للعالم به والله خير وأبقى لأنه لو لا بقاء عينه ما كان لحكم هذا الممكن فيما يظهر فهو خير وأبقى ممن هو عنده خير وأبقى فخير وأبقى ممن هو خير وأبقى‏\n\n\n> فعندية الحق ما عندها *** سوانا وما عندنا من سواه‏\n\n\n> فخيرية الحق مشهودة *** وخيرية الكون ما لا نراه‏\n\n\n> فلما حمانا أرانا حمانا *** فلما رأيناه كنا حماه‏\n\n\n> فمنه إلينا ومنا إليه *** فعين ضلالتنا من هداه‏\n\n\n> فللعبد في ذا وذاك الذي *** رأيناه من حكمه ما نواه‏\n\n\nفأعيان العالم محفوظون في خزائنه عنده وخزائنه علمه ومختزنه نحن فنحن أثبتنا له حكم الاختزان لأنه ما علمنا إلا منا فكان طريقا وسطا بين شيئية ثبوتنا وشيئية وجودنا فإذا أراد أن ينقلنا إلى شيئية وجودنا أمرنا عليه فاكتسينا الوجود منه فظهرنا بصورته في شيئية وجودنا وصورته ما نحن عليه في شيئية ثبوت فإن علمه عين ذاته وإنما سمي علما لتعلقه بالمعلوم والتعلق محبة فلو كان العدم وسطا بين شيئية الثبوت وشيئية الوجود لكان إذا أراد إيجادنا مر بنا على العدم فاكتسبنا منه نفي شيئية الثبوت فلم نوجد لا في الثبوت ولا في الوجود فلذلك لم يكن لنا طريق إلا على وجود الحق لنستفيد منه الوجود فتفهم هذا الترتيب فإنه نافع مفيد فإنه يعطيك العلم بحكم المواطن وأنها تحكم بنفسها في كل من ظهر فيها فمن مر على موطن انصبغ به والدليل الواضح في ذلك رؤيتك الله تعالى في النوم وهو موطن الخيال فلا ترى الحق فيه إلا في صورة جسدية كانت تلك الصورة ما كانت فهذا حكم الموطن قد حكم عليك في الحق إنك لا تراه إلا هكذا كما إنك إذا دخلت موطن النظر العقلي وخرجت عن خزانة الخيال وموطنه لم تدرك الحق تعالى إلا منزها عن الصورة التي أدركته فيها في موطن الخيال وإذا كان الحكم للموطن عرفت إذا رأيت الحق ما رأيت وأثبت ذلك للموطن أعني ذلك الحكم حتى يبقى الحق لك مجهولا أبدا فلا يحصل لك منه علم في نفسك إلا بتوحيد المرتبة له وأما إن تعلم ذاته فمحال ذلك لأنك ما تخلو عن موطن تكون فيه يحكم عليك ذلك الموطن بأن لا ترى الحق إلا به فإنك تفارق ما أعطاك من العلم به في موطن آخر فتحكم على الحق في كل موطن بحكم ما هو عين الحكم الذي حكمت به عليه في الموطن الذي قبله فتعرف عند ذلك إنك ما تعرفه من حيث يعرف نفسه وهذا غايتنا من العلم به تعالى فما عندنا منه في موطن ينفد في موطن آخر فما عندنا ينفد وما عند الله باق من علمه بنفسه لا يتغير ولا يتبدل ولا يتنوع لنفسه في نفسه بتنوع المواطن فإن المواطن تنوعها لذاتها ولو لم تتنوع لكانت موطنا واحدا كما أن الأسماء لو لم تختلف معانيها لكانت اسما واحدا كما هي واحد من حيث مسماها في مثل قوله قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ هذا من حيث المسمى فإنه قال أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ فوحد لما أراد المسمى ولم يراع اختلاف الحقائق التي تدل عليه ألفاظ هذه الأسماء الحسنى فإن لم تعلم قوله ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ على ما أعلمتك به فما علمت إلا صورة صحيحة لا روح لها فإذا علمت الأمر كما أعلمتك به نفخت في تلك الصورة الظاهرة روحا تحيي به فكنت خالقا داخلا في جملة من وصف الله نفسه بالفضل عليه في ذلك فقال تعالى فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ فأثبتك وكل من أنشأ صورة بغير روح فذلك هو المصور الذي يعذب بما صوره يوم القيامة بأن يقال له هنالك أحي ما خلقت وليس بمحيي ويقال له انفخ فيها روحا وليس بنافخ وهذا من حكم الموطن لأن ذلك الموطن أعني موطن يوم الحشر يعطي ظهور عجز العالم عما كان ينسب إليه في موطن الدنيا من الاقتدار عليه كان عيسى عليه السلام ينفخ في الطائر الذي خلقه روحا فيكون طائرا بالصورة والمعنى وقيل ليس إلا صورة طائر لا طائرا ولذلك قال عز وجل كَهَيْئَةِ الطَّيْرِ ما قال طيرا حتى حصل فيه الروح وقد ثبت عندنا عن ذي النون المصري أنه أحيا ابن العجوز بإذن الله الذي‏\n\n\nالتقمه التمساح وأن أبا يزيد أحيا النملة بإذن الله كما إن موطن الخيال يعطي في أعين الناظرين حياة الجمادات وحركتها وهي في نفسها ليست بتلك الحياة التي تدركها الأبصار كحبال سحرة موسى ع‏\nوعِصِيُّهُمْ يُخَيَّلُ إلى موسى من سِحْرِهِمْ أَنَّها تَسْعى‏ الذي سَحَرُوا به أَعْيُنَ النَّاسِ فتلك حبال نشأت بين الخيال وبين أعين الناظرين كصورة السماء في المرآة فما هي السماء ولا غير السماء فإنك تعلم قطعا إن الجرم الذي رأيت في المرآة أقل من جرم السماء وأكبر من جرم المرآة وتعلم قطعا إنك ما رأيت إلا السماء عينها فلهذا جعلنا الحكم للمواطن فلا يجي‏ء من العالم أمر يسمى خرق عادة إلا بإذن الله فبغير إذن الله ما يصح ولهذا ما يكون من كل أحد ظهور ذلك وإن كنا نعلم أنه ما يحدث صورة في العالم إلا والحياة تصحبها وهي روحها وبذلك الروح تكون تلك الصورة مسبحة فالروح تسبح الله تعالى والصورة مسبحة بالروح ربها تعالى‏\n\n\n> فقد علمت الذي أقول *** ولست تدري الذي يقول‏\n\n\n> ولست أدري الذي نقول *** فإنه الناطق القوول‏\n\n\nوهذا القدر كاف والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 474, Concerning the State of a Pole (قطب) whose Station (منزله) was: \"What is with you vanishes, and what is with Allah remains\" (Q 16:96)\n\nI am with the One Who has always been with me,\nSo our vanishing ceased, and permanence (البقاء) is ours.\n\nWe shared Existence (الوجود) equally,\nSo the Radiance (السنا) was His, and the Loftiness (السناء) was ours.\n\nThrough Him, look, when I say \"I,\"\nFor we are through Him, for Him, and thus praise (الثناء) is ours.\n\nWe saw Him, without my name, as Unique,\nTranscendent (نزيها), Whom the encounter does not restrain.\n\nBut when He named Himself, He vanished from us,\nAnd the veil (الغطاء) was lowered before our eyes.\n\n### [Permanence (البقاء) is Exclusive to What is with Allah]\n\nAllah, the Mighty and Majestic, said: <<الله نُورُ السَّماواتِ والْأَرْضِ>> (Allah is the Light of the heavens and the earth). Thus, the Loftiness (السناء) belongs to Him. And He said: <<إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ>> (To Him ascends the good word). Thus, the Loftiness is His and ours, through our ascent to Him. And He said: <<وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ‏>> (There is not a thing but with Us are its treasuries).\n\nSo we, and what is with us, are with Him,\nBut what is with Him is not with us.\n\n\"What is with Allah remains\" (Q 16:96). We say: And because permanence (البقاء) belongs to what is with us, even if what is with us vanishes from our perspective, it does not vanish from His perspective. <<وما عِنْدَ الله خَيْرٌ وأَبْقى‏>> (And what is with Allah is better and more lasting) (Q 28:60). And what is with Allah is none other than the World (العالم). And Allah is better and more lasting than that which is with Him.\n\nThus, Allah the Glorified said in His Book: \"better and more lasting\" (خَيْرٌ وأَبْقى‏), because the permanence of the World is described by its existence (الوجود) through His preservation of it. And when we preserve it in its state, along with the manifestation of its rulings (أحكامه) in the very essence of Existence (عين الوجود), permanence belongs to it. Yet, in every state, it has never ceased to be in the degree of possibility (درجة الإمكان). Thus, possibility remains for it. So, He is better and more lasting, because the ruling (الحكم) belongs to Him in the very essence of Existence, and the ruling remains permanent. Thus, He is better and more lasting than that which is better and more lasting than Him in this ruling, due to the Knowledge (العلم) He granted of Himself to the one who knows Him. And Allah is better and more lasting, because were it not for the permanence of His Essence (عينه), the ruling of this possible thing (الممكن) would not exist in what manifests. Thus, He is better and more lasting than that which is with Him and is better and more lasting. So, He is better and more lasting than that which is better and more lasting.\n\nThe \"withness\" (عندية) of the Real (الحق) has nothing with it\nExcept us, and what is with us is from none other than Him.\n\nThe goodness (خيرية) of the Real is witnessed,\nAnd the goodness of the Cosmos (الكون) is what we do not see.\n\nWhen He protected us, He showed us His protection,\nAnd when we saw Him, we became His protection.\n\nFrom Him to us, and from us to Him,\nSo the very essence of our error (ضلالتنا) is from His guidance (هداه).\n\nFor the servant, in this and that,\nWhat we saw of His ruling is what He intended.\n\nThe entities (أعيان) of the World are preserved in His treasuries with Him, and His treasuries are His Knowledge (علمه), and the stored thing is us. Thus, we established for Him the ruling of storage, because He only knew us through us. This served as a middle path (طريقا وسطا) between the thingness of our immutability (شيئية ثبوتنا) and the thingness of our existence (شيئية وجودنا). When He desired to transfer us to the thingness of our existence, He commanded us upon it, and we clothed ourselves in Existence (الوجود) from Him. Thus, we appeared in His form in the thingness of our existence, and His form is what we are in the thingness of immutability (ثبوت). For His Knowledge is the very Essence (عين ذاته), and it is only called Knowledge due to its relation (تعلقه) to the known thing (المعلوم), and this relation is love (محبة).\n\nIf non-existence (العدم) were the middle path between the thingness of immutability and the thingness of existence, then when He desired to bring us into existence, He would pass us through non-existence. We would then acquire from it the negation of the thingness of immutability, and thus we would not exist, neither in immutability nor in existence. Therefore, we had no path except through the Existence of the Real (وجود الحق) so that we might benefit from Existence through Him. Understand this arrangement, for it is beneficial and useful, as it grants you Knowledge (العلم) of the ruling (حكم) of the stations (المواطن), and that they rule by themselves over everyone who manifests within them. Whoever passes through a station is colored by it.\n\nThe clear proof of this is your vision of Allah the Exalted in sleep, which is the station of Imagination (موطن الخيال). You do not see the Real (الحق) therein except in a corporeal form, whatever that form may be. This is the ruling of the station; it has ruled over you concerning the Real that you cannot see Him except in this manner. Just as, when you enter the station of intellectual contemplation (موطن النظر العقلي) and exit the treasury and station of Imagination, you do not apprehend the Real, the Exalted, except as transcendent (منزها) beyond the form in which you apprehended Him in the station of Imagination.\n\nSince the ruling belongs to the station, you know, when you see the Real, what you have seen, and you attribute that ruling to the station. Thus, the Real remains eternally unknown to you, and you gain no Knowledge (علم) of Him within yourself except by affirming the Unity (توحيد) of the Level (المرتبة) for Him. As for knowing His Essence (ذاته), that is impossible, because you are never free from a station in which you reside, and that station rules over you that you shall not see the Real except through it. For you depart from the Knowledge it granted you of Him in another station, and you judge the Real in every station by a ruling that is the very essence of the ruling by which you judged Him in the previous station. You realize then that you do not know Him from the perspective by which He knows Himself. This is the limit of our Knowledge of Him, the Exalted.\n\nThus, what we have of Him in one station vanishes in another station. So, \"what is with us vanishes\" (ما عِنْدَكُمْ يَنْفَدُ), and \"what is with Allah remains\" (وما عِنْدَ الله باقٍ) of His Knowledge of Himself. This Knowledge does not change, nor is it exchanged, nor does it vary for Himself in Himself due to the variation of the stations. For the stations vary due to their own essences. If they did not vary, they would be a single station, just as if the meanings of the Names (الأسماء) did not differ, they would be a single Name. Just as they are one in terms of their Denoted Reality (مسماها), as in His saying: <<قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ>> (Say: Call upon Allah or call upon the All-Merciful). This is in terms of the Denoted Reality, for He said: <<أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏>> (Whichever you call upon, to Him belong the Most Beautiful Names). He unified when He intended the Denoted Reality and did not regard the difference in the realities (الحقائق) indicated by the words of these Beautiful Names.\n\nIf you do not know His saying, \"What is with you vanishes, and what is with Allah remains,\" according to what I have informed you, then you have only known a correct form (صورة صحيحة) without a spirit (روح). But if you know the matter as I have informed you, you breathe a spirit into that manifest form, by which it lives. Thus, you become a creator (خالقا), entering the category of those upon whom Allah described Himself as bestowing favor, for He, the Exalted, said: <<فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ>> (So blessed is Allah, the Best of creators). Thus, He affirmed you. But whoever originates a form without a spirit, that is the image-maker (المصور) who will be punished for what he pictured on the Day of Resurrection, by being told there: \"Give life to what you created,\" and he is not a giver of life; and he will be told: \"Breathe a spirit into it,\" and he is not a breather.\n\nThis is due to the ruling of the station, because that station—I mean the station of the Day of Gathering (يوم الحشر)—causes the manifestation of the creature’s (العالم) inability regarding the power that was attributed to him in the station of the world (موطن الدنيا). Jesus, peace be upon him, would breathe a spirit into the bird he created, and it would become a bird in form and meaning. It is said that it was only the form of a bird, not a bird, which is why He, the Mighty and Majestic, said: <<كَهَيْئَةِ الطَّيْرِ>> (like the shape of a bird), and did not say \"a bird\" until the spirit was placed within it. It is established with us concerning Dhu al-Nun al-Misri that he brought the son of the old woman back to life, by Allah’s permission, after the crocodile swallowed him; and that Abu Yazid brought the ant back to life, by Allah’s permission.\n\nSimilarly, the station of Imagination (موطن الخيال) grants, in the eyes of the beholders, the life and movement of inanimate objects, though in themselves they do not possess the life that the eyes perceive, such as the ropes of the sorcerers of Moses, peace be upon him: <<وعِصِيُّهُمْ يُخَيَّلُ إلى موسى من سِحْرِهِمْ أَنَّها تَسْعى‏>> (and their ropes and staffs seemed to Moses, by their magic, to be moving) (Q 20:66), by which <<سَحَرُوا به أَعْيُنَ النَّاسِ>> (they bewitched the eyes of the people) (Q 7:116). Those ropes were ropes that arose between the Imagination and the eyes of the beholders, like the image of the sky in a mirror. It is neither the sky nor other than the sky. For you know with certainty that the body (الجرم) you saw in the mirror is smaller than the body of the sky and larger than the body of the mirror, yet you know with certainty that you saw nothing but the very sky itself.\n\nFor this reason, we have assigned the ruling to the stations. No matter that is called a breaking of custom (خرق عادة) comes from the creature except by the permission of Allah. Without Allah’s permission, it is not valid. This is why the manifestation of such things does not occur through everyone. Although we know that no form (صورة) occurs in the World except that life accompanies it, and that life is its spirit (روحها). By that spirit, that form is a glorifier (مسبحة). Thus, the spirit glorifies Allah the Exalted, and the form, by means of the spirit, glorifies its Lord, the Exalted.\n\nYou have known what I say,\nBut you do not know the One Who speaks.\n\nAnd I do not know what we say,\nFor He is the Speaker, the Utterer.\n\nThis much is sufficient. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو چوہتر، اس قطب کے حال کے بیان میں جس کی منزل یہ تھی: \"جو کچھ تمہارے پاس ہے وہ ختم ہو جائے گا اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے۔\"\n\nمیں اس کے پاس ہوں جو ہمیشہ میرے پاس رہا *** سو ہماری فنا (الفناء) زائل ہو گئی اور ہمیں بقا (البقاء) حاصل ہو گئی۔\n\nہم نے ہستی (الوجود) کو برابری پر تقسیم کیا *** سو اس کے لیے روشنی (السنا) تھی اور ہمارے لیے عظمت (السناء)۔\n\nاسی کے ذریعے دیکھو جب میں کہتا ہوں \"میں\" *** تو ہم اسی کے ذریعے اس کے لیے ہیں، سو تعریف ہمارے لیے ہے۔\n\nہم نے اسے اس کے ناموں کے بغیر اکیلا دیکھا *** پاکیزہ، جسے ملاقات بھی نہیں روک سکتی۔\n\nپھر جب اس نے نام اختیار کیے تو وہ ہم سے غائب ہو گیا *** اور ہماری آنکھوں کے سامنے پردہ ڈال دیا۔\n\n### [بقا (البقاء) صرف اسی کے لیے خاص ہے جو اللہ کے پاس ہے]\n\nاللہ عزوجل نے فرمایا: \"اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ\" (اللہ آسمانوں اور زمین کا نور ہے)، سو اس کے لیے روشنی (السنا) ہے۔ اور فرمایا: \"إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ\" (اسی کی طرف پاکیزہ کلمات چڑھتے ہیں)، سو اس کے لیے اور ہمارے لیے عظمت (السناء) ہے، ہمارے اس کی طرف چڑھنے کی وجہ سے۔ اور فرمایا: \"وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنا خَزائِنُهُ\" (اور کوئی چیز ایسی نہیں جس کے خزانے ہمارے پاس نہ ہوں)۔\n\nسو ہم اور جو کچھ ہمارے پاس ہے وہ اس کے پاس ہے *** اور جو کچھ اس کے پاس ہے وہ ہمارے پاس نہیں ہے۔\n\nاور \"وَمَا عِنْدَ اللَّهِ بَاقٍ\" (اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے)۔ ہم کہتے ہیں کہ جو کچھ ہمارے پاس ہے اس کے لیے بھی بقا (البقاء) ہے۔ اگرچہ جو کچھ ہمارے پاس ہے وہ ہماری طرف سے ختم ہو جائے، لیکن وہ اس کی طرف سے ختم نہیں ہوتا۔ اور \"وَمَا عِنْدَ اللَّهِ خَيْرٌ وَأَبْقَى\" (اور جو کچھ اللہ کے پاس ہے وہ بہتر اور زیادہ باقی رہنے والا ہے)۔ اور اللہ کے پاس عالم (کائنات) کے سوا کچھ نہیں ہے۔ اور اللہ اس سے بہتر اور زیادہ باقی رہنے والا ہے جو اس کے پاس ہے۔ اللہ سبحانہ نے اپنی کتاب میں اسی طرح فرمایا: \"خَيْرٌ وَأَبْقَى\" (بہتر اور زیادہ باقی رہنے والا)۔ کیونکہ عالم کی بقا، جب اسے ہستی (الوجود) کے ساتھ موصوف کیا جاتا ہے، تو وہ اس کے باقی رکھنے سے ہے۔ اور جب ہم اسے اس کی حالت پر باقی رکھتے ہیں، جبکہ اس کے احکام عین ہستی (الوجود) میں ظاہر ہوتے ہیں، تو اس کے لیے بقا (البقاء) ہے۔ اور وہ ہر حال میں ہمیشہ امکان (الإمكان) کے درجے میں رہا ہے۔\n\nسو یہ بقا اس کے لیے باقی رہنے والی ہے۔ پس وہ بہتر اور زیادہ باقی رہنے والا ہے کیونکہ عین ہستی (الوجود) میں حکم اسی کا ہے، اور حکم ہمیشہ باقی رہتا ہے۔ سو وہ اس سے بہتر اور زیادہ باقی رہنے والا ہے جو اس سے بہتر اور زیادہ باقی رہنے والا ہے، اس حکم میں، اس علم کی وجہ سے جو اس نے اپنے نفس کے بارے میں اس عالم کو عطا کیا جو اسے جانتا ہے۔ اور اللہ بہتر اور زیادہ باقی رہنے والا ہے، کیونکہ اگر اس کی ذات کی بقا نہ ہوتی تو اس ممکن کے حکم کا کوئی ظہور نہ ہوتا۔ سو وہ اس سے بہتر اور زیادہ باقی رہنے والا ہے جو اس کے پاس بہتر اور زیادہ باقی رہنے والا ہے۔ پس وہ اس سے بہتر اور زیادہ باقی رہنے والا ہے جو بہتر اور زیادہ باقی رہنے والا ہے۔\n\nسو ذات حق (الحق) کی عندیت (اس کے پاس ہونا) کے پاس ہمارے سوا کچھ نہیں *** اور جو کچھ ہمارے پاس ہے وہ اس کے سوا کسی سے نہیں ہے۔\n\nسو ذات حق (الحق) کی خیریت مشہود (الشہود) ہے *** اور کائنات کی خیریت وہ ہے جسے ہم نہیں دیکھتے۔\n\nپھر جب اس نے ہماری حفاظت کی تو ہمیں اپنی حفاظت دکھائی *** پھر جب ہم نے اسے دیکھا تو ہم اس کی حفاظت بن گئے۔\n\nسو اس کی طرف سے ہماری طرف اور ہماری طرف سے اس کی طرف *** پس ہماری گمراہی کا عین اس کی ہدایت سے ہے۔\n\nسو بندے کے لیے اس میں اور اس میں، جو کچھ ہم نے اس کے حکم سے دیکھا *** وہی ہے جس کی اس نے نیت کی۔\n\nسو عالم کی ذاتیں اس کے خزانوں میں اس کے پاس محفوظ ہیں۔ اور اس کے خزانے اس کا علم ہیں، اور اس کا مختزن (جسے خزانے میں رکھا گیا) ہم ہیں۔ سو ہم نے اس کے لیے اختزان (خزانے میں رکھنے) کا حکم ثابت کیا، کیونکہ اس نے ہمیں نہیں جانا مگر ہم سے۔ سو یہ ہمارے ثبوت (شیئیت ثبوت) اور ہماری ہستی (شیئیت وجود) کے درمیان ایک درمیانی راستہ تھا۔ پس جب وہ ہمیں ہماری ہستی (شیئیت وجود) کی طرف منتقل کرنا چاہتا ہے تو ہم پر حکم کرتا ہے، سو ہم اس سے ہستی (الوجود) کا لباس پہنتے ہیں، اور اس کی صورت میں اپنی ہستی (شیئیت وجود) میں ظاہر ہوتے ہیں۔ اور اس کی صورت وہی ہے جس پر ہم اپنی ثبوتیت (شیئیت ثبوت) میں ہیں۔ کیونکہ اس کا علم عین اس کی ذات ہے، اور اسے علم صرف معلوم سے تعلق کی وجہ سے کہا گیا ہے، اور یہ تعلق محبت ہے۔ اگر عدم (العدم) ثبوتیت (شیئیت ثبوت) اور ہستی (شیئیت وجود) کے درمیان ہوتا، تو جب وہ ہمیں وجود میں لانا چاہتا تو ہم عدم سے گزرتے، اور اس سے ثبوتیت کی نفی حاصل کرتے، سو ہم نہ ثبوت میں پائے جاتے اور نہ ہستی میں۔ اسی لیے ہمارے لیے ذات حق (الحق) کی ہستی (الوجود) کے سوا کوئی راستہ نہیں تھا تاکہ ہم اس سے ہستی (الوجود) حاصل کریں۔ سو اس ترتیب کو سمجھو، کیونکہ یہ نفع بخش اور مفید ہے۔ یہ تمہیں مقامات (المواطن) کے حکم کا علم دیتا ہے، اور یہ کہ وہ خود ہی ہر اس شخص پر حکم کرتے ہیں جو ان میں ظاہر ہوتا ہے۔ سو جو کسی مقام سے گزرتا ہے وہ اس کے رنگ میں رنگ جاتا ہے۔ اور اس کی واضح دلیل یہ ہے کہ تم اللہ تعالیٰ کو خواب میں دیکھتے ہو، اور یہ مقامِ خیال (موطن الخیال) ہے۔ سو تم ذات حق کو اس میں صرف ایک جسمانی صورت میں دیکھتے ہو، خواہ وہ صورت کچھ بھی ہو۔ سو یہ مقام کا حکم ہے جس نے تم پر ذات حق کے بارے میں حکم لگایا کہ تم اسے صرف اسی طرح دیکھو گے۔ جیسا کہ جب تم عقلی نظر کے مقام (موطن النظر العقلی) میں داخل ہوتے ہو اور خیال کے خزانے اور اس کے مقام سے باہر نکلتے ہو، تو تم ذات حق تعالیٰ کو صرف اس صورت سے پاک سمجھتے ہو جس میں تم نے اسے مقامِ خیال میں پایا تھا۔ اور جب حکم مقام کا ہو، تو تم جان لیتے ہو کہ جب تم ذات حق کو دیکھتے ہو تو تم نے کیا دیکھا، اور تم اس حکم کو مقام کے لیے ثابت کرتے ہو، تاکہ ذات حق تمہارے لیے ہمیشہ مجہول (نامعلوم) رہے۔ سو تمہیں اس سے اپنے نفس میں کوئی علم حاصل نہیں ہوتا مگر اس کے لیے مرتبے کی توحید کے ساتھ۔ لیکن یہ کہ تم اس کی ذات کو جانو، یہ محال ہے، کیونکہ تم کسی ایسے مقام سے خالی نہیں ہوتے جس میں تم ہو، اور وہ مقام تم پر حکم کرتا ہے کہ تم ذات حق کو صرف اسی کے ذریعے دیکھو۔ پس تم اس علم سے جدا ہو جاتے ہو جو اس نے تمہیں ایک دوسرے مقام میں عطا کیا تھا، اور تم ہر مقام میں ذات حق پر اسی حکم کے ساتھ حکم لگاتے ہو جو عین وہی حکم ہے جو تم نے اس سے پہلے والے مقام میں اس پر لگایا تھا۔ سو تم اس وقت جان لیتے ہو کہ تم اسے اس طرح نہیں جانتے جس طرح وہ خود کو جانتا ہے۔ اور یہی اس کے بارے میں ہمارے علم کی انتہا ہے۔ سو جو کچھ ہمارے پاس ایک مقام میں اس کی طرف سے ہوتا ہے وہ دوسرے مقام میں ختم ہو جاتا ہے۔ پس جو کچھ ہمارے پاس ہے وہ ختم ہو جاتا ہے، اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے، اس کے اپنے نفس کے علم سے، جو نہ بدلتا ہے، نہ تبدیل ہوتا ہے، اور نہ ہی مقامات کے تنوع سے اپنے نفس میں اپنے لیے متنوع ہوتا ہے۔ کیونکہ مقامات کا تنوع ان کی اپنی ذات کی وجہ سے ہے، اور اگر وہ متنوع نہ ہوتے تو وہ ایک ہی مقام ہوتے۔ جیسا کہ اگر اسماء کے معانی مختلف نہ ہوتے تو وہ ایک ہی اسم ہوتے، جیسا کہ وہ اپنے مسمیٰ کے لحاظ سے ایک ہیں، جیسے اس کے قول میں: \"قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمنَ\" (کہو، اللہ کو پکارو یا رحمن کو پکارو)۔ یہ مسمیٰ کے لحاظ سے ہے۔ کیونکہ اس نے فرمایا: \"أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى\" (تم جس نام سے بھی پکارو، اسی کے لیے سب اچھے نام ہیں)۔ سو اس نے وحدت بیان کی جب اس نے مسمیٰ کا ارادہ کیا، اور ان اسماء حسنیٰ کے الفاظ جن حقائق پر دلالت کرتے ہیں ان کے اختلاف کو ملحوظ نہیں رکھا۔ پس اگر تم اس کے قول \"مَا عِنْدَكُمْ يَنْفَدُ وَمَا عِنْدَ اللَّهِ بَاقٍ\" (جو کچھ تمہارے پاس ہے وہ ختم ہو جائے گا اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے) کو اس طرح نہ جانو جس طرح میں نے تمہیں بتایا ہے، تو تم نے صرف ایک صحیح صورت جانی ہے جس میں روح نہیں ہے۔ لیکن جب تم اس امر کو جان لیتے ہو جیسا کہ میں نے تمہیں بتایا ہے، تو تم اس ظاہری صورت میں ایک روح پھونکتے ہو جس سے وہ زندہ ہو جاتی ہے، سو تم خالق بن جاتے ہو اور ان لوگوں میں شامل ہو جاتے ہو جن پر اللہ نے اس بارے میں فضل کے ساتھ اپنی صفت بیان کی، سو اللہ تعالیٰ نے فرمایا: \"فَتَبارَكَ اللَّهُ أَحْسَنُ الْخالِقِينَ\" (پس بابرکت ہے اللہ جو سب سے اچھا پیدا کرنے والا ہے)۔ سو اس نے تمہیں ثابت کیا، اور ہر وہ شخص جو روح کے بغیر کوئی صورت بناتا ہے، تو وہ مصور ہے جسے قیامت کے دن اس کی بنائی ہوئی صورت کی وجہ سے عذاب دیا جائے گا، اس طرح کہ اسے وہاں کہا جائے گا: \"جو تم نے پیدا کیا ہے اسے زندہ کرو\"، اور وہ زندہ کرنے والا نہیں ہو گا، اور اسے کہا جائے گا: \"اس میں روح پھونکو\"، اور وہ پھونکنے والا نہیں ہو گا۔ اور یہ مقام کے حکم میں سے ہے، کیونکہ وہ مقام، یعنی مقامِ روزِ حشر، عالم کی عاجزی کو ظاہر کرتا ہے اس چیز سے جسے وہ دنیا کے مقام میں اپنی قدرت کی طرف منسوب کرتا تھا۔ عیسیٰ علیہ السلام اس پرندے میں جسے وہ بناتے تھے روح پھونکتے تھے، سو وہ صورت اور معنی کے لحاظ سے پرندہ بن جاتا تھا۔ اور کہا گیا ہے کہ وہ صرف پرندے کی صورت تھی، پرندہ نہیں، اسی لیے اللہ عزوجل نے فرمایا: \"كَهَيْئَةِ الطَّيْرِ\" (پرندے کی شکل جیسا)، یہ نہیں فرمایا کہ \"طَيْراً\" (پرندہ)، یہاں تک کہ اس میں روح داخل ہو گئی۔ اور ہمارے نزدیک ذوالنون مصری سے یہ ثابت ہے کہ انہوں نے اس بڑھیا کے بیٹے کو زندہ کیا جسے مگرمچھ نے نگل لیا تھا، اللہ کے اذن سے، اور یہ کہ ابو یزید نے چیونٹی کو زندہ کیا اللہ کے اذن سے۔\n\nجیسا کہ مقامِ خیال (موطن الخیال) دیکھنے والوں کی آنکھوں میں بے جان چیزوں کی زندگی اور حرکت کو ظاہر کرتا ہے، حالانکہ وہ اپنی ذات میں وہ زندگی نہیں ہوتیں جسے آنکھیں دیکھتی ہیں، جیسے موسیٰ علیہ السلام کے جادوگروں کی رسیاں اور ان کی لاٹھیاں: \"يُخَيَّلُ إِلَى مُوسَى مِنْ سِحْرِهِمْ أَنَّهَا تَسْعَى\" (ان کے جادو کے زور سے موسیٰ کو خیال ہوا کہ وہ دوڑ رہی ہیں)، جس کے ذریعے انہوں نے \"سَحَرُوا أَعْيُنَ النَّاسِ\" (لوگوں کی آنکھوں پر جادو کر دیا)۔ سو وہ رسیاں خیال اور دیکھنے والوں کی آنکھوں کے درمیان پیدا ہوئیں، جیسے آئینے میں آسمان کی صورت۔ سو وہ نہ آسمان ہے اور نہ آسمان کے علاوہ کچھ اور۔ کیونکہ تم یقیناً جانتے ہو کہ جو جسم تم نے آئینے میں دیکھا وہ آسمان کے جسم سے چھوٹا ہے اور آئینے کے جسم سے بڑا ہے۔ اور تم یقیناً جانتے ہو کہ تم نے عین آسمان ہی کو دیکھا ہے۔ اسی لیے ہم نے حکم کو مقامات کے لیے قرار دیا ہے۔ سو عالم کی طرف سے کوئی ایسا امر ظاہر نہیں ہوتا جسے خرقِ عادت کہا جائے مگر اللہ کے اذن سے۔ سو اللہ کے اذن کے بغیر وہ صحیح نہیں ہوتا۔ اور اسی لیے یہ ہر کسی سے ظاہر نہیں ہوتا، اگرچہ ہم جانتے ہیں کہ عالم میں کوئی صورت پیدا نہیں ہوتی مگر یہ کہ زندگی اس کے ساتھ ہوتی ہے، اور وہی اس کی روح ہے۔ اور اسی روح کے ذریعے وہ صورت تسبیح کرنے والی ہوتی ہے۔ سو روح اللہ تعالیٰ کی تسبیح کرتی ہے، اور صورت روح کے ذریعے اپنے رب تعالیٰ کی تسبیح کرتی ہے۔\n\nسو تم نے جان لیا جو میں کہتا ہوں *** اور تم نہیں جانتے جو وہ کہتا ہے۔\n\nاور میں نہیں جانتا جو ہم کہتے ہیں *** کیونکہ وہی بولنے والا، بہت کہنے والا ہے۔\n\nاور یہ مقدار کافی ہے۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و هفتاد و چهارم در بیان حال قطبی که منزل او «آنچه نزد شماست تمام می‌شود و آنچه نزد خداست باقی می‌ماند» (ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ) بود.\n\nمن نزد کسی هستم که همواره نزد من بوده است\nپس زوال و فنای ما از میان رفت و بقا از آنِ ما شد\n\nهستی (الوجود) را به تساوی تقسیم کردیم\nپس نور (السنا) از آنِ او بود و رفعت (السناء) از آنِ ما\n\nپس بنگر، آنگاه که می‌گویم «من»\nما به واسطه او از آنِ اوییم، پس ستایش از آنِ ماست\n\nاو را بدون نام‌هایم، یگانه دیدیم\nپاک و منزه، که دیدار (اللقاء) او را محدود نمی‌کند\n\nاما چون نامی بر خود نهاد، از ما پنهان شد\nو پرده‌ای در برابر چشمان ما آویخت\n\n### [بقا مختص به چیزی است که نزد خداست]\n\nخداوند عز و جل فرمود: «الله نور آسمان‌ها و زمین است» (الله نُورُ السَّماواتِ والْأَرْضِ)، پس رفعت (السناء) از آنِ اوست. و فرمود: «سخنان پاکیزه به سوی او بالا می‌روند» (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ)، پس رفعت به واسطه صعود ما به سوی او، از آنِ او و از آنِ ماست. و فرمود: «و هیچ چیزی نیست مگر آنکه خزانه‌های آن نزد ماست» (وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ).\n\nپس ما و آنچه نزد ماست، نزد اوست\nو آنچه نزد اوست، نزد ما نیست\n\n«و آنچه نزد خداست باقی می‌ماند» (وما عِنْدَ الله باقٍ). ما می‌گوییم: و چون بقا از آنِ ماست، پس اگرچه آنچه نزد ماست از جانب ما تمام شود (نفد)، از جانب او تمام نمی‌شود. «و آنچه نزد خداست بهتر و پایدارتر است» (وما عِنْدَ الله خَيْرٌ وأَبْقى‏). و آنچه نزد خداست، جز عالَم نیست. و خداوند بهتر و پایدارتر است از کسی که نزد اوست. این‌گونه خداوند سبحان در کتاب خود فرموده است: «بهتر و پایدارتر» (خَيْرٌ وأَبْقى‏). زیرا بقای عالَم، هنگامی که به هستی (الوجود) توصیف می‌شود، به واسطه باقی نگه داشتن اوست. و اگر ما آن را بر حال خود باقی بگذاریم، با ظهور احکامش در عین هستی (الوجود)، بقا از آنِ اوست. و او در هر حال، همواره در درجه امکان (الإمكان) بوده است.\nپس بقا برای اوست. او بهتر و پایدارتر است، زیرا حکم در عین هستی (الوجود) از آنِ اوست و حکم همواره باقی است. پس او بهتر و پایدارتر است از کسی که از اوست، و در این حکم بهتر و پایدارتر است به سبب علمی که به نفس خود به عالِم عطا کرده است. و خداوند بهتر و پایدارتر است، زیرا اگر بقای ذات او نبود، حکم این ممکن در آنچه ظاهر می‌شود، وجود نمی‌یافت. پس او بهتر و پایدارتر است از کسی که نزد اوست و بهتر و پایدارتر است. پس او بهتر و پایدارتر است از کسی که بهتر و پایدارتر است.\n\nپس «نزد بودن» (عندية) حق، چیزی جز ما نزد خود ندارد\nو آنچه نزد ماست، از غیر او نیست\n\nپس «بهتر بودن» (خیرية) حق مشهود است\nو «بهتر بودن» (خیرية) کائنات چیزی است که ما نمی‌بینیم\n\nپس چون ما را حمایت کرد، حمایت خود را به ما نشان داد\nو چون او را دیدیم، ما حمایت او بودیم\n\nپس از او به سوی ما و از ما به سوی اوست\nپس عین گمراهی ما از هدایت اوست\n\nپس بنده در این و آن، آنچه را که از حکم او دیدیم، قصد کرده است\n\nپس اعیان عالَم در خزانه‌های او نزد او محفوظند، و خزانه‌های او علم اوست، و آنچه در آن ذخیره شده، ما هستیم. پس ما حکم ذخیره‌سازی را برای او اثبات کردیم، زیرا او ما را جز از طریق ما نشناخت. پس این (علم) راهی میانه بود بین «شیئیت ثبوت» ما و «شیئیت وجود» ما. پس هرگاه اراده کند که ما را به «شیئیت وجود» ما منتقل سازد، امر خود را بر ما جاری می‌سازد، پس ما هستی (الوجود) را از او می‌پوشیم و با صورت او در «شیئیت وجود» خود ظاهر می‌شویم. و صورت او همان چیزی است که ما در «شیئیت ثبوت» بر آن هستیم. زیرا علم او عین ذات اوست، و تنها به دلیل تعلقش به معلوم، علم نامیده شده است، و این تعلق، محبت است. اگر عدم (نیستی) واسطه‌ای بین «شیئیت ثبوت» و «شیئیت وجود» بود، آنگاه که اراده می‌کرد ما را ایجاد کند، ما را از عدم عبور می‌داد و ما از آن، نفی «شیئیت ثبوت» را کسب می‌کردیم و نه در ثبوت و نه در وجود، موجود نمی‌شدیم. به همین دلیل، ما راهی جز بر هستی (الوجود) حق نداشتیم تا هستی (الوجود) را از او کسب کنیم. پس این ترتیب را بفهم، زیرا سودمند و مفید است؛ چرا که علم به حکم مواطن (عوالم/مکان‌ها) را به تو می‌دهد و اینکه آنها خودشان بر هر کس که در آنها ظاهر شود، حکم می‌کنند.\n\nپس هر کس از موطنی عبور کند، به رنگ آن درمی‌آید. و دلیل واضح بر این امر، دیدن خداوند متعال در خواب است، که موطن خیال است. در آنجا حق را جز در صورتی جسمانی نمی‌بینی، هر صورتی که باشد. این حکم موطن است که بر تو در مورد حق حکم کرده است که او را جز این‌گونه نبینی. همان‌طور که اگر وارد موطن نظر عقلی شوی و از خزانۀ خیال و موطن آن خارج گردی، حق تعالی را جز منزه از صورتی که او را در موطن خیال درک کرده بودی، درک نخواهی کرد. و چون حکم از آنِ موطن است، اگر حق را ببینی، می‌دانی که چه دیده‌ای و آن حکم را به موطن نسبت می‌دهی، تا حق برای تو همواره مجهول باقی بماند. پس در نفس خود از او علمی حاصل نمی‌کنی مگر با توحید مرتبه برای او. اما اینکه ذات او را بدانی، محال است؛ زیرا تو از موطنی که در آن هستی خالی نیستی، و آن موطن بر تو حکم می‌کند که حق را جز به واسطه آن نبینی. زیرا آنچه را که از علم به او در یک موطن به دست آورده‌ای، در موطن دیگر رها می‌کنی و در هر موطنی بر حق حکمی می‌کنی که عین همان حکمی است که در موطن قبلی بر او کرده بودی. در این هنگام می‌دانی که او را از آن حیث که خودش، خود را می‌شناسد، نمی‌شناسی. و این نهایت علم ما به او تعالی است. پس آنچه از او در یک موطن نزد ماست، در موطن دیگر تمام می‌شود (ینفد). پس آنچه نزد ماست تمام می‌شود (ینفد)، و آنچه نزد خداست از علم او به نفس خود باقی می‌ماند؛ نه تغییر می‌کند، نه تبدیل می‌شود و نه برای نفس خود در نفس خود به واسطه تنوع مواطن، متنوع می‌گردد. زیرا تنوع مواطن به خاطر ذات آنهاست، و اگر متنوع نبودند، یک موطن بودند. همان‌طور که اگر معانی اسماء مختلف نبود، یک اسم بودند، چنانکه از حیث مسمای خود واحدند، مانند این فرموده: «بگو: الله را بخوانید یا رحمان را بخوانید» (قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ). این از حیث مسمی است، زیرا فرمود: «هر کدام را بخوانید، پس نام‌های نیکو از آنِ اوست» (أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏). پس چون مسمی را اراده کرد، وحدت بخشید و اختلاف حقایقی را که الفاظ این اسماء حسنی بر آن دلالت می‌کنند، در نظر نگرفت.\n\nپس اگر فرموده او «آنچه نزد شماست تمام می‌شود و آنچه نزد خداست باقی می‌ماند» (ما عِنْدَكُمْ يَنْفَدُ وما عِنْدَ الله باقٍ) را بر اساس آنچه به تو آموختم ندانی، جز صورتی صحیح و بی‌روح ندانسته‌ای. و اگر امر را چنان که به تو آموختم بدانی، در آن صورت ظاهر، روحی می‌دمی که با آن زنده می‌شود، و بدین ترتیب خالقی خواهی بود که داخل در زمرۀ کسانی می‌شوی که خداوند خود را به فضل بر آنان توصیف کرده است، و فرموده است: «پس پر برکت است خدا، بهترین آفرینندگان» (فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ). پس تو را اثبات کرد. و هر کس صورتی بدون روح ایجاد کند، او همان صورتگری است که در روز قیامت به سبب آنچه صورتگری کرده عذاب می‌شود، به این صورت که در آنجا به او گفته می‌شود: آنچه را آفریدی زنده کن، در حالی که او زنده کننده نیست؛ و به او گفته می‌شود: در آن روح بدم، در حالی که او دمنده نیست. و این از حکم موطن است، زیرا آن موطن، یعنی موطن روز حشر، ناتوانی عالَم را از آنچه در موطن دنیا از اقتدار به خود نسبت می‌داد، آشکار می‌سازد.\n\nعیسی علیه السلام در پرنده‌ای که خلق می‌کرد، روح می‌دمید و آن پرنده هم از نظر صورت و هم از نظر معنی، پرنده می‌شد. و گفته شده است که آن فقط صورت پرنده بود نه پرنده، و به همین دلیل خداوند عز و جل فرمود: «مانند هیئت پرنده» (كَهَيْئَةِ الطَّيْرِ)، و نگفت «پرنده» تا زمانی که روح در آن حاصل شود. و نزد ما ثابت شده است که ذوالنون مصری پسر پیرزنی را که تمساح او را بلعیده بود، به اذن خدا زنده کرد، و ابویزید نیز مورچه‌ای را به اذن خدا زنده کرد. همان‌طور که موطن خیال در چشمان بینندگان، حیات و حرکت جمادات را نشان می‌دهد، در حالی که آن حیات در نفس خود، آن حیاتی نیست که ابصار درک می‌کنند؛ مانند ریسمان‌های ساحران موسی علیه السلام و «عصاهایشان که از سحرشان به نظر موسی می‌آمد که حرکت می‌کنند» (عِصِيُّهُمْ يُخَيَّلُ إلى موسى من سِحْرِهِمْ أَنَّها تَسْعى‏) که با آن چشمان مردم را سحر کردند. پس آن ریسمان‌ها، میان خیال و چشمان بینندگان پدید آمدند، مانند صورت آسمان در آینه. پس نه خود آسمان است و نه غیر آسمان. زیرا تو قطعاً می‌دانی که جرمی که در آینه دیده‌ای، کوچک‌تر از جرم آسمان و بزرگ‌تر از جرم آینه است، و قطعاً می‌دانی که جز عین آسمان را ندیده‌ای. به همین دلیل، حکم را از آنِ مواطن قرار دادیم. پس هیچ امری که خرق عادت نامیده می‌شود، از عالَم صادر نمی‌شود مگر به اذن خدا. بدون اذن خدا صحیح نیست. و به همین دلیل، ظهور آن از هر کسی رخ نمی‌دهد، اگرچه می‌دانیم که هیچ صورتی در عالَم پدید نمی‌آید مگر اینکه حیات همراه آن باشد و آن حیات، روح آن صورت است. و به واسطه آن روح، آن صورت تسبیح‌کننده است. پس روح، خداوند متعال را تسبیح می‌کند و صورت نیز به واسطه روح، پروردگار متعال خود را تسبیح می‌کند.\n\nتو آنچه را که من می‌گویم دانستی\nاما آنچه را که او می‌گوید نمی‌دانی\n\nو من آنچه را که ما می‌گوییم نمی‌دانم\nزیرا اوست که سخنگوی بسیار گویاست\n\nو این مقدار کافی است. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}