{
  "id": 307,
  "title": {
    "ar": "الباب السابع وثلاثمائة في معرفة منزل تنزل الملائكة على الموقف المحمدي من الحضرة الموسوية المحمدية",
    "en": "Chapter Three Hundred and Seven: Concerning the knowledge of the station (منزل) of the descent of the angels upon the Muhammadan Station (الموقف المحمدي), from the Mosaic-Muhammadan Presence (الحضرة الموسوية المحمدية).",
    "ur": "باب تین سو سات: حضرہ موسویہ محمدیہ (الحضرة الموسوية المحمدية) سے موقف محمدی (الموقف المحمدي) پر ملائکہ کے نزول کی منزل کی معرفت (معرفۃ) کا بیان۔",
    "fa": "باب سیصد و هفتم در معرفت منزل نزول فرشتگان بر موقف محمدی از حضرت موسوی محمدی"
  },
  "content": {
    "ar": "## «الباب السابع وثلاثمائة في معرفة منزل تنزل الملائكة على الموقف المحمدي من الحضرة الموسوية المحمدية»\n\n\n> تنسمت أرواح العلى حين هبت *** ومرت سحبرا بالرياض فنمت‏\n\n\n> أ في عالم الأنفاس من هو مثلنا *** وهل حبهم فيها كمثل محبتي‏\n\n\n> فقال لسان الحق إن مسيركم *** على السنة المثلى دليل تتمتي‏\n\n\n> فأظهرت عنكم سر جودي ونقمتي *** وأخفيت فيكم سر علمي وحكمتي‏\n\n\n> فمن كان ذا عين يرى ما جلوته *** ومن كان أعمى فهو من أصل حيرتي‏\n\n\n> فكل مقام فهو من عين جوده *** وكل كيان فهو من أصل نشأتي‏\n\n\n### [أن الله جعل من السماء إلى الأرض معارج على عدد الخلائق‏]\n\n\nاعلم أيها الولي الحميم أن الله جعل من السماء إلى الأرض معارج على عدد الخلائق وما في السموات موضع قدم إلا وهو معمور بملك يسبح الله ويذكره بما قد حد له من الذكر ولله تعالى في الأرض من الملائكة مثل ذلك لا يصعدون إلى السماء أبدا وأهل السموات لا ينزلون إلى الأرض أبدا كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ وأن لله تعالى أرواحا من الملائكة الكرام مسخرة قد ولاهم الله تعالى وجعل بأيديهم ما أوحى الله في السموات من الأمور التي قد شاء سبحانه أن يجريها في عالم العناصر وجعل سبحانه معارج الملائكة من الكرسي إلى السموات ينزلون بالأوامر الإلهية المخصوصة بأهل السموات وهي أمور فرقانية وجعل من العرش إلى الكرسي معارج لملائكة ينزلون إلى الكرسي بالكلمة الواحدة غير منقسمة إلى الكرسي فإذا أوصلت الكلمة واحدة العين إلى الكرسي انفرقت فرقا على قدر ما أراد الرحمن أن يجري منها في عالم الخلق والأمر ومن النفس رقائق ممتدة إلى العرش منقسمة إلى فرقتين للقوتين اللتين النفس عليهما وهو اللوح المحفوظ وهو ذو وجهين وتلك الرقائق التي بين اللوح والعرش بمنزلة المعارج للملائكة والمعاني النازلة في تلك الرقائق كالملائكة ومن النفس التي هي اللوح إلى العقل الذي هو القلم توجهات استفادة ومن العقل إليها توجهات إفادة ذاتية لا اختيار له فيها يحصل عن تلك التوجهات من العلوم للنفس بما يكون في الكون ما لا يحصى كثرة ومن‏\nالعقل إلى الله افتقار ذاتي ومن الله إلى العقل إمداد ذاتي عن تجل إرادي فيعلم من علوم التفصيل في ذلك التجلي الإجمالي ما يزيده فقرا إلى فقره وعجزا إلى عجزه لا ينفك ولا يبرح على هذه الحالة فينزل الأمر الإلهي في ذلك التجلي الإرادي بالإمداد الذاتي إلى العقل فيظهر في التوجهات العقلية إلى التوجهات النفسية ذلك الأمر الإلهي بصورة عقلية بعد ما كان في صورة أسمائية فاختلفت على ذلك الأمر الإلهي الصور بحسب الموطن الذي ينزل إليه فينصبغ في كل منزل صبغة ثم ينزل ذلك الأمر الإلهي في الرقائق النفسية بصورة نفسية لها ظاهر وباطن وغيب وشهادة فتتلقاه الرقائق الشوقية العرشية فتأخذه منها فينصبغ في العرش صورة عرشية فينزل في المعارج إلى الكرسي على أيدي الملائكة وهو واحد العين غير منقسم في عالم الخلق وقد كان نزل من النفس إلى العرش منقسما انقسام عالم الأمر فلما انصبغ بأول عالم الخلق وهو العرش ظهر في وحدانيته الخلق وهو أول وحدانية الخلق وهو أول وحدانية الخلق فهو من حيث الأمر منقسم ومن حيث الخلق واحد العين كالصوت الخارج من الصدر إلى خارج الفم عين واحدة لا يظهر فيه كمية أصلا فتقسمه المخارج إلى حروف متعددة تزيد على السبعين وهو عين ذلك الصوت الواحد فينصبغ ذلك الأمر الإلهي في الكرسي بصورة غير الصورة التي كان عليها وما من صورة ينصبغ فيها ويظهر بها إلا والأخرى التي كان عليها مبطونة فيه لا تزول عنه والأولى أبدا من كل صورة روح للصورة التي تظهر فيها من أول الأمر إلى آخر منزل تلك الروح تمد هذه الصورة الظاهرة فينزل الأمر الإلهي من الكرسي على معراجه إلى السدرة إن كان لعالم السموات القصد وإن كان لعالم الجنان لم ينزل من ذلك الموضع وظهر سلطانه في الجنان بحسب ما نزل إليه إما في حورها أو في أشجارها أو في ولدانها أو حيث عين له من الجنان فإذا نزل إلى السموات على معراجه نزلت معه ملائكة ذلك المقام النازل منه ومعه قوى أنوار الكواكب لا تفارقه فتتلقاه ملائكة السدرة فتأخذه من الملائكة النازلة به وترجع تلك الملائكة بما تعطيها ملائكة السدرة من الأمور الصاعدة من الأرض فتأخذها وترجع بها وتبقي أرواح الكواكب معه فإن كان فيه مما تحتاج الجنة إليه من جهة ما فيها من النبات أخذته من السدرة العلية وفروعها في كل دار في الجنة وهي شجرة النور وإليها تنتهي حقائق الأشجار العلوية الجنانية والسفلية الأرضية وأصولها شجرة الزقوم وفروع أصلها كل شجر مر وسموم في عالم العناصر كما إن كل نبات طيب حلو المذاق فمن ظاهر السدرة في الدنيا والجنة فهذه السدرة عمرت الدنيا والآخرة فهي أصل النبات والنمو في جميع الأجسام في الدنيا والجنة والنار وعليها من النور والبهاء بحيث أن يعجز عن وصفها كل لسان من كل عالم ثم إن الأمر الإلهي يتفرع في السدرة كما تتفرع أغصان الشجرة ويظهر فيه صور الثمرات بحسب ما يمده من العالم الذي ينزل إليه وقد انصبغ بصورة السدرة فينزل على المعراج إلى السماء الأولى فيتلقاه أهلها بالترحيب وحسن القبول والفرح ويتلقاه من أرواح الأنبياء والخلق الذين قبضت أرواحهم بالموت وكان مقرها هنالك وتتلقاهم الملائكة المخلوقة من همم العارفين في الأرض وتجد هنالك نهر الحياة يمشي إلى الجنة فإن كان له عنده أمانة ولا بد منها في كل أمر إلهي فإن الأمر الإلهي يعم جميع الموجودات فيلقيه في ذلك النهر مثل ما أعطى السدرة فيجري به النهر إلى الجنان وفي كل نهر يجده هنالك مما يمشي إلى الجنة وهنالك يجد النيل والفرات فيلقي إليهما ما أودع الله عنده من الأمانة التي ينبغي أن تكون لهما فتنزل تلك البركة في النهرين إلى الأرض فإنهما من أنهار الأرض ويأخذ أرواح الأنبياء وملائكة الهمم وعمار السماء الأولى منه ما بيده مما نزل به إليهم ويدخل البيت المعمور فيبتهج به وتسطع الأنوار في جوانبه وتأتي الملائكة السبعون ألفا الذين يدخلونه كل يوم ولا يعودون إليه أبدا وهم ملائكة قد خلقهم الله من قطرات ماء نهر الحياة فإن جبريل عليه السلام ينغمس في نهر الحياة كل يوم غمسته فيخرج فينتفض كما ينتفض الطائر فيقطر منه في ذلك الانتفاض سبعون ألف قطرة يخلق الله من كل قطرة ملكا كما يخلق الإنسان من الماء في الرحم فيخلق سبعين ألف‏\n\n\nملك من تلك السبعين ألف قطرة بسبعين ألف ملك الذين يدخلون البيت المعمور كل يوم‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الحديث الصحيح في البيت المعمور إنه يدخله كل يوم سبعون ألف ملك لا يعودون إليه أبدا\n\n\nفانظر ما أوسع‏\nملك الله ثم ينصب المعراج من السماء الأولى إلى السماء الثانية فينزل فيه الأمر الإلهي وهو على صورة السماء الأولى فينصبغ بصورة المعراج الذي ينزل فيه ومعه الملائكة الموكلون به من السماء الأولى ومعه أرواح البروج والكواكب الثابتة كلها وينزل معه ملك من قوة كيوان لا بد من ذلك فإذا وصل إلى السماء الثانية تلقته ملائكتها وما فيها من أرواح الخلائق المتوفين وملائكة الهمم وقوة بهرام الذي في السماء الثانية فيعطيهم ما بيده لهم وينزل إلى الثالثة وهو على صورة الثانية فينصبغ بصورة السلم الذي ينزل فيه والحال الحال مثل ما ذكرنا إلى أن ينتهي إلى السماء السابعة وهي السماء الدنيا فإذا أدى إليهم ما بيده لهم ومعه قوة صاحب كل سماء فتحت أبواب السماء لنزوله ونزلت معه قوى جميع الكواكب الثوابت والسيارة وقوى الأفلاك وقوى الحركات الفلكية كلها وكل صورة انتقل عنها مبطونة فيه فكل أمر إلهي ينزل فهو اسم إلهي عقلي نفسي عرشي كرسي فهو مجموع صور كل ما مر عليه في طريقه فيخترق الكور ويؤثر في كل كرة بحسب ما تقبله طبيعتها إلى أن ينتهي إلى الأرض فيتجلى لقلوب الخلق فتقبله بحسب استعداداتها وقبولها متنوع وذلك هو الخواطر التي تجدها الناس في قلوبهم فبها يسعون وبها يشتهون وبها يتحركون طاعة كانت تلك الحركة أو معصية أو مباحة فجميع حركات العالم من معدن ونبات وحيوان وإنسان وملك أرضي وسماوي فمن ذلك التجلي الذي يكون من هذا الأمر الإلهي النازل إلى الأرض فيجد الناس في قلوبهم خواطر لا يعرفون أصلها وهذا هو أصلها ورسله إلى جميع ما في العالم الذي نزل إليه ما نزل معه من قوى الكواكب وحركات الأفلاك فهؤلاء هم رسل هذا الأمر الإلهي إلى حقائق هؤلاء العالم فتنمو به الناميات وتحيي به أمور ويموت به أمور ويظهر التأثيرات العلوية والسفلية في كل عالم بتلك الرسل التي يرسلها في العالم هذا الأمر الإلهي فإنه كالملك فيهم ولا يزال يعقبه أمر آخر ويعقب الآخر آخر في كل نفس بتقدير العزيز العليم فإذا نفذ فيهم أمره وأراد الرجوع جاءته رسله من كل موجود بما ظهر من كل من بعثوا إليه صورا قائمة فيلبسها ذلك الأمر الإلهي من قبيح وحسن ويرجع على معراجه من حيث جاء إلى أن يقف بين يدي ربه اسما إلهيا ظاهرا بكل صورة فيقبل منها الحق ما شاء ويرد منها ما شاء على صاحبها في صور تناسبها فجعل مقر تلك الصور حيث شاء من علمه فلا يزال تتابع الرسل إلى الأرض على هذه المعارج كما ذكرنا فلنذكر من ذلك حال أهل الله مع هذا الأمر الإلهي إذا نزل إليهم وذلك أن المحقق من أهل الله يعاين نزوله وتخلفه في الجو في الكور إذا فارق السماء الدنيا نازلا ثلاث سنين وحينئذ يظهر في الأرض فكل شي‏ء يظهر في كل شي‏ء في الأرض فعند انقضاء ثلاث سنين من نزوله من السماء في كل زمان فرد ومن هنا ينطق أكثر أهل الكشف بالغيوب التي تظهر عنهم فإنهم يرونها قبل نزولها ويخبرون بما يكون منها في السنين المستقبلة وما تعطيهم أرواح الكواكب وحركات الأفلاك النازلة في خدمة الأمر الإلهي فإذا عرف المنجم كيف يأخذ من هذه الحركات ما فيها من الآثار أصاب الحكم وكذلك الكاهن والعرافون إذا صدقوا وعرفوا ما يكون قبل كونه أي قبل ظهور أثر عينه في الأرض وإلا فمن أين يكون في قوة الإنسان أن يعلم ما يحدث من حركات الأفلاك في مجاريها ولكن التناسب الروحاني الذي بيننا وبين أرواح الأفلاك العالمين بما تجري به في الخلق ينزل بصورتها التي اكتسبته من تلك الحركات والأنوار الكوكبية على أوزانها فإن لها مقادير ما تخطئ وهمة هذا المنجم التعالي وهمة هذا الكاهن قد انصبغت روحانيته بما توجهت إليه همته فوقعت المناسبة بينه وبين مطلوبه فأفاضت عليه روحانية المطلوب بما فيها في وقت نظره فحكم بالكوائن الطارئة في المستقبل وأما العارفون فإنهم عرفوا إن لله وجها خاصا في كل موجود فهم لا ينظرون أبدا إلى كل شي‏ء من حيث أسبابه وإنما ينظرون فيه من الوجه الذي لهم من الحق فينظر بعين حق فلا يخطئ أبدا فإذا نزل الأمر الإلهي على قلب هذا العارف وقد لبس من الصور بحسب ما مر عليه من المنازل كما قررناه فأول صورة كان ظهر\n\n\nبها للعقل الأول صورة إلهية أسمائية وهي خلف هذه الصور كلها وهذا العارف همه أبدا مصروف إلى الوجه الخاص الإلهي الذي في كل موجود بعين الوجه الخاص الإلهي الذي لهذا العارف المحقق فينظر في ذلك الأمر من حيث‏\nالصورة الأولى الإلهية ويترك الوسائط وينزل من تلك الصورة على جميع الصور من أعلى إلى أسفل وفي كل صورة ما ينظر إليها إلا من حيث ذلك الوجه الخاص بها بوجهه الخاص به إلى أن ينتهي على جميع الصور فيعرف من ذلك الأمر الإلهي جميع ما في العالم من العقل الأول إلى الأرض من الأسرار الإلهية حين يعلم الكاهن أو العراف وأمثال هؤلاء ما يكون في العالم العنصري خاصة من الحوادث ثم إن العارف يكسو ذلك الأمر الإلهي من حلل الأدب والحضور الإلهي في أخذه منه والنور والبهاء ما إذا صعد به الأمر الإلهي على معراجه تتعجب منه ملائكة السموات العلى فيباهي الله به ملائكته ويقول هذا عبد جعل في الحضيض وفي أسفل سافلين بالنسبة إليكم فما أثر فيه منزله ولا حكم عليه موطنه ولا حجبته عني كثرة حجبه وخرق الكل ونظر إلي وأخذ عني فكيف به لو كان مثلكم بلا حجب ظلمانية كثيفة عنصرية فيقول السامعون المخاطبون سبحانك ذلك فضلك تختص به من تشاء من عبادك منة منك ورحمة وأنت ذو الفضل العظيم فلا يضاهي هذا العبد أحد من خلق الله إلا العقل الأول والملائكة المقربون المهيمون وما ثم قلب بهذه المثابة من هذا العالم إلا قلوب الأفراد من رجال الله كالخضر وأمثاله وهم على قدم محمد صَلَّى اللهُ عَليهِ وسَلَّم فهذا قد ذكرنا يسيرا من صورة تنزل الملائكة على قلب المحمدي الواقف ويتضمن هذا المنزل من العلوم علم الأرواح العلوية والأرواح البرزخية وعلم ما يفتح الله به على الصادق في طلب العلم النافع وعلم التمييز والترجيح وعلم الإلقاء واللقاء والكتابة وعلم القرآن وعلم ما يكون وعلم الغيب وعلم المقادير وعلم رد الأشياء إلى أصولها وعلم الذهاب وعلم الآخرة وعلم إلحاق الثاني بالأول وعلم نش‏ء العالم وعلم الاستقرار في المكان والمكانة وعلم الحياة وعلم طول العالم وعرضه وعمقه ومن أين اكتسبه وعلم حوادث الجو وما سببها وهي الآثار العلوية وعلم مواطن الصمت والكلام وعلم الجمع والتفرقة وهو من علم النسب وعلم دقائق المكر وعلم التقوى أي الذي تنتجه التقوى في قوله واتَّقُوا الله ويُعَلِّمُكُمُ الله وأين منه قوله إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً وعلم الإحسان أي ما ينتجه الإحسان وعلم الإمهال من اسمه الحليم وعلم الحقائق وعلم الخشوع وعلم منزلة كلام الله من كلام المخلوقين والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ فإنه أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً وأَحْصى‏ كُلَّ شَيْ‏ءٍ عَدَداً والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 307: On the Gnosis of the Station of the Descent of the Angels upon the Muhammadan Standpoint, from the Muhammadan Mosaic Presence\n\nThe spirits of the High (Realms) breathed gently when they blew,\nAnd passed at dawn over the gardens, causing them to grow.\n\nIs there anyone like us in the world of breaths (souls)?\nAnd is their love within it like my love?\n\nThen the Tongue of the Real (لسان الحق) said: \"Indeed, your journeying\nUpon the most excellent Sunna is the proof of My perfection.\"\n\n\"I manifested through you the secret of My generosity and My vengeance,\nAnd I concealed within you the secret of My Knowledge and My Wisdom.\"\n\n\"Whoever possesses an eye sees what I have unveiled,\nAnd whoever is blind, he is from the root of My perplexity.\"\n\n\"Every spiritual station (مقام) is from the very source of His generosity,\nAnd every existence (كيان) is from the origin of My creation.\"\n\n### [That Allah has made ascents (معارج) from the Heaven to the Earth equal to the number of creatures]\n\nKnow, O intimate friend (الولي الحميم), that Allah has made ascents (معارج) from the heaven to the earth equal to the number of creatures (الخلائق). There is no space the size of a footstep in the heavens except that it is inhabited by an angel who glorifies Allah and remembers Him with the specific remembrance (الذكر) that has been prescribed for him. And Allah Almighty has angels on the earth likewise, who never ascend to the heaven, just as the inhabitants of the heavens never descend to the earth. <<كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ>> (Each one knows its prayer and its glorification).\n\nFurthermore, Allah Almighty has spirits (أرواح) of noble angels (الملائكة الكرام) subjugated, whom Allah Almighty has appointed and placed in their hands the matters that Allah has revealed in the heavens, which the Glorious One willed to execute in the elemental world (عالم العناصر). The Glorious One also established the ascents (معارج) for the angels from the Footstool (الكرسي) to the heavens, by which they descend with the Divine Commands (الأوامر الإلهية) specific to the inhabitants of the heavens, and these are matters of distinction (أمور فرقانية).\n\nAnd He established ascents from the Throne (العرش) to the Footstool (الكرسي) for angels who descend to the Footstool with the Single Word (الكلمة الواحدة), undivided, until it reaches the Footstool. When the Word, which is one in essence (واحدة العين), reaches the Footstool, it divides into parts according to what the Merciful intended to execute from it in the world of Creation (عالم الخلق) and the world of Command (عالم الأمر).\n\nFrom the Soul (النفس) there are subtle extensions (رقائق) stretching to the Throne (العرش), divided into two sections corresponding to the two powers upon which the Soul rests. This is the Preserved Tablet (اللوح المحفوظ), and it possesses two faces. Those subtle extensions between the Tablet and the Throne are in the position of ascents (معارج) for the angels, and the meanings (المعاني) descending through those extensions are like the angels.\n\nFrom the Soul (النفس), which is the Tablet (اللوح), to the Intellect (العقل), which is the Pen (القلم), there are orientations of acquisition (توجهات استفادة). And from the Intellect to the Soul, there are orientations of essential bestowal (توجهات إفادة ذاتية) in which the Intellect has no choice. From these orientations, the Soul acquires sciences concerning what will occur in the cosmos (الكون) that are countless in number.\n\nFrom the Intellect to Allah, there is essential need (افتقار ذاتي). And from Allah to the Intellect, there is essential sustenance (إمداد ذاتي) resulting from a volitional Self-disclosure (تجل إرادي). Thus, the Intellect learns detailed sciences (علوم التفصيل) within that comprehensive Self-disclosure (التجلي الإجمالي), which only increases its neediness and its incapacity. It never ceases or departs from this state.\n\nThe Divine Command (الأمر الإلهي) then descends within that volitional Self-disclosure, through the essential sustenance, to the Intellect. It appears in the intellectual orientations towards the psychic orientations in an intellectual form (صورة عقلية), after having been in a form related to the Divine Names (صورة أسمائية). The forms assumed by that Divine Command thus vary according to the station (الموطن) to which it descends, and it is dyed with a specific color (صبغة) in every station.\n\nThen that Divine Command descends into the psychic subtle extensions (الرقائق النفسية) in a psychic form (صورة نفسية) which has an outer aspect, an inner aspect, an unseen aspect, and a witnessed aspect. The yearning subtle extensions (الرقائق الشوقية) of the Throne receive it and take it from the psychic extensions, whereupon it is dyed in the Throne with a Throne-like form (صورة عرشية).\n\nIt then descends through the ascents (المعارج) to the Footstool (الكرسي) by the hands of the angels, being one in essence (واحد العين) and undivided in the world of Creation (عالم الخلق). It had previously descended from the Soul to the Throne, divided according to the division of the world of Command (عالم الأمر). But when it was dyed by the first part of the world of Creation, which is the Throne, it appeared in its created unity (وحدانيته الخلق), which is the first unity of Creation. Thus, from the perspective of Command, it is divided, but from the perspective of Creation, it is one in essence, like the sound emerging from the chest to outside the mouth: a single essence (عين واحدة) in which no quantity appears at all, but the points of articulation (المخارج) divide it into multiple letters exceeding seventy, yet it is the very essence of that single sound.\n\nThat Divine Command is then dyed in the Footstool (الكرسي) with a form different from the one it previously held. There is no form in which it is dyed and by which it appears, except that the previous form it held remains latent (مبطونة) within it and does not depart from it. The first form is always the spirit (روح) for the form in which it appears, from the beginning of the Command until the last station; that spirit sustains this manifest form.\n\nThe Divine Command then descends from the Footstool (الكرسي) upon its ascent path (معراجه) to the Lote Tree (السدرة), if the destination is the world of the heavens. If the destination is the world of the Gardens (الجنان), it does not descend from that location, but its authority appears in the Gardens according to what descended to it, whether in its houris, its trees, its youths (ولدان), or wherever in the Gardens was designated for it.\n\nWhen it descends to the heavens upon its ascent path, the angels of that descending station descend with it, accompanied by the powers of the lights of the stars (أنوار الكواكب), which never leave it. The angels of the Lote Tree (السدرة) receive it and take it from the descending angels. Those descending angels return with the matters ascending from the earth, which the angels of the Lote Tree give them; they take these matters and return with them.\n\nBut the spirits of the stars (أرواح الكواكب) remain with the Command. If the Command contains anything the Garden (الجنة) needs concerning its vegetation, it takes it from the Exalted Lote Tree (السدرة العلية), whose branches are in every abode in the Garden. This is the Tree of Light (شجرة النور), and to it terminate the realities (حقائق) of the celestial trees of the Garden and the terrestrial trees of the earth. Its roots are the Zaqqūm Tree, and the branches of its root are every bitter and poisonous tree in the elemental world (عالم العناصر). Just as every pleasant, sweet-tasting plant is from the manifest aspect (ظاهر) of the Lote Tree in this world and the Garden. This Lote Tree has populated the world and the Hereafter; it is the origin of vegetation and growth in all bodies in this world, the Garden, and the Fire. It possesses such light (النور) and splendor (البهاء) that every tongue in every world is incapable of describing it.\n\nThen the Divine Command branches out in the Lote Tree just as the branches of a tree branch out, and the forms of the fruits appear in it according to the sustenance it receives from the world to which it descends. Having been dyed with the form of the Lote Tree, it descends upon the ascent path (المعراج) to the First Heaven. Its inhabitants receive it with welcome, good acceptance, and joy. It is received by the spirits of the Prophets (أرواح الأنبياء) and the creatures whose souls were taken by death and whose abode was there. It is also received by the angels created from the spiritual aspirations (همم) of the Gnostics (العارفين) on earth.\n\nThere, one finds the River of Life (نهر الحياة) flowing towards the Garden. If the Command has a trust (أمانة) with it—which is necessary in every Divine Command, for the Divine Command encompasses all existing things—it casts it into that river, just as it gave to the Lote Tree, and the river carries it to the Gardens. In every river flowing towards the Garden that it finds there, and there it finds the Nile (النيل) and the Euphrates (الفرات), it casts into them the trust that Allah deposited with it, which is appropriate for them. That blessing (البركة) then descends through the two rivers to the earth, for they are among the rivers of the earth.\n\nThe spirits of the Prophets, the angels of aspirations (ملائكة الهمم), and the inhabitants of the First Heaven take from the Command what it holds that descended to them. It enters the Frequented House (البيت المعمور), which rejoices in it, and lights (الأنوار) shine forth in its surroundings. The seventy thousand angels who enter it every day and never return to it come forth. These are angels whom Allah created from drops of the water of the River of Life. For Gabriel (عليه السلام) immerses himself in the River of Life every day. He emerges and shakes himself, just as a bird shakes itself, and seventy thousand drops fall from him in that shaking. Allah creates from every drop an angel, just as He creates man from water in the womb. Thus, seventy thousand angels are created from those seventy thousand drops, corresponding to the seventy thousand angels who enter the Frequented House every day.\n\nThe Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) said in the sound Hadith concerning the Frequented House: \"Seventy thousand angels enter it every day, and they never return to it.\"\n\nLook then, how vast is the dominion of Allah!\n\nThen the ascent path (المعراج) is established from the First Heaven to the Second Heaven. The Divine Command descends through it, retaining the form of the First Heaven, but it is dyed with the form of the ascent path through which it descends. It is accompanied by the angels entrusted with it from the First Heaven, and the spirits of all the constellations (البروج) and fixed stars (الكواكب الثابتة). An angel from the power of Saturn (كيوان) must also descend with it.\n\nWhen it reaches the Second Heaven, it is received by its angels, the spirits of the deceased creatures within it, the angels of aspirations (ملائكة الهمم), and the power of Mars (بهرام) which is in the Second Heaven. It gives them what it holds for them. It descends to the Third Heaven, retaining the form of the Second, and is dyed with the form of the ladder (السلم) through which it descends. The situation remains the same as we have described until it reaches the Seventh Heaven, which is the lowest heaven (السماء الدنيا).\n\nWhen it has delivered what it holds for them, accompanied by the power of the ruler of each heaven, the gates of the heaven are opened for its descent. The powers of all the fixed stars and wandering stars (السيارة), the powers of the spheres (الأفلاك), and the powers of all the celestial movements descend with it. Every form it has transitioned from remains latent (مبطونة) within it. Thus, every Divine Command that descends is a Divine Name (اسم إلهي), intellectual (عقلي), psychic (نفسي), Throne-like (عرشي), and Footstool-like (كرسي). It is the aggregate of the forms of everything it passed through on its path.\n\nIt penetrates the spheres (الكور) and affects each sphere according to what its nature accepts, until it reaches the earth. There, it manifests (يتجلى) to the hearts of the creatures, who receive it according to their predispositions (استعداداتها), and their acceptance is varied. This is the origin of the passing thoughts (الخواطر) that people find in their hearts. By them, they strive, by them, they desire, and by them, they move, whether that movement is an act of obedience, disobedience, or merely permissible.\n\nAll movements in the world—mineral, vegetable, animal, human, and terrestrial and celestial angel—originate from that Self-disclosure (التجلي) which comes from this Divine Command descending to the earth. People find thoughts in their hearts whose origin they do not know, but this is their origin. Its messengers to everything in the world to which it descends are the powers of the stars (قوى الكواكب) and the movements of the spheres (حركات الأفلاك) that descended with it. These are the messengers of this Divine Command to the realities (حقائق) of this world. By it, growing things grow; by it, matters are brought to life, and by it, matters die. The celestial and terrestrial influences (التأثيرات) appear in every world through those messengers that this Divine Command sends into the world, for it is like a king among them. It is continuously followed by another command, and that one by yet another, in every breath, by the decree of the Almighty, the All-Knowing (العزيز العليم).\n\nWhen its command has been executed among them and it desires to return, its messengers come to it from every existing thing, bringing the manifest results from everyone to whom they were sent, as established forms (صورا قائمة). That Divine Command then clothes itself in these forms, both ugly and beautiful. It returns upon its ascent path (معراجه) from whence it came, until it stands before its Lord as a Divine Name (اسما إلهيا) manifest in every form. The Real (الحق) accepts from these forms what He wills and returns what He wills to its owner in forms appropriate to them. He establishes the abode of those forms wherever He wills in His Knowledge (علم).\n\nThe succession of messengers to the earth continues upon these ascents as we have mentioned. Let us now mention the state of the People of Allah (أهل الله) concerning this Divine Command when it descends to them.\n\nThe realized one (المحقق) among the People of Allah witnesses its descent and its delay in the atmosphere (الجو) within the spheres (الكور) for three years after it leaves the lowest heaven (السماء الدنيا) descending. Only then does it appear on earth. Everything that appears in anything on earth occurs at the end of three years from its descent from the heaven, in every unique time. It is from this that most of the People of Unveiling (أهل الكشف) speak of the unseen matters (الغيوب) that become manifest through them, for they see them before their descent and inform about what will occur from them in future years, and of what the spirits of the stars and the movements of the spheres, descending in the service of the Divine Command, grant them.\n\nIf the astrologer (المنجم) knows how to derive the effects (الآثار) contained within these movements, he will judge correctly. Likewise, the soothsayer (الكاهن) and the diviners (العرافون), if they are truthful and know what will be before its being—that is, before the effect of its essence appears on earth. Otherwise, how could it be within the power of man to know what occurs from the movements of the spheres in their courses? Rather, it is the spiritual correspondence (التناسب الروحاني) between us and the spirits of the spheres, who know what they execute in creation. This knowledge descends in the form that the spirits acquired from those movements and stellar lights (الأنوار الكوكبية), according to their measures, for they possess infallible measures. The spiritual aspiration (همة) of the astrologer is high, while the spiritual nature (روحانيته) of the soothsayer has been dyed by what his aspiration was directed towards. Thus, a correspondence (المناسبة) occurs between him and his object of desire, and the spirituality of the desired object pours upon him what it contains at the moment of his contemplation, allowing him to judge the contingent events (الكوائن الطارئة) of the future.\n\nAs for the Gnostics (العارفون), they know that Allah has a specific Face (وجها خاصا) in every existing thing. They never look at anything from the perspective of its causes (أسبابه), but rather look at it from the Face that belongs to them from the Real (الحق). Thus, they look with the eye of the Real and never err.\n\nWhen the Divine Command descends upon the heart of this Gnostic, having clothed itself in forms according to the stations it passed through, as we established, the very first form by which it appeared to the First Intellect (العقل الأول) was a Divine Form related to the Names (صورة إلهية أسمائية), and this form is behind all these subsequent forms. The aspiration (همة) of this Gnostic is always directed towards the specific Divine Face (الوجه الخاص الإلهي) present in every existing thing, by means of the specific Divine Face belonging to this realized Gnostic. He thus looks at that Command from the perspective of the first Divine Form, abandoning the intermediaries (الوسائط). He descends from that form upon all the subsequent forms, from the highest to the lowest. In every form, he looks at it only from the perspective of its specific Face, using his own specific Face, until he encompasses all the forms. Through that Divine Command, he knows all the Divine Secrets (الأسرار الإلهية) in the world, from the First Intellect down to the earth. This is in contrast to the soothsayer or diviner and their like, who only know the contingent events (الحوادث) that occur specifically in the elemental world (العالم العنصري).\n\nFurthermore, the Gnostic clothes that Divine Command, when receiving it, in robes of spiritual courtesy (الأدب) and Divine Presence (الحضور الإلهي), and in such light (النور) and splendor (البهاء) that when the Divine Command ascends with it upon its ascent path, the angels of the highest heavens marvel at it. Allah boasts of him to His angels, saying: \"This is a servant placed in the lowest depths (الحضيض) and the lowest of the low (أسفل سافلين) compared to you. His station did not affect him, his abode did not rule over him, nor did the multiplicity of his veils conceal him from Me. He tore through everything, looked upon Me, and took from Me. How would he be if he were like you, without dense, elemental, dark veils?\"\n\nThe listeners who are addressed say: \"Glory be to You! That is Your favor (فضلك). You single out whomever You will among Your servants for it, as a grace (منة) and a mercy from You. And You are the Possessor of Great Bounty (ذو الفضل العظيم).\"\n\nNo one among Allah's creation rivals this servant except the First Intellect (العقل الأول) and the Cherubic Angels (الملائكة المقربون المهيمون). And there is no heart of this caliber in this world except the hearts of the Solitaries (الأفراد) among the Men of Allah (رجال الله), such as Al-Khidr and his like, and they are upon the footstep (قدم) of Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم).\n\nThis is a brief account we have mentioned concerning the form of the descent of the angels upon the heart of the Muhammadan Standpoint (القلب المحمدي الواقف). This station (المنزل) encompasses the sciences of the celestial spirits (الأرواح العلوية) and the spirits of the Isthmus (الأرواح البرزخية); the science of what Allah opens up for the sincere seeker of beneficial knowledge; the science of distinction (التمييز) and preference (الترجيح); the science of casting (الإلقاء), meeting (اللقاء), and writing (الكتابة); the science of the Quran; the science of what shall be; the science of the Unseen (الغيب); the science of measures (المقادير); the science of returning things to their origins; the science of departure; the science of the Hereafter; the science of attaching the second to the first; the science of the world's origination; the science of settling in place and status; the science of life; the science of the world's length, width, and depth, and whence it acquired them; the science of atmospheric events and their causes, which are the celestial influences (الآثار العلوية); the science of the stations of silence and speech; the science of gathering and dispersal (الجمع والتفرقة), which is part of the science of relationships (علم النسب); the science of the subtleties of cunning (المكر); the science of piety (التقوى)—that is, what piety produces, as in His saying: <<وَاتَّقُوا اللهَ وَيُعَلِّمُكُمُ اللهُ>> (And fear Allah, and Allah will teach you); and how far removed from this is His saying: <<إِنْ تَتَّقُوا اللهَ يَجْعَلْ لَكُمْ فُرْقاناً>> (If you fear Allah, He will grant you a criterion [for judgment]); the science of excellence (الإحسان)—that is, what excellence produces; the science of granting respite (الإمهال) derived from His Name, the Forbearing (الحليم); the science of Realities (الحقائق); the science of reverence (الخشوع); and the science of the rank of Allah's Speech compared to the speech of creatures.\n\n<<وَاللهُ بِكُلِّ شَيْءٍ عَلِيمٌ>> (And Allah is All-Knowing of everything), for <<أَحاطَ بِكُلِّ شَيْءٍ عِلْماً>> (He encompasses everything in knowledge) and <<أَحْصىٰ كُلَّ شَيْءٍ عَدَداً>> (He has enumerated everything in number). And Allah speaks the Truth, and He guides to the Way.",
    "ur": "باب نمبر تین سو سات: محمدی مقام (الموقف المحمدي) پر موسیٰ و محمدی حضور (الحضرة الموسوية المحمدية) سے فرشتوں کے نزول کے مقام کی معرفت میں\n\nجب بلندیوں کی روحیں چلیں تو انہوں نے سانس لی، اور سحر کے وقت باغوں سے گزریں تو انہیں نمو بخشی۔\nکیا عالمِ انفاس میں کوئی ہماری مانند ہے؟ اور کیا ان کی محبت اس میں میری محبت جیسی ہے؟\nپس لسانِ حق (ذات حق) نے فرمایا کہ تمہارا سفر سنتِ مثلیٰ پر میری تکمیل کی دلیل ہے۔\nپس میں نے تمہارے ذریعے اپنے جود (سخاوت) اور اپنی نقمت (انتقام) کا راز ظاہر کیا، اور تم میں اپنے علم اور اپنی حکمت کا راز پوشیدہ رکھا۔\nپس جو صاحبِ نظر ہے وہ دیکھتا ہے جو میں نے جلوہ گر کیا، اور جو نابینا ہے وہ میری اصلِ حیرت سے ہے۔\nپس ہر مقام (مقام) اس کے جود (سخاوت) کے عین سے ہے، اور ہر وجود (کیان) میری اصلِ نشأت سے ہے۔\n\n[بے شک اللہ نے آسمان سے زمین تک مخلوقات کی تعداد کے مطابق معراجیں (سیڑھیاں) بنائی ہیں]\n\nاے قریبی ولی! جان لو کہ اللہ تعالیٰ نے آسمان سے زمین تک مخلوقات کی تعداد کے مطابق معراجیں (سیڑھیاں) بنائی ہیں۔ اور آسمانوں میں کوئی جگہ قدم رکھنے کے برابر بھی ایسی نہیں مگر وہ ایک فرشتے سے آباد ہے جو اللہ کی تسبیح کرتا ہے اور اس ذکر کے ساتھ یاد کرتا ہے جو اس کے لیے مقرر کر دیا گیا ہے۔ اور اللہ تعالیٰ کے لیے زمین میں بھی اسی طرح کے فرشتے ہیں جو کبھی آسمان پر نہیں چڑھتے، اور آسمانوں کے رہنے والے کبھی زمین پر نہیں اترتے۔ \"ہر ایک اپنی نماز اور اپنی تسبیح کو جانتا ہے\" (كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ)۔\n\nاور یہ کہ اللہ تعالیٰ کے لیے معزز فرشتوں کی مسخر روحیں ہیں جنہیں اللہ تعالیٰ نے والی بنایا ہے اور ان کے ہاتھوں میں وہ امور سونپے ہیں جو اللہ نے آسمانوں میں وحی کیے ہیں اور جنہیں وہ سبحانہ عالمِ عناصر میں جاری کرنا چاہتا ہے۔ اور اس (سبحانہ) نے فرشتوں کے لیے کرسی (الکرسی) سے آسمانوں تک معراجیں بنائیں جن سے وہ آسمانوں کے رہنے والوں کے لیے مخصوص اوامر الٰہیہ (الأوامر الإلهية) لے کر اترتے ہیں، اور یہ فرقانی امور ہیں۔ اور اس نے عرش (العرش) سے کرسی (الکرسی) تک فرشتوں کے لیے معراجیں بنائیں جو کرسی پر ایک واحد کلمہ لے کر اترتے ہیں جو تقسیم شدہ نہیں ہوتا۔ پس جب وہ واحد العین (ایک ہی حقیقت) کلمہ کرسی تک پہنچتا ہے تو وہ اتنے حصوں میں تقسیم ہو جاتا ہے جتنا رحمن عالمِ خلق و امر میں اس میں سے جاری کرنا چاہتا ہے۔ اور نفس (النفس) سے عرش (العرش) تک لطیف پردے (رقائق) پھیلے ہوئے ہیں جو ان دو قوتوں کے لیے دو حصوں میں تقسیم ہیں جن پر نفس قائم ہے۔ اور یہ لوح محفوظ (اللوح المحفوظ) ہے جو دو رخ رکھتا ہے۔ اور وہ لطیف پردے جو لوح اور عرش کے درمیان ہیں، فرشتوں کے لیے معراجوں کی مانند ہیں، اور ان لطیف پردوں میں نازل ہونے والے معانی فرشتوں کی طرح ہیں۔ اور نفس (جو کہ لوح ہے) سے عقل (جو کہ قلم ہے) کی طرف استفادے کے رجحانات (توجهات استفادة) ہیں، اور عقل سے نفس کی طرف ذاتی افادے کے رجحانات (توجهات إفادة ذاتية) ہیں جن میں اسے کوئی اختیار نہیں ہوتا۔ ان رجحانات کے نتیجے میں نفس کے لیے کائنات میں ہونے والے امور کے بارے میں بے شمار علوم حاصل ہوتے ہیں۔\n\nاور عقل (العقل) سے اللہ کی طرف ذاتی محتاجی (افتقار ذاتي) ہے، اور اللہ سے عقل کی طرف ارادی ظہور الٰہی (تجلی إرادي) کے ذریعے ذاتی امداد (إمداد ذاتي) ہے۔ پس وہ اس اجمالی ظہور الٰہی (التجلی) میں تفصیلی علوم جانتا ہے جو اس کی محتاجی میں مزید محتاجی اور اس کی عاجزی میں مزید عاجزی کا اضافہ کرتے ہیں، اور وہ اس حالت سے کبھی جدا نہیں ہوتا۔ پس وہ امر الٰہی (الأمر الإلهي) اس ارادی ظہور الٰہی (التجلی) میں ذاتی امداد کے ساتھ عقل پر نازل ہوتا ہے، اور وہ امر الٰہی (الأمر الإلهي) اسمائی صورت میں ہونے کے بعد عقلی رجحانات سے نفسی رجحانات کی طرف عقلی صورت میں ظاہر ہوتا ہے۔ پس اس امر الٰہی (الأمر الإلهي) پر اس مقام کے مطابق صورتیں بدلتی رہتی ہیں جہاں وہ نازل ہوتا ہے، اور وہ ہر منزل میں ایک رنگ اختیار کرتا ہے۔ پھر وہ امر الٰہی (الأمر الإلهي) نفسی لطیف پردوں (الرقائق النفسية) میں نفسی صورت میں نازل ہوتا ہے جس کا ظاہر، باطن، غیب اور شہادت ہوتی ہے۔ پس عرشی شوقیہ لطیف پردے (الرقائق الشوقية العرشية) اسے وصول کرتے ہیں اور اسے ان سے لے لیتے ہیں، پس وہ عرش میں عرشی صورت میں رنگ جاتا ہے۔\n\nپس وہ فرشتوں کے ہاتھوں معراجوں کے ذریعے کرسی (الکرسی) پر نازل ہوتا ہے، اور وہ عالمِ خلق میں واحد حقیقت (واحد العين) ہوتا ہے جو تقسیم شدہ نہیں ہوتا۔ حالانکہ وہ نفس (النفس) سے عرش (العرش) تک عالمِ امر کی تقسیم کے مطابق تقسیم شدہ نازل ہوا تھا۔ لیکن جب وہ عالمِ خلق کے پہلے حصے یعنی عرش میں رنگا گیا تو وہ خلق کی وحدانیت میں ظاہر ہوا، اور یہ خلق کی پہلی وحدانیت ہے۔ پس وہ امر کے لحاظ سے تقسیم شدہ ہے اور خلق کے لحاظ سے واحد حقیقت (واحد العين) ہے، جیسے سینے سے منہ کے باہر نکلنے والی آواز ایک ہی حقیقت ہوتی ہے جس میں کوئی مقدار ظاہر نہیں ہوتی، پھر مخارج اسے ستر سے زائد متعدد حروف میں تقسیم کر دیتے ہیں، حالانکہ وہ اسی ایک آواز کی حقیقت ہے۔ پس وہ امر الٰہی (الأمر الإلهي) کرسی (الکرسی) میں اس صورت کے علاوہ کسی اور صورت میں رنگ جاتا ہے جس پر وہ پہلے تھا۔ اور کوئی ایسی صورت نہیں جس میں وہ رنگے یا جس کے ذریعے وہ ظاہر ہو مگر وہ دوسری صورت جس پر وہ پہلے تھا، اس میں باطن میں موجود رہتی ہے اور اس سے زائل نہیں ہوتی۔ اور ہر صورت میں پہلی صورت ہمیشہ اس صورت کے لیے روح ہوتی ہے جو ظاہر ہوتی ہے، اور وہ روح اس ظاہر ہونے والی صورت کو پہلے امر سے لے کر آخری منزل تک مدد فراہم کرتی ہے۔\n\nپس امر الٰہی (الأمر الإلهي) کرسی (الکرسی) سے اپنی معراج کے ذریعے سدرۃ المنتہیٰ (السدرة) کی طرف نازل ہوتا ہے اگر اس کا مقصد عالمِ آسمان ہو، اور اگر اس کا مقصد عالمِ جنان (جنتوں کا عالم) ہو تو وہ اس مقام سے نازل نہیں ہوتا بلکہ اس کی سلطنت جنتوں میں اس کے نزول کے مطابق ظاہر ہوتی ہے، خواہ اس کی حوروں میں، یا اس کے درختوں میں، یا اس کے ولدان میں، یا جنتوں میں جہاں بھی اس کے لیے مقرر کیا گیا ہو۔ پس جب وہ اپنی معراج پر آسمانوں کی طرف نازل ہوتا ہے تو اس کے ساتھ اس مقام کے فرشتے بھی اترتے ہیں جہاں سے وہ نازل ہوا ہے، اور اس کے ساتھ کواکب کے انوار کی قوتیں ہوتی ہیں جو اس سے جدا نہیں ہوتیں۔ پس سدرۃ المنتہیٰ (السدرة) کے فرشتے اسے وصول کرتے ہیں اور نازل ہونے والے فرشتوں سے لے لیتے ہیں، اور وہ فرشتے ان امور کے ساتھ واپس لوٹ جاتے ہیں جو سدرۃ المنتہیٰ کے فرشتے انہیں زمین سے اوپر چڑھنے والے امور میں سے دیتے ہیں۔ پس وہ انہیں لے کر واپس لوٹ جاتے ہیں، اور کواکب کی روحیں اس کے ساتھ باقی رہتی ہیں۔ اگر اس میں کوئی ایسی چیز ہو جس کی جنت کو اس میں موجود نباتات کی وجہ سے ضرورت ہو، تو وہ اسے سدرۃ العلیہ (بلند سدرہ) سے لے لیتا ہے، اور اس کی شاخیں جنت کے ہر گھر میں ہیں، اور یہ نور کا درخت (شجرة النور) ہے۔ اور اسی پر جنتی اور زمینی تمام بلند و پست درختوں کی حقائق ختم ہوتی ہیں۔ اور اس کی جڑیں شجرۃ الزقوم (زقوم کا درخت) ہیں، اور اس کی جڑ کی شاخیں عالمِ عناصر میں ہر کڑوا اور زہریلا درخت ہیں۔ جیسا کہ ہر پاکیزہ اور میٹھا ذائقہ والا پودا دنیا اور جنت میں سدرۃ المنتہیٰ کے ظاہر سے ہے۔ پس یہ سدرۃ المنتہیٰ دنیا اور آخرت کو آباد کیے ہوئے ہے، اور یہ دنیا، جنت اور دوزخ میں تمام اجسام میں نباتات اور نمو کی اصل ہے۔ اور اس پر اتنا نور اور حسن ہے کہ ہر عالم کی ہر زبان اس کے وصف سے عاجز ہے۔ پھر وہ امر الٰہی (الأمر الإلهي) سدرۃ المنتہیٰ میں اس طرح شاخ در شاخ ہو جاتا ہے جیسے درخت کی شاخیں پھیلتی ہیں، اور اس میں ثمرات کی صورتیں اس عالم کے مطابق ظاہر ہوتی ہیں جس کی طرف وہ نازل ہوتا ہے، اور وہ سدرۃ المنتہیٰ کی صورت میں رنگا جا چکا ہوتا ہے۔\n\nپس وہ معراج پر پہلے آسمان کی طرف نازل ہوتا ہے، تو اس کے رہنے والے خوش آمدید، حسنِ قبول اور خوشی کے ساتھ اسے وصول کرتے ہیں۔ اور انبیاء اور ان مخلوقات کی روحیں بھی اسے وصول کرتی ہیں جن کی روحیں موت کے ذریعے قبض کی گئیں اور ان کا ٹھکانہ وہاں تھا۔ اور زمین میں عارفین کی ہمتوں (ہمم) سے پیدا کیے گئے فرشتے بھی انہیں وصول کرتے ہیں۔ اور وہاں نہر حیات (نہر الحياة) ملتی ہے جو جنت کی طرف بہتی ہے۔ اگر اس (امر الٰہی) کے پاس کوئی امانت ہو، اور ہر امر الٰہی میں اس کا ہونا ضروری ہے کیونکہ امر الٰہی تمام موجودات کو شامل ہوتا ہے، تو وہ اسے اس نہر میں ڈال دیتا ہے جیسا کہ اس نے سدرۃ المنتہیٰ کو دیا تھا۔ پس وہ نہر اسے جنتوں کی طرف لے جاتی ہے۔ اور ہر نہر میں جو اسے وہاں ملتی ہے اور جنت کی طرف بہتی ہے، وہاں وہ نیل اور فرات کو پاتا ہے، پس وہ ان دونوں میں وہ امانت ڈال دیتا ہے جو اللہ نے اس کے پاس ان کے لیے ودیعت کی تھی۔ پس وہ برکت ان دونوں نہروں میں زمین کی طرف اترتی ہے، کیونکہ وہ زمین کی نہریں ہیں۔ اور انبیاء کی روحیں، ہمم کے فرشتے (ملائكة الهمم)، اور پہلے آسمان کے آباد کار اس میں سے وہ حصہ لے لیتے ہیں جو وہ ان کے لیے لے کر آیا ہے۔ اور وہ بیت المعمور (البيت المعمور) میں داخل ہوتا ہے، تو وہ اس سے خوش ہوتا ہے اور اس کے اطراف میں انوار چمک اٹھتے ہیں۔ اور ستر ہزار فرشتے آتے ہیں جو ہر روز اس میں داخل ہوتے ہیں اور کبھی واپس نہیں لوٹتے۔ اور یہ وہ فرشتے ہیں جنہیں اللہ نے نہر حیات کے پانی کے قطروں سے پیدا کیا ہے۔ کیونکہ جبرائیل علیہ السلام ہر روز نہر حیات میں ایک غوطہ لگاتے ہیں، پھر باہر نکل کر پرندے کی طرح جھٹکتے ہیں، تو اس جھٹکنے سے ستر ہزار قطرے ٹپکتے ہیں، اللہ ہر قطرے سے ایک فرشتہ پیدا کرتا ہے، جیسے رحم میں انسان کو پانی سے پیدا کرتا ہے۔ پس وہ ان ستر ہزار قطروں سے ستر ہزار فرشتے پیدا کرتا ہے جو ہر روز بیت المعمور (البيت المعمور) میں داخل ہوتے ہیں۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے صحیح حدیث میں بیت المعمور (البيت المعمور) کے بارے میں فرمایا: \"اس میں ہر روز ستر ہزار فرشتے داخل ہوتے ہیں جو کبھی واپس نہیں لوٹتے۔\"\n\nپس دیکھو اللہ کی بادشاہت کتنی وسیع ہے! پھر معراج پہلے آسمان سے دوسرے آسمان تک نصب ہوتی ہے، پس امر الٰہی (الأمر الإلهي) اس میں نازل ہوتا ہے، اور وہ پہلے آسمان کی صورت پر ہوتا ہے، پھر وہ اس معراج کی صورت میں رنگ جاتا ہے جس میں وہ نازل ہوتا ہے۔ اور اس کے ساتھ پہلے آسمان سے اس پر مقرر کیے گئے فرشتے ہوتے ہیں، اور اس کے ساتھ تمام بروج اور ثابت کواکب کی روحیں ہوتی ہیں۔ اور اس کے ساتھ سیارہ کیوان (زحل) کی قوت سے ایک فرشتہ بھی نازل ہوتا ہے، یہ ضروری ہے۔ پس جب وہ دوسرے آسمان پر پہنچتا ہے تو اس کے فرشتے، اس میں موجود فوت شدہ مخلوقات کی روحیں، ہمم کے فرشتے (ملائكة الهمم)، اور دوسرے آسمان میں موجود سیارہ بہرام (مریخ) کی قوت اسے وصول کرتی ہے۔ پس وہ انہیں وہ چیز دے دیتا ہے جو اس کے پاس ان کے لیے ہوتی ہے، اور تیسرے آسمان کی طرف نازل ہوتا ہے، اور وہ دوسرے آسمان کی صورت پر ہوتا ہے، پس وہ اس سیڑھی کی صورت میں رنگ جاتا ہے جس میں وہ نازل ہوتا ہے، اور حالت وہی ہوتی ہے جو ہم نے بیان کی، یہاں تک کہ وہ ساتویں آسمان پر پہنچتا ہے، جو آسمانِ دنیا ہے۔\n\nپس جب وہ انہیں وہ چیز ادا کر دیتا ہے جو اس کے پاس ان کے لیے ہوتی ہے، اور اس کے ساتھ ہر آسمان کے صاحب کی قوت ہوتی ہے، تو اس کے نزول کے لیے آسمان کے دروازے کھول دیے جاتے ہیں، اور اس کے ساتھ تمام ثابت اور سیار کواکب کی قوتیں، افلاک کی قوتیں، اور تمام فلکی حرکات کی قوتیں نازل ہوتی ہیں۔ اور ہر وہ صورت جس سے وہ منتقل ہوا، اس میں باطن میں موجود ہوتی ہے۔ پس ہر امر الٰہی (الأمر الإلهي) جو نازل ہوتا ہے، وہ اسمِ الٰہی، عقلی، نفسی، عرشی، کرسی ہوتا ہے، پس وہ ان تمام صورتوں کا مجموعہ ہوتا ہے جن سے وہ اپنے راستے میں گزرا ہے۔ پس وہ کرّوں (الکور) کو چیرتا ہے اور ہر کرّے میں اس کی طبیعت کے قبول کے مطابق اثر انداز ہوتا ہے، یہاں تک کہ وہ زمین تک پہنچتا ہے، اور مخلوق کے دلوں پر ظہور الٰہی (التجلی) کرتا ہے، پس وہ اسے اپنی استعدادوں کے مطابق قبول کرتے ہیں، اور ان کا قبول متنوع ہوتا ہے۔ اور یہی وہ خواطر (الخواطر) ہیں جو لوگ اپنے دلوں میں پاتے ہیں، پس انہی کے ذریعے وہ کوشش کرتے ہیں، انہی کے ذریعے خواہش کرتے ہیں، اور انہی کے ذریعے حرکت کرتے ہیں، خواہ وہ حرکت اطاعت ہو یا معصیت یا مباح۔ پس عالم کی تمام حرکات، خواہ وہ معدن، نباتات، حیوان، انسان، یا زمینی و آسمانی فرشتہ کی ہوں، اسی ظہور الٰہی (التجلی) سے ہوتی ہیں جو اس امر الٰہی (الأمر الإلهي) کے زمین پر نازل ہونے سے ہوتا ہے۔ پس لوگ اپنے دلوں میں ایسے خواطر پاتے ہیں جن کی اصل وہ نہیں جانتے، اور یہی اس کی اصل ہے۔ اور اس کے رسول اس عالم میں موجود ہر چیز کی طرف، جہاں وہ نازل ہوا ہے، وہ قوتیں ہیں جو کواکب اور افلاک کی حرکات سے اس کے ساتھ نازل ہوئی ہیں۔ پس یہی اس امر الٰہی (الأمر الإلهي) کے رسول ہیں جو اس عالم کی حقائق کی طرف بھیجے جاتے ہیں۔ پس اس کے ذریعے نمو پانے والی چیزیں نمو پاتی ہیں، اور اس کے ذریعے امور زندہ ہوتے ہیں اور امور مرتے ہیں، اور ہر عالم میں علوی اور سفلی تاثیرات ان رسولوں کے ذریعے ظاہر ہوتی ہیں جنہیں یہ امر الٰہی (الأمر الإلهي) عالم میں بھیجتا ہے۔ پس وہ ان میں بادشاہ کی مانند ہے، اور ہر سانس میں عزیز و علیم کی تقدیر کے مطابق ایک امر کے بعد دوسرا امر اور دوسرے کے بعد تیسرا امر آتا رہتا ہے۔\n\nپس جب اس کا امر ان میں نافذ ہو جاتا ہے اور وہ واپسی کا ارادہ کرتا ہے، تو اس کے رسول ہر موجود سے وہ چیزیں لے کر آتے ہیں جو ان سب سے ظاہر ہوئیں جن کی طرف وہ بھیجے گئے تھے، جو قائم صورتوں کی شکل میں ہوتی ہیں۔ پس وہ امر الٰہی (الأمر الإلهي) ان صورتوں کو، خواہ وہ قبیح ہوں یا حسن، پہن لیتا ہے، اور اپنی معراج پر وہیں سے واپس لوٹتا ہے جہاں سے آیا تھا، یہاں تک کہ وہ اپنے رب کے حضور ایک اسمِ الٰہی (اسم إلهي) کی صورت میں کھڑا ہوتا ہے جو ہر صورت کے ساتھ ظاہر ہوتا ہے۔ پس ذات حق (الحق) ان میں سے جو چاہتا ہے قبول کرتا ہے اور جو چاہتا ہے اس کے صاحب پر مناسب صورتوں میں واپس لوٹا دیتا ہے۔ پس وہ ان صورتوں کا ٹھکانہ اپنے علم میں جہاں چاہتا ہے بنا دیتا ہے۔ پس رسولوں کا زمین کی طرف ان معراجوں پر آنا مسلسل جاری رہتا ہے جیسا کہ ہم نے ذکر کیا۔ پس اب ہم اس امر الٰہی (الأمر الإلهي) کے ان پر نازل ہونے کے وقت اہل اللہ (أهل الله) کا حال بیان کرتے ہیں۔ اور وہ یہ ہے کہ اہل اللہ میں سے محقق (المحقق) اس کے نزول اور فضا میں اس کے ٹھہرنے کا مشاہدہ کرتا ہے جب وہ آسمانِ دنیا سے نازل ہوتے ہوئے تین سال تک کرّے (الکور) میں رہتا ہے۔ اور اس وقت وہ زمین پر ظاہر ہوتا ہے۔ پس ہر وہ چیز جو زمین میں ظاہر ہوتی ہے، وہ ہر فرد کے زمانے میں آسمان سے اس کے نزول کے تین سال گزرنے پر ظاہر ہوتی ہے۔ اور اسی وجہ سے اکثر اہل کشف (أهل الكشف) ان غیب کی باتوں کو بیان کرتے ہیں جو ان پر ظاہر ہوتی ہیں، کیونکہ وہ انہیں ان کے نزول سے پہلے دیکھ لیتے ہیں، اور آئندہ سالوں میں ہونے والے امور کی خبر دیتے ہیں، اور وہ چیزیں جو کواکب کی روحیں اور امر الٰہی (الأمر الإلهي) کی خدمت میں نازل ہونے والی افلاک کی حرکات انہیں دیتی ہیں۔ پس اگر منجم (المنجم) جان لے کہ ان حرکات سے ان میں موجود اثرات کو کیسے لینا ہے تو وہ درست فیصلہ کرتا ہے۔ اور اسی طرح کاہن اور نجومی (العرافون) بھی اگر سچے ہوں اور ہونے والے امر کو اس کے ہونے سے پہلے جان لیں، یعنی زمین پر اس کے اثر کے ظاہر ہونے سے پہلے۔ ورنہ انسان کی طاقت میں کہاں ہے کہ وہ جان سکے کہ افلاک کی حرکات ان کے مداروں میں کیا پیدا کریں گی؟ لیکن وہ روحانی مناسبت (التناسب الروحاني) جو ہمارے اور افلاک کی روحوں کے درمیان ہے جو خلق میں جاری ہونے والے امور کو جانتی ہیں، وہ ان صورتوں کے ساتھ نازل ہوتی ہے جو اس نے ان حرکات اور کوکبی انوار سے ان کے اوزان کے مطابق حاصل کی ہیں۔ کیونکہ ان کے لیے ایسی مقداریں ہیں جو خطا نہیں کرتیں۔ اور اس منجم کی ہمت بلندی کی طرف ہوتی ہے، اور اس کاہن کی روحانیت اس چیز میں رنگی جا چکی ہوتی ہے جس کی طرف اس کی ہمت متوجہ ہوئی، پس اس کے اور اس کے مطلوب کے درمیان مناسبت پیدا ہو جاتی ہے، تو مطلوب کی روحانیت اپنے اندر موجود چیزوں کو اس پر اس کے دیکھنے کے وقت افاضہ کر دیتی ہے، پس وہ مستقبل میں پیش آنے والے واقعات کے بارے میں حکم لگاتا ہے۔\n\nلیکن عارفین (العارفون) وہ ہیں جنہوں نے جان لیا کہ اللہ کے لیے ہر موجود میں ایک خاص وجہ (الوجه الخاص الإلهي) ہے۔ پس وہ کبھی بھی ہر چیز کو اس کے اسباب کے لحاظ سے نہیں دیکھتے، بلکہ وہ اس میں اس وجہ سے دیکھتے ہیں جو انہیں ذات حق (الحق) کی طرف سے حاصل ہے۔ پس وہ حق کی آنکھ سے دیکھتا ہے اور کبھی خطا نہیں کرتا۔ پس جب امر الٰہی (الأمر الإلهي) اس عارف کے دل پر نازل ہوتا ہے، اور وہ ان صورتوں کو پہن چکا ہوتا ہے جن سے وہ منازل میں گزر کر آیا ہے جیسا کہ ہم نے بیان کیا، تو پہلی صورت جس کے ساتھ وہ عقل اول (العقل الأول) کے لیے ظاہر ہوا تھا، وہ ایک اسمائی الٰہی صورت تھی، اور وہ ان تمام صورتوں کے پیچھے ہے۔ اور اس عارف کی ہمت ہمیشہ اس خاص الٰہی وجہ (الوجه الخاص الإلهي) کی طرف متوجہ رہتی ہے جو ہر موجود میں ہے، بعینہ اس خاص الٰہی وجہ کے ساتھ جو اس محقق عارف کے لیے ہے۔ پس وہ اس امر کو پہلی الٰہی صورت کے لحاظ سے دیکھتا ہے اور واسطوں (الوسائط) کو چھوڑ دیتا ہے، اور اس صورت سے تمام صورتوں پر اوپر سے نیچے تک اترتا ہے۔ اور ہر صورت میں وہ اسے صرف اس خاص وجہ سے دیکھتا ہے جو اس صورت کے لیے ہے، اپنے خاص وجہ کے ساتھ، یہاں تک کہ وہ تمام صورتوں پر پہنچ جاتا ہے۔ پس وہ اس امر الٰہی (الأمر الإلهي) سے عقل اول (العقل الأول) سے لے کر زمین تک عالم میں موجود تمام اسرار الٰہیہ (الأسرار الإلهية) کو جان لیتا ہے، جبکہ کاہن یا نجومی اور ان جیسے لوگ صرف عالمِ عنصری میں ہونے والے حوادث کو جانتے ہیں۔\n\nپھر عارف اس امر الٰہی (الأمر الإلهي) کو ادب کے لباسوں (حلل الأدب)، اس سے اخذ کرنے میں حضور الٰہی (الحضور الإلهي)، اور نور و بہاء سے آراستہ کرتا ہے، کہ جب امر الٰہی (الأمر الإلهي) اسے لے کر اپنی معراج پر چڑھتا ہے تو آسمانِ علیا کے فرشتے اس پر تعجب کرتے ہیں۔ پس اللہ تعالیٰ اپنے فرشتوں کے سامنے اس پر فخر کرتا ہے اور فرماتا ہے: \"یہ میرا بندہ ہے جسے تمہاری نسبت پستی (الحضيض) اور اسفل سافلین (أسفل سافلين) میں رکھا گیا، مگر اس کے مقام نے اس پر اثر نہیں کیا، نہ اس کے ٹھکانے نے اس پر حکم چلایا، اور نہ ہی حجابات کی کثرت نے اسے مجھ سے روکا۔ اس نے سب کو چیر ڈالا اور میری طرف دیکھا اور مجھ سے لیا۔ تو اگر یہ تمہاری طرح بغیر کثیف عنصری ظلماتی حجابات کے ہوتا تو کیسا ہوتا؟\" پس سننے والے مخاطب فرشتے کہتے ہیں: \"تو پاک ہے! یہ تیرا فضل ہے، تو اپنے بندوں میں سے جسے چاہتا ہے اسے اپنی طرف سے احسان اور رحمت کے طور پر خاص کر لیتا ہے، اور تو بڑے فضل والا ہے۔\" پس اللہ کی مخلوق میں سے کوئی بھی اس بندے کا مقابلہ نہیں کر سکتا سوائے عقل اول (العقل الأول) اور مقرب مہیمون (المهيمون) فرشتوں کے۔ اور اس عالم میں اس مرتبے کا کوئی دل نہیں مگر اہل اللہ میں سے افراد (الأفراد) کے دل، جیسے خضر اور ان جیسے لوگ، اور وہ قدم محمد (قدم محمد) پر ہیں۔ پس یہ ہم نے محمدی مقام (الموقف المحمدي) پر فرشتوں کے نزول کی صورت کا ایک مختصر ذکر کیا ہے۔ اور یہ منزل ان علوم کو شامل ہے: علوی روحوں کا علم، برزخی روحوں (الأرواح البرزخية) کا علم، وہ علم جو اللہ نافع علم کے طالب صادق پر کھولتا ہے، تمییز اور ترجیح کا علم (علم التمييز والترجيح)، القاء، ملاقات اور کتابت کا علم، قرآن کا علم، جو کچھ ہونے والا ہے اس کا علم، غیب کا علم، مقادیر کا علم، اشیاء کو ان کی اصول کی طرف لوٹانے کا علم، جانے کا علم، آخرت کا علم، دوسرے کو پہلے سے ملانے کا علم، عالم کی نشأت کا علم، جگہ اور مقام میں استقرار کا علم، حیات کا علم، عالم کی لمبائی، چوڑائی اور گہرائی کا علم اور اس نے اسے کہاں سے حاصل کیا، فضائی حوادث کا علم اور ان کے اسباب جو علوی اثرات ہیں، خاموشی اور کلام کے مقامات کا علم، جمع اور تفرقہ کا علم (علم الجمع والتفرقة) جو علمِ نسب میں سے ہے، مکر کی باریکیوں کا علم، تقویٰ کا علم (یعنی وہ جو تقویٰ پیدا کرتا ہے) جیسا کہ اس کے قول میں ہے: \"اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے\" (وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ)، اور اس کے قول سے اس کا کیا تعلق ہے: \"اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) پیدا کر دے گا\" (إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا)، اور احسان کا علم (یعنی جو احسان پیدا کرتا ہے)، اس کے اسم الحلیم سے مہلت دینے کا علم، حقائق کا علم، خشوع کا علم، اور مخلوقات کے کلام سے اللہ کے کلام کے مرتبے کا علم۔ اور \"اللہ ہر چیز کو جاننے والا ہے\" (وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ)، کیونکہ \"اس نے ہر چیز کو علم سے گھیر رکھا ہے\" (أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا) اور \"اس نے ہر چیز کو گنتی میں شمار کر رکھا ہے\" (وَأَحْصَىٰ كُلَّ شَيْءٍ عَدَدًا)۔ اور \"اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب سیصد و هفتم: در معرفت منزل نزول فرشتگان بر موقف محمدی از حضرت موسوی محمدی\n\nجان‌های بلند را چون وزیدند، استشمام کردم *** و سحرگاهان بر باغ‌ها گذشتند و نمو کردند.\n\nآیا در عالم نفوس کسی هست که مانند ما باشد؟ *** و آیا محبت آنان در آن، مانند محبت من است؟\n\nپس زبان حق (الحق) گفت: همانا سیر شما *** بر سنت برتر، دلیل کمال من است.\n\nپس راز جود و انتقامم را از شما آشکار ساختم *** و راز علم و حکمتم را در شما پنهان کردم.\n\nپس هر که صاحب چشمی باشد، آنچه را که جلوه دادم می‌بیند *** و هر که کور باشد، او از اصل حیرت من است.\n\nپس هر مقامی از چشمه جود اوست *** و هر هستی‌ای از اصل نشأت من است.\n\n[اینکه خداوند از آسمان تا زمین معراج‌هایی به تعداد خلایق قرار داده است]\n\nای ولی صمیمی (الولي الحميم)، بدان که خداوند از آسمان تا زمین معراج‌هایی به تعداد خلایق قرار داده است. و در آسمان‌ها جای قدمی نیست مگر آنکه با فرشته‌ای آباد است که خداوند را تسبیح می‌گوید و او را به ذکری که برایش مقرر شده یاد می‌کند. و خداوند متعال در زمین نیز فرشتگانی به همین تعداد دارد که هرگز به آسمان صعود نمی‌کنند، و اهل آسمان‌ها نیز هرگز به زمین نزول نمی‌کنند. (كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ) «هر یک نماز و تسبیح خود را می‌داند.» و خداوند متعال جان‌هایی از فرشتگان گرامی دارد که مسخر شده‌اند و خداوند متعال امور وحی شده در آسمان‌ها را که سبحانه خواسته است در عالم عناصر جاری سازد، به دست آنان سپرده است. و سبحانه معراج‌های فرشتگان را از کرسی (الكرسي) تا آسمان‌ها قرار داده است که با اوامر الهی مخصوص اهل آسمان‌ها نازل می‌شوند، و این‌ها امور فرقانی هستند. و از عرش (العرش) تا کرسی (الكرسي) معراج‌هایی برای فرشتگانی قرار داده است که با کلمه واحده (الكلمة الواحدة) که تقسیم‌پذیر نیست، به کرسی (الكرسي) نازل می‌شوند. هنگامی که کلمه واحده‌العین به کرسی (الكرسي) می‌رسد، به فرقه‌هایی تقسیم می‌شود به اندازه‌ای که رحمان اراده کرده است تا از آن در عالم خلق و امر جاری سازد. و از نفس (النفس) رَقایقی (لطایفی) به سوی عرش (العرش) کشیده شده است که به دو فرقه تقسیم می‌شوند برای دو قوه‌ای که نفس (النفس) بر آن‌ها استوار است، و آن لوح محفوظ (اللوح المحفوظ) است که دو وجه دارد. و آن رقایق (لطایف) که بین لوح و عرش هستند، به منزله معراج‌هایی برای فرشتگان می‌باشند، و معانی نازل شده در آن رقایق (لطایف) مانند فرشتگان هستند. و از نفس (النفس) که لوح است، به عقل (العقل) که قلم است، توجهاتی برای استفادت وجود دارد، و از عقل (العقل) به سوی آن، توجهاتی برای افاضه ذاتی وجود دارد که عقل در آن اختیاری ندارد. از این توجهات، علومی برای نفس (النفس) حاصل می‌شود درباره آنچه در هستی (الكون) رخ می‌دهد که کثرت آن قابل شمارش نیست.\n\nو از عقل (العقل) به سوی خداوند، افتقار ذاتی وجود دارد، و از خداوند به سوی عقل (العقل)، امداد ذاتی از طریق تجلی ارادی (تجلي إرادي) است. پس عقل از علوم تفصیلی در آن تجلی اجمالی آگاه می‌شود، که فقر او را به فقرش و عجز او را به عجز او می‌افزاید، و هرگز از این حالت جدا نمی‌شود و برنمی‌گردد. پس امر الهی (الأمر الإلهي) در آن تجلی ارادی (تجلي إرادي) با امداد ذاتی به عقل (العقل) نازل می‌شود، و در توجهات عقلی به سوی توجهات نفسی، آن امر الهی (الأمر الإلهي) به صورت عقلی ظاهر می‌شود، پس از آنکه در صورت اسمائی بود. پس صورت‌ها بر آن امر الهی (الأمر الإلهي) بر حسب موطنی که به آن نازل می‌شود، مختلف می‌گردند، و در هر منزلی رنگی می‌پذیرد. سپس آن امر الهی (الأمر الإلهي) در رقایق نفسی (لطایف نفسی) به صورت نفسی نازل می‌شود که دارای ظاهر و باطن و غیب و شهود است. پس رقایق شوقی عرشی آن را دریافت می‌کنند و از آن می‌گیرند، و در عرش (العرش) رنگ صورت عرشی می‌پذیرد. سپس در معراج‌ها به کرسی (الكرسي) بر دست فرشتگان نازل می‌شود، در حالی که در عالم خلق واحدالعین و تقسیم‌ناپذیر است. در حالی که از نفس (النفس) به عرش (العرش) به صورت منقسم (تقسیم‌شده) نازل شده بود، که انقسام عالم امر است. اما هنگامی که به اولین عالم خلق یعنی عرش (العرش) رنگ پذیرفت، در وحدانیت خلق ظاهر شد، و این اولین وحدانیت خلق است. پس از حیث امر، منقسم است و از حیث خلق، واحدالعین است؛ مانند صدایی که از سینه به خارج دهان می‌آید، که عین واحدی است و هیچ کمیتی در آن ظاهر نمی‌شود، سپس مخارج آن را به حروف متعددی که بیش از هفتاد است تقسیم می‌کنند، در حالی که عین همان صدای واحد است. پس آن امر الهی (الأمر الإلهي) در کرسی (الكرسي) رنگ صورتی غیر از صورتی که بر آن بود می‌پذیرد. و هیچ صورتی نیست که در آن رنگ پذیرد و با آن ظاهر شود، مگر آنکه صورت قبلی که بر آن بود، در آن پنهان است و از آن زایل نمی‌شود. و صورت اولی همیشه برای هر صورتی، روح آن صورتی است که در آن ظاهر می‌شود، از ابتدای امر تا آخرین منزل. آن روح، این صورت ظاهره را مدد می‌رساند. پس امر الهی (الأمر الإلهي) از کرسی (الكرسي) بر معراج خود به سوی سدره (السدرة) نازل می‌شود، اگر قصد عالم آسمان‌ها باشد. و اگر قصد عالم بهشت‌ها باشد، از آن موضع نازل نمی‌شود و سلطنتش در بهشت‌ها بر حسب آنچه به آن نازل شده، ظاهر می‌شود؛ یا در حوریانش، یا در درختانش، یا در غلمانش، یا در هر جایی که برایش در بهشت‌ها تعیین شده است.\n\nپس هنگامی که به آسمان‌ها بر معراج خود نازل می‌شود، فرشتگان آن مقامی که از آن نازل شده‌اند، همراه او نازل می‌شوند، و قوای انوار کواکب نیز همراه او هستند و از او جدا نمی‌شوند. پس فرشتگان سدره (السدرة) آن را دریافت می‌کنند و از فرشتگانی که آن را نازل کرده‌اند می‌گیرند. و آن فرشتگان با اموری که فرشتگان سدره (السدرة) از امور صعودکننده از زمین به آن‌ها می‌دهند، باز می‌گردند. و جان‌های کواکب با آن امر باقی می‌مانند. اگر در آن امر چیزی باشد که بهشت از جهت گیاهانش به آن نیاز دارد، آن را از سدره علیه (السدرة العلية) و شاخه‌های آن در هر خانه‌ای در بهشت می‌گیرد، و آن درخت نور است. و حقایق درختان علوی بهشتی و سفلی زمینی به آن منتهی می‌شوند. و اصول آن، درخت زقوم است، و شاخه‌های اصل آن، هر درخت تلخ و سمی در عالم عناصر است. همان‌طور که هر گیاه خوش‌طعم و شیرین، از ظاهر سدره (السدرة) در دنیا و بهشت است. پس این سدره (السدرة) دنیا و آخرت را آباد کرده است، و اصل گیاه و نمو در تمام اجسام در دنیا و بهشت و دوزخ است. و بر آن از نور و بهاء چنان است که هر زبانی از هر عالمی از وصف آن عاجز است. سپس امر الهی (الأمر الإلهي) در سدره (السدرة) شاخه شاخه می‌شود، همان‌طور که شاخه‌های درخت منشعب می‌شوند، و صورت‌های میوه‌ها در آن ظاهر می‌شود بر حسب آنچه از عالمی که به آن نازل می‌شود، مدد می‌گیرد. و آن امر به صورت سدره (السدرة) رنگ پذیرفته است. پس بر معراج به سوی آسمان اول نازل می‌شود. اهل آن با خوش‌آمدگویی و پذیرش نیکو و شادی آن را دریافت می‌کنند. و از جان‌های پیامبران و خلایقی که جان‌هایشان با مرگ قبض شده و مقرشان در آنجا بوده است، آن را دریافت می‌کنند. و فرشتگانی که از همت‌های عارفان در زمین خلق شده‌اند، آن را دریافت می‌کنند. و در آنجا نهر حیات را می‌یابد که به سوی بهشت جاری است. اگر نزد آن امانتی باشد که در هر امر الهی (أمر إلهي) ضروری است (زیرا امر الهی همه موجودات را در بر می‌گیرد)، آن را در آن نهر می‌اندازد، همان‌طور که به سدره (السدرة) داده بود. پس نهر آن را به سوی بهشت‌ها جاری می‌سازد. و در هر نهری که در آنجا می‌یابد و به سوی بهشت جاری است، و در آنجا نیل و فرات را می‌یابد، آنچه را که خداوند از امانتی که باید برای آن‌ها باشد، نزد او به ودیعه نهاده، به آن‌ها می‌سپارد. پس آن برکت در دو نهر به زمین نازل می‌شود، زیرا آن‌ها از نهرهای زمین هستند. و جان‌های پیامبران و فرشتگان همت‌ها و آبادکنندگان آسمان اول، آنچه را که در دست دارد و با آن به سوی آن‌ها نازل شده است، از او می‌گیرند. و وارد بیت المعمور می‌شود، و بیت المعمور به آن شاد می‌شود و انوار در جوانب آن می‌درخشد. و هفتاد هزار فرشته‌ای که هر روز وارد آن می‌شوند و هرگز باز نمی‌گردند، می‌آیند. و آن‌ها فرشتگانی هستند که خداوند آن‌ها را از قطرات آب نهر حیات خلق کرده است. زیرا جبرئیل (عليه السلام) هر روز در نهر حیات غوطه‌ور می‌شود، و بیرون می‌آید و خود را می‌تکاند، همان‌طور که پرنده خود را می‌تکاند. و در آن تکاندن، هفتاد هزار قطره از او می‌چکد. خداوند از هر قطره‌ای فرشته‌ای خلق می‌کند، همان‌طور که انسان را از آب در رحم خلق می‌کند. پس هفتاد هزار فرشته از آن هفتاد هزار قطره خلق می‌کند، به تعداد هفتاد هزار فرشته‌ای که هر روز وارد بیت المعمور می‌شوند.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در حدیث صحیح درباره بیت المعمور فرمود: «هر روز هفتاد هزار فرشته وارد آن می‌شوند که هرگز به آن باز نمی‌گردند.»\n\nپس بنگر که مُلک خداوند چقدر وسیع است.\n\nسپس معراج از آسمان اول به آسمان دوم برپا می‌شود. امر الهی (الأمر الإلهي) در آن نازل می‌شود، در حالی که بر صورت آسمان اول است. پس به صورت معراجی که در آن نازل می‌شود، رنگ می‌پذیرد. و فرشتگان موکل بر آن از آسمان اول همراه او هستند، و جان‌های برج‌ها و تمام کواکب ثابت همراه او هستند. و فرشته‌ای از قوه کیوان (زحل) نیز همراه او نازل می‌شود، که این ضروری است. هنگامی که به آسمان دوم می‌رسد، فرشتگان آن و جان‌های خلایق متوفی در آن و فرشتگان همت‌ها و قوه بهرام (مریخ) که در آسمان دوم است، او را دریافت می‌کنند. پس آنچه را که در دست دارد و برای آن‌هاست، به آن‌ها می‌دهد. و به سوی آسمان سوم نازل می‌شود، در حالی که بر صورت آسمان دوم است. پس به صورت نردبانی که در آن نازل می‌شود، رنگ می‌پذیرد. و حال، همان حال است که ذکر کردیم، تا اینکه به آسمان هفتم که آسمان دنیا است، منتهی می‌شود. هنگامی که آنچه را که در دست دارد و برای آن‌هاست، به آن‌ها ادا کرد، و قوه صاحب هر آسمان همراه او بود، درهای آسمان برای نزول او گشوده می‌شود. و قوای تمام کواکب ثابت و سیاره و قوای افلاک و قوای تمام حرکات فلکی همراه او نازل می‌شوند. و هر صورتی که از آن منتقل شده، در او پنهان است. پس هر امر الهی (أمر إلهي) که نازل می‌شود، اسم الهی (اسم إلهي)، عقلی، نفسی، عرشی، کرسی است. پس او مجموع صورت‌های هر چیزی است که در مسیرش از آن عبور کرده است. پس کره‌ها را می‌شکافد و در هر کره بر حسب آنچه طبیعتش می‌پذیرد، تأثیر می‌گذارد، تا اینکه به زمین منتهی می‌شود. پس بر قلب‌های خلایق تجلی می‌کند، و آن‌ها آن را بر حسب استعدادها و پذیرش‌های متنوع خود قبول می‌کنند. و آن همان خواطری است که مردم در قلب‌های خود می‌یابند. پس با آن‌ها تلاش می‌کنند، و با آن‌ها آرزو می‌کنند، و با آن‌ها حرکت می‌کنند، خواه آن حرکت طاعت باشد یا معصیت یا مباح. پس تمام حرکات عالم، از معدن و نبات و حیوان و انسان و فرشته زمینی و آسمانی، از آن تجلی است که از این امر الهی (الأمر الإلهي) نازل شده به زمین حاصل می‌شود. پس مردم در قلب‌های خود خواطری می‌یابند که اصل آن را نمی‌دانند، و این است اصل آن. و رسولان آن به سوی تمام آنچه در عالمی که به آن نازل شده است، قوای کواکب و حرکات افلاکی هستند که همراه او نازل شده‌اند. پس این‌ها رسولان این امر الهی (الأمر الإلهي) به حقایق این عالم هستند. پس نامی‌ها با آن نمو می‌کنند، و اموری با آن زنده می‌شوند، و اموری با آن می‌میرند، و تأثیرات علوی و سفلی در هر عالمی توسط آن رسولانی که این امر الهی (الأمر الإلهي) در عالم می‌فرستد، ظاهر می‌شود. زیرا او مانند پادشاه در میان آن‌هاست. و پیوسته امر دیگری او را دنبال می‌کند، و دیگری، دیگری را، در هر نفس، به تقدیر خدای عزیز و دانا (العزيز العليم).\n\nپس هنگامی که امرش در آن‌ها نافذ شد و اراده بازگشت کرد، رسولانش از هر موجودی با آنچه از هر کسی که به سوی او فرستاده شده بودند، ظاهر شده است، به صورت‌های قائم به سوی او می‌آیند. و آن امر الهی (الأمر الإلهي) از زشت و زیبا آن صورت‌ها را می‌پوشد. و بر معراج خود از جایی که آمده است، باز می‌گردد تا در پیشگاه پروردگارش به صورت اسم الهی (اسم إلهي) ظاهر با تمام صورت‌ها بایستد. پس حق (الحق) آنچه را که بخواهد از آن می‌پذیرد و آنچه را که بخواهد بر صاحبش در صورت‌هایی که مناسب اوست، رد می‌کند. پس مقر آن صورت‌ها را هر جا که بخواهد از علم خود قرار می‌دهد. و پیوسته رسولان به سوی زمین بر این معراج‌ها، همان‌طور که ذکر کردیم، پی در پی می‌آیند.\n\nپس حال اهل الله (اهل الله) را با این امر الهی (الأمر الإلهي) هنگامی که به سوی آن‌ها نازل می‌شود، ذکر می‌کنیم. و آن این است که محقق از اهل الله (اهل الله) نزول آن و توقفش در جو در کره‌ها را هنگامی که آسمان دنیا را ترک می‌کند و نازل می‌شود، سه سال مشاهده می‌کند. و در آن هنگام در زمین ظاهر می‌شود. پس هر چیزی که در هر چیزی در زمین ظاهر می‌شود، پس از انقضای سه سال از نزول آن از آسمان در هر زمان فردی است. و از اینجاست که بیشتر اهل کشف (أهل الكشف) از غیب‌هایی که از آن‌ها ظاهر می‌شود، سخن می‌گویند. زیرا آن‌ها را قبل از نزولشان می‌بینند و از آنچه در سال‌های آینده رخ خواهد داد، خبر می‌دهند. و آنچه را که جان‌های کواکب و حرکات افلاک نازل شده در خدمت امر الهی (الأمر الإلهي) به آن‌ها می‌دهند. پس اگر منجم بداند که چگونه از این حرکات آنچه را که از آثار در آن‌هاست بگیرد، حکم را درست می‌گوید. و همچنین کاهن و عرافان، اگر راست بگویند و آنچه را که قبل از وقوعش رخ می‌دهد، یعنی قبل از ظهور اثر عین آن در زمین، بدانند. وگرنه چگونه در توان انسان است که آنچه را که از حرکات افلاک در مجاری آن‌ها رخ می‌دهد، بداند؟ اما تناسب روحانی که بین ما و جان‌های افلاک است که به آنچه در خلق جاری می‌شود، آگاهند، با صورت آن که از آن حرکات و انوار کوکبی بر اوزان آن‌ها کسب کرده است، نازل می‌شود. زیرا آن‌ها مقادیری دارند که خطا نمی‌کنند. و همت این منجم متعالی است، و همت این کاهن، روحانیت او به آنچه همتش به آن توجه کرده، رنگ پذیرفته است. پس مناسبت بین او و مطلوبش واقع شده است. پس روحانیت مطلوب در وقت نظرش، آنچه را که در آن است، بر او افاضه کرده است. پس او بر اساس حوادث آینده حکم کرده است.\n\nاما عارفان (العارفون)، آن‌ها دانسته‌اند که خداوند در هر موجودی وجه خاصی دارد. پس آن‌ها هرگز به هر چیزی از حیث اسبابش نگاه نمی‌کنند، بلکه در آن از وجهی که از حق (الحق) دارند، می‌نگرند. پس با چشم حق (حق) می‌نگرد و هرگز خطا نمی‌کند. پس هنگامی که امر الهی (الأمر الإلهي) بر قلب این عارف نازل می‌شود، و از صورت‌ها بر حسب آنچه از منازل بر او گذشته است، پوشیده شده است، همان‌طور که مقرر کردیم، اولین صورتی که با آن برای عقل اول (العقل الأول) ظاهر شد، صورت الهی اسمائی بود، و آن پشت این صورت‌ها است. و همت این عارف همیشه مصروف به وجه خاص الهی (الوجه الخاص الإلهي) است که در هر موجودی است، با عین وجه خاص الهی (الوجه الخاص الإلهي) که برای این عارف محقق است. پس در آن امر از حیث صورت اولی الهی می‌نگرد و واسطه‌ها را ترک می‌کند. و از آن صورت بر تمام صورت‌ها از بالا به پایین نازل می‌شود. و در هر صورتی، به آن نگاه نمی‌کند مگر از حیث آن وجه خاص آن با وجه خاص خود، تا اینکه بر تمام صورت‌ها منتهی می‌شود. پس از آن امر الهی (الأمر الإلهي)، تمام آنچه در عالم است، از عقل اول (العقل الأول) تا زمین، از اسرار الهی را می‌شناسد، در حالی که کاهن یا عراف و امثال آن‌ها فقط آنچه را که در عالم عنصری رخ می‌دهد، از حوادث می‌دانند.\n\nسپس عارف (العارف) آن امر الهی (الأمر الإلهي) را از جامه‌های ادب و حضور الهی (الحضور الإلهي) در گرفتن آن از او، و نور و بهاء می‌پوشاند، به طوری که هنگامی که امر الهی (الأمر الإلهي) با آن بر معراج خود صعود می‌کند، فرشتگان آسمان‌های بالا از آن تعجب می‌کنند. پس خداوند به وسیله او بر فرشتگانش مباهات می‌کند و می‌گوید: «این بنده‌ای است که در حضیض و در پایین‌ترینِ پایین‌ها نسبت به شما قرار داده شده است، اما منزلش در او تأثیر نگذاشت و موطنش بر او حکم نکرد و کثرت حجاب‌هایش او را از من محجوب نساخت. و او همه را درید و به من نگریست و از من گرفت. پس چگونه خواهد بود اگر مانند شما بدون حجاب‌های ظلمانی کثیف عنصری بود؟» پس شنوندگان مخاطب می‌گویند: «سبحانک، این فضل توست که به هر کس از بندگانت که بخواهی، به عنوان منت و رحمت، اختصاص می‌دهی، و تو صاحب فضل عظیم هستی.» پس هیچ یک از خلق خدا با این بنده برابری نمی‌کند، مگر عقل اول (العقل الأول) و فرشتگان مقرب مهیمون. و در این عالم، قلبی با این مرتبه وجود ندارد، مگر قلب‌های افراد (الأفراد) از رجال الله، مانند خضر و امثال او، و آن‌ها بر قدم محمد (صَلَّى اللهُ عَليهِ وسَلَّم) هستند.\n\nپس این اندکی از صورت نزول فرشتگان بر قلب محمدی (المحمدي) ایستاده را ذکر کردیم. و این منزل شامل علومی است: علم جان‌های علوی و جان‌های برزخی، و علم آنچه خداوند با آن بر صادق در طلب علم نافع می‌گشاید، و علم تمییز و ترجیح، و علم القاء و لقاء و کتابت، و علم قرآن، و علم آنچه خواهد بود، و علم غیب، و علم مقادیر، و علم بازگرداندن اشیاء به اصولشان، و علم رفتن، و علم آخرت، و علم ملحق کردن دومی به اولی، و علم نشأت عالم، و علم استقرار در مکان و مکانت، و علم حیات، و علم طول و عرض و عمق عالم و اینکه از کجا آن را کسب کرده است، و علم حوادث جو و سبب آن‌ها که همان آثار علوی هستند، و علم مواطن سکوت و کلام، و علم جمع و تفرقه که از علم نسب است، و علم دقایق مکر، و علم تقوا (التقوى) یعنی آنچه تقوا در این قول نتیجه می‌دهد: (واتَّقُوا الله ويُعَلِّمُكُمُ الله) «و از خدا پروا کنید و خدا به شما می‌آموزد.» و این کجا و قول او کجا: (إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً) «اگر از خدا پروا کنید، برای شما فرقان (قدرت تشخیص) قرار می‌دهد.» و علم احسان، یعنی آنچه احسان نتیجه می‌دهد، و علم مهلت دادن از اسم حلیم او، و علم حقایق، و علم خشوع، و علم منزلت کلام خدا از کلام مخلوقین. و (والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ) «و خداوند به هر چیزی داناست.» زیرا (فإنه أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً وأَحْصى‏ كُلَّ شَيْ‏ءٍ عَدَداً) «همانا او به هر چیزی از نظر علم احاطه دارد و هر چیزی را از نظر عدد شمارش کرده است.» و (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ) «و خداوند حق را می‌گوید و او راه را هدایت می‌کند.»"
  },
  "page_count": 4
}