{
  "id": 476,
  "title": {
    "ar": "الباب السادس والسبعون وأربعمائة في معرفة حال قطب كان منزله لا حول ولا قوة إلا بالله",
    "en": "Chapter Four Hundred and Seventy-Six: Concerning the knowledge of the state of a Pole (قطب) whose station (منزل) was \"There is no power and no strength save in God (لا حول ولا قوة إلا بالله).\"",
    "ur": "باب چار سو چھہترواں: اس قطب کے حال کی معرفت میں جس کی منزل \"لا حول ولا قوة إلا بالله\" تھی۔",
    "fa": "باب چهارصد و هفتاد و ششم در معرفت حال قطبی که منزلگاهش «لا حول ولا قوة إلا بالله» (هیچ نیرو و قوتی جز به خدا نیست) بود"
  },
  "content": {
    "ar": "## «الباب السادس والسبعون وأربعمائة في معرفة حال قطب كان منزله لا حول ولا قوة إلا بالله»\n> الحول والقوة لله *** عند الذي يؤمن بالله‏\n\n\n> وإنما التحقيق عبد رأى *** الحول والقوة لله‏\n\n\n> ومن ير الأمرين في نفسه *** فهو على نور من الله‏\n\n\n### [إن الله خلق آدم على صورته‏]\n\n\nقال الله تعالى معرفا أن موسى عليه السلام قال لقومه اسْتَعِينُوا بِاللَّهِ وشرع لنا في القسمة بيننا وبينه أن نقول وإِيَّاكَ نَسْتَعِينُ فقال هذه بيني وبين عبدي ولعبدي ما سأل‏\n\n\nالعلم أن لا حول ولا قوة إلا بالله من خصائص من خلقه الله على صورته وهو الإنسان الكامل فإن الملك ليس من حقيقته أن يكون هذا مقامه بل هو المتبرئ لأنه ليس بعبد جامع وإنما هو عضو من أعضاء العبد الجامع فالعبد الجامع هو الذي لم يبق صفة في سيده إلا وهي فيه ومن صورته في الاقتدار على إيجادنا قبولنا لذلك فما ثم قوة مطلقة من واحد دون مساعد فلما علم منا أنا نعلم ذلك شرع لنا أن نستعين به إذا القابل يحتاج إلى مقتدر كما إن المقتدر طلب القبول من القابل فصحت القسمة بيننا وبينه تعالى فإنه الصادق‏\n\n\nوقد قال قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي‏\n\n\nفالاقتدار منه والقبول منا وبهما ظهر العالم في الوجود الدليل إن المحال لا يقبل الوجود فلا ينفذ فيه الاقتدار لأن من حقيقة الاقتدار أنه لا يتعلق إلا بالممكن ولا معنى للممكن إلا القبول فلا يصح أن يقول لا حول ولا قوة إلا بالله إلا العبد الجامع فكل من تبرأ فهو جزء من الجامع وكل من أثبت الأمرين فهو جامع عالم بنفسه وبربه أديب وفي الأمر حقه‏\n\n\n> فلا حول منه ولا قوة *** إذا لم أكن وأنا الواقع‏\n\n\n> ولا حول منه ولا قوة *** إذا لم يكن وأنا الجامع‏\n\n\nأ لا تراها كنزا أخفاه الله في الملك حتى أوجد آدم على صورته وجعله خليفة في أرضه واعترض من اعترض كما أخبر الله تعالى في ذلك وما سمع قبل خلق آدم لا حول ولا قوة إلا بالله وكل قائل يقولها من غير العبد الجامع فإنما يقولها بحكم التبعية له ولما خلق العرش وأمرت الملائكة أن تحمله لم تطقه فلما عجزت قام الحامل الواحد منهم الذي على صورة الإنسان فقال بلسانه لما أعطاه الله لا حول ولا قوة إلا بالله فقال من بقي من الجملة بقوله فحملت العرش وأطاقته فلما أوجد الله الإنسان الكامل جعل له قلبا كالعرش جعله بيتا له فما في العالم من يطيق حمل قلب المؤمن لأنهم عجزوا عن حمل العرش وهو في زاوية من زوايا قلب المؤمن لا يحس به ولا يعلم أن ثم عرشا لخفته عليه وجعل أسماءه الحسنى تحف بهذا القلب كما تحف الملائكة بالعرش وجعل حملته العلم الإلهي والحياة والإرادة والقول أربعة فالحياة نظير الحامل الذي على صورة الإنسان من حملة العرش لسريان الحياة في الأشياء فما ثم إلا حي والحياة الشرط المصحح لبقية الصفات من علم وإرادة وقول‏\n\n\nورد في الخبر أن جبريل لما علم آدم الطواف بالبيت وقال له إنا طفنا بالبيت قبل إن تخلق بكذا وكذا ألف سنة فقال له آدم فما كنتم تقولون عند الطواف به فقال جبريل كنا نقول سبحان الله والحمد لله ولا إله إلا الله والله أكبر فقال آدم وأزيدكم أنا لا حول ولا قوة إلا بالله‏\n\n\nفاختص بهذا الكنز آدم عليه السلام فما ثم من يحول بينك وبين ما أنت قابل له مما إذا قبلته أضربك وأنزلك عن رتبتك أعني رتبة كما لك إلى حيوانيتك إلا الله ولا قوة لك على ما كلفك من الأعمال إلا بالله كما لا يحول بين الحق مع اقتداره وبين ما لا يصح فيه وجود إلا بك إلا أنت إذا لم تكن فلا بد من كونك فيما لا يوجد إلا بك ولا قوة أي لا ينفذ اقتدار في أمر لا يظهر إلا بك فمن القسمة ظهور حقيقة لا حول ولا قوة إلا بالله فيك وفيه بحسب الأحوال التي تطلبها فلا أجمع من الإنسان الجامع ولا أشرف فيه من جزئياته إلا الجزء الملكي منه كما إن ذكر الله في الصلاة أشرف أجزاء الصلاة لا أن الذكر أشرف من الصلاة كما أنه لا يكون الملك أشرف من الإنسان لأنه جزء من الإنسان والذكر جزء من الصلاة قال الله تعالى إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ يعني بصورتها فإن التكبيرة الأولى تحريمها والسلام منها تحليلها عن الفحشاء والمنكر لما فيها من التحريم ولَذِكْرُ الله أَكْبَرُ يعني فيها لأن الذكر جزء منها وهو أكبر أجزائها وفيه وقعت القسمة بين الله وبين المصلي في الصلاة فإذا علمت هذا علمت مقام الملك فلم يخرج عنك وأصبت الأمر على ما هو عليه وأنصفت وعرفت من أين أتى على من أتى عليه في باب المفاضلة الله تعالى مجموع أسمائه مع التفاضل فيها في عموم التعلق فاجعل‏\nبالك وقُلْ رَبِّ زِدْنِي عِلْماً وتأدب بآداب الحق الذي هو عليها فإن العبد إذا قال لا حول ولا قوة إلا بالله يصدقه ربه فيقول الرب لا حول ولا قوة إلا بي ولم يتعرض أن يقول لا حول ولا قوة إلا بك يا عبدي فإن هذه الكلمة لا تظهر من قائلها إلا بقائلها ولكن لما علم تعالى أن الإنسان الحيوان شارك الإنسان الكامل بالصورة الإنسانية علم أنه إذا قال الحق لا حول ولا قوة إلا بك طردها الإنسان الحيوان في غير موطنها فأساء الأدب والإنسان الكامل لا يفعل مثل هذا فراعى الحق الحرمة ليتعلم الكامل فهي مسألة تعلم وتعتقد ولا يفوه بها ناطق ولا تجري على لسان عبد مختص إلا في بيان العلم ليعلم الأمر على ما هو عليه فإن الله أخذ العهد على العلماء أن يعلموا من لا يعلم ما علمهم الله ومما علمهم الأدب فلا يضعون الحكمة إلا في أهلها هذا من شأنهم رضي الله عنهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 476: On the Gnosis of the State of a Pole whose Station was \"There is no power nor strength save in God\"\n\nPower and strength belong to God,\nIn the view of him who believes in God.\n\nBut the realization is that of a servant who sees\nThat power and strength belong to God.\n\nAnd whoever sees the two matters (power and strength) residing in himself,\nHe is upon a light from God.\n\n### [Indeed, God created Adam upon His form]\n\nGod Almighty said, making known that Moses (peace be upon him) said to his people: <<اسْتَعِينُوا بِاللَّهِ>> (Seek help in God). And He legislated for us, concerning the division (القسمة) between us and Him, that we should say: <<وإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help). Then He said: \"This is between Me and My servant, and My servant shall have what he asks.\"\n\nThe knowledge (العلم) is that \"There is no power nor strength save in God\" (لا حول ولا قوة إلا بالله) is among the unique characteristics (خصائص) of him whom God created upon His form (صورته), which is the Perfect Human (الإنسان الكامل). For it is not intrinsic to the reality (حقيقته) of the angel (الملك) that this be his station (مقامه); rather, the angel is the one who disavows [power and strength], because he is not a comprehensive servant (عبد جامع). He is merely a limb among the limbs of the comprehensive servant.\n\nThe comprehensive servant is he in whom no Attribute (صفة) of his Lord remains but that it is found in him. And part of His form in the capacity (الاقتدار) to bring us into existence is our acceptance (قبولنا) of that. Thus, there is no absolute power (قوة مطلقة) from one [party] without an assistant. When He knew from us that we knew this, He legislated for us that we should seek help from Him, since the recipient (القابل) needs the powerful one (مقتدر), just as the powerful one seeks acceptance (القبول) from the recipient. Thus, the division between us and Him Almighty became sound, for He is the Truthful One (الصادق).\n\nHe has said: \"I have divided the Prayer (الصلاة) between Myself and My servant into two halves: half for Me and half for My servant.\"\n\nSo, the capacity (الاقتدار) is from Him, and the acceptance (القبول) is from us. And by means of these two, the World (العالم) appeared in Existence (الوجود). The proof is that the impossible (المحال) does not accept Existence, so capacity does not penetrate it, because it is intrinsic to the reality of capacity that it only relates to the possible (الممكن). And the possible has no meaning other than acceptance. Therefore, only the comprehensive servant can rightly say: \"There is no power nor strength save in God.\" Thus, everyone who disavows [power and strength] is a part of the comprehensive one. And everyone who affirms the two matters [power and strength] is a comprehensive one, knowing himself and his Lord, possessing proper spiritual etiquette (أديب), and giving the matter its due right.\n\nSo there is no power nor strength from Him,\nIf I am not, while I am the actualizer.\n\nAnd there is no power nor strength from Him,\nIf He is not, while I am the comprehensive one.\n\nDo you not see that [this phrase] is a treasure (كنز) that God concealed within the angelic realm (الملك) until He brought Adam into existence upon His form and made him a vicegerent (خليفة) on His earth? And those who objected, objected, as God Almighty informed regarding that. And \"There is no power nor strength save in God\" was not heard before the creation of Adam. And every speaker who says it, other than the comprehensive servant, only says it by virtue of following him.\n\nWhen the Throne (العرش) was created and the angels were commanded to carry it, they could not bear it. When they were incapable, the one carrier among them, who was upon the form of the human (صورة الإنسان), stood up and said with the tongue that God granted him: \"There is no power nor strength save in God.\" Then the rest of the group spoke by his saying, and thus they carried the Throne and were able to bear it.\n\nWhen God brought the Perfect Human (الإنسان الكامل) into existence, He made for him a heart (قلبا) like the Throne, making it a house for Himself. There is none in the World who can bear the heart of the believer, because they were incapable of bearing the Throne, and yet the Throne is in a corner of the corners of the believer’s heart, which he does not perceive and does not know that the Throne is there, due to its lightness upon him. And He made His Beautiful Names (أسماءه الحسنى) surround this heart, just as the angels surround the Throne. And He made its carriers four: Divine Knowledge (العلم الإلهي), Life (الحياة), Will (الإرادة), and Speech (القول). Life is the counterpart of the carrier among the bearers of the Throne who is upon the form of the human, due to the permeation of Life throughout all things, for there is nothing but the Living. And Life is the condition that validates the rest of the Attributes (الصفات): Knowledge, Will, and Speech.\n\nIt is related in the tradition (الخبر) that when Gabriel (جبريل) taught Adam (آدم) the circumambulation (الطواف) of the House, he said to him: \"We circumambulated the House thousands and thousands of years before you were created.\" Adam asked him: \"What did you say when you circumambulated it?\" Gabriel replied: \"We used to say: *Subhan Allah* (Glory be to God), *Al-Hamdu Lillah* (Praise be to God), *La ilaha illa Allah* (There is no god but God), and *Allahu Akbar* (God is Greater).\" Adam said: \"And I will add for you: 'There is no power nor strength save in God' (لا حول ولا قوة إلا بالله).\"\n\nThus, Adam (peace be upon him) was uniquely characterized by this treasure. There is none who can intervene (يحول) between you and that which you are capable of accepting—which, if you accept it, would strike you down and lower you from your rank (رتبتك), meaning the rank of your perfection (كما لك), to your animality (حيوانيتك)—except God. Nor is there any strength (قوة) for you concerning the actions (الأعمال) with which He has charged you, except through God. Just as nothing intervenes between the Real (الحق), despite His capacity (اقتداره), and that in which existence is not valid, except through you—unless you do not exist. Therefore, your existence is necessary in that which cannot exist except through you. And [there is] no strength—meaning, capacity does not penetrate an affair that does not manifest except through you. Thus, part of the division (القسمة) is the manifestation of the Reality (حقيقة) of \"There is no power nor strength save in God\" in you and in Him, according to the states (الأحوال) that demand it.\n\nThere is none more comprehensive than the comprehensive human, and nothing more noble within him among his parts except the angelic part (الجزء الملكي) of him. Just as the remembrance of God (*dhikr*) in the Prayer is the noblest part of the Prayer, but not that *dhikr* is nobler than the Prayer itself. Similarly, the angel is not nobler than the human, because he is a part of the human, just as *dhikr* is a part of the Prayer. God Almighty said: <<إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ>> (Indeed, the Prayer prohibits immorality and wrongdoing)—meaning by its form (صورتها). For the first *takbira* (Allahu Akbar) is its consecration (تحريمها), and the salutation (*salam*) is its deconsecration (تحليلها) from immorality and wrongdoing, due to the consecration contained within it. And <<لَذِكْرُ الله أَكْبَرُ>> (And the remembrance of God is greater)—meaning within it [the Prayer], because *dhikr* is a part of it, and it is the greatest of its parts. And in it [the *dhikr*] the division occurred between God and the one praying, within the Prayer.\n\nIf you know this, you know the station (مقام) of the angel, and he does not depart from you. You have grasped the matter as it truly is, acted justly, and understood the source of the error made by those who erred concerning the chapter of preference (المفاضلة). God Almighty is the totality of His Names (أسماءه), even with the differences in rank among them in terms of the universality of their relation. So, pay attention. And say: <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge). And adopt the spiritual etiquette (*adab*) of the Real upon which He stands.\n\nFor when the servant says: \"There is no power nor strength save in God,\" his Lord confirms him, and the Lord says: \"There is no power nor strength save in Me.\" And He does not venture to say: \"There is no power nor strength save in you, O My servant.\" For this phrase does not manifest from its speaker except through its speaker. But since God Almighty knew that the animal human (الإنسان الحيوان) shares the human form with the Perfect Human, He knew that if the Real were to say: \"There is no power nor strength save in you,\" the animal human would apply it inappropriately (في غير موطنها) and thus commit a breach of etiquette (أساء الأدب). The Perfect Human does not do such a thing. Thus, the Real observed the sanctity [of the phrase] so that the Perfect One might learn.\n\nTherefore, this is a matter to be learned and believed, but no speaker should utter it, nor should it pass across the tongue of a specialized servant (عبد مختص), except in the clarification of Knowledge, so that the matter may be known as it truly is. For God took a covenant from the scholars (العلماء) that they should teach those who do not know what God has taught them. And among what He taught them is spiritual etiquette, so they do not place wisdom (الحكمة) except with those who are worthy of it. This is their concern, may God be pleased with them. And God <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the way).",
    "ur": "باب چار سو چھہتر: اس قطب کے حال کی معرفت میں جس کا مقام \"لا حول ولا قوة إلا بالله\" (اللہ کے سوا نہ کوئی طاقت ہے اور نہ کوئی قوت) تھا۔\n\nقوت اور طاقت اللہ ہی کے لیے ہے، اس شخص کے نزدیک جو اللہ پر ایمان رکھتا ہے۔\nاور حقیقت (التحقیق) تو یہ ہے کہ وہ بندہ دیکھے کہ قوت اور طاقت اللہ ہی کے لیے ہے۔\nاور جو شخص دونوں (قوت اور طاقت) کو اپنے نفس میں دیکھتا ہے، وہ اللہ کے نور پر ہے۔\n\n### [بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا]\n\nاللہ تعالیٰ نے یہ بتاتے ہوئے فرمایا کہ موسیٰ علیہ السلام نے اپنی قوم سے کہا: \"اسْتَعِينُوا بِاللَّهِ\" (اللہ سے مدد مانگو)۔ اور اس نے ہمارے اور اپنے درمیان تقسیم میں یہ بات مشروع کی کہ ہم کہیں: \"وإِيَّاكَ نَسْتَعِينُ\" (اور ہم تجھ ہی سے مدد مانگتے ہیں)۔ پس اللہ نے فرمایا: \"یہ میرے اور میرے بندے کے درمیان ہے، اور میرے بندے کے لیے وہ ہے جو اس نے مانگا۔\"\n\nیہ علم کہ \"لا حول ولا قوة إلا بالله\" (اللہ کے سوا نہ کوئی طاقت ہے اور نہ کوئی قوت) اس شخص کی خصوصیات میں سے ہے جسے اللہ نے اپنی صورت پر پیدا کیا، اور وہ الإنسان الکامل (انسان کامل) ہے۔ کیونکہ فرشتے کی حقیقت میں یہ مقام نہیں ہے، بلکہ وہ اس سے براءت اختیار کرنے والا ہے، کیونکہ وہ عبد جامع (جامع بندہ) نہیں ہے۔ بلکہ وہ عبد جامع کے اعضاء میں سے ایک عضو ہے۔ پس عبد جامع وہ ہے جس میں اپنے آقا کی کوئی صفت باقی نہ رہی ہو مگر وہ اس میں موجود ہو۔ اور ہماری تخلیق پر قدرت میں اس کی صورت یہ ہے کہ ہم اسے قبول کریں۔ پس وہاں کوئی مطلق قوت نہیں ہے جو کسی مددگار کے بغیر ایک سے ہو۔ جب اللہ نے ہم سے یہ جان لیا کہ ہم یہ جانتے ہیں، تو اس نے ہمارے لیے یہ مشروع کیا کہ ہم اس سے مدد مانگیں، کیونکہ قبول کرنے والے کو مقتدر (قدرت والے) کی ضرورت ہوتی ہے، جیسا کہ مقتدر نے قبول کرنے والے سے قبولیت طلب کی۔ پس ہمارے اور اس (اللہ) کے درمیان تقسیم درست ثابت ہوئی، کیونکہ وہ سچا ہے۔\n\nاور اس نے فرمایا: \"میں نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کیا، آدھا حصہ میرے لیے ہے اور آدھا حصہ میرے بندے کے لیے ہے۔\" پس اقتدار (الاقتدار) اس کی طرف سے ہے اور قبولیت (القبول) ہماری طرف سے، اور ان دونوں کے ذریعے عالم الوجود (الوجود) میں ظاہر ہوا۔ اس کی دلیل یہ ہے کہ محال (ناممکن) وجود کو قبول نہیں کرتا، لہٰذا اس میں اقتدار نافذ نہیں ہوتا، کیونکہ اقتدار کی حقیقت یہ ہے کہ وہ صرف ممکن (ممکن الوجود) سے متعلق ہوتا ہے، اور ممکن کا معنی قبولیت کے سوا کچھ نہیں۔ لہٰذا \"لا حول ولا قوة إلا بالله\" صرف عبد جامع (جامع بندہ) ہی کہہ سکتا ہے۔ پس ہر وہ شخص جو براءت اختیار کرتا ہے، وہ جامع کا ایک جزو ہے، اور ہر وہ شخص جو دونوں امور (حول اور قوت) کو ثابت کرتا ہے، وہ جامع ہے، جو اپنے نفس اور اپنے رب کو جاننے والا، باادب ہے، اور معاملے میں اس کا حق ہے۔\n\nاس کی طرف سے نہ کوئی طاقت ہے اور نہ کوئی قوت، اگر میں نہ ہوں اور میں ہی واقع ہونے والا ہوں۔\nاس کی طرف سے نہ کوئی طاقت ہے اور نہ کوئی قوت، اگر وہ نہ ہو اور میں ہی الجامع (جامع) ہوں۔\n\nکیا تم نہیں دیکھتے کہ یہ ایک خزانہ ہے جسے اللہ نے فرشتوں میں چھپا دیا، یہاں تک کہ اس نے آدم کو اپنی صورت پر پیدا کیا اور اسے اپنی زمین میں خلیفہ بنایا؟ اور جس نے اعتراض کیا اس نے اعتراض کیا، جیسا کہ اللہ تعالیٰ نے اس بارے میں خبر دی ہے۔ اور آدم کی تخلیق سے پہلے \"لا حول ولا قوة إلا بالله\" نہیں سنا گیا تھا۔ اور ہر کہنے والا جو اسے عبد جامع (جامع بندہ) کے علاوہ کہتا ہے، وہ صرف اس کی پیروی کے حکم سے کہتا ہے۔ اور جب اللہ نے عرش کو پیدا کیا اور فرشتوں کو اسے اٹھانے کا حکم دیا تو وہ اسے اٹھا نہ سکے، جب وہ عاجز ہو گئے تو ان میں سے وہ ایک اٹھانے والا جو انسان کی صورت پر تھا، کھڑا ہوا اور اپنی زبان سے کہا، جو اللہ نے اسے عطا کیا تھا: \"لا حول ولا قوة إلا بالله\" (اللہ کے سوا نہ کوئی طاقت ہے اور نہ کوئی قوت)۔ پس باقی ماندہ جماعت نے بھی اس کے قول کے ساتھ کہا، تو عرش اٹھا لیا گیا اور وہ اس کی طاقت رکھ سکے۔\n\nپھر جب اللہ نے الإنسان الکامل (انسان کامل) کو پیدا کیا، تو اس کے لیے عرش کی مانند ایک دل بنایا، جسے اس نے اپنا گھر بنایا۔ پس عالم (دنیا) میں کوئی نہیں جو مومن کے دل کا بوجھ اٹھا سکے، کیونکہ وہ عرش کو اٹھانے سے عاجز ہو گئے تھے، اور وہ (عرش) مومن کے دل کے ایک کونے میں ہے، جسے وہ محسوس نہیں کرتا اور نہ جانتا ہے کہ وہاں عرش ہے، اس کے ہلکے پن کی وجہ سے۔ اور اس نے اپنے أسماءه الحسنى (اسمائے حسنیٰ) کو اس دل کے گرد جمع کیا، جیسا کہ فرشتے عرش کے گرد جمع ہوتے ہیں۔ اور اس کے اٹھانے والوں کو العلم الإلهي (علم الٰہی)، حیات، ارادہ اور قول چار بنایا۔ پس حیات اس اٹھانے والے کی مانند ہے جو عرش کے اٹھانے والوں میں سے انسان کی صورت پر ہے، کیونکہ حیات اشیاء میں سرایت کرتی ہے، پس وہاں کوئی نہیں مگر زندہ، اور حیات علم، ارادہ اور قول جیسی باقی صفات کی صحت کے لیے شرط ہے۔\n\nخبر میں آیا ہے کہ جب جبرائیل نے آدم کو بیت اللہ کا طواف (الطواف بالبيت) سکھایا اور ان سے کہا: \"ہم تمہاری تخلیق سے اتنے اتنے ہزار سال پہلے بیت اللہ کا طواف کر چکے تھے۔\" تو آدم نے ان سے پوچھا: \"تم طواف کے وقت کیا کہتے تھے؟\" تو جبرائیل نے کہا: \"ہم کہتے تھے: سبحان الله والحمد لله ولا إله إلا الله والله أكبر۔\" تو آدم نے کہا: \"اور میں تمہارے لیے اس میں اضافہ کرتا ہوں: لا حول ولا قوة إلا بالله۔\"\n\nپس آدم علیہ السلام اس خزانے کے ساتھ خاص ہو گئے۔ پس تمہارے اور اس چیز کے درمیان جسے تم قبول کرنے والے ہو، جو اگر تم قبول کر لو تو تمہیں مارے گی اور تمہیں تمہارے کمال کے مرتبے سے تمہاری حیوانیت (حيوانيتك) کی طرف گرا دے گی، اللہ کے سوا کوئی حائل نہیں ہو سکتا۔ اور جو اعمال تم پر فرض کیے گئے ہیں، ان پر تمہیں اللہ کے سوا کوئی قوت نہیں ہے۔ جیسا کہ حق (الحق) اپنے اقتدار (اقتدار) کے باوجود، اور اس چیز کے درمیان جس میں وجود صحیح نہیں ہوتا، تمہارے سوا کوئی حائل نہیں ہوتا، مگر تم۔ پس تمہارا ہونا ضروری ہے اس چیز میں جو تمہارے بغیر موجود نہیں ہوتی۔ اور کوئی قوت نہیں، یعنی اقتدار اس معاملے میں نافذ نہیں ہوتا جو تمہارے بغیر ظاہر نہیں ہوتا۔ پس تقسیم میں سے یہ ہے کہ \"لا حول ولا قوة إلا بالله\" کی حقیقت تم میں اور اس میں ان احوال کے مطابق ظاہر ہو جن کا تم تقاضا کرتے ہو۔ پس الإنسان الجامع (جامع انسان) سے زیادہ جامع کوئی نہیں، اور اس میں اس کے اجزاء سے زیادہ کوئی شرف والا نہیں، سوائے اس کے ملکی جزو کے۔ جیسا کہ نماز میں اللہ کا ذکر نماز کے اجزاء میں سب سے زیادہ شرف والا ہے، نہ کہ ذکر نماز سے زیادہ شرف والا ہے۔ جیسا کہ فرشتہ انسان سے زیادہ شرف والا نہیں ہو سکتا کیونکہ وہ انسان کا ایک جزو ہے، اور ذکر نماز کا ایک جزو ہے۔ اللہ تعالیٰ نے فرمایا: \"إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ\" (بے شک نماز بے حیائی اور برائی سے روکتی ہے)۔ یعنی اپنی صورت کے اعتبار سے، کیونکہ پہلی تکبیر اس کی تحریم ہے اور سلام اس سے تحلیل ہے۔ یہ بے حیائی اور برائی سے روکتی ہے اس تحریم کی وجہ سے جو اس میں ہے۔ اور \"وَلَذِكْرُ الله أَكْبَرُ\" (اور اللہ کا ذکر سب سے بڑا ہے)۔ یعنی اس (نماز) میں، کیونکہ ذکر اس کا ایک جزو ہے اور وہ اس کا سب سے بڑا جزو ہے۔ اور اسی میں نماز میں اللہ اور نمازی کے درمیان تقسیم واقع ہوئی۔ پس جب تم یہ جان لو گے، تو تم فرشتے کا مقام جان لو گے، اور وہ تم سے باہر نہیں نکلے گا، اور تم معاملے کو اس کی اصل حالت پر پاؤ گے، اور تم انصاف کرو گے، اور تم جان لو گے کہ فضیلت کے باب میں جس پر جو کچھ آیا، وہ کہاں سے آیا۔ اللہ تعالیٰ اپنے تمام اسماء کا مجموعہ ہے، باوجود اس کے کہ عمومی تعلق میں ان میں تفاضل (فضیلت) ہے۔ پس اپنے دل کو متوجہ کرو اور کہو: \"قُلْ رَبِّ زِدْنِي عِلْماً\" (کہو: اے میرے رب! میرے علم میں اضافہ فرما)۔ اور حق (الحق) کے آداب سے مؤدب ہو جاؤ جن پر وہ قائم ہے۔ کیونکہ جب بندہ \"لا حول ولا قوة إلا بالله\" کہتا ہے تو اس کا رب اس کی تصدیق کرتا ہے اور رب کہتا ہے: \"لا حول ولا قوة إلا بی\" (میرے سوا نہ کوئی طاقت ہے اور نہ کوئی قوت)۔ اور وہ یہ کہنے کی طرف متوجہ نہیں ہوتا کہ \"لا حول ولا قوة إلا بک یا عبدی\" (اے میرے بندے! تیرے سوا نہ کوئی طاقت ہے اور نہ کوئی قوت)۔ کیونکہ یہ کلمہ اس کے کہنے والے سے صرف اس کے کہنے والے کے ذریعے ہی ظاہر ہوتا ہے۔ لیکن جب اللہ تعالیٰ نے جان لیا کہ الإنسان الحيوان (حیوانی انسان) انسانی صورت میں الإنسان الکامل (انسان کامل) کا شریک ہے، تو اسے علم ہوا کہ اگر حق (الحق) یہ کہے کہ \"لا حول ولا قوة إلا بک\" تو الإنسان الحيوان اسے اس کے غیر مقام پر استعمال کرے گا، پس وہ بے ادبی کرے گا۔ اور الإنسان الکامل ایسا نہیں کرتا۔ پس حق نے حرمت کا خیال رکھا تاکہ کامل سیکھ لے، لہٰذا یہ ایک ایسا مسئلہ ہے جسے سیکھا جاتا ہے اور اس پر اعتقاد رکھا جاتا ہے، اور کوئی بولنے والا اسے زبان پر نہیں لاتا، اور نہ ہی یہ کسی خاص بندے کی زبان پر جاری ہوتا ہے، سوائے علم کے بیان میں، تاکہ معاملہ اپنی اصل حالت پر معلوم ہو جائے۔ کیونکہ اللہ نے علماء سے عہد لیا ہے کہ وہ اسے سکھائیں جسے وہ نہیں جانتا جو اللہ نے انہیں سکھایا ہے، اور جو کچھ اللہ نے انہیں سکھایا ہے اس میں سے ادب بھی ہے۔ پس وہ حکمت (الحکمة) کو صرف اس کے اہل میں ہی رکھتے ہیں۔ یہ ان کا شیوہ ہے، اللہ ان سے راضی ہو۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و هفتاد و ششم در معرفت حال قطبی که منزل او «لا حول ولا قوة إلا بالله» بود\n\nدگرگونی و نیرو از آنِ حق است *** نزد آن کس که به خدا ایمان دارد\nو همانا تحقق (تحقیق) بنده آن است که ببیند *** دگرگونی و نیرو از آنِ حق است\nو هر کس این دو امر را در نفس خود ببیند *** پس او بر نوری از جانب حق است\n\n[همانا خداوند آدم را بر صورت خود آفرید]\n\nخداوند متعال در معرفی این امر فرمود که موسی (علیه السلام) به قوم خود گفت: اسْتَعِينُوا بِاللَّهِ (از خدا یاری جویید). و برای ما در تقسیم میان خود و ما مقرر فرمود که بگوییم: وإِيَّاكَ نَسْتَعِينُ (و تنها از تو یاری می‌جوییم). پس فرمود: «این میان من و بنده من تقسیم شده است و برای بنده من هر چه بخواهد هست.»\n\nبدان که «لا حول ولا قوة إلا بالله» (هیچ دگرگونی و نیرویی جز به واسطه خدا نیست) از ویژگی‌های کسی است که خداوند او را بر صورت خود آفرید، و او همان انسان کامل (الإنسان الکامل) است. زیرا فرشته (الملک) از حقیقتش نیست که این مقام، مقام او باشد، بلکه او متبرّی (بی‌نیاز از حول و قوه) است، زیرا او بنده جامع (العبد الجامع) نیست، بلکه عضوی از اعضای بنده جامع است. پس بنده جامع کسی است که هیچ صفتی در سَرور خود (حق) باقی نمانده مگر آنکه در او باشد. و از صورت او در اقتدار بر ایجاد ما، پذیرش ما برای آن است. پس هیچ نیروی مطلقی از یک واحد بدون کمک‌کننده وجود ندارد. چون حق دانست که ما این را می‌دانیم، برای ما مقرر فرمود که از او یاری جوییم، زیرا پذیرنده (قابل) نیازمند مقتدر است، همان‌طور که مقتدر، پذیرش را از پذیرنده طلب کرد. پس این تقسیم میان ما و او تعالی صحیح است، زیرا او صادق است.\n\nو حق فرموده است: «نماز را میان خود و بنده ام به دو نیم تقسیم کردم، نیمی از آن برای من و نیمی برای بنده ام.»\n\nپس اقتدار (الاقتدار) از اوست و پذیرش (القبول) از ما، و با این دو، عالم در هستی (الوجود) ظاهر شد. دلیل آن این است که محال، هستی را نمی‌پذیرد، پس اقتدار در آن نفوذ نمی‌کند، زیرا از حقیقت اقتدار این است که جز به ممکن تعلق نمی‌گیرد، و ممکن معنایی جز پذیرش (قبول) ندارد. پس گفتن «لا حول ولا قوة إلا بالله» جز برای بنده جامع (العبد الجامع) صحیح نیست. پس هر کس که تبرّی جوید، جزئی از جامع است، و هر کس که هر دو امر (حول و قوه) را اثبات کند، او جامع و عالم به نفس خود و پروردگارش است و با ادب است و حق امر را ادا کرده است.\n\nنه دگرگونی از اوست و نه نیرویی *** اگر من نباشم، در حالی که من واقع‌شونده‌ام\nنه دگرگونی از اوست و نه نیرویی *** اگر او نباشد، در حالی که من جامع هستم\n\nآیا نمی‌بینی که این (لا حول ولا قوة إلا بالله) گنجی است که خداوند آن را در ملک (عالم فرشتگان) پنهان کرد تا اینکه آدم را بر صورت خود آفرید و او را خلیفه (الخلیفة) در زمین خود قرار داد، و هر کس که اعتراض کرد، همان‌طور که خداوند در این باره خبر داده، اعتراض کرد. و قبل از آفرینش آدم، «لا حول ولا قوة إلا بالله» شنیده نشد. و هر گوینده‌ای که آن را بگوید، غیر از بنده جامع، تنها به حکم تبعیت از او می‌گوید. و هنگامی که عرش (العرش) آفریده شد و به فرشتگان دستور داده شد که آن را حمل کنند، نتوانستند. وقتی عاجز شدند، حامل واحدی از میان آن‌ها که بر صورت انسان بود، برخاست و با زبان خود، به آنچه خداوند به او عطا کرده بود، گفت: «لا حول ولا قوة إلا بالله». پس بقیه آن جمع نیز به گفتار او گفتند و عرش را حمل کردند و توانستند. هنگامی که خداوند انسان کامل (الإنسان الکامل) را آفرید، برای او قلبی مانند عرش قرار داد و آن را خانه خود ساخت. پس در عالم کسی نیست که توان حمل قلب مؤمن را داشته باشد، زیرا آن‌ها از حمل عرش عاجز ماندند، در حالی که عرش در گوشه‌ای از زوایای قلب مؤمن است و او آن را حس نمی‌کند و نمی‌داند که آنجا عرشی هست، به دلیل سبکی آن بر او. و خداوند اسماء الحسنی خود را قرار داد که این قلب را احاطه کنند، همان‌طور که فرشتگان عرش را احاطه کرده‌اند. و حاملان آن را چهار چیز قرار داد: علم الهی، حیات، اراده و قول. حیات (الحیاة) نظیر آن حامل است که بر صورت انسان بود از حاملان عرش، به دلیل سریان حیات در اشیاء، پس در آنجا جز زنده نیست، و حیات شرط تصحیح‌کننده برای بقیه صفات از علم و اراده و قول است.\n\nدر خبر آمده است که جبرئیل هنگامی که طواف خانه (بیت) را به آدم آموخت، به او گفت: «ما قبل از اینکه تو آفریده شوی، به فلان و فلان هزار سال، خانه را طواف می‌کردیم.» آدم به او گفت: «هنگام طواف چه می‌گفتید؟» جبرئیل گفت: «ما می‌گفتیم: سبحان الله والحمد لله ولا إله إلا الله والله أكبر (پاک است خدا و ستایش از آن خداست و هیچ معبودی جز خدا نیست و خدا بزرگ‌تر است).» آدم گفت: «و من بر آن می‌افزایم: لا حول ولا قوة إلا بالله.»\n\nپس آدم (علیه السلام) به این گنج اختصاص یافت. پس هیچ کس نیست که میان تو و آنچه قابلیت پذیرش آن را داری، حائل شود، که اگر آن را بپذیری، تو را بزند و از رتبه کمالت (رتبة کمالک) به حیوان بودنت (حیوانيتک) پایین آورد، مگر خداوند. و تو را بر اعمالی که مکلف شده‌ای، نیرویی نیست مگر به واسطه خداوند. همان‌طور که حق با اقتدارش، میان آنچه وجود در آن صحیح نیست و میان تو حائل نمی‌شود، مگر به واسطه تو، اگر تو نباشی. پس ناگزیر باید در آنچه جز به واسطه تو موجود نمی‌شود، باشی. و «لا قوة» (هیچ نیرویی نیست) یعنی اقتدار در امری که جز به واسطه تو ظاهر نمی‌شود، نفوذ نمی‌کند. پس از جمله تقسیم این است که حقیقت «لا حول ولا قوة إلا بالله» در تو و در او، بر حسب احوالی که طلب می‌کنی، ظاهر شود. پس هیچ کس جامع‌تر از انسان جامع (الإنسان الجامع) نیست و هیچ چیز در او شریف‌تر از اجزای او نیست، مگر جزء ملکی آن. همان‌طور که ذکر خدا در نماز شریف‌ترین اجزای نماز است، نه اینکه ذکر شریف‌تر از نماز باشد. همان‌طور که فرشته (الملک) شریف‌تر از انسان نیست، زیرا او جزئی از انسان است، و ذکر جزئی از نماز است. خداوند متعال می‌فرماید: إِنَّ الصَّلاةَ تَنْهى‏ عَنِ الْفَحْشاءِ والْمُنْكَرِ (همانا نماز از زشتی و ناپسندی باز می‌دارد). یعنی به صورتش، زیرا تکبیره اولی تحریم آن است و سلام از آن، تحلیل آن از فحشاء و منکر است، به دلیل تحریمی که در آن است. و لَذِكْرُ الله أَكْبَرُ (و قطعاً یاد خدا بزرگ‌تر است)، یعنی در آن (نماز)، زیرا ذکر جزئی از آن است و بزرگ‌ترین جزء آن است، و تقسیم میان خدا و نمازگزار در نماز در آنجا واقع شده است. پس اگر این را دانستی، مقام فرشته را دانستی و او از تو خارج نشد و امر را بر همان‌طور که هست دریافتی و انصاف دادی و دانستی که از کجا بر کسی که در باب برتری دادن (مفاضله) بر او وارد شده، وارد شده است. خداوند متعال مجموع اسماء خود است، با وجود برتری در آن‌ها در عموم تعلق. پس توجه کن و بگو: قُلْ رَبِّ زِدْنِي عِلْماً (بگو پروردگارا، علم مرا زیاد کن). و به آداب حق که او بر آن‌هاست، مؤدب شو. زیرا بنده هنگامی که می‌گوید: «لا حول ولا قوة إلا بالله»، پروردگارش او را تصدیق می‌کند و می‌گوید: «لا حول ولا قوة إلا بی» (هیچ دگرگونی و نیرویی جز به واسطه من نیست). و متعرض نمی‌شود که بگوید: «لا حول ولا قوة إلا بک یا عبدی» (هیچ دگرگونی و نیرویی جز به واسطه تو نیست ای بنده من). زیرا این کلمه از گوینده‌اش جز به واسطه گوینده‌اش ظاهر نمی‌شود. اما چون حق تعالی دانست که انسان حیوانی (الإنسان الحیوان) در صورت انسانی با انسان کامل (الإنسان الکامل) شریک است، دانست که اگر حق بگوید: «لا حول ولا قوة إلا بک»، انسان حیوانی آن را در غیر موضعش به کار می‌برد و بی‌ادبی می‌کند. و انسان کامل چنین کاری نمی‌کند. پس حق حرمت را رعایت کرد تا کامل بیاموزد. پس این مسئله‌ای است که باید آموخته و اعتقاد شود و هیچ گوینده‌ای آن را بر زبان نیاورد و بر زبان بنده مختص جاری نشود، مگر در بیان علم، تا امر بر همان‌طور که هست دانسته شود. زیرا خداوند از علما عهد گرفته است که آنچه را خداوند به آن‌ها آموخته، به کسی که نمی‌داند بیاموزند، و از جمله آنچه به آن‌ها آموخته، ادب است. پس حکمت را جز در اهلش قرار نمی‌دهند. این از شأن آن‌هاست، خداوند از آن‌ها راضی باد. و وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}