{
  "id": 538,
  "title": {
    "ar": "الباب الثامن والثلاثون وخمسمائة في معرفة حال قطب كان منزله فَاسْتَقِمْ كَما أُمِرْتَ",
    "en": "Chapter Five Hundred and Thirty-Eight, Concerning the Knowledge of the State of a Pole (قطب) Whose Station was: <<فَاسْتَقِمْ كَما أُمِرْتَ>> (So stand firm as you have been commanded).",
    "ur": "باب پانچ سو اڑتیس (۵۳۸): ایک قطب کے حال کی معرفت کے بارے میں جس کا روحانی مقام (منزل) یہ تھا: \"فَاسْتَقِمْ كَما أُمِرْتَ\" (پس آپ ثابت قدم رہیں جیسا کہ آپ کو حکم دیا گیا ہے)۔",
    "fa": "باب پانصد و سی و هشتم در معرفت حال قطبی که منزل او «فَاسْتَقِمْ كَما أُمِرْتَ» (پس همان‌گونه که فرمان یافته‌ای استقامت کن) بود."
  },
  "content": {
    "ar": "## «الباب الثامن والثلاثون وخمسمائة في معرفة حال قطب كان منزله فَاسْتَقِمْ كَما أُمِرْتَ»\n\n\n> المستقيم الذي قامت قيامته *** من غير موت ولا يدري به أحد\n\n\n> وليس يصرفه عن أمر خالقه *** من الخلائق لا أهل ولا ولد\n\n\n> وما له في وجود الكون مستند *** إلا الإله الذي إليه يستند\n\n\n> إليه يرفع من في الكون حاجته *** لأنه السيد المحسان والصمد\n\n\n> هو المهيمن لا تحصى عوارفه *** يدري بذلك سباق ومقتصد\n\n\n### [فاستقم كما أمرت‏]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم شيبتني هود وأخواتها من كل سورة فيها ذكر الاستقامة\n\n\nفإنه والمؤمنين مأمور بها والحكم للعلم لا للأمر وما الله بِظَلَّامٍ لِلْعَبِيدِ فإنه ما علم تعالى إلا ما أعطته المعلومات فالعلم يتبع المعلوم ولا يظهر في الوجود إلا ما هو المعلوم عليه فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ ومن لم يعرف الأمر هكذا فما عنده خبر بما هو الأمر عليه فالإنسان جاهل بما يكون منه قبل كونه فإذا وقع منه ما وقع فما وقع إلا بعلم الله فيه وما علم إلا ما كان المعلوم عليه فصح قوله ولا يَرْضى‏ لِعِبادِهِ الْكُفْرَ والرضاء إرادة فلا تناقض بين الأمر والإرادة وإنما النقض بين الأمر وما أعطاه العلم التابع للمعلوم فهو فَعَّالٌ لِما يُرِيدُ وما يريد إلا ما هو عليه العلم وما لنا من الأمر الإلهي إلا صيغة الأمر وهي من جملة المخلوقات في لفظ الداعي إلى الله تعالى فهي مرادة معلومة كائنة في فم الداعي إلى الله فتنبه واعتبر وقُلْ رَبِّ زِدْنِي عِلْماً فمن ازداد علما ازداد حكما فانظر فيما أمرت به أو نهيت عنه من حيث إنك محل لوجود عين ما أمرت به أو نهيت عنه من حيث إنك محل لوجود عين ما أمرت به فمتعلق الأمر عند صاحب هذا النظر أن يهيئ محله بالانتظار فإذا جاء الأمر الإلهي الذي يأتي بالتكوين بلا واسطة فينظر أثره في قلبه أو لا فإن وجد الإباية قد تكونت في قلبه فيعلم أنه مخذول وأن خذلانه منه لأنه على هذه الصورة في حضرة ثبوت عينه التي أعطت العلم لله به وإن وجد غير ذلك وهو القبول فكذلك أيضا فينظر في العضو الذي تعلق به ذلك الأمر المشروع أن يتكون فيه من أذن أو عين أو يد أو رجل أو لسان أو بطن أو فرج فإنا قد فرغنا من القلب بوجود الإباية أو القبول فلا نزال نراقب حكم العلم فينا من الحق حتى نعلم ما كنا فيه فإنه لا يحكم فينا إلا بنا كما قلنا\n\n\n> أيها العذب التجني والجنا *** أيها البدر سناء وسنا\n\n\n> نحن حكمناك في أنفسنا *** فاحكم إن شئت علينا أو لنا\n\n\n> فإذا تحكم فينا إنما *** عين ما تحكمه فينا بنا\n\n\nومن كان هذا حاله في مراقبته وإن وقع منه خلاف ما أمر به فإنه لا يضره ولا ينقصه عند الله إفضالا من الله لا تحكما عليه عز وجل فإن المراد قد حصل الذي يعطي السعادة وهو المراقبة لله في تكوينه وهذا ذوق لا يمكن أن يعلم قدره إلا من كان حاله وهذا هو عين سر القدر لمن فهمه وكم منع الناس من كشفه لما يطرأ على النفوس الضعيفة الايمان من ذلك فليس سر القدر الذي يخفى عن العالم عينه إلا اتباع العلم المعلوم فلا شي‏ء أبين منه ولا أقرب مع هذا البعد فمن كان هذا حاله فقد فاز بدرجة الاستقامة وبها أمر فإنه أمر بالمراقبة\n\n\n> فيتبع الحكم ما يكون *** والصعب من ذلكم يهون‏\n\n\nولذلك لم يكن شيب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بالكثير وإنما كان شعرات معدودة لم تبلغ العشرين متفرقة وقال شيبتني فلو لا هذا الخاطر ما شاب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فلما تبين له الأمر كما قررناه وقف عنه الشيب ولم يقم به هم‏\nوعلم من أين وقع ما وقع فاستقام كما أمر فالله يهدينا صراط من أنعم عليه من النَّبِيِّينَ والصِّدِّيقِينَ والشُّهَداءِ والصَّالِحِينَ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Five Hundred and Thirty-Eight: Concerning Knowledge of the State of a Pole Whose Station is: \"So stand firm [on the straight path] as you have been commanded\"\n\nThe steadfast one whose Resurrection has occurred\nWithout death, and no one knows of it.\n\nAnd nothing among creation turns him from his Creator's command,\nNeither family nor child.\n\nAnd he has no reliance in the existence of the cosmos,\nExcept the God upon Whom he relies.\n\nTo Him raises everyone in the cosmos their need,\nFor He is the Master, the Benefactor, and the Eternal Refuge (الصمد).\n\nHe is the Guardian (المهيمن), whose gifts cannot be counted;\nThe foremost and the moderate know this.\n\n### [So stand firm as you have been commanded]\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"Hud and its sister chapters, from every Sura in which steadfastness (الاستقامة) is mentioned, have aged me.\"\n\nFor he and the believers are commanded by it, yet the ultimate determination belongs to Knowledge (العلم), not to the Command (الأمر). <<وَمَا اللهُ بِظَلَّامٍ لِلْعَبِيدِ>> (And Allah is never unjust to His servants). For He, the Exalted, only knew what the known things (المعلومات) gave Him; thus, Knowledge follows the Known (المعلوم). Nothing appears in Existence (الوجود) except that which is known concerning it. <<فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ>> (So Allah's is the conclusive argument). Whoever does not know the Command in this way has no understanding of what the Command truly entails. Man is ignorant of what will proceed from him before it occurs.\n\nSo when that which occurs from him occurs, it only occurred through Allah's Knowledge concerning it, and He only knew what the Known was upon. Thus, His saying is correct: <<وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ>> (And He does not approve disbelief for His servants). And approval (رضاء) is Will (إرادة). Therefore, there is no contradiction between the Command and the Will. Rather, the apparent conflict is between the Command and what is given by the Knowledge that follows the Known. He is <<فَعَّالٌ لِمَا يُرِيدُ>> (the Doer of what He intends), and He intends nothing except that which Knowledge is upon.\n\nAnd we have nothing of the Divine Command (الأمر الإلهي) except the imperative form itself, which is among the created things (المخلوقات) in the utterance of the caller to Allah, the Exalted. Thus, it is willed, known, and existing in the mouth of the caller to Allah. So be aware, reflect, and say: <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge).\n\nWhoever increases in knowledge increases in wisdom. So look at what you have been commanded or forbidden from the perspective that you are the locus for the existence of the very essence (عين) of what you were commanded or forbidden. The object of the Command, according to the possessor of this perspective, is to prepare his locus (محله) through anticipation. Then, when the Divine Command comes, which brings about creation (التكوين) without intermediary, he looks for its effect in his heart. If he finds refusal (الإباية) has been formed in his heart, he knows that he is forsaken (مخذول), and that his forsaking originates from himself, because he is upon this form in the Presence of the Fixity of his Essence (حضرة ثبوت عينه), which gave Allah the Knowledge (العلم) concerning him.\n\nAnd if he finds otherwise, which is acceptance (القبول), then likewise. He then looks at the limb to which that prescribed Command relates, that it should be formed therein, whether it be the ear, the eye, the hand, the foot, the tongue, the belly, or the private parts. For we have finished with the heart by the existence of refusal or acceptance. We continue to observe the determination of Knowledge (حكم العلم) in us from The Real (الحق) until we know what we were upon, for He only judges concerning us through us, as we have said:\n\nO sweet one, whose offense and crime are sweet,\nO full moon of radiance and light.\n\nWe have made you the judge over our souls,\nSo judge, if you wish, against us or for us.\n\nFor when you judge concerning us, truly,\nThe essence of what you judge concerning us is through us.\n\nAnd whoever is in this state of observation (مراقبة), even if something contrary to what he was commanded occurs from him, it neither harms him nor diminishes him in the sight of Allah. This is a grace (إفضال) from Allah, not a judgment against Him, the Mighty and Majestic. For the intended goal has been achieved, which grants felicity, and that is the observation of Allah in His act of creation (تكوينا). This is a spiritual taste (ذوق) whose value cannot be known except by one whose state it is. And this is the very essence (عين) of the secret of Divine Decree (سر القدر) for whoever understands it.\n\nAnd how many people have been prevented from its unveiling (كشف) due to what might afflict souls weak in faith because of it. For the secret of Divine Decree whose essence is hidden from the world is nothing but the following of Knowledge by the Known. So nothing is clearer than it, nor closer, despite this distance. Whoever is in this state has attained the degree of Steadfastness (الاستقامة), and by it he was commanded, for he was commanded with observation.\n\nSo the judgment follows what occurs,\nAnd the difficult of that becomes easy.\n\nFor this reason, the graying of the Messenger of Allah, may Allah bless him and grant him peace, was not extensive; rather, it was a few scattered hairs, not reaching twenty. Yet he said, \"It aged me.\" Were it not for this thought (خاطر), the Messenger of Allah would not have grayed. But when the Command became clear to him, as we have established, the graying stopped, and no anxiety (هم) remained with him. And he knew whence that which occurred had occurred, so he stood firm (استقام) as he was commanded. May Allah guide us to the path of those upon whom He has bestowed favor: <<النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ>> (the Prophets, the Sincere, the Witnesses, and the Righteous). And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب پانچ سو اڑتیس: اس قطب (قطب) کے حال کی معرفت میں جس کا مقام یہ تھا: 'پس ثابت قدم رہو جیسا کہ تمہیں حکم دیا گیا ہے۔' (فَاسْتَقِمْ كَما أُمِرْتَ)\n\nوہ مستقیم (المستقيم) جس کی قیامت برپا ہو چکی ہے\nبغیر موت کے، اور کوئی اس سے واقف نہیں\n\nاور کوئی مخلوق اسے اپنے خالق کے حکم سے پھیر نہیں سکتی\nنہ اہل و عیال اور نہ ہی اولاد\n\nاور وجودِ کون (وجود الكون) میں اس کا کوئی سہارا نہیں\nسوائے اس معبود کے جس پر وہ بھروسہ کرتا ہے\n\nکائنات میں ہر کوئی اپنی حاجت اسی کی طرف اٹھاتا ہے\nکیونکہ وہ آقا، احسان کرنے والا (المحسن) اور بے نیاز (الصمد) ہے\n\nوہ مہیمن (المهيمن) ہے، اس کے انعامات شمار نہیں کیے جا سکتے\nاس بات کو سبقت لے جانے والا (سباق) اور میانہ رو (مقتصد) جانتے ہیں۔\n\n### [پس ثابت قدم رہو جیسا کہ تمہیں حکم دیا گیا ہے] (فَاسْتَقِمْ كَما أُمِرْتَ)\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"سورۃ ہود اور اس کی ہم مثل سورتوں نے، جن میں بھی استقامت (الاستقامة) کا ذکر ہے، مجھے بوڑھا کر دیا۔\"\n\nکیونکہ آپ (صَلَّى اللهُ عَليهِ وسَلَّم) اور مومنین کو اس کا حکم دیا گیا ہے، لیکن حکم (الحکم) علم (العلم) کے لیے ہے نہ کہ امر (الأمر) کے لیے۔ \"اور اللہ بندوں پر ظلم کرنے والا نہیں ہے\" (وَمَا اللَّهُ بِظَلَّامٍ لِلْعَبِيدِ)۔ کیونکہ اللہ تعالیٰ نے صرف وہی جانا جو معلومات (المعلومات) نے اسے عطا کیا۔ پس علم (العلم) معلوم (المعلوم) کی پیروی کرتا ہے، اور وجود (الوجود) میں صرف وہی ظاہر ہوتا ہے جو اس پر معلوم ہے۔ \"پس اللہ ہی کے لیے کامل حجت ہے\" (فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ)۔ اور جو شخص امر (الأمر) کو اس طرح نہیں جانتا، اسے اس بات کی خبر نہیں کہ امر کس چیز پر ہے۔ انسان اس سے صادر ہونے والی چیز سے قبل اس کے وجود میں آنے سے جاہل ہوتا ہے۔ پس جب اس سے کوئی چیز واقع ہوتی ہے تو وہ صرف اللہ کے علم (علم الله) کے ذریعے ہی واقع ہوتی ہے، اور اللہ نے صرف وہی جانا جو معلوم (المعلوم) پر تھا۔ پس اس کا یہ قول صحیح ہے: \"اور وہ اپنے بندوں کے لیے کفر کو پسند نہیں کرتا\" (وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ)۔ اور رضا (الرضاء) ارادہ (إرادة) ہے۔ لہٰذا امر (الأمر) اور ارادہ (الإرادة) کے درمیان کوئی تضاد نہیں ہے۔ تضاد تو صرف امر اور اس چیز کے درمیان ہے جو معلوم کی پیروی کرنے والے علم (العلم) نے عطا کی ہے۔ پس وہ \"جو چاہتا ہے اسے کرنے والا ہے\" (فَعَّالٌ لِمَا يُرِيدُ)۔ اور وہ صرف وہی چاہتا ہے جس پر علم ہے۔ اور امرِ الٰہی (الأمر الإلهي) میں ہمارے لیے صرف امر کی صیغہ (صيغة الأمر) ہے، اور یہ اللہ تعالیٰ کی طرف بلانے والے کے لفظ میں مخلوقات (المخلوقات) کے زمرے میں سے ہے۔ پس یہ مراد (مرادة)، معلوم (معلومة) ہے، جو اللہ کی طرف بلانے والے کے منہ میں موجود ہے۔ پس ہوشیار ہو جاؤ اور غور کرو، اور کہو: \"اے میرے رب! میرے علم میں اضافہ فرما\" (وَقُلْ رَبِّ زِدْنِي عِلْمًا)۔\n\nپس جو علم (علماً) میں بڑھا، وہ حکم (حكماً) میں بڑھا۔ لہٰذا تم جس چیز کا حکم دیے گئے ہو یا جس سے منع کیے گئے ہو، اس پر اس حیثیت سے غور کرو کہ تم اس چیز کے وجود (وجود) کا محل (محل) ہو جس کا تمہیں حکم دیا گیا یا جس سے منع کیا گیا۔ اس نظر کے حامل شخص کے نزدیک امر (الأمر) کا تعلق یہ ہے کہ وہ انتظار (الانتظار) کے ذریعے اپنے محل کو تیار کرے۔ پھر جب امرِ الٰہی (الأمر الإلهي) آتا ہے جو بغیر کسی واسطے کے تکوین (التكوين) لاتا ہے، تو وہ اپنے دل میں اس کا اثر دیکھتا ہے یا نہیں۔ اگر وہ پاتا ہے کہ انکار (الإباية) اس کے دل میں تشکیل پا چکا ہے، تو وہ جانتا ہے کہ وہ محروم (مخذول) ہے، اور اس کی محرومی اسی کی طرف سے ہے، کیونکہ وہ اپنی عین (عين) کے ثبوت کی حضرہ (حضرة ثبوت عينه) میں اسی صورت پر ہے جس نے اللہ کو اس کے بارے میں علم عطا کیا۔ اور اگر وہ اس کے علاوہ یعنی قبول (القبول) پاتا ہے، تو بھی ایسا ہی ہے۔ پھر وہ اس عضو میں دیکھتا ہے جس سے وہ مشروع امر (الأمر المشروع) متعلق ہے کہ وہ اس میں تشکیل پائے، خواہ وہ کان ہو، آنکھ ہو، ہاتھ ہو، پاؤں ہو، زبان ہو، پیٹ ہو یا شرمگاہ ہو۔ کیونکہ ہم دل کے معاملے سے انکار یا قبول کے وجود (وجود) کے ذریعے فارغ ہو چکے ہیں۔ پس ہم حق (الحق) کی طرف سے اپنے اندر علم (العلم) کے حکم کی نگرانی کرتے رہتے ہیں یہاں تک کہ ہم جان لیں کہ ہم کس حال میں تھے، کیونکہ وہ ہمارے بارے میں ہمارے ذریعے ہی حکم کرتا ہے، جیسا کہ ہم نے کہا:\n\nاے شیریں ظلم اور خطا کے مرتکب،\nاے چمک اور روشنی کے بدر (چاند)!\n\nہم نے تجھے اپنی جانوں پر حاکم بنا دیا ہے،\nپس اگر تو چاہے تو ہمارے خلاف یا ہمارے حق میں فیصلہ کر دے۔\n\nاور جب تو ہم پر حکومت کرتا ہے، تو یہ صرف\nاسی چیز کا عین (عين) ہے جس کا تو ہم پر ہمارے ذریعے فیصلہ کرتا ہے۔\n\nاور جو شخص اپنی مراقبہ (مراقبته) میں اس حال پر ہو، اگرچہ اس سے اس کے حکم کے خلاف کوئی چیز واقع ہو جائے، تو یہ اسے اللہ کے نزدیک نقصان نہیں پہنچاتی اور نہ ہی اس کے مرتبے کو کم کرتی ہے، یہ اللہ کی طرف سے فضل (إفضال) ہے، نہ کہ اس پر اللہ عزوجل کی طرف سے کوئی جبر (تحکم)۔ کیونکہ مطلوبہ مقصد حاصل ہو چکا ہے جو سعادت (السعادة) عطا کرتا ہے، اور وہ اس کی تکوین (تكوينه) میں اللہ کا مراقبہ (المراقبة) ہے۔ اور یہ ایک ذوق (ذوق) ہے جس کی قدر صرف وہی جان سکتا ہے جو اس حال میں ہو۔ اور یہ اس شخص کے لیے سرِ قدر (سر القدر) کا عین (عين) ہے جو اسے سمجھتا ہے۔ اور کتنے ہی لوگوں کو اس کے کشف (کشف) سے روکا گیا ہے، اس وجہ سے کہ اس سے کمزور ایمان والی جانوں (النفوس الضعيفة الايمان) پر کیا اثر پڑ سکتا ہے۔ پس سرِ قدر (سر القدر) جو دنیا سے پوشیدہ ہے، اس کا عین (عين) معلوم علم (العلم المعلوم) کی پیروی کے سوا کچھ نہیں ہے۔ پس اس سے زیادہ واضح کوئی چیز نہیں، اور اس دوری کے باوجود اس سے زیادہ قریب بھی کوئی چیز نہیں۔ پس جو شخص اس حال میں ہو، وہ استقامت (الاستقامة) کے درجے سے کامیاب ہو گیا، اور اسے اسی کا حکم دیا گیا، کیونکہ اسے مراقبہ (المراقبة) کا حکم دیا گیا تھا۔\n\nپس حکم اس کی پیروی کرتا ہے جو ہوتا ہے،\nاور اس میں سے مشکل بھی آسان ہو جاتی ہے۔\n\nاور اسی وجہ سے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے بال زیادہ سفید نہیں ہوئے تھے، بلکہ وہ گنے چنے بال تھے جو بیس تک بھی نہیں پہنچے تھے اور بکھرے ہوئے تھے۔ اور آپ نے فرمایا: \"انہوں نے مجھے بوڑھا کر دیا۔\" اگر یہ خیال (خاطر) نہ ہوتا تو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے بال سفید نہ ہوتے۔ پس جب امر (الأمر) آپ پر واضح ہو گیا جیسا کہ ہم نے بیان کیا، تو سفیدی رک گئی اور کوئی غم (ہم) آپ کے ساتھ قائم نہ رہا۔ اور آپ نے جان لیا کہ جو کچھ ہوا وہ کہاں سے واقع ہوا، پس آپ ثابت قدم رہے جیسا کہ آپ کو حکم دیا گیا۔ اللہ ہمیں ان لوگوں کے راستے کی ہدایت دے جن پر اس نے انعام کیا: \"یعنی نبیوں، صدیقوں، شہیدوں اور صالحین کے\" (مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ)۔ \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و سی و هشتم در معرفت حال قطبی که منزل او «فَاسْتَقِمْ كَما أُمِرْتَ» (پس همان‌گونه که فرمان یافته‌ای، استقامت ورز) بود.\n\nآن مستقیمی که قیامت او برپا شده است،\nبدون مرگ و کسی از آن آگاه نیست.\n\nو هیچ‌کس از خلایق، نه خانواده و نه فرزند،\nاو را از امر خالقش باز نمی‌دارد.\n\nو او در هستی (الوجود) کائنات تکیه‌گاهی ندارد،\nمگر آن معبودی که خود به او تکیه می‌کند.\n\nهر کس در کائنات حاجت خود را به سوی او می‌برد،\nزیرا او سرور، نیکوکار و بی‌نیاز (الصمد) است.\n\nاوست مهیمن (چیره و نگهبان) که عطایایش شمارش نمی‌شود؛\nپیشی‌گیرنده (سباق) و میانه‌رو (مقتصد) به این امر آگاهند.\n\n### [پس همان‌گونه که فرمان یافته‌ای، استقامت ورز]\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: سوره‌ی هود و خواهرانش از هر سوره‌ای که در آن ذکر استقامت آمده است، مرا پیر کرد.\n\nزیرا او و مؤمنان به آن (استقامت) مأمور شده‌اند، و حکم از آنِ علم است نه امر. و خداوند هرگز به بندگان ستمکار نیست (وَمَا اللَّهُ بِظَلَّامٍ لِلْعَبِيدِ). زیرا خداوند متعال جز آنچه معلومات به او داده‌اند، علم نیافته است؛ پس علم تابع معلوم است و در هستی (الوجود) جز آنچه معلوم بر آن است، ظاهر نمی‌شود. پس حجت رسا از آنِ خداست (فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ). و هر کس امر را این‌گونه نشناسد، از آنچه امر بر آن است خبری ندارد. انسان نسبت به آنچه از او صادر می‌شود، پیش از وقوعش جاهل است؛ پس اگر آنچه واقع شد، واقع گشت، جز به علم خدا در آن واقع نشده است، و خداوند جز آنچه معلوم بر آن بوده است، علم نیافته است. پس این سخن او صحیح است که: و کفر را برای بندگانش نمی‌پسندد (وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ). و رضایت همان اراده (إرادة) است. بنابراین، تناقضی میان امر و اراده (إرادة) وجود ندارد. بلکه تناقض میان امر و آنچه علمِ تابعِ معلوم عطا کرده است، وجود دارد. پس اوست که هر چه بخواهد انجام می‌دهد (فَعَّالٌ لِمَا يُرِيدُ)، و جز آنچه علم بر آن است، اراده نمی‌کند. و ما از امر الهی جز صیغه‌ی امر را نداریم، و آن (صیغه) در لفظ دعوت‌کننده به سوی خداوند متعال، جزئی از مخلوقات است. پس آن (صیغه) مراد شده، معلوم و موجود در دهان دعوت‌کننده به سوی خداست. پس آگاه باش و عبرت بگیر و بگو: پروردگارا، علم مرا زیاد کن (قُلْ رَبِّ زِدْنِي عِلْمًا). پس هر کس علمش افزون شود، حکمش افزون می‌شود. پس در آنچه به آن امر شده‌ای یا از آن نهی گشته‌ای، بنگر؛ از آن جهت که تو محل وجود عین همان چیزی هستی که به آن امر شده‌ای. پس متعلق امر نزد صاحب این نظر آن است که محل خود را با انتظار مهیا سازد. پس هنگامی که امر الهی که بدون واسطه با تکوین (تكوين) می‌آید، فرا رسد، اثر آن را در قلب خود می‌نگرد. اگر یافت که امتناع (الإباية) در قلبش تکوین یافته است، می‌داند که او خوار شده است و این خواری از جانب خود اوست، زیرا او بر این صورت در حضرت ثبوت عین خود قرار دارد که علم را به خداوند درباره‌ی او عطا کرده است. و اگر غیر از آن، یعنی پذیرش (القبول) را یافت، همچنین است. پس در عضوی که آن امر مشروع به آن تعلق گرفته و قرار است در آن تکوین یابد، می‌نگرد؛ خواه گوش باشد یا چشم یا دست یا پا یا زبان یا شکم یا فرج. زیرا ما از قلب با وجود امتناع یا پذیرش فارغ شده‌ایم. پس پیوسته حکم علم را در خود از جانب حق (الحق) مراقبت (مراقبة) می‌کنیم تا بدانیم در چه حالی بوده‌ایم، زیرا او جز به واسطه‌ی ما در ما حکم نمی‌کند، چنانکه گفتیم:\n\nای شیرینِ ناز و جفا، ای ماهِ درخشش و نور.\nما تو را در جان‌های خود حاکم ساختیم،\nپس اگر خواهی به زیان ما یا به سود ما حکم کن.\n\nو چون در ما حکم می‌کنی، در حقیقت\nعین همان چیزی است که به واسطه‌ی ما در ما حکم می‌کنی.\n\nو هر کس حالش در مراقبت (مراقبة) این‌گونه باشد، اگرچه خلاف آنچه به آن امر شده از او سر زند، این امر به او زیانی نمی‌رساند و از مقام او نزد خداوند نمی‌کاهد؛ این از باب فضل الهی است، نه از باب حکم بر او (عز وجل). زیرا مراد حاصل شده است که سعادت را می‌بخشد، و آن مراقبت (مراقبة) خداوند در تکوین (تكوين) اوست. و این ذوقی است که قدر آن را جز کسی که حالش این‌گونه باشد، نمی‌تواند بداند. و این عین سرّ قدر (سرّ القدر) است برای کسی که آن را بفهمد. و چه بسیار مردم از کشف (الکشف) آن منع شده‌اند، به دلیل آنچه از این امر بر نفوس ضعیف‌الایمان عارض می‌شود. پس سرّ قدری که عین آن از عالم پنهان می‌ماند، چیزی جز تبعیت علم از معلوم نیست. پس هیچ چیز آشکارتر از آن نیست و با این دوری، هیچ چیز نزدیک‌تر نیست. پس هر کس حالش این‌گونه باشد، به درجه‌ی استقامت (الاستقامة) فائز شده است، و به آن امر شده است، زیرا او به مراقبت (المراقبة) امر شده است.\n\nپس حکم، آنچه را که هست، پیروی می‌کند،\nو دشوار از آن آسان می‌شود.\n\nو به همین دلیل، موی سپید رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) زیاد نبود، بلکه تارهای معدودی بود که به بیست عدد نمی‌رسید و پراکنده بود، و فرمود: مرا پیر کرد. اگر این خاطر (اندیشه) نبود، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) سپید نمی‌شد. پس هنگامی که امر برای او آشکار شد، همان‌گونه که ما مقرر کردیم، سپیدی مو متوقف شد و اندوهی بر او مستولی نشد. و دانست که آنچه واقع شد، از کجا واقع شده است، پس همان‌گونه که امر شد، استقامت ورزید. خداوند ما را به راه کسانی هدایت کند که بر آنان نعمت بخشیده است، از پیامبران (النَّبِيِّينَ)، صدیقان (الصِّدِّيقِينَ)، شهیدان (الشُّهَداءِ) و صالحان (الصَّالِحِينَ). و خداوند حق (الحق) را می‌گوید و او راه را می‌نمایاند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}