{
  "id": 154,
  "title": {
    "ar": "الباب الرابع والخمسون ومائة في معرفة مقام الولاية الملكية",
    "en": "Chapter 154: Concerning the Knowledge of the Station of Royal Sainthood (الولاية الملكية)",
    "ur": "باب ایک سو چوون (۱۵۴): ولایتِ ملوکیہ (الولایۃ الملکیۃ) کے مقام کی معرفت۔",
    "fa": "باب صد و پنجاه و چهارم در معرفت مقام ولایت ملکیه (الولاية الملكية)"
  },
  "content": {
    "ar": "## (الباب الرابع والخمسون ومائة في معرفة مقام الولاية الملكية)\n\n\n> إن الولاية توقيف على الخبر *** من المهيمن في الأملاك والبشر\n\n\n> وفي ملائكة التسخير أظهرها *** رب العباد من أهل النفع والضرر\n\n\n> أما ملائكة التهيام ليس لهم *** فيها نصيب على ما جاء في الخبر\n\n\n> مهيمون سكارى من محبته *** لا يعلمون بعين لا ولا أثر\n\n\n> الله أكرمهم الله قربهم *** الله خصهم بالمشهد الخطر\n> إني فديتهم من كل حادثة *** لا يعلمون بها بالسمع والبصر\n\n\n### [الملائكة المهيمة]\n\n\nاعلم أن الملائكة ثلاثة أصناف صنف مهيم لما أوجدهم تجلى لهم في اسمه الجميل فهيمهم وأفناهم عنهم فلا يعرفون نفوسهم ولا من هاموا فيه ولا ما هيمهم فهم في الحيرة سكارى وهم الذين أوجدهم الله من أينية العماء الذي ما فوقه هو أو ما تحته هو أو هم وجميع الملائكة أرواح خلقهم الله في هياكل أنوار كسائر الملائكة إلا أن هؤلاء الملائكة ليس لهم من الولاية إلا ولاية الممكنات التي ذكرناها في شرح إِنْ تَنْصُرُوا الله‏\n\n\n### [الملائكة المسخرة]\n\n\nوالصنف الثاني الملائكة المسخرة ورأسهم القلم الأعلى وهو العقل الأول سلطان عالم التدوين والتسطير وكان وجودهم مع العالم المهيم غير أنه حجبهم الله عن هذا التجلي الذي هيم أصحابهم لما أراد الله أن يهبه هذا الصنف المسخر من رتبة الإمامة في العالم وله ولاية تخصه وتخص ملائكة التسخير\n\n\n### [الملائكة المدبرة]\n\n\nوالصنف الثالث ملائكة التدبير وهي الأرواح المدبرة للأجسام كلها الطبيعية النورية والهبائية والفلكية والعنصرية وجميع أجسام العالم ولهؤلاء ولاية أيضا\n\n\n### [نصرة ملائكة التسخير بالدعاء للمؤمنين المذنبين‏]\n\n\nفأما ملائكة التسخير فولايتهم أعني نصرتهم للمؤمنين إذا أذنبوا وتوجهت عليهم أسماء الانتقام الإلهية وتوجهت في مقامات تلك الأسماء أسماء الغفران والعفو والتجاوز عن السيئات فتقول الملائكة ما قال الله تعالى ويَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا بقولهم رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً ما يزيدون على ذلك في حق المؤمن العاصي غير التائب اتكالا منهم على علم الله فيما قصدوه في ذلك الكلام أدبا مع الله سبحانه حيث إنه استحق جناب الله على أهل الله أن يغار من أجله ويدعي على من عصاه ولم يقم بأمره وما ينبغي لجلاله فإن الملائكة أهل أدب مع الله فقالوا رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً بقولك ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ وهؤلاء العصاة من الداخلين في عموم لفظة كل وعلما من قوله أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً\n\n\n### [استغفار عيسى والملائكة في حق المذنبين‏]\n\n\nفهذا مثل قول العبد الصالح الذي أخبرنا الله بقوله إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ وإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ فتأدب مع الله في هذا القول لما عصى قومه الله تعالى ولم يتوبوا فعلم الله منه أنه تأدب مع الله وأنه عرض بالمغفرة لما علم أن رحمته سبقت غضبه غير أن نفس الملائكة أقوى في الأدب لأنهم أعلم بالله من هذا العبد وما ينبغي لجلال الله فلم يقولوا وإن تغفر لهم وإنما قالوا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً فهذا يسمى تعريض تنبيه على أن الحق بهذه المثابة كما أخبر عن نفسه فقولهم رحمة فقدموا ذكر الرحمة لأنه تعالى قدمها لما ذكر عبده خضرا فقال آتَيْناهُ رَحْمَةً من عِنْدِنا قبل أن يذكر ما أعطاه ثم ذكر بعد ذلك الذي أعطاه من أجل رحمته به فقال وعَلَّمْناهُ من لَدُنَّا عِلْماً فلهذا قدمت الملائكة الرحمة وسكتت عن ذكر العصاة في دعائها فبين كلمة عيسى في حق قومه وبين دعاء الملائكة في حق العبيد العصاة من الأدب بون كثير لمن نظر واستبصر\n\n\n### [طريقة محمد صَلَّى اللهُ عَليهِ وسَلَّم في طلب المغفرة لقومه من ربه‏]\n\n\nولهذا قام النبي محمد صَلَّى اللهُ عَليهِ وسَلَّم بهذه الآية إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ ليلة كاملة ما زال يرددها حتى طلع الفجر إذ كانت كلمة غيره فكان يكررها حكاية وقصده معلوم في ذلك كما قيل في المثل‏\n\n\nإياك أعني فاسمعي يا جارة\n\n\nولم يقم ليلة كاملة بآية قول الملائكة لأن مناسبته لعيسى أقرب ومناسبة عيسى للملائكة أقرب لأن جبريل توجه على أمه مريم في إيجاد عيسى بشرا سويا فسلك محمد صَلَّى اللهُ عَليهِ وسَلَّم طريقا بين طريقين في طلب المغفرة لقومه‏\n\n\n### [نصرة ملائكة التسخير بالدعاء للمؤمنين التائبين‏]\n\n\nفهذا استنصارهم الله في حق المؤمنين العصاة وأما نصرتهم بالدعاء لمن تاب منهم فهو قولهم ربنا فَاغْفِرْ لِلَّذِينَ تابُوا واتَّبَعُوا سَبِيلَكَ وقِهِمْ عَذابَ الْجَحِيمِ فصرحوا بذكرهم لما كان هؤلاء قد قاموا في مقام القرب الإلهي بالتوبة وقرعوا بابها في رجعتهم إلى الله والملائكة حجبة الحق فطلبوا من الله المغفرة لهم لما اتصفوا بالتوبة وهذا من الأدب ثم إنهم لما عرفت الملائكة أن بين الجنة والنار منزلة متوسطة وهي الأعراف فمن كان في هذه المنزلة ما هو في النار ولا في الجنة وعلمت من لطف الله بعباده أنه يجيب دعوة الداعي إذا دعاه فقالت الملائكة بعد قولهم وقِهِمْ عَذابَ الْجَحِيمِ رَبَّنا وأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ أي لا تنزلهم في الأعراف بل أدخلهم الجنة ومن صَلَحَ الواو هنا بمعنى مع يقولون مع من صلح من آبائِهِمْ وأَزْواجِهِمْ وذُرِّيَّاتِهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ كما قال العبد الصالح وإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ ولم يقل واحد منهم إنك أنت الغفور الرحيم أدبا مع الجناب الإلهي من الطائفتين فاجتمعوا بذكر هذين الاسمين في حضرة الأدب مع الله‏\n\n\n### [نصرة ملائكة التسخير بالدعاء للملائكة الموكلين بقلوب الآدميين‏]\n\n\nثم زادت الملائكة في نصرتها للملائكة الموكلين بقلوب بنى آدم وهم أصحاب اللمات ينصرونهم الدعاء على أعدائهم من الشياطين أصحاب اللمات الموكلين المسلطين‏\nعلى قلوب العباد المنازعين لما تلقى الملائكة على قلوب بنى آدم في لماتها فقالوا وقِهِمُ السَّيِّئاتِ نصرة للملائكة على الشياطين ثم تلطفوا في السؤال بقولهم ومن تَقِ السَّيِّئاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ‏\n\n\n### [نصرة ملائكة التسخير بالاستغفار لجميع من في الأرض من الآدميين من غير تعيين‏]\n\n\nثم من نصرتهم لمن في الأرض من غير تعيين مؤمن من غيره قول الله تعالى عنهم والْمَلائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ويَسْتَغْفِرُونَ لِمَنْ في الْأَرْضِ مطلقا من غير تعيين أدبا مع الله والأرض جامعة فدخل المؤمن وغيره في هذا الاستغفار ثم إن الله بشر أهل الأرض بقبول استغفار الملائكة بقوله أَلا إِنَّ الله هُوَ الْغَفُورُ الرَّحِيمُ ولم يقل الفعال لما يريد ولهذا أيضا قلنا إن مال عباد الله إلى الرحمة وإن سكنوا النار فلهم فيها رحمة لا يعلمها غيرهم وربما تعطيهم تلك الرحمة أن لو شموا رائحة من روائح الجنة تضرروا بها كما تضر رياح الورد والطيب بأمزجة المحرورين فهذا كله من ولاية الملائكة فعم نصرهم بحمد الله فنعم الإخوان لنا\n\n\n### [نصرة ملائكة التسخير المؤمنين على أعدائهم في القتال‏]\n\n\nوأما نصرهم المؤمنين على الأعداء في القتال فإنهم ينزلون مددا بالدعاء وفي يوم بدر نزلوا مقاتلين خاصة وكانوا خمسة آلاف وفيه استرواح إذ ليس بنص بقوله وما جَعَلَهُ الله إِلَّا بُشْرى‏ لَكُمْ فكانوا من الملائكة أو هم الملائكة الذين قالوا في حق آدم أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ فأنزلهم في يوم بدر فسفكوا الدماء حيث عابوا آدم بسفك الدماء فلم يتخلفوا عن أمر الله وقوله ولِتَطْمَئِنَّ قُلُوبُكُمْ به أي من عادة البشرية أن تسكن إلى الكثرة إذ كان أهل بدر قليلين والمشركون كثيرين فلما رأوا الملائكة وهم خمسة آلاف والمسلمون ثلاثمائة والمشركون ألف رجل اطمأنت قلوب المؤمنين بكثرة العدد مع وجود القتال منهم فما اطمأنوا به برؤيتهم وحصل لهم من الأمان في قلوبهم حتى غشيهم النعاس إذ كان الخائف لا ينام‏\n\n\n### [حفظ الله دينه وعباده بخمسة آلاف من الملائكة مسومين‏]\n\n\nوما ذكر في الكثرة أكثر من خمسة آلاف لأن الخمسة من الأعداد تحفظ نفسها وغيرها وليس لغيرها من الأعداد هذه المرتبة فحفظ الله دينه وعباده المؤمنين بِخَمْسَةِ آلافٍ من الْمَلائِكَةِ مُسَوِّمِينَ أي أصحاب علامات يعرفون بها أنهم من الملائكة أو الملائكة الذين قالوا في حقنا نسفك الدماء فنصرونا على الأعداء بما عابوه علينا إذ أمرهم الله بذلك‏\n\n\n### [حصر مراتب نصر ملائكة التسخير]\n\n\nولولاية الملائكة وجوه ومواقف متعددة ولكن ذكرنا حصر المراتب التي نبه الله عليها فنصروا أسماء الله وهو أعلى المقامات ونصروا ملائكة اللمات ونصروا المؤمنين ونصروا التائبين ونصروا من في الأرض وما ثم من يطلب نصرهم أكثر من هذا فانحصرت مراتب النصر\n\n\n### [ملائكة التسخير بالحمد يستفتحون ثم بعد ذلك يستغفرون‏]\n\n\nثم إن الله أثنى عليهم بأنهم يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ استفتاحا إيثارا لجناب الله ثم بعد ذلك يَسْتَغْفِرُونَ وهو الذي يليق بهم تقديم جناب الله ولهذا\n\n\nما قام رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في مقام للناس يخطبهم الأقدم حمد الله والثناء عليه ثم بعد ذلك يتكلم بما شاء\n\n\nقال كل أمر ذي بال لا يبدأ فيه بحمد الله أو قال بذكر الله فهو أجذم‏\n\n\nأي مقطوع عن الله وإذا كان مقطوعا عن الله فإن شاء الله قبله وإن شاء لم يقبله وإذا بدي‏ء فيه بذكر الله فكان موصولا به غير مقطوع أي ليس بأجذم فذكر الله مقبول فالموصول به مقبول بلا شك ثم إنه من علم الملائكة أنهم ما يسبحون في هذه الأحوال إلا بحمد ربهم والرب المصلح ولا يرد الإصلاح إلا على فساد وما ذكر الله عنهم أنهم يسبحون بحمد غيره من الأسماء الإلهية إذ قال الله الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ فعلموا إن المتوجه على العالم إنما هو الاسم الرب إذ كان الغالب على عالم الأرض سلطان الهوى وهو الذي يورث الفساد الذي قالت الملائكة أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها فعلموا ما يقع لعلمهم بالحقائق وكذا وقع الأمر كما قالوه‏\n\n\n### [المولد من الأضداد المتنافرة لا بد فيه من المنازعة]\n\n\nوإنما وقع الغلط عندهم في استعجالهم بهذا القول من قبل أن يعلموا حكمة الله في هذا الفعل ما هي وحملهم على ذلك الغيرة التي فطروا عليها في جناب الله لأن المولد من الأضداد المتنافرة لا بد فيه من المنازعة ولا سيما المولد من الأركان فإنه مولد من مولد من مولد من مولد ركن عن فلك عن برج عن طبيعة عن نفس والأصل الأسماء الإلهية المتقابلة ومن هنالك سرى التقابل في العالم فنحن في آخر الدرجات فالخلاف فيما علا عن رتبة المولد من الأركان أقل وإن كان لا يخلو أ لا ترى إلى الملإ الأعلى كيف يختصمون وما كان لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم علم بِالْمَلَإِ الْأَعْلى‏ إِذْ يَخْتَصِمُونَ حتى أعلمه الله بذلك وسبب ذلك أن أصل نشأتهم أيضا تعطي ذلك ومن هذه الحقيقة التي خلقوا عليها قالوا أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ وهو نزاع خفي للربوبية من خلف حجاب الغيرة والتعظيم‏\n\n\n### [أصل النزاع والتنافر في العالم‏]\n\n\nوأصل النزاع والتنافر ما ذكرناه من الأسماء الإلهية المحيي والمميت والمعز والمذل والضار والنافع ولا ينبغي أن يكون الإله إلا من هذه أسماؤه مضاف إليها مشيئته‏\nوإرادته المقيدتان بلو وهو حرف امتناع فيه سر خفي لأهل العلم بالله فإذا علمت هذا أقمت عذر العالم عند الله ولهذا كانت الملائكة تبدأ في نصرتها ودعائها بتسبيح ربها والثناء عليه بمثل هذه الأسماء تعريضا أن أصل ما هم فيه من حقائق قوله ومن يُضْلِلِ الله ومن يَهْدِ الله أي الكل بيدك وحينئذ يستغفرون إقامة لعذرهم عند الله وإلى الله يُرْجَعُ الْأَمْرُ كُلُّهُ فكل علم في العالم مستنبط من العلم الإلهي فهو العلم العام ولا يعرفه إلا نبي أو ولي مقرب مجتبى من ملك وبشر وأما النظر العقلي فإنه لا يصل إلى هذا العلم أبدا من حيث فكره ونظره في الأدلة التي يستقل بها\n\n\n### [سرد أسماء ملائكة التسخير في القرآن‏]\n\n\nفهذا قد أريتك بعض ما هي عليه الولاية الملكية إلى ما فوق ذلك من تسخيرهم في إنزال الوحي ومصالح العالم من هبوب رياح ونش‏ء سحاب وإنزال مطر إذ كانوا الصَّافَّاتِ وفَالزَّاجِراتِ وفَالتَّالِياتِ والْمُرْسَلاتِ والنَّاشِراتِ وفَالْفارِقاتِ وفَالْمُلْقِياتِ والنَّازِعاتِ والنَّاشِطاتِ والسَّابِحاتِ وفَالسَّابِقاتِ وفَالْمُدَبِّراتِ وفَالْمُقَسِّماتِ وهؤلاء كلهم من ملائكة التسخير وولاية كل صنف من مرتبته التي هو فيها\n\n\n### [ملائكة التدبير ونصرتها للنفوس الناطقة]\n\n\nوأما ملائكة التدبير وهم الأرواح المدبرة أجسام العالم المركب وهذه المدبرة هي النفوس الناطقة فإن الولاية فيها نصرتها لله فيما جعل في أخذها به سعادتها وسعادة جسدها الذي أمرت بتدبيره فيأتي الطبع فيريد نيل غرضه فينظر العقل ما حكم الشرع الإلهي في ذلك الغرض فإن رآه محمودا عند الله أمضاه وإن رآه مذموما نبه النفس عليه وطلب منها النصرة على قمع هذا الغرض المذموم فساعدته فنصرت العقل بقبول الخير وذلك لتكون كلمة الله المشروعة هي العليا على كلمة الله في الذين كفروا التي هي السفلي‏\n\n\n### [الصدقة تقع بيد الرحمن قبل وقوعها بيد السائل‏]\n\n\nكما كانت الصدقة تقع في يد السائل وهي السفلي والسائل قوله وأَقْرِضُوا الله والصدقة تقع بيد الرحمن قبل وقوعها بيد السائل‏\n\n\nالمتلفظ بحروف السؤال واليد العليا هي المنفقة خير من اليد السفلي وهي السائلة والمال لله سبحانه هُوَ الْغَنِيُّ لَهُ ما في السَّماواتِ وما في الْأَرْضِ ونحن مستخلفون فيه بل نحن الخزائن والخزنة لهذا المال فتحقق ما أومأنا إليه في هذا الباب فإنه نافع جدا ومزيل جهلا عظيما ومورث أدبا إلهيا فيه سعادة أبدية لمن وقف عنده وفهمه وعمل به‏\n\n",
    "en": "## (Chapter One Hundred and Fifty-Four: In the Knowledge of the Station of Angelic Guardianship)\n\nIndeed, Guardianship is dependent upon the report\nFrom the Dominant One (المهيمن) concerning angels and humankind.\nAnd in the Angels of Subjugation (ملائكة التسخير), the Lord of the servants\nMade it manifest among those who possess benefit and harm.\nAs for the Angels of Bewilderment (ملائكة التهيام), they have no share\nIn it, according to what came in the tradition.\nThey are infatuated, drunk from His love,\nThey know neither the essence nor the trace.\nAllah honored them, Allah brought them near,\nAllah distinguished them with the tremendous witnessing.\nI ransom them from every event\nWhich they do not perceive through hearing or sight.\n\n### [The Angels of Bewilderment (الملائكة المهيمة)]\n\nKnow that the angels are of three types. One type is bewildered (مهيم). When Allah brought them into existence, He disclosed Himself to them through His Name, The Beautiful (الجميل), so He infatuated them and annihilated them from themselves. Thus, they know neither their own souls, nor the One in Whom they are infatuated, nor that which infatuated them. They are in a state of confusion (الحيرة), drunk. These are the ones whom Allah brought into existence from the 'Whereness' (أينية) of the Primal Mist (العماء), above which is He, or below which is He, or they are. All angels are spirits (أرواح) whom Allah created in luminous structures (هياكل أنوار), like the rest of the angels, except that these angels have no share in Guardianship (الولاية) except the guardianship of the possibles (ولاية الممكنات), which we mentioned in the commentary on <<إِنْ تَنْصُرُوا اللهَ>> (If you support Allah).\n\n### [The Angels of Subjugation (الملائكة المسخرة)]\n\nThe second type is the Angels of Subjugation (الملائكة المسخرة). Their head is the Supreme Pen (القلم الأعلى), which is the First Intellect (العقل الأول), the sovereign of the world of inscription and writing. Their existence was simultaneous with the Angels of Bewilderment, but Allah veiled them from that Theophany (التجلي) which infatuated their companions, because Allah willed to bestow upon this subjugated type the rank of Imamate (الإمامة) in the cosmos. This type possesses a Guardianship specific to itself and specific to the Angels of Subjugation.\n\n### [The Angels of Administration (الملائكة المدبرة)]\n\nThe third type is the Angels of Administration (ملائكة التدبير). These are the spirits that administer all bodies: the natural, the luminous, the ethereal, the celestial, and the elemental, and all bodies of the cosmos. These also possess a Guardianship.\n\n### [The Support of the Angels of Subjugation through Supplication for Sinful Believers]\n\nAs for the Angels of Subjugation, their Guardianship—meaning their support—is for the believers when they sin and the Divine Names of Vengeance (أسماء الانتقام الإلهية) are directed against them. In the stations of those Names, the Names of Forgiveness, Pardon, and Overlooking of Evil Deeds are directed. The angels then say what Allah the Exalted said: <<وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا>> (and they ask forgiveness for those who believe), by saying: <<رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً>> (Our Lord, You encompass all things in mercy and knowledge). They do not add anything beyond this concerning the disobedient but unrepentant believer, relying on Allah’s Knowledge regarding what they intended by that statement. This is out of propriety (أدب) toward Allah the Glorious, since the Divine Presence (جناب الله) deserves that the people of Allah be jealous on His behalf and supplicate against those who disobey Him and fail to uphold His command and what is befitting His Majesty. Since the angels are people of propriety with Allah, they said: \"Our Lord, You encompass all things in mercy,\" based on Your saying: <<ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (And My mercy encompasses all things), and these disobedient ones are included in the generality of the word 'all.' And [You encompass all things] \"in knowledge,\" based on His saying: <<أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً>> (He encompasses all things in knowledge).\n\n### [The Asking of Forgiveness by Jesus and the Angels concerning Sinners]\n\nThis is similar to the saying of the righteous servant [Jesus], about whom Allah informed us: <<إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ وإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ>> (If You punish them, they are Your servants, and if You forgive them, indeed You are the Almighty, the Wise). He observed propriety with Allah in this statement when his people disobeyed Allah the Exalted and did not repent. Allah knew from him that he was observing propriety with Allah and that he was alluding to forgiveness, knowing that His Mercy preceded His Wrath. However, the angels’ souls are stronger in propriety because they have greater knowledge of Allah and what is befitting His Majesty than this servant. Thus, they did not say, \"And if You forgive them,\" but rather said, \"You encompass all things in mercy and knowledge.\" This is called a subtle allusion (تعريض تنبيه) that the Real (الحق) is of this nature, as He informed about Himself. They mentioned \"mercy\" first because He the Exalted mentioned it first when speaking of His servant Khidr, saying: <<آتَيْناهُ رَحْمَةً من عِنْدِنا>> (We gave him mercy from Our presence), before mentioning what He granted him. Then He mentioned what He granted him because of His mercy toward him, saying: <<وعَلَّمْناهُ من لَدُنَّا عِلْماً>> (and We taught him knowledge from Our own presence). For this reason, the angels prioritized mercy and remained silent about mentioning the disobedient in their supplication. There is a great difference in propriety between the statement of Jesus concerning his people and the supplication of the angels concerning the disobedient servants, for whoever observes and reflects.\n\n### [The Method of Muhammad (PBUH) in Seeking Forgiveness for His People from His Lord]\n\nFor this reason, the Prophet Muhammad (PBUH) stood reciting this verse—<<إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ>>—for an entire night, repeating it until dawn, since it was the word of another. He repeated it as a narration, and his intention in doing so was known, as is said in the proverb:\n\nI mean you, so listen, O neighbor.\n\nHe did not stand for an entire night reciting the verse containing the angels' saying, because his affinity to Jesus was closer, and Jesus's affinity to the angels was closer, since Gabriel appeared to his mother Mary in the creation of Jesus as a perfect human. Thus, Muhammad (PBUH) followed a path between two paths in seeking forgiveness for his people.\n\n### [The Support of the Angels of Subjugation through Supplication for Repentant Believers]\n\nThis is their seeking Allah’s support concerning the disobedient believers. As for their support through supplication for those among them who repent, it is their saying: \"Our Lord, <<فَاغْفِرْ لِلَّذِينَ تابُوا واتَّبَعُوا سَبِيلَكَ وقِهِمْ عَذابَ الْجَحِيمِ>> (Forgive those who repent and follow Your way, and protect them from the torment of the Hellfire).\" They explicitly mentioned them because these individuals had established themselves in the station of Divine Proximity (مقام القرب الإلهي) through repentance and had knocked on its door in their return to Allah. Since the angels are the gatekeepers of the Real (الحق), they sought forgiveness for them from Allah when they were characterized by repentance. This is out of propriety. Then, because the angels knew that there is an intermediate station between Paradise and the Fire, which is Al-A'rāf (The Heights/Isthmus), where those in it are neither in the Fire nor in Paradise, and they knew of Allah’s kindness to His servants—that He answers the call of the caller when he calls upon Him—the angels said, after their statement, \"and protect them from the torment of the Hellfire\": \"Our Lord, <<وأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ>> (and admit them to the Gardens of Eden which You have promised them),\" meaning, do not place them in Al-A'rāf, but admit them to Paradise. And <<ومَنْ صَلَحَ>> (and whoever is righteous)—the *wāw* here means 'along with'—they say, \"along with whoever is righteous <<من آبائِهِمْ وأَزْواجِهِمْ وذُرِّيَّاتِهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ>> (among their fathers, their spouses, and their offspring. Indeed, You are the Almighty, the Wise),\" just as the righteous servant said: <<وإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ>>. Neither group said, \"Indeed, You are the Forgiving, the Merciful,\" out of propriety toward the Divine Presence (الجناب الإلهي). Thus, both groups converged by mentioning these two Names in the presence of propriety with Allah.\n\n### [The Support of the Angels of Subjugation through Supplication for the Angels Assigned to the Hearts of Human Beings]\n\nThen the angels increased their support for the angels assigned to the hearts of the children of Adam—who are the companions of the impulses (*lammāt*)—by supplicating against their enemies, the devils (Shayāṭīn), who are the companions of the impulses assigned and empowered over the hearts of the servants, contending with what the angels cast upon the hearts of the children of Adam in their impulses. So they said: <<وقِهِمُ السَّيِّئاتِ>> (And protect them from evil deeds), supporting the angels against the devils. Then they refined their request by saying: <<ومَنْ تَقِ السَّيِّئاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ>> (And whoever You protect from evil deeds that Day, You have certainly had mercy upon him).\n\n### [The Support of the Angels of Subjugation by Asking Forgiveness for Everyone on Earth without Specification]\n\nFurthermore, part of their support for those on Earth, without specifying believer from non-believer, is Allah the Exalted’s saying about them: <<والْمَلائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ويَسْتَغْفِرُونَ لِمَنْ في الْأَرْضِ>> (And the angels exalt [Allah] with praise of their Lord and ask forgiveness for those on the earth), generally and without specification, out of propriety toward Allah. Since the Earth is comprehensive, the believer and the non-believer are included in this request for forgiveness. Then Allah gave glad tidings to the people of the Earth regarding the acceptance of the angels' request for forgiveness by His saying: <<أَلا إِنَّ الله هُوَ الْغَفُورُ الرَّحِيمُ>> (Unquestionably, Allah is the Forgiving, the Merciful). He did not say, \"The Doer of what He wills.\" For this reason, we also say that Allah’s servants incline toward Mercy, and even if they dwell in the Fire, they have a mercy therein that none but they know. Perhaps that mercy grants them that if they were to smell a fragrance from the fragrances of Paradise, they would be harmed by it, just as the scents of roses and perfume harm the temperaments of those who are feverish. All of this is part of the Guardianship of the angels. Their support is comprehensive, praise be to Allah, and they are excellent brethren to us.\n\n### [The Support of the Angels of Subjugation for Believers against Their Enemies in Fighting]\n\nAs for their support for the believers against enemies in fighting, they descend as aid (مدد) through supplication. But specifically on the Day of Badr, they descended as fighters (مقاتلين). They numbered five thousand. There is a subtle comfort (استرواح) in this, as it is not a definitive text, by His saying: <<وما جَعَلَهُ الله إِلَّا بُشْرى‏ لَكُمْ>> (And Allah made it not but good tidings for you). They were either angels, or they were the angels who had said concerning Adam: <<أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ>> (Will You place upon it one who causes corruption therein and sheds blood?). So, He sent them down on the Day of Badr, and they shed blood, thereby fulfilling the command of Allah, even though they had criticized Adam for shedding blood. They did not fail to obey Allah’s command. And His saying: <<وَلِتَطْمَئِنَّ قُلُوبُكُمْ بِهِ>> (and that your hearts may be assured thereby)—it is a characteristic of human nature to be comforted by multiplicity. Since the people of Badr were few and the polytheists were many, when they saw the angels—five thousand—while the Muslims were three hundred and the polytheists were one thousand men, the hearts of the believers were assured by the large number, even with the fighting taking place among them. They were assured by seeing them, and they achieved such security in their hearts that drowsiness overcame them, for the fearful person does not sleep.\n\n### [Allah’s Preservation of His Religion and Servants with Five Thousand Marked Angels]\n\nNo number greater than five thousand was mentioned regarding multiplicity, because the number five, among the numbers, preserves itself and others, and no other number possesses this rank. Thus, Allah preserved His religion and His believing servants <<بِخَمْسَةِ آلافٍ من الْمَلائِكَةِ مُسَوِّمِينَ>> (with five thousand marked angels), meaning angels with distinguishing signs by which they are known to be angels, or the angels who had spoken concerning us that we shed blood. They supported us against the enemies by doing the very thing they had criticized us for, since Allah commanded them to do so.\n\n### [Limiting the Levels of Support by the Angels of Subjugation]\n\nThe Guardianship of the angels has multiple facets and stations, but we have mentioned the limitation of the levels (المراتب) that Allah drew attention to: they supported the Names of Allah—which is the highest of stations—and they supported the angels of the impulses (*lammāt*), and they supported the believers, and they supported the repentant, and they supported those on Earth. There is no one who seeks their support beyond this, so the levels of support are limited.\n\n### [The Angels of Subjugation Begin with Praise, and Only After That Do They Ask Forgiveness]\n\nFurthermore, Allah praised them by saying that they <<يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ>> (exalt [Allah] with praise of their Lord), beginning with this as a preference for the Divine Presence (جناب الله). Only after that do they <<يَسْتَغْفِرُونَ>> (ask forgiveness), which is befitting for them, prioritizing the Divine Presence. For this reason,\n\nThe Messenger of Allah (PBUH) never stood in a station to address people without first praising Allah and extolling Him, and only after that did he speak whatever he wished.\n\nHe said: \"Every matter of importance that is not begun with the praise of Allah,\" or he said, \"with the mention of Allah, is cut off (أجذم).\"\n\nMeaning, cut off from Allah. If it is cut off from Allah, then if Allah wills, He accepts it, and if He wills, He does not accept it. But if it is begun with the mention of Allah, it is connected to Him, not cut off—meaning, it is not cut off (أجذم)—so the mention of Allah is accepted, and that which is connected to Him is undoubtedly accepted. Furthermore, it is known by the angels that they do not exalt in these states except with the praise of their Lord (Rabb), and the Lord is the Reformer (المصلح), and reform only occurs in response to corruption. Allah did not mention that they exalt with the praise of any other Divine Name, for Allah said: <<الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (Praise belongs to Allah, Lord of the Worlds). Thus, they knew that the Name directed toward the cosmos is indeed the Name Lord (الرب), since the dominant force over the world of the Earth is the sovereignty of caprice (سلطان الهوى), which causes the corruption about which the angels said: <<أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها>> (Will You place upon it one who causes corruption therein?). They knew what would occur due to their knowledge of the Realities (الحقائق), and thus the matter occurred just as they had said.\n\n### [The Offspring of Conflicting Opposites Necessarily Involves Contention]\n\nThe error they committed was only in their haste (استعجالهم) in making this statement before knowing the wisdom of Allah in this action. What motivated them was the jealousy (*ghīra*) upon which they were naturally disposed concerning the Divine Presence. This is because the offspring generated from conflicting opposites (الأضداد المتنافرة) necessarily involves contention (المنازعة), especially the offspring generated from the pillars (الأركان), for it is an offspring of an offspring of an offspring of an offspring: a pillar from a sphere, from a constellation, from a nature, from a soul. And the origin is the opposing Divine Names (الأسماء الإلهية المتقابلة). From there, opposition spread throughout the cosmos. We are in the last degrees, so the disagreement in what is above the rank generated from the pillars is less, although it is not entirely absent. Do you not see how the Highest Assembly (الملإ الأعلى) contend? The Messenger of Allah (PBUH) had no knowledge <<بِالْمَلَإِ الْأَعْلى‏ إِذْ يَخْتَصِمُونَ>> (of the Highest Assembly when they contended) until Allah informed him of it. The reason for this is that the very origin of their creation also dictates this. It is from this reality upon which they were created that they said: <<أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ>> (Will You place upon it one who causes corruption therein and sheds blood?), which is a subtle contention (نزاع خفي) regarding Lordship (الربوبية) from behind the veil of jealousy and veneration.\n\n### [The Origin of Contention and Conflict in the World]\n\nThe origin of contention and conflict is what we mentioned: the opposing Divine Names—The Giver of Life (المحيي) and The Giver of Death (المميت), The Exalter (المعز) and The Humiliator (المذل), The Harmer (الضار) and The Benefiter (النافع). It is not fitting for the Deity to be other than one whose Names are these, added to which are His Will (مشيئته) and His Intention (إرادته), which are constrained by *law* (لو - if only), a particle of impossibility that holds a hidden secret for the people of knowledge of Allah. If you know this, you will establish the excuse of the cosmos before Allah. For this reason, the angels begin their support and supplication by exalting their Lord and praising Him with such Names, subtly alluding that the origin of their state lies in the realities of His saying: <<ومَنْ يُضْلِلِ اللهُ>> (And whom Allah leads astray) and <<ومَنْ يَهْدِ اللهُ>> (and whom Allah guides)—meaning, everything is in Your Hand. At that point, they ask for forgiveness, establishing their excuse before Allah. And <<وإِلَى اللهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Allah all matters are returned). Every knowledge in the cosmos is derived from the Divine Knowledge (العلم الإلهي); it is the general knowledge, and none knows it except a Prophet or a near, chosen Saint (ولي مقرب مجتبى), whether angel or human. As for rational speculation (النظر العقلي), it can never reach this knowledge through its thought and examination of the independent proofs.\n\n### [Listing the Names of the Angels of Subjugation in the Quran]\n\nI have shown you some aspects of Angelic Guardianship (الولاية الملكية), extending to their subjugation in the sending down of Revelation and the interests of the cosmos, such as the blowing of winds, the formation of clouds, and the sending down of rain. They are <<الصَّافَّاتِ>> (Those who line up), <<فَالزَّاجِراتِ>> (Those who drive), <<فَالتَّالِياتِ>> (Those who recite), <<والْمُرْسَلاتِ>> (Those sent forth), <<والنَّاشِراتِ>> (Those who spread), <<فَالْفارِقاتِ>> (Those who distinguish), <<فَالْمُلْقِياتِ>> (Those who cast), <<والنَّازِعاتِ>> (Those who pull out), <<والنَّاشِطاتِ>> (Those who draw out), <<والسَّابِحاتِ>> (Those who float), <<فَالسَّابِقاتِ>> (Those who precede), <<فَالْمُدَبِّراتِ>> (Those who administer), and <<فَالْمُقَسِّماتِ>> (Those who distribute). All of these are from the Angels of Subjugation, and the Guardianship of each type stems from the level in which it resides.\n\n### [The Angels of Administration and Their Support for the Rational Souls]\n\nAs for the Angels of Administration (ملائكة التدبير), they are the spirits that administer the composite bodies of the cosmos. These administrators are the rational souls (النفوس الناطقة). Guardianship in this context is their support for Allah in what He has placed as the means to their happiness and the happiness of the body they are commanded to administer. The natural inclination (الطبع) comes seeking to attain its goal. The Intellect (العقل) then examines the ruling of the Divine Law (الشرع الإلهي) concerning that goal. If it finds it praiseworthy in the sight of Allah, it executes it. If it finds it blameworthy, it alerts the soul to it and seeks its support (النصرة) in suppressing this blameworthy goal. The soul assists it, thus supporting the Intellect by accepting the good, so that the Divinely legislated Word of Allah (كلمة الله المشروعة) may be the highest (العليا) over the Word of Allah concerning those who disbelieve, which is the lowest (السفلى).\n\n### [Charity Falls into the Hand of the All-Merciful Before It Falls into the Hand of the Beggar]\n\nJust as charity falls into the hand of the beggar, which is the lower hand, and the beggar’s statement is <<وأَقْرِضُوا اللهَ>> (And lend to Allah a goodly loan), charity falls into the Hand of the All-Merciful (الرحمن) before it falls into the hand of the beggar who utters the words of the request. The upper hand, which gives, is better than the lower hand, which begs. The wealth belongs to Allah the Glorious: <<هُوَ الْغَنِيُّ لَهُ ما في السَّماواتِ وما في الْأَرْضِ>> (He is the Self-Sufficient; to Him belongs whatever is in the heavens and whatever is on the earth). We are merely vicegerents therein; rather, we are the treasuries and the keepers of this wealth. Realize what we have alluded to in this chapter, for it is extremely beneficial, removes great ignorance, and bequeaths a Divine propriety (أدب إلهي) that contains eternal happiness for whoever pauses at it, understands it, and acts upon it.",
    "ur": "(باب ایک سو چون معرفتِ مقامِ ولایتِ ملکیہ کے بیان میں)\n\nولایت (الولایۃ) توقف کرتی ہے خبر پر، جو مہیمن (المهيمن) کی طرف سے فرشتوں اور انسانوں میں ہے۔\nاور ملائکہِ تسخیر (ملائکۃ التسخیر) میں اسے رب العباد نے ان لوگوں میں ظاہر کیا جو نفع اور ضرر کے اہل ہیں۔\nلیکن ملائکہِ تہیم (ملائکۃ التهيام) کا اس میں کوئی حصہ نہیں، جیسا کہ خبر میں آیا ہے۔\nوہ اس کی محبت میں مست اور سرشار (مہیمون سكارى) ہیں، نہ کسی عین کو جانتے ہیں اور نہ کسی اثر کو۔\nاللہ نے انہیں عزت دی، اللہ نے انہیں قربت بخشی، اللہ نے انہیں اس عظیم مشاہدے کے ساتھ خاص کیا۔\nمیں انہیں ہر اس حادثے سے فدا کرتا ہوں جسے وہ نہ سماعت سے جانتے ہیں اور نہ بصارت سے۔\n\n### [ملائکہِ مہیمہ (الملائکۃ المهيمة)]\n\nجان لو کہ ملائکہ (الملائکۃ) کی تین اقسام ہیں۔ ایک قسم وہ ہے جو مہیمہ (المهيمة) ہے، جب اللہ نے انہیں وجود بخشا تو ان پر اپنے اسمِ جمیل میں التجلی (التجلی) فرمایا، جس نے انہیں حیران کر دیا اور انہیں ان کے نفوس سے فنا (الفناء) کر دیا، چنانچہ وہ نہ اپنے نفوس کو جانتے ہیں اور نہ اسے جس میں وہ حیران ہوئے، اور نہ اسے جس نے انہیں حیران کیا۔ پس وہ حیرت میں سرشار ہیں۔ یہ وہ ہیں جنہیں اللہ نے \"اَینیتِ عماء\" (أينية العماء) سے وجود بخشا، جس کے اوپر \"ھو\" ہے یا جس کے نیچے \"ھو\" ہے، یا وہ ہیں۔ اور تمام ملائکہ (الملائکۃ) ارواح ہیں جنہیں اللہ نے نوری ہیاکل میں خلق کیا، جیسے دیگر ملائکہ۔ مگر ان ملائکہ کے لیے ولایت (الولایۃ) میں سے صرف ممکنات کی ولایت ہے، جس کا ذکر ہم نے **إِنْ تَنْصُرُوا الله** (اگر تم اللہ کی مدد کرو گے) کی شرح میں کیا ہے۔\n\n### [ملائکہِ مسخرہ (الملائکۃ المسخرۃ)]\n\nاور دوسری قسم ملائکہِ مسخرہ (الملائکۃ المسخرۃ) کی ہے، اور ان کے سردار قلم اعلیٰ (القلم الأعلى) ہیں، جو عقل اول (العقل الأول) ہیں، جو عالمِ تدوین و تسطیر کے سلطان ہیں۔ ان کا وجود عالمِ مہیمہ کے ساتھ ہی ہوا، مگر اللہ نے انہیں اس التجلی (التجلی) سے حجاب میں رکھا جس نے ان کے ساتھیوں کو حیران کر دیا تھا، کیونکہ اللہ نے اس مسخرہ قسم کو عالم میں امامت کا رتبہ عطا کرنا چاہا۔ اور ان کے لیے ایک خاص ولایت (الولایۃ) ہے جو ان کے اور ملائکہِ تسخیر (ملائکۃ التسخیر) کے لیے مخصوص ہے۔\n\n### [ملائکہِ مدبرہ (الملائکۃ المدبرۃ)]\n\nاور تیسری قسم ملائکہِ تدبیر (ملائکۃ التدبیر) کی ہے، اور وہ تمام اجسام کی مدبر ارواح ہیں، خواہ وہ طبعی ہوں، نوری ہوں، ہیولائی ہوں، فلکی ہوں یا عنصری ہوں، اور عالم کے تمام اجسام۔ اور ان کے لیے بھی ایک ولایت (الولایۃ) ہے۔\n\n### [گناہگار مومنین کے لیے دعا کے ذریعے ملائکہِ تسخیر کی مدد]\n\nجہاں تک ملائکہِ تسخیر (ملائکۃ التسخیر) کا تعلق ہے، تو ان کی ولایت (الولایۃ) – یعنی ان کی مدد – مومنین کے لیے ہے جب وہ گناہ کرتے ہیں اور ان پر الٰہی انتقام کے اسماء متوجہ ہوتے ہیں۔ اور ان اسماء کے مقامات میں غفران، عفو، اور تجاوز عن السیئات کے اسماء متوجہ ہوتے ہیں۔ پس ملائکہ وہی کہتے ہیں جو اللہ تعالیٰ نے فرمایا: **وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا** (اور وہ ایمان والوں کے لیے استغفار کرتے ہیں) ان کے اس قول کے ذریعے: **رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً** (اے ہمارے رب! تو نے ہر چیز کو اپنی رحمت اور علم سے گھیر رکھا ہے)۔ وہ اس سے زیادہ کچھ نہیں کہتے، اس گناہگار مومن کے حق میں جو توبہ نہ کرنے والا ہو، اس کلام میں ان کے مقصود کے بارے میں اللہ کے علم پر بھروسہ کرتے ہوئے، یہ اللہ سبحانہ کے ساتھ ادب (الأدب) ہے۔ کیونکہ اللہ کے جناب کا حق ہے کہ اہل اللہ اس کی خاطر غیرت کھائیں اور اس پر دعویٰ کریں جس نے اس کی نافرمانی کی اور اس کے حکم پر قائم نہ رہا اور جو اس کے جلال کے لائق ہے۔ پس ملائکہ اللہ کے ساتھ ادب (الأدب) والے ہیں۔ انہوں نے کہا: **رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً** (اے ہمارے رب! تو نے ہر چیز کو رحمت سے گھیر رکھا ہے) تمہارے اس قول کی وجہ سے: **وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ** (اور میری رحمت ہر چیز پر محیط ہے)۔ اور یہ گناہگار لوگ لفظ \"کل\" (ہر) کی عمومیت میں داخل ہیں۔ اور **عِلْماً** (علم سے) تمہارے اس قول کی وجہ سے: **أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً** (اس نے ہر چیز کو علم سے گھیر رکھا ہے)۔\n\n### [گناہگاروں کے حق میں عیسیٰ (علیہ السلام) اور ملائکہ کا استغفار]\n\nیہ اس نیک بندے (عیسیٰ علیہ السلام) کے قول کی مانند ہے جس کے بارے میں اللہ نے ہمیں خبر دی: **إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ وإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ** (اگر تو انہیں عذاب دے تو وہ تیرے بندے ہیں، اور اگر تو انہیں بخش دے تو بے شک تو ہی غالب حکمت والا ہے)۔ پس انہوں نے اس قول میں اللہ کے ساتھ ادب (الأدب) اختیار کیا، جب ان کی قوم نے اللہ کی نافرمانی کی اور توبہ نہیں کی۔ اللہ نے ان سے جان لیا کہ انہوں نے اللہ کے ساتھ ادب (الأدب) اختیار کیا اور مغفرت کی طرف اشارہ کیا، کیونکہ وہ جانتے تھے کہ اس کی رحمت اس کے غضب پر سبقت لے گئی ہے۔ تاہم، ملائکہ کا نفس ادب (الأدب) میں زیادہ قوی ہے، کیونکہ وہ اس بندے سے زیادہ اللہ کو جانتے ہیں اور جو اس کے جلال کے لائق ہے۔ لہٰذا انہوں نے یہ نہیں کہا کہ \"اور اگر تو انہیں بخش دے\"، بلکہ انہوں نے کہا: **وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً** (تو نے ہر چیز کو رحمت اور علم سے گھیر رکھا ہے)۔ اسے تعریض (اشارہ) کہا جاتا ہے، جو اس بات پر تنبیہ ہے کہ حق اسی مقام پر ہے جیسا کہ اس نے اپنے بارے میں خبر دی ہے۔ ان کا قول **رَحْمَةً** (رحمت) ہے، انہوں نے رحمت کا ذکر پہلے کیا کیونکہ اللہ تعالیٰ نے اسے پہلے ذکر کیا جب اس نے اپنے بندے خضر کا ذکر کیا، تو فرمایا: **آتَيْناهُ رَحْمَةً مِنْ عِنْدِنا** (ہم نے اسے اپنی طرف سے رحمت عطا کی) اس سے پہلے کہ وہ اس چیز کا ذکر کرے جو اسے دی، پھر اس کے بعد اس چیز کا ذکر کیا جو اس نے اپنی رحمت کی وجہ سے اسے دی، پس فرمایا: **وَعَلَّمْناهُ مِنْ لَدُنَّا عِلْماً** (اور ہم نے اسے اپنے پاس سے علم سکھایا)۔ اسی لیے ملائکہ نے رحمت کو مقدم کیا اور اپنی دعا میں گناہگاروں کے ذکر سے خاموشی اختیار کی۔ پس عیسیٰ (علیہ السلام) کے اپنی قوم کے حق میں کلام اور ملائکہ کی گناہگار بندوں کے حق میں دعا کے درمیان ادب (الأدب) میں بہت بڑا فرق ہے، اس شخص کے لیے جو غور کرے اور بصیرت حاصل کرے۔\n\n### [محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کا اپنے رب سے اپنی قوم کے لیے مغفرت طلب کرنے کا طریقہ]\n\nاور اسی لیے نبی محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نے پوری رات اسی آیت **إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ** (اگر تو انہیں عذاب دے تو وہ تیرے بندے ہیں) کے ساتھ قیام کیا، وہ اسے طلوعِ فجر تک دہراتے رہے۔ چونکہ یہ کسی اور کا کلام تھا، اس لیے وہ اسے حکایتاً دہراتے تھے، اور اس میں ان کا مقصد معلوم تھا، جیسا کہ کہاوت میں کہا جاتا ہے:\n\nمیں تم سے مخاطب ہوں، اے پڑوسن! تم سنو\n(إياك أعني فاسمعي يا جارة)\n\nانہوں نے پوری رات ملائکہ کے قول والی آیت کے ساتھ قیام نہیں کیا، کیونکہ ان کی مناسبت عیسیٰ (علیہ السلام) سے زیادہ قریب تھی، اور عیسیٰ (علیہ السلام) کی مناسبت ملائکہ سے زیادہ قریب تھی، کیونکہ جبرائیل (علیہ السلام) عیسیٰ کو بشرِ سویّ (کامل انسان) کی صورت میں وجود بخشنے کے لیے ان کی والدہ مریم پر متوجہ ہوئے تھے۔ پس محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نے اپنی قوم کے لیے مغفرت طلب کرنے میں دو طریقوں کے درمیان کا راستہ اختیار کیا۔\n\n### [توبہ کرنے والے مومنین کے لیے دعا کے ذریعے ملائکہِ تسخیر کی مدد]\n\nیہ ان کا اللہ سے گناہگار مومنین کے حق میں مدد طلب کرنا تھا۔ اور ان کی طرف سے توبہ کرنے والوں کے لیے دعا کے ذریعے مدد یہ ہے، ان کا قول: **رَبَّنا فَاغْفِرْ لِلَّذِينَ تابُوا واتَّبَعُوا سَبِيلَكَ وقِهِمْ عَذابَ الْجَحِيمِ** (اے ہمارے رب! ان لوگوں کو بخش دے جنہوں نے توبہ کی اور تیرے راستے کی پیروی کی، اور انہیں جہنم کے عذاب سے بچا)۔ انہوں نے ان کا ذکر صراحتاً کیا، کیونکہ یہ لوگ توبہ کے ذریعے قربِ الٰہی (مقام القرب الإلهي) کے مقام پر قائم ہو چکے تھے اور اللہ کی طرف رجوع میں اس کا دروازہ کھٹکھٹا چکے تھے۔ اور ملائکہ (الملائکۃ) حق کے دربان ہیں۔ پس انہوں نے اللہ سے ان کے لیے مغفرت طلب کی جب وہ توبہ کی صفت سے متصف ہو گئے۔ اور یہ ادب (الأدب) میں سے ہے۔ پھر جب ملائکہ (الملائکۃ) نے جان لیا کہ جنت اور دوزخ کے درمیان ایک درمیانی منزل ہے، جو اعراف ہے، تو جو اس منزل میں ہے وہ نہ دوزخ میں ہے اور نہ جنت میں۔ اور انہوں نے اپنے بندوں پر اللہ کے لطف کو جان لیا کہ وہ دعا کرنے والے کی دعا قبول کرتا ہے جب وہ اسے پکارتا ہے۔ پس ملائکہ نے اپنے قول **وَقِهِمْ عَذابَ الْجَحِيمِ** (اور انہیں جہنم کے عذاب سے بچا) کے بعد کہا: **رَبَّنا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ** (اے ہمارے رب! اور انہیں ہمیشہ رہنے والی جنتوں میں داخل کر جن کا تو نے ان سے وعدہ کیا ہے) یعنی انہیں اعراف میں نہ اتار، بلکہ انہیں جنت میں داخل کرے۔ اور **وَمَنْ صَلَحَ** (اور جو نیک ہو) میں واؤ بمعنی \"مع\" (ساتھ) ہے۔ وہ کہتے ہیں: ان کے آباء، ان کی بیویوں اور ان کی اولاد میں سے جو نیک ہوں، ان کے ساتھ۔ **إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ** (بے شک تو ہی غالب حکمت والا ہے)۔ جیسا کہ نیک بندے نے کہا: **وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ** (اور اگر تو انہیں بخش دے تو بے شک تو ہی غالب حکمت والا ہے)۔ ان دونوں گروہوں میں سے کسی نے بھی **إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ** (بے شک تو ہی بخشنے والا مہربان ہے) نہیں کہا، یہ جنابِ الٰہی کے ساتھ ادب (الأدب) کی وجہ سے تھا۔ پس وہ اللہ کے ساتھ ادب (الأدب) کی حضوری میں ان دو اسماء کے ذکر پر متفق ہوئے۔\n\n### [آدمیوں کے دلوں پر مقرر ملائکہ کے لیے دعا کے ذریعے ملائکہِ تسخیر کی مدد]\n\nپھر ملائکہ (الملائکۃ) نے بنی آدم کے دلوں پر مقرر ملائکہ کی مدد میں اضافہ کیا، اور وہ لمّات (اللمّات) کے ساتھی ہیں، وہ شیاطین کے لمّات کے ساتھیوں پر دعا کے ذریعے ان کی مدد کرتے ہیں، جو بندوں کے دلوں پر مسلط ہیں اور اس چیز سے جھگڑتے ہیں جو ملائکہ بنی آدم کے دلوں پر ان کی لمّات میں ڈالتے ہیں۔ پس انہوں نے کہا: **وَقِهِمُ السَّيِّئاتِ** (اور انہیں برائیوں سے بچا)۔ یہ شیاطین کے مقابلے میں ملائکہ کی مدد ہے۔ پھر انہوں نے اپنے سوال میں مزید لطف اختیار کیا، ان کے اس قول کے ذریعے: **وَمَنْ تَقِ السَّيِّئاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ** (اور جسے تو اس دن برائیوں سے بچا لے گا، تو یقیناً تو نے اس پر رحم کیا)۔\n\n### [زمین پر موجود تمام آدمیوں کے لیے بغیر تخصیص کے استغفار کے ذریعے ملائکہِ تسخیر کی مدد]\n\nپھر زمین پر موجود ہر شخص کے لیے، مومن اور غیر مومن کی تخصیص کے بغیر، ان کی مدد اللہ تعالیٰ کے اس قول میں ہے: **وَالْمَلائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَنْ فِي الْأَرْضِ** (اور ملائکہ اپنے رب کی حمد کے ساتھ تسبیح کرتے ہیں اور زمین والوں کے لیے استغفار کرتے ہیں)۔ یہ اللہ کے ساتھ ادب (الأدب) کی وجہ سے مطلقاً ہے، بغیر کسی تخصیص کے۔ اور زمین جامع ہے، لہٰذا مومن اور غیر مومن دونوں اس استغفار میں داخل ہو گئے۔ پھر اللہ نے زمین والوں کو ملائکہ کے استغفار کی قبولیت کی خوشخبری دی، اپنے اس قول سے: **أَلا إِنَّ الله هُوَ الْغَفُورُ الرَّحِيمُ** (خبردار! بے شک اللہ ہی بخشنے والا مہربان ہے)۔ اور یہ نہیں کہا کہ \"الفَعَّالُ لِمَا یُرِیدُ\" (جو چاہے کرنے والا)۔ اور اسی لیے ہم نے کہا کہ اللہ کے بندوں کا میلان رحمت کی طرف ہے، اور اگر وہ آگ میں بھی رہیں تو ان کے لیے اس میں ایسی رحمت ہے جسے ان کے سوا کوئی نہیں جانتا۔ اور بسا اوقات وہ رحمت انہیں یہ عطا کرتی ہے کہ اگر وہ جنت کی خوشبوؤں میں سے کوئی خوشبو سونگھیں تو انہیں اس سے نقصان پہنچے، جیسا کہ گرم مزاج لوگوں کو گلاب اور خوشبو کی ہواؤں سے نقصان پہنچتا ہے۔ یہ سب ملائکہ کی ولایت (الولایۃ) میں سے ہے۔ پس ان کی مدد اللہ کی حمد کے ساتھ عام ہو گئی، تو وہ ہمارے لیے کتنے اچھے بھائی ہیں۔\n\n### [قتال میں دشمنوں کے مقابلے میں مومنین کے لیے ملائکہِ تسخیر کی مدد]\n\nاور جہاں تک جنگ میں دشمنوں کے مقابلے میں مومنین کی مدد کا تعلق ہے، تو وہ دعا کے ذریعے کمک بن کر نازل ہوتے ہیں۔ اور غزوہ بدر کے دن وہ خاص طور پر لڑنے والے بن کر نازل ہوئے، اور وہ پانچ ہزار تھے۔ اور اس میں ایک استرواح (اطمینان) ہے، کیونکہ یہ نص (قرآنی حکم) نہیں ہے، اللہ کے اس قول کی وجہ سے: **وَمَا جَعَلَهُ الله إِلَّا بُشْرَى لَكُمْ** (اور اللہ نے اسے تمہارے لیے صرف خوشخبری بنایا)۔ پس وہ ان ملائکہ میں سے تھے، یا وہ وہی ملائکہ تھے جنہوں نے آدم (علیہ السلام) کے حق میں کہا تھا: **أَتَجْعَلُ فِيهَا مَنْ يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ** (کیا تو اس میں ایسے کو بنائے گا جو اس میں فساد کرے گا اور خون بہائے گا؟)۔ پس اللہ نے انہیں بدر کے دن نازل کیا تو انہوں نے خون بہایا، جہاں انہوں نے آدم پر خون بہانے کا عیب لگایا تھا۔ پس انہوں نے اللہ کے حکم کی مخالفت نہیں کی۔ اور اس کا قول: **وَلِتَطْمَئِنَّ قُلُوبُكُمْ بِهِ** (اور تاکہ تمہارے دل اس سے مطمئن ہو جائیں) یعنی بشریت کی عادت ہے کہ وہ کثرت سے سکون حاصل کرتی ہے، چونکہ اہل بدر کم تھے اور مشرکین زیادہ تھے۔ پس جب انہوں نے ملائکہ کو دیکھا، جو پانچ ہزار تھے، اور مسلمان تین سو تھے اور مشرکین ایک ہزار تھے، تو مومنین کے دلوں کو کثرتِ تعداد سے اطمینان حاصل ہوا، باوجود اس کے کہ وہ قتال میں موجود تھے۔ پس انہوں نے ان کے دیکھنے سے اطمینان حاصل کیا اور ان کے دلوں میں ایسا امن پیدا ہوا کہ انہیں اونگھ نے آ لیا، کیونکہ خوف زدہ شخص سوتا نہیں ہے۔\n\n### [اللہ کا اپنے دین اور بندوں کی حفاظت پانچ ہزار نشان زدہ فرشتوں کے ذریعے]\n\nاور کثرت میں پانچ ہزار سے زیادہ کا ذکر نہیں کیا گیا، کیونکہ اعداد میں پانچ وہ عدد ہے جو اپنا اور دوسروں کا تحفظ کرتا ہے، اور دوسرے اعداد کو یہ رتبہ حاصل نہیں ہے۔ پس اللہ نے اپنے دین اور اپنے مومن بندوں کی حفاظت **بِخَمْسَةِ آلَافٍ مِنَ الْمَلَائِكَةِ مُسَوِّمِينَ** (پانچ ہزار نشان زدہ فرشتوں کے ذریعے) کی۔ یعنی وہ نشانات والے تھے جن سے پہچانا جاتا تھا کہ وہ ملائکہ ہیں، یا وہ وہی ملائکہ تھے جنہوں نے ہمارے حق میں کہا تھا کہ ہم خون بہائیں گے، پس انہوں نے دشمنوں کے مقابلے میں ہماری مدد کی اس چیز کے ذریعے جس کا انہوں نے ہم پر عیب لگایا تھا، کیونکہ اللہ نے انہیں اس کا حکم دیا تھا۔\n\n### [ملائکہِ تسخیر کی مدد کے مراتب کا انحصار]\n\nاور ملائکہ کی ولایت (الولایۃ) کے متعدد پہلو اور مقامات ہیں، لیکن ہم نے ان مراتب کا ذکر کیا جن پر اللہ نے تنبیہ فرمائی۔ پس انہوں نے اسماءِ الٰہیہ کی مدد کی، اور یہ اعلیٰ ترین مقام ہے۔ اور انہوں نے لمّات (اللمّات) کے ملائکہ کی مدد کی، اور انہوں نے مومنین کی مدد کی، اور انہوں نے توبہ کرنے والوں کی مدد کی، اور انہوں نے زمین والوں کی مدد کی۔ اور اس سے زیادہ کوئی نہیں جو ان کی مدد کا طالب ہو۔ پس مدد کے مراتب محدود ہو گئے۔\n\n### [ملائکہِ تسخیر حمد کے ساتھ آغاز کرتے ہیں اور پھر استغفار کرتے ہیں]\n\nپھر اللہ نے ان کی تعریف کی کہ وہ **يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ** (اپنے رب کی حمد کے ساتھ تسبیح کرتے ہیں)، یہ آغاز ہے، جنابِ الٰہی کو ترجیح دیتے ہوئے، اور اس کے بعد **وَيَسْتَغْفِرُونَ** (اور استغفار کرتے ہیں)، اور یہی ان کے لائق ہے کہ وہ جنابِ الٰہی کو مقدم رکھیں۔ اور اسی لیے:\n\nرسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) کسی بھی مقام پر لوگوں کو خطبہ دینے کے لیے کھڑے نہیں ہوئے مگر یہ کہ پہلے اللہ کی حمد و ثنا کی، پھر اس کے بعد جو چاہا کلام فرمایا۔\n\nآپ (صَلَّى اللهُ عَليهِ وسَلَّم) نے فرمایا: \"ہر اہم کام جو اللہ کی حمد سے شروع نہ کیا جائے، یا فرمایا کہ اللہ کے ذکر سے شروع نہ کیا جائے، وہ اجذم (کٹے ہوئے) ہے۔\"\n\nیعنی اللہ سے منقطع ہے۔ اور جب وہ اللہ سے منقطع ہو تو اگر اللہ چاہے تو اسے قبول کرے اور اگر چاہے تو قبول نہ کرے۔ اور جب وہ اللہ کے ذکر سے شروع کیا جائے تو وہ اس سے متصل ہوتا ہے، منقطع نہیں ہوتا، یعنی اجذم نہیں ہوتا۔ پس اللہ کا ذکر مقبول ہے، تو جو اس سے متصل ہو وہ بلاشبہ مقبول ہے۔ پھر یہ ملائکہ کے علم میں سے ہے کہ وہ ان حالات میں صرف اپنے رب کی حمد کے ساتھ تسبیح کرتے ہیں، اور رب (الرب) مصلح ہے، اور اصلاح فساد کے بغیر نہیں آتی۔ اور اللہ نے ان کے بارے میں یہ ذکر نہیں کیا کہ وہ دیگر اسماءِ الٰہیہ کی حمد کے ساتھ تسبیح کرتے ہیں، کیونکہ اللہ نے فرمایا: **الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ** (تمام تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے)۔ پس انہوں نے جان لیا کہ عالم پر متوجہ ہونے والا اسم صرف اسمِ رب (الرب) ہے، کیونکہ عالمِ ارض پر ہوائے نفس کا غلبہ ہے، اور یہی وہ فساد پیدا کرتا ہے جس کے بارے میں ملائکہ نے کہا تھا: **أَتَجْعَلُ فِيهَا مَنْ يُفْسِدُ فِيهَا** (کیا تو اس میں ایسے کو بنائے گا جو اس میں فساد کرے گا؟)۔ پس انہوں نے جان لیا کہ کیا واقع ہوگا، کیونکہ وہ حقائق کو جانتے تھے۔ اور معاملہ ویسا ہی ہوا جیسا انہوں نے کہا تھا۔\n\n### [متنافر اضداد سے پیدا ہونے والی مخلوق میں نزاع لازمی ہے]\n\nاور ان سے غلطی صرف اس وجہ سے ہوئی کہ انہوں نے اس قول میں جلدی کی، اس سے پہلے کہ وہ اس فعل میں اللہ کی حکمت کو جان لیں۔ اور انہیں اس پر وہ غیرت ابھارا جو ان کی فطرت میں جنابِ الٰہی کے لیے رکھی گئی ہے۔ کیونکہ متنافر اضداد سے پیدا ہونے والی مخلوق میں نزاع (جھگڑا) لازمی ہے۔ خاص طور پر ارکان (عناصر) سے پیدا ہونے والی مخلوق، کیونکہ یہ ایک مولود ہے جو ایک مولود سے، جو ایک مولود سے، جو ایک مولود سے، جو ایک رکن سے، جو ایک فلک سے، جو ایک برج سے، جو ایک طبیعت سے، جو ایک نفس سے پیدا ہوا ہے۔ اور اصل متقابل اسماءِ الٰہیہ (الأسماء الإلهية المتقابلة) ہیں۔ اور وہیں سے عالم میں تقابل سرایت کر گیا۔ پس ہم آخری درجات میں ہیں۔ لہٰذا ارکان سے پیدا ہونے والے مولود کے رتبے سے اوپر کے معاملات میں اختلاف کم ہوتا ہے، اگرچہ وہ خالی نہیں ہوتا۔ کیا تم ملأ اعلیٰ (الملإ الأعلى) کو نہیں دیکھتے کہ وہ کیسے جھگڑتے ہیں؟ اور رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) کو **بِالْمَلَإِ الْأَعْلَى إِذْ يَخْتَصِمُونَ** (ملأ اعلیٰ کے بارے میں جب وہ جھگڑ رہے تھے) کا علم نہیں تھا، یہاں تک کہ اللہ نے انہیں اس کی خبر دی۔ اور اس کی وجہ یہ ہے کہ ان کی اصل نشأت بھی اسی کا تقاضا کرتی ہے۔ اور اسی حقیقت سے جس پر وہ خلق کیے گئے، انہوں نے کہا: **أَتَجْعَلُ فِيهَا مَنْ يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ** (کیا تو اس میں ایسے کو بنائے گا جو اس میں فساد کرے گا اور خون بہائے گا؟)۔ اور یہ غیرت اور تعظیم کے پردے کے پیچھے ربوبیت کے لیے ایک خفی نزاع تھا۔\n\n### [عالم میں نزاع اور تنافر کی اصل]\n\nاور نزاع اور تنافر کی اصل وہی ہے جو ہم نے اسماءِ الٰہیہ (الأسماء الإلهية) میں ذکر کی: المحیی (زندہ کرنے والا) اور الممیت (مارنے والا)، المعز (عزت دینے والا) اور المذل (ذلیل کرنے والا)، الضار (نقصان دینے والا) اور النافع (نفع دینے والا)۔ اور الٰہ کو ایسا ہی ہونا چاہیے جس کے اسماء یہ ہوں، ان کے ساتھ اس کی مشیئت (ارادہ) اور ارادہ بھی شامل ہو، جو \"لو\" (اگر) کے ساتھ مقید ہیں، اور یہ حرفِ امتناع ہے جس میں اہل اللہ کے لیے ایک خفی راز ہے۔ پس جب تم یہ جان لو گے تو تم اللہ کے ہاں عالم کا عذر قائم کر دو گے۔ اور اسی لیے ملائکہ اپنی مدد اور دعا کا آغاز اپنے رب کی تسبیح اور اسی طرح کے اسماء کے ساتھ اس کی ثنا سے کرتے ہیں، یہ تعریض کرتے ہوئے کہ جس حقیقت میں وہ ہیں اس کی اصل اس کے قول میں ہے: **وَمَنْ يُضْلِلِ الله** (اور جسے اللہ گمراہ کرے) اور **وَمَنْ يَهْدِ الله** (اور جسے اللہ ہدایت دے)۔ یعنی سب کچھ تیرے ہاتھ میں ہے۔ اور اس وقت وہ استغفار کرتے ہیں، اللہ کے ہاں ان کا عذر قائم کرتے ہوئے۔ اور **وَإِلَى الله يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور تمام معاملات اللہ ہی کی طرف لوٹائے جاتے ہیں)۔ پس عالم میں ہر علم جو علمِ الٰہی سے مستنبط ہے، وہ علمِ عام ہے، اور اسے صرف کوئی نبی یا مقرب ولی (ولی مقرب مجتبیٰ) ہی جانتا ہے، خواہ وہ فرشتہ ہو یا انسان۔ لیکن عقلی نظر (النظر العقلي) کبھی بھی اس علم تک نہیں پہنچ سکتی، اپنے فکر اور ان دلائل میں غور کرنے کی بنیاد پر جن پر وہ خود انحصار کرتی ہے۔\n\n### [قرآن میں ملائکہِ تسخیر کے اسماء کا بیان]\n\nپس میں نے تمہیں ولایتِ ملکیہ (الولایۃ الملکیۃ) کے کچھ پہلو دکھا دیے، اس سے اوپر تک، وحی نازل کرنے میں ان کے تسخیر (Subservience) سے لے کر، اور عالم کے مصالح جیسے ہواؤں کا چلنا، بادلوں کا اٹھنا، اور بارش کا برسانا، کیونکہ وہ **الصَّافَّاتِ** (صفیں باندھنے والے)، **فَالزَّاجِرَاتِ** (جھڑکنے والے)، **فَالتَّالِيَاتِ** (تلاوت کرنے والے)، **وَالْمُرْسَلَاتِ** (بھیجے جانے والے)، **وَالنَّاشِرَاتِ** (پھیلانے والے)، **فَالْفَارِقَاتِ** (فرق کرنے والے)، **فَالْمُلْقِيَاتِ** (ڈالنے والے)، **وَالنَّازِعَاتِ** (کھینچنے والے)، **وَالنَّاشِطَاتِ** (آہستہ سے نکالنے والے)، **وَالسَّابِحَاتِ** (تیرنے والے)، **فَالسَّابِقَاتِ** (سبقت لے جانے والے)، **فَالْمُدَبِّرَاتِ** (تدبیر کرنے والے)، اور **فَالْمُقَسِّمَاتِ** (تقسیم کرنے والے) ہیں۔ اور یہ سب ملائکہِ تسخیر (ملائکۃ التسخیر) میں سے ہیں، اور ہر صنف کی ولایت (الولایۃ) اس کے مرتبے سے ہے جس میں وہ ہے۔\n\n### [ملائکہِ تدبیر اور نفوسِ ناطقہ کی مدد]\n\nاور جہاں تک ملائکہِ تدبیر (ملائکۃ التدبیر) کا تعلق ہے، اور وہ مرکب عالم کے اجسام کی مدبر ارواح ہیں، اور یہ مدبرہ (Governing) ہی نفوسِ ناطقہ (النفوس الناطقۃ) ہیں۔ تو ان میں ولایت (الولایۃ) یہ ہے کہ وہ اللہ کے لیے اس چیز میں مدد کرتی ہیں جسے اس نے ان کے لیے مقرر کیا ہے، جس کے ذریعے وہ اور ان کا جسم، جس کی تدبیر کا انہیں حکم دیا گیا ہے، سعادت حاصل کرتے ہیں۔ پس طبع (فطرت) آتی ہے اور اپنا مقصد حاصل کرنا چاہتی ہے، تو عقل (العقل) دیکھتی ہے کہ اس مقصد کے بارے میں شرعِ الٰہی (الشرع الإلهي) کا کیا حکم ہے۔ اگر وہ اسے اللہ کے نزدیک محمود (قابل تعریف) دیکھتی ہے تو اسے نافذ کرتی ہے، اور اگر اسے مذموم (قابل مذمت) دیکھتی ہے تو نفس کو اس پر متنبہ کرتی ہے اور اس مذموم مقصد کو دبانے کے لیے اس سے مدد طلب کرتی ہے۔ پس نفس اس کی مدد کرتا ہے اور خیر کو قبول کرتا ہے، تاکہ اللہ کا مشروع کلمہ (کلمۃ اللہ المشروعة) غالب ہو جائے، اس کلمہِ اللہ پر جو کافروں میں ہے اور جو پست ہے۔\n\n### [صدقہ سائل کے ہاتھ میں پڑنے سے پہلے رحمن کے ہاتھ میں پڑتا ہے]\n\nجیسا کہ صدقہ سائل کے ہاتھ میں پڑتا ہے، جو کہ نچلا ہاتھ ہے، اور سائل کا قول ہے: **وَأَقْرِضُوا الله** (اور اللہ کو قرض دو)۔ اور صدقہ سائل کے ہاتھ میں پڑنے سے پہلے رحمن (الرحمن) کے ہاتھ میں پڑتا ہے۔ سائل حروفِ سوال ادا کرنے والا ہے۔ اور اوپر والا ہاتھ (الید العلیا) جو خرچ کرنے والا ہے، نچلے ہاتھ (الید السفلی) جو سوال کرنے والا ہے، سے بہتر ہے۔ اور مال اللہ سبحانہ کا ہے: **هُوَ الْغَنِيُّ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ** (وہ بے نیاز ہے، آسمانوں اور زمین میں جو کچھ ہے اسی کا ہے)۔ اور ہم اس میں خلیفہ بنائے گئے ہیں، بلکہ ہم ہی اس مال کے خزانے اور خازن ہیں۔ پس اس چیز کو سمجھو جس کی طرف ہم نے اس باب میں اشارہ کیا ہے، کیونکہ یہ بہت نفع بخش ہے، اور ایک عظیم جہالت کو دور کرنے والا ہے، اور ایک الٰہی ادب (أدباً إلهياً) کا وارث بنانے والا ہے، جس میں اس شخص کے لیے ابدی سعادت ہے جو اس پر غور کرے، اسے سمجھے اور اس پر عمل کرے۔",
    "fa": "(باب صد و پنجاه و چهارم در معرفت مقام ولایت ملکی)\n\nهمانا ولایت، توقف بر خبری است\nاز سوی مهیمن (خداوند مسلط) در میان فرشتگان و بشر\n\nو در فرشتگان تسخیر، آن را آشکار ساخت\nپروردگار بندگان، از میان اهل نفع و ضرر\n\nاما فرشتگان حیرت (التهیام)، نصیبی در آن ندارند\nبر اساس آنچه در خبر آمده است\n\nحیرت‌زدگانی هستند مست از محبت او\nنه به عین (ذات) آگاهند و نه به اثر\n\nخداوند گرامی‌شان داشت، خداوند مقرب‌شان ساخت\nخداوند آنان را به مشهد (مقام) خطیر اختصاص داد\nمن فدایشان شوم از هر حادثه‌ای\nکه با گوش و چشم از آن آگاه نمی‌شوند\n\n### [فرشتگان حیرت‌زده (الملائكة المهيمة)]\n\nبدان که فرشتگان سه صنف هستند: صنفی حیرت‌زده (مهیم)؛ زیرا هنگامی که خداوند آنان را ایجاد کرد، در اسم جمیل خود بر ایشان تجلی (التجلی) نمود، پس آنان را حیران ساخت و از خودشان فانی (الفناء) کرد. از این رو، نه نفس خود را می‌شناسند، نه کسی را که در او حیران شده‌اند و نه آنچه آنان را حیران ساخته است. پس در حیرت و مستی به سر می‌برند. اینان کسانی هستند که خداوند آنان را از «اینیّت عماء» (حالت ابهام و غیب مطلق) ایجاد کرد؛ آن عماء که نه بالای آن «او» است و نه زیر آن «او» است، یا آنان هستند. و همه فرشتگان ارواحی هستند که خداوند آنان را در هیاکل (کالبدهای) نورانی خلق کرده است، مانند سایر فرشتگان؛ جز اینکه این فرشتگان از ولایت، تنها ولایت ممکنات را دارند که در شرح آیه «إِنْ تَنْصُرُوا الله» (اگر خدا را یاری کنید) ذکر کردیم.\n\n### [فرشتگان مسخّر (الملائكة المسخرة)]\n\nصنف دوم، فرشتگان مسخّر (المسخرة) هستند و رئیس آنان قلم اعلی (القلم الأعلى) است که همان عقل اول و سلطان عالم تدوین و تسطیر (نوشتن و سطر کشیدن) است. وجود آنان همزمان با عالم حیرت‌زده (المهیم) بود، جز اینکه خداوند آنان را از آن تجلی (التجلی) که اصحابشان را حیران ساخت، محجوب نمود. این به دلیل آن بود که خداوند می‌خواست این صنف مسخّر را از رتبه امامت در عالم بهره‌مند سازد، و این صنف ولایتی مخصوص به خود و فرشتگان تسخیر دارد.\n\n### [فرشتگان مدبّر (الملائكة المدبرة)]\n\nصنف سوم، فرشتگان تدبیر (المدبرة) هستند؛ یعنی ارواحی که مدبّر همه اجسام هستند، اعم از طبیعی، نورانی، هبائی (مادی اولیه)، فلکی و عنصری، و تمامی اجسام عالم. اینان نیز ولایتی دارند.\n\n### [یاری فرشتگان تسخیر با دعا برای مؤمنان گناهکار]\n\nاما ولایت فرشتگان تسخیر، یعنی یاری رساندن آنان به مؤمنان، هنگامی است که گناهی مرتکب شده‌اند و اسماء انتقام الهی بر آنان متوجه شده است. در این هنگام، اسماء غفران، عفو و گذشت از بدی‌ها در مقامات آن اسماء متوجه می‌شود. پس فرشتگان همان می‌گویند که خداوند متعال فرموده است: «وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا» (و برای کسانی که ایمان آورده‌اند طلب آمرزش می‌کنند) با این گفتارشان: «رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وَعِلْماً» (پروردگارا، رحمت و علم تو همه چیز را فرا گرفته است). آنان در حق مؤمن گناهکارِ غیرتائب، چیزی بیش از این نمی‌افزایند، به دلیل اعتمادشان بر علم خداوند در آنچه از این کلام قصد کرده‌اند؛ و این از روی ادب با خداوند سبحان است، زیرا شایسته جناب حق (الحق) است که اهل الله به خاطر او غیرت ورزند و بر کسی که نافرمانی او کرده و به امر او و آنچه شایسته جلال اوست عمل نکرده، دعا کنند. فرشتگان اهل ادب با خداوند هستند، پس گفتند: «رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً» (پروردگارا، رحمت تو همه چیز را فرا گرفته است) به واسطه قول تو: «وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ» (و رحمت من همه چیز را فرا گرفته است)، و این گناهکاران نیز داخل در عموم لفظ «کل» هستند؛ و «عِلْماً» (علم تو) از قول او: «أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً» (علم او بر همه چیز احاطه دارد).\n\n### [استغفار عیسی و فرشتگان در حق گناهکاران]\n\nاین مانند گفتار بنده صالحی است که خداوند از قول او خبر داده است: «إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ» (اگر عذابشان کنی، آنان بندگان تو هستند؛ و اگر ببخشی، همانا تو عزیز (قدرتمند) و حکیم (فرزانه) هستی). او در این گفتار با خداوند ادب ورزید، هنگامی که قومش نافرمانی خداوند متعال کردند و توبه ننمودند. خداوند دانست که او با حق (الحق) ادب ورزیده و به مغفرت اشاره کرده است، زیرا می‌دانست که رحمت او بر غضبش پیشی گرفته است. با این حال، نفس فرشتگان در ادب قوی‌تر است، زیرا آنان به خداوند و آنچه شایسته جلال اوست، داناتر از این بنده هستند. پس نگفتند: «وإن تغفر لهم» (و اگر ببخشی)، بلکه گفتند: «وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وَعِلْماً» (رحمت و علم تو همه چیز را فرا گرفته است). این تعریض (اشاره غیرمستقیم) نامیده می‌شود که تنبیهی است بر اینکه حق (الحق) در این مرتبه است، همان‌گونه که خود از خویش خبر داده است. و گفتار آنان «رحمة» (رحمت) را مقدم داشتند، زیرا خداوند متعال آن را مقدم داشت هنگامی که بنده خود خضر را ذکر کرد و فرمود: «آتَيْناهُ رَحْمَةً مِنْ عِنْدِنا» (رحمتی از جانب خود به او عطا کردیم) پیش از آنکه آنچه به او داده بود را ذکر کند. سپس آنچه را به خاطر رحمتش به او عطا کرده بود، ذکر نمود و فرمود: «وَعَلَّمْناهُ مِنْ لَدُنَّا عِلْماً» (و از نزد خود به او دانشی آموختیم). به همین دلیل، فرشتگان رحمت را مقدم داشتند و در دعای خود از ذکر گناهکاران سکوت کردند. پس میان کلام عیسی در حق قومش و دعای فرشتگان در حق بندگان گناهکار، از نظر ادب، تفاوت بسیاری است برای کسی که بنگرد و بصیرت یابد.\n\n### [روش محمد (ص) در طلب مغفرت برای قومش از پروردگارش]\n\nبه همین دلیل، پیامبر محمد (صَلَّى اللهُ عَليهِ وسَلَّم) تمام شب را با این آیه «إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ» (اگر عذابشان کنی، آنان بندگان تو هستند) به پا داشت و آن را تکرار می‌کرد تا فجر طلوع کرد؛ زیرا این کلام دیگری (عیسی) بود. او آن را به صورت حکایت تکرار می‌کرد و قصدش در آن معلوم بود، چنانکه در مَثَل گفته شده است:\n\n«إياك أعني فاسمعي يا جارة» (منظورم تو هستی، پس بشنو ای همسایه)\n\nاو تمام شب را با آیه قول فرشتگان به پا نداشت، زیرا مناسبت او با عیسی نزدیک‌تر است و مناسبت عیسی با فرشتگان نزدیک‌تر است، چرا که جبرئیل بر مادرش مریم در ایجاد عیسی به صورت بشری کامل متوجه شد. پس محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در طلب مغفرت برای قومش، راهی میان دو راه را پیمود.\n\n### [یاری فرشتگان تسخیر با دعا برای مؤمنان توبه‌کار]\n\nاین یاری خواستن آنان از خداوند در حق مؤمنان گناهکار بود. اما یاری آنان با دعا برای کسانی که توبه کرده‌اند، این گفتارشان است: «رَبَّنا فَاغْفِرْ لِلَّذِينَ تابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذابَ الْجَحِيمِ» (پروردگارا، کسانی را که توبه کرده‌اند و راه تو را پیروی نموده‌اند، بیامرز و آنان را از عذاب دوزخ حفظ کن). آنان به صراحت از ایشان نام بردند، زیرا این افراد با توبه در مقام قرب الهی قرار گرفته و در بازگشت به سوی خداوند، درِ آن را کوبیده‌اند. فرشتگان دربانان حق (الحق) هستند، پس هنگامی که آنان به صفت توبه متصف شدند، از خداوند برایشان مغفرت طلبیدند. این نیز از ادب است. سپس، چون فرشتگان دانستند که میان بهشت و دوزخ منزلی متوسط به نام اعراف (الأعراف) وجود دارد که کسی که در آن است، نه در دوزخ است و نه در بهشت؛ و از لطف خداوند نسبت به بندگانش آگاه بودند که دعای دعا کننده را اجابت می‌کند، پس فرشتگان پس از گفتارشان «وَقِهِمْ عَذابَ الْجَحِيمِ» (و آنان را از عذاب دوزخ حفظ کن)، گفتند: «رَبَّنا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ» (پروردگارا، و آنان را به باغ‌های عدنی که به ایشان وعده داده‌ای وارد کن)؛ یعنی آنان را در اعراف جای مده، بلکه به بهشت وارد کن. و «وَمَنْ صَلَحَ» (و هر که صالح باشد)؛ واو در اینجا به معنای «مع» (همراه) است. می‌گویند: همراه با کسانی که صالح شدند از «آبائِهِمْ وَأَزْواجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ» (پدرانشان و همسرانشان و فرزندانشان، همانا تو عزیز (قدرتمند) و حکیم (فرزانه) هستی). همان‌گونه که بنده صالح گفت: «وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ» (و اگر ببخشی، همانا تو عزیز و حکیم هستی). هیچ‌یک از آنان نگفتند: «إنک أنت الغفور الرحیم» (همانا تو آمرزنده و مهربان هستی)، و این از روی ادب با جناب الهی از سوی هر دو گروه است. پس با ذکر این دو اسم در محضر ادب با خداوند، اجتماع کردند.\n\n### [یاری فرشتگان تسخیر با دعا برای فرشتگان موکل بر قلب‌های آدمیان]\n\nسپس فرشتگان در یاری رساندن به فرشتگان موکل بر قلب‌های بنی‌آدم، که همان اصحاب لَمّات (نکات الهامی) هستند، افزودند. آنان با دعا، فرشتگان را بر دشمنانشان از شیاطین (الشياطين) که اصحاب لَمّات موکل و مسلط بر قلب‌های بندگان هستند و با آنچه فرشتگان بر قلب‌های بنی‌آدم در لَمّاتشان القا می‌کنند، منازعه می‌کنند، یاری می‌رسانند. پس گفتند: «وَقِهِمُ السَّيِّئاتِ» (و آنان را از بدی‌ها حفظ کن)؛ این یاری برای فرشتگان در برابر شیاطین است. سپس در درخواست خود با این گفتار لطافت به خرج دادند: «وَمَنْ تَقِ السَّيِّئاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ» (و هر کس را که در آن روز از بدی‌ها حفظ کنی، همانا به او رحم کرده‌ای).\n\n### [یاری فرشتگان تسخیر با استغفار برای همه کسانی که در زمین هستند بدون تعیین]\n\nسپس از جمله یاری رساندن آنان برای کسانی که در زمین هستند، بدون تعیین مؤمن از غیر مؤمن، این قول خداوند متعال درباره آنان است: «وَالْمَلائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَنْ فِي الْأَرْضِ» (و فرشتگان پروردگارشان را با حمد تسبیح می‌گویند و برای کسانی که در زمین هستند طلب آمرزش می‌کنند) به صورت مطلق و بدون تعیین، از روی ادب با خداوند. و زمین جامع است، پس مؤمن و غیر مؤمن در این استغفار داخل می‌شوند. سپس خداوند اهل زمین را به پذیرش استغفار فرشتگان بشارت داد با این قولش: «أَلا إِنَّ الله هُوَ الْغَفُورُ الرَّحِيمُ» (آگاه باشید که همانا خداوند آمرزنده و مهربان است) و نگفت: «الفعال لما یرید» (آنکه هر چه بخواهد انجام می‌دهد). به همین دلیل نیز گفتیم که بندگان خدا به سوی رحمت متمایل می‌شوند، و اگرچه در آتش ساکن شوند، رحمتی در آن برایشان هست که جز خودشان کسی از آن آگاه نیست. و چه بسا آن رحمت به آنان اجازه دهد که اگر بویی از بوهای بهشت به مشامشان برسد، از آن متضرر شوند، همان‌گونه که بادهای گلاب و عطر به مزاج‌های گرم‌مزاجان ضرر می‌رساند. این همه از ولایت فرشتگان است. پس یاری آنان به حمد خدا عمومیت یافت. چه نیکو برادرانی برای ما هستند!\n\n### [یاری فرشتگان تسخیر مؤمنان را بر دشمنانشان در جنگ]\n\nاما یاری آنان به مؤمنان در برابر دشمنان در جنگ، این است که به عنوان مدد نازل می‌شوند، با دعا. و در روز بدر به طور خاص به عنوان جنگجو نازل شدند و تعدادشان پنج هزار بود. در این امر آرامشی است، زیرا نص صریح نیست، به دلیل قول خداوند: «وَما جَعَلَهُ الله إِلَّا بُشْرى‏ لَكُمْ» (و خداوند آن را قرار نداد مگر بشارتی برای شما). پس آنان یا همان فرشتگانی بودند که در حق آدم گفتند: «أَ تَجْعَلُ فِيها مَنْ يُفْسِدُ فِيها وَيَسْفِكُ الدِّماءَ» (آیا در آن کسی را قرار می‌دهی که فساد کند و خون بریزد؟)، پس خداوند آنان را در روز بدر نازل کرد تا خون بریزند، در جایی که آدم را به خونریزی عیب گرفته بودند. پس از امر خداوند تخلف نکردند. و قول او: «وَلِتَطْمَئِنَّ قُلُوبُكُمْ بِهِ» (و تا دل‌های شما به آن آرام گیرد)؛ یعنی از عادت بشری است که به کثرت آرامش یابد، زیرا اهل بدر کم بودند و مشرکان زیاد. هنگامی که فرشتگان را دیدند که پنج هزار نفر بودند و مسلمانان سیصد نفر و مشرکان هزار نفر، دل‌های مؤمنان به کثرت عدد آرام گرفت، با وجود اینکه فرشتگان می‌جنگیدند. پس با دیدن آنان آرامش یافتند و در دل‌هایشان چنان امنیتی حاصل شد که خواب بر آنان غلبه کرد، زیرا شخص ترسان نمی‌خوابد.\n\n### [حفظ خداوند دین و بندگانش را با پنج هزار فرشته نشان‌دار]\n\nو در کثرت، بیش از پنج هزار ذکر نشده است، زیرا عدد پنج از اعدادی است که خود و غیر خود را حفظ می‌کند و سایر اعداد این مرتبه را ندارند. پس خداوند دین و بندگان مؤمن خود را با «خَمْسَةِ آلافٍ مِنَ الْمَلائِكَةِ مُسَوِّمِينَ» (پنج هزار فرشته نشان‌دار) حفظ کرد؛ یعنی صاحبان علامت‌هایی که با آن‌ها شناخته می‌شوند که از فرشتگان هستند، یا همان فرشتگانی که در حق ما گفتند خون می‌ریزیم، پس ما را بر دشمنان یاری دادند با همان چیزی که بر ما عیب گرفته بودند، زیرا خداوند به آنان امر کرده بود.\n\n### [حصر مراتب یاری فرشتگان تسخیر]\n\nولایت فرشتگان وجوه و مواقف متعددی دارد، اما ما مراتب محصوری را که خداوند بر آن‌ها تنبیه کرده است، ذکر کردیم. پس آنان اسماء الله را یاری دادند که بالاترین مقامات است، و فرشتگان لَمّات را یاری دادند، و مؤمنان را یاری دادند، و توبه‌کاران را یاری دادند، و کسانی را که در زمین هستند یاری دادند. و کسی نیست که بیش از این طلب یاری کند. پس مراتب یاری منحصر شد.\n\n### [فرشتگان تسخیر با حمد آغاز می‌کنند و سپس استغفار می‌کنند]\n\nسپس خداوند بر آنان ثنا گفت که «يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ» (پروردگارشان را با حمد تسبیح می‌گویند) به عنوان آغاز کار، برای ترجیح دادن جناب حق (الحق)، و سپس «يَسْتَغْفِرُونَ» (طلب آمرزش می‌کنند) که شایسته آنان است؛ یعنی مقدم داشتن جناب حق (الحق). به همین دلیل:\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در هیچ مقامی برای خطبه گفتن به مردم نایستاد مگر اینکه ابتدا حمد و ثنای خداوند را گفت و سپس آنچه می‌خواست سخن می‌گفت.\n\nفرمود: «کل أمر ذي بال لا يبدأ فيه بحمد الله أو قال بذكر الله فهو أجذم» (هر کار مهمی که با حمد خدا یا به گفته او با ذکر خدا آغاز نشود، ابتر (اجذم) است).\n\nیعنی از خداوند بریده شده است. و اگر از خداوند بریده شده باشد، اگر خداوند بخواهد آن را می‌پذیرد و اگر نخواهد نمی‌پذیرد. اما اگر با ذکر خدا آغاز شود، به او وصل است و بریده نیست (اجذم نیست)، پس ذکر خدا مقبول است و آنچه به او وصل باشد، بدون شک مقبول است. سپس از علم فرشتگان است که آنان در این احوال تسبیح نمی‌گویند مگر با حمد پروردگارشان (الرب)، و رب (الرب) همان مصلح است، و اصلاح جز بر فساد وارد نمی‌شود. و خداوند از آنان ذکر نکرده است که با حمد اسم دیگری از اسماء الهی تسبیح می‌گویند، زیرا خداوند فرمود: «الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (حمد مخصوص خداوندی است که پروردگار جهانیان است). پس دانستند که آنچه بر عالم متوجه است، همان اسم رب (الرب) است، زیرا سلطان هوی بر عالم زمین غالب است و همان است که فسادی را به ارث می‌گذارد که فرشتگان گفتند: «أَ تَجْعَلُ فِيها مَنْ يُفْسِدُ فِيها» (آیا در آن کسی را قرار می‌دهی که فساد کند؟). پس آنان به دلیل علمشان به حقایق، آنچه واقع می‌شود را دانستند و امر نیز همان‌گونه که گفتند واقع شد.\n\n### [مولود از اضداد متنافر، ناگزیر در آن نزاع است]\n\nاشتباه آنان تنها در شتاب‌زدگی در این گفتار بود، پیش از آنکه حکمت خداوند در این کار را بدانند. و آنچه آنان را بر این واداشت، غیرتی بود که بر جناب حق (الحق) سرشته شده بودند، زیرا مولود از اضداد متنافر، ناگزیر در آن نزاع است، به ویژه مولود از ارکان (عناصر)، که مولودی است از مولودِ مولودِ مولودِ رکن، از فلک، از برج، از طبیعت، از نفس. و اصل، اسماء الهی متقابل هستند. و از آنجا تقابل در عالم سرایت کرد. ما در آخرین درجات هستیم، پس اختلاف در آنچه بالاتر از رتبه مولود از ارکان است، کمتر است، اگرچه خالی از اختلاف نیست. آیا به ملأ اعلی (الملأ الأعلى) نمی‌نگری که چگونه با هم خصومت می‌کنند؟ و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از «بِالْمَلَإِ الْأَعْلى‏ إِذْ يَخْتَصِمُونَ» (ملأ اعلی هنگامی که با هم خصومت می‌کردند) آگاهی نداشت تا اینکه خداوند او را آگاه ساخت. و سبب آن این است که اصل نشأت آنان نیز این را اقتضا می‌کند. و از همین حقیقتی که بر آن خلق شده‌اند، گفتند: «أَ تَجْعَلُ فِيها مَنْ يُفْسِدُ فِيها وَيَسْفِكُ الدِّماءَ» (آیا در آن کسی را قرار می‌دهی که فساد کند و خون بریزد؟)، و این نزاعی پنهان برای ربوبیت (الربوبية) از پشت حجاب غیرت و تعظیم بود.\n\n### [اصل نزاع و تنافر در عالم]\n\nو اصل نزاع و تنافر همان است که ذکر کردیم؛ یعنی اسماء الهی: المحیی (زنده‌کننده) و الممیت (میراننده)، المعز (عزت‌دهنده) و المذل (خوارکننده)، الضار (زیان‌رسان) و النافع (سودرسان). و شایسته نیست که اله (خداوند) جز کسی باشد که این‌ها اسماء او باشند، به اضافه مشیّت و اراده مقید او به «لو» (اگر)، که حرف امتناع است و در آن سری پنهان برای اهل علم بالله وجود دارد. پس اگر این را دانستی، عذر عالم را نزد خداوند پذیرفتی. به همین دلیل، فرشتگان در یاری و دعای خود با تسبیح پروردگارشان و ثنای او با چنین اسمایی آغاز می‌کنند، به صورت تعریض (اشاره) که اصل آنچه در آن هستند، از حقایق قول اوست: «وَمَنْ يُضْلِلِ الله» (و هر کس را که خداوند گمراه کند) و «وَمَنْ يَهْدِ الله» (و هر کس را که خداوند هدایت کند)؛ یعنی همه چیز در دست توست. و در این هنگام استغفار می‌کنند تا عذر آنان را نزد خداوند بپذیرند. و «وَإِلَى الله يُرْجَعُ الْأَمْرُ كُلُّهُ» (و همه امور به سوی خداوند بازگردانده می‌شود). پس هر علمی در عالم که از علم الهی استنباط شود، همان علم عام است و آن را جز پیامبر یا ولی مقرب و برگزیده از فرشته و بشر نمی‌شناسد. اما نظر عقلی، هرگز از حیث فکر و نظر در ادله‌ای که به تنهایی به کار می‌برد، به این علم نمی‌رسد.\n\n### [برشمردن اسماء فرشتگان تسخیر در قرآن]\n\nاینک برخی از آنچه ولایت ملکی (الولایة الملکیة) بر آن است، تا آنچه بالاتر از آن است، از تسخیر آنان در نزول وحی و مصالح عالم، از وزش بادها و ایجاد ابرها و نزول باران، به تو نشان دادم؛ زیرا آنان «الصَّافَّاتِ» (صف‌بستگان) و «فَالزَّاجِراتِ» (رانندگان) و «فَالتَّالِياتِ» (تلاوت‌کنندگان) و «وَالْمُرْسَلاتِ» (فرستادگان) و «وَالنَّاشِراتِ» (گسترانندگان) و «فَالْفارِقاتِ» (جداکنندگان) و «فَالْمُلْقِياتِ» (القا کنندگان) و «وَالنَّازِعاتِ» (برکندگان) و «وَالنَّاشِطاتِ» (بیرون‌آورندگان) و «وَالسَّابِحاتِ» (شناوران) و «فَالسَّابِقاتِ» (پیشی‌گیرندگان) و «فَالْمُدَبِّراتِ» (تدبیرکنندگان) و «فَالْمُقَسِّماتِ» (تقسیم‌کنندگان) هستند. و همه این‌ها از فرشتگان تسخیر هستند و ولایت هر صنف از مرتبه‌ای است که در آن قرار دارد.\n\n### [فرشتگان تدبیر و یاری آنان برای نفوس ناطقه]\n\nاما فرشتگان تدبیر، که همان ارواح مدبّر اجسام مرکب عالم هستند، و این مدبّره‌ها همان نفوس ناطقه (النفوس الناطقة) می‌باشند، ولایت در آن‌ها یاری رساندن به خداوند است در آنچه سعادت نفس و سعادت جسدش را که مأمور به تدبیر آن شده، در گرو آن قرار داده است. پس طبع (الطبع) می‌آید و می‌خواهد به هدف خود برسد. در این هنگام عقل می‌نگرد که حکم شرع الهی (الشرع الإلهي) در آن هدف چیست. اگر آن را نزد خداوند پسندیده دید، آن را اجرا می‌کند؛ و اگر آن را ناپسند دید، نفس را بر آن آگاه می‌سازد و از او یاری می‌طلبد تا این هدف ناپسند را سرکوب کند. پس نفس او را یاری می‌دهد و خیر را می‌پذیرد. این برای آن است که کلمه مشروع خداوند بر کلمه خداوند در مورد کافران که پست‌تر است، برتری یابد.\n\n### [صدقه پیش از آنکه به دست سائل برسد، به دست رحمان می‌افتد]\n\nهمان‌گونه که صدقه به دست سائل می‌افتد که دست پایین‌تر است، و سائل می‌گوید: «وَأَقْرِضُوا الله» (و به خداوند قرض دهید)، و صدقه پیش از آنکه به دست سائل برسد، به دست رحمان (الرحمن) می‌افتد.\n\nکسی که حروف سؤال را بر زبان می‌آورد، و دست بالا (العليا) که انفاق می‌کند، بهتر از دست پایین (السفلی) است که سؤال می‌کند. و مال از آن خداوند سبحان است: «هُوَ الْغَنِيُّ لَهُ ما فِي السَّماواتِ وَما فِي الْأَرْضِ» (او بی‌نیاز است، آنچه در آسمان‌ها و آنچه در زمین است از آن اوست). و ما در آن جانشین شده‌ایم، بلکه ما خزانه‌ها و خزانه‌داران این مال هستیم. پس آنچه را در این باب به آن اشاره کردیم، محقق بدان، زیرا بسیار سودمند است و جهل عظیمی را برطرف می‌کند و ادب الهی را به ارث می‌گذارد که در آن سعادت ابدی است برای کسی که نزد آن توقف کند و آن را بفهمد و به آن عمل نماید."
  },
  "page_count": 4
}