{
  "id": 255,
  "title": {
    "ar": "الباب الخامس والخمسون ومائتان في معرفة المحق وهو فناؤك في عينه وفي معرفة محق المحق وهو ثبوتك في عينه",
    "en": "Chapter Two Hundred and Fifty-Five: Concerning the Gnosis (معرفة) of Effacement (المحق)—which is your annihilation (فناؤك) in His very Essence—and concerning the Gnosis of the Effacement of Effacement (محق المحق)—which is your subsistence (ثبوتك) in His very Essence.",
    "ur": "باب دو سو پچپن (۲۵۵): محق (المحق) کی معرفت میں، جو کہ اس کی ذات (عینہ) میں تیرا فنا (الفناء) ہے، اور محق المحق کی معرفت میں، جو کہ اس کی ذات (عینہ) میں تیرا ثبوت (الثبوت) ہے۔",
    "fa": "باب دویست و پنجاه و پنجم در معرفت محق (المحق) و آن فنای تو در عین اوست (فناؤك في عينه) و در معرفت محقِ محق (محق المحق) و آن ثبوت تو در عین اوست (ثبوتك في عينه)"
  },
  "content": {
    "ar": "## «الباب الخامس والخمسون ومائتان في معرفة المحق وهو فناؤك في عينه وفي معرفة محق المحق وهو ثبوتك في عينه»\n\n\n> فناء الكون في الأعيان محق *** وعين الكون حق ثم خلق‏\n\n\n> فإن قام الدليل على وجودي *** يقوم بذات من يبغيه محق‏\n\n\n> وإني بالذي يحويه كوني *** من أسماء الحقيقة في شق‏\n\n\nهذا المحق وأما محق المحق فهو\n\n\n> إن محق المحق إبدار *** وهو في التحقيق انذار\n\n\n> فإذا أبصرت طلعته *** في لم تدركه أبصار\n\n\n> قال للحداد حين أتى *** دونه حجب وأستار\n\n\n> من أنا فقال خالقنا *** ودليلي فيك آثار\n\n\n### [أن المحق ظهور في الكون بطريق الاستخلاف والنيابة]\n\n\nاعلم أن المحق ظهورك في الكون به بطريق الاستخلاف والنيابة عنه فلك التحكم في العالم ومحق المحق ظهورك بطريق الستر عليه والحجاب فأنت تحجبه في محق المحق فيقع شهود الكون عليك خلقا بلا حق لأنهم لا يعلمون أن الله أرسلك سترا دونهم حتى لا ينظرون إليه فمحق المحق يقابل المحق ما هو مبالغة في المحق وإنما هو مثل عدم العدم فإذا أقيم العبد في‏\nخروجه عن حضرة الحق إلى الخلق بطريق التحكيم فيهم من حيث لا يشعرون وقد يشعرون في حق بعض الأشخاص من هذا النوع كالرسل عليهم السلام الذين جعلهم الله خلائف في الأرض يبلغون إليهم حكم الله فيهم وأخفى ذلك في الورثة فهم خلفاء من حيث لا يشعر بهم ولا يتمكن لهذا الخليفة المشعور به وغير المشعور به أن يقوم في الخلافة إلا بعد أن يحصل معاني حروف أوائل السور سور القرآن المعجمة مثل الم ألف لام ميم وغيرها الواردة في أوائل بعض سور القرآن فإذا أوقفه الله على حقائقها ومعانيها تعينت له الخلافة وكان أهلا للنيابة هذا في علمه بظاهر هذه الحروف وأما علمه بباطنها فعلى تلك المدرجة يرجع إلى الحق فيها فيقف على أسرارها ومعانيها من الاسم الباطن إلى أن يصل إلى غايتها فيحجب الحق ظهوره بطريق الخدمة في نفس الأمر فيرى مع هذا القرب الإلهي خلقا بلا حق كما يرى العامة بعضهم بعضا فيحكم في العالم عند ذلك بما\n\n\nتقتضيه حقيقته بما هو نسخة كونية للمناسبة التي بينه وبين العالم فلا يعلم العالم هذا القرب الإلهي وهذا هو محق المحق الذي يصل إليه رجال الله فهو يشهد الله بالله ويشهد الكون بنفسه لا بالله ويكون في هذا المقام متحققا من حروف أوائل السور المعجمة بالألف والراء خاصة مع علمه بما بقي منها غير أن الحكم فيه للالف والراء في هذا المقام حيثما وقعا من السور وأما حكمه في العالم في هذا المقام فمن باقي هذه الحروف من لام وميم وصاد وكاف وهاء وياء وعين وطاء وسين وحاء وقاف ونون فبهذه الحروف يظهر في العالم في مقام محق المحق وبالألف والراء يظهر في المحق وهم الأولياء الذين قال فيهم النبي صلى الله عليه وسلم إذا رأوا ذكر الله وذلك لأن عين تجليهم بهذين الحرفين في الصورة الظاهرة عين تجلى الحق فمن رآهم رأى الحق فهم إذا رأوا ذكر الله لتحققهم بصفته فهم يشاهدون الحق فيه إذا تجلى لهم في صورة حق ولقد رأيته في هذا التحلي ورأيت كثيرين من أهل الله لا يعرفونه وينكرونه وتعجبت من ذلك حتى أعلمت بأنهم وإن كانوا من أهل الله من حيث إنهم عاملون بأوامر الله لا عالمون فهم أهل إيمان ولما كان بين رتبة الألف من هذه الحروف وبين الراء ثلاث مراتب لذلك لم تقو الراء قوة الألف فإن الألف لا تحمل الحركة ولا تقبلها والراء ليست كذلك‏\n\n\n### [أن محق المحق والمحق في الدنيا وفي الآخرة]\n\n\nواعلم أن محق المحق أتم عند أهل الله في الدنيا والمحق أتم في الآخرة ومحق المحق لا يفوز به إلا أخص أهل الله وهو للعقول المنورة هياكلها والمحق يفوز به الخصوص وهو للنفوس المنورة جعلنا الله ممن محق محقه فانفرد به حقه وهذه التي تسمى خلوة الحق فإنه لا يشهد ولا يرى وإن علمه بعض الناس فلا يكون مشهودا له ومن هذه الحقيقة اتخذ أهل الله الخلوة للانفراد لما رأوه تعالى اتخذها للانفراد بعبده ولهذا لا يكون في الزمان إلا واحد يسمى الغوث والقطب وهو الذي ينفرد به الحق ويخلو به دون خلقه فإذا فارق هيكله المنور انفرد بشخص آخر لا ينفرد بشخص في زمان واحد وهذه الخلوة الإلهية من علم الأسرار التي لا تذاع ولا تفشي وما ذكرناها وسميناها إلا لتنبيه قلوب الغافلين عنها بل الجاهلين بها فإني ما رأيت ذكرها أحد قبلي ولا بلغني مع علمي بأن خاصة أهل الله بها عالمون وقد ورد خبر صحيح في التنبيه على هذا يوم القيامة حيث الجمع الأكبر في انفراد العبد مع ربه وحده فيضع كنفه عليه ويقرره على ما كان منه ثم يقول له إني سترتها عليك في الدنيا وأنا أسترها عليك هنا ثم يأمر به إلى الجنة فنبه على الانفراد بالله ونبهناك نحن على الانفراد الإلهي بالعبد وذلك العبد عين الله في كل زمان لا ينظر الحق في زمانه إلا إليه وهو الحجاب الأعلى والستر الأزهى والقوام الأبهى‏\n\n",
    "en": "## Chapter Two Hundred and Fifty-Five: Concerning the Knowledge of Effacement (المحق), which is your annihilation in His very Essence, and concerning the Knowledge of the Effacement of Effacement (محق المحق), which is your subsistence in His very Essence.\n\n> The annihilation of the cosmos in the Fixed Entities (الأعيان) is Effacement,\n> And the very Essence of the cosmos is The Real (الحق), then Creation (الخلق).\n> If the proof is established upon my existence,\n> It is established by the Essence of the one who seeks Effacement.\n> And I, by that which my being encompasses,\n> Am in a division concerning the Names of the Reality (الحقيقة).\n\nThis is Effacement. As for the Effacement of Effacement, it is:\n\n> Indeed, the Effacement of Effacement is a full moon,\n> And in verification, it is a warning.\n> So when you perceive its rising,\n> In that which eyes cannot grasp.\n> He said to the blacksmith when he came,\n> Before him were veils and curtains.\n> \"Who am I?\" He replied, \"Our Creator,\n> And my proof in you are the traces.\"\n\n### [That Effacement is an Appearance in the Cosmos through the Path of Vicegerency and Representation]\n\nKnow that Effacement (المحق) is your appearance in the cosmos through Him, by way of vicegerency (*istikhlaf*) and representation (*niyāba*) on His behalf. Thus, you have control over the World (العالم).\n\nAnd the Effacement of Effacement (محق المحق) is your appearance by way of concealing Him and veiling Him. Thus, you veil Him in the Effacement of Effacement. Consequently, the witnessing of the cosmos falls upon you as creation without The Real (خلقا بلا حق), because they do not know that Allah sent you as a veil before them so that they might not look upon Him.\n\nThus, the Effacement of Effacement is the opposite of Effacement; it is not merely an exaggeration of Effacement, but rather it is like the non-existence of non-existence.\n\nWhen the servant is established in his departure from the Divine Presence (حضرة الحق) to the Creation (الخلق) by way of ruling over them—sometimes without their awareness, and sometimes with their awareness concerning certain individuals of this type, such as the Messengers (الرسل) upon whom be peace, whom Allah made vicegerents (*khulafā’*) on Earth to convey His ruling concerning them—He concealed this in the inheritors (الورثة), so they are vicegerents without being perceived as such.\n\nNeither this perceived vicegerent nor the unperceived one can stand in the Vicegerency (الخلافة) unless he first attains the meanings of the disjointed letters (الحروف المعجمة) at the beginning of the Quranic chapters, such as *Alif Lām Mīm* (الم) and others that appear at the beginning of some chapters of the Quran. When Allah makes him stand upon their realities and meanings, the Vicegerency is determined for him, and he becomes worthy of the Representation.\n\nThis is concerning his knowledge of the outward aspect of these letters. As for his knowledge of their inward aspect, upon that degree, he returns to The Real concerning them, standing upon their secrets and meanings, starting from the Name the Inner (الاسم الباطن) until he reaches their ultimate limit. Then The Real veils His appearance through the path of service (*khidma*) in the matter itself. Thus, despite this Divine Proximity (القرب الإلهي), he is seen as creation without The Real, just as the common people see one another.\n\nHe then rules in the World according to what his reality necessitates, being a cosmic copy (نسخة كونية) due to the suitability between him and the World. The World does not know this Divine Proximity. And this is the Effacement of Effacement (محق المحق) which the Men of Allah (رجال الله) attain. He witnesses Allah by Allah, and he witnesses the cosmos by himself, not by Allah.\n\nAnd in this station, he is realized through the disjointed letters at the beginning of the chapters, specifically the *Alif* (ألف) and the *Rā’* (راء), along with his knowledge of the remaining letters. However, the ruling power in this station belongs to the *Alif* and the *Rā’*, wherever they occur in the chapters. As for his ruling power in the World in this station, it comes from the rest of these letters: *Lām*, *Mīm*, *Sād*, *Kāf*, *Hā’*, *Yā’*, *‘Ayn*, *Tā’*, *Sīn*, *Hā’*, *Qāf*, and *Nūn*. Through these letters, he appears in the World in the station of the Effacement of Effacement. And through the *Alif* and the *Rā’*, he appears in Effacement.\n\nThey are the Saints (الأولياء) concerning whom the Prophet, peace and blessings be upon him, said: \"When they are seen, Allah is remembered.\" This is because the very essence of their theophany (*tajallī*) through these two letters in the manifest form is the very essence of the Theophany of The Real. So whoever sees them sees The Real. Thus, when they are seen, Allah is remembered, due to their realization of His Attribute. They witness The Real in him when He discloses Himself to them in the form of The Real.\n\nI have indeed seen Him in this self-disclosure, and I have seen many of the People of Allah (أهل الله) who do not recognize Him and deny Him. I was astonished by this until I was informed that although they are among the People of Allah in the sense that they are doers of Allah’s commands, they are not knowers (*‘ālimūn*); rather, they are people of faith (*īmān*).\n\nSince there are three degrees (مراتب) between the rank of the *Alif* among these letters and the *Rā’*, the *Rā’* does not possess the strength of the *Alif*. For the *Alif* neither carries a vowel nor accepts one, while the *Rā’* is not like that.\n\n### [That the Effacement of Effacement and Effacement are in this World and the Hereafter]\n\nKnow that the Effacement of Effacement (محق المحق) is more complete for the People of Allah (أهل الله) in this world, and Effacement (المحق) is more complete in the Hereafter. The Effacement of Effacement is attained only by the most select of the People of Allah, and it belongs to the intellects whose structures are illuminated. Effacement is attained by the select (الخصوص), and it belongs to the illuminated souls.\n\nMay Allah make us among those whose effacement is effaced, so that The Real (حقه) is singled out by him. This is what is called the Seclusion of The Real (خلوة الحق), for He is neither witnessed nor seen, and even if some people know him, he is not witnessed by them.\n\nIt is from this Reality that the People of Allah adopted seclusion (*khalwa*) for isolation, having seen that He (Exalted is He) adopted it for isolation with His servant. For this reason, there is only one in any given time called the Succor (*al-Ghawth*) and the Pole (*al-Qutb*), who is the one with whom The Real is isolated and secluded, apart from His creation. When he departs from his illuminated structure, The Real isolates Himself with another person, for He does not isolate Himself with two persons in one time.\n\nThis Divine Seclusion is part of the science of secrets that is neither broadcast nor divulged. We have only mentioned and named it to alert the hearts of those who are heedless of it, or rather, ignorant of it. For I have not seen anyone mention it before me, nor has it reached me, despite my knowledge that the elite of the People of Allah are aware of it.\n\nA sound report has been transmitted alerting to this on the Day of Resurrection, at the Great Gathering, concerning the servant’s isolation with his Lord alone. He places His covering (كنفه) over him and makes him confess what he did, then He says to him: \"I concealed it for you in the world, and I conceal it for you here.\" Then He commands him to be taken to Paradise.\n\nThus, He alerted to isolation with Allah, and we have alerted you to the Divine Isolation with the servant. And that servant is the very Essence of Allah (*‘ayn Allāh*) in every time. The Real looks in his time only upon him. He is the Highest Veil (الحجاب الأعلى), the Most Radiant Covering (الستر الأزهى), and the Most Glorious Support (القوام الأبهى).",
    "ur": "باب نمبر دو سو پچپن: محق (المحق) کی معرفت میں، جو کہ اس کی ذات میں تمہارا فنا (الفناء) ہونا ہے، اور محق المحق (محق المحق) کی معرفت میں، جو کہ اس کی ذات میں تمہارا ثبوت (بقا) ہونا ہے۔\n\nاعیان (الأعیان) میں عالم کا فنا (الفناء) محق (المحق) ہے۔\nاور عالم کی عین (ذات) حق (الحق) ہے، پھر خلق (تخلیق) ہے۔\nپس اگر میرے وجود پر دلیل قائم ہو،\nتو جو اسے چاہتا ہے، اس کی ذات کے ساتھ محق (المحق) قائم ہوتا ہے۔\nاور میں اس چیز کے ذریعے جو میرا عالم گھیرے ہوئے ہے،\nحقیقت کے اسماء میں سے ایک شق (پہلو) میں ہوں۔\n\nیہ محق (المحق) ہے، اور جہاں تک محق المحق (محق المحق) کا تعلق ہے، تو وہ یہ ہے:\n\nبے شک محق المحق (محق المحق) کمال کا ظہور (ابدار) ہے،\nاور وہ حقیقت میں انذار (آگاہی) ہے۔\nپس جب تم اس کے ظہور کو دیکھو،\nتو نگاہیں اسے نہیں پا سکتیں۔\nاس نے حداد سے کہا جب وہ آیا،\nاس کے سامنے حجاب اور پردے تھے۔\n\"میں کون ہوں؟\" تو اس نے کہا: \"ہمارا خالق،\nاور میری دلیل تجھ میں آثار (نشانیاں) ہیں۔\"\n\n### [یہ کہ محق (المحق) عالم میں استخلاف (خلافت) اور نیابت کے ذریعے ظہور ہے]\n\nجان لو کہ محق (المحق) عالم میں اس (ذات حق) کے ذریعے تمہارا ظہور ہے، جو اس کی طرف سے استخلاف (خلافت) اور نیابت کے طریقے پر ہے۔ پس تمہیں عالم میں تصرف (تحکم) حاصل ہوتا ہے۔ اور محق المحق (محق المحق) اس پر پردہ ڈالنے اور حجاب کے طریقے پر تمہارا ظہور ہے۔ پس تم محق المحق (محق المحق) میں اس (ذات حق) کو چھپاتے ہو، چنانچہ عالم کا شہود (الشہود) تم پر خلق (مخلوق) کے طور پر واقع ہوتا ہے نہ کہ حق (الحق) کے طور پر، کیونکہ وہ نہیں جانتے کہ اللہ نے تمہیں ان کے سامنے پردہ بنا کر بھیجا ہے تاکہ وہ اس (ذات حق) کی طرف نہ دیکھیں۔\n\nپس محق المحق (محق المحق) محق (المحق) کے مقابل ہے، یہ محق (المحق) میں مبالغہ نہیں ہے، بلکہ یہ عدم العدم (عدم کا عدم) کی مانند ہے۔ جب بندے کو حضرۃ الحق (ذات حق کی بارگاہ) سے خلق (مخلوق) کی طرف ان میں تحکیم (حکمرانی) کے طریقے پر بھیجا جاتا ہے، اس طرح کہ وہ شعور نہیں رکھتے، اور بعض اشخاص کے حق میں وہ شعور رکھ بھی سکتے ہیں، جیسے رسولوں (علیہم السلام) کے معاملے میں جنہیں اللہ نے زمین میں خلفاء بنایا تاکہ وہ ان تک اللہ کا حکم پہنچائیں، اور اس (خلافت) کو ورثاء میں پوشیدہ رکھا۔ پس وہ ایسے خلفاء ہیں جن کا شعور نہیں کیا جاتا۔ اور اس خلیفہ کے لیے، خواہ وہ مشعور ہو یا غیر مشعور، خلافت میں قیام کرنا ممکن نہیں جب تک کہ وہ قرآن کی سورتوں کے اوائل میں آنے والے حروف مقطعات (حروف اوائل السور المعجمة) کے معانی حاصل نہ کر لے، جیسے الم (الف لام میم) اور دیگر جو بعض قرآنی سورتوں کے شروع میں وارد ہوئے ہیں۔\n\nپس جب اللہ اسے ان (حروف) کی حقائق اور معانی پر مطلع کر دیتا ہے، تو اس کے لیے خلافت متعین ہو جاتی ہے اور وہ نیابت کا اہل ہو جاتا ہے۔ یہ اس کا ان حروف کے ظاہر کا علم ہے۔ اور جہاں تک ان کے باطن کے علم کا تعلق ہے، تو وہ اس درجے پر ان میں حق (الحق) کی طرف رجوع کرتا ہے، پس وہ اسم الباطن (پوشیدہ نام) سے لے کر ان کے اسرار اور معانی پر واقف ہوتا ہے یہاں تک کہ وہ ان کی انتہا کو پہنچ جاتا ہے۔ پس حق (الحق) اس کے ظہور کو نفس الامر میں خدمت کے طریقے پر حجاب میں رکھتا ہے۔ چنانچہ وہ اس قرب الٰہی کے باوجود خلق (مخلوق) کو حق (الحق) کے بغیر دیکھتا ہے، جیسا کہ عام لوگ ایک دوسرے کو دیکھتے ہیں۔ پس وہ اس وقت عالم میں اس چیز کے مطابق حکم کرتا ہے جو اس کی حقیقت کا تقاضا ہے، اس حیثیت سے کہ وہ اس مناسبت کی وجہ سے جو اس کے اور عالم کے درمیان ہے، ایک کونی نسخہ (Cosmic Copy) ہے۔ پس عالم اس قرب الٰہی کو نہیں جانتا۔ اور یہی وہ محق المحق (محق المحق) ہے جس تک رجال اللہ (اللہ کے بندے) پہنچتے ہیں۔\n\nپس وہ اللہ کا شہود (الشہود) اللہ کے ذریعے کرتا ہے، اور عالم کا شہود (الشہود) اپنی ذات کے ذریعے کرتا ہے نہ کہ اللہ کے ذریعے۔ اور وہ اس مقام میں حروف مقطعات میں سے خاص طور پر الف (ا) اور راء (ر) کے ذریعے متحقق ہوتا ہے، اس کے باوجود کہ وہ باقی حروف کا علم رکھتا ہے۔ مگر اس مقام میں حکم الف (ا) اور راء (ر) کا ہے، خواہ وہ سورتوں میں کہیں بھی واقع ہوں۔ اور جہاں تک اس مقام میں عالم پر اس کے حکم کا تعلق ہے، تو وہ باقی حروف یعنی لام (ل)، میم (م)، صاد (ص)، کاف (ک)، ہاء (ہ)، یاء (ی)، عین (ع)، طاء (ط)، سین (س)، حاء (ح)، قاف (ق)، اور نون (ن) سے ہوتا ہے۔ پس ان حروف کے ذریعے وہ عالم میں محق المحق (محق المحق) کے مقام میں ظاہر ہوتا ہے، اور الف (ا) اور راء (ر) کے ذریعے وہ محق (المحق) میں ظاہر ہوتا ہے۔ اور یہی وہ اولیاء ہیں جن کے بارے میں نبی صلی اللہ علیہ وسلم نے فرمایا: \"جب انہیں دیکھا جائے تو اللہ یاد آ جائے۔\" اور یہ اس لیے ہے کہ ان کا ان دو حروف کے ذریعے ظاہری صورت میں تجلی (التجلی) عین تجلی حق (الحق) ہے۔ پس جس نے انہیں دیکھا، اس نے حق (الحق) کو دیکھا۔ پس جب انہیں دیکھا جاتا ہے تو اللہ یاد آ جاتا ہے، کیونکہ وہ اس کی صفت کے ساتھ متحقق ہیں۔ پس وہ حق (الحق) کا مشاہدہ کرتے ہیں جب وہ ان کے لیے حق (الحق) کی صورت میں تجلی (التجلی) کرتا ہے۔ اور میں نے اسے اس تجلی (التجلی) میں دیکھا، اور میں نے اہل اللہ میں سے بہت سے لوگوں کو دیکھا جو اسے نہیں پہچانتے اور اس کا انکار کرتے ہیں۔ اور میں نے اس پر تعجب کیا یہاں تک کہ مجھے بتایا گیا کہ وہ اگرچہ اہل اللہ میں سے ہیں، اس حیثیت سے کہ وہ اللہ کے احکام پر عمل کرنے والے ہیں نہ کہ عالم (جاننے والے)، پس وہ اہل ایمان ہیں۔ اور چونکہ ان حروف میں سے الف (ا) کے مرتبے اور راء (ر) کے درمیان تین مراتب کا فرق ہے، اس لیے راء (ر) میں الف (ا) جتنی قوت نہیں ہے۔ کیونکہ الف (ا) نہ حرکت اٹھاتا ہے اور نہ اسے قبول کرتا ہے، جبکہ راء (ر) ایسا نہیں ہے۔\n\n### [یہ کہ محق المحق (محق المحق) اور محق (المحق) دنیا اور آخرت میں]\n\nاور جان لو کہ محق المحق (محق المحق) اہل اللہ کے نزدیک دنیا میں زیادہ کامل ہے، اور محق (المحق) آخرت میں زیادہ کامل ہے۔ اور محق المحق (محق المحق) صرف اخص اہل اللہ (اللہ کے خاص ترین بندے) ہی حاصل کرتے ہیں، اور یہ ان عقول کے لیے ہے جن کے ہیاکل (جسم) منور ہیں۔ اور محق (المحق) کو خواص (خصوص) حاصل کرتے ہیں، اور یہ ان نفوس کے لیے ہے جو منور ہیں۔ اللہ ہمیں ان لوگوں میں شامل کرے جس نے اپنے محق (المحق) کا محق (محق المحق) کیا، پس حق (الحق) اس کے ساتھ منفرد ہو گیا۔ اور اسی کو خلوۃ الحق (ذات حق کی خلوت) کہا جاتا ہے، کیونکہ اس کا نہ شہود (الشہود) ہوتا ہے اور نہ وہ دیکھا جاتا ہے، اور اگرچہ بعض لوگ اسے جان لیں، لیکن وہ ان کے لیے مشہود نہیں ہوتا۔\n\nاور اسی حقیقت سے اہل اللہ نے انفراد (تنہائی) کے لیے خلوت اختیار کی، جب انہوں نے دیکھا کہ اللہ تعالیٰ نے اسے اپنے بندے کے ساتھ انفراد کے لیے اختیار کیا ہے۔ اور اسی وجہ سے زمانے میں صرف ایک ہی شخص ہوتا ہے جسے غوث (الغوث) اور قطب (القطب) کہا جاتا ہے، اور وہ وہی ہے جس کے ساتھ حق (الحق) منفرد ہوتا ہے اور اپنی مخلوق کے علاوہ اس کے ساتھ خلوت اختیار کرتا ہے۔ پس جب وہ اپنے منور ہیکل (جسم) سے جدا ہوتا ہے، تو حق کسی دوسرے شخص کے ساتھ منفرد ہو جاتا ہے، اور ایک ہی وقت میں دو اشخاص کے ساتھ منفرد نہیں ہوتا۔ اور یہ خلوۃ الٰہیہ (الخلوة الإلهية) علم الاسرار (باطنی علوم) میں سے ہے جسے نہ پھیلایا جاتا ہے اور نہ افشاء کیا جاتا ہے۔ اور ہم نے اسے صرف اس لیے ذکر کیا اور نام دیا تاکہ ان دلوں کو متنبہ کریں جو اس سے غافل ہیں، بلکہ اس سے جاہل ہیں۔ کیونکہ میں نے اپنے سے پہلے کسی کو اسے ذکر کرتے ہوئے نہیں دیکھا اور نہ ہی یہ مجھ تک پہنچا، حالانکہ میں جانتا ہوں کہ خاص اہل اللہ اس سے واقف ہیں۔\n\nاور اس پر تنبیہ کے لیے قیامت کے دن، جہاں سب سے بڑا اجتماع ہو گا، ایک صحیح خبر وارد ہوئی ہے، جس میں بندے کا اپنے رب کے ساتھ تنہا انفراد (انفرادی ملاقات) ہو گا، پس وہ اس پر اپنا پردہ ڈالے گا اور اس کے اعمال کا اقرار کرائے گا، پھر اس سے فرمائے گا: \"میں نے دنیا میں تجھ پر پردہ ڈالا تھا اور میں یہاں بھی تجھ پر پردہ ڈالتا ہوں،\" پھر اسے جنت میں جانے کا حکم دے گا۔ پس اس نے اللہ کے ساتھ انفراد پر تنبیہ کی، اور ہم نے تمہیں بندے کے ساتھ انفراد الٰہی پر متنبہ کیا۔ اور وہ بندہ ہر زمانے میں عین اللہ (اللہ کی ذات) ہوتا ہے، حق (الحق) اپنے زمانے میں صرف اسی کی طرف دیکھتا ہے، اور وہی حجاب اعلیٰ (سب سے بڑا پردہ)، ستر ازہیٰ (سب سے زیادہ روشن پردہ)، اور قوام ابہیٰ (سب سے زیادہ شاندار قیام) ہے۔",
    "fa": "باب دویست و پنجاه و پنجم در معرفت محق (المحق) که همان فنای تو در عین اوست، و در معرفت محوِ محو (محق المحق) که همان ثبوت تو در عین اوست.\n\nفنای کائنات در اعیان، محق (محو) است *** و عین کائنات، حق (الحق) است و سپس خلق.\nاگر دلیلی بر وجود من اقامه شود *** محق (محو) به ذات کسی که آن را می‌جوید، قیام می‌کند.\nو من به آنچه هستی‌ام در بر دارد *** از اسماء حقیقت (الحقيقة)، در شقاق (جدایی) هستم.\n\nاین محق (المحق) است، و اما محوِ محو (محق المحق) این است:\n\nهمانا محوِ محو (محق المحق)، آشکار شدن است *** و آن در حقیقت، انذار (هشدار) است.\nپس چون طلعت او را ببینی *** در حالی که دیده‌ها او را درک نکرده‌اند.\nبه آهنگر گفت، هنگامی که آمد *** در حالی که حجاب‌ها و پرده‌ها در برابر او بودند:\n«من کیستم؟» گفت: «خالق ما *** و دلیل من در تو، آثار است.»\n\n### [اینکه محق (المحق) ظهور در کائنات از طریق استخلاف و نیابت است]\n\nبدان که محق (المحق)، ظهور تو در کائنات به واسطه او، از طریق استخلاف (جانشینی) و نیابت (نمایندگی) از اوست؛ پس تو در عالم حقِ تصرف داری. و محوِ محو (محق المحق)، ظهور تو از طریق پوشاندن و حجاب بر اوست. پس تو در محوِ محو (محق المحق)، او را محجوب می‌کنی، و در نتیجه، شهود کائنات بر تو به صورت خلقِ بدون حق (الحق) واقع می‌شود، زیرا آنان نمی‌دانند که خداوند تو را به عنوان پوششی در برابر ایشان فرستاده تا به او نظر نکنند. پس محوِ محو (محق المحق) در مقابل محق (المحق) قرار می‌گیرد و مبالغه در محق (المحق) نیست، بلکه مانند عدمِ عدم است. پس هرگاه بنده در خروجش از حضرت حق (الحق) به سوی خلق، از طریق حکم راندن بر آنان، در حالی که ایشان آگاه نیستند، اقامه شود (و گاهی در حق برخی اشخاص از این نوع، مانند پیامبران علیهم السلام که خداوند آنان را خلفای خود در زمین قرار داد تا حکم خدا را به ایشان برسانند، آگاه می‌شوند)، و خداوند این امر را در ورثه پنهان داشته است؛ پس آنان خلفایی هستند که کسی از وجودشان آگاه نمی‌شود. و این خلیفه، چه شناخته شده باشد و چه ناشناخته، نمی‌تواند در خلافت قیام کند مگر پس از آنکه معانی حروف اوائل سوره‌های قرآن (الحروف المعجمة) مانند «الم» (الف لام میم) و غیر آن که در اوائل برخی سوره‌های قرآن آمده است، برای او حاصل شود. پس هرگاه خداوند او را بر حقایق و معانی این حروف آگاه سازد، خلافت برای او معین می‌شود و شایسته نیابت می‌گردد. این در مورد علم او به ظاهر این حروف است. اما علم او به باطن آنها، بر اساس همان درجه، به حق (الحق) باز می‌گردد و بر اسرار و معانی آنها از اسم باطن (الاسم الباطن) آگاه می‌شود تا به غایت آن برسد. در این حالت، حق (الحق) ظهور او را از طریق خدمت در نفس‌الامر محجوب می‌سازد، و او با وجود این قرب الهی، به صورت خلقِ بدون حق (الحق) دیده می‌شود، همان‌گونه که عوام یکدیگر را می‌بینند. پس در آن هنگام، در عالم به مقتضای حقیقت خود حکم می‌کند، به گونه‌ای که نسخه‌ای کونی (کونیة) برای مناسبتی است که میان او و عالم وجود دارد، پس عالم این قرب الهی را نمی‌داند. و این همان محوِ محو (محق المحق) است که مردان خدا به آن می‌رسند. پس او خدا را به واسطه خدا شهود می‌کند و کائنات را به واسطه خود، نه به واسطه خدا، شهود می‌کند. و در این مقام، به طور خاص به حروف «الف» و «راء» از حروف اوائل سوره‌های معجمه (الحروف المعجمة) متحقق می‌شود، با وجود علمش به بقیه حروف؛ جز اینکه حکم در این مقام، هر جا که در سوره‌ها واقع شوند، برای «الف» و «راء» است. و اما حکم او در عالم در این مقام، از باقی این حروف است: «لام»، «میم»، «صاد»، «کاف»، «هاء»، «یاء»، «عین»، «طاء»، «سین»، «حاء»، «قاف» و «نون». پس به واسطه این حروف در عالم در مقام محوِ محو (محق المحق) ظاهر می‌شود، و به واسطه «الف» و «راء» در محق (المحق) ظاهر می‌شود. و آنان همان اولیایی هستند که پیامبر (صلی الله علیه و سلم) درباره‌شان فرمود: «هرگاه دیده شوند، خدا یاد می‌شود.» و این بدان سبب است که عین تجلی (التجلی) ایشان به واسطه این دو حرف در صورت ظاهر، عین تجلی حق (الحق) است. پس هر کس آنان را ببیند، حق (الحق) را دیده است. بنابراین، آنان هرگاه دیده شوند، خدا یاد می‌شود، به دلیل تحققشان به صفت او. پس آنان حق (الحق) را در او مشاهده می‌کنند، هنگامی که در صورت حق (الحق) بر ایشان تجلی کند. و من او را در این تجلی دیدم و بسیاری از اهل الله را دیدم که او را نمی‌شناسند و انکار می‌کنند، و از این امر تعجب کردم تا اینکه به من آگاهی داده شد که آنان اگرچه از اهل الله هستند، اما از آن جهت که عامل به اوامر خدایند نه عالم، پس اهل ایمان هستند. و چون میان رتبه «الف» از این حروف و «راء»، سه مرتبه فاصله است، از این رو «راء» به قوت «الف» نرسیده است؛ زیرا «الف» حرکت را حمل نمی‌کند و نمی‌پذیرد، در حالی که «راء» چنین نیست.\n\n### [اینکه محوِ محو (محق المحق) و محق (المحق) در دنیا و آخرت]\n\nو بدان که محوِ محو (محق المحق) نزد اهل الله در دنیا کامل‌تر است و محق (المحق) در آخرت کامل‌تر است. و به محوِ محو (محق المحق) جز خاص‌ترین اهل الله فائز نمی‌شود، و آن برای عقولی است که هیکل‌هایشان نورانی شده است. و به محق (المحق)، خواص فائز می‌شوند، و آن برای نفوسی است که نورانی شده‌اند. خداوند ما را از کسانی قرار دهد که محوِ محو (محق المحق) او را محو کرده و حق (الحق) به واسطه او منفرد شده است. و این همان است که خلوت حق (خلوة الحق) نامیده می‌شود، زیرا او نه شهود می‌شود و نه دیده می‌شود، و اگرچه برخی مردم او را بشناسند، اما برای او شهودی حاصل نمی‌شود. و از این حقیقت است که اهل الله خلوت را برای انفراد برگزیدند، زیرا دیدند که خداوند متعال آن را برای انفراد با بنده خود برگزیده است. و به همین دلیل، در هر زمان جز یک نفر که غوث و قطب نامیده می‌شود، وجود ندارد، و او کسی است که حق (الحق) به واسطه او منفرد می‌شود و با او خلوت می‌کند، نه با دیگر خلقش. پس هرگاه از هیکل نورانی خود جدا شود، حق (الحق) با شخص دیگری منفرد می‌شود و در یک زمان با بیش از یک شخص منفرد نمی‌شود. و این خلوت الهی از علم اسراری است که فاش و منتشر نمی‌شود. و ما آن را ذکر نکردیم و نام نبردیم مگر برای تنبیه قلب‌های غافلان از آن، بلکه جاهلان به آن؛ زیرا من ندیدم کسی پیش از من آن را ذکر کرده باشد و به من نیز نرسیده است، با وجود علمم به اینکه خاصان اهل الله به آن آگاهند. و خبر صحیحی در تنبیه بر این امر در روز قیامت، در جمع بزرگ‌تر، وارد شده است، در انفراد بنده با پروردگارش به تنهایی، که خداوند پرده خود را بر او می‌اندازد و او را بر آنچه از او سر زده است، اقرار می‌گیرد، سپس به او می‌گوید: «من آن را در دنیا بر تو پوشاندم و اکنون نیز آن را بر تو می‌پوشانم.» سپس فرمان می‌دهد که او را به بهشت ببرند. پس بر انفراد با خدا تنبیه شده است، و ما تو را بر انفراد الهی با بنده تنبیه کردیم. و آن بنده، عین الله در هر زمان است و حق (الحق) در زمان او جز به او نظر نمی‌کند، و او حجاب اعلی، و ستر درخشان‌تر، و قوام زیباتر است."
  },
  "page_count": 2
}