{
  "id": 139,
  "title": {
    "ar": "الباب التاسع والثلاثون ومائة في معرفة مقام ترك الحياء",
    "en": "Chapter One Hundred and Thirty-Nine: Concerning the Knowledge (معرفة) of the Spiritual Station (مقام) of Abandoning Modesty (الحياء)",
    "ur": "ایک سو انتالیسواں باب: مقام ترک الحیاء (ترک حیاء) کی معرفت میں",
    "fa": "باب صد و سی و نهم در معرفت مقام ترک حیا"
  },
  "content": {
    "ar": "## (الباب التاسع والثلاثون ومائة في معرفة مقام ترك الحياء)\n\n\n> ترك الحياء تحقق وتخلق *** جاءت به الآيات في القرآن‏\n\n\n> فله النفاسة والنزاهة عندنا *** إذ لا تخاف بمنزل العدوان‏\n\n\n> هذي هي الدنيا وأنت إمامها *** وعبيدها بالنقص والرجحان‏\n\n\n> فإذا فهمت الأمر يا هذا فكن *** مثل اللسان بقية الميزان‏\n\n\n> لا تعدلن إلى الشمال فإنه *** نقص ومل طلبا إلى الايمان‏\n\n\n> فهو الكمال لمن تحقق حالة *** الإسلام والايمان والإحسان‏\n\n\n### [الحياء للتفرقة وترك الحياء لأحدية الجمع‏]\n\n\nترك الحياء في موطنه نعت إلهي قال الله تعالى إِنَّ الله لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا ما وسبب ذلك من وجهين إما أن يكون ما في الوجود إلا الله فالوجود كله عظيم فلا يترك منه شي‏ء لأن الحياء ترك فهو نعت سلبي وترك الترك تحصيل فهو نعت ثبوتي فلا إله نعت سلبي وإلا الله نعت ثبوتي فما جئنا بالسلب إلا من أجل الإثبات فما جئنا بالحياء إلا من أجل تركه فإن الحياء للتفرقة وترك الحياء لاحدية الجمع لا للجمع هذا هو الوجه الواحد\n\n\n### [لا مفاضلة في هذه الأعيان إلا بما تنتسب إليه‏]\n\n\nوإما أن يكون في الوجود أعيان‏\nالممكنات التي لا قيام لها إلا بالله فينبغي إن لا يترك شي‏ء منها لارتباط كل شي‏ء منها بحقيقة إلهية هي تحفظه وقد ثبت أن الممكنات لا تتناهى فالحقائق والنسب الإلهية لا نهاية لها ولا يصح أن يكون في الإلهيات تفاضل لأن الشي‏ء لا يفضل نفسه ولا مفاضلة في هذه الأعيان إلا بما تنتسب إليه لأنه لا فضل لها من ذاتها ولا مفاضلة هناك فلا مفاضلة هنا فكما هو الأول هو الآخر كذلك العقل الأول الجماد وكما هو الظاهر هو الباطن كذلك عالم الغيب والشهادة\n\n\n### [من حقيقته عدم فالوجود له معار]\n\n\nفما ثم تافه ولا حقير فإن الكل شعائر الله ومن يُعَظِّمْ شَعائِرَ الله فَإِنَّها من تَقْوَى الْقُلُوبِ لَكُمْ فِيها مَنافِعُ إِلى‏ أَجَلٍ مُسَمًّى زمان نظركم في نفوسكم بها والأجل المسمى هو أن يكشف لكم عنكم إنكم ما هم أنتم إذ من حقيقته عدم الوجود فالوجود له معار فإذا تبين لكم إنكم ما هم أنتم وهو الأجل المسمى كان محلها وهو مَحِلُّها إِلَى الْبَيْتِ الْعَتِيقِ وهو القديم الذي لا يقبل الحدوث فرأيتم إن الصفة تطلب موصوفها فزلتم أنتم من كونكم شعائر الله وصار الحق دليلا على نفسه إذ كان من المحال أن يدل شي‏ء على شي‏ء دلالة علم محقق فلا أدل من الشي‏ء على نفسه ولهذا إذا حددت الأمر الظاهر ترده غامضا ولهذا لا تطلب حدود الأمور الظاهرة كمن يطلب حد النهار وهو فيه وهو أوضح الأشياء لا يقدر أن يجهله‏\n\n\n### [قف عند ما قال لك الشارع عنه قف فذلك هو الأدب الإلهي‏]\n\n\nوإذا كان الأمر كما ذكرنا فلا يستحي فلا حياء ولا حكم له بل يضرب الأمثال ويقيم الأشكال ويعلم لمن يخاطب ومن يفهم عنه ممن لا يفهم ولكل فهم فلو وجد عند السامع ما هو أخفى من البعوضة لجاء بها كما قد جاء بذلك مجملا بقوله فَما فَوْقَها فأمرك وعلمك في هذه الآية أن لا تترك شيئا إلا وتنسبه إلى الله ولا يمنعك حقارة ذلك الشي‏ء ولا ما تعلق به من الذم عرفا وشرعا في عقدك ثم تقف عند الإطلاق فلا تطلق ما في العقد على كل شي‏ء ولا في كل حال وقف عند ما قال لك الشارع قف عنده فإن ذلك هو الأدب الإلهي الذي جاء به الشرع والأدب جماع الخير وفي إيراد الألفاظ يستعمل الحياء لأنك تترك بعضها كما أمرت وفي العقد لا تترك شيئا لا تنسبه إلى الله وهو مقام ترك الحياء فعامل الله تعالى بحسب المواطن كما رسم لك ولا تنازع وقُلْ رَبِّ زِدْنِي عِلْماً فإنك إذا قلت ذلك لم تزل في مزيد جانيا ثمرة الوجوب‏\n\n",
    "en": "## Chapter 139: Concerning the Knowledge of the Station of Abandoning Shame\n\n> Abandoning shame is a realization (تحقق) and an ethical characterization (تخلق),\n> The verses in the Qur'an brought it forth.\n> Thus, it possesses preciousness and purity in our view,\n> Since you do not fear in the station of transgression.\n> This is the world, and you are its leader (Imam),\n> And its servants are characterized by deficiency and superiority.\n> So if you understand the matter, O seeker, then be\n> Like the tongue (pointer) of the balance (Mizan).\n> Do not incline toward the left, for that is\n> Deficiency; rather, incline seeking toward faith (الإيمان).\n> For it is perfection for the one who realizes the state of\n> Submission (الإسلام), Faith (الإيمان), and Excellence (الإحسان).\n\n### [Shame is for Distinction, and Abandoning Shame is for the Oneness of Gathering]\n\nAbandoning shame (ترك الحياء) in its proper station is a Divine Attribute (نعت إلهي). Allah the Exalted said: <<إِنَّ الله لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا ما>> (Indeed, Allah is not ashamed to present an example of [even] a mosquito or what is smaller than it).\n\nThe reason for this stems from two aspects:\n\nFirst, that there is nothing in Existence (الوجود) except Allah. Thus, all Existence is magnificent, and nothing within it is abandoned. Because shame (الحياء) is abandonment (ترك), it is a negative attribute (نعت سلبي). Abandoning abandonment (ترك الترك) is acquisition (تحصيل), making it an affirmative attribute (نعت ثبوتي). Thus, *lā ilāha* (there is no god) is a negative attribute, and *illā Allāh* (except Allah) is an affirmative attribute. We only employ the negation (السلب) for the sake of the affirmation (الإثبات). Similarly, we only mention shame for the sake of abandoning it, for shame is for distinction (تفرقة), while abandoning shame is for the Oneness of Gathering (أحدية الجمع), not merely for the Gathering (الجمع). This is the first aspect.\n\n### [There is No Preference Among These Entities Except by What They Are Related To]\n\nThe second aspect is that there are in Existence the entities (أعيان) of the possibles (الممكنات) which have no subsistence except through Allah. Therefore, nothing of them should be abandoned, due to the connection of every single thing to a Divine Reality (حقيقة إلهية) that preserves it. It has been established that the possibles are endless; thus, the Divine Realities (الحقائق) and relations (النسب) are without limit.\n\nIt is not sound for there to be preference (تفاضل) among the Divine Matters (الإلهيات), because a thing does not prefer itself. And there is no preference among these entities (الأعيان) except by virtue of what they are related to, because they possess no merit from their own essence (ذاتها). Since there is no preference there [in the Divine], there is no preference here [in creation]. Just as He is the First (الأول), He is the Last (الآخر)—similarly, the First Intellect (العقل الأول) and the inanimate (الجماد). And just as He is the Manifest (الظاهر), He is the Hidden (الباطن)—similarly, the world of the Unseen (عالم الغيب) and the witnessed (الشهادة).\n\n### [He Whose Reality is Non-Existence, Existence is Borrowed for Him]\n\nTherefore, there is nothing trivial (تافه) or contemptible (حقير), for all things are the symbols (شعائر) of Allah. <<وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ>> (And whoever honors the symbols of Allah—indeed, it is from the piety of the hearts). <<لَكُمْ فِيهَا مَنَافِعُ إِلَىٰ أَجَلٍ مُّسَمًّى>> (For you therein are benefits for a specified term)—this is the time of your contemplation of yourselves through them.\n\nThe specified term (الأجل المسمى) is when it is unveiled to you concerning yourselves that you are not truly yourselves. Since he whose reality (حقيقته) is non-existence (عدم), Existence (الوجود) is borrowed (معار) for him. When it becomes clear to you that you are not yourselves—and that is the specified term—its place was, and it is <<مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ>> (its place of sacrifice is the Ancient House). This Ancient House is the Eternal (القديم) which does not accept origination (الحدوث). Thus, you see that the attribute (الصفة) seeks its qualified (موصوفها). So you vanished from being the symbols of Allah, and The Real (الحق) became the proof for Himself. Since it is impossible for one thing to indicate another thing with the indication of verified knowledge (علم محقق), nothing is a better indicator than the thing upon itself. For this reason, if you attempt to define a manifest matter, you will find it obscure. Therefore, do not seek the definitions (حدود) of manifest matters, like one who seeks the definition of the day while being immersed in it. It is the clearest of things, and he cannot possibly be ignorant of it.\n\n### [Stop Where the Lawgiver Told You to Stop, For That is the Divine Etiquette]\n\nIf the matter is as we have mentioned, then He (The Real) is not ashamed (لا يستحي). Thus, there is no shame (حياء) and no ruling (حكم) for it. Rather, He presents examples (الأمثال) and establishes forms (الأشكال). He knows whom He addresses and who understands from Him, distinguishing them from those who do not understand, and He provides for every understanding. If He found something with the listener that was more subtle than the mosquito, He would bring it forth, just as He brought that summarily with His saying: <<فَمَا فَوْقَهَا>> (or what is greater than it).\n\nYour command and your knowledge (العلم) contained in this verse is that you must not abandon anything without attributing it to Allah. Let neither the contemptibility (حقارة) of that thing nor the blame attached to it—whether customary or legal—prevent you from holding this conviction (عقدك). Then you stop at the absolute (الإطلاق). Do not apply what is held in your conviction to everything or in every state. Stop where the Lawgiver (الشارع) told you to stop, for that is the Divine Etiquette (الأدب الإلهي) brought by the Sacred Law (الشرع).\n\nEtiquette (الأدب) is the sum of all goodness. In the utterance of words (إيراد الألفاظ), shame is employed because you abandon some words as you have been commanded. But in conviction (العقد), you abandon nothing without attributing it to Allah, and that is the station of abandoning shame (مقام ترك الحياء).\n\nTherefore, deal with Allah the Exalted according to the stations (المواطن) as He has prescribed for you, and do not dispute. And say: <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge). For if you say that, you will continuously be in increase, reaping the fruit of the Necessary Reality (الواجب).",
    "ur": "## باب ایک سو انتالیس: ترک حیاء (شرم چھوڑنے) کے مقام کی معرفت میں\n\n> ترک حیاء (شرم چھوڑنا) تحقق اور تخلق ہے،\n> جس کا ذکر قرآن کی آیات میں آیا ہے۔\n> لہٰذا، ہمارے نزدیک اس کے لیے نفیس پن اور پاکیزگی ہے،\n> کیونکہ اس میں ظلم و زیادتی کے مقام کا کوئی خوف نہیں۔\n> یہ دنیا ہے اور تم اس کے امام ہو،\n> اور اس کے غلام کمی اور زیادتی (نقص و رجحان) میں ہیں۔\n> اے مخاطب! اگر تم نے اس امر کو سمجھ لیا، تو ہو جاؤ\n> ترازو کی باقی ماندہ زبان کی مانند۔\n> بائیں طرف مائل نہ ہونا، کیونکہ وہ کمی ہے،\n> اور ایمان کی طلب کی طرف جھک جاؤ۔\n> پس یہ اس شخص کے لیے کمال ہے جس نے\n> اسلام، ایمان اور احسان کی حالت کو حاصل کر لیا۔\n\n### [حیاء تفرقہ کے لیے ہے اور ترک حیاء جمع کی احدیت کے لیے]\n\nترک حیاء (شرم چھوڑنا) اپنے مقام پر ایک صفت الٰہی (نعت إلهي) ہے۔ اللہ تعالیٰ فرماتا ہے: إِنَّ الله لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا ما (بیشک اللہ اس بات سے حیا نہیں کرتا کہ وہ کوئی بھی مثال بیان کرے)۔ اس کی وجہ دو پہلوؤں سے ہے: یا تو یہ کہ الوجود (ہستی) میں اللہ کے سوا کچھ نہیں، لہٰذا تمام الوجود (ہستی) عظیم ہے، اور اس میں سے کسی چیز کو ترک نہیں کیا جاتا، کیونکہ حیاء (شرم) ترک کرنا ہے، پس یہ ایک صفت سلبی (نعت سلبي) ہے۔ اور ترک کو ترک کرنا حصول ہے، پس یہ ایک صفت ثبوتی (نعت ثبوتي) ہے۔ پس \"لا إله\" (کوئی معبود نہیں) صفت سلبی ہے، اور \"إلا الله\" (سوائے اللہ کے) صفت ثبوتی ہے۔ ہم نے سلب کو صرف اثبات کی خاطر لایا، اور ہم نے حیاء کو صرف اس کے ترک کی خاطر لایا۔ کیونکہ حیاء تفرقہ (تفرقة) کے لیے ہے، اور ترک حیاء جمع کی احدیت (أحدية الجمع) کے لیے ہے، نہ کہ صرف جمع کے لیے۔ یہ پہلا پہلو ہے۔\n\n### [ان اعیان میں کوئی تفاضل نہیں مگر اس نسبت کی وجہ سے جس سے وہ جڑے ہوئے ہیں]\n\nاور دوسرا پہلو یہ ہے کہ الوجود (ہستی) میں ممکنات کے اعیان (أعيان الممكنات) موجود ہیں جن کا قیام اللہ کے بغیر ممکن نہیں۔ لہٰذا ان میں سے کسی چیز کو بھی ترک نہیں کرنا چاہیے، کیونکہ ان میں سے ہر چیز ایک الٰہی حقیقت (حقيقة إلهية) سے جڑی ہوئی ہے جو اس کی حفاظت کرتی ہے۔ یہ ثابت ہو چکا ہے کہ ممکنات لامتناہی ہیں، لہٰذا حقائق اور الٰہی نسبتیں (النسب الإلهية) بھی لامتناہی ہیں۔ اور الٰہیات میں تفاضل (برتری) درست نہیں، کیونکہ کوئی چیز خود کو فضیلت نہیں دے سکتی۔ اور ان اعیان میں بھی کوئی تفاضل نہیں مگر اس نسبت کی وجہ سے جس سے وہ جڑے ہوئے ہیں، کیونکہ ان کی اپنی ذات سے کوئی فضیلت نہیں ہے۔ اور جب وہاں (الٰہیات میں) کوئی تفاضل نہیں، تو یہاں بھی کوئی تفاضل نہیں۔ پس جس طرح وہ (الحق) اول ہے، اسی طرح وہ آخر ہے، اور اسی طرح عقل اول اور جمادات ہیں۔ اور جس طرح وہ ظاہر ہے، اسی طرح وہ باطن ہے، اور اسی طرح عالم غیب اور عالم شہادت ہیں۔\n\n### [جس کی حقیقت عدم ہے، اس کے لیے وجود عارضی ہے]\n\nپس وہاں کوئی حقیر یا بے وقعت چیز نہیں، کیونکہ سب اللہ کی نشانیاں (شعائر الله) ہیں۔ اور جو کوئی اللہ کی نشانیوں کی تعظیم کرے، فَإِنَّها من تَقْوَى الْقُلُوبِ (تو یہ دلوں کے تقویٰ سے ہے)۔ لَكُمْ فِيها مَنافِعُ إِلى‏ أَجَلٍ مُسَمًّى (تمہارے لیے ان میں ایک مقررہ مدت تک فائدے ہیں)۔ یہ وہ وقت ہے جب تم ان کے ذریعے اپنے نفوس میں غور و فکر کرتے ہو۔ اور الأجل المسمى (مقررہ مدت) یہ ہے کہ تم پر تمہاری حقیقت منکشف ہو جائے کہ تم وہ نہیں ہو جو تم سمجھتے ہو، کیونکہ جس کی حقیقت عدم ہے، اس کے لیے الوجود (ہستی) عارضی (معار) ہے۔ پس جب تم پر یہ واضح ہو جائے کہ تم وہ نہیں ہو جو تم ہو، اور یہی الأجل المسمى ہے، تو ان کا ٹھکانہ، جو کہ مَحِلُّها إِلَى الْبَيْتِ الْعَتِيقِ (ان کا ٹھکانہ بیت عتیق تک ہے)، یعنی وہ قدیم جو حدوث کو قبول نہیں کرتا، ہو گا۔ پس تم دیکھو گے کہ صفت اپنے موصوف کو طلب کر رہی ہے۔ چنانچہ تم اللہ کی نشانیوں (شعائر الله) ہونے کی حیثیت سے زائل ہو جاؤ گے، اور الحق (ذات حق) خود اپنی دلیل بن جائے گا، کیونکہ یہ محال ہے کہ کوئی چیز کسی دوسری چیز پر علم محقق کی دلالت کرے۔ پس کوئی چیز خود اپنی ذات سے بڑھ کر دلیل نہیں ہو سکتی۔ اسی لیے جب تم کسی ظاہری امر کی تعریف (حد) بیان کرتے ہو تو وہ تمہیں مبہم نظر آتا ہے۔ اور اسی لیے ظاہری امور کی حدود طلب نہیں کی جاتیں، جیسے کوئی شخص دن کی حد طلب کرے حالانکہ وہ دن میں موجود ہے، اور وہ سب سے زیادہ واضح چیز ہے جسے وہ نظر انداز نہیں کر سکتا۔\n\n### [جہاں شارع نے تمہیں رکنے کا حکم دیا ہے، وہیں رک جاؤ، کیونکہ یہی ادب الٰہی ہے]\n\nاور جب معاملہ ایسا ہے جیسا کہ ہم نے ذکر کیا، تو وہ (الحق) حیاء نہیں کرتا، پس نہ کوئی حیاء ہے اور نہ اس کا کوئی حکم ہے۔ بلکہ وہ مثالیں بیان کرتا ہے، اشکال قائم کرتا ہے، اور جانتا ہے کہ وہ کس سے مخاطب ہے، اور کون اس سے سمجھتا ہے اور کون نہیں سمجھتا۔ اور ہر ایک کے لیے ایک فہم ہے۔ اگر سننے والے کے پاس کوئی ایسی چیز ہوتی جو مچھر سے بھی زیادہ چھوٹی ہوتی، تو وہ اسے بھی بیان کرتا، جیسا کہ اس نے اجمالی طور پر اپنے قول فَما فَوْقَها (تو جو اس سے اوپر ہے) میں بیان کیا ہے۔ پس اس آیت میں تمہارا حکم اور تمہارا علم یہ ہے کہ تم کسی چیز کو بھی ترک نہ کرو مگر یہ کہ اسے اللہ سے منسوب کرو۔ اور اس چیز کی حقارت یا اس سے متعلق عرفی یا شرعی مذمت تمہارے عقیدے میں تمہیں اس سے نہ روکے۔ پھر تم اطلاق پر ٹھہر جاؤ، اور جو تمہارے عقیدے میں ہے اسے ہر چیز پر اور ہر حال میں مطلق نہ کرو۔ اور جہاں شارع (شریعت لانے والے) نے تمہیں رکنے کا حکم دیا ہے، وہیں رک جاؤ، کیونکہ یہی وہ ادب الٰہی (الأدب الإلهي) ہے جو شریعت لائی ہے۔ اور ادب تمام بھلائیوں کا مجموعہ ہے۔ الفاظ کے بیان میں حیاء استعمال کیا جاتا ہے، کیونکہ تم بعض الفاظ کو ترک کرتے ہو جیسا کہ تمہیں حکم دیا گیا ہے۔ لیکن عقیدے میں، تم کسی چیز کو ترک نہیں کرتے جسے اللہ سے منسوب نہ کرو، اور یہی ترک حیاء (شرم چھوڑنے) کا مقام ہے۔ پس اللہ تعالیٰ کے ساتھ مقامات (المواطن) کے مطابق معاملہ کرو جیسا کہ تمہارے لیے مقرر کیا گیا ہے، اور جھگڑا نہ کرو، اور قُلْ رَبِّ زِدْنِي عِلْماً (کہو: اے میرے رب! میرے علم میں اضافہ فرما)۔ کیونکہ جب تم یہ کہو گے تو تم ہمیشہ اضافے میں رہو گے اور وجوب (الزامی حقیقت) کا پھل حاصل کرتے رہو گے۔",
    "fa": "## باب صد و سی و نهم در معرفت مقام ترک حیاء\n\nترک حیاء، تحقق و تخلق است، که آیات آن در قرآن آمده است.\nپس نزد ما، نفیس و پاک است، زیرا در جایگاه تجاوز (عدوان) ترسی نیست.\nاین است دنیا و تو امام آنی، و بندگانش با نقص و رجحان (برتری) هستند.\nای دوست، اگر این امر را فهمیدی، مانند زبانه‌ی باقی‌مانده‌ی ترازو باش.\nبه سوی چپ متمایل مشو که آن نقص است، و به طلب ایمان متمایل شو.\nپس آن (ترک حیاء) کمال است برای کسی که به حالت اسلام و ایمان و احسان تحقق یافته است.\n\n### [حیاء برای تفرقه و ترک حیاء برای احدیت جمع]\n\nترک حیاء در جایگاه خود، صفتی الهی است. خداوند متعال می‌فرماید: إِنَّ الله لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا ما (همانا خداوند شرم نمی‌کند که مثلی بزند).\n\nسبب این امر از دو وجه است: یا اینکه در هستی (الوجود) جز خدا نیست، پس تمام هستی (الوجود) عظیم است و چیزی از آن ترک نمی‌شود، زیرا حیاء ترک کردن است و صفتی سلبی (نعت سلبی) است، و ترکِ ترک، تحصیل است و صفتی ثبوتی (نعت ثبوتی) است. پس «لا إله» صفتی سلبی است و «إلا الله» صفتی ثبوتی است. ما سلب را نیاوردیم مگر به خاطر اثبات، و حیاء را نیاوردیم مگر به خاطر ترک آن. زیرا حیاء برای تفرقه (جدایی) است و ترک حیاء برای احدیت جمع (أحدية الجمع) است، نه صرفاً برای جمع. این یک وجه است.\n\n### [در این اعیان (ذوات) هیچ برتری نیست مگر به آنچه بدان منسوب می‌شوند]\n\nو وجه دیگر آن است که در هستی (الوجود)، اعیان (ذوات) ممکنات وجود دارند که قیامشان جز به خدا نیست. پس شایسته است که هیچ‌یک از آن‌ها ترک نشود، زیرا هر چیزی از آن‌ها به حقیقتی الهی مرتبط است که آن را حفظ می‌کند. و ثابت شده است که ممکنات نامتناهی هستند، پس حقایق و نسبت‌های الهی نیز بی‌نهایت‌اند. و روا نیست که در الهیات تفاضل (برتری) باشد، زیرا شیء خود را بر خود برتری نمی‌دهد. و در این اعیان (الأعيان) نیز تفاضلی نیست مگر به آنچه بدان منسوب می‌شوند، زیرا از ذات خود فضلی ندارند. و چون در آنجا (در حق) تفاضلی نیست، پس در اینجا نیز تفاضلی نیست. همان‌گونه که او اول است، آخر نیز هست؛ همچنین عقل اول و جماد. و همان‌گونه که او ظاهر است، باطن نیز هست؛ همچنین عالم غیب و شهادت.\n\n### [کسی که حقیقتش عدم است، هستی برای او عاریه است]\n\nپس در آنجا نه چیز بی‌ارزشی است و نه حقیر، زیرا همه شعائر الله (نشانه‌های خداوند) هستند. و مَنْ يُعَظِّمْ شَعائِرَ الله فَإِنَّها من تَقْوَى الْقُلُوبِ (و هر کس شعائر خدا را بزرگ دارد، این از پرهیزگاری دل‌هاست). لَكُمْ فِيها مَنافِعُ إِلى‏ أَجَلٍ مُسَمًّى (برای شما در آن‌ها منافعی است تا زمانی معین). (این زمان معین) زمان نظر کردن شما در نفوس خودتان به واسطه‌ی آن‌هاست. و اجل مسمی (زمان معین) آن است که برای شما کشف شود که شما، خودتان نیستید؛ زیرا کسی که حقیقتش عدم است، هستی (الوجود) برای او عاریه است. پس هنگامی که برای شما روشن شد که شما، خودتان نیستید، و این همان اجل مسمی است، جایگاه آن (شعائر) که مَحِلُّها إِلَى الْبَيْتِ الْعَتِيقِ (جایگاه قربانی‌ها به سوی خانه کهن است) خواهد بود. و آن (بیت عتیق) همان قدیم است که حدوث را نمی‌پذیرد. پس می‌بینید که صفت، موصوف خود را می‌طلبد. در نتیجه، شما از اینکه شعائر الله باشید، زائل می‌شوید و حق (الحق) خود، دلیل بر خویشتن می‌گردد. زیرا محال بود که چیزی بر چیزی دلالت کند، دلالتی که علم محقق باشد. پس هیچ دلیلی قوی‌تر از دلالت شیء بر خودش نیست. و به همین دلیل، اگر امر ظاهر را تعریف کنی، آن را مبهم می‌یابی. و از این رو، حدود امور ظاهری طلب نمی‌شود، مانند کسی که حد روز را می‌طلبد در حالی که در آن است و آن روشن‌ترین چیزهاست و نمی‌تواند آن را نادیده بگیرد.\n\n### [در جایی که شارع به تو گفت بایست، بایست؛ زیرا آن همان ادب الهی است]\n\nو چون امر چنان است که ذکر کردیم، پس حیاء نمی‌کند، نه حیایی هست و نه حکمی برای آن. بلکه امثال می‌زند و اشکال برپا می‌کند و می‌داند که با چه کسی سخن می‌گوید و چه کسی از او می‌فهمد و چه کسی نمی‌فهمد، و برای هر فهمی (مثالی) هست. اگر نزد شنونده چیزی یافت می‌شد که از پشه نیز پنهان‌تر بود، آن را می‌آورد، چنانکه به طور اجمالی با این سخن آورده است: فَما فَوْقَها (و آنچه بالاتر از آن است). پس امر و علم تو در این آیه آن است که هیچ چیزی را ترک نکنی مگر اینکه آن را به خدا نسبت دهی. و حقارت آن شیء یا آنچه از نظر عرف و شرع در عقیده‌ی تو به ذم (نکوهش) آن تعلق گرفته است، تو را باز ندارد. سپس در اطلاق توقف کن؛ آنچه در عقیده داری را بر هر چیزی و در هر حالی اطلاق مکن. در جایی که شارع به تو گفت بایست، بایست؛ زیرا آن همان ادب الهی است که شرع آن را آورده است. و ادب، جامع خیر است. در بیان الفاظ، حیاء به کار می‌رود، زیرا برخی از آن‌ها را ترک می‌کنی، چنانکه امر شده‌ای. اما در عقیده، هیچ چیزی را ترک نمی‌کنی که آن را به خدا نسبت ندهی، و این همان مقام ترک حیاء است. پس با خداوند متعال بر حسب مواطن (جایگاه‌ها) چنانکه برایت ترسیم شده است، معامله کن و نزاع مکن. و بگو: قُلْ رَبِّ زِدْنِي عِلْماً (بگو پروردگارا، علم مرا زیاد کن). زیرا اگر چنین گویی، همواره در فزونی خواهی بود و ثمره‌ی وجوب را خواهی چید."
  },
  "page_count": 2
}