{
  "id": 499,
  "title": {
    "ar": "الباب التاسع والتسعون وأربعمائة في معرفة حال قطب كان منزله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وقتا على زيادة الكاف ووقتا على كونها صفة لفرض المثل وهو مذهبنا والحمد لله",
    "en": "Chapter Four Hundred and Ninety-Nine: Concerning the knowledge of the state of a Pole (قطب) whose station was [the verse] <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), sometimes based on the superfluity (زيادة) of the *kāf*, and sometimes based on its being an attribute (صفة) for the supposition (فرض) of the like (المثل)—and this is our doctrine (مذهب), and praise belongs to Allah.",
    "ur": "باب چار سو ننانوے: ایک قطب (قطب) کے حال کی معرفت میں جس کا منزل (منزل) یہ تھا کہ \"لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\" (اس کی مانند کوئی شے نہیں ہے)، ایک وقت میں کاف (تشبیہ) کو زائد (اضافی) مانتے ہوئے اور ایک وقت میں اسے فرض کیے گئے مثل (مانند) کی صفت قرار دیتے ہوئے، اور یہی ہمارا مسلک (مذہب) ہے، اور تمام تعریفیں اللہ کے لیے ہیں۔",
    "fa": "باب چهارصد و نود و نهم در معرفت حال قطبی که منزل او [آیه] لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (هیچ چیز مانند او نیست) بود؛ گاهی بر اساس زائد بودن کاف و گاهی بر اساس صفت بودن آن [کاف] برای فرض مثل، و این مذهب ماست و سپاس خدای را."
  },
  "content": {
    "ar": "## «الباب التاسع والتسعون وأربعمائة في معرفة حال قطب كان منزله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وقتا على زيادة الكاف ووقتا على كونها صفة لفرض المثل وهو مذهبنا والحمد لله»\n\n\n> ليس في الأكوان شي‏ء *** غيره فهو الوجود\n\n\n> وأنا وحدي على ما *** قلته فيه شهيد\n\n\n> فانتفى المثل على ذا *** فهو الفرد الوحيد\n\n\n> ما علي ما قلته في *** جانب الحق مزيد\n\n\n> فهو المراد فينا *** مثل ما هو المريد\n\n\n### [النيابة والخلافة]\n\n\nقال الله عز وجل شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ فما له مثل إذ لو كان له مثل لم يصح نفيه فإنه ما نفى إلا المرتبة ما نفى مثلية الذات وما عين التفاضل في الأمثال إلا المراتب فلو زالت لزال التفاضل فمن ذاته يقبل الصور ومن مرتبته لا يقبل المثل ولهذا سماه خليفة وخلفاء لأنها تولية ونيابة فما هم فيها بحكم الاستحقاق أعني استحقاق الدوام لكن لهم استحقاق قبول النيابة والخلافة فهم في الرتبة مستعارون وهي لله ذاتية فتزول عنهم ولا تزول ذواتهم والحق ما تجلى لهم إلا في صور ذواتهم لا في رتبته فإذا تجلى لهم في رتبته انعزل الجميع فلم يكن إلا هو فنفى مثلية المرتبة في الشهود ونفي مثلية الذات في الوجود\n\n\n> مثلية الذات في الوجود *** منفية ما لها شهود\n\n\n> فافتكروا في الذي أتينا *** به إليكم ولا تزيدوا\n\n\n> فإنه الحق لا يجارى *** وإننا عنده العبيد\n\n\n> فإن نظرتم فينا تجدنا *** منه إليه به نعود\n\n\n> سبحانه جل من مليك *** وهو بنا القائم الشهيد\n\n\n> يقصدنا للذي يراه *** منا وما عندنا قصود\n\n\n> إذ نبتغيه به تعالى *** هو المراد وهو المريد\n\n\nفلا يشهده إلا رب ولا يجده إلا عبد وبالعكس لأن الله سمعه وبصره وجميع قواه فانتفى عن العبد ما ينبغي أن ينتفي وبقي له ما ينبغي أن يبقى وهذا كله إذا كان حرف الكاف زائدا فله قبول ما قلنا من النفي وإذا كان للصفة بقي ما قلنا\n\n\n> وانتفى المثل عن المثل فلم *** يوجد المثل مع المثل وقد\n\n\n> ثبت المثل له بي مثل ما *** ثبت المثل لنا منه فقد\n\n\n> وجد الأمر على هذا وذا *** كوجود الفرد في عين العدد\n\n\nفليس كهو شي‏ء وليس مثل مثله شي‏ء فنفى وأثبت‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن الله خلق آدم على صورته‏\n\n\nفله التنوع في باطنه وله الثبوت في ظاهره فلا يزيد فيه عضو لم يكن عنده في الظاهر ولا يبقى على حال واحد في باطنه فله التنوع والثبوت والحق موصوف بأنه الظاهر والباطن فالظاهر له التنوع والباطن له الثبوت فالباطن الحق عين‏\nظاهر الإنسان والظاهر الحق عين باطن الإنسان فهو كالمرآة المعهودة إذا رفعت يمينك عند النظر فيها إلى صورتك رفعت صورتك يسارها فيمينك شمالها وشمالك يمينها فظاهرك أيها المخلوق على صورة اسمه الباطن وباطنك اسم الظاهر له ولهذا ينكر في التجلي يوم القيامة ويعرف ويوصف بالتحول في ذلك فأنت مقلوبة فأنت قلبه وهو قلبك هُنَّ لِباسٌ لَكُمْ وأَنْتُمْ لِباسٌ لَهُنَّ ما أحق هذه الآية في الباطن بهذا المقام‏\n\n\n> فكما يلبسنا نلبسه *** فبنا كان كما نحن به‏\n\n\n> فانتفى ما هو موجود بنا *** وبه أكرم به من مشبه‏\n\n\nوأكثر من هذا البسط في العبارة ما يكون فإن هذا الميدان يضيق الجولان فيه جدا والله ولي الإعانة إذ هو المعين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 499: Concerning the Gnosis of the State of a Pole (قطب) whose Station (منزله) was \"There is nothing like Him\" (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ), sometimes based on the *kaaf* being superfluous (زيادة الكاف), and sometimes based on it being a particle of similitude for a posited likeness (صفة لفرض المثل), which is our doctrine, and praise be to Allah.\n\nThere is nothing in the cosmos but Him, for He is Existence (الوجود).\nAnd I alone am a witness to what I have said concerning Him.\nThus, likeness (المثل) is negated; therefore, He is the Single, the Unique (الفرد الوحيد).\nThere is nothing more for me to add concerning the side of the Real (الحق).\nHe is the Desired (المراد) in us, just as He is the Desirer (المريد).\n\n### [Vicegerency and Succession]\n\nAllah, the Mighty and Majestic, said: <<شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ>> (Allah bears witness that there is no god but He, and the angels, and those possessed of Knowledge). Thus, He has no likeness (مثل), for if He had a likeness, its negation would not be sound. For He only negated the Level (المرتبة); He did not negate the similitude of the Essence (مثلية الذات). And nothing determines the difference in likenesses (الأمثال) except the Levels (المراتب); if they were removed, the difference would vanish.\n\nFrom His Essence (ذاته), He accepts forms (الصور), but from His Level (مرتبته), He does not accept likeness. For this reason, He named him Caliph (خليفة) and Caliphs (خلفاء), because it is an appointment and a vicegerency (نيابة). They do not hold this position by right of deserving, meaning the deserving of permanence (استحقاق الدوام), but they have the deserving of accepting the vicegerency and succession (الخلافة). Thus, they are borrowed (مستعارون) in the Level, while the Level is essential (ذاتية) to Allah. So, it departs from them, but their essences (ذواتهم) do not depart.\n\nThe Real (الحق) only manifests (تجلى) to them in the forms of their essences, not in His Level. If He were to manifest to them in His Level, all would be removed, and there would be none but Him. Thus, the similitude of the Level (مثلية المرتبة) is negated in the Witnessing (الشهود), and the similitude of the Essence (مثلية الذات) is negated in Existence (الوجود).\n\nThe similitude of the Essence (مثلية الذات) in Existence (الوجود) is negated; it has no witnessing (شهود).\nSo reflect upon what we have brought to you, and do not add anything.\nFor He is the Real (الحق) who cannot be matched, and we are the servants (العبيد) in His presence.\nIf you look into us, you will find that we return from Him, to Him, by Him.\nGlory be to Him, exalted is He, the Sovereign, and He is the Sustainer (القائم), the Witness (الشهيد) through us.\nHe intends us for what He sees from us, and we have no intentions.\nSince we seek Him through Him, exalted is He; He is the Desired (المراد) and He is the Desirer (المريد).\n\nThus, none witnesses Him but a Lord, and none finds Him but a servant, and vice versa, because Allah is his hearing, his sight, and all his powers. So, what ought to be negated is negated from the servant, and what ought to remain, remains for him.\n\nAll this holds true if the particle *kaaf* is superfluous (زائدا), for then it accepts the negation we stated. But if it is for similitude (للصفة), then what we stated remains:\n\nAnd likeness (المثل) was negated from likeness, so likeness was not found alongside likeness.\nYet likeness is established for Him through me, just as likeness is established for us from Him.\nThe matter is found upon this and that, like the existence of the Single (الفرد) within the very essence of the Number (العدد).\n\nSo, there is nothing *like* Him (ليس كهو شي‏ء), and there is nothing *like the likeness* of Him (وليس مثل مثله شي‏ء). Thus, He negated and affirmed.\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Allah created Adam upon His form.\"\n\nThus, He has variation (التنوع) in His inward aspect (باطنه) and permanence (الثبوت) in His outward aspect (ظاهره). No limb is added to Him that was not outwardly present, nor does He remain upon a single state in His inward aspect. Thus, He possesses variation and permanence.\n\nThe Real (الحق) is described as the Outward (الظاهر) and the Inward (الباطن). The Outward possesses variation, and the Inward possesses permanence. The Inward of the Real is the very essence of the outward of the human, and the Outward of the Real is the very essence of the inward of the human. He is like the familiar mirror: when you raise your right hand while looking at your image in it, your image raises its left hand. Thus, your right is its left, and your left is its right.\n\nYour outward aspect, O creature, is upon the form of His Name, the Inward (الباطن), and your inward aspect is the Name, the Outward (الظاهر), for Him. For this reason, He is denied during the Theophany (التجلي) on the Day of Resurrection, yet He is recognized, and He is described as transforming therein. So you are reversed; you are His heart (قلبه) and He is your heart. <<هُنَّ لِباسٌ لَكُمْ وأَنْتُمْ لِباسٌ لَهُنَّ>> (They are a garment for you, and you are a garment for them). How fitting is this verse, in its esoteric meaning (الباطن), for this station (المقام).\n\nJust as He clothes us, we clothe Him, for He came to be through us, just as we are through Him.\nThus, what exists through us is negated, and through Him—how noble is He as a likener!\n\nThere can be no further elaboration (البسط) in expression than this, for this field is extremely narrow for maneuvering. And Allah is the Guardian of assistance, for He is the Helper. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو ننانوے (499) قطب کے حال کی معرفت میں، جس کا مقام یہ تھا کہ \"کوئی شے اس کے مثل نہیں\" (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)؛ ایک وقت میں کاف کے زائد ہونے کی بنا پر، اور ایک وقت میں مثل کے فرض ہونے کے لیے اس کے صفت ہونے کی بنا پر، اور یہی ہمارا مسلک ہے، اور تمام تعریفیں اللہ کے لیے ہیں۔\n\n> اکوان (الأكوان) میں کوئی شے نہیں ہے،\n> سوائے اس کے، پس وہی ہستی (الوجود) ہے۔\n> اور میں اکیلا ہی اس پر جو میں نے اس کے بارے میں کہا ہے،\n> گواہ (شہید) ہوں۔\n> پس اس بنا پر مثل کی نفی ہو گئی،\n> لہٰذا وہ یکتا (الفرد) اور اکیلا (الوحید) ہے۔\n> جو کچھ میں نے ذات حق (الحق) کے پہلو میں کہا ہے،\n> اس پر میرے لیے کوئی اضافہ نہیں ہے۔\n> پس وہی ہم میں مراد ہے،\n> جیسا کہ وہ ارادہ کرنے والا (المريد) ہے۔\n\n### نیابت اور خلافت (النيابة والخلافة)\n\nاللہ عز و جل نے فرمایا: \"اللہ نے گواہی دی کہ اس کے سوا کوئی معبود نہیں، اور فرشتوں اور اہل علم نے بھی\" (شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ)۔ پس اس کا کوئی مثل نہیں، کیونکہ اگر اس کا کوئی مثل ہوتا تو اس کی نفی درست نہ ہوتی۔ کیونکہ اس نے صرف مرتبہ (المرتبۃ) کی نفی کی ہے، ذات (الذات) کی مثلیت کی نفی نہیں کی۔ اور امثال میں تفاضل (برتری) کو مراتب (المراتب) کے سوا کسی چیز نے متعین نہیں کیا۔ پس اگر وہ (مراتب) زائل ہو جائیں تو تفاضل بھی زائل ہو جائے۔ پس وہ اپنی ذات (الذات) سے صورتوں کو قبول کرتا ہے، اور اپنے مرتبہ (المرتبۃ) سے مثل کو قبول نہیں کرتا۔ اور اسی لیے اس نے اسے خلیفہ اور خلفاء کہا، کیونکہ یہ تفویض اور نیابت (النیابۃ) ہے۔ پس وہ اس میں استحقاق کے حکم سے نہیں ہیں، یعنی دوام کے استحقاق سے۔ لیکن انہیں نیابت (النیابۃ) اور خلافت (الخلافۃ) قبول کرنے کا استحقاق حاصل ہے۔ پس وہ مرتبہ (الرتبۃ) میں مستعار ہیں، اور وہ (مرتبہ) اللہ کے لیے ذاتی (ذاتیۃ) ہے۔ پس وہ ان سے زائل ہو جاتی ہے، لیکن ان کی ذوات (ذواتہم) زائل نہیں ہوتیں۔ اور ذات حق (الحق) نے ان پر ظہور الٰہی (التجلی) نہیں کیا مگر ان کی ذوات کی صورتوں میں، نہ کہ اپنے مرتبہ میں۔ پس جب وہ ان پر اپنے مرتبہ میں ظہور الٰہی (التجلی) کرتا ہے، تو سب الگ ہو جاتے ہیں، اور اس کے سوا کوئی نہیں رہتا۔ پس اس نے شہود (الشہود) میں مرتبہ کی مثلیت کی نفی کی، اور ہستی (الوجود) میں ذات کی مثلیت کی نفی کی۔\n\n> ہستی (الوجود) میں ذات کی مثلیت (مثلية الذات)\n> کی نفی کی گئی ہے، اس کا کوئی شہود (شہود) نہیں۔\n> پس اس میں غور کرو جو ہم تمہارے پاس لائے ہیں،\n> اور اضافہ نہ کرو۔\n> کیونکہ وہ ذات حق (الحق) ہے جس کا مقابلہ نہیں کیا جا سکتا،\n> اور ہم اس کے نزدیک بندے ہیں۔\n> پس اگر تم ہم میں دیکھو گے تو ہمیں اس سے، اس کی طرف،\n> اسی کے ذریعے لوٹتے ہوئے پاؤ گے۔\n> وہ پاک ہے، کتنا عظیم ہے وہ بادشاہ،\n> اور وہی ہم پر قائم اور گواہ (الشہید) ہے۔\n> وہ ہمارا قصد کرتا ہے اس کے لیے جو وہ ہم سے دیکھتا ہے،\n> اور ہمارے پاس کوئی قصد نہیں ہے۔\n> کیونکہ ہم اسی کے ذریعے اس کی طلب کرتے ہیں، وہ بلند ہے،\n> وہی مراد ہے اور وہی ارادہ کرنے والا (المريد) ہے۔\n\nپس اس کا شہود (الشہود) صرف رب ہی کرتا ہے، اور اسے صرف عبد ہی پاتا ہے، اور اس کے برعکس بھی۔ کیونکہ اللہ اس کی سماعت، اس کی بصارت اور اس کی تمام قوتیں ہے۔ پس بندے سے وہ چیزیں زائل ہو گئیں جن کا زائل ہونا ضروری تھا، اور اس کے لیے وہ باقی رہا جس کا باقی رہنا ضروری تھا۔ اور یہ سب تب ہے جب حرف کاف زائد ہو، تو اسے نفی کا قبول حاصل ہے جو ہم نے کہا۔ اور جب وہ صفت کے لیے ہو، تو جو ہم نے کہا وہ باقی رہا۔\n\n> اور مثل کی نفی مثل سے ہو گئی،\n> پس مثل کے ساتھ مثل نہیں پایا گیا، اور\n> اس کے لیے مثل میرے ذریعے ثابت ہوا،\n> جیسا کہ ہمارے لیے مثل اس کی طرف سے ثابت ہوا، پس\n> معاملہ اسی طرح پایا گیا، اور یہ ایسا ہی ہے\n> جیسے عدد کے عین میں فرد (اکیلا پن) کا وجود۔\n\nپس کوئی شے اس کی مانند نہیں ہے، اور کوئی شے اس کے مثل کے مثل نہیں ہے، پس اس نے نفی بھی کی اور اثبات بھی کیا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا\" (إن الله خلق آدم على صورته)۔ پس اس کے باطن میں تنوع ہے، اور اس کے ظاہر میں ثبوت ہے۔ پس اس میں کوئی ایسا عضو نہیں بڑھتا جو ظاہر میں اس کے پاس نہ ہو، اور نہ ہی وہ اپنے باطن میں ایک ہی حال پر باقی رہتا ہے۔ پس اس کے لیے تنوع اور ثبوت ہے، اور ذات حق (الحق) اس صفت سے موصوف ہے کہ وہ الظاہر (ظاہر) اور الباطن (باطن) ہے۔ پس ظاہر کے لیے تنوع ہے اور باطن کے لیے ثبوت ہے۔ پس ذات حق (الحق) کا باطن (الباطن) انسان کے ظاہر کا عین ہے، اور ذات حق (الحق) کا ظاہر (الظاہر) انسان کے باطن کا عین ہے۔ پس وہ جانی پہچانی آئینے کی طرح ہے، جب تم اس میں اپنی صورت دیکھتے ہوئے اپنا دایاں ہاتھ اٹھاتے ہو، تو تمہاری صورت اپنا بایاں ہاتھ اٹھاتی ہے۔ پس تمہارا دایاں اس کا بایاں ہے، اور تمہارا بایاں اس کا دایاں ہے۔ اے مخلوق! پس تمہارا ظاہر اس کے اسم الباطن (باطن) کی صورت پر ہے، اور تمہارا باطن اس کے اسم الظاہر (ظاہر) کی صورت پر ہے۔ اور اسی لیے قیامت کے دن ظہور الٰہی (التجلی) میں اس کا انکار کیا جائے گا اور اسے پہچانا بھی جائے گا، اور اس میں تحول (بدلنے) سے موصوف کیا جائے گا۔ پس تم پلٹے ہوئے ہو، تم اس کا قلب ہو اور وہ تمہارا قلب ہے۔ \"وہ تمہارے لیے لباس ہیں اور تم ان کے لیے لباس ہو\" (هُنَّ لِباسٌ لَكُمْ وأَنْتُمْ لِباسٌ لَهُنَّ)۔ باطن میں یہ آیت اس مقام کی کتنی زیادہ حقدار ہے۔\n\n> پس جیسا کہ وہ ہمیں پہناتا ہے، ہم اسے پہنتے ہیں،\n> پس وہ ہمارے ذریعے تھا جیسا کہ ہم اس کے ذریعے ہیں۔\n> پس اس چیز کی نفی ہو گئی جو ہم میں موجود ہے،\n> اور اس کے ذریعے، وہ کتنا معزز ہے وہ مشابہت دینے والا۔\n\nاور عبارت میں اس سے زیادہ تفصیل نہیں ہو سکتی، کیونکہ یہ میدان جولان (گھومنے) کے لیے بہت تنگ ہے۔ اور اللہ ہی مدد کا ولی ہے کیونکہ وہی مدد کرنے والا ہے، اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و نود و نهم (۴۹۹) در معرفت حال قطبی که منزل او «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» بود، گاهی با فرض کافِ زائد و گاهی با فرض صفت بودن کاف برای مثلِ مفروض، که این مذهب ماست و الحمد لله.\n\nدر کائنات چیزی نیست *** جز او، پس او هستی (الوجود) است.\nو من به تنهایی بر آنچه *** درباره او گفتم، شاهد (شهید) هستم.\nپس مَثَل (همتا) بر این اساس منتفی شد *** پس او فرد یگانه است.\nبر من در آنچه درباره *** جانب حق (الحق) گفتم، افزایشی نیست.\nپس او در ما مراد است *** همان‌گونه که او مرید است.\n\n### [نیابت و خلافت]\n\nخداوند عز و جل فرمود: شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ (خداوند گواهی داد که هیچ معبودی جز او نیست و فرشتگان و صاحبان دانش نیز گواهی دادند). پس او مَثَلی ندارد، زیرا اگر مَثَلی داشت، نفی آن صحیح نبود. او جز مرتبه را نفی نکرده است، مِثلیت ذات را نفی نکرده است. و تفاوت در امثال را جز مراتب تعیین نکرده است. پس اگر مراتب از بین بروند، تفاوت نیز از بین می‌رود. ذات اوست که صور را می‌پذیرد، اما مرتبه او مَثَل را نمی‌پذیرد. به همین دلیل او را خلیفه و خلفا نامید، زیرا این امر تفویض و نیابت است. آنها در این امر به حکم استحقاق نیستند، منظورم استحقاق دوام است، اما استحقاق پذیرش نیابت و خلافت را دارند. پس آنها در رتبه عاریه‌گیرنده هستند، در حالی که این رتبه برای خداوند ذاتی است. از این رو، رتبه از آنها زایل می‌شود، اما ذواتشان زایل نمی‌شود. و حق (الحق) بر آنها تجلی (التجلی) نکرد مگر در صور ذواتشان، نه در مرتبه خود. پس اگر در مرتبه خود بر آنها تجلی کند، همه کنار می‌روند و جز او باقی نمی‌ماند. پس مِثلیت مرتبه را در شهود (الشهود) نفی کرد و مِثلیت ذات را در هستی (الوجود) نفی کرد.\n\nمِثلیت ذات در هستی (الوجود) *** نفی شده است و شاهدی ندارد.\nپس در آنچه برای شما آوردیم بیندیشید *** و چیزی اضافه نکنید.\nزیرا او حق (الحق) است که همتا ندارد *** و ما نزد او بندگانیم.\nاگر در ما بنگرید، ما را می‌یابید *** که از او، به سوی او، و به واسطه او باز می‌گردیم.\nپاک و منزه است آن پادشاه بزرگ *** که او به واسطه ما، قائم و شاهد است.\nاو ما را برای آنچه از ما می‌بیند قصد می‌کند *** و ما قصدی نداریم.\nزیرا ما او را به واسطه خودش می‌جوییم، متعال است *** او مراد است و او مرید است.\n\nپس او را جز رب (پروردگار) شهود (الشهود) نمی‌کند و جز عبد (بنده) او را نمی‌یابد، و بالعکس؛ زیرا خداوند شنوایی و بینایی و تمام قوای اوست. پس آنچه باید از بنده نفی شود، نفی شد و آنچه باید برای او بماند، باقی ماند. و این همه زمانی است که حرف کاف زائد باشد، در این صورت پذیرش آنچه از نفی گفتیم برای آن وجود دارد. و اگر کاف برای صفت باشد، آنچه گفتیم باقی می‌ماند.\n\nو مَثَل از مَثَل نفی شد، پس *** مَثَل با مَثَل یافت نشد، در حالی که\nمَثَل برای او به واسطه من ثابت شد، همان‌گونه که *** مَثَل برای ما از جانب او ثابت شد.\nامر بر این اساس یافت شد *** مانند وجود فرد در عین کثرت (عدد).\n\nپس چیزی مانند او نیست و چیزی مثل مَثَل او نیست. پس نفی کرد و اثبات نمود.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا خداوند آدم را بر صورت خود آفرید».\n\nپس او در باطن خود تنوع دارد و در ظاهر خود ثبوت. عضوی در ظاهر او اضافه نمی‌شود که نزد او نبوده باشد، و در باطن خود بر یک حال باقی نمی‌ماند. پس او تنوع و ثبوت دارد. و حق (الحق) به ظاهر و باطن بودن توصیف شده است. پس ظاهر برای او تنوع دارد و باطن برای او ثبوت. باطن حق (الحق) عین ظاهر انسان است و ظاهر حق (الحق) عین باطن انسان است. پس او مانند آینه شناخته شده است؛ هنگامی که دست راست خود را هنگام نگاه کردن به صورتت در آن بالا می‌بری، صورتت دست چپ خود را بالا می‌برد، پس دست راست تو، چپ آن است و چپ تو، راست آن. ای مخلوق، ظاهر تو بر صورت اسم باطن اوست و باطن تو اسم ظاهر اوست. به همین دلیل در تجلی (التجلی) روز قیامت انکار می‌شود و شناخته می‌شود و به تحول در آن توصیف می‌گردد. پس تو مقلوب هستی، تو قلب او هستی و او قلب توست. هُنَّ لِباسٌ لَكُمْ وأَنْتُمْ لِباسٌ لَهُنَّ (آنان برای شما لباسی هستند و شما برای آنان لباسی هستید). چقدر این آیه در باطن سزاوار این مقام است.\n\nپس همان‌گونه که ما را می‌پوشاند، ما او را می‌پوشانیم *** پس او به واسطه ما بود، همان‌گونه که ما به واسطه او هستیم.\nپس آنچه در ما موجود است نفی شد *** و به واسطه او، چه گرامی است او از هر مشبهی.\n\nو بیش از این بسط در عبارت ممکن نیست، زیرا این میدان برای جولان بسیار تنگ است. و خداوند ولی یاری است، زیرا او یاری‌دهنده است. و خداوند حَقّ (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 2
}