{
  "id": 3,
  "title": {
    "ar": "الباب الثالث في تنزيه الحق تعالى عما في طي الكلمات",
    "en": "The Third Chapter: Concerning the Affirmation of the Transcendence (Tanzīh) of The Real, Exalted is He, from that which is implicit in the Words.",
    "ur": "تیسرا باب: ذات حق (الحق) کی اس چیز سے تنزیہ کے بیان میں جو کلمات (الکلمات) کے اندر پوشیدہ ہے۔",
    "fa": "باب سوم در تنزیه حق (الحق) تعالی از آنچه در بطن کلمات نهفته است"
  },
  "content": {
    "ar": "## «الباب الثالث في تنزيه الحق تعالى عما في طي الكلمات»\n\n\nالتي أطلقها عليه سبحانه في كتابه وعلى لسان رسوله صلى الله عليه وسلم من التشبيه والتجسيم تعالى الله عما يقول الظالمون علوا كبيرا»\n\n\n> نظم في نظر العبد إلى ربه *** في قدس الأيد وتنزيهه‏\n\n\n> وعلوه عن أدوات أتت *** تلحق بالكيف وتشبيهه‏\n\n\n> دلالة تحكم قطعا على *** منزلة العبد وتنويهه‏\n\n\n> وصحة العلم وإثباته *** وطرح بدعي وتمويهه‏\n\n\n### [جميع المعلومات حملها العقل الأول‏]\n\n\nاعلم أيدك الله أن جميع المعلومات علوها وسفلها حاملها العقل الذي يأخذ عن الله تعالى بغير واسطة فلم يخف عنه شي‏ء\nمن علم الكون الأعلى والأسفل ومن وهبه وجوده تكون معرفة النفس الأشياء ومن تجليه إليها ونوره وفيضه الأقدس فالعقل مستفيد من الحق تعالى مفيد للنفس والنفس مستفيدة من العقل وعنها يكون الفعل وهذا سار في جميع ما تعلق به علم العقل بالأشياء التي هي دونه وإنما قيدنا بالتي هي دونه من أجل ما ذكرناه من الإفادة وتحفظ في نظرك من قوله تعالى حَتَّى نَعْلَمَ وهو العالم فاعرف السبب‏\n\n\n### [العالم المهيم‏]\n\n\nواعلم أن العالم المهيم لا يستفيد من العقل الأول شيئا وليس له على المهيمين سلطان بل هم وإياه في مرتبة واحدة كالأفراد منا الخارجين عن حكم القطب وإن كان القطب واحدا من الأفراد لكن خصص العقل بالإفادة كما خصص القطب من بين الأفراد بالتولية\n\n\n### [علم تجريد التوحيد]\n\n\nوهو سار في جميع ما تعلق به علم العقل إلا علم تجريد التوحيد خاصة فإنه يخالف سائر المعلومات من جميع الوجوه إذ لا مناسبة بين الله تعالى وبين خلقه البتة وإن أطلقت المناسبة يوما ما عليه كما أطلقها الإمام أبو حامد الغزالي في كتبه وغيره فبضرب من التكلف ومرمى بعيد عن الحقائق وإلا فأي نسبة بين المحدث والقديم أم كيف يشبه من لا يقبل المثل من يقبل المثل هذا محال كما قال أبو العباس بن العريف الصنهاجى في محاسن المجالس التي تعزى إليه ليس بينه وبين العباد نسب إلا العناية ولا سبب إلا الحكم ولا وقت غير الأزل وما بقي فعمى وتلبيس وفي رواية فعلم بدل من قوله فعمي فانظر ما أحسن هذا الكلام وما أتم هذه المعرفة بالله وما أقدس هذه المشاهدة نفعه الله بما قال‏\n\n\n### [عجز العقل عن معرفة الله‏]\n\n\nفالعلم بالله عزيز عن إدراك العقل والنفس إلا من حيث إنه موجود تعالى وتقدس وكل ما يتلفظ به في حق المخلوقات أو يتوهم في المركبات وغيرها فالله سبحانه في نظر العقل السليم من حيث فكره وعصمته بخلاف ذلك لا يجوز عليه ذلك التوهم ولا يجري عليه ذلك اللفظ عقلا من الوجه الذي تقبله المخلوقات فإن أطلق عليه فعلى وجه التقريب على الأفهام لثبوت الوجود عند السامع لا لثبوت الحقيقة التي هو الحق عليها فإن الله تعالى يقول لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ولكن يجب علينا شرعا من أجل قوله تعالى لنبيه صلى الله عليه وسلم فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله يقول اعلم من إخباري الموافق لنظرك ليصح لك الايمان علما كما صح لك العلم من غير إيمان الذي هو قبل التعريف فأمره فمن أجل هذا الأمر على نظر بعض الناس ورأيه فيه نظرنا من أين نتوصل إلى معرفته فنظرنا على حكم الإنصاف وما أعطاه العقل الكامل بعد جده واجتهاده الممكن منه فلم نصل إلى المعرفة به سبحانه إلا بالعجز عن معرفته لأنا طلبنا أن نعرفه كما نطلب معرفة الأشياء كلها من جهة الحقيقة التي هي المعلومات عليها فلما عرفنا إن ثم موجودا ليس له مثل ولا يتصور في الذهن ولا يدرك فكيف يضبطه العقل هذا ما لا يجوز مع ثبوت العلم بوجوده فنحن نعلم أنه موجود واحد في ألوهته وهذا هو العلم الذي طلب منا غير عالمين بحقيقة ذاته التي يعرف سبحانه نفسه عليها وهو العلم بعدم العلم الذي طلب منا لما كان تعالى لا يشبه شيئا من المخلوقات في نظر العقل ولا يشبهه شي‏ء منها كان الواجب علينا أولا لما قيل لنا فاعلموا أنه لا إله إلا الله إن نعلم ما العلم وقد علمنا فقد علمنا ما يجب علينا من علم العلم أولا انتهى الجزء الثامن والحمد لله‏\n\n\n(بسم الله الرحمن الرحيم)\n\n\n### [أمهات المطالب العلمية]\n\n\nفلنقل إنه لما كانت أمهات المطالب أربعة وهي هل وما وكيف ولم فهل ولم مطلبان روحانيان بسيطان يصحبهما ما هو فهل ولم هما الأصلان الصحيحان للبسائط لأن في ما هو ضرب من التركيب خاصة وليس في هذه المطالب الأربعة مطلب ينبغي أن يسأل به عن الله تعالى من جهة ما تعطيه الحقيقة إذ لا يصح أن يعرف من علم التوحيد إلا نفي ما يوجد فيما سواه سبحانه ولهذا قال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وسُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ‏\n\n\n### [العلم بالسلب هو العلم بالله‏]\n\n\nفالعلم بالسلب هو العلم بالله سبحانه كما لم يجز أن نقول في الأرواح كيف وتقدست عن ذلك لأن حقائقها تخالف هذه العبارة كذلك ما ينطلق على الأرواح من الأدوات التي بها يسأل عنها لا يجوز أن يطلق على الله تعالى ولا ينبغي للمحقق الموحد الذي يحترم حضرة مبدعه ومخترعه أن يطلق عليه هذه الألفاظ فاذن لا يعلم بهذه المطالب أبدا\n\n\n### «وصل» [المدرك بذاته والمدرك بفعله واللامدرك أصلا]\n\n\nثم إنا نظرنا أيضا في جميع ما سوى الحق تعالى فوجدناه على قسمين قسم يدرك بذاته وهو المحسوس والكثيف وقسم يدرك بفعله وهو المعقول واللطيف فارتفع المعقول عن المحسوس بهذه المنزلة وهي التنزه أن تدرك بذاته وإنما يدرك بفعله ولما كانت هذه أوصاف المخلوقين‏\nتقدس الحق تعالى عن أن يدرك بذاته كالمحسوس أو بفعله كاللطيف أو المعقول لأنه سبحانه ليس بينه وبين خلقه مناسبة أصلا لأن ذاته غير مدركة لنا فتشبه المحسوس ولا فعلها كفعل اللطيف فيشبه اللطيف لأن فعل الحق تعالى إبداع الشي‏ء لا من شي‏ء واللطيف الروحاني فعل الشي‏ء من الأشياء فأي مناسبة بينهما فإذا امتنعت المشابهة في الفعل فأحرى أن تمتنع المشابهة في الذات وإن شئت أن تحقق شيئا من هذا الفصل فانظر إلى مفعول هذا الفعل على حسب أصناف المفعولات مثل المفعول الصناعي كالقميص والكرسي فوجدناه لا يعرف صانعه إلا أنه يدل بنفسه على وجود صانعه وعلى علمه بصنعته وكذلك المفعول التكويني الذي هو الفلك والكواكب لا يعرفون مكونهم ولا المركب لهم وهو النفس الكلية المحيطة بهم وكذلك المفعول الطبيعي كالموالد من المعادن والنبات والحيوان الذين يفعلون طبيعة من المفعول التكويني ليس لهم وقوف على الفاعل لهم الذي هو الفلك والكواكب فليس العلم بالأفلاك ما تراه من جرمها وما يدركه الحس منها وأين جرم الشمس في نفسها منها في عين الرائي لها منا وإنما العلم بالأفلاك من جهة روحها ومعناها الذي أوجده الله تعالى لها عن النفس الكلية المحيطة التي سبب الأفلاك وما فيها وكذلك المفعول الانبعاثي الذي هو النفس الكلية المنبعثة من العقل انبعاث الصورة الدحيية من الحقيقة الجبرئيلية فإنها لا تعرف الذي انبعثت عنه أصلا لأنها تحت حيطته وهو المحيط بها لأنها خاطر من خواطره فكيف تعلم ما هو فوقها وما ليس فيها منه إلا ما فيها فلا تعلم منه إلا ما هي عليه فنفسها علمت لا سببهما وكذلك المفعول الإبداعي الذي هو الحقيقة المحمدية عندنا والعقل الأول عند غيرنا وهو القلم الأعلى الذي أبدعه الله تعالى من غير شي‏ء هو أعجز وامنع عن إدراك فاعله من كل مفعول تقدم ذكره إذ بين كل مفعول وفاعله مما تقدم ذكره ضرب من ضروب المناسبة والمشاكلة فلا بد أن يعلم منه قدر ما بينهما من المناسبة إما من جهة الجوهرية أو غير ذلك ولا مناسبة بين المبدع الأول والحق تعالى فهو أعجز عن معرفته بفاعله من غيره من مفعولي الأسباب إذ قد عجز المفعول الذي يشبه سببه الفاعل له من وجوه عن إدراكه والعلم به فافهم هذا وتحققه فإنه نافع جدا في باب التوحيد والعجز عن تعلق العلم المحدث بالله تعالى‏\n\n\n### «وصل» [القوى الخمس ومدركاتها الحقيقية]\n\n\nيؤيد ما ذكرناه أن الإنسان إنما يدرك المعلومات كلها بإحدى القوي الخمس القوة الحسية وهي على خمس الشم والطعم واللمس والسمع والبصر فالبصر يدرك الألوان والمتلونات والأشخاص على حد معلوم من القرب والبعد فالذي يدرك منه على ميل غير الذي يدرك منه على ميلين والذي يدرك منه على عشرين باعا غير الذي يدرك منه على ميل والذي يدرك منه ويده في يده يقابله غير الذي يدرك منه على عشرين باعا فالذي يدرك منه على ميلين شخص لا يدري هل هو إنسان أو شجرة وعلى ميل يعرف أنه إنسان وعلى عشرين باعا أنه أبيض أو أسود وعلى المقابلة أنه أزرق أو أكحل وهكذا سائر الحواس في مدركاتها من القرب والبعد والباري سبحانه ليس بمحسوس أي ليس بمدرك بالحس عندنا في وقت طلبنا المعرفة به فلم نعلمه من طريق الحس وأما القوة الخيالية فإنها لا تضبط إلا ما أعطاها الحس إما على صورة ما أعطاها وإما على صورة ما أعطاه الفكر من حمله بعض المحسوسات على بعض وإلى هنا انتهت طريقة أهل الفكر في معرفة الحق فهو لسانهم ليس لساننا وإن كان حقا ولكن ننسبه إليهم فإنه نقل عنهم فلم تبرح هذه القوة كيفما كان إدراكها عن الحس البتة وقد بطل تعلق الحس بالله عندنا فقد بطل تعلق الخيال به وأما القوة المفكرة فلا يفكر الإنسان أبدا إلا في أشياء موجودة عنده تلقاها من جهة الحواس وأوائل العقل ومن الفكر فيها في خزانة الخيال يحصل له علم بأمر آخر بينه وبين هذه الأشياء التي فكر فيها مناسبة ولا مناسبة بين الله وبين خلقه فاذن لا يصح العلم به من جهة الفكر ولهذا منعت العلماء من الفكر في ذات الله تعالى وأما القوة العقلية فلا يصح أن يدركه العقل فإن العقل لا يقبل إلا ما علمه بديهة أو ما أعطاه الفكر وقد بطل إدراك الفكر له فقد بطل إدراك العقل له من طريق الفكر ولكن مما هو عقل إنما حده أن يعقل ويضبط ما حصل عنده فقد يهبه الحق المعرفة به فيعقلها لأنه عقل لا من طريق الفكر هذا ما لا نمنعه فإن هذه المعرفة التي يهبها الحق تعالى لمن شاء من عباده لا يستقل العقل بإدراكها ولكن يقبلها فلا يقوم عليها دليل ولا برهان لأنها وراء طور مدارك العقل ثم هذه الأوصاف الذاتية لا تمكن العبارة عنها لأنها خارجة عن التمثيل والقياس فإنه ليس‏\nكمثله شي‏ء فكل عقل لم يكشف له من هذه المعرفة شي‏ء يسأل عقلا آخر قد كشف له منها ليس في قوة ذلك العقل المسئول العبارة عنها ولا تمكن ولذلك قال الصديق العجز عن درك الإدراك إدراك ولهذا الكلام مرتبتان فافهم فمن طلب الله بعقله من طريق فكره ونظره فهو تائه وإنما حسبه التهيؤ لقبول ما يهبه الله من ذلك فافهم وأما القوة الذاكرة فلا سبيل أن تدرك العلم بالله فإنها إنما تذكر ما كان العقل قبل علمه ثم غفل أو نسي وهو لم يعلمه فلا سبيل للقوة الذاكرة إليه وانحصرت مدارك الإنسان بما هو إنسان وما تعطيه ذاته وله فيه كسب وما بقي إلا تهيؤ العقل لقبول ما يهبه الحق من معرفته جل وتعالى فلا يعرف أبدا من جهة الدليل إلا معرفة الوجود وأنه الواحد المعبود لا غير فإن الإنسان المدرك لا يتمكن له أن يدرك شيئا أبدا إلا ومثله موجود فيه ولو لا ذلك ما أدركه البتة ولا عرفه فإذا لم يعرف شيئا إلا وفيه مثل ذلك الشي‏ء المعروف فما عرف إلا ما يشبهه ويشاكله والباري تعالى لا يشبه شيئا ولا في شي‏ء مثله فلا يعرف أبدا\n\n\n### [الأشياء الطبيعية لا تقبل الغذاء إلا من مشاكلها]\n\n\nومما يؤيد ما ذكرناه أن الأشياء الطبيعية لا تقبل الغذاء إلا من مشاكلها فأما ما لا يشاكلها فلا تقبل الغذاء منه قطعا مثال ذلك أن الموالد من المعادن والنبات والحيوان مركبة من الطبائع الأربع والموالد لا تقبل الغذاء إلا منها وذلك لأن فيها نصيبا منها ولو رام أحد من الخلق على أن يجعل غذاء جسمه المركب من هذه الطبائع من شي‏ء كائن عن غير هذه الطبائع أو ما تركب عنها لم يستطع فكما لا يمكن لشي‏ء من الأجسام الطبيعية أن تقبل غذاء إلا من شي‏ء هو من الطبائع التي هي منها كذلك لا يمكن لأحد أن يعلم شيئا ليس فيه مثله البتة أ لا ترى النفس لا تقبل من العقل إلا ما تشاركه فيه وتشاكله وما لم تشاركه فيه لا تعلمه منه أبدا وليس من الله في أحد شي‏ء ولا يجوز ذلك عليه بوجه من الوجوه فلا يعرفه أحد من نفسه وفكره‏\n\n\nقال رسول الله صلى الله وسلم إن الله احتجب عن العقول كما احتجب عن الأبصار وإن الملأ الأعلى يطلبونه كما تطلبونه أنتم‏\n\n\nفأخبر عليه السلام بأن العقل لم يدركه بفكره ولا بعين بصيرته كما لم يدركه البصر وهذا هو الذي أشرنا إليه فيما تقدم من بابنا فلله الحمد على ما ألهم وأن علمنا ما لم نكن نعلم وكان فضل الله عظيما\n\n\n### [التنزيه ونفي المماثلة والتشبيه‏]\n\n\nهكذا فليكن التنزيه ونفي المماثلة والتشبيه وما ضل من ضل من المشبهة إلا بالتأويل وحمل ما وردت به الآيات والأخبار على ما يسبق منها إلى الأفهام من غير نظر فيما يجب الله تعالى من التنزيه فقادهم ذلك إلى الجهل المحض والكفر الصراح ولو طلبوا السلامة وتركوا الأخبار والآيات على ما جاءت من غير عدول منهم فيها إلى شي‏ء البتة ويكلون علم ذلك إلى الله تعالى ولرسوله ويقولون لا ندري وكان يكفيهم قول الله تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فمتى جاءهم حديث فيه تشبيه فقد أشبه الله شيئا وهو قد نفى الشبه عن نفسه سبحانه فما بقي إلا أن ذلك الخبر له وجه من وجوه التنزيه يعرفه الله تعالى وجي‏ء به لفهم العربي الذي نزل القرآن بلسانه وما تجد لفظة في خبر ولا آية جملة واحدة تكون نصا في التشبيه أبدا وإنما تجدها عند العرب تحتمل وجوها منها ما يؤدي إلى التشبيه ومنها ما يؤدي إلى التنزيه فحمل المتأول ذلك اللفظ على الوجه الذي يؤدي إلى التشبيه جور منه على ذلك اللفظ إذ لم يوف حقه بما يعطيه وضعه في اللسان وتعد على الله تعالى حيث حمل عليه سبحانه ما لا يليق بالله تعالى ونحن نورد إن شاء الله تعالى بعض أحاديث وردت في التشبيه وإنها ليست بنص فيه فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ فَلَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ‏\n\n\n### [التشبيه والتجسيم في ألفاظ السنة]\n\n\nقلب المؤمن بين أصبعين من أصابع الله‏\n\n\nنظر العقل بما يقتضيه الوضع من الحقيقة والمجاز الجارحة تستحيل على الله تعالى الإصبع لفظ مشترك يطلق على الجارحة ويطلق على النعمة قال الراعي‏\n\n\n> ضعيف العصا بادي العروق ترى له *** عليها إذا ما أمحل الناس أصبعا\n\n\nيقول ترى له عليها أثرا حسنا من النعمة بحسن النظر عليها تقول العرب ما أحسن أصبع فلان على ما له أي أثره فيه تريد به نمو ما له لحسن تصرفه فيه أسرع التقليب ما قلبته الأصابع لصغر حجمها وكمال القدرة فيها فحركتها أسرع من حركة اليد وغيره ولما كان تقليب الله قلوب العباد أسرع شي‏ء أفصح صلى الله عليه وسلم للعرب في دعائه بما تعقل ولأن التقليب لا يكون إلا باليد عندنا فلذلك جعل التقليب بالأصابع لأن الأصابع من اليد في اليد والسرعة في الأصابع أمكن‏\n\n\nفكان عليه السلام يقول في دعائه يا مقلب القلوب ثبت قلبي على دينك‏\n\n\nوتقليب الله تعالى القلوب هو ما يخلق فيها من الهم بالحسن والهم بالسوء فلما كان الإنسان يحس بترادف الخواطر المتعارضة عليه في قلبه الذي هو عبارة عن تقليب‏\nالحق القلب وهذا لا يقدر الإنسان يدفع علمه عن نفسه لذلك‏\n\n\nكان عليه السلام يقول يا مقلب القلوب ثبت قلبي على دينك وفي هذا الحديث إن إحدى أزواجه قالت له أ وتخاف يا رسول الله فقال صلى الله عليه وسلم قلب المؤمن بين أصبعين من أصابع الله‏\n\n\nيشير صلى الله عليه وسلم إلى سرعة التقليب من الايمان إلى الكفر وما تحتهما قال تعالى فَأَلْهَمَها فُجُورَها وتَقْواها وهذا الإلهام هو التقليب والأصابع للسرعة والاثنينية لها خاطر الحسن وخاطر القبيح فإذا فهم من الأصابع ما ذكرته وفهمت منه الجارحة وفهمت منه النعمة والأثر الحسن فبأي وجه تلحقه بالجارحة وهذه الوجوه المنزهة تطلبه فأما نسكت ونكل علم ذلك إلى الله تعالى وإلى من عرفه الحق ذلك من رسول مرسل أو ولي ملهم بشرط نفي الجارحة ولا بد وإما إن أدركنا فضول وغلب علينا إلا أن نرد بذلك على بدعي مجسم مشبه فليس بفضول بل يجب على العالم عند ذلك تبيين ما في ذلك اللفظ من وجوه التنزيه حتى يدحض به حجة المجسم المخذول تاب الله علينا وعليه ورزقه الإسلام فإن تكلمنا على تلك الكلمة التي توهم التشبيه ولا بد فالعدول بشرحها إلى الوجه الذي يليق بالله سبحانه أولى هذا حظ العقل في الوضع‏\n\n\n### (نفث روح في روع) [حظ القلب من الإصبعين‏]\n\n\nالإصبعان سر الكمال الذاتي الذي إذا انكشف إلى الأبصار يوم القيامة يأخذ الإنسان أباه إذا كان كافرا ويرمي به في النار ولا يجد لذلك ألما ولا عليه شفقة بسر هذين الإصبعين المتحد معناهما المثنى لفظهما خلقت الجنة والنار وظهر اسم المنور والمظلم والمنعم والمنتقم فلا تتخيلهما اثنين من عشرة ولا بد من الإشارة إلى هذا السر في هذا الباب في كلتا يديه يمين وهذه معرفة الكشف فإن لأهل الجنة نعيمين نعيما بالجنة ونعيما بعذاب أهل النار في النار وكذلك أهل النار لهم عذابان وكلا الفريقين يرون الله رؤية الأسماء كما كانوا في الدنيا سواء وفي القبضتين اللتين جاءتا عن الرسول صلى الله عليه وسلم في حق الحق سر ما أشرنا إليه ومعناه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ القبضة واليمين قال تعالى والْأَرْضُ جَمِيعاً قَبْضَتُهُ ... والسَّماواتُ مَطْوِيَّاتٌ بِيَمِينِهِ نظر العقل بما يقتضيه الوضع أنه منع أولا سبحانه أن يقدر قدره لما يسبق إلى العقول الضعيفة من التشبيه والتجسيم عند ورود الآيات والأخبار التي تعطي من وجه ما من وجوهها ذلك ثم قال بعد هذا التنزيه الذي لا يعقله إلا العالمون والْأَرْضُ جَمِيعاً قَبْضَتُهُ عرفنا من وضع اللسان العربي أن يقال فلان في قبضتي يريد أنه تحت حكمي وإن كان ليس في يدي منه شي‏ء البتة ولكن أمري فيه ماض وحكمي عليه قاض مثل حكمي على ما ملكته يدي حسا وقبضت عليه وكذلك أقول مالي في قبضتي أي في ملكي وإني متمكن في التصرف فيه أي لا يمنع نفسه مني فإذا صرفته ففي وقت تصرفي فيه كان أمكن لي أن أقول هو في قبضتي لتصرفي فيه وإن كان عبيدي هم المتصرفون فيه عن إذني فلما استحالت الجارحة على الله تعالى عدل العقل إلى روح القبضة ومعناها وفائدتها وهو ملك ما قبضت عليه في الحال وإن لم يكن لها أعني للقابض فيما قبض عليه شي‏ء ولكن هو في ملك القبضة قطعا فهكذا العالم في قبضة الحق تعالى والأرض في الدار الآخرة تعيين بعض الأملاك كما نقول خادمي في قبضتي وإن كان خادمي من جملة من في قبضتي فإنما ذكرته اختصاصا لوقوع نازلة ما واليمين عندنا محل التصريف المطلق القوي فإن اليسار لا يقوي قوة اليمين فكنى باليمين عن التمكن من الطي فهي إشارة إلى تمكن القدرة من الفعل فوصل إلى أفهام العرب بألفاظ تعرفها وتسرع بالتلقي لها قال الشاعر\n\n\n> إذا ما راية رفعت لمجد *** تلقاها عرابة باليمين‏\n\n\nوليس للمجد راية محسوسة فلا تتلقاها جارحة يمين فكأنه يقول لو ظهر للمجد راية محسوسة لما كان محلها أو حاملها إلا يمين عرابة الأوسي أي صفة المجد به قائمة وفيه كاملة فلم تزل العرب تطلق ألفاظ الجوارح على ما لا يقبل الجارحة لاشتراك بينهما من طريق المعنى‏\n\n\n### (نفث روح في روع) [حظ القلب من اليمين واليسار]\n\n\nإذا تجلى الحق لسر عبد ملكه جميع الأسرار وألحقه بالأحرار وكان له التصرف الذاتي من جهة اليمين فإن شرف الشمال بغيره وشرف اليمين بذاته ثم أنزل شرف اليمين بالخطاب وشرف الشمال بالتجلي شرف الإنسان بمعرفته بحقيقته واطلاعه عليها وهو اليسار وكلتا يديه من حيث هو شمال كما إن كلتي يدي الحق يمين ارجع إلى معنى الاتحاد كلتا يدي العبد يمين ارجع إلى التوحيد إحدى يديه يمين والأخرى شمال‏\nفتارة أكون في الجمع وجمع الجمع وتارة أكون في الفرق وفي فرق الفرق على حكم التجلي والوارد\n\n\n> يوما يمان إذا لاقيت ذا يمن *** وإن لقيت معديا فعدناني‏\n\n\nومن ذلك التعجب والضحك والفرح والغضب التعجب إنما يقع من موجود لا يعلم ذلك المتعجب منه ثم يعلمه فيتعجب منه ويلحق به الضحك وهذا محال على الله تعالى فإنه ما خرج شي‏ء عن علمه فمتى وقع في الوجود شي‏ء يمكن التعجب منه عندنا حمل ذلك التعجب والضحك على من لا يجوز عليه التعجب ولا الضحك لأن الأمر الواقع متعجب منه عندنا كالشاب ليست له صبوة فهذا أمر يتعجب منه فحل عند الله تعالى محل ما يتعجب منه عندنا وقد يخرج الضحك والفرح إلى القبول والرضي فإن من فعلت له فعلا أظهر لك من أجله الضحك والفرح فقد قبل ذلك الفعل ورضي به فضحكه وفرحه تعالى قبوله ورضاه عنا كما إن غضبه تعالى منزه عن غليان دم القلب طلبا للانتصار لأنه سبحانه يتقدس عن الجسمية والعرض فذلك قد يرجع إلى أن يفعل فعل من غضب ممن يجوز عليه الغضب وهو انتقامه سبحانه من الجبارين والمخالفين لأمره والمتعدين حدوده قال تعالى وغضب عليه أي جازاه جزاء المغضوب عليه فالمجازي يكون غاضبا فظهور الفعل أطلق الاسم‏\n\n\nمن باب الفرح‏\n\n\nورد في الخبر أن الله يتبشبش للرجل يوطئ المساجد للصلاة والذكر\n\n\nالحديث لما حجب العالم بالأكوان واشتغلوا بغير الله عن الله فصاروا بهذا الفعل في حال غيبة عن الله فلما وردوا عليه سبحانه بنوع من أنواع الحضور أسدل إليهم سبحانه في قلوبهم من لذة نعيم محاضرته ومناجاته ومشاهدته ما تحبب بها إلى قلوبهم‏\n\n\nفإن النبي عليه السلام يقول حبوا الله لما يغذوكم به من نعمه‏\n\n\nفكنى بالتبشبش عن هذا الفعل منه لأنه إظهار سرور بقدومكم عليه فإنه من يسر بقدومك عليه فعلامة سروره إظهار البر بجانبك والتحبب وإرسال ما عنده من نعم عليك فلما ظهرت هذه الأشياء من الله إلى العبيد النازلين به سماه تبششا\n\n\nقال الله تعالى فَنَسِيَهُمْ الباري تعالى لا يجوز عليه النسيان ولكنه تعالى لما عذبهم عذاب الأبد ولم تنلهم رحمته تعالى صاروا كأنهم منسيون عنده وهو كأنه ناس لهم أي هذا فعل الناسي ومن لا يتذكر ما هم فيه من أليم العذاب وذلك لأنهم في حياتهم الدنيا نَسُوا الله فجازاهم بفعلهم ففعلهم أعاده عليهم للمناسبة وقد يكون نسيهم أخرهم نسوا الله أي أخروا أمر الله فلم يعملوا به أخرهم الله في النار حين أخرج منها من أدخله فيها من غيرهم ويقرب من هذا الباب اتصاف الحق بالمكر والاستهزاء والسخرية قال تعالى سَخِرَ الله مِنْهُمْ وقال ومَكَرَ الله وقال الله يَسْتَهْزِئُ بِهِمْ‏\n\n\nقال صلى الله عليه وسلم لا تسبوا الريح فإنها من نفس الرحمن‏\n\n\nوقوله عليه السلام إني لأجد نفس الرحمن يأتيني من قبل اليمن‏\n\n\nوهذا كله من التنفيس كأنه يقول لا تسبوا الريح فإنها مما ينفس بها الرحمن عن عباده وقال عليه السلام نصرت بالصبا\n\n\nيقول إني لأجد نفس أي تنفيس الرحمن عني‏\n\n\nللكرب الذي كان فيه من تكذيب قومه إياه وردهم أمر الله من قبل اليمن فكان الأنصار نفس الله بهم عن نبيه صلى الله عليه وسلم ما كان أكربه من المكذبين فإن الله تعالى منزه عن النفس الذي هو الهواء الخارج من المتنفس تعالى الله عما نسب إليه الظالمون من ذلك علوا كبيرا\n\n\nتطلق على الأمر وعلى المعلوم عند الناس وعلى غير ذلك ورد في الحديث إضافة الصورة إلى الله في الصحيح وغيره‏\n\n\nمثل حديث عكرمة قال عليه السلام رأيت ربي في صورة شاب‏\n\n\nالحديث هذا حال من النبي صلى الله عليه وسلم وهو في كلام العرب معلوم متعارف وكذلك‏\n\n\nقوله عليه السلام إن الله خلق آدم على صورته‏\n\n\nاعلم أن المثلية الواردة في القرآن لغوية لا عقلية لأن المثلية العقلية تستحيل على الله تعالى زيد الأسد شدة زيد زهير شعرا إذا وصفت موجودا بصفة أو صفتين ثم وصفت غيره بتلك الصفة وإن كان بينهما تباين من جهة حقائق أخر ولكنهما مشتركان في روح تلك الصفة ومعناها فكل واحد منهما على صورة الآخر في تلك الصفة خاصة فافهم وتنبه وانظر كونك دليلا عليه سبحانه وهل وصفته بصفة كمال إلا منك فتفطن فإذا دخلت من باب التعرية عن المناظرة سلبت النقائص التي تجوز عليك عنه وإن كانت لم تقم قط به ولكن المجسم والمشبه لما أضافها إليه سلبت أنت تلك الإضافة ولو لم يتوهم هذا لما فعلت شيئا من هذا السلب فاعلم وإن كان للصورة هنا مداخل كثيرة أضربنا عن ذكرها رغبة فيما قصدناه في هذا الكتاب من حذف التطويل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\nورد في الخبر عن النبي صلى الله عليه وسلم أن ضرس الكافر في النار مثل أحد وكثافة جلده أربعون ذراعا بذراع الجبار\n\n\nهذه إضافة تشريف مقدار جعله الله تعالى أضافه إليه كما تقول هذا الشي‏ء كذا وكذا ذراعا بذراع الملك تريد الذراع الأكبر الذي جعله الملك وإن كان مثلا ذراع الملك الذي هو الجارحة مثل أذرع الناس والذراع الذي جعله مقدارا يزيد على ذراع الجارحة بنصفه أو ثلثه فليس هو إذن ذراعه على حقيقته وإنما هو مقدار نصبه ثم أضيف إلى جاعله فاعلم والجبار في اللسان الملك العظيم وهكذا\n\n\nيضع الجبار فيها قدمه القدم الجارحة ويقال لفلان في هذا الأمر قدم أي ثبوت والقدم جماعة من الخلق فتكون القدم إضافة وقد يكون الجبار ملكا وتكون هذه القدم لهذا الملك إذ الجارحة تستحيل على الله تعالى وجل‏\n\n\n(و الاستواء)\n\n\nأيضا ينطلق على الاستقرار والقصود والاستيلاء والاستقرار من صفات الأجسام فلا يجوز على الله تعالى إلا إذا كان على وجه الثبوت والقصد هو الإرادة وهي من صفات الكمال قال ثُمَّ اسْتَوى‏ إِلَى السَّماءِ أي قصد واسْتَوى‏ عَلَى الْعَرْشِ أي استولى‏\n\n\n> قد استوى بشر على العراق *** من غير سيف ودم مهراق‏\n\n\nوالأخبار والآيات كثيرة منها صحيح وسقيم وما منها خبر إلا وله وجه من وجوه التنزيه وإن أردت أن يقرب ذلك عليك فاعمد إلى اللفظة التي توهم التشبيه وخذ فائدتها وروحها أو ما يكون عنها فاجعله في حق الحق تفز بدرجة التنزيه حين حاز غيرك درك التشبيه فهكذا فافعل وطهر ثوبك ويكفي هذا القدر من هذه الأخبار فقد طال الباب‏\n\n\n### نفث الروح الأقدس في الروع الأنفس [المعنى الرمزى لالفاظ التشبيه بلسان الشرع‏]\n\n\nبما تقدم من الألفاظ لما تعجب المتعجب ممن خرج على صورته وخالفه في سريرته ففرح بوجوده وضحك من شهوده وغضب لتوليه وتبشبش لتدليه ونسي ظاهره وتنفس فأطلق مواخره وثبت على ملكه وتحكم بالتقدير على ملكه فكان ما أراد وإلى الله المعاد فهذه أرواح مجردة تنظرها أشباح مسندة فإذا بلغ الميقات وانقضت الأوقات ومارت السماء وكورت الشمس وبدلت الأرض وانكدرت النجوم وانتقلت الأمور وظهرت الآخرة وحشر الإنسان وغيره في الحافرة حينئذ تحمد الأشباح وتتنسم الأرواح ويتجلى الفتاح ويتقد المصباح وتشعشع الراح ويظهر الود الصراح ويزول الإلحاح ويرفرف الجناح ويكون الابتناء بالضراح من أول الليل إلى الإصباح فما أسناها من منزله وما أشهاها إلى النفوس من حالة مكملة متعنا الله بها\n\n",
    "en": "The Third Chapter: Concerning the Transcendence (تنزيه) of The Real (الحق), exalted is He, from what is contained within the words which He, glorified is He, applied to Himself in His Book and upon the tongue of His Messenger, peace and blessings be upon him, concerning anthropomorphism (التشبيه) and corporealization (التجسيم). Exalted is Allah far above what the wrongdoers say, with great exaltation.\n\nA poem concerning the servant’s gaze upon his Lord,\nIn the sanctity of the Hands and His transcendence (تنزيهه),\nAnd His elevation above instruments that came\nTo be attached to modality (كيف) and His likeness (تشبيه).\nA definitive indication that rules over\nThe station of the servant and his exaltation,\nAnd the soundness of Knowledge (العلم) and its affirmation,\nAnd the rejection of innovation and its deception.\n\n### [All Knowns are Carried by the First Intellect]\n\nKnow, may Allah support you, that all knowns (المعلومات), both high and low, are carried by the Intellect (العقل) which receives from Allah, exalted is He, without intermediary. Thus, nothing is hidden from it concerning the knowledge (علم) of the higher and lower Cosmos (الكون). From Him who bestowed its existence (وجوده) comes the soul’s (النفس) knowledge (معرفة) of things, and from His Self-disclosure (تجليه) to it, and His Light and His Most Holy Effusion (فيضه الأقدس). Therefore, the Intellect benefits from The Real (الحق), exalted is He, and benefits the Soul (النفس), and the Soul benefits from the Intellect, and from the Soul comes the Act (الفعل). This principle applies to everything to which the Intellect’s knowledge relates concerning things that are below it. We restricted this to things below it because of the benefit mentioned. Be careful in your consideration of His saying, exalted is He, <<حَتَّى نَعْلَمَ>> (Until We know), while He is the All-Knowing (العالم), and understand the reason.\n\n### [The Bewildered Realm]\n\nKnow that the Bewildered Realm (العالم المهيم) receives nothing from the First Intellect (العقل الأول), and the Intellect has no authority over the bewildered ones. Rather, they and the Intellect are in one rank, like the individuals among us who are outside the rule of the Pole (القطب), even though the Pole is one of the individuals. However, the Intellect was specialized with the function of benefiting others, just as the Pole was specialized among the individuals with the function of governance.\n\n### [The Knowledge of the Abstraction of Unity]\n\nThis principle applies to everything to which the Intellect’s knowledge relates, except for the Knowledge of the Abstraction of Unity (علم تجريد التوحيد) specifically. This knowledge differs from all other knowns (المعلومات) in every respect, since there is absolutely no suitability (مناسبة) between Allah, exalted is He, and His creation (خلقه). Even if suitability is sometimes applied to Him, as Imam Abu Hamid al-Ghazali and others applied it in their books, it is only through a kind of forced interpretation (تكلف) and a goal far removed from the Realities (الحقائق). Otherwise, what proportion is there between the originated (المحدث) and the Eternal (القديم)? Or how can He who accepts no likeness resemble that which accepts likeness? This is impossible, as Abu al-Abbas Ibn al-Arif al-Sanhaji said in *Mahasin al-Majalis* attributed to him: \"There is no relationship (نسب) between Him and the servants except Providence (العناية), and no cause (سبب) except Decree (الحكم), and no time except Eternity (الأزل). What remains is blindness and deception.\" In one narration, \"knowledge\" (علم) is used instead of \"blindness\" (عمي). Look how excellent this statement is, how complete this Gnosis (المعرفة) of Allah, and how sanctified this Witnessing (المشاهدة). May Allah benefit him by what he said.\n\n### [The Intellect’s Inability to Know Allah]\n\nTherefore, the Knowledge (العلم) of Allah is too precious for the Intellect (العقل) and the Soul (النفس) to grasp, except insofar as He is Existent (موجود), exalted and sanctified is He. Everything that is uttered concerning created beings (المخلوقات) or imagined concerning composites and others—Allah, glorified is He, in the view of the sound Intellect (العقل السليم), is contrary to that, both in its thought and its infallibility. That imagination is not permissible for Him, nor is that utterance applicable to Him intellectually, in the manner that created beings accept it. If it is applied to Him, it is only for the sake of bringing understanding closer to the minds, due to the affirmation of Existence (الوجود) for the listener, not due to the affirmation of the Reality (الحقيقة) upon which He, The Real (الحق), stands. For Allah, exalted is He, says: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him). However, it is incumbent upon us legally (شرعا) because of His saying to His Prophet, peace and blessings be upon him: <<فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله>> (So know that there is no god but Allah). He says: Know from My information, which corresponds to your contemplation, so that faith (الايمان) may be sound for you as knowledge (علما), just as knowledge was sound for you without faith, which was before the definition. He commanded him. Because of this command, according to the view and opinion of some people, we considered how we might arrive at His Gnosis (معرفته). We contemplated based on the rule of fairness and what the Perfect Intellect (العقل الكامل) yielded after its utmost possible effort and striving. We did not arrive at Gnosis (المعرفة) of Him, glorified is He, except through the inability to know Him. This is because we sought to know Him just as we seek the knowledge of all things, from the perspective of the Reality (الحقيقة) upon which the knowns (المعلومات) stand. When we knew that there is an Existent (موجود) who has no likeness, who cannot be conceived in the mind, and who cannot be grasped, how can the Intellect comprehend Him? This is impermissible, despite the affirmation of the knowledge of His Existence (وجوده). We know that He is an Existent, One in His Divinity (ألوهته). This is the Knowledge (العلم) that was required of us, without knowing the Reality of His Essence (حقيقة ذاته) upon which He, glorified is He, knows Himself. This is the knowledge of the absence of knowledge (العلم بعدم العلم) that was required of us. Since He, exalted is He, does not resemble anything among the created beings (المخلوقات) in the view of the Intellect, nor does anything resemble Him, the first thing incumbent upon us when we were told, \"So know that there is no god but Allah,\" was to know what Knowledge (العلم) is. We have known it. Thus, we have known what is incumbent upon us concerning the knowledge of Knowledge first. *End of the Eighth Part, and praise be to Allah.*\n\n***\n\n*In the Name of Allah, the Most Compassionate, the Most Merciful.*\n\n### [The Fundamental Scientific Demands]\n\nLet us say that since the fundamental demands (أمهات المطالب) are four: *Is it?* (هل), *What is it?* (ما), *How is it?* (كيف), and *Why is it?* (لم). *Is it?* and *Why is it?* are simple spiritual demands (مطلبان روحانيان بسيطان) accompanied by *What is it?* *Is it?* and *Why is it?* are the two sound origins for simple things (للبسائط), because *What is it?* specifically involves a kind of composition (تركيب). Among these four demands, there is no demand by which one ought to inquire about Allah, exalted is He, from the perspective of what Reality (الحقيقة) yields. This is because nothing can be known from the Science of Unity (علم التوحيد) except the negation of what is found in everything other than Him, glorified is He. For this reason, He said: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him) and <<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Glorified be your Lord, the Lord of Might, above what they describe).\n\n### [Knowledge by Negation is Knowledge of Allah]\n\nKnowledge by negation (العلم بالسلب) is the Knowledge (العلم) of Allah, glorified is He. Just as it is impermissible for us to ask *How?* concerning the Spirits (الأرواح)—for they are sanctified beyond that because their realities (حقائقها) contradict this expression—likewise, the instruments (الأدوات) used to inquire about the Spirits cannot be applied to Allah, exalted is He. It is not fitting for the realized Monotheist (المحقق الموحد) who respects the Presence (حضرة) of his Originator and Inventor to apply these terms to Him. Therefore, He is never known by these demands.\n\n### A Section: That which is Perceived by its Essence, That which is Perceived by its Act, and That which is Not Perceived at all\n\nFurthermore, we also examined everything other than The Real (الحق), exalted is He, and found it to be of two types: a type that is perceived by its Essence (ذاته), which is the sensible (المحسوس) and the dense (الكثيف); and a type that is perceived by its Act (فعله), which is the intelligible (المعقول) and the subtle (اللطيف). The intelligible is elevated above the sensible by this station, which is the transcendence (التنزه) of being perceived by its Essence; rather, it is perceived by its Act. Since these are the descriptions of created beings (المخلوقين), The Real (الحق), exalted is He, is sanctified beyond being perceived by His Essence (ذاته) like the sensible, or by His Act (فعله) like the subtle or the intelligible. This is because there is absolutely no suitability (مناسبة) between Him, glorified is He, and His creation (خلقه). His Essence (ذاته) is not perceived by us so as to resemble the sensible, nor is His Act like the act of the subtle so as to resemble the subtle. This is because the Act of The Real (فعل الحق) is the origination (إبداع) of a thing from no thing, while the act of the spiritual subtle (اللطيف الروحاني) is the creation of a thing from things. What suitability is there between them? If resemblance is impossible in the Act, it is even more fitting that resemblance be impossible in the Essence (الذات). If you wish to verify something of this section, look at the effect (مفعول) of the act according to the types of effects. For example, the industrial effect, such as a shirt or a chair: we find that its maker is not known, except that the effect itself indicates the existence of its maker and his knowledge of his craft. Likewise, the formative effect (المفعول التكويني), which is the celestial sphere (الفلك) and the stars: they do not know their Former (مكونهم) or their Composer, who is the All-Encompassing Universal Soul (النفس الكلية المحيطة بهم). Likewise, the natural effect (المفعول الطبيعي), such as the generated things (الموالد) of minerals, plants, and animals, which act naturally from the formative effect: they have no awareness of their Agent, who is the celestial sphere and the stars. The knowledge of the celestial spheres is not what you see of their mass (جرمها) or what the sense (الحس) perceives of them. Where is the mass of the sun itself compared to its appearance in the eye of the viewer among us? Rather, the knowledge of the celestial spheres is from the perspective of their spirit (روحها) and their meaning (معناها) which Allah, exalted is He, originated for them from the All-Encompassing Universal Soul (النفس الكلية المحيطة) which is the cause (سبب) of the celestial spheres and what is in them. Likewise, the emanative effect (المفعول الانبعاثي), which is the Universal Soul (النفس الكلية) emanating from the Intellect (العقل)—like the emanation of the egg-shaped form from the Gabrielic Reality (الحقيقة الجبرئيلية)—does not know that from which it emanated at all, because it is under its encompassing power, and the Intellect encompasses it, as the Soul is a thought (خاطر) among its thoughts. How then can it know what is above it, and what is not in it except what is already there? Thus, it only knows what it is upon. It knows its own soul, not its cause. Likewise, the creative origination effect (المفعول الإبداعي), which is the Muhammadan Reality (الحقيقة المحمدية) according to us, and the First Intellect (العقل الأول) according to others—which is the Supreme Pen (القلم الأعلى) that Allah originated from no thing—is more incapable and prevented from grasping its Agent than every effect mentioned previously. This is because between every effect and its agent mentioned previously, there is some kind of suitability (مناسبة) and resemblance (المشاكلة). Therefore, the effect must know the agent to the extent of the suitability between them, whether from the perspective of substantiality (الجوهرية) or otherwise. But there is no suitability between the First Originator (المبدع الأول) and The Real (الحق), exalted is He. Thus, the First Originator is more incapable of knowing its Agent than the effects of causes, since the effect that resembles its causal agent in certain respects has already failed to grasp and know it. Understand this and verify it, for it is extremely beneficial in the chapter of Unity (التوحيد) and the inability of originated knowledge (العلم المحدث) to relate to Allah, exalted is He.\n\n### A Section: The Five Faculties and their True Perceptions\n\nWhat we have mentioned is supported by the fact that the human being only perceives all knowns (المعلومات) by one of the five faculties (القوي الخمس): the sensory faculty (القوة الحسية), which consists of five: smell, taste, touch, hearing, and sight. Sight perceives colors, colored things, and forms (الأشخاص) within a known limit of proximity and distance. What is perceived at one mile is different from what is perceived at two miles, and what is perceived at twenty cubits is different from what is perceived at one mile, and what is perceived when the hand is in one’s hand, facing one, is different from what is perceived at twenty cubits. What is perceived at two miles is a form, but one does not know whether it is a human or a tree. At one mile, one knows it is a human. At twenty cubits, one knows whether it is white or black. When facing it, one knows whether it is blue or kohl-eyed. The rest of the senses are similar in their perceptions of proximity and distance. The Creator (الباري), glorified is He, is not sensible (محسوس)—that is, He is not perceived by the sense (الحس) according to us when we seek Gnosis (المعرفة) of Him. Thus, we do not know Him through the path of sense. As for the imaginative faculty (القوة الخيالية), it only comprehends what the sense has given it, either in the form that the sense gave it, or in the form that thought (الفكر) gave it by relating some sensible things to others. The method of the people of thought (أهل الفكر) in knowing The Real ends here; it is their language, not ours, even if it is true, but we attribute it to them because it was transmitted from them. This faculty never departs from the sense (الحس) in its perception, no matter what. Since the relation of the sense to Allah is nullified for us, the relation of the imagination (الخيال) to Him is also nullified. As for the cogitative faculty (القوة المفكرة), a human never thinks except about things already existing with him, which he received through the senses and the first principles of the Intellect (أوائل العقل). From thinking about them in the treasury of the Imagination (خزانة الخيال), he gains knowledge (علم) of another matter that has a suitability (مناسبة) between it and the things he thought about. But there is no suitability between Allah and His creation (خلقه). Therefore, knowledge of Him through the path of thought is not sound. For this reason, scholars forbade thinking about the Essence (ذات) of Allah, exalted is He. As for the intellectual faculty (القوة العقلية), it is not sound for the Intellect to grasp Him. The Intellect only accepts what it knows intuitively (بديهة) or what thought has given it. Since the perception by thought is nullified for Him, the perception by the Intellect through the path of thought is also nullified. However, the Intellect, whose limit is only to comprehend and grasp what it has acquired, may be gifted Gnosis (المعرفة) of Him by The Real (الحق), and it comprehends it because it is an Intellect, but not through the path of thought. We do not deny this, for this Gnosis (المعرفة) that The Real gifts to whomever He wills among His servants is not independently grasped by the Intellect, but the Intellect accepts it. No proof or demonstration can be established for it because it is beyond the scope of the Intellect’s perceptions. Furthermore, these essential descriptions (الأوصاف الذاتية) cannot be expressed in language because they are outside of analogy (التمثيل) and comparison (القياس), for <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him). Every Intellect that has not been unveiled (كشف) to anything of this Gnosis asks another Intellect to whom it has been unveiled, but the questioned Intellect does not have the power to express it, nor is it possible. Therefore, Al-Siddiq (Abu Bakr) said: \"The inability to grasp the grasping is Gnosis (إدراك).\" This statement has two levels, so understand. Whoever seeks Allah with his Intellect through the path of thought and contemplation is lost. His utmost is only the preparedness (التهيؤ) to accept what Allah gifts of that Gnosis, so understand. As for the faculty of memory (القوة الذاكرة), there is no way for it to grasp the Knowledge of Allah, for it only remembers what the Intellect knew before, then became heedless or forgot. Since it never knew Him, there is no way for the faculty of memory to reach Him. The perceptions of the human being are confined to what he is as a human, what his essence yields, and what he has earned therein. What remains is only the preparedness of the Intellect to accept what The Real, majestic and exalted, gifts of His Gnosis (معرفته). Therefore, He is never known through demonstration except for the knowledge of Existence (الوجود) and that He is the One Worshipped, nothing else. The perceiving human (الإنسان المدرك) can never perceive anything unless its like (مثله) exists within him. Were it not for that, he would never perceive it or know it. If he only knows something when the like of that known thing is within him, then he only knows what resembles and is suitable to him. The Creator (الباري), exalted is He, does not resemble anything, nor is there anything like Him in anything. Thus, He is never known.\n\n### [Natural Things Only Accept Nourishment from their Likes]\n\nWhat supports what we have mentioned is that natural things (الأشياء الطبيعية) only accept nourishment (الغذاء) from their likes (مشاكلها). As for what does not resemble them, they absolutely do not accept nourishment from it. For example, the generated things (الموالد) of minerals, plants, and animals are composed of the four natures (الطبائع الأربع), and the generated things only accept nourishment from them because they have a share of them. If any creature attempted to make the nourishment of his body, which is composed of these natures, from something that originated from outside these natures or what is composed of them, he would not be able to. Just as it is impossible for any natural body to accept nourishment except from something that belongs to the natures from which it is composed, likewise, it is impossible for anyone to know something of which there is absolutely no like within him. Do you not see that the Soul (النفس) only accepts from the Intellect (العقل) what it shares and resembles with it? What it does not share with it, it never knows from it. There is nothing of Allah in anyone, and that is not permissible for Him in any respect. Therefore, no one knows Him through his own soul or his thought.\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Allah veiled Himself from the intellects (العقول) just as He veiled Himself from the sights (الأبصار). And the Highest Assembly (الملأ الأعلى) seeks Him just as you seek Him.\"\n\nHe, peace be upon him, informed us that the Intellect did not grasp Him through its thought, nor through the eye of its insight, just as the sight did not grasp Him. This is what we alluded to earlier in our chapter. So, praise be to Allah for what He inspired and for teaching us what we did not know. The bounty of Allah has been great.\n\n### [Transcendence and the Negation of Likeness and Anthropomorphism]\n\nThis is how transcendence (التنزيه) and the negation of likeness (المماثلة) and anthropomorphism (التشبيه) should be. Those who went astray among the anthropomorphists (المشبهة) only did so through interpretation (التأويل) and by applying the verses and reports (الآيات والأخبار) to what first occurs to the minds, without considering the transcendence (التنزيه) that is incumbent upon Allah, exalted is He. This led them to pure ignorance and manifest disbelief. If they had sought safety and left the reports and verses as they came, without deviating from them at all, entrusting the knowledge of that to Allah, exalted is He, and His Messenger, and saying, \"We do not know,\" the saying of Allah, exalted is He, <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) would have sufficed them. Whenever a hadith came to them containing anthropomorphism (تشبيه), it implied that Allah resembled something, yet He, glorified is He, negated resemblance from Himself. Thus, it remains that that report has a face of transcendence (وجه من وجوه التنزيه) known to Allah, exalted is He, and it was brought for the understanding of the Arab whose tongue the Quran was revealed in. You will never find a single phrase in a report or a verse that is an explicit text (نصا) for anthropomorphism. Rather, you find that among the Arabs, it bears multiple faces, some of which lead to anthropomorphism and some of which lead to transcendence. The interpreter’s application of that term to the face that leads to anthropomorphism is an injustice (جور) on his part toward that term, as he did not fulfill its right according to its placement in the language, and an aggression against Allah, exalted is He, since he applied to Him, glorified is He, what is unfitting for Him. We shall, if Allah wills, present some hadiths that have been reported concerning anthropomorphism, showing that they are not explicit texts for it. <<فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ فَلَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ>> (For Allah is the conclusive argument. Had He willed, He would have guided you all.)\n\n### [Anthropomorphism and Corporealization in the Terms of the Sunnah]\n\n\"The heart of the believer is between two fingers (أصبعين) of the Fingers of Allah.\"\n\nThe Intellect’s view, based on the requirement of literal and metaphorical usage: A limb (الجارحة) is impossible for Allah, exalted is He. The word *finger* (الإصبع) is a shared term (لفظ مشترك). It is applied to a limb and applied to a blessing (النعمة).\n\nThe poet Al-Ra'i said:\n> Weak of staff, with veins showing, you see for him\n> Upon it, when people are barren, a finger.\n\nHe means: you see for him upon it a good effect (أثرا حسنا) of blessing (النعمة) due to his good supervision over it. The Arabs say, \"How excellent is the *finger* of so-and-so upon his wealth,\" meaning his effect (أثره) therein, intending the growth of his wealth due to his good management of it. The quickest turning is that which the fingers turn, due to their small size and complete power in them, so their movement is faster than the movement of the hand or other things. Since Allah’s turning (تقليب) of the hearts of the servants is the fastest thing, the Prophet, peace and blessings be upon him, expressed it to the Arabs in his supplication using what they could comprehend. And because turning (التقليب) only occurs by the hand according to us, the turning was therefore attributed to the fingers, because the fingers are part of the hand, and speed is more inherent in the fingers.\n\nThe Prophet, peace and blessings be upon him, used to say in his supplication: \"O Turner of the hearts (يا مقلب القلوب), make my heart firm upon Your religion.\"\n\nAllah’s turning of the hearts is what He creates within them of the inclination toward good and the inclination toward evil. Since the human feels the succession of conflicting thoughts (الخواطر المتعارضة) in his heart, which is the expression for The Real (الحق) turning the heart, and the human cannot repel the knowledge of this from himself, therefore, the Prophet, peace and blessings be upon him, used to say: \"O Turner of the hearts, make my heart firm upon Your religion.\" In this hadith, one of his wives said to him, \"Do you fear, O Messenger of Allah?\" He, peace and blessings be upon him, replied: \"The heart of the believer is between two fingers of the Fingers of Allah.\"\n\nHe, peace and blessings be upon him, is referring to the speed of the turning from faith (الايمان) to disbelief (الكفر) and what lies beneath them. Allah, exalted is He, said: <<فَأَلْهَمَها فُجُورَها وتَقْواها>> (And inspired it [the soul] with its wickedness and its righteousness). This inspiration (الإلهام) is the turning (التقليب). The fingers (الأصابع) signify speed, and the duality (الاثنينية) signifies the thought of good (خاطر الحسن) and the thought of evil (خاطر القبيح). If one understands from the fingers what I have mentioned, and one also understands the limb (الجارحة), and one understands the blessing and the good effect, then by what face do you attach it to the limb? These transcendent faces demand it. Either we remain silent and entrust the knowledge of that to Allah, exalted is He, and to whomever The Real has made known of it, whether a sent Messenger or an inspired Saint (ولي ملهم), with the necessary condition of negating the limb; or, if we are overcome by superfluousness, except that we respond thereby to an innovator who corporealizes (مجسم) and anthropomorphizes (مشبه), then it is not superfluous, but rather incumbent upon the scholar at that time to clarify the faces of transcendence (وجوه التنزيه) in that term, so that he may refute the argument of the forsaken corporealist. May Allah accept our repentance and his, and grant him Islam. If we must speak about that word which suggests anthropomorphism, then turning its explanation toward the face that is fitting for Allah, glorified is He, is more appropriate. This is the share of the Intellect in the usage.\n\n### A Breathing of Spirit into the Breast: The Heart’s Share of the Two Fingers\n\nThe two fingers (الإصبعان) are the secret of Essential Perfection (سر الكمال الذاتي). When this secret is unveiled to the sights on the Day of Resurrection, the human will take his father, if he was a disbeliever, and throw him into the Fire, feeling neither pain nor compassion for him, by the secret of these two fingers, whose meaning is unified but whose wording is dual. Paradise and the Fire were created, and the Names of the Illuminator (المنور) and the Darkener (المظلم), the Bestower of Grace (المنعم) and the Avenger (المنتقم), appeared. Do not imagine them as two out of ten. It is necessary to allude to this secret in this chapter: *Both His Hands are Right* (كلتا يديه يمين). This is the Gnosis of Unveiling (معرفة الكشف). For the people of Paradise have two kinds of bliss: bliss in Paradise, and bliss in the torment of the people of the Fire in the Fire. Likewise, the people of the Fire have two kinds of torment. Both groups see Allah with the vision of the Names (رؤية الأسماء), just as they did in the world. The two grips (القبضتين) that came from the Messenger of Allah, peace and blessings be upon him, concerning The Real (الحق) contain the secret we alluded to and its meaning. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).\n\nThe Grip (القبضة) and the Right Hand (اليمين). Allah, exalted is He, said: <<وَالْأَرْضُ جَمِيعاً قَبْضَتُهُ ... وَالسَّماواتُ مَطْوِيَّاتٌ بِيَمِينِهِ>> (And the whole earth will be His grip... and the heavens rolled up in His Right Hand). The Intellect’s view based on usage: He first forbade, glorified is He, that His measure be estimated, due to the anthropomorphism (التشبيه) and corporealization (التجسيم) that occurs to weak intellects upon the arrival of verses and reports which, from one perspective, suggest that. Then, after this transcendence (التنزيه) which only the knowing ones comprehend, He said: <<وَالْأَرْضُ جَمِيعاً قَبْضَتُهُ>> (And the whole earth will be His grip). We know from the usage of the Arabic language that it is said, \"So-and-so is in my grip,\" meaning he is under my rule, even if nothing of him is physically in my hand, but my command concerning him is executed and my decree upon him is passed, like my decree upon what my hand physically owns and grips. Likewise, I say, \"My wealth is in my grip,\" meaning in my possession, and I am empowered to dispose of it—that is, it does not prevent itself from me. If I dispose of it, at the time of my disposal, it is more appropriate for me to say it is in my grip because of my disposal over it, even if my servants are the ones disposing of it by my permission. Since a limb (الجارحة) is impossible for Allah, exalted is He, the Intellect turned to the spirit and meaning of the Grip (القبضة) and its benefit, which is the ownership of what is gripped immediately, even if the gripper has nothing physical of what is gripped, but it is definitively in the ownership of the Grip. Thus, the World (العالم) is in the Grip of The Real (الحق), exalted is He. The Earth in the Hereafter is the designation of a specific possession, just as we say, \"My servant is in my grip,\" even though my servant is among the totality of those in my grip; I only mentioned him specifically due to the occurrence of a certain event. The Right Hand (اليمين) according to us is the place of absolute, powerful disposal, for the Left Hand (اليسار) does not possess the strength of the Right Hand. Thus, the Right Hand is a metaphor for the ability to roll up (الطي). It is an indication of the power’s ability to act. This reached the understanding of the Arabs through terms they knew and quickly accepted.\n\nThe poet said:\n> When a banner is raised for glory,\n> Uraba receives it with the Right Hand.\n\nGlory (المجد) does not have a sensible banner, so a physical right limb does not receive it. It is as if he says: If glory had a sensible banner, its place or carrier would only be the right hand of Uraba al-Awsi—meaning the attribute of glory is established in him and complete in him. The Arabs have always applied the terms for limbs (الجوارح) to what does not accept a limb, due to a shared meaning between them.\n\n### A Breathing of Spirit into the Breast: The Heart’s Share of the Right and Left\n\nWhen The Real (الحق) discloses Himself (تجلى) to the secret of a servant, He makes him master of all secrets and joins him to the free ones (الأحرار), and he has Essential Disposal (التصرف الذاتي) from the perspective of the Right Hand (اليمين), for the honor of the Left Hand (الشمال) is through another, while the honor of the Right Hand is through its Essence (ذاته). Then, He lowered the honor of the Right Hand through address (الخطاب) and the honor of the Left Hand through Self-disclosure (التجلي). The honor of the human is through his Gnosis (معرفته) of his Reality (حقيقته) and his awareness of it, which is the Left Hand (اليسار). Both His Hands are Right (كلتا يديه يمين) from the perspective that He is North (شمال) [i.e., the side of creation]. Return to the meaning of Unity (الاتحاد): Both hands of the servant are Right. Return to Monotheism (التوحيد): One of his hands is Right and the other is Left.\n\nThus, sometimes I am in the Gathering (الجمع) and the Gathering of the Gathering (جمع الجمع), and sometimes I am in the Separation (الفرق) and the Separation of the Separation (فرق الفرق), according to the rule of the Self-disclosure (التجلي) and the incoming spiritual state (الوارد).\n\n> One day I am Yemeni if I meet one of Yemen,\n> And if I meet one of Ma'add, then I am Adnani.\n\nAnd from this are Wonder (التعجب), Laughter (الضحك), Joy (الفرح), and Wrath (الغضب). Wonder only occurs from an existent being who does not know the object of wonder and then comes to know it, and thus wonders at it. Laughter is attached to this. This is impossible for Allah, exalted is He, for nothing escapes His Knowledge (علمه). Whenever something occurs in existence that is capable of causing wonder according to us, that wonder and laughter are applied to Him upon whom wonder and laughter are impermissible, because the actual event is wondrous according to us—like a young man who has no youthful folly. This is a matter of wonder. Thus, it took the place with Allah, exalted is He, of what causes wonder according to us. Laughter and joy may also refer to acceptance and satisfaction (القبول والرضي). If someone shows you laughter and joy because of an action you performed for him, he has accepted that action and is satisfied with it. Therefore, His laughter and joy, exalted is He, are His acceptance and satisfaction with us. Likewise, His wrath (غضبه), exalted is He, is transcendent (منزه) from the boiling of the heart’s blood in pursuit of vengeance, because He, glorified is He, is sanctified beyond corporeality (الجسمية) and accident (العرض). That may refer to His performing the act of one who is wrathful among those for whom wrath is permissible, which is His vengeance (انتقامه) upon the tyrants, those who disobey His command, and those who transgress His limits. He, exalted is He, said: <<وَغَضِبَ عَلَيْهِ>> (And His wrath was upon him)—meaning He recompensed him with the recompense of the wrathful one. The Recompenser is thus wrathful. The appearance of the Act (الفعل) gave rise to the Name.\n\n**From the Chapter of Joy**\n\nIt is reported in the tradition that Allah smiles (يتبشبش) at the man who frequents the mosques for prayer and remembrance (الذكر).\n\nWhen the people of the worlds (العالم بالأكوان) were veiled and occupied with other than Allah away from Allah, they were, by this act, in a state of absence (غيبة) from Allah. When they returned to Him, glorified is He, with a type of presence (حضور), He, glorified is He, poured into their hearts the pleasure of the bliss of His presence (محاضرته), His intimate converse (مناجاته), and His witnessing (مشاهدته), by which He endeared Himself to their hearts.\n\nThe Prophet, peace and blessings be upon him, said: \"Love Allah for what He nourishes you with of His blessings.\"\n\nThe smiling (التبشبش) is a metaphor for this Act of His, because it is the manifestation of joy at your arrival to Him. For whoever is pleased by your arrival, the sign of his pleasure is the manifestation of kindness toward you, endearment, and the sending of His blessings upon you. When these things appeared from Allah to the servants who approached Him, He called it smiling (*tabashbush*).\n\nAllah, exalted is He, said: <<فَنَسِيَهُمْ>> (So He forgot them). The Creator (الباري), exalted is He, is not subject to forgetfulness (النسيان). However, when He, exalted is He, tormented them with eternal torment and His mercy did not reach them, they became as if they were forgotten by Him, and He was as if He had forgotten them—meaning, this is the act of the forgetful one, and one who does not recall the painful torment they are in. This is because in their worldly life, <<نَسُوا الله>> (they forgot Allah), so He recompensed them with their own act, returning their act upon them due to suitability (للمناسبة). It may also be that \"He forgot them\" means He delayed them. \"They forgot Allah\" means they delayed the command of Allah and did not act upon it. Allah delayed them in the Fire when He brought out of it those whom He had admitted into it from others. Close to this chapter is the attribution of cunning (المكر), mockery (الاستهزاء), and derision (السخرية) to The Real. He, exalted is He, said: <<سَخِرَ الله مِنْهُمْ>> (Allah mocked them), and He said: <<وَمَكَرَ الله>> (And Allah planned), and He said: <<الله يَسْتَهْزِئُ بِهِمْ>> (Allah mocks them).\n\nThe Prophet, peace and blessings be upon him, said: \"Do not curse the wind, for it is from the Breath (نفس) of the Merciful (الرحمن).\"\n\nAnd his saying, peace and blessings be upon him: \"Indeed, I find the Breath (نفس) of the Merciful coming to me from the direction of Yemen.\"\n\nThis all refers to relief/alleviation (التنفيس). It is as if he says: Do not curse the wind, for it is among the things by which the Merciful grants relief (ينفس) to His servants. And he, peace and blessings be upon him, said: \"I was made victorious by the East wind (الصبا).\" He means: I find the *nafas* (relief/alleviation) of the Merciful concerning the distress (الكرب) he was in due to his people’s denial of him and their rejection of Allah’s command, coming from the direction of Yemen. Thus, the Ansar (Helpers) were Allah’s relief (نفس الله) for His Prophet, peace and blessings be upon him, from the distress caused by the deniers. Allah, exalted is He, is transcendent (منزه) beyond the *nafas* which is the air exiting the breather. Exalted is Allah far above what the wrongdoers attribute to Him of that, with great exaltation.\n\nThe term *Surah* (صورة - Form/Image) is applied to the command, to what is known among people, and to other things. It is reported in the authentic and other hadiths that the Form is attributed to Allah.\n\nLike the hadith of Ikrimah, peace and blessings be upon him, who said: \"I saw my Lord in the form of a young man.\"\n\nThis is a state (حال) experienced by the Prophet, peace and blessings be upon him, and it is known and customary in the speech of the Arabs. Likewise, his saying, peace and blessings be upon him: \"Indeed, Allah created Adam upon His Form (صورته).\"\n\nKnow that the likeness (المثلية) mentioned in the Quran is linguistic (لغوية), not intellectual (عقلية), because intellectual likeness is impossible for Allah, exalted is He. [Example:] \"Zayd is the lion in intensity,\" or \"Zayd is Zuhayr in poetry.\" When you describe an existent being with one or two attributes, and then describe another with that same attribute, even if there is a difference between them in terms of other realities, they share the spirit and meaning of that attribute. Thus, each one is upon the form (صورة) of the other specifically in that attribute. Understand and be aware. Look at your being a proof (دليلا) for Him, glorified is He. Have you described Him with any attribute of perfection except that it originated from you? Be insightful. If you enter through the door of stripping away comparison (التعرية عن المناظرة), you negate the deficiencies that are permissible for you from Him, even though they never existed in Him. However, because the corporealist (المجسم) and the anthropomorphist (المشبه) attributed them to Him, you negated that attribution. If this misconception had not existed, you would not have performed any of this negation. Know that although the term *Form* (الصورة) has many possible interpretations here, we have refrained from mentioning them, preferring brevity in what we intended in this book. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).\n\nIt is reported from the Prophet, peace and blessings be upon him, that the molar tooth of the disbeliever in the Fire will be like Mount Uhud, and the thickness of his skin will be forty cubits by the cubit of the Almighty (ذراع الجبار).\n\nThis is an attribution of honor (تشريف مقدار)—a measure that Allah, exalted is He, established and attributed to Himself. Just as you say, \"This thing is so many cubits by the cubit of the King,\" meaning the largest cubit that the King established. Even if the King’s cubit, which is the limb (الجارحة), is like the cubits of other people, the cubit he established as a measure exceeds the limb-cubit by half or a third. Therefore, it is not His cubit in its literal reality, but rather a measure He established and then attributed to its Establisher. Know this. *Al-Jabbar* (الجبار) in the language means the Great King.\n\n\"The Almighty (الجبار) places His Foot (قدمه) therein.\" *Qadam* (قدم) means a limb (الجارحة). It is also said, \"So-and-so has a *qadam* in this matter,\" meaning stability (ثبوت). *Qadam* also means a group of creation. Thus, *qadam* is an attribution. *Al-Jabbar* may also mean a King, and this *qadam* belongs to this King, since a limb is impossible for Allah, exalted and majestic is He.\n\n**And the Ascent (الاستواء - Istiwa')**\n\n*Istiwa'* (الاستواء) also refers to settling (الاستقرار), intending (القصود), and dominating (الاستيلاء). Settling is an attribute of bodies (الأجسام), so it is impermissible for Allah, exalted is He, unless it is understood as affirmation (الثبوت). Intending is the Will (الإرادة), which is an attribute of perfection. He said: <<ثُمَّ اسْتَوى‏ إِلَى السَّماءِ>> (Then He intended [قصد] toward the heaven). And <<اسْتَوى‏ عَلَى الْعَرْشِ>> (He established Himself [استولى] upon the Throne) means He dominated.\n\n> Bishr has dominated (استوى) Iraq,\n> Without a sword or blood spilled.\n\nThe reports and verses are numerous, some authentic and some weak. There is no report among them that does not have a face of transcendence (وجه من وجوه التنزيه). If you wish to make this easier for yourself, take the term that suggests anthropomorphism, and take its benefit and its spirit (روحها) or what results from it, and apply that to The Real (الحق). You will attain the degree of transcendence (التنزيه) while others attained the grasp of anthropomorphism (التشبيه). Do this, and purify your garment. This much suffices concerning these reports, for the chapter has become long.\n\n### A Breathing of the Most Holy Spirit into the Most Precious Breast: The Symbolic Meaning of the Terms of Anthropomorphism in the Language of the Law\n\nConcerning the terms mentioned previously: When the one who wonders (المتعجب) wonders at one who emerged upon his form (صورته) and differed from him in his inner secret (سريرته), He rejoiced (فرح) at his existence and laughed (ضحك) at his witnessing (شهوده), and became wrathful (غضب) at his turning away, and smiled (تبشبش) at his drawing near, and forgot (نسي) his outward appearance, and breathed (تنفس) [i.e., granted relief], and released his restraints, and remained firm (ثبت) upon His dominion, and ruled by decree over His kingdom. Thus, what He willed came to be, and to Allah is the return. These are pure spirits (أرواح مجردة) that are contemplated as attributed forms (أشباح مسندة). When the appointed time is reached, and the periods are concluded, and the heaven is convulsed, and the sun is wrapped up, and the earth is changed, and the stars are scattered, and affairs are transferred, and the Hereafter appears, and man and others are gathered in the hollow—at that time, the forms (الأشباح) will be praised, and the spirits (الأرواح) will breathe, and the Opener (الفتاح) will disclose Himself, and the lamp will be lit, and the wine will sparkle, and pure affection (الود الصراح) will appear, and insistence will cease, and the wing will flutter, and the building will be established by the clamor (الضراح) from the beginning of the night until morning. What a lofty station, and what a desirable, complete state for the souls! May Allah grant us enjoyment of it.",
    "ur": "«باب سوم: حق تعالیٰ کو ان کلمات کے باطن میں موجود تشبیہ سے پاک قرار دینے کے بیان میں»\n\nجو (کلمات) اللہ سبحانہ نے اپنی کتاب میں اور اپنے رسول صلی اللہ علیہ وسلم کی زبان پر اس کے لیے تشبیہ (التشبيه) اور تجسیم (التجسيم) کے طور پر جاری کیے ہیں۔ اللہ تعالیٰ ظالموں کے قول سے بہت بلند و برتر ہے۔\n\n> یہ نظم بندے کے اپنے رب کی طرف نظر کے بارے میں ہے،\n> اس کے ہاتھوں کی پاکیزگی اور اس کی تنزیہ (التنزيه) میں۔\n> اور اس کا ان آلات سے بلند ہونا جو آئے ہیں،\n> جو کیفیت اور اس کی تشبیہ سے تعلق رکھتے ہیں۔\n> یہ ایک ایسی قطعی دلیل ہے جو بندے کے مقام اور اس کی عظمت پر حکم لگاتی ہے،\n> اور علم کی صحت اور اس کے اثبات پر،\n> اور بدعت اور اس کے فریب کو رد کرنے پر۔\n\n### [تمام معلومات کو عقل اول (العقل الأول) نے اٹھایا]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ تمام معلومات، خواہ وہ بلند ہوں یا پست، ان کا حامل عقل (العقل) ہے جو حق تعالیٰ (الحق) سے بلاواسطہ اخذ کرتا ہے۔ چنانچہ اس سے عالم بالا اور عالم اسفل کا کوئی علم پوشیدہ نہیں رہا۔ اور جس نے اسے اپنا وجود بخشا، اسی کے ظہور الٰہی (التجلی)، اس کے نور اور اس کے فیض اقدس سے نفس (النفس) کو اشیاء کی معرفت (المعرفۃ) حاصل ہوتی ہے۔ پس عقل (العقل) حق تعالیٰ (الحق) سے مستفید ہوتا ہے اور نفس (النفس) کو فائدہ پہنچاتا ہے، اور نفس (النفس) عقل سے مستفید ہوتا ہے، اور اسی سے فعل صادر ہوتا ہے۔ اور یہ اصول ان تمام چیزوں میں جاری ہے جن کا علم عقل کو ان اشیاء سے متعلق ہے جو اس سے کم درجے کی ہیں۔ اور ہم نے \"جو اس سے کم درجے کی ہیں\" کی قید صرف اس افادیت کی وجہ سے لگائی ہے جس کا ہم نے ذکر کیا۔ اور آپ اللہ تعالیٰ کے اس قول پر غور کرنے میں احتیاط برتیں: \"حَتَّى نَعْلَمَ\" (یہاں تک کہ ہم جان لیں) حالانکہ وہ تو پہلے ہی جاننے والا ہے، پس اس کا سبب پہچانیں۔\n\n### [عالم مہیم (العالم المهيم)]\n\nاور جان لیجیے کہ عالم مہیم (العالم المهيم) عقل اول (العقل الأول) سے کچھ بھی مستفید نہیں ہوتا، اور نہ ہی مہیمین (مہیمین) پر اس کا کوئی تسلط ہے۔ بلکہ وہ اور مہیمین ایک ہی مرتبے میں ہیں، جیسے ہم میں سے وہ افراد جو قطب کے حکم سے باہر ہوتے ہیں۔ اگرچہ قطب بھی افراد میں سے ایک ہوتا ہے، لیکن عقل کو افادیت کے لیے خاص کیا گیا، جیسے قطب کو افراد میں سے ولایت کے لیے خاص کیا گیا۔\n\n### [علم تجرید التوحید]\n\nاور یہ (اصول) ان تمام چیزوں میں جاری ہے جن کا علم عقل سے متعلق ہے، سوائے خاص علم تجرید التوحید کے۔ کیونکہ یہ تمام معلومات سے ہر لحاظ سے مختلف ہے، اس لیے کہ حق تعالیٰ (الحق) اور اس کی مخلوق کے درمیان قطعاً کوئی مناسبت نہیں ہے۔ اور اگر کبھی اس پر مناسبت کا اطلاق کیا بھی جائے، جیسا کہ امام ابو حامد الغزالی نے اپنی کتب میں اور دوسروں نے کیا ہے، تو یہ ایک طرح کی تکلف اور حقائق سے دور کی بات ہے۔ ورنہ، حادث (مخلوق) اور قدیم (ذات حق) کے درمیان کیا نسبت ہو سکتی ہے؟ یا جو مثل کو قبول نہیں کرتا، وہ اس سے کیسے مشابہ ہو سکتا ہے جو مثل کو قبول کرتا ہے؟ یہ محال ہے۔ جیسا کہ ابو العباس ابن العریف الصنہاجی نے اپنی کتاب \"محاسن المجالس\" میں کہا ہے جو ان سے منسوب ہے: \"اس (حق) اور بندوں کے درمیان عنایت کے سوا کوئی نسب نہیں، اور حکم کے سوا کوئی سبب نہیں، اور ازل کے سوا کوئی وقت نہیں۔ اور جو باقی ہے وہ اندھا پن اور فریب ہے۔\" اور ایک روایت میں \"فعلم\" (تو علم ہے) \"فعمی\" (تو اندھا پن ہے) کی جگہ آیا ہے۔ پس دیکھیے کہ یہ کلام کتنا عمدہ ہے اور اللہ کی یہ معرفت (المعرفۃ) کتنی کامل ہے اور یہ مشاہدہ کتنا پاکیزہ ہے۔ اللہ اسے اس کے قول سے نفع دے۔\n\n### [معرفت الٰہی سے عقل کا عاجز ہونا]\n\nپس اللہ کا علم عقل (العقل) اور نفس (النفس) کے ادراک سے بلند ہے، سوائے اس کے کہ وہ موجود ہے، وہ بلند و برتر ہے۔ اور ہر وہ چیز جو مخلوقات کے حق میں بولی جاتی ہے یا مرکبات وغیرہ میں وہم کی جاتی ہے، تو سلیم عقل کی نظر میں، اس کی فکر اور اس کی عصمت کے لحاظ سے، اللہ سبحانہ اس کے برعکس ہے۔ اس پر وہ وہم جائز نہیں اور نہ ہی وہ لفظ اس پر عقلی طور پر اس پہلو سے جاری ہو سکتا ہے جسے مخلوقات قبول کرتی ہیں۔ اگر اس پر اطلاق کیا بھی جائے تو وہ صرف فہم کو قریب کرنے کے لیے ہے تاکہ سننے والے کے نزدیک ہستی (الوجود) کا ثبوت ہو جائے، نہ کہ اس حقیقت کا ثبوت جس پر وہ حق (الحق) ہے۔ کیونکہ اللہ تعالیٰ فرماتا ہے: \"لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\" (اس کی مثل کوئی چیز نہیں)۔ لیکن شرعی طور پر ہم پر یہ واجب ہے کہ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا: \"فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله\" (پس جان لو کہ اللہ کے سوا کوئی معبود نہیں)۔ وہ فرماتا ہے: میرے اس خبر دینے سے جان لو جو تمہاری نظر کے موافق ہے، تاکہ تمہارے لیے ایمان کا علم صحیح ہو جائے، جیسا کہ تمہارے لیے بغیر ایمان کے علم صحیح ہوا جو تعریف سے پہلے تھا۔ پس اس نے حکم دیا۔ تو اسی حکم کی وجہ سے، بعض لوگوں کی نظر اور رائے کے مطابق، ہم نے غور کیا کہ ہم اس کی معرفت (المعرفۃ) تک کیسے پہنچ سکتے ہیں۔ پس ہم نے انصاف کے حکم کے مطابق اور اس کے بعد جو کامل عقل نے اپنی ممکنہ کوشش اور محنت کے بعد دیا، اس پر غور کیا۔ تو ہم اس سبحانہ کی معرفت تک نہیں پہنچ سکے مگر اس کی معرفت سے عاجز ہونے کے ذریعے۔ کیونکہ ہم نے یہ چاہا کہ ہم اسے اس طرح جانیں جیسے ہم تمام اشیاء کو اس حقیقت کے پہلو سے جاننا چاہتے ہیں جس پر وہ معلومات قائم ہیں۔ پس جب ہم نے جان لیا کہ ایک موجود ہے جس کی کوئی مثال نہیں، اور نہ وہ ذہن میں تصور کیا جا سکتا ہے اور نہ ہی اس کا ادراک کیا جا سکتا ہے، تو عقل اسے کیسے ضبط کر سکتی ہے؟ یہ ناممکن ہے، باوجود اس کے کہ اس کے وجود کا علم ثابت ہے۔ پس ہم جانتے ہیں کہ وہ اپنی الوہیت میں ایک موجود ہے، اور یہی وہ علم ہے جو ہم سے طلب کیا گیا ہے، نہ کہ اس کی ذات کی حقیقت کا علم جس پر وہ سبحانہ خود کو جانتا ہے۔ اور یہی \"عدم علم کا علم\" ہے جو ہم سے طلب کیا گیا تھا۔ چونکہ وہ تعالیٰ عقل کی نظر میں مخلوقات میں سے کسی چیز سے مشابہت نہیں رکھتا اور نہ ہی کوئی چیز اس سے مشابہت رکھتی ہے، اس لیے جب ہم سے کہا گیا: \"جان لو کہ اللہ کے سوا کوئی معبود نہیں\"، تو ہم پر سب سے پہلے یہ واجب تھا کہ ہم جانیں کہ علم کیا ہے، اور ہم نے جان لیا۔ پس ہم نے جان لیا کہ علم کے علم سے متعلق ہم پر سب سے پہلے کیا واجب تھا۔\n\n(شروع اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے)\n\n### [علمی مطالبات کی بنیادیں]\n\nپس ہم کہتے ہیں کہ چونکہ علمی مطالبات کی بنیادیں چار ہیں: \"ہل\" (کیا ہے؟)، \"ما\" (کیا چیز ہے؟)، \"کیف\" (کیسا ہے؟) اور \"لم\" (کیوں ہے؟)۔ پس \"ہل\" اور \"لم\" دو روحانی اور سادہ مطالبات ہیں جن کے ساتھ \"ما ہو\" (وہ کیا ہے) بھی شامل ہوتا ہے۔ پس \"ہل\" اور \"لم\" بسیط حقائق کے لیے دو صحیح اصول ہیں، کیونکہ \"ما ہو\" میں خاص طور پر ایک طرح کی ترکیب پائی جاتی ہے۔ اور ان چار مطالبات میں سے کوئی بھی ایسا نہیں ہے جس کے ذریعے حقیقت کے تقاضے کے مطابق حق تعالیٰ (الحق) کے بارے میں سوال کیا جانا چاہیے۔ کیونکہ علم توحید سے صرف اس چیز کی نفی ہی صحیح طور پر جانی جا سکتی ہے جو اس سبحانہ کے سوا میں پائی جاتی ہے۔ اسی لیے اس نے فرمایا: \"لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\" (اس کی مثل کوئی چیز نہیں) اور \"سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ‏\" (تیرا رب، جو عزت کا مالک ہے، ان تمام باتوں سے پاک ہے جو یہ بیان کرتے ہیں)۔\n\n### [سلب (نفی) کے ذریعے علم ہی اللہ کا علم ہے]\n\nپس سلب (نفی) کے ذریعے علم ہی اللہ سبحانہ کا علم ہے۔ جیسا کہ ارواح کے بارے میں یہ کہنا جائز نہیں کہ \"کیسا\" (کیف) ہے، کیونکہ وہ اس سے پاک ہیں، اس لیے کہ ان کی حقائق اس عبارت کے خلاف ہیں۔ اسی طرح وہ آلات جن کے ذریعے ارواح کے بارے میں سوال کیا جاتا ہے، ان کا اطلاق حق تعالیٰ (الحق) پر جائز نہیں ہے۔ اور محقق موحد کے لیے، جو اپنے مبدع اور مخترع کی بارگاہ کا احترام کرتا ہے، یہ مناسب نہیں کہ وہ یہ الفاظ اس پر استعمال کرے۔ لہٰذا، ان مطالبات کے ذریعے اس کا علم کبھی حاصل نہیں کیا جا سکتا۔\n\n### «فصل» [وہ جس کا ادراک بذات خود ہو، وہ جس کا ادراک اس کے فعل سے ہو، اور وہ جس کا ادراک بالکل نہ ہو]\n\nپھر ہم نے حق تعالیٰ (الحق) کے سوا تمام چیزوں پر بھی غور کیا تو انہیں دو قسموں پر پایا: ایک قسم وہ ہے جس کا ادراک بذات خود ہوتا ہے، اور وہ محسوس اور کثیف (ٹھوس) ہے۔ دوسری قسم وہ ہے جس کا ادراک اس کے فعل سے ہوتا ہے، اور وہ معقول اور لطیف ہے۔ پس معقول (لطیف) اس مرتبے کے ذریعے محسوس (کثیف) سے بلند ہو گیا، اور وہ تنزیہ (التنزيه) ہے کہ اس کا ادراک بذات خود نہیں ہوتا بلکہ اس کے فعل سے ہوتا ہے۔ اور چونکہ یہ مخلوقات کی صفات ہیں، اس لیے حق تعالیٰ (الحق) اس سے پاک ہے کہ اس کا ادراک بذات خود ہو جیسے محسوس کا ہوتا ہے، یا اس کے فعل سے ہو جیسے لطیف یا معقول کا ہوتا ہے۔ کیونکہ اس سبحانہ اور اس کی مخلوق کے درمیان اصلاً کوئی مناسبت نہیں ہے۔ اس لیے کہ اس کی ذات ہمارے لیے مدرک نہیں ہے کہ وہ محسوس سے مشابہ ہو، اور نہ ہی اس کا فعل لطیف کے فعل جیسا ہے کہ وہ لطیف سے مشابہ ہو۔ کیونکہ حق تعالیٰ (الحق) کا فعل کسی چیز کے بغیر چیز کو ایجاد کرنا (إبداع) ہے، جبکہ لطیف روحانی کا فعل چیزوں سے چیز کو پیدا کرنا ہے۔ تو ان دونوں کے درمیان کیا مناسبت ہو سکتی ہے؟ پس جب فعل میں مشابہت ممتنع ہو گئی، تو ذات میں مشابہت کا ممتنع ہونا بدرجہ اولیٰ ہے۔ اور اگر آپ اس فصل میں کسی چیز کی تحقیق کرنا چاہیں تو مفعولات کی اقسام کے مطابق اس فعل کے مفعول کو دیکھیں۔ مثلاً مفعول صناعی جیسے قمیص اور کرسی۔ ہم نے پایا کہ وہ اپنے صانع کو نہیں جانتا، مگر یہ کہ وہ خود اپنے وجود سے اپنے صانع کے وجود اور اس کی صنعت کے علم پر دلالت کرتا ہے۔ اسی طرح مفعول تکوینی جو فلک اور کواکب ہیں، وہ اپنے بنانے والے اور اپنے مرکب کرنے والے کو نہیں جانتے، اور وہ ان پر محیط نفس کلیہ (النفس الکلیۃ) ہے۔ اسی طرح مفعول طبیعی جیسے معادن، نباتات اور حیوانات کی پیدائش، جو مفعول تکوینی سے ایک طبیعت کا فعل کرتے ہیں، انہیں اپنے فاعل یعنی فلک اور کواکب کا کوئی علم نہیں ہے۔ اور افلاک کا علم وہ نہیں ہے جو آپ ان کے جرم (جسم) سے دیکھتے ہیں اور جو حس سے ادراک ہوتا ہے، اور سورج کا جرم خود اپنی ذات میں اس سے کہاں ہے جو اسے دیکھنے والے کی آنکھ میں ہے۔ بلکہ افلاک کا علم ان کی روح اور ان کے معنی کے پہلو سے ہے جسے اللہ تعالیٰ نے ان کے لیے نفس کلیہ (النفس الکلیۃ) محیطہ کے ذریعے وجود بخشا ہے جو افلاک اور ان میں موجود چیزوں کا سبب ہے۔ اسی طرح مفعول انبعاثی جو نفس کلیہ (النفس الکلیۃ) ہے جو عقل (العقل) سے اس طرح منبعث ہوا جیسے صورت دحیہ حقیقت جبریلیہ سے منبعث ہوئی۔ پس وہ اسے بالکل نہیں جانتی جس سے وہ منبعث ہوئی ہے، کیونکہ وہ اس کے احاطے میں ہے اور وہ اس پر محیط ہے، اس لیے کہ وہ اس کے خواطر میں سے ایک خاطر ہے۔ تو وہ اسے کیسے جان سکتی ہے جو اس سے اوپر ہے، اور اس میں اس کا کچھ بھی نہیں ہے سوائے اس کے جو اس میں ہے۔ پس وہ صرف خود کو جانتی ہے، نہ کہ ان دونوں کے سبب کو۔ اسی طرح مفعول ابداعی جو ہمارے نزدیک حقیقت محمدیہ (الحقیقۃ المحمدیۃ) ہے اور دوسروں کے نزدیک عقل اول (العقل الأول) ہے، اور وہ قلم اعلیٰ ہے جسے اللہ تعالیٰ نے کسی چیز کے بغیر ایجاد کیا، وہ اپنے فاعل کے ادراک سے ہر اس مفعول سے زیادہ عاجز اور دور ہے جس کا ذکر پہلے ہو چکا ہے۔ کیونکہ ہر مفعول اور اس کے فاعل کے درمیان، جن کا ذکر پہلے ہوا، مناسبت اور مشاکلت کی کوئی نہ کوئی قسم موجود ہے، لہٰذا ان کے درمیان مناسبت کی مقدار کا علم ہونا ضروری ہے، خواہ جوہریت کے پہلو سے ہو یا کسی اور پہلو سے۔ لیکن مبدع اول (حقیقت محمدیہ) اور حق تعالیٰ (الحق) کے درمیان کوئی مناسبت نہیں ہے۔ پس وہ اسباب کے دوسرے مفعولات کے مقابلے میں اپنے فاعل کی معرفت سے زیادہ عاجز ہے، کیونکہ وہ مفعول جو اپنے فاعل سبب سے کئی پہلوؤں سے مشابہت رکھتا ہے، وہ بھی اس کے ادراک اور علم سے عاجز ہو چکا ہے۔ پس اس بات کو سمجھیں اور اس کی تحقیق کریں، کیونکہ یہ باب توحید میں اور علم حادث کے حق تعالیٰ (الحق) سے متعلق ہونے میں عاجزی کے بیان میں بہت مفید ہے۔\n\n### «فصل» [پانچ قوتیں اور ان کے حقیقی مدرکات]\n\nجو کچھ ہم نے ذکر کیا ہے، اس کی تائید اس بات سے ہوتی ہے کہ انسان تمام معلومات کا ادراک پانچ قوتوں میں سے کسی ایک کے ذریعے ہی کرتا ہے: حسی قوت (القوۃ الحسیۃ)، اور یہ پانچ ہیں: سونگھنا، چکھنا، چھونا، سننا اور دیکھنا۔ پس بصارت رنگوں، رنگین چیزوں اور اشخاص کا ادراک قرب اور بُعد کی ایک معلوم حد تک کرتی ہے۔ جو چیز ایک میل پر ادراک کی جاتی ہے وہ دو میل پر ادراک کی جانے والی سے مختلف ہے۔ اور جو چیز بیس ہاتھ پر ادراک کی جاتی ہے وہ ایک میل پر ادراک کی جانے والی سے مختلف ہے۔ اور جو چیز آمنے سامنے ہو اور ہاتھ میں ہاتھ ہو، وہ بیس ہاتھ پر ادراک کی جانے والی سے مختلف ہے۔ پس جو چیز دو میل پر ادراک کی جاتی ہے، وہ ایک شخص ہوتا ہے، لیکن یہ معلوم نہیں ہوتا کہ وہ انسان ہے یا درخت۔ اور ایک میل پر معلوم ہوتا ہے کہ وہ انسان ہے۔ اور بیس ہاتھ پر معلوم ہوتا ہے کہ وہ سفید ہے یا کالا۔ اور آمنے سامنے ہونے پر معلوم ہوتا ہے کہ وہ نیلی آنکھوں والا ہے یا سرمگیں آنکھوں والا۔ اور اسی طرح باقی حواس بھی قرب اور بُعد کے لحاظ سے اپنے مدرکات میں ہیں۔ اور باری سبحانہ محسوس نہیں ہے، یعنی معرفت (المعرفۃ) طلب کرنے کے وقت ہمارے نزدیک حس سے مدرک نہیں ہے۔ پس ہم نے اسے حس کے ذریعے نہیں جانا۔ اور جہاں تک قوت خیالیہ (القوۃ الخیالیۃ) کا تعلق ہے، تو وہ صرف اسی چیز کو ضبط کرتی ہے جو اسے حس نے دی ہو، یا تو اسی صورت میں جو حس نے دی، یا اس صورت میں جو فکر نے اسے دی کہ بعض محسوسات کو بعض پر محمول کرے۔ اور اہل فکر کا حق (الحق) کی معرفت کا طریقہ یہیں پر ختم ہو جاتا ہے۔ پس یہ ان کی زبان ہے، ہماری زبان نہیں، اگرچہ یہ حق ہے، لیکن ہم اسے ان کی طرف منسوب کرتے ہیں کیونکہ یہ ان سے منقول ہے۔ پس یہ قوت اپنے ادراک میں حس سے کبھی جدا نہیں ہوتی۔ اور چونکہ ہمارے نزدیک اللہ سے حس کا تعلق باطل ہو چکا ہے، لہٰذا اس سے خیال کا تعلق بھی باطل ہو گیا۔ اور جہاں تک قوت مفکرہ (القوۃ المفکرۃ) کا تعلق ہے، تو انسان کبھی بھی ان چیزوں کے سوا کسی اور چیز میں فکر نہیں کرتا جو اس کے پاس موجود ہیں اور جو اسے حواس اور عقل کے اوائل سے ملی ہیں۔ اور ان میں خیال کے خزانے میں فکر کرنے سے اسے کسی دوسرے امر کا علم حاصل ہوتا ہے جس کا ان چیزوں سے مناسبت ہو جن میں اس نے فکر کی۔ اور اللہ اور اس کی مخلوق کے درمیان کوئی مناسبت نہیں ہے۔ لہٰذا فکر کے ذریعے اس کا علم صحیح نہیں ہو سکتا۔ اسی لیے علماء نے اللہ تعالیٰ کی ذات میں فکر کرنے سے منع کیا ہے۔ اور جہاں تک قوت عقلیہ (القوۃ العقلیۃ) کا تعلق ہے، تو عقل کا اسے ادراک کرنا صحیح نہیں ہے، کیونکہ عقل صرف وہی قبول کرتی ہے جو اسے بدیہی طور پر معلوم ہو یا جو اسے فکر نے دیا ہو۔ اور چونکہ فکر کا اس کا ادراک باطل ہو چکا ہے، لہٰذا فکر کے ذریعے عقل کا اس کا ادراک بھی باطل ہو گیا۔ لیکن چونکہ وہ عقل ہے، اس کی حد یہ ہے کہ وہ عقل کرے اور جو کچھ اس کے پاس حاصل ہو اسے ضبط کرے۔ پس حق (الحق) اسے اپنی معرفت (المعرفۃ) عطا کر سکتا ہے، اور وہ اسے عقل کر لیتی ہے، کیونکہ وہ عقل ہے، نہ کہ فکر کے ذریعے سے۔ ہم اس سے منع نہیں کرتے، کیونکہ یہ معرفت (المعرفۃ) جو حق تعالیٰ (الحق) اپنے بندوں میں سے جسے چاہتا ہے عطا کرتا ہے، عقل اس کے ادراک میں خود مختار نہیں ہوتی، لیکن اسے قبول کر لیتی ہے۔ پس اس پر کوئی دلیل یا برہان قائم نہیں ہوتا، کیونکہ یہ عقل کے مدارک کی حد سے باہر ہے۔ پھر ان ذاتی صفات کو بیان کرنا ممکن نہیں ہے، کیونکہ وہ تمثیل اور قیاس سے باہر ہیں۔ اس لیے کہ \"لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\" (اس کی مثل کوئی چیز نہیں)۔ پس ہر وہ عقل جس پر اس معرفت (المعرفۃ) میں سے کچھ بھی کشف (الکشف) نہ ہوا ہو، وہ کسی دوسری عقل سے سوال کرتی ہے جس پر اس میں سے کشف ہوا ہو۔ لیکن اس مسئول عقل کی طاقت میں نہیں ہے کہ وہ اسے بیان کر سکے اور نہ ہی یہ ممکن ہے۔ اسی لیے صدیق اکبر رضی اللہ عنہ نے فرمایا: \"ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے۔\" اور اس کلام کے دو مرتبے ہیں، پس سمجھو۔ پس جس نے اللہ کو اپنی عقل سے اپنی فکر اور نظر کے ذریعے طلب کیا، وہ بھٹک گیا ہے۔ بلکہ اس کا کام صرف اس چیز کو قبول کرنے کے لیے تیار ہونا ہے جو اللہ اسے عطا کرے۔ پس سمجھو۔ اور جہاں تک قوت ذاکرہ (القوۃ الذاکرۃ) کا تعلق ہے، تو اس کے لیے اللہ کے علم کا ادراک کرنے کا کوئی راستہ نہیں ہے، کیونکہ وہ صرف اسی چیز کو یاد کرتی ہے جسے عقل نے پہلے جانا ہو، پھر وہ غافل ہو گئی ہو یا بھول گئی ہو۔ اور چونکہ اس نے اسے جانا ہی نہیں، لہٰذا قوت ذاکرہ کے لیے اس تک کوئی راستہ نہیں۔ اور انسان کے مدارک اس چیز میں محدود ہو گئے جو وہ انسان ہے اور جو اس کی ذات اسے دیتی ہے اور جس میں اس کا کسب ہے۔ اور باقی صرف عقل کا اس معرفت (المعرفۃ) کو قبول کرنے کے لیے تیار ہونا ہے جو حق جل و علا اسے عطا کرتا ہے۔ پس وہ دلیل کے پہلو سے کبھی نہیں جانا جاتا، سوائے وجود (الوجود) کی معرفت کے اور یہ کہ وہ واحد معبود ہے، بس۔ کیونکہ ادراک کرنے والا انسان کبھی بھی کسی چیز کا ادراک نہیں کر سکتا مگر یہ کہ اس کی مثال اس میں موجود ہو۔ اگر ایسا نہ ہوتا تو وہ اسے بالکل ادراک نہ کر سکتا اور نہ ہی جان سکتا۔ پس جب وہ کسی چیز کو نہیں جانتا مگر یہ کہ اس میں اس معلوم چیز کی مثال موجود ہے، تو اس نے صرف اسی چیز کو جانا جو اس سے مشابہت رکھتی ہے اور اس سے مماثلت رکھتی ہے۔ اور باری تعالیٰ کسی چیز سے مشابہت نہیں رکھتا اور نہ ہی کوئی چیز اس کی مثل ہے، لہٰذا وہ کبھی نہیں جانا جاتا۔\n\n### [طبیعی اشیاء صرف اپنے مماثل سے ہی غذا قبول کرتی ہیں]\n\nجو کچھ ہم نے ذکر کیا ہے، اس کی تائید اس بات سے بھی ہوتی ہے کہ طبیعی اشیاء صرف اپنے مماثل سے ہی غذا قبول کرتی ہیں۔ اور جو چیز ان سے مماثلت نہیں رکھتی، وہ اس سے قطعاً غذا قبول نہیں کرتیں۔ اس کی مثال یہ ہے کہ معادن، نباتات اور حیوانات کی پیدائش چار طبائع سے مرکب ہے، اور یہ پیدائشیں صرف انہی سے غذا قبول کرتی ہیں، کیونکہ ان میں ان طبائع کا حصہ موجود ہے۔ اور اگر کوئی مخلوق یہ چاہے کہ وہ اپنے اس جسم کی غذا جو ان طبائع سے مرکب ہے، کسی ایسی چیز سے بنائے جو ان طبائع کے علاوہ سے ہو یا جو ان سے مرکب نہ ہو، تو وہ ایسا نہیں کر سکتا۔ پس جس طرح طبیعی اجسام میں سے کسی کے لیے یہ ممکن نہیں کہ وہ صرف اسی چیز سے غذا قبول کرے جو ان طبائع میں سے ہو جن سے وہ خود ہے، اسی طرح کسی کے لیے یہ ممکن نہیں کہ وہ کسی ایسی چیز کو جان لے جس کی مثال اس میں بالکل موجود نہ ہو۔ کیا آپ نہیں دیکھتے کہ نفس (النفس) عقل (العقل) سے صرف وہی قبول کرتا ہے جس میں وہ اس کے ساتھ شریک ہو اور اس سے مماثلت رکھتا ہو، اور جس میں وہ اس کے ساتھ شریک نہ ہو، وہ اسے کبھی نہیں جانتا۔ اور اللہ کی طرف سے کسی میں کوئی چیز نہیں ہے، اور کسی بھی پہلو سے اس پر یہ جائز نہیں ہے۔ لہٰذا کوئی بھی اسے اپنے نفس اور اپنی فکر سے نہیں جان سکتا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ نے عقلوں سے پردہ کر لیا ہے، جیسا کہ اس نے آنکھوں سے پردہ کر لیا ہے، اور ملأ اعلیٰ (فرشتے) بھی اسے اسی طرح طلب کرتے ہیں جیسے تم اسے طلب کرتے ہو۔\"\n\nپس آپ صلی اللہ علیہ وسلم نے خبر دی کہ عقل نے اسے اپنی فکر سے اور نہ ہی اپنی بصیرت کی آنکھ سے ادراک کیا، جیسا کہ بصارت نے اسے ادراک نہیں کیا۔ اور یہی وہ بات ہے جس کی طرف ہم نے اپنے اس باب میں پہلے اشارہ کیا ہے۔ پس اللہ کے لیے تمام تعریفیں ہیں اس پر جو اس نے الہام کیا اور ہمیں وہ سکھایا جو ہم نہیں جانتے تھے، اور اللہ کا فضل بہت عظیم ہے۔\n\n### [تنزیہ (التنزيه) اور مماثلت و تشبیہ کی نفی]\n\nتنزیہ (التنزيه) اور مماثلت و تشبیہ (التشبيه) کی نفی اسی طرح ہونی چاہیے۔ اور مشبہہ (تشبیہ دینے والے) میں سے جو بھی گمراہ ہوا، وہ صرف تاویل کی وجہ سے گمراہ ہوا اور اس وجہ سے کہ انہوں نے ان آیات اور احادیث کو جو وارد ہوئیں، ان معانی پر محمول کیا جو بغیر اس غور کے فہم میں سبقت لے جاتے ہیں کہ اللہ تعالیٰ کے لیے تنزیہ (التنزيه) واجب ہے۔ پس اس چیز نے انہیں خالص جہالت اور صریح کفر کی طرف دھکیل دیا۔ اور اگر وہ سلامتی چاہتے اور احادیث اور آیات کو اسی طرح چھوڑ دیتے جیسے وہ آئی ہیں، بغیر کسی تبدیلی کے، اور اس کا علم اللہ تعالیٰ اور اس کے رسول کے سپرد کر دیتے اور کہتے کہ ہم نہیں جانتے، تو ان کے لیے اللہ تعالیٰ کا یہ قول کافی تھا: \"لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\" (اس کی مثل کوئی چیز نہیں)۔ پس جب بھی ان کے پاس کوئی ایسی حدیث آئی جس میں تشبیہ (التشبيه) ہو، تو اس کا مطلب یہ ہوا کہ اللہ کسی چیز سے مشابہ ہوا، حالانکہ اس نے خود اپنی ذات سے مشابہت کی نفی کی ہے۔ پس اب صرف یہی باقی رہ جاتا ہے کہ اس خبر کا تنزیہ (التنزيه) کے پہلوؤں میں سے کوئی ایسا پہلو ہے جسے اللہ تعالیٰ جانتا ہے، اور اسے عرب کے فہم کے لیے لایا گیا ہے جس کی زبان میں قرآن نازل ہوا۔ اور آپ کو کسی حدیث یا آیت میں کوئی ایسا لفظ نہیں ملے گا جو ایک ہی جملے میں تشبیہ (التشبيه) میں نص (قطعی دلیل) ہو۔ بلکہ آپ اسے عربوں کے ہاں ایسا پائیں گے جو کئی پہلوؤں کا احتمال رکھتا ہے، جن میں سے کچھ تشبیہ کی طرف لے جاتے ہیں اور کچھ تنزیہ کی طرف۔ پس تاویل کرنے والے کا اس لفظ کو اس پہلو پر محمول کرنا جو تشبیہ کی طرف لے جاتا ہے، اس لفظ پر اس کی طرف سے زیادتی ہے، کیونکہ اس نے اس حق کو پورا نہیں کیا جو اس کا لسانی وضع اسے دیتا ہے، اور اللہ تعالیٰ پر زیادتی ہے، کیونکہ اس نے اس سبحانہ پر وہ چیز محمول کی جو اللہ تعالیٰ کے شایان شان نہیں۔ اور ہم ان شاء اللہ تعالیٰ بعض ایسی احادیث پیش کریں گے جو تشبیہ میں وارد ہوئی ہیں، حالانکہ وہ اس میں نص نہیں ہیں۔ \"فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ فَلَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ‏\" (پس اللہ ہی کے لیے کامل حجت ہے، اور اگر وہ چاہتا تو تم سب کو ہدایت دے دیتا)۔\n\n### [سنت کے الفاظ میں تشبیہ (التشبيه) اور تجسیم (التجسيم)]\n\n**مومن کا دل اللہ کی انگلیوں (أصابع) میں سے دو انگلیوں کے درمیان ہے**\n\nعقل کی نظر اس وضع کے تقاضے کے مطابق جو حقیقت اور مجاز سے متعلق ہے: جارحہ (جسمانی عضو) کا اللہ تعالیٰ پر ہونا محال ہے۔ \"إصبع\" (انگلی) ایک مشترک لفظ ہے جو جارحہ پر بھی بولا جاتا ہے اور نعمت پر بھی۔ راعی کہتا ہے:\n\n> وہ کمزور لاٹھی والا، ابھری ہوئی رگوں والا ہے، تم اس کے لیے دیکھتے ہو،\n> اس پر جب لوگ قحط زدہ ہوں، ایک انگلی (أصبعا)۔\n\n(یعنی) تم اس کے لیے اس پر نعمت کا ایک اچھا اثر دیکھتے ہو، اس پر حسن نظر کی وجہ سے۔ عرب کہتے ہیں: \"ما أحسن أصبع فلان على ما له\" (فلاں کی اپنے مال پر انگلی کتنی اچھی ہے) یعنی اس کا اثر، اس سے مراد اس کے مال کی بڑھوتری ہے، اس کے حسن تصرف کی وجہ سے۔ دل کا پلٹنا (تقلیب) سب سے زیادہ تیز ہے، کیونکہ انگلیوں نے اسے پلٹا، اس کے چھوٹے حجم اور ان میں کامل قدرت کی وجہ سے۔ پس ان کی حرکت ہاتھ اور دیگر کی حرکت سے زیادہ تیز ہے۔ اور چونکہ اللہ کا بندوں کے دلوں کو پلٹنا سب سے تیز چیز ہے، اس لیے نبی صلی اللہ علیہ وسلم نے عربوں کے لیے اپنی دعا میں اس چیز کے ساتھ وضاحت فرمائی جسے وہ عقل کرتے ہیں۔ اور چونکہ ہمارے نزدیک پلٹنا صرف ہاتھ سے ہوتا ہے، اس لیے پلٹنے کو انگلیوں سے منسوب کیا گیا، کیونکہ انگلیاں ہاتھ میں ہوتی ہیں، اور تیزی انگلیوں میں زیادہ ممکن ہے۔\n\nچنانچہ آپ صلی اللہ علیہ وسلم اپنی دعا میں فرمایا کرتے تھے: \"يا مقلب القلوب ثبت قلبي على دينك\" (اے دلوں کو پلٹنے والے، میرے دل کو اپنے دین پر ثابت قدم رکھ)۔\n\nاور اللہ تعالیٰ کا دلوں کو پلٹنا وہ ہے جو وہ ان میں نیکی کا ارادہ اور برائی کا ارادہ پیدا کرتا ہے۔ چونکہ انسان اپنے دل میں متضاد خواطر کے پے در پے آنے کو محسوس کرتا ہے، جو حق (الحق) کے دل کو پلٹنے کا اظہار ہے، اور انسان اس علم کو اپنے نفس سے دور نہیں کر سکتا، اسی لیے\n\nآپ صلی اللہ علیہ وسلم فرمایا کرتے تھے: \"يا مقلب القلوب ثبت قلبي على دينك\" (اے دلوں کو پلٹنے والے، میرے دل کو اپنے دین پر ثابت قدم رکھ)۔ اور اس حدیث میں ہے کہ آپ کی ازواج میں سے ایک نے آپ سے پوچھا: \"اور کیا آپ بھی ڈرتے ہیں، یا رسول اللہ؟\" تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"قلب المؤمن بين أصبعين من أصابع الله\" (مومن کا دل اللہ کی انگلیوں میں سے دو انگلیوں کے درمیان ہے)۔\n\nآپ صلی اللہ علیہ وسلم ایمان سے کفر کی طرف اور ان کے نیچے کی چیزوں کی طرف تیزی سے پلٹنے کی طرف اشارہ فرما رہے ہیں۔ اللہ تعالیٰ فرماتا ہے: \"فَأَلْهَمَها فُجُورَها وتَقْواها\" (پس اس نے اسے اس کی بدی اور اس کی پرہیزگاری کا الہام کیا)۔ اور یہ الہام ہی تقلیب (پلٹنا) ہے۔ اور انگلیاں تیزی کے لیے ہیں، اور دوئی (الاثنینیۃ) نیکی کا خاطر اور برائی کا خاطر ہے۔ پس جب آپ نے انگلیوں سے وہ سمجھ لیا جو میں نے ذکر کیا، اور آپ نے اس سے جارحہ (عضو) بھی سمجھا، اور آپ نے اس سے نعمت اور اچھا اثر بھی سمجھا، تو آپ اسے کس پہلو سے جارحہ سے ملحق کریں گے، جبکہ یہ منزہ پہلو اسے طلب کر رہے ہیں؟ یا تو ہم خاموش رہیں اور اس کا علم اللہ تعالیٰ کے سپرد کر دیں اور اس کے سپرد کر دیں جسے حق (الحق) نے یہ معرفت (المعرفۃ) عطا کی ہو، خواہ وہ رسول مرسل ہو یا ولی ملہم، بشرطیکہ جارحہ کی نفی لازمی ہو۔ اور یا اگر ہم پر فضول گوئی غالب آ جائے، مگر یہ کہ ہم اس کے ذریعے کسی بدعتی مجسم (تجسیم کرنے والے) مشبہ (تشبیہ دینے والے) کا رد کریں، تو یہ فضول گوئی نہیں ہے، بلکہ اس وقت عالم پر واجب ہے کہ وہ اس لفظ میں تنزیہ (التنزيه) کے پہلوؤں کو واضح کرے تاکہ اس کے ذریعے اس ذلیل مجسم کی حجت کو باطل کرے۔ اللہ ہم پر اور اس پر توبہ قبول فرمائے اور اسے اسلام نصیب کرے۔ پس اگر ہم اس کلمے پر بات کریں جس سے تشبیہ کا وہم ہوتا ہے، اور یہ ضروری ہو، تو اس کی شرح کو اس پہلو کی طرف موڑنا جو اللہ سبحانہ کے شایان شان ہے، زیادہ بہتر ہے۔ یہ وضع میں عقل کا حصہ ہے۔\n\n### (روح کا دل میں پھونکنا) [دو انگلیوں سے قلب کا حصہ]\n\nدو انگلیاں (الإصبعان) کمال ذاتی کا راز ہیں، جو جب قیامت کے دن آنکھوں پر منکشف ہوگا، تو انسان اپنے کافر باپ کو پکڑ کر آگ میں پھینک دے گا اور اسے اس پر کوئی تکلیف یا شفقت محسوس نہیں ہوگی۔ ان دو انگلیوں کے راز سے، جن کا معنی متحد ہے اور لفظ مثنیٰ ہے، جنت اور دوزخ پیدا کیے گئے، اور منور (نور بخشنے والا) اور مظلم (تاریکی دینے والا)، اور منعم (نعمت دینے والا) اور منتقم (انتقام لینے والا) کے نام ظاہر ہوئے۔ پس انہیں دس میں سے دو تصور نہ کریں۔ اور اس باب میں اس راز کی طرف اشارہ کرنا ضروری ہے کہ \"اس کے دونوں ہاتھ دائیں ہیں\" (کلتا یدیہ یمین)۔ اور یہ کشف (الکشف) کی معرفت (المعرفۃ) ہے۔ کیونکہ اہل جنت کے لیے دو نعمتیں ہوں گی: ایک جنت کی نعمت، اور دوسری اہل دوزخ کے عذاب کی نعمت۔ اسی طرح اہل دوزخ کے لیے بھی دو عذاب ہوں گے۔ اور دونوں فریق اللہ کو اسماء کی رؤیت کے ذریعے دیکھیں گے، جیسا کہ وہ دنیا میں دیکھتے تھے۔ اور دو مٹھیاں (القبضتان) جو رسول اللہ صلی اللہ علیہ وسلم سے حق (الحق) کے حق میں آئی ہیں، ان میں بھی وہی راز ہے جس کی طرف ہم نے اشارہ کیا اور اس کا معنی ہے۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\n\n**مٹھی (القبضۃ) اور دایاں ہاتھ (الیمین)**\n\nاللہ تعالیٰ فرماتا ہے: \"وَالْأَرْضُ جَمِيعاً قَبْضَتُهُ ... وَالسَّماواتُ مَطْوِيَّاتٌ بِيَمِينِهِ\" (اور ساری زمین قیامت کے دن اس کی مٹھی میں ہوگی... اور آسمان اس کے داہنے ہاتھ میں لپٹے ہوئے ہوں گے)۔ عقل کی نظر اس وضع کے تقاضے کے مطابق یہ ہے کہ اس نے سب سے پہلے اس سبحانہ کو اس بات سے منع کیا کہ اس کی قدر کا اندازہ لگایا جائے، کیونکہ کمزور عقلوں میں تشبیہ (التشبيه) اور تجسیم (التجسيم) کا وہم پیدا ہوتا ہے جب ایسی آیات اور احادیث وارد ہوتی ہیں جو اپنے کسی پہلو سے اس کا مفہوم دیتی ہیں۔ پھر اس تنزیہ (التنزيه) کے بعد، جسے صرف جاننے والے ہی عقل کرتے ہیں، اس نے فرمایا: \"وَالْأَرْضُ جَمِيعاً قَبْضَتُهُ\" (اور ساری زمین اس کی مٹھی میں ہوگی)۔ ہم نے عربی زبان کی وضع سے جانا کہ جب کہا جاتا ہے: \"فلاں میری مٹھی میں ہے\"، تو اس سے مراد یہ ہوتی ہے کہ وہ میرے حکم کے تحت ہے، اگرچہ میرے ہاتھ میں اس کا کوئی حصہ نہ ہو۔ لیکن میرا حکم اس میں جاری ہے اور میرا فیصلہ اس پر نافذ ہے، جیسے میرا حکم اس چیز پر ہے جس کا میں حسی طور پر مالک ہوں اور جسے میں نے مٹھی میں لیا ہے۔ اسی طرح میں کہتا ہوں: \"میرا مال میری مٹھی میں ہے\"، یعنی میری ملکیت میں ہے، اور میں اس میں تصرف کرنے پر قادر ہوں، یعنی وہ خود کو مجھ سے نہیں روکتا۔ پس جب میں اس میں تصرف کرتا ہوں، تو اس وقت میرے لیے یہ کہنا زیادہ ممکن ہوتا ہے کہ وہ میری مٹھی میں ہے، میرے تصرف کی وجہ سے، اگرچہ میرے غلام ہی میری اجازت سے اس میں تصرف کر رہے ہوں۔ پس جب اللہ تعالیٰ پر جارحہ (جسمانی عضو) کا ہونا محال ہو گیا، تو عقل نے مٹھی (القبضۃ) کی روح، اس کے معنی اور اس کے فائدے کی طرف رجوع کیا، اور وہ ہے اس چیز کی ملکیت جس پر فوری طور پر قبضہ کیا گیا ہو، اگرچہ قابض کے لیے اس چیز میں کوئی چیز نہ ہو جس پر قبضہ کیا گیا ہے، لیکن وہ قطعاً مٹھی کی ملکیت میں ہے۔ پس اسی طرح عالم حق تعالیٰ (الحق) کی مٹھی میں ہے۔ اور آخرت میں زمین کا ذکر بعض املاک کی تخصیص کے لیے ہے، جیسا کہ ہم کہتے ہیں: \"میرا خادم میری مٹھی میں ہے\"، اگرچہ میرا خادم ان تمام لوگوں میں شامل ہے جو میری مٹھی میں ہیں۔ لیکن میں نے اس کا ذکر کسی خاص واقعے کی وجہ سے تخصیص کے طور پر کیا۔ اور یمین (دایاں ہاتھ) ہمارے نزدیک مطلق اور قوی تصرف کی جگہ ہے، کیونکہ بایاں ہاتھ دائیں ہاتھ کی قوت نہیں رکھتا۔ پس یمین سے مراد لپیٹنے پر قدرت کا کنایہ لیا گیا ہے۔ یہ فعل پر قدرت کے تمکن کی طرف اشارہ ہے۔ پس یہ عربوں کے فہم تک ان الفاظ کے ذریعے پہنچا جنہیں وہ جانتے ہیں اور جنہیں وہ تیزی سے قبول کرتے ہیں۔ شاعر کہتا ہے:\n\n> جب بھی کسی مجد (عظمت) کے لیے کوئی جھنڈا بلند کیا گیا،\n> تو عرابہ نے اسے دائیں ہاتھ سے تھاما۔\n\nاور مجد (عظمت) کا کوئی محسوس جھنڈا نہیں ہوتا، لہٰذا اسے کوئی جارحہ یمین (دایاں عضو) نہیں تھام سکتا۔ پس گویا وہ کہہ رہا ہے کہ اگر مجد کا کوئی محسوس جھنڈا ظاہر ہوتا، تو اس کی جگہ یا اسے اٹھانے والا عرابہ اوسی کے دائیں ہاتھ کے سوا کوئی نہ ہوتا۔ یعنی مجد کی صفت اس کے ساتھ قائم اور اس میں کامل ہے۔ پس عرب ہمیشہ جارحہ کے الفاظ کا اطلاق اس چیز پر کرتے رہے جو جارحہ کو قبول نہیں کرتی، ان دونوں کے درمیان معنی کے راستے سے اشتراک کی وجہ سے۔\n\n### (روح کا دل میں پھونکنا) [دائیں اور بائیں ہاتھ سے قلب کا حصہ]\n\nجب حق (الحق) کسی بندے کے سر (باطن) پر ظہور الٰہی (التجلی) فرماتا ہے، تو اسے تمام اسرار کا مالک بنا دیتا ہے اور اسے آزادوں میں شامل کر دیتا ہے، اور اسے یمین (دائیں ہاتھ) کی طرف سے ذاتی تصرف حاصل ہو جاتا ہے۔ کیونکہ شمال (بایاں ہاتھ) کا شرف غیر کے ذریعے ہے اور یمین کا شرف بذات خود ہے۔ پھر یمین کے شرف کو خطاب کے ذریعے نازل کیا گیا اور شمال کے شرف کو ظہور الٰہی (التجلی) کے ذریعے، جو انسان کا شرف ہے اس کی حقیقت کی معرفت (المعرفۃ) اور اس پر اس کے مطلع ہونے کی وجہ سے، اور یہی یسار (بایاں ہاتھ) ہے۔ اور اس کی دونوں ہتھیلیاں، اس لحاظ سے کہ وہ شمال ہے، اسی طرح ہیں جیسے حق (الحق) کی دونوں ہتھیلیاں یمین ہیں۔ (اگر آپ) اتحاد کے معنی کی طرف رجوع کریں تو بندے کی دونوں ہتھیلیاں یمین ہیں۔ (اگر آپ) توحید کی طرف رجوع کریں تو اس کی ایک ہتھیلی یمین ہے اور دوسری شمال۔\n\nپس کبھی میں جمع اور جمع الجمع میں ہوتا ہوں اور کبھی فرق اور فرق الفرق میں، ظہور الٰہی (التجلی) اور وارد کے حکم کے مطابق۔\n\n> ایک دن میں یمنی ہوں جب میں کسی یمنی سے ملتا ہوں،\n> اور اگر میں کسی معدی (شمالی عرب) سے ملوں تو میں عدنانی ہوں۔\n\nاور اسی میں سے تعجب، ہنسنا، خوشی اور غضب ہے۔ تعجب صرف اس موجود سے صادر ہوتا ہے جو اس متعجب چیز کو نہیں جانتا، پھر اسے جانتا ہے تو تعجب کرتا ہے، اور اس کے ساتھ ہنسنا بھی شامل ہوتا ہے۔ اور یہ اللہ تعالیٰ پر محال ہے، کیونکہ کوئی چیز اس کے علم سے باہر نہیں ہے۔ پس جب بھی وجود میں کوئی ایسی چیز واقع ہوتی ہے جس پر ہمارے نزدیک تعجب کیا جا سکتا ہے، تو اس تعجب اور ہنسنے کو اس ذات پر محمول کیا جاتا ہے جس پر تعجب اور ہنسنا جائز نہیں، کیونکہ واقع ہونے والا امر ہمارے نزدیک تعجب خیز ہوتا ہے، جیسے وہ جوان جس میں جوانی کی شوخی نہ ہو۔ یہ ایک تعجب خیز امر ہے۔ پس یہ اللہ تعالیٰ کے نزدیک اس چیز کے مقام پر آ گیا جس پر ہمارے نزدیک تعجب کیا جاتا ہے۔ اور ہنسنا اور خوشی قبولیت اور رضا کی طرف بھی نکل سکتے ہیں۔ کیونکہ جس کے لیے آپ کوئی فعل کرتے ہیں اور وہ اس کی وجہ سے آپ کے لیے ہنسنے اور خوشی کا اظہار کرتا ہے، تو اس نے اس فعل کو قبول کر لیا اور اس سے راضی ہو گیا۔ پس اللہ تعالیٰ کا ہنسنا اور خوش ہونا ہم سے اس کی قبولیت اور رضا ہے۔ اسی طرح اس کا غضب (غصہ) دل کے خون کے جوش مارنے سے پاک ہے، انتقام کے طلب میں، کیونکہ وہ سبحانہ جسمیت اور عرض سے پاک ہے۔ پس یہ اس بات کی طرف لوٹ سکتا ہے کہ وہ اس شخص کا فعل کرے جسے غصہ آتا ہے، اور جس پر غصہ جائز ہے، اور وہ اس کا جباروں، اس کے حکم کی خلاف ورزی کرنے والوں اور اس کی حدود سے تجاوز کرنے والوں سے انتقام لینا ہے۔ اللہ تعالیٰ فرماتا ہے: \"وغضب عليه\" (اور اس پر غضب کیا) یعنی اسے غضب کیے گئے شخص کی جزا دی۔ پس جزا دینے والا غضبناک ہوتا ہے۔ پس فعل کے ظاہر ہونے نے نام کا اطلاق کیا۔\n\n**باب فرح (خوشی) سے**\n\nحدیث میں آیا ہے کہ اللہ اس شخص کے لیے \"يتبشبش\" (خندہ پیشانی سے ملتا ہے) جو نماز اور ذکر کے لیے مسجدوں کو آباد کرتا ہے۔\n\nجب عالم کے لوگ کائنات میں محجوب ہو گئے اور اللہ کے سوا میں اللہ سے مشغول ہو گئے، تو اس فعل کی وجہ سے وہ اللہ سے غیبت کی حالت میں ہو گئے۔ پس جب وہ کسی قسم کے حضور کے ساتھ اس سبحانہ کی طرف لوٹے، تو اس نے ان کے دلوں میں اپنی حاضری، مناجات اور مشاہدہ کی لذت کی نعمت نازل فرمائی، جس سے وہ ان کے دلوں کو محبوب ہو گیا۔\n\nکیونکہ نبی صلی اللہ علیہ وسلم فرماتے ہیں: \"اللہ سے محبت کرو، اس لیے کہ وہ تمہیں اپنی نعمتوں سے غذا دیتا ہے۔\"\n\nپس \"تبشبش\" (خندہ پیشانی) سے اس نے اپنے اس فعل سے کنایہ کیا، کیونکہ یہ تمہارے اس کی طرف آنے پر خوشی کا اظہار ہے۔ کیونکہ جو شخص تمہارے آنے پر خوش ہوتا ہے، تو اس کی خوشی کی علامت یہ ہے کہ وہ تمہارے ساتھ نیکی کا اظہار کرے، محبت کرے اور اپنی نعمتیں تم پر بھیجے۔ پس جب یہ چیزیں اللہ کی طرف سے اس کے پاس آنے والے بندوں پر ظاہر ہوئیں، تو اس نے اسے \"تبشبش\" (خندہ پیشانی) کا نام دیا۔\n\nاللہ تعالیٰ فرماتا ہے: \"فَنَسِيَهُمْ\" (پس اس نے انہیں بھلا دیا)۔ باری تعالیٰ پر نسیان (بھولنا) جائز نہیں ہے۔ لیکن جب اس نے انہیں ہمیشہ کا عذاب دیا اور اس کی رحمت ان تک نہ پہنچی، تو وہ گویا اس کے نزدیک بھلائے ہوئے ہو گئے، اور وہ گویا انہیں بھولنے والا ہے، یعنی یہ بھولنے والے کا فعل ہے اور اس شخص کا فعل ہے جو اس دردناک عذاب کو یاد نہیں کرتا جس میں وہ ہیں۔ اور یہ اس لیے کہ انہوں نے اپنی دنیاوی زندگی میں \"نَسُوا الله\" (اللہ کو بھلا دیا) تھا، پس اس نے انہیں ان کے فعل کی جزا دی۔ پس مناسبت کی وجہ سے ان کا فعل ان پر لوٹا دیا۔ اور \"نسيهم\" (اس نے انہیں بھلا دیا) کا مطلب یہ بھی ہو سکتا ہے کہ اس نے انہیں مؤخر کر دیا۔ \"نسوا الله\" (انہوں نے اللہ کو بھلا دیا) یعنی انہوں نے اللہ کے حکم کو مؤخر کر دیا اور اس پر عمل نہیں کیا، تو اللہ نے انہیں آگ میں مؤخر کر دیا جب اس نے ان لوگوں کو آگ سے نکال دیا جنہیں اس میں داخل کیا تھا۔ اور اسی باب سے قریب ہے حق (الحق) کا مکر، استہزاء اور سخر یہ کی صفات سے متصف ہونا۔ اللہ تعالیٰ فرماتا ہے: \"سَخِرَ الله مِنْهُمْ\" (اللہ نے ان سے مذاق کیا) اور فرمایا: \"وَمَكَرَ الله\" (اور اللہ نے مکر کیا) اور فرمایا: \"الله يَسْتَهْزِئُ بِهِمْ\" (اللہ ان سے استہزاء کرتا ہے)۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: \"ہوا کو برا بھلا نہ کہو، کیونکہ وہ نفس الرحمن (رحمٰن کی سانس) میں سے ہے۔\"\n\nاور آپ صلی اللہ علیہ وسلم کا یہ قول: \"میں نفس الرحمن (رحمٰن کی سانس) کو یمن کی طرف سے آتا ہوا پاتا ہوں۔\"\n\nاور یہ سب تنفیس (تنگی دور کرنا) کے معنی میں ہے۔ گویا وہ کہہ رہے ہیں: ہوا کو برا بھلا نہ کہو، کیونکہ یہ وہ چیز ہے جس کے ذریعے رحمٰن اپنے بندوں سے تنگی دور کرتا ہے۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا: \"میری مدد صبا (مشرقی ہوا) کے ذریعے کی گئی۔\"\n\n(یعنی) میں رحمٰن کی نفس (تنگی دور کرنا) کو اپنے پاس یمن کی طرف سے آتا ہوا پاتا ہوں، اس کرب کی وجہ سے جو آپ کو اپنی قوم کے جھٹلانے اور اللہ کے حکم کو رد کرنے کی وجہ سے تھا۔ پس انصار اللہ کا نفس (تنگی دور کرنا) تھے جس کے ذریعے اس نے اپنے نبی صلی اللہ علیہ وسلم سے مکذبین کی وجہ سے ہونے والے کرب کو دور کیا۔ کیونکہ اللہ تعالیٰ اس نفس (سانس) سے پاک ہے جو سانس لینے والے سے خارج ہونے والی ہوا ہے۔ اللہ تعالیٰ ظالموں کی طرف سے اس کی طرف منسوب کی جانے والی باتوں سے بہت بلند و برتر ہے۔\n\n(صورة) کا اطلاق امر پر، لوگوں کے نزدیک معلوم چیز پر اور دیگر پر ہوتا ہے۔ صحیح اور دیگر احادیث میں اللہ کی طرف صورت (الصورة) کی اضافت وارد ہوئی ہے۔\n\nجیسے عکرمہ کی حدیث میں ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: \"میں نے اپنے رب کو ایک نوجوان کی صورت میں دیکھا۔\"\n\nاور اسی طرح آپ صلی اللہ علیہ وسلم کا یہ قول: \"بے شک اللہ نے آدم کو اپنی صورت (الصورة) پر پیدا کیا۔\"\n\nجان لیجیے کہ قرآن میں وارد ہونے والی مثلیت لغوی ہے، عقلی نہیں، کیونکہ عقلی مثلیت اللہ تعالیٰ پر محال ہے۔ (جیسے کہا جاتا ہے) \"زید شیر ہے شدت میں\"، \"زید زہیر ہے شاعری میں\"۔ جب آپ کسی موجود کو ایک یا دو صفتوں سے متصف کرتے ہیں، پھر کسی دوسرے کو بھی اسی صفت سے متصف کرتے ہیں، اگرچہ ان دونوں کے درمیان دیگر حقائق کے پہلو سے تباین (فرق) ہو، لیکن وہ دونوں اس صفت کی روح اور اس کے معنی میں شریک ہوتے ہیں۔ پس ان میں سے ہر ایک خاص طور پر اس صفت میں دوسرے کی صورت پر ہوتا ہے۔ پس سمجھو اور ہوشیار ہو جاؤ، اور اپنے آپ کو اس پر دلیل کے طور پر دیکھو۔ اور کیا تم نے اسے کمال کی کسی صفت سے متصف کیا ہے مگر اپنے آپ سے؟ پس غور کرو۔ پس جب تم مناظرہ سے عاری ہونے کے دروازے سے داخل ہوتے ہو، تو تم اس سے ان نقائص کو سلب کر لیتے ہو جو تم پر جائز ہیں، اگرچہ وہ اس کے ساتھ کبھی قائم نہیں ہوئے، لیکن مجسم (تجسیم کرنے والے) اور مشبہ (تشبیہ دینے والے) نے جب انہیں اس کی طرف منسوب کیا، تو تم نے اس اضافت کو سلب کر لیا۔ اور اگر یہ وہم نہ ہوتا تو تم یہ سلب کا فعل نہ کرتے۔ پس جان لو۔ اور اگرچہ یہاں صورت (الصورة) کے بہت سے پہلو ہیں، ہم نے انہیں ذکر کرنے سے گریز کیا ہے، اس کتاب میں طوالت کو حذف کرنے کے اپنے مقصد کی وجہ سے۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\n\nنبی صلی اللہ علیہ وسلم سے حدیث میں وارد ہوا ہے کہ جہنم میں کافر کی داڑھ احد پہاڑ کے برابر ہوگی اور اس کی جلد کی موٹائی جبار (الجبار) کے ہاتھ کے چالیس ہاتھ ہوگی۔\n\nیہ مقدار کی تشریفی اضافت ہے جسے اللہ تعالیٰ نے مقرر کیا اور اسے اپنی طرف منسوب کیا۔ جیسا کہ آپ کہتے ہیں: \"یہ چیز بادشاہ کے ہاتھ کے اتنے اتنے ہاتھ ہے\"، اس سے آپ کی مراد وہ سب سے بڑا ہاتھ ہے جسے بادشاہ نے مقرر کیا، اگرچہ بادشاہ کا ہاتھ جو کہ جارحہ (عضو) ہے، لوگوں کے ہاتھوں جیسا ہی ہو، اور وہ ہاتھ جسے اس نے مقدار مقرر کیا ہے، وہ جارحہ کے ہاتھ سے نصف یا تہائی زیادہ ہو۔ پس وہ حقیقت میں اس کا ہاتھ نہیں ہے، بلکہ وہ ایک مقدار ہے جسے اس نے مقرر کیا، پھر اسے مقرر کرنے والے کی طرف منسوب کیا گیا۔ پس جان لو۔ اور \"الجبار\" (جبار) زبان میں عظیم بادشاہ کو کہتے ہیں۔\n\nاور اسی طرح \"يضع الجبار فيها قدمه\" (جبار اس میں اپنا قدم رکھتا ہے)۔ \"قدم\" (پاؤں) جارحہ (عضو) بھی ہے، اور کہا جاتا ہے: \"فلاں کا اس معاملے میں قدم ہے\"، یعنی ثبوت (استحکام) ہے۔ اور \"قدم\" مخلوق کی ایک جماعت بھی ہے۔ پس \"قدم\" اضافت ہو سکتی ہے۔ اور \"الجبار\" بادشاہ بھی ہو سکتا ہے، اور یہ قدم اس بادشاہ کا ہو سکتا ہے، کیونکہ جارحہ اللہ تعالیٰ پر محال ہے۔\n\n**(اور استواء)**\n\nاور استواء (الاستواء) کا اطلاق استقرار (ٹھہرنا)، قصد (ارادہ کرنا) اور استیلاء (غالب آنا) پر بھی ہوتا ہے۔ اور استقرار اجسام کی صفات میں سے ہے، لہٰذا اللہ تعالیٰ پر جائز نہیں، مگر یہ کہ وہ ثبوت کے پہلو سے ہو۔ اور قصد ارادہ ہے، اور یہ صفات کمال میں سے ہے۔ اللہ تعالیٰ نے فرمایا: \"ثُمَّ اسْتَوى‏ إِلَى السَّماءِ\" (پھر اس نے آسمان کی طرف قصد کیا) یعنی ارادہ کیا۔ اور \"وَاسْتَوى‏ عَلَى الْعَرْشِ\" (اور عرش پر استواء فرمایا) یعنی غالب آیا (استیلاء کیا)۔\n\n> بشر نے عراق پر استیلاء (غلبہ) حاصل کر لیا،\n> بغیر تلوار اور بہائے گئے خون کے۔\n\nاور احادیث اور آیات بہت ہیں، جن میں سے کچھ صحیح ہیں اور کچھ ضعیف، اور ان میں سے کوئی خبر ایسی نہیں مگر یہ کہ اس کا تنزیہ (التنزيه) کے پہلوؤں میں سے کوئی پہلو ہے۔ اور اگر آپ چاہیں کہ یہ آپ کے لیے قریب ہو جائے، تو اس لفظ کا ارادہ کریں جو تشبیہ (التشبيه) کا وہم پیدا کرتا ہے، اور اس کا فائدہ اور اس کی روح لیں، یا جو اس سے پیدا ہوتا ہے، اور اسے حق (الحق) کے حق میں قرار دیں، تو آپ تنزیہ کے درجے کو حاصل کر لیں گے، جبکہ آپ کے علاوہ کسی اور نے تشبیہ کے ادراک کو حاصل کیا۔ پس آپ اسی طرح کریں اور اپنے لباس کو پاک کریں۔ اور ان احادیث کے لیے یہ مقدار کافی ہے، کیونکہ باب طویل ہو چکا ہے۔\n\n### روح اقدس (الروح الأقدس) کا نفوس کے دل میں پھونکنا [شرعی زبان میں تشبیہ کے الفاظ کا رمزی معنی]\n\nجو الفاظ پہلے گزرے، ان کے ذریعے جب تعجب کرنے والے نے اس شخص پر تعجب کیا جو اس کی صورت پر ظاہر ہوا اور اس کے باطن میں اس کی مخالفت کی، تو وہ اس کے وجود پر خوش ہوا اور اس کے شہود (الشہود) پر ہنسا، اور اس کے منہ موڑنے پر غضبناک ہوا، اور اس کے قریب آنے پر خندہ پیشانی سے ملا (تبشبش)، اور اس کے ظاہر کو بھلا دیا (نسی)، اور سانس لی (تنفس)، اور اس کے پیچھے کی چیزوں کو آزاد کر دیا، اور اپنی ملکیت پر ثابت قدم رہا، اور تقدیر کے ذریعے اپنی ملکیت پر حکم چلایا۔ پس جو اس نے چاہا وہ ہو گیا، اور اللہ ہی کی طرف لوٹنا ہے۔ پس یہ مجرد ارواح ہیں جنہیں مسند اشباح (جسموں) کے ذریعے دیکھا جاتا ہے۔ پس جب میقات آ جائے گا اور اوقات ختم ہو جائیں گے، اور آسمان گردش کرے گا، اور سورج لپیٹ دیا جائے گا، اور زمین بدل دی جائے گی، اور ستارے بکھر جائیں گے، اور امور منتقل ہو جائیں گے، اور آخرت ظاہر ہو جائے گی، اور انسان اور دیگر کو حافرہ (پہلی حالت) میں دوبارہ اٹھایا جائے گا، اس وقت اشباح (جسم) تعریف کریں گے، اور ارواح سانس لیں گی، اور فتاح (کھولنے والا) ظہور الٰہی (التجلی) فرمائے گا، اور چراغ روشن ہو جائے گا، اور شراب چمک اٹھے گی، اور خالص محبت ظاہر ہو جائے گی، اور اصرار ختم ہو جائے گا، اور پر (جناح) پھڑپھڑائے گا، اور رات کے آغاز سے صبح تک ضراح (شور و غل) کے ساتھ تعمیر ہوگی۔ پس یہ کتنا عمدہ مقام ہے، اور نفوس کے لیے کتنی لذیذ اور کامل حالت ہے! اللہ ہمیں اس سے بہرہ مند فرمائے۔",
    "fa": "«باب سوم: در تنزیه حق تعالی (الحق تعالی) از آنچه در بطن کلمات است»\n\nکه خداوند سبحان در کتاب خود و بر زبان رسولش (صلی الله علیه و سلم) در مورد او به کار برده است، از تشبیه و تجسیم (التجسیم). خداوند بسیار برتر است از آنچه ستمکاران می‌گویند.\n\n> شعری در باب نظر بنده به پروردگارش، *** در قداست دست‌ها و تنزیه او.\n> و برتری او از ابزارهایی که آمدند *** تا به کیفیت و تشبیه او ملحق شوند.\n> دلالتی که قاطعانه بر *** منزلت بنده و ارتقای او حکم می‌کند.\n> و بر صحت علم و اثبات آن، *** و طرد بدعت و فریب آن.\n\n### [تمامی معلومات را عقل اول (العقل الأول) حمل کرده است]\n\nبدان، خداوند تو را یاری کند، که حامل تمامی معلومات، اعم از علوی و سفلی، «عقل» است که بدون واسطه از حق تعالی (الحق تعالی) دریافت می‌کند. پس هیچ چیز از علم هستی (الکون) بالا و پایین بر او پوشیده نیست. و از موهبت وجود اوست که معرفت (المعرفة) اشیاء برای نفس حاصل می‌شود، و از تجلی (التجلی) و نور و فیض اقدس اوست. پس عقل از حق تعالی (الحق تعالی) بهره می‌گیرد و به نفس فایده می‌رساند، و نفس از عقل بهره می‌گیرد و فعل از نفس صادر می‌شود. این امر در تمام آنچه علم عقل به اشیای مادون خود تعلق گرفته، جاری است. ما تنها به اشیای مادون عقل محدود کردیم به دلیل آنچه از افاده (فایده‌رسانی) ذکر کردیم. و در نظر خود از این سخن خداوند تعالی که می‌فرماید: **حَتَّى نَعْلَمَ** (تا بدانیم) در حالی که او داناست، بر حذر باش و سبب آن را بشناس.\n\n### [عالم مهیم (العالم المهيم)]\n\nو بدان که عالم مهیم (العالم المهيم) هیچ بهره‌ای از عقل اول (العقل الأول) نمی‌گیرد و عقل بر مهیمین (المهيمين) سلطه‌ای ندارد، بلکه آن‌ها و عقل در یک مرتبه قرار دارند، مانند افرادی از ما که از حکم قطب (القطب) خارج هستند. اگرچه قطب خود یکی از افراد است، اما عقل به افاده اختصاص یافته، همان‌طور که قطب از میان افراد به ولایت اختصاص یافته است.\n\n### [علم تجرید توحید (تجريد التوحيد)]\n\nو این امر در تمام آنچه علم عقل به آن تعلق گرفته جاری است، مگر علم تجرید توحید (تجريد التوحيد) به طور خاص؛ زیرا این علم از هر جهت با سایر معلومات متفاوت است، چرا که هیچ مناسبتی مطلقاً میان خداوند تعالی و خلق او وجود ندارد. و اگر روزی مناسبتی بر او اطلاق شود، چنانکه امام ابوحامد غزالی و دیگران در کتب خود اطلاق کرده‌اند، این از باب نوعی تکلف و هدفی دور از حقایق (الحقائق) است. وگرنه، چه نسبتی میان حادث و قدیم است؟ یا چگونه کسی که مِثل نمی‌پذیرد، شبیه کسی می‌شود که مِثل می‌پذیرد؟ این محال است، چنانکه ابوالعباس بن العریف صنهاجی در «محاسن المجالس» که به او منسوب است، گفته است: «میان او و بندگان نسبتی نیست مگر عنایت، و سببی نیست مگر حکم، و زمانی نیست جز ازل. و آنچه باقی می‌ماند، کوری و فریب است.» و در روایتی به جای «کوری» (عمى)، «علم» آمده است. پس بنگر که این کلام چقدر نیکو و این معرفت (المعرفة) به خداوند چقدر کامل و این مشاهده (المشاهدة) چقدر مقدس است. خداوند او را از آنچه گفت بهره‌مند سازد.\n\n### [عجز عقل از معرفت خداوند]\n\nپس علم به خداوند برای ادراک عقل و نفس دشوار است، مگر از این جهت که او موجودی متعالی و مقدس است. و هر آنچه در حق مخلوقات به زبان آورده می‌شود یا در مورد مرکبات و غیره توهم می‌شود، خداوند سبحان در نظر عقل سلیم، از حیث تفکر و عصمت آن، بر خلاف آن است. آن توهم بر او جایز نیست و آن لفظ از وجهی که مخلوقات می‌پذیرند، عقلاً بر او جاری نمی‌شود. اگر هم بر او اطلاق شود، از باب نزدیک کردن به اذهان است تا وجود (الوجود) نزد شنونده ثابت شود، نه برای اثبات حقیقتی که حق (الحق) بر آن است. زیرا خداوند تعالی می‌فرماید: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست). اما از نظر شرعی، به دلیل سخن خداوند به پیامبرش (صلی الله علیه و سلم) که می‌فرماید: **فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله** (پس بدان که هیچ معبودی جز الله نیست)، بر ما واجب است. او می‌گوید: بدان از طریق خبر دادن من که موافق با نظر توست، تا ایمان (الایمان) برای تو از روی علم صحیح باشد، همان‌طور که علم بدون ایمان که قبل از تعریف است، برای تو صحیح بود. پس او امر کرد. از این رو، بر اساس نظر و رأی برخی از مردم، ما بررسی کردیم که چگونه می‌توانیم به معرفت (المعرفة) او دست یابیم. پس بر اساس حکم انصاف و آنچه عقل کامل پس از تلاش و کوشش ممکن به او داد، نظر کردیم. ما به معرفت (المعرفة) او نرسیدیم مگر با عجز از معرفت او؛ زیرا ما خواستیم او را بشناسیم، همان‌طور که معرفت همه اشیاء را از جهت حقیقتی که معلومات بر آن هستند، می‌طلبیم. پس چون دانستیم که موجودی هست که مِثل ندارد و در ذهن تصور نمی‌شود و ادراک نمی‌گردد، چگونه عقل می‌تواند او را درک کند؟ این امر با وجود ثبوت علم به هستی (الوجود) او جایز نیست. ما می‌دانیم که او موجودی واحد در الوهیت خود است، و این همان علمی است که از ما خواسته شده، در حالی که به حقیقت ذات او که خداوند خود را بر آن می‌شناسد، عالم نیستیم. و آن، علم به عدم علم است که از ما خواسته شده است. چون او تعالی در نظر عقل شبیه هیچ یک از مخلوقات نیست و هیچ چیز از مخلوقات شبیه او نیست، واجب بود که ابتدا، هنگامی که به ما گفته شد: «پس بدانید که هیچ معبودی جز الله نیست»، بدانیم که علم چیست. و ما دانستیم. پس آنچه از علمِ علم بر ما واجب بود، دانستیم. (پایان جزء هشتم و الحمد لله).\n\n(بسم الله الرحمن الرحیم)\n\n### [اصول مطالبات علمی]\n\nپس می‌گوییم: چون اصول مطالبات علمی چهار چیز است: «هل» (آیا)، «ما» (چیست)، «کیف» (چگونه) و «لم» (چرا)؛ «هل» و «لم» دو طلب روحانی و بسیط هستند که «ما هو» (ماهیت) آن‌ها را همراهی می‌کند. پس «هل» و «لم» دو اصل صحیح برای بسیط‌ها هستند، زیرا در «ما هو» نوعی ترکیب وجود دارد. و در این چهار طلب، هیچ طلبی نیست که شایسته باشد از جهت آنچه حقیقت (الحقیقة) اقتضا می‌کند، درباره خداوند تعالی سؤال شود؛ زیرا در علم توحید (التوحید) صحیح نیست شناخته شود مگر نفی آنچه در غیر او سبحانه یافت می‌شود. و به همین دلیل فرمود: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) و **سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ** (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند).\n\n### [علم به سلب، علم به خداوند است]\n\nپس علم به سلب (نفی صفات) همان علم به خداوند سبحان است. همان‌طور که جایز نبود در مورد ارواح بگوییم «چگونه» (کیف)، زیرا ارواح از آن منزه هستند و حقایق (حقائق) آن‌ها با این عبارت مخالف است؛ همچنین ابزارهایی که برای سؤال از ارواح به کار می‌رود، جایز نیست که بر خداوند تعالی اطلاق شود. و شایسته نیست که محقق موحدی که به ساحت مبدع و مخترع خود احترام می‌گذارد، این الفاظ را بر او اطلاق کند. بنابراین، او هرگز با این مطالبات شناخته نمی‌شود.\n\n### «وصل» [مدرَک به ذات، مدرَک به فعل و آنچه اصلاً ادراک نمی‌شود]\n\nسپس ما در تمام آنچه غیر از حق تعالی (الحق تعالی) است نیز نظر کردیم و آن را بر دو قسم یافتیم: قسمی که به ذات خود ادراک می‌شود و آن محسوس و کثیف است؛ و قسمی که به فعل خود ادراک می‌شود و آن معقول و لطیف است. پس معقول به واسطه این منزلت از محسوس برتر شد، و آن تنزه از ادراک شدن به ذات است و تنها به فعل ادراک می‌شود. و چون این‌ها اوصاف مخلوقات هستند، حق تعالی (الحق تعالی) مقدس است از اینکه به ذات خود مانند محسوس، یا به فعل خود مانند لطیف یا معقول ادراک شود؛ زیرا سبحانه هیچ مناسبتی با خلق خود ندارد. چون ذات او برای ما ادراک‌پذیر نیست تا شبیه محسوس باشد، و فعل او نیز مانند فعل لطیف نیست تا شبیه لطیف باشد؛ زیرا فعل حق تعالی (الحق تعالی) ابداع (ایجاد) شیء است نه از شیء، در حالی که لطیف روحانی فعل شیء از اشیاء است. پس چه مناسبتی میان آن دو وجود دارد؟ بنابراین، وقتی مشابهت در فعل ممتنع است، به طریق اولی مشابهت در ذات ممتنع خواهد بود. و اگر می‌خواهی چیزی از این فصل را تحقیق کنی، به مفعول این فعل بر حسب انواع مفعولات بنگر؛ مانند مفعول صناعی (صنعتی) همچون پیراهن و صندلی. ما دریافتیم که صانع خود را نمی‌شناسد، جز اینکه به خودی خود بر وجود صانع و علم او به صنعتش دلالت می‌کند. همچنین مفعول تکوینی که فلک و کواکب هستند، مُکَوِّن (ایجادکننده) و مُرَکِّب (ترکیب‌کننده) خود را که همان نفس کلی (النفس الکلیة) محیط بر آن‌هاست، نمی‌شناسند. و همچنین مفعول طبیعی مانند موالید (زادگان) از معادن، نباتات و حیوانات که طبیعتی از مفعول تکوینی را انجام می‌دهند، بر فاعل خود که فلک و کواکب هستند، وقوف ندارند. پس علم به افلاک، آنچه از جرم آن‌ها می‌بینی و حس آن را درک می‌کند، نیست؛ و جرم خورشید در ذات خود کجا و در چشم بیننده ما کجا؟ بلکه علم به افلاک از جهت روح و معنای آن‌هاست که خداوند تعالی آن را از نفس کلی محیط که سبب افلاک و آنچه در آن‌هاست، برایشان ایجاد کرده است. و همچنین مفعول انبعاثی (برخاسته) که همان نفس کلی (النفس الکلیة) است که از عقل (العقل) منبعث شده، مانند انبعاث صورت دحیه از حقیقت جبرئیلیه (الحقیقة الجبرئیلیة)؛ این نفس اصلاً آن چیزی را که از آن منبعث شده نمی‌شناسد، زیرا تحت احاطه اوست و او محیط بر آن است، چون نفس خاطری از خواطر اوست. پس چگونه می‌تواند آنچه را که فوق اوست و چیزی از آن در او نیست مگر آنچه در اوست، بداند؟ پس تنها نفس خود را شناخته، نه سبب خود را. و همچنین مفعول ابداعی (الابداعی) که نزد ما حقیقت محمدیه (الحقیقة المحمدیة) و نزد دیگران عقل اول (العقل الأول) است و همان قلم اعلی است که خداوند تعالی آن را از غیر شیء ابداع کرده است؛ این مفعول از ادراک فاعل خود عاجزتر و ممتنع‌تر از هر مفعولی است که ذکرش گذشت؛ زیرا میان هر مفعول و فاعلش که ذکر شد، نوعی از مناسبت و مشابهت وجود دارد، پس ناگزیر باید به اندازه‌ای که میان آن‌ها مناسبت هست، شناخته شود، خواه از جهت جوهریت یا غیر آن. اما میان مبدع اول و حق تعالی (الحق تعالی) هیچ مناسبتی نیست. پس او از معرفت فاعل خود عاجزتر از سایر مفعولات اسباب است، زیرا مفعولی که از وجوهی شبیه سبب فاعل خود است، از ادراک و علم به او عاجز مانده است. پس این را بفهم و تحقیق کن، زیرا در باب توحید (التوحید) و عجز علم حادث از تعلق به خداوند تعالی بسیار سودمند است.\n\n### «وصل» [قوای پنج‌گانه و مدرکات حقیقی آن‌ها]\n\nآنچه ذکر کردیم، با این نکته تأیید می‌شود که انسان تمامی معلومات را تنها با یکی از قوای پنج‌گانه ادراک می‌کند: قوه حسی که شامل پنج حس بویایی، چشایی، لامسه، شنوایی و بینایی است. بینایی رنگ‌ها، رنگینه‌ها و اشخاص را در حد معلومی از نزدیکی و دوری ادراک می‌کند؛ آنچه از یک میل (مسافت) ادراک می‌شود، غیر از آن است که از دو میل ادراک می‌شود؛ و آنچه از بیست ذراع ادراک می‌شود، غیر از آن است که از یک میل ادراک می‌شود؛ و آنچه در مقابل اوست و دستش در دست اوست، غیر از آن است که از بیست ذراع ادراک می‌شود. آنچه از دو میل ادراک می‌شود، شخصی است که نمی‌دانی آیا انسان است یا درخت؛ و در یک میل می‌دانی که انسان است؛ و در بیست ذراع می‌دانی که سفید است یا سیاه؛ و در مقابله می‌دانی که آبی است یا سرمه‌ای. و سایر حواس نیز در ادراکات خود از نزدیکی و دوری چنین هستند. و باری تعالی (الباری سبحانه) محسوس نیست، یعنی در زمان طلب معرفت (المعرفة) به او، نزد ما با حس ادراک نمی‌شود. پس ما او را از طریق حس نشناختیم. اما قوه خیالیه (القوة الخيالية) تنها آنچه را که حس به او داده است، ضبط می‌کند؛ یا به همان صورتی که حس داده، یا به صورتی که فکر از طریق حمل برخی محسوسات بر برخی دیگر به او داده است. و روش اهل فکر در معرفت حق (الحق) تا اینجا پایان می‌یابد. این زبان آن‌هاست، نه زبان ما، اگرچه حق است، اما ما آن را به آن‌ها نسبت می‌دهیم، زیرا از آن‌ها نقل شده است. این قوه، هرگونه که ادراک کند، هرگز از حس خارج نمی‌شود. و چون تعلق حس به خداوند نزد ما باطل شد، پس تعلق خیال به او نیز باطل است. اما قوه مفکره (القوة المفكرة)، انسان هرگز تفکر نمی‌کند مگر در اشیایی که نزد او موجود است و از طریق حواس و اوائل عقل دریافت کرده است. و از تفکر در آن‌ها در خزانه خیال، علمی به امر دیگری حاصل می‌شود که میان آن و این اشیایی که در آن‌ها تفکر کرده، مناسبتی وجود دارد. و هیچ مناسبتی میان خداوند و خلق او نیست. بنابراین، علم به او از طریق فکر صحیح نیست. و به همین دلیل، علما از تفکر در ذات خداوند تعالی منع کرده‌اند. اما قوه عقلیه (القوة العقلية)، صحیح نیست که عقل او را ادراک کند؛ زیرا عقل جز آنچه را که بدیهتاً دانسته یا آنچه را که فکر به او داده است، نمی‌پذیرد. و چون ادراک فکر برای او باطل شد، پس ادراک عقل از طریق فکر نیز برای او باطل است. اما از آنجا که عقل، حدش این است که آنچه را نزد او حاصل شده، تعقل و ضبط کند، ممکن است حق (الحق) معرفت (المعرفة) خود را به او ببخشد و عقل آن را تعقل کند، زیرا او عقل است، نه از طریق فکر. ما این را منع نمی‌کنیم؛ زیرا این معرفتی که حق تعالی (الحق تعالی) به هر کس از بندگانش که بخواهد می‌بخشد، عقل به تنهایی قادر به ادراک آن نیست، اما آن را می‌پذیرد. و هیچ دلیل و برهانی بر آن اقامه نمی‌شود، زیرا فراتر از طور مدارک عقل است. سپس، این اوصاف ذاتی امکان بیان ندارند، زیرا خارج از تمثیل و قیاس هستند، چرا که **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست). پس هر عقلی که چیزی از این معرفت (المعرفة) برایش کشف (الکشف) نشده باشد، از عقل دیگری که برایش کشف شده سؤال می‌کند، اما آن عقل مسئول قدرت بیان آن را ندارد و امکان‌پذیر نیست. و به همین دلیل صدیق (ابوبکر) گفت: «عجز از درکِ ادراک، خود ادراک است.» و این کلام دو مرتبه دارد، پس بفهم. کسی که خداوند را با عقل خود از طریق فکر و نظرش طلب کند، سرگردان است. و تنها وظیفه او آماده شدن برای پذیرش چیزی است که خداوند از آن به او می‌بخشد، پس بفهم. اما قوه ذاکره (القوة الذاكرة)، راهی برای ادراک علم به خداوند ندارد؛ زیرا تنها چیزی را به یاد می‌آورد که عقل قبلاً آن را دانسته و سپس غفلت یا فراموش کرده است. و چون او را ندانسته، پس قوه ذاکره راهی به سوی او ندارد. و مدارک انسان به آنچه انسان است و آنچه ذاتش به او می‌دهد و در آن کسبی دارد، محدود شد. و آنچه باقی می‌ماند، تنها آمادگی عقل برای پذیرش معرفتی است که حق (الحق) جل و تعالی به او می‌بخشد. پس او هرگز از طریق دلیل شناخته نمی‌شود، مگر معرفت وجود (الوجود) و اینکه او واحد معبود است و نه غیر. زیرا انسان مُدرِک هرگز نمی‌تواند چیزی را ادراک کند مگر اینکه مِثل آن در او موجود باشد. اگر چنین نبود، هرگز آن را ادراک نمی‌کرد و نمی‌شناخت. پس اگر چیزی را نشناخت مگر اینکه مِثل آن شیء شناخته شده در او باشد، در واقع جز آنچه شبیه و مشابه اوست، نشناخته است. و باری تعالی (الباری تعالی) شبیه هیچ چیز نیست و مِثل او در هیچ چیز نیست، پس هرگز شناخته نمی‌شود.\n\n### [اشیاء طبیعی جز از مشابه خود غذا نمی‌پذیرند]\n\nو آنچه ذکر کردیم، با این نکته تأیید می‌شود که اشیای طبیعی جز از مشابه خود غذا نمی‌پذیرند. اما آنچه مشابه آن‌ها نیست، قطعاً از آن غذا نمی‌پذیرند. مثال آن این است که موالید (زادگان) از معادن، نباتات و حیوانات از طبایع چهارگانه ترکیب شده‌اند و موالید جز از آن‌ها غذا نمی‌پذیرند، زیرا سهمی از آن طبایع در آن‌ها وجود دارد. و اگر کسی از خلق بخواهد غذای جسم خود را که از این طبایع ترکیب شده، از چیزی که از غیر این طبایع یا آنچه از آن‌ها ترکیب نشده است، قرار دهد، نمی‌تواند. همان‌طور که برای هیچ یک از اجسام طبیعی ممکن نیست که غذا بپذیرند مگر از چیزی که از طبایعی است که خود از آن هستند، همچنین برای هیچ کس ممکن نیست که چیزی را بداند که مِثل آن مطلقاً در او نیست. آیا نمی‌بینی که نفس از عقل نمی‌پذیرد مگر آنچه را که در آن با او مشارکت و مشابهت دارد؟ و آنچه را که در آن با او مشارکت ندارد، هرگز از او نمی‌داند. و هیچ چیز از خداوند در هیچ کس نیست و این امر به هیچ وجه بر او جایز نیست. پس هیچ کس او را از طریق نفس و فکر خود نمی‌شناسد.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «همانا خداوند از عقول محجوب شد، همان‌طور که از دیدگان محجوب شد، و ملأ اعلی (فرشتگان برتر) او را می‌طلبند، همان‌طور که شما او را می‌طلبید.»\n\nپس پیامبر (علیه السلام) خبر داد که عقل او را با فکر خود و نه با چشم بصیرت خود درک نکرده است، همان‌طور که بصر او را درک نکرده است. و این همان چیزی است که در بخش پیشین باب خود به آن اشاره کردیم. پس حمد و سپاس از آن خداست بر آنچه الهام کرد و به ما آموخت آنچه را که نمی‌دانستیم، و فضل خداوند بزرگ بود.\n\n### [تنزیه (التنزيه) و نفی مماثلت و تشبیه (التشبيه)]\n\nتنزیه (التنزيه) و نفی مماثلت و تشبیه (التشبيه) باید این‌گونه باشد. و گمراه نشدند کسانی از مُشَبّهه (قائلین به تشبیه) که گمراه شدند، مگر به واسطه تأویل و حمل آیات و اخباری که وارد شده‌اند بر آنچه از آن‌ها به اذهان متبادر می‌شود، بدون توجه به آنچه از تنزیه (التنزيه) برای خداوند تعالی واجب است. این امر آن‌ها را به جهل محض و کفر صریح سوق داد. اگر آن‌ها طالب سلامت بودند و اخبار و آیات را همان‌گونه که آمده‌اند، بدون هیچ عدولی، رها می‌کردند و علم آن را به خداوند تعالی و رسولش واگذار می‌کردند و می‌گفتند: «نمی‌دانیم»، همان قول خداوند تعالی که **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) برایشان کافی بود. پس هرگاه حدیثی به آن‌ها رسید که در آن تشبیه بود، در واقع خداوند را شبیه چیزی قرار داده‌اند، در حالی که او سبحانه شَبَه را از خود نفی کرده است. پس چاره‌ای نیست جز اینکه آن خبر وجهی از وجوه تنزیه (التنزيه) دارد که خداوند تعالی آن را می‌داند و برای فهم عربی که قرآن به زبان او نازل شده، آورده شده است. و تو هرگز در هیچ خبر یا آیه‌ای، لفظی را که به تنهایی نص صریح در تشبیه باشد، نخواهی یافت. بلکه آن را نزد عرب می‌یابی که وجوهی را محتمل است؛ برخی از آن‌ها به تشبیه می‌انجامد و برخی به تنزیه. پس حمل آن لفظ توسط تأویل‌کننده بر وجهی که به تشبیه می‌انجامد، ظلمی از جانب او بر آن لفظ است، زیرا حق آن را که وضعش در زبان اقتضا می‌کند، ادا نکرده است، و تجاوزی است بر خداوند تعالی، زیرا چیزی را بر او سبحانه حمل کرده که شایسته خداوند تعالی نیست. و ما ان‌شاءالله تعالی برخی از احادیثی را که در تشبیه وارد شده‌اند، می‌آوریم و نشان می‌دهیم که نص صریح در آن نیستند. **فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ فَلَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ** (پس حجت رسا از آن خداست، و اگر می‌خواست، همه شما را هدایت می‌کرد).\n\n### [تشبیه (التشبيه) و تجسیم (التجسیم) در الفاظ سنت]\n\n«قلب مؤمن میان دو انگشت از انگشتان خداوند است.»\n\nنظر عقل بر اساس آنچه وضع (لغوی) از حقیقت و مجاز اقتضا می‌کند: جارحه (عضو بدن) بر خداوند تعالی محال است. «إصبع» (انگشت) لفظی مشترک است که بر جارحه و بر نعمت اطلاق می‌شود. راعی (شاعر) می‌گوید:\n\n> ضعيف العصا بادي العروق ترى له *** عليها إذا ما أمحل الناس أصبعا\n\n(کسی که عصایش ضعیف و رگ‌هایش آشکار است، برای او بر آن [شتران] اثری از انگشت می‌بینی، هنگامی که مردم دچار قحطی شوند.)\n\nاو می‌گوید: برای او بر آن [شتران] اثری نیکو از نعمت به واسطه حسن نظر بر آن‌ها می‌بینی. عرب می‌گوید: «ما أحسن أصبع فلان على ما له» (چه نیکوست انگشت فلان بر مالش)، یعنی اثر او در آن، و منظورشان رشد مال او به دلیل حسن تصرف او در آن است. سریع‌ترین دگرگونی، دگرگونی‌ای است که انگشتان آن را ایجاد می‌کنند، به دلیل کوچکی حجم و کمال قدرت در آن‌ها، پس حرکت آن‌ها سریع‌تر از حرکت دست و غیره است. و چون دگرگون کردن (تقلیب) قلب‌های بندگان توسط خداوند سریع‌ترین چیز است، پیامبر (صلی الله علیه و سلم) در دعای خود برای عرب‌ها با آنچه تعقل می‌کردند، فصاحت به خرج داد. و چون تقلیب نزد ما جز با دست صورت نمی‌گیرد، از این رو تقلیب را به انگشتان نسبت داد، زیرا انگشتان جزئی از دست هستند و سرعت در انگشتان بیشتر است.\n\nو پیامبر (علیه السلام) در دعای خود می‌فرمود: «ای دگرگون‌کننده قلب‌ها، قلب مرا بر دینت ثابت بدار.»\n\nو دگرگون کردن قلب‌ها توسط خداوند تعالی، همان چیزی است که در آن‌ها از همّ به نیکی و همّ به بدی خلق می‌کند. و چون انسان توالی خواطر متضاد را در قلب خود احساس می‌کند که این خود تعبیری از دگرگون کردن قلب توسط حق (الحق) است، و انسان نمی‌تواند علم به این امر را از خود دور کند، به همین دلیل:\n\nپیامبر (علیه السلام) می‌فرمود: «ای دگرگون‌کننده قلب‌ها، قلب مرا بر دینت ثابت بدار.» و در این حدیث آمده است که یکی از همسرانش به او گفت: «آیا می‌ترسی ای رسول خدا؟» پس پیامبر (صلی الله علیه و سلم) فرمود: «قلب مؤمن میان دو انگشت از انگشتان خداوند است.»\n\nپیامبر (صلی الله علیه و سلم) به سرعت دگرگونی از ایمان به کفر و آنچه مادون آن است، اشاره می‌کند. خداوند تعالی می‌فرماید: **فَأَلْهَمَها فُجُورَها وتَقْواها** (پس فجور و تقوای آن را به او الهام کرد). و این الهام همان تقلیب (دگرگونی) است. و انگشتان برای سرعت هستند، و دوگانگی آن‌ها برای خاطر نیک و خاطر زشت است. پس اگر از «أصابع» (انگشتان) آنچه را که ذکر کردم فهمیدی، و جارحه (عضو بدن) را از آن فهمیدی، و نعمت و اثر نیکو را از آن فهمیدی، به چه وجهی آن را به جارحه ملحق می‌کنی، در حالی که این وجوه منزه آن را می‌طلبند؟ پس یا سکوت می‌کنیم و علم آن را به خداوند تعالی و به کسی که حق (الحق) آن را به او شناسانده است، از رسول مرسل یا ولی ملهم، واگذار می‌کنیم، به شرط نفی جارحه که ضروری است؛ و یا اگر احساس کردیم که زیاده‌روی است و بر ما غلبه کرد که با آن بر بدعت‌گذار مُجَسِّم (قائل به جسمانیت) و مُشَبّه (قائل به تشبیه) رانده شده رد کنیم، در این صورت زیاده‌روی نیست، بلکه بر عالم واجب است که در آن هنگام وجوه تنزیه (التنزيه) موجود در آن لفظ را تبیین کند تا با آن، حجت مُجَسِّمِ خوار شده را باطل سازد. خداوند توبه ما و او را بپذیرد و اسلام را روزی او گرداند. پس اگر ناگزیر در مورد آن کلمه‌ای که توهم تشبیه را ایجاد می‌کند، سخن گفتیم، عدول به شرح آن بر وجهی که شایسته خداوند سبحان است، اولویت دارد. این سهم عقل در وضع (لغوی) است.\n\n### (نفث روح در روع) [سهم قلب از دو انگشت]\n\nدو انگشت (الإصبعان) سرّ کمال ذاتی (الکمال الذاتی) هستند که چون در روز قیامت بر دیدگان آشکار شوند، انسان پدر کافر خود را می‌گیرد و او را در آتش می‌اندازد و هیچ دردی و شفقت بر او نمی‌یابد. به سرّ این دو انگشت که معنای آن‌ها متحد و لفظشان مثنی است، بهشت و دوزخ خلق شده و اسم «منوّر» (نوربخش) و «مظلم» (تاریکی‌بخش) و «مُنعم» (نعمت‌دهنده) و «مُنتقم» (انتقام‌گیرنده) ظاهر شده است. پس آن‌ها را دو انگشت از ده انگشت تصور نکن. و ناگزیر باید در این باب به این سرّ اشاره کرد: «هر دو دست او یمین (راست) است.» و این معرفت (المعرفة) کشف (الکشف) است؛ زیرا برای اهل بهشت دو نعمت است: نعمتی به بهشت و نعمتی به عذاب اهل دوزخ در آتش. و همچنین برای اهل دوزخ دو عذاب است. و هر دو گروه خداوند را به رؤیت اسماء می‌بینند، همان‌طور که در دنیا بودند. و در دو قبضه‌ای که از رسول خدا (صلی الله علیه و سلم) در حق حق (الحق) آمده است، سرّی است که به آن اشاره کردیم و معنای آن است. و **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند). قبضه و یمین (دست راست). خداوند تعالی می‌فرماید: **وَالْأَرْضُ جَمِيعاً قَبْضَتُهُ ... وَالسَّماواتُ مَطْوِيَّاتٌ بِيَمِينِهِ** (و زمین در روز قیامت یکسره در قبضه اوست... و آسمان‌ها در هم پیچیده به دست راست اوست). نظر عقل بر اساس آنچه وضع (لغوی) اقتضا می‌کند، این است که او سبحانه ابتدا منع کرد که قدر او اندازه‌گیری شود، به دلیل آنچه از تشبیه و تجسیم (التجسیم) به عقول ضعیف متبادر می‌شود، هنگام ورود آیات و اخباری که از وجهی از وجوه خود آن را افاده می‌کنند. سپس بعد از این تنزیه (التنزيه) که جز عالمان آن را تعقل نمی‌کنند، فرمود: **وَالْأَرْضُ جَمِيعاً قَبْضَتُهُ** (و زمین یکسره در قبضه اوست). ما از وضع زبان عربی دانستیم که وقتی گفته می‌شود: «فلان در قبضه من است»، منظور این است که تحت حکم من است، اگرچه مطلقاً چیزی از او در دست من نیست، اما امر من در مورد او جاری و حکم من بر او نافذ است، مانند حکم من بر آنچه حساً مالک آن شده‌ام و آن را قبض کرده‌ام. همچنین می‌گویم: «مالم در قبضه من است»، یعنی در ملک من است و من در تصرف در آن متمکن هستم، یعنی خود را از من منع نمی‌کند. پس اگر آن را تصرف کنم، در هنگام تصرفم در آن، برایم امکان بیشتری بود که بگویم: «در قبضه من است»، به دلیل تصرفم در آن، اگرچه بندگانم با اجازه من در آن تصرف می‌کنند. پس چون جارحه (عضو بدن) بر خداوند تعالی محال است، عقل به روح قبضه و معنا و فایده آن روی آورد، و آن مالکیت بر چیزی است که در حال حاضر قبض شده است، اگرچه برای قابض در آنچه قبض کرده است، چیزی نباشد، اما قطعاً در ملک قبضه است. پس عالم نیز این‌گونه در قبضه حق تعالی (الحق تعالی) است. و زمین در سرای آخرت، تعیین برخی از املاک است، همان‌طور که می‌گوییم: «خدمتکارم در قبضه من است»، اگرچه خدمتکارم جزئی از کسانی است که در قبضه من هستند، اما من او را به طور خاص ذکر کردم به دلیل وقوع حادثه‌ای. و «یمین» (دست راست) نزد ما محل تصرف مطلق و قوی است، زیرا یسار (دست چپ) قوت یمین را ندارد. پس با یمین از تمکن بر درهم پیچیدن کنایه آورده شده است. این اشاره‌ای است به تمکن قدرت بر فعل. پس با الفاظی که عرب آن‌ها را می‌شناسد و به سرعت آن‌ها را می‌پذیرد، به اذهان آن‌ها رسیده است. شاعر می‌گوید:\n\n> إذا ما راية رفعت لمجد *** تلقاها عرابة باليمين‏\n\n(هرگاه پرچمی برای مجد برافراشته شود، عرابه آن را با یمین (دست راست) دریافت می‌کند.)\n\nو مجد پرچم محسوس ندارد که جارحه یمین آن را دریافت کند. پس گویی می‌گوید: اگر برای مجد پرچم محسوس ظاهر می‌شد، محل آن یا حامل آن جز یمین عرابة الأوسی نبود، یعنی صفت مجد در او قائم و کامل است. پس عرب همواره الفاظ جوارح را بر آنچه جارحه نمی‌پذیرد، اطلاق می‌کرده است، به دلیل اشتراکی که از طریق معنا میان آن‌ها وجود دارد.\n\n### (نفث روح در روع) [سهم قلب از یمین و یسار]\n\nهنگامی که حق (الحق) بر سرّ بنده‌ای تجلی (التجلی) کند، تمامی اسرار را به او مالک می‌سازد و او را به آزادگان ملحق می‌کند و تصرف ذاتی از جهت یمین (راست) برای او حاصل می‌شود؛ زیرا شرف شمال به غیر اوست و شرف یمین به ذات اوست. سپس شرف یمین را به خطاب و شرف شمال را به تجلی (التجلی) نازل کرد. شرف انسان به معرفت (المعرفة) او به حقیقت خود و اطلاع بر آن است و آن یسار (چپ) است. و هر دو دست او از حیث اینکه شمال است، مانند آن است که هر دو دست حق (الحق) یمین است. به معنای اتحاد (الاتحاد) بازگرد. هر دو دست بنده یمین است. به توحید (التوحید) بازگرد. یکی از دو دست او یمین و دیگری شمال است. پس گاهی در جمع و جمع الجمع هستم و گاهی در فرق و فرق الفرق، بر اساس حکم تجلی (التجلی) و وارده.\n\n> روزی یمانی هستم اگر با یمنی ملاقات کنم، *** و اگر با مَعَدّی ملاقات کنم، عَدْنانی هستم.\n\nو از آن جمله است تعجب، خنده، شادی و غضب. تعجب تنها از موجودی سر می‌زند که از آن امر متعجب‌فیه آگاه نیست، سپس آگاه می‌شود و تعجب می‌کند و خنده به آن ملحق می‌شود. و این بر خداوند تعالی محال است، زیرا هیچ چیز از علم او خارج نشده است. پس هرگاه در هستی (الوجود) چیزی واقع شود که نزد ما جای تعجب داشته باشد، آن تعجب و خنده بر کسی حمل می‌شود که تعجب و خنده بر او جایز نیست؛ زیرا امر واقع شده نزد ما جای تعجب دارد، مانند جوانی که شیطنت ندارد. این امری است که جای تعجب دارد. پس نزد خداوند تعالی جای آنچه نزد ما جای تعجب دارد، قرار گرفت. و گاهی خنده و شادی به معنای قبول و رضایت است؛ زیرا کسی که برایش کاری انجام دهی و او به خاطر آن خنده و شادی نشان دهد، آن فعل را پذیرفته و از آن راضی شده است. پس خنده و شادی او تعالی، قبول و رضایت او از ماست. همان‌طور که غضب او تعالی از جوشش خون قلب برای طلب انتقام منزه است، زیرا او سبحانه از جسمیت و عرض مقدس است. پس این امر ممکن است به این بازگردد که او فعل کسی را انجام دهد که غضب بر او جایز است، و آن انتقام او سبحانه از جباران و مخالفین امر او و متجاوزان از حدود اوست. خداوند تعالی می‌فرماید: **وغضب عليه** (و بر او غضب کرد)، یعنی او را به جزای مغضوب‌علیه مجازات کرد. پس مجازات‌کننده، غضب‌کننده است. پس ظهور فعل، اسم را اطلاق کرد.\n\nاز باب شادی:\n\nدر خبر آمده است که «خداوند برای مردی که مساجد را برای نماز و ذکر آماده می‌کند، تبشبش (بشاشیت/خوشرویی) می‌کند.»\n\nاین حدیث زمانی است که مردم به واسطه اکوان (مخلوقات) محجوب شدند و به غیر خدا از خدا مشغول گشتند، پس با این کار در حال غیبت از خدا قرار گرفتند. هنگامی که با نوعی از انواع حضور بر او سبحانه وارد شدند، او سبحانه در قلب‌هایشان از لذت نعمت حضور، مناجات و شهود (الشهود) خود فرو فرستاد، به گونه‌ای که آن را محبوب قلب‌هایشان ساخت.\n\nزیرا پیامبر (علیه السلام) می‌فرماید: «خداوند را دوست بدارید به خاطر نعمت‌هایی که با آن شما را تغذیه می‌کند.»\n\nپس با «تبشبش» (خوشرویی) از این فعل او کنایه آورده شده است، زیرا این اظهار سرور به دلیل آمدن شما بر اوست. کسی که از آمدن تو شاد می‌شود، نشانه سرورش این است که نیکی را در حق تو آشکار می‌کند و محبت می‌ورزد و نعمت‌های خود را بر تو می‌فرستد. پس چون این امور از جانب خداوند بر بندگانی که بر او وارد می‌شوند، ظاهر شد، آن را «تبشبش» نامید.\n\nخداوند تعالی می‌فرماید: **فَنَسِيَهُمْ** (پس آن‌ها را فراموش کرد). نسیان (فراموشی) بر باری تعالی (الباری تعالی) جایز نیست، اما چون او تعالی آن‌ها را به عذاب ابدی عذاب داد و رحمت او تعالی به آن‌ها نرسید، گویی نزد او فراموش شده‌اند و او گویی آن‌ها را فراموش کرده است، یعنی این فعلِ فراموش‌کننده و کسی است که آنچه را که آن‌ها در آن از عذاب دردناک هستند، به یاد نمی‌آورد. و این بدان سبب است که آن‌ها در زندگی دنیوی خود **نَسُوا الله** (خدا را فراموش کردند)، پس او آن‌ها را به فعلشان جزا داد. پس فعل آن‌ها را به دلیل مناسبت بر خودشان بازگرداند. و ممکن است «نسيهم» (فراموششان کرد) به معنای «أخرهم» (به تأخیر انداختشان) باشد. **نَسُوا الله** (خدا را فراموش کردند)، یعنی امر خدا را به تأخیر انداختند و به آن عمل نکردند. خداوند نیز آن‌ها را در آتش به تأخیر انداخت، هنگامی که کسانی غیر از آن‌ها را که وارد آتش کرده بود، از آن خارج ساخت. و به این باب نزدیک است، متصف شدن حق (الحق) به مکر، استهزاء و تمسخر. خداوند تعالی می‌فرماید: **سَخِرَ الله مِنْهُمْ** (خداوند آن‌ها را مسخره کرد) و فرمود: **وَمَكَرَ الله** (و خداوند مکر کرد) و فرمود: **الله يَسْتَهْزِئُ بِهِمْ** (خداوند آن‌ها را استهزاء می‌کند).\n\nپیامبر (صلی الله علیه و سلم) فرمود: «باد را دشنام ندهید، زیرا آن از نفس (نَفَس) رحمان است.»\n\nو سخن او (علیه السلام) که فرمود: «من نفس (نَفَس) رحمان را می‌یابم که از سوی یمن به من می‌رسد.»\n\nو این همه از باب «تنفیس» (گشایش و رفع اندوه) است. گویی می‌گوید: باد را دشنام ندهید، زیرا از چیزهایی است که رحمان با آن از بندگانش گشایش می‌دهد. و (پیامبر) علیه السلام فرمود: «من با باد صبا یاری شدم.»\n\nاو می‌گوید: من نفس (نَفَس)، یعنی گشایش رحمان را از خود می‌یابم،\n\nبرای اندوهی که به دلیل تکذیب قومش و رد امر خداوند در آن بود، از سوی یمن. پس انصار، گشایش خداوند بودند که با آن‌ها اندوه پیامبر (صلی الله علیه و سلم) را از تکذیب‌کنندگان برطرف ساخت. زیرا خداوند تعالی از «نَفَس» که همان هوای خارج شده از تنفس‌کننده است، منزه است. خداوند بسیار برتر است از آنچه ستمکاران از این امور به او نسبت می‌دهند.\n\n«صورة» (صورت/شکل) بر امر، بر معلوم نزد مردم و بر غیر آن اطلاق می‌شود. در حدیث صحیح و غیر آن، اضافه صورت به خداوند وارد شده است.\n\nمانند حدیث عکرمه که پیامبر (علیه السلام) فرمود: «پروردگارم را در صورت جوانی دیدم.»\n\nاین حدیث، حالتی از پیامبر (صلی الله علیه و سلم) است و در کلام عرب معلوم و متعارف است. و همچنین\n\nسخن او (علیه السلام) که فرمود: «همانا خداوند آدم را بر صورت خود آفرید.»\n\nبدان که مماثلت (المثلية) وارد شده در قرآن، لغوی است نه عقلی؛ زیرا مماثلت عقلی بر خداوند تعالی محال است. (مانند اینکه بگویی) «زید در شدت مانند شیر است» یا «زید در شعر مانند زهیر است». هنگامی که موجودی را به یک یا دو صفت وصف کنی، سپس دیگری را به آن صفت وصف کنی، اگرچه میان آن‌ها از جهت حقایق (حقائق) دیگر تباین وجود دارد، اما در روح و معنای آن صفت مشترک هستند. پس هر یک از آن‌ها در آن صفت خاص بر صورت دیگری است. پس بفهم و آگاه باش و بنگر که تو خود دلیلی بر او سبحانه هستی. و آیا او را به صفتی از کمال وصف کردی مگر از خودت؟ پس دقت کن. هنگامی که از باب تجرید (تعریه) از مناظره وارد شدی، نقایصی را که بر تو جایز است، از او سلب کردی، اگرچه هرگز در او نبوده است. اما چون مُجَسِّم (قائل به جسمانیت) و مُشَبّه (قائل به تشبیه) آن‌ها را به او نسبت دادند، تو آن نسبت را سلب کردی. و اگر این توهم وجود نداشت، تو هیچ یک از این سلب‌ها را انجام نمی‌دادی، پس بدان. و اگرچه برای «صورة» (صورت) در اینجا مداخل بسیاری است، ما از ذکر آن‌ها صرف نظر کردیم، به دلیل رغبتی که در این کتاب به حذف اطاله داشتیم. **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند).\n\nدر خبر از پیامبر (صلی الله علیه و سلم) وارد شده است که «دندان آسیای کافر در آتش مانند کوه احد است و ضخامت پوست او چهل ذراع به ذراع جبار است.»\n\nاین اضافه تشریف است برای مقداری که خداوند تعالی آن را قرار داده و به خود نسبت داده است. همان‌طور که می‌گویی: «این شیء فلان مقدار ذراع به ذراع ملک است»، منظور تو ذراع بزرگ‌تری است که ملک آن را قرار داده است، اگرچه مثلاً ذراع ملک که همان جارحه (عضو بدن) است، مانند ذراع‌های مردم است، اما ذراعی که او به عنوان مقدار قرار داده، نصف یا ثلثی بیشتر از ذراع جارحه است. پس آن در حقیقت ذراع او نیست، بلکه مقداری است که نصب کرده و سپس به قراردهنده آن اضافه شده است، پس بدان. و «جبار» در زبان عربی به معنای پادشاه بزرگ است. و همین‌طور است:\n\n«جبار در آن قدم خود را می‌گذارد.» «قدم» (القدم) جارحه (عضو بدن) است. و گفته می‌شود: «فلان در این امر قدم دارد»، یعنی ثبوت و پیشینه. و «قدم» گروهی از خلق است، پس «قدم» اضافه (نسبت) است. و ممکن است «جبار» پادشاه باشد و این قدم برای این پادشاه باشد، زیرا جارحه بر خداوند تعالی و جلّ محال است.\n\n(و استواء)\n\nو «استواء» (الاستواء) نیز بر استقرار، قصد و استیلا اطلاق می‌شود. استقرار از صفات اجسام است، پس بر خداوند تعالی جایز نیست، مگر اینکه بر وجه ثبوت باشد. و قصد همان اراده است که از صفات کمال است. خداوند فرمود: **ثُمَّ اسْتَوى‏ إِلَى السَّماءِ** (سپس به سوی آسمان قصد کرد)، یعنی قصد نمود. و **اسْتَوى‏ عَلَى الْعَرْشِ** (بر عرش مستولی شد)، یعنی استیلا یافت.\n\n> بشر بر عراق مستولی شد، *** بدون شمشیر و خون ریخته شده.\n\nاخبار و آیات در این زمینه بسیارند، برخی صحیح و برخی سقیم. و هیچ خبری از آن‌ها نیست مگر اینکه وجهی از وجوه تنزیه (التنزيه) دارد. و اگر می‌خواهی این امر بر تو آسان شود، به لفظی که توهم تشبیه (التشبيه) را ایجاد می‌کند، روی آور و فایده و روح آن یا آنچه از آن حاصل می‌شود را بگیر، و آن را در حق حق (الحق) قرار ده، تا به درجه تنزیه دست یابی، در حالی که دیگری به درک تشبیه رسیده است. پس این‌گونه عمل کن و جامه خود را پاکیزه ساز. و این مقدار از این اخبار کافی است، زیرا باب طولانی شد.\n\n### نفث روح اقدس (الروح الأقدس) در روع انفس (الروع الأنفس) [معنای رمزی الفاظ تشبیه به زبان شرع]\n\nبا آنچه از الفاظ پیش رفت، هنگامی که تعجب‌کننده از کسی که بر صورت او خارج شد و در باطن با او مخالفت کرد، تعجب کرد، پس به وجود او شاد شد و از شهود (الشهود) او خندید و برای روی گرداندن او غضب کرد و برای نزدیک شدن او خوشرویی (تبشبش) نمود و ظاهر او را فراموش کرد و تنفس (تنفیس) نمود، پس آنچه را که در پی بود، رها کرد و بر ملک خود ثابت ماند و با تقدیر بر ملک خود حکم راند، پس آنچه خواست، شد و بازگشت به سوی خداست. این‌ها ارواح مجردی هستند که اشباح مسند (منسوب) به آن‌ها می‌نگرند. پس هنگامی که میقات فرا رسد و زمان‌ها سپری شود و آسمان به جنبش درآید و خورشید در هم پیچیده شود و زمین دگرگون گردد و ستارگان تیره شوند و امور منتقل گردند و آخرت ظاهر شود و انسان و غیر او در حافره (محل حشر) محشور شوند، در آن هنگام اشباح ستایش می‌کنند و ارواح نفس می‌کشند و فتاح (گشاینده) تجلی (التجلی) می‌کند و چراغ روشن می‌شود و شراب (الراح) درخشان می‌گردد و دوستی صریح آشکار می‌شود و اصرار از بین می‌رود و بال به پرواز درمی‌آید و بنا نهادن با ضراح (فریاد) از اول شب تا صبح خواهد بود. چه منزلت والایی و چه حالتی کامل و دلپذیری برای نفوس است! خداوند ما را از آن بهره‌مند سازد."
  },
  "page_count": 7
}