{
  "id": 29,
  "title": {
    "ar": "الباب التاسع والعشرون في معرفة سر سلمان الذي ألحقه بأهل البيت والأقطاب الذين ورثه منهم ومعرفة أسرارهم‏",
    "en": "Chapter Twenty-Nine: Concerning the knowledge of the secret of Salman whereby he was joined to the People of the House (أهل البيت) and the Poles (الأقطاب) from whom he inherited it, and the knowledge of their secrets.",
    "ur": "باب انتیسواں: سلمان کے اس راز کی معرفت میں جس نے انہیں اہل بیت (أهل البيت) سے ملحق کیا، اور ان اقطاب (الأقطاب) کی معرفت جن سے انہوں نے اسے وراثت میں لیا، اور ان کے اسرار کی معرفت۔",
    "fa": "باب بیست و نهم در معرفت سرّ سلمان که او را به اهل بیت ملحق ساخت و اقطابی که او از ایشان میراث برد و معرفت اسرار ایشان."
  },
  "content": {
    "ar": "## (الباب التاسع والعشرون) في معرفة سر سلمان الذي ألحقه بأهل البيت والأقطاب الذين ورثه منهم ومعرفة أسرارهم‏\n\n\n> العبد مرتبط بالرب ليس له *** عنه انفصال يرى فعلا وتقديرا\n\n\n> والابن أنزل منه في العلى درجا *** قد حرر الشرع فيه العلم تحريرا\n\n\n> فالابن ينظر في أموال والده *** إذ كان وارثه شحا وتقتيرا\n> والابن يطمع في تحصيل رتبته *** وأن يراه مع الأموات مقبورا\n\n\n> والعبد قيمته من مال سيده *** إليه يرجع مختارا ومجبورا\n\n\n> والعبد مقداره في جاه سيده *** فلا يزال بستر العز مستورا\n\n\n> الذل يصحبه في نفسه أبدا *** فلا يزال مع الأنفاس مقهورا\n\n\n> والابن في نفسه من أجل والده *** عز فيطلب توقيرا وتعزيرا\n\n\n### [إرادة التجريد أو التحرر من جميع الأكوان‏]\n\n\nاعلم أيدك الله‏\n\n\nأنا روينا من حديث جعفر بن محمد الصادق عن أبيه محمد بن علي عن أبيه علي بن الحسين عن أبيه الحسين بن علي عن أبيه علي بن أبي طالب عن رسول الله صلى الله عليه وسلم أنه قال مولى القوم منهم‏\n\n\nوخرج الترمذي عن رسول الله صلى الله عليه وسلم أنه قال أهل القرآن هم أهل الله وخاصته‏\n\n\nوقال تعالى في حق المختصين من عباده إِنَّ عِبادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ فكل عبد إلهي توجه لأحد عليه حق من المخلوقين فقد نقص من عبوديته لله بقدر ذلك الحق فإن ذلك المخلوق يطلبه بحقه وله عليه سلطان به فلا يكون عبدا محضا خالصا لله وهذا هو الذي رجح عند المنقطعين إلى الله انقطاعهم عن الخلق ولزومهم السياحات والبراري والسواحل والفرار من الناس والخروج عن ملك الحيوان فإنهم يريدون الحرية من جميع الأكوان ولقيت منهم جماعة كبيرة في أيام سياحتي ومن الزمان الذي حصل لي فيه هذا المقام ما ملكت حيوانا أصلا بل ولا الثوب الذي ألبسه فإني لا ألبسه إلا عارية لشخص معين أذن لي في التصرف فيه والزمان الذي أتملك الشي‏ء فيه أخرج عنه في ذلك الوقت إما بالهبة أو بالعتق إن كان ممن يعتق وهذا حصل لي لما أردت التحقق بعبودية الاختصاص لله قيل لي لا يصح لك ذلك حتى لا يقوم لأحد عليك حجة قلت ولا لله إن شاء الله قيل لي وكيف يصح لك أن لا يقوم لله عليك حجة قلت إنما تقام الحجج على المنكرين لا على المعترفين وعلى أهل الدعاوي وأصحاب الحظوظ لا على من قال مالي حق ولا حظ\n\n\n### [أهل البيت ومواليهم‏]\n\n\nولما كان رسول الله صلى الله عليه وسلم عبدا محضا قد طهره الله وأهل بيته تطهيرا وأذهب عنهم الرجس وهو كل ما يشينهم فإن الرجس هو القذر عند العرب هكذا حكي الفراء قال تعالى إِنَّما يُرِيدُ الله لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً فلا يضاف إليهم إلا مطهر ولا بد فإن المضاف إليهم هو الذي يشبههم فما يضيفون لأنفسهم إلا من له حكم الطهارة والتقديس فهذه شهادة من النبي صلى الله عليه وسلم لسلمان الفارسي بالطهارة والحفظ الإلهي والعصمة حيث‏\n\n\nقال فيه رسول الله صلى الله عليه وسلم سلمان منا أهل البيت‏\n\n\nوشهد الله لهم بالتطهير وذهاب الرجس عنهم وإذا كان لا ينضاف إليهم إلا مطهر مقدس وحصلت له العناية الإلهية بمجرد الإضافة فما ظنك بأهل البيت في نفوسهم فهم المطهرون بل هم عين الطهارة فهذه الآية تدل على إن الله قد شرك أهل البيت مع رسول الله صلى الله عليه وسلم في قوله تعالى لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ وأي وسخ وقذر أقذر من الذنوب وأوسخ فطهر الله سبحانه نبيه صلى الله عليه وسلم بالمغفرة فما هو ذنب بالنسبة إلينا لو وقع منه صلى الله عليه وسلم لكان ذنبا في الصورة لا في المعنى لأن الذم لا يلحق به على ذلك من الله ولا منا شرعا فلو كان حكمه حكم الذنب لصحبة ما يصحب الذنب من المذمة ولم يصدق قوله لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً فدخل الشرفاء أولاد فاطمة كلهم ومن هو من أهل البيت مثل سلمان الفارسي إلى يوم القيامة في حكم هذه الآية من الغفران فهم المطهرون اختصاصا من الله وعناية بهم لشرف محمد صلى الله عليه وسلم وعناية الله به ولا يظهر حكم هذا الشرف لأهل البيت إلا في الدار الآخرة فإنهم يحشرون مغفورا لهم وأما في الدنيا فمن أتى منهم حدا أقيم عليه كالتائب إذا بلغ الحاكم أمره وقد زنى أو سرق أو شرب أقيم عليه الحد مع تحقق المغفرة كما عز وأمثاله ولا يجوز ذمه‏\n\n\n### [أهل البيت: جميع ما يصدر منهم قد عفا الله عنه‏]\n\n\nوينبغي لكل مسلم مؤمن بالله وبما أنزله أن يصدق الله تعالى في قوله لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً فيعتقد في جميع ما يصدر من أهل البيت إن الله قد عفا عنهم فيه فلا ينبغي لمسلم أن يلحق المذمة بهم ولا ما يشنأ أعراض من قد شهد الله بتطهيره وذهاب الرجس عنه لا يعمل عملوه ولا بخير قدموه بل سابق عناية من الله بهم ذلِكَ فَضْلُ الله يُؤْتِيهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ وإذا صح الخبر الوارد في سلمان الفارسي فله هذه الدرجة فإنه لو كان سلمان على أمر يشنؤه‏\nظاهر الشرع وتلحق المذمة بعامله لكان مضافا لي أهل البيت من لم يذهب عنه الرجس فيكون لأهل البيت من ذلك بقدر ما أضيف إليهم وهم المطهرون بالنص فسلمان منهم بلا شك فأرجو أن يكون عقب علي وسلمان تلحقهم هذه العناية كما لحقت أولاد الحسن والحسين وعقبهم وموالي أهل البيت فإن رحمة الله واسعة\n\n\n### [أهل البيت أقطاب العالم‏]\n\n\nيا ولي وإذا كانت منزلة مخلوق عند الله بهذه المثابة أن يشرف المضاف إليهم بشرفهم وشرفهم ليس لأنفسهم وإنما الله تعالى هو الذي اجتباهم وكساهم حلة الشرف كيف يا ولي بمن أضيف إلى من له الحمد والمجد والشرف لنفسه وذاته فهو المجيد سبحانه وتعالى فالمضاف إليه من عباده الذين هم عباده وهم الذين لا سلطان لمخلوق عليهم في الآخرة قال تعالى لإبليس إِنَّ عِبادِي فأضافهم إليه لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ وما تجد في القرآن عبادا مضافين إليه سبحانه إلا السعداء خاصة وجاء اللفظ في غيرهم بالعباد فما ظنك بالمعصومين المحفوظين منهم القائمين بحدود سيدهم الواقفين عند مراسمه فشرفهم أعلى وأتم وهؤلاء هم أقطاب هذا المقام‏\n\n\n### [سر سلمان‏]\n\n\nومن هؤلاء الأقطاب ورث سلمان شرف مقام أهل البيت فكان رضي الله عنه من أعلم الناس بما لله على عباده من الحقوق وما لأنفسهم والخلق عليهم من الحقوق وأقواهم على أدائها وفيه‏\n\n\nقال رسول الله صلى الله عليه وسلم لو كان الايمان بالثريا لنا له رجال من فارس وأشار إلى سلمان الفارسي‏\n\n\nوفي تخصيص النبي صَلَّى اللهُ عَليهِ وسَلَّم ذكر الثريا دون غيرها من الكواكب إشارة بديعة لمثبتي الصفات السبعة لأنها سبعة كواكب فافهم فسر سلمان الذي ألحقه بأهل البيت ما أعطاه النبي صلى الله عليه وسلم من أداء كتابته وفي هذا فقه عجيب فهو عتيقة صلى الله عليه وسلم ومولى القوم منهم والكل موالي الحق ورحمته وَسِعَتْ كُلَّ شَيْ‏ءٍ وكل شي‏ء عبده ومولاه‏\n\n\n### [أهل البيت: لا ينبغي لمسلم أن يذمهم‏]\n\n\nوبعد أن تبين لك منزلة أهل البيت عند الله وأنه لا ينبغي لمسلم أن يذمهم بما يقع منهم أصلا فإن الله طهرهم فليعلم الذام لهم أن ذلك راجع إليه ولو ظلموه فذلك الظلم هو في زعمه ظلم لا في نفس الأمر وإن حكم عليه ظاهر الشرع بأدائه بل حكم ظلمهم إيانا في نفس الأمر يشبه جرى المقادير علينا في ماله ونفسه بغرق أو بحرق وغير ذلك من الأمور المهلكة فيحترق أو يموت له أحد أحبائه أو يصاب في نفسه وهذا كله مما لا يوافق غرضه ولا يجوز له أن يذم قدر الله ولا قضاءه بل ينبغي له أن يقابل ذلك كله بالتسليم والرضي وإن نزل عن هذه المرتبة فبالصبر وإن ارتفع عن تلك المرتبة فبالشكر فإن في طي ذلك نعما من الله لهذا المصاب وليس وراء ما ذكرناه خير فإنه ما وراءه ليس إلا الضجر والسخط وعدم الرضي وسوء الأدب مع الله فكذا ينبغي أن يقابل المسلم جميع ما يطرأ عليه من أهل البيت في ماله ونفسه وعرضه وأهله وذويه فيقابل ذلك كله بالرضى والتسليم والصبر ولا يلحق المذمة بهم أصلا وإن توجهت عليهم الأحكام المقررة شرعا فذلك لا يقدح في هذا بل يجريه مجرى المقادير وإنما منعنا تعليق الذم بهم إذ ميزهم الله عنا بما ليس لنا معهم فيه قدم وأما أداء الحقوق المشروعة فهذا رسول الله صلى الله عليه وسلم كان يقترض من اليهود وإذا طالبوه بحقوقهم أداها على أحسن ما يمكن وإن تطاول اليهودي عليه بالقول يقول دعوه إن لصاحب الحق مقالا وقال صلى الله عليه وسلم في قصة لو أن فاطمة بنت محمد سرقت قطعت يدها\n\n\nفوضع الأحكام لله يضعها كيف يشاء وعلى أي حال يشاء فهذه حقوق الله ومع هذا لم يذمهم الله وإنما كلامنا في حقوقنا وما لنا أن نطالبهم به فنحن مخيرون إن شئنا أخذنا وإن شئنا تركنا والترك أفضل عموما فكيف في أهل البيت وليس لنا ذم أحد فكيف بأهل البيت فإنا إذا نزلنا عن طلب حقوقنا وعفونا عنهم في ذلك أي فيما أصابوه منا كانت لنا بذلك عند الله اليد العظمى والمكانة الزلفى‏\n\n\n### [محبة آل بيت النبي من محبة النبي‏]\n\n\nفإن النبي صلى الله عليه وسلم ما طلب منا عن أمر الله إِلَّا الْمَوَدَّةَ في الْقُرْبى‏ وفيه سر صلة الأرحام ومن لم يقبل سؤال نبيه فيما سأله فيه مما هو قادر عليه بأي وجه يلقاه غدا أو يرجو شفاعته وهو ما أسعف نبيه صلى الله عليه وسلم فيما طلب منه من المودة في قرابته فكيف بأهل بيته فهم أخص القرابة ثم إنه جاء بلفظ المودة وهو الثبوت على المحبة فإنه من ثبت وده في أمر استصحبه في كل حال وإذا استصحبته المودة في كل حال لم يؤاخذ أهل البيت بما يطرأ منهم في حقه مما له أن يطالبهم به فيتركه ترك محبة وإيثارا لنفسه لا عليها قال المحب الصادق‏\n\n\nوكل ما يفعل المحبوب محبوب‏\n\n\nوجاء باسم الحب فكيف حال المودة ومن البشرى ورود اسم الودود لله تعالى ولا معنى لثبوتها إلا حصول أثرها بالفعل في الدار الآخرة وفي النار لكل طائفة بما تقتضيه حكمة الله فيهم وقال الآخر في المعنى‏\n> أحب لحبها السودان حتى *** أحب لحبها سود الكلاب‏\n\n\nولنا في هذا المعنى‏\n\n\n> أحب لحبك الحبشان طرا *** وأعشق لاسمك البدر المنيرا\n\n\nقيل كانت الكلاب السود تناوشه وهو يتحبب إليها فهذا فعل المحب في حب من لا تسعده محبته عند الله ولا تورثه القربة من الله فهل هذا إلا من صدق الحب وثبوت الود في النفس‏\n\n\n### [محبة أهل البيت آية من محبة الله ورسوله‏]\n\n\nفلو صحت محبتك لله ولرسوله أحببت أهل بيت رسول الله صلى الله عليه وسلم ورأيت كل ما يصدر منهم في حقك مما لا يوافق طبعك ولا غرضك إنه جمال تتنعم بوقوعه منهم فتعلم عند ذلك أن لك عناية عند الله الذي أحببتهم من أجله حيث ذكرك من يحبه وخطرت على باله وهم أهل بيت رسوله صلى الله عليه وسلم فتشكر الله تعالى على هذه النعمة فإنهم ذكروك بالسنة طاهرة بتطهير الله طهارة لم يبلغها علمك وإذا رأيناك على ضد هذه الحالة مع أهل البيت الذي أنت محتاج إليهم ولرسول صلى الله عليه وسلم حيث هداك الله به فكيف أثق أنا بودك الذي تزعم به أنك شديد الحب في والرعاية لحقوقي أو لجانبي وأنت في حق أهل نبيك بهذه المثابة من الوقوع فيهم والله ما ذاك إلا من نقص إيمانك ومن مكر الله بك واستدراجه إياك من حيث لا تعلم وصورة المكر أن تقول وتعتقد إنك في ذلك تذب عن دين الله وشرعه وتقول في طلب حقك إنك ما طلبت إلا ما أباح الله لك طلبه ويندرج الذم في ذلك الطلب المشروع والبغض والمقت وإيثارك نفسك على أهل البيت وأنت لا تشعر بذلك والدواء الشافي من هذا الداء العضال أن لا ترى لنفسك معهم حقا وتنزل عن حقك لئلا يندرج في طلبه ما ذكرته لك وما أنت من حكام المسلمين حتى يتعين عليك إقامة حد أو إنصاف مظلوم أو رد حق إلى أهله فإن كنت حاكما ولا بد فاسع في استنزال صاحب الحق عن حقه إذا كان المحكوم عليه من أهل البيت فإن أبي حينئذ يتعين عليك إمضاء حكم الشرع فيه فلو كشف الله لك يا ولي عن منازلهم عند الله في الآخرة لوددت أن تكون مولى من مواليهم فالله يلهمنا رشد أنفسنا فانظر ما أشرف منزلة سلمان رضي الله عن جميعهم‏\n\n\n### [أسرار الأقطاب «السلمانيين»]\n\n\nولما بينت لك أقطاب هذا المقام وأنهم عبيد الله المصطفون الأخيار فاعلم إن أسرارهم التي أطلعنا الله عليها تجهلها العامة بل أكثر الخاصة التي ليس لها هذا المقام والخضر منهم رضي الله عنه وهو من أكبرهم وقد شهد الله له أنه آتاه رحمة من عنده وعلمه من لدنه علما اتبعه فيه كليم الله موسى عليه السلام الذي‏\n\n\nقال فيه صلى الله عليه وسلم لو كان موسى حيا ما وسعه إلا أن يتبعني‏\n\n\nفمن أسرارهم ما قد ذكرناه من العلم بمنزلة أهل البيت وما قد نبه الله على علو رتبتهم في ذلك ومن أسرارهم علم المكر الذي مكر الله بعباده في بغضهم مع دعواهم حب رسول الله صلى الله عليه وسلم وسؤاله المودة في القربى وهو صلى الله عليه وسلم من جملة أهل البيت فما فعل أكثر الناس ما سألهم فيه رسول الله صلى الله عليه وسلم عن أمر الله فعصوا الله ورسوله وما أحبوا من قرابته إلا من رأوا منه الإحسان فأغراضهم أحبوا وبنفوسهم تعشقوا ومن أسرارهم الاطلاع على صحة ما شرع الله لهم في هذه الشريعة المحمدية من حيث لا تعلم العلماء بها فإن الفقهاء والمحدثين الذين أخذوا علمهم ميتا عن ميت إنما المتأخر منهم هو فيه على غلبة ظن إذ كان النقل شهادة والتواتر عزيز ثم إنهم إذا عثروا على أمور تفيد العلم بطريق التواتر لم يكن ذلك اللفظ المنقول بالتواتر نصا فيما حكموا به فإن النصوص عزيزة فيأخذون من ذلك اللفظ بقدر قوة فهمهم فيه ولهذا اختلفوا وقد يمكن أن يكون لذلك اللفظ في ذلك الأمر نص آخر يعارضه ولم يصل إليهم وما لم يصل إليهم ما تعبدوا به ولا يعرفون بأي وجه من وجوه الاحتمالات التي في قوة هذا اللفظ كان يحكم رسول الله صلى الله عليه وسلم المشرع فأخذه أهل الله عن رسول الله صلى الله عليه وسلم في الكشف على الأمر الجلي والنص الصريح في الحكم أو عن الله بالبينة التي هم عليها من ربهم والبصيرة التي بها دعوا الخلق إلى الله عليها كما قال الله أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ وقال أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي فلم يفرد نفسه بالبصيرة وشهد لهم بالاتباع في الحكم فلا يتبعونه إلا على بصيرة وهم عباد الله أهل هذا المقام ومن أسرارهم أيضا إصابة أهل العقائد فيما اعتقدوه في الجناب الإلهي وما تجلى لهم حتى اعتقدوا ذلك ومن أين تصور الخلاف مع الاتفاق على السبب الموجب الذي استندوا إليه فإنه ما اختلف فيه اثنان وإنما وقع الخلاف فيما هو ذلك السبب‏\nوبما ذا يسمى ذلك السبب فمن قائل هو الطبيعة ومن قائل هو الدهر ومن قائل غير ذلك فاتفق الكل في إثباته ووجوب وجوده وهل هذا الخلاف يضرهم مع هذا الاستناد أم لا هذا كله من علوم أهل هذا المقام انتهى الجزء السابع عشر\n\n",
    "en": "(Chapter Twenty-Nine) Concerning the knowledge of the secret of Salman, which attached him to the People of the House (أهل البيت), the Poles (الأقطاب) from whom he inherited, and the knowledge of their secrets.\n\nThe servant is bound to the Lord; there is no\nSeparation for him from Him, whether in act or in decree.\n\nAnd the son is lower than him in the degrees of loftiness,\nFor the Law (الشرع) has precisely defined the knowledge concerning him.\n\nThe son looks upon his father's wealth,\nSince he is his heir, with avarice and stinginess.\nThe son desires to attain his rank\nAnd to see him buried among the dead.\n\nBut the servant's worth comes from his master's wealth;\nTo Him he returns, whether by choice or compulsion.\n\nThe servant's measure lies in his master's prestige,\nSo he remains ever veiled by the covering of Glory.\n\nHumility accompanies him in his soul eternally,\nSo he remains subdued with every breath.\n\nAs for the son, in his soul, due to his father, there is pride,\nSo he seeks reverence and respect.\n\n### [The Desire for Abstraction or Freedom from All Created Things]\n\nKnow, may Allah support you:\n\nWe have narrated from the hadith of Ja'far ibn Muhammad al-Sadiq, from his father Muhammad ibn Ali, from his father Ali ibn al-Husayn, from his father al-Husayn ibn Ali, from his father Ali ibn Abi Talib, from the Messenger of Allah (peace and blessings be upon him), that he said: \"The client (مولى) of a people is one of them.\"\n\nAl-Tirmidhi transmitted from the Messenger of Allah (peace and blessings be upon him) that he said: \"The People of the Quran are the People of Allah and His elect.\"\n\nAnd Allah the Exalted said concerning His elect servants: <<إِنَّ عِبادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ>> (Indeed, over My servants, you have no authority). Thus, every divine servant who turns to a created being who has a right over him has diminished his servitude (عبودية) to Allah by the measure of that right. For that created being demands his right and has authority (سلطان) over him through it. Therefore, he is not a pure, exclusive servant (عبدا محضا خالصا) of Allah. This is what led those who dedicate themselves solely to Allah (المنقطعين إلى الله) to prefer their detachment from creation, their adherence to spiritual journeys (السياحات), the wilderness, and the coasts, fleeing from people, and relinquishing ownership of animals. They desire freedom from all created things (الأكوان). I met a large group of them during my travels, and during the time I attained this station (مقام), I never owned an animal, nor even the garment I wore, for I only wore it as a loan from a specific person who permitted me to use it. The moment I would own something, I would divest myself of it immediately, either by gift or by manumission if it was something that could be freed. This occurred when I sought to realize the exclusive servitude (عبودية الاختصاص) to Allah. I was told: \"This cannot be sound for you until no one holds a claim (حجة) against you.\" I said: \"Nor Allah, if He wills.\" I was asked: \"How can it be sound for you that Allah holds no claim against you?\" I replied: \"Claims are only established against deniers, not against those who confess; and against those who make claims and possess shares (أصحاب الحظوظ), not against one who says, 'I have no right and no share.'\"\n\n### [The People of the House and their Clients]\n\nSince the Messenger of Allah (peace and blessings be upon him) was a pure servant (عبدا محضا), and Allah purified him and the People of his House (أهل بيته) with a thorough purification, removing from them the defilement (الرجس), which is everything that blemishes them—for *al-rijs* (الرجس) means filth among the Arabs, as Al-Farra’ related—Allah the Exalted said: <<إِنَّما يُرِيدُ الله لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً>> (Allah only desires to remove defilement from you, O People of the House, and to purify you with a thorough purification). Therefore, only the purified must be attached to them, for that which is attached to them resembles them. They only attach to themselves those who possess the quality of purity and sanctification (التقديس). This is the testimony of the Prophet (peace and blessings be upon him) to Salman al-Farisi regarding purity, divine preservation, and infallibility (العصمة), when the Messenger of Allah (peace and blessings be upon him) said concerning him: \"Salman is one of us, the People of the House.\"\n\nAnd Allah testified to their purification and the removal of defilement from them. If only the purified and sanctified can be attached to them, and divine care (العناية الإلهية) is attained merely by this attachment, then what do you suppose of the People of the House themselves? They are the purified; indeed, they are the very essence of purity. This verse indicates that Allah has included the People of the House with the Messenger of Allah (peace and blessings be upon him) in His saying: <<لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ>> (That Allah may forgive you your past and future faults). And what filth or defilement is fouler than sins? So Allah the Glorious purified His Prophet (peace and blessings be upon him) through forgiveness. What might be a sin relative to us, if it occurred from him (peace and blessings be upon him), would be a sin in form, not in meaning, because blame (الذم) would not attach to him for it, neither from Allah nor legally from us. If its ruling were that of a sin, it would be accompanied by the blame that accompanies sin, and His saying <<لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً>> would not be true. Thus, the descendants of Fatima, all the nobles, and whoever is considered one of the People of the House, such as Salman al-Farisi, until the Day of Resurrection, are included in the ruling of this verse concerning forgiveness. They are the purified by Allah's exclusive favor and care for them, due to the honor of Muhammad (peace and blessings be upon him) and Allah's care for him. The effect of this honor for the People of the House (أهل البيت) only becomes manifest in the Hereafter. For they will be resurrected having been forgiven. As for this world, if one of them commits a legal penalty (حد), it is carried out upon him, just as a penitent person, if his matter of fornication, theft, or drinking reaches the judge, the penalty is carried out upon him despite the certainty of forgiveness, like Ma'iz and his likes. And it is not permissible to blame them.\n\n### [The People of the House: All that issues from them has been pardoned by Allah]\n\nIt is incumbent upon every Muslim who believes in Allah and what He has revealed to affirm Allah the Exalted in His saying: <<لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً>>. He must therefore believe that Allah has pardoned them for everything that issues from the People of the House. Thus, no Muslim should attach blame (المذمة) to them, nor anything that tarnishes the honor of those whom Allah has testified to be purified and from whom defilement has been removed. This is not due to any deed they performed or good they presented, but rather a prior divine care (سابق عناية) for them: <<ذلِكَ فَضْلُ الله يُؤْتِيهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ>> (That is the Bounty of Allah; He grants it to whom He wills. And Allah is the Possessor of Great Bounty). If the reported tradition concerning Salman al-Farisi is sound, he possesses this degree. For if Salman were engaged in an act that the outward Law (ظاهر الشرع) found objectionable and for which the doer incurred blame, then someone from whom defilement had not been removed would be attached to the People of the House. Consequently, the People of the House would bear a portion of that defilement corresponding to what was attached to them, yet they are the purified by explicit text. Salman is undoubtedly one of them. I hope that the descendants of Ali and Salman will be included in this divine care, just as the children of Al-Hasan and Al-Husayn and their descendants, and the clients (موالي) of the People of the House, are included, for the Mercy of Allah is vast.\n\n### [The People of the House are the Poles of the World]\n\nO my friend (يا ولي)! If the rank of a created being before Allah is such that those attached to them are honored by their honor—and their honor is not for themselves, but Allah the Exalted is the One who chose them and clothed them in the mantle of honor—then what do you suppose, O my friend, of one who is attached to Him for Whom praise, glory, and honor belong to His Essence (الذات) alone? He is Al-Majid (The Glorious), exalted is He. The one attached to Him is from His servants (عباده), those over whom no created being has authority in the Hereafter. Allah said to Iblis: <<إِنَّ عِبادِي>> (Indeed, My servants)—attaching them to Himself—<<لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ>> (you have no authority over them). You will not find servants (عبادا) attached to Him, the Glorious, in the Quran except the fortunate ones (السعداء) exclusively. The term *al-ibad* (العباد) is used for others. So what do you suppose of the infallible (المعصومين) and preserved among them, who uphold the limits of their Lord and stand by His ordinances? Their honor is higher and more complete. These are the Poles (أقطاب) of this station (مقام).\n\n### [The Secret of Salman]\n\nFrom these Poles (الأقطاب), Salman inherited the honor of the station of the People of the House. Thus, may Allah be pleased with him, he was among the most knowledgeable people concerning the rights Allah has over His servants, and the rights their souls and creation have over them, and he was the strongest in fulfilling them. Concerning him, the Messenger of Allah (peace and blessings be upon him) said: \"If faith were at the Pleiades (الثريا), men from Persia would attain it,\" and he pointed to Salman al-Farisi.\n\nIn the Prophet's (peace and blessings be upon him) specific mention of the Pleiades (الثريا) rather than other stars, there is a subtle allusion for those who affirm the Seven Attributes (الصفات السبعة), because it consists of seven stars—so understand this. The secret of Salman (سر سلمان) that attached him to the People of the House (أهل البيت) was what the Prophet (peace and blessings be upon him) granted him regarding the fulfillment of his manumission contract (كتابته). In this is a marvelous jurisprudence (فقه عجيب): he is the freed slave (*atiq*) of the Prophet (peace and blessings be upon him), and the client (مولى) of a people is one of them. And all are clients of the Real (موالي الحق), and His Mercy <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompasses all things), and everything is His servant and His client.\n\n### [The People of the House: No Muslim should blame them]\n\nAfter the rank of the People of the House before Allah has become clear to you, and that no Muslim should ever blame them for what issues from them, since Allah has purified them, let the one who blames them know that this blame returns to himself. Even if they wrong him, that wrong is a wrong only in his estimation, not in reality (في نفس الأمر), even if the outward Law (ظاهر الشرع) rules that they must compensate for it. Rather, the ruling concerning their wronging us in reality resembles the running of the Divine Decrees (المقادير) upon us regarding our wealth and souls, such as drowning, burning, or other destructive events, or when one of his loved ones dies, or he is afflicted in his own person. All of this is contrary to his desire, yet it is not permissible for him to blame Allah's Decree (قدر الله) or His Judgment (قضاءه). Rather, he should meet all of that with submission (التسليم) and contentment (الرضي); and if he falls short of that rank, then with patience (الصبر); and if he rises above that rank, then with gratitude (الشكر), for hidden within that are blessings from Allah for the afflicted person. There is no good beyond what we have mentioned, for beyond it lies only distress, discontent, lack of contentment, and bad manners toward Allah. Similarly, a Muslim should meet everything that befalls him from the People of the House—regarding his wealth, soul, honor, family, and relatives—with contentment, submission, and patience. He should never attach blame to them, even if the legally established rulings are directed against them. That does not detract from this principle; rather, he should treat it as he treats the Divine Decrees. We only prohibited attaching blame to them because Allah distinguished them from us with a precedence that we do not share with them. As for fulfilling prescribed rights, the Messenger of Allah (peace and blessings be upon him) himself used to borrow from Jews, and when they demanded their rights, he fulfilled them in the best possible manner. If the Jew spoke harshly to him, he would say: \"Leave him, for the owner of a right has a right to speak.\" And the Prophet (peace and blessings be upon him) said in a story: \"If Fatima, daughter of Muhammad, were to steal, I would cut off her hand.\"\n\nThus, the establishment of rulings belongs to Allah; He establishes them however and whenever He wills. These are the rights of Allah. Despite this, Allah did not blame them. Our discussion concerns our rights and what we are entitled to demand from them. We are given a choice: if we wish, we take; and if we wish, we forgo. Forgoing is generally superior, so how much more so concerning the People of the House? And we are not permitted to blame anyone, so how can we blame the People of the House? If we relinquish the demand for our rights and pardon them in that—meaning, in what they afflicted us with—we will have the greatest advantage (اليد العظمى) and the closest station (المكانة الزلفى) with Allah because of it.\n\n### [Love for the Family of the Prophet is from the Love of the Prophet]\n\nFor the Prophet (peace and blessings be upon him) only requested from us, by Allah's command, <<إِلَّا الْمَوَدَّةَ في الْقُرْبى>> (except affection for [my] kinship). In this lies the secret of maintaining kinship ties. How will one who does not accept his Prophet's request concerning something he is capable of doing meet him tomorrow, or hope for his intercession, when he failed to assist his Prophet (peace and blessings be upon him) in what he requested: affection for his relatives? How much more so for the People of his House (أهل بيته), who are the most specific of his kin? Furthermore, the word *al-mawadda* (المودة - affection/constant love) was used, which signifies constancy in love (المحبة). For one whose affection is constant in a matter maintains it in every state. If affection is maintained in every state, the People of the House will not be held accountable for what issues from them concerning the rights one is entitled to demand from them, for he forgoes it out of love and preference for his own soul, not against it. The truthful lover said:\n\nAnd everything the beloved does is beloved.\n\nThe term *al-hubb* (love) was used, so what is the state of *al-mawadda* (affection)? And among the glad tidings is the occurrence of the Name Al-Wadud (The Loving One) for Allah the Exalted. The only meaning for its constancy is the actualization of its effect in the Hereafter, and in the Fire for every group, according to what Allah's wisdom dictates concerning them. Another poet said concerning this meaning:\n\nI love the black people for the love of her, to the extent that I love black dogs for the love of her.\n\nAnd we have concerning this meaning:\n\nI love all the Abyssinians for Your love, and I adore the luminous full moon for Your Name.\n\nIt was said that black dogs used to snap at him, yet he showed affection toward them. This is the action of the lover in loving one whose love does not bring him happiness with Allah nor proximity to Allah. Is this not evidence of the sincerity of love and the constancy of affection in the soul?\n\n### [Love for the People of the House is a Sign of Love for Allah and His Messenger]\n\nIf your love for Allah and His Messenger were sound, you would love the People of the House of the Messenger of Allah (peace and blessings be upon him) and you would see everything that issues from them concerning your rights—which does not accord with your nature or desire—as a beauty (جمال) through which you find delight in its occurrence from them. You would then know that you have been granted care (عناية) by Allah, for Whose sake you loved them, since those whom He loves remembered you and you crossed their minds—and they are the People of the House of His Messenger (peace and blessings be upon him). You would then thank Allah the Exalted for this blessing, for they mentioned you with tongues purified by Allah's purification, a purity that your knowledge has not reached. If we see you in the opposite state concerning the People of the House, whom you need, and whom the Messenger (peace and blessings be upon him) needs, since Allah guided you through him, how can I trust your affection (ودك) when you claim to have intense love for me and care for my rights or my side, yet you are in this state of disparaging the family of your Prophet? By Allah, that is only due to the deficiency of your faith and Allah's cunning (مكر الله) with you, and His gradual leading you astray (استدراجه) from where you do not perceive. The form of this cunning is that you say and believe that in doing so, you are defending the religion and Law of Allah, and you say in demanding your right that you only sought what Allah permitted you to seek. Yet, blame (الذم), hatred (البغض), aversion (المقت), and preferring your own soul over the People of the House are included in that lawful demand, and you do not realize it. The definitive cure (الدواء الشافي) for this chronic disease (الداء العضال) is that you see no right for yourself against them and that you relinquish your right, lest what I mentioned to you be included in the demand for it. You are not one of the Muslim rulers (حكام المسلمين) such that the establishment of a legal penalty (حد), the ensuring of justice for the wronged, or the restoration of a right to its owner is incumbent upon you. If you must be a ruler, then strive to persuade the owner of the right to relinquish his right if the defendant is one of the People of the House. If he refuses, then it becomes incumbent upon you to execute the ruling of the Law upon him. O my friend (يا ولي), if Allah were to unveil to you their stations (منازلهم) in the Hereafter, you would wish to be a client (مولى) among their clients. May Allah inspire us with the guidance of our souls. Look then at the noble station of Salman, may Allah be pleased with all of them.\n\n### [The Secrets of the \"Salmanian\" Poles]\n\nSince I have clarified for you the Poles (أقطاب) of this station (مقام)—that they are the chosen, excellent servants of Allah—know that their secrets, which Allah has disclosed to us, are unknown to the common people, and even to most of the elite who do not possess this station. Al-Khidr, may Allah be pleased with him, is one of the greatest of them. Allah testified concerning him that He granted him mercy from Himself and taught him knowledge from His own presence (علماً من لدنه), knowledge in which Moses, the Speaker of Allah (كليم الله), followed him—Moses, concerning whom the Prophet (peace and blessings be upon him) said: \"If Moses were alive, he would have no choice but to follow me.\"\n\nAmong their secrets is the knowledge we have mentioned concerning the rank of the People of the House (أهل البيت) and what Allah has drawn attention to regarding the loftiness of their degree in that matter. Among their secrets is the knowledge of the cunning (مكر) with which Allah has dealt with His servants in their hatred for the People of the House, despite their claim of loving the Messenger of Allah (peace and blessings be upon him) and his request for affection for his kinship (المودة في القربى). The Prophet (peace and blessings be upon him) is himself included among the People of the House. Most people did not fulfill what the Messenger of Allah (peace and blessings be upon him) requested of them by Allah's command. Thus, they disobeyed Allah and His Messenger, and they only loved those of his relatives from whom they saw benefit; they loved their own desires and were infatuated with their own souls. Among their secrets is the accurate understanding of what Allah legislated for them in this Muhammadan Law (الشريعة المحمدية), from a perspective unknown to the scholars of the Law. For the jurists (الفقهاء) and traditionists (المحدثين) who took their knowledge dead from dead, the later ones among them rely on predominant conjecture (غلبة ظن), since transmission (النقل) is testimony and continuous transmission (التواتر) is rare. Furthermore, even when they stumble upon matters that yield certain knowledge through continuous transmission, the transmitted wording is not an explicit text (نصا) concerning what they ruled upon, for explicit texts are rare. Thus, they derive from that wording according to the strength of their understanding of it. This is why they differed. It is possible that there might be another explicit text concerning that matter which contradicts it, but which did not reach them. And what did not reach them is not what they were commanded to follow. Nor do they know in which way, among the possible interpretations inherent in the power of that wording, the Messenger of Allah (peace and blessings be upon him), the Legislator, used to rule. But the People of Allah (أهل الله) take it from the Messenger of Allah (peace and blessings be upon him) through Unveiling (الكشف) concerning the clear matter and the explicit text (النص الصريح) of the ruling, or directly from Allah through the clear evidence (البينة) they possess from their Lord, and the insight (البصيرة) with which they call creation to Allah, as Allah said: <<أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ>> (Is he, then, who is upon clear evidence from his Lord?) and He said: <<أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي>> (I call to Allah upon insight—I and those who follow me). He did not single Himself out with insight but testified that they follow Him in the ruling. They only follow Him upon insight, and they are the servants of Allah, the People of this station (مقام). Among their secrets is also the correctness of the people of creeds (أهل العقائد) in what they believed concerning the Divine Presence (الجناب الإلهي) and what was manifested (تجلى) to them, leading them to believe that. And how could disagreement be conceived when there is agreement on the necessitating cause (السبب الموجب) upon which they relied? For no two people disagreed upon its existence. The disagreement only occurred concerning what that cause is, and by what name that cause should be called. Some say it is Nature (الطبيعة), some say it is Time (الدهر), and others say something else. Thus, all agreed upon its affirmation and the necessity of its existence. Does this disagreement harm them, despite this reliance, or not? All of this is from the knowledge of the People of this station (مقام). End of the Seventeenth Part.",
    "ur": "(باب انتیسواں) سلمان کے اس راز کی معرفت میں جس نے انہیں اہل بیت سے ملحق کیا، اور ان اقطاب کی معرفت جن سے انہوں نے وراثت پائی، اور ان کے اسرار کی معرفت۔\n\nعبد اپنے رب سے جڑا ہوا ہے، اس کے لیے\nاس سے کوئی جدائی نہیں، نہ فعل میں دیکھی جاتی ہے نہ تقدیر میں۔\n\nاور بیٹا بلندی میں اس (عبد) سے نچلے درجے پر ہے\nشریعت نے اس میں علم کو پوری طرح آزاد کر دیا ہے۔\n\nپس بیٹا اپنے والد کے مال کو دیکھتا ہے\nجب کہ وہ اس کا وارث ہے، بخل اور تنگی کے ساتھ۔\nاور بیٹا اپنے مرتبے کے حصول کی طمع کرتا ہے\nاور یہ کہ وہ اسے مردوں کے ساتھ قبر میں مدفون دیکھے۔\n\nاور عبد کی قیمت اس کے آقا کے مال سے ہے\nوہ اسی کی طرف لوٹتا ہے، خواہ بااختیار ہو یا مجبور۔\n\nاور عبد کا مرتبہ اس کے آقا کی شان میں ہے\nپس وہ ہمیشہ عزت کے پردے میں پوشیدہ رہتا ہے۔\n\nذلت ہمیشہ اس کے نفس کے ساتھ رہتی ہے\nپس وہ سانسوں کے ساتھ ہمیشہ مغلوب رہتا ہے۔\n\nاور بیٹا اپنے والد کی وجہ سے اپنے نفس میں\nعزت رکھتا ہے، پس وہ تعظیم اور احترام کا طالب ہوتا ہے۔\n\n### [تجرید یا تمام اکوان (عالموں) سے آزادی کا ارادہ]\n\nجان لو، اللہ تمہاری تائید فرمائے۔\n\nہم نے جعفر بن محمد الصادق سے، انہوں نے اپنے والد محمد بن علی سے، انہوں نے اپنے والد علی بن الحسین سے، انہوں نے اپنے والد حسین بن علی سے، انہوں نے اپنے والد علی بن ابی طالب سے، اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ نے فرمایا: \"قوم کا مولیٰ انہی میں سے ہوتا ہے۔\"\n\nاور ترمذی نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کیا ہے کہ آپ نے فرمایا: \"اہلِ قرآن اللہ کے اہل اور اس کے خاص لوگ ہیں۔\"\n\nاور اللہ تعالیٰ نے اپنے خاص بندوں کے حق میں فرمایا: إِنَّ عِبادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ (بیشک میرے بندوں پر تیرا کوئی زور نہیں چلے گا)۔\n\nپس ہر وہ عبدِ الٰہی جو مخلوق میں سے کسی ایسے شخص کی طرف متوجہ ہو جس کا اس پر کوئی حق ہو، تو اس حق کے بقدر اس کی اللہ کے لیے عبودیت (بندگی) میں کمی واقع ہو جاتی ہے۔ کیونکہ وہ مخلوق اپنے حق کا مطالبہ کرے گی اور اس حق کے ذریعے اس پر اس کا زور (سلطان) چلے گا، لہٰذا وہ اللہ کا خالص اور محض عبد نہیں رہے گا۔\n\nیہی وہ وجہ ہے جس نے اللہ کی طرف منقطع ہونے والوں کے نزدیک خلق سے انقطاع، سیاحتوں، بیابانوں اور ساحلوں کو لازم پکڑنے، لوگوں سے فرار اختیار کرنے اور حیوانات کی ملکیت سے باہر نکلنے کو ترجیح دی۔ کیونکہ وہ تمام اکوان (عالموں) سے آزادی چاہتے ہیں۔ میں اپنی سیاحت کے دنوں میں اور جس زمانے میں مجھے یہ مقام حاصل ہوا، ان میں ایک بڑی جماعت سے ملا۔ میں نے کبھی کوئی حیوان ملکیت میں نہیں لیا، بلکہ وہ کپڑا بھی نہیں جو میں پہنتا ہوں، کیونکہ میں اسے کسی معین شخص کی طرف سے عاریتاً ہی پہنتا ہوں جس نے مجھے اس میں تصرف کی اجازت دی ہو۔ اور جس وقت میں کسی چیز کا مالک بنتا ہوں، اسی وقت اس سے نکل جاتا ہوں، یا تو ہبہ کے ذریعے یا اگر وہ آزاد کیے جانے کے قابل ہو تو آزاد کر کے۔\n\nیہ سب مجھے اس وقت حاصل ہوا جب میں نے اللہ کے لیے عبودیتِ اختصاص (خاص بندگی) کے ساتھ متحقق ہونے کا ارادہ کیا۔ مجھ سے کہا گیا: \"یہ تمہارے لیے تب تک صحیح نہیں ہو سکتا جب تک کسی کا تم پر کوئی حجت (دلیل) قائم نہ ہو۔\" میں نے کہا: \"ان شاء اللہ، اللہ کی بھی نہیں۔\" مجھ سے کہا گیا: \"یہ تمہارے لیے کیسے صحیح ہو سکتا ہے کہ اللہ کی بھی تم پر کوئی حجت قائم نہ ہو؟\" میں نے کہا: \"حجتیں تو منکروں پر قائم کی جاتی ہیں نہ کہ اعتراف کرنے والوں پر، اور دعوے کرنے والوں اور حظوظ (حصوں) کے مالکوں پر، نہ کہ اس شخص پر جو کہے کہ میرا کوئی حق ہے نہ کوئی حصہ۔\"\n\n### [اہل بیت اور ان کے موالی]\n\nاور چونکہ رسول اللہ صلی اللہ علیہ وسلم ایک محض عبد تھے، اور اللہ نے آپ کو اور آپ کے اہل بیت کو خوب پاک کر دیا تھا اور ان سے رجس (ناپاکی) کو دور کر دیا تھا، اور رجس (الرجس) ہر وہ چیز ہے جو انہیں عیب دار کرے، کیونکہ رجس عربوں کے نزدیک گندگی ہے۔ فراء نے اسی طرح بیان کیا ہے۔\n\nاللہ تعالیٰ نے فرمایا: إِنَّما يُرِيدُ الله لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً (اللہ تو یہی چاہتا ہے اے اہل بیت کہ تم سے ہر قسم کی ناپاکی (الرجس) دور کر دے اور تمہیں خوب پاک کر دے)۔\n\nپس ان کے ساتھ صرف پاکیزہ شخص ہی ملحق ہو سکتا ہے، اور یہ ضروری ہے۔ کیونکہ ان سے ملحق ہونے والا وہ ہے جو ان سے مشابہت رکھتا ہو۔ لہٰذا وہ اپنے ساتھ صرف اسی کو ملحق کرتے ہیں جو طہارت اور تقدیس کا حکم رکھتا ہو۔\n\nپس یہ نبی صلی اللہ علیہ وسلم کی طرف سے سلمان فارسی رضی اللہ عنہ کے لیے طہارت، حفاظتِ الٰہی اور عصمت کی گواہی ہے، جہاں رسول اللہ صلی اللہ علیہ وسلم نے ان کے بارے میں فرمایا: \"سلمان ہم اہل بیت میں سے ہیں۔\"\n\nاور اللہ نے ان (اہل بیت) کے لیے تطہیر (پاکیزگی) اور رجس (الرجس) کے دور ہونے کی گواہی دی ہے۔ اور جب ان کے ساتھ صرف مطہر (پاکیزہ) اور مقدس شخص ہی ملحق ہوتا ہے، اور محض الحاق کی وجہ سے اسے عنایتِ الٰہی حاصل ہو جاتی ہے، تو اے ولی! خود اہل بیت کے بارے میں تمہارا کیا خیال ہے؟ وہ تو مطہر ہیں، بلکہ وہ عین طہارت ہیں۔\n\nیہ آیت اس بات پر دلالت کرتی ہے کہ اللہ نے اہل بیت کو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اس فرمان میں شریک کیا ہے: لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ (تاکہ اللہ آپ کے اگلے اور پچھلے گناہ بخش دے)۔ اور گناہوں سے زیادہ گندی اور ناپاک چیز کیا ہو سکتی ہے؟\n\nپس اللہ سبحانہ و تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو مغفرت کے ذریعے پاک کیا۔ جو چیز ہمارے اعتبار سے گناہ ہے، اگر وہ آپ صلی اللہ علیہ وسلم سے صادر بھی ہو تو وہ صرف صورت میں گناہ ہو گا نہ کہ معنی میں، کیونکہ اس پر اللہ کی طرف سے یا شرعاً ہماری طرف سے کوئی مذمت لاحق نہیں ہوتی۔ اگر اس کا حکم گناہ کا ہوتا تو اس کے ساتھ وہ مذمت بھی ہوتی جو گناہ کے ساتھ ہوتی ہے، اور اللہ کا یہ فرمان سچا نہ ہوتا: لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً (اے اہل بیت! تم سے رجس دور کر دے اور تمہیں خوب پاک کر دے)۔\n\nپس فاطمہ رضی اللہ عنہا کی تمام اولاد اور جو اہل بیت میں سے ہیں، جیسے سلمان فارسی رضی اللہ عنہ، قیامت تک اس آیت کے حکمِ غفران میں داخل ہیں۔ وہ اللہ کی طرف سے اختصاص اور عنایت کے ساتھ مطہر (پاک کیے ہوئے) ہیں، جو محمد صلی اللہ علیہ وسلم کے شرف اور اللہ کی آپ پر عنایت کی وجہ سے ہے۔\n\nاہل بیت کے لیے اس شرف کا حکم صرف دارِ آخرت میں ظاہر ہو گا، کیونکہ وہ بخشے ہوئے اٹھائے جائیں گے۔ البتہ دنیا میں، اگر ان میں سے کوئی حد کا ارتکاب کرے تو اس پر حد قائم کی جائے گی، جیسے توبہ کرنے والا جب حاکم کو اس کے زنا، چوری یا شراب نوشی کا علم ہو جائے، تو مغفرت کے متحقق ہونے کے باوجود اس پر حد قائم کی جاتی ہے، جیسا کہ ماعز رضی اللہ عنہ اور ان جیسے دیگر صحابہ کے ساتھ ہوا۔ اور ان کی مذمت جائز نہیں۔\n\n### [اہل بیت: ان سے صادر ہونے والی ہر چیز کو اللہ نے معاف کر دیا ہے]\n\nہر مسلمان جو اللہ پر اور اس کی نازل کردہ چیزوں پر ایمان رکھتا ہے، اسے چاہیے کہ اللہ تعالیٰ کے اس فرمان کی تصدیق کرے: لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً (اے اہل بیت! تم سے رجس دور کر دے اور تمہیں خوب پاک کر دے)۔\n\nپس وہ اہل بیت سے صادر ہونے والی ہر چیز کے بارے میں یہ اعتقاد رکھے کہ اللہ نے انہیں اس میں معاف کر دیا ہے۔ لہٰذا کسی مسلمان کے لیے یہ مناسب نہیں کہ وہ ان کی مذمت کرے یا ان کی عزت پر حرف لائے جن کی طہارت اور رجس (الرجس) کے دور ہونے کی گواہی اللہ نے دی ہے۔\n\nیہ (طہارت) ان کے کسی عمل یا کسی نیکی کی وجہ سے نہیں ہے جو انہوں نے پہلے کی ہو، بلکہ یہ اللہ کی طرف سے سابقہ عنایت ہے: ذلِكَ فَضْلُ الله يُؤْتِيهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ (یہ اللہ کا فضل ہے جسے چاہتا ہے عطا کرتا ہے، اور اللہ بڑے فضل والا ہے)۔\n\nاور اگر سلمان فارسی رضی اللہ عنہ کے بارے میں وارد ہونے والی خبر صحیح ہے، تو وہ بھی اس درجے کے مالک ہیں۔ کیونکہ اگر سلمان کسی ایسے کام پر ہوتے جسے ظاہرِ شرع ناپسند کرتا اور اس کے کرنے والے پر مذمت لاحق ہوتی، تو اہل بیت کے ساتھ ایسا شخص ملحق ہو جاتا جس سے رجس دور نہیں ہوا، اور اس صورت میں اہل بیت کو بھی اس کا کچھ حصہ ملتا جس قدر وہ ان سے ملحق ہوتا، حالانکہ وہ نص (قرآن) کے مطابق مطہر ہیں۔\n\nپس سلمان بلاشبہ ان میں سے ہیں۔ لہٰذا مجھے امید ہے کہ علی رضی اللہ عنہ اور سلمان کی اولاد کو بھی یہ عنایت حاصل ہو گی، جیسا کہ حسن اور حسین رضی اللہ عنہما کی اولاد اور ان کی نسلوں اور اہل بیت کے موالی کو حاصل ہوئی ہے، کیونکہ اللہ کی رحمت وسیع ہے۔\n\n### [اہل بیت عالم کے اقطاب ہیں]\n\nاے ولی! جب کسی مخلوق کا مرتبہ اللہ کے نزدیک اس قدر بلند ہو کہ ان سے ملحق ہونے والا ان کے شرف کی وجہ سے شرف یاب ہو جائے، اور ان کا شرف ان کی اپنی ذات کی وجہ سے نہیں ہے، بلکہ اللہ تعالیٰ نے ہی انہیں چنا اور شرف کی خلعت پہنائی، تو اے ولی! اس شخص کے بارے میں تمہارا کیا خیال ہے جو اس ذات سے منسوب ہو جس کے لیے حمد، بزرگی اور شرف اس کی اپنی ذات کی وجہ سے ہے؟ وہ سبحانہ و تعالیٰ المجید (بزرگی والا) ہے۔\n\nپس اس کے بندوں میں سے جو اس سے منسوب ہیں، وہ اس کے خاص بندے ہیں، اور آخرت میں کسی مخلوق کا ان پر کوئی زور نہیں چلے گا۔ اللہ تعالیٰ نے ابلیس سے فرمایا: إِنَّ عِبادِي (بیشک میرے بندے)، پس انہیں اپنی طرف منسوب کیا، لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ (ان پر تیرا کوئی زور نہیں چلے گا)۔\n\nاور آپ قرآن میں اللہ سبحانہ و تعالیٰ کی طرف منسوب بندوں (عباد) کو صرف خاص سعادت مندوں کے لیے پائیں گے، جبکہ دوسروں کے لیے لفظ \"العباد\" (بندے) آیا ہے۔\n\nتو پھر ان معصوموں اور محفوظوں کے بارے میں تمہارا کیا خیال ہے جو اپنے آقا کی حدود پر قائم ہیں اور اس کے مقرر کردہ طریقوں پر ٹھہرے ہوئے ہیں؟ ان کا شرف سب سے اعلیٰ اور اتم ہے۔ اور یہی لوگ اس مقام کے اقطاب ہیں۔\n\n### [سلمان کا راز]\n\nاور انہی اقطاب سے سلمان رضی اللہ عنہ نے اہل بیت کے مقام کا شرف وراثت میں پایا۔ پس وہ رضی اللہ عنہ لوگوں میں سب سے زیادہ اس بات کا علم رکھنے والے تھے کہ اللہ کے بندوں پر کیا حقوق ہیں، اور ان کے اپنے نفسوں اور مخلوق کے ان پر کیا حقوق ہیں، اور ان حقوق کی ادائیگی پر سب سے زیادہ طاقتور تھے۔\n\nان کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اگر ایمان ثریا (ستاروں کے جھرمٹ) پر بھی ہوتا تو فارس کے کچھ لوگ اسے حاصل کر لیتے،\" اور آپ نے سلمان فارسی کی طرف اشارہ کیا۔\n\nاور نبی صلی اللہ علیہ وسلم کا ثریا کا ذکر کرنا، دیگر ستاروں کے بجائے، صفاتِ سبعہ (سات صفات) کے قائلین کے لیے ایک لطیف اشارہ ہے، کیونکہ ثریا سات ستارے ہیں۔ پس سمجھو!\n\nسلمان کا وہ راز جس نے انہیں اہل بیت سے ملحق کیا، وہ یہ ہے کہ نبی صلی اللہ علیہ وسلم نے انہیں ان کی کتابت (آزادی کی قیمت) ادا کر کے آزاد کرایا۔ اور اس میں ایک عجیب فقہی نکتہ ہے۔ پس وہ صلی اللہ علیہ وسلم کے آزاد کردہ غلام ہیں، اور قوم کا مولیٰ انہی میں سے ہوتا ہے۔ اور سب کے سب الحق (ذات حق) کے موالی ہیں، اور اس کی رحمت وَسِعَتْ كُلَّ شَيْ‏ءٍ (ہر چیز پر محیط ہے)، اور ہر چیز اس کا عبد اور مولیٰ ہے۔\n\n### [اہل بیت: کسی مسلمان کے لیے مناسب نہیں کہ وہ ان کی مذمت کرے]\n\nاور جب تمہارے لیے اللہ کے نزدیک اہل بیت کا مرتبہ واضح ہو گیا، اور یہ کہ کسی مسلمان کے لیے مناسب نہیں کہ ان سے صادر ہونے والی کسی بھی چیز پر ان کی مذمت کرے، کیونکہ اللہ نے انہیں پاک کر دیا ہے، تو ان کی مذمت کرنے والے کو جان لینا چاہیے کہ یہ (مذمت) اسی کی طرف لوٹے گی۔\n\nاور اگر وہ ان پر ظلم بھی کریں، تو وہ ظلم اس کے گمان میں ظلم ہے، نہ کہ نفس الامر (حقیقت) میں۔ اگرچہ ظاہرِ شرع اس پر ان کی ادائیگی کا حکم دے۔ بلکہ حقیقت میں ان کے ظلم کا حکم ہم پر مقدرات کے جاری ہونے سے مشابہت رکھتا ہے، جیسے مال اور جان میں غرق ہونے یا جلنے یا دیگر ہلاک کرنے والی چیزوں سے۔ یا اس کا کوئی محبوب جل جائے یا مر جائے، یا اسے خود کوئی تکلیف پہنچے۔\n\nیہ سب وہ چیزیں ہیں جو اس کی غرض کے موافق نہیں ہیں، اور اس کے لیے جائز نہیں کہ وہ اللہ کی تقدیر یا اس کے فیصلے کی مذمت کرے۔ بلکہ اسے چاہیے کہ ان سب کا مقابلہ تسلیم اور رضا کے ساتھ کرے، اور اگر وہ اس مرتبے سے نیچے ہو تو صبر کے ساتھ، اور اگر اس مرتبے سے بلند ہو تو شکر کے ساتھ۔ کیونکہ اس مصیبت زدہ کے لیے اس کے اندر اللہ کی طرف سے نعمتیں پوشیدہ ہیں۔ اور جو کچھ ہم نے ذکر کیا ہے اس کے پیچھے کوئی خیر نہیں ہے، کیونکہ اس کے پیچھے صرف بے چینی، ناراضگی، عدمِ رضا اور اللہ کے ساتھ سوءِ ادب ہے۔\n\nاسی طرح مسلمان کو چاہیے کہ اہل بیت کی طرف سے اس کے مال، جان، عزت، اہل و عیال اور رشتہ داروں کے بارے میں جو کچھ بھی پیش آئے، ان سب کا مقابلہ رضا، تسلیم اور صبر کے ساتھ کرے، اور ہرگز ان کی مذمت نہ کرے۔\n\nاگرچہ ان پر شرعاً مقرر کردہ احکام لاگو ہوں، تو یہ اس (مرتبے) میں کوئی نقص پیدا نہیں کرتا، بلکہ وہ اسے مقدرات کے جاری ہونے کے مترادف سمجھے۔ ہم نے ان کی مذمت سے اس لیے منع کیا ہے کہ اللہ نے انہیں ہم سے اس چیز کے ذریعے ممتاز کیا ہے جس میں ہمارا ان کے ساتھ کوئی حصہ نہیں ہے۔\n\nجہاں تک مشروع حقوق کی ادائیگی کا تعلق ہے، تو یہ رسول اللہ صلی اللہ علیہ وسلم تھے جو یہودیوں سے قرض لیتے تھے، اور جب وہ اپنے حقوق کا مطالبہ کرتے تو آپ بہترین طریقے سے ادا کرتے۔ اور اگر یہودی آپ پر قول میں دراز دستی کرتا تو آپ فرماتے: \"اسے چھوڑ دو، کیونکہ حق والے کو بات کرنے کا حق ہے۔\"\n\nاور آپ صلی اللہ علیہ وسلم نے ایک قصے میں فرمایا: \"اگر محمد کی بیٹی فاطمہ بھی چوری کرتی تو میں اس کا ہاتھ کاٹ دیتا۔\"\n\nپس احکام کو اللہ نے مقرر کیا ہے، وہ جیسے چاہتا ہے اور جس حال میں چاہتا ہے، انہیں مقرر کرتا ہے۔ یہ اللہ کے حقوق ہیں۔ اس کے باوجود اللہ نے ان کی مذمت نہیں کی۔ ہمارا کلام ہمارے حقوق کے بارے میں ہے، اور جو کچھ ہم ان سے مطالبہ کر سکتے ہیں۔ ہمیں اختیار ہے، اگر چاہیں تو لے لیں اور اگر چاہیں تو چھوڑ دیں۔ اور عموماً چھوڑ دینا افضل ہے۔ تو اہل بیت کے معاملے میں کیسے ہو گا؟\n\nاور ہمیں کسی کی بھی مذمت کا حق نہیں، تو اہل بیت کی کیسے؟ کیونکہ جب ہم اپنے حقوق کے مطالبے سے دستبردار ہو جائیں اور ان سے اس میں معاف کر دیں (یعنی جو کچھ انہوں نے ہم سے لیا)، تو اس کے بدلے میں اللہ کے ہاں ہمیں بڑا درجہ اور قربت کا مقام حاصل ہو گا۔\n\n### [آل بیت نبی کی محبت، نبی کی محبت کا حصہ ہے]\n\nکیونکہ نبی صلی اللہ علیہ وسلم نے اللہ کے حکم سے ہم سے صرف إِلَّا الْمَوَدَّةَ في الْقُرْبى‏ (قرابت داروں سے محبت) کا سوال کیا، اور اس میں صلہ رحمی کا راز ہے۔ جو شخص اپنے نبی کے اس سوال کو قبول نہ کرے جو انہوں نے اس سے پوچھا، جس پر وہ قادر بھی ہے، تو وہ کل کس منہ سے ان سے ملے گا یا ان کی شفاعت کی امید رکھے گا، حالانکہ اس نے اپنے نبی صلی اللہ علیہ وسلم کی اس چیز میں مدد نہیں کی جو انہوں نے اپنی قرابت کے بارے میں مودت (محبت) کا مطالبہ کیا تھا۔ تو اہل بیت کے بارے میں کیا حال ہو گا، جو سب سے خاص قرابت دار ہیں۔\n\nپھر آپ نے لفظ \"مودت\" (محبت کی پختگی) استعمال کیا، اور یہ محبت پر ثابت قدم رہنا ہے۔ کیونکہ جس کی مودت کسی معاملے میں ثابت ہو جائے، وہ اسے ہر حال میں اپنے ساتھ رکھتا ہے۔ اور جب مودت ہر حال میں ساتھ ہو، تو وہ اہل بیت کو ان کے حق میں صادر ہونے والی کسی بھی چیز پر مؤاخذہ نہیں کرے گا جس کا وہ مطالبہ کر سکتا ہے، بلکہ وہ اسے محبت کی وجہ سے چھوڑ دے گا اور اپنے نفس کو ان پر ترجیح نہیں دے گا۔\n\nسچا محب کہتا ہے:\n> وكل ما يفعل المحبوب محبوب\n> *ترجمہ:* اور محبوب جو کچھ بھی کرتا ہے، وہ محبوب ہوتا ہے۔\n\nاور یہ نام \"حب\" (محبت) کے ساتھ آیا ہے، تو مودت کا کیا حال ہو گا؟ اور خوشخبری کی بات یہ ہے کہ اللہ تعالیٰ کے لیے \"الودود\" (بہت محبت کرنے والا) کا نام آیا ہے۔ اور اس کے ثابت ہونے کا کوئی معنی نہیں مگر یہ کہ آخرت میں اس کا اثر بالفعل ظاہر ہو، اور ہر گروہ کے لیے آگ میں بھی، جس کا تقاضا اللہ کی حکمت ان کے بارے میں کرتی ہے۔\n\nدوسرے نے اس معنی میں کہا:\n> أحب لحبها السودان حتى *** أحب لحبها سود الكلاب‏\n> *ترجمہ:* میں اس (محبوبہ) کی محبت میں حبشیوں سے محبت کرتا ہوں، یہاں تک کہ *** میں اس کی محبت میں کالے کتوں سے بھی محبت کرتا ہوں۔\n\nاور ہمارا اس معنی میں شعر ہے:\n> أحب لحبك الحبشان طرا *** وأعشق لاسمك البدر المنيرا\n> *ترجمہ:* میں تیری محبت کی خاطر تمام حبشیوں سے محبت کرتا ہوں *** اور تیرے نام کی خاطر چمکتے ہوئے بدر (چاند) کا عاشق ہوں۔\n\nکہا گیا ہے کہ کالے کتے اس (محبوب) پر حملہ کرتے تھے اور وہ ان سے محبت کا اظہار کرتا تھا۔ تو یہ محب کا فعل ہے، اس شخص کی محبت میں جس کی محبت اللہ کے نزدیک اسے سعادت مند نہیں بناتی اور نہ ہی اللہ سے قربت دلاتی ہے۔ تو کیا یہ صدقِ حب (سچی محبت) اور نفس میں مودت کے ثبوت کے سوا کچھ اور ہے؟\n\n### [اہل بیت کی محبت، اللہ اور اس کے رسول کی محبت کی نشانی ہے]\n\nاگر تمہاری اللہ اور اس کے رسول سے محبت سچی ہو، تو تم رسول اللہ صلی اللہ علیہ وسلم کے اہل بیت سے محبت کرو گے، اور ان کی طرف سے تمہارے حق میں صادر ہونے والی ہر وہ چیز جو تمہاری طبیعت یا غرض کے موافق نہ ہو، اسے تم ایک جمال سمجھو گے جس سے تمہیں ان کے وقوع پذیر ہونے پر لذت حاصل ہو گی۔\n\nتب تمہیں معلوم ہو گا کہ اللہ کے ہاں تمہارے لیے ایک عنایت ہے، جس کی خاطر تم نے ان سے محبت کی، جہاں اس (اللہ) کے محبوب نے تمہیں یاد کیا اور تم اس کے دل میں آئے، اور وہ اس کے رسول صلی اللہ علیہ وسلم کے اہل بیت ہیں۔ پس تم اس نعمت پر اللہ کا شکر ادا کرو، کیونکہ انہوں نے تمہیں ایسی زبانوں سے یاد کیا جو اللہ کی تطہیر (پاکیزگی) کی وجہ سے پاک ہیں، ایسی طہارت جسے تمہارا علم نہیں پہنچ سکا۔\n\nاور جب ہم تمہیں اہل بیت کے ساتھ اس کے برعکس حالت میں دیکھتے ہیں، حالانکہ تمہیں ان کی اور رسول صلی اللہ علیہ وسلم کی ضرورت ہے، کیونکہ اللہ نے تمہیں ان کے ذریعے ہدایت دی، تو میں تمہاری اس مودت پر کیسے بھروسہ کروں جس کا تم دعویٰ کرتے ہو کہ تم مجھ سے شدید محبت رکھتے ہو اور میرے حقوق یا میری جانب کی رعایت کرتے ہو، جبکہ تم اپنے نبی کے اہل بیت کے حق میں اس قدر گرے ہوئے ہو کہ ان پر طعن کرتے ہو؟\n\nاللہ کی قسم! یہ صرف تمہارے ایمان کی کمی اور اللہ کی طرف سے تمہارے ساتھ مکر (تدبیر) اور استدراج (آہستہ آہستہ پکڑنا) ہے جہاں سے تم نہیں جانتے۔ اور مکر کی صورت یہ ہے کہ تم کہو اور اعتقاد رکھو کہ تم اس میں اللہ کے دین اور اس کی شریعت کا دفاع کر رہے ہو، اور اپنے حق کے مطالبے میں کہو کہ تم نے صرف وہی طلب کیا ہے جس کی اللہ نے تمہیں اجازت دی ہے۔ اور اس مشروع مطالبے میں مذمت، بغض، نفرت اور اہل بیت پر اپنے نفس کو ترجیح دینا شامل ہو جاتا ہے، اور تمہیں اس کا شعور بھی نہیں ہوتا۔\n\nاس مہلک بیماری کا شافی علاج یہ ہے کہ تم ان کے ساتھ اپنے لیے کوئی حق نہ دیکھو، اور اپنے حق سے دستبردار ہو جاؤ تاکہ اس کے مطالبے میں وہ چیزیں شامل نہ ہو جائیں جو میں نے تمہیں بتائی ہیں۔\n\nاور تم مسلمانوں کے حکام میں سے نہیں ہو کہ تم پر حد قائم کرنا، مظلوم کو انصاف دلانا، یا حق کو اس کے اہل تک لوٹانا لازم ہو۔ اگر تم حاکم ہو بھی، تو ضروری ہے کہ تم حق والے کو اس کے حق سے دستبردار ہونے کی کوشش کرو، اگر محکوم علیہ اہل بیت میں سے ہو۔ اگر وہ انکار کر دے، تب تم پر شرعی حکم نافذ کرنا لازم ہو جاتا ہے۔\n\nاے ولی! اگر اللہ تمہیں آخرت میں ان کے درجات سے پردہ اٹھا کر دکھا دے، تو تم یہ چاہو گے کہ کاش تم ان کے موالی میں سے ہوتے۔ اللہ ہمیں ہمارے نفسوں کی رہنمائی الہام کرے۔ پس دیکھو سلمان رضی اللہ عنہ کا کتنا شاندار مرتبہ ہے، اللہ ان سب سے راضی ہو۔\n\n### [اقطاب \"سلمانیین\" کے اسرار]\n\nاور جب میں نے تمہیں اس مقام کے اقطاب کے بارے میں بتا دیا کہ وہ اللہ کے چنے ہوئے نیک بندے ہیں، تو جان لو کہ ان کے وہ اسرار جن پر اللہ نے ہمیں مطلع کیا ہے، عام لوگ تو کیا، اکثر خاص لوگ بھی ان سے ناواقف ہیں جنہیں یہ مقام حاصل نہیں ہے۔\n\nاور خضر رضی اللہ عنہ ان میں سے ہیں، اور وہ ان کے سب سے بڑے ہیں۔ اللہ نے ان کے حق میں گواہی دی کہ اس نے انہیں اپنی طرف سے رحمت عطا کی اور انہیں اپنے پاس سے علم سکھایا، جس میں کلیم اللہ موسیٰ علیہ السلام نے ان کی پیروی کی۔\n\nجن کے بارے میں نبی صلی اللہ علیہ وسلم نے فرمایا: \"اگر موسیٰ زندہ ہوتے تو ان کے لیے میری پیروی کے سوا کوئی چارہ نہ ہوتا۔\"\n\nان کے اسرار میں سے وہ علم ہے جو ہم نے اہل بیت کے مرتبے کے بارے میں ذکر کیا، اور جس پر اللہ نے ان کے بلند مرتبے کی طرف تنبیہ فرمائی ہے۔\n\nاور ان کے اسرار میں سے اس مکر (تدبیر) کا علم ہے جو اللہ نے اپنے بندوں کے ساتھ کیا ہے، ان کے بغض میں، باوجود اس کے کہ وہ رسول اللہ صلی اللہ علیہ وسلم کی محبت کا دعویٰ کرتے ہیں اور آپ نے قرابت داروں میں مودت کا سوال کیا تھا۔ اور رسول اللہ صلی اللہ علیہ وسلم خود اہل بیت میں شامل ہیں۔\n\nپس اکثر لوگوں نے وہ کام نہیں کیا جو رسول اللہ صلی اللہ علیہ وسلم نے اللہ کے حکم سے ان سے پوچھا تھا۔ پس انہوں نے اللہ اور اس کے رسول کی نافرمانی کی، اور انہوں نے اپنے قرابت داروں میں سے صرف اسی سے محبت کی جس سے انہوں نے احسان دیکھا۔ پس انہوں نے اپنی اغراض سے محبت کی اور اپنے نفسوں سے عشق کیا۔\n\nاور ان کے اسرار میں سے یہ ہے کہ وہ اس شریعتِ محمدیہ میں اللہ کی طرف سے مشروع کردہ چیزوں کی صحت پر مطلع ہوتے ہیں، اس طرح سے کہ اس کے علماء بھی نہیں جانتے۔ کیونکہ فقہاء اور محدثین جنہوں نے اپنا علم مردہ سے مردہ کے ذریعے حاصل کیا ہے، ان میں سے متاخرین اس میں صرف غلبۂ ظن پر ہیں، کیونکہ نقل (روایت) ایک گواہی ہے اور تواتر (کثرتِ روایت) نایاب ہے۔\n\nپھر جب وہ ایسی چیزوں پر مطلع ہوتے ہیں جو تواتر کے ذریعے علم کا فائدہ دیتی ہیں، تو وہ منقول لفظ اس حکم میں نص (قطعی دلیل) نہیں ہوتا جس کا انہوں نے حکم دیا ہے، کیونکہ نصوص نایاب ہیں۔ پس وہ اس لفظ سے اپنی فہم کی قوت کے مطابق اخذ کرتے ہیں، اور اسی وجہ سے ان میں اختلاف ہوا ہے۔\n\nاور یہ بھی ممکن ہے کہ اس لفظ کے لیے اس معاملے میں کوئی اور نص ہو جو اس کے معارض ہو، اور وہ ان تک نہ پہنچی ہو۔ اور جو ان تک نہیں پہنچی، اس کے ساتھ وہ مکلف نہیں کیے گئے۔ اور وہ یہ بھی نہیں جانتے کہ اس لفظ کی قوت میں موجود احتمالات میں سے کس صورت کے ساتھ رسول اللہ صلی اللہ علیہ وسلم، جو شارع ہیں، حکم فرماتے تھے۔\n\nپس اہل اللہ نے یہ علم رسول اللہ صلی اللہ علیہ وسلم سے الکشف (کشف) کے ذریعے، حکم میں واضح امر اور صریح نص پر، یا اللہ سے اس بینہ (واضح دلیل) کے ذریعے حاصل کیا جس پر وہ اپنے رب کی طرف سے ہیں، اور اس بصیرت کے ذریعے جس پر وہ لوگوں کو اللہ کی طرف بلاتے ہیں۔ جیسا کہ اللہ نے فرمایا: أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ (تو کیا وہ شخص جو اپنے رب کی طرف سے واضح دلیل پر ہو)۔ اور فرمایا: أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي (میں اللہ کی طرف بلاتا ہوں، بصیرت کے ساتھ، میں بھی اور وہ بھی جنہوں نے میری پیروی کی)۔\n\nپس آپ نے بصیرت میں صرف اپنے آپ کو اکیلا نہیں کیا، اور ان کے لیے حکم میں اتباع کی گواہی دی۔ اور وہ ان کی پیروی صرف بصیرت کے ساتھ کرتے ہیں، اور وہ اللہ کے بندے ہیں جو اس مقام کے اہل ہیں۔\n\nاور ان کے اسرار میں سے یہ بھی ہے کہ وہ اہل عقائد کی اس چیز میں درستگی کو جانتے ہیں جس کا انہوں نے جنابِ الٰہی کے بارے میں اعتقاد رکھا، اور جس کا ان پر التجلی (ظہور الٰہی) ہوا یہاں تک کہ انہوں نے اس کا اعتقاد کر لیا۔ اور اختلاف کا تصور کہاں سے آ سکتا ہے جب کہ وہ اس سببِ موجب پر متفق ہیں جس پر انہوں نے انحصار کیا؟ کیونکہ اس میں دو آدمیوں نے بھی اختلاف نہیں کیا، بلکہ اختلاف اس بات میں واقع ہوا کہ وہ سبب کیا ہے؟ اور اس سبب کو کیا نام دیا جائے؟ پس بعض نے کہا کہ وہ طبیعت ہے، اور بعض نے کہا کہ وہ دہر (زمانہ) ہے، اور بعض نے کچھ اور کہا۔ پس سب اس کے اثبات اور اس کے وجود کے وجوب پر متفق ہیں۔ اور کیا یہ اختلاف انہیں اس انحصار کے باوجود نقصان پہنچاتا ہے یا نہیں؟ یہ سب اس مقام کے اہل کے علوم میں سے ہے۔ (سترہواں حصہ ختم ہوا)",
    "fa": "(باب بیست و نهم) در معرفت راز سلمان که او را به اهل بیت ملحق ساخت و اقطابی که این مقام را از آنان به ارث برد و معرفت اسرار ایشان.\n\nبنده به پروردگار پیوسته است و جدایی‌ای\nاز او ندارد که در فعل و تقدیر دیده شود.\n\nو فرزند در درجات علو پایین‌تر از اوست\nکه شریعت علم را در آن به روشنی بیان کرده است.\n\nپس فرزند در اموال پدرش می‌نگرد\nزیرا وارث اوست، با بخل و تنگ‌نظری.\nو فرزند در رسیدن به مرتبه او طمع می‌ورزد\nو آرزو دارد او را در میان مردگان، مدفون ببیند.\n\nو ارزش بنده از مال سرور اوست\nکه مختارانه و مجبورانه به سوی او باز می‌گردد.\n\nو قدر بنده در جاه سرور اوست\nپس پیوسته در پرده عزت پوشیده است.\n\nخواری همیشه در نفس او همراهش است\nپس پیوسته با هر نفس، مقهور است.\n\nو فرزند در نفس خود به خاطر پدرش\nعزت دارد، پس احترام و تعظیم می‌طلبد.\n\n### [اراده تجرید یا رهایی از تمامی اکوان (عوالم هستی)]\n\nبدان، خداوند تو را تأیید کند.\n\nما از حدیث جعفر بن محمد صادق، از پدرش محمد بن علی، از پدرش علی بن الحسین، از پدرش حسین بن علی، از پدرش علی بن ابی طالب، از رسول خدا (صلی الله علیه و سلم) روایت کرده‌ایم که فرمود: «مولى القوم منهم» (آزادشده یک قوم، از خود آن قوم است).\n\nو ترمذی از رسول خدا (صلی الله علیه و سلم) روایت کرده است که فرمود: «أهل القرآن هم أهل الله وخاصته» (اهل قرآن، اهل خاص خداوند هستند).\n\nو خداوند متعال در حق بندگان خاص خود فرمود: **إِنَّ عِبادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ** (همانا بر بندگان من، تو را تسلطی نیست).\n\nهر بنده الهی که به سوی مخلوقی روی آورد که حقی بر او دارد، به اندازه آن حق از عبودیت (بندگی) خالصانه‌اش برای خدا کاسته شده است؛ زیرا آن مخلوق حق خود را از او می‌طلبد و به واسطه آن حق بر او سلطه دارد. پس او بنده محض و خالص برای خدا نخواهد بود. این همان دلیلی است که نزد منقطعان (کسانی که از خلق بریده‌اند) به سوی خدا، انقطاعشان از خلق و ملازمتشان به سیاحات، بیابان‌ها، سواحل و فرار از مردم و خارج شدن از مالکیت حیوانات را ترجیح داده است. زیرا آنان آزادی از تمامی اکوان (عوالم هستی) را می‌خواهند.\n\nمن در ایام سیاحت خود و در زمانی که این مقام برایم حاصل شد، با گروه بزرگی از آنان ملاقات کردم. من هرگز مالک حیوانی نبودم، حتی لباسی که می‌پوشم؛ زیرا آن را تنها به عاریه برای شخص معینی می‌پوشم که به من اجازه تصرف در آن را داده است. و هرگاه مالک چیزی شوم، در همان لحظه آن را از ملک خود خارج می‌کنم، یا با هبه (بخشیدن) یا با عتق (آزاد کردن) اگر از کسانی باشد که آزاد می‌شوند. این امر برای من زمانی حاصل شد که خواستم به عبودیت (بندگی) اختصاصی برای خدا تحقق یابم. به من گفته شد: این برای تو صحیح نیست مگر آنکه هیچ حجتی برای احدی بر تو نباشد. گفتم: ان‌شاءالله برای خدا هم نباشد. به من گفته شد: چگونه برای تو صحیح است که حجتی برای خدا بر تو نباشد؟ گفتم: حجت‌ها تنها بر منکران اقامه می‌شود نه بر معترفان، و بر اهل ادعاها و صاحبان حظوظ (بهره‌ها) نه بر کسی که می‌گوید: من هیچ حق و بهره‌ای ندارم.\n\n### [اهل بیت و موالیانشان]\n\nو چون رسول خدا (صلی الله علیه و سلم) بنده محض بود و خداوند او و اهل بیتش را تطهیر کامل نمود و رجس (پلیدی) را از آنان دور ساخت، که رجس هر چیزی است که آنان را معیوب سازد؛ زیرا رجس نزد عرب به معنای پلیدی است، چنانکه فراء نقل کرده است. خداوند متعال فرمود: **إِنَّما يُرِيدُ الله لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً** (همانا خداوند می‌خواهد پلیدی را از شما اهل بیت دور کند و شما را کاملاً پاک سازد).\n\nپس به آنان جز مطهر (پاک) اضافه نمی‌شود و این ضروری است، زیرا کسی که به آنان اضافه می‌شود، شبیه آنان است. بنابراین، آنان به خود اضافه نمی‌کنند مگر کسی را که حکم طهارت و تقدیس (پاکیزگی) را داشته باشد.\n\nاین گواهی از پیامبر (صلی الله علیه و سلم) برای سلمان فارسی به طهارت، حفظ الهی و عصمت است، آنجا که رسول خدا (صلی الله علیه و سلم) درباره او فرمود: «سلمان منا أهل البيت» (سلمان از ما اهل بیت است).\n\nو خداوند برای آنان به تطهیر و زدودن رجس از ایشان گواهی داده است. و اگر به آنان جز مطهر و مقدس اضافه نمی‌شود و به مجرد این اضافه، عنایت الهی شامل حال او شده است، پس گمانت درباره خود اهل بیت چیست؟ آنان مطهرون (پاک‌شدگان) هستند، بلکه عین طهارتند.\n\nاین آیه دلالت دارد بر اینکه خداوند اهل بیت را در این سخن خود با رسول خدا (صلی الله علیه و سلم) شریک ساخته است: **لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ** (تا خداوند گناهان گذشته و آینده تو را بیامرزد). و کدام آلودگی و پلیدی پلیدتر و کثیف‌تر از گناهان است؟ پس خداوند پیامبرش (صلی الله علیه و سلم) را با مغفرت پاک ساخت. آنچه نسبت به ما گناه است، اگر از او (صلی الله علیه و سلم) سر می‌زد، گناهی بود در صورت نه در معنا؛ زیرا از جانب حق (خداوند) و از جانب ما شرعاً، مذمتی بر آن وارد نمی‌شد. اگر حکم آن، حکم گناه بود، مذمتی که همراه گناه است، به آن ملحق می‌شد و این سخن خداوند که فرمود: **لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً** صادق نمی‌آمد.\n\nپس شریفان، فرزندان فاطمه، و هر کس که از اهل بیت است، مانند سلمان فارسی، تا روز قیامت در حکم این آیه مغفرت داخل می‌شوند. آنان به اختصاص از جانب خدا و به عنایت به خاطر شرف محمد (صلی الله علیه و سلم) و عنایت خدا به او، مطهرون هستند. حکم این شرف برای اهل بیت تنها در سرای آخرت آشکار می‌شود؛ زیرا آنان آمرزیده محشور می‌شوند. اما در دنیا، اگر یکی از آنان مرتکب حدی شود، حد بر او جاری می‌گردد، مانند توبه‌کننده‌ای که امر زنا یا سرقت یا شرب خمرش به حاکم رسیده باشد؛ حد بر او جاری می‌شود با وجود تحقق مغفرت، همان‌گونه که ماعز و امثال او بودند، و جایز نیست که مورد مذمت قرار گیرند.\n\n### [اهل بیت: تمامی آنچه از ایشان صادر می‌شود، خداوند از آن درگذشته است]\n\nشایسته است که هر مسلمان مؤمن به خدا و آنچه نازل کرده است، سخن خداوند متعال را در این آیه تصدیق کند: **لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ ويُطَهِّرَكُمْ تَطْهِيراً**؛ پس معتقد باشد که خداوند از تمامی آنچه از اهل بیت صادر می‌شود، درگذشته است. بنابراین، شایسته نیست که مسلمانی مذمتی به آنان وارد کند یا به آبروی کسانی که خداوند به تطهیر و زدودن رجس از آنان گواهی داده است، خدشه وارد سازد. این تطهیر نه به خاطر عملی است که انجام داده‌اند و نه به خاطر خیری که پیش فرستاده‌اند، بلکه عنایت پیشین خداوند به آنان است: **ذلِكَ فَضْلُ الله يُؤْتِيهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ** (این فضل خداست که به هر کس بخواهد می‌دهد و خداوند صاحب فضل بزرگ است).\n\nو اگر خبر وارد شده درباره سلمان فارسی صحیح باشد، او این درجه را داراست. زیرا اگر سلمان بر امری بود که ظاهر شرع آن را ناپسند می‌شمرد و مذمت به عامل آن ملحق می‌شد، در این صورت کسی به اهل بیت اضافه می‌شد که رجس از او زدوده نشده است. پس به اهل بیت به اندازه آنچه به آنان اضافه شده، از آن رجس می‌رسید، در حالی که آنان به نص قرآن مطهرون هستند. پس سلمان بدون شک از آنان است. بنابراین، امیدوارم که نسل علی و سلمان نیز این عنایت را دریابند، همان‌گونه که شامل حال فرزندان حسن و حسین و نسل آنان و موالیان اهل بیت شده است، زیرا رحمت خداوند گسترده است.\n\n### [اهل بیت: اقطاب (قطب‌های) عالم]\n\nای ولی من، اگر منزلت مخلوقی نزد خدا به این حد باشد که کسی که به آنان اضافه می‌شود، به شرف آنان مشرف گردد، و شرف آنان برای خودشان نیست، بلکه خداوند متعال است که آنان را برگزیده و جامه شرف بر آنان پوشانده است، پس ای ولی من، گمانت درباره کسی که به آن کس اضافه شود که حمد و مجد و شرف برای ذات و نفس اوست، چیست؟ او سبحانه و تعالی مجید (صاحب مجد) است.\n\nپس کسی که به او اضافه می‌شود، از بندگان اوست که بندگان خاص اویند، و آنان کسانی هستند که هیچ مخلوقی در آخرت بر آنان سلطه‌ای ندارد. خداوند به ابلیس فرمود: **إِنَّ عِبادِي** (همانا بندگان من)؛ پس آنان را به خود اضافه کرد، **لَيْسَ لَكَ عَلَيْهِمْ سُلْطانٌ** (تو را بر آنان تسلطی نیست). و در قرآن، بندگانی را که به خداوند سبحانه اضافه شده‌اند، جز سعادتمندان خاص نمی‌یابی، در حالی که لفظ «عباد» (بندگان) برای غیر آنان آمده است. پس گمانت درباره معصومان و محفوظان از آنان که به حدود سرورشان قیام کرده‌اند و نزد مراسم او ایستاده‌اند، چیست؟ شرف آنان بالاتر و کامل‌تر است. و اینان همان اقطاب (قطب‌های) این مقام هستند.\n\n### [راز سلمان]\n\nو سلمان این شرف مقام اهل بیت را از این اقطاب (قطب‌ها) به ارث برد. او (رضی الله عنه) از داناترین مردم به حقوقی بود که حق (خداوند) بر بندگانش دارد و حقوقی که نفوس و خلق بر او دارند، و قوی‌ترین آنان در ادای این حقوق بود.\n\nو در حق او رسول خدا (صلی الله علیه و سلم) فرمود: «لو كان الايمان بالثريا لنا له رجال من فارس» (اگر ایمان در ثریا باشد، مردانی از فارس به آن دست می‌یابند) و به سلمان فارسی اشاره کرد.\n\nو در اختصاص دادن ذکر ثریا (پروین) توسط پیامبر (صلی الله علیه و سلم) به جای دیگر ستارگان، اشاره‌ای بدیع برای کسانی است که صفات هفت‌گانه را اثبات می‌کنند، زیرا ثریا هفت ستاره است، پس بفهم.\n\nپس راز سلمان که او را به اهل بیت ملحق ساخت، آن چیزی است که پیامبر (صلی الله علیه و سلم) از ادای مکاتبه‌اش (آزادی‌اش) به او عطا کرد. و در این، فقهی شگفت‌انگیز است. پس او عتیق (آزادشده) پیامبر (صلی الله علیه و سلم) است و مولای یک قوم از خود آن قوم است، و همه موالی (آزادشدگان) حق (خداوند) و رحمت او هستند. **وَسِعَتْ كُلَّ شَيْ‏ءٍ** (و رحمت من همه چیز را فرا گرفته است) و هر چیزی بنده و مولای اوست.\n\n### [اهل بیت: شایسته نیست که مسلمانی آنان را مذمت کند]\n\nو پس از آنکه منزلت اهل بیت نزد خدا برای تو روشن شد و اینکه شایسته نیست مسلمانی آنان را به خاطر آنچه از ایشان سر می‌زند، مذمت کند، باید کسی که آنان را مذمت می‌کند بداند که این مذمت به خودش باز می‌گردد. حتی اگر به او ظلم کنند، آن ظلم در گمان او ظلم است نه در نفس‌الامر (حقیقت امر)، اگرچه ظاهر شرع حکم به ادای آن کند. بلکه حکم ظلم آنان به ما در نفس‌الامر شبیه جاری شدن مقادیر (قضا و قدر) بر ما در مال و جانمان است، مانند غرق شدن یا سوختن و دیگر امور هلاک‌کننده. یا یکی از عزیزانش بمیرد یا در جان خود مصیبتی ببیند.\n\nو این همه اموری است که با غرض او موافق نیست، اما جایز نیست که قدر و قضای الهی را مذمت کند، بلکه شایسته است که با تسلیم و رضا با همه آن مقابله کند، و اگر از این مرتبه پایین‌تر است، با صبر، و اگر از آن مرتبه بالاتر است، با شکر؛ زیرا در لابلای آن نعمت‌هایی از جانب خدا برای این مصیبت‌دیده نهفته است. و ورای آنچه ذکر کردیم، خیری نیست؛ زیرا ورای آن چیزی جز دلتنگی، خشم، عدم رضایت و سوء ادب با خدا نیست.\n\nهمچنین شایسته است که مسلمان با تمامی آنچه از اهل بیت در مال، جان، آبرو، خانواده و خویشاوندانش به او می‌رسد، مقابله کند و با رضایت، تسلیم و صبر با همه آن مواجه شود و هرگز آنان را مذمت نکند. و اگرچه احکام مقرر شرعی بر آنان جاری شود، این امر به مقام آنان لطمه‌ای نمی‌زند، بلکه آن را در حکم مقادیر الهی جاری می‌سازد.\n\nما از تعلیق ذم (مذمت) بر آنان منع کردیم، زیرا خداوند آنان را با چیزی از ما متمایز ساخته که ما در آن با آنان قدمی نداریم. اما ادای حقوق مشروعه، این رسول خدا (صلی الله علیه و سلم) بود که از یهود قرض می‌گرفت و هرگاه حقوق خود را مطالبه می‌کردند، آن را به بهترین وجه ممکن ادا می‌کرد. و اگر یهودی در گفتار بر او درشتی می‌کرد، می‌فرمود: «او را واگذارید، زیرا صاحب حق سخنی برای گفتن دارد.» و پیامبر (صلی الله علیه و سلم) در داستانی فرمود: «لو أن فاطمة بنت محمد سرقت قطعت يدها» (اگر فاطمه دختر محمد دزدی می‌کرد، دستش را قطع می‌کردم).\n\nپس وضع احکام برای خداست و او هرگونه که بخواهد و در هر حالی که بخواهد، آن را وضع می‌کند. این‌ها حقوق خداست و با این حال، خداوند آنان را مذمت نکرده است. سخن ما درباره حقوق ماست و آنچه ما حق مطالبه آن را داریم. ما در این مورد مخیریم؛ اگر بخواهیم می‌گیریم و اگر بخواهیم ترک می‌کنیم، و ترک کردن عموماً بهتر است، پس چگونه در مورد اهل بیت؟ و ما حق مذمت هیچ کس را نداریم، پس چگونه اهل بیت را؟ زیرا اگر از طلب حقوق خود صرف نظر کنیم و آنان را در آنچه از ما گرفته‌اند عفو کنیم، به واسطه آن نزد خدا دست برتر و جایگاه مقرب‌تری خواهیم داشت.\n\n### [محبت آل بیت پیامبر از محبت پیامبر است]\n\nزیرا پیامبر (صلی الله علیه و سلم) به امر خدا از ما نخواست مگر **إِلَّا الْمَوَدَّةَ في الْقُرْبى‏** (جز مودت در مورد خویشاوندان). و در این، راز صله ارحام نهفته است. و کسی که سؤال پیامبرش را در آنچه از او خواسته و او بر آن قادر است، نپذیرد، فردا با چه رویی با او ملاقات خواهد کرد یا امید شفاعت او را دارد، در حالی که پیامبرش (صلی الله علیه و سلم) را در آنچه از او خواسته بود، یعنی مودت در مورد خویشاوندانش، یاری نکرده است؟ پس چگونه در مورد اهل بیتش که خاص‌ترین خویشاوندان او هستند؟\n\nسپس او لفظ مودت (مودة) را به کار برده است که به معنای ثبات بر محبت است. زیرا کسی که ود (مودت) او در امری ثابت باشد، آن را در هر حالی همراه خود دارد. و اگر مودت در هر حالی همراه تو باشد، اهل بیت را به خاطر آنچه از آنان در حق تو سر می‌زند و تو حق مطالبه آن را داری، مؤاخذه نمی‌کنی، بلکه آن را از روی محبت و ایثار برای نفس خود (نه بر علیه آن) ترک می‌کنی. محب صادق گفته است:\n\n> وکل ما يفعل المحبوب محبوب‏\n> و هر آنچه محبوب انجام دهد، محبوب است.\n\nو نام حب (دوست داشتن) آمده است، پس حال مودت چگونه است؟ و از بشارت‌ها، آمدن نام «الودود» برای خداوند متعال است. و معنای ثبوت آن جز حصول اثرش بالفعل در سرای آخرت و در آتش برای هر گروهی به اقتضای حکمت خدا در مورد آنان نیست. و دیگری در این معنی گفته است:\n\n> أحب لحبها السودان حتى *** أحب لحبها سود الكلاب‏\n> به خاطر دوست داشتن او، سیاهان را دوست می‌دارم *** تا جایی که به خاطر دوست داشتن او، سگ‌های سیاه را دوست می‌دارم.\n\nو ما در این معنی داریم:\n\n> أحب لحبك الحبشان طرا *** وأعشق لاسمك البدر المنيرا\n> به خاطر دوست داشتن تو، تمامی حبشیان را دوست می‌دارم *** و به خاطر نام تو، ماه تابان را عاشق می‌شوم.\n\nگفته شده است که سگ‌های سیاه به او حمله می‌کردند و او با آن‌ها اظهار محبت می‌کرد. این کار محب صادق است در حب (دوست داشتن) کسی که محبتش نزد خدا او را سعادتمند نمی‌سازد و قربتی به خدا نمی‌دهد. آیا این جز از صدق حب و ثبوت ود (مودت) در نفس است؟\n\n### [محبت اهل بیت، نشانه‌ای از محبت خدا و رسول اوست]\n\nاگر محبت تو به خدا و رسولش صحیح باشد، اهل بیت رسول خدا (صلی الله علیه و سلم) را دوست خواهی داشت و هر آنچه از آنان در حق تو سر می‌زند و با طبع و غرض تو موافق نیست، آن را جمالی می‌بینی که از وقوع آن از جانب ایشان لذت می‌بری. در آن هنگام می‌دانی که نزد خدا که آنان را به خاطر او دوست داشته‌ای، عنایتی داری، زیرا کسی که او را دوست می‌دارد، تو را یاد کرده و به خاطرش خطور کرده‌ای، و آنان اهل بیت رسول او (صلی الله علیه و سلم) هستند. پس خداوند متعال را بر این نعمت شکر می‌کنی، زیرا آنان تو را با زبان‌های طاهره (پاک) یاد کرده‌اند که به تطهیر الهی پاک شده‌اند، طهارتی که علم تو به آن نرسیده است.\n\nو اگر تو را بر خلاف این حالت با اهل بیت ببینیم، در حالی که تو به آنان و به رسول (صلی الله علیه و سلم) که خداوند تو را به واسطه او هدایت کرده، نیازمندی، چگونه من به ود (مودت) تو اعتماد کنم که ادعا می‌کنی در محبت من و رعایت حقوق یا جانب من بسیار کوشا هستی، در حالی که در حق اهل بیت پیامبرت در این حد از بدگویی و ایرادگیری هستی؟\n\nبه خدا سوگند، این نیست مگر از نقص ایمانت و از مکر (مکر) خدا با تو و استدراج (به تدریج به هلاکت کشاندن) تو از جایی که نمی‌دانی. و صورت این مکر آن است که بگویی و معتقد باشی که در این کار از دین و شریعت خدا دفاع می‌کنی و در طلب حق خود می‌گویی که جز آنچه خدا برایت مباح کرده، نخواسته‌ای. در حالی که ذم (مذمت)، بغض، کینه و ترجیح دادن نفس خود بر اهل بیت در آن طلب مشروع گنجانده می‌شود و تو متوجه آن نیستی.\n\nو داروی شفابخش این داء عضال (بیماری مهلک) آن است که هیچ حقی برای خود در برابر آنان نبینی و از حق خود صرف نظر کنی تا در طلب آن، آنچه برایت ذکر کردم، گنجانده نشود. و تو از حاکمان مسلمان نیستی تا اقامه حد یا انصاف مظلوم یا بازگرداندن حق به اهلش بر تو واجب باشد. اگر ناچار حاکم هستی، سعی کن صاحب حق را از حق خود منصرف سازی، اگر محکوم‌علیه از اهل بیت باشد. اگر او امتناع کرد، در آن هنگام اجرای حکم شرع بر تو واجب می‌شود.\n\nای ولی من، اگر خداوند منازل آنان را نزد خود در آخرت برای تو کشف (کشف) می‌کرد، آرزو می‌کردی که ای کاش مولایی از موالیان آنان باشی. خداوند رشد نفوسمان را به ما الهام کند. پس بنگر که منزلت سلمان (رضی الله عن جمیعهم) چقدر شریف است.\n\n### [اسرار اقطاب «سلمانی»]\n\nو چون اقطاب (قطب‌های) این مقام را برایت بیان کردم که آنان عبیدالله (بندگان خدا)، مصطفون (برگزیدگان) و اخیار (نیکوکاران) هستند، بدان که اسرار آنان که خداوند ما را بر آن مطلع ساخته است، بر عوام و حتی بیشتر خواصی که این مقام را ندارند، پوشیده است. و خضر (رضی الله عنه) از جمله آنان و از بزرگ‌ترینشان است. خداوند برای او گواهی داده که رحمتی از نزد خود به او عطا کرده و علمی از لدُن (لدن) خود به او آموخته است، علمی که کلیم‌الله موسی (علیه السلام) از او پیروی کرد. همان موسی که پیامبر (صلی الله علیه و سلم) درباره‌اش فرمود: «لو كان موسى حيا ما وسعه إلا أن يتبعني» (اگر موسی زنده بود، چاره‌ای جز پیروی از من نداشت).\n\nاز اسرار آنان، همان علمی است که درباره منزلت اهل بیت ذکر کردیم و آنچه خداوند بر علو مرتبه آنان در این زمینه تنبیه فرموده است. و از اسرار آنان، علم به مکر (مکر) است که خداوند با بندگانش در بغض ورزیدن آنان (به اهل بیت) با وجود ادعای محبت رسول خدا (صلی الله علیه و سلم) و درخواست مودت در مورد قربى (خویشاوندان)، به کار برده است. در حالی که خود پیامبر (صلی الله علیه و سلم) از جمله اهل بیت است. بیشتر مردم آنچه را که رسول خدا (صلی الله علیه و سلم) به امر خدا از آنان خواسته بود، انجام ندادند، پس خدا و رسولش را نافرمانی کردند. و از خویشاوندان او دوست نداشتند مگر کسی را که از او احسانی دیدند؛ پس آنان اغراض خود را دوست داشتند و عاشق نفوس خود شدند.\n\nو از اسرار آنان، اطلاع بر صحت آنچه خداوند در این شریعت محمدیه برایشان تشریع کرده است، از جهتی است که علمای شریعت از آن بی‌خبرند. زیرا فقها و محدثانی که علم خود را مرده از مرده گرفته‌اند، متأخرین آنان در این علم بر غلبه ظن هستند، زیرا نقل، شهادت است و تواتر (نقل جمعی) نادر است. سپس اگر بر اموری دست یابند که از طریق تواتر مفید علم باشد، آن لفظ منقول به تواتر، نص صریح در حکمی که صادر کرده‌اند، نیست؛ زیرا نصوص صریح نادرند. پس آنان از آن لفظ به اندازه قوت فهم خود برداشت می‌کنند و به همین دلیل اختلاف کرده‌اند. و ممکن است که برای آن لفظ در آن امر، نص دیگری باشد که با آن معارضه کند و به دست آنان نرسیده باشد. و آنچه به دست آنان نرسیده، مکلف به آن نیستند و نمی‌دانند که رسول خدا (صلی الله علیه و سلم) که شارع است، با کدام وجه از وجوه احتمالات موجود در قوت آن لفظ، حکم می‌کرده است.\n\nاما اهل الله (عرفا) آن را از رسول خدا (صلی الله علیه و سلم) در کشف (کشف) بر امر آشکار و نص صریح در حکم می‌گیرند، یا از حق (خداوند) با بینه‌ای که از پروردگارشان دارند و بصیرتی که با آن مردم را به سوی خدا دعوت کرده‌اند، چنانکه خداوند فرمود: **أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ من رَبِّهِ** (آیا کسی که بر بینه‌ای از پروردگارش است [مانند کسی است که نیست؟]) و فرمود: **أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي** (من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). پس خود را در بصیرت تنها نگذاشت و برای پیروانش در حکم به تبعیت گواهی داد. و آنان جز بر بصیرت از او پیروی نمی‌کنند، و اینان بندگان خدا و اهل این مقام هستند.\n\nو از اسرار آنان نیز، اصابت (درست بودن) اهل عقاید در آنچه درباره جناب الهی اعتقاد ورزیده‌اند و آنچه بر آنان تجلی (تجلی الهی) یافته تا بدان معتقد شده‌اند، می‌باشد. و چگونه تصور اختلاف می‌رود با وجود اتفاق بر سبب موجبی که به آن استناد کرده‌اند؟ زیرا در آن سبب، دو نفر اختلاف نکرده‌اند. اختلاف تنها در این واقع شده است که آن سبب چیست و آن سبب را به چه نامی بخوانند. پس برخی گویند طبیعت است، برخی گویند دهر (زمان) است و برخی غیر آن. پس همه در اثبات آن و وجوب وجودش اتفاق دارند. و آیا این اختلاف با وجود این استناد به آنان ضرر می‌رساند یا خیر؟ این همه از علوم اهل این مقام است.\n\nپایان جزء هفدهم."
  },
  "page_count": 5
}