{
  "id": 281,
  "title": {
    "ar": "الباب الأحد والثمانون ومائتان في معرفة منزل الضم وإقامة الواحد مقام الجماعة من الحضرة المحمدية",
    "en": "Chapter Two Hundred and Eighty-One: Concerning the Gnosis (المعرفة) of the Station of Inclusion (منزل الضم) and the Establishment of the One in the Place of the Group, from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب دو سو اکیاسی: الضم (الضم) کے مقام کی معرفت اور واحد کو جماعت کے مقام پر قائم کرنے کے بارے میں، جو الحضرة المحمدية (الحضرة المحمدية) سے ہے۔",
    "fa": "باب دویست و هشتاد و یکم در معرفت منزل ضَمّ (فشرده‌سازی) و قرار دادن واحد به جای جماعت از حضرت محمدیه (الحضرة المحمدية)."
  },
  "content": {
    "ar": "## «الباب الأحد والثمانون ومائتان في معرفة منزل الضم وإقامة الواحد مقام الجماعة من الحضرة المحمدية»\n\n\n> صلاة العصر ليس لها نظير *** لنظم الشمل فيها بالحبيب‏\n\n\n> هي الوسطى لأمر فيه دور *** محصلة على أمر عجيب‏\n\n\n> وما للدور من وسط تراه *** ولا طرفين في علم اللبيب‏\n> فكيف الأمر فيه فدتك نفسي *** فخص العبد بالعلم الغريب‏\n\n\n### [قلب العبد حيث ماله‏]\n\n\nقال رب هذا المنزل إن الصلاة الوسطى أجرها مقرون إذا لم تصل في جماعة بأجر من وتر أهله وماله وقد قال العدل عيسى عليه السلام قلب كل إنسان حيث ماله فاجعلوا أموالكم في السماء تكن قلوبكم في السماء\n\n\nأي تصدقوا وإلى هنا انتهت معرفة هذا العدل وقال الصادق المؤتي جوامع الكلم رسول الله محمد صلى الله عليه وسلم الصدقة تقع بيد الرحمن فيربيها\n\n\nفيكون قلب العبد حيث ماله وإن حيثيته يد الرحمن وأين يد الرحمن من السماء فقد أجمع العدلان على إن المال له من القلب مكانة علية وأما الأهل من زوج وولد فلا خفاء على ذي لب أنهم منوطون بالفؤاد فأما الزوجة فقد جعل الله بينها وبين بعلها المودة والرحمة والسكون إليها والسكون صفة مطلوبة للأكابر وهي الطمأنينة قال إبراهيم بَلى‏ ولكِنْ لِيَطْمَئِنَّ قَلْبِي أي يسكن إلى الوجه الذي يحيي به الموتى ويتعين لي إذ الوجوه لذلك كثيرة فسكن إليه سكونا لا يشوبه تحير ولا تشويش يعني في معرفة الكيفية فانظر بما ذا قرن النبي صلى الله عليه وسلم من فاتته صلاة العصر وسبب ذلك أن أوائل أوقات الصلوات الأربع محدودة إلا العصر فإنها غير محدودة وإن قاربت الحد من غير تحقيق فقربت من التنزيه عن تقييد الحدود إذ كان المغرب محدودا بغروب الشمس وهو محقق محسوس والعشاء محدود أوله بمغيب الشفق وهو محقق محسوس أي شفق كان على الخلاف المعلوم فيه والفجر محدود أوله بالبياض المعترض في الأفق المستطير لا المستطيل وهو محقق محسوس والظهر محدود بزوال الشمس وفي‏ء الظل وهو محقق محسوس ولم يأت مثل هذه الحدود في العصر فتنزهت عن الحدود المحققة فجعل النبي صلى الله عليه وسلم وقتها أن تكون الشمس مرتفعة بيضاء نقية والحد الوارد في ذلك ما يكون في الظهور مثل سائر حدود أوقات الصلوات فعظم قدرها النبي صلى الله عليه وسلم للمناسبة في نفي تحقيق الحدود وكذلك حب المال والأهل لا يضبطه حد يقول القائل في الولد\n\n\n> وإنما أولادنا بيننا *** أكبادنا تمشي على الأرض‏\n\n\nفأنزل الولد منزلة النفس وكما لا يفنى الإنسان في حبه نفسه للقرب المفرط الذي ما يكون مثله قرب إليه البتة كذلك لا يفنى الإنسان في حب ولده ولا ماله ولا أهله لأنه منوط بقلبه بمنزلة نفسه للقرب المفرط يخفى ذلك فيه فإن اتفق أن يطلق امرأته وقد كان حبه إياها كامنا فيه لا يظهر لإفراط القرب أخذه الشوق إليها وهام فيها وحن إليها لبعدها عن ذلك القرب المفرط لتعلق الشوق والوجد بها ولهذا يفنى العاشق في معشوقه الأجنبي لأنه ليس له ذلك القرب الظاهر الذي يحول بينه وبين الاشتياق إليه ولقرب الحق من قلوب العارفين بالعلم المحقق الذوقي الذي وجدوه لهذا صحوا ولم يهيموا فيه هيمان المحبين لله من كونه تجلى لهم في جمال مطلق وتجليه للعلماء به في كمال مطلق وأين الكمال من الجمال فإن الأسماء في حق الكامل تتمانع فيؤدي ذلك التمانع إلى عدم تأثيرها فيمن هذه صفته فيبقى منزها عن التأثير مع الذات المطلقة التي لا تقيدها الأسماء ولا النعوت فيكون الكامل في غاية الصحو كالرسل وهم أكمل الطوائف لأن الكامل في غاية القرب يظهر به في كمال عبوديته مشاهدا كمال ذات موجدة وإذا تحققت ما قلناه علمت أين ذوقك من ذوق الرجال الكمل الذين اصطفاهم الله فيه واختارهم منه ونزههم عنه فهم وهو كهو وهم فسماه الكامل منهم العصر لأنه ضم شي‏ء إلى شي‏ء لاستخراج مطلوب فضمت ذات عبد مطلق في عبوديته لا يشوبها ربوبية بوجه من الوجوه إلى ذات حق مطلق لا يشوبها عبودية أصلا بوجه من الوجوه من اسم إلهي بطلب الكون فلما تقابلت الذاتان بمثل هذه المقابلة كان المعتصر عين الكمال للحق والعبد وهو كان المطلوب الذي له وجد العصر فإن فهمت ما أشرنا إليه فقد سعدت وألقيتك على مدرجة الكمال فارق فيها ولهذا المعنى الإشارة في نظمنا في أول الباب‏\n\n\n> صلاة العصر ليس لها نظير *** لضم الشمل فيها بالحبيب‏\n\n\nوبعد أن أبنت لك مرتبة الكمال فلنبين لك من هذا المنزل قيام الواحد مقام الجماعة وهو عين الإنسان الكامل فإنه أكمل من عين مجموع العالم إذ كان نسخة من العالم حرفا بحرف ويزيد أنه على حقيقة لا تقبل التضاؤل حين قبلها أرفع الأرواح الملكية إسرافيل فإنه يتضاءل في كل يوم سبعين مرة حتى يكون كالوضع أو كما قال والتضاؤل لا يكون إلا عن‏\nرفعة سبقت ولا رفعة للعبد الكلي في عبوديته فإنه مسلوب الأوصاف فلو أنتج لذلك الروح المتضايل حال هذا العبد الكلي في عبوديته لما تكرر عليه التضاؤل فافهم ما أشرت به إليك وقد نبهتك بهذا الخبر أن هذا الملك من أعلم الخلق بالله وتكرار تضاؤله لتكرار التجلي والحق لا يتجلى في صورة مرتين فيرى في كل تجل ما يؤديه إلى ذلك التضاؤل هذا هو العلم الصحيح الذي تعطيه معرفة الله ثم لتعلم إن الله خلق الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ للصورة التي خصه بها وهي التي أعطته هذه المنزلة فكان أحسن تقويم في حقه لا عن مفاضلة أفعل من كذا بل هو مثل قوله الله أكبر لا عن مفاضلة بل الحسن المطلق للعبد الكامل كالكبرياء المطلق الذي للحق فهو أحسن تقويم لا من كذا كما هو الحق أكبر لا من كذا لا إله إلا هو ولا عبد إلا المصمت في عبودته فإن حاد العبد عن هذه المرتبة بوصف ما رباني وإن كان محمودا من صفة رحمانية وأمثالها فقد زال عن المرتبة التي خلق لها وحرم من الكمال والمعرفة بالله على قدر ما اتصف به من صفات الحق فليقلل أو يكثر\n\n\n### [أن للإنسان حالتين حالة عقلية نفسية مجردة عن المادة وحالة عقلية نفسية مدبرة للمادة]\n\n\nواعلم أن للإنسان حالتين حالة عقلية نفسية مجردة عن المادة وحالة عقلية نفسية مدبرة للمادة فإذا كان في حال تجريده عن نفسه وإن كان متلبسا بها حسا فهو على حالته في أحسن تقويم وإذا كان في حال لباسه المادة في نفسه كما هو في حسه فهو على حالته في خسر لا ربح في تجارته فيه فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ وهو قوله إِنَّ الْإِنْسانَ لَكَفُورٌ إِنَّ الْإِنْسانَ لَظَلُومٌ كَفَّارٌ إِنَّ الْإِنْسانَ لِرَبِّهِ لَكَنُودٌ إِنَّ الْإِنْسانَ لَفِي خُسْرٍ إِنَّهُ كانَ ظَلُوماً جَهُولًا فإذا قال الإنسان الكامل الله نطق بنطقه جميع العالم من كل ما سوى الله ونطقت بنطقه أسماء الله كلها المخزونة في علم غيبه والمستأثرة التي يخص الله تعالى بمعرفتها بعض عباده والمعلومة بأعيانها في جميع عباده فقامت تسبيحته مقام تسبيح ما ذكرته فأجره غَيْرُ مَمْنُونٍ وسنومئ إلى تحقيق هذا في المنزل التاسع والثمانين ومائتين وبعد أن نبهتك على معرفة قيام التوحيد بالواحد القائم مقام الجماعة في الخير والشر فإنه قال تعالى في هذا المقام في الخير والشر من قَتَلَ نَفْساً بِغَيْرِ نَفْسٍ أَوْ فَسادٍ في الْأَرْضِ فَكَأَنَّما قَتَلَ النَّاسَ جَمِيعاً ومن أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً ومنزلتنا في هذا البيان لأصحابنا من أهل هذا الشأن ومنزلة القابلين لما بيناه وغير القابلين ما أردف الله به هذه الآية من تعريف الأحوال فقال ولَقَدْ جاءَتْهُمْ رُسُلُنا بِالْبَيِّناتِ ثُمَّ إِنَّ كَثِيراً مِنْهُمْ بَعْدَ ذلِكَ في الْأَرْضِ لَمُسْرِفُونَ فلنبين إيمان العصاة المعبر عنه بالتوبة وما يلزمه وذلك أن الايمان الأصلي هو الفطرة التي فطر الله الناس عليها وهو شهادتهم له سبحانه بالوحدانية في الأخذ الميثاقي فكل مولود يولد على ذلك الميثاق ولكن لما حصل في حصر الطبيعة بهذا الجسم محل النسيان جهل الحالة التي كان عليها مع ربه ونسيها فافتقر إلى النظر في الأدلة على وحدانية خالقه إذا بلغ إلى الحالة التي يعطيها النظر وإن لم يبلغ هذا الحد فإن حكمه حكم والدية فإن كانا مؤمنين أخذ بتوحيد الله تعالى منهم تقليدا وإن كانا على أي دين كان ألحق بهما فمن كان إيمانه تقليدا جزما كان أعصم وأوثق في إيمانه ممن أخذه عن الأدلة لما يتطرق إليها إن كان حاذقا فطنا قوي الفهم من الحيرة والدخل في أدلته وإيراد الشبه عليها فلا يثبت له قدم ولا ساق يعتمد عليها فيخاف عليه فإذا تقدم إيمانه بتوحيد الله شرك ورثه عن أبويه أو عن نظره أو عن الأمة التي هو فيها فذلك الايمان هو عين إيمانه الميثاقي لا غيره وإنما حال بينه وبين العبد حجاب الشرك كالسحابة الحائلة بين البصر والشمس فإذا انجلت ظهر الشمس للبصر كذلك ظهور الايمان للعبد عند ارتفاع الشرك إذ كان المشرك مقرا بوجود الحق فإن قلت فما حكم المعطل هل يكون إيمانه يوجد في الوقت أم حاله حال المشرك قلنا المعطل أقرب إلى الايمان من المشرك فإنه لا بد لكل إنسان أن يجد نفسه مستندا في وجوده إلى أمر ما لا يدري ما هو فيقال له ذلك هو الله فإن حدث له بعد ذلك هل هو واحد أو أكثر من واحد كان في محل النظر في ذلك أو يقلد من يعتقد فيه من الموحدين فما ثم إيمان محدث بل هو مكتوب في قلب كل مؤمن فإن زال في حق المريد الشقاء فإنما تزول وحدانية المعبود لا وجوده وبالتوحيد تتعلق السعادة وبنفيه يتعلق الشقاء المؤبد ولهذا الإشارة بقوله تعالى يا أَيُّهَا الَّذِينَ آمَنُوا في الأخذ الميثاقي آمَنُوا لقول الرسول إليكم من عندنا فلو لا إن الايمان كان عندهم ما وصفوا به وأما نسبة الأعمال إلى هذا المنزل فهو على ما نقرره وذلك‏\n\n\nأن النبي صلى الله عليه وسلم قال بعثت لأتمم مكارم الأخلاق‏\n\n\nومكارم الأخلاق أعمال وأحوال إضافية لأن الناس الذين هم محل مكارم الأخلاق على حالتين حر وعبد كما إن الأخلاق‏\nمحمودة وهي التي تسمى مكارم الأخلاق ومذمومة وهي التي تسمى سفساف الأخلاق والذين تصرف معهم مكارم الأخلاق وسفسافها اثنان وواحد فالواحد هو الله والاثنان نفسك إذا جعلتها منك بمنزلة الأجنبي وغيرك وهو كل ما سوى الله وكل ما سوى الله على قسمين وأنت داخل فيهم عنصري وغير عنصري فالعنصري تصريف الخلق معه حسي وغير العنصري تصريف الخلق معه معنوي فالأعمال المعبر عنها بالأخلاق على قسمين صالح وهو مكارمها وغير صالح وهو سفسافها قال تعالى في القسم الواحد وعَمِلَ صالِحاً وقال في الآخر عَمَلٌ غَيْرُ صالِحٍ فَلا تَسْئَلْنِ ما لَيْسَ لَكَ به عِلْمٌ إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ فعلمه الأدب وإن من الأدب أن تسأل عن علم ما لا يعلم فإذا علم فإن كان من أهل الشفاعة والسؤال فيه سأل فيه وإن لم يكن لم يسأل فيه ولكن غلبت عليه رحمة الأبوة وهي شفقة طبيعية عنصرية فصرفها في غير موطنها فأعلمه الله أن ذلك من صفات الجاهلين والجهل لا يكون معه خير كما إن العلم لا يكون معه شر\n\n\nفقول النبي صلى الله عليه وسلم بعثت لأتمم مكارم الأخلاق‏\n\n\nيريد أنه يعلم ما هي وكيف تصرف وأين تصرف فلتعلم إن المخاطبين بها كما ذكرنا لك حر وعبد فللعبد منها شرب وللحر منها شرب فإذا أضفت الخلق إلى الله تعالى فكل ما سوى الله عبد لله قال تعالى إِنْ كُلُّ من في السَّماواتِ والْأَرْضِ إِلَّا آتِي الرَّحْمنِ عَبْداً وإذا أضفت الخلق بعضه إلى بعض فهو بين حر وعبد فأما حظ العبد من الأخلاق فاعلم إن السيد على الإطلاق قد أوجب وحرم فأمر ونهى وقد أباح فخير وقد رجح فندب وكره وما ثم قسم سادس فكل عمل يتعلق به الوجوب من أمر من السيد الذي هو الله بعمل أو ندب إلى عمل فإن العمل به من مكارم الأخلاق مع الله ومع نفسك إن كان واجبا وإن كان مندوبا إليه فهو من مكارم الأخلاق مع نفسك فإن تضمن منفعة الغير ذلك العمل كان أيضا من مكارم الأخلاق مع غيرك وترك هذا العمل إذا كان على هذا الحكم من سفساف الأخلاق وكل عمل يتعلق به التحريم أو الكراهة فالتقسيم فيه كالتقسيم في الواجب والمندوب إليه على ذلك الحد فترك ذلك العمل لاتصافه بالتحريم أو الكراهة من مكارم الأخلاق وعمله من سفساف الأخلاق وترك العمل فيه عمل روحاني لا جسماني لأنه ترك لا وجود له في العين وأما العمل الذي تعلق به التخيير وهو المباح فعمله من مكارم الأخلاق مع نفسك دنيا لا آخرة فإن اقترن مع العمل كونك عملته لكونه مباحا مشروعا كان من مكارم الأخلاق مع الله ومع نفسك دنيا وآخرة وكذلك حكمه في ترك المباح على هذا التقسيم سواء فجميع الأقسام تتعلق بالعبد وقسم المباح يتعلق بالحر وقسم المكروه والمندوب إليه يتعلق بالحر وفيه من روائح العبودية شمة لا حقيقة فهذا قد حصر لك هذا المنزل منازل الشقاء والسعادة وأبانها لك معينة أي عينت لك من أين تعلمها وهو معرفة الشرع الذي أنت عليه فإن كان الإنسان ممن لم تبلغه الدعوة فمكارم الأخلاق في حقه ما قررها العقل من وجود الغرض والكمال وملاءمة المزاج كشكر المنعم الذي هو من مكارم الأخلاق عقلا وشرعا وكفر النعمة من سفساف الأخلاق عقلا وشرعا وما كلف الله نَفْساً إِلَّا وُسْعَها سواء بلغتها الدعوة أو لم تبلغها فإن للشرع في عملها حكما في نفس الأمر ويعفى عنه فيما أتته من سفساف الأخلاق حيث لم تبلغها الدعوة والعفو عن ذلك من مكارم الأخلاق الإلهية فالحق أولى بصفات الكرم من العبد بل هي له حقيقة وفي العبد بعناية التوفيق ومما يتعلق بهذا المنزل من المكارم التعاون على شكر المنعم والتعاون على تلقي البلاء من المبلى بأن لا يستند في ارتفاع البلاء عنه إلا لمن أنزله به وهو الله تعالى فإن أنزله بالغير فهو من سفساف الأخلاق وإن أنزله بالله كان من مكارم الأخلاق والعبد في الحالتين طالب رفع البلاء عنه والبلاء عبارة عن وجوده وإحساسه بالألم لا غير وفي هذا المقام يغلط كثير من\n\n\nأهل الطريق فيحبسون نفوسهم عن الشكوى إلى الله فيما نزل بهم والشبهة في ذلك لهم أنهم يقولون لا نعترض عليه فيما يجريه علينا فإنه يؤثر في حال الرضاء عنه فيقال لهم قد حصل مقام الرضاء بمجرد إحساسه وعدم طلب رفعه وذلك حد الرضاء لا استصحابه فإن النفس كارهة لوجود الألم ولذا عبرنا عن البلاء بالألم لا بسببه وينبغي للعبد أن يسأل الله تعالى أن يرفع عنه ما نزل به لما يؤدي به إليه من كراهة فعل الله به ولا بد من كراهته طبعا لأن الألم يوجب حكمه لنفسه والفعل في إنزاله إنما هو لله فيتضمن كراهة الألم كراهته طبعا لأن الألم يوجب حكمه وجوده ووجود الألم لم يكن لنفسه وإنما أوجده الله في هذا العبد فتتعلق الكراهة حالا وضمنا بالجناب العزيز فلهذا وقع من الأكابر رب‏\nأَنِّي مَسَّنِيَ الضُّرُّ والتعليم بالسؤال في أن لا يقع منه في المستقبل ما لم يقع في الحال بقوله قالوا ولا تُحَمِّلْنا ما لا طاقَةَ لَنا به ويتعلق به من سوء الأدب مقاومة القهر الإلهي ومقاومة العبد السيد في أمر ما من سفساف الأخلاق إذ ليس ذلك من صفات العبودة فيستعين العبد إذا كان ضعيفا بأخيه المؤمن في ذلك ويجب على الآخر معونته بالتعليم والتعزية فإن المؤمن كثير بأخيه وإذا انفرد الإنسان بهمه عظم عليه وإذا وجد من يلقيه إليه ليقاسمه فيه ويستريح عليه ويخف عنه فأعانه الآخر يحسن الإصغاء إليه فيما يلقى إليه من همه وجوابه إياه بما يسره في ذلك ومشاركته بإظهار التألم لما ناله فذلك الصديق الصادق المعين كما قيل‏\n\n\n> صديقي من يقاسمني همومي *** ويرمي بالعداوة من رمانى‏\n\n\nوقال الآخر\n\n\n> إذا الحمل الثقيل تقسمته *** رقاب الخلق خف على الرقاب‏\n\n\nفهذا قد بينا لك بعض ما يحويه هذا المنزل بالإجمال لا بالتفصيل مخافة التطويل فما تركنا منه شيئا ولا أعلمناك منه بشي‏ء وهكذا فعلنا في كل منزل إن شاء الله تعالى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Eighty-One: Concerning the Knowledge of the Station of Inclusion (الضم) and the Establishment of the One in the Place of the Congregation, from the Muhammadan Presence (الحضرة المحمدية)\n\nThe Afternoon Prayer (Ṣalāt al-ʿAṣr) has no equal,\nFor the gathering of the whole within it by the Beloved.\n\nIt is the Middle Prayer (al-Wusṭā) for a matter involving a cycle,\nAchieved upon a wondrous affair.\n\nYet the cycle has no middle that you see,\nNor two ends, in the knowledge of the discerning one.\n\nSo how is the matter concerning it? May my soul be sacrificed for you!\nTherefore, single out the servant with this unique knowledge.\n\n### The Servant's Heart is Where His Wealth Is\n\nThe Lord of this Station said that the reward of the Middle Prayer (al-Ṣalāt al-Wusṭā), if not performed in congregation, is linked to the reward of one who loses his family and wealth. The Just One, Jesus, peace be upon him, said: \"The heart of every person is where his wealth is, so make your treasures in heaven, and your hearts will be in heaven.\"\n\nMeaning: Give charity. And here ends the knowledge of this Just One. The Truthful One, who was given the comprehensive words (jawāmiʿ al-kalim), the Messenger of Allah, Muhammad, peace and blessings be upon him, said: \"Charity falls into the Hand of the All-Merciful, and He nurtures it.\"\n\nThus, the servant's heart is where his wealth is, and its location (ḥaythiyya) is the Hand of the All-Merciful. And where is the Hand of the All-Merciful compared to the heaven? The two Just Ones (Jesus and Muhammad) have agreed that wealth holds a high status in the heart. As for family, including spouse and child, it is no secret to the discerning person that they are tied to the heart (al-fu'ād).\n\nRegarding the wife, Allah has placed between her and her husband affection (al-mawadda), mercy (al-raḥma), and repose (al-sukūn) toward her. Repose is a quality sought by the great ones (al-akābir), which is tranquility (al-ṭuma'nīna). Abraham said: <<بَلى‏ ولكِنْ لِيَطْمَئِنَّ قَلْبِي>> (Yes, but that my heart may be tranquil). That is, that it may repose in the specific manner (al-wajh) by which He revives the dead, and that this manner may be determined for me, since the manners for that are numerous. So, he reposed in it with a repose untainted by confusion or disturbance, meaning in the knowledge of the modality (al-kayfiyya).\n\nLook then at what the Prophet, peace and blessings be upon him, linked to the one who missed the Afternoon Prayer (Ṣalāt al-ʿAṣr). The reason for this is that the beginnings of the times for the four other prayers are defined (maḥdūda), except for the Afternoon Prayer, which is undefined (ghayr maḥdūda). Even if it approaches a limit, it does so without verification (taḥqīq), thus approaching the transcendence (tanzīh) of being restricted by limits.\n\nThe Sunset Prayer (Maghrib) is limited by the setting of the sun, which is verified and perceptible (maḥqūq maḥsūs). The Night Prayer (ʿIshā') is limited at its beginning by the disappearance of the twilight (shafaq), which is verified and perceptible, whichever twilight it may be, according to the known difference of opinion concerning it. The Dawn Prayer (Fajr) is limited at its beginning by the whiteness that spreads across the horizon (al-mustaṭīr), not the whiteness that stretches vertically (al-mustaṭīl), which is verified and perceptible. The Noon Prayer (Ẓuhr) is limited by the sun's zenith (zawāl) and the return of the shadow (fay' al-ẓill), which is verified and perceptible.\n\nNo such limits have been established for the Afternoon Prayer, so it is transcendent of verified limits. The Prophet, peace and blessings be upon him, made its time when the sun is high, white, and pure. The limit mentioned concerning this is what appears in manifestation (al-ẓuhūr), like the limits of the other prayer times. The Prophet, peace and blessings be upon him, magnified its status due to its correspondence with the negation of verified limits.\n\nSimilarly, the love of wealth and family is not governed by a limit. The poet says concerning the child:\n\nOur children among us are\nOur livers walking upon the earth.\n\nThus, the child is placed in the station of the self (al-nafs). Just as a person does not perish (yufnā) in the love of his own self due to the excessive proximity (al-qurb al-mufrit)—a proximity that has no equal—likewise, a person does not perish in the love of his child, his wealth, or his family, because they are tied to his heart in the station of his self due to the excessive proximity, which conceals that love within him.\n\nIf it happens that he divorces his wife, and his love for her was latent within him, not manifesting due to the excess of proximity, then longing (al-shawq) seizes him for her, and he becomes passionately devoted (hām) to her and yearns for her, due to her distance from that excessive proximity, allowing longing and ecstasy (al-wajd) to attach to her. This is why the lover (al-ʿāshiq) perishes in his foreign beloved (al-maʿshūq al-ajnabī), because he does not have that manifest proximity which prevents him from longing for them.\n\nDue to the proximity of The Real (الحق) to the hearts of the Gnostics (العارفين) through verified, tasted Knowledge (العلم المحقق الذوقي) which they found, they remained sober (ṣaḥū) and did not become passionately devoted in Him like the lovers of Allah. This is because He disclosed Himself (تجلى) to them in Absolute Beauty (جمال مطلق), while His Self-disclosure (تجلي) to the scholars concerning Him is in Absolute Perfection (كمال مطلق).\n\nAnd where is Perfection compared to Beauty? For the Names (الأسماء) in the case of the Perfect Human (الكامل) resist one another, and this resistance leads to their lack of effect upon the one whose description this is. Thus, he remains transcendent (munazzahan) of influence, alongside the Absolute Essence (الذات المطلقة) which is not restricted by Names or Attributes (النعوت).\n\nTherefore, the Perfect Human is in the utmost state of sobriety (الصحو), like the Messengers, who are the most perfect of groups. This is because the Perfect Human, being in the utmost proximity, manifests through his perfect servitude (عبودية), witnessing the perfection of the Essence that brought him into existence.\n\nIf you realize what we have said, you will know where your taste (ذوق) stands compared to the taste of the Perfect Men (الرجال الكمل) whom Allah chose in Him, selected from Him, and purified from Him. The Perfect Human among them named it *al-ʿAṣr* (Afternoon/Time/Squeezing) because it is the inclusion (ضم) of one thing to another for the extraction of a desired object.\n\nThus, the Essence (ذات) of an absolute servant (عبد مطلق) in his servitude—which is not tainted by Lordship (ربوبية) in any respect—was included with the Essence of an Absolute Real (حق مطلق)—which is not tainted by servitude at all in any respect—from a Divine Name (اسم إلهي) seeking existence (الكون). When the two Essences confronted each other with such a confrontation, the extracted essence (al-muʿtaṣar) was the very perfection (عين الكمال) for both The Real and the servant. This was the desired object for which *al-ʿAṣr* (the extraction/time) was found. If you have understood what we have alluded to, you have achieved felicity, and I have placed you upon the ladder of perfection; ascend upon it. For this meaning, there is an allusion in our poetry at the beginning of the chapter:\n\nThe Afternoon Prayer has no equal,\nFor the gathering of the whole within it by the Beloved.\n\nNow that I have clarified the level of perfection for you, let us clarify, from this Station, the establishment of the One in the place of the Congregation, which is the very essence of the Perfect Human (الإنسان الكامل). For he is more perfect than the essence of the totality of the cosmos (العالم), since he is a copy of the cosmos, letter by letter. He is superior because he possesses a Reality (حقيقة) that does not accept diminution (التضاؤل), whereas the highest of the angelic spirits, Israfil, accepted it. Israfil diminishes seventy times every day until he becomes like a fetus (al-waḍʿ) or as he said. Diminution only occurs following a preceding elevation.\n\nBut there is no elevation for the Universal Servant (العبد الكلي) in his servitude, for he is stripped of attributes (مسلوب الأوصاف). If the state of this Universal Servant in his servitude were to be produced for that diminishing spirit, the diminution would not be repeated for him. Understand what I have alluded to you.\n\nI have alerted you with this report that this Angel is among the most knowledgeable of creation concerning Allah. The repetition of his diminution is due to the repetition of the Theophany (التجلي), and The Real does not disclose Himself in the same form twice. Thus, in every Theophany, he sees what leads him to that diminution. This is the sound knowledge granted by the Gnosis of Allah (معرفة الله).\n\nThen know that Allah created <<الْإِنْسانَ في أَحْسَنِ تَقْوِيمٍ>> (Man in the best stature) due to the form (الصورة) with which He distinguished him, and which granted him this station. Thus, \"best stature\" (أحسن تقويم) in his case is not based on comparison of \"more than such-and-such,\" but rather, it is like the saying \"Allah is Greater\" (Allahu Akbar), which is not based on comparison. Rather, Absolute Beauty (الحسن المطلق) belongs to the Perfect Servant (العبد الكامل), just as Absolute Grandeur (الكبرياء المطلق) belongs to The Real. So, he is \"best stature\" not *from* anything, just as The Real is \"Greater\" not *than* anything. There is no god but He, and no servant except the one who is absolute (المصمت) in his servitude.\n\nIf the servant deviates from this level by adopting any Lordly Attribute (وصف رباني), even if it is a praiseworthy attribute like a Merciful Attribute (صفة رحمانية) or its like, he has departed from the level for which he was created and is deprived of perfection and Gnosis of Allah (معرفة الله) to the extent that he has described himself with the Attributes of The Real. Let him diminish or increase [his deviation].\n\n### Man's Two States: A Rational, Psychic State Abstracted from Matter, and a Rational, Psychic State Governing Matter\n\nKnow that Man has two states: a rational, psychic state (حالة عقلية نفسية) abstracted from matter, and a rational, psychic state governing matter. When he is in the state of abstraction from his self (نفس), even if he is physically clothed in it, he is in his state of \"best stature\" (أحسن تقويم). But when he is in the state of wearing matter in his self, just as he is in his senses, he is in his state of loss (خسر), with no profit in his trade therein. <<فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ>> (So their trade did not profit, nor were they guided). This is His saying: <<إِنَّ الْإِنْسانَ لَكَفُورٌ>> (Indeed, man is ungrateful), <<إِنَّ الْإِنْسانَ لَظَلُومٌ كَفَّارٌ>> (Indeed, man is unjust and ungrateful), <<إِنَّ الْإِنْسانَ لِرَبِّهِ لَكَنُودٌ>> (Indeed, man is ungrateful to his Lord), <<إِنَّ الْإِنْسانَ لَفِي خُسْرٍ>> (Indeed, man is in loss), <<إِنَّهُ كانَ ظَلُوماً جَهُولًا>> (Indeed, he was unjust and ignorant).\n\nWhen the Perfect Human (الإنسان الكامل) says \"Allah,\" the entire cosmos (العالم)—everything other than Allah—speaks with his utterance. And all the Names of Allah speak with his utterance: those stored in the knowledge of His Unseen (علم غيبه), those reserved (المستأثرة) which Allah singles out some of His servants to know, and those known by their fixed entities (أعيانها) among all His servants. Thus, his glorification (تسبيح) stands in the place of the glorification of all that I have mentioned, and his reward is <<غَيْرُ مَمْنُونٍ>> (unfailing/uninterrupted). We shall allude to the verification of this in Station Two Hundred and Eighty-Nine.\n\nAfter I have alerted you to the knowledge of the establishment of Unity (التوحيد) by the One who stands in the place of the Congregation, concerning both good and evil, for Allah the Exalted said in this context regarding good and evil: <<من قَتَلَ نَفْساً بِغَيْرِ نَفْسٍ أَوْ فَسادٍ في الْأَرْضِ فَكَأَنَّما قَتَلَ النَّاسَ جَمِيعاً>> (Whoever kills a soul unless for a soul or for corruption in the land, it is as if he had killed all mankind), and <<ومن أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً>> (And whoever saves a life, it is as if he had saved all mankind).\n\nOur station in this clarification is for our companions among the people of this spiritual concern (الشأن). The station of those who accept what we have clarified, and those who do not accept it, is what Allah followed this verse with, defining the states: <<ولَقَدْ جاءَتْهُمْ رُسُلُنا بِالْبَيِّناتِ ثُمَّ إِنَّ كَثِيراً مِنْهُمْ بَعْدَ ذلِكَ في الْأَرْضِ لَمُسْرِفُونَ>> (And Our Messengers had certainly come to them with clear proofs. Then, indeed, many of them, after that, were transgressors in the land).\n\nLet us clarify the faith of the disobedient (العصاة), which is expressed as repentance (التوبة), and what it necessitates. The original faith (الإيمان الأصلي) is the primordial nature (الفطرة) upon which Allah created mankind, which is their witnessing to His Oneness (الوحدانية) when the Covenant (الميثاق) was taken. Every newborn is born upon that Covenant. But when he entered the confinement of nature (حصر الطبيعة) within this body, the place of forgetfulness (محل النسيان), he became ignorant of the state he was in with his Lord and forgot it. Thus, he required intellectual investigation (النظر) into the proofs of his Creator's Oneness when he reached the state that investigation grants.\n\nIf he does not reach this limit, his ruling is that of his parents. If they are believers, he adopts the Oneness of Allah (توحيد) from them by imitation (تقليد). If they follow any other religion, he is attached to them. Whoever's faith is certain imitation is more protected and reliable in his faith than one who derives it from proofs (الأدلة). This is because proofs, if one is clever, perceptive, and strong in understanding, are subject to confusion (الحيرة) and corruption (الدخل) in their arguments and the introduction of doubts (الشبه) upon them. Thus, he establishes no foot or leg upon which to rely, and there is fear for him.\n\nIf his faith in the Oneness of Allah is preceded by polytheism (شرك)—inherited from his parents, derived from his investigation, or from the nation he belongs to—that faith is the very essence of his Covenantal faith and nothing else. The only thing that intervened between him and the servant was the veil of polytheism, like a cloud separating the sight from the sun. When the cloud clears, the sun appears to the sight. Likewise is the appearance of faith to the servant when polytheism is lifted, since the polytheist acknowledges the existence of The Real (الحق).\n\nIf you ask: What is the ruling concerning the atheist/denier (المعطل)? Does his faith come into existence at that moment, or is his state like that of the polytheist? We say: The atheist is closer to faith than the polytheist. This is because every human being must find himself relying for his existence upon *something* he does not know what it is. He is then told: \"That is Allah.\" If the question then arises for him whether He is One or more than one, he is in the position of investigating that, or imitating one of the monotheists (الموحدين) whom he trusts. There is no newly created faith (إيمان محدث); rather, it is written in the heart of every believer.\n\nIf misery (الشقاء) departs concerning the seeker (المريد), what departs is the oneness of the worshipped object, not His existence. Felicity (السعادة) is connected to Oneness (التوحيد), and eternal misery (الشقاء المؤبد) is connected to its negation. For this reason, the allusion in His saying, <<يا أَيُّهَا الَّذِينَ آمَنُوا>> (O you who have believed) at the taking of the Covenant, is followed by: \"Believe in the saying of the Messenger who comes to you from Us.\" If faith were not already present with them, they would not have been described by it.\n\nAs for the relation of deeds (الأعمال) to this Station, it is as we shall establish. The Prophet, peace and blessings be upon him, said: \"I was sent to perfect the noble traits of character (مكارم الأخلاق).\"\n\nNoble traits of character are relative deeds and states, because the people who are the locus of noble traits are of two states: free (حر) and servant (عبد). Just as character traits are praiseworthy—which are called noble traits—and blameworthy—which are called base traits (سفساف الأخلاق).\n\nThose with whom noble and base traits are exercised are two and one. The One is Allah, and the two are: your self (نفس) when you treat it as a stranger to you, and your other (غيرك), which is everything other than Allah. Everything other than Allah is of two divisions—and you are included in them: elemental (عنصري) and non-elemental (غير عنصري). Interaction with the elemental creation is sensory, and interaction with the non-elemental creation is spiritual (معنوي).\n\nDeeds expressed as character traits are of two types: righteous (صالح), which are the noble traits, and unrighteous (غير صالح), which are the base traits. Allah the Exalted said concerning the first division: <<وعَمِلَ صالِحاً>> (And he did righteous deeds). And He said concerning the other: <<عَمَلٌ غَيْرُ صالِحٍ فَلا تَسْئَلْنِ ما لَيْسَ لَكَ به عِلْمٌ إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ>> (It is an unrighteous deed, so do not ask Me about that of which you have no knowledge. Indeed, I advise you lest you be among the ignorant).\n\nThus, He taught him proper conduct (الأدب). It is part of proper conduct to ask about knowledge that is not known. If it is known, then if he is among the people of intercession and asking concerning it, he asks concerning it; if not, he does not ask concerning it. But the mercy of fatherhood overcame him—a natural, elemental compassion—and he exercised it in the wrong place. So Allah informed him that this was among the characteristics of the ignorant (الجاهلين). Ignorance is not accompanied by good, just as knowledge is not accompanied by evil.\n\nThe saying of the Prophet, peace and blessings be upon him, \"I was sent to perfect the noble traits of character,\" means that he knows what they are, how they are exercised, and where they are exercised. Know that those addressed by them are, as we mentioned, the free and the servant. The servant has a share of them, and the free person has a share of them.\n\nIf you relate creation (الخلق) to Allah the Exalted, then everything other than Allah is a servant of Allah. He the Exalted said: <<إِنْ كُلُّ من في السَّماواتِ والْأَرْضِ إِلَّا آتِي الرَّحْمنِ عَبْداً>> (There is none in the heavens and earth but that he comes to the Most Merciful as a servant). But if you relate creation one part to another, it is divided between free and servant.\n\nAs for the servant's share of character traits, know that the Absolute Lord (السيد على الإطلاق) has made things obligatory (أوجب) and forbidden (حرم); He has commanded and prohibited. He has made things permissible (أباح), thus giving choice (خير). He has favored some, thus recommending (ندب) and disapproving (كره). There is no sixth division.\n\nEvery deed related to obligation (الوجوب) by a command from the Lord, who is Allah, or a recommendation (ندب) to a deed, then performing that deed is among the noble traits of character with Allah and with your self, if it is obligatory. If it is recommended, it is among the noble traits with your self. If that deed includes benefit for others (الغير), it is also among the noble traits with your other. Abandoning this deed, when it falls under this ruling, is among the base traits of character.\n\nEvery deed related to prohibition (التحريم) or disapproval (الكراهة), the division concerning it is like the division concerning the obligatory and the recommended, according to that limit. Abandoning that deed, due to its description as prohibited or disapproved, is among the noble traits of character, and performing it is among the base traits. The abandonment of a deed in this context is a spiritual deed (عمل روحاني), not a physical one, because abandonment is a non-existence (لا وجود) in the concrete entity (العين).\n\nAs for the deed related to choice, which is the permissible (المباح), performing it is among the noble traits with your self, in this world (دنيا) but not the Hereafter (آخرة). If the deed is accompanied by the fact that you performed it because it is permissible and legislated (مشروعا), then it is among the noble traits with Allah and with your self, in this world and the Hereafter. The ruling for abandoning the permissible is exactly the same according to this division.\n\nAll divisions relate to the servant. The division of the permissible relates to the free person. The division of the disapproved and the recommended relates to the free person, containing a scent of servitude (العبودية), but not the reality of it.\n\nThis has confined for you, in this Station, the stations of misery and felicity, and clarified them for you specifically—meaning, I have specified for you where to learn them: which is the knowledge of the Sacred Law (الشرع) you follow.\n\nIf a person is among those whom the Call (الدعوة) has not reached, then the noble traits of character in his case are those established by the intellect (العقل) concerning the existence of purpose, perfection, and suitability to temperament—such as thanking the Benefactor, which is a noble trait rationally and legally, and ingratitude for the blessing (كفر النعمة) is a base trait rationally and legally.\n\nAllah has not burdened <<نَفْساً إِلَّا وُسْعَها>> (a soul beyond its capacity), whether the Call reached it or not. For the Sacred Law has a ruling concerning its deed in reality (في نفس الأمر), but he is pardoned (يعفى عنه) for what he committed of base traits where the Call did not reach him. This pardon (العفو) is among the Divine Noble Traits (مكارم الأخلاق الإلهية). The Real (الحق) is more deserving of the Attributes of Generosity (الكرم) than the servant; rather, they belong to Him truly, and they exist in the servant through the grace of Divine Aid (عناية التوفيق).\n\nAmong the noble traits related to this Station is cooperation (التعاون) in thanking the Benefactor, and cooperation in receiving affliction (البلاء) from the Afflictor, by relying for the removal of the affliction only upon the One who sent it down, who is Allah the Exalted. If he seeks its removal through others (الغير), it is among the base traits. If he seeks its removal through Allah, it is among the noble traits. In both states, the servant seeks the removal of the affliction. Affliction is merely the expression of its existence and the sensation of pain (الألم).\n\nIn this context, many of the People of the Path (أهل الطريق) err by restraining their souls from complaining to Allah concerning what has befallen them. Their misconception is that they say: \"We do not object to what He decrees upon us, for this demonstrates the state of contentment (الرضاء) with Him.\"\n\nIt is said to them: The station of contentment is achieved merely by sensing it and not seeking its removal. That is the limit of contentment, not its continuous accompaniment, for the soul naturally dislikes the existence of pain. This is why we expressed affliction as pain, not its cause. The servant ought to ask Allah the Exalted to remove what has befallen him, because the pain leads him to dislike Allah's action upon him. He must naturally dislike it, because pain necessitates its ruling for the self, while the act of sending it down belongs only to Allah. Thus, the dislike of the pain implicitly includes dislike, naturally, because pain necessitates its existence, and the existence of pain was not for the self, but Allah created it in this servant. Therefore, the dislike relates immediately and implicitly to the Glorious Presence (الجناب العزيز).\n\nFor this reason, it occurred from the great ones (الأكابر): <<رَبِّ أَنِّي مَسَّنِيَ الضُّرُّ>> (My Lord, indeed adversity has touched me). And the teaching concerning asking that what has not occurred in the present should not occur in the future is in His saying: <<قالوا ولا تُحَمِّلْنا ما لا طاقَةَ لَنا به>> (They said: And burden us not with that which we have no capacity to bear).\n\nRelated to this is the poor conduct (سوء الأدب) of resisting the Divine Compulsion (القهر الإلهي) and the servant resisting the Lord in any matter, which is among the base traits of character, as this is not among the attributes of servitude (العبودة).\n\nTherefore, if the servant is weak, he seeks help from his believing brother in this matter. And it is obligatory upon the other to assist him with instruction and consolation, for the believer is numerous through his brother. When a person is alone with his worry (هم), it becomes great upon him. If he finds someone to cast it upon, to share it with, to find rest upon, and to lighten it for him, and the other assists him by listening well to the worry cast upon him, and answering him with what pleases him concerning it, and sharing in it by showing pain for what afflicted him—that is the truthful, assisting friend (الصديق الصادق المعين), as was said:\n\nMy friend is he who shares my worries,\nAnd casts enmity upon whoever casts it upon me.\n\nAnd another said:\n\nWhen the heavy burden is divided\nAmong the necks of creation, it becomes light upon the necks.\n\nThus, we have clarified for you some of what this Station contains, generally but not in detail, for fear of prolixity. We have neither omitted anything from it nor informed you of anything concerning it [that was not necessary]. We shall do the same in every Station, if Allah wills. And <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو اکیاسی: ضم (ملانے) کے مقام کی معرفت اور الحضرة المحمدیۃ (الحضرة المحمدیۃ) سے ایک کو جماعت کے مقام پر قائم کرنے کے بیان میں\n\nنماز عصر کی کوئی نظیر نہیں،\nکیونکہ اس میں حبیب کے ساتھ اجتماع کو منظم کیا گیا ہے۔\nیہ وسطیٰ ہے ایک ایسے امر کے لیے جس میں دور (چکر) ہے،\nجو ایک عجیب امر پر حاصل ہوتا ہے۔\nاور دور (چکر) کا نہ کوئی وسط ہوتا ہے جسے تم دیکھو،\nاور نہ ہی اہل دانش کے علم میں اس کے دو کنارے ہوتے ہیں۔\nتو اس میں کیا معاملہ ہے، میری جان تم پر فدا ہو،\nپس عبد (عبد) کو اس غریب (انوکھے) علم کے ساتھ خاص کر دے۔\n\n### [عبد (عبد) کا قلب (قلب) وہاں ہوتا ہے جہاں اس کا مال ہو]\n\nاس مقام کے رب نے کہا کہ نماز وسطیٰ کا اجر اس وقت بھی جماعت کے بغیر ادا کرنے پر اس شخص کے اجر کے ساتھ ملا دیا جاتا ہے جس کے اہل اور مال کو وتر (تنہا) کر دیا گیا ہو۔ اور عادل عیسیٰ علیہ السلام نے فرمایا: \"ہر انسان کا قلب (قلب) وہاں ہوتا ہے جہاں اس کا مال ہو۔ پس اپنے اموال کو آسمان میں رکھو تاکہ تمہارے قلوب (قلوب) آسمان میں ہوں۔\" یعنی صدقہ کرو۔ اور اس عادل کی معرفت (معرفت) یہیں تک ختم ہو گئی۔ اور صادق، جوامع الکلم عطا کیے جانے والے، رسول اللہ محمد صلی اللہ علیہ وسلم نے فرمایا: \"صدقہ رحمن کے ہاتھ میں پڑتا ہے، پس وہ اسے پالتا ہے۔\"\n\nتو عبد (عبد) کا قلب (قلب) وہاں ہوتا ہے جہاں اس کا مال ہو، اور اس کی حیثیت (حيثيت) ید الرحمن (ید الرحمن) ہے۔ اور ید الرحمن (ید الرحمن) آسمان سے کہاں ہے؟ پس دونوں عادلوں نے اس بات پر اتفاق کیا کہ مال کو قلب (قلب) میں ایک بلند مقام حاصل ہے۔\n\nاور جہاں تک اہل کا تعلق ہے، یعنی بیوی اور اولاد، تو کسی بھی صاحب عقل پر یہ بات پوشیدہ نہیں کہ وہ فؤاد (دل) سے جڑے ہوئے ہیں۔ بیوی کے لیے تو اللہ نے اس کے اور اس کے شوہر کے درمیان مودت (محبت)، رحمت، اور اس کی طرف سکون (سكون) پیدا کیا ہے۔ اور سکون (سكون) اکابر کے لیے مطلوب صفت ہے، جو کہ طمانیت (اطمینان) ہے۔ ابراہیم علیہ السلام نے فرمایا: بَلىٰ وَلٰكِنْ لِيَطْمَئِنَّ قَلْبِي (ہاں، لیکن تاکہ میرے قلب کو اطمینان ہو)۔ یعنی اس وجہ کی طرف سکون ہو جس سے وہ مردوں کو زندہ کرتا ہے اور وہ میرے لیے متعین ہو جائے، کیونکہ اس کے لیے وجوہات بہت ہیں۔ پس وہ اس کی طرف ایسا سکون اختیار کرے جس میں کوئی حیرت یا تشویش شامل نہ ہو، یعنی کیفیت کی معرفت (معرفت) میں۔ پس دیکھو کہ نبی صلی اللہ علیہ وسلم نے کس چیز کے ساتھ اس شخص کو ملایا جس کی نماز عصر فوت ہو گئی ہو۔ اس کی وجہ یہ ہے کہ چار نمازوں کے اوقات کی ابتدا محدود ہے، سوائے عصر کے، کیونکہ وہ غیر محدود ہے، اگرچہ وہ بغیر تحقیق کے حد کے قریب ہو جاتی ہے۔ پس وہ حدود کی قید سے تنزیہ (تنزیہ) کے قریب ہو گئی، کیونکہ مغرب کا وقت غروب آفتاب سے محدود ہے، اور یہ ایک محقق محسوس (حسی) حد ہے۔ اور عشاء کا وقت شفق کے غائب ہونے سے محدود ہے، اور یہ ایک محقق محسوس (حسی) حد ہے، خواہ وہ کوئی بھی شفق ہو جس میں معلوم اختلاف ہے۔ اور فجر کا وقت افق میں پھیلنے والی سفید روشنی سے محدود ہے، نہ کہ لمبی روشنی سے، اور یہ ایک محقق محسوس (حسی) حد ہے۔ اور ظہر کا وقت سورج کے زوال اور سائے کے پلٹنے سے محدود ہے، اور یہ ایک محقق محسوس (حسی) حد ہے۔ اور عصر میں ایسی حدود نہیں آئیں، پس وہ محقق حدود سے منزہ ہو گئی۔ چنانچہ نبی صلی اللہ علیہ وسلم نے اس کا وقت یہ مقرر کیا کہ سورج بلند، سفید اور صاف ہو۔ اور اس بارے میں جو حد وارد ہوئی ہے وہ ایسی ہے جو ظہور میں دیگر نمازوں کے اوقات کی حدود کی طرح ہو۔ پس نبی صلی اللہ علیہ وسلم نے حدود کی تحقیق کی نفی میں مناسبت کی وجہ سے اس کی قدر کو عظیم کر دیا۔ اسی طرح مال اور اہل کی محبت کو کوئی حد ضبط نہیں کرتی۔ کہنے والا اولاد کے بارے میں کہتا ہے:\n\n> اور ہمارے بچے تو ہمارے درمیان\n> ہمارے جگر ہیں جو زمین پر چلتے ہیں۔\n\nپس اس نے اولاد کو نفس کے مقام پر اتارا۔ اور جس طرح انسان اپنے نفس کی محبت میں فنا (فنا) نہیں ہوتا، اس مفرط قرب کی وجہ سے جس جیسا قرب اسے کبھی حاصل نہیں ہوتا، اسی طرح انسان اپنی اولاد، اپنے مال اور اپنے اہل کی محبت میں فنا (فنا) نہیں ہوتا، کیونکہ وہ مفرط قرب کی وجہ سے اپنے قلب (قلب) سے اس طرح جڑے ہوئے ہیں جیسے اس کا اپنا نفس، اور یہ قرب اس میں پوشیدہ رہتا ہے۔ پس اگر ایسا ہو کہ وہ اپنی بیوی کو طلاق دے دے، اور اس کی محبت اس میں پوشیدہ تھی جو مفرط قرب کی وجہ سے ظاہر نہیں ہوتی تھی، تو دوری کی وجہ سے اسے اس کا شوق (شوق) پکڑ لیتا ہے اور وہ اس میں سرگرداں (ہیجان) ہو جاتا ہے اور اس کی طرف کھنچتا ہے، کیونکہ وہ اس مفرط قرب سے دور ہو گئی ہے، جس سے اس کا شوق اور وجد (وجد) وابستہ ہو جاتا ہے۔\n\nاور اسی وجہ سے عاشق اپنے اجنبی معشوق میں فنا (فنا) ہو جاتا ہے، کیونکہ اسے وہ ظاہری قرب حاصل نہیں ہوتا جو اس کے اور اشتیاق کے درمیان حائل ہو۔ اور عارفین (عارفین) کے قلوب (قلوب) سے ذات حق (الحق) کے قرب کی وجہ سے، اس محقق ذوقی علم کے ذریعے جو انہوں نے پایا، وہ صحو (صحو) میں رہے اور اس میں محبوں کی طرح سرگرداں (ہیجان) نہیں ہوئے، کیونکہ ذات حق (الحق) نے ان پر جمال مطلق (جمال مطلق) میں ظہور الٰہی (التجلی) فرمایا، اور اس کا ظہور الٰہی (التجلی) علماء پر کمال مطلق (کمال مطلق) میں ہوتا ہے۔ اور کمال (کمال) جمال (جمال) سے کہاں ہے؟ کیونکہ کامل کے حق میں اسماء (اسماء) ایک دوسرے کو روکتے ہیں، اور یہ روکنا اس شخص میں ان کے اثر انداز نہ ہونے کا سبب بنتا ہے جس کی یہ صفت ہو۔ پس وہ مطلق ذات (الذات المطلقة) کے ساتھ تاثیر سے منزہ رہتا ہے، جسے اسماء (اسماء) اور نعوت (صفات) مقید نہیں کرتیں۔ پس کامل (الإنسان الکامل) رسولوں کی طرح صحو (صحو) کی انتہا پر ہوتا ہے، اور وہ تمام گروہوں میں سب سے کامل ہیں، کیونکہ کامل قرب کی انتہا پر ہوتا ہے، اور اس میں اپنی عبودیت (العبودیۃ) کے کمال میں ظاہر ہوتا ہے، جو موجد ذات کے کمال کا مشاہدہ کر رہا ہوتا ہے۔ اور جب تم نے ہماری کہی ہوئی بات کی تحقیق کر لی، تو تم جان لو گے کہ تمہارا ذوق ان کامل (کامل) مردوں کے ذوق سے کہاں ہے جنہیں اللہ نے اس میں چن لیا اور ان میں سے منتخب کیا اور انہیں اس سے منزہ رکھا۔ پس وہ اور ذات حق (الحق) ایسے ہیں جیسے وہ اور وہ۔ پس کامل (الکامل) نے ان میں سے اسے عصر (العصر) کا نام دیا، کیونکہ یہ ایک شے کو دوسری شے کے ساتھ ملانا ہے تاکہ مطلوب کو نکالا جا سکے۔ پس ایک مطلق عبد (عبد) کی ذات کو، جس کی عبودیت (العبودیۃ) میں کسی بھی پہلو سے ربوبیت (الربوبیۃ) کی آمیزش نہ ہو، ایک مطلق ذات حق (الحق) کے ساتھ ملا دیا گیا، جس میں کسی بھی پہلو سے عبودیت (العبودیۃ) کی آمیزش نہ ہو، ایک الٰہی اسم (اسم إلهي) سے کون (وجود) کے طلب کے ذریعے ملا دیا گیا۔ پس جب دونوں ذاتیں اس طرح کے مقابلے کے ساتھ آمنے سامنے ہوئیں، تو نچوڑ (المعتصر) ذات حق (الحق) اور عبد (عبد) کے لیے عین کمال (عین الکمال) تھا، اور یہی وہ مطلوب تھا جس کے لیے عصر (العصر) کا وجود ہوا۔ اگر تم نے اس بات کو سمجھ لیا جس کی طرف ہم نے اشارہ کیا ہے، تو تم کامیاب ہو گئے، اور میں نے تمہیں کمال (کمال) کی سیڑھی پر ڈال دیا ہے، پس اس میں ترقی کرو۔ اور اسی معنی کی طرف ہمارے اشعار میں باب کے شروع میں اشارہ ہے:\n\n> نماز عصر کی کوئی نظیر نہیں،\n> اس میں حبیب کے ساتھ اجتماع کو ضم (ضم) کرنے کی وجہ سے۔\n\nاور کمال (کمال) کے مرتبے کو تمہارے لیے واضح کرنے کے بعد، اب ہم تمہیں اس مقام سے ایک کو جماعت کے مقام پر قائم کرنے کا بیان کرتے ہیں، اور وہ عین الإنسان الکامل (الإنسان الکامل) ہے۔ کیونکہ وہ مجموعی عالم سے زیادہ کامل ہے، اس لیے کہ وہ عالم کی حرف بہ حرف نقل ہے، اور اس میں یہ اضافہ ہے کہ وہ ایک ایسی حقیقت پر ہے جو تضاؤل (کم ہونے) کو قبول نہیں کرتی، جبکہ بلند ترین ملکی روحوں میں سے اسرافیل (إسرافيل) نے اسے قبول کیا، کیونکہ وہ ہر روز ستر بار کم ہوتے ہیں، یہاں تک کہ وہ ایک وضع (شکل) کی طرح ہو جاتے ہیں یا جیسا کہ انہوں نے فرمایا۔ اور تضاؤل (تضاؤل) صرف اس بلندی کے بعد ہوتا ہے جو پہلے حاصل ہو چکی ہو، اور عبد کلی (العبد الکلی) کے لیے اس کی عبودیت (العبودیۃ) میں کوئی بلندی نہیں، کیونکہ وہ اوصاف سے مسلوب ہے۔ پس اگر اس کم ہونے والی روح (اسرافیل) نے اس عبد کلی (العبد الکلی) کی عبودیت (العبودیۃ) کی حالت کو پیدا کیا ہوتا، تو اس پر تضاؤل (تضاؤل) کا تکرار نہ ہوتا۔ پس اس بات کو سمجھو جس کی طرف میں نے تمہارے لیے اشارہ کیا ہے۔ اور میں نے تمہیں اس خبر سے آگاہ کر دیا ہے کہ یہ فرشتہ اللہ کے بارے میں سب سے زیادہ علم رکھنے والی مخلوق میں سے ہے۔ اور اس کے تضاؤل (تضاؤل) کا تکرار ظہور الٰہی (التجلی) کے تکرار کی وجہ سے ہے، اور ذات حق (الحق) ایک صورت میں دو بار ظہور الٰہی (التجلی) نہیں فرماتی۔ پس وہ ہر ظہور الٰہی (التجلی) میں وہ دیکھتا ہے جو اسے اس تضاؤل (تضاؤل) کی طرف لے جاتا ہے۔ یہ وہ صحیح علم ہے جو اللہ کی معرفت (معرفت) عطا کرتی ہے۔\n\nپھر تمہیں معلوم ہونا چاہیے کہ اللہ نے الْإِنْسانَ کو أَحْسَنِ تَقْوِيمٍ (احسن تقویم) میں پیدا کیا، اس صورت کی وجہ سے جو اس کے لیے خاص کی گئی، اور یہی وہ ہے جس نے اسے یہ منزلت عطا کی۔ پس اس کے حق میں أَحْسَنِ تَقْوِيمٍ (احسن تقویم) کسی \"افعل من کذا\" (فلاں سے زیادہ) کے مقابلے میں نہیں ہے، بلکہ یہ اس کے قول \"اللہ اکبر\" کی طرح ہے، جو کسی مقابلے میں نہیں ہے۔ بلکہ کامل عبد (عبد کامل) کے لیے حسن مطلق (الحسن المطلق) ایسا ہی ہے جیسے ذات حق (الحق) کے لیے کبریاء مطلق (الکبریاء المطلق)۔ پس وہ أَحْسَنِ تَقْوِيمٍ (احسن تقویم) ہے، نہ کہ فلاں سے، جیسا کہ ذات حق (الحق) اکبر ہے، نہ کہ فلاں سے۔ اس کے سوا کوئی معبود نہیں، اور عبودیت (العبودیۃ) میں پختہ ہونے والے کے سوا کوئی عبد (عبد) نہیں۔ پس اگر عبد (عبد) اس مرتبے سے کسی ربانی وصف کی وجہ سے ہٹ جائے، اگرچہ وہ رحمانی صفت اور اس جیسی صفات میں محمود ہو، تو وہ اس مرتبے سے ہٹ گیا جس کے لیے اسے پیدا کیا گیا تھا، اور کمال (کمال) سے محروم ہو گیا۔ اور اللہ کی معرفت (معرفت) اس قدر ہوتی ہے جس قدر وہ ذات حق (الحق) کی صفات سے متصف ہو، خواہ وہ کم ہو یا زیادہ۔\n\n### [کہ انسان کے لیے دو حالتیں ہیں: ایک عقلی، نفسیاتی حالت جو مادہ سے مجرد ہے، اور ایک عقلی، نفسیاتی حالت جو مادہ کی تدبیر کرتی ہے]\n\nاور جان لو کہ انسان کے لیے دو حالتیں ہیں: ایک عقلی، نفسیاتی حالت جو مادہ سے مجرد ہے، اور ایک عقلی، نفسیاتی حالت جو مادہ کی تدبیر کرتی ہے۔ پس جب وہ اپنے نفس سے تجرید (مجرد ہونے) کی حالت میں ہو، اگرچہ حسی طور پر اس سے متلبس ہو، تو وہ اپنی حالت أَحْسَنِ تَقْوِيمٍ (احسن تقویم) پر ہے۔ اور جب وہ اپنے نفس میں مادہ کا لباس پہنے ہوئے ہو، جیسا کہ وہ اپنے حس میں ہے، تو وہ اپنی حالت خسر (خسارے) میں ہے، اس کی تجارت میں کوئی نفع نہیں: فَما رَبِحَتْ تِجارَتُهُمْ وَما كانُوا مُهْتَدِينَ (اور ان کی تجارت نے کوئی نفع نہ دیا اور وہ ہدایت پانے والے نہ تھے)۔ اور یہی اس کا قول ہے: إِنَّ الْإِنْسانَ لَكَفُورٌ (بے شک انسان بڑا ناشکرا ہے)، إِنَّ الْإِنْسانَ لَظَلُومٌ كَفَّارٌ (بے شک انسان بڑا ظالم، بڑا ناشکرا ہے)، إِنَّ الْإِنْسانَ لِرَبِّهِ لَكَنُودٌ (بے شک انسان اپنے رب کا بڑا ناشکرا ہے)، إِنَّ الْإِنْسانَ لَفِي خُسْرٍ (بے شک انسان خسارے میں ہے)، إِنَّهُ كانَ ظَلُوماً جَهُولًا (بے شک وہ بڑا ظالم، بڑا جاہل تھا)۔ پس جب الإنسان الکامل (الإنسان الکامل) \"اللہ\" کہتا ہے، تو اس کے نطق سے تمام عالم نطق کرتا ہے، ہر وہ چیز جو اللہ کے سوا ہے، اور اس کے نطق سے اللہ کے تمام اسماء (اسماء) نطق کرتے ہیں، جو اس کے غیب کے علم میں مخزون ہیں، اور وہ مستاثر (خاص) اسماء جن کی معرفت (معرفت) اللہ اپنے بعض بندوں کے لیے خاص کرتا ہے، اور وہ اسماء جو تمام بندوں میں اپنی ذات کے ساتھ معلوم ہیں۔ پس اس کی تسبیح ان تمام چیزوں کی تسبیح کے مقام پر قائم ہو جاتی ہے جن کا میں نے ذکر کیا۔ پس اس کا اجر غَيْرُ مَمْنُونٍ (بے انتہا) ہے۔ اور ہم اس کی تحقیق کی طرف باب نمبر دو سو نواسی میں اشارہ کریں گے۔\n\nاور توحید (توحید) کے ایک کے ذریعے قائم ہونے کی معرفت (معرفت) پر تمہیں متنبہ کرنے کے بعد، جو خیر اور شر میں جماعت کے مقام پر قائم ہے، کیونکہ اللہ تعالیٰ نے اس مقام پر خیر اور شر میں فرمایا: مَنْ قَتَلَ نَفْساً بِغَيْرِ نَفْسٍ أَوْ فَسادٍ فِي الْأَرْضِ فَكَأَنَّما قَتَلَ النَّاسَ جَمِيعاً وَمَنْ أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً (جس نے کسی جان کو بغیر جان کے بدلے یا زمین میں فساد پھیلانے کے قتل کیا، تو گویا اس نے تمام انسانوں کو قتل کر دیا، اور جس نے اسے زندہ کیا، تو گویا اس نے تمام انسانوں کو زندہ کیا)۔ اور اس بیان میں ہمارا مقام ہمارے اہل طریق کے لیے ہے، اور قبول کرنے والوں اور نہ قبول کرنے والوں کا مقام وہ ہے جو اللہ نے اس آیت کے بعد احوال کی تعریف میں فرمایا: وَلَقَدْ جاءَتْهُمْ رُسُلُنا بِالْبَيِّناتِ ثُمَّ إِنَّ كَثِيراً مِنْهُمْ بَعْدَ ذلِكَ فِي الْأَرْضِ لَمُسْرِفُونَ (اور بے شک ان کے پاس ہمارے رسول واضح دلائل لے کر آئے، پھر اس کے بعد بھی ان میں سے بہت سے لوگ زمین میں حد سے تجاوز کرنے والے ہیں)۔ پس ہم گناہ گاروں کے ایمان کا بیان کریں گے جسے توبہ سے تعبیر کیا جاتا ہے اور جو اس کے لیے لازم ہے۔ اور وہ یہ ہے کہ ایمان اصلی (الإيمان الأصلي) وہ فطرت (الفطرة) ہے جس پر اللہ نے لوگوں کو پیدا کیا، اور وہ میثاق (الميثاق) لینے کے وقت اس کی وحدانیت کی گواہی دینا ہے۔ پس ہر پیدا ہونے والا بچہ اسی میثاق (الميثاق) پر پیدا ہوتا ہے، لیکن جب وہ اس جسم کے ساتھ طبیعت کے حصار میں آ جاتا ہے جو نسیان کا محل ہے، تو وہ اس حالت کو بھول جاتا ہے جس پر وہ اپنے رب کے ساتھ تھا اور اسے بھلا دیتا ہے۔ پس جب وہ اس حالت کو پہنچتا ہے جو نظر (غور و فکر) عطا کرتی ہے، تو اسے اپنے خالق کی وحدانیت پر دلائل میں غور کرنے کی ضرورت پڑتی ہے۔ اور اگر وہ اس حد تک نہ پہنچے، تو اس کا حکم اس کے والدین کا حکم ہے۔ اگر وہ دونوں مؤمن ہوں، تو وہ ان سے اللہ کی توحید (توحید) کو تقلیداً اختیار کرتا ہے۔ اور اگر وہ کسی بھی دین پر ہوں، تو وہ ان کے ساتھ ملحق ہو جاتا ہے۔ پس جس کا ایمان تقلیدی ہو، وہ اپنے ایمان میں زیادہ محفوظ اور پختہ ہوتا ہے اس شخص سے جو اسے دلائل سے حاصل کرتا ہے، کیونکہ اگر وہ ہوشیار، ذہین اور قوی الفہم ہو، تو دلائل میں جو حیرت اور خلل پیدا ہوتا ہے اور ان پر جو شبہات وارد ہوتے ہیں، ان کی وجہ سے اس کا قدم اور ساق قائم نہیں رہ پاتا جس پر وہ بھروسہ کر سکے، پس اس پر خوف ہوتا ہے۔ پس اگر اس کے توحید (توحید) کے ایمان سے پہلے شرک (الشرك) ہو، جو اسے اپنے والدین سے، یا اپنی نظر سے، یا اس امت سے وراثت میں ملا ہو جس میں وہ ہے، تو وہ ایمان عین اس کا میثاقی ایمان (الإيمان الميثاقي) ہی ہے، کوئی اور نہیں۔ بلکہ اس کے اور عبد (عبد) کے درمیان شرک (الشرك) کا حجاب حائل ہو گیا، جیسے بادل جو آنکھ اور سورج کے درمیان حائل ہو جاتا ہے۔ پس جب وہ ہٹ جاتا ہے، تو سورج آنکھ کے لیے ظاہر ہو جاتا ہے۔ اسی طرح شرک (الشرك) کے ہٹ جانے پر عبد (عبد) کے لیے ایمان کا ظہور ہوتا ہے، کیونکہ مشرک ذات حق (الحق) کے وجود کا اقرار کرنے والا ہوتا ہے۔ اگر تم کہو کہ معطل (منکر وجود) کا کیا حکم ہے؟ کیا اس کا ایمان وقت پر پایا جائے گا یا اس کی حالت مشرک کی حالت جیسی ہے؟ ہم کہتے ہیں کہ معطل (المعطل) مشرک سے زیادہ ایمان کے قریب ہے، کیونکہ ہر انسان کو لازماً اپنے آپ کو اپنے وجود میں کسی ایسی چیز پر مستند پانا ہوتا ہے جس کے بارے میں وہ نہیں جانتا کہ وہ کیا ہے، تو اسے کہا جاتا ہے کہ وہ اللہ ہے۔ پھر اگر اسے یہ شک ہو کہ کیا وہ ایک ہے یا ایک سے زیادہ، تو وہ اس میں غور و فکر کے مقام پر ہوتا ہے، یا وہ کسی موحد کی تقلید کرتا ہے جس پر وہ اعتقاد رکھتا ہے۔ پس وہاں کوئی نیا ایمان نہیں ہے، بلکہ وہ ہر مؤمن کے قلب (قلب) میں لکھا ہوا ہے۔ پس اگر مرید کے حق میں شقاوت (بدبختی) زائل ہو جائے، تو صرف معبود کی وحدانیت زائل ہوتی ہے، نہ کہ اس کا وجود۔ اور توحید (التوحید) کے ساتھ سعادت (خوش بختی) وابستہ ہے، اور اس کی نفی کے ساتھ ابدی شقاوت (بدبختی) وابستہ ہے۔ اور اسی کی طرف اللہ تعالیٰ کے اس قول میں اشارہ ہے: يَا أَيُّهَا الَّذِينَ آمَنُوا (اے وہ لوگو جو ایمان لائے ہو) میثاق (الميثاق) لینے کے وقت، آمَنُوا (ایمان لاؤ) اس قول کے لیے جو ہماری طرف سے تمہارے پاس رسول لایا ہے۔ پس اگر ایمان ان کے پاس نہ ہوتا، تو انہیں اس سے متصف نہ کیا جاتا۔\n\nاور جہاں تک اعمال کی نسبت اس مقام سے ہے، تو وہ اس طرح ہے جس طرح ہم اسے مقرر کرتے ہیں:\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: \"میں مکارم الأخلاق (مکارم الاخلاق) کی تکمیل کے لیے بھیجا گیا ہوں۔\"\n\nاور مکارم الأخلاق (مکارم الاخلاق) اضافی اعمال اور احوال ہیں، کیونکہ لوگ جو مکارم الأخلاق (مکارم الاخلاق) کا محل ہیں، دو حالتوں پر ہیں: آزاد (حر) اور عبد (عبد)۔ جیسا کہ اخلاق بھی دو طرح کے ہیں: محمود (قابل تعریف)، جنہیں مکارم الأخلاق (مکارم الاخلاق) کہا جاتا ہے، اور مذموم (قابل مذمت)، جنہیں سفساف الأخلاق (سفساف الاخلاق) کہا جاتا ہے۔ اور جن کے ساتھ مکارم الأخلاق (مکارم الاخلاق) اور سفساف الأخلاق (سفساف الاخلاق) کا تصرف ہوتا ہے، وہ دو اور ایک ہیں۔ پس ایک تو اللہ ہے، اور دو تمہارا نفس ہے جب تم اسے اپنے سے اجنبی کے مقام پر رکھو، اور تمہارے علاوہ ہر دوسرا، جو اللہ کے سوا ہر چیز ہے۔ اور اللہ کے سوا ہر چیز دو قسموں پر ہے، اور تم ان میں شامل ہو: عنصری اور غیر عنصری۔ پس عنصری کے ساتھ خلق کا تصرف حسی ہوتا ہے، اور غیر عنصری کے ساتھ خلق کا تصرف معنوی ہوتا ہے۔ پس وہ اعمال جنہیں اخلاق سے تعبیر کیا جاتا ہے، دو قسموں پر ہیں: صالح (نیک)، جو اس کے مکارم ہیں، اور غیر صالح (نیک نہیں)، جو اس کے سفساف ہیں۔ اللہ تعالیٰ نے ایک قسم کے بارے میں فرمایا: وَعَمِلَ صالِحاً (اور نیک عمل کیا)، اور دوسری قسم کے بارے میں فرمایا: عَمَلٌ غَيْرُ صالِحٍ فَلا تَسْئَلْنِ ما لَيْسَ لَكَ بِهِ عِلْمٌ إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجاهِلِينَ (یہ عمل نیک نہیں ہے، پس مجھ سے وہ چیز نہ پوچھ جس کا تجھے علم نہیں، میں تجھے نصیحت کرتا ہوں کہ تو جاہلوں میں سے نہ ہو جائے)۔ پس اس نے اسے ادب سکھایا، اور ادب یہ ہے کہ ایسے علم کے بارے میں سوال نہ کیا جائے جو معلوم نہ ہو۔ پس جب اسے علم ہو جائے، تو اگر وہ شفاعت اور سوال کے اہل میں سے ہو، تو اس میں سوال کرے، اور اگر نہ ہو، تو سوال نہ کرے۔ لیکن اس پر ابوت کی رحمت غالب آ گئی، جو ایک طبعی، عنصری شفقت ہے، پس اس نے اسے اس کے غیر محل میں صرف کیا، تو اللہ نے اسے آگاہ کیا کہ یہ جاہلوں کی صفات میں سے ہے۔ اور جہل کے ساتھ خیر نہیں ہوتی، جیسا کہ علم کے ساتھ شر نہیں ہوتا۔\n\nپس نبی صلی اللہ علیہ وسلم کا یہ قول کہ \"میں مکارم الأخلاق (مکارم الاخلاق) کی تکمیل کے لیے بھیجا گیا ہوں\" کا مطلب یہ ہے کہ وہ جانتے ہیں کہ وہ کیا ہیں، اور انہیں کیسے اور کہاں صرف کرنا ہے۔ پس تمہیں معلوم ہونا چاہیے کہ جنہیں اس کا مخاطب بنایا گیا ہے، جیسا کہ ہم نے تمہیں بتایا، وہ آزاد (حر) اور عبد (عبد) ہیں۔ پس عبد (عبد) کے لیے اس میں سے ایک حصہ ہے، اور آزاد (حر) کے لیے اس میں سے ایک حصہ ہے۔ پس جب تم خلق کو اللہ کی طرف منسوب کرتے ہو، تو اللہ کے سوا ہر چیز اللہ کی عبد (عبد) ہے۔ اللہ تعالیٰ نے فرمایا: إِنْ كُلُّ مَنْ فِي السَّماواتِ وَالْأَرْضِ إِلَّا آتِي الرَّحْمَنِ عَبْداً (آسمانوں اور زمین میں کوئی نہیں مگر وہ رحمن کے پاس عبد (عبد) بن کر آنے والا ہے)۔ اور جب تم خلق کو ایک دوسرے کی طرف منسوب کرتے ہو، تو وہ آزاد (حر) اور عبد (عبد) کے درمیان ہے۔\n\nجہاں تک عبد (عبد) کا اخلاق میں حصہ ہے، تو جان لو کہ مطلق سید (آقا) نے واجب کیا اور حرام کیا، پس حکم دیا اور منع کیا، اور اس نے مباح کیا، پس اختیار دیا، اور اس نے ترجیح دی، پس مستحب کیا اور مکروہ کیا۔ اور چھٹی کوئی قسم نہیں ہے۔ پس ہر وہ عمل جس سے وجوب (الوجوب) متعلق ہو، جو سید (آقا) یعنی اللہ کی طرف سے کسی عمل کا حکم ہو، یا کسی عمل کی طرف ندب (استحباب) ہو، تو اس پر عمل کرنا اللہ کے ساتھ اور تمہارے نفس کے ساتھ مکارم الأخلاق (مکارم الاخلاق) میں سے ہے اگر وہ واجب ہو۔ اور اگر وہ مندوب (مستحب) ہو، تو وہ تمہارے نفس کے ساتھ مکارم الأخلاق (مکارم الاخلاق) میں سے ہے۔ اور اگر وہ عمل کسی دوسرے کے فائدے کو شامل ہو، تو وہ تمہارے غیر کے ساتھ بھی مکارم الأخلاق (مکارم الاخلاق) میں سے ہے۔ اور اس حکم پر اس عمل کو ترک کرنا سفساف الأخلاق (سفساف الاخلاق) میں سے ہے۔\n\nاور ہر وہ عمل جس سے تحریم (التحريم) یا کراہت متعلق ہو، تو اس میں تقسیم اسی طرح ہے جیسے واجب اور مندوب میں اسی حد پر تقسیم ہے۔ پس تحریم (التحريم) یا کراہت سے متصف ہونے کی وجہ سے اس عمل کو ترک کرنا مکارم الأخلاق (مکارم الاخلاق) میں سے ہے، اور اسے کرنا سفساف الأخلاق (سفساف الاخلاق) میں سے ہے۔ اور اس میں عمل کو ترک کرنا روحانی عمل ہے، جسمانی نہیں، کیونکہ یہ ترک ہے جس کا عین میں کوئی وجود نہیں ہے۔\n\nاور وہ عمل جس سے تخییر (اختیار) متعلق ہو، جو کہ مباح (المباح) ہے، تو اس کا کرنا تمہارے نفس کے ساتھ دنیا میں مکارم الأخلاق (مکارم الاخلاق) میں سے ہے، آخرت میں نہیں۔ پس اگر عمل کے ساتھ یہ بات شامل ہو کہ تم نے اسے اس لیے کیا کہ وہ مباح (المباح) اور مشروع ہے، تو وہ اللہ کے ساتھ اور تمہارے نفس کے ساتھ دنیا اور آخرت میں مکارم الأخلاق (مکارم الاخلاق) میں سے ہے۔ اور مباح (المباح) کو ترک کرنے کا حکم بھی اسی تقسیم پر ہے۔\n\nپس تمام اقسام عبد (عبد) سے متعلق ہیں، اور مباح (المباح) کی قسم آزاد (حر) سے متعلق ہے، اور مکروہ اور مندوب (مستحب) کی قسم آزاد (حر) سے متعلق ہے، اور اس میں عبودیت (العبودیۃ) کی خوشبو کی ایک جھلک ہے، حقیقت نہیں۔ پس اس مقام نے تمہارے لیے شقاوت (بدبختی) اور سعادت (خوش بختی) کے مقامات کو محدود کر دیا ہے، اور انہیں تمہارے لیے متعین کر دیا ہے، یعنی تمہیں یہ متعین کر دیا ہے کہ تم انہیں کہاں سے جانو گے، اور وہ اس شریعت کی معرفت (معرفت) ہے جس پر تم ہو۔ اگر انسان ان لوگوں میں سے ہو جنہیں دعوت نہیں پہنچی، تو اس کے حق میں مکارم الأخلاق (مکارم الاخلاق) وہ ہیں جنہیں عقل نے مقرر کیا ہے، جیسے غرض اور کمال کا وجود، اور مزاج کی موافقت، جیسے منعم (نعمت دینے والے) کا شکر، جو عقلاً اور شرعاً مکارم الأخلاق (مکارم الاخلاق) میں سے ہے، اور نعمت کی ناشکری سفساف الأخلاق (سفساف الاخلاق) میں سے ہے، عقلاً اور شرعاً۔ اور اللہ نے کسی نَفْساً پر إِلَّا وُسْعَها (اس کی طاقت سے زیادہ) بوجھ نہیں ڈالا، خواہ اسے دعوت پہنچی ہو یا نہ پہنچی ہو۔ پس اس کے عمل میں شرع کا ایک حکم نفس الامر میں ہے، اور اس سے اس سفساف الأخلاق (سفساف الاخلاق) میں معافی دی جاتی ہے جو اس نے کیا، جہاں اسے دعوت نہیں پہنچی۔ اور اس کی معافی الٰہی مکارم الأخلاق (مکارم الاخلاق) میں سے ہے۔ پس ذات حق (الحق) عبد (عبد) سے زیادہ کرم کی صفات کی حقدار ہے، بلکہ وہ حقیقت میں اس کے لیے ہیں، اور عبد (عبد) میں توفیق (التوفیق) کی عنایت سے ہیں۔\n\nاور اس مقام سے متعلق مکارم (مکارم) میں سے منعم (نعمت دینے والے) کے شکر پر تعاون کرنا، اور مصیبت (البلاء) نازل کرنے والے کی طرف سے مصیبت (البلاء) کو قبول کرنے پر تعاون کرنا ہے، اس طرح کہ اس کے دور ہونے کے لیے صرف اسی پر بھروسہ کیا جائے جس نے اسے نازل کیا ہے، اور وہ اللہ تعالیٰ ہے۔ پس اگر اس نے اسے غیر پر نازل کیا، تو وہ سفساف الأخلاق (سفساف الاخلاق) میں سے ہے، اور اگر اس نے اسے اللہ پر نازل کیا، تو وہ مکارم الأخلاق (مکارم الاخلاق) میں سے ہے۔ اور عبد (عبد) دونوں حالتوں میں اپنے سے مصیبت (البلاء) کے دور ہونے کا طالب ہوتا ہے۔ اور مصیبت (البلاء) سے مراد اس کا وجود اور درد کا احساس ہے، بس۔\n\nاور اس مقام پر اہل طریق میں سے بہت سے لوگ غلطی کرتے ہیں، اور وہ اپنے نفوس کو اس مصیبت (البلاء) کے بارے میں اللہ سے شکایت کرنے سے روکتے ہیں جو ان پر نازل ہوئی ہے۔ اور اس میں ان کی شبہہ یہ ہے کہ وہ کہتے ہیں کہ ہم اس پر اعتراض نہیں کرتے جو وہ ہم پر جاری کرتا ہے، کیونکہ وہ رضا (الرضاء) کی حالت میں اثر انداز ہوتا ہے۔ تو انہیں کہا جاتا ہے کہ رضا (الرضاء) کا مقام صرف اس کے احساس اور اس کے دور کرنے کی طلب نہ کرنے سے حاصل ہو گیا، اور یہی رضا (الرضاء) کی حد ہے، نہ کہ اس کا ہمیشہ ساتھ رہنا۔ کیونکہ نفس طبعاً درد کے وجود کو ناپسند کرتا ہے، اور اسی لیے ہم نے مصیبت (البلاء) کو درد سے تعبیر کیا ہے نہ کہ اس کے سبب سے۔ اور عبد (عبد) کو چاہیے کہ وہ اللہ تعالیٰ سے سوال کرے کہ وہ اس سے اس مصیبت (البلاء) کو دور کر دے جو اس پر نازل ہوئی ہے، کیونکہ یہ اسے اللہ کے فعل کو ناپسند کرنے کی طرف لے جاتا ہے، اور طبعاً اس کا ناپسند کرنا ضروری ہے، کیونکہ درد اپنے لیے حکم کو واجب کرتا ہے، اور اس کے نازل کرنے میں فعل تو اللہ کا ہے، پس درد کو ناپسند کرنا طبعاً اس کی ناپسندیدگی کو شامل کرتا ہے، کیونکہ درد اپنے وجود کو واجب کرتا ہے، اور درد کا وجود اس کے نفس کے لیے نہیں تھا، بلکہ اللہ نے اسے اس عبد (عبد) میں پیدا کیا، پس کراہت (ناپسندیدگی) حالاً اور ضمناً جناب عزیز سے متعلق ہو جاتی ہے۔ اسی لیے اکابر سے یہ قول واقع ہوا: رَبِّ أَنِّي مَسَّنِيَ الضُّرُّ (اے میرے رب، مجھے تکلیف پہنچی ہے)۔ اور آئندہ میں جو واقع نہ ہو، اس کے بارے میں سوال کرنے کی تعلیم اس قول سے ہے: قَالُوا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ (انہوں نے کہا: اور ہم پر وہ بوجھ نہ ڈال جس کی ہم میں طاقت نہیں)۔\n\nاور اس سے سوء ادب (بد اخلاقی) متعلق ہے الٰہی قہر کا مقابلہ کرنا، اور عبد (عبد) کا سید (آقا) کا کسی امر میں مقابلہ کرنا سفساف الأخلاق (سفساف الاخلاق) میں سے ہے، کیونکہ یہ عبودیت (العبودیۃ) کی صفات میں سے نہیں ہے۔ پس عبد (عبد) جب کمزور ہو، تو اس میں اپنے مؤمن بھائی سے مدد مانگے۔ اور دوسرے پر واجب ہے کہ وہ اسے تعلیم اور تعزیت کے ذریعے مدد دے، کیونکہ مؤمن اپنے بھائی کے ساتھ کثیر ہوتا ہے۔ اور جب انسان اپنے غم میں تنہا ہوتا ہے، تو وہ اس پر بڑا ہو جاتا ہے، اور جب وہ کسی ایسے شخص کو پاتا ہے جس کے سامنے وہ اسے ڈال دے تاکہ وہ اس میں شریک ہو اور اس پر آرام کرے اور وہ ہلکا ہو جائے، تو دوسرے نے اس کی مدد کی کہ وہ اس کے غم کو سننے میں اچھی طرح توجہ دے، اور اسے اس بارے میں ایسی بات کا جواب دے جو اسے خوش کرے، اور اس کے دکھ پر اظہارِ تکلیف کے ذریعے اس میں شریک ہو، تو وہ سچا مددگار دوست (صدیق صادق) ہے۔ جیسا کہ کہا گیا ہے:\n\n> میرا دوست وہ ہے جو میرے غموں میں میرا شریک ہو،\n> اور جو مجھ پر عداوت کرے، اس پر عداوت کرے۔\n\nاور دوسرے نے کہا:\n\n> جب بھاری بوجھ کو\n> مخلوق کی گردنیں تقسیم کر لیتی ہیں، تو وہ گردنوں پر ہلکا ہو جاتا ہے۔\n\nپس ہم نے تمہیں اس مقام کے کچھ حصوں کو اجمالاً بیان کر دیا ہے، تفصیل سے نہیں، طوالت کے خوف سے۔ پس ہم نے اس میں سے کچھ نہیں چھوڑا اور نہ ہی تمہیں اس میں سے کسی چیز کی خبر دی ہے۔ اور ہم نے ہر مقام میں ایسا ہی کیا ہے، ان شاء اللہ تعالیٰ۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب دویست و هشتاد و یکم در معرفت منزل (الضم) و قرار گرفتن واحد به جای جماعت از حضرت محمدیه (الحضرة المحمدية)»\n\nنماز عصر را نظیری نیست *** زیرا جمع شدن (نظم الشمل) در آن با حبیب است.\nآن نماز وسطی (الوسطى) است برای امری که در آن دور (دایره) است *** و بر امری شگفت‌انگیز حاصل شده است.\nو در علم خردمند، دور (دایره) نه وسطی دارد و نه دو طرفی.\nپس چگونه است امر در آن؟ جانم فدایت باد *** پس این بنده را به علم غریب اختصاص ده.\n\n### [قلب بنده در جایی است که مال اوست]\n\nپروردگار این منزل می‌گوید که پاداش نماز وسطی (الصلاة الوسطى)، اگر به جماعت خوانده نشود، با پاداش کسی که اهل و مالش از او گرفته شده، برابر است. و عیسی عدل (علیه السلام) فرمود: «قلب هر انسانی در جایی است که مال اوست، پس اموال خود را در آسمان قرار دهید تا قلب‌هایتان در آسمان باشد.»\n\nیعنی صدقه دهید. و معرفت این عدل (عیسی) تا اینجا پایان یافت. و صادق (الصادق)، آورنده جوامع الکلم (جوامع الكلم)، رسول خدا محمد (صلی الله علیه وسلم) فرمود: «صدقه در دست رحمان (الرحمن) قرار می‌گیرد و او آن را پرورش می‌دهد.» پس قلب بنده در جایی است که مال اوست، و آن «جاییّت» دست رحمان است. و دست رحمان کجا و آسمان کجا؟ پس هر دو عدل (عیسی و محمد) بر این اجماع کردند که مال از جایگاه والایی در قلب برخوردار است. اما اهل، یعنی همسر و فرزند، بر هیچ خردمندی پوشیده نیست که به فؤاد (قلب) گره خورده‌اند. اما همسر، خداوند میان او و شوهرش مودت و رحمت و سکون (آرامش) قرار داده است. و سکون صفتی است که بزرگان طالب آنند، و آن همان طمأنینه است. ابراهیم گفت: بَلى‏ ولكِنْ لِيَطْمَئِنَّ قَلْبِي (آری، ولی برای اینکه قلبم آرام گیرد)؛ یعنی به آن وجهی که مردگان را با آن زنده می‌کنی، آرام گیرد و برایم مشخص شود، زیرا وجوه برای آن بسیار است. پس به آن آرام گرفت، آرامشی که هیچ حیرت و تشویشی در آن راه ندارد؛ یعنی در معرفت چگونگی (کیفیت).\n\nپس بنگر که پیامبر (صلی الله علیه وسلم) کسی را که نماز عصر از او فوت شده، به چه چیزی قرین ساخته است. و سبب آن این است که اوایل اوقات چهار نماز دیگر محدود است، مگر عصر که محدود نیست، هرچند که از روی غیرتحقیق به حد نزدیک شده باشد. پس به دلیل تنزیه (تنزیه) از مقید شدن به حدود، به آن نزدیک شد؛ زیرا مغرب محدود به غروب خورشید است که محقق و محسوس است، و اول عشاء محدود به غایب شدن شفق است که محقق و محسوس است (هر شفق که باشد، بر اساس اختلاف معلوم در آن)، و اول فجر محدود به سفیدی عرضی در افق است که مستطیر (پراکنده) است نه مستطیل (کشیده)، و آن محقق و محسوس است، و ظهر محدود به زوال خورشید و سایه است که محقق و محسوس است. اما چنین حدودی برای عصر نیامده است، پس از حدود محقق تنزیه یافت. از این رو، پیامبر (صلی الله علیه وسلم) وقت آن را زمانی قرار داد که خورشید بلند، سفید و پاک باشد. و حدی که در این باره وارد شده، آن است که در ظهور مانند سایر حدود اوقات نمازها باشد. پس پیامبر (صلی الله علیه وسلم) قدر آن را به دلیل مناسبت در نفی تحقق حدود، بزرگ شمرد. و همچنین است محبت مال و اهل که حدی آن را ضابط نمی‌شود. شاعر در مورد فرزند می‌گوید:\n\nو همانا فرزندان ما در میان ما *** جگرهای ما هستند که بر روی زمین راه می‌روند.\n\nپس فرزند را به منزله نفس (جان) قرار داد. و همان‌طور که انسان در محبت نفس خود به دلیل قرب مفرطی که هرگز مانند آن قرب نبوده، فانی نمی‌شود، همچنین در محبت فرزند، مال و اهل خود فانی نمی‌شود؛ زیرا به منزله نفس او، به دلیل قرب مفرطی که در آن پنهان است، به قلبش گره خورده است.\n\nپس اگر اتفاق افتد که مرد همسرش را طلاق دهد، در حالی که محبت او در وی پنهان بوده و به دلیل افراط در قرب ظاهر نمی‌شده است، دوری از آن قرب مفرط، او را به شوق (الشوق) می‌اندازد و در او سرگردان می‌شود و به او حنین (آرزومندی) پیدا می‌کند، زیرا شوق و وجد (الوجد) به او تعلق می‌گیرد. به همین دلیل است که عاشق در معشوق بیگانه خود فانی می‌شود، زیرا آن قرب ظاهری را ندارد که مانع اشتیاق به او شود. و به دلیل قرب حق (الحق) به قلوب عارفان (العارفين) از طریق علم محقق ذوقی (العلم المحقق الذوقي) که آن را یافته‌اند، اینان به هوشیاری رسیدند و مانند محبان خدا سرگردان نشدند؛ زیرا حق در جمال مطلق بر آنان تجلی کرد، و تجلی او بر عالمان به او در کمال مطلق است. و کمال کجا و جمال کجا؟ زیرا اسماء (الهی) در حق کامل (الكامل) با یکدیگر تمانع (ممانعت) می‌کنند، و این تمانع به عدم تأثیر آن‌ها در کسی که صفتش این است، می‌انجامد. پس او از تأثیر منزه می‌ماند، همراه با ذات مطلقه (الذات المطلقة) که اسماء و نعوت (صفات) آن را مقید نمی‌سازند. بنابراین، انسان کامل (الكامل) در نهایت صحو (هوشیاری) است، مانند رسولان که کامل‌ترین طوایف هستند؛ زیرا کامل در نهایت قرب، در کمال عبودیتش ظاهر می‌شود، در حالی که کمال ذات موجِده (ایجادکننده) را مشاهده می‌کند.\n\nو اگر آنچه گفتیم را محقق ساختی، خواهی دانست که ذوق تو کجا و ذوق مردان کامل (الكمل) که خداوند آنان را در خود برگزیده و از خود انتخاب کرده و از خود منزه ساخته است، کجا است. پس آنان و او، مانند او و آنان هستند. از این رو، کامل از میان آنان، آن را «عصر» نامید؛ زیرا عصر (فشردن/جمع کردن) عبارت است از ضمیمه کردن چیزی به چیزی برای استخراج مطلوبی. پس ذات بنده مطلق (عبد مطلق) در عبودیتش که هیچ وجهی از وجوه ربوبیت (الربوبية) در آن راه ندارد، به ذات حق مطلق (حق مطلق) ضمیمه شد که هیچ وجهی از وجوه عبودیت (العبودية) در آن راه ندارد، از اسم الهی (اسم إلهي) که طالب کَون (هستی) است. فلما تقابلت الذاتان بمثل هذه المقابلة كان المعتصر عين الكمال للحق والعبد وهو كان المطلوب الذي له وجد العصر فإن فهمت ما أشرنا إليه فقد سعدت وألقيتك على مدرجة الكمال فارق فيها ولهذا المعنى الإشارة في نظمنا في أول الباب‏ پس هنگامی که دو ذات با چنین تقابلی روبرو شدند، آن معتَصَر (فشرده شده) عین کمال برای حق و بنده بود، و آن همان مطلوبی بود که عصر برای آن یافت شد. اگر آنچه را بدان اشاره کردیم، فهمیدی، سعادتمند شده‌ای و تو را بر نردبان کمال (الكمال) قرار داده‌ام، پس در آن بالا رو. و به همین معنا در نظم ما در ابتدای باب اشاره شده است:\n\nصلاة العصر ليس لها نظير *** لضم الشمل فيها بالحبيب‏\n(نماز عصر را نظیری نیست *** زیرا جمع شدن (ضم الشمل) در آن با حبیب است.)\n\nو پس از آنکه مرتبه کمال (الكمال) را برایت بیان کردم، اکنون از این منزل، قیام واحد به جای جماعت را برایت بیان می‌کنیم، و آن عین انسان کامل (الإنسان الكامل) است. زیرا او از عین مجموع عالم کامل‌تر است، چرا که او نسخه‌ای از عالم، حرف به حرف است، و افزون بر آن، بر حقیقتی است که تضاؤل (کوچک شدن/فروکش کردن) را نمی‌پذیرد، در حالی که برترین ارواح ملکی، یعنی اسرافیل، آن را پذیرفت. زیرا او هر روز هفتاد بار کوچک می‌شود تا مانند وضع (حالت خاصی) شود یا آن‌گونه که گفته است. و تضاؤل جز از رفعت و بلندی پیشین حاصل نمی‌شود. و برای بنده کلی (العبد الكلي) در عبودیتش رفعتی نیست، زیرا او مسلوب الاوصاف (صفات از او سلب شده) است. پس اگر آن روح متضائل (کوچک شونده) حال این بنده کلی را در عبودیتش نتیجه می‌داد، تضاؤل بر او تکرار نمی‌شد. پس آنچه را به تو اشاره کردم، بفهم. و با این خبر تو را آگاه ساختم که این فرشته از داناترین خلق به خداست، و تکرار تضاؤل او به دلیل تکرار تجلی (التجلي) است. و حق (الحق) دو بار در یک صورت تجلی نمی‌کند، پس در هر تجلی چیزی را می‌بیند که او را به آن تضاؤل می‌کشاند. این همان علم صحیحی است که معرفت الله (معرفة الله) آن را عطا می‌کند.\n\nسپس بدان که خداوند الْإِنْسانَ (انسان) را در أَحْسَنِ تَقْوِيمٍ (بهترین ساختار) آفرید، به خاطر صورتی که او را بدان اختصاص داد، و این همان صورتی است که این منزلت را به او بخشید. پس «أحسن تقویم» در حق او مطلق است، نه از باب مفاضله (برتری دادن) «أفعل من کذا» (برتر از فلان چیز)، بلکه مانند قول «الله اکبر» است که از باب مفاضله نیست. بلکه حُسن مطلق برای بنده کامل (العبد الكامل) مانند کبریاء مطلق است که برای حق (الحق) است. پس او «أحسن تقویم» است نه از فلان چیز، همان‌طور که حق «اکبر» است نه از فلان چیز. لا إله إلا هو (هیچ معبودی جز او نیست) و هیچ بنده‌ای جز کسی که در عبودیتش مصمت (خالص و بی‌عیب) است، وجود ندارد. پس اگر بنده از این مرتبه به واسطه وصفی ربانی (هرچند محمود باشد، مانند صفات رحمانیه و امثال آن) منحرف شود، از مرتبه‌ای که برای آن آفریده شده، خارج گشته و از کمال و معرفت الله (معرفة الله) محروم شده است، به همان اندازه که به صفات حق متصف گشته است، کم باشد یا زیاد.\n\n### [اینکه انسان دو حالت دارد: حالت عقلی-نفسی مجرد از ماده و حالت عقلی-نفسی مدبر ماده]\n\nو بدان که انسان دو حالت دارد: حالت عقلی-نفسی (عقلية نفسية) مجرد از ماده، و حالت عقلی-نفسی مدبر ماده. پس هنگامی که در حال تجرید (تجرد) از نفس خود باشد، هرچند از نظر حسی متلبس به آن باشد، بر حالت «أحسن تقویم» خود است. و هنگامی که در حال پوشیدن ماده در نفس خود باشد، همان‌طور که در حس خود است، بر حالت خسران (زیان) است که در تجارتش سودی نیست: فَما رَبِحَتْ تِجارَتُهُمْ وما كانُوا مُهْتَدِينَ (تجارتشان سودی نکرد و هدایت‌یافته نبودند). و این همان قول خداوند است: إِنَّ الْإِنْسانَ لَكَفُورٌ (همانا انسان بسیار ناسپاس است)، إِنَّ الْإِنْسانَ لَظَلُومٌ كَفَّارٌ (همانا انسان بسیار ستمگر و ناسپاس است)، إِنَّ الْإِنْسانَ لِرَبِّهِ لَكَنُودٌ (همانا انسان نسبت به پروردگارش بسیار ناسپاس است)، إِنَّ الْإِنْسانَ لَفِي خُسْرٍ (همانا انسان در زیان است)، إِنَّهُ كانَ ظَلُوماً جَهُولًا (همانا او بسیار ستمگر و نادان بود).\n\nپس هنگامی که انسان کامل (الإنسان الكامل) «الله» بگوید، تمام عالم، از هر آنچه غیر خداست، با نطق او سخن می‌گوید، و تمام اسماء الله (أسماء الله) که در علم غیب او مخزون است و آن‌هایی که مستأثر (مخصوص) هستند و خداوند معرفت آن‌ها را به برخی بندگانش اختصاص داده، و آن‌هایی که به عین خود در میان همه بندگان معلوم‌اند، با نطق او سخن می‌گویند. پس تسبیح او به جای تسبیح آنچه ذکر کردم، قرار می‌گیرد و پاداش او غَيْرُ مَمْنُونٍ (بی‌منت/بی‌پایان) است. و به تحقیق این مطلب در منزل دویست و هشتاد و نهم اشاره خواهیم کرد.\n\nو پس از آنکه تو را بر معرفت قیام توحید (التوحيد) به واسطه واحدی که در خیر و شر به جای جماعت می‌ایستد، آگاه ساختم، زیرا خداوند متعال در این مقام در مورد خیر و شر فرمود: من قَتَلَ نَفْساً بِغَيْرِ نَفْسٍ أَوْ فَسادٍ في الْأَرْضِ فَكَأَنَّما قَتَلَ النَّاسَ جَمِيعاً ومن أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً (هر کس نفسی را بدون حق قصاص یا فساد در زمین بکشد، چنان است که گویی همه مردم را کشته است؛ و هر کس نفسی را زنده کند، چنان است که گویی همه مردم را زنده کرده است). و منزلت ما در این بیان برای یاران ما از اهل این شأن، و منزلت پذیرندگان آنچه بیان کردیم و ناپذیرندگان، همان است که خداوند این آیه را با تعریف احوال دنبال کرد و فرمود: ولَقَدْ جاءَتْهُمْ رُسُلُنا بِالْبَيِّناتِ ثُمَّ إِنَّ كَثِيراً مِنْهُمْ بَعْدَ ذلِكَ في الْأَرْضِ لَمُسْرِفُونَ (و همانا رسولان ما دلایل روشن را برایشان آوردند، سپس بسیاری از آنان بعد از آن در زمین اسراف‌کارند).\n\nپس ایمان گناهکاران را که با توبه (التوبة) از آن تعبیر می‌شود و لوازم آن را بیان می‌کنیم. و آن این است که ایمان اصلی (الإيمان الأصلي) همان فطرتی است که خداوند مردم را بر آن آفریده است، و آن شهادت آنان به یگانگی او سبحانه در هنگام گرفتن میثاق (الميثاق) است. پس هر مولودی بر آن میثاق متولد می‌شود. اما چون در حصار طبیعت با این جسم، که محل نسیان (فراموشی) است، قرار گرفت، حالتی را که با پروردگارش داشت، نادیده گرفت و فراموش کرد. پس اگر به حالتی برسد که نظر (استدلال) آن را اقتضا می‌کند، نیازمند نظر در ادله بر یگانگی خالقش می‌شود. و اگر به این حد نرسد، حکمش حکم والدینش است. اگر مؤمن باشند، توحید خداوند را از آنان به تقلید می‌پذیرد، و اگر بر هر دینی باشند، به آنان ملحق می‌شود. پس کسی که ایمانش تقلیدی و قطعی باشد، در ایمانش محفوظ‌تر و مطمئن‌تر است از کسی که آن را از ادله گرفته است؛ زیرا اگر زیرک، باهوش و قوی‌الفهم باشد، حیرت و خلل در ادله‌اش و وارد شدن شبهات بر آن‌ها راه می‌یابد. پس قدم و ساق محکمی برای تکیه کردن نمی‌یابد و بیم آن می‌رود که بلغزد.\n\nپس اگر ایمان او به توحید خداوند، با شرکی که از والدینش یا از نظر خود یا از امتی که در آن است به ارث برده، پیشی گرفته باشد، آن ایمان، عین ایمان میثاقی اوست و نه چیز دیگر. و تنها حجاب شرک میان او و بنده حائل شده است، مانند ابری که میان چشم و خورشید حائل می‌شود. پس هنگامی که ابر کنار رود، خورشید برای چشم ظاهر می‌شود. همچنین است ظهور ایمان برای بنده هنگام برداشته شدن شرک؛ زیرا مشرک به وجود حق (الحق) اقرار دارد. اگر بگویی: پس حکم معطل (ملحد/انکارکننده) چیست؟ آیا ایمان او در آن زمان یافت می‌شود یا حالش مانند مشرک است؟ می‌گوییم: معطل به ایمان نزدیک‌تر از مشرک است؛ زیرا هر انسانی ناگزیر است که وجود خود را مستند به امری بیابد که نمی‌داند چیست. پس به او گفته می‌شود: آن همان خداست. اگر پس از آن برایش سؤال پیش آید که آیا او واحد است یا بیشتر از واحد، در محل نظر در آن قرار می‌گیرد یا از موحدانی که به آن‌ها اعتقاد دارد، تقلید می‌کند. پس ایمان حادثی وجود ندارد، بلکه در قلب هر مؤمنی نوشته شده است. اگر شقاوت در حق مرید از بین برود، تنها وحدانیت معبود از بین می‌رود، نه وجود او. و سعادت به توحید (التوحيد) وابسته است و شقاوت ابدی به نفی آن. و اشاره به همین است در قول خداوند متعال: يا أَيُّهَا الَّذِينَ آمَنُوا (ای کسانی که ایمان آورده‌اید) در هنگام گرفتن میثاق، آمَنُوا (ایمان بیاورید) به قول رسولی که از جانب ما به سوی شما آمده است. اگر ایمان نزد آنان نبود، با آن وصف نمی‌شدند.\n\nو اما نسبت اعمال به این منزل، بر اساس آنچه مقرر می‌کنیم، چنین است:\n\nپیامبر (صلی الله علیه وسلم) فرمود: «من مبعوث شدم تا مکارم اخلاق (مكارم الأخلاق) را به کمال رسانم.»\n\nو مکارم اخلاق، اعمال و احوال اضافی هستند؛ زیرا مردمی که محل مکارم اخلاق هستند، بر دو حالت‌اند: آزاد (حر) و بنده (عبد). همان‌طور که اخلاق یا محمود (پسندیده) هستند که مکارم اخلاق نامیده می‌شوند، یا مذموم (ناپسند) هستند که سفساف اخلاق (اخلاق پست) نامیده می‌شوند. و کسانی که مکارم اخلاق و سفساف آن با آن‌ها تصرف می‌شود، دو و یک هستند. آن یک، خداوند است، و آن دو، نفس توست، اگر آن را به منزله بیگانه از خود قرار دهی، و دیگری، غیر توست، که هر آنچه غیر خداست، می‌باشد. و هر آنچه غیر خداست، بر دو قسم است و تو نیز در آن‌ها داخلی: عنصری و غیر عنصری. پس تصرف خلق با عنصری، حسی است، و تصرف خلق با غیر عنصری، معنوی است.\n\nپس اعمالی که با اخلاق از آن‌ها تعبیر می‌شود، بر دو قسم است: صالح (شایسته) که مکارم آن است، و غیر صالح (ناشایست) که سفساف آن است. خداوند متعال در مورد قسم واحد فرمود: وعَمِلَ صالِحاً (و عمل صالح انجام داد). و در مورد دیگری فرمود: عَمَلٌ غَيْرُ صالِحٍ فَلا تَسْئَلْنِ ما لَيْسَ لَكَ به عِلْمٌ إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ (عملی ناشایست است، پس چیزی را که به آن علم نداری، از من مخواه. من تو را پند می‌دهم که از جاهلان نباشی). پس خداوند ادب را به او آموخت. و از ادب این است که از علمی که نمی‌دانی، سؤال کنی. پس اگر دانست، اگر از اهل شفاعت و سؤال در آن بود، سؤال می‌کرد، و اگر نبود، سؤال نمی‌کرد. اما رحمت پدری بر او غلبه کرد، که شفقت طبیعی عنصری است، و آن را در غیر موضعش به کار برد. پس خداوند او را آگاه ساخت که این از صفات جاهلان است. و خیر با جهل همراه نمی‌شود، همان‌طور که شر با علم همراه نمی‌شود.\n\nپس قول پیامبر (صلی الله علیه وسلم) که فرمود: «من مبعوث شدم تا مکارم اخلاق را به کمال رسانم»، یعنی او می‌داند که مکارم اخلاق چیست، چگونه تصرف می‌شود و کجا تصرف می‌شود. پس بدان که مخاطبان آن، همان‌طور که برایت ذکر کردیم، حر و عبد هستند. پس بنده از آن بهره‌ای دارد و آزاد از آن بهره‌ای دارد. اگر خلق را به خداوند نسبت دهی، هر آنچه غیر خداست، بنده خداست. خداوند متعال فرمود: إِنْ كُلُّ من في السَّماواتِ والْأَرْضِ إِلَّا آتِي الرَّحْمنِ عَبْداً (هیچ کس در آسمان‌ها و زمین نیست، مگر آنکه بنده رحمان است). و اگر خلق را به یکدیگر نسبت دهی، میان حر و عبد تقسیم می‌شوند.\n\nو اما بهره بنده از اخلاق، بدان که سید مطلق (السيد على الإطلاق) واجب کرده و حرام نموده است، پس امر کرده و نهی نموده است. و مباح کرده، پس اختیار داده است. و ترجیح داده، پس ندب (مستحب) کرده و مکروه نموده است. و قسم ششمی وجود ندارد. پس هر عملی که وجوب به آن تعلق گیرد، از امر سید که خداوند است، به انجام عملی یا ندب به عملی، انجام آن عمل از مکارم اخلاق است با خدا و با نفس تو، اگر واجب باشد. و اگر مندوب (مستحب) باشد، از مکارم اخلاق با نفس توست. و اگر آن عمل متضمن منفعت غیر باشد، همچنین از مکارم اخلاق با غیر توست. و ترک این عمل، اگر بر این حکم باشد، از سفساف اخلاق است. و هر عملی که تحریم یا کراهت به آن تعلق گیرد، تقسیم در آن مانند تقسیم در واجب و مندوب است، بر همان حد. پس ترک آن عمل، به دلیل متصف بودن به تحریم یا کراهت، از مکارم اخلاق است و انجام آن از سفساف اخلاق است. و ترک عمل در این مورد، عمل روحانی است نه جسمانی، زیرا ترک، وجود عینی ندارد.\n\nو اما عملی که تخییر (اختیار) به آن تعلق گرفته، که همان مباح است، انجام آن از مکارم اخلاق با نفس توست، در دنیا نه آخرت. اما اگر همراه با عمل، این باشد که آن را به دلیل مباح و مشروع بودنش انجام داده‌ای، از مکارم اخلاق با خدا و با نفس توست، در دنیا و آخرت. و همچنین حکم ترک مباح بر همین تقسیم است. پس تمام اقسام به بنده تعلق می‌گیرد. و قسم مباح به حر (آزاد) تعلق می‌گیرد. و قسم مکروه و مندوب به حر تعلق می‌گیرد، و در آن بویی از عبودیت (العبودية) هست، نه حقیقت آن.\n\nپس این منزل، منازل شقاوت و سعادت را برای تو محصور ساخت و آن‌ها را معین (مشخص) بیان کرد؛ یعنی برایت مشخص کرد که از کجا باید آن‌ها را بدانی، و آن معرفت شریعت (الشرع) است که بر آن هستی. اگر انسان از کسانی باشد که دعوت (الدعوة) به او نرسیده است، مکارم اخلاق در حق او همان است که عقل آن را مقرر کرده است، مانند وجود غرض و کمال و سازگاری با مزاج، مثل شکر منعم که از مکارم اخلاق عقلی و شرعی است، و کفران نعمت از سفساف اخلاق عقلی و شرعی است. و خداوند نَفْساً (هیچ کس) را إِلَّا وُسْعَها (جز به اندازه توانش) تکلیف نکرده است، چه دعوت به او رسیده باشد یا نرسیده باشد. زیرا شریعت در عمل او حکمی در نفس‌الامر دارد، و در مورد آنچه از سفساف اخلاق از او سر زده، در جایی که دعوت به او نرسیده، عفو می‌شود. و عفو از آن، از مکارم اخلاق الهی است. پس حق (الحق) به صفات کرم سزاوارتر از بنده است، بلکه کرم حقیقتاً از آن اوست، و در بنده به عنایت توفیق است.\n\nو از جمله مکارمی که به این منزل تعلق دارد، همکاری بر شکر منعم (نعمت‌دهنده) و همکاری بر دریافت بلاء (آزمایش) از سوی مبتلی (آزمایش‌کننده) است، به این صورت که در رفع بلاء از خود، جز به کسی که آن را نازل کرده، یعنی خداوند متعال، استناد نکند. اگر به غیر استناد کند، از سفساف اخلاق است، و اگر به خداوند استناد کند، از مکارم اخلاق است. و بنده در هر دو حالت، طالب رفع بلاء از خود است. و بلاء عبارت است از وجود آن و احساس درد، نه چیز دیگر.\n\nو در این مقام، بسیاری از اهل طریق (اهل الطريق) دچار اشتباه می‌شوند و نفس خود را از شکایت به درگاه خداوند در مورد آنچه بر آنان نازل شده، باز می‌دارند. و شبهه آنان در این است که می‌گویند: ما بر آنچه او بر ما جاری می‌سازد، اعتراض نمی‌کنیم، زیرا این در حال رضایت (الرضاء) از او تأثیر می‌گذارد. به آنان گفته می‌شود: مقام رضایت تنها با احساس آن و عدم طلب رفع آن حاصل می‌شود، و این حد رضایت است، نه همراهی با آن؛ زیرا نفس به طور طبیعی از وجود درد بیزار است. و به همین دلیل ما از بلاء به درد تعبیر کردیم، نه به سبب آن.\n\nو شایسته است که بنده از خداوند متعال بخواهد که آنچه بر او نازل شده را برطرف سازد، زیرا این امر به کراهت فعل خداوند نسبت به او می‌انجامد، و به طور طبیعی چاره‌ای جز کراهت آن ندارد؛ زیرا درد حکم خود را بر نفس واجب می‌سازد. و فعل در نزول آن تنها از جانب خداوند است. پس کراهت درد، به طور طبیعی کراهت آن را واجب می‌سازد؛ زیرا وجود درد برای نفس او نبوده، بلکه خداوند آن را در این بنده ایجاد کرده است. پس کراهت، در حال و ضمن، به جناب عزیز (خداوند) تعلق می‌گیرد. به همین دلیل از بزرگان واقع شده است: رَبِّ أَنِّي مَسَّنِيَ الضُّرُّ (پروردگارا، همانا به من آسیب رسیده است). و آموزش به سؤال در مورد آنچه در آینده واقع نشده، با قولشان: قالوا ولا تُحَمِّلْنا ما لا طاقَةَ لَنا به (گفتند: و آنچه را که طاقت آن را نداریم، بر ما بار مکن).\n\nو از سوء ادب (سوء الأدب) به این منزل، مقاومت در برابر قهر الهی (القهر الإلهي) و مقاومت بنده در برابر سید (آقا) در امری از سفساف اخلاق است؛ زیرا این از صفات عبودیت (العبودة) نیست. پس بنده اگر ضعیف باشد، در این امر از برادر مؤمنش یاری می‌جوید، و بر دیگری واجب است که با تعلیم و تعزیت (دلجویی) او را یاری کند؛ زیرا مؤمن با برادرش بسیار است. و هنگامی که انسان با اندوه خود تنها بماند، آن اندوه بر او بزرگ می‌شود، و اگر کسی را بیابد که آن را به او بسپارد تا در آن شریک شود و بر او آسوده گردد و سبک شود، و دیگری با گوش دادن نیکو به آنچه از اندوهش به او می‌سپارد و پاسخ دادن به او با آنچه او را شاد می‌کند و مشارکت با او با اظهار تألم برای آنچه به او رسیده، یاری‌اش کند، او همان صدیق (الصديق) صادق و یاری‌دهنده است، چنانکه گفته شده است:\n\nصدیقی من یقاسمنی همومی *** ویرمی بالعداوة من رمانى‏\n(صدیق من کسی است که در اندوه‌هایم با من شریک شود *** و با کسی که مرا دشمن می‌دارد، دشمنی کند.)\n\nو دیگری گفته است:\n\nإذا الحمل الثقيل تقسمته *** رقاب الخلق خف على الرقاب‏\n(اگر بار سنگین میان *** گردن‌های خلق تقسیم شود، بر گردن‌ها سبک می‌شود.)\n\nپس این، برخی از آنچه این منزل در بر دارد را به اجمال، نه به تفصیل، برای تو بیان کردیم، از ترس طولانی شدن. پس چیزی از آن را فرو نگذاشتیم و چیزی از آن را به تو اعلام نکردیم. و ان‌شاءالله در هر منزلی چنین خواهیم کرد. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}