{
  "id": 344,
  "title": {
    "ar": "الباب الرابع والأربعون وثلاثمائة في معرفة منزل سرين من أسرار المغفرة وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Forty-Fourth: Concerning the Knowledge of the Station (منزل) of Two Secrets from the Secrets of Forgiveness, and it is from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو چوالیس: مغفرت کے رازوں میں سے دو رازوں کے مقام (منزل) کی معرفت کے بارے میں، اور یہ مقام الحضرة المحمدية (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و چهل و چهارم در معرفت منزل دو راز از اسرار مغفرت، و آن از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الرابع والأربعون وثلاثمائة في معرفة منزل سرين من أسرار المغفرة وهو من الحضرة المحمدية»\n\n\n> رأيت رجالا لا يرون بكافر *** ولا كاذب والشأن صدق وإيمان‏\n\n\n> فقلت لهم كفوا عن الزور أنه *** مقام ولكن فيه بخس ونقصان‏\n\n\n> فما كل عين في الوجود مغاير *** ولا كل كون ما سوى الله إنسان‏\n\n\n> ولكنه منه كبير مقدم *** ومنه صغير فيه حق وبهتان‏\n\n\n> فلو لا وجودي لم يكن ثم عالم *** ولا كانت أسماء ولا كانت أعيان‏\n\n\n> وكان وحيد الذات ليس بخالق *** ولا مالك يقضي بذلك برهان‏\n\n\n> ودل دليل العقل في كل حالة *** بأن إله الخلق في الخلق محسان‏\n\n\n### [إن لله رحمة عامة ورحمة خاصة]\n\n\nقد قدمنا إن لله رحمة عامة ورحمة خاصة وإن الله خص هذه الأمة برحمة خاصة\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن أمتي أمة مرحومة ليس عليها في الآخرة عذاب إنما عذابها في الدنيا الزلازل والقتل والبلاء خرج هذا الحديث البيهقي في كتاب الأدب‏\n\n\nله في باب المؤمن قل ما يخلو من البلاء لما يراد به من الخير من طريق أبي القاسم علي بن محمد بن على الأيادي عن أبي جعفر عبد الله بن إسماعيل إملاء عن إسماعيل ابن إسحاق القاضي عن محمد بن أبي بكر عن معاذ بن معاذ عن المسعودي عن سعيد بن أبي بردة عن أبيه عن أبي موسى قال قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم الحديث وكلهم قالوا حدثنا إلا المسعودي فإنه عنعنة ولا البيهقي فإنه قال أخبرنا وفي الباب عن أبي بردة قال كنت جالسا عند ابن زياد وعنده عبد الله بن يزيد فجعل يؤتى برءوس الخوارج قال وكانوا إذا مروا برأس قلت إلى النار قال فقال لي لا تفعل يا ابن أخي فإني سمعت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول يكون عذاب هذه الأمة في دنياها\n\n\nوقد ورد في الحديث الصحيح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه قال أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن ناس أصابتهم النار بذنوبهم‏\n\n\nولم يخصص صَلَّى اللهُ عَليهِ وسَلَّم أمة من أمة فإنه ما قال ناس من أمتي فهذه رحمة عامة فيمن ليس من أهل النار\n\n\nثم قال صَلَّى اللهُ عَليهِ وسَلَّم فأماتهم الله فيها إماتة\n\n\nفأكده بالمصدر فهذا كله قبل ذبح الموت وإنما أماتهم حتى لا يحسوا بما تأكل النار منهم فإن النفوس التامة هي الموحدة المؤمنة فيمنع التوحيد والايمان قيام الآلام والعذاب بها والحواس أعني الجسوم كلها مطيعة لله فلا تحس بآلام الإحراق الذي يصيرهم حمما فإن الميت لا يحس بما يفعل به وإن كان يعلمه فما كل ما يعلم يحس به فرفع الله العذاب عن الموحدين والمؤمنين وإن دخلوا النار فما أدخلهم الله النار إلا لتحقق الكلمة الإلهية ويقع التمييز بين الذين اجترحوا السيئات وبين الذين عملوا الصالحات فهذا حديث صحيح يعم الناس ويبقى العذاب على أهل النار الذين هم أهلها يجري إلى أجل مسمى عند الله إلى أن تذكرهم ملائكة العذاب التسعة عشر فإن الملائكة إذا شفعت لم تشفع هذه التسعة عشر فتتأخر شفاعتهم إلى أوان اتصافهم بالرحمة عند ما يرتفع شهودهم غضب الله إيثارا منهم لجناب الله على الخلق فإن الملائكة تشفع يوم القيامة يقول الله شفعت الملائكة وشفع النبيون وشفع المؤمنون وبقي أرحم الراحمين فيشفع عند شديد العقاب والمنتقم وهذا من باب شفاعة الأسماء الإلهية فيخرج من النار كل موحد وحد الله من حيث علمه لا من حيث إيمانه وما له عمل خير غير ذلك لكنه عن غير إيمان فلذلك اختص الله به وهذا الصنف من الموحدين هم الذين شهدوا مع شهادة الله سبحانه والملائكة أَنَّهُ لا إِلهَ إِلَّا هُوَ فمن هناك سبقت لهم العناية بالاشتراك في الشهادة ولم يعرفهم إلا الله وحده والملائكة وإن عرفتهم فإن الملائكة تحت أمر الله كالثقلين فيحترمون جناب الله ويؤثرونه على هؤلاء فلا يقدمون على الشفاعة فيهم لمخالفتهم أمر الله وعدم قبولهم الايمان فينفرد الله وحده سبحانه من كونه أرحم الراحمين بإخراج هؤلاء من النار ويترك أهلها فيها على حالهم إلى تجليه في صورة الرضاء وعموم حكم الرحمة المركبة في عالم التركيب وشفاعة ملائكة العذاب فحينئذ يتغير الحال على أهل النار كما ذكرناه من المحرور والمقرور\n\n\n### [أن الموازنة بحكم الاعتدال معقولة غير موجودة الحكم‏]\n\n\nواعلم أن الموازنة بحكم الاعتدال معقولة غير موجودة الحكم لأنه لو كان لها حكم‏\nما كان التكوين واقعا لأن حكمها الاعتدال والاعتدال يقابل الميل ولا يكون التكوين إلا بالميل ولما علم النبي صَلَّى اللهُ عَليهِ وسَلَّم من الله أنه ما أوجد العالم إلا بترجيح أحد الإمكانين‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لقاضي الدين إذا وزنت فارجح‏\n\n\nفإن الممكن الوجهان فيه على السواء فما أوجده الله إلا بالترجيح ثم إن الله ذكر عن نفسه ما كان عليه ولا عالم فذكر عن نفسه أنه أحب أن يعرف فرجح جانب المعرفة به على مقابله فخلق العالم بالترجيح لجانب العلم على مقابله فلما وازن الله بين الرحمة والغضب رجحت الرحمة وثقلت وارتفع الغضب الإلهي ولا معنى لارتفاع الشي‏ء إلا زوال حكمه فلم يبق للغضب الإلهي حكم في المال فإنه في المال وقع ترجيح الرحمة وارتفاع الغضب لخفته فما ظهر حكم الغصب إلا في حال وضع الغضب والرحمة في الميزان فحكم كل واحد منهما في العالم إلى أن يظهر الترجيح فيرتفع حكم الغضب وما قلنا هذا إلا ردا لما قاله من يدعي الكشف فقال في الموازنة الإلهية إن الله لا يحكم عدله في فضله ولا فضله في عدله وإن القبضتين على السواء من جميع الوجوه وهذا من أعظم الغلط الذي يطرأ على أهل الكشف لعدم الأستاذ وما يقول هذا إلا من لم يكن بين يدي أستاذ قد رباه أستاذ متشرع عارف بموارد الأحكام الشرعية ومصادرها فإن الله ما نصب طريقا إلى معرفته التي لا يستقل العقل بإدراكها من حيث فكره إلا ما شرعه لعباده على ألسنة رسله وأنبيائه وإنما قلنا هذا لما علمنا إن ثم طريقا آخر يقتضيه الوجود ويحصله بعض النفوس الفاضلة فأردنا إن نرفع الإشكال وذلك أن النفوس تصفو بالرياضة وترك الشهوات الطبيعية والاستغراق في الأمور المحسوسة وتتشوق إلى ما منه جاءت وما أريدت له وإلى أين ما لها وما مرتبتها من العالم وعلمت من ذاتها إن وراء هذا الجسم أمرا آخر هو المحرك له والمدبر لما عاينت من الموت النازل به فتنظر إلى آلاته على كمالها ولا ترى له تلك الإدراكات التي كانت له في زمان وصفه بالحياة فعلمت أنه لا بد من أمر آخر هناك لا تعرف ما نسبته إلى هذا الجسم هل نسبة العرض إلى محله أو المتمكن إلى مكانه أو الملك إلى ملكه‏\n\n\n### [إن بين الموت والنوم فرقانا]\n\n\nثم علمت إن بين الموت والنوم فرقانا بما تراه في النوم من الصور وما تستفيده من الأحوال الملذة والمؤلمة وسرعة التغير في صورة النائم من حال إلى حال ولم تر ذلك في صورة الجسم ثم تستيقظ فترى الجسم على حاله في صورته ما تغير وترى انفعال الجسم في بعض الأوقات لما يطرأ للنائم في حال نومه مثل دفق الماء في الاحتلام عند رؤية الجماع في النوم فعلمت بهذا كله إن وراء هذا الجسم أمرا آخر بينه وبين هذه الصورة علاقة ثم إنها رأت تفاوت الأمثال في العلوم والفهم وافتقار بعضها إلى التعليم ونظرت إلى حال من زهد وفكر واتخذ الخلوات ولم يأخذ من لذات المحسوسات إلا ما تمس إليه الحاجات مما به قوام هذا الجسم وإن صاحب هذا الحال يزيد على نفس أخرى بعلوم وفضائل يفتقر إليه فيها وفي العلم بها فنظرت في الطريق الذي أوصل تلك النفوس دون غيرها إلى هذا المقام فلم تر مانعا إلا انكباب بعض النفوس على تناول هذه المشتهيات الظاهرة الطبيعية والتنافس فيها فزهدت في ذلك كله وتحلت بمكارم الأخلاق ولم تترك لأحد عليها مطالبة ولا علاقة ولم تزاحمهم على ما هم عليه وجنحت إلى الخلوات ورفعت الهمة إلى الاستشراف لتعلم ما هو الأمر عليه فلما كانت بهذه المثابة وكل ذلك نظر منها ما هو عن تقليد شرع إلهي وإنما هو عن فكرة صحيحة وإلهام إلهي ناقص غير كامل لأن الإلهام الكامل أن يلهم لاتباع الشرع والنظر في كلامه وفي الكتب التي قيل لنا إنها جاءت من عند الله فمثل هذا هو الإلهام الأكمل فلما صفت هذه النفس وشفت وصارت مثل المرآة وزال عنها صدأ هذه الطبيعية انتقش فيها صور العالم فرأت ما لم تكن رأته فنطقت بالغيوب والتحقت بالملإ الأعلى التحاق غريب ورد على غير موطنه وهو موطنه ولكن ما عرف لغربته لما سافر إلى أرض طبيعته وبدنه فلم يكن له ذلك الإدلال ولا كمال الأنس بذلك العالم ورأى اشتغال ذلك العالم عنه بالتسبيح والتقديس وما سخروا فيه من الأعمال في حق هذه المولدات العنصرية فرأت ما يختص منهم بتحريك الأفلاك وتسيير كواكبها وما يحدث في الأركان منها وعلمت ما لم تكن تعلم وأخذت عن الأرواح الملكية علوما لم تكن عندها وما علمت إن ثم طريقا تصل منه إذا سلكت عليه إلى الأخذ عن الله منشئ الكل وأن بينه وبينها بابا خاصا يخصها فقالت هذا هو الغاية وما ثم إلا هؤلاء ونظرت إلى تفوقها بذلك على غيرها من أمثالها فقنعت فكل ما يأتي به من هذا نعته وحاله ليس له ذوق إلهي‏\nالبتة ولا يأخذ أبدا إلا عن الأرواح والعقول الملكية أخذ حال لا أخذ نطق إلا أن تجسد له في خياله أمر يخاطبه وصاحب الطريقة الشرعية يقلد الشارع فيما أخبره به من أنه ما ثم إله بينه وبين العالم مناسبة وإنه تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ولا يشبه شيئا من العالم أعلاه وأسفله ومع هذا كله فله عين وأعين ويد ويدان ووجه وكلام ونزول واستواء وفرح ومعية مع عباده بالصحبة وقرب وبعد وإجابة لمن دعاه ورحمة وأن العالم كله عبيد له خلقهم وفضل بعضهم على بعض وأن له غصبا وأن له خلفاء في الأرض من هذا النوع الإنساني فعند ما سمع ذلك وعلم إن ثم خليفة من نوعه تشوف إلى تلك المرتبة أن ينالها ورأى الطريق التي شرعها شارع وقته وخاطبه بها ورأى جميع ما كان يفعله صاحب تلك النفس التي فكرت بنظرها قد حرضها هذا الشارع عليه وحمده وقال به فأخذ به هذا المؤمن من حيث إن هذا الشارع جاء به وعلق الهمة بربه الذي أوجده لما أعلمه الشارع أنه المنتهى فقال له وأَنَّ إِلى‏ رَبِّكَ الْمُنْتَهى‏ وليس وراء الله مرمى فجعله موضع غايته وسلك سلوك المفكر الباحث صاحب النظر العقلي لكن بالطريق الشرعي فصفت نفسه وصقلت مرآته وانتقش فيها صور العالم كله الروحاني وإلى حد الطبيعة التي دون النفس يصل أهل الفكر وما ينتقش فيهم مما فوقها إلا من يكون سلوكه على الطريق المشروع فإذا وصل هذا السالك على طريق الشرع انتقش فيه ما في اللوح المحفوظ فيرى مرتبة الشرائع ويرى نفسه وحظه ونصيبه وغايته من العالم فيعمل بحسب ما يراه فيرتفع بالطلب إلى الوجه الخاص به فيأخذ عن الحق أخذ إلهام وأخذ تجل وأخذ تنزيه وأخذ تشبيه ويعاين سريان الوجود في الممكنات ويعلم عند ذلك لمن الحكم فيما ظهر ومن هو الظاهر الذي تظهر فيه هذه الأحكام والاختلافات الروحانية والطبيعية فإذا نطق هذان الشخصان علم الكامل من الرجال الفرق بين الشخصين وعلم من أين أتى على كل واحد منهما ولما ذا نقص السالك بفكره عن رتبة المتشرع فصاحب الفكر لا يزال أبدا منكوس الرأس منتظرا ما يأتيه به الإمداد الروحاني وصاحب الشرع لا يزال منكوس الرأس حياء من التجلي الإلهي في أوقات كما لا يزال شبه الحائر الواله المبهوت إذا رآه في كل شي‏ء فلا ينطق إلا به ولا ينظر إلا إليه ولا يعلم أن ثم عينا سواه فيطلبه الملأ الأعلى والأرواح العلى والأفلاك الدائرة المتحركة والكواكب السابحة لتوصل إليه ما أمنت عليه مما يستحقه عليها فلا تجد من يأخذ عنها بطريق الاعتبار والأدب فتؤدي ذلك أداء ذاتيا ويأخذه منها ما بقي من نشأته أخذا ذاتيا وهو غائب بربه عن هذا كله فإذا رد إلى رؤية ذاته رأى في ذاته جميع ما أعطاه العالم كله أعلاه وأسفله مما هو له وهو أمانة عندهم فشكر الله على ذلك وعلم إن كل ما في الكون مسخر له ولأمثاله ولكن لا يعلمون فإذا حصل في هذا المقام رأى أن الذين أوتوا العلم على درجات يزيدون بها على غيرهم من أمثالهم ويرى أن أمثاله بمثابته ولا علم لهم بذلك فيفرح بذاته ويحزن لهم حيث هم في مقام واحد معه ولا يشعرون بذلك وإنه ما فضل عليهم إلا بالعلم به وبهم وبما هو الأمر عليه ولما ارتقى هذه الدرجات ارتقاء كشف وتحقيق ومعاينة يقينية طلب من أين له هذه الدرجات التي ارتقى فيها واختص دون أكثر أمثاله بها فتجلى له الحق عند ذلك في اسمه رَفِيعُ الدَّرَجاتِ وإنه الملقي من هذه الدرجات الروح عَلى‏ من يَشاءُ من عِبادِهِ فعلم أنه ممن شاء من عباده فقابل الدرجات بالدرجات فإذا هي عينها لا غيرها ورأى تلك الدرجات في العالم كله وأنه فيها فأخذ يظهر للعالم بها والعالم لا يشعر فيخاطب كل إنسان من حيث هو من درجته التي له فيقول هذا معي وعلى هذا مذهبي واعتقادي فلا ينكره أحد من العالم ولا ينكر هو أحدا من العالم مع لزوم الأدب الإلهي ولا يلزم الأدب إلا صاحب المقام ومقام أن لا مقام مقام وأما صاحب الحال فقد يطهر عليه‏\n\n\nمن هذا لنقصه ونزوله عن صاحب المقام ما يؤدي الناظر فيه إلى معرفته به فالكامل ينصبغ بكل صورة في العالم ويتستر بما يقدر عليه فإن كان ثم من رآه في صورة قد اختلفت عليه لأجل اختلاف الخلق اعتقد فيه عدم التقييد الذي هو عليه هذا الناظر فقال بكفره وزندقته وما علم من أين أتى عليه فينبغي لصاحب هذا المقام أن لا يظهر لشخصين في صورة واحدة أبدا كما لا يتجلى الحق لشخصين في صورة واحدة أبدا فإن الدرجات هي الدرجات فإن كفره وزندقه من لم ير اختلاف الصور عليه فذلك جهل منه وحسد فيكون ما ينسبه إليه على صورة ما ينسبه إلى الله‏\nجل وعلا من الصاحبة والولد والشريك وما نزه الحق نفسه عنه فهذا لا يؤثر في صاحب هذا المقام بل هو على كماله وذلك الواقع فيه من المفترين فإنه ما حكم عليه إلا بما شاهده منه ويقول بلسانه عنه ما يعلم خلافه في نفسه ظلما وعلوا كما قال تعالى وجَحَدُوا بِها واسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وعُلُوًّا فَانْظُرْ كَيْفَ كانَ عاقِبَةُ الْمُفْسِدِينَ وكذلك تكون عاقبة هذا فدرجات الحق ما هو العالم عليه وصاحب هذا المقام قد تميز فيها حين ميزها فهو الإله الظاهر والباطن والأول في الوجود والآخر في الشهود والله غَنِيٌّ عَنِ الْعالَمِينَ فلا يدخله تنكير والإله يدخله التنكير فيقال إله فاجعل بالك لما نبهتك عليه لتعلم الفرقان بين قولك الله وبين قولك إله فكثرت الآلهة في العالم لقبولها التنكير والله واحد معروف لا يجهل أقرت بذلك عبدة الآلهة فقالت ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ وما قالت إلى إله كبير هو أكبر منها ولهذا أنكروا ما جاء به صَلَّى اللهُ عَليهِ وسَلَّم في القرآن والسنة من أنه إله واحد من إطلاق الإله عليه وما أنكروا الله ولو أنكروه ما كانوا مشركين فبمن يشركون إذا أنكروه فما أشركوا إلا بإله لا بالله فافهم فقالوا أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ وما قالوا أ جعل الآلهة الله فإن الله ليس هو عند المشركين‏\n\n\nبالجعل وعصم الله هذا اللفظ أن يطلق على أحد وما عصم إطلاق إله ولقد رأيت بعض أهل الكفر في كتاب سماه المدينة الفاضلة رأيته بيد شخص بمرشانة الزيتون ولم أكن رأيته قبل ذلك فأخذته من يده وفتحته لأرى ما فيه فأول شي‏ء وقعت عيني عليه قوله وأنا أريد في هذا الفصل أن ننظر كيف نضع إلها في العالم ولم يقل الله فتعجبت من ذلك ورميت بالكتاب إلى صاحبه وإلى هذا الوقت ما وقفت على ذلك الكتاب فمن كان ذا بصيرة وتنبه فليتفطن لما ذكرناه فإنه من أنفع الأدوية لهذه العلة المهلكة فاسم الإله من الدرجات المذكورة فلا بد منه إذ لا بد من الدرجات ومن هذا الباب قول السامري هذا إِلهُكُمْ وإِلهُ مُوسى‏ في العجل ولم يقل هذا الله الذي يدعوكم إليه موسى وقول فرعون لَعَلِّي أَطَّلِعُ إِلى‏ إِلهِ مُوسى‏ ولم يقل إلى الله الذي يدعو إليه موسى عليه السلام وقال ما عَلِمْتُ لَكُمْ من إِلهٍ غَيْرِي فما أحسن هذا التحري لتعلم إن فرعون كان عنده علم بالله لكن الرئاسة وحبها غلب عليه في دنياه فإنه قال ما عَلِمْتُ لَكُمْ ولم يقل ما علمت للعالم لما علم إن قومه يعتقدون فيه أنه إله لهم فأخبر بما هو عليه الأمر وصدق في إخباره بذلك فإنه علم أنه ليس في علمهم إن لهم إلها غير فرعون ولما كان في نفس الأمر إن ثم درجات منسوبة إلى الله بالرفعة بكونه رفيع الدرجات كثر على وجه الاختلاف صور التجلي لهذا نطق السامري بقوله وإِلهُ مُوسى‏ فإن التجلي الإلهي لا يكون إلا للاله وللرب لا يكون لله أبدا فَإِنَّ الله هُوَ الْغَنِيُّ قُلْ هُوَ الله أَحَدٌ الله الصَّمَدُ لَمْ يَلِدْ ولَمْ يُولَدْ ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ وهو سبحانه لا يتجلى لشخص في صورة واحدة مرتين ولا لشخصين في صورة واحدة فلهذا قال وإِلهُ مُوسى‏ فإن تجليه للأنبياء مختلف الصور أحدي الحكم بأنه الإله في أي صورة تجلى أ لا تراه في القيامة إذا تجلى ينكر ويعرف باختلاف الصور فإن قلت فقد رجع إلى الصورة حين أنكر حتى يعرف فقلنا لو علمت قوله هل بينكم وبينه علامة فتلك العلامة هي الدليل لهم حيثما رأوها عليه علموا أنه ربهم فسميت صورة تلك العلامة إذ كل معلوم ينطلق عليه اسم الصورة فبالعلامة عرفوه لا أنه كرر عليهم الصورة وإنما كانت تلك الصورة هي العلامة فدرجات الحق ليست لها نهاية لأن التجلي فيها وليس له نهاية فإن بقاء العالم ليس له نهاية فالدرجات ليست لها نهاية في الطرفين أعني الأزل والأبد اللذين ظهرا بالحال وهو العالم فلو زال العالم لم يتميز أزل من أبد كما هو الأمر عليه في نفسه فما ثم بدء في حق الحق ونفي البدء في حقه درجة من درجاته التي ارتفع بها عن مناسبة العالم ودرجات العالم التي هي عين درجاته لا يتناهى أبدها وإن كان نزول العالم في درجة منها فتلك الدرجة\n\n\nهي بدء للعالم لأن الدرجات لها ابتداء بل ظهور العالم فيها له ابتداء واعلم أن الحق من حيثما تميز عن الخلق كان برزخا بين الدرجات وبين الدركات فإنه وصف نفسه بأن له يدين وما بين اليدين برزخ فما كان على اليمين هو درجات الجنة لأهلها وما كان على اليد الأخرى دركات النار لأهلها فنسبة السفل إليه نسبة العلو لأنه مع العباد أينما كانوا فهو معهم في درجاتهم وهو معهم في دركاتهم كما يليق بجلاله واعلم أنه من الدرجات درجة المغفرة وهما درجتان الواحدة ستر المذنبين عن إن تصيبهم عقوبة ذنوبهم والدرجة الأخرى سترهم عن إن تصيبهم الذنوب وهذا\nالستر هو ستر العصمة فقال في الستر الواحد من المغفرة وقِهِمْ عَذابَ الْجَحِيمِ وقال في الستر الآخر من المغفرة وقِهِمُ السَّيِّئاتِ وما ثم للمغفرة ستر آخر فالستر الحائل بين المذنب والعذاب ستر كرم وعفو وصفح وتجاوز والستر الحائل بين العبد والذنب ستر عناية إلهية واختصاص وعصمة يوجب ذلك خوفا أو رجاء أو حياء كما\n\n\nجاء في صهيب نعم العبد صهيب لو لم يخف الله لم يعصه‏\n\n\nفسبب عصمته من وجود المعصية خوفه ولو لم يكن الخوف لمنعه الحياء من الله تعالى أن يجري عليه لسان ما يسمى ذنبا في حق من كان ولو لم يكن ذنبا في حقه لكونه ما أقيم إلا فيما أبيح له وهذه غاية العناية والعصمة من التصرف في المباح وأعظم المعاصي ما يميت القلوب ولا تموت إلا بعدم العلم بالله وهو المسمى بالجهل لأن القلب هو البيت الذي اصطفاه الله من هذه النشأة الإنسانية لنفسه فغصبه فيه هذا الغاصب وحال بينه وبين مالكه فكان أظلم الناس لنفسه لأنه حرمها الخير الذي يعود عليها من صاحب هذا البيت لو تركه له فهذا حرمان الجهل غير إن هنا نكتة ينبغي التنبيه عليها وذلك أن صاحب القلب الذي يرى أنه وسع القلب ربه دون سائر نشأته ينزل عن درجة من يرى أن الحق عين نشأته من غير تخصيص إذ كان الحق سمعه وبصره وجميع قواه فما اختص منه بشي‏ء دون شي‏ء فصاحب القلب مراقب قلبه وصاحب الحالة الأخرى يحكم بربه على كل شي‏ء استتر فيه ربه عن ذلك الشي‏ء وهو مشهود لصاحب هذه الصفة في ذلك الستر فيعامله بما يوحى إليه به فإن أوحي إليه بالكشف عنه اعتناء من الحق بهذا المستور عنه كشفه له وأعرب له عن نفسه وعرفه ما هو الحق منه وإن أوحي إليه بإبقاء الستر عليه أبقاه ولم يظهر له شيئا مما هو في نفسه عليه هذا المستور فيحكم صاحب هذه الصفة على صاحب القلب ولا يحكم عليه صاحب القلب لشغله بحراسة قلبه الذي هو بيت ربه لئلا يدخل فيه غير ربه فإنه الحفيظ البواب فإذا فهمت هذا فانظر أي الرجلين تكون ولهذا أهل المراقبة لا يزالون في الحجاب عن التصرف في الكون وهم أهل الحدود في الله فإذا ارتفعوا عن مراقبة قلوبهم فهو أعظم الحجب وإذا تعدوا في مراقبة قلوبهم مراقبة العالم بأسره اتسع عليهم المجال ولكن ما لهم حكم صاحب ذلك الوصف الذي ذكرنا فإنهم مراقبون إياه لكونه مراقبا إياهم لأنه على كل شي‏ء رقيب فقابلوا الحفظ بالحفظ مقابلة الأمثال بالموازنة والمطابقة فكما راقبهم بعينه راقبه هذا المراقب بعينه أيضا ومن كان حقا كله في نفسه وفي العالم خرج عن صفة المراقبة فإنها مقام سلوك ومحجة فإذا سلكت فيه به ومنه إليه لم يكن ثم من يراقب إذ لا خوف في ذلك الطريق من مانع يمنع السالك فيه فهو سلوك لا مراقبة فيه ويتضمن هذا المنزل من العلوم علم إسبال الستور وعلى من تسبل فقد يسبل الستر على جهة التعظيم كالحجاب والستر الذي وراءه الملك أو المخدرة ويسبل الستر أيضا دون من لا يرتضي للكشف لما وراء الستر وقد تسبل الأستار رحمة بمن تسبل دونهم كالحجب الإلهية بين العالم وبين الله إبقاء عليهم لئلا تحرقهم السبحات الوجهية فيتضمن علم لما ذا تسدل وعلى من تسدل وفيه علم صور تركيب الكلام الإلهي مع أحديته من أين قبل التركيب وما هو إلا واحد العين ليفرق الإنسان العالم بين حقيقة الكلام وبين ما يتكلم به من له صفة الكلام فيعلم إن التركيب فيما يتكلم به لا في الكلام وعلم هذا النوع من المعلومات علم عزيز لا يختص به إلا العلماء بالله الذين سمعوا كلام الله في أعيان الممكنات وفيه علم القابل والمقبول منه والقبول الذي هو نعت القابل وهل يتنوع القبول لتنوع القابل أو لا أثر للقابل فيه وفيه علم الحدود الإلهية لما ذا ترجع هل إليها في ذاتها أو إلى الله أو إلى الممكنات التي هي العالم وفيه علم صفات المنازعين الذين يعلمون الحق فيسترونه مثل الفقهاء الذين يلتزمون مذهبا لا يعتقدون صحته فيناظرون عليه مع علمهم ببطلانه والخصم الذي يكون في مقابلته يأتي بالحق على بطلانه ويعلم هذا الآخر أن الحق بيد صاحبه فيرده ويظهر الباطل في صورة الحق على علم منه فهل يستوي هو ومن يظن في الباطل أنه حق فيذب عنه لكونه عنده إنه حق وما حكم هؤلاء عند الله يوم القيامة وهل لهم مستند إلهي أم لا وفيه علم الفرق بين الإنكار والجحد والكذب وهل هذا كله أمر عدمي أو وجودي فإن كان وجوديا ففي أي مرتبة هو من مراتب الوجود هل يعمها كلها أو هو في بعضها وكذلك إن كان عدميا في أي مرتبة هو من مراتب العدم هل هوفي مرتبة العدم الذي لا يقبل الوجود وهل ثم للعدم مرتبة لا يقبل الوجود بنسبة ما أومأ ثم عدم إلا ويقبل نسبة إلى مرتبة وجودية أو هو في مرتبة العدم الذي يقبل المنعوت به الوجود\nوهو العدم الممكن وفيه علم هم الأضعف بالأقوى بالسوء هل هو عن قوة حقيقية فما هو أضعف أو هل هو عن قوة متوهمة فهو في نفس الأمر أضعف ولا يعلم فما الذي يحجبه عن ضعفه وفيه علم من جهل قدر الأمور وما تستحقه ما السبب الذي جعله يجهل ذلك حتى ظهر منه ما لا ينبغي فيما لا ينبغي وفيه علم مراتب الملائكة فيما يذكرون العالم به عند الله إذ لهم القرب الإلهي وهم الوسائط بين الله وبين خلقه وهم في الوسط في شهادة التوحيد في قوله شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ وفيه علم المفاضلة في كل شي‏ء بين الله وبين خلقه وفيه علم ما ينتجه الاعتراف بالحق عند الله وفيه علم الحكم بالاختيار هل يقدح في العدل أم لا وفيه علم الفرق بين من علم الشي‏ء عن جهل وبين من علمه عن نسيان وما صفة أهل التذكر من صفة غيرهم وفيه علم الإخلاص ممن أو في حق من وفيه علم ما يكره وما يحب وهل عين ما يكرهه زيد هو عين ما يحبه عمرو أم لا وفيه علم ما ينفرد به الحق دون الخلق هل يعلم ذلك أم لا وهل يمكن الوصول إليه بعناية إلهية من تعريف أم لا وما المانع إن امتنع ذلك وفيه علم منزلة الإمام العادل ومرتبته وفيه علم أحوال المحجوبين عن الله بالظلمة دون النور وعلم المحجوبين عن الله بالنور دون الظلمة وعلم المحجوبين عن الله بالنور والظلمة معا وهل هذه الحجب رحمة بالمحجوبين أو حجب بعد وفيه علم ما يتوجه على الأعضاء من التكاليف وفيه علم الاعتبار والتفكر وفيه علم تأييد أهل العناية الإلهية بما ذا يؤيدهم وفي أي موطن يؤيدهم وما السبب الموجب لتسليط أعدائهم عليهم وتمكنهم منهم ولما ذا استند المعتدي عليهم هل يستند لأمر وجودي إلهي أو لأمر وجودي نفسي وفيه علم ما أنت إذا رأيته قلت فيه إنه حق ثم تقول فيه إنه باطل ثم تقول فيه إنه باطل حق ثم تقول فيه إنه لا باطل ولا حق ثم تقول فيه لا أدري ما هو فعوده إلى الجهل به هل هو عين العلم بذلك الأمر أو يمكن الوصول إلى العلم به ولكن هذا ما وصل فنطق بنعته لا بنعت ما تكلم فيه وفيه علم الإنصاف من غير تعصب وما حضرته وتسكين الغضب من الغاضب بلطف من المسكن لا بقهر فإن القهر لا يسكن الغضب وإنما يخفى حكمه لسلطان القهر عليه وفيه علم إحاطة الملائكة بالعالم يوم يصفون وهم اليوم على تلك الصورة وعلم الفرق بين حكمهم فينا اليوم وبين حكمهم في ذلك اليوم والصفة واحدة من الإحاطة ولما ذا ينادي هناك بعضهم بعضا وهنا ليس كذلك إلا في مواطن مخصوصة لأن القيامة على صورة الدنيا سواء غير إن الحاكم هنالك هو الواحد بارتفاع الوسائط وهنا هو الحاكم الواحد بعينه لكن بالوسائط ليفرق بين الدارين كما فرق بالجنة والنار بين القبضتين وفيه علم من تحكم على الله من أين تحكم وما الذي أجرأه على ذلك هل صفة حق أو صفة جهل وفيه علم العناية الإلهية بالجبارين المتكبرين وفيه علم ما عصم الله من الأسماء الإلهية لما ذا عصمته وما لم يعصمه من الأسماء الإلهية كاسمه الأحد ولا يتجلى في هذا الاسم ولا يصح التجلي فيه ولا في الاسم الله وما عدا هذين الاسمين من الأسماء المعلومات لنا فإن التجلي يقع فيها وفيه علم الحركة في عين السكون وفيه علم الاشتراك بين المؤمن والعالم في أي حضرة يكون ذلك وبما ذا يتميزون وهل ينال المؤمن درجة العالم وما يقبله من جهة الخبر الصادق هل يلحق بذلك درجة العلماء أم لا وهل الدليل على تصديق الرسل في ادعائهم أنهم رسل ينسحب في الدلالة على ما جاءوا به من الأخبار والأحكام أو يفتقرون إلى دليل آخر أو يكونون علماء مع كونهم مقلدين وفيه علم الدور في كون الداعي يكون مدعوا لمن دعاه بحكم التعارض وفيه علم حكم طلب النجاة في العالم كله بالطبع ولكن تجهل ومن هو الصنف الذي يعلمها من العالم وما هي النجاة وفيه علم علامة كل داع و\n\n\nما يدعو إليه من الأسماء الإلهية وفيه علم الوقت الذي يلقى الإنسان فيه ما في يده ولا يعتمد عليه ويسلم إلى الله جميع أموره وفيه علم الجين وإعادة السهام على راميها وقد عاينت هذا النبال بمدينة تلمسان من عالم بصنعة الرمي وإنشاء القسي والنبال فرأيته يرمي بالسهم فإذا انتهى السهم إلى مرماه عاد إلى الرامي وحده فكان ذلك لي عبرة في كون الأعمال ترجع على عامليها وفيه علم ما يتنزل منزلة الزمان وليس بزمان وفيه علم التنازع بعد حكم الحاكم وما سببه إذ لا أثر له في رد الحكم وفيه علم مراتب الشهود من الحاكم وترك الحاكم حكمه بما يعلم ويحكم بقول الشهود وما سبب وضع ذلك في العالم ولكن ليس ذلك عندنا إلا في الأموال لا في النفوس ولا في إقامة الحدود وفيه علم ما لا يجوز تأخيره لمسيس الحاجة إليه وما فائدة البيان الذي وضع لحصول العلم‏\nويترك الحكم به وفي أي النوازل يكون ذلك ومن هو على الصواب في هذه المسألة هل من يقول إنه يحكم بعلمه أو المخالف وعندي في هذه المسألة لو كنت عالما بأمر ما وشهد الشهود بخلاف علمي ولا يجوز لي أن أحكم بعلمي إذا كنت ممن يقول بذلك استنبت في الحكم من لا علم له بالأمر وتركت الحكم فيه وهذا هو الوجه الصحيح عندي والذي أعمل به وإن كان في النفس منه شي‏ء وهذا عندي في الحكم في الأموال وأما الحكم في الأبدان فلا أحكم إلا بعلمي إذا علمت البراءة فإن لم تكن البراءة وعلمت صدق المفتري حكمت بالشهود وتركت علمي وعلم سبب هذا الذي ذهبت إليه يتضمنه هذا المنزل وفيه علم ما يفضل به العالم على الإنسان وهو أن له عليه ولادة وفيه علم مسمى الساعة وفيه علم هل يصح التكبر من العالم على الله أم لا وفيه علم ما تطلبه الأشياء من الأمور طلبا ذاتيا هل يصح فيه خرق العادة فيكون بالجعل أم لا وإن انخرقت فيه العادة فما محل خرق العادة هل في الطالب فيتبعه ما كانت تقتضيه ذاته أم لا وفيه علم حضرة تقرير النعم على المنعم عليه ما يكون من ذلك على جهة التعليم أو على جحده لذلك وفيه علم أصل حياة العالم الحسية والمعنوية هل ترجع إلى أصل واحد أم لا وهل في الطبيعة حياة حتى تعطي الحياة الحسية أم لا وفيه علم النشأة الإنسانية الدنياوية وأحوالها في مدة بقائها في هذه الدار وما يؤول إليه أمرها من حيث جسميتها بعد الموت وفيه علم الموت والحياة هل ذلك نسبة أو عين موجودة تظهر في مواطن مختلفة وحكم المميت هل يميت بموت فيكون سببا أو يميت فقط وكذلك الحياة فيكون عين الميت عين الموت بحكم المميت وفيه علم القضاء وفضله عن القدر وفيه علم كون الآية التي يأتي بها الرسول ليست بشرط ولا يجب عليه الإتيان بها وفيه علم مراعاة الله عباده مع سوء أدبهم مع الله وفيه علم عموم نفع الايمان في الآخرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 344: Concerning the Knowledge of the Station of Two Secrets from the Secrets of Forgiveness, which is from the Muhammadan Presence (الحضرة المحمدية)\n\nI saw men who perceive neither unbeliever nor liar,\nFor their concern is truthfulness and faith.\nSo I told them: Refrain from falsehood (الزور), for it is a station (مقام),\nYet it contains loss and deficiency.\nNot every immutable essence (عين) in Existence (الوجود) is distinct,\nNor is every being other than God a human.\nBut from Him is a great one, foremost,\nAnd from Him is a small one, containing both truth and falsehood.\nWere it not for my existence (وجودي), there would be no cosmos (عالم),\nNor would there be Names (أسماء) or Fixed Entities (أعيان).\nAnd He would be the Unique Essence (وحيد الذات), neither Creator nor Sovereign;\nA clear proof dictates this.\nAnd the proof of the intellect (العقل) indicates in every state\nThat the God of Creation (إله الخلق) is a Benefactor (محسان) within Creation (الخلق).\n\n### [Indeed, Allah has a General Mercy and a Specific Mercy]\n\nWe have previously established that Allah has a General Mercy (رحمة عامة) and a Specific Mercy (رحمة خاصة), and that Allah has distinguished this community (Ummah) with a Specific Mercy.\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"My community is a mercifully treated community (أمة مرحومة). There is no torment upon it in the Hereafter. Its torment is only in this world: earthquakes, killing, and affliction.\" This Hadith was transmitted by Al-Bayhaqi in *Kitab al-Adab*, in the chapter concerning the believer rarely being free from affliction due to the good intended for him. This is through the chain of Abu al-Qasim Ali ibn Muhammad ibn Ali al-Ayyadi, from Abu Ja‘far Abdullah ibn Isma‘il (dictation), from Isma‘il ibn Ishaq al-Qadi, from Muhammad ibn Abi Bakr, from Mu‘adh ibn Mu‘adh, from Al-Mas‘udi, from Sa‘id ibn Abi Burdah, from his father, from Abu Musa, who said: The Messenger of Allah, peace and blessings be upon him, said the Hadith. All of them said, \"He narrated to us,\" except for Al-Mas‘udi, who used the *‘an‘ana* form (reporting without explicitly stating \"I was told\"), and Al-Bayhaqi, who said, \"He informed us.\" There is also a narration on this topic from Abu Burdah, who said: I was sitting with Ibn Ziyad, and Abdullah ibn Yazid was with him. Heads of the Khawarij were being brought in. He said: When a head passed by, I would say, \"To the Fire!\" He said to me: \"Do not do that, O son of my brother, for I heard the Messenger of Allah, peace and blessings be upon him, say: 'The torment of this community will be in its worldly life.'\"\n\nIt has been reported in the sound Hadith (الحديث الصحيح) from the Messenger of Allah, peace and blessings be upon him, that he said: \"As for the people of the Fire who are its true inhabitants, they will neither die therein nor live. But there are people whom the Fire strikes due to their sins.\"\n\nHe, peace and blessings be upon him, did not specify one community over another, for he did not say, \"people from my community.\" This is a General Mercy (رحمة عامة) for those who are not the true inhabitants of the Fire.\n\nThen he, peace and blessings be upon him, said: \"So Allah will cause them to die therein, a death (إماتة).\"\n\nHe confirmed this with the verbal noun (the source). All of this occurs before the slaughtering of Death. He only causes them to die so that they do not feel what the Fire consumes of them. For the perfect souls are the monotheistic believers (الموحدة المؤمنة), and Unity (التوحيد) and Faith (الإيمان) prevent the establishment of pains and torment upon them. The senses—meaning the bodies—are all obedient to Allah, so they do not feel the pains of the burning that turns them into charcoal. For the dead person does not feel what is done to him, even if he knows it, since not everything known is felt. Thus, Allah removes the torment from the monotheists and believers, even if they enter the Fire. Allah only admits them to the Fire to realize the Divine Word (الكلمة الإلهية) and to effect the distinction (التمييز) between those who committed evil deeds and those who performed righteous deeds. This is a sound Hadith that encompasses all people. The torment remains upon the people of the Fire who are its true inhabitants, continuing until a term appointed by Allah, until the nineteen Angels of Torment (ملائكة العذاب التسعة عشر) remember them. For when the Angels intercede, these nineteen do not intercede. Their intercession is delayed until the time they are characterized by Mercy (الرحمة), when their witnessing of Allah’s Wrath is lifted, out of their preference for the Divine Presence (جناب الله) over creation. For the Angels intercede on the Day of Resurrection. Allah says: \"The Angels have interceded, the Prophets have interceded, and the believers have interceded. And there remains the Most Merciful of the Merciful (أرحم الراحمين).\" So He intercedes with the Severe in Punishment (شديد العقاب) and the Avenger (المنتقم). This is from the category of the intercession of the Divine Names (الأسماء الإلهية). Thus, every monotheist who affirmed the Unity of Allah based on his knowledge (علم), not his faith (إيمان), and who had no good deed other than that, is brought out of the Fire. Because he acted based on knowledge but not faith, Allah singled him out. This category of monotheists are those who witnessed, along with the witnessing of Allah, exalted is He, and the Angels, that <<إِنَّهُ لا إِلهَ إِلَّا هُوَ>> (Indeed, there is no god but He). From that point, Divine Providence (العناية) preceded them due to their participation in the witnessing. None knows them except Allah alone. Even if the Angels know them, the Angels are under Allah’s command, like the two weighty ones (mankind and jinn). They respect the Divine Presence and prefer Him over these people, so they do not proceed to intercede for them due to their disobedience to Allah’s command and their non-acceptance of faith. Thus, Allah alone, exalted is He, as the Most Merciful of the Merciful, is singled out for removing these people from the Fire. He leaves its true inhabitants in their state until His Self-disclosure (تجليه) in the form of Satisfaction (الرضاء) and the general rule of Mercy inherent in the world of composition (عالم التركيب), and the intercession of the Angels of Torment. At that point, the state of the people of the Fire changes, as we mentioned regarding the feverish and the chilled.\n\n### [That Balance by the Rule of Moderation is Conceivable but Not Existing in Effect]\n\nKnow that Balance (الموازنة) by the rule of Moderation (الاعتدال) is conceivable but does not exist in effect. If it had an effect, creation (التكوين) would not occur, because its rule is moderation, and moderation opposes inclination (الميل). Creation only occurs through inclination. When the Prophet, peace and blessings be upon him, knew from Allah that He only brought the cosmos into existence by the preponderance (ترجيح) of one of the two possibilities,\n\nThe Messenger of Allah, peace and blessings be upon him, said to the judge of debt: \"When you weigh, then make the scale preponderant (فارجح).\"\n\nFor the two aspects of the possible are equal. Allah only brought it into existence by preponderance. Furthermore, Allah mentioned concerning Himself what He was like when there was no cosmos. He mentioned concerning Himself that He loved to be known (أحب أن يعرف), so He preferred the side of Knowledge (المعرفة) of Him over its opposite. Thus, He created the cosmos by preferring the side of Knowledge over its opposite. When Allah weighed Mercy (الرحمة) against Wrath (الغضب), Mercy preponderated, became heavy, and Divine Wrath lifted. The meaning of a thing lifting is only the cessation of its effect (زوال حكمه). Thus, Divine Wrath has no effect in the ultimate outcome (في المال), for in the ultimate outcome, the preponderance of Mercy occurred, and Wrath lifted due to its lightness. The effect of Wrath only appeared during the state when Wrath and Mercy were placed in the balance. The rule of each of them remains in the cosmos until the preponderance appears, and the rule of Wrath is lifted. We only stated this in refutation of what was said by one who claims Unveiling (الكشف), who stated regarding the Divine Balance that Allah does not judge His Justice in His Bounty, nor His Bounty in His Justice, and that the two handfuls (القبضتين) are equal in all respects. This is one of the greatest errors (أعظم الغلط) that befalls the people of Unveiling due to the lack of a master (الأستاذ). Only one who has not been before a master—a master who is versed in the Law (متشرع) and knows the sources and derivations of legal rulings—would say this. For Allah has not established a path to His Gnosis (معرفته), which the intellect cannot independently grasp through mere thought, except that which He legislated for His servants through the tongues of His Messengers and Prophets. We only said this because we know that there is another path necessitated by Existence (الوجود) and attained by some virtuous souls. We wished to remove the ambiguity. This is because souls are purified through spiritual discipline (الرياضة), abandoning natural desires (الشهوات الطبيعية), immersion in sensible matters, and yearning for the source from which they came, the purpose for which they were intended, their ultimate destination, and their rank in the cosmos. The soul knows from its essence that beyond this body is another matter that moves it and manages it, having witnessed the death that descends upon the body. It observes the body’s organs in their perfection but does not see the perceptions it had during the time it was described as living. Thus, it knows that there must be another matter there, though it does not know its relation to the body—whether it is the relation of an accident to its locus, or the established to its place, or the king to his kingdom.\n\n### [Indeed, there is a difference between Death and Sleep]\n\nThen it knows that there is a difference between Death and Sleep (النوم) by what it sees in sleep of forms, and the states of pleasure and pain it gains, and the swift change in the sleeper’s form from one state to another. It does not see this in the form of the body. Then it wakes up and sees the body in its form, unchanged. It sees the body’s reaction at times to what occurs to the sleeper during sleep, such as the gushing of water in a wet dream upon seeing intercourse in sleep. Through all this, it knows that beyond this body is another matter, and there is a connection between it and this form. Then it sees the disparity among individuals in knowledge and understanding, and the need of some for instruction. It observes the state of one who practices asceticism (زهد), contemplation (فكر), and seclusion (الخلوات), taking from the pleasures of the senses only what is necessary for the sustenance of the body. It sees that the possessor of this state surpasses another soul with knowledge and virtues for which others are dependent upon him. It looks into the path that led those souls, and not others, to this station. It sees no impediment except the preoccupation of some souls with consuming these manifest natural desires and competing for them. So, it renounces all of that, adorns itself with noble character, leaves no claim or attachment upon anyone, does not compete with them in their pursuits, inclines toward seclusion, and raises its aspiration to observe and learn the true nature of the matter. When it reaches this level—and all of this observation is not based on imitation of a Divine Law (شرع إلهي), but rather on sound thought and incomplete Divine Inspiration (إلهام إلهي ناقص غير كامل)—because complete inspiration is to be inspired to follow the Law and contemplate His speech and the books said to have come from Allah. Such is the most complete inspiration. When this soul is purified and polished, becoming like a mirror, and the rust of this nature is removed from it, the forms of the cosmos are imprinted upon it. It sees what it had not seen before, speaks of the Unseen (الغيوب), and joins the High Assembly (الملإ الأعلى)—a strange joining, returning to a place that is its home, yet it is not recognized due to its strangeness, having traveled to the land of its nature and body. Thus, it lacks that familiarity and the perfection of intimacy with that world. It sees that world preoccupied with glorification (التسبيح) and sanctification (التقديس), and the tasks they are subjected to concerning these elemental generations. It sees what is specific to them in moving the spheres and guiding their stars, and what occurs in the elements, and it knows what it did not know. It receives knowledge from the angelic spirits (الأرواح الملكية) that it did not possess. Yet, it does not know that there is a path through which, if traversed, one can receive directly from Allah, the Originator of all, and that there is a special door between Him and itself. So, it says: \"This is the ultimate goal, and there is nothing beyond these.\" It looks at its superiority over others of its kind and is content. Everything that comes from this path is of this description and state: it has absolutely no Divine Taste (ذوق إلهي) and only ever receives from the angelic intellects and spirits, receiving a state, not a verbal communication, unless an affair is embodied for it in its Imagination (خيال) and addresses it.\n\nThe follower of the Legal Path (صاحب الطريقة الشرعية) imitates the Lawgiver in what he informed him: that there is a God between whom and the cosmos there is no resemblance, and that He, exalted is He, <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), and He resembles nothing in the cosmos, neither its highest nor its lowest parts. Yet, despite all this, He has an eye and eyes, a hand and two hands, a face, speech, descent, establishment (استواء), joy, companionship with His servants (معية), nearness and distance, response to those who call upon Him, and Mercy. And that the entire cosmos are His servants, whom He created and favored some over others, and that He has Wrath (غضب), and that He has vicegerents (خلفاء) on Earth from this human species. When this believer hears this and knows that there is a vicegerent of his own species, he aspires to attain that rank. He sees the path legislated by the Lawgiver of his time, who addressed him with it. He sees that everything the soul that contemplated with its intellect was doing, this Lawgiver encouraged and praised. So, this believer adopts it because the Lawgiver brought it, and he attaches his aspiration to his Lord who brought him into existence, because the Lawgiver informed him that He is the ultimate end, saying to him: <<وَأَنَّ إِلَى رَبِّكَ الْمُنْتَهَى>> (And that to your Lord is the ultimate end). There is no goal beyond Allah. So, he makes Him the object of his goal and traverses the path of the contemplative researcher, the possessor of intellectual insight, but through the Legal Path (الطريق الشرعي). His soul is purified, his mirror is polished, and the forms of the entire spiritual cosmos are imprinted upon it. The people of contemplation only reach the limit of nature (الطبيعة) below the soul. Nothing above that is imprinted upon them unless their journey is upon the prescribed path. When this traveler on the path of the Law reaches this point, what is in the Preserved Tablet (اللوح المحفوظ) is imprinted upon him. He sees the rank of the Divine Laws (الشرائع), and he sees himself, his portion, his share, and his ultimate goal in the cosmos. He acts according to what he sees, rising in his quest to the specific Face (الوجه الخاص) belonging to him. He receives from The Real (الحق) through inspiration (إلهام), through Theophany (تجل), through transcendence (تنزيه), and through similitude (تشبيه). He witnesses the flow of Existence (سريان الوجود) in the possibles. He knows at that point to whom the judgment belongs in what has appeared, and who is the Manifest One (الظاهر) in whom these spiritual and natural judgments and differences appear. When these two individuals speak, the Perfect Man (الكامل من الرجال) knows the difference between the two persons and knows the source of the deficiency in the intellectual traveler compared to the rank of the legal follower. The contemplative person remains perpetually bowed (منكوس الرأس), awaiting spiritual aid. The follower of the Law remains perpetually bowed out of awe (حياء) of the Divine Theophany at times, and is like the bewildered, ecstatic, and stunned one when he sees Him in everything. He speaks only by Him, looks only to Him, and does not know that there is any entity other than Him. The High Assembly (الملأ الأعلى), the exalted spirits, the revolving spheres, and the swimming stars seek him out to deliver to him what they were entrusted with concerning what he deserves from them. They do not find anyone who receives from them through consideration and proper conduct, so they deliver it intrinsically, and he receives it from them intrinsically, while he is absent from all this by his Lord. When he is returned to the vision of his own essence, he sees in his essence everything that the entire cosmos, high and low, has given him, which belongs to him and is an entrustment with them. He thanks Allah for this and knows that everything in the universe is subjected to him and his likes, but they do not know it. When he attains this station, he sees that those who have been given Knowledge (العلم) are in degrees by which they surpass others of their kind. He sees that his likes are at his level, but they do not have this knowledge. So, he rejoices in his own essence and grieves for them, as they are in the same station as him but are unaware of it, and that he is only favored over them by the knowledge of Him, of them, and of the true nature of the matter. When he ascended these degrees—an ascent of unveiling (كشف), realization (تحقيق), and certain witnessing (معاينة يقينية)—he sought the source of these degrees he ascended and why he was singled out over most of his likes. The Real (الحق) then disclosed Himself to him through His Name, <<رَفِيعُ الدَّرَجاتِ>> (Exalter of Ranks), and that He is the One who casts the Spirit (الروح) from these degrees <<عَلَى مَن يَشَاءُ مِنْ عِبَادِهِ>> (upon whom He wills of His servants). He knew that he was one of those whom He willed of His servants. He compared the degrees with the degrees, and behold, they were the very same. He saw those degrees in the entire cosmos and that he was in them. He began to manifest himself to the cosmos through them, and the cosmos was unaware. He addresses every human being from the perspective of the degree he holds, saying: \"This is with me, and this is my doctrine and belief.\" No one in the cosmos denies him, nor does he deny anyone in the cosmos, while adhering to Divine Conduct (الأدب الإلهي). Only the possessor of the Station (صاحب المقام) adheres to this conduct, and the station of 'no station' is a station. As for the possessor of the State (صاحب الحال), due to his deficiency and his lower rank than the possessor of the Station, something may appear from him that leads the observer to know him. The Perfect One (الكامل) is colored by every form in the cosmos and conceals himself as much as he can. If someone sees him in a form that has changed for him due to the difference in creation, that observer believes him to lack the restriction that he himself holds, and thus accuses him of unbelief (كفر) and heresy (زندقة). He does not know the source of this judgment upon him. Therefore, the possessor of this station should never appear to two people in the same form, just as The Real never discloses Himself to two people in the same form. For the degrees are the degrees. If someone who does not see the variation of forms upon him accuses him of unbelief and heresy, that is due to his ignorance and envy. Thus, what he attributes to him is in the image of what he attributes to Allah, exalted and majestic, such as a consort, a son, or a partner—things which The Real has purified Himself from. This does not affect the possessor of this station; rather, he remains in his perfection, and the one who falls into this is among the slanderers. For he only judged him by what he witnessed of him, and he speaks with his tongue about him what he knows to be contrary in his own soul, out of injustice and arrogance, as Allah, exalted is He, said: <<وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنفُسُهُمْ ظُلْمًا وَعُلُوًّا فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِينَ>> (And they rejected them, while their souls were convinced of them, out of injustice and arrogance. So see how was the end of the corrupters). And such will be the end of this person. The degrees of The Real are what the cosmos is upon, and the possessor of this station has been distinguished in them when he distinguished them. He is the Manifest and the Hidden God (الإله الظاهر والباطن), the First in Existence (الوجود) and the Last in Witnessing (الشهود). And Allah <<غَنِيٌّ عَنِ الْعَالَمِينَ>> (is free from need of the worlds). The Name *Allah* does not admit of indefiniteness (تنكير). The Name *Ilah* (God) does admit of indefiniteness, so one says *ilah* (a god). Pay attention to what I have alerted you to, so that you may know the difference between your saying *Allah* and your saying *Ilah*. The gods (*aliha*) became numerous in the cosmos because they accept indefiniteness. *Allah* is One, known, and not unknown. Even the worshippers of gods acknowledged this, saying: <<مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى>> (We only worship them that they may bring us nearer to Allah in proximity). They did not say, \"to a great god who is greater than them.\" This is why they denied what the Prophet, peace and blessings be upon him, brought in the Quran and Sunnah—that He is a single God (*Ilah Wahid*)—in terms of applying the term *Ilah* to Him. They did not deny *Allah*. If they had denied Him, they would not have been polytheists (مشركين). With whom would they associate partners if they denied Him? They only associated partners with an *Ilah*, not with *Allah*. Understand this. So they said: <<أَجَعَلَ الْآلِهَةَ إِلَهًا وَاحِدًا إِنَّ هَذَا لَشَيْءٌ عُجَابٌ>> (Has he made the gods into one God? Indeed, this is a strange thing!). They did not say, \"Has he made the gods *Allah*?\" For *Allah* is not, in the view of the polytheists, a matter of making. Allah has protected this word (*Allah*) from being applied to anyone, but He has not protected the application of *Ilah*. I once saw a book by one of the people of unbelief, which he called *The Virtuous City*. I saw it in the hand of a person in Murshana al-Zaytun, and I had not seen it before. I took it from his hand and opened it to see what was in it. The first thing my eye fell upon was his statement: \"And I wish in this chapter to consider how we might establish a god (*ilahan*) in the world.\" He did not say *Allah*. I was astonished by that and threw the book back to its owner. To this day, I have not come across that book again. Whoever possesses insight and awareness should pay attention to what we have mentioned, for it is one of the most beneficial remedies for this destructive ailment. The Name *Ilah* is one of the aforementioned degrees, and it is indispensable, as the degrees are indispensable. From this chapter is the saying of the Samiri: <<هَذَا إِلَهُكُمْ وَإِلَهُ مُوسَى>> (This is your god and the god of Moses) regarding the calf. He did not say, \"This is the *Allah* to whom Moses calls you.\" And the saying of Pharaoh: <<لَعَلِّي أَطَّلِعُ إِلَى إِلَهِ مُوسَى>> (Perhaps I may look upon the God of Moses). He did not say, \"upon the *Allah* to whom Moses calls.\" And he said: <<مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي>> (I do not know of any god for you other than me). How excellent is this precision! Know that Pharaoh had knowledge of Allah, but leadership and the love of it overcame him in his worldly life. He said, \"I do not know for *you*,\" and did not say, \"I do not know for the cosmos,\" because he knew that his people believed him to be their god. So, he reported the state of affairs and was truthful in his report, for he knew that in their knowledge, they had no god other than Pharaoh. Since, in reality, there are degrees attributed to Allah by exaltation, by virtue of His being the Exalter of Ranks (رفيع الدرجات), the forms of Theophany (التجلي) multiply due to difference. For this reason, the Samiri spoke, saying: \"and the God of Moses,\" for the Divine Theophany only occurs for the *Ilah* and the *Rabb* (Lord), never for *Allah*. For <<فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ>> (Indeed, Allah is the Self-Sufficient). <<قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ>> (Say: He is Allah, [who is] One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent). And He, exalted is He, never discloses Himself to one person in the same form twice, nor to two people in the same form. For this reason, he said, \"and the God of Moses,\" for His Theophany to the Prophets is of varying forms, yet singular in ruling, in that He is the *Ilah* in whatever form He discloses Himself. Do you not see that on the Day of Resurrection, when He discloses Himself, He is denied and then recognized by the variation of forms? If you say, \"He returned to the form when He was denied so that He might be recognized,\" we say: If you knew His saying, \"Is there a sign between you and Him?\" That sign is the proof for them; wherever they see it upon Him, they know that He is their Lord. That sign was called a form, since every known thing is called a form. They recognized Him by the sign, not that He repeated the form to them. Rather, that form was the sign. The degrees of The Real have no end, because Theophany within them has no end. Since the subsistence of the cosmos has no end, the degrees have no end in both extremes—meaning the Pre-eternity (الأزل) and Post-eternity (الأبد) that appeared through the state, which is the cosmos. If the cosmos were to cease, Pre-eternity would not be distinguished from Post-eternity, as is the case in itself. There is no beginning (بدء) concerning The Real, and the negation of beginning concerning Him is a degree among His degrees by which He is exalted above resemblance to the cosmos. The degrees of the cosmos, which are the very degrees of The Real, have no end to their Post-eternity. Even if the descent of the cosmos is into one of these degrees, that degree is a beginning for the cosmos, because the degrees have a beginning. Rather, the manifestation of the cosmos within them has a beginning. Know that The Real, insofar as He is distinguished from creation, is an Isthmus (برزخ) between the Degrees (الدرجات) and the Depths (الدركات). For He described Himself as having two hands, and what is between the two hands is an Isthmus. What is on the right hand are the degrees of Paradise for its inhabitants, and what is on the other hand are the depths of the Fire for its inhabitants. The relation of the lower to Him is the same as the relation of the higher, for He is with His servants wherever they are. He is with them in their degrees and He is with them in their depths, as befits His Majesty. Know that among the degrees is the degree of Forgiveness (المغفرة), and they are two degrees: one is the veiling (ستر) of the sinners from being afflicted by the punishment of their sins, and the other degree is the veiling of them from committing sins. This veiling is the veiling of Infallibility (العصمة). Regarding the first veiling of forgiveness, He said: <<وَقِهِمْ عَذَابَ الْجَحِيمِ>> (And protect them from the torment of the Hellfire). And regarding the other veiling of forgiveness, He said: <<وَقِهِمُ السَّيِّئَاتِ>> (And protect them from evil deeds). There is no other veiling for forgiveness. The veil that separates the sinner and the torment is a veil of generosity, pardon, forgiveness, and overlooking. The veil that separates the servant and the sin is a veil of Divine Providence (عناية إلهية), distinction, and infallibility, which necessitates fear, hope, or shame, as came in the saying about Suhayb: \"Suhayb is an excellent servant; had he not feared Allah, he would not have disobeyed Him.\"\n\nThus, the cause of his infallibility from committing sin was his fear. If there were no fear, shame before Allah would prevent him from uttering what is called a sin concerning anyone, even if it were not a sin concerning him because he was only established in what was permissible for him. This is the ultimate Providence and infallibility from acting in the permissible. The greatest of sins is what kills the hearts, and they only die through the absence of knowledge of Allah, which is called ignorance (الجهل). For the heart is the house that Allah chose for Himself from this human constitution. This usurper (ignorance) seized it and came between it and its Owner. Thus, he was the most unjust of people to his own soul, because he deprived it of the good that would return to it from the Owner of this House had he left it for Him. This is the deprivation of ignorance. However, there is a subtle point here that should be noted: the possessor of the heart who sees that the heart encompasses his Lord, excluding the rest of his constitution, is lower in degree than one who sees that The Real is the very essence of his constitution without specialization, since The Real is his hearing, his sight, and all his powers. He is not specialized in anything over anything else. The possessor of the heart is vigilant over his heart, while the possessor of the other state judges by his Lord over everything. His Lord is concealed from him in that thing, yet He is witnessed by the possessor of this attribute in that concealment. He deals with it according to what is revealed to him. If it is revealed to him to unveil it, out of The Real’s care for this concealed one, He unveils it to him, expresses Himself to him, and makes him know what The Real is in it. If it is revealed to him to maintain the concealment, he maintains it and does not reveal anything of what the concealed one is in himself. The possessor of this attribute judges the possessor of the heart, but the possessor of the heart does not judge him, due to his preoccupation with guarding his heart, which is the house of his Lord, lest anyone other than his Lord enter it, for he is the Guardian and Gatekeeper (الحفيظ البواب). If you understand this, then consider which of the two men you will be. For this reason, the people of vigilance (المراقبة) remain perpetually veiled from acting in the cosmos, and they are the people of limits (أهل الحدود) in Allah. If they rise above the vigilance of their hearts, which is the greatest of veils, and extend their vigilance over their hearts to the vigilance of the entire cosmos, the field expands for them. But they do not have the ruling of the possessor of that attribute we mentioned, for they are vigilant over Him because He is vigilant over them, for He is a Guardian (رقيب) over everything. They reciprocate preservation with preservation, a correspondence of likes in balance and conformity. Just as He watches them with His Eye, this vigilant one also watches Him with his eye. Whoever is entirely The Real in himself and in the cosmos departs from the attribute of vigilance, for it is a station of journeying (سلوك) and a highway. If you journey in it by Him, and from Him to Him, there is no one to be vigilant over, since there is no fear on that path of an impediment preventing the traveler. It is a journey without vigilance. This station includes the science of the lowering of veils (إسبال الستور) and upon whom they are lowered. The veil may be lowered for the purpose of veneration, like the curtain and the veil behind which is the king or the secluded woman. The veil is also lowered before one who is not approved for the unveiling of what is behind the veil. And veils may be lowered as a mercy to those before whom they are lowered, like the Divine Veils (الحجب الإلهية) between the cosmos and Allah, to preserve them lest the splendors of the Face burn them. Thus, it includes the knowledge of why they are lowered and upon whom they are lowered. In it is the knowledge of the forms of the composition of Divine Speech (الكلام الإلهي) with His Oneness (أحديته)—from where the composition is accepted, when it is nothing but a single Essence (واحد العين)—so that the knowing human distinguishes between the reality of Speech and what is spoken by one who has the attribute of speech, and knows that the composition is in what is spoken, not in the Speech itself. The knowledge of this type of information is a precious knowledge, specialized only for the scholars of Allah who heard the Speech of Allah in the Fixed Entities (أعيان الممكنات). In it is the knowledge of the recipient and what is received from Him, and the acceptance (القبول) which is the attribute of the recipient. Does acceptance vary due to the variation of the recipient, or does the recipient have no effect on it? In it is the knowledge of the Divine Limits (الحدود الإلهية): to what do they return? To themselves in their essence, or to Allah, or to the possibles (الممكنات) which are the cosmos? In it is the knowledge of the attributes of the disputants who know The Real but conceal it, such as the jurists who adhere to a school of thought they do not believe to be sound, yet they argue for it while knowing its invalidity. And the opponent who confronts him brings The Real against his invalidity, and this other one knows that The Real is with his opponent, yet he rejects it and makes falsehood appear in the form of truth, knowingly. Are he and the one who thinks falsehood is truth, and defends it because he believes it to be true, equal? What is the judgment of these people with Allah on the Day of Resurrection? Do they have a Divine basis or not? In it is the knowledge of the difference between denial (الإنكار), rejection (الجحد), and lying (الكذب). Are all of these non-existent (عدمي) or existent (وجودي) matters? If existent, in which level of the Levels of Existence (مراتب الوجود) is it? Does it encompass all of them, or is it in some of them? Likewise, if it is non-existent, in which level of the Levels of Non-existence (مراتب العدم) is it? Is it in the level of non-existence that does not accept existence, or is there no non-existence except that it accepts a relation to an existential level? Or is it in the level of non-existence whose described object accepts existence, which is the possible non-existence? In it is the knowledge of the weaker one seeking to harm the stronger one: is this due to a real strength, in which case he is not weaker, or is it due to an imagined strength, in which case he is weaker in reality but does not know it? What conceals him from his weakness? In it is the knowledge of one who is ignorant of the measure of things and what they deserve: what is the reason that made him ignorant of that, such that what is inappropriate appears from him in what is inappropriate? In it is the knowledge of the ranks of the Angels in what they mention of the cosmos before Allah, since they have Divine Proximity (القرب الإلهي) and are the intermediaries between Allah and His creation. They are in the middle in the testimony of Unity in His saying: <<شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ>> (Allah witnesses that there is no god but He, and the Angels, and those of knowledge). In it is the knowledge of preference (المفاضلة) in everything between Allah and His creation. In it is the knowledge of what the acknowledgment of The Real produces before Allah. In it is the knowledge of judgment by choice: does it impair justice or not? In it is the knowledge of the difference between one who knows a thing after ignorance and one who knows it after forgetfulness. What is the attribute of the people of remembrance compared to others? In it is the knowledge of sincerity (الإخلاص): from whom or concerning whom? In it is the knowledge of what is disliked and what is loved: is the very thing that Zayd dislikes the very thing that Amr loves, or not? In it is the knowledge of what The Real is singled out for, excluding creation: is that known or not? Is it possible to reach it through Divine Providence (عناية إلهية) of definition or not? And what is the impediment if that is impossible? In it is the knowledge of the station and rank of the just Imam. In it is the knowledge of the states of those veiled from Allah by darkness but not light, and the knowledge of those veiled from Allah by light but not darkness, and the knowledge of those veiled from Allah by both light and darkness. Are these veils a mercy to the veiled ones, or veils of distance? In it is the knowledge of the obligations directed toward the limbs. In it is the knowledge of consideration (الاعتبار) and contemplation (التفكر). In it is the knowledge of the support of the people of Divine Providence: with what does He support them? In what place does He support them? And what is the reason necessitating the domination of their enemies over them and their ability to overpower them? And upon what does the aggressor rely? Does he rely on an existential Divine matter or an existential psychic matter? In it is the knowledge of what you, when you see it, say is true, then you say it is false, then you say it is false truth, then you say it is neither false nor true, then you say, \"I do not know what it is.\" Is his return to ignorance of it the very essence of knowledge of that matter, or is it possible to reach knowledge of it, but this person did not reach it, so he spoke of its attribute, not the attribute of what he spoke about? In it is the knowledge of fairness without fanaticism, and its presence, and the calming of the angry one's wrath by the gentleness of the calmer, not by coercion, for coercion does not calm wrath, but only conceals its effect due to the authority of coercion over it. In it is the knowledge of the Angels' encompassing the cosmos on the Day they line up, and they are in that form today. And the knowledge of the difference between their judgment over us today and their judgment on that Day, while the attribute of encompassing is the same. And why do some of them call out to others there, while here it is not so, except in specific places? For the Resurrection is exactly in the image of the world, except that the Ruler there is the One, due to the lifting of intermediaries, and here He is the same One Ruler, but through intermediaries, to distinguish between the two abodes, just as He distinguished between the two handfuls by Paradise and the Fire. In it is the knowledge of one who dictates judgment to Allah: from where does he dictate it? And what emboldened him to do that? Is it a true attribute or an attribute of ignorance? In it is the knowledge of Divine Providence for the tyrants and the arrogant. In it is the knowledge of what Allah has protected of the Divine Names: why did He protect it? And what He did not protect of the Divine Names, such as His Name *Al-Ahad* (The One), in which He does not disclose Himself, and in which Theophany is not sound, nor in the Name *Allah*. As for the Names other than these two that are known to us, Theophany occurs in them. In it is the knowledge of movement in the very essence of stillness. In it is the knowledge of the commonality between the believer and the scholar (العالم): in which Presence (حضرة) does that occur? And by what are they distinguished? Does the believer attain the degree of the scholar? Does what he accepts from the truthful report elevate him to the degree of the scholars or not? Does the proof for the truthfulness of the Messengers in their claim that they are Messengers extend to the proof of the reports and rulings they brought, or do they require another proof? Or can they be scholars while being imitators? In it is the knowledge of the cycle (الدور) in which the caller becomes the called by the one he called, by the rule of contradiction. In it is the knowledge of the ruling of seeking salvation (النجاة) in the entire cosmos by nature, but it is unknown. And who is the category of people in the cosmos who know it? And what is salvation? In it is the knowledge of the sign of every caller and what he calls to of the Divine Names. In it is the knowledge of the time when a person casts away what is in his hand, relies on it no longer, and submits all his affairs to Allah. In it is the knowledge of the bowstring and the return of the arrows to their shooter. I witnessed this archer in the city of Tlemcen, a master of the craft of archery and the making of bows and arrows. I saw him shoot an arrow, and when the arrow reached its target, it returned to the shooter alone. That was a lesson for me regarding the return of deeds to their doers. In it is the knowledge of what takes the place of time but is not time. In it is the knowledge of contention after the judge's ruling, and its cause, since it has no effect in overturning the ruling. In it is the knowledge of the ranks of witnessing from the judge, and the judge abandoning his ruling based on what he knows and ruling based on the testimony of witnesses. And what is the reason for establishing that in the cosmos? However, this is only applicable to us in matters of wealth, not in souls or in the establishment of legal penalties (الحدود). In it is the knowledge of what cannot be delayed due to pressing need, and what is the benefit of the clarification (البيان) established for the attainment of knowledge, yet the ruling based on it is abandoned? And in which cases does this occur? And who is correct in this matter: the one who says he rules by his knowledge, or the opponent? In my view on this matter, if I knew a matter, and witnesses testified contrary to my knowledge, and I am not permitted to rule by my knowledge if I am one who holds that view, I would appoint someone else to judge who has no knowledge of the matter, and I would refrain from judging it. This is the correct approach in my view, and what I act upon, even if there is something in the soul about it. This is my view regarding judgment in matters of wealth. As for judgment in matters of bodies, I only rule by my knowledge if I know the innocence. If there is no innocence, and I know the truthfulness of the slanderer, I rule by the testimony and abandon my knowledge. The reason for this approach I have taken is contained within this station. In it is the knowledge of what the cosmos (العالم) excels the human (الإنسان) in, which is that it has a birth over him. In it is the knowledge of the designation of the Hour (الساعة). In it is the knowledge of whether arrogance (التكبر) is sound from the scholar toward Allah or not. In it is the knowledge of what things seek intrinsically: is it sound for the custom to be broken (خرق العادة) in this, so that it occurs by making, or not? And if the custom is broken in it, what is the locus of the breaking of the custom? Is it in the seeker, so that what his essence required follows him, or not? In it is the knowledge of the Presence (حضرة) of confirming blessings upon the recipient of the blessing: does this occur by way of instruction or by his denial of it? In it is the knowledge of the origin of the sensory and spiritual life of the cosmos: do they return to a single origin or not? And is there life in nature (الطبيعة) such that it gives sensory life or not? In it is the knowledge of the worldly human constitution and its states during its duration in this abode, and what its bodily matter returns to after death. In it is the knowledge of Death and Life: are they a relation or an existing essence that appears in different places? And does the ruling of the Giver of Death (المميت) cause death by a death, so that it is a cause, or does He only cause death? Likewise, Life. So that the essence of the dead is the essence of death by the ruling of the Giver of Death. In it is the knowledge of Divine Decree (القضاء) and its superiority over Divine Measure (القدر). In it is the knowledge that the sign (الآية) brought by the Messenger is not a condition, and he is not obligated to bring it. In it is the knowledge of Allah's consideration for His servants despite their poor conduct toward Allah. In it is the knowledge of the generality of the benefit of Faith (الإيمان) in the Hereafter. And <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "## باب نمبر تین سو چوالیس: مغفرت کے اسرار میں سے دو پردوں کے مقام کی معرفت، اور یہ مقام حضرت محمدیہ سے ہے\n\nمیں نے ایسے لوگ دیکھے جو کافر کو نہیں دیکھتے\nاور نہ ہی جھوٹے کو، اور معاملہ سچائی اور ایمان کا ہے\n\nتو میں نے ان سے کہا کہ جھوٹ سے باز آؤ، کیونکہ یہ ایک مقام ہے\nلیکن اس میں کمی اور نقصان ہے\n\nپس وجود میں ہر آنکھ مختلف نہیں ہے\nاور نہ ہی ہر کائنات جو اللہ کے سوا ہے، وہ انسان ہے\n\nلیکن اس میں سے ایک بڑا اور مقدم ہے\nاور اس میں سے ایک چھوٹا ہے جس میں حق بھی ہے اور باطل بھی\n\nاگر میرا وجود نہ ہوتا تو وہاں کوئی عالم نہ ہوتا\nاور نہ ہی کوئی اسماء ہوتے اور نہ ہی کوئی اعیان (حقائق) ہوتے\n\nاور وہ ذات واحد ہوتی، نہ خالق ہوتی\nاور نہ ہی مالک، اس پر دلیل گواہی دیتی ہے\n\nاور عقل کی دلیل ہر حالت میں یہ بتاتی ہے\nکہ مخلوق کا معبود، مخلوق میں احسان کرنے والا ہے\n\n### [بے شک اللہ کی رحمت عامہ اور رحمت خاصہ ہے]\n\nہم پہلے بیان کر چکے ہیں کہ اللہ کی رحمت عامہ بھی ہے اور رحمت خاصہ بھی، اور اللہ نے اس امت کو ایک خاص رحمت سے نوازا ہے۔\n\nچنانچہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"بے شک میری امت ایک مرحومی (رحم کی ہوئی) امت ہے، اس پر آخرت میں کوئی عذاب نہیں ہوگا، اس کا عذاب دنیا میں ہی زلزلوں، قتل اور بلاؤں کی صورت میں ہے۔\" یہ حدیث بیہقی نے کتاب الأدب میں اس باب میں نقل کی ہے کہ مومن خیر کے ارادے سے بلا سے کم ہی خالی ہوتا ہے، یہ حدیث ابوالقاسم علی بن محمد بن علی الایادی کی سند سے، ابوجعفر عبداللہ بن اسماعیل سے املاء کے ذریعے، انہوں نے اسماعیل ابن اسحاق القاضی سے، انہوں نے محمد بن ابی بکر سے، انہوں نے معاذ بن معاذ سے، انہوں نے مسعودی سے، انہوں نے سعید بن ابی بردہ سے، انہوں نے اپنے والد سے، انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی ہے کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے یہ حدیث بیان فرمائی۔ ان سب نے \"حدثنا\" (ہم سے بیان کیا) کہا سوائے مسعودی کے، جنہوں نے \"عنعنہ\" (عن کہہ کر) روایت کی، اور نہ ہی بیہقی نے، جنہوں نے \"أخبرنا\" (ہمیں خبر دی) کہا۔ اور اسی باب میں ابوبردہ سے روایت ہے کہ انہوں نے کہا: میں ابن زیاد کے پاس بیٹھا تھا اور ان کے پاس عبداللہ بن یزید بھی تھے، تو خوارج کے سر لائے جانے لگے، راوی نے کہا: جب بھی کوئی سر گزرتا تو میں کہتا: جہنم کی طرف! تو انہوں نے مجھ سے کہا: اے میرے بھتیجے! ایسا نہ کہو، کیونکہ میں نے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کو فرماتے سنا ہے کہ اس امت کا عذاب اس کی دنیا میں ہوگا۔\n\nاور صحیح حدیث میں رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم سے یہ بھی وارد ہے کہ آپ نے فرمایا: \"جہاں تک اہل نار کا تعلق ہے جو اس کے اہل ہیں، تو وہ اس میں نہ مریں گے اور نہ ہی زندہ رہیں گے، لیکن کچھ لوگ ایسے ہیں جنہیں ان کے گناہوں کی وجہ سے آگ پہنچے گی۔\"\n\nاور آپ صَلَّى اللهُ عَليهِ وسَلَّم نے کسی خاص امت کی تخصیص نہیں فرمائی، کیونکہ آپ نے یہ نہیں فرمایا کہ \"میری امت کے کچھ لوگ\"، لہٰذا یہ ان لوگوں کے لیے رحمت عامہ ہے جو اہل نار میں سے نہیں ہیں۔\n\nپھر آپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"تو اللہ انہیں اس میں موت دے دے گا۔\"\n\nآپ نے اس کی تاکید مصدر (إماتة) سے فرمائی۔ یہ سب موت کے ذبح ہونے سے پہلے ہوگا، اور اللہ انہیں موت اس لیے دے گا تاکہ وہ اس چیز کا احساس نہ کریں جو آگ ان میں سے کھا رہی ہے۔ کیونکہ کامل نفوس وہی ہیں جو موحد اور مومن ہیں، اور توحید و ایمان ان سے درد اور عذاب کے قیام کو روکتے ہیں۔ اور حواس، یعنی تمام اجسام، اللہ کے مطیع ہیں، لہٰذا وہ جلنے کے درد کو محسوس نہیں کریں گے جو انہیں کوئلہ بنا دے گا۔ کیونکہ میت اس چیز کو محسوس نہیں کرتی جو اس کے ساتھ کیا جاتا ہے، اگرچہ وہ اسے جانتی ہو۔ پس ہر وہ چیز جو معلوم ہو، محسوس نہیں ہوتی۔ لہٰذا اللہ نے موحدین اور مومنین سے عذاب اٹھا لیا، اگرچہ وہ جہنم میں داخل ہوں۔ اللہ نے انہیں جہنم میں صرف اس لیے داخل کیا تاکہ کلمہ الٰہی کی تصدیق ہو جائے اور ان لوگوں کے درمیان تمیز ہو جائے جنہوں نے برے اعمال کیے اور ان لوگوں کے درمیان جنہوں نے نیک اعمال کیے۔ پس یہ ایک صحیح حدیث ہے جو تمام لوگوں کو شامل ہے، اور اہل نار پر عذاب باقی رہے گا جو اس کے اہل ہیں، یہ ایک مقررہ مدت تک جاری رہے گا جو اللہ کے ہاں معلوم ہے، یہاں تک کہ عذاب کے انیس (۱۹) فرشتے انہیں یاد کریں گے۔ کیونکہ جب فرشتے شفاعت کریں گے تو یہ انیس فرشتے شفاعت نہیں کریں گے، ان کی شفاعت اس وقت تک مؤخر رہے گی جب وہ رحمت کے وصف سے متصف ہوں گے، جب ان کا اللہ کے غضب کا مشاہدہ ختم ہو جائے گا، کیونکہ وہ مخلوق پر اللہ کی جناب کو ترجیح دیتے ہیں۔ بے شک فرشتے قیامت کے دن شفاعت کریں گے، اللہ فرمائے گا: فرشتوں نے شفاعت کی، نبیوں نے شفاعت کی، اور مومنوں نے شفاعت کی، اور اب ارحم الراحمین باقی ہے۔ تو وہ شدید العقاب (سخت سزا دینے والے) اور المنتقم (انتقام لینے والے) کے وقت شفاعت کرے گا۔ اور یہ اسماء الٰہیہ کی شفاعت کے باب میں سے ہے، تو ہر وہ موحد جو اللہ کی توحید کا قائل ہوا، اپنے علم کی رو سے نہ کہ اپنے ایمان کی رو سے، اور اس کے پاس اس کے علاوہ کوئی نیک عمل نہیں تھا، لیکن وہ بغیر ایمان کے تھا، تو اسی لیے اللہ نے اسے خاص کر لیا۔ اور موحدین کا یہ گروہ وہ ہے جنہوں نے اللہ سبحانہ اور فرشتوں کی گواہی کے ساتھ گواہی دی کہ: **أَنَّهُ لا إِلهَ إِلَّا هُوَ** (بے شک اس کے سوا کوئی معبود نہیں)۔ پس اسی وجہ سے ان کے لیے عنایت سبقت لے گئی کہ وہ اس شہادت میں شریک ہوئے، اور انہیں اللہ کے سوا کوئی نہیں جانتا، اور اگر فرشتے انہیں جانتے بھی ہیں تو فرشتے اللہ کے حکم کے تحت ہیں جیسے کہ جن و انس، تو وہ اللہ کی جناب کا احترام کرتے ہیں اور ان لوگوں پر اسے ترجیح دیتے ہیں، لہٰذا وہ ان کے حق میں شفاعت کرنے کی جرات نہیں کرتے کیونکہ انہوں نے اللہ کے حکم کی مخالفت کی اور ایمان قبول نہیں کیا۔ پس اللہ سبحانہ و تعالیٰ ارحم الراحمین ہونے کی حیثیت سے تنہا ان لوگوں کو آگ سے نکالے گا، اور اہل نار کو ان کی حالت پر چھوڑ دے گا یہاں تک کہ وہ رضا کی صورت میں تجلی فرمائے اور عالم ترکیب میں مرکوز رحمت کا حکم عام ہو جائے اور عذاب کے فرشتوں کی شفاعت ہو، تب اہل نار کی حالت بدل جائے گی جیسا کہ ہم نے گرمی اور سردی سے متاثر ہونے والے کے بارے میں ذکر کیا۔\n\n### [یہ کہ اعتدال کے حکم سے موازنہ معقول ہے لیکن اس کا حکم موجود نہیں]\n\nاور جان لو کہ اعتدال کے حکم سے موازنہ معقول ہے لیکن اس کا حکم موجود نہیں، کیونکہ اگر اس کا کوئی حکم ہوتا تو تخلیق واقع نہ ہوتی، کیونکہ اس کا حکم اعتدال ہے اور اعتدال میلان (جھکاؤ) کے مقابل ہے، اور تخلیق میلان کے بغیر نہیں ہو سکتی۔ اور جب نبی صَلَّى اللهُ عَليهِ وسَلَّم کو اللہ کی طرف سے یہ علم ہوا کہ اس نے عالم کو دونوں امکانات میں سے ایک کو ترجیح دے کر ہی وجود بخشا ہے،\n\nتو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے قرض کے قاضی سے فرمایا: \"جب تم وزن کرو تو جھکاؤ (ترجیح دو)۔\"\n\nکیونکہ ممکن میں دونوں پہلو برابر ہوتے ہیں، تو اللہ نے اسے ترجیح دے کر ہی وجود بخشا۔ پھر اللہ نے اپنے بارے میں وہ ذکر کیا جس پر وہ تھا اور کوئی عالم نہیں تھا، تو اس نے اپنے بارے میں ذکر کیا کہ اس نے چاہا کہ وہ پہچانا جائے، تو اس نے اپنی معرفت کے پہلو کو اس کے مقابل پر ترجیح دی، پس اس نے علم کے پہلو کو اس کے مقابل پر ترجیح دے کر عالم کو خلق کیا۔ پس جب اللہ نے رحمت اور غضب کے درمیان موازنہ کیا تو رحمت نے ترجیح پائی اور بھاری ہو گئی، اور غضب الٰہی اٹھ گیا، اور کسی چیز کے اٹھ جانے کا مطلب اس کے حکم کا زائل ہو جانا ہی ہوتا ہے۔ پس انجام کار میں غضب الٰہی کا کوئی حکم باقی نہیں رہا، کیونکہ انجام کار میں رحمت کو ترجیح ملی اور غضب اپنی ہلکی پن کی وجہ سے اٹھ گیا۔ پس غضب کا حکم صرف اس وقت ظاہر ہوا جب غضب اور رحمت کو میزان میں رکھا گیا، تو ان میں سے ہر ایک کا حکم عالم میں رہا یہاں تک کہ ترجیح ظاہر ہو گئی، تو غضب کا حکم اٹھ گیا۔ اور ہم نے یہ بات صرف اس شخص کے رد میں کہی ہے جو کشف کا دعویٰ کرتا ہے اور کہتا ہے کہ الٰہی موازنہ میں اللہ اپنے عدل کو اپنے فضل میں اور اپنے فضل کو اپنے عدل میں حکم نہیں دیتا، اور یہ کہ دونوں مٹھیاں ہر لحاظ سے برابر ہیں۔ اور یہ اہل کشف پر آنے والی سب سے بڑی غلطی ہے جو استاد کی کمی کی وجہ سے ہوتی ہے۔ اور یہ بات وہی کہتا ہے جو کسی ایسے استاد کے سامنے نہ بیٹھا ہو جس کی تربیت کسی ایسے استاد نے کی ہو جو شریعت پر عمل کرنے والا ہو اور شرعی احکام کے مصادر و موارد سے واقف ہو۔ کیونکہ اللہ نے اپنی معرفت کی طرف کوئی ایسا راستہ مقرر نہیں کیا جسے عقل اپنے فکر سے ادراک کرنے میں خود کفیل ہو، سوائے اس کے جو اس نے اپنے بندوں کے لیے اپنے رسولوں اور نبیوں کی زبانوں پر مشروع کیا ہے۔ اور ہم نے یہ بات اس لیے کہی کہ ہم جانتے ہیں کہ ایک اور راستہ بھی ہے جو وجود کا تقاضا ہے اور جسے بعض فاضل نفوس حاصل کرتی ہیں۔ تو ہم نے چاہا کہ اس اشکال کو دور کریں۔ اور وہ یہ ہے کہ نفوس ریاضت، طبعی شہوات کو ترک کرنے اور محسوسات میں مستغرق ہونے سے صاف ہو جاتی ہیں، اور اس چیز کی طرف مشتاق ہوتی ہیں جہاں سے وہ آئی ہیں، اور جس کے لیے وہ مطلوب تھیں، اور ان کا انجام کیا ہے، اور عالم میں ان کا مرتبہ کیا ہے۔ اور اس نے اپنی ذات سے یہ جان لیا کہ اس جسم کے پیچھے کوئی اور امر ہے جو اسے حرکت دیتا ہے اور اس کی تدبیر کرتا ہے، جب اس نے اس پر نازل ہونے والی موت کا مشاہدہ کیا۔ تو وہ اپنے آلات کو کمال پر دیکھتی ہے لیکن اس میں وہ ادراکات نہیں دیکھتی جو اسے زندگی کے وقت حاصل تھے، تو اس نے جان لیا کہ وہاں کوئی اور امر ضرور ہے، لیکن وہ نہیں جانتی کہ اس کا اس جسم سے کیا تعلق ہے، کیا وہ عرض کا اپنے محل سے تعلق ہے، یا متمکن کا اپنے مکان سے، یا بادشاہ کا اپنی بادشاہت سے؟\n\n### [یہ کہ موت اور نیند کے درمیان فرق ہے]\n\nپھر اس نے جان لیا کہ موت اور نیند کے درمیان فرق ہے، اس چیز سے جو وہ نیند میں صورتوں کی شکل میں دیکھتی ہے، اور ان لذت بخش اور تکلیف دہ احوال سے جو وہ حاصل کرتی ہے، اور سونے والے کی صورت میں ایک حال سے دوسرے حال میں تیزی سے تبدیلی سے، اور اس نے یہ جسم کی صورت میں نہیں دیکھا۔ پھر وہ بیدار ہوتی ہے تو جسم کو اپنی صورت میں اسی حال پر دیکھتی ہے، کوئی تبدیلی نہیں آئی۔ اور وہ بعض اوقات جسم کے انفعال کو دیکھتی ہے جو سونے والے کو نیند کی حالت میں پیش آتا ہے، جیسے احتلام میں پانی کا نکلنا جب وہ نیند میں جماع دیکھتا ہے۔ تو اس سب سے اس نے جان لیا کہ اس جسم کے پیچھے کوئی اور امر ہے جس کا اس صورت سے تعلق ہے۔ پھر اس نے علوم اور فہم میں مثالوں کا تفاوت دیکھا، اور بعض کا تعلیم کی محتاج ہونا دیکھا، اور اس شخص کی حالت پر غور کیا جس نے زہد اختیار کیا، فکر کی، خلوتیں اختیار کیں، اور محسوسات کی لذتوں میں سے صرف وہی لیا جس کی ضرورت تھی جس سے اس جسم کا قیام ہو، اور یہ کہ اس حال والا شخص دوسرے نفس پر علوم اور فضائل میں بڑھ جاتا ہے جس میں وہ اس کا محتاج ہوتا ہے اور ان علوم کا محتاج ہوتا ہے۔ تو اس نے اس راستے پر غور کیا جس نے ان نفوس کو دوسروں کے بجائے اس مقام تک پہنچایا، تو اس نے کوئی رکاوٹ نہیں دیکھی سوائے اس کے کہ بعض نفوس ان ظاہری طبعی خواہشات کے حصول اور ان میں مقابلہ کرنے میں مشغول ہو گئے تھے۔ تو اس نے ان سب سے زہد اختیار کیا اور اخلاق حسنہ سے آراستہ ہوئی، اور کسی کو اپنے اوپر کوئی مطالبہ یا تعلق نہیں چھوڑا، اور نہ ہی ان چیزوں میں ان سے مقابلہ کیا جن پر وہ تھے، اور خلوتوں کی طرف مائل ہوئی، اور ہمت کو اس چیز کے جاننے کی طرف بلند کیا کہ معاملہ کیا ہے۔ جب وہ اس مقام پر پہنچی، اور یہ سب اس کا اپنا غور و فکر تھا، نہ کہ کسی شرع الٰہی کی تقلید، بلکہ یہ ایک صحیح فکر اور ایک ناقص غیر کامل الٰہی الہام سے تھا۔ کیونکہ کامل الہام یہ ہے کہ اسے شریعت کی پیروی اور اس کے کلام اور ان کتابوں پر غور کرنے کا الہام ہو جن کے بارے میں ہمیں بتایا گیا ہے کہ وہ اللہ کی طرف سے آئی ہیں۔ تو ایسا الہام ہی اکمل الہام ہے۔ جب یہ نفس صاف ہو گیا اور چمک گیا اور آئینے کی طرح ہو گیا اور اس سے اس طبیعت کا زنگ دور ہو گیا، تو اس میں عالم کی صورتیں نقش ہو گئیں، تو اس نے وہ دیکھا جو اس نے پہلے نہیں دیکھا تھا، تو اس نے غیب کی باتیں کیں اور ملاء اعلیٰ سے ایک عجیب الحاق کے ساتھ مل گیا، جو اپنے مقام پر نہیں لوٹا، حالانکہ وہ اس کا مقام ہے، لیکن اس نے اپنی غربت کی وجہ سے اسے نہیں پہچانا، جب وہ اپنی طبیعت اور بدن کی سرزمین کی طرف سفر کر چکا تھا۔ تو اسے وہ ناز اور اس عالم سے کامل انس حاصل نہیں ہوا، اور اس نے دیکھا کہ وہ عالم اس سے ہٹ کر تسبیح و تقدیس میں مشغول ہے، اور ان عنصری مولدات کے حق میں جو اعمال ان کے سپرد کیے گئے ہیں۔ تو اس نے وہ دیکھا جو ان میں سے افلاک کو حرکت دینے اور ان کے ستاروں کو چلانے سے خاص ہے، اور جو ارکان میں سے پیدا ہوتا ہے، اور اس نے وہ جان لیا جو وہ پہلے نہیں جانتی تھی، اور ملکی ارواح سے ایسے علوم حاصل کیے جو اس کے پاس نہیں تھے، اور اسے یہ علم نہیں ہوا کہ کوئی ایسا راستہ بھی ہے جس پر چل کر وہ سب کے خالق اللہ سے حاصل کر سکتی ہے، اور یہ کہ اس کے اور اس کے درمیان ایک خاص دروازہ ہے جو اس کے لیے مخصوص ہے۔ تو اس نے کہا کہ یہی انتہا ہے اور ان کے سوا کوئی نہیں ہے۔ اور اس نے اس سے اپنے ہم جنسوں پر اپنی برتری دیکھی، تو وہ قناعت کر گئی۔ پس جو کچھ بھی وہ اس طرح لاتا ہے، اس کی صفت اور حال یہی ہے کہ اسے کوئی الٰہی ذوق بالکل حاصل نہیں ہوتا، اور وہ ہمیشہ صرف ملکی ارواح اور عقول سے ہی حاصل کرتا ہے، حال کا حاصل کرنا، نہ کہ کلام کا حاصل کرنا، سوائے اس کے کہ اس کے خیال میں کوئی چیز مجسم ہو جائے جو اس سے مخاطب ہو۔ اور شرعی طریقہ والا شخص شارع کی تقلید کرتا ہے اس چیز میں جو اس نے اسے خبر دی کہ اس کے اور عالم کے درمیان کوئی معبود نہیں ہے جس سے مناسبت ہو، اور یہ کہ وہ **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (اس کی مثال کوئی چیز نہیں) اور وہ عالم کی کسی چیز سے مشابہت نہیں رکھتا، نہ اس کے اوپر والے سے اور نہ اس کے نیچے والے سے۔ اور اس سب کے باوجود اس کی آنکھ اور آنکھیں ہیں، ہاتھ اور دو ہاتھ ہیں، چہرہ اور کلام ہے، نزول اور استواء ہے، خوشی اور اپنے بندوں کے ساتھ صحبت کی معیت ہے، قرب اور بعد ہے، اور دعا کرنے والے کی اجابت ہے، اور رحمت ہے۔ اور یہ کہ سارا عالم اس کے بندے ہیں، اس نے انہیں پیدا کیا اور بعض کو بعض پر فضیلت دی، اور یہ کہ اس کا غضب ہے، اور یہ کہ اس کے زمین میں اس نوع انسانی میں سے خلفاء ہیں۔ جب اس نے یہ سنا اور جان لیا کہ اس کی نوع میں سے کوئی خلیفہ ہے، تو اس نے اس مرتبے کو حاصل کرنے کی آرزو کی، اور اس راستے کو دیکھا جو اس وقت کے شارع نے مشروع کیا اور اس سے خطاب کیا، اور اس نے دیکھا کہ وہ تمام کام جو اس نفس نے کیے جس نے اپنے غور و فکر سے سوچا تھا، اس شارع نے اس پر ابھارا اور اس کی تعریف کی اور اس کے بارے میں کہا۔ تو اس مومن نے اسے اس حیثیت سے اختیار کیا کہ یہ شارع اسے لایا ہے، اور اس نے اپنی ہمت کو اپنے رب سے جوڑ لیا جس نے اسے وجود بخشا، جب شارع نے اسے بتایا کہ وہ ہی انتہا ہے، تو اس نے اسے فرمایا: **وَأَنَّ إِلى‏ رَبِّكَ الْمُنْتَهى‏** (اور بے شک تیرے رب ہی کی طرف انتہا ہے)۔ اور اللہ کے پیچھے کوئی منزل نہیں ہے۔ تو اس نے اسے اپنی غایت کا مقام بنا لیا، اور اس نے مفکر، محقق، عقلی نظر والے کی طرح سلوک کیا، لیکن شرعی طریقے سے۔ تو اس کا نفس صاف ہو گیا اور اس کا آئینہ چمک گیا، اور اس میں پورے روحانی عالم کی صورتیں نقش ہو گئیں، اور فکر والے لوگ اس حد تک پہنچتے ہیں جو نفس سے کم ہے، اور ان میں اس سے اوپر کی کوئی چیز نقش نہیں ہوتی سوائے اس کے جس کا سلوک مشروع طریقے پر ہو۔ پس جب یہ سالک شرعی طریقے پر پہنچتا ہے، تو اس میں وہ سب کچھ نقش ہو جاتا ہے جو لوح محفوظ میں ہے، تو وہ شرائع کا مرتبہ دیکھتا ہے، اور اپنے آپ کو، اپنا حصہ، اپنا نصیب اور عالم سے اپنی غایت دیکھتا ہے، تو وہ اس کے مطابق عمل کرتا ہے جو وہ دیکھتا ہے۔ تو وہ طلب کے ذریعے اپنے خاص چہرے کی طرف بلند ہوتا ہے، تو وہ حق سے الہام کے ذریعے، تجلی کے ذریعے، تنزیہ کے ذریعے، اور تشبیہ کے ذریعے حاصل کرتا ہے، اور وہ ممکنات میں وجود کے سرایت کرنے کا مشاہدہ کرتا ہے، اور اس وقت جانتا ہے کہ جو کچھ ظاہر ہوا ہے اس میں حکم کس کا ہے، اور وہ ظاہر کون ہے جس میں یہ احکام اور روحانی و طبعی اختلافات ظاہر ہوتے ہیں۔ پس جب یہ دونوں شخص بولتے ہیں، تو کامل مرد ان دونوں شخصوں کے درمیان فرق جان لیتا ہے، اور جان لیتا ہے کہ ہر ایک پر کہاں سے آیا، اور کیوں فکر کے ذریعے سلوک کرنے والا شرعی طریقے والے کے مرتبے سے کم رہا۔ پس فکر والا ہمیشہ سر جھکائے رہتا ہے، روحانی امداد کا انتظار کرتا رہتا ہے جو اس کے پاس آئے، اور شرعی طریقے والا ہمیشہ سر جھکائے رہتا ہے، اوقات میں الٰہی تجلی سے حیا کی وجہ سے، جیسا کہ وہ ہمیشہ حیران، والہانہ اور مبہوت رہتا ہے جب وہ اسے ہر چیز میں دیکھتا ہے، تو وہ صرف اسی کے ذریعے بولتا ہے، اور صرف اسی کی طرف دیکھتا ہے، اور نہیں جانتا کہ اس کے سوا کوئی آنکھ ہے۔ تو ملاء اعلیٰ، اعلیٰ ارواح، اور گھومتے ہوئے متحرک افلاک اور تیرتے ہوئے ستارے اسے تلاش کرتے ہیں تاکہ وہ اس تک وہ امانت پہنچا دیں جو ان پر اس کا حق ہے، تو وہ کسی ایسے شخص کو نہیں پاتے جو ان سے اعتبار اور ادب کے طریقے سے حاصل کرے، تو وہ اسے ذاتی طور پر ادا کرتے ہیں، اور اس کی نشأت میں جو کچھ باقی ہے وہ اسے ذاتی طور پر حاصل کرتا ہے، اور وہ اپنے رب کے ساتھ ان سب سے غائب ہوتا ہے۔ پس جب اسے اپنی ذات کے مشاہدے کی طرف لوٹایا جاتا ہے، تو وہ اپنی ذات میں وہ سب کچھ دیکھتا ہے جو پورے عالم نے اسے دیا ہے، اس کے اوپر والے اور نیچے والے نے، جو اس کا ہے اور ان کے پاس امانت ہے۔ تو وہ اس پر اللہ کا شکر ادا کرتا ہے، اور جانتا ہے کہ کائنات کی ہر چیز اس کے اور اس جیسے لوگوں کے لیے مسخر ہے، لیکن وہ نہیں جانتے۔ پس جب وہ اس مقام پر پہنچتا ہے، تو وہ دیکھتا ہے کہ جنہیں علم دیا گیا ہے وہ درجات میں ہیں جن سے وہ اپنے ہم جنسوں پر بڑھ جاتے ہیں، اور وہ دیکھتا ہے کہ اس کے ہم جنس اس کے مقام پر ہیں لیکن انہیں اس کا علم نہیں ہے، تو وہ اپنی ذات پر خوش ہوتا ہے اور ان کے لیے غمگین ہوتا ہے کہ وہ اس کے ساتھ ایک ہی مقام پر ہیں اور انہیں اس کا شعور نہیں ہے، اور یہ کہ اسے ان پر صرف اس کے علم، ان کے علم اور معاملے کی حقیقت کے علم کی وجہ سے فضیلت دی گئی ہے۔ اور جب وہ ان درجات پر کشف، تحقیق اور یقینی مشاہدے کے ذریعے بلند ہوا، تو اس نے تلاش کیا کہ اسے یہ درجات کہاں سے ملے جن پر وہ بلند ہوا اور اپنے اکثر ہم جنسوں کے بجائے ان کے ساتھ خاص ہوا، تو اس وقت حق نے اس پر اپنے نام **رَفِيعُ الدَّرَجاتِ** (درجات کو بلند کرنے والا) میں تجلی فرمائی، اور یہ کہ وہ ہی ہے جو ان درجات میں سے **الرُّوحَ عَلى‏ مَنْ يَشاءُ مِنْ عِبادِهِ** (روح کو اپنے بندوں میں سے جس پر چاہتا ہے) نازل کرتا ہے۔ تو اس نے جان لیا کہ وہ ان بندوں میں سے ہے جنہیں اس نے چاہا، تو اس نے درجات کا مقابلہ درجات سے کیا، تو وہ بعینہ وہی تھے، کوئی اور نہیں۔ اور اس نے ان درجات کو پورے عالم میں دیکھا، اور یہ کہ وہ ان میں ہے۔ تو وہ ان کے ذریعے عالم کے سامنے ظاہر ہونے لگا، اور عالم کو شعور نہیں ہوتا، تو وہ ہر انسان سے اس کے درجے کے لحاظ سے خطاب کرتا ہے جو اس کے لیے ہے، تو وہ کہتا ہے کہ یہ میرے ساتھ ہے اور یہ میرا مذہب اور عقیدہ ہے، تو عالم میں سے کوئی بھی اس کا انکار نہیں کرتا، اور نہ ہی وہ عالم میں سے کسی کا انکار کرتا ہے، الٰہی ادب کو لازم رکھتے ہوئے، اور ادب صرف صاحب مقام ہی لازم رکھتا ہے، اور مقام یہ ہے کہ لا مقام ہی مقام ہے۔ اور جہاں تک صاحب حال کا تعلق ہے، تو اس کی کمی اور صاحب مقام سے نیچے ہونے کی وجہ سے اس پر وہ چیز ظاہر ہو سکتی ہے جو دیکھنے والے کو اس کی معرفت کی طرف لے جائے۔ پس کامل شخص عالم کی ہر صورت میں رنگ جاتا ہے اور جو کچھ وہ کر سکتا ہے اس سے پردہ کرتا ہے۔ پس اگر کوئی ایسا شخص ہو جو اسے کسی ایسی صورت میں دیکھے جو مخلوق کے اختلاف کی وجہ سے اس پر مختلف ہو گئی ہو، تو وہ اس میں اس عدم تقیید کا اعتقاد رکھتا ہے جس پر یہ دیکھنے والا ہے، تو وہ اس کے کفر اور زندقہ کا قائل ہو جاتا ہے، اور اسے یہ علم نہیں ہوتا کہ اس پر کہاں سے آیا۔ پس اس مقام والے کے لیے مناسب ہے کہ وہ کبھی بھی دو شخصوں کے سامنے ایک ہی صورت میں ظاہر نہ ہو، جیسا کہ حق کبھی بھی دو شخصوں کے سامنے ایک ہی صورت میں تجلی نہیں فرماتا۔ کیونکہ درجات وہی درجات ہیں۔ پس جس نے اس پر صورتوں کا اختلاف نہیں دیکھا، اس نے اسے کافر اور زندیق کہا، تو یہ اس کی جہالت اور حسد ہے۔ تو جو کچھ وہ اس کی طرف منسوب کرتا ہے وہ اس صورت میں ہوتا ہے جو وہ اللہ جل و علا کی طرف منسوب کرتا ہے، جیسے بیوی، بیٹا اور شریک، اور وہ چیزیں جن سے حق نے خود کو پاک قرار دیا ہے۔ پس یہ اس مقام والے پر اثر انداز نہیں ہوتا، بلکہ وہ اپنے کمال پر ہے، اور یہ اس میں واقع ہونے والا جھوٹا ہے۔ کیونکہ اس نے اس پر صرف اسی چیز کا حکم لگایا جو اس نے اس سے مشاہدہ کیا، اور وہ اپنی زبان سے اس کے بارے میں وہ کہتا ہے جس کے خلاف وہ اپنے نفس میں جانتا ہے، ظلم اور سرکشی کی وجہ سے، جیسا کہ اللہ تعالیٰ نے فرمایا: **وَجَحَدُوا بِها وَاسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وَعُلُوًّا فَانْظُرْ كَيْفَ كانَ عاقِبَةُ الْمُفْسِدِينَ** (اور انہوں نے ان کا انکار کیا، حالانکہ ان کے دلوں نے انہیں یقین کر لیا تھا، ظلم اور سرکشی کی وجہ سے۔ پس دیکھو کہ فساد پھیلانے والوں کا انجام کیسا ہوا)۔ اور اسی طرح اس کا انجام بھی ہوگا۔ پس حق کے درجات وہ نہیں ہیں جن پر عالم ہے، اور اس مقام والا ان میں ممتاز ہو چکا ہے جب اس نے انہیں ممتاز کیا، پس وہ ظاہر اور باطن معبود ہے، اور وجود میں اول اور شہود میں آخر ہے۔ اور **وَاللَّهُ غَنِيٌّ عَنِ الْعالَمِينَ** (اور اللہ تمام جہانوں سے بے نیاز ہے)۔ پس اس میں تنکیر (نکرہ ہونا) داخل نہیں ہوتا، اور الإله (معبود) میں تنکیر داخل ہوتی ہے، تو کہا جاتا ہے: إله (ایک معبود)۔ پس اس چیز پر توجہ دو جس پر میں نے تمہیں متنبہ کیا ہے تاکہ تم اللہ کہنے اور إله کہنے کے درمیان فرق جان سکو۔ پس عالم میں معبود (آلہہ) زیادہ ہو گئے کیونکہ وہ تنکیر کو قبول کرتے ہیں، اور اللہ ایک معروف ہے جسے کوئی نہیں جانتا، معبودوں کے پجاریوں نے بھی اس کا اقرار کیا، تو انہوں نے کہا: **ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏** (ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں)۔ اور انہوں نے یہ نہیں کہا کہ ایک بڑے معبود کے قریب کر دیں جو ان سے بڑا ہے۔ اور اسی لیے انہوں نے اس چیز کا انکار کیا جو آپ صَلَّى اللهُ عَليهِ وسَلَّم قرآن اور سنت میں لائے کہ وہ ایک معبود ہے، اس پر الإله کا اطلاق کرنے سے، اور انہوں نے اللہ کا انکار نہیں کیا، اور اگر وہ اس کا انکار کرتے تو وہ مشرک نہ ہوتے۔ تو وہ کس کے ساتھ شرک کرتے اگر وہ اس کا انکار کرتے؟ پس انہوں نے صرف إله کے ساتھ شرک کیا، نہ کہ اللہ کے ساتھ۔ پس سمجھو۔ تو انہوں نے کہا: **أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ** (کیا اس نے تمام معبودوں کو ایک ہی معبود بنا دیا؟ بے شک یہ تو بڑی عجیب بات ہے)۔ اور انہوں نے یہ نہیں کہا کہ کیا اس نے معبودوں کو اللہ بنا دیا؟ کیونکہ اللہ مشرکوں کے نزدیک جعل (بنانے) سے نہیں ہے۔\n\nاور اللہ نے اس لفظ (اللہ) کو کسی پر بھی اطلاق ہونے سے محفوظ رکھا، اور اس نے إله کے اطلاق کو محفوظ نہیں رکھا۔ اور میں نے بعض اہل کفر کو ایک کتاب میں دیکھا جسے انہوں نے \"المدینۃ الفاضلۃ\" (فاضل شہر) کا نام دیا، میں نے اسے مرشانۃ الزیتون میں ایک شخص کے ہاتھ میں دیکھا، اور میں نے اسے اس سے پہلے نہیں دیکھا تھا۔ تو میں نے اسے اس کے ہاتھ سے لیا اور اسے کھولا تاکہ دیکھوں کہ اس میں کیا ہے، تو سب سے پہلی چیز جس پر میری نظر پڑی وہ اس کا یہ قول تھا: \"اور میں اس فصل میں یہ دیکھنا چاہتا ہوں کہ ہم عالم میں ایک إله (معبود) کیسے قائم کریں\" اور اس نے اللہ نہیں کہا۔ تو مجھے اس پر تعجب ہوا اور میں نے کتاب اس کے مالک کو واپس کر دی، اور اس وقت تک میں اس کتاب پر دوبارہ نہیں پہنچا۔ پس جو شخص بصیرت والا اور ہوشیار ہو اسے اس چیز پر غور کرنا چاہیے جو ہم نے ذکر کی ہے، کیونکہ یہ اس مہلک بیماری کے لیے سب سے زیادہ مفید دواؤں میں سے ہے۔ پس اسم الإله مذکورہ درجات میں سے ہے، لہٰذا اس کا ہونا ضروری ہے، کیونکہ درجات کا ہونا ضروری ہے۔ اور اسی باب میں سامری کا قول ہے: **هذا إِلهُكُمْ وإِلهُ مُوسى‏** (یہ تمہارا معبود ہے اور موسیٰ کا معبود ہے) بچھڑے کے بارے میں، اور اس نے یہ نہیں کہا کہ یہ وہ اللہ ہے جس کی طرف موسیٰ تمہیں بلا رہا ہے۔ اور فرعون کا قول: **لَعَلِّي أَطَّلِعُ إِلى‏ إِلهِ مُوسى‏** (شاید میں موسیٰ کے معبود کو دیکھ لوں) اور اس نے یہ نہیں کہا کہ اس اللہ کو جس کی طرف موسیٰ علیہ السلام بلا رہا ہے۔ اور اس نے کہا: **ما عَلِمْتُ لَكُمْ مِنْ إِلهٍ غَيْرِي** (میں تمہارے لیے اپنے سوا کوئی معبود نہیں جانتا)۔ پس یہ کتنی اچھی تحقیق ہے تاکہ تم جان لو کہ فرعون کو اللہ کا علم تھا، لیکن ریاست اور اس کی محبت دنیا میں اس پر غالب آ گئی، کیونکہ اس نے کہا: **ما عَلِمْتُ لَكُمْ** (میں تمہارے لیے نہیں جانتا) اور اس نے یہ نہیں کہا کہ میں عالم کے لیے نہیں جانتا، کیونکہ وہ جانتا تھا کہ اس کی قوم اسے اپنا معبود مانتی ہے۔ تو اس نے اس چیز کی خبر دی جو معاملہ تھا اور اس نے اپنی خبر میں سچ کہا، کیونکہ وہ جانتا تھا کہ ان کے علم میں فرعون کے سوا ان کا کوئی معبود نہیں ہے۔ اور چونکہ حقیقت میں درجات ہیں جو اللہ کی طرف رفعت کے ساتھ منسوب ہیں، اس کے **رَفِيعُ الدَّرَجاتِ** (درجات کو بلند کرنے والا) ہونے کی وجہ سے، اس لیے تجلی کی صورتیں اختلاف کے ساتھ زیادہ ہو گئیں، اسی لیے سامری نے اپنے قول میں کہا: **وَإِلهُ مُوسى‏** (اور موسیٰ کا معبود)۔ کیونکہ الٰہی تجلی صرف إله (معبود) کے لیے ہوتی ہے اور رب کے لیے ہوتی ہے، اللہ کے لیے کبھی نہیں ہوتی۔ **فَإِنَّ الله هُوَ الْغَنِيُّ** (پس بے شک اللہ ہی بے نیاز ہے)۔ **قُلْ هُوَ الله أَحَدٌ الله الصَّمَدُ لَمْ يَلِدْ ولَمْ يُولَدْ ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ** (کہو وہ اللہ ایک ہے، اللہ بے نیاز ہے، نہ اس نے جنا اور نہ وہ جنا گیا، اور نہ کوئی اس کا ہمسر ہے)۔ اور وہ سبحانہ و تعالیٰ کسی ایک شخص پر ایک ہی صورت میں دو بار تجلی نہیں فرماتا، اور نہ ہی دو شخصوں پر ایک ہی صورت میں۔ اسی لیے اس نے کہا: **وَإِلهُ مُوسى‏** (اور موسیٰ کا معبود)۔ کیونکہ انبیاء کے لیے اس کی تجلی مختلف صورتوں میں ہوتی ہے، لیکن حکم میں احدی ہوتی ہے کہ وہ ہی إله ہے جس بھی صورت میں تجلی فرمائے۔ کیا تم نہیں دیکھتے کہ قیامت کے دن جب وہ تجلی فرمائے گا تو انکار کیا جائے گا اور صورتوں کے اختلاف سے پہچانا جائے گا؟ اگر تم کہو کہ وہ اس صورت کی طرف لوٹا جب انکار کیا گیا تاکہ پہچانا جائے، تو ہم کہیں گے کہ اگر تم اس کے قول کو جانتے کہ \"کیا تمہارے اور اس کے درمیان کوئی علامت ہے؟\" تو وہ علامت ہی ان کے لیے دلیل ہے، جہاں بھی وہ اسے اس پر دیکھیں گے، وہ جان لیں گے کہ وہ ان کا رب ہے، تو اس علامت کی صورت کو نام دیا گیا، کیونکہ ہر معلوم پر صورت کا نام بولا جاتا ہے۔ پس انہوں نے اسے علامت سے پہچانا، نہ کہ اس نے ان پر صورت کو دہرایا، بلکہ وہ صورت ہی علامت تھی۔ پس حق کے درجات کی کوئی انتہا نہیں ہے، کیونکہ تجلی ان میں ہوتی ہے اور اس کی کوئی انتہا نہیں ہے، کیونکہ عالم کے بقا کی کوئی انتہا نہیں ہے۔ پس درجات کی دونوں طرفوں میں کوئی انتہا نہیں ہے، یعنی ازل اور ابد جو حال (عالم) سے ظاہر ہوئے ہیں۔ پس اگر عالم زائل ہو جائے تو ازل ابد سے ممتاز نہیں ہوگا جیسا کہ وہ اپنے نفس میں ہے۔ پس حق کے حق میں کوئی ابتداء نہیں ہے، اور اس کے حق میں ابتداء کی نفی اس کے درجات میں سے ایک درجہ ہے جس سے وہ عالم کی مناسبت سے بلند ہوا ہے۔ اور عالم کے درجات جو اس کے درجات کا عین ہیں، ان کا ابد ختم نہیں ہوتا، اگرچہ عالم ان میں سے کسی درجہ میں نازل ہو، تو وہ درجہ\n\nعالم کے لیے ابتداء ہے، کیونکہ درجات کی ابتداء ہے، بلکہ عالم کا ان میں ظاہر ہونا ابتداء رکھتا ہے۔ اور جان لو کہ حق جس حیثیت سے خلق سے ممتاز ہوا، وہ درجات اور درکات کے درمیان برزخ تھا، کیونکہ اس نے اپنے آپ کو دو ہاتھوں سے موصوف کیا، اور دو ہاتھوں کے درمیان برزخ ہے۔ پس جو دائیں ہاتھ پر تھا وہ اہل جنت کے لیے جنت کے درجات ہیں، اور جو دوسرے ہاتھ پر تھا وہ اہل نار کے لیے جہنم کے درکات ہیں۔ پس پستی کی نسبت اس کی طرف بلندی کی نسبت کی طرح ہے، کیونکہ وہ بندوں کے ساتھ ہے جہاں بھی وہ ہوں، پس وہ ان کے درجات میں ان کے ساتھ ہے اور وہ ان کے درکات میں ان کے ساتھ ہے جیسا کہ اس کی جلال کے لائق ہے۔ اور جان لو کہ درجات میں سے ایک درجہ مغفرت کا درجہ ہے، اور وہ دو درجات ہیں: ایک گناہگاروں کو اس سے چھپانا کہ انہیں ان کے گناہوں کی سزا پہنچے، اور دوسرا درجہ انہیں اس سے چھپانا کہ انہیں گناہ پہنچیں۔ اور یہ پردہ عصمت کا پردہ ہے۔ پس مغفرت کے ایک پردے کے بارے میں فرمایا: **وَقِهِمْ عَذابَ الْجَحِيمِ** (اور انہیں جہنم کے عذاب سے بچا)۔ اور مغفرت کے دوسرے پردے کے بارے میں فرمایا: **وَقِهِمُ السَّيِّئاتِ** (اور انہیں برائیوں سے بچا)۔ اور مغفرت کا کوئی دوسرا پردہ نہیں ہے۔ پس گناہگار اور عذاب کے درمیان حائل پردہ کرم، عفو، درگزر اور تجاوز کا پردہ ہے، اور بندے اور گناہ کے درمیان حائل پردہ الٰہی عنایت، اختصاص اور عصمت کا پردہ ہے جو خوف، رجاء یا حیا کو واجب کرتا ہے، جیسا کہ\n\nصہیب کے بارے میں آیا: \"صہیب کتنا اچھا بندہ ہے، اگر وہ اللہ سے نہ ڈرتا تو بھی اس کی نافرمانی نہ کرتا۔\"\n\nپس اس کی عصمت کا سبب گناہ کے وجود سے اس کا خوف تھا، اور اگر خوف نہ ہوتا تو اللہ سے حیا اسے اس بات سے روکتی کہ اس پر کوئی ایسی بات جاری ہو جسے کسی کے حق میں گناہ کہا جائے، اگرچہ اس کے حق میں وہ گناہ نہ ہو کیونکہ اسے صرف اسی چیز میں قائم کیا گیا ہے جو اس کے لیے مباح ہے۔ اور یہ مباح میں تصرف سے بچنے کی انتہا کی عنایت اور عصمت ہے۔ اور سب سے بڑی معصیت وہ ہے جو دلوں کو مار دیتی ہے، اور وہ صرف اللہ کے علم کی کمی سے مرتے ہیں، جسے جہل کہا جاتا ہے۔ کیونکہ دل وہ گھر ہے جسے اللہ نے اس انسانی نشأت میں اپنے لیے چنا ہے، تو اس غاصب نے اس میں غصب کر لیا اور اس کے اور اس کے مالک کے درمیان حائل ہو گیا، تو وہ اپنے نفس پر سب سے زیادہ ظلم کرنے والا ہوا، کیونکہ اس نے اسے اس خیر سے محروم کر دیا جو اس گھر کے مالک سے اسے حاصل ہوتا اگر وہ اسے اس کے لیے چھوڑ دیتا۔ پس یہ جہل کی محرومی ہے۔ اس کے علاوہ یہاں ایک نکتہ ہے جس پر توجہ دلانا ضروری ہے، اور وہ یہ ہے کہ دل کا مالک جو یہ دیکھتا ہے کہ دل نے اس کے رب کو اس کی باقی نشأت کے بجائے سمو لیا ہے، وہ اس شخص کے درجے سے نیچے ہے جو یہ دیکھتا ہے کہ حق اس کی نشأت کا عین ہے بغیر کسی تخصیص کے، کیونکہ حق اس کی سماعت، اس کی بصارت اور اس کی تمام قوتیں تھا، پس اس نے اس میں کسی چیز کو کسی چیز کے بجائے خاص نہیں کیا۔ پس دل کا مالک اپنے دل کی نگرانی کرتا ہے، اور دوسری حالت والا شخص ہر چیز پر اپنے رب کے ذریعے حکم لگاتا ہے، جس میں اس کا رب اس چیز سے پردہ میں ہے، اور وہ اس صفت والے کے لیے اس پردے میں مشہود ہے۔ تو وہ اس کے ساتھ اس چیز کے مطابق معاملہ کرتا ہے جو اسے وحی کی جاتی ہے۔ پس اگر اسے اس پردہ والے کی طرف سے حق کی عنایت کی وجہ سے اس کے کشف کی وحی کی جائے، تو وہ اسے اس کے لیے کھول دیتا ہے اور اس کے سامنے اپنے آپ کو ظاہر کرتا ہے اور اسے بتاتا ہے کہ حق اس میں کیا ہے۔ اور اگر اسے اس پر پردہ باقی رکھنے کی وحی کی جائے، تو وہ اسے باقی رکھتا ہے اور اسے وہ کچھ ظاہر نہیں کرتا جو اس پردہ والے کے نفس میں ہے۔ تو اس صفت والا شخص دل والے شخص پر حکم لگاتا ہے، اور دل والا شخص اس پر حکم نہیں لگاتا، کیونکہ وہ اپنے دل کی حفاظت میں مشغول ہے جو اس کے رب کا گھر ہے تاکہ اس میں اس کے رب کے سوا کوئی داخل نہ ہو، کیونکہ وہ ہی نگہبان اور دربان ہے۔ پس اگر تم یہ سمجھ گئے تو دیکھو کہ تم ان دونوں میں سے کون سے شخص ہو گے۔ اور اسی لیے اہل مراقبہ ہمیشہ کون میں تصرف سے حجاب میں رہتے ہیں، اور وہ اللہ میں حدود والے ہیں۔ پس جب وہ اپنے دلوں کی نگرانی سے بلند ہوتے ہیں، جو سب سے بڑا حجاب ہے، اور اپنے دلوں کی نگرانی میں پورے عالم کی نگرانی سے تجاوز کرتے ہیں، تو میدان ان کے لیے وسیع ہو جاتا ہے، لیکن انہیں اس وصف والے شخص کا حکم حاصل نہیں ہوتا جس کا ہم نے ذکر کیا، کیونکہ وہ اس کی نگرانی کرتے ہیں کیونکہ وہ ان کی نگرانی کرتا ہے، کیونکہ وہ ہر چیز پر نگہبان ہے۔ پس انہوں نے حفاظت کا مقابلہ حفاظت سے کیا، مثالوں کا موازنہ اور مطابقت سے مقابلہ۔ پس جس طرح اس نے اپنی آنکھ سے ان کی نگرانی کی، اسی طرح اس نگران نے بھی اپنی آنکھ سے اس کی نگرانی کی۔ اور جو شخص اپنے نفس میں اور عالم میں مکمل طور پر حق ہو، وہ مراقبہ کی صفت سے باہر نکل جاتا ہے، کیونکہ یہ سلوک اور شاہراہ کا مقام ہے۔ پس جب تم اس میں اس کے ذریعے اور اس سے اس کی طرف سلوک کرتے ہو، تو وہاں کوئی نگران نہیں ہوتا، کیونکہ اس راستے میں کوئی خوف نہیں ہوتا کہ کوئی رکاوٹ سالک کو روکے۔ پس یہ ایسا سلوک ہے جس میں مراقبہ نہیں ہے۔ اور یہ منزل علوم میں سے پردوں کے ڈالنے کے علم کو شامل کرتی ہے، اور کس پر ڈالے جاتے ہیں۔ پس پردہ تعظیم کی جہت سے ڈالا جاتا ہے، جیسے بادشاہ یا پردہ نشین کے پیچھے کا حجاب اور پردہ، اور پردہ اس شخص کے سامنے بھی ڈالا جاتا ہے جو پردے کے پیچھے کی چیز کو کشف کرنے کے لیے پسندیدہ نہیں ہوتا۔ اور پردے رحمت کے طور پر بھی ڈالے جاتے ہیں ان لوگوں پر جن کے سامنے وہ ڈالے جاتے ہیں، جیسے اللہ اور عالم کے درمیان الٰہی حجابات، تاکہ وہ باقی رہیں اور چہرے کی سبحات انہیں جلا نہ دیں، تو یہ علم شامل ہے کہ پردے کیوں ڈالے جاتے ہیں اور کس پر ڈالے جاتے ہیں۔ اور اس میں الٰہی کلام کی ترکیب کی صورتوں کا علم ہے اس کی احدیت کے ساتھ، کہ اس نے ترکیب کو کہاں سے قبول کیا، حالانکہ وہ ایک ہی عین ہے، تاکہ عالم انسان کلام کی حقیقت اور اس شخص کے کلام کے درمیان فرق کر سکے جس میں کلام کی صفت ہے، تو وہ جان لے کہ ترکیب اس چیز میں ہے جس سے وہ کلام کرتا ہے نہ کہ کلام میں۔ اور اس قسم کے معلومات کا علم ایک قیمتی علم ہے جو صرف اللہ کے علماء کے ساتھ خاص ہے جنہوں نے ممکنات کے اعیان میں اللہ کا کلام سنا۔ اور اس میں قبول کرنے والے اور اس سے قبول کیے جانے والے کا علم ہے، اور وہ قبول جو قبول کرنے والے کی صفت ہے، اور کیا قبول قبول کرنے والے کے تنوع کی وجہ سے متنوع ہوتا ہے یا قبول کرنے والے کا اس میں کوئی اثر نہیں ہوتا؟ اور اس میں الٰہی حدود کا علم ہے کہ وہ کیوں لوٹتی ہیں، کیا اپنی ذات کی طرف یا اللہ کی طرف یا ممکنات کی طرف جو عالم ہیں؟ اور اس میں ان جھگڑنے والوں کی صفات کا علم ہے جو حق کو جانتے ہیں لیکن اسے چھپاتے ہیں، جیسے وہ فقہاء جو ایک ایسے مذہب کو لازم پکڑتے ہیں جس کی صحت کا وہ اعتقاد نہیں رکھتے، تو وہ اس پر بحث کرتے ہیں حالانکہ وہ اس کے باطل ہونے کو جانتے ہیں، اور وہ فریق جو اس کے مقابل میں ہوتا ہے وہ حق کو اس کے باطل ہونے پر لاتا ہے، اور یہ دوسرا جانتا ہے کہ حق اس کے ساتھی کے ہاتھ میں ہے، تو وہ اسے رد کر دیتا ہے اور باطل کو حق کی صورت میں ظاہر کرتا ہے، جان بوجھ کر۔ تو کیا وہ اس شخص کے برابر ہے جو باطل کو حق سمجھتا ہے اور اس کا دفاع کرتا ہے کیونکہ وہ اس کے نزدیک حق ہے؟ اور قیامت کے دن اللہ کے نزدیک ان کا کیا حکم ہوگا؟ اور کیا ان کے پاس کوئی الٰہی سند ہے یا نہیں؟ اور اس میں انکار، جحود (انکار) اور کذب (جھوٹ) کے درمیان فرق کا علم ہے، اور کیا یہ سب عدمی امر ہے یا وجودی؟ اگر وجودی ہے تو وہ وجود کے کس مرتبے میں ہے، کیا وہ سب کو شامل ہے یا ان میں سے بعض میں ہے؟ اور اسی طرح اگر وہ عدمی ہے تو وہ عدم کے کس مرتبے میں ہے، کیا وہ اس عدم کے مرتبے میں ہے جو وجود کو قبول نہیں کرتا؟ اور کیا عدم کے لیے کوئی ایسا مرتبہ ہے جو وجود کو قبول نہیں کرتا اس نسبت سے جس کی طرف اشارہ کیا گیا ہے؟ پھر کیا کوئی عدم ہے مگر وہ کسی وجودی مرتبے کی طرف نسبت کو قبول کرتا ہے؟ یا وہ اس عدم کے مرتبے میں ہے جس کا موصوف وجود کو قبول کرتا ہے، اور وہ ممکن عدم ہے؟ اور اس میں کمزور کا طاقتور پر برائی کے ساتھ حملہ کرنے کا علم ہے، کیا یہ حقیقی طاقت کی وجہ سے ہے، تو وہ کمزور نہیں ہے، یا یہ وہمی طاقت کی وجہ سے ہے، تو وہ حقیقت میں کمزور ہے اور نہیں جانتا؟ تو وہ کیا ہے جو اسے اس کی کمزوری سے پردہ میں رکھتا ہے؟ اور اس میں اس شخص کا علم ہے جو امور کی قدر اور ان کے حق کو نہیں جانتا، وہ کیا سبب ہے جس نے اسے اس سے جاہل کر دیا یہاں تک کہ اس سے وہ ظاہر ہوا جو نامناسب میں نامناسب ہے؟ اور اس میں فرشتوں کے مراتب کا علم ہے اس چیز میں جو وہ عالم کے بارے میں اللہ کے پاس ذکر کرتے ہیں، کیونکہ انہیں الٰہی قرب حاصل ہے، اور وہ اللہ اور اس کی مخلوق کے درمیان واسطے ہیں، اور وہ توحید کی گواہی میں وسط میں ہیں، اس کے قول میں: **شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ** (اللہ نے گواہی دی کہ اس کے سوا کوئی معبود نہیں، اور فرشتوں نے اور علم والوں نے بھی)۔ اور اس میں ہر چیز میں اللہ اور اس کی مخلوق کے درمیان فضیلت کا علم ہے۔ اور اس میں حق کا اعتراف کرنے سے اللہ کے پاس جو نتیجہ نکلتا ہے اس کا علم ہے۔ اور اس میں اختیار کے ساتھ حکم لگانے کا علم ہے، کیا یہ عدل میں نقص پیدا کرتا ہے یا نہیں؟ اور اس میں اس شخص کے درمیان فرق کا علم ہے جس نے کسی چیز کو جہالت سے جانا اور اس شخص کے درمیان جس نے اسے بھولنے سے جانا، اور یاد کرنے والوں کی صفت دوسروں کی صفت سے کیا ہے؟ اور اس میں اخلاص کا علم ہے، کس سے یا کس کے حق میں؟ اور اس میں اس چیز کا علم ہے جسے ناپسند کیا جاتا ہے اور جسے پسند کیا جاتا ہے، اور کیا وہ چیز جسے زید ناپسند کرتا ہے، وہی ہے جسے عمرو پسند کرتا ہے یا نہیں؟ اور اس میں اس چیز کا علم ہے جس میں حق مخلوق کے بغیر منفرد ہے، کیا اسے جانا جا سکتا ہے یا نہیں؟ اور کیا الٰہی عنایت سے تعریف کے ذریعے اس تک پہنچنا ممکن ہے یا نہیں؟ اور اگر یہ ممکن نہ ہو تو کیا رکاوٹ ہے؟ اور اس میں عادل امام کے مقام اور اس کے مرتبے کا علم ہے۔ اور اس میں ان لوگوں کے احوال کا علم ہے جو اللہ سے تاریکی کی وجہ سے پردہ میں ہیں نہ کہ نور کی وجہ سے، اور ان لوگوں کا علم ہے جو اللہ سے نور کی وجہ سے پردہ میں ہیں نہ کہ تاریکی کی وجہ سے، اور ان لوگوں کا علم ہے جو اللہ سے نور اور تاریکی دونوں کی وجہ سے پردہ میں ہیں، اور کیا یہ حجابات پردہ میں رہنے والوں کے لیے رحمت ہیں یا دوری کے حجابات ہیں؟ اور اس میں اعضاء پر عائد ہونے والی ذمہ داریوں کا علم ہے۔ اور اس میں اعتبار اور تفکر کا علم ہے۔ اور اس میں الٰہی عنایت والوں کی تائید کا علم ہے، وہ کس چیز سے ان کی تائید کرتا ہے؟ اور کس مقام پر ان کی تائید کرتا ہے؟ اور کیا سبب ہے جو ان کے دشمنوں کو ان پر مسلط کرنے اور ان پر قابو پانے کا موجب بنتا ہے؟ اور حملہ کرنے والا ان پر کس چیز کا سہارا لیتا ہے، کیا کسی وجودی الٰہی امر کا یا کسی وجودی نفسی امر کا؟ اور اس میں اس چیز کا علم ہے جسے جب تم دیکھتے ہو تو کہتے ہو کہ یہ حق ہے، پھر تم کہتے ہو کہ یہ باطل ہے، پھر تم کہتے ہو کہ یہ باطل حق ہے، پھر تم کہتے ہو کہ یہ نہ باطل ہے اور نہ حق، پھر تم کہتے ہو کہ میں نہیں جانتا کہ یہ کیا ہے۔ تو اس کا جہالت کی طرف لوٹنا کیا اس چیز کے علم کا عین ہے یا اس کے علم تک پہنچنا ممکن ہے لیکن یہ شخص نہیں پہنچا، تو اس نے اس کی صفت بیان کی نہ کہ اس چیز کی صفت جس کے بارے میں اس نے کلام کیا؟ اور اس میں تعصب کے بغیر انصاف کا علم ہے، اور اس کی موجودگی، اور غصہ والے کے غصے کو نرمی سے ٹھنڈا کرنا، نہ کہ قہر سے، کیونکہ قہر غصے کو ٹھنڈا نہیں کرتا، بلکہ اس کا حکم قہر کے غلبے کی وجہ سے چھپا دیتا ہے۔ اور اس میں فرشتوں کے عالم کو گھیرنے کا علم ہے جس دن وہ صفیں باندھیں گے، اور وہ آج بھی اسی صورت پر ہیں، اور آج ان کے حکم اور اس دن ان کے حکم کے درمیان فرق کا علم ہے، حالانکہ احاطہ کی صفت ایک ہی ہے، اور وہ وہاں ایک دوسرے کو کیوں پکاریں گے اور یہاں ایسا نہیں ہے سوائے مخصوص مقامات کے؟ کیونکہ قیامت دنیا کی صورت پر ہے، سوائے اس کے کہ وہاں حاکم واحد ہے واسطوں کے اٹھ جانے سے، اور یہاں بھی حاکم وہی واحد ہے لیکن واسطوں کے ساتھ، تاکہ دونوں جہانوں میں فرق کیا جائے جیسا کہ جنت اور جہنم سے دونوں مٹھیوں میں فرق کیا گیا۔ اور اس میں اس شخص کا علم ہے جو اللہ پر حکم لگاتا ہے، وہ کہاں سے حکم لگاتا ہے؟ اور کس چیز نے اسے اس پر جرات دی، کیا حق کی صفت یا جہل کی صفت؟ اور اس میں جباروں اور متکبروں کے ساتھ الٰہی عنایت کا علم ہے۔ اور اس میں ان اسماء الٰہیہ کا علم ہے جنہیں اللہ نے محفوظ رکھا، اس نے انہیں کیوں محفوظ رکھا؟ اور ان اسماء الٰہیہ کا علم ہے جنہیں اس نے محفوظ نہیں رکھا، جیسے اس کا اسم الأحد (ایک) اور وہ اس اسم میں تجلی نہیں فرماتا، اور نہ ہی اس میں تجلی صحیح ہے، اور نہ ہی اسم اللہ میں۔ اور ان دونوں اسماء کے علاوہ جو اسماء ہمیں معلوم ہیں، ان میں تجلی واقع ہوتی ہے۔ اور اس میں سکون کے عین میں حرکت کا علم ہے۔ اور اس میں مومن اور عالم کے درمیان اشتراک کا علم ہے، یہ کس حضور میں ہوتا ہے؟ اور وہ کس چیز سے ممتاز ہوتے ہیں؟ اور کیا مومن عالم کا درجہ حاصل کر سکتا ہے؟ اور جو کچھ وہ سچی خبر کی طرف سے قبول کرتا ہے، کیا وہ اس سے علماء کے درجے کو پہنچتا ہے یا نہیں؟ اور کیا رسولوں کی تصدیق پر دلیل ان کے دعوے میں کہ وہ رسول ہیں، اس چیز پر بھی دلالت کرتی ہے جو وہ خبروں اور احکام میں لائے ہیں، یا وہ کسی اور دلیل کے محتاج ہیں؟ یا وہ مقلد ہونے کے باوجود عالم ہوتے ہیں؟ اور اس میں دور کا علم ہے کہ بلانے والا مدعو بن جاتا ہے اس کے لیے جسے اس نے بلایا تعارض کے حکم سے۔ اور اس میں پورے عالم میں نجات کی طلب کے حکم کا علم ہے طبعی طور پر لیکن وہ اس سے جاہل ہیں، اور عالم میں سے وہ کون سا گروہ ہے جو اسے جانتا ہے؟ اور نجات کیا ہے؟ اور اس میں ہر داعی کی علامت کا علم ہے اور\n\nوہ کس اسم الٰہی کی طرف بلاتا ہے۔ اور اس میں اس وقت کا علم ہے جب انسان اپنے ہاتھ میں موجود چیز کو پھینک دیتا ہے اور اس پر بھروسہ نہیں کرتا اور اپنے تمام امور اللہ کے سپرد کر دیتا ہے۔ اور اس میں تیر اندازی کا علم ہے اور تیروں کا اپنے پھینکنے والے کی طرف لوٹنا، اور میں نے اس تیر انداز کو تلمسان شہر میں دیکھا جو تیر اندازی اور کمانوں اور تیروں کی صنعت کا عالم تھا، تو میں نے اسے تیر پھینکتے ہوئے دیکھا، جب تیر اپنے نشانہ پر پہنچتا تو وہ اکیلا پھینکنے والے کی طرف لوٹ آتا۔ تو یہ میرے لیے عبرت تھی کہ اعمال اپنے کرنے والوں کی طرف لوٹتے ہیں۔ اور اس میں اس چیز کا علم ہے جو زمان کے درجے میں نازل ہوتی ہے لیکن وہ زمان نہیں ہے۔ اور اس میں حاکم کے حکم کے بعد جھگڑے کا علم ہے، اور اس کا سبب کیا ہے، کیونکہ اس کا حکم کو رد کرنے میں کوئی اثر نہیں ہوتا؟ اور اس میں حاکم کے مشاہدے کے مراتب کا علم ہے، اور حاکم کا اپنے علم کے باوجود اپنے حکم کو چھوڑ دینا اور گواہوں کے قول سے حکم لگانا، اور عالم میں اس چیز کو رکھنے کا سبب کیا ہے؟ لیکن یہ ہمارے نزدیک صرف اموال میں ہے، نہ کہ نفوس میں اور نہ ہی حدود قائم کرنے میں۔ اور اس میں اس چیز کا علم ہے جسے ضرورت کی شدت کی وجہ سے مؤخر کرنا جائز نہیں ہے، اور اس بیان کا کیا فائدہ ہے جو علم کے حصول کے لیے رکھا گیا ہے\n\nاور اس کے مطابق حکم کو چھوڑ دیا جاتا ہے؟ اور یہ کس قسم کے واقعات میں ہوتا ہے؟ اور اس مسئلہ میں کون صحیح ہے، کیا وہ جو کہتا ہے کہ وہ اپنے علم سے حکم لگاتا ہے یا مخالف؟ اور میرے نزدیک اس مسئلہ میں، اگر میں کسی امر کو جانتا ہوں اور گواہ میرے علم کے خلاف گواہی دیں، اور میرے لیے اپنے علم سے حکم لگانا جائز نہ ہو اگر میں اس کا قائل ہوں، تو میں حکم لگانے کے لیے کسی ایسے شخص کو نائب بناؤں گا جسے اس امر کا علم نہ ہو اور میں اس میں حکم لگانا چھوڑ دوں گا۔ اور میرے نزدیک یہی صحیح طریقہ ہے، اور میں اسی پر عمل کرتا ہوں، اگرچہ میرے نفس میں اس سے کچھ تردد ہو۔ اور یہ میرے نزدیک اموال میں حکم لگانے کے بارے میں ہے، اور جہاں تک ابدان میں حکم لگانے کا تعلق ہے، تو میں صرف اپنے علم سے ہی حکم لگاتا ہوں اگر میں براءت جانتا ہوں۔ اور اگر براءت نہ ہو اور میں جھوٹے کی سچائی جانتا ہوں، تو میں گواہوں کے حکم سے حکم لگاتا ہوں اور اپنے علم کو چھوڑ دیتا ہوں۔ اور اس چیز کے سبب کا علم جس کی طرف میں گیا ہوں، وہ اس منزل میں شامل ہے۔ اور اس میں اس چیز کا علم ہے جس سے عالم انسان پر فضیلت رکھتا ہے، اور وہ یہ ہے کہ اس کی اس پر ولادت ہے۔ اور اس میں ساعت (قیامت) کے نام کا علم ہے۔ اور اس میں یہ علم ہے کہ کیا عالم سے اللہ پر تکبر کرنا صحیح ہے یا نہیں؟ اور اس میں اس چیز کا علم ہے جسے چیزیں ذاتی طور پر طلب کرتی ہیں، کیا اس میں عادت کو توڑنا صحیح ہے، تو کیا وہ جعل (بنانے) سے ہوگا یا نہیں؟ اور اگر اس میں عادت ٹوٹ جائے تو عادت کو توڑنے کا محل کیا ہے، کیا طالب میں ہے، تو وہ اس چیز کی پیروی کرے گا جو اس کی ذات کا تقاضا تھا یا نہیں؟ اور اس میں انعام پانے والے پر نعمتوں کو مقرر کرنے کے حضور کا علم ہے، کیا یہ تعلیم کی جہت سے ہوگا یا اس کے انکار کی جہت سے؟ اور اس میں عالم کی حسی اور معنوی زندگی کی اصل کا علم ہے، کیا وہ ایک ہی اصل کی طرف لوٹتی ہے یا نہیں؟ اور کیا طبیعت میں زندگی ہے تاکہ وہ حسی زندگی دے یا نہیں؟ اور اس میں دنیاوی انسانی نشأت اور اس گھر میں اس کے باقی رہنے کے دوران اس کے احوال کا علم ہے، اور موت کے بعد اس کے جسمانیت کے لحاظ سے اس کا انجام کیا ہوگا؟ اور اس میں موت اور حیات کا علم ہے، کیا یہ نسبت ہے یا ایک موجود عین ہے جو مختلف مقامات پر ظاہر ہوتی ہے؟ اور ممیت (مارنے والے) کا حکم، کیا وہ موت کے ذریعے مارتا ہے، تو وہ سبب ہوتا ہے، یا وہ صرف مارتا ہے؟ اور اسی طرح حیات، تو کیا ممیت کے حکم سے میت کا عین موت کا عین ہوتا ہے؟ اور اس میں قضاء کا علم ہے اور اس کی قدر سے فضیلت کا علم ہے۔ اور اس میں اس بات کا علم ہے کہ وہ آیت جو رسول لاتا ہے وہ شرط نہیں ہے اور اس پر اسے لانا واجب نہیں ہے۔ اور اس میں اللہ کا اپنے بندوں کا خیال رکھنا ہے حالانکہ وہ اللہ کے ساتھ برا ادب کرتے ہیں۔ اور اس میں آخرت میں ایمان کے عام نفع کا علم ہے۔ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہ ہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و چهل و چهارم در معرفت منزل دو سرّ از اسرار مغفرت، و آن از حضرت محمدیه (الحضرة المحمدية) است.\n\nمردانی را دیدم که کافر و دروغگو را نمی‌بینند\nو کارشان صدق و ایمان است\n\nپس به ایشان گفتم: از دروغ دست بردارید، زیرا آن\nمقامی است، اما در آن کاستی و نقصان است\n\nزیرا نه هر عین (ذات) در هستی (الوجود) متفاوت است\nو نه هر کونی (موجودی) جز خدا، انسان است\n\nبلکه از اوست (حق) که بزرگ و پیشواست\nو از اوست که کوچک است و در آن حق و باطل است\n\nو اگر هستی (وجود) من نبود، عالمی در کار نبود\nو نه اسمایی بودند و نه اعیانی (ذواتی)\n\nو او یگانه ذات بود، نه خالق\nو نه مالکی که برهان بر آن حکم کند\n\nو دلیل عقل در هر حالتی دلالت کرد\nبر اینکه معبود خلق در خلق نیکوکار (محسان) است\n\n### [خداوند را رحمتی عام و رحمتی خاص است]\n\nپیشتر بیان کردیم که خداوند را رحمتی عام و رحمتی خاص است و خداوند این امت را به رحمتی خاص اختصاص داده است.\n\nرسول خدا (صلی الله علیه و سلم) فرمودند: «امت من امتی است مورد رحمت (أمة مرحومة) که در آخرت عذابی بر او نیست، بلکه عذابش در دنیا زلزله‌ها، قتل و بلاست.» این حدیث را بیهقی در کتاب الأدب، در باب «مؤمن کمتر از بلا خالی می‌ماند به خاطر خیری که برای او اراده شده است» از طریق ابی القاسم علی بن محمد بن علی ایادی از ابی جعفر عبدالله بن اسماعیل به املای اسماعیل بن اسحاق قاضی از محمد بن ابی بکر از معاذ بن معاذ از مسعودی از سعید بن ابی برده از پدرش از ابی موسی نقل کرده است که گفت: رسول خدا (صلی الله علیه و سلم) فرمودند... و همه گفتند: «حدثنا» (برای ما روایت کرد)، جز مسعودی که «عنعنه» (از فلانی) گفت، و بیهقی که گفت: «أخبرنا» (ما را خبر داد). و در این باب از ابی برده نیز روایت شده است که گفت: نزد ابن زیاد نشسته بودم و عبدالله بن یزید نیز نزد او بود. پس سرهای خوارج را می‌آوردند. گفت: و آنان (مردم) هرگاه از کنار سری می‌گذشتند، می‌گفتم: به سوی آتش! گفت: پس به من گفت: ای برادرزاده‌ام، چنین مکن؛ زیرا من از رسول خدا (صلی الله علیه و سلم) شنیدم که می‌فرمود: «عذاب این امت در دنیایشان خواهد بود.»\n\nو در حدیث صحیح از رسول خدا (صلی الله علیه و سلم) وارد شده است که فرمودند: «اما اهل دوزخ که اهل آن هستند، در آن نمی‌میرند و زنده نمی‌شوند، بلکه مردمی هستند که آتش به سبب گناهانشان به آنان رسیده است.»\n\nو پیامبر (صلی الله علیه و سلم) امتی را از امت دیگر تخصیص نداد، زیرا نفرمود: «مردمی از امت من.» پس این رحمتی عام است در حق کسانی که از اهل دوزخ نیستند.\n\nسپس پیامبر (صلی الله علیه و سلم) فرمودند: «پس خداوند آنان را در آن می‌میراند، میراندنی (إماتة).»\n\nپس با مصدر (إماتة) آن را تأکید کرد. این همه پیش از ذبح مرگ است. و خداوند آنان را می‌میراند تا آنچه آتش از ایشان می‌خورد را احساس نکنند؛ زیرا نفوس کامل، همان نفوس موحد و مؤمن هستند و توحید و ایمان مانع از برپایی دردها و عذاب بر آنان می‌شود. و حواس، یعنی تمام اجسام، مطیع خداوند هستند، پس درد سوختنی را که آنان را به زغال تبدیل می‌کند، احساس نمی‌کنند؛ زیرا مرده آنچه را که با او انجام می‌دهند، احساس نمی‌کند، هرچند آن را بداند. پس هر آنچه دانسته می‌شود، احساس نمی‌گردد. بنابراین، خداوند عذاب را از موحدان و مؤمنان برمی‌دارد، هرچند وارد آتش شوند. و خداوند آنان را وارد آتش نکرده است مگر برای تحقق کلمه الهی و وقوع تمییز میان کسانی که بدی‌ها را مرتکب شدند و کسانی که کارهای شایسته انجام دادند. پس این حدیثی صحیح است که عموم مردم را در بر می‌گیرد و عذاب بر اهل دوزخ که اهل آن هستند، باقی می‌ماند و تا اجل مسمایی نزد خداوند ادامه می‌یابد، تا اینکه نوزده فرشته عذاب آنان را به یاد آورند. زیرا فرشتگان هرگاه شفاعت کنند، این نوزده فرشته شفاعت نمی‌کنند و شفاعتشان به تأخیر می‌افتد تا زمانی که به صفت رحمت متصف شوند، هنگامی که شهودشان نسبت به غضب الهی مرتفع گردد، به دلیل ترجیح دادن جناب حق بر خلق. زیرا فرشتگان در روز قیامت شفاعت می‌کنند. خداوند می‌فرماید: «فرشتگان شفاعت کردند، پیامبران شفاعت کردند، و مؤمنان شفاعت کردند، و ارحم الراحمین باقی ماند.» پس او نزد شدید العقاب و منتقم شفاعت می‌کند. و این از باب شفاعت اسماء الهی است. پس هر موحدی که خداوند را از حیث علمش توحید کرده باشد، نه از حیث ایمانش، و عمل خیری جز آن نداشته باشد، اما از روی غیر ایمان بوده، از آتش خارج می‌شود. به همین دلیل خداوند او را به خود اختصاص داده است. و این صنف از موحدان کسانی هستند که همراه با شهادت خداوند سبحان و فرشتگان، شهادت دادند که: «أَنَّهُ لا إِلهَ إِلَّا هُوَ» (که هیچ معبودی جز او نیست). پس از آنجا عنایت به سبب اشتراک در شهادت، بر آنان سبقت گرفت و جز خداوند یکتا کسی آنان را نشناخت. و فرشتگان اگرچه آنان را می‌شناسند، اما فرشتگان تحت امر خداوند هستند، مانند جن و انس، پس جناب حق را احترام می‌گذارند و او را بر این افراد ترجیح می‌دهند و به دلیل مخالفت آنان با امر خدا و عدم پذیرش ایمان، بر شفاعت برایشان اقدام نمی‌کنند. پس خداوند سبحان به تنهایی، از باب ارحم الراحمین بودن، به خارج کردن این افراد از آتش منفرد می‌شود و اهل آتش را در حال خود رها می‌کند تا زمانی که در صورت خشنودی و عموم حکم رحمت مرکب در عالم ترکیب و شفاعت فرشتگان عذاب تجلی کند. در آن هنگام حال اهل آتش تغییر می‌کند، همان‌گونه که در مورد گرمایی و سرمایی ذکر کردیم.\n\n### [اینکه موازنه به حکم اعتدال، معقول است اما حکمش موجود نیست]\n\nو بدان که موازنه (الموازنة) به حکم اعتدال (الاعتدال)، معقول است اما حکمش موجود نیست؛ زیرا اگر حکمی می‌داشت، تکوین (آفرینش) واقع نمی‌شد، چون حکم آن اعتدال است و اعتدال مقابل میل است، در حالی که تکوین جز با میل (ترجیح) صورت نمی‌گیرد. و چون پیامبر (صلی الله علیه و سلم) از خداوند دانست که عالم را جز با ترجیح یکی از دو امکان نیافریده است، رسول خدا (صلی الله علیه و سلم) به قاضی دین فرمودند: «هرگاه وزن کردی، ترجیح ده (سنگین‌تر بگیر).»\n\nزیرا دو وجه ممکن در آن مساوی است، پس خداوند آن را جز با ترجیح ایجاد نکرد. سپس خداوند از خود یاد کرد که در حالی که عالمی نبود، او چگونه بود. پس از خود یاد کرد که دوست داشت شناخته شود، و جانب معرفت به خود را بر مقابلش ترجیح داد. پس عالم را با ترجیح جانب علم بر مقابلش خلق کرد. پس هنگامی که خداوند میان رحمت و غضب موازنه کرد، رحمت ترجیح یافت و سنگین شد و غضب الهی مرتفع گردید. و معنای ارتفاع شیء جز زوال حکمش نیست. پس برای غضب الهی در نهایت حکمی باقی نماند؛ زیرا در نهایت، ترجیح رحمت و ارتفاع غضب به دلیل سبکی آن واقع شد. و حکم غضب جز در حال قرار گرفتن غضب و رحمت در میزان ظاهر نشد. پس حکم هر یک از آن دو در عالم جاری است تا زمانی که ترجیح ظاهر شود و حکم غضب مرتفع گردد. و ما این را نگفتیم مگر در ردّ سخن کسی که ادعای کشف (الکشف) می‌کند و در مورد موازنه الهی می‌گوید: «خداوند عدل خود را در فضلش و فضل خود را در عدلش حکم نمی‌کند، و دو قبضه از جمیع وجوه مساوی هستند.» و این از بزرگترین خطاهایی است که به دلیل نداشتن استاد، بر اهل کشف عارض می‌شود. و این سخن را نمی‌گوید مگر کسی که در محضر استادی که توسط استادی متشرع و آگاه به موارد و مصادر احکام شرعی تربیت شده باشد، نبوده است. زیرا خداوند راهی به سوی معرفت خود که عقل به تنهایی قادر به درک آن از حیث فکر نیست، جز آنچه را که بر بندگانش به زبان رسولان و پیامبرانش تشریع کرده است، قرار نداده است. و ما این را گفتیم، زیرا دانستیم که راه دیگری نیز هست که هستی (الوجود) آن را اقتضا می‌کند و برخی نفوس فاضله آن را به دست می‌آورند. پس خواستیم اشکال را برطرف کنیم. و آن این است که نفوس با ریاضت و ترک شهوات طبیعی و استغراق در امور محسوس، صفا می‌یابند و مشتاق می‌شوند به سوی آنچه از آن آمده‌اند و آنچه برای آن اراده شده‌اند و به سوی سرانجامشان و مرتبه‌شان در عالم. و از ذات خود دانستند که ورای این جسم، امر دیگری است که محرک و مدبر آن است، هنگامی که مرگ نازل بر آن را مشاهده کردند. پس به آلات جسم در کمالشان می‌نگرند و آن ادراکاتی را که در زمان وصف به حیات داشت، در آن نمی‌بینند. پس دانستند که ناگزیر امر دیگری در آنجاست که نمی‌دانند نسبت آن به این جسم چیست؛ آیا نسبت عرض به محلش است، یا متمکن به مکانش، یا ملک به ملکش؟\n\n### [اینکه میان مرگ و خواب تفاوتی است]\n\nسپس دانستند که میان مرگ و خواب تفاوتی است، به سبب صورتهایی که در خواب می‌بینند و احوال لذت‌بخش و دردناکی که از آن استفاده می‌کنند و سرعت تغییر در صورت شخص خوابیده از حالی به حال دیگر، در حالی که این تغییر را در صورت جسم نمی‌بینند. سپس بیدار می‌شوند و جسم را بر حال خود و صورتش بدون تغییر می‌بینند. و در برخی اوقات، انفعال جسم را به سبب آنچه در حال خواب برای شخص خوابیده عارض می‌شود، می‌بینند، مانند خروج آب در احتلام هنگام دیدن جماع در خواب. پس با این همه دانستند که ورای این جسم، امر دیگری است که میان آن و این صورت، رابطه‌ای وجود دارد. سپس تفاوت امثال را در علوم و فهم دیدند و نیاز برخی از آنان به تعلیم را مشاهده کردند و به حال کسی نگریستند که زهد ورزیده و تفکر کرده و خلوت‌ها گزیده و از لذات محسوسات جز آنچه نیازهای قوام این جسم به آن ضروری است، برنگرفته است. و دیدند که صاحب این حال بر نفس دیگری با علوم و فضائلی برتری دارد که آن نفس در آن علوم و فضائل به او نیازمند است. پس در راهی که آن نفوس را به این مقام رسانده و دیگران را نرسانده، نگریستند و مانعی ندیدند جز روی آوردن برخی نفوس به تناول این خواسته‌های ظاهری طبیعی و رقابت در آنها. پس از همه اینها زهد ورزیدند و به مکارم اخلاق آراسته شدند و برای هیچ‌کس بر خود مطالبه و رابطه‌ای باقی نگذاشتند و با آنان بر آنچه هستند، مزاحمت نکردند و به خلوت‌ها روی آوردند و همت را برای اشراف بالا بردند تا بدانند امر بر چه قرار است. و چون به این مرتبه رسیدند، و همه اینها نظر آنان بود که از تقلید شرع الهی نبود، بلکه از فکری صحیح و الهامی الهی ناقص و غیر کامل بود؛ زیرا الهام کامل آن است که به پیروی از شرع و نظر در کلام او و در کتاب‌هایی که به ما گفته شده از نزد خدا آمده‌اند، الهام شود. پس چنین الهامی، الهام کامل‌تر است. پس هنگامی که این نفس صفا یافت و شفاف شد و مانند آینه گردید و زنگار این طبیعت از آن زدوده شد، صور عالم در آن نقش بست. پس آنچه را که ندیده بود، دید و به غیب‌ها سخن گفت و به ملأ اعلی (الملأ الأعلى) پیوستن غریبی یافت و به غیر موطن خود وارد شد، در حالی که موطن او بود، اما به دلیل غربتش شناخته نشد، زیرا به سرزمین طبیعت و بدنش سفر کرده بود. پس آن ناز و کمال انس با آن عالم را نداشت و دید که آن عالم به جای او مشغول تسبیح و تقدیس است و به کارهایی که در حق این مولدات عنصری مسخر شده‌اند. پس آنچه را که به حرکت افلاک و سیر کواکبشان و آنچه در ارکان از آن رخ می‌دهد، اختصاص دارد، دید و آنچه را که نمی‌دانست، دانست و از ارواح ملکی (الأرواح الملكية) علومی را گرفت که نزدش نبود. و ندانست که راهی هست که اگر آن را بپیماید، به گرفتن از خداوند، آفریننده کل، می‌رسد و اینکه میان او و خداوند، باب خاصی است که به او اختصاص دارد. پس گفت: این نهایت است و جز اینها چیزی نیست. و به برتری خود بر امثال دیگرش به واسطه آن نگریست و قانع شد. پس هر آنچه از این طریق به دست می‌آورد، وصف و حال اوست و ابداً ذوق الهی (ذوق إلهي) ندارد و هرگز جز از ارواح و عقول ملکی نمی‌گیرد، گرفتنی از نوع حال، نه گرفتنی از نوع نطق، مگر اینکه امری در خیالش مجسم شود که با او سخن بگوید.\n\nاما صاحب طریقه شرعیه، از شارع (پیامبر) تقلید می‌کند در آنچه به او خبر داده است که هیچ معبودی نیست که میان او و عالم مناسبتی باشد و اینکه او تعالی: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست) و به هیچ چیز از عالم، نه بالا و نه پایین آن، شباهت ندارد. و با این همه، او چشم و چشمانی، دست و دو دستی، وجه و کلام و نزول و استواء و فرح و همراهی با بندگانش به مصاحبت و قرب و بعد و اجابت برای کسی که او را بخواند و رحمت دارد و اینکه تمام عالم بندگان او هستند که آنان را خلق کرده و برخی را بر برخی دیگر برتری داده است و اینکه او غضب دارد و اینکه او خلفایی در زمین از این نوع انسانی دارد. پس هنگامی که این را شنید و دانست که خلیفه‌ای از نوع او وجود دارد، مشتاق شد که به آن مرتبه دست یابد و راهی را که شارع زمانش تشریع کرده و با او سخن گفته بود، دید و دید که تمام آنچه را که صاحب آن نفس که با نظر خود تفکر کرده بود، انجام می‌داد، این شارع او را به آن ترغیب کرده و ستوده و به آن قائل شده است. پس این مؤمن آن را از آن جهت که این شارع آن را آورده است، پذیرفت و همت خود را به پروردگارش که او را ایجاد کرده، معطوف کرد، زیرا شارع به او اعلام کرد که او نهایت است و به او فرمود: «وَأَنَّ إِلى‏ رَبِّكَ الْمُنْتَهى‏» (و اینکه نهایت به سوی پروردگار توست) و ورای خداوند مقصدی نیست. پس او را جایگاه غایت خود قرار داد و سلوک متفکر جستجوگر صاحب نظر عقلی را پیمود، اما از طریق شرعی. پس نفسش صفا یافت و آینه‌اش صیقل خورد و صور تمام عالم روحانی در آن نقش بست. و اهل فکر تا حد طبیعت که پایین‌تر از نفس است، می‌رسند و آنچه بالاتر از آن است، در آنان نقش نمی‌بندد، مگر کسی که سلوکش بر طریق مشروع باشد. پس هنگامی که این سالک بر طریق شرع رسید، آنچه در لوح محفوظ (اللوح المحفوظ) است، در او نقش می‌بندد. پس مرتبه شرایع را می‌بیند و نفس خود و بهره و نصیب و غایت خود را از عالم می‌بیند و بر اساس آنچه می‌بیند، عمل می‌کند و با طلب به سوی وجه خاص خود بالا می‌رود. پس از حق (الحق) گرفتن الهام، گرفتن تجلی (التجلی)، گرفتن تنزیه و گرفتن تشبیه را می‌گیرد و جریان هستی (الوجود) در ممکنات را مشاهده می‌کند و در آن هنگام می‌داند که حکم در آنچه ظاهر شده، از آن کیست و ظاهر کیست که این احکام و اختلافات روحانی و طبیعی در او ظاهر می‌شود. پس هنگامی که این دو شخص سخن بگویند، کامل از مردان تفاوت میان این دو شخص را می‌داند و می‌داند که بر هر یک از کجا آمده است و چرا سالک با فکر خود از رتبه متشرع ناقص مانده است. پس صاحب فکر همیشه سرنگون است و منتظر آنچه امداد روحانی برایش می‌آورد، می‌ماند. و صاحب شرع همیشه از حیا در برابر تجلی الهی (التجلی الإلهي) در اوقاتی سرنگون است، همان‌گونه که همیشه شبیه حیران، واله و مبهوت است، هنگامی که او را در هر چیزی می‌بیند. پس جز به او سخن نمی‌گوید و جز به او نمی‌نگرد و نمی‌داند که عین دیگری جز او وجود دارد. پس ملأ اعلی و ارواح والا و افلاک گردان و کواکب شناور او را می‌طلبند تا آنچه را که نزد آنان به امانت سپرده شده و او مستحق آن است، به او برسانند. پس کسی را نمی‌یابند که از طریق اعتبار و ادب از آنان بگیرد. پس آن را به صورت ذاتی ادا می‌کنند و آنچه از نشأتش باقی مانده، آن را به صورت ذاتی از آنان می‌گیرد، در حالی که او به سبب پروردگارش از همه اینها غایب است. پس هنگامی که به دیدن ذات خود بازگردانده می‌شود، در ذات خود تمام آنچه را که تمام عالم، بالا و پایین آن، به او داده‌اند و از آن اوست و نزد آنان امانت است، می‌بیند. پس خداوند را بر آن شکر می‌کند و می‌داند که هر آنچه در کون است، مسخر او و امثال اوست، اما نمی‌دانند. پس هنگامی که در این مقام قرار گرفت، می‌بیند که کسانی که علم به آنان داده شده، بر درجاتی هستند که به واسطه آن بر امثال دیگر خود برتری می‌یابند و می‌بیند که امثال او در مرتبه او هستند، اما به آن علم ندارند. پس به ذات خود شاد می‌شود و برای آنان اندوهگین می‌شود، زیرا در یک مقام با او هستند و آن را درک نمی‌کنند و او بر آنان برتری نیافته است مگر به علم به او و به آنان و به آنچه امر بر آن است. و هنگامی که این درجات را با ارتقای کشف (الکشف) و تحقیق و مشاهده یقینی پیمود، جستجو کرد که این درجات که در آن ارتقا یافته و بدون بیشتر امثال خود به آن اختصاص یافته، از کجا به او رسیده است. پس در آن هنگام حق (الحق) در اسم خود «رَفِيعُ الدَّرَجَاتِ» (بالابرنده درجات) بر او تجلی کرد و اینکه اوست که روح را از این درجات «عَلَى مَنْ يَشاءُ مِنْ عِبادِهِ» (بر هر که از بندگانش بخواهد) القا می‌کند. پس دانست که او از کسانی است که خداوند خواسته است. پس درجات را با درجات مقابله کرد و دید که همان‌ها هستند و غیر آنها نیستند و آن درجات را در تمام عالم دید و اینکه او در آنهاست. پس شروع کرد به ظاهر شدن برای عالم به واسطه آنها، در حالی که عالم درک نمی‌کند. پس با هر انسانی از حیث درجه‌ای که دارد، سخن می‌گوید و می‌گوید: این با من است و این مذهب و اعتقاد من است. پس هیچ‌کس از عالم او را انکار نمی‌کند و او نیز هیچ‌کس از عالم را انکار نمی‌کند، با لزوم ادب الهی. و ادب را جز صاحب مقام لازم نمی‌گیرد. و مقام «آنکه مقامی نیست، مقام است.» اما صاحب حال، ممکن است به دلیل نقص و نزولش از صاحب مقام، چیزی از این بر او ظاهر شود که بیننده را به معرفت او رهنمون سازد. پس کامل به هر صورتی در عالم رنگ می‌پذیرد و به آنچه می‌تواند، خود را می‌پوشاند. پس اگر کسی او را در صورتی ببیند که به دلیل اختلاف خلق بر او متفاوت شده است، اعتقاد به عدم تقییدی که این بیننده بر آن است، پیدا می‌کند و او را کافر و زندیق می‌خواند و نمی‌داند که از کجا بر او آمده است. پس شایسته است که صاحب این مقام هرگز برای دو شخص در یک صورت ظاهر نشود، همان‌گونه که حق (الحق) هرگز برای دو شخص در یک صورت تجلی نمی‌کند؛ زیرا درجات همان درجات هستند. پس کسی که اختلاف صور را بر او نبیند و او را کافر و زندیق بخواند، این از جهل و حسد اوست. پس آنچه به او نسبت می‌دهد، به صورتی است که به خداوند جل و علا نسبت می‌دهد، از همسر و فرزند و شریک، و آنچه حق خود را از آن منزه دانسته است. پس این بر صاحب این مقام تأثیری نمی‌گذارد، بلکه او بر کمال خود است و آن واقعه از سوی افترا زنندگان است؛ زیرا او جز بر اساس آنچه از او مشاهده کرده، حکم نکرده است و با زبان خود چیزی را درباره او می‌گوید که در نفس خود خلاف آن را می‌داند، از روی ظلم و برتری‌جویی، همان‌گونه که خداوند تعالی فرمود: «وَجَحَدُوا بِها وَاسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وَعُلُوًّا فَانْظُرْ كَيْفَ كانَ عاقِبَةُ الْمُفْسِدِينَ» (و آن را انکار کردند، در حالی که در دل به آن یقین داشتند، از روی ظلم و برتری‌جویی. پس بنگر که عاقبت مفسدان چگونه بود). و عاقبت این شخص نیز چنین خواهد بود. پس درجات حق همان چیزی است که عالم بر آن است و صاحب این مقام هنگامی که درجات را متمایز کرد، در آنها متمایز شد. پس او اله (معبود) ظاهر و باطن و اول در هستی (الوجود) و آخر در شهود (الشهود) است. و «وَاللَّهُ غَنِيٌّ عَنِ الْعالَمِينَ» (و خداوند از جهانیان بی‌نیاز است)، پس تنکیر (نکره شدن) در آن وارد نمی‌شود، اما در «الإله» تنکیر وارد می‌شود و گفته می‌شود: «إله» (معبودی). پس به آنچه تو را بر آن آگاه ساختم، توجه کن تا فرق میان گفتن «الله» و گفتن «إله» را بدانی. پس آلهه (معبودان) در عالم زیاد شدند، به دلیل پذیرش تنکیر. و «الله» یکی است و شناخته شده که مورد جهل واقع نمی‌شود. پرستندگان آلهه به این اقرار کردند و گفتند: «ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏» (ما آنان را نمی‌پرستیم مگر برای اینکه ما را به خداوند نزدیک گردانند) و نگفتند: «به سوی إله بزرگی که از آنان بزرگتر است.» و به همین دلیل آنچه را که پیامبر (صلی الله علیه و سلم) در قرآن و سنت آورده بود که او «إله واحد» (معبود یگانه) است، از جهت اطلاق «الإله» بر او، انکار کردند و «الله» را انکار نکردند. و اگر او را انکار می‌کردند، مشرک نبودند. پس اگر او را انکار کنند، به چه کسی شرک می‌ورزند؟ پس آنان جز به «إله» شرک نورزیدند، نه به «الله». پس بفهم. پس گفتند: «أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ» (آیا معبودان را یک معبود قرار داده است؟ این چیزی شگفت‌آور است). و نگفتند: «آیا آلهه را الله قرار داده است؟» زیرا «الله» نزد مشرکان با جعل (قرار دادن) نیست. و خداوند این لفظ را از اینکه بر کسی اطلاق شود، مصون داشته است، اما اطلاق «إله» را مصون نداشته است. و من برخی از اهل کفر را در کتابی به نام «المدینة الفاضلة» (شهر فاضله) دیدم که در دست شخصی در مرشانة الزیتون بود و پیش از آن آن را ندیده بودم. پس آن را از دستش گرفتم و باز کردم تا ببینم در آن چیست. اولین چیزی که چشمم به آن افتاد، این سخن بود: «و من می‌خواهم در این فصل بنگریم که چگونه در عالم یک إله (معبود) قرار دهیم.» و «الله» نگفت. پس از آن تعجب کردم و کتاب را به صاحبش انداختم و تا این زمان بر آن کتاب دست نیافته‌ام. پس هر کس که بصیرت و تنبه دارد، به آنچه ذکر کردیم، توجه کند؛ زیرا آن از نافع‌ترین داروها برای این بیماری مهلک است. پس اسم «الإله» از درجات مذکور است و ناگزیر از آن است، زیرا ناگزیر از درجات است. و از این باب است سخن سامری: «هذا إِلهُكُمْ وإِلهُ مُوسى‏» (این معبود شما و معبود موسی است) در مورد گوساله، و نگفت: «این الله است که موسی شما را به سوی او می‌خواند.» و سخن فرعون: «لَعَلِّي أَطَّلِعُ إِلى‏ إِلهِ مُوسى‏» (شاید به معبود موسی دست یابم) و نگفت: «به سوی الله که موسی (علیه السلام) به سوی او می‌خواند.» و گفت: «ما عَلِمْتُ لَكُمْ مِنْ إِلهٍ غَيْرِي» (من برای شما معبودی جز خودم نمی‌شناسم). پس چه نیکوست این تحقیق، تا بدانی که فرعون علم به خداوند داشت، اما ریاست و حب آن در دنیایش بر او غلبه کرد. زیرا گفت: «ما عَلِمْتُ لَكُمْ» (برای شما نمی‌شناسم) و نگفت: «ما علمت للعالم» (برای عالم نمی‌شناسم)، زیرا می‌دانست که قومش او را معبود خود می‌دانند. پس به آنچه امر بر آن است، خبر داد و در خبر دادن به آن صادق بود؛ زیرا می‌دانست که در علم آنان معبودی جز فرعون نیست. و چون در نفس الأمر درجات منسوب به خداوند به واسطه «رفیع الدرجات» بودن وجود دارد، صور تجلی به صورت اختلاف زیاد شد. به همین دلیل سامری به سخن خود: «وَإِلهُ مُوسى‏» (و معبود موسی) نطق کرد؛ زیرا تجلی الهی (التجلی الإلهي) جز برای «الإله» و «الرب» نیست و هرگز برای «الله» نیست. «فَإِنَّ الله هُوَ الْغَنِيُّ» (پس همانا خداوند بی‌نیاز است). «قُلْ هُوَ الله أَحَدٌ الله الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ» (بگو: او خداوند یکتاست. خداوند بی‌نیاز است. نزاده و زاده نشده و هیچ‌کس همتای او نیست). و او سبحان هرگز برای یک شخص در یک صورت دو بار تجلی نمی‌کند و نه برای دو شخص در یک صورت. به همین دلیل گفت: «وَإِلهُ مُوسى‏»؛ زیرا تجلی او برای پیامبران مختلف الصور است، اما حکم آن احدی است که او «الإله» است در هر صورتی که تجلی کند. آیا نمی‌بینی که در قیامت هنگامی که تجلی می‌کند، انکار می‌شود و با اختلاف صور شناخته می‌شود؟ اگر بگویی: پس به صورت بازگشت هنگامی که انکار شد تا شناخته شود، می‌گوییم: اگر سخن او را می‌دانستی که: «آیا میان شما و او علامتی هست؟» پس آن علامت دلیل برای آنان است. هر جا آن را بر او ببینند، می‌دانند که او پروردگارشان است. پس صورت آن علامت نامیده شد، زیرا هر معلومی اسم صورت بر آن اطلاق می‌شود. پس با علامت او را شناختند، نه اینکه صورت را بر آنان تکرار کرده باشد، بلکه آن صورت همان علامت بود. پس درجات حق (الحق) را نهایتی نیست، زیرا تجلی در آن است و تجلی را نهایتی نیست. و بقای عالم را نهایتی نیست، پس درجات را در دو طرف، یعنی ازل و ابد که به واسطه حال (عالم) ظاهر شدند، نهایتی نیست. و اگر عالم زائل می‌شد، ازل از ابد متمایز نمی‌شد، همان‌گونه که امر در نفس خود بر آن است. پس در حق حق (الحق) آغازی نیست و نفی آغاز در حق او، درجه‌ای از درجات اوست که به واسطه آن از مناسبت با عالم مرتفع شده است. و درجات عالم که عین درجات اوست، ابدش متناهی نمی‌شود، هرچند نزول عالم در درجه‌ای از آن باشد. پس آن درجه آغاز برای عالم است، زیرا درجات آغاز دارند، بلکه ظهور عالم در آن آغاز دارد. و بدان که حق (الحق) از آن جهت که از خلق متمایز شد، برزخی میان درجات و درکات بود؛ زیرا خود را وصف کرد که دو دست دارد و آنچه میان دو دست است، برزخ است. پس آنچه بر دست راست بود، درجات بهشت برای اهل آن است و آنچه بر دست دیگر بود، درکات دوزخ برای اهل آن است. پس نسبت پایین به او مانند نسبت بالاست؛ زیرا او با بندگان است هر جا که باشند. پس او با آنان در درجاتشان است و با آنان در درکاتشان است، همان‌گونه که شایسته جلال اوست. و بدان که از درجات، درجه مغفرت است و آن دو درجه است: یکی پوشاندن گناهکاران از اینکه عقوبت گناهانشان به آنان برسد، و درجه دیگر پوشاندن آنان از اینکه گناهان به آنان برسد. و این پوشش، پوشش عصمت است. پس در مورد پوشش اول از مغفرت فرمود: «وَقِهِمْ عَذابَ الْجَحِيمِ» (و آنان را از عذاب دوزخ حفظ کن) و در مورد پوشش دیگر از مغفرت فرمود: «وَقِهِمُ السَّيِّئاتِ» (و آنان را از بدی‌ها حفظ کن). و برای مغفرت پوشش دیگری نیست. پس پوششی که میان گناهکار و عذاب حائل می‌شود، پوشش کرم و عفو و صفح و گذشت است. و پوششی که میان بنده و گناه حائل می‌شود، پوشش عنایت الهی و اختصاص و عصمت است که موجب خوف یا رجاء یا حیا می‌شود، همان‌گونه که در مورد صهیب آمده است: «چه بنده خوبی است صهیب، اگر از خدا نمی‌ترسید، نافرمانی نمی‌کرد.»\n\nپس سبب عصمت او از وجود معصیت، ترس او بود. و اگر ترس نبود، حیا از خداوند تعالی مانع می‌شد که زبان آنچه گناه نامیده می‌شود، در حق کسی که هست، بر او جاری شود، هرچند در حق او گناه نباشد، به دلیل اینکه او جز در آنچه برایش مباح شده، قرار داده نشده است. و این نهایت عنایت و عصمت از تصرف در مباح است. و بزرگترین گناهان چیزی است که قلب‌ها را می‌میراند و قلب‌ها نمی‌میرند مگر به عدم علم به خداوند، که همان جهل نامیده می‌شود؛ زیرا قلب خانه‌ای است که خداوند آن را از این نشأت انسانی برای خود برگزیده است. پس این غاصب آن را در آن غصب کرده و میان آن و مالک آن حائل شده است. پس او ظالم‌ترین مردم به نفس خود است، زیرا آن را از خیری که از صاحب این خانه به او باز می‌گشت، اگر آن را برای او رها می‌کرد، محروم کرده است. پس این محرومیت جهل است. غیر از اینکه در اینجا نکته‌ای است که باید به آن توجه شود. و آن این است که صاحب قلبی که می‌بیند پروردگارش قلب او را در بر گرفته، نه سایر نشأت او را، از درجه کسی که می‌بیند حق (الحق) عین نشأت اوست بدون تخصیص، پایین‌تر است؛ زیرا حق (الحق) گوش و چشم و تمام قوای او بوده است. پس چیزی از او را بدون چیز دیگر اختصاص نداده است. پس صاحب قلب مراقب قلب خود است و صاحب حالت دیگر، پروردگارش را بر هر چیزی که پروردگارش در آن از آن چیز مستور شده، حکم می‌کند، در حالی که برای صاحب این صفت در آن پوشش مشهود است. پس با او بر اساس آنچه به او وحی می‌شود، رفتار می‌کند. پس اگر به او وحی شود که آن را کشف کند، به دلیل عنایت حق (الحق) به این مستور از او، آن را برایش کشف می‌کند و از خود برایش خبر می‌دهد و آنچه حق (الحق) از آن است، به او می‌شناساند. و اگر به او وحی شود که پوشش را بر او باقی بگذارد، آن را باقی می‌گذارد و چیزی از آنچه در نفس خود بر آن است، برایش ظاهر نمی‌کند. پس صاحب این صفت بر صاحب قلب حکم می‌کند و صاحب قلب بر او حکم نمی‌کند، به دلیل مشغولیتش به حراست قلب خود که خانه پروردگارش است، تا غیر پروردگارش در آن وارد نشود؛ زیرا او حفیظ و دربان است. پس اگر این را فهمیدی، بنگر که کدام یک از این دو مرد هستی. و به همین دلیل اهل مراقبه همیشه در حجاب از تصرف در کون هستند و آنان اهل حدود در خداوند هستند. پس اگر از مراقبه قلب‌هایشان بالا روند، که آن بزرگترین حجاب‌هاست، و اگر در مراقبه قلب‌هایشان از مراقبه تمام عالم فراتر روند، میدان بر آنان وسیع می‌شود، اما حکم صاحب آن وصفی را که ذکر کردیم، ندارند؛ زیرا آنان مراقب او هستند، به دلیل اینکه او مراقب آنان است، زیرا او بر هر چیزی رقیب است. پس حفظ را با حفظ مقابله کردند، مقابله امثال با موازنه و مطابقت. پس همان‌گونه که او با چشم خود مراقب آنان بود، این مراقب نیز با چشم خود مراقب اوست. و کسی که تماماً حق (الحق) باشد، در نفس خود و در عالم، از صفت مراقبه خارج می‌شود؛ زیرا مراقبه مقام سلوک و راه است. پس هنگامی که در آن به واسطه او و از او به سوی او سلوک کردی، دیگر کسی نیست که مراقبه کند، زیرا در آن راه ترسی از مانعی که سالک را باز دارد، نیست. پس آن سلوکی است که در آن مراقبه نیست.\n\nو این منزل از علوم، علم افکندن پرده‌ها (إسبال الستور) و اینکه بر چه کسی افکنده می‌شود را در بر می‌گیرد. پس ممکن است پرده به جهت تعظیم افکنده شود، مانند حجاب و پرده‌ای که پشت آن پادشاه یا مخدره است. و پرده همچنین بر کسی که برای کشف آنچه پشت پرده است، رضایت ندارد، افکنده می‌شود. و ممکن است پرده‌ها به جهت رحمت بر کسانی که بر آنان افکنده می‌شود، افکنده شود، مانند حجاب‌های الهی میان عالم و خداوند، برای بقای آنان، تا شعاع‌های وجه الهی آنان را نسوزاند. پس این علم در بر می‌گیرد که چرا پرده‌ها افکنده می‌شود و بر چه کسی افکنده می‌شود. و در آن علم صور ترکیب کلام الهی با احدیت اوست که از کجا ترکیب را پذیرفته است، در حالی که او جز واحد العین نیست، تا انسان عالم میان حقیقت کلام و آنچه کسی که صفت کلام دارد، با آن سخن می‌گوید، فرق بگذارد. پس بداند که ترکیب در آنچه با آن سخن گفته می‌شود، است، نه در کلام. و علم این نوع از معلومات، علمی عزیز است که جز به علمای بالله که کلام خداوند را در اعیان ممکنات شنیده‌اند، اختصاص ندارد. و در آن علم قابل و مقبول از او و قبولی که نعت قابل است، وجود دارد. و آیا قبول به دلیل تنوع قابل، متنوع می‌شود یا قابل در آن تأثیری ندارد؟ و در آن علم حدود الهی است که چرا باز می‌گردند؛ آیا به خودشان در ذاتشان یا به خداوند یا به ممکناتی که عالم هستند؟ و در آن علم صفات منازعان است که حق (الحق) را می‌دانند و آن را می‌پوشانند، مانند فقیهانی که به مذهبی ملتزم می‌شوند که صحت آن را اعتقاد ندارند، اما بر آن مناظره می‌کنند، با علم به بطلان آن. و خصمی که در مقابل اوست، حق را بر بطلان می‌آورد و این دیگری می‌داند که حق در دست صاحبش است، اما آن را رد می‌کند و باطل را در صورت حق ظاهر می‌سازد، با علم به آن. پس آیا او با کسی که گمان می‌کند باطل حق است و از آن دفاع می‌کند، برابر است، به دلیل اینکه نزد او حق است؟ و حکم این افراد نزد خداوند در روز قیامت چیست؟ و آیا آنان مستند الهی دارند یا خیر؟ و در آن علم فرق میان انکار و جحد و کذب است و آیا این همه امری عدمی است یا وجودی؟ و اگر وجودی است، در کدام مرتبه از مراتب هستی (الوجود) است؟ آیا همه آنها را در بر می‌گیرد یا در برخی از آنهاست؟ و همچنین اگر عدمی است، در کدام مرتبه از مراتب عدم است؟ آیا در مرتبه عدمی است که وجود را نمی‌پذیرد؟ و آیا برای عدم مرتبه‌ای هست که وجود را نمی‌پذیرد، به نسبت آنچه اشاره شد؟ یا هیچ عدمی نیست مگر اینکه نسبت به مرتبه وجودی را می‌پذیرد؟ یا در مرتبه عدمی است که موصوف به آن، وجود را می‌پذیرد، که همان عدم ممکن است؟ و در آن علم قصد ضعیف‌تر به قوی‌تر به بدی است. آیا از روی قوت حقیقی است، پس ضعیف‌تر نیست؟ یا از روی قوت موهوم است، پس در نفس الأمر ضعیف‌تر است و نمی‌داند؟ پس چه چیزی او را از ضعفش محجوب می‌کند؟ و در آن علم کسی است که قدر امور و آنچه را که مستحق آن هستند، نمی‌داند. چه سببی باعث شده که او آن را نداند تا از او آنچه شایسته نیست، در آنچه شایسته نیست، ظاهر شود؟ و در آن علم مراتب فرشتگان است در آنچه عالم را نزد خداوند به آن یاد می‌کنند، زیرا آنان قرب الهی دارند و واسطه‌ها میان خداوند و خلق او هستند و در شهادت توحید در وسط قرار دارند، در سخن او: «شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ وَالْمَلائِكَةُ وَأُولُوا الْعِلْمِ» (خداوند شهادت داد که هیچ معبودی جز او نیست و فرشتگان و صاحبان علم نیز). و در آن علم برتری دادن در هر چیزی میان خداوند و خلق اوست. و در آن علم آنچه اعتراف به حق (الحق) نزد خداوند نتیجه می‌دهد، وجود دارد. و در آن علم حکم به اختیار است که آیا در عدل خدشه وارد می‌کند یا خیر؟ و در آن علم فرق میان کسی است که چیزی را از روی جهل دانسته و کسی که آن را از روی فراموشی دانسته است و صفت اهل تذکر از صفت غیر آنان چیست؟ و در آن علم اخلاص از چه کسی یا در حق چه کسی است؟ و در آن علم آنچه مکروه است و آنچه محبوب است، وجود دارد. و آیا عین آنچه زید مکروه می‌دارد، عین آنچه عمرو دوست می‌دارد، هست یا خیر؟ و در آن علم آنچه حق (الحق) بدون خلق به آن منفرد است، وجود دارد. آیا آن دانسته می‌شود یا خیر؟ و آیا می‌توان با عنایت الهی از طریق تعریف به آن رسید یا خیر؟ و اگر ممتنع باشد، مانع چیست؟ و در آن علم منزلت امام عادل و مرتبه اوست. و در آن علم احوال محجوبان از خداوند به واسطه ظلمت بدون نور است و علم محجوبان از خداوند به واسطه نور بدون ظلمت و علم محجوبان از خداوند به واسطه نور و ظلمت با هم. و آیا این حجاب‌ها رحمت بر محجوبان است یا حجاب دوری؟ و در آن علم آنچه بر اعضا از تکالیف متوجه می‌شود، وجود دارد. و در آن علم اعتبار و تفکر است. و در آن علم تأیید اهل عنایت الهی است که با چه چیزی آنان را تأیید می‌کند و در کدام موطن آنان را تأیید می‌کند و سبب موجب تسلط دشمنانشان بر آنان و تمکن آنان از ایشان چیست؟ و متجاوز بر آنان به چه چیزی استناد کرده است؟ آیا به امر وجودی الهی استناد می‌کند یا به امر وجودی نفسی؟ و در آن علم چیزی است که تو هنگامی که آن را می‌بینی، می‌گویی حق است، سپس می‌گویی باطل است، سپس می‌گویی باطل حق است، سپس می‌گویی نه باطل است و نه حق، سپس می‌گویی نمی‌دانم چیست. پس بازگشت او به جهل به آن، آیا عین علم به آن امر است یا می‌توان به علم به آن رسید، اما این شخص نرسیده است؟ پس به وصف خود نطق کرده، نه به وصف آنچه در مورد آن سخن گفته است. و در آن علم انصاف بدون تعصب و آنچه در محضر اوست و تسکین غضب از شخص خشمگین با لطفی از سوی تسکین دهنده است، نه با قهر؛ زیرا قهر غضب را تسکین نمی‌دهد، بلکه حکمش را به دلیل سلطه قهر بر آن پنهان می‌کند. و در آن علم احاطه فرشتگان به عالم در روزی که صف می‌کشند، وجود دارد، در حالی که امروز نیز بر همان صورت هستند. و علم فرق میان حکم آنان در مورد ما امروز و حکم آنان در آن روز، در حالی که صفت احاطه یکی است. و چرا در آنجا برخی از آنان برخی دیگر را ندا می‌دهند و در اینجا چنین نیست، مگر در مواطن مخصوص؟ زیرا قیامت عیناً بر صورت دنیاست، جز اینکه حاکم در آنجا واحد است با ارتفاع واسطه‌ها، و در اینجا نیز حاکم همان واحد است، اما با واسطه‌ها، تا میان دو سرا فرق بگذارد، همان‌گونه که با بهشت و دوزخ میان دو قبضه فرق گذاشت. و در آن علم کسی است که بر خداوند حکم می‌کند. از کجا حکم کرده است و چه چیزی او را بر آن جرأت داده است؟ آیا صفت حق است یا صفت جهل؟ و در آن علم عنایت الهی به جباران متکبر است. و در آن علم آنچه خداوند از اسماء الهی مصون داشته است، وجود دارد که چرا آن را مصون داشته و آنچه را که از اسماء الهی مصون نداشته است، مانند اسم «الأحد» (یکتا) که در این اسم تجلی نمی‌کند و تجلی در آن صحیح نیست و نه در اسم «الله». و آنچه غیر از این دو اسم از اسماء معلوم ماست، تجلی در آنها واقع می‌شود. و در آن علم حرکت در عین سکون است. و در آن علم اشتراک میان مؤمن و عالم است که در کدام حضرت (حضور) خواهد بود و با چه چیزی از هم متمایز می‌شوند؟ و آیا مؤمن به درجه عالم می‌رسد؟ و آنچه را که از جهت خبر صادق می‌پذیرد، آیا به واسطه آن به درجه علما ملحق می‌شود یا خیر؟ و آیا دلیل بر تصدیق رسولان در ادعایشان که رسول هستند، در دلالت بر آنچه از اخبار و احکام آورده‌اند، نیز جاری می‌شود یا به دلیل دیگری نیازمندند؟ یا با وجود مقلد بودن، عالم خواهند بود؟ و در آن علم دور است در اینکه دعوت کننده به حکم تعارض، دعوت شونده برای کسی باشد که او را دعوت کرده است. و در آن علم حکم طلب نجات در تمام عالم به طور طبیعی است، اما نادیده گرفته می‌شود. و صنف کسانی که آن را از عالم می‌دانند، کیستند و نجات چیست؟ و در آن علم علامت هر دعوت کننده و آنچه از اسماء الهی به آن دعوت می‌کند، وجود دارد. و در آن علم زمانی است که انسان آنچه در دست دارد را رها می‌کند و بر آن اعتماد نمی‌کند و تمام امور خود را به خداوند تسلیم می‌نماید. و در آن علم «الجین» و بازگشت تیرها به سوی پرتاب کننده آن است. و من این تیراندازی را در شهر تلمسان از عالمی به صنعت تیراندازی و ساخت کمان‌ها و تیرها مشاهده کردم. پس دیدم که تیری را پرتاب می‌کند و هنگامی که تیر به هدفش می‌رسید، به سوی پرتاب کننده باز می‌گشت. پس این برای من عبرتی بود در اینکه اعمال به سوی عاملانشان باز می‌گردد. و در آن علم آنچه به منزله زمان نازل می‌شود، در حالی که زمان نیست، وجود دارد. و در آن علم نزاع پس از حکم حاکم و سبب آن است، زیرا در رد حکم تأثیری ندارد. و در آن علم مراتب شهود از حاکم و ترک حکم حاکم به آنچه می‌داند و حکم کردن به قول شهود است و سبب وضع آن در عالم چیست؟ اما این نزد ما جز در اموال نیست، نه در نفوس و نه در اجرای حدود. و در آن علم آنچه به دلیل نیاز مبرم، تأخیر آن جایز نیست، وجود دارد. و فایده بیانی که برای حصول علم وضع شده و حکم به آن ترک می‌شود، چیست؟ و این در کدام نوازل (حوادث) رخ می‌دهد؟ و در این مسئله چه کسی بر صواب است؟ آیا کسی که می‌گوید به علم خود حکم می‌کند یا مخالف او؟ و نزد من در این مسئله، اگر به امری عالم بودم و شهود بر خلاف علم من شهادت می‌دادند و برایم جایز نبود که به علم خود حکم کنم، اگر از کسانی بودم که به آن قائل هستند، کسی را که به آن امر علم ندارد، برای حکم نایب می‌کردم و حکم در آن را ترک می‌کردم. و این نزد من وجه صحیح است و به آن عمل می‌کنم، هرچند در نفس از آن چیزی باشد. و این نزد من در حکم در اموال است. اما حکم در ابدان، جز به علم خود حکم نمی‌کنم، اگر برائت را بدانم. و اگر برائت نبود و صدق افترا زننده را می‌دانستم، به شهود حکم می‌کردم و علم خود را ترک می‌کردم. و علم سبب این راهی که من پیموده‌ام، در این منزل گنجانده شده است. و در آن علم آنچه عالم به واسطه آن بر انسان برتری می‌یابد، وجود دارد و آن این است که برای او بر او ولادتی است. و در آن علم مسمای ساعت است. و در آن علم آیا تکبر از عالم بر خداوند صحیح است یا خیر؟ و در آن علم آنچه اشیاء از امور به طور ذاتی طلب می‌کنند، وجود دارد. آیا خرق عادت در آن صحیح است که با جعل (قرار دادن) باشد یا خیر؟ و اگر خرق عادت در آن رخ داد، محل خرق عادت کجاست؟ آیا در طالب است که آنچه ذاتش اقتضا می‌کرد، از آن تبعیت کند یا خیر؟ و در آن علم حضرت (حضور) تقریر نعمت‌ها بر کسی که نعمت به او داده شده، وجود دارد که آیا آن از جهت تعلیم است یا از جهت انکار او نسبت به آن؟ و در آن علم اصل حیات عالم حسی و معنوی است که آیا به یک اصل باز می‌گردد یا خیر؟ و آیا در طبیعت حیات هست تا حیات حسی را بدهد یا خیر؟ و در آن علم نشأت انسانی دنیوی و احوال آن در مدت بقایش در این سرا و سرانجام امر آن از حیث جسمیت پس از مرگ است. و در آن علم مرگ و حیات است که آیا آن نسبت است یا عین موجودی است که در مواطن مختلف ظاهر می‌شود؟ و حکم میراننده (الممیت) این است که آیا با مرگی می‌میراند که سبب باشد یا فقط می‌میراند؟ و همچنین حیات. پس عین مرده، عین مرگ است به حکم میراننده. و در آن علم قضا و برتری آن بر قدر است. و در آن علم این است که آیه (معجزه) که رسول می‌آورد، شرط نیست و آوردن آن بر او واجب نیست. و در آن علم مراعات خداوند بندگانش را با وجود سوء ادب آنان با خداوند است. و در آن علم عموم نفع ایمان در آخرت است. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 7
}