{
  "id": 507,
  "title": {
    "ar": "الباب السابع وخمسمائة في معرفة حال قطب كان منزله قوله تعالى أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏",
    "en": "Chapter Five Hundred and Seven: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was His Saying, the Exalted: <<Did he not know that Allah sees?>>",
    "ur": "باب پانچ سو سات (۵۰۷): اس قطب کے حال کی معرفت (معرفۃ) کے بیان میں جس کا روحانی مقام (منزل) اللہ تعالیٰ کا یہ قول تھا: (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏) \"کیا وہ نہیں جانتا کہ اللہ دیکھ رہا ہے؟\"",
    "fa": "باب پانصد و هفتم در معرفت حال قطبی که منزل او این سخن خداوند بود: «آیا نمی‌داند که خداوند می‌بیند؟» (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏)"
  },
  "content": {
    "ar": "## (الباب السابع وخمسمائة في معرفة حال قطب كان منزله قوله تعالى أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏)\n\n\n> أ لم تعلم بأن الله منا *** يرانا والوجود لنا شهيد\n\n\n> فيلزمنا الحياء فلا يرانا *** بحيث نهى ونحن له شهود\n\n\n> وذا من أعجب الأشياء عندي *** فيأمرنا ويفعل ما يريد\n\n\n> يقول لي استقم ويريد مني *** مخالفة يؤيدها الوجود\n\n\n> فيا قوم اسمعوا ما قلت فيمن *** هو المولى ونحن له عبيد\n\n\n> يريد الأمر لا المأمور فانظر *** إلى حكم يشيب له الوليد\n\n\n### [المؤمن على كل حال يعلم أن الله يراه‏]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم استحيوا من الله حق الحياء\n\n\nما قال الله تعالى أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏ وعرف بذلك عباده لاختلاف أهل النظر في ذلك بين الطريقين بين أنه يرانا وبين أنا نراه فالمؤمن على كل حال يعلم أن الله يراه من هذا التعريف فما عرفهم إلا ليلزموا الحياء منه تعالى في تعدى حدوده فمن كان ذكره هذا الذكر فإن الله يتجلى له في‏\nهذه الدار تجليه لجبل موسى عليه السلام ولكن لا يجعله دكا وسبب ذلك الدءوب على هذا الذكر فإنه يورث العبد قوة وتلك القوة من كون الذاكر لا يزال يذكر الله والله جليس من يذكره وإن لم يشعر به فأول ما يفتح الله لكل ذاكر في نفسه معرفة من يذكر الله به فلا يرى الذاكر منه الله إلا لهوية الحق ثم في سمعه ذكره كذلك يشهد أنه لا يسمع ذكر الله منه إلا الله فإذا رأى نفسه حقا كله حينئذ يقع له التجلي الذي وقع لجبل موسى ولموسى فلا يندك ولا يصعق وإن فنى فإنما يفنيه جمال ذلك المشهود\n\n\nفإن الله جميل ويحب الجمال‏\n\n\nفلا بد أن يكسو الله باطن هذا العبد من الجمال بحيث إنه لا يتجلى له إلا حبا لما ظهر فيه من الجمال الخاص المقيد به الذي لا يمكن أن يظهر ذلك الجمال إلا في هذا المحل الخاص فإنه لكل محل جمال يخصه لا يكون لغيره ولا ينظر الله إلى العالم إلا بعد أن يجمله ويسويه حتى يكون قبوله لما يرد به عليه في تجليه على قدر جمال استعداده فيكسوه ذلك التجلي جمالا إلى جمال فلا يزال في جمال جديد في كل نجل كما لا يزال في خلق جديد في نفسه فله التحول دائما في باطنه وظاهره لمن كشف الله عن بصيرته غطاء عماه‏\n\n\n### [إن الله حددنا أن لا تجاوز عن الحدود المشروعة]\n\n\nواعلم أن الحدود الموضوعة في العالم أعني الحدود المشروعة التي أمرنا الحق أن لا نتعداها ثم شرع لنا حدودا تقام علينا إذا تعديناها كل ذلك لنعرف أن الأمر حد كله فينا وفيه دنيا وآخرة لأن بالحدود يقع التمييز وبالتمييز يكون العلم فلو لا الفارق لما تميزت عين من عين ولا كان ثم علم بشي‏ء أصلا وقد تميز لنا وبنا وعنا كما تميزنا له وبه وعنه فعرفنا من نحن ومن هو فإن غلبنا حال يقول ذلك الحال بلسانه‏\n\n\nأنا من أهوى ومن أهوى أنا\n\n\nفيكفيه من قوة أثر الحدود إن فرق بين أنا وبين من أهوى ولو أنه يهوى نفسه فحاله كونه يهوى وهو الفاعل ما هو عين حاله يهوى وهو المفعول فبينت الحدود الأحوال كما بينت الأعيان وهذا علم ما تصل إليه العبارة في أحدية العين ولم يقدر على أن يوحد الحال ولا ذلك بممكن أصلا وفي باب العلم بالله أوصل ما يكون الأمر وأعظم في الأحدية أن يكون وجود العالم عين وجود الحق لا غيره ومعلوم اختلاف صور العالم واختلاف الأسماء الإلهية ولا معنى للاختلاف الواضح إلا العلم بأنه لو لا الحدود لما كان التمييز وإن كان الوجود عينا واحدة وهو الوجود الحق فالموجودات والمعقولات مختلفة ولقد لعن الله على لسان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من غير منار الأرض وهو الحدود لأن التشابه إذا غمض جدا أوقع الحيرة وخفي الحد فيه فإن شخصيات النوع الواحد الأخير متماثلة بالحد متميزة بالشخص فلا بد من فارق في المتماثل بالحد ويكفيك إن جعلته مثله لا عينه‏\n\n\n> فالحد يصحب ما في العلم أجمعه *** والحد يصحبه التحديد في النظر\n\n",
    "en": "Chapter 507: Concerning the Knowledge of the State of a Pole Whose Station Was the Saying of the Exalted: <<أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏>> (Does he not know that Allah sees?)\n\nDo you not know that Allah, from our very essence,\nSees us, while Existence (الوجود) bears witness for us?\n\nThus, modesty (الحياء) obliges us, lest He see us\nWhere He forbade, even though we are witnesses (شهود) unto Him.\n\nThis is among the most wondrous things to me:\nHe commands us, yet He does what He wills.\n\nHe tells me, 'Be upright,' yet He wills from me\nA contravention that Existence (الوجود) confirms.\n\nO people, listen to what I have said concerning Him\nWho is the Master (المولى), while we are His servants (عبيد).\n\nHe wills the Command (الأمر), not the one commanded; so look\nAt a decree (حكم) that would turn the newborn child gray.\n\n### [The Believer Knows in Every State that Allah Sees Him]\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"Be truly modest before Allah.\"\n\nThe Exalted Allah did not say <<أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏>> (Does he not know that Allah sees?) and thereby introduce His servants to this knowledge, except because of the disagreement among the people of contemplation (أهل النظر) regarding the two paths: whether He sees us, or whether we see Him. The believer, in every state, knows that Allah sees him, based on this Divine introduction. He only introduced them to this knowledge so that they might be obliged to feel modesty (الحياء) before Him, the Exalted, when transgressing His limits (حدوده).\n\nWhoever makes this remembrance (ذكر) his constant practice, Allah will manifest Himself (يتجلى) to him in this abode—a theophany (تجلي) like His manifestation to the mountain of Moses (peace be upon him)—but He will not cause it to crumble. The reason for this is persistence in this remembrance, for it bequeaths strength to the servant. That strength arises from the fact that the rememberer (الذاكر) continuously remembers Allah, and Allah is the Companion (جليس) of whoever remembers Him, even if the rememberer is unaware of it.\n\nThe first thing Allah opens for every rememberer within his own soul is the Gnosis (معرفة) of the one through whom he remembers Allah. Thus, the rememberer sees Allah in himself only as the Ipseity of the Real (لهوية الحق). Then, in his hearing of the remembrance, he likewise witnesses that he hears the remembrance of Allah from himself only as Allah. When he sees his own self as entirely the Real (حقاً كله), then the theophany (التجلي) that occurred for the mountain of Moses and for Moses himself takes place for him, yet he neither crumbles nor is struck unconscious. And if he undergoes annihilation (فنى), it is only the beauty (جمال) of that Witnessed Reality (المشهود) that annihilates him.\n\nFor Allah is Beautiful and loves beauty. Therefore, Allah must clothe the inner being (باطن) of this servant with beauty, such that He only manifests Himself (يتجلى) to him out of love for the specific, restricted beauty that has appeared within him—a beauty that cannot possibly appear except in that particular locus (المحل الخاص). For every locus has a specific beauty unique to it, which belongs to no other. Allah does not look upon the World (العالم) until He has beautified and perfected it, so that its acceptance (قبوله) of what comes to it through His theophany (تجليه) is commensurate with the beauty of its preparedness (استعداده). That theophany then clothes him with beauty upon beauty, so he remains in new beauty in every manifestation, just as he remains in a new creation (خلق جديد) within himself. Thus, transformation (التحول) is constant for him, both inwardly (باطنه) and outwardly (ظاهره), for the one whose inner sight (بصيرته) Allah has unveiled from the covering of his blindness.\n\n### [Indeed, Allah Has Limited Us Not to Transgress the Prescribed Bounds]\n\nKnow that the limits (الحدود) established in the World (العالم)—meaning the prescribed limits (الحدود المشروعة) which the Real (الحق) commanded us not to transgress, and then legislated limits to be imposed upon us if we do transgress them—all of this is so that we may know that the Command (الأمر) is entirely a limit (حد) in us and in Him, both in this world (دنيا) and the Hereafter (آخرة). This is because distinction (التمييز) occurs through limits, and through distinction comes Knowledge (العلم). Were it not for the distinguishing factor (الفارق), no entity (عين) would be distinguished from another entity, nor would there be any knowledge (علم) of anything whatsoever.\n\nDistinction has occurred for us, by us, and from us, just as we have been distinguished for Him, by Him, and from Him. Thus, we have known who we are and who He is. If a spiritual state (حال) overcomes us, and that state speaks with its tongue: \"I am the one I love, and the one I love is I,\" then the power of the effect of the limits (الحدود) is sufficient for him, in that it differentiates between \"I\" and \"the one I love,\" even if he loves his own self. For his state of loving, while he is the agent (الفاعل), is not identical to his state of being loved, while he is the object (المفعول). Thus, the limits clarify the states (الأحوال) just as they clarify the entities (الأعيان).\n\nThis is a knowledge (علم) that expression (العبارة) cannot reach regarding the Oneness (أحدية) of the entity (العين), and it is not possible to unify the state (الحال), nor is that possible at all. In the chapter concerning the Knowledge of Allah (العلم بالله), the most comprehensive and greatest aspect of Oneness (الأحدية) is that the Existence (وجود) of the World (العالم) is the very Essence (عين) of the Existence of the Real (وجود الحق) and nothing else. Yet, the difference in the forms of the World and the difference in the Divine Names (الأسماء الإلهية) are known. The clear difference (الاختلاف الواضح) has no meaning other than the knowledge that were it not for the limits (الحدود), there would be no distinction (التمييز), even though Existence (الوجود) is a single Essence (عينا واحدة), which is the Real Existence (الوجود الحق). Thus, the existents (الموجودات) and the intelligibles (المعقولات) are different.\n\nIndeed, Allah cursed, through the tongue of the Messenger of Allah (peace and blessings be upon him), the one who changes the landmarks of the earth (منار الأرض), which are the limits (الحدود). This is because when similarity (التشابه) becomes extremely subtle, it causes confusion (الحيرة) and the limit (الحد) within it becomes hidden. For the individualities (شخصيات) of the final single species are similar by definition (بالحد) but distinguished by person (بالشخص). Therefore, there must be a distinguishing factor (فارق) in that which is similar by definition. It is sufficient for you that you make it *like* Him, not His *Essence* (عينه).\n\nThe limit (الحد) accompanies all that is contained within Knowledge (العلم),\nAnd the limit is accompanied by definition (التحديد) in contemplation (النظر).",
    "ur": "باب نمبر پانچ سو سات (۵۰۷) اس قطب کے حال کی معرفت میں جس کی منزل اللہ تعالیٰ کا یہ قول تھا: \"کیا وہ نہیں جانتا کہ اللہ دیکھ رہا ہے؟\" (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏)\n\nکیا تو نہیں جانتا کہ اللہ ہم میں سے ہے؟\nوہ ہمیں دیکھتا ہے اور الوجود (الوجود) ہمارا گواہ ہے۔\nپس ہم پر حیا لازم ہے تاکہ وہ ہمیں وہاں نہ دیکھے\nجہاں سے اس نے منع کیا ہے، حالانکہ ہم اس کے لیے شاہد ہیں۔\nاور یہ میرے نزدیک عجیب ترین چیزوں میں سے ہے،\nکہ وہ ہمیں حکم دیتا ہے اور خود جو چاہتا ہے کرتا ہے۔\nوہ مجھ سے کہتا ہے کہ استقامت اختیار کر، اور مجھ سے ایسی مخالفت چاہتا ہے\nجس کی تائید الوجود (الوجود) کرتا ہے۔\nاے قوم! سنو جو میں نے اس کے بارے میں کہا ہے\nجو ہمارا مولیٰ ہے اور ہم اس کے بندے ہیں۔\nوہ حکم کو چاہتا ہے نہ کہ مامور کو، پس اس حکم کو دیکھو\nجس سے بچہ بھی بوڑھا ہو جائے۔\n\n### [مومن ہر حال میں جانتا ہے کہ اللہ اسے دیکھ رہا ہے]\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اللہ سے حیا کرو جیسا کہ حیا کرنے کا حق ہے۔\" (استحيوا من الله حق الحياء)\n\nاللہ تعالیٰ نے یہ نہیں فرمایا: \"کیا وہ نہیں جانتا کہ اللہ دیکھ رہا ہے؟\" (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏) اور اس کے ذریعے اپنے بندوں کو اس لیے معرفت (المعرفۃ) کرائی کہ اہل نظر (اہل النظر) اس میں دو طریقوں کے درمیان اختلاف رکھتے ہیں: ایک یہ کہ وہ ہمیں دیکھتا ہے، اور دوسرا یہ کہ ہم اسے دیکھتے ہیں۔ پس مومن ہر حال میں اس تعریف کی بنا پر جانتا ہے کہ اللہ اسے دیکھ رہا ہے۔ اس نے انہیں معرفت (المعرفۃ) صرف اس لیے کرائی تاکہ وہ اس کی حدود سے تجاوز کرنے میں اس سے حیا (الحیاء) لازم پکڑیں۔ پس جو شخص اس ذکر کو اپنا ذکر بنا لے، تو اللہ تعالیٰ اس دارِ دنیا میں اس پر اسی طرح التجلی (التجلی) فرماتا ہے جس طرح اس نے موسیٰ علیہ السلام کے پہاڑ پر التجلی (التجلی) فرمائی تھی، لیکن اسے ریزہ ریزہ نہیں کرتا۔ اس کا سبب اس ذکر پر مستقل محنت کرنا ہے، کیونکہ یہ بندے کو قوت عطا کرتا ہے، اور یہ قوت اس بات سے حاصل ہوتی ہے کہ ذاکر مسلسل اللہ کا ذکر کرتا ہے، اور اللہ اس کا ہم نشین ہوتا ہے جو اسے یاد کرتا ہے، اگرچہ وہ اسے محسوس نہ کرے۔ پس اللہ ہر ذاکر کے لیے سب سے پہلے اس کے نفس میں اس کی معرفت (المعرفۃ) کھولتا ہے جس کے ذریعے وہ اللہ کا ذکر کرتا ہے۔ چنانچہ ذاکر اس سے اللہ کو صرف ہویت الحق (ہویت الحق) کے لیے دیکھتا ہے۔ پھر اس کے کان میں بھی اس کا ذکر اسی طرح ہوتا ہے، وہ شہود (الشہود) کرتا ہے کہ وہ اللہ کا ذکر اس سے نہیں سنتا مگر اللہ ہی سے۔ جب وہ اپنے نفس کو مکمل طور پر حق (الحق) دیکھتا ہے، تب اسے وہ التجلی (التجلی) حاصل ہوتی ہے جو موسیٰ اور پہاڑ کو حاصل ہوئی تھی، لیکن وہ نہ ریزہ ریزہ ہوتا ہے اور نہ ہی بیہوش ہوتا ہے۔ اور اگر وہ فنا (الفناء) ہوتا ہے تو اسے اس مشہود کے جمال (الجمال) کی وجہ سے فنا (الفناء) حاصل ہوتی ہے۔\n\n\"بے شک اللہ جمیل ہے اور جمال کو پسند کرتا ہے۔\" (فإن الله جميل ويحب الجمال)\n\nپس ضروری ہے کہ اللہ اس بندے کے باطن کو اس قدر جمال (الجمال) سے آراستہ کر دے کہ وہ اس پر التجلی (التجلی) صرف اس جمال (الجمال) کی محبت میں کرے جو اس میں ظاہر ہوا ہے، وہ خاص اور مقید جمال جو اس خاص محل کے سوا ظاہر نہیں ہو سکتا۔ کیونکہ ہر محل کے لیے ایک خاص جمال ہوتا ہے جو کسی دوسرے کے لیے نہیں ہوتا۔ اور اللہ عالم کی طرف نہیں دیکھتا مگر اس کے بعد کہ وہ اسے خوبصورت بنا دے اور اسے ہموار کر دے، تاکہ اس کی التجلی (التجلی) میں جو کچھ اس پر وارد ہو، اس کا قبول اس کی استعداد کے جمال کے مطابق ہو۔ پس وہ التجلی (التجلی) اسے جمال پر مزید جمال عطا کرتی ہے۔ چنانچہ وہ ہر التجلی (التجلی) میں نئے جمال میں رہتا ہے، جیسا کہ وہ اپنے نفس میں مسلسل نئی تخلیق میں رہتا ہے۔ پس اس کے لیے باطن اور ظاہر میں ہمیشہ تبدیلی رہتی ہے، اس شخص کے لیے جس کی بصیرت سے اللہ نے اس کی نابینائی کا پردہ ہٹا دیا ہو۔\n\n### [بے شک اللہ نے ہمیں حدود مقرر کی ہیں تاکہ ہم شرعی حدود سے تجاوز نہ کریں]\n\nاور جان لو کہ عالم میں جو حدود مقرر کی گئی ہیں، یعنی وہ شرعی حدود جن سے تجاوز نہ کرنے کا الحق (الحق) نے ہمیں حکم دیا ہے، پھر ہمارے لیے وہ حدود مقرر کیں جو ہم پر قائم کی جاتی ہیں اگر ہم ان سے تجاوز کریں، یہ سب اس لیے ہے تاکہ ہم جان لیں کہ امر (حکم) مکمل طور پر ہم میں اور اس میں دنیا اور آخرت کے لحاظ سے حد (حدود) ہے۔ کیونکہ حدود کے ذریعے ہی تمییز (التمییز) واقع ہوتی ہے، اور تمییز (التمییز) کے ذریعے ہی علم (العلم) حاصل ہوتا ہے۔ اگر فرق کرنے والی چیز نہ ہوتی تو کوئی عین (عین) دوسرے عین (عین) سے ممتاز نہ ہوتا اور نہ ہی کسی چیز کا علم (العلم) ہوتا۔ اور ہمارے لیے، ہمارے ذریعے اور ہم سے تمییز (التمییز) ہوئی، جیسا کہ ہم اس کے لیے، اس کے ذریعے اور اس سے ممتاز ہوئے۔ پس ہم نے جانا کہ ہم کون ہیں اور وہ کون ہے۔ اگر ہم پر کوئی ایسا حال غالب آ جائے جو اپنی زبان سے یہ کہے:\n\nمیں وہ ہوں جسے میں چاہتا ہوں اور جسے میں چاہتا ہوں وہ میں ہوں۔ (أنا من أهوى ومن أهوى أنا)\n\nتو حدود کے اثر کی قوت اس کے لیے کافی ہے کہ وہ \"میں\" اور \"جسے میں چاہتا ہوں\" کے درمیان فرق کرے۔ اگرچہ وہ اپنے نفس کو ہی چاہتا ہو۔ پس اس کا حال یہ ہے کہ وہ چاہنے والا ہے اور وہ فاعل ہے، جو اس کے عین حال ہے کہ وہ چاہنے والا ہے اور وہ مفعول ہے۔ پس حدود نے احوال کو واضح کیا جیسا کہ اس نے اعیان (الاعیان) کو واضح کیا۔ اور یہ ایسا علم ہے جہاں عین (العین) کی احدیت (الاحدیۃ) میں عبارت نہیں پہنچ سکتی، اور نہ ہی حال کو واحد قرار دیا جا سکتا ہے، اور نہ ہی یہ اصلاً ممکن ہے۔ اور اللہ کے علم (العلم باللہ) کے باب میں، احدیت (الاحدیۃ) میں سب سے زیادہ پہنچنے والا اور عظیم امر یہ ہے کہ عالم کا الوجود (الوجود) عین الوجود الحق (الوجود الحق) ہو، کوئی اور نہیں۔ اور عالم کی صورتوں کا اختلاف اور اسماء الٰہیہ کا اختلاف معلوم ہے۔ اور اس واضح اختلاف کا کوئی معنی نہیں مگر یہ علم کہ اگر حدود نہ ہوتیں تو تمییز (التمییز) نہ ہوتی، اگرچہ الوجود (الوجود) ایک ہی عین ہے اور وہ الوجود الحق (الوجود الحق) ہے۔ پس موجودات اور معقولات مختلف ہیں۔ اور اللہ نے رسول اللہ صلی اللہ علیہ وسلم کی زبان سے اس شخص پر لعنت فرمائی جس نے زمین کے نشانات (منار الارض) کو بدل دیا، اور یہ حدود ہیں۔ کیونکہ جب تشابہ بہت گہرا ہو جاتا ہے تو حیرت پیدا ہوتی ہے اور اس میں حد (الحد) پوشیدہ ہو جاتی ہے۔ کیونکہ ایک ہی نوع کی آخری شخصیات حد (الحد) کے لحاظ سے مماثل ہوتی ہیں لیکن شخص کے لحاظ سے ممتاز ہوتی ہیں۔ پس حد (الحد) میں مماثل چیز میں فرق کرنے والی چیز کا ہونا ضروری ہے، اور تمہارے لیے یہ کافی ہے کہ تم اسے اس جیسا بناؤ، نہ کہ عین وہی۔\n\nپس حد (الحد) ہر اس چیز کے ساتھ رہتی ہے جو علم (العلم) میں ہے،\nاور حد (الحد) کے ساتھ نظر میں تحدید (حد بندی) رہتی ہے۔",
    "fa": "باب پانصد و هفتم در معرفت حال قطبی که منزل او این سخن خداوند بود: «آیا نمی‌داند که خداوند می‌بیند؟» (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏).\n\nآیا نمی‌دانی که خداوند از ماست\nما را می‌بیند و هستی (الوجود) برای ما گواه است\n\nپس حیا بر ما لازم است تا ما را نبیند\nدر جایی که نهی کرده است، در حالی که ما برای او شاهدیم (شهود)\n\nو این از شگفت‌ترین چیزها نزد من است\nکه ما را امر می‌کند و آنچه می‌خواهد انجام می‌دهد\n\nبه من می‌گوید: «استقامت کن»، اما از من مخالفت می‌خواهد\nکه هستی (الوجود) آن را تأیید می‌کند\n\nای قوم، بشنوید آنچه را که درباره کسی گفتم\nکه او مولاست و ما بندگان اوییم\n\nاو امر را می‌خواهد نه مأمور را، پس بنگر\nبه حکمی که کودک از آن پیر می‌شود\n\n### [مؤمن در هر حال می‌داند که خداوند او را می‌بیند]\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «از خداوند چنان که شایسته حیاست، حیا کنید.»\n\nخداوند متعال نفرمود: «آیا نمی‌داند که خداوند می‌بیند؟» (أَ لَمْ يَعْلَمْ بِأَنَّ الله يَرى‏) و بندگانش را به این وسیله شناساند، به دلیل اختلاف اهل نظر در این باره میان دو راه: یکی اینکه او ما را می‌بیند و دیگری اینکه ما او را می‌بینیم. پس مؤمن در هر حال می‌داند که خداوند او را می‌بیند، از این تعریف. خداوند آنان را نشناسانده است مگر برای اینکه حیا از او را در تجاوز از حدودش بر خود لازم سازند. پس هر کس ذکرش این ذکر باشد، خداوند در این دنیا بر او تجلی (التجلی) می‌کند، همانند تجلی‌اش بر کوه موسی (علیه السلام)، اما آن را متلاشی (دک) نمی‌سازد. و سبب این امر، مداومت بر این ذکر است، زیرا این ذکر به بنده قدرتی می‌بخشد، و آن قدرت ناشی از این است که ذاکر پیوسته خدا را یاد می‌کند و خداوند همنشین کسی است که او را یاد می‌کند، هرچند که او متوجه نشود.\n\nپس اولین چیزی که خداوند برای هر ذاکری در نفس او می‌گشاید، معرفت (المعرفة) کسی است که خدا را به واسطه او یاد می‌کند. از این رو، ذاکر از خود، خدا را نمی‌بیند مگر به هویت حق (الحق). سپس در شنیدن ذکرش نیز چنین شهود (الشهود) می‌کند که ذکر خدا را از خود نمی‌شنود مگر خدا. پس هنگامی که نفس خود را تماماً حق دید، در آن هنگام تجلی (التجلی) که برای کوه موسی و موسی رخ داد، برای او نیز رخ می‌دهد، اما نه متلاشی می‌شود و نه صاعقه می‌زند. و اگر هم فنا (الفناء) شود، تنها جمال آن مشهود او را فانی می‌سازد.\n\nزیرا خداوند زیباست و زیبایی را دوست دارد.\n\nپس ناگزیر است که خداوند باطن این بنده را از زیبایی بپوشاند، به طوری که بر او تجلی (التجلی) نکند مگر از روی محبت به آنچه از جمال خاص و مقید به او در وی ظاهر شده است؛ جمالی که ممکن نیست جز در این محل خاص ظاهر شود. زیرا هر محلی جمالی مخصوص به خود دارد که برای دیگری نیست. و خداوند به عالم نمی‌نگرد مگر پس از آنکه آن را زیبا و موزون سازد تا پذیرش او برای آنچه در تجلی (التجلی) بر او وارد می‌شود، به اندازه زیبایی استعدادش باشد. پس آن تجلی (التجلی) زیبایی بر زیبایی او می‌افزاید. از این رو، او پیوسته در جمالی جدید در هر تجلی (التجلی) است، همان‌گونه که پیوسته در خلقتی جدید در نفس خود است. پس برای کسی که خداوند پرده کوری را از بصیرتش برداشته است، تحول دائمی در باطن و ظاهر او وجود دارد.\n\n### [همانا خداوند برای ما حدودی قرار داده است که از مرزهای مشروع تجاوز نکنیم]\n\nو بدان که حدود (الحدود) وضع شده در عالم، یعنی حدود (الحدود) مشروع که حق (الحق) ما را امر کرده است که از آنها تجاوز نکنیم، و سپس برای ما حدودی وضع کرده است که اگر از آنها تجاوز کنیم بر ما اقامه می‌شوند، همه اینها برای آن است که بدانیم امر در ما و در آن (دنیا و آخرت) تماماً حد (الحد) است. زیرا تمییز به واسطه حدود (الحدود) رخ می‌دهد و علم به واسطه تمییز حاصل می‌شود. اگر تمییزدهنده نبود، هیچ عینی از عین دیگر متمایز نمی‌شد و اصلاً علمی به چیزی وجود نداشت. و برای ما، به واسطه ما و از ما تمییز حاصل شده است، همان‌گونه که ما برای او، به واسطه او و از او متمایز شده‌ایم. پس دانستیم که ما کیستیم و او کیست.\n\nاگر حالی بر ما غلبه کند که آن حال با زبان خود بگوید:\n«من کسی هستم که دوستش دارم و کسی که دوستش دارم من هستم.»\n\nپس از نیروی اثر حدود (الحدود) همین بس که میان «من» و «کسی که دوستش دارم» تفاوت قائل شود، حتی اگر او نفس خود را دوست داشته باشد. پس حال او این است که دوست می‌دارد در حالی که فاعل است، که عین حال اوست که دوست داشته می‌شود در حالی که مفعول است. پس حدود (الحدود) احوال را تبیین کردند، همان‌گونه که اعیان را تبیین کردند. و این علمی است که عبارت در احدیت (الأحدية) عین به آن نمی‌رسد و نتوانسته است حال را واحد سازد، و این اصلاً ممکن نیست. و در باب علم به خداوند، کامل‌ترین و عظیم‌ترین امر در احدیت (الأحدية) این است که هستی (الوجود) عالم عین هستی (الوجود) حق (الحق) باشد و نه غیر آن. و اختلاف صور عالم و اختلاف اسماء الهی معلوم است، و معنایی برای این اختلاف آشکار نیست مگر علم به اینکه اگر حدود (الحدود) نبودند، تمییزی وجود نداشت، هرچند که هستی (الوجود) یک عین واحد است و آن هستی حق (الوجود الحق) است. پس موجودات و معقولات متفاوتند. و به راستی خداوند بر زبان رسول خدا (صلی الله علیه و سلم) کسی را لعنت کرده است که نشانه‌های زمین (منار الأرض) را تغییر دهد، و آن نشانه‌ها همان حدود (الحدود) هستند. زیرا اگر تشابه بسیار عمیق شود، حیرت ایجاد می‌کند و حد (الحد) در آن پنهان می‌ماند. شخصیت‌های نوع واحد اخیر، به واسطه حد (الحد) متماثل و به واسطه شخص متمایز هستند. پس در آنچه به واسطه حد (الحد) متماثل است، وجود یک تمییزدهنده ضروری است، و همین برای تو کافی است که آن را مثل او قرار دهی نه عین او.\n\nپس حد (الحد) با تمام آنچه در علم است همراه است\nو حد (الحد) با تحدید در نظر همراه است."
  },
  "page_count": 2
}