{
  "id": 241,
  "title": {
    "ar": "الباب الأحد والأربعون ومائتان في معرفة الجلال",
    "en": "Chapter 241: Concerning the Gnosis (المعرفة) of Majesty (الجلال)",
    "ur": "۲۴۱ واں باب جلال کی معرفت میں",
    "fa": "باب دویست و چهل و یکم در معرفت جلال (الجلال)"
  },
  "content": {
    "ar": "## «الباب الأحد والأربعون ومائتان في معرفة الجلال»\n\n\n> إن الجلال على الضدين ينطلق *** وهو الذي بنعوت القهر أشهده‏\n\n\n> له العلو ولا علو يماثله *** له النزول فكل الخلق يجحده‏\n\n\n> إني بكل الذي قد قلت أعرفه *** وليس غير الذي قد قلت أقصده‏\n\n\n### [أن الجلال نعت إلهي يعطي في القلوب هيبة وتعظيما]\n\n\nاعلم أن الجلال نعت إلهي يعطي في القلوب هيبة وتعظيما وبه ظهر الاسم الجليل وحكم هذا الاسم من أعجب الأحكام فإن له حكم لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وسُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ وله حكم‏\n\n\nقوله على لسان رسوله صلى الله عليه وسلم مرضت فلم تعدني وجعت فلم تطعمني وظمئت فلم تسقني‏\n\n\nفأنزل نفسه منزلة من هذه صفته من الافتقار إلى العبيد وكذلك نزوله في‏\n\n\nقوله وسعني قلب عبدي‏\n\n\nومن هذا الباب فرحه بتوبة عبده وتعجبه من الشاب الذي لا صبوة له وتبشبشه بالذي يأتي إلى المسجد للصلاة هذا كله وأمثاله من نعوت التنزيه والتشبيه يعطيه حكم الجلال والاسم الإلهي الجليل ولهذا قلنا إنه يدل على الضدين كالجون ينطلق على الأبيض والأسود وكذلك القرء ينطلق على الحيض والطهر ومن حضرة الجلال نزل قوله تعالى وما قَدَرُوا الله حَقَّ قَدْرِهِ فمن وصفه إنما وصف نفسه ولا يعرف منه إلا نفسه لأن رب العزة\nلا يعينه وصف ولا يقيده نعت ولا يدل على حقيقته اسم خاص وإن لم يكن الحكم ما ذكرناه فما هو رب العزة فإن العزيز هو المنيع الحمى ومن يوصل إليه بوجه ما من وصف أو نعت أو علم أو معرفة فليس بمنيع الحمى ولذلك عم بقوله سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ ولحضرة الجلال السبحات الوجهية المحرقة ولهذا لا يتجلى في جلاله أبدا لكن يتجلى في جلال جماله لعباده فيه يقع التجلي فيشهدونه مظهر ما ظهر من القهر الإلهي في العالم‏\n\n\n> إن الجليل هو الذي لا يعرف *** وهو الذي في كل حال يوصف‏\n\n\n> فهو الذي يبدو فيظهر نفسه *** في خلقه وهو الذي لا يعرف‏\n\n\nوالجلال لا يتعلق به إلا العلماء بالله وما له أثر إلا فيهم وليس للمحبين إليه سبيل هذا إذا كان بمعنى العلو والعزة وإنه إذا كان بالمعنى الذي هو ضد العزة والعلو فإن المحبين يتعلقون به كما يتعلق به العارفون وحضرته من العماء إلى قوله وفي الْأَرْضِ إِلهٌ وأما قوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فذلك من أسمائه المؤثرة فينا خاصة والحافظة لنا والرقيبة علينا وأما الأسماء التي تختص بالعالم الخارج عن الثقلين فأسماء أخر ما هي الأسماء التي معنا أينما كنا وقد بينا في شرح الأسماء الحسنى معنى الاسم الجليل على الوجهين مختصرا في جزء لنا في شرحها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Forty-One: Concerning the Knowledge of Majesty\n\n> Indeed, Majesty (الجلال) applies to the two opposites,\n> And He is the One whom I witness through the attributes of Overpowering (القهر).\n> To Him belongs Transcendence, and no transcendence resembles Him;\n> To Him belongs Descent, yet all creation denies it.\n> Indeed, I know Him by all that I have said,\n> And I do not intend anything other than what I have said.\n\n### [That Majesty is a Divine Attribute that imparts awe and veneration in the hearts]\n\nKnow that Majesty (الجلال) is a Divine Attribute (نعت إلهي) that imparts awe (هيبة) and veneration (تعظيم) in the hearts. Through it, the Name The Majestic (الجليل) appeared. The ruling (حكم) of this Name is among the most wondrous of rulings, for it holds the ruling of: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), and: <<سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ>> (Glory be to your Lord, the Lord of Might).\n\nAnd it holds the ruling of His saying, upon the tongue of His Messenger, peace and blessings be upon him: \"I was sick, and you did not visit Me; I was hungry, and you did not feed Me; I was thirsty, and you did not give Me drink.\" Thus, He lowered Himself to the station of one whose characteristic is this need (الافتقار) for the servants. Likewise is His descent (نزول) in His saying: \"My servant's heart contained Me.\"\n\nAnd from this category is His joy at the repentance of His servant, His wonder at the youth who has no youthful folly, and His welcoming smile toward the one who comes to the mosque for prayer. All this and its like, from the attributes of Transcendence (التنزيه) and Similarity (التشبيه), grants it the ruling of Majesty (الجلال) and the Divine Name The Majestic (الجليل). This is why we said that it indicates the two opposites, just as *al-Jawn* applies to both white and black, and likewise *al-Qurʾ* applies to both menstruation and purity.\n\nFrom the Presence of Majesty (حضرة الجلال) descended His saying, the Exalted: <<وَمَا قَدَرُوا اللهَ حَقَّ قَدْرِهِ>> (And they did not estimate Allah with the estimation due to Him). So whoever describes Him has only described himself, and knows nothing of Him except himself. This is because the Lord of Might (رب العزة) is not specified by a description, nor restricted by an attribute, nor does a specific Name indicate His Reality (حقيقته). If the ruling were not as we mentioned, then what would be the Lord of Might? For the Mighty (العزيز) is the one whose sanctuary (حمى) is inviolable (منيع). And whoever can be reached by any means—whether by description, attribute, knowledge (علم), or gnosis (معرفة)—is not one whose sanctuary is inviolable. For that reason, He generalized with His saying: <<سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Glory be to your Lord, the Lord of Might, above what they describe).\n\nTo the Presence of Majesty belong the burning splendors (السبحات) of the Face. For this reason, He never manifests (يتجلى) in His sheer Majesty (جلاله أبدا). Rather, He manifests in the Majesty of His Beauty (جلال جماله) to His servants; therein the Theophany (التجلي) occurs, and they witness Him as the manifestation (مظهر) of what has appeared of the Divine Overpowering (القهر الإلهي) in the World (العالم).\n\n> Indeed, The Majestic (الجليل) is the One who is not known,\n> And He is the One who is described in every state.\n> So He is the One who appears and manifests Himself\n> In His creation (خلقه), yet He is the One who is not known.\n\nMajesty (الجلال) is only related to the Gnostics of Allah (العلماء بالله), and it has no effect except within them. The Lovers (المحبين) have no path to it. This is if Majesty is understood in the meaning of Transcendence (العلو) and Might (العزة). But if it is understood in the meaning which is the opposite of Might and Transcendence, then the Lovers relate to it just as the Gnostics (العارفون) relate to it.\n\nHis Presence (حضرته) extends from the Cloud (العماء) to His saying: <<وَفِي الْأَرْضِ إِلَهٌ>> (And He is God in the earth). As for His saying: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are), that is from His Names that specifically affect us, preserving us and watching over us. As for the Names specific to the World outside of the two weighty ones (الثقلين), they are other Names, not the Names that are with us wherever we are. We have already explained the meaning of the Name The Majestic (الجليل) according to the two aspects, summarized in a section of our commentary on the Beautiful Names. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## «باب نمبر دو سو اکتالیس: جلال (الجلال) کی معرفت میں»\n\nبے شک جلال (الجلال) دو متضاد معانی پر محیط ہے\nاور وہی ہے جسے میں قہر (القهر) کی صفات کے ساتھ دیکھتا ہوں۔\nاس کے لیے علو (بلندی) ہے اور کوئی علو اس کے مماثل نہیں،\nاس کے لیے نزول ہے جسے تمام مخلوق جھٹلاتی ہے۔\nمیں نے جو کچھ کہا ہے، ان سب کے ذریعے میں اسے جانتا ہوں،\nاور جو کچھ میں نے کہا ہے اس کے سوا میرا کوئی مقصد نہیں۔\n\n### [جلال (الجلال) ایک الٰہی صفت ہے جو دلوں میں ہیبت اور تعظیم پیدا کرتی ہے]\n\nجان لو کہ جلال (الجلال) ایک الٰہی صفت ہے جو دلوں میں ہیبت اور تعظیم پیدا کرتی ہے۔ اسی کے ذریعے اسم جلیل (الاسم الجليل) کا ظہور ہوا، اور اس اسم کا حکم انتہائی عجیب احکام میں سے ہے۔ بے شک اس کے لیے وہ حکم بھی ہے جو اس آیت میں ہے:\n**لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (اس جیسی کوئی چیز نہیں)\nاور **سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ** (پاک ہے تیرا رب، جو عزت کا مالک ہے)۔\nاور اس کے لیے وہ حکم بھی ہے جو اس نے اپنے رسول صلی اللہ علیہ وسلم کی زبان پر فرمایا:\n**مرضت فلم تعدني وجعت فلم تطعمني وظمئت فلم تسقني** (میں بیمار ہوا تو تم نے میری عیادت نہ کی، میں بھوکا ہوا تو تم نے مجھے کھانا نہ کھلایا، اور میں پیاسا ہوا تو تم نے مجھے پانی نہ پلایا)۔\n\nپس اس نے اپنے آپ کو اس شخص کے مقام پر اتارا جس کی یہ صفت ہے کہ وہ بندوں کا محتاج ہے۔ اسی طرح اس کا نزول اس فرمان میں بھی ہے:\n**وسعني قلب عبدي** (میرے بندے کا دل میری وسعت رکھتا ہے)۔\n\nاور اسی باب سے ہے اس کا اپنے بندے کی توبہ پر خوش ہونا، اور اس نوجوان پر تعجب کرنا جسے کوئی لغزش نہ ہو، اور اس شخص سے محبت کا اظہار کرنا جو نماز کے لیے مسجد آتا ہے۔ یہ سب اور اس کی مثالیں تنزیہ (التنزيه) اور تشبیہ (التشبيه) کی صفات میں سے ہیں جو اسے جلال (الجلال) اور اسم الٰہی جلیل (الاسم الإلهي الجليل) کا حکم عطا کرتی ہیں۔ اسی لیے ہم نے کہا کہ یہ دو متضاد معانی پر دلالت کرتا ہے، جیسے \"جون\" کا اطلاق سفید اور سیاہ دونوں پر ہوتا ہے، اور اسی طرح \"قرء\" کا اطلاق حیض اور طہر (پاکیزگی) دونوں پر ہوتا ہے۔\n\nاور جلال (الجلال) کی بارگاہ سے ہی اللہ تعالیٰ کا یہ فرمان نازل ہوا:\n**وما قَدَرُوا الله حَقَّ قَدْرِهِ** (اور انہوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق تھا)۔\nپس جو شخص اس کی صفت بیان کرتا ہے، وہ درحقیقت اپنی ہی صفت بیان کرتا ہے، اور وہ اس میں سے صرف اپنے آپ کو ہی جانتا ہے، کیونکہ رب العزت (رب العزة) کو کوئی وصف متعین نہیں کرتا، نہ کوئی صفت اسے مقید کرتی ہے، اور نہ کوئی خاص اسم اس کی حقیقت پر دلالت کرتا ہے۔ اگر حکم وہ نہ ہو جو ہم نے ذکر کیا ہے، تو پھر وہ رب العزت نہیں ہے۔ کیونکہ عزیز (العزيز) وہ ہے جس کی پناہ گاہ ناقابل تسخیر ہو، اور جس تک کسی بھی طرح کے وصف، صفت، علم یا معرفت (المعرفة) کے ذریعے رسائی حاصل ہو جائے، وہ ناقابل تسخیر پناہ گاہ والا نہیں ہے۔ اسی لیے اس نے اپنے اس فرمان کو عام کیا:\n**سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصْفُونَ** (پاک ہے تیرا رب، جو عزت کا مالک ہے، ان چیزوں سے جو وہ بیان کرتے ہیں)۔\n\nاور جلال (الجلال) کی بارگاہ کے لیے چہرے کے وہ انوار ہیں جو جلا دینے والے ہیں۔ اسی لیے وہ کبھی بھی اپنے جلال (الجلال) میں ظہور الٰہی (التجلی) نہیں فرماتا، بلکہ اپنے بندوں کے لیے اپنے جلال جمال (جلال جمال) میں ظہور الٰہی (التجلی) فرماتا ہے۔ اسی میں ظہور الٰہی (التجلی) واقع ہوتا ہے، پس وہ اسے اس قہر الٰہی (القهر الإلهي) کا مظہر دیکھتے ہیں جو عالم میں ظاہر ہوا ہے۔\n\nبے شک جلیل (الجليل) وہ ہے جسے جانا نہیں جاتا،\nاور وہی ہے جس کی ہر حال میں صفت بیان کی جاتی ہے۔\nپس وہی ہے جو ظاہر ہوتا ہے اور اپنی ذات کو\nاپنی مخلوق میں ظاہر کرتا ہے، اور وہی ہے جسے جانا نہیں جاتا۔\n\nاور جلال (الجلال) سے صرف اللہ کے عارف علماء (العلماء بالله) ہی متعلق ہوتے ہیں، اور اس کا اثر صرف انہی میں ہوتا ہے، اور محبین (المحبين) کے لیے اس تک کوئی راستہ نہیں ہے۔ یہ اس صورت میں ہے جب جلال کا معنی علو (بلندی) اور عزت ہو۔ لیکن اگر یہ اس معنی میں ہو جو عزت اور علو کی ضد ہے، تو محبین (المحبين) بھی اس سے متعلق ہوتے ہیں جیسا کہ عارفین (العارفون) متعلق ہوتے ہیں۔ اور اس کی بارگاہ \"عماء\" (العماء) سے لے کر اس فرمان تک ہے:\n**وفي الْأَرْضِ إِلهٌ** (اور زمین میں بھی معبود ہے)۔\nاور جہاں تک اس کے فرمان **وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ** (اور تم جہاں کہیں بھی ہو وہ تمہارے ساتھ ہے) کا تعلق ہے، تو یہ اس کے ان اسماء میں سے ہے جو خاص طور پر ہم پر اثر انداز ہوتے ہیں، ہماری حفاظت کرتے ہیں اور ہم پر نگہبان ہیں۔ اور وہ اسماء جو ثقلین (جن و انس) سے باہر کے عالم کے ساتھ خاص ہیں، وہ دوسرے اسماء ہیں، وہ اسماء نہیں جو ہمارے ساتھ ہر جگہ ہیں۔ اور ہم نے اسماء حسنیٰ کی شرح میں اسم جلیل (الاسم الجليل) کے معنی کو دونوں پہلوؤں سے مختصراً ایک جز میں بیان کیا ہے جو ہم نے اس کی شرح میں لکھا ہے۔\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و چهل و یکم در معرفت جلال (الجلال)\n\nهمانا جلال (الجلال) بر دو ضد اطلاق می‌گردد *** و اوست که با صفات قهر او را شهود می‌کنم.\nعلو (برتری) از آن اوست و هیچ علوی با او برابری نمی‌کند *** نزول (فرود آمدن) از آن اوست، اما همه خلق آن را انکار می‌کنند.\nمن او را به هر آنچه گفتم می‌شناسم *** و جز آنچه گفتم، قصد دیگری ندارم.\n\n[جلال صفتی الهی است که در دل‌ها هیبت و تعظیم می‌بخشد]\n\nبدان که جلال (الجلال) صفتی الهی است که در دل‌ها هیبت و تعظیم می‌بخشد و به واسطه آن، اسم جلیل (الاسم الجليل) ظاهر شده است. حکم این اسم از شگفت‌انگیزترین احکام است؛ زیرا هم حکم «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست) و «سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ» (منزه است پروردگار تو، پروردگار عزت) را دارد، و هم حکم سخن او را که بر زبان رسولش (ص) جاری ساخت: «بیمار شدم و مرا عیادت نکردی، گرسنه شدم و مرا طعام ندادی، و تشنه شدم و مرا سیراب ننمودی.»\n\nپس او خود را در جایگاه کسی قرار داد که صفتش نیازمندی به بندگان است. همچنین نزول او در سخن او که فرمود: «قلب بنده‌ام مرا گنجایش داشت.»\n\nو از این باب است شادی او به توبه بنده‌اش، و تعجب او از جوانی که لغزشی ندارد، و خوش‌رویی او با کسی که برای نماز به مسجد می‌آید. همه اینها و امثال آن از صفات تنزیه (التنزيه) و تشبیه (التشبيه)، حکم جلال (الجلال) و اسم الهی جلیل (الاسم الإلهي الجليل) را به او می‌بخشد. به همین دلیل گفتیم که جلال بر دو ضد دلالت می‌کند، مانند «جون» که هم بر سفید و هم بر سیاه اطلاق می‌شود، و همچنین «قرء» که هم بر حیض و هم بر طهر اطلاق می‌گردد.\n\nو از حضرت جلال (الجلال) است که این سخن خداوند متعال نازل شد: «وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ» (و خدا را آن‌گونه که شایسته اوست نشناختند). پس هر کس او را وصف کند، در حقیقت خود را وصف کرده است و از او جز خود را نمی‌شناسد، زیرا رب العزه (پروردگار عزت)، هیچ وصفی او را معین نمی‌کند و هیچ نعمتی او را مقید نمی‌سازد و هیچ اسم خاصی بر حقیقت او دلالت نمی‌کند. اگر حکم این نبود که ذکر کردیم، پس او رب العزه (پروردگار عزت) نیست؛ زیرا عزیز (العزيز) کسی است که حریم او دست‌نیافتنی است، و هر کس که به واسطه وصف یا نعت یا علم یا معرفت (المعرفة) به نحوی به او دست یابد، حریم او دست‌نیافتنی نیست. و به همین دلیل، سخن او عمومیت دارد: «سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ» (منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند).\n\nو برای حضرت جلال (الجلال)، سبحات (نورهای) وجهی سوزاننده وجود دارد. به همین دلیل، او هرگز در جلال (جلاله) محض خود تجلی (التجلی) نمی‌کند، بلکه برای بندگانش در جلال جمالش تجلی می‌کند. در آنجاست که تجلی (التجلی) رخ می‌دهد و بندگان آن را مظهر آنچه از قهر الهی در عالم ظاهر شده است، شهود (الشهود) می‌کنند.\n\nهمانا جلیل (الجلیل) کسی است که شناخته نمی‌شود *** و او کسی است که در هر حالی وصف می‌گردد.\nپس او کسی است که آشکار می‌شود و خود را در خلقش ظاهر می‌سازد *** و او کسی است که شناخته نمی‌شود.\n\nو جلال (الجلال) تنها به عالمان به حق (العلماء بالله) تعلق می‌گیرد و اثری جز در آنان ندارد، و محبان را به آن راهی نیست. این در صورتی است که جلال به معنای علو و عزت باشد. اما اگر به معنایی باشد که ضد عزت و علو است، محبان نیز بدان تعلق می‌گیرند، همان‌گونه که عارفان بدان تعلق می‌گیرند. و حضرت او از «عماء» (ابر غلیظ) تا سخن او که می‌فرماید: «وَفِي الْأَرْضِ إِلَهٌ» (و در زمین نیز معبود است). و اما سخن او که می‌فرماید: «وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ» (و او با شماست هر کجا که باشید)، این از اسم‌های اوست که به طور خاص در ما تأثیر می‌گذارد و حافظ و مراقب ماست. اما اسم‌هایی که مختص به عالمی خارج از جن و انس (ثقلین) هستند، اسم‌های دیگری‌اند که اسم‌هایی نیستند که هر کجا باشیم با ما باشند. ما در شرح اسماء الحسنی، معنای اسم جلیل (الاسم الجليل) را به اختصار در دو وجه در بخشی از شرح خود بیان کرده‌ایم. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 2
}