{
  "id": 9,
  "title": {
    "ar": "الباب التاسع في معرفة وجود الأرواح المارجية النارية",
    "en": "Chapter Nine: Concerning the Knowledge of the Existence of the Fiery Spirits (الأرواح المارجية النارية)",
    "ur": "باب نمبر نو: مارجی ناری ارواح کے وجود (الوجود) کی معرفت (المعرفۃ) میں۔",
    "fa": "باب نهم در معرفت وجود ارواح مارجی (مارجية) ناری (آتشین)"
  },
  "content": {
    "ar": "## (الباب التاسع) في معرفة وجود الأرواح المارجية النارية\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> مرج النار والنبات فقامت *** صورة الجن برزخا بين شيئين‏\n\n\n> بين روح مجسم ذي مكان *** في حضيض وبين روح بلا أين‏\n\n\n> فالذي قابل التجسم منها *** طلب القوت للتغذي بلا مين‏\n\n\n> والذي قابل الملائك منها *** قبل القلب بالتشكل في العين‏\n\n\n> ولهذا يطيع وقتا ويعصي *** ويجازى مخالفوهم بنارين‏\n\n\n### [خلق الجان والملائكة والإنسان‏]\n\n\nقال الله تعالى وخَلَقَ الْجَانَّ من مارِجٍ من نارٍ وورد في الحديث الصحيح أن الله خلق الملائكة من نور وخلق الله الجان من نار وخلق الإنسان مما قيل لكم‏\n\n\nفأما قوله عليه السلام في خلق الإنسان مما قيل لكم ولم يقل مثل ما قال في خلق الملائكة والجان طلبا للاختصار فإنه أوتي جوامع الكلم وهذا منها فإن الملائكة لم يختلف أصل خلقها ولا الجان وأما الإنسان اختلف خلقه على أربعة أنواع من الخلق فخلق آدم لا يشبه خلق حواء لا يشبه خلق سائر بنى آدم وخلق عيسى عليه السلام لا يشبه خلق من ذكرنا فقصد رسول الله صلى الله عليه وسلم الاختصار وأحال على ما وصل إلينا من تفصيل خلق الإنسان فآدم من طين وحواء من ضلع وعيسى من نفخ روح وبنو آدم من ماءٍ مَهِينٍ‏\n\n\n### [الالتحام المعنوي بين السماء والأرض‏]\n\n\nولما أنشأ الله الأركان الأربعة وعلا الدخان إلى مقعر فلك الكواكب الثابتة وفتق في ذلك الدخان سبع سماوات ميز بعضها عن بعض وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها بعد ما قدر في الأرض أقواتها وذلك كله في أَرْبَعَةِ أَيَّامٍ ثم قال للسماوات والأرض ائْتِيا طَوْعاً أَوْ كَرْهاً أي أجيبا إذا دعيتما لما يراد منكما مما أمنتما عليه أن تبرزاه ف قالَتا أَتَيْنا طائِعِينَ فجعل سبحانه بين السماء والأرض التحاما معنويا وتوجها لما يريد سبحانه أن يوجده في هذه الأرض من المولدات من معدن ونبات وحيوان وجعل الأرض كالأهل وجعل السماء كالبعل والسماء تلقي إلى الأرض من الأمر الذي أوحى الله فيها كما يلقي الرجل الماء بالجماع في المرأة وتبرز الأرض عند الإلقاء ما خبأه الحق فيها من التكوينات على طبقاتها\n\n\n### [العناصر الأربعة وتكوين الجان والإنسان‏]\n\n\nفكان من ذلك أن الهواء لما اشتعل وحمي اتقد مثل السراج وهو اشتعال النار ذلك اللهب الذي هو احتراق الهواء وهو المارج وإنما سمي ما رجا لأنه نار مختلط بهواء وهو الهواء المشتعل فإن المرج الاختلاط ومنه سمي المرج مرجا لاختلاط النبات فيه فهو من عنصرين هواء ونار أعني الجان كما كان آدم من عنصرين ماء وتراب عجن به فحدث له اسم الطين كما حدث لامتزاج النار بالهواء اسم المارج ففتح سبحانه في ذلك المارج صورة الجان فبما فيه من الهواء يتشكل في أي صورة شاء وبما فيه من النار سخف وعظم لطفه وكان فيه طلب القهر والاستكبار والعزة فإن النار أرفع الأركان مكانا وله سلطان على إحالة الأشياء التي تقتضيها الطبيعة وهو السبب الموجب لكونه استكبر عن السجود لآدم عند ما أمره الله عز وجل بتأويل أداه أن يقول أَنَا خَيْرٌ مِنْهُ يعني بحكم الأصل الذي فضل الله به بين الأركان الأربعة وما علم إن سلطان الماء الذي خلق منه آدم أقوى منه فإنه يذهبه وإن التراب أثبت منه للبرد واليبس فلآدم القوة والثبوت لغلبة الركنين اللذين‏\nأوجده الله منهما وإن كان فيه بقية الأركان ولكن ليس لها ذلك السلطان وهو الهواء والنار كما في الجان من بقية الأركان ولذا سمي ما رجا ولكن ليس لها في نشأته ذلك السلطان وأعطى آدم التواضع للطينية بالطبع فإن تكبر فلأمر يعرض له يقبله بما فيه من النارية كما يقبل اختلاف الصور في خياله وفي أحواله من الهوائية وأعطى الجان التكبر بالطبع للنارية فإن تواضع فلأمر يعرض له يقبله بما فيه من الترابية كما يقبل الثبات على الإغواء إن كان شيطانا والثبات على الطاعات إن لم يكن شيطانا\n\n\n### [الجان عند تلاوة سورة الرحمن‏]\n\n\nوقد أخبر النبي صلى الله عليه وسلم لما تلا سورة الرحمن على أصحابه قال إني تلوتها على الجن فكانوا أحسن استماعا لها منكم فكانوا يقولون ولا بشي‏ء من آلاء ربنا نكذب إذ قلت فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ‏\n\n\nثابتين عليه ما تزلزلوا عند ما كان يقول لهم عليه السلام في تلاوته فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ وذلك بما فيه من الترابية وبما فيه من المائية ذهبت بحمية النارية فمنهم الطائع والعاصي مثلنا ولهم التشكل في الصور كالملائكة\n\n\n### [الصورة الاصلية التي ينسب إليها الروحاني‏]\n\n\nوأخذ الله بأبصارنا عنهم فلا نراهم إلا إذا شاء الله أن يكشف لبعض عباده فيراهم ولما كانوا من عالم السخافة واللطف قبلوا التشكيل فيما يريدونه من الصور الحسية فالصورة الأصلية التي ينسب إليها الروحاني إنما هي أول صورة قبل عند ما أوجده الله ثم تختلف عليه الصور بحسب ما يريد أن يدخل فيها ولو كشف الله عن أبصارنا حتى نرى ما تصوره القوة المصورة التي وكلها الله بالتصوير في خيال المتخيل منا لرأيت مع الأناة الإنسان في صور مختلفة لا يشبه بعضها بعضا\n\n\n### [التناسل في الجان والإنسان‏]\n\n\nولما نفخ الروح في اللهب وهو كثير الاضطراب لسخافته وزاده النفخ اضطرابا وغلب الهواء عليه وعدم قراره على حالة واحدة ظهر عالم الجان على تلك الصورة وكما وقع التناسل في البشر بإلقاء الماء في الرحم فكانت الذرية والتوالد في هذا الصنف البشري الآدمي كذلك وقع التناسل في الجان بإلقاء الهواء في رحم الأنثى منهم فكانت الذرية والتوالد في صنف الجان وكان وجودهم بالقوس وهو ناري هكذا ذكر الوارد حفظه الله‏\n\n\n### [ما بين خلق الجان والإنسان من السنين‏]\n\n\nفكان بين خلق الجان وخلق آدم ستون ألف سنة وكان ينبغي على ما يزعم بعض الناس أن ينقطع التوالد من الجان بعد انقضاء أربعة آلاف سنة وينقضي التوالد من البشر بعد انقضاء سبعة آلاف سنة ولم يقع الأمر على ذلك بل الأمر راجع إلى ما يريده الله فالتوالد في الجن إلى اليوم باق وكذلك فينا فتحقق بهذا كم لآدم من السنين وكم بقي إلى انقضاء الدنيا وفناء البشر عن ظهرها وانقلابهم إلى الدار الآخرة وليس هذا بمذهب الراسخين في العلم وإنما قال به شرذمة لا يعتد بقولها\n\n\n### [الجان برزخ بين الملك والإنسان‏]\n\n\nفالملائكة أرواح منفوخة في أنوار والجان أرواح منفوخة في رياح والأناسي أرواح منفوخة في أشباح ويقال إنه لم يفصل عن الموجود الأول من الجان أنثى كما فصلت حواء من آدم قال بعضهم إن الله خلق للموجود الأول من الجان فرجا في نفسه فنكح بعضه ببعضه فولد مثل ذرية آدم ذكرانا وإناثا ثم نكح بعضهم بعضا فكان خلقه خنثى ولذلك هم الجان من عالم البرزخ لهم شبه بالبشر وشبه بالملائكة كالخنثى يشبه الذكر ويشبه الأنثى وقد روينا فيما رويناه من الأخبار عن بعض أئمة الدين أنه رأى رجلا ومعه ولدان وكان خنثى الواحد من ظهره والآخر من بطنه نكح فولد له ونكح فولد وسمي خنثى من الانخناث وهو الاسترخاء والرخاوة عدم القوة والشدة فلم تقو فيه قوة الذكورية فيكون ذكرا ولم تقو فيه قوة الأنوثة فيكون أنثى فاسترخى عن هاتين القوتين فسمي خنثى والله أعلم‏\n\n\n### [غذاء الجان ونكاحهم‏]\n\n\nولما غلب على الجان عنصر الهواء والنار لذلك كان غذاؤهم ما يحمله الهواء مما في العظام من الدسم فإن الله جاعل لهم فيها رزقا فإنا نشاهد جوهر العظم وما يحمله من اللحم لا ينتقص منه شي‏ء فعلمنا قطعا إن الله جاعل لهم فيها رزقا ولهذا\n\n\nقال النبي صلى الله عليه وسلم في العظام إنها زاد إخوانكم من الجن وفي حديث إن الله جاعل لهم فيها رزقا\n\n\nوأخبرني بعض المكاشفين أنه رأى الجن يأتون إلى العظم فيشمونه كما تشم السباع ثم يرجعون وقد أخذوا رزقهم وغذاؤهم في ذلك الشم فسبحان اللطيف الخبير وأما اجتماع بعضهم ببعض عند النكاح فالتواء مثل ما تبصر الدخان الخارج من الأتون أو من فرن الفخار يدخل بعضه في بعضه فيلتذ كل واحد من الشخصين بذلك التداخل ويكون ما يلقونه كلقاح النخلة بمجرد الرائحة كغذائهم سواء\n\n\n### [قبائل الجان وعشائرهم‏]\n\n\nوهم قبائل وعشائر وقد ذكر أنهم محصورون في اثنتي عشرة قبيلة أصولا ثم يتفرعون إلى أفخاذ وتقع بينهم حروب عظيمة وبعض الزوابع قد يكون عين حربهم فإن الزوبعة تقابل ريحين تمنع كل واحدة صاحبتها أن تخترقها فيؤدي ذلك المنع إلى الدور\nالمشهود في الغبرة في الحس التي آثارها تقابل الريحين المتضادين فمثل ذلك يكون حربهم وما كل زوبعة حربهم وحديث عمرو الجني حمد الله مشهورة مروية وقتله في الزوبعة التي أبصرت فانقشعت عنه وهو على الموت فما لبث إن مات وكان عبدا صالحا من الجان ولو كان هذا الكتاب مبناه على إيراد أخبار وحكايات لذكرنا منها طرفا وإنما هذا كتاب علم المعاني فلينظر حكاياتهم في تواريخ الأدب وأشعارهم‏\n\n\n### [تشكل العالم الروحاني‏]\n\n\nثم نرجع ونقول وإن هذا العالم الروحاني إذا تشكل وظهر في صورة حسية يقيده البصر بحيث لا يقدر أن يخرج عن تلك الصورة ما دام البصر ينظر إليه بالخاصية ولكن من الإنسان فإذا قيده ولم يبرح ناظرا إليه وليس له موضع يتوارى فيه أظهر له هذا الروحاني صورة جعلها عليه كالستر ثم يخيل له مشي تلك الصورة إلى جهة مخصوصة فيتبعها بصره فإذا اتبعها بصره خرج الروحاني عن تقييده فغاب عنه وبمغيبه تزول تلك الصورة عن نظر الناظر الذي اتبعها بصره فإنها للروحاني كالنور مع السراج المنتشر في الزوايا نوره فإذا غاب جسم السراج فقد ذلك النور فهكذا هذه الصورة فمن يعرف هذا ويحب تقييده لا يتبع الصورة بصره وهذا من الأسرار الإلهية التي لا تعرف إلا بتعريف الله وليست الصورة غير عين الروحاني بل هي عينه ولو كانت في ألف مكان أو في كل مكان ومختلفة الأشكال وإذا اتفق قتل صورة من تلك الصور وماتت في ظاهر الأمر انتقل ذلك الروحاني من الحياة الدنيا إلى البرزخ كما ننتقل نحن بالموت ولا يبقى له في عالم الدنيا حديث مثلنا سواء وتسمى تلك الصور المحسوسة التي تظهر فيها الروحانيات أجسادا وهو قوله تعالى وأَلْقَيْنا عَلى‏ كُرْسِيِّهِ جَسَداً وقوله وما جَعَلْناهُمْ جَسَداً لا يَأْكُلُونَ الطَّعامَ والفرق بين الجان والملائكة وإن اشتركوا في الروحانية أن الجان غذاؤهم ما تحمله الأجسام الطبيعية من المطاعم والملائكة ليست كذلك ولهذا ذكر الله في قصة ضيف إبراهيم الخليل فَلَمَّا رَأى‏ أَيْدِيَهُمْ لا تَصِلُ إِلَيْهِ نَكِرَهُمْ يعني إلى العجل الحنيذ أي لا يأكلون منه وخاف‏\n\n\n### [نشأة عالم الجان‏]\n\n\nوحين جاء وقت إنشاء عالم الجان توجه من الأمناء الذين في الفلك الأول من الملائكة ثلاثة ثم أخذوا من نوابهم من السماء الثانية ما يحتاجون إليه منهم في هذا النش‏ء ثم نزلوا إلى السموات فأخذوا من النواب اثنين من السماء الثانية والسادسة من هناك ونزلوا إلى الأركان فهيئوا المحل واتبعتهم ثلاثة أخر من الأمناء وأخذوا من الثانية ما يحتاجون إليه من نوابهم ثم نزلوا إلى السماء الثالثة والخامسة من هناك فأخذوا ملكين ومروا بالسماء السادسة فأخذوا نائبا آخر من الملائكة ونزلوا إلى الأركان ليكملوا التسوية فنزلت الستة الباقية وأخذت ما بقي من النواب في السماء الثانية وفي السموات فاجتمع الكل على تسوية هذه النشأة بإذن العليم الحكيم فلما تمت نشأته واستقامت بنيته توجه الروح من عالم الأمر فنفخ في تلك الصورة روحا سرت فيه بوجودها الحياة فقام ناطقا بالحمد والثناء لمن أوجده جبلة جبل عليها وفي نفسه عزة وعظمة لا يعرف سببها ولا على من يعتز بها إذ لم يكن ثم مخلوق آخر من عالم الطبائع سواه فبقي عابدا لربه مصرا على عزته متواضعا لربوبية موجدة بما يعرض له مما هو عليه في نشأته إلى أن خلق آدم فلما رأى الجان صورته غلب على واحد منهم اسمه الحارث بغض تلك النشأة وتجهم وجهه لرؤية تلك الصورة الآدمية وظهر ذلك منه لجنسه فعتبوه لذلك لما رأوه عليه من الغم والحزن لها فلما كان من أمر آدم ما كان أظهر الحارث ما كان يجد في نفسه منه وأَبى‏ عن امتثال أمر خالقه بالسجود لآدم واسْتَكْبَرَ على آدم بنشأته وافتخر بأصله وغاب عنه سر قوة الماء الذي جعل الله منه كُلَّ شَيْ‏ءٍ حَيٍّ ومنه كانت حياة الجان وهم لا يشعرون‏\n\n\n### [خلق آدم ونشأة الإنسان‏]\n\n\nوتأمل إن كنت من أهل الفهم قوله تعالى وكانَ عَرْشُهُ عَلَى الْماءِ فحيي العرش وما حوى عليه من المخلوقات وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ فجاء بالنكرة ولا يسبح إلا حي‏\n\n\nورد في الحديث الحسن عن رسول الله صلى الله عليه وسلم أن الملائكة قالت يا رب في حديث طويل هل خلقت شيئا أشد من النار قال نعم الماء فجعل الماء أقوى من النار فلو كان عنصر الهواء في نشأة الجان غير مشتعل بالنار لكان الجان أقوى من بنى آدم فإن الهواء أقوى من الماء فإن الملائكة قالت في هذا الحديث يا رب فهل خلقت شيئا أشد من الماء قال نعم الهواء ثم قالت يا رب فهل خلقت شيئا أشد من الهواء قال نعم ابن آدم‏\n\n\nالحديث فجعل النشأة الإنسانية أقوى من الهواء وجعل الماء أقوى من النار وهو العنصر الأعظم في الإنسان كما إن النار العنصر الأعظم في الجان ولهذا قال في الشيطان إِنَّ كَيْدَ الشَّيْطانِ كانَ ضَعِيفاً فلم ينسب إليه من القوة شيئا ولم يرد على العزيز في قوله‏\nإِنَّ كَيْدَكُنَّ عَظِيمٌ ولا أكذبه مع ضعف عقل المرأة عن عقل الرجل فإن النساء ناقصات عقل فما ظنك بقوة الرجل وسبب ذلك أن النشأة الإنسانية تعطي التؤدة في الأمور والأناة والفكر والتدبير لغلبة العنصرين الماء والتراب على مزاجه فيكون وافر العقل لأن التراب يثبطه ويمسكه والماء يلينه ويسهله والجان ليس كذلك فإنه ليس لعقله ما يمسكه عليه ذلك الإمساك الذي للإنسان ولهذا يقال فلان خفيف العقل وسخيف العقل إذا كان ضعيف الرأي هلباجة وهذا هو نعت الجان وبه ضل عن طريق الهدى لخفة عقله وعدم تثبته في نظره فقال أَنَا خَيْرٌ مِنْهُ فجمع بين الجهل وسوء الأدب لخفته‏\n\n\n### [الشيطان الأول من الجان‏]\n\n\nفمن عصى من الجان كان شيطانا أي مبعودا من رحمة الله وكان أول من سمي شيطانا من الجن الحارث فأبلسه الله أي طرده من رحمته وطرد الرحمة عنه ومنه تفرعت الشياطين بأجمعها فمن آمن منهم مثل هامة بن إلهام بن لاقيس بن إبليس التحق بالمؤمنين من الجن ومن بقي على كفره كان شيطانا وهي مسألة خلاف بين علماء الشريعة فقال بعضهم إن الشيطان لا يسلم أبدا وتأول‏\n\n\nقوله عليه السلام في شيطانه وهو القرين الموكل به إن الله أعانه عليه فأسلم‏\n\n\nروى برفع الميم وفتحها أيضا فتأول هذا القائل الرفع بأنه قال فأسلم منه أي ليس له على سبيل وهكذا تأوله المخالف وتأول الفتح فيه على الانقياد قال فمعناه انقاد مع كونه عدوا فهو بعينه لا يأمرني إلا بخير جبرا من الله وعصمة لرسول الله صلى الله عليه وسلم وقال المخالف معنى فأسلم بالفتح أي آمن بالله كما يسلم الكافر عندنا فيرجع مؤمنا وهو الأولى والأوجه‏\n\n\n### [إبليس أول الأشقياء من الجن‏]\n\n\nوأكثر الناس يزعمون أنه أول الجن بمنزلة آدم من الناس وليس كذلك عندنا بل هو واحد من الجن وإن الأول فيهم بمنزلة آدم في البشر إنما هو غيره ولذلك قال الله تعالى إِلَّا إِبْلِيسَ كانَ من الْجِنِّ أي من هذا الصنف من المخلوقين كما كان قابيل من البشر وكتبه الله شقيا فهو أول الأشقياء من البشر وإبليس أول الأشقياء من الجن وعذاب الشياطين من الجن في جهنم أكثر ما يكون بالزمهرير لا بالحرور وقد يعذب بالنار وبنو آدم أكثر عذابهم بالنار ووقفت يوما على مخبول العقل من الأولياء وعيناه تدمعان وهو يقول للناس لا تقفوا مع قوله تعالى لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ لإبليس فقط بل انظروا في إشارته سبحانه لكم بقوله لإبليس جَهَنَّمَ مِنْكَ فإنه مخلوق من النار فيعود لعنه الله إلى أصله وإن عذب به فعذاب الفخار بالنار أشد فتحفظوا فما نظر هذا الولي من ذكر جهنم إلا النار خاصة وغفل عن إن جهنم اسم لحرورها وزمهريرها وبجملتها سميت جهنم لأنها كريهة المنظر والجهام السحاب الذي قد هرق ماءه والغيث رحمة الله فلما أزال الله الغيث من السحاب بإنزاله أطلق عليه اسم الجهام لزوال الرحمة الذي هو الغيث منه كذلك الرحمة أزالها الله من جهنم فكانت كريهة المنظر والمخبر وسميت أيضا جهنم لبعد قعرها يقال ركية جهنام إذا كانت بعيدة القعر نسأل الله العظيم لنا وللمؤمنين الأمن منها ويكفي هذا القدر من هذا الباب‏\n\n",
    "en": "Chapter Nine: Concerning the Knowledge of the Existence of the Fiery *Marj* Spirits (الأرواح المارجية النارية)\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.\n\nThe fire and the growth were mingled (مرج), and the form of the Jinn (الجن) arose as an Isthmus (برزخ) between two things:\nBetween an embodied spirit (روح مجسم) that has a location in the depths, and a spirit (روح) without a \"where.\"\nThat aspect of it which corresponds to embodiment (التجسم) seeks sustenance for nourishment without fail.\nAnd that aspect of it which corresponds to the Angels (الملائك) accepts the heart through formation (التشكل) visible to the eye.\nFor this reason, they obey at times and disobey at others, and those among them who transgress are recompensed with two fires.\n\n### [The Creation of the Jinn, Angels, and Humans]\n\nAllah the Exalted said: <<وَخَلَقَ الْجَانَّ مِنْ مَارِجٍ مِنْ نَارٍ>> (And He created the Jinn from a smokeless flame of fire). It is mentioned in the authentic Hadith that Allah created the Angels (الملائكة) from light, and Allah created the Jinn (الجان) from fire, and He created the Human (الإنسان) from what has been told to you.\n\nAs for his saying (peace be upon him) regarding the creation of the Human, \"from what has been told to you,\" and not specifying it as he did for the creation of the Angels and the Jinn, this was done for the sake of brevity, for he was granted comprehensive speech (*Jawami' al-Kalim*), and this is an example of it. The origin of the creation of the Angels did not vary, nor did that of the Jinn. However, the creation of the Human varied across four types of creation: the creation of Adam does not resemble the creation of Eve, nor does it resemble the creation of the rest of the children of Adam, and the creation of Jesus (peace be upon him) does not resemble the creation of those we have mentioned. Thus, the Messenger of Allah (peace and blessings be upon him) intended brevity and referred to the details of human creation that have reached us: Adam was from clay, Eve from a rib, Jesus from the blowing of the Spirit, and the children of Adam from a despised fluid (ماءٍ مَهِينٍ).\n\n### [The Spiritual Cohesion between Heaven and Earth]\n\nWhen Allah established the four pillars (الأركان الأربعة) and the smoke ascended to the concave of the sphere of the fixed stars, He split that smoke into seven heavens, distinguishing some from others, and <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (He revealed in every heaven its command) after He had measured out its provisions on Earth. All of this occurred <<فِي أَرْبَعَةِ أَيَّامٍ>> (in four days). Then He said to the heavens and the Earth, <<ائْتِيَا طَوْعًا أَوْ كَرْهًا>> (Come willingly or unwillingly)—meaning, respond when you are called upon for what is desired of you, which you have been entrusted to manifest. They said, <<قَالَتَا أَتَيْنَا طَائِعِينَ>> (We have come willingly). Thus, the Glorified established a spiritual cohesion (التحاما معنويا) between the heaven and the Earth, and a focus toward what the Glorified desires to bring into existence on this Earth from the generated things: mineral, plant, and animal. He made the Earth like the spouse (الأهل) and the Heaven like the husband (البعل). The Heaven casts upon the Earth the command that Allah revealed within it, just as a man casts water through intercourse into a woman. And upon receiving this casting, the Earth manifests the formations (التكوينات) that the Real (الحق) concealed within it, according to their levels.\n\n### [The Four Elements and the Formation of the Jinn and the Human]\n\nIt followed from this that when the air ignited and heated up, it flared up like a lamp. This ignition of fire is the flame that is the burning of the air, which is the *Marj* (المرج). It was only named *Marj* because it is fire mixed (مختلط) with air—that is, the ignited air. For *Marj* means mixing, and from this, the meadow (*Marj*) is named *Marj* due to the mixing of plants within it. Thus, the Jinn (الجان) are composed of two elements: air and fire. Similarly, Adam was composed of two elements: water and earth, which were kneaded together, giving rise to the name \"clay\" (*Tin*), just as the mixing of fire with air gave rise to the name *Marj*. The Glorified then opened up the form of the Jinn within that *Marj*. Due to the air within them, they can take shape (يتشكل) in any form they wish. Due to the fire within them, they are subtle (سخف) and their fineness (لطفه) is great, and they possess the drive for domination, arrogance (الاستكبار), and might (العزة). This is because fire is the highest in location among the pillars (الأركان) and has authority over the transformation of things required by nature. This is the compelling reason why the Jinn became arrogant about prostrating to Adam when Allah Almighty commanded it, based on an interpretation that led him to say, <<أَنَا خَيْرٌ مِنْهُ>> (I am better than him)—meaning, by the ruling of the origin by which Allah distinguished between the four pillars. Yet, he did not know that the authority of water, from which Adam was created, is stronger than him, for water extinguishes fire. Nor did he know that earth is more stable than him due to coldness and dryness. Adam possesses strength and stability due to the dominance of the two pillars from which Allah brought him into existence, even though he contains the remainder of the pillars (air and fire), but they do not hold that same authority. Likewise, the Jinn contain the remainder of the pillars, which is why they are called *Marj*, but these remaining elements do not hold that authority in their constitution. Adam was granted humility (التواضع) by nature due to his earthiness; if he becomes arrogant, it is due to an external matter he accepts through the fiery element within him, just as he accepts the variation of forms in his imagination (خيال) and states from the airy element. The Jinn were granted arrogance by nature due to the fiery element; if they become humble, it is due to an external matter he accepts through the earthy element within him, just as they accept persistence in temptation if they are devils (شيطانا) or persistence in acts of obedience if they are not devils.\n\n### [The Jinn during the Recitation of Surah Al-Rahman]\n\nThe Prophet (peace and blessings be upon him) informed his Companions when he recited Surah Al-Rahman to them, saying: \"I recited it to the Jinn, and they listened to it better than you did.\" They would say, \"We deny none of the bounties of our Lord,\" when I recited <<فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ>> (Then which of the favors of your Lord will you deny?). They remained steadfast upon this and did not waver when he (peace be upon him) recited to them <<فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ>>. This steadfastness is due to the earthy element (الترابية) within them, and the watery element (المائية) within them, which subdued the heat of the fiery element (النارية). Thus, among them are the obedient and the disobedient, just as among us, and they possess the ability to take shape (التشكل) in forms, like the Angels (الملائكة).\n\n### [The Original Form to which the Spiritual Being is Attributed]\n\nAllah has veiled our sight from them, so we do not see them unless Allah wills to grant Unveiling (الكشف) to some of His servants, allowing them to see them. Since they belong to the world of subtlety (السخافة) and fineness (اللطف), they accept formation (التشكيل) into whatever sensory forms they desire. The original form (الصورة الأصلية) to which the spiritual being (الروحاني) is attributed is only the first form it accepted when Allah brought it into existence. Thereafter, the forms vary for it according to what it wishes to enter into. If Allah were to lift the veil from our sight so that we could see what the Formative Power, entrusted by Allah with forming images in the imagination (خيال) of the one who imagines among us, depicts, you would see, with patience, the human being in various forms, none of which resemble the others.\n\n### [Procreation among the Jinn and Humans]\n\nWhen the Spirit (الروح) was breathed into the flame—which was highly agitated due to its subtlety (سخافته), and the breathing increased its agitation, and the air dominated it, preventing it from settling into a single state—the world of the Jinn (الجان) appeared in that form. Just as procreation (التناسل) occurs among humans by the casting of water into the womb, resulting in offspring and generation in this Adamic human species, so too does procreation occur among the Jinn by the casting of air into the womb of their female, resulting in offspring and generation in the species of the Jinn. Their existence was through the arc (القوس), which is fiery. This is what the Gnostic inspiration (الوارد) mentioned, may Allah preserve him.\n\n### [The Years Between the Creation of the Jinn and the Human]\n\nThere were sixty thousand years between the creation of the Jinn and the creation of Adam. Some people claim that procreation among the Jinn should cease after the passing of four thousand years, and procreation among humans should cease after the passing of seven thousand years. However, the matter did not occur in this way; rather, the matter reverts to what Allah wills. Procreation among the Jinn remains until today, and likewise among us. Realize through this how many years Adam has lived and how much remains until the end of the world, the annihilation of humanity from its surface, and their turning toward the Hereafter (الدار الآخرة). This is not the doctrine of those firmly rooted in Knowledge (الراسخين في العلم), but rather it is asserted by a small group whose opinion is not taken into account.\n\n### [The Jinn as an Isthmus between the Angel and the Human]\n\nThe Angels (الملائكة) are spirits (أرواح) breathed into lights, the Jinn are spirits breathed into winds, and humans (الأناسي) are spirits breathed into bodies (أشباح). It is said that no female was separated from the first existing Jinn, as Eve was separated from Adam. Some say that Allah created a vulva within the first existing Jinn itself, so it coupled with itself and gave birth to offspring, males and females, similar to the progeny of Adam. Then they coupled with one another. Their creation was hermaphroditic (*Khuntha*), and for this reason, the Jinn belong to the world of the Isthmus (البرزخ): they bear a resemblance to humans (البشر) and a resemblance to Angels, like the hermaphrodite who resembles the male and resembles the female. We have narrated in the reports we received from some Imams of the religion that one of them saw a man with two children, and he was a hermaphrodite; one child was from his back and the other from his belly. He coupled and gave birth, and he coupled and begot. He was named *Khuntha* (hermaphrodite) from *Inkhinath*, which means slackness and looseness, the absence of strength and firmness. The power of masculinity was not strong enough in him for him to be male, nor was the power of femininity strong enough for him to be female, so he was slackened from these two powers and was named *Khuntha*. And Allah knows best.\n\n### [The Sustenance and Coupling of the Jinn]\n\nSince the element of air and fire dominates the Jinn, their sustenance is what the air carries from the fat (دسم) within the bones, for Allah has appointed provision (رزقا) for them therein. We observe that the substance of the bone and the flesh it carries are not diminished at all, so we know with certainty that Allah has appointed provision for them therein. For this reason, the Prophet (peace and blessings be upon him) said concerning bones that they are the provision (*Zad*) of your brothers among the Jinn. In another Hadith, [it is stated] that Allah has appointed provision for them therein. One of those granted Unveiling (المكاشفين) informed me that he saw the Jinn approach the bone and smell it, just as wild beasts smell, and then they depart, having taken their provision and nourishment through that smelling. Glory be to the Subtle, the All-Aware (اللطيف الخبير). As for their coupling with one another during intercourse (*Nikah*), it is a twisting, similar to what you see when smoke emerging from a furnace or a potter's kiln enters into itself. Each of the two individuals finds pleasure in that interpenetration. And what they cast is like the pollination of the date palm, merely by scent, just like their nourishment.\n\n### [The Tribes and Clans of the Jinn]\n\nThey are tribes (قبائل) and clans (عشائر). It has been mentioned that they are confined to twelve original tribes, which then branch out into sub-clans. Great wars occur between them. Some whirlwinds (*Zawabi'*) may be the very manifestation of their warfare, for a whirlwind results from two opposing winds meeting, each preventing the other from penetrating it. This obstruction leads to the visible rotation in the dust, which is sensed as the effect of the two opposing winds. Their warfare is similar to this, though not every whirlwind is their war. The story of Amr the Jinn, who praised Allah, is famous and narrated; he was killed in a whirlwind that was observed, which then cleared away from him while he was dying, and he soon passed away. He was a righteous servant among the Jinn. If the foundation of this book were based on presenting reports and anecdotes, we would mention a portion of them. However, this is a book of the science of meanings (*Ilm al-Ma'ani*), so their stories should be sought in histories of literature and their poetry.\n\n### [The Formation of the Spiritual World]\n\nWe return now to state that when this spiritual world (العالم الروحاني) takes shape and appears in a sensory form, sight restricts it, such that it cannot depart from that form as long as the human eye continues to look at it due to this specific property. If the human restricts it and does not cease looking at it, and the spiritual being has no place to hide, this spiritual being manifests a form that acts as a veil over itself. Then, it makes the observer imagine that this form is walking toward a specific direction, and the observer’s gaze follows it. Once the gaze follows it, the spiritual being escapes its restriction and vanishes from the observer. With its disappearance, that form also vanishes from the sight of the observer whose gaze followed it. This form is to the spiritual being like the light of a lamp whose illumination is spread in the corners; if the body of the lamp disappears, that light is lost. This is how this form operates. Whoever knows this and wishes to restrict the spiritual being should not let his gaze follow the form. This is one of the Divine Secrets (الأسرار الإلهية) that is known only through Allah’s instruction. The form is not other than the essence of the spiritual being (عين الروحاني); rather, it is its very essence, even if it appears in a thousand places or in every place, and in different shapes. If one of these forms happens to be killed and dies in the apparent world, that spiritual being transfers from the life of this world to the Isthmus (البرزخ), just as we transfer through death, and no mention of it remains in the world of this life, exactly like us. These sensory forms in which the spiritual beings appear are called bodies (*Ajsad*). This is referred to in His saying, the Exalted, <<وَأَلْقَيْنَا عَلَى كُرْسِيِّهِ جَسَدًا>> (And We cast upon his throne a body), and His saying, <<وَمَا جَعَلْنَاهُمْ جَسَدًا لَا يَأْكُلُونَ الطَّعَامَ>> (And We did not make them bodies that did not eat food). The difference between the Jinn and the Angels, even though they share spirituality (الروحانية), is that the Jinn’s nourishment is what natural bodies carry of foodstuffs, whereas the Angels are not like that. For this reason, Allah mentioned in the story of Abraham the Intimate’s guests: <<فَلَمَّا رَأَى أَيْدِيَهُمْ لَا تَصِلُ إِلَيْهِ نَكِرَهُمْ>> (But when he saw their hands not reaching for it, he distrusted them)—meaning, toward the roasted calf—that is, they were not eating from it, and he became fearful.\n\n### [The Origin of the World of the Jinn]\n\nWhen the time came for the establishment of the world of the Jinn, three of the Trustees (الأمناء) who were in the First Sphere (الفلك الأول) of the Angels turned their attention [to it]. Then they took from their deputies in the Second Heaven what they needed for this creation. They then descended to the heavens and took two deputies from the Second and Sixth Heavens from there, and descended to the Pillars (الأركان) and prepared the location. Three other Trustees followed them and took what they needed from their deputies in the Second [Heaven]. They then descended to the Third and Fifth Heavens from there, taking two Angels, and passed by the Sixth Heaven, taking another deputy from the Angels, and descended to the Pillars to complete the leveling. The remaining six descended and took what remained of the deputies in the Second Heaven and in the other heavens. All of them gathered to level this creation (النشأة) by the permission of the All-Knowing, the Wise. When its creation was completed and its structure was sound, the Spirit (الروح) turned from the World of Command (*Alam al-Amr*) and breathed a spirit into that form. Life permeated it through the existence of that spirit, and it arose speaking with praise and glorification for the One who brought it into existence—a natural disposition upon which it was created. Within itself, it possessed might (عزة) and grandeur (عظمة), the reason for which it did not know, nor upon whom to assert this might, since there was no other creature from the world of natures besides itself. It remained worshipping its Lord, persistent in its might, yet humble toward the Lordship of its Originator due to what occurred to it based on its creation, until Adam was created. When the Jinn saw his form, one of them, named Al-Harith, was overcome by hatred for that creation, and his face frowned upon seeing that Adamic form. This became apparent to his kind, and they reproached him for the grief and sorrow they saw in him regarding it. When the matter of Adam transpired, Al-Harith manifested what he had been feeling internally. He <<وَأَبَى>> (refused) to comply with the command of his Creator to prostrate to Adam, and <<وَاسْتَكْبَرَ>> (was arrogant) toward Adam based on his own creation, boasting of his origin. Hidden from him was the secret of the power of water, from which Allah made <<كُلَّ شَيْءٍ حَيٍّ>> (every living thing), and from which the life of the Jinn originated, though they did not perceive it.\n\n### [The Creation of Adam and the Human Constitution]\n\nReflect, if you are among the people of understanding, upon His saying, the Exalted, <<وَكَانَ عَرْشُهُ عَلَى الْمَاءِ>> (And His Throne was upon the water). Thus, the Throne and all the creatures it contained were brought to life. And <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing except that it glorifies Him with praise). The indefinite form is used here, and only the living glorifies. It is reported in the *Hasan* Hadith from the Messenger of Allah (peace and blessings be upon him) that the Angels said, \"O Lord,\" in a long Hadith, \"Have You created anything stronger than fire?\" He said, \"Yes, water.\" Thus, He made water stronger than fire. If the element of air in the constitution of the Jinn were not ignited by fire, the Jinn would be stronger than the children of Adam, for air is stronger than water. In this Hadith, the Angels said, \"O Lord, have You created anything stronger than water?\" He said, \"Yes, air.\" Then they said, \"O Lord, have You created anything stronger than air?\" He said, \"Yes, the son of Adam.\" [End of Hadith]. Thus, He made the human constitution (النشأة الإنسانية) stronger than air, and He made water stronger than fire, water being the greatest element in the Human, just as fire is the greatest element in the Jinn. For this reason, He said concerning the Devil (الشيطان), <<إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا>> (Indeed, the plot of Satan is weak). He did not attribute any strength to him. And He did not contradict the Mighty One's saying, <<إِنَّ كَيْدَكُنَّ عَظِيمٌ>> (Indeed, your plot is great), nor did He belie it, despite the weakness of the woman's intellect compared to the man's intellect, for women are deficient in intellect. What then do you think of the strength of the man? The reason for this is that the human constitution grants deliberation in matters, patience, thought, and planning, due to the dominance of the two elements—water and earth—in their temperament. Thus, the human possesses abundant intellect, because the earth holds him back and restrains him, and the water softens and facilitates him. The Jinn are not like this, for their intellect lacks that restraint which the human possesses. For this reason, a person is described as \"light-minded\" (*Khafif al-Aql*) or \"subtle-minded\" (*Sakif al-Aql*) if he is weak in judgment and foolish (*Halbaja*). This is the characteristic of the Jinn, and by it, he strayed from the path of guidance due to the lightness of his intellect and his lack of certainty in his consideration, leading him to say, <<أَنَا خَيْرٌ مِنْهُ>> (I am better than him). Thus, he combined ignorance and bad manners due to his lightness.\n\n### [The First Devil among the Jinn]\n\nWhoever among the Jinn disobeys becomes a Devil (شيطانا)—meaning, one banished from the Mercy of Allah. The first among the Jinn to be named Devil was Al-Harith. Allah made him despair (*Ablasa*), meaning He expelled him from His Mercy and expelled Mercy from him. From him, all the devils branched out. Whoever among them believes, such as Hammah ibn Ilham ibn Laqis ibn Iblis, joins the believing Jinn. Whoever remains in disbelief is a Devil. This is a matter of dispute among the scholars of the Sacred Law (*Ulama al-Shari'a*). Some say that the Devil never submits (or becomes Muslim) and they interpret the saying of the Prophet (peace be upon him) concerning his own devil—who is the familiar spirit (*Qarin*) assigned to him—that \"Allah helped me against him, so he submitted (*Aslama*).\" This word is narrated with the final letter (Mīm) having a *damma* (Aslamu) and also a *fatha* (Aslama). The interpreter who holds the first view (with *damma*) interprets it as: \"I was safe from him (*Aslamu minhu*),\" meaning he has no power over me. The opponent interprets the *fatha* (Aslama) as meaning submission or compliance. He says the meaning is that he complied despite being an enemy, and he himself commands me only to good, by way of compulsion from Allah and protection for the Messenger of Allah (peace and blessings be upon him). The opponent of this view says that the meaning of *Aslama* (with *fatha*) is that he believed in Allah, just as a disbeliever submits (becomes Muslim) among us, thus returning as a believer. This latter interpretation is the most preferable and soundest.\n\n### [Iblis, the First of the Wretched among the Jinn]\n\nMost people claim that Iblis is the first of the Jinn, holding the same rank as Adam among humans. This is not the case according to us; rather, he is one of the Jinn, and the first among them, holding the rank of Adam among humans, is someone else. For this reason, Allah the Exalted said, <<إِلَّا إِبْلِيسَ كَانَ مِنَ الْجِنِّ>> (Except Iblis, he was of the Jinn)—meaning, from this species of created beings, just as Cain (*Qabil*) was from humanity. Allah decreed him wretched (*Shaqiyyan*). Thus, Cain was the first of the wretched among humans, and Iblis was the first of the wretched among the Jinn. The punishment of the devils among the Jinn in Hell (*Jahannam*) is mostly by extreme cold (*Zamharir*), not by extreme heat (*Harur*), although they may also be punished by fire. The children of Adam are mostly punished by fire. I once stood by a saint (ولي) whose intellect was impaired (*Makhbul al-Aql*), and his eyes were tearing up. He was saying to the people, \"Do not stop only at His saying, the Exalted, <<لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ>> (I will surely fill Hell with you), addressed to Iblis. Rather, look at His subtle indication to you in His saying to Iblis, 'Hell is from you (جَهَنَّمَ مِنْكَ).' For he is created from fire, and thus, may Allah curse him, he returns to his origin. Even if he is punished by it, the punishment of pottery by fire is more severe. So be cautious.\" This saint, when considering the mention of Hell, only saw fire specifically, and he was heedless that *Jahannam* is a name for both its extreme heat and its extreme cold (*Zamharir*). Collectively, it was named *Jahannam* because it is repulsive in appearance. *Al-Jiham* is the cloud that has poured out its water, and rain (*Ghayth*) is the Mercy of Allah. When Allah removed the rain from the cloud by sending it down, the name *Al-Jiham* was applied to it, due to the removal of the Mercy (which is the rain) from it. Likewise, Allah removed Mercy from Hell, so it became repulsive in appearance and report. It was also named *Jahannam* due to the depth of its bottom; a well is called *Jahnam* if it is deep-bottomed. We ask Allah the Magnificent for security from it for ourselves and for the believers. This much suffices for this chapter.",
    "ur": "(باب نمبر نو) مارجی ناری ارواح (الأرواح المارجية النارية) کی ہستی (الوجود) کی معرفت (المعرفۃ) میں۔\n\nبسم اللہ الرحمن الرحیم\n\nآگ اور نباتات کو ملایا گیا، پس جن کی صورت قائم ہوئی، جو دو چیزوں کے درمیان برزخ (البرزخ) ہے۔\nایک مجسم روح جو پستی میں جگہ رکھتی ہے، اور ایک روح جو بے ٹھکانہ ہے۔\nپس جس نے ان میں سے تجسم کو قبول کیا، اس نے بلا شک و شبہ غذا کے لیے قوت طلب کی۔\nاور جس نے ان میں سے ملائکہ (الملائکة) کو قبول کیا، اس نے آنکھ میں متشکل ہونے کے ذریعے قلب کو قبول کیا۔\nاور اسی لیے وہ کبھی اطاعت کرتا ہے اور کبھی نافرمانی، اور ان کے مخالفین کو دو آگوں سے سزا دی جاتی ہے۔\n\n### [جن، ملائکہ اور انسان کی تخلیق]\n\nاللہ تعالیٰ نے فرمایا: وَخَلَقَ الْجَانَّ مِنْ مَارِجٍ مِنْ نَارٍ (اور جن کو آگ کے شعلے سے پیدا کیا) [الرحمن: 15]۔ اور صحیح حدیث میں آیا ہے کہ اللہ نے ملائکہ (الملائکة) کو نور سے پیدا کیا، اور اللہ نے جن (الجان) کو آگ سے پیدا کیا، اور انسان کو اس چیز سے پیدا کیا جو تمہیں بتائی گئی ہے۔\n\nجہاں تک نبی صلی اللہ علیہ وسلم کا انسان کی تخلیق کے بارے میں یہ فرمانا ہے کہ \"اس چیز سے جو تمہیں بتائی گئی ہے\" اور ملائکہ (الملائکة) اور جن (الجان) کی تخلیق کی طرح واضح طور پر نہ بتانا، تو یہ اختصار کی طلب میں تھا، کیونکہ آپ کو جوامع الکلم (جامع کلمات) عطا کیے گئے تھے اور یہ ان میں سے ہے۔ ملائکہ (الملائکة) اور جن (الجان) کی اصل تخلیق میں کوئی اختلاف نہیں ہے، لیکن انسان کی تخلیق چار مختلف انواع کی تخلیق پر مختلف ہے۔ آدم کی تخلیق حوا کی تخلیق سے مشابہت نہیں رکھتی، اور حوا کی تخلیق باقی بنی آدم کی تخلیق سے مشابہت نہیں رکھتی، اور عیسیٰ علیہ السلام کی تخلیق ان سب سے مشابہت نہیں رکھتی جن کا ہم نے ذکر کیا۔ پس رسول اللہ صلی اللہ علیہ وسلم نے اختصار کا ارادہ فرمایا اور انسان کی تخلیق کی تفصیل پر حوالہ دیا جو ہم تک پہنچی ہے۔ آدم مٹی سے، حوا پسلی سے، عیسیٰ روح پھونکنے سے، اور بنی آدم حقیر پانی (مَاءٍ مَهِينٍ) سے پیدا ہوئے۔\n\n### [آسمان اور زمین کے درمیان معنوی اتصال]\n\nاور جب اللہ نے چار ارکان (عناصر) کو پیدا کیا اور دھواں ثابت ستاروں کے فلک کے مقعر تک بلند ہوا، اور اس دھوئیں میں سات آسمانوں کو کھولا اور ان میں سے بعض کو بعض سے ممتاز کیا، اور ہر آسمان میں اس کا حکم (أَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا) بھیجا، اس کے بعد کہ اس نے زمین میں اس کی غذائیں (أَقْوَاتَهَا) مقرر کر دی تھیں، اور یہ سب چار دنوں (أَرْبَعَةِ أَيَّامٍ) میں ہوا۔ پھر آسمانوں اور زمین سے فرمایا: ائْتِيَا طَوْعًا أَوْ كَرْهًا (تم دونوں خوشی سے آؤ یا ناخوشی سے)، یعنی جب تمہیں کسی ایسے کام کے لیے بلایا جائے جو تم سے مطلوب ہے اور جس کے ظاہر کرنے کی امانت تمہیں دی گئی ہے، تو جواب دو۔ تو انہوں نے کہا: أَتَيْنَا طَائِعِينَ (ہم خوشی سے حاضر ہیں)۔ پس اللہ سبحانہ و تعالیٰ نے آسمان اور زمین کے درمیان ایک معنوی اتصال قائم کر دیا اور اس چیز کی طرف توجہ مبذول کرائی جسے وہ سبحانہ و تعالیٰ اس زمین میں مولدات (پیدا ہونے والی چیزوں) کی صورت میں، جیسے معدنیات، نباتات اور حیوانات، وجود میں لانا چاہتا تھا۔ اور زمین کو بیوی کی طرح اور آسمان کو شوہر کی طرح بنایا۔ اور آسمان زمین پر وہ حکم ڈالتا ہے جو اللہ نے اس میں وحی کیا، جیسے مرد جماع کے ذریعے عورت میں پانی ڈالتا ہے، اور زمین اس القاء کے وقت ان تکوینیات کو ظاہر کرتی ہے جنہیں ذات حق (الحق) نے اس میں اس کی طبقات کے مطابق چھپا رکھا ہے۔\n\n### [چار عناصر اور جن و انسان کی تشکیل]\n\nاسی سے یہ ہوا کہ جب ہوا بھڑکی اور گرم ہوئی تو چراغ کی طرح روشن ہو گئی، اور یہ آگ کا بھڑکنا ہی وہ شعلہ ہے جو ہوا کا جلنا ہے، اور یہی مارج ہے۔ اسے مارج اس لیے کہا گیا کہ یہ آگ ہے جو ہوا کے ساتھ ملی ہوئی ہے، جو کہ بھڑکتی ہوئی ہوا ہے۔ مارج کا مطلب اختلاط (ملنا) ہے، اور اسی سے مرج (چراگاہ) کو مرج کہا جاتا ہے کیونکہ اس میں نباتات ملی جلی ہوتی ہیں۔ پس جن (الجان) دو عناصر سے ہیں: ہوا اور آگ۔ جیسے آدم دو عناصر سے تھے: پانی اور مٹی، جنہیں گوندھا گیا تو مٹی (طین) کا نام پڑا، جیسے آگ کے ہوا سے ملنے سے مارج کا نام پڑا۔ پس اللہ سبحانہ و تعالیٰ نے اس مارج میں جن (الجان) کی صورت کو کھولا۔ پس جو ہوا اس میں ہے اس کی وجہ سے وہ کسی بھی صورت میں متشکل ہو سکتا ہے، اور جو آگ اس میں ہے اس کی وجہ سے وہ لطیف اور عظمت والا ہے۔ اور اس میں قہر، استکبار اور عزت کی طلب موجود ہے، کیونکہ آگ ارکان (عناصر) میں سب سے بلند جگہ رکھتی ہے اور اسے ان چیزوں کو بدلنے پر اختیار حاصل ہے جن کا تقاضا طبیعت کرتی ہے۔ اور یہی وہ سبب ہے جس کی وجہ سے اس نے آدم کو سجدہ کرنے سے تکبر کیا جب اللہ عز و جل نے اسے حکم دیا، اور اس تاویل کی وجہ سے جو اسے یہ کہنے پر مجبور کرتی تھی کہ: أَنَا خَيْرٌ مِنْهُ (میں اس سے بہتر ہوں)، یعنی اس اصل کے حکم کی بنا پر جس سے اللہ نے چار ارکان (عناصر) کے درمیان فضیلت دی۔ اور اسے یہ معلوم نہ تھا کہ پانی کا اختیار جس سے آدم کو پیدا کیا گیا، اس سے زیادہ قوی ہے، کیونکہ پانی اسے ختم کر دیتا ہے، اور مٹی ٹھنڈک اور خشکی کی وجہ سے اس سے زیادہ ثابت ہے۔ پس آدم میں قوت اور ثبات ہے، ان دو ارکان کے غلبے کی وجہ سے جن سے اللہ نے اسے وجود بخشا، اگرچہ اس میں باقی ارکان بھی ہیں، لیکن انہیں وہ اختیار حاصل نہیں ہے، اور وہ ہوا اور آگ ہیں۔ جیسا کہ جن (الجان) میں بھی باقی ارکان ہیں، اسی لیے اسے مارج کہا گیا، لیکن ان ارکان کو اس کی نشأت میں وہ اختیار حاصل نہیں ہے۔ اور آدم کو طبعاً مٹی کی وجہ سے تواضع عطا کی گئی، اگر وہ تکبر کرے تو کسی عارضی امر کی وجہ سے جو وہ اپنی ناریت کی وجہ سے قبول کرتا ہے، جیسے وہ اپنے خیال اور احوال میں ہوائیت کی وجہ سے مختلف صورتوں کو قبول کرتا ہے۔ اور جن (الجان) کو طبعاً ناریت کی وجہ سے تکبر عطا کیا گیا، اگر وہ تواضع کرے تو کسی عارضی امر کی وجہ سے جو وہ اپنی ترابیت (مٹی کی خاصیت) کی وجہ سے قبول کرتا ہے، جیسے وہ اگر شیطان ہو تو گمراہ کرنے پر ثابت قدم رہتا ہے، اور اگر شیطان نہ ہو تو اطاعت پر ثابت قدم رہتا ہے۔\n\n### [سورۃ الرحمن کی تلاوت کے وقت جن]\n\nنبی صلی اللہ علیہ وسلم نے خبر دی جب آپ نے اپنے صحابہ پر سورۃ الرحمن کی تلاوت کی، تو فرمایا: میں نے اسے جنوں پر تلاوت کیا تو وہ تم سے زیادہ بہتر سننے والے تھے۔ وہ کہتے تھے: وَلَا بِشَيْءٍ مِنْ آلَاءِ رَبِّنَا نُكَذِّبُ (اور ہم اپنے رب کی کسی بھی نعمت کو نہیں جھٹلاتے)، جب آپ نے فرمایا: فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ (پس تم دونوں اپنے رب کی کون کون سی نعمتوں کو جھٹلاؤ گے)۔\n\nوہ اس پر ثابت قدم رہے اور متزلزل نہیں ہوئے جب آپ صلی اللہ علیہ وسلم اپنی تلاوت میں ان سے فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ کہتے تھے۔ اور یہ اس ترابیت (مٹی کی خاصیت) کی وجہ سے ہے جو ان میں ہے، اور اس مائیت (پانی کی خاصیت) کی وجہ سے ہے جس نے ناریت (آگ کی خاصیت) کی گرمی کو ختم کر دیا۔ پس ان میں سے کچھ اطاعت گزار ہیں اور کچھ نافرمان، بالکل ہماری طرح۔ اور وہ ملائکہ (الملائکة) کی طرح صورتوں میں متشکل ہونے کی صلاحیت رکھتے ہیں۔\n\n### [وہ اصل صورت جس کی طرف روحانی منسوب ہے]\n\nاور اللہ نے ہماری آنکھوں کو ان سے روک رکھا ہے، پس ہم انہیں نہیں دیکھتے مگر جب اللہ چاہے کہ اپنے بعض بندوں پر کشف (الکشف) کرے تو وہ انہیں دیکھتے ہیں۔ اور چونکہ وہ لطافت اور نزاکت کے عالم سے ہیں، اس لیے وہ ان حسی صورتوں میں تشکل کو قبول کرتے ہیں جو وہ چاہتے ہیں۔ پس وہ اصل صورت جس کی طرف روحانی (الروحاني) منسوب ہے، وہ پہلی صورت ہے جسے اس نے قبول کیا جب اللہ نے اسے وجود بخشا، پھر اس پر صورتیں بدلتی رہتی ہیں، اس کے مطابق جس میں وہ داخل ہونا چاہتا ہے۔ اور اگر اللہ ہماری آنکھوں سے پردہ ہٹا دے یہاں تک کہ ہم وہ دیکھیں جو مصور قوت نے، جسے اللہ نے ہم میں سے متخیل کے خیال میں تصویر کشی پر مقرر کیا ہے، صورت دی ہے، تو تم انسان کو مختلف صورتوں میں دیکھو گے جو ایک دوسرے سے مشابہت نہیں رکھتیں۔\n\n### [جن اور انسان میں تناسل]\n\nاور جب روح کو شعلے میں پھونکا گیا، جو اپنی لطافت کی وجہ سے بہت زیادہ مضطرب تھا، اور پھونکنے نے اس کے اضطراب کو مزید بڑھا دیا، اور ہوا اس پر غالب آ گئی اور وہ ایک حالت پر قرار نہ پا سکا، تو جن (الجان) کا عالم اس صورت پر ظاہر ہوا۔ اور جیسے انسانوں میں رحم میں پانی ڈالنے سے تناسل واقع ہوا، تو اس بشری آدمی صنف میں ذریت اور توالد ہوا، اسی طرح جن (الجان) میں تناسل ان کی مادہ کے رحم میں ہوا ڈالنے سے واقع ہوا، پس جن کی صنف میں ذریت اور توالد ہوا۔ اور ان کا وجود قوس (کمان) کے ذریعے تھا، اور وہ ناری ہے۔ اسی طرح وارد (کشف) نے ذکر کیا، اللہ اس کی حفاظت فرمائے۔\n\n### [جن اور انسان کی تخلیق کے درمیان کے سال]\n\nجن (الجان) کی تخلیق اور آدم کی تخلیق کے درمیان ساٹھ ہزار سال کا فاصلہ تھا۔ اور بعض لوگوں کے گمان کے مطابق، جن (الجان) کا توالد چار ہزار سال گزرنے کے بعد منقطع ہو جانا چاہیے تھا، اور انسانوں کا توالد سات ہزار سال گزرنے کے بعد منقطع ہو جانا چاہیے تھا، لیکن معاملہ ایسا نہیں ہوا، بلکہ معاملہ اللہ کی مرضی کی طرف لوٹتا ہے۔ پس جنوں میں توالد آج تک باقی ہے، اور اسی طرح ہم میں بھی۔ پس اس سے تحقیق کرو کہ آدم کو کتنے سال ہوئے اور دنیا کے ختم ہونے اور انسانوں کے اس کی پشت سے فنا ہونے اور دار آخرت کی طرف پلٹنے میں کتنا وقت باقی ہے۔ اور یہ راسخین فی العلم (علم میں پختہ لوگوں) کا مذہب نہیں ہے، بلکہ یہ ایک ایسے گروہ نے کہا ہے جس کی بات کا اعتبار نہیں کیا جاتا۔\n\n### [جن، ملک اور انسان کے درمیان برزخ]\n\nپس ملائکہ (الملائکة) نور میں پھونکی گئی ارواح ہیں، جن (الجان) ہواؤں میں پھونکی گئی ارواح ہیں، اور انسان اجسام میں پھونکی گئی ارواح ہیں۔ اور کہا جاتا ہے کہ جن (الجان) میں سے پہلے موجود سے کوئی مادہ الگ نہیں ہوئی، جیسے حوا آدم سے الگ ہوئی تھیں۔ بعض نے کہا کہ اللہ نے جن (الجان) میں سے پہلے موجود کے اندر ہی فرج (شرمگاہ) پیدا کر دی، پس اس نے اپنے بعض سے بعض کے ساتھ نکاح کیا، تو آدم کی ذریت کی طرح مذکر اور مؤنث پیدا ہوئے، پھر انہوں نے آپس میں نکاح کیا۔ پس اس کی تخلیق خنثیٰ کی طرح تھی، اور اسی لیے جن (الجان) عالم برزخ (البرزخ) سے ہیں، ان میں بشر سے بھی مشابہت ہے اور ملائکہ (الملائکة) سے بھی، جیسے خنثیٰ جو مذکر اور مؤنث دونوں سے مشابہت رکھتا ہے۔\n\n### [جن کی غذا اور نکاح]\n\nاور چونکہ جن (الجان) پر ہوا اور آگ کا عنصر غالب ہے، اس لیے ان کی غذا وہ ہے جسے ہوا اٹھا کر لے جاتی ہے، جو ہڈیوں میں موجود چکنائی ہے۔ کیونکہ اللہ نے ان کے لیے اس میں رزق رکھا ہے۔ ہم دیکھتے ہیں کہ ہڈی کا جوہر اور جو گوشت وہ اٹھائے ہوئے ہے، اس میں کوئی کمی نہیں آتی، پس ہمیں یقیناً معلوم ہوا کہ اللہ نے ان کے لیے اس میں رزق رکھا ہے۔ اور اسی لیے نبی صلی اللہ علیہ وسلم نے ہڈیوں کے بارے میں فرمایا: إِنَّهَا زَادُ إِخْوَانِكُمْ مِنَ الْجِنِّ (یہ تمہارے جن بھائیوں کا توشہ ہے)۔ اور ایک حدیث میں ہے: إِنَّ اللَّهَ جَاعِلٌ لَهُمْ فِيهَا رِزْقًا (بے شک اللہ نے ان کے لیے اس میں رزق رکھا ہے)۔\n\nاور مجھے بعض مکاشفین (کشف) نے خبر دی کہ انہوں نے جنوں کو ہڈی کے پاس آتے دیکھا، وہ اسے سونگھتے ہیں جیسے درندے سونگھتے ہیں، پھر واپس چلے جاتے ہیں، اور انہوں نے اس سونگھنے میں اپنا رزق اور غذا حاصل کر لی ہوتی ہے۔ پس سبحان اللطیف الخبیر۔ اور جہاں تک نکاح کے وقت ان کے ایک دوسرے سے ملنے کا تعلق ہے، تو یہ اس طرح لپٹنا ہے جیسے تم بھٹی یا مٹی کے تندور سے نکلنے والے دھوئیں کو دیکھتے ہو، جو ایک دوسرے میں داخل ہوتا ہے، اور دونوں شخص اس تداخل سے لذت محسوس کرتے ہیں، اور جو کچھ وہ ڈالتے ہیں وہ کھجور کے لقاح کی طرح محض خوشبو کے ذریعے ہوتا ہے، بالکل ان کی غذا کی طرح۔\n\n### [جن کے قبائل اور عشائر]\n\nوہ قبائل اور عشائر ہیں، اور ذکر کیا گیا ہے کہ وہ بارہ اصل قبائل میں محدود ہیں، پھر وہ شاخوں میں تقسیم ہوتے ہیں۔ اور ان کے درمیان بڑی جنگیں ہوتی ہیں، اور بعض بگولے (زوابع) ان کی جنگ کا عین سبب ہو سکتے ہیں۔ کیونکہ بگولہ دو ہواؤں کا مقابلہ ہوتا ہے، جن میں سے ہر ایک دوسری کو چیرنے سے روکتی ہے، اور یہ رکاوٹ اس گھومنے کا سبب بنتی ہے جو حس میں گرد و غبار میں نظر آتا ہے، جو متضاد ہواؤں کے اثرات ہیں۔ پس ان کی جنگ بھی اسی طرح ہوتی ہے۔ اور ہر بگولہ ان کی جنگ نہیں ہوتا۔ اور عمرو الجنی کی حدیث مشہور ہے اور روایت کی گئی ہے، اور اس کا قتل اس بگولے میں ہوا جسے دیکھا گیا، پھر وہ اس سے ہٹ گیا اور وہ موت کے قریب تھا، پس وہ جلد ہی مر گیا۔ وہ جنوں میں سے ایک نیک بندہ تھا۔ اگر اس کتاب کی بنیاد اخبار اور حکایات کو بیان کرنے پر ہوتی تو ہم ان میں سے کچھ حصہ ذکر کرتے، لیکن یہ معانی کے علم کی کتاب ہے، پس ان کی حکایات کو ادب کی تاریخوں اور ان کے اشعار میں دیکھا جائے۔\n\n### [روحانی عالم کا تشکل]\n\nپھر ہم واپس آتے ہیں اور کہتے ہیں کہ جب یہ روحانی (الروحاني) عالم متشکل ہو کر کسی حسی صورت میں ظاہر ہوتا ہے، تو آنکھ اسے مقید کر لیتی ہے، اس خاصیت کی وجہ سے کہ جب تک آنکھ اسے دیکھتی رہے، وہ اس صورت سے باہر نہیں نکل سکتا۔ لیکن اگر انسان اسے مقید کر لے اور مسلسل اسے دیکھتا رہے اور اس کے پاس چھپنے کی کوئی جگہ نہ ہو، تو یہ روحانی (الروحاني) اس کے لیے ایک صورت ظاہر کرتا ہے جسے وہ اس پر پردے کی طرح بنا دیتا ہے، پھر اسے یہ خیال دلاتا ہے کہ وہ صورت کسی خاص سمت میں چل رہی ہے، پس اس کی آنکھ اس کا پیچھا کرتی ہے۔ جب اس کی آنکھ اس کا پیچھا کرتی ہے، تو روحانی (الروحاني) اپنی قید سے نکل جاتا ہے اور اس سے غائب ہو جاتا ہے۔ اور اس کے غائب ہونے سے وہ صورت دیکھنے والے کی نظر سے زائل ہو جاتی ہے جس کی آنکھ نے اس کا پیچھا کیا تھا، کیونکہ وہ روحانی (الروحاني) کے لیے اس نور کی طرح ہے جو چراغ کے ساتھ ہوتا ہے اور جس کی روشنی کونوں میں پھیلی ہوتی ہے۔ پس جب چراغ کا جسم غائب ہو جاتا ہے تو وہ نور بھی ختم ہو جاتا ہے۔ پس یہ صورت بھی اسی طرح ہے۔ پس جو شخص یہ جانتا ہے اور اسے مقید رکھنا چاہتا ہے، وہ اپنی آنکھ سے اس صورت کا پیچھا نہیں کرتا۔ اور یہ ان الٰہی اسرار میں سے ہے جو صرف اللہ کے بتانے سے ہی معلوم ہوتے ہیں۔ اور وہ صورت روحانی (الروحاني) کی عین ذات کے علاوہ کچھ نہیں ہے، بلکہ وہ اس کی عین ذات ہے، اگرچہ وہ ہزار جگہوں پر یا ہر جگہ پر ہو اور مختلف شکلوں میں ہو۔ اور اگر ان صورتوں میں سے کسی صورت کا قتل ہو جائے اور وہ ظاہری طور پر مر جائے، تو وہ روحانی (الروحاني) دنیا کی زندگی سے برزخ (البرزخ) کی طرف منتقل ہو جاتا ہے، جیسے ہم موت سے منتقل ہوتے ہیں، اور دنیا کے عالم میں اس کا کوئی ذکر باقی نہیں رہتا، بالکل ہماری طرح۔ اور ان محسوس صورتوں کو جن میں روحانیات ظاہر ہوتے ہیں، اجساد (جسم) کہا جاتا ہے، اور یہی اللہ تعالیٰ کا فرمان ہے: وَأَلْقَيْنَا عَلَى كُرْسِيِّهِ جَسَدًا (اور ہم نے اس کے تخت پر ایک دھڑ ڈال دیا) [ص: 34]، اور اس کا فرمان: وَمَا جَعَلْنَاهُمْ جَسَدًا لَا يَأْكُلُونَ الطَّعَامَ (اور ہم نے انہیں ایسے جسم نہیں بنائے تھے کہ وہ کھانا نہ کھائیں) [الانبیاء: 8]۔ اور جن (الجان) اور ملائکہ (الملائکة) کے درمیان فرق، اگرچہ وہ روحانیت میں شریک ہیں، یہ ہے کہ جن (الجان) کی غذا وہ ہے جسے طبعی اجسام کھانے کی چیزوں میں سے اٹھاتے ہیں، اور ملائکہ (الملائکة) ایسے نہیں ہیں۔ اور اسی لیے اللہ نے ابراہیم خلیل کے مہمانوں کے قصے میں ذکر کیا: فَلَمَّا رَأَى أَيْدِيَهُمْ لَا تَصِلُ إِلَيْهِ نَكِرَهُمْ (پھر جب اس نے دیکھا کہ ان کے ہاتھ اس تک نہیں پہنچتے تو وہ ان سے ڈر گیا)، یعنی بھنے ہوئے بچھڑے تک، یعنی وہ اسے نہیں کھاتے، اور وہ ڈر گیا۔\n\n### [جن کے عالم کی نشأت]\n\nاور جب جن (الجان) کے عالم کی نشأت کا وقت آیا، تو پہلے فلک (آسمان) کے امین ملائکہ (الملائکة) میں سے تین متوجہ ہوئے، پھر انہوں نے دوسرے آسمان سے اپنے نائبوں میں سے وہ لیا جس کی انہیں اس نشأت میں ضرورت تھی، پھر وہ آسمانوں کی طرف اترے، اور دوسرے اور چھٹے آسمان سے دو نائب لیے، اور وہاں سے ارکان (عناصر) کی طرف اترے، پس انہوں نے جگہ کو تیار کیا، اور ان کے پیچھے تین دوسرے امین آئے، اور انہوں نے دوسرے آسمان سے اپنے نائبوں میں سے وہ لیا جس کی انہیں ضرورت تھی، پھر وہ وہاں سے تیسرے اور پانچویں آسمان کی طرف اترے، پس انہوں نے دو فرشتے لیے، اور چھٹے آسمان سے گزرے، پس انہوں نے ملائکہ (الملائکة) میں سے ایک اور نائب لیا، اور ارکان (عناصر) کی طرف اترے تاکہ تسویہ (برابر کرنا) مکمل کریں۔ پھر باقی چھ اترے اور دوسرے آسمان اور باقی آسمانوں میں سے جو نائب باقی تھے وہ لیے، پس وہ سب علیم و حکیم کے اذن سے اس نشأت کے تسویہ پر جمع ہو گئے۔ جب اس کی نشأت مکمل ہو گئی اور اس کی بناوٹ سیدھی ہو گئی، تو روح عالم امر سے متوجہ ہوئی، پس اس صورت میں ایک روح پھونکی گئی جو اس میں اپنے وجود کے ساتھ زندگی لے آئی، پس وہ اپنے پیدا کرنے والے کی حمد و ثنا کے ساتھ کھڑا ہوا، یہ وہ فطرت تھی جس پر اسے پیدا کیا گیا، اور اس کے نفس میں ایک عزت اور عظمت تھی جس کا سبب وہ نہیں جانتا تھا اور نہ ہی یہ جانتا تھا کہ وہ کس پر فخر کرے، کیونکہ اس کے سوا طبائع کے عالم میں کوئی دوسری مخلوق نہیں تھی۔ پس وہ اپنے رب کی عبادت کرتا رہا، اپنی عزت پر اصرار کرتا رہا، اور اپنے پیدا کرنے والے کی ربوبیت کے سامنے تواضع کرتا رہا، ان عارضی امور کی وجہ سے جو اس کی نشأت میں اس پر آتے تھے۔ یہاں تک کہ آدم کو پیدا کیا گیا۔ جب جن (الجان) نے اس کی صورت دیکھی، تو ان میں سے ایک پر، جس کا نام حارث تھا، اس نشأت کا بغض غالب آ گیا، اور اس آدم کی صورت کو دیکھ کر اس کا چہرہ بگڑ گیا، اور یہ بات اس کی جنس کے سامنے ظاہر ہوئی، پس انہوں نے اسے اس غم اور حزن کی وجہ سے ملامت کی جو انہوں نے اس پر دیکھا۔ پھر جب آدم کا معاملہ ہوا جو ہوا، تو حارث نے وہ ظاہر کر دیا جو وہ اپنے نفس میں محسوس کرتا تھا، اور اس نے اپنے خالق کے حکم کی تعمیل سے انکار کر دیا کہ وہ آدم کو سجدہ کرے، اور اپنی نشأت کی وجہ سے آدم پر تکبر کیا اور اپنی اصل پر فخر کیا، اور اس سے پانی کی قوت کا راز غائب ہو گیا، جسے اللہ نے کُلَّ شَيْءٍ حَيٍّ (ہر زندہ چیز) کی اصل بنایا ہے، اور اسی سے جن (الجان) کی زندگی تھی اور وہ نہیں جانتے تھے۔\n\n### [آدم کی تخلیق اور انسان کی نشأت]\n\nاگر تم اہل فہم میں سے ہو تو اللہ تعالیٰ کے اس فرمان پر غور کرو: وَكَانَ عَرْشُهُ عَلَى الْمَاءِ (اور اس کا عرش پانی پر تھا) [ہود: 7]، پس عرش اور جو مخلوقات اس پر تھیں سب زندہ ہو گئیں، اور وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے) [الاسراء: 44]، یہاں نکرہ (عام) کا صیغہ لایا گیا، اور تسبیح صرف زندہ چیز ہی کرتی ہے۔\n\nحسن حدیث میں رسول اللہ صلی اللہ علیہ وسلم سے روایت ہے کہ ملائکہ (الملائکة) نے کہا: اے رب! (ایک طویل حدیث میں) کیا تو نے آگ سے زیادہ سخت کوئی چیز پیدا کی ہے؟ فرمایا: ہاں، پانی۔ پس پانی کو آگ سے زیادہ قوی بنایا گیا۔ اور اگر جن (الجان) کی نشأت میں ہوا کا عنصر آگ سے بھڑکا ہوا نہ ہوتا، تو جن (الجان) بنی آدم سے زیادہ قوی ہوتے، کیونکہ ہوا پانی سے زیادہ قوی ہے۔ ملائکہ (الملائکة) نے اس حدیث میں کہا: اے رب! کیا تو نے پانی سے زیادہ سخت کوئی چیز پیدا کی ہے؟ فرمایا: ہاں، ہوا! پھر کہا: اے رب! کیا تو نے ہوا سے زیادہ سخت کوئی چیز پیدا کی ہے؟ فرمایا: ہاں، ابن آدم۔\n\nاس حدیث نے انسانی نشأت کو ہوا سے زیادہ قوی بنایا، اور پانی کو آگ سے زیادہ قوی بنایا، اور پانی انسان میں سب سے بڑا عنصر ہے، جیسے آگ جن (الجان) میں سب سے بڑا عنصر ہے۔ اور اسی لیے شیطان (شیطان) کے بارے میں فرمایا: إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا (بے شک شیطان کی چال کمزور ہے) [النساء: 76]۔ اور اس نے عزیز (اللہ) کے اس فرمان پر کوئی اعتراض نہیں کیا: إِنَّ كَيْدَكُنَّ عَظِيمٌ (بے شک تمہاری چال بڑی ہے) [یوسف: 28]، اور نہ ہی اسے جھٹلایا، حالانکہ عورت کی عقل مرد کی عقل سے کمزور ہوتی ہے۔ پس تمہارا مرد کی قوت کے بارے میں کیا خیال ہے؟ اور اس کا سبب یہ ہے کہ انسانی نشأت معاملات میں ٹھہراؤ، غور و فکر اور تدبیر عطا کرتی ہے، کیونکہ اس کے مزاج پر پانی اور مٹی کے عناصر غالب ہیں، پس اس کی عقل وافر ہوتی ہے، کیونکہ مٹی اسے روکتی اور تھامتی ہے، اور پانی اسے نرم اور آسان بناتا ہے۔ اور جن (الجان) ایسے نہیں ہیں، کیونکہ ان کی عقل میں وہ گرفت نہیں ہے جو انسان کی عقل میں ہوتی ہے۔ اور اسی لیے کہا جاتا ہے کہ فلاں ہلکی عقل والا اور کمزور عقل والا ہے، جب وہ کمزور رائے والا اور بے وقوف ہو۔ اور یہی جن (الجان) کی صفت ہے، اور اسی وجہ سے وہ ہدایت کے راستے سے بھٹک گیا، اپنی عقل کی ہلکا پن اور اپنے غور و فکر میں عدم ثبات کی وجہ سے، پس اس نے کہا: أَنَا خَيْرٌ مِنْهُ (میں اس سے بہتر ہوں)، پس اس نے اپنی ہلکا پن کی وجہ سے جہالت اور بدتمیزی دونوں کو جمع کر دیا۔\n\n### [جن میں سے پہلا شیطان]\n\nجن (الجان) میں سے جس نے نافرمانی کی وہ شیطان (شیطان) بن گیا، یعنی اللہ کی رحمت سے دور کر دیا گیا۔ اور جنوں میں سب سے پہلے جسے شیطان (شیطان) کہا گیا وہ حارث تھا۔ پس اللہ نے اسے ابلیس بنا دیا، یعنی اسے اپنی رحمت سے دور کر دیا، اور رحمت کو اس سے دور کر دیا۔ اور اسی سے تمام شیاطین (شیاطین) کی شاخیں نکلیں۔ پس ان میں سے جو ایمان لایا، جیسے ہامہ بن الہام بن لاقیس بن ابلیس، وہ جنوں کے مؤمنین سے مل گیا، اور جو اپنے کفر پر باقی رہا وہ شیطان (شیطان) تھا۔ اور یہ علماء شریعت کے درمیان اختلافی مسئلہ ہے، بعض نے کہا کہ شیطان (شیطان) کبھی مسلمان نہیں ہو سکتا۔ اور انہوں نے نبی صلی اللہ علیہ وسلم کے اس فرمان کی تاویل کی جو آپ نے اپنے شیطان (قرین) کے بارے میں فرمایا جو آپ پر مقرر تھا: إِنَّ اللَّهَ أَعَانَنِي عَلَيْهِ فَأَسْلَمَ (بے شک اللہ نے اس پر میری مدد کی تو وہ مسلمان ہو گیا)۔\n\nیہ روایت میم کے رفع (فَأَسْلَمُ) اور فتح (فَأَسْلَمَ) دونوں کے ساتھ مروی ہے۔ پس اس قائل نے رفع کی تاویل یہ کی کہ اس کا مطلب ہے \"میں اس سے محفوظ رہا\"، یعنی اس کا مجھ پر کوئی راستہ نہیں ہے۔ اور مخالف نے بھی اسی طرح تاویل کی۔ اور فتح کی تاویل انقیاد (فرمانبرداری) پر کی، کہا کہ اس کا مطلب ہے کہ وہ دشمن ہونے کے باوجود فرمانبردار ہو گیا، پس وہ بذات خود مجھے صرف بھلائی کا حکم دیتا ہے، یہ اللہ کی طرف سے جبر اور رسول اللہ صلی اللہ علیہ وسلم کے لیے عصمت ہے۔ اور مخالف نے کہا کہ فَأَسْلَمَ (فتح کے ساتھ) کا مطلب ہے کہ وہ اللہ پر ایمان لے آیا، جیسے ہمارے ہاں کافر مسلمان ہوتا ہے، پس وہ مؤمن بن جاتا ہے، اور یہی زیادہ اولیٰ اور واضح ہے۔\n\n### [ابلیس جن میں سے پہلا بدبخت]\n\nاور اکثر لوگ یہ گمان کرتے ہیں کہ وہ جنوں میں پہلا ہے، جیسے آدم انسانوں میں پہلے ہیں، لیکن ہمارے نزدیک ایسا نہیں ہے، بلکہ وہ جنوں میں سے ایک ہے، اور ان میں پہلا، جو انسانوں میں آدم کی طرح ہے، وہ کوئی اور ہے۔ اور اسی لیے اللہ تعالیٰ نے فرمایا: إِلَّا إِبْلِيسَ كَانَ مِنَ الْجِنِّ (سوائے ابلیس کے، وہ جنوں میں سے تھا) [الکہف: 50]، یعنی مخلوق کی اس صنف میں سے، جیسے قابیل انسانوں میں سے تھا۔ اور اللہ نے اسے بدبخت لکھ دیا، پس وہ انسانوں میں پہلا بدبخت ہے، اور ابلیس جنوں میں پہلا بدبخت ہے۔ اور جنوں کے شیاطین (شیاطین) کا عذاب جہنم میں زیادہ تر زمہریر (شدید ٹھنڈ) سے ہو گا، نہ کہ حرور (شدید گرمی) سے۔ اور کبھی اسے آگ سے بھی عذاب دیا جائے گا۔ اور بنی آدم کا زیادہ تر عذاب آگ سے ہو گا۔ اور میں ایک دن اولیاء میں سے ایک مخبوط العقل (دیوانے) کے پاس کھڑا تھا، اور اس کی آنکھوں سے آنسو بہہ رہے تھے، اور وہ لوگوں سے کہہ رہا تھا: تم صرف اللہ تعالیٰ کے اس فرمان پر نہ ٹھہرو جو اس نے ابلیس کے لیے کہا: لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ (میں تجھ سے جہنم کو بھر دوں گا) [ص: 85]، بلکہ اس کی طرف دیکھو جو اس نے تمہیں اپنے اس فرمان سے اشارہ کیا: جَهَنَّمَ مِنْكَ (تجھ سے جہنم)، کیونکہ وہ آگ سے پیدا کیا گیا ہے، پس وہ لعنتی اپنی اصل کی طرف لوٹ جائے گا، اور اگر اسے اس سے عذاب دیا جائے تو مٹی کے برتن کو آگ سے عذاب دینا زیادہ سخت ہوتا ہے، پس احتیاط کرو۔ اس ولی نے جہنم کے ذکر سے صرف آگ کو ہی سمجھا اور اس سے غافل رہا کہ جہنم اس کی گرمی (حرور) اور اس کی ٹھنڈک (زمہریر) دونوں کا نام ہے۔ اور مجموعی طور پر اسے جہنم اس لیے کہا گیا کہ وہ ناپسندیدہ منظر رکھتی ہے۔ اور جہام وہ بادل ہے جس نے اپنا پانی بہا دیا ہو، اور بارش اللہ کی رحمت ہے۔ پس جب اللہ نے بادل سے بارش کو اتارنے کے ذریعے رحمت کو زائل کر دیا، تو اس پر جہام کا نام اطلاق کیا گیا، رحمت کے زائل ہونے کی وجہ سے جو کہ بارش ہے۔ اسی طرح اللہ نے جہنم سے رحمت کو زائل کر دیا، پس وہ ناپسندیدہ منظر اور خبر والی ہو گئی۔ اور اسے جہنم اس لیے بھی کہا جاتا ہے کہ اس کی گہرائی بہت زیادہ ہوتی ہے، کہا جاتا ہے کہ رکیۃ جہنام (گہرا کنواں) جب وہ دور کی گہرائی والا ہو۔ ہم اللہ عظیم سے اپنے لیے اور مؤمنین کے لیے اس سے امان مانگتے ہیں۔ اور اس باب میں یہ مقدار کافی ہے۔",
    "fa": "(باب نهم) در معرفت هستی ارواح شعله‌گون آتشین (مارجیه ناریه)\n\nبه نام خداوند بخشنده مهربان\n\n> آتش و گیاه در هم آمیختند و برخاست\n> صورت جن، برزخی (برزخ) میان دو چیز\n> میان روحی جسمانی و مکان‌مند\n> در حضیض، و میان روحی بی‌مکان (بلا أین)\n> پس آن بخش از جن که رو به جسمانیت داشت\n> خوراک را برای تغذیه بی‌کم‌وکاست طلب کرد\n> و آن بخش که رو به فرشتگان داشت\n> قلب را با شکل‌پذیری در چشم پذیرفت\n> و به همین دلیل گاهی اطاعت می‌کند و گاهی عصیان\n> و مخالفانشان با دو آتش مجازات می‌شوند.\n\n### [آفرینش جن، فرشتگان و انسان]\n\nخداوند متعال فرمود: «و جن را از آمیزه‌ای از آتش (مارِجٍ من نارٍ) آفرید.» و در حدیث صحیح آمده است که خداوند فرشتگان را از نور آفرید و جن را از آتش آفرید و انسان را از آنچه به شما گفته شده است آفرید.\n\nاما سخن پیامبر (صلی الله علیه و آله) در مورد آفرینش انسان که فرمود: «از آنچه به شما گفته شده است»، و مانند آنچه در مورد آفرینش فرشتگان و جن فرمود، نگفت، به دلیل طلب اختصار بود؛ زیرا به او جوامع الکلم (جوامع الکلم) عطا شده است و این یکی از آنهاست. آفرینش فرشتگان و جن در اصل خلقتشان تفاوتی ندارد، اما آفرینش انسان بر چهار نوع مختلف است: آفرینش آدم شبیه آفرینش حوا نیست، و آفرینش حوا شبیه آفرینش سایر بنی‌آدم نیست، و آفرینش عیسی (علیه السلام) شبیه آفرینش هیچ‌یک از کسانی که ذکر کردیم نیست. پس رسول خدا (صلی الله علیه و آله) قصد اختصار داشت و به آنچه از تفصیل آفرینش انسان به ما رسیده است، ارجاع داد. آدم از گِل است، حوا از دنده، عیسی از دمیدن روح، و بنی‌آدم از آبی ناچیز (ماءٍ مَهِينٍ).\n\n### [پیوند معنوی میان آسمان و زمین]\n\nو هنگامی که خداوند ارکان چهارگانه را ایجاد کرد و دود به مقعر فلک کواکب ثابت بالا رفت و در آن دود هفت آسمان را شکافت و برخی را از برخی دیگر متمایز ساخت و در هر آسمانی امرش را وحی کرد (أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها)، پس از آنکه روزی‌های زمین را مقدر ساخت، و این همه در چهار روز (أَرْبَعَةِ أَيَّامٍ) بود، سپس به آسمان‌ها و زمین فرمود: «خواه یا ناخواه بیایید (ائْتِيا طَوْعاً أَوْ كَرْهاً)»؛ یعنی اگر برای آنچه از شما خواسته می‌شود و بر آن امین شده‌اید که آشکار سازید، فراخوانده شدید، پاسخ دهید. پس گفتند: «ما فرمانبردار آمدیم (أَتَيْنا طائِعِينَ)». پس خداوند سبحان میان آسمان و زمین پیوندی معنوی و توجهی به آنچه می‌خواهد در این زمین از موالید (معدن، نبات و حیوان) ایجاد کند، قرار داد. و زمین را مانند همسر و آسمان را مانند شوهر قرار داد. و آسمان از امری که خداوند در آن وحی کرده است، به زمین القا می‌کند، همان‌گونه که مرد با جماع آب را در زن می‌اندازد، و زمین هنگام القا، آنچه را که حق (الحق) در آن از تکوینات بر طبقاتش پنهان کرده است، آشکار می‌سازد.\n\n### [عناصر چهارگانه و تکوین جن و انسان]\n\nپس از آن، هوا چون مشتعل و گرم شد، مانند چراغ برافروخته گشت، و این همان اشتعال آتش است؛ آن شعله‌ای که احتراق هواست و همان مارج (مارج) است. و مارج نامیده شد، زیرا آتشی است که با هوا مخلوط شده است، و آن همان هوای مشتعل است؛ زیرا مرج به معنای اختلاط است، و از همین رو مرج (چمنزار) را مرج نامیدند به دلیل اختلاط گیاهان در آن. پس جن از دو عنصر هوا و آتش است، همان‌گونه که آدم از دو عنصر آب و خاک بود که با هم آمیخته شدند و نام گِل (طین) بر آن نهاده شد، همان‌گونه که برای آمیزش آتش با هوا نام مارج (مارج) پدید آمد. پس خداوند سبحان در آن مارج، صورت جن را گشود. به واسطه هوایی که در آن است، به هر صورتی که بخواهد شکل می‌گیرد، و به واسطه آتشی که در آن است، لطیف و بزرگ شد و در آن طلب قهر، استکبار و عزت بود؛ زیرا آتش از نظر مکان، بالاترین ارکان است و بر دگرگون‌سازی چیزهایی که طبیعت اقتضا می‌کند، سلطه دارد. و این همان سببی است که باعث شد ابلیس از سجده بر آدم استکبار ورزد، هنگامی که خداوند عزوجل او را امر کرد، با تأویلی که او را واداشت تا بگوید: «من از او بهترم (أَنَا خَيْرٌ مِنْهُ)»؛ یعنی به حکم اصلی که خداوند با آن میان ارکان چهارگانه برتری نهاد. و او ندانست که سلطه آبی که آدم از آن آفریده شده، قوی‌تر از اوست، زیرا آب آتش را از بین می‌برد، و خاک به دلیل سردی و خشکی از او ثابت‌تر است. پس آدم به دلیل غلبه دو رکنی که خداوند او را از آنها آفرید، دارای قدرت و ثبات است، اگرچه بقایای ارکان دیگر (هوا و آتش) نیز در او هست، اما آن سلطه را ندارند، همان‌گونه که در جن نیز بقایای ارکان دیگر هست و به همین دلیل مارج نامیده شد، اما در نشأتش آن سلطه را ندارند. و به آدم تواضع به طبع طینی‌اش عطا شد؛ اگر تکبر کند، به دلیل امری عارضی است که آن را به واسطه ناریت (آتشین بودن) خود می‌پذیرد، همان‌گونه که اختلاف صور در خیال و احوالش را از هوائیت (هوایی بودن) می‌پذیرد. و به جن تکبر به طبع ناری‌اش عطا شد؛ اگر تواضع کند، به دلیل امری عارضی است که آن را به واسطه ترابیت (خاکی بودن) خود می‌پذیرد، همان‌گونه که ثبات بر اغوا را اگر شیطان باشد، و ثبات بر طاعات را اگر شیطان نباشد، می‌پذیرد.\n\n### [جن هنگام تلاوت سوره الرحمن]\n\nپیامبر (صلی الله علیه و آله) خبر داد که وقتی سوره الرحمن را بر اصحابش تلاوت کرد، فرمود: «من آن را بر جن تلاوت کردم و آنان بهتر از شما به آن گوش دادند. آنان می‌گفتند: هیچ‌یک از نعمت‌های پروردگارمان را تکذیب نمی‌کنیم، هنگامی که می‌گفتم: پس کدام‌یک از نعمت‌های پروردگارتان را انکار می‌کنید (فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ)؟»\n\nآنان بر این سخن ثابت ماندند و متزلزل نشدند، هنگامی که پیامبر (صلی الله علیه و آله) در تلاوت خود به ایشان می‌فرمود: «پس کدام‌یک از نعمت‌های پروردگارتان را انکار می‌کنید (فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ)؟» و این به دلیل ترابیت (خاکی بودن) و مائیت (آبی بودن) است که حرارت ناریت (آتشین بودن) را از بین برده است. پس از آنان مطیع و عاصی وجود دارد، مانند ما، و آنان نیز مانند فرشتگان توانایی شکل‌پذیری در صور مختلف را دارند.\n\n### [صورت اصلی که روحانی به آن منسوب است]\n\nو خداوند دیدگان ما را از ایشان پوشانده است، پس آنان را نمی‌بینیم مگر زمانی که خداوند بخواهد برای برخی از بندگانش کشف (الکشف) کند تا ایشان را ببینند. و چون آنان از عالم لطافت و نازکی هستند، شکل‌پذیری در هر صورتی حسی را که بخواهند، می‌پذیرند. صورت اصلی که روحانی (الروحاني) به آن منسوب است، همان اولین صورتی است که هنگام ایجاد شدن توسط خداوند پذیرفت، سپس صور بر او بر حسب آنچه می‌خواهد در آن وارد شود، متفاوت می‌گردد. اگر خداوند پرده از دیدگان ما برمی‌داشت تا آنچه را که قوه مصوره (قوه تصویرگر) که خداوند آن را موکل بر تصویر در خیال متخیل ما کرده است، تصویر می‌کند، ببینیم، در آن صورت انسان را در صور مختلف می‌دیدی که هیچ‌یک شبیه دیگری نیست.\n\n### [تناسل در جن و انسان]\n\nو هنگامی که روح در شعله دمیده شد، که به دلیل لطافتش بسیار مضطرب است، و دمیدن روح بر اضطرابش افزود و هوا بر آن غلبه کرد و قرار گرفتن بر یک حالت واحد از بین رفت، عالم جن بر آن صورت ظاهر شد. و همان‌گونه که تناسل در بشر با القای آب در رحم رخ داد و ذریه و توالد در این صنف بشری آدمیزاد به وجود آمد، همچنین تناسل در جن با القای هوا در رحم ماده‌ی آنان رخ داد و ذریه و توالد در صنف جن به وجود آمد. و وجود آنان به واسطه قوس (قوس) است که ناری است. این‌گونه وارد (الوارد) که خداوند او را حفظ کند، ذکر کرده است.\n\n### [فاصله سال‌ها میان آفرینش جن و انسان]\n\nو میان آفرینش جن و آفرینش آدم شصت هزار سال فاصله بود. و بنا بر آنچه برخی می‌پندارند، می‌بایست توالد جن پس از انقضای چهار هزار سال قطع می‌شد و توالد بشر پس از انقضای هفت هزار سال پایان می‌یافت. اما امر بر این منوال واقع نشد، بلکه امر به خواست خداوند بازمی‌گردد. پس توالد در جن تا امروز باقی است و همچنین در ما. پس با این حساب دریابید که آدم چند سال عمر کرده است و چقدر تا پایان دنیا و فنای بشر از روی زمین و انتقالشان به سرای آخرت باقی مانده است. و این مذهب راسخین در علم نیست، بلکه گروهی اندک که سخنشان اعتباری ندارد، آن را گفته‌اند.\n\n### [جن برزخ میان فرشته و انسان]\n\nپس فرشتگان ارواحی هستند که در انوار دمیده شده‌اند، و جن ارواحی هستند که در بادها دمیده شده‌اند، و انسان‌ها ارواحی هستند که در کالبدها (أشباح) دمیده شده‌اند. و گفته می‌شود که از موجود اول جن، ماده‌ای جدا نشد، همان‌گونه که حوا از آدم جدا شد. برخی گفته‌اند که خداوند برای موجود اول جن، فرجی در خودش آفرید، پس با بخشی از خود نکاح کرد و فرزندانی مانند ذریه آدم، نر و ماده، به دنیا آورد. سپس برخی با برخی دیگر نکاح کردند. پس آفرینش او خنثی بود، و به همین دلیل جن از عالم برزخ (البرزخ) هستند؛ شباهتی به بشر و شباهتی به فرشتگان دارند، مانند خنثی که شبیه نر و شبیه ماده است. و ما در اخباری که روایت کرده‌ایم، از برخی ائمه دین روایت کرده‌ایم که مردی را دید که دو فرزند همراه داشت و او خنثی بود؛ یکی از پشتش و دیگری از شکمش متولد شده بود. نکاح کرد و برایش فرزند آمد و نکاح کرد و فرزند آورد. و خنثی از انخناث نامیده شده است که به معنای سستی و نرمی و فقدان قوت و شدت است. پس نه نیروی ذکوریت در او قوی شد که مذکر باشد و نه نیروی انوثیت در او قوی شد که مؤنث باشد، پس از این دو نیرو سست شد و خنثی نامیده شد. و خدا داناتر است.\n\n### [غذای جن و نکاح آنان]\n\nو چون عنصر هوا و آتش بر جن غلبه دارد، غذای آنان چیزی است که هوا از چربی موجود در استخوان‌ها حمل می‌کند؛ زیرا خداوند در آن برایشان روزی قرار داده است. ما مشاهده می‌کنیم که جوهر استخوان و گوشتی که بر آن است، چیزی از آن کم نمی‌شود، پس قطعاً دانستیم که خداوند در آن برایشان روزی قرار داده است. و به همین دلیل، پیامبر (صلی الله علیه و آله) در مورد استخوان‌ها فرمود: «آنها توشه برادران شما از جن هستند.» و در حدیثی دیگر آمده است: «خداوند در آن برایشان روزی قرار داده است.»\n\nو برخی از اهل کشف (المکاشفین) به من خبر داد که جن را دیده است که به سوی استخوان می‌آیند و آن را می‌بویند، همان‌گونه که درندگان می‌بویند، سپس بازمی‌گردند در حالی که روزی و غذای خود را از آن بوئیدن گرفته‌اند. پس منزه است خداوند لطیف آگاه (اللطیف الخبیر). و اما اجتماع برخی از آنان با برخی دیگر هنگام نکاح، به صورت درهم‌پیچیدگی است، مانند دود خروجی از کوره یا تنور سفالگری که برخی در برخی دیگر داخل می‌شوند، و هر یک از دو شخص از آن تداخل لذت می‌برد، و آنچه القا می‌کنند، مانند لقاح درخت خرما صرفاً با بو است، درست مانند غذایشان.\n\n### [قبایل و عشایر جن]\n\nو آنان قبایل و عشایری هستند. ذکر شده است که آنان در دوازده قبیله اصلی محصورند، سپس به شاخه‌های فرعی تقسیم می‌شوند. و میان آنان جنگ‌های عظیمی رخ می‌دهد، و برخی از گردبادها (الزوابع) ممکن است عین جنگ آنان باشد؛ زیرا گردباد ناشی از برخورد دو باد است که هر یک مانع نفوذ دیگری می‌شود، و این ممانعت به چرخش مشهود در غبار محسوس می‌انجامد که آثار آن ناشی از برخورد دو باد متضاد است. جنگ آنان نیز این‌گونه است. البته هر گردبادی جنگ آنان نیست. و داستان عمرو جنی که حمد خدا را گفت، مشهور و روایت شده است، و کشته شدن او در گردبادی که دیده شد و سپس از او کنار رفت، در حالی که در حال مرگ بود، و طولی نکشید که مرد. او بنده‌ای صالح از جن بود. اگر بنای این کتاب بر آوردن اخبار و حکایات بود، بخشی از آن را ذکر می‌کردیم، اما این کتاب، کتاب علم معانی است. پس حکایات آنان را در تاریخ‌های ادب و اشعارشان جستجو کنید.\n\n### [شکل‌پذیری عالم روحانی]\n\nسپس بازمی‌گردیم و می‌گوییم که این عالم روحانی (الروحاني) هنگامی که شکل می‌گیرد و در صورتی حسی ظاهر می‌شود، بصر آن را مقید می‌سازد، به طوری که تا زمانی که بصر به خاصیت خود به آن نگاه می‌کند، نمی‌تواند از آن صورت خارج شود. اما اگر انسان آن را مقید ساخت و پیوسته به آن نگاه کرد و روحانی جایی برای پنهان شدن نداشت، این روحانی صورتی را که بر خود قرار داده است، مانند پرده‌ای آشکار می‌سازد، سپس در خیال بیننده، حرکت آن صورت را به جهتی خاص می‌اندازد، و بصر بیننده آن را دنبال می‌کند. هنگامی که بصر آن را دنبال کرد، روحانی از قید خود خارج می‌شود و از نظر غایب می‌گردد. و با غیبت او، آن صورت نیز از دید بیننده‌ای که بصرش آن را دنبال کرده بود، زایل می‌شود؛ زیرا آن صورت برای روحانی مانند نوری است که از چراغ در زوایا منتشر می‌شود، پس اگر جسم چراغ غایب شود، آن نور نیز از بین می‌رود. این صورت نیز چنین است. پس کسی که این را می‌داند و می‌خواهد آن را مقید سازد، بصرش را دنبال آن صورت نمی‌فرستد. و این از اسرار الهی است که جز با تعریف خداوند شناخته نمی‌شود. و آن صورت، غیر از عین روحانی نیست، بلکه عین اوست، حتی اگر در هزار مکان یا در هر مکانی باشد و اشکال مختلف داشته باشد. و اگر کشتن صورتی از آن صور اتفاق افتد و در ظاهر امر بمیرد، آن روحانی از حیات دنیا به برزخ (البرزخ) منتقل می‌شود، همان‌گونه که ما با مرگ منتقل می‌شویم، و دیگر در عالم دنیا خبری از او باقی نمی‌ماند، درست مانند ما. و آن صور محسوس که روحانیات در آن ظاهر می‌شوند، اجساد نامیده می‌شوند، و این همان سخن خداوند متعال است: «و بر تخت او جسدی افکندیم (وَأَلْقَيْنَا عَلَى كُرْسِيِّهِ جَسَدًا)» و سخن او: «و ما آنان را جسدهایی قرار ندادیم که غذا نخورند (وَمَا جَعَلْنَاهُمْ جَسَدًا لَّا يَأْكُلُونَ الطَّعَامَ)». و تفاوت میان جن و فرشتگان، اگرچه در روحانیت مشترک هستند، این است که غذای جن چیزی است که اجسام طبیعی از خوردنی‌ها حمل می‌کنند، اما فرشتگان چنین نیستند. و به همین دلیل خداوند در داستان مهمانان ابراهیم خلیل (علیه السلام) ذکر کرد: «پس چون دید که دست‌هایشان به آن نمی‌رسد (فَلَمَّا رَأَى أَيْدِيَهُمْ لَا تَصِلُ إِلَيْهِ)، آنان را نشناخت»؛ یعنی به گوساله بریان‌شده دست نمی‌زنند و از آن نمی‌خورند، و ترسید.\n\n### [نشأت عالم جن]\n\nو هنگامی که زمان ایجاد عالم جن فرا رسید، سه تن از امنای فلک اول از فرشتگان متوجه شدند، سپس از نواب خود در آسمان دوم آنچه را که برای این نشأت نیاز داشتند، گرفتند، سپس به آسمان‌ها فرود آمدند و از نواب، دو تن از آسمان دوم و ششم را از آنجا گرفتند و به ارکان فرود آمدند و محل را آماده ساختند. و سه تن دیگر از امنا به دنبال آنان آمدند و از آسمان دوم آنچه را که از نوابشان نیاز داشتند، گرفتند، سپس به آسمان سوم و پنجم از آنجا فرود آمدند و دو فرشته را گرفتند و از آسمان ششم گذشتند و نائب دیگری از فرشتگان را گرفتند و به ارکان فرود آمدند تا تسویه را کامل کنند. سپس شش تن باقی‌مانده فرود آمدند و آنچه از نواب در آسمان دوم و در آسمان‌ها باقی مانده بود، گرفتند. پس همه با اذن خداوند دانا و حکیم (العلیم الحکیم) برای تسویه این نشأت گرد آمدند. هنگامی که نشأت او کامل شد و بنیه‌اش استوار گشت، روح از عالم امر (عالم الأمر) متوجه شد و در آن صورت دمیده شد، روحی که حیات با وجودش در آن جاری گشت. پس برخاست در حالی که به حمد و ثنای کسی که او را ایجاد کرده بود، ناطق بود، به فطرت و سرشتی که بر آن سرشته شده بود. و در نفس او عزت و عظمتی بود که سبب آن را نمی‌دانست و نمی‌دانست بر چه کسی به آن فخر کند، زیرا مخلوق دیگری از عالم طبایع جز او وجود نداشت. پس او به عبادت پروردگارش باقی ماند، بر عزتش اصرار ورزید و در برابر ربوبیت ایجادکننده‌اش متواضع بود، به واسطه آنچه که در نشأت او بر او عارض می‌شد، تا اینکه آدم آفریده شد. هنگامی که جن صورت آدم را دید، بر یکی از آنان که نامش حارث بود، بغض آن نشأت غلبه کرد و چهره‌اش از دیدن آن صورت آدمیزاد درهم کشیده شد. و این از او برای جنسش آشکار شد، پس او را به دلیل غم و اندوهی که به خاطر آن داشت، سرزنش کردند. هنگامی که امر آدم پیش آمد، حارث آنچه را که در نفس خود می‌یافت، آشکار ساخت و از امتثال امر خالقش به سجده بر آدم سر باز زد (أَبَى) و بر آدم به واسطه نشأت خود استکبار ورزید و به اصل خود افتخار کرد، و از سرّ قدرت آب که خداوند هر چیز زنده‌ای را از آن قرار داده است (وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ)، غافل ماند، در حالی که حیات جن نیز از آن بود و خود نمی‌دانستند.\n\n### [آفرینش آدم و نشأت انسان]\n\nو اگر از اهل فهم هستی، در سخن خداوند متعال تأمل کن: «و عرش او بر آب بود (وَكَانَ عَرْشُهُ عَلَى الْمَاءِ)». پس عرش و آنچه از مخلوقات در بر داشت، زنده شد، «و هیچ چیز نیست مگر اینکه با ستایش او تسبیح می‌گوید (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)». و خداوند نكره (شیء) آورده است، و جز موجود زنده تسبیح نمی‌گوید.\n\nدر حدیث حسن از رسول خدا (صلی الله علیه و آله) روایت شده است که فرشتگان در حدیثی طولانی گفتند: «پروردگارا، آیا چیزی سخت‌تر از آتش آفریده‌ای؟» فرمود: «بله، آب.» پس آب را قوی‌تر از آتش قرار داد. اگر عنصر هوا در نشأت جن مشتعل به آتش نبود، جن قوی‌تر از بنی‌آدم بود، زیرا هوا قوی‌تر از آب است. فرشتگان در این حدیث گفتند: «پروردگارا، آیا چیزی سخت‌تر از آب آفریده‌ای؟» فرمود: «بله، هوا.» سپس گفتند: «پروردگارا، آیا چیزی سخت‌تر از هوا آفریده‌ای؟» فرمود: «بله، فرزند آدم.»\n\nپس نشأت انسانی را قوی‌تر از هوا قرار داد و آب را قوی‌تر از آتش قرار داد، و آب عنصر اعظم در انسان است، همان‌گونه که آتش عنصر اعظم در جن است. و به همین دلیل در مورد شیطان فرمود: «همانا مکر شیطان ضعیف است (إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا)». پس هیچ قدرتی به او نسبت نداد. و در مورد سخن عزیز (پادشاه مصر) که فرمود: «همانا مکر شما بزرگ است (إِنَّ كَيْدَكُنَّ عَظِيمٌ)»، پاسخی نداد و آن را تکذیب نکرد، با وجود ضعف عقل زن نسبت به عقل مرد، زیرا زنان ناقص‌العقل هستند، پس گمانت در مورد قوت مرد چیست؟ و سبب این امر آن است که نشأت انسانی به دلیل غلبه دو عنصر آب و خاک بر مزاجش، در امور، وقار، تأمل، فکر و تدبیر می‌بخشد، پس عقلش کامل است، زیرا خاک او را ثابت و نگه می‌دارد و آب او را نرم و آسان می‌سازد. اما جن چنین نیست، زیرا عقلش آن ثباتی را که عقل انسان دارد، ندارد. و به همین دلیل گفته می‌شود فلان شخص سبک‌عقل و سخیف‌العقل است، یعنی ضعیف‌الرأی و بی‌تجربه است. و این صفت جن است، و به واسطه همین سبک‌عقلی و عدم ثبات در نظرش، از راه هدایت گمراه شد و گفت: «من از او بهترم (أَنَا خَيْرٌ مِنْهُ)». پس به دلیل سبکی‌اش، جهل و سوء ادب را با هم جمع کرد.\n\n### [شیطان اول از جن]\n\nپس هر کس از جن که عصیان کرد، شیطان (شیطان) بود، یعنی رانده‌شده از رحمت حق. و اولین کسی که از جن شیطان نامیده شد، حارث بود. پس خداوند او را ابلیس (أبلسه) کرد، یعنی او را از رحمت خود راند و رحمت را از او دور ساخت. و شیاطین همگی از او منشعب شدند. پس هر کس از آنان ایمان آورد، مانند هامة بن إلهام بن لاقیس بن ابلیس، به مؤمنان جن ملحق شد، و هر کس بر کفر خود باقی ماند، شیطان بود. و این مسئله‌ای اختلافی میان علمای شریعت است. برخی گفته‌اند که شیطان هرگز مسلمان نمی‌شود. و سخن پیامبر (صلی الله علیه و آله) در مورد شیطانش که قرین موکل بر او بود، را تأویل کردند: «خداوند مرا بر او یاری داد، پس او اسلام آورد (فأسلم).»\n\nاین حدیث با رفع میم (فأسلَمُ) و فتح میم (فأسلَمَ) نیز روایت شده است. پس این قائل، رفع را چنین تأویل کرد که معنای آن «از او در امان هستم» است، یعنی او بر من راهی ندارد. و مخالف نیز آن را چنین تأویل کرد. و فتح را به معنای انقیاد تأویل کرد و گفت: معنایش این است که با وجود دشمن بودن، منقاد شد و او به ذات خود مرا جز به خیر امر نمی‌کند، به جبر الهی و عصمت برای رسول خدا (صلی الله علیه و آله). و مخالف گفت: معنای «فأسلم» با فتح، یعنی ایمان آورد به خدا، همان‌گونه که کافر نزد ما مسلمان می‌شود و مؤمن بازمی‌گردد، و این اولی و صحیح‌تر است.\n\n### [ابلیس اولین شقی از جن]\n\nو بیشتر مردم گمان می‌کنند که او اولین جن است، به منزله آدم در میان انسان‌ها، اما نزد ما چنین نیست، بلکه او یکی از جن است. و اولین فرد در میان آنان، به منزله آدم در میان بشر، شخص دیگری است. و به همین دلیل خداوند متعال فرمود: «مگر ابلیس که از جن بود (إِلَّا إِبْلِيسَ كَانَ مِنَ الْجِنِّ)»؛ یعنی از این صنف از مخلوقات بود، همان‌گونه که قابیل از بشر بود. و خداوند او را شقی نوشت، پس او اولین شقی از بشر است، و ابلیس اولین شقی از جن است. و عذاب شیاطین جن در جهنم بیشتر با زمهرير (سرمای شدید) است، نه با حرور (گرمای شدید). البته گاهی نیز با آتش عذاب می‌شوند. و بنی‌آدم بیشتر عذابشان با آتش است. روزی بر یکی از اولیای مجذوب (مخبول العقل) ایستادم، در حالی که چشمانش اشک می‌ریخت و به مردم می‌گفت: به سخن خداوند متعال که به ابلیس فرمود: «جهنم را از تو پر خواهم کرد (لَأَمْلَأَنَّ جَهَنَّمَ مِنْكَ)» اکتفا نکنید، بلکه به اشاره خداوند سبحان به شما در سخنش به ابلیس: «جهنم را از تو (مِنْكَ)» بنگرید. زیرا او از آتش آفریده شده است، پس لعنت خدا بر او باد، به اصل خود بازمی‌گردد. و اگر با آن عذاب شود، عذاب سفالگر با آتش شدیدتر است. پس برحذر باشید. این ولی، از ذکر جهنم فقط آتش را در نظر داشت و غافل بود از اینکه جهنم نامی است برای حرور و زمهرير آن، و در مجموع جهنم نامیده شده است، زیرا منظری ناخوشایند دارد. و جهام (الجهام) ابری است که آب خود را ریخته است، و باران رحمت خداست. پس هنگامی که خداوند باران را با فرود آوردن از ابر زایل کرد، نام جهام بر آن نهاد، به دلیل زوال رحمتی که همان باران است از آن. همچنین رحمت از جهنم زایل شده است، پس منظری و خبری ناخوشایند دارد. و همچنین جهنم نامیده شده است به دلیل دوری عمق آن. گفته می‌شود چاهی جهنام است، اگر عمیق باشد. از خداوند بزرگ برای خود و مؤمنان، ایمنی از آن را مسئلت داریم. و این مقدار از این باب کافی است."
  },
  "page_count": 4
}