{
  "id": 556,
  "title": {
    "ar": "الباب السادس والخمسون وخمسمائة في معرفة حال قطب كان منزله تَبارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وهو من أشياخنا درج سنة تسع وثمانين وخمسمائة رحمه الله",
    "en": "Chapter Five Hundred and Fifty-Six: Concerning the knowledge of the state of a Pole (قطب) whose station was [the verse] <<Blessed is He in Whose Hand is the Dominion>> (Quran 67:1), and who was one of our Shaykhs, who passed away in the year 589 AH, may Allah have mercy upon him.",
    "ur": "باب پانچ سو چھپن: ایک قطب (قطب) کے حال کی معرفت (المعرفۃ) کے بیان میں، جس کا روحانی مقام (منزل) یہ تھا: \"بڑی برکت والا ہے وہ جس کے ہاتھ میں بادشاہی (الملک) ہے\" (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ)، اور وہ ہمارے شیوخ میں سے تھے، جن کا وصال ۵۸۹ھ میں ہوا، اللہ ان پر رحم فرمائے۔",
    "fa": "باب پانصد و شصتم در معرفت حال قطبی که منزل او «تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ» (بزرگوار است آنکه فرمانروایی به دست اوست) بود و او از مشایخ ما بود که در سال پانصد و هشتاد و نه درگذشت، خداوند او را رحمت کند."
  },
  "content": {
    "ar": "## «الباب السادس والخمسون وخمسمائة في معرفة حال قطب كان منزله تَبارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وهو من أشياخنا درج سنة تسع وثمانين وخمسمائة رحمه الله»\n\n\n> تبارك الملك وللإمام *** بالكشف والحال والمقام‏\n\n\n> وهو الذي لا يزال ملكا *** في كل حال على الدوام‏\n\n\n> له الكمال الذي تراه *** في كونه أعين الأنام‏\n\n\n> له الكمال الذي تراه *** يزيد قدرا على التمام‏\n\n\n> مرتبا للأمور كشفا *** في عالم النور والظلام‏\n\n\n> يشهد في الانتباه عينا *** عين الذي كان في المنام‏\n\n\n> نسأله في الكلام وحيا *** فجاد بالوحي في الكلام‏\n\n\n### [إن الناس على مراتب مختلفة]\n\n\nكان هذا الهجير والمقام لشيخنا أبي مدين وكان يقول أبدا سورتي من القرآن تبارك الذي بيده الملك وهي مختصة بالإمام الواحد من الإمامين ولها الزيادة دائما في الدنيا والآخرة فإنها مختصة بالملك والزيادة إنما تكون من الملك فإذا تكررت تضاعف على الذاكر ما ينعم الله به على عبده والناس على مراتب مختلفة وتكون زياداتهم على حسب مراتبهم بما هم فيه فمن كان من أهل المعاني كانت الزيادة من المعاني ومن كان من أهل الحس كانت زيادته من المحسوسات قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ فلو أعطى في المزيد خلاف ما تعطيه مرتبته لم يقم به رأسا فينسب إلى سوء الأدب وإذا وافق رتبته وقع به الفرح منه والقبول وزاد في الشكر فتضاعف له المزيد\n\n\nواعلم أن هذا الذاكر بهذا الذكر الخاص لا بد أن ينقدح له أن عينيه يد الحق الذي بها الملك فيرى الحق يعطي به من لا يرى أنه يده فيكون الحق مشكورا عند المنعم عليهم من جهة هذا الذاكر فيجني ثمرة نعيم كل منعم عليه فيشركهم في كل نعيم ينالونه من أي نوع كان من الإنعام وهذا لا يكون إلا لمن كمل من رجال الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 556: Concerning the Knowledge of the State of a Pole (قطب) whose Station (منزله) was <<Blessed is He in Whose Hand is the Sovereignty>>, and who was one of our Shaykhs, passing away in the year 589 AH, may Allah have mercy on him.\n\nBlessed is the Sovereign (الملك), and for the Imam (الإمام)\nThrough Unveiling (الكشف), the Spiritual State (الحال), and the Station (المقام).\n\nAnd He is the One Who remains a Sovereign\nIn every state, perpetually.\n\nHis is the Perfection (الكمال) that you see\nIn His Being the very essences of mankind.\n\nHis is the Perfection that you see\nIncreasing in worth beyond completion.\n\nArranging all affairs through Unveiling\nIn the world of Light and Darkness.\n\nHe witnesses in wakefulness, precisely\nThe very thing that was seen in the dream.\n\nWe ask Him for revelation (وحي) in speech,\nAnd He bestowed revelation through speech.\n\n### [People are on Different Levels]\n\nThis spiritual journey (الهجير) and station (المقام) belonged to our Shaykh, Abu Madyan. He would always say, \"My Surah from the Quran is <<Blessed is He in Whose Hand is the Sovereignty>>,\" and it is specific to the single Imam (الإمام) among the two Imams. For it is the increase (الزيادة) always, in this world and the Hereafter, for it is specific to Sovereignty (الملك).\n\nThe increase only comes from the Sovereign. When it is repeated, what Allah bestows upon His servant is multiplied for the one who remembers (الذاكر). People are upon different Levels (مراتب), and their increases are according to their Levels in what they are engaged in. So, whoever belongs to the people of Meanings (المعاني), the increase is from Meanings; and whoever belongs to the people of the Senses (الحس), his increase is from the sensible things (المحسوسات). <<Every group of people has certainly known its drinking place.>> (Quran 2:60). If he were given an increase contrary to what his Level grants him, he would not be able to sustain it at all, and he would be attributed with bad manners (سوء الأدب). But if it corresponds to his Level, joy and acceptance result from it, and he increases in gratitude (الشكر), so the increase is multiplied for him.\n\nKnow that this one who remembers with this specific remembrance (ذكر) must have it flash into his mind that his two eyes are the Hand of The Real (يد الحق) through which is the Sovereignty. So he sees The Real (الحق) giving through him to those who do not see that he is His Hand. Thus, The Real is thanked by those upon whom grace is bestowed, through the agency of this rememberer. He therefore reaps the fruit of the bliss of every recipient of grace, sharing with them in every bliss they attain, of whatever type the bestowal of grace may be. And this does not occur except for those among the Men of Allah who have reached perfection (كمل). <<And Allah speaks the Truth, and He guides to the Way.>> (Quran 33:4).",
    "ur": "باب ۵۵۶: اس قطب کے حال کی معرفت میں جس کی منزل \"تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ\" (بڑی برکت والا ہے وہ جس کے ہاتھ میں بادشاہی ہے) تھی، اور وہ ہمارے شیوخ میں سے تھے جو ۵۸۹ھ میں وفات پا گئے، اللہ ان پر رحم فرمائے۔\n\nبڑی برکت والا ہے بادشاہ، اور امام کے لیے ہے (یہ برکت) کشف (الکشف)، حال (الحال)، اور مقام (المقام) کے ذریعے۔\n\nاور وہ (امام) ہی ہے جو ہر حال میں ہمیشہ بادشاہ رہتا ہے۔\n\nاس کے لیے وہ کمال ہے جسے تم مخلوق کی آنکھیں ہونے میں دیکھتے ہو۔\n\nاس کے لیے وہ کمال ہے جسے تم دیکھتے ہو، جو قدر و منزلت میں تمام (کمال) سے بڑھ جاتا ہے۔\n\nوہ نور اور تاریکی کے عالم میں کشف (الکشف) کے ذریعے معاملات کو ترتیب دینے والا ہے۔\n\nوہ بیداری میں بعینہٖ اس چیز کا مشاہدہ (الشہود) کرتا ہے جو خواب میں تھی۔\n\nہم اس سے کلام میں وحی کا سوال کرتے ہیں، تو وہ کلام میں وحی کے ساتھ سخاوت کرتا ہے۔\n\n***\n\n### [بے شک لوگ مختلف مراتب پر ہیں]\n\nیہ ہجیر (دوپہر کی عبادت) اور مقام (المقام) ہمارے شیخ ابو مدین کا تھا، اور وہ ہمیشہ قرآن کی سورۃ \"تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ\" (بڑی برکت والا ہے وہ جس کے ہاتھ میں بادشاہی ہے) پڑھا کرتے تھے۔ یہ سورت دو اماموں میں سے ایک امام کے ساتھ خاص ہے، اور اس کے لیے دنیا اور آخرت میں ہمیشہ اضافہ (الزیادۃ) ہے۔ کیونکہ یہ بادشاہی (الملک) کے ساتھ خاص ہے، اور اضافہ صرف بادشاہ کی طرف سے ہوتا ہے۔ جب یہ (ذکر) دہرایا جاتا ہے تو ذاکر پر وہ نعمتیں دوگنی ہو جاتی ہیں جو اللہ اپنے بندے پر نازل کرتا ہے۔\n\nاور لوگ مختلف مراتب (المراتب) پر ہیں، اور ان کے اضافے ان کے مراتب کے مطابق ہوتے ہیں جن میں وہ ہیں۔ پس جو شخص اہل معانی (المعانی) میں سے ہو، اس کا اضافہ معانی کی طرف سے ہوتا ہے، اور جو اہل حس (الحس) میں سے ہو، اس کا اضافہ محسوسات کی طرف سے ہوتا ہے۔ (قرآن: البقرۃ ۶۰) \"قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ\" (ہر گروہ نے اپنا گھاٹ جان لیا)۔ پس اگر اسے اس کے مرتبے کے خلاف کوئی اضافی چیز دی جائے تو وہ اسے بالکل قبول نہیں کر پائے گا اور اسے سوءِ ادب سے منسوب کیا جائے گا۔ اور جب وہ (اضافہ) اس کے مرتبے کے موافق ہوتا ہے تو اسے اس سے خوشی اور قبولیت حاصل ہوتی ہے، اور وہ شکر میں اضافہ کرتا ہے، تو اس کے لیے مزید اضافہ دوگنا ہو جاتا ہے۔\n\nاور جان لو کہ اس خاص ذکر کو کرنے والے ذاکر کے لیے یہ بات ضرور منکشف ہوتی ہے کہ اس کی دونوں آنکھیں ذات حق (الحق) کا ہاتھ ہیں جس کے ذریعے بادشاہی (الملک) قائم ہے۔ پس وہ ذات حق (الحق) کو دیکھتا ہے کہ وہ اس کے ذریعے ان لوگوں کو عطا کرتا ہے جو یہ نہیں دیکھتے کہ یہ اس کا ہاتھ ہے۔ چنانچہ ذات حق (الحق) انعام پانے والوں کے نزدیک اس ذاکر کی طرف سے شکر گزار ٹھہرتا ہے۔ پس وہ ہر انعام پانے والے کی نعمت کا پھل حاصل کرتا ہے، اور وہ ہر قسم کی نعمت میں ان کے ساتھ شریک ہو جاتا ہے جو انہیں حاصل ہوتی ہے۔\n\nاور یہ صرف ان لوگوں کو حاصل ہوتا ہے جو رجال اللہ (اللہ کے بندوں) میں سے کامل (الکامل) ہو چکے ہوں۔ اور اللہ (قرآن: الاحزاب ۴) \"يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے)۔",
    "fa": "باب پانصد و شصت و ششم در شناخت حال قطبی که منزل او [آیه] «تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ» (بزرگوار است آنکه فرمانروایی به دست اوست - سوره ملک، آیه ۱) بود، و او از مشایخ ما بود که در سال پانصد و هشتاد و نه هجری درگذشت، رحمت خدا بر او باد.\n\nپادشاهی مبارک است، و برای امام (قطب) است\nبه واسطه کشف (الکشف)، حال و مقام (المقام).\n\nو او کسی است که پیوسته پادشاه است\nدر هر حال و به طور دائم.\n\nکمالی از آن اوست که آن را می‌بینی\nدر هستی او که دیدگان مردمان است.\n\nکمالی از آن اوست که آن را می‌بینی\nکه از نظر قدر بر تمامیت فزونی می‌گیرد.\n\nامور را به صورت کشفی (الکشف) مرتب می‌کند\nدر عالم نور و ظلمت.\n\nدر بیداری به عین (حقیقت) شهود می‌کند\nهمان عینی که در خواب بود.\n\nدر سخن از او وحی می‌طلبیم\nپس او با وحی در کلام سخاوت ورزید.\n\n***\n\n### [مردم بر مراتب مختلفی هستند]\n\nاین هجیر (مقام و منزل) و این مقام (المقام) از آن شیخ ما ابومدین بود. او همیشه می‌گفت که سوره من از قرآن «تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ» (بزرگوار است آنکه فرمانروایی به دست اوست) است. این سوره مختص به امام واحد از میان دو امام است و همیشه در دنیا و آخرت برای او فزونی (الزیادة) دارد، زیرا این سوره مختص به ملک (فرمانروایی) است و فزونی تنها از ملک حاصل می‌شود. اگر این ذکر تکرار شود، آنچه خداوند بر بنده خود انعام می‌کند، برای ذاکر مضاعف می‌گردد. مردم بر مراتب مختلفی هستند و فزونی‌هایشان بر حسب مراتبشان و آنچه در آن هستند، می‌باشد. پس هر کس از اهل معانی باشد، فزونی‌اش از معانی خواهد بود، و هر کس از اهل حس باشد، فزونی‌اش از محسوسات خواهد بود. «قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ» (هر گروهی آبشخور خود را دانستند - سوره بقره، آیه ۶۰). پس اگر در فزونی چیزی به او داده شود که مخالف مرتبه‌اش باشد، هرگز آن را برنمی‌تابد و به سوء ادب نسبت داده می‌شود. اما اگر با رتبه‌اش موافق باشد، شادی و قبول از او حاصل می‌شود و شکرش افزون می‌گردد، در نتیجه فزونی برای او مضاعف می‌شود.\n\nو بدان که برای این ذاکر با این ذکر خاص، ناگزیر باید این امر منکشف شود که دو چشم او دست حق (الحق) است که ملک (فرمانروایی) به واسطه آن است. پس حق (الحق) را می‌بیند که به واسطه آن به کسی عطا می‌کند که نمی‌بیند آن دست اوست. در نتیجه، حق (الحق) از جهت این ذاکر نزد کسانی که به آن‌ها انعام شده، مورد شکر قرار می‌گیرد. پس او ثمره نعمت هر کسی را که به او انعام شده است، می‌چیند و در هر نعمتی که از هر نوعی از انعام به آنان می‌رسد، با ایشان شریک می‌شود. و این جز برای کسی که از رجال الله (مردان خدا) کامل شده باشد، حاصل نمی‌شود. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند - سوره احزاب، آیه ۴)."
  },
  "page_count": 1
}