{
  "id": 337,
  "title": {
    "ar": "الباب السابع والثلاثون وثلاثمائة في معرفة منزل محمد صَلَّى اللهُ عَليهِ وسَلَّم مع بعض العالم وهو من الحضرة الموسوية",
    "en": "Chapter Three Hundred and Thirty-Seven: Concerning the Gnosis (معرفة) of the Station (منزل) of Muhammad (peace and blessings be upon him) in Relation to a Part of the Cosmos (العالم), which is from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب تین سو سینتیسواں: محمد صلی اللہ علیہ وسلم کی عالم کے ایک جزو کے ساتھ منزلت (مقام) کی معرفت (المعرفۃ) کے بیان میں، اور یہ (منزلت) حضرت موسویہ (الحضرة الموسوية) سے ہے۔",
    "fa": "باب سیصد و سی و هفتم در معرفت منزل محمد (صَلَّى اللهُ عَليهِ وسَلَّم) با بخشی از عالم، و آن از حضرت موسوی است."
  },
  "content": {
    "ar": "## «الباب السابع والثلاثون وثلاثمائة في معرفة منزل محمد صَلَّى اللهُ عَليهِ وسَلَّم مع بعض العالم وهو من الحضرة الموسوية»\n> ألا لله ما الأكوان فيه *** من أحكام التناقض في الوجود\n\n\n> فمنهم طائع عاص عليم *** جهول بالنزول وبالصعود\n\n\n> ومنهم من تحقق في غيوب *** ومنهم من تحقق في الشهود\n\n\n> فتظهر كثرة والعين منها *** وحيد بالدلائل والعقود\n\n\n> فسبحان المراد بكل نعت *** من أوصاف الألوهة والعبيد\n\n\n> وسبحان المحيط بكل شي‏ء *** ويوصف في المعارف بالمزيد\n\n\n### [الرؤية يوم الزور العام الأعظم‏]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنا سيد الناس يوم القيامة وعلل ذلك بكماله وقال لو كان موسى حيا ما وسعه إلا أن يتبعني‏\n\n\nلعموم رسالته وشمول شريعته فخص صَلَّى اللهُ عَليهِ وسَلَّم بأشياء لم تعط لنبي قبله وما خص نبي بشي‏ء إلا وكان لمحمد صَلَّى اللهُ عَليهِ وسَلَّم فإنه أوتي جوامع الكلم وقال كنت نبيا وآدم بين الطين والماء\n\n\nوغيره من الأنبياء لم يكن نبيا إلا في حال نبوته وزمان رسالته فلنذكر في هذا الباب منزله ومنزلته فالمنزل يظهر في بساط الحق ومقعد الصدق عند التجلي والرؤية يوم الزور العام الأعظم فيعلم منزله بالبصر والشهود وأما منزلته فهي منزلة في نفس الحق ومرتبة منه ولا يعلم ذلك إلا بإعلام الله وله المقام المحمود وهو فتح باب الشفاعة للملائكة فمن دونهم وله الأولية في الشفاعة وله الوسيلة وليس في المنازل أعلى منها ينالها محمد صَلَّى اللهُ عَليهِ وسَلَّم بسؤال أمته جزاء لما نالوه من السعادة به حيث أبان لهم طريقها فاتبعوه‏\n\n\n### [أعمال الأشقياء مجسدة وأعمال السعداء كذلك‏]\n\n\nواعلم أن هذا المنزل من يدخله يرى فيه عجائب لا يراها في غيره فمن ذلك أنه يرى أعمال الأشقياء مجسدة وأعمال السعداء كذلك مجسدة صورا قائمة تعقل وجود خالقها وقد جعل الله في نفوس هذه الصور طلبا على الأسباب التي وجدت عنها وهم العاملون ويجدون في طلبهم فأما أعمال السعداء فيرون على أيمانهم طريقا يسلكونها فتأخذ بهم تلك الطريق إلى مشاهدة أصحابهم وهم السعداء فيميز بعضهم بعضا ويتساءلون ويتخذونهم العاملون مراكب فوز ونجاة تحملهم إلى مستقر الرحمة وأما أعمال الأشقياء فتقوم لهم طرق متعددة متشعبة متداخلة بعضها في بعض لا يعرفون أي طريق تمشي بهم إلى أصحابهم فيحارون ولا يهتدون وهذا من رحمة الله بالأشقياء فإذا حارت أعمالهم رجعت إلى الله بالعبادة والذكر ويتفرقون في تلك الطرق فمنهم من لا يهتدي إلى صاحبه أبد الآبدين ومنهم من يصل إلى صاحبه فيشاهده ويتعرف إليه فيعرفه ويكون وجوده إياه مصادفة فيتعلق به ويقول له احملني فقد أتعبتنى في طلبك فيجبر العامل على حمله إلى أن تناله الرحمة رحمة الله وإلى جانب موقف هذه الصور طريقان واضحان طريق يكون غايته الحق الوجود وطريق لا غاية له فإنه يخرج السالك إلى العدم فلا يقف عند غايته فيه إذ العدم لا ينضبط بحد فيتقيد به بخلاف الحق الوجود فإنه يتقيد وإن كان مطلقا فإطلاقه تقييد في نفس الأمر فإنه متميز بإطلاقه عن الوجود المقيد فهو مقيد في عين إطلاقه وطريق ثالث بين هذين الطريقين برزخي لا تتصف غايته بالوجود ولا بالعدم مثل الأحوال في علم المتكلمين فأما الطريق التي يكون غايتها الوجود الحق فيسلك عليها الموحدون والمؤمنون والمشركون والكافرون وجميع أصحاب العقائد الوجودية وأما الطريق الأخرى فلا يسلك عليها إلا المعطلة فلا ينتهي بهم إلى غاية وأما الطريق البرزخى فلا يسلك فيه إلا العلماء بالله خاصة الذين أثبتهم الحق ومحاهم في عين إثباتهم وأبقاهم في حال فنائهم فهم الذين لا يموتون ولا يحيون إلى أن يقضي الله بين العباد فيأخذون ذات اليمين إلى طريق الوجود الحق وقد اكتسبوا من حقيقة تلك الطريق صفة واكتسبوا منها هيأة تظهر عليهم في منزل الوجود الحق يعرفون بها بعضهم بعضا ولا يعرفهم بها أحد من أهل الطريقين وهذا ضرب مثل ضربه الله لأهل الله ليقفوا منه على مراتب الهدى والحيرة والمهتدين والضالين وجعل الله لهم نورا بل أنوارا يهتدون بها في ظلمات بر طبيعتهم وفي ظلمات بحر أفكارهم وفي ظلمات نفوسهم الناطقة برها وبحرها بما هي عليه في نشأتها إذ كانت متولدة بين النور الخالص والطبيعة المحضة العنصرية الصرفية وتلك الأنوار المجعولة فيهم من الأسماء الإلهية فمن كان عارفا بها وناظرا بها من حيث ما وجدت له وصل بها إلى العلم بالأمور والكشف ومن أخذها أنوارا لا يعلم أنها بالوضع للاهتداء وجعلها زينة كما تراها العامة في‏\nكواكب السماء زينة خاصة لم يحصل له منها غير ما رأى ويراها العلماء بمنازلها وسيرها وسياحتها في أفلاكها موضوعة للاهتداء بها فاتخذوها علامات على ما يبتغونه في سيرهم على الطرق الموصلة إلى ما دعاهم الحق إليه من العلم به أو إلى السعادة التي هي الفوز خاصة\n\n\n### [أن الله جعل منزل محمد صَلَّى اللهُ عَليهِ وسَلَّم السيادة]\n\n\nواعلم أن الله لما جعل منزل محمد صَلَّى اللهُ عَليهِ وسَلَّم السيادة فكان سيدا ومن سواه سوقة علمنا أنه لا يقاوم فإن السوقة لا تقاوم ملوكها فله منزل خاص وللسوقة منزل ولما أعطى هذه المنزلة وآدم بين الماء والطين علمنا أنه الممد لكل إنسان كامل منعوت بناموس إلهي أو حكمي وأول ما ظهر من ذلك في آدم حيث جعله الله خليفة عن محمد صَلَّى اللهُ عَليهِ وسَلَّم فأمده بالأسماء كلها من مقام جوامع الكلم التي لمحمد صَلَّى اللهُ عَليهِ وسَلَّم فظهر بعلم الأسماء كلها على من اعترض على الله في وجوده ورجح نفسه عليه ثم توالت الخلائف في الأرض إلى أن وصل زمان وجود صورة جسمه لإظهار حكم منزلته باجتماع نشأتيه فلما برز كان كالشمس اندرج في نوره كل نور فاقرة من شرائعه التي وجه بها نوابه ما أقر ونسخ منها ما نسخ وطهرت عنايته بأمته لحضوره وظهوره فيها وإن كان العالم الإنساني والناري كله أمته ولكن لهؤلاء خصوص وصف فجعلهم خير أمة أخرجت للناس هذا الفضل أعطاه ظهوره بنشأتيه فكان من فضل هذه الأمة على الأمم إن أنزلها منزلة خلفائه في العالم قبل ظهوره إذ كان أعطاهم التشريع فأعطى هذه الأمة الاجتهاد في نصب الأحكام وأمرهم أن يحكموا بما أداهم إليه اجتهادهم‏\n\n\nفأعطاهم التشريع فلحقوا بمقامات الأنبياء عليه السلام في ذلك وجعلهم ورثة لهم لتقدمهم عليهم فإن المتأخر يرث المتقدم بالضرورة فيدعون إلى الله على بصيرة كما دعا الرسل محمد صَلَّى اللهُ عَليهِ وسَلَّم فأخبر بعصمتهم فيما يدعون إليه فمنهم المخطئ حكم غيره من المجتهدين ما هو مخطئ عن الحق فإن الذي جاء به حق فإن أخطأ حكما قد تقدم الحكم به لمحمد صَلَّى اللهُ عَليهِ وسَلَّم وما وصل إليه فذلك الذي جعل له أجرا واحدا وهو أجر الاجتهاد وإن أصاب الحكم المتقدم باجتهاده فله أجران أجر الاجتهاد وأجر الإصابة وإن كان المصيب مجهول العين في المجتهدين عند نفسه وعند غيره فليس بمجهول عند الله وكل من دخل في زمان هذه الأمة بعد ظهور محمد صَلَّى اللهُ عَليهِ وسَلَّم من الأنبياء والخلفاء الأول فإنهم لا يحكمون في العالم إلا بما شرع محمد صَلَّى اللهُ عَليهِ وسَلَّم في هذه الأمة وتميز في المجتهدين وصار في حزبهم مع إبقاء منزلة الخلافة الأولى عليه فله حكمان يظهر بذلك في القيامة ما له ظهور بذلك هنا ومنزل محمد صَلَّى اللهُ عَليهِ وسَلَّم يوم الزور الأعظم على يمين الرحمن من حيث الصورة التي يتجلى فيها على عرشه ومنزله يوم القيامة ليس على يمين الرحمن لكن بين يدي الحكم العدل لتنفيذ الأوامر الإلهية والأحكام في العالم فالكل عنه يأخذ في ذلك الموطن وهو وجه كله يرى من جميع جهاته وله من كل جانب إعلام عن الله تعالى يفهم عنه يرونه لسانا ويسمعونه صوتا وحرفا ومنزلته في الجنان الوسيلة التي تتفرع جميع الجنات منها وهي في جنة عدن دار المقامة ولها شعبة في كل جنة من تلك الجنات من تلك الشعبة يظهر صَلَّى اللهُ عَليهِ وسَلَّم لأهل تلك الجنة وهي في كل جنة أعظم منزلة فيها وهذه منازل كلها حسية لا معنوية وليست المعنوية إلا منزلته في نفس موجدة وهو الله تعالى وما هذا خاص به بل كل منزلة لا تكون إلا في نفس الله الذي هو الرحمن والمنازل محسوسة محصورة التي هي جمع منزل لا جمع منزلة فاعلم ذلك فإنه من لباب المعرفة بالله تعالى وتقدس في ذاته وأما منزلته في العلوم فالإحاطة بعلم كل عالم بالله من العلماء به تعالى متقدميهم ومتأخريهم وكل منزل له ولأتباعه مطيب بالطيب الإلهي الذي لم يدخل فيه ولا استعملت أيدي الأكوان فيه‏\n\n\n### [أنه من كمال محمد صَلَّى اللهُ عَليهِ وسَلَّم خص بستة لم تكن لنبي قبله‏]\n\n\nواعلم أنه من كماله صَلَّى اللهُ عَليهِ وسَلَّم أنه خص بستة لم تكن لنبي قبله والستة أكمل الأعداد وليس في الأشكال شكل فيه زوايا إذا انضمت إليها الأمثال لم يكن بينها خلو إلا الستة وبها أوحى الله إلى النحل في قوله أَنِ اتَّخِذِي من الْجِبالِ بُيُوتاً ومن الشَّجَرِ ومِمَّا يَعْرِشُونَ وأوحى إليها صفة عملها فعملتها مسدسة فأخبر أنه أعطى مفاتيح الخزائن وهي خزائن أجناس العالم ليخرج إليهم بقدر ما يطلبونه بذواتهم إذا علمنا أنه السيد ومن اعتبر تعيين الخزائن بالأرض فليس في الأرض إلا خزائن المعادن والنبات لا غير فإن الحيوان من حيث نموه نبات قال تعالى والله أَنْبَتَكُمْ من الْأَرْضِ نَباتاً فأخبرنا إنا من جملة نبات الأرض وما أعطيها صَلَّى اللهُ عَليهِ وسَلَّم حتى كان فيه الوصف الذي يستحقها به ولهذا طلبها يوسف عليه السلام من الملك صاحب مصر أن يجعله على خزائن الأرض لأنه حفيظ عليم ليفتقر الكل إليه فتصح سيادته عليهم ولهذا أخبر بالصفة التي يستحق من‏\nقامت به هذا المقام فقال إِنِّي حَفِيظٌ عَلِيمٌ حفيظ عليها فلا نخرج منها إلا بقدر معلوم كما إن الله سبحانه يقول وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ فإذا كانت هذه الصفة فيمن كانت ملك مقاليدها ثم قال بعد قوله حَفِيظٌ عَلِيمٌ أخبر أنه عالم بحاجة المحتاجين لما في هذه الخزائن التي خزن فيها ما به قوامهم عليم بقدر الحاجة فلما أعطى صَلَّى اللهُ عَليهِ وسَلَّم مفاتيح خزائن الأرض علمنا أنه حفيظ عليم فكل ما ظهر من رزق في العالم فإن الاسم الإلهي لا يعطيه إلا عن أمر محمد صَلَّى اللهُ عَليهِ وسَلَّم الذي بيده المفاتيح كما اختص الحق تعالى بمفاتيح الغيب فلا يعلمها إلا هو وأعطى هذا السيد منزلة الاختصاص بإعطائه مفاتيح الخزائن والخصلة الثانية أوتي جوامع الكلم والكلم جمع كلمة وكلمات الله لا تنفد فأعطى علم ما لا يتناهى فعلم ما يتناهى بما حصره الوجود وعلم ما لم يدخل في الوجود وهو غير متناه فأحاط علما بحقائق المعلومات وهي صفة إلهية لم تكن لغيره فالكلمة منه كلمات كالأمر الإلهي الذي هو كلمة واحدة كَلَمْحٍ بِالْبَصَرِ وليس في التشبيه الحسي أعظم ولا أحق تشبيها به من اللمح بالبصر ولما علم بجوامع الكلم أعطى الإعجاز بالقرآن الذي هو كلمة الله وهو المترجم به عن الله فوقع الإعجاز في الترجمة التي هي له فإن المعاني المجردة عن المواد لا يتصور الإعجاز بها وإنما الإعجاز ربط هذه المعاني بصور الكلم القائم من نظم الحروف فهو لسان الحق وسمعه وبصره وهو أعلى المراتب الإلهية وينزل عنها من كان الحق سمعه وبصره ولسانه فيكون مترجما عن عبده كما ترجم تعالى لنا في القرآن أحوال من قبلنا وما قالوه فما فيه ذلك الشرف فإنه يترجم عن أهله والمقربين لديه كالملائكة فيما قالوه ويترجم عن إبليس مع إبلاسه وشيطنته وبعده بما قاله ولا يترجم عن الله إلا من له الاختصاص الذي لا اختصاص فوقه والخصلة الثالثة بعثته إلى الناس كافة من الكفت وهو الضم أَ لَمْ نَجْعَلِ الْأَرْضَ كِفاتاً أي تضم الأحياء على ظهرها والأموات في بطنها كذلك ضمت شريعته جميع الناس فلا يسمع به أحد إلا لزمه الايمان به ولما سمع الجن القرآن يتلى قالوا لقومهم يا قَوْمَنا أَجِيبُوا داعِيَ الله وآمِنُوا به يَغْفِرْ لَكُمْ من ذُنُوبِكُمْ ويُجِرْكُمْ من عَذابٍ أَلِيمٍ ومن لا يُجِبْ داعِيَ الله فَلَيْسَ بِمُعْجِزٍ في الْأَرْضِ ولَيْسَ لَهُ من دُونِهِ أَوْلِياءُ أُولئِكَ في ضَلالٍ مُبِينٍ فأخبر بقوله فَلَيْسَ بِمُعْجِزٍ في الْأَرْضِ عن الجن وقول الله من وليس له إلى مبين فضمت شريعته الجن والإنس فعم بشريعته الإنس والجن وعمت العالم رحمته التي أرسل بها فقال وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ فأخبر الله أنه أرسله ليرحم العالم وما خص عالما من عالم فإذا أتى بكل ما يرضي العالم صنفا صنفا ما عدا بعض من هو مخاطب بحكم شرعه فقد رحمه وقام بالرحمة التي أرسل بها بل نقول إنه جاء بحكم الله وحكم الله يرضى به كل صنف من العالم بلا شك فإن كل العالم مسبح بحمده فهو راض بحكمه من جهة ما جاء به هذا الرسول العام الدعوة العام بنشر الرحمة على العالم غير أن من الناس من لم يرض بالمحكوم به وإن كان راضيا بالحكم فقد نال من رحمة الله التي أرسل بها على قدر ما رضي به من الحكم المعين الذي جاء به وليس هذا الواقع إلا في الناس خاصة وإنما الجن شياطينهم وغير شياطينهم فإن الله جعل لهم الإغواء وأمرهم من خلف حجاب البعد بالاستفزاز والمشاركة في الأموال والأولاد ابتلاء لهم وامتحانا فيقول الشيطان لِلْإِنْسانِ اكْفُرْ فإذا كفر يقول الشيطان إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ هذا إخبار الله عنه ثم قال فَكانَ عاقِبَتَهُما أي جاءهما عقيب هذا الواقع أَنَّهُما في النَّارِ فأعقب الشيطان برجوعه إلى أصله فإنه مخلوق من النار فرجع إلى موطنه وكان للإنسان عقوبة على كفره حيث ظلم بقبول ما جاءه به الشيطان ولم يقبل ما جاءه به الرسول ثم قال خالِدَيْنِ فِيها فخلد الشيطان في منزله وداره وخلد الإنسان جزاء لكفره ولهذا تبرأ منه للافتراق الذي بينهما في العاقبة وقوله وذلك فأشار رينية الواحد ولم يثن الإشارة إلى العقاب فإنهما ما اشتركا فيه لأن الذي أتى للإنسان عقيب ذنبه إنما هو العذاب والذي كان سهم‏\n\n\nالشيطان الذي أتاه عقيب فعله وقوله رجوعه إلى أصله الذي منه خلق فلا يغتر العاقل أ لا ترى في قصة آدم في الجنة لما وقع منه ما وقع من قرب الشجرة وأعقبه الله الهبوط إلى الأرض من الجنة وأهبط حواء وأهبط إبليس ولهذا قال اهْبِطُوا فجمع ولم يثن ولا أفرد فنزل آدم إلى أصله الذي خلق منه فإنه مخلوق من التراب فأهبطه الله للخلافة لقوله تعالى إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً فما أهبط عقوبة لما وقع منه وإنما جاء الهبوط عقيب ما وقع منه وأهبط حواء للتناسل‏\nوأهبط إبليس عقوبة لا رجوعا إلى أصله فإنها ليست داره ولا خلق منها فسأل الله الإغواء أن يدوم له في ذرية آدم لما عاقبه الله بما يكرهه من إنزاله إلى الأرض وكان سبب ذلك في الأصل وجود آدم لأنه بوجوده وقع الأمر بالسجود وظهر ما ظهر من إبليس وكان من الأمر ما كان فعلمنا أن الله أرسله بالرحمة وجعله رحمة للعالمين فمن لم تنله رحمته فما ذلك من جهته وإنما ذلك من جهة القابل فهو كالنور الشمسي أفاض شعاعه على الأرض فمن استتر عنه في كن وظل جدار فهو الذي لم يقبل انتشار النور عليه وعدل عنه فلم يرجع إلى الشمس من ذلك منع وأخبر صَلَّى اللهُ عَليهِ وسَلَّم أنه بعث إلى كل أحمر وأسود فذكر من قامت به الألوان من الأجسام يشير إلى أنه مبعوث بعموم الرحمة لمن يقبلها وبعموم الشرع لمن يؤمن به وأمته صَلَّى اللهُ عَليهِ وسَلَّم جميع من بعث إليه ليشرع له فمنهم من آمن ومنهم من كفر والكل أمته والخصلة الرابعة أنه نصر بالرعب بين يديه مسيرة شهر والشهر قدر قطع القمر درجات الفلك المحيط فهو أسرع قاطع والحساب به للعرب وهو عربي فإذا نصر بين يديه بالرعب مسيرة شهر بسير القمر لأنه ما ذكر السائر وذكر الشهر ولا يعين الشهر عند أصحاب هذا اللسان إلا سير القمر فقد عم نصره بالرعب ما قطعه من المسافة هذا القمر في شهر فعم حكم كل درجة للفلك الأقصى لها أثر في عالم الكون والفساد بقطع القمر تلك المسافة فما قال ذلك إلا بطريق الثناء به عليه ولو كان ثم من يقطع الفلك في أقل من هذه المدة لجاء به فجاء بأسرع سائر يعم سيره قطع درجات الفلك المحيط فعموم رعبه في قلوب أعدائه عموم رحمته فلا يقبل الرعب إلا عدو مقصود يعلم أنه مقصود فما قابلة أحد في قتال إلا وفي قلبه رعب منه ولكنه يتجلد عليه بما أشقاه الله ليتميز السعيد من الشقي فيوهن ذلك الرعب من جلادة عدوه على قدر ما يريد الله فما نقص من جلادة ذلك العدو بما وجده من الرعب كان ذلك القدر نصرا من الله والخصلة الخامسة أحلت له الغنائم ولم تحل لأحد قبله فأعطى ما يوافق شهوة أمته والشهوة نار في باطن الإنسان تطلب مشتهاها ولا سيما في المغانم لأن النفوس لها التذاذ بها لكونها حصلت لهم عن قهر منهم وغلبة وتعمل فلا يريدون أن يفوتهم التنعم بها في مقابلة ما قاسوه من الشدة والتعب في تحصيلها فهي أعظم مشتهى لهم وقد كانت المغانم في حق غيره من الأنبياء إذا انصرف من قتال العدو جمع المغانم كلها فإذا لم يبق منها شي‏ء نزلت نار من الجو فأحرقتها كلها فإن وقع فيها غلول لم تنزل تلك النار حتى يرد ويلقى فيها ذلك الذي أخذ منها فكان لهم نزول النار علامة على القبول الإلهي لفعلهم فأحلها الله لمحمد صَلَّى اللهُ عَليهِ وسَلَّم فقسمها في أصحابه فتناولتها نار شهواتهم عناية من الله بهم لكرامة هذا الرسول عليه فأكرمه بأمر لم يكرم به غيره من الرسل وأكرم من آمن به بما لم يكرم به مؤمنا قبله بغيره والخصلة السادسة أن طهر الله‏\n\n\nبسببه الأرض فجعلها كلها مسجدا له فحيث أدركته أو أمته الصلاة يصلي والمساجد بيوت الله وبيوت الله أكرم البيوت لأضافتها إلى الله فصير الأرض كلها بيت الله من حيث أن جعلها مسجدا وقد أخبرنا لمن يلازم المساجد من الفضل عند الله فأمته لا تبرح في مسجد أبدا لأنها لا تبرح من الأرض لا في الحياة ولا في الموت وإنما هو انتقال من ظهر إلى بطن وملازم المسجد جليس الله في بيته فهذه الأمة جلساء الله حياة وموتا لأنهم في مسجد وهو الأرض وكذلك جعل الله أيضا تربة هذه الأرض طهورا فكان لها حكم الماء في الطهارة إذا عدم الماء أو عدم الاقتدار على استعماله لسبب مانع من ذلك فأقام لهم تراب هذه الأرض والأرض طهورا فإذا فارق الأرض ما فارق منها ما عدا التراب فلا يتطهر به إلا أن يكون التراب فإنه ما كان منها يسمى أرضا ما دام فيها من معدن ورخام وزرنيخ وغير ذلك فما دام في الأرض كان أرضا حقيقة لأن الأرض تعم هذا كله فإذا فارق الأرض انفرد باسم خاص له وزال عنه اسم الأرض فزال حكم الطهارة منه إلا التراب خاصة فسواء فارق الأرض أو لم‏\n\n\nيفارقها فإنه طهور لأنه منه خلق المتطهر به وهو الإنسان فيطهر بذاته تشريفا له فأبقى الله النص عليه بالحكم به في الطهارة دون غيره ممن له اسم غير اسم الأرض فإذا فارق التراب الأرض زال عنه اسم الأرض وبقي عليه اسم التراب كما زال عن الزرنيخ اسم الأرض لما فارق الأرض وبقي عليه اسم الزرنيخ فلم تجز الطهارة به بعد المفارقة لأن الله ما خلق الإنسان من زرنيخ وإنما خلقه من تراب‏\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الأرض إن الله جعلها له مسجدا وطهورا\n\n\nقال في الخبر الآخر وجعلت تربتها لنا طهورا\nفخرج التراب بالنص فيه عن سائر ما يكون أرضا ويزول عنه الاسم بالمفارقة فهذه ستة خص بها هذا النبي صَلَّى اللهُ عَليهِ وسَلَّم فكانت منزلة لم ينلها غيره لها حكم في كل منزل من دنيا وهو ما ذكرناه ومن برزخ وقيامة وجنة وكثيب فيظهر حكم هذا الاختصاص الإلهي في كل منزل من هذه المنازل ليتبين شرفه وما فضله الله به على غيره مع كونه أعطى جميع ما فضلت به الرسل بعضها على بعض‏\n\n\n### [ليس من شرط الرسالة ظهور العلامات على صدقه‏]\n\n\nثم لتعلم أيها الولي أنه من رحمته صَلَّى اللهُ عَليهِ وسَلَّم التي بعثه الله تعالى بها ما أبان الله على لسانه لنا وأمره بتبليغ ذلك فبلغ أنه ليس من شرط الرسالة ظهور العلامات على صدقه إنما هو شخص منذر مأمور بتبليغ ما أمر بتبليغه هذا حظه لا يجب عليه غير ذلك فإن أتى بعلامة على صدقه فتلك فضل الله ليس ذلك بيده فأقام عذر الأنبياء كلهم في ذلك فكان رحمة للرسل في هذا فجاء في القرآن قوله وقالُوا لَوْ لا نُزِّلَ عَلَيْهِ آيَةٌ من رَبِّهِ وهذا قول غير العرب ما هو قول العرب لأنه جاء بالقرآن آية على صدقه للعرب إذ لا يعرف إعجازه وكونه آية غير العرب فلم يرد عنه إنه أظهر آية لكل من دعاه من غير العرب كاليهود والنصارى والمجوس ولكن أي شي‏ء جاء من الآيات فذلك من الله لا بحكم الوجوب عليه ولا على غيره من الرسل فقيل له قُلْ لهم إِنَّمَا الْآياتُ عِنْدَ الله وإِنَّما أَنَا نَذِيرٌ مُبِينٌ ثم قال له أَ ولَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنا عَلَيْكَ الْكِتابَ يُتْلى‏ عَلَيْهِمْ إِنَّ في ذلِكَ لَرَحْمَةً بهم فإنا أرسلناك رَحْمَةً لِلْعالَمِينَ فضمنا القرآن جميع ما تعرف الأمم أنه آية على صدق من جاء به إذ لم يعلموا منه بقرائن الأحوال أنه قرأ ولا كتب ولا طالع ولا عاشر ولا فارق بلده بل كان أميا من جملة الأميين وأخبرهم عن الله بأمور يعرفون أنه لا يعلمها من هو بهذه الصفة التي هو عليها هذا الرسول إلا بإعلام من الله فكان ما جاء في القرآن من ذلك آية كما قالوا وطلبوا وكان إعجازه للعرب خاصة إذ نزل بلسانهم وصرفوا عن معارضته أو لم يكن في قوتهم ذلك من غير صرف حدث لهم فجاء القرآن بما جاءت به الكتب قبله ولا علم له بما جاء فيها إلا من القرآن وعلمت ذلك اليهود والنصارى وأصحاب الكتب فحصلت الآية من عند الله لأن القرآن من عند الله فقد تبين لك منزل محمد من غيره من الرسل وخصه الله بعلوم لم تجتمع في غيره منها إنه أعطاه أنواع ضروب الوحي كلها فأوحى إليه بجميع ما سمي وحيا كالمبشرات والإنزال على القلوب والآذان وبحالة العروج وعدم العروج وغير ذلك وخصه بعموم علوم الأحوال كلها فأعطاه العلم بكل حال وفي كل حال ذوقا لأنه أرسله إلى الناس كافة وأحوالهم مختلفة فلا بد أن تكون رسالته تعم العلم بجميع الأحوال وخصه الله بعلم إحياء الأموات معنى وحسا فحصل العلم بالحياة المعنوية وهي حياة العلوم والحياة الحسية وهو ما أتى في قصة إبراهيم عليه السلام تعليما وأعلاما لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو قوله نَقُصُّ عَلَيْكَ من أَنْباءِ الرُّسُلِ ما نُثَبِّتُ به فُؤادَكَ وجاءَكَ في هذِهِ الْحَقُّ وخص بعلم الشرائع كلها فأبان له عن شرائع المتقدمين وأمره أن يهتدي بهداهم وخص بشرع لم يكن لغيره منه ما ذكرناه في الستة التي خص بها فهذه أربعة منازل لم ينزل فيها غيره من الأنبياء عليه السلام فهذا منزل محمد صَلَّى اللهُ عَليهِ وسَلَّم قد ذكرت منه ما يسره الله على لساني فلنذكر ما يتضمن منزله من العلوم فمن ذلك علم الحجاب أعني حجاب الجحد وحجاب الحكمة وعلم الفارق الذي تعينت به السبل مثل قوله لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً ولَوْ شاءَ الله لَجَعَلَكُمْ أُمَّةً واحِدَةً وهل هم اليوم بعموم بعثة الرسل أمة واحدة أم لا وهل حكم الله على أصحاب الكتب بالجزية وإبقائهم على دينهم شرع من الله لهم على لسان محمد صَلَّى اللهُ عَليهِ وسَلَّم فينفعهم ذلك ما أعطوا الجزية عن قوة من الآخذين وصغار منهم فقد فعلوا ما كلفوا وكان هذا حظهم من الشريعة فإبقاؤهم على شرعهم شرع محمدي لهم فيسعدون بذلك فتكون مؤاخذة من أخذ منهم بما فرط فيه من الشرع الذي هم عليه كسائر العصاة الذين لم يعملوا بجميع ما تضمنه شرعهم وإن كانوا مؤمنين به وهذا علم غريب ما أعلم له ذائقا من فتوح المكاشفة وهو من علوم الأسرار التي غار عليها أهل الله فصانوها وفيه علم ما حير الأكوان فيما تحيروا فيه كان ما كان وفيه علم الايمان المطلق والمقيد وفيه علم ما يفسد العمل المشروع ويصلحه وفيه علم سريان الحق في الأحكام على اختلافها وأنها كلها حق من الرب وفيه علم الكفارات وفيه علم ما تصلح به أحوال الخلق وفيه علم‏\n\n\nما هو الباطل وما هو الحق هل هما أمر وجودي أو ليس بوجودي وفيه علم الشركة في الاتباع وإلى ما يؤول كل تابع هل غايته أمر واحد أو مختلف وفيه علم من تضرب له الأمثال ممن لا تضرب وفيه علم القهر الإلهي على أيدي الأكوان‏\nوقول أبي يزيد بطشي أشد في هذا المقام وفيه علم الفرج بعد الشدة وهل من شأن الفرج أن لا يكون إلا بعد شدة أم لا وفيه علم أنواع الابتلاء وفيه علم الصفة التي تزيل الحيرة عمن قامت به والإبانة عن ذلك وعلم الأنفاس الإلهية وعلم الأسفار عن نتائج الأسفار وعلم المواعظ وعلم الغلبة التي ليس فيها نصر إلهي بما ذا كانوا غالبين وفيه علم الفرق بين علم العين وعلم الدليل وهل يقوم مقام العين أم لا وفيه علم أنواع الزينة في العالم وفيه علم مراتب العلوم وتفاصيلها وفيه علم القضاء السابق من علم نفاة القدر وفيه علم الطبع والختم والقفل والكن وما هو عمى الأبصار وعمى البصائر ولم اختص عمى القلوب بحالة الصدور وهو الرجوع عن الحق وهل هو الصدور الذي يكون عن ورود متقدم أو هو صدور تكوين ممكن عن واجب أو هو صدور محل لا صفة فيكون عماه من كونه في المحل فإذا فارق المحل بنظره وانفتح له فيه فرج ينظر منها يزول عماه وفيه تعيين علوم المزيد فإنها مختلفة بحكم ما تقع الزيادة عليه وفيه علم الآيات والعلامات على الكوائن وفيه علم توحيد المرتبة الإلهية أنه ما حازها إلا واحد وفيه علم الستور وأصنافها التي تسدل علينا لنستر بها عن إدراك الغير وما هي الستور التي تسدل بيننا وبين من نطلب رؤيته فلا نراه وفيه علم الإقامة في المنزل والتقلب فيه لا عنه وفيه علم العناية بقوم وتركها في حق قوم وفيه ما تنتجه العزائم في الخير والشر وفيه علم الخير والشرور وفيه علم النسب الرحماني وفيه علم ما ينفع من الايمان مما لا ينفع كما قال أُولئِكَ هُمُ الْكافِرُونَ حَقًّا وفيه علم البعد والقرب الإلهي وفيه علم ما يؤدي إليه التفكر وفيه علم الرجعة ممن وإلى من وفيه علم ما يؤثر فيه الظن مما لا يؤثر وفيه علم المشاهدة وتعلقها بالمشيئة مع استعداد المحل لقبولها وما هناك منع والمحل قابل وما هذه المشيئة المانعة وفيه علم الإنصاف في المجازاة والفضل وفيه علم الفرق بين الأضداد والأمثال وغير الأمثال إلى غير هذا من العلوم فإني لا أسوق من ذلك ما أسوقه على جهة الحصر مع علمي بذلك وإنما أسوقه على جهة التنبيه على ما فيه أو بعض ما فيه بحسب ما يقع لي فوقتا أورد ذلك بطريق الحصر بحيث إني لا أترك في المنزل علما إلا نبهت عليه ووقتا أقصر عن ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 337: Concerning the Knowledge of the Station (منزل) of Muhammad (PBUH) in relation to a part of the Cosmos, which belongs to the Mosaic Presence (الحضرة الموسوية)\n\nOh, for God! What the universes contain\nOf the rulings of contradiction within Existence (الوجود).\n\nAmong them are the obedient, the disobedient, the knowing,\nAnd the ignorant, concerning descent and ascent.\n\nAmong them are those who realize the Unseen (غيوب),\nAnd among them are those who realize the Witnessing (الشهود).\n\nMultiplicity (كثرة) appears, yet its Essence (العين) is One (وحيد)\nThrough proofs and covenants.\n\nGlory be to the Desired One, by every description,\nWhether from the attributes of Divinity or servitude.\n\nGlory be to the One Who encompasses all things,\nAnd Who is described in Gnosis (المعارف) by the increase (المزيد).\n\n### The Vision on the Day of the Greatest General Gathering\n\nThe Messenger of God (PBUH) said: \"I am the master of mankind on the Day of Resurrection,\" and he explained this by his perfection, saying: \"Had Moses been alive, he would have had no choice but to follow me.\"\n\nThis is due to the universality of his message and the comprehensiveness of his Law (شريعته). He (PBUH) was distinguished by things not granted to any prophet before him, and nothing was granted specifically to any prophet except that it was also for Muhammad (PBUH). Indeed, he was given the comprehensive words (جوامع الكلم), and he said: \"I was a prophet while Adam was between clay and water.\"\n\nOther prophets were only prophets during the time of their prophethood and the era of their mission. Let us mention in this chapter his station (منزل) and his rank (منزلة). The station (منزل) appears on the carpet of the Real (الحق) and the seat of truth, at the time of the Theophany (التجلي) and the Vision on the Day of the Greatest General Gathering (يوم الزور العام الأعظم). His station is known by sight and Witnessing (الشهود). As for his rank (منزلة), it is a rank within the very Essence (نفس الحق) of the Real and a degree (مرتبة) derived from Him, and this is known only through God's notification. He possesses the Praised Station (المقام المحمود), which is the opening of the door of intercession for the angels and those below them. He has priority in intercession and he possesses the Means (الوسيلة), and there is no station higher than it. Muhammad (PBUH) attains it through the request of his Community (أمته), as a reward for the happiness they attained through him, since he clarified the path for them and they followed it.\n\n### The Deeds of the Wretched are Embodied, and Likewise the Deeds of the Fortunate\n\nKnow that whoever enters this station sees wonders in it that he does not see elsewhere. Among these is that he sees the deeds of the wretched (الأشقياء) embodied, and likewise the deeds of the fortunate (السعداء) embodied as standing forms that comprehend the existence of their Creator. God has placed within the souls of these forms a seeking for the causes from which they originated, namely the doers (العاملون), and they strive in their search.\n\nAs for the deeds of the fortunate, they see a path on their right hands which they traverse, and that path leads them to the witnessing (مشاهدة) of their companions, who are the fortunate. They recognize one another and converse. The doers take these deeds as vehicles of success and salvation, carrying them to the abode of Mercy.\n\nAs for the deeds of the wretched, multiple, branching, and intertwined paths arise for them. They do not know which path leads them to their companions, so they become bewildered and are not guided. This is part of God’s mercy upon the wretched. When their deeds become bewildered, they return to God through worship and remembrance. They disperse on those paths. Some of them never find their companion for all eternity, and some reach their companion, witness him, and recognize him. Their existence is a coincidence, so they cling to him and say: \"Carry me, for I have been exhausted in seeking you.\" The doer is then compelled to carry him until God’s mercy reaches him.\n\nBeside the standing place of these forms are two clear paths: a path whose goal is the Real Existence (الحق الوجود), and a path that has no goal, for it leads the traveler out into Non-existence (العدم). He does not stop at its goal, since Non-existence is not defined by a limit to be constrained by, unlike the Real Existence, which is constrained, even though it is absolute. Its absoluteness is a constraint in reality, for it is distinguished by its absoluteness from conditioned existence. Thus, it is constrained in the very eye of its absoluteness.\n\nA third path lies between these two paths, a barzakhī (برزخي) path, whose goal is described neither by Existence nor by Non-existence, like the states (الأحوال) in the science of the theologians (المتكلمين). As for the path whose goal is the Real Existence, it is traversed by the monotheists (الموحدون), the believers, the polytheists, the disbelievers, and all those who hold existential doctrines (العقائد الوجودية). As for the other path, only the nihilists (المعطلة) traverse it, and it does not lead them to any goal. As for the barzakhī path, only the Gnostics of God (العلماء بالله) traverse it—those whom the Real established and effaced in the very eye of their establishment, and whom He sustained (أبقاهم) in the state of their annihilation (فنائهم). They are those who neither die nor live until God judges between the servants. Then they take the right side toward the path of Real Existence. They have acquired a quality from the reality of that path, and they have acquired a disposition that appears upon them in the station of Real Existence, by which they recognize one another, but no one from the people of the other two paths recognizes them.\n\nThis is a parable (ضرب مثل) set forth by God for the People of God (أهل الله) so that they may grasp the degrees of guidance and bewilderment, and the guided and the misguided. God has granted them a light—or rather, lights—by which they are guided in the darknesses of the land of their nature, in the darknesses of the sea of their thoughts, and in the darknesses of their rational souls, both their land and their sea, according to their state in their origination, since they were generated between pure light and pure, elemental nature.\n\nThose lights placed within them originate from the Divine Names (الأسماء الإلهية). Whoever is a Gnostic of them and looks through them, according to the manner in which they were created for him, reaches through them the Knowledge (العلم) of things and Unveiling (الكشف). But whoever takes them merely as lights, not knowing that they are placed there for guidance, and treats them as decoration, as the common people view the stars in the sky—as mere decoration—he gains nothing from them except what he sees. The Gnostics (العلماء) view them according to their stations, their courses, and their journeys in their spheres, placed there for guidance. Thus, they take them as signs for what they seek in their journeying upon the paths that lead to what the Real has called them to, whether it be the Knowledge of Him or the happiness that is specific salvation.\n\n### That God Made the Station of Muhammad (PBUH) the Mastership\n\nKnow that when God made the station (منزل) of Muhammad (PBUH) the Mastership (السيادة), he became the master (سيد), and everyone else was common folk (سوقة). We know that he cannot be resisted, for common folk do not resist their kings. Thus, he has a specific station, and the common folk have their station. Since he was granted this rank while Adam was between water and clay, we know that he is the source of sustenance (الممد) for every Perfect Human (إنسان كامل) described by a divine or legal norm. The first manifestation of this was in Adam, whom God made a Caliph (خليفة) on behalf of Muhammad (PBUH). Thus, He sustained Adam with all the Names (الأسماء) from the station of the Comprehensive Words (جوامع الكلم) belonging to Muhammad (PBUH). Adam manifested the knowledge of all the Names against those who objected to God regarding his existence and preferred themselves over him.\n\nThen the Caliphs (الخلائف) followed one after another on Earth until the time of the existence of his physical form, to manifest the ruling of his rank (منزلته) through the convergence of his two origins (نشأتيه). When he appeared, he was like the sun, in whose light every light was encompassed. None of the laws (شرائعه) with which He directed his deputies remained affirmed, and whatever was abrogated was indeed abrogated. His providence for his Community (أمته) was purified by his presence and manifestation among them. Although the entire human and fiery cosmos is his Community, these people have a specific description, for He made them the best community brought forth for mankind. This favor was granted by his manifestation through his two origins.\n\nPart of the favor of this Community over other communities is that God placed them in the rank of His Caliphs in the world before his manifestation, since He had granted them legislation (التشريع). He granted this Community the right of independent judgment (الاجتهاد) in establishing rulings and commanded them to judge according to what their judgment led them to. Thus, He granted them legislation, and they attained the ranks of the Prophets (peace be upon them) in this regard. He made them their inheritors, due to their coming later than them, for the later necessarily inherits the earlier. They call to God with clear insight (بصيرة), just as the Messengers called. Muhammad (PBUH) informed us of their infallibility (عصمتهم) in what they call to.\n\nAmong them is the one who errs in a ruling, but the error of the other independent judges (المجتهدين) is not an error concerning the Real (الحق), for what he brought is truth. If he errs in a ruling that was previously ruled upon by Muhammad (PBUH) and which he did not reach, then he is granted one reward, which is the reward for independent judgment. If he correctly hits the previous ruling through his independent judgment, he receives two rewards: the reward for independent judgment and the reward for correctness. Even if the correct one is unknown in person among the independent judges, both to himself and others, he is not unknown to God.\n\nEveryone who entered the time of this Community after the appearance of Muhammad (PBUH), including the prophets and the former caliphs, judges in the world only according to what Muhammad (PBUH) legislated for this Community. He was distinguished among the independent judges and became part of their party, while retaining the rank of the first Caliphate. Thus, he has two rulings, and by this, what he manifests in the Resurrection will be manifested, which is not manifested here.\n\nThe station (منزل) of Muhammad (PBUH) on the Day of the Greatest Gathering (يوم الزور الأعظم) is on the right hand of the All-Merciful (الرحمن), in terms of the form in which He discloses Himself (يتجلى) upon His Throne. His station on the Day of Resurrection is not on the right hand of the All-Merciful, but before the Just Judge, for the execution of the Divine Commands and rulings in the cosmos. Everyone takes from him in that place, and he is entirely a Face (وجه كله) seen from all directions. From every side, he receives notification from God Almighty, which is understood from him. They see him as a tongue and hear him as a sound and a letter.\n\nHis rank (منزلته) in the Gardens (الجنان) is the Means (الوسيلة), from which all the Gardens branch out. It is in the Garden of Eden (جنة عدن), the Abode of Permanence (دار المقامة). It has a branch in every Garden, and from that branch, he (PBUH) appears to the inhabitants of that Garden. In every Garden, it is the greatest station within it.\n\nThese stations (منازل) are all sensory, not intellectual (حسية لا معنوية). The only intellectual rank (المعنوية) is his rank within the very Essence (نفس موجدة) of the Existent One, Who is God Almighty. This is not exclusive to him; rather, every rank must be within the Essence of God, Who is the All-Merciful (الرحمن). The stations (منازل) are perceptible and limited, being the plural of *manzil* (station), not the plural of *manzila* (rank). Know this, for it is from the core of Gnosis (المعرفة) of God, exalted and sanctified in His Essence (ذاته). As for his rank in the sciences, it is the encompassing of the knowledge of every Gnostic of God (عالم بالله), both their predecessors and successors. Every station belonging to him and his followers is perfumed with the Divine fragrance (الطيب الإلهي) that has not been entered or utilized by the hands of the universes.\n\n### That it is part of the Perfection of Muhammad (PBUH) that he was distinguished by six things not granted to any prophet before him\n\nKnow that part of his perfection (PBUH) is that he was distinguished by six things not granted to any prophet before him. The number six is the most perfect of numbers. There is no shape with angles which, when joined with its counterparts, leaves no gap, except the hexagon (six). It is by this that God inspired the bee in His saying: <<أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ>> (Take for yourself among the mountains, houses, and among the trees and what they construct). He inspired it with the description of its work, and it made it hexagonal.\n\nHe informed us that he was given the keys to the treasuries (مفاتيح الخزائن), which are the treasuries of the genera of the cosmos, so that He may bring forth to them according to what they seek by their essences, since we know that he is the Master (السيد). Whoever interprets the designation of the treasuries as the Earth, then the Earth contains only the treasuries of minerals and plants, nothing else, for the animal, in terms of its growth, is a plant. God Almighty said: <<وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا>> (And Allah has caused you to grow from the earth a [type of] growth). Thus, He informed us that we are part of the growth of the Earth.\n\nHe (PBUH) was not given these keys until he possessed the quality by which he deserved them. This is why Joseph (peace be upon him) requested them from the King of Egypt, asking him to place him over the treasuries of the land, because he was a guardian and knowing (حفيظ عليم), so that everyone would be dependent on him, and his mastership over them would be established. This is why he stated the quality required for one who holds this station, saying: <<إِنِّي حَفِيظٌ عَلِيمٌ>> (Indeed, I am a guardian, knowing). A guardian (حفيظ) over them, so that nothing is taken out except in a known measure, just as God Almighty says: <<وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ>> (And there is not a thing but that with Us are its treasuries, and We do not send it down except in a known measure). If this quality resides in the one who possesses its keys, then He said, after saying *ḥafīẓun ʿalīm* (guardian, knowing), that he is knowing (عليم) of the need of those who require what is in these treasuries, which store what sustains them, and knowing of the measure of the need.\n\nSince Muhammad (PBUH) was given the keys to the treasuries of the Earth, we know that he is a guardian, knowing. Every provision (رزق) that appears in the cosmos is given by the Divine Name only by the command of Muhammad (PBUH), who holds the keys, just as the Real Almighty is exclusively characterized by the keys of the Unseen (مفاتيح الغيب), which none knows but Him. This Master (السيد) was granted the rank of exclusivity by being given the keys to the treasuries.\n\nThe second distinction is that he was given the Comprehensive Words (جوامع الكلم). *Kalim* (الكلم) is the plural of *kalima* (word), and the words of God are inexhaustible. Thus, he was given the knowledge of what is endless. He knew what is finite, encompassed by Existence (الوجود), and he knew what has not entered into Existence, which is infinite. Thus, he encompassed the realities of the known things (حقائق المعلومات) with his knowledge. This is a Divine Attribute (صفة إلهية) that belonged to no one else. The Word (الكلمة) from him is words, like the Divine Command, which is a single word, <<كَلَمْحٍ بِالْبَصَرِ>> (like the twinkling of an eye). In sensory analogy, there is nothing greater or more appropriate for comparison than the twinkling of an eye.\n\nSince he knew the Comprehensive Words, he was granted the miraculousness (الإعجاز) of the Quran, which is the Word of God, and he is the translator (المترجم) of God through it. Thus, the miraculousness occurred in the translation, which belongs to him. For abstract meanings, divorced from matter, cannot be conceived as miraculous. Rather, the miraculousness is the connection of these meanings to the forms of the words, established by the arrangement of the letters. He is the tongue of the Real, His hearing, and His sight. This is the highest of the Divine Degrees (المراتب الإلهية). Lower than this is the one for whom the Real is his hearing, sight, and tongue, so that he becomes a translator for his servant, just as the Almighty translated for us in the Quran the states of those before us and what they said. That one does not possess that honor, for he translates for his people and those close to Him, like the angels, regarding what they said. He also translates for Iblis, despite his despair and devilry and distance, regarding what he said. But only the one with the highest exclusivity translates for God.\n\nThe third distinction is his mission to all mankind (الناس كافة). *Kaff* (الكفت) means gathering or containment. <<أَلَمْ نَجْعَلِ الْأَرْضَ كِفَاتًا>> (Have We not made the earth a container?), meaning it contains the living on its surface and the dead in its belly. Likewise, his Law (شريعته) contained all people. No one hears of him except that belief in him becomes incumbent upon them. When the jinn heard the Quran being recited, they said to their people: <<يَا قَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ وَآمِنُوا بِهِ يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُجِرْكُمْ مِنْ عَذَابٍ أَلِيمٍ * وَمَنْ لَا يُجِبْ دَاعِيَ اللَّهِ فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ وَلَيْسَ لَهُ مِنْ دُونِهِ أَوْلِيَاءُ أُولَئِكَ فِي ضَلَالٍ مُبِينٍ>> (O our people, respond to the caller of Allah and believe in him; He will forgive you your sins and protect you from a painful punishment. * But he who does not respond to the caller of Allah will not cause failure [to Him] upon the earth, nor will he have besides Him protectors. Those are in manifest error).\n\nBy His saying, <<فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ>> (will not cause failure [to Him] upon the earth), He informed us about the jinn, and God’s saying, <<وَلَيْسَ لَهُ مِنْ دُونِهِ أَوْلِيَاءُ أُولَئِكَ فِي ضَلَالٍ مُبِينٍ>> (nor will he have besides Him protectors. Those are in manifest error), contained both jinn and mankind. Thus, his Law encompassed both mankind and jinn, and his mercy, with which he was sent, encompassed the cosmos. He said: <<وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ>> (And We have not sent you except as a mercy to the worlds). God informed us that He sent him to show mercy to the cosmos, and He did not exclude any world from another. If he came with everything that satisfies the cosmos, class by class, except for some who are addressed by the ruling of his Law, then he has shown mercy to them and fulfilled the mercy with which he was sent. Rather, we say that he came with the ruling of God, and every class of the cosmos is undoubtedly satisfied with the ruling of God, for the entire cosmos glorifies Him with His praise, so it is satisfied with His ruling in terms of what this universal Messenger brought. However, among mankind, there are those who are not satisfied with the object of the ruling, even if they are satisfied with the ruling itself. Thus, they attained God’s mercy, with which he was sent, according to the degree to which they were satisfied with the specific ruling he brought. This situation occurs only specifically among mankind.\n\nAs for the jinn, both their devils and non-devils, God has appointed for them misguidance and commanded them, from behind the veil of distance, to incite and share in wealth and children, as a trial and test for them. The Devil says to man: <<اكْفُرْ>> (Disbelieve!). When he disbelieves, the Devil says: <<إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ>> (Indeed, I am disassociated from you. Indeed, I fear Allah, Lord of the worlds). This is God’s report concerning him. Then He said: <<فَكَانَ عَاقِبَتَهُما>> (So the consequence for both of them was)—meaning, what followed this event was—<<أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا>> (that they would be in the Fire, abiding eternally therein). The Devil’s consequence was his return to his origin, for he was created from fire, so he returned to his abode. Man’s consequence was punishment for his disbelief, since he committed injustice by accepting what the Devil brought him and not accepting what the Messenger brought him. Then He said: <<خَالِدَيْنِ فِيهَا>> (abiding eternally therein). The Devil abides eternally in his station and dwelling, and man abides eternally as recompense for his disbelief. This is why the Devil disassociated himself from him, due to the difference in their ultimate consequence. And His saying, *wa dhālika* (and that), refers to the singular, and He did not dualize the reference to the punishment, because they did not share in it. For what came to man following his sin was the torment, while the Devil’s share, which came following his action and word, was his return to his origin from which he was created. The intelligent person should not be deceived.\n\nDo you not see in the story of Adam in the Garden, when what happened occurred—his approaching the tree—God followed it with the descent (الهبوط) to Earth from the Garden. He caused Eve to descend, and He caused Iblis to descend. This is why He said: <<اهْبِطُوا>> (Descend!), using the plural, not the dual or the singular. Adam descended to his origin from which he was created, for he was created from dust. God caused him to descend for the Caliphate (الخلافة), according to His saying: <<إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً>> (Indeed, I will place upon the earth a successor/caliph). He did not descend as a punishment for what occurred, but the descent followed what occurred. Eve descended for procreation. Iblis descended as a punishment, not a return to his origin, for it is neither his dwelling nor was he created from it. He asked God for misguidance (الإغواء) to continue for Adam’s progeny, because God punished him with what he disliked—his descent to Earth. The original cause of this was the existence of Adam, because through his existence, the command to prostrate occurred, and what manifested from Iblis manifested, and what happened happened.\n\nThus, we know that God sent him with mercy and made him a mercy to the worlds. Whoever does not receive his mercy, that is not due to him, but due to the recipient. He is like the solar light that pours its rays upon the Earth. Whoever hides from it in a shelter or the shadow of a wall is the one who did not accept the spread of the light upon him and turned away from it. The sun is not prevented from shining by this.\n\nHe (PBUH) informed us that he was sent to every red and black person. He mentioned those who possess colors among bodies, indicating that he was sent with universal mercy for those who accept it, and with universal Law for those who believe in him. His Community (أمته) (PBUH) includes everyone to whom he was sent to legislate for. Some of them believed, and some disbelieved, but all are his Community.\n\nThe fourth distinction is that he was granted victory by awe (الرعب) for the distance of a month’s journey ahead of him. A month is the measure of the moon’s cutting through the degrees of the encompassing sphere. It is the fastest traveler, and the calculation by it is for the Arabs, and he is an Arab. Since he was granted victory by awe for the distance of a month’s journey ahead of him, based on the moon’s travel—because he mentioned the month but not the traveler, and the month is only designated among the people of this tongue by the moon’s travel—his victory by awe encompassed the distance cut by the moon in that month. Thus, the ruling of every degree of the outermost sphere, which has an effect on the world of generation and corruption, was encompassed by the moon’s cutting of that distance. He only mentioned this as a way of praising him. Had there been something that traversed the sphere in less time than this period, he would have mentioned it. So he mentioned the fastest traveler whose journey encompasses the cutting of the degrees of the encompassing sphere. The universality of the awe in the hearts of his enemies is the universality of his mercy. Awe is only accepted by a known, intended enemy. No one confronted him in battle except that there was awe in his heart, but he hardened himself against it by what God made him wretched, so that the fortunate might be distinguished from the wretched. That awe weakens the fortitude of his enemy to the extent that God wills. Whatever is diminished from the fortitude of that enemy due to the awe he finds is that measure of victory from God.\n\nThe fifth distinction is that the spoils of war (الغنائم) were made lawful for him, which were not lawful for anyone before him. He was given what corresponds to the desire (شهوة) of his Community. Desire is a fire within man that seeks what it craves, especially regarding spoils, because souls find pleasure in them, having obtained them through their conquest and dominance. They strive and do not want to miss the enjoyment of them in return for the hardship and fatigue they endured in acquiring them. They are their greatest craving. In the case of other prophets, when they returned from fighting the enemy, they gathered all the spoils. If nothing remained, a fire would descend from the sky and burn it all. If any misappropriation (غلول) occurred, that fire would not descend until the misappropriated item was returned and thrown into the pile. The descent of the fire was a sign of Divine acceptance of their action. God made the spoils lawful for Muhammad (PBUH), and he divided them among his companions. The fire of their desires consumed them, out of God’s providence for them due to the honor of this Messenger. Thus, He honored him with a matter He did not honor any other Messenger with, and He honored those who believed in him with what He did not honor any believer before him with through another.\n\nThe sixth distinction is that God purified the Earth through him, making it entirely a place of prostration (مسجدا) for him. Wherever he or his Community is overtaken by the time for prayer, they pray. Mosques are the houses of God, and the houses of God are the most honored houses due to their attribution to God. Thus, He made the entire Earth the house of God by making it a place of prostration. He informed us of the virtue for those who adhere to the mosques. His Community is never absent from a mosque, because they are never absent from the Earth, neither in life nor in death. It is merely a transition from the surface to the belly. The one who adheres to the mosque is God’s companion in His house. This Community are God’s companions, alive and dead, because they are in a mosque, which is the Earth.\n\nLikewise, God also made the dust (تربة) of this Earth a purifier (طهورا). It was given the ruling of water in purification when water is absent or when one is unable to use it due to a preventing cause. He established the dust of this Earth—and the Earth is a purifier—for them. When something separates from the Earth, what separates, other than dust, is not used for purification. Only dust is used. Everything that is part of the Earth is called Earth as long as it is in it, such as minerals, marble, arsenic, and so on. As long as it is in the Earth, it is truly Earth, because the Earth encompasses all of this. When it separates from the Earth, it takes on a specific name and the name \"Earth\" is removed from it, and the ruling of purification is removed from it, except for dust specifically. Whether it separates from the Earth or not, it is a purifier, because the one who is purified by it—man—was created from it. Thus, it purifies by its very essence, as an honor to him. God maintained the explicit text (النص) regarding its ruling for purification, excluding everything else that bears a name other than the name \"Earth.\" If dust separates from the Earth, the name \"Earth\" is removed from it, and the name \"dust\" remains upon it, just as the name \"Earth\" was removed from arsenic when it separated from the Earth, and the name \"arsenic\" remained upon it. Purification is not permissible with it after separation, because God did not create man from arsenic, but from dust.\n\nThe Messenger of God (PBUH) said concerning the Earth: \"God made it for me a place of prostration and a purifier.\"\n\nIn another narration, he said: \"And its dust was made a purifier for us.\"\n\nBy the explicit text concerning dust, it is excluded from all other things that constitute Earth and lose the name upon separation. These are six distinctions granted exclusively to this Prophet (PBUH). They constitute a rank (منزلة) that no one else attained, and it has a ruling in every station (منزل) of the world—which we have mentioned—and of the Barzakh (برزخ), the Resurrection, the Hill (كثيب), and Paradise. The ruling of this Divine exclusivity manifests in every one of these stations, so that his honor and the favor God bestowed upon him over others may be clear, along with the fact that he was given everything by which the Messengers were favored over one another.\n\n### It is not a condition of Messengership that signs of its truth appear\n\nThen know, O Wali (ولي), that part of his mercy (PBUH), with which God Almighty sent him, is what God clarified for us through his tongue and commanded him to convey. He conveyed that it is not a condition of Messengership (الرسالة) that signs (العلامات) of its truth appear. He is merely a Warner (منذر) commanded to convey what he was commanded to convey. This is his lot; nothing else is incumbent upon him. If he brings a sign of his truth, that is God’s favor; it is not in his hands. Thus, he established the excuse for all the prophets in this regard, and he was a mercy to the Messengers in this. The Quran contains the saying: <<وَقَالُوا لَوْلَا نُزِّلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ>> (And they said, \"Why has a sign not been sent down to him from his Lord?\"). This is the saying of non-Arabs, not the saying of the Arabs, because he came with the Quran as a sign of his truth for the Arabs, since only the Arabs could recognize its miraculousness and its being a sign. He did not manifest a sign for every non-Arab he called, such as the Jews, Christians, and Magians.\n\nHowever, whatever signs (الآيات) came, they were from God, not by way of obligation upon him or upon any other Messenger. So it was said to him: <<قُلْ إِنَّمَا الْآيَاتُ عِنْدَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ>> (Say to them, \"The signs are only with Allah, and I am only a clear Warner\"). Then He said to him: <<أَوَلَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَى عَلَيْهِمْ إِنَّ فِي ذَلِكَ لَرَحْمَةً>> (Is it not sufficient for them that We revealed to you the Book which is recited to them? Indeed, in that is a mercy for them), for We sent you <<رَحْمَةً لِلْعَالَمِينَ>> (as a mercy to the worlds).\n\nThe Quran contained everything that the communities recognize as a sign of the truth of the one who brought it, since they knew from circumstantial evidence that he neither read nor wrote, nor studied, nor associated [with scholars], nor left his city; rather, he was illiterate (أميا) among the illiterate. He informed them about God concerning matters that they knew could not be known by one of his description except through notification from God. Thus, what came in the Quran was a sign, just as they requested and sought. Its miraculousness was specific to the Arabs, since it was revealed in their tongue, and they were diverted from opposing it, or they lacked the power to do so without any diversion occurring to them.\n\nThe Quran came with what the previous Books brought, and he had no knowledge of what was in them except from the Quran. The Jews, Christians, and People of the Book knew this. Thus, the sign was obtained from God, because the Quran is from God.\n\nThe station (منزل) of Muhammad (PBUH) compared to other Messengers has thus become clear to you. God distinguished him with sciences that were not gathered in anyone else. Among them is that He granted him all types of revelation (الوحي), so He revealed to him through everything that is called revelation, such as glad tidings (المبشرات), descent upon the hearts and ears, the state of ascension (العروج) and non-ascension, and other things. He distinguished him with the universality of all sciences of spiritual states (علوم الأحوال), so He granted him the knowledge of every state and in every state, by direct experience (ذوقا), because He sent him to all mankind, and their states are diverse. His message must therefore encompass the knowledge of all states. God distinguished him with the knowledge of reviving the dead, both conceptually (معنى) and physically (حسا). Thus, he attained the knowledge of spiritual life, which is the life of the sciences, and physical life, which is mentioned in the story of Abraham (peace be upon him), as instruction and notification for the Messenger of God (PBUH), which is His saying: <<نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ وَجَاءَكَ فِي هَذِهِ الْحَقُّ>> (And all we relate to you of the news of the messengers is to strengthen thereby your heart. And in this [Surah] has come to you the truth). He was distinguished by the knowledge of all Laws (الشرائع), so He clarified for him the laws of the predecessors and commanded him to be guided by their guidance. He was distinguished by a Law that no one else possessed, including what we mentioned in the six distinctions granted exclusively to him. These are four ranks (منازل) that no other prophet (peace be upon them) entered.\n\nThis is the station (منزل) of Muhammad (PBUH). I have mentioned what God facilitated upon my tongue concerning it. Let us mention the sciences contained within his station. Among them is the science of the veil (علم الحجاب)—I mean the veil of denial (حجاب الجحد) and the veil of wisdom (حجاب الحكمة). And the science of the separator (علم الفارق) by which the paths were designated, such as His saying: <<لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا وَلَوْ شَاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً وَاحِدَةً>> (For each of you We prescribed a law and a method. And had Allah willed, He would have made you one community). Are they today, by the universality of the Messengers’ mission, one community or not? Is God’s ruling upon the People of the Book (أصحاب الكتب) with the *jizya* (tribute) and their retention of their religion a Law from God for them through the tongue of Muhammad (PBUH)? Will this benefit them, provided they pay the *jizya* willingly, from the strength of the collectors and their own humility? They have done what they were obligated to do, and this was their share of the Law. Thus, their retention of their law is a Muhammadan Law for them, and they are made happy by it. Therefore, the accountability of those among them who fall short in the Law they follow is like that of other sinners who did not act upon everything contained in their Law, even though they believe in it. This is a strange science (علم غريب); I do not know anyone who has tasted it through the unveiling of illumination (فتوح المكاشفة). It is one of the sciences of secrets (علوم الأسرار) that the People of God (أهل الله) have guarded and preserved.\n\nIt contains the science of what bewildered the universes in their bewilderment—what was, was. It contains the science of absolute and restricted faith (الايمان المطلق والمقيد). It contains the science of what corrupts and what rectifies the prescribed action. It contains the science of the permeation of the Real (الحق) in rulings despite their differences, and that all of them are truth from the Lord. It contains the science of expiations (الكفارات). It contains the science of what rectifies the states of creation (الخلق). It contains the science of what is falsehood (الباطل) and what is truth (الحق)—are they existential matters or not existential? It contains the science of partnership in following and what the end of every follower leads to—is their goal one thing or diverse? It contains the science of those for whom parables are set forth and those for whom they are not. It contains the science of Divine compulsion (القهر الإلهي) at the hands of the universes. And the saying of Abu Yazid al-Bastami is more severe in this station. It contains the science of relief after hardship (الفرج بعد الشدة)—and whether it is characteristic of relief that it only occurs after hardship or not. It contains the science of the types of trial (الابتلاء). It contains the science of the quality that removes bewilderment from the one who possesses it, and the clarification of that. And the science of the Divine Breaths (الأنفاس الإلهية). And the science of journeys (الأسفار) about the results of journeys. And the science of admonitions (المواعظ). And the science of the dominance (الغلبة) in which there is no Divine victory—by what were they dominant? It contains the science of the difference between the knowledge of the Eye (علم العين) and the knowledge of the Proof (علم الدليل), and whether the latter can take the place of the former or not. It contains the science of the types of adornment (الزينة) in the cosmos. It contains the science of the degrees of the sciences (مراتب العلوم) and their details. It contains the science of the preceding decree (القضاء السابق) from the knowledge of the deniers of destiny (نفاة القدر). It contains the science of sealing (الطبع), stamping (الختم), locking (القفل), and concealment (الكن). And what is the blindness of the eyes and the blindness of the insights (عمى البصائر)? And why is the blindness of the hearts specific to the state of turning away (الصدور), which is the turning back from the Real? Is it the turning away that results from a preceding arrival, or is it the turning away of a possible existent from a necessary existent, or is it the turning away of a locus (محل) without a quality, so that its blindness is due to its being in the locus? If it leaves the locus with its gaze, and an opening is made for it to look through, its blindness is removed. It contains the designation of the sciences of increase (علوم المزيد), for they differ according to the nature of what the increase occurs upon. It contains the science of signs (الآيات) and indications (العلامات) concerning events (الكوائن). It contains the science of the Unity (توحيد) of the Divine Degree (المرتبة الإلهية)—that only one attained it. It contains the science of the veils (الستور) and their types that are drawn over us so that we may be veiled from the perception of others. And what are the veils that are drawn between us and the one whose vision we seek, so that we do not see him? It contains the science of abiding in the station (المنزل) and turning within it, not away from it. It contains the science of providence (العناية) for some people and its abandonment regarding others. It contains what resolutions (العزائم) produce in good and evil. It contains the science of good and evils (الشرور). It contains the science of the All-Merciful Relationship (النسب الرحماني). It contains the science of what faith benefits and what it does not benefit, as He said: <<أُولَئِكَ هُمُ الْكَافِرُونَ حَقًّا>> (Those are the disbelievers, truly). It contains the science of Divine distance and proximity (البعد والقرب الإلهي). It contains the science of what contemplation (التفكر) leads to. It contains the science of return (الرجعة)—from whom and to whom? It contains the science of what conjecture (الظن) affects and what it does not affect. It contains the science of Witnessing (المشاهدة) and its connection to the Will (المشيئة), along with the preparedness of the locus (المحل) to accept it. And what if there is prevention, yet the locus is receptive? What is this preventing Will? It contains the science of fairness in recompense and favor. It contains the science of the difference between opposites (الأضداد), likenesses (الأمثال), and non-likenesses, and other sciences besides these.\n\nI do not present these sciences with the intention of enumeration, despite my knowledge of them, but rather to draw attention to what is contained within the station, or some of what is contained within it, according to what occurs to me. Sometimes I present this by way of enumeration, such that I do not leave any science in the station without drawing attention to it, and sometimes I fall short of that. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو سینتیس: محمد صلی اللہ علیہ وسلم کے منزل (Manzil) کی معرفت میں، عالم کے ایک حصے کے ساتھ، اور یہ منزل حضرت موسیٰ علیہ السلام کی حضوری (Ḥaḍrah) سے متعلق ہے۔\n\nخبردار! اللہ ہی کے لیے ہے جو کچھ کائنات میں ہے،\nہستی (Al-Wujūd) میں تضاد کے احکام کی صورت میں۔\n\nپس ان میں سے کوئی فرمانبردار ہے، کوئی نافرمان، کوئی عالم ہے، کوئی جاہل،\nنزول اور صعود (اُترنے اور چڑھنے) کے اعتبار سے۔\n\nاور ان میں سے کوئی غیوب میں متحقق ہوا،\nاور ان میں سے کوئی شہود (Ash-Shuhūd) میں متحقق ہوا۔\n\nپس کثرت ظاہر ہوتی ہے، جبکہ اس کی اصل (عین)\nدلائل اور معاہدوں کے ذریعے واحد ہے۔\n\nپس پاک ہے وہ ذات جو الوہیت اور عبودیت کے تمام اوصاف کے ساتھ مراد ہے۔\n\nاور پاک ہے وہ ذات جو ہر شے پر محیط ہے،\nاور معرفتوں (Al-Ma‘rifah) میں مزید (اضافے) کے ساتھ موصوف ہے۔\n\n### [یوم الزور العام الأعظم (Yawm az-Zūr al-‘Āmm al-A‘ẓam) کے دن کا دیدار]\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"میں قیامت کے دن لوگوں کا سردار ہوں،\" اور آپ نے اس کی وجہ اپنے کمال سے بیان کی اور فرمایا: \"اگر موسیٰ زندہ ہوتے تو ان کے لیے میری پیروی کے سوا کوئی چارہ نہ ہوتا۔\"\n\nیہ آپ کی رسالت کے عموم اور شریعت کے شمول کی وجہ سے ہے۔ پس آپ صلی اللہ علیہ وسلم کو ایسی چیزوں کے ساتھ خاص کیا گیا جو آپ سے پہلے کسی نبی کو نہیں دی گئیں، اور جس چیز کے ساتھ کسی نبی کو خاص کیا گیا وہ محمد صلی اللہ علیہ وسلم کے لیے بھی تھی۔ کیونکہ آپ کو جوامع الکلم (جامع کلمات) عطا کیے گئے، اور آپ نے فرمایا: \"میں اس وقت بھی نبی تھا جب آدم مٹی اور پانی کے درمیان تھے۔\"\n\nدوسرے انبیاء صرف اپنی نبوت کے حال اور اپنی رسالت کے زمانے میں نبی تھے، لیکن ہم اس باب میں آپ کے منزل (Manzil) اور آپ کی منزلت (Manzilah) کا ذکر کریں گے۔ منزل (Manzil) یوم الزور العام الأعظم (Yawm az-Zūr al-‘Āmm al-A‘ẓam) کے دن ظہور الٰہی (At-Tajallī) اور دیدار کے وقت بساط حق (Ḥaqq) اور مقعد صدق (سچائی کی جگہ) پر ظاہر ہوتا ہے، اور آپ کا منزل (Manzil) بصارت اور شہود (Ash-Shuhūd) سے معلوم ہوتا ہے۔ جبکہ آپ کی منزلت (Manzilah) نفس حق (Nafs al-Ḥaqq) میں ایک منزلت (Manzilah) اور اس کی طرف سے ایک مرتبہ ہے، اور یہ صرف اللہ کے بتانے سے ہی معلوم ہو سکتی ہے۔ آپ کے لیے مقام محمود ہے، اور وہ فرشتوں اور ان سے نیچے والوں کے لیے شفاعت کا دروازہ کھولنا ہے۔ شفاعت میں آپ کو اولیت حاصل ہے، اور آپ کے لیے وسیلہ (Al-Wasīlah) ہے، اور منازل (Manāzil) میں اس سے اعلیٰ کوئی منزل (Manzil) نہیں ہے۔ محمد صلی اللہ علیہ وسلم اسے اپنی امت کے سوال کرنے پر حاصل کریں گے، اس سعادت کے بدلے میں جو انہوں نے آپ کے ذریعے حاصل کی، کیونکہ آپ نے ان کے لیے اس کا راستہ واضح کیا اور انہوں نے اس کی پیروی کی۔\n\n### [بدبختوں کے اعمال مجسم اور خوش بختوں کے اعمال بھی اسی طرح مجسم]\n\nجان لو کہ جو اس منزل (Manzil) میں داخل ہوتا ہے، وہ اس میں ایسے عجائبات دیکھتا ہے جو کسی اور میں نہیں دیکھتا۔ ان میں سے یہ ہے کہ وہ بدبختوں کے اعمال کو مجسم دیکھتا ہے، اور اسی طرح خوش بختوں کے اعمال کو بھی مجسم، کھڑی ہوئی صورتوں کی شکل میں دیکھتا ہے جو اپنے خالق کے وجود کو سمجھتی ہیں۔ اللہ نے ان صورتوں کے نفوس میں ان اسباب کی طلب پیدا کر دی ہے جن سے وہ وجود میں آئیں، اور وہ اسباب ان کے عامل (عمل کرنے والے) ہیں۔ وہ اپنی طلب میں سرگرداں رہتے ہیں۔\n\nخوش بختوں کے اعمال اپنے دائیں جانب ایک راستہ دیکھتے ہیں جس پر وہ چلتے ہیں، اور وہ راستہ انہیں ان کے ساتھیوں یعنی خوش بختوں کے مشاہدے کی طرف لے جاتا ہے۔ پس وہ ایک دوسرے کو پہچانتے ہیں اور سوال کرتے ہیں۔ عامل (عمل کرنے والے) انہیں کامیابی اور نجات کی سواریاں بنا لیتے ہیں جو انہیں رحمت کے ٹھکانے تک پہنچاتی ہیں۔\n\nجبکہ بدبختوں کے اعمال کے لیے کئی راستے کھڑے ہوتے ہیں جو شاخ در شاخ اور ایک دوسرے میں داخل ہوتے ہیں، وہ نہیں جانتے کہ کون سا راستہ انہیں ان کے ساتھیوں تک لے جائے گا۔ پس وہ حیران رہتے ہیں اور ہدایت نہیں پاتے۔ یہ بدبختوں پر اللہ کی رحمت میں سے ہے۔ جب ان کے اعمال حیران ہو جاتے ہیں تو وہ عبادت اور ذکر کے ذریعے اللہ کی طرف رجوع کرتے ہیں۔ وہ ان راستوں میں بکھر جاتے ہیں۔ ان میں سے کوئی ایسا ہے جو ابد الآباد تک اپنے ساتھی تک نہیں پہنچ پاتا، اور ان میں سے کوئی اپنے ساتھی تک پہنچ جاتا ہے، اس کا مشاہدہ کرتا ہے اور اسے پہچانتا ہے۔ عامل بھی اسے پہچان لیتا ہے، اور اس کا وجود اس کے لیے ایک اتفاق ہوتا ہے۔ پس وہ اس سے چمٹ جاتا ہے اور کہتا ہے: \"مجھے اٹھا لو، تم نے مجھے اپنی تلاش میں تھکا دیا ہے۔\" پس عامل اسے اٹھانے پر مجبور ہو جاتا ہے یہاں تک کہ اللہ کی رحمت اسے اپنی لپیٹ میں لے لیتی ہے۔\n\nاور ان صورتوں کے ٹھہرنے کی جگہ کے پہلو میں دو واضح راستے ہیں۔ ایک راستہ جس کی انتہا حق الوجود (Ḥaqq al-Wujūd) (حقیقی ہستی) ہے، اور ایک راستہ جس کی کوئی انتہا نہیں، کیونکہ وہ سالک کو عدم (Al-‘Adam) (نیستی) کی طرف نکال دیتا ہے، پس وہ اس میں اپنی انتہا پر نہیں ٹھہرتا، کیونکہ عدم (Al-‘Adam) کسی حد سے منضبط نہیں ہوتا کہ اس سے مقید ہو جائے، برخلاف حق الوجود (Ḥaqq al-Wujūd) کے، جو مقید ہوتا ہے اگرچہ مطلق ہو۔ پس اس کا اطلاق (مطلق ہونا) نفس الامر میں ایک تقیید (قید) ہے، کیونکہ وہ اپنے اطلاق کے ذریعے مقید وجود سے ممتاز ہے۔ پس وہ اپنے عین اطلاق میں مقید ہے۔ اور ایک تیسرا راستہ ان دونوں راستوں کے درمیان ہے جو برزخی (Barzakhī) ہے، جس کی انتہا نہ وجود (Al-Wujūd) سے متصف ہوتی ہے اور نہ عدم (Al-‘Adam) سے، جیسے متکلمین کے علم میں احوال (States) ہیں۔\n\nوہ راستہ جس کی انتہا حق الوجود (Ḥaqq al-Wujūd) ہے، اس پر موحدین، مومنین، مشرکین، کافرین اور تمام وجودی عقائد والے چلتے ہیں۔ جبکہ دوسرا راستہ، اس پر صرف معطلہ (منکرینِ صفات) چلتے ہیں، پس وہ انہیں کسی انتہا تک نہیں پہنچاتا۔ اور برزخی (Barzakhī) راستہ، اس میں صرف وہ علماء باللہ (اللہ کے عالم) چلتے ہیں جنہیں ذات حق (Al-Ḥaqq) نے ثابت کیا اور عین اثبات میں انہیں مٹا دیا (محو کر دیا)، اور ان کی فنا (Al-Fanā’) کی حالت میں انہیں باقی رکھا (Al-Baqā’)। یہ وہ لوگ ہیں جو نہ مرتے ہیں اور نہ زندہ ہوتے ہیں، یہاں تک کہ اللہ بندوں کے درمیان فیصلہ کر دے۔ پس وہ دائیں جانب سے حق الوجود (Ḥaqq al-Wujūd) کے راستے کی طرف جاتے ہیں۔ انہوں نے اس راستے کی حقیقت سے ایک صفت حاصل کی ہے اور اس سے ایک ہیئت حاصل کی ہے جو حق الوجود (Ḥaqq al-Wujūd) کے منزل (Manzil) میں ان پر ظاہر ہوتی ہے، جس سے وہ ایک دوسرے کو پہچانتے ہیں، اور ان دونوں راستوں میں سے کوئی بھی انہیں نہیں پہچانتا۔ یہ ایک مثال ہے جو اللہ نے اہل اللہ کے لیے بیان کی ہے تاکہ وہ اس سے ہدایت اور حیرت، اور ہدایت یافتہ اور گمراہوں کے مراتب کو جان لیں۔\n\nاللہ نے ان کے لیے ایک نور، بلکہ انوار، بنائے ہیں جن کے ذریعے وہ اپنی طبیعت کے خشکی کی تاریکیوں میں، اور اپنے افکار کے سمندر کی تاریکیوں میں، اور اپنے ناطق نفوس کی تاریکیوں میں ہدایت پاتے ہیں، ان کی نشأت میں جو کچھ ہے اس کے اعتبار سے، کیونکہ وہ خالص نور اور محض عنصری طبیعت کے درمیان پیدا ہوئے تھے۔ اور وہ انوار جو ان میں رکھے گئے ہیں، وہ اسماء الٰہیہ میں سے ہیں۔ پس جو شخص ان کو جانتا ہے اور ان کے ذریعے دیکھتا ہے، اس حیثیت سے کہ وہ اس کے لیے موجود ہوئے ہیں، وہ ان کے ذریعے امور کے علم اور کشف (Al-Kashf) تک پہنچ جاتا ہے۔ اور جس نے انہیں صرف انوار کے طور پر لیا اور یہ نہ جانا کہ وہ ہدایت کے لیے وضع کیے گئے ہیں، اور انہیں صرف زینت سمجھا، جیسا کہ عام لوگ آسمان کے ستاروں کو خاص زینت کے طور پر دیکھتے ہیں، تو اسے اس سے کچھ حاصل نہیں ہوتا سوائے اس کے جو اس نے دیکھا۔ اور علماء انہیں ان کے منازل (Manāzil)، ان کی سیر اور ان کے افلاک میں ان کی سیاحت کے اعتبار سے دیکھتے ہیں کہ وہ ہدایت کے لیے وضع کیے گئے ہیں۔ پس وہ انہیں ان راستوں پر اپنی سیر میں نشانیاں بنا لیتے ہیں جو انہیں اس علم تک پہنچاتے ہیں جس کی طرف ذات حق (Al-Ḥaqq) نے انہیں بلایا ہے، یا اس سعادت تک جو خاص کامیابی ہے۔\n\n### [یہ کہ اللہ نے محمد صلی اللہ علیہ وسلم کے منزل (Manzil) کو سیادت (سرداری) بنایا]\n\nجان لو کہ جب اللہ نے محمد صلی اللہ علیہ وسلم کے منزل (Manzil) کو سیادت (سرداری) بنایا، تو آپ سید (سردار) تھے اور آپ کے سوا سب رعایا (سوقہ) تھے۔ ہم نے جان لیا کہ کوئی آپ کا مقابلہ نہیں کر سکتا، کیونکہ رعایا اپنے بادشاہوں کا مقابلہ نہیں کرتی۔ پس آپ کے لیے ایک خاص منزل (Manzil) ہے اور رعایا کے لیے ایک منزل (Manzil) ہے۔ اور جب آپ کو یہ منزلت (Manzilah) اس وقت عطا کی گئی جب آدم پانی اور مٹی کے درمیان تھے، تو ہم نے جان لیا کہ آپ ہر اس انسان کامل (Al-Insān al-Kāmil) کے لیے مددگار (ممد) ہیں جو کسی الٰہی یا حکمی ناموس سے موصوف ہے۔ اس کا پہلا ظہور آدم علیہ السلام میں ہوا، جب اللہ نے انہیں محمد صلی اللہ علیہ وسلم کا خلیفہ بنایا۔ پس آپ نے انہیں جوامع الکلم (Jawāmi‘ al-Kalim) کے مقام سے تمام اسماء کی مدد فراہم کی جو محمد صلی اللہ علیہ وسلم کے لیے ہیں۔ پس وہ تمام اسماء کے علم کے ساتھ اس پر غالب آئے جس نے ان کے وجود پر اعتراض کیا اور خود کو ان پر ترجیح دی۔ پھر زمین میں خلافتیں (Khilāfah) یکے بعد دیگرے آئیں، یہاں تک کہ آپ کے جسمانی صورت کے وجود کا وقت آیا تاکہ آپ کی دونوں نشأتوں کے اجتماع کے ذریعے آپ کی منزلت (Manzilah) کا حکم ظاہر ہو۔ جب آپ ظاہر ہوئے تو آپ سورج کی مانند تھے، ہر نور آپ کے نور میں شامل ہو گیا۔ آپ کی شریعتوں میں سے جو آپ نے اپنے نائبین کے ذریعے بھیجیں، جو باقی رہا وہ باقی رہا اور جو منسوخ ہوا وہ منسوخ ہو گیا۔\n\nآپ کی امت کے لیے آپ کی توجہ آپ کی حاضری اور ان میں آپ کے ظہور کی وجہ سے پاکیزہ ہو گئی، اگرچہ تمام انسانی اور ناری عالم آپ کی امت ہے، لیکن ان (مسلمانوں) کو ایک خاص وصف حاصل ہے۔ پس اللہ نے انہیں لوگوں کے لیے نکالی گئی بہترین امت بنایا۔ یہ فضیلت آپ کے دونوں نشأتوں کے ساتھ ظہور نے عطا کی۔ اس امت کی دوسری امتوں پر فضیلت میں سے یہ ہے کہ اللہ نے اسے آپ کے ظہور سے پہلے عالم میں آپ کے خلفاء کی منزلت (Manzilah) پر اتارا، کیونکہ اللہ نے انہیں تشریع (قانون سازی) عطا کی تھی۔ پس اس امت کو احکام کے نفاذ میں اجتہاد (Ijtihād) کی اجازت دی، اور انہیں حکم دیا کہ وہ اس کے مطابق فیصلہ کریں جس تک ان کا اجتہاد انہیں پہنچائے۔\n\nپس اللہ نے انہیں تشریع عطا کی، اور وہ اس میں انبیاء علیہم السلام کے مقامات تک پہنچ گئے، اور انہیں ان کا وارث بنایا، کیونکہ متاخر (بعد میں آنے والا) متقدم (پہلے آنے والے) کا وارث ہوتا ہے، یہ ایک ضرورت ہے۔ پس وہ بصیرت کے ساتھ اللہ کی طرف بلاتے ہیں، جیسا کہ رسولوں نے بلایا۔ محمد صلی اللہ علیہ وسلم نے ان کی عصمت کی خبر دی اس چیز میں جس کی طرف وہ بلاتے ہیں۔ پس ان میں سے جو مجتہدین (Mujtahidīn) کے حکم میں خطا کرتا ہے، وہ حق سے خطا کرنے والا نہیں ہے، کیونکہ جو کچھ وہ لایا ہے وہ حق ہے۔ اگر وہ کسی ایسے حکم میں خطا کرتا ہے جو محمد صلی اللہ علیہ وسلم کے لیے پہلے سے حکم کیا جا چکا تھا اور وہ اس تک نہیں پہنچا، تو اس کے لیے ایک اجر ہے، اور وہ اجتہاد کا اجر ہے۔ اور اگر وہ اپنے اجتہاد سے پہلے کے حکم کو پا لیتا ہے، تو اس کے لیے دو اجر ہیں: اجتہاد کا اجر اور درستگی کا اجر۔ اور اگر درستگی پانے والا مجتہدین میں اپنی ذات اور دوسروں کے نزدیک نامعلوم ہو، تو وہ اللہ کے نزدیک نامعلوم نہیں ہے۔\n\nاور جو بھی محمد صلی اللہ علیہ وسلم کے ظہور کے بعد اس امت کے زمانے میں داخل ہوا، خواہ وہ انبیاء ہوں یا پہلے کے خلفاء، وہ عالم میں صرف اسی چیز کے مطابق حکم کرتے ہیں جو محمد صلی اللہ علیہ وسلم نے اس امت میں مشروع کیا۔ اور وہ مجتہدین میں ممتاز ہو گئے اور ان کے گروہ میں شامل ہو گئے، جبکہ ان پر پہلی خلافت کا منزلت (Manzilah) باقی رہا۔ پس ان کے لیے دو حکم ہیں، اور اس کے ذریعے قیامت میں ان کا ظہور ہو گا، جو یہاں ان کا ظہور نہیں ہے۔ اور یوم الزور الأعظم (Yawm az-Zūr al-A‘ẓam) کے دن محمد صلی اللہ علیہ وسلم کا منزل (Manzil) رحمن کے دائیں جانب ہو گا، اس صورت کے اعتبار سے جس میں وہ اپنے عرش پر ظہور الٰہی (At-Tajallī) فرمائے گا۔ اور قیامت کے دن آپ کا منزل (Manzil) رحمن کے دائیں جانب نہیں ہو گا، بلکہ حکم عدل (عادل حاکم) کے سامنے ہو گا تاکہ عالم میں الٰہی احکام اور اوامر کو نافذ کیا جا سکے۔ پس اس مقام پر سب آپ ہی سے لیتے ہیں۔ اور آپ سراپا وجہ (توجہ) ہیں، جو تمام جہتوں سے نظر آتے ہیں۔ اور آپ کے لیے ہر جانب سے اللہ تعالیٰ کی طرف سے ایک اطلاع ہے جسے آپ سے سمجھا جاتا ہے۔ وہ اسے زبان کے طور پر دیکھتے ہیں اور اسے آواز اور حرف کے طور پر سنتے ہیں۔ اور جنتوں میں آپ کی منزلت (Manzilah) وسیلہ (Al-Wasīlah) ہے، جس سے تمام جنتیں شاخ در شاخ نکلتی ہیں۔ اور یہ جنت عدن، دارالمقامہ (ہمیشگی کا گھر) میں ہے۔ اور اس کی ایک شاخ ان جنتوں میں سے ہر جنت میں ہے۔ اس شاخ سے آپ صلی اللہ علیہ وسلم اس جنت کے رہنے والوں کے لیے ظاہر ہوتے ہیں، اور یہ ہر جنت میں سب سے عظیم منزلت (Manzilah) ہے۔ یہ تمام منازل (Manāzil) حسی ہیں، معنوی نہیں۔ اور معنوی منزلت (Manzilah) صرف آپ کی نفس موجد (وجود بخشنے والے نفس) میں ہے، اور وہ اللہ تعالیٰ ہے۔ اور یہ صرف آپ کے ساتھ خاص نہیں، بلکہ ہر منزلت (Manzilah) صرف اللہ کے نفس میں ہوتی ہے جو رحمن ہے۔ اور منازل (Manāzil) محسوس اور محدود ہیں، جو جمع منزل (Manzil) ہیں نہ کہ جمع منزلت (Manzilah)۔ پس یہ جان لو، کیونکہ یہ اللہ تعالیٰ کی معرفت (Al-Ma‘rifah) کا مغز ہے۔ اور علوم میں آپ کی منزلت (Manzilah) یہ ہے کہ آپ کو اللہ کے تمام متقدمین اور متاخرین علماء باللہ کے علم پر احاطہ حاصل ہے۔ اور آپ کا اور آپ کے پیروکاروں کا ہر منزل (Manzil) الٰہی خوشبو سے معطر ہے، جس میں کائنات کے ہاتھوں نے نہ تو دخل دیا اور نہ ہی اسے استعمال کیا۔\n\n### [یہ کہ محمد صلی اللہ علیہ وسلم کے کمال میں سے ہے کہ آپ کو چھ چیزوں سے خاص کیا گیا جو آپ سے پہلے کسی نبی کو نہیں دی گئیں]\n\nجان لو کہ آپ صلی اللہ علیہ وسلم کے کمال میں سے ہے کہ آپ کو چھ چیزوں سے خاص کیا گیا جو آپ سے پہلے کسی نبی کو نہیں دی گئیں۔ اور چھ سب سے کامل عدد ہے۔ اور اشکال میں کوئی ایسی شکل نہیں ہے جس میں زاویے ہوں اور جب ان کے مماثل زاویے ملائے جائیں تو ان کے درمیان کوئی خلا نہ ہو، سوائے چھ کے۔ اور اسی کے ذریعے اللہ نے شہد کی مکھی کو وحی کی، جیسا کہ اس کے قول میں ہے: **أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ** (کہ پہاڑوں میں، درختوں میں اور ان چھپروں میں جو لوگ لگاتے ہیں، گھر بناؤ)۔ اور اللہ نے اسے اس کے کام کی صفت کی وحی کی، تو اس نے اسے مسدس (چھ کونوں والا) بنایا۔\n\nآپ نے خبر دی کہ آپ کو خزانوں کی چابیاں دی گئیں، اور یہ عالم کی انواع کے خزانے ہیں، تاکہ آپ ان کے لیے ان کی اپنی طلب کے مطابق نکالیں، جب ہم نے جان لیا کہ آپ سید (سردار) ہیں۔ اور جس نے خزانوں کی تعیین زمین سے کی، تو زمین میں صرف معدنیات اور نباتات کے خزانے ہیں، اور کچھ نہیں۔ کیونکہ حیوان اپنی نشوونما کے لحاظ سے نبات (پودا) ہے۔ اللہ تعالیٰ فرماتا ہے: **وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا** (اور اللہ نے تمہیں زمین سے ایک پودے کی طرح اگایا)۔ پس اللہ نے ہمیں خبر دی کہ ہم زمین کی نباتات میں سے ہیں۔ اور آپ صلی اللہ علیہ وسلم کو یہ چابیاں اس وقت تک نہیں دی گئیں جب تک آپ میں وہ وصف نہ پایا گیا جس سے آپ اس کے مستحق ہوں۔ اسی لیے یوسف علیہ السلام نے مصر کے بادشاہ سے درخواست کی کہ وہ انہیں زمین کے خزانوں پر مقرر کر دے، کیونکہ وہ حفیظ (نگہبان) اور علیم (جاننے والے) تھے۔ تاکہ سب ان کے محتاج ہوں اور ان کی سیادت (سرداری) ان پر درست ہو جائے۔ اسی لیے آپ نے اس صفت کی خبر دی جس سے یہ مقام حاصل کرنے والا مستحق ہوتا ہے، پس فرمایا: **إِنِّي حَفِيظٌ عَلِيمٌ** (میں یقیناً نگہبان، جاننے والا ہوں)۔ حفیظ (نگہبان) ان پر، تاکہ ہم ان میں سے صرف معلوم مقدار میں ہی نکالیں، جیسا کہ اللہ سبحانہ و تعالیٰ فرماتا ہے: **وَإِنْ مِنْ شَيْءٍ إِلَّا عِنْدَنَا خَزَائِنُهُ وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ** (اور کوئی چیز ایسی نہیں جس کے خزانے ہمارے پاس نہ ہوں، اور ہم اسے صرف معلوم مقدار میں ہی نازل کرتے ہیں)۔ پس جب یہ صفت اس شخص میں ہو جس کے پاس ان کی کنجیاں ہوں، پھر آپ نے اپنے قول **حَفِيظٌ عَلِيمٌ** کے بعد خبر دی کہ وہ محتاجوں کی حاجت کو جاننے والا ہے، ان خزانوں میں جو کچھ ذخیرہ کیا گیا ہے جس سے ان کا قیام ہے، اور حاجت کی مقدار کو جاننے والا ہے۔ پس جب آپ صلی اللہ علیہ وسلم کو زمین کے خزانوں کی چابیاں دی گئیں، تو ہم نے جان لیا کہ آپ حفیظ (نگہبان) اور علیم (جاننے والے) ہیں۔ پس عالم میں جو بھی رزق ظاہر ہوتا ہے، الٰہی اسم اسے محمد صلی اللہ علیہ وسلم کے حکم کے بغیر نہیں دیتا، جن کے ہاتھ میں چابیاں ہیں۔ جیسا کہ ذات حق (Al-Ḥaqq) تعالیٰ غیب کی چابیوں کے ساتھ خاص ہے، جسے صرف وہی جانتا ہے۔ اور اس سید (سردار) کو خزانوں کی چابیاں عطا کرنے کے ذریعے اختصاص کی منزلت (Manzilah) دی گئی۔\n\nاور دوسری خصلت یہ ہے کہ آپ کو جوامع الکلم (Jawāmi‘ al-Kalim) عطا کیے گئے۔ اور کلم، کلمہ کی جمع ہے، اور اللہ کے کلمات ختم ہونے والے نہیں ہیں۔ پس آپ کو اس علم سے نوازا گیا جو لامتناہی ہے۔ پس آپ نے اس علم کو جانا جو وجود (Al-Wujūd) نے محدود کر دیا، اور اس علم کو بھی جانا جو وجود میں داخل نہیں ہوا اور وہ لامتناہی ہے۔ پس آپ نے معلومات کی حقائق کا علمی احاطہ کیا، اور یہ ایک الٰہی صفت ہے جو آپ کے سوا کسی اور کو حاصل نہیں ہوئی۔ پس آپ سے کلمہ، کلمات کی صورت میں ہے، جیسے الٰہی امر جو ایک کلمہ ہے، **كَلَمْحٍ بِالْبَصَرِ** (جیسے پلک جھپکنا)۔ اور حسی تشبیہ میں اس سے زیادہ عظیم اور اس سے زیادہ حقدار کوئی تشبیہ نہیں ہے۔ اور جب آپ کو جوامع الکلم (Jawāmi‘ al-Kalim) کا علم ہوا، تو آپ کو قرآن کے ذریعے اعجاز عطا کیا گیا، جو اللہ کا کلمہ ہے، اور آپ اس کے ذریعے اللہ کی طرف سے ترجمانی کرنے والے ہیں۔ پس اعجاز اس ترجمانی میں واقع ہوا جو آپ کے لیے ہے۔ کیونکہ مواد سے مجرد معانی کے ذریعے اعجاز کا تصور نہیں کیا جا سکتا۔ بلکہ اعجاز ان معانی کو حروف کے نظم سے قائم کلمات کی صورتوں کے ساتھ جوڑنے میں ہے۔ پس آپ ذات حق (Al-Ḥaqq) کی زبان، اس کا کان اور اس کی آنکھ ہیں۔ اور یہ اعلیٰ ترین الٰہی مراتب ہیں۔ اور اس سے نیچے وہ ہے جس کا کان، آنکھ اور زبان ذات حق (Al-Ḥaqq) ہو، تو وہ اپنے بندے کی طرف سے ترجمانی کرنے والا ہوتا ہے، جیسا کہ اللہ تعالیٰ نے قرآن میں ہم سے پہلے والوں کے احوال اور ان کے اقوال کی ترجمانی کی۔ پس اس میں وہ شرف نہیں ہے، کیونکہ وہ اپنے اہل اور اپنے مقربین جیسے فرشتوں کے اقوال کی ترجمانی کرتا ہے، اور وہ ابلیس کی بھی ترجمانی کرتا ہے، اس کے مایوس ہونے، شیطنت اور دوری کے باوجود، اس کے قول کے ذریعے، لیکن اللہ کی طرف سے ترجمانی صرف وہی کرتا ہے جسے وہ اختصاص حاصل ہو جس سے بڑھ کر کوئی اختصاص نہ ہو۔\n\nاور تیسری خصلت یہ ہے کہ آپ کی بعثت تمام لوگوں کے لیے عام ہے، جو کفت (Kaft) سے ہے، یعنی ضم کرنا (شامل کرنا)۔ **أَلَمْ نَجْعَلِ الْأَرْضَ كِفَاتًا** (کیا ہم نے زمین کو سمیٹنے والی نہیں بنایا؟) یعنی وہ زندوں کو اپنی پشت پر اور مردوں کو اپنے پیٹ میں سمیٹتی ہے۔ اسی طرح آپ کی شریعت نے تمام لوگوں کو سمیٹ لیا۔ پس جو بھی آپ کے بارے میں سنتا ہے، اس پر ایمان لانا لازم ہو جاتا ہے۔ اور جب جنوں نے قرآن کو سنا تو انہوں نے اپنی قوم سے کہا: **يَا قَوْمَنَا أَجِيبُوا دَاعِيَ اللَّهِ وَآمِنُوا بِهِ يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُجِرْكُمْ مِنْ عَذَابٍ أَلِيمٍ** (اے ہماری قوم! اللہ کے بلانے والے کی بات مانو اور اس پر ایمان لاؤ، وہ تمہارے گناہ بخش دے گا اور تمہیں دردناک عذاب سے پناہ دے گا)۔ اور **وَمَنْ لَا يُجِبْ دَاعِيَ اللَّهِ فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ وَلَيْسَ لَهُ مِنْ دُونِهِ أَوْلِيَاءُ أُولَئِكَ فِي ضَلَالٍ مُبِينٍ** (اور جو اللہ کے بلانے والے کی بات نہیں مانے گا، وہ زمین میں عاجز کرنے والا نہیں ہے، اور اس کے لیے اللہ کے سوا کوئی مددگار نہیں، وہ لوگ کھلی گمراہی میں ہیں)۔ پس اللہ نے ان کے قول **فَلَيْسَ بِمُعْجِزٍ فِي الْأَرْضِ** کے ذریعے جنوں کی طرف سے خبر دی، اور اللہ کا قول **وَلَيْسَ لَهُ** سے **مُبِينٍ** تک۔ پس آپ کی شریعت نے جنوں اور انسانوں کو شامل کر لیا۔ پس آپ کی شریعت انسانوں اور جنوں کے لیے عام ہوئی، اور آپ کی رحمت عالم پر عام ہوئی جس کے ساتھ آپ کو بھیجا گیا، پس فرمایا: **وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ** (اور ہم نے آپ کو تمام جہانوں کے لیے رحمت بنا کر ہی بھیجا ہے)۔ پس اللہ نے خبر دی کہ اس نے آپ کو عالم پر رحم کرنے کے لیے بھیجا، اور کسی عالم کو دوسرے عالم سے خاص نہیں کیا۔ پس جب آپ ہر وہ چیز لائے جو عالم کے ہر صنف کو راضی کرتی ہے، سوائے ان چند لوگوں کے جو آپ کی شریعت کے حکم کے مخاطب ہیں، تو آپ نے ان پر رحم کیا اور اس رحمت کو قائم کیا جس کے ساتھ آپ کو بھیجا گیا۔ بلکہ ہم کہتے ہیں کہ آپ اللہ کا حکم لائے، اور اللہ کے حکم سے عالم کا ہر صنف بلا شک راضی ہوتا ہے، کیونکہ تمام عالم اس کی حمد کے ساتھ تسبیح کرتا ہے، پس وہ اس حکم سے راضی ہے جو اس عام دعوت والے رسول کے ذریعے آیا ہے۔ سوائے اس کے کہ لوگوں میں سے کوئی ایسا ہے جو محکوم بہ (جس پر حکم لگایا گیا) سے راضی نہیں، اگرچہ وہ حکم سے راضی ہے۔ اور یہ واقعہ صرف انسانوں میں خاص ہے۔ جہاں تک جنوں کا تعلق ہے، ان کے شیاطین اور غیر شیاطین، تو اللہ نے ان کے لیے گمراہ کرنا مقرر کیا اور انہیں دوری کے پردے کے پیچھے سے اکسانے اور اموال اور اولاد میں شرکت کرنے کا حکم دیا، تاکہ ان کی آزمائش اور امتحان ہو۔ پس شیطان انسان سے کہتا ہے: **اكْفُرْ** (کفر کر)، پھر جب وہ کفر کر لیتا ہے تو شیطان کہتا ہے: **إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ** (میں تجھ سے بری ہوں، میں اللہ سے ڈرتا ہوں جو تمام جہانوں کا رب ہے)۔ یہ اللہ کی طرف سے اس کے بارے میں خبر ہے۔ پھر فرمایا: **فَكَانَ عَاقِبَتَهُمَا** (پس ان دونوں کا انجام ہوا)، یعنی اس واقعے کے بعد ان دونوں کو یہ ملا: **أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا** (کہ وہ دونوں ہمیشہ کے لیے آگ میں رہیں گے)۔ پس شیطان اپنے اصل کی طرف لوٹ گیا، کیونکہ وہ آگ سے پیدا ہوا تھا، پس وہ اپنے ٹھکانے کی طرف لوٹ گیا۔ اور انسان کے لیے اس کے کفر پر سزا تھی، کیونکہ اس نے شیطان کی بات قبول کر کے ظلم کیا اور رسول کی لائی ہوئی بات قبول نہیں کی۔ اور **خَالِدَيْنِ فِيهَا** (وہ دونوں اس میں ہمیشہ رہیں گے)۔ پس شیطان اپنے منزل (Manzil) اور گھر میں ہمیشہ رہا، اور انسان اپنے کفر کی سزا میں ہمیشہ رہا۔ اسی لیے شیطان نے اس سے براءت کا اظہار کیا، اس انجام میں جو ان دونوں کے درمیان فرق ہے۔ اور اس کا قول **وَذَلِكَ** (اور یہ) واحد کی طرف اشارہ ہے، اور اس نے عقاب (سزا) کی طرف اشارہ کو تثنیہ نہیں کیا، کیونکہ وہ دونوں اس میں شریک نہیں ہوئے، کیونکہ جو انسان کو اس کے گناہ کے بعد ملا وہ عذاب ہے، اور جو شیطان کا حصہ تھا جو اسے اس کے فعل اور قول کے بعد ملا، وہ اس کی اصل کی طرف لوٹنا ہے جس سے وہ پیدا ہوا تھا۔ پس عاقل کو دھوکہ نہیں کھانا چاہیے۔ کیا تم آدم علیہ السلام کے قصے میں نہیں دیکھتے، جب جنت میں ان سے وہ واقعہ پیش آیا جو شجر (درخت) کے قریب جانے کا تھا، اور اللہ نے اس کے بعد انہیں جنت سے زمین پر ہبوط (اُتارنا) کا حکم دیا، اور حوا کو بھی اُتارا، اور ابلیس کو بھی اُتارا۔ اسی لیے فرمایا: **اهْبِطُوا** (تم سب اُتر جاؤ)، پس جمع کا صیغہ استعمال کیا، تثنیہ یا واحد نہیں۔ پس آدم اپنی اصل کی طرف اُترے جس سے وہ پیدا ہوئے تھے، کیونکہ وہ مٹی سے پیدا ہوئے تھے۔ پس اللہ نے انہیں خلافت کے لیے اُتارا، جیسا کہ اس کے قول میں ہے: **إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً** (میں زمین میں ایک خلیفہ بنانے والا ہوں)۔ پس یہ اس واقعے کی سزا کے طور پر نہیں اُتارا گیا جو ان سے ہوا، بلکہ ہبوط اس واقعے کے بعد آیا جو ان سے ہوا۔ اور حوا کو تناسل کے لیے اُتارا گیا۔ اور ابلیس کو سزا کے طور پر اُتارا گیا، نہ کہ اپنی اصل کی طرف لوٹنے کے طور پر، کیونکہ وہ نہ تو اس کا گھر ہے اور نہ وہ اس سے پیدا ہوا تھا۔ پس اس نے اللہ سے آدم کی ذریت میں گمراہ کرنے کی درخواست کی، جب اللہ نے اسے اس چیز کی سزا دی جسے وہ ناپسند کرتا تھا، یعنی زمین پر اُتارنا۔ اور اس کی اصل وجہ آدم کا وجود تھا، کیونکہ ان کے وجود سے سجدے کا حکم ہوا اور ابلیس سے جو ظاہر ہونا تھا وہ ظاہر ہوا، اور جو ہونا تھا وہ ہوا۔ پس ہم نے جان لیا کہ اللہ نے آپ کو رحمت کے ساتھ بھیجا اور آپ کو عالمین کے لیے رحمت بنایا۔ پس جسے آپ کی رحمت نہ پہنچی، تو یہ آپ کی طرف سے نہیں، بلکہ قبول کرنے والے کی طرف سے ہے۔ یہ سورج کی روشنی کی طرح ہے جو زمین پر پھیلتی ہے، پس جو شخص کسی پناہ گاہ یا دیوار کے سائے میں چھپ جاتا ہے، تو وہ ہے جس نے نور کے پھیلاؤ کو قبول نہیں کیا اور اس سے منہ موڑ لیا۔ پس اس کی ممانعت سورج کی طرف سے نہیں لوٹی۔ اور آپ صلی اللہ علیہ وسلم نے خبر دی کہ آپ کو ہر سرخ اور سیاہ کی طرف بھیجا گیا ہے۔ آپ نے ان اجسام کا ذکر کیا جن میں رنگ پائے جاتے ہیں، اس طرف اشارہ کرتے ہوئے کہ آپ کو عموم رحمت کے ساتھ بھیجا گیا ہے جو اسے قبول کرے، اور عموم شریعت کے ساتھ بھیجا گیا ہے جو اس پر ایمان لائے۔ اور آپ صلی اللہ علیہ وسلم کی امت وہ تمام لوگ ہیں جن کی طرف آپ کو شریعت لانے کے لیے بھیجا گیا۔ پس ان میں سے کوئی ایمان لایا اور کوئی کفر کیا، اور سب آپ کی امت ہیں۔\n\nاور چوتھی خصلت یہ ہے کہ آپ کو ایک ماہ کی مسافت تک رعب (دہشت) کے ذریعے مدد دی گئی۔ اور مہینہ قمر (چاند) کے محیط فلک کے درجات کو طے کرنے کی مقدار ہے۔ اور یہ سب سے تیز رفتار طے کرنے والا ہے، اور عربوں کے لیے حساب اسی سے ہوتا ہے، اور آپ عربی ہیں۔ پس جب آپ کو ایک ماہ کی مسافت تک رعب کے ذریعے مدد دی گئی، تو یہ چاند کی سیر کے مطابق ہے، کیونکہ آپ نے چلنے والے کا ذکر نہیں کیا، اور مہینے کا ذکر کیا، اور اس زبان والوں کے نزدیک مہینہ صرف چاند کی سیر سے ہی متعین ہوتا ہے۔ پس آپ کی رعب کے ذریعے مدد اس مسافت کو عام ہوئی جسے اس چاند نے ایک مہینے میں طے کیا۔ پس فلک اقصی کے ہر درجے کا حکم عام ہوا جس کا اثر عالم کون و فساد میں ہے، چاند کے اس مسافت کو طے کرنے سے۔ آپ نے یہ صرف اپنی تعریف کے طور پر فرمایا۔ اور اگر کوئی اس مدت سے کم میں فلک کو طے کرنے والا ہوتا تو آپ اس کا ذکر کرتے۔ پس آپ سب سے تیز رفتار چلنے والے کو لائے جس کی سیر محیط فلک کے درجات کو طے کرنے کو عام ہے۔ پس آپ کے دشمنوں کے دلوں میں آپ کے رعب کا عموم آپ کی رحمت کے عموم کی طرح ہے۔ اور رعب صرف اسی دشمن کو قبول ہوتا ہے جو مقصود ہو اور جانتا ہو کہ وہ مقصود ہے۔ پس کسی نے بھی آپ سے جنگ میں مقابلہ نہیں کیا مگر اس کے دل میں آپ کا رعب تھا، لیکن وہ اپنے آپ کو اس چیز پر مضبوط کرتا ہے جس سے اللہ نے اسے بدبخت کیا، تاکہ سعید (خوش بخت) شقی (بدبخت) سے ممتاز ہو جائے۔ اور وہ رعب دشمن کی مضبوطی کو اس مقدار میں کمزور کر دیتا ہے جس کا اللہ ارادہ کرتا ہے۔ پس دشمن کی مضبوطی میں جو کمی اس رعب کی وجہ سے ہوئی، وہ مقدار اللہ کی طرف سے نصرت تھی۔\n\nاور پانچویں خصلت یہ ہے کہ آپ کے لیے غنیمتیں حلال کی گئیں، اور آپ سے پہلے کسی کے لیے حلال نہیں کی گئیں۔ پس آپ کو وہ چیز عطا کی گئی جو آپ کی امت کی شہوت کے موافق تھی۔ اور شہوت انسان کے باطن میں ایک آگ ہے جو اپنی مشتہا (پسندیدہ چیز) کو طلب کرتی ہے، خاص طور پر غنیمتوں میں، کیونکہ نفوس کو ان سے لذت حاصل ہوتی ہے، اس لیے کہ وہ انہیں ان کے قہر اور غلبے سے حاصل ہوئی ہے۔ اور وہ عمل کرتے ہیں، پس وہ نہیں چاہتے کہ انہیں حاصل کرنے میں جو شدت اور تھکاوٹ انہوں نے برداشت کی، اس کے مقابلے میں وہ ان سے لطف اندوز ہونے سے محروم رہیں۔ پس یہ ان کی سب سے بڑی مشتہا ہے۔ اور آپ سے پہلے انبیاء کے حق میں غنیمتیں یہ تھیں کہ جب وہ دشمن سے لڑائی سے فارغ ہوتے تو تمام غنیمتیں جمع کرتے، اور جب ان میں سے کچھ باقی نہ رہتا تو آسمان سے ایک آگ نازل ہوتی اور ان سب کو جلا دیتی۔ اگر ان میں کوئی خیانت ہوتی تو وہ آگ نازل نہ ہوتی جب تک کہ وہ چیز واپس نہ کر دی جاتی اور اس میں نہ ڈال دی جاتی۔ پس ان کے لیے آگ کا نازل ہونا ان کے فعل کی الٰہی قبولیت کی علامت تھا۔ پس اللہ نے انہیں محمد صلی اللہ علیہ وسلم کے لیے حلال کر دیا، اور آپ نے انہیں اپنے صحابہ میں تقسیم کر دیا، پس ان کی شہوت کی آگ نے انہیں تناول کیا، یہ اللہ کی طرف سے ان پر اس رسول کی کرامت کی وجہ سے عنایت تھی۔ پس اللہ نے آپ کو اس چیز سے عزت بخشی جس سے کسی اور رسول کو عزت نہیں بخشی، اور آپ پر ایمان لانے والوں کو اس چیز سے عزت بخشی جس سے آپ سے پہلے کسی مومن کو عزت نہیں بخشی۔\n\nاور چھٹی خصلت یہ ہے کہ اللہ نے آپ کے سبب زمین کو پاک کر دیا، پس اسے آپ کے لیے مکمل طور پر مسجد بنا دیا۔ پس جہاں بھی آپ کو یا آپ کی امت کو نماز کا وقت ہو جائے، وہ نماز پڑھتے ہیں۔ اور مساجد اللہ کے گھر ہیں، اور اللہ کے گھر سب سے معزز گھر ہیں، کیونکہ وہ اللہ کی طرف منسوب ہیں۔ پس اللہ نے پوری زمین کو مسجد بنا کر اپنا گھر بنا دیا۔ اور ہمیں ان فضیلتوں کے بارے میں خبر دی گئی ہے جو مسجدوں میں رہنے والوں کو اللہ کے ہاں حاصل ہیں۔ پس آپ کی امت کبھی مسجد سے باہر نہیں رہتی، کیونکہ وہ زمین سے کبھی باہر نہیں رہتی، نہ زندگی میں اور نہ موت میں۔ بلکہ یہ صرف پشت سے پیٹ کی طرف منتقل ہونا ہے۔ اور مسجد میں رہنے والا اللہ کے گھر میں اس کا ہم نشین ہے۔ پس یہ امت زندگی اور موت میں اللہ کی ہم نشین ہے، کیونکہ وہ مسجد یعنی زمین میں ہیں۔ اور اسی طرح اللہ نے اس زمین کی مٹی کو بھی طہور (پاک کرنے والی) بنا دیا، پس اسے پانی کا حکم دیا طہارت میں، جب پانی نہ ملے یا اسے استعمال کرنے کی قدرت نہ ہو کسی رکاوٹ کی وجہ سے۔ پس اللہ نے ان کے لیے اس زمین کی مٹی اور زمین کو طہور (پاک کرنے والا) بنا دیا۔ پس جب زمین سے کوئی چیز جدا ہوتی ہے، تو مٹی کے علاوہ جو بھی جدا ہوتا ہے، اس سے طہارت نہیں کی جاتی، سوائے اس کے کہ وہ مٹی ہو۔ کیونکہ جو کچھ اس میں ہے، جیسے معدنیات، سنگ مرمر، سنکھیا (زرنیخ) اور دیگر، جب تک وہ زمین میں ہے، اسے حقیقت میں زمین کہا جاتا ہے، کیونکہ زمین ان سب کو شامل کرتی ہے۔ لیکن جب وہ زمین سے جدا ہو جاتا ہے، تو اسے ایک خاص نام مل جاتا ہے اور زمین کا نام اس سے زائل ہو جاتا ہے، پس اس سے طہارت کا حکم زائل ہو جاتا ہے، سوائے خاص مٹی کے۔ پس خواہ وہ زمین سے جدا ہو یا نہ ہو، وہ طہور (پاک کرنے والی) ہے، کیونکہ اس سے طہارت کرنے والا یعنی انسان پیدا کیا گیا ہے۔ پس اسے عزت دینے کے لیے وہ اپنی ذات سے پاک کرتا ہے۔ پس اللہ نے طہارت میں اس پر حکم کو باقی رکھا، نہ کہ کسی اور پر جس کا نام زمین کے نام کے علاوہ ہو۔ پس جب مٹی زمین سے جدا ہوتی ہے، تو زمین کا نام اس سے زائل ہو جاتا ہے اور مٹی کا نام اس پر باقی رہتا ہے، جیسا کہ سنکھیا سے زمین کا نام زائل ہو گیا جب وہ زمین سے جدا ہوا اور سنکھیا کا نام اس پر باقی رہا۔ پس جدا ہونے کے بعد اس سے طہارت جائز نہیں، کیونکہ اللہ نے انسان کو سنکھیا سے پیدا نہیں کیا، بلکہ مٹی سے پیدا کیا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے زمین کے بارے میں فرمایا: \"اللہ نے اسے میرے لیے مسجد اور طہور (پاک کرنے والا) بنا دیا۔\"\n\nدوسری خبر میں فرمایا: \"اور اس کی مٹی ہمارے لیے طہور (پاک کرنے والی) بنائی گئی۔\"\n\nپس مٹی نص (واضح حکم) کے ذریعے ان تمام چیزوں سے خارج ہو گئی جو زمین ہوتی ہیں اور جدا ہونے سے نام زائل ہو جاتا ہے۔ یہ چھ چیزیں ہیں جن سے اس نبی صلی اللہ علیہ وسلم کو خاص کیا گیا، پس یہ وہ منزلت (Manzilah) تھی جو آپ کے سوا کسی کو حاصل نہیں ہوئی۔ اس کا حکم دنیا کے ہر منزل (Manzil) میں ہے، جیسا کہ ہم نے ذکر کیا، اور برزخ، قیامت اور جنت میں بھی۔ پس یہ الٰہی اختصاص کا حکم ان تمام منازل (Manāzil) میں ظاہر ہوتا ہے تاکہ آپ کا شرف اور وہ فضیلت واضح ہو جائے جو اللہ نے آپ کو دوسروں پر دی، اس کے ساتھ کہ آپ کو وہ سب کچھ عطا کیا گیا جس سے رسولوں میں سے بعض کو بعض پر فضیلت دی گئی۔\n\n### [رسالت کی شرط یہ نہیں کہ اس کی سچائی پر نشانیاں ظاہر ہوں]\n\nپھر اے ولی! جان لو کہ آپ صلی اللہ علیہ وسلم کی رحمت میں سے، جس کے ساتھ اللہ تعالیٰ نے آپ کو بھیجا، وہ ہے جو اللہ نے آپ کی زبان پر ہمارے لیے واضح کیا اور آپ کو اس کی تبلیغ کا حکم دیا، پس آپ نے تبلیغ کی کہ رسالت کی شرط یہ نہیں کہ اس کی سچائی پر نشانیاں ظاہر ہوں۔ بلکہ وہ ایک ڈرانے والا شخص ہے جسے اس چیز کی تبلیغ کا حکم دیا گیا ہے جس کی تبلیغ کا اسے حکم دیا گیا ہے۔ یہ اس کا حصہ ہے، اس پر اس کے علاوہ کچھ واجب نہیں۔ اگر وہ اپنی سچائی پر کوئی نشانی لاتا ہے، تو یہ اللہ کا فضل ہے، یہ اس کے ہاتھ میں نہیں۔ پس آپ نے اس معاملے میں تمام انبیاء کا عذر قائم کیا، پس آپ رسولوں کے لیے رحمت تھے۔ قرآن میں ان کا قول آیا: **وَقَالُوا لَوْلَا نُزِّلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ** (اور انہوں نے کہا کہ اس پر اس کے رب کی طرف سے کوئی نشانی کیوں نہیں اتاری گئی؟) اور یہ غیر عربوں کا قول ہے، عربوں کا قول نہیں، کیونکہ آپ قرآن کو اپنی سچائی پر عربوں کے لیے نشانی کے طور پر لائے، کیونکہ غیر عرب اس کے اعجاز اور نشانی ہونے کو نہیں جانتے تھے۔ پس آپ سے یہ روایت نہیں ہے کہ آپ نے ہر اس شخص کے لیے کوئی نشانی ظاہر کی جسے آپ نے غیر عربوں میں سے دعوت دی، جیسے یہود، نصاریٰ اور مجوس۔ لیکن جو بھی نشانیاں آئیں، وہ اللہ کی طرف سے ہیں، نہ کہ آپ پر یا دوسرے رسولوں پر وجوب کے حکم سے۔ پس آپ سے کہا گیا: **قُلْ** (ان سے کہہ دو) **إِنَّمَا الْآيَاتُ عِنْدَ اللَّهِ وَإِنَّمَا أَنَا نَذِيرٌ مُبِينٌ** (نشانیاں تو صرف اللہ کے پاس ہیں، اور میں تو صرف ایک واضح ڈرانے والا ہوں)۔ پھر آپ سے فرمایا: **أَوَلَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ يُتْلَى عَلَيْهِمْ إِنَّ فِي ذَلِكَ لَرَحْمَةً** (کیا ان کے لیے یہ کافی نہیں کہ ہم نے آپ پر کتاب نازل کی جو ان پر پڑھی جاتی ہے؟ یقیناً اس میں ان کے لیے رحمت ہے)۔ کیونکہ ہم نے آپ کو **رَحْمَةً لِلْعَالَمِينَ** (تمام جہانوں کے لیے رحمت) بنا کر بھیجا ہے۔ پس قرآن نے وہ سب کچھ شامل کر لیا جسے امتیں جانتی ہیں کہ وہ اس کی سچائی پر نشانی ہے جو اسے لایا ہے، کیونکہ وہ ان کے حالات کی قرائن سے نہیں جانتے تھے کہ آپ نے پڑھا یا لکھا یا مطالعہ کیا یا کسی سے میل جول رکھا یا اپنا شہر چھوڑا، بلکہ آپ امیوں میں سے ایک امی تھے۔ اور آپ نے انہیں اللہ کی طرف سے ایسے امور کی خبر دی جو وہ جانتے ہیں کہ اس صفت والا شخص جو آپ پر ہے، اللہ کی اطلاع کے بغیر نہیں جان سکتا۔ پس قرآن میں جو کچھ آیا وہ نشانی تھا، جیسا کہ انہوں نے کہا اور طلب کیا۔ اور اس کا اعجاز عربوں کے لیے خاص تھا، کیونکہ وہ ان کی زبان میں نازل ہوا، اور انہیں اس کا مقابلہ کرنے سے پھیر دیا گیا، یا ان کی قوت میں یہ نہیں تھا کہ وہ بغیر کسی پھیر کے ایسا کر سکیں۔ پس قرآن وہ سب کچھ لایا جو اس سے پہلے کی کتابیں لائی تھیں، اور آپ کو ان میں جو کچھ آیا اس کا علم صرف قرآن سے ہوا۔ اور یہود، نصاریٰ اور اہل کتاب نے یہ جان لیا۔ پس نشانی اللہ کی طرف سے حاصل ہوئی، کیونکہ قرآن اللہ کی طرف سے ہے۔ پس آپ کے لیے محمد صلی اللہ علیہ وسلم کا منزل (Manzil) دوسرے رسولوں سے واضح ہو گیا، اور اللہ نے آپ کو ایسے علوم سے خاص کیا جو کسی اور میں جمع نہیں ہوئے۔ ان میں سے یہ ہے کہ آپ کو وحی کی تمام اقسام عطا کی گئیں، پس آپ کو ہر اس چیز کی وحی کی گئی جسے وحی کہا جاتا ہے، جیسے مبشرات (خوشخبریاں)، اور دلوں اور کانوں پر نازل کرنا، اور معراج کی حالت میں اور معراج کے بغیر، اور اس کے علاوہ۔ اور آپ کو تمام احوال کے علوم کے عموم سے خاص کیا گیا، پس آپ کو ہر حال میں اور ہر حال کے علم کا ذوقاً (ذوق کے ذریعے) علم عطا کیا گیا، کیونکہ آپ کو تمام لوگوں کے لیے بھیجا گیا، اور ان کے احوال مختلف ہیں۔ پس ضروری ہے کہ آپ کی رسالت تمام احوال کے علم کو عام ہو۔ اور اللہ نے آپ کو اموات کو زندہ کرنے کے علم سے خاص کیا، معنوی اور حسی طور پر۔ پس آپ کو معنوی زندگی کا علم حاصل ہوا، اور وہ علوم کی زندگی ہے، اور حسی زندگی کا بھی، جو ابراہیم علیہ السلام کے قصے میں آیا، جو رسول اللہ صلی اللہ علیہ وسلم کے لیے تعلیم اور اطلاع تھی۔ اور وہ اس کا قول ہے: **نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ وَجَاءَكَ فِي هَذِهِ الْحَقُّ** (ہم آپ کو رسولوں کی خبروں میں سے وہ کچھ سناتے ہیں جس سے ہم آپ کے دل کو مضبوط کریں، اور آپ کے پاس اس میں حق آیا ہے)۔ اور آپ کو تمام شرائع کے علم سے خاص کیا گیا، پس آپ کے لیے متقدمین کی شرائع کو واضح کیا گیا اور آپ کو ان کی ہدایت پر چلنے کا حکم دیا گیا۔ اور آپ کو ایک ایسی شریعت سے خاص کیا گیا جو آپ کے سوا کسی اور کے لیے نہیں تھی، جس میں سے وہ چھ چیزیں ہیں جن سے آپ کو خاص کیا گیا۔ یہ چار منازل (Manāzil) ہیں جن میں آپ کے سوا کوئی نبی نہیں اُترا۔\n\nیہ محمد صلی اللہ علیہ وسلم کا منزل (Manzil) ہے، میں نے اس میں سے وہ کچھ ذکر کیا جو اللہ نے میری زبان پر آسان کیا۔ اب ہم ان علوم کا ذکر کریں گے جو آپ کے منزل (Manzil) میں شامل ہیں۔ ان میں سے حجاب کا علم ہے، یعنی حجاب جحد (انکار کا پردہ) اور حجاب حکمت (حکمت کا پردہ)۔ اور فارق (فرق کرنے والے) کا علم جس سے راستے متعین ہوئے، جیسے اس کا قول: **لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا وَلَوْ شَاءَ اللَّهُ لَجَعَلَكُمْ أُمَّةً وَاحِدَةً** (تم میں سے ہر ایک کے لیے ہم نے ایک شریعت اور ایک طریقہ مقرر کیا، اور اگر اللہ چاہتا تو تم سب کو ایک ہی امت بنا دیتا)۔ اور کیا وہ آج رسولوں کی عام بعثت کے باوجود ایک امت ہیں یا نہیں؟ اور کیا اللہ کا اہل کتاب پر جزیہ کا حکم دینا اور انہیں ان کے دین پر باقی رکھنا، محمد صلی اللہ علیہ وسلم کی زبان پر ان کے لیے اللہ کی طرف سے ایک شریعت ہے؟ پس یہ انہیں فائدہ دے گا، جب وہ جزیہ دینے والوں کی قوت اور ان کی ذلت کے ساتھ جزیہ دیں گے۔ پس انہوں نے وہ کیا جو ان پر فرض کیا گیا تھا، اور یہ شریعت میں ان کا حصہ تھا۔ پس انہیں ان کی شریعت پر باقی رکھنا ان کے لیے محمدی شریعت ہے، اور وہ اس سے سعادت حاصل کریں گے۔ پس جو ان میں سے اپنی شریعت میں کوتاہی کرے گا، اس کا مواخذہ ان دوسرے گناہگاروں کی طرح ہو گا جنہوں نے اپنی شریعت میں شامل تمام چیزوں پر عمل نہیں کیا، اگرچہ وہ اس پر ایمان رکھتے ہوں۔ اور یہ ایک عجیب علم ہے، میں نہیں جانتا کہ کشف (Al-Kashf) کے فتوحات میں سے کسی نے اس کا ذوق چکھا ہو۔ اور یہ ان اسرار کے علوم میں سے ہے جن پر اہل اللہ نے غیرت کی اور انہیں محفوظ رکھا۔ اور اس میں اس علم کا ذکر ہے جس میں کائنات حیران ہوئی، جو کچھ ہوا وہ ہوا۔ اور اس میں مطلق اور مقید ایمان کا علم ہے۔ اور اس میں اس علم کا ذکر ہے جو مشروع عمل کو فاسد کرتا ہے اور اسے درست کرتا ہے۔ اور اس میں احکام کے اختلاف کے باوجود ان میں ذات حق (Al-Ḥaqq) کے سرایت کرنے کا علم ہے، اور یہ کہ وہ سب رب کی طرف سے حق ہیں۔ اور اس میں کفارات کا علم ہے۔ اور اس میں اس علم کا ذکر ہے جس سے مخلوق کے احوال درست ہوتے ہیں۔ اور اس میں اس علم کا ذکر ہے کہ باطل کیا ہے اور حق کیا ہے، کیا وہ وجودی امر ہیں یا وجودی نہیں؟ اور اس میں اتباع میں شرکت کا علم ہے، اور ہر متبع کا انجام کیا ہو گا، کیا اس کی انتہا ایک ہی امر ہے یا مختلف؟ اور اس میں ان لوگوں کا علم ہے جن کے لیے مثالیں بیان کی جاتی ہیں اور جن کے لیے نہیں کی جاتیں۔ اور اس میں کائنات کے ہاتھوں پر الٰہی قہر کا علم ہے۔ اور اس مقام پر ابو یزید کا قول \"میری گرفت زیادہ سخت ہے\" ہے۔ اور اس میں شدت کے بعد فرج (کشائش) کا علم ہے، اور کیا فرج کا معاملہ یہ ہے کہ وہ صرف شدت کے بعد ہی ہو یا نہیں؟ اور اس میں ابتلاء (آزمائش) کی اقسام کا علم ہے۔ اور اس میں وہ صفت ہے جو اس شخص سے حیرت کو دور کرتی ہے جس میں وہ قائم ہو، اور اس کی وضاحت کا علم ہے۔ اور الٰہی انفاس کا علم ہے۔ اور اسفار (سفروں) کے نتائج سے متعلق اسفار کا علم ہے۔ اور مواعظ (نصیحتوں) کا علم ہے۔ اور اس غلبے کا علم جس میں الٰہی نصرت نہیں ہوتی، وہ کس چیز سے غالب تھے؟ اور اس میں علم العین (آنکھ کا علم) اور علم الدلیل (دلیل کا علم) کے درمیان فرق کا علم ہے، اور کیا دلیل کا علم آنکھ کے علم کی جگہ لے سکتا ہے یا نہیں؟ اور اس میں عالم میں زینت کی اقسام کا علم ہے۔ اور اس میں علوم کے مراتب اور ان کی تفصیلات کا علم ہے۔ اور اس میں منکرین قدر کے علم سے سابق قضاء کا علم ہے۔ اور اس میں طبع (مہر)، ختم (سیل)، قفل (قفل) اور کن (چھپا ہوا) کا علم ہے۔ اور بصارتوں کا اندھا پن اور بصیرتوں کا اندھا پن کیا ہے؟ اور دلوں کا اندھا پن صدور (واپسی) کی حالت کے ساتھ کیوں خاص ہوا، اور وہ حق سے رجوع کرنا ہے۔ اور کیا یہ وہ صدور ہے جو کسی متقدم ورود سے ہوتا ہے، یا یہ واجب سے ممکن کی تکوینی صدور ہے، یا یہ محل کا صدور ہے نہ کہ صفت کا، تو اس کا اندھا پن اس کے محل میں ہونے کی وجہ سے ہے؟ پس جب وہ اپنے نظر سے محل سے جدا ہوتا ہے اور اس میں اس کے لیے ایک کشادگی کھلتی ہے جہاں سے وہ دیکھتا ہے، تو اس کا اندھا پن زائل ہو جاتا ہے۔ اور اس میں علوم مزید (اضافی علوم) کی تعیین ہے، کیونکہ وہ اس حکم کے مطابق مختلف ہوتے ہیں جس پر اضافہ واقع ہوتا ہے۔ اور اس میں کوائن (موجودات) پر آیات اور علامات کا علم ہے۔ اور اس میں الٰہی مرتبے کی توحید کا علم ہے کہ اسے صرف ایک نے ہی حاصل کیا ہے۔ اور اس میں پردوں (ستور) اور ان کی اقسام کا علم ہے جو ہم پر ڈالے جاتے ہیں تاکہ ہم دوسروں کے ادراک سے چھپے رہیں، اور وہ پردے کیا ہیں جو ہمارے اور اس کے درمیان ڈالے جاتے ہیں جسے ہم دیکھنا چاہتے ہیں مگر نہیں دیکھ پاتے۔ اور اس میں منزل (Manzil) میں قیام اور اس میں گردش کا علم ہے، نہ کہ اس سے باہر۔ اور اس میں ایک قوم پر عنایت اور ایک قوم کے حق میں اسے ترک کرنے کا علم ہے۔ اور اس میں ان نتائج کا علم ہے جو عزائم (پختہ ارادے) خیر اور شر میں پیدا کرتے ہیں۔ اور اس میں خیر اور شرور کا علم ہے۔ اور اس میں نسب رحمانی کا علم ہے۔ اور اس میں اس ایمان کا علم ہے جو نفع دیتا ہے اور جو نفع نہیں دیتا، جیسا کہ اس نے فرمایا: **أُولَئِكَ هُمُ الْكَافِرُونَ حَقًّا** (یہی لوگ حقیقی کافر ہیں)۔ اور اس میں الٰہی قرب اور بعد کا علم ہے۔ اور اس میں اس علم کا ذکر ہے جس کی طرف تفکر (غور و فکر) لے جاتا ہے۔ اور اس میں رجعت (واپسی) کا علم ہے، کس سے اور کس کی طرف؟ اور اس میں اس علم کا ذکر ہے جس پر گمان اثر انداز ہوتا ہے اور جس پر اثر انداز نہیں ہوتا۔ اور اس میں مشاہدہ (Vision) کا علم ہے اور اس کا مشیئت (ارادہ الٰہی) سے تعلق، محل کے اسے قبول کرنے کی تیاری کے ساتھ۔ اور وہاں ممانعت ہے جبکہ محل قبول کرنے والا ہے، تو یہ مانع مشیئت (ارادہ) کیا ہے؟ اور اس میں جزا اور فضل میں انصاف کا علم ہے۔ اور اس میں اضداد (متضاد چیزوں) اور امثال (مثالوں) اور غیر امثال کے درمیان فرق کا علم ہے، اور اس کے علاوہ دیگر علوم۔ میں یہ سب حصر (محدود کرنے) کے ارادے سے بیان نہیں کر رہا، باوجود اس کے کہ میں انہیں جانتا ہوں، بلکہ میں اسے صرف اس بات پر تنبیہ کرنے کے ارادے سے بیان کر رہا ہوں جو اس میں ہے یا اس کے بعض حصے میں ہے، جیسا کہ مجھے یاد آتا ہے۔ اور کبھی میں اسے حصر کے طریقے سے بیان کرتا ہوں، اس طرح کہ میں منزل (Manzil) میں کوئی علم نہیں چھوڑتا مگر اس پر تنبیہ کرتا ہوں، اور کبھی میں اس سے قاصر رہتا ہوں۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و سی و هفتم: در معرفت منزل محمد (صلی الله علیه و سلم) با بخشی از عالم، و آن از حضرت موسوی است.\n\nآگاه باشید! برای حق است آنچه در اکوان (جهان‌ها) است *** از احکام تناقض در هستی (الوجود)\n\nپس از ایشان است مطیع و عاصی، دانا *** و نادان به نزول و صعود\n\nو از ایشان است کسی که در غیوب (عوالم غیب) متحقق شد *** و از ایشان است کسی که در شهود (الشهود) متحقق شد\n\nپس کثرت آشکار می‌شود، در حالی که عین (حقیقت) آن *** به دلایل و پیمان‌ها یگانه است\n\nپس منزه است آنکه به هر نعت (وصفی) اراده شده است *** از اوصاف الوهیت و عبودیت\n\nو منزه است آن احاطه‌کننده بر هر چیز *** و در معارف (المعرفة) به فزونی (المزید) وصف می‌شود\n\n### [دیدار در روز تجلی عمومی بزرگ‌تر]\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «من سرور مردم در روز قیامت هستم» و دلیل آن را کمال خود دانست و فرمود: «اگر موسی زنده بود، چاره‌ای جز پیروی از من نداشت.»\n\nبه دلیل عمومیت رسالتش و فراگیری شریعتش، او (صلی الله علیه و سلم) به چیزهایی اختصاص یافت که به هیچ پیامبری پیش از او داده نشده بود. و هیچ پیامبری به چیزی اختصاص نیافت مگر آنکه برای محمد (صلی الله علیه و سلم) نیز بود، زیرا به او جوامع الکلم (جوامع الكلم) داده شد و فرمود: «من پیامبر بودم در حالی که آدم میان گِل و آب بود.»\n\nو دیگر پیامبران، پیامبر نبودند مگر در زمان نبوت و دوران رسالتشان. پس در این باب، منزل (المنزل) و منزلت (المنزلة) او را ذکر می‌کنیم. منزل (المنزل) در بساط حق (الحق) و جایگاه صدق، هنگام تجلی (التجلی) و دیدار در روز تجلی عمومی بزرگ‌تر (الزور العام الأعظم) آشکار می‌شود، و منزل او با بصیرت و شهود (الشهود) دانسته می‌شود. اما منزلت (المنزلة) او، منزلتی است در ذات حق (الحق) و مرتبه‌ای از او، و این جز با آگاهی دادن خداوند دانسته نمی‌شود. و مقام محمود از آن اوست، که همان گشودن باب شفاعت برای فرشتگان و پایین‌تر از آنان است. و او در شفاعت اولویت دارد و وسیله (الوسيلة) از آن اوست، و در میان منازل (المنازل) بالاتر از آن نیست. محمد (صلی الله علیه و سلم) آن را به سبب درخواست امتش به دست می‌آورد، به پاداش سعادتی که به واسطه او کسب کردند، زیرا او راه سعادت را برایشان آشکار ساخت و آنان نیز از او پیروی کردند.\n\n### [اعمال شقاوتمندان و همچنین اعمال سعادتمندان مجسم می‌شوند]\n\nبدان که هر کس وارد این منزل (المنزل) شود، در آن شگفتی‌هایی می‌بیند که در جای دیگر نمی‌بیند. از جمله آنکه اعمال شقاوتمندان را مجسم می‌بیند، و همچنین اعمال سعادتمندان را مجسم می‌بیند؛ به صورت‌هایی ایستاده که وجود خالق خود را درک می‌کنند. و خداوند در نفوس این صورت‌ها، طلب و جستجویی نسبت به اسبابی که از آن‌ها به وجود آمده‌اند (یعنی عاملان) قرار داده است، و آنان در جستجوی خود می‌کوشند. اما اعمال سعادتمندان، راهی را در سمت راست خود می‌بینند که در آن گام می‌نهند، و آن راه ایشان را به مشاهده صاحبانشان (سعادتمندان) می‌برد. پس برخی، برخی دیگر را می‌شناسند و از هم سؤال می‌کنند، و عاملان (سعادتمندان) آن‌ها را مرکب‌های رستگاری و نجات قرار می‌دهند که ایشان را به قرارگاه رحمت حمل می‌کنند. اما اعمال شقاوتمندان، راه‌های متعدد، شاخه‌شاخه و درهم‌تنیده‌ای برایشان برپا می‌شود که نمی‌دانند کدام راه آن‌ها را به سوی صاحبانشان می‌برد. پس سرگردان می‌شوند و هدایت نمی‌یابند. و این از رحمت خداوند بر شقاوتمندان است. هنگامی که اعمالشان سرگردان شوند، با عبادت و ذکر به سوی خدا باز می‌گردند. و در آن راه‌ها پراکنده می‌شوند؛ برخی از آنان هرگز به صاحب خود نمی‌رسند، و برخی به صاحب خود می‌رسند و او را مشاهده کرده و می‌شناسند، و او نیز او را می‌شناسد. و وجود یافتن او (عمل) برای عامل، به صورت تصادفی است. پس به او می‌آویزد و می‌گوید: مرا حمل کن، زیرا در جستجوی تو خسته شدم. پس عامل مجبور می‌شود او را حمل کند تا زمانی که رحمت الهی شامل حالش شود. و در کنار جایگاه توقف این صورت‌ها، دو راه آشکار وجود دارد: راهی که غایت آن حق هستی (الوجود) است، و راهی که غایتی ندارد، زیرا سالک را به سوی عدم (العدم) می‌برد و در غایت خود در آن متوقف نمی‌شود، چرا که عدم (العدم) با حدی محدود نمی‌شود تا به آن مقید گردد. برخلاف حق هستی (الوجود) که مقید است، اگرچه مطلق است؛ زیرا اطلاق (اطلاق) آن در نفس امر، تقیید است، چرا که با اطلاق خود از هستی (الوجود) مقید متمایز می‌شود، پس در عین اطلاق خود مقید است. و راه سومی میان این دو راه وجود دارد که برزخی (برزخی) است و غایت آن نه به هستی (الوجود) وصف می‌شود و نه به عدم (العدم)، مانند احوال در علم متکلمین. اما راهی که غایت آن هستی (الوجود) حق (الحق) است، موحدان، مؤمنان، مشرکان و کافران و همه صاحبان عقاید وجودی بر آن سلوک می‌کنند. و اما راه دیگر، تنها معطله (منکران صفات) بر آن سلوک می‌کنند و به غایتی نمی‌رسند. و اما راه برزخی (برزخی)، تنها علمای بالله خاص بر آن سلوک می‌کنند؛ کسانی که حق (الحق) آن‌ها را اثبات کرده و در عین اثباتشان محو نموده و در حال فنایشان (الفناء) باقی (البقاء) داشته است. آنان کسانی هستند که نمی‌میرند و زنده نمی‌شوند تا زمانی که خداوند میان بندگان داوری کند. پس از سمت راست به سوی راه هستی (الوجود) حق (الحق) می‌روند، و از حقیقت آن راه صفتی کسب کرده‌اند و هیئتی از آن به دست آورده‌اند که در منزل هستی (الوجود) حق (الحق) بر آنان ظاهر می‌شود و با آن یکدیگر را می‌شناسند، اما هیچ‌یک از اهل دو راه دیگر آنان را نمی‌شناسد. این مثلی است که خداوند برای اهل الله زده است تا از آن بر مراتب هدایت و حیرت، و هدایت‌شدگان و گمراهان آگاه شوند. و خداوند برای آنان نوری، بلکه انوارهایی قرار داده است که با آن‌ها در تاریکی‌های خشکی طبیعتشان، و در تاریکی‌های دریای افکارشان، و در تاریکی‌های نفوس ناطقه‌شان (نفوس ناطقه) هدایت می‌یابند، چه خشکی و چه دریای آن، به سبب آنچه در نشأتشان بر آن هستند، زیرا آن‌ها میان نور خالص و طبیعت محض عنصری صرف متولد شده‌اند. و آن انوارهای قرار داده شده در ایشان، از اسماء الهی است. پس هر کس که به آن‌ها عارف باشد و از آن حیث که برای او وجود یافته‌اند به آن‌ها بنگرد، با آن‌ها به علم امور و کشف (الکشف) می‌رسد. و هر کس آن‌ها را انواری بگیرد که نداند برای هدایت وضع شده‌اند و آن‌ها را زینت قرار دهد، چنانکه عوام مردم ستارگان آسمان را زینتی خاص می‌بینند، چیزی جز آنچه دیده است به دست نمی‌آورد. اما علما آن‌ها را به منازلشان، سیرشان و سیاحتشان در افلاکشان می‌بینند که برای هدایت وضع شده‌اند. پس آن‌ها را نشانه‌هایی قرار می‌دهند بر آنچه در سیر خود در راه‌هایی که به سوی آنچه حق (الحق) ایشان را به آن فراخوانده است (از علم به او یا سعادتی که همان رستگاری خاص است) می‌رساند، جستجو می‌کنند.\n\n### [اینکه خداوند منزل محمد (صلی الله علیه و سلم) را سیادت قرار داد]\n\nبدان که چون خداوند منزل محمد (صلی الله علیه و سلم) را سیادت قرار داد، پس او سید (سرور) بود و هر که جز اوست، رعیت (سوقة) است، دانستیم که کسی با او برابری نمی‌کند، زیرا رعیت با پادشاهان خود برابری نمی‌کند. پس او منزل (المنزل) خاص و رعیت منزل (المنزل) دیگری دارد. و چون این منزلت (المنزلة) به او داده شد در حالی که آدم میان آب و گِل بود، دانستیم که او مددبخش هر انسان کامل (الإنسان الکامل) است که به ناموس الهی یا حکمی وصف شده باشد. و اولین ظهور این امر در آدم بود، آنجا که خداوند او را خلیفه محمد (صلی الله علیه و سلم) قرار داد. پس او را با همه اسماء از مقام جوامع الکلم (جوامع الكلم) که از آن محمد (صلی الله علیه و سلم) است، مدد رساند. پس آدم با علم به همه اسماء بر کسی که بر وجود او بر خدا اعتراض کرد و خود را بر او ترجیح داد، غلبه یافت. سپس خلفا در زمین پی در پی آمدند تا زمانی که زمان وجود صورت جسمانی او فرا رسید تا حکم منزلتش با اجتماع دو نشأت او آشکار شود. هنگامی که او ظهور کرد، مانند خورشیدی بود که هر نوری در نور او مستتر شد. از شرایع او که نائبانش را با آن فرستاد، آنچه را که تثبیت شده بود، تثبیت کرد و آنچه را که نسخ شده بود، نسخ کرد. و عنایت او به امتش به دلیل حضور و ظهور او در میان آن‌ها پاکیزه شد، اگرچه عالم انسانی و ناری (جن) همگی امت او هستند، اما اینان (امت خاص) خصوصیت وصفی دارند. پس خداوند آنان را **خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ** (بهترین امتی که برای مردم بیرون آورده شده است) قرار داد. این فضیلت را ظهور او با دو نشأت (جسمانی و روحانی) به او بخشید. پس از فضیلت این امت بر امت‌های دیگر این است که خداوند آنان را در منزلت خلفای خود در عالم، پیش از ظهور او، قرار داد، زیرا به آنان تشریع (قانون‌گذاری) داده بود. پس به این امت اجتهاد در وضع احکام را عطا کرد و به آنان فرمان داد که بر اساس آنچه اجتهادشان به آن می‌رسد، حکم کنند.\n\nپس به آنان تشریع (قانون‌گذاری) عطا کرد و در این امر به مقامات انبیا (علیهم السلام) پیوستند و آنان را وارثان انبیا قرار داد، زیرا آنان (امت محمد) متأخرند و متأخر به ضرورت وارث متقدم است. پس آنان بر بصیرت به سوی خدا دعوت می‌کنند، همان‌گونه که رسولان دعوت کردند. محمد (صلی الله علیه و سلم) از عصمت آنان در آنچه به آن دعوت می‌کنند خبر داد. پس از ایشان کسی است که در حکم خطا می‌کند، اما خطاکار از حق (الحق) نیست، زیرا آنچه آورده حق است. اگر در حکمی که پیش از این توسط محمد (صلی الله علیه و سلم) حکم شده و به او نرسیده است، خطا کند، برای او یک پاداش است و آن پاداش اجتهاد است. و اگر با اجتهاد خود به حکم پیشین دست یابد، برای او دو پاداش است: پاداش اجتهاد و پاداش اصابت. و اگرچه مصیب (کسی که به حق رسیده) در میان مجتهدان نزد خود و دیگران ناشناخته باشد، نزد خداوند ناشناخته نیست. و هر کس از انبیا و خلفای پیشین که پس از ظهور محمد (صلی الله علیه و سلم) وارد زمان این امت شود، در عالم حکم نمی‌کند مگر به آنچه محمد (صلی الله علیه و سلم) در این امت تشریع کرده است. و او در میان مجتهدان متمایز شده و در حزب آنان قرار می‌گیرد، با حفظ منزلت خلافت اولیه‌اش. پس او دو حکم دارد و به این ترتیب در قیامت آنچه را که در اینجا ظهور ندارد، آشکار می‌سازد. و منزل محمد (صلی الله علیه و سلم) در روز تجلی اعظم (الزور الأعظم) در سمت راست رحمان است، از حیث صورتی که در آن بر عرش خود تجلی می‌کند. و منزل او در روز قیامت در سمت راست رحمان نیست، بلکه در پیشگاه حاکم عادل است برای اجرای اوامر الهی و احکام در عالم. پس همه در آن موطن از او می‌گیرند، و او تماماً وجهی است که از همه جهات دیده می‌شود، و از هر سو برای او آگاهی از جانب خداوند متعال است که از او فهمیده می‌شود؛ او را زبانی می‌بینند و صدایی و حرفی از او می‌شنوند. و منزلت (المنزلة) او در بهشت‌ها، وسیله (الوسيلة) است که همه بهشت‌ها از آن منشعب می‌شوند، و آن در جنة عدن (دار المقامة) است. و برای آن در هر بهشتی از آن بهشت‌ها شاخه‌ای است، و از آن شاخه او (صلی الله علیه و سلم) بر اهل آن بهشت ظاهر می‌شود، و آن در هر بهشتی بزرگ‌ترین منزل (المنزل) در آن است. و این‌ها همگی منازل (المنازل) حسی هستند نه معنوی. و منزلت معنوی (المعنویة) تنها منزلت او در نفس موجده است، که همان خداوند متعال است. و این خاص او نیست، بلکه هر منزلت (المنزلة) تنها در نفس خدا که رحمان است، وجود دارد. و منازل (المنازل) محسوس و محصور هستند که جمع منزل (المنزل) است نه جمع منزلت (المنزلة). پس این را بدان، زیرا از مغز معرفت (المعرفة) به خداوند متعال و تقدس در ذات اوست. و اما منزلت (المنزلة) او در علوم، احاطه به علم هر عارفی به خدا از علمای متقدم و متأخر به اوست. و هر منزل (المنزل) برای او و پیروانش با عطر الهی خوشبو شده است که دست اکوان (جهان‌ها) در آن وارد نشده و به کار نرفته است.\n\n### [اینکه از کمال محمد (صلی الله علیه و سلم) است که به شش خصلت اختصاص یافت که برای هیچ پیامبری پیش از او نبود]\n\nبدان که از کمال او (صلی الله علیه و سلم) است که به شش خصلت اختصاص یافت که برای هیچ پیامبری پیش از او نبود. و شش کامل‌ترین اعداد است، و در اشکال هندسی شکلی که زوایای آن با پیوستن امثال (اشکال مشابه) به آن، خالیگاهی میانشان نباشد، جز شش‌ضلعی نیست. و خداوند با آن به زنبور عسل وحی کرد در این آیه: **أَنِ اتَّخِذِي من الْجِبالِ بُيُوتاً ومن الشَّجَرِ ومِمَّا يَعْرِشُونَ** (که از کوه‌ها خانه‌هایی و از درختان و از آنچه برپا می‌دارند، [کندوهایی] بساز). و صفت کارش را به او وحی کرد، پس آن را شش‌ضلعی ساخت. پس خبر داد که به او کلیدهای خزانه‌ها داده شده است، و آن‌ها خزانه‌های اجناس عالم هستند تا به اندازه آنچه با ذات خود طلب می‌کنند، برایشان خارج سازد، زیرا می‌دانیم که او سید (سرور) است. و هر کس تعیین خزانه‌ها را به زمین محدود کند، در زمین جز خزانه‌های معادن و نباتات نیست و بس، زیرا حیوان از حیث رشدش نبات است. خداوند متعال می‌فرماید: **والله أَنْبَتَكُمْ من الْأَرْضِ نَباتاً** (و خداوند شما را از زمین به صورت گیاهی رویاند). پس به ما خبر داد که ما از جمله نباتات زمین هستیم. و این کلیدها به او (صلی الله علیه و سلم) داده نشد مگر آنکه وصفی در او بود که به واسطه آن مستحق آن‌ها شد. به همین دلیل یوسف (علیه السلام) از پادشاه مصر خواست که او را بر خزانه‌های زمین بگمارد، زیرا او «حفیظ علیم» (نگهبان دانا) بود تا همه به او نیازمند شوند و سیادت او بر آنان محقق گردد. و به همین دلیل او (یوسف) از صفتی خبر داد که هر کس این مقام را داشته باشد، مستحق آن است و گفت: **إِنِّي حَفِيظٌ عَلِيمٌ** (من نگهبان دانا هستم). «حفیظ» بر آن‌هاست، پس جز به اندازه معلوم از آن‌ها خارج نمی‌کنیم، همان‌گونه که خداوند سبحان می‌فرماید: **وإِنْ من شَيْ‏ءٍ إِلَّا عِنْدَنا خَزائِنُهُ وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ** (و هیچ چیز نیست مگر آنکه خزانه‌های آن نزد ماست و ما آن را نازل نمی‌کنیم مگر به اندازه معلوم). پس اگر این صفت در کسی باشد که کلیدهای آن در دست اوست، سپس بعد از قولش «حفیظ علیم» خبر داد که او عالم به نیاز نیازمندان به آنچه در این خزانه‌ها ذخیره شده و قوامشان به آن است، می‌باشد، و «علیم» به اندازه نیاز است. پس چون به او (صلی الله علیه و سلم) کلیدهای خزانه‌های زمین داده شد، دانستیم که او «حفیظ علیم» است. پس هر رزقی که در عالم ظاهر می‌شود، اسم الهی آن را نمی‌دهد مگر به امر محمد (صلی الله علیه و سلم) که کلیدها در دست اوست، همان‌گونه که حق تعالی به کلیدهای غیب اختصاص یافته و جز او کسی آن‌ها را نمی‌داند. و این سید (محمد) منزلت اختصاص را با اعطای کلیدهای خزانه‌ها به دست آورد.\n\nو خصلت دوم: به او جوامع الکلم (جوامع الكلم) داده شد. «کلم» جمع «کلمه» است و کلمات خدا پایان نمی‌پذیرد. پس علم آنچه پایان نمی‌پذیرد به او داده شد. پس به آنچه هستی (الوجود) آن را محدود کرده، علم یافت و به آنچه وارد هستی (الوجود) نشده و نامتناهی است، نیز علم یافت. پس به حقایق معلومات احاطه علمی یافت، و این صفتی الهی است که برای غیر او نبوده است. پس کلمه از او کلماتی است، مانند امر الهی که یک کلمه است: **كَلَمْحٍ بِالْبَصَرِ** (مانند یک چشم بر هم زدن). و در تشبیه حسی، چیزی بزرگ‌تر و سزاوارتر به تشبیه به آن از چشم بر هم زدن نیست. و چون به جوامع الکلم (جوامع الكلم) علم یافت، اعجاز با قرآن به او داده شد، که قرآن کلام خداست و او مترجم آن از جانب خداست. پس اعجاز در ترجمه که از آن اوست، واقع شد. زیرا معانی مجرد از مواد، اعجاز در آن‌ها تصور نمی‌شود، بلکه اعجاز، پیوند دادن این معانی به صورت‌های کلمات است که از نظم حروف برپا شده است. پس او زبان حق (الحق)، گوش و چشم اوست، و این بالاترین مراتب الهی است. و پایین‌تر از آن کسی است که حق (الحق) گوش و چشم و زبان او باشد، پس او مترجم از بنده خود خواهد بود، همان‌گونه که خداوند متعال در قرآن احوال پیشینیان و آنچه را گفتند برای ما ترجمه کرده است. پس در آن (قرآن) این شرف نیست که از اهل خود و مقربان نزد خود مانند فرشتگان در آنچه گفتند، ترجمه کند، و از ابلیس با ناامیدی و شیطنت و دوری‌اش در آنچه گفت، ترجمه کند. و جز کسی که اختصاصی بالاتر از آن نیست، از جانب خدا ترجمه نمی‌کند.\n\nو خصلت سوم: مبعوث شدن او به سوی همه مردم (کافة). «کفت» به معنای دربرگرفتن است. **أَ لَمْ نَجْعَلِ الْأَرْضَ كِفاتاً** (آیا زمین را محل جمع‌آوری قرار ندادیم؟) یعنی زندگان را بر پشت خود و مردگان را در شکم خود دربرمی‌گیرد. همچنین شریعت او همه مردم را دربرگرفت. پس هیچ‌کس از او نمی‌شنود مگر آنکه ایمان به او بر او لازم می‌شود. و هنگامی که جن قرآن را شنیدند که تلاوت می‌شود، به قوم خود گفتند: **يا قَوْمَنا أَجِيبُوا داعِيَ الله وآمِنُوا به يَغْفِرْ لَكُمْ من ذُنُوبِكُمْ ويُجِرْكُمْ من عَذابٍ أَلِيمٍ** (ای قوم ما، دعوت‌کننده خدا را اجابت کنید و به او ایمان آورید تا گناهانتان را بیامرزد و شما را از عذابی دردناک پناه دهد). و **ومن لا يُجِبْ داعِيَ الله فَلَيْسَ بِمُعْجِزٍ في الْأَرْضِ ولَيْسَ لَهُ من دُونِهِ أَوْلِياءُ أُولئِكَ في ضَلالٍ مُبِينٍ** (و هر کس دعوت‌کننده خدا را اجابت نکند، در زمین عاجزکننده نیست و جز او برایش دوستانی نیست، آنان در گمراهی آشکارند). پس با قولش **فَلَيْسَ بِمُعْجِزٍ في الْأَرْضِ** از جن خبر داد، و قول خداوند **ولَيْسَ لَهُ** تا **مُبِينٍ** (گمراهی آشکار) را شامل شد. پس شریعت او جن و انس را دربرگرفت. پس شریعت او انس و جن را فرا گرفت و رحمت او که با آن فرستاده شد، عالم را فرا گرفت. پس فرمود: **وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ** (و ما تو را نفرستادیم مگر رحمتی برای جهانیان). پس خداوند خبر داد که او را فرستاده تا به عالم رحم کند و عالمی را از عالم دیگر استثنا نکرد. پس اگر او هر آنچه را که عالم، صنف به صنف، می‌پسندد، بیاورد (به جز برخی که مخاطب به حکم شرع او هستند)، پس به او رحم کرده و به رحمتی که با آن فرستاده شده، قیام کرده است. بلکه می‌گوییم که او حکم خدا را آورده است و هر صنفی از عالم بدون شک از حکم خدا راضی است، زیرا همه عالم به حمد او تسبیح می‌گویند، پس از جهتی که این رسول عام‌الدعوه و عام‌الرحمه بر عالم آورده، از حکم او راضی هستند. غیر از اینکه برخی از مردم از محکم‌به (آنچه حکم شده) راضی نیستند، اگرچه از حکم (قانون) راضی‌اند. پس او از رحمت خدا که با آن فرستاده شده، به اندازه‌ای که از حکم معینی که آورده راضی شده، بهره برده است. و این واقعه تنها در مورد انسان‌هاست. اما جن، شیاطین و غیر شیاطینشان، خداوند برای آنان اغوا را قرار داده و از پشت حجاب دوری به آنان امر کرده است که انسان‌ها را تحریک کنند و در اموال و اولادشان شریک شوند، برای ابتلا و امتحان آنان. پس شیطان به انسان می‌گوید: **اكْفُرْ** (کافر شو). پس هنگامی که کافر شد، شیطان می‌گوید: **إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ** (من از تو بیزارم، من از خدا، پروردگار جهانیان، می‌ترسم). این خبر دادن خدا از اوست. سپس فرمود: **فَكانَ عاقِبَتَهُما** (پس عاقبت آن دو چنین شد)، یعنی پس از این واقعه، **أَنَّهُما فِي النَّارِ خالِدَيْنِ فِيها** (آن دو در آتش جاودانند). پس شیطان با بازگشت به اصل خود (که از آتش خلق شده) به موطن خود بازگشت. و برای انسان عقوبتی بود بر کفرش، زیرا با پذیرش آنچه شیطان برایش آورد، ظلم کرد و آنچه رسول آورد را نپذیرفت. سپس فرمود: **خالِدَيْنِ فِيها** (در آن جاودانند). پس شیطان در منزل و خانه خود جاودان شد و انسان به پاداش کفرش جاودان شد. و به همین دلیل شیطان از او بیزاری جست، به خاطر افتراقی که میان آن دو در عاقبت وجود دارد. و قول او (خداوند): **وذلك** (و این)، به تثنیه اشاره نکرد، بلکه به واحد اشاره کرد، به عقاب، زیرا آن دو در آن شریک نشدند. زیرا آنچه پس از گناه به انسان رسید، عذاب بود، و سهم شیطان که پس از فعل و قولش به او رسید، بازگشت به اصلش بود که از آن خلق شده است. پس عاقل نباید فریب بخورد. آیا نمی‌بینی در داستان آدم در بهشت، هنگامی که آنچه واقع شد (نزدیک شدن به درخت) از او سر زد، خداوند به دنبال آن، هبوط به زمین را از بهشت برای او مقرر کرد، و حوا و ابلیس را نیز هبوط داد. به همین دلیل فرمود: **اهْبِطُوا** (هبوط کنید)، پس جمع آورد و تثنیه یا مفرد نیاورد. پس آدم به اصل خود که از آن خلق شده بود (خاک) فرود آمد. و خداوند او را برای خلافت هبوط داد، به دلیل قولش: **إِنِّي جاعِلٌ فِي الْأَرْضِ خَلِيفَةً** (من در زمین جانشینی قرار می‌دهم). پس هبوط او عقوبتی برای آنچه از او سر زد نبود، بلکه هبوط به دنبال آنچه واقع شد، آمد. و حوا برای تناسل هبوط داده شد. و ابلیس به عنوان عقوبت هبوط داده شد، نه بازگشت به اصلش، زیرا آنجا خانه او نیست و از آن خلق نشده است. پس از خدا خواست که اغواگری برای ذریه آدم برایش دوام یابد، هنگامی که خداوند او را به آنچه ناخوش می‌داشت (فرود آمدن به زمین) عقوبت کرد. و سبب اصلی این امر، وجود آدم بود، زیرا با وجود او امر به سجده واقع شد و آنچه از ابلیس ظاهر شد، آشکار گشت و آنچه از امر بود، واقع شد. پس دانستیم که خداوند او را با رحمت فرستاد و او را رحمتی برای جهانیان قرار داد. پس اگر رحمت او به کسی نرسد، این از جانب او نیست، بلکه از جانب قابل است. او مانند نور خورشید است که شعاع خود را بر زمین می‌افکند. پس کسی که در پناه و سایه دیوار از آن پنهان شود، اوست که نپذیرفته نور بر او منتشر شود و از آن روی گردانده است، و از این جهت به خورشید باز نمی‌گردد. و او (صلی الله علیه و سلم) خبر داد که به سوی هر «سرخ و سیاه» مبعوث شده است. پس کسانی را ذکر کرد که رنگ‌ها در اجسامشان وجود دارد، و اشاره می‌کند که او با عموم رحمت برای کسی که آن را می‌پذیرد، و با عموم شرع برای کسی که به آن ایمان می‌آورد، مبعوث شده است. و امت او (صلی الله علیه و سلم) همه کسانی هستند که برای تشریع به سوی آنان مبعوث شده است. پس برخی از آنان ایمان آوردند و برخی کفر ورزیدند، و همه امت او هستند.\n\nو خصلت چهارم: با رعب (ترس) به مسافت یک ماه راه، پیشاپیش او یاری شد. و ماه، مقدار پیمودن درجات فلک محیط توسط قمر است، و قمر سریع‌ترین پیمایشگر است و حساب عرب با آن است و او عربی است. پس هنگامی که با رعب به مسافت یک ماه راه، پیشاپیش او یاری شد، این به سیر قمر است، زیرا او از سائر (پیمایشگر) نام نبرد و از ماه نام برد، و ماه نزد اهل این زبان (عربی) جز با سیر قمر تعیین نمی‌شود. پس یاری او با رعب، مسافتی را که قمر در یک ماه پیموده، فرا گرفته است. پس حکم هر درجه از فلک اقصی که در عالم کون و فساد اثری دارد، با پیمودن آن مسافت توسط قمر، فراگیر شد. و او این را نگفت مگر از باب ستایش خود. و اگر کسی بود که فلک را در کمتر از این مدت می‌پیمود، او آن را می‌آورد. پس او سریع‌ترین سائر (پیمایشگر) را آورد که سیرش پیمودن درجات فلک محیط را فرا می‌گیرد. پس عمومیت رعب او در دل دشمنانش، عمومیت رحمت اوست. و رعب را نمی‌پذیرد مگر دشمنی که مقصود است و می‌داند که مقصود است. پس هیچ‌کس در جنگ با او مقابله نکرد مگر آنکه در قلبش رعبی از او بود، اما با آنچه خداوند او را به شقاوت رسانده، خود را به شجاعت می‌زند تا سعادتمند از شقاوتمند متمایز شود. و آن رعب از شجاعت دشمنش به اندازه‌ای که خدا می‌خواهد، می‌کاهد. پس هر مقدار که از شجاعت آن دشمن به واسطه رعبی که یافته، کاسته شود، آن مقدار نصرت از جانب خدا بوده است.\n\nو خصلت پنجم: غنائم برای او حلال شد و برای هیچ‌کس پیش از او حلال نشده بود. پس آنچه موافق شهوت امتش بود، به او داده شد. و شهوت آتشی است در باطن انسان که مشتهای خود را می‌طلبد، به ویژه در غنائم، زیرا نفوس از آن‌ها لذت می‌برند، به دلیل اینکه با قهر و غلبه به دست آمده‌اند، و عمل می‌کنند. پس نمی‌خواهند که از تنعم به آن‌ها در مقابل سختی و رنجی که در به دست آوردن آن‌ها کشیده‌اند، محروم شوند. پس غنائم بزرگ‌ترین مشتهای آنان است. و غنائم در حق دیگر پیامبران چنین بود که وقتی از جنگ با دشمن باز می‌گشتند، همه غنائم را جمع می‌کردند. اگر چیزی از آن باقی نمی‌ماند، آتشی از آسمان فرود می‌آمد و همه را می‌سوزاند. اما اگر در آن خیانتی (غلول) واقع می‌شد، آن آتش فرود نمی‌آمد تا زمانی که آن مال بازگردانده و در میان غنائم انداخته شود. پس فرود آمدن آتش برای آنان نشانه‌ای بر قبول الهی عملشان بود. پس خداوند آن را برای محمد (صلی الله علیه و سلم) حلال کرد و آن را میان اصحابش تقسیم نمود. پس آتش شهوات آنان آن را به دست گرفت، به دلیل عنایت خداوند به آنان به خاطر کرامت این رسول نزد او. پس او را به امری گرامی داشت که هیچ رسول دیگری را به آن گرامی نداشت، و مؤمنان به او را به چیزی گرامی داشت که هیچ مؤمنی پیش از او را به واسطه دیگری گرامی نداشته بود.\n\nو خصلت ششم: خداوند به سبب او زمین را پاکیزه ساخت و همه آن را برای او مسجد قرار داد. پس هر جا که وقت نماز برای او یا امتش فرا رسد، نماز می‌خواند. و مساجد خانه‌های خدا هستند، و خانه‌های خدا گرامی‌ترین خانه‌ها به دلیل انتسابشان به خدا هستند. پس همه زمین را خانه خدا قرار داد از آن حیث که آن را مسجد قرار داد. و به ما خبر داده است از فضیلتی که برای ملازمان مساجد نزد خداست. پس امت او هرگز از مسجد جدا نمی‌شوند، نه در زندگی و نه در مرگ، زیرا این تنها انتقال از پشت زمین به شکم آن است. و ملازم مسجد، همنشین خدا در خانه اوست. پس این امت در زندگی و مرگ همنشینان خدا هستند، زیرا در مسجد (زمین) هستند. همچنین خداوند خاک این زمین را نیز طهور (پاک‌کننده) قرار داد. پس حکم آب را در طهارت دارد، هنگامی که آب نباشد یا توانایی استفاده از آن به دلیل مانعی وجود نداشته باشد. پس خاک این زمین و زمین را برای آنان طهور قرار داد. اگر چیزی از زمین جدا شود، جز خاک، با آن طهارت گرفته نمی‌شود، مگر اینکه خاک باشد. زیرا آنچه از زمین است، تا زمانی که در آن است (مانند معدن، مرمر، زرنیخ و غیره) زمین نامیده می‌شود، زیرا زمین همه این‌ها را دربرمی‌گیرد. اما هنگامی که از زمین جدا شود، به نام خاص خود منفرد می‌شود و نام زمین از آن زایل می‌گردد، پس حکم طهارت از آن زایل می‌شود، مگر خاک (التراب) به طور خاص. پس چه از زمین جدا شود و چه جدا نشود، طهور است، زیرا متطهر (انسان) از آن خلق شده است، پس به ذات خود برای تشریف او پاک می‌کند. پس خداوند نص را بر حکم طهارت با آن (خاک) باقی گذاشت، نه با غیر آن از آنچه نامی غیر از نام زمین دارد. پس اگر خاک از زمین جدا شود، نام زمین از آن زایل می‌شود و نام خاک بر آن باقی می‌ماند، همان‌گونه که نام زمین از زرنیخ زایل شد هنگامی که از زمین جدا شد و نام زرنیخ بر آن باقی ماند. پس طهارت با آن پس از جدایی جایز نیست، زیرا خداوند انسان را از زرنیخ خلق نکرده، بلکه از تراب (خاک) خلق کرده است.\n\nپس رسول خدا (صلی الله علیه و سلم) درباره زمین فرمود: «خداوند آن را برای من مسجد و طهور (پاک‌کننده) قرار داد.»\n\nدر خبر دیگر فرمود: «و خاک آن برای ما طهور قرار داده شد.»\n\nپس خاک (التراب) به واسطه نص، از سایر آنچه زمین است و با جدایی نامش زایل می‌شود، خارج شد. این شش خصلتی است که این پیامبر (صلی الله علیه و سلم) به آن‌ها اختصاص یافت، و این منزلت (المنزلة) بود که غیر او به آن نرسید. این منزلت در هر منزل (المنزل) از دنیا (که ذکر کردیم)، برزخ، قیامت، بهشت و کثیب (تپه) حکمی دارد. پس حکم این اختصاص الهی در هر یک از این منازل (المنازل) ظاهر می‌شود تا شرف او و فضیلتی که خداوند بر دیگران به او داده است، آشکار گردد، با وجود اینکه همه آنچه رسولان به واسطه آن بر یکدیگر فضیلت یافتند، به او داده شده است.\n\n### [از شرط‌های رسالت، ظهور نشانه‌ها بر صدق آن نیست]\n\nسپس ای ولیّ، بدان که از رحمت او (صلی الله علیه و سلم) که خداوند او را با آن مبعوث کرد، این است که خداوند بر زبان او برای ما آشکار ساخت و به او امر کرد که آن را ابلاغ کند، پس ابلاغ کرد که از شرط‌های رسالت، ظهور نشانه‌ها بر صدق آن نیست، بلکه او شخصی است بیم‌دهنده که مأمور به ابلاغ آنچه به ابلاغش امر شده، می‌باشد. این سهم اوست و غیر از آن بر او واجب نیست. اگر نشانه‌ای بر صدق خود بیاورد، آن فضل خداست و در دست او نیست. پس عذر همه پیامبران را در این باره اقامه کرد و در این امر رحمتی برای رسولان بود. در قرآن آمده است: **وقالُوا لَوْ لا نُزِّلَ عَلَيْهِ آيَةٌ من رَبِّهِ** (و گفتند: چرا نشانه‌ای از پروردگارش بر او نازل نمی‌شود؟). و این سخن غیر عرب است، نه سخن عرب، زیرا او قرآن را به عنوان نشانه صدق برای عرب آورد، چرا که اعجاز و نشانه بودن آن را جز عرب نمی‌شناسد. پس نیامده است که او برای هر کس که او را دعوت کرد، از غیر عرب مانند یهود، نصاری و مجوس، نشانه‌ای آشکار ساخت. اما هر نشانه‌ای که آمد، از جانب خدا بود، نه به حکم وجوب بر او و نه بر هیچ‌یک از رسولان دیگر. پس به او گفته شد: **قُلْ لهم إِنَّمَا الْآياتُ عِنْدَ الله وإِنَّما أَنَا نَذِيرٌ مُبِينٌ** (به آنان بگو: همانا نشانه‌ها نزد خداست و من تنها بیم‌دهنده‌ای آشکارم). سپس به او فرمود: **أَ ولَمْ يَكْفِهِمْ أَنَّا أَنْزَلْنا عَلَيْكَ الْكِتابَ يُتْلى‏ عَلَيْهِمْ إِنَّ في ذلِكَ لَرَحْمَةً بهم** (آیا برایشان کافی نیست که ما کتاب را بر تو نازل کردیم که بر آنان تلاوت می‌شود؟ همانا در آن رحمتی برای آنان است). زیرا ما تو را **رَحْمَةً لِلْعالَمِينَ** (رحمتی برای جهانیان) فرستادیم. پس قرآن همه آنچه را که امت‌ها می‌دانند نشانه صدق آورنده آن است، دربرگرفت، زیرا آنان با قرائن احوال می‌دانستند که او نه خوانده، نه نوشته، نه مطالعه کرده، نه معاشرت کرده و نه از شهر خود جدا شده است، بلکه امی (بی‌سواد) از جمله امیان بود. و او از جانب خدا به اموری به آنان خبر داد که می‌دانند کسی با این صفتی که این رسول بر آن است، جز با آگاهی دادن از جانب خدا، آن‌ها را نمی‌داند. پس آنچه در قرآن از این امور آمد، نشانه بود، همان‌گونه که گفتند و طلب کردند. و اعجاز آن برای عرب خاص بود، زیرا به زبان آنان نازل شد و از معارضه با آن بازداشته شدند، یا اینکه این توانایی در قدرتشان نبود بدون اینکه بازداشتی برایشان رخ دهد. پس قرآن آنچه را که کتب پیش از او آورده بودند، آورد، در حالی که او به آنچه در آن‌ها آمده بود، جز از طریق قرآن علمی نداشت. و یهود و نصاری و صاحبان کتب این را دانستند. پس نشانه از نزد خدا حاصل شد، زیرا قرآن از نزد خداست.\n\nپس منزل محمد (صلی الله علیه و سلم) نسبت به دیگر رسولان برای تو آشکار شد. و خداوند او را به علومی اختصاص داد که در غیر او جمع نشده است. از جمله آن‌ها این است که انواع روش‌های وحی را به او عطا کرد. پس به همه آنچه وحی نامیده می‌شود، مانند مبشرات (بشارت‌ها)، انزال بر قلب‌ها و گوش‌ها، و حالت عروج و عدم عروج و غیره، به او وحی شد. و او را به عموم علوم احوال (حالات) همه اختصاص داد. پس علم به هر حال و در هر حال را به صورت ذوقی به او عطا کرد، زیرا او را به سوی همه مردم مبعوث کرد و احوال آنان متفاوت است، پس لازم است که رسالت او علم به همه احوال را دربرگیرد. و خداوند او را به علم زنده کردن مردگان، چه معناً و چه حساً، اختصاص داد. پس علم به حیات معنوی (که همان حیات علوم است) و حیات حسی (که در داستان ابراهیم (علیه السلام) آمده است) را به او عطا کرد، به عنوان تعلیم و آگاهی دادن به رسول خدا (صلی الله علیه و سلم)، و آن قول خداوند است: **نَقُصُّ عَلَيْكَ من أَنْباءِ الرُّسُلِ ما نُثَبِّتُ به فُؤادَكَ وجاءَكَ في هذِهِ الْحَقُّ** (ما از اخبار رسولان بر تو حکایت می‌کنیم تا دلت را به آن استوار سازیم، و در این [داستان‌ها] حق به تو رسیده است). و به علم همه شرایع اختصاص یافت. پس شرایع پیشینیان را برای او آشکار ساخت و به او امر کرد که به هدایت آنان هدایت یابد. و به شریعتی اختصاص یافت که برای غیر او نبود، از جمله آنچه در شش خصلتی که به آن اختصاص یافت، ذکر کردیم. این‌ها چهار منزلت (المنازل) است که غیر او از انبیا (علیهم السلام) در آن‌ها فرود نیامدند. این منزل محمد (صلی الله علیه و سلم) است که آنچه خداوند بر زبان من آسان کرد، از آن ذکر نمودم. پس اکنون آنچه منزل او از علوم دربرمی‌گیرد را ذکر می‌کنیم. از جمله آن‌ها: علم حجاب، یعنی حجاب جحد (انکار) و حجاب حکمت. و علم فارق (جداکننده) که راه‌ها با آن تعیین شدند، مانند قول او: **لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً ولَوْ شاءَ الله لَجَعَلَكُمْ أُمَّةً واحِدَةً** (برای هر یک از شما شریعت و راهی قرار دادیم، و اگر خدا می‌خواست، شما را امتی واحد قرار می‌داد). و آیا آنان امروز با عموم بعثت رسولان، امتی واحد هستند یا خیر؟ و آیا حکم خداوند بر صاحبان کتب به جزیه و باقی گذاشتن آنان بر دینشان، شریعتی از جانب خدا برای آنان بر زبان محمد (صلی الله علیه و سلم) است؟ پس اگر جزیه را با قدرت گیرندگان و خواری از جانب خود بدهند، این برایشان سودمند است، زیرا آنچه مکلف بودند انجام دادند و این سهم آنان از شریعت بود. پس باقی گذاشتن آنان بر شرعشان، شریعت محمدی برای آنان است و با آن سعادتمند می‌شوند. پس مؤاخذه کسی که از آنان به دلیل کوتاهی در شرعی که بر آن هستند، گرفته می‌شود، مانند سایر گناهکارانی است که به همه آنچه شرعشان دربرگرفته عمل نکرده‌اند، اگرچه به آن مؤمن باشند. و این علمی غریب است که نمی‌دانم کسی آن را از فتوحات مکاشفه (الکشف) چشیده باشد، و آن از علوم اسراری است که اهل الله بر آن غیرت ورزیده‌اند و آن را حفظ کرده‌اند. و در آن علم آنچه اکوان (جهان‌ها) در آن متحیر شدند، وجود دارد، که آنچه بود، واقع شد. و در آن علم ایمان مطلق و مقید است. و در آن علم آنچه عمل مشروع را فاسد می‌کند و آنچه آن را اصلاح می‌کند، وجود دارد. و در آن علم سریان حق (الحق) در احکام با وجود اختلافشان و اینکه همه آن‌ها حق از جانب پروردگارند، وجود دارد. و در آن علم کفارات است. و در آن علم آنچه احوال خلق با آن اصلاح می‌شود، وجود دارد. و در آن علم اینکه باطل چیست و حق (الحق) چیست، وجود دارد؛ آیا آن دو امری وجودی هستند یا غیر وجودی؟ و در آن علم شرکت در پیروی و اینکه عاقبت هر پیرو به کجا می‌انجامد، وجود دارد؛ آیا غایت آن یک امر واحد است یا متفاوت؟ و در آن علم کسانی که برایشان مثل زده می‌شود و کسانی که برایشان مثل زده نمی‌شود، وجود دارد. و در آن علم قهر الهی بر دست اکوان (جهان‌ها) وجود دارد. و قول ابویزید بسطامی در این مقام شدیدتر است. و در آن علم گشایش پس از سختی است، و آیا شأن گشایش این است که جز پس از سختی نباشد یا خیر؟ و در آن علم انواع ابتلا است. و در آن علم صفتی است که حیرت را از کسی که به آن مبتلا شده، زایل می‌کند و آشکار ساختن آن. و علم انفاس الهی. و علم سفرها از نتایج سفرها. و علم موعظه‌ها. و علم غلبه‌ای که در آن نصرت الهی نیست، به چه دلیل غالب بوده‌اند. و در آن علم فرق میان علم عین (مشاهده) و علم دلیل، و اینکه آیا دلیل می‌تواند جایگزین عین شود یا خیر، وجود دارد. و در آن علم انواع زینت در عالم است. و در آن علم مراتب علوم و تفصیلات آن‌هاست. و در آن علم قضای سابق از علم منکران قدر است. و در آن علم طبع (مهر زدن)، ختم (پایان دادن)، قفل و کن (پوشاندن) است. و اینکه کوری دیده‌ها و کوری بصیرت‌ها چیست؟ و چرا کوری قلب‌ها به حالت صدور (بازگشت) اختصاص یافته است، که همان بازگشت از حق (الحق) است؟ و آیا آن صدوری است که از ورود پیشین حاصل می‌شود، یا صدور تکوینی ممکن از واجب است، یا صدور محل است که صفتی در آن نیست؟ پس کوری آن از این جهت است که در محل است. پس اگر با نظر خود از محل جدا شود و فرجی برایش باز شود که از آن بنگرد، کوری‌اش زایل می‌شود. و در آن تعیین علوم مزید (المزید) است، زیرا آن‌ها به حکم آنچه زیادت بر آن واقع می‌شود، متفاوتند. و در آن علم آیات و نشانه‌ها بر حوادث است. و در آن علم توحید مرتبه الهی است که جز یک نفر آن را به دست نیاورده است. و در آن علم پرده‌ها و انواع آن‌هاست که بر ما آویخته می‌شوند تا با آن‌ها از درک غیر پنهان شویم، و پرده‌هایی که میان ما و کسی که طلب دیدارش را داریم آویخته می‌شوند و او را نمی‌بینیم، چیستند؟ و در آن علم اقامت در منزل (المنزل) و تقلب در آن است، نه از آن. و در آن علم عنایت به قومی و ترک آن در حق قومی دیگر است. و در آن علم آنچه عزائم (تصمیمات) در خیر و شر نتیجه می‌دهند، وجود دارد. و در آن علم خیر و شرور است. و در آن علم نسبت رحمانی است. و در آن علم آنچه از ایمان سودمند است و آنچه سودمند نیست، وجود دارد، چنانکه فرمود: **أُولئِكَ هُمُ الْكافِرُونَ حَقًّا** (آنان همان کافران حقیقی هستند). و در آن علم دوری و نزدیکی الهی است. و در آن علم آنچه تفکر به آن می‌انجامد، وجود دارد. و در آن علم رجعت (بازگشت) از چه کسی و به سوی چه کسی است. و در آن علم آنچه ظن در آن تأثیر می‌گذارد و آنچه تأثیر نمی‌گذارد، وجود دارد. و در آن علم مشاهده (المشاهدة) و تعلق آن به مشیت (اراده الهی) با وجود آمادگی محل برای پذیرش آن است، و اینکه در آنجا منعی وجود دارد در حالی که محل قابل است، و این مشیت مانع چیست؟ و در آن علم انصاف در مجازات و فضل است. و در آن علم فرق میان اضداد و امثال و غیر امثال است، و غیر از این‌ها از علوم. زیرا من آنچه را که می‌آورم، به قصد حصر (شمارش کامل) نیست، با وجود علمم به آن، بلکه به قصد تنبیه بر آنچه در آن است یا بخشی از آن، بر حسب آنچه برایم پیش می‌آید. پس گاهی آن را به شیوه حصر می‌آورم، به طوری که هیچ علمی را در منزل (المنزل) فرو نمی‌گذارم مگر آنکه به آن اشاره کنم، و گاهی از آن کوتاهی می‌کنم. و **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 7
}