{
  "id": 392,
  "title": {
    "ar": "الباب الثاني والتسعون وثلاثمائة في معرفة منازلة من رحم رحمناه ومن لم يرحم رحمناه ثم غضبنا عليه ونسيناه",
    "en": "Chapter Three Hundred and Ninety-Two: Concerning the Knowledge of the Stations of those upon whom We bestowed Mercy, and those upon whom We bestowed Mercy yet who did not show mercy, then We became wroth with them and forgot them.",
    "ur": "باب تین سو بانوے (۳۹۲) ان لوگوں کے مقامات کی معرفت میں جن پر ہم نے رحم کیا اور ہم نے ان پر رحم فرمایا، اور ان لوگوں کی جنہوں نے رحم نہیں کیا پھر بھی ہم نے ان پر رحم فرمایا، پھر ہم ان پر غضبناک ہوئے اور ہم نے انہیں بھلا دیا۔",
    "fa": "باب سیصد و نود و دوم: در معرفتِ منازل کسی که رحم کرد و ما بر او رحم آوردیم، و کسی که رحم نکرد و ما بر او رحم آوردیم، سپس بر او خشم گرفتیم و او را به فراموشی سپردیم."
  },
  "content": {
    "ar": "## «الباب الثاني والتسعون وثلاثمائة في معرفة منازلة من رحم رحمناه ومن لم يرحم رحمناه ثم غضبنا عليه ونسيناه»\n\n\n> من أراد الحق يطلبه *** في وجود الملك والملكوت‏\n\n\n> كلمات الحق ليست سوى *** ما بدا من عالم عن ثبوت‏\n\n\n> والذي في ليس معدنه *** في مقام نحن عنه سكوت‏\n\n\n> كلما نلناه من كرم *** فهو المدعو بالرحموت‏\n\n\n> والذي البرهان يظهر *** قائم في برزخ الجبروت‏\n\n\n> ظاهر الأكوان باطنها *** رهبوت عينه رغبوت‏\n\n\n> فمال الكون أجمعه *** لمقر العفو والرحموت‏\n\n\n### [الرحم شجنة من الرحمن‏]\n\n\nقال الله تعالى في افتتاح كلامه الجامع بِسْمِ الله الرَّحْمنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ الرَّحْمنِ الرَّحِيمِ وأكد هذا العالم بأن نعته بأنه غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ ولا الضَّالِّينَ وقال صَلَّى اللهُ عَليهِ وسَلَّم في الثابت عنه الرحم شجنة من الرحمن من وصلها وصله الله ومن قطعها قطعه الله‏\n\n\nوقال صَلَّى اللهُ عَليهِ وسَلَّم الراحمون يرحمهم الرحمن ارحموا من في الأرض يرحمكم من في السماء\n\n\nوقال صَلَّى اللهُ عَليهِ وسَلَّم في حديث الشفاعة إن الله يقول شفعت الملائكة وشفع النبيون والمؤمنون وبقي أرحم الراحمين‏\n\n\nاعلم أن العالم لما أقام الله نشأته على التربيع وأعني بالعالم هنا الإنس والجان الذين يعمرون الدارين الجنة والنار جعل في أم الكتاب الذي يقضي على جميع ما يتضمنه العالم أربع رحمات لكل ربع من كل شخص شخص رحمة فضمن الآية الأولى من أم الكتاب وهي البسملة رحمتان وهما قوله الرَّحْمنِ الرَّحِيمِ وضمن الآية الثالثة منها أيضا رحمتين وهما قوله الرَّحْمنِ الرَّحِيمِ فهو رحمن بالرحمتين العامة وهي رحمة الامتنان وهو رحيم بالرحمة الخاصة وهي الواجبة في قوله فَسَأَكْتُبُها لِلَّذِينَ يَتَّقُونَ الآيات وقوله كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ وأما رحمة الامتنان فهي التي تنال من غير استحقاق بعمل وبرحمته الامتنان رحم الله من وفقه للعمل الصالح الذي أوجب له الرحمة الواجبة فبها ينال العاصي وأهل النار إزالة لعذاب عنهم وإن كانت مسكنهم ودارهم جهنم وهذه رحمة الامتنان قوله لنبيه صلَّى الله عليه وسلم‏\nفَبِما رَحْمَةٍ من الله لِنْتَ لَهُمْ وهذا معنى قوله صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ أي الطريق الذي أنعمت بها عليهم وهي الرحمة التي أعطتهم التوفيق والهداية في دار التكليف وهي رحمة عناية فكانوا بذلك غير مغضوب عليهم ولا ضالين لما أعطاهم من الهداية فلم يحاروا يقول من غضب الله عليه امنن علينا بالرحمة التي مننت بها على أولئك ابتداء من غير استحقاق حتى وصفتهم بأنهم غير مغضوب عليهم إذ قد مننت عليهم بالهداية فأزالت الضلالة التي هي الحيرة عنهم فمن بالذي يزيل ما استحققناه من غضب الله فيرحمهم الله برحمة الامتنان وهي الرحمة التي في الآية الثالثة بالاسم الرحمن فيزيل عنهم العذاب ويعطيهم النعيم فيما هم فيه بالاسم الرحيم فليس في أم الكتاب آية غضب بل كلها رحمة وهي الحاكمة على كل آية في الكتاب لأنها الأم فسبقت رحمته غضبه وكيف لا يكون ذلك والنسب الذي بين العالم وبين الله إنما هو من الاسم الرحمن فجعل الرحم قطعة منه فلا تنتسب الرحم إلا إليه وما في العالم إلا من عنده رحمة بأمر ما لا بد من ذلك ولا يتمكن أن تعم رحمة المحدث رحمة القديم في العموم لأن الحق يعم علمه كل معلوم والحق لا يحيط أحد من علمه إلا بما شاء فيرحم الخلق على قدر علمهم كما رحم الله على قدر علمه فكل من غضب من العالم وانتقم فقد رحم نفسه بذلك الانتقام فإنه شفاء له مما يجده من ألم الغضب وصدقة الإنسان على نفسه أفضل الصدقات فإذا رحم نفسه وزال الغضب أعقبته الرحمة وهي الندم الذي يجده الإنسان إذا عاقب أحدا ويقول لو شاء الله كان العفو عنه أحسن لا بد أن يقول ذلك إما دنيا وإما آخرة في انتقامه لنفسه لئلا يتخيل أن إقامة الحدود من هذا القبيل فإن إقامة الحدود شرع من عند الله ما للإنسان فيها تعمل فقد وصل الإنسان بهذا الفعل رحمه وإليه وصول الرحمة فلا بد أن ينال الخلق كلهم رحمة الله فمنهم العاجل والآجل لأنه ما ثم إلا من وصل رحمه فوصله الله من ذلك الوجه ومن قطع رحمه أي بعض رحمه لأن القطع لا يتمكن له أن يعم فإن عين قطع رحم خاص وصل رحم آخر له ففي قطعه وصل وما في وصله قطع فيشفع الموصول من الأرحام والشفاعة مقبولة ويقيم الوزن على المقطوع بالتعريف فإنه لا بد أن يكون أيضا ذلك المقطوع قد قطع رحما له فإذا طلب ممن قطع صلة الرحم عنه يقول له الحق كما آخذ لك آخذ منك ويعلمه بأنه أيضا قد قطع رحما له فيسأل الله العفو والتجاوز فيقول الله له فاعف أنت عن قاطع رحمه فيك حتى أعفو عنك فبالضرورة يقول قد عفوت لأن ذلك الموطن يطلب من الخائف طلب العفو فيعفو فيعفو الله عنه فتناله رحمة الله بعفو هذا ويوصل رحم آخر له فيشفع فيه وهذا معنى‏\n\n\nقول الله عز وجل يوم القيامة شفعت الملائكة وشفع النبيون والمؤمنون وبقي أرحم الراحمين‏\n\n\nفيكون منه في عباده ما ذكرناه وأمثاله من كل ما يستدعي الرحمة فإن رحمة الله سبقت غضبه فهي إمام الغضب فلا يزال غضب الله يجري في شأوه بالانتقام من العباد حتى ينتهي إلى آخر مداه فيجد الرحمة قد سبقته فتتناول منه العبيد المغضوب عليهم فتنبسط عليهم ويرجع الحكم لها فيهم والمدى الذي يعطيه الغضب هو ما بين الرَّحْمنِ الرَّحِيمِ الذي في البسملة وبين الرَّحْمنِ الرَّحِيمِ الذي بعد قوله الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ فالحمد لله رب العالمين هو المدى فأوله الرَّحْمنِ الرَّحِيمِ وانتهاؤه الرَّحْمنِ الرَّحِيمِ وإنما كان الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ عين المدى فإن في هذا المدى تظهر السراء والضراء ولهذا كان فيه الحمد وهو الثناء ولم يقيد بضراء ولا سراء في هذا المدى لأنه يعم السراء والضراء\n\n\nفكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول في السراء الحمد لله المنعم المفضل وفي الضراء الحمد لله على كل حال‏\n\n\nفحمد الله قد جاء في السراء والضراء فلهذا كان عين المدى وما من أحد في الدار الآخرة إلا وهو يحمد الله ويرجو رحمته ويخاف عذابه واستمراره عليه فجعل الله عقيب قوله الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ قوله الرَّحْمنِ الرَّحِيمِ فالعالم بين هذه الرحمة ورحمة البسملة بما هو عليه من محمود ومذموم وهذا شبيه بما جاء في سورة أ لم نشرح قوله تعالى فَإِنَّ مَعَ الْعُسْرِ يُسْراً ثم إِنَّ مَعَ الْعُسْرِ يُسْراً ولقد أنشد بعضهم في هذا\n\n\n> إذا ضاق بك الأمر *** ففكر في أ لم نشرح‏\n\n\n> فعسر بين يسيرين *** إذا ذكرته فافرح‏\n\n\nلأنه سبحانه نكر اليسر وأدخل الألف واللام اللتين للعهد والتعريف على العسر أي هذا العسر الثاني هو عين الأول وليس ذلك في اليسر وهو تنبيه عجيب من الله لعباده ليقوى عندهم الرجاء والطمع في رحمة الله فإنه أرحم الراحمين فإنه إن لم يزد على عبيده في الرحمة بحكم ليس لهم فما يكون أرحم الراحمين وهو أرحم الراحمين بلا شك فو الله لا خاب من‏\nأحاطت به رحمة الله من جميع جهاته فاعلم ذلك وإذا صحت الحقائق فليقل الأخرق ما شاء فإن جماعة نازعونا في ذلك ولو لا إن رحمة الله بهذه المثابة من الشمول لكان القائلون بمثل هذا لا ينالهم رحمة الله أبدا فالله أسأله أن لا يلحقنا بالجاهلين فإنه ما ثم صفة ولا عتوبة أقبح من الجهل فإن الجهل مفتاح كل شر ولهذا قال لمحمد صَلَّى اللهُ عَليهِ وسَلَّم فَلا تَكُونَنَّ من الْجاهِلِينَ خاطبه بمثل هذا الخطاب لحداثة سنه وقوة شبابه فقابله بخطاب قوي في النهي عن ذلك وقال تعالى لنوح عليه السلام لما لم يكن له قوة الشباب وكان قد شاخ وحصل في العمر الذي لا يزال فيه محترما مرفوقا به في العرف والعادة إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ فرفق به في الخطاب حين وعظه فإنه لا بد من الفرق بين خطاب الشباب وخطاب الشيوخ كما أنه لا بد من الفرق في الخطاب بين الأحوال كما نفرق نحن في الثناء على الله بالأحوال فنقول في خطاب السراء الحمد لله المنعم المفضل ونقول في الضراء الحمد لله على كل حال لاختلاف الباعث على الحمد علمنا ذلك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بفعله فأما الرحماء من عباد الله بعباد الله بل بخلق الله مطلقا فإن الله يسرع إليهم بالرحمة عند ما يلقونه إذا رحموا الخلق لرحمة تقوم بنفوسهم بعطفهم على خلق الله فيرحمهم الله‏\n\n\nفإنها أعمالهم ترد عليهم كما ورد في الخبر\n\n\nفبرحمتهم رحمهم الله سبحانه‏\n\n\n> فلا تحالف ولا تشاقق *** وكن صدوقا ولا تفارق‏\n\n\nفمن رحم خلق الله فإنما رحم نفسه ثم إن لله رحمة أخرى بهم زائدة على ما رحمهم به من أجل رحمتهم بخلق الله التي هي من أعمالهم وصورتها إن الراحم منا إذا رحم خلقا من خلق الله فلا يخلو إما أن تكون رحمته به إزالة ما يؤلم ذلك الخلق المرحوم خاصة أو يزيده مع ذلك إحسانا مثل من يخرج شخصا من السجن استحق العذاب وحال بينه وبين نزول العذاب به بشفاعة منه أو يكون هو الآخذ له ثم يعقبه بعد هذا الأمان إحسانا إليه بتولية أو مال أو خلع أو تقريب فذلك أمر آخر فإذا رحم الله عبدا بعلمه الذي رحم العبد به حيوانا مثله إما بإزالة عذاب أو أضاف إلى ذلك زيادة إحسان فإن الله إذا وفاه رحمة جزاء عمله كان ما كان فإن الله يزيده على ذلك كما زاد هذا العبد على ما ذكرنا أو يزيد ابتداء منة منه تعالى لذلك‏\n\n\nقال الراحمون يرحمهم الرحمن‏\n\n\nولم يقل يرحمهم الرحيم لأنه رحمن الدنيا والآخرة والرحيم اختصاص الرحمة بالآخرة وأما\n\n\nقوله ارحموا من في الأرض يرحمكم من في السماء\n\n\nلأنكم تشاهدون أصحاب البلايا والزوايا وتتجاوزون عنهم فترحمونهم عن أمر الله بالرحمة التي تطلبها أحوالهم كل على حسب حاله يرحم وليس في السماء إلا الملائكة فترحمنا بالاستغفار وهو قوله تعالى ويَسْتَغْفِرُونَ لِمَنْ في الْأَرْضِ ثم قال أَلا إِنَّ الله هُوَ الْغَفُورُ الرَّحِيمُ وأما قوله في هذا الباب ونسيناه في هذه المنازلة فهو حد نسيان ذلك الإنسان الله في الأشياء فما عاد عليه إلا نسيانه وأضافه الحق إليه فقال نَسُوا الله فَنَسِيَهُمْ أي تركوا حق الله فترك الله الحق الذي يستحقونه بأجرامهم فلم يؤاخذهم ولا آخذهم أخذ الأبد فغفر لهم ورحمهم وهذا يخالف ما فهمه علماء الرسوم فإنه من باب الإشارة لا من باب التفسير لأن الناسي هنا إذا لم ينسب إلا حق الله الذي أمره الله بإتيانه شرعا فقد نسي الله فإنه ما شرعه له إلا الله فترك حق الله فأظهر الله كرمه فيه فترك حقه ولم يكن حق مثل هذا إلا ما يستحقه وهو العقاب فعفا عنه تركا بترك مقولا بلفظ النسيان وأما نهيه تعالى إيانا أن نكون كَالَّذِينَ نَسُوا الله فنسيهم فهو صحيح فإنها وصية إلهية نهانا أن ننسى الله مثل ما نسوة هؤلاء لنقوم بحق الله ونقيم حق الله في الأشياء على نية صالحة وحضور مع الله فيجازينا الله جزاء استحقاق استحققناه بأعمالنا التي وفقنا الله لها والذين نسوا الله إنما ترك الله ما استحقوه من العقاب كما تركوا حق الله لا غير ثم إن أفضل عليهم أفضل عليهم منة منه ابتداء وإفضاله على العالمين المؤدين حقوق الله ليس منة فإذا زاد على ما يطلبه عملهم ذلك هو الامتنان كما نالوا ما استحقوا به هذا الثواب من طريق المنة فاعلم ذلك ألا ترى الله يقول في تمام هذه الآية لما قال ولا تكونوا كالذين نَسُوا الله فَنَسِيَهُمْ لم يقل إنهم هم الفاسقون بل قال إِنَّ الْمُنافِقِينَ هُمُ الْفاسِقُونَ فابتدأ كلاما آخر ما فيه ضمير يعود على هؤلاء المذكورين وكل منافق فاسق لأنه خارج من كل باب له فيخرج للمؤمنين بصورة ما هم عليه ويخرج للكافرين بصورة ما هم عليه وقد تقدم في هذا الكتاب مرتبة المنافقين في المنازل فتنبه لما نبهتك عليه وكن من العالمين الَّذِينَ يُوفُونَ بِعَهْدِ الله ...\nفَنِعْمَ أَجْرُ الْعامِلِينَ ولا تقنع بعفو الله فتكون ممن نسي الله بل ارغب في إحسانه بأن يزيدك هنا عملا ومراقبة فيزيدك عنده جاها وحرمة وأما قوله تعالى ناهيا إيانا بقوله ولا تَكُونُوا كَالَّذِينَ نَسُوا الله فَأَنْساهُمْ أَنْفُسَهُمْ أُولئِكَ هُمُ الْفاسِقُونَ فأعاد الضمير عليهم فهذا نمط آخر ذكرنا حقيقته في مسألة شرف النفاق وهو النفاق المحمود في المنازل فيما عبر من هذا الكتاب فلنذكر منه ما يليق بهذا الموضع من أجل النسيان وذلك‏\n\n\nأن الله قال على لسان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nلما جعلنا دليلا عليه ولا ينبغي أن ننظر في معرفة نفوسنا إلا حتى نريد أن نعرف ربنا فإذا نسينا هذه المعرف فقد نسينا معرفة نفوسنا وهو الباب الواحد الذي كان ينبغي لنا أن نخرج عليه إلى هذه المعرفة فخرجنا على الباب الآخر وهو الذي نخرج منه إلى جهلنا بنفوسنا ولما خلقنا الله على الصورة الإلهية كان في نسياننا الله إن إنسانا الله أنفسنا فنهينا عن ذلك فإنه من نسي نفسه بالضرورة نسي ما لله عليها من الحقوق وما لها من الحقوق فتركوا الله إذا علموا أنهم لا يشهدون من الله ما هو الله عليه وإنما يشهدون من الله أعيانهم وأحوالهم لا غير فلما علم الله هذا من بعض عباده الذين لهم هذا الوصف أنساهم أنفسهم فلم يروا عند شهودهم أن أحوالهم عين ما رأوا فيقولون في ذلك الشهود قال لي الله وقلت له وأين هذا من مقام قولهم لا نرى من الحق إلا ما نحن عليه فلم يكن لهم ذلك إلا من كونه تعالى أنساهم أنفسهم ف أُولئِكَ هُمُ الْفاسِقُونَ الخارجون عن طريق ما كانوا تحققوا به من أن الله لا يشهده أحدا لا من حيث حاله وما هو عليه ولما وصف نفسه تعالى بأنه خَيْرُ الرَّاحِمِينَ من باب المفاضلة فمعلوم أنه ما يرحم أحد من المخلوقين أحدا إلا بالرحمة التي أوجدها الرحمن فيه فهي تعالى رحمته لا رحمتهم ظهرت في صورة مخلوق كما قال في سمع الله لمن حمده إن ذلك القول هو قول الله على لسان عبده فقوله تعالى الذي سمعه موسى أتم في الشرف من قوله تعالى على لسان قائل فوقع التفاضل بالمحل الذي سمع منه القول المعلوم أنه قول الله وكذلك أيضا رحمته من حيث ظهورها من مخلوق أدنى من رحمته بعبده في غير صورة مخلوق فتعين التفاضل والأفضلية بالمحال إلا إن رحمة الله بعبده في صورة المخلوق تكون عظيمة فإنه يرحم عن ذوق فيزيل برحمته ما يجده الراحم من الألم في نفسه من هذا المرحوم والحق ليس كذلك فرحمته خالصة لا يعود عليه منها إزالة ألم فهو خير الراحمين فرحمة المخلوق عن شفقة ورحمة الله مطلقة بخلاف بطشه وانتقامه مع شدته ولكن لا يبطش بطشا لا يكون فيه رحمة لأن قصارى الرحمة فيه إيجاده البطش بعبده فوجود البطش رحمة رحم الله بها المبطوش إذ أخرجه من العدم إلى الوجود ومن كان مخلوقا من صفة الرحمة فلا بد أن يكون في بطشه رحمة فجاء أبو يزيد في هذا المقام لما سمع القارئ يقرأ إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ قال أبو يزيد بطشي أشد لأن بطش الإنسان إذا بطش لا يكون في بطشه شي‏ء من الرحمة لأنه لا يتمكن له أن يبطش بأحد وعنده رحمة به جملة واحدة فما يكون ذلك البطش إلا بحسب ما أعطاه محل الباطش وإن كان ذلك البطش خلقا لله ولكن ما خلقه إلا في هذا المحل فظهر بصورة المحل والمحل لا يطلب الانتقام من أحد وفي قلبه رحمة ثم إن الله إذا بطش بعبده ففي بطشه نوع رحمة لأنه عبده بلا شك كما إن المخلوق إذا أراد أن يبطش بعبده لا بد أن يشوب بطشه نوع رحمة للمناسبة التي بينه وبين عبده ومملوكه لأنه المبقي عليه اسم المالك والسيادة فلا يمكن أن يستقصي في بطشه ما يذهب عينه فيكون عند ذلك قد بطش بنفسه والمخلوق ليس كذلك في الأجنبي الذي ليس بينه وبين الباطش نسبة عبودية ولا اكتسب من وجوده صفة سيادة فإذا بطش من هذه صفته بطش ببطش لا تشوبه رحمة فهو سبحانه خَيْرُ الرَّاحِمِينَ وما جاء قط عنه تعالى أنه خير الآخذين ولا الباطشين ولا المنتقمين ولا المعذبين كما جاء خَيْرُ الْفاصِلِينَ وخَيْرُ الْغافِرِينَ وخَيْرُ الرَّاحِمِينَ وخير الشاكرين وأمثال هذا مع كونه يبطش وينتقم ويأخذ ويهلك ويعذب لا بطريق الأفضلية فتحقق هذا الفاصل بين وصفه بالأخذ والانتقام وبين وصفه بالرحمة والمغفرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Ninety-Two concerning the Gnosis of the Station of those whom We have shown mercy, those whom We have shown mercy but who did not show mercy, and then those upon whom We became wrathful and whom We forgot.\n\nHe who desires the Real (الحق) seeks Him\nin the existence of the Dominion (الملك) and the Kingdom (الملكوت).\n\nThe Words of the Real are nothing other than\nwhat appeared from the world based on establishment.\n\nAnd that which is in 'is not' has its source\nin a station about which we are silent.\n\nEverything we attain of generosity\nis what is called the Divine Mercy (الرحموت).\n\nAnd that which the proof manifests\nstands in the Isthmus (برزخ) of Power (الجبروت).\n\nThe manifest of the universes is their inner reality,\nAwe (رهبوت), whose very essence is Desire/Hope (رغبوت).\n\nThus, the entire cosmos inclines\ntoward the abode of Pardon and Divine Mercy (الرحموت).\n\n### [The Womb/Kinship is a Tie from the All-Merciful]\n\nAllah the Exalted said in the opening of His comprehensive speech: <<بِسْمِ الله الرَّحْمنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ الرَّحْمنِ الرَّحِيمِ>> (In the Name of Allah, the All-Merciful, the Compassionate. Praise be to Allah, Lord of the Worlds, the All-Merciful, the Compassionate). He confirmed this world by describing it as <<غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ ولا الضَّالِّينَ>> (neither those upon whom wrath has fallen nor those who are astray). The Prophet, may Allah bless him and grant him peace, said in an established tradition: \"The Womb/Kinship (الرحم) is a tie (شجنة) from the All-Merciful (الرحمن). Whoever connects it, Allah connects him, and whoever cuts it, Allah cuts him off.\"\n\nThe Prophet, may Allah bless him and grant him peace, also said: \"The merciful ones are shown mercy by the All-Merciful. Be merciful to those on earth, and He Who is in the heaven will be merciful to you.\"\n\nAnd the Prophet, may Allah bless him and grant him peace, said in the Hadith of Intercession: \"Indeed, Allah says: 'The angels have interceded, and the Prophets have interceded, and the believers have interceded, and there remains the Most Merciful of the Merciful (أرحم الراحمين).'\"\n\nKnow that when Allah established the origination (نشأة) of the World (العالم) upon the basis of four (التربيع)—and by the World here I mean humans and jinn who inhabit the two abodes, Paradise and the Fire—He placed in the Mother of the Book (أم الكتاب), which decrees all that the World encompasses, four Mercies. For each quarter of every person, there is one Mercy. Thus, the first verse of the Mother of the Book, which is the *Basmala*, contains two Mercies, namely His saying: *al-Rahmān, al-Rahīm* (the All-Merciful, the Compassionate). And the third verse of it also contains two Mercies, namely His saying: *al-Rahmān, al-Rahīm*.\n\nHe is the All-Merciful (الرحمن) by the General Mercy, which is the Mercy of Favor/Grace (رحمة الامتنان). And He is the Compassionate (الرحيم) by the Specific Mercy, which is the Obligatory Mercy, as in His saying: <<فَسَأَكْتُبُها لِلَّذِينَ يَتَّقُونَ>> (I shall prescribe it for those who are righteous...) and His saying: <<كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ>> (Your Lord has prescribed Mercy upon Himself).\n\nAs for the Mercy of Favor, it is that which is attained without deserving it through action. It is by His Mercy of Favor that Allah shows mercy to those whom He grants success (وفق) for the righteous deed that necessitates the Obligatory Mercy. It is also by this Mercy that the disobedient and the people of the Fire attain the removal of torment from them, even though their dwelling and abode is Hell. This Mercy of Favor is His saying to His Prophet, may Allah bless him and grant him peace: <<فَبِما رَحْمَةٍ من الله لِنْتَ لَهُمْ>> (It is by a Mercy from Allah that you were lenient with them).\n\nThis is the meaning of His saying: <<صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ>> (The path of those You have favored), meaning the path by which He favored them, which is the Mercy that granted them success and guidance in the Abode of Responsibility (دار التكليف). This is the Mercy of Providence (رحمة عناية). By this, they were neither those upon whom wrath has fallen nor those who are astray, due to the guidance He granted them, so they were not bewildered.\n\nHe upon whom Allah’s wrath has fallen says: \"Grant us, by the Mercy with which You favored those others initially, without their deserving it, until You described them as those upon whom wrath has not fallen, since You favored them with guidance and removed the straying, which is bewilderment, from them. So, grant us favor with that which removes what we deserved of Allah’s wrath!\"\n\nThus, Allah shows them mercy through the Mercy of Favor, which is the Mercy in the third verse by the Name *al-Rahmān*. He removes the torment from them and grants them bliss in their state by the Name *al-Rahīm*.\n\nThere is no verse of Wrath in the Mother of the Book; rather, all of it is Mercy, and it is the ruling authority over every verse in the Book because it is the Mother. Thus, His Mercy preceded His Wrath. How could it be otherwise, when the relationship (النسب) between the World and Allah is only through the Name *al-Rahmān*? He made the Womb/Kinship (الرحم) a piece of Himself, so the Womb/Kinship is only attributed to Him. Everything in the World comes only from Him as a Mercy, by an imperative that is necessary.\n\nThe mercy of the originated being (المحدث) cannot encompass the Mercy of the Eternal (القديم) in universality, because the Knowledge of the Real encompasses every known thing, and no one encompasses anything of His Knowledge except what He wills. Thus, He shows mercy to creation according to their knowledge, just as Allah showed mercy according to His Knowledge.\n\nEveryone in the World who becomes wrathful and takes vengeance has thereby shown mercy to himself, for that vengeance is a cure for the pain of wrath he feels. And a person's charity upon himself is the best of charities. When he shows mercy to himself and the wrath departs, Mercy follows it, which is the regret a person feels after punishing someone, saying, \"Had Allah willed, forgiveness would have been better.\" He must say this, either in this world or the Hereafter, regarding his vengeance for himself—lest one imagine that the establishment of legal punishments (إقامة الحدود) falls under this category, for the establishment of punishments is a Law from Allah, in which the human has no personal action.\n\nBy this action, the human has connected his kinship (رحمه), and to him comes the connection of Mercy. Thus, all creation must attain Allah’s Mercy, some immediately and some later, because there is no one who connected his kinship whom Allah did not connect in that respect, and no one who cut his kinship—meaning a part of his kinship—because cutting cannot be total. The very act of cutting a specific kinship is the connection of another kinship for him. So, in his cutting there is connection, and in his connection there is no cutting.\n\nThe connected kinships intercede, and intercession is accepted. The balance is established upon the cut kinship by way of instruction. For that cut kinship must also have cut a kinship of its own. When the one who cut the kinship is sought, the Real says to him: \"Just as I take for you, I take from you.\" And He informs him that he, too, has cut a kinship of his own. So, he asks Allah for pardon and forgiveness. Allah says to him: \"Then you forgive the one who cut your kinship, so that I may forgive you.\" Necessarily, he says, \"I have forgiven,\" because that station demands the fearful one to seek pardon, and he forgives. Then Allah forgives him, and Allah’s Mercy reaches him through the pardon of this one, and another kinship of his is connected, and intercession is made for him.\n\nThis is the meaning of the saying of Allah, the Mighty and Majestic, on the Day of Resurrection: \"The angels have interceded, and the Prophets have interceded, and the believers have interceded, and there remains the Most Merciful of the Merciful.\"\n\nThus, what we have mentioned, and similar instances of everything that calls for Mercy, will proceed from Him toward His servants. For Allah’s Mercy preceded His Wrath; it is the leader of Wrath. Allah’s Wrath continues to run its course by taking vengeance upon the servants until it reaches its final limit (مدى). There, it finds that Mercy has preceded it, and Mercy takes hold of the wrathful servants and spreads over them, and the ruling returns to Mercy concerning them.\n\nThe limit (المدى) that Wrath is granted is the space between *al-Rahmān, al-Rahīm* in the *Basmala* and *al-Rahmān, al-Rahīm* after His saying <<الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (Praise be to Allah, Lord of the Worlds). *Praise be to Allah, Lord of the Worlds* is the limit. Its beginning is *al-Rahmān, al-Rahīm*, and its end is *al-Rahmān, al-Rahīm*.\n\nThe reason *Praise be to Allah, Lord of the Worlds* is the very limit is that within this limit, joy (سراء) and distress (ضراء) appear. This is why praise (الحمد), which is commendation, is contained within it, and it is not restricted to distress or joy in this limit, because it encompasses both joy and distress.\n\nThus, the Messenger of Allah, may Allah bless him and grant him peace, used to say in times of joy: \"Praise be to Allah, the Benefactor, the Gracious,\" and in times of distress: \"Praise be to Allah in every state.\"\n\nPraise of Allah occurs in both joy and distress, which is why it is the very limit. There is no one in the Hereafter who does not praise Allah, hope for His Mercy, and fear the continuation of His punishment upon him.\n\nTherefore, Allah placed His saying *al-Rahmān, al-Rahīm* immediately following His saying *Praise be to Allah, Lord of the Worlds*. The World stands between this Mercy and the Mercy of the *Basmala*, in all its praiseworthy and blameworthy aspects.\n\nThis is similar to what came in Surah *Alam Nashrah* (The Relief), His saying: <<فَإِنَّ مَعَ الْعُسْرِ يُسْراً>> (Indeed, with hardship comes ease), and then <<إِنَّ مَعَ الْعُسْرِ يُسْراً>> (Indeed, with hardship comes ease). Someone recited poetry concerning this:\n\nIf the matter becomes difficult for you,\nthen reflect upon *Alam Nashrah*.\nFor one hardship is between two eases;\nwhen you remember it, rejoice.\n\nThis is because He, Glory be to Him, made the ease (يسر) indefinite, while He introduced the definite article (*alif* and *lam*) for covenant and definition upon the hardship (العسر), meaning that this second hardship is the very same as the first. This is not the case with the ease. This is a marvelous divine notification to His servants so that hope and desire for Allah’s Mercy may be strengthened within them, for He is the Most Merciful of the Merciful. If He did not increase His servants in Mercy by a decree that is not theirs, He would not be the Most Merciful of the Merciful, and He is the Most Merciful of the Merciful without doubt. By Allah, he who is encompassed by Allah’s Mercy from all directions is never disappointed. Know this.\n\nIf the Realities (الحقائق) are sound, let the fool say what he wishes. A group of people disputed with us concerning this. Were Allah’s Mercy not of this encompassing nature, those who speak such things would never attain Allah’s Mercy. I ask Allah not to join us with the ignorant, for there is no attribute or reproach uglier than ignorance. Ignorance is the key to all evil.\n\nThis is why He said to Muhammad, may Allah bless him and grant him peace: <<فَلا تَكُونَنَّ من الْجاهِلِينَ>> (So be not among the ignorant). He addressed him with such a strong address due to his youth and the strength of his vigor. He countered him with a strong address in the prohibition of that.\n\nAnd Allah the Exalted said to Noah, peace be upon him, when he did not have the strength of youth but was old and had reached an age where he is customarily respected and treated gently: <<إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ>> (Indeed, I advise you lest you be among the ignorant). He treated him gently in the address when He advised him, for there must be a difference between addressing the young and addressing the old, just as we must differentiate in addressing different states. We differentiate in praising Allah according to the states, saying in the address of joy: \"Praise be to Allah, the Benefactor, the Gracious,\" and in distress: \"Praise be to Allah in every state,\" due to the difference in the motive for praise. The Messenger of Allah, may Allah bless him and grant him peace, taught us this through his action.\n\nAs for the merciful ones among Allah’s servants toward Allah’s servants—indeed, toward creation absolutely—Allah hastens Mercy to them when they meet Him, because they showed mercy to creation out of a mercy established in their souls, through their compassion for Allah’s creation. Thus, Allah shows them mercy.\n\nFor their deeds return to them, as mentioned in the tradition.\n\nIt is by their mercy that Allah the Exalted shows them mercy.\n\nSo do not oppose, nor be hostile,\nbut be truthful and do not separate.\n\nWhoever shows mercy to Allah’s creation has only shown mercy to himself. Then, Allah has another Mercy for them, exceeding what He showed them mercy with, due to their mercy toward Allah’s creation, which is from their deeds.\n\nThe form of this is that when one of us shows mercy to a creature of Allah, that mercy is either solely the removal of what pains that creature, or it is that plus an addition of beneficence. For example, one who releases a person from prison who deserved punishment, or intervenes to prevent punishment through intercession, or is the one who seized him and then follows this security with beneficence toward him through an appointment, wealth, a robe of honor, or closeness—that is another matter.\n\nWhen Allah shows mercy to a servant through the knowledge that the servant used to show mercy to an animal like himself, either by removing torment or by adding an increase of beneficence, then when Allah fulfills the Mercy as a reward for his deed, whatever it may be, Allah increases him beyond that, just as this servant increased beyond what we mentioned, or He increases him initially as a favor (منة) from Him, the Exalted.\n\nHe said: \"The merciful ones are shown mercy by the All-Merciful (الرحمن).\"\n\nHe did not say: \"The Compassionate (الرحيم) shows them mercy,\" because *al-Rahmān* is the All-Merciful of this world and the Hereafter, while *al-Rahīm* is the specialization of Mercy in the Hereafter.\n\nAs for His saying: \"Be merciful to those on earth, and He Who is in the heaven will be merciful to you,\" this is because you witness those afflicted by trials and those in seclusion, and you overlook their faults, so you show them mercy according to Allah’s command for the Mercy that their states demand, each according to his condition. There are only angels in the heaven, and they show us mercy by seeking forgiveness (استغفار), which is His saying: <<ويَسْتَغْفِرُونَ لِمَنْ في الْأَرْضِ>> (And they seek forgiveness for those on earth). Then He said: <<أَلا إِنَّ الله هُوَ الْغَفُورُ الرَّحِيمُ>> (Unquestionably, Allah is the Forgiving, the Compassionate).\n\nAs for His saying in this chapter, \"and whom We forgot (نسيناه)\" in this station, it is the limit of that person's forgetfulness of Allah in things. Nothing returned to him except his forgetfulness. The Real attributed it to Himself, saying: <<نَسُوا الله فَنَسِيَهُمْ>> (They forgot Allah, so He forgot them). That is, they abandoned the right of Allah (حق الله), so Allah abandoned the right they deserved by their crimes. He did not hold them accountable, nor did He seize them with eternal seizure. He forgave them and showed them mercy. This contradicts what the scholars of outward forms (علماء الرسوم) understood, for it belongs to the category of allusion (إشارة), not interpretation (تفسير).\n\nThe one who forgets here, when he only neglects the right of Allah that Allah commanded him to fulfill legally, has forgotten Allah, for only Allah legislated it for him. He abandoned Allah’s right, so Allah manifested His generosity in him and abandoned His right. The only right such a person had was what he deserved, which was punishment. So, He pardoned him, an abandonment for an abandonment, expressed by the word forgetfulness.\n\nAs for His prohibition to us from being <<كَالَّذِينَ نَسُوا الله فَنَسِيَهُمْ>> (like those who forgot Allah, so He forgot them), this is correct, for it is a divine injunction forbidding us from forgetting Allah as those people forgot Him, so that we may fulfill Allah’s right and establish Allah’s right in things with a sound intention and presence with Allah. Then Allah will reward us with a deserved reward that we earned through our deeds, to which Allah granted us success.\n\nAs for those who forgot Allah, Allah only abandoned the punishment they deserved, just as they abandoned Allah’s right, nothing more. If He favors them beyond that, He favors them as an initial favor (منة) from Him. His favor upon the worlds who fulfill Allah’s rights is not a favor (منة). If He increases beyond what their action demands, that is the Favor (الامتنان), just as they attained what they deserved of this reward through the path of Favor. Know this.\n\nDo you not see that Allah says at the end of this verse, after saying: \"And be not like those who forgot Allah, so He forgot them,\" He did not say, \"They are the transgressors (الفاسقون),\" but rather said: <<إِنَّ الْمُنافِقِينَ هُمُ الْفاسِقُونَ>> (Indeed, the hypocrites are the transgressors)? He began a new statement that contains no pronoun referring back to those previously mentioned. Every hypocrite (منافق) is a transgressor because he exits every door he enters. He appears to the believers in their form and appears to the disbelievers in their form. The station of the hypocrites has been discussed previously in the stations of this Book. Be alert to what I have alerted you to, and be among the knowing ones <<الَّذِينَ يُوفُونَ بِعَهْدِ الله... فَنِعْمَ أَجْرُ الْعامِلِينَ>> (who fulfill the covenant of Allah... and excellent is the reward of the workers). Do not be content with Allah’s pardon, lest you be among those who forgot Allah. Rather, desire His beneficence by increasing you in action and vigilance here, so that He may increase you in status and sanctity with Him.\n\nAs for His saying, prohibiting us: <<ولا تَكُونُوا كَالَّذِينَ نَسُوا الله فَأَنْساهُمْ أَنْفُسَهُمْ أُولئِكَ هُمُ الْفاسِقُونَ>> (And be not like those who forgot Allah, so He made them forget themselves. Those are the transgressors), where He returned the pronoun to them, this is another pattern whose reality we mentioned in the discussion of the honor of hypocrisy (شرف النفاق), which is the Praiseworthy Hypocrisy in the stations mentioned in this Book.\n\nLet us mention here what is appropriate for this context concerning forgetfulness.\n\nAllah said through the tongue of the Messenger of Allah, may Allah bless him and grant him peace: \"Whoever knows himself knows his Lord.\"\n\nSince He made us a guide to Him, we should not look into the knowledge of ourselves unless we intend to know our Lord. If we forget this knowledge, we have forgotten the knowledge of ourselves, which is the single door through which we ought to exit to this Gnosis. Instead, we exited through the other door, which is the door through which we exit to our ignorance of ourselves.\n\nSince Allah created us upon the Divine Form (الصورة الإلهية), our forgetting of Allah meant that He made us forget ourselves. Thus, we were prohibited from that, for whoever forgets himself necessarily forgets the rights Allah has over him and the rights he has.\n\nThey abandoned Allah when they knew that they do not witness of Allah what Allah truly is, but rather they only witness their own essences (أعيانهم) and states (أحوالهم). When Allah knew this about some of His servants who possess this description, He made them forget themselves. Thus, when they witnessed, they did not see that their states were the very thing they saw. They say in that witnessing: \"Allah spoke to me, and I spoke to Him.\" Where is this compared to the station of their saying: \"We see nothing of the Real except what we are upon\"?\n\nThis was only granted to them because He, the Exalted, made them forget themselves. <<أُولئِكَ هُمُ الْفاسِقُونَ>> (Those are the transgressors), meaning those who transgress the path of what they had realized: that no one witnesses Allah except through the aspect of his own state and what he is upon.\n\nWhen He described Himself as <<خَيْرُ الرَّاحِمِينَ>> (The Best of the Merciful) by way of comparison, it is known that no creature shows mercy to another except by the Mercy that the All-Merciful (الرحمن) created in him. Thus, it is His Mercy, the Exalted, not their mercy, that appeared in the form of a creature. Just as He said concerning \"Allah hears the one who praises Him\" that this saying is the saying of Allah upon the tongue of His servant, so too is the saying of the Exalted that Moses heard more honorable than His saying upon the tongue of a speaker. Thus, the superiority occurs through the locus from which the saying, known to be the saying of Allah, was heard.\n\nLikewise, His Mercy, in terms of its manifestation through a creature, is lower than His Mercy to His servant not in the form of a creature. Thus, superiority and preference are determined by the loci. However, Allah’s Mercy to His servant in the form of a creature is great, for He shows mercy based on taste (ذوق). By His Mercy, He removes the pain that the merciful one feels in his soul concerning the one being shown mercy. The Real is not like that; His Mercy is pure (خالصة) and does not return to Him by way of removing pain. Thus, He is the Best of the Merciful.\n\nThe mercy of the creature stems from compassion (شفقة), while the Mercy of Allah is absolute, unlike His severity (بطش) and vengeance, despite their intensity. However, He does not strike a blow that lacks Mercy, because the ultimate Mercy in it is His creation of the blow upon His servant. The existence of the blow is a Mercy with which Allah showed mercy to the one struck, since He brought him out of non-existence into existence. Whoever is created from the attribute of Mercy must have Mercy in his severity.\n\nAbu Yazid came to this station when he heard the reciter read: <<إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ>> (Indeed, the severity of your Lord is intense). Abu Yazid said: \"My severity is more intense,\" because when a human strikes a blow, there is nothing of Mercy in his severity, for he cannot strike someone while having complete mercy for him simultaneously. That severity is only according to what the locus of the striker grants, even if that severity is a creation of Allah. But He only created it in this locus, so it appeared in the form of the locus. The locus does not seek vengeance from anyone while having Mercy in his heart.\n\nFurthermore, when Allah strikes His servant, there is a kind of Mercy in His severity, for he is undoubtedly His servant. Similarly, when a creature intends to strike his servant, his severity must be mixed with a kind of Mercy due to the affinity between him and his servant and property, because he is the one who maintains the name of the owner and the master. He cannot exhaust his severity to the point of destroying his essence, for then he would have struck himself.\n\nThe creature is not like this regarding a stranger with whom there is no relationship of servitude, nor has he acquired the attribute of mastery from his existence. If one whose attribute is this strikes, he strikes with a severity unmixed with Mercy.\n\nHe, Glory be to Him, is <<خَيْرُ الرَّاحِمِينَ>> (The Best of the Merciful). It has never been reported that He is the Best of the Takers, nor the Best of the Strikers, nor the Best of the Avengers, nor the Best of the Tormentors, just as it has been reported that He is <<خَيْرُ الْفاصِلِينَ>> (The Best of Deciders), <<خَيْرُ الْغافِرِينَ>> (The Best of Forgivers), <<خَيْرُ الرَّاحِمِينَ>> (The Best of the Merciful), and the Best of the Appreciative, and similar terms—despite the fact that He strikes, takes vengeance, seizes, destroys, and torments, but not by way of preference (الأفضلية). Realize this distinction between His description by taking and vengeance, and His description by Mercy and Forgiveness.\n\n<<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب تین سو بانوے: ان لوگوں کے مقام کی معرفت میں جن پر ہم نے رحم کیا، اور جن پر رحم نہیں کیا ان پر بھی رحم کیا، پھر ان پر غضب کیا اور انہیں بھلا دیا۔\n\nجو ذات حق (الحق) کا ارادہ رکھتا ہے، وہ اسے ملک (دنیاوی وجود) اور ملکوت (غیبی وجود) کی ہستی (الوجود) میں تلاش کرے۔\nذات حق (الحق) کے کلمات اس کے سوا کچھ نہیں جو عالمِ ثبوت سے ظاہر ہوئے۔\nاور جو \"نہیں\" میں ہے، اس کی کان (اصل) اس مقام میں ہے جس کے بارے میں ہم خاموش ہیں۔\nجو کچھ بھی ہم نے کرم سے پایا، وہ رحموت (رحمت کی وسعت) کہلاتا ہے۔\nاور وہ (رحمت) جس کا برہان ظاہر ہوتا ہے، وہ برزخِ جبروت میں قائم ہے۔\nاکوان (کائناتوں) کا ظاہر اور ان کا باطن، رہبوت (خوف) ہے جس کا عین رغبوت (اشتیاق) ہے۔\nپس تمام کائنات کا جھکاؤ عفو اور رحموت (رحمت کی وسعت) کے ٹھکانے کی طرف ہے۔\n\n### رحم، رحمن کی ایک شاخ ہے۔\n\nاللہ تعالیٰ نے اپنے جامع کلام کے آغاز میں فرمایا: بِسْمِ الله الرَّحْمنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ الرَّحْمنِ الرَّحِيمِ (اللہ کے نام سے جو نہایت مہربان، بہت رحم کرنے والا ہے۔ سب تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے، نہایت مہربان، بہت رحم کرنے والا ہے) (سورۃ الفاتحہ ۱:۱-۳)۔ اور اس عالم کی تاکید اس طرح کی کہ اس کی صفت بیان کی کہ وہ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ ولا الضَّالِّينَ (نہ ان کا جن پر غضب کیا گیا اور نہ گمراہوں کا) (سورۃ الفاتحہ ۱:۷)۔ اور نبی صلی اللہ علیہ وسلم نے اس حدیث میں جو آپ سے ثابت ہے، فرمایا: \"رحم (رشتہ داری) رحمن کی ایک شاخ ہے۔ جو اسے جوڑتا ہے، اللہ اسے جوڑتا ہے، اور جو اسے کاٹتا ہے، اللہ اسے کاٹتا ہے۔\"\n\nاور نبی صلی اللہ علیہ وسلم نے فرمایا: \"رحم کرنے والوں پر رحمن رحم کرتا ہے۔ زمین والوں پر رحم کرو، آسمان والا تم پر رحم کرے گا۔\"\n\nاور نبی صلی اللہ علیہ وسلم نے حدیثِ شفاعت میں فرمایا: \"بے شک اللہ فرماتا ہے: فرشتوں نے شفاعت کی، نبیوں نے شفاعت کی، اور مومنوں نے شفاعت کی، اور اب ارحم الراحمین (سب سے زیادہ رحم کرنے والا) باقی ہے۔\"\n\nجان لو کہ جب اللہ نے عالم کی نشوونما کو چار حصوں (التربيع) پر قائم کیا، اور یہاں عالم سے میری مراد انسان اور جن ہیں جو دونوں جہانوں (جنت اور دوزخ) کو آباد کرتے ہیں، تو ام الکتاب (قرآن کی اصل) میں، جو عالم میں موجود ہر چیز پر حکم کرتی ہے، چار رحمتیں رکھیں۔ ہر شخص کے ہر چوتھائی حصے کے لیے ایک رحمت۔ چنانچہ ام الکتاب کی پہلی آیت یعنی بسم اللہ میں دو رحمتیں شامل ہیں، اور وہ اس کا قول ہے: الرَّحْمنِ الرَّحِيمِ (نہایت مہربان، بہت رحم کرنے والا)۔ اور اس کی تیسری آیت میں بھی دو رحمتیں شامل ہیں، اور وہ اس کا قول ہے: الرَّحْمنِ الرَّحِيمِ (نہایت مہربان، بہت رحم کرنے والا)۔ پس وہ رحمن ہے عام رحمتوں کے ساتھ، جو کہ احسان کی رحمت (رحمة الامتنان) ہے، اور وہ رحیم ہے خاص رحمت کے ساتھ، جو کہ واجب ہے، جیسا کہ اس کے قول میں ہے: فَسَأَكْتُبُها لِلَّذِينَ يَتَّقُونَ (تو میں اسے ان لوگوں کے لیے لکھ دوں گا جو پرہیزگاری اختیار کرتے ہیں...) (سورۃ الاعراف ۷:۱۵۶) اور اس کا قول: كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ (تمہارے رب نے اپنے اوپر رحمت کو لازم کر لیا ہے) (سورۃ الانعام ۶:۵۴)۔\n\nاور جہاں تک احسان کی رحمت (رحمة الامتنان) کا تعلق ہے، تو یہ وہ ہے جو بغیر کسی عمل کے استحقاق کے حاصل ہوتی ہے۔ اور اپنی احسان کی رحمت (رحمة الامتنان) کے ذریعے اللہ نے اس شخص پر رحم کیا جسے اس نے نیک عمل کی توفیق دی، جس نے اس کے لیے واجب رحمت (الرحمة الواجبة) کو لازم کر دیا۔ پس اسی (احسان کی رحمت) کے ذریعے گناہ گار اور اہل دوزخ کو ان سے عذاب کا خاتمہ نصیب ہوتا ہے، اگرچہ ان کا ٹھکانہ اور گھر جہنم ہی ہو۔ اور یہ احسان کی رحمت (رحمة الامتنان) ہے، جیسا کہ اللہ کا اپنے نبی صلی اللہ علیہ وسلم سے یہ قول ہے: فَبِما رَحْمَةٍ من الله لِنْتَ لَهُمْ (پس اللہ کی کیسی رحمت ہے کہ آپ ان کے لیے نرم ہو گئے) (سورۃ آل عمران ۳:۱۵۹)۔ اور یہی اس کے قول کا مفہوم ہے: صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ (ان لوگوں کا راستہ جن پر تو نے انعام کیا) (سورۃ الفاتحہ ۱:۷) یعنی وہ راستہ جس کے ذریعے تو نے ان پر انعام کیا، اور وہ رحمت ہے جس نے انہیں دارِ تکلیف میں توفیق اور ہدایت عطا کی، اور یہ عنایت کی رحمت ہے۔ پس اسی وجہ سے وہ نہ مغضوب علیہم (جن پر غضب کیا گیا) ہوئے اور نہ ضالین (گمراہ) ہوئے، کیونکہ اللہ نے انہیں ہدایت عطا کی اور وہ حیران و سرگرداں نہیں ہوئے۔\n\nجس پر اللہ کا غضب ہوا، وہ کہتا ہے: ہم پر اس رحمت کے ذریعے احسان فرما جس کا تو نے ان لوگوں پر ابتداءً احسان کیا، بغیر کسی استحقاق کے، یہاں تک کہ تو نے انہیں غیر مغضوب علیہم (جن پر غضب نہیں کیا گیا) قرار دیا، کیونکہ تو نے انہیں ہدایت دے کر ان سے گمراہی کو، جو کہ حیرانی ہے، دور کر دیا۔ پس اس (رحمت) کے ذریعے احسان فرما جو اس غضب کو دور کر دے جس کے ہم مستحق ہوئے ہیں، تو اللہ ان پر احسان کی رحمت (رحمة الامتنان) کے ذریعے رحم فرماتا ہے، اور یہ وہ رحمت ہے جو تیسری آیت میں اسم الرحمن کے ساتھ ہے۔ پس وہ ان سے عذاب کو دور کرتا ہے اور اسم الرحیم کے ذریعے انہیں اس (جہنم) میں نعمت عطا کرتا ہے جس میں وہ ہیں۔ پس ام الکتاب (سورۃ الفاتحہ) میں غضب کی کوئی آیت نہیں، بلکہ وہ سب رحمت ہے، اور وہ کتاب کی ہر آیت پر حاکم ہے کیونکہ وہ ام (اصل) ہے۔ پس اس کی رحمت اس کے غضب پر سبقت لے گئی۔ اور یہ کیوں نہ ہو، جبکہ عالم اور اللہ کے درمیان نسبت صرف اسم الرحمن سے ہے، پس اس نے رحم (رشتہ داری) کو اس (رحمن) کا ایک ٹکڑا بنا دیا، لہٰذا رحم کی نسبت صرف اسی کی طرف ہے۔ اور عالم میں جو کچھ بھی ہے وہ اس کی طرف سے رحمت ہی ہے، کسی ایسے امر کے ساتھ جو ناگزیر ہے۔\n\nاور یہ ممکن نہیں کہ مخلوق کی رحمت قدیم (اللہ) کی رحمت کے عموم کو پہنچ سکے، کیونکہ ذات حق (الحق) کا علم ہر معلوم کو محیط ہے، اور ذات حق (الحق) کے علم کا کوئی احاطہ نہیں کر سکتا مگر جتنا وہ چاہے۔ پس وہ مخلوق پر ان کے علم کے مطابق رحم کرتا ہے، جیسا کہ اللہ نے اپنے علم کے مطابق رحم کیا۔ پس عالم میں سے جو بھی غضب کرتا ہے اور انتقام لیتا ہے، تو اس نے اس انتقام کے ذریعے اپنی ذات پر رحم کیا، کیونکہ یہ اس کے لیے اس تکلیف سے شفا ہے جو وہ غضب کی وجہ سے محسوس کرتا ہے۔ اور انسان کا اپنی ذات پر صدقہ کرنا بہترین صدقات میں سے ہے۔ پس جب وہ اپنی ذات پر رحم کرتا ہے اور غضب زائل ہو جاتا ہے، تو اس کے بعد رحمت آتی ہے، اور وہ ندامت ہے جو انسان کو کسی کو سزا دینے کے بعد محسوس ہوتی ہے، اور وہ کہتا ہے: اگر اللہ چاہتا تو اسے معاف کر دینا بہتر ہوتا۔ اسے یہ بات ضرور کہنی پڑتی ہے، خواہ دنیا میں یا آخرت میں، اپنے نفس کے لیے انتقام لینے کے معاملے میں۔\n\nتاکہ یہ گمان نہ کیا جائے کہ حدود کا قائم کرنا اسی قبیل سے ہے، کیونکہ حدود کا قائم کرنا اللہ کی طرف سے ایک شریعت ہے، جس میں انسان کا کوئی عمل دخل نہیں۔ پس انسان نے اس فعل کے ذریعے اپنے رحم (رشتہ داری) کو جوڑا ہے، اور رحمت کا وصول اسی کی طرف ہے۔ لہٰذا تمام مخلوقات کو اللہ کی رحمت ضرور پہنچے گی، ان میں سے کچھ کو جلد اور کچھ کو دیر سے، کیونکہ وہاں صرف وہی ہے جس نے اپنے رحم کو جوڑا تو اللہ نے اسے اس پہلو سے جوڑا، اور جس نے اپنے رحم کو کاٹا، یعنی اپنے رحم کے بعض حصے کو کاٹا، کیونکہ قطع (کاٹنا) مکمل طور پر محیط نہیں ہو سکتا۔ اس لیے کہ کسی خاص رحم کو کاٹنے کا عین عمل اس کے لیے کسی دوسرے رحم کو جوڑنا ہے۔ پس اس کے کاٹنے میں جوڑنا ہے، اور اس کے جوڑنے میں کاٹنا نہیں ہے۔ پس جو رحم جوڑا گیا ہے وہ شفاعت کرے گا، اور شفاعت مقبول ہو گی، اور وہ (اللہ) کاٹے ہوئے رحم پر تعریف کے ذریعے وزن قائم کرے گا، کیونکہ یہ ناگزیر ہے کہ وہ کاٹا ہوا رحم بھی کسی دوسرے رحم کو کاٹ چکا ہو گا۔ پس جب اس شخص سے مطالبہ کیا جائے گا جس نے رحم کا تعلق کاٹا تھا، تو ذات حق (الحق) اس سے کہے گا: جس طرح میں تمہارے لیے بدلہ لے رہا ہوں، اسی طرح تم سے بھی بدلہ لوں گا۔ اور اسے بتائے گا کہ اس نے بھی اپنے کسی رحم کو کاٹا ہے۔ پس وہ اللہ سے عفو اور درگزر کا سوال کرے گا۔ تو اللہ اس سے کہے گا: تم اپنے رحم کے کاٹنے والے کو معاف کر دو تاکہ میں تمہیں معاف کر دوں۔ پس وہ مجبوری کے عالم میں کہے گا: میں نے معاف کر دیا، کیونکہ وہ مقام خوف زدہ شخص سے عفو کا مطالبہ کرتا ہے، تو وہ معاف کر دیتا ہے، اور اللہ اسے معاف کر دیتا ہے۔ پس اس (معاف کرنے والے) کے عفو کے ذریعے اللہ کی رحمت اسے حاصل ہوتی ہے، اور وہ اس کے کسی دوسرے رحم کو جوڑتا ہے اور اس کے حق میں شفاعت کرتا ہے۔\n\nاور یہی اللہ عزوجل کے اس قول کا مفہوم ہے جو قیامت کے دن ہو گا: \"فرشتوں نے شفاعت کی، نبیوں نے شفاعت کی، اور مومنوں نے شفاعت کی، اور اب ارحم الراحمین (سب سے زیادہ رحم کرنے والا) باقی ہے۔\"\n\nپس اس کی طرف سے اپنے بندوں کے ساتھ وہی معاملہ ہو گا جو ہم نے ذکر کیا، اور اس کی مثالیں، ہر وہ چیز جو رحمت کا تقاضا کرتی ہے۔ کیونکہ اللہ کی رحمت اس کے غضب پر سبقت لے گئی ہے، پس وہ غضب کی امام ہے۔ لہٰذا اللہ کا غضب بندوں سے انتقام لینے کے لیے اپنے راستے پر چلتا رہے گا یہاں تک کہ اپنی آخری حد کو پہنچ جائے، تو وہ دیکھے گا کہ رحمت اس سے پہلے پہنچ چکی ہے، اور وہ مغضوب علیہم (جن پر غضب کیا گیا) بندوں کو اپنی لپیٹ میں لے لے گی، اور ان پر پھیل جائے گی، اور ان میں حکم رحمت کا ہو جائے گا۔\n\nاور وہ حد جو غضب کو دی گئی ہے، وہ بسم اللہ میں موجود الرَّحْمنِ الرَّحِيمِ (نہایت مہربان، بہت رحم کرنے والا) اور الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (سب تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے) کے بعد موجود الرَّحْمنِ الرَّحِيمِ (نہایت مہربان، بہت رحم کرنے والا) کے درمیان ہے۔ پس الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (سب تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے) ہی وہ حد (المدى) ہے۔ اس کی ابتدا الرَّحْمنِ الرَّحِيمِ ہے اور اس کا اختتام الرَّحْمنِ الرَّحِيمِ ہے۔ اور الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (سب تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے) عین حد (المدى) اس لیے ہے کہ اس حد میں خوشحالی (السراء) اور بدحالی (الضراء) ظاہر ہوتی ہے، اور اسی لیے اس میں حمد (تعریف) ہے، جو کہ ثناء ہے۔ اور اس حد میں اسے بدحالی یا خوشحالی کے ساتھ مقید نہیں کیا گیا، کیونکہ یہ خوشحالی اور بدحالی دونوں کو شامل ہے۔\n\nپس رسول اللہ صلی اللہ علیہ وسلم خوشحالی میں فرماتے تھے: \"الحمد لله المنعم المفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام کرنے والا، فضل کرنے والا ہے) اور بدحالی میں فرماتے تھے: \"الحمد لله على كل حال\" (ہر حال میں تمام تعریفیں اللہ کے لیے ہیں)۔\n\nپس اللہ کی حمد خوشحالی اور بدحالی دونوں میں آئی ہے، اسی لیے یہ عین حد (المدى) ہے۔ اور آخرت میں کوئی ایسا نہیں ہو گا جو اللہ کی حمد نہ کرے، اور اس کی رحمت کی امید نہ رکھے، اور اس کے عذاب کے جاری رہنے سے خوف زدہ نہ ہو۔ پس اللہ نے اپنے قول الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (سب تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے) کے فوراً بعد اپنا قول الرَّحْمنِ الرَّحِيمِ (نہایت مہربان، بہت رحم کرنے والا) رکھا۔ پس عالم اس رحمت اور بسم اللہ کی رحمت کے درمیان ہے، اپنی تمام قابل تعریف اور قابل مذمت حالتوں کے ساتھ۔ اور یہ اس سے مشابہت رکھتا ہے جو سورۃ ألم نشرح میں آیا ہے، اللہ تعالیٰ کا قول: فَإِنَّ مَعَ الْعُسْرِ يُسْراً (پس بے شک مشکل کے ساتھ آسانی ہے) (سورۃ الشرح ۹۴:۵) پھر إِنَّ مَعَ الْعُسْرِ يُسْراً (بے شک مشکل کے ساتھ آسانی ہے) (سورۃ الشرح ۹۴:۶)۔ اور کسی نے اس بارے میں یہ شعر کہا ہے:\n\n> جب معاملہ تم پر تنگ ہو جائے، تو \"ألم نشرح\" (سورۃ الشرح) میں غور کرو۔\n> پس ایک مشکل دو آسانیوں کے درمیان ہے، جب تم اسے یاد کرو تو خوش ہو جاؤ۔\n\nکیونکہ اس (اللہ) نے یسر (آسانی) کو نکرہ (غیر معین) لایا، اور عسر (مشکل) پر الف لام داخل کیا جو عہد اور تعریف کے لیے ہیں، یعنی یہ دوسری مشکل عین پہلی مشکل ہی ہے، جبکہ یسر (آسانی) کا معاملہ ایسا نہیں ہے۔ اور یہ اللہ کی طرف سے اپنے بندوں کے لیے ایک عجیب تنبیہ ہے تاکہ ان کے دلوں میں اللہ کی رحمت کی امید اور لالچ مضبوط ہو، کیونکہ وہ ارحم الراحمین (سب سے زیادہ رحم کرنے والا) ہے۔ اگر وہ اپنے بندوں پر ایسے حکم کے ذریعے رحمت میں اضافہ نہ کرے جو ان کے لیے نہیں ہے، تو وہ ارحم الراحمین کیسے ہو گا؟ اور وہ بلاشبہ ارحم الراحمین ہے۔ پس اللہ کی قسم! وہ شخص کبھی ناکام نہیں ہوا جسے اللہ کی رحمت نے ہر طرف سے گھیر لیا ہو۔ پس یہ جان لو۔ اور جب حقائق درست ہو جائیں تو احمق جو چاہے کہتا پھرے۔ بے شک ایک گروہ نے اس معاملے میں ہم سے جھگڑا کیا، اور اگر اللہ کی رحمت اس قدر شمولیت والی نہ ہوتی تو ایسے کہنے والوں کو کبھی اللہ کی رحمت نصیب نہ ہوتی۔ میں اللہ سے سوال کرتا ہوں کہ وہ ہمیں جاہلوں میں شامل نہ کرے۔ کیونکہ جہالت سے زیادہ کوئی قبیح صفت یا عیب نہیں، کیونکہ جہالت ہر شر کی کنجی ہے۔ اور اسی لیے اس نے محمد صلی اللہ علیہ وسلم سے فرمایا: فَلا تَكُونَنَّ من الْجاهِلِينَ (پس تم ہرگز جاہلوں میں سے نہ ہونا) (سورۃ الانعام ۶:۳۵)۔ اس نے آپ کو اس طرح مخاطب کیا کیونکہ آپ کی عمر کم تھی اور جوانی کی قوت تھی۔\n\nپس اس نے اس کا مقابلہ ایک قوی خطاب سے کیا جس میں اس سے منع کیا گیا۔ اور اللہ تعالیٰ نے نوح علیہ السلام سے فرمایا، جب ان میں جوانی کی قوت نہیں تھی اور وہ بوڑھے ہو چکے تھے اور اس عمر کو پہنچ چکے تھے جس میں عرف و عادت کے مطابق ہمیشہ احترام اور نرمی برتی جاتی ہے: إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ (میں تمہیں نصیحت کرتا ہوں کہ تم جاہلوں میں سے نہ ہو جاؤ) (سورۃ ہود ۱۱:۴۶)۔ پس جب اس نے انہیں نصیحت کی تو خطاب میں نرمی برتی۔ کیونکہ جوانوں کے خطاب اور بوڑھوں کے خطاب میں فرق کرنا ضروری ہے، جیسا کہ ہم احوال کے مطابق اللہ کی ثناء میں فرق کرتے ہیں۔ پس ہم خوشحالی کے خطاب میں کہتے ہیں: \"الحمد لله المنعم المفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام کرنے والا، فضل کرنے والا ہے) اور بدحالی میں کہتے ہیں: \"الحمد لله على كل حال\" (ہر حال میں تمام تعریفیں اللہ کے لیے ہیں)، کیونکہ حمد کے محرک میں اختلاف ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے اپنے فعل سے ہمیں یہ سکھایا۔\n\nلیکن اللہ کے بندوں میں سے وہ رحم کرنے والے جو اللہ کے بندوں پر بلکہ اللہ کی مخلوق پر مطلقاً رحم کرتے ہیں، تو جب وہ مخلوق پر رحم کرتے ہیں تو اللہ ان سے ملاقات کے وقت ان کی طرف رحمت کے ساتھ تیزی سے بڑھتا ہے، اس رحمت کی وجہ سے جو ان کے نفوس میں اللہ کی مخلوق پر شفقت کی صورت میں قائم ہوتی ہے۔ پس اللہ ان پر رحم کرتا ہے۔\n\nکیونکہ ان کے اعمال ان کی طرف لوٹائے جاتے ہیں، جیسا کہ خبر میں آیا ہے۔\n\nپس ان کی رحمت کے سبب اللہ سبحانہ و تعالیٰ نے ان پر رحم کیا۔\n\n> پس نہ تو حلیف بنو اور نہ ہی مخالفت کرو، اور سچے رہو اور جدا نہ ہو۔\n\nپس جس نے اللہ کی مخلوق پر رحم کیا، اس نے درحقیقت اپنی ذات پر رحم کیا۔ پھر اللہ کی طرف سے ان کے لیے ایک اور رحمت ہے جو اس رحمت سے زیادہ ہے جس کے ذریعے اس نے ان پر رحم کیا، اور یہ ان کے اللہ کی مخلوق پر رحم کرنے کی وجہ سے ہے جو ان کے اعمال میں سے ہے۔ اور اس کی صورت یہ ہے کہ ہم میں سے جب کوئی رحم کرنے والا اللہ کی کسی مخلوق پر رحم کرتا ہے، تو یہ رحمت یا تو صرف اس مرحموم مخلوق کی تکلیف کو دور کرنے کے لیے ہوتی ہے، یا اس کے ساتھ ساتھ اس میں احسان کا اضافہ بھی ہوتا ہے، جیسے کوئی شخص کسی کو جیل سے نکالے جو عذاب کا مستحق تھا، اور اپنی شفاعت کے ذریعے اس کے اور عذاب کے نزول کے درمیان حائل ہو جائے، یا وہ خود اسے پکڑنے والا ہو، پھر اس امان کے بعد اسے کسی عہدے، مال، خلعت یا قربت کے ذریعے احسان سے نوازے، تو یہ ایک اور معاملہ ہے۔ پس جب اللہ کسی بندے پر اس کے اس عمل کے بدلے رحم کرتا ہے جس کے ذریعے بندے نے اپنے جیسے کسی حیوان پر رحم کیا، خواہ عذاب کو دور کر کے یا اس کے ساتھ احسان کا اضافہ کر کے، تو جب اللہ اس کے عمل کے بدلے میں اس کی رحمت پوری کر دیتا ہے، تو جو ہونا تھا وہ ہو چکا، پھر اللہ اس پر مزید اضافہ کرتا ہے، جیسا کہ اس بندے نے جو ہم نے ذکر کیا اس پر اضافہ کیا، یا وہ اپنی طرف سے ابتداءً احسان (منة) کے طور پر اضافہ کرتا ہے۔\n\nاس نے فرمایا: \"الراحمون يرحمهم الرحمن\" (رحم کرنے والوں پر رحمن رحم کرتا ہے)۔\n\nاور یہ نہیں فرمایا: \"ان پر رحیم رحم کرتا ہے\"، کیونکہ وہ دنیا اور آخرت کا رحمن ہے، جبکہ رحیم (الرحيم) رحمت کو آخرت کے ساتھ خاص کرتا ہے۔\n\nاور جہاں تک اس کے قول کا تعلق ہے: \"ارحموا من في الأرض يرحمكم من في السماء\" (زمین والوں پر رحم کرو، آسمان والا تم پر رحم کرے گا)۔\n\nیہ اس لیے ہے کہ تم مصیبت زدہ اور گوشہ نشین لوگوں کو دیکھتے ہو اور ان سے درگزر کرتے ہو، پس تم ان پر اللہ کے حکم سے اس رحمت کے ذریعے رحم کرتے ہو جس کا ان کے حالات تقاضا کرتے ہیں، ہر ایک اپنی حالت کے مطابق رحم کرتا ہے۔ اور آسمان میں فرشتوں کے سوا کوئی نہیں، پس وہ ہمارے لیے استغفار کے ذریعے رحم کرتے ہیں، اور یہی اللہ تعالیٰ کا قول ہے: ويَسْتَغْفِرُونَ لِمَنْ في الْأَرْضِ (اور وہ زمین والوں کے لیے مغفرت طلب کرتے ہیں) (سورۃ الشوریٰ ۴۲:۵) پھر فرمایا: أَلا إِنَّ الله هُوَ الْغَفُورُ الرَّحِيمُ (خبردار! بے شک اللہ ہی بخشنے والا، نہایت رحم کرنے والا ہے) (سورۃ الشوریٰ ۴۲:۵)۔\n\nاور جہاں تک اس باب میں اس کے قول \"ونسیناہ\" (اور ہم نے انہیں بھلا دیا) کا تعلق ہے، تو یہ اس انسان کے اللہ کو چیزوں میں بھول جانے کی حد ہے۔ پس اس پر صرف اس کا بھولنا ہی لوٹا۔ اور ذات حق (الحق) نے اسے اپنی طرف منسوب کیا اور فرمایا: نَسُوا الله فَنَسِيَهُمْ (انہوں نے اللہ کو بھلا دیا تو اللہ نے انہیں بھلا دیا) (سورۃ التوبہ ۹:۶۷) یعنی انہوں نے اللہ کا حق چھوڑ دیا تو اللہ نے وہ حق چھوڑ دیا جس کے وہ اپنے جرائم کی وجہ سے مستحق تھے، پس اس نے انہیں مؤاخذہ نہیں کیا اور نہ ہی انہیں ہمیشہ کے لیے پکڑا، بلکہ انہیں بخش دیا اور ان پر رحم کیا۔ اور یہ اس مفہوم سے مختلف ہے جو علماءِ رسوم (ظاہری علم والے) نے سمجھا ہے، کیونکہ یہ اشارے (الإشارة) کے باب سے ہے نہ کہ تفسیر کے باب سے۔ کیونکہ یہاں بھولنے والا جب صرف اللہ کے اس حق کو نہیں منسوب کرتا جس کے لانے کا اللہ نے شرعاً حکم دیا ہے، تو اس نے اللہ کو بھلا دیا، کیونکہ یہ (حق) اس کے لیے اللہ کے سوا کسی نے مشروع نہیں کیا۔ پس اس نے اللہ کا حق چھوڑ دیا۔ تو اللہ نے اس میں اپنا کرم ظاہر کیا اور اپنا حق چھوڑ دیا، اور ایسے شخص کا حق اس کے سوا کچھ نہیں تھا جس کا وہ مستحق تھا، یعنی سزا۔ پس اللہ نے اسے معاف کر دیا، یہ چھوڑنا بدلے میں چھوڑنا ہے جسے نسیان (بھولنا) کے لفظ سے تعبیر کیا گیا۔\n\nاور جہاں تک اللہ تعالیٰ کا ہمیں اس سے منع کرنا ہے کہ ہم ان لوگوں کی طرح ہو جائیں جنہوں نے نَسُوا الله فَنَسِيَهُمْ (اللہ کو بھلا دیا تو اللہ نے انہیں بھلا دیا)، تو یہ درست ہے، کیونکہ یہ ایک الٰہی وصیت ہے جس میں ہمیں منع کیا گیا ہے کہ ہم اللہ کو اس طرح بھولیں جس طرح ان لوگوں نے بھلایا، تاکہ ہم اللہ کا حق ادا کریں اور چیزوں میں اللہ کا حق نیک نیت اور اللہ کے ساتھ حضوری کے ساتھ قائم کریں۔ تاکہ اللہ ہمیں اس استحقاق کا بدلہ دے جو ہم نے اپنے اعمال کے ذریعے حاصل کیا جن کی توفیق اللہ نے ہمیں دی۔ اور جن لوگوں نے اللہ کو بھلا دیا، اللہ نے ان کے لیے صرف وہ سزا چھوڑ دی جس کے وہ مستحق تھے، جیسا کہ انہوں نے اللہ کا حق چھوڑ دیا، بس۔ پھر اگر اس نے ان پر مزید فضل کیا تو یہ اس کی طرف سے ابتداءً احسان (منة) ہے۔ اور اللہ کا ان لوگوں پر فضل کرنا جو اللہ کے حقوق ادا کرتے ہیں، وہ احسان (منة) نہیں ہے۔ پس جب وہ ان کے عمل کے تقاضے سے زیادہ دیتا ہے تو وہ احسان (الامتنان) ہے، جیسا کہ انہوں نے اس ثواب کو منة (احسان) کے ذریعے حاصل کیا جس کے وہ مستحق ہوئے تھے۔ پس یہ جان لو۔ کیا تم نہیں دیکھتے کہ اللہ اس آیت کے اختتام پر جب اس نے کہا: ولا تكونوا كالذين نَسُوا الله فَنَسِيَهُمْ (اور ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے اللہ کو بھلا دیا تو اللہ نے انہیں بھلا دیا)، تو یہ نہیں کہا کہ وہ فاسق ہیں، بلکہ کہا: إِنَّ الْمُنافِقِينَ هُمُ الْفاسِقُونَ (بے شک منافق ہی فاسق ہیں) (سورۃ التوبہ ۹:۶۷)۔ پس اس نے ایک نیا کلام شروع کیا جس میں ان مذکورہ لوگوں کی طرف کوئی ضمیر نہیں لوٹتا۔ اور ہر منافق فاسق ہے، کیونکہ وہ ہر دروازے سے باہر نکلنے والا ہے۔ پس وہ مومنوں کے سامنے ان کی صورت میں ظاہر ہوتا ہے اور کافروں کے سامنے ان کی صورت میں ظاہر ہوتا ہے۔ اور اس کتاب میں منافقین کا مرتبہ منازل میں پہلے گزر چکا ہے۔ پس جس چیز کی طرف میں نے تمہیں متنبہ کیا ہے اس پر غور کرو، اور ان عالموں میں سے ہو جاؤ جو يُوفُونَ بِعَهْدِ الله (اللہ کے عہد کو پورا کرتے ہیں)... فَنِعْمَ أَجْرُ الْعامِلِينَ (پس عمل کرنے والوں کا کیا ہی اچھا اجر ہے) (سورۃ آل عمران ۳:۷۷، ۱۳۶)۔ اور اللہ کے عفو پر قناعت نہ کرو کہ تم ان لوگوں میں سے ہو جاؤ جنہوں نے اللہ کو بھلا دیا، بلکہ اس کے احسان میں رغبت رکھو کہ وہ تمہیں یہاں مزید عمل اور مراقبہ (مراقبة) عطا کرے، تاکہ وہ تمہیں اپنے ہاں مزید جاہ و حرمت عطا کرے۔\n\nاور جہاں تک اللہ تعالیٰ کا ہمیں اپنے اس قول سے منع کرنا ہے: ولا تَكُونُوا كَالَّذِينَ نَسُوا الله فَأَنْساهُمْ أَنْفُسَهُمْ أُولئِكَ هُمُ الْفاسِقُونَ (اور ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے اللہ کو بھلا دیا تو اللہ نے انہیں ان کی جانیں بھلا دیں، وہی لوگ فاسق ہیں) (سورۃ الحشر ۵۹:۱۹)، تو اس نے ضمیر کو ان کی طرف لوٹایا ہے۔ پس یہ ایک اور نمط ہے جس کی حقیقت ہم نے نفاقِ محمود (قابل تعریف نفاق) کے مسئلے میں، جو اس کتاب میں منازل کے ضمن میں گزر چکا ہے، بیان کی ہے۔ پس ہم یہاں اس میں سے وہ ذکر کرتے ہیں جو نسیان (بھولنے) کی وجہ سے اس مقام کے لائق ہے۔\n\nاور وہ یہ ہے کہ اللہ نے رسول اللہ صلی اللہ علیہ وسلم کی زبان سے فرمایا: \"من عرف نفسه عرف ربه\" (جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا)۔\n\nجب اس نے ہمیں اپنے اوپر دلیل بنایا، تو ہمیں اپنے نفوس کی معرفت میں غور نہیں کرنا چاہیے مگر اس لیے کہ ہم اپنے رب کو پہچاننا چاہیں۔ پس جب ہم اس معرفت کو بھول گئے تو ہم نے اپنے نفوس کی معرفت کو بھلا دیا، اور یہی وہ واحد دروازہ تھا جس سے ہمیں اس معرفت کی طرف نکلنا چاہیے تھا، تو ہم دوسرے دروازے سے نکلے، اور وہ وہ دروازہ ہے جس سے ہم اپنے نفوس کی جہالت کی طرف نکلتے ہیں۔ اور جب اللہ نے ہمیں صورتِ الٰہیہ (الصورة الإلهية) پر پیدا کیا، تو ہمارے اللہ کو بھولنے میں یہ شامل تھا کہ اللہ نے ہمیں ہماری جانیں بھلا دیں۔ پس ہمیں اس سے منع کیا گیا، کیونکہ جو شخص اپنے نفس کو بھول جاتا ہے، وہ لازمی طور پر ان حقوق کو بھول جاتا ہے جو اللہ کے اس پر ہیں اور جو حقوق اس کے اپنے ہیں۔ پس انہوں نے اللہ کو چھوڑ دیا جب انہیں معلوم ہوا کہ وہ اللہ کی طرف سے وہ نہیں دیکھتے جو اللہ ہے، بلکہ وہ اللہ کی طرف سے صرف اپنی ذاتوں اور اپنے احوال کو دیکھتے ہیں، بس۔ پس جب اللہ نے اپنے بعض بندوں سے یہ جان لیا جن میں یہ صفت تھی، تو اس نے انہیں ان کی جانیں بھلا دیں، پس وہ اپنے شہود (شہود) کے وقت یہ نہیں دیکھتے کہ ان کے احوال عین وہی ہیں جو انہوں نے دیکھے، تو وہ اس شہود (شہود) میں کہتے ہیں: اللہ نے مجھ سے کہا اور میں نے اس سے کہا۔ اور یہ ان کے اس مقام سے کتنا دور ہے جہاں وہ کہتے ہیں: ہم ذات حق (الحق) کی طرف سے صرف وہی دیکھتے ہیں جو ہم خود ہیں۔ پس انہیں یہ (شہود) صرف اس وجہ سے حاصل ہوا کہ اللہ تعالیٰ نے انہیں ان کی جانیں بھلا دیں۔ پس أُولئِكَ هُمُ الْفاسِقُونَ (وہی لوگ فاسق ہیں) جو اس راستے سے باہر نکلنے والے ہیں جس کی حقیقت انہوں نے پائی تھی کہ اللہ کا کوئی بھی شہود (شہود) نہیں کر سکتا، نہ اپنی حالت کے اعتبار سے اور نہ اس کے اعتبار سے جو وہ ہے۔\n\nاور جب اس (اللہ) نے اپنے آپ کو خَيْرُ الرَّاحِمِينَ (سب سے بہتر رحم کرنے والا) کے طور پر بیان کیا، تفضیل (مفاضلة) کے باب سے، تو یہ معلوم ہے کہ مخلوق میں سے کوئی بھی کسی پر رحم نہیں کرتا مگر اس رحمت کے ذریعے جو رحمن نے اس میں پیدا کی ہے۔ پس وہ درحقیقت اسی (اللہ) کی رحمت ہے نہ کہ ان کی رحمت، جو مخلوق کی صورت میں ظاہر ہوئی۔ جیسا کہ اس نے \"سمع الله لمن حمده\" (اللہ نے سن لیا جس نے اس کی حمد کی) کے بارے میں فرمایا کہ یہ قول اللہ کا قول ہے جو اس کے بندے کی زبان پر ہے۔ پس اللہ تعالیٰ کا وہ قول جو موسیٰ علیہ السلام نے سنا، اس قول سے شرف میں زیادہ کامل ہے جو اللہ تعالیٰ نے کسی کہنے والے کی زبان پر فرمایا۔ پس تفضیل (افضلیت) اس محل کی وجہ سے واقع ہوئی جہاں سے قول سنا گیا، حالانکہ معلوم ہے کہ وہ اللہ کا قول ہے۔ اور اسی طرح مخلوق سے ظاہر ہونے کے لحاظ سے اس کی رحمت، اس کی اس رحمت سے کم تر ہے جو اس نے مخلوق کی صورت کے بغیر اپنے بندے پر کی۔ پس محلات کی وجہ سے تفضیل اور افضلیت متعین ہو گئی۔ مگر یہ کہ مخلوق کی صورت میں اللہ کی رحمت اپنے بندے پر عظیم ہوتی ہے، کیونکہ وہ ذوق (ذوق) کے ساتھ رحم کرتا ہے، پس وہ اپنی رحمت کے ذریعے اس تکلیف کو دور کرتا ہے جو رحم کرنے والا اپنے نفس میں اس مرحموم (جس پر رحم کیا گیا) کی وجہ سے محسوس کرتا ہے۔ اور ذات حق (الحق) کا معاملہ ایسا نہیں ہے، پس اس کی رحمت خالص ہے، اس پر اس سے کوئی تکلیف دور نہیں ہوتی۔ پس وہ خَيْرُ الرَّاحِمِينَ (سب سے بہتر رحم کرنے والا) ہے۔ پس مخلوق کی رحمت شفقت کی وجہ سے ہوتی ہے، اور اللہ کی رحمت مطلق ہے، اس کے برعکس اس کی گرفت اور انتقام کے، جو شدت کے ساتھ ہوتے ہیں۔ لیکن وہ ایسی گرفت نہیں کرتا جس میں رحمت نہ ہو، کیونکہ اس میں رحمت کی انتہا یہ ہے کہ وہ اپنے بندے پر گرفت کو وجود بخشتا ہے۔ پس گرفت کا وجود ایک رحمت ہے جس کے ذریعے اللہ نے اس پکڑے گئے شخص پر رحم کیا، کیونکہ اس نے اسے عدم سے وجود کی طرف نکالا۔ اور جو شخص صفتِ رحمت سے پیدا کیا گیا ہو، اس کی گرفت میں رحمت کا ہونا ضروری ہے۔\n\nپس ابو یزید (بسطامی) اس مقام پر آئے جب انہوں نے قاری کو یہ پڑھتے ہوئے سنا: إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ (بے شک تمہارے رب کی پکڑ بہت سخت ہے) (سورۃ البروج ۸۵:۱۲)۔ ابو یزید نے کہا: میری پکڑ زیادہ سخت ہے، کیونکہ جب انسان پکڑتا ہے تو اس کی پکڑ میں رحمت کا کوئی حصہ نہیں ہوتا، کیونکہ اس کے لیے ممکن نہیں کہ وہ کسی کو پکڑے اور اس کے دل میں اس کے لیے مکمل رحمت بھی ہو۔ پس وہ پکڑ صرف اس پکڑنے والے کے محل کے مطابق ہوتی ہے، اگرچہ وہ پکڑ اللہ کی مخلوق ہے، لیکن اس نے اسے صرف اسی محل میں پیدا کیا، پس وہ محل کی صورت میں ظاہر ہوئی، اور محل کسی سے انتقام کا طالب نہیں ہوتا جبکہ اس کے دل میں رحمت ہو۔ پھر جب اللہ اپنے بندے کو پکڑتا ہے تو اس کی پکڑ میں ایک قسم کی رحمت ہوتی ہے، کیونکہ وہ بلاشبہ اس کا بندہ ہے۔ جیسا کہ مخلوق جب اپنے بندے کو پکڑنا چاہتی ہے تو اس کی پکڑ میں ایک قسم کی رحمت کا شائبہ ضرور ہوتا ہے، اس مناسبت کی وجہ سے جو اس کے اور اس کے بندے اور مملوک کے درمیان ہے، کیونکہ وہ اس پر مالک اور سیادت کا نام باقی رکھتا ہے۔ پس وہ اپنی پکڑ میں اس حد تک نہیں جا سکتا جو اس کی ذات کو ختم کر دے، ورنہ وہ اس وقت اپنی ذات کو پکڑنے والا ہو گا۔ اور مخلوق اجنبی کے معاملے میں ایسا نہیں ہے جس کے اور پکڑنے والے کے درمیان بندگی کی کوئی نسبت نہ ہو اور نہ ہی اس کے وجود سے سیادت کی صفت حاصل ہوئی ہو۔ پس جب اس صفت کا حامل شخص پکڑتا ہے تو وہ ایسی پکڑ سے پکڑتا ہے جس میں رحمت کا شائبہ نہیں ہوتا۔ پس وہ سبحانہ و تعالیٰ خَيْرُ الرَّاحِمِينَ (سب سے بہتر رحم کرنے والا) ہے۔ اور اس کی طرف سے کبھی یہ نہیں آیا کہ وہ خَيْرُ الْآخِذِينَ (سب سے بہتر پکڑنے والا) ہے، نہ الْبَاطِشِينَ (سب سے بہتر گرفت کرنے والا)، نہ الْمُنْتَقِمِينَ (سب سے بہتر انتقام لینے والا)، اور نہ الْمُعَذِّبِينَ (سب سے بہتر عذاب دینے والا)، جیسا کہ خَيْرُ الْفاصِلِينَ (سب سے بہتر فیصلہ کرنے والا)، خَيْرُ الْغافِرِينَ (سب سے بہتر بخشنے والا)، خَيْرُ الرَّاحِمِينَ (سب سے بہتر رحم کرنے والا) اور خَيْرُ الشَّاكِرِينَ (سب سے بہتر قدردان) اور اس جیسی مثالیں آئی ہیں، باوجود اس کے کہ وہ گرفت کرتا ہے، انتقام لیتا ہے، پکڑتا ہے، ہلاک کرتا ہے اور عذاب دیتا ہے۔ یہ افضلیت (الأفضلية) کے طریقے پر نہیں ہے۔ پس اس فاصل کو سمجھو جو اس کے پکڑنے اور انتقام لینے کی صفت اور اس کی رحمت اور مغفرت کی صفت کے درمیان ہے۔ اور اللہ یَقُولُ الْحَقَّ وهُوَ یَهْدِی السَّبِیلَ (حق کہتا ہے اور وہی راستہ دکھاتا ہے) (سورۃ الاحزاب ۳۳:۴)۔",
    "fa": "باب سیصد و نود و دوم در معرفت منزلتی که به آن کسی را که رحم کرد، رحم نمودیم؛ و کسی را که رحم نکرد، رحم نمودیم؛ سپس بر او خشم گرفتیم و او را فراموش کردیم.\n\nآن کس که حق (الحق) را می‌خواهد، آن را می‌جوید\nدر هستی (الوجود) مُلک و ملکوت.\n\nکلمات حق (الحق) چیزی نیستند جز\nآنچه از عالمی بر اساس ثبوت (پایداری) آشکار شده است.\n\nو آنچه در «نیست» معدن آن است\nدر مقامی است که ما از آن خاموشیم.\n\nهر آنچه از کرم به دست آوریم\nهمان است که «رحموت» (الرحموت) نامیده می‌شود.\n\nو آنچه برهان آشکار می‌سازد\nدر برزخ (البرزخ) جبروت (الجبروت) برپاست.\n\nظاهر کائنات و باطن آن‌ها\nرهبوت (بیم) است که عین آن رغبت (میل) است.\n\nپس تمام هستی (الکون) متمایل است\nبه جایگاه عفو و رحموت (الرحموت).\n\n### [رحم شاخه‌ای از رحمان است]\n\nخداوند متعال در آغاز کلام جامع خود فرمود: «بِسْمِ الله الرَّحْمنِ الرَّحِيمِ» (به نام خداوند بخشنده مهربان)، «الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (ستایش از آنِ خداوندی است که پروردگار جهانیان است)، «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان). و این عالم را با توصیف آن تأکید کرد که «غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلا الضَّالِّينَ» (نه راه مغضوبان و نه راه گمراهان). و پیامبر (صلی الله علیه و سلم) در آنچه از ایشان ثابت شده فرمودند: «الرحم شجنة من الرحمن من وصلها وصله الله ومن قطعها قطعه الله» (رحم شاخه‌ای از رحمان است؛ هر کس آن را وصل کند، خداوند او را وصل می‌کند و هر کس آن را قطع کند، خداوند او را قطع می‌کند).\n\nو پیامبر (صلی الله علیه و سلم) فرمودند: «الراحمون يرحمهم الرحمن ارحموا من في الأرض يرحمكم من في السماء» (رحم‌کنندگان را رحمان رحم می‌کند؛ به کسانی که در زمین هستند رحم کنید تا آن کس که در آسمان است به شما رحم کند).\n\nو پیامبر (صلی الله علیه و سلم) در حدیث شفاعت فرمودند: خداوند می‌فرماید: «شفعت الملائكة وشفع النبيون والمؤمنون وبقي أرحم الراحمين» (فرشتگان شفاعت کردند، پیامبران و مؤمنان شفاعت کردند، و ارحم الراحمین باقی ماند).\n\nبدان که چون خداوند نشأت عالم را بر اساس چهارگانه (تربیع) بنا نهاد – و منظورم از عالم در اینجا انس و جن است که دو سرا (بهشت و دوزخ) را آباد می‌کنند – در ام‌الکتاب (مادر کتاب) که بر تمام آنچه عالم در بر دارد حکم می‌راند، چهار رحمت قرار داد؛ برای هر ربع از هر شخص، یک رحمت. پس در آیه اول ام‌الکتاب که بسمله است، دو رحمت را گنجاند و آن دو، قول اوست: «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان). و در آیه سوم آن نیز دو رحمت را گنجاند و آن دو، قول اوست: «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان). پس او رحمان است به دو رحمت عامه که همان رحمت امتنان (رحمت از روی فضل و بخشش) است، و رحیم است به رحمت خاصه که همان رحمت واجبه است، در قول او: «فَسَأَكْتُبُها لِلَّذِينَ يَتَّقُونَ» (پس آن را برای کسانی که پرهیزگاری می‌کنند خواهم نوشت) و قول او: «كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ» (پروردگارتان رحمت را بر خود واجب کرده است). و اما رحمت امتنان (رحمت از روی فضل)، آن رحمتی است که بدون استحقاق به واسطه عمل به دست می‌آید. و خداوند به رحمت امتنان خود، به کسی که او را برای عمل صالح موفق ساخت و آن عمل، رحمت واجبه را برایش ایجاب کرد، رحم نمود. پس به واسطه آن، گناهکار و اهل آتش به رفع عذاب از خود دست می‌یابند، اگرچه مسکن و سرایشان جهنم باشد. و این همان رحمت امتنان است. قول او به پیامبرش (صلی الله علیه و سلم): «فَبِما رَحْمَةٍ مِنَ الله لِنْتَ لَهُمْ» (پس به سبب رحمتی از جانب خدا بود که با آنان نرم‌خو شدی). و این معنای قول اوست: «صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ» (راه کسانی که به آنان نعمت دادی)؛ یعنی راهی که به واسطه آن بر ایشان نعمت دادی، و آن رحمتی است که توفیق و هدایت را در سرای تکلیف به آنان بخشید، و این رحمت عنایت است. پس به واسطه آن، نه مغضوب علیهم بودند و نه گمراهان، زیرا هدایتی که به آنان عطا شد، ایشان را از سرگردانی بازداشت. کسی که خداوند بر او خشم گرفته می‌گوید: بر ما نیز با رحمتی که از ابتدا و بدون استحقاق بر آنان منت نهادی، منت بگذار، تا آنجا که آنان را به عنوان «غیر مغضوب علیهم» توصیف کردی، زیرا با هدایت بر آنان منت نهادی و گمراهی که همان سرگردانی است را از ایشان زدودی. پس بر ما منت بگذار به آنچه استحقاق ما از غضب الهی را برطرف می‌کند. پس خداوند به رحمت امتنان (رحمت از روی فضل) که همان رحمت موجود در آیه سوم با اسم رحمان است، بر آنان رحم می‌کند و عذاب را از ایشان برمی‌دارد و با اسم رحیم، در همان حالی که هستند، به آنان نعمت می‌بخشد. پس در ام‌الکتاب (فاتحه) آیه غضبی نیست، بلکه تمام آن رحمت است و بر هر آیه دیگری در کتاب حاکم است، زیرا که مادر (ام) است. پس رحمت او بر غضبش پیشی گرفت. و چگونه چنین نباشد، در حالی که نسبتی که میان عالم و خداوند است، تنها از اسم رحمان است. پس رحم (پیوند خویشاوندی) را پاره‌ای از آن قرار داد، و رحم جز به او نسبت داده نمی‌شود. و در عالم چیزی نیست مگر رحمتی که از جانب اوست، به امری که ناگزیر از آن است. و رحمت حادث (مخلوق) نمی‌تواند در عمومیت، رحمت قدیم را فرا گیرد، زیرا علم حق (الحق) هر معلومی را فرا می‌گیرد، و هیچ کس از علم حق احاطه نمی‌یابد مگر به آنچه او بخواهد. پس خلق به اندازه علم خود رحم می‌کنند، همان‌گونه که خداوند به اندازه علم خود رحم نمود. پس هر کس از اهل عالم که خشم گرفت و انتقام کشید، در واقع به واسطه آن انتقام به خود رحم کرده است، زیرا آن انتقام شفایی است برای دردی که از خشم می‌یابد، و صدقه انسان بر نفس خود، بهترین صدقات است. پس هنگامی که به خود رحم کرد و خشم زائل شد، رحمت به دنبال آن می‌آید، و آن همان پشیمانی است که انسان هنگام مجازات کسی می‌یابد و می‌گوید: اگر خدا می‌خواست، عفو کردن بهتر بود. ناگزیر است که این را بگوید، یا در دنیا یا در آخرت، در انتقام کشیدن برای نفس خود. تا کسی گمان نکند که اجرای حدود (شرعی) از این قبیل است، زیرا اجرای حدود، شریعتی از جانب خداست و انسان در آن دخالتی ندارد. پس انسان با این عمل، رحم خود را وصل کرده و وصول رحمت به سوی اوست. بنابراین، ناگزیر است که همه خلق به رحمت خدا دست یابند، برخی زودتر و برخی دیرتر. زیرا در آنجا کسی نیست مگر آنکه رحم خود را وصل کرده و خداوند او را از آن جهت وصل نموده است؛ و کسی که رحم خود را قطع کرده، یعنی بخشی از رحم خود را قطع کرده است، زیرا قطع نمی‌تواند فراگیر باشد. چرا که عین قطع یک رحم خاص، وصل رحم دیگری برای اوست. پس در قطع او، وصل وجود دارد و در وصل او، قطع نیست. پس رحم‌های وصل شده شفاعت می‌کنند و شفاعت پذیرفته است، و وزن را بر مقطوع (قطع شده) با تعریف برپا می‌دارد، زیرا ناگزیر است که آن مقطوع نیز رحمی از خود را قطع کرده باشد. پس هنگامی که از کسی که صله رحم را از او قطع کرده‌اند، طلب می‌شود، حق (الحق) به او می‌گوید: همان‌گونه که برای تو می‌گیرم، از تو نیز می‌گیرم. و او را آگاه می‌سازد که او نیز رحمی از خود را قطع کرده است. پس از خداوند طلب عفو و گذشت می‌کند. پس خداوند به او می‌گوید: تو از کسی که رحم تو را قطع کرده است، در حق خودت درگذر تا من از تو درگذرم. پس او از روی ناچاری می‌گوید: درگذشتم؛ زیرا آن موطن، از شخص ترسان طلب عفو می‌کند. پس او می‌بخشد و خداوند نیز او را می‌بخشد. پس رحمت خدا به واسطه عفو این شخص به او می‌رسد و رحم دیگری از او وصل می‌شود و در حق او شفاعت می‌کند. و این معنای قول خداوند عز و جل در روز قیامت است: «شفعت الملائكة وشفع النبيون والمؤمنون وبقي أرحم الراحمين» (فرشتگان شفاعت کردند، پیامبران و مؤمنان شفاعت کردند، و ارحم الراحمین باقی ماند).\n\nپس از جانب او در حق بندگانش، آنچه ذکر کردیم و امثال آن از هر آنچه رحمت را می‌طلبد، واقع می‌شود. زیرا رحمت خداوند بر غضبش پیشی گرفته است، پس رحمت پیشوای غضب است. پس غضب خداوند پیوسته در مسیر خود به انتقام از بندگان جاری می‌شود تا به آخرین حد خود برسد، آنگاه می‌یابد که رحمت بر او پیشی گرفته است. پس رحمت، بندگان مغضوب علیهم را از او می‌گیرد و بر آنان گسترده می‌شود و حکم در مورد آنان به رحمت باز می‌گردد. و حدی که غضب به آن می‌رسد، همان فاصله میان «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان) در بسمله و «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان) پس از قول او «الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (ستایش از آنِ خداوندی است که پروردگار جهانیان است) می‌باشد. پس «الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (ستایش از آنِ خداوندی است که پروردگار جهانیان است) عین آن حد است. آغاز آن «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان) و پایان آن «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان) است. و «الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (ستایش از آنِ خداوندی است که پروردگار جهانیان است) عین آن حد است، زیرا در این حد، خوشی و ناخوشی (سراء و ضراء) آشکار می‌شود. به همین دلیل، حمد که همان ثناست، در آن قرار گرفت و در این حد به ناخوشی یا خوشی مقید نشد، زیرا خوشی و ناخوشی را در بر می‌گیرد. پس رسول خدا (صلی الله علیه و سلم) در خوشی می‌فرمود: «الحمد لله المنعم المفضل» (ستایش از آنِ خداوندی است که نعمت‌دهنده و فضل‌کننده است) و در ناخوشی می‌فرمود: «الحمد لله على كل حال» (ستایش از آنِ خداوندی است در هر حال). پس حمد خداوند در خوشی و ناخوشی آمده است، به همین دلیل عین آن حد است. و هیچ کس در سرای آخرت نیست مگر آنکه خداوند را حمد می‌گوید و به رحمت او امید دارد و از عذاب و استمرار آن بر خود می‌ترسد. پس خداوند به دنبال قول خود «الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ» (ستایش از آنِ خداوندی است که پروردگار جهانیان است)، قول «الرَّحْمنِ الرَّحِيمِ» (بخشنده مهربان) را قرار داد. پس عالم میان این رحمت و رحمت بسمله قرار دارد، با آنچه از ستوده و نکوهیده در اوست. و این شبیه چیزی است که در سوره «ألم نشرح» آمده است، قول خداوند متعال: «فَإِنَّ مَعَ الْعُسْرِ يُسْراً» (پس به راستی که با هر سختی آسانی است)، سپس «إِنَّ مَعَ الْعُسْرِ يُسْراً» (به راستی که با هر سختی آسانی است). و برخی در این باره چنین سروده‌اند:\n\nچون کار بر تو تنگ شد\nدر «ألم نشرح» بیندیش\n\nپس سختی میان دو آسانی است\nچون آن را یاد کنی، شاد شو\n\nزیرا او سبحانه، «یسر» (آسانی) را نکره آورد و الف و لام عهد و تعریف را بر «عسر» (سختی) وارد کرد؛ یعنی این سختی دوم، عین همان سختی اول است، اما در مورد آسانی چنین نیست. و این تنبیهی شگفت‌انگیز از جانب خداوند برای بندگانش است تا امید و طمع در رحمت خدا در نزدشان قوی شود، زیرا او ارحم الراحمین است. زیرا اگر او بر بندگانش در رحمت، به حکمی که برای آنان نیست، نیفزاید، پس چگونه ارحم الراحمین خواهد بود؟ و او بدون شک ارحم الراحمین است. به خدا سوگند، کسی که رحمت خدا از همه جهات او را احاطه کرده باشد، ناامید نمی‌شود. پس این را بدان. و هنگامی که حقایق (الحقائق) صحیح باشند، بگذار نادان هر چه می‌خواهد بگوید. زیرا گروهی در این باره با ما منازعه کردند. و اگر رحمت خداوند تا این حد فراگیر نبود، کسانی که چنین می‌گویند، هرگز به رحمت خدا دست نمی‌یافتند. پس از خداوند می‌خواهم که ما را به جاهلان ملحق نسازد، زیرا هیچ صفتی و هیچ عیبی زشت‌تر از جهل نیست. چرا که جهل کلید هر شری است. و به همین دلیل به محمد (صلی الله علیه و سلم) فرمود: «فَلا تَكُونَنَّ مِنَ الْجاهِلِينَ» (پس زنهار از جاهلان مباش). او را با چنین خطابی مورد خطاب قرار داد به دلیل جوانی و نیروی شبابش. پس او را با خطابی قوی در نهی از آن مواجه ساخت. و خداوند متعال به نوح (علیه السلام) فرمود، هنگامی که نیروی جوانی نداشت و پیر شده بود و در سنی بود که در عرف و عادت همواره محترم و با او مدارا می‌شد: «إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجاهِلِينَ» (من تو را پند می‌دهم که از جاهلان نباشی). پس هنگام موعظه، در خطاب با او مدارا کرد. زیرا ناگزیر باید میان خطاب جوانان و خطاب پیران فرق گذاشت، همان‌گونه که ناگزیر باید در خطاب میان احوال فرق گذاشت. چنانکه ما در ثنای خداوند بر اساس احوال فرق می‌گذاریم، پس در خطاب خوشی می‌گوییم: «الحمد لله المنعم المفضل» (ستایش از آنِ خداوندی است که نعمت‌دهنده و فضل‌کننده است) و در ناخوشی می‌گوییم: «الحمد لله على كل حال» (ستایش از آنِ خداوندی است در هر حال)، به دلیل اختلاف انگیزه‌ای که برای حمد وجود دارد. رسول خدا (صلی الله علیه و سلم) این را با عمل خود به ما آموخت. و اما رحم‌کنندگان از بندگان خدا نسبت به بندگان خدا، بلکه مطلقاً نسبت به خلق خدا، خداوند به سرعت رحمت را به سوی آنان می‌فرستد، هنگامی که آنان را ملاقات می‌کند، زیرا به خلق رحم کردند به واسطه رحمتی که در نفوسشان به دلیل عطوفت بر خلق خدا برپا شده است. پس خداوند به آنان رحم می‌کند. زیرا این اعمالشان است که به سوی آنان باز می‌گردد، چنانکه در خبر آمده است. پس خداوند سبحانه به واسطه رحمت خودشان، به آنان رحم نمود.\n\nپس نه پیمان ببند و نه مخالفت کن\nو راستگو باش و جدا مشو\n\nپس هر کس به خلق خدا رحم کند، در واقع به خود رحم کرده است. سپس خداوند رحمت دیگری برای آنان دارد که افزون بر آن رحمتی است که به دلیل رحمتشان بر خلق خدا (که از اعمالشان است) به آنان بخشیده است. و صورت آن این است که رحم‌کننده از ما، هنگامی که به مخلوقی از خلق خدا رحم می‌کند، خالی از این نیست که یا رحمتش به او صرفاً رفع دردی باشد که آن مخلوقِ مورد رحمت را آزار می‌دهد، یا علاوه بر آن، احسانی نیز به او بیفزاید. مانند کسی که شخصی را از زندان بیرون می‌آورد که مستحق عذاب بوده، و با شفاعت خود مانع نزول عذاب بر او می‌شود، یا خود او را می‌گیرد و سپس پس از این امان، با دادن ولایتی یا مالی یا خلعت یا تقریب، احسانی به او می‌کند. این امری دیگر است. پس هنگامی که خداوند به بنده‌ای به واسطه علمش رحم می‌کند، که آن بنده نیز به موجودی مانند خود رحم کرده است، یا با رفع عذاب یا با افزودن احسان بیشتر به آن، خداوند هنگامی که رحمت را به عنوان جزای عملش به او می‌دهد، هر چه باشد، خداوند بر آن می‌افزاید، همان‌گونه که این بنده بر آنچه ذکر کردیم افزود، یا از ابتدا به عنوان منت و فضل از جانب خود بر آن می‌افزاید. فرمود: «الراحمون يرحمهم الرحمن» (رحم‌کنندگان را رحمان رحم می‌کند) و نگفت: «یرحمهم الرحیم» (رحیم به آنان رحم می‌کند)، زیرا رحمان، رحمان دنیا و آخرت است، اما رحیم اختصاص رحمت به آخرت است. و اما قول او: «ارحموا من في الأرض يرحمكم من في السماء» (به کسانی که در زمین هستند رحم کنید تا آن کس که در آسمان است به شما رحم کند). زیرا شما صاحبان بلاها و گوشه‌نشینان را مشاهده می‌کنید و از آنان درمی‌گذرید، پس به امر خدا به رحمتی که احوالشان می‌طلبد، به آنان رحم می‌کنید، هر کس بر حسب حال خود رحم می‌کند. و در آسمان جز فرشتگان نیستند، پس آنان با استغفار به ما رحم می‌کنند، و این همان قول خداوند متعال است: «وَيَسْتَغْفِرُونَ لِمَنْ فِي الْأَرْضِ» (و برای کسانی که در زمین هستند طلب آمرزش می‌کنند)، سپس فرمود: «أَلا إِنَّ الله هُوَ الْغَفُورُ الرَّحِيمُ» (آگاه باشید که خداوند همان آمرزنده مهربان است). و اما قول او در این باب: «و نسیناه» (و او را فراموش کردیم) در این منزلت، حد فراموشی آن انسان نسبت به خداوند در امور است. پس چیزی جز فراموشی او به خودش بازنگشت. و حق (الحق) آن را به خود نسبت داد و فرمود: «نَسُوا الله فَنَسِيَهُمْ» (خدا را فراموش کردند، پس خدا نیز آنان را فراموش کرد). یعنی حق خدا را ترک کردند، پس خداوند نیز حقی را که آنان به واسطه جرم‌هایشان مستحق آن بودند، ترک کرد. پس آنان را مؤاخذه نکرد و آنان را به عذاب ابدی نگرفت، بلکه آنان را آمرزید و به آنان رحم کرد. و این با آنچه علمای رسوم (ظاهرگرا) فهمیده‌اند، متفاوت است، زیرا این از باب اشاره (رمز) است نه از باب تفسیر (ظاهر). زیرا فراموش‌کننده در اینجا، هنگامی که جز حق خدا را که خداوند شرعاً به انجام آن امر کرده است، به خود نسبت نمی‌دهد، پس خدا را فراموش کرده است، زیرا جز خدا کسی آن را برای او تشریع نکرده است. پس حق خدا را ترک کرد. آنگاه خداوند کرم خود را در حق او آشکار ساخت و حق خود را ترک کرد. و حق چنین کسی جز آنچه مستحق آن بود، یعنی عقاب، نبود. پس با ترک در مقابل ترک، که با لفظ نسیان (فراموشی) بیان شده، از او درگذشت. و اما نهی خداوند متعال از اینکه ما مانند «كَالَّذِينَ نَسُوا الله فَنَسِيَهُمْ» (کسانی که خدا را فراموش کردند، پس خدا نیز آنان را فراموش کرد) باشیم، صحیح است. زیرا این وصیتی الهی است که ما را نهی کرده است از اینکه خدا را مانند آنان فراموش کنیم، تا به حق خدا قیام کنیم و حق خدا را در امور با نیتی صالح و حضور با خدا برپا داریم. پس خداوند ما را به جزای استحقاقی که به واسطه اعمالمان که خداوند ما را به آن موفق ساخت، مستحق شده‌ایم، پاداش دهد. و کسانی که خدا را فراموش کردند، خداوند تنها آنچه را که از عقاب مستحق بودند، ترک کرد، همان‌گونه که آنان حق خدا را ترک کردند، نه چیز دیگر. سپس اگر بر آنان فضل کند، این فضل از روی منت و ابتدا از جانب اوست. و فضل او بر جهانیانی که حقوق خدا را ادا می‌کنند، منت نیست. پس اگر بر آنچه عملشان می‌طلبد بیفزاید، آن همان امتنان (فضل) است. همان‌گونه که آنان آنچه را که به واسطه آن مستحق این ثواب شدند، از طریق منت به دست آوردند. پس این را بدان. آیا نمی‌بینی که خداوند در ادامه این آیه، هنگامی که فرمود: «وَلَا تَكُونُوا كَالَّذِينَ نَسُوا الله فَنَسِيَهُمْ» (و مانند کسانی نباشید که خدا را فراموش کردند، پس خدا نیز آنان را فراموش کرد)، نگفت که آنان همان فاسقان هستند، بلکه فرمود: «إِنَّ الْمُنافِقِينَ هُمُ الْفاسِقُونَ» (به راستی که منافقان همان فاسقان هستند). پس کلام دیگری را آغاز کرد که ضمیری در آن نیست که به این افراد مذکور بازگردد. و هر منافقی فاسق است، زیرا از هر دری که دارد خارج می‌شود؛ برای مؤمنان به صورتی که آنان هستند ظاهر می‌شود و برای کافران به صورتی که آنان هستند ظاهر می‌شود. و مرتبه منافقان در منازل (منازلت) در این کتاب پیشتر آمده است. پس به آنچه تو را آگاه ساختم، توجه کن و از عالمان باش که «الَّذِينَ يُوفُونَ بِعَهْدِ الله» (کسانی که به عهد خدا وفا می‌کنند)... «فَنِعْمَ أَجْرُ الْعامِلِينَ» (پس چه نیکوست پاداش عمل‌کنندگان). و به عفو خدا قناعت مکن تا از کسانی باشی که خدا را فراموش کردند، بلکه به احسان او رغبت داشته باش، به اینکه در اینجا عمل و مراقبه‌ات را بیفزاید، تا در نزد خود جاه و حرمت تو را بیفزاید. و اما قول خداوند متعال که ما را نهی می‌کند: «وَلَا تَكُونُوا كَالَّذِينَ نَسُوا الله فَأَنْساهُمْ أَنْفُسَهُمْ أُولئِكَ هُمُ الْفاسِقُونَ» (و مانند کسانی نباشید که خدا را فراموش کردند، پس خدا نیز خودشان را از یادشان برد؛ آنان همان فاسقان هستند). پس ضمیر را به آنان بازگرداند. این سبکی دیگر است که حقیقت آن را در مسئله شرف نفاق (النفاق المحمود) در منازل (المنازل) در بخش‌های گذشته این کتاب ذکر کردیم. پس از آن، آنچه را که به دلیل نسیان (فراموشی) مناسب این موضع است، ذکر می‌کنیم. و آن این است که خداوند بر زبان رسول خدا (صلی الله علیه و سلم) فرمود: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت). زیرا ما را دلیلی بر او قرار داد. و شایسته نیست که در معرفت نفوس خود نظر کنیم مگر تا زمانی که بخواهیم پروردگارمان را بشناسیم. پس اگر این معرفت را فراموش کنیم، معرفت نفوس خود را فراموش کرده‌ایم، و این همان باب واحدی است که شایسته بود از آن به سوی این معرفت خارج شویم. اما ما از باب دیگر خارج شدیم که از آن به سوی جهل به نفوس خود خارج می‌شویم. و چون خداوند ما را بر صورت الهی آفرید، در فراموشی ما نسبت به خدا، این بود که خداوند ما را نسبت به خودمان فراموشاند. پس از آن نهی شدیم. زیرا هر کس خود را فراموش کند، ناگزیر حقوقی را که خدا بر او دارد و حقوقی را که او دارد، فراموش می‌کند. پس خدا را ترک کردند، زیرا دانستند که از خداوند آنچه را که او بر آن است، شهود نمی‌کنند، بلکه تنها اعیان و احوال خود را از خداوند شهود (الشهود) می‌کنند و بس. پس هنگامی که خداوند این را از برخی بندگان خود که دارای این وصف هستند دانست، آنان را نسبت به خودشان فراموشاند. پس هنگام شهود (الشهود) ندیدند که احوالشان عین چیزی است که دیده‌اند. پس در آن شهود می‌گویند: خدا به من گفت و من به او گفتم. و این کجا با مقام قولشان که «ما از حق (الحق) جز آنچه خود بر آن هستیم نمی‌بینیم» قابل مقایسه است؟ این برای آنان حاصل نشد مگر به دلیل اینکه خداوند متعال آنان را نسبت به خودشان فراموشاند. پس «أُولئِكَ هُمُ الْفاسِقُونَ» (آنان همان فاسقان هستند)؛ یعنی خارج‌شدگان از راهی که به آن متحقق شده بودند که هیچ کس خدا را شهود نمی‌کند، نه از حیث حالش و نه از حیث آنچه بر آن است. و چون خداوند متعال خود را به عنوان «خَيْرُ الرَّاحِمِينَ» (بهترین رحم‌کنندگان) از باب مفاضله (برتری) توصیف کرد، معلوم است که هیچ یک از مخلوقات به دیگری رحم نمی‌کند مگر به واسطه رحمتی که رحمان در او ایجاد کرده است. پس آن رحمت، رحمت اوست نه رحمت آنان، که در صورت مخلوق ظاهر شده است. همان‌گونه که در «سمع الله لمن حمده» (خداوند سخن کسی را که او را ستایش کند شنید) فرمود، آن قول، قول خداست بر زبان بنده‌اش. پس قول خداوند متعال که موسی آن را شنید، در شرف کامل‌تر از قول خداوند متعال بر زبان گوینده است. پس برتری به واسطه محلی است که قول از آن شنیده شده، در حالی که معلوم است آن قول، قول خداست. و همچنین رحمت او از حیث ظهورش از مخلوق، پایین‌تر از رحمت او به بنده‌اش در غیر صورت مخلوق است. پس برتری و افضل بودن به واسطه محل‌ها مشخص می‌شود. مگر اینکه رحمت خدا به بنده‌اش در صورت مخلوق، عظیم باشد. زیرا او از روی ذوق رحم می‌کند و با رحمت خود، دردی را که رحم‌کننده در نفس خود از این شخص مورد رحمت می‌یابد، برطرف می‌سازد. اما حق (الحق) چنین نیست. پس رحمت او خالص است و رفع دردی به او باز نمی‌گردد. پس او «خَيْرُ الرَّاحِمِينَ» (بهترین رحم‌کنندگان) است. پس رحمت مخلوق از روی شفقت است و رحمت خدا مطلق است، برخلاف قهر و انتقام او با وجود شدتشان. اما او قهری نمی‌کند که در آن رحمت نباشد، زیرا نهایت رحمت در آن، ایجاد قهر بر بنده‌اش است. پس وجود قهر، رحمتی است که خداوند به واسطه آن بر شخص مورد قهر رحم کرده است، زیرا او را از عدم به هستی (الوجود) آورده است. و کسی که از صفت رحمت آفریده شده باشد، ناگزیر باید در قهرش رحمت باشد. پس ابویزید در این مقام آمد، هنگامی که قاری را شنید که می‌خواند: «إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ» (به راستی که قهر پروردگارت سخت است)، ابویزید گفت: قهر من سخت‌تر است. زیرا قهر انسان، هنگامی که قهر می‌کند، هیچ رحمتی در آن نیست، چون نمی‌تواند بر کسی قهر کند در حالی که به طور کامل به او رحم داشته باشد. پس آن قهر جز بر حسب آنچه محل قهرکننده به او داده است، نیست. و اگرچه آن قهر، خلق خداست، اما آن را جز در این محل نیافریده است. پس به صورت محل ظاهر شد، و محل (انسان) انتقام را از کسی نمی‌طلبد در حالی که در قلبش رحمت باشد. سپس، هنگامی که خداوند بر بنده‌اش قهر می‌کند، در قهرش نوعی رحمت وجود دارد، زیرا او بدون شک بنده اوست. همان‌گونه که مخلوق نیز هنگامی که می‌خواهد بر بنده‌اش قهر کند، ناگزیر باید قهرش با نوعی رحمت آمیخته باشد، به دلیل مناسبتی که میان او و بنده و مملوکش وجود دارد، زیرا اوست که نام مالک و سیادت را بر او باقی می‌گذارد. پس ممکن نیست که در قهر خود تا جایی پیش رود که عین او را از بین ببرد، زیرا در آن صورت بر خود قهر کرده است. و مخلوق در مورد بیگانه که میان او و قهرکننده نسبت عبودیت نیست و از وجود او صفت سیادت کسب نکرده است، چنین نیست. پس هنگامی که کسی با این صفت قهر کند، قهری می‌کند که هیچ رحمتی در آن آمیخته نیست. پس او سبحانه «خَيْرُ الرَّاحِمِينَ» (بهترین رحم‌کنندگان) است. و هرگز از او تعالی نیامده است که او بهترین گیرندگان، یا بهترین قهرکنندگان، یا بهترین انتقام‌گیرندگان، یا بهترین عذاب‌دهندگان است؛ همان‌گونه که آمده است: «خَيْرُ الْفاصِلِينَ» (بهترین داوران)، و «خَيْرُ الْغافِرِينَ» (بهترین آمرزندگان)، و «خَيْرُ الرَّاحِمِينَ» (بهترین رحم‌کنندگان)، و بهترین شاکران و امثال اینها. با وجود اینکه او قهر می‌کند، انتقام می‌گیرد، می‌گیرد، هلاک می‌کند و عذاب می‌دهد، اما نه از طریق افضل بودن. پس این تمایز را میان وصف او به گرفتن و انتقام و وصف او به رحمت و مغفرت دریاب. و «وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}