{
  "id": 234,
  "title": {
    "ar": "الباب الرابع والثلاثون ومائتان في الرهبة",
    "en": "Chapter Two Hundred and Thirty-Four, Concerning Reverential Fear (الرهبة)",
    "ur": "باب نمبر دو سو چونتیس: رہبہ (الرہبہ) کے بیان میں",
    "fa": "باب دویست و سی و چهارم در باب رهبت (الرهبة)"
  },
  "content": {
    "ar": "## «الباب الرابع والثلاثون ومائتان في الرهبة»\n\n\n> الرهبة الخوف من سبق وتقليب *** ومن وعيد لصدق المخبر الصادق‏\n\n\n> دل الدليل عليه من مضايفة *** فالراهب الخائف المسارع السابق‏\n\n\n> يسير في ظلمة عمياء غاسقة *** سير المريب وسير الواله العاشق‏\n\n\n> يسرى بهمته خوفا فتبصره *** يخاف في سيره من فجأة الطارق‏\n\n\n### [الرهبة على ثلاثة أوجه‏]\n\n\nالرهبة عند القوم تقال بإزاء ثلاثة أوجه رهبة من تحقيق الوعيد ورهبة من تقليب العلم ورهبة من تحقيق أمر السبق فالأول إذا جاء الوعيد بطريق الخبر والخبر لا يدخله النسخ فهو ثابت والثاني تقليب العلم ف يَمْحُوا الله ما يَشاءُ ويُثْبِتُ والثالث ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وأما الرهبة المطلقة من غير تقييد بأمر ما معين فهي كل خوف يكون بالعبد حذرا أن لا يقوم بحدود ما شرع له سواء كان حكما مشروعا إلهيا أو حكما حكميا كما قال تعالى ورَهْبانِيَّةً ابْتَدَعُوها أي هم شرعوها لأنفسهم ما أوجبناها عليهم ابتداء فاعتبرها الحق وآخذهم بعدم مراعاتها فما كتبها الله عليهم إِلَّا ابْتِغاءَ رِضْوانِ الله فأثنى على المراعين لها ليحسن القصد والنية في ذلك وفي الكلام تقديم وتأخير كأنه يقول فما رعوها حق رعايتها إلا ابتغاء رضوان الله يعني المراعين لها وفي شرعنا من هذه الرهبانية من سن سنة حسنة وهذا هو عين الابتداع ولما جمع عمر بن الخطاب الناس على أبي في قيام رمضان قال نعمت البدعة هذه فسماها بدعة ومشت السنة على ذلك إلى يومنا هذا فلما اقترن بالأعمال المشروعة وجوب القيام بحقها كالنذر خاف المكلف فقامت الرهبة به فأدته إلى مراعاة الحدود فسمي راهبا وسميت الشريعة رهبانية ومدح الله الرهبان في كتابه فمن الناس من علق رهبته بالوعيد فخاف من نفوذه كالمعتزلي القائل بإنفاذ الوعيد فيمن مات عن غير توبة\n\n\n### [إن المؤمن يندم على ارتكاب معصية]\n\n\nفاعلم إن هنا نكتة أنبهك عليها وذلك أنه من المحال أن يأتي مؤمن بمعصية توعد الله عليها فيفزع منها إلا ويجد في نفسه الندم على ما وقع منه وقد قال صلى الله عليه وسلم الندم توبة\n\n\nوقد قام به الندم فهو تائب فسقط حكم الوعيد لحصول الندم فإنه لا بد للمؤمن أن يكره المخالفة ولا يرضى بها وهو في حال عمله إياها فهو من كونه كارها لها مؤمن بأنها معصية ذو عمل صالح وهو من كونه فاعلا لها ذو عمل سيئ فغايته إن يكون من الذين خَلَطُوا عَمَلًا صالِحاً وآخَرَ سَيِّئاً فقال تعالى عقيب هذا القول عَسَى الله أَنْ يَتُوبَ عَلَيْهِمْ وعسى من الله واجبة ورجوعه عليهم إنما هو بالمغفرة ويرزقهم الندم عليها والندم توبة فإذا ندموا حصلت توبة الله عليه فهو ذو عمل صالح من ثلاثة أوجه الايمان بكونها معصية وكراهته لوقوعها منه والندم عليها وهو ذو عمل سيئ من وجه واحد وهو ارتكابه إياها ومع هذا الندم فإن الرهبة تحكم عليه سواء كان عالما بما قلناه أو غير عالم فإنه يخاف وقوع مكروه آخر منه ولو مات على تلك التوبة فإن الرهبة لا تفارقه وينتقل تعلقها من نفوذ الوعيد إلى العتاب الإلهي والتقرير عند السؤال على ما وقع منه فلا يزال مستشعرا وهو نوع من أنواع الوعيد فإن الله يقول فَمَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ خَيْراً يَرَهُ ومن يَعْمَلْ مِثْقالَ ذَرَّةٍ شَرًّا يَرَهُ فلا بد أن يوقف عليه فهو يرهب من هذا التوبيخ برؤية ذلك العمل القبيح الذي لا بد له من رؤيته ولم يتعرض الحق في هذه الآية للمؤاخذة به فالرؤية لا بد منها فإن كان ممن غفر له يرى عظيم ما جنى وعظيم نعمة الله‏\nعليه بالمغفرة هذا يعطيه الخبر الإلهي الصدق الذي لا يدخله الكذب فإنه محال على الجناب الإلهي فإن نظر العالم إلى أن خطاب الحق لعباده إنما يكون بحسب ما تواطئوا عليه وهذا خطاب عربي لسائر العرب بلسان ما اصطلحوا عليه من الأمور التي يتمدحون بها في عرفهم ومن الأمور التي يذمونها في عرفهم فعند العرب من مكارم الأخلاق أن الكريم إذا وعد وفى وإذا أوعد تجاوز وعفا وهي من مكارم أخلاقهم ومما يمدحون بها الكريم ونزل الوعيد عليهم بما هو في عرفهم لم يتعرض في ذلك لما تعطيه الأدلة العقلية من عدم النسخ لبعض الأخبار ولاستحالة الكذب بل المقصود إتيان مكارم الأخلاق قال شاعرهم‏\n\n\n> وإني إذا أوعدته أو وعدته *** لمخلف إيعادى ومنجز موعدي‏\n\n\nمدح نفسه بالعفو والتجاوز عمن جنى عليه بما أوعد على ذلك من العقوبة بالعفو والصفح ومدح نفسه بإنجاز ما وعد به من الخير يقال في اللسان وعدته في الخير والشر ولا يقال أوعدته بالهمز إلا في الشر خاصة والله يقول وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ أي بما تواطئوا عليه والتجاوز والعفو عند العرب مما تواطئوا على الثناء به على من ظهر منه فالله أولى بهذه الصفة فقد عرفنا الله أن وعيده ينفذه فيمن شاء ويغفر لمن شاء ومع هذه الوجوه فلا يتمكن زوال الرهبة من قلب العبد من نفوذ الوعيد لأنه لا يدري هل هو ممن يؤاخذ أو ممن يعفى عنه وقد قدمنا ما يجده المخالف عقيب المخالفة من الندم على ما وقع منه وهو عين التوبة فالحمد لله الذي جعل الندم توبة ووصف نفسه تعالى بأنه التواب الرحيم أي الذي يرجع على عباده في كل مخالفة بالرحمة له فيرزقه الندم عليها فيتوب العبد بتوبة الله عليه لقوله ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا إِنَّ الله هُوَ التَّوَّابُ الرَّحِيمُ وأما الرهبة الثانية التي هي لتحقيق تقليب العلم فيخاف من عدم علمه بعلم الله فيه هل هو ممن يستبدل أم لا قال تعالى وإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْماً غَيْرَكُمْ ثُمَّ لا يَكُونُوا أَمْثالَكُمْ فقد أعطى السبب وهو التولي وقد أعطى العلامة وهو عدم التولي عن الذكر لا عن الله فإن التولي عن الله لا يصح ولهذا قال لنبيه فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا كيف يتولى عمن هو بالمرصاد والكل في قبضته وبعينه ولما كان مشهده تقليب العلم بتقليب المعلوم فإن العلم يتعلق به بحسب ما هو عليه فتغير التعلق لتغير المتعلق لا لتغير العلم فرهبته من تقليب العلم عين رهبته مما يقع منه فإن العلم لا حكم له في التقليب على الحقيقة وإنما التقليب لموجد عين الفعل الذي يوقع الرهبة في القلب وهو كونه قادرا ويتعلق العلم بذلك الانقلاب والمنقلب إليه قال تعالى ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ أي إذا ظهر منكم عند الابتلاء بالتكليف ما يكون منكم من مخالفة أو طاعة يتعلق العلم مني عند ذلك به كان ما كان وحضرة تقليب العلم قوله يَمْحُوا الله ما يَشاءُ ويُثْبِتُ فذكر المحو بعد الكتابة ويثبت ما شاء مما كتبه وعِنْدَهُ أُمُّ الْكِتابِ وهي السابقة التي لا تتبدل ولا تمحى فلما علم عز وجل ما يمحو من ذلك بعد كتابته وما يثبت أضيف التقليب إلى العلم والتحقيق ما ذكرناه من تغيير التعلق وعدم التقليب في العلم وأما قوله تعالى عَلِمَ الله أَنَّكُمْ كُنْتُمْ تَخْتانُونَ أَنْفُسَكُمْ فما أراد هنا تعلق علمه تعالى بأنهم يختانون أنفسهم وإنما المستقبل هنا بمعنى الماضي فإن اللسان العربي يجي‏ء فيه المستقبل ببنية الماضي إذا كان متحققا كقوله تعالى أَتى‏ أَمْرُ الله فَلا تَسْتَعْجِلُوهُ وشبهه وقد كان الحق كلفهم قبل هذا التعريف أن لا يباشر الصائم امرأته ليلة صومه فمنهم من تعدى حد الله في ذلك فلما علم الله ذلك عفا عمن وقع منه ذلك وأحل له الجماع ليلة صومه إلا أن يكون معتكفا في المسجد فما خفف عنهم حتى وقع منهم ذلك ومن من شأنه مثل هذا الواقع فإنه لا يزال يتوقع منه مثله فأبيح له رحمة به حتى إذا وقع منه ذلك كان حلالا له ومباحا وتزول عنه صفة الخيانة فإن الدين أمانة عند المكلف وأما الرهبة لتحقيق أمر السبق فلقوله تعالى ما يُبَدَّلُ الْقَوْلُ لَدَيَّ وقوله لا تَبْدِيلَ لِكَلِماتِ الله وإن كان يسوغ في هذه الآية أن كلمات الله عبارة عن الموجودات كما قال في عيسى إنه‏\n\n\nكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ فنفى أن يكون للموجودات تبديل بل التبديل لله ولا سيما وظاهر الآية يدل على هذا التأويل وهو قوله فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفاً فِطْرَتَ الله الَّتِي فَطَرَ النَّاسَ عَلَيْها لا تَبْدِيلَ لِكَلِماتِ الله أي ليس لهم في ذلك تبديل وهذه بشرى من الله بأن الله ما فطرنا إلا على الإقرار بربوبيته فما يتبدل ذلك الإقرار بما ظهر من الشرك بعد ذلك في بعض الناس لأن الله نفى عنهم أن يكون لهم تبديل في ذلك بل هم على فطرتهم‏\nوإليها يعود المشرك يوم القيامة عند تبري الشركاء منهم وإذا لم يضف التبديل إليهم فهي بشرى في حقهم بما لهم إلى الرحمة وإن سكنوا النار فبحكم كونها دارا لا كونها دار عذاب وآلام بل يجعلهم الله على مزاج ينعمون به في النار بحيث لو دخلوا الجنة بذلك المزاج تألموا لعدم موافقة مزاجهم لما هي عليه الجنة من الاعتدال فمن حقت عليه كلمة الله بأمر فإنه يعمل في غير معمل ويطمع في غير مطمع‏\n\n\nقال رسول الله صلى الله عليه وسلم فيمن يعمل بعمل أهل الجنة حتى يقرب منها بعمله فيما يبدو للناس فيسبق عليه الكتاب فيختم له بعمل أهل النار فيدخل النار وكذلك الآخر ثم قال وإنما الأعمال بالخواتم‏\n\n\nفذكر في هذا الحديث لمن هي السابقة وأن الخاتمة هي عين حكم السابقة ولهذا كان بعضهم يقول أنتم تخافون من الخاتمة وأنا أخاف السابقة وإنما سميت سابقة من أجل تقديمها على الخاتمة فهذا معنى موجود لم يظهر حكمه إلا بعد زمان فهو من بعض ما يمكن أن يستند إليه القائل بالكمون والظهور ولا سيما والشارع قد نبه عليه في الحديث بقوله في عمل أهل النار أعمال السعداء فقال فيما يبدو للناس وكذلك في عمل أهل الجنة أعمال الأشقياء فيما يبدو للناس والذي عندهم وهم فيه في بواطنهم خلاف ما يبدو للناس فعلم الله ذلك منهم فهذا معنى ما ظهر له حكم في الظاهر مع وجوده عندهم والمراؤون من هذا القبيل غير أن هنا بشرى فيما يذهب إليه وذلك أن العلماء قد علموا إن الحكم للسابق فإن اللاحق متأخر عنه ولهذا السابق يحوز قصب السبق وقصب السبق هنا آدم وذريته وقد تجارى غضب الله ورحمته في هذا الشأو فسبقت رحمته غضبه فحازتنا ثم لحق الغضب فوجدنا في قبضة الرحمة قد حازتنا بالسبق فلم ينفذ للغضب فينا حكم التأبيد بل تلبس بنا للمشاهدة بعض تلبس لما جمعنا مجلس واحد أثر فينا بقدر الاستعداد منا لذلك فلما انفصلت الرحمة من الغضب من ذلك المجلس أخذتنا الرحمة بحيازتها إيانا وفارقنا غضب الله فحكمه فينا أعني بنى آدم غير مؤيد وفي غيرنا من المخلوقين ما أدري ما حكمه فيهم من الشياطين والله أعلم وصاحب هذا الذوق ما يرهب السابقة فإن رحمة الله لا يخاف منها إلا في دار التكليف فرهبة السبق إنما متعلقها سبق مخصوص لا سبق الرحمة وذلك السبق عرضي ليس بدائم إذا كان سبق شقاوة لأنه ليس له أصل يعضده فإن أصله غضب الله وهو لا حق لا سابق وأما سبق السعادة فما هو عرضي فيزول لأن له أصلا يعضده ويقويه وهو رحمة الله التي سبقت غضبه ولهذا السبق الجزئي العرضي السعادي يبقى والشقاوي لا يبقى فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Thirty-Four: Concerning Awe (الرهبة)\n\nAwe is the fear of Precedence and Change,\nAnd of the Threat, due to the truthfulness of the Veracious Informer.\nThe evidence points to this through association,\nThus the one in awe (الراهب) is the fearful, the swift, the preceding one.\nHe journeys in a dark, blind, enveloping gloom,\nThe journey of the suspicious and the journey of the passionately devoted lover.\nHe travels by night with his resolve (همة) out of fear, so you perceive him\nFearing in his journey the sudden arrival of the nocturnal visitor.\n\n### [Awe (الرهبة) is of Three Aspects]\n\nAwe, according to the folk [Sufis], is spoken of in relation to three aspects: awe arising from the realization of the Threat (الوعيد), awe arising from the changing of Knowledge (تقليب العلم), and awe arising from the realization of the matter of Precedence (السبق).\n\nThe first is when the Threat comes by way of report, and the report is not subject to abrogation, so it is fixed. The second is the changing of Knowledge, as in: <<يَمْحُوا الله ما يَشاءُ ويُثْبِتُ>> (Allah obliterates what He wills and confirms [what He wills]). The third is: <<ما يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The Word is not changed with Me).\n\nAs for absolute awe (الرهبة المطلقة), without being restricted to a specific matter, it is any fear that causes the servant to be cautious lest he fail to uphold the limits of what has been legislated for him, whether it be a divinely prescribed ruling or a conventional ruling, as the Exalted said: <<ورَهْبانِيَّةً ابْتَدَعُوها>> (And monasticism [رهبانية] which they innovated). That is, they legislated it for themselves; We did not initially obligate it upon them. Yet the Real (الحق) considered it and held them accountable for failing to observe it. For Allah did not prescribe it for them <<إِلَّا ابْتِغاءَ رِضْوانِ الله>> (except seeking Allah's pleasure). He praised those who observed it, so that the intention and purpose in that might be good.\n\nThere is a structural inversion in the statement, as if He says: \"They did not observe it as it should be observed except seeking Allah's pleasure\"—meaning those who observed it.\n\nIn our Law (شرعنا), there is a form of this monasticism for whoever establishes a good precedent (*sunnah hasanah*). This is the very essence of innovation (*ibtida'*). When Umar ibn al-Khattab gathered the people behind Ubayy for the night prayer of Ramadan, he said, \"What an excellent innovation this is.\" He called it an innovation, and the practice has continued as a Sunnah until this day.\n\nWhen prescribed acts are coupled with the necessity of fulfilling their rights, such as a vow, the responsible person fears, and awe arises within him, leading him to observe the limits. Thus, he is called one in awe (راهب), and the Law is called monasticism (رهبانية). Allah praised the monks (الرهبان) in His Book.\n\nSome people link their awe to the Threat, fearing its execution, like the Mu'tazili who insists on the execution of the Threat against one who dies without repentance.\n\n### [The Believer Regrets Committing a Sin]\n\nKnow that there is a subtle point here that I must alert you to: It is impossible for a believer who commits a sin for which Allah has threatened punishment to be terrified of it without finding regret (*nadam*) in his soul for what occurred. The Prophet, peace and blessings be upon him, said: \"Regret is repentance (الندم توبة).\"\n\nSince regret has arisen in him, he is a penitent (تائب), and the ruling of the Threat is nullified by the presence of regret. For the believer must dislike the transgression and not be pleased with it, even while committing the act. By disliking it, he is a believer that it is a sin, possessing a righteous deed (*'amal sālih*). By committing it, he possesses a bad deed (*'amal sayyi'*). His ultimate state is that of those who <<خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا>> (mixed a righteous deed with another that was bad). Following this statement, the Exalted said: <<عَسَى الله أَنْ يَتُوبَ عَلَيْهِمْ>> (Perhaps Allah will turn to them in forgiveness). The word \"perhaps\" (*'asā*) coming from Allah is obligatory. His turning to them is through forgiveness, and He grants them regret over it, and regret is repentance. When they regret, Allah's repentance upon them is realized.\n\nThus, he possesses a righteous deed from three aspects: faith that it is a sin, dislike of its occurrence, and regret over it. He possesses a bad deed from one aspect: his commission of it.\n\nDespite this regret, awe still governs him, whether he is aware of what we have stated or not. He fears the occurrence of another undesirable act. Even if he dies upon that repentance, awe does not leave him. Its attachment shifts from the execution of the Threat to Divine Reproach (*'itāb*) and the accounting during the questioning regarding what occurred. He remains constantly aware of this, and it is a type of threat, for Allah says: <<فَمَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ خَيْراً يَرَهُ * ومَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ شَرًّا يَرَهُ>> (So whoever does an atom's weight of good will see it, and whoever does an atom's weight of evil will see it). He must be confronted with it. He fears this reprimand by seeing that ugly deed, which he must see. The Real (الحق) did not mention punishment in this verse. If he is among those forgiven, he will see the magnitude of his transgression and the magnitude of Allah's grace upon him through forgiveness.\n\nThis is granted to him by the truthfulness of the Divine Report, which is free from falsehood, as falsehood is impossible for the Divine Presence.\n\nThe Gnostic (العالم) considers that the address of the Real (الحق) to His servants is according to what they have agreed upon. This is an Arabic address to all Arabs in the language they use for things they praise in their custom and things they condemn in their custom. Among the Arabs, it is a noble character (*makārim al-akhlāq*) that the generous person fulfills his promise (*wa'd*) but overlooks and pardons his threat (*ī'ād*). This is among their noble characters for which the generous person is praised. The Threat was revealed to them according to what was customary among them, without reference to what rational proofs dictate regarding the non-abrogation of certain reports or the impossibility of falsehood. Rather, the intention is the manifestation of noble character. Their poet said:\n\n> And verily, when I threaten him or promise him,\n> I break my threat but fulfill my promise.\n\nHe praised himself for pardoning and overlooking the one who transgressed against him, regarding the punishment he had threatened, through forgiveness and clemency. He praised himself for fulfilling what he promised of good. In the language, one says, \"I promised him (*wa'adtuhu*)\" regarding both good and evil, but one does not say, \"I threatened him (*aw'adtuhu*)\" with the hamza, except specifically for evil.\n\nAllah says: <<وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ>> (We did not send any messenger except with the language of his people)—that is, according to what they agreed upon. Since overlooking and forgiveness are matters upon which the Arabs agreed to praise whoever manifests them, Allah is more worthy of this attribute. We have been informed by Allah that He executes His Threat against whom He wills and forgives whom He wills.\n\nDespite these facets, the removal of awe from the servant's heart regarding the execution of the Threat is impossible, because he does not know whether he is among those who will be punished or those who will be pardoned. We have already established the regret that the transgressor finds immediately following the transgression, which is the essence of repentance. Praise be to Allah, who made regret repentance and described Himself, the Exalted, as *Al-Tawwāb Al-Rahīm* (The Oft-Returning, the Merciful)—meaning, He returns to His servants in every transgression with mercy for them, granting them regret over it, so the servant repents through Allah's turning to him, based on His saying: <<ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا إِنَّ الله هُوَ التَّوَّابُ الرَّحِيمُ>> (Then He turned to them so that they might repent. Indeed, Allah is the Oft-Returning, the Merciful).\n\nAs for the second awe, which is related to the realization of the changing of Knowledge (تقليب العلم), the servant fears his lack of knowledge regarding Allah's knowledge concerning him—whether he will be replaced or not. The Exalted said: <<وإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْماً غَيْرَكُمْ ثُمَّ لا يَكُونُوا أَمْثالَكُمْ>> (And if you turn away, He will replace you with another people; then they will not be like you). He gave the cause, which is turning away, and He gave the sign, which is not turning away from Our Remembrance (ذكرنا), not from Allah Himself, for turning away from Allah is impossible. This is why He said to His Prophet: <<فَأَعْرِضْ عَنْ مَنْ تَوَلَّى عَنْ ذِكْرِنا>> (So turn away from whoever turns away from Our Remembrance). How can one turn away from Him who is ever watchful, and everything is in His grasp and under His eye?\n\nSince the Gnostic's witnessing (مشهد) is the changing of Knowledge through the changing of the object of knowledge (*ma'lūm*), for Knowledge relates to the object according to what it is, the change in relation is due to the change in the related object, not a change in the Knowledge itself. His awe of the changing of Knowledge is identical to his awe of what proceeds from him, for Knowledge, in reality, has no ruling over the change. The change belongs to the originator of the act itself, which instills awe in the heart—namely, His being All-Powerful. Knowledge relates to that reversal and the object to which it is reversed. The Exalted said: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know). That is, when, through the trial of obligation, there appears from you either transgression or obedience, My Knowledge will then relate to it as it is.\n\nThe Presence (حضرة) of the changing of Knowledge is His saying: <<يَمْحُوا الله ما يَشاءُ ويُثْبِتُ>> (Allah obliterates what He wills and confirms [what He wills]). He mentions obliteration after writing, and He confirms what He wills of what He has written. <<وَعِنْدَهُ أُمُّ الْكِتابِ>> (And with Him is the Mother of the Book), which is the Precedence (السابقة) that is neither changed nor obliterated. Since the Mighty and Majestic knew what He would obliterate of that after writing it and what He would confirm, the changing is attributed to Knowledge, but the reality is what we mentioned: the change in the relation, and the absence of change in the Knowledge.\n\nAs for His saying, the Exalted: <<عَلِمَ الله أَنَّكُمْ كُنْتُمْ تَخْتانُونَ أَنْفُسَكُمْ>> (Allah knew that you were deceiving yourselves), He did not intend here that His Knowledge related to their future self-deception. Rather, the future tense here is in the meaning of the past, for in the Arabic language, the future tense comes in the form of the past when it is certain, like His saying, the Exalted: <<أَتى‏ أَمْرُ الله فَلا تَسْتَعْجِلُوهُ>> (The command of Allah has come, so do not hasten it), and similar examples.\n\nThe Real (الحق) had obligated them before this clarification not to approach their wives on the night of their fast. Some of them transgressed Allah's limit in that. When Allah knew this, He pardoned those who did it and permitted intercourse for them on the night of their fast, unless they were in seclusion (*i'tikāf*) in the mosque. He did not lighten the burden until they had committed the act. Since it was expected that one whose nature is like this might repeat the act, it was permitted for him out of mercy, so that when he did it, it would be lawful and permissible, and the description of betrayal (*khiyānah*) would be removed, for religion is a trust (*amānah*) with the responsible person.\n\nAs for the awe related to the realization of the matter of Precedence (السبق), it is based on His saying, the Exalted: <<ما يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The Word is not changed with Me), and His saying: <<لا تَبْدِيلَ لِكَلِماتِ الله>> (There is no changing of the Words of Allah). Although it is permissible in this verse that the Words of Allah refer to created existents (*mawjūdāt*), as He said of Jesus, he is <<كَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ>> (His Word, which He cast unto Mary). This negates that there is any changing for the existents; rather, the changing belongs to Allah. Especially since the apparent meaning of the verse indicates this interpretation: <<فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفاً فِطْرَتَ الله الَّتِي فَطَرَ النَّاسَ عَلَيْها لا تَبْدِيلَ لِكَلِماتِ الله>> (So set your face toward the religion, inclining to truth. [Adhere to] the primordial nature (فطرة الله) upon which Allah has created mankind. There is no changing of the Words of Allah). That is, they have no power to change this.\n\nThis is good news from Allah, that He created us only upon the affirmation of His Lordship. The subsequent appearance of polytheism in some people does not change that affirmation, for they remain upon their primordial nature (فطرتهم). The polytheist returns to this nature on the Day of Resurrection when the partners disavow them. If the changing is not attributed to them, it is good news for them regarding the mercy they will receive. Even if they dwell in the Fire, it is by virtue of the Fire being a dwelling place, not a place of torment and pain. Rather, Allah will make them of a temperament that allows them to enjoy themselves in the Fire, such that if they entered Paradise with that temperament, they would suffer due to the lack of conformity between their temperament and the moderation of Paradise.\n\nWhoever has the Word of Allah fixed upon him concerning a matter works in vain and hopes in vain.\n\nThe Messenger of Allah, peace and blessings be upon him, spoke of one who performs the deeds of the people of Paradise until he is near it by his deed, *as appears to people*, but the Book (Precedence) overtakes him, and he is sealed with the deeds of the people of the Fire, so he enters the Fire. And likewise the other. Then he said: \"Indeed, deeds are judged by their conclusions (الخواتم).\"\n\nIn this Hadith, he mentioned to whom the Precedence belongs, and that the Conclusion is the very ruling of the Precedence. This is why some of them used to say: \"You fear the Conclusion, but I fear the Precedence.\" It is called Precedence because it precedes the Conclusion.\n\nThis is an existing meaning whose ruling did not appear until later, supporting those who speak of latency (*kumūn*) and manifestation (*zuhūr*). Especially since the Lawgiver drew attention to it in the Hadith by saying concerning the deeds of the people of the Fire (the deeds of the fortunate): \"as appears to people,\" and likewise concerning the deeds of the people of Paradise (the deeds of the wretched): \"as appears to people.\" What is within them, in their inner realities, is contrary to what appears to people. Allah knew this about them. The hypocrites (*murā'ūn*) fall into this category.\n\nHowever, there is good news in what he is aiming at: The scholars have known that the ruling belongs to the Precedent, for the subsequent is delayed. The Precedent wins the prize of the race (*qasab al-sabq*). The prize here is Adam and his progeny. Allah's Wrath and His Mercy raced in this contest. His Mercy preceded His Wrath, thus encompassing us. Then Wrath followed, finding us already encompassed by the Mercy of Precedence. Therefore, the ruling of eternal punishment (*ta'bīd*) did not take effect in us for Wrath. It only touched us partially, due to the fact that we were gathered in one assembly, affecting us according to our preparedness for that. When Mercy separated from Wrath in that assembly, Mercy took us by its encompassing Precedence, and Allah's Wrath departed from us. Thus, its ruling over us—meaning the children of Adam—is not eternal. Regarding other creatures, like the devils, I do not know what His ruling is concerning them, and Allah knows best.\n\nThe possessor of this spiritual taste (*dhawq*) does not fear the Precedence, for Allah's Mercy is not feared except in the Abode of Obligation (the world). The awe of Precedence relates only to a specific precedence, not the precedence of Mercy. That precedence (of wretchedness) is accidental (*'araḍī*) and not permanent, because it has no root to support it, for its root is Allah's Wrath, which is subsequent, not precedent. As for the precedence of felicity (*sa'ādah*), it is not accidental and does not vanish, because it has a root that supports and strengthens it: Allah's Mercy, which preceded His Wrath. Therefore, this partial, accidental precedence of felicity remains, while the precedence of wretchedness does not remain. Know this. <<وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو چونتیس: رہبہ (خوفِ الٰہی) کے بیان میں\n\nرہبہ (الرہبہ) سبقت (سبق) اور پلٹنے (تقلیب) کے خوف کا نام ہے،\nاور سچے خبر دینے والے کی سچائی سے وعید (الوعید) کا خوف ہے۔\nدلیل نے اس پر مضاف ہونے سے رہنمائی کی،\nپس راہب (الراہب) وہ خائف ہے جو تیزی سے آگے بڑھنے والا (السابق) ہے۔\nوہ گہری تاریک رات میں چلتا ہے،\nجیسے شک کرنے والے کا چلنا اور جیسے والہانہ عاشق کا چلنا۔\nوہ اپنی ہمت کے ساتھ خوف کی وجہ سے رات کو سفر کرتا ہے، پس تو اسے دیکھتا ہے،\nوہ اپنے سفر میں اچانک آنے والے (الطارق) کے حملے سے ڈرتا ہے۔\n\n### [رہبہ (الرہبہ) تین وجوہ پر ہے]\n\nقوم کے نزدیک رہبہ (الرہبہ) تین وجوہ کے مقابلے میں بولی جاتی ہے: وعید (الوعید) کے متحقق ہونے کا خوف، علم (العلم) کے پلٹنے (تقلیب) کا خوف، اور امرِ سبقت (السبق) کے متحقق ہونے کا خوف۔ پہلی صورت یہ ہے کہ جب وعید خبر کے ذریعے آئے اور خبر میں نسخ (منسوخ ہونا) داخل نہ ہو، پس وہ ثابت ہے۔ دوسری صورت علم (العلم) کا پلٹنا ہے، جیسا کہ ذات حق (الحق) فرماتا ہے: يَمْحُوا الله ما يَشاءُ ويُثْبِتُ (اللہ جسے چاہتا ہے مٹا دیتا ہے اور جسے چاہتا ہے ثابت رکھتا ہے)۔ اور تیسری صورت وہ ہے: ما يُبَدَّلُ الْقَوْلُ لَدَيَّ (میرے ہاں بات بدلی نہیں جاتی)۔\n\nرہبہ مطلقہ (الرہبہ المطلقہ)، جو کسی معین امر کی قید کے بغیر ہو، وہ ہر وہ خوف ہے جو بندے کو اس احتیاط کے ساتھ لاحق ہو کہ وہ ان حدود پر قائم نہ رہ سکے جو اس کے لیے مشروع کی گئی ہیں، خواہ وہ حکمِ مشروعِ الٰہی ہو یا حکمِ حکمی، جیسا کہ ذات حق (الحق) نے فرمایا: ورَهْبانِيَّةً ابْتَدَعُوها (اور رہبانیت جو انہوں نے خود ایجاد کی)۔ یعنی انہوں نے اسے اپنے لیے مشروع کیا، ہم نے اسے ابتداءً ان پر واجب نہیں کیا تھا۔ پس ذات حق (الحق) نے اس کا اعتبار کیا اور اس کی عدم رعایت پر ان سے مواخذہ کیا، کیونکہ اللہ نے اسے ان پر إِلَّا ابْتِغاءَ رِضْوانِ الله (مگر صرف اللہ کی رضا حاصل کرنے کے لیے) فرض نہیں کیا تھا۔ پس اس نے ان لوگوں کی تعریف کی جو اس کی رعایت کرتے ہیں تاکہ اس میں نیک ارادہ اور نیت ہو۔ اور کلام میں تقدیم و تاخیر ہے، گویا وہ فرما رہا ہے کہ انہوں نے اس کی رعایت کا حق ادا نہیں کیا مگر اللہ کی رضا حاصل کرنے کے لیے، یعنی اس کی رعایت کرنے والوں نے۔\n\nاور ہمارے شرع میں اس رہبانیت میں سے یہ ہے کہ جس نے کوئی اچھا طریقہ (سنتِ حسنہ) جاری کیا، اور یہ عین ابتداع (بدعت) ہے۔ اور جب عمر بن خطاب رضی اللہ عنہ نے لوگوں کو رمضان کے قیام کے لیے ابی بن کعب رضی اللہ عنہ پر جمع کیا تو فرمایا: \"یہ کتنی اچھی بدعت ہے\"۔ پس انہوں نے اسے بدعت کہا اور سنت آج تک اسی پر جاری ہے۔\n\nپس جب مشروع اعمال کے ساتھ ان کے حق کو قائم کرنے کا وجوب منسلک ہو گیا، جیسے نذر، تو مکلف کو خوف لاحق ہوا، اور اس میں رہبہ (الرہبہ) قائم ہو گئی، جس نے اسے حدود کی رعایت کی طرف لے جایا۔ پس اسے راہب کہا گیا اور شریعت کو رہبانیت کہلائی۔ اور اللہ نے اپنی کتاب میں راہبوں کی تعریف کی ہے۔ پس لوگوں میں سے بعض نے اپنی رہبہ (الرہبہ) کو وعید (الوعید) سے منسلک کیا، اور اس کے نفاذ سے ڈرے، جیسے معتزلی جو اس شخص کے حق میں وعید کے نفاذ کا قائل ہے جو بغیر توبہ کے مر گیا۔\n\n### [بے شک مومن گناہ کے ارتکاب پر نادم ہوتا ہے]\n\nپس جان لو کہ یہاں ایک نکتہ ہے جس پر میں تمہیں متنبہ کرتا ہوں، اور وہ یہ ہے کہ یہ محال ہے کہ کوئی مومن ایسا گناہ کرے جس پر اللہ نے وعید (الوعید) سنائی ہو اور وہ اس سے خوفزدہ ہو، مگر یہ کہ وہ اپنے نفس میں اس پر ندامت پائے جو اس سے سرزد ہوا۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"الندم توبة\" (ندامت توبہ ہے)۔\n\nاور جب اس میں ندامت قائم ہو گئی تو وہ توبہ کرنے والا ہے، پس ندامت کے حاصل ہونے کی وجہ سے وعید (الوعید) کا حکم ساقط ہو گیا۔ کیونکہ مومن کے لیے ضروری ہے کہ وہ مخالفت کو ناپسند کرے اور اس پر راضی نہ ہو، خواہ وہ اسے کر رہا ہو۔ پس وہ اس لحاظ سے کہ وہ اسے ناپسند کرتا ہے، اس بات پر ایمان رکھنے والا ہے کہ یہ گناہ ہے، اور وہ نیک عمل والا ہے۔ اور اس لحاظ سے کہ وہ اسے کرنے والا ہے، وہ برا عمل والا ہے۔ پس اس کی انتہا یہ ہے کہ وہ ان لوگوں میں سے ہو جنہوں نے خَلَطُوا عَمَلًا صالِحاً وآخَرَ سَيِّئاً (نیک عمل اور برا عمل ملا دیا)۔ پس ذات حق (الحق) نے اس قول کے بعد فرمایا: عَسَى الله أَنْ يَتُوبَ عَلَيْهِمْ (عنقریب اللہ ان کی توبہ قبول کرے گا)۔ اور اللہ کی طرف سے \"عسیٰ\" (عنقریب) واجب ہوتی ہے۔ اور ان کی طرف اس کا رجوع مغفرت کے ذریعے ہی ہوتا ہے۔ اور وہ انہیں اس پر ندامت عطا کرتا ہے، اور ندامت توبہ ہے۔ پس جب وہ نادم ہوئے تو ان پر اللہ کی توبہ حاصل ہو گئی۔\n\nپس وہ تین وجوہ سے نیک عمل والا ہے: اس بات پر ایمان رکھنا کہ یہ گناہ ہے، اس کے وقوع کو ناپسند کرنا، اور اس پر نادم ہونا۔ اور وہ ایک وجہ سے برا عمل والا ہے، اور وہ اس کا ارتکاب کرنا ہے۔ اس ندامت کے باوجود، رہبہ (الرہبہ) اس پر حکم کرتی ہے، خواہ وہ اس بات کو جانتا ہو جو ہم نے کہی یا نہ جانتا ہو۔ کیونکہ وہ اپنے سے کسی اور ناپسندیدہ چیز کے وقوع کا خوف رکھتا ہے، اور اگر وہ اس توبہ پر مر بھی جائے تو رہبہ (الرہبہ) اس سے جدا نہیں ہوتی۔ اور اس کا تعلق وعید (الوعید) کے نفاذ سے منتقل ہو کر سوال کے وقت الٰہی عتاب اور تقرر (باز پرس) کی طرف ہو جاتا ہے جو اس سے سرزد ہوا۔ پس وہ ہمیشہ اس کا احساس کرتا رہتا ہے، اور یہ وعید (الوعید) کی اقسام میں سے ایک قسم ہے۔ کیونکہ اللہ فرماتا ہے: فَمَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ خَيْراً يَرَهُ (پس جس نے ذرہ برابر نیکی کی وہ اسے دیکھے گا) ومن يَعْمَلْ مِثْقالَ ذَرَّةٍ شَرًّا يَرَهُ (اور جس نے ذرہ برابر برائی کی وہ اسے دیکھے گا)۔ پس اس پر ضرور ٹھہرایا جائے گا۔ پس وہ اس توبیخ سے ڈرتا ہے جو اس قبیح عمل کو دیکھنے سے ہوگی جسے دیکھنا اس کے لیے ضروری ہے۔ اور ذات حق (الحق) نے اس آیت میں اس پر مواخذہ کرنے کا ذکر نہیں کیا۔ پس دیکھنا ضروری ہے۔ اگر وہ ان لوگوں میں سے ہے جنہیں بخش دیا گیا، تو وہ اپنی بڑی جنایت اور مغفرت کے ذریعے اللہ کی عظیم نعمت کو دیکھے گا۔\n\nیہ اسے الٰہی خبر کی سچائی عطا کرتا ہے جس میں جھوٹ داخل نہیں ہو سکتا، کیونکہ یہ جنابِ الٰہی پر محال ہے۔ پس اگر عالم اس بات پر غور کرے کہ ذات حق (الحق) کا اپنے بندوں سے خطاب صرف اس کے مطابق ہوتا ہے جس پر وہ متفق ہوئے، اور یہ تمام عربوں سے عربی خطاب ہے، اس زبان میں جس پر وہ ان امور کے بارے میں متفق ہوئے جن سے وہ اپنے عرف میں تعریف کرتے ہیں، اور ان امور کے بارے میں جن سے وہ اپنے عرف میں مذمت کرتے ہیں۔ پس عربوں کے نزدیک مکارمِ اخلاق (مکارم الأخلاق) میں سے ہے کہ کریم جب وعدہ کرے تو پورا کرے، اور جب وعید (الوعید) کرے تو درگزر کرے اور معاف کر دے۔ اور یہ ان کے مکارمِ اخلاق میں سے ہے اور جس سے وہ کریم کی تعریف کرتے ہیں۔ اور وعید (الوعید) ان پر اس چیز کے مطابق نازل ہوئی جو ان کے عرف میں ہے، اس میں اس چیز کا ذکر نہیں کیا گیا جو عقلی دلائل بعض خبروں کے عدمِ نسخ اور جھوٹ کے محال ہونے سے دیتے ہیں۔ بلکہ مقصود مکارمِ اخلاق کا لانا ہے۔\n\nان کے شاعر نے کہا:\n> وإني إذا أوعدته أو وعدته *** لمخلف إيعادى ومنجز موعدي‏\n*ترجمہ:* اور بے شک میں جب اسے وعید (ایعاد) دوں یا وعدہ کروں، تو میں اپنی وعید کی خلاف ورزی کرنے والا اور اپنے وعدے کو پورا کرنے والا ہوں۔\n\nاس نے اپنے آپ کی تعریف اس شخص کو معاف کرنے اور درگزر کرنے سے کی جس نے اس پر زیادتی کی، اس سزا کی وعید کے باوجود جو اس نے اس پر سنائی تھی، اور اپنے آپ کی تعریف اس خیر کے وعدے کو پورا کرنے سے کی جو اس نے کیا تھا۔ زبان میں کہا جاتا ہے: \"وعدتہ فی الخیر والشر\" (میں نے اس سے خیر اور شر کا وعدہ کیا)، اور \"أوعدتہ\" (ہمزہ کے ساتھ) صرف شر کے لیے استعمال نہیں ہوتا۔ اور اللہ فرماتا ہے: وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ (اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان میں)۔ یعنی جس پر وہ متفق ہوئے تھے۔ اور عربوں کے نزدیک درگزر اور معافی ان چیزوں میں سے ہے جس پر وہ اس شخص کی تعریف کرنے پر متفق ہوئے جس سے یہ ظاہر ہو۔ پس اللہ اس صفت کا زیادہ حقدار ہے۔\n\nپس اللہ نے ہمیں بتا دیا ہے کہ وہ اپنی وعید (الوعید) کو اس پر نافذ کرتا ہے جسے وہ چاہے اور جسے چاہے بخش دیتا ہے۔ ان وجوہ کے باوجود، بندے کے دل سے وعید (الوعید) کے نفاذ کا خوف زائل نہیں ہو سکتا، کیونکہ وہ نہیں جانتا کہ آیا وہ ان لوگوں میں سے ہے جن سے مواخذہ کیا جائے گا یا جنہیں معاف کر دیا جائے گا۔ اور ہم پہلے بیان کر چکے ہیں کہ مخالفت کرنے والا مخالفت کے بعد اپنے سے سرزد ہونے والی چیز پر ندامت پاتا ہے، اور یہی عین توبہ ہے۔ پس تمام تعریفیں اللہ کے لیے ہیں جس نے ندامت کو توبہ بنایا، اور اپنی ذات کو التواب الرحیم (بہت توبہ قبول کرنے والا، نہایت رحم والا) سے موصوف فرمایا۔ یعنی وہ جو ہر مخالفت میں اپنے بندوں پر رحمت کے ساتھ رجوع کرتا ہے، پس اسے اس پر ندامت عطا کرتا ہے، اور بندہ اللہ کی توبہ کے ذریعے توبہ کرتا ہے، اس کے قول کی وجہ سے: ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا إِنَّ الله هُوَ التَّوَّابُ الرَّحِيمُ (پھر اس نے ان پر رجوع کیا تاکہ وہ توبہ کریں، بے شک اللہ ہی بہت توبہ قبول کرنے والا، نہایت رحم والا ہے)۔\n\nاور دوسری رہبہ (الرہبہ)، جو علم (العلم) کے پلٹنے (تقلیب) کے متحقق ہونے کے لیے ہے، تو وہ اس بات سے ڈرتا ہے کہ اسے اللہ کے علم کا علم نہیں کہ آیا وہ ان لوگوں میں سے ہے جنہیں بدل دیا جائے گا یا نہیں۔ ذات حق (الحق) نے فرمایا: وإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْماً غَيْرَكُمْ ثُمَّ لا يَكُونُوا أَمْثالَكُمْ (اور اگر تم منہ پھیرو گے تو وہ تمہاری جگہ دوسری قوم کو لے آئے گا، پھر وہ تمہاری طرح نہیں ہوں گے)۔ پس اس نے سبب بیان کیا، جو منہ پھیرنا ہے، اور اس نے علامت بیان کی، جو ذکر سے منہ نہ پھیرنا ہے نہ کہ اللہ سے، کیونکہ اللہ سے منہ پھیرنا صحیح نہیں ہے۔ اسی لیے اس نے اپنے نبی سے فرمایا: فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا (پس اس سے منہ پھیر لو جس نے ہمارے ذکر سے منہ پھیرا)۔ وہ اس سے کیسے منہ پھیر سکتا ہے جو گھات میں ہے اور سب کچھ اس کی گرفت میں اور اس کی نظر میں ہے۔\n\nاور جب اس کا مشاہدہ معلوم کے پلٹنے سے علم (العلم) کا پلٹنا ہے، کیونکہ علم اس سے متعلق ہوتا ہے جیسا کہ وہ ہے۔ پس تعلق کی تبدیلی متعلق کی تبدیلی کی وجہ سے ہے نہ کہ علم کی تبدیلی کی وجہ سے۔ پس اس کی رہبہ (الرہبہ) علم (العلم) کے پلٹنے سے عین اس چیز کی رہبہ ہے جو اس سے سرزد ہوتی ہے۔ کیونکہ علم کا حقیقت میں پلٹنے میں کوئی حکم نہیں ہے۔ بلکہ پلٹنا تو فعل کے عین کو وجود دینے والے کے لیے ہے جو دل میں رہبہ (الرہبہ) پیدا کرتا ہے، اور وہ اس کا قادر ہونا ہے۔ اور علم اس انقلاب اور اس چیز سے متعلق ہوتا ہے جس کی طرف پلٹا جاتا ہے۔ ذات حق (الحق) نے فرمایا: ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ (اور ہم تمہیں ضرور آزمائیں گے تاکہ ہم جان لیں)۔ یعنی جب تم سے آزمائش کے وقت، جو تکلیف کے ساتھ ہے، مخالفت یا اطاعت ظاہر ہو، تو اس وقت میرا علم اس سے متعلق ہو جائے گا، جو کچھ بھی ہوا ہو۔\n\nاور علم (العلم) کے پلٹنے (تقلیب) کی حضوری اس کے قول میں ہے: يَمْحُوا الله ما يَشاءُ ويُثْبِتُ (اللہ جسے چاہتا ہے مٹا دیتا ہے اور جسے چاہتا ہے ثابت رکھتا ہے)۔ پس اس نے لکھنے کے بعد مٹانے کا ذکر کیا، اور وہ اس چیز کو ثابت رکھتا ہے جسے وہ چاہے جو اس نے لکھا ہے۔ اور عِنْدَهُ أُمُّ الْكِتابِ (اور اس کے پاس ام الکتاب ہے)، اور وہ سابقہ (السبق) ہے جو نہ بدلتی ہے اور نہ مٹتی ہے۔ پس جب اللہ عزوجل نے جان لیا کہ وہ اس میں سے کیا مٹائے گا اور کیا ثابت رکھے گا، تو پلٹنا علم (العلم) کی طرف منسوب کیا گیا، اور تحقیق وہی ہے جو ہم نے ذکر کی کہ تعلق کی تبدیلی ہے نہ کہ علم میں پلٹنا۔\n\nاور ذات حق (الحق) کا یہ قول: عَلِمَ الله أَنَّكُمْ كُنْتُمْ تَخْتانُونَ أَنْفُسَكُمْ (اللہ نے جان لیا کہ تم اپنی جانوں سے خیانت کرتے تھے)۔ یہاں اس کا ارادہ اپنے علم کے تعلق سے نہیں ہے کہ وہ اپنی جانوں سے خیانت کرتے تھے، بلکہ یہاں مستقبل ماضی کے معنی میں ہے، کیونکہ عربی زبان میں مستقبل ماضی کی بناوٹ کے ساتھ آتا ہے جب وہ متحقق ہو، جیسا کہ اس کا قول: أَتى‏ أَمْرُ الله فَلا تَسْتَعْجِلُوهُ (اللہ کا حکم آ گیا، پس تم جلدی نہ کرو) اور اس سے مشابہ۔ اور ذات حق (الحق) نے اس تعریف سے پہلے انہیں مکلف کیا تھا کہ روزہ دار اپنی بیوی سے روزے کی رات مباشرت نہ کرے۔ پس ان میں سے بعض نے اس میں اللہ کی حد کو پار کیا۔ پس جب اللہ نے یہ جان لیا تو اس نے اس شخص کو معاف کر دیا جس سے یہ سرزد ہوا، اور اس کے لیے روزے کی رات میں جماع حلال کر دیا، مگر یہ کہ وہ مسجد میں اعتکاف میں ہو۔ پس اس نے ان پر تخفیف نہیں کی یہاں تک کہ ان سے یہ سرزد ہو گیا۔ اور جس کی شان میں ایسا واقعہ ہو، وہ ہمیشہ اس سے مشابہ کی توقع رکھتا ہے۔ پس اس پر رحمت کرتے ہوئے اسے مباح کر دیا گیا، تاکہ جب اس سے یہ سرزد ہو تو وہ اس کے لیے حلال اور مباح ہو، اور اس سے خیانت کی صفت زائل ہو جائے، کیونکہ دین مکلف کے پاس امانت ہے۔\n\nاور رہبہ (الرہبہ) امرِ سبقت (السبق) کے متحقق ہونے کے لیے ہے، اس کے قول کی وجہ سے: ما يُبَدَّلُ الْقَوْلُ لَدَيَّ (میرے ہاں بات بدلی نہیں جاتی) اور اس کا قول: لا تَبْدِيلَ لِكَلِماتِ الله (اللہ کی باتوں میں کوئی تبدیلی نہیں)۔ اگرچہ اس آیت میں یہ جائز ہے کہ اللہ کے کلمات سے مراد موجودات ہوں، جیسا کہ اس نے عیسیٰ علیہ السلام کے بارے میں فرمایا کہ وہ كَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ (اس کا کلمہ ہے جسے اس نے مریم کی طرف ڈالا)۔ پس اس نے موجودات کے لیے تبدیلی کی نفی کی، بلکہ تبدیلی اللہ کے لیے ہے۔ خاص طور پر جب آیت کا ظاہر اس تاویل پر دلالت کرتا ہے، اور وہ اس کا قول ہے: فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفاً فِطْرَتَ الله الَّتِي فَطَرَ النَّاسَ عَلَيْها لا تَبْدِيلَ لِكَلِماتِ الله (پس اپنا رخ دین کے لیے یکسو ہو کر قائم کر، اللہ کی فطرت جس پر اس نے لوگوں کو پیدا کیا، اللہ کے کلمات میں کوئی تبدیلی نہیں)۔ یعنی ان کے لیے اس میں کوئی تبدیلی نہیں ہے۔ اور یہ اللہ کی طرف سے بشارت ہے کہ اللہ نے ہمیں صرف اپنی ربوبیت کے اقرار پر ہی پیدا کیا ہے۔ پس یہ اقرار اس شرک سے نہیں بدلتا جو بعد میں بعض لوگوں میں ظاہر ہوا، کیونکہ اللہ نے ان سے اس میں تبدیلی کی نفی کی ہے۔ بلکہ وہ اپنی فطرت پر ہیں۔\n\nاور مشرک قیامت کے دن اسی فطرت کی طرف لوٹے گا جب شریک ان سے براءت کریں گے۔ اور جب تبدیلی ان کی طرف منسوب نہیں کی گئی، تو یہ ان کے حق میں رحمت کی بشارت ہے، اگرچہ وہ جہنم میں داخل ہوں، تو اس وجہ سے کہ وہ دار (گھر) ہے نہ کہ دارِ عذاب اور تکالیف۔ بلکہ اللہ انہیں ایسے مزاج پر رکھے گا جس سے وہ جہنم میں نعمت پائیں گے، یہاں تک کہ اگر وہ اس مزاج کے ساتھ جنت میں داخل ہوں تو وہ تکلیف محسوس کریں گے، کیونکہ ان کا مزاج جنت کے اعتدال کے موافق نہیں ہوگا۔ پس جس پر اللہ کا کلمہ کسی امر کے ساتھ حق ہو گیا، تو وہ غیرِ عمل کی جگہ میں عمل کرتا ہے اور غیرِ طمع کی جگہ میں طمع کرتا ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے اس شخص کے بارے میں فرمایا جو اہل جنت کے عمل کرتا ہے یہاں تک کہ لوگوں کے سامنے اپنے عمل سے اس کے قریب ہو جاتا ہے، پس اس پر کتاب سبقت لے جاتی ہے، تو اس کا خاتمہ اہل جہنم کے عمل پر ہوتا ہے، پس وہ جہنم میں داخل ہوتا ہے۔ اور اسی طرح دوسرا۔ پھر فرمایا: \"وإنما الأعمال بالخواتم\" (اور اعمال کا دار و مدار خاتمے پر ہے)۔\n\nپس اس حدیث میں اس شخص کا ذکر کیا گیا جس کے لیے سبقت (السابقہ) ہے، اور یہ کہ خاتمہ (الخاتمہ) عین حکمِ سبقت (السابقہ) ہے۔ اسی لیے بعض کہتے تھے کہ تم خاتمے سے ڈرتے ہو اور میں سبقت (السابقہ) سے ڈرتا ہوں۔ اور اسے سبقت (السابقہ) اس لیے کہا گیا کہ یہ خاتمے سے مقدم ہے۔ پس یہ ایک موجود معنی ہے جس کا حکم ایک زمانے کے بعد ہی ظاہر ہوا۔ پس یہ ان چیزوں میں سے ہے جس پر کمون (پوشیدگی) اور ظہور کے قائلین استناد کر سکتے ہیں۔ خاص طور پر جب شارع نے حدیث میں اس پر تنبیہ کی ہے، اہل جہنم کے عمل میں اہل سعادت کے اعمال کے بارے میں اپنے قول سے: \"فِيما يَبْدُو لِلنَّاسِ\" (جو لوگوں کو ظاہر ہوتا ہے)۔ اور اسی طرح اہل جنت کے عمل میں اہل شقاوت کے اعمال کے بارے میں: \"فِيما يَبْدُو لِلنَّاسِ\" (جو لوگوں کو ظاہر ہوتا ہے)۔ اور جو ان کے پاس ان کے باطن میں ہے وہ اس کے خلاف ہے جو لوگوں کو ظاہر ہوتا ہے۔ پس اللہ نے ان سے یہ جان لیا۔ پس یہ اس معنی کا بیان ہے جس کا حکم ظاہر میں موجود ہونے کے باوجود ظاہر نہیں ہوا۔ اور ریاکار لوگ اسی قبیل سے ہیں۔\n\nمگر یہاں ایک بشارت ہے جس کی طرف وہ جاتے ہیں، اور وہ یہ ہے کہ علماء نے جان لیا ہے کہ حکم سابق کے لیے ہے، کیونکہ لاحق اس سے مؤخر ہے۔ اسی لیے سابق قصبِ سبقت (سبقت کا انعام) حاصل کرتا ہے۔ اور یہاں قصبِ سبقت آدم اور اس کی ذریت ہے۔ اور اللہ کا غضب اور اس کی رحمت اس دوڑ میں مقابلہ کر رہے تھے، پس اس کی رحمت اس کے غضب پر سبقت لے گئی، پس اس نے ہمیں حاصل کر لیا۔ پھر غضب پیچھے سے آیا، تو اس نے ہمیں رحمت کی گرفت میں پایا جس نے ہمیں سبقت کے ذریعے حاصل کر لیا تھا۔ پس غضب کا حکم ہم میں دائمی طور پر نافذ نہیں ہوا، بلکہ اس نے ہم سے کچھ تعلق رکھا مشاہدے کے لیے، کیونکہ ہم ایک ہی مجلس میں جمع ہوئے، جس نے ہم میں ہماری استعداد کے مطابق اثر کیا۔ پس جب رحمت اس مجلس سے غضب سے جدا ہوئی، تو رحمت نے ہمیں اپنے حاصل کرنے کے ذریعے لے لیا، اور اللہ کا غضب ہم سے جدا ہو گیا۔ پس اس کا حکم ہم میں، یعنی بنی آدم میں، دائمی نہیں ہے۔ اور مخلوقات میں سے دوسروں میں، جیسے شیاطین، میں نہیں جانتا کہ ان میں اس کا کیا حکم ہے۔ واللہ اعلم۔\n\nاور اس ذوق کا مالک سبقت (السابقہ) سے نہیں ڈرتا، کیونکہ اللہ کی رحمت سے صرف دارِ تکلیف میں ہی خوف کیا جاتا ہے۔ پس سبقت (السبق) کی رہبہ (الرہبہ) کا تعلق ایک مخصوص سبقت سے ہے نہ کہ رحمت کی سبقت سے۔ اور وہ سبقت عرضی ہے، دائمی نہیں، اگر وہ شقاوت کی سبقت ہو، کیونکہ اس کی کوئی اصل نہیں جو اس کی تائید کرے۔ کیونکہ اس کی اصل اللہ کا غضب ہے، اور وہ لاحق ہے نہ کہ سابق۔ اور سعادت کی سبقت عرضی نہیں ہے کہ زائل ہو جائے، کیونکہ اس کی ایک اصل ہے جو اس کی تائید اور تقویت کرتی ہے، اور وہ اللہ کی رحمت ہے جو اس کے غضب پر سبقت لے گئی۔ اسی لیے یہ جزوی، عرضی سعادت کی سبقت باقی رہتی ہے اور شقاوت کی باقی نہیں رہتی۔ پس یہ جان لو۔\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "## باب دویست و سی و چهارم در رهبت (Al-Rahba)\n\nرهبت، ترس از سبقت (Sabq) و دگرگونی (Taqlīb) است، *** و از وعید (Wa'īd) به دلیل صدق خبردهنده راستگو.\nدلیل، بر آن از طریق همراهی دلالت کرد، *** پس راهب، همان ترسان شتابنده پیشتاز است.\nدر تاریکی کور و فراگیر، سیر می‌کند، *** سیر شخص شکاک و سیر عاشق واله.\nبا همت خود از ترس شب‌روی می‌کند، پس او را می‌بینی *** که در سیرش از ناگهانی بودن کوبنده (حادثه) می‌ترسد.\n\n### [رهبت بر سه وجه است]\n\nرهبت (Al-Rahba) نزد این قوم (صوفیه) در برابر سه وجه به کار می‌رود: رهبت از تحقق وعید (Wa'īd)، رهبت از دگرگونی علم (Taqlīb al-'Ilm)، و رهبت از تحقق امر سبقت (Sabq).\n\nاولی (وعید) زمانی است که وعید از طریق خبر بیاید و خبر را نسخ در آن راه ندارد، پس ثابت است. دومی (تقلیب علم) دگرگونی علم است، چنانکه [خداوند می‌فرماید]: \"يَمْحُوا الله ما يَشاءُ ويُثْبِتُ\" (خداوند آنچه را بخواهد محو می‌کند و آنچه را بخواهد ثابت می‌دارد). سومی (سبقت) آن است که [خداوند می‌فرماید]: \"ما يُبَدَّلُ الْقَوْلُ لَدَيَّ\" (سخن نزد من دگرگون نمی‌شود).\n\nاما رهبت مطلق، بدون قید به امر معینی، هر ترسی است که بنده را بر آن می‌دارد تا از حدود آنچه برایش تشریع شده است، تخطی نکند؛ خواه حکم شرعی الهی باشد یا حکم حکمی، چنانکه خداوند متعال فرمود: \"ورَهْبانِيَّةً ابْتَدَعُوها\" (و رهبانیتی که خود ابداع کردند). یعنی خودشان آن را برای خویش تشریع کردند، ما آن را از ابتدا بر آنان واجب نساختیم. پس حق (Al-Ḥaqq) آن را معتبر شمرد و آنان را به دلیل عدم رعایت آن مؤاخذه کرد. خداوند آن را بر آنان ننوشت مگر \"إِلَّا ابْتِغاءَ رِضْوانِ الله\" (مگر برای طلب خشنودی خدا). پس بر رعایت‌کنندگان آن ثنا گفت تا قصد و نیت در آن نیکو باشد.\n\nدر این کلام تقدیم و تأخیر وجود دارد، گویی می‌گوید: پس آن را چنان که حق رعایتش بود، رعایت نکردند مگر برای طلب خشنودی خدا؛ یعنی رعایت‌کنندگان آن. در شریعت ما نیز از این رهبانیت وجود دارد، مانند کسی که سنت حسنه‌ای را بنیان نهد، و این عین ابداع (بدعت) است. هنگامی که عمر بن خطاب مردم را بر ابیّ (بن کعب) برای نماز شب‌های رمضان جمع کرد، گفت: «چه بدعت خوبی است این.» پس آن را بدعت نامید و سنت بر آن تا امروز جاری شد.\n\nهنگامی که وجوب قیام به حق اعمال مشروع، مانند نذر، با آن اعمال همراه شد، مکلف ترسید و رهبت (Al-Rahba) در او پدید آمد و او را به رعایت حدود (Al-Ḥudūd) سوق داد. پس او راهب نامیده شد و شریعت، رهبانیت نامیده شد. و خداوند راهبان را در کتابش ستوده است. برخی از مردم رهبت خود را به وعید (Wa'īd) گره زدند و از نفوذ آن ترسیدند، مانند معتزلی که قائل به اجرای وعید در حق کسی است که بدون توبه بمیرد.\n\n### [مؤمن از ارتکاب گناه پشیمان می‌شود]\n\nبدان که در اینجا نکته‌ای است که تو را بدان آگاه می‌سازم، و آن این است که محال است مؤمنی مرتکب گناهی شود که خداوند بر آن وعید داده است و از آن بترسد، مگر اینکه در نفس خود ندامت (Al-Nadam) بر آنچه از او سر زده است، بیابد. و پیامبر (صلی الله علیه و سلم) فرمود: \"الندم توبة\" (پشیمانی، توبه است).\n\nو چون ندامت در او پدید آمده، پس او توبه‌کار است. بنابراین، حکم وعید به دلیل حاصل شدن ندامت ساقط می‌شود. زیرا مؤمن ناگزیر است که مخالفت را ناخوش بدارد و به آن راضی نباشد، حتی در حال انجام آن. پس او از جهت ناخوش داشتن آن، مؤمن به معصیت بودن آن است و صاحب عمل صالح است؛ و از جهت انجام دادن آن، صاحب عمل بد است. پس نهایت امر این است که او از کسانی باشد که \"خَلَطُوا عَمَلًا صالِحاً وآخَرَ سَيِّئاً\" (عملی صالح و دیگری بد را درآمیختند). خداوند متعال به دنبال این سخن فرمود: \"عَسَى الله أَنْ يَتُوبَ عَلَيْهِمْ\" (امید است که خداوند توبه آنان را بپذیرد). و \"عسی\" (امید است) از جانب خداوند واجب است. و بازگشت او بر آنان تنها با مغفرت است. و ندامت بر آن را روزی‌شان می‌کند و ندامت توبه است. پس هنگامی که پشیمان شدند، توبه خداوند بر آنان حاصل شده است.\n\nپس او از سه جهت صاحب عمل صالح است: ایمان به معصیت بودن آن، ناخوش داشتن وقوع آن از جانب خود، و ندامت بر آن. و از یک جهت صاحب عمل بد است: و آن ارتکاب آن است. با وجود این ندامت، رهبت (Al-Rahba) بر او حکم می‌راند، خواه به آنچه گفتیم عالم باشد یا نباشد. زیرا او از وقوع مکروه دیگری از جانب خود می‌ترسد. و حتی اگر بر آن توبه بمیرد، رهبت از او جدا نمی‌شود و تعلق آن از نفوذ وعید به عتاب الهی و بازخواست هنگام سؤال درباره آنچه از او سر زده است، منتقل می‌شود. پس پیوسته آن را احساس می‌کند، و این نوعی از انواع وعید است.\n\nزیرا خداوند می‌فرماید: \"فَمَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ خَيْراً يَرَهُ\" (پس هر کس به اندازه ذره‌ای کار نیک کند، آن را می‌بیند) و \"ومن يَعْمَلْ مِثْقالَ ذَرَّةٍ شَرًّا يَرَهُ\" (و هر کس به اندازه ذره‌ای کار بد کند، آن را می‌بیند). پس ناگزیر است که بر آن متوقف شود. او از این توبیخ می‌ترسد، به واسطه دیدن آن عمل زشت که ناگزیر از دیدن آن است. و حق (Al-Ḥaqq) در این آیه متعرض مؤاخذه به آن نشده است. پس دیدن (رؤیت) ناگزیر است. اگر از کسانی باشد که آمرزیده شده‌اند، بزرگی آنچه مرتکب شده و بزرگی نعمت خداوند بر خود به واسطه مغفرت را می‌بیند.\n\nاین، خبر الهی صادقی را به او می‌دهد که کذب در آن راه ندارد، زیرا کذب بر ساحت الهی محال است. اگر عالم بنگرد که خطاب حق (Al-Ḥaqq) به بندگانش تنها بر اساس آنچه بر آن توافق کرده‌اند، می‌باشد، این خطاب عربی برای همه اعراب است به زبانی که بر آن اصطلاح کرده‌اند، از اموری که در عرف خود بدان ستایش می‌شوند و اموری که در عرف خود بدان نکوهیده می‌شوند. نزد عرب از مکارم اخلاق است که کریم اگر وعده دهد، وفا کند و اگر وعید دهد، درگذرد و عفو کند. و این از مکارم اخلاق آنان است و چیزی است که کریم را بدان می‌ستایند. و وعید بر آنان نازل شد به آنچه در عرفشان است، و در آن متعرض چیزی نشد که ادله عقلی از عدم نسخ برخی اخبار و محال بودن کذب اقتضا می‌کند، بلکه مقصود، آوردن مکارم اخلاق است. شاعرشان می‌گوید:\n\n> وإني إذا أوعدته أو وعدته *** لمخلف إيعادى ومنجز موعدي‏\n**ترجمه:** و من اگر او را وعید دهم یا وعده دهم، *** در وعیدم خلف می‌کنم و وعده‌ام را وفا می‌کنم.\n\nاو خود را به عفو و گذشت از کسی که بر او جنایت کرده و او را به عقوبت وعید داده بود، ستوده است، و خود را به انجام دادن آنچه وعده خیر داده بود، ستوده است. در زبان عربی گفته می‌شود: \"وعدته\" (به او وعده دادم) در خیر و شر، و \"أوعدته\" (به او وعید دادم) با همزه، تنها در شر به کار می‌رود. و خداوند می‌فرماید: \"وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ\" (و هیچ پیامبری را نفرستادیم مگر به زبان قومش). یعنی به آنچه بر آن توافق کرده‌اند. و گذشت و عفو نزد عرب از اموری است که بر ستایش کسی که از او سر بزند، توافق کرده‌اند. پس خداوند به این صفت سزاوارتر است.\n\nخداوند به ما شناسانده است که وعید خود را در حق هر که بخواهد اجرا می‌کند و هر که را بخواهد می‌آمرزد. با وجود این وجوه، زوال رهبت (Al-Rahba) از قلب بنده از نفوذ وعید ممکن نیست، زیرا نمی‌داند آیا از کسانی است که مؤاخذه می‌شود یا از کسانی که عفو می‌شود. و پیشتر بیان کردیم که شخص متخلف بلافاصله پس از مخالفت، ندامت بر آنچه از او سر زده است، می‌یابد، و این عین توبه است. پس سپاس خدایی را که ندامت را توبه قرار داد و خود را به \"التواب الرحیم\" (بسیار توبه‌پذیر و مهربان) وصف کرد؛ یعنی کسی که در هر مخالفت با رحمت (Al-Raḥma) بر بندگانش باز می‌گردد و ندامت بر آن را روزی‌شان می‌کند، پس بنده با توبه خداوند بر او، توبه می‌کند، به دلیل قول او: \"ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا إِنَّ الله هُوَ التَّوَّابُ الرَّحِيمُ\" (سپس توبه آنان را پذیرفت تا توبه کنند؛ همانا خداوند بسیار توبه‌پذیر و مهربان است).\n\nو اما رهبت دوم که برای تحقق دگرگونی علم (Taqlīb al-'Ilm) است، پس از عدم علم خود به علم خداوند درباره خویش می‌ترسد که آیا از کسانی است که جایگزین می‌شوند یا نه. خداوند متعال می‌فرماید: \"وإِنْ تَتَوَلَّوْا يَسْتَبْدِلْ قَوْماً غَيْرَكُمْ ثُمَّ لا يَكُونُوا أَمْثالَكُمْ\" (و اگر روی بگردانید، قومی غیر از شما را جایگزین می‌کند، سپس آنان مانند شما نخواهند بود).\n\nپس سبب را که روی گرداندن است، بیان کرد و نشانه را که عدم روی گرداندن از ذکر است، نه از خداوند. زیرا روی گرداندن از خداوند صحیح نیست. به همین دلیل به پیامبرش فرمود: \"فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا\" (پس از کسی که از ذکر ما روی گردانده، اعراض کن). چگونه از کسی روی گرداند که در کمین است و همه در قبضه و تحت نظر اویند؟\n\nو چون مشهد او دگرگونی علم (Taqlīb al-'Ilm) به واسطه دگرگونی معلوم است، زیرا علم بر اساس آنچه معلوم بر آن است، به آن تعلق می‌گیرد. پس تغییر تعلق به دلیل تغییر متعلق است، نه به دلیل تغییر علم. پس رهبت او از دگرگونی علم، عین رهبت او از چیزی است که از او سر می‌زند. زیرا علم در حقیقت حکمی در دگرگونی ندارد، بلکه دگرگونی برای ایجادکننده عین فعل است که رهبت را در قلب می‌اندازد، و آن این است که او قادر است و علم به آن انقلاب و منقلب‌الیه تعلق می‌گیرد. خداوند متعال می‌فرماید: \"ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ\" (و قطعاً شما را می‌آزماییم تا بدانیم). یعنی هنگامی که در هنگام ابتلا به تکلیف، آنچه از مخالفت یا طاعت از شما سر می‌زند، ظاهر شود، علم من در آن هنگام به آن تعلق می‌گیرد، هر چه که باشد.\n\nو مقام دگرگونی علم، قول اوست: \"يَمْحُوا الله ما يَشاءُ ويُثْبِتُ\" (خداوند آنچه را بخواهد محو می‌کند و آنچه را بخواهد ثابت می‌دارد). پس محو را پس از نوشتن ذکر کرد و آنچه را بخواهد از آنچه نوشته است، ثابت می‌دارد. و \"وَعِنْدَهُ أُمُّ الْكِتابِ\" (و ام‌الکتاب نزد اوست)، که همان سابقه (Sabq) است که دگرگون نمی‌شود و محو نمی‌گردد. چون خداوند عز و جل می‌دانست که چه چیزی را پس از نوشتن محو می‌کند و چه چیزی را ثابت می‌دارد، دگرگونی به علم نسبت داده شد. و حقیقت همان است که ذکر کردیم: تغییر تعلق و عدم دگرگونی در علم.\n\nو اما قول خداوند متعال: \"عَلِمَ الله أَنَّكُمْ كُنْتُمْ تَخْتانُونَ أَنْفُسَكُمْ\" (خداوند دانست که شما به خود خیانت می‌کردید)، در اینجا منظور تعلق علم او به این نیست که آنان به خود خیانت می‌کنند، بلکه فعل مستقبل (تختانون) در اینجا به معنای ماضی است. زیرا در زبان عربی، فعل مستقبل با صیغه ماضی می‌آید، هنگامی که تحقق یافته باشد، مانند قول خداوند متعال: \"أَتى‏ أَمْرُ الله فَلا تَسْتَعْجِلُوهُ\" (امر خدا آمد، پس در آن شتاب نکنید) و مانند آن. حق (Al-Ḥaqq) پیش از این تعریف، آنان را مکلف کرده بود که روزه‌دار در شب روزه‌اش با همسر خود مباشرت نکند. پس برخی از آنان از حد خداوند در این باره تجاوز کردند. هنگامی که خداوند این را دانست، از کسانی که این کار از آنان سر زد، عفو کرد و آمیزش در شب روزه را برایشان حلال کرد، مگر اینکه در مسجد معتکف باشند. پس تخفیف نداد مگر پس از آنکه این کار از آنان سر زد. و کسی که شأنش چنین واقعه‌ای باشد، پیوسته انتظار می‌رود که مانند آن از او سر بزند. پس از روی رحمت به او، حلال شد تا اگر آن کار از او سر زد، برایش حلال و مباح باشد و صفت خیانت از او زائل شود، زیرا دین نزد مکلف امانت است.\n\nو اما رهبت (Al-Rahba) برای تحقق امر سبقت (Sabq)، به دلیل قول خداوند متعال است: \"ما يُبَدَّلُ الْقَوْلُ لَدَيَّ\" (سخن نزد من دگرگون نمی‌شود) و قول او: \"لا تَبْدِيلَ لِكَلِماتِ الله\" (دگرگونی در کلمات خدا نیست). اگرچه در این آیه جایز است که کلمات خدا عبارت از موجودات باشد، چنانکه درباره عیسی (علیه السلام) فرمود که او \"كَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ\" (کلمه اوست که آن را به مریم القا کرد). پس نفی کرد که موجودات دگرگونی داشته باشند، بلکه دگرگونی برای خداست. به ویژه که ظاهر آیه بر این تأویل دلالت دارد، و آن قول اوست: \"فَأَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفاً فِطْرَتَ الله الَّتِي فَطَرَ النَّاسَ عَلَيْها لا تَبْدِيلَ لِكَلِماتِ الله\" (پس روی خود را به سوی دین حنیف بگردان، فطرت خداوندی که مردم را بر آن آفریده است؛ دگرگونی در کلمات خدا نیست). یعنی آنان در این باره دگرگونی ندارند. و این بشارتی از جانب خداوند است که ما را جز بر اقرار به ربوبیتش نیافریده است. پس آن اقرار به واسطه شرکی که پس از آن در برخی مردم ظاهر شد، دگرگون نمی‌شود، زیرا خداوند از آنان نفی کرده است که در آن دگرگونی داشته باشند، بلکه آنان بر فطرت خود هستند.\n\nو مشرک در روز قیامت هنگام بیزاری شرکا از آنان، به سوی همان فطرت باز می‌گردد. و اگر دگرگونی به آنان نسبت داده نشود، این بشارتی در حق آنان است به آنچه از رحمت (Al-Raḥma) برایشان است. و اگر در آتش ساکن شوند، به حکم اینکه آنجا دار (خانه) است، نه به حکم اینکه دار عذاب و آلام است. بلکه خداوند آنان را بر مزاجی قرار می‌دهد که در آتش بدان متنعم می‌شوند، به طوری که اگر با آن مزاج وارد بهشت شوند، به دلیل عدم موافقت مزاجشان با اعتدال بهشت، متألم می‌شوند. پس کسی که کلمه خداوند به امری بر او محقق شده باشد، در غیر محل عمل می‌کند و در غیر محل طمع می‌ورزد.\n\nپیامبر خدا (صلی الله علیه و سلم) درباره کسی که به عمل اهل بهشت عمل می‌کند تا آنجا که در ظاهر مردم به آن نزدیک می‌شود، فرمود: \"در این هنگام کتاب بر او سبقت می‌گیرد، پس به عمل اهل آتش برایش ختم می‌شود و وارد آتش می‌گردد. و همچنین دیگری.\" سپس فرمود: \"همانا اعمال به خواتیم (پایان‌ها) است.\"\n\nپس در این حدیث بیان کرد که سبقت (Sabq) برای کیست و خاتمه (Khatima) عین حکم سبقت است. به همین دلیل برخی می‌گفتند: شما از خاتمه می‌ترسید و من از سابقه (سبقت) می‌ترسم. و سابقه از آن جهت سابقه نامیده شد که بر خاتمه مقدم است. پس این معنایی موجود است که حکم آن جز پس از زمانی ظاهر نشده است. و این از جمله چیزهایی است که قائل به کمون و ظهور می‌تواند بدان استناد کند. به ویژه که شارع در حدیث به آن توجه داده است، آنجا که در عمل اهل آتش، اعمال سعادتمندان را ذکر کرد و فرمود: \"آنچه برای مردم ظاهر می‌شود.\" و همچنین در عمل اهل بهشت، اعمال شقاوتمندان را ذکر کرد: \"آنچه برای مردم ظاهر می‌شود.\" و آنچه نزد آنان است و در بواطنشان خلاف آنچه برای مردم ظاهر می‌شود، می‌باشد. پس خداوند این را از آنان می‌دانست. این معنای چیزی است که حکم آن در ظاهر با وجودش نزد آنان، ظاهر نشده است. و ریاکاران از این قبیل هستند.\n\nغیر از این، در آنچه او بدان می‌رود، بشارتی وجود دارد، و آن این است که علما دانسته‌اند که حکم از آنِ سابق است، زیرا لاحق از آن متأخر است. به همین دلیل سابق، قصب سبقت (نشان پیروزی) را به دست می‌آورد. و قصب سبقت در اینجا آدم و ذریه اوست. غضب (Al-Ghaḍab) و رحمت (Al-Raḥma) خداوند در این میدان مسابقه به رقابت پرداختند، پس رحمت او بر غضبش سبقت گرفت و ما را در بر گرفت. سپس غضب رسید و ما را در قبضه رحمت یافت که به واسطه سبقت ما را در بر گرفته بود. پس حکم تأبید (جاودانگی) برای غضب در حق ما اجرا نشد، بلکه برای مشاهده، به اندازه‌ای که از ما استعداد برای آن وجود داشت، در ما تأثیر گذاشت، زیرا در یک مجلس جمع شدیم. هنگامی که رحمت از غضب از آن مجلس جدا شد، رحمت ما را به واسطه در بر گرفتن ما، گرفت و غضب خداوند از ما جدا شد. پس حکم او در حق ما، یعنی بنی آدم، مؤبد نیست. و در حق دیگر مخلوقات، مانند شیاطین، نمی‌دانم حکم او در آنان چیست. و خدا داناتر است.\n\nو صاحب این ذوق از سابقه (Sabq) نمی‌ترسد، زیرا از رحمت خداوند جز در دار تکلیف ترسی نیست. پس رهبت سبقت (Al-Rahba al-Sabq) تنها متعلق به سبقت مخصوص است، نه سبقت رحمت. و آن سبقت، عرضی است و دائمی نیست، اگر سبقت شقاوت باشد، زیرا اصلی ندارد که آن را تأیید کند، چرا که اصل آن غضب خداوند است و غضب لاحق است نه سابق. اما سبقت سعادت، عرضی نیست که زائل شود، زیرا اصلی دارد که آن را تأیید و تقویت می‌کند، و آن رحمت خداوند است که بر غضبش سبقت گرفته است. به همین دلیل، این سبقت جزئی عرضی سعادتی باقی می‌ماند و سبقت شقاوت باقی نمی‌ماند. پس این را بدان. و \"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}