{
  "id": 475,
  "title": {
    "ar": "الباب الخامس والسبعون وأربعمائة في معرفة حال قطب كان منزله ومن يُعَظِّمْ شَعائِرَ الله",
    "en": "Chapter Four Hundred and Seventy-Five: Concerning the Gnosis (معرفة) of the State (حال) of a Pole (قطب) whose Station (منزله) is [defined by the verse]: \"And whoever venerates the Symbols of Allah (شعائر الله).\"",
    "ur": "باب چار سو پچھتر: اس قطب (قطب) کے حال کی معرفت (معرفۃ) کے بیان میں جس کا روحانی مقام (منزل) یہ تھا: \"اور جو کوئی اللہ کی شعائر (شعائر اللہ) کی تعظیم کرتا ہے۔\"",
    "fa": "باب چهارصد و هفتاد و پنجم در معرفت حال قطبی که منزلگاهش «و هر کس شعائر خدا را بزرگ بدارد» بود."
  },
  "content": {
    "ar": "## «الباب الخامس والسبعون وأربعمائة في معرفة حال قطب كان منزله ومن يُعَظِّمْ شَعائِرَ الله»\n\n\n> شعائر الله أعلام لنا نصبت *** لنعلم الفرق بين الحق والخلق‏\n\n\n> وهي الحدود التي قامت برازخها *** وقاية للذي يقول بالفرق‏\n\n\n> فمن يعظمها كانت وقايته *** وهو الذي يتقي الأشياء بالحق‏\n\n\n> الله دون الخلق له من منزلة *** يوم الوفود تسمى مقعد الصدق‏\n\n\n> يحوزها بالذي حاز السباق لها *** لما جرى معهم في حلبة السبق‏\n\n\n> يفنى ويبقى الذي يدعوه متصفا *** أسماؤه عندنا بالمفني والمبقي‏\n\n\n### [قلب المؤمن وسع عظمة الله‏]\n\n\nقال الله تعالى في تعظيمها لا بل فيها فَإِنَّها من تَقْوَى الْقُلُوبِ لَكُمْ فِيها يعني الشعائر مَنافِعُ إِلى‏ أَجَلٍ مُسَمًّى ثُمَّ مَحِلُّها إِلَى الْبَيْتِ الْعَتِيقِ وهو بيت الايمان عند أهل الإشارات وليس إلا قلب المؤمن الذي وسع عظمة الله وجلاله شعائر الله أعلامه وأعلامه الدلائل عليه الموصلة إليه ويا عجبا كيف يصل إليه وهو عنده كما قال أبو يزيد وقد سمع قارئا يقرأ يوم نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً فصاح وبكى حتى طار الدم من عينيه وضرب المنبر وقال كيف يحشر إليه من هو جليسه فصدق الله في الكمال فإن المتقي ما يتقي الرحمن وصدق أبو يزيد فإنه ما كان مشهوده في الحال إلا الرحمن والولي لا يتعدى ذوقه ولا ينطق بغير حاله ويرد كل شي‏ء يسمع إلى الحال الذي يغلب عليه وكان حال أبي يزيد في ذلك الوقت هو الذي نطق به فالمرء مخبوء تحت لسانه فإن اللسان ترجمان أحوال الناطق‏\n\n\n### [البدن من شعائر الله‏]\n\n\nثم اعلم أن البدن جعلها الله من شعائره ولهذا تشعر ليعلم أنها من شعائر الله وما وهب لله لا رجعة فيه أ لا تراها إذا ماتت قبل الوصول إلى البيت كيف ينحرها صاحبها ويخلي بينها وبين الناس ولا يأكل منها شيئا فهذا من منة الله حيث جعلك مثلا وميزك عنه وجعل لك ملكا وطلب منك أن تقرضه والنعمة بالأصالة نعمته وهذه كلها من شعائر الله فإن كل شعيرة منها دليل على الله من حيث أمر ما خاص أراده الله وأبانه لأهل الفهم من عباده فيتفاضلون في ذلك على قدر فهمهم فإذا رأيت ما يقال فيه إنه من شعائر الله وتجهل أنت صورته في الشعائر ولا تعلم ما تدل عليه هذه الشعيرة فاعلم إن تلك الشعيرة ما خاطبك الحق بها ولا وضعها لك وإنما وضعها لمن يفهمها عنه ولك أنت شعيرة أيضا غيرها وهي كل ما تعرف أنها دلالة لك عليه كما قال أبو العتاهية\n\n\n> وفي كل شي‏ء له آية *** تدل على أنه واحد\n\n\nفقف عندها وقُلْ رَبِّ زِدْنِي عِلْماً فيقوي فهمك فيما أنزله ويعلمك ما لَمْ تَكُنْ تَعْلَمُ فإذا أمكنك الحق من نفسك علمت أنك من أقوى الشعائر عليه وأوضحها ولهذا\n\n\nجاءت الشريعة بقولها من عرف نفسه عرف ربه‏\n\n\nفإذا وصلت إلى ما أوصلتك إليه شعائر نفسك وشاهدت المشعور رأيته على صورتك فمن هناك تعلم أنك الأصل في علمه بك وأنه ما تجلى لك إلا في صورة علمه بك ولا كان عالما بك إلا منك وأنت بذاتك أعطيته لعلم بك فأنت الشعيرة له عليك فإن‏\nرأيته على غير صورتك فما رأيته من كونك شعيرة له فلا تنكره إذا رأيت ما لا تعرف حين ينكره غيرك فإن تلك الحضرة لا مجلى لأحد فيها إلا لله فإذا كان هذا ارجع في نظرك منه إليك فترى نفسك في تلك الصورة التي رأيته عليها وما أنت انصبغت بها منه وإنما هي أيضا صورتك في ثبوتك وما كان وصل وقت دخولك فيها وظهورك بها فإن الصور تتقلب عليك إلى ما لا نهاية له وتتقلب فيها أنت وتظهر بها إلى ما لا نهاية فيه ولكن حالا بعد حال انتقالا لا يزول وقد علمك تعالى في هذه الصور على عدم تناهيها فتجلى لك في صورة لم يبلغ وقت ظهورك بها لأنك مقيد وهو غير مقيد بل قيده إطلاقه وإنما يفعل هذا مع عباده ليظهر لهم في حال النكرة ولهذا ينكرونه إلا العارفون بهذا المقام فإنهم لا ينكرونه في أي صورة ظهر فإنهم قد حفظوا الأصل وهو أنه ما يتجلى لمخلوق إلا في صورة المخلوق أما التي هو عليها في الحال فيعرفه أو ما يكون عليها بعد ذلك فينكره حتى يرى تلك الصورة قد دخل فيها فحينئذ يعرفه فإن الله علمه وعلم ما يؤول إليه والمخلوق لا يعلم من أحواله إلا ما هو عليه في الوقت ولذلك يقول رَبِّ زِدْنِي عِلْماً ومن عباد الله من يعلم ذلك إذا رأى الحق في صورة لا يعرفها علم بحكم الموطن وما عنده من القبول أنه ما تجلى له إلا في صورة هي له وما وصل وقتها فعلمها قبل إن يدخل فيها فهذا من الزيادة في العلم التي زادها الله فشكر الله الذي عرفه في موطن الإنكار ولذلك عظم الله هذا الفضل فقال وعَلَّمَكَ ما لَمْ تَكُنْ تَعْلَمُ وكانَ فَضْلُ الله عَلَيْكَ عَظِيماً فكان الحق في هذا الموطن من شعائر نفسك فعرفت نفسك به كما عرفته بنفسك فتأمل‏\n\n\n> فاجتمعنا في الشعائر *** وافترقنا في السرائر\n\n\n> فلنا منه التجلي *** وله منا الضمائر\n\n\n> فلمثل ذا عبيد *** هائم فيه يبادر\n\n\n> فإذا علمت هذا لم تكن *** عنه بصادر\n\n\n> فهو الصادر عنكم *** مثل أوراق الدفاتر\n\n\n> بعضها يستر بعضا *** بأوائل وأواخر\n\n\n> فليبادر من يبادر *** وليفاخر من يفاخر\n\n\nفما عظم الله شعائره سدى لأنه ما عظم إلا من يقبل التعظيم وأما العظيم فلا يعظم فإن الموجود لا يوجد والله عظيم والعالم كله لا مكانه حقير إلا أنه يقبل التعظيم ولم يكن له طريق في التعظيم إلا أن يكون من شعائر الله عليه فلما كان في نفس الأمر شعيرة عليه عرفنا الحق بذلك فنظرنا فرأينا حقيقة قوله فاستدللنا بنا عليه وبه إذا ظهر في النكرة علينا\n\n\n> فمنه إلى دليل علي *** ومني إليه دليل عليه‏\n\n\n> فنحن لديه كما قاله *** بأعماله ثم نحن لديه‏\n\n\n> وأعماله عين أعياننا *** فبدئي منه وعودي إليه‏\n\n\nولو لم يكن الأمر هكذا ما صدق اتخاذك إياه وكيلا والمال ماله فالمال مالك والإشارة أن الصورة صورتك فصدق لن تراني إذ قال له موسى رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ فقال لَنْ تَرانِي وأداة لن تنفي الأفعال المستقبلة والإشارة إن من جهلك في الحال جهلك في المال لأنك إذا ظهرت له في المال ما تظهر له بصورة الحال التي جهلك فيها عند طلبه رؤيتك وإنما تظهر له بصورة حال ذلك المال فلا يزال منكرا ما يرى حتى يعرف الموطن وحكمه فيعلم ما يرى وما هو الحكم عليه فإن الله لم يزل ظاهر الذي عينين وأعين وأما ذو العين الواحدة فهو دجال أعور لم يزل في ربقة التقييد مغلولا فمن فتح الله عينيه التي امتن الله بهما عليه في قوله عز وجل أَ لَمْ نَجْعَلْ لَهُ عَيْنَيْنِ ليشهدني في الحالين في الحال الراهنة والحال المستقبلة فمن لم يرني في الحال وهو ناظر إلي فإنه أبعد أن يراني في حال المال وهو يراني ولكن لا يعرف أني مطلوبه وسبب ذلك أنه يطلبني بالعلامة وهل هذا إلا عين الجهل بي‏\n\n\n> وهل ثم غيري أو يكون وليسنى *** فيا خيبة الأبصار عند البصائر\n\n\n> فإياك والأفكار إن كنت طالبا *** فإن محل الابتلاء سرائري‏\n\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Seventy-Five concerning the Gnosis of the State of a Pole (قطب) whose Station was \"and whosoever magnifies the sacred rites of Allah\"\n\nThe sacred rites of Allah are banners erected for us,\nSo that we may know the difference between The Real (الحق) and Creation (الخلق).\n\nThey are the boundaries whose Isthmuses (البرزخ) have been established,\nA protection for him who affirms the distinction.\n\nSo whoever magnifies them, they become his protection,\nAnd he is the one who guards against things by The Real.\n\nAllah, apart from Creation, has a station for him,\nOn the Day of Arrival, called the Seat of Truth (مقعد الصدق).\n\nHe attains it by that which won the race for it,\nWhen he ran with them in the arena of the race.\n\nHe is annihilated (الفناء) and subsists (البقاء), the one who calls upon Him, being characterized,\nBy His Names, which we hold to be The Annihilator and The Sustainer.\n\n### [The Heart of the Believer Encompassed the Magnificence of Allah]\n\nAllah the Exalted said, in magnifying them—nay, rather, concerning them—<<فَإِنَّها من تَقْوَى الْقُلُوبِ لَكُمْ فِيها>> (Indeed, they are among the piety of the hearts. For you therein) meaning, in the sacred rites, <<مَنافِعُ إِلى‏ أَجَلٍ مُسَمًّى ثُمَّ مَحِلُّها إِلَى الْبَيْتِ الْعَتِيقِ>> (are benefits for an appointed term, then their place of sacrifice is the Ancient House). This is the House of Faith (بيت الايمان) according to the People of Allusions (أهل الإشارات), and it is none other than the heart of the believer which encompassed the magnificence and majesty of Allah. The sacred rites (شعائر الله) of Allah are His signs (أعلامه), and His signs are the proofs (الدلائل) leading to Him.\n\nAnd how wondrous it is how one reaches Him when He is already with him! As Abu Yazid said when he heard a reciter reading, <<يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً>> (The Day We will gather the righteous to the Most Merciful as a delegation). He cried out and wept until blood flew from his eyes, struck the pulpit, and said, \"How can he be gathered *to* Him when he is already His intimate companion?\"\n\nAllah spoke the truth in perfection, for the righteous (المتقي) does not guard against the All-Merciful (الرحمن). And Abu Yazid spoke the truth, for his witnessing (مشهوده) in that state (الحال) was none other than the All-Merciful. The saint (الولي) does not exceed his spiritual taste (ذوقه) nor speak except according to his state. He refers everything he hears back to the state that dominates him. The state of Abu Yazid at that time was what he spoke. For a person is hidden beneath his tongue, as the tongue is the interpreter (ترجمان) of the speaker's states.\n\n### [The Body is among the Sacred Rites of Allah]\n\nKnow then that the body (البدن) is made by Allah to be among His sacred rites (شعائره). For this reason, it is made to be felt (تشعر) so that it may be known that it is among the sacred rites of Allah. What is dedicated to Allah is irrevocable. Do you not see that if the sacrificial animal dies before reaching the House, its owner slaughters it and leaves it for the people, eating nothing from it? This is a favor (منة) from Allah, where He made you an example and distinguished you from it, granting you ownership and asking you to lend to Him. The favor (النعمة) is fundamentally His favor.\n\nAll of these are among the sacred rites of Allah, for every sacred rite is a proof (دليل) of Allah, based on a specific command that Allah willed and made clear to those of His servants who possess understanding. They excel in this according to the measure of their understanding.\n\nIf you see something said to be a sacred rite of Allah, yet you are ignorant of its form within the rites and do not know what this rite signifies, then know that The Real (الحق) has not addressed you through that rite, nor established it for you. Rather, He established it for those who understand it from Him. You, too, have another sacred rite, which is everything you recognize as a sign leading you to Him, just as Abu al-Atahiyya said:\n\n> And in everything there is a sign for Him,\n> Which indicates that He is One.\n\nSo stop there and say, <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge). Then your understanding of what He has revealed will be strengthened, and He will teach you what you did not know (ما لَمْ تَكُنْ تَعْلَمُ). If The Real enables you to know yourself, you will know that you are among the strongest and clearest sacred rites pointing to Him. For this reason, the Sacred Law (الشريعة) came with the saying: \"Whoever knows himself knows his Lord.\"\n\nWhen you reach what the sacred rites of your self have led you to, and you witness the object of perception (المشعور), you will see Him upon your own form. From there, you know that you are the origin (الأصل) in His knowledge of you, and that He only manifests (تجلى) to you in the form of His knowledge of you. He was not knowing of you except through you, and you, by your Essence (الذات), gave Him the knowledge of you. Thus, you are the sacred rite for Him concerning you.\n\nIf you see Him in a form other than your own, you have not seen Him from the perspective of your being a sacred rite for Him. Therefore, do not deny it when you see what you do not recognize, even if others deny it, for that Presence (الحضرة) has no manifestation (مجلى) for anyone therein except for Allah.\n\nIf this is the case, return your gaze from Him back to yourself, and you will see yourself in that form upon which you saw Him. You were not colored by it from Him; rather, it is also your form in your fixed entity (ثبوتك), and the time for your entry into it and your manifestation by it had not yet arrived. For the forms revolve upon you endlessly, and you revolve within them and manifest by them endlessly, but state after state, a transition that does not cease.\n\nThe Exalted has taught you concerning these forms, despite their endlessness, by manifesting to you in a form whose time of manifestation for you has not yet arrived, because you are restricted (مقيد) while He is unrestricted (غير مقيد); rather, His absolute nature (إطلاقه) restricts Him. He only does this with His servants to appear to them in a state of unfamiliarity (النكرة). For this reason, they deny Him, except for those Gnostics (العارفون) of this station, who do not deny Him in whatever form He appears.\n\nThey have preserved the origin (الأصل), which is that He only manifests to a creature in the creature's form. Either the form he is currently upon, in which case he recognizes Him, or a form he will be upon later, in which case he denies Him until he sees that he has entered into that form. Then he recognizes Him. For Allah knows him and knows what he will become (ما يؤول إليه), while the creature only knows of his states what he is upon at the moment. That is why he says, <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge).\n\nAmong the servants of Allah are those who, when they see The Real in an unfamiliar form, know by the ruling of the station and the acceptance they possess that He only manifested to them in a form that belongs to them, but whose time has not yet arrived. So they know it before they enter into it. This is part of the increase in knowledge (الزيادة في العلم) that Allah granted. So praise be to Allah who made him recognize Him in the place of denial. For this reason, Allah magnified this favor, saying, <<وَعَلَّمَكَ ما لَمْ تَكُنْ تَعْلَمُ وَكانَ فَضْلُ الله عَلَيْكَ عَظِيماً>> (And He taught you what you did not know, and the favor of Allah upon you was great). Thus, The Real in this station was among the sacred rites of your self, and you knew yourself through Him just as you knew Him through yourself. Reflect upon this.\n\nSo we gathered in the sacred rites,\nBut we separated in the inner secrets (السرائر).\n\nFor us is the Theophany (التجلي) from Him,\nAnd for Him are the innermost thoughts (الضمائر) from us.\n\nFor such a thing, servants\nAre passionately devoted (هائم) to Him, hastening.\n\nIf you know this, you will not be\nDeparting from Him.\n\nFor He is the one issuing forth from you,\nLike the pages of notebooks.\n\nSome of them conceal others,\nBy firsts and lasts.\n\nSo let him who hastens, hasten,\nAnd let him who boasts, boast.\n\nAllah did not magnify His sacred rites in vain, because He only magnifies that which accepts magnification. As for the Magnificent (العظيم), He is not magnified, for the Existent (الموجود) is not brought into existence. Allah is Magnificent, and the entire cosmos (العالم) is nothing but a humble place (مكان حقير), yet it accepts magnification. It had no path to magnification except by being among the sacred rites of Allah concerning Him. Since it was, in reality (في نفس الأمر), a sacred rite concerning Him, The Real informed us of this. We looked and saw the reality of His saying, so we inferred Him through ourselves, and through Him when He appeared to us in unfamiliarity.\n\nFrom Him to me is a proof concerning me,\nAnd from me to Him is a proof concerning Him.\n\nWe are with Him, as He said,\nBy His Acts (أعماله), and then we are with Him.\n\nAnd His Acts are the very essences of our fixed entities (أعياننا),\nSo my beginning is from Him, and my return is to Him.\n\nIf the matter were not thus, your taking Him as a Trustee (وكيلا) would not be true. The wealth is His wealth, so the wealth is yours. The allusion (الإشارة) is that the form is your form. Therefore, believe the statement \"You shall not see Me\" (لَنْ تَرَانِي) when Moses said to Him, <<رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ>> (My Lord, show me, that I may look upon You). He said, <<لَنْ تَرَانِي>> (You shall not see Me). The particle *lan* (لن) negates future actions. The allusion is that whoever is ignorant of you in the present state (الحال) is ignorant of you in the final outcome (المال). For when you appear to him in the final outcome, you will not appear to him in the form of the present state in which he was ignorant of you when he sought your vision. Rather, you will appear to him in the form of the state of that final outcome. He will continue to deny what he sees until he recognizes the station and its ruling, and thus knows what he sees and what the ruling upon it is.\n\nFor Allah has always been manifest to the possessor of two eyes and many eyes. As for the possessor of one eye, he is a one-eyed Dajjal (دجال أعور), perpetually bound in the fetters of restriction (التقييد). Whoever Allah opens his two eyes, which He favored him with in His saying, <<أَ لَمْ نَجْعَلْ لَهُ عَيْنَيْنِ>> (Have We not made for him two eyes?), is so that he may witness Me in both states: the present state and the future state. Whoever does not see Me in the present state while looking at Me is even further from seeing Me in the future state, even though he sees Me, but he does not recognize that I am his object of desire. The reason for this is that he seeks Me by a sign (العلامة), and is this not the very essence of ignorance concerning Me?\n\nIs there anything other than Me, or can it exist while I am not?\nO the disappointment of the outer eyes (الأبصار) before the inner visions (البصائر)!\n\nBeware of thoughts (الأفكار) if you are a seeker,\nFor the place of trial is My inner secrets (سرائري).\n\nAnd Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو پچھتر: اس قطب (القطب) کے حال کی معرفت میں جس کا مقام یہ تھا کہ \"جو شخص شعائر اللہ (شعائر اللہ) کی تعظیم کرتا ہے\"\n\nشعائر اللہ (شعائر اللہ) ہمارے لیے وہ نشانیاں ہیں جو نصب کی گئیں،\nتاکہ ہم حق (الحق) اور خلق (الخلق) کے درمیان فرق جان سکیں۔\nاور وہ وہ حدود ہیں جن کے برزخ قائم ہوئے،\nاس شخص کے لیے ڈھال بن کر جو فرق کا قائل ہے۔\nپس جو ان کی تعظیم کرتا ہے، وہ اس کی ڈھال بن جاتی ہے،\nاور وہ وہی ہے جو اشیاء سے حق (الحق) کے ذریعے پرہیز کرتا ہے۔\nاللہ کے لیے خلق (الخلق) کے علاوہ ایک منزلت (منزلۃ) ہے،\nجسے یومِ وفود (حاضری کے دن) \"مقعد الصدق\" (سچائی کی جگہ) کہا جاتا ہے۔\nوہ اسے اس چیز سے حاصل کرتا ہے جس نے اس کے لیے سبقت حاصل کی،\nجب وہ ان کے ساتھ سبقت کی دوڑ میں شامل ہوا۔\nوہ فنا (الفناء) ہو جاتا ہے اور وہ باقی رہتا ہے جو اسے پکارتا ہے،\nجس کے اسماء ہمارے نزدیک \"فنا کرنے والا\" اور \"باقی رکھنے والا\" ہیں۔\n\n### [مومن کا دل اللہ کی عظمت کو سمو لیتا ہے]\n\nاللہ تعالیٰ نے ان کی تعظیم میں فرمایا، بلکہ ان کے بارے میں فرمایا: (فَإِنَّها من تَقْوَى الْقُلُوبِ) \"پس بے شک یہ دلوں کے تقویٰ (التقویٰ) میں سے ہے\"۔ (لَكُمْ فِيها) \"تمہارے لیے ان میں\" یعنی شعائر (شعائر اللہ) میں (مَنافِعُ إِلى‏ أَجَلٍ مُسَمًّى ثُمَّ مَحِلُّها إِلَى الْبَيْتِ الْعَتِيقِ) \"ایک مقررہ مدت تک فائدے ہیں، پھر ان کا ٹھکانہ بیت عتیق (البيت العتيق) کی طرف ہے\"۔ اور یہ اشارات والوں کے نزدیک ایمان کا گھر ہے، اور یہ کچھ نہیں مگر مومن کا دل ہے جس نے اللہ کی عظمت اور جلال کو سمو لیا ہے۔ شعائر اللہ (شعائر اللہ) اس کی نشانیاں ہیں، اور اس کی نشانیاں وہ دلائل ہیں جو اس تک پہنچاتے ہیں۔ اور تعجب ہے کہ وہ اس تک کیسے پہنچتا ہے جبکہ وہ اس کے پاس ہی ہے، جیسا کہ ابو یزید (بسطامی) نے کہا جب انہوں نے ایک قاری کو یہ آیت پڑھتے سنا: (يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً) \"جس دن ہم پرہیزگاروں کو رحمن کی طرف مہمان بنا کر جمع کریں گے\"۔ تو وہ چیخ اٹھے اور روئے یہاں تک کہ ان کی آنکھوں سے خون بہہ نکلا، اور انہوں نے منبر پر ضرب لگائی اور کہا: \"اس کی طرف کیسے جمع کیا جائے گا جو اس کا ہم نشین ہے؟\" پس اللہ نے کمال میں سچ فرمایا، کیونکہ متقی رحمن سے پرہیز نہیں کرتا۔ اور ابو یزید نے سچ کہا، کیونکہ اس وقت ان کا مشہود (الشہود) رحمن کے سوا کوئی نہ تھا۔ اور ولی اپنے ذوق سے تجاوز نہیں کرتا اور اپنی حالت کے سوا کچھ نہیں بولتا، اور وہ ہر سنی ہوئی چیز کو اس حالت کی طرف لوٹاتا ہے جو اس پر غالب ہوتی ہے۔ اور اس وقت ابو یزید کی حالت وہی تھی جس کے ساتھ انہوں نے کلام کیا، کیونکہ انسان اپنی زبان کے نیچے چھپا ہوا ہے، اور زبان بولنے والے کے احوال کی ترجمان ہوتی ہے۔\n\n### [بدن شعائر اللہ (شعائر اللہ) میں سے ہے]\n\nپھر جان لو کہ اللہ نے بدن کو اپنے شعائر (شعائر اللہ) میں سے بنایا ہے، اور اسی لیے یہ شعور رکھتا ہے تاکہ معلوم ہو کہ یہ شعائر اللہ (شعائر اللہ) میں سے ہے۔ اور جو چیز اللہ کے لیے وقف کر دی جائے اس میں رجوع نہیں ہوتا۔ کیا تم نہیں دیکھتے کہ جب وہ (قربانی کا جانور) بیت (اللہ) تک پہنچنے سے پہلے مر جاتا ہے تو اس کا مالک اسے کیسے ذبح کرتا ہے اور اسے لوگوں کے لیے چھوڑ دیتا ہے اور خود اس میں سے کچھ نہیں کھاتا؟ یہ اللہ کا احسان ہے کہ اس نے تمہیں مثال بنایا اور تمہیں اس سے ممتاز کیا، اور تمہارے لیے ملکیت بنائی اور تم سے قرض مانگا، حالانکہ نعمت دراصل اسی کی نعمت ہے۔ اور یہ سب شعائر اللہ (شعائر اللہ) میں سے ہیں، کیونکہ ان میں سے ہر شعیرہ (شعيرة) اللہ پر ایک دلیل ہے، اس خاص امر کے لحاظ سے جو اللہ نے چاہا اور اپنے سمجھدار بندوں کے لیے واضح کیا۔ پس وہ اس میں اپنی سمجھ کے مطابق ایک دوسرے سے افضل ہوتے ہیں۔ لہٰذا جب تم کوئی ایسی چیز دیکھو جسے شعائر اللہ (شعائر اللہ) کہا جاتا ہے اور تم شعائر (شعائر) میں اس کی صورت سے ناواقف ہو اور یہ نہیں جانتے کہ یہ شعیرہ کس چیز پر دلالت کرتا ہے، تو جان لو کہ حق (الحق) نے تمہیں اس شعیرہ کے ذریعے مخاطب نہیں کیا اور نہ ہی اسے تمہارے لیے وضع کیا، بلکہ اسے اس کے لیے وضع کیا جو اس سے سمجھتا ہے۔ اور تمہارے لیے بھی ایک اور شعیرہ ہے، اور وہ ہر وہ چیز ہے جسے تم جانتے ہو کہ وہ تمہارے لیے اس پر دلالت کرتی ہے، جیسا کہ ابو العتاہیہ نے کہا:\n\nاور ہر چیز میں اس کی ایک نشانی ہے،\nجو اس بات پر دلالت کرتی ہے کہ وہ ایک ہے۔\n\nپس اس کے پاس ٹھہر جاؤ اور کہو: (رَبِّ زِدْنِي عِلْماً) \"اے میرے رب! میرے علم میں اضافہ فرما\"۔ تو تمہاری سمجھ اس چیز میں مضبوط ہو جائے گی جو اس نے نازل کی ہے اور وہ تمہیں وہ سکھائے گا (ما لَمْ تَكُنْ تَعْلَمُ) \"جو تم نہیں جانتے تھے\"۔ پس جب حق (الحق) تمہیں تمہاری ذات سے ممکن بنا دے گا، تو تم جان لو گے کہ تم اس پر سب سے قوی اور واضح شعائر (شعائر) میں سے ہو۔ اور اسی لیے شریعت اس قول کے ساتھ آئی ہے: \"من عرف نفسه عرف ربه\" (جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا)۔ پس جب تم اس مقام پر پہنچ جاؤ جہاں تمہارے نفس کے شعائر (شعائر) نے تمہیں پہنچایا، اور تم نے مشعور (جس کا شعور کیا گیا) کا مشاہدہ (الشہود) کیا، تو تم اسے اپنی صورت پر دیکھو گے۔ پس وہاں سے تم جانو گے کہ تم ہی اس کے تمہارے بارے میں علم میں اصل ہو، اور اس نے تم پر ظہور الٰہی (التجلی) نہیں کیا مگر تمہارے بارے میں اپنے علم کی صورت میں، اور وہ تمہارے ذریعے ہی تمہارے بارے میں عالم ہوا، اور تم نے اپنی ذات سے اسے تمہارے بارے میں علم دیا، پس تم اس کے لیے تم پر شعیرہ (شعيرة) ہو۔ اگر تم اسے اپنی صورت کے علاوہ کسی اور صورت میں دیکھو، تو تم نے اسے اس حیثیت سے نہیں دیکھا کہ تم اس کے لیے شعیرہ ہو۔ پس جب تم کوئی ایسی چیز دیکھو جسے تم نہیں جانتے، جبکہ دوسرے اسے جھٹلا رہے ہوں، تو تم اسے نہ جھٹلاؤ، کیونکہ اس حضور (حضرة) میں اللہ کے سوا کسی کے لیے ظہور (مجلی) نہیں ہے۔ جب یہ معاملہ ہو، تو اپنی نظر اس سے اپنی طرف لوٹاؤ، تو تم خود کو اسی صورت میں دیکھو گے جس پر تم نے اسے دیکھا تھا۔ اور تم اس کی وجہ سے اس میں رنگے نہیں گئے، بلکہ وہ بھی تمہاری صورت ہے تمہارے ثبوت میں، اور ابھی اس میں تمہارے داخل ہونے اور اس کے ذریعے تمہارے ظاہر ہونے کا وقت نہیں آیا تھا۔ کیونکہ صورتیں تم پر لا محدود طور پر پلٹتی رہتی ہیں، اور تم ان میں پلٹتے رہتے ہو اور ان کے ذریعے ظاہر ہوتے رہتے ہو، جس کی کوئی انتہا نہیں، لیکن یہ حالت کے بعد حالت ہے، ایک ایسی منتقلی جو زائل نہیں ہوتی۔ اور اللہ تعالیٰ نے تمہیں ان لا محدود صورتوں میں علم دیا ہے، پس اس نے تم پر ایسی صورت میں ظہور الٰہی (التجلی) کیا جس میں تمہارے ظاہر ہونے کا وقت نہیں آیا، کیونکہ تم مقید ہو اور وہ غیر مقید ہے، بلکہ اس کے اطلاق نے اسے مقید کیا ہے۔ اور وہ اپنے بندوں کے ساتھ یہ اس لیے کرتا ہے تاکہ وہ ان کے لیے اجنبیت کی حالت میں ظاہر ہو، اور اسی لیے وہ اسے جھٹلاتے ہیں، سوائے اس مقام کے عارفین (العارفون) کے، کیونکہ وہ اسے کسی بھی صورت میں ظاہر ہونے پر نہیں جھٹلاتے، کیونکہ انہوں نے اصل کو محفوظ رکھا ہے، اور وہ یہ ہے کہ وہ کسی مخلوق پر ظہور الٰہی (التجلی) نہیں کرتا مگر مخلوق کی صورت میں۔ یا تو وہ صورت جس پر وہ فی الحال ہے، تو وہ اسے پہچان لیتا ہے، یا وہ صورت جو اس کے بعد ہو گی، تو وہ اسے جھٹلاتا ہے یہاں تک کہ وہ دیکھتا ہے کہ وہ اس صورت میں داخل ہو چکا ہے، تب وہ اسے پہچانتا ہے۔ کیونکہ اللہ نے اسے علم دیا ہے اور وہ جانتا ہے کہ انجام کیا ہو گا، جبکہ مخلوق اپنی حالتوں میں سے صرف وہی جانتا ہے جس پر وہ اس وقت ہے۔ اور اسی لیے وہ کہتا ہے: (رَبِّ زِدْنِي عِلْماً) \"اے میرے رب! میرے علم میں اضافہ فرما\"۔ اور اللہ کے بندوں میں سے کچھ ایسے ہیں جو یہ جان لیتے ہیں جب وہ حق (الحق) کو ایسی صورت میں دیکھتے ہیں جسے وہ نہیں پہچانتے، تو وہ مقام کے حکم اور اپنے پاس موجود قبولیت کی بنا پر جان لیتے ہیں کہ اس نے ان پر ظہور الٰہی (التجلی) نہیں کیا مگر ایسی صورت میں جو ان ہی کی ہے اور جس کا وقت نہیں آیا، پس وہ اس میں داخل ہونے سے پہلے ہی اسے جان لیتے ہیں۔ پس یہ علم میں وہ اضافہ ہے جو اللہ نے بڑھایا، پس اس اللہ کا شکر ہے جس نے اسے انکار کے مقام پر پہچانا۔ اور اسی لیے اللہ نے اس فضل کو عظیم قرار دیا اور فرمایا: (وعَلَّمَكَ ما لَمْ تَكُنْ تَعْلَمُ وكانَ فَضْلُ الله عَلَيْكَ عَظِيماً) \"اور اس نے تمہیں وہ سکھایا جو تم نہیں جانتے تھے، اور تم پر اللہ کا فضل عظیم ہے\"۔ پس اس مقام پر حق (الحق) تمہارے نفس کے شعائر (شعائر) میں سے تھا، پس تم نے اسے اپنے نفس کے ذریعے پہچانا جیسا کہ تم نے اپنے نفس کو اس کے ذریعے پہچانا۔ پس غور کرو۔\n\nپس ہم شعائر (الشعائر) میں جمع ہوئے،\nاور باطنی رازوں (السرائر) میں جدا ہوئے۔\nپس ہمارے لیے اس کی طرف سے ظہور الٰہی (التجلی) ہے،\nاور اس کے لیے ہماری طرف سے ضمیریں (باطنی ارادے) ہیں۔\nپس ایسے ہی بندے ہیں،\nجو اس میں سرگرداں ہو کر سبقت کرتے ہیں۔\nپس جب تم یہ جان لو گے تو تم اس سے صادر (جدا) نہیں ہو گے،\nبلکہ وہ تم سے صادر (ظاہر) ہوتا ہے،\nجیسے رجسٹروں کے اوراق،\nجن میں سے بعض اوائل اور اواخر کے ذریعے بعض کو چھپاتے ہیں۔\nپس جو سبقت کرنا چاہے وہ سبقت کرے،\nاور جو فخر کرنا چاہے وہ فخر کرے۔\n\nپس اللہ نے اپنے شعائر (شعائر اللہ) کی تعظیم بے فائدہ نہیں کی، کیونکہ اس نے تعظیم نہیں کی مگر اس کی جو تعظیم قبول کرے۔ اور جہاں تک عظیم کا تعلق ہے، تو اس کی تعظیم نہیں کی جاتی، کیونکہ موجود (الموجود) کو موجود نہیں کیا جاتا۔ اور اللہ عظیم ہے، اور پوری کائنات، اس کا مقام حقیر نہیں ہے، مگر یہ کہ وہ تعظیم قبول کرتی ہے۔ اور اس کے لیے تعظیم کا کوئی راستہ نہیں تھا مگر یہ کہ وہ اس پر اللہ کے شعائر (شعائر اللہ) میں سے ہو۔ پس جب وہ نفس الامر میں اس پر شعیرہ (شعيرة) تھا، تو حق (الحق) نے ہمیں اس سے آگاہ کیا، پس ہم نے دیکھا اور اس کے قول کی حقیقت کو پایا، پس ہم نے اپنے ذریعے اس پر دلیل قائم کی، اور اس کے ذریعے بھی جب وہ ہم پر اجنبیت میں ظاہر ہوا۔\n\nپس اس کی طرف سے مجھ پر دلیل ہے،\nاور میری طرف سے اس پر دلیل ہے۔\nپس ہم اس کے پاس ہیں جیسا کہ اس نے فرمایا،\nاپنے اعمال کے ذریعے، پھر ہم اس کے پاس ہیں۔\nاور اس کے اعمال ہماری عین ذاتیں ہیں،\nپس میری ابتدا اس سے ہے اور میرا لوٹنا اسی کی طرف ہے۔\n\nاور اگر معاملہ ایسا نہ ہوتا تو تمہارا اسے وکیل بنانا سچ نہ ہوتا۔ اور مال اسی کا ہے، پس مال تمہارا ہے۔ اور اشارہ یہ ہے کہ صورت تمہاری صورت ہے۔ پس (لَنْ تَرانِي) \"تم مجھے ہرگز نہیں دیکھ سکو گے\" سچ ثابت ہوا، جب موسیٰ (علیہ السلام) نے اس سے کہا: (رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ) \"اے میرے رب! مجھے دکھا کہ میں تجھے دیکھوں\"۔ تو اس نے فرمایا: (لَنْ تَرانِي) \"تم مجھے ہرگز نہیں دیکھ سکو گے\"۔ اور لفظ \"لن\" (لن) مستقبل کے افعال کی نفی کرتا ہے۔ اور اشارہ یہ ہے کہ جو تمہیں حال میں نہیں جانتا، وہ تمہیں انجام میں بھی نہیں جانے گا، کیونکہ جب تم اسے انجام میں ظاہر ہو گے تو تم اسے اس حال کی صورت میں ظاہر نہیں ہو گے جس میں اس نے تمہیں تمہارے دیدار کے طلب کے وقت نہیں جانا تھا، بلکہ تم اسے اس انجام کی حالت کی صورت میں ظاہر ہو گے۔ پس وہ جو کچھ دیکھتا ہے اس کا انکار کرتا رہے گا یہاں تک کہ وہ مقام اور اس کے حکم کو پہچان لے، تب وہ جانتا ہے کہ وہ کیا دیکھ رہا ہے اور اس پر کیا حکم ہے۔ کیونکہ اللہ ہمیشہ دو آنکھوں اور کئی آنکھوں والے کے لیے ظاہر رہا ہے۔ اور جہاں تک ایک آنکھ والے کا تعلق ہے، تو وہ دجال اعور (کانا) ہے جو ہمیشہ قید کی زنجیر میں جکڑا رہا ہے۔ پس جسے اللہ نے اس کی دونوں آنکھیں کھول دیں جن کا احسان اللہ نے اس پر اپنے اس قول میں فرمایا: (أَ لَمْ نَجْعَلْ لَهُ عَيْنَيْنِ) \"کیا ہم نے اس کے لیے دو آنکھیں نہیں بنائیں؟\" تاکہ وہ مجھے دونوں حالتوں میں دیکھے: موجودہ حال میں اور مستقبل کے حال میں۔ پس جو مجھے حال میں نہیں دیکھتا جبکہ وہ میری طرف دیکھ رہا ہے، تو وہ انجام کی حالت میں مجھے دیکھنے سے زیادہ دور ہے، حالانکہ وہ مجھے دیکھ رہا ہوتا ہے، لیکن وہ نہیں جانتا کہ میں ہی اس کا مطلوب ہوں۔ اور اس کی وجہ یہ ہے کہ وہ مجھے علامت کے ذریعے طلب کرتا ہے، اور کیا یہ میری ذات سے سراسر جہالت نہیں ہے؟\n\nاور کیا وہاں میرے سوا کوئی اور ہے یا ہو سکتا ہے جبکہ میں نہ ہوں؟\nپس بصیرتوں کے سامنے آنکھوں کی ناکامی کیسی ہے!\nاگر تم طالب ہو تو افکار سے بچو،\nکیونکہ آزمائش کی جگہ میرے باطنی راز (سرائر) ہیں۔\n\nاور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "باب چهارصد و هفتاد و پنجم در معرفت حال قطب و منزل او که «و هر کس شعائر الهی را بزرگ بدارد» است.\n\nشعائر الهی پرچم‌هایی هستند که برای ما برافراشته شدند *** تا تفاوت میان حق و خلق را بدانیم.\nآن‌ها مرزهایی هستند که برزخ‌هایشان برپا شده‌اند *** تا حفاظی باشند برای کسی که قائل به تفاوت است.\nپس هر کس آن‌ها را بزرگ بدارد، آن شعائر محافظ او خواهند بود *** و او کسی است که از اشیاء به واسطه حق (الحق) پرهیز می‌کند.\nخداوند، جدای از خلق، برای او (قطب) در روز ورود (به محضر الهی) منزلی دارد *** که «مقعد صدق» نامیده می‌شود.\nاو این منزل را به واسطه کسی که در مسابقه برای رسیدن به آن پیشی گرفت، به دست می‌آورد *** هنگامی که با دیگران در میدان مسابقه دوید.\nفنا (الفناء) می‌یابد و باقی می‌ماند آن کسی که او را می‌خواند، در حالی که متصف است *** به اسم‌هایی که نزد ما «فناکننده» و «باقی‌کننده» هستند.\n\n### [قلب مؤمن گنجایش عظمت خدا را دارد]\n\nخداوند متعال در بزرگداشت آن‌ها (شعائر)، بلکه در مورد خود آن‌ها فرمود: «فَإِنَّها من تَقْوَى الْقُلُوبِ» (چرا که این [شعائر] از پرهیزگاری دل‌هاست). «لَكُمْ فِيها» (برای شما در آن‌ها) یعنی در شعائر «مَنافِعُ إِلى‏ أَجَلٍ مُسَمًّى ثُمَّ مَحِلُّها إِلَى الْبَيْتِ الْعَتِيقِ» (منافعی است تا زمانی معین، سپس جایگاه قربانی آن‌ها خانه کهن [کعبه] است). و آن (بیت عتیق) نزد اهل اشارات، خانه ایمان است و چیزی نیست جز قلب مؤمن که عظمت و جلال (الحق) را در خود جای داده است. شعائر الهی، نشانه‌های او هستند و نشانه‌های او، دلایلی هستند که به سوی او می‌رسانند. و شگفتا! چگونه کسی به سوی او می‌رسد در حالی که او نزد اوست؟ چنانکه ابویزید (بسطامی) گفت، هنگامی که شنید قاری‌ای می‌خواند: «يَوْمَ نَحْشُرُ الْمُتَّقِينَ إِلَى الرَّحْمنِ وَفْداً» (روزی که پرهیزگاران را به سوی [خدای] رحمان، به عنوان مهمانان محشور می‌کنیم). پس فریاد زد و گریست تا خون از چشمانش جاری شد و بر منبر کوبید و گفت: چگونه کسی به سوی او محشور می‌شود که هم‌نشین اوست؟ پس خداوند در کمال راست گفت، زیرا پرهیزگار از (الرحمن) پرهیز نمی‌کند. و ابویزید نیز راست گفت، زیرا مشهود او در آن حال جز (الرحمن) نبود. و ولیّ از ذوق (تجربه عرفانی) خود فراتر نمی‌رود و جز به حال خود سخن نمی‌گوید و هر آنچه می‌شنود را به حالی که بر او غالب است بازمی‌گرداند. و حال ابویزید در آن زمان همان بود که به آن نطق کرد. پس انسان زیر زبانش پنهان است، زیرا زبان، ترجمان احوال گوینده است.\n\n### [بدن از شعائر الهی است]\n\nسپس بدان که خداوند بدن را از شعائر خود قرار داده است و به همین دلیل است که احساس می‌کند (تشعر) تا دانسته شود که از شعائر الهی است. و آنچه به خدا بخشیده شود، بازگشتی در آن نیست. آیا نمی‌بینی که اگر (قربانی) پیش از رسیدن به بیت (کعبه) بمیرد، صاحبش آن را نحر می‌کند و آن را برای مردم رها می‌سازد و چیزی از آن نمی‌خورد؟ این از منت‌های خداوند است که تو را مَثَل قرار داد و تو را از آن (قربانی) متمایز ساخت و برای تو مُلکی قرار داد و از تو خواست که به او قرض دهی، در حالی که نعمت در اصل نعمت اوست. و این‌ها همه از شعائر الهی هستند، زیرا هر شعیره‌ای از آن‌ها دلیلی بر (الحق) است، از آن جهت که امری خاص است که خداوند اراده کرده و آن را برای اهل فهم از بندگانش آشکار ساخته است. پس آن‌ها در این امر به اندازه فهمشان بر یکدیگر برتری می‌یابند. بنابراین، اگر چیزی را دیدی که گفته می‌شود از شعائر الهی است و تو صورت آن را در میان شعائر نمی‌شناسی و نمی‌دانی که این شعیره بر چه دلالت می‌کند، بدان که (الحق) با آن شعیره تو را مخاطب قرار نداده و آن را برای تو وضع نکرده است، بلکه آن را برای کسی وضع کرده که آن را از او می‌فهمد. و تو نیز شعیره‌ای دیگر داری، و آن هر چیزی است که می‌دانی دلالتی برای تو بر اوست، چنانکه ابوالعتاهیه گفته است:\n\nو در هر چیزی برای او نشانه‌ای است *** که دلالت می‌کند بر اینکه او یگانه است.\n\nپس نزد آن (آیه) بایست و بگو: «رَبِّ زِدْنِي عِلْماً» (پروردگارا، علم مرا زیاد کن) تا فهم تو در آنچه نازل کرده قوی شود و آنچه را که «لَمْ تَكُنْ تَعْلَمُ» (نمی‌دانستی) به تو بیاموزد. پس هنگامی که (الحق) تو را بر نفس خودت مسلط ساخت، می‌دانی که تو از قوی‌ترین و آشکارترین شعائر بر او هستی. و به همین دلیل است که شریعت با این قول آمده است: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت).\n\nپس هنگامی که به آنچه شعائر نفس تو، تو را به آن رساندند، دست یافتی و «مَشعور» (آنچه شعیره بر آن دلالت می‌کند) را مشاهده کردی، او را بر صورت خودت می‌بینی. از آنجاست که می‌دانی تو اصل در علم او به خودت هستی و او جز در صورت علمش به تو، بر تو تجلی (التجلی) نکرده است، و او جز از جانب تو، عالم به تو نبوده است. و تو با ذات خودت، به دلیل علم او به تو، به او بخشیدی. پس تو شعیره او بر خودت هستی. اگر او را بر صورتی غیر از صورت خودت دیدی، پس او را از حیث شعیره بودنت برای او ندیده‌ای. پس هنگامی که چیزی را می‌بینی که دیگران آن را انکار می‌کنند، تو آن را انکار مکن، زیرا در آن حضرت (مقام)، تجلی (التجلی) برای هیچ کس جز (الحق) نیست. پس اگر چنین بود، نگاه خود را از او به سوی خودت بازگردان، آنگاه خودت را در همان صورتی می‌بینی که او را بر آن دیدی. و تو نیستی که از او به آن صورت رنگ گرفته باشی، بلکه آن نیز صورت تو در ثبوت (هستی ثابت) توست، و هنوز وقت ورود تو در آن و ظهور تو به واسطه آن نرسیده بود. زیرا صورت‌ها بر تو تا بی‌نهایت دگرگون می‌شوند و تو نیز در آن‌ها دگرگون می‌شوی و به واسطه آن‌ها تا بی‌نهایت ظاهر می‌شوی، اما حالی پس از حال، انتقالی که زوال نمی‌پذیرد. و خداوند متعال در این صورت‌ها، با وجود بی‌نهایتی‌شان، تو را تعلیم داده است، پس بر تو در صورتی تجلی (التجلی) کرده که هنوز وقت ظهور تو به واسطه آن نرسیده است، زیرا تو مقید هستی و او غیر مقید است، بلکه اطلاقش او را مقید کرده است. و او این کار را با بندگانش انجام می‌دهد تا در حال ناشناختگی بر آن‌ها ظاهر شود، و به همین دلیل است که او را انکار می‌کنند، مگر عارفون به این مقام، زیرا آن‌ها او را در هیچ صورتی که ظاهر شود انکار نمی‌کنند. چرا که آن‌ها اصل را حفظ کرده‌اند و آن این است که او بر هیچ مخلوقی جز در صورت آن مخلوق تجلی (التجلی) نمی‌کند؛ یا صورتی که مخلوق در حال حاضر بر آن است، که او را می‌شناسد، یا صورتی که بعداً بر آن خواهد بود، که او را انکار می‌کند تا زمانی که ببیند در آن صورت وارد شده است، آنگاه او را می‌شناسد. زیرا خداوند به او علم داده و می‌داند که سرانجام کار به کجا می‌انجامد، در حالی که مخلوق از احوال خود جز آنچه در همان لحظه بر آن است، نمی‌داند. و به همین دلیل است که می‌گوید: «رَبِّ زِدْنِي عِلْماً» (پروردگارا، علم مرا زیاد کن). و برخی از بندگان خدا هستند که این را می‌دانند؛ هنگامی که (الحق) را در صورتی می‌بینند که آن را نمی‌شناسند، به حکم آن موطن و پذیرشی که نزدشان هست، می‌دانند که او جز در صورتی که برای اوست، بر او تجلی (التجلی) نکرده است و هنوز وقت آن نرسیده است، پس آن را پیش از آنکه در آن وارد شود، می‌داند. این از همان «زیادت در علم» است که خداوند به او افزوده است. پس شکر خدایی را که او را در موطن انکار شناساند. و به همین دلیل خداوند این فضل را بزرگ شمرد و فرمود: «وَعَلَّمَكَ ما لَمْ تَكُنْ تَعْلَمُ وَكانَ فَضْلُ الله عَلَيْكَ عَظِيماً» (و آنچه را نمی‌دانستی به تو آموخت، و فضل خداوند بر تو بزرگ بود). پس (الحق) در این موطن از شعائر نفس تو بود، و تو خودت را به واسطه او شناختی، همان‌گونه که او را به واسطه خودت شناختی. پس تأمل کن.\n\nپس در شعائر با هم جمع شدیم *** و در سرائر (اسرار باطنی) از هم جدا گشتیم.\nپس تجلی (التجلی) از او برای ماست *** و ضمیرها (نیات باطنی) از ما برای اوست.\nپس برای چنین امری بندگانی هستند *** که در او سرگشته‌اند و شتابان پیش می‌روند.\nپس اگر این را دانستی، تو *** از او صادر (جدا) نخواهی بود.\nاوست که از شما صادر می‌شود *** مانند برگ‌های دفترها.\nکه برخی، برخی دیگر را می‌پوشانند *** با اوایل و اواخر.\nپس هر که می‌خواهد شتاب کند، شتاب کند *** و هر که می‌خواهد فخر کند، فخر کند.\n\nپس خداوند شعائر خود را بیهوده بزرگ نشمرده است، زیرا او جز کسی را که تعظیم را می‌پذیرد، بزرگ نمی‌شمارد. اما عظیم (الحق) تعظیم نمی‌شود، زیرا موجود (هستی) یافت نمی‌شود. و خداوند عظیم است و تمام عالم، جایگاهش حقیر نیست، جز اینکه تعظیم را می‌پذیرد. و برای او راهی در تعظیم نبود، مگر اینکه از شعائر الهی بر او باشد. پس چون در نفس‌الامر (حقیقت امر) شعیره‌ای بر او بود، (الحق) ما را به آن شناساند. پس نگریستیم و حقیقت قول او را دیدیم، و به واسطه خودمان بر او استدلال کردیم و به واسطه او، هنگامی که در ناشناختگی بر ما ظاهر شد.\n\nپس از او دلیلی به سوی من است *** و از من دلیلی به سوی اوست.\nپس ما نزد او هستیم، چنانکه او فرمود *** به واسطه اعمالش، سپس ما نزد او هستیم.\nو اعمال او عین اعیان ماست *** پس آغاز من از اوست و بازگشت من به سوی او.\n\nو اگر امر چنین نبود، وکیل گرفتن تو او را صادق نبود، و مال، مال اوست، پس مال، مال توست. و اشاره این است که صورت، صورت توست. پس «لَنْ تَرانِي» (هرگز مرا نخواهی دید) صادق است، هنگامی که موسی به او گفت: «رَبِّ أَرِنِي أَنْظُرْ إِلَيْكَ» (پروردگارا، خود را به من بنما تا به تو بنگرم)، و او فرمود: «لَنْ تَرانِي» (هرگز مرا نخواهی دید). و ادات «لن» افعال آینده را نفی می‌کند. و اشاره این است که هر کس تو را در حال (زمان حال) نشناسد، تو را در مال (سرانجام) نیز نمی‌شناسد، زیرا هنگامی که در مال بر او ظاهر می‌شوی، با صورت حالی که در آن هنگام درخواست رؤیت تو، تو را نشناخت، بر او ظاهر نمی‌شوی، بلکه با صورت حال آن مال بر او ظاهر می‌شوی. پس او پیوسته آنچه را می‌بیند انکار می‌کند تا زمانی که موطن و حکم آن را بشناسد، آنگاه می‌داند چه می‌بیند و حکم آن چیست. زیرا خداوند پیوسته ظاهرِ دارای دو چشم و چشم‌ها بوده است. اما صاحب یک چشم، دجالی است یک‌چشم که پیوسته در بند تقیید (محدودیت) در غل و زنجیر است. پس کسی که خداوند دو چشم او را که در قول عز و جل بر او منت نهاده، باز کند: «أَ لَمْ نَجْعَلْ لَهُ عَيْنَيْنِ» (آیا برای او دو چشم قرار ندادیم؟)، تا مرا در دو حال شهود کند: در حال راهنه (حاضر) و حال آینده. پس کسی که مرا در حال (زمان حال) نمی‌بیند در حالی که به من می‌نگرد، دورتر است که مرا در حال مال (سرانجام) ببیند، در حالی که مرا می‌بیند اما نمی‌داند که من مطلوب او هستم. و سبب این امر آن است که او مرا با علامت می‌طلبد، و آیا این جز عین جهل به من است؟\n\nو آیا آنجا غیر از من هست یا خواهد بود در حالی که من نباشم؟ *** پس ای ناامیدی دیده‌ها در برابر بصیرت‌ها!\nپس اگر طالب هستی، از افکار بپرهیز *** زیرا محل ابتلا، اسرار باطنی من است.\n\nو خداوند «يَقُولُ الْحَقَّ» (حق را می‌گوید) و «هُوَ يَهْدِي السَّبِيلَ» (او راه را هدایت می‌کند)."
  },
  "page_count": 2
}