{
  "id": 97,
  "title": {
    "ar": "الباب السابع والتسعون في مقام الكلام وتفاصيله",
    "en": "Chapter Ninety-Seven: Concerning the Station of Speech (مقام الكلام) and its Particulars",
    "ur": "باب ستانوے: مقام کلام اور اس کی تفصیلات کے بیان میں",
    "fa": "باب نود و هفتم در مقام کلام و تفصیلات آن"
  },
  "content": {
    "ar": "## (الباب السابع والتسعون في مقام الكلام وتفاصيله)\n\n\n> إن الكلام عبارات وألفاظ *** وقد تنوب إشارات وإيماء\n\n\n> لو لا الكلام لكنا اليوم في عدم *** ولم تكن ثم أحكام وأنباء\n\n\n> وإنه نفس الرحمن عينه *** عقل صريح وفي التشريع أنباء\n\n\n> فيه بدت صور الأشخاص بارزة *** معنى وحسا وذاك البدو إنشاء\n\n\n> فانظر ترى الحكمة الغراء قائمة *** فيها لعين اللبيب القلب أشياء\n\n\n### [معارج التكوين التي يعرج فيها النفس الرحمانى‏]\n\n\nالكلام صفة مؤثرة نفسية رحمانية مشتقة من الكلم وهو الجرح فلهذا قلنا مؤثرة كما أثر الكلم في جسم المجروح فأول كلام شق إسماع الممكنات كلمة كن فما ظهر العالم إلا عن صفة الكلام وهو توجه نفس الرحمن على عين من الأعيان ينفتح في ذلك النفس شخصية ذلك المقصود فيعبر عن ذلك الكون بالكلام وعن المتكون فيه بالنفس كما ينتهي النفس من المتنفس المريد إيجاد عين حرف فيخرج النفس المسمى صوتا ففي أي موضع انتهى أمد قصده ظهر عند ذلك عين الحرف المقصود إن كان عين الحرف خاصة هو المقصود فتظهر الهاء مثلا إلى الواو وما بينهما من مخارج الحروف وهذه تسمى معارج التكوين فيها يعرج النفس الرحماني فأي عين عين من الأعيان الثابتة اتصفت بالوجود\n\n\n### [المتكلم الإلهي والرباني والرحمانى‏]\n\n\nفلا بد لكل متكلم من أثر في نفس من كلمة غير إن المتكلم قد يكون إلهيا وربانيا ورحمانيا فمن كونه ربانيا ورحمانيا لا يشترط في كلامه خلق عين ظاهرة سوى ما ظهر من صورة الكلام التي أنشأها عند التلفظ فإن أثرت نشأة كلامه نشأة أخرى وهو أن يقول لزيد قم فهذا المتكلم قد أنشأ نشأة قم فإن قام زيد لأمره فقد أنشأ هذا الآمر صورة القيام في زيد عن نشأة لفظة قم فهو إلهي لأن انشاء الأعيان إنما هو لله وهذا عام في جميع الخلق فإن لم يسمع منه ولا أثرت فيه نشأة أمره فهو قاصر الهمة وليس بإلهي في هذه الحال وإنما هو رباني أو رحماني ولا يلزم للرباني والرحماني سوى إقامة نشأة الكلام خاصة والإلهي هو الذي ذكرناه‏\n\n\n### [المتكلم الإلهي على نوعين‏]\n\n\nغير إن الإلهي على نوعين إلهي كما ذكرناه وإلهي يؤثر كلامه في الأشياء مطلقا من جماد ونبات وحيوان وكون أي كون كان علوا وسفلا فهذا هو الإلهي المطلوب في هذا الطريق ولا يصح وجوده عاما أبدا في هذه الدار بل محله الجنان فإنه لا أكبر من محمد صَلَّى اللهُ عَليهِ وسَلَّم وقد قال لمن حقت عليه كلمة العذاب قل لا إله إلا الله‏\n\n\nفما ظهر عن نشأة أمره نشأة لا إله إلا الله في محل المأمور وإن كان على بصيرة فيه ولكنه مأمور أن يأمر وهو حريص على الأمة فالمأمور ما امتنع وإنما الممتنع لا إله إلا الله فإن هذا اللفظ هو المأمور أن يكون في هذا المحل فلم يكن فلو تكون في محل هذا الشخص لظهر عينه وأعطاه اسم الإسلام كما إن هذا الشخص لما قال له الحق كن وهو في العدم لم يتمكن له إلا أن يكون ولا بد فقد علمت من هو المأمور بالوجود في التحقيق وهو قول الله إِنَّكَ لا تَهْدِي من أَحْبَبْتَ أي إنك لا تقدر على من تريد أن تجعله محلا لظهور ما تريد إنشاءه فيه أن يكون محلا لوجود إنشائك فيه فليس كل متكلم في الدنيا بإلهي مطلق لكن له الإطلاق فيما يريد أن ينشئه في نفسه لا في غيره فاعلم سر هذا واعلم هل أنت متكلم أو لافظ\n\n",
    "en": "Chapter Ninety-Seven: Concerning the Station of Speech (الكلام) and its Details\n\n> Speech consists of expressions and words,\n> Though sometimes signs and gestures may substitute.\n> Were it not for Speech, we would today be in non-existence,\n> And there would be no decrees or tidings.\n> Indeed, it is the very Breath of the All-Merciful (نفس الرحمن),\n> A clear intellect, and in the Sacred Law (التشريع) there are tidings.\n> In it appeared the forms of persons, manifest,\n> Both conceptually and sensually, and that appearance is creation (إنشاء).\n> Look, and you will see the brilliant Wisdom established,\n> In which, for the eye of the discerning heart, there are many things.\n\n### [The Ascents of Creation (معارج التكوين) in which the Divine Breath (النفس الرحمانى) ascends]\n\nSpeech (الكلام) is an effective, psychic, Merciful Attribute (صفة مؤثرة نفسية رحمانية), derived from *al-kalm* (the wound), which is why we called it effective, just as the wound (*al-kalm*) affects the body of the wounded. The first Speech that split the hearing of the possible things (الممكنات) was the word \"Be!\" (كن). The World (العالم) only appeared through the Attribute of Speech, which is the turning of the Breath of the All-Merciful (نفس الرحمن) toward one of the Fixed Entities (الأعيان). The personality (شخصية) of that intended thing opens up within that Breath. Thus, that coming-into-being (الكون) is expressed by Speech, and that which comes into being within it is expressed by the Breath. This is similar to how the breath (النفس) ends from the breather who intends to bring a specific letter into existence, whereupon the breath, called sound (صوتا), emerges. Wherever the limit of his intention ends, the specific intended letter appears, provided that the specific letter itself is the intention. Thus, the letter *hā’* (الهاء) appears, for example, up to *wāw* (الواو), and what lies between them of the points of articulation (مخارج الحروف). These are called the Ascents of Creation (معارج التكوين), in which the Divine Breath (النفس الرحماني) ascends, so that any specific Fixed Entity (عين من الأعيان الثابتة) is characterized by Existence (الوجود).\n\n### [The Divine, Lordly, and Merciful Speaker (المتكلم الإلهي والرباني والرحمانى)]\n\nEvery speaker must necessarily have an effect on the soul (نفس) through a word, except that the speaker may be Divine (إلهي), Lordly (رباني), or Merciful (رحماني). In the case of the Lordly and the Merciful speaker, the creation of a manifest entity (عين ظاهرة) is not required in their speech, other than the form of the speech itself which they originate (أنشأها) when uttering it. If the origination (نشأة) of his speech affects another origination—for example, if he says to Zayd, \"Stand up!\" (قم)—then this speaker has originated the origination of \"Stand up!\" If Zayd stands up in response to his command, then this commander has originated the form of standing in Zayd through the origination of the word \"Stand up!\" He is thus Divine (إلهي), because the origination of entities (إنشاء الأعيان) belongs only to Allah. This is general among all creation (الخلق). But if [Zayd] does not hear him, or if the origination of his command does not affect him, then the speaker is deficient in spiritual resolve (قاصر الهمة) and is not Divine in this state. Rather, he is merely Lordly or Merciful. The Lordly and the Merciful are only required to establish the origination of the speech itself, whereas the Divine is the one we have described.\n\n### [The Divine Speaker (المتكلم الإلهي) is of two types]\n\nHowever, the Divine (الإلهي) is of two types: a Divine speaker as we have mentioned, and a Divine speaker whose speech affects things absolutely, whether inanimate, plant, animal, or any cosmos (كون) whatsoever, high or low. This latter is the Divine speaker sought after in this Path (الطريق), but his general existence is never valid in this abode (الدّار); rather, his place is the Gardens (الجنان). For there is none greater than Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم), yet he said to one upon whom the word of punishment was due, \"Say, 'There is no god but Allah' (لا إله إلا الله).\" Yet, the origination (نشأة) of \"There is no god but Allah\" did not appear in the locus of the commanded person through the origination of his command, even though he possessed insight concerning it, and he was commanded to command, being zealous for the Community (الأمة). The commanded person did not refuse; rather, what refused was \"There is no god but Allah,\" for this phrase was commanded to exist in that locus, but it did not come into being. Had it come into being in the locus of that person, its entity (عينه) would have appeared and granted him the name of Islam, just as when the Real (الحق) said to this person, \"Be!\" (كن) while he was in non-existence (العدم), it was impossible for him except to be, necessarily. You have thus known who is truly commanded to exist, which is the saying of Allah: <<إِنَّكَ لا تَهْدِي من أَحْبَبْتَ>> (Indeed, you do not guide whom you love). That is to say, you are not able to compel the one whom you wish to make a locus for the manifestation of what you desire to originate within him, to become a locus for the existence of your origination within him. Therefore, not every speaker in the world is an absolute Divine speaker (إلهي مطلق), but he does possess absoluteness (الإطلاق) regarding what he wishes to originate within himself, not in others. Know this secret, and know whether you are a true speaker (متكلم) or merely an utterer (لافظ).",
    "ur": "باب ستانوے: کلام (الکلام) کے مقام اور اس کی تفصیلات کے بیان میں\n\nبیشک کلام عبارتیں اور الفاظ ہیں\nاور کبھی اشارے اور ایما بھی اس کا قائم مقام ہو جاتے ہیں\n\nاگر کلام نہ ہوتا تو آج ہم عدم میں ہوتے\nاور نہ وہاں کوئی احکام ہوتے اور نہ کوئی خبریں\n\nاور یہ (کلام) بعینہٖ نفس رحمانی ہے\nایک واضح عقل ہے اور شریعت میں خبریں ہیں\n\nاسی میں اشخاص کی صورتیں ظاہر ہوئیں\nمعنی کے لحاظ سے بھی اور حس کے لحاظ سے بھی، اور یہ ظہور ہی تخلیق (إنشاء) ہے\n\nپس دیکھو، تم ایک روشن حکمت کو قائم پاؤ گے\nجس میں دانا دل کی آنکھ کے لیے کئی چیزیں ہیں\n\n### [معارج التكوين (تکوینی عروج کی منازل) جن میں نفس رحمانی عروج کرتا ہے]\n\nکلام ایک مؤثر صفت ہے، جو نفس رحمانی سے متعلق ہے، اور یہ \"الکلم\" سے مشتق ہے جس کا معنی زخم (جرح) ہے۔ اسی لیے ہم نے اسے مؤثر کہا، جیسے زخم (الکلم) مجروح کے جسم پر اثر کرتا ہے۔ پس ممکنات کے کانوں کو چیرنے والا پہلا کلام کلمہ \"کن\" (ہو جا) تھا، اور عالم کا ظہور کلام کی صفت ہی سے ہوا۔ اور یہ (کلام) نفس رحمانی کا اعیان (الأعيان) میں سے کسی ایک عین پر متوجہ ہونا ہے، جس سے اس نفس میں اس مقصود کی شخصیت کھل جاتی ہے۔ پس اس کون (ہونا) کو کلام سے تعبیر کیا جاتا ہے اور اس میں متکون (ہونے والی چیز) کو نفس سے۔\n\nجیسے سانس لینے والے سے نفس (سانس) نکلتا ہے جو کسی حرف کے عین کو وجود دینا چاہتا ہے، تو وہ نفس جسے آواز کہا جاتا ہے، خارج ہوتا ہے۔ اور جس مقام پر اس کے قصد کی مدت ختم ہوتی ہے، وہاں مقصود حرف کا عین ظاہر ہو جاتا ہے، اگر صرف حرف کا عین ہی مقصود ہو۔ پس مثال کے طور پر \"ھ\" سے لے کر \"و\" تک اور ان کے درمیان کے مخارج حروف ظاہر ہوتے ہیں۔ اور یہ معارج التكوين (تکوینی عروج کی منازل) کہلاتی ہیں، جن میں نفس رحمانی عروج کرتا ہے۔ پس اعیان ثابتہ (الأعيان الثابتة) میں سے جو بھی عین الوجود (الوجود) سے متصف ہو جائے۔\n\n### [متکلم الٰہی، ربانی اور رحمانی]\n\nپس ہر متکلم کے لیے ضروری ہے کہ اس کے کلمے کا کسی نفس پر کوئی اثر ہو۔ تاہم، متکلم الٰہی، ربانی اور رحمانی ہو سکتا ہے۔ جہاں تک اس کے ربانی اور رحمانی ہونے کا تعلق ہے، اس کے کلام میں کسی ظاہری عین کی تخلیق شرط نہیں ہے، سوائے اس کلام کی صورت کے جو اس نے تلفظ کے وقت پیدا کی۔ لیکن اگر اس کے کلام کی نشأت کسی دوسری نشأت پر اثر انداز ہو، جیسے وہ زید سے کہے: \"اٹھو\" (قم)، تو اس متکلم نے \"قم\" کی نشأت پیدا کی۔ اگر زید اس کے حکم پر اٹھ کھڑا ہوا، تو اس آمر نے لفظ \"قم\" کی نشأت کے ذریعے زید میں قیام کی صورت پیدا کر دی۔ پس وہ الٰہی ہے، کیونکہ اعیان (الأعيان) کی تخلیق صرف اللہ کے لیے ہے۔ اور یہ تمام مخلوق میں عام ہے۔\n\nاگر زید نے اس کی بات نہ سنی اور نہ ہی اس کے حکم کی نشأت نے اس پر اثر کیا، تو وہ قاصر ہمت ہے اور اس حالت میں الٰہی نہیں ہے، بلکہ وہ صرف ربانی یا رحمانی ہے۔ اور ربانی اور رحمانی کے لیے صرف کلام کی نشأت کو قائم کرنا ضروری ہے، جبکہ الٰہی وہ ہے جس کا ہم نے ذکر کیا۔\n\n### [متکلم الٰہی دو قسموں پر ہے]\n\nتاہم، الٰہی دو قسموں پر ہے: ایک وہ الٰہی جس کا ہم نے ذکر کیا، اور دوسرا وہ الٰہی جس کا کلام اشیاء میں مطلقاً اثر کرتا ہے، خواہ وہ جمادات، نباتات، حیوانات ہوں، یا کوئی بھی کون (وجود) ہو، خواہ وہ علوی ہو یا سفلی۔ پس یہی وہ الٰہی ہے جو اس طریق میں مطلوب ہے، اور اس کا وجود اس دنیا میں کبھی بھی عام نہیں ہو سکتا، بلکہ اس کا مقام جنت (الجنان) ہے۔\n\nکیونکہ محمد صلی اللہ علیہ وسلم سے بڑا کوئی نہیں ہے، اور آپ نے اس شخص سے کہا جس پر عذاب کا کلمہ واجب ہو چکا تھا کہ \"لا الہ الا اللہ\" کہو۔ پس آپ کے حکم کی نشأت سے مامور کے محل میں \"لا الہ الا اللہ\" کی نشأت ظاہر نہ ہوئی، اگرچہ آپ اس میں بصیرت رکھتے تھے، لیکن آپ کو حکم دینے کا حکم تھا اور آپ امت پر حریص تھے۔ پس مامور نے انکار نہیں کیا، بلکہ انکار \"لا الہ الا اللہ\" نے کیا، کیونکہ اس لفظ کو حکم دیا گیا تھا کہ وہ اس محل میں ہو، مگر وہ نہ ہوا۔\n\nاگر وہ (کلمہ) اس شخص کے محل میں متکون (وجود پذیر) ہو جاتا تو اس کا عین ظاہر ہو جاتا اور اسے اسلام کا نام دے دیتا۔ جیسے جب الحق (ذات حق) نے اس شخص سے کہا \"کن\" (ہو جا) جبکہ وہ عدم میں تھا، تو اس کے لیے ہونے (وجود میں آنے) کے سوا کوئی چارہ نہ تھا۔ پس آپ جان چکے ہیں کہ تحقیق میں وجود (الوجود) کا مامور کون ہے، اور وہ اللہ کا یہ قول ہے:\n\"إِنَّكَ لا تَهْدِي مَنْ أَحْبَبْتَ\" (بیشک آپ جسے چاہیں ہدایت نہیں دے سکتے) [القصص: ۵۶]۔\nیعنی آپ اس شخص پر قادر نہیں ہیں جسے آپ اپنے پیدا کردہ (انشاء) کے ظہور کا محل بنانا چاہتے ہیں، تاکہ وہ آپ کی تخلیق کے وجود کا محل بن سکے۔ پس دنیا میں ہر متکلم مطلقاً الٰہی نہیں ہوتا، لیکن اسے اس چیز میں اطلاق حاصل ہوتا ہے جسے وہ اپنے نفس میں پیدا کرنا چاہتا ہے، نہ کہ دوسروں میں۔ پس اس راز کو جانو اور یہ جانو کہ آیا تم متکلم ہو یا صرف لافظ (لفظ ادا کرنے والا)۔",
    "fa": "(باب نود و هفتم در مقام کلام و تفصیلات آن)\n\nکلام، عبارت‌ها و الفاظ است\nو گاهی اشارات و ایماها جای آن را می‌گیرند\nاگر کلام نبود، امروز در نیستی (عدم) بودیم\nو در آنجا احکام و اخباری وجود نداشت\nو آن (کلام) عین نفس رحمانی (نفس الرحمن) است\nعقلی صریح و در شریعت، اخبار است\nدر آن، صورت‌های اشخاص آشکار گشتند\nاز نظر معنا و حس، و آن آشکار شدن، ایجاد (إنشاء) است\nپس بنگر تا حکمت درخشان را برپا ببینی\nکه در آن برای چشم خردمند، قلب، اشیائی است\n\n### [معراج‌های تکوین که نفس رحمانی (النفس الرحماني) در آن‌ها عروج می‌کند]\n\nکلام، صفتی مؤثر، نفسی و رحمانی است که از \"کَلْم\" (الکلم) مشتق شده و آن به معنای جراحت (جرح) است. به همین دلیل گفتیم مؤثر است، همان‌طور که جراحت در جسم مجروح اثر می‌گذارد. اولین کلامی که گوش‌های ممکنات را شکافت، کلمه \"کُن\" (باش) بود. عالم جز از صفت کلام ظاهر نشد، و آن عبارت است از توجه نفس رحمان (نفس الرحمن) بر عینی از اعیان (الأعيان) که در آن نفس، شخصیت آن مقصود گشوده می‌شود. پس از آن کَوْن (هستی یافتن) به کلام تعبیر می‌شود و از متکون (آنچه هستی یافته) در آن، به نفس تعبیر می‌شود؛ همان‌طور که نفس از شخص نفس‌کشنده که قصد ایجاد عین حرفی را دارد، خارج می‌شود و آن نفس که صوت نامیده می‌شود، بیرون می‌آید. در هر موضعی که مدت قصد او به پایان رسد، در آنجا عین حرف مقصود ظاهر می‌شود، اگر عین حرف به خصوص مقصود باشد. پس مثلاً حرف \"هاء\" تا \"واو\" و آنچه میان آن‌ها از مخارج حروف است، ظاهر می‌شود. این‌ها معارج تکوین (معارج التكوين) نامیده می‌شوند که نفس رحمانی (النفس الرحماني) در آن‌ها عروج می‌کند. پس هر عینی از اعیان ثابته (الأعيان الثابتة) که متصف به هستی (الوجود) شد...\n\n### [متکلم الهی (الإلهي)، ربانی (الرباني) و رحمانی (الرحماني)]\n\nپس برای هر متکلمی ناگزیر است که کلمه‌ای در نفس اثر بگذارد. با این تفاوت که متکلم گاهی الهی (إلهي)، ربانی (رباني) و رحمانی (رحماني) است. در مورد ربانی و رحمانی بودن، در کلام او خلق عین ظاهری شرط نیست، مگر آنچه از صورت کلام که هنگام تلفظ ایجاد کرده، ظاهر شود. اما اگر نشأت کلام او بر نشأت دیگری اثر بگذارد، و آن این است که به زید بگوید: «برخیز»، این متکلم نشأت «برخیز» را ایجاد کرده است. اگر زید به امر او برخیزد، این امرکننده صورت قیام را در زید از نشأت لفظ «برخیز» ایجاد کرده است، پس او الهی است؛ زیرا ایجاد اعیان (الأعيان) تنها از آنِ حق (الحق) است. و این (قدرت ایجاد) در تمام خلق عمومیت دارد. اما اگر (زید) از او نشنود و نشأت امر او در وی اثر نگذارد، او کوتاه همت است و در این حال الهی نیست، بلکه ربانی یا رحمانی است. برای ربانی و رحمانی تنها اقامه نشأت کلام به خصوص لازم است، و الهی کسی است که ذکر کردیم.\n\n### [متکلم الهی (الإلهي) بر دو نوع است]\n\nبا این حال، الهی (الإلهي) بر دو نوع است: الهی که ذکر کردیم، و الهی که کلامش مطلقاً در اشیاء اثر می‌گذارد، از جماد و نبات و حیوان و هر کونی که باشد، چه بالا و چه پایین. این همان الهی مطلوب در این طریق است و وجود عام آن هرگز در این دنیا صحیح نیست، بلکه جایگاهش بهشت‌هاست. زیرا کسی بزرگ‌تر از محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نیست، و او به کسی که کلمه عذاب بر او محقق شده بود، فرمود: «بگو لا إله إلا الله».\n\nاما نشأت «لا إله إلا الله» در محل مأمور از نشأت امر او ظاهر نشد، هرچند او (پیامبر) بر بصیرت بود و مأمور بود که امر کند و بر امت حریص بود. مأمور (شخص) امتناع نکرد، بلکه آنچه امتناع کرد، «لا إله إلا الله» بود؛ زیرا این لفظ مأمور بود که در این محل باشد، اما نبود. اگر در محل این شخص هستی می‌یافت، عین او ظاهر می‌شد و نام اسلام را به او می‌داد، همان‌طور که وقتی حق (الحق) به این شخص در حالی که در نیستی (العدم) بود، فرمود: «کُن» (باش)، چاره‌ای جز هستی یافتن نداشت و ناگزیر بود که باشد. پس به تحقیق دانستی که مأمور به هستی (الوجود) کیست، و آن قول خداوند است: **إِنَّكَ لا تَهْدِي من أَحْبَبْتَ** (تو کسی را که دوست داری هدایت نمی‌کنی). یعنی تو نمی‌توانی کسی را که می‌خواهی او را محل ظهور آنچه قصد ایجادش را داری قرار دهی، به گونه‌ای که محل وجود ایجاد تو در او باشد. پس هر متکلمی در دنیا الهی مطلق نیست، اما او در آنچه می‌خواهد در نفس خود ایجاد کند، نه در غیر خود، دارای اطلاق است. پس سر این را بدان و آگاه باش که آیا تو متکلمی یا صرفاً تلفظ‌کننده."
  },
  "page_count": 1
}