{
  "id": 276,
  "title": {
    "ar": "الباب السادس والسبعون ومائتان في معرفة منزل الحوض وأسراره من المقام المحمدي",
    "en": "Chapter Two Hundred and Seventy-Six: Concerning the Gnosis of the Station of the Pool (الحوض) and its Mysteries, derived from the Muhammadan Station (المقام المحمدي)",
    "ur": "باب دو سو چھہترواں: معرفت (معرفة) منزل حوض اور اس کے اسرار کے بیان میں جو المقام المحمدي (المقام المحمدي) سے متعلق ہیں۔",
    "fa": "باب دویست و هفتاد و ششم در معرفت منزل حوض و اسرار آن از مقام محمدی."
  },
  "content": {
    "ar": "## «الباب السادس والسبعون ومائتان في معرفة منزل الحوض وأسراره من المقام المحمدي»\n\n\n> الحوض منزل وصف الماء بالكدر *** وهي العلوم التي تختص بالبشر\n\n\n> فالماء في العين صاف ما به كدر *** والقعر يظهر ما فيه من الكدر\n\n\n> وعلة الرنق كون الفكر ينتجه *** فاطلب من العلم ما يسمو عن الفكر\n\n\n> إن الخيال إذا جاءته قيدها *** بالفكر في عالم الأجساد والصور\n\n\n> والفكر من صورها وقتا يخلصها *** لكنه غير معصوم من الضرر\n\n\n> فاطلبه بالذكر لا بالفكر تحظ به *** منزها خالصا من شائب الغير\n\n\n### [أن العلوم على قسمين موهوبة ومكتسبة]\n\n\nاعلم أيها الولي الحميم نور الله بصيرتك وحسن سريرتك أن العلوم على قسمين موهوبة وهو قوله تعالى لَأَكَلُوا من فَوْقِهِمْ وهي نتيجة التقوى كما قال تعالى واتَّقُوا الله ويُعَلِّمُكُمُ الله وقال إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً وقال الرَّحْمنُ عَلَّمَ الْقُرْآنَ ومكتسبة وإليها الإشارة بقوله تعالى ومن تَحْتِ أَرْجُلِهِمْ يشير إلى كدهم واجتهادهم وهم أهل الاقتصاد والضمير في أرجلهم يعود على الذين أكلوا من فوقهم وهم الذين أقاموا كتاب الله وما أُنْزِلَ إِلَيْهِمْ من رَبِّهِمْ وهم المسارعون في الْخَيْراتِ وهُمْ لَها سابِقُونَ فمنهم من سبق بالخيرات ومنهم من أقام الكتاب من رقدته فإن التأويل من العلماء أضجعه بعد ما كان قائما فجاء من وفقه الله فأقامه من رقدته أي نزهة عن تأويله والتعمل فيه بفكره فقام بعبادة ربه وسأله أن يوقفه على مراده من تلك الألفاظ التي حواها الكتاب والتعريف من المعاني المخلصة عن المواد فأعطاهم الله العلم غير مشوب قال تعالى وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله والرَّاسِخُونَ في الْعِلْمِ يعلمهم الحق ما يؤول إليه هذا اللفظ المنزل‏\nالمرقوم وما أودع فيه من المعاني من غير فكر فيه إذ كان الفكر في نفسه غير معصوم من الغلط في حق كل أحد ولهذا قال والرَّاسِخُونَ في الْعِلْمِ يَقُولُونَ ... رَبَّنا لا تُزِغْ قُلُوبَنا يعني بالفكر فيما أنزلته بَعْدَ إِذْ هَدَيْتَنا إلى الأخذ منك علم ما أنزلته إلينا وهَبْ لَنا من لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ فسأله من جهة الوهب لا من جهة الكسب ولهذا جعلنا الضمير يعود على الذين أكلوا من فوقهم يقول ومن تحت أرجل هؤلاء أمم مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ وهم أهل الكسب وهم الذين يتأولون كتاب الله ولا يقيمونه بالعمل الذي نزل إليه ولا يتأدبون في أخذه وهم على قسمين القليل منهم المقتصد في ذلك وهو الذي قارب الحق وقد يصيب الحق فيما تأوله بحكم الموافقة لا بحكم القطع فإنه ما يعلم مراد الله فيما أنزله على التعيين إلا بطريق الوهب وهو الإخبار الإلهي الذي يخاطب به الحق قلب العبد في سره بينه وبينه ومن لم يقتصد في ذلك وتعمق في التأويل بحيث إنه لم يترك مناسبة بين اللفظ المنزل والمعنى أو قرر اللفظ على طريق التشبيه ولم يرد علم ذلك إلى الله فيه وهم الذين قال الله فيهم في الآية عينها وكَثِيرٌ مِنْهُمْ ساءَ ما يَعْمَلُونَ وأي سوء أعظم من هذا وهؤلاء هم القسم الثاني ولما شاهد الرسول هذا الأمر وقد بعث رحمة بما نزل به ورأى الكثير لم تصبه هذه الرحمة وأن علة ذلك إنما كان تأويلهم بالوجهين من التشبيه أو البعد عن مدلول اللفظ بالكلية تحير في التبليغ وتوقف حتى يرى هل يوجب ذلك عليه ربه أم لا فأنزل الله تعالى يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ وقيل له فَإِنَّما عَلَيْكَ الْبَلاغُ وقيل له لَيْسَ عَلَيْكَ هُداهُمْ فيما يجري منهم من خير وشر وقيل له إِنَّكَ لا تَهْدِي من أَحْبَبْتَ ولكِنَّ الله يَهْدِي من يَشاءُ فعلم الرسول أن المراد منه التبليغ لا غير فبلغ صلى الله عليه وسلم وما أخفى مما أمر بتبليغه شيئا أصلا فإنه معصوم محفوظ قطعا في التبليغ عن ربه ما أمر بتبليغه وما خص به فهو فيه على ما يقتضيه نظره فالتقدير في الآية على التفسير ومن تَحْتِ أَرْجُلِهِمْ أمم مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ وكَثِيرٌ مِنْهُمْ ساءَ ما يَعْمَلُونَ ولهذا قال لنبيه وإِنْ تُطِعْ أَكْثَرَ من في الْأَرْضِ يُضِلُّوكَ عَنْ سَبِيلِ الله وقال ما يَعْلَمُهُمْ إِلَّا قَلِيلٌ فأشرف العلوم ما ناله العبد من طريق الوهب وإن كان الوهب يستدعيه استعداد الموهوب إليه بما اتصف به من الأعمال الزكية المشروعة ولكنه لما لم يكن ذلك شرطا في حصول هذا العلم لذلك تعالى هذا العلم عن الكسب فإن بعض الأنبياء تحصل لهم النبوة من غير أن يكونوا على عمل مشروع يستعدون به إلى قبولها وبعضهم قد يكون على عمل مشروع فيكون ذلك عين الاستعداد فربما يتخيل من لا معرفة له أن ذلك الاستعداد لولاه ما حصلت النبوة فيتخيل أنها اكتساب والنبوة في نفسها اختصاص إلهي يعطيه لمن شاء من عباده وما عنده خبر بشرع ولا غيره ولا يعرف من هو ولا بما هو الأمر عليه فلو كان الاستعداد ينتج هذا العلم لوجد ذلك في الأنبياء ولم يقع الأمر كذلك فإن النبوة غير مكتسبة بلا خلاف بين أهل الكشف من أهل الله وإن كان اختلف في ذلك أهل الفكر من العقلاء فذلك من أقوى الدلالات عندنا على إن الفكر يصيب العاقل به ويخطئ ولكن خطؤه أكثر من إصابته لأن له حدا يقف عنده فمتى ما وقف عند حده أصاب ولا بد ومتى جاوز حده إلى ما هو لحكم قوة أخرى يعطاها بعض العبيد قد يخطئ ويصيب عصمنا الله وإياكم من غلطات الأفكار وجعلنا من الذاكرين المذكورين بفضله لا رب غيره ولنا فيما ذكرناه آنفا نظم كتبت به إلى بعض الإخوان سنة إحدى وستمائة من مدينة الموصل في النبوة إنها اختصاص من الله تعالى ولذلك لا يشوب رائقها كدر\n\n\n> ألا إن الرسالة برزخية *** ولا يحتاج صاحبها لنية\n\n\n> إذا أعطت بنيته قواها *** تلقتها بقوتها البنية\n\n\n> وإن الاختصاص بها منوط *** كما دلت عليه الأشعرية\n\n\n> وهذا الحق ليس به خفاء *** فدع أحكام كتب فلسفيه‏\n\n\nفي أبيات كثيرة ولكن قصدنا إلى الأمر الذي يطلبه هذا الموضع منها ولتعلم إن سبب ظهور\n\n\nالأكدار إنما هو قرار الماء وسكونه لطلب الراحة من الحركة في غير موضعها ومحلها ولذلك كنينا عن هذه الحالة بالحوض لأن فيه قرار الماء وسكونه وقد قلنا في باب الغزل والنسيب أصف نزاهة المعشوق في نفسه‏\n> روحت كل من أشب بها *** نقلة عن مراتب البشر\n\n\n> غيرة إن يشاب رائقها *** بالذي في الحياض من كدر\n\n\nأريد أن المحب إذا تعشق من صفته هذه حكم عليه هذا المعشوق فنقله إليه وكساه من ملابسه فأخرجه عن الذي يقتضيه عالم الطبيعة من كدر الشبه إذا كان المعشوق علما والشبهات والحرام إذا كان المعشوق عملا والشهوات الطبيعية إذا كان المعشوق روحا مجردا عن المواد وعن البشرية إذا كان المعشوق ملكا وعما سوى الله إذا كان المحبوب هو الله فالمحب الصادق من انتقل إلى صفة المحبوب لا من أنزل المحبوب إلى صفته أ لا ترى الحق سبحانه لما أحبنا نزل إلينا في ألطافه الخفية بما يناسبنا مما يتعالى جده وكبرياؤه عن ذلك فنزل إلى التبشبش بنا إذا جئنا إلى بيته نقصد مناجاته وإلى الفرح بتوبتنا ورجوعنا إليه من إعراضنا عنه والتعجب من عدم صبوة الشاب من الشاب الذي هو في محل حكم سلطانها وإن كان ذلك بتوفيقه وإلى نيابته عنا في جوعنا وعطشنا ومرضنا وإنزاله نفسه إلينا منزلتنا\n\n\nلما جاع بعض عبيده قال للآخرين جعت فلم تطعمني ولما عطش آخر من عباده قال سبحانه لعبد آخر ظمئت فلم تسقني ولما مرض آخر من عباده قال لآخر من عباده مرضت فلم تعدني فإذا سأله هؤلاء العبيد عن هذا كله يقول لهم أما إن فلانا مرض فلو عدته لوجدتني عنده أما إنه جاع فلان فلو أطعمته لوجدت ذلك عندي أما إنه عطش فلان فلو سقيته لوجدت ذلك عندي والخبر صحيح‏\n\n\nفهذا من ثمرة المحبة حيث نزل إلينا فلهذا قلنا إن الصدق في المحبة يجعل المحب يتصف بصفة المحبوب وكذا العبد الصادق في محبته ربه يتخلق بأسمائه فيتخلق بالغنى عن غير الله وبالعز بالله تعالى وبالعطاء بيد الله تعالى وبالحفظ بعين الله تعالى وقد علم العلماء التخلق بأسماء الله ودونوا في ذلك الدواوين وسبب ذلك لما أحبوه اتصفوا بصفاته على حد ما يليق بهم ثم نرجع إلى ما كنا بسبيله فنقول والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ إن العلوم وأعني بها المعلومات إذا ظهرت بذواتها للعلم وأدركها العلم على ما هي عليه في ذواتها فذلك العلم الصحيح والإدراك التام الذي لا شبهة فيه البتة وسواء كان ذلك المعلوم وجودا أو عدما أو نفيا أو إثباتا أو كثيفا أو لطيفا أو ربا أو مربوبا أو حرفا أو معنى أو جسما أو روحا أو مركبا أو مفردا أو ما أنتجه التركيب أو نسبة أو صفة أو موصوفا فمتى ما خرج شي‏ء مما ذكرناه عن إن يبرز للعلم بذاته وبرز له في غير صورته فبرز العدم له في صورة الوجود وبالعكس والنفي في صورة الإثبات وبالعكس واللطيف في صورة الكثيف وبالعكس والرب بصفة المربوب والمربوب بصفة الرب والمعاني في صور الأجسام كالعلم في صورة اللبن والثبات في الدين في صورة القيد والايمان في صورة العروة والإسلام في صورة العمد والأعمال في صور الأشخاص من الجمال والقبح فذلك هو الكدر الذي يلحق العلم فيحتاج من ظهر له هذا إلى قوة إلهية تعديه من هذه الصورة إلى المعنى الذي ظهر في هذه الصورة فيتعب وسبب ذلك حضرة الخيال والتمثل والقوة المفكرة وأصل ذلك هذا الجسم الطبيعي وهو المعبر عنه بالحوض في هذا المنزل وقعر هذا الحوض هو خزانة الخيال وكدر ماء هذا الحوض المستقر في قعره هو ما يخرجه الخيال والتخيل عن صورته فيطرأ التلبيس على الناظر بما ظهر له فما يدري أي معنى لبس هذه الصورة فيتحير ولا يتخلص له ذلك أبدا من نظره إلا بحكم الموافقة وهو على غير يقين محقق فيما أصاب من ذلك إلا بأخبار من الله ولهذا\n\n\nلما قام أبو بكر الصديق في هذا المقام وسأل تعبير الرؤيا وأمره النبي صلى الله عليه وسلم بتعبيرها فلما فرغ سأل النبي صلى الله عليه وسلم فيما عبره هل أصاب أو أخطأ فقال له رسول الله صلى الله عليه وسلم أصبت بعضا وأخطأت بعضا\n\n\nفما علم الصديق إصابته للحق في ذلك من خطئه فلهذا قلنا إن المصيب في مثل هذا ليس على يقين فيما أصابه فلهذا جنح العارفون وامتنعوا أن يأخذوا العلم إلا من الله بطريق الوهب الذي طريقه في الأولياء الذكر لا الفكر فإن أعطوا المعاني مجردة وبرزت لهم المعلومات بذواتها في صورها التي هي حقائقها فهو المقصود وإن أبرزها الحق لهم عند الذكر وهذا الطلب في غير صورها وحجب عنهم ذواتها أعطوا من القوة والنور النفوذ في تلك الصور إلى ما وراءها وهو الذي أريدت له هذه الصور وقيد بها فمشهوده على كل حال المعاني التي هي المقصود وهي في عالم الألفاظ والعبارات بمنزلة المنصوص والمحكم الذي لا إشكال فيه ولا تأويل والآخر بمنزلة الظواهر التي تحمل المعاني المتعددة\nوما يعرف الناظر مقصد المتكلم بها منها\n\n\n### [العلوم الوهبي يشبه بالحوض‏]\n\n\nواعلم أن هذه العلوم إذا أعطاها الله العبد في غير صورها وأعلمه ما أراد بها فوقف على عينها من تلك الصورة في تلك الصورة فهو المشبه بالحوض لأنه يدرك الماء ويدرك الكدر الذي في قعر الحوض ويلبس الماء ولا بد في ناظر العين لون ذلك الكدر حمرة كان أو صفرة أو ما كان من الألوان فتبصر الماء أحمر أو أصفر وغير ذلك من الألوان ولهذا قال الجنيد وقد سئل عن المعرفة والعارف فقال لون الماء لون إنائه ولما قبل الماء هذا اللون صار في العين مركبا من متلون ولون وهو في نفس الأمر شي‏ء آخر فيعلم الماء ويعلم أن ذلك لون الوعاء كذلك التجليات في المظاهر الإلهية حيث كانت فأما العارف فيدركها دائما والتجلي له دائم والفرقان عنده دائم فيعرف من تجلى ولما ذا تجلى ويختص الحق دون العالم بكيف تجلى لا يعلمه غير الله لا ملك ولا نبي فإن ذلك من خصائص الحق لأن الذات مجهولة في الأصل فعلم كيفية تجليها في المظاهر غير حاصل ولا مدرك لأحد من خلق الله هذا هو العلم الذي لا ينتج غيره فهو منقطع النسل لا عقب له وما عدا هذا من العلوم فقد يكون العلم بالنظر فيه ينتج علما آخر ولا يكون إلا هكذا وهو الأكثر بل هو الذي بأيدي الناس فإن المقدمات إن لم يحصل لك العلم بها وبما ينتج منها مما لا ينتج وبالسبب الرابط بينهما فبعد حصول هذا العلم ينتج لك العلم بما أعطاه هذا التركيب الخاص وهو التناسل الذي يكون في العلوم بمنزلة التناسل الذي يكون في النبات والحيوان وهذا هو تناسل المعاني ولهذا قبلت المعاني الصور الجسدية لأن الأجسام محل التوالد فإن قلت فالذي يكون من العلوم لا ينتج فكان ينبغي أن لا يقبل الصورة قلنا إنما قبل الصورة من كونه نتيجة عن منتج ونتاج وهو في نفسه عقيم لا ينتج أصلا كالعقيم الذي يكون في الحيوان مع كونه متولدا من غيره ولكن لا يولد له لأنه على صفة قامت به تقتضي له ذلك ولذلك جاء الحق في تنزيه نفسه عن الأمرين فقال لَمْ يَلِدْ ولَمْ يُولَدْ وهذا تنزيه الذات فلا تتعلق ولا يتعلق بها والنتاج إنما وقع وظهر في المرتبة فطلب الرب المربوب والقادر المقدور فإن قلت فإذا كان الأمر على ما ذكرت في لَمْ يَلِدْ ولَمْ يُولَدْ فكانت المظاهر تبطل وهي موجودة فما جوابك قلنا المظاهر للمرتبة لا للذات فلا يعبد إلا من كونه إلها ولا يتخلق بأسمائه وهي عين العبادة له إلا من كونه إلها ولا يفهم من مظاهره في مظاهره إلا كونه إلها فاعلم ذلك ولو كانت المظاهر تظهرها الذات من كونها ذاتا علمت ولو علمت أحيط بها ولو أحيط بها حدت ولو حدت انحصرت ولو انحصرت ملكت وذات الحق تتعالى علوا كبيرا عن هذا كله فعلمنا أنه ليس بين الذات وبين هذه المظاهر نسبة يتعلق العلم بها من حيث نسبة المظهر إليها أصلا وإذا لم يحصل مثل هذا العلم في نفوس العلماء بالله وتعالى عن ذلك فأبعد وأبعد أن تعلم نسبة الذات إلى المظاهر فإن قلت إن النسبة واحدة ولكن لها طرفان من حيث الذات طرف ومن حيث المظهر طرف قلنا ليس الأمر كما تظن في إن النسبة واحدة بين المتضايفين فإن نسبة الولد إلى الوالد نسبة بنوة والبنوة انفعال ونسبة الوالد إلى الولد نسبة أبوة والأبوة فاعلية وأين أن يفعل من أن ينفعل هيهات فليست النسبة واحدة ولا لها طرفان أصلا فإنها غير معقولة الانقسام أعني هذه النسبة الخاصة وهو الطرف الذي جعلته أنت للنسبة بخيالك فذلك الطرف هو النسبة التي تذكر إذ الطرفان للشي‏ء الموصوف بهما يؤذنان بقسمته والمعنى لا ينقسم فإنه غير مركب والذي ينتجه هذا العلم المشبه بالحياض مناجاة الحق من جهة الصدر وهو مناجاتك إياه في صدورك عنه حين أمرك بالخروج إلى عباده بالتبليغ إن كنت رسولا وبالتثبيت إن كنت وارثا وهذه المناجاة لا تكون منه إليك إلا فيك لا في غيرك فمنك تعرفه لا من غيرك لأنك الحجاب الأقرب والستر المسدل عليه ومن كونك سترا وحجابا حددته فمعرفتك به في هذا الموطن عين عجزك عن معرفته وإن شئت قلت عين الجهل به ونريد بالجهل عدم‏\n\n\nالعلم وأما الغير فحجاب أبعد بالنظر إليك فإن الله ما وصف نفسه إلا بالقرب إليك وهكذا قربه من غيرك إلى ذلك الغير كقربه إليك فوصفه بالقرب إليك أبعد بالنظر إلى غيرك إذا أراد العلم به منك كما أنت إذا أردت العلم به من غيرك قال تعالى ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ فأثبت قربه إلى الأشياء ونفى العلم بكيفية قربه من الأشياء بقوله تعالى ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ فعم البصيرة والبصر إذ كان إدراك البصر في الباطن يسمى بصيرة والذات واحدة واختلف عليها المواطن فسمى في إدراك المحسوس بصرا وفي إدراك المعاني بصيرة فالمدرك واحد العين فيهما ولما كان على الحوض الذي يكون في‏\nالدار الآخرة كئوس كثيرة على عدد الشاربين منه وأن الماء في الإناء على صورة الإناء شكلا ولونا علمنا قطعا إن العلم بالله سبحانه على قدر نظرك واستعدادك وما أنت عليه في نفسك فما اجتمع اثنان قط على علم واحد في الله من جميع الجهات لأنه ما اجتمع في اثنين قط مزاج واحد ولا يصح لأنه لا بد في الاثنين مما يقع به الامتياز لثبوت عين كل واحد ولو لم يكن كذلك لم يصح أن يكونا اثنين فما عرف أحد من الحق سوى نفسه فإذا عامل من تجلى له بما عامله به وقد ثبت أن عمله يعود عليه لن ينال الله من ذلك شي‏ء\n\n\nقال صلى الله عليه وسلم إنما هي أعمالكم ترد عليكم‏\n\n\nفيكسوكم الحق من أعمالكم حللا على قدر ما حصنتموها واعتنيتم بأصولها فمن لابس حريرا ومن لابس مشاقة كتان وقطن وما بينهما فلا تلم إلا نفسك ولا تلم الحائك فما حاك لك إلا غزلك فإن قلت كيف تقول لن ينال الله من ذلك شي‏ء وقد قال سبحانه يَنالُهُ التَّقْوى‏ مِنْكُمْ فلتعلم إن المراد بإثبات النيل هنا وعدم النيل في جانب الحق إن الله سبحانه ما يناله شي‏ء من أعمال الخلق مما كلفهم العمل فيه نيل افتقار إليه وتزين به ليحصل له لذلك حالة لم يكن عليها ولكن يناله التقوى وهو أن تتخذوه وقاية مما أمركم أن تتقوه به على درجات التقوى ومنازله فقد قال فَاتَّقُوا النَّارَ واتَّقُوا الله وقُوا أَنْفُسَكُمْ وأَهْلِيكُمْ فمعنى يَنالُهُ التَّقْوى‏ أنه يتناولها منك ليلبسك إياها بيده تشريفا لك حيث خلع عليك بغير واسطة إذ لبسها غير المتقي من غير يد الحق وسواء كانت الخلعة من رفيع الثياب أو دنيئها فذلك راجع إليك فإنه ما ينال منك إلا ما أعطيته وإن جمع ذلك التقوى فإنه لا يأخذ شيئا سبحانه من غير المتقي فلهذا وصف نفسه بأن التقوى تناله من العباد وإنما وصف الحق سبحانه بأن التقوى تصيبه واللحوم والدماء لا تصيبه لما كانت الإصابة بحكم الاتفاق لا بحكم القصد أضاف النيل إلى المخلوق لأنه يتعالى أن يعلم فيقصد من حيث يعلم ولكن إنما يصاب بحكم الاتفاق مصادفة والحق منزه أن يعلم الأشياء بحكم الإصابة فيكون علمه للأشياء اتفاقا فإذا ناله التقوى من المتقي وخدم بين يديه وجعل ذاته بين يديه مستسلما لما يفعله فيه فيخلع سبحانه عند ذلك من العلم على المتقي ومن شأن هذا العلم أن يحصل من الله تعالى للعبد بكل وجه من وجوه العطاء حتى يأخذ كل آخذ منه بنصيب فمنهم من يأخذه من يد الكرم ومنهم من يأخذه من يد الجود ومنهم من يأخذه من يد السخاء ومنهم من يأخذه من يد المنة والطول إلا الإيثار فإنه ليس له يد في هذه الحضرة الإلهية إذ كان لا يعطي عن حاجة لكن الأسماء الإلهية لما كانت تريد ظهور أعيانها في وجود الكون وأحكامها يتخيل أن إعطاءها من حاجة إلى الأخذ عنها\n\n\nفتتنسم من هذا رائحة الإيثار وليس بصحيح وإنما وقع في ذلك طائفة قد أعمى الله بصيرتهم ولذلك العارفون اتصفوا بأصناف العطاء في التخلق بالأسماء لا بالإيثار فإنهم في ذلك أمناء لا يؤثرون إذ لا يتصور الإيثار الحقيقي لا المجازي عندهم والعارف لا يقول أعطيتكم وإنما يقول أعطيتك لأنه لا يشترك اثنان في عطاء قط فلهذا يفرد ولا يجمع فالجمع في ذلك توسع في الخطاب والحقيقة ما ذكرناه وللكلام في هذا المنزل مجال رحب لا يسعه الوقت والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n> منازل الحوض وأسراره *** مراتب العلم وأنواره‏\n\n\n> وهو من العلم الذي لم يزل *** صفاؤه شيب بأكداره‏\n\n\n> محله الطبع الذي رتقه *** يلحقه القعر بإغباره‏\n\n",
    "en": "Chapter Two Hundred and Seventy-Six: Concerning the Gnosis of the Station of the Basin (منزل الحوض) and its Secrets, from the Muhammadan Station (المقام المحمدي)\n\nThe Basin (الحوض) is a station where water is described by turbidity,\nAnd these are the sciences (العلوم) specific to humankind.\n\nThe water itself is pure in the eye (of reality), having no turbidity,\nBut the bottom (القعر) reveals the sediment (الكدر) contained within it.\n\nThe cause of the cloudiness (الرنق) is that the Intellect (الفكر) produces it,\nSo seek the Knowledge (العلم) that transcends the Intellect.\n\nWhen Imagination (الخيال) receives (the knowledge), it binds it\nWith the Intellect (الفكر) in the world of bodies (الأجساد) and forms (الصور).\n\nAnd the Intellect sometimes frees (knowledge) from its forms,\nBut it is not infallible (غير معصوم) from error (الضرر).\n\nSo seek it through Remembrance (الذكر), not through Intellect (الفكر), that you may attain it\nTranscendently pure, free from the taint of otherness (الغير).\n\n### [Knowledge is of Two Kinds: Gifted and Acquired]\n\nKnow, O intimate friend—may Allah illuminate your insight (بصيرتك) and perfect your inner being (سريرتك)—that Knowledge (العلوم) is of two kinds:\n\n1.  **Gifted (موهوبة):** This is referred to in His saying, the Exalted: <<they would have eaten from above them>> (لَأَكَلُوا من فَوْقِهِمْ). This is the result of piety (التقوى), as He, the Exalted, said: <<And fear Allah, and Allah teaches you>> (واتَّقُوا الله ويُعَلِّمُكُمُ الله) and <<If you fear Allah, He will grant you a Criterion [Furqan]>> (إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً). And He said: <<The Most Merciful taught the Qur'an>> (الرَّحْمنُ عَلَّمَ الْقُرْآنَ).\n\n2.  **Acquired (مكتسبة):** This is indicated by His saying, the Exalted: <<and from beneath their feet>> (ومن تَحْتِ أَرْجُلِهِمْ), referring to their toil and striving (اجتهادهم). These are the people of moderation (أهل الاقتصاد).\n\nThe pronoun in \"their feet\" refers back to those who ate from above them, who are those who upheld the Book of Allah and what was revealed to them from their Lord. They are those who hasten to good deeds (الْخَيْراتِ) and are foremost in them (هُمْ لَها سابِقُونَ). Among them are those who preceded others in good deeds, and among them are those who raised the Book from its slumber. For the interpretation (التأويل) by scholars had laid it down after it had been standing. Then came those whom Allah guided, and they raised it from its slumber—meaning, they purified it from their interpretation and the artificiality of their intellect (فكر). So, they stood in the worship of their Lord and asked Him to inform them of His intent behind those words contained in the Book, and to grant them definition from meanings purified of material substances.\n\nThus, Allah gave them Knowledge (العلم) unadulterated. He, the Exalted, said: <<And none knows its interpretation save Allah and those firmly rooted in Knowledge>> (وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله والرَّاسِخُونَ في الْعِلْمِ). The Real (الحق) teaches them what this revealed, inscribed word ultimately signifies, and the meanings deposited within it, without intellectual reflection (فكر) upon it. This is because the Intellect (الفكر) itself is not infallible (غير معصوم) from error (الغلط) for anyone.\n\nThis is why He said: <<And those firmly rooted in Knowledge say: 'Our Lord, do not let our hearts deviate'>> (الرَّاسِخُونَ في الْعِلْمِ يَقُولُونَ ... رَبَّنا لا تُزِغْ قُلُوبَنا)—meaning, through intellectual reflection upon what You have revealed—<<after You have guided us>> (بَعْدَ إِذْ هَدَيْتَنا) to receive the knowledge of what You revealed to us directly from You. <<And grant us mercy from Your Presence; indeed, You are the Bestower [al-Wahhab]>> (وهَبْ لَنا من لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ). They asked Him from the side of the Gift (الوهب), not from the side of Acquisition (الكسب).\n\nThis is why we made the pronoun refer back to those who ate from above them. He says: \"And from beneath the feet of these [foremost ones] are nations: <<among them is a moderate nation>> (مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ).\" These are the people of Acquisition (أهل الكسب). They are those who interpret (يتأولون) the Book of Allah but do not uphold it with the action for which it was revealed, nor do they observe proper etiquette in receiving it.\n\nThey are of two types: The few among them are moderate (المقتصد) in this, meaning they approach the Truth (الحق) closely, and they may hit upon the Truth in their interpretation by way of coincidence (الموافقة), not by way of certainty (القطع). For no one knows Allah's specific intent in what He revealed except through the path of the Gift (الوهب), which is the Divine Disclosure (الإخبار الإلهي) by which the Real (الحق) addresses the heart of the servant in secret, between Him and the servant.\n\nAs for those who are not moderate in this and delve deeply into interpretation—either by leaving no connection between the revealed word and the meaning, or by establishing the word based on analogy (التشبيه) and not referring the knowledge of that back to Allah—these are the ones concerning whom Allah said in the same verse: <<and many of them—evil is what they do>> (وكَثِيرٌ مِنْهُمْ ساءَ ما يَعْمَلُونَ). What evil is greater than this? These are the second type.\n\nWhen the Messenger witnessed this matter, having been sent as a Mercy (رحمة) with what was revealed to him, and saw that the majority were not touched by this Mercy, and that the cause of this was their interpretation, either through analogy or by being entirely distant from the meaning indicated by the word, he became perplexed regarding the transmission (التبليغ) and paused until he saw whether his Lord would obligate him to continue or not.\n\nThen Allah, the Exalted, revealed: <<O Messenger, convey what has been revealed to you from your Lord>> (يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ). And it was said to him: <<For upon you is only the transmission>> (فَإِنَّما عَلَيْكَ الْبَلاغُ). And it was said to him: <<Their guidance is not upon you>> (لَيْسَ عَلَيْكَ هُداهُمْ) regarding the good and evil that proceeds from them. And it was said to him: <<Indeed, you do not guide whom you love, but Allah guides whom He wills>> (إِنَّكَ لا تَهْدِي من أَحْبَبْتَ ولكِنَّ الله يَهْدِي من يَشاءُ).\n\nThe Messenger thus knew that what was required of him was only the transmission. So, he conveyed (صلى الله عليه وسلم) and concealed nothing of what he was commanded to transmit. He is certainly infallible (معصوم) and protected (محفوظ) in conveying from his Lord what he was commanded to transmit. As for what was specific to him, he acted upon it according to what his own insight (نظره) required.\n\nThus, the interpretation of the verse <<and from beneath their feet>> (ومن تَحْتِ أَرْجُلِهِمْ) is: nations, <<among them is a moderate nation>> (مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ) and <<and many of them—evil is what they do>> (وكَثِيرٌ مِنْهُمْ ساءَ ما يَعْمَلُونَ). This is why He said to His Prophet: <<And if you obey most of those on earth, they will mislead you from the path of Allah>> (وإِنْ تُطِعْ أَكْثَرَ من في الْأَرْضِ يُضِلُّوكَ عَنْ سَبِيلِ الله). And He said: <<None knows them except a few>> (ما يَعْلَمُهُمْ إِلَّا قَلِيلٌ).\n\nThe noblest of sciences (أشرف العلوم) is that which the servant attains through the path of the Gift (الوهب). Although the Gift requires the preparedness (استعداد) of the recipient through the pure, prescribed deeds with which he is characterized, yet because this is not a condition for the attainment of this Knowledge, this Knowledge (العلم) is therefore exalted above Acquisition (الكسب).\n\nSome prophets attained Prophethood (النبوة) without having performed prescribed deeds to prepare them for its acceptance. Others may have performed prescribed deeds, and that was the very preparedness. Thus, one who lacks gnosis (معرفة) might imagine that without that preparedness, Prophethood would not have occurred, and he might imagine that it is acquired (اكتساب). But Prophethood (النبوة) itself is a Divine Selection (اختصاص إلهي) that He grants to whomever He wills among His servants, who may have no prior knowledge of law or anything else, and who does not know who he is or what the matter entails. If preparedness were to produce this Knowledge, it would be found in all the prophets, but the matter is not so. Prophethood is not acquired (غير مكتسبة), without dispute among the People of Unveiling (أهل الكشف) from the People of Allah. Although the people of Intellect (أهل الفكر) among the rationalists have differed on this, this is, for us, the strongest evidence that the Intellect (الفكر) sometimes hits the mark and sometimes errs, but its error is greater than its hitting the mark. This is because the Intellect has a limit where it stops. Whenever it stops at its limit, it must be correct. But whenever it exceeds its limit into what belongs to the domain of another power granted to certain servants, it may err or be correct. May Allah protect us and you from the errors of thoughts (غلطات الأفكار) and make us, by His grace, among those who remember and are remembered (الذاكرين المذكورين). There is no Lord but Him.\n\nWe have a poem concerning what we just mentioned, which I wrote to some brethren in Mosul in the year 601 AH, regarding Prophethood being a Divine Selection (اختصاص) and that its purity is therefore untainted by turbidity (كدر):\n\nBehold, the Message (الرسالة) is of the Isthmus (برزخية),\nAnd its possessor has no need for intention (نية).\n\nIf his constitution (بنيته) gives its strength,\nThe constitution receives it with its own power.\n\nIndeed, the Selection (الاختصاص) is tied to it,\nAs the Ash'aris have indicated.\n\nThis is the Truth (الحق), and there is no obscurity in it,\nSo abandon the judgments of philosophical books.\n\n(In many verses, but we intended only the matter required by this station.) And know that the cause of the appearance of turbidities (الأكدار) is the settling and stillness of the water, due to seeking rest from movement in an improper place and location. That is why we used the Basin (الحوض) as a metaphor for this state, because it is where the water settles and becomes still.\n\nWe have said in the chapter on Love Poetry (الغزل والنسيب), describing the transcendence of the Beloved (المعشوق) in Himself:\n\nIt gives spirit to everyone who is attached to it,\nA transference away from the levels of humanity (مراتب البشر).\n\nOut of jealousy that its purity (رائقها) might be tainted\nBy the turbidity (كدر) found in the Basins (الحياض).\n\nI mean that if the lover (المحب) falls in love with one whose description is this, the Beloved (المعشوق) rules over him, transferring him to Himself and clothing him in His garments. Thus, He removes him from the turbidity of ambiguities (كدر الشبه) required by the natural world (عالم الطبيعة)—if the Beloved is Knowledge (علما). And He removes him from doubts and the forbidden (الشبهات والحرام)—if the Beloved is Action (عملا). And He removes him from natural desires (الشهوات الطبيعية)—if the Beloved is a spirit abstracted from materials. And He removes him from humanity (البشرية)—if the Beloved is an angel. And He removes him from everything other than Allah—if the Beloved is Allah.\n\nThe truthful lover (المحب الصادق) is he who transfers to the attribute of the Beloved, not he who brings the Beloved down to his own attribute. Do you not see that when the Real (الحق), the Glorified, loved us, He descended to us in His subtle kindnesses (ألطافه الخفية) in a manner suitable for us, though His Majesty and Grandeur (كبرياؤه) transcend that? He descended to showing affection (التبشبش) to us when we come to His House intending intimate communion (مناجاته). And to rejoicing at our repentance and return to Him after our turning away. And to wondering at the lack of passion in a youth for a youth, who is in the domain of the rule of passion's sultanate (even though that is by His enabling). And to acting as our representative in our hunger, thirst, and sickness, placing Himself in our position.\n\nWhen one of His servants was hungry, He said to others: \"I was hungry, but you did not feed Me.\" When another of His servants was thirsty, the Glorified said to another servant: \"I was thirsty, but you did not give Me drink.\" When another of His servants was sick, He said to another servant: \"I was sick, but you did not visit Me.\" If these servants ask Him about all this, He tells them: \"Did you not know that so-and-so was sick? Had you visited him, you would have found Me with him. Did you not know that so-and-so was hungry? Had you fed him, you would have found that with Me. Did you not know that so-and-so was thirsty? Had you given him drink, you would have found that with Me.\" (And the report is authentic.)\n\nThis is the fruit of love, where He descended to us. Therefore, we said that sincerity in love causes the lover to be characterized by the attribute of the Beloved. Likewise, the servant who is sincere in his love for his Lord takes on His Names (يتخلق بأسمائه): becoming characterized by independence (الغنى) from everything other than Allah, by might (العز) through Allah, by giving (العطاء) with the Hand of Allah, and by preservation (الحفظ) with the Eye of Allah. Scholars have known the process of taking on the character of Allah's Names (التخلق بأسماء الله) and have compiled volumes on it. The reason for this is that when they loved Him, they were characterized by His Attributes to the extent appropriate for them.\n\nThen we return to our subject and say: Allah speaks the Truth (الحق) and guides to the Way (السبيل).\n\nKnowledge (العلوم)—and by this, I mean the known things (المعلومات)—if they appear in their essences (بذواتها) to Knowledge (للعلم) and Knowledge perceives them exactly as they are in their essences, then that is sound Knowledge (العلم الصحيح) and perfect Perception (الإدراك التام) in which there is absolutely no ambiguity. This applies whether the known thing is Existence (وجود) or non-existence (عدم), negation (نفي) or affirmation (إثبات), dense (كثيف) or subtle (لطيف), Lord (رب) or creature (مربوب), letter (حرف) or meaning (معنى), body (جسم) or spirit (روح), composite (مركب) or simple (مفرد), or what composition produces, or a relation (نسبة), or an attribute (صفة), or a qualified thing (موصوف).\n\nWhenever any of the aforementioned things fails to manifest to Knowledge in its essence, but manifests to it in a form other than its own—such as non-existence manifesting in the form of Existence (وبالعكس), or negation in the form of affirmation (وبالعكس), or the subtle in the form of the dense (وبالعكس), or the Lord with the attribute of the creature, or the creature with the attribute of the Lord, or meanings in the forms of bodies (الأجسام), such as Knowledge in the form of milk, steadfastness in religion in the form of a shackle, faith in the form of a handle, Islam in the form of pillars, and deeds in the forms of beautiful or ugly persons—that is the turbidity (الكدر) that afflicts Knowledge.\n\nOne to whom this appears needs a Divine Power (قوة إلهية) that transports him from this form to the meaning that appeared in this form. This causes him effort. The cause of this is the Presence of Imagination (حضرة الخيال), representation (التمثل), and the thinking faculty (القوة المفكرة). The origin of this is the natural body (الجسم الطبيعي), which is symbolized by the Basin (الحوض) in this station. The bottom (قعر) of this Basin is the treasury of Imagination (خزانة الخيال). The turbidity (كدر) of the water settled at the bottom of this Basin is what Imagination and imagining extract from its true form. This causes confusion (التلبيس) for the observer regarding what has appeared to him. He does not know which meaning has clothed itself in this form, and he becomes perplexed. This will never be resolved for him through his own observation except by way of coincidence (الموافقة), and he is not upon verified certainty (يقين محقق) regarding what he has correctly perceived, except through information (إخبار) from Allah.\n\nThis is why, when Abu Bakr al-Siddiq stood in this station and asked for the interpretation of a dream, and the Prophet (صلى الله عليه وسلم) commanded him to interpret it, when he finished, he asked the Prophet (صلى الله عليه وسلم) whether he had been correct or mistaken in his interpretation. The Messenger of Allah (صلى الله عليه وسلم) told him: \"You were correct in some parts and mistaken in others.\"\n\nAl-Siddiq did not know which part of his interpretation was correct and which was mistaken. Therefore, we said that the one who is correct in such matters is not upon certainty regarding what he has attained. For this reason, the Gnostics (العارفون) inclined toward and refrained from taking Knowledge except directly from Allah through the path of the Gift (الوهب), whose method for the saints (الأولياء) is Remembrance (الذكر), not Intellect (الفكر). If they are given the meanings abstracted (مجردة) and the known things manifest to them in their essences (بذواتها) in their true forms (حقائقها), that is the goal. If, however, the Real (الحق) manifests them to them during Remembrance (الذكر) and this seeking, but in forms other than their own, and conceals their essences from them, they are granted the power and light to penetrate those forms to what lies beyond them—which is what those forms were intended for and bound by. In every case, what they witness (مشهوده) are the meanings that are the goal. These meanings are, in the world of words and expressions, equivalent to the explicit, unambiguous text (المنصوص والمحكم) that has no ambiguity or interpretation (تأويل). The other case (the forms) is equivalent to the apparent meanings (الظواهر) that bear multiple meanings, and the observer does not know the speaker's intent among them.\n\n### [Gifted Knowledge is likened to the Basin]\n\nKnow that when Allah grants this Knowledge (العلوم) to the servant in forms other than its own, and informs him of what He intended by it, so that the servant grasps its essence (عينها) within that form, this is likened to the Basin (الحوض). This is because he perceives the water and perceives the turbidity (الكدر) at the bottom of the Basin. The water inevitably takes on the color of that turbidity in the eye of the observer—be it red, yellow, or any other color. Thus, you see the water as red or yellow, and so on.\n\nThis is why Junayd, when asked about Gnosis (المعرفة) and the Gnostic (العارف), said: \"The color of the water is the color of its vessel.\" When the water accepted this color, it became, in the eye, a composite of the colored thing and the color, though in reality, it is something else. So, one knows the water and knows that the color belongs to the vessel. The same applies to the Theophanies (التجليات) in the Divine Manifestations (المظاهر الإلهية), wherever they may be.\n\nAs for the Gnostic (العارف), he perceives them constantly, and the Theophany (التجلي) is constant for him, and the Criterion (الفرقان) is constant with him. He knows Who is manifesting (من تجلى) and why He is manifesting (لما ذا تجلى). But the Real (الحق) alone, exclusive of the cosmos, knows *how* He manifests (كيف تجلى). No one else knows this—neither angel nor prophet—for that is among the specific characteristics of the Real. Since the Essence (الذات) is fundamentally unknown, the knowledge of the *how* of its Theophany in the Manifestations is not attained or perceived by any of Allah's creation.\n\nThis is the Knowledge (العلم) that produces nothing else; it is sterile (منقطع النسل), having no offspring. Everything other than this Knowledge may produce another knowledge through reflection upon it. This is necessarily the case, and it is the majority of what people possess. If you do not attain knowledge of the premises, and what they produce and what they do not produce, and the connecting cause between them, then after attaining this knowledge, it produces for you the knowledge of what this specific composition yields. This is the procreation (التناسل) in the sciences, analogous to the procreation in plants and animals. This is the procreation of meanings. This is why meanings accepted bodily forms (الصور الجسدية), because bodies are the locus of generation (محل التوالد).\n\nIf you say: \"Then the Knowledge that is sterile (لا ينتج) should not accept form,\" we reply: It only accepted form because it is a result (نتيجة) of a producer and a product, yet it is sterile (عقيم) in itself, producing nothing, like the sterile creature in the animal kingdom, which is generated by others but does not generate, because it possesses an attribute that necessitates this state for it. Therefore, the Real (الحق) came in the Qur'an to purify Himself from both aspects, saying: <<He neither begets nor is begotten>> (لَمْ يَلِدْ ولَمْ يُولَدْ). This is the purification of the Essence (الذات). It neither relates nor is related to. Procreation (النتاج) only occurred and appeared in the Level (المرتبة), so the Lord sought the creature (المربوب), and the Powerful sought the determined thing (المقدور).\n\nIf you say: \"If the matter is as you described in <<He neither begets nor is begotten>>, then the Manifestations (المظاهر) should be nullified, yet they exist. What is your answer?\" We say: The Manifestations belong to the Level (المرتبة), not to the Essence (الذات). He is only worshipped by virtue of His being God (إلها). One only takes on the character of His Names—which is the very essence of worshipping Him—by virtue of His being God. And one only understands from His Manifestations in His Manifestations that He is God. Know this.\n\nIf the Manifestations were manifested by the Essence (الذات) by virtue of its being the Essence, it would be known. If it were known, it would be encompassed. If it were encompassed, it would be limited. If it were limited, it would be possessed. But the Essence of the Real (ذات الحق) is exalted far above all this. Thus, we know that there is no relation (نسبة) between the Essence and these Manifestations by which Knowledge can relate to the Manifestation's relation to the Essence at all. If such Knowledge is not attained in the souls of the Gnostics of Allah (علماء بالله)—and He is far exalted above that—then it is even further removed that one should know the relation of the Essence to the Manifestations.\n\nIf you say that the relation (النسبة) is one, but has two sides: one side from the Essence and one side from the Manifestation, we say: The matter is not as you suppose, that the relation between two correlatives (المتضايفين) is one. For the relation of the child to the parent is the relation of sonship (بنوة), and sonship is passivity (انفعال). The relation of the parent to the child is the relation of fatherhood (أبوة), and fatherhood is activity (فاعلية). How far apart are acting and being acted upon! Thus, the relation is not one, nor does it have two sides at all, for it is not rationally conceivable to be divided. I mean this specific relation. The side that you posited for the relation by your Imagination (خيالك)—that side is the relation that is mentioned, since the two sides of a thing described by them imply its division, and the meaning (المعنى) is indivisible, for it is not composite.\n\nWhat this Knowledge, likened to the Basins (الحياض), produces is the intimate communion (مناجاة) with the Real (الحق) from the side of the breast (الصدر). This is your intimate communion with Him when you proceed from Him, when He commanded you to go out to His servants with transmission (التبليغ), if you are a Messenger, or with confirmation (التثبيت), if you are an heir. This intimate communion does not occur from Him to you except *in* you, not in anything else. You know Him from yourself, not from another, because you are the nearest Veil (الحجاب الأقرب) and the curtain drawn over Him. By virtue of your being a veil and a curtain, you have limited Him. Your gnosis of Him in this station is the very essence of your inability to know Him. Or, if you wish, you may say it is the very essence of ignorance (الجهل) of Him—and by ignorance, we mean the absence of Knowledge (عدم العلم).\n\nAs for the other (الغير), it is a further veil compared to you. For Allah only described Himself by proximity to you. Likewise, His proximity to the other is like His proximity to you. His description of proximity to you is further removed when considering the other, if the other seeks Knowledge of Him from you, just as you seek Knowledge of Him from the other. He, the Exalted, said: <<And We are nearer to him than his jugular vein>> (ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ). Thus, He affirmed His proximity to things. But He negated the knowledge of the *how* of His proximity to things by His saying, the Exalted: <<And We are nearer to him than you, but you do not see>> (ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ). This encompasses both insight (البصيرة) and sight (البصر), since the perception of sight in the inner realm is called insight (بصيرة). The Essence (الذات) is one, but the stations differ for it. So, in the perception of the sensible, it is called sight (بصر), and in the perception of meanings, it is called insight (بصيرة). The perceiver is one and the same in both.\n\nSince the Basin (الحوض) in the Hereafter will have many cups (كئوس) corresponding to the number of those who drink from it, and since water in a vessel takes the shape and color of the vessel, we know with certainty that the Knowledge of Allah, the Glorified, is according to your perspective (نظرك), your preparedness (استعدادك), and what you are in yourself. No two people have ever agreed upon a single Knowledge concerning Allah in all aspects, because no two people have ever possessed the same temperament (مزاج واحد), nor is it possible, for there must be something in the two that causes distinction (الامتياز) for the establishment of the essence (عين) of each one. If it were not so, they could not be two.\n\nThus, no one knows anything of the Real (الحق) except his own self. If he treats the one who manifests to him according to how He treated him, and since it is established that his deed returns upon him, nothing of that reaches Allah. The Prophet (صلى الله عليه وسلم) said: <<They are only your deeds that are returned to you>> (إنما هي أعمالكم ترد عليكم). The Real (الحق) clothes you in garments (حللا) derived from your deeds, according to how well you perfected them and cared for their foundations. So, some wear silk, and some wear coarse linen and cotton, and everything in between. Therefore, blame no one but yourself, and blame not the weaver, for he wove nothing but your own thread.\n\nIf you say: \"How can you say 'nothing of that reaches Allah' when He, the Glorified, said: <<It is piety [al-Taqwa] from you that reaches Him>> (يَنالُهُ التَّقْوى‏ مِنْكُمْ)?\" Know that the intent in affirming the reaching (النيل) here and denying the reaching in the side of the Real (الحق) is that Allah, the Glorified, is not reached by anything from the deeds of creation—meaning, a reaching of need (نيل افتقار) for Him or adornment by it, so that He might attain a state He was not previously upon. Rather, what reaches Him is the piety (التقوى)—meaning, that you take Him as a shield (وقاية) against what He commanded you to guard against, according to the degrees and stations of piety. He said: <<So fear the Fire>> (فَاتَّقُوا النَّارَ) and <<And fear Allah>> (واتَّقُوا الله) and <<Protect yourselves and your families>> (قُوا أَنْفُسَكُمْ وأَهْلِيكُمْ).\n\nThus, the meaning of <<piety reaches Him>> (يَنالُهُ التَّقْوى‏) is that He takes it from you in order to clothe you with it by His Hand, as an honor to you, since He bestows the robe of honor upon you without intermediary. The non-pious person wears it without the Hand of the Real. Whether the robe is of fine or coarse cloth, that returns to you, for He only receives from you what you give Him, even if that encompasses piety. He, the Glorified, takes nothing from the non-pious. This is why He described Himself as being reached by piety from the servants.\n\nThe Real (الحق), the Glorified, described Himself as being reached (تصيبه) by piety, but not by the flesh and blood (of sacrifices). Since the reaching (الإصابة) is by way of coincidence (الاتفاق) and not by way of intention (القصد), He attributed the reaching (النيل) to the creature, because He is exalted above being known and intended from the perspective of being known. Rather, He is reached by way of accidental coincidence (مصادفة). The Real is purified from knowing things by way of accidental hitting, such that His knowledge of things would be coincidental.\n\nWhen piety reaches Him from the pious servant, and the servant serves before Him, placing his essence before Him, submitting to what He does with him, the Glorified then bestows Knowledge (العلم) upon the pious one. The nature of this Knowledge is that it is attained from Allah, the Exalted, through every aspect of giving (وجوه العطاء), so that every recipient takes a share of it. Some take it from the Hand of Generosity (الكرم), some from the Hand of Bounty (الجود), some from the Hand of Munificence (السخاء), and some from the Hand of Favor and Grace (المنة والطول).\n\nExcept for Altruism (الإيثار), for it has no Hand in this Divine Presence (الحضرة الإلهية), since He does not give out of need. However, because the Divine Names desire the manifestation of their essences (أعيانها) in the existence of the cosmos and their rulings, it might be imagined that their giving stems from a need for the recipient. One might catch a scent of altruism from this, but it is not correct. Only a group whose insight Allah has blinded has fallen into this error. Therefore, the Gnostics (العارفون) are characterized by the various types of giving in taking on the character of the Names, but not by altruism (الإيثار), for in this, they are trustees (أمناء) and do not practice altruism, since true altruism—not metaphorical—is inconceivable to them. The Gnostic does not say, \"I gave you all (plural),\" but rather, \"I gave you (singular),\" because no two people ever share in a single gift. Therefore, he uses the singular and not the plural. The plural in this context is merely a broadening of address, but the reality is as we have stated. The discussion in this station has a wide scope that time does not permit. And Allah speaks the Truth (الحق) and guides to the Way (السبيل).\n\nThe stations of the Basin (الحوض) and its secrets\nAre the levels of Knowledge (العلم) and its lights.\n\nAnd it is of the Knowledge that has always been,\nWhose purity is mixed with its turbidities.\n\nIts locus is the Nature (الطبع) whose weaving\nThe bottom (القعر) afflicts with its dust.",
    "ur": "باب نمبر دو سو چھہتر: حوض کے مقام اور اس کے اسرار کی معرفت، جو مقام محمدی سے متعلق ہے۔\n\nحوض وہ منزل ہے جہاں پانی کو کدورت سے موصوف کیا گیا ہے\nاور یہ وہ علوم ہیں جو بشر کے ساتھ خاص ہیں۔\nچشمے میں پانی صاف ہوتا ہے، اس میں کوئی کدورت نہیں ہوتی\nلیکن تہہ وہ کدورت ظاہر کرتی ہے جو اس میں موجود ہے۔\nگدلے پن کی وجہ یہ ہے کہ فکر (الفكر) اسے پیدا کرتی ہے\nپس اس علم کو طلب کر جو فکر (الفكر) سے بلند ہو۔\nجب خیال (الخيال) آتا ہے تو وہ اسے قید کر دیتا ہے\nفکر (الفكر) کے ذریعے اجسام اور صورتوں کے عالم میں۔\nاور فکر (الفكر) کبھی ان صورتوں سے نجات دلاتی ہے\nلیکن وہ نقصان سے معصوم (محفوظ) نہیں ہے۔\nپس اسے ذکر (الذکر) سے طلب کر، نہ کہ فکر (الفكر) سے، تاکہ تو اسے حاصل کرے\nپاکیزہ، خالص، غیر کی آمیزش سے مبرا۔\n\n### [کہ علوم دو قسم کے ہیں: وہبی اور کسبی]\n\nاے قریبی ولی (الولي الحميم)! اللہ آپ کی بصیرت (البصيرة) کو منور کرے اور آپ کے باطن (السريرة) کو خوبصورت بنائے، جان لیجیے کہ علوم دو قسم کے ہیں: وہبی (موهوبة)، جس کی طرف اللہ تعالیٰ کے اس قول میں اشارہ ہے: **لَأَكَلُوا من فَوْقِهِمْ** (وہ اپنے اوپر سے کھاتے)، اور یہ تقویٰ (التقوى) کا نتیجہ ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: **واتَّقُوا الله ويُعَلِّمُكُمُ الله** (اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے)، اور فرمایا: **إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً** (اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (امتیاز) پیدا کر دے گا)، اور فرمایا: **الرَّحْمنُ عَلَّمَ الْقُرْآنَ** (رحمن نے قرآن سکھایا)۔\n\nاور دوسری قسم کسبی (مكتسبة) ہے، جس کی طرف اللہ تعالیٰ کے اس قول میں اشارہ ہے: **ومن تَحْتِ أَرْجُلِهِمْ** (اور ان کے پاؤں کے نیچے سے)، یہ ان کی محنت اور اجتہاد (الاجتهاد) کی طرف اشارہ ہے، اور یہ اہل اقتصاد (میانہ روی والے) ہیں۔ ضمیر 'أرجلهم' (ان کے پاؤں) ان لوگوں کی طرف لوٹتا ہے جنہوں نے اپنے اوپر سے کھایا، اور یہ وہ لوگ ہیں جنہوں نے اللہ کی کتاب اور جو کچھ ان کے رب کی طرف سے ان پر نازل ہوا، اسے قائم کیا۔ یہ وہ لوگ ہیں جو نیکیوں (الْخَيْراتِ) میں سبقت کرنے والے ہیں، اور وہ ان کے لیے سبقت لے جانے والے ہیں۔\n\nپس ان میں سے کچھ وہ ہیں جنہوں نے نیکیوں میں سبقت کی، اور کچھ وہ ہیں جنہوں نے کتاب کو اس کی نیند سے بیدار کر کے قائم کیا۔ کیونکہ علماء کی تاویل (التأويل) نے اسے کھڑا ہونے کے بعد سلا دیا تھا، پھر وہ شخص آیا جسے اللہ نے توفیق دی، اور اس نے اسے اس کی نیند سے بیدار کیا، یعنی اسے اپنی تاویل اور اپنی فکر (الفكر) کے ذریعے اس میں تکلف (التعمل) کرنے سے پاک کیا۔ پس وہ اپنے رب کی عبادت کے ساتھ کھڑا ہوا اور اس سے سوال کیا کہ وہ اسے ان الفاظ کے بارے میں اپنے ارادے پر مطلع کرے جو کتاب میں شامل ہیں، اور اسے ان معانی کی تعریف عطا کرے جو مادہ سے پاک ہیں۔ پس اللہ نے انہیں ایسا علم عطا کیا جو آمیزش سے پاک تھا۔\n\nاللہ تعالیٰ فرماتا ہے: **وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله والرَّاسِخُونَ في الْعِلْمِ** (اور اس کی تاویل کو اللہ کے سوا کوئی نہیں جانتا، اور علم میں رسوخ رکھنے والے (الراسخون في العلم))۔ (الحق) ذات حق انہیں سکھاتا ہے کہ یہ نازل شدہ مرقوم لفظ کس چیز کی طرف لوٹتا ہے، اور اس میں کون سے معانی ودیعت کیے گئے ہیں، بغیر اس میں فکر (الفكر) کیے، کیونکہ فکر (الفكر) بذات خود ہر کسی کے حق میں غلطی سے معصوم (محفوظ) نہیں ہے۔ اسی لیے (الراسخون في العلم) علم میں رسوخ رکھنے والے کہتے ہیں: **رَبَّنا لا تُزِغْ قُلُوبَنا** (اے ہمارے رب! ہمارے دلوں کو ٹیڑھا نہ کر)، یعنی اس چیز میں فکر (الفكر) کرنے سے جو تو نے نازل کی ہے، **بَعْدَ إِذْ هَدَيْتَنا** (اس کے بعد جب تو نے ہمیں ہدایت دی) کہ ہم تجھ سے اس علم کو حاصل کریں جو تو نے ہم پر نازل کیا ہے، **وهَبْ لَنا من لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ** (اور ہمیں اپنی طرف سے رحمت عطا فرما، بے شک تو ہی بڑا عطا کرنے والا (الوهاب) ہے)۔\n\nپس انہوں نے اللہ سے وہب (الوهب) (عطا) کے ذریعے سوال کیا، نہ کہ کسب (الکسب) (حصول) کے ذریعے۔ اسی لیے ہم نے ضمیر کو ان لوگوں کی طرف لوٹایا جنہوں نے اپنے اوپر سے کھایا۔ اللہ فرماتا ہے: اور ان کے پاؤں کے نیچے سے کئی امتیں ہیں، **مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ** (ان میں سے ایک جماعت میانہ رو ہے)، اور یہ اہل کسب (الکسب) ہیں، اور یہ وہ لوگ ہیں جو اللہ کی کتاب کی تاویل (التأويل) کرتے ہیں، اور اسے اس عمل کے ساتھ قائم نہیں کرتے جس کے لیے وہ نازل ہوئی تھی، اور نہ ہی اسے لینے میں ادب اختیار کرتے ہیں۔\n\nاور یہ دو قسموں پر ہیں: ان میں سے قلیل وہ ہیں جو اس میں میانہ رو ہیں، اور وہ وہ ہیں جو حق کے قریب پہنچے، اور کبھی وہ اپنی تاویل میں حق کو پا لیتے ہیں، لیکن یہ موافقت کے حکم سے ہوتا ہے، نہ کہ قطعیت کے حکم سے۔ کیونکہ اللہ کی مراد کو اس چیز میں جو اس نے نازل کی ہے، تعین کے ساتھ صرف وہب (الوهب) کے طریقے سے ہی جانا جا سکتا ہے، اور وہ الٰہی خبر ہے جس کے ذریعے (الحق) ذات حق بندے کے دل سے اس کے اور اس کے درمیان راز میں مخاطب ہوتا ہے۔\n\nاور جس نے اس میں میانہ روی اختیار نہیں کی اور تاویل (التأويل) میں گہرائی اختیار کی، یہاں تک کہ اس نے نازل شدہ لفظ اور معنی کے درمیان کوئی مناسبت نہیں چھوڑی، یا اس نے لفظ کو تشبیہ (التشبيه) کے طریقے پر مقرر کیا اور اس کے علم کو اللہ کی طرف نہیں لوٹایا، یہ وہ لوگ ہیں جن کے بارے میں اللہ نے اسی آیت میں فرمایا: **وكَثِيرٌ مِنْهُمْ ساءَ ما يَعْمَلُونَ** (اور ان میں سے بہت سے لوگ برے کام کرنے والے ہیں)۔ اور اس سے بڑا برا کام کیا ہو سکتا ہے؟ اور یہ دوسری قسم ہے۔\n\nجب رسول اللہ صلی اللہ علیہ وسلم نے اس معاملے کا مشاہدہ کیا، اور آپ کو اس چیز کے ساتھ رحمت بنا کر بھیجا گیا جو آپ پر نازل ہوئی، اور آپ نے دیکھا کہ بہت سے لوگوں کو یہ رحمت حاصل نہیں ہوئی، اور اس کی وجہ صرف یہ تھی کہ وہ دو طریقوں سے تاویل کرتے تھے: یا تو تشبیہ (التشبيه) کے ذریعے، یا لفظ کے مدلول سے کلی طور پر دور ہو کر، تو آپ تبلیغ (التبليغ) میں حیران ہوئے اور رک گئے، یہاں تک کہ آپ دیکھیں کہ کیا آپ کا رب آپ پر اس کا وجوب عائد کرتا ہے یا نہیں؟ پس اللہ تعالیٰ نے نازل فرمایا: **يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ** (اے رسول! جو کچھ آپ کے رب کی طرف سے آپ پر نازل کیا گیا ہے، اسے پہنچا دیجیے)۔ اور آپ سے کہا گیا: **فَإِنَّما عَلَيْكَ الْبَلاغُ** (پس آپ پر صرف پہنچا دینا ہے)۔ اور آپ سے کہا گیا: **لَيْسَ عَلَيْكَ هُداهُمْ** (ان کی ہدایت آپ پر نہیں ہے)، اس خیر و شر میں جو ان سے سرزد ہوتا ہے۔ اور آپ سے کہا گیا: **إِنَّكَ لا تَهْدِي من أَحْبَبْتَ ولكِنَّ الله يَهْدِي من يَشاءُ** (بے شک آپ جسے چاہیں ہدایت نہیں دے سکتے، لیکن اللہ جسے چاہتا ہے ہدایت دیتا ہے)۔\n\nپس رسول اللہ صلی اللہ علیہ وسلم نے جان لیا کہ آپ سے صرف تبلیغ مطلوب ہے، اور کچھ نہیں۔ پس آپ صلی اللہ علیہ وسلم نے تبلیغ کی اور جو کچھ آپ کو پہنچانے کا حکم دیا گیا تھا، اس میں سے کچھ بھی نہیں چھپایا، کیونکہ آپ اپنے رب کی طرف سے تبلیغ کے معاملے میں قطعی طور پر معصوم (محفوظ) ہیں۔ اور جو چیز آپ کے ساتھ خاص کی گئی، اس میں آپ اپنے نظر کے تقاضے کے مطابق ہیں۔ پس آیت میں تفسیر کے مطابق تقدیر یہ ہے: اور ان کے پاؤں کے نیچے سے کئی امتیں ہیں، **مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ وكَثِيرٌ مِنْهُمْ ساءَ ما يَعْمَلُونَ** (ان میں سے ایک جماعت میانہ رو ہے، اور ان میں سے بہت سے لوگ برے کام کرنے والے ہیں)۔ اسی لیے اللہ نے اپنے نبی سے فرمایا: **وإِنْ تُطِعْ أَكْثَرَ من في الْأَرْضِ يُضِلُّوكَ عَنْ سَبِيلِ الله** (اور اگر آپ زمین میں بسنے والوں کی اکثریت کی اطاعت کریں گے تو وہ آپ کو اللہ کے راستے سے بھٹکا دیں گے)۔ اور فرمایا: **ما يَعْلَمُهُمْ إِلَّا قَلِيلٌ** (انہیں بہت کم لوگ جانتے ہیں)۔\n\nپس سب سے اشرف علوم وہ ہیں جو بندے کو وہب (الوهب) کے ذریعے حاصل ہوتے ہیں، اگرچہ وہب اس شخص کے استعداد کا متقاضی ہوتا ہے جسے وہ عطا کیا جا رہا ہے، ان پاکیزہ اور مشروع اعمال کے ذریعے جن سے وہ متصف ہوا، لیکن چونکہ یہ اس علم کے حصول کے لیے شرط نہیں ہے، اس لیے یہ علم کسب (الکسب) سے بلند ہے۔ کیونکہ بعض انبیاء کو نبوت حاصل ہوئی بغیر اس کے کہ وہ کسی مشروع عمل پر ہوں جس کے ذریعے وہ اسے قبول کرنے کے لیے تیار ہوتے، اور بعض ان میں سے مشروع عمل پر ہوتے ہیں، تو وہ عمل ہی عین استعداد ہوتا ہے۔ پس جسے معرفت (المعرفۃ) نہیں ہے، وہ شاید یہ خیال کرے کہ اگر یہ استعداد نہ ہوتی تو نبوت حاصل نہ ہوتی، اور وہ یہ خیال کرے کہ یہ اکتساب ہے، حالانکہ نبوت بذات خود ایک الٰہی اختصاص ہے، جسے وہ اپنے بندوں میں سے جسے چاہتا ہے عطا کرتا ہے، اور اس بندے کو شریعت یا کسی اور چیز کی خبر نہیں ہوتی، اور نہ وہ جانتا ہے کہ وہ کون ہے اور اس کا معاملہ کیا ہے۔ اگر استعداد اس علم کو پیدا کرتی، تو یہ انبیاء میں پایا جاتا، لیکن معاملہ ایسا نہیں ہے۔ کیونکہ نبوت اہل کشف (الکشف) میں بلا اختلاف کسبی نہیں ہے، اگرچہ عقلمندوں میں سے اہل فکر (الفكر) نے اس میں اختلاف کیا ہے۔\n\nیہ ہمارے نزدیک اس بات کی سب سے قوی دلیل ہے کہ فکر (الفكر) سے عاقل کبھی درست ہوتا ہے اور کبھی غلطی کرتا ہے، لیکن اس کی غلطی اس کی درستی سے زیادہ ہوتی ہے، کیونکہ اس کی ایک حد ہے جہاں وہ رک جاتا ہے۔ پس جب وہ اپنی حد پر رکتا ہے تو لازماً درست ہوتا ہے، اور جب وہ اپنی حد سے تجاوز کر کے کسی ایسی چیز کی طرف جاتا ہے جو کسی دوسری قوت کے حکم میں ہے جو بعض بندوں کو عطا کی جاتی ہے، تو وہ غلطی بھی کر سکتا ہے اور درست بھی ہو سکتا ہے۔ اللہ ہمیں اور آپ کو افکار کی غلطیوں سے محفوظ رکھے، اور ہمیں اپنے فضل سے ذکر کرنے والوں (الذاکرین) اور مذکورین میں شامل کرے۔ اس کے سوا کوئی رب نہیں۔\n\nاور جو کچھ ہم نے ابھی ذکر کیا ہے، اس کے بارے میں ہمارے پاس ایک نظم ہے جو میں نے موصل شہر سے ۶۰۱ھ میں بعض بھائیوں کو لکھی تھی، نبوت کے بارے میں کہ یہ اللہ تعالیٰ کی طرف سے اختصاص ہے، اور اسی لیے اس کے صاف پانی میں کدورت کی آمیزش نہیں ہوتی:\n\nخبردار! رسالت برزخی ہے\nاور اس کے حامل کو نیت کی ضرورت نہیں ہوتی۔\nجب اس کی بناوٹ اپنی قوتیں عطا کرتی ہے\nتو وہ بناوٹ اپنی قوت سے اسے قبول کرتی ہے۔\nاور بے شک اس کے ساتھ اختصاص وابستہ ہے\nجیسا کہ اشعریوں نے اس پر دلالت کی ہے۔\nاور یہ حق ہے، اس میں کوئی پوشیدگی نہیں\nپس فلسفیانہ کتابوں کے احکام کو چھوڑ دو۔\n\n(یہ اشعار بہت زیادہ ہیں، لیکن ہمارا مقصد اس معاملے کی طرف اشارہ کرنا ہے جو اس مقام کا متقاضی ہے۔)\n\nاور آپ کو معلوم ہونا چاہیے کہ کدورتوں (الأكدار) کے ظاہر ہونے کا سبب صرف پانی کا ٹھہر جانا اور اس کا سکون ہے، جو غیر مناسب جگہ اور مقام پر حرکت سے راحت طلب کرنے کی وجہ سے ہوتا ہے۔ اسی لیے ہم نے اس حالت کو حوض (الحوض) سے کنایہ کیا ہے، کیونکہ اس میں پانی کا ٹھہراؤ اور سکون ہوتا ہے۔\n\nاور ہم نے غزل اور نسیب کے باب میں کہا تھا، جس میں میں نے معشوق کی اپنی ذات میں پاکیزگی بیان کی ہے:\n\nاس نے ہر اس شخص کو راحت بخشی جو اس سے مشابہ ہوا\nبشر کے مراتب سے منتقل کر کے۔\nاس غیرت کی وجہ سے کہ کہیں اس کے صاف پانی میں آمیزش نہ ہو جائے\nاس کدورت کی جو حوضوں میں ہوتی ہے۔\n\nمیرا مطلب یہ ہے کہ جب محب اس صفت والے سے عشق کرتا ہے، تو یہ معشوق اس پر حکم لگاتا ہے اور اسے اپنی طرف منتقل کر دیتا ہے اور اسے اپنے لباس پہناتا ہے، پس اسے اس چیز سے نکال دیتا ہے جس کا تقاضا عالم طبیعت کدورتِ شبہات کی صورت میں کرتا ہے، اگر معشوق علم ہو، اور شبہات اور حرام کی صورت میں، اگر معشوق عمل ہو، اور طبعی شہوات کی صورت میں، اگر معشوق مادہ سے پاک روح ہو، اور بشریت سے، اگر معشوق فرشتہ ہو، اور اللہ کے سوا ہر چیز سے، اگر محبوب (الحق) ذات حق ہو۔ پس سچا محب وہ ہے جو محبوب کی صفت کی طرف منتقل ہو جائے، نہ کہ وہ جو محبوب کو اپنی صفت کی طرف نیچے لائے۔\n\nکیا آپ نہیں دیکھتے کہ (الحق) ذات حق نے جب ہم سے محبت کی تو وہ اپنی لطیف پوشیدہ صفات میں ہمارے لیے نیچے آیا، اس چیز کے ساتھ جو ہمارے مناسب ہے، حالانکہ اس کی شان اور کبریائی اس سے بلند ہے۔ پس وہ ہمارے ساتھ خوش دلی کے لیے نیچے آیا جب ہم اس کے گھر میں اس سے مناجات (راز و نیاز) کے ارادے سے آتے ہیں، اور ہماری توبہ اور اس سے منہ موڑنے کے بعد اس کی طرف رجوع کرنے پر خوش ہوتا ہے، اور اس جوان کے عدمِ صبوہ (عشق میں مبتلا نہ ہونے) پر تعجب کرتا ہے جو اس کے سلطان کے حکم کے مقام پر ہے، اگرچہ یہ اس کی توفیق سے ہی ہوتا ہے، اور ہمارے بھوک، پیاس اور بیماری میں ہماری نیابت کرنے کے لیے، اور اپنی ذات کو ہمارے لیے ہمارے مقام پر نازل کرنے کے لیے۔\n\nجب اس کے بعض بندے بھوکے ہوئے تو اس نے دوسروں سے فرمایا: میں بھوکا تھا، تم نے مجھے کھانا نہیں کھلایا۔ اور جب اس کے بندوں میں سے کوئی پیاسا ہوا تو سبحانہ و تعالیٰ نے دوسرے بندے سے فرمایا: میں پیاسا تھا، تم نے مجھے پانی نہیں پلایا۔ اور جب اس کے بندوں میں سے کوئی بیمار ہوا تو اس نے دوسرے بندے سے فرمایا: میں بیمار تھا، تم نے میری عیادت نہیں کی۔ پس جب یہ بندے اس سب کے بارے میں اس سے سوال کرتے ہیں، تو وہ ان سے فرماتا ہے: اماں! فلاں بیمار ہوا تھا، اگر تم اس کی عیادت کرتے تو مجھے اس کے پاس پاتے۔ اماں! فلاں بھوکا ہوا تھا، اگر تم اسے کھانا کھلاتے تو تم اسے میرے پاس پاتے۔ اماں! فلاں پیاسا ہوا تھا، اگر تم اسے پانی پلاتے تو تم اسے میرے پاس پاتے۔ اور یہ حدیث صحیح ہے۔\n\nیہ محبت کا ثمرہ ہے کہ وہ ہمارے لیے نیچے آیا۔ اسی لیے ہم نے کہا کہ محبت میں سچائی محب کو محبوب کی صفت سے متصف کر دیتی ہے۔ اسی طرح اپنے رب کی محبت میں سچا بندہ اس کے اسماء کے ساتھ اخلاق اختیار کرتا ہے، پس وہ غیر اللہ سے بے نیازی، اللہ تعالیٰ کے ساتھ عزت، اللہ تعالیٰ کے ہاتھ سے عطا، اور اللہ تعالیٰ کی آنکھ سے حفاظت کے ساتھ اخلاق اختیار کرتا ہے۔ اور علماء نے اللہ کے اسماء کے ساتھ اخلاق اختیار کرنے کا علم حاصل کیا ہے اور اس بارے میں کتابیں لکھی ہیں، اور اس کی وجہ یہ ہے کہ جب انہوں نے اس سے محبت کی تو وہ اس کی صفات سے متصف ہو گئے، اس حد تک جو ان کے لائق ہے۔\n\nپھر ہم اپنے موضوع کی طرف لوٹتے ہیں اور کہتے ہیں: **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔ علوم، اور میرا مطلب معلومات سے ہے، جب وہ اپنی ذات کے ساتھ علم کے لیے ظاہر ہوتے ہیں اور علم انہیں ان کی ذات میں جیسا کہ وہ ہیں، ادراک کر لیتا ہے، تو وہ صحیح علم اور مکمل ادراک ہوتا ہے جس میں قطعاً کوئی شبہ نہیں ہوتا۔ اور یہ معلوم خواہ وجود (الوجود) ہو یا عدم، نفی ہو یا اثبات، کثیف ہو یا لطیف، رب ہو یا مربوب، حرف ہو یا معنی، جسم ہو یا روح، مرکب ہو یا مفرد، یا وہ جو ترکیب سے پیدا ہوا ہو، یا نسبت ہو، یا صفت ہو، یا موصوف ہو۔\n\nپس جب بھی ان مذکورہ چیزوں میں سے کوئی چیز علم کے لیے اپنی ذات کے ساتھ ظاہر ہونے سے باہر نکل جائے، اور اس کے لیے اپنی اصل صورت کے علاوہ کسی اور صورت میں ظاہر ہو، جیسے عدم اس کے لیے وجود (الوجود) کی صورت میں ظاہر ہو، اور اس کے برعکس، اور نفی اثبات کی صورت میں، اور اس کے برعکس، اور لطیف کثیف کی صورت میں، اور اس کے برعکس، اور رب مربوب کی صفت میں، اور مربوب رب کی صفت میں، اور معانی اجسام کی صورتوں میں، جیسے علم دودھ کی صورت میں، اور دین میں ثابت قدمی قید کی صورت میں، اور ایمان کڑے کی صورت میں، اور اسلام ستونوں کی صورت میں، اور اعمال خوبصورتی اور بدصورتی کے اشخاص کی صورتوں میں— تو یہی وہ کدورت ہے جو علم کو لاحق ہوتی ہے۔\n\nپس جس کے لیے یہ ظاہر ہوتا ہے، اسے ایک الٰہی قوت کی ضرورت ہوتی ہے جو اسے اس صورت سے اس معنی کی طرف لے جائے جو اس صورت میں ظاہر ہوا ہے، تو وہ تھک جاتا ہے۔ اور اس کی وجہ خیال (الخيال)، تمثل (تصور) اور قوت مفکرہ (سوچنے والی قوت) کی حاضری ہے، اور اس کی اصل یہ طبعی جسم ہے، جسے اس منزل میں حوض (الحوض) سے تعبیر کیا گیا ہے۔ اور اس حوض کی تہہ (القعر) خیال (الخيال) کا خزانہ ہے، اور اس تہہ میں ٹھہرے ہوئے حوض کے پانی کی کدورت (کدر) وہ ہے جسے خیال (الخيال) اور تخیل اس کی اصل صورت سے باہر نکالتے ہیں، پس دیکھنے والے پر التباس (دھوکہ) طاری ہو جاتا ہے جو اس کے لیے ظاہر ہوا ہے۔ پس وہ نہیں جانتا کہ کس معنی نے اس صورت کو پہنا ہے، تو وہ حیران ہو جاتا ہے، اور یہ اس کے لیے اس کی نظر سے کبھی بھی موافقت کے حکم کے سوا حل نہیں ہوتا، اور وہ اس میں کسی یقینی تحقیق پر نہیں ہوتا، مگر اللہ کی طرف سے خبر کے ذریعے۔\n\nاسی لیے جب ابوبکر صدیق رضی اللہ عنہ اس مقام پر کھڑے ہوئے اور خواب کی تعبیر پوچھی، اور نبی صلی اللہ علیہ وسلم نے انہیں اس کی تعبیر کرنے کا حکم دیا، تو جب وہ فارغ ہوئے تو انہوں نے نبی صلی اللہ علیہ وسلم سے پوچھا کہ کیا انہوں نے جو تعبیر کی ہے وہ درست ہے یا غلط؟ تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: **أصبت بعضا وأخطأت بعضا** (تم نے کچھ درست کہا اور کچھ غلطی کی)۔\n\nپس صدیق رضی اللہ عنہ کو یہ معلوم نہ ہو سکا کہ اس میں ان کی حق کو پانا کہاں سے ہے اور غلطی کہاں سے ہے۔ اسی لیے ہم نے کہا کہ اس طرح کے معاملے میں درست ہونے والا اس چیز پر یقین پر نہیں ہوتا جو اس نے پائی ہے۔ اسی لیے عارفین (العارفون) نے رجوع کیا اور اس بات سے گریز کیا کہ وہ علم کو صرف اللہ سے وہب (الوهب) کے ذریعے حاصل کریں، جس کا طریقہ اولیاء میں ذکر (الذکر) ہے نہ کہ فکر (الفكر)۔ پس اگر انہیں معانی مجرد (پاک) حالت میں عطا کیے جائیں، اور معلومات ان کے لیے اپنی ذات کے ساتھ ان صورتوں میں ظاہر ہوں جو ان کی حقائق ہیں، تو یہی مقصود ہے۔ اور اگر (الحق) ذات حق انہیں ذکر (الذکر) کے وقت ان کی اصل صورتوں کے علاوہ کسی اور صورت میں ظاہر کرے، اور ان کی ذاتوں کو ان سے چھپا لے، تو انہیں وہ قوت اور نور عطا کیا جاتا ہے کہ وہ ان صورتوں میں ان کے پیچھے تک نفوذ کر جائیں، اور یہی وہ چیز ہے جس کے لیے یہ صورتیں ارادہ کی گئی تھیں اور ان کے ساتھ قید کی گئی تھیں۔ پس ان کا مشہود (الشہود) بہر حال وہ معانی ہیں جو مقصود ہیں، اور وہ الفاظ اور عبارات کے عالم میں منصوص اور محکم کی مانند ہیں جس میں کوئی اشکال یا تاویل (التأويل) نہیں، اور دوسرا ظواہر کی مانند ہے جو متعدد معانی کو اپنے اندر سموئے ہوئے ہوتے ہیں، اور دیکھنے والا ان میں سے متکلم کا مقصد نہیں جانتا۔\n\n### [وہبی علوم کو حوض سے تشبیہ دی جاتی ہے]\n\nاور جان لیجیے کہ جب اللہ یہ علوم بندے کو ان کی اصل صورتوں کے علاوہ کسی اور صورت میں عطا کرتا ہے اور اسے بتا دیتا ہے کہ اس سے کیا مراد ہے، پس وہ اس صورت میں اس کی حقیقت پر مطلع ہو جاتا ہے، تو یہ حوض (الحوض) سے مشابہت رکھتا ہے۔ کیونکہ وہ پانی کا ادراک کرتا ہے اور اس کدورت (الكدر) کا بھی جو حوض کی تہہ میں ہے، اور پانی کو لازماً دیکھنے والی آنکھ میں اس کدورت کا رنگ پہنایا جاتا ہے، خواہ وہ سرخی ہو یا زردی یا کوئی اور رنگ، پس آپ پانی کو سرخ یا زرد یا دیگر رنگوں میں دیکھتے ہیں۔ اسی لیے جنید (رحمہ اللہ) نے فرمایا جب ان سے معرفت (المعرفۃ) اور عارف کے بارے میں پوچھا گیا تو انہوں نے کہا: **لون الماء لون إنائه** (پانی کا رنگ اس کے برتن کا رنگ ہوتا ہے)۔\n\nاور جب پانی نے یہ رنگ قبول کر لیا تو وہ آنکھ میں رنگین اور رنگ کے مرکب کی صورت میں ہو گیا، حالانکہ وہ حقیقت میں کوئی اور چیز ہے۔ پس وہ پانی کو جانتا ہے اور یہ بھی جانتا ہے کہ وہ برتن کا رنگ ہے۔ اسی طرح الٰہی مظاہر میں تجلیات (التجلی) ظہورات ہوتے ہیں۔ بہر حال، عارف (العارف) ہمیشہ ان کا ادراک کرتا ہے، اور تجلی (التجلی) اس کے لیے دائمی ہوتا ہے، اور فرقان (امتیاز) اس کے پاس دائمی ہوتا ہے۔ پس وہ جانتا ہے کہ کس نے تجلی (التجلی) ظہور کیا اور کیوں تجلی (التجلی) ظہور کیا، لیکن (الحق) ذات حق اس بات میں عالم سے خاص ہے کہ اس نے کیسے تجلی (التجلی) ظہور کیا، اسے اللہ کے سوا کوئی نہیں جانتا، نہ فرشتہ اور نہ نبی۔ کیونکہ یہ (الحق) ذات حق کی خصوصیات میں سے ہے، اس لیے کہ ذات (الذات) اصل میں مجہول ہے، پس اس کے مظاہر میں تجلی (التجلی) ظہور کی کیفیت کا علم کسی کو حاصل نہیں اور نہ ہی اللہ کی مخلوق میں سے کوئی اس کا ادراک کر سکتا ہے۔\n\nیہ وہ علم ہے جو کسی اور چیز کو پیدا نہیں کرتا، پس یہ نسل منقطع ہے، اس کی کوئی اولاد نہیں۔ اور اس کے علاوہ جو علوم ہیں، ان میں غور و فکر کرنے سے ایک علم دوسرے علم کو پیدا کر سکتا ہے، اور ایسا ہی ہوتا ہے، بلکہ یہی وہ علم ہے جو لوگوں کے ہاتھوں میں ہے۔ کیونکہ اگر آپ کو مقدمات کا علم حاصل نہ ہو، اور اس کا بھی کہ ان سے کیا پیدا ہوتا ہے اور کیا پیدا نہیں ہوتا، اور ان کے درمیان جوڑنے والے سبب کا بھی، تو اس علم کے حصول کے بعد یہ آپ کے لیے اس علم کو پیدا کرتا ہے جو اس خاص ترکیب نے عطا کیا ہے۔ اور یہ وہ تناسل ہے جو علوم میں اس تناسل کی مانند ہے جو نباتات اور حیوانات میں ہوتا ہے۔ اور یہ معانی کا تناسل ہے۔ اسی لیے معانی نے جسمانی صورتوں کو قبول کیا، کیونکہ اجسام توالد (پیدائش) کا مقام ہیں۔\n\nاگر آپ کہیں: تو وہ علم جو پیدا نہیں کرتا، اسے صورت قبول نہیں کرنی چاہیے تھی؟ ہم کہیں گے: اس نے صورت اس لیے قبول کی کہ وہ کسی پیدا کرنے والے اور پیداوار کا نتیجہ ہے، لیکن وہ بذات خود بانجھ ہے، جو بالکل پیدا نہیں کرتا، جیسے حیوانات میں بانجھ ہوتا ہے، باوجود اس کے کہ وہ دوسروں سے پیدا ہوا ہے، لیکن وہ خود پیدا نہیں کرتا، کیونکہ اس میں ایک صفت قائم ہے جو اس کا تقاضا کرتی ہے۔ اسی لیے (الحق) ذات حق نے اپنی ذات کو دونوں چیزوں سے پاک قرار دیا اور فرمایا: **لَمْ يَلِدْ ولَمْ يُولَدْ** (نہ اس نے جنا اور نہ وہ جنا گیا)۔ اور یہ ذات (الذات) کی تنزیہ ہے، پس نہ وہ تعلق رکھتی ہے اور نہ اس سے تعلق رکھا جاتا ہے۔ اور پیداوار صرف مرتبے میں واقع ہوئی اور ظاہر ہوئی، پس رب نے مربوب کو طلب کیا اور قادر نے مقدور کو۔\n\nاگر آپ کہیں: اگر معاملہ ایسا ہی ہے جیسا کہ آپ نے **لَمْ يَلِدْ ولَمْ يُولَدْ** میں ذکر کیا، تو مظاہر کو باطل ہو جانا چاہیے، حالانکہ وہ موجود ہیں، تو آپ کا کیا جواب ہے؟ ہم کہیں گے: مظاہر مرتبے کے لیے ہیں، ذات (الذات) کے لیے نہیں۔ پس اس کی عبادت صرف اس کے الٰہ ہونے کی حیثیت سے کی جاتی ہے، اور اس کے اسماء کے ساتھ اخلاق اختیار کرنا، جو عین اس کی عبادت ہے، صرف اس کے الٰہ ہونے کی حیثیت سے ہوتا ہے، اور اس کے مظاہر میں اس کے مظاہر سے صرف اس کے الٰہ ہونے کو ہی سمجھا جاتا ہے۔ پس یہ جان لو۔ اور اگر مظاہر کو ذات (الذات) اس حیثیت سے ظاہر کرتی کہ وہ ذات ہے، تو وہ معلوم ہو جاتی، اور اگر وہ معلوم ہو جاتی تو اس کا احاطہ ہو جاتا، اور اگر اس کا احاطہ ہو جاتا تو وہ محدود ہو جاتی، اور اگر وہ محدود ہو جاتی تو اس پر ملکیت ہو جاتی۔ اور (الحق) ذات حق کی ذات ان سب سے بہت بلند ہے۔\n\nپس ہم نے جان لیا کہ ذات (الذات) اور ان مظاہر کے درمیان کوئی ایسی نسبت نہیں ہے جس کے ذریعے علم مظہر کی نسبت سے ذات کے ساتھ متعلق ہو سکے۔ اور جب اس طرح کا علم اللہ کے علماء کے نفوس میں حاصل نہیں ہوتا، تو ذات کی مظاہر سے نسبت کا علم ہونا تو اور بھی بعید ہے۔\n\nاگر آپ کہیں: نسبت تو ایک ہی ہے، لیکن اس کے دو سرے ہیں، ایک ذات کی طرف سے اور ایک مظہر کی طرف سے؟ ہم کہیں گے: معاملہ ایسا نہیں ہے جیسا کہ آپ گمان کرتے ہیں کہ متضائفین (باہمی نسبت رکھنے والوں) کے درمیان نسبت ایک ہی ہوتی ہے۔ کیونکہ بیٹے کی والد سے نسبت بنوت (بیٹا ہونا) کی نسبت ہے، اور بنوت انفعال (متاثر ہونا) ہے۔ اور والد کی بیٹے سے نسبت ابوت (باپ ہونا) کی نسبت ہے، اور ابوت فاعلیت (فعل کرنے والا ہونا) ہے۔ اور کہاں فعل کرنے والا اور کہاں متاثر ہونے والا؟ بہت دور! پس نسبت ایک نہیں ہے اور نہ ہی اس کے دو سرے ہیں، کیونکہ وہ تقسیم کے قابل نہیں ہے، میرا مطلب یہ خاص نسبت ہے، اور وہ سرا جسے آپ نے اپنے خیال (الخيال) سے نسبت کا سرا بنایا ہے، وہ سرا ہی وہ نسبت ہے جس کا ذکر کیا جاتا ہے، کیونکہ کسی چیز کے دو سرے اس کی تقسیم کی خبر دیتے ہیں، اور معنی تقسیم نہیں ہوتا کیونکہ وہ مرکب نہیں ہے۔\n\nاور یہ علم، جو حوضوں سے مشابہ ہے، اس کا نتیجہ (الحق) ذات حق کی طرف سے سینے کی جانب سے مناجات (راز و نیاز) ہے، اور وہ آپ کا اس سے مناجات کرنا ہے جب آپ اس سے صادر ہوتے ہیں، جب اس نے آپ کو تبلیغ کے لیے اپنے بندوں کی طرف نکلنے کا حکم دیا، اگر آپ رسول ہیں، اور ثابت قدمی کے لیے، اگر آپ وارث ہیں۔ اور یہ مناجات اس کی طرف سے آپ کی طرف صرف آپ کے اندر ہوتی ہے، نہ کہ کسی اور میں۔ پس آپ اسے اپنے آپ سے جانتے ہیں، نہ کہ کسی اور سے، کیونکہ آپ سب سے قریبی حجاب اور اس پر لٹکا ہوا پردہ ہیں۔ اور آپ کے پردہ اور حجاب ہونے کی وجہ سے آپ نے اسے محدود کر دیا ہے۔ پس اس مقام پر آپ کی اس کی معرفت (المعرفۃ) عین آپ کی اس کی معرفت سے عاجزی ہے، اور اگر آپ چاہیں تو کہہ سکتے ہیں کہ عین اس سے جہالت ہے۔ اور جہالت سے ہماری مراد علم کا نہ ہونا ہے۔\n\nجہاں تک غیر کا تعلق ہے، وہ آپ کے مقابلے میں زیادہ دور کا حجاب ہے، کیونکہ اللہ نے اپنی ذات کو صرف آپ سے قربت کے ساتھ موصوف کیا ہے۔ اور اسی طرح اس کا قرب آپ کے غیر سے اس غیر کے لیے بھی آپ کے قرب کی طرح ہے۔ پس اس کا آپ سے قرب کے ساتھ موصوف ہونا آپ کے غیر کے مقابلے میں زیادہ دور ہے، جب وہ آپ سے اس کا علم چاہتا ہے، جیسا کہ آپ جب اس کا علم اپنے غیر سے چاہتے ہیں۔ اللہ تعالیٰ فرماتا ہے: **ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ** (اور ہم اس کی شہ رگ سے بھی زیادہ قریب ہیں)۔ پس اس نے چیزوں سے اپنے قرب کو ثابت کیا، اور چیزوں سے اپنے قرب کی کیفیت کے علم کی نفی کی، اپنے اس قول سے: **ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ** (اور ہم تم سے زیادہ قریب ہیں، لیکن تم نہیں دیکھتے)۔ پس اس نے بصیرت اور بصر (آنکھ کی بینائی) دونوں کو عام کر دیا، کیونکہ باطن میں بصر کا ادراک بصیرت کہلاتا ہے، اور ذات ایک ہی ہے، اور اس پر مقامات مختلف ہوئے، پس محسوسات کے ادراک میں اسے بصر کہا گیا اور معانی کے ادراک میں بصیرت۔ پس ادراک کرنے والا ان دونوں میں ایک ہی ہے۔\n\nاور چونکہ آخرت میں جو حوض ہوگا، اس پر پینے والوں کی تعداد کے برابر بہت سے پیالے ہوں گے، اور پانی برتن میں برتن کی شکل اور رنگ میں ہوتا ہے، تو ہم نے قطعی طور پر جان لیا کہ اللہ سبحانہ و تعالیٰ کا علم آپ کی نظر، آپ کی استعداد اور آپ کی اپنی ذات میں جو کچھ ہے، اس کے مطابق ہے۔ پس اللہ کے بارے میں دو شخص کبھی بھی تمام جہتوں سے ایک علم پر جمع نہیں ہوئے، کیونکہ دو میں کبھی بھی ایک مزاج جمع نہیں ہوا، اور یہ درست نہیں ہے، کیونکہ دو چیزوں میں لازماً کوئی ایسی چیز ہونی چاہیے جس سے امتیاز واقع ہو، تاکہ ہر ایک کی ذات ثابت ہو، اور اگر ایسا نہ ہوتا تو ان کا دو ہونا درست نہ ہوتا۔ پس کسی نے بھی (الحق) ذات حق سے اپنی ذات کے سوا کچھ نہیں جانا۔ پس جب وہ اس شخص کے ساتھ معاملہ کرتا ہے جس پر اس نے تجلی (التجلی) ظہور کیا، اس طرح جس طرح اس نے اس کے ساتھ معاملہ کیا، اور یہ ثابت ہے کہ اس کا عمل اسی کی طرف لوٹتا ہے، تو اللہ کو اس سے کچھ حاصل نہیں ہوتا۔\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: **إنما هي أعمالكم ترد عليكم** (یہ صرف تمہارے اعمال ہیں جو تم پر لوٹائے جاتے ہیں)۔\n\nپس (الحق) ذات حق تمہارے اعمال سے تمہیں خلعتیں پہناتا ہے، اس قدر جو تم نے انہیں مضبوط کیا اور ان کے اصولوں کا خیال رکھا۔ پس کوئی ریشم پہنتا ہے اور کوئی کتان اور کپاس کا موٹا کپڑا، اور جو ان کے درمیان ہے۔ پس اپنے آپ کو ملامت کرو، اور جولاہے کو ملامت نہ کرو، کیونکہ اس نے تمہارے لیے صرف تمہارا ہی سوت بُنا ہے۔\n\nاگر آپ کہیں: آپ کیسے کہتے ہیں کہ اللہ کو اس سے کچھ حاصل نہیں ہوتا، حالانکہ سبحانہ و تعالیٰ نے فرمایا: **يَنالُهُ التَّقْوى‏ مِنْكُمْ** (تمہارا تقویٰ اس تک پہنچتا ہے)؟ تو آپ کو معلوم ہونا چاہیے کہ یہاں نیل (پہنچنے) کے اثبات اور (الحق) ذات حق کی جانب سے نیل کے عدم کا مطلب یہ ہے کہ اللہ سبحانہ و تعالیٰ کو مخلوق کے اعمال میں سے کوئی چیز نہیں پہنچتی جس میں اس نے انہیں عمل کرنے کا مکلف بنایا ہے، اس طرح کہ وہ اس کی محتاجی کا نیل ہو یا اس سے زینت حاصل کرنا ہو تاکہ اسے کوئی ایسی حالت حاصل ہو جو پہلے نہ تھی، بلکہ اسے تقویٰ (التقوى) پہنچتا ہے، اور وہ یہ ہے کہ تم اسے ایک ڈھال بنا لو اس چیز سے جس سے اس نے تمہیں ڈرنے کا حکم دیا ہے، تقویٰ کے درجات اور منازل پر۔ پس اس نے فرمایا: **فَاتَّقُوا النَّارَ** (پس آگ سے ڈرو)، اور **واتَّقُوا الله** (اور اللہ سے ڈرو)، اور **قُوا أَنْفُسَكُمْ وأَهْلِيكُمْ** (اپنے آپ کو اور اپنے گھر والوں کو بچاؤ)۔\n\nپس **يَنالُهُ التَّقْوى‏** (تقویٰ اس تک پہنچتا ہے) کا معنی یہ ہے کہ وہ اسے آپ سے لے لیتا ہے تاکہ وہ آپ کو اپنے ہاتھ سے پہنائے، آپ کو شرف بخشتے ہوئے، کیونکہ اس نے آپ کو بغیر کسی واسطے کے خلعت عطا کی، جبکہ غیر متقی اسے (الحق) ذات حق کے ہاتھ کے بغیر پہنتا ہے، خواہ وہ خلعت عمدہ لباس کی ہو یا گھٹیا کی۔ یہ سب آپ کی طرف لوٹتا ہے، کیونکہ وہ آپ سے صرف وہی لیتا ہے جو آپ نے اسے دیا ہے، اگرچہ وہ سب تقویٰ ہو۔ کیونکہ وہ سبحانہ و تعالیٰ غیر متقی سے کچھ نہیں لیتا۔ اسی لیے اس نے اپنی ذات کو اس بات سے موصوف کیا کہ تقویٰ بندوں کی طرف سے اس تک پہنچتا ہے۔ اور (الحق) ذات حق کو اس بات سے موصوف کیا گیا کہ تقویٰ اسے پہنچتا ہے، اور گوشت اور خون اسے نہیں پہنچتے، کیونکہ پہنچنا اتفاق کے حکم سے ہوتا ہے، نہ کہ قصد کے حکم سے۔ اس نے نیل (پہنچنے) کو مخلوق کی طرف منسوب کیا، کیونکہ وہ اس بات سے بلند ہے کہ اسے معلوم کیا جائے اور پھر اس کی طرف قصد کیا جائے جہاں سے وہ معلوم ہوتا ہے، بلکہ وہ اتفاقاً مصادفت کے حکم سے پہنچا جاتا ہے۔ اور (الحق) ذات حق اس بات سے پاک ہے کہ وہ چیزوں کو اصابت (پہنچنے) کے حکم سے جانے، پس اس کا علم چیزوں کا اتفاقی ہو۔\n\nپس جب تقویٰ متقی کی طرف سے اس تک پہنچتا ہے اور وہ اس کے سامنے خدمت کرتا ہے اور اپنی ذات کو اس کے سامنے تسلیم کر دیتا ہے کہ وہ اس میں جو چاہے کرے، تو سبحانہ و تعالیٰ اس وقت متقی کو علم کی خلعت عطا کرتا ہے۔ اور اس علم کی شان یہ ہے کہ وہ اللہ تعالیٰ کی طرف سے بندے کو عطا کے ہر طریقے سے حاصل ہوتا ہے، یہاں تک کہ ہر لینے والا اس میں سے اپنا حصہ لیتا ہے۔ پس ان میں سے کوئی اسے کرم کے ہاتھ سے لیتا ہے، کوئی جود (سخاوت) کے ہاتھ سے، کوئی سخاء کے ہاتھ سے، اور کوئی منت اور فضل کے ہاتھ سے، سوائے ایثار (دوسرے کو ترجیح دینا) کے، کیونکہ اس الٰہی حضور میں اس کا کوئی ہاتھ نہیں ہے، اس لیے کہ وہ کسی ضرورت کی وجہ سے عطا نہیں کرتا۔\n\nلیکن چونکہ الٰہی اسماء وجودِ کائنات میں اپنے حقائق کے ظہور اور اپنے احکام کے ظہور کا ارادہ کرتے ہیں، تو یہ خیال کیا جاتا ہے کہ ان کا عطا کرنا لینے والے کی ضرورت کی وجہ سے ہے۔ پس اس سے ایثار کی بو آتی ہے، حالانکہ یہ درست نہیں ہے۔ اور اس میں ایک گروہ پڑ گیا ہے جن کی بصیرت کو اللہ نے اندھا کر دیا ہے۔ اسی لیے عارفین (العارفون) نے اسماء کے ساتھ اخلاق اختیار کرنے میں عطا کی تمام اقسام سے متصف ہوئے، لیکن ایثار سے نہیں، کیونکہ وہ اس میں امانت دار ہیں، وہ ایثار نہیں کرتے، کیونکہ ان کے نزدیک حقیقی ایثار (نہ کہ مجازی) کا تصور نہیں کیا جا سکتا۔ اور عارف یہ نہیں کہتا کہ میں نے تمہیں (جمع) عطا کیا، بلکہ وہ کہتا ہے کہ میں نے تمہیں (واحد) عطا کیا، کیونکہ عطا میں دو شخص کبھی شریک نہیں ہوتے۔ اسی لیے وہ واحد کا صیغہ استعمال کرتا ہے اور جمع کا نہیں۔ پس اس میں جمع کا استعمال خطاب میں وسعت کے لیے ہے، اور حقیقت وہی ہے جو ہم نے ذکر کی۔ اور اس منزل میں کلام کے لیے ایک وسیع میدان ہے جس کے لیے وقت کافی نہیں ہے۔ **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\n\nحوض کی منزلیں اور اس کے اسرار\nعلم کے مراتب اور اس کے انوار ہیں۔\nاور یہ اس علم میں سے ہے جو ہمیشہ سے ہے\nجس کی صفائی میں اس کی کدورتوں کی آمیزش ہے۔\nاس کا محل وہ طبیعت ہے جس نے اسے بند کیا\nاس کی تہہ اسے اس کے غبار کے ساتھ لاحق کرتی ہے۔",
    "fa": "«باب دویست و هفتاد و ششم در معرفت منزل حوض و اسرار آن از مقام محمدی»\n\nحوض منزلی است که آبش به کدورت وصف شده *** و آن همان علومی است که به بشر اختصاص دارد\nآب در اصل خود صاف است و کدورتی ندارد *** و قعر (حوض) آنچه از کدورت در آن است را آشکار می‌سازد\nو علت تیرگی آن است که فکر آن را تولید می‌کند *** پس علمی را طلب کن که از فکر فراتر رود\nهمانا خیال چون به آن علوم رسد، آنها را *** با فکر (Al-Fikr) در عالم اجساد و صور مقید می‌سازد\nو فکر گاهی آنها را از صورشان رها می‌سازد *** اما خود از آسیب مصون نیست\nپس آن را با ذکر (Al-Dhikr) طلب کن نه با فکر، تا به آن دست یابی *** در حالی که منزه و خالص از آلودگی غیر باشد\n\n### [اینکه علوم بر دو قسم است: موهوبی و اکتسابی]\n\nای ولی صمیمی (Al-Walī al-Ḥamīm)، خداوند بصیرتت را نورانی و باطنت (Sarīra) را نیکو گرداند، بدان که علوم بر دو قسم است: موهوبی (Mawhūba) که همان قول خداوند متعال است: «لَأَكَلُوا من فَوْقِهِمْ» (از بالای سرشان می‌خوردند)، و این نتیجه تقوا (Al-Taqwā) است، چنانکه خداوند متعال فرمود: «واتَّقُوا الله ويُعَلِّمُكُمُ الله» (و تقوای خدا پیشه کنید و خداوند به شما می‌آموزد) و فرمود: «إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً» (اگر تقوای خدا پیشه کنید، برای شما فرقان [تشخیص حق از باطل] قرار می‌دهد) و فرمود: «الرَّحْمنُ عَلَّمَ الْقُرْآنَ» (خدای رحمان، قرآن را آموخت). و قسم دیگر اکتسابی (Muktasaba) است و اشاره به آن در قول خداوند متعال است: «ومن تَحْتِ أَرْجُلِهِمْ» (و از زیر پاهایشان)، که اشاره به تلاش و کوشش آنها دارد. اینان اهل اقتصاد (میانه‌روی) هستند. ضمیر در «أرجلهم» (پاهایشان) به کسانی بازمی‌گردد که «از بالای سرشان می‌خوردند»، و آنان کسانی هستند که کتاب خدا و آنچه از جانب پروردگارشان بر ایشان نازل شده را برپا داشتند. اینان همان سبقت‌گیرندگان در خیرات (Al-Khayrāt) هستند و «هُمْ لَها سابِقُونَ» (و آنان بر آن پیشی‌گیرنده‌اند).\n\nپس برخی از آنان با خیرات سبقت گرفتند و برخی کتاب را از خوابش برپا داشتند. زیرا تأویل (Ta'wīl) عالمان، کتاب را پس از آنکه قائم بود، به خواب برد. سپس کسی که خداوند او را توفیق داد آمد و آن را از خوابش برپا داشت؛ یعنی آن را از تأویل و تکلف ورزیدن با فکر (Al-Fikr) در آن منزه ساخت. پس او به عبادت پروردگارش برخاست و از او خواست که او را بر مرادش از آن الفاظی که کتاب دربردارد و بر تعریف معانی خالص از مواد، آگاه سازد. پس خداوند به آنان علمی غیر مشوب عطا کرد. خداوند متعال فرمود: «وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله والرَّاسِخُونَ في الْعِلْمِ» (و تأویل آن را جز خدا و راسخان در علم نمی‌دانند). حق (Al-Ḥaqq) به راسخان در علم می‌آموزد که این لفظ نازل شده و مرقوم به چه چیزی تأویل می‌شود و چه معانی‌ای در آن به ودیعه نهاده شده است، بدون اینکه فکری در آن دخیل باشد؛ زیرا فکر (Al-Fikr) فی‌نفسه در حق هر کسی از خطا مصون نیست. به همین دلیل فرمود: «والرَّاسِخُونَ في الْعِلْمِ يَقُولُونَ ... رَبَّنا لا تُزِغْ قُلُوبَنا» (و راسخان در علم می‌گویند: پروردگارا، دل‌های ما را منحرف مگردان) یعنی با فکر کردن در آنچه نازل کرده‌ای «بَعْدَ إِذْ هَدَيْتَنا» (پس از آنکه ما را هدایت کردی) به گرفتن علم آنچه بر ما نازل کرده‌ای از خودت، «وهَبْ لَنا من لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ» (و از جانب خود رحمتی به ما ببخشای، همانا تو بسیار بخشنده‌ای). پس از طریق وهب (بخشایش) درخواست کرد نه از طریق کسب.\n\nبه همین دلیل ضمیر را به کسانی بازگرداندیم که «از بالای سرشان می‌خوردند». می‌گوید: و از زیر پاهای اینان امت‌هایی هستند: «مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ» (از ایشان امتی میانه‌رو هستند). و آنان اهل کسب هستند و کسانی‌اند که کتاب خدا را تأویل می‌کنند و آن را با عملی که برای آن نازل شده برپا نمی‌دارند و در اخذ آن ادب نمی‌ورزند. و اینان بر دو دسته‌اند: اندکی از آنان که در این امر میانه‌رو هستند (مقتصد)، و او کسی است که به حق نزدیک شده و ممکن است به حکم موافقت، نه به حکم قطع، در آنچه تأویل کرده به حق برسد؛ زیرا مراد خدا در آنچه نازل کرده است، به طور معین، جز از طریق وهب (بخشایش) دانسته نمی‌شود، که همان اخبار الهی است که حق (Al-Ḥaqq) در سرّ میان خود و بنده، قلب او را مخاطب قرار می‌دهد. و کسی که در این امر میانه‌روی نکند و در تأویل تعمق ورزد، به طوری که هیچ تناسبی بین لفظ نازل شده و معنا باقی نگذارد، یا لفظ را بر طریق تشبیه قرار دهد و علم آن را به خدا بازنگرداند، اینان همان کسانی هستند که خداوند در همان آیه درباره‌شان فرمود: «وكَثِيرٌ مِنْهُمْ ساءَ ما يَعْمَلُونَ» (و بسیاری از آنان بد کاری می‌کنند). و چه بدی‌ای بزرگتر از این؟ اینان دسته دوم هستند.\n\nو چون رسول (صلی الله علیه و سلم) این امر را مشاهده کرد، در حالی که به عنوان رحمتی با آنچه بر او نازل شده بود مبعوث گشته بود، و دید که بسیاری از این رحمت بهره‌مند نشده‌اند و علت آن تنها تأویل آنها به دو وجه تشبیه یا دوری کامل از مدلول لفظ بوده است، در امر تبلیغ متحیر شد و توقف کرد تا ببیند آیا پروردگارش این امر را بر او واجب می‌سازد یا خیر. پس خداوند متعال نازل فرمود: «يا أَيُّهَا الرَّسُولُ بَلِّغْ ما أُنْزِلَ إِلَيْكَ من رَبِّكَ» (ای پیامبر، آنچه از جانب پروردگارت بر تو نازل شده است، ابلاغ کن). و به او گفته شد: «فَإِنَّما عَلَيْكَ الْبَلاغُ» (پس همانا بر تو فقط ابلاغ است). و به او گفته شد: «لَيْسَ عَلَيْكَ هُداهُمْ» (هدایت آنان بر عهده تو نیست) در آنچه از خیر و شر از ایشان سر می‌زند. و به او گفته شد: «إِنَّكَ لا تَهْدِي من أَحْبَبْتَ ولكِنَّ الله يَهْدِي من يَشاءُ» (همانا تو هر که را دوست داری هدایت نمی‌کنی، بلکه خدا هر که را بخواهد هدایت می‌کند). پس رسول دانست که مراد از او تنها تبلیغ است و بس. پس ابلاغ کرد (صلی الله علیه و سلم) و هیچ چیز از آنچه مأمور به ابلاغش بود را پنهان نکرد. زیرا او در ابلاغ آنچه پروردگارش امر به ابلاغش کرده، قطعاً معصوم و محفوظ است. و آنچه به او اختصاص داده شده، در آن بر اساس اقتضای نظر خود عمل می‌کند. پس تقدیر در آیه بر اساس تفسیر این است: «ومن تَحْتِ أَرْجُلِهِمْ» (و از زیر پاهایشان) امت‌هایی هستند: «مِنْهُمْ أُمَّةٌ مُقْتَصِدَةٌ وكَثِيرٌ مِنْهُمْ ساءَ ما يَعْمَلُونَ» (از ایشان امتی میانه‌رو هستند و بسیاری از آنان بد کاری می‌کنند). و به همین دلیل به پیامبرش فرمود: «وإِنْ تُطِعْ أَكْثَرَ من في الْأَرْضِ يُضِلُّوكَ عَنْ سَبِيلِ الله» (و اگر از بیشتر کسانی که در زمین هستند پیروی کنی، تو را از راه خدا گمراه می‌کنند) و فرمود: «ما يَعْلَمُهُمْ إِلَّا قَلِيلٌ» (آنان را جز اندکی نمی‌دانند).\n\nپس شریف‌ترین علوم، آن است که بنده از طریق وهب (بخشایش) به دست آورد، اگرچه وهب مستلزم آمادگی موهوبٌ‌إلیه (کسی که به او بخشیده می‌شود) است به واسطه اعمال پاکیزه مشروعی که بدان متصف شده است. اما چون این شرط در حصول این علم نیست، این علم از کسب فراتر می‌رود. زیرا برخی از انبیا نبوت را بدون اینکه بر عمل مشروعی باشند که با آن برای پذیرش آن آماده شوند، به دست می‌آورند. و برخی از آنان ممکن است بر عمل مشروعی باشند که همان عین آمادگی است. پس ممکن است کسی که معرفت (Ma'rifa) ندارد، خیال کند که اگر آن آمادگی نبود، نبوت حاصل نمی‌شد، و در نتیجه گمان کند که نبوت اکتسابی است. در حالی که نبوت فی‌نفسه اختصاصی الهی است که به هر که از بندگانش بخواهد عطا می‌کند، و او خبری از شریعت و غیر آن ندارد و نمی‌داند که او کیست و امر بر چه منوال است. اگر آمادگی، این علم را نتیجه می‌داد، در انبیا یافت می‌شد، در حالی که امر چنین نبوده است. زیرا نبوت غیر اکتسابی است، بدون هیچ اختلافی میان اهل کشف (Ahl al-Kashf) از اهل الله. اگرچه اهل فکر (Ahl al-Fikr) از عقلا در این باره اختلاف کرده‌اند. این امر قوی‌ترین دلیل نزد ماست بر اینکه فکر (Al-Fikr) گاهی عاقل را به صواب می‌رساند و گاهی به خطا، اما خطای آن بیشتر از صوابش است؛ زیرا فکر حدی دارد که در آن متوقف می‌شود. هرگاه در حد خود متوقف شود، قطعاً به صواب می‌رسد، و هرگاه از حد خود فراتر رود به سوی آنچه حکم نیروی دیگری است که به برخی بندگان داده می‌شود، ممکن است خطا کند و ممکن است صواب. خداوند ما و شما را از خطاهای افکار مصون بدارد و ما را به فضل خود از ذاکرین مذکور قرار دهد، که پروردگاری جز او نیست. و ما در آنچه ذکر کردیم، نظمی داریم که در سال ششصد و یکم هجری از شهر موصل برای یکی از برادران درباره نبوت نوشتم که اختصاصی از جانب خداوند متعال است و به همین دلیل زلالی آن با کدورت آمیخته نمی‌شود:\n\nبدان که رسالت برزخی است *** و صاحبش نیازی به نیت ندارد\nاگر بنای آن، نیروهایش را عطا کند *** بنیه (ساختار) آن را با قوت خود دریافت می‌کند\nو همانا اختصاص به آن وابسته است *** چنانکه اشاعره بر آن دلالت کرده‌اند\nو این حق (Al-Ḥaqq) است و در آن پوشیدگی نیست *** پس احکام کتب فلسفی را رها کن\n\nدر ابیات بسیاری، اما قصد ما به امری است که این موضع آن را می‌طلبد. و بدان که سبب ظهور کدورت‌ها (Al-Aqdār) تنها قرار گرفتن آب و سکون آن است به دلیل طلب آسایش از حرکت در غیر موضع و محل خود. و به همین دلیل از این حالت به حوض (Al-Ḥawḍ) کنایه آوردیم، زیرا قرار و سکون آب در آن است. و ما در باب غزل و نسیب، در وصف منزه بودن معشوق در ذاتش گفته‌ایم:\n\nهر کس که به او شبیه شود را راحت می‌بخشد *** با انتقال از مراتب بشری\nاز غیرت اینکه زلالی او آمیخته شود *** با آنچه در حوض‌ها از کدورت است\n\nمنظورم این است که اگر محب (Al-Muḥibb) عاشق کسی شود که صفتش این است، این معشوق بر او حکم می‌راند و او را به سوی خود منتقل می‌کند و از لباس‌های خود بر او می‌پوشاند. پس او را از آنچه عالم طبیعت از کدورت شبهات اقتضا می‌کند، خارج می‌سازد؛ اگر معشوق علم باشد، و از شبهات و حرام اگر معشوق عمل باشد، و از شهوات طبیعی اگر معشوق روحی مجرد از مواد باشد، و از بشریت اگر معشوق فرشته باشد، و از غیر خدا اگر محبوب خود خدا باشد. پس محب صادق کسی است که به صفت محبوب منتقل شود، نه کسی که محبوب را به صفت خود تنزل دهد. آیا نمی‌بینی که حق سبحانه، چون ما را دوست داشت، در لطف‌های پنهان خود به سوی ما تنزل کرد، به آنچه با ما مناسب است و شأن و کبریایی او از آن برتر است؟ پس به سوی تبشّش (مهربانی و خوشرویی) با ما تنزل کرد، هنگامی که برای مناجات به خانه‌اش می‌آییم، و به سوی شادمانی از توبه و بازگشت ما از رویگردانی‌مان، و به سوی تعجب از عدم تمایل جوان به جوانی که در محل حکم سلطان آن است (اگرچه آن نیز به توفیق اوست)، و به سوی نیابت از ما در گرسنگی، تشنگی و بیماری‌مان، و تنزل دادن خود به منزلت ما.\n\nهنگامی که یکی از بندگانش گرسنه شد، به دیگران فرمود: «جعت فلم تطعمني» (گرسنه شدم و مرا طعام ندادید). و هنگامی که دیگری از بندگانش تشنه شد، سبحانه به بنده دیگری فرمود: «ظمئت فلم تسقني» (تشنه شدم و مرا سیراب نکردید). و هنگامی که دیگری از بندگانش بیمار شد، به بنده دیگری فرمود: «مرضت فلم تعدني» (بیمار شدم و مرا عیادت نکردید). پس اگر این بندگان درباره این امور از او بپرسند، به آنان می‌گوید: «أما إن فلانا مرض فلو عدته لوجدتني عنده أما إنه جاع فلان فلو أطعمته لوجدت ذلك عندي أما إنه عطش فلان فلو سقيته لوجدت ذلك عندي» (همانا فلان بیمار شد، اگر او را عیادت می‌کردی، مرا نزد او می‌یافتی. همانا فلان گرسنه شد، اگر او را طعام می‌دادی، آن را نزد من می‌یافتی. همانا فلان تشنه شد، اگر او را سیراب می‌کردی، آن را نزد من می‌یافتی). و این خبر صحیح است.\n\nاین از ثمره محبت (Al-Maḥabba) است که به سوی ما تنزل کرد. به همین دلیل گفتیم که صدق در محبت باعث می‌شود محب به صفت محبوب متصف شود. همچنین بنده صادق در محبت پروردگارش، به اخلاق اسماء او متخلق می‌شود؛ پس به بی‌نیازی از غیر خدا، به عزت به واسطه خداوند متعال، به بخشش با دست خداوند متعال، و به حفظ با چشم خداوند متعال متخلق می‌شود. علما تخلق به اسماء الله را دانسته‌اند و در این باره کتاب‌ها نوشته‌اند. و سبب آن این است که چون او را دوست داشتند، به صفات او متصف شدند، در حدی که شایسته آنان است.\n\nسپس به آنچه در پی آن بودیم بازمی‌گردیم و می‌گوییم: «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق می‌گوید و او راه را می‌نمایاند). همانا علوم، و منظورم از آن معلومات است، اگر با ذات خود برای علم آشکار شوند و علم آنها را بر همان صورتی که در ذات خود هستند درک کند، آن علم صحیح و ادراک تام است که هیچ شبهه‌ای در آن نیست. و فرقی نمی‌کند که آن معلوم، وجود (Al-Wujūd) باشد یا عدم (Al-Adam)، نفی باشد یا اثبات، کثیف باشد یا لطیف، رب باشد یا مربوب، حرف باشد یا معنی، جسم باشد یا روح، مرکب باشد یا مفرد، یا آنچه ترکیب تولید کرده، یا نسبت باشد یا صفت یا موصوف. پس هرگاه چیزی از آنچه ذکر کردیم از اینکه با ذات خود برای علم آشکار شود، خارج گردد و در غیر صورت خود برای علم آشکار شود، مثلاً عدم (Al-Adam) در صورت وجود (Al-Wujūd) و بالعکس، و نفی در صورت اثبات و بالعکس، و لطیف در صورت کثیف و بالعکس، و رب به صفت مربوب و مربوب به صفت رب، و معانی در صور اجسام، مانند علم در صورت شیر، و ثبات در دین در صورت قید، و ایمان در صورت دستگیره (عروه)، و اسلام در صورت ستون‌ها (عمد)، و اعمال در صور اشخاص از زیبایی و زشتی؛ این همان کدورتی است که به علم می‌رسد.\n\nپس کسی که این امر بر او آشکار شده، نیازمند نیرویی الهی است که او را از این صورت به معنایی که در این صورت ظاهر شده است، منتقل سازد. و این باعث زحمت می‌شود. و سبب این امر، حضرت خیال و تمثل و نیروی متفکره است. و اصل این امر، همین جسم طبیعی است که در این منزل به حوض (Al-Ḥawḍ) تعبیر شده است. و قعر این حوض، خزانه خیال است. و کدورت آب این حوض که در قعر آن مستقر است، همان چیزی است که خیال و تخیل آن را از صورت اصلی‌اش خارج می‌سازد. پس بر بیننده، به واسطه آنچه بر او ظاهر شده، التباس عارض می‌شود. و نمی‌داند که کدام معنی این صورت را پوشیده است. پس متحیر می‌شود و این امر هرگز از نظر او رها نمی‌شود، مگر به حکم موافقت، و او بر یقین محقق در آنچه به صواب رسیده نیست، مگر با اخباری از جانب خدا.\n\nبه همین دلیل، هنگامی که ابوبکر صدیق (رضی الله عنه) در این مقام ایستاد و تعبیر رؤیا را پرسید و پیامبر (صلی الله علیه و سلم) به او امر کرد که آن را تعبیر کند، پس از فراغت، از پیامبر (صلی الله علیه و سلم) پرسید که آیا در تعبیرش به صواب رسیده یا خطا کرده است؟ رسول خدا (صلی الله علیه و سلم) به او فرمود: «أصبت بعضا وأخطأت بعضا» (بخشی را به صواب رساندی و بخشی را خطا کردی).\n\nپس صدیق، صواب رسیدن خود به حق را از خطایش در آن ندانست. به همین دلیل گفتیم که کسی که در چنین امری به صواب می‌رسد، بر یقین نیست. به همین دلیل عارفان به سوی آن متمایل شدند و از اینکه علم را جز از خدا و از طریق وهب (بخشایش) بگیرند، امتناع ورزیدند، که راه آن در اولیا، ذکر (Al-Dhikr) است نه فکر (Al-Fikr). پس اگر معانی را مجرد به آنان عطا کند و معلومات با ذات خود در صورتی که حقایق آنهاست، برایشان آشکار شود، این همان مقصود است. و اگر حق (Al-Ḥaqq) آنها را هنگام ذکر (Al-Dhikr) در غیر صورت‌هایشان برایشان آشکار سازد و ذات آنها را از ایشان پنهان کند، به آنان نیروی نفوذ و نور داده می‌شود تا از آن صور به ورای آنها نفوذ کنند، که همان چیزی است که این صور برای آن اراده شده و بدان مقید گشته‌اند. پس مشهود (Al-Mashhūd) او در هر حال، معانی‌ای است که مقصود هستند. و این معانی در عالم الفاظ و عبارات به منزله منصوص و محکم است که در آن هیچ اشکال و تأویلی نیست. و دیگری به منزله ظواهری است که معانی متعدد را در بر می‌گیرد و بیننده مقصد متکلم را از میان آنها نمی‌داند.\n\n### [علوم وهبی به حوض تشبیه می‌شود]\n\nو بدان که این علوم، اگر خداوند آنها را در غیر صورت‌هایشان به بنده عطا کند و او را از آنچه با آن اراده کرده آگاه سازد، و او به عین آن از آن صورت در آن صورت وقوف یابد، این همان چیزی است که به حوض (Al-Ḥawḍ) تشبیه شده است؛ زیرا آب را درک می‌کند و کدورتی را که در قعر حوض است نیز درک می‌کند. و آب در چشم بیننده ناگزیر رنگ آن کدورت را می‌پوشد، خواه سرخی باشد یا زردی یا هر رنگ دیگری. پس آب را سرخ یا زرد و غیره می‌بینی. به همین دلیل جنید، هنگامی که از معرفت (Al-Ma'rifa) و عارف پرسیده شد، گفت: «لون الماء لون إنائه» (رنگ آب، رنگ ظرف آن است). و چون آب این رنگ را پذیرفت، در چشم مرکب از رنگ‌پذیر و رنگ شد، در حالی که در نفس‌الامر چیز دیگری است. پس آب را می‌داند و می‌داند که آن رنگ ظرف است. همچنین است تجلیات (Al-Tajallīyāt) در مظاهر الهی، هر جا که باشند. اما عارف همیشه آنها را درک می‌کند و تجلی (Al-Tajallī) برای او دائمی است و فرقان (Al-Furqān) نزد او دائمی است. پس می‌داند چه کسی تجلی کرده و برای چه تجلی کرده است. و کیفیت تجلی (Al-Tajallī) را حق (Al-Ḥaqq) به خود اختصاص می‌دهد نه عالم، و جز خدا کسی آن را نمی‌داند، نه فرشته و نه پیامبر. زیرا این از خصائص حق (Al-Ḥaqq) است، چون ذات (Al-Dhāt) در اصل مجهول است. پس علم به کیفیت تجلی آن در مظاهر، برای هیچ یک از خلق خدا حاصل و درک نمی‌شود. این همان علمی است که غیر خود را تولید نمی‌کند. پس منقطع‌النسل است و عقبی ندارد. و آنچه غیر از این از علوم است، ممکن است علم با نظر در آن، علم دیگری را تولید کند، و جز این هم نیست، و این همان چیزی است که بیشتر در دست مردم است. زیرا اگر علم به مقدمات و آنچه از آنها تولید می‌شود و آنچه تولید نمی‌شود و سبب رابط میان آنها برایت حاصل نشود، پس از حصول این علم، علم به آنچه این ترکیب خاص عطا کرده است، برایت تولید می‌شود. و این همان تناسلی است که در علوم به منزله تناسل در گیاهان و حیوانات است. و این تناسل معانی است. به همین دلیل معانی، صور جسمانی را پذیرفتند، زیرا اجسام محل توالد هستند. اگر بگویی: پس علمی که تولید نمی‌کند، نباید صورت را بپذیرد. می‌گوییم: صورت را پذیرفت از این جهت که نتیجه‌ای از یک مولّد و نتاج است، در حالی که خودش عقیم است و اصلاً تولید نمی‌کند، مانند عقیمی که در حیوان است، با وجود اینکه از دیگری متولد شده است، اما خودش فرزندی نمی‌آورد، زیرا بر صفتی قائم است که این را اقتضا می‌کند. و به همین دلیل حق (Al-Ḥaqq) در تنزیه خود از هر دو امر فرمود: «لَمْ يَلِدْ ولَمْ يُولَدْ» (نزاده و زاده نشده است). و این تنزیه ذات (Al-Dhāt) است. پس نه تعلق می‌گیرد و نه به آن تعلق گرفته می‌شود. و نتاج تنها در مرتبه واقع شده و ظاهر گشته است. پس رب، مربوب را طلب کرد و قادر، مقدور را. اگر بگویی: پس اگر امر بر همان منوال است که در «لَمْ يَلِدْ ولَمْ يُولَدْ» ذکر کردی، باید مظاهر باطل شوند، در حالی که موجودند. پاسخ تو چیست؟ می‌گوییم: مظاهر برای مرتبه هستند نه برای ذات (Al-Dhāt). پس عبادت نمی‌شود مگر از جهت اینکه او اله است. و به اسماء او تخلق نمی‌شود، که عین عبادت اوست، مگر از جهت اینکه او اله است. و از مظاهر او در مظاهرش فهمیده نمی‌شود مگر اینکه او اله است. پس این را بدان. و اگر مظاهر را ذات (Al-Dhāt) از جهت اینکه ذات است، آشکار می‌ساخت، شناخته می‌شد. و اگر شناخته می‌شد، احاطه می‌شد. و اگر احاطه می‌شد، محدود می‌شد. و اگر محدود می‌شد، مالکیت بر آن حاصل می‌شد. و ذات حق (Al-Ḥaqq) از همه اینها بسیار برتر است. پس دانستیم که بین ذات و این مظاهر نسبتی وجود ندارد که علم از جهت نسبت مظهر به آن، بدان تعلق گیرد. و اگر چنین علمی در نفوس عالمان به خدا حاصل نشود، و خداوند از آن برتر است، پس بسیار بعیدتر است که نسبت ذات به مظاهر دانسته شود. اگر بگویی: نسبت یکی است، اما دو طرف دارد، یک طرف از جهت ذات و یک طرف از جهت مظهر. می‌گوییم: امر آن‌گونه که تو گمان می‌کنی نیست که نسبت میان متضایفین (دو امر متقابل) یکی باشد. زیرا نسبت فرزند به والد، نسبت بنوت (فرزندی) است و بنوت انفعال است. و نسبت والد به فرزند، نسبت ابوت (پدری) است و ابوت فاعلیت است. و کجا فاعل بودن مانند منفعل بودن است؟ هیهات! پس نسبت یکی نیست و اصلاً دو طرف ندارد. زیرا تقسیم‌پذیری آن معقول نیست، منظورم این نسبت خاص است. و آن طرفی که تو با خیال خود برای نسبت قرار دادی، همان نسبتی است که ذکر می‌شود. زیرا دو طرف برای شیئی که بدانها وصف می‌شود، به تقسیم آن اشاره دارد، در حالی که معنی تقسیم نمی‌شود، زیرا مرکب نیست.\n\nو آنچه این علم که به حوض‌ها تشبیه شده، تولید می‌کند، مناجات حق (Al-Ḥaqq) از جهت سینه (صدر) است. و آن مناجات تو با اوست در هنگام صدور تو از او، زمانی که به تو امر کرد که برای تبلیغ به سوی بندگانش خارج شوی، اگر رسول باشی، و برای تثبیت، اگر وارث باشی. و این مناجات از او به سوی تو، جز در خودت نیست، نه در غیر تو. پس او را از خودت می‌شناسی نه از غیر خودت، زیرا تو نزدیک‌ترین حجاب و پرده آویخته بر او هستی. و از جهت اینکه تو پرده و حجاب هستی، او را محدود کرده‌ای. پس معرفت (Ma'rifa) تو به او در این موطن، عین عجز تو از معرفت اوست. و اگر بخواهی می‌گویی: عین جهل به اوست. و منظور ما از جهل، عدم علم است.\n\nاما غیر، حجابی دورتر است نسبت به تو. زیرا خداوند خود را جز به نزدیکی به تو وصف نکرده است. و همچنین نزدیکی او به غیر تو، نسبت به آن غیر، مانند نزدیکی او به توست. پس وصف او به نزدیکی به تو، نسبت به غیر تو دورتر است، هنگامی که غیر تو بخواهد علم به او را از تو بگیرد، همان‌گونه که تو اگر بخواهی علم به او را از غیر خود بگیری. خداوند متعال فرمود: «ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ» (و ما از رگ گردن به او نزدیک‌تریم). پس نزدیکی خود به اشیا را اثبات کرد و علم به کیفیت نزدیکی خود به اشیا را نفی کرد، با قول خداوند متعال: «ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ» (و ما از شما به او نزدیک‌تریم، ولی شما نمی‌بینید). پس بصیرت و بصر را عمومیت داد، زیرا ادراک بصر در باطن، بصیرت نامیده می‌شود، و ذات یکی است و مواطن بر آن مختلف شده است. پس در ادراک محسوس، بصر نامیده می‌شود و در ادراک معانی، بصیرت. پس مُدرِک در هر دو یکی است. و چون بر حوضی که در سرای آخرت است، به تعداد نوشندگان آن، جام‌های بسیاری وجود دارد، و آب در ظرف به شکل و رنگ ظرف است، قطعاً دانستیم که علم به خداوند سبحانه، به اندازه نظر و آمادگی تو و آنچه در نفس خود بر آن هستی، می‌باشد. پس هرگز دو نفر در علم واحدی درباره خدا از جمیع جهات جمع نشده‌اند، زیرا هرگز مزاج واحدی در دو نفر جمع نشده است و صحیح نیست؛ زیرا در دو چیز باید چیزی باشد که به واسطه آن امتیاز حاصل شود تا عین هر یک ثابت گردد. و اگر چنین نبود، صحیح نبود که آن دو، دو چیز باشند. پس هیچ کس از حق (Al-Ḥaqq) جز نفس خود را نشناخت.\n\nپس اگر با کسی که بر او تجلی کرده، همان‌گونه رفتار کند که او با وی رفتار کرده است، و ثابت شده است که عمل او به خودش بازمی‌گردد، چیزی از آن به خدا نمی‌رسد.\nپیامبر (صلی الله علیه و سلم) فرمود: «إنما هي أعمالكم ترد عليكم» (همانا اینها اعمال شماست که به شما بازگردانده می‌شود).\nپس حق (Al-Ḥaqq) از اعمال شما، بر شما خلعت‌هایی می‌پوشاند، به اندازه‌ای که آنها را حفظ کرده و به اصولشان اهمیت داده‌اید. پس برخی حریر می‌پوشند و برخی مشاقه کتان و پنبه و آنچه میان آنهاست. پس جز خودت را ملامت نکن و بافنده را ملامت نکن، زیرا او جز نخ تو را نبافته است. اگر بگویی: چگونه می‌گویی «چیزی از آن به خدا نمی‌رسد» در حالی که سبحانه فرمود: «يَنالُهُ التَّقْوى‏ مِنْكُمْ» (تقوای شما به او می‌رسد)؟ باید بدانی که مراد از اثبات رسیدن در اینجا و عدم رسیدن در جانب حق (Al-Ḥaqq) این است که خداوند سبحانه چیزی از اعمال خلق که آنان را به انجام آن مکلف کرده، به او نمی‌رسد به معنای نیاز به آن و زینت گرفتن با آن تا حالتی برای او حاصل شود که قبلاً بر آن نبوده است. بلکه تقوا به او می‌رسد، یعنی اینکه او را سپری قرار دهید در برابر آنچه به شما امر کرده که با آن تقوا پیشه کنید، بر درجات و منازل تقوا. پس فرمود: «فَاتَّقُوا النَّارَ» (پس از آتش بپرهیزید) و «واتَّقُوا الله» (و از خدا بپرهیزید) و «قُوا أَنْفُسَكُمْ وأَهْلِيكُمْ» (خود و خانواده‌تان را حفظ کنید). پس معنای «يَنالُهُ التَّقْوى‏» این است که آن را از تو می‌گیرد تا آن را با دست خود بر تو بپوشاند، به جهت تشریف تو، زیرا بدون واسطه بر تو خلعت پوشانده است، در حالی که غیر متقی آن را بدون دست حق می‌پوشد. و فرقی نمی‌کند که خلعت از لباس‌های فاخر باشد یا پست، این به خود تو بازمی‌گردد. زیرا او از تو جز آنچه به او داده‌ای، نمی‌گیرد، حتی اگر آن تقوا باشد. زیرا سبحانه چیزی از غیر متقی نمی‌گیرد. به همین دلیل خود را وصف کرده است که تقوا از بندگان به او می‌رسد. و حق سبحانه به این وصف شده است که تقوا به او می‌رسد و گوشت‌ها و خون‌ها به او نمی‌رسد، زیرا رسیدن به حکم اتفاق است نه به حکم قصد. نیل را به مخلوق نسبت داد، زیرا او متعالی است از اینکه از جایی که می‌داند، قصد شود. بلکه به حکم اتفاق و تصادف به او می‌رسد. و حق (Al-Ḥaqq) منزه است از اینکه اشیا را به حکم اصابت بداند، به طوری که علم او به اشیا اتفاقی باشد. پس هنگامی که تقوا از متقی به او برسد و در برابر او خدمت کند و ذات خود را در برابر او تسلیم آنچه در او انجام می‌دهد، قرار دهد، سبحانه در آن هنگام از علم بر متقی خلعت می‌پوشاند. و شأن این علم آن است که از جانب خداوند متعال به بنده از هر وجهی از وجوه عطا حاصل شود، تا هر گیرنده‌ای نصیبی از آن بگیرد. پس برخی آن را از دست کرم می‌گیرند، برخی از دست جود، برخی از دست سخاوت، و برخی از دست منت و فضل. مگر ایثار (Al-Īthār)، که در این حضرت الهی دستی ندارد، زیرا او از روی نیاز عطا نمی‌کند. اما چون اسماء الهی می‌خواهند که اعیان و احکامشان در وجود کونی ظاهر شود، چنین تصور می‌شود که عطای آنها از روی نیاز به گیرنده است.\n\nپس از این بو، بوی ایثار (Al-Īthār) به مشام می‌رسد، در حالی که صحیح نیست. و تنها گروهی که خداوند بصیرتشان را کور کرده است، در این امر افتاده‌اند. به همین دلیل عارفان در تخلق به اسماء، به انواع عطا متصف شدند، نه به ایثار. زیرا آنان در این امر امین هستند و ایثار نمی‌کنند، چون ایثار حقیقی (نه مجازی) نزد آنان متصور نیست. و عارف نمی‌گوید: «به شما عطا کردم»، بلکه می‌گوید: «به تو عطا کردم»، زیرا هرگز دو نفر در یک عطا شریک نمی‌شوند. به همین دلیل مفرد می‌آورد نه جمع. پس جمع در این مورد، توسعه در خطاب است و حقیقت همان است که ذکر کردیم. و سخن در این منزل، میدان وسیعی دارد که وقت گنجایش آن را ندارد. «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق می‌گوید و او راه را می‌نمایاند).\n\nمنازل حوض و اسرار آن *** مراتب علم و انوار آن است\nو آن از علمی است که پیوسته *** زلالی‌اش با کدورت‌هایش آمیخته شده است\nمحل آن، طبیعت است که آن را وصله کرده *** و قعر (حوض) با غبارش آن را درمی‌یابد."
  },
  "page_count": 5
}