{
  "id": 352,
  "title": {
    "ar": "الباب الثاني والخمسون وثلاثمائة في معرفة منزل ثلاثة أسرار طلسمية مصورة مدبرة من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Fifty-Two: Concerning the Gnosis (معرفة) of the Station (منزل) of Three Talismanic Secrets, Formed and Governed from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو باون: حضرت محمدیہ (الحضرة المحمدية) سے تین طلسمی (طلسمية)، مصور (مصورة) اور مدبر (مدبرة) اسرار کی منزل (منزل) کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب سیصد و پنجاه و دوم در معرفت منزل سه سرّ طلسمی مصوّر و مدبّر از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الثاني والخمسون وثلاثمائة في معرفة منزل ثلاثة أسرار طلسمية مصورة مدبرة من الحضرة المحمدية»\n\n\n> يا قرة العين إن القلب يهواك *** لولاك ما كنت في قتلاك لولاك‏\n\n\n> ما لي سوى عين مالي قد علمت به *** فإن رضيت بذاك القدر أغناك‏\n\n\n> إن الوجود له فقر ومسكنة *** إلى الكمال فبيت الفقر مأواك‏\n\n\n> لا تعجزن لإدراك الكمال فما *** في الكون من يعرف المطلوب إلاك‏\n\n\n### [سمي الطلسم بهذا الاسم لمقلوبه يعني أنه مسلط على كل من وكل به‏]\n\n\nاعلم أيدك الله أنه إنما سمي الطلسم بهذا الاسم لمقلوبه يعني أنه مسلط على كل من وكل به فكل مسلط طلسم ما دام مسلطا فمن ذلك ما له تسليط على العقول وهو أشدها فإنه لا يتركها تقبل من الأخبار الإلهية والعلوم النبوية الكشفية إلا ما يدخل لها تحت تأويلها وميزانها وإن لم يكن بهذه المثابة فلا تقبله وهذا أصعب تسليط في العالم فإن صاحبه المحجور عليه يفوته علم كثير بالله فطلسمه الفكر وسلطه الله عليه أن يفكر به ليعلم أنه لا يعلم أمر من الأمور إلا بالله فعكس الأمر هذا المسلط فقال له لا تعلم الله يا عقل إلا بي والطلسم الآخر الخيال سلطه الله على المعاني يكسوها مواد يظهرها فيها لا يتمكن لمعنى يمنع نفسه منه والطلسم الثالث طلسم العادات سلطه الله على النفوس الناطقة فهي مهما فقدت شيئا منها جرت إليه تطلبه لما له عليها من السلطان وقوة التأثير وما يتميز الرجال إلا في رفع هذه الطلسمات الثلاثة\n\n\nفأما الطلسم الأول‏\n\n\nفرأيت جماعة من أهل الله قد استحكم فيهم سلطانه بحيث إنهم لا يلتذون بشي‏ء من العلوم الإلهية التذاذهم بعلم يكون فيه رائحة فكر فيكونون به أعظم لذة من علمهم بما يعطيهم الايمان المحض بنوره الذي هو أكشف الأنوار وأوضحها بيانا وسبب ذلك ما نذكره وذلك أن نور الايمان وهب إلهي ليس فيه من الكسب شي‏ء ولا أثر للادلة فيه البتة فإنا قد رأينا من حصل العلم بالأدلة وبما دلت عليه بحيث لا يشك ومع هذا لا أثر للإيمان فيه بوجه من الوجوه فلما خرج عن كسب العبد فكأنه إذا فرح بما أعطاه نور الايمان من العلم فرح بما ليس له وأنه إذا أعمل الفكر في تحصيل علم بأمر ما وحصل له عن فكره ونظره فيه واجتهاده كان له تعمل واكتساب فكانت لذته بما هو كسب له أعظم مما ليس له فيه كسب لأنه فيما اكتسبه خلاق ولم يكن ذلك من هؤلاء إلا لجهلهم بأصولهم وبنفوسهم لأنهم لو علموا أنهم ما خرجوا من العدم إلى الوجود إلا بالمنة والوهب وهبة الله لهم فأوجدهم فلم يكن لهم تعمل في ذلك وهم في غاية من الالتذاذ بوجودهم فكانوا على ما يعطي هذا الأصل أفرح بعلوم الوهب الذي يعطيهم نور الايمان من الذي يعطيهم الفكر بنظره‏\nثم الحجاب الآخر في جهلهم بنفوسهم وبما فيهم إن العقل والفكر ما حصل لهم من الحق بتعمل ولا اكتساب بل بوهب إلهي وهم به فرحون فهلا كان فرحهم بما وهبهم الحق من العلم بنور الايمان أعظم من فرحهم بما نالوه من جهة الفكر ثم إنهم من جهلهم وحجابهم إنهم يشهدون في أوقات في علم ما اتخذوه بالفكر شبها تدخل عليهم فيه فتزيله من أيديهم أو تحيرهم فيه فيغتمون لذلك الغم الشديد ويعملون فكرهم في أمر من أنواع الدلالات إما أن يزيل عنهم تلك الشبهات حتى يعلموا أنها شبهات فيرجعوا إلى ما كانوا عليه بلا مزيد ويخسرون ما يعطيه المزيد الإلهي في كل نفس وإما أن يعطيهم الفكر أن تلك الشبهة ليست بشبهة بل هي دليل أعطاهم العلم بضد ما كانوا عليه وأين الأمر الذي كانوا عليه فيفرحون به ويقولون هو علم لم يكن كذلك بل كان شبهة فلو فتح الله عليهم لكانوا في هذا الذي رجعوا إليه تحت إمكان أيضا كما ظهر لهم في حكم الأول الذي رجعوا عنه فلو لم يكن لصاحب الفكر في العلم الإلهي صارف يصرفه عنه إلا هذا لكان فيه كفاية وكلامنا هذا إنما هو في حق المؤمنين من أهل الله وأما من يرى أنه لا يأخذ إلا من الأرواح العلوية وإنها الممدة لهم وإنهم يستنزلونها لتفيدهم وأن جميع ما هم فيه إنما هو منهم كما يرون أن كل ما يحجبهم عن مثل هذا إنما هو نظرهم إلى شهواتهم واشتغالهم بالأمور الطبيعية من أكل وشرب ونكاح وغير ذلك من مثل هذه الأمور فلا كلام لنا معهم فإنهم عبيد أكوان لا عبيد الله ليس لهم من الله رائحة إلا بعلم واحد إنه الأصل من غير تفصيل ولا استرسال واستصحاب وظهور في كل جزء جزء من العالم الأعلى مساحة ومعنى والعالم الأسفل مساحة ومعنى فهم عن هذا كله محجوبون وبه غير قائلين ولما كان الطلسم في أصل الوضع لا يضعه واضعه إلا لخفاء ما يمكن أن يشهد ويحصل أعملت الحيلة في رفع حكم ذلك الطلسم حتى يبدو ما كان يخفيه مما ينتفع به فالإنسان من حيث قيوميته التي يعتقدها في نفسه هو طلسم على نفسه وبتلك القيومية استخدم فكره وجميع قواه لأنه يعتقد أنه رب في ذاته وفي ملكه مالك ثم رأى الحق قد كلفه واستعمله فزاد تحقيقا في قيوميته ولو لم يكن له قيام بما كلفه الحق ما كلفه فيقول باستعمالي لهذه القوي يكون لي الدليل على أني صدقت ربي وهو الصادق فيما كلفني به من استعمالها ولم يتحقق هذا المسكين المواضع التي يستعملها فيها ثم إنهم رأوا أن أشرف ما يكتسبونه بها العلم بذات الله وما ينبغي لها أن تكون عليه فتركوا استعمال قواهم فيما يمكن لهم أن يصلوا إليه واستعملوها فيما لا يمكن الوصول إليه مع تبيين الحق لهم فيما شرع من قول الله ويُحَذِّرُكُمُ الله نَفْسَهُ أي لا تستعملوا فيها الفكر\n\n\nوقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لا تتفكروا في ذات الله‏\n\n\nفعصوا الله ورسوله مع أنهم من أهل الله بالمعصية المقدرة عليهم فلا بد من نفوذ حكمها فيهم فالله يجعلنا ممن عصمه الله أن يستعمل قواه فيما ليس لها التصرف فيه إنه ولي كريم منعم محسان فإذا أراد الله أن يوفقك لرفع حكم هذا الطلسم حتى تشهد ما حجبك\n\n\nعنه وفقك لإزالة قيوميتك بقيوميته واستعملك في فقرك وذلك وشهود أصلك واستعمل فكرك في أنك لك موهوب وإنك صادر من عين منته عليك في وجودك وفي تقلبك في أطوار نشأتك المحسوسة والمعنوية وفي إسلامك وإيمانك إلى أن جعلك من أهله واصطنعك لنفسه وحجب غيرك ممن هو مثلك لا ليد لك عليه بل سابق عناية بك ومنة اختصاص فإذا وفقك لمثل هذا النظر وفقك للنظر أيضا في قواك وما بين لك من مصارفها فلم تتعد بها مصرفها الإلهي ووقفت عند حدوده وعرفت قدرك فعرفت قدره وجعلت أمرك كله فيما تصرفت فيه وهبا إلهيا من عين منته ونظرت إليه بنور الايمان الذي وهبك إياه فأشهدك الأمور كما هي عليه في نفسها وكشف لك عن الحق ورزقك اتباعه وكشف لك عن الباطل ورزقك الاجتناب عنه ورأيت جماعة في هذا الكشف من أصحاب الأفكار العقلاء النظار قد أراهم الفكر الحق باطلا فحققوه فاجتنبوا الحق واتبعوا الباطل ولا علم لهم بذلك إذ الباطل في جبلة كل أحد اجتنابه فإذا رأيتهم على ذلك رحمتهم فربما تدعوهم إليه وهم يَقْذِفُونَ بِالْغَيْبِ من مَكانٍ بَعِيدٍ فيجهلونك فيما تدعوهم إليه من الحق كما كان صَلَّى اللهُ عَليهِ وسَلَّم يدعو أهل الشرك إلى التوحيد فيقول إذا دعاهم إلى ذلك ودعوه إلى ما هم عليه ما لِي أَدْعُوكُمْ إِلَى النَّجاةِ وتَدْعُونَنِي إِلَى النَّارِ تَدْعُونَنِي لِأَكْفُرَ بِاللَّهِ وأُشْرِكَ به ما لَيْسَ لِي به عِلْمٌ وأَنَا أَدْعُوكُمْ إِلَى الْعَزِيزِ الْغَفَّارِ فيا ولي لا تقل في جوابي إنهم أيضا يقولون له مثل ما قال لهم ليس الأمر كذلك فإنهم‏\nمشركون فقد أثبتوا بكونهم مشركين عين ما دعاهم إليه هذا الرسول وهو ما أثبت الشريك وهم قالوا إنما ندعوهم لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فأثبتوا له سبحانه وتعالى التعظيم والمنزلة العظمى التي ليست لشركائهم فمن هناك لم يتمكن لهم أن يقولوا في الجواب مثل ما قال لهم فإنه قال لهم ما ليس لي به علم وهم علماء بما دعاهم الرسول إليه فلما دعاهم دعاهم بحالهم ولسانهم من حيث ما أثبتوا عين ما دعاهم إليه وزادوا الشريك الذي لا علم لمحمد صَلَّى اللهُ عَليهِ وسَلَّم به فإذا قال صاحب الكشف لصاحب الفكر مثل هذا كان جواب صاحب الفكر له أشد في البعد عن الله من المشركين مع رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وكان المشركون أسعد حالة من أصحاب الفكر فإنهم أثبتوا على كل حال عين ما دعاهم إليه أنه له المنزلة العليا وهؤلاء قالوا إن الله لا يعلم ما نحن عليه حيث قالوا إنه أعظم من أن يعلم الجزئيات بل علمه في الأشياء علم كلي وهو أن يعلم أن في العالم من يتحرك ويسكن لا أنه يعلم أن زيد بن عمرو هو المتحرك عند زوال الشمس هذا أعطاهم فكرهم فمن هنا يعلم أن المشرك أسعد حالا منهم وأعطاهم فكرهم إن هذه النواميس الإلهية السائرة في العالم إمداد الأرواح العلوية للنفوس الفاضلة القابلة لمصالح العالم في الدنيا فهي أوضاع روحانية على السنة قوم قد خلصوا نفوسهم من رق الشهوات وأسر الطبيعة وصفوا مرائي قلوبهم فأقبلت عليهم الأرواح العلوية وجالسوا بأفكارهم الملأ الأعلى فأمدهم بما وضعوه في العالم من أسباب الخير فسموا أنبياء وحكماء ورسلا وليس إلا هذا وجعلوا ما وضعوه من الوعد والوعيد المغيب المسمى الدار الآخرة سياسات يسوسون بها النفوس الشوارد عن النظر فيما ينبغي لهم مما وجدوا له لا غير ونعوذ بالله من هذا القول وهذا العلم فهذا ما أعطاهم الفكر حيث استعملوه في غير موطنه وذهبوا به في غير مذهبه والله يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ‏\n\n\nوأما الطلسم الثاني وهو الخيال‏\n\n\nفيجسد المعاني ويدخلها في قالب الصور الحسية فهو طلسم أيضا على أهل الأفهام القاصرة التي لا علم لها بالمعاني المجردة عن المواد فلا تشهدها ولا يشهد هؤلاء إلا صورا جسدية فيحرم من حكم عليه طلسم الخيال إدراك الأمور على ما هي عليه في أنفسها من غير تخيل فهؤلاء لا يقبلون شيئا من المعاني مع علمهم بأنها ليست صورا جسدية إلا حتى يصوروها في خيالهم صورا متجسدة متحيزة متميزة فيجمعون بين النقيضين فأنتم تعلمون أنها ليست صورا ولا يقبلونها إلا صورا فمن أراد رفع حكم هذا الطلسم فإن الطلسم لا يرتفع أبدا من هذه النشأة فإنه وضع إلهي وكذلك جميع الطلسمات الإلهية لا ترتفع أعيانها ولا ترفع أحكامها في الموضع الذي جعل الحق تعالى حكمها فيه ولكن بعض الناس خرجوا بها عن طريقها فذلك الحكم الذي أعطاه ذلك الخروج هو الذي يرتفع لا غيره فاعلم ذلك فيرتفع حكم صاحب هذا الطلسم إذا أبصر الفكر قد دخل لخزانة هذا الخيال ثم انصرف خارجا منه فيصحبه إلى العقل ليشاهد المعاني مجردة عن الصور كما هي في نفسها فأول ما يشهد من ذلك حقيقة الفكر الذي صحبه إلى العقل فيراه مجردا عن المواد التي كان الخيال يعطيه إياها فيشكر الله ويقول هكذا كنت أعلمه قبل إن أشهده وما كان الغرض إلا أن يوافق الشهود العلم فإذا ارتفع إلى العقل شاهده أيضا مجردا عن المواد في نفسه فيحصل له أنس بعالم المعاني المجرد عن المواد فإذا تحقق بهذه المشاهدة انتقل إلى مشاهدة الحق الذي هو أثره في التجرد من المعاني فإنه وإن تجردت المعاني المحدثة فما تجردت عن حدوثها وإمكانها فيشاهد فيها صاحب هذا المقام عدمها الأصلي الذي كان لها ويشاهد حدوثها ويشاهد إمكانها كل ذلك في غير صورة مادية فإذا ارتقى إلى الحق فأول ما يشاهد منه عين إمكانه فيقع له عند هذا تحير فيه فإنه علمه غير ممكن فيأخذ الحق بيده في ذلك بأن يعرفه أن الذي شاهده من الحق ابتداء عين الإمكان الذي يرجع إلى المشاهد وهو الذي يقول فيه إنه يمكن أن يشهدني الحق نفسه ويمكن أن لا يشهدني فهذا الإمكان هو الذي ظهر له من الحق في أول شهوده فإنه قد ترجح له بالشهود أحد الوجهين من الإمكان فيسكن عند ذلك وتزول عنه الحيرة ثم يتجلى له الحق في غير مادة لأنه ليس عند ذلك في عالم المواد فيعلم من الله على قدر ما كان ذلك التجلي ولا يقدر أحد على تعيين ما تجلى له من الحق إلا أنه تجلى في غير مادة لا غير وسبب ذلك أن الله يتجلى لكل عبد من العالم في حقيقة ما هي عين ما تجلى بها لعبد آخر ولا هي عين ما يتجلى له بها في مجلى آخر فلذلك لا يتعين ما تجلى فيه ولا ينقال فإذا رجع هذا العبد من هذا المقام إلى عالم نفسه عالم المواد\nصحبه تجلى الحق فما من حضرة يدخلها من الحضرات لها حكم إلا ويرى الحق قد تحول بحكم تلك الحضرة والعبد قد ضبط منه أو لا ما ضبط فيعلم أنه قد تحول في أمر آخر فلا يجهله بعد ذلك أبدا ولا ينحجب عنه فإن الله ما تجلى لأحد فانحجب عنه بعد ذلك فإنه غير ممكن أصلا فإذا نزل العبد إلى عالم خياله وقد عرف الأمور على ما هي عليه مشاهدة وقد كان قبل ذلك عرفها علما وإيمانا رأى الحق في حضرة الخيال صورة جسدية فلم ينكره وأنكره العابر والأجانب ثم نزل من عالم الخيال إلى عالم الحس والمحسوس فنزل الحق معه لنزوله فإنه لا يفارقه فيشاهده صورة كل ما شاهده من العالم لا يخص به صورة دون صورة من الأجسام والأعراض ويراه عين نفسه ويعلم أنه ما هو عين نفسه ولا عين العالم ولا يحار في ذلك لما حصل له من التحقيق بصحبة الحق في نزوله معه من المقام الذي يستحقه ولا عالم وراءه يتحول في كل حضرة بحسب حكمها وهذا مشهد عزيز ما رأيت من يقول به من غير شهود إلا في عالم الأجسام والأجساد وسبب ذلك عدم الصحبة مع الحق لما نزل من المقام الذي يستحقه فكان القائلون به في عالم الأجسام والأجساد مقلدين ويعرف ذلك من كونه لا يصحبهم ذلك وتتوالى الغفلات عليهم فإذا حضروا بنفوسهم حينئذ يقولون بذلك وصاحب الذوق لا غفلة عنده عن ذلك جملة واحدة فإنه معلوم عنده والغفلة إنما تكون عن شي‏ء دون شي‏ء لا تعم فكل ما يبقى من الأمور غير مشهود لصاحب الغفلة فإن صاحب الذوق يشهد الحق فيه فما بقي له مشهود في حال غفلته ومن ليس له هذا المقام ذوقا يغفل عن الحق بالأشياء حتى يستحضره في أوقات ما فهذا هو الفارق بين أصحاب الذوق وبين غيرهم فلا تغالط نفسك وما رأيت واحدا من أهل هذا المقام ذوقا إلا أنه أخبرتني أهلي مريم بنت محمد بن عبدون أنها أبصرت واحدا وصفت لي حاله فعلمت أنه من أهل هذا الشهود إلا أنها ذكرت عنه أحوالا تدل على عدم قوته فيه وضعفه مع تحققه بهذا الحال والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\nوأما الطلسم الثالث وهو طلسم العادات‏\n\n\nالحاكمة على النفوس الناطقة لما حصل لها من الألفة بها وتوقف المنافع والمصالح عليها دائما لا يرتفع فإذا أراد من أراد أن يرتفع عن حكم هذا الطلسم إذ علم أنه لا يرتفع فإن الأسباب المألوفة هي أوضاع إلهية لا يمكن رفعها ولا دفعها يرجع هذا الشخص إلى النظر في وجهه الخاص به الذي لا أثر للسبب فيه وهو خفي جدا فيعمد إلى بابه فيفتحه ويكثر العكوف عليه ويحس بالأسباب تجذبه عنه ليأخذ منها ما بيدها من الأمانات له فلا يفعل ولا يقبل ما تأتيه به فإذا جاءه خاطر أن ذلك سوء أدب مع الله فخذ ما أعطاك وكُنْ من الشَّاكِرِينَ وإن هذه الأسباب لا يمكن رفعها فلا تبطل حكمة الله في حقك فتكون من الجاهلين فلا يصغ إلى هذا العتب ولا إلى هذا المعلم فإنه خاطر نفسي ما هو خاطر إلهي وليثبت على اعتكافه بالباب الخاص وليقل لذلك المعلم إن الله قد نهى أن تؤتى البيوت من ظهورها فلو كنت من الله لأتيت البيوت من أبوابها وأنا بيت لا يزيده على هذا فإذا أراده الحق لذلك المقام أدخل عليه ذلك السبب بما عنده من الأمانة له على باب ذلك الوجه الخاص الذي قد واجهه هذا العبد واعتكف عليه وذلك هو باب بيته فإذا أعطاه ذلك السبب ما أعطاه قبله منه لأنه ما جاءه إلا من باب الوجه الذي يطلب الأمر منه وقد أتى البيت هذا السبب من بابه وهذا هو المسمى خرق العوائد في العوائد فإن العالم لا يشهدون صاحب هذا المقام إلا آخذا من الأسباب فلا يفرقون بينهم وبينه فهو وحده يعرف كيف أخذ وليس هذا المقام إلا للملامية وهم أعلى الطوائف فإنهم في خرق العادة في عين العادة وبينهم في المقام ما بين المحجوب والمشاهد ولكن لا يشعرون وأصحاب خرق العوائد الظاهرة ما لهم هذا المقام ولا شموا منه رائحة أصلا وهم الآخذون من الأسباب فإن الأسباب ما زالت عنهم ولا تزول ولكن خفيت فإنه لا بد لصاحب خرق العادة الظاهرة من حركة حسية هي سبب وجود عين ذلك المطلوب فيغرف أو يقبض بيده في الهواء فيفتحه عن مقبوض عليه من ذهب أو غيره فلم يكن إلا بسبب حركة من يده وقبض فما خرج عن سبب لكنه غير معتاد بالجملة لكن القبض معتاد وحركة اليد معتادة وتحصيل هذا الذي حصل له من غير هذا الوجه معتاد وتحصيله من هذا الوجه غير معتاد فقيل فيه إنه خرق عادة فاعلم ذلك فمن أراد رفع حكم طلسم العادات فليعمل نفسه فيما ذكرناه فلا تحكم عليه العوائد وهو في العوائد غير معروف عند العامة والخاصة ومن علوم هذا المنزل علم الإشارات والخطاب وفيه علم الدخل بالشبه على أصحاب الأدلة وفيه علم الاسم الذي توجه على الخلق بالإيجاد والتقدير وعلم ما بين‏\nالإيجاد والتقدير من المدة وفيه علم ترتيب الموجودات في الإيجاد بمرور الأزمان وعلى من مرت هل على الموجد أو على الموجودات فيعلم من تقيد بها وهل كان ذلك التقييد بها اختيارا أو شيئا لا بد منه وفيه علم ما إذا توجه الحق على إيجاد أمر ما هل في ذلك أعراض عن أمر آخر أم لا وفيه علم لما ذا يستند الفكر في حكمه وهل له سلطان إلهي يعضده حتى يتمسك بذلك أهل الأفكار أم لا وإن لم يشعروا بذلك أو ربما أحالوه لو بين لهم وهو في نفس الأمر صحيح وفيه علم نزول الأمر الإلهي ورجوعه إلى ما منه نزل وكم مدة ذلك من الزمان وفيه علم ارتباط السبب بالمسبب اسم فاعل بكسر الباء وهل يصح فعل ذلك من الله من غير هذا السبب المعين أو من غير سبب أم لا وفيه علم ارتباط العلم والرحمة والعزة مع ما بين الرحمة والعزة من التنافر وفيه علم الأعلى في الأنزل وما ثم علم الأنزل في الأعلى وفيه علم الأحسن في عالم الأمر والخلق وبما هو أحسن وما ثم قبيح ولا مفاضلة في الحسن وفيه علم منزلة هذه النشأة الإنسانية على غيرها من النشآت والعناية بها مع كونها خلقت لشقاء ولسعادة وكان الأمر يقتضي أن لا شقاء لما ظهر من العناية بها وفيه علم ما يتولد عن هذا الإنسان في العالم من الأمور وفيه علم المساكن وما قدم منها وما أخر وما يتبدل منها وما لا يتبدل وما يلحقه التغيير وما لا يلحقه التغيير وفيه علم ما يختلف فيه نشأة الإنسان في الدارين من حيث صورته الظاهرة وما لا يختلف من نشأته في صورة روحه أو لتلك النشأة الأخرى روح آخر يخلقه الله لها بحسب استعدادها وكيف هو الأمر في نفسه إذ قد وردت الإعادة فما حقيقتها وفيما ذا تكون وهو علم غريب وفيه علم كون الحق لا يلقاه العبد إلا بالموت وهل هو لقاء خاص أو ما ثم لقاء إلا بالموت وفيه علم الموت وبيد من هو وفيه علم اختلاف العالم لما ذا يرجع في صوره وتخيله وفيه علم التحديد الإلهي في الآخرة مع كونها دار كشف للحقائق عند الناس أو حكمها حكم الدنيا في بعض الأمور وفيه علم ما يردك إلى مشاهدة حقيقتك وأن في ذلك سعادتك وفيه علم حب الإنسان بالطبع في أن يكون قيوما مع ذله وافتقاره وما الذي يدعوه إلى ذلك ثم اختلافهم في القيام فمنهم من يقوم عبدا ومنهم من يقوم سيدا والذي يقوم سيدا منهم من يقوم سيدا بالحجاب ومنهم من يقوم سيدا بكشف صحيح وفيه علم ما لا يعلم إلا هناك وفيه علم أدنى الدني وأدنى الدنو وما حقيقة هذا وفيه علم اختلاف أسماء أهل الاستحقاق مع وجود الاستحقاق وفيه علم الأولوية وفيه علم الحكم الإلهي يوم القيامة بما ذا يحكم ويفصل وفيه علم الإستبصار وعلم ما ينفع من الخطاب وعلم الفتح الإلهي والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر الثالث والعشرون‏\n\n\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "## Chapter Three Hundred and Fifty-Two: Concerning the Knowledge of the Station of Three Talismanic Secrets Formed and Governed from the Muhammadan Presence\n\nO coolness of the eye, the heart desires you,\nWere it not for you, I would not be among your slain, were it not for you.\n\nI have nothing but the essence of my wealth, which I have known,\nIf you are content with that destiny, it will enrich you.\n\nIndeed, Existence (الوجود) has poverty and destitution\nTowards Perfection, so the house of poverty is your refuge.\n\nDo not fail in attaining Perfection, for there is not\nIn the cosmos anyone who knows the Desired One except you.\n\n### [The Talisman (طلسم) was named by this name due to its inversion, meaning that it is given authority over everyone entrusted to it.]\n\nKnow, may Allah support you, that the Talisman (طلسم) was only named by this name due to its inversion, meaning that it is given authority over everyone entrusted to it. Thus, every authority is a Talisman as long as it holds authority.\n\nAmong these is that which has authority over the intellects (العقول), and it is the most severe. For it does not allow them to accept anything from the Divine reports and the prophetic sciences of Unveiling (الكشفية) except what falls under their interpretation and their measure. If it is not of this standard, they do not accept it. This is the most difficult authority in the world, for its owner, who is restricted, misses much Knowledge (علم) of Allah.\n\nSo his Talisman is Thought (الفكر), and Allah gave him authority over it so that he might think by it, to know that he knows nothing of any matter except through Allah. But this authority reversed the matter and said to him: \"O Intellect, you shall not know Allah except through me.\"\n\nThe other Talisman is Imagination (الخيال). Allah gave it authority over meanings, clothing them in substances (مواد) in which it manifests them, so that no meaning can withhold itself from it.\n\nThe third Talisman is the Talisman of Habits (العادات). Allah gave it authority over the rational souls (النفوس الناطقة). Whenever they lose something of these habits, they rush to seek it due to the authority and power of influence it holds over them.\n\nMen are distinguished only by the removal of these three Talismans.\n\n### As for the First Talisman\n\nI saw a group of the People of Allah (أهل الله) whose authority [of Thought] had become so entrenched that they do not find pleasure in any of the Divine Sciences (العلوم الإلهية) as much as they find pleasure in a knowledge that contains the scent of thought. Thus, they derive greater pleasure from it than from the knowledge granted to them by pure Faith (الايمان المحض) through its light, which is the most revealing and clearest of lights in its exposition.\n\nThe reason for this is what we shall mention: the light of Faith is a Divine gift (وهب إلهي) in which there is no acquisition (كسب) whatsoever, nor any trace of proofs (الأدلة). For we have seen those who attained knowledge through proofs and what they indicated, to the point of certainty, yet there is no trace of Faith in them whatsoever. Since it is outside the acquisition of the servant, it is as if, when he rejoices in the knowledge granted by the light of Faith, he rejoices in something that is not his. But when he employs Thought (الفكر) to acquire knowledge of a certain matter, and attains it through his thought, contemplation, and exertion, it becomes an act of effort and acquisition for him. Thus, his pleasure in what he has acquired is greater than in what he has no acquisition in, because in what he acquired, he has a share.\n\nThis only occurs among these people due to their ignorance of their origins and their souls. For if they knew that they only emerged from non-existence (العدم) into Existence (الوجود) through grace and gift—Allah's gift to them, bringing them into existence, without any effort on their part—and yet they experience the utmost pleasure in their existence, then, based on what this principle dictates, they would be happier with the sciences of the Gift (الوهب) granted by the light of Faith than with what Thought grants them through contemplation.\n\nThe other veil (الحجاب) lies in their ignorance of their souls and what is within them: that the Intellect (العقل) and Thought were not attained from The Real (الحق) through effort or acquisition, but through a Divine gift, and they rejoice in it. Why, then, is their joy in the knowledge gifted to them by The Real through the light of Faith not greater than their joy in what they attained through Thought?\n\nFurthermore, due to their ignorance and veiling, they sometimes witness ambiguities (شبها) entering the knowledge they acquired through Thought, which either removes it from their grasp or confuses them about it, causing them intense distress. They then employ their thought in some kind of indication, either to remove those ambiguities so they know they are mere ambiguities, returning to their previous state without increase—and they lose the Divine increase (المزيد الإلهي) granted in every breath—or, Thought grants them that the ambiguity is not an ambiguity, but rather a proof that gives them knowledge contrary to what they previously held, and where the matter they were upon stood. They rejoice in this and say: \"It is knowledge; it was not like that, but was an ambiguity.\" If Allah had granted them Unveiling (فتح), they would realize that this new position they returned to is also subject to possibility (إمكان), just as the ruling of the first position they abandoned appeared to them. If the person of Thought had no other distraction diverting him from Divine Knowledge (العلم الإلهي) than this, it would be sufficient.\n\nOur discussion here concerns only the believers among the People of Allah. As for those who believe they only receive from the celestial spirits (الأرواح العلوية), that these spirits sustain them, and that they summon them to benefit them, and that everything they possess comes from these spirits—just as they believe that whatever veils them from such things is their focus on their desires and preoccupation with natural matters like eating, drinking, marriage, and similar things—we have no discussion with them, for they are servants of the cosmos (عبيد أكوان), not servants of Allah. They have no scent of Allah except through one knowledge: that He is the Origin (الأصل), without detail, extension, accompaniment, or manifestation in every single part of the Upper World (العالم الأعلى) in dimension and meaning, or the Lower World (العالم الأسفل) in dimension and meaning. They are veiled from all of this and do not affirm it.\n\nSince the Talisman (طلسم), in its original setting, is only placed by its setter to conceal what can be witnessed and attained, a stratagem is employed to lift the ruling of that Talisman so that what it concealed, which is beneficial, may become apparent. Man, by virtue of the self-subsistence (قيوميته) he believes he possesses, is a Talisman upon himself. And by that self-subsistence, he employs his thought and all his faculties, because he believes he is a lord in his essence and a master in his dominion. Then he saw that The Real had charged him and employed him, so he increased his conviction in his self-subsistence. He argues that if he did not have the capacity to carry out what The Real charged him with, He would not have charged him. So he says: \"By my use of these faculties, I have proof that I have affirmed my Lord, and He is truthful in what He charged me with concerning their use.\" This poor soul has not realized the places where he should use them.\n\nThen they saw that the noblest thing they could acquire through them is the Knowledge of the Essence (الذات) of Allah and what is proper for it. So they abandoned the use of their faculties in what they could reach, and used them in what is impossible to reach, despite The Real clarifying this for them in the Law, through the saying of Allah: <<وَيُحَذِّرُكُمُ اللهُ نَفْسَهُ>> (And Allah warns you of Himself)—meaning, do not employ Thought concerning it. And the Messenger of Allah, peace and blessings be upon him, said: \"Do not reflect upon the Essence of Allah.\" Thus, they disobeyed Allah and His Messenger, even though they are among the People of Allah, through the disobedience decreed upon them, the ruling of which must be executed upon them. May Allah make us among those whom He protects from using their faculties in what they have no authority over. Indeed, He is a Noble Protector, a Benefactor, a Doer of Good.\n\nIf Allah wills to grant you success in lifting the ruling of this Talisman so that you may witness what it veiled from you, He will grant you success in removing your self-subsistence by His Self-Subsistence (قيوميته), and employ you in your poverty and that, and in witnessing your origin. He will employ your thought in realizing that you are a gift, and that you originate from the very source of His grace (منته) upon you—in your existence, in your transformation through the stages of your sensible and spiritual development, and in your submission (Islam) and faith (Iman), until He made you among His people and chose you for Himself. He veiled others who are like you, not because of any effort on your part, but due to prior providence and the grace of selection (منة اختصاص).\n\nIf He grants you success in such contemplation, He will also grant you success in contemplating your faculties and the uses He clarified for them. Thus, you will not exceed their Divine use, you will stop at His limits, and you will know your measure, thereby knowing His Measure. You will regard your entire affair, in which you act, as a Divine gift (وهبا إلهيا) from the very source of His grace, and you will look upon it with the light of Faith (نور الايمان) that He gifted you. Then He will make you witness things as they are in themselves, unveil The Real (الحق) for you and grant you its following, and unveil falsehood (الباطل) for you and grant you its avoidance.\n\nI saw a group, among the people of thought, intellect, and contemplation, who, in this Unveiling (الكشف), had been shown The Real as falsehood by their thought, so they affirmed it [as falsehood], avoided The Real, and followed falsehood, without having knowledge of this. Since avoiding falsehood is inherent in the nature of everyone, when you see them in that state, you pity them. Perhaps you call them to The Real, while they <<يَقْذِفُونَ بِالْغَيْبِ مِنْ مَكَانٍ بَعِيدٍ>> (cast forth conjecture from a distant place), and they treat you ignorantly regarding the truth you call them to.\n\nJust as the Prophet, peace and blessings be upon him, used to call the people of polytheism (الشرك) to Unity (التوحيد), and when he called them to that and they called him to what they were upon, he said: <<مَا لِي أَدْعُوكُمْ إِلَى النَّجَاةِ وَتَدْعُونَنِي إِلَى النَّارِ * تَدْعُونَنِي لِأَكْفُرَ بِاللَّهِ وَأُشْرِكَ بِهِ مَا لَيْسَ لِي بِهِ عِلْمٌ وَأَنَا أَدْعُوكُمْ إِلَى الْعَزِيزِ الْغَفَّارِ>> (What is wrong with me that I call you to salvation while you call me to the Fire? You call me to disbelieve in Allah and associate with Him that of which I have no knowledge, while I call you to the Exalted in Might, the Forgiving.)\n\nO friend (ولي), do not say in response to me that they also say to him the same thing he said to them. The matter is not so, for they are polytheists (مشركون). By being polytheists, they affirmed the very thing this Messenger called them to, which is the affirmation of the Partner. They said: <<إِنَّمَا نَدْعُوهُمْ لِيُقَرِّبُونَا إِلَى اللهِ زُلْفَى>> (We only worship them that they may bring us nearer to Allah in proximity). Thus, they affirmed for Him, exalted is He, the magnification and the supreme station (المنزلة العظمى) that their partners do not possess. Therefore, it was not possible for them to say in response the same thing he said to them, for he said to them: \"that of which I have no knowledge,\" while they were knowledgeable of what the Messenger called them to. When he called them, he called them according to their state and their tongue, in that they affirmed the very thing he called them to, but added the partner of which Muhammad, peace and blessings be upon him, had no knowledge.\n\nIf the person of Unveiling (صاحب الكشف) says something similar to the person of Thought (صاحب الفكر), the response of the person of Thought is more severe in distance from Allah than the polytheists with the Messenger of Allah, peace and blessings be upon him. The polytheists were in a happier state than the people of Thought, for they affirmed, in any case, the very thing he called them to: that He possesses the highest station. But these people [of Thought] said that Allah does not know what we are upon, claiming that He is too great to know particulars (الجزئيات). Rather, His Knowledge (علم) of things is universal knowledge: that He knows there is movement and rest in the world, not that He knows that Zayd ibn Amr is the one moving at the decline of the sun. This is what their thought granted them. From this, it is known that the polytheist is in a happier state than they are.\n\nTheir thought also granted them that these Divine laws (النواميس الإلهية) operating in the world are the sustenance provided by the celestial spirits (الأرواح العلوية) to the virtuous souls capable of managing the world's affairs in this life. These are spiritual ordinances (أوضاع روحانية) established according to the practice of a people who purified their souls from the bondage of desires and the captivity of nature, and polished the mirrors of their hearts. The celestial spirits turned toward them, and they sat with the Highest Assembly (الملأ الأعلى) through their thoughts. The spirits supplied them with what they established in the world as causes of good, so they were called prophets, sages, and messengers—and nothing more than this. They made what they established concerning the unseen promise and threat, called the Hereafter (الدار الآخرة), policies by which they govern the souls that stray from contemplating what is proper for them, for which they were created, and nothing else. We seek refuge in Allah from this saying and this knowledge. This is what Thought granted them when they used it outside its proper place and took it on a path not its own. <<وَاللهُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ>> (And Allah guides whom He wills to a straight path).\n\n### As for the Second Talisman, which is Imagination (الخيال)\n\nIt embodies meanings and introduces them into the mold of sensible forms. It is also a Talisman upon those with limited understanding who have no knowledge (علم) of meanings abstracted from substances (المواد), so they do not witness them. These people witness nothing but physical forms. Thus, whoever is ruled by the Talisman of Imagination is deprived of perceiving matters as they are in themselves, without imagining them. These people do not accept any meaning—even though they know it is not a physical form—unless they picture it in their Imagination as embodied, localized, and distinct forms. Thus, they combine two opposites. You know that they are not forms, yet you only accept them as forms.\n\nWhoever desires to lift the ruling of this Talisman should know that the Talisman never departs from this plane of existence (النشأة), for it is a Divine ordinance. Likewise, the immutable essences (أعيانها) of all Divine Talismans do not depart, nor are their rulings lifted in the place where The Real, exalted is He, established their ruling. However, some people deviate from their proper path, and it is the ruling resulting from that deviation that is lifted, nothing else. Know this.\n\nThe ruling of the owner of this Talisman is lifted when he perceives Thought (الفكر) entering the treasury of this Imagination, and then turning away from it, accompanying him to the Intellect (العقل) to witness meanings abstracted from forms, as they are in themselves. The first thing he witnesses of this is the reality of Thought (حقيقة الفكر) that accompanied him to the Intellect. He sees it abstracted from the substances that Imagination used to give it. He thanks Allah and says: \"This is how I knew it before I witnessed it.\" The purpose was only that the Witnessing (الشهود) should correspond to the Knowledge (العلم).\n\nWhen he ascends to the Intellect, he also witnesses it abstracted from substances in itself, and he gains intimacy with the world of meanings abstracted from substances. When he is verified by this witnessing, he moves on to witness The Real (الحق), which is the trace of abstraction from meanings. For even if the originated meanings (المعاني المحدثة) are abstracted, they are not abstracted from their origination and possibility (إمكانها). The possessor of this station (مقام) witnesses in them their original non-existence (عدمها الأصلي), their origination, and their possibility, all without a material form.\n\nWhen he ascends to The Real, the first thing he witnesses of Him is the very essence of his own possibility (عين إمكانه). At this point, he becomes bewildered, for he knew Him to be impossible (غير ممكن). The Real takes him by the hand in this, by informing him that what he witnessed of The Real initially is the very essence of possibility that reverts to the witnesser—the one who says concerning himself that it is possible for The Real to witness him, and possible for Him not to witness him. This possibility is what manifested to him from The Real in his first witnessing, for one of the two aspects of possibility has been confirmed for him through witnessing. He then finds peace, and the bewilderment leaves him.\n\nThen The Real discloses Himself (يتجلى) to him without substance, because he is not in the world of substances at that moment. He gains knowledge of Allah according to the measure of that Theophany (التجلي). No one can specify what manifested to him from The Real, except that it manifested without substance, nothing more. The reason for this is that Allah discloses Himself to every servant in the world in a reality that is neither the same as that by which He disclosed Himself to another servant, nor the same as that by which He discloses Himself to him in another manifestation (مجلى). Therefore, what He manifests in cannot be specified or described.\n\nWhen this servant returns from this station to his own world, the world of substances, the Theophany of The Real accompanies him. There is no Presence (حضرة) he enters that has a ruling, but he sees The Real transformed by the ruling of that Presence. Since the servant has already grasped what he grasped initially, he knows that He has transformed into another matter, and he never ignores Him after that, nor is he veiled from Him, for it is absolutely impossible.\n\nWhen the servant descends to the world of his Imagination (خيال), having known things through witnessing as they truly are—and having previously known them through knowledge and faith—he sees The Real in the Presence of Imagination (حضرة الخيال) as a physical form, and he does not deny it. But the passerby and the strangers deny it. Then he descends from the world of Imagination to the world of sense and the sensible, and The Real descends with him because He does not separate from him. He witnesses Him as the form of everything he sees in the world, not singling out one form over another, whether bodies or accidents. He sees Him as the very essence of himself, yet knows that He is neither the essence of himself nor the essence of the world, and he is not bewildered by this, due to the verification he attained by accompanying The Real in His descent with him from the station that is His due. There is no world beyond Him that transforms in every Presence according to its ruling.\n\nThis is a precious witnessing (مشهد عزيز). I have not seen anyone affirm it without witnessing, except in the world of bodies and physical forms. The reason for this is the lack of companionship with The Real when He descended from the station that is His due. Thus, those who affirm it in the world of bodies and physical forms are mere imitators (مقلدين). This is known because that state does not accompany them, and heedlessness (الغفلات) follows upon them. Only when they are present with their souls do they affirm this. But the person of direct experience (صاحب الذوق) has no heedlessness concerning this whatsoever, for it is known to him. Heedlessness only occurs concerning one thing rather than another; it is not comprehensive. Everything that remains unwitnessed by the person of heedlessness, the person of direct experience witnesses The Real in it. Nothing remains unwitnessed for him during his state of heedlessness. Whoever does not possess this station through direct experience (ذوقا) is heedless of The Real through things until he recalls Him at certain times. This is the difference between the people of direct experience and others, so do not deceive yourself.\n\nI have not seen anyone among the people of this station through direct experience, except that my wife, Maryam bint Muhammad ibn Abdun, informed me that she saw one and described his state to me, and I knew he was among the people of this Witnessing (الشهود). However, she mentioned conditions about him that indicated his lack of strength and weakness in it, despite his verification in this state. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).\n\n### As for the Third Talisman, which is the Talisman of Habits (العادات)\n\nThe Talisman of Habits, ruling over the rational souls due to the familiarity they have acquired with them and the constant dependence of benefits and interests upon them—it is not lifted. If someone desires to rise above the ruling of this Talisman—since he knows that it is not lifted, for familiar causes (الأسباب المألوفة) are Divine ordinances that cannot be removed or repelled—this person returns to contemplating his own specific aspect (وجهه الخاص به) in which the cause has no effect, and which is extremely subtle.\n\nHe proceeds to its door, opens it, and frequently devotes himself to it. He feels the causes pulling him away from it to take from them the trusts they hold for him, but he does not do so, nor does he accept what they bring him. If a thought comes to him that this is bad manners toward Allah—\"Take what He has given you and <<كُنْ مِنَ الشَّاكِرِينَ>> (be among the thankful),\" and \"These causes cannot be removed, so do not invalidate Allah's wisdom concerning you, lest you be among the ignorant\"—he should not listen to this reproach or this teacher, for it is a psychic thought (خاطر نفسي), not a Divine thought. He should remain firm in his devotion at the specific door and say to that teacher: \"Allah has forbidden that houses be approached from their backs. If you were from Allah, you would approach houses from their doors, and I am a house that will not accept more than this.\"\n\nIf The Real desires him for that station, He will introduce that cause to him, with the trust it holds for him, at the door of that specific aspect which this servant has faced and devoted himself to—and that is the door of his house. When that cause gives him what it gives, he accepts it from it, because it only came to him through the door of the aspect from which he seeks the matter, and this cause has approached the house from its door.\n\nThis is what is called the breaking of habits (خرق العوائد) within habits (العوائد). The common people only witness the possessor of this station taking from causes, so they do not distinguish between him and themselves. He alone knows how he took. This station belongs only to the Malamiyya (the Blameworthy Ones), and they are the highest of the groups, for they are in the breaking of habit within the very habit. The difference between them and the veiled person (المحجوب) in station is vast, yet they are unaware.\n\nAs for the people of manifest breaking of habits (خرق العوائد الظاهرة), they do not possess this station, nor have they smelled its scent at all. They are the ones who take from causes, for the causes have not departed from them, nor will they depart, but they have become hidden. For the person of manifest breaking of habit must perform a sensible movement, which is the cause of the existence of the very thing sought. He scoops or clenches his hand in the air and opens it to find something grasped—gold or otherwise. This only occurred due to a movement of his hand and a clench. Thus, he did not depart from a cause, but it is generally unaccustomed. However, clenching is accustomed, and the movement of the hand is accustomed. Attaining what he attained through a different means is accustomed, but attaining it through this means is unaccustomed. Thus, it is said to be a breaking of habit. Know this.\n\nWhoever desires to lift the ruling of the Talisman of Habits should train himself in what we have mentioned. Then, habits will not rule him, even though he is within habits, unknown to the common people and the elite.\n\nAmong the sciences of this station (منزل) is the science of allusions (الإشارات) and address (الخطاب). In it is the science of introducing ambiguities (الشبه) to the people of proofs (أصحاب الأدلة). In it is the science of the Name (الاسم) that directed itself upon Creation (الخلق) through bringing into existence (الإيجاد) and determination (التقدير), and the science of the duration between bringing into existence and determination. In it is the science of the ordering of existents in their coming into existence through the passage of time, and upon whom this passage occurred—upon the Originator or upon the existents—so that it is known who was bound by it, and whether that binding was by choice or something inevitable. In it is the science of whether, when The Real directs Himself toward bringing something into existence, this involves turning away from another matter or not. In it is the science of why Thought (الفكر) relies on its judgment, and whether it has a Divine authority supporting it, such that the people of thought cling to it—even if they are unaware of it, or might reject it if it were clarified to them—while it is correct in reality. In it is the science of the descent of the Divine Command (الأمر الإلهي) and its return to that from which it descended, and the duration of that time. In it is the science of the connection of the cause (السبب) to the caused (المُسَبِّب), and whether it is valid for Allah to perform that act without this specific cause, or without any cause at all. In it is the science of the connection of Knowledge (العلم), Mercy (الرحمة), and Might (العزة), despite the inherent conflict between Mercy and Might. In it is the science of the higher (الأعلى) in the lower (الأنزل), and that there is no science of the lower in the higher. In it is the science of the most beautiful (الأحسن) in the world of Command and Creation, and by what it is most beautiful, and that there is no ugliness, nor any preference in beauty. In it is the science of the station of this human plane of existence (النشأة الإنسانية) over other planes, and the providence shown to it, despite its creation for both misery and happiness, even though the matter would seem to necessitate no misery, given the providence manifested toward it. In it is the science of the matters that are generated from this human in the world. In it is the science of dwellings (المساكن): what is advanced and what is delayed among them, what changes and what does not change, and what is subject to alteration and what is not subject to alteration. In it is the science of what differs in the human plane of existence in the two abodes (الدارين) regarding his apparent form, and what does not differ regarding his plane of existence in the form of his spirit, or whether that other plane of existence has another spirit that Allah creates for it according to its preparedness, and what the matter is in itself, since the return (الإعادة) has been mentioned—what is its reality and in what does it occur? This is a strange science. In it is the science that the servant only meets The Real (الحق) through death, and whether this is a specific meeting or if there is no meeting except through death. In it is the science of death, and in whose hand it is. In it is the science of the world's variation, to what it reverts in its forms and its imagination. In it is the science of the Divine limitation (التحديد الإلهي) in the Hereafter, despite its being the abode of the Unveiling (كشف) of Realities (الحقائق) for people, or whether its ruling is like the ruling of the world in some matters. In it is the science of what restores you to the witnessing of your reality, and that your happiness lies therein. In it is the science of man's natural love for being self-subsistent (قيوما), despite his humiliation and destitution, and what calls him to that. Then, their variation in self-subsistence: some subsist as a servant, and some subsist as a master. Among those who subsist as a master, some subsist as a master through veiling, and some subsist as a master through sound Unveiling (كشف صحيح). In it is the science of what is known only there. In it is the science of the lowest of the low and the lowest of proximity, and what the reality of this is. In it is the science of the variation in the Names (أسماء) of the people of deservingness, despite the existence of deservingness. In it is the science of priority (الأولوية). In it is the science of the Divine Judgment (الحكم الإلهي) on the Day of Resurrection: by what He judges and decides. In it is the science of insight (الإستبصار), the science of beneficial address, and the science of Divine Unveiling (الفتح الإلهي). <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).\n\nThe twenty-third volume is concluded.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر تین سو باون: حضرت محمدیہ (الحضرة المحمدية) سے مصور اور مدبر کیے گئے تین طلسمی (الطلسم) اسرار کے مقام کی معرفت میں۔\n\n> يَا قُرَّةَ الْعَيْنِ إِنَّ الْقَلْبَ يَهْوَاك *** لَوْلَاكَ مَا كُنْتُ فِي قَتْلَاكَ لَوْلَاك‏\n> مَا لِي سِوَى عَيْنِ مَالِي قَدْ عَلِمْتُ بِهِ *** فَإِنْ رَضِيتَ بِذَاكَ الْقَدْرِ أَغْنَاك‏\n> إِنَّ الْوُجُودَ لَهُ فَقْرٌ وَمَسْكَنَةٌ *** إِلَى الْكَمَالِ فَبَيْتُ الْفَقْرِ مَأْوَاك‏\n> لَا تَعْجَزَنَّ لِإِدْرَاكِ الْكَمَالِ فَمَا *** فِي الْكَوْنِ مَنْ يَعْرِفُ الْمَطْلُوبَ إِلَّاكَ‏\n\nاے میری آنکھوں کی ٹھنڈک، دل تجھے چاہتا ہے،\nاگر تو نہ ہوتا تو میں تیرے مقتولوں میں نہ ہوتا، اگر تو نہ ہوتا۔\nمیرے پاس میرے مال کی آنکھ کے سوا کچھ نہیں، جسے میں نے جان لیا ہے،\nپس اگر تو اس تقدیر پر راضی ہو جائے تو وہ تجھے غنی کر دے گی۔\nبے شک ہستی (الوجود) کمال کی طرف فقر اور مسکنت رکھتی ہے،\nپس فقر کا گھر ہی تیری پناہ گاہ ہے۔\nکمال کے ادراک سے عاجز نہ ہو، کیونکہ\nکائنات میں تیرے سوا کوئی نہیں جو مطلوب کو جانتا ہو۔\n\n[طلسم (الطلسم) کو یہ نام اس کے الٹ ہونے کی وجہ سے دیا گیا ہے، یعنی یہ ہر اس شخص پر مسلط ہے جس پر اسے مقرر کیا گیا ہے۔]\n\nاللہ آپ کی تائید کرے، جان لیجیے کہ طلسم (الطلسم) کو یہ نام اس کے الٹ ہونے کی وجہ سے دیا گیا ہے، یعنی یہ ہر اس شخص پر مسلط ہے جس پر اسے مقرر کیا گیا ہے۔ پس ہر مسلط چیز جب تک مسلط رہتی ہے، طلسم (الطلسم) ہے۔ ان میں سے ایک وہ ہے جو عقلوں (العقول) پر تسلط رکھتا ہے، اور یہ سب سے شدید ہے، کیونکہ یہ عقلوں کو الٰہی خبروں اور نبوی کشفی (الکشف) علوم میں سے صرف وہی قبول کرنے دیتا ہے جو ان کی تاویل اور میزان کے تحت آئے۔ اگر کوئی چیز اس معیار پر نہ ہو تو وہ اسے قبول نہیں کرتیں۔ یہ دنیا میں سب سے مشکل تسلط ہے، کیونکہ اس کا مالک، جو اس کے زیرِ اثر ہے، اللہ کے بارے میں بہت سے علم سے محروم رہ جاتا ہے۔ اس کا طلسم (الطلسم) فکر (الفكر) ہے، اور اللہ نے اسے اس پر مسلط کیا تاکہ وہ اس کے ذریعے سوچے اور جان لے کہ وہ کوئی بھی معاملہ اللہ کے بغیر نہیں جانتا۔ لیکن اس مسلط نے معاملہ الٹ دیا اور عقل سے کہا: اے عقل! تو مجھے (فکر) کے بغیر اللہ کو نہیں جان سکتی۔ دوسرا طلسم (الطلسم) خیال (الخيال) ہے، جسے اللہ نے معانی پر مسلط کیا ہے کہ وہ انہیں مادی لباس پہنائے اور ان میں ظاہر کرے، اور کوئی معنی اس سے خود کو روک نہیں سکتا۔ تیسرا طلسم (الطلسم) عادات کا طلسم (الطلسم) ہے، جسے اللہ نے نفوس ناطقہ (النفوس الناطقة) پر مسلط کیا ہے۔ پس جب بھی وہ ان میں سے کوئی چیز کھو دیتی ہیں تو اس کی طرف دوڑتی ہیں اور اسے طلب کرتی ہیں، کیونکہ اس کا ان پر غلبہ اور اثر کی قوت ہے۔ اور مردانِ حق کا امتیاز ان تینوں طلسمات (الطلسمات) کو اٹھانے میں ہی ہے۔\n\nاور پہلا طلسم (الطلسم) یہ ہے:\n\nمیں نے اہل اللہ کی ایک جماعت کو دیکھا ہے جن پر اس (فکر) کا تسلط اس قدر مضبوط ہو چکا ہے کہ وہ الٰہی علوم میں سے کسی چیز سے اتنا لطف اندوز نہیں ہوتے جتنا اس علم سے ہوتے ہیں جس میں فکر (الفكر) کی بو شامل ہو۔ چنانچہ وہ اس علم سے زیادہ لذت پاتے ہیں بہ نسبت اس علم کے جو خالص ایمان اپنے نور کے ذریعے انہیں عطا کرتا ہے، جو تمام انوار میں سب سے زیادہ واضح اور روشن ہے۔ اس کی وجہ وہ ہے جو ہم بیان کریں گے: وہ یہ کہ نورِ ایمان ایک الٰہی وہب (الوهب) (عطیہ) ہے، جس میں کسب کا کوئی حصہ نہیں، اور نہ ہی اس میں دلائل کا کوئی اثر ہے۔ ہم نے ایسے لوگوں کو دیکھا ہے جنہوں نے دلائل اور ان کے مدلولات کے ذریعے علم حاصل کیا، یہاں تک کہ انہیں کوئی شک نہیں رہا، لیکن اس کے باوجود ان میں ایمان کا کوئی اثر کسی بھی پہلو سے موجود نہیں تھا۔ چونکہ یہ علم بندے کے کسب سے باہر ہے، تو گویا جب وہ اس علم پر خوش ہوتا ہے جو نورِ ایمان نے اسے دیا ہے، تو وہ اس چیز پر خوش ہوتا ہے جو اس کی نہیں ہے۔ اور جب وہ کسی معاملے کے علم کے حصول میں فکر (الفكر) کو استعمال کرتا ہے اور وہ علم اسے اس کی فکر، غور و خوض اور کوشش سے حاصل ہوتا ہے، تو یہ اس کا عمل اور کسب ہوتا ہے۔ لہٰذا، اس کی لذت اس چیز میں زیادہ ہوتی ہے جو اس کا کسب ہے بہ نسبت اس کے جس میں اس کا کوئی کسب نہیں، کیونکہ جو اس نے کمایا ہے اس میں وہ خالق ہے۔ ان لوگوں کا یہ رویہ صرف ان کی اپنی اصل اور ان کے نفوس سے ناواقفیت کی وجہ سے ہے، کیونکہ اگر وہ جانتے کہ وہ عدم سے ہستی (الوجود) میں صرف اللہ کے احسان اور وہب (الوهب) (عطیہ) سے آئے ہیں، اور اللہ نے انہیں وجود بخشا، اور اس میں ان کا کوئی عمل نہیں تھا، اور وہ اپنے وجود سے انتہائی لذت حاصل کرتے ہیں، تو اس اصل کے مطابق وہ اس وہب (الوهب) کے علوم پر زیادہ خوش ہوتے جو انہیں نورِ ایمان عطا کرتا ہے، بہ نسبت اس کے جو فکر (الفكر) انہیں اپنے غور و خوض سے عطا کرتی ہے۔\n\nپھر دوسرا حجاب ان کی اپنے نفوس اور ان میں موجود چیزوں سے ناواقفیت میں ہے کہ عقل (العقل) اور فکر (الفكر) انہیں ذات حق (الحق) کی طرف سے کسی عمل یا کسب سے نہیں، بلکہ ایک الٰہی وہب (الوهب) سے حاصل ہوئے ہیں، اور وہ اس پر خوش ہیں۔ تو پھر ان کی خوشی اس علم پر کیوں نہ زیادہ ہو جو ذات حق (الحق) نے انہیں نورِ ایمان کے ذریعے عطا کیا ہے، بہ نسبت اس خوشی کے جو انہیں فکر (الفكر) کی طرف سے حاصل ہوئی؟ پھر ان کی جہالت اور حجاب کی وجہ سے یہ ہے کہ وہ بعض اوقات اس علم میں شبہات کا مشاہدہ کرتے ہیں جو انہوں نے فکر (الفكر) سے حاصل کیا تھا، اور وہ شبہات ان پر وارد ہوتے ہیں اور اس علم کو ان کے ہاتھوں سے چھین لیتے ہیں یا انہیں اس میں حیران کر دیتے ہیں۔ اس پر وہ شدید غمگین ہوتے ہیں اور دلائل کی مختلف اقسام میں اپنی فکر (الفكر) کو استعمال کرتے ہیں، یا تو وہ ان شبہات کو دور کر دیتے ہیں تاکہ وہ جان لیں کہ وہ صرف شبہات تھے، اور وہ بغیر کسی اضافے کے اپنی پہلی حالت پر لوٹ آتے ہیں، اور ہر سانس میں ملنے والے الٰہی اضافے کو کھو دیتے ہیں۔ یا پھر فکر (الفكر) انہیں یہ بتاتی ہے کہ وہ شبہہ نہیں بلکہ ایک دلیل ہے جس نے انہیں اس کے برعکس علم دیا جس پر وہ پہلے تھے، اور ان کا پہلا معاملہ کہاں گیا؟ تو وہ اس پر خوش ہوتے ہیں اور کہتے ہیں کہ یہ علم ہے، وہ شبہہ نہیں تھا۔ اگر اللہ ان پر کشف (الکشف) کا دروازہ کھول دیتا تو وہ اس نئی حالت میں بھی امکان (الإمكان) کے تحت ہوتے، جیسا کہ انہیں پہلی حالت کے حکم میں ظاہر ہوا جس سے وہ پلٹ گئے تھے۔ اگر صاحبِ فکر (الفكر) کے لیے الٰہی علم سے منہ موڑنے کا صرف یہی ایک سبب ہوتا تو کافی تھا۔\n\nہماری یہ گفتگو صرف اہل اللہ میں سے مومنین کے حق میں ہے۔ لیکن جو یہ سمجھتے ہیں کہ وہ صرف علوی ارواح سے لیتے ہیں، اور وہی ان کی مددگار ہیں، اور وہ انہیں نازل کرتے ہیں تاکہ وہ انہیں فائدہ پہنچائیں، اور جو کچھ ان کے پاس ہے وہ سب انہی کی طرف سے ہے، جیسا کہ وہ یہ سمجھتے ہیں کہ جو چیز انہیں اس طرح کے علم سے روکتی ہے وہ صرف ان کی اپنی شہوات کی طرف نظر اور طبعی امور جیسے کھانا، پینا، نکاح وغیرہ میں مشغولیت ہے۔ تو ہمارا ان سے کوئی کلام نہیں، کیونکہ وہ اکوان (کائنات) کے بندے ہیں، اللہ کے بندے نہیں۔ انہیں اللہ کی کوئی بو نہیں آتی، سوائے ایک علم کے کہ وہ اصل ہے، بغیر کسی تفصیل، تسلسل، ہمراہی اور عالمِ بالا کے ہر ہر جزو میں مساحت اور معنی کے ساتھ اور عالمِ اسفل میں مساحت اور معنی کے ساتھ ظہور کے۔ پس وہ ان سب سے محجوب ہیں اور اس کے قائل نہیں۔\n\nچونکہ طلسم (الطلسم) کو اس کے اصل وضع میں اس کا واضع صرف اس چیز کو چھپانے کے لیے رکھتا ہے جس کا مشاہدہ اور حصول ممکن ہو، اس لیے اس طلسم (الطلسم) کے حکم کو اٹھانے کی تدبیر کی گئی تاکہ وہ چیز ظاہر ہو جائے جسے وہ چھپا رہا تھا اور جس سے فائدہ اٹھایا جا سکتا ہے۔ انسان اپنی اس قیومیت (القيومية) کے لحاظ سے جو وہ اپنے اندر مانتا ہے، خود پر ایک طلسم (الطلسم) ہے۔ اور اسی قیومیت (القيومية) کے ذریعے وہ اپنی فکر (الفكر) اور اپنی تمام قوتوں کو استعمال کرتا ہے، کیونکہ وہ سمجھتا ہے کہ وہ اپنی ذات میں اور اپنی ملکیت میں رب اور مالک ہے۔ پھر اس نے دیکھا کہ ذات حق (الحق) نے اسے مکلف کیا اور اسے استعمال کیا، تو اس نے اپنی قیومیت (القيومية) میں مزید پختگی حاصل کی۔ اگر اس میں وہ قیام نہ ہوتا جس کا ذات حق (الحق) نے اسے مکلف کیا، تو وہ اسے مکلف نہ کرتا۔ چنانچہ وہ کہتا ہے کہ ان قوتوں کے استعمال سے میرے پاس یہ دلیل ہے کہ میں نے اپنے رب کی تصدیق کی، اور وہ سچا ہے اس میں جس کا اس نے مجھے استعمال کرنے کا مکلف کیا۔ لیکن یہ مسکین ان مقامات کو نہیں جانتا جہاں وہ انہیں استعمال کرتا ہے۔ پھر انہوں نے دیکھا کہ ان قوتوں کے ذریعے جو سب سے اشرف چیز وہ حاصل کر سکتے ہیں وہ ذاتِ حق (الحق) کا علم ہے اور یہ کہ اسے کیسا ہونا چاہیے۔ چنانچہ انہوں نے اپنی قوتوں کا استعمال ان چیزوں میں چھوڑ دیا جہاں وہ پہنچ سکتے تھے، اور انہیں ان چیزوں میں استعمال کیا جہاں پہنچنا ممکن نہیں، حالانکہ ذات حق (الحق) نے انہیں شریعت میں واضح کر دیا تھا، جیسا کہ اللہ کا قول ہے:\n\n**قرآنی آیت:** وَيُحَذِّرُكُمُ الله نَفْسَهُ\n**ترجمہ:** اور اللہ تمہیں اپنی ذات سے ڈراتا ہے۔\n\nیعنی: اس میں فکر (الفكر) کو استعمال نہ کرو۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n\n**حدیث:** لَا تَتَفَكَّرُوا فِي ذَاتِ اللَّهِ\n**ترجمہ:** اللہ کی ذات میں غور و فکر نہ کرو۔\n\nچنانچہ انہوں نے اللہ اور اس کے رسول کی نافرمانی کی، حالانکہ وہ اہل اللہ میں سے ہیں، لیکن یہ نافرمانی ان پر مقدر تھی، لہٰذا اس کے حکم کا ان پر نافذ ہونا ضروری تھا۔ اللہ ہمیں ان لوگوں میں شامل کرے جنہیں اللہ نے اپنی قوتوں کو ان چیزوں میں استعمال کرنے سے بچایا جن میں انہیں تصرف کا حق نہیں ہے۔ بے شک وہ ولی، کریم، انعام کرنے والا اور احسان کرنے والا ہے۔\n\nپس جب اللہ آپ کو اس طلسم (الطلسم) کے حکم کو اٹھانے کی توفیق دینا چاہے تاکہ آپ اس چیز کا مشاہدہ کریں جس نے آپ کو حجاب میں رکھا ہے، تو وہ آپ کو آپ کی قیومیت (القيومية) کو اس کی قیومیت (القيومية) سے زائل کرنے کی توفیق دے گا، اور آپ کو آپ کے فقر میں استعمال کرے گا، اور یہ آپ کی اصل کا شہود (الشہود) ہے۔ اور وہ آپ کی فکر (الفكر) کو اس بات میں استعمال کرے گا کہ آپ اس کے لیے موہوب ہیں، اور آپ اپنے وجود میں، اور اپنی محسوس اور معنوی نشوونما کے ادوار میں، اور اپنے اسلام اور ایمان میں، یہاں تک کہ اس نے آپ کو اپنے اہل میں شامل کر لیا اور اپنے لیے چن لیا، اس کے احسان کے سرچشمے سے صادر ہوئے ہیں۔ اور اس نے آپ جیسے دوسروں کو حجاب میں رکھا، اس میں آپ کا کوئی ہاتھ نہیں، بلکہ یہ آپ پر سابقہ عنایت اور اختصاص کا احسان ہے۔\n\nپس جب وہ آپ کو اس طرح کے غور و فکر کی توفیق دے گا، تو وہ آپ کو آپ کی قوتوں اور ان کے مصارف میں بھی غور کرنے کی توفیق دے گا جو اس نے آپ کے لیے واضح کیے ہیں۔ چنانچہ آپ ان کے ذریعے ان کے الٰہی مصرف سے تجاوز نہیں کریں گے اور اس کی حدود پر ٹھہر جائیں گے، اور آپ اپنی قدر پہچانیں گے تو اس کی قدر پہچانیں گے۔ اور آپ اپنے تمام معاملات کو جن میں آپ تصرف کرتے ہیں، اس کے احسان کے سرچشمے سے ایک الٰہی وہب (الوهب) (عطیہ) قرار دیں گے، اور آپ اس کی طرف اس نورِ ایمان سے دیکھیں گے جو اس نے آپ کو عطا کیا ہے۔ پس وہ آپ کو چیزوں کا مشاہدہ کرائے گا جیسا کہ وہ اپنی ذات میں ہیں، اور آپ کے لیے ذات حق (الحق) کا کشف (الکشف) کرے گا اور آپ کو اس کی پیروی کی توفیق دے گا، اور آپ کے لیے باطل کا کشف (الکشف) کرے گا اور آپ کو اس سے بچنے کی توفیق دے گا۔\n\nاور میں نے اس کشف (الکشف) میں اہل فکر (الفكر)، عقلمندوں اور غور و خوض کرنے والوں کی ایک جماعت کو دیکھا ہے کہ فکر (الفكر) نے انہیں حق کو باطل دکھایا، تو انہوں نے اسے پختہ سمجھا، اور حق سے اجتناب کیا اور باطل کی پیروی کی، حالانکہ انہیں اس کا علم نہیں تھا، کیونکہ باطل سے اجتناب ہر ایک کی فطرت میں ہے۔ جب آپ انہیں اس حال پر دیکھیں گے تو ان پر رحم کریں گے، اور شاید آپ انہیں حق کی طرف بلائیں، لیکن وہ دُور کی جگہ سے غیب پر تیر چلاتے ہیں (يَقْذِفُونَ بِالْغَيْبِ مِنْ مَكَانٍ بَعِيدٍ)، اور جس حق کی طرف آپ انہیں بلاتے ہیں اس میں وہ آپ سے ناواقف رہتے ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم اہل شرک کو توحید کی طرف بلاتے تھے، تو جب آپ انہیں بلاتے اور وہ آپ کو اپنے مذہب کی طرف بلاتے تو آپ فرماتے:\n\n**قرآنی آیت:** مَا لِي أَدْعُوكُمْ إِلَى النَّجاةِ وتَدْعُونَنِي إِلَى النَّارِ تَدْعُونَنِي لِأَكْفُرَ بِاللَّهِ وأُشْرِكَ به ما لَيْسَ لِي به عِلْمٌ وأَنَا أَدْعُوكُمْ إِلَى الْعَزِيزِ الْغَفَّارِ\n**ترجمہ:** مجھے کیا ہوا ہے کہ میں تمہیں نجات کی طرف بلاتا ہوں اور تم مجھے آگ کی طرف بلاتے ہو؟ تم مجھے بلاتے ہو کہ میں اللہ کا انکار کروں اور اس کے ساتھ شریک ٹھہراؤں جس کا مجھے کوئی علم نہیں، اور میں تمہیں غالب، بخشنے والے کی طرف بلاتا ہوں۔\n\nپس اے ولی! میرے جواب میں یہ نہ کہنا کہ وہ بھی آپ سے وہی کہتے ہیں جو آپ نے ان سے کہا۔ معاملہ ایسا نہیں ہے، کیونکہ وہ مشرک ہیں، اور مشرک ہونے کی وجہ سے انہوں نے اس چیز کو ثابت کیا جس کی طرف اس رسول نے انہیں بلایا تھا، اور وہ یہ ہے کہ انہوں نے شریک کو ثابت کیا۔ اور انہوں نے کہا: ہم تو انہیں صرف اس لیے بلاتے ہیں تاکہ وہ ہمیں اللہ کے قریب کر دیں (لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ)۔ پس انہوں نے اللہ سبحانہ و تعالیٰ کے لیے تعظیم اور عظمت والا مقام ثابت کیا جو ان کے شریکوں کے لیے نہیں ہے۔ اسی وجہ سے وہ جواب میں وہ بات نہیں کہہ سکتے جو آپ نے ان سے کہی، کیونکہ آپ نے ان سے کہا: \"جس کا مجھے کوئی علم نہیں\"، اور وہ اس چیز کے عالم ہیں جس کی طرف رسول نے انہیں بلایا تھا۔ پس جب آپ نے انہیں بلایا تو آپ نے انہیں ان کے حال اور ان کی زبان کے مطابق بلایا، اس لحاظ سے کہ انہوں نے اس چیز کو ثابت کیا جس کی طرف آپ نے انہیں بلایا تھا، اور انہوں نے اس شریک کا اضافہ کیا جس کا محمد صلی اللہ علیہ وسلم کو کوئی علم نہیں تھا۔\n\nپس جب صاحبِ کشف (الکشف) صاحبِ فکر (الفكر) سے ایسی بات کہے گا، تو صاحبِ فکر (الفكر) کا جواب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مشرکین کے جواب سے بھی زیادہ اللہ سے دوری کا باعث ہو گا۔ اور مشرکین صاحبِ فکر (الفكر) سے زیادہ خوش حال تھے، کیونکہ انہوں نے بہرحال اس چیز کو ثابت کیا جس کی طرف آپ نے انہیں بلایا تھا کہ اس کے لیے اعلیٰ مقام ہے۔ اور ان (صاحبانِ فکر) نے کہا کہ اللہ اس چیز کو نہیں جانتا جس پر ہم ہیں، جب انہوں نے کہا کہ وہ اس سے عظیم ہے کہ جزئیات کو جانے، بلکہ اس کا علم چیزوں میں کلی علم ہے، اور وہ یہ ہے کہ وہ جانتا ہے کہ دنیا میں کوئی حرکت کرتا ہے اور کوئی ساکن ہوتا ہے، نہ کہ وہ یہ جانتا ہے کہ زید بن عمرو سورج کے زوال کے وقت حرکت کرنے والا ہے۔ یہ ان کی فکر (الفكر) نے انہیں دیا ہے۔ اس سے معلوم ہوتا ہے کہ مشرک ان سے زیادہ خوش حال ہے۔\n\nاور ان کی فکر (الفكر) نے انہیں یہ بھی دیا کہ یہ الٰہی نوامیس جو دنیا میں جاری ہیں، یہ علوی ارواح کی طرف سے فاضل نفوس کو مدد ہے جو دنیا میں عالم کی مصلحتوں کو قبول کرنے والے ہیں۔ یہ روحانی اوضاع ہیں جو ایسی قوم کی سنت پر ہیں جنہوں نے اپنے نفوس کو شہوات کی غلامی اور طبیعت کی قید سے آزاد کیا اور اپنے دلوں کے آئینوں کو صاف کیا، تو علوی ارواح ان کی طرف متوجہ ہوئیں اور انہوں نے اپنی فکروں کے ذریعے ملأ اعلیٰ کی مجلس میں شرکت کی، تو انہوں نے انہیں ان چیزوں سے مدد دی جو انہوں نے دنیا میں خیر کے اسباب کے طور پر وضع کیں۔ چنانچہ انہیں انبیاء، حکماء اور رسول کہا گیا، اور بس یہی ہے۔ اور انہوں نے وعدہ اور وعیدِ غیب کو، جسے دارِ آخرت کہا جاتا ہے، ایسی سیاستیں قرار دیا جن کے ذریعے وہ ان بھٹکنے والے نفوس کی سیاست کرتے ہیں جو ان چیزوں پر غور کرنے سے غافل ہیں جن کے لیے وہ پائے گئے تھے، اور کچھ نہیں۔ اور ہم اس قول اور اس علم سے اللہ کی پناہ مانگتے ہیں۔ یہ وہ ہے جو فکر (الفكر) نے انہیں دیا جب انہوں نے اسے اس کے غیر محل میں استعمال کیا اور اسے اس کے غیر راستے پر لے گئے۔\n\n**قرآنی آیت:** وَاللَّهُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ\n**ترجمہ:** اور اللہ جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے۔\n\nاور دوسرا طلسم (الطلسم) جو کہ خیال (الخيال) ہے:\n\nیہ معانی کو مجسم کرتا ہے اور انہیں حسی صورتوں کے قالب میں داخل کرتا ہے۔ پس یہ بھی ان قاصر فہم رکھنے والوں پر ایک طلسم (الطلسم) ہے جنہیں مواد سے مجرد معانی کا علم نہیں، چنانچہ وہ ان کا مشاہدہ نہیں کر سکتے، اور یہ لوگ صرف جسمانی صورتوں کا ہی مشاہدہ کرتے ہیں۔ پس جس پر خیال (الخيال) کا طلسم (الطلسم) حکم کرتا ہے، وہ امور کو ان کی اپنی ذات میں بغیر تخیل کے ادراک کرنے سے محروم رہتا ہے۔ یہ لوگ معانی میں سے کسی چیز کو قبول نہیں کرتے، حالانکہ وہ جانتے ہیں کہ وہ جسمانی صورتیں نہیں ہیں، مگر یہ کہ وہ انہیں اپنے خیال (الخيال) میں مجسم، محدود اور ممتاز صورتوں میں ڈھال لیں۔ اس طرح وہ دو متضاد چیزوں کو جمع کرتے ہیں: آپ جانتے ہیں کہ وہ صورتیں نہیں ہیں، لیکن آپ انہیں صورتوں کے بغیر قبول نہیں کرتے۔\n\nپس جو شخص اس طلسم (الطلسم) کے حکم کو اٹھانا چاہے، تو یہ طلسم (الطلسم) اس نشأة (وجود) سے کبھی نہیں اٹھتا، کیونکہ یہ ایک الٰہی وضع ہے۔ اسی طرح تمام الٰہی طلسمات (الطلسمات) کی حقیقتیں ختم نہیں ہوتیں اور نہ ہی ان کے احکام اس مقام پر اٹھائے جاتے ہیں جہاں ذات حق (الحق) نے ان کا حکم رکھا ہے۔ لیکن بعض لوگ ان کو ان کے راستے سے ہٹا دیتے ہیں، تو وہ حکم جو اس انحراف نے دیا ہے، صرف وہی اٹھتا ہے، کوئی اور نہیں۔ پس یہ جان لو۔\n\nاس طلسم (الطلسم) کے مالک کا حکم اس وقت اٹھتا ہے جب وہ دیکھے کہ فکر (الفكر) اس خیال (الخيال) کے خزانے میں داخل ہوئی، پھر وہاں سے باہر نکل کر عقل (العقل) کی طرف گئی تاکہ معانی کا مشاہدہ کرے، جو صورتوں سے مجرد ہیں، جیسا کہ وہ اپنی ذات میں ہیں۔ پس سب سے پہلے وہ اس فکر (الفكر) کی حقیقت کا مشاہدہ کرتا ہے جو اس کے ساتھ عقل (العقل) کی طرف گئی تھی، تو وہ اسے ان مواد سے مجرد دیکھتا ہے جو خیال (الخيال) اسے دے رہا تھا۔ پس وہ اللہ کا شکر ادا کرتا ہے اور کہتا ہے: میں اسے مشاہدہ کرنے سے پہلے بھی اسی طرح جانتا تھا۔ اور مقصد صرف یہ تھا کہ شہود (الشہود) علم کے مطابق ہو جائے۔\n\nجب وہ عقل (العقل) کی طرف بلند ہوتا ہے، تو وہ اسے اپنی ذات میں بھی مواد سے مجرد دیکھتا ہے، تو اسے مواد سے مجرد معانی کے عالم سے انس حاصل ہوتا ہے۔ جب وہ اس مشاہدے سے متحقق ہو جاتا ہے، تو وہ ذات حق (الحق) کے مشاہدے کی طرف منتقل ہوتا ہے، جو معانی کے تجرد میں اس کا اثر ہے۔ کیونکہ اگرچہ محدث معانی مجرد ہو گئے ہیں، لیکن وہ اپنی حدوث اور امکان (الإمكان) سے مجرد نہیں ہوئے۔ پس اس مقام کا مالک ان میں ان کا اصلی عدم دیکھتا ہے جو ان کے لیے تھا، اور ان کا حدوث دیکھتا ہے، اور ان کا امکان (الإمكان) دیکھتا ہے، یہ سب کچھ غیر مادی صورت میں ہوتا ہے۔\n\nجب وہ ذات حق (الحق) کی طرف ترقی کرتا ہے، تو سب سے پہلے وہ اس میں عین امکان (الإمكان) کا مشاہدہ کرتا ہے، تو اس پر اس وقت حیرت طاری ہوتی ہے، کیونکہ اس کا علم غیر ممکن تھا۔ تو ذات حق (الحق) اس معاملے میں اس کا ہاتھ پکڑتا ہے، اس طرح کہ اسے یہ معرفت کراتا ہے کہ جو کچھ اس نے ذات حق (الحق) سے ابتداء میں مشاہدہ کیا ہے، وہ عین امکان (الإمكان) ہے جو مشاہد کی طرف لوٹتا ہے، اور وہ وہی ہے جس کے بارے میں وہ کہتا ہے کہ ممکن ہے کہ ذات حق (الحق) مجھے اپنی ذات کا مشاہدہ کرائے اور ممکن ہے کہ نہ کرائے۔ پس یہ امکان (الإمكان) ہی ہے جو اس کے پہلے شہود (الشہود) میں ذات حق (الحق) سے ظاہر ہوا۔ کیونکہ شہود (الشہود) کے ذریعے امکان (الإمكان) کے دو پہلوؤں میں سے ایک اس کے لیے راجح ہو گیا ہے۔ پس وہ اس وقت مطمئن ہو جاتا ہے اور اس کی حیرت دور ہو جاتی ہے۔\n\nپھر ذات حق (الحق) اس پر غیر مادی صورت میں ظہور الٰہی (التجلی) فرماتا ہے، کیونکہ وہ اس وقت مواد کے عالم میں نہیں ہوتا۔ پس وہ اللہ کے بارے میں اتنا جانتا ہے جتنا وہ ظہور الٰہی (التجلی) تھا۔ اور کوئی بھی اس چیز کا تعین نہیں کر سکتا جس میں ذات حق (الحق) نے اس پر ظہور الٰہی (التجلی) فرمایا، سوائے اس کے کہ اس نے غیر مادی صورت میں ظہور الٰہی (التجلی) فرمایا، بس۔ اور اس کی وجہ یہ ہے کہ اللہ عالم کے ہر بندے پر ایک ایسی حقیقت میں ظہور الٰہی (التجلی) فرماتا ہے جو نہ تو عین وہ ہے جس میں اس نے کسی دوسرے بندے پر ظہور الٰہی (التجلی) فرمایا، اور نہ ہی عین وہ ہے جس میں وہ اس پر کسی دوسرے مجلیٰ میں ظہور الٰہی (التجلی) فرمائے گا۔ اس لیے جس میں ظہور الٰہی (التجلی) ہوا، اس کا تعین نہیں کیا جا سکتا اور نہ ہی بیان کیا جا سکتا ہے۔\n\nجب یہ بندہ اس مقام سے اپنے عالمِ نفس، یعنی عالمِ مواد کی طرف لوٹتا ہے، تو ظہور الٰہی (التجلی) اس کے ساتھ ہوتا ہے۔ پس وہ جس بھی حضرہ میں داخل ہوتا ہے جس کا کوئی حکم ہے، وہ دیکھتا ہے کہ ذات حق (الحق) اس حضرہ کے حکم کے مطابق تبدیل ہو گیا ہے، اور بندے نے پہلے جو کچھ ضبط کیا تھا، وہ اب بھی ضبط کیے ہوئے ہے۔ پس وہ جانتا ہے کہ وہ ایک دوسرے معاملے میں تبدیل ہو گیا ہے، اور اس کے بعد وہ اسے کبھی نہیں بھولتا اور نہ ہی اس سے محجوب ہوتا ہے، کیونکہ اللہ نے جس پر ایک بار ظہور الٰہی (التجلی) فرمایا، وہ اس کے بعد اس سے محجوب نہیں ہوا، کیونکہ یہ بالکل ناممکن ہے۔\n\nجب بندہ اپنے خیال (الخيال) کے عالم میں اترتا ہے، اور وہ امور کو مشاہدے کے ذریعے جان چکا ہوتا ہے، حالانکہ اس سے پہلے وہ انہیں علم اور ایمان کے ذریعے جانتا تھا، تو وہ خیال (الخيال) کی حضرہ میں ذات حق (الحق) کو ایک جسمانی صورت میں دیکھتا ہے، اور وہ اس کا انکار نہیں کرتا، جبکہ عام لوگ اور اجنبی اس کا انکار کرتے ہیں۔ پھر وہ خیال (الخيال) کے عالم سے حس اور محسوسات کے عالم میں اترتا ہے، تو ذات حق (الحق) بھی اس کے ساتھ اترتا ہے، کیونکہ وہ اس سے جدا نہیں ہوتا۔ پس وہ اسے عالم کی ہر اس چیز کی صورت میں دیکھتا ہے جس کا اس نے مشاہدہ کیا ہے، وہ اجسام اور اعراض میں سے کسی ایک صورت کو دوسری صورت پر خاص نہیں کرتا، اور وہ اسے عین اپنی ذات دیکھتا ہے، اور جانتا ہے کہ وہ نہ تو عین اپنی ذات ہے اور نہ ہی عین عالم ہے۔ اور وہ اس میں حیران نہیں ہوتا، کیونکہ اسے ذات حق (الحق) کی ہمراہی میں اس مقام سے اترنے میں جو تحقیق حاصل ہوئی ہے جس کا وہ مستحق ہے، اور اس کے پیچھے کوئی عالم نہیں جو ہر حضرہ میں اس کے حکم کے مطابق تبدیل ہو جائے۔\n\nیہ ایک عزیز مشہد (الشہود) ہے، میں نے کسی کو نہیں دیکھا جو اسے بغیر شہود (الشہود) کے کہتا ہو، سوائے اجسام اور اجساد کے عالم میں۔ اور اس کی وجہ یہ ہے کہ جب وہ اس مقام سے اترے جس کا وہ مستحق تھا، تو ذات حق (الحق) کی ہمراہی نہیں رہی۔ چنانچہ اجسام اور اجساد کے عالم میں اس کے قائلین مقلد تھے، اور یہ اس بات سے معلوم ہوتا ہے کہ وہ ہمراہی ان کے ساتھ نہیں رہتی اور ان پر غفلتیں مسلسل آتی رہتی ہیں۔ جب وہ اپنے نفوس کے ساتھ حاضر ہوتے ہیں، تب وہ یہ بات کہتے ہیں۔ اور صاحبِ ذوق کے پاس اس سے متعلق بالکل بھی غفلت نہیں ہوتی، کیونکہ یہ اس کے نزدیک معلوم ہے۔ اور غفلت صرف کسی ایک چیز سے ہوتی ہے، سب پر محیط نہیں ہوتی۔ پس جو کچھ بھی غفلت والے کے لیے غیر مشہود رہتا ہے، صاحبِ ذوق اس میں ذات حق (الحق) کا مشاہدہ کرتا ہے، چنانچہ اس کی غفلت کی حالت میں اس کے لیے کوئی چیز غیر مشہود نہیں رہتی۔ اور جس کے پاس ذوق کے طور پر یہ مقام نہیں ہے، وہ چیزوں کے ذریعے ذات حق (الحق) سے غافل ہو جاتا ہے، یہاں تک کہ وہ اسے کسی وقت حاضر کرے۔ پس یہی اصحابِ ذوق اور دوسروں کے درمیان فرق ہے۔ لہٰذا اپنے آپ کو دھوکہ نہ دو۔\n\nمیں نے اس مقام کے اہل ذوق میں سے کسی ایک کو نہیں دیکھا، سوائے اس کے کہ میری اہلیہ مریم بنت محمد بن عبدون نے مجھے بتایا کہ اس نے ایک شخص کو دیکھا اور اس کی حالت بیان کی، تو میں نے جان لیا کہ وہ اس شہود (الشہود) کے اہل میں سے ہے، اگرچہ اس نے اس کے بارے میں ایسی حالتیں بیان کیں جو اس حال کے ساتھ اس کی کمزوری اور عدمِ قوت پر دلالت کرتی ہیں۔\n\n**قرآنی آیت:** وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\n**ترجمہ:** اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\n\nاور تیسرا طلسم (الطلسم) جو کہ عادات کا طلسم (الطلسم) ہے:\n\nیہ وہ طلسم (الطلسم) ہے جو نفوس ناطقہ (النفوس الناطقة) پر حاکم ہے، اس الفت کی وجہ سے جو انہیں اس سے حاصل ہو گئی ہے اور منافع و مصالح کا ہمیشہ اس پر موقوف رہنا، یہ کبھی نہیں اٹھتا۔\n\nپس اگر کوئی شخص اس طلسم (الطلسم) کے حکم سے بلند ہونا چاہے، حالانکہ وہ جانتا ہے کہ یہ اٹھتا نہیں، کیونکہ مانوس اسباب الٰہی اوضاع ہیں جنہیں نہ اٹھایا جا سکتا ہے اور نہ ہی دفع کیا جا سکتا ہے، تو یہ شخص اپنے اس خاص رُخ کی طرف غور کرنے کے لیے لوٹتا ہے جس میں سبب کا کوئی اثر نہیں، اور وہ بہت پوشیدہ ہے۔ پس وہ اس کے دروازے کا قصد کرتا ہے اور اسے کھولتا ہے اور اس پر اعتکاف زیادہ کرتا ہے۔ اور وہ محسوس کرتا ہے کہ اسباب اسے اپنی طرف کھینچ رہے ہیں تاکہ وہ ان سے وہ امانتیں لے لے جو ان کے پاس اس کے لیے ہیں، لیکن وہ ایسا نہیں کرتا اور نہ ہی وہ قبول کرتا ہے جو وہ اس کے پاس لاتے ہیں۔\n\nاگر اسے یہ خیال آئے کہ یہ اللہ کے ساتھ سوءِ ادب ہے، تو جو اس نے تجھے دیا ہے وہ لے لے اور شکر گزاروں میں سے ہو جا (وَكُنْ مِنَ الشَّاكِرِينَ)، اور یہ اسباب اٹھائے نہیں جا سکتے، لہٰذا اپنے حق میں اللہ کی حکمت کو باطل نہ کر، ورنہ تو جاہلوں میں سے ہو جائے گا۔ تو وہ اس ملامت اور اس معلم کی طرف کان نہیں دھرتا، کیونکہ یہ ایک نفسانی خیال ہے، الٰہی خیال نہیں۔ اور اسے چاہیے کہ وہ خاص دروازے پر اپنے اعتکاف پر ثابت قدم رہے اور اس معلم سے کہے کہ اللہ نے منع فرمایا ہے کہ گھروں میں ان کی پشت کی طرف سے آیا جائے، پس اگر تو اللہ کی طرف سے ہوتا تو گھروں میں ان کے دروازوں سے آتا، اور میں ایک گھر ہوں، وہ اس پر مزید کچھ نہیں کہتا۔\n\nپس جب ذات حق (الحق) اسے اس مقام کے لیے چاہے گا، تو وہ سبب اس کے پاس وہ امانت لے کر آئے گا جو اس کے لیے اس خاص رُخ کے دروازے پر ہے جس کا اس بندے نے سامنا کیا اور اس پر اعتکاف کیا، اور وہی اس کے گھر کا دروازہ ہے۔ پس جب وہ سبب اسے وہ چیز دے گا جو اس نے دی، تو وہ اسے قبول کر لے گا، کیونکہ وہ اس کے پاس اسی رُخ کے دروازے سے آیا ہے جس سے وہ معاملہ طلب کرتا ہے، اور اس سبب نے گھر میں اس کے دروازے سے داخلہ لیا ہے۔\n\nاور اسی کو عادات میں خرقِ عادات (عادت کو توڑنا) کہا جاتا ہے۔ کیونکہ عام لوگ اس مقام کے مالک کو اسباب سے لیتے ہوئے ہی دیکھتے ہیں، چنانچہ وہ ان کے اور اس کے درمیان فرق نہیں کر پاتے۔ پس صرف وہی جانتا ہے کہ اس نے کیسے لیا۔ اور یہ مقام صرف ملامتیہ کے لیے ہے، اور وہ اعلیٰ ترین گروہ ہیں، کیونکہ وہ عین عادت میں خرقِ عادت (عادت کو توڑنا) میں ہوتے ہیں، اور مقام میں ان کے اور محجوب و مشاہد کے درمیان اتنا ہی فرق ہوتا ہے، لیکن وہ شعور نہیں رکھتے۔\n\nاور ظاہری خرقِ عادات (عادت کو توڑنا) کے مالکوں کو یہ مقام حاصل نہیں اور نہ ہی انہوں نے اس کی بو سونگھی ہے، اور وہ بھی اسباب سے لینے والے ہیں۔ کیونکہ اسباب ان سے زائل نہیں ہوئے اور نہ ہی زائل ہوں گے، لیکن وہ پوشیدہ ہو گئے ہیں۔ کیونکہ ظاہری خرقِ عادت (عادت کو توڑنا) کے مالک کے لیے ایک حسی حرکت ضروری ہے جو عین مطلوب کے وجود کا سبب بنتی ہے۔ پس وہ ہوا میں ہاتھ ڈالتا ہے یا مٹھی بند کرتا ہے، پھر اسے کھولتا ہے تو اس میں سونا یا کوئی اور چیز ہوتی ہے۔ تو یہ صرف اس کے ہاتھ کی حرکت اور مٹھی بند کرنے کی وجہ سے ہوا، پس وہ سبب سے باہر نہیں نکلا، لیکن مجموعی طور پر یہ غیر معتاد ہے۔ لیکن مٹھی بند کرنا معتاد ہے، اور ہاتھ کی حرکت معتاد ہے، اور اس چیز کا اس طریقے کے علاوہ حاصل ہونا معتاد ہے، اور اس طریقے سے حاصل ہونا غیر معتاد ہے، اس لیے اسے خرقِ عادت (عادت کو توڑنا) کہا گیا۔ پس یہ جان لو۔\n\nپس جو شخص عادات کے طلسم (الطلسم) کے حکم کو اٹھانا چاہے، اسے چاہیے کہ وہ اپنے آپ کو اس میں مشغول کرے جو ہم نے ذکر کیا، تو عادات اس پر حکم نہیں کریں گی، حالانکہ وہ عادات میں ہی ہے، اور وہ عام و خاص میں معروف نہیں ہوتا۔\n\nاور اس منزل کے علوم میں اشارات اور خطاب کا علم ہے، اور اس میں دلائل کے حاملین پر شبہات کے ذریعے داخل ہونے کا علم ہے۔ اور اس میں اس اسم کا علم ہے جو ایجادی اور تقدیری طور پر مخلوق پر متوجہ ہوا، اور ایجادی اور تقدیری مدت کے درمیان کا علم ہے۔ اور اس میں زمانوں کے گزرنے کے ساتھ موجودات کی ایجادی ترتیب کا علم ہے، اور یہ کہ وہ کس پر گزرے، کیا موجد پر یا موجودات پر؟ تو یہ معلوم ہوتا ہے کہ کون ان سے مقید ہوا، اور کیا یہ تقیید اختیاری تھی یا ایک ناگزیر چیز؟\n\nاور اس میں یہ علم ہے کہ جب ذات حق (الحق) کسی چیز کے ایجاد پر متوجہ ہوتا ہے، تو کیا اس میں کسی دوسری چیز سے اعراض ہوتا ہے یا نہیں؟ اور اس میں یہ علم ہے کہ فکر (الفكر) اپنے حکم میں کس چیز پر انحصار کرتی ہے، اور کیا اسے کوئی الٰہی غلبہ حاصل ہے جو اس کی تائید کرتا ہے، تاکہ اہل فکر (الفكر) اس سے چمٹے رہیں یا نہیں؟ اگرچہ وہ اس کا شعور نہ رکھتے ہوں یا اگر انہیں بیان کیا جائے تو شاید وہ اسے محال قرار دیں، حالانکہ وہ فی نفسہ صحیح ہے۔\n\nاور اس میں الٰہی امر کے نزول اور اس کے واپس جانے کا علم ہے جہاں سے وہ نازل ہوا، اور اس کی مدت کتنی ہے؟ اور اس میں سبب کا مسبب (بکسر الباء) سے تعلق کا علم ہے، اور کیا اللہ کے لیے یہ فعل اس معین سبب کے بغیر یا بغیر کسی سبب کے کرنا صحیح ہے یا نہیں؟\n\nاور اس میں علم، رحمت اور عزت کے تعلق کا علم ہے، اس کے باوجود کہ رحمت اور عزت کے درمیان تنافر ہے۔ اور اس میں اعلیٰ کا انزل میں علم ہے، اور انزل کا اعلیٰ میں کوئی علم نہیں ہے۔ اور اس میں عالمِ امر اور خلق میں احسن کا علم ہے، اور وہ کس چیز سے احسن ہے، اور وہاں کوئی قبیح نہیں اور نہ ہی حسن میں کوئی فضیلت ہے۔\n\nاور اس میں اس انسانی نشأة کے دوسرے نشآت پر مقام اور اس کی عنایت کا علم ہے، حالانکہ اسے شقاوت اور سعادت کے لیے پیدا کیا گیا تھا، اور معاملہ یہ تقاضا کرتا تھا کہ جب اس پر عنایت ظاہر ہوئی تو کوئی شقاوت نہ ہو۔\n\nاور اس میں ان امور کا علم ہے جو اس انسان سے دنیا میں پیدا ہوتے ہیں۔ اور اس میں مساکن کا علم ہے، اور ان میں سے کیا مقدم ہوا اور کیا مؤخر، اور ان میں سے کیا تبدیل ہوتا ہے اور کیا تبدیل نہیں ہوتا، اور کس پر تغیر لاحق ہوتا ہے اور کس پر نہیں ہوتا۔\n\nاور اس میں اس چیز کا علم ہے جس میں انسان کی نشأة دونوں جہانوں میں اپنی ظاہری صورت کے لحاظ سے مختلف ہوتی ہے، اور کیا چیز اس کی روح کی صورت میں مختلف نہیں ہوتی، یا اس دوسری نشأة کے لیے کوئی اور روح ہے جسے اللہ اس کی استعداد کے مطابق پیدا کرتا ہے؟ اور معاملہ فی نفسہ کیسا ہے، کیونکہ اعادہ (دوبارہ پیدا کرنا) وارد ہوا ہے، تو اس کی حقیقت کیا ہے اور وہ کس چیز میں ہو گا؟ اور یہ ایک غریب علم ہے۔\n\nاور اس میں اس بات کا علم ہے کہ بندہ ذات حق (الحق) سے صرف موت کے ذریعے ہی ملاقات کرتا ہے، اور کیا یہ کوئی خاص ملاقات ہے یا موت کے بغیر کوئی ملاقات نہیں؟ اور اس میں موت کا علم ہے اور وہ کس کے ہاتھ میں ہے؟ اور اس میں عالم کے اختلاف کا علم ہے کہ وہ اپنی صورتوں اور تخیل میں کس چیز کی طرف لوٹتا ہے؟ اور اس میں آخرت میں الٰہی تحدید کا علم ہے، حالانکہ وہ لوگوں کے نزدیک حقائق کے کشف (الکشف) کا گھر ہے، یا اس کا حکم بعض امور میں دنیا کے حکم جیسا ہے؟\n\nاور اس میں اس چیز کا علم ہے جو آپ کو آپ کی حقیقت کے مشاہدے کی طرف لوٹاتی ہے، اور یہ کہ اس میں آپ کی سعادت ہے۔ اور اس میں انسان کی طبعی محبت کا علم ہے کہ وہ اپنی ذلت اور فقر کے باوجود قیوم (القَيُّوم) بنے، اور کون سی چیز اسے اس کی طرف بلاتی ہے؟ پھر قیام میں ان کا اختلاف، تو ان میں سے کوئی بندہ بن کر قیام کرتا ہے اور کوئی آقا بن کر۔ اور جو آقا بن کر قیام کرتا ہے، ان میں سے کوئی حجاب کے ساتھ آقا بن کر قیام کرتا ہے اور کوئی صحیح کشف (الکشف) کے ساتھ آقا بن کر قیام کرتا ہے۔\n\nاور اس میں اس علم کا علم ہے جو صرف وہیں معلوم ہوتا ہے۔ اور اس میں ادنیٰ دُنی (قرب) اور ادنیٰ دُنُو (قرب) کا علم ہے، اور اس کی حقیقت کیا ہے؟ اور اس میں استحقاق کے وجود کے ساتھ اہل استحقاق کے ناموں کے اختلاف کا علم ہے۔ اور اس میں اولویت کا علم ہے۔ اور اس میں قیامت کے دن الٰہی حکم کا علم ہے کہ وہ کس چیز سے حکم کرے گا اور فیصلہ کرے گا؟ اور اس میں استبصار (بصیرت) کا علم، اور خطاب میں نفع دینے والی چیز کا علم، اور الٰہی فتح کا علم ہے۔\n\n**قرآنی آیت:** وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\n**ترجمہ:** اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\n\nتئیسواں سفر مکمل ہوا۔\n\n( (شروع اللہ کے نام سے جو نہایت مہربان، رحم والا ہے))",
    "fa": "باب سیصد و پنجاه و دوم در شناخت منزل سه راز طلسمی صورت‌یافته و تدبیرشده از حضرت محمدیه (الحقیقة المحمدیة).\n\n> يا قرة العين إن القلب يهواك *** لولاك ما كنت في قتلاك لولاك‏\n> ای نور چشم، همانا قلب تو را می‌خواهد / اگر تو نبودی، من در میان کشتگان تو نبودم، اگر تو نبودی.\n\n> ما لي سوى عين مالي قد علمت به *** فإن رضيت بذاك القدر أغناك‏\n> مرا جز عین مال و دارایی‌ام نیست که به آن علم یافته‌ام / پس اگر به آن قَدَر راضی شوی، تو را بی‌نیاز می‌کند.\n\n> إن الوجود له فقر ومسكنة *** إلى الكمال فبيت الفقر مأواك‏\n> همانا هستی (الوجود) فقر و مسکنت دارد / به سوی کمال، پس خانه فقر پناهگاه توست.\n\n> لا تعجزن لإدراك الكمال فما *** في الكون من يعرف المطلوب إلاك‏\n> برای درک کمال ناتوان مشو / زیرا در هستی (الکون) کسی نیست که مطلوب را بشناسد جز تو.\n\nطلسم به این نام خوانده شد به دلیل وارونگی‌اش، یعنی مسلط است بر هر کس که به او واگذار شده است.\n\nبدان، خداوند تو را یاری کند، که طلسم به این نام خوانده شد به دلیل وارونگی‌اش، یعنی مسلط است بر هر کس که به او واگذار شده است. پس هر مسلطی تا زمانی که مسلط است، طلسم است. از جمله این‌ها، طلسمی است که بر عقول تسلط دارد و این سخت‌ترین آن‌هاست؛ زیرا عقول را رها نمی‌کند تا از اخبار الهی و علوم نبوی کشفی (الکشف) چیزی را بپذیرند مگر آنچه که تحت تأویل و میزان آن‌ها درآید، و اگر چنین نباشد، آن را نمی‌پذیرند. این سخت‌ترین تسلط در عالم است، زیرا صاحب محجور (ممنوع) از آن، علم بسیاری به حق (الحق) را از دست می‌دهد. پس طلسم او، فکر است و خداوند آن را بر او مسلط کرده تا با آن بیندیشد و بداند که هیچ امری را جز به واسطه خدا نمی‌داند. اما این مسلط، امر را وارونه کرد و به عقل گفت: ای عقل، خدا را جز به واسطه من نمی‌شناسی. طلسم دیگر، خیال است که خداوند آن را بر معانی مسلط کرده تا بر آن‌ها مواد بپوشاند و آن‌ها را در آن مواد آشکار سازد، به طوری که هیچ معنایی نتواند خود را از آن بازدارد. و طلسم سوم، طلسم عادات است که خداوند آن را بر نفوس ناطقه مسلط کرده است؛ این نفوس هرگاه چیزی از عادات را از دست بدهند، به سوی آن می‌شتابند و آن را می‌طلبند، به دلیل سلطه و قدرت تأثیری که بر آن‌ها دارد. و مردان (سالکان) متمایز نمی‌شوند مگر در رفع این سه طلسم.\n\nاما طلسم اول:\n\nگروهی از اهل حق (أهل الله) را دیدم که سلطه این طلسم بر آن‌ها محکم شده است، به طوری که از هیچ یک از علوم الهی به اندازه علمی که در آن بوی فکر باشد، لذت نمی‌برند. و لذت آن‌ها از این علم بیشتر از لذت آن‌ها از علمی است که ایمان محض با نور خود به آن‌ها می‌دهد، نوری که آشکارترین و واضح‌ترین انوار است. و سبب آن چیزی است که ذکر می‌کنیم: نور ایمان موهبتی الهی است که هیچ کسبی در آن نیست و هیچ اثری از ادله در آن وجود ندارد. ما کسانی را دیده‌ایم که علم را از طریق ادله و آنچه ادله بر آن دلالت دارند، به دست آورده‌اند به طوری که شکی ندارند، با این حال هیچ اثری از ایمان در آن‌ها نیست. چون علم ایمان خارج از کسب بنده است، گویی وقتی به علمی که نور ایمان به او داده شاد می‌شود، به چیزی شاد می‌شود که از آنِ او نیست. اما وقتی فکر را برای تحصیل علمی به کار می‌گیرد و آن علم از طریق فکر، نظر و کوشش او حاصل می‌شود، این برای او عمل و اکتساب است. پس لذت او از آنچه کسب کرده، بزرگ‌تر از چیزی است که در آن کسبی نداشته است، زیرا در آنچه کسب کرده، خالقیت (خلاق) دارد. این حالت در آن‌ها جز به دلیل جهلشان به اصول و نفوسشان نیست؛ زیرا اگر می‌دانستند که از عدم به هستی (الوجود) نیامده‌اند مگر به منت و موهبت الهی که خداوند به آن‌ها بخشیده و آن‌ها را ایجاد کرده است، و در این کار هیچ عملی از خود نداشته‌اند، در حالی که از وجود خود نهایت لذت را می‌برند، پس بر اساس این اصل، باید به علوم موهبتی که نور ایمان به آن‌ها می‌دهد، شادتر باشند تا به آنچه فکر با نظر خود به آن‌ها می‌دهد.\n\nسپس حجاب دیگر در جهل آن‌ها به نفوسشان و آنچه در آن‌هاست، این است که عقل و فکر از جانب حق (الحق) نه با عمل و نه با اکتساب به آن‌ها نرسیده، بلکه با موهبت الهی بوده و آن‌ها به آن شادمانند. پس چرا شادی آن‌ها به آنچه حق (الحق) از علم به نور ایمان به آن‌ها بخشیده، بزرگ‌تر از شادی آن‌ها به آنچه از طریق فکر به دست آورده‌اند، نیست؟ سپس از جهل و حجابشان این است که در اوقاتی در علمی که با فکر به دست آورده‌اند، شبهاتی را مشاهده می‌کنند که بر آن‌ها وارد می‌شود و آن علم را از دستشان می‌گیرد یا آن‌ها را در آن متحیر می‌سازد. پس به خاطر آن غم شدیدی می‌خورند و فکر خود را در نوعی از دلالات به کار می‌اندازند تا یا آن شبهات را از آن‌ها بزداید و بفهمند که شبهه بوده‌اند و بدون هیچ افزایشی به حالت قبلی خود بازگردند (و آنچه را که فزونی الهی در هر نفس می‌دهد، از دست می‌دهند)؛ یا اینکه فکر به آن‌ها بدهد که آن شبهه، شبهه نیست، بلکه دلیلی است که به آن‌ها علمی متضاد با آنچه قبلاً بر آن بودند، داده است. پس به آن شاد می‌شوند و می‌گویند: این علم است، نه آن حالت قبلی که شبهه بود. اگر خداوند بر آن‌ها گشایش می‌داد، در این حالت جدیدی که به آن بازگشته‌اند نیز تحت امکان (احتمال) بودند، همان‌طور که در حکم اولی که از آن برگشتند، برایشان آشکار شد. اگر برای صاحب فکر در علم الهی جز این عامل بازدارنده، عامل دیگری نبود، همین کافی بود. و سخن ما تنها در حق مؤمنان از اهل حق (أهل الله) است. اما کسانی که معتقدند جز از ارواح علوی چیزی نمی‌گیرند و آن‌ها هستند که به آن‌ها مدد می‌رسانند و آن‌ها را فرود می‌آورند تا به آن‌ها فایده برسانند، و تمام آنچه در آن هستند از جانب آن‌هاست، همان‌طور که معتقدند هر آنچه آن‌ها را از این امر محجوب می‌سازد، توجه به شهوات و مشغول شدن به امور طبیعی مانند خوردن و نوشیدن و نکاح و مانند این امور است، ما با آن‌ها سخنی نداریم. زیرا آن‌ها بندگان اکوان (مخلوقات) هستند نه بندگان خدا. آن‌ها از خدا بویی نبرده‌اند مگر به یک علم واحد که آن اصل است، بدون تفصیل و استرسال و همراهی و ظهور در هر جزء جزء از عالم بالا (مساحت و معنا) و عالم پایین (مساحت و معنا). پس آن‌ها از همه این‌ها محجوبند و به آن قائل نیستند. و چون طلسم در اصل وضع خود، واضع آن را جز برای پنهان کردن چیزی که ممکن است مشاهده و حاصل شود، قرار نمی‌دهد، من حیله‌ای به کار بستم تا حکم آن طلسم را بردارم تا آنچه را که پنهان می‌کرد و از آن نفع برده می‌شد، آشکار شود. انسان از حیث قیومیتی که در نفس خود معتقد است، طلسمی بر خود است. و با آن قیومیت، فکر و تمام قوای خود را به کار می‌گیرد، زیرا معتقد است که در ذات خود و در مُلک خود، رب و مالک است. سپس حق (الحق) را دید که او را مکلف کرده و به کار گرفته است، پس در قیومیت خود بیشتر تحقیق کرد. اگر او قیام به آنچه حق (الحق) او را مکلف کرده نداشت، حق او را مکلف نمی‌کرد. پس می‌گوید: با به کارگیری این قوا، دلیلی برایم حاصل می‌شود که پروردگارم را تصدیق کرده‌ام، و او در آنچه مرا به استفاده از آن‌ها مکلف کرده، صادق است. و این بیچاره، مواضعی را که باید در آن‌ها از این قوا استفاده کند، درک نکرده است. سپس آن‌ها دیدند که شریف‌ترین چیزی که با این قوا کسب می‌کنند، علم به ذات خدا و آنچه شایسته آن است که ذات بر آن باشد، است. پس استفاده از قوای خود را در آنچه می‌توانستند به آن برسند، ترک کردند و آن‌ها را در آنچه رسیدن به آن ممکن نیست، به کار بردند، با وجود اینکه حق (الحق) در آنچه تشریع کرده، برای آن‌ها روشن ساخته است، از جمله قول خداوند: **«وَيُحَذِّرُكُمُ الله نَفْسَهُ»** (و خداوند شما را از [نافرمانی] خود برحذر می‌دارد)؛ یعنی در آن فکر به کار نبرید.\n\nو رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «در ذات خدا تفکر نکنید.»\n\nپس آن‌ها خدا و رسولش را نافرمانی کردند، با اینکه از اهل حق (أهل الله) هستند، به واسطه معصیتی که بر آن‌ها مقدر شده است، و ناگزیر حکم آن در آن‌ها جاری می‌شود. پس خداوند ما را از کسانی قرار دهد که او را از به کارگیری قوای خود در آنچه حق تصرف در آن را ندارند، حفظ کرده است. همانا او ولی، کریم، نعمت‌بخش و نیکوکار است. پس اگر خداوند بخواهد تو را برای رفع حکم این طلسم موفق گرداند تا آنچه تو را از آن محجوب کرده، مشاهده کنی، تو را موفق می‌سازد تا قیومیت خود را با قیومیت او از بین ببری و تو را در فقر (فقر) و شهود اصلت به کار می‌گیرد. و فکر تو را به کار می‌اندازد تا بدانی که تو موهوب هستی و از سرچشمه منت او بر تو در هستی‌ات (الوجود)، و در دگرگونی‌ات در اطوار نشأت محسوس و معنوی‌ات، و در اسلام و ایمانت صادر شده‌ای، تا آنجا که تو را از اهل خود قرار داد و برای خود برگزید و غیر تو را که مانند تو بودند، محجوب ساخت، نه به دلیل عملی از جانب تو، بلکه به دلیل عنایت پیشین و منت اختصاص. پس اگر تو را به چنین نظری موفق ساخت، تو را به نظر در قوایت و مصارف آن‌ها که برایت بیان کرده نیز موفق می‌سازد. پس با آن‌ها از مصرف الهی‌شان تجاوز نمی‌کنی و نزد حدود او می‌ایستی و قدر خود را می‌شناسی، پس قدر او را می‌شناسی. و تمام امر خود را در آنچه تصرف کردی، موهبتی الهی از سرچشمه منت او قرار می‌دهی و با نور ایمانی که به تو بخشیده، به آن می‌نگری. پس امور را همان‌گونه که در نفس خود هستند، به تو می‌نمایاند و حق (الحق) را برایت کشف می‌کند و روزی‌ات می‌دهد که از آن پیروی کنی، و باطل را برایت کشف می‌کند و روزی‌ات می‌دهد که از آن دوری کنی. و گروهی از صاحبان افکار، عاقلان و اهل نظر را در این کشف (الکشف) دیدم که فکر، حق را به صورت باطل به آن‌ها نشان داده بود، پس آن را محقق دانستند و از حق دوری کردند و از باطل پیروی نمودند، در حالی که به این امر علم نداشتند، زیرا اجتناب از باطل در سرشت هر کسی است. پس وقتی آن‌ها را بر این حالت می‌بینی، به آن‌ها رحم می‌کنی. شاید آن‌ها را به حق دعوت کنی، در حالی که آن‌ها **«يَقْذِفُونَ بِالْغَيْبِ مِنْ مَكَانٍ بَعِيدٍ»** (از مکانی دور، به غیب تیر می‌اندازند)؛ پس در آنچه آن‌ها را به سوی حق دعوت می‌کنی، تو را جاهل می‌دانند، همان‌طور که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) اهل شرک را به توحید دعوت می‌کرد و وقتی آن‌ها را دعوت می‌کرد و آن‌ها او را به آنچه خود بر آن بودند دعوت می‌کردند، می‌فرمود: **«مَا لِي أَدْعُوكُمْ إِلَى النَّجَاةِ وَتَدْعُونَنِي إِلَى النَّارِ تَدْعُونَنِي لِأَكْفُرَ بِاللَّهِ وَأُشْرِكَ بِهِ مَا لَيْسَ لِي بِهِ عِلْمٌ وَأَنَا أَدْعُوكُمْ إِلَى الْعَزِيزِ الْغَفَّارِ»** (مرا چه شده که شما را به سوی نجات می‌خوانم و شما مرا به سوی آتش می‌خوانید؟ مرا می‌خوانید تا به خدا کفر ورزم و چیزی را که به آن علم ندارم، شریک او سازم، در حالی که من شما را به سوی [خدای] عزیز و غفار می‌خوانم). پس ای ولی، در پاسخ من مگو که آن‌ها نیز به او همانند آنچه او به آن‌ها گفت، می‌گویند. چنین نیست، زیرا آن‌ها مشرک هستند. آن‌ها با مشرک بودنشان، عین چیزی را که این رسول آن‌ها را به آن دعوت می‌کرد، اثبات کردند، و آن همان چیزی است که شریک را اثبات می‌کند. و آن‌ها گفتند: **«إِنَّمَا نَدْعُوهُمْ لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى»** (ما آن‌ها را نمی‌خوانیم مگر برای اینکه ما را به خدا نزدیک‌تر سازند). پس برای او سبحانه و تعالی تعظیم و منزلت عظیمی را اثبات کردند که برای شرکایشان نیست. از این رو، برای آن‌ها ممکن نبود که در پاسخ، همانند آنچه او به آن‌ها گفت، بگویند. زیرا او به آن‌ها گفت: «آنچه به آن علم ندارم»، در حالی که آن‌ها به آنچه رسول آن‌ها را به آن دعوت می‌کرد، عالم بودند. پس وقتی آن‌ها را دعوت کرد، با حال و زبان خودشان آن‌ها را دعوت کرد، از آن جهت که عین چیزی را که او آن‌ها را به آن دعوت می‌کرد، اثبات کرده بودند و شریکی را اضافه کرده بودند که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) به آن علم نداشت. پس اگر صاحب کشف (الکشف) به صاحب فکر چنین بگوید، پاسخ صاحب فکر برای او در دوری از خدا، شدیدتر از مشرکان با رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خواهد بود. و مشرکان از نظر حال، سعادتمندتر از اصحاب فکر بودند، زیرا آن‌ها در هر حال، عین چیزی را که او آن‌ها را به آن دعوت می‌کرد، اثبات کردند که منزلت والا از آن اوست. اما اینان گفتند که خدا به آنچه ما بر آن هستیم، علم ندارد، زیرا گفتند که او بزرگ‌تر از آن است که جزئیات را بداند، بلکه علم او به اشیاء، علمی کلی است؛ یعنی می‌داند که در عالم کسی هست که حرکت می‌کند و ساکن می‌شود، نه اینکه بداند زید بن عمرو همان کسی است که هنگام زوال خورشید متحرک است. این چیزی است که فکرشان به آن‌ها داده است. از اینجا دانسته می‌شود که مشرک از نظر حال، سعادتمندتر از آن‌هاست. و فکرشان به آن‌ها داده است که این نوامیس الهی که در عالم جاری است، مدد رسانی ارواح علوی به نفوس فاضله‌ای است که قابلیت مصالح عالم در دنیا را دارند. پس این‌ها اوضاع روحانی است بر سنت قومی که نفوس خود را از بردگی شهوات و اسارت طبیعت رها ساخته‌اند و آینه‌های قلب خود را صیقل داده‌اند، پس ارواح علوی به آن‌ها روی آورده‌اند و با افکار خود با ملأ اعلی همنشین شده‌اند، پس آن‌ها را به آنچه از اسباب خیر در عالم وضع کرده‌اند، مدد رسانده‌اند. پس آن‌ها را انبیا و حکما و رسولان نامیده‌اند و جز این نیست. و آنچه را از وعد و وعید غیبی که دار آخرت نامیده می‌شود، وضع کرده‌اند، سیاست‌هایی قرار داده‌اند که با آن‌ها نفوس سرکش را از نظر در آنچه شایسته آن‌هاست و برای آن خلق شده‌اند، باز می‌دارند و بس. و پناه می‌بریم به خدا از این قول و این علم. این چیزی است که فکر به آن‌ها داده است، آنجا که آن را در غیر موضع خود به کار بردند و آن را در غیر مذهب خود بردند. **«وَاللَّهُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ»** (و خداوند هر که را بخواهد به راه راست هدایت می‌کند).\n\nو اما طلسم دوم که خیال است:\n\nمعانی را جسمانی می‌کند و آن‌ها را در قالب صورت‌های حسی وارد می‌سازد. پس این نیز طلسمی است بر اهل فهم‌های قاصر که به معانی مجرد از مواد علم ندارند، پس آن‌ها را مشاهده نمی‌کنند. و اینان جز صورت‌های جسمانی را مشاهده نمی‌کنند. پس کسی که طلسم خیال بر او حکم رانده، از درک امور آن‌گونه که در نفس خود هستند، بدون تخیل، محروم می‌شود. اینان هیچ یک از معانی را نمی‌پذیرند، با وجود علمشان به اینکه آن‌ها صورت‌های جسمانی نیستند، مگر اینکه آن‌ها را در خیال خود به صورت‌های متجسد، دارای حیز و متمایز درآورند. پس بین دو نقیض جمع می‌کنند: شما می‌دانید که آن‌ها صورت نیستند، اما آن‌ها را جز به صورت نمی‌پذیرید. پس کسی که بخواهد حکم این طلسم را بردارد، باید بداند که خود طلسم هرگز از این نشأت (عالم) برداشته نمی‌شود، زیرا وضعی الهی است. و همچنین تمام طلسمات الهی، اعیانشان برداشته نمی‌شود و احکامشان در موضعی که حق تعالی حکم آن را در آن قرار داده، رفع نمی‌گردد. اما برخی از مردم با آن از مسیر خود خارج شده‌اند، پس آن حکمی که آن خروج به آن داده است، رفع می‌شود و نه چیز دیگر. این را بدان. حکم صاحب این طلسم زمانی رفع می‌شود که ببیند فکر وارد خزانه این خیال شده و سپس از آن خارج می‌شود و او را تا عقل همراهی می‌کند تا معانی را مجرد از صور، همان‌گونه که در نفس خود هستند، مشاهده کند. اولین چیزی که از آن مشاهده می‌کند، حقیقت فکری است که او را تا عقل همراهی کرده است. پس آن را مجرد از موادی می‌بیند که خیال به آن می‌داد. پس خدا را شکر می‌کند و می‌گوید: من قبل از مشاهده، آن را این‌گونه می‌دانستم، و هدف جز این نبود که شهود (الشهود) با علم موافق باشد. پس وقتی به عقل بالا رود، آن را نیز در نفس خود مجرد از مواد مشاهده می‌کند. پس با عالم معانی مجرد از مواد انس می‌گیرد. وقتی با این مشاهده متحقق شد، به مشاهده حق (الحق) منتقل می‌شود که اثر آن در تجرد از معانی است. زیرا معانی حادث، اگرچه مجرد شده‌اند، اما از حدوث و امکان خود مجرد نشده‌اند. پس صاحب این مقام، عدم اصلی آن‌ها را که داشتند، و حدوث و امکان آن‌ها را مشاهده می‌کند، همه این‌ها در غیر صورت مادی. وقتی به حق (الحق) ارتقا یابد، اولین چیزی که از او مشاهده می‌کند، عین امکان اوست. در این هنگام دچار حیرت می‌شود، زیرا او حق را غیرممکن (واجب الوجود) می‌دانست. پس حق در این امر دست او را می‌گیرد و به او می‌شناساند که آنچه از حق در ابتدا مشاهده کرده، عین امکانی است که به مشاهده‌کننده بازمی‌گردد، و این همان است که در مورد آن می‌گوید: ممکن است حق خود را به من بنمایاند و ممکن است ننمایاند. پس این امکان است که در اولین شهود (الشهود) از حق برای او ظاهر شده است، زیرا یکی از دو وجه امکان با شهود (الشهود) برای او ترجیح یافته است. پس در آن هنگام آرام می‌گیرد و حیرت از او زایل می‌شود. سپس حق (الحق) در غیر ماده بر او تجلی (التجلی) می‌کند، زیرا در آن هنگام در عالم مواد نیست. پس به اندازه آن تجلی (التجلی) از خدا علم می‌یابد. و هیچ کس نمی‌تواند آنچه را که از حق بر او تجلی کرده، تعیین کند، جز اینکه بگوید در غیر ماده تجلی کرده است و بس. و سبب آن این است که خداوند بر هر بنده‌ای از عالم، در حقیقتی تجلی می‌کند که عین آن چیزی نیست که بر بنده دیگری با آن تجلی کرده است، و عین آن چیزی نیست که در تجلی (التجلی) دیگری بر خود او تجلی می‌کند. به همین دلیل، آنچه در آن تجلی کرده، تعیین نمی‌شود و قابل بیان نیست. پس وقتی این بنده از این مقام به عالم نفس خود، یعنی عالم مواد، بازگردد، تجلی (التجلی) حق (الحق) او را همراهی می‌کند. پس هیچ حضرتی نیست که وارد آن شود و حکمی داشته باشد، مگر اینکه حق (الحق) را ببیند که به حکم آن حضرت متحول شده است، و بنده آنچه را که قبلاً ضبط کرده بود، ضبط می‌کند. پس می‌داند که حق در امر دیگری متحول شده است و پس از آن هرگز او را جاهل نمی‌شمارد و از او محجوب نمی‌شود، زیرا خداوند بر هیچ کس تجلی (التجلی) نکرده که پس از آن از او محجوب شود، زیرا این امر اصلاً ممکن نیست. پس وقتی بنده به عالم خیال خود فرود آید، در حالی که امور را مشاهده‌ای شناخته است و پیش از آن آن‌ها را با علم و ایمان شناخته بود، حق (الحق) را در حضرت خیال به صورت جسمانی می‌بیند، پس آن را انکار نمی‌کند، اما رهگذران و بیگانگان آن را انکار می‌کنند. سپس از عالم خیال به عالم حس و محسوس فرود می‌آید، و حق (الحق) به دلیل فرود آمدن او، با او فرود می‌آید، زیرا از او جدا نمی‌شود. پس او را به صورت هر آنچه از عالم مشاهده کرده، می‌بیند، و صورتی را بر صورت دیگر از اجسام و اعراض ترجیح نمی‌دهد. و او را عین نفس خود می‌بیند و می‌داند که او نه عین نفس اوست و نه عین عالم. و در این امر متحیر نمی‌شود، به دلیل تحققی که با همراهی حق (الحق) در فرود آمدن او از مقامی که شایسته آن است، برایش حاصل شده است. و هیچ عالمی ورای او نیست که در هر حضرت بر حسب حکم آن متحول شود. و این مشهدی عزیز است. من کسی را ندیدم که بدون شهود (الشهود) به آن قائل باشد، مگر در عالم اجسام و ابدان. و سبب آن، عدم همراهی با حق (الحق) هنگام فرود آمدن از مقامی است که شایسته آن است. پس قائلان به آن در عالم اجسام و ابدان، مقلد بودند. و این امر از آنجا دانسته می‌شود که این حالت آن‌ها را همراهی نمی‌کند و غفلت‌ها پی در پی بر آن‌ها وارد می‌شود. پس وقتی با نفوس خود حاضر می‌شوند، در آن هنگام به آن قائل می‌شوند. اما صاحب ذوق، هیچ غفلتی از این امر ندارد، زیرا این امر نزد او معلوم است. و غفلت تنها از چیزی دون چیزی دیگر است و فراگیر نیست. پس هر آنچه از امور برای صاحب غفلت غیر مشهود باقی می‌ماند، صاحب ذوق حق (الحق) را در آن مشاهده می‌کند. پس در حال غفلتش چیزی برای او غیر مشهود باقی نمی‌ماند. و کسی که این مقام را ذوقاً ندارد، از حق (الحق) به واسطه اشیاء غافل می‌شود تا اینکه او را در اوقاتی به یاد آورد. پس این همان تفاوت بین اصحاب ذوق و غیر آن‌هاست. پس خود را فریب مده. من هیچ یک از اهل این مقام را ذوقاً ندیدم، جز اینکه همسرم مریم دختر محمد بن عبدون به من خبر داد که یکی را دیده و حال او را برایم توصیف کرد، پس دانستم که او از اهل این شهود (الشهود) است، اما احوالی را از او ذکر کرد که دلالت بر عدم قوت و ضعف او در آن داشت، با وجود تحقق او به این حال. **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق را می‌گوید و او راه را می‌نمایاند).\n\nو اما طلسم سوم که طلسم عادات است:\n\nکه بر نفوس ناطقه حاکم است، به دلیل اُلفتی که با آن‌ها حاصل شده و توقف دائم منافع و مصالح بر آن‌ها، رفع نمی‌شود. پس اگر کسی بخواهد از حکم این طلسم برداشته شود، با علم به اینکه خود طلسم رفع نمی‌شود، زیرا اسباب مألوف، اوضاع الهی هستند که رفع و دفع آن‌ها ممکن نیست، این شخص به نظر در وجه خاص خود بازمی‌گردد که اثر سبب در آن نیست و بسیار پنهان است. پس قصد باب آن می‌کند و آن را می‌گشاید و بر آن اعتکاف می‌نماید. و احساس می‌کند که اسباب او را از آن می‌کشند تا آنچه از امانات او در دست دارند، بگیرد، اما او این کار را نمی‌کند و آنچه را که اسباب برایش می‌آورند، نمی‌پذیرد. اگر خاطری به او وارد شود که این سوء ادب با خداست، پس آنچه را به تو داده، بگیر و **«وَكُنْ مِنَ الشَّاكِرِينَ»** (و از شاکران باش)، و اینکه این اسباب را نمی‌توان رفع کرد، پس حکمت خدا را در حق خود باطل مکن که از جاهلان خواهی بود؛ او به این عتاب و به این معلم گوش نمی‌دهد، زیرا آن خاطر، خاطر نفسانی است و خاطر الهی نیست. و باید بر اعتکاف خود بر باب خاص ثابت بماند و به آن معلم بگوید: خداوند نهی کرده است که به خانه‌ها از پشت آن‌ها وارد شوند، پس اگر تو از جانب خدا بودی، از درهای خانه‌ها وارد می‌شدی، و من خانه‌ای هستم که بر این امر چیزی نمی‌افزایم. پس اگر حق (الحق) او را برای آن مقام بخواهد، آن سبب را با امانتی که برای او نزد خود دارد، بر باب آن وجه خاص که این بنده به آن روی آورده و بر آن اعتکاف کرده، وارد می‌کند، و آن همان درِ خانه اوست. پس وقتی آن سبب آنچه را که به او داده، به او بدهد، آن را از او می‌پذیرد، زیرا جز از باب وجهی که امر را از آن می‌طلبد، نیامده است. و این سبب از درِ خانه وارد شده است. و این همان چیزی است که «خرق عوائد در عین عوائد» نامیده می‌شود. زیرا مردم، صاحب این مقام را جز در حال گرفتن از اسباب مشاهده نمی‌کنند، پس بین او و خودشان تفاوتی نمی‌گذارند. و تنها او می‌داند که چگونه گرفته است. و این مقام جز برای ملامتیه نیست، و آن‌ها بالاترین طوایف هستند، زیرا آن‌ها در خرق عادت در عین عادت هستند، و بین آن‌ها در مقام، همان تفاوتی است که بین محجوب و مشاهد است، اما خودشان نمی‌دانند. و اصحاب خرق عوائد ظاهری، این مقام را ندارند و اصلاً بویی از آن نبرده‌اند. و آن‌ها کسانی هستند که از اسباب می‌گیرند، زیرا اسباب از آن‌ها زایل نشده و زایل نمی‌شود، بلکه پنهان شده است. زیرا صاحب خرق عادت ظاهری ناگزیر از یک حرکت حسی است که سبب وجود عین آن مطلوب است. پس با دست خود در هوا چنگ می‌زند یا قبضه می‌کند و آن را باز می‌کند و در آن چیزی قبض شده از طلا یا غیره می‌یابد. پس این امر جز به سبب حرکت دست و قبض او نبوده است. پس از سبب خارج نشده، اما در مجموع غیرمعتاد است. اما قبض معتاد است و حرکت دست معتاد است، و تحصیل آنچه برای او حاصل شده از غیر این وجه معتاد است، و تحصیل آن از این وجه غیرمعتاد است. پس گفته شده که این خرق عادت است. این را بدان. پس هر کس بخواهد حکم طلسم عادات را بردارد، باید نفس خود را در آنچه ذکر کردیم به کار گیرد، تا عادات بر او حکم نرانند، در حالی که او در عادات است و نزد عامه و خاصه ناشناخته است. و از علوم این منزل، علم اشارات و خطاب است. و در آن، علم وارد کردن شبهه بر اصحاب ادله است. و در آن، علم اسمی است که با ایجاد و تقدیر بر خلق توجه یافته است. و علم مدت زمان بین ایجاد و تقدیر. و در آن، علم ترتیب موجودات در ایجاد، با گذشت زمان‌ها، و اینکه این زمان‌ها بر چه کسی گذشته است، آیا بر مُوجِد (ایجادکننده) یا بر موجودات؟ پس دانسته می‌شود که چه کسی مقید به آن‌ها شده است و آیا آن تقیید به اختیار بوده یا امری ضروری. و در آن، علم این است که وقتی حق (الحق) به ایجاد امری توجه می‌کند، آیا در آن اعراض از امر دیگری هست یا خیر. و در آن، علم این است که فکر در حکم خود به چه چیزی استناد می‌کند و آیا سلطان الهی دارد که آن را تأیید کند تا اهل افکار به آن تمسک جویند یا خیر، حتی اگر خودشان به آن آگاه نباشند یا اگر برایشان بیان شود، شاید آن را محال بدانند، در حالی که در نفس امر صحیح است. و در آن، علم نزول امر الهی و بازگشت آن به جایی است که از آن نازل شده و مدت زمان آن چقدر است. و در آن، علم ارتباط سبب با مُسَبِّب (فاعل) است، و آیا انجام آن فعل از جانب خدا بدون این سبب معین یا بدون هیچ سببی صحیح است یا خیر. و در آن، علم ارتباط علم و رحمت و عزت است، با وجود تنافری که بین رحمت و عزت وجود دارد. و در آن، علم بالاتر در پایین‌ترین است، و علم پایین‌ترین در بالاتر نیست. و در آن، علم احسن (نیکوترین) در عالم امر و خلق است و اینکه به چه چیزی احسن است، و در آن قبیح (زشت) نیست و در حُسن، برتری‌جویی وجود ندارد. و در آن، علم منزلت این نشأت انسانی بر سایر نشآت و عنایت به آن است، با وجود اینکه برای شقاوت و سعادت خلق شده است، در حالی که امر مقتضی آن بود که شقاوتی نباشد، به دلیل عنایتی که به آن ظاهر شده است. و در آن، علم آنچه از این انسان در عالم متولد می‌شود، از امور است. و در آن، علم مساکن است و آنچه از آن‌ها مقدم شده و آنچه مؤخر شده، و آنچه تبدیل می‌شود و آنچه تبدیل نمی‌شود، و آنچه تغییر به آن می‌رسد و آنچه تغییر به آن نمی‌رسد. و در آن، علم آنچه نشأت انسان در دو سرا (دنیا و آخرت) از حیث صورت ظاهری‌اش در آن اختلاف می‌کند، و آنچه از نشأت او در صورت روحش اختلاف نمی‌کند، یا اینکه برای آن نشأت دیگر، روح دیگری است که خداوند آن را بر حسب استعدادش برای آن خلق می‌کند. و امر در نفس خود چگونه است، زیرا اعاده (بازگرداندن) وارد شده است، پس حقیقت آن چیست و در چه چیزی خواهد بود، و این علمی غریب است. و در آن، علم این است که بنده حق (الحق) را جز با مرگ ملاقات نمی‌کند، و آیا این ملاقاتی خاص است یا هیچ ملاقاتی جز با مرگ نیست. و در آن، علم مرگ و اینکه به دست کیست. و در آن، علم اختلاف عالم است که به چه چیزی در صور و تخیل خود بازمی‌گردد. و در آن، علم تحدید الهی در آخرت است، با وجود اینکه نزد مردم دار کشف (الکشف) حقایق است، یا حکم آن در برخی امور، حکم دنیاست. و در آن، علم آنچه تو را به مشاهده حقیقتت بازمی‌گرداند و اینکه سعادت تو در آن است. و در آن، علم حب انسان به طور طبیعی در قیوم بودن است، با وجود ذلت و فقرش، و چه چیزی او را به این امر فرامی‌خواند. سپس اختلاف آن‌ها در قیام: برخی از آن‌ها بنده قیام می‌کنند و برخی سید (آقا) قیام می‌کنند. و از کسانی که سید قیام می‌کنند، برخی با حجاب سید قیام می‌کنند و برخی با کشف (الکشف) صحیح سید قیام می‌کنند. و در آن، علم آنچه جز در آنجا دانسته نمی‌شود. و در آن، علم پایین‌ترینِ نزدیکی و پایین‌ترینِ فرود است، و حقیقت این چیست. و در آن، علم اختلاف نام‌های اهل استحقاق با وجود استحقاق. و در آن، علم اولویت. و در آن، علم حکم الهی در روز قیامت است که با چه چیزی حکم و فصل می‌کند. و در آن، علم استبصار (بصیرت‌جویی) و علم آنچه از خطاب سودمند است و علم فتح الهی. **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق را می‌گوید و او راه را می‌نمایاند). سفر بیست و سوم به پایان رسید.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 5
}