{
  "id": 74,
  "title": {
    "ar": "الباب الرابع والسبعون في التوبة",
    "en": "Chapter Seventy-Four: On Repentance",
    "ur": "چوہترواں باب توبہ کے بیان میں",
    "fa": "باب هفتاد و چهارم در توبه"
  },
  "content": {
    "ar": "## (الباب الرابع والسبعون في التوبة\n\n\n> الاعتراف متاب كل محقق *** وبه الإله الحق يشرح صدره‏\n\n\n> رضي الإله عن المخالف مثل ما *** رضي الإله عن الموافق أمره‏\n\n\n> ما ذا كثير أن ينال مناله *** لا سيما إن كنت تعرف سره‏\n\n\n> من عين منته ينال مخالف *** ما ناله إن كنت تجهل قدره‏\n\n\n### [تلقين الحجة عند مخالفة الأمر]\n\n\nاعلم أيدنا الله وإياك أن الله يقول وتُوبُوا إِلَى الله جَمِيعاً أَيُّهَا الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ فأمر بالتوبة عباده ثم لقنهم الحجة لو خالفوا أمره فقال تعالى ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا ليقولوا إذا سألوا ذلك أي لو تبت علينا لتبنا مثل قوله تعالى ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ ليقول كرمك فهذا من باب تعليم الخصم الحجة خصمه ليحاجه بذلك إذا كان محبوبا وجاء بلفظة الإنسان بالألف واللام والإغرار ليعم جميع الناس فهذا مما يدلك على إن إرادة الحق بهم السعادة في المال ولو نالهم ما نالهم مما يناقضها\n\n\n### [توبة الله مقرونة ب «على» وتوبة الخلق ب «إلى»]\n\n\nغير أن توبة الله مقرونة بعلي لأن من أسمائه الاسم العلي وتوبة الخلق مقرونة بإلى لأنه المطلوب بالتوبة فهو غايتها واجتمع الحق والخلق في من من التوبة فهم رجعوا إليه من أنفسهم والعارفون رجعوا إليه منه والعلماء بالله رجعوا إليه من رجوعهم إليه وأما العامة فإنها رجعت من المخالفات إلى الموافقة والحق عز وجل رجع إليهم من كناية إن يخذلكم ليرجعوا إليه بحسب ما تقتضيه مقاماتهم التي فصلناها آنفا فرجوع الحق عليهم ليرجعوا إليه مثل قوله يحبهم ويحبونه فرجوعه عليهم رجوع عناية محبة أزلية ليتوبوا فإذا تابوا أحبهم حب من رجع إليه فهو حب جزاء قال تعالى إِنَّ الله يُحِبُّ التَّوَّابِينَ فهذا الحب منه ما هو الأول وللعبد حب آخر زائد على قوله ويُحِبُّونَهُ وهو أنه‏\n\n\nقال صلى الله عليه وسلم أحبوا الله لما يغذوكم به من نعمه‏\n\n\nفهذا حب جزاء المنعم لما أنعم به عليهم فهذا الحب منهم في مقابلة إِنَّ الله يُحِبُّ التَّوَّابِينَ حب جزاء لحب جزاء والأول حب عناية منه ابتداء وحبهم إياه حب إيثار لجنابه لا حب آلاء ونعم فالتوبة منهم عن محبة منتجة لمحبة أخرى منه فهي بين محبتين متعلقتين بهم من الله كتوبته عليهم عن محبة منهم تنتج محبة أخرى منهم فتوبته عليهم بين محبتين أيضا وهذا من باب خلق الله آدم على صورته أي جميع ما تقبله الحضرة الإلهية من الصفات يقبلها الإنسان الصغير والكبير\n\n\n### [حد التوبة وبيان ركنها الأول‏]\n\n\nوحدها ترك الزلة في الحال والندم على ما فات والعزم على أنه لا يعود لما رجع عنه ويفعل الله بعد ذلك ما يريد فأما ترك الزلة في الحال فلا بد منه لأن سلطان وقته الحياء والحياء يحول بسلطانه بين من قام به وبين تعدى حدود الله ومن أسماء الله تعالى المذكور في السنة الحي وأن الله يستحيي يوم القيامة من ذي الشيبة فحياء الله من العبد إنه قد أعلمه أنه سبحانه لا يتوبون إليه حتى يتوب عليهم فإذا وقف المخذول الذي لم يتب الله عليه فلم يتب إليه وكان في حال وقوفه بين يديه يوم القيامة ذاكرا في نفسه هذه الآية ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا\nاستحيا الله منه أن يؤاخذه بذنب كما إن العبد يستحيي من الله في حال توبته إلى الله أن يقع منه زلة وهو في هذا الحال فإنه ليس بتائب في تلك الحال ونحن تكلمنا في التائب فالحياء له لازم والحياء يقتضي ترك الزلة في الحال ومن ترك الزلة في الحال للتائب إذا كان عارفا هو ترك نسبتها إلى ربه فينسبها إلى نفسه أدبا مع الله وفي نفس الأمر الفعل فعل الله والقدر من الله والحكم بكونها معصية وزلة حكم الله ومع هذا فالأدب يقول له انسبها إلى نفسك لما تعلق بها لسان الذم ولهذا قال في حد النفس كل خاطر مذموم والأصل فَأَلْهَمَها فُجُورَها وتَقْواها\n\n\n### [موقف بعض العلماء بالله من ترك الزلة في الحال‏]\n\n\nومن العلماء بالله من يكون ترك الزلة في الحال عندهم أن لا يشهدوا أنها زلة وهو عين قضاء الله فيها لأنه الذي حكم أنها زلة ومن حيث إنها فعل من أفعال الله فهي في غاية الحسن والجمال وإنما سميت زلة من زل إذا زلق أي زلت من نسبة كونها من أفعال الله إلى حكم الله فيها بالذم فحكم الله فيها بالزلل عن هذه المرتبة فاعلم ومن العلماء بالله من يكون ترك الزلة في حقه أن يشهد الزلة في ذلك الفعل من كونها زلة لا من كونها فعلا يتعلق به الذم أو الحمد فيشهد نسبتها للعبد التي بها سميت زلة ثم يتبعها الذم وإن كان كل فعل إلهي نسب إلى العبد من هذا الباب فجميع الأفعال الكونية كلها زلل محمودها ومذمومها\n\n\n### [موقف بعض الناس من ترك الزلة في الحال‏]\n\n\nومن الناس من يكون ترك الزلة في الحال في حقه شغله برجوعه إلى ربه والذلة رجوعه عن ربه فهو في النقيض ومن هو في النقيض بالحال لا يكون في نقيضه فبالضرورة لا يكون له في هذه الحال زلة ومن الناس من يكون ترك الزلة في الحال في حقه هو شغله بشهوده رجوع الحق عليه ليرجع إليه ليفرق ما بين رجوعه عليه ليرجع إليه وبين رجوع آخر لا ليرجع إليه ليميز بين الرجوعين ليقيم على نفسه ميزان ما يجب عليه في ذلك من الله من عمل من الأعمال من ذكر بلسان أو قلب أو عمل بجارحة أو المجموع أو بعض المجموع ومن كان بهذه المثابة من الشغل فلا تقوم به زلة في الحال ومن الناس من يكون ترك الزلة في الحال في حقه أن يشهد رجوع الحق إليه لا ليميز ولا ليرجع إليه بل ليعلم حقيقة معنى الرجوع الإلهي لما ذا ينسبه هل إلى الذات أو لاسم إلهي وما سبب ذلك الرجوع هل هو ذاتي أو غير ذاتي أو لا نسبة له إلى الذات فهذه الوجوه وأمثالها مما يطلبه ترك الزلة في الحال‏\n\n\n### [الركن الثاني للتوبة وموقف الصوفية منه‏]\n\n\nوأما الركن الثاني وهو الندم على ما فات وهو عند الفقهاء الركن الأعظم بمنزلة قوله الحج عرفة لأنه الركن الأعظم وهنا تتشعب أمور كثيرة في التائبين ميم الندم منقلبة عن باء مثل لازم ولازب وهو أثر حزنه على ما فاته يسمى ندما والندب الأثر فقلبت ميما وجعلت لأثر الحزن خاصة وأما تعلقه بالفوات فمن أصحابنا من رأى أنه تضييع للوقت فإنه ما فات لا يسترجع ومن أصحابنا من يرى أنه صاحب الوقت وأن فائدته أن يجبر له ما مضى ويحتج بقوله إِلَّا من تابَ وآمَنَ وعَمِلَ عَمَلًا صالِحاً فَأُوْلئِكَ يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ ومن أصحابنا من يرى أنه لا يندم إلا بإحضاره في نفسه ذنبه الحائل بينه وبين ما فاته من طاعة أمر ربه عز وجل وذكر الجفاء في حال الصفاء جفاء فينبغي له أن ينسى ذنبه وهو خلاف الأول فإنه قال التوبة أن لا تنسى ذنبك والكلام فيما فاته فمنهم من يندم على ما فاته من الاستغفار في عقب كل ذنب ومنهم من يرى الندم على ما فاته من الوقت ومن الناس من يرى الندم على ما فاته من الطاعة في وقت المخالفة ومن الناس من يرى الندم على ما فاته من فعل الكبائر في وقت المخالفة لأنه يشاهد التبديل كل سيئة بما يوازنها من الحسنات كقتل نفس بإحياء نفس وذم بمحمدة وصدقة بغصب أو سرقة أو خيانة ومن الناس من يرى الندم على ما فاته من الحضور مع الله في قضائه بالمعصية في حال المعصية ومن الناس من يرى الندم على ما فاته من إضافة ذلك الفعل إلى الفاعل في حال الفعل‏\n\n\n### [إضافة الفعل إلى الفاعل الحقيقي في حال الفعل‏]\n\n\nوهو نور عظيم شعشعاني حجابه أَ فَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَناً فقرن به السوء لما أضافه إليه فرآه حسنا ولا بد من حضرة وجودية هي التي أوجبت له الحسن الذي رآه محل الفعل إذ العدم لا يراه الممكن وما ثم حسن إلا كونه من أفعال الله وما أساءه إلا إضافته إلى العبد فإنه قال أَ فَمَنْ زُيِّنَ لَهُ بكونه لربه سُوءُ عَمَلِهِ من كونه عمله فكسبه السوء فَرَآهُ حَسَناً بالتزيين الإلهي وزينة الله غير محرمة فهو في نفس الأمر مزين بزينة الله وعند العبد بحسب ما يحضر فيه فإن حضره تزيين الشيطان فهو سوء على سوء وإن حضره تزيين الحياة الدنيا فهو غفلة في سوء وإن حضرة تزيين الله والإضافة إلى العبد فهو حسن في سوء فإن أخذ إضافة السوء إلى العمل أدبا إلهيا فهو حسن في حسن‏\n\n\n> كل شي‏ء أنت فيه حسن *** لا يبالي حسن ما لبسا\nثوب مخالفة أو موافقة فإنك إن لم توافق الأمر وافقت الإرادة ولو لا ما بين السيئ والحسن مناسبة تقتضي جمعهما في عين واحدة يكون بها حسنا سيا ما قبل التبديل في قوله يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ ولا كان يتصف سوء العمل بالحسن في رؤيته فما اتصف بالحسن عنده حتى قبل العمل صفة الحسن في وجه من الوجوه الوجودية فهو سوء بالخبر حسن بالرؤية فكان الرؤية لا تصدق الخبر وشاهد الرؤية أقطع‏\n\n\n> ولكن للعيان لطيف معنى *** لذا سأل المعاينة الكليم‏\n\n\n### [الناس يطلبون أن يصدق الخبر الخبر]\n\n\nوالناس يطلبون أن يصدق الخبر الخبر والخبر الرؤية ولم نر أحدا يطلب أن يصدق الخبر الرؤية كما يصدق الخبر الخبر ولهذا اختلف في شهادة الأعمى ولم يختلف في شهادة صاحب البصر ولهذا قال في الآية فَإِنَّ الله يُضِلُّ من يَشاءُ أي يحيره في مثل هذا حيث وصفه بالسيئ والحسن فلا يدري المكلف ما يغلب وبقوله زين بنية ما لم يسم فاعله فلا يدري من زينه هل تزيين الله أو تزيين الشيطان أو تزيين الحياة الدنيا ثم قال ويَهْدِي من يَشاءُ أي يوفق للاصابة في معنى السوء والحسن لهذا العمل ما معناه وكيف ينبغي أن يأخذه فَلا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَراتٍ أي فلا تكترث لهم حسرة عليهم فهي بشرى من الله بسعادة الجميع فإنه ما حيل بينه صلى الله عليه وسلم وبين إنسانيته فهو إنسان في كل حال ولا تزول الحسرات عنه وهو إنسان كامل إلا باطلاعه على سعادتهم في المال فلا يبالي من العوارض فإن السوء للعمل عارض بلا شك والحسن له ذاتي وكل عارض زائل وكل ذاتي باق لا يبرح فَإِنَّ الله خبير أي عَلِيمٌ عن ابتلاء بِما يَصْنَعُونَ من كل ما يظهر فيكم من الأفعال وعنكم‏\n\n\n### [حسن الحسنة وحسن السيئة]\n\n\nوفي هذا الركن أيضا في قوله ما فات من فات فلان فلانا جودا إذا أربى عليه في الجود وزاد فهذا يرى الندم في التوبة على ما فات أي ما زاد حسن السيئة المبدلة على حسن الحسنة غير المبدلة فإن حسن الحسنة بنفسها لا بأمر آخر وحسن السيئة إذا أبدلت لها حسنان حسن ذاتي وهو الحسن الذي لكل فعل من حيث ما هو لله وحسن زائد وهو ما خلع الحق على هذا الفعل بالتبديل فكسا ما ظهر فيه من السوء حسنا ففات سوء العمل حسن على حسن العمل بما كساه الحق فالحسنة كشخص جميل في غاية الجمال لا بزة عليه وشخص جميل مثله في غاية الجمال طرأ عليه وسخ من غبار فنظف من ذلك الوسخ العارض فبان جماله ثم كسي بزة حسنة فاخرة تضاعف بها جماله وحسنه ففات الأول حسنا\n\n\n### [لسان آدم في الندم‏]\n\n\nفالتائب يندم على ما فات حيث لم تكن أفعاله كلها معلومة له إنها بهذه المثابة فيتصل فرحه قال في هذه الآية وكانَ الله غَفُوراً أي يستر عمن شاء الوقوف على مثل هذا كشفا رَحِيماً رحمة به لمعنى علمه سبحانه لم يعينه لنا فندم مثل هذا الذي هو أثر الحزن مثل ما يجده المحب على محبوبه من الوجد والحزن والكرب والندم على ما فرط في حق محبوبه الذي زين له فكان يتلقاه بأعظم مما تلقاه من الحرمة والحشمة يقول لسان آدم‏\n\n\n> فيا طاعتي لو كنت كنت بحسرة *** ومعصيتي لولاك ما كنت مجتبى‏\n\n\nقال تعالى ثُمَّ اجْتَباهُ رَبُّهُ فَتابَ عَلَيْهِ وهَدى‏ فالله كان التائب لا آدم والذي صدر من آدم ما اقتضته خاصية الكلمات التي تلقاها وما فيها ذكر توبة وإنما هو مجرد اعتراف وهو قوله رَبَّنا ظَلَمْنا أَنْفُسَنا حيث عرضوها إلى التلف وكان حقها عليهم أن يسعوا في نجاتها بامتثال نهي سيدهم وإِنْ لَمْ تَغْفِرْ لَنا وتَرْحَمْنا أي وإن لم تسترنا عن وارد المخالفة حتى لا يحكم سلطانه علينا وترحمنا بذلك الستر لَنَكُونَنَّ من الْخاسِرِينَ ما ربحت تجارتنا فانتج لهم هذا الاعتراف قوله فَتابَ عَلَيْهِ وهَدى‏ أي رجع عليهم بستره فحال بينهم ذلك الستر الإلهي وبين العقوبة التي تقتضيها المخالفة وجعل ذلك من عناية الاجتباء أي لما اجتباه أعطاه الكلمات وهدى أي بين له قدر ما فعل وقدر ما يستحقه من الجزاء وقدر ما أنعم به عليه من الاجتباء ومع التوبة قال له اهبط هبوط ولاية واستخلاف لا هبوط طرد فهو هبوط مكان لا هبوط رتبة\n\n\n> هبوط مكان لا هبوط مكانة *** لتلقى به فوزا وملكا مخلدا\n\n\n> كما قال من أغواه صدقا لكونه *** رآه كلاما من إله مسددا\n\n\nفإن إبليس قال له هَلْ أَدُلُّكَ عَلى‏ شَجَرَةِ الْخُلْدِ ومُلْكٍ لا يَبْلى‏ فسمع ذلك الخطاب من ربه تعالى فكان صدقا لحسن ظنه بربه فعرض له من أجل المحل الذي ظهر فيه خطاب الحق وأورثه ظهور السوآت من أجل المحل وأورثه الأكل الخلد والملك الذي لا يبلى ولكن بعد ظهور سلطانه ونيابته ونيابة بنيه في خلقه حكما مقسطا عدلا يرفع القسط ويضعه أورثه‏\nذلك كله توبة ربه‏\n\n\n### [الناصح نفسه من سلك طريقة أبيه آدم في التوبة]\n\n\nواعلم أن توبة ربه مقطوع لها بالقبول وتوبة العبد في محل الإمكان لما فيها من العلل وعدم العلم باستيفاء حدودها وشروطها وعلم الله فيها فالعارفون آدميون يسألون من ربهم أن يتوب عليهم وحظهم من التوبة الاعتراف والسؤال لا غير ذلك هذا معنى قوله تعالى وتُوبُوا إِلَى الله جَمِيعاً أي ارجعوا إلى الاعتراف والدعاء كما فعل أبوكم آدم فإن الرجوع إلى الله بطريق العهد وهو لا يعلم ما في علم الله فيه خطر عظيم فإنه إن كان قد بقي عليه شي‏ء من مخالفة فلا بد من نقض ذلك العهد فينتظم في قوله الَّذِينَ يَنْقُضُونَ عَهْدَ الله من بَعْدِ مِيثاقِهِ فلم ير أكمل معرفة من آدم عليه السلام حيث اعترف ودعا وما عهد مع الله توبة عزم فيها إنه لا يعود كما يشترطه علماء الرسوم في حد التوبة فالناصح نفسه من سلك طريقة آدم‏\n\n\n### [في العزم على أن لا يعود سوء أدب مع الله‏]\n\n\nفإن في العزم سوء أدب مع الله بكل وجه فإنه لا يخلو أن يكون عالما بعلم الله فيه إنه لا يقع منه زلة في المستأنف أم لا فإن كان عالما بذلك فلا فائدة في العزم على أن لا يعود بعد علمه أنه لا يعود وإن لم يعلم وعاهد الله على ذلك وكان ممن قضى الله عليه أن يعود ناقض عهد الله وميثاقه وإن أعلمه الله أنه يعود فعزمه بعد العلم أنه يعود مكابرة فعلى كل وجه لا فائدة للعزم في المستأنف لا لذي العلم ولا لغير العالم فالتوبة التي طلب منا إنما هي صورة ما جرى من آدم عليه السلام‏\n\n\n### [معنى التوبة عند أهل الله‏]\n\n\nهذا معنى التوبة عند أهل الله فإن الله يحب كل مفتن تواب أي كل من اختبره الله في كل نفس فيرجع إلى الله فيه لا عزم إنه لا يعود لما تاب منه فهو جهل على الحقيقة فإن الذي تاب منه من المحال أن يرجع إليه وإن رجع إنما يرجع إلى مثله لا إلى عينه فإن الله لا يكرر شيئا في الوجود فالعالم بذلك لا يعزم على أنه لا يعود والذي ينظره أهل الله أن التائب يعزم أنه لا يعود أن ينسب إليه ما ليس إليه وإن عاد بنسبته إليه فقد علم عند العزم أن ذلك العود إلى الله لا إليه فلا تضره الغفلة بعد تصحيح الأصل وهو بمنزلة النية عند الشروع في العمل فإن الغفلة لا تؤثر في العمل فسادا وإن لم يحصر في أثناء العمل ما أحضره عند الشروع فهكذا العازم في عزمه‏\n\n\n### [توبة المحققين لا ترتفع دنيا ولا آخرة]\n\n\nواعلم أن مقام التوبة من المقامات المستصحبة إلى حين الموت ما دام مخاطبا بالتكليف أعني التوبة المشروعة وأما توبة المحققين فلا ترتفع دنيا ولا آخرة فلها البداية ولا نهاية لها إلا أن يكون الاسم التواب في المظهر عين الظاهر فلا بدء في أحواله ولا نهاية وإن كانت كل توبة لها بدء\n\n\n### [التوبة الكونية]\n\n\nوالتوبة الكونية ملكية جبروتية عند الجماعة وهو محل إجماعهم وزاد بعضهم أنها ملكوتية فمن لم ير أنها ملكوتية قال إنها تعطي صاحبها ثمانمائة مقام وثمانية مقامات ومن رأى أنها ملكوتية قال إنها تعطي أربعمائة مقام وثلاثة عشر مقاما والواقفية أرباب المواقف مثل محمد بن عبد الجبار النفري وأبي يزيد البسطامي قال هي غيبية آثارها حسية وجميع ما تتضمنه هذه المعاملات من المقامات الإلهية الجسام ما فيها مقام يتكرر على ما قد تقرر في الأصل ولو تاب الخلق كلهم ملك وإنس وجان ومعدن ونبات وحيوان وفلك ونالوا هذه المقامات كلها لما اجتمع اثنان في ذوق واحد منها وهي منازل فيها ينزلها العبد إذا أحكم ذلك المقام الذي هو التوبة أو غيره ويعطيه كل منزل منها من الأسرار والعلوم ما لا يعلمه إلا الله ولهذا المقام الحجاب والكشف‏\n\n\n### [التوبة اعتراف ودعاء لا عزم على عدم العودة]\n\n\nومما يؤيد ما ذكرناه من أن التوبة اعتراف ودعاء لا عزم على أنه لا يعود ما ثبت في الأخبار الإلهية وصح أن العبد بذنب الذنب ويعلم أن له ربا يغفر الذنب ويأخذ بالذنب ولم يزد على هذا مثل صورة آدم سواء ثم يذنب الذنب فيعلم إن له ربا يغفر الذنب ويأخذ بالذنب فيقول الله له في ثالث مرة أو رابع مرة اعمل ما شئت فقد غفرت لك وهذا مشروع أن الله قد رفع في حق من هذه صفته المؤاخذة بالذنب على من يرى أن الخطاب على غير من ليس بهذه الصفة منسحب وأما ظاهر الحديث فإن الله قد أباح له ما قد كان حجر عليه لأجل هذه الصفة كما أحل الميتة للمضطر وقد كانت محرمة على هذا الشخص قبل أن تقوم به صفة الاضطرار ثم إنه قد بينا أن من عباد الله من يطلعه الله على ما يقع منه في المستأنف فكيف يعزم على أن لا يعود فيما يعلم بالقطع أنه يعود ولم يرد شرع نقف عنده أن من حد التوبة المشروعة العزم في المستأنف فلم تبق التوبة إلا ما قررناه في حديث آدم عليه السلام ثم يؤيد ذلك قوله تعالى ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا إِنَّ الله هُوَ التَّوَّابُ يعني في الحالتين ما هم أنتم ينظر إليه قوله وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ وقوله فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ وقوله ما قَطَعْتُمْ من لِينَةٍ أَوْ تَرَكْتُمُوها قائِمَةً عَلى‏ أُصُولِها فَبِإِذْنِ الله‏\n\n\n### [الإذن الإلهي هو الأمر الإلهي‏]\n\n\nوالأذن الأمر الإلهي أمر بعض الشجر أن تقوم فقامت وأمر بعض الشجر أن تنقطع‏\nفانقطعت بإذن الله لا بقطعهم وبإذن الله لا بتركهم مع كونهم موصوفين بالقطع والترك فإنه لا يناقض إذن الله فإن إذن الله لها في هذه الصورة كالاستعداد في الشي‏ء فالشجرة مستعدة للقطع فقبلته من القاطع فقوله فَبِإِذْنِ الله يعني للشجرة كقوله فَتَكُونُ طَيْراً بِإِذْنِي فالنفخ من عيسى لوجود الروح الحيواني إذ كان النفخ أعني الهواء الخارج من عيسى هو عين الروح الحيواني فدخل في جسم هذا الطائر وسرى فيه إذ كان هذا الطائر على استعداد يقبل الحياة بذلك النفس كما قبل العجل الحياة مما رمى فيه السامري فطار الطائر بإذن الله كما خار عجل السامري بإذن الله ولهذا قال ولِيُخْزِيَ الْفاسِقِينَ الخارجين عن معرفة هذا الأذن الإلهي الذي قطع هذه الشجرة وترك الأخرى‏\n\n\n### [الجواب عن الشي‏ء بالنتائج والحال أتم من غيره‏]\n\n\nولشيوخنا في هذا المقام حدود أذكر منها ما تيسر وأبين عن مقاصدهم فيها بما يقتضيه الطريق وهكذا أفعل إن شاء الله في كل مقام إذا وجدنا لهم فيه كلاما على أنهم إذا سألوا عن ماهية الشي‏ء لم يجيبوا بالحد الذاتي لكن يجيبون بما ينتج ذلك المقام فيمن اتصف به فعين جوابهم يدل على إن المقام حاصل لهم ذوقا وحالا وكم من عالم بحده الذاتي وليس عنده منه رائحة بل هو عنه بمعزل بل ليس بمؤمن رأسا وهو يعلم حده الذاتي والرسمي فكان الجواب بالنتائج والحال أتم بلا خلاف فإن المقامات لا فائدة فيها إلا أن يكون لها أثر في الشخص لأنها مطلوبة لذلك لا لأنفسها والله المرشد\n\n\n### [أول منزل من منازل السالكين‏]\n\n\nواختلف أصحابنا ما أول منزل من منازل السالكين فقال بعضهم اليقظة وقال بعضهم الانتباه وقال بعضهم التوبة وروى أن رسول الله صلى الله عليه وسلم قال الندم توبة\n\n\nفقد يخرج مخرج‏\n\n\nقوله الحج عرفة\n\n\nولو قال صلى الله عليه وسلم الندم التوبة لكان أقرب إلى الحد من‏\n\n\nقوله الندم توبة\n\n\nوقد تقدم الكلام في الشروط الثلاثة المصححة للتوبة في هذا الباب‏\n\n\n### [أقسام التوبة الثلاثة]\n\n\nقال بعضهم وهو أبو علي الدقاق التوبة على ثلاثة أقسام لأن لها بداية ووسطا وغاية فبدؤها يسمى توبة ووسطها يسمى إنابة وغايتها يسمى أوبة فالتوبة للخائف والإنابة للطائع والأوبة لراعي الأمر الإلهي يشير بهذا التقسيم إلى أن التوبة عنده عبارة عن الرجوع عن المخالفات خاصة والخروج عما يقدر عليه من أداء حقوق الغير المترتبة في ذمته مما لا يزول إلا بعفو الغير عن ذلك أو القصاص أو رد ما يقدر على رده من ذلك وقال رويم وقد سئل عن التوبة التوبة من التوبة كما قال ابن العريف‏\n\n\n> قد تاب أقوام كثير وما *** تاب من التوبة إلا أنا\n\n\nومقالات القوم في التوبة كثيرة مذكورة في كتب المقامات للمنذري والقشيري والمطوعي وعمرو بن عثمان المكي وغيرهم فلينظر هنالك‏\n\n",
    "en": "## Chapter Seventy-Four: Concerning Repentance (التوبة)\n\n> Confession is the repentance (متاب) of every realized one (محقق), / And by it, the True God (الإله الحق) expands his breast.\n> God is pleased with the one who opposes [His command] just as / God is pleased with the one who conforms to His command.\n> What is so great that he should attain his attainment, / Especially if you know its secret?\n> From the very source of His grace (منته), the opponent attains / What he attains, if you are ignorant of its measure.\n\n### Imparting the Argument (الحجة) when the Command is Opposed\n\nKnow, may Allah support us and you, that Allah says: <<وَتُوبُوا إِلَى اللهِ جَمِيعاً أَيُّهَا الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ>> (And repent unto Allah all of you, O believers, that you may succeed). He commanded His servants to repent, and then He imparted the argument (الحجة) to them, should they oppose His command. Thus, the Exalted said: <<ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا>> (Then He turned unto them, that they might turn), so that they might say, if they were asked about that—meaning, \"If You had turned unto us, we would have turned\"—just like His saying, the Exalted: <<مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ>> (What has deluded you concerning your Generous Lord?), so that he might say, \"Your generosity.\" This falls under the category of the opponent teaching his adversary the argument (الحجة) so that he may argue with him by means of it, provided that he is beloved. And He used the word *al-insān* (الإنسان) with the definite article and the term *al-ighrār* (delusion) to encompass all people. This indicates that the will of the Real (الحق) for them is ultimate felicity (السعادة في المال), even if they are afflicted by what contradicts it.\n\n### Allah’s Repentance (توبة الله) is Coupled with *‘Alā* (Upon), and the Creation’s Repentance (توبة الخلق) with *Ilā* (Unto)\n\nHowever, Allah’s repentance is coupled with the preposition *‘alā* (upon) because one of His Names (الأسماء) is the Name al-Ali (العلي - The High). The creation’s repentance is coupled with *ilā* (unto) because He is the One sought by repentance, thus He is its goal (غايتها). The Real (الحق) and the creation (الخلق) meet in the preposition *min* (from) regarding repentance: the common people returned to Him from themselves, while the Gnostics (العارفون) returned to Him from Him, and the knowers of Allah (العلماء بالله) returned to Him from their return to Him. As for the common people (العامة), they returned from opposition (المخالفات) to conformity (الموافقة). The Real, Exalted is He, returned to them from the implication of His saying, *if He should forsake you*, so that they might return to Him according to what their stations (مقاماتهم), which we detailed earlier, necessitate. The return of the Real upon them is so that they may return to Him, similar to His saying, <<يُحِبُّهُمْ وَيُحِبُّونَهُ>> (He loves them and they love Him). His return upon them is a return of primordial loving care (عناية محبة أزلية) so that they may repent. When they repent, He loves them with a love of one who has returned to Him; this is a love of recompense (حب جزاء). The Exalted says: <<إِنَّ اللهَ يُحِبُّ التَّوَّابِينَ>> (Indeed, Allah loves those who repent). This love from Him is not the first love. And the servant has another love, supplementary to His saying, <<وَيُحِبُّونَهُ>> (and they love Him), which is that:\n\nThe Prophet (peace and blessings be upon him) said: \"Love Allah for what He nourishes you with of His blessings.\"\n\nThis is a love of recompense for the Benefactor due to the blessings He bestowed upon them. This love from them, corresponding to <<إِنَّ اللهَ يُحِبُّ التَّوَّابِينَ>>, is a love of recompense for a love of recompense. The first love is a love of care from Him, initiated by Him, and their love for Him is a love of preference for His presence (حب إيثار لجنابه), not a love for His favors and blessings. Thus, repentance from them stems from a love that produces another love from Him. It is situated between two loves related to them from Allah, just as His turning upon them stems from a love from them that produces another love from them. So His turning upon them is also situated between two loves. This falls under the category of Allah creating Adam upon His form—meaning that all the attributes (الصفات) accepted by the Divine Presence (الحضرة الإلهية) are accepted by the minor and major human.\n\n### The Definition of Repentance (التوبة) and the Explanation of its First Pillar\n\nIts definition (حدها) is: abandoning the slip (الزلة) in the present moment, regretting what has passed, and determining that one will not return to what one has turned away from. After that, Allah does what He wills. As for abandoning the slip in the present moment, it is indispensable, because the sovereign of his time is shame (الحياء), and shame, by its sovereignty, intervenes between the one who possesses it and the transgression of Allah’s limits. One of Allah’s Names mentioned in the Sunnah is *al-Hayy* (الحي - The Living), and that Allah will feel shame (يستحيي) on the Day of Resurrection before the grey-haired one. Allah’s shame before the servant means that He has informed him that He, Glory be to Him, does not turn unto them until He turns upon them. So, if the forsaken one (المخذول), upon whom Allah has not turned, stands before Him on the Day of Resurrection, remembering in his soul the verse <<ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا>> (Then He turned unto them, that they might turn), Allah feels shame to hold him accountable for a sin, just as the servant feels shame before Allah during his repentance to Allah that a slip should occur from him while he is in that state—for he is not a penitent in that state. We are speaking about the penitent, and shame is necessary for him. Shame necessitates abandoning the slip in the present moment. For the Gnostic (العارف), abandoning the slip in the present moment means abandoning the attribution of the slip to his Lord, attributing it instead to himself, out of proper conduct (أدبا) with Allah. In reality, the act is Allah’s act, the decree (القدر) is from Allah, and the judgment that it is a disobedience or a slip is Allah’s judgment. Despite this, proper conduct dictates that he attribute it to himself because the tongue of blame is attached to it. This is why it was said in the definition of the soul (النفس): \"Every blameworthy thought,\" and the origin is <<فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا>> (And inspired it [with discernment of] its wickedness and its righteousness).\n\n### The Position of Some Knowers of Allah (العلماء بالله) Regarding Abandoning the Slip in the Present Moment\n\nFor some knowers of Allah, abandoning the slip in the present moment means that they do not witness it as a slip, for it is the very decree (قضاء) of Allah concerning it, since He is the One Who judged it to be a slip. Yet, insofar as it is an act (فعل) from the acts of Allah, it is in the utmost beauty and perfection (في غاية الحسن والجمال). It was only named a slip (*zalla*) from *zalla* (slipped), meaning *zalaqa* (stumbled), meaning it slipped from the attribution of being one of Allah’s acts to Allah’s judgment concerning it with blame. So, Allah’s judgment concerning it is that it is a slip (*zalal*) from this level—know this. For some knowers of Allah, abandoning the slip in his case means witnessing the slip in that act insofar as it is a slip, not insofar as it is an act to which blame or praise is attached. He witnesses its attribution to the servant, by which it was named a slip, and then follows it with blame. However, if every divine act is attributed to the servant in this category, then all cosmic acts (الأفعال الكونية) are slips, both the praiseworthy and the blameworthy among them.\n\n### The Position of Some People Regarding Abandoning the Slip in the Present Moment\n\nFor some people, abandoning the slip in the present moment means their preoccupation with their return to their Lord, while the slip (الذلة) is their turning away from their Lord. Thus, he is in the opposite (النقيض). And one who is in the opposite state cannot be in its contrary state; therefore, necessarily, he has no slip in this state. For some people, abandoning the slip in the present moment means their preoccupation with witnessing the return of the Real (الحق) upon him so that he may return to Him, distinguishing between His return upon him so that he may return to Him, and another return that is not for him to return to Him. This is to differentiate between the two returns, so that he may establish for himself the balance (ميزان) of what is incumbent upon him in that regard from Allah, whether it be an act of remembrance (ذكر) by the tongue or heart, or an act by a limb, or the totality, or part of the totality. And one who is preoccupied in this manner cannot have a slip occur to him in the present moment. For some people, abandoning the slip in the present moment means witnessing the return of the Real to him, not to distinguish, nor to return to Him, but rather to know the true meaning of the Divine Return: to what is He attributing it? Is it to the Essence (الذات) or to a Divine Name (اسم إلهي)? And what is the cause of that return? Is it essential (ذاتي) or non-essential (غير ذاتي), or does it have no relation to the Essence? These aspects and their like are what abandoning the slip in the present moment demands.\n\n### The Second Pillar of Repentance (التوبة) and the Position of the Sufis (الصوفية) Regarding It\n\nAs for the second pillar, which is regret over what has passed (الندم على ما فات), it is considered by the jurists (الفقهاء) to be the greatest pillar (الركن الأعظم), similar to the saying, \"Hajj is Arafah,\" because it is the greatest pillar. Here, many matters branch out among the penitents. The *mīm* of *nadam* (regret) is inverted from a *bā’*, like *lāzim* and *lāzib* (necessary/adhering). It is the trace of his sorrow over what he missed, called *nadam*. *Nadab* is the trace, so it was inverted to a *mīm* and specifically designated for the trace of sorrow. As for its relation to what has passed, some of our companions hold that it is a waste of time, for what has passed cannot be retrieved. Others of our companions hold that the penitent is the master of the moment, and its benefit is that it compensates for what has passed (يجبر له ما مضى). They argue using His saying: <<إِلَّا مَنْ تابَ وآمَنَ وعَمِلَ عَمَلًا صالِحاً فَأُوْلئِكَ يُبَدِّلُ اللهُ سَيِّئاتِهِمْ حَسَناتٍ>> (Except for those who repent, believe, and do righteous deeds; for them Allah will change their evil deeds into good deeds). Some of our companions hold that one only regrets by bringing to mind the sin that intervened between him and the obedience to the command of his Lord, Exalted is He, that he missed. [They also hold that] remembering harshness during a state of purity is harshness (جفاء), so he ought to forget his sin—which contradicts the first view, which said that repentance is that you do not forget your sin. The discussion concerns what he missed. Some regret missing seeking forgiveness (الاستغفار) after every sin. Some see regret over the time (الوقت) that passed. Some people see regret over the obedience missed during the time of opposition. Some people see regret over missing the commission of major sins during the time of opposition, because they witness the substitution (التبديل) of every evil deed with a corresponding good deed, such as killing a soul with reviving a soul, blame with praise, and charity with usurpation, theft, or betrayal. Some people see regret over missing the presence with Allah (الحضور مع الله) in His decree of disobedience during the state of disobedience. Some people see regret over missing the attribution of that act to the Agent (الفاعل) during the state of the act.\n\n### Attributing the Act to the Real Agent (الفاعل الحقيقي) During the State of the Act\n\nThis is a great, radiating light (نور عظيم شعشعاني), whose veil is <<أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَناً>> (Is he whose evil deed was made attractive to him, so he saw it as good?). He coupled the evil (السوء) with it when he attributed it to himself, so he saw it as good (حسنا). There must be a Presence of Existence (حضرة وجودية) that necessitated the goodness (الحسن) he saw in the locus of the act, since the contingent (الممكن) does not see non-existence (العدم). And there is no goodness there except that it is from the acts of Allah. What made it evil (أساءه) was only its attribution to the servant, for He said: <<أَفَمَنْ زُيِّنَ لَهُ>> (Is he whose was made attractive to him)—by virtue of its being for his Lord—<<سُوءُ عَمَلِهِ>> (the evil of his deed)—by virtue of its being his deed, thus earning the evil—<<فَرَآهُ حَسَناً>> (so he saw it as good) through the Divine adornment (التزيين الإلهي). And Allah’s adornment is not forbidden. So, in reality, it is adorned with Allah’s adornment. And with the servant, it is according to what is present in him. If the adornment of Satan is present in him, it is evil upon evil. If the adornment of the worldly life is present in him, it is heedlessness within evil. If the adornment of Allah is present, and the attribution is to the servant, it is goodness within evil. If he takes the attribution of evil to the act as Divine proper conduct (أدبا إلهيا), then it is goodness within goodness.\n\n> Everything in which You are present is good, / Its beauty does not care what it wears,\n> Be it the garment of opposition or conformity.\n\nFor if you do not conform to the command (الأمر), you conform to the Will (الإرادة). Were it not for the suitability between the evil (السيئ) and the good (الحسن) that necessitates their combination in a single entity, by which it becomes good—especially before the substitution mentioned in His saying <<يُبَدِّلُ اللهُ سَيِّئاتِهِمْ حَسَناتٍ>> (Allah will change their evil deeds into good deeds)—the evil of the deed would not be described by goodness in his vision. It was not described as good by him until the act accepted the attribute of goodness in one of the existential aspects (الوجوه الوجودية). Thus, it is evil according to the report (الخبر), but good according to the vision (الرؤية). The vision, therefore, does not confirm the report, and the witness of the vision is more decisive.\n\n> But for direct witnessing (العيان) there is a subtle meaning, / For this reason, the Interlocutor (الكليم) asked for direct observation.\n\n### People Seek for the Report (الخبر) to Confirm the Report\n\nPeople seek for the report to confirm the report, and the report to confirm the vision. We have not seen anyone seek for the report to confirm the vision, as the report confirms the report. This is why there is disagreement regarding the testimony of the blind person, but no disagreement regarding the testimony of the sighted person. This is why He said in the verse: <<فَإِنَّ اللهَ يُضِلُّ مَنْ يَشاءُ>> (Indeed, Allah leads astray whom He wills)—meaning He confuses him in matters like this, where He describes it as both evil and good, so the legally responsible person (المكلف) does not know which prevails. And by His saying, *was made attractive* (زين), using the passive voice, the agent is unnamed, so he does not know who adorned it: was it Allah’s adornment, Satan’s adornment, or the adornment of the worldly life? Then He said: <<وَيَهْدِي مَنْ يَشاءُ>> (And He guides whom He wills)—meaning He grants success in grasping the correct meaning of the evil and the good of this act, what its meaning is, and how one ought to approach it. <<فَلا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَراتٍ>> (So do not let your soul perish over them in regret)—meaning, do not grieve over them. This is good news from Allah regarding the ultimate felicity (سعادة) of all. For the Prophet (peace and blessings be upon him) was not prevented from his humanity (إنسانيته); he is human in every state. Regrets (الحسرات) do not depart from him—and he is the Perfect Human (إنسان كامل)—except by his being informed of their ultimate felicity. Thus, he does not care about the accidental factors (العوارض), for the evil of the act is undoubtedly accidental (عارض), while its goodness is essential (ذاتي). Every accidental factor vanishes, and every essential factor remains and does not depart. <<فَإِنَّ اللهَ خَبِيرٌ>> (Indeed, Allah is All-Aware)—meaning All-Knowing (عَلِيمٌ) concerning the trial—<<بِمَا يَصْنَعُونَ>> (of what they do) of all the acts that appear in you and proceed from you.\n\n### The Goodness of the Good Deed (الحسنة) and the Goodness of the Evil Deed (السيئة)\n\nAlso in this pillar, concerning His saying *mā fāt* (what passed/missed), *fāta fulānun fulānan jūdan* means So-and-so surpassed so-and-so in generosity (جودا) and exceeded him. This view sees regret in repentance over *mā fāt* (what surpassed), meaning the goodness of the substituted evil deed (السيئة المبدلة) exceeded the goodness of the unsubstitutable good deed (الحسنة غير المبدلة). For the goodness of the good deed is inherent in itself, not by another matter. But the goodness of the evil deed, when substituted, has two kinds of goodness: an essential goodness (حسن ذاتي), which is the goodness inherent in every act insofar as it belongs to Allah, and a supplementary goodness (حسن زائد), which is what the Real (الحق) bestowed upon this act through substitution, clothing what appeared as evil in it with goodness. Thus, the evil of the act surpassed the goodness of the good act by what the Real clothed it with. The good deed is like a beautiful person in the utmost perfection, wearing no garment. And a person equally beautiful, in the utmost perfection, upon whom dirt from dust has settled. He is then cleaned of that accidental dirt, and his beauty becomes apparent. Then he is clothed in a fine, luxurious garment (بزة حسنة فاخرة) by which his beauty and perfection are doubled. Thus, he surpassed the first one in goodness.\n\n### The Utterance of Adam (آدم) Regarding Regret\n\nThe penitent regrets what he missed, in that his acts were not all known to him to be of this status, so his joy is connected [to this knowledge]. He said concerning this verse: <<وَكَانَ اللهُ غَفُوراً>> (And Allah is Ever Forgiving)—meaning He conceals from whomever He wills the unveiling (كشف) of such a matter—<<رَحِيماً>> (Most Merciful)—a mercy to him for a meaning known to Him, Glory be to Him, which He did not specify for us. The regret of such a person, which is the trace of sorrow, is like what the lover finds in his beloved: ecstasy, sorrow, distress, and regret over what he neglected regarding his beloved, who was adorned for him. He would have received Him with greater reverence and respect than he did. The utterance of Adam is:\n\n> O my obedience, if I had been, I would have been in sorrow, / And my disobedience—were it not for You—I would not have been chosen.\n\nThe Exalted said: <<ثُمَّ اجْتَباهُ رَبُّهُ فَتابَ عَلَيْهِ وَهَدى>> (Then his Lord chose him, and turned unto him, and guided him). It was Allah Who was the penitent (التائب), not Adam. What proceeded from Adam was what the characteristic of the words (الكلمات) he received necessitated, and there is no mention of repentance (توبة) in them. It is merely a confession (اعتراف), which is his saying: <<رَبَّنا ظَلَمْنا أَنْفُسَنا>> (Our Lord, we have wronged ourselves), in that they exposed themselves to destruction, when their duty was to strive for their salvation by obeying the prohibition of their Master. <<وَإِنْ لَمْ تَغْفِرْ لَنا وَتَرْحَمْنا>> (And if You do not forgive us and have mercy upon us)—meaning, if You do not conceal us from the incoming impulse of opposition so that its sovereignty does not rule over us, and have mercy upon us through that concealment—<<لَنَكُونَنَّ مِنَ الْخاسِرِينَ>> (We will surely be among the losers), meaning our trade will not profit. This confession resulted in His saying: <<فَتابَ عَلَيْهِ وَهَدى>> (and turned unto him, and guided him)—meaning He returned upon them with His concealment, and that Divine concealment intervened between them and the punishment necessitated by the opposition. He made that part of the care of choosing (الاجتباء). That is, when He chose him, He gave him the words and guided him—meaning He clarified for him the measure of what he did, the measure of the recompense he deserved, and the measure of the blessing He bestowed upon him through the choosing. Along with the repentance, He said to him, \"Descend,\" a descent of vicegerency and succession (هبوط ولاية واستخلاف), not a descent of expulsion. It is a descent of place, not a descent of rank.\n\n> A descent of place, not a descent of rank, / So that by it you may meet success and an eternal kingdom.\n\nAs the one who misled him said truthfully, because Adam saw it as speech from a guiding God:\n\nIblis said to him: <<هَلْ أَدُلُّكَ عَلى شَجَرَةِ الْخُلْدِ وَمُلْكٍ لا يَبْلى>> (Shall I guide you to the tree of eternity and a kingdom that will not decay?). Adam heard that address from his Lord, the Exalted, so it was truthful due to his good opinion of his Lord. The address of the Real appeared to him because of the locus in which it appeared. The appearance of the private parts (السوآت) resulted from the locus, and the eating resulted in the eternity and the kingdom that does not decay, but only after the appearance of his sovereignty and his vicegerency, and the vicegerency of his children in His creation, as a just and equitable ruler who raises and lowers justice. All of that was bequeathed to him by the repentance of his Lord.\n\n### The One Who Counsels Himself is He Who Follows the Path of His Father Adam in Repentance (التوبة)\n\nKnow that the repentance of his Lord is definitively accepted, while the repentance of the servant is in the realm of possibility (محل الإمكان) due to the defects (العلل) it contains, the lack of knowledge regarding the fulfillment of its limits and conditions, and Allah’s knowledge concerning it. The Gnostics (العارفون) are Adamites; they ask their Lord to turn upon them, and their share of repentance is confession (الاعتراف) and supplication (السؤال), nothing else. This is the meaning of His saying, the Exalted: <<وَتُوبُوا إِلَى اللهِ جَمِيعاً>> (And repent unto Allah all of you)—meaning, return to confession and supplication, just as your father Adam did. For returning to Allah by way of a covenant (العهد), while not knowing what is in Allah’s knowledge concerning it, carries a great risk. If any opposition remains incumbent upon him, that covenant must be broken, and he falls under the category of <<الَّذِينَ يَنْقُضُونَ عَهْدَ اللهِ مِنْ بَعْدِ مِيثاقِهِ>> (those who break the covenant of Allah after contracting it). Thus, no one is seen to possess more perfect gnosis (معرفة) than Adam, peace be upon him, since he confessed and supplicated, and did not covenant with Allah a repentance in which he determined that he would not return, as is stipulated by the scholars of external forms (علماء الرسوم) in the definition of repentance. The one who counsels himself is he who follows the path of Adam.\n\n### The Determination Not to Return is Improper Conduct (سوء أدب) with Allah\n\nFor determination (العزم) involves improper conduct (سوء أدب) with Allah in every respect. He is either knowledgeable of Allah’s knowledge concerning him—that no slip will occur from him in the future—or he is not. If he is knowledgeable of that, there is no benefit in determining not to return after knowing that he will not return. If he is not knowledgeable and covenants with Allah upon that, and he is one whom Allah has decreed to return [to sin], he has broken Allah’s covenant and pledge. If Allah informs him that he will return, his determination after knowing that he will return is obstinacy (مكابرة). In every respect, there is no benefit in the determination regarding the future, neither for the knowledgeable nor for the ignorant. The repentance demanded of us is only the form of what transpired from Adam, peace be upon him.\n\n### The Meaning of Repentance (التوبة) According to the People of Allah (أهل الله)\n\nThis is the meaning of repentance according to the People of Allah. For Allah loves every tried, repentant one (كل مفتن تواب)—meaning everyone whom Allah tests in every breath, and he returns to Allah concerning it, without determining that he will not return to what he repented from. That determination is ignorance in reality (جهل على الحقيقة), for it is impossible for him to return to the exact thing he repented from. If he returns, he only returns to its like, not to its exact self, for Allah does not repeat anything in existence (الوجود). The one who knows this does not determine that he will not return. What the People of Allah observe is that the penitent determines not to attribute to himself what does not belong to him. If he returns by attributing it to himself, he already knew at the time of determination that that return belongs to Allah, not to him. Thus, heedlessness does not harm him after correcting the foundation (الأصل). This is similar to the intention (النية) at the start of an action, for heedlessness does not affect the action with corruption, even if he does not maintain during the action what he maintained at the start. Likewise is the one who determines in his determination.\n\n### The Repentance (توبة) of the Realized Ones (المحققين) Does Not Cease in This World or the Hereafter\n\nKnow that the station of repentance (مقام التوبة) is one of the accompanying stations (المقامات المستصحبة) until the moment of death, as long as one is addressed by legal obligation (التكليف)—I mean the prescribed repentance (التوبة المشروعة). As for the repentance of the realized ones (توبة المحققين), it does not cease in this world or the Hereafter. It has a beginning but no end, unless the Name al-Tawwāb (التواب - The Acceptor of Repentance) in the manifestation (المظهر) is the very Manifest (الظاهر), in which case there is no beginning to his states (أحوال) and no end, even though every repentance has a beginning.\n\n### Cosmic Repentance (التوبة الكونية)\n\nCosmic repentance (التوبة الكونية) is considered *malakūtī* (Angelic) and *jabarūtī* (Divine Power) by the majority, which is their consensus. Some added that it is also *malakūtī*. Those who do not consider it *malakūtī* say that it grants its possessor eight hundred and eight stations (مقامات). Those who consider it *malakūtī* say that it grants four hundred and thirteen stations. The Standers (الواقفية), the masters of the Halting Places (أرباب المواقف), such as Muhammad ibn Abd al-Jabbar al-Niffari and Abu Yazid al-Bistami, said it is unseen (*ghaybiyya*) and its effects are sensory (*ḥissiyya*). All the immense Divine stations (المقامات الإلهية الجسام) encompassed by these spiritual transactions (المعاملات) contain no station that is repeated, according to what is established in the foundation. Even if all creation—angels, humans, jinn, minerals, plants, animals, and celestial spheres—were to repent and attain all these stations, no two would share the same spiritual taste (*dhawq*) of any one of them. These are mansions (منازل) that the servant enters when he perfects that station, whether it is repentance or another, and each mansion grants him secrets and sciences (الأسرار والعلوم) that none but Allah knows. This station has both veiling (الحجاب) and unveiling (الكشف).\n\n### Repentance (التوبة) is Confession and Supplication, Not Determination Not to Return\n\nWhat supports what we mentioned—that repentance is confession and supplication, not determination not to return—is what is established and authenticated in the Divine Narrations (الأخبار الإلهية): that the servant commits a sin and knows that he has a Lord Who forgives the sin and takes account of the sin. He does not add anything to this, exactly like the form of Adam. Then he commits the sin again and knows that he has a Lord Who forgives the sin and takes account of the sin. Allah says to him the third or fourth time, \"Do what you wish, for I have forgiven you.\" This is prescribed, meaning that Allah has lifted the accountability for sin in the case of one who possesses this attribute, according to those who hold that the address extends to those who do not possess this attribute. As for the apparent meaning of the Hadith, Allah has permitted for him what He had forbidden him due to this attribute, just as He made carrion lawful for the one in dire necessity, though it was forbidden to that person before the state of necessity arose in him. Furthermore, we have explained that Allah informs some of His servants of what will occur from them in the future. How, then, can he determine not to return to what he knows with certainty he will return to? No prescriptive law (شرع) has reached us that stipulates that determination regarding the future is a limit of prescribed repentance. Thus, repentance remains only what we established in the narrative of Adam, peace be upon him. This is further supported by His saying, the Exalted: <<ثُمَّ تابَ عَلَيْهِمْ لِيَتُوبُوا>> (Then He turned unto them, that they might turn). <<إِنَّ اللهَ هُوَ التَّوَّابُ>> (Indeed, Allah is the Acceptor of Repentance)—meaning in both states. What you are is what His saying refers to: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللهَ رَمَى>> (And you did not throw when you threw, but it was Allah who threw), and His saying: <<فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللهَ قَتَلَهُمْ>> (And you did not kill them, but it was Allah who killed them), and His saying: <<مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللهِ>> (Whatever palm tree you cut down or left standing on its roots, it was by the permission of Allah).\n\n### The Divine Permission (الإذن الإلهي) is the Divine Command (الأمر الإلهي)\n\nThe Permission (الإذن) is the Divine Command (الأمر الإلهي). He commanded some trees to stand, and they stood, and He commanded some trees to be cut, and they were cut by the permission of Allah, not by their cutting, and by the permission of Allah, not by their leaving them, despite their being described as cutting and leaving. This does not contradict Allah’s permission, for Allah’s permission for the tree in this form is like the preparedness (الاستعداد) in the thing. The tree was prepared for cutting, so it accepted it from the cutter. His saying <<فَبِإِذْنِ اللهِ>> (it was by the permission of Allah) means for the tree, just like His saying: <<فَتَكُونُ طَيْراً بِإِذْنِي>> (and you create a bird by My permission). The breathing (النفخ) from Jesus was for the existence of the animal spirit (الروح الحيواني), since the breath—meaning the air exiting Jesus—was the very animal spirit. It entered the body of that bird and flowed through it, as that bird had a preparedness to accept life through that breath, just as the calf accepted life from what the Samiri threw into it. The bird flew by the permission of Allah, just as the Samiri’s calf lowed by the permission of Allah. For this reason, He said: <<وَلِيُخْزِيَ الْفاسِقِينَ>> (and that He might disgrace the defiantly disobedient)—those who depart from the gnosis (معرفة) of this Divine Permission (الإذن الإلهي) that cut this tree and left the other.\n\n### Answering Concerning a Thing by its Results (النتائج) and State (الحال) is More Complete Than Otherwise\n\nOur Shaykhs have definitions (حدود) concerning this station. I will mention what is facilitated and clarify their intentions regarding them according to what the Path necessitates. I shall do this, God willing, in every station where we find discourse from them. When they are asked about the quiddity (ماهية) of a thing, they do not answer with the essential definition (الحد الذاتي), but rather they answer with what that station produces in the one who is characterized by it. The very nature of their answer indicates that the station is attained by them through spiritual taste (*dhawq*) and state (*ḥāl*). How many a scholar knows its essential definition, yet has no scent of it, but is far removed from it—indeed, he may not be a believer at all—while knowing its essential and formal definition (الحد الرسمي). Thus, answering by the results (النتائج) and the state (الحال) is, without dispute, more complete, for the stations (المقامات) are useless unless they have an effect on the person, because they are sought for that effect, not for themselves. And Allah is the Guide.\n\n### The First Mansion (منزل) of the Wayfarers (السالكين)\n\nOur companions differed regarding the first mansion (منزل) of the wayfarers (السالكين). Some said it is wakefulness (اليقظة), some said it is alertness (الانتباه), and some said it is repentance (التوبة). It is narrated that the Messenger of Allah (peace and blessings be upon him) said: \"Regret is repentance.\"\n\nThis may be expressed in the manner of His saying: \"Hajj is Arafah.\"\n\nIf the Prophet (peace and blessings be upon him) had said, \"Regret is *the* repentance,\" it would have been closer to a definition than his saying, \"Regret is repentance.\"\n\nThe discussion regarding the three conditions that validate repentance has already preceded in this chapter.\n\n### The Three Divisions of Repentance (التوبة)\n\nSome, such as Abu Ali al-Daqqaq, said that repentance has three divisions because it has a beginning, a middle, and an end. Its beginning is called *Tawba* (Repentance), its middle is called *Ināba* (Turning), and its end is called *Awba* (Returning). *Tawba* is for the fearful (الخائف), *Ināba* is for the obedient (الطائع), and *Awba* is for the observer of the Divine Command (راعي الأمر الإلهي). By this division, he indicates that repentance, in his view, refers specifically to turning away from oppositions (المخالفات) and fulfilling what one is capable of regarding the rights of others incumbent upon him, which are only removed by the other person’s pardon, or retaliation, or the return of what he is able to return. Ruwaym, when asked about repentance, said: \"Repentance from repentance (التوبة من التوبة),\" as Ibn al-Arif said:\n\n> Many people have repented, but / None has repented from repentance except me.\n\nThe sayings of the people [Sufis] concerning repentance are numerous and mentioned in the books of stations (كتب المقامات) by al-Mundhiri, al-Qushayri, al-Mutawwi‘i, Amr ibn Uthman al-Makki, and others. Let them be consulted there.",
    "ur": "باب چوہترواں: توبہ کے بیان میں\n\nہر محقق کا رجوع (توبہ) اعتراف ہے،\nاور اسی کے ذریعے ذات حق (الحق) اس کا سینہ کھول دیتا ہے۔\nاللہ تعالیٰ مخالف سے بھی اسی طرح راضی ہوتا ہے جس طرح\nوہ اپنے حکم کی موافقت کرنے والے سے راضی ہوتا ہے۔\nاس کے لیے اپنی منزل پانا کیا مشکل ہے؟\nخاص طور پر اگر تم اس کا راز جانتے ہو۔\nمخالف بھی اس کے فضل کے سرچشمے سے وہ سب کچھ پا لیتا ہے جو اس نے پایا،\nاگر تم اس کی قدر سے ناواقف ہو۔\n\n### [حکم کی مخالفت پر دلیل سکھانا]\n\nجان لو، اللہ ہماری اور تمہاری تائید فرمائے، کہ اللہ تعالیٰ فرماتا ہے: \"اور اے مومنو! تم سب کے سب اللہ کی طرف توبہ کرو تاکہ تم فلاح پاؤ\" (وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَا الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ)۔ پس اس نے اپنے بندوں کو توبہ کا حکم دیا، پھر اگر وہ اس کے حکم کی مخالفت کریں تو انہیں دلیل سکھائی۔ چنانچہ اللہ تعالیٰ نے فرمایا: \"پھر اس نے ان پر رجوع فرمایا تاکہ وہ توبہ کریں\" (ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا)۔ تاکہ جب ان سے اس بارے میں پوچھا جائے تو وہ کہیں (یعنی اگر تو ہم پر توبہ قبول کرتا تو ہم توبہ کرتے)۔ یہ اسی طرح ہے جیسے اللہ تعالیٰ کا فرمان ہے: \"اے انسان! تجھے تیرے رب کریم کے بارے میں کس چیز نے دھوکے میں ڈال دیا؟\" (مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ)۔ تاکہ وہ کہے کہ آپ کے کرم نے۔ یہ اس باب سے ہے کہ محبوب ہونے کی صورت میں فریق مخالف کو اس کی دلیل سکھائی جائے تاکہ وہ اس کے ذریعے اس سے بحث کر سکے۔ اور لفظ \"الإنسان\" (انسان) کو الف لام کے ساتھ اور \"الإغرار\" (دھوکہ) کے ساتھ لایا گیا تاکہ یہ تمام لوگوں کو شامل ہو جائے۔ یہ وہ چیز ہے جو تمہیں اس بات پر دلالت کرتی ہے کہ ذات حق (الحق) کا ان سے ارادہ انجام کار میں سعادت کا ہے، اگرچہ انہیں وہ چیزیں پہنچیں جو اس کے منافی ہیں۔\n\n### [اللہ کی توبہ کا \"علیٰ\" اور مخلوق کی توبہ کا \"إلیٰ\" سے مربوط ہونا]\n\nمگر اللہ کی توبہ (رجوع) \"علیٰ\" (پر) کے ساتھ ملی ہوئی ہے، کیونکہ اس کے اسماء میں سے ایک اسم \"العلی\" (بلند) ہے۔ اور مخلوق کی توبہ \"إلیٰ\" (کی طرف) کے ساتھ ملی ہوئی ہے، کیونکہ وہ توبہ کا مطلوب ہے، پس وہ اس کی غایت ہے۔ اور ذات حق (الحق) اور مخلوق توبہ کے \"مِنْ\" (سے) میں جمع ہو گئے ہیں۔ پس وہ اپنی جانوں سے اس کی طرف رجوع ہوئے، اور عارفین (العارفون) اس کی طرف اس (حق) کی جانب سے رجوع ہوئے، اور اللہ کے علماء (علماء باللہ) اس کی طرف اپنے رجوع سے رجوع ہوئے۔ اور جہاں تک عوام کا تعلق ہے، تو وہ مخالفتوں سے موافقت کی طرف رجوع ہوئے۔ اور حق عزوجل ان کی طرف اس کنایہ سے رجوع ہوا کہ \"اگر وہ تمہیں چھوڑ دے\" تاکہ وہ اس کی طرف رجوع کریں، ان کے مقامات کے تقاضے کے مطابق جنہیں ہم نے پہلے تفصیل سے بیان کیا ہے۔ پس حق کا ان پر رجوع کرنا تاکہ وہ اس کی طرف رجوع کریں، اس کے فرمان کی طرح ہے: \"وہ ان سے محبت کرتا ہے اور وہ اس سے محبت کرتے ہیں\" (يُحِبُّهُمْ وَيُحِبُّونَهُ)۔ پس اس کا ان پر رجوع کرنا ازلی محبت کی عنایت کا رجوع ہے تاکہ وہ توبہ کریں۔ جب وہ توبہ کرتے ہیں تو وہ ان سے اس شخص کی محبت کرتا ہے جو اس کی طرف رجوع ہوا، پس یہ جزاء کی محبت ہے۔ اللہ تعالیٰ فرماتا ہے: \"بے شک اللہ توبہ کرنے والوں سے محبت کرتا ہے\" (إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ)۔ پس یہ محبت اس کی طرف سے پہلی محبت نہیں ہے۔ اور بندے کے لیے ایک اور محبت ہے جو اس کے فرمان \"اور وہ اس سے محبت کرتے ہیں\" (وَيُحِبُّونَهُ) سے زائد ہے، اور وہ یہ ہے کہ:\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"اللہ سے محبت کرو اس لیے کہ وہ تمہیں اپنی نعمتوں سے غذا دیتا ہے\" (أحبوا الله لما يغذوكم به من نعمه)۔\n\nپس یہ منعم (نعمت دینے والے) کی جزاء کی محبت ہے اس نعمت کے بدلے جو اس نے انہیں عطا کی۔ پس یہ محبت ان کی طرف سے \"إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ\" کے مقابلے میں جزاء کی محبت کے بدلے جزاء کی محبت ہے۔ اور پہلی محبت اس کی طرف سے ابتداءً عنایت کی محبت ہے، اور ان کی اس سے محبت اس کی جناب کے لیے ایثار کی محبت ہے، نہ کہ انعامات اور نعمتوں کی محبت۔ پس ان کی طرف سے توبہ ایک محبت سے ہوتی ہے جو اس کی طرف سے ایک اور محبت کو جنم دیتی ہے، پس یہ اللہ کی طرف سے ان سے متعلق دو محبتوں کے درمیان ہے۔ جیسے اس کا ان پر توبہ قبول کرنا ان کی طرف سے ایک محبت کے سبب ہوتا ہے جو ان کی طرف سے ایک اور محبت کو جنم دیتی ہے، پس اس کا ان پر توبہ قبول کرنا بھی دو محبتوں کے درمیان ہے۔ اور یہ اس باب سے ہے کہ اللہ نے آدم کو اپنی صورت پر پیدا کیا، یعنی تمام وہ صفات جنہیں الٰہی حضور (الحضرة الإلهية) قبول کرتا ہے، انہیں انسان صغیر اور کبیر قبول کرتا ہے۔\n\n### [توبہ کی تعریف اور اس کے پہلے رکن کا بیان]\n\nاور اس کی تعریف یہ ہے کہ فی الحال لغزش (الزلة) کو ترک کر دینا، جو کچھ گزر چکا اس پر ندامت (الندم) کرنا، اور اس بات کا عزم کرنا کہ جس سے رجوع کیا ہے اس کی طرف دوبارہ نہیں لوٹے گا، اور اس کے بعد اللہ جو چاہے گا کرے گا۔ جہاں تک فی الحال لغزش کو ترک کرنے کا تعلق ہے، تو یہ ضروری ہے، کیونکہ اس وقت کا سلطان حیاء ہے، اور حیاء اپنی سلطانیت کے ذریعے اس شخص کے درمیان حائل ہو جاتا ہے جس میں یہ قائم ہو اور اللہ کی حدود سے تجاوز کرنے کے درمیان۔ اور اللہ تعالیٰ کے اسماء میں سے جو سنت میں مذکور ہے وہ \"الحی\" (حیاء والا) ہے، اور یہ کہ اللہ قیامت کے دن سفید بالوں والے شخص سے حیاء کرے گا۔ اللہ کا بندے سے حیاء کرنا یہ ہے کہ اس نے اسے بتا دیا ہے کہ وہ سبحانہ اس کی طرف توبہ نہیں کرتے جب تک کہ وہ ان پر توبہ قبول نہ کرے۔ پس جب وہ محروم شخص جس پر اللہ نے توبہ قبول نہیں کی، کھڑا ہو گا اور اس نے اللہ کی طرف توبہ نہیں کی، اور وہ قیامت کے دن اس کے حضور کھڑا ہو گا اور اپنے دل میں اس آیت کو یاد کرے گا: \"پھر اس نے ان پر رجوع فرمایا تاکہ وہ توبہ کریں\" (ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا)، تو اللہ اس سے حیاء کرے گا کہ اسے گناہ پر پکڑے، جیسا کہ بندہ اللہ سے حیاء کرتا ہے کہ اللہ کی طرف توبہ کی حالت میں اس سے کوئی لغزش سرزد ہو، حالانکہ وہ اس حالت میں تائب نہیں ہوتا۔ اور ہم نے تائب کے بارے میں بات کی ہے۔ پس حیاء اس کے لیے لازم ہے، اور حیاء فی الحال لغزش کو ترک کرنے کا تقاضا کرتا ہے۔ اور عارف کے لیے فی الحال لغزش کو ترک کرنا یہ ہے کہ وہ اس کی نسبت اپنے رب کی طرف نہ کرے، بلکہ اسے ادب کے طور پر اپنی طرف منسوب کرے، حالانکہ حقیقت میں فعل اللہ کا فعل ہے، اور تقدیر اللہ کی طرف سے ہے، اور اس کے معصیت اور لغزش ہونے کا حکم اللہ کا حکم ہے۔ اس کے باوجود، ادب اسے کہتا ہے کہ اسے اپنی طرف منسوب کر، کیونکہ اس سے مذمت کی زبان متعلق ہے۔ اسی لیے نفس کی تعریف میں کہا گیا ہے: ہر مذموم خیال، اور اصل یہ ہے: \"پس اس نے اسے اس کی بدکاری اور پرہیزگاری کا الہام کیا\" (فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا)۔\n\n### [بعض علماء باللہ کا فی الحال لغزش کو ترک کرنے کا موقف]\n\nاور بعض علماء باللہ (اللہ کے علماء) ایسے ہیں جن کے نزدیک فی الحال لغزش کو ترک کرنا یہ ہے کہ وہ یہ شہود نہ کریں کہ یہ لغزش ہے، حالانکہ یہ اس میں اللہ کے قضاء کا عین ہے، کیونکہ اسی نے حکم دیا کہ یہ لغزش ہے۔ اور چونکہ یہ اللہ کے افعال میں سے ایک فعل ہے، لہٰذا یہ حسن اور جمال کی انتہا پر ہے۔ اور اسے لغزش (زلة) صرف اس لیے کہا گیا کہ یہ \"زل\" (پھسلنا) سے ہے، یعنی یہ اللہ کے افعال میں سے ہونے کی نسبت سے اس میں اللہ کے مذمت کے حکم کی طرف پھسل گئی۔ پس اللہ نے اس میں اس مرتبے سے پھسلنے کا حکم دیا، پس جان لو۔ اور بعض علماء باللہ ایسے ہیں جن کے حق میں لغزش کو ترک کرنا یہ ہے کہ وہ اس فعل میں لغزش کا شہود (الشہود) کریں، اس حیثیت سے کہ وہ لغزش ہے، نہ کہ اس حیثیت سے کہ وہ ایک فعل ہے جس سے مذمت یا تعریف متعلق ہو۔ پس وہ اس کی نسبت بندے کی طرف شہود کرتے ہیں جس کی وجہ سے اسے لغزش کہا گیا، پھر اس کے بعد مذمت آتی ہے۔ اگرچہ ہر الٰہی فعل جو اس باب سے بندے کی طرف منسوب کیا جائے، تو تمام افعال کونیہ (کائنات کے افعال) لغزش ہیں، خواہ وہ محمود ہوں یا مذموم۔\n\n### [بعض لوگوں کا فی الحال لغزش کو ترک کرنے کا موقف]\n\nاور بعض لوگ ایسے ہیں جن کے حق میں فی الحال لغزش کو ترک کرنا یہ ہے کہ وہ اپنے رب کی طرف رجوع میں مشغول ہو جائیں، اور ذلت (لغزش) رب سے رجوع نہ کرنا ہے۔ پس وہ نقیض میں ہے، اور جو حال کے اعتبار سے نقیض میں ہو وہ اپنی نقیض میں نہیں ہو سکتا، لہٰذا بالضرورت اس حال میں اس کے لیے کوئی لغزش نہیں ہو گی۔ اور بعض لوگ ایسے ہیں جن کے حق میں فی الحال لغزش کو ترک کرنا یہ ہے کہ وہ ذات حق (الحق) کے اپنے اوپر رجوع کا شہود کرنے میں مشغول ہو جائیں تاکہ وہ اس کی طرف رجوع کرے، تاکہ وہ اس کے اپنے اوپر رجوع کرنے کے درمیان فرق کر سکے تاکہ وہ اس کی طرف رجوع کرے، اور دوسرے رجوع کے درمیان جو اس کی طرف رجوع کرنے کے لیے نہیں ہے، تاکہ وہ دونوں رجوعوں میں تمیز کر سکے، تاکہ وہ اپنے اوپر اس میزان کو قائم کر سکے جو اس پر اللہ کی طرف سے اس میں واجب ہے، خواہ وہ زبان یا دل سے ذکر کا عمل ہو، یا کسی عضو کا عمل ہو، یا مجموعہ ہو، یا مجموعہ کا کچھ حصہ ہو۔ اور جو شخص اس طرح کی مشغولیت میں ہو، تو اس میں فی الحال کوئی لغزش قائم نہیں ہو سکتی۔ اور بعض لوگ ایسے ہیں جن کے حق میں فی الحال لغزش کو ترک کرنا یہ ہے کہ وہ ذات حق (الحق) کے اپنی طرف رجوع کا شہود کریں، نہ تمیز کرنے کے لیے اور نہ ہی اس کی طرف رجوع کرنے کے لیے، بلکہ الٰہی رجوع کے حقیقی معنی کو جاننے کے لیے کہ وہ اسے کس چیز سے منسوب کرے؟ کیا ذات (الذات) سے یا کسی الٰہی اسم سے؟ اور اس رجوع کا سبب کیا ہے؟ کیا وہ ذاتی ہے یا غیر ذاتی، یا اس کی ذات سے کوئی نسبت نہیں ہے؟ پس یہ اور اس جیسی صورتیں ان چیزوں میں سے ہیں جن کا تقاضا فی الحال لغزش کو ترک کرنا کرتا ہے۔\n\n### [توبہ کا دوسرا رکن اور صوفیاء کا موقف]\n\nاور دوسرا رکن، جو کہ گزرے ہوئے پر ندامت (الندم) ہے، فقہاء کے نزدیک یہ سب سے بڑا رکن ہے، جیسے ان کا قول ہے: \"حج عرفہ ہے\"، کیونکہ یہ سب سے بڑا رکن ہے۔ اور یہاں توبہ کرنے والوں میں بہت سے امور شاخ در شاخ ہو جاتے ہیں۔ \"ندم\" کا میم \"باء\" سے بدلا ہوا ہے، جیسے \"لازم\" اور \"لازب\"۔ اور یہ اس کے گزرے ہوئے پر غم کا اثر ہے جسے \"ندم\" کہا جاتا ہے، اور \"ندب\" اثر کو کہتے ہیں، پس اسے میم سے بدل دیا گیا اور خاص طور پر غم کے اثر کے لیے بنا دیا گیا۔ جہاں تک اس کا گزر جانے سے تعلق ہے، تو ہمارے بعض اصحاب نے اسے وقت کا ضیاع سمجھا ہے، کیونکہ جو گزر گیا وہ واپس نہیں آتا۔ اور ہمارے بعض اصحاب نے اسے وقت کا ساتھی سمجھا ہے، اور اس کا فائدہ یہ ہے کہ وہ اس کے لیے گزرے ہوئے کی تلافی کر دیتا ہے، اور وہ اس فرمان سے دلیل پکڑتے ہیں: \"سوائے اس کے جس نے توبہ کی اور ایمان لایا اور نیک عمل کیا، تو یہ وہ لوگ ہیں جن کی برائیوں کو اللہ نیکیوں سے بدل دے گا\" (إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ)۔ اور ہمارے بعض اصحاب کا خیال ہے کہ وہ ندامت نہیں کرتا مگر اپنے دل میں اپنے اس گناہ کو حاضر کر کے جو اس کے اور اس کے رب عزوجل کے حکم کی اطاعت سے فوت ہونے والی چیز کے درمیان حائل ہوا، اور صفائی کی حالت میں جفا کا ذکر کرنا جفا ہے۔ لہٰذا اسے چاہیے کہ وہ اپنے گناہ کو بھول جائے، اور یہ پہلے کے خلاف ہے، کیونکہ اس نے کہا تھا کہ توبہ یہ ہے کہ تم اپنے گناہ کو نہ بھولو۔ اور بات اس چیز کے بارے میں ہے جو اس سے فوت ہو گئی۔ پس ان میں سے بعض ہر گناہ کے بعد استغفار کے فوت ہونے پر ندامت کرتے ہیں۔ اور بعض وقت کے فوت ہونے پر ندامت کو دیکھتے ہیں۔ اور بعض لوگ مخالفت کے وقت میں اطاعت کے فوت ہونے پر ندامت کو دیکھتے ہیں۔ اور بعض لوگ مخالفت کے وقت میں کبیرہ گناہوں کے فعل کے فوت ہونے پر ندامت کو دیکھتے ہیں، کیونکہ وہ ہر برائی کو اس کے ہم وزن نیکی سے بدلنے کا شہود کرتے ہیں، جیسے ایک جان کے قتل کو ایک جان کے زندہ کرنے سے، اور مذمت کو تعریف سے، اور صدقہ کو غصب، چوری یا خیانت سے۔ اور بعض لوگ معصیت کی حالت میں معصیت کے قضاء میں اللہ کے ساتھ حاضری کے فوت ہونے پر ندامت کو دیکھتے ہیں۔ اور بعض لوگ فعل کی حالت میں اس فعل کو فاعل کی طرف منسوب کرنے کے فوت ہونے پر ندامت کو دیکھتے ہیں۔\n\n### [فعل کی حالت میں حقیقی فاعل کی طرف فعل کی نسبت]\n\nاور یہ ایک عظیم چمکدار نور ہے، جس کا حجاب یہ ہے: \"بھلا جس شخص کے لیے اس کا برا عمل مزین کر دیا گیا ہو اور وہ اسے اچھا سمجھ رہا ہو\" (أَفَمَن زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا)۔ پس اس کے ساتھ برائی کو ملا دیا گیا جب اس نے اسے اس (بندے) کی طرف منسوب کیا، تو اس نے اسے اچھا دیکھا۔ اور ایک وجودی حضور (حضرة وجودية) کا ہونا ضروری ہے جو اس فعل کے محل کے لیے اس حسن کو واجب کرتا ہے جسے اس نے دیکھا، کیونکہ ممکن (مخلوق) عدم کو نہیں دیکھ سکتا۔ اور وہاں کوئی حسن نہیں ہے مگر یہ کہ وہ اللہ کے افعال میں سے ہے۔ اور اسے برا صرف اس کی بندے کی طرف نسبت نے بنایا ہے۔ کیونکہ اس نے فرمایا: \"بھلا جس شخص کے لیے مزین کر دیا گیا\" (أَفَمَن زُيِّنَ لَهُ) اس حیثیت سے کہ وہ اس کے رب کے لیے ہے، \"اس کا برا عمل\" (سُوءُ عَمَلِهِ) اس حیثیت سے کہ وہ اس کا عمل ہے، پس اس نے برائی کمائی، \"تو اس نے اسے اچھا دیکھا\" (فَرَآهُ حَسَنًا) الٰہی زینت کے ذریعے، اور اللہ کی زینت حرام نہیں ہے۔ پس وہ حقیقت میں اللہ کی زینت سے مزین ہے، اور بندے کے نزدیک اس کے مطابق ہے جو اس میں حاضر ہو۔ پس اگر اس میں شیطان کی زینت حاضر ہو تو وہ برائی پر برائی ہے۔ اور اگر اس میں دنیاوی زندگی کی زینت حاضر ہو تو وہ برائی میں غفلت ہے۔ اور اگر اس میں اللہ کی زینت اور بندے کی طرف نسبت حاضر ہو تو وہ برائی میں حسن ہے۔ پس اگر وہ عمل کی طرف برائی کی نسبت کو الٰہی ادب کے طور پر لے، تو وہ حسن میں حسن ہے۔\n\nہر وہ چیز جس میں تم ہو، وہ حسن ہے،\nاس حسن کی پرواہ نہیں جو اس نے پہنا۔\n\nخواہ مخالفت کا لباس ہو یا موافقت کا، کیونکہ اگر تم حکم کی موافقت نہیں کرتے تو تم ارادے کی موافقت کرتے ہو۔ اور اگر برائی اور حسن کے درمیان کوئی مناسبت نہ ہوتی جو ان دونوں کو ایک ہی عین میں جمع کرنے کا تقاضا کرتی جس سے وہ حسن بن جاتا، خاص طور پر تبادلے سے پہلے اس کے فرمان میں: \"اللہ ان کی برائیوں کو نیکیوں سے بدل دے گا\" (يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ)، تو برا عمل اپنے دیکھنے میں حسن سے متصف نہ ہوتا۔ پس وہ اس کے نزدیک حسن سے متصف نہیں ہوا یہاں تک کہ عمل نے وجودی وجوہات میں سے کسی ایک وجہ سے حسن کی صفت کو قبول کر لیا۔ پس وہ خبر کے لحاظ سے برائی ہے، رؤیت کے لحاظ سے حسن ہے۔ پس رؤیت خبر کی تصدیق نہیں کرتی، اور رؤیت کا شاہد زیادہ قطعی ہے۔\n\nلیکن عیاں (مشاہدہ) کے لیے ایک لطیف معنی ہے،\nاسی لیے کلیم (موسیٰ علیہ السلام) نے معاینہ (دیکھنے) کا سوال کیا۔\n\n### [لوگوں کا خبر کی خبر سے تصدیق طلب کرنا]\n\nاور لوگ یہ چاہتے ہیں کہ خبر خبر کی تصدیق کرے، اور خبر رؤیت کی تصدیق کرے۔ اور ہم نے کسی کو نہیں دیکھا جو یہ چاہے کہ خبر رؤیت کی تصدیق کرے، جیسا کہ خبر خبر کی تصدیق کرتی ہے۔ اسی لیے نابینا کی گواہی میں اختلاف کیا گیا اور صاحب بصارت کی گواہی میں اختلاف نہیں کیا گیا۔ اور اسی لیے اس آیت میں فرمایا: \"پس بے شک اللہ جسے چاہتا ہے گمراہ کرتا ہے\" (فَإِنَّ اللَّهَ يُضِلُّ مَن يَشَاءُ)، یعنی اسے اس طرح کے معاملے میں حیران کر دیتا ہے، جہاں اس نے اسے برائی اور حسن سے متصف کیا، تو مکلف نہیں جانتا کہ کون سی چیز غالب ہے۔ اور اس کے قول \"زُيِّنَ\" (مزین کیا گیا) میں فاعل کا نام نہیں لیا گیا، تو وہ نہیں جانتا کہ اسے کس نے مزین کیا، کیا اللہ کی زینت نے، یا شیطان کی زینت نے، یا دنیاوی زندگی کی زینت نے؟ پھر فرمایا: \"اور جسے چاہتا ہے ہدایت دیتا ہے\" (وَيَهْدِي مَن يَشَاءُ)، یعنی اسے اس عمل کے لیے برائی اور حسن کے معنی میں درستگی کی توفیق دیتا ہے کہ اس کا کیا مطلب ہے اور اسے کیسے لینا چاہیے۔ \"پس تمہاری جان ان پر حسرتوں کے ساتھ نہ جائے\" (فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَاتٍ)، یعنی ان پر حسرت کرتے ہوئے غم نہ کرو۔ پس یہ اللہ کی طرف سے سب کی سعادت کی بشارت ہے۔ کیونکہ نبی اکرم صلی اللہ علیہ وسلم اور ان کی انسانیت کے درمیان کوئی چیز حائل نہیں کی گئی، پس وہ ہر حال میں انسان ہیں، اور ان سے حسرتیں زائل نہیں ہوتیں، حالانکہ وہ انسان کامل (الإنسان الکامل) ہیں، مگر یہ کہ وہ انجام کار میں ان کی سعادت پر مطلع ہو جائیں۔ پس وہ عوارض کی پرواہ نہیں کرتے، کیونکہ عمل کے لیے برائی بلاشبہ ایک عارضہ ہے، اور حسن اس کے لیے ذاتی ہے۔ اور ہر عارضہ زائل ہونے والا ہے، اور ہر ذاتی باقی رہنے والا ہے جو جدا نہیں ہوتا۔ \"بے شک اللہ خبردار ہے\" (فَإِنَّ اللَّهَ خَبِيرٌ)، یعنی جاننے والا ہے، \"اس سے جو تم کرتے ہو\" (بِمَا يَصْنَعُونَ) ہر اس فعل سے جو تم میں اور تم سے ظاہر ہوتا ہے۔\n\n### [نیکی کا حسن اور برائی کا حسن]\n\nاور اس رکن میں بھی اس کے قول \"ما فات\" (جو فوت ہو گیا) میں، \"فوت ہو گیا فلاں فلاں سے سخاوت میں\" جب وہ سخاوت میں اس پر بڑھ گیا اور زیادہ ہو گیا۔ پس یہ شخص توبہ میں اس چیز پر ندامت دیکھتا ہے جو فوت ہو گئی، یعنی وہ حسن جو بدلی ہوئی برائی کا ہے، اس حسن سے زیادہ ہے جو نہ بدلی ہوئی نیکی کا ہے۔ کیونکہ نیکی کا حسن بذات خود ہے نہ کہ کسی اور امر سے، اور برائی کا حسن جب اسے بدل دیا جاتا ہے تو اس کے لیے دو حسن ہوتے ہیں: ایک ذاتی حسن، اور وہ حسن جو ہر فعل کے لیے ہے اس حیثیت سے کہ وہ اللہ کے لیے ہے، اور ایک زائد حسن، اور وہ وہ ہے جو ذات حق (الحق) نے اس فعل پر تبادلے کے ذریعے پہنایا، پس اس نے اس برائی کو جو اس میں ظاہر ہوئی تھی، حسن کا لباس پہنا دیا۔ پس برے عمل کا حسن، نیک عمل کے حسن پر اس لباس کی وجہ سے بڑھ گیا جو حق نے اسے پہنایا۔ پس نیکی اس خوبصورت شخص کی طرح ہے جو جمال کی انتہا پر ہے لیکن اس پر کوئی لباس نہیں ہے، اور دوسرا شخص جو اسی طرح جمال کی انتہا پر ہے، اس پر گرد و غبار کی گندگی آ گئی، پھر اسے اس عارضی گندگی سے صاف کیا گیا تو اس کا جمال ظاہر ہو گیا، پھر اسے ایک عمدہ اور قیمتی لباس پہنایا گیا جس سے اس کا جمال اور حسن دوگنا ہو گیا، پس وہ پہلے والے سے حسن میں بڑھ گیا۔\n\n### [ندامت میں آدم کی زبان]\n\nپس توبہ کرنے والا اس چیز پر ندامت کرتا ہے جو فوت ہو گئی، جہاں اس کے تمام افعال اس کے لیے معلوم نہیں تھے کہ وہ اس مرتبے کے ہیں، پس اس کی خوشی متصل ہو جاتی ہے۔ اس آیت میں فرمایا: \"اور اللہ بہت بخشنے والا تھا\" (وَكَانَ اللَّهُ غَفُورًا)، یعنی وہ جس پر چاہے اس طرح کے کشف (الکشف) پر مطلع ہونے کو چھپا دیتا ہے، \"رحیمًا\" (بہت رحم کرنے والا) اس پر رحمت کرتے ہوئے اس معنی کی وجہ سے جسے اس نے اپنے علم میں رکھا اور ہمارے لیے متعین نہیں کیا۔ پس اس طرح کی ندامت جو غم کا اثر ہے، اس کی مانند ہے جو محب اپنے محبوب پر پاتا ہے، وجد، غم، کرب اور اس ندامت کی صورت میں جو اس نے اپنے محبوب کے حق میں کوتاہی کی جسے اس کے لیے مزین کیا گیا تھا، پس وہ اسے اس سے زیادہ عظمت سے ملتا جس سے وہ اسے حرمت اور حشمت سے ملا تھا۔ آدم کی زبان کہتی ہے:\n\nاے میری اطاعت! کاش تو حسرت کے ساتھ ہوتی،\nاور میری معصیت! اگر تو نہ ہوتی تو میں منتخب نہ ہوتا۔\n\nاللہ تعالیٰ نے فرمایا: \"پھر اس کے رب نے اسے چن لیا، پس اس پر رجوع فرمایا اور ہدایت دی\" (ثُمَّ اجْتَبَاهُ رَبُّهُ فَتَابَ عَلَيْهِ وَهَدَىٰ)۔ پس اللہ ہی توبہ کرنے والا تھا نہ کہ آدم۔ اور جو کچھ آدم سے صادر ہوا وہ ان کلمات کی خاصیت کا تقاضا تھا جو اس نے سیکھے تھے، اور ان میں توبہ کا ذکر نہیں ہے، بلکہ وہ محض اعتراف ہے، اور وہ ان کا قول ہے: \"اے ہمارے رب! ہم نے اپنی جانوں پر ظلم کیا\" (رَبَّنَا ظَلَمْنَا أَنفُسَنَا) جہاں انہوں نے انہیں ہلاکت کے سامنے پیش کیا، اور ان کا حق ان پر یہ تھا کہ وہ اپنے آقا کی ممانعت کی تعمیل کر کے ان کی نجات کے لیے کوشش کرتے، \"اور اگر تو ہمیں نہ بخشے گا اور ہم پر رحم نہ کرے گا\" (وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا)، یعنی اگر تو ہمیں مخالفت کے وارد ہونے سے نہ چھپائے گا تاکہ اس کا تسلط ہم پر نہ ہو، اور اس پردے کے ذریعے ہم پر رحم نہ کرے گا، \"تو ہم ضرور خسارہ پانے والوں میں سے ہو جائیں گے\" (لَنَكُونَنَّ مِنَ الْخَاسِرِينَ)، ہماری تجارت نفع بخش نہیں ہو گی۔ پس اس اعتراف نے ان کے لیے یہ نتیجہ پیدا کیا: \"پس اس پر رجوع فرمایا اور ہدایت دی\" (فَتَابَ عَلَيْهِ وَهَدَىٰ)، یعنی اس نے اپنے پردے کے ساتھ ان کی طرف رجوع کیا، پس اس الٰہی پردے نے ان کے اور اس سزا کے درمیان رکاوٹ ڈال دی جس کا تقاضا مخالفت کرتی تھی، اور اس نے اسے اجتباء (چن لینے) کی عنایت میں سے قرار دیا، یعنی جب اس نے اسے چن لیا تو اسے کلمات عطا کیے، اور \"ہدایت دی\" (وَهَدَىٰ)، یعنی اسے اس فعل کی قدر، اور اس جزاء کی قدر جس کا وہ مستحق تھا، اور اس اجتباء کی قدر جس سے اس پر انعام کیا گیا، سب بیان کر دیا۔ اور توبہ کے ساتھ اسے فرمایا: \"اتر جاؤ\"، یہ ولایت اور خلافت کا اترنا تھا، نہ کہ نکالے جانے کا اترنا۔ پس یہ مقام کا اترنا تھا، مرتبے کا اترنا نہیں تھا۔\n\nیہ مقام کا اترنا ہے، مرتبے کا اترنا نہیں،\nتاکہ تم اس کے ذریعے کامیابی اور دائمی بادشاہت پاؤ۔\nجیسا کہ اس شخص نے کہا جس نے اسے سچائی سے بہکایا،\nکیونکہ اس نے اسے ایک درست الٰہ کا کلام سمجھا۔\n\nکیونکہ ابلیس نے اس سے کہا تھا: \"کیا میں تمہیں ہمیشہ رہنے والے درخت اور ایسی بادشاہت پر دلالت کروں جو کبھی پرانی نہ ہو؟\" (هَلْ أَدُلُّكَ عَلَىٰ شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَّا يَبْلَىٰ)۔ پس اس نے اس خطاب کو اپنے رب تعالیٰ کی طرف سے سنا، پس یہ اس کے رب پر حسن ظن کی وجہ سے سچائی تھا۔ پس اس کے لیے اس محل کی وجہ سے عارض ہوا جس میں حق کا خطاب ظاہر ہوا، اور اس محل کی وجہ سے شرمگاہوں کا ظاہر ہونا وراثت میں ملا، اور اس کھانے نے اسے خلد اور ایسی بادشاہت وراثت میں دی جو پرانی نہیں ہوتی، لیکن اس کے اقتدار اور اس کی نیابت اور اس کی اولاد کی نیابت مخلوق میں ظاہر ہونے کے بعد، ایک منصفانہ اور عادلانہ حکم کے طور پر جو انصاف کو بلند کرتا اور اسے قائم کرتا ہے۔ یہ سب کچھ اسے اس کے رب کی توبہ (رجوع) نے وراثت میں دیا۔\n\n### [جو شخص اپنے والد آدم کے طریقے پر چلے وہ اپنے نفس کا ناصح ہے]\n\nاور جان لو کہ اس کے رب کی توبہ (رجوع) یقینی طور پر قبول شدہ ہے، اور بندے کی توبہ امکان کے محل میں ہے، کیونکہ اس میں علتیں ہیں اور اس کی حدود و شرائط کی تکمیل کا علم نہیں ہے، اور نہ ہی اس میں اللہ کے علم کا۔ پس عارفین (العارفون) آدم کی طرح ہیں، وہ اپنے رب سے سوال کرتے ہیں کہ وہ ان پر توبہ قبول کرے، اور توبہ میں ان کا حصہ صرف اعتراف اور سوال ہے، اس کے علاوہ کچھ نہیں۔ یہ اللہ تعالیٰ کے فرمان \"اور تم سب کے سب اللہ کی طرف توبہ کرو\" (وَتُوبُوا إِلَى اللَّهِ جَمِيعًا) کا معنی ہے، یعنی اعتراف اور دعا کی طرف رجوع کرو جیسا کہ تمہارے والد آدم نے کیا۔ کیونکہ عہد کے طریقے سے اللہ کی طرف رجوع کرنا، جبکہ وہ اللہ کے علم میں موجود چیز کو نہیں جانتا، اس میں بڑا خطرہ ہے۔ کیونکہ اگر اس پر مخالفت میں سے کچھ باقی رہ گیا ہو، تو اس عہد کو توڑنا ضروری ہو جائے گا، پس وہ اس فرمان میں شامل ہو جائے گا: \"جو اللہ کے عہد کو اس کے پختہ کرنے کے بعد توڑ دیتے ہیں\" (الَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ)۔ پس آدم علیہ السلام سے زیادہ کامل معرفت (المعرفۃ) والا کوئی نہیں دیکھا گیا، جہاں انہوں نے اعتراف کیا اور دعا کی، اور اللہ سے ایسا عہد نہیں کیا جس میں انہوں نے عزم کیا ہو کہ وہ دوبارہ نہیں لوٹیں گے، جیسا کہ علماء رسوم توبہ کی تعریف میں شرط لگاتے ہیں۔ پس جو شخص اپنے نفس کو نصیحت کرتا ہے وہ آدم کے طریقے پر چلتا ہے۔\n\n### [دوبارہ نہ لوٹنے کا عزم اللہ کے ساتھ سوء ادب ہے]\n\nکیونکہ عزم میں ہر لحاظ سے اللہ کے ساتھ سوء ادب ہے۔ کیونکہ یہ اس بات سے خالی نہیں کہ وہ اللہ کے علم میں یہ جانتا ہو کہ آئندہ اس سے کوئی لغزش نہیں ہو گی یا نہیں۔ اگر وہ یہ جانتا ہے، تو اس علم کے بعد کہ وہ دوبارہ نہیں لوٹے گا، عزم کرنے کا کوئی فائدہ نہیں۔ اور اگر وہ نہیں جانتا اور اس پر اللہ سے عہد کرتا ہے، اور وہ ان لوگوں میں سے ہے جن پر اللہ نے لوٹنے کا فیصلہ کر دیا ہے، تو وہ اللہ کے عہد اور میثاق کو توڑنے والا ہو گا۔ اور اگر اللہ نے اسے بتا دیا ہے کہ وہ لوٹے گا، تو علم کے بعد اس کا عزم کرنا مکابرت (ضد) ہے۔ پس ہر صورت میں آئندہ کے لیے عزم کا کوئی فائدہ نہیں، نہ جاننے والے کے لیے اور نہ نہ جاننے والے کے لیے۔ پس وہ توبہ جو ہم سے طلب کی گئی ہے، وہ صرف اس صورت کی مانند ہے جو آدم علیہ السلام سے صادر ہوئی۔\n\n### [اہل اللہ کے نزدیک توبہ کا معنی]\n\nیہ اہل اللہ کے نزدیک توبہ کا معنی ہے۔ بے شک اللہ ہر آزمائے ہوئے، توبہ کرنے والے سے محبت کرتا ہے، یعنی ہر وہ شخص جسے اللہ ہر سانس میں آزماتا ہے، اور وہ اس میں اللہ کی طرف رجوع کرتا ہے، نہ کہ اس عزم کے ساتھ کہ وہ اس کی طرف دوبارہ نہیں لوٹے گا جس سے اس نے توبہ کی ہے۔ کیونکہ یہ حقیقت میں جہالت ہے۔ کیونکہ جس چیز سے اس نے توبہ کی ہے، اس کی طرف دوبارہ لوٹنا محال ہے۔ اور اگر وہ لوٹتا ہے تو وہ اس کی مثل کی طرف لوٹتا ہے نہ کہ اس کے عین کی طرف، کیونکہ اللہ وجود (الوجود) میں کسی چیز کو دہراتا نہیں ہے۔ پس جو شخص یہ جانتا ہے وہ یہ عزم نہیں کرتا کہ وہ دوبارہ نہیں لوٹے گا۔ اور اہل اللہ جس چیز کو دیکھتے ہیں وہ یہ ہے کہ تائب یہ عزم کرتا ہے کہ وہ اس چیز کو اپنی طرف منسوب کرنے کے لیے دوبارہ نہیں لوٹے گا جو اس کی طرف منسوب نہیں ہے۔ اور اگر وہ اسے اپنی طرف منسوب کر کے لوٹتا ہے، تو اس نے عزم کے وقت جان لیا تھا کہ وہ لوٹنا اللہ کی طرف ہے نہ کہ اس کی طرف۔ پس اصل کی تصحیح کے بعد غفلت اسے نقصان نہیں پہنچاتی۔ اور یہ عمل شروع کرتے وقت نیت کے مقام پر ہے، کیونکہ غفلت عمل میں فساد پیدا نہیں کرتی، اگرچہ وہ عمل کے دوران وہ چیز حاضر نہ کرے جو اس نے شروع کرتے وقت حاضر کی تھی۔ پس عزم کرنے والا بھی اپنے عزم میں اسی طرح ہے۔\n\n### [محققین کی توبہ دنیا اور آخرت میں ختم نہیں ہوتی]\n\nاور جان لو کہ مقام توبہ ان مقامات میں سے ہے جو موت تک ساتھ رہتے ہیں، جب تک کہ وہ تکلیف (شرعی ذمہ داری) کا مخاطب ہے، یعنی مشروع توبہ۔ لیکن محققین (المحققین) کی توبہ دنیا اور آخرت میں ختم نہیں ہوتی۔ اس کی ابتدا ہے لیکن اس کی کوئی انتہا نہیں، مگر یہ کہ اسم \"التواب\" (توبہ قبول کرنے والا) مظہر میں عین ظاہر ہو جائے، تو اس کے احوال میں کوئی ابتدا نہیں اور نہ کوئی انتہا، اگرچہ ہر توبہ کی ایک ابتدا ہوتی ہے۔\n\n### [توبہ کونیہ]\n\nاور توبہ کونیہ (التوبة الکونیة) جماعت کے نزدیک ملکیہ (ملکی) جبروتیہ (جبروتی) ہے، اور یہ ان کا متفقہ محل ہے۔ اور بعض نے اس میں اضافہ کیا کہ یہ ملکوتیہ (ملکوتی) بھی ہے۔ پس جس نے اسے ملکوتیہ نہیں سمجھا، اس نے کہا کہ یہ اپنے صاحب کو آٹھ سو آٹھ مقامات عطا کرتی ہے۔ اور جس نے اسے ملکوتیہ سمجھا، اس نے کہا کہ یہ چار سو تیرہ مقامات عطا کرتی ہے۔ اور واقفین، جو مواقف (مقامات) کے مالک ہیں، جیسے محمد بن عبدالجبار النفری اور ابو یزید البسطامی، نے کہا کہ یہ غیبی ہے اور اس کے آثار حسی ہیں۔ اور یہ تمام معاملات جو عظیم الٰہی مقامات میں شامل ہیں، ان میں کوئی مقام مکرر نہیں ہوتا جیسا کہ اصل میں طے ہو چکا ہے۔ اور اگر تمام مخلوق، فرشتے، انسان، جن، معدنیات، نباتات، حیوانات اور افلاک سب توبہ کریں اور یہ تمام مقامات حاصل کر لیں، تب بھی دو شخص ان میں سے کسی ایک ذوق میں جمع نہیں ہوں گے۔ اور یہ وہ منازل ہیں جن میں بندہ اس وقت اترتا ہے جب وہ اس مقام کو، جو کہ توبہ یا کوئی اور ہے، مضبوطی سے قائم کر لیتا ہے، اور ان میں سے ہر منزل اسے ایسے اسرار اور علوم عطا کرتی ہے جنہیں اللہ کے سوا کوئی نہیں جانتا۔ اور اس مقام کے لیے حجاب اور کشف (الکشف) ہے۔\n\n### [توبہ اعتراف اور دعا ہے، نہ کہ عدم عود کا عزم]\n\nاور جو کچھ ہم نے ذکر کیا ہے کہ توبہ اعتراف اور دعا ہے، نہ کہ دوبارہ نہ لوٹنے کا عزم، اس کی تائید ان الٰہی اخبار سے ہوتی ہے جو ثابت ہیں اور صحیح ہیں کہ بندہ گناہ کرتا ہے اور جانتا ہے کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور گناہ پر پکڑتا ہے، اور اس پر اس نے کوئی اضافہ نہیں کیا، بالکل آدم کی صورت کی طرح۔ پھر وہ گناہ کرتا ہے اور جانتا ہے کہ اس کا ایک رب ہے جو گناہ بخشتا ہے اور گناہ پر پکڑتا ہے۔ تو اللہ اسے تیسری یا چوتھی بار فرماتا ہے: \"جو چاہو کرو، میں نے تمہیں بخش دیا ہے۔\" اور یہ مشروع ہے کہ اللہ نے اس شخص کے حق میں جس کی یہ صفت ہے، گناہ پر مؤاخذہ اٹھا لیا ہے، اس شخص پر جو یہ سمجھتا ہے کہ خطاب اس شخص پر بھی لاگو ہوتا ہے جس میں یہ صفت نہیں ہے۔ لیکن حدیث کا ظاہر یہ ہے کہ اللہ نے اس کے لیے وہ چیز مباح کر دی جو اس صفت کی وجہ سے اس پر حرام تھی، جیسا کہ مضطر کے لیے مردار حلال کر دیا گیا، حالانکہ اضطرار کی صفت قائم ہونے سے پہلے یہ اس شخص پر حرام تھا۔ پھر ہم نے بیان کیا ہے کہ اللہ کے بندوں میں سے بعض ایسے ہیں جنہیں اللہ آئندہ ہونے والے واقعات پر مطلع کر دیتا ہے، تو وہ کیسے اس چیز پر دوبارہ نہ لوٹنے کا عزم کرے گا جس کے بارے میں وہ قطعی طور پر جانتا ہے کہ وہ لوٹے گا؟ اور کوئی ایسی شریعت نہیں آئی جس پر ہم ٹھہریں کہ مشروع توبہ کی تعریف میں آئندہ کے لیے عزم شامل ہے۔ پس توبہ وہی باقی رہتی ہے جو ہم نے آدم علیہ السلام کی حدیث میں طے کی ہے۔ پھر اس کی تائید اللہ تعالیٰ کا یہ فرمان کرتا ہے: \"پھر اس نے ان پر رجوع فرمایا تاکہ وہ توبہ کریں\" (ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا)۔ \"بے شک اللہ ہی بہت توبہ قبول کرنے والا ہے\" (إِنَّ اللَّهَ هُوَ التَّوَّابُ)، یعنی دونوں حالتوں میں، تم نہیں ہو، اس کی طرف اس کا یہ فرمان دیکھتا ہے: \"اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا\" (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ)۔ اور اس کا فرمان: \"پس تم نے انہیں قتل نہیں کیا، بلکہ اللہ نے انہیں قتل کیا\" (فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ)۔ اور اس کا فرمان: \"تم نے کھجور کے جو درخت کاٹے یا انہیں ان کی جڑوں پر کھڑا چھوڑ دیا، تو وہ اللہ کے اذن سے تھا\" (مَا قَطَعْتُم مِّن لِّينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَىٰ أُصُولِهَا فَبِإِذْنِ اللَّهِ)۔\n\n### [الٰہی اذن ہی الٰہی امر ہے]\n\nاور اذن (اجازت) الٰہی امر ہے، اس نے بعض درختوں کو کھڑا رہنے کا حکم دیا تو وہ کھڑے رہے، اور بعض درختوں کو کٹ جانے کا حکم دیا تو وہ کٹ گئے۔ اللہ کے اذن سے، نہ کہ ان کے کاٹنے سے، اور اللہ کے اذن سے، نہ کہ ان کے چھوڑنے سے، باوجود اس کے کہ وہ کاٹنے اور چھوڑنے سے متصف تھے۔ کیونکہ یہ اللہ کے اذن کے منافی نہیں ہے۔ پس اس صورت میں اللہ کا اذن اس درخت کے لیے چیز میں استعداد کی طرح ہے۔ پس درخت کٹنے کے لیے مستعد تھا، تو اس نے کاٹنے والے سے اسے قبول کر لیا۔ پس اس کا فرمان \"تو وہ اللہ کے اذن سے تھا\" (فَبِإِذْنِ اللَّهِ) یعنی درخت کے لیے، اس کے فرمان کی طرح ہے: \"تو وہ میرے اذن سے پرندہ بن جاتا ہے\" (فَتَكُونُ طَيْرًا بِإِذْنِي)۔ پس عیسیٰ علیہ السلام کی طرف سے پھونکنا روح حیوانی کے وجود کے لیے تھا، کیونکہ پھونک، یعنی عیسیٰ علیہ السلام سے نکلنے والی ہوا، عین روح حیوانی تھی، پس وہ اس پرندے کے جسم میں داخل ہوئی اور اس میں سرایت کر گئی، کیونکہ یہ پرندہ اس سانس کے ذریعے زندگی قبول کرنے کی استعداد پر تھا۔ جیسا کہ سامری نے جو کچھ اس میں ڈالا تھا اس سے بچھڑے نے زندگی قبول کر لی۔ پس پرندہ اللہ کے اذن سے اڑا، جیسا کہ سامری کا بچھڑا اللہ کے اذن سے بولا۔ اور اسی لیے فرمایا: \"اور تاکہ وہ فاسقوں کو رسوا کرے\" (وَلِيُخْزِيَ الْفَاسِقِينَ)، جو اس الٰہی اذن کی معرفت سے خارج ہیں جس نے اس درخت کو کاٹا اور دوسرے کو چھوڑ دیا۔\n\n### [کسی چیز کا جواب نتائج اور حال سے دینا دوسروں سے زیادہ مکمل ہے]\n\nاور ہمارے شیوخ کے لیے اس مقام میں تعریفیں ہیں، میں ان میں سے جو میسر ہو گا ذکر کروں گا اور ان کے مقاصد کو اس طریقے کے مطابق بیان کروں گا جس کا تقاضا یہ راستہ کرتا ہے۔ اور میں ہر مقام میں ایسا ہی کروں گا، ان شاء اللہ، اگر ہمیں ان کے لیے اس میں کوئی کلام ملا۔ اس بنیاد پر کہ جب ان سے کسی چیز کی ماہیت کے بارے میں پوچھا جاتا ہے تو وہ ذاتی تعریف (الحد الذاتی) سے جواب نہیں دیتے، بلکہ اس چیز سے جواب دیتے ہیں جو وہ مقام اس شخص میں پیدا کرتا ہے جو اس سے متصف ہوتا ہے۔ پس ان کا جواب عین اس بات پر دلالت کرتا ہے کہ وہ مقام انہیں ذوق اور حال کے طور پر حاصل ہے۔ اور کتنے ہی لوگ ہیں جو اس کی ذاتی تعریف کو جانتے ہیں لیکن ان کے پاس اس کی کوئی خوشبو تک نہیں، بلکہ وہ اس سے دور ہیں، بلکہ وہ سرے سے مومن ہی نہیں ہیں، حالانکہ وہ اس کی ذاتی اور رسمی تعریف جانتے ہیں۔ پس نتائج اور حال کے ذریعے جواب دینا بلا اختلاف زیادہ مکمل ہے۔ کیونکہ مقامات میں کوئی فائدہ نہیں ہے مگر یہ کہ ان کا شخص پر کوئی اثر ہو، کیونکہ وہ اسی لیے مطلوب ہیں نہ کہ اپنی ذات کے لیے۔ اور اللہ ہی ہدایت دینے والا ہے۔\n\n### [سالکین کی منازل میں سے پہلی منزل]\n\nاور ہمارے اصحاب میں اختلاف ہے کہ سالکین (السالکین) کی منازل میں سے پہلی منزل کیا ہے۔ بعض نے کہا: بیداری (الیقظة)، اور بعض نے کہا: تنبیہ (الانتباہ)، اور بعض نے کہا: توبہ (التوبة)۔ اور روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"ندامت توبہ ہے\" (الندم توبة)۔\n\nپس یہ اس کے فرمان کی طرح نکل سکتا ہے: \"حج عرفہ ہے\" (الحج عرفة)۔\n\nاور اگر نبی اکرم صلی اللہ علیہ وسلم یہ فرماتے کہ \"ندامت ہی توبہ ہے\" (الندم التوبة)، تو یہ \"ندامت توبہ ہے\" کے مقابلے میں تعریف (حد) کے زیادہ قریب ہوتا۔ اور اس باب میں توبہ کو صحیح کرنے والی تین شرائط کے بارے میں کلام پہلے گزر چکا ہے۔\n\n### [توبہ کی تین اقسام]\n\nبعض نے کہا، اور وہ ابو علی الدقاق ہیں، کہ توبہ کی تین اقسام ہیں، کیونکہ اس کی ایک ابتدا، ایک وسط اور ایک انتہا ہے۔ پس اس کی ابتدا کو توبہ (التوبة) کہا جاتا ہے، اس کے وسط کو انابت (الإنابة) کہا جاتا ہے، اور اس کی انتہا کو اوبہ (الأوبة) کہا جاتا ہے۔ پس توبہ خوف زدہ شخص کے لیے ہے، انابت اطاعت گزار کے لیے ہے، اور اوبہ الٰہی امر کی رعایت کرنے والے کے لیے ہے۔ وہ اس تقسیم سے اس بات کی طرف اشارہ کرتے ہیں کہ ان کے نزدیک توبہ خاص طور پر مخالفتوں سے رجوع کرنے اور ان حقوق کو ادا کرنے کی قدرت حاصل کرنے سے نکلنے کا نام ہے جو دوسروں کے ذمے ہیں اور جو اس وقت تک زائل نہیں ہوتے جب تک کہ دوسرا اس سے معاف نہ کر دے، یا قصاص نہ ہو جائے، یا جو کچھ وہ واپس کر سکتا ہے وہ واپس نہ کر دے۔ اور رویم نے کہا، جب ان سے توبہ کے بارے میں پوچھا گیا، کہ توبہ سے توبہ کرنا، جیسا کہ ابن العریف نے کہا:\n\nبہت سے لوگوں نے توبہ کی،\nلیکن توبہ سے توبہ صرف میں نے کی۔\n\nاور قوم (صوفیاء) کے توبہ کے بارے میں اقوال بہت زیادہ ہیں جو منذری، قشیری، مطوعی اور عمرو بن عثمان المکی وغیرہ کی مقامات پر لکھی گئی کتابوں میں مذکور ہیں، پس وہاں دیکھ لیا جائے۔",
    "fa": "باب هفتاد و چهارم در توبه\n\n> اعتراف، بازگشت هر محققی است (محقق) *** و به واسطه آن، خدای حق (الحق) سینه‌اش را می‌گشاید.\n> خداوند از مخالف راضی است، همان‌گونه که *** خداوند از موافق امرش راضی است.\n> چه چیز زیادی است که به منال خود برسد؟ *** به ویژه اگر تو سرّ آن را بدانی.\n> از سرچشمه منت او، مخالف به آنچه *** موافق رسیده است، می‌رسد، اگر قدر آن را ندانی.\n\n### تلقین حجت هنگام مخالفت با امر\n\nبدان، خداوند ما و تو را تأیید کند، که خداوند می‌فرماید: «و همگی به سوی خدا توبه کنید ای مؤمنان، باشد که رستگار شوید.» (وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَ الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ) پس بندگانش را به توبه امر کرد، سپس حجت را به آنان تلقین نمود اگر با امر او مخالفت کردند، و فرمود: «سپس بر آنان توبه کرد تا توبه کنند.» (ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا) تا اگر از آنان سؤال شود، بگویند: اگر تو بر ما توبه می‌کردی، ما توبه می‌کردیم. مانند این فرموده خداوند متعال: «چه چیز تو را نسبت به پروردگار کریمت مغرور ساخت؟» (مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ) تا بگوید: کرم تو. پس این از باب تعلیم حجت خصم به خصم اوست تا با آن با او محاجه کند، اگر محبوب باشد. و لفظ «انسان» را با الف و لام و اغرار (فریب) آورد تا شامل همه مردم شود. این امر دلالت می‌کند بر اینکه اراده حق (الحق) نسبت به آنان، سعادت در فرجام است، هرچند آنچه منافی آن است به آنان برسد.\n\n### توبه خداوند همراه با «علی» و توبه خلق همراه با «إلی» است\n\nبا این حال، توبه خداوند با «علی» (بر) همراه است، زیرا یکی از نام‌های او الاسم العلی (اسم علی) است. و توبه خلق با «إلی» (به سوی) همراه است، زیرا او مطلوب توبه است و غایت آن می‌باشد. حق (الحق) و خلق در «مِن» (از) توبه با هم جمع شدند؛ پس آنان از نفس‌های خود به سوی او بازگشتند، و عارفان (العارفون) از او به سوی او بازگشتند، و عالمان به خدا از بازگشت خود به سوی او بازگشتند. اما عامه مردم، از مخالفت‌ها به سوی موافقت بازگشتند. و حق عز و جل از کنایه «اگر شما را خوار کند» به سوی آنان بازگشت تا آنان بر حسب آنچه مقاماتشان اقتضا می‌کند و ما پیش‌تر تفصیل دادیم، به سوی او بازگردند. پس بازگشت حق (الحق) بر آنان برای این است که به سوی او بازگردند، مانند فرموده او: «دوستشان دارد و دوستش دارند.» (يُحِبُّهُمْ وَيُحِبُّونَهُ) پس بازگشت او بر آنان، بازگشت عنایت و محبت ازلی است تا توبه کنند. پس هنگامی که توبه کردند، او آنان را دوست می‌دارد؛ محبتی از نوع کسی که به سوی او بازگشته است، و این حب جزاست. خداوند متعال می‌فرماید: «همانا خداوند توبه‌کنندگان را دوست دارد.» (إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ) این محبت او، محبت اول نیست. و برای بنده محبتی دیگر است که بر فرموده «و دوستش دارند» (وَيُحِبُّونَهُ) افزوده می‌شود، و آن این است که:\n\nپیامبر (صلی الله علیه و سلم) فرمود: «خداوند را دوست بدارید به خاطر نعمت‌هایی که شما را با آن تغذیه می‌کند.» (أحبوا الله لما يغذوكم به من نعمه)\n\nاین محبت، محبت جزای منعم است به خاطر نعمت‌هایی که به آنان داده است. پس این محبت از جانب آنان در مقابل «همانا خداوند توبه‌کنندگان را دوست دارد» (إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ)، محبت جزایی در مقابل محبت جزایی است. و محبت اول، محبت عنایت از جانب او به صورت ابتدایی است، و محبت آنان نسبت به او، محبت ایثار برای آستان اوست، نه محبت نعمت‌ها و بخشش‌ها. پس توبه از جانب آنان از محبتی است که محبتی دیگر از جانب او را نتیجه می‌دهد. بنابراین، توبه میان دو محبتی است که از جانب خدا به آنان تعلق دارد، مانند توبه او بر آنان که از محبتی از جانب آنان، محبتی دیگر از جانب آنان را نتیجه می‌دهد. پس توبه او بر آنان نیز میان دو محبت است. و این از باب «خلق الله آدم على صورته» (خداوند آدم را بر صورت خود آفرید) است، یعنی هر آنچه را که حضرت الهی از صفات می‌پذیرد، انسان صغیر و کبیر نیز می‌پذیرد.\n\n### تعریف توبه و بیان رکن اول آن\n\nو تعریف آن عبارت است از: ترک لغزش در حال، پشیمانی بر آنچه فوت شده، و عزم بر اینکه به آنچه از آن بازگشته است، باز نگردد. و خداوند پس از آن هر چه بخواهد انجام می‌دهد. اما ترک لغزش در حال، ضروری است، زیرا سلطان وقت آن، حیا است، و حیا با سلطنت خود میان کسی که حیا در او قائم است و تجاوز از حدود الهی حائل می‌شود. و از نام‌های خداوند متعال که در سنت ذکر شده، «الحی» (الحی) است، و اینکه خداوند در روز قیامت از ریش‌سفید حیا می‌کند. حیای خداوند از بنده این است که به او اعلام کرده است که او سبحانه به سوی او توبه نمی‌کنند مگر اینکه او بر آنان توبه کند. پس هنگامی که آن خوارشده‌ای که خداوند بر او توبه نکرده است، می‌ایستد و به سوی او توبه نمی‌کند، و در حال ایستادن در برابر او در روز قیامت، این آیه را در نفس خود به یاد می‌آورد: «سپس بر آنان توبه کرد تا توبه کنند.» (ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا) خداوند از او حیا می‌کند که او را به خاطر گناه مؤاخذه کند، همان‌گونه که بنده در حال توبه به سوی خدا حیا می‌کند که از او لغزشی سر بزند در حالی که در این حال است. زیرا او در آن حال توبه‌کننده نیست. و ما درباره توبه‌کننده سخن می‌گوییم. پس حیا برای او لازم است، و حیا مقتضی ترک لغزش در حال است. و ترک لغزش در حال برای توبه‌کننده اگر عارف باشد، این است که نسبت آن را به پروردگارش ترک کند و آن را به نفس خود نسبت دهد، از باب ادب با خدا. در حالی که در نفس‌الامر، فعل، فعل خداست و قدر از خداست، و حکم به معصیت و لغزش بودن آن، حکم خداست. با این حال، ادب به او می‌گوید که آن را به نفس خود نسبت دهد، زیرا زبان مذمت به آن تعلق گرفته است. و به همین دلیل در تعریف نفس گفته شده است: هر خاطر مذمومی. و اصل آن این است: «پس فجور و تقوای آن را به او الهام کرد.» (فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا)\n\n### موضع برخی از عالمان به خدا در مورد ترک لغزش در حال\n\nاز عالمان به خدا کسانی هستند که ترک لغزش در حال نزد آنان این است که شهود نکنند که آن لغزش است، و این عین قضای الهی در آن است، زیرا اوست که حکم کرده است که آن لغزش است. و از آن حیث که فعلی از افعال خداست، در نهایت حسن و جمال است. و تنها از آن رو لغزش نامیده شده که «زلّ» (لغزید) یعنی از نسبت دادن آن به افعال خدا به حکم خدا در مذمت آن، لغزیده است. پس حکم خدا در آن به زلل (لغزش) از این مرتبه است، پس بدان. و از عالمان به خدا کسانی هستند که ترک لغزش در حق آنان این است که لغزش را در آن فعل شهود کنند، از حیث لغزش بودن آن، نه از حیث فعلی که مذمت یا حمد به آن تعلق می‌گیرد. پس نسبت آن را به بنده شهود می‌کند که به واسطه آن لغزش نامیده شده است، سپس مذمت را به دنبال آن می‌آورد. اگرچه هر فعل الهی که از این باب به بنده نسبت داده شود، همه افعال کونی، چه ستوده و چه نکوهیده، لغزش هستند.\n\n### موضع برخی از مردم در مورد ترک لغزش در حال\n\nو از مردم کسانی هستند که ترک لغزش در حال در حق آنان، مشغول شدن به بازگشت به سوی پروردگارشان است، در حالی که لغزش، بازگشت از پروردگارشان است. پس او در نقیض است، و کسی که در حال در نقیض است، در نقیض آن نخواهد بود. پس بالضروره در این حال برای او لغزشی نیست. و از مردم کسانی هستند که ترک لغزش در حال در حق آنان، مشغول شدن به شهود بازگشت حق (الحق) بر اوست تا به سوی او بازگردد، تا میان بازگشت او بر او برای بازگشت به سوی او، و بازگشت دیگری که برای بازگشت به سوی او نیست، فرق بگذارد. تا میان این دو بازگشت تمایز قائل شود و میزان آنچه را که در آن از عمل‌ها بر او واجب است، از ذکر به زبان یا قلب، یا عمل به جارحه، یا مجموع، یا بخشی از مجموع، بر خود اقامه کند. و کسی که در این مرتبه از اشتغال باشد، لغزشی در حال از او سر نمی‌زند. و از مردم کسانی هستند که ترک لغزش در حال در حق آنان این است که بازگشت حق (الحق) به سوی خود را شهود کند، نه برای تمایز و نه برای بازگشت به سوی او، بلکه برای اینکه حقیقت معنای رجوع الهی را بداند که چرا آن را نسبت می‌دهد؟ آیا به ذات یا به اسم الهی؟ و سبب آن رجوع چیست؟ آیا ذاتی است یا غیر ذاتی؟ یا نسبتی به ذات ندارد؟ پس این وجوه و امثال آن، از چیزهایی است که ترک لغزش در حال آن را می‌طلبد.\n\n### رکن دوم توبه و موضع صوفیه نسبت به آن\n\nو اما رکن دوم، یعنی پشیمانی (الندم) بر آنچه فوت شده است، که نزد فقها رکن اعظم است، به منزله فرموده «حج عرفه است» (الحج عرفة) می‌باشد، زیرا رکن اعظم است. و در اینجا امور بسیاری در توبه‌کنندگان منشعب می‌شود. میمِ «ندم» (پشیمانی) از باءِ «لزم» (لازم) و «لازب» (لازب) قلب شده است. و آن اثر اندوه او بر آنچه از دست داده است، «ندم» نامیده می‌شود. و «ندب» (اثر) است، پس به میم قلب شده و مخصوص اثر اندوه قرار داده شده است. اما تعلق آن به فوت شدن: برخی از اصحاب ما بر این رأی هستند که این ضایع کردن وقت است، زیرا آنچه فوت شده، بازگردانده نمی‌شود. و برخی از اصحاب ما بر این رأی هستند که او صاحب وقت است و فایده آن این است که آنچه گذشته است را برای او جبران کند، و به این فرموده استدلال می‌کنند: «مگر کسی که توبه کند و ایمان آورد و عمل صالح انجام دهد، پس خداوند بدی‌های آنان را به نیکی‌ها تبدیل می‌کند.» (إِلَّا مَن تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ) و برخی از اصحاب ما بر این رأی هستند که پشیمان نمی‌شود مگر با حاضر کردن گناهش در نفس خود که میان او و آنچه از طاعت امر پروردگارش فوت شده، حائل گشته است. و ذکر جفا در حال صفا، جفا است. پس شایسته است که گناهش را فراموش کند، و این خلاف رأی اول است که گفت: توبه این است که گناهت را فراموش نکنی. و سخن در مورد چیزی است که از دست داده است. پس برخی از آنان بر آنچه از استغفار در پی هر گناه فوت شده، پشیمان می‌شوند. و برخی از آنان پشیمانی را بر آنچه از وقت فوت شده، می‌بینند. و از مردم کسانی هستند که پشیمانی را بر آنچه از طاعت در وقت مخالفت فوت شده، می‌بینند. و از مردم کسانی هستند که پشیمانی را بر آنچه از انجام گناهان کبیره در وقت مخالفت فوت شده، می‌بینند، زیرا او تبدیل هر بدی را به آنچه با آن از نیکی‌ها موازنه می‌کند، شهود می‌کند، مانند کشتن نفسی با زنده کردن نفسی، و مذمت با ستایش، و صدقه با غصب یا سرقت یا خیانت. و از مردم کسانی هستند که پشیمانی را بر آنچه از حضور با خدا در قضای او به معصیت در حال معصیت فوت شده، می‌بینند. و از مردم کسانی هستند که پشیمانی را بر آنچه از اضافه کردن آن فعل به فاعل در حال فعل فوت شده، می‌بینند.\n\n### اضافه کردن فعل به فاعل حقیقی در حال فعل\n\nو آن نوری عظیم و شعشعانی است که حجاب آن این است: «آیا کسی که بدی عملش برای او زینت داده شده و آن را نیکو می‌بیند [مانند کسی است که هدایت یافته]؟» (أَفَمَن زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا) پس بدی را به آن قرین ساخت هنگامی که آن را به او اضافه کرد، پس آن را نیکو دید. و ناگزیر باید یک حضرت وجودی (حضرة وجودية) باشد که حسن را برای او واجب کرده است که آن را محل فعل دیده است، زیرا عدم را ممکن نمی‌بیند. و در آنجا حسنی نیست مگر اینکه فعلی از افعال خدا باشد. و آنچه آن را بد کرده، تنها اضافه کردن آن به بنده است. زیرا فرمود: «آیا کسی که بدی عملش برای او زینت داده شده» (أَفَمَن زُيِّنَ لَهُ سُوءُ عَمَلِهِ) به واسطه اینکه برای پروردگارش است، «بدی عملش» (سُوءُ عَمَلِهِ) از حیث اینکه عمل اوست، پس بدی را کسب کرده است، «پس آن را نیکو می‌بیند» (فَرَآهُ حَسَنًا) به واسطه زینت الهی. و زینت خدا حرام نیست. پس آن در نفس‌الامر به زینت خدا مزین است. و نزد بنده بر حسب آنچه در او حاضر می‌شود: اگر زینت شیطان در او حاضر شود، بدی بر بدی است. و اگر زینت حیات دنیا در او حاضر شود، غفلت در بدی است. و اگر زینت خدا و اضافه به بنده حاضر شود، حسن در بدی است. پس اگر اضافه بدی به عمل را ادب الهی بگیرد، حسن در حسن است.\n\n> هر چیزی که تو در آن هستی، نیکوست *** زیبایی آنچه پوشیده است، اهمیتی ندارد\n> جامه مخالفت باشد یا موافقت\n\nزیرا اگر امر را موافقت نکنی، اراده را موافقت کرده‌ای. و اگر میان بد و نیک مناسبتی نبود که اقتضای جمع شدن آن دو در یک عین را داشته باشد که به واسطه آن نیکو شود، به ویژه قبل از تبدیل در فرموده: «خداوند بدی‌های آنان را به نیکی‌ها تبدیل می‌کند.» (يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ) و عمل بد به حسن در رؤیت آن متصف نمی‌شد. پس نزد او به حسن متصف نشد مگر اینکه قبل از عمل، صفت حسن را در وجهی از وجوه وجودی پذیرفته باشد. پس آن به خبر، بد است و به رؤیت، نیکو. پس رؤیت، خبر را تصدیق نمی‌کند، و شاهد رؤیت قاطع‌تر است.\n\n> اما برای عیان (مشاهده) معنایی لطیف است *** به همین دلیل کلیم (موسی) مشاهده را طلب کرد\n\n### مردم می‌خواهند که خبر، خبر را تصدیق کند\n\nو مردم می‌خواهند که خبر، خبر را تصدیق کند و خبر، رؤیت را. و ما ندیده‌ایم کسی بخواهد که خبر، رؤیت را تصدیق کند، همان‌گونه که خبر، خبر را تصدیق می‌کند. و به همین دلیل در شهادت نابینا اختلاف شده است و در شهادت صاحب بینایی اختلاف نشده است. و به همین دلیل در آیه فرمود: «پس همانا خداوند هر که را بخواهد گمراه می‌کند» (فَإِنَّ اللَّهَ يُضِلُّ مَن يَشَاءُ) یعنی او را در مانند این امر متحیر می‌سازد، زیرا آن را به بد و نیکو وصف کرده است، پس مکلف نمی‌داند چه چیزی غالب است. و با فرموده «زین» (زینت داده شد) که فاعل آن نام برده نشده است، نمی‌داند چه کسی آن را زینت داده است؟ آیا زینت خداست یا زینت شیطان یا زینت حیات دنیا؟ سپس فرمود: «و هر که را بخواهد هدایت می‌کند» (وَيَهْدِي مَن يَشَاءُ) یعنی او را برای رسیدن به معنای صحیح بدی و نیکی این عمل موفق می‌سازد که معنای آن چیست و چگونه باید آن را بگیرد. «پس جانت به خاطر حسرت بر آنان از دست نرود» (فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرَاتٍ) یعنی به خاطر حسرت بر آنان غمگین مباش. پس این بشارتی از جانب خدا به سعادت همگان است. زیرا آنچه میان پیامبر (صلی الله علیه و سلم) و انسانیت او حائل شده است، او در هر حال انسان است. و حسرت‌ها از او زائل نمی‌شود، در حالی که او انسان کامل (الإنسان الکامل) است، مگر با اطلاع یافتن بر سعادت آنان در فرجام. پس از عوارض باکی ندارد. زیرا بدی برای عمل، بی‌شک عارضی است، و حسن برای آن ذاتی است. و هر عارضی زائل‌شونده است و هر ذاتی باقی است و از بین نمی‌رود. «همانا خداوند آگاه است» (فَإِنَّ اللَّهَ خَبِيرٌ) یعنی داناست از طریق ابتلا «به آنچه انجام می‌دهند» (بِمَا يَصْنَعُونَ) از هر آنچه از افعال در شما و از شما ظاهر می‌شود.\n\n### حسن حسنه و حسن سیئه\n\nو در این رکن نیز در فرموده «ما فات» (آنچه فوت شد)، «فلان بر فلان در جود فوت شد» (فات فلان فلانا جودا) یعنی در جود بر او فزونی گرفت و زیاد شد. پس این شخص پشیمانی در توبه را بر آنچه فوت شده می‌بیند، یعنی آنچه حسن سیئه تبدیل شده بر حسن حسنه تبدیل نشده فزونی یافته است. زیرا حسن حسنه به خودی خود است نه به امر دیگری. و حسن سیئه هنگامی که تبدیل شود، دو حسن دارد: حسن ذاتی، که حسنی است که برای هر فعلی از آن حیث که برای خداست، وجود دارد؛ و حسن زائد، که آنچه حق (الحق) بر این فعل به واسطه تبدیل خلعت کرده است. پس آنچه از بدی در آن ظاهر شده بود را به حسن پوشانده است. پس بدی عمل، بر حسن عمل فزونی یافت به واسطه آنچه حق (الحق) بر آن پوشاند. پس حسنه مانند شخصی زیبا در نهایت جمال است که جامه‌ای بر تن ندارد، و شخصی زیبا مانند او در نهایت جمال است که چرکی از غبار بر او عارض شده است، پس از آن چرک عارضی پاک شده و جمالش آشکار گشته، سپس جامه نیکوی فاخری بر او پوشانده شده که جمال و حسن او با آن مضاعف گشته است. پس بر اولی در حسن فزونی یافته است.\n\n### زبان آدم در پشیمانی\n\nپس توبه‌کننده بر آنچه فوت شده پشیمان می‌شود، زیرا همه افعال او برایش معلوم نبوده که در این مرتبه هستند، پس شادی او متصل می‌شود. در این آیه فرمود: «و خداوند آمرزنده و مهربان بود.» (وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا) یعنی از کسی که بخواهد بر مانند این امر از طریق کشف (الکشف) وقوف یابد، می‌پوشاند. «رحیماً» (مهربان) به خاطر رحمتی که به او دارد، به معنایی که سبحانه برای ما معین نکرده است. پس پشیمانی مانند این، که اثر اندوه است، مانند چیزی است که محب بر محبوب خود از وجد و اندوه و کرب می‌یابد، و پشیمانی بر آنچه در حق محبوبش که برای او زینت داده شده، کوتاهی کرده است، که شایسته بود با احترامی عظیم‌تر از آنچه با او برخورد کرده، با او برخورد کند. زبان آدم می‌گوید:\n\n> ای طاعت من، اگر بودی، با حسرت بودم *** و ای معصیت من، اگر تو نبودی، برگزیده نمی‌شدم\n\nخداوند متعال فرمود: «سپس پروردگارش او را برگزید، پس بر او توبه کرد و هدایت نمود.» (ثُمَّ اجْتَبَاهُ رَبُّهُ فَتَابَ عَلَيْهِ وَهَدَى) پس خداوند توبه‌کننده بود نه آدم. و آنچه از آدم صادر شد، مقتضای خاصیت کلماتی بود که دریافت کرد، و در آن ذکر توبه نیست، بلکه صرفاً اعتراف است، و آن فرموده اوست: «پروردگارا، ما بر خود ستم کردیم» (رَبَّنَا ظَلَمْنَا أَنفُسَنَا) زیرا آنها را در معرض هلاکت قرار دادند، در حالی که حق آنها بر آنان این بود که با امتثال نهی سرورشان در نجات آنها بکوشند. «و اگر ما را نیامرزی و به ما رحم نکنی» (وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا) یعنی اگر ما را از وارد مخالفت نپوشانی تا سلطنت آن بر ما حکم نکند، و با آن پوشش به ما رحم نکنی، «قطعاً از زیانکاران خواهیم بود» (لَنَكُونَنَّ مِنَ الْخَاسِرِينَ) تجارت ما سود نکرده است. پس این اعتراف برای آنان این فرموده را نتیجه داد: «پس بر او توبه کرد و هدایت نمود.» (فَتَابَ عَلَيْهِ وَهَدَى) یعنی با پوشش خود به سوی آنان بازگشت، پس آن پوشش الهی میان آنان و عقوبتی که مخالفت اقتضا می‌کرد، حائل شد. و این را از عنایت اجتباء (برگزیدن) قرار داد، یعنی هنگامی که او را برگزید، کلمات را به او داد. و «هدایت نمود» (وَهَدَى) یعنی قدر آنچه انجام داد و قدر آنچه از جزا مستحق است و قدر آنچه از اجتباء بر او انعام کرده است را برای او بیان کرد. و با توبه به او گفت: «هبوط کن»، هبوط ولایت و استخلاف، نه هبوط طرد. پس آن هبوط مکان است نه هبوط رتبه.\n\n> هبوط مکان است نه هبوط منزلت *** تا با آن به رستگاری و مُلکی جاودانه برسی\n\n«همان‌گونه که کسی که او را فریب داد، به راستی گفت، زیرا او آن را کلامی از خدای تأیید شده دید.»\n\nزیرا ابلیس به او گفت: «آیا تو را بر درخت جاودانگی و مُلکی که کهنه نمی‌شود، راهنمایی کنم؟» (هَلْ أَدُلُّكَ عَلَى شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَّا يَبْلَى) پس آن خطاب را از پروردگار متعال خود شنید، پس به خاطر حسن ظن به پروردگارش، راست بود. پس به خاطر محلی که خطاب حق (الحق) در آن ظاهر شد، برای او عارض شد. و ظهور عورت‌ها را به خاطر محل به ارث برد. و خوردن، جاودانگی و مُلکی را که کهنه نمی‌شود، به ارث برد، اما پس از ظهور سلطنت و نیابت او و نیابت فرزندانش در خلق، حکمی عادلانه و منصفانه که قسط را بالا می‌برد و پایین می‌آورد. همه اینها را توبه پروردگارش به ارث داد.\n\n### کسی که خیرخواه نفس خود است، راه پدرش آدم را در توبه پیموده است\n\nو بدان که توبه پروردگارش قطعاً مورد قبول است، و توبه بنده در محل امکان است، به دلیل علل موجود در آن و عدم علم به استیفای حدود و شروط آن و علم خدا در آن. پس عارفان (العارفون) آدمیان هستند که از پروردگارشان می‌خواهند که بر آنان توبه کند، و بهره آنان از توبه، اعتراف و سؤال است و نه غیر آن. این معنای فرموده خداوند متعال است: «و همگی به سوی خدا توبه کنید» (وَتُوبُوا إِلَى اللَّهِ جَمِيعًا) یعنی به سوی اعتراف و دعا بازگردید، همان‌گونه که پدرتان آدم انجام داد. زیرا بازگشت به سوی خدا از طریق عهد، در حالی که نمی‌داند در علم خدا چه چیزی در مورد اوست، خطر بزرگی دارد. زیرا اگر چیزی از مخالفت بر او باقی مانده باشد، ناگزیر آن عهد نقض می‌شود، و در فرموده «کسانی که عهد خدا را پس از بستن آن می‌شکنند» (الَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ) منتظم می‌شود. پس کسی را کامل‌تر در معرفت (المعرفة) از آدم (علیه السلام) ندید که اعتراف و دعا کرد و با خدا عهدی نبست که در آن عزم کند که باز نگردد، همان‌گونه که علمای رسوم در تعریف توبه شرط می‌کنند. پس کسی که خیرخواه نفس خود است، راه آدم را پیموده است.\n\n### در عزم بر اینکه باز نگردد، سوء ادب با خداست\n\nزیرا در عزم، سوء ادب با خدا از هر جهت وجود دارد. زیرا خالی از این نیست که آیا او به علم خدا در مورد خود عالم است که در آینده از او لغزشی سر نمی‌زند یا نه؟ اگر به آن عالم باشد، پس در عزم بر اینکه باز نگردد، پس از علمش به اینکه باز نمی‌گردد، فایده‌ای نیست. و اگر نداند و با خدا بر آن عهد ببندد، و خداوند بر او قضا کرده باشد که بازگردد، عهد و پیمان خدا را نقض کرده است. و اگر خدا به او اعلام کند که باز می‌گردد، پس عزم او پس از علم به اینکه باز می‌گردد، مکابره است. پس در هر صورت، برای عزم در آینده، نه برای عالم و نه برای غیر عالم، فایده‌ای نیست. پس توبه‌ای که از ما خواسته شده، تنها صورت همان چیزی است که از آدم (علیه السلام) سر زد.\n\n### معنای توبه نزد اهل الله\n\nاین معنای توبه نزد اهل الله است. زیرا خداوند هر مفتنِ تواب (کسی که در هر نفس مورد آزمایش قرار می‌گیرد و باز می‌گردد) را دوست دارد، یعنی هر کسی که خداوند او را در هر نفس آزمایش کند، پس در آن به سوی خدا باز می‌گردد، نه اینکه عزم کند که به آنچه از آن توبه کرده، باز نگردد. زیرا این جهل بر حقیقت است. زیرا بازگشت به عین چیزی که از آن توبه کرده، محال است. و اگر بازگردد، تنها به مثل آن باز می‌گردد نه به عین آن. زیرا خداوند چیزی را در هستی (الوجود) تکرار نمی‌کند. پس کسی که به این عالم است، عزم نمی‌کند که باز نگردد. و آنچه اهل الله به آن نظر دارند این است که توبه‌کننده عزم می‌کند که باز نگردد به اینکه آنچه را که به او تعلق ندارد، به خود نسبت دهد. و اگر با نسبت دادن آن به خود بازگشت، هنگام عزم دانسته است که آن بازگشت به سوی خداست نه به سوی او. پس غفلت پس از تصحیح اصل به او ضرر نمی‌رساند. و این به منزله نیت هنگام شروع در عمل است. زیرا غفلت در عمل فسادی ایجاد نمی‌کند، اگرچه در اثنای عمل آنچه را که هنگام شروع حاضر کرده بود، حاضر نکند. پس عازم در عزم خود نیز چنین است.\n\n### توبه محققان (المحققين) در دنیا و آخرت برداشته نمی‌شود\n\nو بدان که مقام توبه از مقاماتی است که تا هنگام مرگ همراه است، مادامی که مخاطب به تکلیف باشد، یعنی توبه مشروع. اما توبه محققان (المحققين) در دنیا و آخرت برداشته نمی‌شود. پس برای آن آغاز است و پایانی ندارد، مگر اینکه اسم التواب (التواب) در مظهر، عین ظاهر باشد، که در این صورت در احوال او نه آغازی است و نه پایانی، اگرچه هر توبه‌ای آغازی دارد.\n\n### توبه کونی\n\nو توبه کونی نزد جماعت، ملکی و جبروتی است، و این محل اجماع آنان است. و برخی افزوده‌اند که ملکوتى نیز هست. پس کسی که آن را ملکوتى نمی‌داند، گفته است که هشتصد و هشت مقام به صاحبش می‌دهد. و کسی که آن را ملکوتى می‌داند، گفته است که چهارصد و سیزده مقام به او می‌دهد. و واقفان، که ارباب مواقف هستند، مانند محمد بن عبدالجبار نفری و ابویزید بسطامی، گفته‌اند: آن غیبی است و آثارش حسی است. و همه آنچه این معاملات از مقامات الهی بزرگ در بر می‌گیرد، مقامی در آن تکرار نمی‌شود، بر اساس آنچه در اصل مقرر شده است. و اگر همه خلق، از ملک و انس و جن و معدن و نبات و حیوان و فلک، توبه کنند و به همه این مقامات برسند، دو نفر در یک ذوق از آن جمع نمی‌شوند. و اینها منازلی هستند که بنده هنگامی که آن مقام را که توبه یا غیر آن است، محکم کند، در آنها فرود می‌آید، و هر منزلی از آن اسرار و علومی به او می‌دهد که جز خدا کسی نمی‌داند. و برای این مقام حجاب و کشف (الکشف) است.\n\n### توبه اعتراف و دعاست نه عزم بر عدم بازگشت\n\nو از جمله چیزهایی که آنچه را ذکر کردیم تأیید می‌کند که توبه اعتراف و دعاست نه عزم بر اینکه باز نگردد، آن چیزی است که در اخبار الهی ثابت شده و صحیح است که بنده گناهی مرتکب می‌شود و می‌داند که پروردگاری دارد که گناه را می‌آمرزد و به گناه مؤاخذه می‌کند، و بر این چیزی نیفزود، مانند صورت آدم. سپس گناهی مرتکب می‌شود و می‌داند که پروردگاری دارد که گناه را می‌آمرزد و به گناه مؤاخذه می‌کند. پس خداوند در بار سوم یا چهارم به او می‌گوید: هر چه می‌خواهی انجام بده، تو را آمرزیدم. و این مشروع است که خداوند در حق کسی که صفتش چنین است، مؤاخذه به گناه را برداشته است، بر اساس رأی کسی که می‌بیند خطاب بر غیر کسی که این صفت را ندارد نیز جاری است. اما ظاهر حدیث این است که خداوند آنچه را که به خاطر این صفت بر او ممنوع کرده بود، برای او مباح کرده است، همان‌گونه که مردار را برای مضطر حلال کرده بود، در حالی که قبل از اینکه صفت اضطرار در او قائم شود، بر این شخص حرام بود. سپس ما بیان کردیم که از بندگان خدا کسانی هستند که خداوند آنان را بر آنچه در آینده از آنان سر می‌زند، مطلع می‌سازد. پس چگونه عزم کند که به آنچه قطعاً می‌داند باز می‌گردد، باز نگردد؟ و شریعتی وارد نشده است که نزد آن توقف کنیم که از حد توبه مشروع، عزم در آینده باشد. پس توبه باقی نمی‌ماند مگر همان چیزی که در حدیث آدم (علیه السلام) مقرر کردیم. سپس این فرموده خداوند متعال آن را تأیید می‌کند: «سپس بر آنان توبه کرد تا توبه کنند.» (ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا) «همانا خداوند بسیار توبه‌پذیر است.» (إِنَّ اللَّهَ هُوَ التَّوَّابُ) یعنی در هر دو حالت. آنچه شما هستید، به این فرموده نظر دارد: «و هنگامی که پرتاب کردی، تو پرتاب نکردی، بلکه خدا پرتاب کرد.» (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَى) و فرموده او: «پس شما آنان را نکشتید، بلکه خدا آنان را کشت.» (فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ) و فرموده او: «آنچه از درخت خرما بریدید یا آن را بر ریشه‌هایش برپا گذاشتید، به اذن خدا بود.» (مَا قَطَعْتُم مِّن لِّينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَىٰ أُصُولِهَا فَبِإِذْنِ اللَّهِ)\n\n### اذن الهی همان امر الهی است\n\nو اذن (اجازه) الهی همان امر الهی است. به برخی از درختان امر کرد که برپا بمانند، پس برپا ماندند، و به برخی از درختان امر کرد که بریده شوند، پس به اذن خدا بریده شدند نه به بریدن آنان، و به اذن خدا نه به ترک آنان، با وجود اینکه آنان به بریدن و ترک کردن وصف شده‌اند. زیرا این با اذن خدا منافات ندارد. اذن خدا برای آن در این صورت مانند استعداد در شیء است. پس درخت مستعد بریدن بود، پس آن را از برنده پذیرفت. پس فرموده او: «به اذن خدا بود» (فَبِإِذْنِ اللَّهِ) یعنی برای درخت، مانند فرموده او: «پس پرنده‌ای می‌شوی به اذن من.» (فَتَكُونُ طَيْرًا بِإِذْنِي) پس دمیدن از عیسی برای وجود روح حیوانی بود، زیرا دمیدن، یعنی هوای خارج شده از عیسی، عین روح حیوانی بود. پس وارد جسم آن پرنده شد و در آن جریان یافت، زیرا آن پرنده بر استعدادی بود که حیات را با آن نفس می‌پذیرفت، همان‌گونه که گوساله از آنچه سامری در آن انداخت، حیات پذیرفت. پس پرنده به اذن خدا پرواز کرد، همان‌گونه که گوساله سامری به اذن خدا صدا کرد. و به همین دلیل فرمود: «و تا فاسقان را خوار سازد» (وَلِيُخْزِيَ الْفَاسِقِينَ) یعنی کسانی که از معرفت این اذن الهی که این درخت را برید و دیگری را ترک کرد، خارج شدند.\n\n### پاسخ به شیء با نتایج و حال، کامل‌تر از غیر آن است\n\nو برای مشایخ ما در این مقام تعریف‌هایی است که آنچه میسر شود را ذکر می‌کنم و مقاصد آنان را در آن بر اساس آنچه طریق اقتضا می‌کند، بیان می‌نمایم. و ان‌شاءالله در هر مقامی که کلامی از آنان بیابیم، چنین خواهم کرد. با این حال، هنگامی که از ماهیت شیء سؤال می‌شد، با حد ذاتی پاسخ نمی‌دادند، بلکه با آنچه آن مقام در کسی که به آن متصف شده، نتیجه می‌دهد، پاسخ می‌دادند. پس عین پاسخ آنان دلالت می‌کند بر اینکه آن مقام از طریق ذوق و حال برای آنان حاصل است. و چه بسیار عالمی که به حد ذاتی آن عالم است و بویی از آن نبرده، بلکه از آن دور است، بلکه اصلاً مؤمن نیست، در حالی که حد ذاتی و رسمی آن را می‌داند. پس پاسخ با نتایج و حال، بدون اختلاف، کامل‌تر است. زیرا مقامات فایده‌ای ندارند مگر اینکه اثری در شخص داشته باشند، زیرا برای همین مطلوب هستند نه برای خودشان. و خداوند راهنماست.\n\n### اولین منزل از منازل سالکان\n\nو اصحاب ما اختلاف کرده‌اند که اولین منزل از منازل سالکان چیست. برخی گفته‌اند: بیداری (الیقظة). و برخی گفته‌اند: تنبه (الانتباه). و برخی گفته‌اند: توبه. و روایت شده است که رسول خدا (صلی الله علیه و سلم) فرمود: «پشیمانی، توبه است.» (الندم توبة)\n\nپس ممکن است به صورت فرموده او:\n\n«حج عرفه است.» (الحج عرفة)\n\nخارج شود.\n\nو اگر پیامبر (صلی الله علیه و سلم) می‌فرمود: «پشیمانی، التوبه است» (الندم التوبة)، به حد نزدیک‌تر بود تا فرموده او: «پشیمانی، توبه است.» (الندم توبة) و سخن در مورد سه شرط تصحیح‌کننده توبه در این باب پیش‌تر گذشت.\n\n### اقسام سه‌گانه توبه\n\nبرخی از آنان، یعنی ابوعلی دقاق، گفته است: توبه بر سه قسم است، زیرا برای آن آغاز، وسط و غایتی است. پس آغاز آن «توبه» نامیده می‌شود، و وسط آن «انابه» نامیده می‌شود، و غایت آن «اوبه» نامیده می‌شود. پس توبه برای خائف است، و انابه برای مطیع، و اوبه برای مراقب امر الهی. او با این تقسیم‌بندی اشاره می‌کند به اینکه توبه نزد او عبارت است از بازگشت از مخالفت‌ها به طور خاص، و خارج شدن از آنچه می‌تواند از ادای حقوق دیگران که در ذمه اوست و جز با عفو دیگری یا قصاص یا بازگرداندن آنچه می‌تواند بازگرداند، زائل نمی‌شود. و رویم هنگامی که از توبه سؤال شد، گفت: توبه از توبه است، همان‌گونه که ابن عریف گفته است:\n\n> بسیاری از اقوام توبه کردند و *** جز من کسی از توبه توبه نکرد\n\nو مقالات قوم در توبه بسیار است و در کتب مقامات منذری، قشیری، مطوعی، عمرو بن عثمان مکی و دیگران ذکر شده است. پس باید در آنجا نگریست."
  },
  "page_count": 5
}