{
  "id": 249,
  "title": {
    "ar": "الباب التاسع والأربعون ومائتان في الشرب",
    "en": "Chapter Two Hundred and Forty-Ninth, Concerning the Drink.",
    "ur": "باب نمبر دو سو انچاس: شرب (پینے) کے بیان میں",
    "fa": "باب دویست و چهل و نهم در شرب (نوشیدن)"
  },
  "content": {
    "ar": "## «الباب التاسع والأربعون ومائتان في الشرب»\n\n\n> الشرب بين مقام الذوق والري *** مثل القضية بين النشر والطي‏\n\n\n> إن الحقوق التي للحق قائمة *** عليك فاحذر إذا ما كنت في الغي‏\n\n\n> أنت الغني به إذ كان عينكم *** فلا سبيل إلى مطل ولا لي‏\n\n\n> غيلان لم يك مثلي في محبته *** إذا تناظرت العشاق في مي‏\n\n\n> وصل الوفاء وهجر المطل من شيمي *** فإنني حاتمي الأصل من طي‏\nاعلم أيدك الله أن الشرب هو ما تستفيده في النفس الثاني مضافا إلى ما استفدته في نفس الذوق بالغا ما بلغ على مذهب من يرى الري ومن لا يراه‏\n\n\n### [الشرب إما أن يكون عن عطش وإما عن التذاذ]\n\n\nواعلم أن الشرب قد يكون عن عطش وقد يكون عن التذاذ لا عن عطش كشرب أهل الجنة بعد شربهم من الحوض الذي قام لهم مقام الذوق فشربهم من الحوض عن ظمأ ثم لا يظمئون بعد ذلك أبدا فإن أهل الجنة لا يظمئون فيها وهم يشربون فيها شرب شهوة والتذاذ لا شرب ظمأ ولا دفع ألمه‏\n\n\n### [اختلاف الشرب باختلاف المشروب‏]\n\n\nواعلم أن الشرب يختلف باختلاف المشروب فإن كان المشروب نوعا واحدا فإنه يختلف باختلاف أمزجة الشاربين وهو استعدادهم فمن الناس من يكون مشروبه ماء ومنهم من يكون مشروبه لبنا ومنهم من يكون مشروبه خمرا ومنهم من يكون مشروبه عسلا بحسب الصورة التي يتجلى فيها ذلك العلم فإن هذه الأصناف صور علوم مختلفة قد ذكرناها في جزء لنا سميناه مراتب علوم الوهب ودليلنا على ما قلناه إنها علوم رؤيا النبي صلى الله عليه وسلم‏\n\n\nفإنه قال أريت كأني أوتيت بقدح لبن فشربت منه حتى رأيت الري يخرج من أظافري ثم أعطيت فضلي عمر قالوا فما أولته يا رسول الله قال العلم‏\n\n\nفهذا علم تجلى في صورة لبن كذلك تتجلى العلوم في صور المشروبات ولما كانت الجنة دار الرؤية والتجلي وما ذكر الله فيها سوى أربعة أنهار أَنْهارٌ من ماءٍ غَيْرِ آسِنٍ وأَنْهارٌ من لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وأَنْهارٌ من خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وأَنْهارٌ من عَسَلٍ مُصَفًّى علمنا قطعا إن التجلي العلمي لا يقع إلا في أربع صور ماء ولبن وخمر وعسل ولكل تجل صنف مخصوص من الناس وأحوال مخصوصة في الشخص الواحد فمنه ما هو لأصحاب المنابر وهم الرسل ومنه ما هو لأصحاب الأسرة وهم الأنبياء ومنه ما هو لأصحاب الكراسي وهم الورثة الأولياء العارفون ومنه ما هو لأصحاب المراتب وهم المؤمنون وما ثم صنف خامس وكل صنف يفضل بعضه على بعضه كما قال الله في ذلك تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ وقوله فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ فإن الأعمال كانت هنا في زمن التكليف مقسمة على أربع جهات ولذلك لما علم إبليس بهذه الجهات قال ثُمَّ\n\n\nلَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ ولم يذكر بقية الجهات لأنه لم يقترن بها عمل فإنها للتنزل الإلهي والوهب الرباني الرحماني الذي له العزة والمنع والسلطان فالعلوم وإن كثرت فإن هذه الأربعة تجمعها وهي مجال إلهية في منصات ربانية في صور رحمانية وهي في حق قوم مع الأنفاس دائما وهم الذين لا يقولون بالري وفي حق قوم إلى أمد معين عينه لهم قوله تعالى يوم الزور والرؤية ردوهم إلى قصورهم وهم الذين يقولون بالري في هذه المشروبات كلها وفي بعضها والمتنوع في الكل من الناس من يكون مشروبه واحدا مما ذكرناه لا ينتقل عنه أبدا ومنهم من يتنوع في المشروبات وهو الأتم وكان رسول الله صلى الله عليه وسلم يحب مزج الماء باللبن فيشربه ومزج العسل باللبن وما بقي إلا الخمر وليست دار الدنيا بمحل لإباحته في شرع محمد صلى الله عليه وسلم الذي مات عليه فلم يمكن لنا أن نضرب به المثل بالفعل كما ضرب النبي صلى الله عليه وسلم بالفعل بشرب اللبن بالماء وشرب العسل باللبن فشربه رسول الله صلى الله عليه وسلم خالصا وممزوجا بما هو حلال له ولذلك أيضا\n\n\nكان رسول الله صلى الله عليه وسلم يقول في اللبن إذا شربه اللهم بارك لنا فيه وزدنا منه‏\n\n\nلأنه تقوم معه صورة ضرب المثل به في العلم في حديث الرؤيا الصحيح وهو مأمور بطلب الزيادة من العلم بقوله وقُلْ رَبِّ زِدْنِي عِلْماً فكان اللبن مذكرا له بطلب الزيادة منه وكان يقول في سائر الأطعمة اللهم بارك لنا فيه وأطعمنا خيرا منه‏\n\n\nوكان صلى الله عليه وسلم إذا شرب ماء زمزم تضلع منه وكان يحب الحلوى والعسل‏\n\n\nفهذه كلها أعني المشروبات وضعها الله ضرب أمثلة لأصناف علوم تتجلى للعارفين في صور هذه المحسوسات وخص الخمر بالجنة دون الدنيا وقرن به اللذة للشاربين منه ولم يقل ذلك في غيره من المشروبات وذلك لأنه ما في المشروبات من يعطي الطرب والسرور التام والابتهاج إلا شرب الخمر فيلتذ به شاربه وتسري اللذة في أعضائه وتحكم على قواه الظاهرة والباطنة وما في المشروبات من له سلطان وتحكم على العقل سوى الخمر فهو للعلم الإلهي الذوقي الذي تمجه العقول من جهة أفكارها ولا يقبله إلا الايمان كما أن علم العلماء في علم هذا الطريق تهمة لأن علم هذا الطريق له أثر فيها فهو الحاكم المؤثر في غيره من أصناف العلوم ولا يؤثر فيه غيره لقوة سلطانه لأنه مؤثر في العقل والعقل أقوى ما يكون وكذلك يزيل حكم الوهم والوهم‏\nسلطان قوي وليس يزيل حكمه من المشروبات إلا الخمر فلا يقف لقوة سلطانه عقل ولا وهم وأعظم قوة من هاتين في الإنسان ما يكون أ لا ترى إلى السكران يلقي نفسه في المهالك التي يقضي العقل والوهم باجتنابها فحكم العلم المشبه به في العلوم حكمه فلو أبيح في هذه الشريعة مع ما أعطى الله هذه الأمة من الكشف والفتوح والإمداد في العلوم وثبوت القدم فيها لظهرت أسرار الحق على ما هي عليه وبطلت أشياء كثيرة كان الشرع من علم اللبن قد قررها فهذا التجلي في صورة الخمر لا يحصل في الدنيا إلا للامناء فيلتذون به في بواطنهم ولا يظهر عليهم حكمه وهو ما أشار إليه سهل بن عبد الله التستري بقوله إن للربوبية سرا لو ظهر لبطلت النبوة وإن للنبوة سرا لو ظهر لبطل العلم وإن للعلم سرا لو ظهر لبطلت الأحكام فلو وقع التجلي في صورة الخمر وظهر هذا العلم في العموم ولم يكن الإنسان في طبعه ومزاجه على مزاج أهل الجنة لظهرت الأسرار بإظهاره إياها في العالم فادى ظهورها إلى فساد لقوة سلطانه في الالتذاذ والابتهاج والفرح ومغيب حكم العقول عن شاربه ولهذا ضرب الله مثلا فيمن حصل له هذا التجلي في الدنيا ولم يظهر عليه حكمه مثل الأنبياء وأكابر الأولياء كالخضر والمقربين من عباده فخلق بعض الأجسام البشرية هنا على مزاج لا يقبل السكر ليعلم أن ثم لله عبادا حصل لهم هذا التجلي الإلهي في صورة الخمر وهم على استعداد يعطي الكتمان وعدم الإفشاء\n\n\n### [المعاني المجردة عن الخطاب فهو عن تجل‏]\n\n\nواعلم أن من أعطاه الله المعاني مجردة عن الخطاب أو النصوص في الخطاب فهو عن تجليه في صورة الماء غير الآسن وهو العلم الإلهي الذي لا تعلق له بالطبيعة ومن إعطاء الله العلم بأسرار الشرع وأحكامه وعلم حكمة قوله وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ وعرف ميزان الأحكام بعلم الأوقات والأحوال فيحرم في شرع ما يحلل في غيره فذلك من علم تجليه في صورة اللبن أعني الحليب منه الذي لم يتغير طعمه بعقده أو مخضه أو تربيبه ومن أعطاه الله العلم بالكمال والأحوال والجمال فإنه عن تجلى العلم في صورة الخمر ومن أعطاه الله العلم بطريق الوحي والايمان وصفاء الإلهام وعم علمه كل شي‏ء مما يصح أن يعلم حتى يعلم أنه ما لا يصح أن يعلم لا يعلم فلذلك العلم عن التجلي في صورة العسل فإذا كان شربه شيئا من هذه المشروبات أو كلها كان محصلا لما شرب‏\n\n\nكالنبي الذي قال فعلمت علم الأولين والآخرين‏\n\n\nولم يذكر أنه اختص به فلما لم يذكر الاختصاص أبقى الباب غير مغلق لمن أراد الدخول منه إلى نيل هذا المقام فالواجب على كل عاقل أن يتعرض لنفحات الجود الإلهي‏\n\n\nفإن لله نفحات فتعرضوا لها\n\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Forty-Nine: Concerning The Drink (الشرب)\n\nThe Drink (الشرب) is between the station (مقام) of Taste (الذوق) and Satiation (الري),\nLike the matter between Spreading and Folding.\n\nIndeed, the rights belonging to The Real (الحق) are incumbent upon you,\nSo beware if you are in heedlessness (الغي).\n\nYou are independent through Him, since He is your very essence,\nThus, there is no way to delay or evasion.\n\nGhaylan was not like me in his love,\nWhen the passionate lovers debated over wine.\n\nFulfilling promises and abandoning delay are my characteristics,\nFor I am of the origin of Hatim, from [the tribe of] Tayy.\n\nKnow, may Allah aid you, that The Drink (الشرب) is that which you gain in the second spiritual moment, added to whatever degree you gained in the moment of Taste (الذوق), according to the doctrine of those who affirm Satiation (الري) and those who do not.\n\n### [The Drink (الشرب) is either due to Thirst or due to Delight]\n\nKnow that The Drink (الشرب) may be due to thirst or due to delight, not thirst, like the drinking of the people of Paradise after they drink from the Pool (Haud), which stands for them in the place of Taste (الذوق). Their drinking from the Pool is due to thirst, but they will never thirst again after that. The people of Paradise do not thirst therein, and they drink therein for pleasure and delight, not for the quenching of thirst or the removal of its pain.\n\n### [The Variation of The Drink (الشرب) According to the Variation of the Beverage]\n\nKnow that The Drink (الشرب) varies according to the variation of the beverage (المشروب). If the beverage is of one type, it varies according to the temperaments (أمزجة) of the drinkers, which is their preparedness (استعدادهم). Some people have water as their beverage, some have milk, some have wine (خمر), and some have honey, according to the form in which that Knowledge (العلم) manifests itself (يتجلى). These types are forms of different knowledges, which we have mentioned in a treatise we named *The Levels of the Knowledges of Divine Gift* (مراتب علوم الوهب). Our proof for what we have said—that they are knowledges—is the Prophet’s vision (رؤيا النبي صلى الله عليه وسلم).\n\nHe said: \"I was shown as if I was given a cup of milk, and I drank from it until I saw Satiation (الري) emerging from my fingernails. Then I gave the remainder to Umar.\" They asked, \"How did you interpret it, O Messenger of Allah?\" He said, \"Knowledge (العلم).\"\n\nThis is Knowledge (العلم) that manifested in the form of milk. Likewise, knowledges manifest in the forms of beverages. Since Paradise is the Abode of Vision and Theophany (التجلي), and Allah mentioned therein only four rivers: <<أَنْهارٌ من ماءٍ غَيْرِ آسِنٍ وأَنْهارٌ من لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وأَنْهارٌ من خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وأَنْهارٌ من عَسَلٍ مُصَفًّى>> (Rivers of water unpolluted, and rivers of milk whose taste does not change, and rivers of wine, a delight for those who drink, and rivers of purified honey), we know definitively that the scientific Theophany (التجلي العلمي) occurs only in four forms: water, milk, wine, and honey.\n\nEach Theophany (تجل) corresponds to a specific class of people and specific states (أحوال) within the individual person. Some are for the people of the pulpits (المنابر), who are the Messengers (الرسل). Some are for the people of the couches (الأسرة), who are the Prophets (الأنبياء). Some are for the people of the chairs (الكراسي), who are the Gnostic Inheritors (الورثة العارفون) among the Saints (الأولياء). And some are for the people of the ranks (المراتب), who are the believers (المؤمنون). There is no fifth class.\n\nEach class is favored over others, as Allah said concerning this: <<تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ>> (Those Messengers—We favored some of them over others), and His saying: <<فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ>> (We favored some of the Prophets over others).\n\nActions (الأعمال) were divided into four directions here during the time of obligation (التكليف). That is why Iblis, knowing these directions, said: <<ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ>> (Then I will come to them from before them and from behind them and from their right and from their left). He did not mention the remaining directions because no action is associated with them, for they are reserved for the Divine Descent (التنزل الإلهي) and the Lordly, Merciful Gift (الوهب الرباني الرحماني), to Whom belongs Might, Prevention, and Sovereignty.\n\nAlthough knowledges are numerous, these four encompass them. They are Divine fields (مجال إلهية) on Lordly platforms (منصات ربانية) in Merciful forms (صور رحمانية). For some people, this is continuous with every breath, and these are those who do not affirm Satiation (الري). For others, it is for a specific period, defined for them by His saying on the Day of Visitation and Vision: \"Return them to their palaces.\" These are those who affirm Satiation (الري) in all or some of these beverages.\n\nAmong people, some have only one of the mentioned beverages and never move beyond it. Others vary in their beverages, and this is the most complete (الأتم). The Messenger of Allah (peace and blessings be upon him) loved mixing water with milk and drinking it, and mixing honey with milk. Only wine (الخمر) remains, and the worldly abode is not a place for its permissibility in the Law (شرع) of Muhammad (peace and blessings be upon him), upon which he died. Thus, we cannot use it as an example through action, as the Prophet (peace and blessings be upon him) used the drinking of milk with water and honey with milk as examples through action. The Messenger of Allah drank it pure and mixed with what was lawful for him.\n\nFor this reason, the Messenger of Allah (peace and blessings be upon him) used to say when drinking milk: \"O Allah, bless us in it and increase us from it.\" This is because the image used as a metaphor for Knowledge (العلم) in the authentic vision hadith is associated with it, and he was commanded to seek an increase in Knowledge by His saying: <<وقُلْ رَبِّ زِدْنِي عِلْماً>> (And say: 'My Lord, increase me in Knowledge'). Thus, milk reminded him to seek increase from it. For other foods, he would say: \"O Allah, bless us in it and feed us better than it.\"\n\nThe Prophet (peace and blessings be upon him) would drink Zamzam water until he was fully satiated, and he loved sweets and honey.\n\nAll these—meaning the beverages—Allah established as metaphors for types of knowledges that manifest to the Gnostics (العارفين) in the forms of these sensory objects. He specified wine (الخمر) for Paradise, excluding the world, and linked it with delight for those who drink it, which He did not say for the other beverages. This is because among the beverages, nothing grants complete ecstasy (الطرب), perfect joy (السرور التام), and exhilaration (الابتهاج) except the drinking of wine. The drinker delights in it, and the pleasure flows through his limbs, dominating his manifest and hidden faculties. Furthermore, among the beverages, nothing has sovereignty and dominance over the intellect (العقل) except wine.\n\nTherefore, it represents the Divine Gnostic Knowledge (العلم الإلهي الذوقي) that intellects reject through their thoughts, and which is accepted only by faith (الإيمان). Just as the knowledge of scholars is suspect in the science of this Path, because the knowledge of this Path has an effect on it. It is the ruling factor (الحاكم المؤثر) that influences other types of knowledge, while no other knowledge influences it, due to the strength of its sovereignty. This is because it influences the intellect, and the intellect is the strongest thing there is. Likewise, it removes the rule of imagination (الوهم), and imagination is a powerful sovereign. Nothing among the beverages removes its rule except wine. Neither intellect nor imagination can stand against the strength of its sovereignty, and these two are the greatest powers in man.\n\nDo you not see the drunkard throwing himself into perils that the intellect and imagination judge must be avoided? The ruling of the Knowledge (العلم) symbolized by wine is similar in the realm of knowledges. If it had been permitted in this Law (الشريعة), despite the Unveiling (الكشف), Openings (الفتوح), and sustenance (الإمداد) in knowledges that Allah granted this Community, and their firmness therein, the secrets of The Real (أسرار الحق) would have been revealed as they truly are, and many things established by the Law (شرع) derived from the knowledge of milk would have been nullified.\n\nThis Theophany (التجلي) in the form of wine occurs in the world only for the trustworthy (الامناء). They delight in it inwardly, but its ruling does not manifest upon them. This is what Sahl ibn Abd Allah al-Tustari alluded to when he said: \"Indeed, Lordship (الربوبية) has a secret; if it were revealed, Prophethood (النبوة) would be nullified. And Prophethood has a secret; if it were revealed, Knowledge (العلم) would be nullified. And Knowledge has a secret; if it were revealed, the Legal Rulings (الأحكام) would be nullified.\" If the Theophany in the form of wine had occurred and this Knowledge had manifested generally, and the person was not by nature and temperament upon the temperament of the people of Paradise, the secrets would have been revealed by his disclosure of them in the world. The manifestation of these secrets would lead to corruption due to the strength of its sovereignty in delight, exhilaration, joy, and the absence of the rule of intellects over the drinker.\n\nFor this reason, Allah gave an example of those who attained this Divine Theophany (التجلي الإلهي) in the form of wine without its ruling manifesting upon them in the world, such as the Prophets, the great Saints (الأولياء) like Al-Khidr, and His close servants (المقربين). He created some human bodies here upon a temperament that does not accept intoxication, so that it may be known that Allah has servants who attained this Divine Theophany in the form of wine, and they possess a preparedness (استعداد) that grants concealment and non-disclosure.\n\n### [The Meanings Stripped of Discourse are from a Theophany]\n\nKnow that whoever is granted meanings (المعاني) stripped of discourse (الخطاب) or texts within the discourse, this is from His Theophany (تجليه) in the form of unpolluted water (الماء غير الآسن), which is the Divine Knowledge (العلم الإلهي) that has no connection to nature (الطبيعة).\n\nAnd whoever is granted by Allah the knowledge of the secrets of the Law (الشرع) and its rulings, and the knowledge of the wisdom of His saying: <<وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ>> (And We did not send any Messenger except with the language of his people), and knows the balance of rulings through the knowledge of times and states, so that what is lawful in one law is forbidden in another—that is from the knowledge of His Theophany in the form of milk (اللبن), meaning the fresh milk whose taste has not changed due to curdling, churning, or aging.\n\nAnd whoever is granted by Allah the knowledge of perfection (الكمال), states (الأحوال), and beauty (الجمال), that is from the Theophany of Knowledge in the form of wine (الخمر).\n\nAnd whoever is granted by Allah Knowledge (العلم) through the path of Revelation (الوحي), Faith (الإيمان), and the purity of Inspiration (الإلهام), and whose knowledge encompasses everything that is valid to know, until he knows that what is not valid to know is not known—that Knowledge is from the Theophany in the form of honey (العسل).\n\nIf his drinking is from one or all of these beverages, he has attained what he drank, like the Prophet who said: \"So I knew the knowledge of the first and the last.\" He did not mention that it was exclusive to him. Since he did not mention exclusivity, the door remains open for whoever wishes to enter through it to attain this station (مقام).\n\nIt is incumbent upon every rational person to expose himself to the breezes of Divine Generosity (نفحات الجود الإلهي).\n\n\"Indeed, Allah has breezes, so expose yourselves to them.\"\n\n<<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (And Allah speaks The Truth (الحق), and He guides to the Way.)",
    "ur": "باب نمبر دو سو انچاس: شرب (پینے) کے بیان میں\n\nشرب (پینا)، مقامِ ذوق (الذوق) اور سیرابی (الری) کے درمیان ہے،\nجیسے کسی معاملے کا کھولنا اور لپیٹنا۔\n\nبے شک وہ حقوق جو ذات حق (الحق) کے لیے قائم ہیں، وہ تم پر لازم ہیں،\nپس اگر تم گمراہی میں ہو تو ہوشیار رہو۔\n\nتم اس کے ذریعے غنی ہو، کیونکہ وہ تمہاری عین ذات ہے،\nلہٰذا نہ ٹال مٹول کی گنجائش ہے اور نہ ہی انکار کی۔\n\nغیلان محبت میں میری طرح نہیں تھا،\nجب عشاق شرابِ عشق کے بارے میں بحث کرتے ہیں۔\n\nوفاداری کو جوڑنا اور ٹال مٹول کو چھوڑنا میری خصلت ہے،\nکیونکہ میں قبیلہ طے سے حاتمی الاصل ہوں۔\n\nجان لو، اللہ تمہاری تائید کرے، کہ شرب (پینا) وہ ہے جو تم دوسرے نفس میں حاصل کرتے ہو، اس کے علاوہ جو تم نے نفسِ ذوق (الذوق) میں حاصل کیا، خواہ وہ کتنا ہی پہنچا ہو، اس مسلک کے مطابق جو سیرابی (الری) کو مانتا ہے اور اس کے مطابق بھی جو اسے نہیں مانتا۔\n\n### [شرب (پینا) یا تو پیاس کی وجہ سے ہوتا ہے یا لذت کی وجہ سے]\n\nاور جان لو کہ شرب (پینا) کبھی پیاس کی وجہ سے ہوتا ہے اور کبھی لذت کی وجہ سے، نہ کہ پیاس کی وجہ سے۔ جیسے اہل جنت کا حوض سے پینے کے بعد پینا، جو ان کے لیے مقامِ ذوق (الذوق) پر قائم ہوا تھا۔ پس ان کا حوض سے پینا پیاس کی وجہ سے تھا، پھر اس کے بعد وہ کبھی پیاسے نہیں ہوں گے۔ کیونکہ اہل جنت وہاں پیاسے نہیں ہوں گے، اور وہ وہاں شہوت اور لذت کا شرب (پینا) کریں گے، نہ کہ پیاس بجھانے یا اس کے درد کو دور کرنے کے لیے۔\n\n### [مشروب کے اختلاف سے شرب (پینے) کا اختلاف]\n\nاور جان لو کہ شرب (پینا) مشروب کے اختلاف سے مختلف ہوتا ہے۔ اگر مشروب ایک ہی نوعیت کا ہو، تب بھی وہ پینے والوں کے مزاجوں کے اختلاف سے مختلف ہوتا ہے، اور یہی ان کا استعداد ہے۔ پس لوگوں میں سے کچھ کا مشروب پانی ہوتا ہے، کچھ کا دودھ، کچھ کا شراب (خمر)، اور کچھ کا شہد ہوتا ہے، اس صورت کے مطابق جس میں وہ علم ظہور الٰہی (التجلی) کرتا ہے۔ کیونکہ یہ اصناف مختلف علوم کی صورتیں ہیں جن کا ذکر ہم نے اپنے ایک جزء میں کیا ہے جسے ہم نے \"مراتب علوم الوهب\" (عطائی علوم کے مراتب) کا نام دیا ہے۔ اور ہماری اس بات پر دلیل یہ ہے کہ یہ علوم نبی اکرم صلی اللہ علیہ وسلم کے خواب کی رؤیا سے متعلق ہیں۔\n\nکیونکہ آپ صلی اللہ علیہ وسلم نے فرمایا:\n**حدیث:** \"مجھے دکھایا گیا گویا مجھے دودھ کا ایک پیالہ دیا گیا، تو میں نے اس میں سے پیا یہاں تک کہ میں نے سیرابی (الری) کو اپنے ناخنوں سے نکلتے دیکھا۔ پھر میں نے اپنا بچا ہوا عمر کو دے دیا۔ صحابہ نے پوچھا: یا رسول اللہ! آپ نے اس کی کیا تعبیر فرمائی؟ آپ نے فرمایا: علم۔\"\n\nپس یہ علم ہے جو دودھ کی صورت میں ظہور الٰہی (التجلی) ہوا۔ اسی طرح علوم مشروبات کی صورتوں میں ظہور الٰہی (التجلی) کرتے ہیں۔ اور چونکہ جنت رؤیت اور ظہور الٰہی (التجلی) کا گھر ہے، اور اللہ نے وہاں صرف چار نہروں کا ذکر کیا ہے:\n**قرآنی آیت:** أَنْهارٌ من ماءٍ غَيْرِ آسِنٍ (ایسی نہریں جو پانی کی ہیں، جو بدبودار نہیں ہوتا)\n**قرآنی آیت:** وأَنْهارٌ من لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ (اور ایسی نہریں جو دودھ کی ہیں، جس کا ذائقہ نہیں بدلا)\n**قرآنی آیت:** وأَنْهارٌ من خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ (اور ایسی نہریں جو شراب (خمر) کی ہیں، پینے والوں کے لیے لذت ہے)\n**قرآنی آیت:** وأَنْهارٌ من عَسَلٍ مُصَفًّى (اور ایسی نہریں جو صاف کیے ہوئے شہد کی ہیں)\nہمیں قطعی طور پر معلوم ہوا کہ علمی ظہور الٰہی (التجلی) صرف چار صورتوں میں واقع ہوتا ہے: پانی، دودھ، شراب (خمر)، اور شہد۔ اور ہر ظہور الٰہی (التجلی) کے لیے لوگوں کا ایک مخصوص گروہ اور ایک ہی شخص میں مخصوص احوال ہوتے ہیں۔ ان میں سے کچھ منابر والوں کے لیے ہیں، اور وہ رسول ہیں؛ کچھ تختوں والوں کے لیے ہیں، اور وہ انبیاء ہیں؛ کچھ کرسیوں والوں کے لیے ہیں، اور وہ وارث اولیاء عارفین ہیں؛ اور کچھ مراتب والوں کے لیے ہیں، اور وہ مومنین ہیں۔ اور پانچواں کوئی گروہ نہیں ہے۔ اور ہر گروہ دوسرے پر فضیلت رکھتا ہے، جیسا کہ اللہ تعالیٰ نے اس بارے میں فرمایا:\n**قرآنی آیت:** تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ (یہ رسول ہیں، ہم نے ان میں سے بعض کو بعض پر فضیلت دی)\n**قرآنی آیت:** فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ (ہم نے بعض نبیوں کو بعض پر فضیلت دی)\nکیونکہ یہاں (دنیا میں) تکلیف کے زمانے میں اعمال چار جہات پر تقسیم کیے گئے تھے۔ اسی لیے جب ابلیس کو ان جہات کا علم ہوا تو اس نے کہا:\n**قرآنی آیت:** ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ (پھر میں ان کے پاس ان کے آگے سے، ان کے پیچھے سے، ان کے دائیں سے اور ان کے بائیں سے آؤں گا)\nاور اس نے باقی جہات کا ذکر نہیں کیا کیونکہ ان کے ساتھ کوئی عمل وابستہ نہیں ہے۔ وہ جہات تنزلِ الٰہی اور ربانی رحمانی عطیہ کے لیے ہیں، جس کے لیے عزت، ممانعت اور بادشاہت ہے۔ پس اگرچہ علوم بہت ہیں، لیکن یہ چار ان سب کو جمع کرتے ہیں، اور یہ رحمانی صورتوں میں ربانی منصبوں پر الٰہی میدان ہیں۔ یہ بعض لوگوں کے حق میں ہمیشہ سانسوں کے ساتھ رہتے ہیں، اور وہ وہ ہیں جو سیرابی (الری) کے قائل نہیں ہیں۔ اور بعض لوگوں کے حق میں ایک مقررہ مدت تک رہتے ہیں، جس کا تعین اللہ تعالیٰ کے اس قول نے کیا ہے: \"یوم الزور والرؤیۃ ردوهم إلى قصورهم\" (جھوٹ اور رؤیت کے دن، انہیں ان کے محلات کی طرف لوٹا دو)۔ اور یہ وہ لوگ ہیں جو ان تمام مشروبات میں یا ان میں سے بعض میں سیرابی (الری) کے قائل ہیں۔ اور ان لوگوں میں جو ہر چیز میں تنوع رکھتے ہیں، کچھ ایسے ہیں جن کا مشروب صرف ایک ہی ہوتا ہے جو ہم نے ذکر کیا، اور وہ کبھی اس سے نہیں ہٹتے۔ اور کچھ ایسے ہیں جو مشروبات میں تنوع رکھتے ہیں، اور وہ کامل ترین ہیں۔ اور رسول اللہ صلی اللہ علیہ وسلم پانی کو دودھ کے ساتھ ملا کر پینا پسند فرماتے تھے، اور شہد کو دودھ کے ساتھ ملا کر۔ اور صرف شراب (خمر) باقی رہ گئی، اور دنیا اس کی اباحت کا مقام نہیں ہے محمد صلی اللہ علیہ وسلم کی شریعت میں جس پر آپ کی وفات ہوئی، لہٰذا ہمارے لیے ممکن نہ ہوا کہ ہم اس کی مثال عملی طور پر پیش کریں، جیسا کہ نبی صلی اللہ علیہ وسلم نے دودھ کو پانی کے ساتھ پینے اور شہد کو دودھ کے ساتھ پینے کی عملی مثال پیش کی۔ پس رسول اللہ صلی اللہ علیہ وسلم نے اسے خالص بھی پیا اور اس چیز کے ساتھ ملا کر بھی جو آپ کے لیے حلال تھا۔ اور اسی لیے بھی رسول اللہ صلی اللہ علیہ وسلم دودھ پیتے وقت فرماتے تھے:\n**حدیث:** \"اللهم بارك لنا فيه وزدنا منه\" (اے اللہ! ہمارے لیے اس میں برکت دے اور ہمیں اس میں اضافہ فرما)۔\nکیونکہ اس کے ساتھ صحیح رؤیا کی حدیث میں علم میں مثال مارنے کی صورت قائم ہوتی ہے، اور آپ کو علم میں اضافے کی طلب کا حکم دیا گیا ہے، اللہ کے اس قول کے ذریعے:\n**قرآنی آیت:** وقُلْ رَبِّ زِدْنِي عِلْماً (اور کہو: اے میرے رب! میرے علم میں اضافہ فرما)\nپس دودھ آپ کو اس میں اضافے کی طلب یاد دلاتا تھا۔ اور آپ صلی اللہ علیہ وسلم باقی کھانوں کے بارے میں فرماتے تھے:\n**حدیث:** \"اللهم بارك لنا فيه وأطعمنا خيرا منه\" (اے اللہ! ہمارے لیے اس میں برکت دے اور ہمیں اس سے بہتر کھانا کھلا)۔\nاور آپ صلی اللہ علیہ وسلم جب آبِ زمزم پیتے تھے تو خوب سیر ہو کر پیتے تھے، اور آپ کو مٹھائی اور شہد پسند تھا۔\n\nپس یہ سب، یعنی مشروبات، اللہ نے مختلف علوم کی مثالیں قائم کرنے کے لیے رکھے ہیں جو عارفین کے لیے ان محسوسات کی صورتوں میں ظہور الٰہی (التجلی) کرتے ہیں۔ اور اللہ نے شراب (خمر) کو دنیا کے بجائے جنت کے ساتھ خاص کیا، اور اسے پینے والوں کے لیے لذت کے ساتھ جوڑا، اور دوسرے مشروبات کے بارے میں ایسا نہیں فرمایا۔ یہ اس لیے ہے کہ مشروبات میں کوئی ایسی چیز نہیں جو مکمل طرب، سرور اور خوشی دے سوائے شراب (خمر) کے۔ پس اسے پینے والا اس سے لذت حاصل کرتا ہے، اور لذت اس کے اعضاء میں سرایت کر جاتی ہے، اور اس کی ظاہری اور باطنی قوتوں پر حکم چلاتی ہے۔ اور مشروبات میں کوئی ایسی چیز نہیں جو عقل پر بادشاہت اور حکم چلائے سوائے شراب (خمر) کے۔ پس یہ اس الٰہی ذوقی علم کے لیے ہے جسے عقلیں اپنے افکار کی جہت سے رد کرتی ہیں اور اسے صرف ایمان ہی قبول کرتا ہے۔ جیسا کہ اس طریق کے علم میں علماء کا علم ایک تہمت ہے، کیونکہ اس طریق کا علم ان میں اثر رکھتا ہے۔ پس یہ وہ حاکم ہے جو علوم کی دیگر اصناف میں مؤثر ہوتا ہے، اور کوئی دوسرا اس پر اثر انداز نہیں ہوتا، اس کی بادشاہت کی قوت کی وجہ سے، کیونکہ یہ عقل پر مؤثر ہے، اور عقل سب سے زیادہ قوی ہوتی ہے۔ اسی طرح یہ وہم کے حکم کو بھی زائل کر دیتا ہے، اور وہم ایک قوی بادشاہت ہے۔ اور مشروبات میں کوئی چیز اس کے حکم کو زائل نہیں کرتی سوائے شراب (خمر) کے۔ پس اس کی بادشاہت کی قوت کے سامنے نہ عقل ٹھہرتی ہے اور نہ وہم۔ اور انسان میں ان دونوں سے بڑی قوت کیا ہو سکتی ہے؟ کیا تم نہیں دیکھتے کہ نشے میں دھت شخص اپنے آپ کو ان ہلاکتوں میں ڈال دیتا ہے جن سے عقل اور وہم اجتناب کا حکم دیتے ہیں۔ پس علوم میں اس سے مشابہ علم کا حکم بھی یہی ہے۔ اگر یہ شریعت میں حلال کر دی جاتی، اس کشف (الکشف)، فتوحات اور علوم میں امداد کے ساتھ جو اللہ نے اس امت کو عطا کی ہے، اور اس میں قدم کی مضبوطی کے ساتھ، تو ذات حق (الحق) کے اسرار اسی طرح ظاہر ہو جاتے جیسے وہ ہیں، اور بہت سی چیزیں باطل ہو جاتیں جنہیں شریعت نے، جو کہ دودھ کے علم سے ہے، مقرر کیا تھا۔ پس شراب (خمر) کی صورت میں یہ ظہور الٰہی (التجلی) دنیا میں صرف امانت داروں کو حاصل ہوتا ہے، تو وہ اپنے باطن میں اس سے لذت حاصل کرتے ہیں اور اس کا حکم ان پر ظاہر نہیں ہوتا۔ اور یہی وہ بات ہے جس کی طرف سہل بن عبداللہ تستری نے اپنے اس قول میں اشارہ کیا: \"ربوبیت کا ایک راز ہے، اگر وہ ظاہر ہو جائے تو نبوت باطل ہو جائے گی۔ اور نبوت کا ایک راز ہے، اگر وہ ظاہر ہو جائے تو علم باطل ہو جائے گا۔ اور علم کا ایک راز ہے، اگر وہ ظاہر ہو جائے تو احکام باطل ہو جائیں گے۔\" پس اگر شراب (خمر) کی صورت میں ظہور الٰہی (التجلی) واقع ہوتا اور یہ علم عام طور پر ظاہر ہو جاتا، اور انسان اپنی طبیعت اور مزاج میں اہل جنت کے مزاج پر نہ ہوتا، تو اسرار اس کے ذریعے عالم میں ظاہر ہو جاتے، اور ان کا ظاہر ہونا فساد کا باعث بنتا، اس کی لذت، خوشی اور فرحت میں اس کی بادشاہت کی قوت کی وجہ سے، اور اس کے پینے والے سے عقل کے حکم کے غائب ہونے کی وجہ سے۔ اسی لیے اللہ نے ان لوگوں کی مثال بیان کی جنہیں دنیا میں یہ ظہور الٰہی (التجلی) حاصل ہوا اور اس کا حکم ان پر ظاہر نہیں ہوا، جیسے انبیاء اور اکابر اولیاء جیسے خضر اور اس کے مقرب بندے۔ پس یہاں بعض بشری اجسام کو ایسے مزاج پر پیدا کیا گیا جو نشے کو قبول نہیں کرتے، تاکہ یہ معلوم ہو جائے کہ اللہ کے ایسے بندے بھی ہیں جنہیں شراب (خمر) کی صورت میں یہ الٰہی ظہور الٰہی (التجلی) حاصل ہوا، اور وہ ایسے استعداد پر ہیں جو کتمان اور عدمِ افشاء کو عطا کرتا ہے۔\n\n### [وہ معانی جو خطاب سے مجرد ہوں، وہ ظہور الٰہی (التجلی) سے ہیں]\n\nاور جان لو کہ جسے اللہ نے معانی خطاب سے مجرد کر کے عطا کیے، یا خطاب میں نصوص کے ذریعے، تو وہ پانی غیرِ آسن (بدبودار نہ ہونے والے) کی صورت میں اس کے ظہور الٰہی (التجلی) سے ہے، اور وہ الٰہی علم ہے جس کا تعلق طبیعت سے نہیں ہے۔ اور جسے اللہ نے شرع کے اسرار اور احکام کا علم عطا کیا، اور اس کے قول کی حکمت کا علم:\n**قرآنی آیت:** وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ (اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان میں)\nاور جس نے اوقات اور احوال کے علم سے احکام کا میزان پہچانا، پس ایک شریعت میں جو حرام ہے وہ دوسری میں حلال ہو، تو یہ اس علم سے ہے جو دودھ کی صورت میں ظہور الٰہی (التجلی) کرتا ہے، یعنی وہ خالص دودھ جس کا ذائقہ جمنے، مکھن نکالنے یا گاڑھا کرنے سے نہیں بدلا۔ اور جسے اللہ نے کمال، احوال اور جمال کا علم عطا کیا، تو وہ شراب (خمر) کی صورت میں علم کے ظہور الٰہی (التجلی) سے ہے۔ اور جسے اللہ نے وحی، ایمان، اور الہام کی صفائی کے ذریعے علم عطا کیا، اور اس کا علم ہر اس چیز پر محیط ہو گیا جس کا علم صحیح ہے، یہاں تک کہ وہ یہ بھی جان لے کہ جس کا علم صحیح نہیں وہ معلوم نہیں ہو سکتا، تو وہ علم شہد کی صورت میں ظہور الٰہی (التجلی) سے ہے۔ پس جب اس کا شرب (پینا) ان مشروبات میں سے کوئی ایک یا یہ سب ہوں، تو وہ اس چیز کو حاصل کرنے والا ہو گا جو اس نے پیا۔\n\nجیسے وہ نبی جس نے کہا:\n**حدیث:** \"پس میں نے اولین اور آخرین کا علم جان لیا۔\"\n\nاور اس نے یہ ذکر نہیں کیا کہ یہ صرف اس کے ساتھ خاص ہے، پس جب اس نے اختصاص کا ذکر نہیں کیا تو اس نے اس مقام کو حاصل کرنے کے لیے داخل ہونے والے کے لیے دروازہ کھلا رکھا۔ لہٰذا ہر عقل مند پر واجب ہے کہ وہ جودِ الٰہی کی نفحات کے سامنے خود کو پیش کرے۔\n**حدیث:** \"بے شک اللہ کے لیے نفحات ہیں، پس ان کے سامنے خود کو پیش کرو۔\"\n**قرآنی آیت:** والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب دویست و چهل و نهم در شرب (نوشیدن)»\n\nشرب (نوشیدن) میان مقام ذوق و ری (سیرابی) است / مانند قضیه‌ای میان نشر (گسترش) و طی (درهم پیچیدن).\nهمانا حقوقی که برای حق (الحق) بر تو واجب است، پابرجاست / پس اگر در گمراهی (الغي) هستی، برحذر باش.\nتو به او بی‌نیازی، زیرا او عین توست / پس راهی به تأخیر و انکار نیست.\nغیلان در محبتش مانند من نبود / آنگاه که عاشقان در باده (مي) با هم مناظره کردند.\nوفای به عهد و دوری از تأخیر از شیوه‌های من است / زیرا من حاتمی‌اصل و از قبیله طی هستم.\n\nبدان، خداوند تو را تأیید کند، که شرب (نوشیدن) آن چیزی است که در نفس دوم به دست می‌آوری، علاوه بر آنچه در نفس ذوق (چشیدن) به دست آورده‌ای، هر قدر که باشد، بر مذهب کسی که ری (سیرابی) را می‌بیند و کسی که آن را نمی‌بیند.\n\n### [شرب یا از روی عطش است یا از روی التذاذ]\n\nو بدان که شرب (نوشیدن) گاهی از روی عطش است و گاهی از روی التذاذ (لذت بردن) و نه از روی عطش؛ مانند نوشیدن اهل بهشت پس از نوشیدنشان از حوضی که برای آنان مقام ذوق (چشیدن) را داشت. پس نوشیدنشان از حوض از روی تشنگی است و پس از آن هرگز تشنه نمی‌شوند. زیرا اهل بهشت در آنجا تشنه نمی‌شوند و در آنجا از روی شهوت و التذاذ می‌نوشند، نه نوشیدن از روی تشنگی و نه برای دفع درد آن.\n\n### [اختلاف شرب به اختلاف مشروب]\n\nو بدان که شرب (نوشیدن) به اختلاف مشروب (نوشیدنی) متفاوت است. اگر مشروب یک نوع باشد، به اختلاف مزاج‌های نوشندگان که همان استعداد (استعداد) آن‌هاست، متفاوت می‌شود. برخی از مردم مشروبشان آب است، برخی شیر، برخی خمر (شراب) و برخی عسل، بر حسب صورتی که آن علم در آن تجلی (التجلی) می‌یابد. زیرا این اصناف، صور علوم مختلفی هستند که ما آن‌ها را در جزئی از کتابمان به نام «مراتب علوم وهب» ذکر کرده‌ایم. دلیل ما بر این گفته، علوم رؤیای پیامبر (صلی الله علیه و سلم) است.\n\nزیرا ایشان فرمودند: «أريت كأني أوتيت بقدح لبن فشربت منه حتى رأيت الري يخرج من أظافري ثم أعطيت فضلي عمر» (به من نشان داده شد که گویی قدحی شیر به من داده شد و از آن نوشیدم تا جایی که سیرابی (الري) را دیدم که از ناخن‌هایم خارج می‌شود، سپس باقیمانده آن را به عمر دادم). گفتند: ای رسول خدا، آن را به چه تعبیر کردی؟ فرمود: «العلم» (علم).\n\nپس این علم در صورت شیر تجلی (التجلی) یافت. همچنین علوم در صور مشروبات تجلی می‌یابند. و چون بهشت سرای رؤیت و تجلی (التجلی) است و خداوند در آنجا جز چهار نهر ذکر نکرده است: «أَنْهارٌ من ماءٍ غَيْرِ آسِنٍ» (نهرهایی از آب غیر گندیده) و «أَنْهارٌ من لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ» (و نهرهایی از شیر که طعمش دگرگون نشده است) و «أَنْهارٌ من خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ» (و نهرهایی از خمر که برای نوشندگان لذت‌بخش است) و «أَنْهارٌ من عَسَلٍ مُصَفًّى» (و نهرهایی از عسل مصفا)، قطعاً دانستیم که تجلی (التجلی) علمی جز در چهار صورت آب، شیر، خمر و عسل رخ نمی‌دهد. و برای هر تجلی، صنفی مخصوص از مردم و احوال مخصوصی در شخص واحد وجود دارد. بخشی از آن برای صاحبان منبرهاست که همان رسولان هستند، و بخشی برای صاحبان تخت‌هاست که همان انبیا هستند، و بخشی برای صاحبان کرسی‌هاست که همان وارثان، اولیا و عارفان (العارفون) هستند، و بخشی برای صاحبان مراتب است که همان مؤمنان هستند، و صنف پنجمی وجود ندارد. و هر صنفی بر صنف دیگر برتری دارد، چنانکه خداوند در این باره فرمود: «تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ» (آن رسولان را بر برخی دیگر برتری دادیم) و فرمود: «فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ» (برخی از پیامبران را بر برخی دیگر برتری دادیم). زیرا اعمال در اینجا در زمان تکلیف بر چهار جهت تقسیم شده بود. به همین دلیل، هنگامی که ابلیس از این جهات آگاه شد، گفت: «ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ» (سپس از پیش رو و از پشت سر و از راست و از چپشان بر آنان وارد می‌شوم). و بقیه جهات را ذکر نکرد، زیرا عملی به آن‌ها پیوند نخورده است؛ چرا که آن‌ها برای تنزل الهی و موهبت ربانی رحمانی است که عزت و منع و سلطنت از آن اوست. پس علوم، هرچند زیاد باشند، این چهار مورد آن‌ها را در بر می‌گیرد، و آن‌ها میدان‌های الهی در جایگاه‌های ربانی در صور رحمانی هستند. و این‌ها در حق قومی همیشه همراه با نفس‌هاست، و آن‌ها کسانی هستند که قائل به ری (سیرابی) نیستند. و در حق قومی تا مدت معینی است که قول خداوند آن را برایشان تعیین کرده است: «يوم الزور والرؤية ردوهم إلى قصورهم» (روز دروغ و رؤیت، آن‌ها را به قصرهایشان بازگردانید) و آن‌ها کسانی هستند که قائل به ری (سیرابی) در همه این مشروبات یا در برخی از آن‌ها هستند. و از میان مردم، کسانی که در همه این‌ها تنوع دارند، برخی مشروبشان یکی از موارد ذکر شده است و هرگز از آن منتقل نمی‌شوند، و برخی در مشروبات تنوع دارند که او کامل‌تر است. و رسول خدا (صلی الله علیه و سلم) دوست داشت که آب را با شیر مخلوط کند و بنوشد، و عسل را با شیر مخلوط کند. و جز خمر (شراب) باقی نماند، و دار دنیا محل اباحه آن در شریعت محمد (صلی الله علیه و سلم) که بر آن درگذشت، نیست. پس برای ما ممکن نبود که با فعل، برای آن مَثَل بزنیم، چنانکه پیامبر (صلی الله علیه و سلم) با فعل، برای نوشیدن شیر با آب و نوشیدن عسل با شیر مَثَل زد. پس رسول خدا (صلی الله علیه و سلم) آن را خالص و ممزوج با آنچه برایش حلال بود، نوشید. به همین دلیل نیز\n\nرسول خدا (صلی الله علیه و سلم) هنگامی که شیر می‌نوشید، می‌فرمود: «اللهم بارك لنا فيه وزدنا منه» (بار خدایا، برای ما در آن برکت ده و از آن بر ما بیفزا).\n\nزیرا صورت مَثَل زدن به آن در علم، در حدیث رؤیای صحیح، همراه او بود، و او به طلب افزایش علم مأمور بود به فرموده: «وقُلْ رَبِّ زِدْنِي عِلْماً» (و بگو پروردگارا، علم مرا زیاد کن). پس شیر یادآور طلب افزایش از آن بود. و در مورد سایر خوراکی‌ها می‌فرمود: «اللهم بارك لنا فيه وأطعمنا خيرا منه» (بار خدایا، برای ما در آن برکت ده و بهتر از آن به ما بخوران).\n\nو ایشان (صلی الله علیه و سلم) هنگامی که آب زمزم می‌نوشید، خود را سیراب می‌کرد و شیرینی و عسل را دوست می‌داشت.\n\nپس خداوند همه این‌ها، یعنی مشروبات را، برای مَثَل زدن به اصناف علومی قرار داد که برای عارفان (العارفون) در صور این محسوسات تجلی (التجلی) می‌یابند. و خمر (شراب) را به بهشت اختصاص داد نه دنیا، و لذت را برای نوشندگان آن قرین ساخت و این را در مورد سایر مشروبات نگفت. و این بدان سبب است که در میان مشروبات، چیزی که طرب و سرور کامل و ابتهاج (شادمانی) بدهد، جز نوشیدن خمر نیست. پس نوشنده از آن لذت می‌برد و لذت در اعضای او جاری می‌شود و بر قوای ظاهری و باطنی او حکم می‌راند. و در میان مشروبات، چیزی که بر عقل سلطنت و حکم داشته باشد، جز خمر نیست. پس آن (خمر) برای علم الهی ذوقی است که عقول از جهت افکارشان آن را پس می‌زنند و جز ایمان آن را نمی‌پذیرد. همان‌طور که علم علما در علم این طریق، مورد اتهام است، زیرا علم این طریق در آن اثر می‌گذارد. پس او حاکمی است که در سایر اصناف علوم تأثیر می‌گذارد و غیر او در آن تأثیر نمی‌گذارد، به دلیل قدرت سلطنتش؛ زیرا در عقل تأثیرگذار است و عقل قوی‌ترین چیزی است که می‌تواند باشد. همچنین حکم وهم را از بین می‌برد، و وهم سلطانی قوی است، و از میان مشروبات جز خمر حکم آن را از بین نمی‌برد. پس در برابر قدرت سلطنت آن، نه عقل می‌ایستد و نه وهم، و این دو قوی‌ترین نیروهایی هستند که در انسان وجود دارند. آیا نمی‌بینی که مست خود را به مهالکی می‌اندازد که عقل و وهم حکم به اجتناب از آن‌ها می‌دهند؟ پس حکم علمِ تشبیه شده به آن در علوم، همان حکم را دارد. اگر در این شریعت، با وجود کشف (الکشف) و فتوح و امدادی که خداوند در علوم به این امت داده و ثبوت قدم در آن، مباح می‌شد، اسرار حق (الحق) آن‌گونه که هستند، آشکار می‌شد و بسیاری از چیزهایی که شرع از علم شیر مقرر کرده بود، باطل می‌شد. پس این تجلی (التجلی) در صورت خمر در دنیا جز برای امنا (امانت‌داران) حاصل نمی‌شود. پس آن‌ها در باطن خود از آن لذت می‌برند و حکم آن بر آنان ظاهر نمی‌شود. و این همان چیزی است که سهل بن عبدالله تستری به آن اشاره کرده و گفته است: «إن للربوبية سرا لو ظهر لبطلت النبوة وإن للنبوة سرا لو ظهر لبطل العلم وإن للعلم سرا لو ظهر لبطلت الأحكام» (همانا ربوبیت را سری است که اگر آشکار شود، نبوت باطل می‌گردد؛ و نبوت را سری است که اگر آشکار شود، علم باطل می‌گردد؛ و علم را سری است که اگر آشکار شود، احکام باطل می‌گردد). پس اگر تجلی (التجلی) در صورت خمر واقع می‌شد و این علم به صورت عمومی ظاهر می‌گشت و انسان در طبع و مزاج خود بر مزاج اهل بهشت نبود، اسرار با آشکار شدنشان در عالم، ظاهر می‌شد و ظهور آن‌ها به دلیل قدرت سلطنتش در التذاذ و ابتهاج و فرح و غایب شدن حکم عقول از نوشنده آن، به فساد می‌انجامید. به همین دلیل، خداوند برای کسی که این تجلی (التجلی) در دنیا برایش حاصل شده و حکم آن بر او ظاهر نشده است، مانند انبیا و بزرگان اولیا همچون خضر و مقربان از بندگانش، مَثَل زده است. پس برخی از اجسام بشری را در اینجا بر مزاجی آفرید که سُکر (مستی) را نمی‌پذیرد، تا دانسته شود که خداوند بندگانی دارد که این تجلی (التجلی) الهی در صورت خمر برایشان حاصل شده است و آن‌ها بر استعدادی هستند که کتمان و عدم افشا را ایجاب می‌کند.\n\n### [معانی مجرد از خطاب، از تجلی است]\n\nو بدان که هر کس خداوند معانی را مجرد از خطاب یا نصوص در خطاب به او عطا کند، این از تجلی (التجلی) او در صورت آب غیر گندیده است، که همان علم الهی است که تعلقی به طبیعت ندارد. و کسی که خداوند علم به اسرار شرع و احکام آن و علم حکمت قول او را به او عطا کند: «وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ» (و هیچ رسولی را نفرستادیم مگر به زبان قومش) و میزان احکام را با علم به اوقات و احوال بشناسد، به طوری که در شریعتی چیزی حرام شود که در شریعت دیگر حلال است، پس آن از علم تجلی (التجلی) او در صورت شیر است، یعنی شیر خالصی که طعمش با بستن یا زدن یا نگهداری تغییر نکرده است. و کسی که خداوند علم به کمال و احوال و جمال را به او عطا کند، این از تجلی (التجلی) علم در صورت خمر است. و کسی که خداوند علم را از طریق وحی و ایمان و صفای الهام به او عطا کند و علمش همه چیزهایی را که صحیح است دانسته شود، فرا گیرد، تا جایی که بداند آنچه صحیح نیست دانسته شود، دانسته نمی‌شود، پس آن علم از تجلی (التجلی) در صورت عسل است. پس اگر نوشیدن او چیزی از این مشروبات یا همه آن‌ها باشد، آنچه را نوشیده، به دست آورده است.\n\nمانند پیامبری که فرمود: «فعلمت علم الأولين والآخرين» (پس علم اولین و آخرین را دانستم).\n\nو ذکر نکرد که این علم به او اختصاص دارد. پس چون اختصاص را ذکر نکرد، در را برای کسی که بخواهد از آن وارد شود تا به این مقام دست یابد، باز گذاشت. پس بر هر عاقلی واجب است که خود را در معرض نفحات جود الهی قرار دهد.\n\n«فإن لله نفحات فتعرضوا لها» (همانا خداوند را نفحاتی است، پس خود را در معرض آن‌ها قرار دهید).\n\nو خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 3
}