{
  "id": 14,
  "title": {
    "ar": "الباب الرابع عشر في معرفة أسرار الأنبياء أعني أنبياء الأولياء",
    "en": "Chapter Fourteen: Concerning the Knowledge of the Secrets of the Prophets—that is, the Prophets of the Saints.",
    "ur": "چودھواں باب: انبیاء کے اسرار کی معرفت (معرفة) میں، یعنی اولیاء (الأولياء) کے انبیاء۔",
    "fa": "باب چهاردهم در معرفت اسرار انبیا، یعنی انبیای اولیا."
  },
  "content": {
    "ar": "## «الباب الرابع عشر» في معرفة أسرار الأنبياء أعني أنبياء الأولياء\n\n\nوأقطاب الأمم المكملين من آدم عليه السلام إلى محمد صلى الله عليه وسلم وأن القطب واحد منذ خلقه الله لم يمت وأين مسكنه‏\n> أنبياء الأولياء الورثة *** عرف الله بهم من بعثه‏\n\n\n> ثم في روع إمام واحد *** سر هذا الأمر روح نفته‏\n\n\n> ثم لما عقد الله له *** وسرى في خلقه ما نكثا شو تلقته على عزته‏\n\n\n> منة منه قلوب الورثة موضع القطب الذي يسكنه *** ليس يدريه سوى من ورثه‏\n\n\n### [النبي والرسول‏]\n\n\nاعلم أيدك الله أن النبي هو الذي يأتيه الملك بالوحي من عند الله يتضمن ذلك الوحي شريعة يتعبده بها في نفسه فإن بعث بها إلى غيره كان رسولا ويأتيه الملك على حالتين إما ينزل بها على قلبه على اختلاف أحوال في ذلك التنزل وإما على صورة جسدية من خارج يلقى ما جاء به إليه على أذنه فيسمع أو يلقيها على بصره فيبصره فيحصل له من النظر مثل ما يحصل له من السمع سواء وكذلك سائر القوي الحساسة وهذا باب قد أغلق برسول الله صلى الله عليه وسلم فلا سبيل أن يتعبد الله أحدا بشريعة ناسخة لهذه الشريعة المحمدية وإن عيسى عليه السلام إذا نزل ما يحكم إلا بشريعة محمد صلى الله عليه وسلم وهو خاتم الأولياء فإنه من شرف محمد صلى الله عليه وسلم إن ختم الله ولاية أمته والولاية مطلقة بنبي رسول مكرم ختم به مقام الولاية فله يوم القيامة حشر أن يحشر مع الرسل رسولا ويحشر معنا وليا تابعا محمدا صلى الله عليه وسلم كرمه الله تعالى والياس بهذا المقام على سائر الأنبياء\n\n\n### [أنبياء الأولياء]\n\n\nوأما حالة أنبياء الأولياء في هذه الأمة فهو كل شخص أقامه الحق في تجل من تجلياته وأقام له مظهر محمد صلى الله عليه وسلم ومظهر جبريل عليه السلام فأسمعه ذلك المظهر الروحاني خطاب الأحكام المشروعة لمظهر محمد صلى الله عليه وسلم حتى إذا فرغ من خطابه وفزع عن قلب هذا الولي عقل صاحب هذا المشهد جميع ما تضمنه ذلك الخطاب من الأحكام المشروعة الظاهرة في هذه الأمة المحمدية فيأخذها هذا الولي كما أخذها المظهر المحمدي للحضور الذي حصل له في هذه الحضرة مما أمر به ذلك المظهر المحمدي من التبليغ لهذه الأمة فيرد إلى نفسه وقد وعى ما خاطب الروح به مظهر محمد صلى الله عليه وسلم وعلم صحته علم يقين بل عين يقين فأخذ حكم هذا النبي وعمل به على بينة من ربه فرب حديث ضعيف قد ترك العمل به لضعف طريقه من أجل وضاع كان في رواته يكون صحيحا في نفس الأمر ويكون هذا الواضع مما صدق في هذا الحديث ولم يضعه وإنما رده المحدث لعدم الثقة بقوله في نقله وذلك إذا انفرد به ذلك الواضع أو كان مدار الحديث عليه وأما إذا شاركه فيه ثقة سمعه معه قبل ذلك الحديث من طريق ذلك الثقة وهذا ولي قد سمعه من الروح يلقيه على حقيقة محمد صلى الله عليه وسلم كما سمع الصحابة في حديث جبريل عليه السلام مع محمد صلى الله عليه وسلم في الإسلام والايمان والإحسان في تصديقه إياه وإذا سمعه من الروح الملقي فهو فيه مثل الصاحب الذي سمعه من فم رسول الله صلى الله عليه وسلم علما لا يشك فيه بخلاف التابع فإنه يقبله على طريق غلبة الظن لارتفاع التهمة المؤثرة في الصدق ورب حديث يكون صحيحا من طريق رواته يحصل لهذا المكاشف الذي قد عاين هذا المظهر فسأل النبي صلى الله عليه وسلم عن هذا الحديث الصحيح فأنكره وقال له لم أقله ولا حكمت به فيعلم ضعفه فيترك العمل به عن بينة من ربه وإن كان قد عمل به أهل النقل لصحة طريقه وهو في نفس الأمر ليس كذلك وقد ذكر مثل هذا مسلم في صدر كتابه الصحيح وقد يعرف هذا المكاشف من وضع ذلك الحديث الصحيح طريقه في زعمهم إما أن يسمى له أو تقام له صورة الشخص فهؤلاء هم أنبياء الأولياء ولا يتفردون قط بشريعة ولا يكون لهم خطاب بها إلا بتعريف إن هذا هو شرع محمد صلى الله عليه وسلم أو يشاهد المنزل عليه بذلك الحكم في حضرة التمثل الخارج عن ذاته والداخل المعبر عنه بالمبشرات في حق النائم غير إن الولي يشترك مع النبي في إدراك ما تدركه العامة في النوم في حال اليقظة سواء وقد أثبت هذا المقام للأولياء أهل طريقنا وإتيان هذا وهو الفعل بالهمة والعلم من غير معلم من المخلوقين غير الله وهو علم الخضر فإن آتاه الله العلم بهذه الشريعة التي تعبده بها على لسان رسول الله صلى الله عليه وسلم بارتفاع الوسائط أعني الفقهاء وعلماء الرسوم كان من العلم اللدني ولم يكن من أنبياء هذه الأمة فلا يكون من يكون من الأولياء وارث نبي إلا على هذه الحالة الخاصة من مشاهدة الملك عند الإلقاء على حقيقة الرسول فافهم فهؤلاء هم‏\nأنبياء الأولياء وتستوي الجماعة كلها في الدعاء إلى الله على بصيرة كما أمر الله تعالى نبيه صلى الله عليه وسلم أن يقول أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وهم أهل هذا المقام فهم في هذه الأمة مثل الأنبياء في بنى إسرائيل على مرتبة تعبد هارون بشريعة موسى عليهما السلام مع كونه نبيا فإن الله قد شهد بنبوته وصرح بها في القرآن فمثل هؤلاء يحفظون الشريعة الصحيحة التي لا شك فيها على أنفسهم وعلى هذه الأمة ممن اتبعهم فهم أعلم الناس بالشرع غير أن الفقهاء لا يسلمون لهم ذلك وهؤلاء لا يلزمهم إقامة الدليل على صدقهم بل يجب عليهم الكتم لمقامهم ولا يردون على علماء الرسوم فيما ثبت عندهم مع علمهم بأن ذلك خطأ في نفس الأمر فحكمهم حكم المجتهد الذي ليس له أن يحكم في المسألة بغير ما أداه إليه اجتهاده وأعطاه دليله وليس له أن يخطئ المخالف له في حكمه فإن الشارع قد قرر ذلك الحكم في حقه فالأدب يقتضي له أن لا يخطئ ما قرره الشارع حكما ودليله وكشفه يحكم عليه باتباع حكم ما ظهر له وشاهده‏\n\n\n### [حفظة الحكم النبوي وحفظة الحال النبوي‏]\n\n\nورد الخبر عن النبي صلى الله عليه وسلم أن علماء هذه الأمة أنبياء بنى إسرائيل‏\n\n\nيعني المنزلة التي أشرنا إليها فإن أنبياء بنى إسرائيل كانت تحفظ عليهم شرائع رسلهم وتقوم بها فيهم وكذلك علماء هذه الأمة وأئمتها يحفظون عليها أحكام رسولها صلى الله عليه وسلم كعلماء الصحابة ومن نزل عنهم من التابعين وأتباع التابعين كالثوري وابن عيينة وابن سيرين والحسن ومالك وابن أبي رباح وأبي حنيفة ومن نزل عنهم كالشافعي وابن حنبل ومن جرى مجرى هؤلاء إلى هلم جرا في حفظ الأحكام (و طائفة أخرى) من علماء هذه الأمة يحفظون عليها أحوال الرسول صلى الله عليه وسلم وأسرار علومه كعلي وابن عباس وسلمان وأبي هريرة وحذيفة ومن التابعين كالحسن البصري ومالك بن دينار وبنان الحمال وأيوب السختياني ومن نزل عنهم بالزمان كشيبان الراعي وفرج الأسود المعمر والفضيل بن عياض وذي النون المصري ومن نزل عنهم كالجنيد والتستري ومن جرى مجرى هؤلاء من السادة في حفظ الحال النبوي والعلم اللدني والسر الإلهي فأسرار حفظة الحكم موقوفة في الكرسي عند القدمين إذ لم يكن لهم حال نبوي يعطي سرا إلهيا ولا علما لدنيا وأسرار حفاظ الحال النبوي والعلم اللدني من علماء حفاظ الحكم وغيرهم موقوفة عند العرش والعماء ولا موقوفة ومنها ما لها مقام ومنها ما لا مقام لها وذلك مقام لها تتميز به فإن ترك العلامة بين أصحاب العلامات علامة محققة غير محكوم عليها بتقييد وهي أسنى العلامات ولا يكون ذلك إلا للمتمكن الكامل في الورث المحمدي‏\n\n\n### [أقطاب الأمم السابقين‏]\n\n\nوأما أقطاب الأمم المكملين في غير هذه الأمة ممن تقدمنا بالزمان فجماعة ذكرت لي أسماؤهم باللسان العربي لما أشهدتهم ورأيتهم في حضرة برزخية وأنا بمدينة قرطبة في مشهد أقدس فكان منهم المفرق ومداوي الكلوم والبكاء والمرتفع والشفاء والماحق والعاقب والمنحور وشجر الماء وعنصر الحياة والشريد والراجع والصانع والطيار والسالم والخليفة والمقسوم والحي والرامي والواسع والبحر والملصق والهادي والمصلح والباقي فهؤلاء المكملون الذين سموا لنا من آدم عليه السلام إلى زمان محمد صلى الله عليه وسلم‏\n\n\n### [الروح المحمدي ومظاهره في العالم‏]\n\n\nوأما القطب الواحد فهو روح محمد صلى الله عليه وسلم وهو الممد لجميع الأنبياء والرسل سلام الله عليهم أجمعين والأقطاب من حين النش‏ء الإنساني إلى يوم القيامة\n\n\nقيل له صلى الله عليه وسلم متى كنت نبيا فقال صلى الله عليه وسلم وآدم بين الماء والطين‏\n\n\nوكان اسمه مداوي الكلوم فإنه بجراحات الهوى خبير والرأي والدنيا والشيطان والنفس بكل لسان نبوي أو رسالي أو لسان الولاية وكان له نظر إلى موضع ولادة جسمه بمكة وإلى الشام ثم صرف الآن نظره إلى أرض كثيرة الحر واليبس لا يصل إليها أحد من بنى آدم بجسده إلا أنه قد رآها بعض الناس من مكة في مكانه من غير نقلة زويت له الأرض فرآها وقد أخذنا نحن عنه علوما جمة بما خد مختلفة ولهذا الروح المحمدي مظاهر في العالم أكمل مظهره في قطب الزمان وفي الأفراد وفي ختم الولاية المحمدي وختم الولاية العامة الذي هو عيسى عليه السلام وهو المعبر عنه بمسكنه وسأذكر فيما بعد هذا الباب إن شاء الله ما له من كونه مداوي الكلوم من الأسرار وما انتشر عنه من العلوم ثم ظهر هذا السر بعد ظهور حال مداوي الكلوم في شخص آخر اسمه المستسلم للقضاء والقدر ثم انتقل الحكم منه إلى مظهر الحق ثم انتقل من مظهر الحق إلى الهائج ثم انتقل من الهائج إلى شخص يسمى واضع الحكم وأظنه لقمان والله أعلم فإنه كان في زمان داود وما أنا منه‏\nعلى يقين أنه لقمان ثم انتقل من واضع الحكم إلى الكاسب ثم انتقل من الكاسب إلى جامع الحكم وما عرفت لمن انتقل الأمر من بعده وسأذكر في هذا الكتاب إذا جاءت أسماء هؤلاء ما اختصوا به من العلوم ونذكر لكل واحد منهم مسألة إن شاء الله ويجري ذلك على لساني فما أدري ما يفعل الله بي ويكفي هذا القدر من هذا الباب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الثالث عشر\n\n",
    "en": "Chapter Fourteen: Concerning the Knowledge of the Secrets of the Prophets—meaning the Prophets of the Saints (أنبياء الأولياء)—and the Perfected Poles (أقطاب) of the Nations, from Adam (peace be upon him) to Muhammad (may Allah bless him and grant him peace), and that the Pole is one since Allah created him, that he has not died, and where his dwelling place is.\n\nThe Prophets of the Saints, the Inheritors,\nThrough them Allah made known those He sent.\n\nThen, in the heart of a single Imam,\nIs the secret of this matter, a spirit that purified it.\nThen, when Allah established it for him,\nAnd it flowed through His creation, it did not break its covenant,\nBut received it in its might.\nA favor from Him are the hearts of the Inheritors,\nThe dwelling place of the Pole (القطب) where he resides,\nNone knows it save him who inherits it.\n\n### [The Prophet and the Messenger]\n\nKnow, may Allah support you, that the Prophet (النبي) is he to whom the Angel brings revelation (الوحي) from Allah, which includes a Law (شريعة) by which he is obligated to worship in his own person. If he is sent with it to others, he is a Messenger (رسول). The Angel comes to him in two states: either descending upon his heart, with varying conditions in that descent, or in a physical form from outside, delivering what he brought to his ear, so he hears, or delivering it to his sight, so he sees. Thus, he obtains from sight exactly what he obtains from hearing, and likewise for all other sensory faculties. This door has been closed by the Messenger of Allah (may Allah bless him and grant him peace), so there is no way for Allah to obligate anyone with a Law that abrogates this Muhammadan Law (الشريعة المحمدية). Indeed, when Jesus (peace be upon him) descends, he will judge only by the Law of Muhammad (may Allah bless him and grant him peace). He is the Seal of the Saints (خاتم الأولياء), for it is part of the honor of Muhammad (may Allah bless him and grant him peace) that Allah sealed the Sainthood (ولاية) of his community, and absolute Sainthood is sealed by a noble Prophet-Messenger. Thus, on the Day of Resurrection, he will have a gathering where he is resurrected with the Messengers as a Messenger, and he will be resurrected with us as a Saint (ولي), a follower of Muhammad (may Allah bless him and grant him peace). Allah the Exalted honored him and Elias (الياس) above all other Prophets in this station.\n\n### [Prophets of the Saints]\n\nAs for the state of the Prophets of the Saints (أنبياء الأولياء) in this community, it is every person whom The Real (الحق) establishes in a Theophany (تجلي) from His Theophanies, and for whom He establishes the manifestation (مظهر) of Muhammad (may Allah bless him and grant him peace) and the manifestation of Gabriel (peace be upon him). That spiritual manifestation causes him to hear the discourse of the prescribed rulings (الأحكام المشروعة) directed to the Muhammadan manifestation. When the discourse is finished and the heart of this Saint (الولي) is relieved, the possessor of this witnessing (المشهد) comprehends all the prescribed rulings contained in that discourse, which are manifest in this Muhammadan community. This Saint takes them just as the Muhammadan manifestation took them, due to the presence (الحضور) he attained in this Divine Presence (الحضرة) concerning what that Muhammadan manifestation was commanded to convey to this community. He returns to himself, having retained what the Spirit addressed to the manifestation of Muhammad (may Allah bless him and grant him peace), and he knows its validity with certain knowledge (علم يقين), indeed, with the very eye of certainty (عين يقين). Thus, he takes the ruling of this Prophet and acts upon it with clear evidence from his Lord.\n\nPerhaps a weak hadith, whose practice was abandoned due to the weakness of its chain because of a fabricator (وضاع) among its narrators, is actually sound in reality (في نفس الأمر), and this fabricator was truthful regarding this hadith and did not fabricate it. Rather, the traditionist rejected it due to lack of confidence in his narration, especially if that fabricator was isolated in the narration or if the hadith depended solely on him. However, if a trustworthy person shared the narration with him, having heard that hadith previously through the trustworthy person’s chain, then this Saint has heard it from the Spirit (الروح) casting it upon the Reality of Muhammad (حقيقة محمد), just as the Companions heard the Hadith of Gabriel (peace be upon him) with Muhammad (may Allah bless him and grant him peace) concerning Islam, Faith (الإيمان), and Excellence (الإحسان), in his confirmation of him. When he hears it from the delivering Spirit, he is in the same position regarding it as the Companion who heard it from the mouth of the Messenger of Allah (may Allah bless him and grant him peace)—a knowledge about which there is no doubt—unlike the Successor (التابع), who accepts it based on the predominance of conjecture, due to the absence of suspicion affecting its veracity.\n\nConversely, perhaps a hadith is sound according to the chain of its narrators, yet this person of Unveiling (المكاشف), who has witnessed this manifestation, asks the Prophet (may Allah bless him and grant him peace) about this sound hadith, and the Prophet denies it, saying, \"I did not say it, nor did I rule by it.\" Then the Saint knows its weakness and abandons acting upon it based on clear evidence from his Lord, even if the people of transmission (أهل النقل) have acted upon it due to the soundness of its chain, for in reality (في نفس الأمر) it is not so. Muslim mentioned something similar to this at the beginning of his *Sahih* collection. This person of Unveiling (المكاشف) may even know who fabricated that hadith which they deem sound in its chain, either by having the person named to him or by having the image of the person presented to him.\n\nThese, then, are the Prophets of the Saints (أنبياء الأولياء). They never act independently with a Law (شريعة), nor do they receive a discourse concerning it, except by way of informing them that \"This is the Law of Muhammad (may Allah bless him and grant him peace),\" or by witnessing the one upon whom the ruling is revealed in the Presence of Representation (حضرة التمثل), which is external to his essence, or internal, which is referred to as \"glad tidings\" (المبشرات) in the case of the sleeper. However, the Saint shares with the Prophet the ability to perceive in the waking state what the common people perceive in sleep. The people of our path have affirmed this station for the Saints (الأولياء). The attainment of this—which is the act through spiritual resolve (الهمة) and knowledge (العلم) without a teacher from the creation other than Allah—is the knowledge of Al-Khidr. If Allah grants him knowledge of this Law (الشريعة) by which He obligates him to worship, through the tongue of the Messenger of Allah (may Allah bless him and grant him peace) by removing the intermediaries—meaning the jurists (الفقهاء) and the scholars of external forms (علماء الرسوم)—it is from Ladunni Knowledge (العلم اللدني). He would not be one of the Prophets of this community. Thus, no one among the Saints can be an inheritor of a Prophet except in this specific state of witnessing the Angel during the casting of the revelation upon the Reality of the Messenger. Understand this.\n\nThese are the Prophets of the Saints (أنبياء الأولياء). The entire group is equal in calling to Allah upon clear insight (بصيرة), just as Allah the Exalted commanded His Prophet (may Allah bless him and grant him peace) to say: <<أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي>> (I call unto Allah upon clear insight, I and those who follow me). They are the people of this station. They are in this community like the Prophets in the Children of Israel, at the level of Aaron (peace be upon him) being obligated by the Law of Moses (peace be upon them both), despite Aaron being a Prophet, for Allah testified to his prophethood and explicitly stated it in the Quran. Such individuals preserve the sound Law (الشريعة الصحيحة) about which there is no doubt, both for themselves and for this community among those who follow them. They are the most knowledgeable people concerning the Law, although the jurists (الفقهاء) do not concede this to them. These Saints are not required to establish proof of their veracity; rather, they must conceal their station. They do not refute the scholars of external forms (علماء الرسوم) regarding what is established with them, even though they know that it is an error in reality (في نفس الأمر). Their ruling is like the ruling of the independent jurist (المجتهد) who is not permitted to rule on an issue contrary to what his independent reasoning led him to and what his evidence provided. Nor is he permitted to declare his opponent wrong in his ruling, for the Lawgiver has confirmed that ruling in the opponent's right. Thus, proper conduct (الأدب) requires him not to declare wrong what the Lawgiver has confirmed as a ruling, while his evidence and his Unveiling (كشفه) compel him to follow the ruling that has become manifest to him and which he has witnessed.\n\n### [Preservers of the Prophetic Ruling and Preservers of the Prophetic State]\n\nThe report came from the Prophet (may Allah bless him and grant him peace) that the scholars of this community are the Prophets of the Children of Israel. This refers to the status we have indicated. For the Prophets of the Children of Israel used to preserve the Laws of their Messengers for them and uphold them among them. Likewise, the scholars and Imams of this community preserve the rulings (أحكام) of their Messenger (may Allah bless him and grant him peace) for it, such as the scholars among the Companions, and those who followed them among the Successors (التابعين) and the Followers of the Successors, such as Al-Thawri, Ibn Uyaynah, Ibn Sirin, Al-Hasan, Malik, Ibn Abi Rabah, and Abu Hanifa, and those who followed them in time, such as Al-Shafi’i and Ibn Hanbal, and those who followed their path, continuing in the preservation of the rulings (الأحكام).\n\nAnd there is **another group** of scholars in this community who preserve the states (أحوال) of the Messenger (may Allah bless him and grant him peace) and the secrets of his sciences, such as Ali, Ibn Abbas, Salman, Abu Hurayrah, and Hudhayfah. And among the Successors, such as Al-Hasan al-Basri, Malik ibn Dinar, Banan al-Hammal, and Ayyub al-Sakhtiyani. And those who followed them in time, such as Shayban al-Ra’i, Faraj al-Aswad al-Mu’ammar, Al-Fudayl ibn Iyad, and Dhu al-Nun al-Misri. And those who followed them, such as Al-Junayd and Al-Tustari, and those among the Masters (السادة) who followed their path in preserving the Prophetic State (الحال النبوي), Ladunni Knowledge (العلم اللدني), and the Divine Secret (السر الإلهي).\n\nThe secrets of the preservers of the Ruling (حفظة الحكم) are suspended at the Footstool (الكرسي) near the feet, as they did not possess a Prophetic State (حال نبوي) that grants a Divine Secret or Ladunni Knowledge. The secrets of the preservers of the Prophetic State and Ladunni Knowledge, whether they are from the scholars who preserve the Ruling or others, are suspended at the Throne (العرش) and the Cloud (العماء). Some of these secrets have a station (مقام) and some have no station. That is a station by which they are distinguished, for leaving the mark among the possessors of marks is a verified mark, not bound by restriction, and it is the most sublime of marks. This only belongs to the established and perfected one in the Muhammadan Inheritance (الورث المحمدي).\n\n### [Poles of the Previous Nations]\n\nAs for the Perfected Poles (أقطاب المكملين) of the nations other than this community, who preceded us in time, they are a group whose names were mentioned to me in the Arabic tongue when I witnessed them and saw them in a Presence of the Isthmus (حضرة برزخية) while I was in the city of Cordoba, in a most sacred witnessing (مشهد أقدس). Among them were: The Separator (المفرق), The Healer of Wounds (مداوي الكلوم), The Crier (البكاء), The Exalted (المرتفع), The Healing (الشفاء), The Effacer (الماحق), The Successor (العاقب), The Slaughtered (المنحور), The Water Tree (شجر الماء), The Element of Life (عنصر الحياة), The Fugitive (الشريد), The Returner (الراجع), The Maker (الصانع), The Flyer (الطيار), The Safe One (السالم), The Caliph (الخليفة), The Divided (المقسوم), The Living (الحي), The Shooter (الرامي), The Expansive (الواسع), The Sea (البحر), The Adherent (الملصق), The Guide (الهادي), The Reformer (المصلح), and The Subsistent (الباقي). These are the Perfected Ones whose names were given to us, from Adam (peace be upon him) up to the time of Muhammad (may Allah bless him and grant him peace).\n\n### [The Muhammadan Spirit and its Manifestations in the World]\n\nAs for the single Pole (القطب الواحد), he is the Spirit of Muhammad (may Allah bless him and grant him peace). He is the source of sustenance (الممد) for all Prophets and Messengers (peace of Allah be upon them all) and the Poles (الأقطاب) from the beginning of human existence until the Day of Resurrection. He was asked (may Allah bless him and grant him peace), \"When were you a Prophet?\" He replied (may Allah bless him and grant him peace), \"While Adam was between water and clay.\" His name was The Healer of Wounds (مداوي الكلوم), for he is knowledgeable concerning the wounds of passion, opinion, the world, Satan, and the soul, in every prophetic, messengerial, or saintly tongue. He used to look toward the place of his physical birth in Mecca and toward Syria. Now, however, he has turned his gaze toward a land of great heat and dryness that none of the children of Adam can reach with his body, although some people have seen it from Mecca in their place without physical transfer, the earth having been folded up for them so they saw it. We have taken abundant sciences from him through various means.\n\nThis Muhammadan Spirit (الروح المحمدي) has manifestations (مظاهر) in the world: its most perfect manifestation is in the Pole of the Time (قطب الزمان), in the Individuals (الأفراد), in the Seal of Muhammadan Sainthood (ختم الولاية المحمدي), and in the Seal of General Sainthood (ختم الولاية العامة), who is Jesus (peace be upon him). This is what is referred to as his dwelling place (مسكنه). I shall mention, God willing, after this chapter, the secrets related to his being The Healer of Wounds (مداوي الكلوم) and the sciences that have spread from him.\n\nThen this secret appeared, after the manifestation of the state of The Healer of Wounds, in another person whose name was The Submissive to Decree and Destiny (المستسلم للقضاء والقدر). Then the authority (الحكم) transferred from him to The Manifestation of The Real (مظهر الحق). Then it transferred from The Manifestation of The Real to The Agitator (الهائج). Then it transferred from The Agitator to a person called The Establisher of the Ruling (واضع الحكم), and I believe he is Luqman, though Allah knows best, for he was in the time of David. I am not certain that he is Luqman. Then it transferred from The Establisher of the Ruling to The Acquirer (الكاسب). Then it transferred from The Acquirer to The Gatherer of the Ruling (جامع الحكم). I do not know to whom the matter transferred after him. I shall mention in this book, when the names of these individuals arise, the sciences specific to them, and we shall mention one issue for each of them, God willing, and this will flow upon my tongue. I do not know what Allah will do with me. This much suffices for this chapter. And Allah says the Truth, and He guides to the Way. <<وَاللهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way). End of the Thirteenth Part.",
    "ur": "\"چودھواں باب\" انبیاء کے اسرار کی معرفت میں، یعنی اولیاء کے انبیاء (أنبياء الأولياء) اور آدم علیہ السلام سے لے کر محمد صلی اللہ علیہ وسلم تک کی مکمل امتوں کے اقطاب (أقطاب الأمم المكملين) کی معرفت میں، اور یہ کہ قطب (القطب) ایک ہی ہے جب سے اللہ نے اسے پیدا کیا ہے، وہ مرا نہیں، اور اس کا ٹھکانہ کہاں ہے۔\n\nاولیاء کے انبیاء (أنبياء الأولياء) ہی وارث ہیں،\nاللہ نے ان کے ذریعے اسے پہچانا جسے اس نے مبعوث کیا۔\n\nپھر ایک ہی امام کے دل میں،\nاس امر کا راز ایک ایسی روح ہے جس نے اسے پاک کیا۔\n\nپھر جب اللہ نے اس کے لیے عہد کیا،\nاور اس کی مخلوق میں وہ راز سرایت کر گیا، تو اس نے عہد نہیں توڑا، بلکہ اسے اس کی عزت پر قبول کیا۔\n\nیہ اس کی طرف سے ایک احسان ہے، وارثوں کے دلوں پر،\nقطب (القطب) کا ٹھکانہ جہاں وہ رہتا ہے، اسے اس کے وارث کے سوا کوئی نہیں جانتا۔\n\n### [نبی اور رسول]\n\nجان لو، اللہ تمہاری مدد کرے، کہ نبی (النبي) وہ ہے جس کے پاس فرشتہ اللہ کی طرف سے وحی لے کر آتا ہے، اس وحی میں ایک شریعت شامل ہوتی ہے جس کے ذریعے وہ خود اپنی ذات میں عبادت کرتا ہے۔ اگر وہ اسے دوسروں کی طرف بھیجے تو وہ رسول (رسول) ہوتا ہے۔ فرشتہ اس کے پاس دو حالتوں میں آتا ہے: یا تو وہ وحی اس کے دل پر نازل کرتا ہے، اس نزول میں مختلف احوال ہوتے ہیں، یا پھر ایک جسمانی صورت میں باہر سے آتا ہے اور جو کچھ وہ لایا ہے اسے اس کے کان میں ڈالتا ہے، تو وہ سنتا ہے، یا اس کی آنکھ پر ڈالتا ہے، تو وہ دیکھتا ہے، اور اسے دیکھنے سے وہی حاصل ہوتا ہے جو سننے سے حاصل ہوتا ہے، اور اسی طرح دیگر تمام حسی قوتوں کے ساتھ بھی ہوتا ہے۔\n\nیہ باب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بند کر دیا گیا ہے، لہٰذا کسی کے لیے یہ راستہ نہیں کہ اللہ اس شریعت محمدیہ کو منسوخ کرنے والی کسی شریعت کے ذریعے کسی کو عبادت کا حکم دے۔ اور جب عیسیٰ علیہ السلام نازل ہوں گے تو وہ صرف محمد صلی اللہ علیہ وسلم کی شریعت کے مطابق ہی حکم کریں گے۔ اور وہ (عیسیٰ) خاتم الاولیاء ہیں، کیونکہ یہ محمد صلی اللہ علیہ وسلم کی شرافت میں سے ہے کہ اللہ نے ان کی امت کی ولایت (الولایۃ) کو ایک مکرم نبی رسول کے ساتھ ختم کیا، جس کے ذریعے مقام ولایت (مقام الولایۃ) کو ختم کیا گیا۔ قیامت کے دن ان کا حشر رسولوں کے ساتھ رسول کی حیثیت سے ہوگا، اور ہمارے ساتھ محمد صلی اللہ علیہ وسلم کے پیروکار ولی (ولي) کی حیثیت سے ہوگا۔ اللہ تعالیٰ نے اس مقام کے ذریعے انہیں تمام انبیاء پر کرم بخشا۔\n\n### [اولیاء کے انبیاء]\n\nاور جہاں تک اس امت میں اولیاء کے انبیاء (أنبياء الأولياء) کی حالت کا تعلق ہے، تو وہ ہر وہ شخص ہے جسے ذات حق (الحق) نے اپنے ظہور الٰہی (تجلی) میں سے کسی ایک ظہور میں قائم کیا، اور اس کے لیے محمد صلی اللہ علیہ وسلم کا مظہر اور جبریل علیہ السلام کا مظہر قائم کیا۔ پس اس روحانی مظہر نے اسے محمد صلی اللہ علیہ وسلم کے مظہر کے لیے مشروع احکام کا خطاب سنایا، یہاں تک کہ جب وہ اپنے خطاب سے فارغ ہوا اور اس ولی کے دل سے خوف دور ہوا، تو اس مشہد کے صاحب نے اس خطاب میں شامل تمام مشروع احکام کو سمجھ لیا جو اس امت محمدیہ میں ظاہر ہیں۔ پس یہ ولی انہیں اسی طرح لیتا ہے جیسے محمدی مظہر نے لیا تھا، اس حضور کی وجہ سے جو اسے اس حضرت میں حاصل ہوا، اس چیز کے بارے میں جس کا حکم اس محمدی مظہر کو اس امت تک پہنچانے کے لیے دیا گیا تھا۔ پس وہ اپنی ذات کی طرف لوٹتا ہے، اور اس نے اس بات کو محفوظ کر لیا ہوتا ہے جس کا خطاب روح نے محمد صلی اللہ علیہ وسلم کے مظہر سے کیا تھا، اور اس کی صحت کو علم یقین (علم يقين) بلکہ عین یقین (عين يقين) کے ساتھ جان لیا ہوتا ہے۔ پس وہ اس نبی کا حکم لیتا ہے اور اپنے رب کی طرف سے دلیل کے ساتھ اس پر عمل کرتا ہے۔\n\nپس بسا اوقات کوئی ضعیف حدیث ہوتی ہے جس پر عمل اس کے طریق کے ضعف کی وجہ سے ترک کر دیا جاتا ہے، کیونکہ اس کے راویوں میں کوئی وضاع (جھوٹا راوی) ہوتا ہے، حالانکہ وہ حقیقت میں صحیح ہوتی ہے، اور یہ وضاع اس حدیث میں سچا ہوتا ہے اور اس نے اسے وضع نہیں کیا ہوتا۔ محدث نے اسے صرف اس لیے رد کر دیا کہ اس کے نقل میں اس کے قول پر اعتماد نہیں تھا، اور یہ تب ہوتا ہے جب وہ وضاع اس میں منفرد ہو یا حدیث کا مدار اسی پر ہو۔ لیکن اگر اس میں کوئی ثقہ راوی اس کا شریک ہو جس نے اس سے پہلے وہ حدیث اس ثقہ کے طریق سے سنی ہو، تو یہ ولی اسے روح سے سنتا ہے جو اسے حقیقت محمدیہ (حقيقة محمديۃ) پر القاء کرتی ہے، جیسا کہ صحابہ نے جبریل علیہ السلام کی حدیث کو محمد صلی اللہ علیہ وسلم کے ساتھ اسلام، ایمان اور احسان کے بارے میں سنا تھا، جب انہوں نے آپ کی تصدیق کی تھی۔ اور جب وہ اسے القاء کرنے والی روح سے سنتا ہے، تو وہ اس میں اس صحابی کی طرح ہوتا ہے جس نے اسے رسول اللہ صلی اللہ علیہ وسلم کے منہ سے سنا تھا، ایسا علم جس میں کوئی شک نہیں ہوتا، برخلاف تابعی کے، جو اسے غلبہ ظن کے طریقے پر قبول کرتا ہے، کیونکہ صدق پر اثر انداز ہونے والی تہمت ختم ہو چکی ہوتی ہے۔\n\nاور بسا اوقات کوئی حدیث اپنے راویوں کے طریق سے صحیح ہوتی ہے، لیکن اس مکاشف (المكاشف) کو جو اس مظہر کا مشاہدہ کر چکا ہوتا ہے، وہ حاصل ہوتا ہے کہ وہ نبی صلی اللہ علیہ وسلم سے اس صحیح حدیث کے بارے میں پوچھتا ہے، تو آپ اس کا انکار کرتے ہیں اور فرماتے ہیں: \"میں نے یہ نہیں کہا اور نہ ہی اس کا حکم دیا ہے۔\" پس وہ اس کے ضعف کو جان لیتا ہے اور اپنے رب کی طرف سے دلیل کے ساتھ اس پر عمل کرنا چھوڑ دیتا ہے، اگرچہ اہل نقل نے اس کے طریق کی صحت کی وجہ سے اس پر عمل کیا ہو، حالانکہ وہ حقیقت میں ایسا نہیں ہوتی۔ مسلم نے اپنی صحیح کے مقدمے میں اس کی مثال ذکر کی ہے۔\n\nاور یہ مکاشف (المكاشف) اس شخص کو بھی پہچان لیتا ہے جس نے ان کے زعم میں اس صحیح حدیث کے طریق کو وضع کیا ہے، یا تو اس کا نام لے کر یا اس شخص کی صورت اس کے لیے قائم کر کے۔ پس یہی لوگ اولیاء کے انبیاء (أنبياء الأولياء) ہیں۔ وہ کبھی بھی کسی شریعت میں منفرد نہیں ہوتے، اور نہ ہی انہیں اس کے بارے میں کوئی خطاب ہوتا ہے، مگر اس تعریف کے ساتھ کہ یہ محمد صلی اللہ علیہ وسلم کی شریعت ہے۔ یا وہ اس حکم کے ساتھ نازل ہونے والے کو مشاہدہ کرتے ہیں، اس تمثل کی حضرت میں جو ان کی ذات سے باہر ہوتی ہے، اور اس باطنی تمثل میں جسے سونے والے کے حق میں مبشرات سے تعبیر کیا جاتا ہے، سوائے اس کے کہ ولی (الولي) نبی کے ساتھ اس چیز کے ادراک میں شریک ہوتا ہے جسے عام لوگ نیند میں ادراک کرتے ہیں، بیداری کی حالت میں بھی۔\n\nہمارے طریق کے اولیاء (الأولياء) کے لیے اس مقام کو ثابت کیا گیا ہے، اور اس کا آنا ہمت اور علم کے ذریعے ہوتا ہے، بغیر کسی مخلوق معلم کے، سوائے اللہ کے۔ اور یہ علم خضر (علم الخضر) ہے۔ پس اگر اللہ نے اسے اس شریعت کا علم عطا کیا جس کے ذریعے وہ رسول اللہ صلی اللہ علیہ وسلم کی زبان پر عبادت کرتا ہے، واسطوں یعنی فقہاء اور رسوم کے علماء کے اٹھ جانے کے ساتھ، تو یہ علم لدنی (العلم اللدني) میں سے ہوگا، اور وہ اس امت کے انبیاء میں سے نہیں ہوگا۔ پس کوئی بھی ولی (الولي) نبی کا وارث نہیں ہوتا مگر اسی خاص حالت پر، یعنی رسول کی حقیقت (حقيقة الرسول) پر القاء کے وقت فرشتے کا مشاہدہ کرنا۔ پس سمجھو۔\n\nپس یہی لوگ اولیاء کے انبیاء (أنبياء الأولياء) ہیں۔ اور یہ پوری جماعت اللہ کی طرف بصیرت کے ساتھ دعوت دینے میں برابر ہے، جیسا کہ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا کہ وہ کہیں:\n**قرآنی آیت:** \"أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي\" (میں اللہ کی طرف بصیرت کے ساتھ بلاتا ہوں، میں بھی اور وہ بھی جو میری پیروی کرتے ہیں)۔\nاور وہ اس مقام کے اہل ہیں۔ پس وہ اس امت میں بنی اسرائیل کے انبیاء کی طرح ہیں، اس مرتبے پر کہ ہارون علیہ السلام نے موسیٰ علیہ السلام کی شریعت کے ذریعے عبادت کی، باوجود اس کے کہ وہ نبی تھے، کیونکہ اللہ نے ان کی نبوت کی گواہی دی اور قرآن میں اس کی صراحت کی۔ پس ایسے لوگ اپنے لیے اور اس امت کے لیے ان لوگوں سے صحیح شریعت کی حفاظت کرتے ہیں جو ان کی پیروی کرتے ہیں۔ پس وہ شرع کے بارے میں سب سے زیادہ جاننے والے ہیں۔ تاہم، فقہاء انہیں یہ تسلیم نہیں کرتے۔ اور ان پر اپنی سچائی پر دلیل قائم کرنا لازم نہیں، بلکہ ان پر اپنے مقام کو چھپانا واجب ہے۔ اور وہ علماء الرسوم (رسمی علماء) پر ان چیزوں میں رد نہیں کرتے جو ان کے نزدیک ثابت ہیں، باوجود اس کے کہ وہ جانتے ہیں کہ وہ حقیقت میں غلط ہیں۔ پس ان کا حکم اس مجتہد کا حکم ہے جسے کسی مسئلے میں اس کے اجتہاد اور دلیل کے خلاف حکم دینے کا حق نہیں، اور نہ ہی اسے اپنے مخالف کو اس کے حکم میں غلط ٹھہرانے کا حق ہے۔ کیونکہ شارع نے اس حکم کو اس کے حق میں مقرر کر دیا ہے۔ پس ادب کا تقاضا ہے کہ وہ اس چیز کو غلط نہ ٹھہرائے جسے شارع نے حکم مقرر کیا ہے، جبکہ اس کی دلیل اور کشف (الکشف) اسے اس حکم کی پیروی کا حکم دیتا ہے جو اس پر ظاہر ہوا اور جس کا اس نے مشاہدہ کیا۔\n\n### [نبوی حکم کے محافظ اور نبوی حال کے محافظ]\n\nنبی صلی اللہ علیہ وسلم سے یہ خبر آئی ہے کہ اس امت کے علماء بنی اسرائیل کے انبیاء کی طرح ہیں۔\n\nیعنی وہ منزلت جس کی طرف ہم نے اشارہ کیا ہے۔ کیونکہ بنی اسرائیل کے انبیاء ان کے رسولوں کی شریعتوں کی حفاظت کرتے تھے اور ان میں ان پر قائم رہتے تھے۔ اسی طرح اس امت کے علماء اور ائمہ اپنے رسول صلی اللہ علیہ وسلم کے احکام کی حفاظت کرتے ہیں، جیسے صحابہ کے علماء اور ان کے بعد کے تابعین اور تبع تابعین، جیسے ثوری، ابن عیینہ، ابن سیرین، حسن، مالک، ابن ابی رباح، اور ابوحنیفہ، اور ان کے بعد کے لوگ جیسے شافعی اور ابن حنبل، اور جو ان کے طریقے پر چلتے رہے، احکام کی حفاظت میں۔\n\nاور اس امت کے علماء کا ایک دوسرا گروہ ہے جو رسول صلی اللہ علیہ وسلم کے احوال اور ان کے علوم کے اسرار کی حفاظت کرتا ہے، جیسے علی، ابن عباس، سلمان، ابوہریرہ، اور حذیفہ، اور تابعین میں سے جیسے حسن بصری، مالک بن دینار، بنان الحمال، ایوب السختیانی، اور ان کے بعد کے زمانے کے لوگ جیسے شیبان الراعی، فرج الاسود المعمر، فضیل بن عیاض، اور ذوالنون مصری، اور ان کے بعد کے لوگ جیسے جنید اور تستری، اور جو ان سادات کے طریقے پر چلے، نبوی حال (الحال النبوي)، علم لدنی (العلم اللدني)، اور سر الٰہی (السر الإلهي) کی حفاظت میں۔\n\nپس احکام کے محافظوں کے اسرار کرسی میں قدموں کے پاس موقوف ہیں، کیونکہ ان کے پاس کوئی نبوی حال نہیں تھا جو کوئی سر الٰہی (سر إلهي) یا علم لدنی (علم لدني) عطا کرے۔ اور نبوی حال (الحال النبوي) اور علم لدنی (العلم اللدني) کے محافظوں کے اسرار، جو احکام کے محافظ علماء میں سے ہیں یا ان کے علاوہ، عرش اور عماء (العماء) کے پاس موقوف ہیں، اور ان میں سے کچھ کا مقام ہے اور کچھ کا کوئی مقام نہیں ہے۔ اور یہ وہ مقام ہے جس سے وہ ممتاز ہوتے ہیں۔ کیونکہ علامات والوں کے درمیان علامت کو ترک کرنا ایک محقق علامت ہے جس پر کوئی قید نہیں لگائی گئی، اور یہ سب سے اعلیٰ علامات میں سے ہے، اور یہ صرف اس کامل متمکن کو حاصل ہوتی ہے جو ورث محمدی (الورث المحمدي) میں ہو۔\n\n### [سابقہ امتوں کے اقطاب]\n\nاور جہاں تک ان مکمل امتوں کے اقطاب (أقطاب الأمم المكملين) کا تعلق ہے جو اس امت کے علاوہ ہیں اور زمانے میں ہم سے پہلے گزرے ہیں، تو وہ ایک جماعت ہے جن کے نام مجھے عربی زبان میں بتائے گئے جب میں نے انہیں قرطبہ شہر میں ایک اقدس برزخی (برزخية) مشہد میں دیکھا۔ ان میں سے المفرق (جدا کرنے والا)، مداوی الکلوم (زخموں کا علاج کرنے والا)، البکاء (رونے والا)، المرتفع (بلند ہونے والا)، الشفاء (شفا)، الماحق (مٹانے والا)، العاقب (پیچھے آنے والا)، المنحور (ذبح کیا گیا)، شجر الماء (پانی کا درخت)، عنصر الحیاۃ (زندگی کا عنصر)، الشرید (تنہا)، الراجع (لوٹنے والا)، الصانع (بنانے والا)، الطیار (اڑنے والا)، السالم (محفوظ)، الخلیفۃ (خلیفہ)، المقسوم (تقسیم شدہ)، الحی (زندہ)، الرامی (تیر انداز)، الواسع (کشادہ)، البحر (سمندر)، الملصق (جوڑنے والا)، الہادی (ہدایت دینے والا)، المصلح (اصلاح کرنے والا)، اور الباقی (باقی رہنے والا) شامل تھے۔ پس یہ وہ مکمل لوگ ہیں جن کے نام آدم علیہ السلام سے لے کر محمد صلی اللہ علیہ وسلم کے زمانے تک ہمیں بتائے گئے۔\n\n### [روح محمدی اور عالم میں اس کے مظاہر]\n\nاور جہاں تک قطب واحد (القطب الواحد) کا تعلق ہے، تو وہ روح محمدی (الروح المحمدي) ہے، اور وہ انسانی نشوونما کے وقت سے لے کر قیامت کے دن تک تمام انبیاء اور رسولوں (سلام اللہ علیہم اجمعین) اور اقطاب (الأقطاب) کو مدد فراہم کرنے والا ہے۔\n\nآپ صلی اللہ علیہ وسلم سے پوچھا گیا: \"آپ کب نبی تھے؟\" تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"جب آدم پانی اور مٹی کے درمیان تھے۔\"\n\nاور ان کا نام مداوی الکلوم (زخموں کا علاج کرنے والا) تھا، کیونکہ وہ عشق کے زخموں، رائے، دنیا، شیطان اور نفس سے ہر نبوی، رسالتی یا ولایتی زبان کے ذریعے باخبر ہیں۔\n\nاور ان کی نظر مکہ میں ان کے جسم کی جائے پیدائش اور شام کی طرف تھی، پھر اب انہوں نے اپنی نظر ایک ایسی زمین کی طرف پھیر دی ہے جو بہت گرم اور خشک ہے، جہاں بنی آدم میں سے کوئی بھی اپنے جسم کے ساتھ نہیں پہنچ سکتا، مگر بعض لوگوں نے اسے مکہ میں اپنے مقام سے دیکھا ہے، بغیر کسی نقل و حرکت کے، زمین ان کے لیے لپیٹ دی گئی اور انہوں نے اسے دیکھا۔ اور ہم نے ان سے مختلف طریقوں سے بہت سے علوم حاصل کیے ہیں۔\n\nاور اس روح محمدی (الروح المحمدي) کے عالم میں مظاہر ہیں، اس کا سب سے مکمل مظہر قطب الزمان (قطب الزمان) میں، اور افراد (الأفراد) میں، اور ختم ولایت محمدی (ختم الولاية المحمدي) میں، اور ختم ولایت عامہ (ختم الولاية العامة) میں ہے جو عیسیٰ علیہ السلام ہیں۔ اور اسی کو ان کے ٹھکانے سے تعبیر کیا جاتا ہے۔\n\nاور میں اس باب کے بعد ان شاء اللہ ان اسرار کا ذکر کروں گا جو ان کے مداوی الکلوم ہونے کی حیثیت سے ہیں، اور جو علوم ان سے پھیلے ہیں۔ پھر یہ راز مداوی الکلوم کے حال کے ظاہر ہونے کے بعد ایک دوسرے شخص میں ظاہر ہوا جس کا نام المستسلم للقضاء والقدر (قضا و قدر کے سامنے سر تسلیم خم کرنے والا) تھا۔ پھر حکم ان سے مظهر الحق (ذات حق کا مظہر) کی طرف منتقل ہوا، پھر مظهر الحق سے الہائج (جوش میں آنے والا) کی طرف منتقل ہوا، پھر الہائج سے ایک شخص کی طرف منتقل ہوا جسے واضع الحکم (حکم وضع کرنے والا) کہا جاتا ہے، اور میرا خیال ہے کہ وہ لقمان تھے، واللہ اعلم، کیونکہ وہ داؤد کے زمانے میں تھے، لیکن مجھے یقین نہیں کہ وہ لقمان ہی تھے۔ پھر واضع الحکم سے الکاسب (کمانے والا) کی طرف منتقل ہوا، پھر الکاسب سے جامع الحکم (حکم جمع کرنے والا) کی طرف منتقل ہوا، اور مجھے نہیں معلوم کہ اس کے بعد یہ امر کس کی طرف منتقل ہوا۔\n\nاور میں اس کتاب میں، جب ان لوگوں کے نام آئیں گے، تو ان علوم کا ذکر کروں گا جن کے ساتھ وہ خاص تھے، اور ان شاء اللہ ان میں سے ہر ایک کے لیے ایک مسئلہ بیان کروں گا۔ اور یہ میری زبان پر جاری ہوگا، پس میں نہیں جانتا کہ اللہ میرے ساتھ کیا کرے گا۔ اور اس باب کے لیے یہ مقدار کافی ہے۔\n\n**قرآنی آیت:** \"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\n\nتیرہواں حصہ ختم ہوا۔",
    "fa": "«باب چهاردهم» در شناخت اسرار انبیا، یعنی انبیای اولیاء (أنبياء الأولياء) و اقطاب (أقطاب) کامل‌کنندگان امت‌ها از آدم (علیه السلام) تا محمد (صلی الله علیه وسلم)، و اینکه قطب (القطب) از زمان خلقتش یکی است و نمرده است و محل سکونتش کجاست.\n\nانبیای اولیاء (أنبياء الأولياء)، وارثان‌اند *** خداوند به واسطه آنان کسی را که مبعوث کرده، شناسانده است.\n\nسپس در قلب یک امام واحد *** راز این امر، روحی است که آن را دمیده است.\n\nسپس چون خداوند برای او پیمان بست *** و در خلقش جاری شد، پیمان نشکست، بلکه آن را با عزت دریافت کرد.\n\nاین منتی از اوست بر قلوب وارثان، جایگاه قطب (القطب) که در آن ساکن است *** کسی آن را نمی‌داند جز کسی که وارث اوست.\n\n### [نبی و رسول]\n\nبدان، خداوند تو را یاری کند، که نبی (النبي) کسی است که فرشته وحی را از جانب خداوند برای او می‌آورد که آن وحی متضمن شریعتی است که او را در نفس خود به آن متعبد می‌سازد. اگر آن را به سوی دیگری بفرستد، رسول (رسولاً) خواهد بود. فرشته در دو حالت نزد او می‌آید: یا وحی را بر قلب او نازل می‌کند، با اختلاف احوال در آن تنزل؛ یا به صورت جسمانی از خارج می‌آید و آنچه را آورده است بر گوش او القا می‌کند و او می‌شنود، یا بر چشم او القا می‌کند و او می‌بیند، و از دیدن همان چیزی برای او حاصل می‌شود که از شنیدن حاصل می‌شود، و همچنین سایر قوای حسی. این بابی است که با رسول خدا (صلی الله علیه وسلم) بسته شده است، پس راهی نیست که خداوند کسی را به شریعتی که ناسخ این شریعت محمدیه باشد، متعبد سازد. و عیسی (علیه السلام) نیز هنگامی که نازل می‌شود، جز به شریعت محمد (صلی الله علیه وسلم) حکم نمی‌کند. او خاتم اولیاء است، زیرا از شرف محمد (صلی الله علیه وسلم) است که خداوند ولایت (الولاية) امت او و ولایت مطلقه را به یک نبی رسول مکرم ختم کرد. او در روز قیامت حشری دارد که به عنوان رسول با رسولان محشور می‌شود و به عنوان ولی (ولياً) تابع محمد (صلی الله علیه وسلم) با ما محشور می‌شود. خداوند متعال او را گرامی داشته است و الیاس نیز در این مقام بر سایر انبیا است.\n\n### [انبیای اولیاء]\n\nاما حال انبیای اولیاء (أنبياء الأولياء) در این امت، هر شخصی است که حق (الحق) او را در تجلی (تجلی) از تجلیاتش برپا داشته و مظهر محمد (صلی الله علیه وسلم) و مظهر جبرئیل (علیه السلام) را برای او برپا کرده است. پس آن مظهر روحانی، خطاب احکام مشروع را به مظهر محمد (صلی الله علیه وسلم) به او می‌شنواند. تا زمانی که از خطاب فارغ شود و قلب این ولی (الولي) آرام گیرد، صاحب این مشهد تمام آنچه را که آن خطاب از احکام مشروع ظاهر در این امت محمدیه در بر داشته است، درک می‌کند. پس این ولی (الولي) آن احکام را می‌گیرد، همان‌گونه که مظهر محمدی به دلیل حضوری که در این حضرت برای او حاصل شده، گرفته است، از آنچه آن مظهر محمدی به تبلیغ برای این امت مأمور شده بود. پس به خود باز می‌گردد در حالی که آنچه را روح به مظهر محمد (صلی الله علیه وسلم) خطاب کرده بود، حفظ کرده و صحت آن را علم یقین، بلکه عین یقین، دانسته است. پس حکم این نبی را گرفته و با بینه‌ای از پروردگارش به آن عمل کرده است. چه بسا حدیث ضعیفی که به دلیل ضعف سندش و وجود وضّاعی (جاعل حدیث) در راویانش، عمل به آن ترک شده است، در حالی که در نفس‌الامر صحیح است و این وضّاع در این حدیث راست گفته و آن را جعل نکرده است، بلکه محدث به دلیل عدم وثوق به قول او در نقل، آن را رد کرده است. این در صورتی است که آن وضّاع در نقل تنها باشد یا مدار حدیث بر او باشد. اما اگر فرد ثقه‌ای در آن با او شریک باشد که قبل از آن حدیث را از طریق آن ثقه شنیده باشد، این ولی (الولي) آن را از روح می‌شنود که بر حقیقت محمد (صلی الله علیه وسلم) القا می‌کند، همان‌گونه که صحابه در حدیث جبرئیل (علیه السلام) با محمد (صلی الله علیه وسلم) در مورد اسلام و ایمان و احسان شنیدند، در تصدیق او. و چون آن را از روح القاکننده می‌شنود، در آن مانند صحابی است که آن را از دهان رسول الله (صلی الله علیه وسلم) شنیده است، علمی که در آن شکی نیست، برخلاف تابعی که آن را بر طریق غلبه ظن می‌پذیرد، به دلیل رفع تهمت مؤثر در صدق. و چه بسا حدیثی که از طریق راویانش صحیح باشد، اما برای این مکاشف (المكاشف) که این مظهر را مشاهده کرده، حاصل می‌شود که از نبی (صلی الله علیه وسلم) درباره این حدیث صحیح سؤال می‌کند و او آن را انکار کرده و می‌گوید: «من آن را نگفته‌ام و به آن حکم نکرده‌ام.» پس ضعف آن را می‌داند و عمل به آن را با بینه‌ای از پروردگارش ترک می‌کند، هرچند اهل نقل به دلیل صحت سندش به آن عمل کرده باشند، در حالی که در نفس‌الامر چنین نیست. مسلم نیز در ابتدای کتاب صحیح خود به چنین موردی اشاره کرده است. و این مکاشف (المكاشف) ممکن است بداند چه کسی آن حدیث را که به زعم آنان صحیح‌السند است، جعل کرده است، یا نام او به او گفته شود یا صورت شخص برای او برپا شود. اینان همان انبیای اولیاء (أنبياء الأولياء) هستند و هرگز به شریعتی منفرد نمی‌شوند و خطاب شریعت برای آنان نیست، مگر با تعریفی که این همان شریعت محمد (صلی الله علیه وسلم) است، یا اینکه نازل‌کننده آن حکم را در حضرت تمثل، خارج از ذات خود و داخل (که در حق شخص خوابیده به مبشرات تعبیر می‌شود) مشاهده کند، با این تفاوت که ولی (الولي) با نبی (النبي) در درک آنچه عموم در خواب درک می‌کنند، در حال بیداری شریک است. اهل طریقت ما این مقام را برای اولیاء (الأولياء) ثابت کرده‌اند. و رسیدن به این مقام، یعنی فعل با همت و علم بدون معلمی از مخلوقات جز خداوند، همان علم خضر است. اگر خداوند علم به این شریعت را که او را به واسطه زبان رسول خدا (صلی الله علیه وسلم) به آن متعبد ساخته، با رفع واسطه‌ها، یعنی فقها و علمای رسوم، به او عطا کند، این علم لدنی (العلم اللدني) خواهد بود و او از انبیای این امت نخواهد بود. پس هیچ یک از اولیاء (الأولياء) وارث نبی (النبي) نخواهد بود، مگر بر این حالت خاص از مشاهده فرشته هنگام القا بر حقیقت رسول (الرسول). پس بفهم. اینان همان انبیای اولیاء (أنبياء الأولياء) هستند و همه این جماعت در دعوت به سوی خداوند بر بصیرت مساوی هستند، همان‌گونه که خداوند به پیامبرش (صلی الله علیه وسلم) امر کرد که بگوید: **أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي** (من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). و آنان اهل این مقام هستند. پس آنان در این امت مانند انبیا در بنی اسرائیل هستند، بر مرتبه تعبد هارون به شریعت موسی (علیهما السلام)، با وجود اینکه او نبی بود، زیرا خداوند به نبوت او شهادت داده و در قرآن به آن تصریح کرده است. چنین کسانی شریعت صحیحی را که در آن شکی نیست، برای خود و برای این امت از کسانی که از آنان پیروی می‌کنند، حفظ می‌کنند. پس آنان داناترین مردم به شرع هستند، هرچند فقها این را برای آنان نمی‌پذیرند. و اینان ملزم به اقامه دلیل بر صدق خود نیستند، بلکه کتمان مقامشان بر آنان واجب است و بر علمای رسوم در آنچه نزد آنان ثابت شده است، ایراد نمی‌گیرند، با وجود علمشان به اینکه آن در نفس‌الامر خطا است. پس حکم آنان حکم مجتهدی است که حق ندارد در مسئله‌ای جز به آنچه اجتهادش او را به آن رسانده و دلیلش به او داده است، حکم کند. و حق ندارد مخالف خود را در حکمش تخطئه کند، زیرا شارع آن حکم را در حق او مقرر کرده است. پس ادب اقتضا می‌کند که آنچه را شارع حکم و دلیل مقرر کرده است، تخطئه نکند، در حالی که دلیل و کشف (کشفه) او را به پیروی از حکم آنچه برایش ظاهر شده و مشاهده کرده است، حکم می‌کند.\n\n### [حافظان حکم نبوی و حافظان حال نبوی]\n\nخبری از پیامبر (صلی الله علیه وسلم) وارد شده است که: «علمای این امت، انبیای بنی اسرائیل هستند.»\n\nیعنی همان منزلتی که به آن اشاره کردیم، زیرا انبیای بنی اسرائیل شرایع رسولانشان را برای آنان حفظ می‌کردند و در میانشان به آن قیام می‌نمودند. همچنین علمای این امت و امامان آن، احکام رسولشان (صلی الله علیه وسلم) را برای امت حفظ می‌کنند، مانند علمای صحابه و کسانی که پس از آنان آمدند از تابعین و اتباع تابعین، مانند ثوری، ابن عیینه، ابن سیرین، حسن، مالک، ابن ابی رباح، و ابوحنیفه، و کسانی که پس از آنان آمدند، مانند شافعی و ابن حنبل و کسانی که تا به امروز در حفظ احکام در مسیر آنان قرار گرفتند. (و طایفه دیگری) از علمای این امت، احوال رسول (صلی الله علیه وسلم) و اسرار علوم او را حفظ می‌کنند، مانند علی، ابن عباس، سلمان، ابوهریره، و حذیفه، و از تابعین مانند حسن بصری، مالک بن دینار، بنان الحمال، و ایوب سختیانی، و کسانی که پس از آنان آمدند، مانند شیبان الراعی، فرج الأسود المعمر، فضیل بن عیاض، و ذوالنون مصری، و کسانی که پس از آنان آمدند، مانند جنید و تستری و کسانی که از سادات در حفظ حال نبوی، علم لدنی (العلم اللدني) و سر الهی در مسیر آنان قرار گرفتند. اسرار حافظان حکم (حفظة الحكم) در کرسی، نزد قدم‌ها متوقف است، زیرا آنان حال نبوی نداشتند که سر الهی یا علم لدنی (علماً لدنياً) عطا کند. و اسرار حافظان حال نبوی و علم لدنی (العلم اللدني) از علمای حافظان حکم و غیر آنان، نزد عرش و عماء (العماء) متوقف است. و برخی از آن‌ها مقام دارند و برخی مقام ندارند. و این مقامی است که به واسطه آن متمایز می‌شوند، زیرا ترک علامت در میان صاحبان علامات، علامتی محقق است که مقید به قید نیست و این والاترین علامات است و این جز برای متمکن کامل در وراثت محمدی حاصل نمی‌شود.\n\n### [اقطاب امت‌های پیشین]\n\nاما اقطاب (أقطاب) کامل‌کنندگان امت‌ها در غیر این امت، از کسانی که در زمان بر ما سبقت گرفتند، جماعتی هستند که اسامی‌شان به زبان عربی برای من ذکر شد، هنگامی که آنان را در حضرت برزخی در شهر قرطبه در مشهدی مقدس مشاهده کردم. از جمله آنان: المفرق (جداکننده)، مداوی الکلوم (درمانگر زخم‌ها)، البکاء (گریه‌کننده)، المرتفع (بالارونده)، الشفاء (شفا)، الماحق (نابودکننده)، العاقب (عاقبت‌دهنده)، المنحور (قربانی‌شده)، شجر الماء (درخت آب)، عنصر الحیاة (عنصر زندگی)، الشرید (آواره)، الراجع (بازگردنده)، الصانع (سازنده)، الطیار (پرنده)، السالم (سالم)، الخلیفة (خلیفه)، المقسوم (تقسیم‌شده)، الحی (زنده)، الرامی (پرتاب‌کننده)، الواسع (گسترده)، البحر (دریا)، الملصق (چسباننده)، الهادی (هدایتگر)، المصلح (اصلاح‌کننده)، و الباقی (باقی). اینان کامل‌کنندگانی هستند که از آدم (علیه السلام) تا زمان محمد (صلی الله علیه وسلم) برای ما نام برده شدند.\n\n### [روح محمدی و مظاهر آن در عالم]\n\nاما قطب (القطب) واحد، همان روح محمد (صلی الله علیه وسلم) است و اوست که مددبخش همه انبیا و رسولان (سلام الله علیهم اجمعین) و اقطاب (الأقطاب) از زمان نشأت انسانی تا روز قیامت است.\n\nبه او (صلی الله علیه وسلم) گفته شد: «چه زمانی نبی بودی؟» فرمود (صلی الله علیه وسلم): «در حالی که آدم میان آب و گِل بود.»\n\nنام او مداوی الکلوم (درمانگر زخم‌ها) بود، زیرا او به جراحات هوی، رأی، دنیا، شیطان و نفس، با هر زبان نبوی یا رسالی یا زبان ولایت، آگاه است. او نظری به محل ولادت جسمش در مکه و به شام داشت. سپس اکنون نظر خود را به سرزمینی بسیار گرم و خشک معطوف کرده است که هیچ یک از بنی آدم با جسد خود به آن نمی‌رسد، جز اینکه برخی از مردم آن را از مکه در جای خود، بدون انتقال، دیده‌اند؛ زمین برای او درهم پیچیده شد و آن را دید. ما نیز علوم بسیاری را از او در حالات مختلف گرفته‌ایم.\n\nبرای این روح محمدی (الروح المحمدي) مظاهری در عالم وجود دارد که کامل‌ترین مظهر آن در قطب (قطب) زمان، در افراد (الأفراد)، در ختم ولایت محمدی (ختم الولاية المحمدي) و در ختم ولایت عامه که همان عیسی (علیه السلام) است، می‌باشد. و این همان چیزی است که به مسکن او تعبیر می‌شود.\n\nان‌شاءالله در ادامه این باب، اسرار مربوط به مداوی الکلوم بودن او و علومی که از او منتشر شده است را ذکر خواهم کرد. سپس این سر، پس از ظهور حال مداوی الکلوم، در شخص دیگری به نام المستسلم للقضاء والقدر (تسلیم‌شده به قضا و قدر) ظاهر شد. سپس حکم از او به مظهر الحق (مظهر حق) منتقل شد. سپس از مظهر الحق به الهائج (برانگیخته) منتقل شد. سپس از الهائج به شخصی به نام واضع الحکم (وضع‌کننده حکم) منتقل شد و گمان می‌کنم او لقمان باشد، و خداوند داناتر است، زیرا او در زمان داوود بود و من در مورد اینکه او لقمان است، یقین ندارم. سپس از واضع الحکم به الکاسب (کسب‌کننده) منتقل شد. سپس از الکاسب به جامع الحکم (جمع‌کننده حکم) منتقل شد. و نمی‌دانم امر پس از او به چه کسی منتقل شد. ان‌شاءالله در این کتاب، هنگامی که اسامی این افراد آمد، آنچه را که به آن اختصاص یافته‌اند از علوم ذکر خواهم کرد و برای هر یک از آنان مسئله‌ای را بیان خواهیم کرد. و این بر زبان من جاری می‌شود، پس نمی‌دانم خداوند با من چه خواهد کرد. و همین مقدار از این باب کافی است. **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند).\n\nپایان جزء سیزدهم."
  },
  "page_count": 4
}