{
  "id": 30,
  "title": {
    "ar": "الباب الثلاثون في معرفة الطبقة الأولى والثانية من الأقطاب الركبان",
    "en": "Chapter Thirty: Concerning the Gnosis of the First and Second Stratum of the Riding Poles (al-Aqtāb al-Rukbān).",
    "ur": "باب تیسواں: اقطاب رکبان (الأقطاب الركبان) کے پہلے اور دوسرے طبقے کی معرفت میں۔",
    "fa": "باب سی‌ام در معرفت طبقه اول و دوم از اقطاب رکبان (الأقطاب الركبان)"
  },
  "content": {
    "ar": "## (الباب الثلاثون في معرفة الطبقة الأولى والثانية من الأقطاب الركبان)\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> إن لله عبادا ركبوا *** نجب الأعمال في الليل البهيم‏\n\n\n> وترقت همم الذل بهم *** لعزيز جل من فرد عليم‏\n\n\n> فاجتباهم وتجلى لهمو *** وتلقاهم بكأسات النديم‏\n\n\n> من يكن ذا رفعة في ذلة *** إنه يعرف مقدار العظيم‏\n\n\n> رتبة الحادث إن حققتها *** إنما يظهر فيها بالقديم‏\n\n\n> إن لله علوما جمة *** في رسول ونبي وقسيم‏\n\n\n> لطفت ذاتا فما يدركها *** عالم الأنفاس أنفاس النسيم‏\n\n\n### [الأفراد هم الركبان‏]\n\n\nاعلم أيدك الله أن أصحاب النجب في العرف هم الركبان قال الشاعر\n\n\n> فليت لي بهمو قوما إذا ركبوا *** شنوا الإغارة فرسانا وركبانا\n\n\nالفرسان ركاب الخيل والركبان ركاب الإبل فالأفراس في المعروف تركبها جميع الطوائف من عجم وعرب والهجن لا يستعملها إلا العرب والعرب أرباب الفصاحة والحماسة والكرم ولما كانت هذه الصفات غالبة على هذه الطائفة سميناهم بالركبان فمنهم من يركب نجب الهمم ومنهم من يركب نجب الأعمال فلذلك جعلناهم طبقتين أولى وثانية وهؤلاء أصحاب الركبان هم الأفراد في هذه الطريقة فإنهم رضي الله عنهم على طبقات فمنهم الأقطاب ومنهم الأئمة ومنهم الأوتاد ومنهم الأبدال ومنهم النقباء ومنهم النجباء ومنهم الرجبيون ومنهم الأفراد وما منهم طائفة إلا وقد رأيت منهم وعاشرتهم ببلاد المغرب وببلاد الحجاز والشرق فهذا الباب مختص بالإفراد وهي طائفة خارجة عن حكم القطب وحدها ليس للقطب فيهم تصرف ولهم من الأعداد من الثلاثة إلى ما فوقها من الأفراد ليس لهم ولا لغيرهم فيما دون الفرد الأول الذي هو الثلاثة قدم فإن الأحدية وهو الواحد لذات الحق والاثنان للمرتبة وهو توحيد الألوهية والثلاثة أول وجود الكون عن الله فالأفراد في الملائكة الملائكة المهيمون في جمال الله وجلاله الخارجون عن الأملاك المسخرة والمدبرة اللذين هما في عالم التدوين والتسطير وهم من القلم والعقل إلى ما دون ذلك والأفراد من الإنس مثل المهيمة من الأملاك فأول الأفراد الثلاثة وقد قال صلى الله عليه وسلم الثلاثة ركب‏\n\n\nفأول الركب الثلاثة إلى ما فوق ذلك‏\n\n\n### [ما للأفراد من الحضرات والأسماء والمواد]\n\n\nولهم من الحضرات الإلهية الحضرة الفردانية وفيها يتميزون ومن الأسماء الإلهية الفرد والمواد الواردة على قلوبهم من المقام الذي ترد منه على الأملاك المهيمة ولهذا يجهل مقامهم وما يأتون به مثل ما أنكر موسى عليه السلام على خضر مع شهادة الله فيه لموسى عليه السلام وتعريفه بمنزلته وتزكية الله إياه وأخذه العهد عليه إذ أراد صحبته ولما علم الخضر أن موسى عليه السلام ليس له ذوق في المقام الذي هو الخضر عليه كما إن الخضر ليس له ذوق فيما هو موسى عليه من العلم الذي علمه الله إلا أن مقام الخضر لا يعطي الاعتراض على أحد من خلق الله لمشاهدة خاصة هو عليها ومقام موسى والرسل يعطي الاعتراض من حيث هم رسل لا غير في كل ما يرونه خارجا عما أرسلوا به ودليل ما ذهبنا إليه في هذا قول الخضر لموسى عليه السلام وكَيْفَ تَصْبِرُ عَلى‏ ما لَمْ تُحِطْ به خُبْراً فلو كان الخضر نبيا لما قال له ما لَمْ تُحِطْ به خُبْراً فالذي فعله لم يكن من مقام النبوة وقال له في انفراد كل واحد منهما بمقامه الذي هو عليه‏\n\n\nقال الخضر لموسى عليه السلام يا موسى أنا على علم علمنيه الله لا تعلمه أنت وأنت على علم علمكه الله لا أعلمه أنا\n\n\nوافترقا وتميزا بالإنكار\n\n\n### [الأفراد لهم الأولية في الأمور]\n\n\nفالإنكار ليس من شأن الأفراد فإن لهم الأولية في الأمور فهم ينكر عليهم ولا ينكرون قال الجنيد لا يبلغ أحد درج الحقيقة حتى يشهد فيه ألف صديق بأنه زنديق وذلك لأنهم يعلمون من الله ما لا يعلمه غيرهم‏\n\n\n### [الأفراد هم أصحاب العلم الباطن‏]\n\n\nوهم أصحاب العلم الذي كان‏\n\n\nيقول فيه علي بن أبي طالب رضي‏\nالله عنه حين يضرب بيده إلى صدره ويتنهد إن هاهنا لعلوما جمة لو وجدت لها حملة\n\n\nفإنه كان من الأفراد ولم يسمع هذا من غيره في زمانه إلا أبي هريرة ذكر مثل هذا\n\n\nخرج البخاري في صحيحة عنه أنه قال حملت عن النبي صلى الله عليه وسلم جوابين أما الواحد فبثثته فيكم وأما الآخر فلو بثثته لقطع مني هذا البلعوم‏\n\n\nالبلعوم مجرى الطعام فأبو هريرة ذكر أنه حمله عن رسول الله صلى الله عليه وسلم فكان فيه ناقلا عن غير ذوق ولكنه علم لكونه سمعه من رسول الله صلى الله عليه وسلم ونحن إنما نتكلم فيمن أعطى عين الفهم في كلام الله تعالى في نفسه وذلك علم الأفراد وكان من الأفراد عبد الله بن العباس البحر كان يلقب به لاتساع علمه فكان يقول في قوله عز وجل الله الَّذِي خَلَقَ سَبْعَ سَماواتٍ ومن الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لو ذكرت تفسيره لرجمتموني وفي رواية لقلتم إني كافر وإلى هذا العلم كان يشير على ابن الحسين بن علي بن أبي طالب زين العابدين عليهم الصلاة والسلام بقوله فلا أدري هل هما من قيله أو تمثل بهما\n\n\n> يا رب جوهر علم لو أبوح به *** لقيل لي أنت ممن يعبد الوثنا\n\n\n> ولاستحل رجال مسلمون دمي *** يرون أقبح ما يأتونه حسنا\n\n\nفنبه بقوله يعبد الوثنا على مقصوده ينظر إليه تأويل‏\n\n\nقوله صلى الله عليه وسلم إن الله خلق آدم على صورته‏\n\n\nبإعادة الضمير على الله تعالى وهو من بعض محتملاته‏\n\n\n### [مشكلة العلم الباطن‏]\n\n\nبالله يا أخي أنصفي فيما أقوله لك لا شك أنك قد أجمعت معي على أنه كل ما صح عن رسول الله صلى الله عليه وسلم من الأخبار في كل ما وصف به فيها ربه تعالى من الفرح والضحك والتعجب والتبشبش والغضب والتردد والكراهة والمحبة والشوق إن ذلك وأمثاله يجب الايمان به والتصديق فلو هبت نفحات من هذه الحضرة الإلهية كشفا وتجليا وتعريفا إلهيا على قلوب الأولياء بحيث أن يعلموا بإعلام الله وشاهدوا بإشهاد الله من هذه الأمور المعبر عنها بهذه الألفاظ على لسان الرسول وقد وقع الايمان مني ومنك بهذا كله إذا أتى بمثله هذا الولي في حق الله تعالى أ لست تزندقه كما قال الجنيد أ لست تقول إن هذا مشبه هذا عابد وثن كيف وصف الحق بما وصف به المخلوق ما فعلت عبدة الأوثان أكثر من هذا كما قال علي بن الحسين أ لست كنت تقتله أو تفتي بقتله كما قال ابن عباس فبأي شي‏ء آمنت وسلمت لما سمعت ذلك من رسول الله صلى الله عليه وسلم في حق الله من الأمور التي تحيلها الأدلة العقلية ومنعت من تأويلها والأشعري تأولها على وجوه من التنزيه في زعمه فأين الإنصاف فهلا قلت القدرة واسعة أن تعطي لهذا الولي ما أعطت للنبي من علوم الأسرار فإن ذلك ليس من خصائص النبوة ولا حجر الشارع على أمته هذا الباب ولا تكلم فيه بشي‏ء بل‏\n\n\nقال إن يكن في أمتي محدثون فعمر منهم‏\n\n\nفقد أثبت النبي صلى الله عليه وسلم أن ثم من يحدث ممن ليس بنبي وقد يحدث بمثل هذا فإنه خارج عن تشريع الأحكام من الحلال والحرام فإن ذلك أعني التشريع من خصائص النبوة وليس الاطلاع على غوامض العلوم الإلهية من خصائص نبوة التشريع بل هي سارية في عباد الله من رسول وولي وتابع ومتبوع يا ولي فأين الإنصاف منك أ ليس هذا موجودا في الفقهاء وأصحاب الأفكار الذين هم فراعنة الأولياء ودجاجة عباد الله الصالحين والله يقول لمن عمل منا بما شرع الله له إن الله يعلمه ويتولى تعليمه بعلوم أنتجتها أعماله قال تعالى واتَّقُوا الله ويُعَلِّمُكُمُ الله والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ وقال إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً\n\n\n### [عمر بن الخطاب وابن حنبل‏]\n\n\nومن أقطاب هذا المقام عمر بن الخطاب وأحمد بن حنبل ولهذا\n\n\nقال صلى الله عليه وسلم في عمر بن الخطاب يذكر ما أعطاه الله من القوة يا عمر ما لقيك الشيطان في فج إلا سلك فجا غير فجك!\n\n\nفدل على عصمته بشهادة المعصوم وقد علمنا إن الشيطان ما يسلك قط بنا إلا إلى الباطل وهو غير فج عمر بن الخطاب فما كان عمر يسلك إلا فجاج الحق بالنص فكان ممن لا تأخذه في الله لومة لائم في جميع مسالكه وللحق صولة ولما كان الحق صعب المرام قويا حمله على النفوس لا تحمله ولا تقبله بل تمجه وترده لهذا\n\n\nقال صلى الله عليه وسلم ما ترك الحق لعمر من صديق‏\n\n\nوصدق صلى الله عليه وسلم يعني في الظاهر والباطن أما في الظاهر فلعدم الإنصاف وحب الرئاسة وخروج الإنسان عن عبوديته واشتغاله بما لا يعنيه وعدم تفرغه لما دعي إليه من شغله بنفسه وعيبه عن عيوب الناس وأما في الباطن فما ترك الحق لعمر في قلبه من صديق فما كان له تعلق إلا بالله‏\n\n\n### [مأساة العلم الباطن‏]\n\n\nثم الطامة الكبرى أنك إذا قلت لواحد من هذه الطائفة المنكرة اشتغل بنفسك يقول لك إنما أقوم حماية لدين‏\nالله وغيرة له والغيرة لله من الايمان وأمثال هذا ولا يسكن ولا ينظر هل ذلك من قبيل الإمكان أم لا أعني أن يكون الله قد عرف وليا من أوليائه بما يجريه في خلقه كالخضر ويعلمه علوما من لدنه تكون العبارة عنها بهذه الصيغ التي ينطق بها الرسول صلى الله عليه وسلم كما قال الخضر وما فَعَلْتُهُ عَنْ أَمْرِي وآمن هذا المنكر بها على زعمه إذ جاء بها رسول الله صلى الله عليه وسلم فو الله لو كان مؤمنا بها ما أنكرها على هذا الولي لأن الشارع ما أنكر إطلاقها في جناب الحق من استواء ونزول ومعية وضحك وفرح وتبشبش وتعجب وأمثال ذلك وما ورد عنه صلى الله عليه وسلم قط أنه حجرها على أحد من عباد الله بل أخبر عن الله أنه يقول لنا لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ ففتح لنا وندبنا إلى التأسي به صلى الله عليه وسلم وقال فَاتَّبِعُونِي يُحْبِبْكُمُ الله وهذا من اتباعه والتأسي به فمن التأسي به إذا ورد علينا من الحق سبحانه وارد حق فعلمنا من لدنه علما فيه رحمة حبانا الله بها وعناية حيث كنا في ذلك على بينة من ربنا ويتلوها شاهد منا وهو اتباعنا سنته وما شرع لنا لم نخل بشي‏ء منها ولا ارتكبنا مخالفة بتحليل ما حرم الله أو تحريم ما أحل فنطلب لذلك المعلوم الذي علمناه من جانب الحق أمثال هذه العبارات النبوية لنفصح بها عن ذلك ولا سيما إذا سألنا عن شي‏ء من ذلك لأن الله أخبر عمن هذه صفته أنه يدعو إلى الله على بصيرة فمن التأسي المأمور به برسول الله صلى الله عليه وسلم أن نطلق على تلك المعاني هذه الألفاظ النبوية إذ لو كان في العبارة عنها ما هو أفصح منها لا طلقها صلى الله عليه وسلم فإنه المأمور بتبيين ما أنزل به علينا ولا نعدل إلى غيرها لما نريده من البيان مع التحقق ب لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فإنا إذا عدلنا إلى عبارة غيرها ادعينا بذلك أنا أعلم بحق الله وأنزه من رسول الله صلى الله عليه وسلم وهذا أسوأ ما يكون من الأدب ثم إن المعنى لا بد أن يختل عند السامع إذ كان ذلك اللفظ الذي خالفت به لفظ من كان أفصح الناس وهو رسول الله صلى الله عليه وسلم والقرآن لا يدل على ذلك المعنى بحكم المطابقة فشرع لنا التأسي وغاب هذا المنكر المكفر من أتى بمثل هذا عن النظر في هذا كله وذلك لأمرين أو لأحدهما إن كان عالما فلحسد قام به قال تعالى حَسَداً من عِنْدِ أَنْفُسِهِمْ وإن كان جاهلا فهو بالنبوة أجهل‏\n\n\n### [أقطاب الأفراد واختصاصاتهم‏]\n\n\nيا ولي لقينا من أقطاب هذا المقام بجبل أبي قبيس بمكة في يوم واحد ما يزيد على السبعين رجلا وليس لهذه الطبقة تلميذ في طريقهم أصلا ولا يسلكون أحدا بطريق التربية لكن لهم الوصية والنصيحة ونشر العلم فمن وفق أخذ به ويقال إن أبا السعود بن الشبل كان منهم وما لقيته ولا رأيته ولكن شممت له رائحة طيبة ونفسا عطريا وبلغني أن عبد القادر الجيلي وكان عدلا قطب وقته شهد لمحمد بن قائد الأواني بهذا المقام كذا نقل إلي والعهدة على الناقل فإن ابن قائد زعم أنه ما رأى هناك أمامه سوى قدم نبيه وهذا لا يكون إلا لأفراد الوقت فإن لم يكن من الأفراد فلا بد أن يرى قدم قطب وقته أمامه زائدا على قدم نبيه إن كان إماما وإن كان وتدا فيرى أمامه ثلاثة أقدام وإن كان بدلا يرى أربعة قدام وهكذا إلا أنه لا بد أن يكون في حضرة الاتباع مقاما فإذا لم يقم في حضرات الاتباع وعدل به عن يمين الطريق بين المخدع وبين الطريق فإنه لا يبصر قدما أمامه وذلك هو طريق الوجه الخاص الذي من الحق إلى كل موجود ومن ذلك الوجه الخاص تنكشف للأولياء هذه العلوم التي تنكر عليهم ويزندقون بها ويزندقهم بها ويكفرهم من يؤمن بها إذا جاءته عن الرسل وهي العلوم عينها وهي التي ذكرناها آنفا ولأصحاب هذا المقام التصريف والتصرف في العالم فالطبقة الأولى من هؤلاء تركت التصرف لله في خلقه مع التمكن وتولية الحق لهم إياه تمكنا لا أمرا لكن عرضا فلبسوا الستر ودخلوا في سرادقات الغيب واستتر وبحجب العوائد ولزموا العبودة والافتقار وهم الفتيان الظرفاء الملامتية الأخفياء الأبرياء وكان أبو السعود منهم كان رحمه الله ممن امتثل أمر الله في قوله تعالى فَاتَّخِذْهُ وَكِيلًا فالوكيل له التصرف فلو أمر امتثل الأمر هذا من شأنهم وأما عبد القادر فالظاهر من حاله إنه كان مأمورا بالتصرف فلهذا ظهر عليه هذا هو الظن بأمثاله وأما محمد الأواني فكان يذكر إن الله أعطاه التصرف فقبله فكان يتصرف ولم يكن مأمورا فابتلي فنقصه من المعرفة القدر الذي علا أبو السعود به عليه فنطق أبو السعود بلسان الطبقة الأولى من طائفة الركبان وسميناهم أقطابا لثبوتهم ولأن هذا المقام أعني مقام العبودة يدور عليهم لم أرد بقطبيتهم أن لهم جماعة تحت أمرهم يكونون رؤساء عليهم وأقطابا لهم هم أجل من ذلك وأعلى فلا رياسة أصلا لهم في نفوسهم لتحققهم بعبوديتهم‏\nولم يكن لهم أمر إلهي بالتقدم فما ورد عليهم فيلزمهم طاعته لما هم عليه من التحقق أيضا بالعبودية فيكونون قائمين به في مقام العبودية بامتثال أمر سيدهم وأما مع التخيير والعرض أو طلب تحصيل المقام فإنه لا يظهر به إلا من لم يتحقق بالعبودة التي خلق لها فهذا يا ولي قد عرفتك في هذا الباب بمقاماتهم وبقي التعريف بأصولهم وتعيين أحوال الأقطاب المدبرين من الطبقة الثانية منهم نذكر ذلك فيما بعد إن شاء الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ لا رب غيره‏\n\n",
    "en": "## Chapter Thirty: On the Gnosis of the First and Second Classes of the Riding Poles (الأقطاب الركبان)\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)\n\n> Indeed, Allah has servants who mounted\n> The noble steeds of deeds in the darkest night.\n> The aspirations of humility ascended with them\n> To the Mighty One, exalted is He, the Unique, the All-Knowing.\n> So He chose them and disclosed Himself (تجلى) to them,\n> And received them with the cups of the intimate companion.\n> Whoever possesses high rank in humility,\n> Truly knows the measure of the Magnificent One.\n> The rank of the contingent (الحادث), if you verify it,\n> Is only manifested therein by the Eternal (القديم).\n> Indeed, Allah has abundant knowledges\n> In the Messenger, the Prophet, and the Divider.\n> They are subtle in Essence (ذاتا), so they are not grasped\n> By the world of breaths, nor the breaths of the gentle breeze.\n\n### The Individuals (الأفراد) are the Mounted Ones (الركبان)\n\nKnow, may Allah support you, that the masters of the noble steeds (*nujub*) are, by custom, the Mounted Ones (*al-Rukban*). The poet said:\n\n> Would that I had among them a people who, when they mounted,\n> Launched the raid, both horsemen and mounted ones.\n\nThe horsemen (*al-fursan*) are the riders of horses, and the mounted ones (*al-rukban*) are the riders of camels. Horses are customarily ridden by all groups, both non-Arabs and Arabs, but the noble camels (*al-hujun*) are used only by the Arabs. The Arabs are the masters of eloquence, valor, and generosity. Since these qualities predominate in this group, we named them the Mounted Ones (*al-Rukban*). Among them are those who ride the noble steeds of aspirations (*himam*), and among them are those who ride the noble steeds of deeds (*a'mal*). For this reason, we have made them two classes: the first and the second.\n\nThese masters of the Mounted Ones are the Individuals (*al-Afrad*) in this Path. They, may Allah be pleased with them, are of various classes: among them are the Poles (*al-Aqtab*), the Imams (*al-A'imma*), the Pegs (*al-Awtad*), the Substitutes (*al-Abdal*), the Chiefs (*al-Nuqaba'*), the Nobles (*al-Nujaba'*), the Rajabiyyun, and the Individuals (*al-Afrad*). I have seen and associated with groups from every one of these classes in the lands of the Maghrib, the Hijaz, and the East.\n\nThis chapter is specific to the Individuals, who are a group outside the sole authority of the Pole; the Pole has no jurisdiction over them. Their number starts from three and goes upwards among the Individuals. Neither they nor anyone else has a footing in what is below the first Individual, which is the Three. For the Oneness (الأحدية) is the One belonging to the Divine Essence (ذات الحق), and the Two is for the Level (المرتبة), which is the Unity of Divinity (توحيد الألوهية), and the Three is the first existence of the Cosmos (الكون) from Allah.\n\nThe Individuals among the angels are the Angels Veiled in Awe (الملائكة المهيمون) in the Beauty and Majesty of Allah, who are outside the realm of the subjugated and governing angels that exist in the world of recording and inscription, extending from the Pen and the Intellect downwards. The Individuals among humankind are like the Veiled Ones among the angels. The first of the Individuals is the Three, and the Prophet, peace be upon him, said: \"The three are mounted.\" Thus, the first of the Mounted Ones is the Three, and those above that.\n\n### What the Individuals Possess of Presences, Names, and Supplies\n\nThey possess, among the Divine Presences (الحضرات الإلهية), the Presence of Singularity (الحضرة الفردانية), and in it they are distinguished. Among the Divine Names (الأسماء الإلهية), they possess the Unique One (الفرد). The supplies (المواد) that descend upon their hearts come from the station from which they descend upon the Angels Veiled in Awe.\n\nThis is why their station and their actions are unknown, just as Moses, peace be upon him, objected to Khidr, despite Allah testifying to Moses about Khidr, informing him of his rank, purifying him, and taking a covenant from him when he sought his companionship. Khidr knew that Moses, peace be upon him, had no taste (*dhawq*) in the station upon which Khidr stood, just as Khidr had no taste in the knowledge that Allah taught Moses. However, Khidr’s station does not permit objection to any of Allah's creation, due to a specific witnessing (مشاهدة) he possesses. The station of Moses and the Messengers permits objection, insofar as they are Messengers, regarding everything they see that falls outside what they were sent with.\n\nThe proof for what we have stated is Khidr’s saying to Moses, peace be upon him: <<وَكَيْفَ تَصْبِرُ عَلَى مَا لَمْ تُحِطْ بِهِ خُبْرًا>> (And how can you be patient about that which you have not encompassed with [sufficient] knowledge?). Had Khidr been a Prophet, he would not have said to him: \"that which you have not encompassed with [sufficient] knowledge.\" What he did was not from the station of Prophethood. He said to him, regarding the singularity of each of them in his station:\n\nKhidr said to Moses, peace be upon him: \"O Moses, I am upon a knowledge Allah taught me that you do not know, and you are upon a knowledge Allah taught you that I do not know.\"\n\nThey parted and were distinguished by the act of objection.\n\n### The Individuals Have Priority in Matters\n\nObjection is not the concern of the Individuals, for they have priority in matters; they are objected to, but they do not object. Al-Junayd said: \"No one reaches the degree of Reality (الحقيقة) until a thousand truthful ones (*siddiq*) testify against him that he is a heretic (*zindiq*).\"\n\n### The Individuals are the Masters of Esoteric Knowledge\n\nThey are the masters of the knowledge about which Ali ibn Abi Talib, may Allah be pleased with him, used to strike his hand upon his chest and sigh, saying: \"Indeed, here is abundant knowledge, if only I could find bearers for it.\"\n\nHe was one of the Individuals, and no one else in his time was heard saying this except Abu Hurayra, who mentioned something similar.\n\nAl-Bukhari recorded in his *Sahih* that Abu Hurayra said: \"I carried two vessels of knowledge from the Prophet, peace be upon him. As for one, I spread it among you. As for the other, if I were to spread it, this throat [esophagus] would be cut from me.\"\n\nThe esophagus (*al-bul'um*) is the passage for food. Abu Hurayra mentioned that he carried it from the Messenger of Allah, peace be upon him, so he was a transmitter (*naqil*) without direct taste (*dhawq*), but it was knowledge because he heard it from the Messenger of Allah, peace be upon him. We, however, speak of those who are granted the very eye of understanding (*ayn al-fahm*) in Allah’s speech within themselves—and that is the knowledge of the Individuals.\n\nAmong the Individuals was Abdullah ibn Abbas, known as \"The Sea\" due to the vastness of his knowledge. Regarding the saying of Allah, the Mighty and Majestic: <<اللَّهُ الَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ>> (Allah is He Who created seven heavens and of the earth the like thereof. The Command descends between them), he used to say: \"If I mentioned its interpretation, you would stone me,\" and in another narration: \"you would say I am an unbeliever.\"\n\nIt is to this knowledge that Ali ibn al-Husayn ibn Ali ibn Abi Talib, Zayn al-Abidin, peace be upon them, was referring when he said—and I do not know whether these lines are his own or if he quoted them:\n\n> O Lord, how much is the essence of knowledge, if I were to disclose it,\n> I would be told: \"You are among those who worship idols.\"\n> And Muslim men would deem my blood lawful,\n> Seeing the ugliest of their actions as beautiful.\n\nBy saying \"worship idols,\" he drew attention to his intended meaning, which is the interpretation (تأويل) of the Prophet’s saying, peace be upon him: \"Indeed, Allah created Adam upon His form,\" by referring the pronoun back to Allah the Exalted, which is one of its possible meanings.\n\n### The Problem of Esoteric Knowledge\n\nBy Allah, O my brother, be fair in what I say to you. Undoubtedly, you have agreed with me that everything authentically reported from the Messenger of Allah, peace be upon him, concerning the descriptions of his Lord—such as joy, laughter, wonder, cheerfulness, anger, hesitation, dislike, love, and yearning—must be believed and affirmed.\n\nNow, if breaths [of grace] from this Divine Presence (الحضرة الإلهية) were to blow upon the hearts of the saints (الأولياء) through unveiling (كشف), theophany (تجلي), and Divine instruction, such that they know by Allah’s informing and witness by Allah’s witnessing these matters expressed by these words upon the tongue of the Messenger—and you and I have affirmed all of this—if this saint were to express similar things concerning Allah the Exalted, would you not declare him a heretic (*zindiq*), as Al-Junayd said? Would you not say: \"This is an anthropomorphist (*mushabbih*), this is an idol worshipper! How can he describe the Real (الحق) with what is used to describe the created being? Idol worshippers have done no more than this,\" as Ali ibn al-Husayn said? Would you not kill him or issue a legal ruling for his execution, as Ibn Abbas said?\n\nBy what means did you believe and submit when you heard such things from the Messenger of Allah, peace be upon him, concerning Allah—matters that rational proofs deem impossible, and whose interpretation was prevented? Yet the Ash'ari school interpreted them in ways that they claimed were transcendent (تنزيه). Where is the fairness? Why did you not say that the Power [of Allah] is vast enough to grant this saint the same secret knowledges (علوم الأسرار) that were granted to the Prophet? For that is not among the exclusive characteristics of Prophethood, nor did the Lawgiver restrict this door upon his community or speak against it. Rather, he said:\n\n\"If there are inspired ones (*muhaddathun*) in my community, then Umar is one of them.\"\n\nThe Prophet, peace be upon him, thus affirmed that there are those who are inspired who are not Prophets, and they may be inspired with such knowledge, for it is outside the legislation of rulings concerning the lawful and the unlawful. That legislation is exclusive to Prophethood, but the access to the profound Divine sciences (غوامض العلوم الإلهية) is not exclusive to the Prophethood of Legislation; rather, it flows among Allah’s servants, whether Messenger, saint, follower, or followed.\n\nO saint, where is your fairness? Is this not found among the jurists and the masters of speculation, who are the Pharaohs of the saints and the deceivers of Allah’s righteous servants? Allah says to those who act according to what He has legislated for them that Allah knows it and takes charge of teaching them with knowledges produced by their deeds. The Exalted said: <<وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ>> (And fear Allah; and Allah teaches you. And Allah is Knowing of all things). And He said: <<إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا>> (If you fear Allah, He will grant you a criterion [by which to judge between right and wrong]).\n\n### Umar ibn al-Khattab and Ibn Hanbal\n\nAmong the Poles of this station are Umar ibn al-Khattab and Ahmad ibn Hanbal. For this reason, the Prophet, peace be upon him, said concerning Umar ibn al-Khattab, mentioning the strength Allah granted him:\n\n\"O Umar, the Devil never met you on a path but he took a path other than yours!\"\n\nThis indicates his infallibility (*isma*) by the testimony of the infallible one. We know that the Devil only ever leads us to falsehood, which is other than Umar ibn al-Khattab’s path. Thus, Umar only followed the paths of the Real (الحق) by textual evidence. He was one of those whom the blame of the blamers did not deter in all his courses concerning Allah. The Real has a powerful assault, and because the Real is difficult to attain and powerful, souls cannot bear it or accept it; rather, they reject it. For this reason, the Prophet, peace be upon him, said:\n\n\"The Truth left Umar no friend.\"\n\nAnd the Prophet, peace be upon him, spoke the truth—meaning both outwardly and inwardly. Outwardly, due to the lack of fairness, the love of leadership, the departure of man from his servitude (عبودية), his preoccupation with what does not concern him, and his failure to devote himself to what he was called to: occupying himself with his own soul and its defects rather than the defects of others. Inwardly, the Truth left Umar no friend in his heart, for he had no attachment except to Allah.\n\n### The Tragedy of Esoteric Knowledge\n\nThen comes the greater calamity: if you tell one of these deniers to occupy himself with his own soul, he says to you: \"I am only acting to protect the religion of Allah and out of zeal for it, and zeal for Allah is part of faith,\" and similar statements. He does not calm down or consider whether it is possible—meaning, whether Allah might have informed a saint of His saints of what He causes to occur in His creation, like Khidr, and taught him knowledge from His Presence (علم لدني), the expression of which takes the same forms spoken by the Messenger, peace be upon him, just as Khidr said: <<وَمَا فَعَلْتُهُ عَنْ أَمْرِي>> (And I did not do it of my own accord).\n\nThis denier claims to believe in these expressions when they come from the Messenger of Allah, peace be upon him. By Allah, if he truly believed in them, he would not deny them to this saint, because the Lawgiver did not deny their application to the Divine Presence (جناب الحق)—such as settling (*istawa*), descending (*nuzul*), companionship (*ma'iyya*), laughter, joy, cheerfulness, wonder, and the like. It was never reported from the Prophet, peace be upon him, that he restricted these expressions to anyone among Allah’s servants. Rather, he informed us that Allah says: <<لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ>> (Indeed, in the Messenger of Allah you have an excellent example).\n\nThus, He opened the door for us and encouraged us to emulate him, peace be upon him, and said: <<فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ>> (So follow me, [and] Allah will love you). This is part of following and emulating him.\n\nPart of this emulation is that when a true influx (*warid haqq*) comes to us from the Real, the Glorious, and we learn from His Presence a knowledge containing mercy with which Allah has favored us and cared for us—since we are upon clear evidence from our Lord, followed by a witness from us, which is our adherence to his Sunna and what he legislated for us, without violating any of it or committing any transgression by making lawful what Allah has forbidden or forbidding what He has made lawful—we then seek for that knowledge which we learned from the side of the Real, expressions similar to these prophetic phrases, so that we may articulate it with them. This is especially true if we are asked about any of it, because Allah informed us that whoever possesses this characteristic calls to Allah upon clear insight (بصيرة).\n\nIt is part of the commanded emulation of the Messenger of Allah, peace be upon him, that we apply these prophetic words to those meanings. For if there were an expression clearer than them, he, peace be upon him, would have used it, as he was commanded to clarify what was revealed to us. We do not deviate to other expressions, due to our desire for clarity, while being certain of <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing whatever like unto Him). For if we deviated to an expression other than these, we would implicitly claim that we are more knowledgeable of Allah's right and more transcendent (*munazzah*) than the Messenger of Allah, peace be upon him, and this is the worst possible lack of proper conduct. Furthermore, the meaning is bound to be corrupted for the listener, since the word you deviated to—away from the word of the most eloquent of people, the Messenger of Allah, peace be upon him, and the Quran—does not indicate that meaning by correspondence.\n\nThe Lawgiver legislated emulation, yet this denier and excommunicator of those who express such things fails to consider all of this. This is due to one of two reasons, or both: if he is knowledgeable, it is due to envy that has arisen in him, as the Exalted said: <<حَسَدًا مِنْ عِنْدِ أَنْفُسِهِمْ>> (Out of envy from their own souls). If he is ignorant, then he is even more ignorant of Prophethood.\n\n### The Poles of the Individuals and Their Specific Characteristics\n\nO saint, we met more than seventy men who were Poles of this station on Mount Abu Qubays in Mecca in a single day. This class has no disciples in their path whatsoever, nor do they guide anyone through the method of spiritual training (*tarbiya*). They only offer counsel, advice, and the dissemination of knowledge. Whoever is guided takes hold of it.\n\nIt is said that Abu al-Su'ud ibn al-Shibl was one of them. I did not meet him or see him, but I smelled a sweet fragrance and a perfumed breath from him. I was informed that Abd al-Qadir al-Jili, who was the just Pole of his time, testified to Muhammad ibn Qa'id al-Awani having this station. This was conveyed to me, and the responsibility rests with the conveyor. Ibn Qa'id claimed that he saw no foot ahead of him there except the foot of his Prophet. This only occurs for the Individuals (*Afrad*) of the time. If he were not one of the Individuals, he would necessarily see the foot of the Pole of his time ahead of him, in addition to the foot of his Prophet, if he were an Imam. If he were a Peg (*Watad*), he would see three feet ahead of him, and if he were a Substitute (*Badal*), he would see four feet, and so on. However, he must necessarily be in the station of following (*maqam al-ittiba'*).\n\nIf he does not stand in the Presences of Following, and is diverted from the right side of the path, between the private chamber and the road, then he sees no foot ahead of him. That is the path of the Specific Aspect (الوجه الخاص) which extends from the Real (الحق) to every existent thing. It is from that Specific Aspect that these knowledges are unveiled to the saints, which are then denied, and for which they are declared heretics and unbelievers by those who believe in the very same knowledges when they come from the Messengers. These are the very knowledges we mentioned earlier.\n\nThe masters of this station possess the power of disposal and administration (*al-tasarruf*) in the world. The first class of these Individuals abandoned the administration of creation to Allah, despite having the ability to do so and Allah entrusting it to them—an enablement, not a command, but an offer. So they wore the veil, entered the curtains of the Unseen, and concealed themselves behind the veils of custom. They adhered to servitude (العبودة) and need (*al-iftiqar*). They are the refined youths, the Blameworthy Ones (الملامتية), the hidden, the innocent. Abu al-Su'ud was one of them. He, may Allah have mercy on him, was one of those who fulfilled Allah’s command in His saying: <<فَاتَّخِذْهُ وَكِيلًا>> (So take Him as a Trustee). The Trustee has the power of disposal. If he were commanded, he would obey the command—this is their nature.\n\nAs for Abd al-Qadir, the apparent state of his affairs indicates that he was commanded to exercise administration, which is why it became manifest through him. This is the assumption regarding people like him. As for Muhammad al-Awani, he mentioned that Allah granted him the power of administration, and he accepted it and exercised it, though he was not commanded. Thus, he was tested, and he lost the degree of gnosis by which Abu al-Su'ud surpassed him.\n\nAbu al-Su'ud spoke with the tongue of the first class of the Mounted Ones. We named them Poles (*Aqtab*) due to their steadfastness and because this station, meaning the station of servitude, revolves around them. I did not mean by their being Poles that they have a group under their command, over whom they are leaders and Poles. They are too noble and elevated for that. They have no leadership (*riyasa*) whatsoever in their souls, due to their realization of their servitude.\n\nThey had no Divine command to take precedence, so no such command came to them that would necessitate their obedience, given their realization of servitude. They would then be upholding it in the station of servitude by obeying the command of their Master. However, when given a choice or an offer, or when seeking to attain the station, only those who have not fully realized the servitude for which they were created will manifest it.\n\nO saint, I have informed you in this chapter of their stations. There remains the definition of their principles and the specification of the conditions of the governing Poles of the second class among them. We shall mention that later, if Allah wills. And Allah speaks the Truth, and He guides to the Way. There is no Lord other than Him.",
    "ur": "(سوار قطب (الأقطاب الركبان) کے پہلے اور دوسرے طبقے کی معرفت میں تیسواں باب)\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)\n\nبے شک اللہ کے کچھ بندے ہیں جو سوار ہوئے\nاعمال کی تیز رفتار اونٹنیوں پر تاریک رات میں\n\nاور ان کی عاجزی کی ہمتیں (الهمم) بلند ہوئیں\nاس عزیز کی طرف جو یکتا اور علیم ہے\n\nپس اس نے انہیں چن لیا اور ان پر تجلی (التجلی) فرمائی\nاور ساقی کے جاموں سے ان کا استقبال کیا\n\nجو شخص عاجزی میں بلندی رکھتا ہو\nبے شک وہ عظیم (الحق) کی قدر جانتا ہے\n\nاگر تو حادث (مخلوق) کے مرتبے کی تحقیق کرے\nتو اس میں صرف قدیم (الحق) ہی ظاہر ہوتا ہے\n\nبے شک اللہ کے پاس بہت سے علوم ہیں\nرسول، نبی اور تقسیم کرنے والے میں\n\nوہ ذات میں اتنے لطیف ہیں کہ انہیں\nسانسوں کی دنیا، نسیم کی سانسوں سے بھی نہیں پا سکتی\n\n### [افراد (الأفراد) ہی سوار ہیں]\n\nاللہ تمہاری تائید کرے، جان لو کہ عرف میں تیز رفتار اونٹنیوں (النجب) کے مالک ہی سوار (الركبان) ہیں۔ شاعر نے کہا:\n\nفليت لي بهمو قوما إذا ركبوا *** شنوا الإغارة فرسانا وركبانا\n(کاش میرے لیے ان کے ساتھ ایسی قوم ہوتی کہ جب وہ سوار ہوتے *** تو گھڑ سواروں اور سواروں کی طرح حملہ کرتے)\n\nگھڑ سوار (الفرسان) گھوڑوں پر سوار ہوتے ہیں اور سوار (الركبان) اونٹوں پر۔ گھوڑے عام طور پر تمام گروہ استعمال کرتے ہیں، خواہ وہ عجمی ہوں یا عربی، لیکن تیز رفتار اونٹ (الهجن) صرف عرب استعمال کرتے ہیں۔ اور عرب فصاحت، شجاعت اور کرم کے مالک ہیں۔ چونکہ یہ صفات اس گروہ پر غالب تھیں، اس لیے ہم نے انہیں سوار (الركبان) کہا۔ ان میں سے کچھ ہمتوں کی تیز رفتار اونٹنیوں (نجب الهمم) پر سوار ہوتے ہیں اور کچھ اعمال کی تیز رفتار اونٹنیوں (نجب الأعمال) پر۔ اسی لیے ہم نے انہیں پہلی اور دوسری دو طبقات میں تقسیم کیا۔ یہ سوار (الركبان) اس طریقے میں افراد (الأفراد) ہیں۔ یہ (رضی اللہ عنہم) مختلف طبقات پر ہیں: ان میں اقطاب (الأقطاب) ہیں، ائمہ (الأئمة) ہیں، اوتاد (الأوتاد) ہیں، ابدال (الأبدال) ہیں، نقباء (النقباء) ہیں، نجباء (النجباء) ہیں، رجبیون (الرجبيون) ہیں، اور افراد (الأفراد) ہیں۔ ان میں سے کوئی بھی گروہ ایسا نہیں جس سے میں نے ملاقات نہ کی ہو اور ان کے ساتھ مغرب (اندلس) اور حجاز و مشرق کے علاقوں میں وقت نہ گزارا ہو۔ یہ باب افراد (الأفراد) کے لیے مخصوص ہے، اور یہ ایک ایسا گروہ ہے جو قطب (القطب) کے حکم سے باہر ہے۔ قطب کا ان پر کوئی تصرف (تصرف) نہیں ہوتا۔ ان کی تعداد تین سے شروع ہو کر اس سے اوپر کے افراد (الأفراد) تک جاتی ہے۔ پہلے فرد (الفرد الأول) جو کہ تین ہے، اس سے نیچے ان کا یا کسی اور کا کوئی قدم نہیں ہے۔ کیونکہ احدیت (الأحدية) یعنی واحد (الواحد) ذات حق (الحق) کے لیے ہے، اور دو (الاثنان) مرتبے کے لیے ہے جو توحید الوہیت ہے۔ اور تین (الثلاثة) اللہ کی طرف سے وجودِ کون (الكون) کی پہلی ابتدا ہے۔ فرشتوں میں افراد (الأفراد) وہ فرشتے ہیں جو اللہ کے جمال اور جلال میں مستغرق (المهيمون) ہیں، اور وہ مسخر اور مدبر فرشتوں سے باہر ہیں جو تدوین اور تسطیر (لکھنے اور ترتیب دینے) کی دنیا میں ہیں، اور وہ قلم (القلم) اور عقل (العقل) سے لے کر اس سے نیچے تک ہیں۔ انسانوں میں افراد (الأفراد) فرشتوں میں مستغرقین (المهيمة) کی طرح ہیں۔ پہلے افراد تین ہیں، اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"تین سوار ہوئے (الثلاثة ركب)\"۔ پس پہلا سوار تین ہے اور اس سے اوپر تک۔\n\n### [افراد (الأفراد) کے لیے حضرات (الحضرات)، اسماء (الأسماء) اور مواد (المواد)]\n\nان کے لیے الٰہی حضرات (الحضرات الإلهية) میں حضرۃ فردانیۃ (الحضرة الفردانية) ہے، اور اسی میں وہ ممتاز ہوتے ہیں۔ اور الٰہی اسماء (الأسماء الإلهية) میں الفرد (یکتا) ہے۔ اور ان کے دلوں پر وارد ہونے والے مواد (المواد) اسی مقام سے آتے ہیں جہاں سے مستغرق فرشتوں (الأملاك المهيمة) پر وارد ہوتے ہیں۔ اسی وجہ سے ان کے مقام اور ان کے افعال کو سمجھا نہیں جاتا، جیسا کہ موسیٰ علیہ السلام نے خضر علیہ السلام پر اعتراض کیا تھا، حالانکہ اللہ تعالیٰ نے موسیٰ علیہ السلام کے سامنے ان کی گواہی دی تھی، ان کے مرتبے سے آگاہ کیا تھا، ان کا تزکیہ کیا تھا، اور ان سے عہد لیا تھا جب موسیٰ علیہ السلام نے ان کی صحبت چاہی تھی۔ جب خضر علیہ السلام نے جان لیا کہ موسیٰ علیہ السلام کو اس مقام کا ذوق نہیں ہے جس پر خضر ہیں، جیسا کہ خضر کو اس علم کا ذوق نہیں ہے جو اللہ نے موسیٰ علیہ السلام کو سکھایا تھا، سوائے اس کے کہ خضر کا مقام کسی بھی مخلوق پر اعتراض کی اجازت نہیں دیتا، کیونکہ وہ ایک خاص مشاہدہ (مشاهدة خاصة) پر فائز ہیں۔ جبکہ موسیٰ علیہ السلام اور رسولوں کا مقام اعتراض کی اجازت دیتا ہے، صرف اس حیثیت سے کہ وہ رسول ہیں، ہر اس چیز پر جو وہ اس سے باہر دیکھتے ہیں جس کے ساتھ وہ بھیجے گئے ہیں۔ ہمارے اس موقف کی دلیل خضر علیہ السلام کا موسیٰ علیہ السلام سے یہ قول ہے:\n\nوَكَيْفَ تَصْبِرُ عَلى‏ ما لَمْ تُحِطْ به خُبْراً\n(اور تم اس چیز پر کیسے صبر کر سکتے ہو جس کا تمہیں مکمل علم نہیں دیا گیا؟)\n\nاگر خضر نبی ہوتے تو وہ ان سے یہ نہ کہتے کہ \"جس کا تمہیں مکمل علم نہیں دیا گیا\"۔ پس جو کچھ انہوں نے کیا وہ نبوت کے مقام سے نہیں تھا۔ اور جب دونوں اپنے اپنے مقام پر الگ ہوئے تو خضر نے موسیٰ علیہ السلام سے کہا:\n\n\"اے موسیٰ! میں ایک ایسے علم پر ہوں جو اللہ نے مجھے سکھایا ہے اور تم اسے نہیں جانتے، اور تم ایک ایسے علم پر ہو جو اللہ نے تمہیں سکھایا ہے اور میں اسے نہیں جانتا۔\"\n\nاور وہ اعتراض کی وجہ سے جدا اور ممتاز ہو گئے۔\n\n### [افراد (الأفراد) کو معاملات میں اولیت حاصل ہے]\n\nپس اعتراض کرنا افراد (الأفراد) کا کام نہیں ہے۔ انہیں معاملات میں اولیت حاصل ہے، لہٰذا ان پر اعتراض کیا جاتا ہے، لیکن وہ اعتراض نہیں کرتے۔ جنید (الجنید) نے فرمایا: \"کوئی شخص حقیقت (الحقيقة) کے درجے کو نہیں پہنچتا جب تک کہ ہزار صدیق اس کے بارے میں یہ گواہی نہ دیں کہ وہ زندیق ہے\"۔ اور یہ اس لیے ہے کہ وہ اللہ کی طرف سے وہ کچھ جانتے ہیں جو دوسرے نہیں جانتے۔\n\n### [افراد (الأفراد) علم باطن (العلم الباطن) کے حامل ہیں]\n\nاور وہ اس علم کے حامل ہیں جس کے بارے میں علی بن ابی طالب رضی اللہ عنہ اپنے سینے پر ہاتھ مار کر اور آہ بھر کر فرمایا کرتے تھے:\n\n\"بے شک یہاں بہت سے علوم ہیں، کاش میں ان کا بوجھ اٹھانے والے پاتا۔\"\n\nپس وہ افراد (الأفراد) میں سے تھے، اور ان کے زمانے میں یہ بات ان کے علاوہ کسی اور سے نہیں سنی گئی، سوائے ابوہریرہ کے، جنہوں نے اسی طرح کی بات ذکر کی۔\n\nامام بخاری نے اپنی صحیح میں ان سے روایت کیا ہے کہ انہوں نے فرمایا: \"میں نے رسول اللہ صلی اللہ علیہ وسلم سے دو طرح کے علم حاصل کیے ہیں۔ ایک تو میں نے تم میں پھیلا دیا، اور اگر میں دوسرا پھیلاتا تو میری یہ شہ رگ (البلعوم) کاٹ دی جاتی۔\"\n\nبلعوم (البلعوم) خوراک کی نالی ہے۔ ابوہریرہ نے ذکر کیا کہ انہوں نے یہ رسول اللہ صلی اللہ علیہ وسلم سے حاصل کیا تھا، لہٰذا وہ ذوق (ذوق) کے بغیر صرف ناقل تھے، لیکن یہ علم تھا کیونکہ انہوں نے اسے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا۔ اور ہم تو اس شخص کے بارے میں بات کر رہے ہیں جسے اللہ تعالیٰ کے کلام میں خود فہم کی آنکھ (عين الفهم) عطا کی گئی ہو، اور یہی افراد (الأفراد) کا علم ہے۔ عبداللہ بن عباس، جنہیں ان کے علم کی وسعت کی وجہ سے \"البحر\" (سمندر) کا لقب دیا گیا تھا، وہ بھی افراد میں سے تھے۔ وہ اللہ عزوجل کے اس قول کے بارے میں فرماتے تھے:\n\nاللَّهُ الَّذِي خَلَقَ سَبْعَ سَماواتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ\n(اللہ ہی ہے جس نے سات آسمان پیدا کیے اور زمین میں سے بھی ان کے مانند۔ حکم ان کے درمیان نازل ہوتا ہے)\n\nاگر میں اس کی تفسیر بیان کروں تو تم مجھے سنگسار کر دو گے، اور ایک روایت میں ہے کہ تم کہو گے کہ میں کافر ہوں۔ اور اسی علم کی طرف علی بن ابی طالب کے بیٹے حسین کے بیٹے زین العابدین (علیہم الصلاۃ والسلام) اشارہ کرتے تھے، جب وہ فرماتے تھے (مجھے نہیں معلوم کہ یہ ان کا اپنا قول ہے یا انہوں نے اسے بطور مثال پیش کیا):\n\nيا رب جوهر علم لو أبوح به *** لقيل لي أنت ممن يعبد الوثنا\n(اے رب! علم کے کتنے ہی ایسے جوہر ہیں کہ اگر میں انہیں ظاہر کر دوں *** تو مجھ سے کہا جائے گا کہ تم بتوں کی پوجا کرنے والوں میں سے ہو)\n\nولاستحل رجال مسلمون دمي *** يرون أقبح ما يأتونه حسنا\n(اور مسلمان مرد میرا خون حلال کر لیں گے *** وہ اس بدترین کام کو جو وہ کرتے ہیں، اچھا سمجھیں گے)\n\nانہوں نے \"بتوں کی پوجا کرنے والوں میں سے\" کہہ کر اپنے مقصد کی طرف متوجہ کیا، جس کا تعلق نبی اکرم صلی اللہ علیہ وسلم کے اس قول کی تاویل سے ہے:\n\nإن الله خلق آدم على صورته\n(بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا)\n\nجس میں ضمیر (صورته) کو اللہ تعالیٰ کی طرف لوٹایا گیا ہے، اور یہ اس کے ممکنہ معانی میں سے ایک ہے۔\n\n### [علم باطن (العلم الباطن) کا مسئلہ]\n\nاللہ کی قسم اے میرے بھائی! جو میں تم سے کہتا ہوں اس میں انصاف کرو۔ اس میں کوئی شک نہیں کہ تم میرے ساتھ اس بات پر متفق ہو کہ رسول اللہ صلی اللہ علیہ وسلم سے جو بھی احادیث صحیح ثابت ہیں جن میں آپ نے اپنے رب تعالیٰ کو خوشی (الفرح)، ہنسنے (الضحك)، تعجب (التعجب)، بشاشت (التبشبش)، غضب (الغضب)، تردد (التردد)، کراہت (الكراهة)، محبت (المحبة) اور شوق (الشوق) جیسی صفات سے متصف کیا ہے، ان سب پر ایمان لانا اور ان کی تصدیق کرنا واجب ہے۔ اب اگر اس الٰہی حضرۃ (الحضرة الإلهية) سے کشف (الکشف)، تجلی (التجلی) اور الٰہی تعریف کی ہوائیں اولیاء کے دلوں پر چلیں، اس طرح کہ وہ اللہ کے بتانے سے جانیں اور اللہ کے دکھانے سے ان امور کا مشاہدہ کریں جنہیں رسول کی زبان پر ان الفاظ سے تعبیر کیا گیا ہے، اور میرا اور تمہارا ان سب پر ایمان ہے، تو کیا جب یہی باتیں یہ ولی اللہ تعالیٰ کے حق میں بیان کرتا ہے، تو کیا تم اسے زندیق نہیں کہتے، جیسا کہ جنید نے کہا؟ کیا تم یہ نہیں کہتے کہ یہ مشبہ (تشبیہ دینے والا) ہے، یہ بت پرست ہے؟ اس نے حق (الحق) کو اس چیز سے کیسے متصف کیا جس سے مخلوق کو متصف کیا جاتا ہے؟ بت پرستوں نے اس سے زیادہ کیا ہی کیا ہے، جیسا کہ علی بن الحسین نے کہا؟ کیا تم اسے قتل نہیں کرتے یا اس کے قتل کا فتویٰ نہیں دیتے، جیسا کہ ابن عباس نے کہا؟ تو تم نے کس چیز کی بنا پر ایمان لایا اور تسلیم کیا جب تم نے یہ باتیں رسول اللہ صلی اللہ علیہ وسلم سے اللہ کے حق میں سنیں، جو عقلی دلائل کے نزدیک محال ہیں اور جن کی تاویل سے منع کیا گیا ہے؟ اور اشعری نے اپنے زعم میں تنزیہ (پاکیزگی) کے پہلو سے ان کی تاویل کی ہے۔ تو انصاف کہاں ہے؟ تم نے یہ کیوں نہیں کہا کہ قدرت وسیع ہے کہ وہ اس ولی کو بھی اسرار کے علوم عطا کر دے جو اس نے نبی کو عطا کیے؟ کیونکہ یہ نبوت کی خصوصیات میں سے نہیں ہے، اور شارع نے اپنی امت پر یہ دروازہ بند نہیں کیا، نہ ہی اس بارے میں کچھ کہا، بلکہ فرمایا:\n\n\"اگر میری امت میں محدث (الہام پانے والے) ہیں تو عمر ان میں سے ہیں۔\"\n\nپس نبی صلی اللہ علیہ وسلم نے یہ ثابت کر دیا کہ ایسے لوگ ہیں جنہیں الہام ہوتا ہے جو نبی نہیں ہیں، اور انہیں اسی طرح کا الہام ہو سکتا ہے، کیونکہ یہ حلال و حرام کے احکام کی تشریع (قانون سازی) سے باہر ہے۔ تشریع (التشريع) نبوت کی خصوصیات میں سے ہے، لیکن الٰہی علوم کے اسرار پر مطلع ہونا نبوت تشریع کی خصوصیات میں سے نہیں ہے، بلکہ یہ اللہ کے بندوں میں جاری ہے، خواہ وہ رسول ہو، ولی ہو، تابع ہو یا متبوع۔ اے ولی! تمہارا انصاف کہاں ہے؟ کیا یہ چیز فقہاء اور اہل فکر میں موجود نہیں ہے جو اولیاء کے فرعون اور اللہ کے نیک بندوں کے دجال ہیں؟ اور اللہ تعالیٰ ہم میں سے اس شخص کے بارے میں فرماتا ہے جو اس کے لیے مقرر کردہ شریعت پر عمل کرتا ہے کہ اللہ اسے جانتا ہے اور اس کے اعمال سے پیدا ہونے والے علوم کے ذریعے اسے تعلیم دیتا ہے۔ اللہ تعالیٰ فرماتا ہے:\n\nوَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ\n(اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے، اور اللہ ہر چیز کا جاننے والا ہے)\n\nاور فرمایا:\n\nإِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقاناً\n(اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) پیدا کر دے گا)\n\n### [عمر بن خطاب اور ابن حنبل]\n\nاس مقام کے اقطاب (الأقطاب) میں سے عمر بن خطاب اور احمد بن حنبل ہیں۔ اسی لیے نبی اکرم صلی اللہ علیہ وسلم نے عمر بن خطاب کے بارے میں ان کی قوت کا ذکر کرتے ہوئے فرمایا:\n\n\"اے عمر! شیطان تمہیں جس راستے میں بھی ملا، اس نے تمہارے راستے کے علاوہ کوئی اور راستہ اختیار کیا!\"\n\nیہ معصوم (نبی) کی گواہی سے ان کی عصمت پر دلالت کرتا ہے۔ اور ہم جانتے ہیں کہ شیطان ہمیں کبھی بھی باطل کے علاوہ کسی اور طرف نہیں لے جاتا، اور وہ عمر بن خطاب کا راستہ نہیں تھا۔ پس عمر نص (النص) کے مطابق صرف حق کے راستوں پر چلتے تھے۔ وہ ان لوگوں میں سے تھے جنہیں اللہ کے معاملے میں کسی ملامت کرنے والے کی ملامت کا خوف نہیں ہوتا تھا، اور حق کی ایک دھاک ہوتی ہے۔ چونکہ حق مشکل، طاقتور اور نفوس پر بھاری ہوتا ہے، اس لیے نفوس اسے برداشت نہیں کرتے اور نہ ہی قبول کرتے ہیں، بلکہ اسے دور پھینک دیتے ہیں اور رد کر دیتے ہیں۔ اسی لیے نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n\n\"حق نے عمر کے لیے کوئی دوست نہیں چھوڑا\"\n\nاور نبی صلی اللہ علیہ وسلم نے سچ فرمایا، یعنی ظاہر اور باطن میں۔ ظاہر میں تو اس لیے کہ لوگوں میں انصاف کی کمی، ریاست کی محبت، انسان کا اپنی عبودیت (العبودية) سے نکل جانا، اور ان چیزوں میں مشغول ہونا جن سے اسے کوئی سروکار نہیں، اور اپنے نفس کے ساتھ مشغول ہونے اور لوگوں کے عیوب سے اپنے عیوب کو دور رکھنے کے لیے فارغ نہ ہونا۔ اور باطن میں، حق نے عمر کے دل میں کوئی دوست نہیں چھوڑا، پس ان کا تعلق صرف اللہ سے تھا۔\n\n### [علم باطن (العلم الباطن) کی مصیبت]\n\nپھر سب سے بڑی مصیبت یہ ہے کہ جب تم اس منکر گروہ میں سے کسی ایک سے کہتے ہو کہ اپنے نفس کے ساتھ مشغول ہو جاؤ، تو وہ تمہیں کہتا ہے کہ میں تو صرف اللہ کے دین کی حفاظت اور غیرت کے لیے کھڑا ہوں، اور اللہ کے لیے غیرت ایمان میں سے ہے۔ اور اسی طرح کی باتیں کرتا ہے، اور وہ خاموش نہیں ہوتا اور نہ ہی یہ دیکھتا ہے کہ کیا یہ ممکن ہے یا نہیں—یعنی کیا یہ ممکن ہے کہ اللہ اپنے کسی ولی کو ان چیزوں سے آگاہ کرے جو وہ اپنی مخلوق میں جاری کرتا ہے، جیسے خضر (علیہ السلام) کو، اور اسے اپنے پاس سے ایسے علوم سکھائے جن کا اظہار ان صیغوں سے کیا جائے جن سے رسول صلی اللہ علیہ وسلم نے بات کی، جیسا کہ خضر نے کہا:\n\nوَمَا فَعَلْتُهُ عَنْ أَمْرِي\n(اور میں نے یہ اپنے حکم سے نہیں کیا)\n\nاور یہ منکر اپنے زعم میں اس پر ایمان لاتا ہے جب یہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے آتا ہے۔ تو اللہ کی قسم! اگر وہ اس پر ایمان لاتا تو وہ اس ولی پر اس کا انکار نہ کرتا، کیونکہ شارع نے حق (الحق) کے معاملے میں ان الفاظ کے اطلاق سے منع نہیں کیا، جیسے استواء (عرش پر قائم ہونا)، نزول (اترنا)، معیت (ساتھ ہونا)، ہنسنا، خوش ہونا، بشاشت، تعجب، اور اسی طرح کے دیگر امور۔ اور آپ صلی اللہ علیہ وسلم سے کبھی یہ وارد نہیں ہوا کہ آپ نے اسے اللہ کے کسی بندے پر محدود کر دیا ہو، بلکہ اللہ نے ہمیں خبر دی ہے کہ وہ ہم سے فرماتا ہے:\n\nلَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ\n(بے شک تمہارے لیے رسول اللہ میں بہترین نمونہ ہے)\n\nپس اس نے ہمارے لیے دروازہ کھول دیا اور ہمیں آپ صلی اللہ علیہ وسلم کی پیروی کرنے کی ترغیب دی، اور فرمایا:\n\nفَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ\n(پس میری پیروی کرو، اللہ تم سے محبت کرے گا)\n\nاور یہ آپ کی پیروی اور نمونہ اختیار کرنے میں سے ہے۔ پس نمونہ اختیار کرنے میں سے یہ ہے کہ جب حق سبحانہ کی طرف سے ہم پر کوئی حق وارد ہو، اور ہم اس کی طرف سے ایسا علم جانیں جس میں رحمت ہو جو اللہ نے ہمیں عطا کی ہے اور عنایت ہو، کیونکہ ہم اس میں اپنے رب کی طرف سے واضح دلیل پر ہیں، اور اس کے بعد ہم میں سے ایک گواہ ہے، اور وہ ہماری سنت کی پیروی ہے اور جو کچھ اس نے ہمارے لیے مشروع کیا ہے، ہم نے ان میں سے کسی چیز کی خلاف ورزی نہیں کی اور نہ ہی اللہ کی حرام کردہ چیز کو حلال کیا یا حلال کو حرام کیا، تو ہم اس معلوم علم کے لیے جو ہم نے حق کی طرف سے جانا ہے، ان نبوی عبارات کی مثالیں تلاش کرتے ہیں تاکہ ہم اس کے ذریعے وضاحت کر سکیں، خاص طور پر جب ہم سے اس بارے میں کچھ پوچھا جائے۔ کیونکہ اللہ نے اس شخص کے بارے میں خبر دی ہے جس کی یہ صفت ہے کہ وہ بصیرت کے ساتھ اللہ کی طرف بلاتا ہے۔ پس رسول اللہ صلی اللہ علیہ وسلم کی پیروی میں جو حکم دیا گیا ہے، اس میں سے یہ ہے کہ ہم ان معانی پر یہ نبوی الفاظ استعمال کریں، کیونکہ اگر ان کے اظہار کے لیے کوئی زیادہ فصیح عبارت ہوتی تو آپ صلی اللہ علیہ وسلم اسے استعمال کرتے، کیونکہ آپ کو ہم پر نازل کردہ چیزوں کو واضح کرنے کا حکم دیا گیا ہے۔ اور ہم ان کے علاوہ کسی اور کی طرف مائل نہیں ہوتے، کیونکہ ہم بیان چاہتے ہیں، اس کے ساتھ کہ ہم لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں) کی حقیقت کو جانتے ہیں۔ کیونکہ اگر ہم کسی اور عبارت کی طرف مائل ہوئے تو ہم اس سے یہ دعویٰ کریں گے کہ ہم اللہ کے حق کو رسول اللہ صلی اللہ علیہ وسلم سے زیادہ جانتے ہیں اور زیادہ پاکیزہ بیان کرتے ہیں، اور یہ بدترین بے ادبی ہے۔ پھر یہ کہ سننے والے کے نزدیک معنی میں ضرور خلل آئے گا، کیونکہ وہ لفظ جس کی تم نے مخالفت کی، وہ فصیح ترین شخص یعنی رسول اللہ صلی اللہ علیہ وسلم کا لفظ تھا، اور قرآن مطابقت کے حکم سے اس معنی پر دلالت نہیں کرتا۔ پس ہمارے لیے پیروی کو مشروع کیا گیا، اور یہ منکر اور تکفیر کرنے والا شخص جو اس طرح کی بات کرتا ہے، ان سب پر غور کرنے سے غافل رہا۔ اور یہ دو وجوہات یا ان میں سے کسی ایک کی وجہ سے ہے: اگر وہ عالم ہے تو اس حسد کی وجہ سے جو اس کے اندر پیدا ہوا، اللہ تعالیٰ فرماتا ہے:\n\nحَسَداً مِّنْ عِندِ أَنفُسِهِمْ\n(اپنے نفسوں کے حسد کی وجہ سے)\n\nاور اگر وہ جاہل ہے تو وہ نبوت سے زیادہ جاہل ہے۔\n\n### [افراد (الأفراد) کے اقطاب (الأقطاب) اور ان کی خصوصیات]\n\nاے ولی! ہم مکہ میں جبل ابی قیس پر ایک ہی دن میں اس مقام کے ستر سے زیادہ اقطاب (الأقطاب) سے ملے ہیں۔ اس طبقے کا ان کے طریقے میں کوئی شاگرد نہیں ہوتا، اور نہ ہی وہ کسی کو تربیت کے ذریعے سلوک کراتے ہیں، لیکن ان کے لیے وصیت، نصیحت اور علم کی اشاعت ہوتی ہے۔ پس جسے توفیق ملتی ہے وہ اسے لے لیتا ہے۔ کہا جاتا ہے کہ ابو السعود بن الشبل ان میں سے تھے، اور میں ان سے نہیں ملا اور نہ ہی انہیں دیکھا، لیکن میں نے ان کی خوشبو اور معطر سانس محسوس کی۔ اور مجھے یہ بھی معلوم ہوا کہ عبدالقادر جیلی، جو اپنے وقت کے عادل قطب تھے، نے محمد بن قائد الاوانی کے لیے اس مقام کی گواہی دی تھی، یہ مجھے نقل کیا گیا ہے اور ذمہ داری نقل کرنے والے پر ہے۔ کیونکہ ابن قائد نے دعویٰ کیا کہ انہوں نے وہاں اپنے نبی کے قدم کے علاوہ کسی کا قدم اپنے آگے نہیں دیکھا، اور یہ صرف وقت کے افراد (أفراد الوقت) کے لیے ہو سکتا ہے۔ اگر وہ افراد میں سے نہیں تھے، تو انہیں اپنے نبی کے قدم کے علاوہ اپنے وقت کے قطب کا قدم بھی اپنے آگے دیکھنا چاہیے، اگر وہ امام تھے، اور اگر وہ وتد (الأوتاد) تھے تو انہیں تین قدم اپنے آگے دیکھنے چاہیے، اور اگر وہ بدل (الأبدال) تھے تو چار قدم، اور اسی طرح۔ لیکن اتباع (پیروی) کی حضرۃ (الحضرة) میں ایک مقام ہونا ضروری ہے۔ اگر وہ اتباع کی حضرات میں قائم نہ ہو اور اسے راستے کے دائیں طرف، خلوت گاہ اور راستے کے درمیان سے ہٹا دیا جائے، تو وہ اپنے آگے کوئی قدم نہیں دیکھتا، اور یہی خاص وجہ (الوجه الخاص) کا راستہ ہے جو حق (الحق) کی طرف سے ہر موجود کی طرف ہے۔ اور اسی خاص وجہ سے اولیاء پر یہ علوم منکشف ہوتے ہیں جن کا ان پر انکار کیا جاتا ہے اور جن کی وجہ سے انہیں زندیق کہا جاتا ہے اور ان کی تکفیر کی جاتی ہے، حالانکہ جب یہ علوم رسولوں کی طرف سے آتے ہیں تو یہی منکر ان پر ایمان لاتا ہے، اور یہ وہی علوم ہیں جن کا ہم نے ابھی ذکر کیا۔ اس مقام کے حاملین کو عالم میں تصریف (تصريف) اور تصرف (تصرف) حاصل ہوتا ہے۔ ان میں سے پہلا طبقہ وہ ہے جس نے اللہ کے لیے اپنی مخلوق میں تصرف کو ترک کر دیا، باوجود اس کے کہ انہیں اس کی قدرت حاصل تھی اور حق (الحق) نے انہیں یہ ولایت بطور تمکن (قدرت) کے دی تھی نہ کہ بطور امر (حکم) کے، بلکہ بطور عرض (پیشکش) کے۔ پس انہوں نے پردہ اوڑھ لیا اور غیب کے خیموں میں داخل ہو گئے اور عادات کے پردوں میں چھپ گئے، اور عبودیت (العبودية) اور افتقار (محتاجی) کو لازم پکڑا۔ یہ وہ نوجوان، شائستہ، ملامتیہ (الملامتية)، پوشیدہ اور بے گناہ لوگ ہیں۔ ابو السعود ان میں سے تھے، وہ (رحمہ اللہ) ان لوگوں میں سے تھے جنہوں نے اللہ کے اس حکم کی تعمیل کی:\n\nفَاتَّخِذْهُ وَكِيلًا\n(پس اسی کو کارساز بنا لو)\n\nکارساز (الوكيل) کو تصرف حاصل ہوتا ہے، پس اگر اسے حکم دیا جاتا تو وہ حکم کی تعمیل کرتا، یہ ان کا شیوہ ہے۔ جہاں تک عبدالقادر (جیلی) کا تعلق ہے، ان کے حال سے ظاہر ہوتا ہے کہ انہیں تصرف کا حکم دیا گیا تھا، اس لیے وہ ظاہر ہوئے، یہ ان جیسے لوگوں کے بارے میں ہمارا گمان ہے۔ اور محمد الاوانی نے ذکر کیا کہ اللہ نے انہیں تصرف عطا کیا تو انہوں نے اسے قبول کر لیا اور تصرف کرنے لگے، حالانکہ انہیں حکم نہیں دیا گیا تھا، پس وہ آزمائش میں پڑ گئے، اور ان کی معرفت (المعرفۃ) میں اس قدر کمی آئی جس قدر ابو السعود ان پر بلند تھے۔ پس ابو السعود نے سواروں (الركبان) کے پہلے طبقے کی زبان سے بات کی، اور ہم نے انہیں ان کے ثبات کی وجہ سے اقطاب (الأقطاب) کہا، اور اس لیے کہ یہ مقام، یعنی عبودیت (العبودية) کا مقام، ان کے گرد گھومتا ہے۔ میری مراد ان کی قطبیت سے یہ نہیں ہے کہ ان کے ماتحت کوئی جماعت ہو جس کے وہ سربراہ اور قطب ہوں، وہ اس سے زیادہ جلیل اور بلند ہیں۔ ان کے نفوس میں کوئی ریاست نہیں ہے کیونکہ وہ اپنی عبودیت (العبودية) کی حقیقت کو پا چکے ہیں۔\n\nاور انہیں تقدم کا کوئی الٰہی حکم نہیں ملا تھا جو ان پر وارد ہوتا اور ان پر اس کی اطاعت لازم ہوتی، کیونکہ وہ عبودیت (العبودية) کی حقیقت پر بھی قائم ہیں، لہٰذا وہ اپنے آقا کے حکم کی تعمیل کرتے ہوئے عبودیت کے مقام پر قائم رہتے ہیں۔ لیکن اختیار اور پیشکش کے ساتھ یا مقام کے حصول کی طلب کے ساتھ، تو اس میں وہی ظاہر ہوتا ہے جو اس عبودیت کی حقیقت کو نہیں پا سکا جس کے لیے اسے پیدا کیا گیا تھا۔ پس اے ولی! میں نے تمہیں اس باب میں ان کے مقامات سے آگاہ کر دیا ہے، اور ان کے اصولوں کی تعریف اور ان میں سے دوسرے طبقے کے مدبر اقطاب (الأقطاب المدبرين) کے حالات کا تعین باقی ہے۔ ہم ان شاء اللہ اس کا ذکر بعد میں کریں گے۔\n\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\n(اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)\n\nاس کے سوا کوئی رب نہیں۔",
    "fa": "(باب سی‌ام در شناخت طبقه اول و دوم از اقطاب سوارکاران)\n\n(به نام خداوند بخشنده مهربان)\n\nهمانا خداوند بندگانی دارد که سوار شدند *** بر شتران تیزروِ اعمال در شب تاریک\nو همت‌های فروتنی آنان را بالا برد *** به سوی عزیزی که از فرد دانا برتر است\nپس آنان را برگزید و بر ایشان تجلی (التجلی) کرد *** و با جام‌های ندیم (هم‌نشین) به استقبالشان آمد\nهر که در ذلت، رفعت داشته باشد *** او قدر و منزلت عظیم را می‌شناسد\nرتبه حادث (مخلوق)، اگر آن را محقق سازی *** تنها به واسطه قدیم (خداوند) در آن آشکار می‌شود\nهمانا خداوند دانش‌های فراوانی دارد *** در رسول و نبی و قسیم (تقسیم‌کننده)\nکه ذاتاً لطیف‌اند، پس درکشان نمی‌کند *** عالمِ نَفَس‌ها، مگر نَفَس‌های نسیم.\n\n### [افراد (الأفراد) همان سوارکاران (الركبان) هستند]\n\nبدان، خداوند تو را یاری کند، که صاحبان شتران تیزرو (نجب) در عرف، همان سوارکاران (الركبان) هستند. شاعر می‌گوید:\n\n> ای کاش برای من قومی بودند که چون سوار می‌شدند *** به عنوان سواره و سوارکار، حمله می‌آغازیدند\n\nسواران (الفرسان) کسانی هستند که بر اسب سوار می‌شوند و سوارکاران (الركبان) کسانی هستند که بر شتر سوار می‌شوند. اسب‌ها در عرف مورد استفاده همه طوایف از عجم و عرب قرار می‌گیرند، اما شتران تیزرو (الهجن) را فقط عرب‌ها به کار می‌برند. و عرب‌ها اربابان فصاحت، حماسه و کرم هستند. چون این صفات بر این طایفه غالب بود، آنان را سوارکاران (الركبان) نامیدیم. برخی از آنان بر شتران تیزروِ همت‌ها سوارند و برخی بر شتران تیزروِ اعمال. به همین دلیل آنان را به دو طبقه اول و دوم تقسیم کردیم. این صاحبان سوارکاران، همان افراد (الأفراد) در این طریقت هستند. آنان رضوان الله علیهم دارای طبقاتی هستند: برخی اقطاب (الأقطاب)، برخی ائمه (الأئمة)، برخی اوتاد (الأوتاد)، برخی ابدال (الأبدال)، برخی نقباء (النقباء)، برخی نجباء (النجباء)، برخی رجبیون (الرجبيون) و برخی افراد (الأفراد). و هیچ طایفه‌ای از آنان نیست مگر اینکه من برخی از ایشان را دیده‌ام و در بلاد مغرب و بلاد حجاز و شرق با آنان معاشرت داشته‌ام. این باب مختص به افراد (الأفراد) است. این طایفه‌ای است که از حکم قطب خارج است و قطب بر آنان تصرفی ندارد. تعداد آنان از سه نفر شروع می‌شود و به بالا می‌رود. هیچ‌یک از آنان و نه غیر آنان، در مرتبه‌ای پایین‌تر از فرد اول که همان سه نفر است، قدمی ندارند. زیرا احدیت (الأحدية) که واحد است، برای ذات حق (الحق) است و دو برای مرتبه است که توحید الوهیت است، و سه، اولین وجود کَوْن از جانب خداست. افراد (الأفراد) در میان فرشتگان، همان فرشتگان مهیم (المهيمون) هستند که در جمال و جلال خدا غرق شده‌اند و از فرشتگان مسخّر و مدبّر که در عالم تدوین و تسطیر هستند و از قلم و عقل تا پایین‌تر از آن قرار دارند، خارج‌اند. افراد از میان انسان‌ها نیز مانند مهیمان از میان فرشتگان هستند. اولین افراد، سه نفرند. و پیامبر (صلی الله علیه و سلم) فرمود: «سه نفر سوار شدند (الثلاثة ركب)». پس اولین سوارکاران (الركب) از سه نفر شروع می‌شود و به بالا می‌رود.\n\n### [آنچه افراد (الأفراد) از حضرات، اسماء و مواد دارند]\n\nو برای آنان از حضرات الهی، حضرت فردانیت (الحضرة الفردانية) است که در آن متمایز می‌شوند. و از اسماء الهی، اسم «فرد» است. و مواد (علوم) که بر قلب‌هایشان وارد می‌شود، از همان مقامی است که بر فرشتگان مهیمه (الأملاك المهيمة) وارد می‌گردد. به همین دلیل، مقام آنان و آنچه انجام می‌دهند، ناشناخته می‌ماند؛ همان‌گونه که موسی (علیه السلام) بر خضر (علیه السلام) خرده گرفت، با وجود اینکه خداوند برای موسی به مقام خضر شهادت داده بود و منزلت او را به موسی شناسانده و او را تزکیه کرده بود و هنگام همراهی از موسی عهد گرفته بود. چون خضر دانست که موسی (علیه السلام) در مقامی که خضر بر آن است، ذوقی ندارد، همان‌گونه که خضر نیز در علمی که خداوند به موسی آموخته بود، ذوقی نداشت. با این حال، مقام خضر به او اجازه نمی‌دهد که بر هیچ‌یک از خلق خدا اعتراض کند، به دلیل مشاهده خاصی که بر آن است. اما مقام موسی و رسولان، به دلیل رسالتشان، اجازه اعتراض می‌دهد در هر آنچه که خارج از شریعت ارسالی خود می‌بینند. دلیل آنچه ما در این باره گفته‌ایم، سخن خضر به موسی (علیه السلام) است: «و چگونه بر چیزی که از آن آگاهی نداری، صبر می‌کنی؟» (وَكَيْفَ تَصْبِرُ عَلى‏ ما لَمْ تُحِطْ به خُبْراً). اگر خضر پیامبر بود، به او نمی‌گفت: «از آن آگاهی نداری» (ما لَمْ تُحِطْ به خُبْراً). پس آنچه خضر انجام داد، از مقام نبوت نبود. و خضر در مورد انفراد هر یک از آنان در مقام خود که بر آن بودند، به موسی (علیه السلام) گفت:\n\nخضر به موسی (علیه السلام) گفت: «ای موسی، من بر علمی هستم که خداوند به من آموخته و تو آن را نمی‌دانی، و تو بر علمی هستی که خداوند به تو آموخته و من آن را نمی‌دانم.»\n\nو از هم جدا شدند و با انکار (موسی) از یکدیگر متمایز گشتند.\n\n### [افراد (الأفراد) در امور اولویت دارند]\n\nپس انکار کردن، شأن افراد (الأفراد) نیست. زیرا آنان در امور، اولویت دارند. دیگران بر آنان انکار می‌کنند، اما آنان انکار نمی‌کنند. جنید می‌گوید: «هیچ‌کس به درجه حقیقت نمی‌رسد مگر اینکه هزار صدیق بر او شهادت دهند که او زندیق است.» و این بدان سبب است که آنان از خدا چیزی می‌دانند که دیگران نمی‌دانند.\n\n### [افراد (الأفراد) صاحبان علم باطن هستند]\n\nو آنان صاحبان همان علمی هستند که علی بن ابی طالب (رضی الله عنه) در مورد آن، دست بر سینه می‌زد و آه می‌کشید و می‌گفت: «همانا در اینجا دانش‌های فراوانی است، اگر حاملانی برای آن می‌یافتم.»\n\nاو از افراد (الأفراد) بود و در زمان او کسی جز ابوهریره چنین سخنی نگفت.\n\nبخاری در صحیح خود از ابوهریره نقل کرده است که گفت: «من دو ظرف (علم) از پیامبر (صلی الله علیه و سلم) حمل کردم. یکی را در میان شما پخش کردم، اما اگر دیگری را پخش می‌کردم، این حلقوم (البلعوم) من قطع می‌شد.»\n\nحلقوم (البلعوم) مجرای غذاست. ابوهریره ذکر کرد که آن را از رسول خدا (صلی الله علیه و سلم) حمل کرده است، پس او در این مورد ناقل بود و نه صاحب ذوق (تجربه مستقیم). اما این علم بود، زیرا آن را از رسول خدا (صلی الله علیه و سلم) شنیده بود. ما تنها درباره کسی سخن می‌گوییم که عین فهم را در کلام خدای تعالی در نفس خود به او عطا شده است، و آن علم افراد (الأفراد) است. عبدالله بن عباس که به دلیل وسعت علمش به «بحر» (دریا) ملقب بود، از افراد بود. او در مورد این سخن خداوند عز و جل: «خداوند کسی است که هفت آسمان و همانند آن‌ها از زمین را آفرید، فرمان در میان آن‌ها نازل می‌شود» (الله الَّذِي خَلَقَ سَبْعَ سَماواتٍ ومن الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ) می‌گفت: «اگر تفسیر آن را می‌گفتم، سنگسارم می‌کردید.» و در روایتی دیگر: «می‌گفتید من کافرم.» و به همین علم بود که علی بن الحسین بن علی بن ابی طالب، زین العابدین (علیهم الصلاة والسلام) اشاره می‌کرد، و نمی‌دانم آیا این ابیات از خود اوست یا به آن‌ها تمثل جسته است:\n\n> ای بسا گوهر دانشی که اگر آن را فاش کنم *** به من گفته شود که تو از بت‌پرستان هستی\n> و مردان مسلمانی خون مرا حلال شمارند *** که زشت‌ترین کار خود را نیکو می‌بینند\n\nاو با گفتن «تو از بت‌پرستان هستی» (يعبد الوثنا) به مقصود خود تنبه داد که تأویل سخن پیامبر (صلی الله علیه و سلم): «همانا خداوند آدم را بر صورت خود آفرید» را در نظر دارد، با بازگرداندن ضمیر به خدای تعالی، که یکی از احتمالات آن است.\n\n### [مشکل علم باطن]\n\nبه خدا سوگند ای برادر، در آنچه به تو می‌گویم با من منصف باش. شکی نیست که تو با من هم‌عقیده‌ای که هر آنچه از اخبار صحیح از رسول خدا (صلی الله علیه و سلم) در وصف پروردگارش آمده است، از قبیل شادی، خنده، تعجب، تبشبش (گشاده‌رویی)، غضب، تردید، کراهت، محبت و شوق، ایمان به آن و تصدیقش واجب است. حال اگر نفحاتی از این حضرت الهی به صورت کشف (الکشف) و تجلی (التجلی) و تعریف الهی بر قلب‌های اولیا بوزد، به طوری که با اعلام خدا بدانند و با شهود خدا مشاهده کنند، اموری را که با این الفاظ بر زبان رسول بیان شده است، و ایمان من و تو به همه این‌ها حاصل شده است؛ اگر همین ولی، امثال این امور را در حق خدای تعالی بیان کند، آیا او را زندیق نمی‌شماری، همان‌گونه که جنید گفت؟ آیا نمی‌گویی که این شخص مشبّه (همانند‌انگار) است؟ این بت‌پرست است؟ چگونه حق را به آنچه مخلوق بدان وصف شده، وصف می‌کند؟ بت‌پرستان بیش از این کار نکرده‌اند، همان‌گونه که علی بن الحسین گفت. آیا او را نمی‌کشی یا فتوای قتلش را نمی‌دهی، همان‌گونه که ابن عباس گفت؟ پس به چه چیزی ایمان آوردی و تسلیم شدی، هنگامی که این امور را که ادله عقلی محال می‌دانند و از تأویل آن‌ها منع شده است، از رسول خدا (صلی الله علیه و سلم) در حق خدا شنیدی؟ و اشعری آن‌ها را بر وجوهی از تنزیه (پاک دانستن خدا از تشبیه) تأویل کرد، به گمان خود. پس انصاف کجاست؟ چرا نگفتی که قدرت واسع است که به این ولی همان علوم اسرار را عطا کند که به پیامبر عطا کرد؟ زیرا این امر از خصایص نبوت نیست و شارع این باب را بر امت خود ممنوع نکرده و در مورد آن سخنی نگفته است، بلکه فرموده است:\n\n«اگر در امت من محدَّثانی باشند، عمر از آن‌هاست.»\n\nپس پیامبر (صلی الله علیه و سلم) اثبات کرد که کسانی هستند که محدَّث‌اند و پیامبر نیستند. و ممکن است به مانند این امور محدَّث شوند، زیرا این امر خارج از تشریع احکام حلال و حرام است. زیرا تشریع از خصایص نبوت است، اما اطلاع بر غوامض علوم الهی از خصایص نبوت تشریعی نیست، بلکه در میان بندگان خدا، از رسول و ولی و تابع و متبوع، جاری است. ای ولی، انصاف تو کجاست؟ آیا این امر در میان فقها و صاحبان افکار که فرعون‌های اولیا و دجال‌های بندگان صالح خدا هستند، وجود ندارد؟ خداوند به کسی که از ما به آنچه برایش تشریع کرده عمل کند، می‌فرماید که خداوند آن را می‌داند و تعلیم آن را به عهده می‌گیرد، با علومی که اعمالش به بار آورده است. خداوند متعال می‌فرماید: «و از خدا پروا کنید و خدا به شما می‌آموزد و خداوند به هر چیزی داناست» (وَاتَّقُوا الله ويُعَلِّمُكُمُ الله والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ). و فرمود: «اگر از خدا پروا کنید، برای شما فرقان (قدرت تشخیص) قرار می‌دهد» (إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً).\n\n### [عمر بن خطاب و ابن حنبل]\n\nو از اقطاب این مقام، عمر بن خطاب و احمد بن حنبل هستند. به همین دلیل پیامبر (صلی الله علیه و سلم) در مورد عمر بن خطاب، در ذکر قدرتی که خداوند به او عطا کرده بود، فرمود:\n\n«ای عمر، شیطان تو را در هیچ راهی ملاقات نکرد مگر اینکه راهی غیر از راه تو را پیمود!»\n\nاین حدیث به عصمت او به شهادت معصوم دلالت دارد. و ما می‌دانیم که شیطان هرگز ما را جز به باطل نمی‌کشاند، و آن راهی غیر از راه عمر بن خطاب است. پس عمر جز راه‌های حق را نمی‌پیمود، به نصّ. او از کسانی بود که در راه خدا از سرزنش هیچ سرزنش‌کننده‌ای نمی‌ترسید. و حق را صولتی است. و چون حق، دشوار و قوی است، حمل آن بر نفوس، نفوس آن را تحمل نمی‌کنند و نمی‌پذیرند، بلکه آن را دور می‌اندازند و رد می‌کنند. به همین دلیل پیامبر (صلی الله علیه و سلم) فرمود:\n\n«حق برای عمر دوستی باقی نگذاشت.»\n\nو پیامبر (صلی الله علیه و سلم) راست گفت. یعنی در ظاهر و باطن. اما در ظاهر، به دلیل نبود انصاف، حب ریاست، خروج انسان از عبودیت خود، مشغول شدن به آنچه به او مربوط نیست، و عدم فراغت برای آنچه به آن فراخوانده شده است (یعنی مشغول شدن به خود و عیب‌جویی از عیوب مردم). و اما در باطن، حق برای عمر در قلبش دوستی باقی نگذاشت، پس او جز به خدا تعلق نداشت.\n\n### [فاجعه علم باطن]\n\nسپس مصیبت بزرگ‌تر این است که اگر به یکی از این طایفه منکر بگویی: «به خودت مشغول شو»، به تو می‌گوید: «من فقط برای حمایت از دین خدا (حماية لدين الله) و غیرت برای او قیام می‌کنم، و غیرت برای خدا (الغيرة لله) از ایمان است» و امثال این سخنان. و آرام نمی‌گیرد و نگاه نمی‌کند که آیا ممکن است خداوند ولی‌ای از اولیای خود را به آنچه در خلقش جاری می‌کند، آگاه کرده باشد، مانند خضر، و علومی لدنی به او آموخته باشد که عبارت از آن‌ها با همان صیغه‌هایی باشد که رسول (صلی الله علیه و سلم) با آن‌ها سخن می‌گوید، همان‌گونه که خضر گفت: «و من آن را به امر خود انجام ندادم» (وما فَعَلْتُهُ عَنْ أَمْرِي). و این منکر، به گمان خود، هنگامی که رسول خدا (صلی الله علیه و سلم) آن را آورده، به آن ایمان آورده است. به خدا سوگند، اگر به آن ایمان داشت، بر این ولی انکار نمی‌کرد. زیرا شارع، اطلاق این الفاظ را در جناب حق، از قبیل استواء (بر تخت نشستن)، نزول، معیت (همراهی)، خنده، شادی، تبشبش و تعجب و امثال آن، انکار نکرده است. و هرگز از پیامبر (صلی الله علیه و سلم) وارد نشده است که این امور را بر هیچ‌یک از بندگان خدا ممنوع کرده باشد، بلکه از جانب خدا خبر داده است که به ما می‌گوید: «همانا برای شما در رسول خدا سرمشقی نیکوست» (لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ). پس راه را برای ما گشود و ما را به تأسی به او (صلی الله علیه و سلم) ترغیب کرد و فرمود: «پس از من پیروی کنید تا خدا شما را دوست بدارد» (فَاتَّبِعُونِي يُحْبِبْكُمُ الله). و این از پیروی و تأسی به اوست. پس از تأسی به اوست که اگر واردی حق از جانب حق سبحانه بر ما وارد شود، و از جانب او علمی به ما آموخته شود که رحمتی است که خدا ما را بدان اختصاص داده و عنایتی است، در حالی که ما در آن بر بینه‌ای از پروردگارمان هستیم و شاهدی از ما آن را دنبال می‌کند، که همان پیروی از سنت او و شریعتی است که برای ما قرار داده است، و ما هیچ‌یک از آن‌ها را نقض نکرده‌ایم و مرتکب هیچ مخالفت با حلال کردن حرام خدا یا حرام کردن حلال او نشده‌ایم؛ در این صورت، برای آن معلومی که از جانب حق دانسته‌ایم، امثال این عبارات نبوی را می‌جوییم تا با آن‌ها آن را بیان کنیم، به ویژه اگر در مورد چیزی از آن از ما سؤال شود. زیرا خداوند در مورد کسی که صفتش چنین است، خبر داده که او بر بصیرت به سوی خدا دعوت می‌کند. پس از تأسی مأمور به رسول خدا (صلی الله علیه و سلم) این است که این الفاظ نبوی را بر آن معانی اطلاق کنیم. زیرا اگر در عبارت از آن‌ها چیزی فصیح‌تر از این بود، پیامبر (صلی الله علیه و سلم) آن را اطلاق می‌کرد، چرا که او مأمور به تبیین آنچه بر ما نازل شده است، می‌باشد. و ما به غیر آن عدول نمی‌کنیم، به دلیل بیانی که می‌خواهیم، با وجود تحقق به «هیچ چیز مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ). زیرا اگر به عبارتی غیر از آن عدول کنیم، با این کار ادعا کرده‌ایم که ما به حق خدا داناتریم و از رسول خدا (صلی الله علیه و سلم) منزه‌تر. و این بدترین نوع بی‌ادبی است. سپس، معنا نزد شنونده حتماً مختل می‌شود، زیرا آن لفظی که با آن مخالفت کرده‌ای، لفظ فصیح‌ترین مردم یعنی رسول خدا (صلی الله علیه و سلم) بوده است و قرآن به حکم مطابقت بر آن معنا دلالت نمی‌کند. پس تأسی برای ما تشریع شد. و این منکر تکفیرکننده کسی که چنین کاری می‌کند، از نظر در همه این‌ها غافل شده است. و این به دو دلیل یا یکی از آن‌هاست: اگر عالم باشد، به دلیل حسدی است که در او برخاسته است. خداوند متعال می‌فرماید: «از روی حسدی که در نفس‌هایشان بود» (حَسَداً من عِنْدِ أَنْفُسِهِمْ). و اگر جاهل باشد، پس به نبوت جاهل‌تر است.\n\n### [اقطاب افراد (الأفراد) و اختصاصاتشان]\n\nای ولی، ما بیش از هفتاد نفر از اقطاب این مقام را در یک روز در کوه ابوقبیس در مکه ملاقات کردیم. این طبقه اصلاً در طریقت خود مرید ندارند و کسی را از طریق تربیت سلوک نمی‌دهند، بلکه وظیفه آنان وصیت، نصیحت و نشر علم است. پس هر کس توفیق یابد، آن را می‌گیرد. گفته می‌شود که ابوالسعود بن الشبل از آنان بود. من او را ملاقات نکردم و ندیدم، اما بوی خوش و نفس معطر او را استشمام کردم. به من رسیده است که عبدالقادر گیلانی که قطب عادل زمان خود بود، برای محمد بن قائد اوانی به این مقام شهادت داده است. این‌گونه به من نقل شده و مسئولیت آن بر عهده ناقل است. زیرا ابن قائد گمان می‌کرد که در آنجا (در مقام) جز قدم پیامبرش، قدم دیگری را پیش روی خود نمی‌بیند. و این تنها برای افراد (الأفراد) زمان است. اگر از افراد نباشد، حتماً باید قدم قطب زمان خود را جلوتر از قدم پیامبرش ببیند، اگر امام باشد. و اگر وتد باشد، سه قدم را پیش روی خود می‌بیند. و اگر بدل باشد، چهار قدم را می‌بیند و همین‌طور. اما حتماً باید در حضرت اتباع (پیروی) مقامی داشته باشد. اگر در حضرات اتباع قیام نکند و از سمت راست راه، بین خلوتگاه و راه، منحرف شود، هیچ قدمی را پیش روی خود نمی‌بیند. و آن، راه وجه خاص است که از حق به سوی هر موجودی است. و از همین وجه خاص است که این علوم بر اولیا کشف می‌شود که منکران بر آنان انکار می‌کنند و آنان را زندیق می‌شمارند و کسانی که به آن ایمان دارند، وقتی از طریق رسولان به آن‌ها می‌رسد، آنان را کافر می‌دانند. و این علوم، عین همان علومی است که پیش‌تر ذکر کردیم. و صاحبان این مقام، تصریف و تصرف (التصريف والتصرف) در عالم دارند. طبقه اول از این افراد، تصرف در خلق خدا را با وجود تمکن و واگذاری حق به آنان، ترک کرده‌اند. این واگذاری از باب تمکن است نه امر. پس آنان پرده پوشیدند و وارد سراپرده‌های غیب شدند و پشت حجاب‌های عادات پنهان گشتند و ملازم عبودیت (العبودة) و افتقار شدند. آنان جوانمردان ظریف، ملامتیه (اللامتية) و بی‌ریای پنهان هستند. ابوالسعود از آنان بود. او رحمه الله از کسانی بود که امر خدا را در این سخن: «پس او را وکیل بگیر» (فَاتَّخِذْهُ وَكِيلًا) امتثال کرد. وکیل حق تصرف دارد. اگر امر می‌شد، امر را امتثال می‌کرد. این شأن آنان است. اما عبدالقادر، ظاهر حالش این است که مأمور به تصرف بود، به همین دلیل تصرف از او ظاهر شد. این گمان در مورد امثال اوست. اما محمد اوانی ذکر می‌کرد که خداوند تصرف را به او عطا کرده و او آن را پذیرفته است، پس تصرف می‌کرد، در حالی که مأمور نبود. پس مبتلا شد و به همان میزان از معرفت (المعرفة) که ابوالسعود به واسطه آن بر او برتری یافت، کاسته شد. پس ابوالسعود به زبان طبقه اول از طایفه سوارکاران (الركبان) سخن گفت. و ما آنان را اقطاب نامیدیم به دلیل ثباتشان و به دلیل اینکه این مقام، یعنی مقام عبودیت (العبودة)، بر محور آنان می‌چرخد. منظور من از قطبیت آنان این نیست که جماعتی تحت امرشان باشند و آنان رؤسای آن جماعت و اقطابشان باشند. آنان والاتر و بالاتر از این هستند. اصلاً در نفس خود ریاست ندارند، به دلیل تحققشان به عبودیت (العبودية).\nو امر الهی برای تقدم به آنان وارد نشده بود، پس اطاعت آن بر آنان لازم نبود، به دلیل تحققی که به عبودیت داشتند. در نتیجه، آنان در مقام عبودیت با امتثال امر مولای خود، به آن قیام می‌کنند. اما در صورت تخییر و عرضه یا طلب تحصیل مقام، جز از کسی که به عبودیت (العبودة) که برای آن خلق شده، متحقق نشده باشد، ظاهر نمی‌شود. ای ولی، من در این باب تو را به مقامات آنان شناساندم و تعریف اصولشان و تعیین احوال اقطاب مدبّر از طبقه دوم آنان باقی ماند. آن را در آینده ذکر خواهیم کرد، ان‌شاءالله. «و خداوند حق را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ). پروردگاری جز او نیست."
  },
  "page_count": 4
}