{
  "id": 217,
  "title": {
    "ar": "الباب السابع عشر ومائتان في معرفة الرسم والوسم وأسرارهما",
    "en": "Chapter 217: On the Knowledge of the Trace (الرسم) and the Mark (الوسم) and their Secrets",
    "ur": "باب دو سو سترہ (۲۱۷): رسم (الرسم) اور وسم (الوسم) کی معرفت (المعرفۃ) اور ان کے اسرار کے بیان میں۔",
    "fa": "باب دویست و هفدهم در معرفت رسم و وسم و اسرار آن دو"
  },
  "content": {
    "ar": "## «الباب السابع عشر ومائتان في معرفة الرسم والوسم وأسرارهما»\n\n\n> الرسم ما أعطيته من أثر *** والوسم ما دل عليه الخبر\n\n\n> إن ديارا قد عفي رسمها *** ما فيها للعاقل من معتبر\n\n\n> والوسم للتمييز إن كنت ذا *** معرفة وصح منك النظر\n\n\n> وعنهما أخبرنا قوله *** سيماهم في وجههم من أثر\n\n\n> في أزل كان لهم كل ما *** أظهره رب القضاء والقدر\n\n\n> فسلم الأمر إلى علمه *** وكن به في حزب من قد شكر\n\n\n> فإنه أولى بنا لا تكن *** في حزب من يجحد أو من كفر\n\n\n### [أراد بالوسم والرسم ما سبق في علم الله‏]\n\n\nاعلم أن الوسم والرسم عند الطائفة نعتان يجريان في الأبد بما جريا في الأزل يريدون بما سبق في علم الله لا أنهما جريا في الأزل ويستبين تحقيق الإشارة إليهما فالوسم بالواو من السمة وهي العلامة الإلهية على العبد أو في العبد تكون دلالة\nعلى أنه من أهل الوصول والتحقق وأما الرسم بالراء فهو أثر الحق على العبد الظاهر عليه عند رجوعه من حال ما قد ادعاه أو مقام فيصدقه هذا الأثر للظاهر عليه في دعواه فاعلموا أيدنا الله وإياكم بروح منه أن الوسم فينا كالاسماء لله دلالات عليه ليعرف بها فلما كثرت المعاني وتعددت نسبتها جعل للذات المنسوبة إليها هذه المعاني أسماء بإزاء كل معنى اسما يدل عليه ويعرف به لتحصيل الفوائد من العلماء بذلك المتعلقة بها فجعل الله لكل حال ومقام علامة تسمى وسما تدل على ذلك المقام والحال دلالة ترفع الإبهام والإجمال والاشتراك وتكون تلك الدلالة نعتا لذلك المعنى الذي له الحكم من هذه الذات فلا يزال يجري في الأبد أي يظهر دائما كما لم يزل في الأزل وهنا نكتة بديعة وذلك إنا قد قدمنا إن العالم على صورة الحق ومن علمه بنفسه تعلق العلم بالعالم فكان العالم مشهودا للحق أزلا وإن لم يكن موجودا والوسم من جملة العالم على حكمه ومرتبته فهو مشهود له أزلا يجري بحسب ما هو عليه في الأبد هذا هو تحقيق شأنه وكذلك الرسم فجميع ما هو العالم عليه في الأبد إنما هو على صورة ما ظهر به في الأزل إذ لا يختلف شهود الحق فيه وقد كان مشهودا له في الأزل حيث لم يكن موجودا عينيا فقد شاهد هذا الرسم والوسم أزلا يجريان في العالم كما هما في الأبد عليه فافهم ذلك وليس الوسم ولا الرسم بجعل جاعل في الأصل بل ظهرا هنا في الأبد بجعل جاعل وهو الله تعالى ولا بد لكل حال ومشهد ومقام من أثر فيمن قام به ذلك لأثر هو الرسم فالأثر من حيث ظهوره في المؤثر فيه بفتح الثاء يسمى رسما وهو بعينه من حيث إنه دلالة على صدق صاحب ذلك الحال أو المشهد أو المقام أو ما كان يسمى وسما فعين مسمى الوسم هو عين مسمى الرسم ويختلفان من حيث الحكم فالوسم عين الرسم من وجه وليس هو عينه من وجه إذا اعتبرت الحكم فالرسم في الجناب الإلهي الذي صدر عنه هذا الرسم في الكون هو كون الحق يظهر فيه أثر الإجابة عند سؤال السائلين إذ لا يكون مجيبا إلا عن سؤال فلما أوجب السؤال الإجابة كانت الإجابة أثرا في المجيب فهذا هو الرسم الإلهي ودليلنا عليه وإِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ ولما كان الأمر في نفسه بهذه المثابة في الجناب الإلهي ظهر في العالم الأثر أيضا إذ لو لم يكن كذلك لظهر في العالم أمر لا مستند له في الجناب الإلهي فيناط به الجهل به إذ قد تقرر أن علمه بالعالم علمه بنفسه فلهذه الحقيقة الإلهية استناد الرسم والوسم وقد يكون قول الطائفة في الوسم والرسم بما جريا في الأزل حكمهما في الجناب الإلهي إذ كان العالم ظاهرا بصورة حق ولا يحتمل البسط في هذا الباب أكثر من هذا وأما التفصيل فيه فيطول بطول العالم والعالم لا يتناهى الأثر فيه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 217: On the Gnosis of the Trace (الرسم) and the Mark (الوسم) and their Secrets\n\nThe Trace (الرسم) is that effect which is bestowed upon you,\nAnd the Mark (الوسم) is that to which the report points.\n\nIndeed, dwellings whose trace has been effaced,\nHold nothing worthy of consideration for the rational mind.\n\nAnd the Mark is for distinction, if you possess\nGnosis (المعرفة) and your vision is sound.\n\nAnd concerning both, His saying informs us:\n<<Their mark is on their faces from the trace>> (Q 48:29).\n\nIn pre-eternity (أزل), they possessed all that\nThe Lord of Decree (القضاء) and Destiny (القدر) manifested.\n\nSo submit the matter to His Knowledge (العلم),\nAnd be, through Him, in the party of those who are grateful.\n\nFor He is worthier of us; do not be\nIn the party of those who deny or disbelieve.\n\n### [He intended by the Mark (الوسم) and the Trace (الرسم) that which preceded in the Knowledge of Allah]\n\nKnow that the Mark (الوسم) and the Trace (الرسم), according to the Sufi community (الطائفة), are two attributes that flow in post-eternity (الأبد) according to how they flowed in pre-eternity (الأزل). By this, they mean that which preceded in the Knowledge of Allah (علم الله), not that they literally flowed in pre-eternity.\n\nThe realization of the allusion to them becomes clear: The Mark (الوسم), with the letter *waw*, comes from *al-simah* (the sign), which is the Divine sign (العلامة الإلهية) upon the servant or within the servant, serving as an indication (دلالة) that he is among the People of Arrival (أهل الوصول) and Realization (التحقق).\n\nAs for the Trace (الرسم), with the letter *ra*, it is the effect (أثر) of the Real (الحق) upon the servant, which becomes manifest upon him when he returns from a state (حال) or station (مقام) that he had claimed. This manifest effect confirms his claim.\n\nKnow—may Allah support us and you with a spirit from Him—that the Mark (الوسم) in us is like the Names (الأسماء) of Allah: they are indications of Him by which He is known. When the meanings (المعاني) became numerous and their relations multiplied, Names were assigned to the Essence (الذات) to which these meanings are attributed. For every meaning, a Name was assigned that indicates it and by which it is known, so that benefits may be derived by those who know them and are connected to them.\n\nThus, Allah established for every state and station a sign called a Mark (وسما), which indicates that station and state with an indication that removes ambiguity, generality, and commonality. This indication becomes an attribute (نعتا) of that meaning which holds sway from this Essence. It continues to flow in post-eternity—meaning, it appears constantly—just as it never ceased to be in pre-eternity.\n\nHere is a subtle point (نكتة بديعة): We have previously established that the World (العالم) is upon the form of the Real (صورة الحق). From His Knowledge of Himself, Knowledge became attached to the World. Thus, the World was witnessed (مشهودا) by the Real pre-eternally, even though it was not existent. The Mark is part of the World, according to its ruling and its level. Therefore, it was witnessed by Him pre-eternally, flowing according to what it is in post-eternity. This is the realization of its affair.\n\nThe same applies to the Trace. Everything that the World is upon in post-eternity is only upon the form by which it appeared in pre-eternity, for the Real's witnessing of it does not change. It was witnessed by Him in pre-eternity when it did not yet exist as a concrete entity (موجودا عينيا). Thus, He witnessed this Trace and this Mark pre-eternally, flowing in the World just as they are upon it in post-eternity. Understand this.\n\nNeither the Mark nor the Trace originates from the making of a maker (بجعل جاعل) in essence. Rather, they appeared here in post-eternity by the making of a Maker, who is Allah the Exalted. Every state, witnessing (مشهد), and station must have an effect (أثر) upon the one who holds it. This effect is the Trace (الرسم). The effect, insofar as it appears in the affected subject, is called the Trace. And this very same effect, insofar as it is an indication of the truthfulness of the possessor of that state, witnessing, or station, or whatever it may be, is called the Mark (وسما). Thus, the very entity designated by the Mark is the very entity designated by the Trace, but they differ in terms of their ruling (الحكم).\n\nThe Mark is the Trace from one perspective, but it is not the same entity from another perspective, if you consider the ruling. The Trace in the Divine Presence (الجناب الإلهي) from which this Trace in the cosmos (الكون) originated is the Real's being, in which the effect of the response (الإجابة) appears when the supplicants ask. For He does not respond except to a question. When the question necessitated the response, the response became an effect in the Responder. This is the Divine Trace (الرسم الإلهي). Our proof for this is: <<And when My servants ask you concerning Me, then indeed I am near. I respond to the invocation of the supplicant when he calls upon Me>> (Q 2:186).\n\nSince the matter itself is of this nature in the Divine Presence, the effect also appeared in the World. For if it were not so, something would appear in the World that has no basis (مستند) in the Divine Presence, and ignorance would be attached to it. This is because it has been established that His Knowledge of the World is His Knowledge of Himself. It is to this Divine Reality (الحقيقة الإلهية) that the Trace and the Mark are traced back.\n\nThe saying of the Sufi community concerning the Mark and the Trace—that they flowed in pre-eternity—may refer to their ruling in the Divine Presence, since the World appeared in the form of the Real (صورة حق). This chapter does not bear further elaboration than this. As for the detailed explanation of it, it would be as long as the World, and the effect in the World is inexhaustible. <<And Allah speaks the Truth, and He guides to the way>> (Q 33:4).",
    "ur": "باب نمبر دو سو سترہ: الرسم (اثر) اور الوسم (نشان) کی معرفت اور ان کے اسرار کا بیان\n\nالرسم (الرسم) وہ ہے جو تجھے اثر سے عطا ہوا،\nاور الوسم (الوسم) وہ ہے جس پر خبر دلالت کرے۔\n\nبے شک وہ دیار جن کا نقش (رسم) مٹ چکا،\nعقل مند کے لیے ان میں کوئی عبرت نہیں۔\n\nاور الوسم (الوسم) تمیز کے لیے ہے، اگر تو صاحبِ معرفت (المعرفۃ) ہو،\nاور تیری نظر درست ہو۔\n\nاور ان دونوں کے بارے میں ہمیں اس کے قول نے خبر دی:\n\"ان کی علامتیں (سیماہم) ان کے چہروں پر اثر (أثر) سے ہیں\"۔\n\nازل میں ان کے لیے وہ سب کچھ تھا،\nجو ربِ قضا و قدر نے ظاہر کیا۔\n\nپس معاملہ اس کے علم کے سپرد کر دے،\nاور اس کے ساتھ شکر کرنے والوں کے گروہ میں شامل ہو جا۔\n\nکیونکہ وہ ہم سے زیادہ قریب ہے، تو انکار کرنے والوں یا کفر کرنے والوں کے گروہ میں نہ ہو۔\n\n### [وسم (نشان) اور رسم (اثر) سے مراد وہ ہے جو علمِ الٰہی میں پہلے سے موجود ہے]\n\nجان لو کہ طائفہ (صوفیاء) کے نزدیک الوسم (الوسم) اور الرسم (الرسم) دو صفات ہیں جو ابد میں اسی طرح جاری ہوتی ہیں جیسے وہ ازل میں جاری ہوئیں۔ ان کی مراد یہ ہے کہ یہ وہ ہیں جو علمِ الٰہی میں پہلے سے موجود تھے، نہ کہ یہ ازل میں جاری ہوئے تھے۔ ان دونوں کی طرف اشارہ کی تحقیق واضح ہو جاتی ہے: الوسم (الوسم) واؤ کے ساتھ، سِمَہ (علامت) سے ہے، اور یہ بندے پر یا بندے میں ایک الٰہی علامت (العلامۃ الإلٰہیۃ) ہوتی ہے جو اس بات پر دلالت کرتی ہے کہ وہ وصول اور تحقق (التحقق) والوں میں سے ہے۔ اور الرسم (الرسم) راء کے ساتھ، وہ بندے پر حق (الحق) کا اثر ہے جو اس پر اس وقت ظاہر ہوتا ہے جب وہ کسی ایسے حال یا مقام سے واپس آتا ہے جس کا اس نے دعویٰ کیا ہو، تو یہ ظاہر ہونے والا اثر اس کے دعوے کی تصدیق کرتا ہے۔\n\nپس جان لو، اللہ تعالیٰ اپنی روح سے ہماری اور تمہاری تائید فرمائے، کہ ہم میں الوسم (الوسم) اللہ تعالیٰ کے اسماء کی طرح ہیں، جو اس پر دلالت کرتے ہیں تاکہ وہ ان کے ذریعے پہچانا جائے۔ جب معانی کی کثرت ہوئی اور ان کی نسبتیں متعدد ہوئیں، تو اس ذات کے لیے جس کی طرف یہ معانی منسوب ہیں، ہر معنی کے مقابلے میں ایک اسم مقرر کیا گیا جو اس پر دلالت کرے اور اس کے ذریعے پہچانا جائے، تاکہ ان معانی سے متعلقہ فوائد علماء کو حاصل ہوں۔ پس اللہ تعالیٰ نے ہر حال اور مقام کے لیے ایک علامت مقرر کی جسے وسم (الوسم) کہا جاتا ہے، جو اس مقام اور حال پر ایسی دلالت کرتی ہے جو ابہام، اجمال اور اشتراک کو دور کر دیتی ہے۔ اور یہ دلالت اس معنی کی صفت (نعت) ہوتی ہے جس کا حکم اس ذات سے متعلق ہوتا ہے۔ پس یہ ابد میں ہمیشہ جاری رہتا ہے، یعنی ہمیشہ ظاہر ہوتا رہتا ہے، جیسا کہ وہ ازل میں ہمیشہ سے تھا۔\n\nاور یہاں ایک لطیف نکتہ ہے، وہ یہ کہ ہم پہلے بیان کر چکے ہیں کہ عالم حق (الحق) کی صورت پر ہے، اور اس کے اپنے نفس کے علم سے ہی عالم کے ساتھ علم کا تعلق قائم ہوا۔ پس عالم ازل میں حق (الحق) کے لیے مشہود تھا، اگرچہ وہ موجود نہیں تھا۔ اور الوسم (الوسم) عالم کے جملے میں اپنے حکم اور مرتبے کے مطابق ہے، پس وہ ازل میں اس کے لیے مشہود تھا، اور ابد میں اسی کے مطابق جاری ہوتا ہے جس پر وہ ہے۔ یہ اس کی حقیقت کی تحقیق ہے۔ اور اسی طرح الرسم (الرسم) بھی ہے۔ پس عالم ابد میں جس بھی حالت پر ہے، وہ اسی صورت پر ہے جس پر وہ ازل میں ظاہر ہوا تھا، کیونکہ حق (الحق) کا مشاہدہ اس میں مختلف نہیں ہوتا۔ اور وہ ازل میں اس کے لیے مشہود تھا، جب کہ وہ عینی طور پر موجود نہیں تھا۔ پس اس نے اس الرسم (الرسم) اور الوسم (الوسم) کا ازل میں مشاہدہ کیا جو عالم میں اسی طرح جاری ہوتے ہیں جیسے وہ ابد میں ہیں۔ پس اس کو سمجھ لو۔\n\nاور نہ تو الوسم (الوسم) اور نہ ہی الرسم (الرسم) اصل میں کسی بنانے والے کے بنانے سے ہیں، بلکہ وہ یہاں ابد میں ایک بنانے والے، یعنی اللہ تعالیٰ کے بنانے سے ظاہر ہوئے ہیں۔ اور ہر حال، مشہد اور مقام کے لیے ضروری ہے کہ اس شخص میں ایک اثر ہو جس میں وہ قائم ہو، اور یہ اثر ہی الرسم (الرسم) ہے۔ پس اثر، اس لحاظ سے کہ وہ جس پر اثر کیا گیا (مؤثر فیہ) میں ظاہر ہوتا ہے، الرسم (الرسم) کہلاتا ہے، اور یہی اثر بعینہ اس لحاظ سے کہ وہ اس حال، مشہد یا مقام کے صاحب کی سچائی پر دلالت کرتا ہے، الوسم (الوسم) کہلاتا ہے۔ پس الوسم (الوسم) کا مسمیٰ (جس کا نام رکھا گیا) عین الرسم (الرسم) کا مسمیٰ ہے، اور یہ دونوں حکم کے لحاظ سے مختلف ہیں۔\n\nپس الرسم (الرسم) جنابِ الٰہی میں، جہاں سے یہ الرسم (الرسم) کون (کائنات) میں صادر ہوا، یہ ہے کہ حق (الحق) میں سائلین کے سوال پر اجابت کا اثر ظاہر ہوتا ہے، کیونکہ وہ سوال کے بغیر مجیب نہیں ہوتا۔ پس جب سوال نے اجابت کو واجب کیا، تو اجابت مجیب میں ایک اثر بن گئی، پس یہی الرسم (الرسم) الٰہی ہے۔ اور اس پر ہماری دلیل یہ ہے: \"اور جب میرے بندے آپ سے میرے بارے میں پوچھیں، تو بے شک میں قریب ہوں، میں دعا کرنے والے کی دعا قبول کرتا ہوں جب وہ مجھ سے دعا کرتا ہے\" (سورۃ البقرۃ، ۲: ۱۸۶)۔\n\nاور جب معاملہ جنابِ الٰہی میں بذاتِ خود اس مرتبے پر تھا، تو عالم میں بھی اثر ظاہر ہوا۔ کیونکہ اگر ایسا نہ ہوتا تو عالم میں ایک ایسا امر ظاہر ہوتا جس کی جنابِ الٰہی میں کوئی بنیاد نہ ہوتی، اور اس کے ساتھ جہالت وابستہ ہو جاتی۔ کیونکہ یہ بات طے شدہ ہے کہ حق (الحق) کا عالم کے بارے میں علم، اس کا اپنے نفس کے بارے میں علم ہے۔ پس اسی حقیقتِ الٰہیہ کی وجہ سے الرسم (الرسم) اور الوسم (الوسم) کی بنیاد ہے۔ اور ہو سکتا ہے کہ طائفہ (صوفیاء) کا یہ قول کہ الوسم (الوسم) اور الرسم (الرسم) ازل میں جاری ہوئے، ان کا حکم جنابِ الٰہی میں ہو، کیونکہ عالم حق (الحق) کی صورت میں ظاہر ہوا ہے۔ اور اس باب میں اس سے زیادہ تفصیل کی گنجائش نہیں ہے، اور جہاں تک اس کی تفصیل کا تعلق ہے، تو وہ عالم کی طوالت کے ساتھ طویل ہو گی، اور عالم میں اثر کبھی ختم نہیں ہوتا۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (سورۃ الأحزاب، ۳۳: ۴)۔",
    "fa": "باب دویست و هفدهم در معرفت رسم (الرسم) و وسم (الوسم) و اسرار آن دو\n\nرسم (الرسم) آن اثری است که به تو داده شده، و وسم (الوسم) آن است که خبر بر آن دلالت کند.\nهمانا خانه‌هایی که رسمشان محو شده است، برای خردمند در آن‌ها هیچ عبرتی نیست.\nو وسم (الوسم) برای تمییز است، اگر صاحب معرفت (المعرفة) باشی و نظرت صحیح باشد.\nو از آن دو، سخن او ما را خبر داد: «سِيمَاهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ» (نشانه‌شان در چهره‌هایشان از اثر سجده است).\nدر ازل، هر آنچه پروردگار قضا و قدر آشکار ساخت، برای ایشان بود.\nپس کار را به علم او واگذار، و با او در گروه شکرگزاران باش.\nزیرا او به ما سزاوارتر است؛ در گروه کسانی که انکار می‌کنند یا کفر می‌ورزند، مباش.\n\n[منظور از وسم (الوسم) و رسم (الرسم)، آن چیزی است که در علم خداوند سبقت گرفته است]\n\nبدان که وسم (الوسم) و رسم (الرسم) نزد این طایفه (صوفیه) دو وصف هستند که در ابد جاری می‌شوند، همان‌گونه که در ازل جاری شده‌اند. منظورشان آن چیزی است که در علم خداوند سبقت گرفته است، نه اینکه خودشان در ازل جاری شده باشند. و تحقیق اشاره به آن دو روشن می‌شود.\n\nپس وسم (الوسم) با حرف واو، از \"سمة\" (نشانه) است و آن علامت الهی است که بر بنده یا در بنده قرار می‌گیرد و دلالت می‌کند بر اینکه او از اهل وصول و تحقق است. و اما رسم (الرسم) با حرف راء، اثر حق (الحق) است بر بنده که هنگام بازگشت او از حالی که ادعا کرده یا مقامی که در آن بوده، بر او ظاهر می‌شود؛ و این اثر ظاهر شده بر او، ادعایش را تصدیق می‌کند.\n\nپس بدانید – خداوند ما و شما را با روحی از جانب خود تأیید کند – که وسم (الوسم) در ما مانند اسماء الهی است که دلالت‌هایی بر او هستند تا به واسطه آن‌ها شناخته شود. پس چون معانی زیاد شدند و نسبتشان متعدد گشت، برای ذاتی که این معانی به او منسوب‌اند، اسم‌هایی قرار داده شد که در مقابل هر معنی، اسمی باشد که بر آن دلالت کند و به واسطه آن شناخته شود، تا فواید حاصل از دانشمندانِ مرتبط با آن معانی به دست آید. پس خداوند برای هر حال و مقامی، علامتی قرار داد که وسم (الوسم) نامیده می‌شود و بر آن مقام و حال دلالتی می‌کند که ابهام، اجمال و اشتراک را برطرف می‌سازد؛ و آن دلالت، وصفی برای آن معنایی است که از این ذات حکم می‌گیرد. پس پیوسته در ابد جاری می‌شود، یعنی همیشه ظاهر می‌گردد، همان‌گونه که در ازل بوده است.\n\nو در اینجا نکته‌ای بدیع وجود دارد، و آن این است که ما پیشتر بیان کردیم که عالم بر صورت حق (الحق) است، و از علم او به ذات خویش، علم به عالم تعلق گرفت. پس عالم در ازل مشهود حق (الحق) بود، هرچند موجود نبود. و وسم (الوسم) جزئی از عالم است بر اساس حکم و مرتبه خود؛ پس در ازل مشهود او بوده و بر حسب آنچه در ابد بر آن است، جاری می‌شود. این است تحقیق شأن آن. و همچنین است رسم (الرسم). پس تمام آنچه عالم در ابد بر آن است، تنها بر صورت چیزی است که در ازل به آن ظاهر شده است، زیرا شهود حق (الحق) در آن تغییر نمی‌کند. و عالم در ازل مشهود او بود، در حالی که وجود عینی نداشت. پس حق (الحق) این رسم (الرسم) و وسم (الوسم) را ازلاً مشاهده کرده است که در عالم جاری می‌شوند، همان‌گونه که در ابد بر آن هستند. پس این را بفهم. و وسم (الوسم) و رسم (الرسم) در اصل به جعلِ جاعل (قرار دهنده) نیستند، بلکه در اینجا در ابد به جعلِ جاعل، که همان خداوند متعال است، ظاهر شدند.\n\nو برای هر حال، مشهد و مقامی، ناگزیر اثری در کسی که آن حال در او پدید آمده، وجود دارد؛ این اثر همان رسم (الرسم) است. پس اثر، از حیث ظهورش در مؤثر فیه (کسی که اثر در او واقع شده) رسم (الرسم) نامیده می‌شود؛ و همین اثر بعینه، از حیث اینکه دلالتی بر صدق صاحب آن حال یا مشهد یا مقام یا هر چیز دیگری است، وسم (الوسم) نامیده می‌شود. پس عین مسمای وسم (الوسم)، عین مسمای رسم (الرسم) است، اما از حیث حکم با یکدیگر تفاوت دارند. پس وسم (الوسم) از یک جهت عین رسم (الرسم) است و از جهت دیگر عین آن نیست، اگر حکم را در نظر بگیری.\n\nرسم (الرسم) در ساحت الهی که این رسم در کَوْن از آن صادر شده است، عبارت است از اینکه حق (الحق) در آن، اثر اجابت را هنگام سؤال سؤال‌کنندگان ظاهر می‌سازد، زیرا او جز در پاسخ به سؤال، اجابت‌کننده نیست. پس چون سؤال، اجابت را ایجاب کرد، اجابت اثری در مجیب (پاسخ‌دهنده) بود. این همان رسم (الرسم) الهی است. و دلیل ما بر آن، این سخن اوست: «وَ إِذا سَأَلَكَ عِبادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ» (و چون بندگانم از من بپرسند، پس همانا من نزدیکم؛ دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم). و چون امر در ذات خود در ساحت الهی بدین منوال بود، اثر نیز در عالم ظاهر شد؛ زیرا اگر چنین نبود، امری در عالم ظاهر می‌شد که در ساحت الهی مستندی نداشت و در نتیجه جهل به آن امر نسبت داده می‌شد. چرا که مقرر شده است که علم او به عالم، علم او به ذات خویش است. پس استناد رسم (الرسم) و وسم (الوسم) به این حقیقت الهی است. و ممکن است سخن این طایفه (صوفیه) درباره وسم (الوسم) و رسم (الرسم) که در ازل جاری شده‌اند، حکم آن دو در ساحت الهی باشد، زیرا عالم به صورت حق (الحق) ظاهر شده است. و این باب گنجایش بسطی بیش از این ندارد، و اما تفصیل در آن به درازای عالم است، و اثر در عالم پایان نمی‌پذیرد. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}