{
  "id": 530,
  "title": {
    "ar": "الباب الموفي ثلاثين وخمسمائة في معرفة حال قطب كان منزله يَسْتَخْفُونَ من النَّاسِ ولا يَسْتَخْفُونَ من الله وهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ ما لا يَرْضى‏ من الْقَوْلِ وكانَ الله بِما يَعْمَلُونَ مُحِيطاً",
    "en": "Chapter 530: Concerning the knowledge of the state of a Pole (قطب) whose station was [defined by the verse]: <<يَسْتَخْفُونَ من النَّاسِ ولا يَسْتَخْفُونَ من الله وهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ ما لا يَرْضى‏ من الْقَوْلِ وكانَ الله بِما يَعْمَلُونَ مُحِيطاً>> (They seek to hide [their deeds] from people, but they do not seek to hide from Allah, and He is with them when they plot by night [with] what He does not approve of in speech. And Allah is ever encompassing of what they do).",
    "ur": "باب نمبر پانچ سو تیس: ایک قطب (Qutb) کے حال کی معرفت (Ma'rifah) میں، جس کا روحانی مقام یہ تھا:\n\n\"وہ لوگوں سے چھپتے ہیں اور اللہ سے نہیں چھپتے، حالانکہ وہ (اللہ) ان کے ساتھ ہوتا ہے جب وہ راتوں کو ایسی باتوں کی تدبیر کرتے ہیں جنہیں وہ (اللہ) پسند نہیں کرتا، اور اللہ ان کے تمام اعمال کا احاطہ کیے ہوئے ہے۔\" (سورۃ النساء، ۴:۱۰۸)",
    "fa": "باب پانصد و سی‌ام در معرفت حال قطب (قطب) که مقام او این بود: يَسْتَخْفُونَ من النَّاسِ ولا يَسْتَخْفُونَ من الله وهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ ما لا يَرْضى‏ من الْقَوْلِ وكانَ الله بِما يَعْمَلُونَ مُحِيطاً (از مردم پنهان می‌شوند، ولی از خدا پنهان نمی‌شوند، در حالی که او با ایشان است هنگامی که سخنانی را که مورد رضایت او نیست، شبانه تدبیر می‌کنند؛ و خداوند به آنچه انجام می‌دهند احاطه دارد)."
  },
  "content": {
    "ar": "«الباب الموفي ثلاثين وخمسمائة في معرفة حال قطب كان منزله يَسْتَخْفُونَ من النَّاسِ ولا يَسْتَخْفُونَ من الله وهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ ما لا يَرْضى‏ من الْقَوْلِ وكانَ الله بِما يَعْمَلُونَ مُحِيطاً»\n\n\n> الجهل بالله عين الجهل بي ولذا *** سترت نفسي عن مثلي وأشكالي‏\n\n\n> وقد علمت بأن الله ينظرني *** على الذي قال لا تخطره بالبال‏\n\n\n> فما الجواب إذا قال الجليل لنا *** لما فعلتم فقلنا له الحكم للحال‏\n\n\n> الحال موهبة وأنت واهبها *** هلا حفظت وجودي حفظ أمثالي‏\n\n\n> فلا تلمني ولم من أنت تعرفه *** وأنت تدريه رب القيل والقال‏\n\n\n### [أن الجهل بالله إنما ينشأ من جهلك بك‏]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الجهل بالله إنما كان من جهلك بك فإن الله ما جعل دليلا على العلم به إلا علمك بك فجعل الآية في نفسك وقال النبي صَلَّى اللهُ عَليهِ وسَلَّم المترجم عنه من عرف نفسه عرف ربه‏\n\n\nوما أحسن ما قال تعالى يَسْتَخْفُونَ من النَّاسِ فإنهم مجبولون على النسيان ولا يَسْتَخْفُونَ من الله الذي لا يضل ولا ينسى وكان الأولى لو صح عكس القضية إلا أنه لا يصح أن يستخفي شي‏ء عن الله والسبب الموجب للاستخفاء عن الناس ما علموا منهم من الحب في ظهور التحكم فيهم بقدر الحال والاستطاعة وبما فيهم من حب الثناء الحسن وطلب المحمدة فإذا اطلعوا على هذا الذي أشرنا إليه من العمل سقطت حرمة العامل من قلب الذي يراه وقام عليه لسان الذم منه وسبب ذلك الجنسية ومع كونه يعلم أن الله يحيط به علما لكن يرى هذا العامل أن الأسماء الإلهية تتحاور فيه في حال هذا العمل ولا سيما الاسم الحليم والصبور ويعلم أن الاختفاء منه محال فلا بد من إتيان ما أتى به فإن كان مؤمنا أتاه على كره فأشبه قبض الحق بالموت نسمة المؤمن على كره فيجد في مثل هذا اتساعا يجول فيه حتى أنه ربما قال في سوية الحق في ذلك ولا يقول مثل هذا إلا غير أديب أ لا تراه يقول تعالى في تمام هذه الآية وكانَ الله بِما يَعْمَلُونَ مُحِيطاً ينبه أن هذا العمل الذي هو فيه قد أحطت علما به من نفسي من حيث كرهت أشياء لا بد من أني أوجدها وأحببت أشياء وإنما قال ذلك لإقامة عذر عبده المؤمن فإنه ما يكره فعل ما يستخفي منه ويستخفي بسببه إلا المؤمن بأن هذا لا يجوز عمله شرعا فالإحاطة من الله بالأشياء مثل‏\nالذوق فينا وهو أن تعلم الأشياء منك أي إنك قد اتصفت بها ذوقا وكثير بين من يكون ذلك المعلوم حاله وبين من لا يكون فإنه ما هو منه على علم صحيح وقوله من أنه مما لا يَرْضى‏ من الْقَوْلِ وهو الجهر بالسوء من القول فإن الله لا يحب الْجَهْرَ بِالسُّوءِ من الْقَوْلِ فإن الحكم بكونه سوء ما علم لا من القول إذ لو لا لقول ما وصل علمه إلينا فالقول بالسوء بطريق التعريف إنه سوء قول خير يحب الجهر به لأنه تعليم حتى لا يجهر به عند الاستعمال إذا قضى الله على المكلف استعمال هذا فما في الكون حكم ظاهر في عمل إلا وله مستند إلهي يستند إليه وذلك المستند إليه إن كان خيرا زاد له في الأعطية أَضْعافاً مُضاعَفَةً وإن كان شرا شفع فيه ذلك المستند وأقام عذره عند الله فلهذا كان مال العباد المكلفين إلى الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 530: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station was [defined by the verse]: <<They seek to hide from people, but they do not seek to hide from Allah, and He is with them when they plot by night [with] what He does not approve of the saying. And Allah is ever encompassing of what they do.>>\n\nIgnorance of Allah is the very essence (عين) of ignorance of myself,\nAnd thus I veiled my self from my peers and those like me.\n\nAnd I have known that Allah observes me\nRegarding that which He said, \"Do not let it cross your mind.\"\n\nSo what shall be the answer when the Majestic One says to us,\n\"Why did you do this?\" and we reply, \"The ruling belongs to the state (حال).\"\n\nThe state (حال) is a gift, and You are its Giver;\nWhy did You not preserve my existence as You preserved my likes?\n\nSo do not blame me, but blame the one You know,\nFor You are aware of Him, the Lord of speech and saying.\n\n***\n\n### [That Ignorance of Allah Arises Only from Your Ignorance of Yourself]\n\nKnow—may Allah support us and you with a spirit from Him—that ignorance of Allah (الجهل بالله) arises only from your ignorance of yourself (جهلك بك). For Allah has not established any proof (دليلا) for the knowledge of Him except your knowledge of yourself. Thus, He placed the sign (الآية) within your own soul, and the Prophet, peace and blessings be upon him, the one who translates [the Divine Reality], said: \"Whoever knows his self knows his Lord.\"\n\nHow excellent is His saying, the Exalted: <<They seek to hide from people,>> for people are naturally disposed toward forgetfulness (النسيان), <<but they do not seek to hide from Allah,>> Who neither errs nor forgets. It would have been more appropriate if the reverse of the proposition were true, yet it is impossible for anything to hide from Allah.\n\nThe reason necessitating hiding from people is what [the seeker] knows of their love for manifesting control over others according to their state (الحال) and capacity, and because of their love for good praise and seeking commendation (المحمدة). If they become aware of the action we have indicated, the sanctity (حرمة) of the doer falls from the heart of the observer, and the tongue of blame rises against him. The cause of this is shared nature (الجنسية).\n\nEven though the doer knows that Allah encompasses him with Knowledge, he perceives that the Divine Names (الأسماء الإلهية) are interacting within him during the performance of this action, especially the Names the Forbearing (الحليم) and the Patient (الصبور). He knows that concealment from Him is impossible, so he must inevitably perform what he performs.\n\nIf he is a believer (مؤمنا), he performs it reluctantly (على كره), resembling the way the Real (الحق) seizes the soul of the believer in death reluctantly. In such a situation, he finds a spaciousness in which he moves freely, to the extent that he might even speak of the equality of the Real (الحق) in that matter—though only one lacking proper spiritual etiquette (غير أديب) would speak thus.\n\nDo you not see that the Exalted says at the conclusion of this verse: <<And Allah is ever encompassing of what they do.>> This alerts [the seeker] that \"This action in which he is engaged, I have encompassed it with Knowledge from My own Self, in that I disliked things that I inevitably had to bring into existence, and I loved things.\" He only said this to establish an excuse for His believing servant, for only the believer—who knows that this action is not permissible according to the Law (شرعا)—dislikes the action from which he hides and because of which he hides.\n\nThe encompassing (الإحاطة) of things by Allah is like tasting (الذوق) in us, which means that you know things *from* yourself—that is, you have been characterized by them through tasting (ذوقا). There is a great difference between one whose state (حال) is that known thing and one who is not, for the latter does not possess correct knowledge of it.\n\nAnd His saying concerning <<what He does not approve of the saying>> refers to the open declaration of evil speech, for Allah does not love <<the open declaration of evil speech.>> The judgment that something is evil is known not from the speech itself, for were it not for the speech, knowledge of it would not have reached us.\n\nTherefore, speaking of evil by way of defining it as evil speech is a good thing, the open declaration of which is loved because it is instruction, so that [the evil] is not openly declared during its actual practice, should Allah decree that the legally responsible person (المكلف) must practice it.\n\nThus, there is no apparent ruling in the cosmos concerning an action except that it has a Divine basis (مستند إلهي) upon which it relies. If that basis is good, [Allah] increases his gifts manifoldly. If it is evil, that basis intercedes for him and establishes his excuse before Allah. For this reason, the ultimate destination of the legally responsible servants (العباد المكلفين) is the Mercy that <<encompasses all things.>> And Allah <<speaks the Truth, and He guides to the way.>>",
    "ur": "پانچ سو تیسواں باب اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"وہ لوگوں سے چھپتے ہیں اور اللہ سے نہیں چھپتے، حالانکہ وہ ان کے ساتھ ہوتا ہے جب وہ ایسی بات کی رات کو تدبیر کرتے ہیں جسے وہ (اللہ) پسند نہیں کرتا، اور اللہ ان کے اعمال کا احاطہ کرنے والا ہے\" (النساء: ۱۰۸)۔\n\n> اللہ کی جہالت میری جہالت کا عین ہے، اسی لیے\n> میں نے اپنے آپ کو اپنے جیسے اور اپنی شکلوں سے چھپا لیا۔\n\n> اور میں جانتا ہوں کہ اللہ مجھے دیکھ رہا ہے\n> اس بات پر جو اس نے کہی کہ اسے دل میں نہ لاؤ۔\n\n> تو کیا جواب ہو گا جب جلیل (ذات حق) ہم سے کہے گا\n> کہ تم نے یہ کیوں کیا؟ تو ہم کہیں گے کہ حکم تو حال (کی کیفیت) کا تھا۔\n\n> حال (کیفیت) ایک عطیہ ہے اور تو ہی اسے عطا کرنے والا ہے\n> تو کیا تو نے میرے وجود کو میرے ہم مثلوں کی طرح محفوظ نہ رکھا؟\n\n> پس مجھے ملامت نہ کر، بلکہ اسے ملامت کر جسے تو جانتا ہے\n> اور تو اسے جانتا ہے، تو ہی قیل و قال کا رب ہے۔\n\n### [بے شک اللہ کی جہالت صرف تمہاری اپنی جہالت سے پیدا ہوتی ہے]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح سے تائید بخشے، کہ اللہ (الحق) کی جہالت صرف تمہاری اپنی جہالت سے پیدا ہوتی ہے۔ کیونکہ اللہ نے اپنی معرفت (المعرفۃ) پر تمہارے اپنے علم کے سوا کوئی دلیل نہیں بنائی۔ پس اس نے نشانی تمہارے نفس میں رکھی اور نبی صلی اللہ علیہ وسلم نے، جن کے بارے میں یہ ترجمہ کیا گیا ہے، فرمایا: \"جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا۔\"\n\nاور اللہ تعالیٰ کا یہ فرمان کتنا عمدہ ہے: \"وہ لوگوں سے چھپتے ہیں\" (يَسْتَخْفُونَ مِنَ النَّاسِ) کیونکہ وہ نسیان (بھول) پر جبلت کیے گئے ہیں، \"اور اللہ سے نہیں چھپتے\" (وَلَا يَسْتَخْفُونَ مِنَ اللَّهِ) جو نہ گمراہ ہوتا ہے اور نہ بھولتا ہے۔ اگر قضیے کا الٹ صحیح ہوتا تو یہ زیادہ مناسب ہوتا، لیکن یہ صحیح نہیں کہ کوئی چیز اللہ سے چھپ سکے۔ لوگوں سے چھپنے کا سبب یہ ہے کہ وہ ان میں یہ جانتے ہیں کہ لوگ حال اور استطاعت کے مطابق ان پر اپنی حکمرانی ظاہر کرنے کی محبت رکھتے ہیں، اور ان میں اچھی تعریف کی محبت اور ستائش کی طلب ہے۔ پس جب وہ اس عمل پر مطلع ہوتے ہیں جس کی طرف ہم نے اشارہ کیا، تو دیکھنے والے کے دل سے عامل کی حرمت گر جاتی ہے اور اس پر ملامت کی زبان کھل جاتی ہے، اور اس کا سبب جنسیت (ہم جنسی) ہے۔ اس علم کے باوجود کہ اللہ علم کے ذریعے اس کا احاطہ کیے ہوئے ہے، لیکن یہ عامل دیکھتا ہے کہ اس عمل کے دوران اسماء الٰہیہ (خاص طور پر الاسم الحلیم اور الاسم الصبور) اس میں باہم گفتگو کر رہے ہیں۔ اور وہ جانتا ہے کہ اللہ سے اختفاء (چھپنا) محال ہے، لہٰذا جو کچھ اس نے کیا ہے، اسے کرنا ناگزیر ہے۔ اگر وہ مؤمن ہے تو وہ اسے ناپسندیدگی کے ساتھ کرتا ہے، پس یہ اس طرح ہے جیسے حق (الحق) کا مؤمن کی روح کو موت کے ذریعے ناپسندیدگی کے ساتھ قبض کرنا۔ چنانچہ وہ ایسی حالت میں ایک وسعت پاتا ہے جس میں وہ گھومتا ہے، یہاں تک کہ وہ شاید اس میں حق (الحق) کی مساوات کے بارے میں بھی کچھ کہہ دے، اور ایسی بات صرف بے ادب ہی کہتا ہے۔ کیا تم نہیں دیکھتے کہ اللہ تعالیٰ اس آیت کے آخر میں فرماتا ہے: \"اور اللہ ان کے اعمال کا احاطہ کرنے والا ہے\" (وَكَانَ اللَّهُ بِمَا يَعْمَلُونَ مُحِيطًا)۔ یہ تنبیہ ہے کہ یہ عمل جس میں وہ ہے، میں نے اس کا علم اپنے نفس سے احاطہ کر لیا ہے، اس لحاظ سے کہ میں نے کچھ چیزوں کو ناپسند کیا جن کا وجود میں لانا ناگزیر تھا، اور کچھ چیزوں کو پسند کیا۔ اور اس نے یہ بات اپنے مؤمن بندے کا عذر قائم کرنے کے لیے کہی، کیونکہ جو شخص کسی ایسے فعل کو ناپسند کرتا ہے جس سے وہ چھپتا ہے اور جس کی وجہ سے چھپتا ہے، وہ صرف وہی مؤمن ہے جو یہ جانتا ہے کہ شرعاً اس کا کرنا جائز نہیں۔ پس اللہ کی طرف سے اشیاء کا احاطہ کرنا ہمارے اندر ذوق کی مانند ہے، اور وہ یہ ہے کہ تم اشیاء کو اپنے اندر سے جانو، یعنی تم ذوقاً ان صفات سے متصف ہو چکے ہو۔ اور اس شخص کے درمیان جس کا وہ معلوم حال ہو اور اس شخص کے درمیان جس کا وہ حال نہ ہو، بہت فرق ہے، کیونکہ وہ اس پر صحیح علم نہیں رکھتا۔ اور اس کا یہ فرمان کہ \"ایسی بات کی رات کو تدبیر کرتے ہیں جسے وہ (اللہ) پسند نہیں کرتا\" (مَا لَا يَرْضَىٰ مِنَ الْقَوْلِ)، اور وہ قول کی برائی کا اظہار ہے۔ کیونکہ اللہ تعالیٰ \"قول کی برائی کا اظہار\" (الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ) پسند نہیں کرتا۔ کیونکہ اس کے برائی ہونے کا حکم قول سے نہیں جانا گیا، کیونکہ اگر قول نہ ہوتا تو اس کا علم ہم تک نہ پہنچتا۔ پس برائی کو بطور تعریف بیان کرنا کہ یہ برا قول ہے، ایک خیر ہے جس کا اظہار پسند کیا جاتا ہے، کیونکہ یہ تعلیم ہے، تاکہ جب اللہ مکلف پر اس کا استعمال مقدر کر دے تو وہ استعمال کے وقت اس کا اظہار نہ کرے۔ پس کائنات میں کسی عمل میں کوئی ایسا ظاہری حکم نہیں ہے مگر اس کی کوئی نہ کوئی الٰہی سند ہے جس پر وہ بھروسہ کرتا ہے۔ اور وہ مستند اگر خیر ہو تو اس کے لیے عطیات میں \"کئی گنا اضافہ\" (أَضْعَافًا مُضَاعَفَةً) کر دیتا ہے، اور اگر شر ہو تو وہ مستند اس کی شفاعت کرتا ہے اور اللہ کے ہاں اس کا عذر قائم کرتا ہے۔ اسی لیے مکلف بندوں کا انجام اس رحمت کی طرف ہے جو \"ہر چیز پر محیط ہے\" (وَسِعَتْ كُلَّ شَيْءٍ)، اور \"اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے\" (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و سی‌ام (۵۳۰) در معرفت حال قطبی که منزل او این است: «از مردم پنهان می‌شوند، ولی از خدا پنهان نمی‌شوند، در حالی که او با ایشان است، آنگاه که سخنی را که او نمی‌پسندد، شبانه تدبیر می‌کنند؛ و خداوند به آنچه می‌کنند احاطه دارد.» (سوره نساء، آیه ۱۰۸)\n\nجهل به حق (الحق) عین جهل به من است، و از این رو\nخود را از امثال و اشباه خویش پنهان کردم.\n\nو دانستم که خداوند مرا می‌نگرد\nبر آنچه گفت که آن را به خاطر میاور.\n\nپس پاسخ چیست آنگاه که جلیل (خداوند) به ما گوید\nچرا چنین کردید؟ و ما به او گوییم: حکم از آنِ حال است.\n\nحال (الحال) موهبتی است و تو بخشنده آنی\nآیا وجود مرا همچون حفظ امثال من حفظ نکردی؟\n\nپس مرا ملامت مکن، و کسی را ملامت کن که او را می‌شناسی\nو تو او را می‌دانی، ای پروردگار قیل و قال.\n\n### جهل به حق (الحق) تنها از جهل تو به خودت نشأت می‌گیرد\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که جهل به حق (الحق) تنها از جهل تو به خودت بوده است. زیرا خداوند دلیلی بر علم به خود قرار نداده مگر علم تو به خودت. پس نشانه (آیه) را در نفس تو قرار داد و پیامبر (صلی الله علیه و سلم) که مترجم از اوست فرمود: «هر کس خود را شناخت، پروردگارش را شناخت.»\n\nو چه نیکو فرموده است خداوند متعال: «از مردم پنهان می‌شوند»؛ زیرا مردم بر نسیان (فراموشی) سرشته شده‌اند، «و از خدا پنهان نمی‌شوند» که نه گمراه می‌شود و نه فراموش می‌کند. و اگر عکس قضیه صحیح بود، اولی‌تر بود، اما صحیح نیست که چیزی از خداوند پنهان بماند. و سببِ موجبِ پنهان شدن از مردم، آن است که (سالکان) از مردم، حبِ ظهورِ تسلط بر ایشان را به اندازه حال (الحال) و استطاعتشان، و نیز حبِ ستایش نیکو و طلبِ محامد را در آنان دانسته‌اند. پس اگر بر این عملی که به آن اشاره کردیم آگاه شوند، حرمت عامل از قلب بیننده ساقط می‌شود و زبان نکوهش او بر وی گشوده می‌گردد، و سبب این امر، جنسیت (هم‌نوعی) است. با وجود اینکه این عامل می‌داند که خداوند از نظر علمی به او احاطه دارد، اما می‌بیند که اسماء الهی در حال این عمل در او با یکدیگر گفتگو می‌کنند، به ویژه اسم «حلیم» و «صبور». و می‌داند که پنهان شدن از او (خداوند) محال است، پس ناگزیر است که آنچه را انجام داده، انجام دهد. اگر مؤمن باشد، آن را با کراهت انجام می‌دهد، و این شبیه به قبض حق (الحق) با مرگ، نَسَمه مؤمن است که با کراهت صورت می‌گیرد. پس در چنین حالتی گشایشی می‌یابد که در آن جولان می‌دهد، تا جایی که شاید در مورد مساوات حق (الحق) در آن بگوید (که این کار را جز فرد بی‌ادب نمی‌گوید). آیا نمی‌بینی که خداوند متعال در ادامه این آیه می‌فرماید: «و خداوند به آنچه می‌کنند احاطه دارد»؟ این هشدار می‌دهد که این عملی که او در آن است، من (خداوند) از ذات خود به آن احاطه علمی دارم، از آن جهت که چیزهایی را ناخوش داشتم که ناگزیر بودم آنها را ایجاد کنم و چیزهایی را دوست داشتم. و این را تنها برای اقامه عذر بنده مؤمن خود فرمود؛ زیرا کسی که از انجام کاری که از آن پنهان می‌شود و به سبب آن پنهان می‌گردد، کراهت دارد، تنها مؤمنی است که می‌داند این کار شرعاً جایز نیست.\n\nپس احاطه از جانب خداوند به اشیاء، مانند ذوق (الذوق) در ماست، و آن این است که اشیاء را از خودت بدانی، یعنی اینکه تو به ذوق (الذوق) به آنها متصف شده‌ای. و تفاوت بسیاری است میان کسی که آن معلوم، حال (الحال) اوست و کسی که چنین نیست؛ زیرا او بر علم صحیحی از آن نیست. و سخن او (خداوند) که می‌فرماید: «سخنی را که او نمی‌پسندد»، و آن آشکار کردن بدی در گفتار است؛ زیرا خداوند «آشکار کردن سخن بد را دوست ندارد». حکم به اینکه آن سخن بد است، نه از خودِ گفتار، بلکه از علم به دست می‌آید؛ زیرا اگر گفتار نبود، علم آن به ما نمی‌رسید. پس گفتن بدی به طریق تعریف اینکه آن سخن بد است، خود گفتار نیکی است که آشکار کردن آن دوست داشته می‌شود، زیرا آموزش است تا در هنگام استعمال، اگر خداوند بر مکلف استعمال آن را مقدر کرده باشد، آن را آشکار نکند. پس هیچ حکم ظاهری در عملی در هستی (الوجود) نیست مگر اینکه مستند الهی دارد که به آن تکیه می‌کند. و آن مستند اگر خیر باشد، عطایای او را «چندین برابر» افزایش می‌دهد، و اگر شر باشد، آن مستند در حق او شفاعت می‌کند و عذر او را نزد خداوند می‌پذیرد. به همین دلیل، سرانجام بندگان مکلف به سوی رحمتی است که «همه چیز را فرا گرفته است»، و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 2
}