{
  "id": 390,
  "title": {
    "ar": "الباب التسعون وثلاثمائة في معرفة منازلة زمان الشي‏ء وجوده إلا أنا فلا زمان لي وإلا أنت فلا زمان لك فأنت زماني وأنا زمانك",
    "en": "Chapter Three Hundred and Ninety: Concerning the Gnosis (معرفة) of the Station (منازلة) wherein the time (زمان) of a thing is its Existence (وجود); except that I have no time, nor do you have time, so you are my time, and I am your time.",
    "ur": "باب تین سو نوے: شے کے زمان (وقت) کے اس کی ہستی (الوجود) ہونے کے مقام کی معرفت میں، مگر میرے لیے کوئی زمان نہیں ہے اور نہ ہی آپ کے لیے کوئی زمان ہے، پس آپ میرا زمان ہیں اور میں آپ کا زمان ہوں۔",
    "fa": "باب سیصد و نودم در معرفت منازل زمانِ شیء و وجود آن، جز اینکه من را زمانی نیست و تو را نیز زمانی نیست؛ پس تو زمانِ منی و من زمانِ تو هستم."
  },
  "content": {
    "ar": "## «الباب التسعون وثلاثمائة في معرفة منازلة زمان الشي‏ء وجوده إلا أنا فلا زمان لي وإلا أنت فلا زمان لك فأنت زماني وأنا زمانك»\n\n\n> إذا قلنا بأن النعت عين *** فأين الواحد المنعوت منه‏\n\n\n> وقد جاء الخطاب الحق فينا *** أخذناه عن الإرسال منه‏\n\n\n> بأن الله ليس له شريك *** ولا مثل ولا يبديه كنه‏\n\n\n> فإن حصلت سر الكون فيه *** فكن منه على علم وصنه‏\n\n\n> فمهما قلت أ لست أنا بلا هو *** فضد القول والتعيين من هو\n\n\n> إذا حققت قولي يا قسيمي *** علمت فلم تقل من أنت من هوقال الله تعالى حكاية عن قوم يقولون وما يُهْلِكُنا إِلَّا الدَّهْرُ وصدقوا فإنه‏\n\n\nقد ثبت عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن الله هو الدهر\n\n\nفما أهلكهم إلا الله كما هو في نفس الأمر\n\n\n### [أن الزمان نسبة لا وجود له في عينه‏]\n\n\nاعلم أن الزمان نسبة لا وجود له في عينه وقد أطال الناس الكلام في ماهيته فخرج من مضمون كلامهم ما ذكرناه من أنه نسبة وأنه يحدث بحدوث السؤال بمتى فيحدث له أسماء بحدوث السؤال مثل حين وإذ وإذا وحروف الشرط كلها أسماء الزمان والمسمى أمر عدمي كلفظة العدم فإنها اسم مسماها لا عين له مع تعقل الحكم له فلنمثل ليفهم ما ذكرناه يقال متى جاء زيد الجواب حين طلعت الشمس مثلا وإذا طلعت الشمس ومتى تطلع الشمس من مغربها حين يأذن الله لها في ذلك وإذا يأذن الله ومهما أذن الله لها طلعت في جواب هل تطلع الشمس من المغرب فيعود مشرقا فيكون هذا وأمثاله جوابه فيعقل منه الزمان إن جاء زيد أكرمتك المعنى حين يجي‏ء زيد أكرمك المعنى زمان مجي‏ء زيد زمان وجوب كرامتك على التي أوجبها على نفسي بمجي‏ء زيد فهو للمحدثات زمان وللقديم أزل ومعقوليته أمر متوهم ممتد لا طرفين له فنحكم عليه بالماضي لما مضى فيه ونحكم عليه بالمستقبل لما يأتي فيه ونحكم عليه بالحال لما هو فيه وهو مسمى الآن والآن وإن كان زمانا فهو حد لما مضى في الزمان ولما استقبل في الزمان كالنقطة تفرض في محيط الدائرة فتعين لها البدء والغاية حيث فرضتها منها فالأزل والأبد عدم طرفي الزمان فلا أول له ولا آخر والدوام له وهو زمان الحال والحال له الدوام فلا يزال العالم في حكم زمان الحال ولا يزال حكم الله‏\nفي العالم في حكم الزمان ولا يزال ما مضى منه وما يستقبل في حكم زمان الحال أ لا ترى في كلام الله في إخباره إيانا بأمور قد انقضت عبر عنها بالزمان الماضي وبأمور تأتي عبر عنها بالزمان المستقبل وأمور كائنة عبر عنها بالحال فالحال كُلَّ يَوْمٍ هُوَ في شَأْنٍ والماضي وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً والمستقبل إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ وسَأَصْرِفُ عَنْ آياتِيَ الَّذِينَ يَتَكَبَّرُونَ وسَأُرِيكُمْ آياتِي فَلا تَسْتَعْجِلُونِ ونطلب عند هذا كله عينا وجودية يكون هذا كله فيها وهي له كالظرف فلا نجدها لا عقلا ولا حسا لكن وهما ظرفيا وذاك الظرف مظروف لظرف متوهم لا يتناهى يحكم به الوهم لا غير فما ثم إن عقلت ما يعقل بالوهم ولا يعقل بالعقل ولا بالحس إلا الوجود الحق الذي نستند إليه في وجودنا فلهذه النسبة تسمى لنا بالدهر حتى لا يكون الحكم إلا له لا لما يتوهم من حكم الزمان إذ لا حاكم إلا الله ففيه ظهرت أعيان الأشياء بأحكامها فهو الوجود الدائم وأعيان الممكنات بأحكامها تظهر من خلف حجاب وجوده للطافته فنرى أعيان الممكنات وهي أعياننا من خلف حجاب وجوده ولا نراه كما نرى الكواكب من خلف حجب السموات ولا نرى السموات وإن كنا نعقل أن بيننا وبين الكواكب سماوات إلا أنها من اللطافة لا تحجب من يكون وراءها والله لَطِيفٌ بِعِبادِهِ فمن لطفه أنه هو الذي يأتيهم بكل ما هم فيه ولا تقع أبصار العباد إلا على الأسباب التي يشهدونها فيضيفون ما هم فيه إليها فظهر الحق باحتجابه فهو الظاهر المحجوب فهو الباطن للحجاب لا لك وهو الظاهر لك وللحجاب فسبحان من احتجب في ظهوره وظهر في حجابه فلا تشهد عين سواه ولا ترتفع الحجب عنه ولم يزل ربا ولم نزل عبيدا في حال عدمنا ووجودنا فكل ما أمر سمعنا وأطعنا في حال عدمنا ووجودنا إذا لم يخاطبنا بفهوانية الأمثال والأشكال فإذا خاطبنا بفهوانية الأمثال والأشكال والسنة الإرسال فمن كان منا مشهوده ما وراء الحجاب وهو المثل والرسول سمع فأطاع من حينه ومن كان مشهوده المثل سمع ضرورة ولم يطلع للحسد الذي خلق عليه من تقدم أمثاله عليه فظهر المطيع والعاصي أي عصى على مثله لكونه ما نفذ فيه أمره بالطاعة ما عصى على الله ولهذا قال بعضهم إنما احتجب الله في الدنيا عن عباده لأنه سبق في علمه أنه يكلفهم ويأمرهم وينهاهم وقد قدر عليهم بمخالفة أمره وبموافقته في أوقات فلا بد من ظهور المخالفة والموافقة فخاطبهم على السنة الرسل عليه السلام وحجب ذاته سبحانه عنهم في صورة الرسول وذلك لأنه قال من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله وقال فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله فلو لا أن الرسول صورته الظاهرة المشهودة ما صح هذا القول فوقعت المخالفة من المخالف بالقدر السابق والحكم القضائي ولا يتمكن أن يخالف أمره على الكشف فانحجب بالإرسال انحجابه بالأسباب فوقع الذم على الأسباب فهي وقاية الرحمن فما خالف أحد الله تعالى وما خولف إلا الله تعالى فلا تزال الأسباب للمحجوبين مشهودة ولا يزال الحق للعارفين مشهودا مع عقلهم الحجب في حق من حجبته فكثف اللطيف عندهم ولطف الكثيف عند العارفين بالله‏\n\n\n> فيعلم العقل ما لا يشهد البصر *** وتشهد العين ما ترمي به الفكر\n\n\nفجمع العارفون بين العقل والبصر فلهم قلوب يفقهون بها ولهم أعين يبصرون بها ولهم آذان يسمعون بها والمحجوبون على قسمين منهم من له قلب لا يفقه به وعين لا يبصر بها ومنهم من له قلب يفقه به وله عين لا يبصر بها وهم المؤمنون فيعلمون ولا يشهدون ومن عداهم لا يعلمون ولا يشهدون وأهل الله يعلمون ويشهدون ولهذا إذا خاطبهم يسمعون ويطيعون ويشهدون ذواتهم محلا لما يخلق الله فيها مما يحكم فيه أنه مخالفة وموافقة فهو مطيع مهيا لقبول ما يتكون فيه كالرحم من المرأة مهيأ لما يتكون فيه غير ممتنع فالعبد الذي بهذه المثابة شجنة موجدة فهو رحمان في العالم رحيم بالمؤمنين فالرب زمانه المربوب والمربوب زمانه الرب لأنه ما ثبت الحكم لكل واحد بما حكم عليه به إلا بالآخر فمن كون كل واحد ينطلق عليه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ لا يكون واحد منهما زمانا للآخر لارتفاع النسب وهذا لا\n\n\nيكون إلا بالنظر لعين كل واحد لا لحكمه فإذا انتقلت إلى النظر في الحكم الذي هو موقوف على العالم به وعلى الحق بالعالم صح أن يكون الحكم من كل واحد زمانا للآخر كالمتضايفين متى صحت الأبوة لزيد على عمرو قيل حين صحت البنوة لعمرو من زيد فزمان أبوة زيد بنوة عمرو وزمان بنوة عمر وأبوة زيد فالأب زمانه الابن والابن زمانه الأب‏\nوكذلك الملك والملك والملك والمالك والقادر والمقدور والمريد والمراد والعالم والمعلوم غير أن العالم والمعلوم قد تكون العين واحدة لأنه قد يكون العالم يعلم نفسه فهو المعلوم لنفسه وهو العالم بنفسه فهو العالم المعلوم له بخلاف المريد والمراد لأن المراد لا يكون أبدا إلا معدوما ولا يكون المريد إلا موجودا وكذلك القادر والمقدور لا يكون المقدور أبدا إلا معدوما فإذا وجد فلا معدم له بعد وجوده إلا بنفسه أو إمساك شرط بقائه أي بقاء الوجود عليه غير ذلك لا يكون فقوله إِنْ يَشَأْ يُذْهِبْكُمْ يريد به مسك الشرط المصحح لبقاء الوجود عليكم فتنعدمون إذ لم يوجده سبحانه فإن له التخيير في إيجاد كل ممكن أو تركه على حاله من اتصافه بالعدم فإذ قد علمت بما ذكرناه ما هو الزمان فبعد ذلك أدخل مع الناس فيما دخلوا فيه من أن الزمان الليل والنهار والأيام أو الزمان مدة متوهمة تقطعها حركات الأفلاك أو الزمان مقارنة حادث لحادث يسأل عنه بمتى وأمثال هذه الأقوال ولا يضرك القول بها فإنها قد استقرت ولها صحة في النسب الزماني والله يُقَدِّرُ اللَّيْلَ والنَّهارَ بالإيلاج والغشيان والتكوير لإيجاد ما سبق في علمه أن يظهر فيه من الأحكام والأعيان في العالم العنصري فنحن أولاد الليل والنهار فما حدث في النهار فالنهار أمه والليل أبوه لأن لهما عليه ولادة وما ولد في الليل فالليل أمه والنهار أبوه فإن لهما عليه ولادة فلا يزال الحال في الدنيا ما دام الليل والنهار يغشى أحدهما الآخر فنحن أبناء أم وأب لمن ولد معنا في يومنا أو في ليلنا خاصة وما ولد في الليلة الثانية والنهار الثاني فأمثالنا ما هم إخوتنا لأن الليل والنهار جديدان فأبوانا قد انعدما فهذان أمثالهما لا أعيانهما وإن تشابها فهو تشابه الأمثال فإذا كان في الآخرة كان الليل في دار جهنم والنهار في دار الجنة فلم يجتمعا مع الولادة التي توجد في النار والجنان من حدوث التكوين فيهما فذلك مثل حواء من آدم ومثل عيسى من مريم فهذه هي ولادة الآخرة ضرب الله بعيسى ومريم وحواء وآدم مثلا لنا فيما يتكون في الآخرة فليس توليد الأكوان في الآخرة عن نكاح زماني بإيلاج ليل في نهار ونهار في ليل فإنهما مثلان في الزمان الذي هو اليوم الجامع لهما فقسمه الله في الآخرة بين الجنة والنار فأعطى ظلمة الليل للنار وأعطى نور النهار للجنة ومن مجموعهما يكون اليوم وهو يوم الآخرة فإنه جامع للدارين والزمان محصور في سنة وشهر وجمعة ويوم فيقسم الزمان على أربعة أقسام لأن الفصول الطبيعية أربعة لأن الأصل في وجود الزمان الطبيعة ورتبتها دون النفس وفوق الهباء الذي يسميه الحكماء الهيولى الكل وحكم التربيع فيها من حكم التربيع في الأحكام الإلهية من حياة وعلم وقدرة وإرادة بهذه الأربعة ثبتت الألوهة للاله فظهر التربيع في الطبيعة ثم نزل الأمر فظهر التربيع في الزمان الأكبر وهو السنة فانقسمت السنة إلى أربعة فصول ربيع وصيف وخريف وشتاء أحدث هذا الحكم فيها نزول الشمس في البروج والبروج قسمتها الطبيعة تقسيمها العناصر التي هي الأركان إلى نارية وهوائية ومائية وترابية كما قسمت العناصر إلى نار وهواء وماء وتراب كما قسمت الأخلاط في الحيوان إلى صفراء ودم وبلغم وسوداء ثم اندرج الزمان الصغير الذي هو الشهر والجمعة في الزمان الكبير وتعددت الشهود بتعداد البروج اثني عشر شهرا فقسمت عليها الأيام بحكم الرأي إلا أيام العرب أعني شهور العرب فإنها مقسمة بسير القمر فهي مقسمة بتقسيم الله لا بتقسيمنا فلما ظهرت السنة بقطع الشمس هذه البروج كذلك ظهر الشهر العربي بقطع القمر هذه البروج فالشهر الإلهي ثمانية وعشرون يوما وشهر الرؤية والتقدير بحسب الواقع ثم يقع التقدير في الزمان الممتد بأحد هذه الأربعة إما بالسنة أو بالشهر أو بالجمعة أو باليوم لا يقع التقدير إلا بهذا وأعني باليوم الصغير من طلوع الشمس إلى طلوع الشمس مثلا وهو الذي يحدث عنه انتهاء دورة الفلك المحيط الذي يدور بالكل وهو الذي يتعين بالعين كما قلنا بطلوع الشمس طلوع الشمس مثلا فيعلم إن الدورة المحيطة بالأفلاك قد انتهت في أعيننا ولا حد لها في نفسها في الفلك المحيط سوى دورة واحدة لا تتصف بالانتهاء فنحن فرضنا\n\n\nفيها البدء والغاية والإعادة والتكرار ما هي في نفسها بهذا الحكم والأيام كثيرة ولكن لا تعد إلا بهذا اليوم الصغير المعلوم عندنا الجامع لليل والنهار فتعد الأيام به أو بالشهر أو بالسنة لا غير وقد ورد إِنَّ يَوْماً عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ بهذا اليوم الصغير وقد ورد في يَوْمٍ كانَ مِقْدارُهُ خَمْسِينَ أَلْفَ سَنَةٍ وأيام الدجال يوم كسنة ويوم كشهر ويوم كجمعة\n\n\nوسائر أيامه كأيامنا المعهودة فاليوم الذي نعد به الأيام الكبار هو يوم الشمس ويوم القمر ثمانية وعشرون‏\nيوما من أيام الشمس وكذلك نأخذ أيام كل كوكب بهذا اليوم الحاكم على الكل إذ كان انتهاء دورة الفلك المحيط فنأخذ يوم كل كوكب بقدر قطعه الفلك الأقصى وهو الأطلس الذي لا كوكب فيه فأكبرها قطعا فيه فلك الكواكب الثابتة وإنما سميت ثابتة لأن الأعمار لا تدرك حركتها القصر الأعمار لأن كل كوكب منها يقطع الدرجة من الفلك الأقصى في مائة سنة إلى أن تنتهي إليها فما اجتمع من السنين فهو يوم ذلك الكواكب فيحسب ثلاثمائة وستين درجة كل درجة مائة سنة وقد ذكر لنا في التأريخ المتقدم أن تاريخ أهرام مصر بنيت والنسر في الأسد وهو اليوم عندنا في الجدي فاعمل حساب ذلك تقرب من علم تاريخ الأهرام‏\n\n\n> فلم يدر بانيها ولم يدر أمرها *** على أن بانيها من الناس بالقطع‏\n\n\nولقد أراني الحق تعالى فيما يراه النائم وأنا طائف بالكعبة مع قوم من الناس لا أعرفهم بوجوههم فأنشدونا بيتين ثبت على البيت الواحد ومضى عني الآخر فكان الذي ثبت عليه من ذلك‏\n\n\n> لقد طفنا كما طفتم سنينا *** بهذا البيت طرا أجمعينا\n\n\nوخرج عني البيت الآخر فتعجبت من ذلك فقال لي واحد منهم وتسمى لي باسم لا أعرف ذلك الاسم ثم قال لي أنا من أجدادك قلت له كم لك منذ مت فقال لي بضع وأربعون ألف سنة فقلت له فما لآدم هذا القدر من السنين فقال لي عن أي آدم تقول عن هذا الأقرب إليك أو عن غيره‏\n\n\nفتذكرت حديثا عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن الله خلق مائة ألف آدم‏\n\n\nفقلت قد يكون ذلك الجد الذي نسبني إليه من أولئك والتأريخ في ذلك مجهول مع حدوث العالم بلا شك فإن العالم لا تصح له رتبة القدم أي نفي الأولية لأنه مفعول لله أوجده عن عدم مرجح بوجود مرجح لأن الإمكان له من ذاته فالترجيح لا يزال له وكل ما زاد على الأعيان التي هي محل ظهور الأحكام فصورتها صورة الزمان نسب وإضافات لا أعيان لها من أكوان وألوان ونعوت وصفات ولكل نسبة وإضافة وكون ولون ونعت وصفة اسم خاص أو أسماء هذا تحقيق الأمر في كل ما ذكرناه وقل بعد ذلك ما شئت‏\n\n",
    "en": "## Chapter 390: Concerning the Knowledge of the Descent of the Time of a Thing, which is its Existence, except that I have no time, and except that You have no time, so You are my time, and I am Your time.\n\nIf we say that the Attribute is the Essence,\nThen where is the One described by the Attribute?\n\nThe True Address has indeed come to us,\nWe received it through the sending forth (of the Messenger) from Him,\n\nThat Allah has no partner,\nNor likeness, nor can His quiddity (كنه) be revealed.\n\nIf you attain the secret of the Cosmos within Him,\nThen be upon knowledge concerning it, and guard it.\n\nWhenever you say, \"Am I not I without Him?\"\nThen the opposite of that saying and determination is \"Who is He?\"\n\nIf you verify my saying, O my counterpart (قسيمي),\nYou will know, and you will not say, \"Who are You? Who is He?\"\n\nAllah the Exalted said, relating the speech of a people who say: <<وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ>> (And nothing destroys us except Time/Dahr). And they spoke truly, for it has been authentically established from the Messenger of Allah (may Allah bless him and grant him peace) that Allah is Time (الدهر). Thus, nothing destroyed them except Allah, as is the case in the matter itself.\n\n### [That Time (الزمان) is a relation (نسبة) and has no existence in its essence (عينه)]\n\nKnow that Time (الزمان) is a relation (نسبة) and has no existence in its essence (عينه). People have prolonged discussion concerning its quiddity (ماهيته), and the conclusion derived from their discourse is what we have mentioned: that it is a relation, and that it comes into being through the occurrence of the question \"when\" (متى). Thus, names arise for it through the occurrence of the question, such as *hīn* (a time), *idh* (when), *idhā* (if/when), and all conditional particles, which are names of Time. The named object (المسمى) is a non-existent matter (أمر عدمي), like the word \"non-existence\" (العدم), which is a name whose referent has no essence, even while its ruling is intellectually conceived.\n\nLet us provide an example so that what we have mentioned may be understood. It is said: \"When did Zayd come?\" The answer is, for example, \"When the sun rose,\" or \"If the sun rises.\" And \"When will the sun rise from its setting place?\" [The answer is] \"When Allah permits it to do so,\" or \"If Allah permits it,\" or \"Whenever Allah permits it, it will rise.\" In response to \"Will the sun rise from the West and then return to the East?\" the answer is this and its like. From this, Time is intellectually conceived. \"If Zayd comes, I will honor you.\" The meaning is: \"When Zayd comes, I will honor you.\" The meaning is: the time of Zayd’s coming is the time when honoring you becomes obligatory upon me, which I made obligatory upon myself by Zayd’s coming. Thus, for originated things (المحدثات), it is Time (زمان), and for the Eternal (القديم), it is Eternity without beginning (أزل).\n\nIts intellectual conception is an imagined, extended matter (أمر متوهم ممتد) that has no two ends. We apply the ruling of the Past to what has passed within it, and we apply the ruling of the Future to what will come within it, and we apply the ruling of the Present to what is currently within it, which is named the Now (الآن). Although the Now is Time, it is the boundary (حد) for what has passed in Time and what is anticipated in Time, like a point assumed on the circumference of a circle, which defines the beginning and the end wherever you assume it to be. Thus, Azal (أزل) and Abad (أبد) are the absence of the two ends of Time; it has no beginning and no end. Permanence (الدوام) belongs to it, and it is the time of the Present state (زمان الحال). The Present state has Permanence.\n\nThe World (العالم) remains perpetually under the ruling of the time of the Present state (زمان الحال), and the ruling of Allah in the World remains perpetually under the ruling of Time. What has passed of it and what is anticipated remains perpetually under the ruling of the time of the Present state. Do you not see in the speech of Allah, in His informing us of matters that have concluded, He expressed them using the past tense, and matters that will come, He expressed them using the future tense, and matters that are occurring, He expressed them using the present tense? The Present state is: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is engaged in [some] affair). The Past is: <<وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا>> (And I had created you before, when you were nothing). The Future is: <<إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (When We intend a thing, Our saying to it is only 'Be,' and it is), and <<سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ>> (I will turn away from My signs those who are arrogant), and <<سَأُرِيكُمْ آيَاتِي فَلَا تَسْتَعْجِلُونِ>> (I will show you My signs, so do not hasten Me).\n\nWe seek, alongside all this, an existent entity (عينا وجودية) that contains all this, acting as a vessel (كالظرف) for it, but we do not find it, neither intellectually nor sensually. Rather, we find an imaginary vessel (وهما ظرفيا). That vessel is contained by an unending, imagined vessel (ظرف متوهم لا يتناهى) ruled by imagination (الوهم) and nothing else. Therefore, there is nothing there—if you intellectually conceive what is conceived by imagination and not by intellect or sense—except the True Existence (الوجود الحق) upon which we rely for our existence.\n\nDue to this relation (النسبة), [Time] is named *Dahr* (الدهر) for us, so that the ruling belongs only to Him, not to what is imagined concerning the ruling of Time, since there is no ruler except Allah. In Him, the essences of things (أعيان الأشياء) appeared with their rulings. He is the Permanent Existence (الوجود الدائم). The essences of contingent things (أعيان الممكنات), with their rulings, appear from behind the veil of His Existence (وجوده) due to His Subtlety (لطافته). We see the essences of contingent things—which are our essences—from behind the veil of His Existence, but we do not see Him, just as we see the stars from behind the veils of the heavens, yet we do not see the heavens, even though we intellectually conceive that there are heavens between us and the stars. However, due to their subtlety, they do not veil what is behind them. And Allah is <<لَطِيفٌ بِعِبَادِهِ>> (Subtle with His servants).\n\nPart of His Subtlety is that He is the One who brings them everything they are in, yet the eyes of the servants fall only upon the secondary causes (الأسباب) they witness, so they attribute what they are in to those causes. Thus, The Real (الحق) appeared by His being veiled. He is the Manifest (الظاهر) who is veiled. He is the Hidden (الباطن) for the veil, not for you, and He is the Manifest to you and to the veil. Glory be to Him who veiled Himself in His manifestation and manifested Himself in His veiling. No eye witnesses anything other than Him, yet the veils are not lifted from Him. He has never ceased to be a Lord, and we have never ceased to be servants, both in our state of non-existence and our state of existence. Everything He commanded, we heard and obeyed, both in our state of non-existence and our state of existence, provided He did not address us through the comprehension of similitudes and forms (فهوانية الأمثال والأشكال).\n\nIf He addresses us through the comprehension of similitudes and forms and the tongue of the sending forth (السنة الإرسال), then whoever among us witnesses what is beyond the veil—which is the similitude and the Messenger—hears and obeys immediately. But whoever witnesses the similitude hears out of necessity, and does not look up, due to the envy (الحسد) upon which he was created, that his similitudes preceded him. Thus, the obedient and the disobedient appeared. That is, he disobeyed his similitude because the command for obedience was not executed within him; he did not disobey Allah.\n\nFor this reason, some have said that Allah only veiled Himself from His servants in this world because it was predetermined in His Knowledge that He would charge them with duties, commanding and forbidding them, and He had decreed upon them both the contravention of His command and the compliance with it at various times. Therefore, the appearance of both contravention and compliance was inevitable. So, He addressed them through the tongues of the Messengers (peace be upon them) and veiled His Essence (ذاته) (Glory be to Him) from them in the form of the Messenger. This is because He said: <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ>> (Whoever obeys the Messenger has obeyed Allah), and He said: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ>> (Then grant him protection until he hears the Word of Allah). If the Messenger were not the manifest, witnessed form of Him, this saying would not be sound. Thus, the contravention occurred from the transgressor by the pre-ordained decree (القدر السابق) and the judicial ruling (الحكم القضائي), and he is unable to contravene His command upon Unveiling (الكشف). So, He veiled Himself through the sending forth (الإرسال), just as He veiled Himself through the secondary causes (الأسباب). The blame thus fell upon the causes, for they are the protection (وقاية) of the All-Merciful. No one has ever contravened Allah the Exalted, and no one has been contravened except Allah the Exalted. The secondary causes remain perpetually witnessed by the veiled, and The Real remains perpetually witnessed by the Gnostics (العارفين), even while they intellectually conceive the veils concerning those whom He has veiled. Thus, the Subtle (اللطيف) became dense (كثف) for them, and the Dense (الكثيف) became subtle (لطف) for the Gnostics of Allah.\n\nThe intellect knows what the sight does not witness,\nAnd the eye witnesses what the thought casts forth.\n\nThe Gnostics (العارفون) thus combine intellect and sight. They have hearts with which they understand, eyes with which they see, and ears with which they hear. The veiled (المحجوبون) are of two types: those who have a heart but do not understand with it, and an eye but do not see with it; and those who have a heart with which they understand, but an eye with which they do not see—these are the believers (المؤمنون), who know but do not witness. Those besides them neither know nor witness. The People of Allah (أهل الله) know and witness. Therefore, when He addresses them, they hear and obey, and they witness their essences (ذواتهم) as the locus (محلا) for what Allah creates within them, whether it is ruled as contravention or compliance. Thus, the servant is obedient, prepared to accept what is formed within him, like the womb of a woman, prepared for what is formed within it, without resistance. The servant who is in this state is an existent branch (شجنة موجدة). He is the All-Merciful (رحمان) in the World and the All-Compassionate (رحيم) toward the believers.\n\nThe Lord (الرب) is the time of the one nurtured (المربوب), and the one nurtured is the time of the Lord, because the ruling for each is established only by the other. Since the essence of each of them is subject to the statement <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), neither of them can be the time of the other, due to the removal of relations (النسب). This is only true when considering the essence (عين) of each, not its ruling (حكمه). However, if you shift to considering the ruling, which depends on the knower (العالم) for The Real (الحق) and on The Real for the knower, it is sound for the ruling of each to be the time of the other, like correlatives (المتضايفين). When the fatherhood of Zayd over Amr is sound, it is said: \"That is when the sonship of Amr to Zayd is sound.\" Thus, the time of Zayd’s fatherhood is Amr’s sonship, and the time of Amr’s sonship is Zayd’s fatherhood. The father’s time is the son, and the son’s time is the father.\n\nLikewise, the King and the Kingdom, the King and the Possessor, the Powerful and the Power, the Willer and the Willed, the Knower and the Known. However, the Knower (العالم) and the Known (المعلوم) may be the same entity, because the Knower may know himself; thus, he is the Known to himself and the Knower of himself. He is the Knower and the Known to himself. This differs from the Willer (المريد) and the Willed (المراد), because the Willed is always non-existent (معدوما), and the Willer is always existent. Likewise, the Powerful (القادر) and the Power (المقدور): the Power is always non-existent. If it comes into existence, nothing can render it non-existent after its existence except by itself, or by the withholding of the condition of its subsistence (بقاء) upon it. Nothing else can cause this. His saying: <<إِنْ يَشَأْ يُذْهِبْكُمْ>> (If He wills, He can do away with you) means the withholding of the condition that validates the subsistence of existence upon you, so you become non-existent, since He (Glory be to Him) did not bring it into existence. For Him is the choice regarding the bringing into existence of every possible thing or leaving it in its state of being qualified by non-existence.\n\nSince you have learned what Time is through what we have mentioned, you may then join the people in what they have engaged in: that Time is the night and the day and the days, or that Time is an imagined duration cut by the movements of the spheres, or that Time is the correlation of one originated event with another, about which one asks \"when\" (متى), and similar sayings. You are not harmed by adopting these sayings, for they are established and have validity within the temporal relations (النسب الزماني).\n\nAllah <<يُقَدِّرُ اللَّيْلَ والنَّهارَ>> (measures the night and the day) by insertion, covering, and coiling, in order to bring into existence the rulings and essences (الأحكام والأعيان) that were predetermined in His Knowledge to appear in the elemental world (العالم العنصري). We are the children of the night and the day. What occurs in the day, the day is its mother and the night is its father, because they have a birthright over it. What is born in the night, the night is its mother and the day is its father, for they have a birthright over it. This state continues in the world as long as the night and the day cover one another. We are the children of a mother and a father for those born with us specifically on our day or night. Those born on the second night and the second day are our similitudes, not our siblings, because the night and the day are new; our parents have ceased to exist. These are their similitudes, not their essences, even if they resemble each other; it is the resemblance of similitudes.\n\nWhen it is the Afterlife (الآخرة), the night will be in the abode of Hell (جهنم) and the day in the abode of Paradise (الجنة). They will not combine for the generation that occurs in the Fire and the Gardens from the occurrence of formation (التكوين) within them. That is like Eve from Adam, and like Jesus from Mary. This is the generation of the Afterlife. Allah set forth Jesus, Mary, Eve, and Adam as examples for us concerning what is formed in the Afterlife. The generation of beings in the Afterlife is not through temporal intercourse (نكاح زماني) by the insertion of night into day or day into night, for they are two similitudes in the Time which is the Day (اليوم) that encompasses them. Allah divided it in the Afterlife between Paradise and the Fire, giving the darkness of the night to the Fire and the light of the day to Paradise. From their totality comes the Day, which is the Day of the Afterlife, for it encompasses the two abodes.\n\nTime is confined to the year, the month, the week, and the day. Time is divided into four sections because the natural seasons are four, for the origin of the existence of Time is Nature (الطبيعة). Its level (رتبتها) is below the Soul (النفس) and above the Dust (الهباء), which the philosophers call the Universal Hylē (الهيولى الكل). The ruling of the fourfold division (التربيع) within it comes from the ruling of the fourfold division in the Divine Rulings (الأحكام الإلهية): Life, Knowledge, Power, and Will. By these four, Divinity (الألوهة) is established for the God. Thus, the fourfold division appeared in Nature. Then the command descended, and the fourfold division appeared in the Greater Time, which is the Year. The Year was divided into four seasons: spring, summer, autumn, and winter. This ruling was brought about within it by the descent of the sun into the constellations (البروج). Nature divided the constellations just as it divided the elements (العناصر)—which are the pillars—into fiery, airy, watery, and earthy, just as the elements were divided into fire, air, water, and earth, and just as the humors (الأخلاط) in the animal were divided into yellow bile, blood, phlegm, and black bile.\n\nThen the Smaller Time, which is the Month and the Week, was nested within the Greater Time. The witnesses multiplied with the multiplication of the constellations: twelve months. The days were divided among them according to opinion, except for the days of the Arabs—I mean the months of the Arabs—for they are divided by the course of the moon; they are divided by Allah’s division, not by our division. Just as the Year appeared by the sun traversing these constellations, so too did the Arab month appear by the moon traversing these constellations. The Divine Month is twenty-eight days, and the month of sighting and estimation depends on the actual occurrence.\n\nThen the estimation in extended Time occurs by one of these four: either by the Year, the Month, the Week, or the Day. Estimation occurs only by this. By the Small Day (اليوم الصغير), I mean from the rising of the sun to the rising of the sun, for example. This is what brings about the end of the rotation of the encompassing sphere (الفلك المحيط) that revolves around the whole. This is what is defined by the entity, as we said, by the rising of the sun to the rising of the sun, for example. Thus, it is known that the encompassing rotation of the spheres has ended in our eyes, yet it has no limit in itself in the encompassing sphere other than a single rotation that is not qualified by ending. We have assumed a beginning, an end, a repetition, and a recurrence in it, though it is not subject to this ruling in itself. The days are many, but they are counted only by this known Small Day (اليوم الصغير) that encompasses the night and the day. Days are counted by it, or by the month, or by the year, and nothing else. It has been reported: <<إِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ>> (Indeed, a day with your Lord is like a thousand years of what you count), referring to this Small Day. And it was reported concerning: <<فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ>> (In a Day the measure of which is fifty thousand years). And the days of the Dajjal (Antichrist): a day like a year, a day like a month, and a day like a week, and the rest of his days are like our customary days.\n\nThe Day by which we count the Great Days is the Day of the Sun. The Day of the Moon is twenty-eight days of the days of the Sun. Likewise, we take the days of every planet by this Day that rules over the whole, since it is the end of the rotation of the encompassing sphere (الفلك المحيط). We take the day of every planet according to its traversal of the furthest sphere, which is the Atlas Sphere (الأطلس) that contains no planet. The greatest traversal in it belongs to the sphere of the Fixed Stars (الكواكب الثابتة). They are only called fixed because the shortness of lifespans prevents the perception of their movement, for each star traverses one degree of the furthest sphere in one hundred years until it completes its cycle. The sum of the years is the day of that planet. Thus, it is calculated as three hundred and sixty degrees, each degree being one hundred years.\n\nIt has been mentioned to us in ancient history that the pyramids of Egypt were built when the star Al-Nasr (the Eagle) was in Leo (الأسد), and today it is in Capricorn (الجدي). Calculate that, and you will approach the knowledge of the history of the pyramids.\n\nThe builder did not know it, nor did he know its matter,\nAlthough its builder was certainly from among mankind.\n\nThe Real (الحق) showed me in a dream that I was circumambulating the Kaaba with a group of people whose faces I did not recognize. They recited two lines of poetry to me; I retained one line, and the other escaped me. The line I retained was:\n\nWe have indeed circumambulated, as you have circumambulated for years,\nAround this House, all of us entirely.\n\nThe other line escaped me, and I was astonished by that. One of them said to me—and he named himself with a name I do not know—then he said to me, \"I am one of your ancestors.\" I said to him, \"How long has it been since you died?\" He said to me, \"Forty-odd thousand years.\" I said to him, \"But Adam has not existed for that many years.\" He said to me, \"Which Adam are you speaking of? This one closest to you, or another?\"\n\nI then recalled a hadith from the Messenger of Allah (may Allah bless him and grant him peace) that Allah created one hundred thousand Adams.\n\nI said, \"That ancestor to whom he traced my lineage might be from among those [other Adams].\" The history concerning that is unknown, despite the undoubted origination (حدوث) of the World (العالم). For the World cannot be soundly assigned the rank of Eternity (القدم)—that is, the negation of beginning—because it is an effect (مفعول) of Allah, brought into existence from non-existence by a preponderant factor (مرجح) for existence, since possibility (الإمكان) belongs to it by its essence, and the preponderance remains perpetually His.\n\nEverything that is added to the Fixed Entities (الأعيان الثابتة)—which are the locus of the manifestation of the rulings—its form is the form of Time: relations (نسب) and additions (إضافات), not essences (أعيان) in themselves, such as occurrences (أكوان), colors (ألوان), attributes (نعوت), and qualities (صفات). Every relation, addition, occurrence, color, attribute, and quality has a specific name or names. This is the verification of the matter in everything we have mentioned. After this, say whatever you wish.",
    "ur": "باب تین سو نوے: شے کے وجود کے زمانے کی معرفت میں، سوائے میرے کہ میرا کوئی زمانہ نہیں، اور سوائے تیرے کہ تیرا کوئی زمانہ نہیں، پس تو میرا زمانہ ہے اور میں تیرا زمانہ ہوں۔\n\n> جب ہم کہتے ہیں کہ نعت (صفت) عین (ذات) ہے،\n> تو وہ واحد (اللہ) کہاں ہے جس کی یہ نعت ہے؟\n>\n> اور ہم میں حق (ذات حق) کا خطاب آیا ہے،\n> جسے ہم نے اس کی طرف سے ارسال (پیغام) کے ذریعے لیا ہے۔\n>\n> کہ اللہ کا کوئی شریک نہیں،\n> نہ کوئی مثل ہے اور نہ کوئی اس کی حقیقت (کنہ) کو ظاہر کر سکتا ہے۔\n>\n> پس اگر تو نے اس میں کائنات کا راز پا لیا،\n> تو اس کے بارے میں علم رکھ اور اسے محفوظ رکھ۔\n>\n> پس تو جو بھی کہے، کیا میں وہ نہیں ہوں جو اس کے بغیر ہے؟\n> تو قول کی ضد اور تعین (تعیین) کون ہے؟\n>\n> اے میرے ہم نشین! جب تو میرے قول کی تحقیق کرے گا،\n> تو جان لے گا اور یہ نہیں کہے گا کہ تو کون ہے یا وہ کون ہے۔\n\nاللہ تعالیٰ نے ان لوگوں کی حکایت بیان کرتے ہوئے فرمایا جو کہتے ہیں: وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ (اور ہمیں صرف زمانہ ہی ہلاک کرتا ہے)۔ اور انہوں نے سچ کہا، کیونکہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم سے یہ ثابت ہے کہ اللہ ہی دہر (الدهر) ہے۔ پس انہیں اللہ کے سوا کسی نے ہلاک نہیں کیا، جیسا کہ حقیقت میں ہے۔\n\n### [کہ زمانہ ایک نسبت (نسبة) ہے، اس کی اپنی ذات میں کوئی وجود (الوجود) نہیں]\n\nجان لو کہ زمانہ ایک نسبت (نسبة) ہے، اس کی اپنی ذات میں کوئی وجود (وجود) نہیں۔ لوگوں نے اس کی ماہیت پر بہت طویل کلام کیا ہے، اور ان کے کلام کا خلاصہ وہی نکلا جو ہم نے ذکر کیا کہ یہ ایک نسبت ہے، اور یہ \"متی\" (کب) کے سوال کے پیدا ہونے سے پیدا ہوتا ہے۔ پس سوال کے پیدا ہونے سے اس کے لیے نام پیدا ہوتے ہیں، جیسے حین (حين)، اِذ (إذ)، اِذا (إذا)، اور تمام حروف شرط (حروف الشرط) زمانے کے نام ہیں، اور مسمیٰ ایک عدمی امر ہے، جیسے لفظِ عدم (العدم)۔ کیونکہ یہ ایک ایسا نام ہے جس کے مسمیٰ کی کوئی عین (ذات) نہیں، باوجود اس کے کہ اس کے حکم کا تعقل (تعقل) کیا جاتا ہے۔ ہم ایک مثال دیتے ہیں تاکہ جو کچھ ہم نے ذکر کیا ہے وہ سمجھ میں آ جائے۔ کہا جاتا ہے: زید کب آیا؟ جواب: مثلاً جب سورج طلوع ہوا (حين طلعت الشمس)، اور جب سورج طلوع ہوا (وإذا طلعت الشمس)۔ اور سورج اپنے مغرب سے کب طلوع ہو گا؟ جب اللہ اسے اس کی اجازت دے گا (حين يأذن الله لها في ذلك)، اور جب اللہ اجازت دے گا (وإذا يأذن الله)، اور جب بھی اللہ اسے اجازت دے گا، وہ طلوع ہو جائے گا۔ یہ جواب ہو گا اس سوال کا کہ کیا سورج مغرب سے طلوع ہو کر دوبارہ مشرق کی طرف لوٹے گا؟ پس یہ اور اس کی مثالیں اس کا جواب ہوں گی، اور اس سے زمانہ سمجھ میں آتا ہے۔ اگر زید آئے گا تو میں تیرا اکرام کروں گا (إن جاء زيد أكرمتك)۔ اس کا مطلب ہے: جب زید آئے گا تو میں تیرا اکرام کروں گا۔ یعنی زید کے آنے کا زمانہ، تیرے اکرام کے واجب ہونے کا زمانہ ہے، جسے میں نے زید کے آنے پر اپنے اوپر واجب کیا ہے۔ پس یہ محدثات (حادث ہونے والی چیزوں) کے لیے زمانہ ہے، اور قدیم (اللہ) کے لیے ازل (أزل) ہے۔ اور اس کا معقول ہونا ایک موہوم، ممتد امر ہے جس کے دو کنارے نہیں ہیں۔ پس ہم اس پر ماضی کا حکم لگاتے ہیں اس کے لیے جو اس میں گزر چکا، اور مستقبل کا حکم لگاتے ہیں اس کے لیے جو اس میں آنے والا ہے، اور حال کا حکم لگاتے ہیں اس کے لیے جو اس میں موجود ہے۔ اور اسے الآن (اب) کہا جاتا ہے۔ اور الآن (الآن) اگرچہ زمانہ ہے، لیکن یہ اس کے لیے حد ہے جو زمانے میں گزر چکا اور جو زمانے میں آنے والا ہے، جیسے دائرے کے محیط میں ایک نقطہ فرض کیا جائے، تو جہاں تو اسے فرض کرے گا، وہاں سے اس کے لیے ابتدا اور انتہا متعین ہو جائے گی۔ پس ازل (الأزل) اور ابد (الأبد) زمانے کے کناروں کا عدم ہے، پس اس کی کوئی ابتدا نہیں اور نہ کوئی انتہا، اور اس کے لیے دوام (الدوام) ہے۔ اور یہ حال (الحال) کا زمانہ ہے، اور حال کے لیے دوام ہے۔ پس عالم ہمیشہ حال کے زمانے کے حکم میں رہے گا، اور اللہ کا حکم عالم میں ہمیشہ زمانے کے حکم میں رہے گا، اور جو کچھ اس میں گزر چکا اور جو کچھ آنے والا ہے، وہ ہمیشہ حال کے زمانے کے حکم میں رہے گا۔ کیا تو اللہ کے کلام میں نہیں دیکھتا کہ وہ ہمیں ان امور کے بارے میں خبر دیتا ہے جو گزر چکے ہیں، تو انہیں ماضی کے زمانے سے تعبیر کیا، اور ان امور کے بارے میں جو آئیں گے، تو انہیں مستقبل کے زمانے سے تعبیر کیا، اور ان امور کے بارے میں جو موجود ہیں، تو انہیں حال سے تعبیر کیا۔ پس حال یہ ہے: كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (وہ ہر دن ایک نئی شان میں ہوتا ہے)۔ اور ماضی یہ ہے: وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا (اور میں نے تجھے اس سے پہلے پیدا کیا جبکہ تو کچھ بھی نہ تھا)۔ اور مستقبل یہ ہے: إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ (جب ہم کسی چیز کا ارادہ کرتے ہیں تو اسے کہتے ہیں کہ ہو جا، تو وہ ہو جاتی ہے)، اور سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ (میں عنقریب اپنی آیات سے ان لوگوں کو پھیر دوں گا جو تکبر کرتے ہیں)، اور سَأُرِيكُمْ آيَاتِي فَلَا تَسْتَعْجِلُونِ (میں عنقریب تمہیں اپنی نشانیاں دکھاؤں گا، پس جلدی نہ کرو)۔ اور ہم اس سب کے باوجود ایک وجودی عین (ذات) کی تلاش کرتے ہیں جس میں یہ سب کچھ ہو، اور وہ اس کے لیے ظرف (ظرف) کی مانند ہو، تو ہم اسے نہ عقلی طور پر پاتے ہیں اور نہ حسی طور پر، لیکن وہمی طور پر ایک ظرف ہے۔ اور وہ ظرف ایک ایسے موہوم ظرف کے لیے مظروف (جسے رکھا گیا ہو) ہے جو لامتناہی ہے، جس کا حکم صرف وہم (الوہم) لگاتا ہے۔ پس وہاں کچھ نہیں ہے، اگر تو اس چیز کا تعقل کرے جو وہم سے سمجھی جاتی ہے، اور عقل یا حس سے نہیں سمجھی جاتی، سوائے وجود حق (الوجود الحق) کے، جس پر ہم اپنے وجود میں انحصار کرتے ہیں۔ پس اسی نسبت (نسبة) کی وجہ سے اسے ہمارے لیے دہر (الدهر) کہا جاتا ہے، تاکہ حکم صرف اسی کا ہو، نہ کہ زمانے کے موہوم حکم کا، کیونکہ اللہ کے سوا کوئی حاکم نہیں۔ پس اسی میں اشیاء کی اعیان (ذاتیں) اپنے احکام کے ساتھ ظاہر ہوئیں، پس وہ وجود دائم (الوجود الدائم) ہے۔ اور ممکنات (الممکنات) کی اعیان اپنے احکام کے ساتھ اس کے وجود کے پردے کے پیچھے سے ظاہر ہوتی ہیں، اس کی لطافت کی وجہ سے۔ پس ہم ممکنات کی اعیان کو دیکھتے ہیں، جو کہ ہماری اعیان ہیں، اس کے وجود کے پردے کے پیچھے سے، اور ہم اسے نہیں دیکھتے، جیسے ہم ستاروں کو آسمانوں کے پردوں کے پیچھے سے دیکھتے ہیں، اور آسمانوں کو نہیں دیکھتے، اگرچہ ہم یہ تعقل کرتے ہیں کہ ہمارے اور ستاروں کے درمیان آسمان ہیں، لیکن وہ لطافت کی وجہ سے اپنے پیچھے والے کو نہیں چھپاتے۔ اور اللہ لَطِيفٌ بِعِبَادِهِ (اپنے بندوں پر مہربان ہے)۔ پس اس کی لطافت میں سے یہ ہے کہ وہ ہی ہے جو ان کے پاس ہر وہ چیز لاتا ہے جس میں وہ ہیں، اور بندوں کی نگاہیں صرف ان اسباب (الأسباب) پر پڑتی ہیں جن کا وہ مشاہدہ کرتے ہیں، پس وہ اس چیز کو جو ان میں ہے، ان اسباب کی طرف منسوب کر دیتے ہیں۔ پس حق (الحق) اپنے حجاب (احتجاب) کے ذریعے ظاہر ہوا، پس وہ ظاہر (الظاهر) ہے جو محجوب (المحجوب) ہے، پس وہ حجاب کے لیے باطن (الباطن) ہے، تیرے لیے نہیں، اور وہ تیرے لیے اور حجاب کے لیے ظاہر ہے۔ پس پاک ہے وہ ذات جو اپنے ظہور میں محجوب ہوئی اور اپنے حجاب میں ظاہر ہوئی، پس کوئی آنکھ اس کے سوا کسی کا مشاہدہ نہیں کرتی، اور نہ ہی اس سے پردے اٹھتے ہیں۔ اور وہ ہمیشہ رب (رب) رہا، اور ہم اپنی عدم (عدم) اور وجود (وجود) کی حالت میں ہمیشہ بندے رہے۔ پس ہر وہ چیز جس کا اس نے حکم دیا، ہم نے اپنی عدم اور وجود کی حالت میں سنا اور اطاعت کی، جب اس نے ہمیں امثال (مثالوں) اور اشکال (شکلوں) کی فہوانیت (فہم میں آنے والی صورت) کے ساتھ مخاطب نہیں کیا۔ اور جب اس نے ہمیں امثال اور اشکال کی فہوانیت اور ارسال (پیغام رسانی) کی زبان سے مخاطب کیا، تو ہم میں سے جس کا مشہود (مشاہدہ کی جانے والی چیز) پردے کے پیچھے تھا، جو کہ مثل (المثل) اور رسول (الرسول) ہے، اس نے فوراً سنا اور اطاعت کی۔ اور جس کا مشہود مثل تھا، اس نے حسد (الحسد) کی وجہ سے سن کر اطاعت کی، جو اس پر پیدا کیا گیا تھا کہ اس کے امثال اس پر سبقت لے گئے، پس مطیع (اطاعت کرنے والا) اور عاصی (نافرمان) ظاہر ہوا۔ یعنی اس نے اپنے مثل کی نافرمانی کی، کیونکہ اس کا حکم اطاعت کے ساتھ اس میں نافذ نہیں ہوا، اس نے اللہ کی نافرمانی نہیں کی۔ اور اسی لیے بعض نے کہا ہے کہ اللہ نے دنیا میں اپنے بندوں سے پردہ کیا، کیونکہ اس کے علم میں یہ بات پہلے سے تھی کہ وہ انہیں مکلف کرے گا، حکم دے گا اور منع کرے گا، اور اس نے ان پر اپنے حکم کی مخالفت اور موافقت کو اوقات میں مقدر کر دیا تھا۔ پس مخالفت اور موافقت کا ظاہر ہونا ضروری ہے۔ پس اس نے انہیں رسولوں علیہم السلام کی زبان سے مخاطب کیا، اور اپنی ذات سبحانہ کو رسول کی صورت میں ان سے محجوب کر دیا۔ اور یہ اس لیے کہ اس نے فرمایا: مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ (جس نے رسول کی اطاعت کی، اس نے اللہ کی اطاعت کی)۔ اور فرمایا: فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ (پس اسے پناہ دے یہاں تک کہ وہ اللہ کا کلام سن لے)۔ اگر رسول اس کی ظاہری اور مشہود صورت نہ ہوتے تو یہ قول درست نہ ہوتا۔ پس مخالف کی طرف سے مخالفت سابقہ تقدیر اور قضائی حکم کے ذریعے واقع ہوئی، اور وہ کشف (الکشف) پر اس کے حکم کی مخالفت نہیں کر سکتا۔ پس وہ ارسال (پیغام رسانی) کے ذریعے محجوب ہوا، جیسے اسباب (الأسباب) کے ذریعے محجوب ہوا۔ پس اسباب پر مذمت واقع ہوئی، پس وہ رحمان کی حفاظت ہیں۔ پس کسی نے اللہ تعالیٰ کی مخالفت نہیں کی، اور نہ ہی اللہ تعالیٰ کے سوا کسی کی مخالفت کی گئی۔ پس محجوب لوگوں کے لیے اسباب ہمیشہ مشہود رہیں گے، اور عارفین (العارفین) کے لیے حق ہمیشہ مشہود رہے گا، باوجود اس کے کہ وہ ان پردوں کا تعقل کرتے ہیں جنہوں نے اسے محجوب کیا ہے۔ پس لطیف (اللطیف) ان کے نزدیک کثیف (کثیف) ہو گیا، اور کثیف عارفین باللہ کے نزدیک لطیف ہو گیا۔\n\n> پس عقل وہ جانتی ہے جس کا آنکھ مشاہدہ نہیں کرتی،\n> اور آنکھ اس کا مشاہدہ کرتی ہے جسے فکر (سوچ) پھینکتی ہے۔\n\nپس عارفین (العارفون) نے عقل (العقل) اور بصارت (البصر) کو جمع کیا، پس ان کے پاس دل ہیں جن سے وہ سمجھتے ہیں، اور ان کے پاس آنکھیں ہیں جن سے وہ دیکھتے ہیں، اور ان کے پاس کان ہیں جن سے وہ سنتے ہیں۔ اور محجوب لوگ دو قسموں پر ہیں: ان میں سے کچھ ایسے ہیں جن کے پاس دل ہے مگر وہ اس سے نہیں سمجھتے اور آنکھ ہے مگر وہ اس سے نہیں دیکھتے۔ اور ان میں سے کچھ ایسے ہیں جن کے پاس دل ہے جس سے وہ سمجھتے ہیں، اور آنکھ ہے جس سے وہ نہیں دیکھتے، اور وہ مومن (المؤمنون) ہیں۔ پس وہ جانتے ہیں مگر مشاہدہ نہیں کرتے۔ اور ان کے علاوہ نہ جانتے ہیں اور نہ مشاہدہ کرتے ہیں۔ اور اہل اللہ جانتے بھی ہیں اور مشاہدہ بھی کرتے ہیں۔ اور اسی لیے جب وہ انہیں مخاطب کرتا ہے تو وہ سنتے ہیں اور اطاعت کرتے ہیں، اور اپنی ذاتوں کا مشاہدہ کرتے ہیں کہ وہ اس چیز کا محل ہیں جسے اللہ ان میں پیدا کرتا ہے، جس کے بارے میں وہ حکم لگاتا ہے کہ یہ مخالفت ہے یا موافقت۔ پس وہ مطیع ہے، جو اس چیز کو قبول کرنے کے لیے تیار ہے جو اس میں بنتی ہے، جیسے عورت کا رحم اس چیز کے لیے تیار ہوتا ہے جو اس میں بنتی ہے، وہ انکار نہیں کرتا۔ پس وہ بندہ جو اس مرتبے پر ہے، وہ ایک موجودہ شاخ ہے، پس وہ عالم میں رحمان (رحمان) ہے، اور مومنوں پر رحیم (رحیم) ہے۔ پس رب (الرب) کا زمانہ مربوب (المربوب) ہے، اور مربوب کا زمانہ رب ہے، کیونکہ ان میں سے ہر ایک کے لیے حکم اس حکم کے ساتھ ثابت نہیں ہوا جو اس پر لگایا گیا مگر دوسرے کے ذریعے سے۔ پس چونکہ ہر ایک کی عین (ذات) پر لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثل کوئی چیز نہیں) کا اطلاق ہوتا ہے، اس لیے ان میں سے کوئی بھی دوسرے کا زمانہ نہیں ہو سکتا، کیونکہ نسبتیں ختم ہو جاتی ہیں۔ اور یہ صرف ہر ایک کی عین (ذات) کو دیکھنے سے ہوتا ہے، نہ کہ اس کے حکم کو۔ پس جب تو اس حکم کے دیکھنے کی طرف منتقل ہو گا جو عالم (جاننے والے) کے ساتھ اور حق (الحق) کے ساتھ عالم کے ذریعے موقوف ہے، تو یہ درست ہو گا کہ ہر ایک کا حکم دوسرے کا زمانہ ہو، جیسے متضايفین (متعلقہ چیزیں)۔ جب زید کے لیے عمرو پر پدری (الأبوة) درست ہوئی، تو کہا گیا: جب عمرو کے لیے زید سے فرزندی (البنوة) درست ہوئی۔ پس زید کی پدری کا زمانہ عمرو کی فرزندی ہے، اور عمرو کی فرزندی کا زمانہ زید کی پدری ہے۔ پس باپ کا زمانہ بیٹا ہے اور بیٹے کا زمانہ باپ ہے۔\n\nاور اسی طرح بادشاہ (الملك) اور بادشاہت (الملك)، اور بادشاہت اور مالک (المالك)، اور قادر (القادر) اور مقدور (المقدور)، اور مرید (المريد) اور مراد (المراد)، اور عالم (العالم) اور معلوم (المعلوم)۔ سوائے اس کے کہ عالم اور معلوم کی عین (ذات) ایک ہو سکتی ہے، کیونکہ عالم کبھی خود کو جانتا ہے، پس وہ اپنے لیے معلوم ہے، اور وہ خود کو جاننے والا ہے، پس وہ اس کے لیے عالم معلوم ہے۔ بخلاف مرید اور مراد کے، کیونکہ مراد ہمیشہ معدوم (نہ موجود) ہی ہوتا ہے، اور مرید ہمیشہ موجود ہی ہوتا ہے۔ اور اسی طرح قادر اور مقدور، مقدور ہمیشہ معدوم ہی ہوتا ہے۔ پس جب وہ موجود ہو جائے، تو وجود کے بعد اسے معدوم کرنے والا کوئی نہیں مگر خود وہ یا اس کے وجود کے باقی رہنے کی شرط کو روک لینا (إمساك شرط بقائه)۔ اس کے علاوہ ایسا نہیں ہو سکتا۔ پس اس کا قول: إِنْ يَشَأْ يُذْهِبْكُمْ (اگر وہ چاہے تو تمہیں لے جائے) سے مراد تم پر وجود کے باقی رہنے کی شرط کو روک لینا ہے، پس تم معدوم ہو جاؤ گے، کیونکہ اس نے اسے موجود نہیں کیا۔ کیونکہ اسے ہر ممکن (ممکن) کو موجود کرنے یا اسے عدم (العدم) کی صفت پر چھوڑ دینے کا اختیار ہے۔ پس جب تو نے اس سے جان لیا جو ہم نے ذکر کیا کہ زمانہ کیا ہے، تو اس کے بعد لوگوں کے ساتھ اس میں شامل ہو جا جس میں وہ شامل ہوئے ہیں کہ زمانہ رات اور دن (الليل والنهار) اور ایام ہیں، یا زمانہ ایک موہوم مدت ہے جسے افلاک کی حرکتیں کاٹتی ہیں، یا زمانہ ایک حادث کا دوسرے حادث کے ساتھ مقارنت (ملاپ) ہے جس کے بارے میں \"متی\" (کب) سے سوال کیا جاتا ہے۔ اور اس طرح کے اقوال، اور ان کا کہنا تجھے نقصان نہیں دے گا، کیونکہ وہ مستقر ہو چکے ہیں اور زمانی نسبت (النسب الزماني) میں ان کی صحت ہے۔ اور اللہ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ (رات اور دن کا اندازہ کرتا ہے) ایلاج (داخل کرنے) اور غشیان (ڈھانپنے) اور تکویر (لپیٹنے) کے ذریعے، تاکہ وہ احکام اور اعیان ظاہر ہوں جو اس کے علم میں پہلے سے ہیں کہ وہ عنصری عالم (العالم العنصري) میں ظاہر ہوں۔ پس ہم رات اور دن کی اولاد ہیں۔ پس جو دن میں پیدا ہوا، دن اس کی ماں ہے اور رات اس کا باپ ہے، کیونکہ ان دونوں کی اس پر ولادت ہے۔ اور جو رات میں پیدا ہوا، رات اس کی ماں ہے اور دن اس کا باپ ہے، کیونکہ ان دونوں کی اس پر ولادت ہے۔ پس دنیا میں حال ہمیشہ یہی رہے گا جب تک رات اور دن ایک دوسرے کو ڈھانپتے رہیں گے۔ پس ہم ان کے بیٹے ہیں جو ہمارے ساتھ ہمارے دن یا ہماری رات میں پیدا ہوئے ہیں۔ اور جو دوسری رات اور دوسرے دن میں پیدا ہوا، وہ ہمارے امثال ہیں، ہمارے بھائی نہیں، کیونکہ رات اور دن نئے ہیں۔ پس ہمارے والدین معدوم ہو چکے ہیں، تو یہ ان کے امثال ہیں، ان کی اعیان نہیں، اگرچہ وہ مشابہت رکھتے ہیں، تو یہ امثال کی مشابہت ہے۔ پس جب آخرت ہو گی، تو رات دارِ جہنم (دار جهنم) میں ہو گی اور دن دارِ جنت (دار الجنة) میں ہو گا، پس وہ اس ولادت کے ساتھ جمع نہیں ہوں گے جو آگ اور جنت میں ان میں تکوین (تخلیق) کے حادث ہونے سے پائی جاتی ہے۔ پس یہ حوا (حواء) کی آدم (آدم) سے مثال ہے، اور عیسیٰ (عيسى) کی مریم (مريم) سے مثال ہے۔ پس یہ آخرت کی ولادت ہے، اللہ نے عیسیٰ اور مریم اور حوا اور آدم کو ہمارے لیے مثال بنایا ہے اس چیز میں جو آخرت میں بنے گی۔ پس آخرت میں اکوان (تخلیقات) کی پیدائش زمانی نکاح (نكاح زماني) سے نہیں ہو گی، یعنی رات کا دن میں اور دن کا رات میں داخل ہونا۔ کیونکہ وہ اس زمانے میں مثل ہیں جو ان دونوں کو جمع کرتا ہے، یعنی دن۔ پس اللہ نے اسے آخرت میں جنت اور دوزخ کے درمیان تقسیم کر دیا، پس رات کی تاریکی آگ کو دی، اور دن کا نور جنت کو دیا۔ اور ان کے مجموعے سے دن بنتا ہے، اور وہ آخرت کا دن ہے، کیونکہ وہ دونوں گھروں کو جمع کرتا ہے۔ اور زمانہ سال، مہینے، ہفتے اور دن میں محدود ہے۔ پس زمانہ چار حصوں پر تقسیم ہوتا ہے، کیونکہ طبعی موسم چار ہیں، کیونکہ زمانے کے وجود کی اصل طبیعت (الطبيعة) ہے، اور اس کا مرتبہ نفس (النفس) سے نیچے اور ہباء (الهباء) سے اوپر ہے، جسے حکماء ہیولیٰ کل (الهيولى الكل) کہتے ہیں۔ اور اس میں تربيع (چوکور ہونے) کا حکم الٰہی احکام میں تربيع کے حکم سے ہے، جیسے حیات (زندگی)، علم (علم)، قدرت (قدرت)، اور ارادہ (ارادہ)۔ ان چاروں سے الٰہ کے لیے الوہیت (الألوهة) ثابت ہوئی۔ پس طبیعت میں تربيع ظاہر ہوا، پھر امر نازل ہوا، تو سب سے بڑے زمانے یعنی سال میں تربيع ظاہر ہوا۔ پس سال چار موسموں میں تقسیم ہوا: ربیع (بہار)، صیف (گرمی)، خریف (خزاں)، اور شتاء (سردی)۔ اس حکم کو اس میں سورج کا برجوں میں نزول پیدا کرتا ہے، اور برجوں کو طبیعت نے تقسیم کیا ہے، جیسے اس نے عناصر (الأركان) کو ناری، ہوائی، مائی اور ترابی میں تقسیم کیا، جیسے عناصر کو آگ، ہوا، پانی اور مٹی میں تقسیم کیا، جیسے حیوان میں اخلاط (مزاجوں) کو صفراء، خون، بلغم اور سوداء میں تقسیم کیا گیا۔ پھر چھوٹا زمانہ جو کہ مہینہ اور ہفتہ ہے، بڑے زمانے میں شامل ہو گیا، اور برجوں کی تعداد کے ساتھ گواہوں کی تعداد بارہ مہینے ہو گئی، پس ان پر ایام کو رائے کے حکم سے تقسیم کیا گیا، سوائے عربوں کے ایام کے، یعنی عربوں کے مہینوں کے، کیونکہ وہ چاند کی گردش سے تقسیم کیے گئے ہیں، پس وہ اللہ کی تقسیم سے تقسیم کیے گئے ہیں، نہ کہ ہماری تقسیم سے۔ پس جب سال سورج کے ان برجوں کو کاٹنے سے ظاہر ہوا، اسی طرح عربی مہینہ چاند کے ان برجوں کو کاٹنے سے ظاہر ہوا۔ پس الٰہی مہینہ اٹھائیس دن کا ہے، اور رؤیت (دیکھنے) اور تقدیر (اندازہ لگانے) کا مہینہ واقع کے مطابق ہے۔ پھر ممتد زمانے میں ان چاروں میں سے کسی ایک کے ذریعے تقدیر واقع ہوتی ہے، یا سال سے، یا مہینے سے، یا ہفتے سے، یا دن سے۔ تقدیر صرف اسی سے واقع ہوتی ہے۔ اور دن سے میری مراد چھوٹا دن ہے، مثلاً سورج کے طلوع ہونے سے سورج کے طلوع ہونے تک، اور یہی وہ ہے جس سے محیط فلک (الفلك المحيط) کے دورے کا اختتام ہوتا ہے جو سب کو گھیرے ہوئے ہے۔ اور یہی وہ ہے جو عین (آنکھ) سے متعین ہوتا ہے، جیسا کہ ہم نے کہا، مثلاً سورج کے طلوع ہونے سے سورج کے طلوع ہونے تک۔ پس یہ معلوم ہوتا ہے کہ افلاک کو گھیرنے والے دورے کا اختتام ہماری آنکھوں میں ہو چکا ہے، اور اس کی اپنی ذات میں محیط فلک میں کوئی حد نہیں سوائے ایک دورے کے جو اختتام کی صفت سے متصف نہیں ہوتا۔ پس ہم نے اس میں ابتدا، انتہا، اعادہ (دہرانا) اور تکرار (بار بار ہونا) فرض کیا ہے، جبکہ وہ اپنی ذات میں اس حکم پر نہیں ہے۔ اور ایام بہت ہیں، لیکن ان کی گنتی صرف اسی چھوٹے دن سے ہوتی ہے جو ہمارے نزدیک معلوم ہے اور جو رات اور دن کو جمع کرتا ہے۔ پس ایام کی گنتی اس سے یا مہینے سے یا سال سے ہوتی ہے، اس کے علاوہ نہیں۔ اور یہ وارد ہوا ہے: إِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ (بے شک تیرے رب کے نزدیک ایک دن تمہاری گنتی کے ہزار سال جیسا ہے) اس چھوٹے دن کے ساتھ۔ اور یہ بھی وارد ہوا ہے: فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ (ایک دن میں جس کی مقدار پچاس ہزار سال تھی)۔ اور دجال کے دن، ایک دن سال کے برابر، ایک دن مہینے کے برابر، اور ایک دن ہفتے کے برابر ہو گا، اور اس کے باقی دن ہمارے معمول کے دنوں کی طرح ہوں گے۔ پس وہ دن جس سے ہم بڑے دنوں کو گنتے ہیں، وہ سورج کا دن ہے، اور چاند کا دن سورج کے دنوں میں سے اٹھائیس دن کا ہوتا ہے۔ اور اسی طرح ہم ہر سیارے کے دن کو اس دن سے لیتے ہیں جو سب پر حاکم ہے، کیونکہ یہ محیط فلک کے دورے کا اختتام ہے۔ پس ہم ہر سیارے کا دن اس کی اس مقدار سے لیتے ہیں جو وہ سب سے دور کے فلک کو کاٹتا ہے، جو کہ اطلس (الأطلس) ہے جس میں کوئی سیارہ نہیں ہے۔ پس ان میں سب سے بڑا قطع کرنے والا ثابت ستاروں کا فلک (فلك الكواكب الثابتة) ہے۔ اور انہیں ثابت اس لیے کہا گیا کہ عمروں کی کمی کی وجہ سے عمریں ان کی حرکت کو نہیں پا سکتیں، کیونکہ ان میں سے ہر سیارہ سب سے دور کے فلک کی ایک درجہ کو سو سال میں کاٹتا ہے، یہاں تک کہ وہ اس تک پہنچ جائے۔ پس جو سال جمع ہوئے، وہ اس سیارے کا دن ہے۔ پس تین سو ساٹھ درجے شمار کیے جائیں گے، ہر درجہ سو سال کا۔ اور ہمیں قدیم تاریخ میں ذکر کیا گیا ہے کہ مصر کے اہرام اس وقت بنائے گئے جب نسر (عقاب) اسد (شیر) میں تھا، اور آج وہ ہمارے نزدیک جدی (بکری) میں ہے۔ پس اس کا حساب کر، تو اہرام کی تاریخ کے علم کے قریب ہو جائے گا۔\n\n> نہ اس کے بنانے والے کو معلوم ہوا اور نہ اس کے امر کو،\n> باوجود اس کے کہ اس کا بنانے والا یقیناً لوگوں میں سے تھا۔\n\nاور حق تعالیٰ نے مجھے خواب میں دکھایا، جب میں کعبہ کا طواف کر رہا تھا، کچھ لوگوں کے ساتھ جن کے چہرے میں نہیں پہچانتا تھا، تو انہوں نے مجھے دو شعر سنائے، جن میں سے ایک شعر مجھے یاد رہا اور دوسرا مجھ سے جاتا رہا۔ پس جو مجھے یاد رہا وہ یہ تھا:\n\n> لَقَدْ طُفْنَا كَمَا طُفْتُمْ سِنِينَا *** بِهَذَا الْبَيْتِ طُرًّا أَجْمَعِينَا\n> (ہم نے بھی تمہاری طرح سالوں تک طواف کیا، اس گھر کا، سب کے سب مکمل طور پر)\n\nاور دوسرا شعر مجھ سے جاتا رہا۔ تو مجھے اس پر تعجب ہوا، تو ان میں سے ایک نے مجھ سے بات کی اور اپنا نام بتایا، میں اس نام کو نہیں جانتا۔ پھر اس نے مجھ سے کہا: میں تمہارے اجداد میں سے ہوں۔ میں نے اس سے کہا: تمہیں مرے ہوئے کتنا عرصہ ہو گیا؟ تو اس نے مجھ سے کہا: بیالیس ہزار سال سے کچھ اوپر۔ تو میں نے اس سے کہا: آدم (آدم) کی تو اتنی عمر نہیں ہے۔ تو اس نے مجھ سے کہا: تم کس آدم کی بات کر رہے ہو؟ اس کی جو تمہارے قریب ہے یا کسی اور کی؟\n\nتو مجھے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی ایک حدیث یاد آئی کہ اللہ نے ایک لاکھ آدم پیدا کیے۔\n\nتو میں نے کہا: ہو سکتا ہے کہ وہ دادا جس کی طرف اس نے مجھے منسوب کیا، ان میں سے ہو۔ اور اس بارے میں تاریخ نامعلوم ہے، باوجود اس کے کہ عالم کا حادث ہونا بلا شک ہے۔ کیونکہ عالم کے لیے قدم (قدیم ہونے) کا مرتبہ درست نہیں، یعنی اولیت کی نفی، کیونکہ وہ اللہ کا مفعول ہے جسے اس نے عدم (عدم) سے وجود کے مرجح (ترجیح دینے والے) کے ساتھ موجود کیا، کیونکہ امکان (الإمكان) اس کے لیے اس کی ذات سے ہے۔ پس ترجیح ہمیشہ اسی کے لیے ہے۔ اور ہر وہ چیز جو اعیان (ذاتوں) پر زیادہ ہے جو احکام کے ظہور کا محل ہیں، تو ان کی صورت زمانے کی صورت ہے، نسبتیں (نسب) اور اضافات (إضافات) ہیں، نہ کہ ان کی اعیان، جیسے اکوان (تخلیقات)، الوان (رنگ)، نعوت (صفات) اور صفات (صفات)۔ اور ہر نسبت، اضافہ، کون، رنگ، نعت اور صفت کے لیے ایک خاص نام یا نام ہیں۔ یہ اس امر کی تحقیق ہے جو ہم نے ذکر کیا، اور اس کے بعد تو جو چاہے کہہ۔",
    "fa": "باب سیصد و نودم در معرفت منزلت زمان شیء که همان وجود آن است، جز اینکه من را زمانی نیست و تو را نیز زمانی نیست؛ پس تو زمان من هستی و من زمان تو هستم.\n\nاگر بگوییم که نعت (صفت) عین ذات است، *** پس آن یگانه (الواحد) که موصوف است، کجاست؟\n\nو همانا خطاب حق (الحق) درباره ما آمده است، *** که آن را از طریق ارسال (فرستادن) از او دریافت کردیم.\n\nکه خداوند را شریکی نیست، *** و نه مِثلی، و کُنه او را چیزی آشکار نمی‌سازد.\n\nپس اگر راز هستی (الکون) را در او یافتی، *** بر آن علم داشته باش و آن را حفظ کن.\n\nپس هرگاه گفتی: آیا من بدون او نیستم؟ *** پس ضد این قول و تعیین، او کیست؟\n\nای همتای من، اگر قول مرا محقق سازی، *** خواهی دانست و نخواهی گفت که تو کیستی یا او کیست.\n\nخداوند متعال در حکایت از قومی که می‌گویند: «وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ» (و ما را جز دهر (روزگار) هلاک نمی‌کند)، فرموده است. و آنان راست گفتند، زیرا از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) ثابت شده است که: «همانا خداوند همان دهر است.» پس آنان را جز خداوند هلاک نکرده است، چنانکه در نفس‌الامر (حقیقت امر) چنین است.\n\n### [اینکه زمان یک نسبت (نسبة) است و در ذات خود وجودی ندارد]\n\nبدان که زمان یک نسبت (نسبة) است و در ذات خود وجودی ندارد. مردم در ماهیت آن سخن را به درازا کشانده‌اند و از مضمون کلامشان همان چیزی بیرون آمده که ما ذکر کردیم: اینکه زمان یک نسبت است و با پدید آمدن پرسش با «متی» (چه وقت) پدید می‌آید. و با پدید آمدن این پرسش، برای آن نام‌هایی مانند «حین»، «إذ»، «إذا» و تمام حروف شرط که همگی نام‌های زمان هستند، پدید می‌آید. و مسمای آن امری عدمی است، مانند لفظ «عدم» که نام مسمایی است که عینیت ندارد، با وجود اینکه حکم آن تعقل می‌شود. برای فهم آنچه ذکر کردیم، مثالی می‌آوریم: گفته می‌شود: «چه وقت زید آمد؟» پاسخ این است: «مثلاً هنگامی که خورشید طلوع کرد» (و إذا طلعت الشمس). و «چه وقت خورشید از مغربش طلوع می‌کند؟» پاسخ این است: «هنگامی که خداوند به آن اجازه دهد» (و إذا يأذن الله). و «هرگاه خداوند به آن اجازه دهد، طلوع می‌کند» در پاسخ به این پرسش که «آیا خورشید از مغرب طلوع می‌کند و دوباره مشرق می‌شود؟» پس این و امثال آن پاسخ آن خواهد بود و زمان از آن تعقل می‌شود. «اگر زید بیاید، تو را اکرام می‌کنم»؛ معنای آن این است: «هنگامی که زید بیاید، تو را اکرام می‌کنم». معنای آن: زمان آمدن زید، زمان وجوب اکرام تو بر من است که آن را با آمدن زید بر خود واجب کردم. پس زمان برای امور حادث (المحدثات) است و برای قدیم (القدیم) ازل است. و معقولیت آن امری موهوم و ممتد است که دو طرف ندارد. پس بر آنچه در آن گذشته است، حکم به ماضی می‌کنیم، و بر آنچه در آن می‌آید، حکم به مستقبل می‌کنیم، و بر آنچه در آن هست، حکم به حال می‌کنیم، که «الآن» نامیده می‌شود. و «الآن» اگرچه زمان است، اما حدی است برای آنچه در زمان گذشته و آنچه در زمان آینده است، مانند نقطه‌ای که در محیط دایره فرض می‌شود و برای آن آغاز و پایانی تعیین می‌شود، هر جا که آن را فرض کنی. پس ازل و ابد، عدمِ دو طرف زمان هستند؛ نه آغازی دارد و نه پایانی، و دوام از آنِ اوست، و آن زمان حال است. و حال دارای دوام است. پس عالم پیوسته در حکم زمان حال است، و حکم خداوند در عالم پیوسته در حکم زمان است، و آنچه از آن گذشته و آنچه در آینده است، پیوسته در حکم زمان حال است. آیا نمی‌بینی که در کلام خداوند، در خبر دادن به ما از اموری که سپری شده‌اند، با زمان ماضی تعبیر کرده است، و از اموری که می‌آیند، با زمان مستقبل تعبیر کرده است، و از اموری که در حال وقوع هستند، با حال تعبیر کرده است؟ پس حال این است: «كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» (هر روز او در کاری است). و ماضی این است: «وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا» (و تو را پیش از این آفریدم در حالی که چیزی نبودی). و مستقبل این است: «إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ» (هرگاه اراده کنیم که به چیزی بگوییم باش، پس می‌شود)، و «سَأَصْرِفُ عَنْ آيَاتِيَ الَّذِينَ يَتَكَبَّرُونَ» (به زودی کسانی را که تکبر می‌ورزند از آیات خود باز خواهم داشت)، و «سَأُرِيكُمْ آيَاتِي فَلَا تَسْتَعْجِلُونِ» (به زودی آیات خود را به شما نشان خواهم داد، پس عجله نکنید).\n\nو در کنار همه اینها، ما به دنبال یک عینیت وجودی (عین وجودیة) هستیم که همه اینها در آن باشد و آن برای اینها مانند ظرف باشد. اما آن را نه از طریق عقل و نه از طریق حس نمی‌یابیم، بلکه تنها یک توهم ظرفی است. و آن ظرف، مظروفِ ظرفی موهوم و نامتناهی است که تنها وهم بر آن حکم می‌کند. پس در آنجا چیزی نیست، اگر آنچه را که با وهم تعقل می‌شود و با عقل و حس تعقل نمی‌شود، درک کنی، مگر هستی حق (الوجود الحق) که در وجود خود به آن تکیه می‌کنیم. به دلیل همین نسبت است که برای ما «دهر» نامیده می‌شود تا حکم تنها از آنِ او باشد، نه از آنِ حکم موهوم زمان؛ زیرا حاکمی جز خداوند نیست. پس اعیان اشیاء با احکامشان در او ظاهر شدند. او هستی دائم (الوجود الدائم) است، و اعیان ممکنات با احکامشان از پشت حجاب وجود او به دلیل لطافت او ظاهر می‌شوند. پس ما اعیان ممکنات را که اعیان خود ما هستند، از پشت حجاب وجود او می‌بینیم، اما او را نمی‌بینیم، همان‌گونه که ستارگان را از پشت حجاب‌های آسمان‌ها می‌بینیم و آسمان‌ها را نمی‌بینیم، اگرچه تعقل می‌کنیم که بین ما و ستارگان آسمان‌هایی وجود دارد، اما آنها به دلیل لطافتشان، آنچه را که پشت آنهاست، محجوب نمی‌کنند. و خداوند «لَطِيفٌ بِعِبَادِهِ» (نسبت به بندگانش مهربان است). از لطف اوست که اوست که هر آنچه را که بندگان در آن هستند، برایشان می‌آورد، اما دیدگان بندگان جز بر اسبابی که مشاهده می‌کنند، نمی‌افتد، پس آنچه را که در آن هستند، به آن اسباب نسبت می‌دهند. پس حق (الحق) با احتجابش ظاهر شد. او ظاهرِ محجوب است. او باطن برای حجاب است، نه برای تو؛ و او ظاهر برای تو و برای حجاب است. پس پاک و منزه است کسی که در ظهورش محتجب شد و در حجابش ظاهر گشت. پس چشمی جز او را شهود (الشهود) نمی‌کند و حجاب‌ها از او برداشته نمی‌شوند. او پیوسته رب بوده و ما پیوسته بنده بوده‌ایم، چه در حال عدم و چه در حال وجودمان. پس هر آنچه امر کرد، در حال عدم و وجودمان شنیدیم و اطاعت کردیم، اگر ما را با فهم امثال و اشکال مورد خطاب قرار نداده باشد. اما اگر ما را با فهم امثال و اشکال و زبان ارسال (فرستادن رسولان) مورد خطاب قرار داد، پس هر کس از ما که مشهودش ماورای حجاب باشد، که همان مَثَل و رسول است، می‌شنود و در همان لحظه اطاعت می‌کند. و هر کس که مشهودش مَثَل باشد، از روی ضرورت می‌شنود و به دلیل حسدی که بر آن آفریده شده، به پیشی گرفتن امثال خود بر او توجه نمی‌کند. پس مطیع و عاصی ظاهر شد؛ یعنی بر مَثَل خود عصیان کرد، زیرا امر او به اطاعت در او نفوذ نکرد، نه اینکه بر خداوند عصیان کرده باشد. به همین دلیل برخی گفته‌اند: خداوند در دنیا از بندگانش محتجب شد، زیرا در علم سابق او بود که آنان را مکلف می‌کند و امر و نهی می‌نماید، و مقدر کرده بود که در اوقاتی با امر او مخالفت و در اوقاتی موافقت کنند. پس ظهور مخالفت و موافقت ضروری بود. بنابراین، آنان را بر زبان رسولان (علیهم السلام) مورد خطاب قرار داد و ذات سبحانه‌اش را در صورت رسول از آنان محجوب ساخت. این بدان سبب است که فرمود: «مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ» (هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است) و فرمود: «فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ» (پس او را پناه ده تا کلام خدا را بشنود). اگر رسول صورت ظاهری و مشهود نبود، این قول صحیح نمی‌بود. پس مخالفت از سوی مخالف به واسطه قدر سابق و حکم قضایی واقع شد، و او نمی‌تواند امر او را بر طریق کشف (الکشف) مخالفت کند. پس خداوند با ارسال (فرستادن رسول) محجوب شد، همان‌گونه که با اسباب محجوب می‌شود. پس سرزنش بر اسباب واقع شد، و آنها سپر و محافظ رحمان هستند. پس هیچ کس با خداوند متعال مخالفت نکرده است، و مخالفت تنها با خداوند متعال صورت گرفته است. پس اسباب پیوسته برای محجوبان مشهود است، و حق (الحق) پیوسته برای عارفان (العارفون) مشهود است، با وجود اینکه حجاب‌ها را در حق کسی که محجوبش کرده، تعقل می‌کنند. پس لطیف نزد آنان کثیف شد و کثیف نزد عارفان بالله لطیف گشت.\n\nپس عقل آنچه را که بصر (چشم) شهود نمی‌کند، می‌داند؛ *** و چشم آنچه را که فکر به آن می‌اندازد، شهود می‌کند.\n\nپس عارفان (العارفون) بین عقل و بصر جمع کردند؛ آنان دل‌هایی دارند که با آنها می‌فهمند، و چشمانی دارند که با آنها می‌بینند، و گوش‌هایی دارند که با آنها می‌شنوند. و محجوبان (المحجوبون) بر دو دسته‌اند: برخی از آنان دلی دارند که با آن نمی‌فهمند و چشمی که با آن نمی‌بینند. و برخی از آنان دلی دارند که با آن می‌فهمند و چشمی که با آن نمی‌بینند، و اینان مؤمنان هستند که می‌دانند اما شهود (الشهود) نمی‌کنند. و غیر از اینها نه می‌دانند و نه شهود می‌کنند. اما اهل الله می‌دانند و شهود می‌کنند. به همین دلیل، هنگامی که خداوند آنان را مورد خطاب قرار می‌دهد، می‌شنوند و اطاعت می‌کنند و ذوات خود را محلی برای آنچه خداوند در آنها خلق می‌کند و حکم به مخالفت یا موافقت آن می‌شود، شهود می‌کنند. پس او مطیع است و برای پذیرش آنچه در او تکوین می‌یابد، مهیاست، مانند رحم زن که برای تکوین آنچه در آن است، مهیاست و امتناع نمی‌ورزد. پس بنده‌ای که در این مرتبه است، شاخه‌ای موجود است؛ او در عالم رحمان است و نسبت به مؤمنان رحیم.\n\nپس رب (پروردگار) زمانِ مربوب (پرورده‌شده) است و مربوب زمانِ رب است؛ زیرا حکم برای هیچ یک از آن دو با آنچه بر او حکم شده، ثابت نمی‌شود مگر به واسطه دیگری. از آنجا که بر هر یک از آنها جاری می‌شود که «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست)، هیچ یک از آن دو نمی‌تواند زمان دیگری باشد، زیرا نسبت‌ها مرتفع می‌شوند. و این تنها با نظر به عینیت هر یک، نه به حکم او، ممکن است. اما اگر به حکم بنگری، که موقوف بر عالم به واسطه آن و موقوف بر حق (الحق) به واسطه عالم است، صحیح است که حکم هر یک از آن دو، زمان دیگری باشد، مانند متضایفین (امور متقابل). هرگاه ابوت (پدری) برای زید نسبت به عمرو صحیح باشد، گفته می‌شود: «هنگامی که بنوت (فرزندی) برای عمرو نسبت به زید صحیح باشد». پس زمان ابوت زید، بنوت عمرو است و زمان بنوت عمرو، ابوت زید است. پس پدر زمان پسر است و پسر زمان پدر.\n\nو همچنین است ملک (پادشاه) و مُلک (قلمرو)، و مُلک و مالک، و قادر و مقدور، و مرید (اراده‌کننده) و مراد (اراده‌شده)، و عالم و معلوم. جز اینکه در عالم و معلوم ممکن است عینیت یکی باشد، زیرا ممکن است عالم خود را بداند، پس او معلومِ خود است و عالمِ به خود است. پس او عالمِ معلوم برای خود است. برخلاف مرید و مراد، زیرا مراد (آنچه اراده شده) هرگز جز معدوم (نابود) نیست، و مرید (اراده‌کننده) هرگز جز موجود نیست. و همچنین قادر و مقدور؛ مقدور (آنچه مقدر شده) هرگز جز معدوم نیست. پس اگر موجود شد، پس از وجودش هیچ معدوم‌کننده‌ای برای او نیست مگر خودش، یا امساک (بازداشتن) شرط بقای او، یعنی بقای وجود بر او. غیر از این نمی‌شود. پس قول خداوند: «إِنْ يَشَأْ يُذْهِبْكُمْ» (اگر بخواهد شما را از بین می‌برد)، منظور از آن بازداشتن شرطی است که بقای وجود را بر شما تصحیح می‌کند، پس معدوم می‌شوید، زیرا او سبحانه آن را ایجاد نکرده است. زیرا او در ایجاد هر ممکن یا رها کردن آن بر حال خود که متصف به عدم است، اختیار دارد.\n\nپس اکنون که با آنچه ذکر کردیم، زمان را شناختی، پس از آن با مردم در آنچه وارد شده‌اند، وارد شو، مبنی بر اینکه زمان همان شب و روز و ایام است، یا زمان مدتی موهوم است که حرکات افلاک آن را قطع می‌کند، یا زمان مقارنت حادثی با حادث دیگر است که با «متی» از آن پرسیده می‌شود، و امثال این اقوال. و این اقوال به تو ضرری نمی‌رساند، زیرا آنها مستقر شده‌اند و در نسبت زمانی صحت دارند. و خداوند «يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ» (شب و روز را اندازه‌گیری می‌کند) با داخل شدن و پوشاندن و درهم پیچیدن، برای ایجاد آنچه در علم سابق او بوده که از احکام و اعیان در عالم عنصری در آن ظاهر شود. پس ما فرزندان شب و روز هستیم. آنچه در روز حادث شود، روز مادر آن و شب پدر آن است، زیرا هر دو بر آن ولادت دارند. و آنچه در شب متولد شود، شب مادر آن و روز پدر آن است، زیرا هر دو بر آن ولادت دارند. و این حال در دنیا ادامه دارد تا زمانی که شب و روز یکدیگر را بپوشانند. پس ما فرزندان یک مادر و یک پدر هستیم برای کسی که به طور خاص در روز یا شب ما متولد شده است. و کسانی که در شب دوم و روز دوم متولد شده‌اند، امثال ما هستند، نه برادران ما، زیرا شب و روز جدید هستند و پدر و مادر ما معدوم شده‌اند. پس اینها امثال آنها هستند نه اعیان آنها، و اگرچه شبیه باشند، این تشابه امثال است. اما هنگامی که در آخرت باشد، شب در سرای جهنم و روز در سرای بهشت خواهد بود. پس با ولادتی که در آتش و بهشت از حدوث تکوین در آن دو وجود می‌یابد، با هم جمع نمی‌شوند. این مانند حوا از آدم و مانند عیسی از مریم است. این ولادت آخرت است. خداوند عیسی و مریم و حوا و آدم را برای ما در آنچه در آخرت تکوین می‌یابد، مَثَل قرار داد. پس تولید اکوان در آخرت از نکاح زمانی با داخل شدن شب در روز و روز در شب نیست، زیرا آن دو در زمانی که روز جامع آنهاست، مَثَل یکدیگرند. پس خداوند آن را در آخرت بین بهشت و جهنم تقسیم کرد؛ تاریکی شب را به آتش داد و نور روز را به بهشت داد. و از مجموع آن دو، روز (یوم) حاصل می‌شود، که همان روز آخرت است، زیرا جامع هر دو سراست.\n\nو زمان در سال و ماه و هفته و روز محصور است. پس زمان به چهار بخش تقسیم می‌شود، زیرا فصول طبیعی چهارتا هستند. چون اصل در وجود زمان، طبیعت است و مرتبه آن پایین‌تر از نفس و بالاتر از هباء (غبار کیهانی) است که حکما آن را هیولای کل (الهيولى الكل) می‌نامند. و حکم تربیع (چهارگانه بودن) در آن، از حکم تربیع در احکام الهی است که عبارتند از: حیات، علم، قدرت و اراده. با این چهار، الوهیت برای اله ثابت شد. پس تربیع در طبیعت ظاهر شد، سپس امر نازل شد و تربیع در زمان اکبر که همان سال است، ظاهر گشت. پس سال به چهار فصل تقسیم شد: بهار، تابستان، پاییز و زمستان. این حکم در آن به واسطه نزول خورشید در برج‌ها پدید آمد. و طبیعت، برج‌ها را مانند تقسیم عناصر که ارکان هستند، به ناری، هوایی، مائی و ترابی تقسیم کرد، همان‌گونه که عناصر به آتش، هوا، آب و خاک تقسیم شدند، و همان‌گونه که اخلاط در حیوان به صفرا، خون، بلغم و سودا تقسیم شدند. سپس زمان کوچک‌تر که ماه و هفته است، در زمان بزرگ‌تر مندرج شد. و شهودها با تعدد برج‌ها، دوازده ماه، متعدد شدند. پس روزها بر آنها به حکم رأی تقسیم شدند، مگر ایام عرب، یعنی ماه‌های عرب، که با سیر قمر تقسیم شده‌اند. پس آنها به تقسیم خداوند تقسیم شده‌اند، نه به تقسیم ما. همان‌گونه که سال با قطع کردن خورشید این برج‌ها ظاهر شد، ماه عربی نیز با قطع کردن قمر این برج‌ها ظاهر شد. پس ماه الهی بیست و هشت روز است، و ماه رؤیت و تقدیر بر حسب واقع است. سپس تقدیر در زمان ممتد با یکی از این چهار مورد واقع می‌شود: یا با سال، یا با ماه، یا با هفته، یا با روز. تقدیر جز با اینها واقع نمی‌شود. و منظور من از روز کوچک، مثلاً از طلوع خورشید تا طلوع خورشید است، که پایان یافتن دور فلک محیط که بر همه می‌چرخد، از آن حاصل می‌شود. و این همان است که با چشم تعیین می‌شود، همان‌گونه که گفتیم، مثلاً با طلوع خورشید تا طلوع خورشید. پس دانسته می‌شود که دور محیط افلاک در دیدگان ما پایان یافته است، در حالی که در ذات خود در فلک محیط حدی ندارد، جز یک دور که متصف به انتها نیست. پس ما در آن آغاز و پایان و اعاده و تکرار را فرض کردیم، در حالی که در ذات خود با این حکم نیست.\n\nو روزها بسیارند، اما جز با این روز کوچک معلوم نزد ما که جامع شب و روز است، شمرده نمی‌شوند. پس روزها با آن، یا با ماه، یا با سال شمرده می‌شوند و نه غیر آن. و وارد شده است که: «إِنَّ يَوْمًا عِنْدَ رَبِّكَ كَأَلْفِ سَنَةٍ مِمَّا تَعُدُّونَ» (همانا یک روز نزد پروردگار تو مانند هزار سال از آن چیزی است که شما می‌شمارید)، با همین روز کوچک. و وارد شده است در: «فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ» (در روزی که مقدار آن پنجاه هزار سال بود). و روزهای دجال، یک روز مانند یک سال است، و یک روز مانند یک ماه، و یک روز مانند یک هفته، و بقیه روزهایش مانند روزهای معمول ماست. پس روزی که ما با آن روزهای بزرگ را می‌شماریم، روز خورشید است. و روز قمر بیست و هشت روز از روزهای خورشید است. و همچنین روزهای هر کوکبی را با این روز که حاکم بر همه است، می‌گیریم، زیرا این روز پایان دور فلک محیط است. پس روز هر کوکبی را به اندازه قطع کردن فلک اقصی (دورترین فلک) می‌گیریم، که همان فلک اطلس است که در آن کوکبی نیست. و بزرگترین آنها در قطع کردن این فلک، فلک کواکب ثابته است. و این کواکب ثابته نامیده شدند، زیرا عمرهای کوتاه ما حرکت آنها را درک نمی‌کنند. زیرا هر کوکبی از آنها یک درجه از فلک اقصی را در صد سال قطع می‌کند تا به آن برسد. پس آنچه از سال‌ها جمع شود، روز آن کوکب است. پس سیصد و شصت درجه محاسبه می‌شود که هر درجه صد سال است. و در تاریخ متقدم برای ما ذکر شده است که تاریخ بنای اهرام مصر زمانی بود که نسر (عقاب) در برج اسد بود، در حالی که امروز نزد ما در برج جدی است. پس حساب آن را انجام ده تا به علم تاریخ اهرام نزدیک شوی.\n\nپس سازنده آن را ندانست و امر آن را درک نکرد، *** با وجود اینکه سازنده آن قطعاً از مردم بود.\n\nو همانا حق تعالی (الحق تعالی) در رؤیای صادقه به من نشان داد، در حالی که من با گروهی از مردم که چهره‌هایشان را نمی‌شناختم، کعبه را طواف می‌کردم. آنان دو بیت شعر برای ما خواندند که من تنها یک بیت را به خاطر سپردم و دیگری از یادم رفت. و آن بیتی که به خاطر سپردم این بود:\n\nهمانا ما سال‌ها طواف کردیم، همان‌گونه که شما طواف کردید، *** همه ما به طور کامل این خانه را.\n\nو بیت دیگر از یادم رفت و از این امر تعجب کردم. پس یکی از آنها به من گفت و خود را با نامی نامید که آن نام را نمی‌شناختم. سپس به من گفت: «من از اجداد تو هستم.» به او گفتم: «چند سال است که مرده‌ای؟» گفت: «چهل و چند هزار سال.» به او گفتم: «آدم این مقدار سال ندارد!» گفت: «از کدام آدم می‌گویی؟ از این آدم که به تو نزدیک‌تر است یا از دیگری؟»\n\nپس حدیثی از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به یاد آوردم که: «همانا خداوند صد هزار آدم آفریده است.»\n\nپس گفتم: «شاید آن جدی که خود را به من نسبت داد، از آن آدم‌ها باشد.» و تاریخ در این باره مجهول است، با وجود اینکه عالم بدون شک حادث است. زیرا رتبه قِدَم (نفی اولیت) برای عالم صحیح نیست، چون عالم مفعول خداوند است که آن را از عدمِ مرجح، با وجودِ مرجح ایجاد کرده است. زیرا امکان از ذات خود عالم است، پس ترجیح پیوسته از آنِ اوست. و هر آنچه بر اعیان که محل ظهور احکام هستند، افزوده شود، صورت آن صورت زمان است؛ نسبت‌ها و اضافاتی که عینیت ندارند، مانند اکوان (هستی‌ها)، الوان (رنگ‌ها)، نعوت (صفات) و اوصاف. و برای هر نسبت و اضافه و کون و رنگ و نعت و صفت، نام یا نام‌های خاصی وجود دارد. این تحقق امر در تمام آنچه ذکر کردیم، است. و پس از این هر چه می‌خواهی بگو."
  },
  "page_count": 4
}