{
  "id": 161,
  "title": {
    "ar": "الباب الحادي والستون ومائة في المقام الذي بين الصديقية والنبوة وهو مقام القربة",
    "en": "Chapter One Hundred and Sixty-One: Concerning the Spiritual Station (المقام) that lies between the Station of Veracity (الصديقية) and Prophethood (النبوة), which is the Station of Nearness (القربة).",
    "ur": "باب ۱۶۱: اس مقام کے بیان میں جو صدیقیت (الصديقية) اور نبوت (النبوة) کے درمیان ہے، اور وہ مقامِ قربت (مقام القربة) ہے۔",
    "fa": "باب صد و شصت و یکم در مقامی که میان صدیقیت و نبوت است و آن مقام قربت (القربة) است."
  },
  "content": {
    "ar": "## (الباب الحادي والستون ومائة في المقام الذي بين الصديقية والنبوة وهو مقام القربة)\n\n\n> جماعة من رجال الله أنكره *** وليس من شأنهم إنكار ما جهلوا\n\n\n> هو المقام الذي قامت شواهده *** في الحرق والقتل والباقي الذي فعلوا\n\n\n> لو أنهم دبروا القرآن لاح لهم *** وجه الحقيقة فيما عنه قد غفلوا\n\n\n> وما تخصص عنهم في مقامهم *** إلا الذين عن الرحمن قد عقلوا\n\n\n> ومنه أيضا أبو بكر وميزته *** بالسر لو نظروا في حكمنا كملوا\n\n\n> فليس بين أبي بكر وصاحبه *** إذا نظرت إلى ما قلته رجل‏\n\n\n> هذا الصحيح الذي دلت دلائله *** في الكشف عند رجال الله إذ عملوا\n\n\n### [القربة نعت إلهى وهو مقام الخضر مع موسى‏]\n\n\nالقربة نعت إلهي وهو مقام مجهول أنكرت آثاره الخاصة من الرسل عليهم السلام مع الافتقار إليه منهم وشهادة الحق لصاحبه بالعدالة والاختصاص وهو مقام الخضر مع موسى وما أذهله إلا سلطان الغيرة التي جعل الله في الرسل عليهم السلام على مقام شرع الله على أيديهم فلله أنكروا وتكرر منه عليه السلام الإنكار مع تنبيه العبد الصالح في كل مسألة ويأبى سلطان الغيرة إلا الاعتراض لأن شرعه ذوق له والذي رآه من غيره أجنبي عنه وإن كان علما صحيحا ولكن الذوق أغلب والحال أحكم ولذلك قيل لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم قُلْ رَبِّ زِدْنِي عِلْماً ولم يقل له قل رب زدني حالا فلو زاد حالا لزاد إنكارا وكلما زاد علما زاد إيضاحا وكشفا واتساعا وانشراحا وتنزها في الوجوه التي سفرت من براقعها وظهرت من وراء ستورها وكللها فارتفع الضيق والحرج وشوهد الكمال في النقص‏\n\n\n### [مشاهدة الكمال في النقص‏]\n\n\nولما حصلت في هذا المقام السني قلت مشيرا ومنبها\n\n\n> وإني لأهوى النقص من أجل من أهوى *** لأن به كان الكمال لمن يدري‏\n\n\n> وما جاء بالنقصان إلا مخافة *** من العين مثل البدر من آخر الشهر\n\n\n> وما نقص البدر الذي تبصرونه *** ولكنه بدر لمن غاص بالفكر\n\n\n> يراه تماما كاملا في ضيائه *** على أكمل الحالات في البطن والظهر\n\n\n> فلو لم يكن في الكون نقص محقق *** لكان الوجود الحق ينقص في القدر\n\n\n> فبي كان للحق الوجود كماله *** مع النقص فانظر ما تضمنه شعري‏\n\n\n> غزال من الفردوس جاء منقبا *** من أجلي وما يخفى على الله ما يجري‏\n\n\n> فقلت له أهلا وسهلا ومرحبا *** بمن وحياة الحب قد ضمه صدري‏\n\n\n> أهيم بها حبا على كل حالة *** حياة وموتا في القيامة والحشر\n\n\n> لقد سفرت يوما فلاحت محاسن *** تخبر عنها أنها ليلة القدر\n\n\n> سجدت لها حبا فلما رأيتها *** علمت بأني ما تعلقت بالغير\n\n\n> فكبرت إجلالا لكونى هويتني *** فسرى الذي قد كان هيمه جهري‏\n\n\n> وحققت أني عين من قد هويته *** فلم أخش من بين ولم أخش من هجري‏\n> فبغداد داري لا أرى لي موطنا *** سواها فإن عزت جنحت إلى مصري‏\n\n\n### [دخول ابن عربى مقام القربة مطلع عام 597]\n\n\nهذا المقام دخلته في شهر محرم سنة سبع وتسعين وخمسمائة وأنا مسافر بمنزل ابحيسل ببلاد المغرب فتهت به فرحا ولم أجد فيه أحدا فاستوحشت من الوحدة وتذكرت دخول أبي يزيد بالذلة والافتقار فلم يجد في ذلك المنزل من أحد وذلك المنزل هو موطني فلم أستوحش فيه لأن الحنين إلى الأوطان ذاتي لكل موجود وأن الوحشة مع الغربة ولما دخلت هذا المقام وانفردت به وعلمت أنه إن ظهر علي فيه أحد أنكرني فبقيت أتتبع زواياه ومخادعه ولا أدري ما اسمه مع تحققي به وما خص الله به من أتاه إياه ورأيت أوامر الحق تترى علي وسفراؤه تنزل إلي تبتغي مؤانستي وتطلب مجالستي‏\n\n\n### [أبو عبد الرحمن السلمي وابن عربى ومقام القربة]\n\n\nفرحلت وأنا على تلك الحال من الاستيحاش بالانفراد والأنس إنما يقع بالجنس فلقيت رجلا من الرجال بمنزل يسمى آن حال فصليت العصر في جامعة فجاء الأمير أبو يحيى بن واجتن وكان صديقي وفرح بي وسألني أن أنزل عنده فأبيت ونزلت عند كاتبه وكانت بيني وبينه مؤانسة فشكوت إليه ما أنا فيه من انفرادي بمقام أنا مسرور به فبينا هو يؤانسني إذ لاح لي ظل شخص فنهضت من فراشي إليه عسى أجد عنده فرجا فعانقني فتأملته فإذا به أبو عبد الرحمن السلمي قد تجسدت لي روحه بعثه الله إلى رحمة بي فقلت له أراك في هذا المقام فقال فيه قبضت وعليه مت فإنا فيه لا أبرح‏\n\n\n### [حال الخضر في الدورة الموسوية وحاله في الدورة المحمدية]\n\n\nفذكرت له وحشتي فيه وعدم الأنيس فقال الغريب مستوحش وبعد أن سبقت لك العناية الإلهية بالحصول في هذا المقام فاحمد الله ولمن يا أخي يحصل هذا أ لا ترضى أن يكون الخضر صاحبك في هذا المقام وقد أنكر عليه موسى حاله مع ما شهد الله عنده بعدالته ومع هذا أنكر عليه ما جرى منه وما أراه سوى صورته فحاله رأى وعلى نفسه أنكر وأوقعه في ذلك سلطان الغيرة التي خص الله بها رسله ولو صبر لرأى فإنه كان قد أعد له ألف مسألة كلها جرت لموسى وكلها ينكرها على الخضر قال شيخنا أبو النجا المعروف بأبي مدين لما علم الخضر رتبة موسى وعلو قدره بين الرسل امتثل ما نهاه عنه طاعة لله ولرسوله فإن الله يقول وما آتاكُمُ الرَّسُولُ فَخُذُوهُ وما نَهاكُمْ عَنْهُ فَانْتَهُوا فقال له في الثانية إِنْ سَأَلْتُكَ عَنْ شَيْ‏ءٍ بَعْدَها فَلا تُصاحِبْنِي فقال سمعا وطاعة فلما كانت الثالثة ونسي موسى حالة قوله إِنِّي لِما أَنْزَلْتَ إِلَيَّ من خَيْرٍ فَقِيرٌ وما طلب الإجارة على سقايته مع الحاجة فارقه الخضر بعد ما أبان له علم ما أنكره عليه ثم قال له وما فَعَلْتُهُ عَنْ أَمْرِي لأنه كان على شرعة من ربه ومنهاج وفي زمانها بخلاف حاله بعد بعث محمد صَلَّى اللهُ عَليهِ وسَلَّم فإنه الفرا كل الصيد في جوفه‏\n\n\n### [لعلماء الرسوم قدم راسخة في مقام القربة]\n\n\nفقلت له يا أبا عبد الرحمن لا أعرف لهذا المقام اسما أميزه به فقال لي هذا يسمى مقام القربة فتحقق به فتحققت به فإذا به مقام عظيم لعلماء الرسوم من أهل الاجتهاد فيه قدم راسخة لكنهم لا يعرفون أنهم فيه ورأيت الإمداد الإلهي يسرى إليهم من هذا المقام ولهذا ينكر بعضهم على بعض ويخطئ بعضهم بعضا لأنهم ما حصل لهم ذوقا ولا يعلمون ممن يستمدون مشاهدة وكشفا فكل واحد منهم على حق كما أنه لكل نبي تقدم هذا الزمان المحمدي شرعة ومنهاج والايمان بذلك كله واجب على كل مؤمن وإن لم نلتزم من أحكامهم إلا ما لزمناه‏\n\n\n### [المجتهدون من علماء الشريعة وأهل الكشف‏]\n\n\nفالمجتهدون من علماء الشريعة ورثة الرسل في التشريع وأدلتهم تقوم لهم مقام الوحي للأنبياء واختلاف الأحكام كاختلاف الأحكام إلا أنهم ليسوا مثل الرسل لعدم الكشف فإن الرسل يشد بعضهم من بعض وكذلك أهل الكشف من علماء الاجتهاد وأما غير أهل الكشف منهم فيخطئ بعضهم بعضا ولو قال الخضر لموسى من أول ما صحبه ما أفعل شيئا مما تراني أفعله عن أمري ما أنكره عليه ولا عارضة ولقد أنطقه الله بقوله سَتَجِدُنِي إِنْ شاءَ الله صابِراً ولا أَعْصِي لَكَ أَمْراً والصبر لا يكون إلا على ما يشق عليه فلو قدم الصبر على المشيئة كما يفعل المحمدي لصبر ولم يعترض فإن الله قدمه في الإعلام تعليما لمحمد ص‏\n\n\n### [الوقوف عند ترتيب الحكمة في الأشياء]\n\n\nفمن أراد أن يحصل علم الله في خلقه فليقف عند ترتيب حكمته في الأشياء فيقدم ما قدم الله ويؤخر ما أخر الله فإن من أسمائه المقدم والمؤخر فإذا أخرت ما قدمه أو قدمت ما أخره فهو نزاع خفي يورث حرمانا قال تعالى ولا تَقُولَنَّ لِشَيْ‏ءٍ إِنِّي فاعِلٌ ذلِكَ غَداً إِلَّا أَنْ يَشاءَ الله فأخر الاستثناء وقدمه موسى فلم يصبر فلو أخره لصبر وهذه الآية مذكورة باللسان العبراني في التوراة فالله الله يا إخواننا من أهل هذه الملة المحمدية قفوا على مشاعر الله التي بينها لكم ولا تتعدوا ما رسم لكم‏\n\n\nأ لا تراه صَلَّى اللهُ عَليهِ وسَلَّم لما صعد على الصفا في حجة الوداع قرأ إِنَّ الصَّفا والْمَرْوَةَ من شَعائِرِ الله ثم قال أبدأ بما بدأ الله به‏\n\n\nوما قال ذلك إلا تعليما لنا ولزوم‏\nأدب مع الله ولو لا أنه جائز له أن يبدأ بالمروة في سعيه لما قال هذا ورجح ما بدأ الله به على ما في المسألة من التخيير من أجل الواو فإنه ما بدأ الله به إلا لسر يعلمه فمن لم يبدأ به حرم فائدته وقال صَلَّى اللهُ عَليهِ وسَلَّم خذوا عني مناسككم‏\n\n\nوتقديم الصفا في السعي من المناسك‏\n\n\n### [تقديم البر على البحر في السفر]\n\n\nولقد رويت في هذا المعنى حكاية عجيبة عن يهودي أخبرني بها موسى بن محمد القرطبي القباب المؤذن بالمسجد الحرام المكي بالمنارة التي عند باب الحزورة وباب أجياد رحمه الله سنة تسع وتسعين وخمسمائة قال كان رجل بالقيروان أراد الحج فتردد خاطره في سفره بين البر والبحر فوقتا يترجح له البر ووقتا يترجح له البحر فقال إذا كان صبيحة غد أول رجل ألقاه أشاوره فحيث يرجح لي أحكم به فأول من لقي يهوديا فتألم ثم عزم وقال والله لأسألنه فقال يا يهودي أشاورك في سفري هذا هل أمشي في البر أو في البحر فقال له اليهودي يا سبحان الله وفي مثل هذا يسأل مثلك أ لم تر أن الله يقول لكم في كتابكم هُوَ الَّذِي يُسَيِّرُكُمْ في الْبَرِّ والْبَحْرِ فقدم البر على البحر فلو لا إن لله فيه سرا وهو أولى بكم ما قدمه وما أخر البحر إلا إذا لم يجد المسافر سبيلا إلى البر قال فتعجبت من كلامه وسافرت في البر يقول الرجل فو الله ما رأيت سفرا مثله ولقد أعطاني الله فيه من الخير فوق ما كنت أشتهي‏\n\n\n### [إنكار الغزالي لمقام القربة]\n\n\nوقد أنكر أبو حامد الغزالي هذا المقام وقال ليس بين الصديقية والنبوة مقام ومن تخطي رقاب الصديقين وقع في النبوة والنبوة باب مغلق فكان يقول لا تتخطوا رقاب الصديقين ولا شك أن الأنبياء أصحاب الشرائع هم أرفع عباد الله من البشر ومع هذا لا يبعد أن يخص الله المفضول بعلم ليس عند الفاضل ولا يدل تميزه عنه أنه بذلك العلم أفضل منه بل قال له يا موسى أنا على علم علمنيه الله لا تعلمه أنت وأنت على علم علمكه الله لا أعلمه أنا وما قال له أنا أفضل منك بل علم حق موسى وما ينبغي له وامتثل أمره فيما نهاه عنه من صحبته احتراما منه لمقام موسى وعلو منزلته وسكوت موسى عنه حين فارقه ولم يرجع عن نهيه لأنه علم إن الخضر ممن لم يسمع نهي موسى عليه السلام ولا سيما وقد قال له وما فَعَلْتُهُ عَنْ أَمْرِي فعلم موسى أنه ما فارقه إلا عن أمر ربه فما اعترض عليه في فراقه إياه وحصل لموسى مقصوده ومقصود الحق في تأديبه فعلم إن لله عبادا عندهم من العلم ما ليس عنده ولم يكن إلا علم كون من الأكوان من علوم الكشف وهو من أحوال المريدين أصحاب السلوك فكيف لو كان من العلوم المتعلقة بالجناب الإلهي إما من العلم المحكم أو المتشابه‏\n\n\n### [السر الذي وقر في نفس أبى بكر]\n\n\nومن هذا المقام حصل لأبي بكر الصديق السر الذي وقر في نفسه وظهرت قوة ذلك السر مع وقته وقول عائشة لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم في مرضه حين أمر أن يصلي بالناس أنه رجل أسيف ورسول الله صَلَّى اللهُ عَليهِ وسَلَّم يعرف منه بالسر الذي حصل عنده ما لا تعرفه الجماعة فما بقي أحد يوم مات رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إلا ذهل في ذلك اليوم وخولط في عقله وتكلم بما ليس الأمر عليه إلا أبو بكر الصديق فما طرأ عليه من ذلك أمر بل رقى المنبر وخطب الناس وذكر موت النبي صَلَّى اللهُ عَليهِ وسَلَّم فقال من كان منكم يعبد محمدا فإن محمدا قد مات ومن كان يعبد الله فإن الله حي لا يموت ثم تلا إِنَّكَ مَيِّتٌ وإِنَّهُمْ مَيِّتُونَ وما مُحَمَّدٌ إِلَّا رَسُولٌ الآية فسكن جأش الناس حتى قال عمر والله ما كأني سمعت بهذه الآية إلا في ذلك اليوم وهذا\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إذا وجب يعني الموت فلا تبكين باكية وأما قبل وقوع الموت فالبكاء محمود\n\n\nوكذا فعل أبو بكر لما قام رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقال ما تقولون في رجل خير فاختار لقاء الله فبكى أبو بكر وحده دون الجماعة وعلم أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قد نعى لأصحابه نفسه فأنكر الصحابة على أبي بكر بكاءه وهو كان أعلم فلما مات صَلَّى اللهُ عَليهِ وسَلَّم بكى الناس وضجوا إلا أبا بكر امتثالا\n\n\nلقوله صَلَّى اللهُ عَليهِ وسَلَّم إذا وجب فلا تبكين باكية\n\n\nهذا كله من السر الذي أعطاه هذا المقام‏\n\n\n### [الذي ينبغي أن يقال ليس بين محمد وأبى بكر رجل لا أنه ليس بين الصديقية والنبوة مقام‏]\n\n\nفالذي ينبغي أن يقال ليس بين محمد وأبي بكر رجل لا أنه ليس بين الصديقية والنبوة مقام فإن الصديق تابع بطريق الايمان فما أنكره متبوعة أنكر وما قرره متبوعة قرر هذا حظ الصديق من كونه صديقا ومن كون مقام آخر لا يحكم عليه حال الصديقية فاعلم ذلك انتهى السفر الرابع عشر بانتهاء الجزء السادس ومائة من الفتوحات المكية\n\n",
    "en": "## Chapter One Hundred and Sixty-One: Concerning the Station Between Perfect Veracity (الصديقية) and Prophethood (النبوة), which is the Station of Nearness (القربة)\n\nA group of the Men of God denied it,\nYet it is not their way to deny what they do not know.\n\nIt is the Station whose proofs were established\nIn burning and killing, and the rest of what they did.\n\nIf they had contemplated the Qur'an, the face of the Reality\nWould have appeared to them in what they overlooked.\n\nAnd none were distinguished from them in their station\nExcept those who understood (received wisdom) from the All-Merciful (الرحمن).\n\nAnd from it also is Abu Bakr, and his distinction\nIs by the Secret (السر); if they had looked at our judgment, they would have been perfected.\n\nThus, there is no man between Abu Bakr and his Companion (Muhammad)\nIf you look at what I have said.\n\nThis is the truth whose proofs are demonstrated\nIn the Unveiling (الكشف) among the Men of God when they act.\n\n### [Nearness (القربة) is a Divine Attribute and the Station of Al-Khidr with Moses]\n\nNearness (القربة) is a Divine Attribute (نعت إلهي) and an unknown station (مقام مجهول). Its specific effects were denied by the Messengers (الرسل), despite their need for it, and despite the testimony of The Real (الحق) to its possessor regarding justice and distinction. It is the station of Al-Khidr with Moses. What distracted Moses was nothing but the sovereignty of the Zeal (الغيرة) that God placed in the Messengers concerning the station of God's Law (شرع الله) established through their hands.\n\nTherefore, they denied it for God’s sake, and the denial was repeated by Moses (peace be upon him), even with the righteous servant (Al-Khidr) providing clarification in every matter. Yet, the sovereignty of Zeal refused anything but objection, because his Law was a direct spiritual Taste (الذوق) for him, and what he saw from another was foreign to him, even if it was sound knowledge. However, the Taste is more dominant, and the spiritual State (الحال) is more authoritative.\n\nThat is why the Messenger of God (peace and blessings be upon him) was told: \"Say: My Lord, increase me in Knowledge (علماً),\" and he was not told: \"Say: My Lord, increase me in State (حالاً).\" If his State had increased, his denial (of others) would have increased. But every time his Knowledge increased, it brought greater clarification, Unveiling (كشفا), expansion, relief, and transcendence (تنزها) in the aspects that unveiled themselves from their veils and appeared from behind their curtains and coverings. Thus, constraint and difficulty were lifted, and perfection was witnessed in imperfection.\n\n### [Witnessing Perfection in Imperfection]\n\nWhen I attained this sublime station, I said, indicating and drawing attention:\n\nI desire imperfection (النقص) for the sake of the One I love,\nBecause through it was the perfection (الكمال) for the one who knows.\n\nAnd nothing brought about the imperfection except fear\nOf the Eye, like the full moon at the end of the month.\n\nThe full moon you see is not diminished,\nBut it is a full moon for the one who dives deep with thought.\n\nHe sees it as complete and perfect in its light,\nIn the most perfect states, both hidden and manifest.\n\nIf there were no verified imperfection in the Cosmos,\nThe Existence of The Real (الوجود الحق) would be diminished in worth.\n\nThrough me, the Existence of The Real attained its perfection\nAlong with imperfection; so look at what my poetry contains.\n\nA gazelle from Paradise came veiled,\nFor my sake, and what transpires is not hidden from God.\n\nI said to him: \"Welcome, welcome, and greetings\nTo the one whom, by the life of Love, my breast has embraced!\"\n\nI am passionately in love with her in every state,\nIn life and death, at the Resurrection and the Gathering.\n\nShe unveiled herself one day, and beauties shone forth,\nAnnouncing that she was the Night of Power (ليلة القدر).\n\nI prostrated to her out of love, and when I saw her,\nI knew that I was not attached to the other (الغير).\n\nI magnified (God) in awe because I had loved myself,\nAnd the Secret (السر) that had made me passionate became manifest.\n\nAnd I realized that I am the very essence of the one I loved,\nSo I feared neither separation nor abandonment.\nBaghdad is my home; I see no dwelling place\nOther than it, but if it becomes difficult, I turn toward my Egypt.\n\n### [Ibn Arabi's Entry into the Station of Nearness at the Beginning of the Year 597]\n\nI entered this station in the month of Muharram in the year five hundred and ninety-seven (597 AH), while traveling at the dwelling of Ibhaysal in the lands of the Maghrib. I wandered through it joyfully, but found no one there, so I felt alienated (استوحشت) by the solitude. I recalled Abu Yazid’s entry with humility and need, finding no one in that dwelling. That dwelling is my homeland, so I did not feel alienated in it, because the yearning for homelands is inherent to every existent thing, and alienation occurs with estrangement.\n\nWhen I entered this station and was alone in it, I knew that if anyone appeared to me there, they would deny me. So I remained tracing its corners and hiding places, and I did not know its name, despite my realization of it and what God grants to those who attain it. I saw the commands of The Real (الحق) pouring down upon me, and His envoys descending to me, seeking my intimacy and requesting my company.\n\n### [Abu Abd al-Rahman al-Sulami, Ibn Arabi, and the Station of Nearness]\n\nI traveled while in that state of alienation due to solitude, for intimacy (الأنس) only occurs with one's own kind. I met a man from the Men (of God) at a dwelling called Ann Hal. I prayed the afternoon prayer in a congregational mosque, and the Amir Abu Yahya ibn Wajtan, who was my friend, came and rejoiced at seeing me. He asked me to stay with him, but I refused and stayed with his scribe. There was intimacy between us, and I complained to him about my solitude in a station that I was happy to possess.\n\nWhile he was comforting me, the shadow of a person appeared to me. I rose from my bed toward him, hoping to find relief with him. He embraced me, and I looked closely at him: it was Abu Abd al-Rahman al-Sulami, whose spirit had materialized for me. God had sent him as a mercy to me. I said to him, \"I see you in this station.\" He replied, \"I was taken (قبضت) in it, and I died upon it, and I do not leave it.\"\n\n### [The State of Al-Khidr in the Mosaic Cycle and his State in the Muhammadan Cycle]\n\nI mentioned my alienation in it and the lack of a companion. He said, \"The stranger is alienated. Since Divine Providence (العناية الإلهية) has preceded you in attaining this station, thank God. And for whom, my brother, is this attained? Are you not satisfied that Al-Khidr is your companion in this station? Moses denied his state, despite God testifying to his justice. Yet, Moses denied what transpired from him. I see nothing but his form (Al-Khidr's form). Moses saw his state and denied it for himself. What caused this was the sovereignty of the Zeal (الغيرة) that God specifically granted to His Messengers.\n\nIf Moses had been patient, he would have seen, for a thousand matters had been prepared for him, all of which transpired for Moses, and all of which he would have denied in Al-Khidr. Our Shaykh Abu al-Naja, known as Abu Madyan, said: When Al-Khidr knew the rank of Moses and his high status among the Messengers, he complied with what Moses forbade him, in obedience to God and His Messenger, for God says: <<وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانتَهُوا>> (And whatever the Messenger gives you, take it; and whatever he forbids you from, abstain from it).\n\nSo, in the second instance, Moses said to him: \"If I ask you about anything after this, do not keep me company.\" Al-Khidr replied, \"Hearing and obedience.\" When the third instance occurred, and Moses forgot his state of saying <<إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ>> (Indeed, I am, for whatever good You would send down to me, in need), and he did not ask for wages for watering the flock despite his need, Al-Khidr parted from him after clarifying the knowledge of what Moses had denied. Then he said to him: <<وَمَا فَعَلْتُهُ عَنْ أَمْرِي>> (And I did not do it of my own accord), because he was following a law and a methodology from his Lord during that time. This is contrary to his state after the sending of Muhammad (peace and blessings be upon him), for he is the one who has all the game within his belly.\n\n### [Scholars of Formal Law have a Firm Footing in the Station of Nearness]\n\nI said to him, \"O Abu Abd al-Rahman, I do not know a name for this station by which to distinguish it.\" He said to me, \"This is called the Station of Nearness (مقام القربة). Realize it.\" So I realized it.\n\nBehold, it is a magnificent station in which the scholars of formal law (علماء الرسوم) who practice independent legal reasoning (الاجتهاد) have a firm footing, but they do not know that they are in it. I saw that Divine sustenance (الإمداد الإلهي) flows to them from this station. This is why some of them deny others and some declare others mistaken, because they have not attained the spiritual Taste (ذوقا) and do not know from whom they receive sustenance through Witnessing (مشاهدة) and Unveiling (كشفا). Thus, every one of them is upon the truth, just as every Prophet preceding this Muhammadan era had a law and a methodology. Belief in all of that is obligatory upon every believer, even if we are only bound by the rulings we are obligated to follow.\n\n### [The Jurists of Sharia and the People of Unveiling]\n\nThe jurists (المجتهدون) of the Sharia are the heirs of the Messengers in legislation, and their proofs stand in the place of revelation for the Prophets. The differences in rulings are like the differences in rulings (among the Prophets), except that they are not like the Messengers due to the absence of Unveiling (الكشف). The Messengers support one another, and likewise do the People of Unveiling among the scholars of legal reasoning. As for those among them who are not the People of Unveiling, they declare one another mistaken.\n\nIf Al-Khidr had said to Moses from the beginning of their companionship, \"I do nothing of what you see me do of my own accord,\" Moses would not have denied him or objected. God indeed made Moses say: <<سَتَجِدُنِي إِن شَاءَ اللَّهُ صَابِرًا وَلَا أَعْصِي لَكَ أَمْرًا>> (You will find me, if Allah wills, patient, and I will not disobey you in [any] order). Patience (الصبر) only occurs regarding what is difficult for one. If he had put patience before the Will of God (المشيئة), as the Muhammadan does, he would have been patient and would not have objected. God put it first in the declaration as a teaching for Muhammad (peace and blessings be upon him).\n\n### [Adhering to the Order of Wisdom in Things]\n\nWhoever wishes to attain the Knowledge of God in His creation must adhere to the ordering of His Wisdom (حكمته) in things, advancing what God has advanced and postponing what God has postponed. For among His Names are The Advancer (المقدم) and The Delayer (المؤخر). If you postpone what He advanced or advance what He postponed, it is a subtle contention that results in deprivation.\n\nGod Almighty says: <<وَلَا تَقُولَنَّ لِشَيْءٍ إِنِّي فَاعِلٌ ذَلِكَ غَدًا إِلَّا أَن يَشَاءَ اللَّهُ>> (And never say of anything, \"Indeed, I will do that tomorrow,\" except [by adding], \"If Allah wills\"). He postponed the exception, but Moses advanced it, so he was not patient. If he had postponed it, he would have been patient. This verse is mentioned in the Hebrew language in the Torah.\n\nTherefore, by God, O our brothers from the Muhammadan community, adhere to the sacred rites (مشاعر الله) that He has clarified for you, and do not transgress what has been prescribed for you.\n\nDo you not see that when he (peace and blessings be upon him) ascended Al-Safa during the Farewell Pilgrimage, he recited: <<إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ>> (Indeed, Al-Safa and Al-Marwah are among the symbols of Allah), and then said, \"I begin with what God began with\"?\n\nHe only said that to teach us and to maintain proper conduct (أدب) with God. If it were not permissible for him to begin with Al-Marwah in his ritual running (Sa'y), he would not have said this. He preferred what God began with over the choice available in the matter (due to the conjunction *wa*), because God only began with it for a secret He knows. Whoever does not begin with it is deprived of its benefit. He (peace and blessings be upon him) also said, \"Take your rituals from me.\" And advancing Al-Safa in the Sa'y is one of the rituals.\n\n### [Giving Precedence to Land over Sea in Travel]\n\nI was told a strange story regarding this meaning by Musa ibn Muhammad al-Qurtubi al-Qabbab, the muezzin at the Holy Mosque in Mecca, at the minaret near Bab al-Hazura and Bab Ajyad (may God have mercy on him), in the year five hundred and ninety-nine (599 AH). He said:\n\nThere was a man in Qayrawan who intended to perform the Hajj, and his mind wavered between traveling by land and by sea. Sometimes land seemed preferable, and sometimes sea. He said, \"Tomorrow morning, the first man I meet, I will consult him, and whatever he prefers, I will decide upon.\" The first person he met was a Jew. He was distressed, but then resolved and said, \"By God, I will ask him.\" He said, \"O Jew, I consult you regarding my journey: should I travel by land or by sea?\"\n\nThe Jew said to him, \"Glory be to God! Should someone like you ask about such a thing? Do you not see that God says to you in your Book: <<هُوَ الَّذِي يُسَيِّرُكُمْ فِي الْبَرِّ وَالْبَحْرِ>> (It is He who enables you to travel on the land and the sea)? He gave precedence to the land over the sea. If there were not a secret in it for God, and if it were not better for you, He would not have advanced it. He only postponed the sea for when the traveler finds no way to the land.\"\n\nThe man said, \"I was astonished by his words and traveled by land.\" The man continued, \"By God, I never saw a journey like it. God granted me in it more good than I had ever wished for.\"\n\n### [Al-Ghazali's Denial of the Station of Nearness]\n\nAbu Hamid al-Ghazali denied this station and said, \"There is no station between Perfect Veracity (الصديقية) and Prophethood (النبوة). Whoever steps over the necks of the Perfectly Veracious ones falls into Prophethood, and Prophethood is a closed door.\" Thus, he used to say, \"Do not step over the necks of the Perfectly Veracious ones.\"\n\nThere is no doubt that the Prophets who brought laws are the highest servants of God among mankind. Nevertheless, it is not impossible that God might distinguish a lesser figure (المفضول) with knowledge that the superior figure (الفاضل) does not possess. His distinction does not mean that he is superior to him by virtue of that knowledge. Rather, Al-Khidr said to Moses, \"I am upon a knowledge that God taught me, which you do not know, and you are upon a knowledge that God taught you, which I do not know.\" He did not say, \"I am better than you.\" Rather, he knew the right of Moses and what was proper for him, and he complied with his command regarding the cessation of their companionship, out of respect for Moses' station and his high rank.\n\nMoses' silence when Al-Khidr parted from him, and his failure to retract his prohibition, was because he knew that Al-Khidr was one who did not hear Moses' prohibition (in the spiritual sense), especially since Al-Khidr had said to him, <<وَمَا فَعَلْتُهُ عَنْ أَمْرِي>> (And I did not do it of my own accord). Moses thus knew that Al-Khidr only parted from him by the command of his Lord, so he did not object to his separation. Moses achieved his goal, and the goal of The Real was achieved in disciplining him. He learned that God has servants who possess knowledge that he does not have, and this was only knowledge concerning one of the cosmic realities (علم كون من الأكوان) from the sciences of Unveiling (علوم الكشف), which pertains to the states of the seekers (المريدين) who follow the spiritual path (السلوك). What then if it were knowledge related to the Divine Presence (الجناب الإلهي), whether from the clear (المحكم) or the ambiguous (المتشابه) knowledge?\n\n### [The Secret that Settled in the Soul of Abu Bakr]\n\nIt was from this station that Abu Bakr al-Siddiq received the Secret (السر) that settled in his soul. The strength of that Secret became manifest at the time (of the Prophet's death). When Aisha said to the Messenger of God (peace and blessings be upon him) during his illness, when he ordered that Abu Bakr lead the people in prayer, that he was a man who wept easily (أسيف), the Messenger of God (peace and blessings be upon him) knew from the Secret that Abu Bakr possessed what the general community did not know.\n\nOn the day the Messenger of God (peace and blessings be upon him) died, everyone was stunned and confused in their minds, speaking what was not true, except for Abu Bakr al-Siddiq. No such confusion afflicted him. Rather, he ascended the pulpit and addressed the people, mentioning the death of the Prophet (peace and blessings be upon him). He said, \"Whoever among you used to worship Muhammad, know that Muhammad has died. And whoever used to worship God, know that God is Living and does not die.\" Then he recited: <<إِنَّكَ مَيِّتٌ وَإِنَّهُم مَّيِّتُونَ>> (Indeed, you are to die, and indeed, they are to die) and <<وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ>> (Muhammad is not but a Messenger) [until the end of the verse]. The people's hearts were calmed, so much so that Umar said, \"By God, it was as if I had never heard this verse until that day.\"\n\nThis relates to his (peace and blessings be upon him) saying, \"When it is due,\" meaning death, \"let no mourner weep.\" As for before the occurrence of death, weeping is commendable.\n\nAbu Bakr acted similarly when the Messenger of God (peace and blessings be upon him) stood up and said, \"What do you say about a man who was given a choice and chose the meeting with God?\" Abu Bakr wept alone, apart from the community, knowing that the Messenger of God (peace and blessings be upon him) had announced his own death to his Companions. The Companions criticized Abu Bakr for his weeping, but he was the most knowledgeable. When he (peace and blessings be upon him) died, the people wept and wailed, except for Abu Bakr, in compliance with his (peace and blessings be upon him) saying, \"When it is due, let no mourner weep.\"\n\nAll of this stems from the Secret granted by this station.\n\n### [What Should Be Said is: There is No Man Between Muhammad and Abu Bakr, Not That There is No Station Between Perfect Veracity and Prophethood]\n\nTherefore, what should be said is: There is no man between Muhammad and Abu Bakr, not that there is no station between Perfect Veracity (الصديقية) and Prophethood (النبوة). For the Perfectly Veracious One (الصديق) is a follower by way of faith (الإيمان). What his leader denied, he denied, and what his leader affirmed, he affirmed. This is the portion of the Perfectly Veracious One by virtue of his being a *Siddiq*. But by virtue of possessing another station, the state of *Siddiqiyya* does not govern him. Know this.\n\n[End of the Fourteenth Journey, concluding the One Hundred and Sixth Part of *Al-Futuhat al-Makkiyya*]",
    "ur": "(باب ایک سو اکسٹھ: اس مقام کے بیان میں جو صدیقیت (الصديقية) اور نبوت (النبوة) کے درمیان ہے، اور وہ مقام قربت (القربة) ہے)\n\n> اللہ کے کچھ مردوں نے اس کا انکار کیا،\n> حالانکہ ان کا کام اس چیز کا انکار نہیں جو وہ نہیں جانتے۔\n> یہ وہ مقام ہے جس کے شواہد جلانے اور قتل کرنے میں قائم ہوئے،\n> اور باقی ان کاموں میں جو انہوں نے کیے۔\n> اگر وہ قرآن پر غور کرتے تو ان پر حقیقت کا چہرہ ظاہر ہو جاتا،\n> اس چیز میں جس سے وہ غافل رہے۔\n> اور ان کے مقام میں ان سے کوئی خاص نہیں ہوا،\n> سوائے ان لوگوں کے جنہوں نے رحمن سے عقل حاصل کی۔\n> اور اسی میں سے ابوبکر بھی ہیں، اور ان کی خصوصیت اس راز کے ساتھ ہے،\n> اگر وہ ہمارے حکم پر نظر کرتے تو کامل ہو جاتے۔\n> پس ابوبکر اور ان کے ساتھی (محمد ﷺ) کے درمیان،\n> اگر تم اس پر غور کرو جو میں نے کہا، تو کوئی شخص نہیں ہے۔\n> یہ وہ صحیح بات ہے جس کی دلیلیں،\n> اللہ کے مردوں کے نزدیک کشف (الکشف) میں ظاہر ہوئیں جب انہوں نے عمل کیا۔\n\n### [قربت (القربة) ایک الٰہی صفت ہے اور یہ خضر کا موسیٰ کے ساتھ مقام ہے]\n\nقربت (القربة) ایک الٰہی صفت ہے اور یہ ایک نامعلوم مقام ہے، جس کے خاص آثار کا رسولوں (الرسل) علیہم السلام نے انکار کیا، باوجود اس کے کہ وہ اس کے محتاج تھے، اور ذات حق (الحق) نے اس کے حامل کی عدالت اور اختصاص کی گواہی دی۔ یہ خضر کا موسیٰ علیہما السلام کے ساتھ مقام ہے۔ اور موسیٰ کو اس سے غافل کرنے والی صرف غیرت (الغيرة) کی وہ سلطنت تھی جو اللہ نے رسولوں علیہم السلام میں ان کے ہاتھوں پر اللہ کی شریعت (شرع) کے مقام پر قائم کی۔ اسی لیے انہوں نے انکار کیا، اور حضرت موسیٰ علیہ السلام کی طرف سے بار بار انکار ہوا، حالانکہ وہ نیک بندہ (خضر) ہر مسئلے میں انہیں متنبہ کرتا رہا۔ لیکن غیرت (الغيرة) کی سلطنت اعتراض کے سوا کچھ قبول نہیں کرتی، کیونکہ ان کی شریعت (شرع) ان کے لیے ایک ذوق (الذوق) ہے، اور جو کچھ انہوں نے کسی دوسرے سے دیکھا وہ ان کے لیے اجنبی تھا، اگرچہ وہ صحیح علم ہی کیوں نہ ہو۔ لیکن ذوق (الذوق) غالب ہوتا ہے اور حال (الحال) زیادہ حکم رکھتا ہے۔ اسی لیے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم سے کہا گیا:\n> **قُلْ رَبِّ زِدْنِي عِلْماً**\n> (کہو: اے میرے رب! میرے علم میں اضافہ فرما)\n\nاور یہ نہیں کہا گیا کہ \"کہو: اے میرے رب! میرے حال میں اضافہ فرما۔\" اگر حال (الحال) میں اضافہ ہوتا تو انکار میں اضافہ ہوتا۔ اور جب بھی علم میں اضافہ ہوتا ہے تو وضاحت، کشف (الکشف)، وسعت اور انشراح میں اضافہ ہوتا ہے، اور ان چہروں میں تنزہ حاصل ہوتا ہے جو اپنے نقابوں سے ہٹ گئے اور اپنے پردوں کے پیچھے سے ظاہر ہوئے، اور ان سب کو مکمل کیا، پس تنگی اور حرج دور ہو گیا، اور نقص میں کمال (الکمال) کا مشاہدہ ہوا۔\n\n### [نقص میں کمال (الکمال) کا مشاہدہ]\n\nاور جب میں اس بلند مقام پر پہنچا تو میں نے اشارہ کرتے اور متنبہ کرتے ہوئے کہا:\n\n> اور میں اپنے محبوب کی خاطر نقص (کمی) کو پسند کرتا ہوں،\n> کیونکہ اسی میں کمال (الکمال) ہے اس کے لیے جو جانتا ہے۔\n> اور وہ نقص کے ساتھ نہیں آیا مگر نظر بد کے خوف سے،\n> جیسے مہینے کے آخر میں چاند۔\n> اور وہ چاند جسے تم دیکھتے ہو، ناقص نہیں ہوا،\n> بلکہ وہ اس کے لیے بدر (چودھویں کا چاند) ہے جو فکر میں غوطہ زن ہو۔\n> وہ اسے اپنی روشنی میں کامل و تمام دیکھتا ہے،\n> باطن اور ظاہر میں کامل ترین حالتوں پر۔\n> پس اگر کائنات میں کوئی حقیقی نقص نہ ہوتا،\n> تو ذات حق (الحق) کی ہستی (الوجود) قدر میں ناقص ہو جاتی۔\n> پس میرے ذریعے ہی ذات حق (الحق) کی ہستی (الوجود) کو کمال (الکمال) حاصل ہوا،\n> نقص کے ساتھ، پس دیکھو میرے شعر میں کیا مضمر ہے۔\n> فردوس سے ایک غزال نقاب اوڑھے میرے لیے آیا،\n> اور جو کچھ ہو رہا ہے وہ اللہ سے پوشیدہ نہیں۔\n> پس میں نے اس سے کہا: خوش آمدید، خوش آمدید،\n> اس کو جس کو محبت کی قسم، میرے سینے نے سمیٹ لیا ہے۔\n> میں ہر حال میں اس سے محبت میں دیوانہ ہوں،\n> زندگی میں اور موت میں، قیامت اور حشر میں۔\n> اس نے ایک دن نقاب ہٹایا تو ایسی خوبیاں ظاہر ہوئیں،\n> جو بتاتی ہیں کہ وہ شب قدر ہے۔\n> میں نے محبت میں اس کے لیے سجدہ کیا، جب میں نے اسے دیکھا،\n> تو میں نے جان لیا کہ میں نے غیر سے تعلق نہیں رکھا۔\n> پس میں نے تعظیم میں تکبیر کہی کہ میں نے خود سے محبت کی،\n> پس میرا وہ راز جو پوشیدہ تھا، میرا ظاہر بن گیا۔\n> اور میں نے تحقیق کر لی کہ میں ہی وہ ذات ہوں جس سے میں نے محبت کی،\n> پس نہ میں نے جدائی کا خوف کیا اور نہ ہجر کا۔\n> پس بغداد میرا گھر ہے، میں اس کے سوا کوئی وطن نہیں دیکھتا،\n> اگر وہ مشکل ہو جائے تو میں مصر کی طرف مائل ہو جاتا ہوں۔\n\n### [ابن عربی کا مقام قربت (القربة) میں ۵۹۷ھ کے آغاز میں داخلہ]\n\nمیں اس مقام میں محرم ۵۹۷ھ میں داخل ہوا، جب میں مغرب (اندلس) کے علاقے میں ابحیسل نامی منزل پر سفر کر رہا تھا۔ میں اس میں خوشی سے حیران ہو گیا اور مجھے وہاں کوئی نہ ملا، تو میں تنہائی سے وحشت زدہ ہوا۔ مجھے ابویزید کا ذلت اور افتقار کے ساتھ داخل ہونا یاد آیا، جب انہیں اس منزل میں کوئی نہ ملا۔ حالانکہ وہ منزل میرا وطن ہے، لیکن میں نے وہاں وحشت محسوس نہیں کی، کیونکہ وطن کی طرف کشش ہر موجود کے لیے ذاتی ہوتی ہے، اور وحشت اجنبیت کے ساتھ ہوتی ہے۔ جب میں اس مقام میں داخل ہوا اور اس میں تنہا ہو گیا، اور مجھے معلوم ہوا کہ اگر کوئی اس میں مجھ پر ظاہر ہوا تو وہ میرا انکار کرے گا، تو میں اس کے کونوں اور چھپنے کی جگہوں کو تلاش کرنے لگا، حالانکہ میں اس کی حقیقت کو جانتا تھا، لیکن مجھے اس کا نام معلوم نہیں تھا۔ اور میں نے دیکھا کہ ذات حق (الحق) کے احکام مجھ پر مسلسل نازل ہو رہے ہیں، اور اس کے سفیر میرے پاس اتر رہے ہیں، جو میری دلجوئی چاہتے ہیں اور میری مجلس کے طالب ہیں۔\n\n### [ابو عبدالرحمن سلمی، ابن عربی اور مقام قربت (القربة)]\n\nمیں اس حال میں سفر کرتا رہا کہ انفرادیت کی وجہ سے وحشت تھی، حالانکہ انس تو صرف ہم جنس کے ساتھ ہوتا ہے۔ پس میری ملاقات آن حال نامی ایک منزل پر اللہ کے مردوں میں سے ایک شخص سے ہوئی۔ میں نے ایک جامع مسجد میں عصر کی نماز پڑھی، تو امیر ابو یحییٰ بن واجتن آئے، جو میرے دوست تھے، اور مجھ سے مل کر خوش ہوئے اور مجھ سے درخواست کی کہ میں ان کے پاس ٹھہروں، لیکن میں نے انکار کر دیا اور ان کے کاتب کے پاس ٹھہرا۔ میرے اور ان کے درمیان انس تھا۔ میں نے ان سے اپنی اس حالت کی شکایت کی کہ میں ایک ایسے مقام میں تنہا ہوں جس سے میں خوش ہوں۔ جب وہ میری دلجوئی کر رہے تھے، تو مجھے ایک شخص کا سایہ نظر آیا۔ میں اپنے بستر سے اس کی طرف اٹھا، شاید مجھے اس کے پاس کوئی راحت ملے۔ اس نے مجھے گلے لگایا۔ میں نے غور سے دیکھا تو وہ ابو عبدالرحمن سلمی تھے، جن کی روح میرے لیے مجسم ہو گئی تھی، جسے اللہ نے مجھ پر رحمت کے طور پر بھیجا تھا۔ میں نے ان سے کہا: میں آپ کو اس مقام میں دیکھ رہا ہوں۔ انہوں نے کہا: میں اسی میں قبض کیا گیا اور اسی پر مرا، اور میں اس سے جدا نہیں ہوتا۔\n\n### [دَورِ موسوی میں خضر کا حال اور دَورِ محمدی میں ان کا حال]\n\nمیں نے ان سے اس مقام میں اپنی وحشت اور مونس کی کمی کا ذکر کیا۔ انہوں نے کہا: غریب وحشت زدہ ہوتا ہے۔ اور جب تمہیں اس مقام کے حصول کے لیے الٰہی عنایت پہلے ہی حاصل ہو چکی ہے تو اللہ کا شکر ادا کرو۔ میرے بھائی! یہ کس کو حاصل ہوتا ہے؟ کیا تم اس پر راضی نہیں کہ خضر اس مقام میں تمہارے ساتھی ہوں؟ حالانکہ موسیٰ نے ان کے حال کا انکار کیا تھا، باوجود اس کے کہ اللہ نے ان کی عدالت کی گواہی دی تھی۔ اس کے باوجود موسیٰ نے ان کے افعال کا انکار کیا۔ اور میں اسے صرف ان کی صورت نہیں سمجھتا۔ پس انہوں نے حال (الحال) کو دیکھا اور اپنی ذات پر انکار کیا۔ اور انہیں اس میں غیرت (الغيرة) کی سلطنت نے ڈالا جو اللہ نے اپنے رسولوں کے لیے خاص کی ہے۔ اگر وہ صبر کرتے تو دیکھ لیتے۔ کیونکہ ان کے لیے ایک ہزار مسائل تیار کیے گئے تھے، جو سب موسیٰ کے ساتھ پیش آئے، اور وہ سب خضر پر انکار کرتے۔ ہمارے شیخ ابو النجا، جو ابو مدین کے نام سے مشہور ہیں، نے فرمایا: جب خضر نے موسیٰ کا مرتبہ اور رسولوں میں ان کی بلندی کو جان لیا، تو انہوں نے اس چیز کی تعمیل کی جس سے موسیٰ نے انہیں منع کیا تھا، اللہ اور اس کے رسول کی اطاعت میں۔ کیونکہ اللہ فرماتا ہے:\n> **وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانتَهُوا**\n> (اور جو کچھ رسول تمہیں دیں وہ لے لو اور جس سے منع کریں اس سے باز رہو)\n\nپس موسیٰ نے دوسری بار ان سے کہا:\n> **إِن سَأَلْتُكَ عَن شَيْءٍ بَعْدَهَا فَلَا تُصَاحِبْنِي**\n> (اگر میں اس کے بعد تم سے کسی چیز کے بارے میں پوچھوں تو مجھے اپنے ساتھ نہ رکھنا)\n\nتو خضر نے کہا: سنا اور اطاعت کی۔ جب تیسری بار ہوئی اور موسیٰ اپنا یہ حال بھول گئے کہ:\n> **إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ**\n> (بے شک میں اس خیر کا فقیر ہوں جو تو نے مجھ پر نازل کیا)\n\nاور ضرورت کے باوجود پانی پلانے پر اجرت نہیں مانگی تھی، تو خضر نے ان سے علیحدگی اختیار کر لی، اس کے بعد کہ انہوں نے ان پر ان کے انکار کردہ علم کو واضح کر دیا۔ پھر انہوں نے کہا:\n> **وَمَا فَعَلْتُهُ عَنْ أَمْرِي**\n> (اور میں نے یہ اپنے حکم سے نہیں کیا)\n\nکیونکہ وہ اپنے رب کی شریعت (شرع) اور منہاج پر تھے اور اس کے زمانے میں تھے۔ بخلاف ان کے حال کے محمد صَلَّى اللهُ عَليهِ وسَلَّم کی بعثت کے بعد، کیونکہ \"انہوں نے تمام شکار اپنے پیٹ میں جمع کر لیا ہے۔\"\n\n### [علماء الرسوم (ظاہری علوم کے علماء) کے لیے مقام قربت (القربة) میں مضبوط قدم]\n\nمیں نے ان سے کہا: اے ابو عبدالرحمن! میں اس مقام کا کوئی نام نہیں جانتا جس سے میں اسے ممتاز کر سکوں۔ انہوں نے کہا: اسے مقام قربت (القربة) کہتے ہیں، پس اس کی تحقیق کرو۔ پس میں نے اس کی تحقیق کی، تو معلوم ہوا کہ یہ ایک عظیم مقام ہے، جس میں اہل اجتہاد میں سے علماء الرسوم (ظاہری علوم کے علماء) کے مضبوط قدم ہیں، لیکن وہ نہیں جانتے کہ وہ اس میں ہیں۔ اور میں نے دیکھا کہ الٰہی امداد اسی مقام سے ان کی طرف جاری ہوتی ہے۔ اسی لیے وہ ایک دوسرے پر انکار کرتے ہیں اور ایک دوسرے کو غلط ٹھہراتے ہیں، کیونکہ انہیں ذوق (الذوق) حاصل نہیں ہوا، اور وہ نہیں جانتے کہ وہ مشاہدہ اور کشف (الکشف) کے ذریعے کس سے مدد حاصل کر رہے ہیں۔ پس ان میں سے ہر ایک حق پر ہے، جیسا کہ اس محمدی زمانے سے پہلے ہر نبی کے لیے ایک شریعت (شرع) اور منہاج تھا۔ اور ان سب پر ایمان لانا ہر مومن پر واجب ہے، اگرچہ ہم ان کے احکام میں سے صرف اسی کے پابند ہیں جس کے پابند کیے گئے ہیں۔\n\n### [شریعت کے علماء میں سے مجتہدین اور اہل کشف (الکشف)]\n\nپس شریعت کے علماء میں سے مجتہدین، تشریع میں رسولوں کے وارث ہیں، اور ان کی دلیلیں ان کے لیے انبیاء کے وحی کے مقام پر قائم ہیں۔ اور احکام کا اختلاف، احکام کے اختلاف کی طرح ہے۔ مگر وہ رسولوں کی طرح نہیں ہیں، کشف (الکشف) کی کمی کی وجہ سے۔ کیونکہ رسول ایک دوسرے کو تقویت دیتے ہیں، اور اسی طرح اہل کشف (الکشف) میں سے مجتہد علماء بھی۔ لیکن ان میں سے جو اہل کشف نہیں ہیں، وہ ایک دوسرے کو غلط ٹھہراتے ہیں۔ اگر خضر موسیٰ کے ساتھ ہونے کے آغاز میں ہی کہہ دیتے کہ میں جو کچھ بھی کرتا ہوں وہ اپنے حکم سے نہیں کرتا، تو موسیٰ ان پر انکار نہ کرتے اور نہ ہی اعتراض کرتے۔ اور اللہ نے انہیں یہ کہنے کی توفیق دی:\n> **سَتَجِدُنِي إِن شَاءَ اللَّهُ صَابِرًا وَلَا أَعْصِي لَكَ أَمْرًا**\n> (عنقریب تم مجھے، اگر اللہ نے چاہا، صبر کرنے والا پاؤ گے اور میں تمہارے کسی حکم کی خلاف ورزی نہیں کروں گا)\n\nاور صبر صرف اسی چیز پر ہوتا ہے جو مشکل ہو۔ پس اگر وہ مشیت (ان شاء اللہ) سے پہلے صبر کو مقدم کرتے، جیسا کہ محمدی کرتے ہیں، تو وہ صبر کرتے اور اعتراض نہ کرتے۔ کیونکہ اللہ نے تعلیم محمد ﷺ کے لیے اسے (مشیت کو) خبر دینے میں مقدم کیا۔\n\n### [اشیاء میں حکمت کی ترتیب پر ٹھہرنا]\n\nپس جو شخص اللہ کے علم کو اس کی مخلوق میں حاصل کرنا چاہتا ہے، اسے چاہیے کہ وہ اشیاء میں اس کی حکمت کی ترتیب پر ٹھہرے، پس وہ اسے مقدم کرے جسے اللہ نے مقدم کیا، اور اسے مؤخر کرے جسے اللہ نے مؤخر کیا۔ کیونکہ اس کے ناموں میں سے المقدم (مقدم کرنے والا) اور المؤخر (مؤخر کرنے والا) ہیں۔ پس اگر تم نے اسے مؤخر کیا جسے اس نے مقدم کیا، یا اسے مقدم کیا جسے اس نے مؤخر کیا، تو یہ ایک پوشیدہ نزاع ہے جو محرومی کا باعث بنتا ہے۔ اللہ تعالیٰ فرماتا ہے:\n> **وَلَا تَقُولَنَّ لِشَيْءٍ إِنِّي فَاعِلٌ ذَلِكَ غَدًا إِلَّا أَن يَشَاءَ اللَّهُ**\n> (اور کسی چیز کے بارے میں ہرگز یہ نہ کہنا کہ میں اسے کل کر دوں گا، مگر یہ کہ اللہ چاہے)\n\nپس اللہ نے استثناء کو مؤخر کیا، اور موسیٰ نے اسے مقدم کیا، تو وہ صبر نہ کر سکے۔ اگر وہ اسے مؤخر کرتے تو صبر کرتے۔ اور یہ آیت تورات میں عبرانی زبان میں مذکور ہے۔ پس اے ہمارے محمدی ملت کے بھائیو! اللہ کی قسم! اللہ کے ان شعائر پر ٹھہرو جو اس نے تمہارے لیے واضح کیے ہیں، اور اس حد سے تجاوز نہ کرو جو تمہارے لیے مقرر کی گئی ہے۔\n\nکیا تم نہیں دیکھتے کہ نبی صَلَّى اللهُ عَليهِ وسَلَّم نے حجۃ الوداع میں صفا پر چڑھ کر یہ آیت پڑھی:\n> **إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ**\n> (بے شک صفا اور مروہ اللہ کی نشانیوں میں سے ہیں)\n\nپھر فرمایا: \"میں اس سے شروع کرتا ہوں جس سے اللہ نے شروع کیا۔\"\n\nاور آپ نے یہ بات صرف ہمیں تعلیم دینے اور اللہ کے ساتھ ادب کو لازم کرنے کے لیے فرمائی۔ اگر آپ کے لیے سعی میں مروہ سے شروع کرنا جائز نہ ہوتا تو آپ یہ نہ فرماتے، اور آپ نے اس چیز کو ترجیح دی جس سے اللہ نے واؤ کی وجہ سے شروع کیا، حالانکہ اس مسئلے میں اختیار تھا۔ کیونکہ اللہ نے اس سے شروع نہیں کیا مگر ایک راز کی وجہ سے جسے وہ جانتا ہے۔ پس جو اس سے شروع نہیں کرے گا وہ اس کے فائدے سے محروم ہو جائے گا۔ اور نبی صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا:\n> **خذوا عني مناسككم**\n> (مجھ سے اپنے مناسک لے لو)\n\nاور سعی میں صفا کو مقدم کرنا مناسک میں سے ہے۔\n\n### [سفر میں خشکی (البر) کو سمندر (البحر) پر مقدم کرنا]\n\nاور میں نے اس معنی میں ایک عجیب حکایت سنی ہے جو مجھے موسیٰ بن محمد القرطبی القباب، جو مکی مسجد حرام میں باب الحزورة اور باب اجیاد کے پاس مینار پر مؤذن تھے، نے ۵۹۹ھ میں بتائی، اللہ ان پر رحم فرمائے۔ انہوں نے کہا: قیروان میں ایک شخص تھا جو حج کا ارادہ رکھتا تھا، تو اس کا دل اپنے سفر کے بارے میں خشکی (البر) اور سمندر (البحر) کے درمیان متردد تھا۔ کبھی اس کے لیے خشکی کو ترجیح ملتی اور کبھی سمندر کو۔ اس نے کہا: جب کل صبح ہو گی تو میں سب سے پہلے جس شخص سے ملوں گا اس سے مشورہ کروں گا، اور جہاں وہ ترجیح دے گا میں اسی کے مطابق فیصلہ کروں گا۔ سب سے پہلے اس کی ملاقات ایک یہودی سے ہوئی، تو اسے تکلیف ہوئی، پھر اس نے عزم کیا اور کہا: اللہ کی قسم! میں اس سے ضرور پوچھوں گا۔ اس نے کہا: اے یہودی! میں اپنے اس سفر کے بارے میں تم سے مشورہ چاہتا ہوں، کیا میں خشکی میں سفر کروں یا سمندر میں؟ یہودی نے اس سے کہا: سبحان اللہ! کیا تمہارے جیسا شخص ایسی بات پوچھتا ہے؟ کیا تم نہیں دیکھتے کہ تمہارے رب نے تمہاری کتاب میں فرمایا ہے:\n> **هُوَ الَّذِي يُسَيِّرُكُمْ فِي الْبَرِّ وَالْبَحْرِ**\n> (وہی ہے جو تمہیں خشکی اور سمندر میں چلاتا ہے)\n\nپس اس نے خشکی (البر) کو سمندر (البحر) پر مقدم کیا۔ اگر اللہ کے لیے اس میں کوئی راز نہ ہوتا اور یہ تمہارے لیے زیادہ بہتر نہ ہوتا تو وہ اسے مقدم نہ کرتا۔ اور اس نے سمندر کو مؤخر نہیں کیا مگر اس صورت میں جب مسافر کو خشکی کا راستہ نہ ملے۔ اس شخص نے کہا: میں اس کی بات پر حیران ہوا اور میں نے خشکی میں سفر کیا۔ وہ شخص کہتا ہے: اللہ کی قسم! میں نے ایسا سفر کبھی نہیں دیکھا، اور اللہ نے مجھے اس میں میری خواہش سے بڑھ کر خیر عطا فرمائی۔\n\n### [غزالی کا مقام قربت (القربة) کا انکار]\n\nاور ابو حامد الغزالی نے اس مقام کا انکار کیا اور کہا: صدیقیت (الصديقية) اور نبوت (النبوة) کے درمیان کوئی مقام نہیں ہے، اور جو صدیقین کی گردنوں کو پھلانگتا ہے وہ نبوت میں جا گرتا ہے، اور نبوت کا دروازہ بند ہے۔ پس وہ کہا کرتے تھے: صدیقین کی گردنوں کو نہ پھلانگو۔ اس میں کوئی شک نہیں کہ شریعتوں کے حامل انبیاء بشر میں اللہ کے سب سے بلند بندے ہیں، اس کے باوجود یہ بعید نہیں کہ اللہ مفضول کو ایسے علم سے خاص کر دے جو فاضل کے پاس نہ ہو۔ اور اس کا یہ امتیاز اس بات کی دلیل نہیں کہ وہ اس علم کی وجہ سے اس سے افضل ہے۔ بلکہ خضر نے موسیٰ سے کہا: میں ایک ایسے علم پر ہوں جو اللہ نے مجھے سکھایا ہے، جسے تم نہیں جانتے، اور تم ایک ایسے علم پر ہو جو اللہ نے تمہیں سکھایا ہے، جسے میں نہیں جانتا۔ اور انہوں نے یہ نہیں کہا کہ میں تم سے افضل ہوں۔ بلکہ انہوں نے موسیٰ کے حق کو جانا اور جو ان کے لیے مناسب تھا، اور ان کے حکم کی تعمیل کی جس سے انہوں نے ان کی صحبت سے منع کیا تھا، موسیٰ کے مقام اور ان کی بلندی کے احترام میں۔ اور موسیٰ کا ان سے جدا ہوتے وقت خاموش رہنا اور اپنی ممانعت سے رجوع نہ کرنا، اس لیے تھا کہ وہ جانتے تھے کہ خضر ان میں سے ہیں جنہوں نے موسیٰ علیہ السلام کی ممانعت نہیں سنی، خاص طور پر جب انہوں نے کہا:\n> **وَمَا فَعَلْتُهُ عَنْ أَمْرِي**\n> (اور میں نے یہ اپنے حکم سے نہیں کیا)\n\nپس موسیٰ نے جان لیا کہ خضر ان سے صرف اپنے رب کے حکم سے جدا ہوئے ہیں، لہٰذا انہوں نے ان کی جدائی پر اعتراض نہیں کیا۔ اور موسیٰ کو ان کا مقصود اور ذات حق (الحق) کا مقصود ان کی تادیب میں حاصل ہو گیا۔ پس انہوں نے جان لیا کہ اللہ کے ایسے بندے ہیں جن کے پاس وہ علم ہے جو ان کے پاس نہیں، اور یہ صرف اکوان (کائنات) کے علوم میں سے ایک علم تھا جو علوم کشف (الکشف) میں سے ہے، اور یہ سلوک کرنے والے مریدین کے احوال میں سے ہے۔ تو کیا ہوتا اگر یہ وہ علوم ہوتے جو جناب الٰہی سے متعلق ہوتے، خواہ وہ علم محکم میں سے ہوتے یا متشابہ میں سے؟\n\n### [وہ راز جو ابوبکر کے دل میں ٹھہر گیا]\n\nاور اسی مقام سے ابوبکر صدیق کو وہ راز حاصل ہوا جو ان کے دل میں ٹھہر گیا، اور اس راز کی قوت ان کے وقت کے ساتھ ظاہر ہوئی۔ اور حضرت عائشہ کا رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے مرض کے دوران یہ کہنا، جب آپ نے لوگوں کو نماز پڑھانے کا حکم دیا، کہ وہ ایک نرم دل آدمی ہیں (اس کا تعلق اسی راز سے ہے)۔ اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم ان کے پاس موجود راز کی وجہ سے ان کے بارے میں وہ جانتے تھے جو جماعت نہیں جانتی تھی۔ پس جس دن رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی وفات ہوئی، ابوبکر صدیق کے سوا ہر شخص اس دن حیران رہ گیا، اور اس کی عقل میں خلل پڑ گیا، اور اس نے وہ بات کہی جو حقیقت کے مطابق نہیں تھی۔ لیکن ابوبکر صدیق پر اس میں سے کوئی امر طاری نہیں ہوا۔ بلکہ وہ منبر پر چڑھے اور لوگوں سے خطاب کیا اور نبی صَلَّى اللهُ عَليهِ وسَلَّم کی وفات کا ذکر کیا، اور فرمایا: \"تم میں سے جو محمد کی عبادت کرتا تھا، تو محمد وفات پا چکے ہیں، اور جو اللہ کی عبادت کرتا تھا، تو اللہ زندہ ہے، اسے موت نہیں آئے گی۔\" پھر آپ نے یہ آیت تلاوت کی:\n> **إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَّيِّتُونَ**\n> (بے شک آپ کو بھی مرنا ہے اور ان کو بھی مرنا ہے)\n\nاور:\n> **وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ**\n> (اور محمد تو صرف ایک رسول ہیں)\n\nتو لوگوں کے دلوں کو سکون ملا، یہاں تک کہ عمر نے کہا: اللہ کی قسم! مجھے ایسا لگا جیسے میں نے یہ آیت اسی دن سنی ہے۔ اور یہ نبی صَلَّى اللهُ عَليهِ وسَلَّم کا فرمان ہے: \"جب واجب ہو جائے (یعنی موت واقع ہو جائے) تو کوئی رونے والی نہ روئے۔\" لیکن موت واقع ہونے سے پہلے رونا محمود ہے۔\n\nاور ابوبکر نے ایسا ہی کیا جب رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کھڑے ہوئے اور فرمایا: \"تم اس شخص کے بارے میں کیا کہتے ہو جسے اختیار دیا گیا اور اس نے اللہ سے ملاقات کو اختیار کر لیا؟\" تو ابوبکر اکیلے روئے، جماعت کے بغیر، اور جان لیا کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے اپنے اصحاب کو اپنی موت کی خبر دی ہے۔ تو صحابہ نے ابوبکر کے رونے پر انکار کیا، حالانکہ وہ زیادہ جاننے والے تھے۔ پھر جب نبی صَلَّى اللهُ عَليهِ وسَلَّم کی وفات ہوئی، تو لوگ روئے اور چیخ و پکار کی، سوائے ابوبکر کے، نبی صَلَّى اللهُ عَليهِ وسَلَّم کے اس فرمان کی تعمیل میں کہ: \"جب واجب ہو جائے تو کوئی رونے والی نہ روئے۔\"\n\nیہ سب اس راز کی وجہ سے تھا جو اس مقام نے انہیں عطا کیا۔\n\n### [جو بات کہی جانی چاہیے وہ یہ ہے کہ محمد اور ابوبکر کے درمیان کوئی شخص نہیں، نہ کہ صدیقیت (الصديقية) اور نبوت (النبوة) کے درمیان کوئی مقام نہیں]\n\nپس جو بات کہی جانی چاہیے وہ یہ ہے کہ محمد اور ابوبکر کے درمیان کوئی شخص نہیں، نہ کہ صدیقیت (الصديقية) اور نبوت (النبوة) کے درمیان کوئی مقام نہیں۔ کیونکہ صدیق ایمان کے طریقے پر تابع ہوتا ہے، پس جس چیز کا اس کے متبوع نے انکار کیا اس کا اس نے انکار کیا، اور جس چیز کو اس کے متبوع نے مقرر کیا اس کو اس نے مقرر کیا۔ یہ صدیق کا حصہ ہے اس کے صدیق ہونے کی حیثیت سے۔ اور جب وہ کسی دوسرے مقام پر ہو تو اس پر صدیقیت کا حال حکم نہیں کرتا۔ پس یہ جان لو۔\n\nچودھواں سفر الفتوحات المکیہ کے ایک سو چھٹے جز کے اختتام کے ساتھ مکمل ہوا۔",
    "fa": "(باب صد و شصت و یکم در مقامی که میان صدیقیت و نبوت است و آن مقام قربت (القربة) است)\n\nگروهی از مردان خدا آن را انکار کردند *** و انکار آنچه ندانند، شأن ایشان نیست.\n\nآن مقامی است که شواهدش برپاست *** در سوختن و کشتن و آنچه باقی ماند که انجام دادند.\n\nاگر در قرآن تدبر می‌کردند، *** وجه حقیقت در آنچه از آن غافل شدند، بر ایشان آشکار می‌شد.\n\nو در مقامشان، از ایشان تخصیص نیافتند *** مگر کسانی که از [سوی] رحمان تعقل کردند.\n\nو ابوبکر نیز از آن مقام است و امتیاز او *** به سرّی است که اگر در حکم ما نظر می‌کردند، کامل می‌شدند.\n\nپس میان ابوبکر و صاحبش [پیامبر] *** اگر به آنچه گفتم بنگری، کسی نیست.\n\nاین است سخن صحیحی که دلایلش *** در کشف (الکشف) نزد مردان خدا هنگامی که عمل کردند، دلالت نمود.\n\n### [قربت (القربة) صفتی الهی و مقام خضر با موسی است]\n\nقربت (القربة) صفتی الهی و مقامی ناشناخته است که آثار خاص آن از سوی پیامبران (علیهم السلام) انکار شده است، با وجود نیاز ایشان به آن، و شهادت حق (الحق) برای صاحب آن به عدالت و اختصاص. این مقام خضر با موسی است. و موسی را از آن غافل نساخت مگر سلطنت غیرت (الغيرة) که خداوند در پیامبران (علیهم السلام) بر مقام شریعت الهی که به دست ایشان جاری می‌شود، قرار داده است. از این رو، به خاطر خدا انکار کردند و انکار موسی (علیه السلام) با وجود تنبیه بنده صالح (خضر) در هر مسئله، تکرار شد. اما سلطنت غیرت (الغيرة) جز اعتراض را نمی‌پذیرد، زیرا شریعت او برایش ذوق (الذوق) است و آنچه از دیگری می‌بیند، برای او بیگانه است، هرچند آن علم صحیح باشد، اما ذوق (الذوق) غالب‌تر و حال محکم‌تر است. به همین دلیل به رسول خدا (صلی الله علیه و سلم) گفته شد: **قُلْ رَبِّ زِدْنِي عِلْماً** (بگو پروردگارا، علم مرا زیاد کن) و به او گفته نشد: بگو پروردگارا، حال مرا زیاد کن. زیرا اگر حالش زیاد می‌شد، انکارش زیاد می‌شد. و هرگاه علمش زیاد می‌شد، وضوح، کشف (الکشف)، وسعت، گشایش و تنزه در وجوهی که از روبندهای خود کنار رفته و از پس پرده‌ها و پوشش‌های خود ظاهر شده بودند، زیاد می‌شد. پس تنگی و حرج برطرف شد و کمال در نقص مشاهده گشت.\n\n### [مشاهده کمال در نقص]\n\nو چون به این مقام بلند دست یافتم، با اشاره و تنبیه گفتم:\n\nو من نقص را به خاطر کسی که دوست می‌دارم، دوست دارم *** زیرا کمال برای کسی که می‌داند، به واسطه آن [نقص] حاصل شد.\n\nو نقص جز از بیم چشم [زخم] نیامد *** مانند ماه شب چهارده در آخر ماه.\n\nو ماه شب چهارده که می‌بینید، ناقص نیست *** بلکه برای کسی که در فکر غواصی کند، کامل است.\n\nاو را در روشنایی‌اش تمام و کامل می‌بیند *** در کامل‌ترین حالات در باطن و ظاهر.\n\nپس اگر در هستی (الکون) نقص محققی نبود *** وجود حق (الوجود الحق) در قدرش ناقص می‌شد.\n\nپس به واسطه من، وجود (الوجود) حق (الحق) کمال خود را یافت *** همراه با نقص؛ پس بنگر که شعر من چه در بر دارد.\n\nغزالی از فردوس نقاب‌زده آمد *** برای من، و آنچه جاری می‌شود بر خدا پنهان نیست.\n\nپس به او گفتم: خوش آمدی، *** به کسی که به حیات عشق، سینه‌ام او را در بر گرفته است.\n\nدر هر حالی، از سر عشق به او شیفته‌ام *** در زندگی و مرگ، در قیامت و حشر.\n\nروزی نقاب برگرفت و زیبایی‌هایی آشکار شد *** که از آن خبر می‌دهد که آن شب قدر است.\n\nاز سر عشق برایش سجده کردم، و چون او را دیدم *** دانستم که به غیر (الغیر) تعلق نگرفته‌ام.\n\nپس از سر تعظیم تکبیر گفتم که مرا دوست داشته است *** و سرّی که او را شیفته کرده بود، آشکار شد.\n\nو محقق ساختم که من عین کسی هستم که دوستش داشته‌ام *** پس نه از جدایی ترسیدم و نه از هجران.\n\nپس بغداد خانه من است و وطنی جز آن نمی‌بینم *** و اگر [بغداد] عزیز باشد، به مصر خود پناه می‌برم.\n\n### [ورود ابن عربی به مقام قربت (القربة) در آغاز سال ۵۹۷]\n\nبه این مقام در ماه محرم سال پانصد و نود و هفت هجری وارد شدم، در حالی که در منزل \"ابحیسل\" در سرزمین مغرب مسافر بودم. از سر شادی در آن سرگشته شدم و کسی را در آن نیافتم، پس از تنهایی به وحشت افتادم. به یاد ورود ابویزید [بسطامی] با خواری و فقر افتادم که او نیز در آن منزل کسی را نیافت. و آن منزل، موطن من است، پس در آن وحشت نکردم، زیرا اشتیاق به وطن برای هر موجودی ذاتی است و وحشت همراه با غربت است. و چون به این مقام وارد شدم و در آن منفرد گشتم و دانستم که اگر کسی در آن بر من ظاهر شود، مرا انکار خواهد کرد، پس به دنبال گوشه‌ها و پنهانگاه‌های آن می‌گشتم و نامش را نمی‌دانستم، با وجود تحققم به آن و آنچه خداوند به کسی که به آن می‌رسد، اختصاص داده است. و دیدم که اوامر حق (الحق) پی در پی بر من نازل می‌شود و سفیرانش به سویم فرود می‌آیند و به دنبال همدمی و همنشینی با من هستند.\n\n### [ابوعبدالرحمن سلمی و ابن عربی و مقام قربت (القربة)]\n\nپس سفر کردم در حالی که بر آن حال از وحشت به دلیل انفراد بودم، در حالی که انس تنها با همجنس حاصل می‌شود. پس مردی از رجال [خدا] را در منزلی به نام \"آن حال\" ملاقات کردم. نماز عصر را در مسجدی جامع خواندم. امیر ابویحیی بن واجتن که دوست من بود آمد و از دیدن من شاد شد و از من خواست که نزد او اقامت کنم، اما نپذیرفتم و نزد کاتب او اقامت گزیدم. میان من و او انسی بود. از انفراد خود در مقامی که از آن شاد بودم، به او شکایت کردم. در حالی که او با من انس می‌گرفت، ناگهان سایه شخصی بر من آشکار شد. از جایم برخاستم به سوی او، شاید گشایشی نزد او بیابم. او مرا در آغوش گرفت. در او نگریستم، دیدم که او ابوعبدالرحمن سلمی است که روحش برای من تجسد یافته بود و خداوند او را از سر رحمت به سوی من فرستاده بود. به او گفتم: تو را در این مقام می‌بینم؟ گفت: در همین مقام قبض شدم و بر آن مردم، و ما از آن جدا نمی‌شویم.\n\n### [حال خضر در دوره موسوی و حال او در دوره محمدی]\n\nپس وحشتم و نبود انیس را در آن مقام برایش بازگو کردم. گفت: غریب وحشت‌زده است. و پس از آنکه عنایت الهی برای رسیدن به این مقام بر تو سبقت گرفته است، خدا را شکر کن. ای برادر، این برای چه کسی حاصل می‌شود؟ آیا راضی نیستی که خضر در این مقام، صاحب تو باشد؟ در حالی که موسی حال او را انکار کرد، با وجود آنکه خداوند به عدالت او شهادت داده بود. با این حال، موسی آنچه از او سر زد را انکار کرد، و من آن را جز صورتش نمی‌بینم. پس حال خود را دید و بر نفس خود انکار کرد. و سلطنت غیرت (الغيرة) که خداوند پیامبرانش را به آن اختصاص داده، او را به این کار واداشت. اگر صبر می‌کرد، می‌دید. زیرا خضر هزار مسئله برای او آماده کرده بود که همه برای موسی رخ داده بود و او همه را بر خضر انکار می‌کرد. شیخ ما ابوالنجا معروف به ابومدین گفت: چون خضر مرتبه موسی و بلندی قدر او را در میان پیامبران دانست، آنچه موسی او را از آن نهی کرد، به اطاعت از خدا و رسولش امتثال نمود. زیرا خداوند می‌فرماید: **وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا** (و آنچه را پیامبر به شما داد بگیرید و از آنچه شما را نهی کرد باز ایستید). پس [موسی] در مرتبه دوم به او گفت: **إِنْ سَأَلْتُكَ عَنْ شَيْ‏ءٍ بَعْدَها فَلا تُصاحِبْنِي** (اگر بعد از این از تو درباره چیزی بپرسم، دیگر با من همراهی مکن). [خضر] گفت: شنیدم و اطاعت کردم. پس چون مرتبه سوم پیش آمد و موسی حال گفتار خود را فراموش کرد که: **إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ** (من به آنچه از خیر بر من نازل کنی، نیازمندم) و با وجود نیاز، برای آب دادن [گوسفندان] مزد نخواست، خضر از او جدا شد، پس از آنکه علم آنچه را موسی انکار کرده بود، برایش آشکار ساخت. سپس به او گفت: **وَمَا فَعَلْتُهُ عَنْ أَمْرِي** (و من آن را از پیش خود انجام ندادم). زیرا او در زمان خود بر شریعت و منهاجی از پروردگارش بود، برخلاف حال او پس از بعثت محمد (صلی الله علیه و سلم)، زیرا او [محمد] همه صید را در شکم خود دارد.\n\n### [علمای رسوم (الرسوم) قدمی راسخ در مقام قربت (القربة) دارند]\n\nپس به او گفتم: ای ابوعبدالرحمن، من برای این مقام نامی نمی‌شناسم که آن را با آن متمایز سازم. او به من گفت: این مقام، مقام قربت (القربة) نامیده می‌شود، پس به آن متحقق شو. پس به آن متحقق شدم. ناگهان دیدم که آن مقامی عظیم است که علمای رسوم (الرسوم) از اهل اجتهاد، در آن قدمی راسخ دارند، اما نمی‌دانند که در آن هستند. و دیدم که امداد الهی از این مقام به سوی آنان جاری می‌شود. به همین دلیل است که برخی از آنان بر برخی دیگر انکار می‌کنند و برخی، برخی دیگر را تخطئه می‌کنند، زیرا ذوق (الذوق) برایشان حاصل نشده و نمی‌دانند که از چه کسی مشاهده و کشف (الکشف) دریافت می‌کنند. پس هر یک از آنان بر حق است، همان‌گونه که برای هر پیامبری که پیش از این زمان محمدی بوده، شریعت و منهاجی بوده است. و ایمان به همه آن واجب است بر هر مؤمنی، هرچند از احکام آنان جز آنچه بر ما لازم شده است، ملتزم نباشیم.\n\n### [مجتهدان از علمای شریعت و اهل کشف (الکشف)]\n\nپس مجتهدان از علمای شریعت، وارثان پیامبران در تشریع هستند و ادله آنان برایشان به منزله وحی برای انبیاست. و اختلاف احکام [آنان] مانند اختلاف احکام [انبیا] است، جز اینکه آنان به دلیل نبود کشف (الکشف)، مانند پیامبران نیستند. زیرا پیامبران یکدیگر را تأیید می‌کنند، و همچنین اهل کشف (الکشف) از علمای اجتهاد [یکدیگر را تأیید می‌کنند]. اما غیر اهل کشف (الکشف) از آنان، برخی، برخی دیگر را تخطئه می‌کنند. و اگر خضر از همان ابتدا که با موسی همراه شد، به او می‌گفت: هیچ یک از کارهایی که می‌بینی انجام می‌دهم، از امر خودم نیست، موسی آن را انکار نمی‌کرد و با او مخالفت نمی‌نمود. و خداوند او را به این سخن گویا ساخت: **سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا وَلَا أَعْصِي لَكَ أَمْرًا** (به زودی مرا، اگر خدا بخواهد، شکیبا خواهی یافت و هیچ فرمانی را از تو سرپیچی نخواهم کرد). و صبر جز بر آنچه دشوار است، نیست. پس اگر صبر را بر مشیت مقدم می‌داشت، چنانکه محمدی [کامل] انجام می‌دهد، صبر می‌کرد و اعتراض نمی‌نمود. زیرا خداوند آن را در اعلام [به موسی] مقدم داشت تا محمد (صلی الله علیه و سلم) را تعلیم دهد.\n\n### [ایستادن بر ترتیب حکمت در اشیاء]\n\nپس هر کس می‌خواهد علم خدا را در خلقش به دست آورد، باید بر ترتیب حکمت او در اشیاء بایستد؛ آنچه را خدا مقدم داشته، مقدم بدارد و آنچه را مؤخر داشته، مؤخر بدارد. زیرا از اسماء او \"المقدم\" و \"المؤخر\" است. پس اگر آنچه را او مقدم داشته، مؤخر کنی یا آنچه را مؤخر داشته، مقدم کنی، این نزاعی پنهان است که موجب محرومیت می‌شود. خداوند متعال می‌فرماید: **وَلَا تَقُولَنَّ لِشَيْءٍ إِنِّي فَاعِلٌ ذَلِكَ غَدًا إِلَّا أَنْ يَشَاءَ اللَّهُ** (و هرگز درباره چیزی مگو که من فردا آن را انجام خواهم داد، مگر اینکه خدا بخواهد). پس استثناء را مؤخر داشت، اما موسی آن را مقدم داشت و صبر نکرد. اگر آن را مؤخر می‌داشت، صبر می‌کرد. و این آیه به زبان عبری در تورات ذکر شده است. پس ای برادران ما از اهل این ملت محمدی، خدا را، خدا را! بر شعائر الهی که برای شما بیان کرده است، بایستید و از آنچه برای شما رسم شده، تجاوز نکنید.\n\nآیا نمی‌بینی که پیامبر (صلی الله علیه و سلم) هنگامی که در حجة الوداع بر صفا بالا رفت، این آیه را خواند: **إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ** (همانا صفا و مروه از شعائر خداست)، سپس فرمود: «با آنچه خدا آغاز کرده، آغاز می‌کنم.»\n\nو این را نگفت مگر برای تعلیم ما و لزوم ادب با خدا. و اگر برای او جایز نبود که در سعی خود از مروه آغاز کند، این را نمی‌گفت. و آنچه را خدا با آن آغاز کرده بود، بر آنچه در مسئله از تخییر وجود داشت، ترجیح داد، به خاطر حرف \"واو\" [در آیه]. زیرا خداوند با آن آغاز نکرده است مگر به خاطر سرّی که خود می‌داند. پس هر کس با آن آغاز نکند، از فایده‌اش محروم می‌شود. و پیامبر (صلی الله علیه و سلم) فرمود: «مناسک خود را از من بگیرید.»\n\nو مقدم داشتن صفا در سعی، از مناسک است.\n\n### [مقدم داشتن خشکی بر دریا در سفر]\n\nو در این معنی، حکایتی شگفت‌انگیز از یک یهودی روایت کرده‌ام که موسی بن محمد قرطبی، قَبّاب، مؤذن مسجدالحرام مکی در مناره‌ای که نزد باب حزوره و باب اجیاد بود (رحمه الله)، در سال پانصد و نود و نه هجری برایم نقل کرد. گفت: مردی در قیروان قصد حج داشت. خاطرش در سفر میان خشکی و دریا مردد بود. گاهی خشکی برایش ترجیح می‌یافت و گاهی دریا. پس گفت: فردا صبح، اولین مردی که ملاقات کنم، با او مشورت می‌کنم و هر جا که او ترجیح دهد، حکم می‌کنم. اولین کسی که ملاقات کرد، یک یهودی بود. ناراحت شد، سپس عزم خود را جزم کرد و گفت: به خدا سوگند، از او خواهم پرسید. پس گفت: ای یهودی، در این سفرم با تو مشورت می‌کنم، آیا از خشکی بروم یا از دریا؟ یهودی به او گفت: سبحان الله! آیا کسی مثل تو در مورد چنین چیزی سؤال می‌کند؟ مگر نمی‌بینی که خداوند در کتاب شما می‌فرماید: **هُوَ الَّذِي يُسَيِّرُكُمْ فِي الْبَرِّ وَالْبَحْرِ** (اوست که شما را در خشکی و دریا سیر می‌دهد)؟ پس خشکی را بر دریا مقدم داشته است. اگر در آن سرّی برای خدا نبود و برای شما اولی نبود، آن را مقدم نمی‌داشت. و دریا را مؤخر نساخت مگر زمانی که مسافر راهی به خشکی نیابد. [راوی] گفت: از سخن او تعجب کردم و در خشکی سفر کردم. آن مرد می‌گوید: به خدا سوگند، سفری مانند آن ندیدم و خداوند در آن خیری بیش از آنچه آرزو داشتم، به من عطا کرد.\n\n### [انکار غزالی نسبت به مقام قربت (القربة)]\n\nو ابوحامد غزالی این مقام را انکار کرده و گفته است: میان صدیقیت (الصديقية) و نبوت (النبوة) مقامی نیست، و هر کس از گردن صدیقان بگذرد، در نبوت (النبوة) افتاده است، و نبوت دری بسته است. پس می‌گفت: از گردن صدیقان مگذرانید. و شکی نیست که پیامبران صاحب شریعت، والاترین بندگان خدا از میان بشر هستند. با این حال، بعید نیست که خداوند فرد مفضول را به علمی اختصاص دهد که نزد فاضل نیست. و این تمایز او، دلالت بر آن ندارد که به واسطه آن علم، از او برتر است. بلکه [خضر] به موسی گفت: ای موسی، من بر علمی هستم که خداوند به من آموخته و تو آن را نمی‌دانی، و تو بر علمی هستی که خداوند به تو آموخته و من آن را نمی‌دانم. و به او نگفت که من از تو برترم. بلکه حق موسی و آنچه شایسته او بود را دانست و امر او را در آنچه از همراهی‌اش نهی کرده بود، امتثال نمود، از سر احترام به مقام موسی و بلندی منزلت او. و سکوت موسی هنگام جدایی از او و بازنگشتن از نهی خود، به این دلیل بود که دانست خضر از کسانی است که نهی موسی (علیه السلام) را نشنیده است، به ویژه آنکه به او گفت: **وَمَا فَعَلْتُهُ عَنْ أَمْرِي** (و من آن را از پیش خود انجام ندادم). پس موسی دانست که او جز به امر پروردگارش از او جدا نشده است. پس بر جدایی او اعتراضی نکرد. و مقصود موسی و مقصود حق (الحق) در تأدیب او حاصل شد. پس دانست که خداوند بندگانی دارد که علمی نزد آنان است که نزد او نیست. و آن علم، جز علم کونی از اکوان، از علوم کشف (الکشف) نبود، که از احوال مریدان صاحب سلوک است. پس چگونه خواهد بود اگر از علوم متعلق به جناب الهی باشد، یا از علم محکم یا متشابه؟\n\n### [سرّی که در نفس ابوبکر جای گرفت]\n\nو از این مقام، سرّی برای ابوبکر صدیق حاصل شد که در نفس او جای گرفت و قدرت آن سرّ در وقت خود آشکار شد. و [این در مقابل] سخن عایشه به رسول خدا (صلی الله علیه و سلم) در بیماری‌اش بود، هنگامی که امر کرد با مردم نماز بخواند، که او مردی اندوهگین است. و رسول خدا (صلی الله علیه و سلم) از او به واسطه سرّی که نزد او حاصل شده بود، چیزی می‌دانست که جماعت نمی‌دانستند. در روزی که رسول خدا (صلی الله علیه و سلم) درگذشت، هیچ کس باقی نماند مگر آنکه در آن روز مبهوت شد و عقلش آشفته گشت و سخنی گفت که حقیقت بر آن نبود، جز ابوبکر صدیق. هیچ امری از آن [آشفتگی] بر او عارض نشد، بلکه بر منبر بالا رفت و برای مردم خطبه خواند و مرگ پیامبر (صلی الله علیه و سلم) را یاد کرد و گفت: هر کس از شما محمد را می‌پرستید، پس محمد مرده است، و هر کس خدا را می‌پرستید، پس خدا زنده است و نمی‌میرد. سپس این آیات را تلاوت کرد: **إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ** (همانا تو می‌میری و آنان نیز می‌میرند) و **وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ** (و محمد جز فرستاده‌ای نیست) تا آخر آیه. پس دل مردم آرام گرفت، تا جایی که عمر گفت: به خدا سوگند، گویی این آیه را جز در آن روز نشنیده بودم. و این سخن پیامبر (صلی الله علیه و سلم) است که: «هنگامی که واجب شد» یعنی مرگ، «پس هیچ گریه‌کننده‌ای نباید بگرید.» اما پیش از وقوع مرگ، گریه ستوده است.\n\nو ابوبکر نیز چنین کرد. هنگامی که رسول خدا (صلی الله علیه و سلم) برخاست و فرمود: «درباره مردی که خیر [الهی] را برگزید و دیدار خدا را انتخاب کرد، چه می‌گویید؟» ابوبکر به تنهایی، بدون جماعت، گریه کرد و دانست که رسول خدا (صلی الله علیه و سلم) مرگ خود را به یارانش خبر داده است. پس صحابه بر گریه ابوبکر انکار کردند، در حالی که او داناتر بود. پس چون پیامبر (صلی الله علیه و سلم) درگذشت، مردم گریه کردند و ضجه زدند، جز ابوبکر، به پیروی از سخن پیامبر (صلی الله علیه و سلم) که: «هنگامی که واجب شد، پس هیچ گریه‌کننده‌ای نباید بگرید.»\n\nهمه اینها از سرّی است که این مقام به او عطا کرد.\n\n### [آنچه شایسته است گفته شود این است که میان محمد و ابوبکر کسی نیست، نه اینکه میان صدیقیت (الصديقية) و نبوت (النبوة) مقامی نیست]\n\nپس آنچه شایسته است گفته شود این است که میان محمد و ابوبکر کسی نیست، نه اینکه میان صدیقیت (الصديقية) و نبوت (النبوة) مقامی نیست. زیرا صدیق از طریق ایمان، تابع است. پس آنچه متبوعش انکار کرد، او انکار کرد و آنچه متبوعش تأیید کرد، او تأیید کرد. این بهره صدیق از صدیق بودن اوست. و [این مقام قربت] از آنِ مقام دیگری است که حال صدیقیت بر آن حکم نمی‌کند. پس این را بدان. سفر چهاردهم با پایان جزء صد و ششم از فتوحات مکیه به اتمام رسید."
  },
  "page_count": 3
}