{
  "id": 56,
  "title": {
    "ar": "الباب السادس والخمسون في معرفة الاستقراء وصحته من سقمه‏",
    "en": "Chapter Fifty-Six: Concerning the Knowledge of Induction (الاستقراء) and the Soundness Thereof from its Defectiveness.",
    "ur": "چھپنواں باب: استقراء (استقراء) کی معرفت اور اس کی صحت و سقم کے بیان میں۔",
    "fa": "باب پنجاه و ششم در معرفت استقراء و صحت آن از سقمش (بیماری‌اش)"
  },
  "content": {
    "ar": "## (الباب السادس والخمسون) في معرفة الاستقراء وصحته من سقمه‏\n\n\n> للاستقراء حد في المعاني *** يلازمه القوي من الرجال‏\n\n\n> له حكم ولا يعطيك علما *** فصورته كمنزلة الظلال‏\n\n\n> مزاحمة الدليل بقوم فيها *** وأين العين من شخص المثال‏\n\n\n> منازلة الظنون وإن منها *** لمعطيك النزول إلى سفال‏\n\n\n> فلا تحكم بالاستقراء قطعا *** فما عين الغزالة كالغزال‏\n\n\n> وإن ظهرت بالاستقراء علوم *** فما حكم التضمر كالهزال‏\n\n\n### [متى يكون الاستقراء صحيحا]\n\n\nخرج مسلم في صحيحه أن الله يقول شفعت الملائكة وشفع النبيون وشفع المؤمنون وبقي أرحم الراحمين‏\n\n\nفسمى نفسه عز وجل أرحم الراحمين وقال إنه خَيْرُ الْغافِرِينَ وقال في الصحيح أنا عند ظن عبدي بي فليظن بي خيرا\n\n\nفإذا استقرينا الوجود إن الكرام الأصول لا يصدر منهم إلا مكارم الأخلاق من الإحسان للمحسن والتجاوز عن المسي‏ء والعفو عن الزلة وإقالة العثرة وقبول المعذرة والصفح عن الجاني وأمثال هذا مما هو من مكارم الأخلاق واستقرينا ذلك فوجدنا لا يخطئ بقول شاعر العرب في ذلك‏\n\n\nأن الجياد على أعراقها تجري‏\n\n\nوالحق أولى بصفة مكارم الأخلاق من المخلوقين فهنا تكون صحة الاستقراء في الإلهيات‏\n\n\n### [متى يكون الاستقراء سقيما]\n\n\nوأما سقم الاستقراء فلا يصح في العقائد فإن مبناها على الأدلة الواضحة فإنه لو استقرينا كل من ظهرت منه صنعة وجدناه جسما ونقول إن العالم صنعة الحق وفعله وقد تتبعنا الصناع فما وجدنا صانعا إلا ذا جسم فالحق جسم تعالى الله عن ذلك علوا كبيرا وتتبعنا الأدلة في المحدثات فما وجدنا عالما لنفسه وإنما الدليل يعطي أن لا يكون عالم إلا بصفة زائدة على ذاته تسمى علما وحكمها فيمن قامت به أن يكون عالما وقد علمنا إن الحق عالم فلا بد أن يكون له علم ويكون ذلك العلم صفة زائدة على ذاته قائمة به كلا بل هو الله العالم الحي القادر القاهر الخبير كل ذلك لنفسه لا بأمر زائد على ذاته إذ لو كان ذلك بأمر زائد على نفسه وهي صفات كمال لا يكون كمال الذات إلا بها فيكون كماله بزائد على ذاته وتتصف ذاته بالنقص إذا لم يقم به هذا الزائد فهذا من الاستقراء وهذا الذي دعا المتكلمين أن يقولوا في صفات الحق لا هي هو ولا هي غيره وفيما ذكرناه ضرب من الاستقراء الذي لا يليق بالجناب العالي ثم إنه لما استشعر القائلون بالزائد سلكوا في العبارة عن ذلك مسلكا آخر فقالوا ما عقلناه بالاستقراء وإنما قلنا أعطى الدليل أنه لا يكون عالم إلا من قام به العلم ولا بد أن يكون أمرا زائدا على ذات العالم لأنه من صفات المعاني يقدر رفعه مع بقاء الذات فلما أعطى الدليل ذلك طردناه شاهدا وغائبا يعني في الحق والخلق وهذا هرب منهم وعدول عن عين‏\nالصواب ثم إنهم أكدوا ذلك بقولهم ما ذكرناه عنهم إن صفاته لا هي هو ولا هي غيره وحدوا الغيرين بحد يمنعه غيرهم وإذا سألتهم هل هي أمر زائد اعترفوا بأنها أمر زائد وهذا هو عين الاستقراء\n\n\n### [الله لا يقاس بالمخلوق والمخلوق لا يقاس بالله‏]\n\n\nفلهذا قلنا إن الاستقراء في العلم بالله لا يصح وإن الاستقراء على الحقيقة لا يفيد علما وإنما أثبتناه في مكارم الأخلاق شرعا وعرفا لا عقلا فإن العقل يدل عليه سبحانه إنه فَعَّالٌ لِما يُرِيدُ لا يقاس بالمخلوق ولا يقاس المخلوق عليه وإنما الأدلة الشرعية أتت بأمور تقرر عندنا منها إنه يعامل عباده بالإحسان وعلى قدر ظنهم به قال تعالى وبَدا لَهُمْ من الله ما لَمْ يَكُونُوا يَحْتَسِبُونَ في الطرفين للوازم قررها الشارع قال رسول الله صلى الله عليه وسلم في شأن النائم عن الصلاة إذا استيقظ أو الناسي إذا تذكر وقد خرج وقت الصلاة فيصليها هل يثبتها دائما في كل يوم في ذلك الوقت فلما سئل رسول الله صلى الله عليه وسلم عن ذلك‏\n\n\nقال رسول الله صلى الله عليه وسلم ما كان الله لينهاكم عن الربا ويأخذه منكم‏\n\n\nفبين أنه سبحانه ما يحمد خلقا من مكارم الأخلاق إلا والحق تعالى أولى به بأن يعامل به خلقه ولا يذم شيئا من سفساف الأخلاق إلا وكان الجناب الإلهي أبعد منه ففي مثل هذا الفن يسوغ الاستقراء بهذه الدلالات الشرعية وأما غير ذلك فلا يكون‏\n\n\n### [الاستقراء في التجليات‏]\n\n\nفقد أبنت لك صحة الاستقراء من سقمه في المعاملات وأما الاستقراء في التجليات فرأينا إن الهيولى الصناعية تقبل بعض الصور لا كلها فوجدنا الخشب يقبل صورة الكرسي والمنبر والتخت والباب ولم نره يقبل صورة القميص ولا الرداء ولا السراويل ورأينا الشقة تقبل ذلك ولا تقبل صورة السكين والسيف ثم رأينا الماء يقبل صورة لون الأوعية وما يتجلى فيها من المتلونات فيتصف بالزرقة والبياض والحمرة سئل الجنيد رحمه الله عن المعرفة والعارف فقال لون الماء لون إنائه ثم استقر أنا عالم الأركان كلها والأفلاك فوجدنا كل ركن منها وكل فلك يقبل صورا مخصوصة وبعضها أكثر قبولا من بعض ثم نظرنا في الهيولى الكل فوجدناها تقبل جميع صور الأجسام والأشكال فنظرنا في الأمور فرأيناها كلما لطفت قبلت الصور الكثيرة فنظرنا في الأرواح فوجدناها أقبل للتشكل في الصور من سائر ما ذكرناه ثم نظرنا في الخيال فوجدناه يقبل ما له صورة ويصور ما ليست له صورة فكان أوسع من الأرواح في التنوع في الصور ثم جئنا إلى الغيب في التجليات فوجدنا الأمر أوسع مما ذكرناه ورأيناه قد جعل ذلك أسماء كل اسم منها يقبل صورا لا نهاية لها في التجليات وعلمنا إن الحق وراء ذلك كله لا تُدْرِكُهُ الْأَبْصارُ وهُوَ يُدْرِكُ الْأَبْصارَ وهُوَ اللَّطِيفُ الْخَبِيرُ فجاء في عدم الإدراك بالاسم اللطيف إذ كانت اللطافة مما ينبو الحس عن إدراكها فتعقل ولا تشهد فتسمى في وصفه الذي تنزه أن يدرك فيه باللطيف الخبير أي تلطف عن إدراك المحدثات ومع هذا فإنه يعلم ويعقل أن ثم أمرا يستند إليه فأتى بالاسم الخبير على وزن فعيل وفعيل يرد بمعنى المفعول كقتيل بمعنى مقتول وجريح بمعنى مجروح وهو المراد هنا والأوجه وقد يرد بمعنى الفاعل كعليم بمعنى عالم وقد يكون أيضا هو المراد هنا ولكنه يبعد فإن دلالة مساق الآية لا تعطي ذلك فإن مساقها في إدراك الأبصار لا في إدراك البصائر فإن الله قد ندبنا إلى التوصل بالعلم به فقال فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله ولا يعلم حتى ننظر في الأدلة فيؤدينا النظر فيها إلى العلم به على قدر ما تعطينا القوة في ذلك فلهذا رجحنا خبير هنا بمعنى المفعول أي أن الله يعلم ويعقل ولا تُدْرِكُهُ الْأَبْصارُ\n\n\n### [الاستقراء لا يفيد العلم‏]\n\n\nفهذا القدر مما يتعلق بهذا الباب من الاستقراء وأما كونه لا يفيد العلم في هذا الموطن فإنه ما من أصل ذكرناه يقبل صورا ما إلا يجوز بل يقع وقد وقع أنه يتكرر في تلك الصور مراتب عديدة وهذا\n\n\nقد ورد في الأخبار أن جبريل عليه السلام نزل مرارا على صورة دحية الكلبي‏\n\n\nولما لم يصح عندنا في التجلي الإلهي أن يتكرر تجل إلهي لشخص واحد مرتين ولا يظهر في صورة واحدة لشخصين علمنا إن الاستقراء لا يفيد علما فإن جناب التجلي لا يقبل التكرار فخرج عن حكم الاستقراء من وجه عدم التكرار ولحق به من حيث التحول في الصور وقد ورد التحول في حديث مسلم في حديث الشفاعة من كتاب الايمان فلا يعول على الاستقراء في شي‏ء من الأشياء لا في الأحوال ولا في المقامات ولا في المنازل ولا في المنازلات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "(Chapter Fifty-Six) Concerning the Knowledge of Induction (الاستقراء) and its Validity from its Invalidity\n\n> Induction has a limit in meanings,\n> Which the strong among men adhere to.\n> It has a ruling, but grants you no certain knowledge (علما),\n> For its form is like the station of shadows.\n> A people therein contend with the proof (الدليل),\n> But where is the Eye (العين) compared to the person of the example (المثال)?\n> It is a contest of conjectures (الظنون), and indeed some of them\n> Grant you descent into baseness.\n> So do not judge by Induction definitively,\n> For the eye of the gazelle is not the gazelle itself.\n> And even if certain knowledges (علوم) appear through Induction,\n> The ruling of fullness (التضمر) is not like that of leanness (الهزال).\n\n### [When is Induction Valid?]\n\nMuslim recorded in his *Sahih* that Allah says: \"The angels interceded, the prophets interceded, and the believers interceded, and there remained the Most Merciful of the Merciful.\"\n\nThus, He, the Mighty and Majestic, named Himself the Most Merciful of the Merciful, and He said, <<إِنَّهُ خَيْرُ الْغافِرِينَ>> (Indeed, He is the Best of those who forgive). And He said in the *Sahih* Hadith: \"I am as My servant thinks of Me, so let him think good of Me.\"\n\nIf we apply Induction (الاستقراء) to Existence (الوجود), we find that noble and principled people (الكرام الأصول) only manifest noble character traits (مكارم الأخلاق), such as kindness to the benevolent, overlooking the faults of the wrongdoer, pardoning slips, excusing stumbles, accepting apologies, and forgiving the offender—and similar traits that constitute noble character. When we apply Induction to this, we find that it does not contradict the saying of the Arab poet:\n\n> Indeed, noble steeds run according to their lineage.\n\nThe Real (الحق) is more deserving of the Attribute of noble character traits than creatures (المخلوقين). It is here that the validity of Induction holds true in Divine matters (الإلهيات).\n\n### [When is Induction Invalid?]\n\nAs for the invalidity of Induction (سقم الاستقراء), it is not valid in matters of Creed (العقائد), for these are built upon clear proofs (الأدلة الواضحة). For example, if we were to induce that everyone who manifests a craft is a body, and then say that the World (العالم) is the craft and act of The Real (الحق), and since we have traced all craftsmen and found none but those with a body, then The Real must be a body—exalted is Allah far above that!\n\nWe also traced the proofs concerning created things (المحدثات) and found no one who is knowing (عالما) by his own essence (لنفسه). Rather, the proof dictates that no one can be knowing except through an attribute supplementary to his Essence (ذاته), which is called Knowledge (علما), and whose ruling is that whoever possesses it is knowing. Since we know that The Real is Knowing (عالم), it would necessarily follow that He must possess Knowledge, and that this Knowledge must be a supplementary attribute subsisting in Him. Absolutely not! Rather, He is Allah, the Knowing, the Living, the Powerful, the Dominant, the Aware (الخبير)—all of this is for His Essence (لنفسه), not by virtue of something supplementary to His Essence (ذاته). For if that were by virtue of something supplementary to Himself—and these are Attributes of Perfection (صفات كمال) without which the Essence cannot be perfect—then His perfection would depend on something supplementary to His Essence, and His Essence would be characterized by deficiency if this supplement did not subsist in Him.\n\nThis is a result of Induction (الاستقراء). This is what led the Scholastic Theologians (المتكلمين) to say concerning the Attributes of The Real: \"They are neither He nor other than He.\" In what we have mentioned, there is a type of Induction that is unfitting for the Exalted Presence (الجناب العالي).\n\nThen, when those who affirm the supplementary attributes sensed this difficulty, they adopted another path in expressing it. They said: \"We did not conceive this through Induction. Rather, we said that the proof dictates that no one can be knowing except one in whom Knowledge subsists, and it must be something supplementary to the essence of the knower, because it is one of the Attributes of Meaning (صفات المعاني) whose removal can be conceived while the Essence remains.\" Since the proof dictated this, we applied it universally to the witnessed and the unseen—meaning, to The Real and to creation (الخلق). This is an evasion on their part and a deviation from the core of correctness (عين الصواب).\n\nFurthermore, they reinforced this by their statement, which we mentioned, that His Attributes are neither He nor other than He. They defined the two \"others\" (الغيرين) with a definition that others reject. Yet, if you ask them whether the Attributes are a supplementary matter, they admit that they are a supplementary matter. This is precisely Induction (عين الاستقراء).\n\n### [Allah is not measured by the creature, and the creature is not measured by Allah]\n\nFor this reason, we said that Induction (الاستقراء) concerning the Knowledge (العلم) of Allah is invalid, and that Induction, in reality, does not yield certain knowledge (علما). We only affirmed it in the case of noble character traits (مكارم الأخلاق) based on revealed law (شرعا) and custom (عرفا), not based on intellect (عقلا). For the intellect indicates that He, the Glorified, is <<فَعَّالٌ لِما يُرِيدُ>> (Doer of what He wills). He is not measured by the creature (المخلوق), nor is the creature measured by Him.\n\nRather, the legal proofs (الأدلة الشرعية) brought forth matters that establish for us that He deals with His servants with kindness (الإحسان) and according to their expectation of Him. Allah the Exalted said, <<وَبَدا لَهُمْ مِنَ اللهِ ما لَمْ يَكُونُوا يَحْتَسِبُونَ>> (And there appeared to them from Allah that which they had not been expecting)—this applies to both parties, due to the necessary consequences established by the Lawgiver (الشارع).\n\nThe Messenger of Allah, peace and blessings be upon him, concerning the one who sleeps through the prayer or forgets it and remembers after the time has passed, said that he should pray it. Does this establish that he must always perform it at that time every day? When the Messenger of Allah, peace and blessings be upon him, was asked about this, he said: \"Allah would not forbid you from usury (الربا) and then take it from you.\"\n\nHe thus clarified that the Glorified One does not praise any noble character trait (مكارم الأخلاق) in creation unless The Real (الحق) is more deserving of manifesting it in His dealings with His creation, and He does not condemn any base character trait (سفساف الأخلاق) unless the Divine Presence (الجناب الإلهي) is further removed from it. It is in this type of category that Induction is permissible, based on these legal indications (الدلالات الشرعية). Otherwise, it is not.\n\n### [Induction in Theophanies]\n\nI have thus clarified for you the validity of Induction (الاستقراء) from its invalidity in matters of dealings (المعاملات). As for Induction concerning Theophanies (التجليات): We observe that industrial matter (الهيولى الصناعية) accepts some forms but not all. We find that wood accepts the form of a chair, a pulpit, a bed, and a door, but we do not see it accept the form of a shirt, a cloak, or trousers. We see that cloth accepts the latter forms but does not accept the form of a knife or a sword.\n\nThen we see that water accepts the color of its containers and whatever colored things are manifested within it, thus taking on blueness, whiteness, or redness. Al-Junayd, may Allah have mercy on him, was asked about Gnosis (المعرفة) and the Gnostic (العارف), and he replied: \"The color of the water is the color of its vessel.\"\n\nThen we applied Induction to the entire world of elements (عالم الأركان) and the celestial spheres (الأفلاك), and we found that every element and every sphere accepts specific forms, and some are more receptive than others. Then we looked at the Universal Matter (الهيولى الكل) and found that it accepts all forms of bodies and shapes. We examined the matters and saw that the more subtle they were, the more numerous the forms they accepted. We looked at the Spirits (الأرواح) and found them more receptive to taking shape in forms than all the things we mentioned. Then we looked at Imagination (الخيال) and found that it accepts what has a form and gives form to what has no form, making it broader than the Spirits in the variety of forms it can hold.\n\nThen we came to the Unseen (الغيب) in Theophanies (التجليات), and we found the matter broader than what we have mentioned. We saw that He has made this into Names (أسماء), each Name accepting infinite forms in the Theophanies. We know that The Real (الحق) is beyond all of that: <<لَا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يُدْرِكُ الْأَبْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ>> (Vision comprehends Him not, but He comprehends [all] vision; and He is the Subtle, the All-Aware).\n\nThe denial of comprehension (عدم الإدراك) came with the Name *al-Latif* (the Subtle), since subtlety is something that the senses fail to grasp; it is conceived intellectually but not witnessed. Thus, in describing Him in the aspect where He is transcendent from being comprehended, He is named *al-Latif al-Khabir* (the Subtle, the All-Aware). That is, He is too subtle for the comprehension of created things (المحدثات), yet despite this, He is known and conceived intellectually that there is a reality (أمرا) upon which things depend. Thus, the Name *al-Khabir* (the All-Aware) is used, which is on the pattern of *fa'il*. The pattern *fa'il* can sometimes mean the passive participle (*maf'ul*), such as *qatil* (قتيل) meaning \"slain\" (*maqtul*), and *jarih* (جريح) meaning \"wounded\" (*majruh*). This is the intended and most appropriate meaning here. It can also mean the active participle (*fa'il*), such as *alim* (عليم) meaning \"knowing\" (*alim*). This meaning could also be intended here, but it is less likely, as the context of the verse does not support it, for its context is about the comprehension of physical sight (إدراك الأبصار), not the comprehension of inner sight (البصائر). For Allah has urged us to attain knowledge of Him, saying, <<فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ>> (So know that there is no deity except Allah). And one does not know until one examines the proofs (الأدلة), and the examination of these proofs leads us to the knowledge of Him according to the capacity granted to us. For this reason, we preferred *Khabir* here in the passive sense (meaning the object of knowledge), meaning that Allah is known and conceived intellectually, but <<لَا تُدْرِكُهُ الْأَبْصَارُ>> (Vision comprehends Him not).\n\n### [Induction does not yield Knowledge]\n\nThis is the extent of what relates to Induction (الاستقراء) in this chapter. As for the fact that it does not yield certain knowledge (علما) in this domain: there is no principle we mentioned that accepts forms (صورا) without it being permissible—indeed, it occurs and has occurred—that the repetition of those forms takes place across numerous levels (مراتب عديدة). This has been reported in the narrations: that Gabriel, peace be upon him, descended repeatedly in the form of Dihya al-Kalbi.\n\nHowever, since it is not established for us concerning the Divine Theophany (التجلي الإلهي) that a Divine Self-disclosure repeats itself twice for the same person, nor that it appears in the same form to two different people, we know that Induction does not yield certain knowledge (علما). For the Presence of Theophany (جناب التجلي) does not accept repetition. Thus, it falls outside the ruling of Induction from the perspective of non-repetition, though it aligns with it from the perspective of transformation into forms (التحول في الصور). Transformation has been reported in the Hadith of Muslim concerning intercession (الشفاعة) in the Book of Faith.\n\nTherefore, Induction should not be relied upon in any matter whatsoever, neither in spiritual states (الأحوال), nor in spiritual stations (المقامات), nor in spiritual descents (المنازل), nor in spiritual contests (المنازلات). And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and and He guides to the Way).",
    "ur": "**(الباب چھپنواں) استقراء (Inductive Reasoning) کی معرفت اور اس کی صحت و سقم کے بیان میں**\n\nاستقراء (Inductive Reasoning) کے لیے معانی میں ایک حد مقرر ہے،\nجس کی پابندی قوی مرد کرتے ہیں۔\nاس کا ایک حکم ہے لیکن یہ تمہیں علم نہیں دیتا،\nپس اس کی صورت سایوں کے مقام کی مانند ہے۔\nاس میں دلیل کے ساتھ ایک قوم کی مزاحمت ہے،\nاور آنکھ مثال کے شخص سے کہاں ہے؟\nیہ گمانوں سے لڑنا ہے، اور ان میں سے کچھ تمہیں پستی کی طرف لے جانے والے ہیں۔\nلہٰذا استقراء (Inductive Reasoning) سے قطعی حکم نہ لگاؤ،\nکیونکہ ہرن کی آنکھ ہرن کی طرح نہیں ہوتی۔\nاور اگرچہ استقراء (Inductive Reasoning) سے علوم ظاہر ہوتے ہیں،\nلیکن پوشیدہ کا حکم کمزوری کے حکم جیسا نہیں ہے۔\n\n### [استقراء کب صحیح ہوتا ہے]\n\nامام مسلم نے اپنی صحیح میں روایت کیا ہے کہ اللہ تعالیٰ فرماتا ہے: \"فرشتوں نے شفاعت کی، اور نبیوں نے شفاعت کی، اور مومنوں نے شفاعت کی، اور اب ارحم الراحمین (سب سے زیادہ رحم کرنے والا) باقی ہے۔\"\n\nپس اس (الحق) نے اپنے آپ کو \"ارحم الراحمین\" (سب سے زیادہ رحم کرنے والا) نام دیا، اور فرمایا: **إنه خَيْرُ الْغافِرِينَ** (بے شک وہ بہترین بخشنے والا ہے)۔ اور صحیح حدیث میں فرمایا: \"میں اپنے بندے کے گمان کے مطابق ہوتا ہوں، پس اسے چاہیے کہ مجھ سے اچھا گمان رکھے۔\"\n\nپس جب ہم ہستی (الوجود) کا استقراء (Inductive Reasoning) کرتے ہیں تو دیکھتے ہیں کہ شریف الاصل لوگوں سے صرف مکارم اخلاق (Noble Character) ہی صادر ہوتے ہیں، جیسے نیکوکار کے ساتھ احسان، برائی کرنے والے سے درگزر، لغزش سے معافی، ٹھوکر سے اٹھانا، معذرت قبول کرنا، اور مجرم سے چشم پوشی کرنا، اور اس جیسی دیگر چیزیں جو مکارم اخلاق میں شامل ہیں۔ اور جب ہم نے اس کا استقراء کیا تو ہم نے پایا کہ عرب شاعر کا یہ قول غلط نہیں ہے:\n\n\"بے شک عمدہ گھوڑے اپنی نسلوں پر دوڑتے ہیں۔\"\n\nاور ذات حق (الحق) مخلوقات کی نسبت مکارم اخلاق (Noble Character) کی صفت کا زیادہ حقدار ہے۔ پس یہاں الٰہیات میں استقراء (Inductive Reasoning) کی صحت ہوتی ہے۔\n\n### [استقراء کب سقیم (ناقص) ہوتا ہے]\n\nاور جہاں تک استقراء (Inductive Reasoning) کے سقم (Invalidity) کا تعلق ہے، تو یہ عقائد میں صحیح نہیں ہے، کیونکہ عقائد کی بنیاد واضح دلائل پر ہے۔ اگر ہم ہر اس چیز کا استقراء کریں جس سے کوئی صنعت ظاہر ہوئی ہو، تو ہم اسے جسم پائیں گے۔ اور ہم کہتے ہیں کہ عالم ذات حق (الحق) کی صنعت اور فعل ہے۔ اور ہم نے کاریگروں کا تتبع کیا تو ہم نے کسی کاریگر کو جسم والا ہونے کے علاوہ نہیں پایا۔ (پس ہم نتیجہ نکالیں گے کہ) ذات حق (الحق) جسم ہے! اللہ تعالیٰ اس سے بہت بلند و برتر ہے۔\n\nاور ہم نے محدثات (نئی پیدا ہونے والی چیزوں) میں دلائل کا تتبع کیا تو ہم نے کسی کو بھی بذات خود عالم نہیں پایا۔ بلکہ دلیل یہ بتاتی ہے کہ کوئی بھی عالم نہیں ہو سکتا مگر اپنی ذات پر ایک زائد صفت کے ساتھ جسے علم کہا جاتا ہے، اور اس کا حکم یہ ہے کہ جس میں وہ قائم ہو وہ عالم ہو۔ اور ہم جانتے ہیں کہ ذات حق (الحق) عالم ہے، لہٰذا ضروری ہے کہ اس کے لیے علم ہو اور وہ علم اس کی ذات پر ایک زائد صفت ہو جو اس کے ساتھ قائم ہو۔ ہرگز نہیں! بلکہ وہ اللہ ہے، عالم، حی، قادر، قاہر، خبیر۔ یہ سب کچھ اس کے لیے بذات خود ہے، نہ کہ اس کی ذات پر کسی زائد امر کے ذریعے۔ کیونکہ اگر یہ اس کی ذات پر کسی زائد امر کے ذریعے ہوتا، اور یہ صفاتِ کمال ہیں جن کے بغیر ذات کا کمال نہیں ہو سکتا، تو اس کا کمال اس کی ذات پر زائد چیز کے ذریعے ہو گا، اور اگر یہ زائد چیز اس کے ساتھ قائم نہ ہو تو اس کی ذات نقص سے متصف ہو جائے گی۔ یہ استقراء (Inductive Reasoning) کا نتیجہ ہے۔ اور یہی وہ چیز ہے جس نے متکلمین کو یہ کہنے پر مجبور کیا کہ ذات حق (الحق) کی صفات نہ وہ خود ہیں اور نہ ہی اس کے غیر ہیں۔\n\nاور جو کچھ ہم نے ذکر کیا ہے، اس میں استقراء (Inductive Reasoning) کی ایک قسم ہے جو جنابِ عالی (ذات حق) کے شایانِ شان نہیں ہے۔ پھر جب زائد کے قائلین نے اس کا احساس کیا تو انہوں نے اس کی تعبیر میں ایک دوسرا راستہ اختیار کیا اور کہا: \"ہم نے اسے استقراء (Inductive Reasoning) سے نہیں سمجھا، بلکہ ہم نے کہا کہ دلیل یہ بتاتی ہے کہ کوئی بھی عالم نہیں ہو سکتا مگر وہ جس کے ساتھ علم قائم ہو، اور ضروری ہے کہ وہ عالم کی ذات پر ایک زائد امر ہو، کیونکہ یہ صفاتِ معانی میں سے ہے جسے ذات کے باقی رہنے کے باوجود اٹھایا جا سکتا ہے۔\" پس جب دلیل نے یہ دیا تو ہم نے اسے حاضر اور غائب دونوں پر جاری کر دیا، یعنی ذات حق (الحق) اور مخلوق پر۔ اور یہ ان کی طرف سے فرار اور عین صواب سے انحراف ہے۔\n\nپھر انہوں نے اس بات کی تائید اپنے اس قول سے کی جو ہم نے ان سے نقل کیا ہے کہ اس کی صفات نہ وہ خود ہیں اور نہ ہی اس کے غیر ہیں۔ اور انہوں نے دو غیروں کی تعریف ایسی حد سے کی جسے ان کے علاوہ دوسرے لوگ منع کرتے ہیں۔ اور جب آپ ان سے پوچھتے ہیں کہ کیا یہ زائد امر ہے؟ تو وہ اعتراف کرتے ہیں کہ یہ زائد امر ہے، اور یہی عین استقراء (Inductive Reasoning) ہے۔\n\n### [اللہ کو مخلوق پر قیاس نہیں کیا جاتا اور مخلوق کو اللہ پر قیاس نہیں کیا جاتا]\n\nاسی لیے ہم نے کہا کہ اللہ کے علم میں استقراء (Inductive Reasoning) صحیح نہیں ہے، اور حقیقت میں استقراء (Inductive Reasoning) علم نہیں دیتا۔ ہم نے اسے صرف مکارم اخلاق (Noble Character) میں شرعاً اور عرفاً ثابت کیا ہے، عقلاً نہیں۔ کیونکہ عقل اس (الحق) پر دلالت کرتی ہے کہ وہ **فَعَّالٌ لِما يُرِيدُ** (جو چاہتا ہے وہ کرنے والا ہے)، اسے مخلوق پر قیاس نہیں کیا جاتا اور نہ ہی مخلوق کو اس پر قیاس کیا جاتا ہے۔\n\nبلکہ شرعی دلائل ایسی چیزیں لائے ہیں جو ہمارے نزدیک یہ بات ثابت کرتی ہیں کہ وہ اپنے بندوں کے ساتھ احسان کا معاملہ کرتا ہے اور ان کے اس کے بارے میں گمان کے مطابق۔ اللہ تعالیٰ نے فرمایا: **وبَدا لَهُمْ من الله ما لَمْ يَكُونُوا يَحْتَسِبُونَ** (اور ان کے لیے اللہ کی طرف سے وہ ظاہر ہوا جس کا وہ گمان بھی نہیں کرتے تھے)۔ یہ دونوں فریقوں (نیک و بد) کے لیے ان لوازمات کے سبب ہے جنہیں شارع نے مقرر کیا ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے اس شخص کے بارے میں فرمایا جو نماز سے سو جائے اور بیدار ہو یا بھول جائے اور یاد کرے، جبکہ نماز کا وقت نکل چکا ہو، تو وہ اسے ادا کرے۔ (سوال یہ تھا) کیا وہ اسے ہمیشہ ہر روز اسی وقت میں ثابت کرے گا؟ جب رسول اللہ صلی اللہ علیہ وسلم سے اس بارے میں پوچھا گیا،\nتو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اللہ ایسا نہیں ہے کہ تمہیں سود سے منع کرے اور پھر تم سے سود لے۔\"\n\nپس آپ صلی اللہ علیہ وسلم نے واضح فرمایا کہ وہ (سبحانہ و تعالیٰ) مکارم اخلاق (Noble Character) میں سے کسی بھی خصلت کی تعریف نہیں کرتا مگر یہ کہ ذات حق (الحق) اس کی زیادہ حقدار ہے کہ وہ اس کے ذریعے اپنی مخلوق سے معاملہ کرے، اور وہ رذیل اخلاق میں سے کسی چیز کی مذمت نہیں کرتا مگر یہ کہ جنابِ الٰہی اس سے بہت دور ہے۔ پس اس طرح کے فن میں ان شرعی دلائل کے ساتھ استقراء (Inductive Reasoning) جائز ہے، لیکن اس کے علاوہ نہیں۔\n\n### [تجلیات (التجلی) میں استقراء]\n\nمیں نے تمہارے لیے معاملات میں استقراء (Inductive Reasoning) کی صحت اور سقم (Invalidity) واضح کر دی ہے۔ اور جہاں تک تجلیات (التجلی) میں استقراء (Inductive Reasoning) کا تعلق ہے، تو ہم نے دیکھا کہ صنعتی ہیولیٰ (مادہ) بعض صورتوں کو قبول کرتا ہے، سب کو نہیں۔ چنانچہ ہم نے پایا کہ لکڑی کرسی، منبر، تخت اور دروازے کی صورت قبول کرتی ہے، لیکن ہم نے اسے قمیص، چادر یا شلوار کی صورت قبول کرتے ہوئے نہیں دیکھا۔ اور ہم نے دیکھا کہ کپڑا ان صورتوں کو قبول کرتا ہے لیکن چاقو اور تلوار کی صورت قبول نہیں کرتا۔\n\nپھر ہم نے دیکھا کہ پانی برتنوں کے رنگ کی صورت قبول کرتا ہے اور ان رنگین چیزوں کی جو اس میں ظاہر ہوتی ہیں، چنانچہ وہ نیلا، سفید اور سرخ ہو جاتا ہے۔ جنید رحمۃ اللہ علیہ سے معرفت (المعرفۃ) اور عارف کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"پانی کا رنگ اس کے برتن کا رنگ ہوتا ہے۔\"\n\nپھر ہم نے تمام ارکانِ عالم اور افلاک کا استقراء (Inductive Reasoning) کیا تو ہم نے پایا کہ ان میں سے ہر رکن اور ہر فلک مخصوص صورتوں کو قبول کرتا ہے، اور بعض دوسروں کی نسبت زیادہ قبول کرنے والے ہوتے ہیں۔ پھر ہم نے ہیولیٰ کل (Universal Matter) پر غور کیا تو ہم نے پایا کہ وہ تمام اجسام اور اشکال کی صورتوں کو قبول کرتی ہے۔ پھر ہم نے امور پر غور کیا تو ہم نے دیکھا کہ وہ جتنے لطیف ہوتے جاتے ہیں، اتنی ہی زیادہ صورتوں کو قبول کرتے ہیں۔ پھر ہم نے ارواح پر غور کیا تو ہم نے پایا کہ وہ مذکورہ بالا تمام چیزوں کی نسبت صورتوں میں ڈھلنے کے لیے زیادہ قبول کرنے والی ہیں۔\n\nپھر ہم نے خیال پر غور کیا تو ہم نے پایا کہ وہ اس چیز کو قبول کرتا ہے جس کی صورت ہو، اور اس چیز کو بھی صورت دیتا ہے جس کی صورت نہ ہو۔ پس وہ صورتوں میں تنوع کے لحاظ سے ارواح سے بھی زیادہ وسیع تھا۔ پھر جب ہم تجلیات (التجلی) میں غیب کی طرف آئے تو ہم نے پایا کہ معاملہ اس سے بھی زیادہ وسیع ہے جو ہم نے ذکر کیا ہے۔ اور ہم نے دیکھا کہ اس (الحق) نے اس کے لیے اسماء مقرر کیے ہیں، جن میں سے ہر اسم تجلیات (التجلی) میں لامتناہی صورتوں کو قبول کرتا ہے۔\n\nاور ہم نے جانا کہ ذات حق (الحق) ان سب کے پیچھے ہے: **لا تُدْرِكُهُ الْأَبْصارُ وهُوَ يُدْرِكُ الْأَبْصارَ وهُوَ اللَّطِيفُ الْخَبِيرُ** (نگاہیں اسے نہیں پا سکتیں اور وہ نگاہوں کو پا لیتا ہے، اور وہ لطیف (نازک بین) اور خبیر (باخبر) ہے)۔\n\nپس عدمِ ادراک کے بیان میں اسم لطیف (اللطیف) لایا گیا، کیونکہ لطافت ایسی چیز ہے جسے حواس ادراک کرنے سے قاصر رہتے ہیں، لہٰذا اسے عقل سے سمجھا جاتا ہے لیکن شہود (الشہود) نہیں کیا جاتا۔ پس اس کی اس صفت میں، جس میں وہ ادراک کیے جانے سے پاک ہے، اسے لطیف (اللطیف) خبیر (الخبیر) کہا گیا ہے۔ یعنی وہ محدثات (پیدا کی گئی چیزوں) کے ادراک سے لطیف (نازک) ہے، اس کے باوجود وہ جانتا اور سمجھتا ہے کہ وہاں ایک امر ہے جس پر وہ بھروسہ کرتا ہے۔ پس اسم خبیر (الخبیر) کو وزنِ فعیل پر لایا گیا ہے۔ اور فعیل کبھی مفعول کے معنی میں آتا ہے، جیسے قتیل (مقتول کے معنی میں) اور جریح (مجروح کے معنی میں)، اور یہاں یہی مراد ہے اور زیادہ مناسب ہے۔ اور کبھی یہ فاعل کے معنی میں بھی آتا ہے، جیسے علیم (عالم کے معنی میں)، اور یہ بھی یہاں مراد ہو سکتا ہے، لیکن یہ بعید ہے، کیونکہ آیت کا سیاق اس پر دلالت نہیں کرتا۔ اس کا سیاق ابصار (آنکھوں) کے ادراک کے بارے میں ہے نہ کہ بصائر (باطنی بصیرتوں) کے ادراک کے بارے میں۔ کیونکہ اللہ نے ہمیں اس کے علم تک پہنچنے کی ترغیب دی ہے، چنانچہ فرمایا: **فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله** (پس جان لو کہ اللہ کے سوا کوئی معبود نہیں)۔ اور علم حاصل نہیں ہوتا جب تک کہ ہم دلائل میں غور نہ کریں، اور ان میں غور کرنا ہمیں اس کے علم تک پہنچاتا ہے، اس حد تک جو ہماری قوت ہمیں دیتی ہے۔ اسی لیے ہم نے یہاں خبیر (الخبیر) کو مفعول کے معنی میں ترجیح دی ہے، یعنی اللہ کو جانا اور سمجھا جاتا ہے، لیکن **لا تُدْرِكُهُ الْأَبْصارُ** (نگاہیں اسے نہیں پا سکتیں)۔\n\n### [استقراء علم نہیں دیتا]\n\nیہ وہ مقدار ہے جو اس باب میں استقراء (Inductive Reasoning) سے متعلق ہے۔ اور جہاں تک اس بات کا تعلق ہے کہ یہ اس مقام پر علم نہیں دیتا، تو ہم نے جو بھی اصل ذکر کی ہے جو کچھ صورتوں کو قبول کرتی ہے، تو یہ جائز ہے، بلکہ واقع ہوتا ہے، اور یہ واقع ہو چکا ہے کہ ان صورتوں میں کئی مراتب تکرار ہوتے ہیں۔ اور یہ بات\nاحادیث میں وارد ہوئی ہے کہ جبرائیل علیہ السلام کئی بار دحیہ کلبی کی صورت میں نازل ہوئے۔\n\nاور چونکہ ہمارے نزدیک تجلی الٰہی (التجلی) میں یہ صحیح نہیں ہے کہ ایک ہی شخص کے لیے دو بار ایک ہی تجلی الٰہی (التجلی) کا تکرار ہو، اور نہ ہی ایک ہی صورت میں دو اشخاص کے لیے ظاہر ہو، اس لیے ہم نے جانا کہ استقراء (Inductive Reasoning) علم نہیں دیتا۔ کیونکہ جنابِ تجلی (التجلی) تکرار کو قبول نہیں کرتا۔ پس یہ عدمِ تکرار کے پہلو سے استقراء (Inductive Reasoning) کے حکم سے خارج ہو گیا، اور صورتوں میں تحول (تبدیلی) کے لحاظ سے اس کے ساتھ شامل ہو گیا۔ اور تحول (تبدیلی) مسلم کی حدیثِ شفاعت میں کتاب الایمان میں وارد ہوا ہے۔ لہٰذا کسی بھی چیز میں استقراء (Inductive Reasoning) پر بھروسہ نہیں کیا جائے گا، نہ احوال میں، نہ مقامات میں، نہ منازل میں اور نہ ہی منازلات میں۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "## باب پنجاه و ششم: در معرفت استقراء (استدلال استقرایی) و صحت آن از سقمش (نادرستی‌اش)\n\nاستقراء را در معانی حدی است *** که مردان قوی بدان پایبندند.\n\nحکمی دارد، اما به تو علم نمی‌دهد *** پس صورت آن مانند جایگاه سایه‌هاست.\n\nدر آن، دلیل با گروهی در رقابت است *** و چشم کجا و شخص مثال (نمونه) کجا؟\n\nنبرد با گمان‌هاست، و اگرچه از آن است *** که تو را به پستی و فرود می‌کشاند.\n\nپس هرگز به استقراء حکم قطعی مده *** که چشم آهو مانند خود آهو نیست.\n\nو اگرچه علومی با استقراء ظاهر شوند *** حکم پنهان (ضمیر) مانند لاغری (هزال) نیست.\n\n### [چه زمانی استقراء صحیح است]\n\nمسلم در صحیح خود آورده است که خداوند می‌فرماید: «ملائکه شفاعت کردند، و پیامبران شفاعت کردند، و مؤمنان شفاعت کردند، و [در نهایت] ارحم الراحمین باقی ماند.»\n\nپس خود را عز و جل ارحم الراحمین نامید و فرمود: «او بهترین آمرزندگان است» (خَيْرُ الْغافِرِينَ) و در حدیث صحیح فرمود: «من نزد گمان بنده‌ام به خود هستم، پس باید به من گمان نیک برد.»\n\nپس اگر هستی (الوجود) را استقراء کنیم، [می‌یابیم] که از کریمان اصیل جز اخلاق نیکو صادر نمی‌شود؛ از احسان به نیکوکار و گذشت از بدکار و عفو از لغزش و نادیده گرفتن خطا و پذیرش عذر و چشم‌پوشی از جانی و امثال این‌ها که از مکارم اخلاق است. و این را استقراء کردیم و یافتیم که خطایی ندارد، به قول شاعر عرب در این باره:\n\n«اسبان اصیل بر اساس نژاد خود می‌دوند.»\n\nو حق (الحق) به صفت مکارم اخلاق از مخلوقات سزاوارتر است. پس در اینجا صحت استقراء در الهیات محقق می‌شود.\n\n### [چه زمانی استقراء نادرست است]\n\nاما نادرستی استقراء (سقم الاستقراء) در عقاید صحیح نیست، زیرا مبنای عقاید بر ادله واضح است. زیرا اگر استقراء کنیم هر کس که از او صنعتی ظاهر شده، او را جسم می‌یابیم، و می‌گوییم عالم ساخته و فعل حق (الحق) است، و ما صنعتگران را دنبال کردیم و هیچ صنعتگری را جز صاحب جسم نیافتیم، پس حق (الحق) جسم است. خداوند از این [نسبت] بسیار برتر است.\n\nو ادله را در موجودات حادث (محدثات) دنبال کردیم و عالمی را نیافتیم که علمش برای ذاتش باشد، بلکه دلیل نشان می‌دهد که عالم نیست مگر به صفتی زائد بر ذاتش که علم نامیده می‌شود و حکم آن در کسی که به آن قائم است، این است که عالم باشد. و ما می‌دانیم که حق (الحق) عالم است، پس ناگزیر باید علم داشته باشد و آن علم صفتی زائد بر ذاتش باشد که به او قائم است. هرگز! بلکه او الله است، عالم، زنده، قادر، قاهر، خبیر؛ همه این‌ها برای ذات اوست، نه به امری زائد بر ذاتش. زیرا اگر این [صفات کمال] به امری زائد بر ذاتش بود، و کمال ذات جز با آن‌ها حاصل نمی‌شد، پس کمال او به چیزی زائد بر ذاتش می‌بود و ذاتش در صورت نبود این امر زائد، متصف به نقص می‌شد.\n\nاین از [نتایج نادرست] استقراء است، و همین امر متکلمین را بر آن داشت که در مورد صفات حق (الحق) بگویند: «نه عین اوست و نه غیر او.» و در آنچه ذکر کردیم، نوعی از استقراء وجود دارد که شایسته جناب عالی نیست.\n\nسپس چون قائلان به امر زائد این [اشکال] را احساس کردند، در بیان آن راه دیگری در پیش گرفتند و گفتند: ما آن را با استقراء درنیافتیم، بلکه گفتیم دلیل نشان می‌دهد که عالم نیست مگر کسی که علم به او قائم باشد و باید امری زائد بر ذات عالم باشد، زیرا از صفات معانی است که می‌توان رفع آن را با بقای ذات تصور کرد. چون دلیل این را نشان داد، ما آن را در شاهد و غایب (یعنی در حق و خلق) جاری ساختیم. و این فرار آن‌ها و عدول از عین صواب است.\n\nسپس آن‌ها این [عقیده] را با گفته‌ای که از آن‌ها ذکر کردیم تأکید کردند که صفات او نه عین اوست و نه غیر او، و دو غیر را با حدی تعریف کردند که دیگران آن را منع می‌کنند. و اگر از آن‌ها بپرسی آیا صفات امر زائد هستند، اعتراف می‌کنند که امر زائد هستند، و این عین استقراء است.\n\n### [خداوند با مخلوق قیاس نمی‌شود و مخلوق بر خداوند قیاس نمی‌شود]\n\nبه همین دلیل گفتیم که استقراء در علم به خداوند صحیح نیست و استقراء در حقیقت علم‌آور نیست. بلکه ما آن را در مکارم اخلاق، از نظر شرع و عرف، نه عقل، اثبات کردیم. زیرا عقل بر این دلالت می‌کند که او سبحانه «هر چه بخواهد انجام می‌دهد» (فَعَّالٌ لِما يُرِيدُ)، نه با مخلوق قیاس می‌شود و نه مخلوق بر او قیاس می‌شود.\n\nبلکه ادله شرعی اموری را آوردند که نزد ما مقرر می‌دارد که او با بندگانش به احسان و به اندازه گمانشان به او رفتار می‌کند. خداوند متعال می‌فرماید: «و از جانب خداوند برایشان چیزی آشکار شد که هرگز گمان نمی‌کردند» (وَبَدا لَهُمْ مِنَ اللَّهِ ما لَمْ يَكُونُوا يَحْتَسِبُونَ) در هر دو طرف [نیک و بد]، به دلیل لوازمی که شارع مقرر کرده است.\n\nرسول خدا (صلی الله علیه و سلم) در مورد کسی که از نماز خواب مانده و بیدار می‌شود یا کسی که فراموش کرده و به یاد می‌آورد، در حالی که وقت نماز گذشته است، و آن را می‌خواند، فرمود: آیا باید آن را همیشه در هر روز در آن وقت ثابت کند؟ هنگامی که از رسول خدا (صلی الله علیه و سلم) در این باره سؤال شد،\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «خداوند چنین نیست که شما را از ربا نهی کند و خود آن را از شما بگیرد.»\n\nپس بیان کرد که او سبحانه هیچ خصلتی از مکارم اخلاق را نمی‌ستاید، مگر اینکه حق تعالی (الحق تعالی) سزاوارتر است که با آن با خلق خود رفتار کند، و هیچ چیز از اخلاق پست (سفساف الأخلاق) را مذمت نمی‌کند، مگر اینکه جناب الهی از آن دورتر است. پس در چنین فنی است که استقراء با این دلالات شرعی جایز است، اما در غیر این صورت جایز نیست.\n\n### [استقراء در تجلیات]\n\nمن صحت استقراء را از نادرستی آن در معاملات برای تو روشن ساختم. اما استقراء در تجلیات (التجلیات): ما دیدیم که هیولای صنعتی (ماده اولیه ساختنی) برخی صورت‌ها را می‌پذیرد نه همه آن‌ها را. چنان دیدیم که چوب صورت صندلی، منبر، تخت و در را می‌پذیرد، اما ندیدیم که صورت پیراهن، ردا یا شلوار را بپذیرد. و دیدیم که پارچه آن صورت‌ها را می‌پذیرد، اما صورت چاقو و شمشیر را نمی‌پذیرد.\n\nسپس دیدیم که آب صورت رنگ ظرف‌ها و آنچه از رنگ‌ها در آن تجلی می‌کند را می‌پذیرد و به کبودی، سفیدی و سرخی متصف می‌شود. از جنید (رحمه الله) درباره معرفت (المعرفة) و عارف سؤال شد، فرمود: «رنگ آب، رنگ ظرف آن است.»\n\nسپس عالم ارکان و افلاک را استقراء کردیم و یافتیم که هر رکن و هر فلکی صورت‌های مخصوصی را می‌پذیرد و برخی از آن‌ها پذیرش بیشتری نسبت به دیگری دارند. سپس در هیولای کل (الهيولى الكل) نظر کردیم و آن را پذیرای همه صورت‌های اجسام و اشکال یافتیم. پس در امور نظر کردیم و دیدیم هر چه لطیف‌تر باشند، صورت‌های بیشتری را می‌پذیرند.\n\nپس در ارواح نظر کردیم و آن‌ها را در شکل‌پذیری در صورت‌ها، پذیراتر از سایر آنچه ذکر کردیم، یافتیم. سپس در خیال نظر کردیم و آن را پذیرای آنچه صورت دارد و صورت‌دهنده آنچه صورت ندارد، یافتیم. پس در تنوع صورت‌ها از ارواح وسیع‌تر بود.\n\nسپس به غیب در تجلیات (التجلیات) آمدیم و امر را وسیع‌تر از آنچه ذکر کردیم یافتیم و دیدیم که خداوند آن را اسم‌هایی قرار داده است که هر اسمی از آن‌ها صورت‌های بی‌نهایتی را در تجلیات (التجلیات) می‌پذیرد. و دانستیم که حق (الحق) ورای همه این‌هاست: «چشم‌ها او را در نمی‌یابند و او چشم‌ها را در می‌یابد و او لطیف خبیر است.» (لا تُدْرِكُهُ الْأَبْصارُ وهُوَ يُدْرِكُ الْأَبْصارَ وهُوَ اللَّطِيفُ الْخَبِيرُ).\n\nپس در عدم ادراک، اسم لطیف (اللطيف) آمد، زیرا لطافت چیزی است که حس از درک آن عاجز است، پس تعقل می‌شود اما شهود نمی‌گردد. پس در وصفی که منزه از ادراک است، به لطیف خبیر (اللطيف الخبير) نامیده شد؛ یعنی از ادراک موجودات حادث (محدثات) لطیف‌تر است، با این حال، دانسته و تعقل می‌شود که امری وجود دارد که [موجودات] به آن استناد می‌کنند. پس اسم خبیر (الخبير) را بر وزن فعیل آورد. و وزن فعیل به معنای مفعول می‌آید، مانند قتیل به معنای مقتول و جریح به معنای مجروح، و این در اینجا مراد و ارجح است. و گاهی نیز به معنای فاعل می‌آید، مانند علیم به معنای عالم، و ممکن است این نیز در اینجا مراد باشد، اما بعید است، زیرا دلالت سیاق آیه آن را نمی‌دهد. زیرا سیاق آیه در مورد ادراک چشم‌هاست نه ادراک بصیرت‌ها. خداوند ما را به دستیابی به علم به او ترغیب کرده و فرموده است: «پس بدان که هیچ معبودی جز الله نیست» (فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله). و علم حاصل نمی‌شود مگر اینکه در ادله نظر کنیم، و نظر در آن‌ها ما را به علم به او می‌رساند، به اندازه‌ای که توان ما در آن اجازه می‌دهد. به همین دلیل، ما خبیر (خبير) را در اینجا به معنای مفعول ترجیح دادیم، یعنی خداوند دانسته و تعقل می‌شود، اما چشم‌ها او را در نمی‌یابند (لا تُدْرِكُهُ الْأَبْصارُ).\n\n### [استقراء علم‌آور نیست]\n\nاین مقدار مربوط به این باب از استقراء است. اما اینکه چرا در این موضع علم‌آور نیست، [به این دلیل است که] هیچ اصلی از آنچه ذکر کردیم نیست که صورت‌هایی را بپذیرد، مگر اینکه جایز است، بلکه واقع می‌شود، و واقع شده است که مراتب متعددی در آن صورت‌ها تکرار شود.\n\nدر اخبار آمده است که جبرئیل (علیه السلام) بارها به صورت دحیه کلبی نازل شد.\n\nو چون نزد ما در تجلی الهی (التجلی الإلهي) صحیح نیست که تجلی الهی برای یک شخص دو بار تکرار شود، و نه در یک صورت برای دو شخص ظاهر گردد، دانستیم که استقراء علم‌آور نیست. پس از جهت عدم تکرار، از حکم استقراء خارج شد، و از جهت تحول در صورت‌ها به آن ملحق گردید. و تحول در حدیث مسلم در حدیث شفاعت از کتاب ایمان آمده است. بنابراین، در هیچ یک از امور، نه در احوال، نه در مقامات، نه در منازل و نه در منازلات، نباید بر استقراء تکیه کرد. «و خداوند حق (الحق) را می‌گوید و او راه را می‌نمایاند.» (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}