{
  "id": 152,
  "title": {
    "ar": "الباب الثاني والخمسون ومائة في مقام الولاية وأسرارها",
    "en": "Chapter 152: On the Station of Sainthood (al-Wilāya) and its Mysteries",
    "ur": "ایک سو باونواں باب: مقامِ ولایت (مقام الولاية) اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و پنجاه و دوم در مقام ولایت و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثاني والخمسون ومائة في مقام الولاية وأسرارها)\n\n\n> إن الولاية عند العارفين بها *** نعت اشتراك ولكن فيه إشراك‏\n\n\n> حبالة نصبت للعارفين بها *** صيد العقول وسيف الشرع بتاك‏\n\n\n> والعبد ليس له في حكمها قدم *** وكيف يقضي بشي‏ء فيه إشراك‏\n\n\n> إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ فقد نزلت *** وعين تحقيقها ما فيه إدراك‏\n\n\n> وما الإله بمحتاج لنصرتنا *** وقد أتتكم به رسل وأملاك‏\n\n\n> فسلمته إلى من جاء منه وقل *** العجز عن درك الإدراك إدراك‏\n\n\n### [لسان العموم في الولاية]\n\n\nالولاية نعت إلهي وهو للعبد خلق لا تخلق وتعلقه من الطرفين عام ولكن لا يشعر بتعلقه عموما من الجناب الإلهي وعموم تعلقه من الكون أظهر عند الجميع فإن الولاية نصر الولي أي نصر الناصر فقد تقع لله وقد تقع حمية وعصبية\nفلذلك هو عام التعلق ولما كان هذا النعت للاله كان عام التعلق وهكذا كل نعت إلهي لا بد أن يكون عام التعلق وإن لم يكن كذلك فليس بنعت إلهي لكن بعض النعوت مثل نعت الولاية لا ينسبه الله لنفسه إلا بتعلق خاص للمؤمنين خاصة والصالحين من عباده وهو ذو النصر العام في كل منصور\n\n\n### [لسان الخصوص في الولاية]\n\n\nولما كان نعتا إلهيا هذا النصر المعبر عنه بالولاية وتسمى سبحانه به وهو اسمه الولي وأكثر ما يأتي مقيدا كقوله الله وَلِيُّ الَّذِينَ آمَنُوا سرى في كل ما ينسب إليه إلهية مما ليس بإله ولكن لما تقرر في نفس المشرك أن هذا الحجر أو هذا الكوكب أو ما كان من المخلوقات أنه إله وهو مقام محترم لذاته تعين على المشرك احترام ذلك المنسوب إليه لكون المشرك يعتقد أن تلك النسبة إليه صحيحة ولها وجه ولما علم الله سبحانه أن المشرك ما احترم ذلك المخلوق إلا لكونه إلها في زعمه نظر الحق إليه لأنه مطلوبه فإذا وفي بما يجب لتلك النسبة من الحق والحرمة وكان أشد احتراما لها من الموحد وتراءى الجمعان كانت الغلبة للمشرك على الموحد إذ كان معه النصر الإلهي لقيامه بما يجب عليه من الاحترام لله وإن أخطأ في النسبة وقامت الغفلة والتفريط في حق الموحد فخذل ولم تتعلق به الولاية لأنه غير مشاهد لأيمانه وإنما قاتل ليقال فما قاتل لله فإن الله يقول وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ فأي شخص صدق في احترام الألوهية واستحضرها وإن أخطأ في نسبتها ولكن هي مشهوده كان النصر الإلهي معه غيرة إلهية على المقام الإلهي فإنه العزيز الذي لا يغلب فما جعل نصره واجبا عليه للموحد وإنما جعل للمؤمن بما ينبغي للالوهية من الحرمة ووفى بها من وفى وهذا من أسرار الولاية التي لا يشعر بها كل عالم فإن هذا لسان خصوص‏\n\n\n### [لسان العموم في آية الولاية]\n\n\nوأما لسان العموم في هذه الآية وهو نصر المؤمنين فنقول إن الموحد إذا أخلص في إيمانه وثبت نصر على قرنه بلا شك فإذا طرأ عليه خلل ولم يكن مصمت الايمان وتزلزل خذله الحق وما وجد في نفسه قوة يقف بها لعدوه من أجل ذلك الخلل فانهزم فلما رآه عدوه منهزما تبعه وظهرت الغلبة للعدو على المؤمن فما نصر الله العدو وإنما خذل المؤمن لذلك الخلل الذي داخله فلما خذله لم يجد مؤيدا فانهزم فبالضرورة يتبعه عدوه فما هو نصر للعدو وإنما هو خذلان للمؤمن لما ذكرناه هذا لسان العموم في هذه المسألة\n\n\n### [عموم ولاية الله في مخلوقاته‏]\n\n\nفالولاية من الله عامة في مخلوقاته من حيث ما هم عبيده وبهذه الولاية تولاهم في الإيجاد ولما كان متعلق الولاية المؤمنين لذلك أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى‏ ولم يقل لهم أ لست بواحد لعلمه بأنه إذا أوجدهم أشرك بعضهم ووحد بعضهم واجتمعوا في الإقرار بالربوبية له وزاد المشرك الشريك ثم إنه سبحانه من عموم ولايته أن تولاهم بالوجود في أعيانهم ويحفظ الوجود عليهم وبتمشية أغراضهم وتولاهم بما رزقهم مما فيه قوام عيشهم ومصالحهم عموما ووفق من وفق منهم بولايته لوضع نواميس جعلها في نفوسهم من غير تنزل الذي هو الشرع فوضعها حكماء زمانهم وذوو الرأي منهم العلماء بما يصلح العالم فتولاهم سبحانه بأن قرر في أنفسهم ما ينبغي أن تكون به المصلحة لهم مراعاة لكل جزء منهم فإن كل جزء من العالم مسبح لله تعالى من كافر وغير كافر فإن أعضاء الكافر كلها مسبحة لله ولهذا يشهد عليه يوم القيامة جلده وسمعه وبصره ويده ورجله غير أن العالم لا يفقهون هذا التسبيح وسريان هذه العبادة في الموجودات وهذا من توليه سبحانه‏\n\n\n### [خصوص ولاية الله في مخلوقاته‏]\n\n\nثم إنه تولاهم بإنزال الشرائع الصادقة المعرفة بمصالح الدنيا والآخرة ثم تولاهم بما أوجد من الرحمة فيهم التي يتعاطفون بها بعضهم على بعض في الوالدين بأولادهم في تربيتهم وبالأولاد على والديهم من البر بهم والاعتماد عليهم وبما جعل من شفقة المالكين على مماليكهم وعلى ما يملكونه من الحيوانات وتولى الحيوان بما جعل فيهم من عطف الأمهات على أولادها في كل حيوان يحتاج الولد إلى تدبير أمه وتولاهم بالأغراض ليهون عليهم المشقات ويسمى مثل هذا تسخيرا فيخرج الشخص لنيل غرضه فيما يزعم وهو من حيث التولي الإلهي ما خرج إلا في حق الغير وهو يتوهم أنه في حق نفسه كالتجار وأمثالهم فالقى في نفس التاجر المسافر طلب الربح في تجارته فقام طيبا نشيط النفس واشترى من البضاعات ما يحتاج إليه أهل ذلك البلد الذي يقصده فيجوب الأمصار ويركب البحار ويتعدى الأماكن القريبة من أجل حاجة أهل البلد الذي يقصده بما جعل الله في قلبه من ذلك بولايته فإذا وصل إلى ذلك البلد باع بربح أو خسارة ونال أصحاب تلك المدينة أغراضهم ووصلوا إلي حوائجهم وهذا المسخر يتخيل في نفسه أنه ليس بمسخر وإنما سافر ليكسب فلو خرج بنية التسخير وجعل الكسب تبعا كان‏\nمستريح الخاطر إن كسب وإن لم يكسب‏\n\n\n### [الولاية الإلهية عامة التعلق لا تختص بأمر دون أمر]\n\n\nفلهذا قلنا إن ولاية الله عامة التعلق لا تختص بأمر دون أمر ولهذا جعل الوجود كله ناطقا بتسبيحه عالما بصلاته فلم يتول الله إلا المؤمنين وما ثم إلا مؤمن والكفر عرض عرض للإنسان بمجي‏ء الشرائع المنزلة ولو لا وجود الشرائع ما كان ثم كفر بالله يعطي الشقاء ولذلك قال وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا وما جاءت الشرائع إلا من أجل التعريف بما هي الدار الآخرة عليه ولو كانت مقصورة على مصالح الدنيا لوقع الاكتفاء بالنواميس الحكمية المشروعة التي ألهم الله من ألهم من عباده لوضعها لوجود المصالح فهذه ولاية الحق وأسرارها وهي الولاية العامة وولاية الولاية الكونية البشرية والملكية منها ويكفي هذا القدر ولما جعلهم الله أولياء بعضهم لبعض فقال في المؤمنين بَعْضُهُمْ أَوْلِياءُ بَعْضٍ والمؤمنات وقال والَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِياءُ بَعْضٍ فجعل الولاية بينهم تدور قال عن نفسه والله وَلِيُّ الْمُتَّقِينَ لأنه قال والَّذِينَ كَفَرُوا أَوْلِياؤُهُمُ الطَّاغُوتُ من طغى إذا ارتفع وقال في حق نفسه رَفِيعُ الدَّرَجاتِ وهم يعتقدون في الطاغوت الألوهية كما تقدم فلذلك رفعوه فما عبدوا إلا الرفيع الدرجات والله عَلِيمٌ حَكِيمٌ فاجعل بالك وتدبره تعثر على قوله وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ انتهى الجزء الرابع ومائة\n\n\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "Chapter One Hundred and Fifty-Two: Concerning the Station of Sainthood [al-Wilāya] and its Secrets\n\nSainthood [al-Wilāya], according to those Gnostics [al-ʿĀrifīn] who know it,\nIs an Attribute [naʿt] of partnership, yet within it is association [ishrāk].\n\nIt is a snare set for the Gnostics who know it,\nA hunt for intellects, while the sword of the Law [al-Sharʿ] is decisive.\n\nThe servant has no footing in its ruling,\nFor how can he judge a thing in which there is association?\n\n<<إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ>> (If you support Allah, He will support you) has been revealed,\nYet the very essence of its realization is beyond comprehension [idrāk].\n\nThe God is not in need of our support,\nFor Messengers and Angels have come to you with it.\n\nSo submit it to Him from Whom it came, and say:\nThe inability to grasp comprehension [idrāk] is itself comprehension.\n\n### [The Language of Generality concerning Sainthood]\n\nSainthood [al-Wilāya] is a Divine Attribute [naʿt ilāhī]. For the servant, it is an inherent disposition (a creation, *khalq*), not an artificial assumption (a fabrication, *takhalluq*). Its connection is general from both sides, but the servant does not generally perceive its connection from the Divine Presence [al-Janāb al-Ilāhī]. The generality of its connection from the cosmos [al-Kawn] is more apparent to everyone. Sainthood is the support (*naṣr*) of the Guardian (*al-Walī*), meaning the support of the Supporter (*al-Nāṣir*). It may occur for the sake of Allah, or it may occur out of zeal and tribal partisanship (*ʿaṣabiyya*).\n\nTherefore, its connection is general. Since this Attribute belongs to the God, its connection is general. Likewise, every Divine Attribute must necessarily have a general connection; if it were not so, it would not be a Divine Attribute. However, some Attributes, such as the Attribute of Sainthood, Allah only relates to Himself through a specific connection to the believers in particular, and the righteous among His servants. Yet, He is the possessor of general support for everyone who is supported.\n\n### [The Language of Specificity concerning Sainthood]\n\nSince this support, expressed as Sainthood [al-Wilāya], is a Divine Attribute, and He (may He be glorified) named Himself by it—His Name being The Guardian [al-Walī]—and it mostly comes qualified, such as His saying: <<الله وَلِيُّ الَّذِينَ آمَنُوا>> (Allah is the Guardian of those who believe), it permeates everything to which divinity is attributed, even if that thing is not God. However, when it is established in the soul of the associator [al-Mushrik] that this stone, or this star, or whatever creature it may be, is a god, and that it is a station respected in itself, it becomes incumbent upon the associator to respect that thing attributed to divinity, because the associator believes that this attribution is correct and has a basis.\n\nAnd when Allah (may He be glorified) knew that the associator only respected that creature because it was, in his claim, a god, The Real [al-Ḥaqq] looked upon him because he was seeking Him. Thus, if the associator fulfilled the rights and sanctity due to that attribution, and was more respectful of it than the monotheist [al-Muwaḥḥid], and the two groups met, the victory would belong to the associator over the monotheist. This is because the Divine Support [al-Naṣr al-Ilāhī] was with him due to his fulfilling the respect due to Allah, even if he erred in the attribution. If negligence and dereliction arose on the part of the monotheist, he would be abandoned [khudhila], and Sainthood would not attach to him, because he was not witnessing his faith; rather, he fought only to be praised, and thus did not fight for Allah. For Allah says: <<وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ>> (And it was incumbent upon Us to support the believers).\n\nTherefore, whoever is sincere in respecting Divinity [al-Ulūhiyya] and holds it present in his mind, even if he errs in its attribution, but it is witnessed by him, the Divine Support will be with him. This is due to Divine jealousy over the Divine Station [al-Maqām al-Ilāhī], for He is the Almighty [al-ʿAzīz] Who is never overcome. He did not make His support obligatory upon Himself for the monotheist merely, but rather for the believer who fulfills the sanctity due to Divinity, whoever fulfills it. This is one of the secrets of Sainthood [al-Wilāya] that not every scholar perceives, for this is the language of specificity.\n\n### [The Language of Generality concerning the Verse of Sainthood]\n\nAs for the language of generality concerning this verse—which is the support of the believers—we say that if the monotheist is sincere in his faith and remains firm, he will undoubtedly be supported against his opponent. But if a defect [khalal] occurs to him, and his faith is not solid, and he wavers, The Real [al-Ḥaqq] abandons him. He finds no strength within himself to stand against his enemy due to that defect, and he is defeated. When his enemy sees him defeated, he pursues him, and victory appears for the enemy over the believer. Allah did not support the enemy; rather, He abandoned the believer due to the defect that entered him. When He abandoned him, the believer found no supporter and was defeated. Necessarily, his enemy pursues him. Thus, it is not support for the enemy, but rather abandonment of the believer for the reason we mentioned. This is the language of generality concerning this issue.\n\n### [The Generality of Allah's Guardianship over His Creatures]\n\nTherefore, the Guardianship [al-Wilāya] from Allah is general over His creatures insofar as they are His servants. By this Guardianship, He took charge of them in bringing them into existence [al-Ījād]. Since the object of Guardianship is the believers, He made them testify against themselves: <<أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى>> (Am I not your Lord? They said: Yes). He did not say to them, \"Am I not One?\" because He knew that when He brought them into existence, some would associate partners [shirk] and some would affirm Unity [tawḥīd], but they would all agree in acknowledging His Lordship [al-Rubūbiyya], while the associator would add a partner.\n\nFurthermore, part of His general Guardianship (may He be glorified) is that He took charge of them by granting existence [al-Wujūd] to their fixed entities [al-Aʿyān al-Thābita], preserving existence for them, and facilitating their purposes. He took charge of them by providing them with sustenance [rizq] that sustains their lives and serves their general interests. By His Guardianship, He guided those whom He willed to establish laws [nawāmīs] that He placed in their souls, independent of the revealed descent, which is the Law [al-Sharʿ]. These laws were established by the wise men of their time and those among them who possessed sound judgment, the scholars of what benefits the world. Thus, He (may He be glorified) took charge of them by establishing within their souls what ought to be the source of benefit for them, taking into account every part of them.\n\nFor every part of the world [al-ʿĀlam] glorifies Allah, the Exalted, whether believer or non-believer. Indeed, all the limbs of the non-believer glorify Allah. This is why his skin, hearing, sight, hand, and foot will testify against him on the Day of Resurrection. However, people do not comprehend this glorification [tasbīḥ] and the permeation of this worship throughout all existing things. This is part of His Guardianship (may He be glorified).\n\n### [The Specificity of Allah's Guardianship over His Creatures]\n\nFurthermore, He took charge of them by sending down the truthful Laws [al-Sharā’iʿ] that make known the interests of this world and the Hereafter. Then, He took charge of them through the mercy [al-Raḥma] He created within them, by which they show affection to one another: in parents toward their children in raising them, and in children toward their parents through dutifulness and reliance upon them; and through the compassion He placed in owners toward their slaves and toward the animals they possess. He took charge of the animals by placing in them the affection of mothers toward their young in every animal whose offspring requires its mother's care.\n\nHe also took charge of them through their purposes [al-Aghrāḍ] to lighten their hardships. This is called subjugation [taskhīr]. A person goes out to achieve his purpose, as he claims, yet from the perspective of Divine Guardianship, he only went out for the sake of others, though he imagines it is for himself, like merchants and their counterparts. The desire for profit in his trade was cast into the soul of the traveling merchant, so he arose willingly and cheerfully, and bought the goods needed by the people of the country he intended. He traverses cities, sails the seas, and passes nearby places, all for the need of the people of the country he is heading toward, due to what Allah placed in his heart through His Guardianship.\n\nWhen he reaches that country, he sells, whether at a profit or a loss, and the inhabitants of that city achieve their purposes and obtain their necessities. This subjugated person [al-Musakhkhar] imagines that he is not subjugated, but rather traveled to earn. If he had gone out with the intention of subjugation [taskhīr] and made the earning secondary, his mind would be at ease, whether he earned or not.\n\n### [Divine Guardianship is General in Connection, not Specific to One Matter over Another]\n\nFor this reason, we said that Allah's Guardianship [wilāyat Allāh] is general in connection; it is not specific to one matter over another. Therefore, He made all Existence [al-Wujūd] articulate His glorification [tasbīḥ] and aware of His prayer [ṣalāt]. Allah only takes charge of the believers, and there is nothing but a believer. Disbelief [al-Kufr] is an accident that occurs to man with the advent of the revealed Laws [al-Sharā’iʿ]. Were it not for the existence of the Laws, there would be no disbelief in Allah that brings wretchedness. That is why He said: <<وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا>> (And We would never punish until We had sent a messenger).\n\nThe Laws only came to define what the Hereafter [al-Dār al-Ākhira] entails. If they were restricted to worldly interests, the established philosophical laws [al-Nawāmīs al-Ḥikmiyya]—which Allah inspired some of His servants to establish for the realization of benefits—would have sufficed. This, then, is the Guardianship of The Real [wilāyat al-Ḥaqq] and its secrets, which is the general Guardianship, and the Guardianship of the cosmic, human, and angelic Guardianship derived from it. This much suffices.\n\nSince Allah made them guardians [awliyā’] of one another, He said concerning the believing men and women: <<بَعْضُهُمْ أَوْلِياءُ بَعْضٍ>> (They are guardians of one another). And He said: <<وَالَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِياءُ بَعْضٍ>> (And those who disbelieve are guardians of one another). Thus, He made Guardianship circulate among them. He said concerning Himself: <<وَاللَّهُ وَلِيُّ الْمُتَّقِينَ>> (And Allah is the Guardian of the righteous). This is because He said: <<وَالَّذِينَ كَفَرُوا أَوْلِياؤُهُمُ الطَّاغُوتُ>> (And those who disbelieve, their guardians are the Ṭāghūt). And He said concerning Himself: <<رَفِيعُ الدَّرَجَاتِ>> (Exalter of Ranks). Since they believe in the divinity [al-Ulūhiyya] of the Ṭāghūt, as previously established, they exalted it. Therefore, they worshipped nothing but the Exalter of Ranks. <<وَاللَّهُ عَلِيمٌ حَكِيمٌ>> (And Allah is All-Knowing, All-Wise). Direct your attention and reflect upon this, and you will discover His saying: <<وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ>> (And your Lord has decreed that you worship none but Him).",
    "ur": "(باب ایک سو باون: مقام ولایت اور اس کے اسرار کے بیان میں)\n\nولایت (الولایۃ)، عارفین (العارفین) کے نزدیک،\nایک مشترک صفت (نعت اشتراک) ہے، لیکن اس میں شرکت (إشراك) بھی ہے۔\nیہ ایک ایسا جال ہے جو عارفین (العارفین) کے لیے بچھایا گیا ہے،\nعقلوں کا شکار ہے، اور شریعت کی تلوار کاٹنے والی ہے۔\nبندے کو اس کے حکم میں کوئی دخل نہیں،\nاور وہ کیسے کسی ایسی چیز کا فیصلہ کر سکتا ہے جس میں شرکت (إشراك) ہو۔\n\"إِنْ تَنْصُرُوا اللهَ يَنْصُرْكُمْ\" (اگر تم اللہ کی مدد کرو گے تو وہ تمہاری مدد کرے گا) نازل ہو چکی ہے،\nاور اس کی حقیقت (تحقیق) کی آنکھ وہ ہے جس کا ادراک (إدراك) ممکن نہیں۔\nاور معبود ہماری مدد کا محتاج نہیں،\nجبکہ رسول اور فرشتے تمہارے پاس اس (مدد) کو لے کر آ چکے ہیں۔\nپس اسے اس کے سپرد کر دو جو اس کی طرف سے آیا ہے اور کہو:\n\"ادراک (إدراك) کے ادراک سے عاجز ہونا ہی ادراک (إدراك) ہے۔\"\n\n### [ولایت میں عموم کی زبان]\n\nولایت (الولایۃ) ایک صفت الٰہی (نعت إلهي) ہے، اور بندے کے لیے یہ خلق ہے نہ کہ تخلق (بناوٹ)۔ اس کا تعلق دونوں طرف سے عام ہے، لیکن بندہ اس کے تعلق کو جناب الٰہی کی طرف سے عموماً محسوس نہیں کرتا۔ جبکہ اس کا تعلق کائنات کی طرف سے عام ہونا سب کے نزدیک زیادہ ظاہر ہے۔ ولایت (الولایۃ) ولی کی مدد ہے، یعنی مدد کرنے والے کی مدد۔ پس یہ اللہ کے لیے بھی واقع ہو سکتی ہے اور حمیت و عصبیت کے لیے بھی۔ اسی لیے یہ عام تعلق رکھتی ہے۔ اور چونکہ یہ صفت (نعت) معبود کے لیے ہے، لہٰذا یہ عام تعلق رکھتی ہے۔ اور اسی طرح ہر صفت الٰہی (نعت إلهي) کا عام تعلق ہونا ضروری ہے، اگر ایسا نہ ہو تو وہ صفت الٰہی (نعت إلهي) نہیں ہے۔ لیکن بعض صفات، جیسے صفت ولایت (الولایۃ)، اللہ تعالیٰ اسے اپنے ساتھ خاص تعلق کے بغیر منسوب نہیں کرتا، مگر صرف مومنین اور اپنے صالح بندوں کے لیے۔ حالانکہ وہ ہر منصور (جس کی مدد کی گئی) میں عام نصرت (النصر العام) والا ہے۔\n\n### [ولایت میں خصوص کی زبان]\n\nاور چونکہ یہ نصرت، جسے ولایت (الولایۃ) سے تعبیر کیا جاتا ہے، ایک صفت الٰہی (نعت إلهي) ہے، اور اللہ سبحانہ نے خود کو اس نام سے موسوم کیا ہے، اور وہ اس کا نام الولی (الولي) ہے۔ اور یہ اکثر مقید (محدود) آتا ہے، جیسا کہ اس کا فرمان ہے: \"اللهُ وَلِيُّ الَّذِينَ آمَنُوا\" (اللہ ان لوگوں کا ولی ہے جو ایمان لائے)۔ یہ ہر اس چیز میں سرایت کر گیا ہے جسے الوہیت (إلهية) کی طرف منسوب کیا جاتا ہے، حالانکہ وہ معبود نہیں ہے۔ لیکن جب مشرک (المشرك) کے دل میں یہ بات پختہ ہو گئی کہ یہ پتھر، یا یہ سیارہ، یا کوئی بھی مخلوق، معبود ہے اور اپنی ذات میں ایک محترم مقام ہے، تو مشرک پر لازم ہو گیا کہ وہ اس منسوب چیز کا احترام کرے، کیونکہ مشرک کا عقیدہ ہے کہ یہ نسبت صحیح ہے اور اس کی کوئی وجہ ہے۔ اور جب اللہ سبحانہ کو یہ علم ہوا کہ مشرک نے اس مخلوق کا احترام صرف اس لیے کیا کہ وہ اس کے گمان میں معبود ہے، تو ذات حق (الحق) نے اس کی طرف دیکھا کیونکہ وہ اس کا مطلوب ہے۔ پس اگر وہ اس نسبت کے حق اور حرمت کو پورا کرے، اور موحد (الموحد) سے زیادہ اس کا احترام کرے، اور دونوں گروہ آمنے سامنے ہوں، تو غلبہ مشرک کو موحد پر حاصل ہو گا، کیونکہ اس کے ساتھ نصرت الٰہی (النصر الإلهي) تھی، اس لیے کہ اس نے اللہ کے لیے وہ احترام ادا کیا جو اس پر واجب تھا، اگرچہ اس نے نسبت میں غلطی کی۔ اور موحد کے حق میں غفلت اور کوتاہی واقع ہوئی، پس اسے رسوائی (خذل) ملی اور ولایت (الولایۃ) اس سے متعلق نہ ہوئی، کیونکہ وہ اپنے ایمان کا مشاہدہ (الشہود) کرنے والا نہیں تھا، بلکہ اس نے اس لیے جنگ کی تاکہ کہا جائے (کہ وہ بہادر ہے)۔ پس اس نے اللہ کے لیے جنگ نہیں کی۔ کیونکہ اللہ فرماتا ہے: \"وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ\" (اور ہم پر مومنوں کی مدد کرنا حق ہے)۔ پس جو شخص بھی الوہیت (الألوهية) کے احترام میں سچا ہو اور اسے اپنے ذہن میں حاضر رکھے، اگرچہ اس نے اس کی نسبت میں غلطی کی ہو، لیکن وہ اس کا مشہود (مشهود) ہو، تو نصرت الٰہی (النصر الإلهي) اس کے ساتھ ہو گی، یہ مقام الٰہی پر ایک غیرت الٰہیہ (غيرة إلهية) ہے۔ کیونکہ وہ عزیز ہے جسے مغلوب نہیں کیا جا سکتا۔ پس اس نے اپنی نصرت کو موحد پر واجب نہیں کیا، بلکہ اسے اس شخص کے لیے مقرر کیا جس نے الوہیت (الألوهية) کے لیے ضروری حرمت کو مانا اور اسے پورا کیا۔ اور یہ ولایت (الولایۃ) کے ان اسرار میں سے ہے جسے ہر عالم محسوس نہیں کرتا، کیونکہ یہ خصوص کی زبان (لسان خصوص) ہے۔\n\n### [آیت ولایت میں عموم کی زبان]\n\nاور اس آیت میں عموم کی زبان (لسان العموم)، یعنی مومنین کی نصرت (مدد)، کے بارے میں ہم کہتے ہیں کہ موحد (الموحد) جب اپنے ایمان میں اخلاص رکھتا ہے اور ثابت قدم رہتا ہے، تو وہ بلا شک اپنے حریف پر غالب آتا ہے۔ لیکن جب اس پر کوئی خلل (نقص) طاری ہوتا ہے اور اس کا ایمان مضبوط نہیں رہتا اور متزلزل ہو جاتا ہے، تو ذات حق (الحق) اسے رسوا (خذل) کر دیتی ہے، اور وہ اپنے اندر کوئی ایسی قوت نہیں پاتا جس سے وہ اپنے دشمن کے سامنے کھڑا ہو سکے، اسی خلل کی وجہ سے وہ شکست کھا جاتا ہے۔ جب اس کا دشمن اسے شکست کھاتے ہوئے دیکھتا ہے تو اس کا پیچھا کرتا ہے اور دشمن کو مومن پر غلبہ حاصل ہو جاتا ہے۔ پس اللہ نے دشمن کی مدد نہیں کی، بلکہ اس نے مومن کو اس خلل کی وجہ سے رسوا کیا جو اس کے اندر داخل ہو گیا تھا۔ جب اللہ نے اسے رسوا کیا تو اسے کوئی مددگار نہ ملا، پس وہ شکست کھا گیا۔ لہٰذا، اس کا دشمن لازمی طور پر اس کا پیچھا کرے گا۔ پس یہ دشمن کی نصرت نہیں ہے، بلکہ مومن کی رسوائی (خذلان) ہے، جیسا کہ ہم نے ذکر کیا۔ یہ اس مسئلے میں عموم کی زبان (لسان العموم) ہے۔\n\n### [اللہ کی ولایت کا اس کی مخلوقات میں عموم]\n\nپس اللہ کی ولایت (الولایۃ) اس کی مخلوقات میں عام ہے، اس حیثیت سے کہ وہ اس کے بندے ہیں۔ اور اسی ولایت (الولایۃ) کے ذریعے اس نے انہیں وجود (الإيجاد) میں سرپرستی دی۔ اور چونکہ ولایت (الولایۃ) کا تعلق مومنین سے تھا، اس لیے اس نے انہیں ان کی جانوں پر گواہ بنایا: \"أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى\" (کیا میں تمہارا رب نہیں ہوں؟ انہوں نے کہا: کیوں نہیں!)۔ اور اس نے ان سے یہ نہیں کہا کہ کیا میں واحد نہیں ہوں؟ کیونکہ اسے علم تھا کہ جب وہ انہیں وجود (الوجود) دے گا تو ان میں سے کچھ شرک کریں گے اور کچھ توحید اختیار کریں گے، اور وہ سب اس کی ربوبیت (الربوبية) کے اقرار میں جمع ہوں گے، اور مشرک (المشرك) شریک کا اضافہ کرے گا۔ پھر اس کی ولایت (الولایۃ) کے عموم میں سے یہ ہے کہ اس نے ان کی سرپرستی ان کے اعیان میں وجود (الوجود) کے ذریعے کی، اور ان پر وجود (الوجود) کو محفوظ رکھا، اور ان کے مقاصد کو چلانے کے ذریعے، اور اس نے انہیں اس رزق کے ذریعے سرپرستی دی جس میں ان کی زندگی کا قیام اور ان کی عمومی مصلحتیں ہیں۔ اور اس نے ان میں سے جن کو توفیق دی، انہیں اپنی ولایت (الولایۃ) کے ذریعے ان نوامیس (قوانین) کو وضع کرنے کی توفیق دی جو اس نے ان کے نفوس میں بغیر کسی نزول (جو کہ شریعت ہے) کے رکھے۔ پس ان کے زمانے کے حکماء اور ان میں سے اہل رائے نے وہ نوامیس وضع کیے جو عالم کی اصلاح کے لیے موزوں تھے۔ پس اللہ سبحانہ نے ان کی سرپرستی کی کہ ان کے نفوس میں وہ چیزیں مقرر کر دیں جن سے ان کی مصلحت ہو، ان کے ہر جزو کا خیال رکھتے ہوئے۔ کیونکہ عالم کا ہر جزو اللہ تعالیٰ کی تسبیح کرتا ہے، خواہ وہ کافر ہو یا غیر کافر۔ کیونکہ کافر کے تمام اعضاء اللہ کی تسبیح کرتے ہیں، اور اسی لیے قیامت کے دن اس کی جلد، اس کی سماعت، اس کی بصارت، اس کا ہاتھ اور اس کا پاؤں اس کے خلاف گواہی دیں گے۔ مگر یہ کہ دنیا والے اس تسبیح اور موجودات میں اس عبادت کے سرایت کرنے کو نہیں سمجھتے۔ اور یہ اس کی سرپرستی (تولیہ) میں سے ہے۔\n\n### [اللہ کی ولایت کا اس کی مخلوقات میں خصوص]\n\nپھر اس نے ان کی سرپرستی سچی شرائع نازل کرنے کے ذریعے کی جو دنیا و آخرت کی مصلحتوں سے آگاہ کرتی ہیں۔ پھر اس نے ان کی سرپرستی اس رحمت کے ذریعے کی جو اس نے ان میں پیدا کی، جس سے وہ ایک دوسرے پر مہربانی کرتے ہیں، جیسے والدین کا اپنی اولاد کی تربیت میں، اور اولاد کا اپنے والدین کے ساتھ نیکی اور ان پر بھروسہ کرنے میں۔ اور اس شفقت کے ذریعے جو اس نے مالکان کے دلوں میں اپنے غلاموں اور اپنے مالکانہ جانوروں کے لیے رکھی۔ اور اس نے حیوانات کی سرپرستی اس محبت کے ذریعے کی جو اس نے ماؤں کے دلوں میں اپنی اولاد کے لیے رکھی، ہر اس حیوان میں جس کی اولاد کو ماں کی تدبیر کی ضرورت ہوتی ہے۔ اور اس نے ان کی سرپرستی مقاصد (الأغراض) کے ذریعے کی تاکہ ان پر مشقتیں آسان ہو جائیں، اور ایسی چیز کو تسخیر (تسخيرا) کہا جاتا ہے۔ پس شخص اپنے گمان میں اپنا مقصد حاصل کرنے کے لیے نکلتا ہے، جبکہ الٰہی سرپرستی (التولي الإلهي) کے لحاظ سے وہ صرف دوسرے کے حق میں نکلا ہے، اور وہ یہ وہم کرتا ہے کہ وہ اپنے حق میں نکلا ہے، جیسے تاجر اور ان جیسے لوگ۔ پس تاجر مسافر کے دل میں اس کی تجارت میں نفع کی طلب ڈالی گئی، تو وہ خوش دلی اور چست روح کے ساتھ اٹھا اور اس ملک کے لوگوں کو جن کی طرف وہ جا رہا ہے، جن سامان کی ضرورت ہے وہ خریدے۔ پس وہ شہروں کا سفر کرتا ہے، سمندروں میں سوار ہوتا ہے، اور قریبی جگہوں سے گزرتا ہے، اس ملک کے لوگوں کی ضرورت کی خاطر، جو اللہ نے اپنی ولایت (الولایۃ) کے ذریعے اس کے دل میں ڈالا ہے۔ پس جب وہ اس ملک پہنچتا ہے تو نفع یا نقصان پر بیچتا ہے، اور اس شہر کے لوگ اپنے مقاصد حاصل کر لیتے ہیں اور اپنی ضروریات تک پہنچ جاتے ہیں۔ اور یہ مسخر (تسخیر شدہ) شخص اپنے دل میں یہ خیال کرتا ہے کہ وہ مسخر نہیں ہے، بلکہ وہ کمانے کے لیے سفر کر رہا ہے۔ اگر وہ تسخیر (التسخير) کی نیت سے نکلتا اور کمائی کو ثانوی حیثیت دیتا، تو وہ اپنے دل میں مطمئن رہتا، خواہ وہ کماتا یا نہ کماتا۔\n\n### [ولایت الٰہی عام تعلق رکھتی ہے، کسی ایک امر کے ساتھ خاص نہیں]\n\nاسی لیے ہم نے کہا کہ اللہ کی ولایت (الولایۃ) عام تعلق رکھتی ہے، کسی ایک امر کے ساتھ خاص نہیں ہے۔ اور اسی لیے اس نے تمام وجود (الوجود) کو اپنی تسبیح کے ساتھ گویا اور اپنی نماز کے ساتھ عالم بنا دیا۔ پس اللہ نے صرف مومنین کی سرپرستی کی، اور وہاں مومن کے سوا کوئی نہیں ہے۔ اور کفر (الکفر) ایک عارضی چیز ہے جو نازل شدہ شرائع کے آنے سے انسان پر طاری ہوئی ہے۔ اور اگر شرائع کا وجود نہ ہوتا تو اللہ کے ساتھ کوئی کفر نہ ہوتا جو بدبختی دیتا ہے۔ اسی لیے اس نے فرمایا: \"وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا\" (اور ہم عذاب دینے والے نہیں ہیں جب تک کہ ہم کوئی رسول نہ بھیج دیں)۔ اور شرائع صرف اس لیے آئیں تاکہ یہ بتایا جائے کہ آخرت کیسی ہے۔ اور اگر وہ صرف دنیاوی مصلحتوں تک محدود ہوتیں، تو حکمی نوامیس (قوانین) جو اللہ نے اپنے بندوں میں سے جن کو الہام کیا تھا، ان کے ذریعے مصلحتوں کے وجود کے لیے کافی ہو جاتیں۔ پس یہ ذات حق (الحق) کی ولایت (الولایۃ) اور اس کے اسرار ہیں، اور یہ ولایت عامہ ہے، اور ولایتِ ولایتِ کونیہ بشریہ اور ملکیہ (فرشتوں کی) ہے۔ اور یہ مقدار کافی ہے۔ اور جب اللہ نے انہیں ایک دوسرے کا ولی بنایا، تو مومنین کے بارے میں فرمایا: \"بَعْضُهُمْ أَوْلِياءُ بَعْضٍ\" (وہ ایک دوسرے کے ولی ہیں) اور مومنات کے بارے میں بھی یہی فرمایا۔ اور فرمایا: \"وَالَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِياءُ بَعْضٍ\" (اور جنہوں نے کفر کیا وہ ایک دوسرے کے ولی ہیں)۔ پس اس نے ولایت (الولایۃ) کو ان کے درمیان گردش کرنے والا بنا دیا۔ اس نے اپنے بارے میں فرمایا: \"وَاللهُ وَلِيُّ الْمُتَّقِينَ\" (اور اللہ پرہیزگاروں کا ولی ہے)۔ کیونکہ اس نے فرمایا: \"وَالَّذِينَ كَفَرُوا أَوْلِياؤُهُمُ الطَّاغُوتُ\" (اور جنہوں نے کفر کیا ان کے ولی طاغوت ہیں)۔ طاغوت (الطاغوت) اس سے بنا ہے جو طغیٰ (حد سے بڑھ گیا) یعنی بلند ہوا۔ اور اس نے اپنے حق میں فرمایا: \"رَفِيعُ الدَّرَجَاتِ\" (بلند درجات والا)۔ اور وہ طاغوت (الطاغوت) میں الوہیت (الألوهية) کا اعتقاد رکھتے ہیں، جیسا کہ پہلے بیان ہوا، اسی لیے انہوں نے اسے بلند کیا۔ پس انہوں نے عبادت نہیں کی مگر بلند درجات والے کی۔ اور اللہ علیم (علیم) اور حکیم (حکیم) ہے۔ پس اپنے دل کو متوجہ کرو اور غور کرو، تم اس کے فرمان پر پہنچ جاؤ گے: \"وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ\" (اور تمہارے رب نے فیصلہ کر دیا ہے کہ تم اس کے سوا کسی کی عبادت نہ کرو)۔ ایک سو چارواں حصہ مکمل ہوا۔\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "(باب صد و پنجاه و دوم در مقام ولایت و اسرار آن)\n\nولایت نزد عارفان به آن، صفتی مشترک است، اما در آن شرک (اشتراک) وجود دارد.\n\nتله‌ای است که برای عارفان به آن نصب شده، شکار عقل‌هاست و شمشیر شریعت آن را قطع می‌کند.\n\nو بنده را در حکم آن (ولایت) قدمی نیست، و چگونه می‌تواند در مورد چیزی که در آن شرک است، حکم کند؟\n\nآیه «إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ» (اگر خدا را یاری کنید، شما را یاری می‌کند) نازل شده است، و عین تحقق آن چیزی است که در آن ادراکی نیست.\n\nو خداوند نیازمند یاری ما نیست، در حالی که رسولان و فرشتگان آن را برای شما آورده‌اند.\n\nپس آن را به کسی که از او آمده است بسپار و بگو: ناتوانی از درکِ ادراک، خود ادراک است.\n\n### [زبان عموم در ولایت]\n\nولایت صفتی (نعت) الهی است و برای بنده، خلقی است نه تخلّق (کسب). تعلق (تعلق) آن از دو طرف عام است، اما بنده عموماً به تعلق آن از جانب الهی آگاه نیست. و عموم تعلق آن از جانب کائنات نزد همگان آشکارتر است. زیرا ولایت، یاریِ ولی است، یعنی یاریِ یاری‌کننده. پس گاهی برای خدا واقع می‌شود و گاهی از روی حمیت و تعصب. به همین دلیل، تعلق آن عام است. و چون این صفت (نعت) از آنِ خداوند است، تعلق آن عام بوده است. و همچنین هر صفت الهی (نعت إلهي) باید عام التعلق باشد، و اگر چنین نباشد، صفت الهی نیست. اما برخی صفات، مانند صفت ولایت، خداوند آن را به خود نسبت نمی‌دهد مگر با تعلق خاص به مؤمنان به طور ویژه و صالحان از بندگانش. و او صاحب نصرت عام در هر یاری‌شده‌ای است.\n\n### [زبان خصوص در ولایت]\n\nو چون این نصرت که از آن به ولایت تعبیر می‌شود، صفتی الهی (نعت إلهي) بود و خداوند سبحان خود را به آن نامید و نام او الولی (ولی) است، در هر آنچه که به او نسبت الوهیت داده می‌شود، سریان یافت، حتی اگر آن شیء اله نباشد. اما چون در نفس مشرک مقرر شده است که این سنگ یا این ستاره یا هر مخلوق دیگری، اله است و مقامی محترم برای ذات خود دارد، بر مشرک لازم است که آن منسوب را احترام کند، زیرا مشرک معتقد است که آن نسبت به او صحیح است و وجهی دارد. و چون خداوند سبحان دانست که مشرک آن مخلوق را احترام نکرده است مگر به دلیل اینکه در گمان او اله است، حق (الحق) به او نظر کرد، زیرا او مطلوب حق است. پس اگر مشرک به آنچه برای آن نسبت از حق و حرمت واجب است، وفا کند و احترام او شدیدتر از موحد باشد، و دو گروه (مشرک و موحد) با هم روبرو شوند، غلبه از آنِ مشرک بر موحد خواهد بود. زیرا نصرت الهی (النصر الإلهي) همراه اوست، به دلیل قیام او به آنچه از احترام برای خداوند بر او واجب است، هرچند در نسبت دادن خطا کرده باشد. و اگر غفلت و کوتاهی در حق موحد رخ دهد، حق او را خوار می‌سازد و ولایت به او تعلق نمی‌گیرد، زیرا او شاهد ایمان خود نیست، بلکه جنگیده است تا گفته شود (که شجاع است)، پس برای خدا نجنگیده است. زیرا خداوند می‌فرماید: «وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ» (و یاری مؤمنان بر ما حق و واجب است). پس هر کس در احترام به الوهیت صادق باشد و آن را حاضر بداند، هرچند در نسبت دادن آن خطا کند، اما آن (الوهیت) مشهود او باشد، نصرت الهی (النصر الإلهي) به دلیل غیرت الهی بر مقام الهی، همراه او خواهد بود. زیرا او عزیز (العزیز) است که مغلوب نمی‌شود. پس نصرت خود را بر موحد واجب نکرده است، بلکه آن را برای مؤمنی قرار داده است که حرمت شایسته الوهیت را رعایت کند و هر کس به آن وفا کند. و این از اسرار ولایت است که هر عالمی به آن آگاه نیست، زیرا این زبان خصوص است.\n\n### [زبان عموم در آیه ولایت]\n\nاما زبان عموم در این آیه که همان نصرت مؤمنان است، می‌گوییم: موحد اگر در ایمان خود اخلاص ورزد و ثابت قدم باشد، بدون شک بر همتای خود پیروز می‌شود. اما اگر خللی بر او عارض شود و ایمانش محکم نباشد و متزلزل گردد، حق (الحق) او را خوار می‌سازد و او در خود نیرویی نمی‌یابد که به واسطه آن در برابر دشمنش بایستد، به همین دلیل شکست می‌خورد. پس چون دشمن او را شکست‌خورده ببیند، او را دنبال می‌کند و غلبه برای دشمن بر مؤمن آشکار می‌شود. پس خداوند دشمن را یاری نکرده است، بلکه مؤمن را به دلیل آن خللی که در او راه یافته، خوار ساخته است. چون او را خوار ساخت، مؤیدی نیافت و شکست خورد، پس به ناچار دشمنش او را دنبال می‌کند. بنابراین، این نصرت برای دشمن نیست، بلکه خواری برای مؤمن است به دلیل آنچه ذکر کردیم. این زبان عموم در این مسئله است.\n\n### [عموم ولایت خداوند در مخلوقاتش]\n\nپس ولایت از جانب خداوند در مخلوقاتش عام است، از آن جهت که بندگان او هستند. و به واسطه این ولایت، در ایجاد (ایجاد) آنان را سرپرستی کرد. و چون متعلق ولایت، مؤمنان بودند، به همین دلیل «أَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى‏» (آنان را بر خودشان گواه گرفت که آیا من پروردگار شما نیستم؟ گفتند: بله). و به آنان نگفت: آیا من واحد نیستم؟ زیرا می‌دانست که وقتی آنان را ایجاد کند، برخی از آنان شرک می‌ورزند و برخی توحید، و همگی در اقرار به ربوبیت او اجتماع می‌کنند و مشرک شریک را اضافه می‌کند. سپس، خداوند سبحان از عموم ولایتش این است که آنان را با وجود در اعیانشان سرپرستی کرد و وجود را بر آنان حفظ می‌کند و اغراضشان را به پیش می‌برد. و آنان را با آنچه روزی‌شان داد که قوام زندگی و مصالحشان در آن است، به طور عموم سرپرستی کرد. و به کسانی از آنان که توفیق داد، به واسطه ولایتش، برای وضع نوامیسی که در نفوسشان قرار داد، توفیق داد؛ نوامیسی که غیر از تنزل (نزول) شرع است. پس حکیمان زمانشان و صاحبان رأی از دانشمندان، آنچه را که صلاح عالم است، وضع کردند. پس خداوند سبحان آنان را سرپرستی کرد به اینکه آنچه را که مصلحتشان باید باشد، در نفوسشان مقرر کرد، با رعایت هر جزء از آنان. زیرا هر جزئی از عالم، تسبیح‌گوی خداوند تعالی است، چه کافر باشد و چه غیر کافر. اعضای کافر همگی تسبیح‌گوی خداوند هستند و به همین دلیل در روز قیامت پوست، گوش، چشم، دست و پای او بر علیه او شهادت می‌دهند. جز اینکه عالمیان این تسبیح و سریان این عبادت را در موجودات درک نمی‌کنند. و این از سرپرستی (تولی) خداوند سبحان است.\n\n### [خصوص ولایت خداوند در مخلوقاتش]\n\nسپس خداوند آنان را با نازل کردن شرایع صادق که مصالح دنیا و آخرت را می‌شناساند، سرپرستی کرد. سپس آنان را با رحمتی که در ایشان ایجاد کرد و به واسطه آن بر یکدیگر عطوفت می‌ورزند، سرپرستی کرد؛ مانند عطوفت والدین بر فرزندانشان در تربیت، و عطوفت فرزندان بر والدینشان از طریق نیکی و تکیه بر آنان. و همچنین با شفقت و مهری که در مالکان نسبت به بردگانشان و نسبت به حیواناتی که مالک هستند، قرار داد. و حیوانات را با عاطفه‌ای که در مادران نسبت به فرزندانشان قرار داد، سرپرستی کرد، در هر حیوانی که فرزند به تدبیر مادرش نیاز دارد. و آنان را با اغراض (اهداف) سرپرستی کرد تا سختی‌ها را بر ایشان آسان سازد، و چنین چیزی تسخیر نامیده می‌شود. پس شخص برای رسیدن به غرض خود، آن‌گونه که گمان می‌کند، خارج می‌شود، در حالی که از جهت سرپرستی الهی (التولي الإلهي)، جز برای حق دیگری خارج نشده است، و او توهم می‌کند که برای حق خود خارج شده است؛ مانند تاجران و امثال آنان. پس در نفس تاجر مسافر، طلب سود در تجارتش را القا کرد. او با میل و نشاط خاطر برخاست و کالاهایی را خرید که اهل آن شهری که قصد دارد، به آن نیاز دارند. پس شهرها را می‌پیماید و سوار دریاها می‌شود و از مکان‌های نزدیک می‌گذرد، به خاطر نیاز اهل آن شهری که قصد دارد، به واسطه آنچه خداوند در قلب او از آن قرار داده است، به ولایت (ولایت) خود. پس هنگامی که به آن شهر رسید، با سود یا زیان می‌فروشد و صاحبان آن شهر به اغراض خود می‌رسند و به حوائجشان دست می‌یابند. و این مسخّر در نفس خود خیال می‌کند که مسخّر نیست، بلکه سفر کرده است تا کسب کند. در حالی که اگر با نیت تسخیر خارج می‌شد و کسب را تابع آن قرار می‌داد، آسوده‌خاطر بود، چه کسب می‌کرد و چه نمی‌کرد.\n\n### [ولایت الهی عام التعلق است و به امری دون امر دیگر اختصاص ندارد]\n\nبه همین دلیل گفتیم که ولایت خداوند عام التعلق است و به امری دون امر دیگر اختصاص ندارد. و به همین دلیل، تمام هستی (الوجود) را گویا به تسبیح خود و دانا به نماز خود قرار داد. پس خداوند جز مؤمنان را سرپرستی نکرد، و در آنجا جز مؤمن نیست. و کفر عَرَضی است که با آمدن شرایع نازل شده، برای انسان عارض گشت. و اگر شرایع وجود نداشت، کفر به خدا که شقاوت می‌آورد، وجود نمی‌داشت. و به همین دلیل فرمود: «وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا» (و ما عذاب‌کننده نبودیم تا اینکه رسولی بفرستیم). و شرایع نیامدند مگر برای شناساندن آنچه دار آخرت بر آن است. و اگر شرایع تنها محدود به مصالح دنیا بودند، همان نوامیس حکمیِ مشروعی که خداوند به برخی از بندگانش برای وضع آن الهام کرد، برای وجود مصالح کفایت می‌کرد. پس این ولایت حق (ولایة الحق) و اسرار آن است، و آن ولایت عامه و ولایتِ ولایتِ کونیِ بشری و ملکی از آن است. و این مقدار کافی است. و چون خداوند آنان را ولیّ یکدیگر قرار داد، در مورد مؤمنان فرمود: «بَعْضُهُمْ أَوْلِياءُ بَعْضٍ» (برخی از آنان ولیّ برخی دیگرند) و مؤمنات نیز چنین‌اند. و فرمود: «وَالَّذِينَ كَفَرُوا بَعْضُهُمْ أَوْلِياءُ بَعْضٍ» (و کسانی که کفر ورزیدند، برخی از آنان ولیّ برخی دیگرند). پس ولایت را در میان آنان در گردش قرار داد. درباره خود فرمود: «وَاللَّهُ وَلِيُّ الْمُتَّقِينَ» (و خداوند ولیّ پرهیزگاران است). زیرا فرمود: «وَالَّذِينَ كَفَرُوا أَوْلِياؤُهُمُ الطَّاغُوتُ» (و کسانی که کفر ورزیدند، ولیّ آنان طاغوت است). طاغوت از \"طغی\" به معنای بالا رفتن است. و خداوند در حق خود فرمود: «رَفِيعُ الدَّرَجَاتِ» (بالابرنده درجات). و آنان در مورد طاغوت، الوهیت را معتقدند، همان‌طور که پیشتر گذشت. به همین دلیل او را بالا بردند. پس آنان جز «رفیع الدرجات» را عبادت نکردند. و «وَاللَّهُ عَلِيمٌ حَكِيمٌ» (و خداوند دانا و حکیم است). پس توجه کن و در آن تدبر نما تا به قول او دست یابی: «وَقَضَى رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ» (و پروردگارت حکم کرد که جز او را نپرستید). پایان جزء صد و چهارم.\n\n(به نام خداوند بخشنده مهربان)"
  },
  "page_count": 3
}