{
  "id": 522,
  "title": {
    "ar": "الباب الثاني والعشرون وخمسمائة في معرفة حال قطب كان منزله والَّذِينَ يُؤْتُونَ ما آتَوْا وقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلى‏ رَبِّهِمْ راجِعُونَ أُولئِكَ يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ",
    "en": "Chapter Five Hundred and Twenty-Two: Concerning the knowledge of the state of a Pole (قطب) whose station was [that of] <<وَالَّذِينَ يُؤْتُونَ مَا آتَوْا وَقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلَى رَبِّهِمْ رَاجِعُونَ أُولَئِكَ يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُونَ>> (And those who give what they give while their hearts are fearful because they will be returning to their Lord. Those hasten to good deeds, and they are the foremost in them).",
    "ur": "باب پانچ سو بائیس: ایک قطب (Quṭb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا مقام (Manzil) یہ تھا: \"اور وہ لوگ جو دیتے ہیں جو کچھ وہ دیتے ہیں، اور ان کے دل ڈرتے رہتے ہیں کہ انہیں اپنے رب کی طرف لوٹ کر جانا ہے (وَالَّذِينَ يُؤْتُونَ مَا آتَوْا وَقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلَى رَبِّهِمْ رَاجِعُونَ)۔ یہی لوگ نیکیوں میں جلدی کرتے ہیں اور وہ ان میں سبقت لے جانے والے ہیں (أُولَئِكَ يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُونَ)۔\"",
    "fa": "باب پانصد و بیست و دوم در معرفت حال قطبی (قطب) که منزل او [این آیه] بود: «وَالَّذِينَ يُؤْتُونَ مَا آتَوْا وَقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلَى رَبِّهِمْ رَاجِعُونَ أُولَئِكَ يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُونَ» (و آنان که آنچه را باید بدهند، می‌دهند، در حالی که دل‌هایشان ترسان است از اینکه به سوی پروردگارشان باز خواهند گشت. آنانند که در کارهای نیک شتاب می‌ورزند و در آن پیشی گیرندگانند.)"
  },
  "content": {
    "ar": "## «الباب الثاني والعشرون وخمسمائة في معرفة حال قطب كان منزله والَّذِينَ يُؤْتُونَ ما آتَوْا وقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلى‏ رَبِّهِمْ راجِعُونَ أُولئِكَ يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ»\n\n\n> إن القلوب مع الخيرات في وجل *** وإنها عند ما تلقاه في خجل‏\n\n\n> فيسرع العبد في مرضاة سيده *** لكونه خلق الإنسان من عجل‏\n\n\n> فالطبع يسرع والأفكار تسعده *** فما يرى أبدا يمشي على مهل‏\n\n\n> إن السباق لمن شأن الرجال فمن *** أربى على أحد أربى على رجل‏\n\n\nقال الله تعالى في الورثة ومِنْهُمْ سابِقٌ بِالْخَيْراتِ ... ذلِكَ هُوَ الْفَضْلُ الْكَبِيرُ فالضمير من هو يعود على السبق الذي يدل عليه اسم الفاعل‏\n\n\n### [السبب الموجب للوجل‏]\n\n\nاعلم أن السبب الموجب لوجلهم قول الله عنهم الَّذِينَ يُؤْتُونَ وجعل هنا ما بمعنى الذي ثم جاء باتوا بعد ما وكلامه صدق فأدركهم الوجل إذ قطعوا أنهم لا بد أن يقوم بهم الدعوى فيما جاءوا به من طاعة الله فيكشف الله لهم إذا خافوا ووجلوا من ذلك وتبديل الله لفظة ما التي بمعنى الذي بلفظة ما النافية مثل قوله تعالى وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ هكذا يكون كشفه هنا للوجل ما يؤتون الذي أتوا به ولكن الله أتى به فأقامهم مقام نفسه فيما جاءوا به من الأعمال الصالحة ثم نظروا في ذكرهم للتعليل وهو قوله تعالى أَنَّهُمْ إِلى‏ رَبِّهِمْ راجِعُونَ فيما أتوا به مع كون الله‏\nوصفهم بأنهم الذي أتوا به فانظر ما أدق نظرهم في السبب الذي جعل في قلوبهم الوجل ثم تمموا الذكر كما علمهم الله أُولئِكَ إشارة إلى هؤلاء الذين يُسارِعُونَ في الْخَيْراتِ والإسراع لمن أتى هرولة فافهم فهم يسارعون في الخيرات بالحق وهُمْ لَها سابِقُونَ أي يسبقونها ويسبقون إليها فالخيرات ثلاثة خيرات يكون السباق والمسارعة فيها وخيرات يكون السباق بها وخيرات يكون السباق إليها وهي قوله سابِقُوا إِلى‏ مَغْفِرَةٍ وسارِعُوا إِلى‏ مَغْفِرَةٍ والسرعة في السباق لا بد منها لأن السباق يعطي ذلك وهو فوق السعي فإتيانهم بسرعة والزائد على السعي ما هو إلا هرولة وهي نعت إلهي وإذا انفرد الحق بنعت كان له فما يأخذه العبد إلا معار الكون الحق لا يشارك في شي‏ء أضافه إلى نفسه وما لم يذكر بإضافة إلى الله فلك فيه التصرف إن شئت أضفته إلى الله تعالى وإن شئت أضفته إليك فإن تقدم لك إضافة ذلك إلى الله حرم عليك إن تضيفه بعد ذلك إلى نفسك فإن صورته في ذلك صورة ما أضافه الحق إلى نفسه فسواء كان ذلك منه ابتداء أو قال ذلك على لسان عبده فإن الله عند لسان كل قائل بما يقول كما هو قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ فأنت الكتاب المشار إليه في قوله ولَدَيْنا كِتابٌ يَنْطِقُ بِالْحَقِّ وأنت الناطق فإنه الفصل المقوم لك في حدك وما أحسن قوله وهُمْ لا يُظْلَمُونَ حيث عرفنا بأننا الكتاب الذي ينطق بالحق وشرفنا بأنا لديه وما عِنْدَ الله باقٍ فلنا البقاء بما نحن لديه على هذه الصفة التي وصفنا الله بها من النطق بالحق فإنا بالله ننطق والله يقول على لسان عبده ما ينطقه به وبِالْحَقِّ أَنْزَلْناهُ وبِالْحَقِّ نَزَلَ وهو القائل لا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها وقد وسعت الحق الذي ضاق عنه الأرض والسماء وهو سبحانه لا يثقله شي‏ء وإنما نعته بالتكليف لأنه على كل حال محل جلال للحق به ينطق ويسمع ويبصر ويسعى ويبطش فقبول الزائد تكليف والوسع في إعطاء كل شي‏ء حقه‏\n\n\n> فكن به حتى يكن *** إن لم تكن فلا يكن‏\n\n\n> فأنت خلاق له *** وأنت مخلوق بكن‏\n\n\n> إن الحديث لم يسع *** إلا الحديث المستكن‏\n\n\n> فما استكانوا للذي *** قال استكينوا فاستكن‏\n\n\n> فللإله ما سكن *** وهو لنا نعم السكن‏\n\n\nفالحمد لله على ما أولى هُوَ لَهُ الْحَمْدُ في الْأُولى‏ والْآخِرَةِ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Twenty-Two concerning the knowledge of the state of a Pole (قطب) whose station is defined by: <<الَّذِينَ يُؤْتُونَ ما آتَوْا وقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلى‏ رَبِّهِمْ راجِعُونَ أُولئِكَ يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ>> (And those who give what they give while their hearts are fearful because they will return to their Lord—those hasten to good deeds, and they are the foremost in them.)\n\nIndeed, hearts are in apprehension (وجل) alongside good deeds,\nAnd they are in shame (خجل) when they meet Him.\n\nSo the servant hastens in the pleasure of his Lord,\nBecause humankind was created from haste.\n\nThe nature (الطبع) hastens, and thoughts assist it,\nSo he is never seen walking slowly.\n\nIndeed, racing (السباق) is the concern of men,\nSo whoever surpasses someone has surpassed a man.\n\nAllah the Exalted said concerning the inheritors: <<وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ ... ذَلِكَ هُوَ الْفَضْلُ الْكَبِيرُ>> (And among them is a foremost one in good deeds... That is the great bounty.) [Qur'an 35:32]. The pronoun *huwa* (هو) refers back to the precedence (السبق) indicated by the active participle, which is *sābiq* (foremost one).\n\n### [The Cause Necessitating Apprehension]\n\nKnow that the reason necessitating their apprehension (وجل) is Allah’s statement concerning them: *al-ladhīna yu’tūna* (those who give). He then made *mā* (ما) here mean *al-ladhī* (that which), followed by *ātaw* (they gave) after *mā*. And His speech is Truth. Apprehension overtook them because they were certain that the claim regarding the obedience to Allah they brought forth must necessarily be established by them.\n\nThen Allah unveils (يكشف) for them, when they fear and are apprehensive of this, by replacing the word *mā* (ما), which means 'that which,' with the negative particle *mā* (ما), similar to His saying: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ>> (And you did not throw when you threw, but Allah threw). [Qur'an 8:17]. Thus, His unveiling (كشف) here for the apprehension (وجل) is: They do not give that which they brought forth, but Allah brought it forth. So He established them in His own station (مقام نفسه) regarding the righteous deeds they brought forth.\n\nThen they considered their mention of the justification, which is His saying: <<أَنَّهُمْ إِلَىٰ رَبِّهِمْ رَاجِعُونَ>> (because they will return to their Lord) concerning what they brought forth, despite Allah having described them as those who brought it forth. Observe how subtle their insight (نظرهم) is into the reason that placed apprehension in their hearts.\n\nThen they completed the mention, as Allah taught them: <<أُولَئِكَ>> (Those) is a reference to these people who <<يُسَارِعُونَ فِي الْخَيْرَاتِ>> (hasten to good deeds). And hastening (الإسراع) belongs to one who comes running (هرولة), so understand this. They hasten to good deeds by the Real (بالحق), and <<وَهُمْ لَهَا سَابِقُونَ>> (and they are the foremost in them), meaning they precede the good deeds and precede toward them.\n\nGood deeds (الخيرات) are of three types: good deeds in which the racing (السباق) and hastening (المسارعة) occur; good deeds by which the racing occurs; and good deeds toward which the racing occurs, which is His saying: <<سَابِقُوا إِلَىٰ مَغْفِرَةٍ>> (Race toward forgiveness) [Qur'an 57:21] and <<وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ>> (And hasten toward forgiveness) [Qur'an 3:133].\n\nSpeed (السرعة) is indispensable in racing, because racing necessitates it, and it is above mere striving (السعي). Thus, their coming with speed, the excess over striving, is nothing but running (هرولة), which is a Divine Attribute (نعت إلهي). When the Real (الحق) is singularized by an attribute, that attribute belongs to Him, and the servant only takes it as a loan (معار). The Real is not partnered in anything He attributes to Himself. But that which is not mentioned with attribution to Allah, you have discretion over it: if you wish, you attribute it to Allah the Exalted, and if you wish, you attribute it to yourself. However, if you have previously attributed that thing to Allah, it is forbidden for you to attribute it to yourself thereafter. For its form in that case is the form of what the Real attributed to Himself, whether He said it initially or spoke it through the tongue of His servant.\n\nIndeed, Allah is present at the tongue of every speaker with what he says, just as He is <<قَائِمٌ عَلَىٰ كُلِّ نَفْسٍ بِمَا كَسَبَتْ>> (Guardian over every soul with what it has earned). [Qur'an 13:33]. Thus, you are the Book (الكتاب) referred to in His saying: <<وَلَدَيْنَا كِتَابٌ يَنطِقُ بِالْحَقِّ>> (And with Us is a Book that speaks the truth). [Qur'an 23:62]. And you are the speaker (الناطق), for He is the distinguishing factor that establishes you within your limit.\n\nAnd how excellent is His saying: <<وَهُمْ لَا يُظْلَمُونَ>> (And they will not be wronged), where He made us known as the Book that speaks the Truth (الحق) and honored us by stating that we are with Him (لديه). And <<مَا عِندَ اللَّهِ بَاقٍ>> (What is with Allah remains) [Qur'an 16:96]. Thus, subsistence (البقاء) belongs to us by virtue of our being with Him, possessing this attribute with which Allah described us: speaking the Truth. For we speak by Allah, and Allah speaks through the tongue of His servant what He causes him to utter.\n\n<<وَبِالْحَقِّ أَنزَلْنَاهُ وَبِالْحَقِّ نَزَلَ>> (And with the Truth We have sent it down, and with the Truth it has descended). [Qur'an 17:105]. And He is the One who says: <<لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا>> (Allah does not burden a soul beyond its capacity). [Qur'an 2:286]. And the soul has encompassed the Real (الحق), which the heavens and the earth were too narrow to contain. And He, glory be to Him, is not burdened by anything. He only described it (the soul) with obligation (التكليف) because, in every state, it is the locus of Majesty (محل جلال) for the Real, by which He speaks, hears, sees, strives, and strikes. Therefore, accepting the excess is an obligation, and capacity (الوسع) lies in giving everything its due right.\n\nBe by Him so that He may be,\nIf you are not, then He is not.\n\nFor you are the creator (خلاق) of Him,\nAnd you are created by \"Be!\" (كن).\n\nIndeed, the discourse does not encompass,\nExcept the hidden discourse.\n\nThey did not submit to the One\nWho said, \"Submit,\" so submit.\n\nTo the God belongs what dwells,\nAnd He is for us the best dwelling.\n\nSo praise be to Allah for what He has bestowed. <<هُوَ لَهُ الْحَمْدُ فِي الْأُولَىٰ وَالْآخِرَةِ>> (To Him belongs praise in the first [life] and the last). [Qur'an 28:70]. And <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way). [Qur'an 33:4].",
    "ur": "باب نمبر پانچ سو بائیس: اس قطب کے حال کی معرفت میں جس کا مقام یہ ہے: \"اور وہ جو دیتے ہیں جو کچھ انہوں نے دیا، اور ان کے دل ڈر رہے ہوتے ہیں کہ وہ اپنے رب کی طرف لوٹنے والے ہیں، یہی لوگ نیکیوں میں سبقت کرنے والے ہیں اور وہ ان کے لیے آگے بڑھنے والے ہیں\" (سورۃ المؤمنون: ۶۰-۶۱)۔\n\n> بے شک دل نیکیوں کے ساتھ خوف (وجل) میں ہوتے ہیں\n> اور جب وہ اسے پاتے ہیں تو شرمندگی (خجل) میں ہوتے ہیں۔\n> پس بندہ اپنے آقا کی رضا میں جلدی کرتا ہے،\n> کیونکہ انسان کو جلد بازی سے پیدا کیا گیا ہے۔\n> سو طبیعت جلدی کرتی ہے اور افکار اسے خوش کرتے ہیں،\n> پس وہ کبھی نہیں دیکھا جاتا کہ آہستہ چلے۔\n> بے شک سبقت کرنا مردانِ کار کا شیوہ ہے، پس جس نے کسی پر سبقت کی، اس نے ایک مرد پر سبقت کی۔\n\nاللہ تعالیٰ نے وارثوں کے بارے میں فرمایا: \"اور ان میں سے بعض نیکیوں میں سبقت کرنے والے ہیں... یہی بہت بڑا فضل ہے\" (وَمِنْهُمْ سَابِقٌ بِالْخَيْرَاتِ ... ذَلِكَ هُوَ الْفَضْلُ الْكَبِيرُ) (سورۃ فاطر: ۳۲)۔ پس \"ھو\" (وہ) کی ضمیر اس سبقت کی طرف لوٹتی ہے جس پر اسم فاعل (سابِقٌ) دلالت کرتا ہے۔\n\n### [خوف (وجل) کا موجب بننے والا سبب]\n\nجان لو کہ ان کے خوف (وجل) کا موجب بننے والا سبب اللہ کا ان کے بارے میں یہ فرمان ہے: \"الَّذِينَ يُؤْتُونَ\" (وہ جو دیتے ہیں)۔ اور یہاں \"ما\" (جو کچھ) کو \"الذی\" (جو) کے معنی میں لیا گیا، پھر \"آتوا\" (انہوں نے دیا) \"ما\" کے بعد آیا، اور اس کا کلام سچا ہے۔ پس ان پر خوف (وجل) طاری ہوا کیونکہ انہوں نے یقین کر لیا کہ اللہ کی اطاعت میں جو کچھ وہ لائے ہیں، اس میں ان پر دعویٰ ضرور قائم ہو گا۔ پس جب وہ اس سے ڈرتے اور خوف زدہ ہوتے ہیں تو اللہ ان کے لیے کشف (الکشف) فرماتا ہے، اور اللہ کا \"ما\" (جو) کے لفظ کو \"ما\" نافیہ (نفی کرنے والا) کے لفظ سے بدل دینا، جیسا کہ اس کے اس فرمان میں ہے: \"اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا\" (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ) (سورۃ الانفال: ۱۷)۔ اسی طرح یہاں خوف (وجل) کا کشف (الکشف) ہوتا ہے: جو کچھ وہ دیتے ہیں، وہ نہیں جو وہ لائے، بلکہ اللہ اسے لایا ہے۔ پس اللہ نے انہیں ان نیک اعمال میں جو وہ لائے، اپنے مقام پر کھڑا کر دیا۔ پھر انہوں نے اپنے تعلیل (سبب بیان کرنے) پر غور کیا، جو اللہ کا یہ فرمان ہے: \"أَنَّهُمْ إِلَىٰ رَبِّهِمْ رَاجِعُونَ\" (کہ وہ اپنے رب کی طرف لوٹنے والے ہیں) اس میں جو وہ لائے، باوجود اس کے کہ اللہ نے انہیں اس سے متصف کیا کہ وہ اسے لائے ہیں۔ پس دیکھو کہ ان کی نظر اس سبب میں کتنی دقیق ہے جس نے ان کے دلوں میں خوف (وجل) پیدا کیا۔ پھر انہوں نے ذکر کو مکمل کیا جیسا کہ اللہ نے انہیں سکھایا: \"أُولَئِكَ\" (یہی لوگ) اشارہ ہے ان کی طرف جو \"يُسَارِعُونَ فِي الْخَيْرَاتِ\" (نیکیوں میں جلدی کرتے ہیں)۔ اور جلدی کرنا اس شخص کا کام ہے جو تیز دوڑ کر (ہرولۃ) آیا، پس سمجھو۔ وہ ذات حق (الحق) کے ساتھ نیکیوں میں جلدی کرتے ہیں، اور \"وَهُمْ لَهَا سَابِقُونَ\" (اور وہ ان کے لیے آگے بڑھنے والے ہیں) یعنی وہ نیکیوں پر سبقت کرتے ہیں اور ان کی طرف سبقت کرتے ہیں۔ پس نیکیاں تین طرح کی ہیں: وہ نیکیاں جن میں سبقت اور جلدی کی جاتی ہے، وہ نیکیاں جن کے ذریعے سبقت کی جاتی ہے، اور وہ نیکیاں جن کی طرف سبقت کی جاتی ہے، جیسا کہ اس کا فرمان ہے: \"مغفرت کی طرف سبقت کرو\" (سَابِقُوا إِلَىٰ مَغْفِرَةٍ) اور \"مغفرت کی طرف جلدی کرو\" (وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ)۔ اور سبقت میں تیزی ضروری ہے، کیونکہ سبقت اسی کا تقاضا کرتی ہے، اور یہ کوشش (سعی) سے بڑھ کر ہے۔ پس ان کا تیزی سے آنا اور کوشش سے زیادہ جو کچھ ہے، وہ صرف تیز دوڑنا (ہرولۃ) ہے، اور یہ ایک صفت الٰہی ہے۔ اور جب ذات حق (الحق) کسی صفت میں منفرد ہو تو وہ اسی کی ہوتی ہے، پس بندہ اسے صرف عاریتاً لیتا ہے، کیونکہ ذات حق (الحق) کسی ایسی چیز میں شریک نہیں ہوتا جسے اس نے اپنی طرف منسوب کیا ہو۔ اور جو چیز اللہ کی طرف منسوب کر کے ذکر نہ کی گئی ہو، اس میں تمہیں تصرف کا اختیار ہے، اگر چاہو تو اسے اللہ تعالیٰ کی طرف منسوب کر دو، اور اگر چاہو تو اپنی طرف منسوب کر دو۔ لیکن اگر تم نے پہلے اسے اللہ کی طرف منسوب کر دیا تو اس کے بعد اسے اپنی طرف منسوب کرنا تم پر حرام ہو جاتا ہے، کیونکہ اس صورت میں اس کی مثال اس چیز کی سی ہے جسے ذات حق (الحق) نے اپنی طرف منسوب کیا ہے۔ پس برابر ہے کہ یہ اس کی طرف سے ابتداء ہو یا اس نے یہ بات اپنے بندے کی زبان پر کہی ہو، کیونکہ اللہ ہر کہنے والے کی زبان کے پاس ہوتا ہے جو وہ کہتا ہے، جیسا کہ وہ \"ہر جان پر اس کے کیے ہوئے کے ساتھ قائم ہے\" (قَائِمٌ عَلَىٰ كُلِّ نَفْسٍ بِمَا كَسَبَتْ) (سورۃ الرعد: ۳۳)۔ پس تم ہی وہ کتاب ہو جس کی طرف اس فرمان میں اشارہ کیا گیا ہے: \"اور ہمارے پاس ایک کتاب ہے جو حق کے ساتھ بولتی ہے\" (وَلَدَيْنَا كِتَابٌ يَنطِقُ بِالْحَقِّ) (سورۃ المؤمنون: ۶۲)۔ اور تم ہی بولنے والے ہو، کیونکہ وہ تمہاری حد میں تمہارے لیے قائم کرنے والا فیصلہ ہے۔ اور اس کا یہ فرمان کتنا عمدہ ہے: \"اور ان پر ظلم نہیں کیا جائے گا\" (وَهُمْ لَا يُظْلَمُونَ) (سورۃ المؤمنون: ۶۲)، جہاں اس نے ہمیں یہ معرفت (المعرفۃ) دی کہ ہم وہ کتاب ہیں جو حق کے ساتھ بولتی ہے، اور ہمیں یہ شرف بخشا کہ ہم اس کے پاس ہیں، اور \"جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے\" (وَمَا عِندَ اللَّهِ بَاقٍ) (سورۃ النحل: ۹۶)۔ پس ہمیں بقا (البقاء) حاصل ہے اس وجہ سے کہ ہم اس صفت پر اس کے پاس ہیں جس سے اللہ نے ہمیں متصف کیا ہے، یعنی حق کے ساتھ بولنا۔ پس ہم اللہ کے ذریعے بولتے ہیں، اور اللہ اپنے بندے کی زبان پر وہی کہتا ہے جو وہ اسے بلواتا ہے۔ \"اور ہم نے اسے حق کے ساتھ نازل کیا اور وہ حق کے ساتھ نازل ہوا\" (وَبِالْحَقِّ أَنزَلْنَاهُ وَبِالْحَقِّ نَزَلَ) (سورۃ الاسراء: ۱۰۵)۔ اور وہ ہی فرمانے والا ہے: \"اللہ کسی جان کو اس کی وسعت (الوسع) سے زیادہ مکلف نہیں کرتا\" (لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا) (سورۃ البقرۃ: ۲۸۶)۔ اور تم نے اس ذات حق (الحق) کو سمو لیا جس سے زمین اور آسمان تنگ ہو گئے، اور وہ سبحانہ کسی چیز سے بوجھل نہیں ہوتا۔ اور اس نے اسے تکلیف (التکلیف) سے اس لیے متصف کیا کہ وہ بہر حال ذات حق (الحق) کے جلال کا محل ہے، جس کے ذریعے وہ بولتا ہے، سنتا ہے، دیکھتا ہے، کوشش کرتا ہے اور پکڑتا ہے۔ پس زائد کو قبول کرنا تکلیف (التکلیف) ہے، اور وسعت (الوسع) ہر چیز کو اس کا حق دینے میں ہے۔\n\n> پس تم اس کے ساتھ ہو جاؤ تاکہ وہ ہو جائے،\n> اگر تم نہ ہو تو وہ بھی نہ ہو۔\n> پس تم اس کے لیے خالق ہو،\n> اور تم \"کُن\" (ہو جا) سے مخلوق ہو۔\n> بے شک بات نے نہیں سمویا،\n> مگر پوشیدہ بات کو۔\n> پس انہوں نے اس کے سامنے سر تسلیم خم نہیں کیا،\n> جس نے کہا: سر تسلیم خم کرو، تو اس نے سر تسلیم خم کیا۔\n> پس اللہ ہی کے لیے ہے جو کچھ ٹھہرا،\n> اور وہ ہمارے لیے بہترین ٹھکانہ ہے۔\n\nپس تمام تعریفیں اللہ کے لیے ہیں اس پر جو اس نے عطا کیا: \"اسی کے لیے حمد ہے دنیا اور آخرت میں\" (هُوَ لَهُ الْحَمْدُ فِي الْأُولَىٰ وَالْآخِرَةِ) (سورۃ القصص: ۷۰)، اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) (سورۃ الاحزاب: ۴)۔",
    "fa": "باب پانصد و بیست و دوم در معرفت حال قطبی که منزل او این آیه بود: «و کسانی که آنچه را دادند، می‌دهند، در حالی که دل‌هایشان ترسان است از اینکه به سوی پروردگارشان باز می‌گردند. آنانند که در خیرات شتاب می‌ورزند و ایشان بر آن پیشی‌گیرنده‌اند.» (الَّذِينَ يُؤْتُونَ ما آتَوْا وقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلى‏ رَبِّهِمْ راجِعُونَ أُولئِكَ يُسارِعُونَ في الْخَيْراتِ وهُمْ لَها سابِقُونَ)\n\nدل‌ها همراه با خیرات در ترس و لرزند\nو چون آن را ملاقات کنند، در شرم و حیایند\n\nپس بنده در خشنودی سرور خود شتاب می‌کند\nزیرا انسان از شتاب آفریده شده است\n\nپس طبع شتاب می‌کند و افکار او را یاری می‌دهند\nو هرگز دیده نمی‌شود که آهسته گام بردارد\n\nهمانا سبقت گرفتن شأن مردان است\nپس هر کس بر دیگری فزونی گیرد، بر مردی فزونی گرفته است\n\nخداوند متعال درباره وارثان می‌فرماید: «و از ایشان پیشی‌گیرنده به خیرات است... این همان فضل بزرگ است.» (وَمِنْهُمْ سابِقٌ بِالْخَيْراتِ ... ذلِكَ هُوَ الْفَضْلُ الْكَبِيرُ) ضمیر «هو» به سبقت بازمی‌گردد که اسم فاعل بر آن دلالت دارد.\n\n### [سبب ایجاب‌کننده ترس و لرز]\n\nبدان که سبب ایجاب‌کننده ترس و لرز (وجل) آنان، سخن خداوند درباره ایشان است: «الَّذِينَ يُؤْتُونَ» (کسانی که می‌دهند). و در اینجا «ما» را به معنای «الذی» (آنچه) قرار داد، سپس «آتوا» (آوردند/دادند) بعد از «ما» آمد و کلام او راست است. پس ترس و لرز (وجل) آنان را درمی‌یابد، زیرا یقین دارند که ناگزیر باید در مورد آنچه از طاعت حق (الحق) آورده‌اند، ادعایی بر ایشان اقامه شود. پس خداوند برای آنان کشف (الکشف) می‌کند، هنگامی که از آن می‌ترسند و به لرزه می‌افتند. و تبدیل کردن لفظ «ما» که به معنای «الذی» است، به لفظ «ما»ی نافیه، مانند این سخن خداوند متعال: «و تو پرتاب نکردی آنگاه که پرتاب کردی، بلکه خدا پرتاب کرد.» (وَما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏). کشف (الکشف) او برای این ترس و لرز (وجل) نیز این‌گونه است: آنچه را که می‌دهند، آنان نیاورده‌اند، بلکه حق (الحق) آن را آورده است. پس خداوند آنان را در آنچه از اعمال صالحه آورده‌اند، در مقام خود قرار داد. سپس به ذکر تعلیل خود نگریستند، و آن این سخن خداوند متعال است: «أَنَّهُمْ إِلى‏ رَبِّهِمْ راجِعُونَ» (که آنان به سوی پروردگارشان باز می‌گردند) در مورد آنچه آورده‌اند، با وجود اینکه خداوند آنان را به وصف کسانی که آن را آورده‌اند، توصیف کرده است. پس بنگر که نظر آنان در سبب قرار گرفتن ترس و لرز (وجل) در دل‌هایشان چقدر دقیق است. سپس ذکر را همان‌گونه که خداوند به آنان آموخته بود، کامل کردند: «أُولئِكَ» (آنان) اشاره به این کسانی است که «يُسارِعُونَ فِي الْخَيْراتِ» (در خیرات شتاب می‌ورزند). و شتاب (إسراع) برای کسی است که با هروله (دویدن سریع) آمده باشد، پس بفهم. آنان در خیرات به حق (الحق) شتاب می‌ورزند و «وَهُمْ لَها سابِقُونَ» (و ایشان بر آن پیشی‌گیرنده‌اند)، یعنی بر آن خیرات سبقت می‌گیرند و به سوی آن سبقت می‌جویند.\n\nپس خیرات سه گونه‌اند: خیراتی که سبقت و شتاب در آن است، و خیراتی که سبقت به واسطه آن است، و خیراتی که سبقت به سوی آن است، و آن همان سخن خداوند است: «به سوی آمرزش سبقت گیرید» (سابِقُوا إِلى‏ مَغْفِرَةٍ) و «به سوی آمرزش بشتابید» (وسارِعُوا إِلى‏ مَغْفِرَةٍ). و سرعت در سبقت ضروری است، زیرا سبقت این را اقتضا می‌کند و آن بالاتر از سعی (تلاش) است. پس آمدن آنان با سرعت و آنچه که بر سعی افزوده می‌شود، چیزی جز هروله (دویدن سریع) نیست، و این صفتی الهی است. و چون حق (الحق) به صفتی منفرد شود، آن صفت از آن اوست، و بنده آن را جز به عاریت نمی‌گیرد، زیرا حق (الحق) در چیزی که به خود نسبت داده، شریک نمی‌شود. و آنچه با نسبت به خداوند ذکر نشده باشد، تو در آن اختیار داری؛ اگر خواستی آن را به خداوند متعال نسبت دهی و اگر خواستی آن را به خود نسبت دهی. اما اگر پیش از این آن را به خداوند نسبت داده باشی، حرام است که پس از آن به خود نسبت دهی، زیرا صورت آن در این حالت، صورت چیزی است که حق (الحق) به خود نسبت داده است. پس فرقی نمی‌کند که آن از جانب او ابتدایی باشد یا آن را بر زبان بنده خود گفته باشد، زیرا خداوند نزد زبان هر گوینده‌ای است به آنچه می‌گوید، همان‌گونه که «بر هر نفسی به آنچه کسب کرده، ناظر است.» (قائِمٌ عَلى‏ كُلِّ نَفْسٍ بِما كَسَبَتْ)\n\nپس تو همان کتابی هستی که در این سخن به آن اشاره شده است: «و نزد ما کتابی است که به حق (الحق) سخن می‌گوید.» (وَلَدَيْنا كِتابٌ يَنْطِقُ بِالْحَقِّ) و تو همان ناطق هستی، زیرا او (حق) جداکننده و قوام‌دهنده تو در حدّ توست. و چه نیکوست سخن او: «و آنان ستم نمی‌شوند.» (وَهُمْ لا يُظْلَمُونَ) آنجا که ما را به عنوان کتابی که به حق (الحق) سخن می‌گوید، معرفی کرد و ما را شرافت بخشید که نزد او هستیم. و «آنچه نزد خداست، باقی است.» (وَما عِنْدَ الله باقٍ) پس بقا (البقاء) برای ماست به واسطه اینکه نزد او هستیم، بر این صفتی که خداوند ما را به آن وصف کرده است، یعنی نطق به حق (الحق). زیرا ما به واسطه خدا سخن می‌گوییم و خداوند آنچه را که بنده خود به آن نطق می‌کند، بر زبان او می‌گوید. و «ما آن را به حق (الحق) نازل کردیم و به حق (الحق) نازل شد.» (وَبِالْحَقِّ أَنْزَلْناهُ وَبِالْحَقِّ نَزَلَ) و اوست که می‌فرماید: «خداوند هیچ نفسی را جز به اندازه توانش تکلیف نمی‌کند.» (لا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها) و حال آنکه تو حق (الحق) را در خود گنجانده‌ای، حقی که زمین و آسمان از گنجاندن آن تنگ آمدند. و او سبحانه را هیچ چیز سنگین نمی‌کند. و او را به تکلیف وصف کرد، زیرا در هر حال، محل جلوه (جلال) حق (الحق) است که به واسطه او نطق می‌کند و می‌شنود و می‌بیند و سعی می‌کند و می‌گیرد. پس پذیرش امر زائد، تکلیف است و وسع (توان) در دادن حق هر چیز است.\n\nپس به او باش تا او باشد\nاگر تو نباشی، پس او نباشد\n\nپس تو آفریننده او هستی\nو تو مخلوق به «کُن» هستی\n\nهمانا سخن جز سخن پنهان را در بر نمی‌گیرد\n\nپس آنان برای کسی که گفت: «خاضع شوید»، خضوع نکردند، پس خاضع شو\n\nپس آنچه ساکن شد، از آنِ خداست\nو او برای ما چه نیکو سکنی‌دهنده‌ای است\n\nپس سپاس خدای را بر آنچه عطا کرد. «حمد در دنیا و آخرت از آن اوست.» (هُوَ لَهُ الْحَمْدُ في الْأُولى‏ والْآخِرَةِ) و «خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}