{
  "id": 111,
  "title": {
    "ar": "الباب الحادي عشر ومائة في ترك الخشوع",
    "en": "Chapter One Hundred and Eleven, Concerning the Abandonment of Reverence (ترك الخشوع)",
    "ur": "گیارہ سو ایکواں باب خشوع کو ترک کرنے کے بیان میں",
    "fa": "باب صد و یازدهم در ترک خشوع"
  },
  "content": {
    "ar": "## (الباب الحادي عشر ومائة في ترك الخشوع)\n\n\n> من تجلى لنفسه كيف يخشع *** وبه تنظر العيون إليه‏\n\n\n> فقوانا قواه من غير شك *** هكذا نص لي الرسول عليه‏\n\n\n### [المحجوب بربه عن ذاته في حال صحوه وإثباته‏]\n\n\nإذا كان العبد في نعت إلهي وورد التجلي عليه وتلقاه بذلك النعت أورثه لذة وفرحا وابتهاجا وسرورا ولم يجد خشوعا ولا ذلة فينسب ذلك الفرح للظاهر في المظهر لا من حيث هو ظاهر فهو سرور بكمال وأثره في المظهر من حيث ما هو مظهر فهو محجوب عن ذاته بربه في حال صحوه وظهوره وحضوره وإثباته وبقائه وترك الخشوع لمن ليست هذه حالته مذموم مطرود\n\n",
    "en": "## Chapter 111: Concerning the Abandonment of Humility (Khushūʿ)\n\nHe who is disclosed to his own self, how can he be humble?\nAnd through him, the eyes look toward Him.\n\nSo He strengthened his strengths without doubt;\nThus did the Messenger stipulate concerning it for me.\n\n### [The one veiled by his Lord from his own Essence during his sobriety and affirmation]\n\nWhen the servant is characterized by a Divine Attribute (نعت إلهي), and the Theophany (التجلي) descends upon him, and he receives it through that Attribute, it causes him to inherit pleasure, joy, delight, and happiness. He finds neither humility (خشوع) nor abasement.\n\nHe attributes that joy to the Manifest (الظاهر) within the locus of manifestation (المظهر), but not insofar as He is the Manifest [in His absolute sense]. Thus, it is a joy derived from perfection, and its effect upon the locus of manifestation is due to the fact that it is a locus of manifestation.\n\nTherefore, he is veiled (محجوب) from his own Essence (ذاته) by his Lord (بربه) during his state of sobriety (صحوه), his manifestation, his presence, his affirmation, and his subsistence (بقائه).\n\nThe abandonment of humility (خشوع) is blameworthy and rejected for anyone whose state is not this.",
    "ur": "## باب ایک سو گیارہ: خشوع (عاجزی) کو ترک کرنے کے بارے میں\n\nجو اپنی ذات پر ظہور الٰہی (التجلی) پائے، وہ کیسے خشوع کرے؟\nاور اسی کے ذریعے نگاہیں اس کی طرف دیکھتی ہیں۔\nپس اس نے ہماری قوتوں کو بلا شک و شبہ مضبوط کیا،\nرسول (صلی اللہ علیہ وسلم) نے میرے لیے اسی طرح نص (حکم) بیان فرمایا ہے۔\n\n### [وہ جو اپنے رب کے ذریعے اپنی ذات سے محجوب ہو، اپنی صحو (ہوشمندی) اور اثبات (قائم رہنے) کی حالت میں]\n\nجب بندہ کسی صفت الٰہی (نعت إلهي) میں ہو اور اس پر ظہور الٰہی (التجلی) وارد ہو، اور وہ اسے اسی صفت کے ساتھ قبول کرے، تو یہ اسے لذت، فرحت، شادمانی اور سرور عطا کرتا ہے، اور وہ اس میں کوئی خشوع (عاجزی) یا ذلت (فروتنی) نہیں پاتا۔ پس وہ اس فرحت کو مظہر (ظہور کی جگہ) میں ظاہر ہونے والے کی طرف منسوب کرتا ہے، نہ کہ اس حیثیت سے کہ وہ ظاہر ہے۔ یہ کمال کا سرور ہے۔ اور مظہر میں اس کا اثر، اس حیثیت سے کہ وہ مظہر ہے، یہ ہے کہ وہ اپنی صحو (ہوشمندی)، ظہور، حضور، اثبات، اور بقا (البقاء) کی حالت میں اپنے رب کے ذریعے اپنی ذات سے محجوب (پردے میں) ہوتا ہے۔ اور خشوع (عاجزی) کو ترک کرنا اس شخص کے لیے مذموم (قابلِ مذمت) اور مردود ہے جس کی یہ حالت نہ ہو۔",
    "fa": "باب صد و یازدهم در ترک خشوع\n\nآنکه بر نفس خود تجلی (التجلی) کند، چگونه خشوع ورزد؟\nو به واسطه اوست که دیدگان به سویش می‌نگرند.\n\nپس قوای ما را بدون شک تقویت کرد،\nاین‌گونه رسول (صلی الله علیه و آله) بر من تصریح نمود.\n\n### [محجوب به پروردگارش از ذات خویش در حال صحو و اثباتش]\n\nهنگامی که بنده در وصفی الهی باشد و تجلی الهی (التجلی) بر او وارد شود و آن را با همان وصف دریافت کند، این امر برای او لذت، شادی، ابتهاج و سرور به ارث می‌آورد و خشوع و ذلتی در خود نمی‌یابد. پس آن شادی را به ظاهرشونده در مظهر نسبت می‌دهد، نه از آن حیث که او ظاهرشونده است. پس آن سرور به کمال است و اثر آن در مظهر از آن حیث است که مظهر می‌باشد. پس او در حال صحو، ظهور، حضور، اثبات و بقای (البقاء) خود، به پروردگارش از ذات خویش محجوب است. و ترک خشوع برای کسی که حالش این‌گونه نیست، مذموم و مطرود است."
  },
  "page_count": 1
}