{
  "id": 539,
  "title": {
    "ar": "الباب التاسع والثلاثون وخمسمائة في معرفة حال قطب كان منزله فَفِرُّوا إِلَى الله",
    "en": "Chapter Five Hundred and Thirty-Nine: Concerning the Gnosis of the State of a Pole (قطب) Whose Station Was: \"Therefore flee unto Allah.\" (فَفِرُّوا إِلَى الله)",
    "ur": "باب پانچ سو انتالیس (۵۳۹) قطب (قطب) کے حال کی معرفت (المعرفۃ) میں، جس کا منزل یہ تھا: \"پس اللہ کی طرف دوڑو (فَفِرُّوا إِلَى الله)\"",
    "fa": "باب پانصد و سی و نهم در معرفت حال قطبی که منزلگاهش «پس به سوی خدا بگریزید» بود."
  },
  "content": {
    "ar": "## «الباب التاسع والثلاثون وخمسمائة في معرفة حال قطب كان منزله فَفِرُّوا إِلَى الله»\n\n\n> كل من فر إلى الله أصاب *** والذي فر من الرحمن خاب‏\n\n\n> استوى عيش الذي قربه *** وإليه وحلا فيه وطاب‏\n\n\n> لو ترى حال الذي أشهده *** عينه حين تجلى في السراب‏\n\n\n> لرأيت الري من أرجائه *** خارجا والساقي من خلف الحجاب‏\n\n\n> كان ظمآنا فلما جاءه *** لم يزل صاحب كأس وشراب‏\n\n\n> لم يجده ماء مزن سائغا *** إنما كان وجود ثم غاب‏\n\n\n> ما حياة الماء إلا عينه *** والذي خالف فيه ما أصاب‏\n\n\n### [إن الله وهب لموسى عليه السلام حكما]\n\n\nموسى عليه السلام لما فر من فرعون حين خاف من الله أن يسلطه عليه لأن الله فَعَّالٌ لِما يُرِيدُ فوهبه الله حكما وهي الرسالة فجعله من المرسلين إلى من خاف أن يسلط عليه وهو فرعون فإذا أنتج له هذا الفرار من المخلوق خوفا على نفسه فأين أنت من المحمدي الذي أمرك أن تفر إلى الله فقيدك بحرف الغاية في القصد الأول فربط لك البداية بالنهاية فقال لنا فَفِرُّوا إِلَى الله فالموسوي يفر من والمحمدي يفر إلى عن أمر الله تعالى إياه بذلك الفرار فما أكمل شرعه وما أعلى رتبته والحكم منقطع والرسالة منقطعة ولذلك‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن الرسالة والنبوة قد انقطعت فلا رسول بعدي ولا نبي‏\n\n\nفيزول الحكم المشروع بزوال الدنيا ويرجع الحكم إلى الله الذي نفر إليه بلا واسطة فالذي ينتج الفرار إليه لا يقدر قدره فإنه كشف محمدي يربي على كشف الرسل من حيث هم رسل عليه السلام فيثبتهم هذا الفار في أماكنهم ويجوز بكشفه فوق رتبة خطاب التكليف فيرى أحدية العين فيقف معها ومنها يستشرف على أحدية الكثرة فيرى أيضا نفسه هناك معهم في أحدية الكثرة فيأمرها على بينة من ربه وبصيرة أن تنتظم في سلك المكلفين فتنصرف النفوس المحسوسة هنا من هؤلاء الفارين إلى الله عن أمرهم فتراهم معصومين محفوظين فالرسل منهم معصومون في خلافهم والأولياء محفوظون في خلافهم فللرسل التشريع وللأولياء الانفعال بحسب ما يشهدونه هنالك فيكونون في خلافهم على بصيرة ولا يدعون إليه وإنما يدعون إلى الله كما تفعل الرسل عليه السلام قال الله تعالى لنبيه أن يقول أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي فما أفرد نفسه بل ذكر اتباعه معه فإنهم لا يكونون أتباعه إلا حتى يكونوا على قدمه فيشهدون ما يشهد ويرون ما يرى فخذوا من العلماء بالله الدعاة إلى الله ما يقولون ولا تنظروا إلى أفعالهم وأحوالهم فإنهم على ما عين الحق لهم غير ذلك لا يكون قال بعض الصالحين في جلساتهم من جالسهم وخالفهم في شي‏ء مما يتحققون به نزع الله نور الايمان من قلبه فليس لجلسائهم إن يفعلوا مثل أفعالهم وإنما عليهم إنهم لا ينازعونهم فيما يظهر عليهم من علم الحقيقة فإن أحوالهم تجري عليها ولذلك قال نزع الله نور الايمان من قلبه فلا يصدقهم فيما يخبرون به عن الحق وهم بهذه المثابة من القرب من الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Thirty-Nine: On the knowledge of the state of a Pole (قطب) whose station was: \"So flee unto Allah\" (فَفِرُّوا إِلَى الله)\n\nEveryone who flees unto Allah attains [the goal],\nWhile he who flees from the All-Merciful is lost.\n\nThe life of him whom He drew near, and [who fled] unto Him, became balanced,\nAnd it became sweet and pure within Him.\n\nIf you could see the state of him whom He caused to witness\nHis Essence (عينه) when He manifested (تجلى) in the mirage (السراب),\n\nYou would see the quenching [of thirst] issuing forth from its regions,\nAnd the Cupbearer [standing] behind the Veil (الحجاب).\n\nHe was thirsty, but when he came to Him,\nHe remained the master of the cup and the drink.\n\nHe did not find it to be palatable rainwater;\nRather, it was Existence (وجود) which then vanished.\n\nThe life of the water is naught but its Essence (عينه),\nAnd he who differs concerning it has not attained [the truth].\n\n***\n\n[Indeed, Allah bestowed judgment (حكما) upon Moses, peace be upon him]\n\nWhen Moses, peace be upon him, fled from Pharaoh, fearing that Allah might empower [Pharaoh] over him—for Allah is <<فَعَّالٌ لِما يُرِيدُ>> (The Doer of what He wills)—Allah bestowed upon him judgment (حكما), which is the Messengership (الرسالة). Thus, He made him one of the Messengers sent to the very one he feared would be empowered over him, namely Pharaoh.\n\nIf this flight from the creature, out of fear for himself, yielded this result for him [Moses], then where are you in relation to the Muhammadan [inheritor] (المحمدي) who commanded you to flee unto Allah? He bound you with the particle of the goal (حرف الغاية) in the primary intention, thereby linking the beginning to the end when He said to us: \"So flee unto Allah\" (فَفِرُّوا إِلَى الله).\n\nThe follower of Moses (الموسوي) flees *from*, while the Muhammadan (المحمدي) flees *unto*, based on Allah Almighty's command to him concerning that flight. How perfect is his Law (شرعه), and how exalted is his rank (رتبته)!\n\nThe judgment (الحكم) is cut off, and the Messengership (الرسالة) is cut off. For this reason, the Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Messengership and Prophethood have been cut off, so there is no messenger after me, nor any prophet.\"\n\nThe prescribed judgment (الحكم المشروع) vanishes with the passing of the world, and the judgment returns to Allah, unto Whom we flee, without intermediary (بلا واسطة).\n\nTherefore, the one who achieves the result of fleeing unto Him—his worth cannot be estimated. For this is a Muhammadan Unveiling (كشف محمدي) that surpasses the unveiling of the Messengers (الرسل) insofar as they are Messengers, peace be upon them.\n\nThis fugitive establishes them [the Messengers] in their stations, and by his unveiling (كشفه), he passes beyond the level (رتبة) of the address of obligation (خطاب التكليف). He sees the Oneness of the Essence (أحدية العين) and stands with it. From this vantage point, he looks out upon the Oneness of Multiplicity (أحدية الكثرة).\n\nHe also sees himself there with them in the Oneness of Multiplicity (أحدية الكثرة). He then commands his soul, based on clear evidence (بينة) and insight (بصيرة) from his Lord, to join the ranks of those under obligation (المكلفين).\n\nThus, the perceptible souls (النفوس المحسوسة) of these fugitives unto Allah turn away here from their [own] command, and you find them infallible (معصومين) and preserved (محفوظين). The Messengers among them are infallible (معصومون) in their opposition [to the lower self], and the Friends of Allah (الأولياء) are preserved (محفوظون) in their opposition. For the Messengers, there is legislation (التشريع), and for the Friends, there is receptivity (الانفعال) according to what they witness (يشهدونه) there [in the Divine Presence].\n\nThus, in their opposition, they possess insight (بصيرة), and they do not call [people] to it [their state], but rather they call unto Allah, just as the Messengers, peace be upon them, do. Allah Almighty commanded His Prophet to say: <<أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي>> (I call unto Allah upon insight (بصيرة)—I and those who follow me).\n\nHe did not single himself out, but mentioned his followers along with him, for they cannot be his followers unless they stand upon his footstep, witnessing what he witnesses and seeing what he sees.\n\nTherefore, take from the Gnostics of Allah (العلماء بالله), the callers unto Allah, what they say, and do not look at their actions (أفعالهم) or their states (أحوالهم), for they are upon what The Real (الحق) has appointed for them, and nothing else can be.\n\nOne of the righteous said concerning their gatherings: \"Whoever sits with them and opposes them in anything by which they are realized (يتحققون به), Allah removes the light of faith (نور الايمان) from his heart.\" It is not incumbent upon those who sit with them to perform actions like theirs; rather, it is incumbent upon them not to dispute with them concerning what manifests upon them of the science of Reality (علم الحقيقة). For their states (أحوالهم) proceed according to it. That is why he said, \"Allah removes the light of faith from his heart,\" meaning that he will not believe them in what they report concerning The Real (الحق), even though they are in this station of nearness to Allah. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر پانچ سو انتالیس: اس قطب (قطب) کے حال کی معرفت میں جس کا مقام یہ تھا: \"فَفِرُّوا إِلَى الله (پس اللہ کی طرف دوڑو)\"\n\nہر وہ شخص جو اللہ کی طرف بھاگا، اس نے منزل پائی\nاور جو رحمن سے بھاگا، وہ ناکام ہوا\n\nاس شخص کی زندگی برابر ہو گئی جسے اس نے قربت دی\nاور جو اس کی طرف ہوا، اس کے لیے شیریں اور پاکیزہ ہو گئی\n\nکاش تم اس شخص کا حال دیکھتے جسے اس نے اپنی آنکھ سے مشاہدہ (الشہود) کرایا\nجب وہ سراب میں ظاہر (التجلی) ہوا\n\nتم اس کے اطراف سے سیرابی کو نکلتے ہوئے دیکھتے\nاور ساقی کو پردے کے پیچھے سے دیکھتے\n\nوہ پیاسا تھا، مگر جب وہ اس کے پاس آیا\nتو وہ ہمیشہ جام و شراب کا مالک رہا\n\nاس نے اسے بادل کا خوشگوار پانی نہیں پایا\nبلکہ وہ محض ایک وجود (الوجود) تھا جو پھر غائب ہو گیا\n\nپانی کی زندگی اس کی ذات (عین) کے سوا کچھ نہیں\nاور جس نے اس میں اختلاف کیا، اس نے درست نہیں پایا\n\n[بیشک اللہ نے موسیٰ علیہ السلام کو حکمت عطا فرمائی]\n\nموسیٰ علیہ السلام جب فرعون سے بھاگے، اس وقت جب انہیں اللہ کا خوف ہوا کہ وہ (اللہ) فرعون کو ان پر مسلط کر دے گا، کیونکہ اللہ فَعَّالٌ لِما يُرِيدُ (جو چاہتا ہے اسے کر گزرنے والا) ہے۔ پس اللہ نے انہیں حکم (حکم) یعنی رسالت عطا فرمائی، اور انہیں ان لوگوں کی طرف رسول بنا کر بھیجا جن کے مسلط ہونے کا انہیں خوف تھا، یعنی فرعون کی طرف۔\n\nجب مخلوق سے یہ فرار، اپنی جان کے خوف سے، ان کے لیے نتیجہ خیز ہوا، تو تم اس محمدی (محمدی) سے کہاں ہو جس نے تمہیں اللہ کی طرف بھاگنے کا حکم دیا؟ پس اس نے تمہیں پہلے مقصد میں حرفِ غایت (إلى) کے ساتھ مقید کر دیا، اور تمہارے لیے ابتدا کو انتہا سے جوڑ دیا، جب اس نے ہم سے فرمایا: فَفِرُّوا إِلَى الله (پس اللہ کی طرف دوڑو)۔ پس موسوی (موسیٰ کے پیروکار) \"سے\" بھاگتا ہے، اور محمدی (محمد صلی اللہ علیہ وسلم کے پیروکار) اللہ تعالیٰ کے حکم سے \"کی طرف\" بھاگتا ہے۔ ان کی شریعت کتنی کامل ہے اور ان کا مرتبہ کتنا بلند ہے!\n\nاور حکم (حکم) منقطع ہے اور رسالت منقطع ہے۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n\"بیشک رسالت اور نبوت منقطع ہو چکی ہے، پس میرے بعد نہ کوئی رسول ہے اور نہ کوئی نبی۔\"\n\nپس دنیا کے زوال کے ساتھ ہی مشروع حکم (حکم) زائل ہو جائے گا، اور حکم (حکم) براہِ راست اس اللہ کی طرف لوٹ جائے گا جس کی طرف ہم بھاگے تھے۔ پس جو شخص اس کی طرف فرار کا نتیجہ حاصل کرتا ہے، اس کی قدر و منزلت کا اندازہ نہیں لگایا جا سکتا، کیونکہ یہ ایک کشف محمدی (کشف محمدی) ہے جو رسولوں کے کشف (کشف) سے، اس حیثیت سے کہ وہ رسول ہیں، بڑھ کر ہے۔\n\nیہ بھاگنے والا انہیں ان کے مقامات پر ثابت قدم رکھتا ہے، اور اپنے کشف (کشف) کے ذریعے خطابِ تکلیف کے مرتبے سے اوپر گزر جاتا ہے۔ پس وہ احدیۃ العین (احدیۃ العین) کو دیکھتا ہے اور اس کے ساتھ ٹھہرتا ہے، اور اسی سے وہ احدیۃ الکثرۃ (احدیۃ الکثرۃ) پر جھانکتا ہے۔ وہ وہاں کثرت کی احدیت (احدیۃ الکثرۃ) میں اپنے آپ کو بھی ان کے ساتھ دیکھتا ہے۔ پس وہ اپنے رب کی طرف سے واضح دلیل اور بصیرت کے ساتھ اسے حکم دیتا ہے کہ وہ مکلفین (شرعی ذمہ داری والے) کے زمرے میں شامل ہو جائے، تو اللہ کی طرف بھاگنے والوں میں سے محسوس نفوس (نفوس محسوسہ) یہاں ان کے حکم سے پھر جاتے ہیں۔ پس تم انہیں معصوم اور محفوظ پاؤ گے۔\n\nپس رسول ان میں سے اپنے خلاف (ظاہری مخالفت) میں معصوم ہوتے ہیں، اور اولیاء محفوظ ہوتے ہیں۔ پس رسولوں کے لیے تشریع (قانون سازی) ہے، اور اولیاء کے لیے انفعال (تاثر پذیری) ہے، اس کے مطابق جو وہ وہاں مشاہدہ (الشہود) کرتے ہیں۔ پس وہ اپنے خلاف میں بصیرت پر ہوتے ہیں اور اس کی طرف دعوت نہیں دیتے، بلکہ وہ اللہ کی طرف دعوت دیتے ہیں جیسا کہ رسول کرتے ہیں۔ اللہ تعالیٰ نے اپنے نبی سے فرمایا کہ وہ کہیں: أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي (میں اللہ کی طرف بصیرت کے ساتھ بلاتا ہوں، میں بھی اور وہ بھی جنہوں نے میری پیروی کی)۔\n\nپس انہوں نے اپنے آپ کو اکیلا نہیں کیا، بلکہ اپنے پیروکاروں کو بھی اپنے ساتھ ذکر کیا، کیونکہ وہ ان کے پیروکار نہیں ہو سکتے جب تک کہ وہ ان کے قدم پر نہ ہوں، پس وہ وہی مشاہدہ (الشہود) کریں جو وہ مشاہدہ کرتے ہیں اور وہی دیکھیں جو وہ دیکھتے ہیں۔ پس تم اللہ کے عالموں (العلماء باللہ) اور اللہ کی طرف بلانے والوں سے وہ لو جو وہ کہتے ہیں، اور ان کے افعال اور احوال کی طرف مت دیکھو، کیونکہ وہ اسی پر ہیں جو الحق (ذات حق) نے ان کے لیے مقرر کر دیا ہے، اس کے علاوہ نہیں ہو سکتا۔ بعض صالحین نے اپنی مجلسوں میں فرمایا: جو شخص ان کے ساتھ بیٹھا اور ان چیزوں میں سے کسی میں ان کی مخالفت کی جن سے وہ متحقق (حقیقت سے آشنا) ہوتے ہیں، تو اللہ اس کے دل سے نورِ ایمان نکال لیتا ہے۔ پس ان کے ہم نشینوں کے لیے یہ ضروری نہیں کہ وہ ان جیسے افعال کریں، بلکہ ان پر یہ لازم ہے کہ وہ ان کے علم الحقیقۃ (علم الحقیقۃ) میں جو کچھ ان پر ظاہر ہوتا ہے، اس میں ان سے جھگڑا نہ کریں۔ کیونکہ ان کے احوال اسی پر جاری ہوتے ہیں، اور اسی لیے انہوں نے فرمایا کہ اللہ اس کے دل سے نورِ ایمان نکال لیتا ہے، تاکہ وہ ان کی تصدیق نہ کرے جو وہ الحق (ذات حق) کے بارے میں خبر دیتے ہیں، حالانکہ وہ اللہ سے قربت کے اس مقام پر فائز ہیں۔ اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "## «باب پانصد و سی و نهم در معرفت حال قطبی که منزلش \"پس به سوی خدا بگریزید\" بود»\n\nهر که به سوی خدا گریخت، به مقصود رسید *** و آن که از رحمان گریخت، زیانکار شد\n\nزندگی کسی که قرب او را یافت، یکسان شد *** و در او شیرین و پاکیزه گشت\n\nاگر حال کسی را ببینی که او را به شهود رساند *** چشمش را، هنگامی که در سراب تجلی کرد\n\nمی‌دیدی که سیرابی از اطرافش *** بیرون می‌آید و ساقی از پشت حجاب است\n\nتشنه بود، اما وقتی به او رسید *** پیوسته صاحب جام و شراب بود\n\nآن را آب گوارای ابر نیافت *** بلکه وجودی بود و سپس غایب شد\n\nحیات آب جز عین آن نیست *** و هر که در آن مخالفت کرد، به مقصود نرسید\n\n### [همانا خداوند به موسی (علیه السلام) حکمتی بخشید]\n\nموسی (علیه السلام) هنگامی که از فرعون گریخت، از این ترسید که خداوند او را بر وی مسلط کند، زیرا خداوند فَعَّالٌ لِما يُرِيدُ (هر چه بخواهد انجام می‌دهد). پس خداوند به او حکمتی بخشید و آن رسالت بود، و او را از فرستادگان به سوی کسی قرار داد که از تسلط او می‌ترسید، یعنی فرعون. حال که این فرار از مخلوق، از ترس جان، برای او چنین نتیجه‌ای داد، تو کجا هستی از محمدی که به تو امر کرد که فَفِرُّوا إِلَى الله (پس به سوی خدا بگریزید)؟ او تو را با حرف غایت (إلى) در قصد اول مقید ساخت و آغاز را به پایان پیوند داد و به ما گفت: فَفِرُّوا إِلَى الله. پس موسوی از چیزی می‌گریزد و محمدی به سوی چیزی می‌گریزد، به امر خداوند متعال به او برای آن فرار. چه کامل است شریعت او و چه بلند است مرتبه‌اش! و حکم (تشریع) منقطع است و رسالت منقطع است، و به همین دلیل:\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا رسالت و نبوت منقطع شده است، پس نه رسولی بعد از من است و نه پیامبری.»\n\nپس حکم مشروع با زوال دنیا از بین می‌رود و حکم به سوی خدا باز می‌گردد، همان کسی که بدون واسطه به سوی او می‌گریزیم. پس کسی که فرار به سوی او چنین نتیجه‌ای می‌دهد، قدر او را نمی‌توان دانست. زیرا آن کشف محمدی است که بر کشف رسولان، از آن حیث که رسول هستند (علیهم السلام)، برتری دارد. این فرارکننده، رسولان را در جایگاه‌هایشان تثبیت می‌کند و با کشف خود از رتبه خطاب تکلیف فراتر می‌رود. پس احدیت عین (أحدية العين) را می‌بیند و با آن می‌ایستد، و از آنجا به احدیت کثرت (أحدية الكثرة) مشرف می‌شود و خود را نیز در آنجا با آنان در احدیت کثرت می‌بیند. پس به نفس‌های محسوس خود، با بینه و بصیرتی از پروردگارش، امر می‌کند که در سلک مکلفین منتظم شوند. در نتیجه، نفوس محسوس این فرارکنندگان به سوی خدا، به امر آنان، از اینجا منصرف می‌شوند. پس آنان را معصوم و محفوظ می‌بینی. رسولان در مخالفت‌هایشان معصوم هستند و اولیا در مخالفت‌هایشان محفوظ. برای رسولان تشریع است و برای اولیا انفعال (تأثیرپذیری) بر حسب آنچه در آنجا شهود می‌کنند. پس آنان در مخالفت‌هایشان بر بصیرت هستند و به آن دعوت نمی‌کنند، بلکه به سوی خدا دعوت می‌کنند، همان‌گونه که رسولان (علیهم السلام) انجام می‌دهند. خداوند متعال به پیامبرش فرمود که بگوید: أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي (من و هر که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). پس او خود را تنها نگذاشت، بلکه پیروانش را نیز با خود ذکر کرد، زیرا آنان پیرو او نخواهند بود مگر آنکه بر قدم او باشند، پس آنچه او شهود می‌کند، شهود کنند و آنچه او می‌بیند، ببینند. پس از علمای بالله که دعوت‌کنندگان به سوی خدا هستند، آنچه را می‌گویند بگیرید و به افعال و احوالشان نگاه نکنید، زیرا آنان بر آنچه حق برایشان تعیین کرده است، هستند و جز آن نمی‌توانند باشند. یکی از صالحان در جلسات خود گفت: هر کس با آنان همنشین شود و در چیزی که بدان متحقق شده‌اند، با آنان مخالفت کند، خداوند نور ایمان را از قلبش برمی‌کَنَد. پس بر همنشینان آنان نیست که مانند افعالشان را انجام دهند، بلکه بر آنان است که در آنچه از علم الحقیقة (علم حقیقت) بر آنان ظاهر می‌شود، با ایشان منازعه نکنند، زیرا احوالشان بر آن جاری است. و به همین دلیل گفت: «خداوند نور ایمان را از قلبش برمی‌کَنَد»، پس او را در آنچه از حق خبر می‌دهند، تصدیق نمی‌کند، در حالی که آنان در این مرتبه از قرب به خدا هستند. و خداوند يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 1
}