{
  "id": 311,
  "title": {
    "ar": "الباب الحادي عشر وثلاثمائة في معرفة منزل النواشئ الاختصاصية الغيبية من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Eleven: Concerning the Knowledge of the Station (منزل) of the Specific (الاختصاصية) Unseen (الغيبية) Emergences (النواشئ) from the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب تین سو گیارہ: حضور محمدی (الحضرة المحمدية) سے غیبی (الغيبية) اختصاصی (الاختصاصية) نشأتوں (النواشئ) کی منزل کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب سیصد و یازدهم در معرفت منزلگاه پدیده‌های اختصاصی غیبی (النواشئ الاختصاصية الغيبية) از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الحادي عشر وثلاثمائة في معرفة منزل النواشئ الاختصاصية الغيبية من الحضرة المحمدية»\n\n\n> دثروني زملوني قول من *** خصه الرحمن بالعلم الحسن‏\n\n\n> حين جلى الروح بالأفق له *** وهو في غار حراء قد سجن‏\n\n\n> نفسه فيه لأمر جاءه *** في غيابات الفؤاد المستكن‏\n\n\n> لتجل قام في خاطره *** صورة مجموعة من كل فن‏\n\n\n> سورة سينية صادية *** جمع السر لديها والعلن‏\n\n\n> فأتى يرجف منها هيبة *** غادة تؤنسه حتى سكن‏\n\n\n> سألته ما الذي أقلقه *** قال أمر قد نفى عني الوسن‏\n\n\n> هو أن الله قد أكرمني *** بالذي أكرم أصحاب اللسن‏\n\n\n> من رسول ونبي مجتبى *** في علوم وبلاء ومحن‏\n\n\n> كلما أحضره في خلدي *** حن قلبي لتجليه وأن‏\n\n\n> فلذا يقلقني مشهده *** ولذا أزهد في دندن دن‏\n\n\nاعلم أنه ليلة تقييدي هذا الباب رأيت رؤيا سررت بها واستيقظت وأنا أنشد بيتا كنت قد عملته قبل هذا في نفسي وهو من باب الفخر وهو\n\n\n> في كل عصر واحد يسمو به *** وأنا لباقي العصر ذاك الواحد\n\n\nوذلك أني ما أعرف اليوم في علمي من تحقق بمقام العبودية أكثر مني وإن كان ثم فهو مثلي فإني بلغت من العبودية غايتها فأنا العبد المحض الخالص لا أعرف للربوبية طعما رى‏ء يوما عتبة الغلام وهو يخطر في مشيته شغل التائه المعجب بنفسه فقيل له يا عتبة ما هذا التيه الذي أنت فيه ولم يكن يعرف هذا منك قبل اليوم فقال وحقيق لمثلي أن يتيه وكيف لا أتيه وقد أصبح لي مولى وأصبحت له عبدا\n\n\n### [أن في كل زمان لا بد من واحد فيه في كل مرتبة متبرز]\n\n\nواعلم أنه في كل زمان لا بد من واحد فيه في كل مرتبة متبرز حتى في أصحاب الصنائع وفي كل علم لو تفقد ذلك الزمان وجد الأمر على ما قلناه والعبودية من جملة المراتب والله سبحانه قد منحنيها هبة أنعم بها علي لم أنلها بعمل بل اختصاص إلهي أرجو من الله أن يمسكها علينا ولا يحول بيننا وبينها إلى أن نلقاه بها فبذلك فليفرحوا هو خير مما يجمعون واعلم أن هذا المنزل منزل النواشئ الاختصاصية وهي عبارة عن بداية وأولية كل مقام وحال قال تعالى ونُنْشِئَكُمْ في ما لا تَعْلَمُونَ فلو كانت إعادة أرواحنا إلى أجسادنا على هذا المزاج الخاص الذي كان لنا في النشأة الدنيا لم يصح قوله تعالى في ما لا تَعْلَمُونَ فإنه قد قال تعالى ولَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولى‏ فَلَوْ لا تَذَكَّرُونَ وقال كَما بَدَأَكُمْ تَعُودُونَ يعني في النشأة الآخرة إنها تشبه النشأة الدنياوية في عدم المثال فإن الله أنشأنا على غير مثال سبق‏\nوكذلك ينشئنا على غير مثال سبق فإن قيل فما فائدة قوله تَعُودُونَ قلنا يخاطب الأرواح الإنسانية إنها تعود إلى تدبير الأجسام في الآخرة كما كانت في الدنيا على المزاج الذي خلق تلك النشأة عليه ويخرجها من قبرها فيها ومن النار حين ينبتون كما تنبت الحبة تكون في حميل السيل مع القدرة منه على إعادة ذلك المزاج لكن ما شاء ولهذا علق المشيئة به فقال تعالى ثُمَّ إِذا شاءَ أَنْشَرَهُ يعني ذلك المزاج الذي كان عليه فلو كان هو بعينه لقال ثم ينشره فنرجع إلى ما نريد أن نبينه من بعض علوم هذا المنزل وهو العلم الذي يدور عليه فنقول إن العالم عالمان والحضرة حضرتان وإن كان قد تولد بينهما حضرة ثالثة من مجموعهما فالحضرة الواحدة حضرة الغيب ولها عالم يقال له عالم الغيب والحضرة الثانية هي حضرة الحس والشهادة ويقال لعالمها عالم الشهادة ومدرك هذا العالم بالبصر ومدرك عالم الغيب بالبصيرة والمتولد من اجتماعهما حضرة وعالم فالحضرة حضرة الخيال والعالم عالم الخيال وهو ظهور المعاني في القوالب المحسوسة كالعلم في صورة اللبن والثبات في الدين في صورة القيد والإسلام في صورة العمد والايمان في صورة العروة وجبريل في صورة دحية الكلبي وفي صورة الأعرابي وتمثل لمريم في صورة بشر سوى كما ظهر السواد في جسم العفص والزاج عند اجتماعهما ولم يكن لهما ذلك الوصف في حال افتراقهما ولذلك كانت حضرة الخيال أوسع الحضرات لأنها تجمع العالمين عالم الغيب وعالم الشهادة فإن حضرة الغيب لا تسع عالم الشهادة فإنه ما بقي فيها خلاء وكذلك حضرة الشهادة فقد علمت إن حضرة الخيال أوسع بلا شك وأنت قد عاينت في حسك وعلى ما تعطيه نشأتك في نفسك المعاني والروحانيين يتخيلون ويتمثلون في الأجساد المحسوسة في نظرك بحيث إذا وقع أثر في ذلك المتصور تأثر المعنى المتصور فيه في نفسه ولا شك إنك أحق بحضرة الخيال من المعاني ومن الروحانيين فإن فيك القوة المتخيلة وهي من بعض قواك التي أوجدك الحق عليها فأنت أحق بملكها والتصرف فيها من المعنى إذ المعنى لا يتصف بأن له قوة خيال ولا الروحانيين من الملإ الأعلى بأن لهم في نشأتهم قوة خيال ومع هذا فلهم التميز في هذه الحضرة الخيالية بالتمثل والتخيل فأنت أولى بالتخيل والتمثل منهم حيث فيك هذه الحضرة حقيقة فالعامة لا تعرفها ولا تدخلها إلا إذا نامت ورجعت القوي الحساسة إليها والخواص يرون ذلك في اليقظة لقوة التحقق بها فتصور الإنسان في عالم الغيب في حضرة الخيال أقرب وأولى ولا سيما وهو في نشأته له في عالم الغيب دخول بروحه الذي هو باطنه وله في عالم الشهادة دخول بجسمه الذي هو ظاهره والروحاني ليس كذلك وليس له دخول في عالم الشهادة إلا بالتمثل في عالم الخيال فيشهده الحس في الخيال صورة ممثلة نوما ويقظة فإن تميز الإنسان في عالم الغيب فله ذلك فإنه يتميز فيه حقيقة لا خيالا من حيث روحه الذي لا يدركه الحس وهو من عالم الغيب وإن أراد أن يتروحن بجسمه ويظهر به في عالم الغيب وجد المساعد وهو روحه المرتبط بتدبيره فهو أقرب إلى التمثل في عالم الغيب من الروحاني المتمثل في صورة عالم الشهادة ولكن هذا المقام يكتسب وينال مثل قضيب البان رحمه الله فلقد كان له هذا المقام ففي قوة الإنسان ما ليس في قوة عالم الغيب فإن في قوة الإنسان من حيث روحه التمثل في غير صورته في عالم الشهادة فيظهر الإنسان في أي صورة شاء من صور بنى آدم أمثاله وفي صور الحيوانات والنبات والحجر وقد وقع ذلك منهم ولقد أخبرني شيخ من شيوخ طريق الله وهو عندي ثقة عدل وفاوضته في هذه المسألة فقال أنا أخبرك بما شاهدته من ذلك تصديقا لقولك وذلك أني صحبت رجلا ممن له هذا المقام ولم يكن عندي من ذلك خبر فسألته الصحبة من بغداد إلى الموصل في ركب الحاج عند رجوعه فقال لي إذا عزمت فلا تبتدئني بشي‏ء من مأكول ومشروب حتى أكون أنا الذي أطلبه منك فعاهدته على ذلك وكان قد أسن فركب في شقة محارة وأنا أمشي على قدمي قريبا منه لئلا تعرض له حاجة إلي فمرض بعلة الإسهال وضعف فصعب ذلك علي وهو لا يتداوى بما يقطعه‏\n\n\nويزيل عنه القيام قال فقلت له يا سيدي أروح لي هذا الرجل الذي على سبيل صاحب سنجار آخذ من المارستان دواء قابضا فنظر إلي كالمنكر وقال الشرط أملك فسكت عنه قال فزاد به الحال فما قدرت على السكوت فلما نزل الركب بالليل وأسرجت المشاعل وقصد صاحب سبيل سنجار وكان خادما أسود وقد وقفت الرجال بين يديه وأصحاب العلل يجيئون إليه يطلبون منه الأدوية بحسب عللهم وأمراضهم فقلت له يا مولاي أرح قلبي وفرج عني بأن تأمرني‏\nآتيك بدواء من عند هذا الرجل قال فتبسم وقال لي رح إليه قال فجئت إليه ولم يكن يعرفني قبل ذلك ولا كنت أنا على حالة وبزة توجب تعظيمي فمشيت إليه وأنا خائف إن يردني أو ينتهرني لما كان فيه من الشغل فوقفت على رأسه بين الناس فلما وقعت عينه علي قام إلي وأقعدني وسلم علي بفرح وبسط وتبشبش وقال ما حاجتك فقلت له عن حال الشيخ ومرضه فاستدعى بالدواء من الوكيل على أكمل ما يمكن واعتذر وقال لي تعنيت وهلا بعثت إلي في ذلك وقمت أخرج من الخيمة فقام لقيامى ومشت المشاعل بين يدي فودعته بعد ما مشى معي خطوات وأمر المشاعلي أن يمشي بالضوء أمامي فقلت له ما الحاجة وخفت من الشيخ أن يعز ذلك عليه فرجع المشاعلي وجئت فوجدت الشيخ على حاله كما تركته فقال لي ما فعلت فقلت له ببركتك أكرمني وهو لا يعرفني ولا أعرفه ووصفت له تفصيل ما كان منه فتبسم الشيخ وقال لي يا حامد أنا أكرمتك ما كان الخادم الذي أكرمك لا شك أني رأيتك كثير الجزع علي لعلتى فأردت إن أريح سرك فأمرتك إن تمشي إليه وخفت عليك منه لئلا يفعل معك ما يفعله مع الناس من الإهانة والطرد فترجع منكسرا فتجردت عن هيكلي وتصورت لك في صورته فأكرمتك وعظمت قدرك وفعلت معك ما رأيت إلى أن انفصلت وهذا دواؤك لا أستعمله فبقيت مبهوتا فقال لي لا تعجل ارجع إليه وانظر إلى ما يفعل بك قال فجئت إليه وسلمت عليه فلم يقبل علي وطردت فذهبت متعجبا فرجعت إلى الشيخ فقصصت إليه ما جرى لي فقال ما قلت لك فقلت له عجبا كيف رجعت خادما أسود فقال الأمر كما رأيت ومثل هذه الحكاية عن الرجال كثير وهذا يشبه علم السيمياء وليس بعلم السيمياء والفرق بيننا في هذا المقام وبين علم السيمياء إنك إذا أكلت بالسيمياء أكلت ولا تجد شبعا والذي يقبض عندك مما تقبضه من هذا العلم أنما ذلك في نظرك ثم تطلبه فلا تجده وإذا أراك صاحب هذا العلم السيماوي تدخل الحمام ثم ترجع إلى نفسك لا ترى لذلك حقيقة بل كل ما تراه بطريق السيمياء إنما هو مثل ما يرى النائم فإذا انتبه لم يجد شيئا مما رآه فإن صاحب علم السيمياء له سلطان وتحكم على خيالك بخواص الأسماء أو الحروف أو القلقطيرات فإن السيمياء لها ضروب أكثفها القلقطيرات وألطفها التلفظ بالكلام الذي يخطف به بصر الناظر عن الحس ويصرفه إلى خياله فيرى مثل ما يرى النائم وهو في يقظته وهذا المقام الذي ذكرناه ليس كذلك فإنك إن أكلت به شبعت وإن مسكت فيه شيئا من ذهب أو ثياب أو ما كان بقي معك على حاله لا يتغير وقد وجدنا هذا المقام من نفوسنا وأخذناه ذوقا في أول سلوكنا مع روحانية عيسى عليه السلام ولهذا\n\n\nقال عليه السلام وقد نهى عن الوصال فقيل له إنك تواصل فقال صَلَّى اللهُ عَليهِ وسَلَّم لست كهيئتكم إني أبيت معي مطعم يطعمني وساق يسقيني وفي رواية يطعمني ربي ويسقيني‏\n\n\nفلم يكن في تلك الجماعة التي خاطبها في ذلك الوقت من له هذا المقام ولم يقل لست كهيئة الناس فكان إذا أكل شبع وواصل على قوة معتادة ولما كان الأكل في حضرة الخيال لا في حضرة الحس صح أن يكون مواصلا وقد رأينا أن جبريل ظهر في صورة الحس رجلا معروفا كظهوره في صورة دحية وفي وقت رجلا غير معروف ولم يبلغنا أنه ظهر في عالم الغيب في الملائكة في صورة غيره من الملائكة فجبريل لا يظهر في الملائكة وفي عالم الغيب في صورة ميكائيل أو إسرافيل ولهذا قال تعالى عنه وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ وقد رأينا من له قوة التمثل من البشر يظهر في البشر في صورة بشر آخر غير صورته فيظهر زيد في صورة عمرو وليس للملك ذلك في عالم الغيب وكما ظهر جبريل في صورة البشر يظهر الإنسان في عالم الغيب عند الملائكة في صورة ملك من الملائكة أي صورة ملك شاء وأعجب من هذا أن بعض الرجال من المحبين من أهل هذه الطريقة دخل على شيخ فتكلم له الشيخ في المحبة وقد رآه بعض الحاضرين قد دخل عليه فما زال ذلك المحب يذوب في نفسه حسا من كلام ذلك الشيخ في المحبة لقوة تحقق ذلك المحب إلى أن رجع بين يدي ذلك الشيخ كفا من ماء فدخل عليه رجال فسألوه عن ذلك المحب أين هو فإنا ما رأيناه خرج فقال هذا الماء هو ذلك المحب الذي بين يدي فنظروا إلى ماء قليل على الحصير بين يدي الشيخ فانظر كيف رجع إلى أصله الذي خلق منه فيا ليت شعري أين تلك الأجزاء\n\n\n### [إذا علم الإنسان أنه على أصل وحقيقة تقبل الصور]\n\n\nفاعلم إن الإنسان في هذا الطريق يعطي من القوة ما يظهر به في هذه النشأة كما يظهر في النشأة الآخرة التي يظهر فيها على أي صورة شاء فإن هذا في أصل هذه الصورة الدنياوية ولكن لا يصل كل واحد إلى معرفة هذا\nالأصل وهو قوله تعالى الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ وهي هذه النشأة الظاهرة ثم قال في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ أي هذه النشأة المسواة المعدلة قابلة لجميع الصور فيجليه الله تعالى في أي صورة شاء فأعلمنا أن هذه النشأة تعطي القبول لأي صورة كانت وكذلك قوله ثُمَّ أَنْشَأْناهُ خَلْقاً آخَرَ بعد الفراغ من تسوية صورة الإنسان الظاهر فعين له صورة من الصور التي في قوته وتركيبه أن يقبلها فإذا علم الإنسان بالكشف الإلهي أنه على أصل وحقيقة تقبل الصور فيتعمل في تحصيل أمر يتوصل به إلى معرفة الأمر فإذا فتح له فيه ظهر في عالم الشهادة في أي صورة من صور عالم الشهادة شاء وظهر في عالم الغيب والملكوت في أي صورة من صوره شاء غير أن الفرق بيننا وبين عالم الغيب إن الإنسان إذا تروحن وظهر للروحانيين في عالم الغيب يعرفون أنه جسم تروحن والناس في عالم الشهادة إذا أبصروا روحا تجسد لا يعلمون أنه روح تجسد ابتداء حتى يعرفوا بذلك كما\n\n\nقال عليه السلام حين دخل عليه الروح الأمين في صورة رجل شديد بياض الثياب شديد سواد الشعر قال الراوي لا يعرفه منا أحد حتى جلس إلى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه وذكر حديث سؤاله إياه عن الإسلام والايمان والإحسان والساعة وما لها من الشروط فلما فرغ من سؤاله قام ينصرف فلما غاب قال النبي صَلَّى اللهُ عَليهِ وسَلَّم لأصحابه أ تدرون من الرجل وفي رواية ردوا على الرجل فالتمس فلم يجدوه فقال صَلَّى اللهُ عَليهِ وسَلَّم هذا جبريل جاء ليعلم الناس دينهم‏\n\n\nغير أن بعض الناس يعرفون الروحاني إذا تجسد من خارج من غيره من الناس أو من جنس تلك الصورة التي يظهر فيها وما كل أحد يعرف ذلك ويفرقون أيضا بين الصورة الروحانية المعنوية المتجسدة وبين الصورة الممثلة من داخل بعلامات يعرفونها وقد علمتها وتحققتها فإني أعرف الروح إذا تجسد من خارج أو من داخل من الصورة الجسمية الحقيقية والعامة لا تعرف ذلك والملائكة كلهم يعرفون الإنسان إذا تروحن وظهر فيهم بصورة أحدهم أو بصورة غريبة لم يروا مثلها فيزيدون على عامة البشر بهذا وينقصهم أن يظهروا في عالمهم على صور بعضهم كما نظهر في عالمنا إذا كان لنا هذا المقام في صورة جنسنا فسبحان العليم الحكيم مقدر الأشياء والقادر عليها لا إله إلا هو العليم القدير\n\n\n### [العلم الإلهي في التجلي الإلهي‏]\n\n\nواعلم أن أصل هذا الأمر الذي ذكرته في هذه المسألة إنما هو من العلم الإلهي في التجلي الإلهي فمن هناك ظهر هذا الأمر في عالم الغيب والشهادة إذ كان العالم بجملته والإنسان بنسخته والملك بقوته على صورة مقام التجلي في الصور المختلفة ولا يعرف حقيقة تلك الصور التي يقع التحول فيها على الحقيقة إلا من له مقام التحول في أي صورة شاء وإن لم يظهر بها وليس ذلك المقام إلا للعبد المحض الخالص فإنه لا يعطيه مقام العبودية أن يتشبه بشي‏ء من صفات سيده جملة واحدة حتى أنه يبلغ من قوته في التحقق بالعبودية أنه يفنى وينسى ويستهلك عن معرفة القوة التي هو عليها من التحول في الصور بحيث أن لا يعرف ذلك من نفسه تسليما لمقام سيده إذ وصف نفسه بذلك ولو لا هذا الأصل الإلهي وأن الحق له هذا وهو في نفسه عليه ما صح أن تكون هذه الحقيقة في العالم إذ يستحيل أن يكون في العالم أمر لا يستند إلى حقيقة إلهية في صورته التي يكون عليها ذلك الأمر ولو كان لكان في الوجود من هو خارج عن علم الله فإنه ما علم الأشياء إلا من علمه بنفسه ونفسه علمه ونحن في علمه كالصور في الهباء لو كنت تعلم يا فتى من أنت علمت من هو إذ لا يعلم الله إلا من يعلم نفسه‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nفالحق علمك من نفسه وأعلمك أنك لا تعرفه إلا من نفسك فمن تفطن لهذا المعنى علم ما تقول وما نومئ إليه فأما حديث التجلي يوم القيامة فأنا أورده إن شاء الله كما ورد في الصحيح وذلك أنه‏\n\n\nخرج مسلم عن أبي سعيد الخدري أن ناسا في زمن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قالوا يا رسول الله هل نرى ربنا يوم القيامة فقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم نعم هل تضارون في رؤية الشمس بالظهيرة ليس معها سحاب وهل تضارون في رؤية القمر ليلة البدر صحوا ليس فيها سحاب قالوا لا يا رسول الله قال كذلك لا تضارون في رؤية الله تبارك وتعالى يوم القيامة إلا كما تضارون في رؤية أحدهما\n\n\nإذا كان يوم القيامة أذن مؤذن لتتبع كل أمة ما كانت تعبد فلا يبقى أحد كان يعبد غير الله من الأصنام والأنصاب إلا ويتساقطون في النار حتى إذا لم يبق إلا من كان يعبد الله من بر وفاجر وغير أهل الكتاب قال فتدعى اليهود فيقال لهم ما كنتم تعبدون قالوا كنا نعبد عزيرا ونقول إنه ابن الله فيقال لهم كذبتم ما اتخذ الله‏\nمن صاحبة ولا ولد فما ذا تبغون قالوا يا رب إنا عطشنا فاسقنا فيشار إليهم أ لا تردون فيحشرون إلى النار كأنها سراب يحطم بعضها بعضا فيتساقطون في النار ثم تدعى النصارى فيقال لهم ما كنتم تعبدون قالوا كنا نعبد المسيح ونقول إنه ابن الله فيقال لهم كذبتم ما اتخذ الله من صاحبة ولا ولد ويقال لهم ما ذا تبغون قالوا عطشنا يا رب فاسقنا قال فيشار إليهم أ لا تردون فيحشرون إلى جهنم كأنها سراب يحطم بعضها بعضا فيتساقطون في النار حتى إذا لم يبق إلا من كان يعبد الله من بر وفاجر فيأتيهم رب العالمين تبارك وتعالى في أدنى صورة من التي رأوه فيها قال فيقول ما ذا تنتظرون لتتبع كل أمة ما كانت تعبد قالوا يا ربنا فارقنا الناس في الدنيا أفقر ما كنا إليهم ولم نصاحبهم قال فيقول أنا ربكم فيقولون نعوذ بالله منك لا نشرك بالله شيئا مرتين أو ثلاثا حتى إن بعضهم ليكاد أن ينقلب فيقول هل بينكم وبين ربكم آية تعرفونها فيقولون نعم قال فيكشف عن ساق فلا يبقى من كان يسجد لله من تلقاء نفسه إلا أذن له بالسجود ولا يبقى من كان يسجد اتقاء ورياء إلا جعل الله ظهره طبقة واحدة كلما أراد أن يسجد خر على قفاه ثم يرفعون رءوسهم وقد تحول في صورته التي رأوه فيها أول مرة فيقول أنا ربكم فيقولون نعم أنت ربنا قال ثم يضرب الجسر على جهنم وتحل الشفاعة الحديث إلى آخره وقد طال الكلام فلنذكر ما يحوي عليه هذا المنزل من العلوم‏\n\n\n### [علم الاسم القيوم‏]\n\n\nفمن ذلك علم الاسم القيوم واختلف فيه أصحابنا هل يتخلق به أم لا فكان الشيخ أبو عبد الله بن جنيد القبر فيقي من كبار مشايخ هذه الطريقة بالأندلس وكان معتزليا سمعته يمنع التخلق به وفاوضته في ذلك مرارا في محله بحضور أصحابه بقبر فيق من أعمال ونده إلى أن رجع إلى قولنا من التخلق بالقيوم كسائر الأسماء الإلهية وفيه علم نش‏ء عالم الغيب وفيه علم مقادير عالم الغيب وفيه علم وصف كلام الله بالتتابع وفيه علم تنزل الأرواح وما يجده من تنزل عليه من الثقل وضيق النفس ولقد كنت انقطعت في القبور مدة منفردا بنفسي فبلغني إن شيخنا يوسف بن يخلف الكرمي قال إن فلانا وسماني ترك مجالسة الأحياء وراح يجالس الأموات فبعثت إليه لو جئتني لرأيت من أجالس فصلى الضحى وأقبل إلي وحده فطلب علي فوجدني بين القبور قاعدا مطرقا وأنا أتكلم على من حضرني من الأرواح فجلس إلى جانبي بأدب قليلا قليلا فنظرت إليه فرأيته قد تغير لونه وضاق نفسه فكان لا يقدر يرفع رأسه من الثقل الذي نزل عليه وأنا أنظر إليه وأتبسم فلا يقدر أن يتبسم لما هو فيه من الكرب فلما فرغت من الكلام وصدر الوارد خفف عن الشيخ واستراح ورد وجهه إلي فقبل بين عيني فقلت له يا أستاذ من يجالس الموتى أنا أو أنت قال لا والله بل أنا أجالس الموتى والله لو تمادى على الحال فطست وانصرف وتركني فكان يقول من أراد أن يعتزل عن الناس فليعتزل مثل فلان وفيه علم استقامة عالم الغيب وعصمته من المخالفة وإنه عالم الوفاق وفيه علم ما تواطأت عليه القوي الإنسانية وعلم ما اختلفت فيه فعين تجمعها وعين تفرقها وفيه علم الأسماء التي تعطي الذكر في كل ذاكر وما حضرتها وما أثرها وفيه علم الانفراد بالحق وما الذي يدعوه إلى ذلك وهل يصح في الملإ الانفراد أو لا يصح إلا بكلية الإنسان ظاهرا وباطنا وفيه علم أسماء الجهات من حضرة الربوبية وفيه علم توحيد كل حضرة وفيه علم ملك الملك وهو علم تصريف الخلق الحق وهو مقام عزيز وفيه علم السياسة في ترك أبناء الجنس وفيه علم الوعيد وفيه علم الرسالة ومن أين بعثت الرسل ولمن بعثت من صفات الإنسان وما مقام الرسول من المرسل إليه وفيه علم الموطن الذي يلحق الأصاغر بالأكابر بالخاصية وهو علم انطواء الزمان كانطواء ألف سنة من الزمان في يوم من أيام الرب وانطواء خمسين ألف سنة من\n\n\nالزمان عندنا في يوم من أيام ذي المعارج وهو كاللمحة في عالمه وكانطواء ثلاثمائة يوم وستين يوما من أيام الزمان المعلوم في يوم من أيام الشمس ولكل كوكب من السيارة والثوابت أيام تقدر لها من الأيام الزمانية بقدر اتساعها وهو من علوم هذا المنزل وفيه علم إثبات المشيئة للعبد من أي حضرة هي وأي اسم إلهي ينظر إليها وفيه علم تقلب الإنسان في عالم الغيب بين دخول وخروج وفيه علم المقادير والأوزان وما يعطي بالكيل والميزان فإنه قد ورد أن العقل يعطي بالمكيال والأعمال بالميزان وفيه علم الرفق بالكون والتخلق به وما اسمه في الأسماء الإلهية وفيه علم عجز العالم عن إدراك ما لا يمكن إدراكه ليتميز بذلك العبد فيعرف قدره وفيه علم السفر والمسافر والطريق وفيه علم ما يسافر من أجله وهل حصوله من عين المنة أم لا وهل يكون‏\nالعالم المكتسب من عين المنة وإن كان فبما ذا يقع الفرقان بين العلمين وكلاهما من عين المنة وفيه علم إنشاء صور الأعمال وفيه علم المقارضة الإلهية ولما ذا يرجع وما فهمت من ذلك طائفة حتى قالت إِنَّ الله فَقِيرٌ ونَحْنُ أَغْنِياءُ حين قال لهم الله وأَقْرِضُوا الله قَرْضاً حَسَناً فقالت إن رب محمد يطلب منا القرض وفيه علم الستر ورحمة الاختصاص والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 311: Concerning the Knowledge of the Station of the Specialized, Unseen Emergences from the Muhammadan Presence\n\n> \"Cover me, wrap me up,\" the saying of one\n> Whom the All-Merciful specialized with beautiful Knowledge.\n> When the Spirit manifested to him on the horizon\n> While he was confined in the Cave of Hira'.\n> His soul was there for a matter that came to him\n> In the hidden depths of the concealed heart (fu'ād).\n> For a Theophany (tajallī) that arose in his inner thought (khāṭir)\n> A comprehensive form gathered from every art.\n> A Surah of Sīn and Ṣād [mystical letters]\n> Where the secret and the manifest are gathered.\n> So he came trembling from its awe\n> A beautiful woman comforted him until he calmed down.\n> She asked him what disturbed him\n> He said, \"A matter that has banished sleep from me.\"\n> \"It is that Allah has honored me\n> With that by which He honored the masters of eloquence,\n> As a Messenger and a chosen Prophet\n> In knowledge, trials, and tribulations.\n> Whenever I bring it to my mind\n> My heart yearns for its Theophany and sighs.\n> Therefore, its witnessing (mashhad) disturbs me\n> And therefore, I renounce the worldly clamor.\"\n\nKnow that on the night I recorded this chapter, I saw a vision that delighted me, and I awoke reciting a verse I had composed previously in my mind, which is a verse of boasting:\n\n> In every age, there is one who elevates it,\n> And I am that one for the rest of the age.\n\nThis is because I do not know anyone today, in my knowledge, who has realized the station of Servitude (maqām al-'ubūdiyya) more fully than I have. If there is anyone, he is my equal. I have reached the ultimate limit of Servitude, so I am the pure, unadulterated servant (العبد المحض الخالص). I know no taste of Lordship (الربوبية).\n\n'Utbah the youth was once seen strutting in his walk, preoccupied like one lost and self-admiring. He was asked, \"O 'Utbah, what is this arrogance (tīh) you display? We have not known this from you before today.\" He replied, \"It is fitting for one like me to be arrogant! How can I not be arrogant when I have acquired a Master (Mawlā) and I have become His servant?\"\n\n### [That in every time, there must be one manifest individual in every level]\n\nKnow that in every time, there must be one manifest individual (mutabarriz) in every level (martaba), even among the masters of crafts and in every science. If that time were examined, the matter would be found to be as we have stated. Servitude (العبودية) is one of these levels. Allah, the Glorified, has granted it to me as a gift, a favor He bestowed upon me. I did not attain it through action, but through Divine specialization (اختصاص إلهي). I ask Allah to maintain it for us and not to separate us from it until we meet Him with it. <<فَبِذَلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ>> (In that let them rejoice; it is better than what they accumulate).\n\nKnow that this station (manzil) is the station of the Specialized Emergences (النواشئ الاختصاصية). It is an expression for the beginning and origin (awwaliyya) of every spiritual station (maqām) and state (ḥāl). The Exalted said: <<وَنُنْشِئَكُمْ فِي مَا لَا تَعْلَمُونَ>> (And We will produce you in that which you do not know). If the return of our souls to our bodies were upon the same specific temperament (mizāj) that we had in the worldly emergence (al-nash'a al-dunyā), His saying, \"in that which you do not know,\" would not be correct. For He, the Exalted, said: <<وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى فَلَوْلَا تَذَكَّرُونَ>> (And you have already known the first emergence, so why do you not remember?) And He said: <<كَمَا بَدَأَكُمْ تَعُودُونَ>> (As He originated you, you will return). This means that the Hereafter's emergence (al-nash'a al-ākhira) resembles the worldly emergence in the absence of a precedent (mithāl), for Allah originated us without a prior example. Likewise, He will produce us without a prior example. If it is asked, \"What is the benefit of His saying, 'you will return'?\" We reply: He addresses the human souls, stating that they will return to the governance of bodies in the Hereafter, just as they were in the world, upon the temperament upon which that emergence was created. He brings them forth from their graves within it, and from the Fire, when they sprout, just as a seed sprouts when carried by the flood. This is despite His ability to restore that exact temperament, but He wills otherwise. Therefore, He linked the resurrection to His Will, saying: <<ثُمَّ إِذَا شَاءَ أَنْشَرَهُ>> (Then, when He wills, He resurrects him). This refers to the temperament upon which he was. If it were the exact same temperament, He would have said, \"Then He resurrects it.\"\n\nWe return now to what we wish to clarify concerning some of the sciences of this station, which is the science around which it revolves. We say that the World (العالم) consists of two worlds, and the Presence (الحضرة) consists of two Presences, even though a third Presence is generated between them from their combination. The first Presence is the Presence of the Unseen (حضرة الغيب), and it has a world called the World of the Unseen (عالم الغيب). The second Presence is the Presence of the Senses and Witnessing (حضرة الحس والشهادة), and its world is called the World of Witnessing (عالم الشهادة). The perception of this world is through sight (baṣar), and the perception of the World of the Unseen is through insight (baṣīra).\n\nThat which is generated from their combination is a Presence and a World. The Presence is the Presence of Imagination (حضرة الخيال), and the World is the World of Imagination (عالم الخيال). This is the manifestation of meanings (al-ma'ānī) in sensible forms (al-qawālib al-maḥsūsa), such as Knowledge (العلم) in the form of milk, steadfastness in religion in the form of a shackle, Islam in the form of pillars, faith (الإيمان) in the form of a handle (al-'urwa), Gabriel in the form of Diḥya al-Kalbī or in the form of a Bedouin, and his manifestation to Mary in the form of a perfect human being. This is just as blackness appears in the body of gallnuts and vitriol when they combine, a quality they did not possess when separated. Therefore, the Presence of Imagination is the most expansive of the Presences because it gathers the two worlds: the World of the Unseen and the World of Witnessing. The Presence of the Unseen does not encompass the World of Witnessing, for there is no emptiness remaining in it. Likewise, the Presence of Witnessing [does not encompass the Unseen]. Thus, you know that the Presence of Imagination is undoubtedly the most expansive.\n\nYou have witnessed, through your senses and according to what your own emergence grants you, that meanings and spiritual beings (الروحانيين) imagine and manifest themselves in sensible bodies before your eyes, such that if an effect occurs upon that imagined form, the meaning represented within it is affected in its essence. Undoubtedly, you are more entitled to the Presence of Imagination than the meanings or the spiritual beings, for the imaginative faculty (القوة المتخيلة) is within you, being one of the powers upon which the Real (الحق) created you. Thus, you are more entitled to possess and dispose of it than the meaning is, since the meaning is not described as having an imaginative faculty, nor are the spiritual beings of the Highest Assembly (الملإ الأعلى) described as having an imaginative faculty in their emergence. Yet, they possess distinction in this Imaginative Presence through manifestation and imagination. Therefore, you are more deserving of imagination and manifestation than they are, as this Presence exists truly within you.\n\nThe common people (العامة) do not know this Presence and do not enter it except when they sleep and the sensory faculties return to it. The elite (الخواص) see this while awake, due to the strength of their realization (taḥaqquq) of it. Thus, the imaging of the human being in the World of the Unseen, within the Presence of Imagination, is closer and more appropriate, especially since, in his emergence, he has entry into the World of the Unseen through his spirit (rūḥ), which is his inner aspect, and he has entry into the World of Witnessing through his body, which is his outer aspect. The spiritual being is not like this; he has no entry into the World of Witnessing except by manifesting himself in the World of Imagination, so the senses witness him in Imagination as a represented form, whether asleep or awake.\n\nIf the human being distinguishes himself in the World of the Unseen, he possesses that ability, for he distinguishes himself there truly, not imaginatively, by virtue of his spirit, which the senses do not perceive and which belongs to the World of the Unseen. If he wishes to become spiritualized (yatarawḥan) with his body and appear with it in the World of the Unseen, he finds an assistant, which is his spirit linked to his governance. Thus, he is closer to manifestation in the World of the Unseen than the spiritual being manifesting in the form of the World of Witnessing.\n\nHowever, this station is acquired and attained, such as by Qaḍīb al-Bān, may Allah have mercy on him, who possessed this station. For in the power of the human being is what is not in the power of the World of the Unseen. For in the power of the human being, by virtue of his spirit, is the ability to manifest in a form other than his own in the World of Witnessing. Thus, the human appears in any form he wishes, whether in the forms of his fellow children of Adam, or in the forms of animals, plants, or stone. This has indeed occurred among them.\n\nA Shaykh among the masters of the Path of Allah, whom I consider trustworthy and just, informed me, and I discussed this matter with him. He said, \"I will tell you what I witnessed concerning this, confirming your statement. I accompanied a man who possessed this station, and I had no prior knowledge of it. I asked him to accompany me from Baghdad to Mosul with the pilgrim caravan upon its return. He told me, 'If you resolve to do this, do not offer me anything to eat or drink until I am the one who asks it of you.' I promised him that. The man was elderly and rode in a litter, while I walked on foot close to him so that he would not need anything from me. He fell ill with diarrhea and became weak. This was difficult for me, as he would not treat himself with anything that would stop it or relieve him of standing.\n\n\"I said to him, 'My master, allow me to go to this man who is in charge of the road of the master of Sinjār, and I will get an astringent medicine from the hospital.' He looked at me disapprovingly and said, 'The condition (sharṭ) is binding.' So I remained silent. His condition worsened, and I could not remain silent. When the caravan stopped at night, and the torches were lit, I sought out the man in charge of the road of the master of Sinjār. He was a black servant, and men were standing before him, and the sick were coming to him, asking for medicines according to their ailments and diseases. I said to the Shaykh, 'My Master, relieve my heart and ease my distress by ordering me to bring you medicine from this man.' He smiled and said to me, 'Go to him.'\n\n\"I went to him, and he did not know me before, nor was I in a state or attire that commanded respect. I walked toward him, fearing he might reject me or scold me due to his preoccupation. I stood by his head among the people. When his eye fell upon me, he stood up, seated me, and greeted me with joy, openness, and kindness. He asked, 'What is your need?' I told him about the Shaykh's condition and illness. He requested the medicine from the agent in the most complete manner possible, apologized, and said, 'You have troubled yourself; why did you not send for me?' I stood up to leave the tent, and he stood up when I did. The torchbearers walked before me. I bade him farewell after he walked a few steps with me and ordered the torchbearer to walk with the light ahead of me. I told him there was no need [for the light], fearing the Shaykh would find this excessive. The torchbearer returned, and I came back and found the Shaykh in the same state I had left him.\n\n\"He asked me, 'What did you do?' I replied, 'By your blessing, he honored me, though he neither knew me nor did I know him.' I described to him the details of what had happened. The Shaykh smiled and said to me, 'O Ḥāmid, *I* honored you, not the servant who honored you. Undoubtedly, I saw you were greatly distressed by my illness, so I wanted to relieve your heart. I ordered you to go to him, but I feared for you that he might treat you with the humiliation and rejection he shows to others, causing you to return broken. So, I stripped myself of my physical form (haykalī) and manifested myself to you in his image. I honored you, magnified your status, and did with you what you saw until you departed. And this medicine of yours, I will not use it.'\n\n\"I remained stunned. He said to me, 'Do not rush. Go back to him and see what he does to you.' I went to him and greeted him, but he did not acknowledge me and drove me away. I left astonished. I returned to the Shaykh and recounted what had happened. He said, 'Did I not tell you?' I said, 'Astonishing! How did you return to being a black servant?' He replied, 'The matter is as you saw.' Many such stories are related about the Men [of Allah].\"\n\nThis resembles the science of Sympathy (علم السيمياء) but is not the science of Sympathy. The difference between us in this station and the science of Sympathy is that if you eat by means of Sympathy, you eat but find no satiety. And if the master of this Sympathetic science (al-sīmāwī) shows you that you enter a bathhouse, then you return to yourself and see no reality in that. Rather, everything you see through Sympathy is merely like what a sleeper sees; when he wakes up, he finds nothing of what he saw. The master of the science of Sympathy has authority and control over your imagination (khayāl) through the specific properties (khawāṣṣ) of Names, Letters, or *Qalqīṭarāt* [a type of talisman]. Sympathy has various forms; the densest are the *Qalqīṭarāt*, and the subtlest is the utterance of speech that snatches the sight of the observer away from the senses and directs it to his imagination, so he sees what a sleeper sees while he is awake.\n\nThis station that we have mentioned is not like that. If you eat by means of it, you become satiated. If you grasp something in it—whether gold, clothing, or anything else—it remains with you unchanged. We found this station within our own souls and took it by direct experience (dhawq) at the beginning of our spiritual journey (sulūk), in connection with the spirituality of Jesus (عليه السلام). This is why, when he (the Prophet Muhammad) forbade continuous fasting (al-wiṣāl) and was told, \"But you practice continuous fasting,\" he (صَلَّى اللهُ عَليهِ وسَلَّم) said: \"I am not like you. I spend the night with one who feeds me and a cupbearer who gives me drink.\" In another narration: \"My Lord feeds me and gives me drink.\" There was no one in the group he addressed at that time who possessed this station, and he did not say, \"I am not like people in general.\" Thus, when he ate, he was satiated and continued fasting with accustomed strength. Since the eating occurred in the Presence of Imagination (حضرة الخيال) and not in the Presence of the Senses (حضرة الحس), it was correct for him to be considered continuously fasting.\n\nWe have seen that Gabriel appeared in a sensible form as a known man, such as his appearance in the form of Diḥya, and at times as an unknown man. However, it has not reached us that he appeared in the World of the Unseen among the angels in the form of another angel. Gabriel does not appear among the angels or in the World of the Unseen in the form of Michael or Israfil. This is why the Exalted said concerning them: <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ>> (And there is none of us except that he has a known station). We have seen that a human being who possesses the power of manifestation (quwwat al-tamaththul) appears among humans in the form of another human being, different from his own form—so Zayd appears in the form of 'Amr. The angel does not possess this ability in the World of the Unseen. Just as Gabriel appeared in the form of a human, the human being appears in the World of the Unseen before the angels in the form of an angel—in the form of any angel he wishes.\n\nMore astonishing than this is that one of the men, a lover (muḥibb) belonging to this Path, entered upon a Shaykh. The Shaykh spoke to him about Love (al-maḥabba). Some of those present saw him enter. That lover continued to dissolve physically within himself due to the Shaykh's discourse on Love, owing to the strength of the lover's realization, until he was reduced to a handful of water before the Shaykh. Then men entered and asked the Shaykh about that lover, asking where he was, for they had not seen him leave. The Shaykh said, \"This water before me is that lover.\" They looked at the small amount of water on the mat before the Shaykh. Look how he returned to the origin from which he was created. Oh, would that I knew where those particles went!\n\n### [When the human knows that he is upon an origin and reality that accepts forms]\n\nKnow that the human being on this Path is granted a power by which he appears in this emergence (nash'a), just as he will appear in the Hereafter's emergence, where he will appear in any form he wishes. This is inherent in the origin of this worldly form, but not everyone attains knowledge of this origin. This origin is His saying, the Exalted: <<الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ>> (Who created you, fashioned you, and balanced you). This refers to this manifest emergence. Then He said: <<فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ>> (In whatever form He willed, He assembled you). That is, this fashioned and balanced emergence is receptive to all forms, so Allah manifests him in any form He wills. Thus, He informed us that this emergence grants acceptance to any form whatsoever. Likewise, His saying: <<ثُمَّ أَنْشَأْنَاهُ خَلْقًا آخَرَ>> (Then We produced him as another creation), after completing the fashioning of the manifest human form. He designated for him a form from the forms that his power and composition are capable of accepting.\n\nWhen the human being knows, through Divine Unveiling (الكشف الإلهي), that he is upon an origin and a reality that accepts forms, he strives to attain a matter by which he reaches the knowledge of that matter. When it is opened for him, he appears in the World of Witnessing in any form of the World of Witnessing he wishes, and he appears in the World of the Unseen and the Dominion (الملكوت) in any form of its forms he wishes.\n\nHowever, the difference between us and the World of the Unseen is that when a human being spiritualizes himself (yatarawḥan) and appears to the spiritual beings in the World of the Unseen, they know that he is a body that has spiritualized itself. Whereas people in the World of Witnessing, when they see a spirit embodied (tajasada), do not know initially that it is an embodied spirit until they are informed of it, as the Prophet (عليه السلام) said when the Trustworthy Spirit (الروح الأمين, i.e., Gabriel) entered upon him in the form of a man with intensely white clothes and intensely black hair. The narrator said: \"None of us knew him until he sat down next to the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم), rested his knees against his knees, and placed his palms on his thighs.\" He then mentioned the Ḥadīth of his questioning him about Islam, Faith (الإيمان), Excellence (الإحسان), and the Hour and its signs. When he finished his questioning, he stood up to leave. When he disappeared, the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said to his Companions, \"Do you know who that man was?\" In one narration: \"Bring the man back to me.\" They searched but did not find him. Then he (صَلَّى اللهُ عَليهِ وسَلَّم) said, \"That was Gabriel, who came to teach the people their religion.\"\n\nHowever, some people recognize the spiritual being (الروحاني) when he embodies himself externally, whether in the form of another person or in the form of the species in which he appears. Not everyone knows this. They also distinguish between the embodied spiritual, meaningful form and the form manifested internally, by signs they recognize. I have known and realized these signs. I can recognize the spirit when it embodies itself externally or internally, distinguishing it from the true physical form, whereas the common people do not know this. All the angels recognize the human being when he spiritualizes himself and appears among them, whether in the form of one of them or in a strange form they have never seen. They surpass the common people in this, but they are deficient in that they cannot appear in their own world in the forms of one another, whereas we, if we possess this station, can appear in our world in the form of our own species. Glory be to the All-Knowing, the Wise (العليم الحكيم), the Ordainer of things and the One Capable of them. There is no god but He, the All-Knowing, the All-Powerful (العليم القدير).\n\n### [Divine Knowledge in the Divine Theophany]\n\nKnow that the origin of this matter which I have mentioned in this discussion is derived solely from Divine Knowledge (العلم الإلهي) within the Divine Theophany (التجلي الإلهي). From there, this matter appeared in the World of the Unseen and the World of Witnessing, since the World in its entirety, the Human being in his archetype (nuskhah), and the Angel in his power, are all upon the form of the station of Theophany (maqām al-tajallī) in various forms.\n\nThe reality of those forms in which transformation occurs is not truly known except by one who possesses the station of transformation into any form he wishes, even if he does not manifest in it. And that station belongs only to the pure, unadulterated servant (العبد المحض الخالص). For the station of Servitude does not permit him to resemble any of the Attributes (الصفات) of his Master entirely. He reaches such a strength in the realization of Servitude that he is annihilated (yafna), forgets, and is consumed (yastahlik) from the knowledge of the power he possesses regarding transformation into forms, such that he does not know this about himself, in submission to the station of his Master, since He described Himself with that [power of transformation].\n\nWere it not for this Divine Origin, and that the Real (الحق) possesses this and is upon it in His Essence (Dhāt), this reality could not exist in the World. For it is impossible for there to be anything in the World that does not rely upon a Divine Reality (حقيقة إلهية) in the form that that thing takes. If it were otherwise, there would be something in Existence (الوجود) that is outside the Knowledge of Allah. He only knew things from His Knowledge of Himself, and His Essence is His Knowledge. We, in His Knowledge, are like forms in the primordial dust (al-habā'). O youth, if you knew who you are, you would know Who He is, for none knows Allah except he who knows himself.\n\nHe (صَلَّى اللهُ عَليهِ وسَلَّم) said: \"Whoever knows himself knows his Lord.\"\n\nThus, the Real taught you from His Essence and informed you that you do not know Him except through yourself. Whoever grasps this meaning knows what we say and what we allude to.\n\nAs for the Ḥadīth of the Theophany on the Day of Resurrection, I shall cite it, if Allah wills, as it was reported in the *Ṣaḥīḥ* [collection]. Muslim reported from Abū Sa'īd al-Khudrī that some people during the time of the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) asked, \"O Messenger of Allah, shall we see our Lord on the Day of Resurrection?\" The Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) said, \"Yes. Do you suffer any difficulty in seeing the sun at noon when there are no clouds? And do you suffer any difficulty in seeing the moon on the night of the full moon when the sky is clear and there are no clouds?\" They said, \"No, O Messenger of Allah.\" He said, \"Likewise, you will not suffer any difficulty in seeing Allah, the Blessed and Exalted, on the Day of Resurrection, except as you suffer difficulty in seeing one of them.\"\n\nWhen the Day of Resurrection comes, a caller will announce that every nation should follow what it used to worship. No one who worshipped other than Allah—idols or stones—will remain except that they will fall into the Fire, until only those who worshipped Allah remain, whether righteous or wicked, and the People of the Book. Then the Jews will be called, and it will be said to them, \"What did you used to worship?\" They will say, \"We used to worship 'Uzayr, and we say he is the son of Allah.\" It will be said to them, \"You lied. Allah has taken neither a consort nor a son. What do you desire?\" They will say, \"O Lord, we are thirsty, so give us drink.\" It will be pointed out to them, \"Will you not go to the watering place?\" They will be gathered toward the Fire, which will appear like a mirage, crushing itself, and they will fall into the Fire. Then the Christians will be called, and it will be said to them, \"What did you used to worship?\" They will say, \"We used to worship the Messiah, and we say he is the son of Allah.\" It will be said to them, \"You lied. Allah has taken neither a consort nor a son.\" It will be said to them, \"What do you desire?\" They will say, \"We are thirsty, O Lord, so give us drink.\" It will be pointed out to them, \"Will you not go to the watering place?\" They will be gathered toward Hell, which will appear like a mirage, crushing itself, and they will fall into the Fire.\n\nUntil only those who worshipped Allah remain, whether righteous or wicked. Then the Lord of the Worlds, the Blessed and Exalted, will come to them in the lowest form (adnā ṣūra) in which they had seen Him. He will say, \"What are you waiting for? Let every nation follow what it used to worship.\" They will say, \"O our Lord, we separated ourselves from people in the world when we were most in need of them, and we did not accompany them.\" He will say, \"I am your Lord.\" They will say, \"We seek refuge in Allah from you. We do not associate anything with Allah,\" two or three times, until some of them are almost turned away. He will say, \"Is there a sign (āya) between you and your Lord by which you recognize Him?\" They will say, \"Yes.\" He said, \"Then He will uncover a shin (sāq). No one who used to prostrate to Allah willingly will remain except that he will be permitted to prostrate. And no one who used to prostrate out of fear or hypocrisy (riyā') will remain except that Allah will make his back a single layer; whenever he tries to prostrate, he will fall backward onto his nape.\" Then they will raise their heads, and He will have transformed into the form in which they first saw Him. He will say, \"I am your Lord.\" They will say, \"Yes, You are our Lord.\" Then the bridge (al-jisr) will be laid over Hell, and intercession (al-shafā'a) will be permitted. The Ḥadīth continues to its end. The discussion has become lengthy, so let us mention the sciences contained within this station.\n\n### [The Science of the Name al-Qayyūm]\n\nAmong these is the science of the Name al-Qayyūm (The Self-Subsisting/The Sustainer). Our companions differed on whether one can acquire the character (takhalluq) of this Name or not. Shaykh Abū 'Abd Allāh ibn Junayd al-Qabarfīqī, one of the great masters of this Path in al-Andalus, who was a Mu'tazilī, I heard him forbid acquiring its character. I debated him on this matter repeatedly in his place, in the presence of his companions in Qabarfīq, in the district of Wanda, until he reverted to our view that one can acquire the character of al-Qayyūm, like all other Divine Names.\n\nIt contains the science of the emergence (nash') of the World of the Unseen (عالم الغيب). It contains the science of the measures (maqādīr) of the World of the Unseen. It contains the science of describing the Speech of Allah (kalām Allāh) by succession (al-tatābu'). It contains the science of the descent of spirits (tanazzul al-arwāḥ) and the heaviness (al-thiql) and constriction of the soul (ḍīq al-nafs) experienced by the one upon whom they descend.\n\nI had isolated myself in the cemeteries for a period, alone. It reached me that our Shaykh, Yūsuf ibn Yakhluf al-Karmī, said that so-and-so (naming me) had abandoned the company of the living and gone to keep company with the dead. I sent word to him: \"If you came to me, you would see whom I keep company with.\" He prayed the forenoon prayer (al-ḍuḥā) and came toward me alone. He searched for me and found me sitting among the graves, head bowed, speaking to the spirits (al-arwāḥ) who were present with me. He sat down beside me respectfully, little by little. I looked at him and saw that his color had changed and his breathing was constricted. He could not lift his head due to the heaviness that had descended upon him. I looked at him and smiled, but he could not smile due to the distress he was experiencing. When I finished speaking and the spiritual influx (al-wārid) departed, the heaviness was lifted from the Shaykh, and he rested. He turned his face toward me and kissed me between my eyes. I said to him, \"O Master, who is keeping company with the dead, me or you?\" He said, \"No, by Allah, rather I am keeping company with the dead. By Allah, if that state had continued, I would have perished.\" He departed and left me. Thereafter, he used to say, \"Whoever wishes to withdraw from people should withdraw like so-and-so.\"\n\nIt contains the science of the rectitude (istiqāma) of the World of the Unseen and its immunity (iṣma) from opposition, and that it is the World of Concord (al-wifāq). It contains the science of what the human faculties (القوي الإنسانية) agree upon, and the science of what they differ upon, specifying their gathering and specifying their separation. It contains the science of the Names (الأسماء) that grant remembrance (al-dhikr) to every rememberer (dhākir), what their Presence (ḥaḍra) is, and what their effect is. It contains the science of being alone with the Real (الإنفراد بالحق), and what calls one to that, and whether isolation (al-infrād) is valid in the public assembly (al-Malā') or if it is only valid through the totality of the human being, outwardly and inwardly. It contains the science of the names of the directions (jihāt) from the Presence of Lordship (حضرة الربوبية). It contains the science of the Unity (توحيد) of every Presence. It contains the science of the King of Dominion (malik al-mulk), which is the science of the Real's (الحق) disposal of Creation (تصريف الخلق), and it is a precious station (maqām 'azīz).\n\nIt contains the science of governance (al-siyāsa) in abandoning the children of one's own species. It contains the science of the Threat (الوعيد). It contains the science of Messengership (الرسالة): from where the Messengers were sent, and to whom they were sent among the attributes of the human being, and what the station of the Messenger is in relation to the one sent to him. It contains the science of the place (al-mawṭin) where the lesser ones join the greater ones by specialization (الخاصية). This is the science of the folding of time (انطواء الزمان), such as the folding of a thousand years of time into one of the days of the Lord, and the folding of fifty thousand years of time, according to us, into one of the days of the Possessor of the Ascending Stairways (Dhī al-Ma'ārij), which is like a glance in His world. And like the folding of three hundred and sixty days of known time into one of the days of the Sun. Every planet, whether wandering or fixed, has days measured for it from the temporal days according to its breadth. This is among the sciences of this station.\n\nIt contains the science of affirming the Will (المشيئة) for the servant: from which Presence it originates, and which Divine Name oversees it. It contains the science of the human being's fluctuation in the World of the Unseen between entry and exit. It contains the science of measures (المقادير) and weights (الأوزان), and what is given by measure (al-kayl) and balance (al-mīzān). For it has been reported that intellect ('aql) is given by the measure, and deeds (al-a'māl) by the balance. It contains the science of gentleness (الرفق) toward the Cosmos (الكون) and acquiring its character (takhalluq), and what its name is among the Divine Names. It contains the science of the world's inability to perceive what cannot be perceived, so that the servant may be distinguished by this and know his worth.\n\nIt contains the science of travel (السفر), the traveler (المسافر), and the path (الطريق). It contains the science of what is traveled for, and whether its attainment is purely by grace (minna) or not. And whether acquired knowledge (العلم المكتسب) is purely by grace, and if so, by what means does the distinction occur between the two types of knowledge, when both are purely by grace? It contains the science of the creation of the forms of deeds (إنشاء صور الأعمال). It contains the science of the Divine Loan (المقارضة الإلهية), and why it returns, and what a certain faction failed to understand from it, leading them to say: <<إِنَّ اللهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ>> (Indeed, Allah is poor, and we are rich), when Allah said to them: <<وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا>> (And lend to Allah a goodly loan). They said, \"The Lord of Muhammad asks us for a loan.\" It contains the science of Concealment (الستر) and the Mercy of Specialization (رحمة الاختصاص). <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر ۳۱۱: حضرت محمدیہ (الحضرة المحمدیۃ) سے غیبی اختصاصی نشو و نما (النواشئ الاختصاصیۃ الغیبیۃ) کے مقام کی معرفت میں۔\n\n> دثروني زملوني قول من *** خصه الرحمن بالعلم الحسن‏\n> حين جلى الروح بالأفق له *** وهو في غار حراء قد سجن‏\n> نفسه فيه لأمر جاءه *** في غيابات الفؤاد المستكن‏\n> لتجل قام في خاطره *** صورة مجموعة من كل فن‏\n> سورة سينية صادية *** جمع السر لديها والعلن‏\n> فأتى يرجف منها هيبة *** غادة تؤنسه حتى سكن‏\n> سألته ما الذي أقلقه *** قال أمر قد نفى عني الوسن‏\n> هو أن الله قد أكرمني *** بالذي أكرم أصحاب اللسن‏\n> من رسول ونبي مجتبى *** في علوم وبلاء ومحن‏\n> كلما أحضره في خلدي *** حن قلبي لتجليه وأن‏\n> فلذا يقلقني مشهده *** ولذا أزهد في دندن دن‏\n\n**ترجمۂ اشعار:**\n\"مجھے کمبل اوڑھا دو، مجھے چادر اوڑھا دو\" یہ اس ہستی کا قول ہے، جسے رحمن نے بہترین علم کے ساتھ خاص کیا۔\nجب روح (جبرائیل) نے افق پر ان کے لیے ظہور کیا، اور وہ غار حرا میں محصور تھے۔\nانھوں نے اپنے نفس کو اس میں (حرا میں) اس امر کے لیے قید کیا جو ان کے پاس دل کی پوشیدہ گہرائیوں میں آیا۔\nیہ اس ظہور (التجلی) کے لیے تھا جو ان کے دل میں قائم ہوا، ایک ایسی صورت جو ہر فن سے جمع کی گئی تھی۔\nایک سینی (س) اور صاد (ص) والی سورت، جس کے پاس راز اور ظاہر دونوں جمع ہیں۔\nپس وہ اس کی ہیبت سے کانپتے ہوئے آئے، ایک حسین عورت (خدیجہ) نے انھیں تسلی دی یہاں تک کہ وہ پرسکون ہو گئے۔\nاس نے ان سے پوچھا کہ کس چیز نے آپ کو بے چین کیا؟ انھوں نے کہا: ایک ایسا امر جس نے میری نیند اڑا دی۔\nوہ یہ کہ اللہ نے مجھے اس چیز سے عزت بخشی جس سے اس نے فصاحت والوں کو عزت بخشی۔\nجو رسول اور برگزیدہ نبی ہیں، علوم، آزمائشوں اور مصیبتوں میں۔\nجب بھی میں اسے اپنے دل میں حاضر کرتا ہوں، میرا دل اس کے ظہور (التجلی) کے لیے تڑپتا اور آہ بھرتا ہے۔\nاسی لیے اس کا مشاہدہ (الشہود) مجھے بے چین کرتا ہے، اور اسی لیے میں دنیا کی بے معنی باتوں سے بے رغبت ہوں۔\n\nجان لو کہ جس رات میں نے یہ باب قلمبند کیا، میں نے ایک خواب دیکھا جس سے میں بہت خوش ہوا، اور میں بیدار ہوا تو یہ شعر گنگنا رہا تھا جو میں نے اس سے پہلے اپنے دل میں کہا تھا اور یہ فخر کے باب سے ہے:\n\n> في كل عصر واحد يسمو به *** وأنا لباقي العصر ذاك الواحد\n\n**ترجمۂ شعر:**\nہر زمانے میں ایک شخص ہوتا ہے جو اسے بلندی دیتا ہے، اور میں باقی زمانے کے لیے وہی ایک شخص ہوں۔\n\nاور یہ اس لیے ہے کہ میں آج اپنے علم میں کسی ایسے شخص کو نہیں جانتا جو مجھ سے زیادہ مقام عبودیت (العبودیۃ) میں متحقق ہو، اور اگر کوئی ہے بھی تو وہ میرے جیسا ہی ہے۔ کیونکہ میں نے عبودیت کی انتہا کو پا لیا ہے۔ پس میں خالص، محض بندہ ہوں، میں ربوبیت (الربوبیۃ) کا ذائقہ نہیں جانتا۔ ایک دن عتبہ غلام کو دیکھا گیا کہ وہ اپنی چال میں اس طرح اکڑ کر چل رہا تھا جیسے کوئی خود پسند گمراہ شخص ہو۔ اس سے کہا گیا: اے عتبہ! یہ کیسا غرور ہے جس میں تم مبتلا ہو، اور یہ بات تم میں پہلے کبھی نہیں دیکھی گئی؟ اس نے کہا: میرے جیسے شخص کے لیے اکڑنا حق ہے، اور میں کیوں نہ اکڑوں جبکہ میرا ایک آقا بن گیا ہے اور میں اس کا بندہ بن گیا ہوں۔\n\n### [کہ ہر زمانے میں ہر مرتبے میں ایک نمایاں شخص کا ہونا ضروری ہے]\n\nاور جان لو کہ ہر زمانے میں ہر مرتبے میں ایک نمایاں شخص کا ہونا ضروری ہے، یہاں تک کہ دستکاروں اور ہر علم میں بھی۔ اگر اس زمانے کا جائزہ لیا جائے تو معاملہ ویسا ہی پایا جائے گا جیسا ہم نے کہا ہے۔ اور عبودیت (العبودیۃ) بھی ان مراتب میں سے ایک ہے۔ اور اللہ سبحانہ و تعالیٰ نے یہ مجھے ایک ایسی بخشش کے طور پر عطا کی ہے جس سے اس نے مجھ پر انعام کیا ہے۔ میں نے اسے عمل سے حاصل نہیں کیا، بلکہ یہ ایک الٰہی اختصاص ہے۔ میں اللہ سے دعا کرتا ہوں کہ وہ اسے ہم پر قائم رکھے اور ہمارے اور اس کے درمیان رکاوٹ نہ ڈالے یہاں تک کہ ہم اسی کے ساتھ اس سے ملیں۔ پس اسی پر انھیں خوش ہونا چاہیے، یہ اس سے بہتر ہے جو وہ جمع کرتے ہیں۔\n\nاور جان لو کہ یہ مقام، نواشئ اختصاصیہ (النواشئ الاختصاصیۃ) کا مقام ہے، اور یہ ہر مقام اور حال کی ابتدا اور اولیت کا اظہار ہے۔ اللہ تعالیٰ نے فرمایا: **\"اور ہم تمہیں اس چیز میں پیدا کریں گے جسے تم نہیں جانتے\"** (سورة الواقعة: ۶۱)۔ پس اگر ہماری روحوں کی ہمارے جسموں میں واپسی اسی خاص مزاج پر ہوتی جو ہمیں دنیاوی نشو و نما میں حاصل تھا، تو اللہ تعالیٰ کا یہ فرمان **\"اس چیز میں جسے تم نہیں جانتے\"** درست نہ ہوتا۔ کیونکہ اس نے فرمایا ہے: **\"اور تم پہلی پیدائش کو تو جان چکے ہو، پس تم کیوں نہیں نصیحت پکڑتے؟\"** (سورة الواقعة: ۶۲) اور فرمایا: **\"جیسا کہ اس نے تمہیں شروع کیا، تم لوٹو گے\"** (سورة الأعراف: ۲۹)۔ یعنی آخرت کی نشو و نما (النشأۃ الآخرۃ) دنیاوی نشو و نما سے اس لحاظ سے مشابہت رکھتی ہے کہ وہ بے مثال ہے۔ کیونکہ اللہ نے ہمیں بغیر کسی سابقہ مثال کے پیدا کیا۔\n\nاور اسی طرح وہ ہمیں بغیر کسی سابقہ مثال کے پیدا کرے گا۔ اگر کہا جائے کہ اس کے فرمان **\"تم لوٹو گے\"** کا کیا فائدہ ہے؟ ہم کہیں گے: وہ انسانی روحوں کو مخاطب کر رہا ہے کہ وہ آخرت میں اجسام کی تدبیر کی طرف لوٹیں گی، جیسا کہ وہ دنیا میں اس مزاج پر تھیں جس پر وہ نشو و نما پیدا کی گئی تھی، اور وہ انھیں ان کی قبروں سے نکالے گا اور آگ سے جب وہ اگیں گے، جیسے دانہ اگتا ہے جو سیلاب کے بہاؤ میں ہوتا ہے۔ حالانکہ وہ اس مزاج کو دوبارہ لوٹانے پر قادر ہے، لیکن اس نے ایسا نہیں چاہا۔ اسی لیے اس نے مشیت (المشیئۃ) کو اس کے ساتھ معلق کیا، پس اللہ تعالیٰ نے فرمایا: **\"پھر جب وہ چاہے گا، اسے اٹھا کھڑا کرے گا\"** (سورة عبس: ۲۲)۔ یعنی اسی مزاج کو جس پر وہ تھا۔ اگر وہ بعینہٖ وہی ہوتا تو وہ کہتا: \"پھر وہ اسے اٹھا کھڑا کرتا ہے۔\" پس ہم اس علم کی طرف لوٹتے ہیں جسے ہم اس مقام کے بعض علوم میں سے بیان کرنا چاہتے ہیں، اور وہ وہ علم ہے جس کے گرد یہ گھومتا ہے۔ پس ہم کہتے ہیں کہ عالم دو ہیں اور حضرتیں (الحضرات) دو ہیں، اگرچہ ان دونوں کے مجموعے سے ایک تیسری حضرت پیدا ہوئی ہے۔ پہلی حضرت، حضرت غیب (حضرة الغیب) ہے اور اس کا ایک عالم ہے جسے عالم غیب (عالم الغیب) کہا جاتا ہے۔ دوسری حضرت، حضرت حس اور شہادت (حضرة الحس والشہادۃ) ہے اور اس کے عالم کو عالم شہادت (عالم الشہادۃ) کہا جاتا ہے۔ اس عالم کا ادراک آنکھ سے ہوتا ہے اور عالم غیب کا ادراک بصیرت سے ہوتا ہے۔ اور ان دونوں کے اجتماع سے جو حضرت اور عالم پیدا ہوا ہے، وہ حضرت خیال (حضرة الخیال) ہے اور عالم، عالم خیال (عالم الخیال) ہے۔ اور یہ محسوس سانچوں میں معانی کا ظہور ہے، جیسے علم کا دودھ کی صورت میں، دین میں ثابت قدمی کا قید کی صورت میں، اسلام کا ستونوں کی صورت میں، ایمان کا کڑے کی صورت میں، اور جبرائیل کا دحیہ کلبی کی صورت میں یا ایک اعرابی کی صورت میں، اور مریم کے لیے ایک کامل بشر کی صورت میں ظاہر ہونا۔ جیسا کہ مازو اور زاج کے ملنے پر جسم میں سیاہی ظاہر ہوتی ہے، حالانکہ ان کے الگ ہونے کی حالت میں ان میں یہ وصف نہیں تھا۔\n\nاور اسی لیے حضرت خیال (حضرة الخیال) تمام حضرتوں میں سب سے وسیع ہے، کیونکہ یہ دونوں عالموں، عالم غیب (عالم الغیب) اور عالم شہادت (عالم الشہادۃ) کو جمع کرتی ہے۔ جبکہ حضرت غیب عالم شہادت کو سمو نہیں سکتی، کیونکہ اس میں کوئی خلا باقی نہیں ہے۔ اور اسی طرح حضرت شہادت بھی (دوسرے کو سمو نہیں سکتی)۔ پس تم جان چکے ہو کہ حضرت خیال بلاشبہ سب سے وسیع ہے۔ اور تم نے اپنے حس میں اور اپنی نشو و نما کے تقاضے کے مطابق اپنے اندر معانی اور روحانیوں کو محسوس اجسام میں تمہارے سامنے متخیل اور متمثل ہوتے دیکھا ہے، اس طرح کہ جب اس متصور (تصور کی گئی چیز) میں کوئی اثر واقع ہوتا ہے تو وہ معنی جو اس میں متصور ہوا ہے، خود بھی متاثر ہوتا ہے۔ اور بلاشبہ تم معانی اور روحانیوں سے زیادہ حضرت خیال کے حقدار ہو، کیونکہ تم میں قوت متخیلہ (القوۃ المتخیلۃ) موجود ہے، اور یہ تمہاری ان قوتوں میں سے ہے جن پر حق (الحق) نے تمہیں پیدا کیا ہے۔ پس تم اس کے مالک ہونے اور اس میں تصرف کرنے کے معنی سے زیادہ حقدار ہو، کیونکہ معنی اس وصف سے متصف نہیں ہوتا کہ اس میں قوت خیال ہو، اور نہ ہی ملأ اعلیٰ کے روحانیین اس وصف سے متصف ہوتے ہیں کہ ان کی نشو و نما میں قوت خیال ہو۔ اس کے باوجود، انھیں اس خیالی حضرت میں تمثل (تمثیل) اور تخیل کے ذریعے امتیاز حاصل ہے۔ پس تم ان سے زیادہ تخیل اور تمثل کے حقدار ہو، کیونکہ یہ حضرت تم میں حقیقت کے طور پر موجود ہے۔ عام لوگ اسے نہیں جانتے اور اس میں داخل نہیں ہوتے مگر جب وہ سو جاتے ہیں اور حسی قوتیں اس کی طرف لوٹ جاتی ہیں۔ اور خواص اسے بیداری میں دیکھتے ہیں، کیونکہ وہ اس کے ساتھ قوت تحقق رکھتے ہیں۔\n\nپس عالم غیب (عالم الغیب) میں حضرت خیال (حضرة الخیال) میں انسان کا تصور کرنا زیادہ قریب اور اولیٰ ہے۔ خاص طور پر جب کہ اس کی نشو و نما میں اس کی روح کے ذریعے جو اس کا باطن ہے، عالم غیب میں اس کی رسائی ہے، اور اس کے جسم کے ذریعے جو اس کا ظاہر ہے، عالم شہادت میں اس کی رسائی ہے۔ روحانی (الروحانی) ایسا نہیں ہوتا، اور اس کی عالم شہادت میں رسائی نہیں ہوتی مگر عالم خیال میں تمثل (التمثل) کے ذریعے۔ پس حس اسے خیال میں ایک متمثل صورت کے طور پر دیکھتا ہے، خواہ نیند میں ہو یا بیداری میں۔ اگر انسان عالم غیب میں امتیاز حاصل کرنا چاہے تو اسے یہ حاصل ہے، کیونکہ وہ اس میں حقیقت کے طور پر امتیاز حاصل کرتا ہے نہ کہ خیال کے طور پر، اپنی روح کے لحاظ سے جسے حس ادراک نہیں کر سکتا اور جو عالم غیب سے ہے۔ اور اگر وہ اپنے جسم کے ساتھ روحانیت اختیار کرنا چاہے اور اس کے ذریعے عالم غیب میں ظاہر ہونا چاہے تو اسے مددگار مل جاتا ہے، اور وہ اس کی روح ہے جو اس کی تدبیر سے وابستہ ہے۔ پس وہ عالم غیب میں تمثل کے لیے اس روحانی سے زیادہ قریب ہے جو عالم شہادت کی صورت میں متمثل ہوتا ہے۔ لیکن یہ مقام کسب کیا جاتا ہے اور حاصل کیا جاتا ہے، جیسے قضیب البان رحمۃ اللہ علیہ۔ بلاشبہ انھیں یہ مقام حاصل تھا۔ پس انسان کی قوت میں وہ کچھ ہے جو عالم غیب کی قوت میں نہیں ہے۔ کیونکہ انسان کی قوت میں، اپنی روح کے لحاظ سے، عالم شہادت میں اپنی صورت کے علاوہ کسی اور صورت میں تمثل (التمثل) کی صلاحیت ہے، پس انسان بنی آدم کی کسی بھی صورت میں، یا حیوانات، نباتات اور پتھر کی صورتوں میں ظاہر ہو سکتا ہے، اور یہ ان سے واقع ہوا ہے۔\n\nاور مجھے اللہ کے راستے کے ایک شیخ نے خبر دی، جو میرے نزدیک ثقہ اور عادل ہیں، اور میں نے ان سے اس مسئلے پر گفتگو کی، تو انھوں نے کہا: میں تمہیں وہ بتاتا ہوں جو میں نے تمہاری بات کی تصدیق کے طور پر دیکھا ہے۔ وہ یہ کہ میں ایک ایسے شخص کے ساتھ رہا جسے یہ مقام حاصل تھا، اور مجھے اس کا کوئی علم نہیں تھا۔ میں نے ان سے بغداد سے موصل تک حاجیوں کے قافلے میں واپسی کے وقت رفاقت کی درخواست کی۔ انھوں نے مجھ سے کہا: جب تم عزم کر لو تو کھانے پینے کی کوئی چیز مجھ سے پہلے شروع نہ کرنا، یہاں تک کہ میں خود تم سے اس کا مطالبہ کروں۔ میں نے اس پر ان سے عہد کیا۔ وہ عمر رسیدہ تھے، پس وہ ایک پالکی میں سوار ہوئے اور میں ان کے قریب پیدل چل رہا تھا تاکہ اگر انھیں میری ضرورت پیش آئے تو میں حاضر ہوں۔ انھیں اسہال کی بیماری ہو گئی اور وہ کمزور ہو گئے، یہ بات مجھ پر بہت گراں گزری، جبکہ وہ اس کا علاج نہیں کر رہے تھے جو اسے روک دے۔\n\nاور ان کے قیام کو ختم کر دے۔ میں نے ان سے کہا: اے میرے آقا! کیا میں سنجار کے سبیل والے شخص کے پاس جا کر شفاخانے سے کوئی قبض کشا دوا لے آؤں؟ انھوں نے میری طرف انکار کرنے والے کی طرح دیکھا اور کہا: شرط زیادہ مضبوط ہے۔ پس میں خاموش ہو گیا۔ انھوں نے کہا: پھر ان کی حالت مزید بگڑ گئی، تو میں خاموش نہ رہ سکا۔ جب رات کو قافلہ اترا اور مشعلیں روشن کی گئیں، تو میں نے سنجار کے سبیل والے شخص کا قصد کیا، اور وہ ایک سیاہ فام خادم تھا، اور لوگ اس کے سامنے کھڑے تھے، اور بیمار لوگ اپنی بیماریوں کے مطابق اس سے دوائیں طلب کر رہے تھے۔ میں نے ان سے کہا: اے میرے آقا! میرے دل کو سکون دیجیے اور مجھ سے غم دور کیجیے کہ آپ مجھے حکم دیں کہ میں اس شخص کے پاس سے دوا لے آؤں۔\n\nانھوں نے تبسم کیا اور مجھ سے کہا: اس کے پاس جاؤ۔ میں اس کے پاس آیا، اور وہ مجھے پہلے نہیں جانتا تھا، اور نہ ہی میری حالت اور لباس ایسا تھا جو میری تعظیم کا موجب بنتا۔ میں اس کے پاس گیا اور مجھے ڈر تھا کہ وہ مجھے رد کر دے گا یا ڈانٹے گا کیونکہ وہ اپنے کام میں مشغول تھا۔ میں لوگوں کے درمیان اس کے سرہانے کھڑا ہو گیا۔ جب اس کی نظر مجھ پر پڑی تو وہ میری طرف اٹھا، مجھے بٹھایا، اور خوشی، کشادگی اور محبت سے سلام کیا اور پوچھا: تمہاری کیا ضرورت ہے؟ میں نے اسے شیخ کی حالت اور بیماری کے بارے میں بتایا۔ اس نے وکیل سے بہترین دوا منگوائی اور معذرت کی اور مجھ سے کہا: آپ نے تکلیف کی، آپ نے مجھے کیوں نہیں بھیج دیا؟ میں خیمے سے نکلنے کے لیے اٹھا تو وہ میرے اٹھنے پر کھڑا ہو گیا اور مشعلیں میرے آگے چلنے لگیں۔ میں نے اسے الوداع کہا جب وہ میرے ساتھ چند قدم چلا اور مشعل بردار کو حکم دیا کہ وہ روشنی لے کر میرے آگے چلے۔ میں نے اس سے کہا: اس کی کیا ضرورت ہے؟ اور مجھے ڈر تھا کہ شیخ کو یہ بات گراں گزرے گی۔ پس مشعل بردار واپس چلا گیا اور میں آیا تو شیخ کو اسی حالت میں پایا جس میں چھوڑ کر گیا تھا۔ انھوں نے مجھ سے پوچھا: تم نے کیا کیا؟ میں نے کہا: آپ کی برکت سے اس نے میری عزت کی، حالانکہ وہ مجھے نہیں جانتا تھا اور نہ میں اسے جانتا ہوں۔ میں نے انھیں اس کے تمام افعال کی تفصیل بتائی۔ شیخ نے تبسم کیا اور مجھ سے کہا: اے حامد! میں نے تمہاری عزت کی، وہ خادم نہیں تھا جس نے تمہاری عزت کی۔ بلاشبہ میں نے تمہیں اپنی بیماری پر بہت پریشان دیکھا، تو میں نے چاہا کہ تمہارے دل کو سکون دوں، پس میں نے تمہیں اس کے پاس جانے کا حکم دیا۔ اور مجھے تم پر اس سے ڈر تھا کہ کہیں وہ تمہارے ساتھ وہ سلوک نہ کرے جو وہ لوگوں کے ساتھ کرتا ہے، یعنی توہین اور دھتکار، اور تم شکستہ دل واپس آؤ۔ پس میں اپنے جسم سے الگ ہوا اور تمہارے لیے اس کی صورت میں متمثل ہوا، اور میں نے تمہاری عزت کی اور تمہاری قدر بڑھائی اور تمہارے ساتھ وہ سب کیا جو تم نے دیکھا، یہاں تک کہ تم جدا ہو گئے۔ اور یہ تمہاری دوا ہے، میں اسے استعمال نہیں کروں گا۔ میں حیران رہ گیا۔ انھوں نے مجھ سے کہا: جلدی نہ کرو، اس کے پاس واپس جاؤ اور دیکھو وہ تمہارے ساتھ کیا کرتا ہے۔ میں اس کے پاس آیا اور اسے سلام کیا، تو اس نے میری طرف توجہ نہیں دی اور مجھے دھتکار دیا گیا۔ میں حیران ہو کر واپس آیا اور شیخ کو سارا ماجرا سنایا۔ انھوں نے کہا: کیا میں نے تمہیں نہیں کہا تھا؟ میں نے کہا: تعجب ہے، آپ کیسے ایک سیاہ فام خادم بن گئے؟ انھوں نے کہا: معاملہ ویسا ہی ہے جیسا تم نے دیکھا۔ اور اس طرح کی حکایات اہل اللہ سے بہت زیادہ ہیں۔\n\nاور یہ علم سیمیا (علم السیمیاء) سے مشابہت رکھتا ہے، لیکن یہ علم سیمیا نہیں ہے۔ اور اس مقام میں ہمارے اور علم سیمیا کے درمیان فرق یہ ہے کہ اگر تم سیمیا کے ذریعے کھاؤ تو تم کھاؤ گے لیکن سیر نہیں ہو گے، اور جو چیز تم اس علم کے ذریعے حاصل کرتے ہو، وہ صرف تمہاری نظر میں ہوتی ہے، پھر جب تم اسے تلاش کرتے ہو تو وہ نہیں ملتی۔ اور اگر سیمیا کا ماہر تمہیں دکھائے کہ تم حمام میں داخل ہو رہے ہو، تو جب تم اپنی طرف لوٹتے ہو تو اس کی کوئی حقیقت نہیں دیکھتے۔ بلکہ جو کچھ تم سیمیا کے ذریعے دیکھتے ہو، وہ صرف اس جیسا ہوتا ہے جو سونے والا دیکھتا ہے، پس جب وہ بیدار ہوتا ہے تو اسے وہ کچھ نہیں ملتا جو اس نے دیکھا تھا۔ کیونکہ علم سیمیا کے ماہر کو تمہارے خیال پر اسماء (الأسماء)، حروف یا قلقطیرات کی خصوصیات کے ذریعے تسلط اور اختیار حاصل ہوتا ہے۔ سیمیا کی کئی اقسام ہیں، جن میں سب سے زیادہ کثیف قلقطیرات ہیں اور سب سے زیادہ لطیف وہ کلام ہے جس کے ذریعے دیکھنے والے کی نظر کو حس سے ہٹا کر اس کے خیال کی طرف پھیر دیا جاتا ہے، پس وہ بیداری کی حالت میں بھی وہی دیکھتا ہے جو سونے والا دیکھتا ہے۔ اور یہ مقام جس کا ہم نے ذکر کیا ہے، ایسا نہیں ہے۔ کیونکہ اگر تم اس کے ذریعے کھاؤ تو سیر ہو گے، اور اگر تم اس میں سونا، کپڑے یا کوئی بھی چیز پکڑو تو وہ تمہارے پاس اپنی حالت پر باقی رہے گی اور تبدیل نہیں ہو گی۔ اور ہم نے یہ مقام اپنی جانوں سے پایا ہے اور اپنے سلوک (السلوک) کے آغاز میں عیسیٰ علیہ السلام کی روحانیت کے ساتھ ذوقاً حاصل کیا ہے۔ اور اسی لیے\n\nآپ علیہ السلام نے فرمایا، جبکہ آپ نے وصال (مسلسل روزہ) سے منع فرمایا تھا، تو آپ سے کہا گیا کہ آپ تو وصال کرتے ہیں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: **\"میں تمہاری طرح نہیں ہوں، میں رات گزارتا ہوں جبکہ میرے ساتھ ایک کھلانے والا ہوتا ہے جو مجھے کھلاتا ہے اور ایک پلانے والا ہوتا ہے جو مجھے پلاتا ہے۔\"** اور ایک روایت میں ہے: **\"مجھے میرا رب کھلاتا اور پلاتا ہے۔\"**\n\nفلم يكن في تلك الجماعة التي خاطبها في ذلك الوقت من له هذا المقام ولم يقل لست كهيئة الناس فكان إذا أكل شبع وواصل على قوة معتادة ولما كان الأكل في حضرة الخيال لا في حضرة الحس صح أن يكون مواصلا\n\nپس اس جماعت میں جسے آپ نے اس وقت مخاطب کیا، کوئی ایسا نہیں تھا جسے یہ مقام حاصل ہو۔ اور آپ نے یہ نہیں فرمایا کہ \"میں لوگوں کی طرح نہیں ہوں\"۔ پس جب آپ کھاتے تھے تو سیر ہو جاتے تھے اور معمول کی قوت کے ساتھ وصال کرتے تھے۔ اور چونکہ کھانا حضرت خیال (حضرة الخیال) میں تھا نہ کہ حضرت حس (حضرة الحس) میں، اس لیے آپ کا وصال کرنا درست تھا۔\n\nاور ہم نے دیکھا ہے کہ جبرائیل حس کی صورت میں ایک معروف شخص کے طور پر ظاہر ہوئے، جیسے دحیہ کی صورت میں ان کا ظہور، اور بعض اوقات ایک غیر معروف شخص کی صورت میں۔ اور ہمیں یہ نہیں پہنچا کہ وہ عالم غیب (عالم الغیب) میں فرشتوں کے درمیان کسی دوسرے فرشتے کی صورت میں ظاہر ہوئے ہوں۔ پس جبرائیل فرشتوں میں اور عالم غیب میں میکائیل یا اسرافیل کی صورت میں ظاہر نہیں ہوتے۔ اسی لیے اللہ تعالیٰ نے ان کے بارے میں فرمایا: **\"اور ہم میں سے کوئی نہیں مگر اس کا ایک معلوم مقام ہے\"** (سورة الصافات: ۱۶۴)۔ اور ہم نے دیکھا ہے کہ انسانوں میں سے جسے تمثل (التمثل) کی قوت حاصل ہوتی ہے، وہ انسانوں میں کسی دوسرے انسان کی صورت میں ظاہر ہوتا ہے جو اس کی اپنی صورت نہیں ہوتی۔ پس زید، عمرو کی صورت میں ظاہر ہوتا ہے۔ جبکہ فرشتے کے لیے عالم غیب میں یہ صلاحیت نہیں ہے۔ اور جس طرح جبرائیل بشر کی صورت میں ظاہر ہوئے، اسی طرح انسان عالم غیب میں فرشتوں کے پاس کسی بھی فرشتے کی صورت میں ظاہر ہو سکتا ہے جو وہ چاہے۔ اور اس سے بھی زیادہ حیرت انگیز بات یہ ہے کہ اس طریقے کے محبین (المحبین) میں سے بعض لوگ ایک شیخ کے پاس آئے، تو شیخ نے ان سے محبت کے بارے میں بات کی۔ حاضرین میں سے بعض نے اسے اندر آتے دیکھا تھا۔ وہ محب شیخ کی محبت کے بارے میں گفتگو کی وجہ سے، اپنے تحقق کی قوت کے سبب، حسی طور پر اپنے اندر گھلتا رہا، یہاں تک کہ وہ شیخ کے سامنے ایک چلو پانی بن گیا۔ پھر کچھ لوگ شیخ کے پاس آئے اور اس محب کے بارے میں پوچھا کہ وہ کہاں ہے، کیونکہ ہم نے اسے باہر جاتے نہیں دیکھا۔ شیخ نے کہا: یہ پانی وہی محب ہے جو میرے سامنے ہے۔ انھوں نے چٹائی پر شیخ کے سامنے تھوڑا سا پانی دیکھا۔ پس دیکھو کہ وہ کس طرح اپنی اصل کی طرف لوٹ گیا جس سے وہ پیدا کیا گیا تھا۔ کاش میں جانتا کہ وہ اجزاء کہاں گئے؟\n\n### [جب انسان جان لے کہ وہ ایک ایسی اصل اور حقیقت پر ہے جو صورتوں کو قبول کرتی ہے]\n\nپس جان لو کہ اس طریقے میں انسان کو وہ قوت عطا کی جاتی ہے جس کے ذریعے وہ اس نشو و نما میں ظاہر ہوتا ہے، جیسا کہ وہ آخرت کی نشو و نما میں ظاہر ہو گا جس میں وہ کسی بھی صورت میں ظاہر ہو سکتا ہے جو وہ چاہے۔ کیونکہ یہ اس دنیاوی صورت کی اصل میں ہے۔ لیکن ہر کوئی اس اصل کی معرفت تک نہیں پہنچتا، اور وہ اللہ تعالیٰ کا یہ فرمان ہے: **\"جس نے تجھے پیدا کیا، پھر تجھے درست کیا، پھر تجھے متناسب بنایا\"** (سورة الانفطار: ۷)۔ اور یہ یہی ظاہری نشو و نما ہے۔ پھر فرمایا: **\"جس صورت میں چاہا تجھے جوڑ دیا\"** (سورة الانفطار: ۸)۔ یعنی یہ درست اور متناسب بنائی گئی نشو و نما تمام صورتوں کو قبول کرنے والی ہے۔ پس اللہ تعالیٰ اسے جس صورت میں چاہے ظاہر کرتا ہے۔ پس اس نے ہمیں بتایا کہ یہ نشو و نما کسی بھی صورت کو قبول کرنے کی صلاحیت رکھتی ہے۔ اور اسی طرح اس کا فرمان: **\"پھر ہم نے اسے ایک دوسری مخلوق بنا کر پیدا کیا\"** (سورة المؤمنون: ۱۴)، انسان کی ظاہری صورت کو درست کرنے کے بعد۔ پس اس کے لیے ان صورتوں میں سے ایک صورت متعین کی گئی جنہیں قبول کرنے کی صلاحیت اس کی قوت اور ترکیب میں ہے۔ پس جب انسان کشف الٰہی (الکشف الإلٰہی) کے ذریعے جان لیتا ہے کہ وہ ایک ایسی اصل اور حقیقت پر ہے جو صورتوں کو قبول کرتی ہے، تو وہ ایک ایسا امر حاصل کرنے کی کوشش کرتا ہے جس کے ذریعے وہ اس امر کی معرفت تک پہنچ سکے۔ پس جب اس کے لیے اس میں کشادگی ہوتی ہے، تو وہ عالم شہادت (عالم الشہادۃ) میں اس کی کسی بھی صورت میں ظاہر ہوتا ہے جو وہ چاہے، اور عالم غیب اور ملکوت میں اس کی کسی بھی صورت میں ظاہر ہوتا ہے جو وہ چاہے۔ البتہ ہمارے اور عالم غیب کے درمیان فرق یہ ہے کہ جب انسان روحانیت اختیار کرتا ہے اور عالم غیب میں روحانیوں کے لیے ظاہر ہوتا ہے، تو وہ جان لیتے ہیں کہ یہ ایک جسم ہے جس نے روحانیت اختیار کی ہے۔ جبکہ عالم شہادت میں لوگ جب کسی روح کو مجسم دیکھتے ہیں تو وہ ابتدا میں نہیں جانتے کہ یہ ایک مجسم روح ہے، یہاں تک کہ انھیں اس کا علم ہو جائے، جیسا کہ\n\nآپ صلی اللہ علیہ وسلم نے فرمایا جب روح الامین (جبرائیل) آپ کے پاس ایک ایسے شخص کی صورت میں آئے جس کے کپڑے بہت سفید اور بال بہت سیاہ تھے۔ راوی نے کہا: **\"ہم میں سے کوئی بھی اسے نہیں پہچانتا تھا، یہاں تک کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھا، اپنے گھٹنے آپ کے گھٹنوں سے لگا دیے اور اپنی ہتھیلیاں اپنی رانوں پر رکھیں۔\"** اور اس نے اسلام، ایمان، احسان اور قیامت اور اس کی علامات کے بارے میں سوال کرنے کی حدیث بیان کی۔ جب وہ اپنے سوالات سے فارغ ہوئے تو جانے کے لیے کھڑے ہوئے، اور جب وہ غائب ہو گئے، تو نبی صلی اللہ علیہ وسلم نے اپنے صحابہ سے فرمایا: **\"کیا تم جانتے ہو کہ وہ شخص کون تھا؟\"** اور ایک روایت میں ہے: **\"اس شخص کو میرے پاس واپس لاؤ۔\"** پس اسے تلاش کیا گیا لیکن وہ نہیں ملا۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا: **\"یہ جبرائیل تھے جو لوگوں کو ان کا دین سکھانے آئے تھے۔\"**\n\nالبتہ بعض لوگ روحانی (الروحانی) کو پہچان لیتے ہیں جب وہ باہر سے، دوسرے لوگوں میں سے یا اس صورت کی جنس میں سے جس میں وہ ظاہر ہوتا ہے، مجسم ہوتا ہے۔ اور ہر کوئی یہ نہیں جانتا۔ اور وہ مجسم ہونے والی روحانی معنوی صورت اور اندر سے متمثل ہونے والی صورت کے درمیان بھی ان علامات کے ذریعے فرق کرتے ہیں جنہیں وہ جانتے ہیں۔ اور میں نے انھیں جان لیا ہے اور ان کا تحقق (التحقق) حاصل کر لیا ہے۔ پس میں روح کو پہچانتا ہوں جب وہ باہر سے یا اندر سے حقیقی جسمانی صورت سے مجسم ہوتا ہے، جبکہ عام لوگ یہ نہیں جانتے۔ اور تمام فرشتے انسان کو پہچان لیتے ہیں جب وہ روحانیت اختیار کرتا ہے اور ان میں سے کسی ایک کی صورت میں یا کسی ایسی عجیب صورت میں ظاہر ہوتا ہے جو انھوں نے پہلے نہیں دیکھی ہوتی۔ پس وہ اس لحاظ سے عام انسانوں سے زیادہ ہیں، اور ان میں کمی یہ ہے کہ وہ اپنے عالم میں ایک دوسرے کی صورتوں میں ظاہر نہیں ہو سکتے، جیسا کہ ہم اپنے عالم میں ظاہر ہوتے ہیں جب ہمیں یہ مقام حاصل ہوتا ہے، اپنی جنس کی صورت میں۔ پس پاک ہے وہ علیم (العلیم) اور حکیم (الحکیم)، چیزوں کا اندازہ لگانے والا اور ان پر قادر، اس کے سوا کوئی معبود نہیں، وہ علیم (العلیم) اور قدیر (القدیر) ہے۔\n\n### [تجلی الٰہی (التجلی الإلٰہی) میں الٰہی علم]\n\nاور جان لو کہ اس امر کی اصل جس کا میں نے اس مسئلے میں ذکر کیا ہے، وہ صرف تجلی الٰہی (التجلی الإلٰہی) میں الٰہی علم (العلم الإلٰہی) سے ہے۔ پس وہیں سے یہ امر عالم غیب (عالم الغیب) اور شہادت (الشہادۃ) میں ظاہر ہوا، کیونکہ پورا عالم، اور انسان اپنی نقل کے ساتھ، اور فرشتہ اپنی قوت کے ساتھ، مختلف صورتوں میں مقام تجلی (مقام التجلی) کی صورت پر ہیں۔ اور ان صورتوں کی حقیقت کو جن میں تحول (تبدیلی) واقع ہوتا ہے، حقیقت میں کوئی نہیں جانتا مگر وہ جسے کسی بھی صورت میں تحول کا مقام حاصل ہو، اگرچہ وہ اس صورت میں ظاہر نہ ہو۔ اور یہ مقام صرف خالص، محض بندے (العبد المحض الخالص) کے لیے ہے، کیونکہ مقام عبودیت (العبودیۃ) اسے یہ اجازت نہیں دیتا کہ وہ اپنے آقا کی صفات میں سے کسی بھی چیز سے مکمل طور پر مشابہت اختیار کرے۔ یہاں تک کہ وہ عبودیت کے تحقق (التحقق بالعبودیۃ) میں اپنی قوت کی اس حد تک پہنچ جاتا ہے کہ وہ فنا (الفناء) ہو جاتا ہے، بھول جاتا ہے، اور صورتوں میں تحول کی اس قوت کی معرفت سے مستہلک ہو جاتا ہے، اس طرح کہ وہ اپنے آقا کے مقام کے سامنے تسلیم کرتے ہوئے خود سے اس کا علم نہیں رکھتا، کیونکہ اس نے خود کو اسی وصف سے متصف کیا ہے۔ اور اگر یہ الٰہی اصل نہ ہوتی، اور یہ کہ حق (الحق) کے لیے یہ ہے اور وہ خود اس پر ہے، تو یہ حقیقت عالم میں درست نہ ہوتی۔ کیونکہ یہ ناممکن ہے کہ عالم میں کوئی ایسا امر ہو جو اپنی صورت میں کسی الٰہی حقیقت سے منسوب نہ ہو جس پر وہ امر قائم ہے۔ اور اگر ایسا ہوتا تو وجود میں کوئی ایسا ہوتا جو اللہ کے علم سے باہر ہوتا۔ کیونکہ اس نے چیزوں کو صرف اپنے علم سے جانا ہے، اور اس کا نفس ہی اس کا علم ہے۔ اور ہم اس کے علم میں ایسے ہیں جیسے ہباء (ذرات) میں صورتیں ہوتی ہیں۔ اے جوان! اگر تم جانتے کہ تم کون ہو، تو تم جان لیتے کہ وہ کون ہے، کیونکہ اللہ کو صرف وہی جانتا ہے جو اپنے نفس کو جانتا ہے۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: **\"جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا۔\"**\n\nپس حق (الحق) نے تمہیں اپنے نفس سے سکھایا اور تمہیں بتایا کہ تم اسے اپنے نفس کے ذریعے ہی جان سکتے ہو۔ پس جو اس معنی پر غور کرے گا، وہ جان لے گا کہ ہم کیا کہہ رہے ہیں اور کس طرف اشارہ کر رہے ہیں۔ جہاں تک قیامت کے دن تجلی (التجلی) کی حدیث کا تعلق ہے، تو میں اسے ان شاء اللہ اسی طرح بیان کروں گا جیسا کہ صحیح حدیث میں وارد ہوا ہے۔ اور وہ یہ ہے کہ\n\nمسلم نے ابو سعید خدری رضی اللہ عنہ سے روایت کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں کچھ لوگوں نے پوچھا: یا رسول اللہ! کیا ہم قیامت کے دن اپنے رب کو دیکھیں گے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: **\"ہاں۔ کیا تم دوپہر کے وقت سورج کو دیکھنے میں، جب اس کے ساتھ کوئی بادل نہ ہو، کوئی تکلیف محسوس کرتے ہو؟ اور کیا تم چودھویں رات کے چاند کو دیکھنے میں، جب آسمان صاف ہو اور کوئی بادل نہ ہو، کوئی تکلیف محسوس کرتے ہو؟\"** انھوں نے کہا: نہیں، یا رسول اللہ! آپ نے فرمایا: **\"اسی طرح تم قیامت کے دن اللہ تبارک و تعالیٰ کو دیکھنے میں کوئی تکلیف محسوس نہیں کرو گے، مگر اتنی ہی جتنی ان دونوں میں سے کسی ایک کو دیکھنے میں محسوس کرتے ہو۔\"**\n\nجب قیامت کا دن ہو گا، تو ایک منادی اعلان کرے گا کہ ہر امت اس کی پیروی کرے جس کی وہ عبادت کرتی تھی۔ پس کوئی بھی ایسا شخص باقی نہیں رہے گا جو اللہ کے سوا بتوں اور تھانوں کی عبادت کرتا تھا، مگر وہ آگ میں گر جائیں گے۔ یہاں تک کہ صرف وہی لوگ باقی رہ جائیں گے جو اللہ کی عبادت کرتے تھے، نیک ہوں یا فاجر، اور اہل کتاب کے علاوہ۔ آپ نے فرمایا: پھر یہودیوں کو بلایا جائے گا اور ان سے کہا جائے گا: تم کس کی عبادت کرتے تھے؟ وہ کہیں گے: ہم عزیر کی عبادت کرتے تھے اور کہتے تھے کہ وہ اللہ کا بیٹا ہے۔ ان سے کہا جائے گا: تم جھوٹ بولتے ہو، اللہ نے نہ کوئی بیوی بنائی اور نہ کوئی اولاد۔ پس تم کیا چاہتے ہو؟ وہ کہیں گے: اے ہمارے رب! ہم پیاسے ہیں، پس ہمیں پلا دے۔ انھیں اشارہ کیا جائے گا: کیا تم (پانی کے گھاٹ پر) نہیں جاؤ گے؟ پس انھیں آگ کی طرف ہانکا جائے گا جو سراب کی طرح ہو گی اور ایک دوسرے کو توڑ رہی ہو گی، پس وہ آگ میں گر جائیں گے۔ پھر عیسائیوں کو بلایا جائے گا اور ان سے کہا جائے گا: تم کس کی عبادت کرتے تھے؟ وہ کہیں گے: ہم مسیح کی عبادت کرتے تھے اور کہتے تھے کہ وہ اللہ کا بیٹا ہے۔ ان سے کہا جائے گا: تم جھوٹ بولتے ہو، اللہ نے نہ کوئی بیوی بنائی اور نہ کوئی اولاد۔ اور ان سے کہا جائے گا: تم کیا چاہتے ہو؟ وہ کہیں گے: اے ہمارے رب! ہم پیاسے ہیں، پس ہمیں پلا دے۔ آپ نے فرمایا: انھیں اشارہ کیا جائے گا: کیا تم (پانی کے گھاٹ پر) نہیں جاؤ گے؟ پس انھیں جہنم کی طرف ہانکا جائے گا جو سراب کی طرح ہو گی اور ایک دوسرے کو توڑ رہی ہو گی، پس وہ آگ میں گر جائیں گے۔ یہاں تک کہ صرف وہی لوگ باقی رہ جائیں گے جو اللہ کی عبادت کرتے تھے، نیک ہوں یا فاجر۔ پس رب العالمین تبارک و تعالیٰ ان کے پاس اس صورت سے کم تر صورت میں آئے گا جس میں انھوں نے اسے دیکھا تھا۔ آپ نے فرمایا: وہ کہے گا: تم کس کا انتظار کر رہے ہو؟ ہر امت اس کی پیروی کرے جس کی وہ عبادت کرتی تھی۔ وہ کہیں گے: اے ہمارے رب! ہم نے دنیا میں لوگوں کو چھوڑ دیا تھا جب ہمیں ان کی سب سے زیادہ ضرورت تھی اور ہم نے ان کا ساتھ نہیں دیا۔ آپ نے فرمایا: وہ کہے گا: میں تمہارا رب ہوں۔ وہ کہیں گے: ہم تجھ سے اللہ کی پناہ مانگتے ہیں، ہم اللہ کے ساتھ کسی کو شریک نہیں کرتے، (یہ بات) دو یا تین بار کہیں گے، یہاں تک کہ ان میں سے بعض قریب ہوں گے کہ پلٹ جائیں۔ وہ کہے گا: کیا تمہارے اور تمہارے رب کے درمیان کوئی نشانی ہے جسے تم پہچانتے ہو؟ وہ کہیں گے: ہاں۔ آپ نے فرمایا: پس وہ اپنی پنڈلی کھولے گا، تو جو بھی اللہ کو خلوص نیت سے سجدہ کرتا تھا، اسے سجدہ کرنے کی اجازت مل جائے گی، اور جو شخص بچاؤ کے لیے اور ریاکاری سے سجدہ کرتا تھا، اللہ اس کی کمر کو ایک تختہ بنا دے گا، جب بھی وہ سجدہ کرنا چاہے گا، اپنی پشت کے بل گر جائے گا۔ پھر وہ اپنے سر اٹھائیں گے، اور وہ اپنی اس صورت میں تبدیل ہو چکا ہو گا جس میں انھوں نے اسے پہلی بار دیکھا تھا۔ وہ کہے گا: میں تمہارا رب ہوں۔ وہ کہیں گے: ہاں، تو ہمارا رب ہے۔ آپ نے فرمایا: پھر جہنم پر پل (صراط) نصب کیا جائے گا اور شفاعت (الشفاعۃ) کی اجازت دی جائے گی۔ حدیث آخر تک۔ اور بات طویل ہو گئی ہے، پس ہم ان علوم کا ذکر کرتے ہیں جو یہ مقام اپنے اندر رکھتا ہے۔\n\n### [اسم القیوم (الاسم القیوم) کا علم]\n\nپس ان علوم میں سے ایک اسم القیوم (الاسم القیوم) کا علم ہے۔ اور ہمارے اصحاب میں اس بارے میں اختلاف ہے کہ کیا اس کے ساتھ تخلق (تخلق) اختیار کیا جا سکتا ہے یا نہیں؟ شیخ ابو عبد اللہ بن جنید القبرفیقی، جو اندلس میں اس طریقے کے بڑے مشائخ میں سے تھے اور معتزلی تھے، میں نے انھیں سنا کہ وہ اس کے ساتھ تخلق اختیار کرنے سے منع کرتے تھے۔ میں نے ان سے ان کے مقام پر ان کے اصحاب کی موجودگی میں قبرفیق، جو وندہ کے اعمال میں سے ہے، میں کئی بار اس بارے میں گفتگو کی، یہاں تک کہ وہ ہمارے قول کی طرف لوٹ آئے کہ القیوم (القیوم) کے ساتھ تخلق اختیار کیا جا سکتا ہے، جیسے دیگر اسماء الٰہیہ (الأسماء الإلٰہیۃ) کے ساتھ۔ اور اس میں عالم غیب (عالم الغیب) کی نشو و نما کا علم ہے۔ اور اس میں عالم غیب کے مقادیر کا علم ہے۔ اور اس میں اللہ کے کلام کے تتابع (تسلسل) کے وصف کا علم ہے۔ اور اس میں روحوں کے نزول کا علم ہے، اور جو شخص اس پر نازل ہوتا ہے وہ جو بوجھ اور سانس کی تنگی محسوس کرتا ہے۔ اور میں ایک مدت تک قبرستانوں میں تنہا گوشہ نشین رہا۔ تو مجھے خبر ملی کہ ہمارے شیخ یوسف بن یخلف الکرمی نے کہا: فلاں (اور میرا نام لیا) نے زندوں کی مجلس چھوڑ دی ہے اور مردوں کی مجلس میں چلا گیا ہے۔ پس میں نے ان کی طرف پیغام بھیجا کہ اگر آپ میرے پاس آئیں تو آپ دیکھیں گے کہ میں کس کے ساتھ مجلس کرتا ہوں۔ پس انھوں نے چاشت کی نماز پڑھی اور اکیلے میری طرف آئے۔ انھوں نے مجھے تلاش کیا تو میں قبروں کے درمیان بیٹھا ہوا تھا، سر جھکائے ہوئے، اور میں ان روحوں سے بات کر رہا تھا جو میرے پاس حاضر تھیں۔ وہ میرے پہلو میں ادب سے آہستہ آہستہ بیٹھ گئے۔ میں نے ان کی طرف دیکھا تو میں نے دیکھا کہ ان کا رنگ بدل گیا ہے اور ان کا سانس تنگ ہو گیا ہے۔ وہ اس بوجھ کی وجہ سے جو ان پر نازل ہوا تھا، اپنا سر اٹھا نہیں پا رہے تھے۔ اور میں ان کی طرف دیکھ کر مسکرا رہا تھا، لیکن وہ اس کرب کی وجہ سے جو ان پر تھا، مسکرا نہیں پا رہے تھے۔ جب میں بات سے فارغ ہوا اور وارد (الوارِد) واپس ہوا، تو شیخ پر سے بوجھ ہلکا ہوا اور انھوں نے راحت محسوس کی اور اپنا چہرہ میری طرف کیا اور میری دونوں آنکھوں کے درمیان بوسہ دیا۔ میں نے ان سے کہا: اے استاد! مردوں کے ساتھ مجلس کرنے والا میں ہوں یا آپ؟ انھوں نے کہا: نہیں، اللہ کی قسم! بلکہ میں مردوں کے ساتھ مجلس کر رہا تھا۔ اللہ کی قسم! اگر یہ حالت مزید رہتی تو میں ہلاک ہو جاتا۔ اور وہ واپس چلے گئے اور مجھے چھوڑ دیا۔ پس وہ کہا کرتے تھے کہ جو شخص لوگوں سے کنارہ کشی اختیار کرنا چاہے، تو وہ فلاں کی طرح کنارہ کشی اختیار کرے۔\n\nاور اس میں عالم غیب (عالم الغیب) کی استقامت اور مخالفت سے اس کی عصمت کا علم ہے، اور یہ کہ وہ عالم وفاق (عالم الوفاق) ہے۔ اور اس میں ان چیزوں کا علم ہے جن پر انسانی قوتیں متفق ہوئیں، اور ان چیزوں کا علم ہے جن میں انھوں نے اختلاف کیا، پس ایک عین جو انھیں جمع کرتی ہے اور ایک عین جو انھیں جدا کرتی ہے۔ اور اس میں ان اسماء (الأسماء) کا علم ہے جو ہر ذاکر میں ذکر (الذکر) عطا کرتے ہیں، اور ان کی حضرت (الحضرة) کیا ہے اور ان کا اثر کیا ہے۔ اور اس میں حق (الحق) کے ساتھ انفراد (تنہائی) کا علم ہے، اور کون سی چیز اس کی طرف بلاتی ہے، اور کیا مخلوق کے درمیان انفراد درست ہے یا صرف انسان کی کلیت کے ساتھ، ظاہراً اور باطناً، ہی درست ہے؟ اور اس میں حضرة الربوبیہ (حضرة الربوبیۃ) سے جہات کے اسماء کا علم ہے۔ اور اس میں ہر حضرت کی توحید (التوحید) کا علم ہے۔ اور اس میں ملک الملک (بادشاہت کا مالک) کا علم ہے، اور وہ حق (الحق) کی مخلوق کے تصرف کا علم ہے، اور یہ ایک عزیز مقام ہے۔ اور اس میں اپنی جنس کے لوگوں کو چھوڑنے کی سیاست کا علم ہے۔ اور اس میں وعید (سزا کی دھمکی) کا علم ہے۔ اور اس میں رسالت (الرسالۃ) کا علم ہے، اور رسول کہاں سے بھیجے گئے، اور انسان کی کن صفات والوں کی طرف بھیجے گئے، اور مرسل الیہ (جس کی طرف بھیجا گیا) سے رسول کا مقام کیا ہے۔ اور اس میں اس مقام کا علم ہے جو خاصیت کے ذریعے چھوٹوں کو بڑوں سے ملا دیتا ہے، اور وہ زمان (وقت) کے لپیٹنے کا علم ہے، جیسے زمانے کے ایک ہزار سال کا رب کے دنوں میں سے ایک دن میں لپیٹ جانا، اور پچاس ہزار سال کا ہمارے نزدیک زمانے کا ذی المعارج کے دنوں میں سے ایک دن میں لپیٹ جانا، اور وہ اس کے عالم میں ایک لمحے کی طرح ہے۔ اور جیسے معلوم زمانے کے تین سو ساٹھ دنوں کا سورج کے دنوں میں سے ایک دن میں لپیٹ جانا۔ اور ہر سیارے اور ثابت ستارے کے لیے زمانے کے دنوں میں سے اس کی وسعت کے مطابق دن مقرر کیے گئے ہیں۔ اور یہ اس مقام کے علوم میں سے ہے۔ اور اس میں بندے کے لیے مشیت (المشیئۃ) کے اثبات کا علم ہے کہ وہ کس حضرت سے ہے اور کون سا اسم الٰہی (الاسم الإلٰہی) اس کی طرف دیکھتا ہے۔ اور اس میں عالم غیب (عالم الغیب) میں انسان کے داخل ہونے اور نکلنے کے درمیان پلٹنے کا علم ہے۔ اور اس میں مقادیر اور اوزان کا علم ہے، اور وہ جو پیمانے اور میزان سے دیا جاتا ہے۔ کیونکہ یہ وارد ہوا ہے کہ عقل پیمانے سے دی جاتی ہے اور اعمال میزان سے۔ اور اس میں کون (کائنات) کے ساتھ نرمی (الرفق) کا علم ہے اور اس کے ساتھ تخلق (تخلق) اختیار کرنا، اور اسماء الٰہیہ (الأسماء الإلٰہیۃ) میں اس کا نام کیا ہے۔ اور اس میں عالم کے اس چیز کے ادراک سے عاجز ہونے کا علم ہے جس کا ادراک ممکن نہیں، تاکہ اس سے بندہ ممتاز ہو اور اپنی قدر پہچانے۔ اور اس میں سفر، مسافر اور راستے کا علم ہے۔ اور اس میں اس چیز کا علم ہے جس کے لیے سفر کیا جاتا ہے، اور کیا اس کا حصول عین منت (عین المنۃ) سے ہے یا نہیں؟ اور کیا حاصل کیا گیا علم (العلم المکتسب) عین منت سے ہوتا ہے؟ اور اگر ایسا ہے تو دونوں علموں کے درمیان فرق کس چیز سے واقع ہوتا ہے، جبکہ دونوں عین منت سے ہیں؟ اور اس میں اعمال کی صورتوں کی تخلیق کا علم ہے۔ اور اس میں الٰہی قرض (المقارضۃ الإلٰہیۃ) کا علم ہے، اور وہ کس چیز کی طرف لوٹتا ہے؟ اور ایک گروہ نے اسے نہیں سمجھا، یہاں تک کہ انھوں نے کہا: **\"بے شک اللہ فقیر ہے اور ہم غنی ہیں\"** (سورة آل عمران: ۱۸۱)، جب اللہ نے ان سے فرمایا: **\"اور اللہ کو اچھا قرض دو\"** (سورة المزمل: ۲۰)۔ تو انھوں نے کہا: محمد کا رب ہم سے قرض مانگتا ہے۔ اور اس میں پردہ پوشی (الستر) اور رحمت اختصاص (رحمۃ الاختصاص) کا علم ہے۔ اور **\"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\"** (سورة الأحزاب: ۴)۔",
    "fa": "«باب سیصد و یازدهم در معرفت منزل نشأت‌های (نواشئ) اختصاصی غیبی از حضرت محمدیه (الحضرة المحمدية)»\n\n«مرا بپوشانید، مرا در خود بپیچید» سخن کسی است\nکه خداوند رحمان او را به علم نیکو اختصاص داد.\n\nهنگامی که روح (جبرئیل) در افق بر او تجلی کرد،\nو او در غار حرا خود را محبوس ساخته بود.\n\nنفس خود را در آنجا برای امری که به سویش آمد،\nدر اعماق پنهان قلب جای داد.\n\nبرای تجلی‌ای که در خاطرش پدید آمد،\nصورتی گردآوری شده از هر فن.\n\nسوره‌ای سین‌وار و صاد‌وار،\nکه سرّ و آشکار نزد آن جمع است.\n\nپس با هیبتی لرزان آمد،\nو دوشیزه‌ای (خدیجه) او را آرامش داد تا آسوده شد.\n\nاز او پرسید: چه چیز تو را آشفته کرده است؟\nگفت: امری که خواب را از من ربوده است.\n\nاین است که خداوند مرا گرامی داشته است،\nبه آنچه یاران زبان‌آور (پیامبران) را گرامی داشت.\n\nاز رسول و نبی برگزیده،\nدر علوم و آزمایش‌ها و محنت‌ها.\n\nهرگاه او را در خاطرم حاضر می‌سازم،\nقلبم برای تجلی (التجلی) او مشتاق می‌شود و ناله می‌کند.\n\nاز این رو، مشاهده‌اش مرا بی‌قرار می‌کند،\nو از این رو، از دنیای پست (دندن دن) روی می‌گردانم.\n\nبدان که شبی که این باب را می‌نوشتم، رؤیایی دیدم که از آن شادمان شدم و بیدار شدم در حالی که بیتی را که پیش از این در ذهن خود سروده بودم، می‌خواندم؛ و آن از باب فخر است:\n\nدر هر عصری یک نفر است که به آن سرافرازی می‌بخشد،\nو من برای باقی این عصر، همان یک نفر هستم.\n\nو این بدان سبب است که من امروز در علم خود کسی را نمی‌شناسم که بیش از من به مقام عبودیت تحقق یافته باشد؛ و اگر هم کسی باشد، او مانند من است. زیرا من به نهایت عبودیت رسیده‌ام، پس من بنده محض و خالص هستم و طعمی از ربوبیت نمی‌شناسم. روزی عُتبة الغلام دیده شد که در راه رفتن خود با غرور و تکبر راه می‌رفت، مانند کسی که سرگشته و خودپسند است. به او گفته شد: ای عتبه، این تکبری که در توست چیست؟ پیش از امروز این حالت از تو شناخته نشده بود. او گفت: سزاوار است که کسی چون من تکبر کند. چگونه تکبر نکنم در حالی که مولایی یافته‌ام و من بادم بنده او شده‌ام.\n\n### [اینکه در هر زمانی ناگزیر باید یک نفر در هر مرتبه‌ای برجسته باشد]\n\nو بدان که در هر زمانی ناگزیر باید یک نفر در هر مرتبه‌ای برجسته باشد، حتی در میان صاحبان حرفه‌ها و در هر علمی. اگر آن زمان بررسی شود، امر بر همین منوال خواهد بود که گفتیم. و عبودیت از جمله این مراتب است. و خداوند سبحان آن را به من به عنوان هدیه‌ای بخشیده است که بر من منت نهاده است؛ آن را با عمل به دست نیاورده‌ام، بلکه اختصاصی الهی است. از خداوند می‌خواهم که آن را برای ما حفظ کند و میان ما و آن حائل نشود تا زمانی که او را با آن ملاقات کنیم. «پس به آن شاد باشند، که آن بهتر است از آنچه گرد می‌آورند.» (فَبِذلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ). و بدان که این منزل، منزل نشأت‌های (نواشئ) اختصاصی است و آن عبارت است از آغاز و اولیت هر مقام و حالی. خداوند متعال می‌فرماید: «و شما را در آنچه نمی‌دانید ایجاد کنیم.» (وَنُنْشِئَكُمْ فِي مَا لَا تَعْلَمُونَ). پس اگر بازگرداندن ارواح ما به اجسادمان بر همین مزاج خاصی بود که در نشأت دنیا داشتیم، سخن خداوند متعال که می‌فرماید: «در آنچه نمی‌دانید» (فِي مَا لَا تَعْلَمُونَ) صحیح نبود. زیرا او فرموده است: «و قطعاً نشأت نخستین را دانسته‌اید، پس چرا متذکر نمی‌شوید؟» (وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى فَلَوْلَا تَذَكَّرُونَ). و فرمود: «همان‌گونه که شما را آغاز کرد، باز می‌گردید.» (كَمَا بَدَأَكُمْ تَعُودُونَ). یعنی در نشأت آخرت، آن نشأت شبیه نشأت دنیوی است در نبود مثال (الگو)، زیرا خداوند ما را بدون مثال قبلی ایجاد کرد.\n\nو همچنین ما را بدون مثال قبلی ایجاد می‌کند. اگر گفته شود: فایده سخن او که می‌فرماید: «باز می‌گردید» (تَعُودُونَ) چیست؟ می‌گوییم: ارواح انسانی را مورد خطاب قرار می‌دهد که در آخرت به تدبیر اجسام باز می‌گردند، همان‌گونه که در دنیا بودند، بر مزاجی که آن نشأت بر آن خلق شده است. و آن‌ها را از قبرشان در آن (مزاج) و از آتش خارج می‌سازد، هنگامی که می‌رویند، همان‌گونه که دانه در سیلاب می‌روید. با وجود قدرت او بر اعاده آن مزاج، اما او نخواسته است. و به همین دلیل مشیت را به خود معلق ساخت و فرمود: «سپس هرگاه بخواهد، او را برمی‌انگیزد.» (ثُمَّ إِذَا شَاءَ أَنْشَرَهُ) یعنی آن مزاجی که بر آن بود. اگر عین همان بود، می‌فرمود: «سپس او را برمی‌انگیزد.» پس باز می‌گردیم به آنچه می‌خواهیم از برخی علوم این منزل بیان کنیم، و آن علمی است که این منزل بر محور آن می‌چرخد. می‌گوییم: عالم دو عالم است و حضرت (حضور) دو حضرت، اگرچه حضرتی سوم از مجموع آن دو متولد شده است. حضرت اول، حضرت غیب است و عالمی دارد که عالم غیب نامیده می‌شود. و حضرت دوم، حضرت حس و شهود است و عالم آن، عالم شهادت نامیده می‌شود. و درک‌کننده این عالم با بصر (چشم ظاهری) است و درک‌کننده عالم غیب با بصیرت (چشم باطنی). و آنچه از اجتماع این دو متولد می‌شود، یک حضرت و یک عالم است. پس آن حضرت، حضرت خیال است و آن عالم، عالم خیال است. و آن عبارت است از ظهور معانی در قالب‌های محسوس، مانند علم در صورت شیر، و ثبات در دین در صورت قید، و اسلام در صورت ستون‌ها، و ایمان در صورت دستگیره (عروة)، و جبرئیل در صورت دحیه کلبی و در صورت اعرابی، و تمثل (تجسم) برای مریم در صورت بشری کامل (سویّ). همان‌گونه که سیاهی در جسم مازو و زاج هنگام اجتماعشان ظاهر می‌شود، در حالی که در حالت جدایی آن وصف را نداشتند. به همین دلیل، حضرت خیال وسیع‌ترین حضرات است، زیرا هر دو عالم، عالم غیب و عالم شهادت را در بر می‌گیرد. زیرا حضرت غیب عالم شهادت را در بر نمی‌گیرد، چرا که در آن خالی نمانده است. و همچنین حضرت شهادت. پس دانستی که حضرت خیال بی‌شک وسیع‌تر است. و تو در حس خود و بر اساس آنچه نشأت تو در نفست اقتضا می‌کند، مشاهده کرده‌ای که معانی و روحانیون در اجساد محسوس در نظر تو تخیل و تمثل می‌یابند، به طوری که اگر اثری در آن صورت متصور واقع شود، معنای متصور در نفس خود متأثر می‌شود. و بی‌شک تو به حضرت خیال سزاوارتری از معانی و روحانیون، زیرا نیروی متخیله در توست و آن از جمله قوای توست که حق (الحق) تو را بر آن آفریده است. پس تو به مالکیت و تصرف در آن سزاوارتری از معنا، زیرا معنا متصف به داشتن نیروی خیال نیست، و روحانیون از ملأ اعلی نیز در نشأت خود نیروی خیال ندارند. با این حال، آن‌ها در این حضرت خیالی با تمثل و تخیل متمایز می‌شوند. پس تو به تخیل و تمثل از آن‌ها اولی‌تری، زیرا این حضرت در تو حقیقتاً وجود دارد. عامه مردم آن را نمی‌شناسند و وارد آن نمی‌شوند مگر زمانی که بخوابند و قوای حسی به آن بازگردند. اما خواص به دلیل نیروی تحقق (تحقق) به آن، این را در بیداری می‌بینند. پس تصور انسان در عالم غیب در حضرت خیال نزدیک‌تر و اولی‌تر است، به ویژه که او در نشأت خود، با روحش که باطن اوست، به عالم غیب ورود دارد، و با جسمش که ظاهر اوست، به عالم شهادت ورود دارد. اما روحانی چنین نیست و به عالم شهادت ورود ندارد مگر با تمثل در عالم خیال، پس حس، او را در خیال به صورت ممثل در خواب و بیداری مشاهده می‌کند. اگر انسان در عالم غیب متمایز شود، این برای او ممکن است، زیرا او در آنجا حقیقتاً متمایز می‌شود نه خیالی، از حیث روحش که حس آن را درک نمی‌کند و از عالم غیب است. و اگر بخواهد با جسمش روحانی شود و در عالم غیب ظاهر گردد، یاوری می‌یابد و آن روح اوست که به تدبیر جسم مرتبط است. پس او به تمثل در عالم غیب نزدیک‌تر است از روحانی‌ای که در صورت عالم شهادت تمثل می‌یابد. اما این مقام اکتسابی است و به دست می‌آید، مانند قضیب البان (رحمه الله) که این مقام را داشت. در نیروی انسان چیزی هست که در نیروی عالم غیب نیست. زیرا در نیروی انسان، از حیث روحش، تمثل در غیر صورت خود در عالم شهادت وجود دارد. پس انسان در هر صورتی که بخواهد از صور بنی آدم مانند خود، و در صور حیوانات و گیاهان و سنگ ظاهر می‌شود. و این از آن‌ها واقع شده است. و شیخی از شیوخ طریق الله که نزد من مورد اعتماد و عادل است، به من خبر داد و در این مسئله با او گفتگو کردم. او گفت: من آنچه را که در تأیید سخن تو مشاهده کرده‌ام، برایت بازگو می‌کنم. من با مردی که این مقام را داشت، همراه شدم و از این موضوع خبری نداشتم. از او خواستم که در بازگشت حاجیان از بغداد تا موصل با من همراه شود. او به من گفت: اگر تصمیم گرفتی، با هیچ خوردنی و نوشیدنی شروع نکن، مگر اینکه من خودم آن را از تو بخواهم. من با او بر این عهد بستم. او پیر شده بود و در یک محمل (شقه محارة) سوار شد و من پیاده نزدیک او راه می‌رفتم تا مبادا نیازی به من پیدا کند. او به بیماری اسهال مبتلا شد و ضعیف گشت. این بر من سخت آمد، در حالی که او با چیزی که آن را قطع کند و از او رفع کند، مداوا نمی‌کرد.\n\nو او را از برخاستن باز می‌داشت. گفتم: ای سرورم، آیا اجازه می‌دهید نزد آن مردی که در راه صاحب سنجار است بروم و از بیمارستان داروی قابض بگیرم؟ او با حالتی انکارآمیز به من نگریست و گفت: شرط، حاکم است. پس ساکت شدم. گفت: حالش بدتر شد و نتوانستم سکوت کنم. هنگامی که کاروان شب فرود آمد و مشعل‌ها روشن شد، به سوی صاحب سبیل سنجار رفتم. او غلامی سیاه بود و مردان در برابرش ایستاده بودند و بیماران نزد او می‌آمدند و بر حسب بیماری‌هایشان دارو می‌خواستند. به او گفتم: ای مولای من، قلبم را آسوده کن و با امر کردن به من که از نزد این مرد برایت دارو بیاورم، مرا راحت کن. او تبسم کرد و به من گفت: برو نزد او. گفت: نزد او رفتم، در حالی که او قبلاً مرا نمی‌شناخت و من نیز در وضع و لباسی نبودم که موجب تعظیم من شود. در حالی که می‌ترسیدم مرا رد کند یا به دلیل مشغله‌ای که داشت، بر من پرخاش کند، نزد او در میان مردم ایستادم. هنگامی که چشمش به من افتاد، به سویم برخاست و مرا نشاند و با خوشحالی و گشاده‌رویی سلام کرد و گفت: حاجتت چیست؟ من حال شیخ و بیماری‌اش را گفتم. او از وکیل خود بهترین داروی ممکن را خواست و عذرخواهی کرد و گفت: به زحمت افتادی، چرا کسی را نزد من نفرستادی؟ برخاستم تا از خیمه خارج شوم، او نیز به احترام برخاستن من برخاست و مشعل‌ها پیش روی من حرکت کردند. پس از آنکه چند قدم با من آمد، با او خداحافظی کردم و به مشعل‌دار دستور داد که با نور پیشاپیش من حرکت کند. گفتم: نیازی نیست. و ترسیدم که این کار بر شیخ گران آید. مشعل‌دار بازگشت و من آمدم و شیخ را در همان حالی که ترک کرده بودم، یافتم. به من گفت: چه کردی؟ گفتم: به برکت شما، او مرا گرامی داشت، در حالی که نه او مرا می‌شناخت و نه من او را. و جزئیات آنچه از او سر زد را برایش شرح دادم. شیخ تبسم کرد و به من گفت: ای حامد، من تو را گرامی داشتم، نه آن غلام. بی‌شک دیدم که از بیماری من بسیار بی‌تابی می‌کنی، خواستم دلت را آسوده کنم، پس به تو امر کردم که نزد او بروی. و از او بر تو ترسیدم که مبادا با تو همان کاری را کند که با مردم می‌کند، از اهانت و طرد، و تو شکسته بازگردی. پس از کالبد خود تجرد کردم و در صورت او برای تو متصور شدم. تو را گرامی داشتم و قدر تو را بزرگ شمردم و آنچه دیدی را انجام دادم تا زمانی که جدا شدی. و این داروی توست، من آن را استفاده نمی‌کنم. من مبهوت ماندم. او به من گفت: عجله نکن، نزد او بازگرد و ببین با تو چه می‌کند. گفت: نزد او رفتم و سلام کردم، اما او به من توجهی نکرد و طرد شدم. با تعجب رفتم و نزد شیخ بازگشتم و آنچه بر من گذشته بود را برایش تعریف کردم. گفت: مگر به تو نگفتم؟ گفتم: شگفتا، چگونه به صورت غلامی سیاه بازگشت؟ گفت: امر همان‌گونه است که دیدی. و مانند این حکایت از مردان بسیار است. این شبیه علم سیمیا است، اما علم سیمیا نیست. تفاوت میان ما در این مقام و علم سیمیا این است که اگر با سیمیا چیزی بخوری، می‌خوری اما سیری نمی‌یابی. و آنچه از این علم نزد تو قبض می‌شود، تنها در نظر توست، سپس آن را می‌جویی و نمی‌یابی. و اگر صاحب این علم سیمیاوی به تو نشان دهد که وارد حمام می‌شوی، سپس به خود باز می‌گردی و برای آن حقیقتی نمی‌بینی. بلکه هر آنچه از طریق سیمیا می‌بینی، مانند چیزی است که شخص خوابیده می‌بیند؛ وقتی بیدار می‌شود، چیزی از آنچه دیده است، نمی‌یابد. زیرا صاحب علم سیمیا بر خیال تو با خواص اسماء یا حروف یا قلقطیرات (طلسمات) سلطه و تسلط دارد. سیمیا انواع مختلفی دارد که غلیظ‌ترین آن‌ها قلقطیرات است و لطیف‌ترین آن‌ها تلفظ به کلامی است که با آن بصر بیننده را از حس می‌رباید و به خیال او منصرف می‌کند.\n\nپس مانند آنچه شخص خوابیده می‌بیند، در حالی که بیدار است، می‌بیند. و این مقامی که ذکر کردیم، چنین نیست. زیرا اگر با آن بخوری، سیر می‌شوی، و اگر چیزی از طلا یا لباس یا هر چیز دیگری را در آن بگیری، به همان حال نزد تو باقی می‌ماند و تغییر نمی‌کند. ما این مقام را از نفوس خود یافته‌ایم و در آغاز سلوکمان با روحانیت عیسی (علیه السلام) آن را به صورت ذوق (تجربه مستقیم) دریافت کردیم. و به همین دلیل\n\nپیامبر (صلی الله علیه و سلم) در حالی که از روزه وصال (روزه بدون افطار شبانه) نهی کرده بود، به او گفته شد: شما وصال می‌کنید. پیامبر (صلی الله علیه و سلم) فرمود: «من مانند شما نیستم. من شب را می‌گذرانم در حالی که خورنده‌ای با من است که به من غذا می‌دهد و ساقی‌ای که به من می‌نوشاند.» و در روایتی دیگر: «پروردگارم به من غذا می‌دهد و می‌نوشاند.»\n\nپس در آن جمعیتی که در آن زمان مورد خطاب قرار داد، کسی نبود که این مقام را داشته باشد، و نفرمود: «من مانند هیئت مردم نیستم.» پس اگر می‌خورد، سیر می‌شد و با نیرویی عادی وصال می‌کرد. و چون خوردن در حضرت خیال بود نه در حضرت حس، صحیح بود که وصال‌کننده باشد. و دیده‌ایم که جبرئیل در صورت حس به شکل مردی شناخته شده ظاهر شد، مانند ظهورش در صورت دحیه، و گاهی به صورت مردی ناشناخته. و به ما نرسیده است که او در عالم غیب در میان فرشتگان به صورتی غیر از فرشتگان دیگر ظاهر شده باشد. پس جبرئیل در میان فرشتگان و در عالم غیب در صورت میکائیل یا اسرافیل ظاهر نمی‌شود. و به همین دلیل خداوند متعال درباره آن‌ها فرمود: «و هیچ‌یک از ما نیست مگر اینکه برای او مقامی معلوم است.» (وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ). و دیده‌ایم کسی که نیروی تمثل از بشر را دارد، در میان بشر به صورت بشری دیگر غیر از صورت خود ظاهر می‌شود، پس زید در صورت عمرو ظاهر می‌شود. اما فرشته در عالم غیب چنین نیست. و همان‌گونه که جبرئیل در صورت بشر ظاهر شد، انسان نیز در عالم غیب نزد فرشتگان در صورت فرشته‌ای از فرشتگان، هر صورتی که بخواهد، ظاهر می‌شود. و شگفت‌تر از این، اینکه برخی از مردان محب از اهل این طریقت بر شیخی وارد شدند. شیخ برای او درباره محبت سخن گفت. برخی از حاضران دیدند که او وارد شده است. آن محب از کلام شیخ در باب محبت، به دلیل نیروی تحقق (تحقق) آن محب، پیوسته در نفس خود به صورت حسی ذوب می‌شد تا اینکه در برابر آن شیخ به یک کف آب تبدیل شد. مردانی وارد شدند و از آن محب پرسیدند: کجاست؟ ما ندیدیم که خارج شود. شیخ گفت: این آب، همان محبی است که در برابر من است. پس به آب کمی که روی حصیر در برابر شیخ بود، نگریستند. پس ببین چگونه به اصل خود که از آن خلق شده بود، بازگشت. ای کاش می‌دانستم آن اجزاء کجا رفتند.\n\n### [هنگامی که انسان بداند که بر اصلی و حقیقتی است که صور را می‌پذیرد]\n\nپس بدان که انسان در این طریق، از نیرویی برخوردار می‌شود که با آن در این نشأت ظاهر می‌شود، همان‌گونه که در نشأت آخرت که در آن به هر صورتی که بخواهد ظاهر می‌شود. زیرا این در اصل همین صورت دنیوی است، اما هر کسی به معرفت این اصل نمی‌رسد. و آن سخن خداوند متعال است که می‌فرماید: «آن کس که تو را آفرید، پس سامان داد و معتدل ساخت.» (الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ) و این همان نشأت ظاهری است. سپس فرمود: «در هر صورتی که خواست، تو را ترکیب کرد.» (فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ). یعنی این نشأت سامان‌یافته و معتدل، پذیرای همه صور است. پس خداوند متعال او را در هر صورتی که بخواهد تجلی می‌دهد. پس به ما اعلام کرد که این نشأت، پذیرش هر صورتی را می‌دهد. و همچنین سخن او که می‌فرماید: «سپس او را آفرینشی دیگر پدید آوردیم.» (ثُمَّ أَنْشَأْنَاهُ خَلْقًا آخَرَ) پس از فراغت از سامان دادن صورت ظاهری انسان، صورتی از صور را که در نیروی او و ترکیبش قابلیت پذیرش آن را دارد، برای او تعیین کرد. پس هنگامی که انسان با کشف (الکشف) الهی بداند که بر اصلی و حقیقتی است که صور را می‌پذیرد، در به دست آوردن امری که با آن به معرفت آن امر برسد، تلاش می‌کند. پس اگر در آن برای او گشایشی حاصل شود، در عالم شهادت در هر صورتی از صور عالم شهادت که بخواهد، ظاهر می‌شود و در عالم غیب و ملکوت در هر صورتی از صور آن که بخواهد، ظاهر می‌شود. با این تفاوت که فرق میان ما و عالم غیب این است که انسان اگر روحانی شود و برای روحانیون در عالم غیب ظاهر گردد، آن‌ها می‌دانند که او جسمی است که روحانی شده است. اما مردم در عالم شهادت، اگر روحی را ببینند که تجسد یافته است، نمی‌دانند که او روحی است که در ابتدا تجسد یافته است تا زمانی که از این طریق بشناسند، همان‌گونه که\n\nپیامبر (صلی الله علیه و سلم) فرمود، هنگامی که روح الامین (جبرئیل) در صورت مردی با لباس‌های بسیار سفید و موهای بسیار سیاه بر او وارد شد. راوی گفت: هیچ‌یک از ما او را نمی‌شناخت، تا اینکه نزد رسول خدا (صلی الله علیه و سلم) نشست، زانوهایش را به زانوهای پیامبر تکیه داد و کف‌های دستش را بر ران‌های خود گذاشت. و حدیث سؤال او از اسلام، ایمان، احسان و قیامت و نشانه‌های آن را ذکر کرد. هنگامی که از سؤال فارغ شد، برخاست تا برود. وقتی غایب شد، پیامبر (صلی الله علیه و سلم) به اصحابش فرمود: «آیا می‌دانید آن مرد کیست؟» و در روایتی دیگر: «آن مرد را به من بازگردانید.» پس جستجو کردند و او را نیافتند. پیامبر (صلی الله علیه و سلم) فرمود: «این جبرئیل بود که آمد تا دینشان را به مردم بیاموزد.»\n\nبا این حال، برخی از مردم، روحانی را هنگامی که از خارج، از غیر مردم یا از جنس آن صورتی که در آن ظاهر می‌شود، تجسد یابد، می‌شناسند. و هر کسی این را نمی‌داند. و همچنین میان صورت روحانی معنوی متجسد و صورت ممثل شده از درون، با نشانه‌هایی که می‌شناسند، فرق می‌گذارند. و من آن‌ها را دانسته و به آن‌ها تحقق (تحقق) یافته‌ام. زیرا من روح را هنگامی که از خارج یا از داخل تجسد یابد، از صورت جسمی حقیقی می‌شناسم، در حالی که عامه مردم این را نمی‌دانند. و فرشتگان همگی انسان را هنگامی که روحانی شود و در میان آن‌ها به صورت یکی از آن‌ها یا به صورت غریبی که مانند آن را ندیده‌اند، ظاهر شود، می‌شناسند. پس با این امر بر عامه بشر برتری دارند. و نقص آن‌ها این است که نمی‌توانند در عالم خود به صورت برخی از خودشان ظاهر شوند، همان‌گونه که ما در عالم خودمان، اگر این مقام را داشته باشیم، در صورت جنس خود ظاهر می‌شویم. پس منزه است خداوند دانا و حکیم، تقدیرکننده اشیا و قادر بر آن‌ها. هیچ معبودی جز او نیست، دانای توانا.\n\n### [علم الهی در تجلی الهی (التجلی الإلهي)]\n\nو بدان که اصل این امری که در این مسئله ذکر کردم، تنها از علم الهی در تجلی الهی (التجلی الإلهي) است. از آنجا این امر در عالم غیب و شهادت ظاهر شد، زیرا عالم به تمامیتش، و انسان به نسخه‌اش، و فرشته به نیروی خود، بر صورت مقام تجلی (التجلی) در صور مختلف هستند. و حقیقت آن صور که تحول در آن‌ها واقع می‌شود، به حقیقت شناخته نمی‌شود مگر برای کسی که مقام تحول در هر صورتی که بخواهد را داشته باشد، حتی اگر با آن ظاهر نشود. و این مقام جز برای بنده محض و خالص نیست، زیرا مقام عبودیت به او اجازه نمی‌دهد که به هیچ‌یک از صفات سرور خود به طور کامل شبیه شود، تا جایی که از نیروی خود در تحقق (تحقق) به عبودیت به جایی می‌رسد که فانی (فناء) می‌شود و فراموش می‌کند و از معرفت نیرویی که بر آن است، یعنی تحول در صور، مستهلک می‌شود، به طوری که آن را از نفس خود نمی‌شناسد، تسلیم به مقام سرور خود، زیرا او خود را به آن وصف کرده است. و اگر این اصل الهی نبود و حق (الحق) این را نداشت و خود بر آن نبود، صحیح نبود که این حقیقت در عالم وجود داشته باشد. زیرا محال است که در عالم امری باشد که در صورتی که آن امر بر آن است، به حقیقتی الهی مستند نباشد. و اگر چنین بود، در هستی (الوجود) کسی بود که خارج از علم خدا باشد. زیرا او اشیا را نشناخت مگر از علمش به نفس خود، و نفس او علم اوست. و ما در علم او مانند صور در هباء (ذرات معلق در هوا) هستیم. ای جوان، اگر می‌دانستی که تو کیستی، می‌دانستی که او کیست، زیرا خدا را نمی‌شناسد مگر کسی که نفس خود را بشناسد.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «هر کس نفس خود را بشناسد، پروردگار خود را شناخته است.»\n\nپس حق (الحق) تو را از نفس خود آگاه ساخت و به تو اعلام کرد که او را نمی‌شناسی مگر از نفس خودت. پس هر کس به این معنی پی ببرد، می‌داند که چه می‌گوییم و به چه اشاره می‌کنیم. اما حدیث تجلی (التجلی) در روز قیامت، من آن را ان‌شاءالله همان‌گونه که در صحیح وارد شده است، می‌آورم. و آن این است که\n\nمسلم از ابوسعید خدری روایت کرده است که مردمی در زمان رسول خدا (صلی الله علیه و سلم) گفتند: ای رسول خدا، آیا پروردگارمان را در روز قیامت می‌بینیم؟ رسول خدا (صلی الله علیه و سلم) فرمود: «بله. آیا در دیدن خورشید در نیمروز که ابری با آن نیست، دچار مزاحمت می‌شوید؟ و آیا در دیدن ماه شب چهارده که هوا صاف است و ابری در آن نیست، دچار مزاحمت می‌شوید؟» گفتند: خیر، ای رسول خدا. فرمود: «همچنین در دیدن خداوند تبارک و تعالی در روز قیامت دچار مزاحمت نمی‌شوید، مگر به همان اندازه که در دیدن یکی از آن دو دچار مزاحمت می‌شوید.»\n\nهنگامی که روز قیامت شود، ندا دهنده‌ای ندا می‌دهد که هر امتی از آنچه می‌پرستید، پیروی کند. پس هیچ‌کس که غیر از خدا، بت‌ها و سنگ‌ها را می‌پرستید، باقی نمی‌ماند مگر اینکه در آتش سقوط می‌کند. تا زمانی که جز کسانی که خدا را می‌پرستیدند، از نیکوکار و بدکار و غیر اهل کتاب، باقی نمانند. گفت: پس یهود فرا خوانده می‌شوند و به آن‌ها گفته می‌شود: چه چیزی را می‌پرستیدید؟ می‌گویند: ما عزیر را می‌پرستیدیم و می‌گفتیم او پسر خداست. به آن‌ها گفته می‌شود: دروغ گفتید، خداوند نه همسری گرفته و نه فرزندی. پس چه می‌خواهید؟ می‌گویند: پروردگارا، ما تشنه‌ایم، ما را سیراب کن. به آن‌ها اشاره می‌شود: آیا به آبشخور نمی‌روید؟ پس به سوی آتش محشور می‌شوند، که مانند سرابی است که برخی برخی دیگر را در هم می‌شکند، و در آتش سقوط می‌کنند. سپس نصاری فرا خوانده می‌شوند و به آن‌ها گفته می‌شود: چه چیزی را می‌پرستیدید؟ می‌گویند: ما مسیح را می‌پرستیدیم و می‌گفتیم او پسر خداست. به آن‌ها گفته می‌شود: دروغ گفتید، خداوند نه همسری گرفته و نه فرزندی. و به آن‌ها گفته می‌شود: چه می‌خواهید؟ می‌گویند: پروردگارا، ما تشنه‌ایم، ما را سیراب کن. گفت: به آن‌ها اشاره می‌شود: آیا به آبشخور نمی‌روید؟ پس به سوی جهنم محشور می‌شوند، که مانند سرابی است که برخی برخی دیگر را در هم می‌شکند، و در آتش سقوط می‌کنند. تا زمانی که جز کسانی که خدا را می‌پرستیدند، از نیکوکار و بدکار، باقی نمانند. پس پروردگار جهانیان تبارک و تعالی در پایین‌ترین صورتی که او را در آن دیده‌اند، نزد آن‌ها می‌آید. گفت: می‌گوید: منتظر چه هستید؟ هر امتی از آنچه می‌پرستید، پیروی کند. می‌گویند: پروردگارا، ما در دنیا از مردم جدا شدیم، در حالی که بیشترین نیاز را به آن‌ها داشتیم و با آن‌ها همراه نشدیم. گفت: می‌گوید: من پروردگار شما هستم. می‌گویند: به خدا پناه می‌بریم از تو، ما چیزی را شریک خدا قرار نمی‌دهیم (دو یا سه بار). تا جایی که برخی از آن‌ها نزدیک است که برگردند. می‌گوید: آیا میان شما و پروردگارتان نشانه‌ای هست که او را با آن بشناسید؟ می‌گویند: بله. گفت: پس ساق پا را کنار می‌زند. پس هیچ‌کس که از روی میل و اختیار برای خدا سجده می‌کرد، باقی نمی‌ماند مگر اینکه به او اجازه سجده داده می‌شود. و هیچ‌کس که از روی ترس و ریا سجده می‌کرد، باقی نمی‌ماند مگر اینکه خداوند پشت او را یکپارچه می‌سازد، هرگاه بخواهد سجده کند، به پشت می‌افتد. سپس سرهای خود را بلند می‌کنند، در حالی که او به صورتی که اولین بار او را در آن دیده‌اند، متحول شده است. می‌گوید: من پروردگار شما هستم. می‌گویند: بله، تو پروردگار ما هستی. گفت: سپس پل بر روی جهنم زده می‌شود و شفاعت آغاز می‌گردد. (حدیث تا آخر). سخن به درازا کشید، پس بگذارید علومی را که این منزل در بر دارد، ذکر کنیم.\n\n### [علم اسم قیوم (الاسم القيوم)]\n\nاز جمله آن علوم، علم اسم قیوم (الاسم القيوم) است. اصحاب ما در این باره اختلاف کرده‌اند که آیا تخلق (متصف شدن) به آن جایز است یا خیر. شیخ ابوعبدالله بن جنید القبرفیقی، از بزرگان مشایخ این طریقت در اندلس، معتزلی بود. شنیدم که او تخلق به آن را منع می‌کرد. بارها در محل او در حضور اصحابش در قبرفیق از توابع ونده با او گفتگو کردم تا اینکه به قول ما مبنی بر تخلق به قیوم مانند سایر اسماء الهی بازگشت. و در این منزل، علم نشأت عالم غیب وجود دارد. و علم مقادیر عالم غیب در آن است. و علم وصف کلام خدا به تتابع (پی‌درپی بودن) در آن است. و علم تنزل ارواح و آنچه بر کسی که بر او تنزل می‌شود، از سنگینی و تنگی نفس می‌یابد، در آن است. من مدتی در قبرها به تنهایی گوشه‌نشینی کرده بودم. به من خبر رسید که شیخ ما یوسف بن یخلف کرمی گفته است: فلان (و نام مرا برد) همنشینی با زندگان را ترک کرده و به همنشینی با مردگان رفته است. برای او فرستادم که اگر نزد من بیایی، خواهی دید که با چه کسانی همنشینی می‌کنم. پس نماز ضحی (چاشت) را خواند و تنها به سوی من آمد. مرا جستجو کرد و در میان قبرها نشسته و سر به زیر یافت، در حالی که با ارواحی که نزد من حاضر بودند، سخن می‌گفتم. او با ادب اندک‌اندک کنار من نشست. به او نگاه کردم و دیدم رنگش تغییر کرده و نفسش تنگ شده است، به طوری که از سنگینی‌ای که بر او نازل شده بود، نمی‌توانست سرش را بلند کند. و من به او نگاه می‌کردم و تبسم می‌نمودم، اما او از شدت اندوهی که در آن بود، نمی‌توانست تبسم کند. هنگامی که از سخن فارغ شدم و وارد (الهی) صادر شد، از شیخ تخفیف یافت و آسوده شد و صورتش را به سوی من برگرداند و میان دو چشمم را بوسید. به او گفتم: ای استاد، چه کسی با مردگان همنشینی می‌کند، من یا تو؟ گفت: نه به خدا، بلکه من با مردگان همنشینی می‌کنم. به خدا قسم اگر بر این حال ادامه می‌دادم، هلاک می‌شدم. و رفت و مرا ترک کرد. پس او می‌گفت: هر کس می‌خواهد از مردم کناره‌گیری کند، باید مانند فلان کناره‌گیری کند. و در این منزل، علم استقامت عالم غیب و عصمت آن از مخالفت و اینکه آن عالم وفاق است، وجود دارد. و علم آنچه قوای انسانی بر آن توافق کرده‌اند و علم آنچه در آن اختلاف کرده‌اند، پس عین جمع‌کننده آن‌ها و عین جداکننده آن‌ها در آن است. و علم اسمایی که در هر ذاکری ذکر را می‌بخشند و حضرت آن‌ها و اثر آن‌ها در آن است. و علم انفراد با حق (الحق) و آنچه او را به آن فرا می‌خواند و اینکه آیا انفراد در میان مردم صحیح است یا تنها با تمامیت انسان، ظاهر و باطن، صحیح است، در آن است. و علم اسماء جهات از حضرت ربوبیت در آن است. و علم توحید هر حضرت در آن است. و علم ملکِ ملک، و آن علم تصریف (گرداندن) خلق حق (الحق) است، و آن مقام عزیزی است، در آن است. و علم سیاست در ترک فرزندان جنس (بشر) در آن است. و علم وعید در آن است. و علم رسالت و اینکه رسولان از کجا مبعوث شدند و برای چه کسانی از صفات انسان مبعوث شدند و مقام رسول نسبت به مرسل‌الیه (کسی که به سویش فرستاده شده) چیست، در آن است. و علم موطنی که صغار را به کبار با خاصیت ملحق می‌سازد، در آن است. و آن علم درهم پیچیدن زمان است، مانند درهم پیچیدن هزار سال از زمان در یک روز از روزهای پروردگار، و درهم پیچیدن پنجاه هزار سال از زمان نزد ما در یک روز از روزهای ذی‌المعارج، که در عالم او مانند یک چشم بر هم زدن است. و مانند درهم پیچیدن سیصد و شصت روز از روزهای زمان معلوم در یک روز از روزهای خورشید. و برای هر ستاره از سیارات و ثوابت، روزهایی است که به اندازه وسعت آن‌ها از روزهای زمانی برایشان تقدیر می‌شود. و این از علوم این منزل است. و علم اثبات مشیت برای بنده از کدام حضرت است و کدام اسم الهی به آن نظر می‌کند، در آن است. و علم دگرگونی انسان در عالم غیب میان ورود و خروج در آن است. و علم مقادیر و اوزان و آنچه با پیمانه و ترازو داده می‌شود، در آن است. زیرا وارد شده است که عقل با مکیال (پیمانه) و اعمال با میزان (ترازو) داده می‌شود. و علم مدارا با کون (هستی) و تخلق به آن و اینکه اسم آن در اسماء الهی چیست، در آن است. و علم عجز عالم از درک آنچه درک آن ممکن نیست، تا بنده با آن متمایز شود و قدر خود را بشناسد، در آن است. و علم سفر و مسافر و راه در آن است. و علم آنچه برای آن سفر می‌شود و اینکه آیا حصول آن از عین منت است یا خیر، و آیا علم اکتسابی از عین منت است؟ و اگر چنین است، فرق میان دو علم در چیست، در حالی که هر دو از عین منت هستند، در آن است. و علم ایجاد صور اعمال در آن است. و علم قرض دادن الهی (المقارضة الإلهية) و اینکه چرا باز می‌گردد و گروهی از آن چه فهمیدند که گفتند: «خداوند فقیر است و ما توانگریم.» (إِنَّ اللَّهَ فَقِيرٌ وَنَحْنُ أَغْنِيَاءُ) هنگامی که خداوند به آن‌ها فرمود: «و به خدا قرض نیکو دهید.» (وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا). پس گفتند: پروردگار محمد از ما قرض می‌خواهد. و علم پوشش (الستر) و رحمت اختصاص در آن است. «و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 6
}