{
  "id": 317,
  "title": {
    "ar": "الباب السابع عشر وثلاثمائة في معرفة منزل الابتلاء وبركاته‏",
    "en": "Chapter Three Hundred and Seventeen: Concerning the Gnosis of the Station of Trial (منزل الابتلاء) and its Blessings.",
    "ur": "باب تین سو سترہواں: منزلِ ابتلاء (الابتلاء) اور اس کی برکات کی معرفت میں",
    "fa": "باب سیصد و هفدهم در معرفت منزل ابتلا و برکات آن"
  },
  "content": {
    "ar": "## «الباب السابع عشر وثلاثمائة» في معرفة منزل الابتلاء وبركاته‏\n\n\nوهو منزل الإمام الذي على يسار القطب‏\n\n\n> عجبت لدار قد بناها وسواها *** وأسكنها روحا كريما وأبلاها\n\n\n> وخربها تخريب من لا يقيمها *** فمن لي بجمع الشمل من لي ببقياها\n\n\n> وقد كان علا ما بما قد أقامه *** فيا ليت شعري ما الذي كان أدراها\n\n\n> ولم لا بناها أولا وأقامها *** إقامة باق لا يزول محياها\n\n\n> وما فعلت ما تستحق به الردا *** فما كان أسناها وما كان أقواها\n\n\n> لقد عبثت فينا وفيها يد البلى *** وبعد زمان ردها ثم علاها\n\n\n> ورد إليها ذلك الروح فاستوى *** على عرشها ملكا وخلد سكناها\n\n\n> وأورثها عدنا وخلدا عناية *** فأسكنها فردوسها ثم مأواها\n\n\n### [أن الحياة للأرواح المدبرة الأجسام كلها]\n\n\nاعلم أيدك الله أيها الولي الحميم والصفي الكريم أن الحياة للأرواح المدبرة الأجسام كلها النارية والترابية والنورية كالضوء للشمس سواء فالحياة لها وصف نفسي فما يظهرون على شي‏ء إلا حيي ذلك الشي‏ء وسرت فيه حياة ذلك الروح الظاهر له كما يسرى ضوء الشمس في جسم الهواء ووجه الأرض وكل موضع تظهر عليه الشمس ومن هنا يعلم من هو روح العالم وممن يستمد حياته وما معنى قوله تعالى الله نُورُ السَّماواتِ والْأَرْضِ ثم مثل فقال مَثَلُ نُورِهِ كَمِشْكاةٍ وهي الكوة فِيها مِصْباحٌ وهو النور إلى آخر التشبيه فمن فهم معنى هذه الآية علم حفظ الله العالم فهذه الآية من أسرار المعرفة بالله تعالى في ارتباط الإله بالمألوه والرب بالمربوب فإن المربوب والمألوه لو لم يتول الله حفظه دائما لفنى من حينه إذ لم يكن له حافظ يحفظه ويحفظ عليه بقاءه فلو احتجب عن العالم في الغيب انعدم العالم فمن هنا الاسم الظاهر حاكم أبدا وجود أو الاسم الباطن علما ومعرفة فبالاسم الظاهر أبقى العالم وبالاسم الباطن عرفناه وبالاسم النور شهدناه فإذا كانت حياة الإنسان الذي هو مقصودنا في هذا الباب لأنه باب الابتلاء وهو يعم المكلفين من الثقلين فإنه كل ما سوى الثقلين ليسوا مثلنا في حكم العبادة والتكليف فكلامي على الإنسان وحده من حيث حياته كلامي على كل ما سوى الله وكلامي ابتلائه كلامي على كل مكلف من الثقلين قال تعالى وكانَ عَرْشُهُ عَلَى الْماءِ على هنا بمعنى في أي كان العرش في الماء كما إن الإنسان في الماء أي منه تكون فإن الماء أصل الموجودات كلها وهو عرش الحياة الإلهية ومن الماء خلق الله كل شي‏ء حي وكل ما سوى الله حي فإن كل ما سوى الله مسبح بحمد الله ولا يكون التسبيح إلا من حي وقد وردت الأخبار بحياة كل رطب ويابس\n\n\nوجماد ونبات وأرض وسماء وهذه هي التي وقع فيها الخلاف بين أهل الكشف وغيرهم ممن ليس له كشف وبين أهل الايمان وبين من لا يقول بالشرائع أو من يتأول الشرائع على غير ما جاءت له فيقولون إنه تسبيح حال وأما ما أدرك الحس حياته فلا خلاف في حياته وإنما الخلاف في سبب حياته ما هو وفي تسبيحه بحمد ربه لما ذا يرجع إذ لا يكون التسبيح إلا من حي عاقل يعقل ذلك وما عدا الإنسان والجن من الحيوان ليس بعاقل عند المخالف بخلاف ما نعتقد نحن وأهل الكشف والايمان الصحيح وأعني بالعقل هنا العلم فالعرش هنا عبارة عن الملك‏\nوكان حرف وجودي فمعناه إن الملك موجود في الماء أي الماء أصل ظهور عينه فهو للملك كالهيولى ظهر فيه صور العالم الذي هو ملك الله والعالم محصور في أعيان ونسب فالأعيان وجودية والنسب معقولة عدمية وهذا هو كل ما سوى الله ولما كان الماء أصل الحياة وكل شي‏ء حي والنسب تابعة له قرن بين العرش المجعول على الماء وبين خلقه الموت والحياة في الابتلاء فقال وكانَ عَرْشُهُ عَلَى الْماءِ لِيَبْلُوَكُمْ أي يختبركم والعرش كما ذكرت لك أعيان موجودة ونسب عدمية وقال خَلَقَ الْمَوْتَ والْحَياةَ لِيَبْلُوَكُمْ فالحياة للاعيان والموت للنسب فظهور الروح للجسم حياة ذلك الجسم كظهور الشمس لاستنارة الأجسام التي ظهرت الشمس لها وغيبة الروح عن الجسم زوال الحياة من ذلك الجسم وهو الموت فالاجتماع حياة والفرقة موت والاجتماع والافتراق نسب معقولة لها حكم ظاهر وإن كانت معدومة الأعيان‏\n\n\n### [أن القوي كلها التي في الإنسان وفي كل حيوان إنما هي للروح‏]\n\n\nواعلم أن القوي كلها التي في الإنسان وفي كل حيوان مثل قوة الحس وقوة الخيال وقوة الحفظ والقوة المصورة وسائر القوي كلها المنسوبة إلى جميع الأجسام علوا وسفلا إنما هي للروح تكون بوجوده وإعطائه الحياة لذلك الجسم وينعدم فيها ما ينعدم بتوليه عن ذلك الجسم من ذلك الوجه الذي تكون عنه تلك القوة الخاصة فافهم فإذا أعرض الروح عن الجسم بالكلية زال بزواله جميع القوي والحياة وهو المعبر عنه بالموت كالليل بمغيب الشمس وأما بالنوم فليس بإعراض كلي وإنما هي حجب أبخرة تحول بين القوي وبين مدركاتها الحسية مع وجود الحياة في النائم كالشمس إذا حالت السحب بينها وبين موضع خاص من الأرض يكون الضوء موجودا كالحياة وإن لم يقع إدراك الشمس لذلك الموضع الذي حال بينه وبينها السحاب المتراكم وكما إن الشمس إذا فارقت هذا الموضع من الأرض وجاء الليل بدلا منه ظهرت في موضع آخر بنوره أضاء به ذلك الموضع فكان النهار هنالك كما كان هنا كذلك الروح إذا أعرض عن هذا الجسم الذي كانت حياته به تجلى على صورة من الصور الذي هو البرزخ وهو بالصاد جمع صورة فحييت به تلك الصورة في البرزخ كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم في نسمة المؤمن إنه طير أخضر\n\n\nفذلك الطير كالجسم هنا صورة حييت بهذا الروح الذي كان يحيا به هذا الجسم وكما تطلع الشمس في اليوم الثاني علينا فتستنير الموجودات بنورها كذلك الروح يطلع في يوم الآخرة على هذه الأجسام الميتة فتحيا به فذلك هو النشر والبعث‏\n\n\n### [إن الله أوجد الصورة]\n\n\nواعلم أن الصور أوجده الله على صورة القرن وسمي بالصور من باب تسمية الشي‏ء باسم الشي‏ء إذا كان مجاورا له أو كان منه بسبب ولما كان هذا القرن محلا لجميع الصور البرزخية التي تنتقل إليها الأرواح بعد الموت وفي النوم فيه سمي صورا جمع صورة وشكل القرن أعلاه واسع وأسفله ضيق على شكل العالم أين سعة العرش من ضيق الأرض وتنتقل القوي مع الروح إلى تلك الصورة البرزخية نوما وموتا ولهذا تكون دراكة بجميع القوي سواء فقد أعلمتك بما هو الأمر عليه ومن هنا زل القائلون بالتناسخ لما رأوا أو سمعوا أن الأنبياء قد نبهت على انتقال الأرواح إلى هذه الصور البرزخية وتكون فيها على صور أخلاقها ورأوا تلك الأخلاق في الحيوانات تخيلوا في قول الأنبياء والرسل والعلماء أن ذلك راجع إلى هذه الحيوانات التي في الدار الدنيا وإنها ترجع إلى التخليص وذكروا ما قد علمت من مذهبهم فأخطئوا في النظر وفي تأويل أقوال الرسل وما جاء في ذلك من الكتب المنزلة ورأوا النائم يقرب من هذا الأمر الذي شرعوا فيه فاستروحوا من ذلك ما ذهبوا إليه فما أتى عليهم إلا من سوء التأويل في القول الصحيح وهذا معنى قوله لِيَبْلُوَكُمْ أي يختبر عقولكم بالموت والحياة أَيُّكُمْ أَحْسَنُ عَمَلًا بالخوض فيهما والنظر فيرى من يصيب منكم ومن يخطئ كأهل التناسخ وجعل ذلك كله دليلا واضحا ونصبه برهانا قاطعا على اسمه الحي واسمه النور واسمه الظاهر والباطن والأول والآخر ليعلم نسبة العالم من موجدة وأنه غير مستقل بنفسه وأن افتقاره إلى الله افتقار ذاتي لا ينفك عنه طرفة عين وأن النسب دائمة الحكم لبقاء وجود الأعيان وهو العزيز المنيع الحمى عن أن يدركه خلقه أو يحاط بشي‏ء من علمه إلا بما شاء وهو الغفور الذي ستر العقول عن إدراك كنهه أو كنه جلاله‏\n\n\n### [إن حياة الأجسام كلها من حياة الأرواح المدبرة لها]\n\n\nواعلم يا ولي نور الله بصيرتك بعد أن تقرر عندك إن حياة الأجسام كلها من حياة الأرواح المدبرة لها وبانفصالها عنها يكون الموت فيزول نظامهما إذ القوي الماسكة لها زالت بزوال الروح المدبر الذي وكله الله بتدبيرها\n\n\n### [إن الحياة حياتان‏]\n\n\nفاعلم إن الحياة في جميع الأشياء حياتان حياة عن سبب وهي الحياة التي ذكرناها ونسبناها\nإلى الأرواح وحياة أخرى ذاتية للأجسام كلها كحياة الأرواح للأرواح غير إن حياة الأرواح يظهر لها أثر في الأجسام المدبرة بانتشار ضوئها فيها وظهور قواها التي ذكرناها وحياة الأجسام الذاتية لها ليست كذلك فإن الأجسام ما خلقت مدبرة فبحياتها الذاتية التي لا يجوز زوالها عنها فإنها صفة نفسية لها بها تسبح ربها دائما سواء كانت أرواحها فيها أو لم تكن وما تعطيها أرواحها إلا هيأة أخرى عرضية في التسبيح بوجودها خاصة وإذا فارقتها الروح فارقها ذلك الذكر الخاص وهو الكلام المتعارف بيننا المحسوس تسبيحا كان أو غيره فيدرك المكاشف الحياة الذاتية التي في الأجسام كلها وإذا اتفق على أي جسم كان أمر يخرجه عن نظامه مثل كسر آنية أو كسر حجر أو قطع شجر فهو مثل قطع يد إنسان أو رجله يزول عنه حياة الروح المدبر له ويبقى عليه حياته الذاتية له فإنه لكل صورة في العالم روح مدبرة وحياة ذاتية تزول الروح بزوال تلك الصورة كالقتيل وتزول الصورة بزوال ذلك الروح كالميت الذي مات على فراشه ولم تضرب عنقه والحياة الذاتية لكل جوهر فيه غير زائلة وبتلك الحياة الذاتية التي أخذ الله بأبصار بعض الخلق عنها بها تشهد الجلود يوم القيامة على الناس والألسنة والأيدي والأرجل وبها تنطق فخذ الرجل في آخر الزمان فتخبر صاحبها بما فعل أهله وبها تنطق الشجرة في آخر الزمان إذا اختفى خلفها اليهود حين يطلبهم المسلمون للقتل فتقول للمسلم إذا رأته يطلب اليهودي يا مسلم هذا يهودي خلفي فاقتله إلا شجرة الغرقد فإنها تستر اليهودي إذا لاذ بها فلعنها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ولا يقال إن الشجرة إنما رأفت مع من استند إليها كما يراه أصحاب الخلق الكريم فلتعلم إن حق الله أحق بالقضاء وتصريف الخلق الكريم مع الله هو الأوجب على كل مؤمن أ لا تراه يقول ولا تَأْخُذْكُمْ بِهِما رَأْفَةٌ في دِينِ الله وإنما كانت هذه الحياة في الأشياء ذاتية لأنها عن التجلي الإلهي للموجودات كلها لأنه خلقها لعبادته ومعرفته ولا أحد من خلقه يعرفه إلا أن يتجلى له فيعرفه بنفسه إذ لم يكن في طاقة المخلوق أن يعرف خالقه كما قال الله تعالى وعَلَّمْناهُ من لَدُنَّا عِلْماً والتجلي دائم أبدا مشاهد لكل الموجودات ظاهر ما عدا الملائكة والإنس والجن فإن التجلي لهم الدائم إنما هو فيما ليس له نطق ظاهر كسائر الجمادات والنبات وأما التجلي لمن أعطى النطق والتعبير عما في نفسه وهم الملائكة والإنس والجن من حيث أرواحهم المدبرة لهم وقواها فإن التجلي لهم من خلف حجاب الغيب فالمعرفة للملائكة بالتعريف الإلهي لا بالتجلي والمعرفة للانس والجن بالنظر والاستدلال والمعرفة لأجسامهم ومن دونهم من المخلوقات بالتجلي الإلهي وذلك لأن سائر المخلوقات فطروا على الكتمان فلم يعطوا عبارة التوصيل وأراد الحق ستر هذا المقام رحمة بالمكلفين إذ سبق في علمه أنهم يكلفون وقد قدر عليهم المعاصي وقدر على بعضهم الاعتراض فيما لم يكن ينبغي لهم كالملائكة حين قالوا أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها وجرى ما جرى في قصة آدم معهم فلهذا وقع الستر عنهم لأنهم لو عصوه بالقضاء والقدر على التجلي والمشاهدة لكان عدم احترام عظيم وعدم حياء وكانت المؤاخذة عظيمة فكانت الرحمة لا تنالهم أبدا فلما عصوه على الستر قامت لهم الحجة في المعذرة ولهذا كانت الغفلة من الرحمة التي جعلها الله لعباده والنسيان ليجدوا بذلك حجة لو اعترض عليهم ويجدون بها عذرا ولهذا ما كلف الله أحدا من خلقه إلا الملائكة والإنس والجن وما عداهم فإن دوام التجلي لهم أعطاهم الحياة الذاتية الدائمة وهم في تسبيحهم مثلنا في أنفاسنا دوام متوال من غير مشقة نجده في تنفسنا بل الأنفاس عين الراحة لنا بل لولاها لمتنا أ لا ترى المخنوق إذا حيل بينه وبين خروج نفسه مات ووجد الألم فعلى هذا الحد هو تسبيح كل شي‏ء إن فهمت فالحق على الحقيقة هو مدبر العالم كما قال تعالى يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ يعني الدلالات على توحيده فيعطي كل خلق دلالة تخصه على توحيد موجدة كما قال القائل‏\n\n\n> وفي كل شي‏ء له آية *** تدل على أنه واحد\n\n\nوهي هذه الآيات التي يفصلها فيقسمها على خلقه بحسب ما فطرهم الله تعالى عليه فهو سبحانه روح العالم وسمعه وبصره ويده فبه يسمع العالم وبه يبصر وبه يتكلم وبه يبطش وبه يسعى إذ لا حول ولا قوة إلا بالله العلي العظيم ولا يعرف هذا إلا من تقرب إلى الله بنوافل الخيرات كما\n\n\nورد في الصحيح من الأخبار النبوية الإلهية فإذا تقرب العبد\nتعالى إليه بالنوافل أحبه وإذا أحبه قال الله تعالى فإذا أحببته كنت سمعه وبصره ويده وفي رواية كنت له سمعا وبصرا ويدا ومؤيدا\n\n\nفقوله كنت يدل على أنه كان الأمر على هذا وهو لا يشعر فكانت الكرامة التي أعطاه هذا التقرب الكشف والعلم بأن الله كان سمعه وبصره فهو يتخيل أنه يسمع بسمعه وهو يسمع بربه كما كان يسمع الإنسان في حال حياته بروحه في ظنه لجهله وفي نفس الأمر إنما يسمع بربه‏\n\n\nأ لا ترى نبيه الصادق في أهل القليب كيف قال ما أنتم بأسمع منهم حين خاطبهم فَهَلْ وَجَدْتُمْ ما وَعَدَ رَبُّكُمْ حَقًّا وكان قد جيفوا\n\n\nفما من أحد من المخلوقات إلا وهو يسمع ولكن فطروا على منع توصيل ما يعلمون ويسمعون وهذه الحياة التي تظهر لا عين الخلق عند خرق العوائد في إحياء الموتى كبقرة موسى وغيرها فالاسم الظاهر هو العالم إن تحققته فإنه للحق بمنزلة الجسم للروح المدبرة والاسم الباطن لما خفي عن الموجودات في نسبة الحياة لأنفسهم وبالمجموع يكون الإنسان إذ حده حيوان ناطق فالحيوانية صورته الظاهرة فإن الحيوانية مطابقة في الدلالة للجسم المتغذي الحساس إلا أنها أخصر فرجحوها في عالم العبارة للاختصار لأنها\n\n\nتساويها في الدلالة وهو ناطق من حيث معناه وليس معناه سوى ما ذكرناه فالعالم كله عندنا الذي هو عبارة عن كل ما سوى الله حيوان ناطق لكن تختلف أجسامه وأغذيته وحسه فهو الظاهر بالصورة الحيوانية وهو الباطن بالحياة الذاتية الكائنة عن التجلي الإلهي الدائم الوجود فما في الوجود إلا الله تعالى وأسماؤه وأفعاله فهو الأول من الاسم الظاهر وهو الآخر من الاسم الباطن فالوجود كله حق ما فيه شي‏ء من الباطل إذ كان المفهوم من إطلاق لفظ الباطل عدما ما فيما ادعى صاحبه أنه وجود فافهم ولو لم يكن الأمر كذلك لانفرد الخلق بالفعل ولم يكن الاقتدار الإلهي يعم جميع الممكنات بل كانت الإمكانات تزول عنه فسبحان الظاهر الذي لا يخفى وسبحان الخفي الذي لا يظهر حجب الخلق به عن معرفته وأعماهم بشدة ظهوره فهم منكرون مقرون مترددون حائرون مصيبون مخطئون والحمد لله الذي من علينا بمثل هذه المشاهد وجلا لأبصارنا هذه الحقائق فلم تقع لنا عين إلا عليه ولا كان منا استناد إلا إليه لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ ومن أراد أن يعرف حقيقة ما أو مات إليه في هذه المسألة فلينظر في خيال الستارة وصورة ومن الناطق في تلك الصور عند الصبيان الصغار الذين بعدوا عن حجاب الستارة المضروبة بينهم وبين اللاعب بتلك الأشخاص والناطق فيها فالأمر كذلك في صور العالم والناس أكثرهم أولئك الصغار الذين فرضناهم فتعرف من أين أتى عليهم فالصغار في ذلك المجلس يفرحون ويطربون والغافلون يتخذونه لهوا ولعبا والعلماء يعتبرون ويعلمون أن الله ما نصب هذا إلا مثلا ولذلك يخرج في أول الأمر شخص يسمى الوصاف فيخطب خطبة يعظم الله فيها ويمجده ثم يتكلم على كل صنف صنف من الصور التي تخرج بعده من خلف هذه الستارة ثم يعلم الجماعة أن الله نصب هذا مثلا لعباده ليعتبروا وليعلموا أن أمر العالم مع الله مثل هذه الصور مع محركها وأن هذه الستارة حجاب سر القدر المحكم في الخلائق ومع هذا كله يتخذونه الغافلون لهوا ولعبا وهو قوله تعالى الَّذِينَ اتَّخَذُوا دِينَهُمْ لَهْواً ولَعِباً ثم يغيب الوصاف وهو بمنزلة أول موجود فينا وهو آدم عليه السلام ولما غاب كان غيبته عنا عند ربه خلف ستارة غيبة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Seventeen: Concerning the Knowledge of the Station of Trial (منزل الابتلاء) and its Blessings.\n\nIt is the station of the Imam who is on the left of the Pole (القطب).\n\n> I marvel at a dwelling He built and perfected,\n> And housed within it a noble spirit, then wore it out.\n> He ruined it with the ruin of one who will not restore it;\n> Who will gather the scattered parts for me? Who will grant me its subsistence?\n> Yet He had elevated it by what He established;\n> Oh, would that I knew what had caused its ruin!\n> Why did He not build it initially and establish it\n> With the establishment of the Everlasting, whose countenance does not vanish?\n> It did nothing to deserve destruction;\n> How splendid it was, and how strong!\n> The hand of decay has played havoc with us and with it,\n> But after a time, He will restore it and elevate it.\n> And He will return that spirit to it, so it will settle\n> Upon its throne as a sovereign, and immortalize its dwelling.\n> And He will bequeath to it Eden and eternity by His grace,\n> Housing it in its Paradise (فردوس) and its final abode.\n\n### [That Life Belongs to All Spirits Governing Bodies]\n\nKnow, may Allah support you, O intimate friend and noble chosen one, that life (الحياة) belongs to all spirits governing bodies (الأرواح المدبرة الأجسام)—whether fiery, earthly, or luminous—just as light belongs to the sun. Life is a psychic attribute (وصف نفسي) for them. They do not manifest upon anything except that thing becomes alive, and the life of that manifesting spirit flows through it, just as the light of the sun flows through the body of the air, the surface of the earth, and every place upon which the sun appears. From this, one knows who the Spirit of the World (روح العالم) is, and from whom it derives its life, and what is the meaning of His saying, the Exalted: <<اللهُ نُورُ السَّماواتِ والْأَرْضِ>> (Allah is the Light of the heavens and the earth). Then He gave a similitude, saying: <<مَثَلُ نُورِهِ كَمِشْكاةٍ>> (The likeness of His Light is as a niche), which is the recess (الكوة), <<فِيها مِصْباحٌ>> (wherein is a lamp), which is the Light (النور), to the end of the analogy. Whoever understands the meaning of this verse knows that Allah preserves the World.\n\nThis verse is one of the secrets of Gnosis (المعرفة بالله) concerning the connection of the Deity (الإله) to the worshipped (المألوه) and the Lord (الرب) to the nurtured (المربوب). For if Allah did not perpetually undertake the preservation of the nurtured and the worshipped, it would instantly perish, since it would have no Preserver to guard it and maintain its subsistence (بقائه). If He were veiled from the World in the Unseen, the World would cease to exist. Hence, the Name the Manifest (الظاهر) perpetually governs existence (وجود), and the Name the Hidden (الباطن) governs knowledge (علما) and gnosis (معرفة). By the Manifest Name, the World is sustained; by the Hidden Name, we know Him; and by the Name the Light (النور), we witness Him (شهدناه).\n\nSince the life of the human being is our focus in this chapter—because it is the chapter of Trial (الابتلاء), which encompasses the responsible beings (المكلفين) of the two weighty ones (mankind and jinn), for everything other than the two weighty ones is not like us in the ruling of worship and responsibility—my discussion of the human being's life is my discussion of everything other than Allah, and my discussion of his trial is my discussion of every responsible being among the two weighty ones.\n\nThe Exalted said: <<وكانَ عَرْشُهُ عَلَى الْماءِ>> (And His Throne was upon the water). *‘Alā* (upon) here means *fī* (in), meaning the Throne was in the water, just as man is in the water, that is, created from it. For water is the origin of all existents (الموجودات), and it is the Throne of the Divine Life (الحياة الإلهية). From water, Allah created every living thing. Everything other than Allah is alive, for everything other than Allah glorifies Allah with His praise, and glorification only comes from the living. Reports have been transmitted concerning the life of everything wet and dry, inanimate (جماد), plant, earth, and heaven.\n\nThis is the point of dispute between the People of Unveiling (أهل الكشف) and those who lack it, and between the People of Faith and those who do not accept the Divine Laws (الشرائع) or those who interpret the Divine Laws contrary to their intended meaning, saying that this glorification is merely a glorification of state (تسبيح حال). As for that whose life is perceived by the senses, there is no dispute regarding its life. The dispute is only concerning the cause of its life and to what its glorification of its Lord returns, since glorification only comes from a living, rational being who comprehends it. Yet, everything besides mankind and jinn among the animals is considered irrational by the opponent, contrary to what we and the People of Unveiling and sound Faith believe. By \"rational\" here, I mean possessing Knowledge (العلم).\n\nThe Throne (العرش) here is an expression for the Dominion (الملك). The word *kāna* (was) is a word of existence (حرف وجودي), so its meaning is that the Dominion exists in the water, meaning the water is the origin of the manifestation of its entity (عينه). It is to the Dominion as the primordial matter (الهيولى) in which the forms of the World—which is Allah’s Dominion—appeared. The World is confined within entities (أعيان) and relations (نسب). The entities are existential (وجودية), and the relations are intelligible and non-existent (عدمية). This constitutes everything other than Allah.\n\nSince water is the origin of life, and everything is alive, and the relations are subordinate to it, He linked the Throne, which is placed upon the water, with His creation of death and life for the purpose of trial. He said: <<وكانَ عَرْشُهُ عَلَى الْماءِ لِيَبْلُوَكُمْ>> (And His Throne was upon the water, that He might try you)—that is, test you. The Throne, as I mentioned, consists of existing entities and non-existent relations. He said: <<خَلَقَ الْمَوْتَ والْحَياةَ لِيَبْلُوَكُمْ>> (He created death and life, that He might try you). Life is for the entities, and death is for the relations. The manifestation of the spirit to the body is the life of that body, just as the manifestation of the sun is the illumination of the bodies upon which the sun appears. The absence of the spirit from the body is the cessation of life from that body, which is death. Thus, union (الاجتماع) is life, and separation (الفرقة) is death. Union and separation are intelligible relations that have a manifest ruling, even though their entities are non-existent.\n\n### [That All Faculties in Man and Every Animal Belong to the Spirit]\n\nKnow that all the faculties (القوي) in man and in every animal—such as the faculty of sense, the faculty of imagination (الخيال), the faculty of memory, the formative faculty, and all other faculties attributed to all bodies, high and low—belong only to the spirit. They come into being through its existence and its granting of life to that body. What ceases in them ceases when the spirit turns away from that body in the specific manner that gave rise to that particular faculty. Understand this.\n\nIf the spirit turns away from the body entirely, all faculties and life cease with its cessation—this is what is expressed as death, like night following the setting of the sun. As for sleep (النوم), it is not a complete turning away; rather, it is a veil of vapors (حجب أبخرة) that intervenes between the faculties and their sensory perceptions, while life remains in the sleeper. This is like the sun when clouds intervene between it and a specific place on earth: the light remains present, like life, even if the perception of the sun does not reach that place veiled by the dense clouds.\n\nJust as the sun, when it leaves this place on earth and night takes its place, appears in another place, illuminating it with its light, so that it is daytime there as it was here; similarly, the spirit, when it turns away from this body by which it lived, manifests upon one of the forms (صور) of the Barzakh (البرزخ). *Al-Sūr* (الصور) here is the plural of *sūra* (form). That form becomes alive by this spirit in the Barzakh.\n\nAs the Prophet (peace and blessings be upon him) said concerning the soul (نسمة) of the believer, that it is a green bird. That bird is like the body here—a form made alive by this spirit that used to give life to this body. And just as the sun rises upon us on the second day, and existents are illuminated by its light, so too the spirit rises upon these dead bodies on the Day of Resurrection (يوم الآخرة), and they become alive by it. That is the Resurrection (النشر والبعث).\n\n### [That Allah Created the Trumpet]\n\nKnow that Allah created the Trumpet (الصور) in the shape of a horn (القرن). It is called *al-Sūr* (the Trumpet) by way of naming a thing after something adjacent to it or related to it, because this horn is the locus for all Barzakhi forms to which the spirits transfer after death and during sleep. The shape of the horn is wide at the top and narrow at the bottom, mirroring the shape of the World (العالم)—where is the vastness of the Throne (العرش) compared to the narrowness of the Earth?\n\nThe faculties transfer with the spirit to that Barzakhi form, both in sleep and death. This is why the spirit is perceptive with all its faculties equally. I have thus informed you of the reality of the matter.\n\nIt is from this point that the proponents of transmigration (التناسخ) erred. When they saw or heard that the Prophets had warned that spirits transfer to these Barzakhi forms, taking the shape of their moral qualities (أخلاقها), and they observed those qualities in animals, they mistakenly imagined that the words of the Prophets, Messengers, and scholars referred to these animals in the terrestrial world, believing that the process was one of purification (التخليص). They mentioned what you already know of their doctrine, thus erring in their reflection and in their interpretation of the sayings of the Messengers and the revealed Scriptures. They saw that the sleeper approaches this matter which they legislated for themselves, and they found comfort in that for their doctrine. Their error came only from the poor interpretation of sound doctrine.\n\nThis is the meaning of His saying: <<لِيَبْلُوَكُمْ>> (that He might try you)—that is, test your intellects (عقولكم) through death and life, <<أَيُّكُمْ أَحْسَنُ عَمَلًا>> (which of you is best in deed) by engaging in them and reflecting, so that He may see who among you is correct and who errs, like the people of transmigration.\n\nHe made all of this a clear proof (دليلا واضحا) and established it as a decisive demonstration of His Name the Living (الحي), His Name the Light (النور), His Name the Manifest (الظاهر) and the Hidden (الباطن), the First (الأول) and the Last (الآخر), so that the World may know its relation to its Creator, and that it is not independent (غير مستقل بنفسه), and that its need for Allah is essential (افتقار ذاتي), never ceasing for a blink of an eye, and that the relations maintain their ruling due to the subsistence of the entities’ existence. He is the Mighty (العزيز), whose sanctuary is inviolable (المنيع الحمى), beyond the grasp of His creation, and whose knowledge cannot be encompassed except by what He wills. He is the Forgiving (الغفور), who veiled intellects from perceiving His essence (كنهه) or the essence of His Majesty.\n\n### [That the Life of All Bodies Comes from the Life of the Spirits Governing Them]\n\nKnow, O friend, may Allah illuminate your insight, after it has been established for you that the life of all bodies comes from the life of the spirits governing them, and that separation from them results in death, causing the dissolution of their system, since the faculties retaining them vanish with the departure of the governing spirit entrusted by Allah with their administration.\n\n### [That Life is Twofold]\n\nKnow that life in all things is twofold: life due to a cause (حياة عن سبب), which is the life we mentioned and attributed to the spirits; and another life that is essential (حياة ذاتية) to all bodies, similar to the life of spirits inherent to spirits.\n\nHowever, the life of the spirits manifests an effect in the governed bodies through the diffusion of its light within them and the appearance of the faculties we mentioned. The essential life inherent to the bodies is not like this, for bodies were not created to govern. By their essential life, which cannot cease—for it is a psychic attribute (صفة نفسية) for them—they perpetually glorify their Lord, whether their spirits are present or not. Their spirits only grant them another, accidental state (هيأة أخرى عرضية) in glorification, specific to their presence. When the spirit departs, that specific remembrance departs, which is the sensible, customary speech (الكلام المتعارف بيننا), whether glorification or otherwise.\n\nThe one who receives Unveiling (المكاشف) perceives this essential life in all bodies. If any body suffers an event that removes it from its system—such as the breaking of a vessel, the breaking of a stone, or the cutting of a tree—it is like cutting off a human hand or foot: the life of the governing spirit departs from it, but its essential life remains. For every form in the World, there is a governing spirit and an essential life. The spirit departs with the cessation of that form, like the slain person; and the form departs with the cessation of that spirit, like the person who dies in his bed without being decapitated. The essential life inherent in every substance is non-ceasing.\n\nIt is by this essential life, which Allah has veiled from the sight of some creatures, that the skins, tongues, hands, and feet will bear witness (تشهد) against people on the Day of Resurrection, and by it they will speak. By it, the thigh will speak at the End of Time, informing its owner of what his family did. By it, the tree will speak at the End of Time when the Jews hide behind it as the Muslims seek to kill them, saying to the Muslim when he sees him seeking the Jew: \"O Muslim, there is a Jew behind me, kill him,\" except for the Gharkad tree, which conceals the Jew when he seeks refuge in it. The Messenger of Allah (peace and blessings be upon him) cursed it.\n\nIt should not be said that the tree showed compassion (رأفت) to the one who sought refuge in it, as those with noble character (الخلق الكريم) might see. Know that the right of Allah is more deserving of judgment, and the application of noble character must be subservient to Allah's command, as He says: <<ولا تَأْخُذْكُمْ بِهِما رَأْفَةٌ في دِينِ الله>> (Let no pity for them restrain you in the religion of Allah).\n\nThis life is essential to things because it stems from the Divine Theophany (التجلي الإلهي) to all existents, for He created them for His worship and Gnosis (معرفته). None of His creation knows Him unless He discloses Himself to him, so he knows Him by Himself, since it is not within the capacity of the created to know the Creator, as Allah the Exalted said: <<وعَلَّمْناهُ من لَدُنَّا عِلْماً>> (And We taught him knowledge from Our presence).\n\nThe Theophany is perpetual and witnessed by all existents that lack manifest speech, such as inanimate objects and plants, but not by the angels, mankind, and jinn. For the latter three, the perpetual Theophany is only in things that lack manifest speech. As for the Theophany to those granted speech and expression of what is within themselves—namely the angels, mankind, and jinn, in terms of their governing spirits and their faculties—the Theophany comes to them from behind the Veil of the Unseen (حجاب الغيب). Thus, the Gnosis of the angels is through Divine instruction (التعريف الإلهي), not Theophany. The Gnosis of mankind and jinn is through reflection and inference (النظر والاستدلال). The Gnosis of their bodies and the creatures below them is through the Divine Theophany.\n\nThis is because the rest of creation was created to conceal (الكتمان) and was not given the means of communication. The Real (الحق) desired to veil this station out of mercy for the responsible beings (المكلفين), since He knew in His prior knowledge that they would be charged with duties and that sins were decreed upon them, and that objection was decreed upon some of them where it should not have been, such as the angels when they said: <<أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها>> (Will You place therein one who will spread corruption?), and what transpired in the story of Adam with them. Therefore, the veil was placed over them, for had they disobeyed Him by decree and destiny while witnessing the Theophany and the Witnessing (الشهود), the lack of respect and shame would have been immense, and the accountability severe, so that mercy would never reach them. But since they disobeyed Him under the veil, they have a basis for excuse. This is why heedlessness (الغفلة) and forgetfulness (النسيان) are part of the mercy Allah granted His servants, so that they might find an excuse if challenged.\n\nFor this reason, Allah only charged the angels, mankind, and jinn with responsibility. As for everything else, the permanence of the Theophany granted them the perpetual essential life. Their glorification is like our breathing: a continuous succession without the hardship we find in our respiration. Indeed, breathing is the very source of our comfort; without it, we would die. Do you not see that the strangled person, when prevented from exhaling his breath, dies and feels pain? The glorification of everything is on this same principle, if you understand.\n\nThe Real (الحق) is truly the Governor of the World, as the Exalted said: <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ>> (He governs the affair, detailing the signs)—meaning the indications of His Oneness. He gives every creature a specific indication of the Oneness of its Creator, as the poet said:\n\n> And in everything there is a sign for Him,\n> Indicating that He is One.\n\nThese are the signs (الآيات) that He details and distributes among His creation according to the nature upon which Allah created them. Thus, He, the Glorified, is the Spirit, the Hearing, the Sight, and the Hand of the World. By Him, the World hears, by Him it sees, by Him it speaks, by Him it strikes, and by Him it strives, for there is no power or strength save in Allah, the High, the Great.\n\nThis is known only by those who draw near to Allah through supererogatory acts (نوافل الخيرات), as stated in the authentic Prophetic Divine reports. When the servant draws near to the Exalted through supererogatory acts, He loves him. And when He loves him, Allah the Exalted says: \"If I love him, I am his hearing, his sight, and his hand.\" In another narration: \"I am for him hearing, sight, and a hand, and a supporter.\"\n\nHis saying \"I am\" (كنت) indicates that the matter was already thus, but the servant was unaware. The honor granted by this proximity is the Unveiling (الكشف) and the Knowledge that Allah was his hearing and sight. He imagines he hears with his own hearing, but he hears by his Lord, just as man hears by his spirit during his life, in his assumption due to his ignorance, while in reality, he hears only by his Lord.\n\nDo you not see His truthful Prophet, when addressing the people of the well (أهل القليب), how he said: \"You do not hear better than they do,\" when he spoke to them: <<فَهَلْ وَجَدْتُمْ ما وَعَدَ رَبُّكُمْ حَقًّا>> (Have you found what your Lord promised you to be true?), even though they were corpses?\n\nThere is no creature that does not hear, but they are naturally prevented from communicating what they know and hear. This life that appears to the eye of creation when customs are broken (خرق العوائد), such as the resurrection of the dead like the cow of Moses and others, is the Manifest Name (الاسم الظاهر).\n\nThe World (العالم) is the Manifest Name, if you realize it, for it is to the Real (الحق) as the body is to the governing spirit. The Hidden Name (الاسم الباطن) relates to what is concealed from existents in their attribution of life to themselves. Man (الإنسان) is the composite of both, since his definition is \"speaking animal\" (حيوان ناطق). The animal aspect (الحيوانية) is his manifest form, corresponding in indication to the sensitive, nourishing body, but it is more concise, so they preferred it in the realm of expression for brevity, as it is equivalent in indication. He is \"speaking\" (ناطق) in terms of his inner meaning, and his meaning is nothing other than what we have mentioned.\n\nThe entire World, which is everything other than Allah, is, in our view, a speaking animal, though its bodies, nourishment, and senses differ. It is the Manifest through the animal form and the Hidden through the essential life resulting from the perpetual Divine Theophany.\n\nThere is nothing in Existence (الوجود) except Allah, His Names, and His Acts. He is the First (الأول) by the Name the Manifest, and the Last (الآخر) by the Name the Hidden. All Existence is the Real (حق); there is nothing false (باطل) in it, since the concept of falsehood implies non-existence where existence was claimed. Understand this. If the matter were not so, creation would be independent in action, and the Divine Power would not encompass all possibilities (الممكنات); rather, the possibilities would cease to be under His control.\n\nGlory be to the Manifest who is not hidden, and glory be to the Hidden who does not manifest! He veiled creation from knowing Him and blinded them by the intensity of His manifestation. They are deniers, affirmers, hesitant, bewildered, correct, and mistaken. Praise be to Allah who favored us with such Witnessings (المشاهد) and clarified these Realities (الحقائق) for our sight, so that our gaze falls upon none but Him, and our reliance is upon none but Him. <<لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the Mighty, the Wise).\n\nWhoever wishes to know the reality of what I have alluded to in this matter should look at the shadow play (خيال الستارة) and the image of the speaker in those forms, as seen by young children who are far from the curtain (الستارة) separating them from the player and the speaker within the figures. The matter is similar regarding the forms of the World, and most people are those children we hypothesized. You will know where their error came from. The children in that assembly rejoice and are delighted, while the heedless take it as diversion and play, and the scholars reflect and know that Allah established this only as a parable (مثلا) for His servants, so they may reflect and know that the affair of the World with Allah is like these figures with their mover, and that this curtain is the veil of the secret of the Decree (سر القدر) firmly established in creation. Yet, despite all this, the heedless take it as diversion and play, which is His saying, the Exalted: <<الَّذِينَ اتَّخَذُوا دِينَهُمْ لَهْواً ولَعِباً>> (Those who took their religion as diversion and play).\n\nThen the Announcer (الوصاف) disappears. He is analogous to the first existent among us, Adam (peace be upon him). His disappearance from us is his absence with his Lord behind the curtain of the Unseen. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "**باب نمبر تین سو سترہ** آزمائش (الابتلاء) کے مقام اور اس کی برکات کی معرفت میں۔\n\nاور یہ قطب کے بائیں جانب والے امام کا مقام ہے۔\n\n> میں اس گھر پر حیران ہوں جسے اس نے بنایا اور سنوارا،\n> اور اس میں ایک معزز روح کو بسایا اور پھر اسے بوسیدہ کر دیا۔\n> اور اسے اس طرح ویران کیا جیسے اسے دوبارہ آباد نہیں کرنا،\n> تو کون ہے جو میرے لیے اس بکھرے ہوئے کو جمع کرے؟ کون ہے جو میرے لیے اس کی بقا کا ضامن ہو؟\n> اور وہ اس چیز سے بلند تھا جسے اس نے قائم کیا،\n> کاش میں جانتا کہ اسے کس چیز نے تباہ کیا؟\n> اور اس نے اسے پہلے کیوں نہ بنایا اور اسے قائم نہ رکھا،\n> ایسی بقا کے ساتھ جس کا وجود زائل نہ ہو؟\n> اور اس نے ایسا کچھ نہیں کیا جو اسے تباہی کا مستحق بناتا،\n> تو وہ کتنا شاندار تھا اور کتنا مضبوط!\n> یقیناً ہم میں اور اس میں فنا (البلیٰ) کے ہاتھ نے کھیل کھیلا،\n> اور ایک زمانے کے بعد، اس نے اسے واپس کیا اور پھر اسے بلند کیا۔\n> اور اس روح کو اس کی طرف لوٹا دیا، تو وہ اس کے عرش پر بادشاہ بن کر مستوی ہوا، اور اس کے قیام کو دائمی بنا دیا۔\n> اور اس نے اسے اپنی عنایت سے عدن اور خلد کا وارث بنایا،\n> پھر اسے اس کے فردوس اور اس کے ٹھکانے میں بسایا۔\n\n### [کہ حیات تمام اجسام کی تدبیر کرنے والی ارواح کے لیے ہے]\n\nجان لو، اللہ تمہاری مدد کرے، اے میرے گہرے دوست اور معزز برگزیدہ (الصفي الكريم)، کہ تمام اجسام—خواہ ناری ہوں یا ترابی اور نوری—کو تدبیر کرنے والی ارواح کے لیے حیات (الحياة) سورج کی روشنی کی طرح ہے۔ حیات (الحياة) ان کے لیے ایک نفسیاتی وصف ہے۔ چنانچہ وہ جس چیز پر بھی ظاہر ہوتے ہیں، وہ چیز زندہ ہو جاتی ہے اور اس روح کی حیات اس میں سرایت کر جاتی ہے جو اس پر ظاہر ہوئی ہے، جیسے سورج کی روشنی ہوا کے جسم، زمین کی سطح اور ہر اس جگہ میں سرایت کرتی ہے جس پر سورج ظاہر ہوتا ہے۔ اسی سے یہ معلوم ہوتا ہے کہ عالم کی روح کون ہے، اور وہ کس سے اپنی حیات حاصل کرتا ہے، اور اللہ تعالیٰ کے اس قول کا کیا مطلب ہے:\n**اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ** (اللہ آسمانوں اور زمین کا نور ہے)\nپھر اس نے مثال دی اور فرمایا:\n**مَثَلُ نُورِهِ كَمِشْكاةٍ** (اس کے نور کی مثال ایک طاق کی سی ہے)\nاور مشکاۃ (المشكاة) طاق کو کہتے ہیں،\n**فِيها مِصْباحٌ** (جس میں ایک چراغ ہو)\nتشبیہ کے آخر تک۔ جس نے اس آیت کا مفہوم سمجھ لیا، اس نے عالم کی حفاظت کو جان لیا۔ یہ آیت اللہ تعالیٰ کی معرفت (المعرفۃ) کے اسرار میں سے ہے، جو معبود (المألوه) کے ساتھ الٰہ کے اور مربوب کے ساتھ رب کے تعلق کو بیان کرتی ہے۔ اگر اللہ تعالیٰ ہمیشہ مربوب اور معبود کی حفاظت نہ فرماتا تو وہ اسی لمحے فنا ہو جاتا، کیونکہ اس کے پاس کوئی محافظ نہیں جو اسے محفوظ رکھے اور اس کی بقا کو برقرار رکھے۔ اگر وہ عالم سے غیب میں پردہ کر لیتا تو عالم معدوم ہو جاتا۔ اسی لیے اسم الظاہر (الاسم الظاهر) ہمیشہ وجود (الوجود) پر حاکم ہے، یا اسم الباطن (الاسم الباطن) علم اور معرفت (المعرفۃ) پر حاکم ہے۔ اسم الظاہر (الاسم الظاهر) کے ذریعے عالم کو باقی رکھا گیا، اور اسم الباطن (الاسم الباطن) کے ذریعے ہم نے اسے پہچانا، اور اسم النور (الاسم النور) کے ذریعے ہم نے اس کا شہود (الشہود) کیا۔\nچونکہ انسان کی حیات، جو اس باب میں ہمارا مقصود ہے—کیونکہ یہ باب ابتلا (الابتلاء) کا ہے اور یہ جن و انس (الثقلین) دونوں مکلفین کو شامل ہے، کیونکہ جن و انس کے علاوہ تمام مخلوقات عبادت اور تکلیف کے حکم میں ہماری طرح نہیں ہیں—تو میرا کلام صرف انسان کی حیات کے بارے میں، اللہ کے سوا ہر چیز کے بارے میں میرا کلام ہے۔ اور میرا کلام اس کی آزمائش (ابتلا) کے بارے میں، جن و انس کے ہر مکلف کے بارے میں میرا کلام ہے۔\nاللہ تعالیٰ نے فرمایا: **وَكَانَ عَرْشُهُ عَلَى الْمَاءِ** (اور اس کا عرش پانی پر تھا)\nیہاں \"علیٰ\" (عَلَى) کا معنی \"فی\" (میں) ہے، یعنی عرش پانی میں تھا، جیسے انسان پانی میں ہوتا ہے، یعنی اسی سے اس کی تخلیق ہوتی ہے۔ کیونکہ پانی تمام موجودات کی اصل ہے، اور یہ حیات الٰہیہ کا عرش (العرش) ہے۔ اور اللہ نے پانی سے ہر زندہ چیز کو پیدا کیا۔ اور اللہ کے سوا ہر چیز زندہ ہے، کیونکہ اللہ کے سوا ہر چیز اللہ کی حمد کے ساتھ تسبیح کرتی ہے، اور تسبیح صرف زندہ سے ہی ہو سکتی ہے۔ اور یہ خبریں وارد ہوئی ہیں کہ ہر تر و خشک، جماد، نبات، زمین اور آسمان زندہ ہیں۔\nاور یہی وہ مسئلہ ہے جس میں اہل کشف (الکشف) اور ان کے علاوہ ان لوگوں کے درمیان اختلاف پایا جاتا ہے جنہیں کشف حاصل نہیں، اور اہل ایمان اور ان لوگوں کے درمیان جو شرائع کو نہیں مانتے یا شرائع کی تاویل اس طرح کرتے ہیں جو ان کے لیے نہیں آئی، وہ کہتے ہیں کہ یہ حال کی تسبیح ہے۔\nلیکن جس کی حیات کا ادراک حس سے ہوتا ہے، اس کی حیات میں کوئی اختلاف نہیں، بلکہ اختلاف اس کی حیات کے سبب میں ہے کہ وہ کیا ہے، اور اس کے رب کی حمد کے ساتھ تسبیح کرنے میں ہے کہ وہ کس چیز کی طرف لوٹتی ہے، کیونکہ تسبیح صرف زندہ، عاقل سے ہی ہو سکتی ہے جو اس کو سمجھتا ہو۔ اور انسان اور جن کے علاوہ حیوانات مخالفین کے نزدیک عاقل نہیں ہیں، برخلاف اس کے جو ہم اور اہل کشف (الکشف) اور صحیح ایمان والے اعتقاد رکھتے ہیں۔ اور یہاں عقل سے میری مراد علم ہے۔\nتو یہاں عرش (العرش) سے مراد ملک (بادشاہت) ہے۔ اور \"کان\" (کان) ایک وجودی حرف ہے، تو اس کا مطلب ہے کہ بادشاہت پانی میں موجود تھی، یعنی پانی اس کی عین (حقیقت) کے ظہور کی اصل ہے۔ پس یہ بادشاہت کے لیے ہیولیٰ (مادہ) کی طرح ہے، جس میں عالم کی صورتیں ظاہر ہوئیں، جو اللہ کی بادشاہت ہے۔ اور عالم اعیان (الاعیان) اور نسبتوں (النسب) میں محدود ہے۔ اعیان (الاعیان) وجودی ہیں اور نسبتیں (النسب) معقول اور عدمی ہیں۔ اور یہی اللہ کے سوا سب کچھ ہے۔\nاور چونکہ پانی حیات کی اصل ہے اور ہر چیز زندہ ہے، اور نسبتیں اس کے تابع ہیں، اس لیے اللہ نے پانی پر بنائے گئے عرش (العرش) کو ابتلا (الابتلاء) میں موت اور حیات کی تخلیق کے ساتھ جوڑ دیا، اور فرمایا:\n**وَكَانَ عَرْشُهُ عَلَى الْمَاءِ لِيَبْلُوَكُمْ** (اور اس کا عرش پانی پر تھا تاکہ وہ تمہیں آزمائے)\nیعنی تمہارا امتحان لے۔ اور عرش (العرش)، جیسا کہ میں نے تمہیں بتایا، موجود اعیان (الاعیان) اور عدمی نسبتیں (النسب) ہیں۔ اور فرمایا:\n**خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ** (اس نے موت اور حیات کو پیدا کیا تاکہ وہ تمہیں آزمائے)\nتو حیات اعیان (الاعیان) کے لیے ہے اور موت نسبتوں (النسب) کے لیے ہے۔ روح کا جسم پر ظاہر ہونا اس جسم کی حیات ہے، جیسے سورج کا ان اجسام کو روشن کرنے کے لیے ظاہر ہونا جن پر سورج ظاہر ہوا ہے۔ اور روح کا جسم سے غائب ہونا اس جسم سے حیات کا زائل ہو جانا ہے، اور یہی موت ہے۔ پس اجتماع حیات ہے اور جدائی موت ہے۔ اور اجتماع اور افتراق معقول نسبتیں (النسب) ہیں جن کا حکم ظاہر ہے، اگرچہ وہ اعیان (الاعیان) کے لحاظ سے معدوم ہیں۔\n\n### [کہ انسان اور ہر حیوان میں موجود تمام قوتیں روح کے لیے ہیں]\n\nاور جان لو کہ انسان میں اور ہر حیوان میں موجود تمام قوتیں (القویٰ)، جیسے قوت حس، قوت خیال، قوت حفظ، قوت مصورہ اور تمام اجسام میں منسوب دیگر تمام قوتیں، خواہ وہ اوپر ہوں یا نیچے، وہ سب روح (الروح) کے لیے ہیں۔ یہ اس کے وجود اور اس جسم کو حیات دینے سے پیدا ہوتی ہیں، اور جب روح اس جسم سے اس خاص پہلو سے منہ موڑ لیتی ہے جس سے وہ قوت پیدا ہوئی تھی، تو وہ قوت اس میں معدوم ہو جاتی ہے۔ پس سمجھو!\nجب روح جسم سے کلی طور پر اعراض کرتی ہے، تو اس کے زائل ہونے سے تمام قوتیں اور حیات زائل ہو جاتی ہیں، جسے موت سے تعبیر کیا جاتا ہے، جیسے سورج کے غروب ہونے سے رات کا آنا۔\nلیکن نیند میں کلی اعراض نہیں ہوتا، بلکہ یہ بخارات کے پردے ہوتے ہیں جو قوتوں اور ان کے حسی مدرکات کے درمیان حائل ہو جاتے ہیں، جبکہ سونے والے میں حیات موجود رہتی ہے، جیسے سورج اور زمین کے کسی خاص مقام کے درمیان بادل حائل ہو جائیں، تو روشنی حیات کی طرح موجود رہتی ہے، اگرچہ سورج کا ادراک اس مقام پر نہ ہو سکے جس کے اور سورج کے درمیان گھنے بادل حائل ہو گئے ہیں۔\nاور جیسے جب سورج زمین کے اس مقام کو چھوڑ دیتا ہے اور اس کی جگہ رات آ جاتی ہے، تو وہ کسی دوسرے مقام پر اپنے نور کے ساتھ ظاہر ہوتا ہے، جس سے وہ مقام روشن ہو جاتا ہے، تو وہاں دن ہو جاتا ہے جیسا کہ یہاں تھا۔ اسی طرح جب روح اس جسم سے اعراض کرتی ہے جس کے ذریعے اس کی حیات تھی، تو وہ برزخ (البرزخ) کی صورتوں میں سے کسی صورت پر تجلی (التجلی) کرتی ہے، اور برزخ (البرزخ) صاد کے ساتھ، صورت کی جمع ہے۔ پس اس روح کے ذریعے وہ صورت برزخ میں زندہ ہو جاتی ہے، جیسا کہ:\n**قال صَلَّى اللهُ عَليهِ وسَلَّم في نسمة المؤمن إنه طير أخضر** (نبی اکرم صلی اللہ علیہ وسلم نے مومن کی روح کے بارے میں فرمایا کہ وہ ایک سبز پرندہ ہے)\nتو وہ پرندہ یہاں جسم کی طرح ایک صورت ہے جو اس روح کے ذریعے زندہ ہوئی ہے جس کے ذریعے یہ جسم زندہ تھا۔ اور جیسے سورج دوسرے دن ہم پر طلوع ہوتا ہے اور موجودات اس کے نور سے روشن ہو جاتی ہیں، اسی طرح روح آخرت کے دن ان مردہ اجسام پر طلوع ہو گی اور وہ اس کے ذریعے زندہ ہو جائیں گے، اور یہی نشر اور بعث ہے۔\n\n### [کہ اللہ نے صور (سینگ) کو پیدا کیا]\n\nاور جان لو کہ صور (الصور) کو اللہ نے سینگ (القرن) کی صورت پر پیدا کیا، اور اسے صور (الصور) کا نام اس لیے دیا گیا کہ کسی چیز کو اس کے پڑوس یا کسی سبب سے اس کے نام سے موسوم کیا جائے۔ اور چونکہ یہ سینگ (القرن) تمام برزخی صورتوں کا محل ہے جن کی طرف ارواح موت کے بعد اور نیند میں منتقل ہوتی ہیں، اس لیے اسے صور (الصور) کہا گیا، جو صورت کی جمع ہے۔ اور سینگ کی شکل اوپر سے چوڑی اور نیچے سے تنگ ہوتی ہے، جو عالم کی شکل کے مطابق ہے، کہ عرش (العرش) کی وسعت کے مقابلے میں زمین کی تنگی ہے۔\nاور قوتیں روح کے ساتھ اس برزخی صورت کی طرف منتقل ہوتی ہیں، خواہ نیند میں ہوں یا موت میں۔ اسی لیے وہ تمام قوتوں کے ساتھ ادراک کرنے والی ہوتی ہے۔\nمیں نے تمہیں بتا دیا کہ معاملہ کیا ہے۔ اور اسی وجہ سے تناسخ (التناسخ) کے قائلین گمراہ ہوئے، جب انہوں نے دیکھا یا سنا کہ انبیاء نے ارواح کے ان برزخی صورتوں کی طرف منتقل ہونے پر تنبیہ کی ہے، اور وہ ان میں اپنے اخلاق کی صورتوں پر ہوں گی، اور انہوں نے وہ اخلاق حیوانات میں دیکھے، تو انہوں نے انبیاء، رسولوں اور علماء کے قول میں یہ گمان کیا کہ یہ دنیاوی گھر میں موجود ان حیوانات کی طرف لوٹنا ہے، اور یہ کہ وہ نجات کے لیے لوٹتے ہیں۔ اور انہوں نے اپنے مذہب کا ذکر کیا جو تم جانتے ہو، پس انہوں نے نظر میں اور رسولوں کے اقوال اور نازل شدہ کتابوں میں جو کچھ آیا ہے، اس کی تاویل میں غلطی کی۔ اور انہوں نے دیکھا کہ سونے والا اس معاملے کے قریب ہوتا ہے جس میں انہوں نے قدم رکھا، تو انہوں نے اس سے اپنے مذہب کے لیے سکون حاصل کیا، حالانکہ ان پر یہ غلطی صحیح قول کی بری تاویل کی وجہ سے آئی۔\nاور یہی اس قول کا معنی ہے: **لِيَبْلُوَكُمْ** (تاکہ وہ تمہیں آزمائے) یعنی تمہاری عقلوں کو موت اور حیات کے ذریعے آزمائے،\n**أَيُّكُمْ أَحْسَنُ عَمَلًا** (کہ تم میں سے کون عمل میں بہتر ہے)\nان دونوں میں غور و فکر کرنے اور دیکھنے سے، تاکہ وہ دیکھے کہ تم میں سے کون درست ہے اور کون غلطی پر ہے، جیسے اہل تناسخ (التناسخ)۔\nاور اس نے یہ سب کچھ اپنی ذات حق (الحق) کے اسم الحی (زندہ)، اسم النور (نور)، اسم الظاہر (ظاہر)، اسم الباطن (باطن)، اسم الاول (اول) اور اسم الآخر (آخر) پر واضح دلیل اور قطعی برہان کے طور پر قائم کیا، تاکہ عالم کا اپنے موجد سے تعلق معلوم ہو جائے، اور یہ کہ وہ بذات خود مستقل نہیں ہے، اور یہ کہ اس کا اللہ کا محتاج ہونا ذاتی افتقار ہے جو پلک جھپکنے کے برابر بھی اس سے جدا نہیں ہو سکتا، اور یہ کہ نسبتیں (النسب) اعیان (الاعیان) کے وجود (الوجود) کی بقا کی وجہ سے دائمی حکم رکھتی ہیں۔ اور وہ العزیز (غالب) ہے، جس کی پناہ گاہ محفوظ ہے اس سے کہ اس کی مخلوق اس کا ادراک کر سکے یا اس کے علم میں سے کسی چیز کا احاطہ کر سکے، مگر جتنا وہ چاہے، اور وہ الغفور (بخشنے والا) ہے جس نے عقلوں کو اس کی حقیقت یا اس کے جلال کی حقیقت کے ادراک سے پردہ میں رکھا ہے۔\n\n### [کہ تمام اجسام کی حیات ان کی تدبیر کرنے والی ارواح کی حیات سے ہے]\n\nاور جان لو، اے ولی، اللہ تمہاری بصیرت کو نور بخشے، اس کے بعد کہ تمہارے نزدیک یہ بات ثابت ہو چکی ہے کہ تمام اجسام کی حیات ان کی تدبیر کرنے والی ارواح کی حیات سے ہے، اور ان کے جدا ہونے سے موت واقع ہوتی ہے، تو ان کا نظام زائل ہو جاتا ہے، کیونکہ ان کو تھامنے والی قوتیں اس مدبر روح کے زائل ہونے سے زائل ہو گئیں جسے اللہ نے ان کی تدبیر پر مقرر کیا تھا۔\n\n### [کہ حیات دو طرح کی ہے]\n\nتو جان لو کہ تمام چیزوں میں حیات دو طرح کی ہے: ایک حیات سبب (سبب) سے ہے، اور یہ وہی حیات ہے جس کا ہم نے ذکر کیا اور اسے ارواح کی طرف منسوب کیا۔ اور دوسری حیات اجسام سب کے لیے ذاتی (ذاتیۃ) ہے، جیسے ارواح کے لیے ارواح کی حیات۔ فرق یہ ہے کہ ارواح کی حیات اپنے نور کے ان اجسام میں پھیلنے اور ان قوتوں کے ظاہر ہونے سے جو ہم نے ذکر کیں، مدبر اجسام میں اپنا اثر ظاہر کرتی ہے۔ جبکہ اجسام کی ذاتی حیات ایسی نہیں ہے۔ کیونکہ اجسام تدبیر کرنے کے لیے پیدا نہیں کیے گئے تھے۔\nان کی ذاتی حیات، جس کا ان سے زائل ہونا جائز نہیں، کیونکہ یہ ان کی نفسیاتی صفت ہے، اسی کے ذریعے وہ ہمیشہ اپنے رب کی تسبیح کرتے ہیں، خواہ ان کی ارواح ان میں ہوں یا نہ ہوں۔ اور ان کی ارواح انہیں صرف تسبیح میں ایک اور عارضی ہیئت دیتی ہیں، جو خاص طور پر ان کے وجود کے ساتھ ہوتی ہے۔ اور جب روح ان سے جدا ہو جاتی ہے، تو وہ خاص ذکر بھی ان سے جدا ہو جاتا ہے، جو ہمارے درمیان محسوس اور معروف کلام ہے، خواہ وہ تسبیح ہو یا کچھ اور۔\nمکاشف (المکاشف) تمام اجسام میں موجود ذاتی حیات (الحياة الذاتية) کا ادراک کرتا ہے۔ اور اگر کسی بھی جسم پر کوئی ایسا امر واقع ہو جو اسے اس کے نظام سے خارج کر دے، جیسے کسی برتن کا ٹوٹنا، یا پتھر کا ٹوٹنا، یا درخت کا کٹنا، تو یہ انسان کے ہاتھ یا پاؤں کے کٹنے کی طرح ہے، اس سے مدبر روح کی حیات زائل ہو جاتی ہے، لیکن اس کی ذاتی حیات باقی رہتی ہے۔ کیونکہ عالم میں ہر صورت کے لیے ایک مدبر روح اور ایک ذاتی حیات ہوتی ہے۔ روح اس صورت کے زائل ہونے سے زائل ہو جاتی ہے، جیسے مقتول۔ اور صورت اس روح کے زائل ہونے سے زائل ہو جاتی ہے، جیسے وہ میت جو اپنے بستر پر مرا ہو اور اس کی گردن نہ کاٹی گئی ہو۔\nاور ہر جوہر میں ذاتی حیات غیر زائل ہونے والی ہے۔ اور اسی ذاتی حیات کے ذریعے، جس سے اللہ نے بعض مخلوق کی بصارت کو پردہ میں رکھا ہے، قیامت کے دن کھالیں، زبانیں، ہاتھ اور پاؤں لوگوں کے خلاف گواہی دیں گے، اور اسی کے ذریعے وہ بولیں گے۔ اور اسی کے ذریعے آخری زمانے میں ران بولے گی اور اپنے مالک کو بتائے گی کہ اس کے گھر والوں نے کیا کیا۔ اور اسی کے ذریعے آخری زمانے میں درخت بولے گا جب یہودی اس کے پیچھے چھپیں گے جب مسلمان انہیں قتل کے لیے تلاش کر رہے ہوں گے، تو وہ مسلمان سے کہے گا جب وہ یہودی کو تلاش کرتے ہوئے اسے دیکھے گا: اے مسلمان! یہ یہودی میرے پیچھے ہے، اسے قتل کر دو۔ سوائے شجر الغرقد کے، کیونکہ وہ یہودی کو پناہ دینے پر اسے چھپا لے گا۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اس پر لعنت فرمائی ہے۔\nاور یہ نہیں کہا جائے گا کہ درخت نے صرف اس شخص پر شفقت کی جس نے اس کا سہارا لیا، جیسا کہ اہل خلق کریم (اچھے اخلاق والے) دیکھتے ہیں۔ تو جان لو کہ اللہ کا حق فیصلہ کرنے میں زیادہ حقدار ہے۔ اور اللہ کے ساتھ خلق کریم (اچھے اخلاق) کا تصرف ہر مومن پر زیادہ واجب ہے۔ کیا تم نہیں دیکھتے کہ وہ فرماتا ہے:\n**وَلَا تَأْخُذْكُمْ بِهِمَا رَأْفَةٌ فِي دِينِ اللَّهِ** (اور تمہیں ان دونوں کے معاملے میں اللہ کے دین میں کوئی نرمی نہ آئے)\nاور یہ حیات چیزوں میں ذاتی اس لیے تھی کہ یہ تمام موجودات کے لیے ظہور الٰہی (التجلی الإلهي) سے ہے۔ کیونکہ اس نے انہیں اپنی عبادت اور معرفت (المعرفۃ) کے لیے پیدا کیا، اور اس کی مخلوق میں سے کوئی بھی اسے نہیں پہچانتا مگر یہ کہ وہ اس پر تجلی (التجلی) فرمائے، تو وہ اسے خود سے پہچانتا ہے، کیونکہ مخلوق کی طاقت میں نہیں تھا کہ وہ اپنے خالق کو پہچانے، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**وَعَلَّمْناهُ مِنْ لَدُنَّا عِلْماً** (اور ہم نے اسے اپنے پاس سے علم سکھایا)\nاور تجلی (التجلی) ہمیشہ دائمی ہے، جو تمام موجودات کے لیے مشاہدہ میں ہے، سوائے فرشتوں، انسانوں اور جنوں کے۔ کیونکہ ان کے لیے دائمی تجلی (التجلی) صرف ان چیزوں میں ہے جن میں ظاہر نطق نہیں ہے، جیسے دیگر جمادات اور نباتات۔\nلیکن ان لوگوں کے لیے جنہیں نطق اور اپنے اندر کی چیزوں کو بیان کرنے کی صلاحیت دی گئی ہے، اور وہ فرشتے، انسان اور جن ہیں، ان کی مدبر ارواح اور ان کی قوتوں کے لحاظ سے، تو ان کے لیے تجلی (التجلی) غیب کے پردے کے پیچھے سے ہوتی ہے۔\nپس فرشتوں کے لیے معرفت (المعرفۃ) الٰہی تعریف کے ذریعے ہے نہ کہ تجلی (التجلی) کے ذریعے۔ اور انسانوں اور جنوں کے لیے معرفت (المعرفۃ) غور و فکر اور استدلال کے ذریعے ہے۔ اور ان کے اجسام اور ان سے کم مخلوقات کے لیے معرفت (المعرفۃ) ظہور الٰہی (التجلی الإلهي) کے ذریعے ہے۔\nاور یہ اس لیے ہے کہ دیگر مخلوقات کتمان (چھپانے) پر فطرتاً پیدا کی گئیں، چنانچہ انہیں ابلاغ کی عبارت نہیں دی گئی۔ اور ذات حق (الحق) نے اس مقام کو پردہ میں رکھنا چاہا، مکلفین پر رحمت کے طور پر، کیونکہ اس کے علم میں یہ بات پہلے سے تھی کہ انہیں مکلف کیا جائے گا اور ان پر گناہ مقدر کیے گئے، اور ان میں سے بعض پر اعتراض مقدر کیا گیا جہاں انہیں نہیں کرنا چاہیے تھا، جیسے فرشتوں نے جب کہا:\n**أَتَجْعَلُ فِيهَا مَنْ يُفْسِدُ فِيهَا** (کیا تو اس میں ایسے کو بنائے گا جو اس میں فساد کرے گا)\nاور آدم کے قصے میں ان کے ساتھ جو کچھ ہوا، وہ ہوا۔ اسی لیے ان پر پردہ ڈالا گیا، کیونکہ اگر وہ قضا و قدر کے باوجود تجلی (التجلی) اور مشاہدہ کی حالت میں اس کی نافرمانی کرتے، تو یہ ایک عظیم بے احترامی اور بے حیائی ہوتی، اور مؤاخذہ بہت بڑا ہوتا، تو رحمت انہیں کبھی نہ پہنچتی۔ لیکن جب انہوں نے پردے کی حالت میں نافرمانی کی، تو ان کے لیے عذر میں حجت قائم ہو گئی۔\nاور اسی لیے غفلت اس رحمت میں سے ہے جو اللہ نے اپنے بندوں کے لیے بنائی ہے، اور نسیان (بھول) بھی، تاکہ اگر ان پر اعتراض کیا جائے تو وہ اس کے ذریعے حجت پائیں اور اس کے ذریعے عذر پائیں۔\nاور اسی لیے اللہ نے اپنی مخلوق میں سے کسی کو مکلف نہیں کیا سوائے فرشتوں، انسانوں اور جنوں کے۔ اور ان کے علاوہ، ان کے لیے دائمی تجلی (التجلی) نے انہیں دائمی ذاتی حیات (الحياة الذاتية) عطا کی ہے۔ اور وہ اپنی تسبیح میں ہماری طرح ہیں جیسے ہمارے سانس، جو مسلسل جاری رہتے ہیں اور ہمیں اپنے سانس لینے میں کوئی مشقت محسوس نہیں ہوتی، بلکہ سانس ہمارے لیے عین راحت ہیں، بلکہ اگر وہ نہ ہوں تو ہم مر جائیں۔ کیا تم نہیں دیکھتے کہ گلا گھونٹے جانے والا جب اس کے اور اس کی سانس کے نکلنے کے درمیان رکاوٹ ڈالی جاتی ہے تو وہ مر جاتا ہے اور تکلیف محسوس کرتا ہے؟ پس اگر تم سمجھو تو ہر چیز کی تسبیح اسی حد پر ہے۔\nپس حقیقت میں ذات حق (الحق) ہی عالم کا مدبر ہے، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ** (وہ امر کی تدبیر کرتا ہے، وہ آیات کو کھول کر بیان کرتا ہے)\nیعنی اپنی توحید پر دلالتوں کو، پس وہ ہر مخلوق کو اس کے موجد کی توحید پر ایک خاص دلالت عطا کرتا ہے، جیسا کہ کہنے والے نے کہا:\n\n> وفي كل شي‏ء له آية *** تدل على أنه واحد\n> *ترجمہ:* اور ہر چیز میں اس کی ایک نشانی ہے، جو دلالت کرتی ہے کہ وہ ایک ہے۔\n\nاور یہ وہی آیات ہیں جنہیں وہ کھول کر بیان کرتا ہے اور اپنی مخلوق پر تقسیم کرتا ہے، اس فطرت کے مطابق جس پر اللہ نے انہیں پیدا کیا ہے۔\nپس وہ سبحانہ و تعالیٰ عالم کی روح، اس کی سماعت، اس کی بصارت اور اس کا ہاتھ ہے۔ پس اسی کے ذریعے عالم سنتا ہے، اسی کے ذریعے دیکھتا ہے، اسی کے ذریعے بولتا ہے، اسی کے ذریعے پکڑتا ہے اور اسی کے ذریعے کوشش کرتا ہے، کیونکہ اللہ العلی العظیم کے سوا کوئی طاقت اور قوت نہیں ہے۔\nاور یہ بات صرف وہی جانتا ہے جو نوافل خیرات کے ذریعے اللہ کا قرب حاصل کرتا ہے، جیسا کہ:\n**ورد في الصحيح من الأخبار النبوية الإلهية فإذا تقرب العبد تعالى إليه بالنوافل أحبه وإذا أحبه قال الله تعالى فإذا أحببته كنت سمعه وبصره ويده وفي رواية كنت له سمعا وبصرا ويدا ومؤيدا** (صحیح نبوی الٰہی احادیث میں وارد ہوا ہے کہ جب بندہ نوافل کے ذریعے اللہ کا قرب حاصل کرتا ہے تو وہ اس سے محبت کرتا ہے، اور جب وہ اس سے محبت کرتا ہے تو اللہ تعالیٰ فرماتا ہے: جب میں اس سے محبت کرتا ہوں تو میں اس کی سماعت، اس کی بصارت اور اس کا ہاتھ بن جاتا ہوں۔ اور ایک روایت میں ہے: میں اس کے لیے سماعت، بصارت اور ہاتھ اور مددگار بن جاتا ہوں)\nتو اس کا قول \"میں تھا\" (كنت) اس بات پر دلالت کرتا ہے کہ معاملہ اسی طرح تھا اور وہ بندہ اس سے بے خبر تھا۔ پس اس قرب نے جو کرامت اسے عطا کی، وہ کشف (الکشف) اور علم تھا کہ اللہ ہی اس کی سماعت اور بصارت تھا۔ پس وہ گمان کرتا ہے کہ وہ اپنی سماعت سے سنتا ہے، حالانکہ وہ اپنے رب کے ذریعے سنتا ہے، جیسا کہ انسان اپنی حیات کی حالت میں اپنی روح کے ذریعے سنتا تھا، اپنے جہل کی وجہ سے اس کے گمان میں، حالانکہ حقیقت میں وہ اپنے رب کے ذریعے سنتا ہے۔\nکیا تم اس کے سچے نبی کو اہل قلیب (کنویں والے) کے بارے میں نہیں دیکھتے کہ جب انہوں نے ان سے خطاب کیا تو فرمایا: **مَا أَنْتُمْ بِأَسْمَعَ مِنْهُمْ** (تم ان سے زیادہ سننے والے نہیں ہو) جب کہ وہ سڑ چکے تھے؟\nپس مخلوقات میں سے کوئی ایسا نہیں جو سنتا نہ ہو، لیکن وہ اس پر فطرتاً پیدا کیے گئے ہیں کہ وہ اس چیز کو پہنچانے سے منع کیے گئے ہیں جو وہ جانتے اور سنتے ہیں۔\nاور یہ وہ حیات ہے جو خرق عادات کے وقت مخلوق کی آنکھوں کے سامنے ظاہر ہوتی ہے، جیسے موسیٰ کی گائے اور دیگر مردوں کو زندہ کرنا۔\nپس اسم الظاہر (الاسم الظاہر) ہی عالم ہے، اگر تم اس کی حقیقت کو جان لو، کیونکہ وہ ذات حق (الحق) کے لیے اس جسم کی مانند ہے جو مدبر روح کے لیے ہوتا ہے۔ اور اسم الباطن (الاسم الباطن) اس چیز کے لیے ہے جو موجودات سے ان کی اپنی ذاتوں کے لیے حیات کی نسبت میں پوشیدہ ہے۔\nاور مجموعی طور پر انسان بنتا ہے، کیونکہ اس کی تعریف حیوان ناطق (بولنے والا حیوان) ہے۔ حیوان ہونا اس کی ظاہری صورت ہے، کیونکہ حیوان ہونا تغذیہ پانے والے، حساس جسم کی دلالت کے مطابق ہے، مگر یہ زیادہ مختصر ہے۔ پس انہوں نے اسے عبارت کی دنیا میں اختصار کے لیے ترجیح دی، کیونکہ یہ دلالت میں اس کے برابر ہے۔ اور وہ اپنے معنی کے لحاظ سے ناطق (بولنے والا) ہے، اور اس کا معنی اس کے سوا کچھ نہیں جو ہم نے ذکر کیا۔\nپس ہمارے نزدیک پورا عالم، جو اللہ کے سوا ہر چیز سے عبارت ہے، حیوان ناطق (حیوان ناطق) ہے۔ لیکن اس کے اجسام، اس کی غذائیں اور اس کا حس مختلف ہے۔ پس وہ حیوانی صورت کے ذریعے ظاہر ہے، اور ظہور الٰہی (التجلی الإلهي) سے پیدا ہونے والی دائمی ذاتی حیات (الحياة الذاتية) کے ذریعے باطن ہے۔\nپس ہستی (الوجود) میں اللہ تعالیٰ، اس کے اسماء اور اس کے افعال کے سوا کچھ نہیں ہے۔ پس وہ اسم الظاہر (الاسم الظاہر) کے لحاظ سے الاول (اول) ہے، اور اسم الباطن (الاسم الباطن) کے لحاظ سے الآخر (آخر) ہے۔ پس پوری ہستی (الوجود) ذات حق (الحق) ہے، اس میں باطل (الباطل) میں سے کچھ نہیں ہے، کیونکہ لفظ باطل (الباطل) کے اطلاق سے مراد وہ عدم ہے جس کے بارے میں اس کے قائل نے دعویٰ کیا کہ وہ وجود ہے۔ پس سمجھو!\nاور اگر معاملہ ایسا نہ ہوتا تو مخلوق فعل میں منفرد ہو جاتی، اور الٰہی اقتدار تمام ممکنات کو شامل نہ ہوتا، بلکہ امکانات اس سے زائل ہو جاتے۔\nپس پاک ہے وہ الظاہر (ظاہر) جو چھپتا نہیں، اور پاک ہے وہ الخفی (پوشیدہ) جو ظاہر نہیں ہوتا۔ اس نے مخلوق کو اپنی معرفت (المعرفۃ) سے پردہ میں رکھا، اور اپنے شدید ظہور سے انہیں اندھا کر دیا، پس وہ منکر بھی ہیں، اقرار کرنے والے بھی، متردد بھی، حیران بھی، درست بھی اور غلطی پر بھی۔\nاور تمام تعریفیں اللہ کے لیے ہیں جس نے ہم پر ایسے مشاہدات کا احسان کیا اور ہماری بصارتوں کے لیے ان حقائق کو روشن کیا، پس ہماری کوئی نظر اس کے سوا کسی پر نہیں پڑی، اور نہ ہی ہمارا کوئی سہارا اس کے سوا کسی پر رہا۔\n**لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ** (اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے)\nاور جو شخص اس مسئلے میں میری طرف سے اشارہ کی گئی حقیقت کو جاننا چاہتا ہے، تو وہ پردے کے کھیل (خيال الستارة) اور اس صورت کو دیکھے، اور ان چھوٹے بچوں کے نزدیک ان صورتوں میں بولنے والا کون ہے جو ان کے اور ان اشخاص سے کھیلنے والے اور ان میں بولنے والے کے درمیان پڑے ہوئے پردے کے حجاب سے دور ہیں۔\nپس عالم کی صورتوں میں بھی معاملہ ایسا ہی ہے۔ اور اکثر لوگ وہی چھوٹے بچے ہیں جن کا ہم نے فرض کیا ہے۔ پس تم جان لو کہ ان پر یہ غلطی کہاں سے آئی۔ اس مجلس میں بچے خوش ہوتے ہیں اور جھومتے ہیں، اور غافل لوگ اسے لہو و لعب سمجھتے ہیں، اور علماء عبرت حاصل کرتے ہیں اور جانتے ہیں کہ اللہ نے اسے صرف ایک مثال کے طور پر قائم کیا ہے تاکہ اس کے بندے عبرت حاصل کریں اور جان لیں کہ اللہ کے ساتھ عالم کا معاملہ ان صورتوں کا ان کو حرکت دینے والے کے ساتھ معاملہ جیسا ہے۔ اور یہ پردہ مخلوقات میں محکم تقدیر کے راز کا حجاب ہے۔\nاور اس سب کے باوجود، غافل لوگ اسے لہو و لعب سمجھتے ہیں، اور یہی اللہ تعالیٰ کا قول ہے:\n**الَّذِينَ اتَّخَذُوا دِينَهُمْ لَهْوًا وَلَعِبًا** (جنہوں نے اپنے دین کو لہو و لعب بنا لیا)\nپھر وصاف (بیان کرنے والا) غائب ہو جاتا ہے، اور وہ ہم میں سب سے پہلے موجود آدم علیہ السلام کے مقام پر ہے۔ اور جب وہ غائب ہوا، تو اس کا ہم سے غائب ہونا اس کے رب کے پاس غیبت کے پردے کے پیچھے تھا۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)",
    "fa": "«باب سیصد و هفدهم» در معرفت منزل ابتلا و برکات آن\n\nو آن منزل امامی است که در سمت چپ قطب قرار دارد.\n\n> شگفت از خانه‌ای که آن را بنا نهاد و سامان داد، *** و روحی کریم در آن ساکن کرد و سپس آن را فرسوده ساخت.\n> و آن را ویران کرد، ویران کردن کسی که قصد برپایی‌اش را ندارد؛ *** پس کیست که پراکندگی‌اش را جمع کند؟ کیست که بقای آن را تضمین کند؟\n> و او بر آنچه برپا داشته بود، آگاه بود؛ *** ای کاش می‌دانستم چه چیزی او را به این کار واداشت؟\n> و چرا از ابتدا آن را بنا نکرد و برپا نساخت، *** برپاییِ باقی‌ای که سیمایش زوال نپذیرد؟\n> و کاری نکرد که سزاوار هلاکت باشد؛ *** چقدر شریف و چقدر نیرومند بود!\n> دست فرسودگی در ما و در آن بازی کرد؛ *** و پس از زمانی، آن را بازگرداند و سپس بلندمرتبه ساخت.\n> و آن روح را به آن بازگرداند، پس بر تختش چون پادشاهی مستقر شد *** و سکونتش را جاودانه ساخت.\n> و از روی عنایت، عدن و خلد را به آن ارث داد، *** پس آن را در فردوس و سپس در جایگاهش ساکن ساخت.\n\n### [اینکه حیات برای همه‌ی ارواح مدبّر اجسام است]\n\nبدان، خداوند تو را تأیید کند، ای ولیّ صمیمی و برگزیده‌ی گرامی، که حیات برای ارواح مدبّر همه‌ی اجسام، اعم از ناری (آتشین)، ترابی (خاکی) و نوری، مانند نور برای خورشید است. پس حیات برای آن ارواح وصفی نفسانی است؛ هرگاه بر چیزی ظاهر شوند، آن چیز زنده می‌شود و حیات آن روح ظاهر شده در آن جاری می‌گردد، همان‌گونه که نور خورشید در جسم هوا و روی زمین و هر مکانی که خورشید بر آن می‌تابد، جاری می‌شود. و از اینجاست که دانسته می‌شود روح عالم کیست و حیات خود را از چه کسی می‌گیرد، و معنای این سخن خداوند متعال چیست: «اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ» (خداوند نور آسمان‌ها و زمین است). سپس مثلی آورد و فرمود: «مَثَلُ نُورِهِ كَمِشْكاةٍ» (مَثَل نور او چون چراغ‌دانی است) که همان طاقچه است، «فِيها مِصْباحٌ» (در آن چراغی است) که همان نور است، تا آخر تشبیه. پس هر کس معنای این آیه را بفهمد، حفظ خداوند از عالم را درک کرده است. این آیه از اسرار معرفت (المعرفة) به خداوند متعال در ارتباط اله با مألوه و رب با مربوب است. زیرا اگر خداوند همواره حفظ مربوب و مألوه را بر عهده نگیرد، در همان لحظه فانی می‌شود، چرا که حافظی ندارد که او را حفظ کند و بقای او را نگه دارد. اگر خداوند در غیب از عالم محجوب شود، عالم نابود می‌گردد. از این رو، اسم الظاهر (ظاهر) همواره حاکم بر وجود است و اسم الباطن (باطن) حاکم بر علم و معرفت (المعرفة). پس به واسطه‌ی اسم الظاهر، عالم باقی ماند؛ و به واسطه‌ی اسم الباطن، او را شناختیم؛ و به واسطه‌ی اسم النور، او را شهود (الشهود) کردیم.\n\nو چون حیات انسان که مقصود ما در این باب است (زیرا این باب، باب ابتلاست و شامل مکلفین از جن و انس می‌شود، چرا که هر آنچه غیر از جن و انس است، در حکم عبادت و تکلیف مانند ما نیست)، پس سخن من درباره‌ی انسان به تنهایی از حیث حیاتش، سخن من درباره‌ی هر آنچه غیر خداست می‌باشد؛ و سخن من درباره‌ی ابتلای او، سخن من درباره‌ی هر مکلفی از جن و انس است. خداوند متعال فرمود: «وَكانَ عَرْشُهُ عَلَى الْماءِ» (و عرش او بر آب بود). «علی» در اینجا به معنای «فی» (در) است؛ یعنی عرش در آب بود، همان‌گونه که انسان در آب است، یعنی از آن تشکیل می‌شود. زیرا آب اصل همه‌ی موجودات است و عرش حیات الهی است. و خداوند هر چیز زنده‌ای را از آب آفرید. و هر آنچه غیر خداست، زنده است؛ زیرا هر آنچه غیر خداست، به حمد او تسبیح می‌گوید، و تسبیح جز از موجود زنده صادر نمی‌شود. و اخبار در مورد حیات هر تر و خشک، و جماد و نبات، و زمین و آسمان وارد شده است.\n\nو این همان مسئله‌ای است که در آن میان اهل کشف (الکشف) و غیر ایشان که کشف (الکشف) ندارند، و میان اهل ایمان و کسانی که به شرایع قائل نیستند یا شرایع را به گونه‌ای غیر از آنچه آمده است تأویل می‌کنند، اختلاف افتاده است. آنان می‌گویند این تسبیح حال است. اما آنچه حس، حیاتش را درک می‌کند، اختلافی در حیاتش نیست؛ بلکه اختلاف در این است که سبب حیاتش چیست، و تسبیحش به حمد پروردگارش به چه چیزی بازمی‌گردد؛ زیرا تسبیح جز از موجود زنده‌ی عاقلی که آن را تعقل کند، صادر نمی‌شود. و غیر از انسان و جن، حیوانات نزد مخالفان عاقل نیستند، برخلاف آنچه ما و اهل کشف (الکشف) و ایمان صحیح اعتقاد داریم. و منظورم از عقل در اینجا علم است.\n\nپس عرش در اینجا عبارت از مُلک (پادشاهی) است. و «کان» (بود) حرفی وجودی است، پس معنایش این است که مُلک در آب موجود بود؛ یعنی آب اصل ظهور عین مُلک است. پس آب برای مُلک مانند هیولاست که صور عالم (که مُلک خداوند است) در آن ظاهر شده است. و عالم در اعیان و نِسب محصور است؛ اعیان وجودی هستند و نِسب معقول و عدمی. و این همان هر چیزی است که غیر خداست. و چون آب اصل حیات است و هر چیزی زنده است و نِسب تابع آن هستند، خداوند میان عرشی که بر آب قرار داده شده و خلق مرگ و حیات در ابتلا، پیوند برقرار کرد و فرمود: «وَكانَ عَرْشُهُ عَلَى الْماءِ لِيَبْلُوَكُمْ» (و عرش او بر آب بود تا شما را بیازماید)، یعنی شما را امتحان کند. و عرش، همان‌گونه که برایت ذکر کردم، اعیان موجود و نِسب عدمی است. و فرمود: «خَلَقَ الْمَوْتَ وَالْحَياةَ لِيَبْلُوَكُمْ» (مرگ و زندگی را آفرید تا شما را بیازماید). پس حیات برای اعیان است و مرگ برای نِسب. ظهور روح برای جسم، حیات آن جسم است، مانند ظهور خورشید برای روشن کردن اجسامی که خورشید بر آن‌ها ظاهر شده است. و غیبت روح از جسم، زوال حیات از آن جسم است که همان مرگ است. پس اجتماع، حیات است و جدایی، مرگ. و اجتماع و افتراق نِسب معقولی هستند که حکم ظاهری دارند، هرچند اعیانشان معدوم باشند.\n\n### [اینکه همه‌ی قوای موجود در انسان و هر حیوانی، تنها از آنِ روح است]\n\nو بدان که همه‌ی قوایی که در انسان و در هر حیوانی وجود دارد، مانند قوه‌ی حس، قوه‌ی خیال، قوه‌ی حافظه، قوه‌ی مصوّره و سایر قوا که به همه‌ی اجسام بالا و پایین نسبت داده می‌شوند، همگی از آنِ روح هستند. این قوا به واسطه‌ی وجود روح و اعطای حیات او به آن جسم پدید می‌آیند، و هر آنچه از آن‌ها که با روی گرداندن روح از آن جسم، از آن وجه خاصی که آن قوه از آن ناشی می‌شود، معدوم می‌گردد. پس بفهم. پس هرگاه روح به کلی از جسم روی برگرداند، با زوال آن، همه‌ی قوا و حیات نیز زائل می‌شود، که این همان مرگ است، مانند شب با غروب خورشید.\n\nاما در خواب، روی گردانی کلی نیست، بلکه حجاب‌هایی از بخارات هستند که میان قوا و مدرکات حسی آن‌ها حائل می‌شوند، در حالی که حیات در شخص خوابیده وجود دارد. مانند خورشید که اگر ابرها میان آن و مکان خاصی از زمین حائل شوند، نور (مانند حیات) موجود است، هرچند ادراک خورشید برای آن مکانی که ابرهای متراکم میان آن و خورشید حائل شده‌اند، حاصل نشود. و همان‌گونه که خورشید وقتی از این مکان زمین جدا می‌شود و شب به جای آن می‌آید، در مکان دیگری ظاهر می‌شود و آن مکان را با نور خود روشن می‌کند، پس آنجا روز می‌شود همان‌گونه که اینجا بود؛ همچنین روح، هنگامی که از این جسم که حیاتش به واسطه‌ی آن بود روی برمی‌گرداند، بر صورتی از صور (که همان برزخ است و «صور» جمع «صورة» است) تجلی (التجلی) می‌کند، و آن صورت در برزخ به واسطه‌ی آن زنده می‌شود، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره‌ی نَسمه‌ی مؤمن فرمود: «إنه طير أخضر» (آن پرنده‌ای سبز است). پس آن پرنده مانند جسم در اینجا، صورتی است که به واسطه‌ی این روحی که این جسم به آن زنده بود، حیات یافته است. و همان‌گونه که خورشید در روز دوم بر ما طلوع می‌کند و موجودات به نور آن روشن می‌شوند، همچنین روح در روز آخرت بر این اجسام مرده طلوع می‌کند و آن‌ها به واسطه‌ی آن زنده می‌شوند؛ و این همان نشر و بعث است.\n\n### [اینکه خداوند صور (شیپور) را آفرید]\n\nو بدان که صور (شیپور) را خداوند به شکل شاخ (قرن) آفرید و به دلیل مجاورت یا ارتباط سببی، به نام شیء دیگر (صور جمع صورة) نامیده شده است. و چون این شاخ (قرن) محل همه‌ی صور برزخی است که ارواح پس از مرگ و در خواب به آن منتقل می‌شوند، «صور» (جمع صورت) نامیده شده است. و شکل این شاخ، بالای آن گشاد و پایین آن تنگ است، شبیه شکل عالم؛ کجا وسعت عرش با تنگی زمین قابل مقایسه است؟ و قوا همراه روح به آن صورت برزخی منتقل می‌شوند، چه در خواب و چه در مرگ. به همین دلیل، آن صورت با همه‌ی قوا به طور یکسان درک کننده است.\n\nمن تو را از حقیقت امر آگاه ساختم. و از اینجاست که قائلین به تناسخ به خطا رفتند؛ زیرا دیدند یا شنیدند که انبیا بر انتقال ارواح به این صور برزخی و قرار گرفتن آن‌ها در آنجا به شکل اخلاقشان هشدار داده‌اند. و چون آن اخلاق را در حیوانات دیدند، در سخن انبیا و رسولان و علما چنین پنداشتند که آن انتقال به همین حیوانات در دنیای فانی بازمی‌گردد و برای رهایی (تخلیص) است. و آنچه از مذهبشان می‌دانی را ذکر کردند، پس در نظر و در تأویل اقوال رسولان و آنچه در کتب نازل شده آمده است، خطا کردند. و دیدند که شخص خوابیده به این امری که آن‌ها در آن وارد شدند نزدیک است، پس از آن برای مذهب خود آرامش یافتند. در حالی که خطای آن‌ها تنها از سوء تأویل در قول صحیح ناشی شد.\n\nو این معنای سخن اوست: «لِيَبْلُوَكُمْ» (تا شما را بیازماید)، یعنی عقل‌های شما را با مرگ و زندگی بیازماید: «أَيُّكُمْ أَحْسَنُ عَمَلًا» (کدام یک از شما نیکوکارتر است) با غور کردن در آن دو و نظر کردن، تا ببیند چه کسی از شما به صواب می‌رسد و چه کسی خطا می‌کند، مانند اهل تناسخ. و همه‌ی این‌ها را دلیلی آشکار قرار داد و آن را برهانی قاطع بر اسم حی (زنده)، اسم نور، اسم الظاهر (ظاهر)، الباطن (باطن)، الأول (اول) و الآخر (آخر) خود برپا داشت. تا نسبت عالم به آفریننده‌اش دانسته شود و اینکه عالم به خودی خود مستقل نیست و فقر (احتیاج) آن به خداوند، فقری ذاتی است که لحظه‌ای از آن جدا نمی‌شود. و اینکه نِسب به دلیل بقای وجود اعیان، دائمی الحکم هستند. و او عزیز و دارای حریم ممنوع است از اینکه خلقش او را درک کنند یا به چیزی از علم او احاطه یابند، مگر به آنچه خود بخواهد. و او غفوری است که عقل‌ها را از درک کُنه ذاتش یا کُنه جلالش پوشانده است.\n\n### [اینکه حیات همه‌ی اجسام از حیات ارواح مدبّر آن‌هاست]\n\nو بدان ای ولیّ، خداوند بصیرت تو را نورانی گرداند، پس از آنکه نزد تو مقرر شد که حیات همه‌ی اجسام از حیات ارواح مدبّر آن‌هاست و با جدایی روح از جسم، مرگ رخ می‌دهد و نظام آن دو زائل می‌شود، زیرا قوای نگهدارنده‌ی جسم با زوال روح مدبّری که خداوند او را به تدبیر آن گماشته بود، از بین رفته است.\n\n### [اینکه حیات دو نوع است]\n\nپس بدان که حیات در همه‌ی اشیا دو نوع است: حیاتی که از سبب ناشی می‌شود و آن حیاتی است که ذکر کردیم و به ارواح نسبت دادیم؛ و حیات دیگری که ذاتی همه‌ی اجسام است، مانند حیات ارواح برای ارواح. با این تفاوت که حیات ارواح، اثرش در اجسام مدبّر به واسطه‌ی انتشار نورش در آن‌ها و ظهور قوای ذکر شده، آشکار می‌شود. اما حیات ذاتی اجسام چنین نیست؛ زیرا اجسام مدبّر آفریده نشده‌اند. پس به واسطه‌ی حیات ذاتی‌شان که زوال آن جایز نیست (زیرا صفتی نفسانی برای آن‌هاست)، همواره پروردگارشان را تسبیح می‌گویند، چه ارواحشان در آن‌ها باشد و چه نباشد. و ارواحشان به آن‌ها جز هیئتی عرضی دیگر در تسبیح نمی‌دهند که خاص وجود آن‌هاست. و هنگامی که روح از آن‌ها جدا شود، آن ذکر خاص نیز از آن‌ها جدا می‌شود، که همان کلام محسوس متعارف میان ماست، چه تسبیح باشد یا غیر آن. پس مکاشف (اهل کشف) حیات ذاتی را که در همه‌ی اجسام است، درک می‌کند.\n\nو اگر بر هر جسمی امری عارض شود که آن را از نظامش خارج کند، مانند شکستن ظرف یا شکستن سنگ یا بریدن درخت، این مانند قطع دست یا پای انسان است؛ حیات روح مدبّر از آن زائل می‌شود، اما حیات ذاتی‌اش برای آن باقی می‌ماند. زیرا برای هر صورتی در عالم، روح مدبّر و حیات ذاتی وجود دارد. روح با زوال آن صورت از بین می‌رود، مانند شخص کشته شده؛ و صورت با زوال آن روح از بین می‌رود، مانند مرده‌ای که در بستر خود مرده و گردنش زده نشده است. و حیات ذاتی برای هر جوهری در آن، زائل نشدنی است. و به واسطه‌ی همان حیات ذاتی که خداوند دیده‌ی برخی از خلق را از آن پوشانده است، پوست‌ها در روز قیامت بر مردم شهادت می‌دهند، و زبان‌ها و دست‌ها و پاها نیز. و به واسطه‌ی آن، ران مرد در آخرالزمان سخن می‌گوید و صاحبش را از آنچه خانواده‌اش انجام داده‌اند، خبر می‌دهد. و به واسطه‌ی آن، درخت در آخرالزمان سخن می‌گوید، هنگامی که یهودیان پشت آن پنهان می‌شوند و مسلمانان آن‌ها را برای کشتن دنبال می‌کنند. درخت به مسلمان می‌گوید، هنگامی که او را در جستجوی یهودی می‌بیند: ای مسلمان، این یهودی پشت من است، او را بکش. مگر درخت غرقد، که یهودی را هنگامی که به آن پناه می‌برد، می‌پوشاند. پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را لعنت کرد. و نباید گفته شود که درخت تنها با کسی که به آن تکیه کرده، رأفت ورزیده است، چنانکه صاحبان خُلق کریم می‌پندارند. پس بدان که حق خداوند سزاوارتر به قضاوت است و به کار بردن خُلق کریم در کنار خداوند بر هر مؤمنی واجب‌تر است. آیا نمی‌بینی که می‌فرماید: «وَلا تَأْخُذْكُمْ بِهِما رَأْفَةٌ فِي دِينِ اللَّهِ» (و در دین خدا نسبت به آن دو [مجرم] رأفت و دلسوزی شما را نگیرد).\n\nو این حیات در اشیا ذاتی است، زیرا ناشی از تجلی الهی (التجلی الإلهی) بر همه‌ی موجودات است، چرا که خداوند آن‌ها را برای عبادت و معرفت (المعرفة) خود آفریده است. و هیچ یک از خلق او را نمی‌شناسد، مگر اینکه بر او تجلی (التجلی) کند تا او را به واسطه‌ی خودش بشناسد؛ زیرا در توان مخلوق نیست که خالق خود را بشناسد، چنانکه خداوند متعال فرمود: «وَعَلَّمْناهُ مِنْ لَدُنَّا عِلْماً» (و از نزد خود به او علمی آموختیم). و تجلی (التجلی) همواره دائمی و مشهود برای همه‌ی موجودات ظاهر است، به جز ملائکه و انس و جن. زیرا تجلی دائمی برای آن‌ها تنها در چیزهایی است که نطق ظاهری ندارند، مانند سایر جمادات و نباتات. اما تجلی (التجلی) برای کسانی که نطق و بیان آنچه در درون دارند به آن‌ها داده شده است (که همان ملائکه و انس و جن هستند)، از حیث ارواح مدبّر و قوایشان، از پشت حجاب غیب است. پس معرفت (المعرفة) برای ملائکه از طریق تعریف الهی است نه از طریق تجلی (التجلی)، و معرفت (المعرفة) برای انس و جن از طریق نظر و استدلال است. و معرفت (المعرفة) برای اجسام آن‌ها و مخلوقات پایین‌تر از آن‌ها، از طریق تجلی الهی (التجلی الإلهی) است.\n\nو این بدان سبب است که سایر مخلوقات بر کتمان سرشته شده‌اند و به آن‌ها قدرت بیان و رساندن (معنا) داده نشده است. و حق (الحق) اراده کرد که این مقام را بپوشاند، از روی رحمت بر مکلفین؛ زیرا در علم او سبقت گرفته بود که آن‌ها مکلف می‌شوند و معاصی بر آن‌ها مقدر شده است، و بر برخی از آن‌ها اعتراض در امری که شایسته‌ی آن‌ها نبود، مقدر شده بود، مانند ملائکه هنگامی که گفتند: «أَ تَجْعَلُ فِيها مَنْ يُفْسِدُ فِيها» (آیا در آن کسی را قرار می‌دهی که فساد می‌کند). و آنچه در داستان آدم با آن‌ها رخ داد، اتفاق افتاد. به همین دلیل، ستر (پوشش) بر آن‌ها واقع شد؛ زیرا اگر آن‌ها با وجود تجلی (التجلی) و مشاهده، از روی قضا و قدر نافرمانی می‌کردند، این بی‌احترامی و بی‌حیایی بزرگی بود و مؤاخذه عظیم می‌شد، در نتیجه رحمت هرگز به آن‌ها نمی‌رسید. اما چون در حالت ستر (پوشش) نافرمانی کردند، حجت برای عذرخواهی برایشان برقرار شد. و به همین دلیل، غفلت و فراموشی از رحمتی بود که خداوند برای بندگانش قرار داد تا اگر مورد اعتراض قرار گیرند، با آن حجتی بیابند و عذری داشته باشند. و به همین دلیل، خداوند هیچ کس از خلقش را جز ملائکه و انس و جن مکلف نساخت. و آنچه غیر از آن‌هاست، دوام تجلی (التجلی) به آن‌ها حیات ذاتی دائمی بخشیده است. و آن‌ها در تسبیح خود مانند ما در نفس‌هایمان هستند؛ دوامی پیوسته بدون مشقتی که در تنفس خود می‌یابیم. بلکه نفس‌ها عین راحتی برای ما هستند، بلکه اگر نبودند، می‌مردیم. آیا نمی‌بینی که شخص خفه‌شده، اگر میان او و خروج نفسش حائل شوند، می‌میرد و درد می‌یابد؟ پس اگر بفهمی، تسبیح هر چیزی بر همین منوال است.\n\nپس حق (الحق) در حقیقت مدبّر عالم است، چنانکه خداوند متعال فرمود: «يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ» (امر را تدبیر می‌کند و آیات را تفصیل می‌دهد). یعنی دلالت‌ها بر توحید خود را تفصیل می‌دهد، پس به هر خلقی دلالتی خاص بر توحید آفریننده‌اش می‌دهد، چنانکه گوینده گفته است:\n\n> و در هر چیزی برای او نشانه‌ای است *** که دلالت می‌کند بر اینکه او یگانه است.\n\nو این‌ها همان آیاتی هستند که او تفصیل می‌دهد و بر خلقش تقسیم می‌کند، بر حسب آنچه خداوند متعال آن‌ها را بر آن سرشته است. پس او سبحانه روح عالم و گوش و چشم و دست آن است. به واسطه‌ی او عالم می‌شنود و به واسطه‌ی او می‌بیند و به واسطه‌ی او سخن می‌گوید و به واسطه‌ی او می‌گیرد و به واسطه‌ی او تلاش می‌کند، زیرا «لا حَوْلَ وَلا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ» (هیچ نیرو و قدرتی جز به واسطه‌ی خداوند بلندمرتبه و بزرگ نیست). و این را نمی‌شناسد مگر کسی که با نوافل خیرات به خداوند تقرب جوید، چنانکه در اخبار نبوی الهی صحیح وارد شده است: «هرگاه بنده با نوافل به سوی خداوند متعال تقرب جوید، او را دوست می‌دارد. و چون او را دوست بدارد، خداوند متعال می‌فرماید: پس چون او را دوست داشتم، گوش و چشم و دست او می‌شوم.» و در روایتی دیگر: «برای او گوش و چشم و دست و مؤید می‌شوم.» پس سخن او «کنت» (شدم) دلالت بر این دارد که امر بر این منوال بود و او نمی‌دانست. پس کرامتی که این تقرب به او بخشید، کشف (الکشف) و علم به این بود که خداوند گوش و چشم او بوده است. پس او گمان می‌کند که با گوش خود می‌شنود، در حالی که با پروردگارش می‌شنود، همان‌گونه که انسان در حال حیاتش به گمان خود به واسطه‌ی روحش می‌شنید (به دلیل جهلش)، در حالی که در واقع امر، تنها به واسطه‌ی پروردگارش می‌شنود. آیا نمی‌بینی پیامبر صادق او را که درباره‌ی اهل قلیب (چاه) چگونه فرمود: «شما شنواتر از آن‌ها نیستید»، هنگامی که آن‌ها را خطاب کرد: «فَهَلْ وَجَدْتُمْ ما وَعَدَ رَبُّكُمْ حَقًّا» (آیا آنچه پروردگارتان وعده داده بود، حق یافتید؟)، در حالی که آن‌ها متعفن شده بودند. پس هیچ یک از مخلوقات نیست مگر اینکه می‌شنود، اما بر منع رساندن آنچه می‌دانند و می‌شنوند، سرشته شده‌اند. و این همان حیاتی است که نزد خلق در هنگام خرق عادات در زنده‌کردن مردگان، مانند گاو موسی و غیر آن، ظاهر می‌شود.\n\nپس اگر به حقیقت آن پی ببری، اسم الظاهر (ظاهر) همان عالم است؛ زیرا عالم برای حق (الحق) به منزله‌ی جسم برای روح مدبّر است. و اسم الباطن (باطن) برای چیزی است که از موجودات در نسبت دادن حیات به خودشان پنهان مانده است. و با مجموع این دو، انسان شکل می‌گیرد، زیرا تعریف او «حیوان ناطق» است. پس حیوانیت صورت ظاهری اوست؛ زیرا حیوانیت در دلالت با جسم تغذیه‌کننده و حساس مطابقت دارد، جز اینکه کوتاه‌تر است. از این رو، آن را در عالم عبارت برای اختصار ترجیح دادند، زیرا در دلالت با آن برابر است. و او ناطق است از حیث معنایش، و معنای آن چیزی جز آنچه ذکر کردیم، نیست. پس تمام عالم نزد ما (که عبارت است از هر آنچه غیر خداست) حیوان ناطق است، اما اجسام، غذاها و حس آن متفاوت است. پس او (عالم) به صورت حیوانی ظاهر است و به حیات ذاتی که ناشی از تجلی الهی (التجلی الإلهی) دائم الوجود است، باطن است. پس در هستی (الوجود) جز خداوند متعال و اسماء و افعال او نیست. او اول است از حیث اسم الظاهر (ظاهر) و آخر است از حیث اسم الباطن (باطن). پس همه‌ی هستی (الوجود) حق (الحق) است و هیچ باطلی در آن نیست؛ زیرا مفهوم از اطلاق لفظ باطل، عدمی است که صاحبش ادعا کرده که وجود است. پس بفهم. و اگر امر چنین نبود، خلق در فعل منفرد می‌شدند و اقتدار الهی همه‌ی ممکنات را در بر نمی‌گرفت، بلکه امکانات از او زائل می‌شدند.\n\nپس منزه است الظاهر (ظاهر) که پنهان نمی‌شود، و منزه است الخفی (پنهان) که ظاهر نمی‌گردد. خلق به واسطه‌ی او از معرفت (المعرفة) او محجوب شدند و شدت ظهورش آن‌ها را کور کرد. پس آن‌ها منکرند، اقرارکننده‌اند، مرددند، حیرانند، به صواب رسیده‌اند و خطا کرده‌اند. و سپاس خدایی را که با چنین مشاهداتی بر ما منت نهاد و این حقایق را برای دیدگان ما آشکار ساخت، پس چشم ما جز بر او نیفتاد و تکیه‌ی ما جز بر او نبود. «لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ» (هیچ معبودی جز او نیست که عزیز و حکیم است).\n\nو هر کس بخواهد حقیقت آنچه را که در این مسئله به آن اشاره کردم، بشناسد، باید به نمایش سایه (خيال الستارة) و صورت آن بنگرد و ببیند چه کسی در آن صورت‌ها سخن می‌گوید، نزد کودکان خردسالی که از حجاب پرده‌ای که میان آن‌ها و بازیگر آن اشخاص و سخنگوی در آن‌ها کشیده شده، دور هستند. پس امر در صور عالم نیز چنین است، و بیشتر مردم همان کودکان خردسالی هستند که فرض کردیم. پس می‌دانی که خطا از کجا بر آن‌ها وارد شده است. کودکان در آن مجلس شاد می‌شوند و به وجد می‌آیند، و غافلان آن را لهو و لعب می‌پندارند، و علما عبرت می‌گیرند و می‌دانند که خداوند این را جز به عنوان مَثَل قرار نداده است. و به همین دلیل، در ابتدا شخصی به نام «وصّاف» خارج می‌شود و خطبه‌ای می‌خواند که در آن خداوند را تعظیم و تمجید می‌کند، سپس درباره‌ی هر صنفی از صورت‌هایی که پس از او از پشت آن پرده خارج می‌شوند، سخن می‌گوید. سپس به جماعت می‌آموزد که خداوند این را مَثَلی برای بندگانش قرار داده تا عبرت بگیرند و بدانند که امر عالم با خداوند مانند این صورت‌ها با محرک آن‌هاست. و اینکه این پرده، حجاب سرّ قدر محکم در مخلوقات است. و با وجود همه‌ی این‌ها، غافلان آن را لهو و لعب می‌پندارند، و این همان سخن خداوند متعال است: «الَّذِينَ اتَّخَذُوا دِينَهُمْ لَهْواً وَلَعِباً» (کسانی که دین خود را سرگرمی و بازیچه گرفتند). سپس وصّاف غایب می‌شود، و او به منزله‌ی اولین موجود در میان ما، یعنی آدم (علیه السلام) است. و هنگامی که غایب شد، غیبت او از ما نزد پروردگارش در پشت پرده‌ی غیبت بود. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}