{
  "id": 378,
  "title": {
    "ar": "الباب الثامن والسبعون وثلاثمائة في معرفة منزل الأمة البهيمة",
    "en": "Chapter Three Hundred and Seventy-Eighth, Concerning the Knowledge of the Station of the Bestial Community (الأمة البهيمة)",
    "ur": "باب تین سو اٹھتر: امت بہیمہ (الأمة البهيمة) کی منزل کی معرفت میں",
    "fa": "باب سیصد و هفتاد و هشتم در معرفت منزل امت بهیمی (الأمة البهيمة)"
  },
  "content": {
    "ar": "## «الباب الثامن والسبعون وثلاثمائة» في معرفة منزل الأمة البهيمة\n\n\nوالإحصار والثلاثة الأسرار العلوية وتقدم المتأخر وتأخر المتقدم من الحضرة الإلهية\n\n\n> يطير العارفون إلى المسمى *** بأجنحة الملائكة الكرام‏\n\n\n> إلى ذات الذوات بغير نعت *** فترجعهم بأرواح الأسامي‏\n\n\n> فتكمل ذاتهم من كل وجه *** من الحال المنزه والمقام‏\n\n\n> وشاهد حالهم يبدو فيقضي *** فكلهم إمام عن إمام‏\n### [البهائم أمم من جملة الأمم‏]\n\n\nاعلم أيدنا الله وإياك أن البهائم أمم من جملة الأمم لهم تسبيحات تخص كل جنس وصلاة مثل ما لغيرها من المخلوقات فتسبيحهم ما يعلمونه من تنزيه خالقهم فلهم نصيب في لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وأما صلاتهم فلهم مع الحق مناجاة خاصة قال تعالى والطَّيْرُ صَافَّاتٍ كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ وقال وأَوْحى‏ رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي من الْجِبالِ بُيُوتاً ومن الشَّجَرِ ومِمَّا يَعْرِشُونَ ثُمَّ كُلِي من كُلِّ الثَّمَراتِ فَاسْلُكِي سُبُلَ رَبِّكِ وهي ما شرع الله لها من السبل أن تسلكها ذللا فكل شي‏ء من المخلوقات له كلام يخصه يعلمه الله ويسمعه من فتح الله سمعه لإدراكه وجميع ما يظهر من الحيوان من الحركات والصنائع التي لا تظهر إلا من ذي عقل وفكر وروية وما يرى في ذلك من الأوزان تدل على إن لهم علماء في أنفسهم بذلك كله ثم يرون منهم أمورا تدل على أنهم ما لهم ما للإنسان من التدبير العام فتعارضت عند الناظرين في أمرهم الأمور فانبهم أمرهم عليهم وربما سموا لذلك بهائم من إبهام الأمر إلا عندنا فإنه أوضح من كل واضح وما أتى علي من‏\n\n\nأتى عليه إلا من عدم الكشف لذلك فلا يعرفون من المخلوقات إلا قدر ما يشاهدونه منهم وكذلك من ألحقهم بدرجة المعارف والعلم بالله وبما أهلهم الله له ما ألحقهم بذلك إلا من كون الله كشف له عن أمرهم وأحوالهم أو مؤمن صادق الايمان قد بلغه عن الله في كتاب أو سنة أمرهم وساعدنا على هذا القول شيخنا وإمامنا المتقدم حجة الله على المحققين الذي يقول فيه أبو طالب المكي صاحب قوت القلوب إذا حكى عنه قولا قال عالمنا سهل بن عبد الله التستري الذي رأى قلبه يسجد وهو صغير فلم يرفع واستظهر القرآن وهو ابن ست سنين ولما دخلت الخلوة على ذكره فتح لي به من ليلتي تلك الفتح الخاص بذلك الذكر فانكشف لي بنوره ما كان عندي غيبا ثم أفل ذلك النور المكاشف به فقلت هذا مشهد خليلي فعلمت أني وارث من تلك الساعة لملة أمر الله رسوله وأمرنا باتباعها وذلك قوله مِلَّةَ أَبِيكُمْ إِبْراهِيمَ هُوَ سَمَّاكُمُ الْمُسْلِمِينَ من قَبْلُ وتحققت أبوته وبنوتي وقد كان شيخنا صالح البربري بإشبيلية قد قال لي يا ولدي إياك أن تذوق الخل بعد العسل فعلمت مراده وكان من أكبر من رأيته من المنقطعين إلى الله تعالى بل المقتطعين ما رأيت على قدمه مثله فجئت الشيخ بكرة وقلت له ما كان في منظوم نظمته إلهي لا عن روية ولا تعمل كما قال أبو العباس بن العريف الصنهاجى‏\n\n\n> وجاء حديث لا يمل سماعه *** شهى إلينا نثره ونظامه‏\n\n\nوكان النظم الذي عملته في حالي‏\n\n\n> كان مثل الخل من بعد العسل *** فمضى المصباح عني وأفل‏\n\n\n> وبدت ظلمة ليل حالك *** أورثت في القلب أسباب العلل‏\n\n\n> قلت ربي قال لبيك فما *** تبتغيه قلت نورا بعمل‏\n\n\n> علم الحق الذي قد قلته *** قال باب مغلق قلت أجل‏\n\n\n> قلت هب لي نورك الخالص لي *** فبدا النور بلا ضرب مثل‏\n\n\n> في سمائي ثم أرضي ثم ما *** بين هذين إلى غير أجل‏\n\n\n> والذي يفهم قولي قد دري *** إنني الأمر الذي منه نزل‏\n\n\nفسر الشيخ بهذا النفس وقال هذا من تجلى الغلس قلت له صدقت كذلك كان قال الحمد لله المنعم على كل حال لو علم الناس النعمة السارية في الأحوال ما فرقوا بين السراء والضراء واتحد الحمد قلت له بل توحد فقال صدقت يا ولدي وأخطأ الشيخ فقبلت يده وقبل رأسي‏\n\n\n> إذا الصادق الداعي أتاك مبينا *** فالق إليه السمع إن كنت مؤمنا\n\n\n> وقلت رسول الله أنت وسيلتي *** إلى مسعدي سرا أقول ومعلنا\n\n\n> ولست بإيماني به مترددا *** فإني علمت الأمر علما مبينا\n\n\n> بكشف أتاني من إلهي بمشهد *** يكون لنا يوم القيامة موطنا\n> فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاء فليدع *** فما ثم إلا الله فالعلم علمنا\n\n\n> إذا قلت يا الله لي من الحشا *** فإن قلت من هذا يقول أنا أنا\n\n\n> أنا الواهب المحسان في كل حالة *** وذلك نعت لا يكون لغيرنا\n\n\n> وما ثم غير بل أقول بما أتت *** به رسلنا فالقول منا بنا لنا\n\n\n> وليس رسولي غير نعتي ولا الذي *** أخاطبه غيري فعينك عيننا\n\n\nفكل شي‏ء في العالم يقال فيه عند أهل النظر وفي العامة إنه ليس بحي ولا حيوان فإن الله عندنا قد فطره لما خلقه على المعرفة به والعلم وهو حي ناطق بتسبيح ربه يدركه المؤمن بإيمانه ويدركه أهل الكشف عينا وأما الحيوان ففطره الله على العلم به تعالى ونطقه بتسبيحه وجعل له شهوة لم تكن لغيره من المخلوقات ممن تقدم ذكره آنفا وفطر الملائكة على المعرفة والإرادة لا الشهوة وأمرهم وأخبر أنهم لا يعصونه لما خلق لهم من الإرادة ولو لا الإرادة ما أثنى عليهم بأنهم لا يعصونه ويَفْعَلُونَ ما يُؤْمَرُونَ وفطر الجن والإنس على المعرفة والشهوة وهو تعلق خاص في الإرادة لأن الشهوة إرادة طبيعية فليس للانس والجن إرادة إلهية كما للملائكة بل إرادة طبيعية تسمى شهوة وفطرهما على العقل لا لاكتساب علم ولكن جعله الله آلة للانس والجن ليردعوا به الشهوة في هذه الدار الآخرة ولذلك قال في الدار الآخرة لأهل الجنان ولَكُمْ فِيها ما تَشْتَهِي أَنْفُسُكُمْ أعلاما لنا بأن النشأة الآخرة التي ينشئنا فيها طبيعية مثل نشأة الدنيا لأن الشهوة لا تكون إلا في النفوس الطبعية والنفوس الطبعية ما لها نصيب في الإرادة فإذا استفاد الإنسان أو الجان علما من غير كشف فإن ذلك مما جعل الله فيه من قوة الفكر فكل ما أعطاه الفكر للنفس الناطقة وكان علما في نفس الأمر فهو من الفكر بالموافقة فالعلوم التي في الإنسان إنما هي بالفطرة والضرورة والإلهام والكشف الذي يكون له إنما يكشف له عن العلم الذي فطره الله عليه فيرى معلومه وأما بالفكر فمحال الوصول به إلى العلم فإن قيل من أين علمت هذا وما هو من مدركات الحس فلم يبق إلا النظر قلنا ليس كما نقول بل بقي الإلهام والإعلام الإلهي فتتلقاه النفس الناطقة من ربها كشفا وذوقا من الوجه الخاص التي لها ولكل موجود سوى الله فالفكر الصحيح لا يزيد على الإمكان وما يعطي إلا هو وهذا من علم الله وإعلامه لم يدرك ذلك بالفكر كان ابن عطاء راكبا على جمل فغاصت رجل الجمل فقال ابن عطاء جل الله فقال الجمل جل الله يزيد عن إجلالك فكان الجمل أعلم بالله من ابن عطاء فاستحى ابن عطاء فهذا من علم البهائم بالله وأما رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فإنه ذكر في الصحيح أن بقرة في زمن بنى إسرائيل حمل عليها صاحبها فقالت ما خلقت لهذا وإنما خلقت للحرث فقالت الصحابة أ بقرة تكلم فقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم آمنت بهذا أنا وأبو بكر وعمر\n\n\nوذلك أن الروح الأمين أخبره فلو عاينها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لما قال آمنت فهذه بقرة من أصناف الحيوان قد علمت ما خلقت له والإنس والجن خلقوا ليعبدوا الله وما علموا ذلك إلا بتعريف الله على لسان الرسول وهو في فطرتهم ولكن ما كشف لهم عما هم عليه ومر بعض أهل الله على رجل راكب على حمار وهو يضرب رأس الحمار حتى يسرع في المشي فقال له الرجل لم تضرب على رأس الحمار فقال له الحمار دعه فإنه على رأسه يضرب فهذا حمار قد علم ما تئول إليه الأمور بالفطرة لا بالفكرة فانظر يا محجوب أين مرتبتك من مرتبة البهائم البهائم تعرفك وتعرف ما يؤول إليه أمرك وتعرف ما خلقت له وأنت جهلت هذا كله ومع هذا فالبهائم في الحيرة في الله وهم مفطورون عليها إقامتها المقام الذي يصل إليه أهل النظر الصحيح في الله وأهل التجلي ولذلك قال الله فيمن لم يعرف الله إِنْ هُمْ إِلَّا كَالْأَنْعامِ يعني في الضلال الذي هو الحيرة ثم قال بَلْ هُمْ أَضَلُّ سَبِيلًا والسبيل الطريق فزاد وإضلالا أي حيرة في الطريق التي يطلبونها للوصول إلى معرفة ربهم من طريق أفكارهم فهذه حيرة زائدة على الحيرة في الله وكذلك قال فيهم حيثما قال إنما جعل الزيادة في السبيل وليس إلا الفكر والتفكر فيما منع التفكر فيه وهو النظر في ذات الله فقال ومن كانَ في هذِهِ أَعْمى‏ وهو حال الجهل بالله كما هو في نفس الأمر من حيث الذات فَهُوَ في الْآخِرَةِ أَعْمى‏ كما هو في الدنيا ثم زاد فقال وأَضَلُّ سَبِيلًا\nوهو الطريق ولذلك قال عمرو بن عثمان المكي في صفة المعرفة والعارفين وكما هم اليوم كذلك يكونون غدا فاعلم إن كنت تفهم تشبيه الله أهل الضلال بالأنعام إنه تعالى ما شبههم بالأنعام نقصا بالأنعام وإنما وقع التشبيه في الحيرة لا في المحار فيه فلأشد حيرة في الله من العلماء بالله ولذلك‏\n\n\nورد عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه قال لربه زدني فيك تحيرا\n\n\nلما علم من علو مقام الحيرة لأهل التجلي لاختلاف الصور وتصديق هذا الحديث‏\n\n\nقوله لا أحصي ثناء عليك أنت كما ثنيت على نفسك‏\n\n\nوقد علمنا ما أثنى الله به على نفسه من بسط يديه بالإنفاق وفرحه بتوبة عبده وغير ذلك من أمثاله ومن لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وما قَدَرُوا الله حَقَّ قَدْرِهِ وقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لو يعلم البهائم من الموت ما تعلمون ما أكلتم منها سمينا\n\n\nفانظر في تنبيهه صَلَّى اللهُ عَليهِ وسَلَّم على حسن استعدادهم وسواء استعدادنا حتى أنه من كان بهذه المثابة من الفكرة في الموت فغايته أن يحصل له استعداد البهائم وهو ثناء على من حصل في هذا المقام وارتفاع في حقه وكيف ينظر البهائم دون الإنسان في الاحتقار وغاية الثناء عليك من الله أن تشاركها في صفتها فاشحذ فؤادك وقُلْ رَبِّ زِدْنِي عِلْماً فإن لله في خلقه أسرارا ولذلك خَلَقَكُمْ أَطْواراً\n\n\n### [البهائم مسخرة مذللة من الله للإنسان‏]\n\n\nواعلم أن البهائم وإن كانت مسخرة مذللة من الله للإنسان فلا تغفل عن كونك مسخرا لها بما تقوم به من النظر في مصالحها في سقيها وعلفها وما يصلح لها من تنظيف أماكنها ومباشرة القاذورات والأزبال من أجلها ووقايتها من الحر والبرد المؤذيات لها فهذا وأمثاله من كون الحق سخرك لها وجعل في نفسك الحاجة إليها فإنها التي تحمل أثقالك إلى بلد لم تكن تبلغه إلا بنصف ذاتك وهو شق الأنفس أي ما كنت تصل إليه إلا بالوهم والتخيل لا بالحس إلا بوساطة هذه المراكب فلا فضل لك عليها بالتسخير فإن الله أحوجك إليها أكثر مما أحوجها إليك‏\n\n\nأ لا ترى إلى غضب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين سئل عن ضالة الإبل كيف قال ما لك ولها معها حذاؤها وسقاؤها ترد الماء وتأكل الشجر حتى يجدها ربها\n\n\nفما جعل لها إليك حاجة وجعل فيك الحاجة إليها وجميع البهائم تفر منك ممن لها آلة الفرار وما هذا إلا لاستغنائها عنك وما جبلت عليه من العلم بأنك ضار لها ثم طلبك لها وبذل مجهودك في تحصيل شي‏ء منها دليل على افتقارك إليها فبالله من تكون البهائم أغنى منه كيف يحصل في نفسه أنه أفضل منها صدق القائل ما هلك امرؤ عرف قدره فو الله ما يعرف الأمور إلا من شهدها ذوقا وعاينها كشفا\n\n\n> لا يعرف الشوق إلا من يكابده *** ولا الصبابة إلا من يعانيها\n\n\nما وصل إليك خبر الفيل وحبسه وامتناعه من القدوم على خراب بيت الله ما بلغك ما فعلت الطير بأصحاب الفيل وما رمتهم به من الحجارة التي لها خاصية في القتل دون غيرها من الأحجار أ ترى يصدر ذلك منها من غير وحي إلهي إليها بذلك فكم من فيل كان في العالم وكم من أصحاب غزاة كانوا في العالم لما ظهر مثل هذا الأمر في هؤلاء وما ظهر في غيرهم وهل يوحي الله إلى من لا يعقل عنه وهل قال تعالى وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ هل ذلك إلا ليفهموا لتقوم عليهم الحجة إذا خالفوا أو يعملوا بما فهموا فيسعدوا هل سمعت في النبوة الأولى والثانية قط إن حيوانا أو شيئا من غير الحيوان عصى‏\n\n\nأمر الله أو لم يقبل وحي الله أين أنت من فرار الحجر بثوب موسى عليه السلام حتى بدت لقومه سوأته ليعلموا كذبهم فيما نسبوه إليه فَبَرَّأَهُ الله مِمَّا قالُوا أ ترى فرار الحجر هل كان عن غير أمر الله إياه بذلك أ ترى إباية السموات والأرض والجبال عن حمل الأمانة وإشفاقهم منها عن غير علم بقدر الأمانة وما يؤول إليه أمر من حملها فلم يحفظ حق الله فيها وعلمهم بالفرق بين العرض والأمر فلما كان عرض تخيير احتاطوا لأنفسهم وطلبوا السلامة ولما أمرهم الحق تعالى بالإتيان فقال للسماء والأرض ائْتِيا طَوْعاً أَوْ كَرْهاً قالَتا أَتَيْنا طائِعِينَ طاعة لأمر الله وحذرا أن يؤتى بهما على كره أ ترى لو نزل القرآن على جبل فخشع وتصدع من خشية الله أ ترى ذلك منه عن غيره علم بقدر ما أنزل الله عليه وما خاطب به من التخويفات التي تذوب لها صم الجبال الشامخات كم بين الله ورسوله لنا ما هي المخلوقات عليه من العلم بالله والطاعة له والقيام بحقه ولا نؤمن ولا نسمع ونتناول ما ليس الأمر عليه لنكون من المؤمنين ونحن على الحقيقة من المكذبين ورجحنا حسنا على الايمان بما عرفنا به ربنا لما لم نشاهد ذلك مشاهدة عين‏\n\n\n### [الموجودات كلها ما منها إلا من هو حي ناطق‏]\n\n\nواعلم أنه من علم إن الموجودات كلها ما منها إلا من هو حي ناطق أو حيوان ناطق المسمى جمادا أو نباتا أو ميتا لأنه ما من شي‏ء من قائم بنفسه‏\nوغير قائم بنفسه إلا وهو مسبح ربه بحمده وهذا نعت لا يكون إلا لمن هو موصوف بأنه حي ومن كان مشهده هذا من الموجودات استحى كل الحياء في خلوته التي تسمى جلوة في العامة كما يستحي في جلوته فإنه في جلوة أبدا لأنه لا يخلو عن مكان يقله وسماء تظله ولو لم يكن في مكان لأستحى من أعضائه ورعية بدنه فإنه لا يفعل ما يفعل إلا بها فإنها آلاته وأنه لا بد أن تستشهد فتشهد ولا يستشهد الله إلا عدلا فصاحب هذه الحال لا يصح أن يكون في خلوة أبدا ومن كان هذا حاله فقد لحق بدرجة البهائم والدليل على ذلك‏\n\n\nأن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قد ذكر عنه في الصحيح أنه قال إن للميت جؤار أو إن السعيد منهم يقول قدموني قدموني يعني إلى قبره وإن الشقي منهم يقول إلى أين تذهبون بي وأخبر صَلَّى اللهُ عَليهِ وسَلَّم أن كل شي‏ء يسمع ذلك منه إلا الإنس والجن‏\n\n\nفدخل تحت قوله كل شي‏ء مما يمر عليه ذلك الميت من جماد ونبات وحيوان وثبت أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم كان راكبا على بغلة فمر على قبر داثر فنفرت البغلة فقال إنها رأت صاحب هذا القبر يعذب في قبره فلذلك نفرت‏\n\n\nوقار في ناقته لما هاجر ودخل المدينة ترك زمامها فأراد بعض الصحابة أن يمسكها فقال دعوها فإنها مأمورة ولا يؤمر إلا من يعقل الأمر حتى بركت بنفسها بفناء دار أبي أيوب الأنصاري فنزل به‏\n\n\nوقال في الصحيح أن المؤذن يشهد له مدى صوته من رطب ويابس‏\n\n\nوهذا كله مباين لكل شي‏ء ولا يشهد هذا من الإنس والجن إلا أفراد من أفراد هذين النوعين فإن الجن يجتمعون مع الإنس في الحد فإن الجن حيوان ناطق إلا أنه اختص بهذا الاسم لاستتاره عن أبصار الإنس غالبا فهم مع الإنس كالظاهر من الإنسان وحده مع باطنه ولذلك قال تعالى في غير هذين النوعين وما من دَابَّةٍ في الْأَرْضِ ولا طائِرٍ يَطِيرُ بِجَناحَيْهِ إِلَّا أُمَمٌ أَمْثالُكُمْ والأمثال هم الذين يشتركون في صفات النفس فكلهم حيوان ناطق ثم قال تعالى فيهم ثُمَّ إِلى‏ رَبِّهِمْ يُحْشَرُونَ يعني كما تحشرون أنتم وهو قوله تعالى وإِذَا الْوُحُوشُ حُشِرَتْ للشهادة يوم الفصل والقضاء ليفصل الله بينهم كما يفصل بيننا فيأخذ للجماء من القرناء كما ورد وهذا دليل على أنهم مخاطبون مكلفون من عند الله من حيث لا نعلم قال تعالى وإِنْ من أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ فنكر الأمة والنذير وهم من جملة الأمم ونذيرهم قد يكون لكل واحد منهم نذير في ذاته وقد يكون للنوع من جنسه لا بد من ذلك من حيث لا يعلمه ولا يشهده إلا من أشهده الله ذلك كما قال في الشيطان إِنَّهُ يَراكُمْ هُوَ وقَبِيلُهُ من حَيْثُ لا تَرَوْنَهُمْ وذكر أنهم يوحون إلى أوليائهم ليجادلونا ويظن المجادل الذي هو ولي الشيطان إن ذلك من نفسه ومن نظره وعلمه وهو من وحي الشيطان إليه يعرف ذلك أهل الكشف عينا ويسمعونه بآذانهم كما يسمعون كل صوت وما من حيوان إلا ويشهد ذلك ولذلك أخرسهم الله عن تبليغ ما يشهدونه إلينا فهم أمناء بصورة الحال في حقنا ولا يكشف الله لأحد من النوع الإنساني ما يكشفه للبهائم مما ذكرناه إلا إذا رزقه الله الأمانة وهي أن يستر عن غيره ما يراه من ذلك إلا بوحي من الله بالتعريف فإن الله ما أخذ بأبصار الإنس وبأسماعهم في الأكثر وبالفهم في أصوات هبوب الرياح وخرير المياه وكل مصوت إلا ليكون ذلك مستورا فإذا أفشاه هذا المكاشف فقد أبطل حكمة الوضع إلا أن يوحى إليه بالكشف عن بعض ذلك فحينئذ يعذر في الإفشاء بذلك القدر وفي هذا المنزل من العلوم علم ثناء الرحماء وعلم من أظهر الشريك وهو لا يعتقده كما أنه من الموحدين من ينفي الشريك وهو يعتقده وهو الذي يرى أن من الأسباب من يفعل الشي‏ء لذاته والموحد في الأفعال يرى أنه لا فاعل إلا الله كمن يقول إذا اجتمع الزاج والعفص وارتفعت الموانع الطبيعية فإنه لا بد من السواد الذي هو المداد مع كونه موحدا والموحد من يرى إيجاد السواد لله كالأشاعرة وأمثالهم وإن الإمكان يقضي أن يكون اجتماعهما مع ارتفاع الموانع الطبيعية ولا يكون سواد إلا إن خلق الله ذلك للون فيه هذا في الطبيعيين وأما في المتكلمين الموحدين فإنهم يقولون إن الناظر إذا عثر على وجه الدليل فإن المدلول يحصل ضرورة مع تفريقهم بين وجه لدليل والمدلول وهذا لا يصح عند السليم العقل فإنه يحصل وجه الدليل ولا يحصل المدلول ولا يتمكن لهم أن يقولوا إن وجه الدليل هو عبارة عن حصول المدلول فإنهم يفرقون بين وجه الدليل والمدلول فلو زادوا مع ضرورة عادة لا عقلا لم يعترض عليهم فإنه لا فرق بين وجه الدليل والرؤية في الرائي بل الرؤية أتم ونحن نعلم بالإيمان أن الله قد أخذ بأبصارنا مع وجود الرؤية فينا\nعن كثير من المبصرات لغيرنا فلم يحصل المرئي ضرورة مع وجود الرؤية وارتفاع الموانع التي تقدح في هذه النشأة الطبيعية فيرى الإنسان الواحد ما لا يراه الآخر مع حضور المرئي لهما واجتماعهما في سلامة حاسة البصر فهذا حجاب إلهي ليس للطبيعية ولا للكون فيه أثر وهذا كثير فكم من مشرك في الظاهر موحد في الباطن وبالعكس وفيه علم الآجال ما يعلم منها وما لا يعلم وفيه علم كينونية الله في أينيات مختلفات بذاته ومثل ذلك مثل البياض في كل أبيض إن فهمت فإن الله تعالى ما ذكر عن نفسه حكما فيه لا يكون له مثل في الموجودات لأنه لو ذكر مثل هذا لم تحصل فائدة التعريف غير أنه يدق على بعض الأفهام فمن ظهر له الموجود الذي له عين ذلك الحكم علمنا أنه المخاطب من الله بذلك الحكم لا غيره كما قال تعالى لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ فبعض الناس قد علم ما أراد بالكبر هنا وبعضهم لا يعرف ذلك فالذي عرف ذلك هو المخاطب بهذه الآية وهكذا في كل خطاب حتى في لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ خاطب به من يعلم نفي المثلية في الأشياء وفيه علم عموم تعلق العلم الإلهي بالمعلومات ومن علم منا حصر المعلومات في واجب ومحال وممكن في نفس الأمر قد عم من وجه كلي وبقي الفصل بين العلماء في نفس الأمر المحكوم عليها بأحد هذه الأحكام وفيه علم ما يأتي من الممكنات وهي كلها آيات فيعرض عن النظر في كونها آية من يعرض ما السبب في إعراض واحد وعدم إعراض آخر في ذلك وفيه علم من يشكك نفسه فيما قد تبين له ما السبب الذي يدعوه إلى ذلك التشكيك وفيه علم من أي حقيقة إلهية خلق الله الالتباس في العالم هل كان ذلك لكونه يتجلى لعباده في صور مختلفة تعرف وتنكر مع أنه تعالى في نفسه على حقيقة لا تتبدل ولا يكون التجلي إلا هكذا فما في العالم إلا التباس وذلك لكون الشارع قد أخبر أن المؤمن يظهر بصورة الكافر وهو سعيد والكافر يظهر بصورة المؤمن وهو شقي فلا يقطع على أحد بسعادة ولا بشقاء لالتباس الأمر علينا فهذا عندنا ليس بالتباس وإنما الالتباس أن نقطع بالشقاء على السعيد وبالسعادة على الشقي حينئذ يكون الأمر قد التبس علينا وأما إذا لم نقطع فما التبس علينا شي‏ء وفيه علم إن الحكم للرحمة يوم القيامة وأن العدل من الرحمة ويوم القيامة يوم العدل في القضاء وإنما تأتي الرحمة في القيامة ليشهد الأمر حتى إذا انتهى حكم العدل وانقضت مدته في المحكوم عليه تولت الرحمة الحكم فيه إلى غير نهاية وفيه علم ما هو لله وما هو للخلق وأعني بما هو لله أنه مخلص وفيه علم الوصف الخالص بالله الذي لا يشركه فيه من ليس بآلة وفيه علم لم تعددت الأسماء الإلهية باختلاف معانيها فهل هي أسماء لما تحتها من المعاني أو هي أسماء لمن نسبت إليه تلك المعاني وهل تلك المعاني أمور وجودية أو نسب لا وجود لها وفيه علم الإنصاف والعدل في القضايا والحكومات وفيه علم ما يغني من الاستحقاق بعد انقضاء مدة حكمه وما معنى الفلاح في القضايا والحكومات وفيه علم ما يغني من الاستحقاق بعد انقضاء مدة حكمه وما معنى الفلاح فيه نفيه عن المستحق بالعقوبة وفيه علم جحد المشرك الشريك هل له في ذلك وجه إلى الصدق أو هو كاذب من كل وجه وذلك أن القائل في الحقيقة ليس غير الله فلا بد أن يكون له وجه إلى الصدق من هناك ينسب أنه قول الله وإن ظهر على لسان المخلوق فإن الله قاله على لسان عبده وقد ورد عن الرسول صَلَّى اللهُ عَليهِ وسَلَّم في الصحيح أن الله يقول على لسان عبده‏\n\n\nونطق القرآن بذلك فعين كلام الترجمان هو كلام المترجم عنه وفيه علم ما تعطيه الأحوال فيمن قامت به من الأحكام وفيه علم ما ينتجه القطع بوقوع أحد الممكنين من غير دليل وفيه علم ما يسخطه العارف الذي له الكشف من فعل الحق مما لا يسخطه والسخط من عمل الباطن حتى لو لم يقم به سخط في باطنه وأظهر السخط كان حاله إلى النفاق أقرب من حاله إلى الايمان وفيه علم الحث على النفاق هل يناقض التسليم وإذا اجتمع صاحب تسليم وصاحب مداراة أي الرجلين اعلم وفيه علم السبب المانع للسامع إذا نودي ولم يجب هل يقال إنه سمع أو يقال فيه إنه لم يسمع وفيه علم الظلمة وهو العمي والضلال وهو الحيرة وفيه علم عموم الحشر لكل ما ضمنته الدار الدنيا من معدن ونبات وحيوان وإنس وجان وسماء وأرض وفيه علم السبب الذي يدعو إلى توحيد الحق سبحانه ولا يتمكن معه إشراك وهل له حكم البقاء فيبقى حكم التوحيد أو لا بقاء له أو يبقى في حق قوم دون قوم وفيه علم عموم الايمان ولهذا يكون المال إلى الرحمة التي لا يرحم الله إلا المؤمنين فإنه من الرحمة حكم عموم الايمان وفيه علم البوادة والهجوم وله باب في الأحوال‏\nمن هذا الكتاب وفيه علم من تكلف العلم وليس بعالم فصادف العلم هل يقال فيه إنه عالم أم لا وفيه علم الحب لله والبغض لله هل للذي بغض لله وجه يحب فيه لله كما له من الله وجه يرزقه به على بغضه فيه وفيه علم فائدة التفصيل في المجمل وفيه علم فطرة الإنسان على العجلة في الأشياء إذا كان متمكنا منها وفيه علم الغيوب وما يعلم منها وما لا يعلم منها والأسباب المجهولة مسبباتها من حيث إنها لهذه الأسباب مع العلم بها وبأسبابها إلا من حيث إنها أسباب لها وفيه علم الله شخصيات العالم وفيه علم الوفاة والبعث في الدنيا وعلم الوفاة التي يكون البعث منها في الآخرة والانتقال إلى البرزخ في الموتتين وفيه علم مراتب الأرواح الملكية في عباداتهم وفيه علم عموم نجاة العالم المشرك وغير المشرك وهو علم غريب مخصوص عليه في القرآن ولا يشعر به وفيه علم السبب الموجب لترك الفعل من القادر عليه وفيه علم لكل اسم مسمى ولا يلزم من ذلك وجود المسمى في عينه وأي مرتبة تعم جميع المعلومات بالوجود سواء كان المعلوم محال الوجود أو لا يكون وفيه علم ما يكون من الجزاء برزخا فينتج العمل به جزاء آخر وفيه علم الردة لما ذا ترجع وما هو إلا سلوك إلى أمام كما نقول رجعت الشمس في زيادة النهار ونقصه وما عندها رجوع بل هي على طريقها فهل هو كالنسخ في الأشياء وهو انتهاء مدة الحكم وابتداء مدة حكم آخر والطريق واحدة لم يكن في السالك عليها رجوع عنها وفيه علم النفخ واختلاف أحكامه مع أحدية عينه وفيه علم المشاهدة والفرق بينها وبين علم النظر وفيه علم الاستدلال وفيه علم لكل علم رجال ولكل مقام مقال وإن كان لا ينقال فمقالة حال وفيه علم من تشبه بمن لا يقبل التشبيه به ما الذي دعاه إلى ذلك وفيه علم الإعادة أنها على صورة الابتداء وإن لم تكن كذلك فليست بإعادة وفيه علم هل يكون الشي‏ء محلا لضده أم لا وفيه علم إيضاح المبهمات وفيه علم حكم الليل والنهار ونسبة الولوج والغشيان والتكوير إليهما وكونهما جديدين وملوين وفيه علم إخراج الكثير من الواحد وكيف لا يصح ذلك إلا بالتدريج على التركيب الطبيعي الذي لا يتركب إلا بالواحد وفيه علم ما معنى الاستحالات في الأشياء وفيه علم الأحكام هل يصح كل حكم على من توجه عليه أو منها ما يصح ومنها ما لا يصح والحاكم الله فكيف يكون في الوجود حكم لا يصح على المحكوم عليه وفي هذه المسألة غموض من كون الحكم بالشريك قد ظهر في الوجود وهو حكم باطل إذا نسب إلى الله إذ هو تعالى لا شريك له في ملكه وفيه علم اتساع المقالة في الله وأنه الإمهال الإلهي لا إهمال وفيه علم ما تؤثر التسمية وما يؤثر تركها وفيه علم ما تضمنته هذه الأبيات وهي‏\n\n\n> الجهل موت ولكن ليس يعلمه *** إلا الذي حييت بالعلم أنفاسه‏\n\n\n> لا يعرف الحل في عقد ربطت به *** إلا الذي قويت بالفتل أمراسه‏\n\n\n> وما حللت ولكن أنت تزعمه *** ومن تخيل هذا صح إبلاسه‏\n\n\n> من يظلل الله لا هادي يبصره *** وهو الذي في غناه صح إفلاسه‏\n\n\nوفيه علم ما يقع فيه التضعيف والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Seventy-Eight\n\nConcerning the Gnosis of the Station of the Animal Community (الأمة البهيمة), the Restriction (الإحصار), the Three Celestial Secrets, and the Advancement of the Delayed and the Delay of the Advanced from the Divine Presence (الحضرة الإلهية).\n\n> The Gnostics (العارفون) fly toward the Named (المسمى)\n> Upon the wings of the Noble Angels.\n> To the Essence of Essences (ذات الذوات) without attribute,\n> But the spirits of the Names (الأسامي) return them.\n> So their essence is perfected in every respect,\n> From the transcendent state (الحال المنزه) and the station (المقام).\n> And the witness of their state appears and judges,\n> For all of them are Imams (leaders), one succeeding another.\n\n### [Animals are Communities among the Communities]\n\nKnow—may Allah support us and you—that animals (البهائم) are communities (أمم) among the communities. They possess glorifications (تسبيحات) specific to each species and a prayer (صلاة) like that of other creatures. Their glorification is the knowledge they have of the transcendence (تنزيه) of their Creator, so they have a share in <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him). As for their prayer, they have a special intimate converse (مناجاة) with The Real (الحق).\n\nThe Exalted said: <<وَالطَّيْرُ صَافَّاتٍ كُلٌّ قَدْ عَلِمَ صَلَاتَهُ وَتَسْبِيحَهُ>> (And the birds, with wings spread out; each one knows its prayer and its glorification). And He said: <<وَأَوْحَى رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ ثُمَّ كُلِي مِنْ كُلِّ الثَّمَرَاتِ فَاسْلُكِي سُبُلَ رَبِّكِ>> (And your Lord inspired the bee: \"Take for yourself dwellings in the mountains and in the trees and in that which they construct. Then eat from all the fruits and follow the ways of your Lord\"). These are the ways (السبل) that God has legislated for them to follow submissively (ذللا).\n\nEvery creature has a specific language (كلام) known to God and heard by whomever God opens his hearing to perceive it. All the movements and crafts (الصنائع) that appear from animals, which normally only appear from beings possessing intellect (عقل), thought (فكر), and deliberation (روية), and the balance (الأوزان) observed therein, indicate that they possess internal knowledge (علماء في أنفسهم) of all this. Yet, certain actions are observed from them that indicate they lack the general management (التدبير العام) possessed by humans. Thus, matters concerning them became contradictory to those who contemplate their affairs, and their nature became ambiguous (انبهم أمرهم) to them. Perhaps they were named *Baha'im* (animals) due to this ambiguity (*ibhām*).\n\nHowever, for us, their matter is clearer than any clear thing. Whoever fails to grasp it does so only due to the absence of Unveiling (الكشف) concerning it. They only know of creatures what they observe of them. Likewise, those who attribute to them the degree of Gnosis (المعارف) and knowledge of God, and of what God has qualified them for, only do so because God has unveiled (كشف) their affairs and states to them, or because a sincere believer has received knowledge of their affairs from God through the Book or the Sunnah.\n\nWe are supported in this assertion by our Shaykh and foremost Imam, the Proof of God for the Verifiers (المحققين), whom Abu Talib al-Makki, the author of *Qut al-Qulub*, refers to when relating a saying, saying: \"Our scholar, Sahl ibn Abdullah al-Tustari, whose heart he saw prostrating when he was young and it did not rise, and who memorized the Quran at the age of six.\" When I entered retreat (الخلوة) focusing on his remembrance, the specific illumination (الفتح الخاص) related to that remembrance was granted to me that very night. By its light, what was hidden from me was unveiled. Then that illuminating light set. I said, \"This is the witnessing (مشهد) of my intimate friend (khalīl),\" and I knew from that moment that I was the inheritor of the creed (ملة) that God commanded His Messenger and us to follow, which is His saying: <<مِلَّةَ أَبِيكُمْ إِبْرَاهِيمَ هُوَ سَمَّاكُمُ الْمُسْلِمِينَ مِنْ قَبْلُ>> (The creed of your father Abraham. He named you Muslims before). I realized my fatherhood and my sonship.\n\nOur Shaykh Salih al-Barbari in Seville had said to me, \"My son, beware of tasting vinegar after honey.\" I understood his intention. He was one of the greatest people I had seen devoted to God, or rather, cut off [from the world]. I never saw anyone like him on his path. I came to the Shaykh early one morning and recited to him what I had composed in verse, not out of deliberation or effort, just as Abu al-Abbas ibn al-Arif al-Sanhaji said:\n\n> And a saying came whose hearing is never tiresome,\n> Its prose and its verse are delightful to us.\n\nThe poem I composed concerning my state was:\n\n> It was like vinegar after honey,\n> The lamp departed from me and set.\n> And the darkness of a black night appeared,\n> Causing the heart reasons for ailments.\n> I said, \"My Lord,\" He said, \"I am here, what\n> Do you seek?\" I said, \"A light through action.\"\n> The Truth (الحق) knew what I had said,\n> He said, \"The door is closed.\" I said, \"Yes.\"\n> I said, \"Grant me Your pure light,\"\n> And the light appeared without similitude.\n> In my heaven, then my earth, then what\n> Is between these, without end.\n> And he who understands my saying knows\n> That I am the Command (الأمر) from which it descended.\n\nThe Shaykh was pleased with this breath and said, \"This is from the Theophany (تجلي) of the twilight.\" I said to him, \"You spoke the truth, that is how it was.\" He said, \"Praise be to God, the Benefactor in every state. If people knew the grace (النعمة) flowing through all states, they would not differentiate between ease and hardship, and praise would become unified.\" I said to him, \"Rather, it would become One (توحد).\" He said, \"You spoke the truth, my son,\" and the Shaykh erred. I kissed his hand, and he kissed my head.\n\n> If the truthful caller comes to you explaining,\n> Lend him your ear if you are a believer.\n> I said, \"You are the Messenger, my means\n> To my happiness, secretly and openly I say.\"\n> I am not hesitant in my faith in him,\n> For I know the matter with certain knowledge (علما مبينا).\n> By an Unveiling (كشف) that came to me from my God in a witnessing (مشهد)\n> Which will be our dwelling place on the Day of Resurrection.\n> <<فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَدْعُ>> (So let him who wills believe, and let him who wills call out),\n> For there is nothing there but Allah, so the Knowledge (العلم) is ours.\n> If I say, \"O Allah,\" from my heart,\n> And if I ask, \"Who is this?\" He says, \"I am I.\"\n> I am the Giver, the Benefactor (المحسان) in every state,\n> And that is an attribute that belongs to none but Us.\n> And there is no 'other,' rather I speak with what\n> Our Messengers brought, so the saying is from Us, by Us, for Us.\n> And My Messenger is none other than My Attribute (نعتي), nor is the one\n> Whom I address other than Myself, so your eye is Our eye.\n\nEverything in the world that is said by the people of speculation and the common folk to be neither living (حي) nor animal (حيوان)—God created it upon Gnosis (المعرفة) of Him and Knowledge (العلم). It is alive and speaking (ناطق) with the glorification of its Lord. The believer perceives this through his faith, and the people of Unveiling (أهل الكشف) perceive it directly (عينا).\n\nAs for the animal (الحيوان), God created it upon knowledge of Him, and its speech is His glorification, and He gave it an appetite (شهوة) that was not given to the other creatures mentioned previously. He created the angels upon Gnosis and Will (الإرادة), but not appetite. He commanded them and informed us that they do not disobey Him because of the Will created in them. Were it not for the Will, He would not have praised them by saying they do not disobey Him and <<يَفْعَلُونَ مَا يُؤْمَرُونَ>> (they do what they are commanded).\n\nHe created the Jinn and humans upon Gnosis and Appetite, which is a specific attachment within the Will, because appetite is a natural will (إرادة طبيعية). Thus, humans and Jinn do not possess a Divine Will (إرادة إلهية) like the angels, but rather a natural will called appetite. He created them both with intellect (العقل), not for the acquisition of knowledge, but God made it an instrument for humans and Jinn to restrain appetite in this world. That is why He said concerning the Hereafter for the people of Paradise: <<وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنْفُسُكُمْ>> (And therein is whatever your souls desire), informing us that the next existence (النشأة الآخرة) in which He will raise us is natural, like the existence of this world, because appetite only exists in natural souls, and natural souls have no share in the [Divine] Will.\n\nIf a human or Jinn gains knowledge without Unveiling, that knowledge comes from the power of thought (الفكر) that God placed in them. Everything that thought grants to the rational soul (النفس الناطقة) that is knowledge in reality is knowledge by concurrence (بالموافقة) with the truth. The sciences within man are only by innate disposition (الفطرة), necessity (الضرورة), inspiration (الإلهام), and Unveiling, which only unveils the knowledge upon which God created him, allowing him to see his known object. As for thought, it is impossible to reach knowledge through it.\n\nIf it is asked, \"How do you know this, since it is not among the perceptions of the senses, and thus only speculation (النظر) remains?\" We say, \"It is not as you say, but inspiration (الإلهام) and Divine information (الإعلام الإلهي) remain.\" The rational soul receives this from its Lord through Unveiling and tasting (ذوقا) from the specific aspect that belongs to it and to every existent other than God. Sound thought does not exceed possibility (الإمكان) and only yields possibility. This is from God's Knowledge and information; it is not attained by thought.\n\nIbn Atta was riding a camel when the camel's leg sank. Ibn Atta said, \"God is Glorious (جل الله).\" The camel said, \"God is Glorious, exceeding your glorification.\" The camel was more knowledgeable of God than Ibn Atta, and Ibn Atta was ashamed. This is an example of the animals' knowledge of God.\n\nAs for the Messenger of God, peace and blessings be upon him, it is mentioned in the *Sahih* collection that a cow in the time of the Children of Israel, when its owner loaded it, said, \"I was not created for this; I was created for plowing.\" The Companions asked, \"Does a cow speak?\" The Messenger of God, peace and blessings be upon him, said, \"I believe in this, and Abu Bakr and Umar.\" This was because the Trustworthy Spirit (Jibril) informed him. Had the Messenger of God, peace and blessings be upon him, witnessed it directly, he would not have said, \"I believe.\" This cow, from the species of animals, knew what it was created for. Humans and Jinn were created to worship God, and they only knew this through God's definition upon the tongue of the Messenger, though it is in their innate disposition (فطرتهم), but it was not unveiled to them.\n\nOne of the people of God passed by a man riding a donkey and hitting its head to make it walk faster. The man said to him, \"Why are you hitting the donkey's head?\" The donkey said to the man, \"Leave him, he is hitting his own head.\" This donkey knew the outcome of affairs (مآل الأمور) by innate disposition, not by thought.\n\nLook, O veiled one (يا محجوب), where is your rank compared to the rank of the animals? The animals know you, know the outcome of your affair, and know what they were created for, while you are ignorant of all this. Despite this, animals are in Bewilderment (الحيرة) concerning God, and they are created upon it, establishing them in the station reached by the people of sound speculation and the people of Theophany (التجلي). That is why God said concerning those who do not know God: <<إِنْ هُمْ إِلَّا كَالْأَنْعَامِ>> (They are but like cattle), meaning in the misguidance (الضلال) which is Bewilderment. Then He said: <<بَلْ هُمْ أَضَلُّ سَبِيلًا>> (Nay, they are further astray in way). The way (السبيل) is the path, so He added further misguidance, meaning Bewilderment in the path they seek to reach the Gnosis of their Lord through their thoughts. This is a Bewilderment added to the Bewilderment in God.\n\nLikewise, He said concerning them, wherever He mentioned them, that the increase is only in the path (السبيل), and that is nothing but thought and contemplation concerning what is forbidden to contemplate, which is speculation on the Essence (الذات) of God. So He said: <<وَمَنْ كَانَ فِي هَذِهِ أَعْمَى>> (And whoever is blind in this [world])—which is the state of ignorance of God as He is in reality, from the perspective of the Essence—<<فَهُوَ فِي الْآخِرَةِ أَعْمَى>> (he will be blind in the Hereafter) just as he was in this world. Then He added: <<وَأَضَلُّ سَبِيلًا>> (and further astray in way)—which is the path.\n\nThat is why Amr ibn Uthman al-Makki said concerning the description of Gnosis (المعرفة) and the Gnostics: \"As they are today, so shall they be tomorrow.\" Know, if you understand God's comparison of the misguided to cattle, that He did not compare them to cattle to diminish the cattle, but the comparison lies in the Bewilderment (الحيرة), not in the object of Bewilderment. For the most intense Bewilderment in God belongs to the scholars of God (العلماء بالله). That is why it was reported from the Messenger of God, peace and blessings be upon him, that he said to his Lord: \"Increase me in Bewilderment concerning You (زدني فيك تحيرا),\" knowing the high station of Bewilderment for the people of Theophany due to the variation of forms.\n\nThe confirmation of this Hadith is his saying: \"I cannot enumerate Your praise; You are as You have praised Yourself.\" We know what God has praised Himself with, such as extending His hands in spending, and His joy at the repentance of His servant, and other such examples, and also <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him) and <<وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ>> (And they did not appraise Allah with true appraisal).\n\nThe Messenger of God, peace and blessings be upon him, said: \"If animals knew about death what you know, you would not eat a fat one from them.\" Look at his, peace and blessings be upon him, notification of their excellent preparedness (استعدادهم) and the mediocrity of our preparedness, such that the utmost attainment for one who reaches this level of thought concerning death is to achieve the preparedness of the animals. This is praise for one who attains this station and an elevation of his status. How can animals be viewed with contempt when the highest praise for you from God is to share their attribute? So sharpen your heart and say, <<رَبِّ زِدْنِي عِلْمًا>> (My Lord, increase me in knowledge), for God has secrets in His creation, and that is why <<خَلَقَكُمْ أَطْوَارًا>> (He created you in stages).\n\n### [Animals are Subjugated and Made Subservient by God to Man]\n\nKnow that even though animals are subjugated (مسخرة) and made subservient (مذللة) by God to man, do not neglect the fact that you are also subservient to them (مسخرا لها) by having to care for their interests: watering them, feeding them, cleaning their places, handling their filth and dung for their sake, and protecting them from harmful heat and cold. This and similar acts are part of The Real (الحق) making you subservient to them and placing the need for them within your soul. For they are the ones who carry your heavy loads to a land you could not reach except by half of yourself—that is, with great difficulty (شق الأنفس)—meaning you could not reach it except by imagination (الوهم) and fancy (التخيل), not by sense perception, except through the mediation of these mounts.\n\nTherefore, you have no superiority over them through subjugation, for God has made you need them more than He has made them need you. Do you not see the anger of the Messenger of God, peace and blessings be upon him, when he was asked about a lost camel? How he said, \"What concern is it of yours? It has its hooves and its water-skin; it goes to the water and eats the trees until its owner finds it.\" He did not make them need you, but He placed the need for them within you.\n\nAll animals flee from you—those that have the means to flee—and this is only due to their self-sufficiency from you and the knowledge they are created upon that you are harmful to them. Your seeking them and exerting effort to acquire some of them is proof of your poverty (افتفار) toward them. By God, how can one who is poorer than the animals believe himself to be superior to them? The one who said, \"No man perished who knew his own measure,\" spoke the truth. By God, none knows these matters except one who witnesses them by tasting (ذوقا) and observes them by Unveiling (كشفا).\n\n> None knows longing (الشوق) save he who suffers it,\n> Nor passion (الصبابة) save he who endures it.\n\nDid the news of the elephant and its confinement and refusal to advance upon the destruction of God's House not reach you? Did the actions of the birds against the People of the Elephant not reach you, and how they pelted them with stones possessing a specific property for killing, unlike other stones? Do you think this proceeded from them without Divine inspiration (وحي إلهي)? How many elephants were there in the world, and how many armies of invaders, when such an event occurred only with these specific ones and not others? Does God reveal to one who does not comprehend Him? Did the Exalted not say: <<وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ>> (And We did not send any messenger except with the language of his people, that he might make clear to them)? Is this not so that they may understand, so that the proof may be established against them if they disobey, or so that they may act upon what they understood and thus be happy?\n\nHave you ever heard, in the first or second prophecy, that an animal or anything other than an animal disobeyed God's command or did not accept God's revelation? Where are you concerning the stone fleeing with the garment of Moses, peace be upon him, until his private parts were exposed to his people, so they might know the falsity of what they attributed to him, <<فَبَرَّأَهُ اللَّهُ مِمَّا قَالُوا>> (So Allah cleared him of what they said)? Do you think the stone's flight was without God commanding it?\n\nDo you think the refusal of the heavens, the earth, and the mountains to bear the Trust (الأمانة) and their fear of it was without knowledge of the measure of the Trust and the outcome for one who bore it and failed to uphold God's right in it? They knew the difference between an offer (العرض) and a command (الأمر). Since it was an offer of choice, they took precautions for themselves and sought safety. But when The Real commanded them to come, saying to the heavens and the earth: <<ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ>> (Come willingly or unwillingly. They said, \"We come willingly\"), they obeyed God's command, fearing they would be brought unwillingly.\n\nDo you think that if the Quran were revealed to a mountain, and it humbled itself and split apart from the fear of God, that this would be without knowledge of the measure of what God revealed to it and the terrifying warnings addressed therein, which would melt solid, towering mountains? God and His Messenger have clarified for us the knowledge of God, the obedience to Him, and the upholding of His right that creatures possess, yet we neither believe nor listen. We rely on our senses (حسنا) over faith in what our Lord has made known to us, because we have not witnessed it with the eye of certainty (مشاهدة عين).\n\n### [All Existents are Living and Speaking]\n\nKnow that whoever knows that all existents (الموجودات)—whether called inanimate (جماد), plant (نبات), or dead (ميت)—are either living and speaking (حي ناطق) or living animal and speaking (حيوان ناطق), knows that there is nothing, whether subsisting by itself or not, that does not glorify its Lord with His praise. This attribute belongs only to that which is described as living (حي).\n\nOne whose witnessing (مشهد) of existents is this feels the utmost shame (استحى كل الحياء) in his spiritual retreat (خلوته)—which is his public appearance (جلوة) to the common folk—just as he feels shame in his public appearance. For he is always in public, since he is never without a place that carries him and a sky that shades him. Even if he were placeless, he would be ashamed before his own limbs and the subjects of his body, for he does nothing except through them, as they are his instruments, and they must bear witness. God only calls upon a just witness.\n\nThe possessor of this state can never truly be in retreat (خلوة أبدا). Whoever is in this state has attained the rank of the animals (درجة البهائم). The proof of this is that the Messenger of God, peace and blessings be upon him, mentioned in the *Sahih* collection that the deceased has a cry (جؤار). The fortunate one among them says, \"Hurry me forward! Hurry me forward!\" (meaning to his grave), and the wretched one says, \"Where are you taking me?\" The Prophet, peace and blessings be upon him, informed us that everything hears this except humans and Jinn. This includes every inanimate object, plant, and animal that the deceased passes over.\n\nIt is also established that the Messenger of God, peace and blessings be upon him, was riding a mule when he passed a dilapidated grave, and the mule shied away. He said, \"It saw the occupant of this grave being tormented in his grave, and that is why it shied away.\"\n\nHis she-camel (Qaswa) stopped when he migrated and entered Medina. He let go of her reins, and some Companions wanted to hold her, but he said, \"Leave her, for she is commanded (مأمورة).\" Only one who comprehends the command (يعقل الأمر) is commanded. She knelt down by herself in the courtyard of the house of Abu Ayyub al-Ansari, and he stayed with him.\n\nHe also said in the *Sahih* collection that the caller to prayer (المؤذن) is witnessed for by everything within the reach of his voice, wet or dry.\n\nAll this is contrary to the general view, and only individuals (أفراد) among humans and Jinn witness this. Jinn share the definition of humans, for the Jinn are speaking animals (حيوان ناطق), but they are distinguished by this name because they are usually hidden from human sight. They are to humans like the outer aspect of man is to his inner aspect.\n\nThat is why the Exalted said concerning these two types: <<وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ وَلَا طَائِرٍ يَطِيرُ بِجَنَاحَيْهِ إِلَّا أُمَمٌ أَمْثَالُكُمْ>> (There is no creature moving on the earth nor a bird flying with its two wings except communities like unto you). *Amthāl* (الأمثال) are those who share the attributes of the soul (صفات النفس); they are all speaking animals. Then the Exalted said concerning them: <<ثُمَّ إِلَى رَبِّهِمْ يُحْشَرُونَ>> (Then to their Lord they will be gathered), meaning just as you are gathered, which is His saying: <<وَإِذَا الْوُحُوشُ حُشِرَتْ>> (And when the wild beasts are gathered) for the witnessing on the Day of Separation and Judgment, so that God may judge between them just as He judges between us, taking retribution for the hornless from the horned, as reported. This is proof that they are addressed and responsible (مخاطبون مكلفون) by God in ways we do not know.\n\nThe Exalted said: <<وَإِنْ مِنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ>> (And there is no community but a warner has passed through it). He left the community (الأمة) and the warner (نذير) indefinite. They are among the communities, and their warner may be a warner within the essence of each one, or a warner for the species from its own kind. This must be so, though none knows or witnesses it except one to whom God grants the witnessing, just as He said concerning Satan: <<إِنَّهُ يَرَاكُمْ هُوَ وَقَبِيلُهُ مِنْ حَيْثُ لَا تَرَوْنَهُمْ>> (Indeed, he sees you, he and his tribe, from where you do not see them).\n\nHe mentioned that they inspire (يوحون) their allies to argue with us. The arguer, who is the ally of Satan, thinks that this comes from his own self, his speculation, and his knowledge, but it is from the inspiration of Satan to him. The people of Unveiling (أهل الكشف) know this directly (عينا) and hear it with their ears, just as they hear every sound. Every animal witnesses this, and that is why God has silenced them from conveying what they witness to us. They are trustees (أمناء) regarding the state of affairs concerning us.\n\nGod does not unveil to anyone of the human species what He unveils to the animals, as we have mentioned, unless He grants him trustworthiness (الأمانة), which is to conceal from others what he sees of this, except by a revelation from God commanding him to inform. For God has veiled the sight and hearing of most humans, and their understanding of the sounds of the wind, the murmuring of water, and every sound, so that this may remain concealed. If the one granted Unveiling discloses it, he has nullified the wisdom of the divine arrangement (حكمة الوضع), unless he is inspired to unveil some of it, in which case he is excused for that degree of disclosure.\n\nIn this station (منزل) are the sciences of: the praise of the Merciful; the science of one who outwardly manifests partnership (الشريك) but does not believe in it, just as there are monotheists who deny partnership but believe in it (i.e., those who see secondary causes as acting by themselves); the science that the monotheist in Acts (الأفعال) sees no actor but God, unlike one who says that when gallnut and oak-apple meet and natural impediments are removed, blackness (ink) must occur, even though he is a monotheist. The monotheist sees the creation of blackness as belonging to God, like the Ash'arites and their likes, and that possibility dictates that their meeting, with the removal of natural impediments, may or may not result in blackness unless God creates that color therein. This is concerning the naturalists. As for the monotheist theologians, they say that if the observer stumbles upon the face of the proof (وجه الدليل), the proven conclusion (المدلول) necessarily follows, even though they differentiate between the face of the proof and the proven conclusion. This is invalid according to the sound intellect, for the face of the proof may occur without the proven conclusion occurring. They cannot claim that the face of the proof is merely an expression of the occurrence of the proven conclusion, for they differentiate between them. If they had added \"by necessity of habit, not intellect,\" they would not be contradicted, for there is no difference between the face of the proof and the act of seeing in the seer; rather, seeing is more complete. We know by faith that God has veiled our sight from many things visible to others, even though the faculty of sight is present in us and the object of sight is present to both, and both share sound vision. This is a Divine Veil (حجاب إلهي) in which nature and the cosmos have no effect. This is frequent: how many are outwardly polytheists but inwardly monotheists, and vice versa.\n\nIn it is the science of appointed terms (الآجال)—what is known of them and what is not. In it is the science of God's being (كينونية الله) in different 'wherenesses' (أينيات) by His Essence (ذاته). An example of this is whiteness in everything white, if you understand. For God the Exalted has not mentioned a ruling concerning Himself that does not have a parallel in existents. If He mentioned such a thing, the benefit of definition would not be achieved, though it may be subtle to some understandings. Whoever has revealed to him the existent that possesses the very essence of that ruling, we know that he is the one addressed by God with that ruling and no other. Just as the Exalted said: <<لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ>> (The creation of the heavens and earth is greater than the creation of mankind, but most of mankind do not know). Some people know what is meant by \"greater\" here, and some do not. The one who knows this is the one addressed by this verse. This applies to every address, even in <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him); He addresses by it the one who knows the negation of similitude in things.\n\nIn it is the science of the universality of the attachment of Divine Knowledge (العلم الإلهي) to the known things. Whoever among us knows the classification of known things into necessary, impossible, and possible in reality, knows that knowledge is universal from a total perspective. The distinction remains between the scholars concerning the realities judged by one of these rulings.\n\nIn it is the science of what comes from the possibilities (الممكنات), all of which are signs (آيات). Why does one person turn away from contemplating them as signs, and another does not?\n\nIn it is the science of one who doubts himself concerning what has become clear to him—what is the cause that calls him to that doubt?\n\nIn it is the science of which Divine Reality God created ambiguity (الالتباس) in the world. Was it because He manifests Himself (يتجلى) to His servants in different forms that are recognized and denied, even though He Himself remains upon a Reality (حقيقة) that does not change? The Theophany (التجلي) must be like this. Thus, there is nothing in the world but ambiguity, because the Lawgiver informed us that the believer appears in the form of the disbeliever while being happy, and the disbeliever appears in the form of the believer while being wretched. Therefore, we cannot definitively judge anyone as happy or wretched due to the ambiguity of the matter for us. However, for us, this is not ambiguity. Ambiguity only occurs when we definitively judge the happy one as wretched or the wretched one as happy. If we do not judge definitively, nothing is ambiguous to us.\n\nIn it is the science that the ruling (الحكم) on the Day of Resurrection belongs to Mercy (الرحمة), and that Justice (العدل) is part of Mercy. The Day of Resurrection is the Day of Justice in judgment, but Mercy comes in the Resurrection to witness the affair, so that when the ruling of Justice ends and its term expires for the one judged, Mercy takes over the ruling concerning him eternally.\n\nIn it is the science of what belongs purely to God (مخلص) and what belongs to creation.\n\nIn it is the science of the attribute that is pure to God, in which He is not partnered by one who is not an instrument.\n\nIn it is the science of why the Divine Names (الأسماء الإلهية) are multiplied due to the difference in their meanings. Are they names for the meanings beneath them, or are they names for the One to whom those meanings are attributed? And are those meanings existent matters or non-existent relations?\n\nIn it is the science of equity (الإنصاف) and justice (العدل) in judgments and rulings.\n\nIn it is the science of what suffices of deservingness after the expiration of the term of its ruling, and the meaning of success (الفلاح) in judgments and rulings, and its negation for the one deserving punishment.\n\nIn it is the science of the polytheist's denial of partnership (الشريك): does he have any aspect of truthfulness in that, or is he false in every respect? This is because the speaker in reality is none other than God, so he must have an aspect of truthfulness from that perspective, where it is attributed as the saying of God, even if it appears on the tongue of a creature. For God spoke it upon the tongue of His servant. It is reported from the Messenger, peace and blessings be upon him, in the *Sahih* collection that God speaks upon the tongue of His servant. The Quran spoke of this, so the very speech of the interpreter (الترجمان) is the speech of the one interpreted for.\n\nIn it is the science of what the states (الأحوال) yield in rulings for the one in whom they subsist.\n\nIn it is the science of what results from definitively asserting the occurrence of one of two possibilities without proof.\n\nIn it is the science of what the Gnostic (العارف) who possesses Unveiling is displeased with concerning an Act of The Real (فعل الحق) that others are not displeased with. Displeasure (السخط) is an internal act, such that if he did not feel displeasure internally and yet manifested displeasure, his state would be closer to hypocrisy (النفاق) than to faith.\n\nIn it is the science of whether urging hypocrisy contradicts submission (التسليم), and when a person of submission and a person of compromise (مداراة) meet, which of the two is more knowledgeable?\n\nIn it is the science of the cause preventing the listener, when called, from answering: is it said that he heard, or that he did not hear?\n\nIn it is the science of darkness (الظلمة), which is blindness (العمي), and misguidance (الضلال), which is Bewilderment (الحيرة).\n\nIn it is the science of the universal gathering (عموم الحشر) of everything contained in this world: mineral, plant, animal, human, Jinn, heaven, and earth.\n\nIn it is the science of the cause that calls for the affirmation of the Unity (التوحيد) of The Real, the Exalted, and why partnership is impossible alongside it. Does its ruling have subsistence (البقاء), so that the ruling of Unity remains, or does it not subsist, or does it subsist for some people but not others?\n\nIn it is the science of the universality of faith (عموم الايمان), and that is why the ultimate outcome is Mercy (الرحمة), for God only shows Mercy to the believers, and the ruling of the universality of faith is from Mercy.\n\nIn it is the science of sudden appearance (البوادة) and assault (الهجوم), which has a chapter in the section on states in this book.\n\nIn it is the science of one who forces himself to acquire knowledge (تكلف العلم) but is not a scholar, yet happens upon knowledge: is he called a scholar or not?\n\nIn it is the science of loving for God and hating for God: does the one hated for God have an aspect through which he is loved for God, just as he has an aspect from God through which he is provided for despite the hatred?\n\nIn it is the science of the benefit of detailing the summarized (التفصيل في المجمل).\n\nIn it is the science of man's innate disposition toward haste (العجلة) in things when he is capable of them.\n\nIn it is the science of the Unseen (الغيوب)—what is known of it and what is not—and the causes whose effects are unknown, in the sense that they are effects of these causes, even though the causes and their effects are known, except in the sense that they are causes for them.\n\nIn it is the science of God's knowledge of the personalities (شخصيات) of the world.\n\nIn it is the science of death (الوفاة) and resurrection (البعث) in this world, and the science of the death from which the resurrection in the Hereafter occurs, and the transition to the Isthmus (البرزخ) in the two deaths.\n\nIn it is the science of the ranks of the angelic spirits (الأرواح الملكية) in their worship.\n\nIn it is the science of the universal salvation (عموم نجاة العالم) of the world, polytheist and non-polytheist—a strange science specifically mentioned in the Quran but often unnoticed.\n\nIn it is the science of the cause that compels a capable agent to abandon an action.\n\nIn it is the science that every Name has a Named (مسمى), but the existence of the Named in its concrete entity (عينه) is not necessarily implied. And which level encompasses all known things by existence, whether the known thing is impossible to exist or not.\n\nIn it is the science of the recompense (الجزاء) that acts as an Isthmus (برزخ) and results in another recompense through action.\n\nIn it is the science of apostasy (الردة): what does it return to? Is it merely a forward movement, just as we say the sun returns in the increase and decrease of the day, yet it has no return but is on its path? Is it like abrogation (النسخ) in things, which is the end of the term of one ruling and the beginning of the term of another ruling, while the path is one, and there is no return for the traveler upon it?\n\nIn it is the science of the blowing (النفخ) and the difference in its rulings despite the oneness of its essence.\n\nIn it is the science of direct witnessing (المشاهدة) and the difference between it and speculative knowledge (علم النظر).\n\nIn it is the science of inference (الاستدلال).\n\nIn it is the science that every knowledge has its men (رجال) and every station (مقام) has its saying (مقال), and if it is not spoken, it is the saying of a state.\n\nIn it is the science of one who imitates (تشبه) the one who cannot be imitated—what called him to that?\n\nIn it is the science that repetition (الإعادة) is in the form of the beginning, and if it were not so, it would not be repetition.\n\nIn it is the science of whether a thing can be the locus (محل) of its opposite.\n\nIn it is the science of clarifying ambiguities (إيضاح المبهمات).\n\nIn it is the science of the ruling of night and day, and the attribution of entering (ولوج), covering (غشيان), and coiling (تكوير) to them, and their being new and alternating.\n\nIn it is the science of extracting multiplicity from unity (الكثير من الواحد) and why this is only valid through gradual natural composition (التركيب الطبيعي) that is composed only by the One.\n\nIn it is the science of the meaning of transformations (الاستحالات) in things.\n\nIn it is the science of rulings (الأحكام): is every ruling valid for the one it is directed at, or are some valid and some not? God is the Judge, so how can there be a ruling in Existence that is not valid for the one judged? In this matter there is subtlety, due to the ruling of partnership (الشريك) having appeared in Existence, yet it is a false ruling when attributed to God, for He, the Exalted, has no partner in His dominion.\n\nIn it is the science of the breadth of discourse concerning God (اتساع المقالة في الله) and that it is Divine respite (الإمهال الإلهي), not neglect (إهمال).\n\nIn it is the science of the effect of naming (التسمية) and the effect of abandoning it.\n\nIn it is the science contained in these verses:\n\n> Ignorance is death, but none knows it,\n> Except he whose breaths have been brought to life by Knowledge (العلم).\n> None knows the untying of a knot by which he is bound,\n> Except he whose ropes have been strengthened by twisting.\n> And you have not untied it, but you claim it,\n> And whoever imagines this, his despair (إبلاسه) is confirmed.\n> Whomever Allah leads astray, no guide can make him see,\n> And he is the one whose bankruptcy (إفلاسه) is confirmed in his richness.\n\nAnd in it is the science of what involves multiplication (التضعيف), and <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## باب نمبر تین سو اٹھہتر\n\nبہائم (جانوروں) کی امت کے مقام کی معرفت میں، اور احصار (گھیر لیا جانا)، اور تین علوی اسرار، اور مؤخر کا مقدم ہونا، اور مقدم کا مؤخر ہونا، جو حضرتِ الٰہیہ (الحضرة الإلهية) سے ہے۔\n\n> عارفین (العارفون) اس مسمیٰ کی طرف پرواز کرتے ہیں،\n> معزز فرشتوں کے پروں کے ساتھ۔\n> ذاتِ ذوات کی طرف، بغیر کسی صفت کے،\n> پھر وہ انہیں اسماء کی ارواح کے ساتھ واپس لاتی ہے۔\n> پس ان کی ذات ہر پہلو سے کامل ہو جاتی ہے،\n> حالِ منزہ اور مقام (المقام) سے۔\n> اور ان کے حال کا شاہد ظاہر ہوتا ہے اور فیصلہ کرتا ہے،\n> پس وہ سب امام در امام ہیں۔\n\n### [بہائم بھی امتوں میں سے ایک امت ہیں]\n\nجان لو، اللہ ہماری اور تمہاری مدد کرے، کہ بہائم (البهائم) بھی امتوں میں سے ایک امت ہیں، ان کی اپنی تسبیحات (تسبيحات) ہیں جو ہر جنس کے لیے مخصوص ہیں، اور نماز بھی ہے جیسے دیگر مخلوقات کی ہے۔ ان کی تسبیح وہ ہے جو وہ اپنے خالق کی تنزیہ (تنزيه) سے جانتے ہیں، پس ان کا حصہ ہے: لَيْسَ كَمِثْلِهِ شَيْءٌ (اس جیسی کوئی چیز نہیں)۔ اور جہاں تک ان کی نماز کا تعلق ہے، تو ان کی حق (الحق) کے ساتھ خاص مناجات (مناجاة) ہے۔ اللہ تعالیٰ فرماتا ہے: وَالطَّيْرُ صَافَّاتٍ كُلٌّ قَدْ عَلِمَ صَلَاتَهُ وَتَسْبِيحَهُ (اور پرندے پر پھیلائے ہوئے ہیں، ہر ایک اپنی نماز اور تسبیح جانتا ہے)۔ اور فرمایا: وَأَوْحَىٰ رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ * ثُمَّ كُلِي مِن كُلِّ الثَّمَرَاتِ فَاسْلُكِي سُبُلَ رَبِّكِ ذُلُلًا (اور تمہارے رب نے شہد کی مکھی کی طرف وحی کی کہ پہاڑوں میں، اور درختوں میں، اور ان چھتوں میں جو لوگ بناتے ہیں، گھر بناؤ۔ پھر ہر طرح کے پھلوں سے کھاؤ، پھر اپنے رب کے راستوں پر فرمانبرداری سے چلو)۔ اور یہ وہ راستے ہیں جو اللہ نے ان کے لیے مقرر کیے ہیں کہ وہ ان پر فرمانبرداری سے چلیں۔ پس ہر مخلوق کے لیے ایک خاص کلام ہے جسے اللہ جانتا ہے اور وہ اسے سنتا ہے جس کے لیے اللہ نے اس کے ادراک کے لیے اس کے کان کھول دیے ہوں۔ اور وہ تمام حرکات اور صنعتیں جو حیوان سے ظاہر ہوتی ہیں اور جو صرف عقل، فکر اور غور و خوض رکھنے والے سے ہی ظاہر ہو سکتی ہیں، اور جو اوزان ان میں دیکھے جاتے ہیں، یہ سب اس بات کی دلیل ہیں کہ ان کے اندر ان سب کے عالم موجود ہیں۔ پھر ان سے ایسے امور بھی ظاہر ہوتے ہیں جو اس بات کی دلیل ہیں کہ ان کے پاس وہ عمومی تدبیر نہیں ہے جو انسان کے پاس ہے۔ پس ان کے معاملے میں غور کرنے والوں کے نزدیک امور میں تعارض پیدا ہو گیا، اور ان کا معاملہ ان پر مبہم ہو گیا، اور شاید اسی وجہ سے انہیں بہائم (جانور) کہا گیا، کیونکہ معاملہ مبہم (إبهام) ہے۔ مگر ہمارے نزدیک، یہ ہر واضح چیز سے زیادہ واضح ہے۔ اور جس پر یہ معاملہ مبہم رہا، وہ صرف کشف (الکشف) کی کمی کی وجہ سے ہے۔ پس وہ مخلوقات میں سے صرف اتنا ہی جانتے ہیں جتنا وہ ان کا مشاہدہ کرتے ہیں۔ اور اسی طرح، جس نے انہیں معرفت (المعرفۃ) اور اللہ کے علم کے درجے میں شامل کیا، اور اس میں جو اللہ نے ان کے لیے اہل بنایا، تو اس نے انہیں اس میں شامل نہیں کیا مگر اس وجہ سے کہ اللہ نے اس پر ان کے معاملے اور احوال کا کشف (الکشف) کر دیا۔ یا وہ سچا مومن ہے جسے اللہ کی طرف سے کتاب یا سنت میں ان کے معاملے کی خبر پہنچی ہے۔\n\nاور اس قول پر ہمارے شیخ اور ہمارے متقدم امام، محققین پر اللہ کی حجت، نے ہماری تائید کی ہے، جن کے بارے میں قوت القلوب کے مصنف ابو طالب مکی کہتے ہیں کہ جب وہ ان سے کوئی قول نقل کرتے ہیں تو کہتے ہیں: \"ہمارے عالم سہل بن عبداللہ تستری، جنہوں نے بچپن میں اپنے دل کو سجدہ کرتے ہوئے دیکھا اور وہ سجدے سے نہ اٹھا، اور چھ سال کی عمر میں قرآن حفظ کر لیا۔\" اور جب میں نے ان کے ذکر کے ساتھ خلوت (خلوة) میں داخل ہوا، تو اسی رات اس ذکر کے خاص فتح (فتح) کے ذریعے مجھ پر کشادگی ہوئی، اور اس کے نور سے مجھ پر وہ سب منکشف ہو گیا جو میرے لیے غیب تھا۔ پھر وہ نورِ مکاشف (مکاشفہ کرنے والا نور) غروب ہو گیا، تو میں نے کہا: یہ میرے خلیل کا مشہد ہے۔ پس میں نے جان لیا کہ میں اسی لمحے سے اس ملت کا وارث ہوں جس کی پیروی کا اللہ نے اپنے رسول کو حکم دیا اور ہمیں بھی حکم دیا، اور وہ یہ قول ہے: مِلَّةَ أَبِيكُمْ إِبْرَاهِيمَ هُوَ سَمَّاكُمُ الْمُسْلِمِينَ مِنْ قَبْلُ (تمہارے باپ ابراہیم کا دین، اسی نے تمہیں اس سے پہلے مسلمان نام دیا)۔ اور میں نے ان کی ابوت اور اپنی بنوت کو متحقق کر لیا۔ اور ہمارے شیخ صالح بربری اشبیلیہ میں مجھ سے کہہ چکے تھے: \"اے میرے بیٹے! خبردار، شہد کے بعد سرکہ نہ چکھنا۔\" پس میں ان کی مراد جان گیا۔ اور وہ ان سب سے بڑے لوگوں میں سے تھے جنہیں میں نے اللہ کی طرف منقطع ہوتے ہوئے دیکھا، بلکہ منقطع کرنے والوں میں سے۔ میں نے ان کے قدم پر ان جیسا کوئی نہیں دیکھا۔ پس میں صبح سویرے شیخ کے پاس آیا اور انہیں وہ منظوم کلام سنایا جو میں نے کسی غور و فکر یا کوشش کے بغیر نظم کیا تھا، جیسا کہ ابو العباس ابن العریف الصنہاجی نے کہا ہے:\n\n> اور ایک ایسی حدیث آئی جس کا سننا نہیں تھکاتا،\n> اس کا نثر اور اس کا نظم ہمارے لیے لذیذ ہے۔\n\nاور وہ نظم جو میں نے اپنے حال میں کہا تھا:\n\n> وہ شہد کے بعد سرکہ کی مانند تھا،\n> پس چراغ مجھ سے چلا گیا اور غروب ہو گیا۔\n> اور ایک تاریک رات کی ظلمت ظاہر ہوئی،\n> جس نے دل میں بیماریوں کے اسباب پیدا کر دیے۔\n> میں نے کہا: میرے رب! اس نے فرمایا: میں حاضر ہوں،\n> تم کیا چاہتے ہو؟ میں نے کہا: عمل کے ساتھ نور۔\n> اس حق کا علم جو میں نے کہا ہے؟\n> فرمایا: بند دروازہ۔ میں نے کہا: ہاں۔\n> میں نے کہا: مجھے اپنا خالص نور عطا فرما،\n> پس نور بغیر کسی مثال کے ظاہر ہوا۔\n> میرے آسمان میں، پھر میری زمین میں،\n> پھر ان دونوں کے درمیان، بغیر کسی انتہا کے۔\n> اور جو میری بات کو سمجھتا ہے، وہ جان گیا\n> کہ میں ہی وہ امر ہوں جس سے وہ نازل ہوا۔\n\nشیخ اس نفس (کلام) سے بہت خوش ہوئے اور فرمایا: \"یہ تجلیِ غلس (التجلی الغلس) سے ہے\" (یعنی صبح کے ظہور سے)۔ میں نے ان سے کہا: \"آپ نے سچ کہا، ایسا ہی تھا۔\" انہوں نے فرمایا: \"الحمد للہ، ہر حال میں انعام کرنے والا۔ اگر لوگ احوال میں جاری نعمت کو جان لیتے، تو وہ خوشحالی اور تنگی میں فرق نہ کرتے اور حمد متحد ہو جاتی۔\" میں نے ان سے کہا: \"بلکہ وہ متوحد ہو جاتی۔\" انہوں نے فرمایا: \"تم نے سچ کہا، میرے بیٹے، اور شیخ سے غلطی ہوئی\" (یعنی شیخ نے اپنی غلطی کا اعتراف کیا)۔ پس میں نے ان کا ہاتھ چوما اور انہوں نے میرا سر چوما۔\n\n> جب سچا داعی تمہارے پاس واضح طور پر آئے،\n> تو اگر تم مومن ہو تو اس کی طرف کان لگاؤ۔\n> اور میں نے کہا: اے اللہ کے رسول، آپ ہی میرے لیے میری سعادت کا ذریعہ ہیں،\n> میں یہ بات پوشیدہ اور اعلانیہ کہتا ہوں۔\n> اور میں اس پر اپنے ایمان میں متردد نہیں ہوں،\n> کیونکہ میں نے اس امر کو واضح علم کے ساتھ جان لیا ہے۔\n> اس کشف کے ذریعے جو میرے معبود کی طرف سے مجھے ایک ایسے مشہد میں ملا\n> جو قیامت کے دن ہمارا ٹھکانہ ہو گا۔\n> فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَدَعْ (پس جو چاہے ایمان لائے اور جو چاہے چھوڑ دے)،\n> کیونکہ وہاں اللہ کے سوا کچھ نہیں، پس علم ہمارا علم ہے۔\n> جب میں دل کی گہرائیوں سے 'یا اللہ' کہتا ہوں،\n> تو اگر میں پوچھوں 'یہ کون ہے؟' تو وہ کہتا ہے: 'میں، میں ہوں۔'\n> میں ہی ہر حال میں عطا کرنے والا، احسان کرنے والا ہوں،\n> اور یہ ایسی صفت ہے جو ہمارے سوا کسی اور کے لیے نہیں ہو سکتی۔\n> اور وہاں کوئی غیر نہیں، بلکہ میں وہی کہتا ہوں جو ہمارے رسول لائے ہیں،\n> پس قول ہم سے، ہمارے ذریعے، ہمارے لیے ہے۔\n> اور میرا رسول میری صفت کے سوا کچھ نہیں، اور نہ ہی وہ جس سے میں مخاطب ہوتا ہوں، وہ میرے سوا کوئی اور ہے،\n> پس تمہاری عین (ذات) ہماری عین ہے۔\n\nپس دنیا میں ہر وہ چیز جسے اہل نظر اور عام لوگ کہتے ہیں کہ وہ نہ زندہ ہے اور نہ حیوان، تو ہمارے نزدیک اللہ نے اسے جب پیدا کیا تو اپنی معرفت (المعرفۃ) اور علم پر فطرت (فطرة) دی، اور وہ زندہ ہے، اپنے رب کی تسبیح کے ساتھ ناطق ہے، جسے مومن اپنے ایمان سے ادراک کرتا ہے، اور اہل کشف (الکشف) اسے عین الیقین سے ادراک کرتے ہیں۔ اور جہاں تک حیوان کا تعلق ہے، تو اللہ نے اسے اپنی معرفت پر فطرت دی، اور اس کی تسبیح کے ساتھ اسے ناطق بنایا، اور اس کے لیے ایک شہوت (شہوة) مقرر کی جو ان مخلوقات کے لیے نہیں تھی جن کا ذکر ابھی ہوا ہے۔ اور فرشتوں کو معرفت اور ارادہ (الإرادة) پر فطرت دی، نہ کہ شہوت پر، اور انہیں حکم دیا اور خبر دی کہ وہ اس ارادے کی وجہ سے جو ان کے لیے پیدا کیا گیا ہے، اس کی نافرمانی نہیں کرتے۔ اور اگر ارادہ نہ ہوتا تو اللہ ان کی تعریف نہ کرتا کہ وہ اس کی نافرمانی نہیں کرتے اور يَفْعَلُونَ مَا يُؤْمَرُونَ (جو انہیں حکم دیا جاتا ہے وہ کرتے ہیں)۔ اور جن اور انسان کو معرفت اور شہوت پر فطرت دی، اور یہ ارادے میں ایک خاص تعلق ہے، کیونکہ شہوت ایک طبعی ارادہ (إرادة طبيعية) ہے۔ پس جن اور انسان کے لیے ارادہ الٰہیہ (إرادة إلهية) نہیں ہے جیسا کہ فرشتوں کے لیے ہے، بلکہ طبعی ارادہ ہے جسے شہوت کہا جاتا ہے۔ اور ان دونوں کو عقل (العقل) پر فطرت دی، نہ کہ علم حاصل کرنے کے لیے، بلکہ اللہ نے اسے انسان اور جن کے لیے ایک آلہ بنایا تاکہ وہ اس دنیا میں شہوت کو روک سکیں۔ اور اسی لیے آخرت میں اہل جنت کے لیے فرمایا: وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنْفُسُكُمْ (اور تمہارے لیے اس میں وہ سب کچھ ہے جو تمہارے دل چاہیں گے)، یہ ہمارے لیے علامت ہے کہ آخرت کی نشأت جس میں وہ ہمیں پیدا کرے گا، وہ دنیا کی نشأت کی طرح طبعی ہو گی، کیونکہ شہوت صرف طبعی نفوس میں ہوتی ہے، اور طبعی نفوس کا ارادے میں کوئی حصہ نہیں ہوتا۔ پس اگر انسان یا جن کشف کے بغیر کوئی علم حاصل کرتا ہے، تو یہ اس قوتِ فکر (الفكر) سے ہے جو اللہ نے اس میں رکھی ہے۔ پس جو کچھ بھی فکر ناطق نفس کو دیتی ہے اور وہ فی نفسہ علم ہوتا ہے، تو وہ موافقت کے ساتھ فکر سے ہوتا ہے۔ پس انسان میں جو علوم ہیں وہ فطرت، ضرورت، الہام (الإلهام) اور کشف (الکشف) سے ہیں، اور جو کشف اسے ہوتا ہے وہ صرف اس علم کے بارے میں ہوتا ہے جس پر اللہ نے اسے فطرت دی ہے، پس وہ اپنے معلوم کو دیکھتا ہے۔ اور جہاں تک فکر کا تعلق ہے، تو اس کے ذریعے علم تک پہنچنا محال ہے۔ اگر کہا جائے کہ تم نے یہ کہاں سے جانا، حالانکہ یہ حسی ادراکات میں سے نہیں ہے، تو پھر صرف نظر (غور و فکر) ہی باقی بچتا ہے؟ ہم کہیں گے: ایسا نہیں ہے جیسا تم کہتے ہو، بلکہ الہام اور اعلامِ الٰہی (الإعلام الإلهي) باقی ہے۔ پس ناطق نفس اسے اپنے رب سے کشف اور ذوق (ذوق) کے ذریعے حاصل کرتا ہے، اس خاص پہلو سے جو اس کے لیے اور اللہ کے سوا ہر موجود کے لیے ہے۔ پس صحیح فکر امکان (الإمكان) سے زیادہ کچھ نہیں دیتی، اور صرف وہی دیتی ہے۔ اور یہ اللہ کے علم اور اس کے اعلام میں سے ہے، اسے فکر کے ذریعے ادراک نہیں کیا گیا۔ ابن عطاء ایک اونٹ پر سوار تھے، تو اونٹ کا پاؤں دھنس گیا، تو ابن عطاء نے کہا: \"جل اللہ\" (اللہ کی شان بلند ہے)۔ تو اونٹ نے کہا: \"جل اللہ، تمہاری تعظیم سے زیادہ\"۔ پس اونٹ ابن عطاء سے زیادہ اللہ کا عالم تھا۔ تو ابن عطاء شرمندہ ہوئے۔ پس یہ بہائم کا اللہ کے بارے میں علم ہے۔ اور جہاں تک رسول اللہ صلی اللہ علیہ وسلم کا تعلق ہے، تو صحیح حدیث میں ذکر ہے کہ بنی اسرائیل کے زمانے میں ایک گائے تھی جس پر اس کے مالک نے بوجھ لادا، تو اس نے کہا: \"میں اس کے لیے پیدا نہیں کی گئی، بلکہ میں تو ہل چلانے کے لیے پیدا کی گئی ہوں۔\" تو صحابہ نے کہا: \"کیا گائے بات کرتی ہے؟\" تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"میں اس پر ایمان لاتا ہوں، اور ابوبکر اور عمر بھی۔\" اور یہ اس لیے کہ روح الامین (جبرائیل) نے انہیں خبر دی تھی۔ اگر رسول اللہ صلی اللہ علیہ وسلم نے اسے خود دیکھا ہوتا تو وہ یہ نہ کہتے کہ \"میں ایمان لاتا ہوں۔\" پس یہ حیوانات کی ایک قسم کی گائے ہے جو جانتی تھی کہ وہ کس لیے پیدا کی گئی ہے، جبکہ انسان اور جن اللہ کی عبادت کے لیے پیدا کیے گئے، اور انہوں نے یہ صرف رسول کی زبان سے اللہ کی تعریف کے ذریعے جانا، حالانکہ یہ ان کی فطرت میں ہے، لیکن ان پر اس چیز کا کشف نہیں کیا گیا جس پر وہ ہیں۔ اور بعض اہل اللہ ایک شخص کے پاس سے گزرے جو گدھے پر سوار تھا اور گدھے کے سر پر مار رہا تھا تاکہ وہ تیز چلے۔ تو اس شخص نے اس سے کہا: \"تم گدھے کے سر پر کیوں مارتے ہو؟\" تو گدھے نے اس سے کہا: \"اسے چھوڑ دو، یہ اپنے سر پر مار رہا ہے۔\" پس یہ گدھا فطرت (فطرة) سے جانتا تھا کہ معاملات کا انجام کیا ہو گا، نہ کہ فکر (فكرة) سے۔ پس اے محجوب! دیکھو کہ بہائم کے مقام کے مقابلے میں تمہارا مقام کہاں ہے؟ بہائم تمہیں جانتی ہیں، اور جانتی ہیں کہ تمہارا انجام کیا ہو گا، اور جانتی ہیں کہ وہ کس لیے پیدا کی گئی ہیں، اور تم ان سب سے جاہل ہو۔ اس سب کے باوجود، بہائم اللہ کے بارے میں حیرت (الحيرة) میں ہیں، اور وہ اس پر مفطور ہیں، جو انہیں اس مقام پر قائم کرتا ہے جہاں اللہ کے بارے میں صحیح نظر رکھنے والے اور اہل تجلی (التجلی) پہنچتے ہیں۔ اور اسی لیے اللہ نے ان لوگوں کے بارے میں فرمایا جو اللہ کو نہیں جانتے: إِنْ هُمْ إِلَّا كَالْأَنْعَامِ (وہ نہیں ہیں مگر چوپایوں کی طرح)، یعنی اس گمراہی میں جو حیرت ہے۔ پھر فرمایا: بَلْ هُمْ أَضَلُّ سَبِيلًا (بلکہ وہ راستے میں زیادہ گمراہ ہیں)۔ اور سبیل (راستہ) ہے۔ پس اس نے گمراہی میں اضافہ کیا، یعنی اس راستے میں حیرت جس کی وہ اپنے رب کی معرفت تک پہنچنے کے لیے اپنی فکروں کے ذریعے تلاش کرتے ہیں۔ پس یہ حیرت، اللہ کے بارے میں حیرت سے زیادہ ہے۔ اور اسی طرح ان کے بارے میں فرمایا جہاں بھی فرمایا، اس نے سبیل میں اضافہ کیا، اور یہ صرف فکر اور اس چیز میں تفکر ہے جس میں تفکر سے منع کیا گیا ہے، یعنی اللہ کی ذات میں نظر کرنا۔ پس فرمایا: وَمَنْ كَانَ فِي هَذِهِ أَعْمَىٰ (اور جو اس دنیا میں اندھا رہا)، اور یہ اللہ کی جہالت کی حالت ہے جیسا کہ وہ فی نفسہ ذات کے لحاظ سے ہے، فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ (تو وہ آخرت میں بھی اندھا ہو گا) جیسا کہ وہ دنیا میں ہے۔ پھر مزید فرمایا: وَأَضَلُّ سَبِيلًا (اور راستے سے زیادہ بھٹکا ہوا ہو گا)۔ اور سبیل (راستہ) ہے۔ اور اسی لیے عمرو بن عثمان مکی نے معرفت اور عارفین کی صفت میں کہا: \"جیسے وہ آج ہیں، ویسے ہی وہ کل ہوں گے۔\" پس جان لو، اگر تم اللہ کے اہل ضلال کو چوپایوں سے تشبیہ دینے کو سمجھتے ہو، تو اللہ نے انہیں چوپایوں سے تشبیہ چوپایوں کی کمی کی وجہ سے نہیں دی، بلکہ تشبیہ حیرت میں واقع ہوئی ہے، نہ کہ اس چیز میں جس میں وہ حیران ہیں۔ پس اللہ کے عالموں میں اللہ کے بارے میں سب سے زیادہ حیرت (حيرة) ہوتی ہے۔ اور اسی لیے رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے کہ انہوں نے اپنے رب سے کہا: \"زدني فيك تحيرا\" (مجھے تجھ میں حیرت میں اور زیادہ کر دے)۔ جب انہوں نے اختلافِ صور کی وجہ سے اہل تجلی کے لیے حیرت کے مقام کی بلندی کو جان لیا۔ اور اس حدیث کی تصدیق ان کا یہ قول کرتا ہے: \"لا أحصي ثناء عليك أنت كما ثنيت على نفسك\" (میں تیری تعریف کا احاطہ نہیں کر سکتا، تو ویسا ہی ہے جیسا تو نے خود اپنی تعریف کی ہے)۔ اور ہم جانتے ہیں کہ اللہ نے خود اپنی تعریف میں کیا فرمایا ہے، جیسے اپنے دونوں ہاتھوں کو خرچ کرنے کے لیے پھیلانا، اور اپنے بندے کی توبہ پر خوش ہونا، اور اس طرح کی دیگر مثالیں، اور لَيْسَ كَمِثْلِهِ شَيْءٌ (اس جیسی کوئی چیز نہیں)، اور وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ (اور انہوں نے اللہ کی قدر نہیں کی جیسا کہ اس کی قدر کرنے کا حق تھا)۔ اور رسول اللہ صلی اللہ علیہ وسلم کا یہ قول: \"لو يعلم البهائم من الموت ما تعلمون ما أكلتم منها سمينا\" (اگر بہائم موت کے بارے میں وہ جانتے جو تم جانتے ہو، تو تم ان میں سے موٹا گوشت نہ کھاتے)۔ پس آپ صلی اللہ علیہ وسلم کے اس تنبیہ پر غور کرو کہ ان کی استعداد کتنی اچھی ہے اور ہماری استعداد کتنی برابر ہے، یہاں تک کہ جو شخص موت کے بارے میں اس مقام پر ہے، اس کی انتہا یہ ہے کہ وہ بہائم کی استعداد حاصل کر لے، اور یہ اس شخص کی تعریف ہے جو اس مقام پر پہنچا، اور اس کے حق میں بلندی ہے۔ اور بہائم کو حقیر سمجھے بغیر انسان سے کم کیسے دیکھا جا سکتا ہے، جبکہ اللہ کی طرف سے تمہاری تعریف کی انتہا یہ ہے کہ تم ان کی صفت میں ان کے شریک ہو جاؤ۔ پس اپنے دل کو تیز کرو اور قُلْ رَبِّ زِدْنِي عِلْمًا (کہو: اے میرے رب! میرے علم میں اضافہ فرما)، کیونکہ اللہ کی مخلوق میں اسرار ہیں، اور اسی لیے خَلَقَكُمْ أَطْوَارًا (اس نے تمہیں مختلف مراحل میں پیدا کیا)۔\n\n### [بہائم اللہ کی طرف سے انسان کے لیے مسخر اور تابع ہیں]\n\nاور جان لو کہ اگرچہ بہائم اللہ کی طرف سے انسان کے لیے مسخر (مسخرة) اور تابع (مذللة) ہیں، لیکن تم اس بات سے غافل نہ ہو کہ تم بھی ان کے لیے مسخر ہو، اس لحاظ سے کہ تم ان کے مفادات کی دیکھ بھال کرتے ہو، انہیں پانی پلاتے ہو، چارہ دیتے ہو، اور ان کے لیے ان کی جگہوں کو صاف کرتے ہو، اور ان کی خاطر گندگی اور کوڑے کرکٹ کو ہاتھ لگاتے ہو، اور انہیں گرمی اور سردی کی تکلیف دہ چیزوں سے بچاتے ہو۔ یہ اور اس جیسی چیزیں اس بات کی دلیل ہیں کہ حق (الحق) نے تمہیں ان کے لیے مسخر کیا ہے، اور تمہارے نفس میں ان کی ضرورت پیدا کی ہے۔ کیونکہ وہی ہیں جو تمہارا بوجھ اس شہر تک لے جاتی ہیں جہاں تم اپنی ذات کے نصف کے بغیر نہیں پہنچ سکتے تھے، اور وہ ہے شق الانفس (جان کو مشقت میں ڈالنا)، یعنی تم وہاں تک صرف وہم اور تخیل سے پہنچ سکتے تھے، نہ کہ حس سے، مگر ان سواریوں کے واسطے سے۔ پس تمہاری ان پر تسخیر (تسخير) کی وجہ سے کوئی فضیلت نہیں ہے، کیونکہ اللہ نے تمہیں ان کا زیادہ محتاج بنایا ہے جتنا انہیں تمہارا محتاج بنایا ہے۔\n\nکیا تم رسول اللہ صلی اللہ علیہ وسلم کے غصے کو نہیں دیکھتے جب ان سے گمشدہ اونٹنی کے بارے میں پوچھا گیا، تو آپ نے کیا فرمایا: \"تمہیں اس سے کیا لینا دینا؟ اس کے پاس اس کا جوتا (کھر) اور اس کا پانی (پینے کی جگہ کا علم) ہے، وہ پانی پر جاتی ہے اور درخت کھاتی ہے یہاں تک کہ اس کا مالک اسے پا لے۔\" پس اللہ نے اس کی تمہاری طرف کوئی حاجت نہیں رکھی، جبکہ تم میں اس کی حاجت رکھی۔ اور تمام بہائم تم سے بھاگتی ہیں جن کے پاس بھاگنے کا آلہ ہے، اور یہ صرف اس لیے ہے کہ وہ تم سے بے نیاز ہیں، اور اس علم کی وجہ سے جس پر وہ جبلت دی گئی ہیں کہ تم ان کے لیے نقصان دہ ہو۔ پھر تمہارا انہیں تلاش کرنا اور ان میں سے کسی چیز کو حاصل کرنے کے لیے اپنی کوشش صرف کرنا تمہاری ان کی طرف احتیاج (افتقار) کی دلیل ہے۔ پس اللہ کی قسم! جو شخص بہائم سے زیادہ بے نیاز ہو، وہ اپنے دل میں کیسے یہ خیال کر سکتا ہے کہ وہ ان سے افضل ہے؟ سچ کہا کہنے والے نے: \"وہ شخص ہلاک نہیں ہوا جس نے اپنی قدر پہچانی۔\" پس اللہ کی قسم! امور کو وہی جانتا ہے جس نے انہیں ذوق (ذوق) سے مشاہدہ کیا اور کشف (الکشف) سے دیکھا۔\n\n> شوق کو وہی جانتا ہے جو اس کی مشقت اٹھاتا ہے،\n> اور عشق کو وہی جانتا ہے جو اس کا سامنا کرتا ہے۔\n\nکیا تمہارے پاس ہاتھی کی خبر نہیں پہنچی اور اس کا قید ہونا اور بیت اللہ کی تباہی کے لیے آگے بڑھنے سے انکار کرنا؟ کیا تمہیں وہ خبر نہیں پہنچی جو پرندوں نے اصحاب الفیل کے ساتھ کیا، اور انہیں ان پتھروں سے مارا جن میں قتل کی خاصیت تھی، نہ کہ دوسرے پتھروں میں؟ کیا تم سمجھتے ہو کہ یہ سب ان کی طرف کسی الٰہی وحی کے بغیر ہوا؟ دنیا میں کتنے ہی ہاتھی تھے اور کتنے ہی حملہ آور تھے، لیکن یہ معاملہ صرف ان لوگوں میں ظاہر ہوا اور دوسروں میں ظاہر نہیں ہوا۔ اور کیا اللہ اس کی طرف وحی کرتا ہے جو اس کی بات کو نہ سمجھے؟ اور کیا اللہ تعالیٰ نے نہیں فرمایا: وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ (اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان میں تاکہ وہ ان کے لیے واضح کرے)؟ کیا یہ اس لیے نہیں کہ وہ سمجھیں تاکہ اگر وہ مخالفت کریں تو ان پر حجت قائم ہو جائے، یا جو کچھ وہ سمجھے ہیں اس پر عمل کریں تو کامیاب ہو جائیں؟ کیا تم نے پہلی اور دوسری نبوت میں کبھی سنا ہے کہ کسی حیوان یا غیر حیوان نے اللہ کے حکم کی نافرمانی کی ہو یا اللہ کی وحی کو قبول نہ کیا ہو؟ تم کہاں ہو اس پتھر کے بھاگنے سے جو موسیٰ علیہ السلام کا کپڑا لے کر بھاگا یہاں تک کہ ان کی قوم کے سامنے ان کی شرمگاہ ظاہر ہو گئی تاکہ وہ جان لیں کہ وہ ان کی طرف منسوب کی گئی باتوں میں جھوٹے تھے، فَبَرَّأَهُ اللَّهُ مِمَّا قَالُوا (پس اللہ نے انہیں اس سے بری کر دیا جو انہوں نے کہا تھا)۔ کیا تم سمجھتے ہو کہ پتھر کا بھاگنا اللہ کے حکم کے بغیر تھا؟ کیا تم سمجھتے ہو کہ آسمانوں، زمین اور پہاڑوں کا امانت اٹھانے سے انکار کرنا اور اس سے ڈرنا امانت کی قدر اور اس کے انجام کے علم کے بغیر تھا جو اسے اٹھائے اور اللہ کا حق اس میں محفوظ نہ رکھے؟ اور ان کا عرض (پیشکش) اور امر (حکم) کے درمیان فرق کا علم۔ پس جب یہ عرضِ تخییر (اختیار کی پیشکش) تھی تو انہوں نے اپنے لیے احتیاط کی اور سلامتی طلب کی، اور جب حق تعالیٰ نے انہیں آنے کا حکم دیا تو آسمان اور زمین سے فرمایا: ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ (تم دونوں خوشی سے آؤ یا ناخوشی سے۔ انہوں نے کہا: ہم خوشی سے حاضر ہیں)، یہ اللہ کے حکم کی اطاعت تھی اور اس ڈر سے کہ انہیں ناخوشی سے نہ لایا جائے۔ کیا تم سمجھتے ہو کہ اگر قرآن کسی پہاڑ پر نازل ہوتا اور وہ اللہ کے خوف سے جھک جاتا اور پھٹ جاتا، تو کیا یہ اس علم کے بغیر ہوتا کہ اللہ نے اس پر کیا نازل کیا ہے اور اس میں کیا خوفناک باتیں ہیں جن سے بلند و بالا پہاڑ بھی پگھل جاتے ہیں؟ اللہ اور اس کے رسول نے ہمارے لیے کتنا واضح کر دیا ہے کہ مخلوقات اللہ کے علم، اس کی اطاعت اور اس کے حق کو قائم رکھنے پر ہیں، اور ہم نہ ایمان لاتے ہیں اور نہ سنتے ہیں، اور ہم اس چیز کو لیتے ہیں جو امر نہیں ہے تاکہ ہم مومن بنیں، حالانکہ حقیقت میں ہم جھٹلانے والوں میں سے ہیں، اور ہم نے اپنے حس کو اس ایمان پر ترجیح دی جس سے ہم نے اپنے رب کو پہچانا، کیونکہ ہم نے اس کا مشاہدہ عین الیقین سے نہیں کیا۔\n\n### [تمام موجودات میں سے کوئی نہیں مگر وہ جو زندہ ناطق ہے]\n\nاور جان لو کہ جس نے یہ جان لیا کہ تمام موجودات میں سے کوئی نہیں مگر وہ جو زندہ ناطق (حي ناطق) ہے یا حیوان ناطق (حيوان ناطق) ہے، جسے جماد، نبات یا میت کہا جاتا ہے، کیونکہ کوئی بھی چیز جو قائم بالذات ہو یا قائم بغیر الذات ہو، وہ اپنے رب کی حمد کے ساتھ تسبیح نہیں کرتی مگر وہ جو زندہ ہونے کی صفت سے موصوف ہو۔ اور جس کا مشہد موجودات میں یہ ہو، وہ اپنی خلوت (خلوة) میں بھی پوری طرح شرم محسوس کرتا ہے جسے عام لوگ جلوت (جلوة) کہتے ہیں، جیسا کہ وہ اپنی جلوت میں شرم محسوس کرتا ہے، کیونکہ وہ ہمیشہ جلوت میں ہے، اس لیے کہ وہ اس جگہ سے خالی نہیں ہوتا جو اسے اٹھاتی ہے اور اس آسمان سے جو اسے سایہ دیتا ہے۔ اور اگر وہ کسی جگہ میں نہ بھی ہوتا، تو وہ اپنے اعضاء اور اپنے بدن کی رعایا سے شرم محسوس کرتا، کیونکہ وہ جو کچھ بھی کرتا ہے انہی کے ذریعے کرتا ہے، کیونکہ وہ اس کے آلات ہیں، اور انہیں گواہی کے لیے بلایا جائے گا، پس وہ گواہی دیں گے، اور اللہ صرف عادل کو ہی گواہی کے لیے بلاتا ہے۔ پس اس حال والا شخص کبھی بھی خلوت میں نہیں ہو سکتا۔ اور جس کا یہ حال ہو، وہ بہائم کے درجے کو پہنچ گیا ہے۔ اور اس کی دلیل یہ ہے:\n\nرسول اللہ صلی اللہ علیہ وسلم سے صحیح حدیث میں مروی ہے کہ آپ نے فرمایا: \"میت کی ایک آواز ہوتی ہے، یا ان میں سے سعید کہتا ہے: مجھے آگے بڑھاؤ، مجھے آگے بڑھاؤ\" (یعنی اس کی قبر کی طرف)، \"اور ان میں سے شقی کہتا ہے: تم مجھے کہاں لے جا رہے ہو؟\" اور آپ صلی اللہ علیہ وسلم نے خبر دی کہ ہر چیز اسے سنتی ہے سوائے انسان اور جن کے۔\n\nپس آپ کے قول \"ہر چیز\" کے تحت وہ سب کچھ داخل ہو گیا جس کے پاس سے وہ میت گزرتا ہے، خواہ وہ جماد ہو، نبات ہو، حیوان ہو، اور یہ ثابت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ایک خچر پر سوار تھے، تو ایک پرانی قبر کے پاس سے گزرے، تو خچر بدک گیا، تو آپ نے فرمایا: \"اس نے اس قبر والے کو قبر میں عذاب ہوتے دیکھا، اسی لیے یہ بدک گیا۔\"\n\nاور آپ کی اونٹنی نے ہجرت کے وقت جب مدینہ میں داخل ہوئے تو اس کی لگام چھوڑ دی، تو بعض صحابہ نے اسے پکڑنا چاہا، تو آپ نے فرمایا: \"اسے چھوڑ دو، کیونکہ اسے حکم دیا گیا ہے، اور حکم صرف اسے دیا جاتا ہے جو حکم کو سمجھے،\" یہاں تک کہ وہ خود بخود ابو ایوب انصاری کے گھر کے صحن میں بیٹھ گئی، تو آپ نے ان کے ہاں قیام فرمایا۔\n\nاور صحیح حدیث میں فرمایا کہ مؤذن کے لیے اس کی آواز کی حد تک تر اور خشک چیزیں گواہی دیتی ہیں۔\n\nاور یہ سب کچھ ہر چیز سے مختلف ہے، اور انسان اور جن میں سے صرف چند افراد ہی اس کا مشاہدہ کرتے ہیں۔ کیونکہ جن انسانوں کے ساتھ حد میں شریک ہیں، کیونکہ جن حیوان ناطق ہیں، مگر انہیں یہ نام اس لیے دیا گیا کہ وہ عام طور پر انسانوں کی نظروں سے پوشیدہ رہتے ہیں۔ پس وہ انسانوں کے ساتھ ایسے ہیں جیسے انسان کا ظاہر اس کے باطن کے ساتھ ہے۔ اور اسی لیے اللہ تعالیٰ نے ان دونوں قسموں کے علاوہ کے بارے میں فرمایا: وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ وَلَا طَائِرٍ يَطِيرُ بِجَنَاحَيْهِ إِلَّا أُمَمٌ أَمْثَالُكُمْ (اور زمین میں کوئی چلنے والا نہیں اور نہ کوئی پرندہ جو اپنے پروں سے اڑتا ہے مگر وہ تمہاری طرح امتیں ہیں)۔ اور امثال (تمہاری طرح) وہ ہیں جو نفس کی صفات میں شریک ہوں، پس وہ سب حیوان ناطق ہیں۔ پھر اللہ تعالیٰ نے ان کے بارے میں فرمایا: ثُمَّ إِلَىٰ رَبِّهِمْ يُحْشَرُونَ (پھر وہ اپنے رب کی طرف جمع کیے جائیں گے)، یعنی جیسے تم جمع کیے جاتے ہو۔ اور یہ اللہ کا یہ قول ہے: وَإِذَا الْوُحُوشُ حُشِرَتْ (اور جب وحشی جانور جمع کیے جائیں گے)، یہ فیصلے اور قضاء کے دن گواہی کے لیے ہو گا تاکہ اللہ ان کے درمیان فیصلہ کرے جیسا کہ ہمارے درمیان فیصلہ کرتا ہے، پس وہ بے سینگ والی کو سینگ والی سے بدلہ دلائے گا، جیسا کہ حدیث میں آیا ہے۔ اور یہ اس بات کی دلیل ہے کہ وہ اللہ کی طرف سے مخاطب اور مکلف ہیں، اس طرح جسے ہم نہیں جانتے۔ اللہ تعالیٰ فرماتا ہے: وَإِنْ مِنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ (اور کوئی امت نہیں مگر اس میں کوئی ڈرانے والا گزرا ہے)۔ پس اس نے امت اور نذیر کو نکرہ (عام) رکھا، اور وہ امتوں میں سے ہیں۔ اور ان کا نذیر ان میں سے ہر ایک کے لیے اس کی ذات میں ہو سکتا ہے، اور نوع کے لیے اس کی جنس میں سے بھی ہو سکتا ہے۔ یہ ضروری ہے، اس طرح جسے صرف وہی جانتا اور مشاہدہ کرتا ہے جسے اللہ اس کا مشاہدہ کرائے، جیسا کہ شیطان کے بارے میں فرمایا: إِنَّهُ يَرَاكُمْ هُوَ وَقَبِيلُهُ مِنْ حَيْثُ لَا تَرَوْنَهُمْ (وہ اور اس کا قبیلہ تمہیں وہاں سے دیکھتے ہیں جہاں سے تم انہیں نہیں دیکھتے)۔ اور ذکر کیا کہ وہ اپنے اولیاء کی طرف وحی کرتے ہیں تاکہ وہ ہم سے جھگڑا کریں، اور جھگڑا کرنے والا جو شیطان کا ولی ہے، یہ گمان کرتا ہے کہ یہ اس کے نفس سے ہے اور اس کی نظر اور علم سے ہے، حالانکہ یہ شیطان کی طرف سے اس کی طرف وحی ہے۔ اہل کشف اسے عین الیقین سے جانتے ہیں اور اسے اپنے کانوں سے سنتے ہیں، جیسا کہ وہ ہر آواز کو سنتے ہیں۔ اور کوئی حیوان نہیں مگر وہ اس کا مشاہدہ کرتا ہے، اور اسی لیے اللہ نے انہیں خاموش کر دیا ہے کہ وہ جو کچھ مشاہدہ کرتے ہیں وہ ہم تک نہ پہنچائیں، پس وہ ہمارے حق میں حال کی صورت میں امین ہیں۔ اور اللہ انسانی نوع میں سے کسی پر بھی وہ کشف نہیں کرتا جو وہ بہائم پر کرتا ہے، مگر جب اللہ اسے امانت (الأمانة) عطا کرے، اور وہ یہ ہے کہ وہ اس چیز کو جو وہ دیکھتا ہے، دوسروں سے چھپائے، مگر یہ کہ اللہ کی طرف سے تعریف کے ساتھ وحی ہو۔ کیونکہ اللہ نے اکثر انسانوں کی آنکھوں اور ان کے کانوں کو، اور ہواؤں کے چلنے کی آوازوں اور پانی کے بہنے کی آوازوں اور ہر آواز دینے والی چیز کے فہم کو اس لیے نہیں لیا مگر تاکہ یہ سب پوشیدہ رہے۔ پس اگر یہ مکاشف اسے فاش کر دے، تو اس نے وضع کی حکمت کو باطل کر دیا، مگر یہ کہ اسے اس میں سے کچھ ظاہر کرنے کی وحی کی جائے، تب وہ اس قدر افشاء کرنے میں معذور ہو گا۔\n\nاور اس منزل کے علوم میں رحم کرنے والوں کی تعریف کا علم ہے، اور اس شخص کا علم ہے جو شریک کو ظاہر کرتا ہے حالانکہ وہ اس کا اعتقاد نہیں رکھتا، جیسا کہ موحدین (الموحدين) میں سے وہ ہے جو شریک کی نفی کرتا ہے حالانکہ وہ اس کا اعتقاد رکھتا ہے، اور وہ وہ ہے جو یہ دیکھتا ہے کہ اسباب میں سے کچھ چیزیں اپنی ذات کی وجہ سے فعل کرتی ہیں۔ اور افعال میں موحد وہ ہے جو یہ دیکھتا ہے کہ اللہ کے سوا کوئی فاعل نہیں، جیسے وہ جو کہتا ہے کہ جب زاج (کچنار) اور عفص (مازو) جمع ہو جائیں اور طبعی رکاوٹیں دور ہو جائیں، تو سیاہی (سیاہی) کا ہونا ضروری ہے جو روشنائی ہے، حالانکہ وہ موحد ہے۔ اور موحد وہ ہے جو سیاہی کا وجود اللہ کی طرف سے دیکھتا ہے، جیسے اشاعرہ (الأشاعرة) اور ان جیسے لوگ، اور یہ کہ امکان کا تقاضا ہے کہ ان دونوں کا اجتماع طبعی رکاوٹوں کے دور ہونے کے ساتھ ہو، اور سیاہی نہ ہو مگر یہ کہ اللہ اس رنگ کو اس میں پیدا کرے۔ یہ طبعی لوگوں کے بارے میں ہے۔ اور جہاں تک متکلمین موحدین کا تعلق ہے، تو وہ کہتے ہیں کہ جب ناظر دلیل کے پہلو پر ٹھوکر کھاتا ہے، تو مدلول کا حاصل ہونا ضروری ہے، حالانکہ وہ دلیل کے پہلو اور مدلول کے درمیان فرق کرتے ہیں۔ اور یہ سلیم العقل کے نزدیک صحیح نہیں ہے، کیونکہ دلیل کا پہلو حاصل ہو جاتا ہے اور مدلول حاصل نہیں ہوتا۔ اور ان کے لیے یہ کہنا ممکن نہیں ہے کہ دلیل کا پہلو مدلول کے حاصل ہونے کا اظہار ہے، کیونکہ وہ دلیل کے پہلو اور مدلول کے درمیان فرق کرتے ہیں۔ اگر وہ عقلی طور پر نہیں بلکہ عادتاً ضرورت کا اضافہ کرتے، تو ان پر اعتراض نہ کیا جاتا، کیونکہ دلیل کے پہلو اور دیکھنے والے میں رؤیت کے درمیان کوئی فرق نہیں ہے، بلکہ رؤیت زیادہ کامل ہے۔ اور ہم ایمان کے ذریعے جانتے ہیں کہ اللہ نے ہماری آنکھوں کو ہم میں رؤیت کے وجود کے باوجود بہت سی ان چیزوں سے لے لیا ہے جو دوسروں کے لیے بصارت میں ہیں، پس مرئی کا حاصل ہونا ضروری نہیں ہوا، حالانکہ رؤیت موجود ہے اور وہ رکاوٹیں دور ہیں جو اس طبعی نشأت میں خلل ڈالتی ہیں۔ پس ایک انسان وہ دیکھتا ہے جو دوسرا نہیں دیکھتا، حالانکہ مرئی ان دونوں کے سامنے موجود ہے اور وہ دونوں بصارت کی حس کی سلامتی میں شریک ہیں۔ پس یہ ایک حجاب الٰہی (حجاب إلهي) ہے جس میں طبعی یا کونی چیز کا کوئی اثر نہیں ہے۔ اور یہ بہت زیادہ ہے۔ پس کتنے ہی ظاہری طور پر مشرک ہیں جو باطن میں موحد ہیں، اور اس کے برعکس۔\n\nاور اس میں آجال (موت کے اوقات) کا علم ہے، جو ان میں سے معلوم ہے اور جو معلوم نہیں ہے۔ اور اس میں مختلف 'کہاں' (أينيات) میں اللہ کی 'کیسے ہونا' (كينونية) کا علم ہے، اس کی ذات کے ساتھ۔ اور اس کی مثال ہر سفید چیز میں سفیدی کی طرح ہے، اگر تم سمجھو۔ کیونکہ اللہ تعالیٰ نے اپنے بارے میں کوئی ایسا حکم ذکر نہیں کیا جس کی مثال موجودات میں نہ ہو، کیونکہ اگر وہ ایسی مثال ذکر کرتا تو تعریف کا فائدہ حاصل نہ ہوتا، مگر یہ کہ وہ بعض فہموں کے لیے دقیق ہوتا ہے۔ پس جس پر وہ موجود ظاہر ہو جس کے لیے اس حکم کی عینیت ہو، تو ہم جان لیتے ہیں کہ وہ اللہ کی طرف سے اس حکم کے ساتھ مخاطب ہے، نہ کہ کوئی اور۔ جیسا کہ اللہ تعالیٰ نے فرمایا: لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (یقیناً آسمانوں اور زمین کی تخلیق انسانوں کی تخلیق سے بڑی ہے، لیکن اکثر لوگ نہیں جانتے)۔ پس بعض لوگوں نے جان لیا کہ یہاں کبریائی سے کیا مراد ہے، اور بعض اسے نہیں جانتے۔ پس جس نے اسے جانا، وہی اس آیت سے مخاطب ہے۔ اور اسی طرح ہر خطاب میں، یہاں تک کہ لَيْسَ كَمِثْلِهِ شَيْءٌ (اس جیسی کوئی چیز نہیں) میں بھی، اس نے اسے مخاطب کیا جو چیزوں میں مماثلت کی نفی کو جانتا ہے۔\n\nاور اس میں علمِ الٰہی کے معلومات سے عمومی تعلق کا علم ہے، اور ہم میں سے جس نے معلومات کو واجب، محال اور ممکن میں فی نفسہ محصور کیا، وہ ایک کلی پہلو سے عام ہو گیا، اور ان علماء کے درمیان فی نفسہ فرق باقی رہا جن پر ان احکام میں سے کسی ایک کا حکم لگایا گیا ہے۔ اور اس میں ممکنات میں سے جو کچھ آتا ہے اس کا علم ہے، اور وہ سب آیات (نشانیاں) ہیں۔ پس جو شخص اس بات سے اعراض کرتا ہے کہ وہ ایک آیت ہے، وہ اعراض کرتا ہے۔ اس میں ایک کے اعراض کرنے اور دوسرے کے اعراض نہ کرنے کی وجہ کیا ہے؟ اور اس میں اس شخص کا علم ہے جو اپنے آپ کو اس چیز میں شک میں ڈالتا ہے جو اس پر واضح ہو چکی ہے، اس شک میں ڈالنے کی وجہ کیا ہے؟ اور اس میں اس حقیقتِ الٰہیہ (حقيقة إلهية) کا علم ہے جس سے اللہ نے دنیا میں التباس (التباس) پیدا کیا، کیا یہ اس لیے تھا کہ وہ اپنے بندوں پر مختلف صورتوں میں تجلی (التجلی) کرتا ہے جنہیں پہچانا بھی جاتا ہے اور انکار بھی کیا جاتا ہے، حالانکہ وہ اپنی ذات میں ایک ایسی حقیقت پر ہے جو تبدیل نہیں ہوتی، اور تجلی اسی طرح ہوتی ہے؟ پس دنیا میں صرف التباس ہی ہے، اور یہ اس لیے کہ شارع نے خبر دی ہے کہ مومن کافر کی صورت میں ظاہر ہوتا ہے حالانکہ وہ سعید ہے، اور کافر مومن کی صورت میں ظاہر ہوتا ہے حالانکہ وہ شقی ہے، پس ہم پر امر کے التباس کی وجہ سے کسی کے لیے سعادت یا شقاوت کا قطعی فیصلہ نہیں کیا جا سکتا۔ پس یہ ہمارے نزدیک التباس نہیں ہے، بلکہ التباس یہ ہے کہ ہم سعید پر شقاوت کا اور شقی پر سعادت کا قطعی فیصلہ کر دیں، تب امر ہم پر التباس ہو گا۔ لیکن جب ہم قطعی فیصلہ نہیں کرتے، تو ہم پر کوئی چیز التباس نہیں ہوتی۔\n\nاور اس میں اس علم کا بھی ذکر ہے کہ قیامت کے دن حکم رحمت (الرحمة) کا ہو گا، اور عدل (العدل) رحمت میں سے ہے۔ اور قیامت کا دن قضاء میں عدل کا دن ہے۔ اور رحمت قیامت میں اس لیے آتی ہے تاکہ امر کا مشاہدہ ہو، یہاں تک کہ جب عدل کا حکم ختم ہو جائے اور اس کی مدت محکوم علیہ پر پوری ہو جائے، تو رحمت اس میں حکم کی ذمہ داری سنبھال لیتی ہے، بغیر کسی انتہا کے۔\n\nاور اس میں اس علم کا بھی ذکر ہے کہ کیا اللہ کے لیے ہے اور کیا مخلوق کے لیے ہے، اور میرا مطلب اس سے جو اللہ کے لیے ہے، وہ یہ ہے کہ وہ مخلص ہے۔ اور اس میں اس خالص صفت کا علم ہے جو اللہ کے ساتھ خاص ہے اور جس میں کوئی شریک نہیں جو آلہ نہ ہو۔ اور اس میں اس علم کا بھی ذکر ہے کہ الٰہی اسماء اپنے معانی کے اختلاف کی وجہ سے کیوں متعدد ہوئے، تو کیا وہ ان معانی کے لیے اسماء ہیں جو ان کے تحت ہیں، یا وہ اس کے لیے اسماء ہیں جس کی طرف وہ معانی منسوب ہیں؟ اور کیا وہ معانی وجودی امور ہیں یا نسب ہیں جن کا کوئی وجود نہیں؟\n\nاور اس میں معاملات اور حکومتوں میں انصاف اور عدل کا علم ہے۔ اور اس میں اس علم کا بھی ذکر ہے کہ اس کے حکم کی مدت ختم ہونے کے بعد استحقاق سے کیا بے نیاز کرتا ہے، اور معاملات اور حکومتوں میں فلاح (الفلاح) کا کیا معنی ہے؟ اور اس میں اس علم کا بھی ذکر ہے کہ اس کے حکم کی مدت ختم ہونے کے بعد استحقاق سے کیا بے نیاز کرتا ہے، اور اس میں سزا کے مستحق سے فلاح کی نفی کا کیا معنی ہے؟\n\nاور اس میں مشرک کے شریک کا انکار کرنے کا علم ہے، کیا اس میں سچائی کا کوئی پہلو ہے یا وہ ہر پہلو سے جھوٹا ہے؟ اور یہ اس لیے کہ حقیقت میں کہنے والا اللہ کے سوا کوئی نہیں، پس وہاں سے اس کے لیے سچائی کا کوئی پہلو ضرور ہو گا، جہاں سے یہ منسوب کیا جاتا ہے کہ یہ اللہ کا قول ہے، اگرچہ وہ مخلوق کی زبان پر ظاہر ہو۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم سے صحیح حدیث میں آیا ہے کہ اللہ اپنے بندے کی زبان پر کہتا ہے۔\n\nاور قرآن نے اس کا نطق کیا ہے، پس ترجمان کا کلام عین وہی ہے جس کا ترجمہ کیا جا رہا ہے۔ اور اس میں ان احوال کا علم ہے جو ان احکام میں ظاہر ہوتے ہیں جو اس شخص میں قائم ہوتے ہیں جس میں وہ حال قائم ہو۔ اور اس میں اس علم کا بھی ذکر ہے جو دو ممکنات میں سے کسی ایک کے وقوع کا قطعی فیصلہ بغیر دلیل کے پیدا کرتا ہے۔ اور اس میں اس علم کا بھی ذکر ہے کہ عارف جسے کشف (الکشف) حاصل ہے، حق کے کس فعل سے ناراض ہوتا ہے اور کس سے ناراض نہیں ہوتا۔ اور سخط (ناراضگی) باطن کا عمل ہے، یہاں تک کہ اگر وہ اس پر قائم نہ ہو اور اپنے باطن میں ناراض ہو اور ناراضگی ظاہر کرے، تو اس کا حال نفاق کے زیادہ قریب ہو گا بہ نسبت ایمان کے۔\n\nاور اس میں اس علم کا بھی ذکر ہے کہ کیا نفاق پر ابھارنا تسلیم (تسليم) کے منافی ہے؟ اور جب صاحبِ تسلیم اور صاحبِ مدارات (نرمی کرنے والا) جمع ہوں، تو ان دونوں میں سے کون زیادہ عالم ہے؟ اور اس میں اس علم کا بھی ذکر ہے کہ جب کسی کو پکارا جائے اور وہ جواب نہ دے، تو سننے والے کو روکنے والی وجہ کیا ہے؟ کیا یہ کہا جائے گا کہ اس نے سنا یا یہ کہا جائے گا کہ اس نے نہیں سنا؟ اور اس میں ظلمت (اندھیرا) کا علم ہے، جو اندھا پن ہے، اور ضلال (گمراہی) کا علم ہے، جو حیرت ہے۔ اور اس میں اس علم کا بھی ذکر ہے کہ دنیا میں موجود ہر چیز کا عمومی حشر ہو گا، خواہ وہ معدن ہو، نبات ہو، حیوان ہو، انسان ہو، جن ہو، آسمان ہو یا زمین ہو۔\n\nاور اس میں اس وجہ کا علم ہے جو حق سبحانہ کی توحید کی طرف بلاتی ہے اور جس کے ساتھ شرک ممکن نہیں ہوتا۔ اور کیا اس کا حکم بقا (البقاء) کا ہے، پس توحید کا حکم باقی رہے گا، یا اس کے لیے بقا نہیں ہے، یا وہ بعض قوموں کے حق میں باقی رہے گا اور بعض کے حق میں نہیں؟ اور اس میں عمومی ایمان کا علم ہے، اور اسی لیے انجام رحمت کی طرف ہو گا، کیونکہ اللہ صرف مومنوں پر رحم کرتا ہے، پس عمومی ایمان کا حکم رحمت میں سے ہے۔ اور اس میں بوادہ (اچانک ظاہر ہونا) اور ہجوم کا علم ہے، اور اس کتاب میں احوال میں اس کا ایک باب ہے۔\n\nاور اس میں اس علم کا بھی ذکر ہے کہ جس نے علم کی تکلیف اٹھائی اور وہ عالم نہیں تھا، پھر اسے علم مل گیا، تو کیا اسے عالم کہا جائے گا یا نہیں؟ اور اس میں اللہ کے لیے محبت اور اللہ کے لیے بغض کا علم ہے، کیا وہ شخص جس سے اللہ کے لیے بغض رکھا گیا، اس کے لیے کوئی ایسا پہلو ہے جس میں اس سے اللہ کے لیے محبت کی جائے، جیسا کہ اس کے لیے اللہ کی طرف سے ایک پہلو ہے جس سے اسے رزق دیا جاتا ہے، باوجود اس کے کہ اس سے بغض رکھا جاتا ہے؟ اور اس میں مجمل میں تفصیل کے فائدے کا علم ہے۔ اور اس میں انسان کی فطرت کا علم ہے کہ وہ چیزوں میں جلد بازی کرتا ہے اگر وہ ان پر قادر ہو۔ اور اس میں غیوب کا علم ہے، اور جو ان میں سے معلوم ہے اور جو معلوم نہیں ہے۔ اور ان اسباب کا علم ہے جن کے مسببات نامعلوم ہیں، اس لحاظ سے کہ وہ ان اسباب کے لیے ہیں، حالانکہ ان کا اور ان کے اسباب کا علم ہے، مگر اس لحاظ سے کہ وہ ان کے اسباب ہیں۔ اور اس میں اللہ کا دنیا کی شخصیات کا علم ہے۔ اور اس میں دنیا میں وفات اور بعث (دوبارہ اٹھانا) کا علم ہے، اور اس وفات کا علم ہے جس سے آخرت میں بعث ہو گا، اور دو موتوں میں برزخ (البرزخ) کی طرف انتقال کا علم ہے۔ اور اس میں ملکی ارواح کی ان کی عبادات میں مراتب کا علم ہے۔ اور اس میں عالم کی عمومی نجات کا علم ہے، خواہ وہ مشرک ہو یا غیر مشرک، اور یہ ایک عجیب علم ہے جو قرآن میں مخصوص ہے اور لوگ اسے محسوس نہیں کرتے۔ اور اس میں اس وجہ کا علم ہے جو قادر ہونے کے باوجود فعل کو ترک کرنے کا سبب بنتی ہے۔ اور اس میں ہر اسم کے لیے ایک مسمیٰ کا علم ہے، اور اس سے مسمیٰ کا اس کی عین میں وجود لازم نہیں آتا۔ اور وہ کون سا مرتبہ ہے جو تمام معلومات کو وجود کے ساتھ عام کرتا ہے، خواہ وہ معلوم وجود میں محال ہو یا نہ ہو؟ اور اس میں اس علم کا بھی ذکر ہے کہ کون سا بدلہ برزخ (البرزخ) ہو گا، پس اس پر عمل کرنے سے دوسرا بدلہ پیدا ہو گا۔ اور اس میں ردہ (ارتداد) کا علم ہے کہ وہ کس طرف لوٹتا ہے، اور وہ صرف آگے کی طرف چلنا ہے، جیسا کہ ہم کہتے ہیں کہ سورج دن کے بڑھنے اور گھٹنے میں لوٹتا ہے، حالانکہ اس کے پاس کوئی لوٹنا نہیں ہے، بلکہ وہ اپنے راستے پر ہے۔ تو کیا یہ چیزوں میں نسخ (النسخ) کی طرح ہے، اور وہ حکم کی مدت کا ختم ہونا اور دوسرے حکم کی مدت کا شروع ہونا ہے، اور راستہ ایک ہی ہے، اس پر چلنے والے کے لیے اس سے کوئی رجوع نہیں ہوتا؟ اور اس میں نفخ (پھونک) کا علم ہے اور اس کی عینیت کے واحد ہونے کے باوجود اس کے احکام کا اختلاف ہے۔ اور اس میں مشاہدہ (المشاهدة) کا علم ہے اور اس کے اور علمِ نظر کے درمیان فرق کا علم ہے۔ اور اس میں استدلال (الاستدلال) کا علم ہے۔ اور اس میں ہر علم کے لیے رجال (اہل) کا علم ہے اور ہر مقام کے لیے مقال (قول) کا علم ہے، اور اگر وہ کہا نہ جائے تو وہ حال کا مقالہ ہے۔ اور اس میں اس شخص کا علم ہے جس نے اس کی مشابہت اختیار کی جس کی مشابہت قبول نہیں کی جاتی، تو اسے کس چیز نے اس کی طرف بلایا؟ اور اس میں اعادہ (دوبارہ لانا) کا علم ہے کہ وہ ابتداء کی صورت پر ہو گا، اور اگر ایسا نہ ہو تو وہ اعادہ نہیں ہے۔ اور اس میں اس علم کا بھی ذکر ہے کہ کیا کوئی چیز اپنے ضد کا محل ہو سکتی ہے یا نہیں؟ اور اس میں مبہمات کو واضح کرنے کا علم ہے۔ اور اس میں رات اور دن کے حکم کا علم ہے، اور ان کی طرف ولوج (داخل ہونا)، غشیان (ڈھانپ لینا) اور تکویر (لپیٹنا) کی نسبت کا علم ہے، اور ان کا نیا ہونا اور لپیٹا جانا۔ اور اس میں ایک سے بہت کچھ نکالنے کا علم ہے، اور یہ کیسے صحیح نہیں ہوتا مگر طبعی ترکیب پر تدریج کے ساتھ، جو صرف واحد کے ساتھ ہی مرکب ہوتی ہے۔ اور اس میں چیزوں میں استحالات (تبدیلیوں) کا کیا معنی ہے اس کا علم ہے۔ اور اس میں احکام کا علم ہے، کیا ہر حکم اس پر صحیح ہوتا ہے جس پر وہ متوجہ ہوتا ہے، یا ان میں سے کچھ صحیح ہوتے ہیں اور کچھ صحیح نہیں ہوتے؟ اور حاکم اللہ ہے، تو وجود میں ایسا حکم کیسے ہو سکتا ہے جو محکوم علیہ پر صحیح نہ ہو؟ اور اس مسئلے میں ایک گہرائی ہے کہ شریک کا حکم وجود میں ظاہر ہوا ہے، حالانکہ یہ حکم باطل ہے جب اسے اللہ کی طرف منسوب کیا جائے، کیونکہ وہ اپنی بادشاہت میں شریک سے پاک ہے۔ اور اس میں اللہ کے بارے میں مقالہ (بات) کی وسعت کا علم ہے، اور یہ کہ یہ مہلتِ الٰہی (الإمهال الإلهي) ہے، نہ کہ غفلت۔ اور اس میں اس علم کا بھی ذکر ہے کہ نام رکھنا کیا اثر کرتا ہے اور اسے ترک کرنا کیا اثر کرتا ہے۔ اور اس میں ان اشعار میں جو کچھ شامل ہے اس کا علم ہے، اور وہ یہ ہیں:\n\n> جہالت موت ہے، لیکن اسے کوئی نہیں جانتا،\n> سوائے اس کے جس کے سانس علم سے زندہ ہو گئے ہوں۔\n> اس گرہ میں حل کو کوئی نہیں جانتا جس سے وہ بندھا ہوا ہے،\n> سوائے اس کے جس کی رسیاں مضبوطی سے بٹ گئی ہوں۔\n> اور تم نے اسے حل نہیں کیا، لیکن تم اس کا دعویٰ کرتے ہو،\n> اور جس نے یہ گمان کیا، اس کا ابلیس ہونا صحیح ہو گیا۔\n> جسے اللہ گمراہ کر دے، اسے کوئی ہدایت دینے والا نہیں دکھا سکتا،\n> اور وہ وہی ہے جس کی بے نیازی میں اس کا افلاس صحیح ہو گیا۔\n\nاور اس میں اس علم کا بھی ذکر ہے جس میں تضعیف (دوگنا کرنا) واقع ہوتی ہے، وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و هفتاد و هشتم» در معرفت منزل امت بهیمه (الأمة البهيمة)، و احصار (الإحصار)، و سه سرّ علوی، و تقدم متأخر و تأخر متقدم از حضرت الهی.\n\nعارفان سوی مسمّا پر کشند\nبا پرهای فرشتگان گرامی\nبه سوی ذات ذات‌ها، بی‌هیچ وصفی\nپس ایشان را با ارواح اسامی بازگرداند\nتا ذاتشان از هر جهت کامل شود\nاز حال منزّه و مقام\nو شاهد حالشان آشکار شود و حکم کند\nپس همگی امام از پی امام‌اند.\n\n### [بهائم امت‌هایی از جمله امت‌ها هستند]\n\nبدان – خداوند ما و تو را تأیید کند – که بهائم (البهائم) امت‌هایی از جمله امت‌ها هستند. آنان تسبیحاتی دارند که مخصوص هر جنس است و نمازی مانند آنچه برای دیگر مخلوقات است. تسبیح آنان همان تنزیهی است که از خالق خود می‌دانند؛ پس بهره‌ای در [آیه] لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست) دارند. و اما نمازشان، مناجات خاصی با حق (الحق) دارند. خداوند متعال می‌فرماید: والطَّيْرُ صَافَّاتٍ كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ (و پرندگان در حال پرواز، هر یک نماز و تسبیح خود را می‌داند). و فرمود: وأَوْحى‏ رَبُّكَ إِلَى النَّحْلِ أَنِ اتَّخِذِي من الْجِبالِ بُيُوتاً ومن الشَّجَرِ ومِمَّا يَعْرِشُونَ ثُمَّ كُلِي من كُلِّ الثَّمَراتِ فَاسْلُكِي سُبُلَ رَبِّكِ (و پروردگارت به زنبور عسل وحی کرد که از کوه‌ها و درختان و از آنچه [مردم] می‌سازند، خانه‌هایی برگیر. سپس از همه میوه‌ها بخور و راه‌های پروردگارت را که رام شده‌اند بپیما). و این راه‌ها همان‌هایی است که خداوند برایشان تشریع کرده تا رام و آسان بپیمایند. هر چیزی از مخلوقات کلامی مخصوص به خود دارد که خداوند آن را می‌داند و هر کس خداوند گوش او را برای درک آن باز کند، می‌شنود. و تمام حرکات و صنایعی که از حیوانات ظاهر می‌شود و جز از صاحب عقل و فکر و تدبیر آشکار نمی‌گردد، و اوزانی که در آن دیده می‌شود، دلالت بر این دارد که آنان در درون خود عالمانی به همه این امور هستند. سپس اموری از آنان دیده می‌شود که دلالت بر این دارد که تدبیر عامی که انسان دارد، برای آنان نیست. پس امور در نزد کسانی که در کار آنان می‌نگرند، متعارض شده و امرشان بر آنان مبهم گشته است. و شاید به همین دلیل آنان را بهائم (البهائم) نامیده‌اند، به سبب ابهام امرشان؛ مگر در نزد ما، که این امر از هر واضحی واضح‌تر است. و هر کس که این امر بر او پوشیده مانده، جز به دلیل فقدان کشف (الکشف) برای او نبوده است. پس آنان از مخلوقات جز به اندازه آنچه مشاهده می‌کنند، نمی‌شناسند. و همچنین کسی که آنان را به درجه معارف و علم به خداوند و آنچه خداوند آنان را برای آن شایسته کرده، ملحق ساخته است، این کار را نکرده مگر به این دلیل که خداوند امر و احوال آنان را بر او کشف (الکشف) کرده است، یا مؤمنی راستین در ایمان که امر آنان از طریق کتاب یا سنت از جانب خداوند به او رسیده است. و در این قول، شیخ و امام متقدم ما، حجت خداوند بر محققان، ما را یاری کرده است؛ همان کسی که ابوطالب مکی، صاحب قوت القلوب، وقتی قولی از او نقل می‌کند، می‌گوید: «عالم ما سهل بن عبدالله تستری». همان که قلبش را در کودکی در حال سجده دید و سر برنداشت و قرآن را در شش سالگی حفظ کرد. و هنگامی که به ذکر او به خلوت رفتم، در همان شب فتح خاص آن ذکر برایم گشوده شد. پس به نور آن، آنچه نزد من غیب بود، آشکار گشت. سپس آن نور مکاشف به غروب کرد. گفتم: «این مشهد خلیل من است.» پس دانستم که از همان ساعت وارث ملتی هستم که خداوند رسولش را به آن امر کرد و ما را به پیروی از آن فرمان داد، و آن این قول است: مِلَّةَ أَبِيكُمْ إِبْراهِيمَ هُوَ سَمَّاكُمُ الْمُسْلِمِينَ من قَبْلُ (آیین پدرتان ابراهیم؛ او شما را پیش از این مسلمان نامید). و پدری و فرزندی او بر من محقق شد. و شیخ ما صالح بربری در اشبیلیه به من گفته بود: «ای فرزندم، مبادا پس از عسل، سرکه بچشی.» پس مراد او را دانستم. او از بزرگترین کسانی بود که دیدم به سوی خداوند منقطع شده بودند، بلکه منقطع‌کنندگان بودند؛ کسی را بر قدم او ندیدم. پس صبحگاه نزد شیخ آمدم و آنچه را در منظومه‌ای سروده بودم، گفتم؛ نه از روی تدبیر و نه از روی تعمّل، چنانکه ابوالعباس ابن عریف صنهاجی گفته است:\n\nو حدیثی آمد که شنیدنش ملال‌آور نیست\nنثر و نظم آن بر ما گواراست.\n\nو نظمی که در حال خود سرودم این بود:\n\nمانند سرکه بود پس از عسل\nپس چراغ از من رفت و غروب کرد\nو تاریکی شبی سیاه پدیدار شد\nکه در قلب، اسباب بیماری‌ها را به ارث گذاشت\nگفتم: پروردگارا! گفت: لبیک، پس چه می‌خواهی؟\nگفتم: نوری با عمل\nعلم حقی که گفتی\nگفت: دری بسته است. گفتم: آری\nگفتم: نور خالص خود را به من ببخش\nپس نور بدون هیچ مثالی پدیدار شد\nدر آسمانم، سپس زمینم، سپس آنچه\nمیان این دو است، تا بی‌نهایت\nو هر که سخن مرا بفهمد، دانسته است\nکه من همان امری هستم که از او نازل شد.\n\nشیخ از این نفس (سخن) شاد شد و گفت: «این از تجلی (التجلی) غلس (تاریکی صبح) است.» گفتم: «راست گفتی، چنین بود.» گفت: «الحمدلله المنعم علی کل حال (سپاس خدای را که در هر حالی نعمت‌بخش است). اگر مردم نعمتی را که در احوال جاری است می‌دانستند، میان خوشی و ناخوشی فرق نمی‌گذاشتند و حمد متحد می‌شد.» گفتم: «بلکه متوحد می‌شد.» گفت: «راست گفتی ای فرزندم و شیخ خطا کرد.» پس دست او را بوسیدم و او سر مرا بوسید.\n\nاگر صادق دعوت‌کننده، آشکارا نزد تو آمد\nاگر مؤمن هستی، گوش به او بسپار\nو گفتم: رسول خدا، تو وسیله من هستی\nبه سوی سعادتم، پنهان می‌گویم و آشکار\nو در ایمان به او تردیدی ندارم\nزیرا امر را دانشی آشکارا دانستم\nبه کشفی (الکشف) که از خدایم به من رسید، در مشهدی\nکه روز قیامت وطن ما خواهد بود\nفَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاء فليدع (پس هر که می‌خواهد ایمان آورد و هر که می‌خواهد بخواند)\nزیرا آنجا جز خدا نیست، پس علم، علم ماست\nاگر از درون بگویم: یا الله\nاگر بپرسی این کیست، می‌گوید: منم، منم\nمنم بخشنده و نیکوکار در هر حالتی\nو این صفتی است که برای غیر ما نیست\nو غیرتی در کار نیست، بلکه می‌گویم به آنچه\nرسولان ما آوردند، پس سخن از ما، به ما و برای ماست\nو رسول من جز صفت من نیست و آنکه\nبا او سخن می‌گویم، غیر من نیست، پس چشم تو، چشم ماست.\n\nهر چیزی در عالم که نزد اهل نظر و در میان عوام گفته می‌شود که نه زنده است و نه حیوان، نزد ما خداوند آن را هنگام خلق بر معرفت (المعرفة) و علم به خود سرشته است. و آن زنده و ناطق به تسبیح پروردگارش است. مؤمن با ایمان خود آن را درک می‌کند و اهل کشف (الکشف) آن را به عین مشاهده می‌کنند. و اما حیوان، خداوند آن را بر علم به خود تعالی سرشته و نطقش را به تسبیح خود قرار داده و برایش شهوتی قرار داده که برای دیگر مخلوقاتی که پیشتر ذکر شدند، نبوده است. و فرشتگان را بر معرفت (المعرفة) و اراده، نه شهوت، سرشته است و به آنان امر کرده و خبر داده که نافرمانی نمی‌کنند، به دلیل اراده‌ای که برایشان خلق کرده است. و اگر اراده نبود، خداوند آنان را به اینکه نافرمانی نمی‌کنند و يَفْعَلُونَ ما يُؤْمَرُونَ (آنچه را که مأمورند انجام می‌دهند) ستایش نمی‌کرد. و جن و انس را بر معرفت (المعرفة) و شهوت سرشته است، که شهوت تعلقی خاص در اراده است، زیرا شهوت اراده‌ای طبیعی است. پس انس و جن اراده الهی مانند فرشتگان ندارند، بلکه اراده‌ای طبیعی دارند که شهوت نامیده می‌شود. و هر دوی آن‌ها را بر عقل سرشته است، نه برای کسب علم، بلکه خداوند آن را ابزاری برای انس و جن قرار داده تا شهوت را در این سرای آخرت بازدارند. و به همین دلیل در سرای آخرت به اهل بهشت فرمود: ولَكُمْ فِيها ما تَشْتَهِي أَنْفُسُكُمْ (و در آنجا هر چه دل‌هایتان بخواهد برای شماست)؛ این نشانه‌ای برای ماست که نشأت آخرت که ما را در آن ایجاد می‌کند، طبیعی است، مانند نشأت دنیا، زیرا شهوت جز در نفوس طبیعی نیست. و نفوس طبیعی بهره‌ای در اراده ندارند. پس اگر انسان یا جن علمی را بدون کشف (الکشف) به دست آورد، این از نیروی فکری است که خداوند در او قرار داده است. پس هر آنچه فکر به نفس ناطقه می‌دهد و در نفس‌الامر علم باشد، از طریق موافقت با فکر است. پس علومی که در انسان است، تنها از طریق فطرت، ضرورت، الهام و کشف (الکشف) است. کشفی که برای او حاصل می‌شود، تنها از علمی است که خداوند او را بر آن سرشته است، پس معلوم خود را می‌بیند. و اما با فکر، رسیدن به علم محال است. اگر گفته شود: این را از کجا دانستی، در حالی که از مدرکات حس نیست؟ پس جز نظر (فکر) باقی نمی‌ماند. می‌گوییم: آن‌گونه که شما می‌گویید نیست، بلکه الهام و اعلام الهی باقی است. پس نفس ناطقه آن را از پروردگارش به صورت کشف (الکشف) و ذوق از وجه خاصی که برای او و هر موجودی جز خداوند است، دریافت می‌کند. و فکر صحیح از حد امکان فراتر نمی‌رود و جز آن را نمی‌دهد. و این از علم و اعلام خداوند است. کسی که این را با فکر درک نکرده باشد، [باید بداند که] ابن عطاء سوار بر شتری بود، پای شتر در زمین فرو رفت. ابن عطاء گفت: «جلّ الله (خداوند بزرگ است).» شتر گفت: «جلّ الله، بیشتر از بزرگداشت توست.» پس شتر داناتر به خدا از ابن عطاء بود. ابن عطاء شرمنده شد. این از علم بهائم (البهائم) به خداوند است. و اما رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم)، در صحیح ذکر شده است که گاوی در زمان بنی اسرائیل که صاحبش بر آن بار نهاده بود، گفت: «من برای این خلق نشده‌ام، بلکه برای شخم زدن خلق شده‌ام.» صحابه گفتند: «آیا گاو سخن می‌گوید؟» رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «آمنت بهذا أنا وأبو بكر وعمر (من و ابوبکر و عمر به این ایمان آوردیم).» و این بدان سبب بود که روح‌الامین او را خبر داده بود. اگر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را به چشم می‌دید، نمی‌گفت: «ایمان آوردم.» پس این گاو از اصناف حیوانات دانسته است که برای چه خلق شده است، در حالی که انس و جن برای عبادت خداوند خلق شده‌اند و این را جز با تعریف خداوند بر زبان رسول ندانسته‌اند. این در فطرت آنان است، اما آنچه بر آن هستند بر ایشان کشف (الکشف) نشده است. یکی از اهل الله از کنار مردی گذشت که سوار بر الاغی بود و بر سر الاغ می‌زد تا تندتر راه برود. آن مرد به او گفت: «چرا بر سر الاغ می‌زنی؟» الاغ به او گفت: «او را واگذار، او بر سر خود می‌زند.» این الاغ دانسته است که امور به کجا می‌انجامد، با فطرت نه با فکر. پس ای محجوب، بنگر که مرتبه تو در برابر مرتبه بهائم (البهائم) کجاست؟ بهائم تو را می‌شناسند و می‌دانند که کار تو به کجا می‌انجامد و می‌دانند برای چه خلق شده‌اند، در حالی که تو همه این‌ها را ندانسته‌ای. با این حال، بهائم در حیرت در خداوند هستند و بر آن سرشته شده‌اند؛ این همان مقامی است که اهل نظر صحیح در خداوند و اهل تجلی (التجلی) به آن می‌رسند. و به همین دلیل خداوند درباره کسی که خدا را نشناخته، فرمود: إِنْ هُمْ إِلَّا كَالْأَنْعامِ (آنان جز مانند چهارپایان نیستند)؛ یعنی در گمراهی که همان حیرت است. سپس فرمود: بَلْ هُمْ أَضَلُّ سَبِيلًا (بلکه گمراه‌ترند از راه). و سبیل (السبيل) همان راه است. پس گمراهی را افزود؛ یعنی حیرت در راهی که برای رسیدن به معرفت (المعرفة) پروردگارشان از طریق افکارشان می‌جویند. این حیرتی است افزون بر حیرت در خداوند. و همچنین درباره آنان فرمود، آنجا که گفت: افزایش را تنها در سبیل (السبيل) قرار داد. و آن جز فکر و تفکر در چیزی نیست که تفکر در آن منع شده است، یعنی نظر در ذات خداوند. پس فرمود: ومن كانَ في هذِهِ أَعْمى‏ (و هر کس در این [دنیا] کور باشد)؛ که همان حال جهل به خداوند است، آن‌گونه که در نفس‌الامر از حیث ذات است، فَهُوَ في الْآخِرَةِ أَعْمى‏ (پس او در آخرت نیز کور است)؛ همان‌گونه که در دنیاست. سپس افزود و گفت: وأَضَلُّ سَبِيلًا (و گمراه‌تر از راه). و سبیل همان راه است. و به همین دلیل عمرو بن عثمان مکی در وصف معرفت (المعرفة) و عارفان گفت: همان‌گونه که امروز هستند، فردا نیز خواهند بود. پس بدان، اگر می‌فهمی که خداوند اهل گمراهی را به چهارپایان تشبیه کرده است، او آنان را به دلیل نقص در چهارپایان تشبیه نکرده، بلکه تشبیه در حیرت واقع شده است، نه در محل حیرت. پس دانایان به خداوند، شدیدترین حیرت را در خداوند دارند. و به همین دلیل:\n\nاز رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) روایت شده است که به پروردگارش گفت: «زدنی فیک تحیراً (حیرت مرا در خودت بیشتر کن).»\n\nزیرا او مقام والای حیرت را برای اهل تجلی (التجلی) به دلیل اختلاف صور می‌دانست. و تصدیق این حدیث، قول اوست:\n\n«لا أحصي ثناء عليك أنت كما ثنيت على نفسك (من نمی‌توانم ثنای تو را بشمارم، تو همان‌گونه‌ای که خود را ثنا گفتی).»\n\nو ما می‌دانیم که خداوند چگونه خود را ثنا گفته است، از جمله گشودن دو دستش به انفاق، و شادمانی‌اش به توبه بنده‌اش و امثال آن، و از [آیه] لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست) و [آیه] وما قَدَرُوا الله حَقَّ قَدْرِهِ (و قدر خدا را آن‌گونه که شایسته اوست نشناختند). و قول رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم): «لو يعلم البهائم من الموت ما تعلمون ما أكلتم منها سمينا (اگر بهائم از مرگ آنچه را که شما می‌دانید، می‌دانستند، از آن‌ها فربه نمی‌خوردید).»\n\nپس بنگر به تنبیه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بر حسن استعداد آنان و برابری استعداد ما، تا جایی که کسی که در این مرتبه از فکر در مرگ باشد، نهایت کارش این است که استعداد بهائم (البهائم) را به دست آورد. و این ستایشی است بر کسی که به این مقام رسیده و رفعت در حق اوست. و چگونه به بهائم (البهائم) با تحقیر نگریسته می‌شود، در حالی که نهایت ستایش تو از جانب خداوند این است که در صفتشان با آنان شریک شوی؟ پس دل خود را تیز کن و قُلْ رَبِّ زِدْنِي عِلْماً (بگو: پروردگارا، علم مرا زیاد کن)، زیرا خداوند در خلق خود اسراری دارد. و به همین دلیل خَلَقَكُمْ أَطْواراً (شما را در اطوار گوناگون آفرید).\n\n### [بهائم از جانب خداوند برای انسان مسخر و رام شده‌اند]\n\nو بدان که بهائم (البهائم)، اگرچه از جانب خداوند برای انسان مسخر و رام شده‌اند، اما از این غافل مباش که تو نیز مسخر آنان هستی، به واسطه رسیدگی به مصالحشان در آب دادن و علف دادن و تمیز کردن جایگاهشان و مباشرت با کثافات و فضولات به خاطر آنان، و محافظتشان از گرما و سرمای آزاردهنده. این و امثال آن از این روست که حق (الحق) تو را مسخر آنان کرده و در نفس تو نیاز به آنان را قرار داده است. زیرا آنان هستند که بارهای سنگین تو را به شهری حمل می‌کنند که جز با نصف ذات خودت به آن نمی‌رسیدی، یعنی شقّ الأنفس (سختی جان‌ها)؛ یعنی جز با وهم و تخیل، نه با حس، به آن نمی‌رسیدی، مگر به واسطه این مرکب‌ها. پس تو بر آنان به واسطه تسخیر فضیلتی نداری، زیرا خداوند تو را بیشتر از آنچه آنان را به تو محتاج کرده، به آنان محتاج کرده است. آیا خشم رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را ندیدی، هنگامی که درباره شتر گم‌شده از او سؤال شد، چگونه فرمود: «ما لك ولها معها حذاؤها وسقاؤها ترد الماء وتأكل الشجر حتى يجدها ربها (تو را با آن چه کار؟ کفش و آبش با اوست، به آب می‌رود و درخت می‌خورد تا صاحبش او را بیابد).» پس او نیازی به تو برای شتر قرار نداد، اما نیاز به آن را در تو قرار داد. و همه بهائم (البهائم) از تو فرار می‌کنند، آن‌هایی که ابزار فرار دارند. و این نیست مگر به دلیل بی‌نیازی آنان از تو و علمی که بر آن سرشته شده‌اند که تو برایشان زیان‌آور هستی. سپس طلب کردن تو برای آنان و بذل جهدت در به دست آوردن چیزی از آنان، دلیلی بر فقر تو به آنان است. پس به خدا سوگند، چگونه کسی که بهائم از او بی‌نیازترند، در نفس خود احساس می‌کند که از آنان برتر است؟ راست گفت آن کس که گفت: «ما هلك امرؤ عرف قدره (هلاک نشد کسی که قدر خود را شناخت).» به خدا سوگند، امور را نمی‌شناسد مگر کسی که آن‌ها را با ذوق شهود کند و با کشف (الکشف) به عین ببیند.\n\nشوق را نمی‌شناسد مگر آنکه آن را تحمل کند\nو عشق را نمی‌شناسد مگر آنکه با آن دست و پنجه نرم کند.\n\nآیا خبر فیل و حبس شدن و امتناعش از آمدن برای ویرانی خانه خدا به تو نرسیده است؟ آیا آنچه پرندگان با اصحاب فیل کردند و سنگ‌هایی که بر آنان پرتاب کردند و خاصیت کشتن داشتند، نه سنگ‌های دیگر، به تو نرسیده است؟ آیا می‌بینی که این کار از آنان بدون وحی الهی به آنان صادر شده است؟ چه بسیار فیل‌ها در عالم بودند و چه بسیار لشکریان مهاجم در عالم بودند، اما چرا چنین امری تنها در این‌ها ظاهر شد و در دیگران ظاهر نشد؟ آیا خداوند به کسی که از او تعقل نمی‌کند، وحی می‌کند؟ آیا خداوند متعال نفرموده است: وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ (و هیچ رسولی را نفرستادیم مگر به زبان قومش تا برای آنان بیان کند)؟ آیا این جز برای آن است که بفهمند تا حجت بر آنان تمام شود اگر مخالفت کردند، یا به آنچه فهمیدند عمل کنند و سعادتمند شوند؟ آیا در نبوت اولی و ثانیه هرگز شنیده‌ای که حیوانی یا چیزی غیر از حیوان، امر خدا را نافرمانی کرده باشد یا وحی خدا را نپذیرفته باشد؟ کجا هستی از فرار سنگ با لباس موسی (علیه السلام) تا عورت او برای قومش آشکار شد تا دروغشان را در آنچه به او نسبت داده بودند، بدانند؟ فَبَرَّأَهُ الله مِمَّا قالُوا (پس خداوند او را از آنچه گفتند مبرا ساخت). آیا فرار سنگ بدون امر خداوند به آن بوده است؟ آیا امتناع آسمان‌ها و زمین و کوه‌ها از حمل امانت و ترسشان از آن، بدون علم به قدر امانت و سرانجام کسی که آن را حمل کند و حق خدا را در آن حفظ نکند، بوده است؟ و علم آنان به تفاوت میان عرض و امر؟ پس چون عرض تخییر بود، برای خود احتیاط کردند و سلامت طلبیدند. و هنگامی که حق تعالی به آنان امر کرد که بیایند، به آسمان و زمین گفت: ائْتِيا طَوْعاً أَوْ كَرْهاً (خواه یا ناخواه بیایید). قالَتا أَتَيْنا طائِعِينَ (گفتند: با رغبت آمدیم)؛ اطاعت از امر خدا و ترس از اینکه به اکراه آورده شوند. آیا اگر قرآن بر کوهی نازل می‌شد و از خشیت خدا خاشع می‌شد و می‌شکافت، این کار از او بدون علم به قدر آنچه خداوند بر او نازل کرده و آنچه از تخویفاتی که کوه‌های سرسخت از آن ذوب می‌شوند، با او خطاب کرده، بوده است؟ خداوند و رسولش چقدر برای ما بیان کرده‌اند که مخلوقات بر چه علمی به خداوند و اطاعت از او و قیام به حق او هستند، اما ما ایمان نمی‌آوریم و نمی‌شنویم و آنچه را که امر بر آن نیست، می‌پذیریم تا از مؤمنان باشیم، در حالی که در حقیقت از تکذیب‌کنندگان هستیم. و ما حس خود را بر ایمان به آنچه پروردگارمان را با آن شناختیم، ترجیح دادیم، زیرا آن را به مشاهده عین ندیدیم.\n\n### [همه موجودات چیزی نیستند مگر زنده ناطق]\n\nو بدان که هر کس بداند که همه موجودات، هیچ یک نیست مگر آنکه زنده ناطق یا حیوان ناطق است، خواه جماد نامیده شود یا نبات یا مرده؛ زیرا هیچ چیز از قائم به ذات خود و غیر قائم به ذات خود نیست مگر آنکه پروردگارش را با حمد او تسبیح می‌گوید. و این صفتی است که جز برای کسی که به زنده بودن موصوف است، نیست. و کسی که مشهدش این باشد که موجودات چنین‌اند، در خلوت خود که در میان عوام جلوه نامیده می‌شود، نهایت حیا را دارد، همان‌گونه که در جلوت خود حیا می‌کند. زیرا او همیشه در جلوه است، چون از مکانی که او را حمل می‌کند و آسمانی که بر او سایه می‌افکند، خالی نیست. و اگر در مکانی هم نباشد، از اعضای خود و رعیت بدنش حیا می‌کند، زیرا او کاری را انجام نمی‌دهد مگر به واسطه آن‌ها. آن‌ها ابزارهای او هستند و ناگزیرند که شهادت دهند و شهادت داده می‌شوند. و خداوند جز عادل را به شهادت نمی‌طلبد. پس صاحب این حال هرگز نمی‌تواند در خلوت باشد. و کسی که حالش این باشد، به درجه بهائم (البهائم) پیوسته است. و دلیل بر این:\n\nاین است که از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در صحیح ذکر شده است که فرمود: «إن للميت جؤار أو إن السعيد منهم يقول قدموني قدموني (همانا برای مرده ناله‌ای است، یا همانا سعادتمند آنان می‌گوید: مرا پیش ببرید، مرا پیش ببرید)»؛ یعنی به سوی قبرش. «و إن الشقي منهم يقول إلى أين تذهبون بي (و همانا شقی آنان می‌گوید: مرا به کجا می‌برید).» و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داد که هر چیزی آن را می‌شنود جز انس و جن.\n\nپس تحت قول او «هر چیزی» شامل جماد، نبات و حیوانی می‌شود که آن مرده از کنارشان می‌گذرد. و ثابت شده است که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) سوار بر قاطری بود، از کنار قبری کهنه گذشت، قاطر رم کرد. فرمود: «او صاحب این قبر را می‌بیند که در قبرش عذاب می‌شود، به همین دلیل رم کرد.»\n\nو در شترش هنگام هجرت و ورود به مدینه، مهارش را رها کرد. برخی از صحابه خواستند آن را بگیرند، فرمود: «دعوها فإنها مأمورة (او را رها کنید، زیرا مأمور است).» و مأمور نمی‌شود مگر کسی که امر را تعقل کند، تا اینکه خود به خود در حیاط خانه ابی ایوب انصاری زانو زد و نزد او فرود آمد.\n\nو در صحیح فرمود: «إن المؤذن يشهد له مدى صوته من رطب ويابس (همانا مؤذن به اندازه صدای خود، از تر و خشک برای او شهادت می‌دهد).»\n\nو همه این‌ها با هر چیز دیگری مباین است. و این را از انس و جن جز افراد معدودی از این دو نوع شهادت نمی‌دهند. زیرا جن با انس در حد (تعریف) مشترک است، چون جن حیوان ناطق است، جز اینکه به دلیل پنهان بودن از دیدگان انس غالباً، به این نام اختصاص یافته است. پس آنان با انس مانند ظاهر انسان با باطن او هستند. و به همین دلیل خداوند متعال درباره غیر این دو نوع فرمود: وما من دَابَّةٍ في الْأَرْضِ ولا طائِرٍ يَطِيرُ بِجَناحَيْهِ إِلَّا أُمَمٌ أَمْثالُكُمْ (و هیچ جنبنده‌ای در زمین و هیچ پرنده‌ای که با دو بال خود پرواز می‌کند، نیست مگر امت‌هایی مانند شما). و امثال کسانی هستند که در صفات نفس مشترک‌اند، پس همه حیوان ناطق‌اند. سپس خداوند متعال درباره آنان فرمود: ثُمَّ إِلى‏ رَبِّهِمْ يُحْشَرُونَ (سپس به سوی پروردگارشان محشور می‌شوند)؛ یعنی همان‌گونه که شما محشور می‌شوید. و این همان قول اوست: وإِذَا الْوُحُوشُ حُشِرَتْ (و هنگامی که وحوش محشور شوند)؛ برای شهادت در روز فصل و قضاوت، تا خداوند میان آنان داوری کند، همان‌گونه که میان ما داوری می‌کند، پس حق شاخ‌ندار را از شاخ‌دار می‌گیرد، چنانکه وارد شده است. و این دلیلی است بر اینکه آنان از جانب خداوند مورد خطاب و تکلیف هستند، از جایی که ما نمی‌دانیم. خداوند متعال فرمود: وإِنْ من أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ (و هیچ امتی نیست مگر آنکه در آن بیم‌دهنده‌ای گذشته است). و امت و نذیر را نکره آورد. آنان از جمله امت‌ها هستند و نذیرشان ممکن است برای هر یک از آنان نذیری در ذاتش باشد، و ممکن است برای نوع از جنس خودش باشد. این امر ناگزیر است، از جایی که جز کسی که خداوند آن را بر او شهود کرده، نمی‌داند و شهود نمی‌کند. چنانکه درباره شیطان فرمود: إِنَّهُ يَراكُمْ هُوَ وقَبِيلُهُ من حَيْثُ لا تَرَوْنَهُمْ (او و قبیله‌اش شما را از جایی که آنان را نمی‌بینید، می‌بینند). و ذکر کرد که آنان به اولیای خود وحی می‌کنند تا با ما مجادله کنند. و مجادله‌کننده که ولی شیطان است، گمان می‌کند که آن از نفس خود و از نظر و علم اوست، در حالی که از وحی شیطان به اوست. اهل کشف (الکشف) آن را به عین می‌شناسند و با گوش‌های خود می‌شنوند، همان‌گونه که هر صدایی را می‌شنوند. و هیچ حیوانی نیست مگر آنکه این را شهادت می‌دهد. و به همین دلیل خداوند آنان را از ابلاغ آنچه شهود می‌کنند به ما، لال کرده است. پس آنان در حق ما امین به صورت حال هستند. و خداوند برای هیچ کس از نوع انسانی آنچه را که برای بهائم (البهائم) کشف (الکشف) می‌کند، آشکار نمی‌سازد، مگر زمانی که خداوند به او امانت دهد، و آن این است که آنچه را می‌بیند از دیگران بپوشاند، مگر به وحی از جانب خداوند برای تعریف. زیرا خداوند دیدگان و گوش‌های انس را در بیشتر موارد و فهم را در اصوات وزش بادها و صدای آب‌ها و هر صدادهنده‌ای نگرفته است، مگر برای اینکه این امر پوشیده بماند. پس اگر این مکاشف آن را فاش کند، حکمت وضع را باطل کرده است، مگر اینکه به او وحی شود که بخشی از آن را کشف (الکشف) کند. در این صورت، در افشای آن مقدار معذور است. و در این منزل از علوم، علم ثنای رحمان‌ها و علم کسی که شریک را اظهار می‌کند در حالی که به آن اعتقاد ندارد، وجود دارد؛ همان‌گونه که از موحدان کسی هست که شریک را نفی می‌کند در حالی که به آن اعتقاد دارد. و او کسی است که می‌بیند برخی از اسباب، کاری را به ذات خود انجام می‌دهند. و موحد در افعال می‌بیند که فاعلی جز خداوند نیست. مانند کسی که می‌گوید: اگر زاج و مازو جمع شوند و موانع طبیعی برطرف گردند، ناگزیر سیاهی که همان مرکب است، حاصل می‌شود، با وجود اینکه او موحد است. و موحد کسی است که ایجاد سیاهی را از خداوند می‌بیند، مانند اشاعره و امثال آنان. و [می‌گویند] امکان حکم می‌کند که اجتماع آن دو با برطرف شدن موانع طبیعی باشد، اما سیاهی حاصل نمی‌شود مگر اینکه خداوند آن رنگ را در آن خلق کند. این در مورد طبیعیون است. و اما در متکلمان موحد، آنان می‌گویند: اگر ناظر بر وجه دلیل دست یابد، مدلول به ضرورت حاصل می‌شود، با وجود اینکه میان وجه دلیل و مدلول فرق می‌گذارند. و این نزد عاقل سلیم صحیح نیست، زیرا ممکن است وجه دلیل حاصل شود و مدلول حاصل نشود. و نمی‌توانند بگویند که وجه دلیل همان عبارت از حصول مدلول است، زیرا آنان میان وجه دلیل و مدلول فرق می‌گذارند. اگر با ضرورت عادت، نه عقل، اضافه می‌کردند، اعتراضی بر آنان نبود، زیرا میان وجه دلیل و رؤیت در بیننده فرقی نیست، بلکه رؤیت کامل‌تر است. و ما با ایمان می‌دانیم که خداوند دیدگان ما را با وجود رؤیت در ما، از بسیاری از دیدنی‌ها که برای دیگران دیدنی است، گرفته است. پس مرئی به ضرورت حاصل نشده است، با وجود رؤیت و برطرف شدن موانعی که در این نشأت طبیعی خلل ایجاد می‌کند. و یک انسان چیزی را می‌بیند که دیگری نمی‌بیند، با وجود حضور مرئی برای هر دو و اشتراکشان در سلامت حس بینایی. پس این حجاب الهی است که طبیعت و کون در آن اثری ندارد. و این بسیار است. چه بسیار مشرکانی در ظاهر که در باطن موحدند و بالعکس. و در آن علم آجال (سرآمد عمرها) است، آنچه از آن دانسته می‌شود و آنچه دانسته نمی‌شود. و در آن علم چگونگی بودن خداوند در «أین»های مختلف به ذات خود است. و مثال آن مانند سفیدی در هر چیز سفید است، اگر بفهمی. زیرا خداوند متعال حکمی را درباره خود ذکر نکرده است که در موجودات مثلی برای آن نباشد. زیرا اگر چنین مثالی را ذکر می‌کرد، فایده تعریف حاصل نمی‌شد، جز اینکه بر برخی از اذهان دشوار می‌شد. پس کسی که موجودی را که عین آن حکم را دارد، برایش آشکار شود، می‌دانیم که او مخاطب خداوند به آن حکم است و نه دیگری. چنانکه خداوند متعال فرمود: لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ (آفرینش آسمان‌ها و زمین بزرگتر از آفرینش مردم است، ولی بیشتر مردم نمی‌دانند). پس برخی از مردم آنچه را که مراد از بزرگی در اینجا بوده، دانسته‌اند و برخی آن را نمی‌دانند. پس کسی که آن را شناخته، مخاطب این آیه است. و همین‌طور در هر خطاب، حتی در لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست)، با کسی خطاب کرده که نفی مثلیت را در اشیاء می‌داند. و در آن علم عموم تعلق علم الهی به معلومات است. و کسی که از ما حصر معلومات را در واجب، محال و ممکن در نفس‌الامر می‌داند، از وجه کلی عموم یافته است و فصل میان علما در نفس‌الامر که بر آن یکی از این احکام حکم شده، باقی مانده است. و در آن علم آنچه از ممکنات می‌آید، وجود دارد، و همه آن‌ها آیات هستند. پس کسی که از نظر در آیه بودن آن‌ها روی می‌گرداند، روی می‌گرداند. سبب روی‌گردانی یکی و عدم روی‌گردانی دیگری در آن چیست؟ و در آن علم کسی که در آنچه برایش روشن شده، شک می‌کند، وجود دارد. چه سببی او را به آن تشکیک می‌خواند؟ و در آن علم از کدام حقیقت الهی خداوند التباس را در عالم خلق کرده است؟ آیا به این دلیل بوده که او بر بندگانش در صور مختلف تجلی (التجلی) می‌کند که شناخته و انکار می‌شوند، با وجود اینکه او تعالی در ذات خود بر حقیقتی است که دگرگون نمی‌شود؟ و تجلی (التجلی) جز این‌گونه نیست. پس در عالم جز التباس نیست. و این به دلیل آن است که شارع خبر داده که مؤمن به صورت کافر ظاهر می‌شود و او سعادتمند است، و کافر به صورت مؤمن ظاهر می‌شود و او شقی است. پس بر هیچ کس به سعادت یا شقاوت قطع نمی‌شود، به دلیل التباس امر بر ما. پس این نزد ما التباس نیست، بلکه التباس آن است که بر شقاوت سعادتمند و بر سعادت شقی قطع کنیم. در آن هنگام امر بر ما مشتبه شده است. و اما اگر قطع نکنیم، چیزی بر ما مشتبه نشده است. و در آن علم این است که حکم برای رحمت در روز قیامت است و عدل از رحمت است. و روز قیامت روز عدل در قضاوت است. و رحمت تنها در قیامت می‌آید تا امر را شهود کند، تا زمانی که حکم عدل به پایان رسد و مدت آن در مورد محکوم‌علیه منقضی شود، رحمت حکم را در مورد او تا بی‌نهایت بر عهده می‌گیرد. و در آن علم آنچه برای خداست و آنچه برای خلق است، وجود دارد. و منظورم از آنچه برای خداست، این است که خالص است. و در آن علم وصف خالص به خداوند است که کسی که ابزار نیست، در آن شریک نمی‌شود. و در آن علم این است که چرا اسامی الهی با اختلاف معانی‌شان متعدد شده‌اند؟ آیا آن‌ها اسامی برای معانی زیرین خود هستند یا اسامی برای کسی هستند که آن معانی به او نسبت داده شده‌اند؟ و آیا آن معانی امور وجودی هستند یا نسبت‌هایی که وجود ندارند؟ و در آن علم انصاف و عدل در قضاوت‌ها و حکومت‌ها وجود دارد. و در آن علم آنچه از استحقاق پس از انقضای مدت حکمش بی‌نیاز می‌کند، وجود دارد. و معنای فلاح (رستگاری) در آن چیست؟ نفی آن از مستحق به عقوبت. و در آن علم انکار شریک توسط مشرک وجود دارد. آیا او در این کار وجهی به سوی صدق دارد یا از هر جهت دروغگوست؟ و این بدان سبب است که گوینده در حقیقت جز خداوند نیست. پس ناگزیر باید وجهی به سوی صدق داشته باشد که از آنجا نسبت داده می‌شود که قول خداست، اگرچه بر زبان مخلوق ظاهر شود. زیرا خداوند آن را بر زبان بنده‌اش گفته است. و در صحیح از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) وارد شده است که خداوند بر زبان بنده‌اش می‌گوید.\n\nو قرآن به این نطق کرده است. پس عین کلام مترجم، کلام کسی است که از او ترجمه می‌شود. و در آن علم آنچه احوال در کسی که بر او قائم شده‌اند، از احکام می‌دهند، وجود دارد. و در آن علم آنچه قطع به وقوع یکی از دو ممکن بدون دلیل نتیجه می‌دهد، وجود دارد. و در آن علم آنچه عارف صاحب کشف (الکشف) از فعل حق (الحق) که او را به خشم می‌آورد و آنچه او را به خشم نمی‌آورد، وجود دارد. و خشم از عمل باطن است، تا جایی که اگر در باطن خشمگین نشود و خشم را اظهار کند، حالش به نفاق نزدیک‌تر است تا به ایمان. و در آن علم تشویق به نفاق وجود دارد. آیا با تسلیم منافات دارد؟ و اگر صاحب تسلیم و صاحب مدارا جمع شوند، کدام یک از آن دو داناتر است؟ و در آن علم سبب مانع برای شنونده وجود دارد، هنگامی که ندا داده می‌شود و پاسخ نمی‌دهد. آیا گفته می‌شود که شنیده است یا گفته می‌شود که نشنیده است؟ و در آن علم ظلمت که همان کوری است و ضلال که همان حیرت است، وجود دارد. و در آن علم عموم حشر برای هر آنچه سرای دنیا در بر گرفته است، از معدن، نبات، حیوان، انس، جن، آسمان و زمین، وجود دارد. و در آن علم سببی که به توحید حق (الحق) سبحانه می‌خواند و با آن شرک ممکن نیست، وجود دارد. و آیا حکم بقا دارد تا حکم توحید باقی بماند یا بقا ندارد یا در حق قومی دون قوم دیگر باقی می‌ماند؟ و در آن علم عموم ایمان وجود دارد. و به همین دلیل سرانجام به رحمتی می‌انجامد که خداوند جز مؤمنان را رحم نمی‌کند. زیرا حکم عموم ایمان از رحمت است. و در آن علم بواده (ناگهانی بودن) و هجوم وجود دارد و برای آن بابی در احوال این کتاب است.\n\nو در آن علم کسی که علم را به تکلف به دست آورد و عالم نیست، اما به علم دست یافته است، وجود دارد. آیا گفته می‌شود که او عالم است یا نه؟ و در آن علم حب لله و بغض لله وجود دارد. آیا کسی که به خاطر خدا مورد بغض قرار گرفته، وجهی دارد که به خاطر خدا دوست داشته شود، همان‌گونه که از جانب خدا وجهی دارد که با وجود بغض در او، به او روزی داده شود؟ و در آن علم فایده تفصیل در مجمل وجود دارد. و در آن علم فطرت انسان بر عجله در امور، هنگامی که بر آن‌ها متمکن است، وجود دارد. و در آن علم غیوب وجود دارد، آنچه از آن دانسته می‌شود و آنچه دانسته نمی‌شود. و اسباب مجهول‌المسببات، از این جهت که برای این اسباب هستند، با وجود علم به آن‌ها و اسبابشان، مگر از این جهت که اسباب برای آن‌ها هستند. و در آن علم خداوند به شخصیت‌های عالم وجود دارد. و در آن علم وفات و بعث در دنیا و علم وفاتی که بعث از آن در آخرت است و انتقال به برزخ در دو مرگ وجود دارد. و در آن علم مراتب ارواح ملکی در عباداتشان وجود دارد. و در آن علم عموم نجات عالم، مشرک و غیر مشرک، وجود دارد. و این علمی غریب و مخصوص است که در قرآن بر آن تصریح شده و کسی متوجه آن نیست. و در آن علم سببی که موجب ترک فعل از قادر بر آن می‌شود، وجود دارد. و در آن علم این است که برای هر اسمی مسمایی است و از آن وجود مسمی در عین لازم نمی‌آید. و کدام مرتبه همه معلومات را به وجود فرا می‌گیرد، خواه معلوم محال‌الوجود باشد یا نباشد؟ و در آن علم آنچه از جزا برزخ می‌شود و عمل به آن جزای دیگری را نتیجه می‌دهد، وجود دارد. و در آن علم ارتداد وجود دارد. چرا باز می‌گردد؟ و آن جز سلوک به جلو نیست، همان‌گونه که می‌گوییم: خورشید در افزایش و کاهش روز بازگشت، در حالی که بازگشتی در کار نیست، بلکه بر راه خود است. آیا آن مانند نسخ در اشیاء است، که پایان مدت حکم و آغاز مدت حکم دیگری است و راه یکی است و در سالک بر آن بازگشتی از آن نیست؟ و در آن علم نفخ (دمیدن) و اختلاف احکام آن با احدیت عینش وجود دارد. و در آن علم مشاهده و فرق میان آن و علم نظر وجود دارد. و در آن علم استدلال وجود دارد. و در آن علم این است که برای هر علمی مردانی و برای هر مقامی سخنی است، و اگر گفته نشود، سخن حال است. و در آن علم کسی که خود را به کسی که تشبیه به او پذیرفته نیست، تشبیه می‌کند، وجود دارد. چه چیزی او را به این کار خوانده است؟ و در آن علم اعاده وجود دارد که بر صورت ابتداست، و اگر چنین نباشد، اعاده نیست. و در آن علم این است که آیا شیء می‌تواند محل ضد خود باشد یا نه؟ و در آن علم ایضاح مبهمات وجود دارد. و در آن علم حکم شب و روز و نسبت ولوج (درآمدن)، غشیان (پوشاندن) و تکویر (پیچیدن) به آن دو و جدید بودن و کهنه شدن آن دو وجود دارد. و در آن علم خارج کردن کثیر از واحد وجود دارد. و چگونه این صحیح نیست مگر به تدریج بر ترکیب طبیعی که جز با واحد ترکیب نمی‌شود؟ و در آن علم معنای استحالات (دگرگونی‌ها) در اشیاء وجود دارد. و در آن علم احکام وجود دارد. آیا هر حکمی بر کسی که متوجه او شده، صحیح است یا برخی از آن‌ها صحیح است و برخی صحیح نیست؟ و حاکم خداست، پس چگونه در هستی (الوجود) حکمی باشد که بر محکوم‌علیه صحیح نباشد؟ و در این مسئله ابهامی است، از این جهت که حکم به شریک در هستی (الوجود) ظاهر شده است، در حالی که این حکم باطل است اگر به خداوند نسبت داده شود، زیرا او تعالی در ملک خود شریکی ندارد. و در آن علم وسعت سخن در مورد خداوند وجود دارد و اینکه آن مهلت دادن الهی است، نه اهمال. و در آن علم آنچه نامگذاری تأثیر می‌گذارد و آنچه ترک آن تأثیر می‌گذارد، وجود دارد. و در آن علم آنچه این ابیات در بر گرفته‌اند، وجود دارد:\n\nجهل مرگ است، اما آن را نمی‌داند\nمگر کسی که نفس‌هایش با علم زنده شده است\nگره را در عقدی که با آن بسته شده، باز نمی‌کند\nمگر کسی که طناب‌هایش با تابیدن قوی شده است\nو تو باز نکرده‌ای، بلکه تو چنین گمان می‌کنی\nو هر که این را تخیل کند، نومیدی‌اش صحیح است\nهر که را خدا گمراه کند، هدایت‌کننده‌ای او را بینا نمی‌کند\nو او کسی است که در بی‌نیازی‌اش، فقرش صحیح است.\n\nو در آن علم آنچه تضعیف (دو برابر شدن) در آن واقع می‌شود، وجود دارد. و خداوند حَقَّ می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 7
}