{
  "id": 222,
  "title": {
    "ar": "الباب الثاني والعشرون ومائتان في معرفة الجمع وأسراره",
    "en": "Chapter Two Hundred and Twenty-Two, Concerning the Gnosis of the Synthesis (الجمع) and its Secrets.",
    "ur": "باب دو سو بائیس (۲۲۲) جمع (الجمع) کی معرفت اور اس کے اسرار کے بیان میں",
    "fa": "باب دویست و بیست و دوم در معرفت جمع و اسرار آن"
  },
  "content": {
    "ar": "## «الباب الثاني والعشرون ومائتان في معرفة الجمع وأسراره»\n\n\n> إذا سمعت بحق أو نظرت به *** فهو السميع البصير الواحد الأحد\n\n\n> وأنت لا فيه والأعيان قائمة *** والنفس والعقل والأرواح والجسد\n\n\n> فإن أخذت بجمع الجمع تصحبه *** به فأنت هناك السيد الصمد\n\n\n> وإن علمت بهذا واتصفت به *** حالا عليك جميع الأمر ينعقد\n\n\n### [ما المراد بالجمع‏]\n\n\nاعلم أن الجمع عند بعض الطائفة إشارة من أشار إلى حق بلا خلق وقال أبو علي الدقاق الجمع ما سلب عنك وقالت طائفة منهم الجمع ما أشهدك الحق من فعله بك حقيقة وقال قوم الجمع مشاهدة المعرفة وحجته إِيَّاكَ نَسْتَعِينُ وقال بعضهم الجمع إثبات الخلق قائما بالحق وجمع الجمع الفناء عن مشاهدة كل شي‏ء سوى الحق وقال بعضهم الجمع شهود الأغيار بالله وجمع الجمع الاستهلاك بالكلية وفناء الإحساس بما سوى الله عند غلبات الحقيقة وقال بعضهم الجمع مشاهدة تصريف الحق الكل ومن نظم القوم في الجمع والفرق‏\n\n\n> جمعت وفرقت عني به *** ففرط التواصل مثنى العدد\n\n\nفهذا قد ذكرنا بعض ما وصل إلينا من قولهم في الجمع وجمع الجمع والجمع عندنا أن تجمع ما له عليه مما وصفت به نفسك من نعوته وأسمائه وتجمع مالك عليك مما وصف الحق به نفسه من نعوتك وأسمائك فتكون أنت أنت وهو هو وجمع الجمع أن تجمع ما له عليه وما لك عليه وترجع الكل إليه وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ أَلا إِلَى الله تَصِيرُ الْأُمُورُ فما في الكون إلا أسماؤه ونعوته غير أن الخلق ادعوا بعض تلك الأسماء والنعوت ومشي الحق دعواهم في ذلك فخاطبهم بحسب ما ادعوه فمنهم من ادعى في الأسماء المخصوصة به تعالى في العرف ومنهم من ادعى في ذلك وفي النعوت الواردة في الشرع مما لا يليق عند علماء الرسوم إلا بالمحدثات وأما طريقنا فما ادعينا في شي‏ء من ذلك كله بل جمعناها عليه غير أنا نبهنا أن تلك الأسماء حكم آثار استعداد أعيان الممكنات فيه وهو سر خفي لا يعرفه إلا من عرف إن الله هو عين الوجود وأن أعيان الممكنات على حالها ما تغير عليها وصف في عينها ويكفي العاقل السليم العقل قولهم الجمع فإنه لفظ مؤذن بالكثرة والتمييز بين الأعيان الكثيرة فمن حيث التمييز كان الجمع عين التفرقة وليست التفرقة عين الجمع إلا تفرقة أشخاص الأمثال فإنه جمع وتفرقة معا وإن الحد والحقيقة بجمع الأمثال كالإنسانية وأشخاص ذلك النوع يتصفون بالتفرقة فزيد ليس بعمرو وإن كان كل واحد منهما إنسانا وهكذا جميع الأمثال وأشخاص النوع الواحد قال تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ على وجوه كثيرة قد علم الله ما يؤول إليه قول كل متاول في هذه الآية وأعلاها قولا أي ليس في الوجود شي‏ء يماثل الحق أو هو مثل للحق إذ الوجود ليس غير عين الحق فما في الوجود شي‏ء سواه يكون مثلا له أو خلافا هذا ما لا يتصور فإن قلت فهذه الكثرة المشهودة قلنا هي نسب أحكام استعدادات الممكنات في عين الوجود الحق والنسب ليست أعيانا ولا أشياء وإنما هي أمور عدمية بالنظر إلى حقائق النسب فإذا لم يكن في الوجود شي‏ء سواه فليس مثله شي‏ء لأنه ليس ثم فافهم‏\nوتحقق ما أشرنا إليه فإن أعيان الممكنات ما استفادت إلا الوجود والوجود ليس غير عين الحق لأنه يستحيل أن يكون أمرا زائدا ليس الحق لما يعطيه الدليل الواضح فما ظهر في الوجود بالوجود إلا الحق فالوجود الحق وهو واحد فليس ثم شي‏ء هو له مثل لأنه لا يصح أن يكون ثم وجودان مختلفان أو متماثلان فالجمع على الحقيقة كما قررناه أن تجمع الوجود عليه فيكون هو عين الوجود وتجمع حكم ما ظهر من العدد والتفرقة على أعيان الممكنات إنها عين استعداداتها فإذا علمت هذا فقد علمت معنى الجمع وجمع الجمع ووجود الكثرة وألحقت الأمور بأصولها وميزت بين الحقائق وأعطيت كل شي‏ء حكمه كما أعطى الحق كل شي‏ء خلقه فإن لم تفهم الجمع كما ذكرناه فما عندك خبر منه وأما إشارات الطائفة التي سردناها فإن لهم في ذلك مقاصد أذكرها إن شاء الله مع معرفتهم بما ذهبنا إليه أو معرفة الأكابر منهم وأما قول من قال منهم إن الجمع حق بلا خلق فهو ما ذهبنا إليه أن الحق هو عين الوجود غير أنه ما تعرض لما أعطته استعدادات أعيان الممكنات في وجود الحق حتى اتصف بما اتصفت به وأما قول الدقاق في الجمع إنه ما سلب عنك فإنه يقتضي مقامه أن يريد سلب ما وقعت فيه الدعوى منك وهو له كالتخلق بالأسماء الحسنى ونسبة الأفعال إليك وهي له هذا يعطيه حال الدقاق لا الكلام فإنه لو قال غيره هذه الكلمة ربما قالها على أنه يريد بقوله ما سلب عنك عين الوجود فإنه الذي سلب عنك إذ كان عين الوجود وأما قول الآخر إن الجمع ما أشهدك الحق من فعله بك حقيقة فإنه يريد أنك محل لجريان أفعاله والأمر في الحقيقة بالعكس بل هو المنعوت بحكم آثار استعدادات أعيان الممكنات فيه إلا أن يريد بقوله من فعله بك أي بك ظهر الفعل ولم يتعرض لذكر فيمن ظهر الأثر فقد يمكن أن يريد ذلك وهو ما ذهبنا إليه وما تعطيه الحقائق فلو علمنا من هو صاحب هذا القول حكمنا عليه بحاله كما حكمنا علي الدقاق لمعرفتنا بمقامه وحاله وأما قول من قال الجمع مشاهدة المعرفة\n\n\n### [أن المعرفة بالله يؤدى أن العبد عمل عملا صحيحا]\n\n\nفاعلم إن المعرفة بالله تعطي أن للعبد نسبة إلى العمل صحيحة أثبتها الحق ولذلك كلفه بالأعمال وللحق تعالى نسبة إلى العمل أثبتها الحق لنفسه وشرع لعبده أن يقول في عمله وإِيَّاكَ نَسْتَعِينُ وقال موسى كليم الله وأعلم الخلق بالله رسل الله فقال لقومه اسْتَعِينُوا بِاللَّهِ واصْبِرُوا ولا فرق عندنا بين ما يقوله الله أو يقوله رسول الله من نعت الله في الصحة والنسبة إليه وقال الله قسمت الصلاة بيني وبين عبدي‏\n\n\nثم فصل سبحانه وبين ما يقول العبد ويقول الله فنسب القول إلى العبد نسبة صحيحة والقول عمل وهو طلب العون من الله في عمله ذلك فصحت المشاركة في العمل فهذا قد جمعت في العمل بين الله وبين العبد فهذا معنى الجمع فقد قررت إن عين العبد مظهر بفتح الهاء وأن الظاهر هو عين الحق وأن الحق أيضا عين صفة العبد وبالصفة وجد العمل والظاهر هو العامل فإذا ليس العمل إلا لله خاصة قلنا وعند ما قررنا ما ذكرته قررنا أيضا أن عين العبد لها استعداد خاص مؤثر في الظاهر وهو الذي أدى إلى اختلاف الصور في الظاهر الذي هو عين الحق فذلك الاستعداد جعل الظاهر أن يقول وإِيَّاكَ نَسْتَعِينُ يخاطب ذلك الظاهر بأثر استعداد هذا العين المصلية حكم الاسم المعين أن يعينه على عمله فإن عين الممكن إذا كان استعداده يعطي عجزا وضعفا ظهر حكمه في الظاهر فقول الظاهر هو لسان عين الممكن بل قول الممكن بلسان الظاهر كما أخبر الحق أنه قال على لسان عبده سمع الله لمن حمده فأعطت المعرفة أن تجمع العمل على عامله لما وقع في ذلك من الدعاوي بما قد ذهب إليه أصحاب النظر القائلين بإضافة الأفعال إلى العباد مجردة والقائلين بإضافة الأفعال إلى الله مجردة والحق بين الطائفتين أي بين القولين فللعبد إلى العمل نسبة على صورة ما قررناها من أثر استعداد عين الممكن في الظاهر وللحق نسبة إلى العمل على صورة ما قررناه من قبول الظاهر لتأثير العين فيه فإن العبد قال على لسان أثره في الظاهر إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ وهذا مذهبنا في الجمع فإن كان صاحب القول في الجمع أراد أنه مشاهدة المعرفة ويعرف معنى مشاهدة المعرفة فهو على ما قلناه فنحن إنما تكلمنا على معنى مشاهدة المعرفة لا على مقام قائلها إذ لهذه اللفظة وجوه نازلة عما ذهبنا إليه في شرحها فشرحناها على أتم الوجوه وأكملها وهو الذي الأمر عليه في نفسه ومن أجل بعض تلك الوجوه اعترضنا على قائل هذه اللفظة في مختصر هذا الكتاب وإلى ما قررناه وذهبنا إليه في الجمع ترجع أقوال الجماعة التي ذكرناها وحكيناها في أول الباب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "Chapter 222: Concerning the Gnosis (المعرفة) of the Synthesis (الجمع) and its Secrets\n\nIf you hear by the Real (الحق) or look by Him,\nHe is the All-Hearing, the All-Seeing, the One, the Unique (الأحد).\nAnd you are not in Him, while the Fixed Entities (الأعيان) stand,\nAs do the soul (النفس), the intellect (العقل), the spirits (الأرواح), and the body (الجسد).\nBut if you grasp the Union of the Union (جمع الجمع) and accompany Him\nBy Him, then you are there the Master (السيد), the Eternal Refuge (الصمد).\nAnd if you know this and are characterized by it as a state (حالا),\nAll affairs will be bound up for you.\n\n### [What is meant by the Synthesis (الجمع)]\n\nKnow that the Synthesis (الجمع), according to some of the group (الطائفة), is an indication by one who points to the Real (الحق) without Creation (الخلق). Abu Ali al-Daqqaq said: The Synthesis (الجمع) is that which has been stripped away from you. A group of them said: The Synthesis (الجمع) is what the Real (الحق) makes you witness of His Act through you, in reality. Others said: The Synthesis (الجمع) is the witnessing (مشاهدة) of Gnosis (المعرفة). Their proof is: <<إِيَّاكَ نَسْتَعِينُ>> (You alone we ask for help). Some of them said: The Synthesis (الجمع) is the affirmation of Creation (الخلق) subsisting by the Real (الحق). And the Union of the Union (جمع الجمع) is annihilation (الفناء) from witnessing anything other than the Real. Others said: The Synthesis (الجمع) is the witnessing of the others (الأغيار) through Allah. And the Union of the Union (جمع الجمع) is complete consumption and the annihilation (فناء) of the sensation of anything other than Allah during the overwhelming moments of the Reality (الحقيقة). Others said: The Synthesis (الجمع) is the witnessing of the Real’s (الحق) disposal of the totality (الكل). And from the poetry of the group concerning the Synthesis (الجمع) and the Separation (الفرق):\n\nI synthesized and separated from myself by Him,\nSo the excess of connection is twice the number.\n\nWe have mentioned some of what has reached us concerning their sayings regarding the Synthesis (الجمع) and the Union of the Union (جمع الجمع). The Synthesis (الجمع) according to us is that you gather what belongs to Him upon Him—from what you have described yourself with of His attributes (نعوته) and Names (أسمائه)—and you gather what belongs to you upon you—from what the Real (الحق) has described Himself with of your attributes and Names. Thus, you are you, and He is He.\n\nThe Union of the Union (جمع الجمع) is that you gather what belongs to Him upon Him and what belongs to you upon you, and you return the totality (الكل) to Him: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ أَلا إِلَى الله تَصِيرُ الْأُمُورُ>> (And to Him the whole affair is returned. Indeed, to Allah all affairs return). For there is nothing in the Cosmos (الكون) except His Names and Attributes. However, Creation (الخلق) claimed some of those Names and Attributes, and the will of the Real allowed their claims in that regard. So He addressed them according to what they claimed. Some of them claimed the Names specifically reserved for Him in common usage, and some claimed those Names and the Attributes mentioned in the Law (الشرع) which, according to the scholars of external forms (علماء الرسوم), are only fitting for contingent things (المحدثات).\n\nAs for our path, we do not claim anything of that at all. Rather, we gather them upon Him. However, we point out that those Names are the ruling effects of the preparedness (استعداد) of the Fixed Entities (أعيان الممكنات) within Him. This is a hidden secret (سر خفي) known only by one who knows that Allah is the very Essence of Existence (عين الوجود) and that the Fixed Entities (أعيان الممكنات) remain in their state, with no change in their essence.\n\nThe sound intellect (العاقل السليم العقل) is satisfied by their saying, \"the Synthesis (الجمع),\" for it is a word that implies multiplicity (الكثرة) and distinction between the many entities (الأعيان الكثيرة). From the perspective of distinction, the Synthesis (الجمع) is the very essence of Separation (التفرقة). Yet Separation is not the essence of Synthesis, except for the separation of the individuals of the similitudes (أشخاص الأمثال), for that is Synthesis and Separation simultaneously. The limit (الحد) and the reality (الحقيقة) are in the synthesis of similitudes, such as humanity (الإنسانية), while the individuals of that species are characterized by separation. Thus, Zayd is not Amr, even though each of them is a human. This applies to all similitudes and individuals of a single species.\n\nAllah the Exalted said: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), in many ways. Allah knows what the interpretation of every interpreter of this verse leads to. The highest interpretation is: There is nothing in Existence (الوجود) that resembles the Real (الحق), or that is a similitude for the Real, since Existence is nothing other than the Essence of the Real (عين الحق). Thus, there is nothing in Existence besides Him that could be a similitude for Him or an opposite. This is inconceivable. If you ask, \"What then is this witnessed multiplicity (الكثرة المشهودة)?\" We say: It is the relations (نسب) of the rulings of the preparedness (استعدادات) of the contingent things (الممكنات) within the Essence of the True Existence (عين الوجود الحق). And relations are neither entities (أعيانا) nor things (أشياء). Rather, they are non-existent matters (أمور عدمية) when viewed in relation to the realities of the relations. Since there is nothing in Existence besides Him, there is nothing like Him, because there is no 'there' (ثم). So understand and realize what we have indicated.\n\nThe Fixed Entities (أعيان الممكنات) gained nothing but Existence (الوجود), and Existence is nothing other than the Essence of the Real (عين الحق), because it is impossible for it to be an added matter separate from the Real, as clear proof dictates. Thus, nothing has appeared in Existence through Existence except the Real. Existence is the Real (الوجود الحق), and He is One. Therefore, there is nothing that is a similitude for Him, because it is not possible for there to be two existences, whether different or similar.\n\nThe Synthesis (الجمع), in reality, as we have established, is that you gather Existence upon Him, so that He is the very Essence of Existence (عين الوجود). And you gather the ruling of the manifested number and separation upon the Fixed Entities (أعيان الممكنات), that they are the very essence of their preparedness (استعداداتها). If you know this, you have known the meaning of the Synthesis (الجمع), the Union of the Union (جمع الجمع), and the existence of multiplicity (الكثرة), and you have returned matters to their origins, distinguished between the realities (الحقائق), and given everything its ruling, just as the Real gave everything its creation (خلقه). If you do not understand the Synthesis as we have mentioned, you have no knowledge of it.\n\nAs for the indications of the group (الطائفة) that we listed, they have intentions in that regard, which I shall mention, God willing, along with their knowledge of what we have adopted, or the knowledge of the elders among them.\n\nAs for the saying of the one who claimed that the Synthesis (الجمع) is the Real (الحق) without Creation (الخلق), this is what we have adopted: that the Real is the very Essence of Existence (عين الوجود). However, he did not address what the preparedness (استعدادات) of the Fixed Entities (أعيان الممكنات) bestowed upon the Existence of the Real, such that He was characterized by what they were characterized by.\n\nAs for Al-Daqqaq’s saying that the Synthesis (الجمع) is what has been stripped away from you, his station (مقامه) implies that he means the stripping away of the claim that originated from you, which belongs to Him—such as being characterized by the Beautiful Names (الأسماء الحسنى) and attributing acts to yourself when they belong to Him. This is what Al-Daqqaq’s state (حال) dictates, not merely the words. For if someone else said this phrase, he might mean by \"what has been stripped away from you\" the very Essence of Existence (عين الوجود), for that is what has been stripped away from you, since it is the Essence of Existence.\n\nAs for the saying of the other that the Synthesis (الجمع) is what the Real (الحق) makes you witness of His Act through you, in reality, he means that you are the locus (محل) for the flow of His Acts. But the matter is, in reality, the reverse. Rather, He is the one characterized by the ruling of the effects of the preparedness (استعدادات) of the Fixed Entities (أعيان الممكنات) within Him. Unless he means by \"His Act through you\" that the Act appeared *by* you, and he did not address the question of *in whom* the effect appeared. It is possible that he means this, and this is what we have adopted and what the realities (الحقائق) dictate. If we knew who the author of this saying was, we would judge him by his state, just as we judged Al-Daqqaq, due to our knowledge of his station (مقامه) and state (حاله).\n\nAs for the saying of the one who claimed the Synthesis (الجمع) is the witnessing of Gnosis (مشاهدة المعرفة):\n\n### [That Gnosis (المعرفة) of Allah leads to the servant performing a sound action]\n\nKnow that Gnosis (المعرفة) of Allah dictates that the servant (العبد) has a sound relation (نسبة) to the action, which the Real (الحق) established. That is why He obligated him with actions. And the Exalted Real has a relation to the action, which the Real established for Himself, and He legislated for His servant to say in his action: <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help). Moses, the Speaker of God (كليم الله) and the most knowledgeable of creation concerning Allah—the Messengers of God—said to his people: <<اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا>> (Seek help through Allah and be patient). There is no difference for us between what Allah says or what the Messenger of Allah says concerning the description of Allah, in terms of soundness and relation to Him.\n\nAllah said: \"I have divided the prayer between Myself and My servant.\" Then He detailed and clarified what the servant says and what Allah says. So He attributed the saying to the servant with a sound attribution, and the saying is an action. It is the seeking of help from Allah in that action of his. Thus, the partnership in the action is sound. This is the Synthesis (الجمع) in action between Allah and the servant.\n\nThis is the meaning of the Synthesis (الجمع). I have established that the essence of the servant (عين العبد) is the locus of manifestation (مظهر), and that the Manifested (الظاهر) is the very Essence of the Real (عين الحق), and that the Real is also the very essence of the servant’s attribute (صفة العبد). And by the attribute, the action came into existence, and the Manifested is the Actor. If so, is the action exclusively for Allah?\n\nWe say: Alongside what we have established, we also established that the essence of the servant has a specific preparedness (استعداد خاص) that influences the Manifested (الظاهر). This is what led to the difference in forms in the Manifested, which is the very Essence of the Real. That preparedness caused the Manifested to say: <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help), addressing that Manifested by the effect of the preparedness of this praying entity (العين المصلية), so that the ruling of the specific Name (الاسم المعين) assists him in his action. For if the essence of the contingent thing (عين الممكن) has a preparedness that dictates incapacity and weakness, its ruling appears in the Manifested. The saying of the Manifested is the tongue of the essence of the contingent thing. Rather, it is the saying of the contingent thing by the tongue of the Manifested, just as the Real informed that He said upon the tongue of His servant: \"Allah hears the one who praises Him.\"\n\nThus, Gnosis (المعرفة) dictated that the action be synthesized upon its Actor, due to the claims that arose regarding it by the people of speculation (أصحاب النظر)—those who hold that actions are attributed solely to the servants, and those who hold that actions are attributed solely to Allah. The Real is between the two groups, meaning between the two sayings. The servant has a relation to the action in the manner we established, derived from the effect of the preparedness of the Fixed Entity (عين الممكن) in the Manifested. And the Real has a relation to the action in the manner we established, derived from the Manifested’s acceptance of the influence of the Entity within it. For the servant said, upon the tongue of his effect in the Manifested: <<إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ>> (You alone we worship, and You alone we ask for help).\n\nThis is our doctrine concerning the Synthesis (الجمع). If the author of the saying concerning the Synthesis intended that it is the witnessing of Gnosis (مشاهدة المعرفة) and knows the meaning of the witnessing of Gnosis, then he is in agreement with what we have said. We have only discussed the meaning of the witnessing of Gnosis, not the station of the one who said it, since this phrase has lower aspects than what we have adopted in its explanation. We have explained it according to its most complete and perfect aspects, which is the reality of the matter itself. It is because of some of those lower aspects that we objected to the author of this phrase in the summary of this book. The sayings of the group that we mentioned and recounted at the beginning of the chapter all return to what we have established and adopted concerning the Synthesis (الجمع). <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو بائیس: جمع (الجمع) اور اس کے اسرار کی معرفت میں\n\nجب تم حق (الحق) کے ذریعے سنو یا اس کے ذریعے دیکھو\nتو وہی سننے والا، دیکھنے والا، واحد، اور یکتا (الأحد) ہے\n\nاور تم اس میں نہیں ہو جبکہ اعیان (الأعیان)، نفس، عقل، ارواح اور جسم قائم ہیں\nپس اگر تم جمع الجمع (جمع الجمع) کو اس کے ساتھ لے کر چلو\nتو تم وہاں سید (سردار) اور بے نیاز (الصمد) ہو\n\nاور اگر تم نے یہ جان لیا اور اس حال سے متصف ہو گئے\nتو تمام معاملہ تم پر ہی آ کر مکمل ہو جاتا ہے\n\n[جمع (الجمع) سے کیا مراد ہے؟]\n\nجان لو کہ بعض صوفی گروہوں کے نزدیک جمع (الجمع) اس شخص کا اشارہ ہے جو خلق (الخلق) کے بغیر صرف حق (الحق) کی طرف اشارہ کرتا ہے۔ اور ابو علی الدقاق نے کہا: جمع وہ ہے جو تم سے سلب کر لیا جائے۔ اور ایک گروہ نے کہا: جمع وہ ہے جس کا حق (الحق) تمہیں اپنے فعل کے ذریعے حقیقت میں مشاہدہ کرائے۔ اور کچھ لوگوں نے کہا: جمع معرفت (المعرفۃ) کا مشاہدہ ہے، اور اس کی دلیل یہ ہے: إِيَّاكَ نَسْتَعِينُ (ہم صرف تجھ ہی سے مدد مانگتے ہیں)۔ اور بعض نے کہا: جمع، خلق (الخلق) کو حق (الحق) کے ساتھ قائم ثابت کرنا ہے۔ اور جمع الجمع (جمع الجمع) حق (الحق) کے سوا ہر شے کے مشاہدے سے فنا (الفناء) ہو جانا ہے۔ اور بعض نے کہا: جمع، اغیار (غیروں) کا اللہ کے ذریعے شہود (الشہود) ہے۔ اور جمع الجمع (جمع الجمع) کلی طور پر فنا (الفناء) ہو جانا اور حقیقت (الحقیقۃ) کے غلبے کے وقت اللہ کے سوا ہر چیز کے احساس سے فنا ہو جانا ہے۔ اور بعض نے کہا: جمع، حق (الحق) کے تمام تصرفات کا مشاہدہ ہے۔ اور قوم کے اشعار میں جمع اور فرق (التفرقۃ) کے بارے میں یہ ہے:\n\nمیں نے اس کے ذریعے اپنے آپ سے جمع کیا اور فرق کیا\nپس وصل کی زیادتی دوگنی تعداد میں ہے\n\nیہ وہ کچھ ہے جو ہمیں ان کے قول سے جمع (الجمع) اور جمع الجمع (جمع الجمع) کے بارے میں پہنچا۔ اور ہمارے نزدیک جمع (الجمع) یہ ہے کہ تم وہ سب جمع کرو جو اس (حق) کا تم پر ہے، ان صفات اور اسماء میں جن سے تم نے خود کو متصف کیا ہے، اور وہ سب جمع کرو جو تمہارا اس (حق) پر ہے، ان صفات اور اسماء میں جن سے حق (الحق) نے خود کو تمہاری صفات اور اسماء سے متصف کیا ہے، پس تم تم ہو اور وہ وہ ہے۔ اور جمع الجمع (جمع الجمع) یہ ہے کہ تم وہ سب جمع کرو جو اس کا تم پر ہے اور جو تمہارا اس پر ہے، اور سب کو اسی کی طرف لوٹا دو، اور إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ أَلا إِلَى الله تَصِيرُ الْأُمُورُ (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں، خبردار! تمام امور اللہ ہی کی طرف رجوع کرتے ہیں)۔\n\nپس کائنات میں اس کے اسماء اور صفات کے سوا کچھ نہیں ہے، مگر یہ کہ خلق (الخلق) نے ان اسماء اور صفات میں سے بعض کا دعویٰ کیا، اور حق (الحق) نے اس دعوے کو چلنے دیا، پس اس نے ان سے ان کے دعوے کے مطابق خطاب کیا۔ ان میں سے بعض نے ان اسماء کا دعویٰ کیا جو عرف میں صرف اللہ تعالیٰ کے لیے مخصوص ہیں، اور بعض نے ان اسماء اور ان صفات کا دعویٰ کیا جو شریعت میں وارد ہیں اور جو علماء رسوم کے نزدیک صرف محدثات (نئی پیدا شدہ چیزوں) کے لیے ہی مناسب ہیں۔ لیکن ہمارا طریقہ یہ ہے کہ ہم نے ان میں سے کسی چیز کا دعویٰ نہیں کیا، بلکہ ہم نے ان سب کو اسی (حق) پر جمع کر دیا ہے۔ البتہ ہم نے یہ تنبیہ کی ہے کہ یہ اسماء درحقیقت اس (حق) میں اعیان ممکنات (أعیان الممكنات) کے استعدادات کے آثار کا حکم ہیں۔ اور یہ ایک پوشیدہ راز ہے جسے صرف وہی جانتا ہے جو یہ جانتا ہے کہ اللہ ہی عین وجود (عین الوجود) ہے، اور یہ کہ اعیان ممکنات (أعیان الممكنات) اپنی حالت پر ہیں، ان کی عینیت میں کوئی صفت تبدیل نہیں ہوئی ہے۔\n\nعاقل سلیم العقل کے لیے قوم کا یہ قول کافی ہے کہ جمع (الجمع) ایک ایسا لفظ ہے جو کثرت اور کثیر اعیان (الأعیان) کے درمیان امتیاز کی خبر دیتا ہے۔ پس امتیاز کے لحاظ سے جمع (الجمع) عین تفرقہ (التفرقۃ) ہے، لیکن تفرقہ (التفرقۃ) عین جمع (الجمع) نہیں ہے، سوائے امثال (مثالوں) کے اشخاص کے تفرقے کے، کیونکہ وہ بیک وقت جمع اور تفرقہ ہے۔ اور حد اور حقیقت امثال (مثالوں) کے جمع ہونے سے ہوتی ہے، جیسے انسانیت، اور اس نوع کے اشخاص تفرقہ (التفرقۃ) سے متصف ہوتے ہیں، پس زید، عمرو نہیں ہے، اگرچہ ان میں سے ہر ایک انسان ہے۔ اور اسی طرح تمام امثال اور ایک ہی نوع کے اشخاص ہیں۔ اللہ تعالیٰ نے فرمایا: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس کے جیسا کوئی شے نہیں ہے)۔ یہ کئی وجوہ پر ہے، اور اللہ ہر تاویل کرنے والے کے قول کے انجام کو جانتا ہے۔ ان میں سب سے اعلیٰ قول یہ ہے کہ وجود (الوجود) میں کوئی شے حق (الحق) کے مماثل نہیں ہے، یا وہ حق کے لیے مثال نہیں ہے، کیونکہ وجود (الوجود) عین حق (عین الحق) کے سوا کچھ نہیں ہے۔ پس وجود میں اس کے سوا کوئی شے نہیں ہے جو اس کے لیے مثال ہو یا اس کے خلاف ہو۔ یہ ایک ناقابل تصور بات ہے۔ اگر تم کہو کہ یہ مشہود کثرت کیا ہے؟ ہم کہیں گے کہ یہ عین وجود حق (عین الوجود الحق) میں ممکنات کے استعدادات کے احکام کی نسبتیں ہیں۔ اور نسبتیں نہ تو اعیان (أعیان) ہیں اور نہ ہی اشیاء، بلکہ نسبتوں کی حقیقتوں کے لحاظ سے وہ عدمی امور ہیں۔ پس جب وجود میں اس کے سوا کوئی شے نہیں ہے، تو اس کے جیسا کوئی شے نہیں ہے، کیونکہ وہاں (اس کے سوا) کچھ نہیں ہے۔ پس سمجھو!\n\nاور اس کی تحقیق کرو جس کی طرف ہم نے اشارہ کیا ہے، کیونکہ اعیان ممکنات (أعیان الممكنات) نے صرف وجود (الوجود) سے فائدہ اٹھایا ہے، اور وجود (الوجود) عین حق (عین الحق) کے سوا کچھ نہیں ہے، کیونکہ یہ محال ہے کہ وہ کوئی زائد امر ہو جو حق (الحق) نہ ہو، جیسا کہ واضح دلیل اسے ثابت کرتی ہے۔ پس وجود (الوجود) میں وجود کے ذریعے حق (الحق) کے سوا کوئی ظاہر نہیں ہوا۔ پس وجود حق (الوجود الحق) ہے، اور وہ واحد ہے۔ پس وہاں کوئی شے نہیں ہے جو اس کی مثال ہو، کیونکہ یہ درست نہیں کہ وہاں دو مختلف یا مماثل وجود ہوں۔ پس حقیقت میں جمع (الجمع)، جیسا کہ ہم نے مقرر کیا ہے، یہ ہے کہ تم وجود (الوجود) کو اس پر جمع کر دو، پس وہ عین وجود (عین الوجود) ہو جائے، اور تم عدد اور تفرقہ (التفرقۃ) کے ظاہر ہونے کے حکم کو اعیان ممکنات (أعیان الممكنات) پر جمع کر دو کہ وہ ان کے استعدادات کی عینیت ہیں۔ پس جب تم نے یہ جان لیا تو تم نے جمع (الجمع) اور جمع الجمع (جمع الجمع) کا معنی جان لیا، اور کثرت کا وجود جان لیا، اور تم نے امور کو ان کی اصلوں سے ملا دیا، اور حقائق کے درمیان امتیاز کیا، اور ہر شے کو اس کا حکم دیا، جیسا کہ حق (الحق) نے ہر شے کو اس کی تخلیق (خلق) عطا کی۔ اگر تم جمع (الجمع) کو اس طرح نہیں سمجھے جیسا کہ ہم نے ذکر کیا ہے، تو تمہیں اس کی کوئی خبر نہیں ہے۔\n\nاور جہاں تک ان گروہوں کے اشارات کا تعلق ہے جنہیں ہم نے بیان کیا ہے، تو ان کے اس میں مقاصد ہیں جنہیں میں ان شاء اللہ ذکر کروں گا، اس کے ساتھ کہ وہ ہمارے مسلک کو جانتے ہیں یا ان کے اکابر اسے جانتے ہیں۔ اور جہاں تک ان کے اس قول کا تعلق ہے کہ جمع (الجمع) حق (الحق) بلا خلق (الخلق) ہے، تو یہ وہی ہے جو ہمارا مسلک ہے کہ حق (الحق) ہی عین وجود (عین الوجود) ہے، مگر یہ کہ اس نے اس چیز کا ذکر نہیں کیا جو اعیان ممکنات (أعیان الممكنات) کے استعدادات نے وجود حق (وجود الحق) میں عطا کی، یہاں تک کہ وہ اس سے متصف ہو گیا جس سے وہ متصف ہوا۔ اور جہاں تک جمع (الجمع) کے بارے میں دقاق کے اس قول کا تعلق ہے کہ یہ وہ ہے جو تم سے سلب کر لیا جائے، تو اس کا مقام یہ تقاضا کرتا ہے کہ وہ اس چیز کے سلب کرنے کا ارادہ کرے جس کا دعویٰ تم نے کیا ہے جبکہ وہ اس (حق) کا ہے، جیسے اسماء حسنیٰ سے متصف ہونا اور افعال کو اپنی طرف منسوب کرنا جبکہ وہ اس (حق) کے ہیں۔ یہ دقاق کا حال تقاضا کرتا ہے نہ کہ کلام۔ کیونکہ اگر کوئی اور یہ کلمہ کہتا تو شاید وہ اس سے عین وجود (عین الوجود) کے سلب ہونے کا ارادہ کرتا، کیونکہ وہی تم سے سلب کیا گیا ہے جب وہ عین وجود تھا۔ اور جہاں تک دوسرے کے اس قول کا تعلق ہے کہ جمع (الجمع) وہ ہے جس کا حق (الحق) تمہیں اپنے فعل کے ذریعے حقیقت میں مشاہدہ کرائے، تو وہ یہ ارادہ کرتا ہے کہ تم اس کے افعال کے جاری ہونے کا محل ہو، جبکہ حقیقت میں معاملہ اس کے برعکس ہے۔ بلکہ وہ (حق) ہی اعیان ممکنات (أعیان الممكنات) کے استعدادات کے آثار کے حکم سے اس میں متصف ہوتا ہے۔ مگر یہ کہ وہ اپنے قول \"من فعله بك\" (تمہارے ذریعے اس کا فعل) سے یہ ارادہ کرے کہ فعل تمہارے ذریعے ظاہر ہوا، اور اس نے یہ ذکر نہیں کیا کہ اثر کس میں ظاہر ہوا، تو ممکن ہے کہ وہ یہی ارادہ کر رہا ہو، اور یہی ہمارا مسلک ہے اور یہی حقائق عطا کرتی ہیں۔ اگر ہم اس قول کے قائل کو جانتے تو ہم اس کے حال پر حکم لگاتے، جیسا کہ ہم نے دقاق پر اس کے مقام اور حال کی معرفت کی وجہ سے حکم لگایا۔\n\n[یہ کہ اللہ کی معرفت (المعرفۃ) اس بات کی طرف لے جاتی ہے کہ بندے نے صحیح عمل کیا]\n\nجان لو کہ اللہ کی معرفت (المعرفۃ) یہ عطا کرتی ہے کہ بندے کا عمل سے ایک صحیح نسبت ہے جسے حق (الحق) نے ثابت کیا ہے، اور اسی لیے اس نے اسے اعمال کا مکلف بنایا ہے۔ اور حق تعالیٰ کی عمل سے ایک نسبت ہے جسے حق نے اپنے لیے ثابت کیا ہے، اور اپنے بندے کے لیے یہ مشروع کیا ہے کہ وہ اپنے عمل میں کہے: إِيَّاكَ نَسْتَعِينُ (ہم صرف تجھ ہی سے مدد مانگتے ہیں)۔ اور اللہ کے کلیم اور مخلوق میں اللہ کو سب سے زیادہ جاننے والے، اللہ کے رسولوں میں سے ایک، موسیٰ علیہ السلام نے اپنی قوم سے فرمایا: اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا (اللہ سے مدد مانگو اور صبر کرو)۔ اور ہمارے نزدیک اس میں کوئی فرق نہیں ہے جو اللہ کہے یا اللہ کا رسول اللہ کی صفت کے بارے میں کہے، صحت اور اس کی طرف نسبت کے لحاظ سے۔ اور اللہ نے فرمایا: \"میں نے نماز کو اپنے اور اپنے بندے کے درمیان تقسیم کر دیا ہے۔\"\n\nپھر اس نے پاک ذات نے تفصیل بیان کی اور واضح کیا کہ بندہ کیا کہتا ہے اور اللہ کیا کہتا ہے۔ پس اس نے بندے کی طرف قول کی نسبت صحیح طور پر کی، اور قول ایک عمل ہے، اور وہ اس عمل میں اللہ سے مدد طلب کرنا ہے۔ پس عمل میں شراکت صحیح ثابت ہوئی، تو یہ تم نے عمل میں اللہ اور بندے کے درمیان جمع (الجمع) کر دیا۔ یہ جمع (الجمع) کا معنی ہے۔ میں نے یہ مقرر کیا ہے کہ بندے کی عینیت (عین) مَظہَر (ظاہر ہونے کی جگہ) ہے، اور ظاہر ہونے والا عین حق (عین الحق) ہے۔ اور حق (الحق) بھی بندے کی صفت کی عینیت ہے، اور صفت کے ذریعے عمل وجود میں آیا، اور ظاہر ہونے والا ہی عامل ہے۔ پس جب عمل صرف اللہ کے لیے خاص ہے، تو ہم نے کہا: اور جب ہم نے وہ مقرر کیا جو تم نے ذکر کیا، تو ہم نے یہ بھی مقرر کیا کہ بندے کی عینیت (عین) کا ایک خاص استعداد ہے جو ظاہر ہونے والے میں مؤثر ہے، اور یہی وہ چیز ہے جو ظاہر ہونے والے میں صورتوں کے اختلاف کا سبب بنی جو کہ عین حق (عین الحق) ہے۔ پس اس استعداد نے ظاہر ہونے والے کو یہ کہنے پر مجبور کیا: إِيَّاكَ نَسْتَعِينُ (ہم صرف تجھ ہی سے مدد مانگتے ہیں)۔ وہ ظاہر ہونے والا اس عین (بندے) کے استعداد کے اثر سے خطاب کرتا ہے جو نماز پڑھ رہا ہے، تاکہ ایک معین اسم کے حکم کے مطابق وہ اس کے عمل میں اس کی مدد کرے۔ کیونکہ جب ممکن کی عینیت (عین الممكن) کا استعداد عجز اور ضعف عطا کرتا ہے، تو اس کا حکم ظاہر ہونے والے میں ظاہر ہوتا ہے۔ پس ظاہر ہونے والے کا قول، عین ممکن (عین الممكن) کی زبان ہے، بلکہ ممکن کا قول ظاہر ہونے والے کی زبان سے ہے، جیسا کہ حق (الحق) نے خبر دی کہ اس نے اپنے بندے کی زبان سے کہا: \"سمع الله لمن حمده\" (اللہ نے اس کی سن لی جس نے اس کی تعریف کی)۔\n\nپس معرفت (المعرفۃ) نے یہ عطا کیا کہ تم عمل کو اس کے عامل پر جمع کر دو، کیونکہ اس میں ان نظریاتی لوگوں کی طرف سے دعوے کیے گئے تھے جو افعال کو صرف بندوں کی طرف منسوب کرنے کے قائل تھے، اور ان لوگوں کی طرف سے جو افعال کو صرف اللہ کی طرف منسوب کرنے کے قائل تھے۔ اور حق (الحق) دونوں گروہوں کے درمیان ہے، یعنی دونوں اقوال کے درمیان ہے۔ پس بندے کی عمل سے ایک نسبت ہے، اس صورت پر جو ہم نے ممکن کی عینیت (عین الممكن) کے ظاہر ہونے والے میں اثر سے مقرر کی، اور حق (الحق) کی عمل سے ایک نسبت ہے، اس صورت پر جو ہم نے ظاہر ہونے والے کے عین (بندے) کے اثر کو قبول کرنے سے مقرر کی۔ کیونکہ بندے نے اپنے اثر کی زبان سے ظاہر ہونے والے میں کہا: إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ (ہم صرف تیری ہی عبادت کرتے ہیں اور صرف تجھ ہی سے مدد مانگتے ہیں)۔ اور یہی جمع (الجمع) میں ہمارا مسلک ہے۔ پس اگر جمع (الجمع) کے قائل نے یہ ارادہ کیا کہ یہ معرفت (المعرفۃ) کا مشاہدہ ہے اور وہ معرفت کے مشاہدے کا معنی جانتا ہے، تو وہ ہمارے قول پر ہے۔ پس ہم نے معرفت کے مشاہدے کے معنی پر کلام کیا ہے نہ کہ اس کے قائل کے مقام پر، کیونکہ اس لفظ کے کئی ایسے پہلو ہیں جو ہماری بیان کردہ شرح سے کم تر ہیں۔ پس ہم نے اس کی شرح مکمل ترین اور کامل ترین پہلو پر کی ہے، اور حقیقت میں معاملہ اسی پر ہے۔ اور ان میں سے بعض پہلوؤں کی وجہ سے ہم نے اس کتاب کے مختصر میں اس لفظ کے قائل پر اعتراض کیا تھا۔ اور جو کچھ ہم نے جمع (الجمع) کے بارے میں مقرر کیا اور ہمارا مسلک ہے، اسی کی طرف ان تمام گروہوں کے اقوال لوٹتے ہیں جنہیں ہم نے باب کے شروع میں ذکر کیا اور بیان کیا۔ اور وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے)۔",
    "fa": "«باب دویست و بیست و دوم در معرفت جمع و اسرار آن»\n\nاگر به حق بشنوی یا به او بنگری *** اوست شنوا، بینا، یگانه، یکتا (الواحد الأحد)\nو تو در او نیستی، در حالی که اعیان (الأعيان)، نفس، عقل، ارواح و جسد برپایند.\nپس اگر به جمع الجمع (جمع الجمع) روی آوری و با او همراه شوی *** تو در آنجا سرور و بی‌نیاز (الصمد) هستی.\nو اگر این را بدانی و به آن متصف شوی *** در آن حال، تمام کارها بر تو گره می‌خورد (حل می‌شود).\n\n### [مراد از جمع چیست؟]\n\nبدان که جمع (الجمع) نزد برخی از طایفه (صوفیه) اشاره کسی است که به حق (الحق) بدون خلق (الخلق) اشاره کرده است. و ابوعلی دقاق گفت: جمع آن است که از تو سلب شود. و گروهی از ایشان گفتند: جمع آن است که حق (الحق) تو را به حقیقتِ فعل خود که به واسطه تو انجام می‌دهد، شاهد گرداند. و قومی گفتند: جمع، شهود معرفت (المعرفة) است و دلیل آن آیه «إِيَّاكَ نَسْتَعِينُ» (تنها از تو یاری می‌جوییم) است. و برخی گفتند: جمع، اثبات خلق (الخلق) است در حالی که به حق (الحق) قائم است؛ و جمع الجمع (جمع الجمع)، فنا (الفناء) از مشاهده هر چیزی جز حق است. و برخی گفتند: جمع، شهود اغیار (غیرها) به واسطه خداست؛ و جمع الجمع (جمع الجمع)، استهلاک کلی و فنای احساس به هر آنچه غیر خداست، هنگام غلبه‌های حقیقت (الحقیقة) است. و برخی گفتند: جمع، مشاهده تصریف (گرداندن) حق (الحق) بر کل است. و از اشعار این قوم در باب جمع و فرق (الفرق):\n\nجمع کردی و فرق انداختی از من به واسطه او *** پس افراط در پیوستگی، دو برابر عدد است.\n\nاین بود برخی از آنچه از سخنان ایشان درباره جمع (الجمع) و جمع الجمع (جمع الجمع) به ما رسیده است. و جمع (الجمع) نزد ما آن است که آنچه را که حق (الحق) بر تو دارد، از صفات و اسم‌هایی که خود را به آن‌ها وصف کرده‌ای، جمع کنی؛ و آنچه را که تو بر حق داری، از صفات و اسم‌هایی که حق خود را به آن‌ها وصف کرده است، جمع کنی؛ در نتیجه تو، تو باشی و او، او باشد. و جمع الجمع (جمع الجمع) آن است که آنچه را که حق بر تو دارد و آنچه را که تو بر حق داری، جمع کنی و همه را به او بازگردانی: «وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ» (و همه کارها به او بازگردانده می‌شود)؛ «أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ» (آگاه باشید که امور به سوی خدا بازمی‌گردد). پس در هستی (الکون) جز اسماء و صفات او نیست، جز اینکه خلق (الخلق) برخی از آن اسماء و صفات را ادعا کردند. و حق (الحق) ادعای ایشان را در این باره پذیرفت و بر اساس آنچه ادعا کردند، با آنان سخن گفت. پس برخی از ایشان در اسم‌هایی که در عرف مخصوص خداوند متعال است، ادعا کردند؛ و برخی در آن و نیز در صفاتی که در شرع آمده و نزد علمای رسوم جز برای موجودات حادث (المحدثات) شایسته نیست، ادعا کردند. اما روش ما این است که در هیچ یک از این‌ها ادعایی نکردیم، بلکه همه را بر او جمع کردیم؛ جز اینکه ما متذکر شدیم که آن اسماء، حکم آثار استعداد اعیان ممکنات (أعيان الممكنات) در اوست. و این رازی پنهان است که جز کسی که دانسته باشد خداوند عین هستی (الوجود) است و اعیان ممکنات (أعيان الممكنات) بر حال خود هستند و وصفی در عین آن‌ها تغییر نکرده است، آن را نمی‌شناسد. و برای عاقل سلیم‌العقل، همین قول ایشان که «جمع» است، کافی است؛ زیرا این لفظی است که به کثرت و تمییز میان اعیان کثیر دلالت می‌کند. پس از جهت تمییز، جمع (الجمع) عین تفرقه (التفرقة) است؛ و تفرقه عین جمع نیست، مگر تفرقه اشخاص امثال (مانندها)؛ زیرا این هم جمع است و هم تفرقه. و حد و حقیقت (الحقيقة) به جمع امثال است، مانند انسانیت؛ و اشخاص آن نوع به تفرقه متصف می‌شوند؛ پس زید، عمرو نیست، اگرچه هر دوی آن‌ها انسان هستند. و همین‌طور است همه امثال و اشخاص نوع واحد. خداوند متعال فرمود: «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست) بر وجوه بسیاری که خداوند می‌داند قول هر تأویل‌کننده‌ای در این آیه به کجا می‌انجامد. و بالاترین قول آن است که: در هستی (الوجود) چیزی نیست که با حق (الحق) مماثل باشد یا مثل حق باشد؛ زیرا هستی (الوجود) چیزی جز عین حق نیست. پس در هستی چیزی جز او نیست که مثل یا خلاف او باشد؛ این چیزی است که قابل تصور نیست. اگر بگویی: پس این کثرت مشهود چیست؟ می‌گوییم: این‌ها نسبت‌های احکام استعدادات ممکنات در عین هستی حق (الوجود الحق) است؛ و نسبت‌ها نه اعیان هستند و نه اشیاء، بلکه امور عدمی هستند به اعتبار حقایق نسبت‌ها. پس اگر در هستی چیزی جز او نباشد، چیزی مانند او نیست، زیرا در آنجا [غیر او] وجود ندارد. پس بفهم.\n\nو آنچه را که به آن اشاره کردیم، محقق ساز؛ زیرا اعیان ممکنات (أعيان الممكنات) جز هستی (الوجود) را کسب نکرده‌اند، و هستی چیزی جز عین حق (الحق) نیست؛ زیرا محال است که امری زائد بر حق باشد، به دلیل آنچه برهان واضح اقتضا می‌کند. پس در هستی (الوجود) به واسطه هستی جز حق (الحق) ظاهر نشده است. پس هستی، حق است و او واحد است؛ بنابراین چیزی نیست که مثل او باشد، زیرا صحیح نیست که دو هستی متفاوت یا مماثل وجود داشته باشد. پس جمع (الجمع) بر حقیقت، همان‌طور که مقرر کردیم، این است که هستی (الوجود) را بر او جمع کنی تا او عین هستی باشد؛ و حکم آنچه از عدد و تفرقه ظاهر شده است را بر اعیان ممکنات (أعيان الممكنات) جمع کنی که آن‌ها عین استعداداتشان هستند. پس اگر این را دانستی، معنای جمع (الجمع) و جمع الجمع (جمع الجمع) و وجود کثرت را دانستی و امور را به اصولشان ملحق کردی و میان حقایق (الحقائق) تمییز نهادی و به هر چیزی حکم آن را دادی، همان‌طور که حق (الحق) به هر چیزی خلقتش را داد. و اگر جمع (الجمع) را آن‌گونه که ذکر کردیم، نفهمیدی، خبری از آن نداری. اما اشارات طایفه‌ای که برشمردیم، ایشان در آن مقاصدی دارند که اگر خدا بخواهد، آن‌ها را ذکر خواهم کرد، همراه با معرفت ایشان به آنچه ما بدان معتقدیم، یا معرفت بزرگان ایشان. و اما قول کسی از ایشان که گفت: جمع (الجمع)، حق (الحق) بدون خلق (الخلق) است، همان چیزی است که ما بدان معتقدیم که حق عین هستی (الوجود) است؛ جز اینکه او متعرض آنچه استعدادات اعیان ممکنات (أعيان الممكنات) در هستی حق (وجود الحق) به او داده‌اند، نشده است تا به آنچه متصف شده، متصف گردد. و اما قول دقاق درباره جمع (الجمع) که «آن است که از تو سلب شود»، مقام او اقتضا می‌کند که مرادش سلب آنچه ادعای آن از تو شده و در واقع از آنِ اوست، باشد؛ مانند تخلق به اسماء حسنی و نسبت دادن افعال به تو در حالی که آن‌ها از آنِ اوست. این را حال دقاق اقتضا می‌کند، نه صرف کلام. زیرا اگر دیگری این کلمه را می‌گفت، شاید منظورش از «آنچه از تو سلب شود»، عین هستی (الوجود) بود؛ زیرا اوست که از تو سلب شده، چرا که او عین هستی است. و اما قول دیگری که گفت: جمع (الجمع) آن است که حق (الحق) تو را به حقیقتِ فعل خود که به واسطه تو انجام می‌دهد، شاهد گرداند؛ او می‌خواهد بگوید که تو محل جریان افعال او هستی. در حالی که امر در حقیقت برعکس است؛ بلکه اوست که به حکم آثار استعدادات اعیان ممکنات (أعيان الممكنات) در او، منعوت شده است. مگر اینکه مرادش از «فعل خود که به واسطه تو انجام می‌دهد» این باشد که فعل به واسطه تو ظاهر شده است و متعرض ذکر اینکه اثر در چه کسی ظاهر شده، نشده باشد. در این صورت ممکن است مرادش همان چیزی باشد که ما بدان معتقدیم و حقایق (الحقائق) آن را اقتضا می‌کند. پس اگر می‌دانستیم صاحب این قول کیست، بر اساس حال او حکم می‌کردیم، همان‌طور که بر دقاق حکم کردیم، به دلیل معرفت ما به مقام و حال او. و اما قول کسی که گفت: جمع (الجمع)، شهود معرفت (المعرفة) است:\n\n### [اینکه معرفت به خدا منجر به انجام عمل صحیح توسط بنده می‌شود]\n\nپس بدان که معرفت (المعرفة) به خدا اقتضا می‌کند که بنده (العبد) نسبت صحیحی به عمل داشته باشد که حق (الحق) آن را اثبات کرده است، و به همین دلیل او را به اعمال مکلف ساخت. و حق تعالی نیز نسبتی به عمل دارد که حق آن را برای خود اثبات کرده است و برای بنده خود تشریع کرد که در عملش بگوید: «وَإِيَّاكَ نَسْتَعِينُ» (و تنها از تو یاری می‌جوییم). و موسی، کلیم‌الله و داناترین خلق به خدا، که از رسولان خدا بود، به قومش گفت: «اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا» (از خدا یاری جویید و صبر کنید). و نزد ما فرقی نیست میان آنچه خدا می‌گوید یا رسول خدا درباره وصف خدا از جهت صحت و نسبت دادن به او می‌گوید. و خداوند فرمود: «نماز را میان خود و بنده ام تقسیم کردم.» (حدیث قدسی) سپس خداوند سبحان تفصیل داد و بیان کرد که بنده چه می‌گوید و خدا چه می‌گوید. پس قول را به بنده نسبت صحیحی داد، و قول، عمل است و آن طلب یاری از خدا در آن عمل است. پس مشارکت در عمل صحیح شد. اینجاست که در عمل میان خدا و بنده جمع (الجمع) کردی؛ پس این معنای جمع است. ما مقرر کردیم که عین بنده (العبد) مَظهَر (محل ظهور) است و ظاهر (الظاهر) عین حق (الحق) است؛ و حق نیز عین صفت بنده است. و به واسطه صفت، عمل یافت می‌شود و ظاهر، عامل است. پس اگر عمل فقط از آنِ خداست، می‌گوییم: هنگامی که آنچه را ذکر کردی مقرر کردیم، این را نیز مقرر کردیم که عین بنده استعداد خاصی دارد که در ظاهر (الظاهر) مؤثر است و همین امر منجر به اختلاف صورت‌ها در ظاهر شده است که آن ظاهر، عین حق است. پس آن استعداد باعث شد که ظاهر بگوید: «وَإِيَّاكَ نَسْتَعِينُ» (و تنها از تو یاری می‌جوییم)؛ آن ظاهر را به واسطه اثر استعداد این عین نمازگزار، مخاطب قرار می‌دهد که حکم اسم معین این است که او را بر عملش یاری دهد. زیرا اگر عین ممکن، استعدادش عجز و ضعف را اقتضا کند، حکم آن در ظاهر (الظاهر) آشکار می‌شود. پس قول ظاهر، زبان عین ممکن است؛ بلکه قول ممکن به زبان ظاهر است، همان‌طور که حق (الحق) خبر داد که بر زبان بنده خود فرمود: «سمع الله لمن حمده» (خداوند شنید سخن کسی را که او را ستایش کرد). پس معرفت (المعرفة) اقتضا کرد که عمل را بر عاملش جمع کنی، به دلیل ادعاهایی که در این باره رخ داده است؛ از جمله آنچه اصحاب نظر بدان معتقدند که افعال را صرفاً به بندگان نسبت می‌دهند، و کسانی که افعال را صرفاً به خدا نسبت می‌دهند. و حق (الحق) میان این دو طایفه، یعنی میان این دو قول است. پس بنده (العبد) نسبتی به عمل دارد، به صورتی که ما مقرر کردیم، از اثر استعداد عین ممکن در ظاهر (الظاهر)؛ و حق (الحق) نسبتی به عمل دارد، به صورتی که ما مقرر کردیم، از پذیرش ظاهر برای تأثیر عین در آن. زیرا بنده (العبد) به زبان اثر خود در ظاهر (الظاهر) گفت: «إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ» (تنها تو را می‌پرستیم و تنها از تو یاری می‌جوییم). و این مذهب ما در جمع (الجمع) است. پس اگر صاحب این قول در باب جمع (الجمع) اراده کرده که آن شهود معرفت (مشاهدة المعرفة) است و معنای شهود معرفت را می‌داند، پس بر همان چیزی است که ما گفتیم. ما تنها درباره معنای شهود معرفت (مشاهدة المعرفة) سخن گفتیم، نه درباره مقام گوینده آن؛ زیرا این لفظ وجوهی دارد که پایین‌تر از آن چیزی است که ما در شرح آن بدان معتقدیم. پس ما آن را بر کامل‌ترین و تمام‌ترین وجوه شرح دادیم، و این همان چیزی است که امر در نفس خود بر آن است. و به خاطر برخی از آن وجوه بود که ما در مختصر این کتاب بر گوینده این لفظ اعتراض کردیم. و اقوال گروهی که در ابتدای باب ذکر و حکایت کردیم، به آنچه ما در باب جمع (الجمع) مقرر کردیم و بدان معتقدیم، بازمی‌گردد. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}