{
  "id": 145,
  "title": {
    "ar": "الباب الخامس والأربعون ومائة في معرفة مقام ترك الفكر وأسراره",
    "en": "Chapter One Hundred and Forty-Five: On the Gnosis (معرفة) of the Station (مقام) of Abandoning Intellection (الفكر) and its Secrets (أسرار).",
    "ur": "باب ایک سو پینتالیس: فکر کو ترک کرنے کے مقام اور اس کے اسرار کی معرفت میں",
    "fa": "باب صد و چهل و پنجم در معرفت مقام ترک تفکر (الفکر) و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الخامس والأربعون ومائة في معرفة مقام ترك الفكر وأسراره)\n\n\n> ترك التفكر تسليم لخالقه *** فلا تفكر فإن الفكر معلول‏\n\n\n> إن لم تفكر تكن روحا مطهرة *** جليس حق على الأذكار مجبول‏\n\n\n> إن لم تفكر تكن روحا مطهرة *** مثل الملائك لم يحجبك تفصيل‏\n\n\n> عن الإله الذي يعطي مواهبه *** جودا وذاك الذي يعطيه تنزيل‏\n\n\n> إما لقاء أو إلقاء فتعلمه *** أو الكتابة أعطتها التفاصيل‏\n\n\n> فبالتفكر ووكلنا لأنفسنا *** لولاه ما كان إشراك وتعطيل‏\n\n\n> إن التفكر أمر قد خصصت به *** لأنني جامع والجمع تحصيل‏\n\n\n> لصورة الحق والأسماء أجمعها *** وكل عين فما في الحق تبديل‏\n\n\n> وفي المواطن كلفنا بخدمته *** أنت بذلك إخبار وتنزيل‏\n\n\n### [الرجال الذين أرادوا بترك الفكر رفع اللبس عنهم فيما يريدون العلم به‏]\n\n\nالتاركون للفكر رجال أرادوا رفع اللبس عنهم فيما يريدون العلم به ليلحقوا بوراثة من قيل فيه وما يَنْطِقُ عَنِ الْهَوى‏ وبما فطر عليه من فطر من المخلوقات كالملائكة ومن شاء الله من المخلوقين الذين فطروا على العلم بالله والوحي إليهم ابتداء من الله وعناية بهم ولأن الأفكار محل الغلط\n\n\n### [التفكر جولان إما في المخلوقات وإما في الخالق وكلاهما غير مأمون العواقب‏]\n\n\nوالطائفة الأخرى نزحت إلى ترك التفكر لأن التفكر جولان في أحد أمرين إما في المخلوقات وإما في الإله وأعلى درجات جولانه في المخلوقات أن يتخذها دليلا والمدلول يضاد الدليل فلا يجتمع دليل ومدلوله عند الناظر أبدا فرأوا ترك التفكر والاشتغال بالذكر إذ هما مشروعان فإنه لو مات في حال الفكر في الآيات لمات في غير الله وإن كان يطلبها لله ولكن لا يكون له مشهود إلا هي وإن كان جولانه في الإله ليتخذه دليلا على المخلوقات والكائنات كما يراه بعضهم فقد طلبه لغيره وهو سوء أدب مع الله حيث ما قصد النظر فيه إلا ليدله على حكم الكائنات ولو استندت إليه فما طلبه لعينه وإن ظن أنه يجول بفكره فيه ليتخذه دليلا عليه فهذا غلط بين فإنه لا ينظر فيه إلا وهو عالم به فإن نظر فيه بمعنى هل يصح أن يكون دليلا على نفسه فهذا غاية الجهل فإنه لا شي‏ء أدل من الشي‏ء على نفسه‏\n\n\n### [علوم الفكر بكل وجه لا تقوم مقام علوم الذكر والوهب‏]\n\n\nفلما رأوا مثل هذا النظر تركوه فإذا تفكر من هذه صفته كان مثل الذي بشكر الخلق لإحسانهم فشكرهم عبادة لأن الله أمر بشكرهم كذلك أمرهم بالتفكر فيتفكرون فيما أمرهم أو عين لهم أن يتفكروا فيه امتثالا لأمره ويكون ما ينتجه من العلم في حكم التبع لأن علوم الفكر بكل وجه ما تقوم مقام علوم الذكر والوحي والوهب الإلهي في الرفعة والمكانة انتهى الجزء الثاني ومائة\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "## (Chapter 145: On the Knowledge of the Station of Abandoning Contemplation and its Secrets)\n\nAbandoning contemplation is submission to its Creator,\nSo do not contemplate, for contemplation is flawed.\n\nIf you do not contemplate, you become a purified spirit,\nA companion of the Real (الحق), naturally inclined toward Remembrance (الأذكار).\n\nIf you do not contemplate, you become a purified spirit,\nLike the angels; no detail will veil you.\n\nFrom the God who grants His gifts generously,\nAnd that which He grants is Revelation (تنزيل).\n\nEither a direct encounter (لقاء) or an inspiration (إلقاء) by which you learn it,\nOr the writing (الكتابة) which the details have granted.\n\nThrough contemplation (تفكر), we were entrusted to ourselves;\nWere it not for it, there would be no association (إشراك) or negation (تعطيل).\n\nContemplation is a matter with which I have been specially endowed,\nBecause I am a comprehensive being (جامع), and comprehensiveness is the attainment.\n\nOf the form of the Real (صورة الحق) and all the Names (الأسماء);\nAnd every entity (عين) is such that there is no alteration in the Real (الحق).\n\nAnd in the stations (المواطن), we were charged with His service;\nYou are informed of this by narration (إخبار) and Revelation (تنزيل).\n\n### [The Men Who Sought to Remove Ambiguity by Abandoning Contemplation Regarding What They Wish to Know]\n\nThose who abandon contemplation (الفكر) are men who desired the removal of ambiguity (اللبس) concerning what they wish to know, so that they might attain the inheritance of him concerning whom it was said: <<وَمَا يَنْطِقُ عَنِ الْهَوَى>> (Nor does he speak from [his own] inclination). And [so that they might attain] what those creatures were naturally disposed toward, such as the angels and whomever God wills among the creatures who were created upon the knowledge of God and to whom revelation (الوحي) comes directly from God, as a special providence (عناية) for them. This is because thoughts (الأفكار) are the locus of error.\n\n### [Contemplation is a Roving, Either in Creation or in the Creator, and Both are Unsafe in Consequence]\n\nThe other group (الطائفة) inclined toward abandoning contemplation because contemplation is a roving (جولان) in one of two matters: either in the creatures (المخلوقات) or in the Divine (الإله). The highest degree of its roving in the creatures is to take them as a proof (دليل). Yet, the proven object (المدلول) is contrary to the proof, so the proof and the proven object never coincide in the view of the observer.\n\nTherefore, they saw fit to abandon contemplation and occupy themselves with Remembrance (الذكر), as both are legislated (مشروعان). For if one were to die while contemplating the signs (الآيات), he would die in something other than God, even if he sought them for God's sake; yet, his witnessed object (مشهود) would be nothing but those signs.\n\nIf his roving is in the Divine (الإله) to take Him as a proof for the creatures and existents (الكائنات), as some see it, then he has sought Him for the sake of something else. This is ill-manners (سوء أدب) toward God, since he only intended to look upon Him so that He might guide him to the ruling concerning the existents, even if they rely upon Him. Thus, he did not seek Him for His own sake (لعينه).\n\nAnd if he thinks that he roves with his thought concerning Him in order to take Him as a proof for Himself, this is a manifest error (غلط بين). For one does not look upon Him unless he already knows Him. If he looks upon Him with the meaning of whether it is valid for Him to be a proof for Himself, this is the height of ignorance, for nothing is a clearer proof of a thing than the thing itself.\n\n### [The Sciences of Contemplation in Every Aspect Do Not Take the Place of the Sciences of Remembrance and Divine Bestowal]\n\nWhen they saw such a mode of observation, they abandoned it. If one whose characteristic is this contemplates, he is like one who thanks creation for their kindness; their thanks is an act of worship because God commanded them to thank them. Likewise, He commanded them to contemplate, so they contemplate what He commanded them or designated for them to contemplate, in compliance with His command. And the knowledge that results from it is in the category of a secondary matter (التبع), because the sciences derived from contemplation (علوم الفكر), in every aspect, do not attain the rank and station (المكانة) of the sciences derived from Remembrance (الذكر), Revelation (الوحي), and Divine Bestowal (الوهب الإلهي).\n\nEnd of the 102nd Section.\n\nIn the Name of God, the Most Compassionate, the Most Merciful.",
    "ur": "(باب ایک سو پینتالیس: مقام ترک الفکر (ترك الفكر) اور اس کے اسرار کی معرفت میں)\n\nتفکر (التفكر) کو ترک کرنا اپنے خالق کے سامنے تسلیم ہونا ہے،\nپس تفکر نہ کر، کیونکہ فكر (الفكر) علت زدہ ہے۔\n\nاگر تو تفکر نہ کرے تو ایک پاکیزہ روح بن جائے گا،\nجو حق (الحق) کا ہم نشین ہو اور اذکار (الأذكار) پر جبلت یافتہ ہو۔\n\nاگر تو تفکر نہ کرے تو ایک پاکیزہ روح بن جائے گا،\nفرشتوں کی مانند، تجھے کوئی تفصیل حجاب میں نہیں ڈالے گی،\n\nاس معبود سے جو اپنی بخششیں عطا کرتا ہے،\nسخاوت کے طور پر، اور جو کچھ وہ عطا کرتا ہے وہ تنزیل (تنزيل) ہے۔\n\nیا تو لقاء (ملاقات) یا القاء (دل میں ڈالنا)، پس تو اسے جان لیتا ہے،\nیا وہ کتابت جسے تفصیلات نے عطا کیا ہے۔\n\nپس تفکر کے ذریعے ہمیں ہمارے نفسوں کے سپرد کر دیا گیا،\nاگر یہ نہ ہوتا تو شرک (إشراك) اور تعطیل (تعطيل) نہ ہوتی۔\n\nبے شک تفکر ایک ایسا امر ہے جس کے لیے میں مخصوص کیا گیا ہوں،\nکیونکہ میں جامع (جامع) ہوں، اور جمع (الجمع) حصول ہے۔\n\nصورت حق (الحق) اور تمام اسماء (الأسماء) کا،\nاور ہر عین (عين) کا، کیونکہ حق (الحق) میں کوئی تبدیلی نہیں۔\n\nاور مقامات (المواطن) میں ہمیں اس کی خدمت کا مکلف بنایا گیا،\nتو اس بارے میں اخبار (إخبار) اور تنزیل (تنزيل) ہے۔\n\n### [وہ رجال جنہوں نے ترک فكر (ترك الفكر) کے ذریعے ان امور سے ابہام دور کرنے کا ارادہ کیا جن کا وہ علم چاہتے ہیں]\n\nتفکر (الفكر) کو ترک کرنے والے وہ رجال ہیں جنہوں نے ان امور سے ابہام دور کرنے کا ارادہ کیا جن کا وہ علم چاہتے ہیں، تاکہ وہ اس ہستی کی وراثت سے ملحق ہو جائیں جس کے بارے میں کہا گیا ہے: \"اور وہ اپنی خواہش سے نہیں بولتے\" (وَمَا يَنطِقُ عَنِ الْهَوَىٰ) [النجم: 3]۔ اور اس فطرت سے ملحق ہو جائیں جس پر مخلوقات میں سے بعض کو پیدا کیا گیا ہے، جیسے فرشتے، اور اللہ کی مخلوقات میں سے وہ جنہیں اللہ نے چاہا، جو اللہ کے علم اور ان کی طرف وحی کے لیے فطرت پر پیدا کیے گئے، جو اللہ کی طرف سے ابتداء اور ان پر عنایت ہے۔ اور اس لیے بھی کہ افکار (الأفكار) غلطی کا مقام ہیں۔\n\n### [تفکر (التفكر) ایک جولان ہے، یا تو مخلوقات میں یا خالق میں، اور دونوں کے نتائج غیر محفوظ ہیں]\n\nاور دوسرا گروہ تفکر (التفكر) کو ترک کرنے کی طرف مائل ہوا، کیونکہ تفکر دو میں سے ایک امر میں جولان (گھومنا) ہے: یا تو مخلوقات میں یا معبود (الإله) میں۔ اور مخلوقات میں اس کے جولان کا اعلیٰ درجہ یہ ہے کہ وہ انہیں دلیل بنائے، اور مدلول (جس پر دلیل قائم کی جائے) دلیل کی ضد ہوتا ہے، لہٰذا ناظر کے نزدیک دلیل اور اس کا مدلول کبھی جمع نہیں ہو سکتے۔ پس انہوں نے تفکر کو ترک کرنا اور ذکر (الذكر) میں مشغول ہونا بہتر سمجھا، کیونکہ یہ دونوں مشروع ہیں۔ کیونکہ اگر وہ آیات میں فکر کی حالت میں مر گیا تو وہ غیر اللہ میں مرا، اگرچہ وہ انہیں اللہ کے لیے ہی طلب کر رہا تھا، لیکن اس کا مشہود (الشہود) صرف وہی آیات ہوں گی۔ اور اگر اس کا جولان معبود (الإله) میں ہو تاکہ وہ اسے مخلوقات اور کائنات پر دلیل بنائے، جیسا کہ بعض لوگ اسے دیکھتے ہیں، تو اس نے اسے غیر کے لیے طلب کیا، اور یہ اللہ کے ساتھ سوء ادب ہے، کیونکہ اس نے اس میں نظر کا قصد صرف اس لیے کیا تاکہ وہ اسے کائنات کے حکم پر دلالت کرے۔ اگرچہ کائنات اس پر ہی منحصر ہو، لیکن اس نے اسے اس کی ذات کے لیے طلب نہیں کیا۔ اور اگر وہ یہ گمان کرے کہ وہ اپنے فکر کے ذریعے اس میں جولان کر رہا ہے تاکہ اسے اس پر دلیل بنائے، تو یہ واضح غلطی ہے، کیونکہ وہ اس میں نظر نہیں کرتا مگر اس حال میں کہ وہ اسے جانتا ہے۔ پس اگر وہ اس معنی میں نظر کرے کہ کیا یہ درست ہے کہ وہ اپنی ذات پر دلیل ہو سکتا ہے؟ تو یہ جہالت کی انتہا ہے، کیونکہ کوئی بھی چیز اپنی ذات پر اس سے زیادہ دلالت کرنے والی نہیں ہو سکتی۔\n\n### [علوم الفكر (علوم الفكر) کسی بھی صورت میں علوم الذکر (علوم الذكر) اور وہب (الوهب) کا مقام نہیں لے سکتے]\n\nپس جب انہوں نے اس طرح کی نظر کو دیکھا تو اسے ترک کر دیا۔ پس جب کوئی شخص جس کی یہ صفت ہو، تفکر کرتا ہے، تو وہ اس شخص کی مانند ہوتا ہے جو لوگوں کے احسان پر ان کا شکر ادا کرتا ہے۔ پس ان کا شکر ادا کرنا عبادت ہے، کیونکہ اللہ نے ان کا شکر ادا کرنے کا حکم دیا ہے۔ اسی طرح اللہ نے انہیں تفکر کا حکم دیا، پس وہ اس چیز میں تفکر کرتے ہیں جس کا اللہ نے انہیں حکم دیا یا ان کے لیے متعین کیا کہ وہ اس میں تفکر کریں، اس کے حکم کی تعمیل میں۔ اور جو علم اس سے پیدا ہوتا ہے وہ تابع کے حکم میں ہوتا ہے، کیونکہ علوم الفكر (علوم الفكر) کسی بھی صورت میں رفعت اور مقام میں علوم الذکر (علوم الذكر)، وحی (الوحي) اور وہب الٰہی (الوهب الإلهي) کا مقام نہیں لے سکتے۔\n\nایک سو دو حصوں کا اختتام ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "باب صد و چهل و پنجم در معرفت مقام ترک تفکر و اسرار آن\n\nترک تفکر، تسلیم به خالق است؛ پس تفکر مکن، زیرا تفکر علیل (ناقص) است.\nاگر تفکر نکنی، روحی پاک خواهی بود؛ همنشین حق که بر اذکار سرشته شده است.\nاگر تفکر نکنی، روحی پاک خواهی بود؛ مانند فرشتگان که تفصیل (جزئیات) تو را محجوب نمی‌سازد.\nاز آن معبودی که مواهب خود را می‌بخشد؛ از روی جود، و آنچه او می‌بخشد، تنزیل (وحی) است.\nیا لقاء است یا القاء که آن را می‌آموزی؛ یا کتابتی که تفصیلات آن را داده است.\nپس به واسطه تفکر، ما به خودمان واگذار شدیم؛ اگر تفکر نبود، شرک و تعطیل (انکار صفات الهی) وجود نداشت.\nهمانا تفکر امری است که به آن اختصاص یافته‌ام؛ زیرا من جامع هستم و جمع، تحصیل است.\nبرای صورت حق و تمامی اسماء؛ و هر عین (ذات) که در حق تبدیلی نیست.\nو در مواطن (مقامات)، به خدمت او مکلف شدیم؛ تو با این، اخبار و تنزیل هستی.\n\n### [مردانی که با ترک تفکر، قصد رفع ابهام از آنچه می‌خواهند بدانند، داشتند]\n\nترک‌کنندگان تفکر، مردانی هستند که خواستند ابهام از آنچه می‌خواهند بدانند، از ایشان برداشته شود تا به وراثت کسی ملحق شوند که درباره‌اش گفته شده است: «و از روی هوی و هوس سخن نمی‌گوید» (وَمَا يَنْطِقُ عَنِ الْهَوَىٰ). و نیز به آنچه مخلوقاتی چون فرشتگان و هر که خدا بخواهد، بر آن سرشته شده‌اند؛ کسانی که بر معرفت حق و وحی مستقیم از جانب خداوند و عنایت او سرشته شده‌اند. و این بدان سبب است که افکار، جایگاه خطا هستند.\n\n### [تفکر، جولانی است یا در مخلوقات یا در خالق، و عواقب هر دو نامطمئن است]\n\nو گروه دیگر به ترک تفکر روی آوردند، زیرا تفکر جولانی است در یکی از دو امر: یا در مخلوقات یا در حق (الإله). و بالاترین درجه جولان در مخلوقات این است که آن‌ها را دلیل قرار دهد، در حالی که مدلول (آنچه دلیل بر آن است) با دلیل متضاد است؛ پس دلیل و مدلولش هرگز نزد ناظر جمع نمی‌شوند. از این رو، ترک تفکر و اشتغال به ذکر را برگزیدند، زیرا هر دو مشروع هستند. اگر کسی در حال تفکر در آیات (مخلوقات) بمیرد، در غیر خدا مرده است، هرچند که آن را برای خدا می‌طلبد، اما مشهود (آنچه مشاهده می‌کند) برای او جز آن آیات نخواهد بود. و اگر جولان او در حق (الإله) باشد تا آن را دلیلی بر مخلوقات و کائنات قرار دهد، چنانکه برخی می‌پندارند، در این صورت آن را برای غیر او طلبیده است و این سوء ادب با حق است؛ زیرا قصد نظر در او را نداشته مگر برای اینکه او را بر حکم کائنات دلالت کند، حتی اگر کائنات به او استناد کنند. پس او حق را برای ذاتش نطلبیده است. و اگر گمان کند که با فکرش در او جولان می‌کند تا او را دلیلی بر خودش (حق) قرار دهد، این خطایی آشکار است؛ زیرا او در حق نظر نمی‌کند مگر در حالی که به او عالم است. و اگر به این معنا در او نظر کند که آیا صحیح است که حق دلیلی بر خودش باشد، این نهایت جهل است؛ زیرا هیچ چیز دلالت‌کننده‌تر از شیء بر خودش نیست.\n\n### [علوم تفکر به هیچ وجه جایگزین علوم ذکر و موهبت نمی‌شوند]\n\nپس چون چنین نظری را دیدند، آن را ترک کردند. اگر کسی با این صفت تفکر کند، مانند کسی است که به خاطر احسان مردم، از آن‌ها تشکر می‌کند؛ پس شکر آن‌ها عبادت است، زیرا خداوند به شکر آن‌ها امر کرده است. همچنین خداوند به تفکر امر کرده است، پس آن‌ها در آنچه خداوند امر کرده یا برایشان معین نموده که در آن تفکر کنند، به جهت امتثال امر او تفکر می‌کنند. و علمی که از این تفکر حاصل می‌شود، در حکم تبع است؛ زیرا علوم تفکر به هیچ وجه، از نظر رفعت و جایگاه، جایگزین علوم ذکر، وحی و موهبت الهی (الوهب الإلهي) نمی‌شوند.\n\nپایان جزء صد و دوم\n\nبه نام خداوند بخشنده مهربان"
  },
  "page_count": 1
}