{
  "id": 450,
  "title": {
    "ar": "الباب الخمسون وأربعمائة في معرفة منازلة من ثبت لظهوري كان بي لأنه سبحانه كان به لا بى وهو الحقيقة والأول مجاز",
    "en": "Chapter Four Hundred and Fifty: Concerning the Gnosis of the Stations of him who was established for My manifestation, [and who] existed through Me; because He (Glory be to Him) existed through him, not through Me. And this [latter statement] is the Reality (الحقيقة), while the former is metaphorical (مجاز).",
    "ur": "باب ۴۵۰: ان منازل کی معرفت (المعرفۃ) کے بیان میں جو میرے (ذات حق کے) ظہور (التجلی) کے لیے ثابت قدم رہا، وہ مجھ سے (بی) تھا، کیونکہ وہ (ذات حق) اس (سالک) سے (بہ) تھا نہ کہ مجھ سے (بی)۔ اور یہی (دوسرا قول) حقیقت (الحقيقة) ہے اور پہلا (قول) مجازی (مجاز) ہے۔",
    "fa": "باب چهارصد و پنجاه: در معرفت منازل کسی که برای ظهور من ثابت ماند، [و] او به واسطه من بود؛ زیرا که او سبحانه به واسطه او بود نه به واسطه من، و این حقیقت است و اولی مجاز."
  },
  "content": {
    "ar": "## «الباب الخمسون وأربعمائة في معرفة منازلة من ثبت لظهوري كان بي لأنه سبحانه كان به لا بى وهو الحقيقة والأول مجاز»\n\n\n> إذا ثبت العبد في موطن *** فإن الإله هو الثابت‏\n\n\n> إذا قلت يا رب هب لي كذا *** وأعطاكه فهو القانت‏\n\n\n> إذا لم يكن غيره عيننا *** فبالله قل لي من المائت‏\n\n\n> ترجم عنه لسان بدا *** فهو به الناطق الساكت‏\n\n\n> ولم يبق للعبد من عينه *** لوحدته نفس خافت‏\n\n\n> وليس له في الورى حاسد *** إذا كان هذا ولا شامت‏\n\n\n> إذا جئت ليلا إلى منزلي *** وبت به فمن البائت‏\n\n\n> هو الحق بنطق في كونه *** بما شاءه وأنا الصامت‏\n\n\n> فلو لا اللجين وأمثاله *** لما فضل العسجد الصامت‏\n\n\n> تعجبت منه ومن عزه *** إذا نكت العالم الناكت‏\n\n\n> وليس يغار على عرضه *** فعبد الإله هنا الباهت‏\n\n\nقال الله عز وجل كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ‏\n\n\n### [أن عباد الله على قسمين‏]\n\n\nاعلم أن عباد الله الذين أهلهم الله له واختصهم من العباد على قسمين عباد يكونون له به وعباد يكونون له بأنفسهم وما عدا هؤلاء فهم لأنفسهم بأنفسهم ليس لله منهم شي‏ء فلا كلام لنا مع هؤلاء فإنهم جاهلون ونعوذ بالله أن نكون من الجاهلين فأما العباد الذين هم له تعالى بأنفسهم فهم الذين تحققوا بقوله تعالى وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فهم العبيد الصم الشداد الأشداء الرحماء بينهم وعلامتهم الاتصاف بجميع الأحوال من فناء وبقاء ومحو وإثبات وغيبة وحضور وجمع وفرق إلى ما يقبله الكون من الأحوال وكذلك من نعوتهم التي تنسب إلى المقامات المذكورة من توكل وزهد وورع ومعرفة ومحبة وصبر وشكر ورضاء وتسليم إلى سائر\nالمقامات المذكورة في الطريق فإن نفوسهم تقبل التغيير والتحويل من حال إلى حال ومن مقام إلى مقام ولكن ذلك كله لله لما سمعوا دعاءه إياهم من هذه الأمور كلها فدخلوا عليه بها ذوقا وحالا لا علما ولا اعتقادا فإن سائر المؤمنين والعلماء علماء الرسوم يعلمون هذه الأمور كلها ولكن لا قدم لهم فيها فهؤلاء إذا تجلى لهم الحق لم يثبتوا لظهوره لأن المحدث إذا ظهر له القديم يمحو أثره إذ لا طاقة للمحدث على رؤية القديم ولهذا جاء الخبر الصحيح الإلهي بأن الحق قد يكون بصر العبد وسمعه حتى يثبت لظهور الحق في التجلي أو في الكلام أ لا ترى إلى موسى عليه السلام لما كان الحق سمعه ثبت لكلام الله فكلمه فلما وقع التجلي ولم يكن الحق عند ذلك بصر موسى كما كان سمعه صعق ولم يثبت فلو كان بصره لثبت وأما العبيد الآخرون فهم له به فيثبتون في كل موطن مهول من حادث وقديم للقوة الإلهية السارية في ذواتهم فلا يبقى حال ولا مقام إلا ويظهرون به وفيه بطريق التحكم به والتصرف فيه فهم يملكون الأحوال والمقامات ولا يملكهم شي‏ء إلا ما قررناه من ذلك الأمر الذي يملك الحق إذا كان الحق ملك الملك فبذلك القدر يكونون في ذواتهم فبه تعالى يسمعون ويبصرون ويأكلون ويشربون وينامون ويقومون وله يسمعون ويبصرون ويأكلون ويشربون وينامون ويقومون وهو قول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في بعض خطبه في الثناء على الله فإنما نحن به وله‏\n\n\nفإذا اجتمع عبدان الواحد له بنفسه والآخر له به أنكر من هو له بنفسه على من هو له به ولم ينكر من هو له به على من هو له بنفسه لأنه عبد محض خالص والآخر حق محض خالص والصورة الظاهرة منهما صورة خلق والباطنة ممن هو لله بنفسه صورة خلق والصورة الباطنة من الآخر صورة حق فهذا يتصرف بحق في حق لحق والآخر يتصرف بخلق في خلق لحق ومنهم من يتصرف في حق لحق بخلق أعني من الذين هم بأنفسهم فخرق العوائد لمن كان لله بنفسه والمنزلة لمن كان لله بالله فهؤلاء أصحاب كرامات وهؤلاء أهل منازل وأصحاب الكرامات معلومون عند الله معلومون عند الخلق وأهل المنازل معلومون عند الله وعند أبناء الجنس مجهولون عند الخلق إلا أن أهل خرق العوائد يبطن في حالهم المكر الإلهي والاستدراج وأهل المنازل مخلصون من المكر لأنهم على بصيرة وبينة من ربهم فهم أهل وصول إلى عين الحقيقة جعلنا الله وإياكم من عبيد الاختصاص آمين بعزته والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 450: Concerning the Knowledge of the Station of the One Who Remained Firm Before My Theophany, Who Was Through Me, Because He (Glorified is He) Was Through Him, Not Through Me; and this is the Reality, while the former is Metaphor.\n\nIf the servant remains firm in a station,\nThen the Deity is the one who is firm.\n\nIf you say, \"O Lord, grant me such-and-such,\"\nAnd He grants it to you, then He is the Devout One.\n\nIf nothing other than Him is our essence,\nThen by God, tell me, who is the dying one?\n\nA tongue that appeared translated from Him,\nSo He is the Speaker and the Silent One through it.\n\nNothing remains for the servant of his essence,\nDue to His Unity (الوحدة), not even a faint breath.\n\nHe has no envier among creation,\nIf this is the case, nor any gloater.\n\nIf I come to my dwelling at night\nAnd spend the night there, who is the one spending the night?\n\nHe is the Real (الحق), speaking in His cosmos\nWith whatever He wills, and I am the silent one.\n\nWere it not for silver and its likes,\nThe silent gold would not be preferred.\n\nI marvel at Him and at His might,\nWhen the world is pierced by the piercer.\n\nHe is not jealous over His honor,\nSo the servant of God here is the bewildered one.\n\nAllah, Mighty and Majestic, said: <<كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ>> (Everything will perish except His Face/Essence).\n\n### [That the Servants of Allah are of Two Kinds]\n\nKnow that the servants of Allah whom Allah has qualified for Himself and chosen from among the servants are of two kinds: servants who are for Him *through Him* (له به), and servants who are for Him *through themselves* (له بأنفسهم). And those besides these are for themselves *through themselves*; nothing of them belongs to Allah. We have no discussion with these, for they are ignorant, and we seek refuge in Allah from being among the ignorant.\n\nAs for the servants who are for Him (Exalted is He) *through themselves*, they are those who have realized the meaning of His (Exalted is He) saying: <<وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me). They are the silent, strong, severe servants, merciful among themselves. Their sign is their description by all the spiritual states (الأحوال), such as annihilation (فناء) and subsistence (بقاء), effacement (محو) and affirmation (إثبات), absence (غيبة) and presence (حضور), gathering (جمع) and separation (فرق), and whatever states the cosmos (العالم) accepts. Likewise, among their characteristics attributed to the mentioned stations (المقامات) are reliance (توكل), asceticism (زهد), piety (ورع), gnosis (معرفة), love (محبة), patience (صبر), gratitude (شكر), contentment (رضاء), and submission (تسليم), up to all the other stations mentioned in the Path.\n\nTheir souls accept change and transformation from state to state and from station to station, but all of that is for Allah, because they heard His call to them concerning all these matters, and they entered upon Him through them by way of tasting (ذوقا) and spiritual state (حالا), not by mere knowledge (علما) or belief (اعتقادا). For the rest of the believers and the scholars—the scholars of external forms (علماء الرسوم)—know all these matters, but they have no footing in them.\n\nThese servants, when the Real (الحق) discloses Himself (تجلى) to them, they do not remain firm before His Theophany (ظهوره), because when the originated (المحدث) sees the Eternal (القديم) manifest, its trace is effaced, for the originated has no capacity to behold the Eternal. For this reason, the authentic Divine report came, stating that the Real may become the servant's sight and hearing, so that he may remain firm before the manifestation of the Real in the Theophany or in speech. Do you not see Moses (peace be upon him)? When the Real was his hearing, he remained firm before the Speech of Allah, and He spoke to him. But when the Theophany occurred, and the Real was not Moses' sight as He had been his hearing, Moses swooned (صعق) and did not remain firm. Had He been his sight, he would have remained firm.\n\nAs for the other servants, they are for Him *through Him* (له به). Thus, they remain firm in every terrifying station, whether originated or eternal, due to the Divine Power (القوة الإلهية) flowing through their essences (ذواتهم). No state or station remains except that they manifest through it and in it, by way of controlling it and disposing of it. They possess the states and stations, and nothing possesses them, except for that matter which we have established, which possesses the Real, since the Real is the King of the Kingdom. To that extent, they exist in their essences. It is *through Him* (به تعالى) that they hear, see, eat, drink, sleep, and rise; and it is *for Him* (وله) that they hear, see, eat, drink, sleep, and rise. This is the saying of the Messenger of Allah (may Allah bless him and grant him peace) in one of his sermons praising Allah: \"Indeed, we are only *through Him* (به) and *for Him* (له).\"\n\nIf two servants meet—one who is for Him through himself and the other who is for Him through Him—the one who is for Him through himself will deny the one who is for Him through Him. But the one who is for Him through Him will not deny the one who is for Him through himself. This is because the former is a pure, unadulterated servant (عبد محض خالص), while the latter is a pure, unadulterated Real (حق محض خالص). The apparent form of both of them is the form of creation (خلق). The inner form of the one who is for Allah through himself is the form of creation, while the inner form of the other is the form of the Real.\n\nThus, the latter acts *by the Real* (بحق), *in the Real* (في حق), *for the Real* (لحق). The former acts *by creation* (بخلق), *in creation* (في خلق), *for the Real* (لحق). And among those who are through themselves, some act *in the Real*, *for the Real*, *by creation*.\n\nThe breaking of customary norms (خرق العوائد) belongs to the one who is for Allah *through himself*, while the high station (المنزلة) belongs to the one who is for Allah *through Allah* (بالله). The former are the people of miracles (كرامات), and the latter are the people of stations (منازل). The people of miracles are known to Allah and known to creation. The people of stations are known to Allah and known to their own kind, but unknown to creation.\n\nHowever, the Divine Deception (المكر الإلهي) and gradual enticement (الاستدراج) are hidden within the state of the people who break customary norms. But the people of stations are purified from deception because they possess insight (بصيرة) and clear evidence (بينة) from their Lord. They are the people of arrival at the very Essence of Reality (عين الحقيقة). May Allah make us and you among the servants of special distinction (عبيد الاختصاص). Amen, by His Might. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب چار سو پچاس: اس شخص کے مقام کی معرفت میں جو میرے ظہور (ظهوري) پر ثابت قدم رہا، جو مجھ سے تھا، کیونکہ وہ (سبحانہ) اس سے تھا نہ کہ مجھ سے۔ اور یہی حقیقت (الحقيقة) ہے، اور پہلا مجاز (مجاز) ہے۔\n\nجب بندہ کسی مقام پر ثابت قدم ہو جائے\nتو درحقیقت اللہ ہی ثابت (الثابت) ہے\n\nجب تم کہتے ہو: اے رب! مجھے یہ عطا فرما\nاور وہ تمہیں عطا کر دیتا ہے، تو وہی قانت (القانت) ہے\n\nجب ہماری عین (ذات) اس کے سوا کوئی نہیں\nتو مجھے اللہ کی قسم بتاؤ کہ مرنے والا (المائت) کون ہے؟\n\nایک زبان اس کی طرف سے ظاہر ہوئی جس نے ترجمانی کی\nپس وہی اس کے ذریعے ناطق (الناطق) اور خاموش (الساكت) ہے\n\nاور اس کی وحدت (لوحدته) کے سبب، بندے کی عین (ذات) کے لیے\nکوئی ہلکی سی سانس (نفس خافت) بھی باقی نہیں رہی\n\nاور مخلوق میں اس کا کوئی حاسد نہیں\nجب یہ حال ہو، اور نہ ہی کوئی شماتت کرنے والا (شامت)\n\nجب تم رات کو میرے گھر آؤ\nاور اس میں رات گزارو، تو رات گزارنے والا (البائت) کون ہے؟\n\nوہ حق (الحق) ہے جو اپنی کائنات میں اپنی مرضی کے مطابق بولتا ہے\nاور میں خاموش (الصامت) ہوں\n\nاگر چاندی (اللجين) اور اس جیسی چیزیں نہ ہوتیں\nتو خاموش سونا (العسجد الصامت) فضیلت نہ پاتا\n\nمیں نے اس پر اور اس کی عزت پر تعجب کیا\nجب عالم کو کھودنے والا (الناكت) کھودتا ہے\n\nاور وہ اپنی آبرو پر غیرت نہیں کھاتا\nپس یہاں اللہ کا بندہ حیران (الباهت) ہے\n\nاللہ عزوجل نے فرمایا: \"ہر چیز فنا ہونے والی ہے سوائے اس کی ذات (وجهه) کے۔\" (القصص: ۸۸)\n\n### [اللہ کے بندے دو قسموں پر ہیں]\n\nجان لو کہ اللہ کے وہ بندے جنہیں اللہ نے اپنے لیے اہل بنایا اور انہیں (عام) بندوں میں سے خاص کیا، وہ دو قسموں پر ہیں: ایک وہ بندے جو اس کے لیے اس کے ذریعے (له به) ہوتے ہیں، اور دوسرے وہ بندے جو اس کے لیے اپنی ذاتوں کے ذریعے (له بأنفسهم) ہوتے ہیں۔ اور ان کے علاوہ جو ہیں، وہ اپنی ذاتوں کے لیے اپنی ذاتوں کے ذریعے ہوتے ہیں، ان میں سے اللہ کے لیے کچھ بھی نہیں ہوتا۔ پس ہمارا ان سے کوئی کلام نہیں، کیونکہ وہ جاہل ہیں، اور ہم اللہ کی پناہ مانگتے ہیں کہ ہم جاہلوں میں سے ہوں۔\n\nبہرحال، وہ بندے جو اپنی ذاتوں کے ذریعے اللہ تعالیٰ کے لیے ہوتے ہیں، وہ ہیں جنہوں نے اللہ تعالیٰ کے اس قول کو متحقق کیا: \"اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت (ليعبدون) کے لیے پیدا کیا۔\" (الذاریات: ۵۶) یہ وہ بندے ہیں جو گونگے، سخت، مضبوط، اور آپس میں رحمدل ہیں۔ ان کی علامت یہ ہے کہ وہ تمام احوال سے متصف ہوتے ہیں، جیسے فنا (الفناء) اور بقا (البقاء)، محو اور اثبات، غیبت اور حضور، جمع اور فرق، اور ان تمام احوال سے جنہیں کائنات قبول کرتی ہے۔\n\nاسی طرح ان کی صفات میں وہ بھی شامل ہیں جو مذکورہ مقامات (المقامات) سے منسوب ہیں، جیسے توکل، زہد، ورع، معرفت (المعرفۃ)، محبت، صبر، شکر، رضا، اور تسلیم، اور وہ تمام دیگر مقامات جو سلوک کے راستے میں مذکور ہیں۔ ان کے نفوس ایک حال سے دوسرے حال اور ایک مقام سے دوسرے مقام کی تبدیلی اور تحویل کو قبول کرتے ہیں، لیکن یہ سب کچھ اللہ کے لیے ہوتا ہے، کیونکہ انہوں نے ان تمام امور میں اس کی پکار کو سنا، پس وہ ان کے ذریعے ذوق (ذوقا) اور حال (حالا) کے طور پر داخل ہوئے، نہ کہ علم یا اعتقاد کے طور پر۔ کیونکہ باقی تمام مومنین اور علماءِ رسوم یہ تمام امور جانتے ہیں، لیکن ان میں ان کا کوئی قدم نہیں ہوتا۔\n\nپس جب حق (الحق) ان پر تجلی (التجلی) فرماتا ہے، تو وہ اس کے ظہور (ظهوره) پر ثابت قدم نہیں رہ پاتے۔ کیونکہ جب قدیم (القديم) کسی محدث (المحدث) پر ظاہر ہوتا ہے، تو وہ اس کے اثر کو مٹا دیتا ہے، اس لیے کہ محدث میں قدیم کے دیدار کی طاقت نہیں ہوتی۔ اسی لیے صحیح خبرِ الٰہی آئی ہے کہ حق (الحق) بندے کی بصارت اور سماعت بن جاتا ہے، تاکہ وہ حق کے ظہور (ظهور الحق) پر تجلی (التجلی) میں یا کلام میں ثابت قدم رہ سکے۔ کیا تم موسیٰ علیہ السلام کو نہیں دیکھتے؟ جب حق ان کی سماعت تھا، تو وہ اللہ کے کلام کے لیے ثابت قدم رہے اور اس نے ان سے کلام کیا۔ لیکن جب تجلی واقع ہوئی اور حق اس وقت موسیٰ کی بصارت نہیں تھا جیسا کہ وہ ان کی سماعت تھا، تو وہ بے ہوش ہو گئے (صعق) اور ثابت قدم نہ رہ سکے۔ اگر وہ ان کی بصارت ہوتا تو وہ ثابت قدم رہتے۔\n\nاور دوسرے بندے، وہ اس کے لیے اس کے ذریعے (له به) ہوتے ہیں۔ پس وہ ہر خوفناک مقام پر، خواہ وہ حادث ہو یا قدیم، اپنی ذاتوں میں سرایت کرنے والی قوتِ الٰہیہ (القوة الإلهية) کے سبب ثابت قدم رہتے ہیں۔ پس کوئی حال یا مقام باقی نہیں رہتا مگر یہ کہ وہ اس میں اور اس کے ذریعے اس پر قابو پانے (التحكم) اور اس میں تصرف (التصرف) کرنے کے طریقے سے ظاہر ہوتے ہیں۔ پس وہ احوال اور مقامات کے مالک ہوتے ہیں، اور کوئی چیز ان کی مالک نہیں ہوتی، سوائے اس امر کے جسے ہم نے مقرر کیا ہے جو حق کا مالک ہوتا ہے جب حق بادشاہ کا بادشاہ ہو۔ پس اسی قدر وہ اپنی ذاتوں میں ہوتے ہیں۔ وہ اسی (حق) کے ذریعے سنتے ہیں، دیکھتے ہیں، کھاتے ہیں، پیتے ہیں، سوتے ہیں اور اٹھتے ہیں۔ اور وہ اسی کے لیے سنتے ہیں، دیکھتے ہیں، کھاتے ہیں، پیتے ہیں، سوتے ہیں اور اٹھتے ہیں۔ اور یہی رسول اللہ صلی اللہ علیہ وسلم کا قول ہے جو انہوں نے اللہ کی ثناء میں اپنے بعض خطبوں میں فرمایا: \"پس ہم اسی کے ذریعے ہیں اور اسی کے لیے ہیں۔\"\n\nپس جب دو بندے اکٹھے ہوں، ایک وہ جو اپنی ذات کے ذریعے اس کے لیے ہے (له بنفسه)، اور دوسرا وہ جو اس کے ذریعے اس کے لیے ہے (له به)، تو جو اپنی ذات کے ذریعے اس کے لیے ہے وہ اس پر اعتراض کرے گا جو اس کے ذریعے اس کے لیے ہے۔ لیکن جو اس کے ذریعے اس کے لیے ہے وہ اس پر اعتراض نہیں کرے گا جو اپنی ذات کے ذریعے اس کے لیے ہے۔ کیونکہ پہلا (له بنفسه) محض خالص بندہ ہے، اور دوسرا (له به) محض خالص حق (حق محض خالص) ہے۔ ان دونوں میں سے ظاہری صورت خلق (مخلوق) کی صورت ہے، اور باطنی صورت اس شخص کی جو اللہ کے لیے اپنی ذات کے ذریعے ہے، وہ بھی خلق کی صورت ہے۔ جبکہ دوسرے کی باطنی صورت حق (الحق) کی صورت ہے۔ پس یہ (له به) حق کے ذریعے حق میں حق کے لیے تصرف کرتا ہے، اور دوسرا (له بنفسه) خلق کے ذریعے خلق میں حق کے لیے تصرف کرتا ہے۔ اور ان میں سے بعض وہ ہیں جو اپنی ذاتوں کے ذریعے ہیں، وہ خلق کے ذریعے حق میں حق کے لیے تصرف کرتے ہیں۔\n\nپس خرقِ عادات (خرق العوائد) اس شخص کے لیے ہیں جو اللہ کے لیے اپنی ذات کے ذریعے تھا، اور منزلت (المنزلة) اس شخص کے لیے ہے جو اللہ کے لیے اللہ کے ذریعے تھا۔ پس یہ (خرقِ عادات والے) کرامات (كرامات) والے ہیں، اور یہ (منزلت والے) منازل (منازل) والے ہیں۔ کرامات والے اللہ کے ہاں معلوم ہیں اور مخلوق کے ہاں بھی معلوم ہیں۔ اور منازل والے اللہ کے ہاں معلوم ہیں اور ہم جنسوں کے ہاں بھی معلوم ہیں، لیکن مخلوق کے ہاں وہ مجہول ہیں۔ مگر خرقِ عادات والوں کے حال میں مکرِ الٰہی (المكر الإلهي) اور استدراج (الاستدراج) پوشیدہ ہو سکتا ہے۔ اور منازل والے مکر سے مخلص ہوتے ہیں، کیونکہ وہ اپنے رب کی طرف سے بصیرت اور بینہ پر ہوتے ہیں۔ پس وہ عین حقیقت (عين الحقيقة) تک رسائی والے ہیں۔ اللہ ہمیں اور آپ کو بندگانِ اختصاص (عبيد الاختصاص) میں سے بنائے، آمین، اپنی عزت کے واسطے سے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راہ دکھاتا ہے۔ (الأحزاب: ۴)",
    "fa": "باب چهارصد و پنجاهم در معرفت منازل کسی که در برابر ظهور من (ظهور الهی) ثابت ماند، به واسطه من بود، زیرا او (حق سبحانه) به واسطه او (بنده) بود نه به واسطه من (بنده)، و این (ثبات به واسطه حق) حقیقت است و اولی (ثبات به واسطه خود) مجاز است.\n\nاگر بنده در موطنی ثابت ماند،\nهمانا خداوند است که ثابت (الثابت) است.\n\nاگر گفتی: «ای پروردگار، چنین چیزی به من ببخش»،\nو آن را به تو داد، پس او (حق) فرمانبردار (القانت) است.\n\nاگر جز او (الحق) عین ما نباشد،\nپس به خدا بگو چه کسی می‌میرد (المائت)؟\n\nزبانی که آشکار شد، از او (حق) ترجمه می‌کند،\nپس او (حق) به واسطه آن، هم ناطق (سخن‌گو) است و هم ساکت.\n\nو برای بنده از عینیتش،\nبه خاطر وحدت (وحدت)، نفس پنهانی (خافت) باقی نماند.\n\nو اگر چنین باشد، در میان خلق\nنه حسود (حاسد) دارد و نه شماتت‌کننده (شامت).\n\nاگر شبانگاه به منزل من آیی\nو در آنجا شب را به سر بری، پس چه کسی شب را به سر برده (البائت)؟\n\nاو (الحق) در هستی (کون) خود\nبه آنچه می‌خواهد سخن می‌گوید، و من خاموشم (الصامت).\n\nو اگر نقره (اللجین) و امثال آن نبود،\nطلای خاموش (العسجد الصامت) برتری نمی‌یافت.\n\nاز او و از عزت او در شگفت شدم،\nآنگاه که عالمِ نکت‌کننده (الناکت) را نکت (نکته‌پردازی) کرد.\n\nو بر عرض خود غیرت نمی‌ورزد،\nپس بنده خدا در اینجا حیران (الباهت) است.\n\nخداوند عز و جل فرمود: «كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ» (جز وجه او، همه چیز نابودشونده است).\n\n### [اینکه بندگان خدا بر دو دسته‌اند]\n\nبدان که بندگان خدا که خداوند آنان را برای خود شایسته گردانیده و از میان بندگان برگزیده است، بر دو دسته‌اند: بندگانی که به واسطه او (به) برای او هستند، و بندگانی که به واسطه خودشان (بأنفسهم) برای او هستند. و غیر از اینان، کسانی هستند که به واسطه خودشان برای خودشان هستند و هیچ بهره‌ای از آنان برای خدا نیست. پس ما با این دسته سخنی نداریم، زیرا آنان جاهلند، و پناه می‌بریم به خدا از اینکه از جاهلان باشیم.\n\nاما بندگانی که به واسطه خودشان برای او تعالی هستند، کسانی‌اند که قول خداوند متعال را محقق ساخته‌اند: «وَما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند). آنان بندگانی خاموش، سخت‌کوش، نیرومند و در میان خود مهربانند. و نشانه آنان متصف شدن به تمامی احوال است، از فنا (الفناء) و بقا (البقاء)، محو و اثبات، غیبت و حضور، و جمع و فرق، تا هر آنچه که هستی (الکون) از احوال می‌پذیرد.\n\nو همچنین از صفات آنان که به مقامات (المقامات) مذکور در طریقت نسبت داده می‌شود، توکل، زهد، ورع، معرفت (المعرفة)، محبت، صبر، شکر، رضا و تسلیم است تا سایر مقامات مذکور در طریقت. زیرا نفوس آنان تغییر و تحول از حالی به حال و از مقامی به مقام را می‌پذیرد، اما همه اینها برای خداست، زیرا آنان دعوت او را در مورد تمامی این امور شنیده‌اند و با ذوق و حال بر او وارد شده‌اند، نه با علم و اعتقاد.\n\nزیرا سایر مؤمنان و علما (علمای رسوم) همه این امور را می‌دانند، اما در آن قدمی ندارند. پس اینان (بندگان له بأنفسهم) اگر حق (الحق) بر آنان تجلی (التجلی) کند، در برابر ظهور او ثابت نمی‌مانند، زیرا وقتی قدیم بر محدث ظاهر شود، اثر او را محو می‌کند، چرا که محدث توانایی دیدن قدیم را ندارد. و به همین دلیل خبر صحیح الهی آمده است که حق (الحق) ممکن است بصر و سمع بنده باشد تا بنده در برابر ظهور حق (الحق) در تجلی (التجلی) یا در کلام ثابت بماند.\n\nآیا نمی‌بینی که موسی علیه السلام، هنگامی که حق (الحق) سمع او بود، در برابر کلام خدا ثابت ماند و با او سخن گفت؟ اما هنگامی که تجلی (التجلی) واقع شد و حق در آن هنگام بصر موسی نبود، چنانکه سمع او بود، موسی مدهوش شد و ثابت نماند. پس اگر بصر او بود، ثابت می‌ماند.\n\nو اما بندگان دیگر، آنان به واسطه او (به) برای او هستند. پس در هر موطن هولناکی، چه حادث و چه قدیم، به واسطه نیروی الهی که در ذاتشان جاری است، ثابت می‌مانند. پس هیچ حال و مقامی باقی نمی‌ماند مگر اینکه به واسطه آن و در آن، از طریق تسلط و تصرف، ظاهر می‌شوند. آنان مالک احوال و مقامات هستند و هیچ چیز مالک آنان نیست، مگر همان امری که مقرر کردیم و حق (الحق) مالک آن است، زیرا حق مالکِ ملک است. پس به همان اندازه در ذات خود هستند.\n\nپس به واسطه او تعالی می‌شنوند و می‌بینند و می‌خورند و می‌نوشند و می‌خوابند و برمی‌خیزند، و برای او می‌شنوند و می‌بینند و می‌خورند و می‌نوشند و می‌خوابند و برمی‌خیزند. و این همان قول رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) در برخی از خطبه‌هایش در ثنای خداوند است که فرمود: «فإنما نحن به وله» (همانا ما فقط به واسطه او و برای او هستیم).\n\nپس اگر دو بنده گرد هم آیند، یکی که به واسطه خودش برای اوست و دیگری که به واسطه او (به) برای اوست، آنکه به واسطه خودش برای اوست، بر آنکه به واسطه او برای اوست، انکار می‌کند؛ اما آنکه به واسطه او برای اوست، بر آنکه به واسطه خودش برای اوست، انکار نمی‌کند. زیرا اولی بنده محض خالص است و دومی حق (الحق) محض خالص است. و صورت ظاهری هر دوی آنها صورت خلق است، اما صورت باطنی آنکه به واسطه خودش برای خداست، صورت خلق است، و صورت باطنی دیگری (آنکه به واسطه او برای خداست) صورت حق (الحق) است.\n\nپس این (دومی) به واسطه حق (الحق)، در حق (الحق) و برای حق (الحق) تصرف می‌کند، و دیگری (اولی) به واسطه خلق، در خلق و برای حق (الحق) تصرف می‌کند. و از آنان (کسانی که به واسطه خودشان هستند) کسانی‌اند که به واسطه خلق، در حق و برای حق تصرف می‌کنند. پس خرق عادات (کرامات) از آنِ کسی است که به واسطه خودش برای خداست، و منزلت (المنزلة) از آنِ کسی است که به واسطه خدا برای خداست. پس اینان (اولی) صاحبان کرامات هستند و آنان (دومی) اهل منازل (المنازل) هستند.\n\nو صاحبان کرامات نزد خدا معلومند و نزد خلق نیز معلومند، اما اهل منازل (المنازل) نزد خدا و نزد ابناء جنس (هم‌نوعان خود) معلومند و نزد خلق مجهولند. با این تفاوت که در حال اهل خرق عادات، مکر الهی و استدراج پنهان است، در حالی که اهل منازل (المنازل) از مکر خالص شده‌اند، زیرا آنان بر بصیرت و بینه‌ای از پروردگارشان هستند. پس آنان اهل وصول به عین الحقیقة (عین حقیقت) هستند. خداوند ما و شما را از بندگان اختصاصی خود قرار دهد. آمین به عزت او. و «وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}