{
  "id": 482,
  "title": {
    "ar": "الباب الثاني والثمانون وأربعمائة في حال قطب كان منزله ومن يُسْلِمْ وَجْهَهُ إِلَى الله وهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقى‏ وإِلَى الله عاقِبَةُ الْأُمُورِ",
    "en": "Chapter Four Hundred and Eighty-Two: Concerning the state of a Pole (*Qutb*) whose station was: <<وَمَنْ يُسْلِمْ وَجْهَهُ إِلَى اللهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَى وَإِلَى اللهِ عَاقِبَةُ الْأُمُورِ>> (And whoever submits his face to Allah while he is a doer of good, he has grasped the most trustworthy handhold. And to Allah belongs the outcome of all matters).",
    "ur": "باب چار سو بیاسی: اس قطب (قطب) کے حال کے بیان میں جس کا مقام (منزل) یہ تھا:\n\"اور جو شخص اپنا رُخ اللہ کی طرف جھکا دے (يُسْلِمْ وَجْهَهُ إِلَى الله) اور وہ نیکوکار (مُحْسِنٌ) بھی ہو، تو یقیناً اس نے مضبوط کڑے (الْعُرْوَةِ الْوُثْقَىٰ) کو تھام لیا، اور تمام معاملات کا انجام اللہ ہی کی طرف ہے (وَإِلَى الله عَاقِبَةُ الْأُمُورِ)۔\"",
    "fa": "باب چهارصد و هشتاد و دوم در بیان حال قطبی (قطب) که منزلگاه او این آیه بود: «و هر کس روی خود را با نیکوکاری تسلیم خدا کند، به یقین به دستگیره محکم چنگ زده است؛ و سرانجام کارها به سوی خداست.» (وَمَن يُسْلِمْ وَجْهَهُ إِلَى اللَّهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ)"
  },
  "content": {
    "ar": "## «الباب الثاني والثمانون وأربعمائة في حال قطب كان منزله ومن يُسْلِمْ وَجْهَهُ إِلَى الله وهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقى‏ وإِلَى الله عاقِبَةُ الْأُمُورِ»\n\n\n> ومن يسلم إلى الرحمن وجها *** فذاك الوجه ليس له انتهاء\n\n\n> لأن الله ليس له ابتداء *** يعينه فيحصره الثناء\n\n\n> فأشهده بإسلامي إليه *** وهذا الحق ليس به خفاء\n\n\n> وذاك العروة الوثقى لدينا *** لماسكها الهدى والاعتلاء\n\n\n> لقد قسم الصلاة ولست كفوا *** فبان الاهتدا والاقتداء\n\n\n> كان الحق لم يخلق سوائي *** فمنزله ومنزلنا سواء\n\n\n### [ما الفرق بين الاسم الله والرحمن‏]\n\n\nيعني في قوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ قال الله تعالى قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ فلم يفرق بين الاسم الله والاسم الرحمن بل جعل الاسمين من الألفاظ المترادفة وإن كان في الرحمن رائحة الاشتقاق ولكن المدلول واحد من حيث العين المسماة بهذين الاسمين والمسمى هو المقصود في هذه الآية ولذلك قال فَلَهُ الْأَسْماءُ الْحُسْنى‏ ومن أسمائه الحسنى الله والرحمن إلى كل اسم سمي به نفسه مما نعلم ومما لا نعلم ومما لا يصح أن يعلم لأنه استأثر بأسماء في علم غيبه لما كان الاسم الله قد عصمه الله أن يسمى به غير الله فلا يفهم منه عند التلفظ به وعند رؤيته مرقوما إلا هوية الحق لا غير فإنه يدل عليه تعالى بحكم المطابقة قال أبو يزيد عند ذلك أنا الله يعني ذلك المتلفظ به في الدلالة على هويته يقول رضي الله عنه أنا أدل على هوية الله من كلمة الله عليها ولذاك سماه كلمته وقال عليه السلام إن أولياء الله هم الذين إذا رأوا ذكر الله‏\n\n\nوسموا أولياء الله لقيام هذه الصفة التي تولاهم الله بها بهم وأي إسلام وانقياد ذاتي لأنه قال وجهه أعظم من هذا الانقياد والإسلام وهو محسن أي فعل ذلك عن شهود منه لأن الإحسان أن ترى ربك في عبادتك فإن العبادة لا تصح من غير شهود وإن‏\nصح العمل فالعمل غير العبادة فإن العبادة ذاتية للخلق والعمل عارض من الحق عرض له فتختلف الأعمال فيه ومنه والعبادة واحدة العين فكما لا تفرق بين الله والرحمن كذلك لا تفرق بين العبد الحقيقي وبين ربه فعند ما نراه تراه فلا ينكره إلا من أنكر الرحمن فلذلك سمي هذا المقام العروة الوثقى أي التي لانتصف بالانخرام لأنها لذاتها هي عروة وثقى شطرها حق وشطرها خلق كالصلاة حكم واحد نصفها لله ونصفها للعبد ولم يقل للمصلي وإِلَى الله عاقِبَةُ الْأُمُورِ فنبه إن مرجع هذا التفصيل كله إلى عين واحدة ليس غير ذلك العين لها صفة الوجود فمن لم يكن له مثل هذا النتاج في هذا الهجير فما ذكر الله به وإن لم يزل به متلفظا فليس المقصود منه إلا ظهور مثل هذا وهذه الإشارة كافية في هذا الذكر والحمد لله وحده‏\n\n",
    "en": "Chapter Four Hundred and Eighty-Two: Concerning the State of a Pole (قطب) Whose Station (منزله) is Defined by the Verse: <<وَمَنْ يُسْلِمْ وَجْهَهُ إِلَى الله وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقى‏ وَإِلَى الله عاقِبَةُ الْأُمُورِ>> (And whoever submits his face to Allah while he is a doer of good, he has grasped the most trustworthy handhold. And to Allah is the outcome of all matters.)\n\nAnd whoever submits a face to the All-Merciful (الرحمن),\nThat face has no end,\n\nBecause Allah has no beginning,\nWhich would define Him and confine Him by praise.\n\nSo I witness Him through my submission (إسلام) to Him,\nAnd this Reality (الحق) holds no concealment.\n\nAnd that is the most trustworthy handhold (العروة الوثقى) in our view,\nFor the one who grasps it there is guidance and exaltation.\n\nHe has divided the Prayer, and I am not equal [to Him],\nThus guidance and emulation became manifest.\n\nIt is as if the Real (الحق) created none other than me,\nSo His station (منزله) and our station are the same.\n\n[What is the difference between the Name Allah and the Name al-Rahman]\n\nThis refers to His saying, <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him). Allah the Exalted said, <<قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ>> (Say: Call upon Allah or call upon the All-Merciful [al-Rahman]). He did not differentiate between the Name Allah and the Name al-Rahman, but rather made the two Names synonymous terms (الألفاظ المترادفة). Although there is a hint of derivation (الاشتقاق) in al-Rahman, the referent (المدلول) is one, in terms of the Essence (العين) named by these two Names. And the Named One (المسمى) is the intended meaning in this verse. For this reason, He said, <<فَلَهُ الْأَسْماءُ الْحُسْنى‏>> (To Him belong the Most Beautiful Names). And among His Most Beautiful Names are Allah and al-Rahman, extending to every Name by which He named Himself, whether we know it or do not know it, or whether it is not possible to know it, because He reserved Names in the knowledge of His Unseen (علم غيبه).\n\nSince the Name Allah has been protected by Allah from being used to name anyone other than Allah, nothing is understood from it, whether when uttered or when seen written, except the Identity (هوية) of the Real (الحق) and nothing else. For it indicates Him, the Exalted, by the rule of correspondence (المطابقة). Abu Yazid said concerning this, \"I am Allah,\" meaning that the one uttering it, in demonstrating his own identity, says—may Allah be pleased with him—\"I indicate the Identity of Allah more clearly than the word 'Allah' indicates it.\" And for that reason, He called him His Word (كلمته). And the Prophet (peace be upon him) said, \"Indeed, the friends of Allah (أولياء الله) are those who, when they are seen, Allah is remembered.\"\n\nThey were called the friends of Allah because this Attribute, by which Allah takes charge of them, subsists in them. And what a submission (إسلام) and essential surrender (انقياد ذاتي) this is, because He said \"his face\" (وجهه), which is greater than mere surrender and submission. And \"while he is a doer of good (محسن)\" means that he did that out of witnessing (شهود). For *Ihsan* (doing good) is that you worship your Lord as if you see Him in your devotion (عبادتك). Devotion is not valid without witnessing. Even if the action (العمل) is valid, the action is not the devotion. Devotion (العبادة) is essential (ذاتية) to the creature (الخلق), while action (العمل) is an accident (عارض) from the Real (الحق) that occurs to him. Thus, actions differ in and from him, but devotion is one in Essence (واحدة العين).\n\nJust as you do not differentiate between Allah and al-Rahman, likewise you do not differentiate between the true servant (العبد الحقيقي) and his Lord. When we see Him, you see Him. None denies this except one who denies al-Rahman. Therefore, this station (المقام) is called the most trustworthy handhold (العروة الوثقى), meaning that which is not characterized by breaking, because in its very Essence (لذاتها) it is a trustworthy handhold, half of which is the Real (حق) and half of which is the creation (خلق), like the Prayer (الصلاة), which is a single ruling, half for Allah and half for the servant—and He did not say \"for the worshipper.\"\n\nAnd <<وَإِلَى الله عاقِبَةُ الْأُمُورِ>> (And to Allah is the outcome of all matters). This alerts us that the return of all this detailed differentiation is to a single Essence (عين واحدة) and nothing else. That Essence possesses the attribute of Being (صفة الوجود). Whoever does not have such a result (النتاج) in this intense heat [of spiritual striving] has not truly remembered Allah, even if he continuously utters His Name. The purpose of this is nothing but the manifestation of such a state. This indication is sufficient concerning this remembrance, and praise belongs to Allah alone.",
    "ur": "باب چار سو بیاسی (۴۸۲) اس قطب کے حال میں جس کا مقام یہ ہے: \"اور جو شخص اپنا رُخ اللہ کی طرف جھکا دے اور وہ نیکوکار (محسن) ہو، تو اس نے مضبوط کڑے (العروۃ الوثقی) کو تھام لیا، اور تمام معاملات کا انجام اللہ ہی کی طرف ہے۔\" (قرآن: لقمان ۳۱:۲۲)\n\nاور جو شخص اپنا رُخ رحمن کے سپرد کر دے،\nتو اس رُخ کے لیے کوئی انتہا نہیں۔\n\nکیونکہ اللہ کے لیے کوئی ابتدا نہیں،\nجو اسے محدود کرے یا تعریف میں گھیرے۔\n\nپس میں اپنے اسلام (سپردگی) کے ذریعے اس کا شہود (الشہود) کرتا ہوں،\nاور اس حق (الحق) میں کوئی پوشیدگی نہیں۔\n\nاور وہ ہمارے نزدیک مضبوط کڑا (العروۃ الوثقی) ہے،\nاسے تھامنے والے کے لیے ہدایت اور بلندی ہے۔\n\nیقیناً اس نے نماز کو تقسیم کیا، اور میں اس کا ہم پلہ نہیں تھا،\nپس ہدایت اور پیروی ظاہر ہو گئی۔\n\nگویا کہ حق (الحق) نے میرے سوا کسی کو پیدا ہی نہیں کیا،\nپس اس کا مقام اور ہمارا مقام برابر ہے۔\n\n### [اسم اللہ اور اسم رحمن میں کیا فرق ہے؟]\n\nیعنی اللہ تعالیٰ کے اس قول کے ضمن میں کہ \"اس کی مثل کوئی شے نہیں\" (قرآن: الشوریٰ ۴۲:۱۱)، اللہ تعالیٰ نے فرمایا: \"کہو، اللہ کو پکارو یا رحمن کو پکارو\" (قرآن: الاسراء ۱۷:۱۱۰)۔ پس اس نے اسم اللہ اور اسم رحمن میں کوئی فرق نہیں کیا، بلکہ دونوں اسموں کو مترادف الفاظ میں سے قرار دیا، اگرچہ رحمن میں اشتقاق (ماخذ) کی بو آتی ہے، لیکن مدلول ایک ہی ہے اس عین (ذات) کے اعتبار سے جسے ان دونوں اسموں سے موسوم کیا گیا ہے، اور مسمیٰ ہی اس آیت میں مقصود ہے۔ اسی لیے فرمایا: \"پس اسی کے لیے اچھے نام (الأسماء الحسنی) ہیں\" (قرآن: طٰہٰ ۲۰:۸)۔\n\nاور اس کے اچھے ناموں (الأسماء الحسنی) میں سے اللہ اور رحمن ہیں، اور ہر وہ نام جس سے اس نے خود کو موسوم کیا، ان میں سے جو ہم جانتے ہیں اور جو ہم نہیں جانتے، اور جو جاننا درست نہیں، کیونکہ اس نے کچھ ناموں کو اپنے علم غیب میں خاص کر لیا ہے۔ چونکہ اسم اللہ کو اللہ نے اس بات سے محفوظ رکھا ہے کہ اس کے سوا کسی اور کو اس سے موسوم کیا جائے، لہٰذا جب اس کا تلفظ کیا جاتا ہے یا اسے لکھا ہوا دیکھا جاتا ہے تو اس سے سوائے ہویت الحق (حق کی ہویت) کے اور کچھ نہیں سمجھا جاتا، کیونکہ یہ مطابقت کے حکم سے اس (ذات حق - الحق) پر دلالت کرتا ہے۔\n\nاسی موقع پر ابو یزید (بسطامی) نے کہا: \"میں اللہ ہوں\" – یعنی وہ متلفظ (بولنے والا) اپنی ہویت (ذات) پر دلالت کرتے ہوئے کہتا ہے، رضی اللہ عنہ، کہ میں کلمہ \"اللہ\" سے زیادہ اللہ کی ہویت پر دلالت کرتا ہوں۔ اسی لیے اس (اللہ) نے اسے اپنا کلمہ (کلمتہ) کہا۔ اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ کے اولیاء وہ ہیں کہ جب انہیں دیکھا جائے تو اللہ یاد آ جائے۔\" (حدیث)\n\nاور انہیں اولیاء اللہ اس صفت کے قائم ہونے کی وجہ سے کہا گیا جس کے ذریعے اللہ نے انہیں اپنا ولی بنایا۔ اور یہ کیسی سپردگی اور ذاتی انقیاد ہے، کیونکہ اس نے \"وجہہ\" (اپنا رُخ) کہا، جو اس انقیاد اور اسلام سے بھی عظیم ہے۔ اور \"وہو محسن\" (اور وہ نیکوکار ہو) یعنی اس نے یہ فعل اپنے کشف (الکشف) اور شہود (الشہود) سے کیا، کیونکہ احسان یہ ہے کہ تم اپنی عبادت میں اپنے رب کو دیکھو۔ پس عبادت شہود (الشہود) کے بغیر درست نہیں ہوتی۔ اگرچہ عمل درست ہو جائے، لیکن عمل عبادت نہیں ہے۔\n\nکیونکہ عبادت مخلوق کے لیے ذاتی ہے، جبکہ عمل حق (الحق) کی طرف سے ایک عارضہ ہے جو اسے پیش آیا، پس اعمال اس میں اور اس کی طرف سے مختلف ہوتے ہیں، جبکہ عبادت عین (ذات) کے اعتبار سے ایک ہے۔ پس جس طرح تم اللہ اور رحمن میں فرق نہیں کرتے، اسی طرح حقیقی عبد اور اس کے رب میں فرق نہ کرو۔ جب ہم اسے دیکھتے ہیں تو تم بھی اسے دیکھتے ہو، پس اس کا انکار وہی کرتا ہے جو رحمن کا انکار کرتا ہے۔\n\nاسی لیے اس مقام کو العروۃ الوثقی (مضبوط کڑا) کہا گیا، یعنی وہ جو ٹوٹنے سے متصف نہیں ہوتی، کیونکہ وہ اپنی ذات کے اعتبار سے ہی مضبوط کڑا ہے، جس کا ایک حصہ حق (الحق) ہے اور ایک حصہ خلق (مخلوق) ہے۔ جیسے نماز ایک ہی حکم ہے، اس کا نصف اللہ کے لیے ہے اور نصف بندے کے لیے ہے، اور یہ نہیں کہا کہ نمازی کے لیے ہے۔ اور \"اور تمام معاملات کا انجام اللہ ہی کی طرف ہے\" (قرآن: لقمان ۳۱:۲۲)۔ پس اس نے متنبہ کیا کہ اس تمام تفصیل کا مرجع ایک ہی عین (ذات) کی طرف ہے، اس کے سوا نہیں۔ اس عین (ذات) کے لیے صفت الوجود (ہستی) ہے۔ پس جس شخص کے لیے اس شدید گرمی (ہجیر) میں ایسی پیداوار (نتاج) نہ ہو، تو اس نے اللہ کا ذکر نہیں کیا، اگرچہ وہ مسلسل اس کا تلفظ کرتا رہا ہو۔ پس اس سے مقصود صرف اسی طرح کا ظہور (التجلی) ہے، اور یہ اشارہ اس ذکر میں کافی ہے، اور تمام تعریفیں صرف اللہ کے لیے ہیں۔",
    "fa": "باب چهارصد و هشتاد و دوم در بیان حال قطبی که منزل او این آیه است: «و هر کس روی خود را با نیکوکاری تسلیم خدا کند، پس به یقین به دستگیره محکم (العروة الوثقى) چنگ زده است؛ و سرانجام کارها به سوی خداست.» (وَمَن يُسْلِمْ وَجْهَهُ إِلَى اللَّهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ) [لقمان: ۲۲]\n\nو هر کس روی خود را تسلیم رحمان کند،\nپس آن روی را پایانی نیست.\n\nزیرا خداوند را آغازی نیست،\nکه او را محدود سازد و ستایش در بر گیرد.\n\nپس با تسلیم خود به سوی او، او را شهود می‌کنم؛\nو این حق (الحق) را هیچ پوشیدگی نیست.\n\nو آن، دستگیره محکم (العروة الوثقى) نزد ماست؛\nبرای چنگ‌زننده به آن، هدایت و برتری است.\n\nبه راستی که نماز را تقسیم کرد و من همتایی نداشتم؛\nپس هدایت و اقتدا آشکار شد.\n\nگویی حق (الحق) جز مرا نیافریده است؛\nپس منزل او و منزل ما یکسان است.\n\n### [تفاوت میان اسم «الله» و «الرحمن» چیست؟]\n\nمنظور در این سخن [قرآنی] است که «چیزی همانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ) [شوری: ۱۱]. خداوند متعال فرمود: «بگو: «الله» را بخوانید یا «رحمان» را بخوانید» (قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَٰنَ) [اسراء: ۱۱۰]. پس میان اسم «الله» و اسم «الرحمن» تفاوتی نگذاشت، بلکه این دو اسم را از الفاظ مترادف قرار داد؛ اگرچه در «الرحمن» بوی اشتقاق وجود دارد، اما مدلول (معنای مورد نظر) از حیث ذات (العین) نامیده شده به این دو اسم، یکی است. و مسمّا (آنچه نامیده شده) مقصود در این آیه است. به همین دلیل فرمود: «پس نیکوترین نام‌ها (الأسماء الحسنى) از آن اوست» (فَلَهُ الْأَسْمَاءُ الْحُسْنَىٰ) [طه: ۸]. و از اسماء حسنای او «الله» و «الرحمن» است، تا هر اسمی که خود را بدان نامیده، از آنچه می‌دانیم و آنچه نمی‌دانیم و آنچه صحیح نیست که دانسته شود؛ زیرا او اسماء (الهی) را در علم غیب خود منحصر به خویش ساخته است.\n\nاز آنجا که اسم «الله» را خداوند مصون داشته است که غیر خدا بدان نامیده شود، پس هنگام تلفظ به آن و هنگام دیدن آن به صورت نوشته، جز هویت حق (هوية الحق) از آن فهمیده نمی‌شود و بس. زیرا این اسم به حکم مطابقت بر ذات متعالی دلالت می‌کند. ابویزید (بسطامی) در این باره گفت: «أنا الله» (من خدا هستم)؛ یعنی آن متلفظ به این کلمه، در دلالت بر هویت (الهی) می‌گوید: «من بر هویت الله دلالت می‌کنم، بیش از آنکه کلمه «الله» بر آن دلالت کند.» و به همین دلیل [خداوند] او را «کلمه‌اش» نامید. و پیامبر (ص) فرمود: «همانا اولیای خدا کسانی هستند که چون دیده شوند، خدا یاد می‌شود.» (إِنَّ أَوْلِيَاءَ اللَّهِ هُمُ الَّذِينَ إِذَا رُؤُوا ذُكِرَ اللَّهُ) [حدیث].\n\nو آنان اولیای خدا نامیده شدند به سبب برپایی این صفتی که خداوند آنان را بدان ولایت بخشیده است. و چه تسلیم و انقیاد ذاتی بزرگی! زیرا [خداوند] فرمود: «روی خود را» که این [تسلیم] بزرگ‌تر از انقیاد و اسلام است. و «او نیکوکار است» (وَهُوَ مُحْسِنٌ)؛ یعنی این کار را از روی شهود (الشهود) انجام داده است، زیرا احسان (الإحسان) آن است که پروردگارت را در عبادتت ببینی. پس عبادت بدون شهود صحیح نیست. و اگرچه عمل صحیح باشد، اما عمل غیر از عبادت است. زیرا عبادت ذاتیِ خلق است، و عمل عارضی است از حق (الحق) که بر او عارض شده است؛ پس اعمال در آن و از آن متفاوت می‌شوند، در حالی که عبادت، ذاتاً یکی است. پس همان‌گونه که میان «الله» و «الرحمن» تفاوتی نمی‌گذاری، همچنین میان بنده حقیقی و پروردگارش تفاوتی نمی‌گذاری. پس هنگامی که ما او را می‌بینیم، تو نیز او را می‌بینی؛ و جز کسی که رحمان را انکار کرده باشد، آن را انکار نمی‌کند. به همین دلیل این مقام، «دستگیره محکم» (العروة الوثقى) نامیده شد؛ یعنی آنکه به گسستن متصف نمی‌شود، زیرا ذاتاً دستگیره‌ای محکم است که یک شطر آن حق (الحق) و شطر دیگرش خلق است، مانند نماز که حکمی واحد است؛ نیمی از آن برای خدا و نیمی برای بنده است، و نفرمود برای نمازگزار. و «سرانجام کارها به سوی خداست» (وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ) [لقمان: ۲۲]. پس آگاه ساخت که مرجع این تفصیلات، همگی به یک ذات (عین واحدة) باز می‌گردد و بس. آن ذات، صفت هستی (الوجود) را داراست. پس هر کس در این گرمای شدید (هجیر) چنین نتیجه‌ای نداشته باشد، خدا را یاد نکرده است، اگرچه پیوسته به آن متلفظ باشد. مقصود از آن [ذکر] جز ظهور چنین چیزی نیست. و این اشاره در این ذکر کافی است. و سپاس تنها از آن خداست."
  },
  "page_count": 2
}