{
  "id": 468,
  "title": {
    "ar": "الباب الثامن والستون وأربعمائة في حال قطب كان منزله الحمد لله على كل حال",
    "en": "Chapter Four Hundred and Sixty-Eight: Concerning the Spiritual State (حال) of a Pole (قطب) Whose Station (منزله) Was \"Praise be to God in every state.\"",
    "ur": "باب نمبر چار سو اڑسٹھ: اس قطب (Qutb) کے حال کے بیان میں جس کا روحانی مقام \"الحمد لله على كل حال\" (ہر حال میں اللہ کے لیے حمد ہے) تھا۔",
    "fa": "باب چهارصد و شصت و هشتم در بیان حال قطبی که منزلگاهش «الحمد لله على كل حال» (ستایش از آنِ خداست در هر حال) بود."
  },
  "content": {
    "ar": "## «الباب الثامن والستون وأربعمائة في حال قطب كان منزله الحمد لله على كل حال»\n\n\n> الحمد لله على كل حال *** فهو الذي يعم حال الوجود\n\n\n> وما علي حمد الذي قاله *** إذا تلفظت به من مزيد\n\n\n> وجاء ذا عنه به قائلا *** قد جاء ما قد كنت منه تحيد\n\n\n> فإنه ناداك من حضرة *** من قبل هذا في مقام الشهود\n\n\n> بأنه ليس بغير له *** فلا يغرنك حبل الوريد\n\n\n> فأنت رب وأنا عبده *** ويثبت الرب بكون العبيد\n\n\n> فلا تقل في كونه إنه *** يقول يوم العرض هَلْ من مَزِيدٍ\n\n\n### [اختلاف الأذكار باختلاف الأحوال‏]\n\n\nاعلم أيدك الله وإيانا بروح منه أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم كان يقول في السراء الحمد لله المنعم المفضل وكان يقول في الضراء الحمد لله على كل حال ثبت هذا في الصحاح فعلمنا أنه ذكر أدب إلهي لأنه ما قيده باسم كما قيد حمد السراء بالمنعم المفضل ومن أسمائه الضار كما من أسمائه النافع ولم يتعرض في هذا الحمد إلى ذكر الاسم الضار ولم يكن ذلك عن هوى بل عن وحي إلهي يوحى‏\n\n\nفإنه الصادق القائل إن الله أدبني فأحسن أدبي‏\n\n\nفعلمنا إن هذا الذكر من جملة الآداب على هذه الصفة وقد أوحى الله أن نتبع ملة إبراهيم ومن آداب إبراهيم عليه السلام مع ربه قوله وإِذا مَرِضْتُ فَهُوَ يَشْفِينِ فنسب الشفاء إلى ربه ولم ينسب إليه المرض لأنه شر في العرف بين الناس وإن كان في طيه خير في حق المؤمن فأخبر الله نبيه بحديث إبراهيم وقوله هذا تعليما له صَلَّى اللهُ عَليهِ وسَلَّم ليتأدب‏\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم والشر ليس إليك‏\n\n\nومن كونه خلقا يحس بالألم الحسي والنفسي كما يحس باللذات المحسوسة والمعنوية ويعلم الفرقان بينهما وأن السرور يصحب الالتذاذ وأن الحزن يصحب الألم طبعا فلذلك عدل في الضراء إلى حمد الله على كل حال والأحوال في العالم ما هي بأمر زائد على الشأن الذي ألحق فيه بل هو عين الشأن كل حال يطرأ في الوجود مما يوافق الغرض ويلائم الطبع ومما لا يوافق الغرض ولا يلائم الطبع وإن كان الأمر في ذلك من القابل لأنا رأينا ما يتضرر به زيد يلتذ به عمر وفعلمنا إن العلة في القابل وأن الأمر الآتي منه تعالى واحد العين لا انقسام فيه فينقسم فينا أمره ويتعدد ولما عم هذا الذكر جميع الأحوال فإن تحقق الذاكر الله به ما وضع له فهي دعوى فإن الله لا بد أن يبتلي الشخص الذي يذكر الله بهذا الذكر على هذا الحد فإن الدعوى تفتح باب الابتلاء في القديم والحديث إن فهمت وإن كان الذاكر به ما خطر له أصل وضعه بخاطر بل ذكر الله به لكونه مشروعا من غير وقوف مع السبب في وجوده وتشريعه فقد يبتليه الله وقد لا يبتليه وإن قيده هذا الذاكر أعني ذلك الذكر بأنه ثناء على الله لجهة الخير لا يقصد به أصل وضعه ولا يقوله بدعوى إنه الحامد ربه على كل حال وإنما يقول ذلك مخبرا أن الله محمود على كل حال فإنه ما من حال كما قررناه إلا وله وجه في الخلق إلى الالتذاذ به والتألم به فما من حال إلا ويحمد الله عليه حمد سراء وحمد ضراء أ لا تراه في السراء كيف يقول الحمد لله المنعم المفضل فمن إنعامه وفضله إن جعل صاحب الضراء يحمد الله ولهذا يعافيه ويحول بينه وبين تلك الضراء لأن حمده شكر على هذا الإفضال وهو أن ألهمه واستعمله في حمد الله ولم يستعمله في الضجر والسخط فعافى باطنه بما ألهمه إليه من التحميد فزاده الله عافية بإزالة الضراء عنه وهذا معنى دقيق مندرج في الحمد لله على كل حال وإنه مساو لحمد السراء وهو الحمد لله المنعم المفضل وبزيادة وهذا من جوامع الكلم التي أوتيها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وتختلف أحوال الذاكرين الله بهذا التحميد فكل حامد به ينتج له بحسب قصده وعلمه وباعثه وقد فصلناه تفصيلا كما أنزله الحق عز وجل في قلوب الذاكرين الله به تنزيلا فهو حمد سراء وحمد ضراء والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 468: Concerning the State of a Pole Whose Station Was \"Praise Be to God in Every State\"\n\n> Praise belongs to God in every state,\n> For He is the One who encompasses the state of Existence (الوجود).\n\n> And there is no increase upon my praise of Him who spoke it,\n> When I utter it.\n\n> And this came from Him, saying through it:\n> \"That which you sought to avoid has come.\"\n\n> For He called you from a Presence (حضرة) before this,\n> In the station of Witnessing (مقام الشهود).\n\n> That He is not other than Him,\n> So let not the jugular vein deceive you.\n\n> For You are the Lord and I am His servant,\n> And the Lord is established by the existence of the servants.\n\n> So do not say concerning His Being (كونه) that He says on the Day of Presentation:\n> <<هَلْ من مَزِيدٍ>> (Is there any more?).\n\n### The Variation of Remembrances [Adhkar] According to the Variation of States [Ahwal]\n\nKnow—may God support you and us with a spirit from Him—that the Messenger of God, peace and blessings be upon him, used to say in times of ease (السراء): \"Praise be to God, the Bestower of Grace, the Favorable (المنعم المفضل).\" And he used to say in times of hardship (الضراء): \"Praise be to God in every state (الحمد لله على كل حال).\" This is established in the authentic collections [of Hadith] (الصحاح).\n\nThus, we know that this is a remembrance (ذكر) of Divine etiquette (أدب إلهي), because he did not restrict it with a Name, just as he restricted the praise in times of ease with the Bestower of Grace, the Favorable. For among His Names is the Harmful (الضار), just as among His Names is the Beneficial (النافع). Yet, in this praise, he did not mention the Name the Harmful. This was not due to personal inclination (هوى) but rather due to Divine inspiration (وحي إلهي) revealed to him.\n\nFor he is the truthful one who said: \"Indeed, God disciplined me and perfected my discipline [adab].\"\n\nThus, we know that this remembrance is among the forms of etiquette (الآداب) of this description. God has revealed that we should follow the creed (ملة) of Abraham. And among the etiquette of Abraham, peace be upon him, with his Lord is his saying: <<وإِذا مَرِضْتُ فَهُوَ يَشْفِينِ>> (And when I am ill, it is He who cures me). He attributed the cure (الشفاء) to his Lord, but he did not attribute the illness (المرض) to Him, because illness is considered evil (شر) in the common understanding among people, even if it contains good (خير) for the believer. So God informed His Prophet of this saying and narrative of Abraham, teaching him, peace and blessings be upon him, so that he might adopt this etiquette.\n\nThus, the Messenger of God, peace and blessings be upon him, said: \"And evil is not attributed to You.\"\n\nAnd because he is a creature (خلق) who feels physical and psychological pain, just as he feels sensible and spiritual pleasures, and knows the distinction (الفرقان) between them, and that joy naturally accompanies pleasure and and sorrow naturally accompanies pain, he therefore shifted in times of hardship (الضراء) to praising God in every state (الحمد لله على كل حال).\n\nThe states (الأحوال) in the World (العالم) are not something external or additional to the affair (الشأن) to which they are attached; rather, they are the very essence of the affair. Every state that occurs in Existence (الوجود) is either agreeable to one's purpose and suitable to one's nature, or it is not agreeable to one's purpose and not suitable to one's nature. Even though the matter concerning this resides in the recipient (القابل). For we have seen that which harms Zayd is enjoyed by Amr. Thus, we know that the cause (العلة) lies in the recipient, and that the matter coming from the Exalted [God] is one in Essence (واحد العين) and admits no division, but it divides and multiplies within us.\n\nSince this remembrance (ذكر) encompasses all states, if the one remembering God (الذاكر) realizes Him through it in a way that was not intended for its placement, then it is a claim (دعوى). For God must test (يبتلي) the person who remembers God with this remembrance to this extent, because a claim opens the door to trial (الابتلاء), both ancient and modern, if you understand.\n\nHowever, if the one remembering God with it did not have the original intention of its placement cross his mind, but rather remembered God with it because it is legislated (مشروعا), without dwelling on the reason for its existence and legislation, then God may test him or may not test him.\n\nAnd if this rememberer restricts that remembrance—meaning, that remembrance—by considering it praise (ثناء) of God for the aspect of good, not intending the original purpose of its placement, and does not say it as a claim that he is the one praising his Lord in every state, but rather says it to inform that God is Praised in every state (محمود على كل حال):\n\nFor there is no state, as we have established, except that it has an aspect in Creation (الخلق) leading to pleasure and an aspect leading to pain. Thus, there is no state upon which God is not praised, whether it be the praise of ease or the praise of hardship. Do you not see how, in times of ease, he says: \"Praise be to God, the Bestower of Grace, the Favorable\"? It is part of His grace and favor that He makes the one experiencing hardship praise God. For this reason, He grants him well-being ('afiya) and intervenes between him and that hardship, because his praise is gratitude (شكر) for this favor—which is that He inspired him and employed him in the praise of God, and did not employ him in vexation or discontent.\n\nThus, He granted well-being to his inner being (باطنه) through the praise He inspired in him, and God increased his well-being by removing the hardship from him. This is a subtle meaning (معنى دقيق) contained within \"Praise be to God in every state,\" and it is equal to the praise of ease—\"Praise be to God, the Bestower of Grace, the Favorable\"—and even exceeds it.\n\nThis is among the comprehensive expressions (جوامع الكلم) granted to the Messenger of God, peace and blessings be upon him. The states (أحوال) of those who remember God through this praise vary, and every person who praises Him through it receives a result according to his intention, his knowledge, and his motive. We have detailed this fully, just as the Truth (الحق), the Mighty and Majestic, revealed it in the hearts of those who remember God with it—a revelation. Thus, it is the praise of ease and the praise of hardship. And God <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو اڑسٹھ: اس قطب کے حال کے بیان میں جس کا مقام \"الحمد لله على كل حال\" (ہر حال میں اللہ کے لیے حمد ہے) تھا۔\n\nہر حال میں اللہ ہی کے لیے حمد ہے، *** کیونکہ وہی ہے جو ہستی (الوجود) کے ہر حال پر محیط ہے۔\nاور اس حمد میں میرے لیے کوئی اضافہ نہیں جو اس نے کہی، *** جب میں نے اسے زبان سے ادا کیا۔\nاور یہ اس کی طرف سے آیا، وہ کہہ رہا تھا: *** \"وہ آ گیا جس سے تم گریزاں تھے۔\"\nکیونکہ اس نے تمہیں ایک حضور (حضرة) سے پکارا، *** اس سے پہلے مقامِ شہود (الشہود) میں۔\nکہ وہ اس کے سوا کوئی اور نہیں ہے، *** لہٰذا تمہیں شہ رگ (حبل الوريد) دھوکے میں نہ ڈالے۔\nپس تو رب ہے اور میں اس کا بندہ ہوں، *** اور رب بندوں کے وجود سے ثابت ہوتا ہے۔\nپس اس کے وجود کے بارے میں یہ نہ کہو کہ *** وہ روزِ پیشی کہے گا: \"هَلْ من مَزِيدٍ\" (کیا مزید ہے؟)۔\n\n### [احوال کے اختلاف سے اذکار کا اختلاف]\n\nجان لو، اللہ تمہیں اور ہمیں اپنی روح سے تائید بخشے، کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم خوشحالی (السراء) میں \"الحمد لله المنعم المفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام دینے والا اور فضل کرنے والا ہے) کہا کرتے تھے، اور تنگی (الضراء) میں \"الحمد لله على كل حال\" (ہر حال میں اللہ کے لیے حمد ہے) کہا کرتے تھے۔ یہ بات صحیح احادیث میں ثابت ہے۔ پس ہم نے جانا کہ یہ ایک الٰہی ادب کا ذکر ہے، کیونکہ آپ نے اسے کسی نام کے ساتھ مقید نہیں کیا، جیسا کہ خوشحالی کی حمد کو \"المنعم المفضل\" (انعام دینے والا، فضل کرنے والا) کے ساتھ مقید کیا۔ اس کے ناموں میں الضار (نقصان پہنچانے والا) بھی ہے، جیسا کہ النافع (نفع دینے والا) ہے۔ لیکن آپ نے اس حمد میں اسم الضار کے ذکر سے تعرض نہیں کیا، اور یہ خواہشِ نفس کی بنا پر نہیں تھا، بلکہ یہ ایک الٰہی وحی تھی جو آپ پر نازل کی گئی۔\n\nکیونکہ آپ صَلَّى اللهُ عَليهِ وسَلَّم صادق ہیں، آپ نے فرمایا: \"إن الله أدبني فأحسن أدبي\" (بیشک اللہ نے مجھے ادب سکھایا اور میرے ادب کو بہترین بنا دیا۔)\n\nپس ہم نے جانا کہ یہ ذکر اسی صفت کے ساتھ آداب کے مجموعے میں شامل ہے۔ اور اللہ نے وحی کی ہے کہ ہم ملتِ ابراہیم کی پیروی کریں۔ اور ابراہیم علیہ السلام کے اپنے رب کے ساتھ آداب میں سے ان کا یہ قول ہے: \"وإِذا مَرِضْتُ فَهُوَ يَشْفِينِ\" (اور جب میں بیمار ہوتا ہوں تو وہی مجھے شفا دیتا ہے)۔ پس انہوں نے شفا کو اپنے رب کی طرف منسوب کیا اور بیماری کو اس کی طرف منسوب نہیں کیا، کیونکہ لوگوں کے عرف میں یہ شر ہے، اگرچہ مومن کے حق میں اس کے اندر خیر پوشیدہ ہو۔ پس اللہ نے اپنے نبی صَلَّى اللهُ عَليهِ وسَلَّم کو تعلیم دینے کے لیے ابراہیم علیہ السلام کی حدیث اور ان کے اس قول سے آگاہ کیا تاکہ آپ صَلَّى اللهُ عَليهِ وسَلَّم مؤدب ہوں۔\n\nپس رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"والشر ليس إليك\" (اور شر تیری طرف منسوب نہیں ہوتا۔)\n\nاور چونکہ وہ ایک مخلوق ہے جو حسی اور نفسی درد کو محسوس کرتی ہے، جیسا کہ وہ محسوس اور معنوی لذتوں کو محسوس کرتی ہے، اور ان دونوں کے درمیان فرق کو جانتی ہے، اور یہ کہ سرور طبعی طور پر لذت کے ساتھ ہوتا ہے اور غم طبعی طور پر درد کے ساتھ ہوتا ہے، اس لیے تنگی (الضراء) میں \"الحمد لله على كل حال\" (ہر حال میں اللہ کے لیے حمد ہے) کی طرف رجوع کیا۔ اور عالم میں احوال اس شان سے کوئی زائد امر نہیں ہیں جس کے ساتھ وہ منسلک کیے گئے ہیں، بلکہ وہ عین شان ہیں۔ ہر حال جو ہستی (الوجود) میں طاری ہوتا ہے، وہ یا تو غرض کے موافق اور طبع کے مطابق ہوتا ہے، یا غرض کے موافق اور طبع کے مطابق نہیں ہوتا، اگرچہ اس میں امر قبول کرنے والے (القابل) کی طرف سے ہوتا ہے۔ کیونکہ ہم نے دیکھا ہے کہ جس چیز سے زید کو نقصان پہنچتا ہے، عمر اس سے لذت حاصل کرتا ہے۔ پس ہم نے جانا کہ علت قبول کرنے والے (القابل) میں ہے، اور یہ کہ اللہ تعالیٰ کی طرف سے آنے والا امر عین کے اعتبار سے ایک ہے، اس میں کوئی تقسیم نہیں، لیکن وہ ہم میں آ کر تقسیم ہو جاتا ہے اور متعدد ہو جاتا ہے۔ اور چونکہ یہ ذکر تمام احوال پر محیط ہے، اگر ذاکر اللہ تعالیٰ کے ساتھ اس ذکر کے ذریعے اس طرح متحقق ہو جائے جس کے لیے یہ وضع کیا گیا ہے، تو یہ ایک دعویٰ ہے۔ پس اللہ تعالیٰ لازماً اس شخص کو آزمائے گا جو اس حد تک یہ ذکر کرتا ہے، کیونکہ دعویٰ قدیم اور جدید میں ابتلاء (آزمائش) کا دروازہ کھولتا ہے، اگر تم سمجھو۔ اور اگر ذاکر کے دل میں اس کے اصل وضع کا خیال بھی نہ آیا ہو، بلکہ اس نے اللہ کا ذکر اس لیے کیا ہو کہ یہ مشروع ہے، اس کے وجود اور تشریع کی وجہ پر غور کیے بغیر، تو اللہ اسے آزما بھی سکتا ہے اور نہیں بھی آزما سکتا۔ اور اگر یہ ذاکر اس ذکر کو اس بات سے مقید کرے کہ یہ اللہ کی ثنا ہے خیر کی جہت سے، اور اس کے اصل وضع کا قصد نہ کرے، اور نہ ہی یہ دعویٰ کرتے ہوئے کہے کہ وہ ہر حال میں اپنے رب کی حمد کرنے والا ہے، بلکہ وہ یہ بات صرف اس خبر کے طور پر کہے کہ اللہ ہر حال میں محمود ہے، کیونکہ جیسا کہ ہم نے طے کیا، کوئی حال ایسا نہیں مگر اس میں مخلوق کے لیے لذت حاصل کرنے اور اس سے تکلیف پانے کا ایک پہلو موجود ہے۔ پس کوئی حال ایسا نہیں جس پر اللہ کی حمد نہ کی جائے، خواہ وہ خوشحالی کی حمد ہو یا تنگی کی حمد۔ کیا تم نہیں دیکھتے کہ خوشحالی میں وہ کیسے کہتا ہے: \"الحمد لله المنعم المفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام دینے والا اور فضل کرنے والا ہے)؟ پس اس کے انعام اور فضل میں سے یہ ہے کہ اس نے تنگی والے کو اللہ کی حمد کرنے والا بنا دیا۔ اور اسی لیے وہ اسے عافیت دیتا ہے اور اس تنگی کو اس سے دور کر دیتا ہے، کیونکہ اس کی حمد اس احسان پر شکر ہے، اور وہ احسان یہ ہے کہ اللہ نے اسے الہام کیا اور اسے اللہ کی حمد میں استعمال کیا، اور اسے بے چینی اور ناراضگی میں استعمال نہیں کیا۔ پس اللہ نے اس کے باطن کو اس تحمید کے ذریعے عافیت بخشی جس کا اسے الہام کیا گیا، تو اللہ نے اس سے تنگی کو دور کر کے اس کی عافیت میں اضافہ کر دیا۔ اور یہ ایک دقیق معنی ہے جو \"الحمد لله على كل حال\" (ہر حال میں اللہ کے لیے حمد ہے) میں شامل ہے، اور یہ خوشحالی کی حمد یعنی \"الحمد لله المنعم المفضل\" کے برابر ہے، بلکہ اس سے بھی زیادہ ہے۔ اور یہ ان جوامع الکلم میں سے ہے جو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کو عطا کیے گئے۔ اور اس تحمید کے ذریعے اللہ کا ذکر کرنے والوں کے احوال مختلف ہوتے ہیں۔ پس ہر حمد کرنے والے کو اس کے قصد، علم اور محرک کے مطابق نتیجہ ملتا ہے۔ اور ہم نے اسے تفصیل سے بیان کیا ہے، جیسا کہ حق عزوجل نے اسے اللہ کا ذکر کرنے والوں کے دلوں میں نازل فرمایا ہے۔ پس یہ خوشحالی کی حمد بھی ہے اور تنگی کی حمد بھی۔ اور \"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب چهارصد و شصت و هشتم در حال قطبی که منزلگاهش «الحمد لله على كل حال» بود\n\nسپاس خدای را در هر حال، *** زیرا اوست که حال هستی (الوجود) را فرا می‌گیرد.\n\nو بر من در ستایش آنچه او گفت، *** هنگامی که آن را بر زبان آوردم، افزایشی نیست.\n\nو این [حال] از جانب او آمد، در حالی که می‌گفت: *** آنچه از آن دوری می‌کردی، اکنون آمده است.\n\nزیرا او تو را از حضرت (حضرة) فرا خواند، *** پیش از این در مقام شهود (الشهود).\n\nبه اینکه جز او دیگری نیست، *** پس رگ گردن تو را فریب ندهد.\n\nپس تو پروردگاری و من بنده‌اش، *** و پروردگار با وجود بندگان ثابت می‌شود.\n\nپس در هستی او مگو که او *** روز عرضه می‌گوید: «هَلْ من مَزِيدٍ» (آیا افزون بر این هست؟).\n\n### [تفاوت ذکرها با تفاوت احوال]\n\nبدان، خداوند تو و ما را به روحی از جانب خود تأیید کند، که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در خوشی (السراء) می‌فرمود: «الحمد لله المنعم المفضل» (سپاس خدای را که نعمت‌بخش فضل‌دهنده است) و در سختی (الضراء) می‌فرمود: «الحمد لله على كل حال» (سپاس خدای را در هر حال). این در کتب صحیح ثابت شده است. پس دانستیم که این ذکر، ادب الهی است، زیرا آن را به اسمی مقید نکرد، چنانکه حمد خوشی را به «المنعم المفضل» مقید کرد. در حالی که «الضار» (زیان‌رسان) از اسمای اوست، همان‌طور که «النافع» (سودرسان) از اسمای اوست. و در این حمد، به ذکر اسم «الضار» نپرداخت، و این از روی هوای نفس نبود، بلکه از وحی الهی بود که به او وحی می‌شد.\n\nزیرا او راستگویی است که می‌گوید: «إن الله أدبني فأحسن أدبي» (همانا خداوند مرا ادب کرد و ادبم را نیکو ساخت).\n\nپس دانستیم که این ذکر از جمله آداب بر این صفت است. و خداوند وحی کرده است که از ملت ابراهیم پیروی کنیم. و از آداب ابراهیم (علیه السلام) با پروردگارش این قول اوست: «وإِذا مَرِضْتُ فَهُوَ يَشْفِينِ» (و چون بیمار شوم، اوست که مرا شفا می‌دهد). پس شفا را به پروردگارش نسبت داد و بیماری را به او نسبت نداد، زیرا بیماری در عرف مردم شر است، هرچند در باطن خود خیری برای مؤمن داشته باشد. پس خداوند پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) را از حدیث ابراهیم و این قول او آگاه ساخت تا او را تعلیم دهد که مؤدب باشد.\nپس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «والشر ليس إليك» (و شر به تو [خداوند] نسبت داده نمی‌شود).\n\nو از آنجا که او (انسان) مخلوقی است که درد حسی و نفسی را احساس می‌کند، همان‌طور که لذات محسوس و معنوی را احساس می‌کند، و فرقان (الفرقان) میان آن دو را می‌داند، و اینکه سرور به طور طبیعی با التذاذ همراه است و حزن با درد همراه است، به همین دلیل در سختی (الضراء) به حمد خدا در هر حال روی آورد. و احوال در عالم امری زائد بر شأنی که به آن ملحق شده‌اند نیستند، بلکه عین آن شأن هستند. هر حالی که در هستی (الوجود) عارض می‌شود، یا موافق غرض و ملایم طبع است، یا موافق غرض و ملایم طبع نیست. اگرچه امر در این مورد به قابل (دریافت‌کننده) بازمی‌گردد، زیرا دیدیم آنچه زید از آن متضرر می‌شود، عمر از آن لذت می‌برد. پس دانستیم که علت در قابل است و امری که از جانب حق تعالی می‌آید، عین واحدی است که در آن انقسامی نیست، اما در ما امر او منقسم و متعدد می‌شود. و چون این ذکر (الحمد لله على كل حال) همه احوال را فرا می‌گیرد، اگر ذاکر (ذکرکننده) به آن تحقق یابد، اما آن را در جایگاه اصلی‌اش قرار ندهد، این ادعاست. زیرا خداوند ناگزیر شخصی را که خدا را با این ذکر در این حد یاد می‌کند، مبتلا می‌سازد. اگر بفهمی، ادعا در قدیم و جدید باب ابتلا (الابتلاء) را می‌گشاید. و اگر ذاکر به آن، اصل وضع آن را به خاطر نیاورده باشد، بلکه خدا را به آن ذکر کرده باشد چون مشروع است، بدون اینکه بر سبب وجود و تشریع آن توقف کند، ممکن است خداوند او را مبتلا کند و ممکن است مبتلا نکند. و اگر این ذاکر، یعنی آن ذکر را، به این قید کند که ثنایی بر خدا از جهت خیر است و قصدش اصل وضع آن نباشد و آن را به ادعای اینکه او حامد پروردگارش در هر حال است نگوید، بلکه آن را بگوید تا خبر دهد که خداوند در هر حال محمود است، زیرا هیچ حالی نیست، چنانکه مقرر کردیم، مگر اینکه در خلق وجهی برای التذاذ و وجهی برای تألم دارد. پس هیچ حالی نیست مگر اینکه خدا بر آن حمد می‌شود، حمد خوشی (سراء) و حمد سختی (ضراء). آیا نمی‌بینی که در خوشی چگونه می‌گوید: «الحمد لله المنعم المفضل»؟ پس از جمله انعام و فضل او این است که صاحب سختی را وامی‌دارد که خدا را حمد کند، و به همین دلیل او را عافیت می‌بخشد و میان او و آن سختی حائل می‌شود، زیرا حمد او شکر بر این افضال است، و آن این است که او را الهام کرد و در حمد خدا به کار گرفت و او را در بی‌قراری و خشم به کار نگرفت. پس باطن او را با الهامی که به تحمید به او داد، عافیت بخشید. پس خداوند با از بین بردن سختی از او، عافیتش را افزود. و این معنای دقیقی است که در «الحمد لله على كل حال» مندرج است و مساوی با حمد خوشی است، یعنی «الحمد لله المنعم المفضل»، و حتی افزون بر آن است. و این از جوامع الکلم (جوامع الكلم) است که به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) داده شد. و احوال ذاکران خدا با این تحمید متفاوت است، و هر حامد به اندازه قصد و علم و انگیزه خود نتیجه می‌گیرد. و ما آن را به تفصیل شرح داده‌ایم، همان‌طور که حق عز و جل آن را در قلوب ذاکران خدا نازل کرده است. پس آن، حمد خوشی و حمد سختی است. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}