{
  "id": 176,
  "title": {
    "ar": "الباب السادس والسبعون ومائة في معرفة أحوال القوم رضي الله عنهم عند الموت",
    "en": "Chapter 176: Concerning the Understanding of the States of the People (القوم), may Allah be pleased with them, at the Time of Death",
    "ur": "باب ایک سو چھہتر: صوفیاء کرام (رضی اللہ عنہم) کے موت کے وقت کے احوال کی معرفت کے بیان میں",
    "fa": "باب صد و هفتاد و ششم در معرفت احوال قوم (صوفیان) رضی الله عنهم هنگام مرگ"
  },
  "content": {
    "ar": "## (الباب السادس والسبعون ومائة في معرفة أحوال القوم رضي الله عنهم عند الموت)\n\n\n> للقوم عند حلول الموت أحوال *** تنوعت وهي أمثال وأشكال‏\n\n\n> فمنهم من يرى الأسماء تطلبه *** ومنهم من يرى الأملاك والحال‏\n\n\n> في ذاك مختلف عند الوجود لما *** تعطي الحقائق والتفصيل إجمال‏\n\n\n> ومنهم من يرى الإرسال مقبلة *** إليه تتحفه والرسل أعمال‏\n\n\n> ومنهم من يرى التنزيه يطلبه *** وهو الذي عنده التشبيه إضلال‏\n\n\n> وكلهم سعدوا والعين واحدة *** وعندهم في جنان الخلد أشغال‏\n\n\n> هذا هو الحق لا تبغي به بدلا *** فهو الصحيح الذي ما فيه إشكال‏\n\n\n### [الموت أمر يقيني لا اختلاف فيه‏]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يموت المرء على ما عاش عليه ويحشر على ما عليه مات‏\n\n\nوقال تعالى فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ يعني عند الموت أي يعاين ما هو أمره عليه الذي ينفرد به أهل الله العابدون ربهم إذا أتاهم اليقين يقول لنبيه صَلَّى اللهُ عَليهِ وسَلَّم اعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ يعني الموت لأنه أمر متيقن لا اختلاف في وقوعه في كل حيوان وإنما وقع الخلاف في ماهيته قال شاعرهم‏\n\n\n> فخالف الناس حتى لا اتفاق لهم *** إلا على شجب والخلف في الشجب‏\n\n\nيعني ما هو والشجب الموت فإذا حضرتهم الوفاة رضي الله عنهم فلا بد لهم من مشاهد اثنتي عشرة صورة يشهدونها كلها أو بعضها لا بد من ذلك وهن صورة عمله وصورة علمه وصورة اعتقاده وصورة مقامه وصورة حاله وصورة رسوله وصورة الملك وصورة اسم من أسماء الأفعال وصورة اسم من أسماء الصفات وصورة اسم من أسماء النعوت وصورة اسم من أسماء التنزيه وصورة اسم من أسماء الذات وكان الأولى أن تكون هذه الصور كلها بالسين لا بالصاد فإنها منازل معان إلا أنه لما تجسدت المعاني وظهرت بالأشكال والمقادير لذلك تصورت في صور إذ كان الشهود بالبصر وحكمت الحضرة بذلك الخيالية البرزخية فالموت والنوم سواء فيما تنتقل إليه المعاني فمنهم من يتجلى له عند الموت عمله العمل فيتجلى له عمله في الزينة والحسن على قدر ما أنشأه العامل عليه من الجمال فإن أتم العمل كما شرع له ولم ينقص منه شيئا يشينه انتقاصه كان في أتم نشأة حسنة ظهرت من تمام أركان ذلك العمل الظاهرة والباطنة من الحضور وشهود الرب في قلبه وفي قبلته إذا صلى وكل عمل مشروع فهو صلاة ولهذا\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم عن الله تعالى أنه يقول يوم القيامة أنظروا في صلاة عبدي أتمها أم نقصها فإن كانت تامة كتبت له تامة وإن كانت انتقص منها\nشيئا قال أنظروا هل لعبدي من تطوع فإن كان له تطوع قال أكملوا لعبدي فريضته من تطوعه‏\n\n\nثم تؤخذ الأعمال على ذا كم فإن كان العمل غير ذات العامل كمانع الزكاة وكغاصب أمر ما حرم عليه اغتصابه كسي ذلك المال صورة عمل هذا العبد من حسن أو قبح فإن كان قبيحا طوق به كما قال في مانع الزكاة سَيُطَوَّقُونَ ما بَخِلُوا به يَوْمَ الْقِيامَةِ وقال فيه عليه السلام يمثل له ما له شجاعا أقرع‏\n\n\nالحديث وفيه يقول له أنا كنزك فيطوق به والكنز من عمل العبد في المال وهكذا العباد الله الصالحين فيما يجودون به من الخير بما يرجع إلى نفوسهم وإلى التصرف في غير ذواتهم فيرى علامات ذلك كله وهذا داخل تحت قوله تعالى سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ وهذا الموطن من بعض مواطن ما يرى فيه عمله فيشاهد العبد الصالح عند الاحتضار عمله الصالح الذي هو لروحه مثل البراق لمن أسرى به عليه فيرفع تلك الروح الطيبة إلى درجاتها حيث كانت من عليين فإن عباد الله على طبقات في أعمالهم في الحسن والأحسن والجميل والأجمل العلم‏\n\n\n### [من تجلى له عند الموت علمه بالجناب الإلهي‏]\n\n\n(و منهم) رضي الله عنهم من تجلى له عند الموت علمه بالجناب الإلهي وهم رجلان رجل أخذ علمه بالله عن نظر واستدلال ورجل أخذ علمه عن كشف وصورة الكشف أتم وأجمل في التجلي لأن الكشف واقتناء هذا العلم ينتجه تقوى وعمل صالح وهو قوله واتَّقُوا الله ويُعَلِّمُكُمُ الله فيظهر له علمه عند الموت صورة حسنة أو نورا يلتبس به فيفرح به فإن صحبته دعوى في اقتنائه ذلك العلم نفسية فهو في الصورة الجميلة دون من لم تصحبه دعوى في اقتناء ذلك العلم بل يراه منحة إلهية وفضلا ومنة لا يرى لنفسه تعملا بل يكون ممن فنى عن عمله في عمله فكان معمولا به كالآلة للصانع يعمل بها وينسب العمل إليه لا إليها فيقع الثناء على الصانع العامل بها لا عليها فهكذا يكون بعض عباد الله في اقتناء علومهم الإلهية فتكون صورة العلم في غاية من الحسن والجمال الاعتقاد\n\n\n### [المعتقد الذي لا علم عنده إلا إن عقده موافق للعلم بالأمر]\n\n\n(و منهم) المعتقد الذي لا علم عنده إلا إن عقده موافق للعلم بالأمر على ما هو عليه فكان يعتقد في الله ما يعتقده العالم لكن عن تقليد لمعلمه من العلماء بالله ولكن لا بد أن يتخيل ما يعتقده فإنه ليس في قوته إن يجرده عن الخيال وهو عند الاحتضار وللاحتضار حال استشراف على حضرة الخيال الصحيح الذي لا يدخله ريب ما هو الخيال الذي هو قوة في الإنسان في مقدم دماغه بل هو خيال من خارج كجبريل في صورة دحية وهو حضرة مستقلة وجودية صحيحة ذات صور جسدية تلبسها المعاني والأرواح فتكون درجته بحسب ما اعتقده من ذلك المقام فإن كان هذا العبد صاحب مقام قد لحق بدرجة الأرواح النورية فإنها التي ذكر الله عنها أنها قالت وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ فيظهر له مقامه في صورة فينزل فيها منزلة الوالي في ولايته فيكون بحسب مقامه وهذه كلها بشارات الحياة الدنيا الذين قال الله فيهم الَّذِينَ آمَنُوا وكانُوا يَتَّقُونَ لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا (الحال) فإن كان صاحب حال في وقت احتضاره يرد عليه من الله حال يقبض فيه فهو له كالخلعة لا كالولاية فيتلبس بها ويتجمل بحسب ما يكون ذلك الحال دل على منزلته والحال قد تكون ابتداء وقد تكون عن عمل متقدم وبينهما فرقان وإن كان الحال موهوبا على كل وجه ولكن الناس على قسمين منهم من تتقدم له خدمة فيقال إنه مستحق لما خلع عليه ومنهم من لم يتقدم له ذلك فتكون المنة والعناية به أظهر لأنه لا يعرف له سبب مع أن الأحوال كلها مواهب والمقامات استحقاق الرسل‏\n\n\n### [في من يتجلى له عند الاحتضار رسوله‏]\n\n\n(و منهم) من يتجلى له عند الاحتضار رسوله الذي ورثه إذ كان العلماء ورثة الأنبياء فيرى عيسى عند احتضاره أو موسى أو إبراهيم أو محمد أو أي نبي كان على جميعهم السلام فمنهم من ينطق باسم ذلك النبي الذي ورثه عند ما يأتيه فرحا به لأن الرسل كلهم سعداء فيقول عند الاحتضار عيسى أو يسميه المسيح كما سماه الله وهو الأغلب فيسمع الحاضرون بهذا الولي يتلفظ بمثل هذه الكلمة فيسيئون الظن به وينسبونه إلى أنه تنصر عند الموت وأنه سلب عنه الإسلام أو يسمى موسى أو بعض أنبياء بنى إسرائيل فيقولون إنه تهود وهو من أكبر السعداء عند الله فإن هذا المشهد لا تعرفه العامة بل يعرفه أهل الله من أرباب الكشوف وإن كان ذلك الأمر الذي هو فيه اكتسبه من دين محمد صَلَّى اللهُ عَليهِ وسَلَّم ولكن ما ورث منه هذا الشخص إلا أمرا مشتركا كان لنبي قبله وهو قوله أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ فلما كانت الصورة مشتركة جلى الحق له صاحب تلك الصورة في النبي الذي كانت له تلك الصفة التي شاركه فيها محمد صَلَّى اللهُ عَليهِ وسَلَّم مثل قوله أَقِمِ الصَّلاةَ لِذِكْرِي وذلك‏\nليتميز هذا للشخص بظهور من ورثه من الأنبياء عمن ورث غيره فلو تجلى في صورة محمدية التبس عليه الشخص الذي ورث محمدا صَلَّى اللهُ عَليهِ وسَلَّم فيما اختص به دون غيره من الرسل الملك‏\n\n\n### [في من يتجلى له عند الاحتضار صورة الملك‏]\n\n\n(و منهم) من يتجلى له عند الاحتضار صورة الملك الذي شاركه في المقام فإنهم الصَّافُّونَ ومنهم الْمُسَبِّحُونَ ومنهم التالون إلى ما هم عليه من المقامات فينزل إليه الملك صاحب ذلك المقام مؤنسا وجليسا تستنزله عليه تلك المناسبة فربما يسميه عند الموت ويرى من المحتضر تهمما به وبشاشة وفرحا وسرورا وما وصفنا في هذا الاحتضار إلا أحوال الأولياء الخارجين عن حكم التلبيس ما ذكرنا من أحوال العامة من المؤمنين فإن ذلك مذاق آخر وللأولياء هذا الذي نذكره خاصة فلذلك ما نتعرض لما يطرأ من المحتضر من العامة مما يكره رؤيته ويتمعر وجهه ليس ذلك مطلوبنا ولا يرفع بذلك رأسا أهل الله وإن تعرض لهم فإنهم عارفون بما يرونه‏\n\n\n(أسماء الأفعال)\n\n\nومنهم من يتجلى له عند الموت هجيره من الأسماء الإلهية فإن كان من أسماء الأفعال كالخالق بمعنى الموجد والباري والمصور والرزاق والمحيي وكل اسم يطلب فعلا فهو بحسب ما كان عليه في معاملته معه ظهر له بما يناسب ذلك العمل فيراه في أحسن صورة فيقول له من أنت يرحمك الله فيقول هجيرك وسيأتي ذكر الهجيرات من هذا الكتاب في باب أحوال الأقطاب من آخره إن شاء الله‏\n\n\n(أسماء الصفات)\n\n\nفإن كان هجيره كل اسم يستدعي صفة كمال كالحي والعالم والقادر والسميع والبصير والمريد فإن هذه الأسماء كلها أسماء المراقبة والحياء فهم أيضا بحسب ما كانوا في حال حياتهم عند هذه الأذكار من طهارة النفوس عن الأعراض التي تتخلل هذه النشأة الإنسانية التي لا يمكن الانفكاك عنها وليس فها دواء إلا الحضور الدائم في مشاهدة الوجه الإلهي الذي له في كل كون عرضي وغير عرضي‏\n\n\n(أسماء النعوت)\n\n\nفإن كان هجيره أسماء النعوت وهي أسماء النسب كالأول والآخر وما جرى هذا المجرى فهو فيها بحسب ما يقوم به من علم الإضافات في ذكره ربه بمثل هذه الأسماء فيعرفه إن لها عينا وجوديا كمثبتي الصفات أو لا عين لها\n\n\n(أسماء التنزيه‏\n\n\nومنهم) من يتجلى له عند الاحتضار أسماء التنزيه كالغني فإن كان مثل هذا الاسم هجيره في مدة عمره فهو فيه بحسب شهوده هل يذكره بكونه غنيا عن كذا ويذكره غنيا حميدا من غير أن يخطر له عن كذا وكذا فيما يماثله من أسماء التنزيه سواء\n\n\n(أسماء الذات‏\n\n\nومنهم) من كان هجيره الاسم الله أو هو والهو أرفع الأذكار عندهم كأبي حامد ومنهم من يرى أنت أتم وهو الذي ارتضاه الكتاني مثل قوله يا حي يا قيوم يا لا إله إلا أنت ومنهم من يرى أنا أتم وهو رأى أبي يزيد فإذا احتضر من هذا ذكره فهو بحسب اعتقاده في ذلك من نسبة تلك الكناية من توهم تحديد وتجريد عن تحديد ومنهم من يرى أن التجريد والتنزيه تحديد ومن المحال أن يعقل أمر من غير تحديد أصلا فإنه لا يخلو إما أن يعقل داخلا أو خارجا أو لا داخل ولا خارج أو هو عين الأمر لا غيره وكل هذا تحديد فإن كل مرتبة قد تميزت عن غيرها بذاتها ولا معنى للحد إلا هذا وهذا القدر كاف انتهى الجزء التاسع ومائة\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "## Chapter One Hundred and Seventy-Six: Concerning the Gnosis of the States of the People [Sufis], may Allah be pleased with them, at the Time of Death\n\nUpon the arrival of death, the People experience states,\nWhich are varied, being similitudes and forms.\n\nSome see the [Divine] Names seeking them,\nOthers see the Angels and the [spiritual] State (حال).\n\nThe experience varies according to [Divine] Existence (الوجود),\nBased on what the Realities (الحقائق) bestow, and the detail is a summary.\n\nSome see the Divine Sending (الإرسال) approaching them,\nBringing gifts, and the Messengers are [Divine] Acts (أعمال).\n\nSome see Transcendence (التنزيه) seeking them,\nFor whom anthropomorphism (التشبيه) is deemed misguidance.\n\nAll are blessed, though the Source (العين) is one,\nAnd they have occupations in the Gardens of Eternity.\n\nThis is the Truth (الحق); seek no substitute for it,\nFor it is the sound reality in which there is no ambiguity.\n\n### [Death is a Certainty in which there is no Disagreement]\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"A person dies upon that which he lived, and is resurrected upon that which he died.\"\n\nAnd the Exalted said: <<فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ>> (Then We have removed from you your covering, and your sight, this Day, is sharp). This means at the time of death, that is, he witnesses what his affair is upon, which is unique to the People of Allah (أهل الله), those who worship their Lord when certainty (اليقين) comes to them. He says to His Prophet, may Allah bless him and grant him peace: <<اعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ>> (Worship your Lord until certainty comes to you), meaning death, because it is a certain matter; there is no disagreement regarding its occurrence for every living creature. The disagreement only occurs concerning its quiddity (ماهيته). Their poet said:\n\nPeople disagreed until they had no agreement,\nExcept upon destruction, and the disagreement is concerning the destruction.\n\nMeaning what it is, and *al-shajb* (الشجب) is death. When death approaches them, may Allah be pleased with them, they must witness twelve images (صور). They witness all of them or some of them; this is inevitable. They are: the image of his deed (عمله), the image of his knowledge (علمه), the image of his belief (اعتقاده), the image of his station (مقامه), the image of his state (حاله), the image of his messenger (رسوله), the image of the angel (الملك), the image of a Name of the Acts (أسماء الأفعال), the image of a Name of the Attributes (أسماء الصفات), the image of a Name of the Qualities (أسماء النعوت), the image of a Name of Transcendence (أسماء التنزيه), and the image of a Name of the Essence (أسماء الذات).\n\nIt would have been more appropriate for all these images (صور) to be written with the letter *sīn* (س) rather than *sād* (ص), for they are stations (منازل) of meanings. However, since the meanings became embodied (تجسدت) and appeared in forms (أشكال) and measures (مقادير), they were therefore pictured in images, as the witnessing (الشهود) is by sight, and the Imaginal Barzakhic Presence (الحضرة الخيالية البرزخية) governs this. Death and sleep are the same regarding the transference of meanings.\n\nAmong them is he whose deed (عمله) is disclosed (يتجلى) to him at the time of death. The deed is disclosed to him in beauty and adornment, according to the degree of beauty upon which the doer established it. If he completed the deed as prescribed for him and did not diminish anything that would mar its perfection, it will be in the most perfect beautiful form (نشأة حسنة), manifested from the completeness of the outward and inward pillars of that deed, such as presence (الحضور) and the witnessing (شهود) of the Lord in his heart and in his direction of prayer (قبلته) if he prays. Every prescribed deed is a prayer. For this reason, the Prophet, may Allah bless him and grant him peace, related from Allah the Exalted that He says on the Day of Resurrection: \"Look into My servant’s prayer. Did he complete it or diminish it?\" If it was complete, it is written for him as complete. If something was diminished from it, He says: \"Look, does My servant have any supererogatory (تطوع) acts?\" If he has supererogatory acts, He says: \"Complete My servant’s obligatory duty (فريضة) from his supererogatory acts.\"\n\nThen the deeds are taken in this manner. If the deed is not the essence of the doer, such as the one who withholds *zakāt* (alms) or the usurper of something forbidden to him, that wealth will be clothed in the image of this servant’s deed, whether beautiful or ugly. If it is ugly, it will be wrapped around his neck, as He said concerning the one who withholds *zakāt*: <<سَيُطَوَّقُونَ ما بَخِلُوا به يَوْمَ الْقِيامَةِ>> (They will be encircled with what they grudged on the Day of Resurrection). And concerning him, the Prophet, peace be upon him, said: \"His wealth will be represented to him as a bald serpent...\" The hadith continues, and in it, [the serpent] says to him: \"I am your treasure,\" and it encircles him. The treasure is part of the servant’s deed concerning wealth.\n\nSimilarly, the righteous servants of Allah regarding the good they bestow, whether it relates to their own souls or to their disposal of things outside their own essences. He sees the signs of all that. This falls under His saying, the Exalted: <<سَنُرِيهِمْ آياتِنا فِي الْآفاقِ وَفِي أَنْفُسِهِمْ>> (We shall show them Our signs in the horizons and and in themselves). This station is one of the stations where he sees his deed. Thus, the righteous servant witnesses his righteous deed at the time of agony (احتضار), which is for his soul like the Buraq [the celestial steed] for the one who was carried upon it in the Night Journey. It raises that pure soul to its degrees in the highest heavens (*‘Illiyyīn*). For the servants of Allah are in ranks regarding their deeds: in beauty and greater beauty, and in comeliness and greater comeliness.\n\n### [He whose Knowledge of the Divine Presence is Disclosed to him at Death]\n\n(And among them), may Allah be pleased with them, is he whose knowledge (علم) of the Divine Presence (الجناب الإلهي) is disclosed (تجلى) to him at the time of death. They are two types of men: one who acquired his knowledge of Allah through contemplation and inference (نظر واستدلال), and one who acquired his knowledge through Unveiling (كشف). The image of Unveiling is more perfect and beautiful in the Theophany (التجلي), because Unveiling and the acquisition of this knowledge are produced by piety and righteous action, which is His saying: <<وَاتَّقُوا اللهَ وَيُعَلِّمُكُمُ اللهُ>> (And fear Allah, and Allah teaches you).\n\nHis knowledge appears to him at death as a beautiful image or a light that envelops him, and he rejoices in it. If his acquisition of that knowledge was accompanied by a claim of self-importance (دعوى نفسية), he will be in the beautiful image, but less so than the one whose acquisition of that knowledge was not accompanied by a claim, but rather sees it as a Divine gift (منحة إلهية), grace (فضل), and favor (منة). He does not see any effort belonging to himself, but rather is among those who have undergone annihilation (فنى) from their deed within their deed, becoming like an instrument used by the artisan, who works with it and attributes the work to himself, not to the instrument. Thus, the praise falls upon the Artisan who works with it, not upon the instrument. This is how some servants of Allah are in their acquisition of Divine sciences (علومهم الإلهية). Thus, the image of knowledge is in the utmost beauty and comeliness.\n\n### [The Believer who has no Knowledge except that his Creed Conforms to the Knowledge of the Matter]\n\n(And among them) is the believer (المعتقد) who has no [direct] knowledge (علم) except that his creed (عقد) conforms to the knowledge of the matter as it truly is. He believes concerning Allah what the Gnostic (العالم) believes, but through imitation (تقليد) of his teacher among the Gnostics of Allah. However, he must imagine what he believes, for it is not in his power to strip it of Imagination (الخيال).\n\nAt the time of agony (الاحتضار), which is a state of looking forward to the true Imaginal Presence (حضرة الخيال الصحيح) that admits no doubt—not the imagination that is a faculty in the forebrain of man, but an external Imagination (خيال من خارج), like Gabriel in the form of Dihya—it is an independent, true existential Presence (حضرة مستقلة وجودية صحيحة) possessing physical forms (صور جسدية) that meanings and spirits (الأرواح) wear.\n\nHis degree (درجته) will be according to what he believed concerning that Station (المقام). If this servant is a possessor of a Station who has attained the degree of the Luminous Spirits (الأرواح النورية), concerning whom Allah said: <<وَما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ>> (There is none of us but has a known station), his Station appears to him in an image. He descends into it like a governor in his province, according to his Station. All these are glad tidings of the worldly life, concerning whom Allah said: <<الَّذِينَ آمَنُوا وَكانُوا يَتَّقُونَ لَهُمُ الْبُشْرى‏ فِي الْحَياةِ الدُّنْيا>> (Those who believed and were God-fearing, for them are glad tidings in the worldly life).\n\n(The State - الحال) If he is a possessor of a State (حال) at the time of his agony, a State descends upon him from Allah in which he is taken. It is for him like a robe of honor (خلعة), not like a governorship (ولاية). He is clothed in it and adorned according to what that State indicates regarding his rank. The State may be an initial gift (ابتداء) or may result from prior action (عمل متقدم), and there is a difference between the two. Although the State is a gift (موهوب) in every respect, people are of two types: those who have prior service, so it is said that they deserve what was bestowed upon them; and those who have no prior service, so the favor (المنة) and providence (العناية) are more manifest for them, because no cause is known for it, even though all States are gifts (مواهب) and Stations (المقامات) are entitlements (استحقاق).\n\n### [Concerning him whose Messenger is Disclosed to him at the Time of Agony]\n\n(And among them) is he whose Messenger (رسوله) is disclosed to him at the time of agony, the one whose inheritance he received, since the scholars are the inheritors of the Prophets. He sees Jesus, or Moses, or Abraham, or Muhammad, or any Prophet, peace be upon all of them, at his agony. Some of them pronounce the name of that Prophet whose inheritance they received when he comes to them, rejoicing in him, because all Messengers are blessed. He says at the agony, \"Jesus,\" or calls him \"the Messiah,\" as Allah named him, which is the most common. The attendees hear this saint (ولي) uttering such a word, and they think ill of him, attributing to him that he became Christian at death and that Islam was stripped from him, or he names Moses or some of the Prophets of the Children of Israel, and they say he became Jewish. Yet, he is one of the greatest blessed ones (السعداء) in the sight of Allah.\n\nFor this witnessing (المشهد) is not known by the common people, but only by the People of Allah (أهل الله) who possess Unveilings (أرباب الكشوف). Even if the matter he is in was acquired from the religion of Muhammad, may Allah bless him and grant him peace, this person only inherited from him a shared matter that belonged to a Prophet before him, which is His saying: <<أُولئِكَ الَّذِينَ هَدَى اللهُ فَبِهُداهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided, so follow their guidance). Since the image was shared, the Real (الحق) disclosed to him the possessor of that image in the Prophet who had that quality which Muhammad, may Allah bless him and grant him peace, shared with him, such as His saying: <<أَقِمِ الصَّلاةَ لِذِكْرِي>> (Establish the prayer for My remembrance). This is so that this person may be distinguished by the appearance of the Prophet whose inheritance he received from the one who inherited from another. If the disclosure were in the Muhammadan image, the person who inherited from Muhammad, may Allah bless him and grant him peace, in what was exclusive to him apart from the other Messengers, would be confused.\n\n### [Concerning him whose Image of the Angel is Disclosed to him at the Time of Agony]\n\n(And among them) is he whose image of the Angel (الملك) who shares his Station (المقام) is disclosed to him at the time of agony. For they are <<الصَّافُّونَ>> (the Rankers), and among them are <<الْمُسَبِّحُونَ>> (the Glorifiers), and among them are the Reciters (التالون), according to the Stations they hold. The Angel who possesses that Station descends to him, comforting him and sitting with him. That affinity (المناسبة) draws the Angel down to him. He may sometimes name the Angel at death, and joy, cheerfulness, and happiness are seen in the dying person.\n\nWe have only described in this agony the states of the Saints (الأولياء) who are outside the rule of confusion (التلبيس), not the states of the common believers, for that is another taste. This which we mention is specific to the Saints. Therefore, we do not address what afflicts the common dying person, such as seeing what is disliked and his face darkening. That is not our objective, nor do the People of Allah pay attention to it, even if it is presented to them, for they are Gnostics (عارفون) of what they see.\n\n(Names of the Acts - أسماء الأفعال)\n\nAmong them is he whose constant invocation (*hajīr*) of the Divine Names is disclosed to him at death. If it is from the Names of the Acts (أسماء الأفعال), such as the Creator (الخالق) in the sense of the Originator (الموجد), the Maker (الباري), the Fashioner (المصور), the Provider (الرزاق), and the Giver of Life (المحيي)—every Name that demands an Act—it appears to him according to what he was upon in his dealing with it. He sees it in the most beautiful image. He says to it, \"Who are you, may Allah have mercy on you?\" It says, \"Your constant invocation (هجيرك).\" The mention of constant invocations (*hajīrāt*) will come later in this book in the chapter on the states of the Poles (*Aqtāb*), if Allah wills.\n\n(Names of the Attributes - أسماء الصفات)\n\nIf his constant invocation is a Name that requires a perfect Attribute (صفة كمال), such as the Living (الحي), the Knowing (العالم), the Powerful (القادر), the Hearing (السميع), the Seeing (البصير), and the Willing (المريد)—for these Names are all Names of Vigilance (المراقبة) and Shame (الحياء)—then he is according to what he was upon during his life regarding these invocations: the purity of the souls from the accidental qualities (الأعراض) that permeate this human existence, from which there is no escape, and for which there is no remedy except permanent Presence (الحضور الدائم) in the witnessing of the Divine Face (الوجه الإلهي) which He has in every accidental and non-accidental existence.\n\n(Names of the Qualities - أسماء النعوت)\n\nIf his constant invocation is from the Names of the Qualities (أسماء النعوت), which are the Names of Relation (النسب), such as the First (الأول) and the Last (الآخر), and what follows this course, then he is in it according to the knowledge of the relations (علم الإضافات) he maintains in his remembrance of his Lord by such Names. He recognizes whether they have an existential essence (عينا وجوديا), like those who affirm the Attributes, or whether they have no essence.\n\n(Names of Transcendence - أسماء التنزيه)\n\n(And among them) is he whose Names of Transcendence (أسماء التنزيه) are disclosed to him at the agony, such as the Rich/Self-Sufficient (الغني). If such a Name was his constant invocation throughout his life, he is in it according to his witnessing: does he remember Him as being rich *from* such-and-such, or does he remember Him as Rich and Praiseworthy (غنيا حميدا) without it occurring to him 'from such-and-such,' regarding what is similar among the Names of Transcendence?\n\n(Names of the Essence - أسماء الذات)\n\n(And among them) is he whose constant invocation was the Name Allah, or *Huwa* (He), and *Huwa* is considered the highest invocation by some, like Abu Hamid [al-Ghazali]. And among them is he who sees *Anta* (You) as more perfect, which is the view approved by al-Kattānī, such as his saying: \"O Living, O Self-Subsisting, O there is no god but You.\" And among them is he who sees *Anā* (I) as more perfect, which is the view of Abu Yazīd [al-Bistami]. When the one who invokes this is in agony, his state is according to his belief regarding the attribution of that pronoun (كناية), whether he imagines limitation (تحديد) or purification from limitation.\n\nAnd among them is he who sees that purification (التجريد) and Transcendence (التنزيه) are themselves a limitation, and that it is impossible to conceive of a matter without limitation whatsoever, for it must be conceived of as either internal or external, or neither internal nor external, or that it is the very essence of the matter and nothing else. All of this is limitation, for every Level (مرتبة) is distinguished from others by its essence, and the meaning of 'limit' (حد) is nothing but this. This much is sufficient.\n\nEnd of Part One Hundred and Nine.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر ایک سو چھہتر: اہلِ تصوف (رضی اللہ عنہم) کے موت کے وقت کے احوال کی معرفت میں\n\nاہلِ تصوف کے لیے موت کے وقت احوال ہوتے ہیں،\nجو مختلف ہوتے ہیں اور وہ مثالیں اور شکلیں ہیں۔\n\nان میں سے کچھ وہ ہیں جو اسماء (الٰہیہ) کو دیکھتے ہیں کہ وہ انہیں طلب کر رہے ہیں،\nاور کچھ وہ ہیں جو فرشتوں کو دیکھتے ہیں، اور یہ حال ہے۔\n\nہستی (الوجود) کے نزدیک اس میں اختلاف ہے، کیونکہ\nحقائق (الحقائق) جو کچھ عطا کرتے ہیں، تفصیل میں اجمال ہوتا ہے۔\n\nاور ان میں سے کچھ وہ ہیں جو رسالت کو اپنی طرف آتے ہوئے دیکھتے ہیں جو انہیں تحفہ دیتی ہے،\nاور رسول (الرسل) اعمال ہیں۔\n\nاور ان میں سے کچھ وہ ہیں جو تنزیہ (التنزيه) کو دیکھتے ہیں کہ وہ انہیں طلب کر رہا ہے،\nاور وہ شخص جس کے نزدیک تشبیہ (التشبيه) گمراہی ہے۔\n\nاور وہ سب کامیاب ہوئے، حالانکہ اصل (عین) ایک ہی ہے،\nاور ان کے لیے ہمیشہ کی جنتوں میں مشاغل ہیں۔\n\nیہی ذات حق (الحق) ہے، اس کا کوئی بدل نہ چاہو،\nپس یہی وہ صحیح بات ہے جس میں کوئی اشکال نہیں۔\n\n### [موت ایک یقینی امر ہے جس میں کوئی اختلاف نہیں]\n\nرسول اللہ (صلی اللہ علیہ وسلم) نے فرمایا: \"انسان اسی حالت پر مرتا ہے جس پر وہ زندہ رہا، اور اسی حالت پر اٹھایا جائے گا جس پر وہ مرا۔\"\n\nاور اللہ تعالیٰ نے فرمایا: \"پس ہم نے تجھ سے تیرا پردہ ہٹا دیا، تو آج تیری نگاہ تیز ہے۔\" (فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ) یعنی موت کے وقت، وہ اس امر کا مشاہدہ کرتا ہے جو اس پر غالب ہے، جس میں اہلِ اللہ، جو اپنے رب کی عبادت کرتے ہیں، منفرد ہوتے ہیں جب ان کے پاس یقین (الیقین) آ جاتا ہے۔ اللہ اپنے نبی (صلی اللہ علیہ وسلم) سے فرماتا ہے: \"اپنے رب کی عبادت کرتے رہو یہاں تک کہ تمہیں یقین آ جائے۔\" (اعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ) یعنی موت، کیونکہ یہ ایک یقینی امر ہے جس کے ہر جاندار پر واقع ہونے میں کوئی اختلاف نہیں۔\n\nشاعر نے کہا:\n\"پس لوگوں نے اختلاف کیا یہاں تک کہ ان میں اتفاق نہیں،\nسوائے موت (شجب) کے، اور اختلاف موت (شجب) کی ماہیت میں ہے۔\"\nیعنی وہ کیا ہے، اور شجب موت ہے۔\n\nپس جب ان (اہلِ تصوف) پر وفات کا وقت آتا ہے، رضی اللہ عنہم، تو ان کے لیے بارہ صورتوں کا مشاہدہ ضروری ہے، وہ ان سب کا یا ان میں سے بعض کا مشاہدہ کرتے ہیں، یہ لازمی ہے۔ اور وہ یہ ہیں: اس کے عمل کی صورت، اس کے علم کی صورت، اس کے اعتقاد کی صورت، اس کے مقام کی صورت، اس کے حال کی صورت، اس کے رسول کی صورت، فرشتے کی صورت، اسماء الافعال (أسماء الأفعال) میں سے کسی اسم کی صورت، اسماء الصفات (أسماء الصفات) میں سے کسی اسم کی صورت، اسماء النعوت (أسماء النعوت) میں سے کسی اسم کی صورت، اسماء التنزيه (أسماء التنزيه) میں سے کسی اسم کی صورت، اور اسماء الذات (أسماء الذات) میں سے کسی اسم کی صورت۔\n\nاور بہتر یہ تھا کہ یہ تمام صورتیں (صور) صاد کے بجائے سین کے ساتھ (سور) ہوتیں، کیونکہ یہ معانی کی منازل ہیں، لیکن جب معانی نے تجسد اختیار کیا اور شکلوں اور مقداروں میں ظاہر ہوئے، اس لیے وہ صورتوں میں متصور ہوئے، کیونکہ شہود (الشهود) بصارت سے ہوتا ہے، اور برزخی خیالی (الخیالیۃ البرزخیۃ) حضرہ نے اسی کا حکم دیا۔ پس موت اور نیند اس لحاظ سے برابر ہیں کہ معانی کس چیز کی طرف منتقل ہوتے ہیں۔\n\nپس ان میں سے کچھ وہ ہیں جن کے لیے موت کے وقت ان کا عمل ظاہر ہوتا ہے۔ عمل ان کے لیے زینت اور حسن میں ظاہر ہوتا ہے، اس جمال کے مطابق جس پر عامل نے اسے پیدا کیا تھا۔ اگر اس نے عمل کو مکمل کیا جیسا کہ اس کے لیے مشروع کیا گیا تھا اور اس میں کوئی ایسی کمی نہیں کی جو اس کی عیب جوئی کرے، تو وہ بہترین حسن کی نشأت میں ہوگا جو اس عمل کے ظاہری اور باطنی ارکان کی تکمیل سے ظاہر ہوئی، جیسے کہ حضور اور اپنے رب کا شہود (الشهود) اپنے دل میں اور اپنے قبلہ میں جب وہ نماز پڑھتا ہے۔ اور ہر مشروع عمل نماز ہے۔\n\nاور اسی لیے نبی اکرم (صلی اللہ علیہ وسلم) نے اللہ تعالیٰ کے حوالے سے فرمایا کہ وہ قیامت کے دن فرمائے گا: \"میرے بندے کی نماز کو دیکھو، کیا اس نے اسے مکمل کیا یا اس میں کمی کی؟ اگر وہ مکمل ہوئی تو اس کے لیے مکمل لکھی جائے گی، اور اگر اس میں کچھ کمی ہوئی تو وہ فرمائے گا: دیکھو کیا میرے بندے کے پاس کوئی نفل (تطوع) ہے؟ اگر اس کے پاس نفل ہوا تو فرمائے گا: میرے بندے کے فرض کو اس کے نفل سے مکمل کر دو۔\"\n\nپھر اعمال کو اسی طرح لیا جائے گا۔ اگر عمل خود عامل کی ذات نہ ہو، جیسے زکوٰۃ روکنے والا یا کسی ایسی چیز کا غاصب جس کا غصب کرنا حرام ہے، تو وہ مال اس بندے کے عمل کی صورت اختیار کر لے گا، خواہ وہ حسن ہو یا قبح۔ اگر وہ قبیح ہوا تو اسے طوق بنا دیا جائے گا، جیسا کہ زکوٰۃ روکنے والے کے بارے میں فرمایا: \"عنقریب وہ چیز جس میں انہوں نے بخل کیا، قیامت کے دن ان کے گلے کا طوق بنا دی جائے گی۔\" (سَيُطَوَّقُونَ ما بَخِلُوا به يَوْمَ الْقِيامَةِ) اور اس کے بارے میں آپ (علیہ السلام) نے فرمایا کہ اس کا مال گنجے سانپ کی صورت میں اس کے سامنے آئے گا۔ (حدیث) اور اس میں وہ اس سے کہے گا: میں تیرا خزانہ ہوں، پس وہ اسے طوق بنا دیا جائے گا۔ اور خزانہ مال میں بندے کا عمل ہے۔ اور اسی طرح اللہ کے نیک بندے بھی ہیں جو خیر میں سخاوت کرتے ہیں، جو ان کے نفوس کی طرف لوٹتا ہے اور ان کی اپنی ذات کے علاوہ میں تصرف کی طرف۔ پس وہ ان سب کی علامات دیکھتے ہیں۔ اور یہ سب اللہ تعالیٰ کے اس قول کے تحت آتا ہے: \"ہم عنقریب انہیں اپنی نشانیاں آفاق میں اور ان کی جانوں میں دکھائیں گے۔\" (سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ) اور یہ مقام ان مقامات میں سے ہے جہاں وہ اپنا عمل دیکھتا ہے۔ پس نیک بندہ احتضار کے وقت اپنا نیک عمل دیکھتا ہے جو اس کی روح کے لیے براق کی مانند ہوتا ہے جس پر اسے سیر کرائی جاتی ہے، اور وہ اس پاکیزہ روح کو اس کے درجات کی طرف بلند کرتا ہے جہاں وہ علیین میں تھی۔ کیونکہ اللہ کے بندے اپنے اعمال میں حسن، احسن، جمیل اور اجمل کے لحاظ سے طبقات پر ہیں۔\n\n### [جس کے لیے موت کے وقت جنابِ الٰہی کا علم ظاہر ہو]\n\n(و منهم) رضی اللہ عنہم ان میں سے کچھ وہ ہیں جن کے لیے موت کے وقت جنابِ الٰہی کا علم (العلم) ظاہر ہوتا ہے، اور وہ دو طرح کے لوگ ہیں: ایک وہ جس نے اللہ کا علم نظر اور استدلال سے حاصل کیا، اور دوسرا وہ جس نے اپنا علم کشف (الکشف) سے حاصل کیا۔ اور کشف (الکشف) کی صورت ظہور الٰہی (التجلی) میں زیادہ مکمل اور خوبصورت ہوتی ہے، کیونکہ کشف (الکشف) اور اس علم کا حصول تقویٰ اور عمل صالح سے پیدا ہوتا ہے، اور یہی اللہ کا قول ہے: \"اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے۔\" (وَاتَّقُوا الله وَيُعَلِّمُكُمُ الله) پس موت کے وقت اس کا علم ایک خوبصورت صورت یا ایک نور کی شکل میں ظاہر ہوتا ہے جو اس سے لپٹ جاتا ہے، اور وہ اس سے خوش ہوتا ہے۔ اگر اس علم کے حصول میں اس کے ساتھ نفسانی دعویٰ شامل ہو، تو وہ خوبصورت صورت میں ہوگا، لیکن اس شخص سے کم درجے پر جس کے ساتھ اس علم کے حصول میں کوئی دعویٰ شامل نہ ہو، بلکہ وہ اسے ایک الٰہی عطیہ، فضل اور احسان سمجھے۔ وہ اپنے لیے کوئی تکلف نہیں دیکھتا، بلکہ وہ ان لوگوں میں سے ہوتا ہے جو اپنے عمل میں اپنے عمل سے فنا (الفناء) ہو گئے، پس وہ صانع کے آلے کی طرح ہوتا ہے جس سے کام لیا جاتا ہے اور عمل کی نسبت صانع کی طرف کی جاتی ہے نہ کہ آلے کی طرف۔ پس تعریف اس صانع کی ہوتی ہے جو اس آلے سے کام کرتا ہے، نہ کہ آلے کی۔ پس اللہ کے بعض بندے اپنے الٰہی علوم کے حصول میں اسی طرح ہوتے ہیں، تو علم کی صورت حسن اور جمال کی انتہا پر ہوتی ہے۔\n\n### [وہ معتقد جس کے پاس علم نہیں مگر اس کا اعتقاد امر کے علم کے مطابق ہے]\n\n(و منهم) اور ان میں سے وہ معتقد (المعتقد) ہے جس کے پاس علم نہیں، مگر اس کا اعتقاد (الاعتقاد) امر کے علم کے مطابق ہے جیسا کہ وہ ہے۔ پس وہ اللہ کے بارے میں وہی اعتقاد رکھتا ہے جو عالم رکھتا ہے، لیکن اپنے معلم (جو اللہ کے عالم ہیں) کی تقلید کی بنا پر۔ لیکن اسے اپنے معتقد کو خیالی صورت دینا ضروری ہے، کیونکہ اس کی قوت میں یہ نہیں کہ وہ اسے خیال سے مجرد کرے۔ اور وہ احتضار کے وقت ہوتا ہے، اور احتضار کی ایک کیفیت ہوتی ہے جو صحیح خیال (الخیال الصحیح) کی حضرہ پر جھانکتی ہے جس میں کوئی شک نہیں ہوتا۔ یہ وہ خیال نہیں جو انسان کے دماغ کے اگلے حصے میں ایک قوت ہے، بلکہ یہ باہر سے آنے والا خیال ہے، جیسے جبریل کا دحیہ کلبی کی صورت میں آنا۔ اور یہ ایک مستقل وجودی صحیح حضرہ ہے جس میں معانی اور ارواح جسمانی صورتیں پہنتے ہیں۔\n\nپس اس کا درجہ اس مقام کے بارے میں اس کے اعتقاد کے مطابق ہوگا۔ اگر یہ بندہ صاحبِ مقام (صاحب مقام) ہے جو نوری ارواح کے درجے کو پہنچ چکا ہے، تو یہ وہی ہیں جن کے بارے میں اللہ نے ذکر کیا کہ انہوں نے کہا: \"اور ہم میں سے کوئی نہیں مگر اس کا ایک مقام معلوم ہے۔\" (وَما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ) پس اس کا مقام ایک صورت میں اس کے لیے ظاہر ہوتا ہے، تو وہ اس میں اس طرح اترتا ہے جیسے کوئی والی اپنی ولایت میں اترتا ہے، اور یہ اس کے مقام کے مطابق ہوتا ہے۔ اور یہ سب دنیاوی زندگی کی بشارتیں ہیں جن کے بارے میں اللہ نے فرمایا: \"وہ لوگ جو ایمان لائے اور پرہیزگار تھے، ان کے لیے دنیا کی زندگی میں بشارت ہے۔\" (الَّذِينَ آمَنُوا وكانُوا يَتَّقُونَ لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا)\n\n(الحال) اگر وہ احتضار کے وقت صاحبِ حال (صاحب حال) ہے، تو اللہ کی طرف سے اس پر ایک حال وارد ہوتا ہے جس میں اس کی روح قبض کی جاتی ہے۔ یہ اس کے لیے خلعت کی مانند ہوتا ہے نہ کہ ولایت کی، پس وہ اسے پہنتا ہے اور اس کے مطابق مزین ہوتا ہے جس پر وہ حال اس کے مرتبے کی دلالت کرتا ہے۔ اور حال (الحال) کبھی ابتداء ہوتا ہے اور کبھی کسی سابقہ عمل کی وجہ سے، اور ان دونوں میں فرق ہے۔ اگرچہ حال ہر صورت میں موہوب ہوتا ہے، لیکن لوگ دو قسموں پر ہیں: ان میں سے کچھ وہ ہیں جن کی خدمت پہلے سے ہوتی ہے، تو کہا جاتا ہے کہ وہ اس خلعت کے مستحق ہیں جو انہیں پہنائی گئی، اور ان میں سے کچھ وہ ہیں جن کی کوئی سابقہ خدمت نہیں ہوتی، تو ان پر احسان اور عنایت زیادہ ظاہر ہوتی ہے، کیونکہ ان کے لیے کوئی سبب معلوم نہیں ہوتا، حالانکہ تمام احوال (الأحوال) عطیات ہیں اور مقامات (المقامات) استحقاق ہیں۔\n\n### [جس کے لیے احتضار کے وقت اس کا رسول ظاہر ہو]\n\n(و منهم) اور ان میں سے کچھ وہ ہیں جن کے لیے احتضار کے وقت ان کا رسول (الرسول) ظاہر ہوتا ہے جس کے وہ وارث ہیں، کیونکہ علماء انبیاء کے وارث ہیں۔ پس وہ احتضار کے وقت عیسیٰ، یا موسیٰ، یا ابراہیم، یا محمد، یا کوئی بھی نبی (علیہم السلام) کو دیکھتے ہیں۔ ان میں سے کچھ وہ ہیں جو اس نبی کا نام لیتے ہیں جس کے وہ وارث ہیں، جب وہ ان کے پاس خوشی سے آتے ہیں، کیونکہ تمام رسول کامیاب ہیں۔ پس وہ احتضار کے وقت عیسیٰ کہتے ہیں، یا انہیں مسیح کہتے ہیں جیسا کہ اللہ نے انہیں نام دیا، اور یہی زیادہ غالب ہے۔ پس حاضرین سنتے ہیں کہ یہ ولی اس طرح کے کلمے کا تلفظ کر رہا ہے، تو وہ اس کے بارے میں بدگمانی کرتے ہیں اور اسے یہ نسبت دیتے ہیں کہ وہ موت کے وقت نصرانی ہو گیا اور اس سے اسلام چھین لیا گیا، یا وہ موسیٰ یا بنی اسرائیل کے کسی نبی کا نام لیتا ہے، تو وہ کہتے ہیں کہ وہ یہودی ہو گیا، حالانکہ وہ اللہ کے نزدیک سب سے بڑے کامیاب لوگوں میں سے ہے۔ کیونکہ اس مشہد کو عام لوگ نہیں جانتے، بلکہ اہلِ اللہ، جو اربابِ کشف (أرباب الکشف) ہیں، جانتے ہیں۔ اگرچہ وہ امر جس میں وہ ہے، اس نے دینِ محمد (صلی اللہ علیہ وسلم) سے حاصل کیا ہے، لیکن اس شخص نے آپ سے صرف ایک مشترکہ امر وراثت میں پایا جو آپ سے پہلے کسی نبی کو حاصل تھا، اور وہ اللہ کا یہ قول ہے: \"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کریں۔\" (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ) پس جب صورت مشترک تھی، تو ذات حق (الحق) نے اس شخص کے لیے اس صورت کے مالک کو اس نبی کی شکل میں ظاہر کیا جس میں وہ صفت تھی جس میں محمد (صلی اللہ علیہ وسلم) نے شرکت کی، جیسے اللہ کا قول: \"میری یاد کے لیے نماز قائم کرو۔\" (أَقِمِ الصَّلاةَ لِذِكْرِي) اور یہ اس لیے ہے تاکہ یہ شخص ان انبیاء کے ظہور سے ممتاز ہو جائے جن کا وہ وارث ہے، ان لوگوں سے جنہوں نے کسی اور کی وراثت پائی۔ اگر وہ محمدی صورت میں ظاہر ہوتے، تو اس شخص پر التباس ہو جاتا جس نے محمد (صلی اللہ علیہ وسلم) کی وراثت پائی ان امور میں جو آپ کے ساتھ خاص تھے، دوسرے رسولوں کے برعکس۔\n\n### [جس کے لیے احتضار کے وقت فرشتے کی صورت ظاہر ہو]\n\n(و منهم) اور ان میں سے کچھ وہ ہیں جن کے لیے احتضار کے وقت اس فرشتے کی صورت ظاہر ہوتی ہے جو اس کے مقام میں شریک ہے، کیونکہ وہ صف باندھنے والے (الصَّافُّونَ) ہیں، اور ان میں سے تسبیح کرنے والے (الْمُسَبِّحُونَ) ہیں، اور ان میں سے تلاوت کرنے والے ہیں، ان مقامات کے مطابق جن پر وہ فائز ہیں۔ پس اس مقام کا مالک فرشتہ اس کے پاس انس اور ہم نشینی کے لیے اترتا ہے، اور یہ مناسبت اسے نیچے لے آتی ہے۔ پس وہ موت کے وقت شاید اس کا نام لے، اور محتضر سے اس کی طرف توجہ، بشاشت، خوشی اور مسرت دیکھی جائے۔ اور ہم نے اس احتضار میں صرف ان اولیاء کے احوال بیان کیے ہیں جو التباس کے حکم سے باہر ہیں، نہ کہ عام مومنین کے احوال جو ہم نے ذکر کیے، کیونکہ وہ ایک دوسرا ذائقہ ہے۔ اور اولیاء کے لیے یہ خاص ہے جو ہم ذکر کر رہے ہیں۔ اس لیے ہم عام لوگوں کے محتضر ہونے پر جو ناپسندیدہ چیزیں طاری ہوتی ہیں اور ان کا چہرہ بگڑ جاتا ہے، ان کا ذکر نہیں کرتے۔ یہ ہمارا مطلوب نہیں، اور اہلِ اللہ اس کی طرف توجہ نہیں کرتے، اگرچہ وہ ان کے سامنے آ بھی جائیں، کیونکہ وہ جانتے ہیں کہ وہ کیا دیکھ رہے ہیں۔\n\n(اسماء الأفعال)\nاور ان میں سے کچھ وہ ہیں جن کے لیے موت کے وقت ان کا الٰہی اسماء (الأسماء الإلهية) میں سے ہجیر (ورد) ظاہر ہوتا ہے۔ اگر وہ اسماء الافعال (أسماء الأفعال) میں سے ہے، جیسے الخالق (پیدا کرنے والا) بمعنی الموجد (وجود بخشنے والا)، الباری (بنانے والا)، المصور (صورت دینے والا)، الرزاق (روزی دینے والا)، المحیی (زندہ کرنے والا)، اور ہر وہ اسم جو فعل کا تقاضا کرتا ہے، تو وہ اس کے ساتھ اس کے برتاؤ کے مطابق ظاہر ہوتا ہے، جو اس عمل کے مناسب ہوتا ہے۔ پس وہ اسے بہترین صورت میں دیکھتا ہے۔ وہ اس سے کہتا ہے: تم کون ہو، اللہ تم پر رحم کرے؟ تو وہ کہتا ہے: میں تمہارا ہجیر (ورد) ہوں۔ اور اس کتاب میں اقطاب کے احوال کے باب میں، جو اس کے آخر میں ہے، ان شاء اللہ، ہجیرات کا ذکر آئے گا۔\n\n(اسماء الصفات)\nاگر اس کا ہجیر ہر وہ اسم ہے جو صفتِ کمال کا تقاضا کرتا ہے، جیسے الحی (زندہ)، العالم (جاننے والا)، القادر (قدرت والا)، السمیع (سننے والا)، البصیر (دیکھنے والا)، اور المرید (ارادہ کرنے والا)، تو یہ تمام اسماء مراقبہ اور حیاء کے اسماء ہیں۔ پس وہ بھی اپنی زندگی کے دوران ان اذکار کے وقت نفوس کی ان عوارض سے پاکیزگی کے مطابق ہوتے ہیں جو اس انسانی نشأت میں داخل ہو جاتے ہیں جن سے چھٹکارا ممکن نہیں، اور اس کا کوئی علاج نہیں سوائے الٰہی چہرے کے دائمی مشاہدے کے، جو ہر عرضی اور غیر عرضی کون میں موجود ہے۔\n\n(اسماء النعوت)\nاگر اس کا ہجیر اسماء النعوت (أسماء النعوت) ہیں، جو نسبت کے اسماء ہیں، جیسے الأول (اول) اور الآخر (آخر) اور جو اس زمرے میں آتے ہیں، تو وہ ان میں اضافات کے علم کے مطابق ہوتا ہے جب وہ اپنے رب کا ذکر ان اسماء کے ساتھ کرتا ہے۔ پس وہ اسے پہچانتا ہے کہ آیا ان کا کوئی وجودی عین ہے، جیسے صفات کو ثابت کرنے والے، یا ان کا کوئی عین نہیں۔\n\n(اسماء التنزيه)\nاور ان میں سے کچھ وہ ہیں جن کے لیے احتضار کے وقت اسماء التنزيه (أسماء التنزيه) ظاہر ہوتے ہیں، جیسے الغنی (بے نیاز)۔ اگر یہ اسم اس کی عمر بھر کا ہجیر رہا ہے، تو وہ اس میں اپنے شہود (الشهود) کے مطابق ہوتا ہے کہ آیا وہ اسے اس لحاظ سے یاد کرتا ہے کہ وہ فلاں چیز سے بے نیاز ہے، یا وہ اسے غنی حمید (قابل تعریف بے نیاز) کے طور پر یاد کرتا ہے بغیر اس کے کہ اس کے دل میں یہ خیال آئے کہ وہ فلاں فلاں چیز سے بے نیاز ہے، جو اسماء التنزيه (أسماء التنزيه) میں اس کے مماثل ہیں۔\n\n(اسماء الذات)\nاور ان میں سے کچھ وہ ہیں جن کا ہجیر اسم \"اللہ\" یا \"ھو\" (ھو) تھا، اور \"ھو\" ان کے نزدیک سب سے اعلیٰ ذکر ہے، جیسے ابو حامد (الغزالی)۔ اور ان میں سے کچھ وہ ہیں جو \"أنت\" (تو) کو زیادہ مکمل سمجھتے ہیں، اور یہ وہ ہے جسے کتانی نے پسند کیا، جیسے ان کا قول: \"یا حی یا قیوم یا لا إله إلا أنت\" (اے زندہ، اے قائم رکھنے والے، اے وہ جس کے سوا کوئی معبود نہیں)۔ اور ان میں سے کچھ وہ ہیں جو \"أنا\" (میں) کو زیادہ مکمل سمجھتے ہیں، اور یہ ابو یزید (بسطامی) کی رائے ہے۔ پس جب اس ذکر کا حامل احتضار کی حالت میں ہو، تو وہ اس کنایہ کی نسبت کے بارے میں اپنے اعتقاد کے مطابق ہوتا ہے، خواہ وہ تحدید کا وہم ہو یا تحدید سے تجرید۔ اور ان میں سے کچھ وہ ہیں جو یہ سمجھتے ہیں کہ تجرید اور تنزیہ (التنزيه) بھی تحدید ہے، اور یہ محال ہے کہ کسی امر کو بغیر کسی تحدید کے سمجھا جائے، کیونکہ وہ یا تو داخل سمجھا جائے گا یا خارج، یا نہ داخل نہ خارج، یا وہ عین امر ہے اور کچھ نہیں، اور یہ سب تحدید ہے۔ کیونکہ ہر مرتبہ اپنی ذات سے دوسرے سے ممتاز ہو چکی ہے، اور حد کا معنی اس کے سوا کچھ نہیں۔ اور یہ مقدار کافی ہے۔\n\nایک سو نوواں حصہ مکمل ہوا۔\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "باب صد و هفتاد و ششم در معرفت احوال سالکان (القوم) رضوان الله علیهم هنگام مرگ\n\nسالکان را هنگام فرارسیدن مرگ احوالی است\nکه متنوع‌اند و به صورت مثال‌ها و شکل‌ها ظاهر می‌شوند\n\nپس برخی از آنان اسماء الهی را می‌بینند که او را می‌طلبند\nو برخی فرشتگان و حال (حال عرفانی) را مشاهده می‌کنند\n\nدر این امر، اختلاف در هستی (الوجود) است، به سبب آنچه\nحقایق (الحقائق) عطا می‌کنند و تفصیل، اجمال است\n\nو برخی فرستادگان (ارسال) را می‌بینند که به سویش می‌آیند\nو به او تحفه می‌دهند، و این رسولان، اعمال هستند\n\nو برخی تنزیه (التنزيه) را می‌بینند که او را می‌طلبد\nو او کسی است که تشبیه (التشبيه) نزدش گمراهی است\n\nو همه آنان سعادتمندند و عین (حقیقت) یکی است\nو در بهشت‌های جاودان مشغولیت‌هایی دارند\n\nاین حق (الحق) است، جایگزینی برای آن مخواه\nپس این همان صحیح است که در آن هیچ اشکالی نیست\n\n### [مرگ امری یقینی است که در آن اختلافی نیست]\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «انسان بر آنچه بر آن زیسته می‌میرد و بر آنچه بر آن مرده محشور می‌شود.»\n\nو خداوند متعال می‌فرماید: «فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ» (ما پرده را از تو برداشتیم، پس امروز دیده‌ات تیز است) [ق: ۲۲] یعنی هنگام مرگ؛ یعنی آنچه را که امر اوست و اهل الله، بندگان پروردگارشان، به آن منفرد می‌شوند، مشاهده می‌کند، هنگامی که یقین (الیقین) به سراغشان می‌آید.\n\nخداوند به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «اعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ» (پروردگارت را بپرست تا یقین به تو رسد) [حجر: ۹۹] یعنی مرگ؛ زیرا مرگ امری یقینی است که در وقوع آن در هر موجود زنده‌ای اختلافی نیست. اختلاف تنها در ماهیت آن رخ داده است. شاعرشان گفته است:\n\n«فخالف الناس حتى لا اتفاق لهم *** إلا على شجب والخلف في الشجب»\n(مردم اختلاف کردند تا جایی که اتفاقی ندارند / مگر بر مرگ (شجب)، و اختلاف در مرگ است)\n\nیعنی مرگ چیست؟ و شجب همان مرگ است.\n\nپس هنگامی که وفات سالکان (رضي الله عنهم) فرا می‌رسد، ناگزیر باید دوازده صورت را مشاهده کنند؛ یا همه آنها را یا برخی از آنها را. این امر حتمی است. و آن صورت‌ها عبارتند از: صورت عملش، صورت علمش، صورت اعتقادش، صورت مقامش، صورت حالش، صورت رسولش، صورت فرشته، صورت اسمی از اسماء افعال، صورت اسمی از اسماء صفات، صورت اسمی از اسماء نعوت، صورت اسمی از اسماء تنزیه (التنزيه)، و صورت اسمی از اسماء ذات.\n\nشایسته‌تر آن بود که این صورت‌ها (صور) همگی با حرف سین (س) باشند نه صاد (ص)، زیرا آنها منازل معانی هستند. اما چون معانی تجسد یافته و به شکل‌ها و اندازه‌ها ظاهر شده‌اند، به همین دلیل در صورت‌ها (صور) متصور شده‌اند، زیرا شهود (الشهود) با چشم است و حضرت خیالی برزخی (الخیالیة البرزخیة) بر این امر حکم کرده است. پس مرگ و خواب در آنچه معانی به آن منتقل می‌شوند، یکسان هستند.\n\nپس برخی از آنان هنگام مرگ، عملش بر او تجلی (التجلی) می‌کند. عمل در زینت و زیبایی بر حسب میزان جمالی که عامل آن را بر آن بنا نهاده، بر او تجلی می‌کند. اگر عمل را همان‌گونه که برایش تشریع شده کامل کرده باشد و چیزی که نقص آن را زشت کند، از آن کم نکرده باشد، در کامل‌ترین نشأت نیکو خواهد بود که از تمام ارکان ظاهری و باطنی آن عمل، از حضور و شهود (الشهود) پروردگار در قلبش و در قبله‌اش هنگام نماز، ظاهر شده است. و هر عمل مشروعی، نماز است.\n\nبه همین دلیل، پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از قول خداوند متعال فرمود که روز قیامت می‌گوید: «به نماز بنده من بنگرید، آیا آن را کامل انجام داده یا ناقص؟ اگر کامل بود، برایش کامل نوشته می‌شود. و اگر چیزی از آن کم بود، می‌گوید: بنگرید آیا بنده من نماز مستحبی دارد؟ اگر مستحبی داشت، می‌گوید: فریضه بنده مرا از مستحباتش کامل کنید.»\n\nسپس اعمال بر همین منوال گرفته می‌شوند. اگر عمل غیر از ذات عامل باشد، مانند کسی که زکات نمی‌دهد یا غاصب امری است که غصب آن بر او حرام شده است، آن مال، صورت عمل این بنده را از زیبایی یا زشتی می‌پوشد. اگر زشت باشد، مانند طوق بر گردنش می‌افتد، چنانکه درباره کسی که زکات نمی‌دهد فرمود: «سَيُطَوَّقُونَ ما بَخِلُوا بِهِ يَوْمَ الْقِيامَةِ» (به زودی آنچه را بخل ورزیده‌اند، در روز قیامت طوق گردنشان خواهد شد) [آل عمران: ۱۸۰]. و درباره او (علیه السلام) فرمود: «مالش به صورت ماری نر و بی‌مو برایش مجسم می‌شود.» (الحديث) و در آن حدیث آمده که به او می‌گوید: «من گنج تو هستم.» پس آن مال طوق گردنش می‌شود. و گنج از عمل بنده در مال است.\n\nو همین‌گونه است بندگان صالح خدا در آنچه از خیر می‌بخشند، که به نفوسشان و به تصرف در غیر ذاتشان باز می‌گردد. پس نشانه‌های همه اینها را می‌بیند. و این تحت قول خداوند متعال است: «سَنُرِيهِمْ آياتِنا فِي الْآفاقِ وَفِي أَنْفُسِهِمْ» (به زودی آیات خود را در آفاق و در خودشان به آنان نشان خواهیم داد) [فصلت: ۵۳]. و این موطن، یکی از موطن‌هایی است که در آن عملش را می‌بیند.\n\nپس بنده صالح هنگام احتضار، عمل صالح خود را مشاهده می‌کند که برای روحش مانند براق است برای کسی که بر آن به معراج برده شد. پس آن روح پاک را به درجاتش در علیین بالا می‌برد. زیرا بندگان خدا در اعمالشان در زیبایی و زیباتر و نیکو و نیکوتر، طبقاتی دارند.\n\n### [کسی که هنگام مرگ، علمش به ساحت الهی بر او تجلی می‌کند]\n\n(و از آنان) رضي الله عنهم کسانی هستند که هنگام مرگ، علمشان به ساحت الهی بر آنان تجلی (التجلی) می‌کند. و اینان دو دسته‌اند: مردی که علمش به خدا را از طریق نظر و استدلال به دست آورده، و مردی که علمش را از طریق کشف (الکشف) به دست آورده است. و صورت کشف (الکشف) در تجلی (التجلی) کامل‌تر و زیباتر است، زیرا کشف و کسب این علم، نتیجه تقوا و عمل صالح است، و این همان قول خداوند است: «وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ» (و از خدا پروا کنید و خدا به شما می‌آموزد) [بقره: ۲۸۲].\n\nپس علمش هنگام مرگ به صورت نیکو یا نوری بر او ظاهر می‌شود که با آن درمی‌آمیزد و به آن شاد می‌شود. اگر در کسب آن علم، ادعای نفسانی همراه او بوده باشد، در صورت زیبا قرار می‌گیرد، اما پایین‌تر از کسی که در کسب آن علم، ادعایی همراهش نبوده است، بلکه آن را عطای الهی و فضل و منت می‌بیند و برای خود تلاشی نمی‌بیند، بلکه از کسانی است که در عملش از عمل خود فانی شده است، پس مانند ابزار برای صنعتگر، که با آن کار می‌کند و عمل به او نسبت داده می‌شود نه به ابزار، و ستایش بر صنعتگر عامل با آن واقع می‌شود نه بر ابزار. پس برخی از بندگان خدا در کسب علوم الهی‌شان این‌گونه‌اند، و صورت علم در نهایت زیبایی و جمال خواهد بود.\n\n### [معتقد که علمی ندارد مگر اینکه عقد او موافق با علم به امر باشد]\n\n(و از آنان)، معتقد است که علمی ندارد، مگر اینکه عقد (اعتقاد) او موافق با علم به امر، آن‌گونه که هست، باشد. پس او در مورد خدا همان چیزی را اعتقاد دارد که عالم اعتقاد دارد، اما از روی تقلید از معلم خود که از عالمان به خداست. اما ناگزیر باید آنچه را اعتقاد دارد، تخیل کند، زیرا در توان او نیست که آن را از خیال (الخیال) مجرد سازد. و او هنگام احتضار است. و احتضار، حالتی از اشراف بر حضرت خیال صحیح (الخیال الصحیح) است که شک در آن راه ندارد. این خیالی نیست که قوه‌ای در انسان در جلوی مغزش باشد، بلکه خیالی است از خارج، مانند جبرئیل در صورت دحیه. و آن، حضرتی مستقل و وجودی صحیح است که دارای صورت‌های جسمانی است که معانی و ارواح آنها را می‌پوشند.\n\nپس درجه او بر حسب آنچه از آن مقام اعتقاد داشته، خواهد بود. اگر این بنده صاحب مقام (مقام) باشد و به درجه ارواح نوری پیوسته باشد، که خداوند درباره آنها فرموده است: «وَما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ» (و هیچ یک از ما نیست مگر اینکه برای او مقامی معلوم است) [صافات: ۱۶۴]، مقامش در صورتی بر او ظاهر می‌شود، پس در آن فرود می‌آید، مانند منزلت والی در ولایتش. پس بر حسب مقامش خواهد بود. و اینها همگی بشارت‌های زندگی دنیا هستند که خداوند درباره آنان فرموده است: «الَّذِينَ آمَنُوا وَكانُوا يَتَّقُونَ لَهُمُ الْبُشْرى‏ فِي الْحَياةِ الدُّنْيا» (آنان که ایمان آوردند و پرهیزگار بودند، برایشان بشارت در زندگی دنیاست) [یونس: ۶۳-۶۴].\n\n(حال)\nاگر صاحب حال (حال) باشد، در وقت احتضارش، حالی از جانب خدا بر او وارد می‌شود که در آن قبض می‌شود. پس آن حال برای او مانند خلعت است نه مانند ولایت. پس آن را می‌پوشد و بر حسب آنچه آن حال بر منزلت او دلالت می‌کند، زینت می‌یابد. و حال ممکن است ابتدایی باشد یا ناشی از عمل پیشین، و بین این دو تفاوت‌هایی است. اگرچه حال در هر صورت موهبتی است، اما مردم دو دسته‌اند: برخی خدمتی پیشین دارند و گفته می‌شود که او مستحق خلعت است. و برخی آن خدمت را پیشین نداشته‌اند، پس منت و عنایت الهی بر او آشکارتر است، زیرا سببی برای آن شناخته نمی‌شود، با اینکه همه احوال موهبت هستند و مقامات استحقاق.\n\n### [در مورد کسی که رسولش هنگام احتضار بر او تجلی می‌کند]\n\n(و از آنان) کسی است که هنگام احتضار، رسولش که از او ارث برده، بر او تجلی می‌کند، زیرا علما وارثان انبیا هستند. پس عیسی یا موسی یا ابراهیم یا محمد یا هر پیامبری (سلام بر همه آنان) را هنگام احتضار می‌بیند. برخی از آنان از روی شادی به نام آن پیامبری که از او ارث برده، سخن می‌گوید، زیرا همه رسولان سعادتمندند. پس هنگام احتضار می‌گوید: «عیسی» یا او را «مسیح» می‌نامد، چنانکه خدا او را نامیده است، و این غالب است. حاضران می‌شنوند که این ولی چنین کلمه‌ای را بر زبان می‌آورد، پس به او بدگمان می‌شوند و او را متهم می‌کنند که هنگام مرگ نصرانی شده و اسلام از او سلب شده است، یا موسی یا برخی از انبیای بنی اسرائیل را نام می‌برد و می‌گویند یهودی شده است. در حالی که او از بزرگ‌ترین سعادتمندان نزد خداست.\n\nزیرا این مشهد را عوام نمی‌شناسند، بلکه اهل الله از صاحبان کشف (الکشف) آن را می‌شناسند. اگرچه آن امری که در آن است، از دین محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کسب کرده است، اما این شخص از او ارث نبرده مگر امری مشترک را که برای پیامبری پیش از او بوده است، و این همان قول خداوند است: «أُولئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُداهُمُ اقْتَدِهْ» (آنان کسانی هستند که خدا هدایتشان کرده، پس به هدایت آنان اقتدا کن) [انعام: ۹۰]. و چون صورت مشترک بود، حق (الحق) صاحب آن صورت را در پیامبری که آن صفت را داشته و محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در آن با او شریک بوده، بر او تجلی داد، مانند قولش: «أَقِمِ الصَّلاةَ لِذِكْرِي» (نماز را برای یاد من برپا دار) [طه: ۱۴]. و این برای آن است که این شخص با ظهور کسی که از انبیا از او ارث برده، از کسی که از دیگری ارث برده، متمایز شود. اگر در صورت محمدیه تجلی می‌کرد، شخصی که از محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در آنچه مختص به اوست و نه دیگر رسولان، ارث برده، بر او مشتبه می‌شد.\n\n### [در مورد کسی که صورت فرشته هنگام احتضار بر او تجلی می‌کند]\n\n(و از آنان) کسی است که هنگام احتضار، صورت فرشته‌ای که در مقام (مقام) با او شریک است، بر او تجلی می‌کند. زیرا آنان «الصَّافُّونَ» (صف‌کشیدگان) هستند و برخی «الْمُسَبِّحُونَ» (تسبیح‌کنندگان) و برخی «التالون» (تلاوت‌کنندگان) و غیره از مقاماتی که بر آن هستند. پس فرشته صاحب آن مقام به سوی او فرود می‌آید، مونس و همنشین، و آن مناسبت، او را به پایین می‌آورد. و چه بسا هنگام مرگ نام او را ببرد و از محتضر، اهتمام و شادمانی و سرور نسبت به او دیده شود.\n\nو ما در این احتضار، تنها احوال اولیا (الأولياء) را توصیف کردیم که از حکم تلبیس خارج‌اند، نه احوال مؤمنان عامه را، زیرا آن طعمی دیگر است. و این احوالی که ذکر می‌کنیم، مخصوص اولیاست. به همین دلیل، به آنچه از محتضر عامه رخ می‌دهد و دیدن آن ناخوشایند است و چهره‌اش دگرگون می‌شود، نمی‌پردازیم. اهل الله به آن توجهی نمی‌کنند، و اگر هم برایشان رخ دهد، آنان به آنچه می‌بینند، عارف‌اند.\n\n(اسماء افعال)\nو از آنان کسی است که هنگام مرگ، ورد دائمی‌اش (هجیره) از اسماء الهی بر او تجلی می‌کند. اگر از اسماء افعال باشد، مانند الخالق (آفریننده) به معنای ایجادکننده، الباری (پدیدآورنده)، المصور (صورت‌بخش)، الرزاق (روزی‌دهنده)، المحیی (زنده‌کننده)، و هر اسمی که فعلی را می‌طلبد، بر حسب نحوه تعامل او با آن اسم، به صورتی که مناسب آن عمل باشد، بر او ظاهر می‌شود. پس آن را در نیکوترین صورت می‌بیند و به او می‌گوید: «تو کیستی، خدا تو را رحمت کند؟» می‌گوید: «ورد دائمی تو (هجیرک) هستم.» و ذکر هجیرات (اوراد دائمی) در این کتاب در باب احوال اقطاب در آخر آن خواهد آمد، ان‌شاءالله.\n\n(اسماء صفات)\nاگر ورد دائمی‌اش (هجیره) هر اسمی باشد که صفت کمالی را می‌طلبد، مانند الحی (زنده)، العالم (دانا)، القادر (توانا)، السمیع (شنوا)، البصیر (بینا)، المرید (اراده‌کننده)، این اسماء همگی اسماء مراقبه و حیا هستند. پس آنان نیز بر حسب حالشان در طول زندگی هنگام این اذکار، از پاکی نفوس از عوارضی که در این نشأت انسانی نفوذ می‌کند و گریز از آنها ممکن نیست، و دارویی جز حضور دائمی در مشاهده وجه الهی (الوجه الإلهی) که در هر کون عرضی و غیر عرضی دارد، نیست، خواهند بود.\n\n(اسماء نعوت)\nاگر ورد دائمی‌اش (هجیره) اسماء نعوت باشد، که اسماء نسبت‌ها هستند، مانند الأول (اول) و الآخر (آخر) و آنچه بر این منوال است، او در این اسماء بر حسب علمی که در ذکر پروردگارش با این اسماء از اضافات دارد، خواهد بود. پس می‌شناسد که آیا این اسماء عین وجودی دارند، مانند کسانی که صفات را اثبات می‌کنند، یا عین وجودی ندارند.\n\n(اسماء تنزیه)\n(و از آنان) کسی است که اسماء تنزیه (التنزيه) مانند الغنی (بی‌نیاز) هنگام احتضار بر او تجلی می‌کند. اگر چنین اسمی ورد دائمی‌اش (هجیره) در طول عمرش بوده باشد، او در آن بر حسب شهودش خواهد بود: آیا او را به بی‌نیازی از فلان چیز یاد می‌کند، یا او را غنی حمید (بی‌نیاز ستوده) یاد می‌کند بدون اینکه به ذهنش خطور کند که از فلان و فلان بی‌نیاز است، در مورد اسماء تنزیه دیگر نیز همین‌طور است.\n\n(اسماء ذات)\n(و از آنان) کسی است که ورد دائمی‌اش (هجیره) اسم «الله» یا «هو» بوده است. و «هو» نزد آنان مانند ابوحامد (غزالی) از والاترین اذکار است. و برخی «أنت» (تو) را کامل‌تر می‌دانند، و این رأی کتانی است، مانند قولش: «یا حی یا قیوم یا لا إله إلا أنت». و برخی «أنا» (من) را کامل‌تر می‌دانند، و این رأی بایزید است. پس اگر کسی که این ذکر را داشته، احتضار کند، بر حسب اعتقادش در آن، از نسبت دادن آن کنایه، از توهم تحدید و تجرید از تحدید، خواهد بود. و برخی معتقدند که تجرید و تنزیه (التنزيه) خود تحدید است، و محال است که امری بدون تحدید (حدگذاری) اصلاً تعقل شود. زیرا یا باید داخل تعقل شود یا خارج، یا نه داخل و نه خارج، یا عین امر است و نه غیر آن. و همه اینها تحدید است، زیرا هر مرتبه‌ای به ذات خود از دیگری متمایز شده است، و معنای حد جز این نیست.\n\nو این مقدار کافی است. جزء صد و نهم به پایان رسید.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 3
}