{
  "id": 440,
  "title": {
    "ar": "الباب الأربعون وأربعمائة في معرفة منازلة اشتد ركن من قوى قلبه بمشاهدتي",
    "en": "Chapter Four Hundred and Forty: Concerning the Stations of the one whose Pillar is Strengthened by the Powers of his Heart through Witnessing.",
    "ur": "باب چار سو چالیس: اس شخص کے منازل (منازل) کی معرفت (المعرفۃ) کے بیان میں جس کے قلب کی قوت سے اس کا رکن میرے مشاہدے (الشہود) کے ذریعے مضبوط ہو گیا ہے۔",
    "fa": "باب چهارصد و چهلم در معرفت منازل کسی که رکن قلبش به واسطه مشاهده من (مشاهدتي) قوی شده است"
  },
  "content": {
    "ar": "## «الباب الأربعون وأربعمائة في معرفة منازلة اشتد ركن من قوى قلبه بمشاهدتي»\n\n\n> إن القوي الذي ما زال يشهدني *** عند الشئون وما في الحق من حرج‏\n\n\n> فمن يعاندني فيما أفوه به *** من الحقائق فليرقى على درجي‏\n\n\n> ولو يراه لفداه بناظره *** وبالنفوس وبالأرواح والمهج‏\n\n\n> لكن له حجب على العيون فهم *** في الضيق في الملإ العلوي في فرج‏\n\n\n> إني مريض عليل القلب مبتئس *** في الذل والمقلة النجلاء والدعج‏\n\n\n> إني لفي ظلمات من تراكمها *** غرقت من بحرها اللجي في اللجج‏\n\n\n> الناس في سيف هذا البحر في نعم *** أين السواحل يا هذا من الثبج‏\n\n\n### [من كان الحق قواه فهو أقوى الأقوياء]\n\n\nقال الله عز وجل جلاله حكاية عن نبيه لوط عليه السلام إذ قال لقومه لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى‏ رُكْنٍ شَدِيدٍ\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الصحيح عنه يرحم الله أخي لوطا لقد كان يأوي إلى ركن شديد\n\n\nيعني من القبيلة فاعلم إن أقوى الأقوياء من كان الحق قواه ومع هذه القوة بهذه الصفة فما يكون إلا ما سبق به الكتاب ولا كتب إلا ما علم وما علم إلا ما هو عليه المعلوم ف لا تَبْدِيلَ لِكَلِماتِ الله وما يبدل القول لديه وما هو بظلام للعبيد فقوله لَوْ أَنَّ لِي بِكُمْ قُوَّةً أي همة فعالة ومن كان الحق قواه فلا همة تفعل فعل من هذه صفته لكن الأمر على ما قررناه من سبق الكتاب فلا يقع إلا ما هو الأمر عليه فأداة أو أنما أعطته عطاها الإمكان لا غير فلو أراد بالقوة إظهار الأثر الذي جاء به فيهم وأراد بالركن الشديد إذ لم يتمكن الأثر فيهم أن يحمي نفسه عنهم حتى لا يؤثروا فيه فلهذا صَلَّى اللهُ عَليهِ وسَلَّم ذكر الأمرين القوة والإيواء ولا شك أن الرسل عليه السلام هم أعلم الناس بالله فلا يأوون إلا إلى الله وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم يرحم الله أخي لوطا لقد كان يأوي إلى ركن شديد\n\n\nيعني بذلك إيواءه إلى الله فآوى إلى من يَفْعَلُ ما يُرِيدُ ولا اختيار في إرادته ولا رجوع عن علمه فآوى إلى من لا تبديل لديه‏\n\n\n> فما الجبر إلا ظاهر متحقق *** فما ثم تحيير وما ثم منقلب‏\n\n\n> فلا تهربن فالأمر ما قد سمعته *** فإن لم توافقه فما ينفع الهرب‏\n\n\n> فعلم إلهي عين حالي فما أنا *** عليه فأمليه عليه إذا كتب‏\n\n\n> فأنت سبقت القول والعلم والذي *** يؤدي إلى الفوز العظيم أو العطب‏\n\n\nفلا ركن أشد من ركنك وما نفعك وإنما قلنا إنك أشد الأركان من كون القضاء ما جرى عليك إلا بما كسبت يداك‏\nوهو ما أعطته قدرتك فأضاف الفعل إليك وليس إلا ما قررناه من أنه ما علم منك إلا ما أنت عليه فإذا وهى ركنك بالنظر إلى غرضك فلم نفسك فإن الحق المحكوم به تابع أبد الحال المحكوم به عليه فالمحكوم عليه هو الذي جنى على نفسه لا الحاكم بالمحكوم به وإنما تعددت الأركان من أجل الحجب التي أرسلها الحق بينك وبين الأصل وكون الأمر جعله مثل البيت على أربعة أركان ركن العلم وركن القول وهو قوله عز وجل هذا كِتابُنا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ وركن المشيئة وركن الأصل وهو أنت وهو الركن الأول من البيت والثلاثة الأركان توابع فمن الناس من استند في حاله إلى علم الله فيه ومنهم من استند إلى مشيئته ومنهم من استند إلى ما كتب الله عليه وصاحب الذوق من يرى جميع ما ذكرناه ووقف مع نفسه وقال أنا الركن الذي مرجع الكل إليه فهو الأول الذي أنبنى من هذا البيت ولكن صاحبه عزيز فإن الصحيح عزيز فالكل معلول عندهم وعندي إن العالم هو عين العلة والمعلول ما أقول إن الحق علة له كما يقوله بعض النظار فإن ذلك غاية الجهل بالأمر فإن القائل بذلك ما عرف الوجود ولا من هو الموجود فأنت يا هذا معلول بعلتك والله خالقك فافهم‏\n\n\n### [خلق الإنسان والجن لأجل العبادة]\n\n\nواعلم أنه من أوجدك له لا لك ففي حق نفسه عمل لا في حقك فما أنت المقصود لعينك قال عز وجل وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فذكر ما ظهر وهو مسمى الإنس وما استتر وهو مسمى الجن فإذا نظرت إلى هذا الخبر وسعدت أنت بهذه الوجوه فإنما سعدت بحكم التبعية فاعلم ما يقول له إذا قرر عليك النعم فإنما يقررها عليك لسان الإمكان فإن شئت فاسمع واسكت وإن شئت فتكلم كلاما يسمع منك وليس إلا أن تقول له ما قاله فبكلامه تحتج إن أردت أن تكون ذا حجة وإن تأدبت وسكت فإنه يعلم منك على ما سكت وانطويت عليه فما كل حق ينبغي أن يقال ولا يذاع ولا سيما في موطن الأشهاد والخصم قوي والحاكم الله ولا يحكم إلا بالحق الذي سأل منه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن يحكم به في قوله قالَ رَبِّ احْكُمْ بِالْحَقِّ ورَبُّنَا الرَّحْمنُ الْمُسْتَعانُ عَلى‏ ما تَصِفُونَ ولو لا ما هو الرحمن ما اجترأ العبد أن يقول رَبِّ احْكُمْ بِالْحَقِّ فإنه تعالى ما يحكم إلا بالحق فإنه ما يتعدى علمه فيه الذي أخذه منه أزلا وظهر حكمه أبدا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 440: Concerning the Knowledge of the Station of the One Whose Pillar is Strengthened by the Power of His Heart through Witnessing Me\n\nIndeed, the powerful one is he who never ceases to witness Me,\nAmidst the affairs, and there is no constraint in The Real (الحق).\nSo whoever opposes me in what I utter\nConcerning the Realities (الحقائق), let him ascend to my degree.\nAnd if he were to see him, he would ransom him with his sight,\nAnd with souls, spirits, and vital essences.\nBut he has veils over the eyes, so they are\nIn distress in the celestial assembly (الملإ العلوي), yet in relief.\nIndeed, I am sick, ill of heart, and sorrowful,\nIn humility, with wide, dark eyes.\nIndeed, I am in darknesses due to their accumulation,\nI drowned from its deep sea into the depths.\nPeople are on the shore of this sea, in bliss;\nO you, where are the shores compared to the deep center?\n\n### [He Whose Strength is The Real is the Strongest of the Strong]\n\nAllah, exalted is His Majesty, relates concerning His Prophet Lot (peace be upon him) when he said to his people: <<لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى‏ رُكْنٍ شَدِيدٍ>> (If only I had strength against you, or could take refuge in a strong pillar.)\n\nAnd the Messenger of Allah (may Allah bless him and grant him peace) said in the authentic tradition concerning him: \"May Allah have mercy on my brother Lot, for he surely took refuge in a strong pillar.\"\n\nHe meant by this [the pillar] from the tribe. Know, then, that the strongest of the strong is he whose strength is The Real (الحق). And with this strength, possessing this attribute, nothing occurs except what the Book has predetermined, and nothing is written except what was known, and nothing is known except what the known thing (المعلوم) is in itself. Thus, <<لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ>> (There is no changing the Words of Allah), and the decree is not altered by Him, and He is not unjust to the servants.\n\nHis saying, \"If only I had strength,\" means an effective spiritual resolve (همة فعالة). And he whose strength is The Real, no resolve can act as the resolve of one whose attribute is this. However, the matter is as we have established concerning the predetermination of the Book, so nothing occurs except what the matter is upon. The particle 'or' (أو) only granted him the gift of possibility, nothing more.\n\nIf he had intended by 'strength' the manifestation of the effect that came upon them, and by 'a strong pillar'—since the effect did not take hold of them—he intended to protect himself from them so that they would not affect him, this is why the Prophet (may Allah bless him and grant him peace) mentioned both matters: strength and taking refuge. There is no doubt that the Messengers (peace be upon them) are the most knowledgeable of people concerning Allah, so they take refuge only in Allah. This is what he meant by his saying (may Allah bless him and grant him peace): \"May Allah have mercy on my brother Lot, for he surely took refuge in a strong pillar.\"\n\nHe meant by that his taking refuge in Allah, for he took refuge in the One Who does what He wills, and there is no choice in His Will, nor retraction from His Knowledge. Thus, he took refuge in the One with Whom there is no changing.\n\nDeterminism (الجبر) is nothing but a manifest, verified reality,\nSo there is no confusion, and there is no turning back.\nSo do not flee, for the matter is what you have heard,\nAnd if you do not agree with it, flight will not benefit you.\nFor Divine Knowledge (علم إلهي) is the very essence of my state, so what I am\nUpon, I dictate it to Him when He writes.\nFor you preceded the saying and the knowledge, and that which\nLeads to the great triumph or to ruin.\n\nThere is no pillar stronger than your own pillar, yet it did not benefit you. We only said that you are the strongest of the pillars because the Divine Decree (القضاء) only ran against you based on what your hands earned. This is what your power granted, so He attributed the act to you. Yet, it is nothing but what we have established: that He only knew of you what you are in yourself.\n\nIf your pillar weakens when considering your objective, then blame yourself. For the decreed Reality (الحق المحكوم به) is eternally subservient to the one upon whom the decree is passed. The one upon whom the decree is passed is the one who wronged himself, not the Judge by the decree passed.\n\nThe pillars became multiple due to the veils (الحجب) that The Real sent down between you and the Origin (الأصل). The matter was made like a House resting upon four pillars: the Pillar of Knowledge (ركن العلم), the Pillar of Saying (ركن القول)—which is His saying, exalted is He: <<هَذَا كِتَابُنَا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ>> (This, Our Book, speaks against you with the truth)—the Pillar of Will (ركن المشيئة), and the Pillar of the Origin (ركن الأصل), which is you. This is the first pillar of the House, and the other three pillars are subsidiaries.\n\nAmong people, some rely in their state upon Allah’s Knowledge concerning them, some rely upon His Will, and some rely upon what Allah has written upon them. The possessor of Gnosis (صاحب الذوق) is the one who sees all that we have mentioned and stands with himself, saying: \"I am the pillar to which everything returns. I am the First (الأول) upon which this House was built.\" But the one who possesses this is rare, for the sound one is rare.\n\nFor them, everything is an effect (معلول), but for me, the world (العالم) is the very essence of the cause (العلة). I do not say that The Real is a cause for it, as some speculative thinkers (النظار) say, for that is the height of ignorance concerning the matter. The one who says that has not known Being (الوجود) nor Who the Existent (الموجود) is. O you, you are the effect (معلول) of your own cause (علتك), and Allah is your Creator. Understand this.\n\n### [The Creation of Humans and Jinn for the Sake of Worship]\n\nKnow that He brought you into existence for Him, not for you. He acted in respect to His own right, not in respect to yours. You are not the intended object for your own sake. He, exalted is He, said: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except that they should worship Me.)\n\nHe mentioned what is manifest, which is called mankind (الإنس), and what is hidden, which is called jinn (الجن). If you look at this news and are blessed by these aspects, you are only blessed by the rule of subservience (التبعية).\n\nKnow what He says to you when He confirms blessings upon you; it is the tongue of possibility (لسان الإمكان) confirming them upon you. If you wish, listen and be silent. If you wish, speak words that are heard from you. It is nothing but that you say to Him what He said. You argue with His words if you wish to possess an argument. If you behave courteously and remain silent, He knows what you conceal and fold within yourself.\n\nNot every truth should be spoken or broadcast, especially in the station of witnessing (موطن الأشهاد), where the opponent is strong and the Judge is Allah. He judges only by the truth (الحق) which the Messenger of Allah (may Allah bless him and grant him peace) asked Him to judge by in his saying: <<قَالَ رَبِّ احْكُمْ بِالْحَقِّ وَرَبُّنَا الرَّحْمَنُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ>> (My Lord, judge with the truth. And our Lord is the Most Merciful, the One Whose help is sought against that which you describe.)\n\nWere it not that He is the Most Merciful (الرحمن), the servant would not dare to say, \"My Lord, judge with the truth,\" for He, the Exalted, judges only by the truth. He does not transgress His Knowledge concerning it, which He took from it eternally, and whose judgment appeared perpetually. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way.)",
    "ur": "باب نمبر چار سو چالیس: اس شخص کے مقام کی معرفت میں جس کے دل کی قوتوں کا رکن میرے (ذات حق کے) مشاہدے (شہود) سے مضبوط ہو گیا۔\n\nوہ قوی (طاقتور) جو ہمیشہ میرا (ذات حق کا) شہود (شہود) کرتا ہے،\nتمام معاملات میں، اور حق (الحق) میں کوئی تنگی نہیں۔\nپس جو کوئی بھی ان حقائق کے بارے میں مجھ سے عناد رکھے جن کا میں اظہار کرتا ہوں،\nتو اسے چاہیے کہ وہ میرے درجے پر چڑھ آئے۔\n\nاور اگر وہ اسے دیکھ لے تو اپنی آنکھوں سے،\nاور اپنی جانوں، روحوں اور دلوں سے اس پر فدا ہو جائے۔\nلیکن اس پر پردے ہیں جو آنکھوں پر پڑے ہیں، پس وہ\nعالم بالا (الملإ العلوي) میں تنگی میں ہیں، جبکہ وہ کشادگی میں ہے۔\n\nمیں بیمار ہوں، دل کا مریض، غمگین ہوں،\nذلت میں، کشادہ اور سیاہ آنکھوں کے ساتھ۔\nمیں تاریکیوں میں ہوں جو ایک دوسرے پر جمع ہو گئی ہیں،\nمیں اس کے گہرے سمندر کی گہرائیوں (اللجج) میں ڈوب گیا ہوں۔\n\nلوگ اس سمندر کے کنارے نعمتوں میں ہیں،\nاے شخص! ساحل گہرائی (الثبج) سے کہاں ہیں؟\n\n[جس کی قوت ذات حق ہو، وہ سب سے زیادہ قوی ہے]\n\nاللہ عز و جل جلالہ نے اپنے نبی لوط علیہ السلام کا قول نقل کرتے ہوئے فرمایا جب انہوں نے اپنی قوم سے کہا: لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى‏ رُكْنٍ شَدِيدٍ (کاش مجھ میں تمہارے مقابلے کی طاقت ہوتی یا میں کسی مضبوط ستون کی پناہ لے سکتا)۔\n\nتو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے صحیح حدیث میں ان کے بارے میں فرمایا: \"اللہ میرے بھائی لوط پر رحم فرمائے، وہ یقیناً ایک مضبوط ستون کی پناہ لے رہے تھے\"۔\n\nیعنی قبیلے کے لحاظ سے۔ پس جان لو کہ سب سے زیادہ قوی (الأقوياء) وہ ہے جس کی قوت (القوة) ذات حق (الحق) ہو۔ اور اس صفت کے ساتھ اس قوت کے ہوتے ہوئے بھی وہی ہوتا ہے جو کتاب (الکتاب) میں پہلے لکھا جا چکا ہے، اور کتاب میں وہی لکھا گیا جو علم میں تھا، اور علم میں وہی تھا جو معلوم (المعلوم) پر ہے۔ پس لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ (اللہ کی باتوں میں کوئی تبدیلی نہیں) اور اس کے ہاں بات بدلی نہیں جاتی، اور وہ بندوں پر ظلم کرنے والا نہیں ہے۔\n\nپس ان کا قول لَوْ أَنَّ لِي بِكُمْ قُوَّةً (کاش مجھ میں تمہارے مقابلے کی طاقت ہوتی) یعنی ایک فعال ہمت (ہمۃ فعالة)۔ اور جس کی قوت ذات حق (الحق) ہو، تو کوئی ہمت (ہمۃ) اس شخص جیسا فعل نہیں کر سکتی جس کی یہ صفت ہو۔ لیکن معاملہ اسی طرح ہے جیسا کہ ہم نے کتاب (الکتاب) کے سبقت لے جانے سے طے کر دیا ہے، پس وہی واقع ہوتا ہے جس پر معاملہ ہے۔\n\nپس \"أو\" (یا) کا آلہ صرف امکان (الإمکان) کی عطا دیتا ہے، اور کچھ نہیں۔ اگر وہ قوت (القوة) سے مراد وہ اثر ظاہر کرنا چاہتے جو وہ ان میں لائے تھے، اور مضبوط ستون (الرکن الشدید) سے مراد یہ لیتے کہ جب اثر ان میں ممکن نہ ہو سکا تو وہ ان سے اپنی حفاظت کریں تاکہ وہ ان پر اثر انداز نہ ہو سکیں، تو اسی لیے نبی صَلَّى اللهُ عَليهِ وسَلَّم نے دونوں چیزوں کا ذکر کیا: قوت (القوة) اور پناہ لینا۔ اور اس میں کوئی شک نہیں کہ رسول علیہم السلام اللہ کو سب سے زیادہ جاننے والے ہیں، پس وہ صرف اللہ کی پناہ لیتے ہیں، اور یہی ان کا قول صَلَّى اللهُ عَليهِ وسَلَّم ہے: \"اللہ میرے بھائی لوط پر رحم فرمائے، وہ یقیناً ایک مضبوط ستون کی پناہ لے رہے تھے\"۔\n\nاس سے مراد ان کا اللہ کی پناہ لینا ہے۔ پس انہوں نے اس کی پناہ لی جو يَفْعَلُ مَا يُرِيدُ (جو چاہتا ہے کرتا ہے)، اور اس کے ارادے میں کوئی اختیار نہیں، اور اس کے علم سے کوئی رجوع نہیں۔ پس انہوں نے اس کی پناہ لی جس کے ہاں کوئی تبدیلی نہیں۔\n\nپس جبر (الجبر) تو صرف ایک ظاہر شدہ حقیقت ہے،\nپس نہ وہاں کوئی حیرانی ہے اور نہ کوئی پلٹنے کی جگہ۔\nپس بھاگو نہیں، کیونکہ معاملہ وہی ہے جو تم سن چکے ہو،\nاگر تم اس سے موافقت نہیں کرتے تو بھاگنا کوئی فائدہ نہیں دے گا۔\n\nپس میرا الٰہی علم (علم إلهي) میری حالت کا عین ہے، پس میں جس حال پر ہوں،\nمیں اسے اس پر املا کرتا ہوں جب وہ لکھتا ہے۔\nپس تم نے قول اور علم میں سبقت حاصل کی، اور وہی\nجو عظیم کامیابی یا ہلاکت کی طرف لے جاتا ہے۔\n\nپس تمہارے رکن (رکن) سے زیادہ مضبوط کوئی رکن نہیں، اور اس نے تمہیں کوئی فائدہ نہیں دیا، اور ہم نے یہ اس لیے کہا کہ تم سب سے مضبوط رکن ہو کہ قضا (القضاء) تم پر صرف اسی چیز کے ساتھ جاری ہوئی جو تمہارے ہاتھوں نے کمایا۔\n\nاور یہ وہی ہے جو تمہاری قدرت نے عطا کیا، پس فعل کو تمہاری طرف منسوب کیا گیا، حالانکہ یہ صرف وہی ہے جو ہم نے طے کیا کہ اس نے تم سے صرف وہی جانا جو تم اس پر ہو۔ پس جب تمہارا رکن (رکن) تمہارے مقصد کے لحاظ سے کمزور پڑ جائے، تو اپنے آپ کو ملامت کرو، کیونکہ ذات حق (الحق) جس کا حکم دیا گیا ہے، وہ ہمیشہ اس کے تابع ہے جس پر حکم دیا گیا ہے۔ پس جس پر حکم دیا گیا ہے، وہی ہے جس نے اپنے آپ پر زیادتی کی، نہ کہ حاکم نے حکم کے ذریعے زیادتی کی۔\n\nاور ارکان (الأركان) کی کثرت ان پردوں (الحجب) کی وجہ سے ہوئی جنہیں ذات حق (الحق) نے تمہارے اور اصل (الأصل) کے درمیان بھیجا، اور اس وجہ سے کہ اس نے معاملے کو گھر کی طرح چار ارکان پر بنا دیا: علم کا رکن (رکن العلم)، اور قول کا رکن (رکن القول) – اور یہ اس کا قول عز و جل ہے: هَذَا كِتَابُنَا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ (یہ ہماری کتاب ہے جو تم پر حق کے ساتھ بولتی ہے) – اور مشیئت (المشيئۃ) کا رکن، اور اصل (الأصل) کا رکن، اور وہ تم ہو، اور یہ گھر کا پہلا رکن ہے، اور باقی تین ارکان اس کے تابع ہیں۔\n\nپس لوگوں میں سے کچھ وہ ہیں جنہوں نے اپنی حالت میں اللہ کے علم پر بھروسہ کیا جو ان کے بارے میں ہے، اور ان میں سے کچھ وہ ہیں جنہوں نے اس کی مشیئت (المشيئۃ) پر بھروسہ کیا، اور ان میں سے کچھ وہ ہیں جنہوں نے اس پر بھروسہ کیا جو اللہ نے ان پر لکھا۔ اور صاحب ذوق (صاحب الذوق) وہ ہے جو ان تمام چیزوں کو دیکھتا ہے جن کا ہم نے ذکر کیا، اور اپنے نفس کے ساتھ ٹھہرتا ہے اور کہتا ہے: میں وہ رکن ہوں جس کی طرف سب کا مرجع ہے، پس میں وہ اول (الأول) ہوں جس پر یہ گھر تعمیر ہوا ہے۔ لیکن اس کا ساتھی نایاب ہے، کیونکہ صحیح (الصحیح) نایاب ہے۔ پس ان کے نزدیک سب معلول (معلول) ہیں، اور میرے نزدیک عالم (العالم) ہی عین علت (العلۃ) ہے۔ میں یہ نہیں کہتا کہ ذات حق (الحق) اس کے لیے علت (علۃ) ہے جیسا کہ بعض نظریاتی علماء (النظار) کہتے ہیں، کیونکہ یہ معاملے سے انتہائی جہالت ہے۔ کیونکہ یہ کہنے والا نہ ہستی (الوجود) کو جانتا ہے اور نہ یہ کہ موجود (الموجود) کون ہے۔ پس اے شخص! تم اپنی علت (علۃ) کے ساتھ معلول (معلول) ہو، اور اللہ تمہارا خالق ہے، پس سمجھو۔\n\n[انسان اور جنوں کی تخلیق عبادت کے لیے]\n\nاور جان لو کہ جس نے تمہیں اس کے لیے (لہ) پیدا کیا ہے، تمہارے لیے (لک) نہیں، پس اس نے اپنے حق میں عمل کیا، تمہارے حق میں نہیں۔ پس تم اپنی ذات کے لیے مقصود نہیں ہو۔ اللہ عز و جل نے فرمایا: وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا ہے)۔\n\nپس اس نے اس کا ذکر کیا جو ظاہر ہے، اور وہ انسان (الإنس) کہلاتا ہے، اور اس کا بھی جو پوشیدہ ہے، اور وہ جن (الجن) کہلاتا ہے۔ پس جب تم اس خبر کو دیکھو اور تم ان وجوہات سے خوش ہو جاؤ، تو تم صرف تبعیت کے حکم سے خوش ہوئے ہو۔\n\nپس جان لو کہ جب وہ تم پر نعمتوں کا اقرار کرتا ہے تو وہ تم سے کیا کہتا ہے، وہ تم پر ان کا اقرار صرف امکان (الإمکان) کی زبان سے کرتا ہے۔ پس اگر تم چاہو تو سنو اور خاموش رہو، اور اگر تم چاہو تو ایسی بات کرو جو تم سے سنی جائے، اور یہ صرف یہی ہے کہ تم اس سے وہی کہو جو اس نے کہا۔ پس اگر تم دلیل والا ہونا چاہتے ہو تو اس کے کلام سے دلیل پکڑو۔ اور اگر تم نے ادب کیا اور خاموش رہے، تو وہ تمہارے بارے میں جانتا ہے کہ تم کس حال پر خاموش رہے اور کس پر لپٹے رہے۔\n\nپس ہر حق ایسا نہیں ہے کہ اسے کہا جائے اور نہ ہی اسے پھیلایا جائے، خاص طور پر گواہیوں کے مقام پر، جبکہ فریق مخالف قوی ہو اور حاکم اللہ ہو، اور وہ صرف اسی حق کے ساتھ فیصلہ کرتا ہے جس کے ساتھ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فیصلہ کرنے کی دعا کی تھی، اپنے اس قول میں: قَالَ رَبِّ احْكُمْ بِالْحَقِّ وَرَبُّنَا الرَّحْمَنُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ (انہوں نے کہا: اے میرے رب! حق کے ساتھ فیصلہ فرما، اور ہمارا رب رحمن ہے، جس سے تمہاری بیان کردہ باتوں پر مدد مانگی جاتی ہے)۔\n\nاور اگر وہ رحمن نہ ہوتا تو بندہ یہ کہنے کی جرأت نہ کرتا: رَبِّ احْكُمْ بِالْحَقِّ (اے میرے رب! حق کے ساتھ فیصلہ فرما)، کیونکہ وہ (اللہ تعالیٰ) صرف حق کے ساتھ ہی فیصلہ کرتا ہے۔ کیونکہ وہ اس علم سے تجاوز نہیں کرتا جو اس نے ازل میں اس سے لیا، اور جس کا حکم ہمیشہ ظاہر ہوا۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و چهلم در معرفت منزلتی که رکن کسی که قلبش به مشاهده (مشاهدتي) من قوی شده، محکم گشته است.\n\nهمانا آن قوی کسی است که پیوسته مرا شهود (يشهدني) می‌کند *** در هنگام امور و در حق (الحق) هیچ تنگی و دشواری نیست.\n\nپس هر که در حقایقی (الحقائق) که بر زبان می‌آورم با من عناد ورزد *** باید بر نردبان من بالا رود.\n\nو اگر او را ببیند، با دیدگانش فدایش کند *** و با جان‌ها و روان‌ها و قلب‌ها.\n\nلیکن برای او حجاب‌هایی بر دیدگان است، پس آنان *** در تنگی هستند، در حالی که در مَلَأ اعلی (الملإ العلوي) در گشایش‌اند.\n\nمن بیمار و دل‌رنجور و غمگینم *** در خواری و با چشم درشت و سیاه.\n\nمن در تاریکی‌هایی از انباشتگی آن‌ها هستم *** که از دریای ژرف آن در اعماق غرق شده‌ام.\n\nمردم در ساحل این دریا در نعمت‌اند *** ای دوست، سواحل کجا و عمق دریا کجا؟\n\n[کسی که حق (الحق) قوای او باشد، قوی‌ترینِ قوی‌هاست]\n\nخداوند عز و جل جلاله در حکایت از پیامبرش لوط علیه السلام می‌فرماید، آنگاه که به قومش گفت: «کاش مرا بر شما نیرویی بود یا به پناهگاهی استوار روی می‌آوردم.» (لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى‏ رُكْنٍ شَدِيدٍ)\n\nپس رسول خدا صلی الله علیه و سلم در حدیث صحیح درباره او فرمود: «خداوند برادرم لوط را رحمت کند، او به پناهگاهی استوار روی آورد.» (يرحم الله أخي لوطا لقد كان يأوي إلى ركن شديد)\n\nیعنی [منظور لوط] از قبیله بود. پس بدان که قوی‌ترینِ قوی‌ها کسی است که حق (الحق) قوای او باشد. و با این قوت و با این صفت، چیزی جز آنچه در کتاب سبقت گرفته، واقع نمی‌شود؛ و نوشته نشده مگر آنچه دانسته شده، و دانسته نشده مگر آنچه معلوم (المعلوم) بر آن است. پس «در کلمات خدا هیچ تغییری نیست.» (لا تَبْدِيلَ لِكَلِماتِ الله) و سخن نزد او دگرگون نمی‌شود و او بر بندگان ستمکار نیست. پس سخن او «کاش مرا بر شما نیرویی بود» (لَوْ أَنَّ لِي بِكُمْ قُوَّةً) یعنی همتی فعال. و کسی که حق (الحق) قوای او باشد، هیچ همتی فعلِ کسی که صفتش این است را انجام نمی‌دهد. لیکن امر بر همان است که ما مقرر کردیم، یعنی سبقت کتاب (قضا و قدر)، پس واقع نمی‌شود مگر آنچه امر بر آن است. پس حرف «أو» (یا) تنها عطای امکان (الإمكان) را به او داده است و نه چیز دیگر.\n\nپس اگر منظور او از «قوت»، آشکار ساختن اثری بود که در میان آنان آورده بود، و منظور او از «رکن شدید» (پناهگاه استوار) این بود که چون اثر در آنان متمکن نشد، خود را از آنان حفظ کند تا در او تأثیر نگذارند؛ به همین دلیل پیامبر صلی الله علیه و سلم هر دو امر، یعنی قوت و پناه بردن (الإيواء) را ذکر کرد. و شکی نیست که رسولان علیهم السلام داناترین مردم به خدا هستند، پس جز به خدا پناه نمی‌برند. و این همان سخن پیامبر صلی الله علیه و سلم است: «خداوند برادرم لوط را رحمت کند، او به پناهگاهی استوار روی آورد.» (يرحم الله أخي لوطا لقد كان يأوي إلى ركن شديد)\n\nیعنی با آن، پناه بردن او به خدا را قصد کرده است. پس به کسی پناه برد که «آنچه را می‌خواهد انجام می‌دهد» (يَفْعَلُ ما يُرِيدُ)، و در اراده او اختیاری نیست و از علم او بازگشتی وجود ندارد. پس به کسی پناه برد که نزد او تبدیلی نیست.\n\nپس جبر (الجبر) نیست مگر ظاهری محقق *** پس نه حیرتی هست و نه بازگشتی.\n\nپس مگریز، زیرا امر همان است که شنیدی *** و اگر با آن موافق نباشی، گریز سودی ندارد.\n\nپس علم الهی عین حال من است، و آنچه من *** بر آن هستم را هنگامی که می‌نویسد، بر او املا می‌کنم.\n\nپس تو بر قول و علم سبقت گرفتی، و آن [علم] *** به رستگاری بزرگ یا هلاکت می‌انجامد.\n\nپس هیچ رکنی استوارتر از رکن تو نیست و [با این حال] تو را سودی نبخشید. و ما گفتیم که تو استوارترین ارکان هستی، از آن جهت که قضا بر تو جاری نشد مگر به آنچه دستانت کسب کرده است.\n\nو آن همان چیزی است که قدرت تو آن را عطا کرده، پس فعل را به تو نسبت داده است. و جز همان نیست که ما مقرر کردیم که از تو دانسته نشده مگر آنچه تو بر آن هستی. پس اگر رکن تو با توجه به غرضت سست شد، خود را ملامت کن؛ زیرا حق (الحق) که حکم شده، همیشه تابع حالِ کسی است که بر او حکم شده است. پس محکوم‌علیه است که بر خود جنایت کرده، نه حاکم به حکم.\n\nو ارکان تنها به خاطر حجاب‌هایی که حق (الحق) میان تو و اصل فرستاده، متعدد شده‌اند. و امر را مانند خانه‌ای بر چهار رکن قرار داده است: رکن علم، و رکن قول که سخن عز و جل است: «این کتاب ماست که به حق بر شما سخن می‌گوید.» (هذا كِتابُنا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ)، و رکن مشیت، و رکن اصل که همان تو هستی و آن رکن اول خانه است، و سه رکن دیگر توابع هستند. پس برخی از مردم در حال خود به علم خدا در مورد خویش تکیه می‌کنند، و برخی به مشیت او، و برخی به آنچه خدا بر آنان نوشته است. و صاحب ذوق (الذوق) کسی است که تمام آنچه را ذکر کردیم می‌بیند و با خود می‌ایستد و می‌گوید: من رکنی هستم که مرجع همه به سوی من است. پس من اولین هستم که این خانه بر او بنا شده است. اما صاحب این مقام کمیاب است، زیرا صحیح کمیاب است. پس نزد آنان همه معلول (المعلول) هستند، در حالی که نزد من، عالَم عین علت است. و من نمی‌گویم که حق (الحق) علت برای آن است، چنانکه برخی از اهل نظر (النظار) می‌گویند؛ زیرا این نهایت جهل به امر است. چرا که گوینده این سخن، هستی (الوجود) و موجود (الموجود) را نشناخته است. پس ای دوست، تو معلولِ علت خود هستی و خداوند خالق توست، پس بفهم.\n\n[آفرینش انسان و جن برای عبادت]\n\nو بدان که او تو را برای خودش ایجاد کرد، نه برای تو. پس در حق خود عمل کرد، نه در حق تو. تو مقصودِ ذات خود نیستی. خداوند عز و جل می‌فرماید: «و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند.» (وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ) پس آنچه آشکار است، یعنی مسمای انس، و آنچه پنهان است، یعنی مسمای جن، را ذکر کرد.\n\nپس اگر به این خبر بنگری و تو به این وجوه سعادتمند شوی، تنها به حکم تبعیت سعادتمند شده‌ای. پس بدان که اگر [حق] نعمت‌ها را بر تو مقرر می‌دارد، زبان امکان (الإمكان) است که آن‌ها را بر تو مقرر می‌دارد. اگر خواستی، بشنو و ساکت باش؛ و اگر خواستی، سخنی بگو که از تو شنیده شود. و چاره‌ای نیست جز اینکه آنچه را او گفته، تو نیز به او بگویی. پس اگر می‌خواهی صاحب حجت باشی، با کلام او احتجاج کن. و اگر ادب ورزیدی و سکوت کردی، او از تو بر اساس آنچه سکوت کردی و در خود پنهان داشتی، آگاه است.\n\nپس هر حقی را نباید گفت و نباید فاش کرد، به ویژه در جایگاه گواهی‌ها، در حالی که خصم قوی است و حاکم خداست. و او حکم نمی‌کند مگر به حقی که رسول خدا صلی الله علیه و سلم در سخن خود از او خواست که به آن حکم کند: «گفت: پروردگارا، به حق حکم کن، و پروردگار ما رحمان است که بر آنچه وصف می‌کنید یاری‌دهنده است.» (قالَ رَبِّ احْكُمْ بِالْحَقِّ ورَبُّنَا الرَّحْمنُ الْمُسْتَعانُ عَلى‏ ما تَصِفُونَ) و اگر او رحمان نبود، بنده جرأت نمی‌کرد بگوید: «پروردگارا، به حق حکم کن.» (رَبِّ احْكُمْ بِالْحَقِّ) زیرا او تعالی جز به حق حکم نمی‌کند، چرا که از علم خود در آن تجاوز نمی‌کند؛ علمی که از ازل از او گرفته و حکمش تا ابد آشکار شده است. و «خداوند حق (الحق) را می‌گوید و اوست که راه را می‌نمایاند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 2
}