{
  "id": 88,
  "title": {
    "ar": "الباب الثامن والثمانون في معرفة أسرار أصول أحكام الشرع",
    "en": "Chapter Eighty-Eight: Concerning the Knowledge of the Secrets of the Fundamental Principles of the Sacred Law.",
    "ur": "باب اٹھاسی: شریعت کے احکام کے اصولوں کے اسرار کی معرفت میں",
    "fa": "باب هشتاد و هشتم در معرفت اسرار اصول احکام شریعت"
  },
  "content": {
    "ar": "## (الباب الثامن والثمانون في معرفة أسرار أصول أحكام الشرع)\n\n\n> الشرع ما شرع الإله تخلقا *** فهو العليم بحقهم وبحقه‏\n\n\n> فإذا أتى عبد يشرع شرعة *** قام الإله بحقها في حقه‏\n\n\n> والشرعتان هما من أصل واحد *** ما لم يقل قال الإله لخلقه‏\n\n\n> فإذا يقول فإنها أحبولة *** نجم القرين بنجمها من أفقه‏\n\n\n> ليصدقوا ما قلدوا أفكارهم *** فهو الكذوب وإن أتاك بصدقه‏\n\n\n> فلتعتبر أحكام أصل كتابها *** فلربما غص اللعين بريقه‏\n\n\n### [أصول الشرع المتفق عليها والمختلف فيها]\n\n\nاعلم أن أصول أحكام الشرع المتفق عليها ثلاث الكتاب والسنة المتواترة والإجماع واختلف العلماء في القياس فمن قائل بأنه دليل وأنه من أصول الأحكام ومن قائل بمنعه وبه أقول‏\n\n\n### [التقوى عمل مشروع فلا بد أن ينسب حكمه إلى دليل أو أصل شرعي‏]\n\n\nقال الله تعالى واتَّقُوا الله ويُعَلِّمُكُمُ الله وقال إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً وقال اتَّقُوا الله وآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ من رَحْمَتِهِ ويَجْعَلْ لَكُمْ نُوراً تَمْشُونَ به ويَغْفِرْ لَكُمْ مثل قوله في عبده خضر آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً فجعل إعطاءه العلم عبده من رحمته والتقوى عمل مشروع لنا فلا بد أن تكون التقوى نسبة حكمه إلى دليل من هذه الأدلة أو إلى كلها في أي مسألة يلزمنا فيها تقوى الله‏\n\n\n### [الأصول الفاعلة والمنفعلة في الشرع والحقائق الإلهية والكونية]\n\n\nقال الجنيد علمنا هذا مقيد بالكتاب والسنة وهما الأصلان الفاعلان والإجماع والقياس إنما يثبتان وتصح دلالتهما بالكتاب والسنة فهما أصلان في الحكم منفعلان فظهرت عن هذه الأربع الحقائق نشأة الأحكام المشروعة التي بالعمل بها تكون السعادة فإن الموجودات ظهرت عن أربع حقائق إلهية وهي الحياة والعلم والإرادة والقدرة والأجسام ظهرت عن أربع حقائق عن حرارة وبرودة ويبوسة ورطوبة والمولدات ظهرت عن أربعة أركان نار وهواء وماء وتراب وجسم الإنسان والحيوان ظهر عن أربعة أخلاط صفرا وسودا ودم وبلغم فالحرارة والبرودة فاعلان والرطوبة واليبوسة منفعلتان فاعلم‏\n\n\n### [المعنى البعيد لقول الجنيد: علمنا مقيد بالكتاب والسنة]\n\n\nولما كان من لا يؤمن بالشرائع المنزلة يشاركنا بالرياضة والمجاهدة وتخليص النفس من حكم الطبيعة يظهر عليه الاتصال بالأرواح الطاهرة الزكية ويظهر حكم ذلك الاتصال عليه مثل ما يظهر من المؤمنين العاملين منا بالشرائع المنزلة بما وقع من التشبيه والاشتراك فيما ذكرناه عند عامة الناس ونطقنا بالعلوم التي يعطيها كشف الرياضة وإمداد الأرواح العلوية وانتقش في هذه النفوس الفاضلة جميع ما في العالم فنطقوا بالغيوب قال الجنيد علمنا هذا وإن وقع فيه الاشتراك بيننا وبين العقلاء فأصل رياضتنا ومجاهدتنا وأعمالنا التي أعطتنا هذه العلوم والآثار الظاهرة علينا إنما كان من عملنا على الكتاب والسنة فهذا معنى قوله علمنا هذا مقيد بالكتاب والسنة وتتميز يوم القيامة عن أولئك بهذا القدر فإنهم ليس لهم في الإلهيات ذوق فإن فيضهم روحاني وفيضنا روحاني وإلهي لكوننا سلكنا على طريقة إلهية تسمى شريعة فأوصلتنا إلى المشرع وهو الله تعالى لأنه جعلها طريقا إليه فاعلم ذلك‏\n\n\n### [الإجماع لا بد أن يستند إلى نص وإن لم ينطق به‏]\n\n\nولما كان شرع الله وحكمه في حركات الإنسان المكلف لا يؤخذ إلا من القرآن كذلك لم توجد إلا بالمتكلم به وهو الله تعالى فقال للشي‏ء كن فكان فالقرآن أقوى دليل يستند إليه أو ما صح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم الذي قام الدليل على صدقه أنه مخبر عن الله جميع ما شرعه في عبيد الله وقد يكون ذلك الخبر إما بإجماع من الصحابة وهو الإجماع أو من بعضهم بنقل العدل عن العدل وهو خبر الواحد وبأي طريق وصل إلينا فنحن متعبدون بالعمل به بلا خلاف بين علماء الإسلام ولهذا يقول أهل الأصول في الإجماع إنه لا بد أن يستند إلى نص وإن لم ينطق به‏\n\n\n### [القياس مختلف في اتخاذه دليلا شرعيا وأصلا دينيا]\n\n\nوأما القياس فمختلف في اتخاذه دليلا وأصلا فإن له وجها في المعقول ففي مواضع تظهر قوة الأخذ به على تركه وفي مواضع لا يظهر ذلك ومع هذا فما هو دليل مقطوع به فأشبه خبر الآحاد فإن الاتفاق على الأخذ به مع كونه لا يفيد العلم وهو أصل من أصول إثبات الأحكام فليكن‏\nالقياس مثله إذا كان جليا لا يرتاب فيه وعندنا وإن لم نقل به في حقي فإني أجيز الحكم به لمن أداه اجتهاده إلى إثباته أخطأ في ذلك أو أصاب فإن الشارع أثبت حكم المجتهد وإن أخطأ وأنه ما جور فلو لا أن المجتهد استند إلى دليل في إثبات القياس من كتاب أو سنة أو إجماع أو من كل أصل منها لما حل له أن يحكم به بل ربما يكون في حكم النظر عند المنصف القياس الجلي أقوى في الدلالة على الحكم من خبر الواحد الصحيح فإنا إنما نأخذه بحسن الظن برواته ولا نزكيه علما على الله فإن الشرع منعنا أن نزكي على الله أحدا ولنقل أظنه كذا وأحسبه كذا\n\n\n### [القياس الجلي والنظر الصحيح العقلي‏]\n\n\nوالقياس الجلي يشاركنا فيه النظر الصحيح العقلي وقد كنا أثبتنا بالنظر العقلي الذي أمرنا به شرعا في قوله أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ أَ ولَمْ يَتَفَكَّرُوا ما بِصاحِبِهِمْ من جِنَّةٍ وفي القرآن من مثل هذا كثير فقد اعتبر الشارع حكم النظر العقلي في إثبات وجود الله أو لا وهو الركن الأعظم ثم اعتبره في توحيده في ألوهته فكلفنا النظر في أنه لا إله إلا الله بعقولنا ثم نظرنا بالدليل العقلي ما يجب لهذا الإله من الأحكام ثم نظرنا بالنظر العقلي الذي أمرنا به في تصديق ما جاء به هذا الرسول من عنده إذ كان بشرا مثلنا فنظرنا بالعقول في آياته وما نصبه دليلا على صدقه فأثبتناه وهذه كلها أصول لو انهد ركن منها بطلت الشرائع ومستند ثبوتها النظر العقلي واعتبره الشرع وأمر به عباده والقياس نظر عقلي أ ترى الحق يبيحه في هذه المهمات والأركان العظيمة ويحجزه علينا في مسألة فرعية ما وجدنا لها ذكرا في كتاب ولا سنة ولا إجماع ونحن نقطع أنه لا بد فيها من حكم إلهي مشروع وقد انسدت الطرق فلجأنا إلى الأصل وهو النظر العقلي واتخذنا قواعد إثبات هذا الأصل كتابا وسنة فنظرنا في ذلك فأثبتنا القياس أصلا من أصول أدلة الأحكام بهذا القدر من النظر العقلي حيث كان له حكم في الأصول فقسنا مسكوتا عنه على منطوق به لعلة معقولة لا يبعد أن تكون مقصودة للشارع تجمع بينهما في مواضع الضرورة إذا لم نجد فيه نصا معينا فهذا مذهبنا في هذه المسألة\n\n\n### [تخطئة مثبتى القياس والمجتهدين في الفروع إساءة أدب على الشارع‏]\n\n\nوكل من خطأ عندي مثبت القياس أصلا أو خطأ مجتهدا في فرع كان أو في أصل فقد أساء الأدب على الشارع حيث أثبت حكمه والشارع لا يثبت الباطل فلا بد أن يكون حقا ويكون نسبة الخطاء إلى ذلك نسبة أنه أخطا دليل المخالف الذي لم يصح عند المجتهد أن يكون ذلك دليلا والمخطئ في الشرع واحد لا بعينه فلا بد من الأخذ بقوله ومن قوله إثبات القياس فقد أمر الشارع بالأخذ به وإن كان خطأ في نفس الأمر فقد تعبده به فإن للشارع أن يتعبد بما شاء عباده وهذه طريقة انفردنا بها في علمنا مع أنا لا نقول بالقياس بالنظر إلينا ونقول به بالنظر لمن أداه إليه اجتهاده لكون الشارع أثبته فلو أنصف المخالف لسكت عن النزاع في هذه المسألة فإنها أوضح من أن ينازع فيها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n### [ترتيب أبواب الفتوحات ليس باختيار ولا عن نظر فكر بل بإلهام‏]\n\n\nثم نبين في هذا الباب ما يتعلق بأصول الأحكام عند علماء الإسلام كما علمنا في العبادات وكان الأولى تقديم هذا الباب في أول العبادات قبل الشروع فيها ولكن هكذا وقع فإنا ما قصدنا هذا الترتيب عن اختيار ولو كان عن نظر فكري لم يكن هذا موضعه في ترتيب الحكمة فأشبه آية قوله حافِظُوا عَلَى الصَّلَواتِ والصَّلاةِ الْوُسْطى‏ بين آيات طلاق ونكاح وعدة وفاة يتقدمها ويتأخرها فيعطي الظاهر أن ذلك ليس موضعها وقد جعل الله ذلك موضعها لعلمه بما ينبغي في الأشياء فإن الحكيم من يعمل ما ينبغي لما ينبغي كما ينبغي وإن جهلنا نحن صورة ما ينبغي في ذلك فالله تعالى رتب على يدنا هذا الترتيب فتركناه ولم ندخل فيه برأينا ولا بعقولنا فالله يملي على القلوب بالإلهام جميع ما يسطره العالم في الوجود فإن العالم كتاب مسطور إلهى‏\n\n\n### [تعارض الآيتين أو الخبرين‏]\n\n\nوإذا تعارض آيتان أو خبران صحيحان وأمكن الجمع بينهما واستعمالهما معا فلا نعدل عن استعمالهما فإن لم يمكن استعمالهما معا بحيث أن يكون في أحدهما استثناء فيجب أن يؤخذ بالذي فيه الاستثناء وإن كان في أحدهما زيادة أخذت الزيادة وعمل بها فإن لم يوجد شي‏ء من ذلك وتعارضا من جميع الوجوه فينظر إلى التأريخ فيؤخذ بالمتأخر منهما فإن جهل التأريخ وعسر العلم به فلينظر إلى أقربهما إلى رفع الحرج في الدين فيعمل به لأنه يعضده ما (جَعَلَ) عَلَيْكُمْ في الدِّينِ من حَرَجٍ ودين الله يسر\n\n\nويُرِيدُ الله بِكُمُ الْيُسْرَ ولا يُرِيدُ بِكُمُ الْعُسْرَ وما أمرتكم به فافعلوا منه ما استطعتم وما نهيتكم عنه فدعوه‏\n\n\nفإن تساويا في رفع الحرج فلا يسقطان وتكون مخيرا فيهما تعمل بأي الخبرين شئت أو الآيتين‏\n\n\n### [تعارض آية وخبر آحاد صحيح وجهل التأريخ‏]\n\n\nوإذا تعارض آية وخبر صحيح من جميع الوجوه من أخبار الآحاد وجهل التأريخ أخذ بالآية وتركنا الخبر فإن الآية مقطوع بها وخبر الواحد مظنون فإن‏\nكان الخبر متواترا كالآية وجهل التأريخ ولم يمكن الجمع بينهما كان الحكم التخيير فيهما إلا أن يكون أحدهما فيه رفع الحرج فيقدم الأخذ به‏\n\n\n### [ترجح الأخذ بحديث الزيادة على معارضه‏]\n\n\nوكل خبرين أو آيتين تعارضا أو آية وخبر صحيح متواترا وغير متواتر وفي أحدهما زيادة حكم قبلت الزيادة وعمل بها وترجح الأخذ بحديث الزيادة على معارضه‏\n\n\n### [لا يعدل عن الحديث إذا صح وعارضة قول صاحب أو إمام مذهب‏]\n\n\nولا يؤخذ من الحديث إلا ما صح فإن كان المكلف مقلدا وبلغ إليه حديث ضعيف مسند إلى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وقد عارضة قول إمام من الأئمة أو صاحب لا يعرف دليل ذلك القول فيأخذ بالحديث الضعيف ويترك ذلك القول فإن قصاراه أن يكون في درجة ذلك القول إن كان الحديث في نفس الأمر ليس بصحيح ولا يعدل عن الحديث وأما إذا صح الحديث وعارضة قول صاحب أو إمام فلا سبيل إلى العدول عن الحديث ويترك قول ذلك الإمام والصاحب للخبر فإن كان الخبر مرسلا أو موقوفا فلا يعول عليه إلا إذا علم من التابع أنه لا يرسل الحديث إلا عن صاحب لا غير وإن لم يعين ذلك الصاحب فيؤخذ بالمرسل فإنه في حكم المسند وهو أن يقول التابع قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ولا يذكر الصاحب الذي عنه رواه ويعلم أنه ممن أدرك الصحابة وصحبهم وهو ثقة في دينه ويعلم منه أنه ممن لا يرى الكذب على النبي صَلَّى اللهُ عَليهِ وسَلَّم في المصالح فإن علم منه ذلك لم يؤخذ بحديثه ولو أسنده ولا يجوز ترك آية أو خبر صحيح لقول صاحب أو إمام ومن يفعل ذلك فَقَدْ ضَلَّ ضَلالًا مُبِيناً وخرج عن دين الله‏\n\n\n### [ورود الخبر عن قوم مستورين يعمل به‏]\n\n\nوإذا ورد الخبر عن قوم مستورين لم يتكلم فيهم بجرح ولا تعديل وجب الأخذ بروايتهم فإن جرح واحد منهم بجرحة تؤثر في صدقه ترك حديثه وإن كانت الجرحة لا تتعلق بنقله وجب الأخذ به إلا شارب الخمر إذا حدث في حال سكره فإن علم أنه حدث في حال صحوه وهو ممن هذه صفته أخذ بقوله والإسلام العدالة والجرحة طارئة وإذا ثبتت على حد ما قلناه ترك الأخذ بحديث صاحب تلك الجرحة\n\n\n### [خبر الواحد الصحيح والمتواتر إذا تعارضا]\n\n\nولا فرق بين الأخذ بخبر الواحد الصحيح وبين المتواتر إلا إن تعارضا كما قلناه‏\n\n\n### [ما أوجب الله علينا الأخذ بقول أحد غير رسوله‏]\n\n\nوما أوجب الله علينا الأخذ بقول أحد غير رسول الله صَلَّى اللهُ عَليهِ وسَلَّم مع كوننا مأمورين بتعظيمهم ومحبتهم‏\n\n\n### [النسخ انتهاء مدة الحكم في علم الله‏]\n\n\nوأما النسخ فلا أقول به على حد ما يقولون به فإنه عندنا انتهاء مدة الحكم في علم الله فإذا انتهى فجائز أن يأتي حكم آخر من قرآن أو سنة فإن سمي مثل هذا نسخا قلنا به وإذا كان الأمر على هذا فيجوز نسخ القرآن بالقرآن وبالسنة فإن السنة مبينة لأنه عليه السلام مأمور بأنه يبين للناس ما نزل إليهم وأن يحكم بما أراه الله لا بما أرته نفسه فإنه لا يتبع إلا ما يوحى إليه سواء كان ذلك قرآنا أو غير قرآن ويجوز نسخ السنة بالقرآن والسنة وإذا ورد نص من آية أو خبر لا يجوز الوقوف عن الأخذ بذلك القرآن أو الخبر حتى يرى هل له معارض أم لا بل يعمل بما وصل إليه فإن عثر بعد ذلك على خبر أو آية ناسخ أو مخصص أو معمم للمتقدم كان بحكم ما وصل إليه بشروطه وهو أن يبحث عن التأريخ فإن الخاص قد يتقدم على العام كما يتقدم العام على الخاص والأصل أن الحكم للمتأخر\n\n\n### [تؤخذ ألفاظ الكتاب والسنة بما هو عليه في لغة العرب أو بما فسره الشارع‏]\n\n\nوإذا وردت الآية أو الخبر بلفظ ما من اللسان فالأصل أن يؤخذ بما هو عليه في لغة العرب فإن أطلقه الشارع على غير المفهوم من اللسان كاسم الصلاة واسم الوضوء واسم الحج واسم الزكاة صار الأصل ما فسره به الشارع وقرره فإذا ورد بعد ذلك خبر بذلك اللفظ حمل على ما فسره به الشارع ولم يحمل على ما هو عليه في اللسان حتى يرد من الرسول في ذلك اللفظ أنه به ما هو عليه في اللسان فيعدل عند ذلك إليه في ذلك الخبر على التعيين‏\n\n\n### [أوامر الشرع محمولة على الوجوب ونواهيه على الحظر]\n\n\nوأوامر الشرع كلها محمولة على الوجوب ونواهيه محمولة على الحظر ما لم يقترن بالأمر قرينة حال تخرجه عن الوجوب إلى الندب أو الإباحة وكذلك النهي إن اقترنت به قرينة تخرجه من الحظر إلى الكراهة فإن تعرى الأمر عن قرينة الندب أو الإباحة تعين الوجوب وكذلك النهي وقد يرد الأمر الإلهي أو النبوي على النهي برفع التحجير خاصة لا لوجوب فعل المأمور به‏\n\n\n### [الإجماع إجماع الصحابة بعد الرسول لا غير]\n\n\nوالإجماع إجماع الصحابة بعد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لا غير وما عدا عصرهم فليس بإجماع يحكم به وصورة الإجماع أن يعلم أن المسألة قد بلغت لكل واحد من الصحابة فقال فيها بذلك الحكم الذي قال به الآخر إلى أن لم يبق منهم أحد إلا وقد وصل إليه ذلك الأمر وقال فيه بذلك الحكم فإن نقل عن واحد خلاف في ذلك فليس بإجماع أو نقل عنه سكوت فليس بإجماع‏\n\n\n### [إذا وقع خلاف في شي‏ء وجب رد الحكم فيه إلى الكتاب والسنة]\n\n\nوإذا وقع خلاف في شي‏ء وجب رد الحكم فيه إلى الكتاب والخبر النبوي فإنه خَيْرٌ وأَحْسَنُ تَأْوِيلًا\n\n\n### [الرأى لا يجوز أن يدان الله به‏]\n\n\nولا يجوز أن يدان‏\nالله بالرأي وهو القول بغير حجة ولا برهان لا من كتاب ولا من سنة ولا من إجماع‏\n\n\n### [القياس لا نقول به ولا نخطى‏ء مثبته‏]\n\n\nوإن كنا لا نقول بالقياس فلا نخطى‏ء مثبته إذا كانت العلة الجامعة معقولة جلية يغلب على الظن أنها مقصودة للشارع وإنما امتنعنا نحن من الأخذ بالقياس لأنه زيادة في الحكم وفهمنا من الشارع أنه يريد التخفيف عن هذه الأمة وكان يقول اتركوني ما تركتكم وكان يكره المسائل خوفا أن ينزل عليهم في ذلك حكم فلا يقومون به‏\n\n\nكقيام رمضان والحج في كل سنة وغير ذلك فلما رأيناه على ذلك منعنا القياس في الدين فإن النبي صَلَّى اللهُ عَليهِ وسَلَّم ما أمر به ولا أمر به الحق تعالى فتعين علينا تركه فإنه مما يكرهه صَلَّى اللهُ عَليهِ وسَلَّم وحكم الأصل أن لا تكليف وأن الله خلق لنا ما في الْأَرْضِ جَمِيعاً فمن ادعى التحجير علينا فعليه بالدليل من كتاب أو سنة أو إجماع وأما القياس فلا أقول به ولا أقلد فيه جملة واحدة\n\n\n### [أفعال النبي صَلَّى اللهُ عَليهِ وسَلَّم ليست على الوجوب إلا ما أمر به من أفعاله‏]\n\n\nوأما أفعال النبي صَلَّى اللهُ عَليهِ وسَلَّم فليست على الوجوب فإن في ذلك غاية الحرج إلا فعل بين به أمرا تعبدنا به فذلك الفعل واجب مثل‏\n\n\nقوله صلوا كما رأيتمونى أصلي‏\n\n\nوخذوا عني مناسككم‏\n\n\nوأفعال الحج ولو لا نطقه في ذلك في بعض الأفعال لم يكن يلزمنا ذلك الفعل فإنه بشر يتحرك كما يتحرك البشر ويرضى كما يرضى البشر ويغضب كما يغضب البشر فلا يلزمنا اتباعه في أفعاله إلا أن أمر بذلك وتعين عليه أن لا يفعل فعلا سرا بحيث لا يراه أحدكما تعين عليه فيما أمر بتبليغه أن لا يتكلم به وحده بحيث لا يسمعه أحد حتى ينقله إلى من لم يسمعه‏\n\n\n### [شرع من قبلنا لا يلزمنا إلا ما قرر منه شرعنا]\n\n\nوأما شرع من قبلنا فما يلزمنا اتباعه إلا ما قرر شرعنا منه مع كون ذلك شرعا حقا لمن خوطب به لا نقول فيه بالباطل بل نؤمن بالله ورسوله وما أنزل إليه وما أنزل من قبله من كتاب وشرع منزل‏\n\n\n### [التقليد في دين الله لا يجوز]\n\n\nوالتقليد في دين الله لا يجوز عندنا لا تقليد حي ولا ميت ويتعين على السائل إذا سأل العالم أن يقول له أريد حكم الله أو حكم رسوله في هذه المسألة فإن قال له المسئول هذا حكم الله في المسألة أو حكم رسوله تعين عليه الأخذ بها فإن المسئول هنا ناقل حكم الله وحكم رسوله الذي أمرنا بالأخذ به فإن قال هذا رأيى أو هذا حكم رأيته أو ما عندي في هذه المسألة حكم منطوق به ولكن القياس يعطي أن يكون الحكم فيه مثل الحكم في المسألة الفلانية المنطوق بحكمها لم يجز للسائل أن يأخذ بقوله ويبحث عن أهل الذكر فيسألهم على صفة ما قلنا\n\n\n### [يتعين سؤال أهل الذكر الذين هم أهل القرآن والحديث‏]\n\n\nويتعين على كل مسلم أن لا يسأل إلا أهل الذكر وهم أهل القرآن قال تعالى إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وأهل الحديث فإن علم السائل أن هذا المسئول صاحب رأى وقياس فيتركه ويسأل صاحب الحديث فإن كان المسئول صاحب رأى وقياس وحديث فيسأله فإذا أفتاه تعين عليه أن يقول له هذا الحكم رأى أو قياس أو عن حديث فإن قال عن رأى أو قياس تركه وإن قال عن خبر أخذ به‏\n\n\n### [حكم الخطأ والنسيان والسكوت عنه‏]\n\n\nولا حكم للخطإ والنسيان إلا حيث جاء في قرآن أو سنة أن يكون لهما حكم فيعمل به مثل صلاة الناسي وقتل الخطاء وكل مسكوت عنه فلا حكم فيه إلا الإباحة الأصلية\n\n\n### [خطاب الشرع متوجه على الأسماء والأحوال لا على الأعيان‏]\n\n\nوخطاب الشرع متوجه على الأسماء والأحوال لا على الأعيان فلا يكون حكم الفرض إلا على من حاله قبول الفرض من أمر ونهي في عمل أو ترك فكل من عجز عن شي‏ء من ذلك مما كلفه الله به بل ما هو مخاطب به إن الله ما كلف نَفْساً إِلَّا وُسْعَها وإِلَّا ما آتاها سَيَجْعَلُ الله بَعْدَ عُسْرٍ يُسْراً\n\n\n### [العمل المقيد بوقت لا يجوز أداؤه إلا في وقته‏]\n\n\nوكل عمل مقيد بوقت موسعا كان أو مضيقا فلا يجوز عمله إلا في وقته لا قبله ولا بعده فإن ذلك حد الله المشروع فيه فلا يتعدى‏\n\n\n### [حكم الاجتهاد في الأصول والفروع‏]\n\n\nوحكم الاجتهاد في الأصول والفروع واحد والحق في الفروع حيث قرره الشرع وقد قرر حكم المجتهدين ولا يقرر إلا ما هو حق فكله حق وأما نسبة الخطاء إلى المجتهد الذي له أجر واحد فهو كونه لم يعثر على حكم الله أو حكم رسوله في تلك المسألة وقد تعبده الله بما انتهى إليه اجتهاده فلو لم يكن حقا عند الله بالنظر إليه لما تعبده به فإن الله لا يقر الباطل فإذا وصل إليه بعد ذلك حكم الله تعالى أو رسوله في تلك المسألة بما يخالف دليله وعلم أن ذلك الحكم متأخر عن حكم دليله وجب عليه الرجوع عن ذلك الحكم الأول ولا يحل له البقاء عليه ولهذا كان من علم مالك بن أنس ودينه وورعه أنه إذا سئل عن مسألة في دين الله يقول نزلت فإن قيل له نعم أفتى وإن قيل لم تنزل لم يفت وسببه ما ذكرنا لأن المصيب للحكم المعين في تلك المسألة واحد لا بعينه والمخطئ واحد لا بعينه ولهذا قالت العلماء كل مجتهد مصيب فأما مصيب للحكم الإلهي فيها على التعيين أو مصيب للحكم المقرر الذي أثبته الله له إذا لم يعثر على ذلك الحكم المعين وأخطأه وهذا القدر كاف في أصول أحكام الشرع في هذا الكتاب لأنه لا يحتمل الاستقصاء\n\n\nوأما أسرار أصول أحكام الشرع المتفق عليها والمختلف فيها\n\n\n### [سر أصل الأخذ بالكتاب‏]\n\n\nفإن سر الكتاب هو ما يكون من الله للعبد\nبترك الوسائط كما قال كَتَبَ في قُلُوبِهِمُ الْإِيمانَ فهم كتاب الله وهوقول الشارع دع ما يريبك إلى ما لا يريبك‏\n\n\nوقوله استفت قلبك وإن أفتاك المفتون‏\n\n\nوالكتابة ضم المعاني الإلهية بما يليق بجلاله من نسبة أسماء الله الحسنى إلى المعاني التي لنا من التخلق بتلك الأسماء أي بمعانيها أو تكون أخلاقا لنا لا تخلقا وهي نسبتها إلينا على ما يليق بنا فهو الرءوف الرحيم وقد قال في رسوله صَلَّى اللهُ عَليهِ وسَلَّم بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ وهذا مدح وسمى نفسه بالعزيز الكريم وقد قال في بعض عباده ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ وهو ذم وكلها أسماء الله وأسماء الخلق ومدلولاتها معقولة المعنى بآثارها فيمن تسمى بها وإن كانت نسبها مختلفة فنسبتها إلى الله لا تشبه نسبتها إلى العبد فإنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وإن كان آثار الكريم أن يعطي وقد وجد العطاء من الله ومن العبد على جهة الإنعام فإن انضم المعنى إلى المعنى من وجه فقد افترقا من وجه لأن الموصوف المسمى لا يشبه الموصوف المسمى الآخر فمن الوجه الذي يقع الاشتراك وهو الأثر من ذلك الوجه يكون كتابة لأن الكتابة الضم وبضم الحروف بعضها إلى بعض سميت كتابة والكتيبة ضم الخيل بفرسانها بعضها إلى بعض فلو جاءوا متفرقين وحدانا ما سموا كتيبة فهو المؤمن وقد كتب في قلب عبده الايمان فأوجب له ذلك الكتاب حكما سمي به مؤمنا وليس الاسم غير المسمى فهو الظاهر في عين الممكن والممكن له مظهر وكل ظاهر في مظهر فقد انضم الظاهر إلى المظهر وانضم المظهر إلى الظاهر ولذلك صح أن يكون مظهرا للظاهر فيه فهذا سر أصل الأخذ بالكتاب دليلا على ثبوت الحكم‏\n\n\n### [سر السنة في إثبات الحكم‏]\n\n\nوأما سر السنة في إثبات الحكم فإنه لما كان الرسول عليه السلام لا ينطق عن الهوى وأن حكمه حكم الله وهو ناقل عن الله ومبلغ عنه بما أراه الله والله على صراط مستقيم والسنة الطريقة والطريق لا يراد لنفسه وإنما يراد لغايته فالسنة صِراطِ الله الَّذِي لَهُ ما في السَّماواتِ وما في الْأَرْضِ أَلا إِلَى الله تَصِيرُ الْأُمُورُ لأنها على صراطه وهو غاية صراطه فلا بد للسالك عليه من الوصول إليه فالصراط الواسطة وبوساطة استعداد المظهر بما هو عليه في نفسه حكم على الظاهر بما سمي به فهو أعطاه ذلك الاسم وذلك الحكم صحيح فهذا صراط مستقيم فنحن إذا سألنا الحق في أمر يعن لنا كان أثر سؤالنا في الله الإجابة فسمي مجيبا فلو لا سؤالنا ما ثبت هذا الحكم ولا أطلق عليه هذا الاسم ونحن طريقة له في ذلك قال تعالى أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فما أجابه حتى دعاه فهذا سر استدلاله بالسنة\n\n\n### [سر أخذ الإجماع سندا على إثبات الحكم‏]\n\n\nوأما الإجماع فهو ما أجمع عليه الرب والمربوب في إن الله خالق والعبد مخلوق وهكذا كل إضافة فلا خلاف بين الله وبين عباده في مسائل الإضافة أين ما وجدت وكذلك في المعلومات من حيث ما هي معلومات‏\n\n\n### [حكم سر القياس في الاستدلال عند مثبتيه‏]\n\n\nوأما القياس عند مثبتيه فهو ظهور رب بصفة عبد وظهور عبد بصفة رب عن أمر رب فإن لم يكن عن أمر رب فلا يتخذ دليلا على حكم أو عن حميد خلق كريم فإنه أيضا يتخذ دليلا وأما ظهور رب بصفة مربوب فلا يشترط فيه الأمر الواجب ولكن قد يكون عن دعاء وطلب وصفته صفة الأمر والمعنى مختلف وإن كان هذا مسموعا ممتثلا والآخر كذلك ولكن بينهما فرقان فهذا حكم سر القياس في الاستدلال وهو قياس الغائب على الشاهد لحكم معقول جامع بين الشاهد والغائب وينسب لكل واحد من المنسوبين إليه بحسب ما يليق بجلاله وإنما قلنا بجلاله لأن الجليل من الأضداد يطلق على العظيم وعلى الحقير وقد انتهت أسرار أصول أحكام الشرع انتهى الجزء الرابع والتسعون‏\n\n\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "Chapter Eighty-Eight: Concerning the Knowledge of the Secrets of the Principles of Legal Rulings\n\nThe Law (الشرع) is what the Godhead (الإله) legislated as an ethical disposition (تخلقًا),\nFor He is the Knower of their right and His right.\n\nAnd when a servant comes to legislate a law,\nThe Godhead establishes its right within His right.\n\nThe two laws are from a single origin,\nUnless one says, \"The Godhead spoke to His Creation (خلقه).\"\n\nBut if he says [that], then it is a snare,\nThe companion star rising with its star from its horizon.\n\nSo that they may believe what they have imitated in their thoughts,\nYet he is the liar, even if he comes to you with his truth.\n\nSo consider the rulings of the origin of its Book,\nFor perhaps the accursed one chokes on his own spittle.\n\n### [The Agreed-Upon and Disputed Principles of the Law]\n\nKnow that the agreed-upon principles (أصول) of legal rulings (أحكام الشرع) are three: The Book (الكتاب), the consecutively transmitted Sunnah (السنة المتواترة), and Consensus (الإجماع). Scholars differed concerning Analogical Reasoning (القياس). Some say it is a proof (دليل) and one of the principles of rulings, while others prohibit it, and this is the position I hold.\n\n### [Piety (التقوى) is a legislated act, so its ruling must be attributed to a legal proof or principle]\n\nAllah the Exalted said: <<وَاتَّقُوا اللهَ وَيُعَلِّمُكُمُ اللهُ>> (And fear Allah, and Allah teaches you) and He said: <<إِنْ تَتَّقُوا اللهَ يَجْعَلْ لَكُمْ فُرْقَانًا>> (If you fear Allah, He will grant you a Criterion) and He said: <<اتَّقُوا اللهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ>> (Fear Allah and believe in His Messenger; He will give you a double portion of His mercy and appoint for you a light by which you will walk, and He will forgive you). This is similar to His saying concerning His servant Khidr: <<آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا>> (We gave him mercy from Us and taught him knowledge from Our presence). Thus, He made the granting of knowledge (العلم) to His servant part of His mercy. Piety (التقوى) is a legislated act (عمل مشروع) for us, so the ruling concerning piety must necessarily be attributed to one of these proofs, or to all of them, in any matter where fearing Allah is incumbent upon us.\n\n### [The Active and Passive Principles in the Law, and the Divine and Cosmic Realities]\n\nAl-Junayd said: \"This knowledge of ours is bound by the Book (الكتاب) and the Sunnah (السنة).\" These two are the active principles (الأصلان الفاعلان). Consensus (الإجماع) and Analogical Reasoning (القياس) are only established and their indication validated through the Book and the Sunnah; thus, they are two passive principles (أصلان منفعلان) in the ruling. From these four realities (الحقائق) emerged the genesis of the legislated rulings (الأحكام المشروعة), by acting upon which happiness (السعادة) is attained. Indeed, existent things (الموجودات) appeared from four Divine Realities (حقائق إلهية): Life (الحياة), Knowledge (العلم), Will (الإرادة), and Power (القدرة). Bodies (الأجسام) appeared from four realities: heat, coldness, dryness, and wetness. Generated things (المولدات) appeared from four pillars: fire, air, water, and earth. The body of the human and the animal appeared from four humors: yellow bile, black bile, blood, and phlegm. Thus, heat and coldness are active (فاعلان), and wetness and dryness are passive (منفعلتان). Know this.\n\n### [The deeper meaning of Al-Junayd's saying: \"Our knowledge is bound by the Book and the Sunnah\"]\n\nSince those who do not believe in the revealed Laws (الشرائع المنزلة) share with us in spiritual discipline (الرياضة), striving (المجاهدة), and purifying the soul (النفس) from the rule of nature (الطبيعة), connection with the pure, sanctified spirits (الأرواح الطاهرة الزكية) becomes manifest upon them. The effect of that connection appears upon them just as it appears upon the believers among us who act according to the revealed Laws. Due to the similarity and shared aspects we mentioned, this is apparent to the common people. We speak of the sciences (العلوم) granted by the unveiling (كشف) of spiritual discipline and the aid of the celestial spirits (الأرواح العلوية). Everything in the cosmos (العالم) is imprinted upon these virtuous souls (النفوس الفاضلة), so they speak of the unseen (الغيوب). Al-Junayd said: \"Although this knowledge of ours is shared between us and the rational people (العقلاء), the origin of our spiritual discipline, striving, and actions that granted us these sciences and the manifest effects upon us, was only due to our acting upon the Book and the Sunnah.\" This is the meaning of his saying: \"Our knowledge is bound by the Book and the Sunnah.\" We are distinguished from those others on the Day of Resurrection by this measure, for they have no taste (ذوق) of the Divine Realities (الإلهيات). Their emanation (فيضهم) is spiritual (روحاني), while our emanation is spiritual and Divine (إلهي), because we traversed a Divine path called the Law (شريعة), which led us to the Legislator (المشرع), who is Allah the Exalted, since He made it a path to Himself. Know this.\n\n### [Consensus (الإجماع) must rely on a text, even if not explicitly stated]\n\nSince the Law (شرع الله) and His ruling concerning the movements of the legally responsible human (الإنسان المكلف) are only taken from the Quran, similarly, they only came into existence through the Speaker thereof, who is Allah the Exalted, who said to the thing, \"Be,\" and it was. Thus, the Quran is the strongest proof (دليل) to rely upon, or that which is authentically reported from the Messenger of Allah (may Allah bless him and grant him peace), whose truthfulness is established by proof, that he is reporting from Allah everything He legislated for the servants of Allah. That report may be either by the consensus of the Companions (الصحابة), which is the Consensus (الإجماع), or from some of them through the transmission of a trustworthy person from a trustworthy person, which is the solitary report (خبر الواحد). By whatever means it reaches us, we are bound to act upon it, without dispute among the scholars of Islam. For this reason, the scholars of legal principles (أهل الأصول) say concerning Consensus that it must necessarily rely on a text (نص), even if it is not explicitly stated.\n\n### [Analogical Reasoning (القياس) is disputed as a legal proof and religious principle]\n\nAs for Analogical Reasoning (القياس), there is disagreement regarding taking it as a proof (دليل) and a principle (أصل). It has a rational aspect (وجها في المعقول). In some instances, the strength of adopting it over abandoning it is apparent, and in other instances, this is not apparent. Nevertheless, it is not a definitive proof (دليل مقطوع به), so it resembles the solitary report (خبر الآحاد). Since there is agreement on adopting the solitary report despite the fact that it does not yield certain knowledge (العلم), and it is a principle for establishing rulings, Analogical Reasoning should be treated similarly if it is clear (جلي) and leaves no room for doubt. Although we do not adopt it for ourselves, I permit ruling by it for anyone whose independent reasoning (اجتهاده) leads him to establish it, whether he errs or is correct in that. For the Legislator (الشارع) established the ruling of the one who exercises independent reasoning (المجتهد) even if he errs, and he is rewarded. If the *mujtahid* did not rely on a proof for establishing *qiyas*—from the Book, the Sunnah, Consensus, or any of these principles—it would not be permissible for him to rule by it. Indeed, perhaps in the judgment of the fair-minded observer, clear *qiyas* (القياس الجلي) is stronger in indicating the ruling than an authentic solitary report, for we only accept the latter based on good assumption regarding its narrators, and we do not certify it as knowledge (علما) concerning Allah. The Law (الشرع) forbade us from certifying anyone concerning Allah. Rather, we should say, \"I assume it is such,\" or \"I reckon it is such.\"\n\n### [Clear Analogical Reasoning (القياس الجلي) and Sound Rational Consideration (النظر الصحيح العقلي)]\n\nClear Analogical Reasoning (القياس الجلي) shares the domain of sound rational consideration (النظر الصحيح العقلي) with us. We established [truths] through the rational consideration that we were commanded to use legally, in His saying: <<أَوَلَمْ يَنْظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ>> (Have they not looked into the dominion of the heavens and the earth?) and <<أَوَلَمْ يَتَفَكَّرُوا مَا بِصَاحِبِهِمْ مِنْ جِنَّةٍ>> (Have they not reflected that there is no madness in their companion?). There is much of this kind in the Quran. The Legislator (الشارع) first considered the ruling of rational consideration in establishing the existence of Allah, which is the greatest pillar. Then He considered it in His Oneness (توحيده) in His Divinity (ألوهته), obligating us to consider, using our intellects, that there is no god but Allah. Then we considered, using rational proof (الدليل العقلي), what rulings are incumbent upon this Godhead. Then we considered, using the rational consideration we were commanded to use, the verification of what this Messenger brought from Him, since he was a human like us. So we looked with our intellects at his signs and what He established as proof of his truthfulness, and we affirmed it. All of these are principles (أصول); if one of their pillars were to collapse, the Laws (الشرائع) would be invalidated. The basis for their establishment is rational consideration, which the Law considered and commanded His servants to use. Analogical Reasoning is a form of rational consideration. Do you think that the Real (الحق) permits it for these important matters and great pillars, yet restricts it from us in a subsidiary issue (مسألة فرعية) for which we find no mention in the Book, the Sunnah, or Consensus? We are certain that there must be a legislated Divine ruling (حكم إلهي مشروع) concerning it, and since the paths are blocked, we resort to the principle (الأصل), which is rational consideration. We adopted the rules for establishing this principle—the Book and the Sunnah—and we considered the matter, thereby establishing *qiyas* as a principle among the proofs of rulings, based on this measure of rational consideration, since it has a ruling in the fundamental principles (الأصول). Thus, we analogize an unmentioned matter (مسكوتا عنه) to an explicitly mentioned matter (منطوق به) due to a comprehensible cause ('illah) that is likely intended by the Legislator, combining them in situations of necessity when we find no specific text concerning it. This is our doctrine (مذهبنا) regarding this issue.\n\n### [To deem those who establish Analogical Reasoning (القياس) or those who exercise independent reasoning (المجتهدين) in subsidiary matters (الفروع) as mistaken is a lack of respect toward the Legislator (الشارع)]\n\nAnyone who, in my view, deems the one who establishes Analogical Reasoning (القياس) as a principle, or deems a *mujtahid* (one who exercises independent reasoning) in a subsidiary or fundamental matter as mistaken, has shown a lack of respect (أساء الأدب) toward the Legislator (الشارع), since He established his ruling. The Legislator does not establish falsehood (الباطل), so it must necessarily be the truth (حقًا). Attributing error to that person means attributing error to the proof of the opponent, which the *mujtahid* did not accept as valid proof. The one who errs in the Law is one, but not specifically designated. Therefore, one must adopt his saying, and among his sayings is the establishment of *qiyas*. The Legislator commanded its adoption, and even if it is an error in reality (*fi nafs al-amr*), He has made it an act of worship (تعبده به), for the Legislator may command His servants to worship Him however He wills. This is a method unique to our knowledge. Although we do not adopt *qiyas* when considering ourselves, we affirm it when considering the one whose independent reasoning leads him to establish it, because the Legislator affirmed it. If the opponent were fair-minded, he would remain silent regarding the dispute over this issue, for it is too clear to be disputed. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\n### [The arrangement of the chapters of *Al-Futuhat* (الفتوحات) is not by choice or intellectual consideration, but by inspiration (إلهام)]\n\nNext, in this chapter, we clarify what relates to the principles of rulings (أصول الأحكام) according to the scholars of Islam, just as we clarified matters concerning acts of worship (العبادات). It would have been more appropriate to present this chapter at the beginning of the acts of worship before commencing them, but this is how it occurred. We did not intend this arrangement by choice (اختيار). Had it been based on intellectual consideration (نظر فكري), this would not have been its place in the arrangement of wisdom (الحكمة). It resembles the verse: <<حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى>> (Maintain the prayers and the middle prayer), placed between verses concerning divorce, marriage, and the waiting period for widowhood, preceding and following it. The apparent sense suggests that this is not its proper place, yet Allah made it its place due to His knowledge of what is fitting for things. For the Wise One (الحكيم) is He who does what is fitting, for what is fitting, in the manner that is fitting, even if we are ignorant of the form of what is fitting in that regard. Allah the Exalted arranged this sequence through our hands, so we left it and did not interfere with our opinion or our intellects. For Allah dictates to the hearts, through inspiration (الإلهام), everything that the knower (العالم) inscribes in existence (الوجود), for the cosmos (العالم) is a Divine inscribed book (كتاب مسطور إلهي).\n\n### [Contradiction between two verses or two reports]\n\nIf two verses or two authentic reports contradict each other, and it is possible to reconcile them and use them both together, we should not abandon using them. If it is not possible to use them both together, such that one contains an exception, then the one containing the exception must be adopted. If one contains an addition (زيادة), the addition is adopted and acted upon. If none of that is found, and they contradict in all respects, then the chronology (التأريخ) is examined, and the later one is adopted. If the chronology is unknown and difficult to ascertain, then one should look to the one that is closer to removing hardship (رفع الحرج) in the religion, and act upon it, because it is supported by <<مَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ>> (He has not placed upon you in the religion any difficulty), and the religion of Allah is ease. <<وَيُرِيدُ اللهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ>> (And Allah intends for you ease and does not intend for you hardship). And [the Prophet said]: \"Whatever I have commanded you to do, do as much of it as you are able, and whatever I have forbidden you from, abandon it.\" If they are equal in removing hardship, they are not dropped, and you are given the choice to act upon whichever of the two reports or two verses you wish.\n\n### [Contradiction between a verse and an authentic solitary report (خبر آحاد صحيح) and ignorance of the chronology]\n\nIf a verse and an authentic solitary report (خبر آحاد) contradict in all respects, and the chronology is unknown, the verse is adopted and the report is abandoned, because the verse is definitive (مقطوع بها) while the solitary report is presumptive (مظنون). If the report is consecutively transmitted (متواترا), like the verse, and the chronology is unknown, and reconciliation is impossible, the ruling is to choose between them, unless one of them involves the removal of hardship (رفع الحرج), in which case it is prioritized.\n\n### [The preference for adopting the hadith with an addition (الزيادة) over its contradictory counterpart]\n\nWhenever two reports or two verses contradict, or a verse and an authentic report (consecutively transmitted or not), and one contains an additional ruling (زيادة حكم), that addition is accepted and acted upon, and adopting the hadith with the addition is preferred over its contradictory counterpart.\n\n### [One should not deviate from the Hadith if it is authentic, even if contradicted by the saying of a Companion (صاحب) or a school Imam (إمام مذهب)]\n\nOnly that which is authentic (صح) should be taken from the Hadith. If the legally responsible person (المكلف) is a follower (مقلد) and a weak hadith (حديث ضعيف) attributed to the Messenger of Allah (may Allah bless him and grant him peace) reaches him, and it is contradicted by the saying of an Imam among the Imams or a Companion (صاحب) whose proof for that saying is unknown, then he should adopt the weak hadith and abandon that saying. For, at most, the hadith would be on the same level as that saying if the hadith is not authentic in reality (*fi nafs al-amr*). One should not deviate from the Hadith. However, if the Hadith is authentic and is contradicted by the saying of a Companion or an Imam, there is no way to deviate from the Hadith, and the saying of that Imam or Companion is abandoned in favor of the report. If the report is *mursal* (lacking the Companion link) or *mawquf* (stopped at the Companion), it should not be relied upon unless it is known that the Successor (التابع) only transmits the hadith from a Companion and no one else. Even if that Companion is not specified, the *mursal* report is adopted, for it is treated as a *musnad* (fully linked) report. A *mursal* report is when the Successor says, \"The Messenger of Allah (may Allah bless him and grant him peace) said,\" without mentioning the Companion from whom he narrated it, and it is known that he met and accompanied the Companions, is trustworthy in his religion, and is known not to consider lying about the Prophet (may Allah bless him and grant him peace) permissible for the sake of benefits (المصالح). If this latter characteristic is known of him, his hadith is not adopted, even if he provides a full chain (*asnadah*). It is not permissible to abandon a verse or an authentic report for the saying of a Companion or an Imam. Whoever does that <<فَقَدْ ضَلَّ ضَلَالًا مُبِينًا>> (has certainly strayed into manifest error) and departed from the religion of Allah.\n\n### [A report coming from people whose status is unknown (مستورين) should be acted upon]\n\nIf a report comes from people whose status is unknown (مستورين)—those about whom no criticism (*jarh*) or affirmation of trustworthiness (*ta'dil*) has been spoken—it is obligatory to adopt their narration. If one of them is criticized with a criticism that affects his truthfulness, his hadith is abandoned. If the criticism does not relate to his transmission, it is obligatory to adopt it, except for the drinker of wine if he narrates while intoxicated. If it is known that he narrated while sober, and he is of this description, his saying is adopted. Islam itself constitutes trustworthiness (العدالة), and criticism (*jarh*) is an incidental factor. If criticism is established according to what we have stated, the hadith of the person subject to that criticism is abandoned.\n\n### [The authentic solitary report (خبر الواحد الصحيح) and the consecutively transmitted report (المتواتر) if they contradict]\n\nThere is no difference between adopting the authentic solitary report and the consecutively transmitted report, unless they contradict, as we have stated.\n\n### [Allah has not obligated us to adopt the saying of anyone other than His Messenger]\n\nAllah has not obligated us to adopt the saying of anyone other than the Messenger of Allah (may Allah bless him and grant him peace), even though we are commanded to venerate and love them.\n\n### [Abrogation (النسخ) is the termination of the ruling's duration in Allah's Knowledge]\n\nAs for Abrogation (النسخ), I do not affirm it in the manner that others affirm it. For us, it is the termination of the ruling's duration (مدة الحكم) in Allah's Knowledge (علم الله). When it terminates, it is permissible for another ruling to come, either from the Quran or the Sunnah. If such a thing is called abrogation, we affirm it. If the matter is thus, it is permissible to abrogate the Quran by the Quran and by the Sunnah, for the Sunnah is explanatory, because the Prophet (peace be upon him) was commanded to clarify to the people what was sent down to them, and to rule by what Allah showed him, not by what his own soul showed him. He only follows what is revealed to him, whether it is Quran or non-Quran. It is permissible to abrogate the Sunnah by the Quran and the Sunnah. If a text (نص) from a verse or a report is received, it is not permissible to delay acting upon that Quran or report until one sees whether it has a contradiction or not; rather, one acts upon what has reached him. If he later discovers a report or verse that abrogates (*nasikh*), specifies (*mukhassis*), or generalizes (*mu'ammim*) the former, he acts according to what reached him, subject to its conditions, which is to investigate the chronology (التأريخ). For the specific may precede the general, just as the general may precede the specific. The principle is that the ruling belongs to the later text.\n\n### [The expressions of the Book and the Sunnah are taken according to their meaning in the Arabic language or according to what the Legislator explained]\n\nIf a verse or report is received using a certain expression from the language, the principle (الأصل) is that it is taken according to its meaning in the Arabic language. However, if the Legislator (الشارع) applied it to something other than what is understood from the language—such as the name *Salat* (prayer), *Wudu'* (ablution), *Hajj* (pilgrimage), or *Zakat* (alms)—then the principle becomes what the Legislator explained and established. If a report is subsequently received using that expression, it is interpreted according to what the Legislator explained, and not according to its meaning in the language, unless a report comes from the Messenger concerning that expression stating that he intends its linguistic meaning, in which case one specifically reverts to the linguistic meaning in that particular report.\n\n### [The commands of the Law (الشرع) are interpreted as obligation (الوجوب) and its prohibitions as prohibition (الحظر)]\n\nAll commands of the Law (الشرع) are interpreted as obligation (الوجوب), and its prohibitions are interpreted as prohibition (الحظر), unless the command is accompanied by a contextual indicator (قرينة حال) that removes it from obligation to recommendation (الندب) or permissibility (الإباحة). Likewise for the prohibition: if it is accompanied by an indicator that removes it from prohibition to dislike (الكراهة). If the command is devoid of an indicator of recommendation or permissibility, obligation is determined. Likewise for the prohibition. Sometimes the Divine or Prophetic command may be directed toward a prohibition specifically to lift the restriction (رفع التحجير), not to necessitate the performance of the commanded act.\n\n### [Consensus (الإجماع) is the consensus of the Companions (الصحابة) after the Messenger, and no other]\n\nConsensus (الإجماع) is the consensus of the Companions (الصحابة) after the Messenger of Allah (may Allah bless him and grant him peace) and no other. What is outside their era is not a consensus by which one may rule. The form of consensus is that it is known that the issue reached every single Companion, and each gave the same ruling as the others, until no one remained among them who had not received that matter and given that ruling concerning it. If a disagreement is reported from even one of them, it is not consensus. Likewise, if silence is reported from one of them, it is not consensus.\n\n### [If a disagreement occurs concerning something, the ruling must be referred back to the Book and the Sunnah]\n\nIf a disagreement occurs concerning something, the ruling must be referred back to the Book and the Prophetic report (الخبر النبوي), for that is <<خَيْرٌ وَأَحْسَنُ تَأْوِيلًا>> (better and the best interpretation).\n\n### [It is not permissible to worship Allah based on mere opinion (الرأي)]\n\nIt is not permissible to worship Allah (يدان الله) based on mere opinion (الرأي), which is a statement without proof (حجة) or evidence (برهان) from the Book, the Sunnah, or Consensus.\n\n### [We do not affirm Analogical Reasoning (القياس), but we do not deem its affirmers mistaken]\n\nAlthough we do not affirm Analogical Reasoning (القياس), we do not deem its affirmers mistaken, provided that the common effective cause ('illah) is comprehensible and clear, and it is highly probable that it was intended by the Legislator (الشارع). We ourselves refrained from adopting *qiyas* because it constitutes an addition to the ruling, and we understood from the Legislator that He desired to lighten the burden upon this Community. He used to say, \"Leave me alone as long as I leave you alone,\" and He disliked questions for fear that a ruling might be revealed concerning them that they would be unable to fulfill—such as standing in prayer during Ramadan, or the Hajj every year, and so forth. Seeing this, we prohibited *qiyas* in the religion, for the Prophet (may Allah bless him and grant him peace) did not command it, nor did the Real (الحق) the Exalted command it. Therefore, abandoning it became incumbent upon us, for it is something the Prophet (may Allah bless him and grant him peace) disliked. The ruling of the principle (حكم الأصل) is that there is no obligation (تكليف), and that Allah created for us <<مَا فِي الْأَرْضِ جَمِيعًا>> (whatever is on the earth, all of it). Whoever claims restriction upon us must provide proof (دليل) from the Book, the Sunnah, or Consensus. As for Analogical Reasoning, I do not affirm it, nor do I follow it in any respect whatsoever.\n\n### [The acts of the Prophet (may Allah bless him and grant him peace) are not obligatory (الوجوب), except those acts he commanded]\n\nAs for the acts (أفعال) of the Prophet (may Allah bless him and grant him peace), they are not obligatory (الوجوب), for that would entail extreme hardship (غاية الحرج), except for an act by which he clarified a matter that Allah made an act of worship (تعبدنا به) for us. That specific act is obligatory, such as his saying: \"Pray as you have seen me praying,\" and \"Take your rituals (مناسككم) from me,\" concerning the acts of Hajj. Were it not for his explicit statement concerning some of these acts, that act would not be incumbent upon us. For he is a human (بشر) who moves as humans move, is pleased as humans are pleased, and is angered as humans are angered. Therefore, we are not obligated to follow him in his actions unless he commanded it. It was incumbent upon him not to perform any act secretly such that no one would see it, just as it was incumbent upon him, regarding what he was commanded to convey, not to speak of it alone such that no one would hear it, until he transmitted it to those who had not heard it.\n\n### [The law of those before us (شرع من قبلنا) is not binding upon us, except what our Law affirmed from it]\n\nAs for the law of those before us (شرع من قبلنا), we are not obligated to follow it except for what our Law (شرعنا) affirmed from it, even though that law was true (حقًا) for those who were addressed by it. We do not deem it false (الباطل); rather, we believe in Allah and His Messenger, and what was revealed to him, and what was revealed before him of revealed scripture and law.\n\n### [Blind following (التقليد) in the religion of Allah is not permissible]\n\nBlind following (التقليد) in the religion of Allah is not permissible according to us, neither following a living person nor a deceased one. It is incumbent upon the questioner, when asking a scholar, to say to him: \"I want the ruling of Allah or the ruling of His Messenger concerning this issue.\" If the one being asked says to him, \"This is the ruling of Allah concerning the issue,\" or \"the ruling of His Messenger,\" then it is incumbent upon the questioner to adopt it, for the one being asked is merely transmitting the ruling of Allah and His Messenger, which we are commanded to adopt. But if he says, \"This is my opinion (رأيي),\" or \"This is a ruling I saw,\" or \"I do not have an explicitly stated ruling concerning this issue, but Analogical Reasoning (القياس) suggests that the ruling should be like the ruling in such-and-such issue whose ruling is explicitly stated,\" then it is not permissible for the questioner to adopt his saying. Rather, he must seek out the People of Remembrance (أهل الذكر) and ask them in the manner we have described.\n\n### [It is incumbent to ask the People of Remembrance (أهل الذكر), who are the People of the Quran and Hadith]\n\nIt is incumbent upon every Muslim to ask only the People of Remembrance (أهل الذكر), who are the People of the Quran—Allah the Exalted said: <<إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ>> (Indeed, it is We who sent down the Remembrance)—and the People of Hadith. If the questioner knows that the one being asked relies on opinion (رأي) and Analogical Reasoning (قياس), he should leave him and ask the person who relies on Hadith. If the one being asked relies on opinion, *qiyas*, and Hadith, he should ask him. When he gives a legal opinion (*aftahu*), it is incumbent upon the questioner to ask him: \"Is this ruling based on opinion, *qiyas*, or a Hadith?\" If he says it is based on opinion or *qiyas*, he should abandon it. If he says it is based on a report (خبر), he should adopt it.\n\n### [The ruling concerning error (الخطأ), forgetfulness (النسيان), and silence regarding them]\n\nThere is no ruling (حكم) for error (الخطأ) or forgetfulness (النسيان) except where it is stated in the Quran or Sunnah that a ruling applies to them, in which case it is acted upon—such as the prayer of the forgetful person, or accidental killing (قتل الخطاء). Everything concerning which the Law is silent (مسكوت عنه) has no ruling except for original permissibility (الإباحة الأصلية).\n\n### [The address of the Law (خطاب الشرع) is directed toward Names (الأسماء) and States (الأحوال), not toward Fixed Entities (الأعيان)]\n\nThe address of the Law (خطاب الشرع) is directed toward the Names (الأسماء) and the States (الأحوال), not toward the Fixed Entities (الأعيان). Thus, the ruling of obligation (الفرض) only applies to the one whose state (حاله) accepts the obligation, whether it be a command or a prohibition, in action or omission. Anyone who is incapable of performing any of that which Allah has obligated him—or rather, that which he is addressed with—is not obligated, for <<إِنَّ اللهَ مَا كَلَّفَ نَفْسًا إِلَّا وُسْعَهَا>> (Indeed, Allah does not charge a soul except with what is within its capacity) and <<إِلَّا مَا آتَاهَا سَيَجْعَلُ اللهُ بَعْدَ عُسْرٍ يُسْرًا>> (except what He has given it. Allah will bring about ease after hardship).\n\n### [An act restricted by time may not be performed except within its time]\n\nEvery act restricted by a time, whether extended or limited, may not be performed except within its time, neither before it nor after it. For that is the boundary (حد) of Allah legislated therein, and it must not be transgressed.\n\n### [The ruling concerning independent reasoning (الاجتهاد) in fundamental (الأصول) and subsidiary matters (الفروع)]\n\nThe ruling concerning independent reasoning (الاجتهاد) in fundamental (الأصول) and subsidiary matters (الفروع) is the same. The truth (الحق) in subsidiary matters is wherever the Law (الشرع) established it. The Law has established the ruling of those who exercise independent reasoning (المجتهدين), and it only establishes what is true; thus, all of it is true. As for attributing error (الخطاء) to the *mujtahid* who receives a single reward, it is due to his failure to discover the specific ruling of Allah or His Messenger concerning that issue. Yet, Allah has made him worship Him according to what his independent reasoning concluded. If it were not true in Allah's sight, He would not have made him worship Him by it, for Allah does not affirm falsehood (الباطل). If, after that, the ruling of Allah the Exalted or His Messenger concerning that issue reaches him, contradicting his proof, and he knows that this ruling is chronologically later than the ruling of his proof, he must retract that first ruling, and it is not permissible for him to remain upon it. For this reason, it was part of the knowledge, religion, and piety of Malik ibn Anas that when he was asked about an issue in the religion of Allah, he would ask, \"Has it been revealed?\" If he was told yes, he would give a legal opinion (*afta*). If he was told no, he would not give an opinion. The reason for this is what we mentioned: the one who is correct regarding the specific ruling in that issue is one, but not specifically designated, and the one who errs is one, but not specifically designated. For this reason, the scholars said: \"Every *mujtahid* is correct.\" He is either correct regarding the specific Divine ruling, or correct regarding the established ruling that Allah affirmed for him when he failed to discover that specific ruling and missed it. This much is sufficient concerning the principles of legal rulings (أصول أحكام الشرع) in this Book, as it does not allow for exhaustive treatment.\n\nAs for the secrets (أسرار) of the principles of legal rulings (أصول أحكام الشرع), both the agreed-upon and the disputed ones:\n\n### [The secret of the principle of adopting the Book (الكتاب)]\n\nThe secret (سر) of the Book (الكتاب) is what comes from Allah to the servant without intermediaries (الوسائط), as He said: <<كَتَبَ فِي قُلُوبِهِمُ الْإِيمَانَ>> (He has inscribed faith in their hearts). They are the Book of Allah. This is the saying of the Legislator: \"Leave that which causes you doubt for that which causes you no doubt,\" and his saying: \"Consult your heart, even if the jurists give you a legal opinion.\" Inscription (*kitaba*) is the joining (الضم) of Divine meanings (المعاني الإلهية) in a manner befitting His Majesty (جلاله), by attributing the Beautiful Names of Allah (أسماء الله الحسنى) to the meanings we possess through ethical disposition (التخلق) with those Names—that is, with their meanings—or by them being inherent characteristics (أخلاق) for us, not merely acquired dispositions (لا تخلقًا). This attribution to us is according to what is fitting for us. He is the Compassionate, the Merciful (الرءوف الرحيم). He said concerning His Messenger (may Allah bless him and grant him peace): <<بِالْمُؤْمِنِينَ رَؤُوفٌ رَحِيمٌ>> (To the believers, he is compassionate and merciful), and this is praise. He named Himself the Mighty, the Generous (العزيز الكريم), and He said concerning one of His servants: <<ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ>> (Taste! Indeed, you are the mighty, the generous), and this is condemnation. All of these are Names of Allah and names of creation (الخلق), and their connotations are rationally understood by their effects in the one named by them. Although their relations (نسبها) differ—His relation to Allah does not resemble its relation to the servant, for <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him)—even though the effect of the Generous (الكريم) is to give, and giving is found both from Allah and from the servant in the sense of bestowal. If the meaning is joined to the meaning from one aspect, they are separated from another aspect, because the described named entity does not resemble the other described named entity. From the aspect where sharing occurs, which is the effect, from that aspect it is inscription (*kitaba*), because *kitaba* means joining (الضم). By joining letters one to another, it is called *kitaba*. A troop (*katiba*) is the joining of horses with their riders one to another; if they came separately, they would not be called a *katiba*. He is the Believer (المؤمن), and He inscribed faith (الإيمان) in the heart of His servant, and that inscription necessitated a ruling by which he is named a believer. The Name is not other than the Named. He is the Manifest (الظاهر) in the locus of the contingent (عين الممكن), and the contingent is a manifestation (مظهر) for Him. Every Manifest in a manifestation has the Manifest joined to the manifestation, and the manifestation joined to the Manifest. Therefore, it is valid for it to be a manifestation for the Manifest within it. This is the secret of the principle of adopting the Book as proof for the establishment of the ruling.\n\n### [The secret of the Sunnah (السنة) in establishing the ruling]\n\nAs for the secret (سر) of the Sunnah (السنة) in establishing the ruling: Since the Messenger (peace be upon him) does not speak from caprice (الهوى), and his ruling is the ruling of Allah, and he transmits from Allah and conveys what Allah showed him, and Allah is upon a straight path (صراط مستقيم), and the Sunnah is the way (الطريقة), and the way is not desired for its own sake but for its goal (غايته), the Sunnah is <<صِرَاطِ اللهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ أَلَا إِلَى اللهِ تَصِيرُ الْأُمُورُ>> (the path of Allah, to whom belongs whatever is in the heavens and whatever is in the earth. Unquestionably, to Allah do all matters return). Because it is upon His path, and He is the goal of His path, the traveler (السالك) upon it must necessarily reach Him. The path (الصراط) is the intermediary (الواسطة). Through the intermediacy of the manifestation's (المظهر) preparedness, according to what it is in itself, a ruling is made upon the Manifest (الظاهر) by the Name He is called. Thus, He gave it that Name, and that ruling is sound. This is a straight path. When we ask the Real (الحق) concerning a matter that concerns us, the effect of our asking upon Allah is the response, so He is named the Responder (مجيبًا). Were it not for our asking, this ruling would not be established, nor would this Name be applied to Him. We are a way (طريقة) for Him in that regard. Allah the Exalted said: <<أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ>> (I respond to the invocation of the supplicant when he calls upon Me). He did not respond to him until he called upon Him. This is the secret of deriving proof from the Sunnah.\n\n### [The secret of adopting Consensus (الإجماع) as a basis for establishing the ruling]\n\nAs for Consensus (الإجماع), it is what the Lord (الرب) and the lorded (المربوب) agree upon, such as that Allah is the Creator (خالق) and the servant is the created (مخلوق). Likewise for every attribution (إضافة). There is no disagreement between Allah and His servants concerning issues of attribution wherever they are found, and likewise concerning known things (المعلومات) insofar as they are known things.\n\n### [The ruling concerning the secret of Analogical Reasoning (القياس) in deriving proof, according to its affirmers]\n\nAs for Analogical Reasoning (القياس) according to its affirmers, it is the manifestation (ظهور) of a Lord (رب) with the attribute of a servant ('abd), and the manifestation of a servant with the attribute of a Lord, resulting from a command of the Lord (أمر رب). If it is not resulting from a command of the Lord, it is not taken as a proof for a ruling. Or, if it results from a praiseworthy, noble disposition (حميد خلق كريم), it is also taken as a proof. As for the manifestation of a Lord with the attribute of a lorded (مربوب), the obligatory command is not a condition for it, but it may result from supplication (دعاء) and request. Its description is the description of the command, but the meaning is different, even though this is heard and obeyed, and the other is likewise, but there is a distinction between them. This is the ruling concerning the secret of *qiyas* in deriving proof, which is the analogizing of the unseen (الغائب) to the witnessed (الشاهد) due to a comprehensible ruling that unites the witnessed and the unseen. It is attributed to each of the two entities according to what is fitting for His Majesty (جلاله). We only said \"His Majesty\" because *al-Jalil* (الجليل) is an antinomy (من الأضداد) applied both to the magnificent (العظيم) and to the contemptible (الحقير). The secrets of the principles of legal rulings (أصول أحكام الشرع) have concluded. The ninety-fourth section is finished.\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)",
    "ur": "(اٹھاسیواں باب: احکام شریعت کے اصولوں کے اسرار کی معرفت میں)\n\nشریعت وہ ہے جسے ذات حق نے اخلاق کے طور پر مشروع کیا، پس وہی ان کے حق اور اپنے حق کو جاننے والا ہے۔\n\nاور جب کوئی بندہ کوئی شریعت (قانون) لاتا ہے، تو ذات حق اس کے حق میں اس کے حق کے ساتھ قائم ہو جاتا ہے۔\n\nاور دونوں شریعتیں ایک ہی اصل سے ہیں، جب تک کہ وہ (بندہ) یہ نہ کہے کہ اللہ نے اپنی مخلوق سے کہا ہے۔\n\nپس جب وہ ایسا کہتا ہے، تو یہ ایک جال ہے، جس کا ستارہ اس کے ہم نشین کے ستارے سے اس کے افق پر طلوع ہوتا ہے۔\n\nتاکہ وہ اس چیز کی تصدیق کریں جس کی انہوں نے اپنے افکار کی تقلید کی ہے، پس وہ جھوٹا ہے اگرچہ وہ تمہارے پاس سچائی کے ساتھ آئے۔\n\nپس اس کی اصل کتاب کے احکام پر غور کرو، کیونکہ بسا اوقات ملعون اپنے ہی تھوک سے پھنس جاتا ہے۔\n\n### [شریعت کے متفقہ اور مختلف فیہ اصول]\n\nجان لو کہ احکام شریعت کے متفقہ اصول تین ہیں: کتاب (قرآن)، سنت متواترہ، اور اجماع۔ اور علماء نے قیاس (Analogical Reasoning) میں اختلاف کیا ہے۔ بعض کہتے ہیں کہ یہ دلیل ہے اور احکام کے اصولوں میں سے ہے، اور بعض اس کے منع کے قائل ہیں، اور میں اسی کا قائل ہوں۔\n\n### [تقویٰ ایک مشروع عمل ہے، لہٰذا اس کے حکم کی نسبت کسی شرعی دلیل یا اصل کی طرف ہونا ضروری ہے]\n\nاللہ تعالیٰ نے فرمایا: **\"اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے\"** (وَاتَّقُوا الله ويُعَلِّمُكُمُ الله)۔ اور فرمایا: **\"اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) بنا دے گا\"** (إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً)۔ اور فرمایا: **\"اللہ سے ڈرو اور اس کے رسول پر ایمان لاؤ، وہ تمہیں اپنی رحمت کے دو حصے عطا کرے گا اور تمہارے لیے ایک نور بنا دے گا جس میں تم چلو گے اور تمہیں بخش دے گا\"** (اتَّقُوا الله وآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ من رَحْمَتِهِ ويَجْعَلْ لَكُمْ نُوراً تَمْشُونَ به ويَغْفِرْ لَكُمْ)۔ یہ اس کے قول کی مانند ہے جو اس نے اپنے بندے خضر کے بارے میں فرمایا: **\"ہم نے اسے اپنی طرف سے رحمت عطا کی اور اسے اپنے پاس سے علم سکھایا\"** (آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً)۔ پس اس نے اپنے بندے کو علم عطا کرنے کو اپنی رحمت میں سے قرار دیا۔ اور تقویٰ ہمارے لیے ایک مشروع عمل ہے، لہٰذا ضروری ہے کہ تقویٰ کے حکم کی نسبت ان دلائل میں سے کسی ایک دلیل یا ان سب کی طرف ہو، ہر اس مسئلے میں جس میں ہم پر اللہ کا تقویٰ لازم ہے۔\n\n### [شریعت میں فاعل اور منفعل اصول اور الٰہی و کونی حقائق]\n\nجنید (رحمۃ اللہ علیہ) نے فرمایا: \"ہمارا یہ علم کتاب اور سنت کے ساتھ مقید ہے\"۔ اور یہ دونوں فاعل اصول ہیں، جبکہ اجماع اور قیاس صرف کتاب اور سنت کے ذریعے ہی ثابت ہوتے ہیں اور ان کی دلالت صحیح ہوتی ہے، لہٰذا یہ دونوں حکم میں منفعل اصول ہیں۔ پس ان چاروں حقائق سے مشروع احکام کی نشأت ظاہر ہوئی جن پر عمل کرنے سے سعادت حاصل ہوتی ہے۔ کیونکہ موجودات چار الٰہی حقائق سے ظاہر ہوئیں: حیات، علم، ارادہ، اور قدرت۔ اور اجسام چار حقائق سے ظاہر ہوئے: حرارت، برودت، یبوست، اور رطوبت۔ اور مولدات (پیدا ہونے والی چیزیں) چار ارکان سے ظاہر ہوئیں: آگ، ہوا، پانی، اور مٹی۔ اور انسان اور حیوان کا جسم چار اخلاط سے ظاہر ہوا: صفرا، سودا، خون، اور بلغم۔ پس حرارت اور برودت فاعل ہیں، اور رطوبت اور یبوست منفعل ہیں، پس جان لو۔\n\n### [جنید کے قول کا گہرا معنی: ہمارا علم کتاب اور سنت کے ساتھ مقید ہے]\n\nچونکہ وہ شخص جو نازل شدہ شرائع پر ایمان نہیں رکھتا، وہ بھی ریاضت، مجاہدہ، اور نفس کو طبیعت کے حکم سے آزاد کرنے میں ہمارے ساتھ شریک ہوتا ہے، تو اس پر پاکیزہ ارواح سے اتصال ظاہر ہوتا ہے، اور اس اتصال کا حکم اس پر اسی طرح ظاہر ہوتا ہے جس طرح نازل شدہ شرائع پر عمل کرنے والے مومنین پر ظاہر ہوتا ہے۔ یہ اس تشبیہ اور اشتراک کی وجہ سے ہے جو عام لوگوں کے نزدیک مذکور ہوا، اور ہم نے ان علوم کے ساتھ کلام کیا جو ریاضت کے کشف (الکشف) اور علوی ارواح کی مدد سے حاصل ہوتے ہیں، اور اس فاضل نفوس میں وہ سب کچھ نقش ہو گیا جو عالم میں ہے، پس انہوں نے غیوب کے ساتھ کلام کیا۔ جنید نے فرمایا: \"ہمارا یہ علم اگرچہ ہمارے اور عقلمندوں کے درمیان مشترک ہے، لیکن ہماری ریاضت، مجاہدہ، اور وہ اعمال جنہوں نے ہمیں یہ علوم اور ہم پر ظاہر ہونے والے آثار عطا کیے، وہ صرف کتاب اور سنت پر ہمارے عمل سے حاصل ہوئے\"۔ پس یہ ان کے قول کا معنی ہے کہ \"ہمارا یہ علم کتاب اور سنت کے ساتھ مقید ہے\"۔ اور قیامت کے دن ہم ان (غیر مومن ریاضت گزاروں) سے اسی قدر کے ذریعے ممتاز ہوں گے، کیونکہ انہیں الٰہیات میں کوئی ذوق حاصل نہیں ہے۔ ان کا فیض روحانی ہے، اور ہمارا فیض روحانی اور الٰہی ہے، کیونکہ ہم نے ایک الٰہی طریقہ اختیار کیا جسے شریعت کہا جاتا ہے، پس اس نے ہمیں شارع (قانون ساز) یعنی اللہ تعالیٰ تک پہنچا دیا، کیونکہ اس نے اسے اپنی طرف جانے کا راستہ بنایا ہے۔ پس یہ جان لو۔\n\n### [اجماع کا کسی نص پر مبنی ہونا ضروری ہے، اگرچہ اس کا اظہار نہ کیا گیا ہو]\n\nچونکہ مکلف انسان کی حرکات میں اللہ کا شرع اور حکم صرف قرآن سے ہی لیا جاتا ہے، اسی طرح یہ صرف اس کے متکلم (بولنے والے) یعنی اللہ تعالیٰ کے ذریعے ہی موجود ہوا، جس نے کسی چیز کے لیے کہا: \"ہو جا\"، تو وہ ہو گئی۔ پس قرآن سب سے مضبوط دلیل ہے جس پر بھروسہ کیا جاتا ہے، یا وہ جو رسول اللہ صلی اللہ علیہ وسلم سے صحیح ثابت ہو، جن کی سچائی پر دلیل قائم ہے کہ وہ اللہ کی طرف سے ان تمام چیزوں کی خبر دینے والے ہیں جو اس نے اللہ کے بندوں کے لیے مشروع کیں۔ اور یہ خبر یا تو صحابہ کے اجماع سے ہو سکتی ہے، اور یہی اجماع ہے، یا ان میں سے بعض کی طرف سے ہو سکتی ہے جو عادل راوی کی عادل راوی سے نقل کردہ ہو، اور یہ خبر واحد ہے۔ اور جس بھی طریقے سے یہ ہم تک پہنچے، ہم اس پر عمل کرنے کے مکلف ہیں، اس میں علماء اسلام کے درمیان کوئی اختلاف نہیں۔ اسی لیے اہل اصول اجماع کے بارے میں کہتے ہیں کہ اس کا کسی نص پر مبنی ہونا ضروری ہے، اگرچہ اس کا اظہار نہ کیا گیا ہو۔\n\n### [قیاس کو شرعی دلیل اور دینی اصل کے طور پر اختیار کرنے میں اختلاف ہے]\n\nاور جہاں تک قیاس کا تعلق ہے، تو اسے دلیل اور اصل کے طور پر اختیار کرنے میں اختلاف ہے۔ کیونکہ معقول میں اس کا ایک پہلو ہے، لہٰذا بعض مقامات پر اسے اختیار کرنے کی قوت اسے ترک کرنے پر غالب آتی ہے، اور بعض مقامات پر ایسا ظاہر نہیں ہوتا۔ اس کے باوجود، یہ کوئی قطعی دلیل نہیں ہے، لہٰذا یہ خبر آحاد (خبر واحد) سے مشابہت رکھتا ہے۔ چونکہ خبر واحد کو اختیار کرنے پر اتفاق ہے، باوجود اس کے کہ وہ علم کا فائدہ نہیں دیتا، اور وہ احکام کے اصولوں میں سے ایک اصل ہے، تو قیاس بھی ایسا ہی ہونا چاہیے جب وہ واضح ہو اور اس میں کوئی شک نہ ہو۔ اور ہمارے نزدیک، اگرچہ ہم اپنے حق میں اس کے قائل نہیں ہیں، لیکن میں اس شخص کے لیے اس پر حکم لگانے کی اجازت دیتا ہوں جس کا اجتہاد اسے اس کے اثبات کی طرف لے جائے، خواہ اس میں وہ غلطی کرے یا صحیح۔ کیونکہ شارع (اللہ تعالیٰ) نے مجتہد کے حکم کو ثابت کیا ہے، اگرچہ وہ غلطی کرے، اور وہ ماجور (اجر والا) ہے۔ اگر مجتہد نے قیاس کے اثبات میں کتاب، سنت، اجماع، یا ان میں سے کسی اصل سے دلیل نہ لی ہوتی، تو اس کے لیے اس پر حکم لگانا حلال نہ ہوتا۔ بلکہ بسا اوقات منصف کے نزدیک غور و فکر کے حکم میں واضح قیاس، صحیح خبر واحد سے زیادہ حکم پر دلالت میں قوی ہوتا ہے۔ کیونکہ ہم اسے صرف اس کے راویوں کے حسن ظن کی بنا پر لیتے ہیں، اور ہم اللہ پر علم کے طور پر اس کی تزکیہ نہیں کرتے، کیونکہ شریعت نے ہمیں منع کیا ہے کہ ہم اللہ پر کسی کی تزکیہ کریں، اور ہم کہتے ہیں کہ میں اسے ایسا گمان کرتا ہوں اور ایسا خیال کرتا ہوں۔\n\n### [واضح قیاس اور صحیح عقلی نظر]\n\nاور واضح قیاس میں صحیح عقلی نظر ہمارے ساتھ شریک ہے۔ اور ہم نے اس عقلی نظر سے ثابت کیا ہے جس کا ہمیں شرعاً حکم دیا گیا ہے، جیسا کہ اللہ تعالیٰ کا فرمان ہے: **\"کیا انہوں نے آسمانوں اور زمین کی بادشاہت میں غور نہیں کیا؟\"** (أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ) اور **\"کیا انہوں نے غور نہیں کیا کہ ان کے ساتھی کو کوئی جنون نہیں ہے؟\"** (أَ ولَمْ يَتَفَكَّرُوا ما بِصاحِبِهِمْ من جِنَّةٍ)۔ اور قرآن میں اس طرح کی بہت سی مثالیں ہیں۔ پس شارع نے سب سے پہلے اللہ کے وجود کے اثبات میں عقلی نظر کے حکم کو معتبر قرار دیا، اور یہ سب سے بڑا رکن ہے۔ پھر اس نے اس کی الوہیت میں اس کی توحید میں اسے معتبر قرار دیا، پس ہمیں اپنی عقلوں سے اس بات پر غور کرنے کا مکلف بنایا کہ اللہ کے سوا کوئی معبود نہیں ہے۔ پھر ہم نے عقلی دلیل سے غور کیا کہ اس الٰہ کے لیے کیا احکام واجب ہیں۔ پھر ہم نے اس عقلی نظر سے غور کیا جس کا ہمیں حکم دیا گیا ہے، اس بات کی تصدیق میں جو یہ رسول اس کی طرف سے لائے، چونکہ وہ ہماری طرح ایک بشر تھے۔ پس ہم نے عقلوں سے ان کی نشانیوں اور اس دلیل پر غور کیا جو انہوں نے اپنی سچائی پر قائم کی، اور ہم نے اسے ثابت کیا۔ اور یہ سب اصول ہیں، اگر ان میں سے ایک بھی رکن منہدم ہو جائے تو شرائع باطل ہو جائیں گی، اور ان کے ثبوت کا ماخذ عقلی نظر ہے، اور شرع نے اسے معتبر قرار دیا اور اپنے بندوں کو اس کا حکم دیا۔ اور قیاس ایک عقلی نظر ہے۔ کیا تم دیکھتے ہو کہ ذات حق ان اہم اور عظیم ارکان میں اسے مباح قرار دیتا ہے اور ایک فروعی مسئلے میں اسے ہم پر روک دیتا ہے جس کا ذکر ہمیں نہ کتاب میں ملا، نہ سنت میں، اور نہ اجماع میں؟ اور ہم یقین رکھتے ہیں کہ اس میں کوئی نہ کوئی الٰہی مشروع حکم ضرور ہونا چاہیے، اور تمام راستے بند ہو چکے ہیں، تو ہم اصل کی طرف رجوع کرتے ہیں، اور وہ عقلی نظر ہے۔ اور ہم نے اس اصل کے اثبات کے قواعد کو کتاب اور سنت بنایا، پس ہم نے اس میں غور کیا اور قیاس کو احکام کی دلیلوں کے اصولوں میں سے ایک اصل ثابت کیا، اس قدر عقلی نظر کے ساتھ، چونکہ اصول میں اس کا حکم تھا۔ پس ہم نے ایک خاموش (غیر منصوص) مسئلے کو ایک منطوق (منصوص) مسئلے پر ایک معقول علت کی بنا پر قیاس کیا، جس کے بارے میں یہ بعید نہیں کہ وہ شارع کا مقصود ہو، جو ضرورت کے مقامات پر ان دونوں کو جمع کرتی ہے، جب ہمیں اس میں کوئی متعین نص نہ ملے۔ پس یہ اس مسئلے میں ہمارا مذہب ہے۔\n\n### [قیاس کو اصل ماننے والوں اور فروع میں مجتہدین کو غلط قرار دینا شارع کے ساتھ سوءِ ادب ہے]\n\nاور ہر وہ شخص جو میرے نزدیک قیاس کو اصل ماننے والے کو غلط قرار دیتا ہے، یا کسی مجتہد کو کسی فرع یا اصل میں غلط قرار دیتا ہے، تو اس نے شارع کے ساتھ سوءِ ادب کیا، جہاں شارع نے اس کے حکم کو ثابت کیا ہے۔ اور شارع باطل کو ثابت نہیں کرتا، لہٰذا یہ حق ہونا ضروری ہے۔ اور اس پر خطا کی نسبت اس لحاظ سے ہے کہ اس نے مخالف کی دلیل کو غلط سمجھا جو مجتہد کے نزدیک صحیح نہیں تھی۔ اور شریعت میں غلطی کرنے والا ایک ہے جو متعین نہیں ہے، لہٰذا اس کے قول کو لینا ضروری ہے، اور اس کے قول میں قیاس کا اثبات بھی شامل ہے۔ پس شارع نے اس کے لینے کا حکم دیا ہے، اگرچہ وہ نفس الامر میں غلط ہو، تو اس نے اسے اس کا مکلف بنایا ہے۔ کیونکہ شارع کو اختیار ہے کہ وہ اپنے بندوں کو جس چیز کا چاہے مکلف بنائے۔ اور یہ وہ طریقہ ہے جس میں ہم اپنے علم میں منفرد ہیں، باوجود اس کے کہ ہم اپنے لحاظ سے قیاس کے قائل نہیں ہیں، لیکن ہم اس شخص کے لحاظ سے اس کے قائل ہیں جس کا اجتہاد اسے اس کی طرف لے جائے، کیونکہ شارع نے اسے ثابت کیا ہے۔ اگر مخالف انصاف کرتا تو اس مسئلے میں جھگڑے سے خاموش رہتا، کیونکہ یہ اس سے زیادہ واضح ہے کہ اس میں جھگڑا کیا جائے۔ اور **\"اللہ حق کہتا ہے اور وہی سیدھا راستہ دکھاتا ہے\"** (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔\n\n### [الفتوحات کے ابواب کی ترتیب اختیار یا فکری غور و فکر سے نہیں، بلکہ الہام سے ہے]\n\nپھر ہم اس باب میں ان چیزوں کو بیان کریں گے جو علماء اسلام کے نزدیک اصول احکام سے متعلق ہیں، جیسا کہ ہم نے عبادات میں جانا۔ اور اولیٰ یہ تھا کہ اس باب کو عبادات کے شروع میں، ان میں داخل ہونے سے پہلے، مقدم کیا جاتا، لیکن یہ اسی طرح واقع ہوا۔ کیونکہ ہم نے یہ ترتیب اختیار سے نہیں کی، اور اگر یہ فکری غور و فکر سے ہوتی تو حکمت کی ترتیب میں اس کی یہ جگہ نہ ہوتی۔ پس یہ اس آیت سے مشابہت رکھتی ہے جس میں اللہ تعالیٰ کا فرمان ہے: **\"نمازوں کی اور خاص طور پر درمیانی نماز کی حفاظت کرو\"** (حافِظُوا عَلَى الصَّلَواتِ والصَّلاةِ الْوُسْطى‏)، جو طلاق، نکاح، اور وفات کی عدت کی آیات کے درمیان میں ہے، جو اس سے پہلے اور بعد میں ہیں۔ پس ظاہر یہ بتاتا ہے کہ یہ اس کی جگہ نہیں ہے، لیکن اللہ نے اسے اس کی جگہ بنایا، کیونکہ وہ جانتا ہے کہ چیزوں میں کیا مناسب ہے۔ کیونکہ حکیم وہ ہے جو مناسب کام کو مناسب وقت پر مناسب طریقے سے کرتا ہے، اگرچہ ہم اس میں مناسبت کی صورت سے ناواقف ہوں۔ پس اللہ تعالیٰ نے یہ ترتیب ہمارے ہاتھ پر مرتب کی، تو ہم نے اسے چھوڑ دیا اور اپنی رائے یا عقلوں سے اس میں دخل نہیں دیا۔ پس اللہ دلوں پر الہام کے ذریعے وہ سب کچھ املا کرتا ہے جو عالم (عارف) وجود میں لکھتا ہے، کیونکہ عالم ایک مسطور (لکھا ہوا) الٰہی کتاب ہے۔\n\n### [دو آیات یا دو خبروں کا تعارض]\n\nاور جب دو آیات یا دو صحیح خبریں متعارض ہوں، اور ان کے درمیان جمع کرنا اور دونوں کو ایک ساتھ استعمال کرنا ممکن ہو، تو ہم ان کے استعمال سے گریز نہیں کریں گے۔ اور اگر دونوں کو ایک ساتھ استعمال کرنا ممکن نہ ہو، اس طرح کہ ان میں سے ایک میں استثناء ہو، تو استثناء والی کو لینا واجب ہے۔ اور اگر ان میں سے ایک میں زیادتی ہو، تو زیادتی کو لیا جائے گا اور اس پر عمل کیا جائے گا۔ اور اگر ان میں سے کوئی چیز نہ پائی جائے اور وہ تمام پہلوؤں سے متعارض ہوں، تو تاریخ کو دیکھا جائے گا، اور ان میں سے مؤخر (بعد والی) کو لیا جائے گا۔ اور اگر تاریخ معلوم نہ ہو اور اس کا علم مشکل ہو، تو ان میں سے اس کو دیکھا جائے گا جو دین میں حرج کو دور کرنے کے زیادہ قریب ہو، اور اس پر عمل کیا جائے گا، کیونکہ اس کی تائید اس بات سے ہوتی ہے کہ **\"اس نے تم پر دین میں کوئی تنگی نہیں رکھی\"** (ما جَعَلَ عَلَيْكُمْ في الدِّينِ من حَرَجٍ) اور اللہ کا دین آسان ہے۔\n\n**\"اور اللہ تمہارے لیے آسانی چاہتا ہے اور تمہارے لیے تنگی نہیں چاہتا\"** (ويُرِيدُ الله بِكُمُ الْيُسْرَ ولا يُرِيدُ بِكُمُ الْعُسْرَ)۔ اور **\"جس چیز کا میں تمہیں حکم دوں، اس میں سے جو تم کر سکو وہ کرو، اور جس چیز سے میں تمہیں منع کروں، اسے چھوڑ دو\"**۔\n\nاگر وہ حرج کو دور کرنے میں برابر ہوں، تو وہ ساقط نہیں ہوں گی، اور تمہیں ان میں اختیار ہوگا کہ تم دونوں خبروں یا دونوں آیات میں سے جس پر چاہو عمل کرو۔\n\n### [ایک آیت اور ایک صحیح خبر واحد کا تعارض اور تاریخ کا معلوم نہ ہونا]\n\nاور جب ایک آیت اور ایک خبر واحد جو تمام پہلوؤں سے صحیح ہو، متعارض ہوں، اور تاریخ معلوم نہ ہو، تو آیت کو لیا جائے گا اور خبر کو چھوڑ دیا جائے گا، کیونکہ آیت قطعی ہے اور خبر واحد ظنی ہے۔\n\nاگر خبر آیت کی طرح متواتر ہو، اور تاریخ معلوم نہ ہو، اور ان کے درمیان جمع کرنا ممکن نہ ہو، تو حکم میں اختیار ہوگا، سوائے اس کے کہ ان میں سے ایک میں حرج کو دور کرنا ہو، تو اسے مقدم کیا جائے گا۔\n\n### [زیادتی والی حدیث کو اس کے معارض پر ترجیح دینا]\n\nاور ہر دو خبریں یا دو آیات جو متعارض ہوں، یا ایک آیت اور ایک صحیح خبر، خواہ متواتر ہو یا غیر متواتر، اور ان میں سے ایک میں حکم کی زیادتی ہو، تو زیادتی کو قبول کیا جائے گا اور اس پر عمل کیا جائے گا، اور زیادتی والی حدیث کو اس کے معارض پر ترجیح دی جائے گی۔\n\n### [جب حدیث صحیح ہو اور اس کے مقابلے میں کسی صحابی یا امام مذہب کا قول ہو تو حدیث سے انحراف نہیں کیا جائے گا]\n\nاور حدیث سے صرف وہی لیا جائے گا جو صحیح ہو۔ اگر مکلف مقلد ہو اور اسے رسول اللہ صلی اللہ علیہ وسلم سے منسوب کوئی ضعیف حدیث پہنچی ہو، اور اس کے مقابلے میں کسی امام یا صحابی کا قول ہو جس کی دلیل معلوم نہ ہو، تو وہ ضعیف حدیث کو لے گا اور اس قول کو چھوڑ دے گا، کیونکہ زیادہ سے زیادہ یہ ہے کہ اگر وہ حدیث نفس الامر میں صحیح نہ ہو تو وہ اس قول کے درجے میں ہوگی۔ اور حدیث سے انحراف نہیں کیا جائے گا۔ لیکن اگر حدیث صحیح ہو اور اس کے مقابلے میں کسی صحابی یا امام کا قول ہو، تو حدیث سے انحراف کرنے کا کوئی راستہ نہیں ہے، اور اس امام اور صحابی کے قول کو خبر کی وجہ سے چھوڑ دیا جائے گا۔ اور اگر خبر مرسل یا موقوف ہو، تو اس پر بھروسہ نہیں کیا جائے گا، مگر جب یہ معلوم ہو کہ تابعی صرف صحابی سے ہی حدیث مرسل کرتا ہے، اگرچہ وہ صحابی متعین نہ ہو۔ تو مرسل کو لیا جائے گا، کیونکہ وہ مسند کے حکم میں ہے۔ اور وہ یہ ہے کہ تابعی کہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا، اور اس صحابی کا ذکر نہ کرے جس سے اس نے روایت کی، اور یہ معلوم ہو کہ وہ صحابہ کو پانے والا اور ان کی صحبت اختیار کرنے والا ہے، اور اپنے دین میں ثقہ ہے، اور یہ بھی معلوم ہو کہ وہ ان لوگوں میں سے ہے جو مصالح میں بھی نبی صلی اللہ علیہ وسلم پر جھوٹ بولنا جائز نہیں سمجھتے۔ اگر اس کے بارے میں یہ معلوم ہو جائے تو اس کی حدیث نہیں لی جائے گی، اگرچہ وہ اسے مسند ہی کیوں نہ کرے۔ اور کسی صحابی یا امام کے قول کی وجہ سے کسی آیت یا صحیح خبر کو ترک کرنا جائز نہیں ہے، اور جو ایسا کرتا ہے **\"تو وہ کھلی گمراہی میں گمراہ ہوا\"** (فَقَدْ ضَلَّ ضَلالًا مُبِيناً) اور اللہ کے دین سے خارج ہو گیا۔\n\n### [جب خبر مستور (غیر معروف) لوگوں سے آئے تو اس پر عمل کیا جائے گا]\n\nاور جب خبر ایسے مستور لوگوں سے آئے جن کے بارے میں جرح یا تعدیل میں کوئی بات نہ کی گئی ہو، تو ان کی روایت کو لینا واجب ہے۔ اگر ان میں سے کسی ایک پر ایسی جرح ثابت ہو جائے جو اس کی سچائی پر اثر انداز ہو، تو اس کی حدیث کو ترک کر دیا جائے گا۔ اور اگر جرح اس کی نقل سے متعلق نہ ہو، تو اسے لینا واجب ہے، سوائے شراب پینے والے کے، جب وہ نشے کی حالت میں حدیث بیان کرے۔ لیکن اگر یہ معلوم ہو کہ اس نے ہوش کی حالت میں حدیث بیان کی ہے اور وہ اسی صفت کا حامل ہے، تو اس کا قول لیا جائے گا۔ اور اسلام ہی عدالت (عدل) ہے، اور جرح ایک عارضی چیز ہے۔ اور جب وہ اس حد تک ثابت ہو جائے جو ہم نے کہا، تو اس جرح والے شخص کی حدیث کو لینا ترک کر دیا جائے گا۔\n\n### [صحیح خبر واحد اور متواتر خبر کا تعارض]\n\nاور صحیح خبر واحد کو لینے اور متواتر خبر کو لینے میں کوئی فرق نہیں ہے، سوائے اس کے کہ جب وہ متعارض ہوں، جیسا کہ ہم نے کہا۔\n\n### [اللہ نے ہم پر رسول کے علاوہ کسی کے قول کو لینا واجب نہیں کیا]\n\nاور اللہ نے ہم پر رسول اللہ صلی اللہ علیہ وسلم کے علاوہ کسی کے قول کو لینا واجب نہیں کیا، باوجود اس کے کہ ہمیں ان کی تعظیم اور محبت کا حکم دیا گیا ہے۔\n\n### [نسخ اللہ کے علم میں حکم کی مدت کا اختتام ہے]\n\nاور جہاں تک نسخ (Abrogation) کا تعلق ہے، تو میں اس کا قائل نہیں ہوں جس طرح وہ (عام علماء) اس کے قائل ہیں۔ کیونکہ ہمارے نزدیک یہ اللہ کے علم میں حکم کی مدت کا اختتام ہے۔ جب وہ مدت ختم ہو جائے، تو جائز ہے کہ قرآن یا سنت سے کوئی دوسرا حکم آ جائے۔ اگر ایسی چیز کو نسخ کہا جائے تو ہم اس کے قائل ہیں۔ اور جب معاملہ ایسا ہو، تو قرآن کا نسخ قرآن سے اور سنت سے جائز ہے۔ کیونکہ سنت مبین (واضح کرنے والی) ہے، اس لیے کہ آپ صلی اللہ علیہ وسلم کو حکم دیا گیا ہے کہ وہ لوگوں کے لیے اس چیز کو واضح کریں جو ان کی طرف نازل کی گئی ہے، اور اس کے مطابق حکم کریں جو اللہ نے انہیں دکھایا ہے، نہ کہ جو ان کے نفس نے دکھایا ہے۔ کیونکہ وہ صرف اسی کی پیروی کرتے ہیں جو ان کی طرف وحی کیا جاتا ہے، خواہ وہ قرآن ہو یا غیر قرآن۔ اور سنت کا نسخ قرآن اور سنت سے جائز ہے۔ اور جب کسی آیت یا خبر کی نص وارد ہو، تو اس قرآن یا خبر کو لینے سے رکنا جائز نہیں ہے یہاں تک کہ یہ دیکھا جائے کہ آیا اس کا کوئی معارض ہے یا نہیں، بلکہ جو کچھ اسے پہنچا ہے اس پر عمل کرے گا۔ پھر اگر اس کے بعد اسے کوئی ناسخ (منسوخ کرنے والی)، یا مخصص (خاص کرنے والی)، یا متقدم (پہلے والے) کو عام کرنے والی خبر یا آیت ملے، تو وہ اس کی شرائط کے مطابق اس پر عمل کرے گا، اور وہ یہ ہے کہ تاریخ کی تحقیق کی جائے، کیونکہ خاص حکم عام سے پہلے آ سکتا ہے، جیسا کہ عام خاص سے پہلے آتا ہے، اور اصل یہ ہے کہ حکم مؤخر (بعد والے) کے لیے ہے۔\n\n### [کتاب اور سنت کے الفاظ کو عربی زبان کے مطابق یا شارع کی تفسیر کے مطابق لیا جائے گا]\n\nاور جب آیت یا خبر زبان کے کسی لفظ کے ساتھ وارد ہو، تو اصل یہ ہے کہ اسے عربی زبان میں اس کے معنی کے مطابق لیا جائے گا۔ لیکن اگر شارع نے اسے زبان کے مفہوم کے علاوہ کسی اور چیز پر اطلاق کیا ہو، جیسے نماز، وضو، حج، اور زکوٰۃ کا نام، تو اصل وہ ہو جاتا ہے جس کی شارع نے تفسیر کی اور اسے مقرر کیا۔ پس اگر اس کے بعد اس لفظ کے ساتھ کوئی خبر وارد ہو، تو اسے شارع کی تفسیر کردہ معنی پر محمول کیا جائے گا، اور اسے اس معنی پر محمول نہیں کیا جائے گا جو زبان میں ہے، یہاں تک کہ رسول سے اس لفظ کے بارے میں یہ وارد ہو کہ اس سے مراد وہی ہے جو زبان میں ہے، تو اس وقت اس خبر میں خاص طور پر اس کی طرف رجوع کیا جائے گا۔\n\n### [شریعت کے اوامر وجوب پر اور نواہی ممانعت پر محمول ہیں]\n\nاور شریعت کے تمام اوامر وجوب (فرضیت) پر محمول ہیں، اور اس کی نواہی حظر (ممانعت) پر محمول ہیں، جب تک کہ امر کے ساتھ کوئی ایسا قرینہ حال نہ ہو جو اسے وجوب سے نکال کر ندب (مستحب) یا اباحت (جائز) کی طرف لے جائے۔ اور اسی طرح نہی بھی، اگر اس کے ساتھ کوئی ایسا قرینہ ہو جو اسے حظر سے نکال کر کراہت کی طرف لے جائے۔ اگر امر ندب یا اباحت کے قرینے سے خالی ہو، تو وجوب متعین ہو جائے گا، اور اسی طرح نہی بھی۔ اور الٰہی یا نبوی امر نہی پر صرف تحجیر (پابندی) کو ہٹانے کے لیے بھی وارد ہو سکتا ہے، نہ کہ مامور بہ فعل کے وجوب کے لیے۔\n\n### [اجماع صرف رسول کے بعد صحابہ کا اجماع ہے]\n\nاور اجماع رسول اللہ صلی اللہ علیہ وسلم کے بعد صرف صحابہ کا اجماع ہے، اور ان کے دور کے علاوہ کوئی اجماع نہیں ہے جس سے حکم لگایا جائے۔ اور اجماع کی صورت یہ ہے کہ یہ معلوم ہو کہ وہ مسئلہ صحابہ میں سے ہر ایک تک پہنچا، اور اس نے اس میں وہی حکم دیا جو دوسرے نے دیا، یہاں تک کہ ان میں سے کوئی باقی نہ رہا مگر یہ کہ وہ معاملہ اس تک پہنچا اور اس نے اس میں وہی حکم دیا۔ اگر کسی ایک سے بھی اس میں اختلاف نقل کیا جائے، تو وہ اجماع نہیں ہے، یا اس سے خاموشی نقل کی جائے، تو وہ اجماع نہیں ہے۔\n\n### [جب کسی چیز میں اختلاف ہو جائے تو اس کا حکم کتاب اور سنت کی طرف لوٹانا واجب ہے]\n\nاور جب کسی چیز میں اختلاف ہو جائے، تو اس کا حکم کتاب اور نبوی خبر کی طرف لوٹانا واجب ہے، کیونکہ **\"یہ بہتر ہے اور انجام کے لحاظ سے اچھا ہے\"** (خَيْرٌ وأَحْسَنُ تَأْوِيلًا)۔\n\n### [رائے کے ذریعے اللہ کی عبادت کرنا جائز نہیں]\n\nاور رائے کے ذریعے اللہ کی عبادت کرنا جائز نہیں ہے، اور رائے وہ قول ہے جو کتاب، سنت، یا اجماع میں سے کسی دلیل یا برہان کے بغیر ہو۔\n\n### [ہم قیاس کے قائل نہیں، لیکن اسے ثابت کرنے والے کو غلط نہیں ٹھہراتے]\n\nاور اگرچہ ہم قیاس کے قائل نہیں ہیں، لیکن ہم اسے ثابت کرنے والے کو غلط نہیں ٹھہراتے، جب علت جامعہ معقول اور واضح ہو، اور غالب گمان ہو کہ وہ شارع کا مقصود ہے۔ اور ہم نے قیاس کو اختیار کرنے سے اس لیے گریز کیا کہ یہ حکم میں زیادتی ہے، اور ہم نے شارع سے یہ سمجھا کہ وہ اس امت پر تخفیف (آسانی) چاہتا تھا۔ اور وہ فرمایا کرتے تھے: \"مجھے چھوڑ دو جب تک میں تمہیں چھوڑے رکھوں\"۔ اور وہ سوالات کو ناپسند کرتے تھے، اس خوف سے کہ ان پر اس بارے میں کوئی حکم نازل ہو جائے اور وہ اسے پورا نہ کر سکیں۔\n\nجیسے رمضان میں قیام (تراویح) اور ہر سال حج وغیرہ۔ پس جب ہم نے انہیں اس حال پر دیکھا، تو ہم نے دین میں قیاس سے منع کر دیا۔ کیونکہ نبی صلی اللہ علیہ وسلم نے اس کا حکم نہیں دیا، اور نہ ہی ذات حق نے اس کا حکم دیا۔ پس ہم پر اسے ترک کرنا متعین ہو گیا، کیونکہ یہ ان چیزوں میں سے ہے جسے آپ صلی اللہ علیہ وسلم ناپسند کرتے تھے۔ اور اصل کا حکم یہ ہے کہ کوئی تکلیف نہیں ہے، اور اللہ نے ہمارے لیے **\"جو کچھ زمین میں ہے سب پیدا کیا\"** (ما في الْأَرْضِ جَمِيعاً)۔ پس جو ہم پر پابندی کا دعویٰ کرے، تو اس پر کتاب، سنت، یا اجماع سے دلیل لانا ضروری ہے۔ اور جہاں تک قیاس کا تعلق ہے، تو میں اس کا قائل نہیں ہوں اور نہ ہی اس میں مکمل طور پر کسی کی تقلید کرتا ہوں۔\n\n### [نبی صلی اللہ علیہ وسلم کے افعال وجوب پر نہیں ہیں، سوائے ان افعال کے جن کا انہوں نے حکم دیا]\n\nاور جہاں تک نبی صلی اللہ علیہ وسلم کے افعال کا تعلق ہے، تو وہ وجوب پر نہیں ہیں، کیونکہ اس میں انتہائی تنگی ہے۔ سوائے اس فعل کے جس سے انہوں نے کسی ایسے امر کو واضح کیا ہو جس کا ہمیں مکلف بنایا گیا ہے، تو وہ فعل واجب ہے، جیسے:\n\nآپ کا فرمان: **\"نماز اس طرح پڑھو جس طرح تم نے مجھے نماز پڑھتے دیکھا ہے\"** (صلوا كما رأيتمونى أصلي)\n\nاور **\"مجھ سے اپنے مناسک حج لے لو\"** (وخذوا عني مناسككم)\n\nاور حج کے افعال۔ اور اگر آپ بعض افعال میں اس کا اظہار نہ کرتے، تو وہ فعل ہم پر لازم نہ ہوتا۔ کیونکہ وہ ایک بشر ہیں جو بشر کی طرح حرکت کرتے ہیں، اور بشر کی طرح راضی ہوتے ہیں، اور بشر کی طرح غصہ ہوتے ہیں۔ لہٰذا ان کے افعال میں ان کی پیروی ہم پر لازم نہیں ہے، مگر یہ کہ وہ اس کا حکم دیں۔ اور ان پر یہ متعین تھا کہ وہ کوئی فعل خفیہ طور پر نہ کریں کہ کوئی اسے نہ دیکھے، جیسا کہ ان پر یہ متعین تھا کہ جس چیز کی تبلیغ کا انہیں حکم دیا گیا ہے، وہ اسے اکیلے نہ بولیں کہ کوئی نہ سنے، یہاں تک کہ وہ اسے اس شخص تک پہنچا دیں جس نے اسے نہیں سنا۔\n\n### [ہم سے پہلے کی شریعت ہم پر لازم نہیں، سوائے اس کے جسے ہماری شریعت نے برقرار رکھا]\n\nاور جہاں تک ہم سے پہلے کی شریعت کا تعلق ہے، تو ہم پر اس کی پیروی لازم نہیں ہے، سوائے اس کے جسے ہماری شریعت نے برقرار رکھا ہو۔ باوجود اس کے کہ وہ شریعت ان لوگوں کے لیے حق تھی جنہیں اس کا خطاب کیا گیا تھا۔ ہم اس میں باطل کا قول نہیں کرتے، بلکہ ہم اللہ، اس کے رسول، اور جو کچھ اس کی طرف نازل کیا گیا، اور جو کچھ اس سے پہلے کتاب اور نازل شدہ شریعت میں سے نازل کیا گیا، اس پر ایمان رکھتے ہیں۔\n\n### [اللہ کے دین میں تقلید جائز نہیں]\n\nاور ہمارے نزدیک اللہ کے دین میں تقلید جائز نہیں ہے، نہ زندہ کی تقلید اور نہ مردہ کی۔ اور سائل پر متعین ہے کہ جب وہ عالم سے سوال کرے تو کہے: \"میں اس مسئلے میں اللہ کا حکم یا اس کے رسول کا حکم چاہتا ہوں\"۔ پس اگر مسئول (جس سے سوال کیا گیا) اسے کہے کہ یہ اس مسئلے میں اللہ کا حکم ہے یا اس کے رسول کا حکم ہے، تو اس پر اسے لینا متعین ہے۔ کیونکہ یہاں مسئول اللہ اور اس کے رسول کے حکم کا ناقل ہے جس کے لینے کا ہمیں حکم دیا گیا ہے۔ لیکن اگر وہ کہے کہ یہ میری رائے ہے، یا یہ وہ حکم ہے جو میں نے دیکھا ہے، یا میرے پاس اس مسئلے میں کوئی منطوق حکم نہیں ہے، لیکن قیاس یہ بتاتا ہے کہ اس میں حکم فلاں مسئلے کے حکم جیسا ہوگا جس کا حکم منطوق ہے، تو سائل کے لیے اس کا قول لینا جائز نہیں ہے، اور وہ اہل ذکر کی تلاش کرے اور ان سے اسی صفت پر سوال کرے جو ہم نے بیان کی۔\n\n### [اہل ذکر سے سوال کرنا متعین ہے جو اہل قرآن اور اہل حدیث ہیں]\n\nاور ہر مسلمان پر متعین ہے کہ وہ صرف اہل ذکر سے سوال کرے، اور وہ اہل قرآن ہیں، اللہ تعالیٰ نے فرمایا: **\"بے شک ہم نے ہی ذکر (قرآن) نازل کیا\"** (إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ)، اور اہل حدیث ہیں۔ پس اگر سائل کو معلوم ہو کہ یہ مسئول صاحب رائے اور قیاس ہے، تو وہ اسے چھوڑ دے اور صاحب حدیث سے سوال کرے۔ اور اگر مسئول صاحب رائے، قیاس اور حدیث ہو، تو وہ اس سے سوال کرے۔ جب وہ اسے فتویٰ دے، تو اس پر متعین ہے کہ وہ اس سے کہے کہ یہ حکم رائے یا قیاس سے ہے یا حدیث سے؟ پس اگر وہ کہے کہ رائے یا قیاس سے ہے، تو وہ اسے چھوڑ دے، اور اگر وہ کہے کہ خبر سے ہے، تو وہ اسے لے لے۔\n\n### [خطا، نسیان، اور خاموشی کا حکم]\n\nاور خطا (غلطی) اور نسیان (بھول) کا کوئی حکم نہیں ہے، سوائے اس کے جہاں قرآن یا سنت میں آیا ہو کہ ان کا کوئی حکم ہے، تو اس پر عمل کیا جائے گا، جیسے بھولنے والے کی نماز اور قتل خطا۔ اور ہر وہ چیز جس کے بارے میں خاموشی اختیار کی گئی ہو، تو اس میں کوئی حکم نہیں ہے سوائے اباحت اصلیہ (بنیادی جواز) کے۔\n\n### [شرعی خطاب اسماء اور احوال پر متوجہ ہے نہ کہ اعیان (ذوات) پر]\n\nاور شرعی خطاب اسماء اور احوال پر متوجہ ہے نہ کہ اعیان (ذوات) پر۔ پس فرض کا حکم صرف اس شخص پر ہوگا جس کی حالت فرض کو قبول کرنے والی ہو، خواہ وہ عمل میں امر ہو یا نہی میں ترک۔ پس جو شخص ان چیزوں میں سے کسی سے عاجز ہو جائے جس کا اللہ نے اسے مکلف بنایا ہے، بلکہ وہ اس کا مخاطب ہی نہیں ہے، کیونکہ اللہ نے **\"کسی جان کو اس کی طاقت سے زیادہ تکلیف نہیں دی\"** (ما كَلَّفَ نَفْساً إِلَّا وُسْعَها) اور **\"اور نہ اس کے علاوہ جو اسے عطا کیا ہے\"** (إِلَّا ما آتاها)۔ **\"اللہ تنگی کے بعد آسانی پیدا کر دے گا\"** (سَيَجْعَلُ الله بَعْدَ عُسْرٍ يُسْراً)۔\n\n### [وقت کے ساتھ مقید عمل کو اس کے وقت کے علاوہ ادا کرنا جائز نہیں]\n\nاور ہر وہ عمل جو وقت کے ساتھ مقید ہو، خواہ وہ وسیع ہو یا تنگ، تو اسے اس کے وقت کے علاوہ ادا کرنا جائز نہیں ہے، نہ اس سے پہلے اور نہ اس کے بعد۔ کیونکہ یہ اس میں مشروع اللہ کی حد ہے، لہٰذا اس سے تجاوز نہیں کیا جائے گا۔\n\n### [اصول اور فروع میں اجتہاد کا حکم]\n\nاور اصول اور فروع میں اجتہاد کا حکم ایک ہی ہے۔ اور فروع میں حق وہی ہے جسے شارع نے مقرر کیا ہے۔ اور اس نے مجتہدین کے حکم کو مقرر کیا ہے، اور وہ صرف حق کو ہی مقرر کرتا ہے، پس سب حق ہے۔ اور جہاں تک اس مجتہد پر خطا کی نسبت کا تعلق ہے جسے ایک اجر ملتا ہے، تو وہ یہ ہے کہ وہ اس مسئلے میں اللہ یا اس کے رسول کے حکم پر مطلع نہیں ہو سکا۔ اور اللہ نے اسے اس چیز کا مکلف بنایا جو اس کے اجتہاد تک پہنچی۔ اگر وہ اللہ کے نزدیک اس کے لحاظ سے حق نہ ہوتا، تو وہ اسے اس کا مکلف نہ بناتا، کیونکہ اللہ باطل کو برقرار نہیں رکھتا۔ پس اگر اس کے بعد اسے اس مسئلے میں اللہ تعالیٰ یا اس کے رسول کا کوئی ایسا حکم پہنچے جو اس کی دلیل کے خلاف ہو، اور اسے معلوم ہو کہ وہ حکم اس کی دلیل کے حکم سے مؤخر ہے، تو اس پر واجب ہے کہ وہ اس پہلے حکم سے رجوع کرے، اور اس پر باقی رہنا اس کے لیے حلال نہیں ہے۔ اسی لیے مالک بن انس کے علم، دین اور ورع میں سے یہ تھا کہ جب ان سے دین کے کسی مسئلے کے بارے میں سوال کیا جاتا تو وہ کہتے: \"کیا یہ نازل ہوا ہے؟\" اگر انہیں کہا جاتا: \"ہاں\"، تو وہ فتویٰ دیتے، اور اگر کہا جاتا: \"نازل نہیں ہوا\"، تو وہ فتویٰ نہیں دیتے۔ اور اس کی وجہ وہی ہے جو ہم نے ذکر کی، کیونکہ اس متعین مسئلے میں صحیح حکم پانے والا ایک ہے جو متعین نہیں ہے، اور غلطی کرنے والا ایک ہے جو متعین نہیں ہے۔ اسی لیے علماء نے کہا: \"ہر مجتہد مصیب (صحیح پانے والا) ہے\"۔ یا تو وہ اس میں الٰہی حکم کو متعین طور پر پانے والا ہے، یا وہ اس مقرر کردہ حکم کو پانے والا ہے جسے اللہ نے اس کے لیے ثابت کیا ہے جب وہ اس متعین حکم پر مطلع نہ ہو سکا اور اس سے غلطی ہوئی۔ اور یہ مقدار اس کتاب میں احکام شریعت کے اصولوں کے لیے کافی ہے، کیونکہ یہ استقصاء (مکمل احاطہ) کی متحمل نہیں ہے۔\n\nاور جہاں تک احکام شریعت کے متفقہ اور مختلف فیہ اصولوں کے اسرار کا تعلق ہے:\n\n### [کتاب کو اصل کے طور پر لینے کا راز]\n\nکتاب کا راز وہ ہے جو اللہ کی طرف سے بندے کے لیے بغیر واسطوں کے ہوتا ہے، جیسا کہ اللہ نے فرمایا: **\"ان کے دلوں میں ایمان لکھ دیا\"** (كَتَبَ في قُلُوبِهِمُ الْإِيمانَ)۔ پس وہ اللہ کی کتاب ہیں۔ اور یہ شارع کا قول ہے: \"اس چیز کو چھوڑ دو جو تمہیں شک میں ڈالے، اور اس چیز کو اختیار کرو جو تمہیں شک میں نہ ڈالے\"۔\n\nاور ان کا قول: \"اپنے دل سے فتویٰ لو، اگرچہ مفتی تمہیں فتویٰ دے دیں\"۔\n\nاور کتابت (لکھنا) الٰہی معانی کو اس کے جلال کے لائق طریقے سے ضم کرنا ہے، یعنی اللہ کے اسماء حسنیٰ کی نسبت ان معانی کی طرف کرنا جو ہمارے لیے ان اسماء کے اخلاق سے متصف ہونے سے ہیں، یعنی ان کے معانی سے، یا وہ ہمارے لیے اخلاق ہوں نہ کہ تخلق (بناوٹ)، اور وہ ان کی نسبت ہماری طرف اس طرح کرنا ہے جو ہمارے لائق ہو۔ پس وہ الرؤوف الرحیم (نہایت مہربان، رحم کرنے والا) ہے، اور اس نے اپنے رسول صلی اللہ علیہ وسلم کے بارے میں فرمایا: **\"مومنین پر نہایت مہربان، رحم کرنے والا ہے\"** (بِالْمُؤْمِنِينَ رَؤُفٌ رَحِيمٌ)۔ اور یہ تعریف ہے۔ اور اس نے اپنا نام العزیز الکریم (غالب، سخی) رکھا، اور اس نے اپنے بعض بندوں کے بارے میں فرمایا: **\"چکھ لے، بے شک تو ہی غالب، سخی ہے\"** (ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ)۔ اور یہ مذمت ہے۔ اور یہ سب اللہ کے اسماء اور مخلوق کے اسماء ہیں، اور ان کے مدلولات ان کے آثار کے ذریعے معقول المعنی ہیں جس پر ان کا نام رکھا گیا ہے، اگرچہ ان کی نسبتیں مختلف ہیں۔ پس اللہ کی طرف ان کی نسبت اس کی نسبت سے مشابہت نہیں رکھتی جو بندے کی طرف ہے، کیونکہ **\"اس کی مثال کوئی چیز نہیں\"** (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)۔ اگرچہ کریم کا اثر عطا کرنا ہے، اور عطا اللہ کی طرف سے اور بندے کی طرف سے انعام کے طور پر پائی گئی ہے۔ پس اگر معنی ایک پہلو سے معنی کے ساتھ ضم ہو گیا، تو وہ دوسرے پہلو سے جدا ہو گئے، کیونکہ موصوف (جس کی صفت بیان کی گئی) اور مسمی (جس کا نام رکھا گیا) دوسرے موصوف اور مسمی سے مشابہت نہیں رکھتا۔ پس جس پہلو سے اشتراک واقع ہوتا ہے، اور وہ اثر ہے، اسی پہلو سے کتابت ہوتی ہے، کیونکہ کتابت ضم کرنا ہے۔ اور حروف کو ایک دوسرے کے ساتھ ضم کرنے سے اسے کتابت کہا گیا، اور کتیبہ (فوج کا دستہ) گھوڑوں کو ان کے سواروں کے ساتھ ایک دوسرے کے ساتھ ضم کرنے کو کہتے ہیں۔ اگر وہ متفرق اور اکیلے آتے تو انہیں کتیبہ نہ کہا جاتا۔ پس وہ المؤمن (ایمان دینے والا) ہے، اور اس نے اپنے بندے کے دل میں ایمان لکھ دیا، پس اس کتابت نے اس کے لیے ایک حکم واجب کر دیا جس سے اسے مومن کہا گیا۔ اور اسم مسمی کے علاوہ نہیں ہے۔ پس وہ ممکن کی عین میں ظاہر ہے، اور ممکن اس کے لیے مظہر ہے۔ اور ہر وہ ظاہر جو مظہر میں ظاہر ہو، تو ظاہر مظہر کے ساتھ ضم ہو گیا، اور مظہر ظاہر کے ساتھ ضم ہو گیا۔ اسی لیے اس کے لیے اس میں ظاہر ہونے والا مظہر ہونا صحیح ہوا۔ پس یہ کتاب کو حکم کے ثبوت کی دلیل کے طور پر لینے کے اصل کا راز ہے۔\n\n### [حکم کے اثبات میں سنت کا راز]\n\nاور جہاں تک حکم کے اثبات میں سنت کا راز ہے، تو چونکہ رسول علیہ السلام خواہش سے کلام نہیں کرتے، اور ان کا حکم اللہ کا حکم ہے، اور وہ اللہ کی طرف سے ناقل اور اس کی طرف سے مبلغ ہیں جو اللہ نے انہیں دکھایا، اور اللہ صراط مستقیم پر ہے۔ اور سنت طریقہ ہے، اور راستہ اپنے لیے نہیں چاہا جاتا، بلکہ اپنی منزل کے لیے چاہا جاتا ہے۔ پس سنت **\"اللہ کا راستہ ہے جس کے لیے آسمانوں اور زمین میں جو کچھ ہے سب ہے، خبردار! تمام معاملات اللہ ہی کی طرف لوٹتے ہیں\"** (صِراطِ الله الَّذِي لَهُ ما في السَّماواتِ وما في الْأَرْضِ أَلا إِلَى الله تَصِيرُ الْأُمُورُ)۔ کیونکہ وہ اس کے صراط پر ہے، اور وہ اس کے صراط کی غایت ہے۔ پس اس پر چلنے والے کے لیے اس تک پہنچنا ضروری ہے۔ پس صراط واسطہ ہے۔ اور مظہر کی تیاری کے واسطے سے، جو وہ اپنے نفس میں ہے، ظاہر پر اس نام کے ساتھ حکم لگایا گیا جس سے اسے پکارا گیا، پس اس نے اسے وہ نام دیا، اور وہ حکم صحیح ہے۔ پس یہ صراط مستقیم ہے۔ جب ہم کسی پیش آنے والے معاملے میں ذات حق سے سوال کرتے ہیں، تو اللہ میں ہمارے سوال کا اثر اجابت (قبولیت) ہوتا ہے، پس اسے مجیب (قبول کرنے والا) کہا گیا۔ اگر ہمارا سوال نہ ہوتا تو یہ حکم ثابت نہ ہوتا اور نہ ہی اس پر یہ نام اطلاق ہوتا۔ اور ہم اس میں اس کے لیے طریقہ ہیں۔ اللہ تعالیٰ نے فرمایا: **\"میں دعا کرنے والے کی دعا قبول کرتا ہوں جب وہ مجھے پکارتا ہے\"** (أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ)۔ پس اس نے اسے جواب نہیں دیا جب تک اس نے اسے پکارا نہیں۔ پس یہ سنت سے استدلال کا راز ہے۔\n\n### [حکم کے اثبات پر اجماع کو سند کے طور پر لینے کا راز]\n\nاور جہاں تک اجماع کا تعلق ہے، تو یہ وہ ہے جس پر رب اور مربوب (پرورش پانے والا) نے اجماع کیا ہے کہ اللہ خالق ہے اور بندہ مخلوق ہے۔ اور اسی طرح ہر اضافی نسبت میں، جہاں بھی وہ پائی جائے، اللہ اور اس کے بندوں کے درمیان کوئی اختلاف نہیں ہے۔ اور اسی طرح معلومات میں بھی، اس لحاظ سے کہ وہ معلومات ہیں۔\n\n### [قیاس کو ثابت کرنے والوں کے نزدیک استدلال میں قیاس کے راز کا حکم]\n\nاور جہاں تک قیاس کا تعلق ہے، اسے ثابت کرنے والوں کے نزدیک، تو یہ رب کا بندے کی صفت میں ظاہر ہونا ہے، اور بندے کا رب کی صفت میں ظاہر ہونا ہے، جو رب کے حکم سے ہو۔ اگر وہ رب کے حکم سے نہ ہو، تو اسے حکم پر دلیل کے طور پر نہیں لیا جائے گا۔ یا کسی حمید (قابل تعریف) اور کریم (سخی) خلق سے ہو، تو اسے بھی دلیل کے طور پر لیا جائے گا۔ اور جہاں تک رب کا مربوب کی صفت میں ظاہر ہونا ہے، تو اس میں واجب امر کی شرط نہیں ہے، لیکن یہ دعا اور طلب سے ہو سکتا ہے، اور اس کی صفت امر کی صفت ہے، اور معنی مختلف ہے۔ اگرچہ یہ بھی سنا جاتا ہے اور اس کی تعمیل کی جاتی ہے، اور دوسرا بھی ایسا ہی ہے، لیکن ان دونوں کے درمیان فرق ہے۔ پس یہ استدلال میں قیاس کے راز کا حکم ہے، اور وہ غائب کو حاضر پر قیاس کرنا ہے، ایک معقول علت کی بنا پر جو حاضر اور غائب کو جمع کرتی ہے، اور اسے ہر ایک منسوب کی طرف اس کے جلال کے لائق نسبت دی جاتی ہے۔ اور ہم نے \"اس کے جلال کے لائق\" اس لیے کہا کہ جلیل (بزرگ) اضداد میں سے ہے، جو عظیم اور حقیر دونوں پر اطلاق ہوتا ہے۔ اور احکام شریعت کے اصولوں کے اسرار یہاں ختم ہوئے۔ چورانوےواں حصہ ختم ہوا۔\n\n(شروع اللہ کے نام سے جو نہایت مہربان، رحم کرنے والا ہے)",
    "fa": "(باب هشتاد و هشتم: در معرفت اسرار اصول احکام شریعت)\n\nشریعت آن است که حق (الإله) برای تخلق (تخلق) وضع کرده است، *** پس اوست دانای حق بندگان و حق خویش.\nو چون بنده‌ای آید تا شریعتی وضع کند، *** حق (الإله) به حق آن شریعت در حق خویش قیام می‌کند.\nو این دو شریعت از یک اصل واحدند، *** مگر آنکه بگوید: «خداوند به خلقش چنین گفت.»\nپس اگر چنین بگوید، آن دام و فریب است، *** که همزاد (القرین) با ستاره‌اش از افق خود طلوع کرده است.\nتا آنچه را که افکارشان تقلید کرده، تصدیق کنند، *** پس او دروغگوست، هرچند با صدق نزد تو آید.\nپس احکام اصل کتاب آن را در نظر بگیر، *** زیرا چه بسا که آن ملعون از آب دهان خود خفه شود.\n\n### [اصول شریعت مورد اتفاق و اختلاف]\n\nبدان که اصول احکام شریعت مورد اتفاق سه چیز است: کتاب، سنت متواتر و اجماع. و علما در قیاس اختلاف کرده‌اند؛ برخی قائلند که قیاس دلیلی است و از اصول احکام شمرده می‌شود، و برخی قائل به منع آن هستند، و من نیز به همین قول معتقدم.\n\n### [تقوا عملی مشروع است، پس حکم آن باید به دلیلی یا اصلی شرعی نسبت داده شود]\n\nخداوند متعال فرمود: **وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ** (و از خدا پروا کنید و خدا به شما می‌آموزد) و فرمود: **إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا** (اگر از خدا پروا کنید، برای شما فرقان (قدرت تشخیص حق از باطل) قرار می‌دهد) و فرمود: **اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِنْ رَحْمَتِهِ وَيَجْعَلْ لَكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ** (از خدا پروا کنید و به رسول او ایمان آورید تا دو بهره از رحمتش به شما عطا کند و برای شما نوری قرار دهد که با آن راه روید و شما را بیامرزد)؛ مانند قولش در مورد بنده خود خضر: **آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا** (از جانب خود به او رحمتی دادیم و از نزد خود به او دانشی آموختیم). پس اعطای علم به بنده خود را از رحمت خویش قرار داد. و تقوا (التقوى) عملی است که برای ما مشروع شده است، پس ناگزیر باید حکم تقوا در هر مسئله‌ای که در آن پرهیزگاری از خداوند بر ما لازم است، به دلیلی از این ادله یا به همه آنها نسبت داده شود.\n\n### [اصول فاعله و منفعله در شریعت و حقایق الهی و کونی]\n\nجنید (الجنید) گفت: «علم ما مقید به کتاب و سنت است.» و این دو، اصول فاعله (فاعل) هستند. و اجماع و قیاس تنها به واسطه کتاب و سنت ثابت می‌شوند و دلالتشان صحیح می‌گردد، پس این دو، اصول منفعله (منفعل) در حکم هستند. از این چهار حقیقت، احکام مشروعی پدید آمد که با عمل به آنها سعادت حاصل می‌شود. زیرا موجودات از چهار حقیقت الهی پدیدار شدند: حیات، علم، اراده و قدرت. و اجسام از چهار حقیقت پدیدار شدند: حرارت، برودت، یبوست و رطوبت. و موالید (موجودات زنده) از چهار رکن پدیدار شدند: آتش، هوا، آب و خاک. و جسم انسان و حیوان از چهار خلط پدیدار شد: صفرا، سودا، خون و بلغم. پس حرارت و برودت فاعل هستند و رطوبت و یبوست منفعل، این را بدان.\n\n### [معنای باطنی (البعید) قول جنید: علم ما مقید به کتاب و سنت است]\n\nاز آنجا که کسی که به شرایع نازل شده ایمان ندارد، در ریاضت و مجاهده و رهایی نفس از حکم طبیعت با ما شریک است، و اتصال به ارواح پاک و تزکیه شده بر او ظاهر می‌شود، و حکم آن اتصال بر او آشکار می‌گردد، همانند آنچه از مؤمنان عامل به شرایع نازل شده بر ما ظاهر می‌شود؛ به دلیل تشبیه و اشتراکی که در آنچه ذکر کردیم نزد عامه مردم رخ داده است، و ما به علومی سخن گفتیم که کشف (الکشف) ریاضت و امداد ارواح علوی به ما می‌دهد، و تمام آنچه در عالم است در این نفوس فاضله نقش بسته است، پس آنها به غیب‌ها سخن گفتند. جنید گفت: «علم ما، هرچند که در آن اشتراکی میان ما و عقلا وجود دارد، اما اصل ریاضت و مجاهده و اعمال ما که این علوم و آثار ظاهره را به ما بخشیده، تنها از عمل ما بر اساس کتاب و سنت بوده است.» پس این است معنای قول او: «علم ما مقید به کتاب و سنت است.» و در روز قیامت، ما به واسطه همین امر از آنان متمایز می‌شویم، زیرا آنان در الهیات ذوقی ندارند. چرا که فیض آنان روحانی است و فیض ما روحانی و الهی است، به این دلیل که ما بر طریقه‌ای الهی سلوک کردیم که شریعت نامیده می‌شود، و این طریقه ما را به شارع (واضع شریعت) که خداوند متعال است، رسانده است، زیرا او آن را راهی به سوی خود قرار داده است، پس این را بدان.\n\n### [اجماع ناگزیر باید مستند به نص باشد، هرچند به آن نطق نشده باشد]\n\nاز آنجا که شریعت و حکم خداوند در حرکات انسان مکلف جز از قرآن گرفته نمی‌شود، همچنین جز با متکلم به آن (خداوند متعال) یافت نمی‌شود، که به شیء گفت: **كُنْ فَكَانَ** (باش، پس شد). پس قرآن قوی‌ترین دلیلی است که به آن استناد می‌شود، یا آنچه از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) صحیح است، که دلیل بر صدق او قائم شده است که او از جانب خداوند، تمام آنچه را که برای بندگانش تشریع کرده، خبر می‌دهد. و این خبر ممکن است یا به اجماع صحابه باشد که همان اجماع است، یا از برخی از آنان به نقل عادل از عادل باشد که همان خبر واحد است. و به هر طریقی که به ما رسیده باشد، ما بدون هیچ اختلافی میان علمای اسلام، موظف به عمل به آن هستیم. و به همین دلیل است که اهل اصول در مورد اجماع (الإجماع) می‌گویند: «ناگزیر باید مستند به نص باشد، هرچند به آن نطق نشده باشد.»\n\n### [در اتخاذ قیاس به عنوان دلیل شرعی و اصل دینی اختلاف است]\n\nو اما قیاس (القياس)، در اتخاذ آن به عنوان دلیل و اصل اختلاف است، زیرا در معقول وجهی دارد. در مواضعی، قوت اخذ به آن بر ترک آن آشکار می‌شود و در مواضعی چنین نیست. با این حال، قیاس دلیلی قطعی نیست، پس شبیه خبر آحاد است. از آنجا که اتفاق بر اخذ به خبر واحد وجود دارد، با وجود اینکه مفید علم نیست، و اصلی از اصول اثبات احکام است، پس قیاس نیز باید چنین باشد، اگر جلی (آشکار) باشد و در آن تردیدی نباشد. و نزد ما، اگرچه ما در حق خود به آن قائل نیستیم، اما حکم به آن را برای کسی که اجتهادش او را به اثبات آن رسانده، جایز می‌دانم، چه در آن خطا کرده باشد و چه صواب. زیرا شارع حکم مجتهد را حتی اگر خطا کند، ثابت دانسته و او مأجور است. اگر مجتهد در اثبات قیاس به دلیلی از کتاب یا سنت یا اجماع یا از هر اصلی از این اصول استناد نمی‌کرد، برای او حلال نبود که به آن حکم کند. بلکه چه بسا در حکم نظر نزد شخص منصف، قیاس جلی در دلالت بر حکم، قوی‌تر از خبر واحد صحیح باشد. زیرا ما خبر واحد را تنها به حسن ظن به راویانش می‌پذیریم و آن را از نظر علمی بر خداوند تزکیه نمی‌کنیم، چرا که شریعت ما را از اینکه کسی را بر خداوند تزکیه کنیم، منع کرده است. و باید بگوییم: «گمان می‌کنم چنین است» و «حدس می‌زنم چنان است.»\n\n### [قیاس جلی و نظر صحیح عقلی]\n\nو قیاس جلی، نظر صحیح عقلی با ما در آن شریک است. و ما با نظر عقلی که شرعاً به آن امر شده‌ایم، در قول خداوند: **أَوَلَمْ يَنْظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ** (آیا در ملکوت آسمان‌ها و زمین نظر نکردند؟) و **أَوَلَمْ يَتَفَكَّرُوا مَا بِصَاحِبِهِمْ مِنْ جِنَّةٍ** (آیا نیندیشیدند که در همنشینشان (پیامبر) هیچ جنونی نیست؟) اثبات‌هایی انجام دادیم. و در قرآن از این قبیل بسیار است. پس شارع حکم نظر عقلی را در اثبات وجود خداوند در وهله اول معتبر دانسته است، که این رکن اعظم است. سپس آن را در توحید الوهیت او معتبر دانسته است، پس ما را مکلف کرده که با عقول خود در اینکه **لَا إِلَهَ إِلَّا اللَّهُ** (هیچ معبودی جز خدا نیست) نظر کنیم. سپس با دلیل عقلی در آنچه از احکام بر این معبود واجب است، نظر کردیم. سپس با نظر عقلی که به آن امر شده‌ایم، در تصدیق آنچه این رسول از جانب او آورده، نظر کردیم، زیرا او بشری مانند ما بود. پس با عقول در آیات او و آنچه را که به عنوان دلیل بر صدق خود نصب کرده بود، نظر کردیم و آن را اثبات نمودیم. و اینها همه اصولی هستند که اگر یکی از ارکان آنها فرو ریزد، شرایع باطل می‌شوند، و مستند ثبوت آنها نظر عقلی است، و شرع آن را معتبر دانسته و بندگانش را به آن امر کرده است. و قیاس، نظر عقلی است. آیا حق (الحق) آن را در این امور مهم و ارکان عظیم مباح می‌داند، اما در یک مسئله فرعی که ذکری از آن در کتاب و سنت و اجماع نیافته‌ایم، آن را بر ما ممنوع می‌سازد؟ و ما قطع داریم که در آن ناگزیر باید حکم الهی مشروعی وجود داشته باشد. و چون راه‌ها مسدود شده، به اصل پناه برده‌ایم که همان نظر عقلی است. و قواعد اثبات این اصل را کتاب و سنت قرار دادیم. پس در آن نظر کردیم و قیاس را به عنوان اصلی از اصول ادله احکام، با همین مقدار از نظر عقلی اثبات نمودیم، زیرا نظر عقلی در اصول حکم داشت. پس ما مسکوت عنه (آنچه درباره‌اش نص نیست) را بر منطوق به (آنچه درباره‌اش نص هست) قیاس کردیم، به دلیل علتی معقول که بعید نیست مقصود شارع باشد و در مواضع ضرورت، میان آن دو جمع کند، هنگامی که نص معینی در آن نیابیم. پس این مذهب ما در این مسئله است.\n\n### [خطا دانستن کسانی که قیاس را اثبات می‌کنند و مجتهدین در فروع، سوء ادب نسبت به شارع است]\n\nهر کس که نزد من، اثبات‌کننده قیاس را به عنوان یک اصل، یا مجتهدی را در یک فرع یا اصل، خطا بداند، در واقع نسبت به شارع سوء ادب کرده است، زیرا شارع حکم او را ثابت دانسته است، و شارع باطل را ثابت نمی‌کند، پس ناگزیر باید حق باشد. و نسبت خطا به آن مجتهد، به این معناست که او دلیل مخالف را که نزد مجتهد صحیح نبوده، خطا دانسته است. و خطاکننده در شریعت، یک نفر است که معین نیست. پس ناگزیر باید به قول او عمل کرد، و از جمله اقوال او، اثبات قیاس است. پس شارع امر به اخذ به آن کرده است، حتی اگر در نفس‌الامر خطا باشد، زیرا او را به آن متعبد ساخته است. چرا که شارع می‌تواند بندگانش را به هر چه بخواهد متعبد سازد. و این روشی است که ما در علم خود به آن منفرد شده‌ایم، با وجود اینکه ما از نظر خودمان قائل به قیاس نیستیم، اما از نظر کسی که اجتهادش او را به آن رسانده، قائل به آن هستیم، زیرا شارع آن را ثابت کرده است. اگر مخالف انصاف می‌داشت، در نزاع در این مسئله سکوت می‌کرد، زیرا این مسئله روشن‌تر از آن است که در آن نزاع شود. **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند).\n\n### [ترتیب ابواب فتوحات نه از روی اختیار و نه از روی نظر فکری، بلکه به الهام است]\n\nسپس در این باب، آنچه را که مربوط به اصول احکام نزد علمای اسلام است، بیان می‌کنیم، همان‌طور که در عبادات آموختیم. و شایسته‌تر آن بود که این باب در ابتدای عبادات، پیش از شروع در آنها، آورده می‌شد، اما این‌گونه واقع شد. زیرا ما این ترتیب را از روی اختیار قصد نکردیم، و اگر از روی نظر فکری بود، جایگاه آن در ترتیب حکمت این نبود. پس شبیه آیه **حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى** (بر نمازها و نماز میانه محافظت کنید) است که میان آیات طلاق و نکاح و عده وفات قرار گرفته است، که پیش و پس از آن قرار دارند. و ظاهر امر نشان می‌دهد که آن جایگاه آن نیست. اما خداوند آن را جایگاه آن قرار داده است، به دلیل علمش به آنچه در امور شایسته است. زیرا حکیم کسی است که آنچه را شایسته است، برای آنچه شایسته است، به نحوی که شایسته است، انجام می‌دهد. و اگرچه ما صورت آنچه شایسته است را در آن نمی‌دانیم، خداوند متعال این ترتیب را به دست ما مرتب کرده است، پس ما آن را رها کردیم و رأی و عقل خود را در آن دخالت ندادیم. زیرا خداوند با الهام (الإلهام) تمام آنچه را که عالم در هستی (الوجود) می‌نگارد، بر قلب‌ها املا می‌کند، چرا که عالم، کتابی مسطور و الهی است.\n\n### [تعارض دو آیه یا دو خبر]\n\nو هرگاه دو آیه یا دو خبر صحیح با هم تعارض کنند و امکان جمع میان آنها و به کار بستن هر دو وجود داشته باشد، از به کار بستن آنها روی نمی‌گردانیم. و اگر امکان به کار بستن هر دو با هم نباشد، به طوری که در یکی از آنها استثنایی باشد، باید به آن که استثنا دارد عمل شود. و اگر در یکی از آنها زیاده‌ای باشد، آن زیاده گرفته شده و به آن عمل می‌شود. و اگر هیچ یک از اینها یافت نشود و از همه جهات تعارض کنند، به تاریخ نگاه می‌شود و به متأخر (جدیدتر) عمل می‌گردد. و اگر تاریخ مجهول باشد و علم به آن دشوار، به آن که نزدیک‌تر به رفع حرج در دین است، نگریسته می‌شود و به آن عمل می‌گردد، زیرا این امر با آیه **مَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ** (در دین برای شما هیچ حرجی قرار نداده است) تأیید می‌شود، و دین خداوند آسان است.\n**وَيُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ** (و خداوند برای شما آسانی می‌خواهد و برای شما دشواری نمی‌خواهد) و **وَمَا أَمَرْتُكُمْ بِهِ فَافْعَلُوا مِنْهُ مَا اسْتَطَعْتُمْ وَمَا نَهَيْتُكُمْ عَنْهُ فَدَعُوهُ** (و آنچه را به آن امر کردم، تا جایی که می‌توانید انجام دهید، و آنچه را از آن نهی کردم، رها کنید).\nاگر در رفع حرج مساوی باشند، ساقط نمی‌شوند و در انتخاب هر یک از دو خبر یا دو آیه مخیر خواهی بود.\n\n### [تعارض آیه و خبر واحد صحیح و مجهول بودن تاریخ]\n\nو هرگاه یک آیه و یک خبر صحیح از اخبار آحاد از همه جهات تعارض کنند و تاریخ مجهول باشد، به آیه عمل می‌شود و خبر رها می‌گردد، زیرا آیه قطعی است و خبر واحد مظنون.\nاگر خبر مانند آیه متواتر باشد و تاریخ مجهول باشد و امکان جمع میان آنها نباشد، حکم، تخییر در انتخاب هر دو است، مگر اینکه یکی از آنها در آن رفع حرج باشد که در این صورت اخذ به آن مقدم است.\n\n### [ترجیح اخذ به حدیث زیاده بر معارض آن]\n\nو هر دو خبر یا دو آیه که تعارض کنند، یا آیه و خبر صحیح، چه متواتر و چه غیر متواتر، و در یکی از آنها حکم زیاده‌ای باشد، آن زیاده پذیرفته شده و به آن عمل می‌شود و اخذ به حدیث زیاده بر معارضش ترجیح دارد.\n\n### [اگر حدیث صحیح باشد و قول صحابی یا امام مذهب با آن معارضه کند، از حدیث عدول نمی‌شود]\n\nو از حدیث جز آنچه صحیح باشد، گرفته نمی‌شود. اگر مکلف مقلد باشد و حدیث ضعیفی که به رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) مسند است به او برسد، و قول امامی از ائمه یا صحابی با آن معارضه کند که دلیل آن قول را نمی‌داند، به حدیث ضعیف عمل می‌کند و آن قول را رها می‌سازد. زیرا نهایت امر این است که اگر حدیث در نفس‌الامر صحیح نباشد، در درجه آن قول قرار می‌گیرد. و از حدیث عدول نمی‌شود. اما اگر حدیث صحیح باشد و قول صحابی یا امامی با آن معارضه کند، هیچ راهی برای عدول از حدیث نیست و قول آن امام و صحابی به خاطر خبر رها می‌شود. و اگر خبر مرسل یا موقوف باشد، به آن اعتماد نمی‌شود، مگر اینکه از تابع (تابعی) دانسته شود که او حدیث را جز از صحابی ارسال نمی‌کند، هرچند آن صحابی را معین نکند. در این صورت به مرسل عمل می‌شود، زیرا در حکم مسند است. و مرسل آن است که تابعی بگوید: «رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود» و صحابی‌ای را که از او روایت کرده، ذکر نکند، و دانسته شود که او صحابه را درک کرده و با آنان مصاحبت داشته و در دینش مورد وثوق است. و اگر دانسته شود که او کسی است که در مصالح، دروغ بستن بر پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) را جایز می‌داند، به حدیث او عمل نمی‌شود، حتی اگر آن را اسناد دهد. و جایز نیست که آیه یا خبر صحیحی به خاطر قول صحابی یا امامی ترک شود. و هر کس چنین کند، **فَقَدْ ضَلَّ ضَلَالًا مُبِينًا** (به گمراهی آشکاری گمراه شده است) و از دین خدا خارج گشته است.\n\n### [اگر خبری از قومی مستور (ناشناخته) وارد شود، به آن عمل می‌شود]\n\nو اگر خبری از قومی مستور (مستورین) وارد شود که در مورد جرح و تعدیل آنها سخنی گفته نشده است، عمل به روایت آنها واجب است. اما اگر یکی از آنها به جرحی که در صدق او تأثیر می‌گذارد، جرح شود، حدیث او ترک می‌شود. و اگر جرح مربوط به نقل او نباشد، عمل به آن واجب است، مگر شراب‌خوار، اگر در حال مستی حدیث بگوید. اما اگر دانسته شود که در حال هوشیاری حدیث گفته و این صفت اوست، قول او پذیرفته می‌شود. و اسلام همان عدالت است و جرح امری عارضی است. و اگر جرح بر اساس آنچه گفتیم ثابت شود، اخذ به حدیث صاحب آن جرح ترک می‌گردد.\n\n### [خبر واحد صحیح و متواتر اگر تعارض کنند]\n\nو تفاوتی میان اخذ به خبر واحد صحیح و متواتر نیست، مگر اینکه تعارض کنند، همان‌طور که گفتیم.\n\n### [خداوند بر ما واجب نکرده است که قول هیچ کس جز رسولش را بپذیریم]\n\nو خداوند بر ما واجب نکرده است که قول هیچ کس جز رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را بپذیریم، با وجود اینکه ما مأمور به تعظیم و محبت آنان هستیم.\n\n### [نسخ، پایان یافتن مدت حکم در علم خداوند است]\n\nو اما نسخ، من به آن به شکلی که آنان می‌گویند، قائل نیستم. زیرا نسخ نزد ما، پایان یافتن مدت حکم در علم خداوند است. و چون مدت آن به پایان رسد، جایز است که حکم دیگری از قرآن یا سنت بیاید. اگر چنین امری نسخ نامیده شود، ما به آن قائل هستیم. و اگر امر چنین باشد، نسخ قرآن با قرآن و با سنت جایز است، زیرا سنت تبیین‌کننده است، چرا که پیامبر (علیه السلام) مأمور است که آنچه را بر مردم نازل شده، برایشان تبیین کند و به آنچه خداوند به او نشان داده، حکم کند، نه به آنچه نفسش به او نشان داده است. زیرا او جز آنچه به او وحی می‌شود، پیروی نمی‌کند، خواه آن وحی قرآن باشد یا غیر قرآن. و نسخ سنت با قرآن و سنت جایز است. و هرگاه نصی از آیه یا خبر وارد شود، جایز نیست که از عمل به آن قرآن یا خبر توقف شود تا دیده شود که آیا معارضی دارد یا خیر، بلکه به آنچه رسیده است، عمل می‌شود. سپس اگر بعداً بر خبر یا آیه ناسخ یا مخصص یا معمم برای حکم متقدم دست یافت، حکم بر اساس آنچه به او رسیده و با شروط آن خواهد بود، و آن این است که به دنبال تاریخ بگردد. زیرا خاص ممکن است بر عام مقدم شود، همان‌طور که عام بر خاص مقدم می‌شود. و اصل این است که حکم برای متأخر (جدیدتر) است.\n\n### [الفاظ کتاب و سنت بر اساس آنچه در زبان عرب است یا آنچه شارع تفسیر کرده، اخذ می‌شود]\n\nو هرگاه آیه یا خبری با لفظی از زبان (عرب) وارد شود، اصل این است که بر اساس آنچه در لغت عرب است، اخذ شود. اما اگر شارع آن را بر غیر مفهوم لغوی اطلاق کرده باشد، مانند اسم صلاة (نماز)، اسم وضوء، اسم حج و اسم زکات، اصلی که شارع آن را تفسیر و مقرر کرده است، اصل قرار می‌گیرد. پس اگر بعد از آن خبری با آن لفظ وارد شود، بر آنچه شارع تفسیر کرده، حمل می‌شود و بر آنچه در لغت است، حمل نمی‌گردد، مگر اینکه از رسول (صَلَّى اللهُ عَليهِ وسَلَّم) در مورد آن لفظ وارد شود که مقصودش همان معنای لغوی است، که در این صورت در آن خبر به طور معین به آن عدول می‌شود.\n\n### [اوامر شریعت حمل بر وجوب و نواهی آن حمل بر حظر (حرام بودن) است]\n\nو اوامر شریعت همگی حمل بر وجوب و نواهی آن حمل بر حظر (حرام بودن) است، مگر اینکه قرینه حالی به امر ملحق شود که آن را از وجوب به ندب (مستحب بودن) یا اباحه خارج سازد. و همچنین نهی، اگر قرینه‌ای به آن ملحق شود که آن را از حظر به کراهت خارج سازد. و اگر امر از قرینه ندب یا اباحه عاری باشد، وجوب متعین است. و همچنین نهی. و چه بسا امر الهی یا نبوی بر نهی وارد شود، تنها برای رفع تحجیر (محدودیت)، نه برای وجوب فعل مأمور به.\n\n### [اجماع، اجماع صحابه پس از رسول است و بس]\n\nو اجماع (الإجماع)، اجماع صحابه پس از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است و بس. و غیر از عصر آنان، اجماعی نیست که به آن حکم شود. و صورت اجماع آن است که دانسته شود مسئله به هر یک از صحابه رسیده است و او در آن به همان حکمی که دیگری گفته، فتوا داده است، تا جایی که هیچ یک از آنان باقی نمانده باشد مگر اینکه آن امر به او رسیده و در آن به آن حکم فتوا داده باشد. اگر از یکی از آنان خلافی در آن نقل شود، اجماع نیست. یا اگر سکوت از او نقل شود، اجماع نیست.\n\n### [اگر در چیزی اختلافی رخ داد، واجب است حکم آن به کتاب و سنت ارجاع داده شود]\n\nو هرگاه در چیزی اختلافی رخ داد، واجب است حکم آن به کتاب و خبر نبوی ارجاع داده شود، زیرا **خَيْرٌ وَأَحْسَنُ تَأْوِيلًا** (بهتر و از نظر تأویل نیکوتر است).\n\n### [جایز نیست که خداوند با رأی مورد پرستش قرار گیرد]\n\nو جایز نیست که خداوند با رأی مورد پرستش قرار گیرد، و رأی همان قولی است که بدون حجت و برهان، نه از کتاب و نه از سنت و نه از اجماع، بیان شود.\n\n### [ما قائل به قیاس نیستیم، اما اثبات‌کننده آن را خطا نمی‌دانیم]\n\nو اگرچه ما قائل به قیاس نیستیم، اما اثبات‌کننده آن را خطا نمی‌دانیم، در صورتی که علت جامعه (علت مشترک) معقول و جلی باشد و گمان غالب بر این باشد که مقصود شارع است. و ما از اخذ به قیاس امتناع کردیم، زیرا قیاس زیاده در حکم است، و ما از شارع فهمیدیم که او تخفیف بر این امت را می‌خواهد. و می‌فرمود: «مرا رها کنید تا زمانی که شما را رها کرده‌ام» و از سؤالات کراهت داشت، از ترس اینکه حکمی بر آنان نازل شود و نتوانند به آن عمل کنند.\nمانند قیام رمضان و حج در هر سال و غیر آن. پس چون او را بر این حال دیدیم، قیاس در دین را منع کردیم. زیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به آن امر نکرده و حق تعالی نیز به آن امر نکرده است. پس ترک آن بر ما متعین شد، زیرا از چیزهایی است که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از آن کراهت داشت. و حکم اصل این است که تکلیفی نیست و خداوند آنچه را در **الْأَرْضِ جَمِيعًا** (زمین، همه) است، برای ما خلق کرده است. پس هر کس ادعای تحجیر (محدودیت) بر ما کند، باید دلیل از کتاب یا سنت یا اجماع بیاورد. و اما قیاس، من به آن قائل نیستم و به طور کلی در آن تقلید نمی‌کنم.\n\n### [افعال پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بر وجوب نیست، مگر آنچه از افعال او که به آن امر کرده باشد]\n\nو اما افعال پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم)، بر وجوب نیست، زیرا در آن نهایت حرج است، مگر فعلی که با آن امری را که ما به آن متعبد شده‌ایم، تبیین کرده باشد. پس آن فعل واجب است، مانند:\nقول او: «نماز بخوانید همان‌گونه که دیدید من نماز می‌خوانم»\nو «مناسک حج خود را از من بگیرید»\nو افعال حج. و اگر نطق او در مورد برخی افعال نبود، آن فعل بر ما لازم نمی‌شد. زیرا او بشری است که حرکت می‌کند همان‌گونه که بشر حرکت می‌کند، و راضی می‌شود همان‌گونه که بشر راضی می‌شود، و خشمگین می‌شود همان‌گونه که بشر خشمگین می‌شود. پس پیروی از او در افعالش بر ما لازم نیست، مگر اینکه به آن امر کند. و بر او متعین بود که فعلی را پنهانی انجام ندهد به طوری که کسی آن را نبیند، همان‌طور که بر او متعین بود که آنچه را مأمور به ابلاغ آن است، به تنهایی سخن نگوید به طوری که کسی آن را نشنود، تا آن را به کسی که نشنیده است، منتقل کند.\n\n### [شریعت پیشینیان ما را ملزم نمی‌کند، مگر آنچه شریعت ما آن را تأیید کرده باشد]\n\nو اما شریعت پیشینیان (شرع من قبلنا)، پیروی از آن ما را ملزم نمی‌کند، مگر آنچه شریعت ما آن را تأیید کرده باشد، با وجود اینکه آن شریعت برای مخاطبانش حق بوده است. ما در مورد آن به باطل سخن نمی‌گوییم، بلکه به خدا و رسولش و آنچه بر او نازل شده و آنچه پیش از او از کتاب و شریعت نازل شده، ایمان داریم.\n\n### [تقلید در دین خدا جایز نیست]\n\nو تقلید در دین خدا نزد ما جایز نیست، نه تقلید زنده و نه تقلید مرده. و بر سائل (پرسشگر) متعین است که وقتی از عالمی سؤال می‌کند، به او بگوید: «حکم خدا یا حکم رسول او را در این مسئله می‌خواهم.» اگر مسئول (پاسخ‌دهنده) به او گفت: «این حکم خدا در این مسئله یا حکم رسول اوست»، اخذ به آن بر او متعین است. زیرا مسئول در اینجا ناقل حکم خدا و حکم رسول اوست که ما مأمور به اخذ آن هستیم. اما اگر گفت: «این رأی من است» یا «این حکمی است که من دیده‌ام» یا «در این مسئله حکم منطوقی ندارم، اما قیاس اقتضا می‌کند که حکم آن مانند حکم فلان مسئله‌ای باشد که حکم آن منطوق است»، برای سائل جایز نیست که قول او را بپذیرد و باید به دنبال اهل ذکر بگردد و از آنان به همان صورتی که گفتیم سؤال کند.\n\n### [متعین است که از اهل ذکر که همان اهل قرآن و حدیث هستند، سؤال شود]\n\nو بر هر مسلمانی متعین است که جز از اهل ذکر سؤال نکند، و اهل ذکر همان اهل قرآن هستند. خداوند متعال می‌فرماید: **إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ** (همانا ما خود ذکر (قرآن) را نازل کردیم) و اهل حدیث. پس اگر سائل بداند که این مسئول صاحب رأی و قیاس است، او را رها کند و از صاحب حدیث سؤال کند. و اگر مسئول صاحب رأی و قیاس و حدیث باشد، از او سؤال کند. و چون به او فتوا داد، بر او متعین است که بگوید: «این حکم، رأی یا قیاس است یا از حدیث؟» اگر گفت: «از رأی یا قیاس»، او را ترک کند. و اگر گفت: «از خبر»، به آن عمل کند.\n\n### [حکم خطا، نسیان و مسکوت عنه]\n\nو برای خطا و نسیان حکمی نیست، مگر در جایی که در قرآن یا سنت آمده باشد که برای آنها حکمی هست، که در این صورت به آن عمل می‌شود، مانند نماز فرد فراموشکار و قتل خطا. و هر مسکوت عنه (آنچه درباره‌اش سکوت شده) حکمی ندارد، جز اباحه اصلی.\n\n### [خطاب شریعت متوجه اسماء و احوال است، نه اعیان]\n\nو خطاب شریعت متوجه اسماء و احوال است، نه اعیان (ذوات). پس حکم فرض تنها بر کسی است که حال او قبول فرض از امر و نهی در عمل یا ترک باشد. پس هر کس از چیزی از آنچه خداوند او را مکلف کرده، عاجز باشد، بلکه به آن مخاطب نیست. زیرا خداوند هیچ **نَفْسًا إِلَّا وُسْعَهَا** (نفسی را جز به اندازه توانش) مکلف نکرده است و **إِلَّا مَا آتَاهَا سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا** (جز آنچه به او داده است. خداوند پس از سختی آسانی قرار خواهد داد).\n\n### [عملی که مقید به وقت است، جز در وقت خود جایز نیست]\n\nو هر عملی که مقید به وقت باشد، چه وقت موسع باشد و چه مضیق، انجام آن جز در وقت خود جایز نیست، نه قبل از آن و نه بعد از آن. زیرا آن حدّ الهی است که در آن مشروع شده است، پس نباید از آن تجاوز کرد.\n\n### [حکم اجتهاد در اصول و فروع]\n\nو حکم اجتهاد در اصول و فروع یکی است. و حق در فروع، آنجاست که شرع آن را مقرر کرده است. و شرع حکم مجتهدین را مقرر کرده است و جز حق را مقرر نمی‌کند، پس همه آن حق است. و اما نسبت خطا به مجتهدی که یک اجر دارد، به این دلیل است که او بر حکم خدا یا حکم رسول او در آن مسئله معین دست نیافته است. و خداوند او را به آنچه اجتهادش به آن رسیده، متعبد ساخته است. اگر آن حکم نزد خداوند حق نبود، او را به آن متعبد نمی‌ساخت، زیرا خداوند باطل را تأیید نمی‌کند. پس اگر بعد از آن، حکم خداوند متعال یا رسول او در آن مسئله به گونه‌ای که مخالف دلیل اوست، به او برسد و بداند که آن حکم متأخر از حکم دلیل اوست، واجب است که از آن حکم اول بازگردد و بقا بر آن برایش حلال نیست. و به همین دلیل بود که از علم و دین و ورع مالک بن انس این بود که هرگاه از او درباره مسئله‌ای در دین خدا سؤال می‌شد، می‌گفت: «آیا نازل شده است؟» اگر گفته می‌شد: «بله»، فتوا می‌داد. و اگر گفته می‌شد: «نازل نشده»، فتوا نمی‌داد. و سبب آن همان است که ذکر کردیم، زیرا مصیب (به صواب رسیدن) حکم معین در آن مسئله، یک نفر است که معین نیست، و مخطئ (خطاکننده) نیز یک نفر است که معین نیست. و به همین دلیل علما گفتند: «هر مجتهدی مصیب است»، یا مصیب حکم الهی در آن مسئله به طور معین، یا مصیب حکم مقرری که خداوند برای او ثابت کرده است، در صورتی که بر آن حکم معین دست نیافته و آن را خطا کرده باشد. و این مقدار در اصول احکام شریعت در این کتاب کافی است، زیرا گنجایش استقصا (بررسی کامل) را ندارد.\n\nو اما اسرار اصول احکام شریعت مورد اتفاق و اختلاف:\n\n### [سر اصل اخذ به کتاب]\n\nسر کتاب، آن چیزی است که از جانب خداوند برای بنده حاصل می‌شود، با ترک واسطه‌ها، همان‌طور که فرمود: **كَتَبَ فِي قُلُوبِهِمُ الْإِيمَانَ** (ایمان را در دل‌هایشان نگاشت). پس آنان کتاب خدا هستند. و این همان قول شارع است: «آنچه تو را به شک می‌اندازد، رها کن و به آنچه تو را به شک نمی‌اندازد، روی آور»\nو قول او: «از قلب خود فتوا بخواه، هرچند مفتیان به تو فتوا دهند.»\nو کتابت، ضمیمه کردن معانی الهی است به آنچه شایسته جلال اوست، از نسبت دادن اسماء حسنای خداوند به معانی‌ای که ما از تخلق (تخلق) به آن اسماء، یعنی به معانی آنها، داریم، یا اینکه آن معانی اخلاق ما باشند نه تخلق، و آن نسبت دادن آنها به ماست به نحوی که شایسته ما باشد. پس او رؤوف و رحیم است، و در مورد رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **بِالْمُؤْمِنِينَ رَءُوفٌ رَحِيمٌ** (نسبت به مؤمنان رؤوف و مهربان است)، و این مدح است. و خود را عزیز و کریم نامیده است، و در مورد برخی بندگانش فرمود: **ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ** (بچش، همانا تو همان عزیز و کریمی)، و این ذم است. و همه اینها اسماء خدا و اسماء خلق هستند، و مدلول‌های آنها با آثارشان در کسی که به آنها نامیده شده، معقول المعناست، هرچند نسبت‌هایشان متفاوت باشد. پس نسبت آنها به خداوند شبیه نسبت آنها به بنده نیست، زیرا **لَيْسَ كَمِثْلِهِ شَيْءٌ** (هیچ چیز مانند او نیست). و اگرچه اثر کریم این است که عطا کند، و عطا از خدا و از بنده به جهت انعام یافت شده است، اگر معنا از یک جهت به معنا ضمیمه شود، از جهتی دیگر جدا شده‌اند، زیرا موصوف نامیده شده شبیه موصوف نامیده شده دیگر نیست. پس از آن جهتی که اشتراک رخ می‌دهد، که همان اثر است، از آن جهت کتابت (نگاشتن) حاصل می‌شود، زیرا کتابت به معنای ضمیمه کردن است، و با ضمیمه شدن حروف به یکدیگر، کتابت نامیده شده است. و کتیبه (لشکر) ضمیمه شدن اسب‌ها با سوارانشان به یکدیگر است. اگر متفرق و تک‌تک می‌آمدند، کتیبه نامیده نمی‌شدند. پس او مؤمن است و در قلب بنده خود ایمان را نگاشته است، و آن کتابت حکمی را برای او واجب کرده که به آن مؤمن نامیده شده است. و اسم غیر از مسمی نیست. پس او ظاهر در عین ممکن است و ممکن مظهر اوست. و هر ظاهری که در مظهری ظاهر شود، ظاهر به مظهر ضمیمه شده و مظهر به ظاهر ضمیمه شده است. و به همین دلیل صحیح است که مظهر برای ظاهر در آن باشد. پس این است سر اصل اخذ به کتاب به عنوان دلیل بر ثبوت حکم.\n\n### [سر سنت در اثبات حکم]\n\nو اما سر سنت (السنة) در اثبات حکم، از آنجا که رسول (علیه السلام) از روی هوی سخن نمی‌گوید و حکم او حکم خداست و او ناقل از خدا و ابلاغ‌کننده از اوست به آنچه خداوند به او نشان داده است، و خداوند بر صراط مستقیم است. و سنت همان طریقه و راه است. و راه برای خودش خواسته نمی‌شود، بلکه برای غایتش خواسته می‌شود. پس سنت **صِرَاطِ اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ** (راه خداست که آنچه در آسمان‌ها و آنچه در زمین است، از آن اوست. آگاه باشید که امور به سوی خدا باز می‌گردد) است، زیرا سنت بر صراط اوست و او غایت صراط اوست. پس سالک بر آن ناگزیر به وصول به اوست. پس صراط واسطه است. و به واسطه استعداد مظهر، بر اساس آنچه در نفس خود دارد، بر ظاهر به آنچه به آن نامیده شده، حکم می‌شود. پس او آن اسم و آن حکم را به او داده است و آن صحیح است. پس این صراط مستقیم است. ما هرگاه در امری که برایمان پیش می‌آید، از حق (الحق) سؤال کنیم، اثر سؤال ما در خداوند، اجابت است، پس او مجیب نامیده می‌شود. اگر سؤال ما نبود، این حکم ثابت نمی‌شد و این اسم بر او اطلاق نمی‌شد. و ما در این امر، طریقه او هستیم. خداوند متعال می‌فرماید: **أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ** (دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم). پس او اجابت نکرد مگر زمانی که او را خواند. پس این است سر استدلال به سنت.\n\n### [سر اخذ اجماع به عنوان سند بر اثبات حکم]\n\nو اما اجماع (الإجماع)، آن چیزی است که رب و مربوب (پروردگار و پرورده) بر آن اجماع کرده‌اند، در اینکه خداوند خالق است و بنده مخلوق. و همچنین هر اضافه (نسبت) دیگری. پس در مسائل اضافه، هر جا که یافت شود، اختلافی میان خدا و بندگانش نیست. و همچنین در معلومات، از آن حیث که معلومات هستند.\n\n### [حکم سر قیاس در استدلال نزد اثبات‌کنندگان آن]\n\nو اما قیاس (القياس) نزد اثبات‌کنندگان آن، ظهور رب (پروردگار) به صفت عبد (بنده) و ظهور عبد به صفت رب است، از امری ربانی. اگر از امر ربانی نباشد، به عنوان دلیل بر حکم اتخاذ نمی‌شود، یا از خلق حمید کریم (ستوده و بزرگوار). زیرا آن نیز به عنوان دلیل اتخاذ می‌شود. و اما ظهور رب به صفت مربوب، در آن امر واجب شرط نیست، اما ممکن است از روی دعا و طلب باشد. و صفت آن، صفت امر است و معنا متفاوت است، اگرچه این مسموع و مورد امتثال است و دیگری نیز چنین است، اما میان آنها فرق‌هایی وجود دارد. پس این است حکم سر قیاس در استدلال، و آن قیاس غایب بر شاهد است، به دلیل حکم معقولی که میان شاهد و غایب جمع می‌کند و به هر یک از منسوبین به آن، بر حسب آنچه شایسته جلال اوست، نسبت داده می‌شود. و ما به این دلیل گفتیم «جلال او»، زیرا جلیل از اضداد است و بر عظیم و بر حقیر اطلاق می‌شود. و اسرار اصول احکام شریعت به پایان رسید. پایان جزء نود و چهارم.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 5
}