{
  "id": 531,
  "title": {
    "ar": "الباب الأحد والثلاثون وخمسمائة في معرفة حال قطب كان منزله وما تَكُونُ في شَأْنٍ وما تَتْلُوا مِنْهُ من قُرْآنٍ ولا تَعْمَلُونَ من عَمَلٍ إِلَّا كُنَّا عَلَيْكُمْ شُهُوداً إِذْ تُفِيضُونَ فِيهِ",
    "en": "Chapter 531: Concerning the Gnosis of the State of a Pole (قطب) Whose Station (منزل) Was: <<And you are not engaged in any matter, nor do you recite any portion of the Qur'an from it, nor do you perform any deed, except that We are Witnesses over you when you are engrossed therein.>>",
    "ur": "باب پانچ سو اکتیس: ایک قطب (Qutb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) یہ تھا: \"اور تم کسی حال میں نہیں ہوتے، اور نہ تم اس میں سے کوئی قرآن پڑھتے ہو، اور نہ تم کوئی عمل کرتے ہو، مگر ہم تم پر گواہ (شہود - Shuhūd) ہوتے ہیں جب تم اس میں مشغول ہوتے ہو\" (وَمَا تَكُونُ فِي شَأْنٍ وَمَا تَتْلُو مِنْهُ مِنْ قُرْآنٍ وَلَا تَعْمَلُونَ مِنْ عَمَلٍ إِلَّا كُنَّا عَلَيْكُمْ شُهُودًا إِذْ تُفِيضُونَ فِيهِ)",
    "fa": "باب پانصد و سی و یکم در معرفت حال قطبی که منزل او بود: وَمَا تَكُونُ فِي شَأْنٍ وَمَا تَتْلُو مِنْهُ مِن قُرْآنٍ وَلَا تَعْمَلُونَ مِنْ عَمَلٍ إِلَّا كُنَّا عَلَيْكُمْ شُهُودًا إِذْ تُفِيضُونَ فِيهِ (و در هیچ کاری نباشی و هیچ آیه‌ای از قرآن نخوانی و هیچ عملی انجام ندهید مگر آنکه ما بر شما گواه (شهود) هستیم، آنگاه که در آن کار فرو می‌روید.)"
  },
  "content": {
    "ar": "## «الباب الأحد والثلاثون وخمسمائة في معرفة حال قطب كان منزله وما تَكُونُ في شَأْنٍ وما تَتْلُوا مِنْهُ من قُرْآنٍ ولا تَعْمَلُونَ من عَمَلٍ إِلَّا كُنَّا عَلَيْكُمْ شُهُوداً إِذْ تُفِيضُونَ فِيهِ»\n\n\n> العبد في الشأن والرحمن في الشأن *** وشأن ما هو فيه الحق من شأني‏\n\n\n> فينبغي لي أن أفني مدى عمري *** في شأنه فأجازي الشأن بالشأن‏\n\n\n> لولاه ما نظرت عيني إلى أحد *** لعلمنا أنه عيني وإنساني‏\n\n\n> إني لأنسي وجودي عند رؤيته *** وما نسيت بل النسيان أنساني‏\n\n\n### [إن الاستقامة التي أمروا بها إنما حصل حين وافق الأمر]\n\n\nهذا هجير لزمته سنين كثيرة حتى ما كنت اسمي إلا به مما كنت مستهترا به متحدا ورأينا له بركات لا أحصيها وهو الذي أطلعت منه على المراقبة فكنت رقيبا على نفسي نيابة عن الله حين أمرها أن تكون على وصف خاص معلوم في الشرع المطهر المنزل على لسان المعصوم صَلَّى اللهُ عَليهِ وسَلَّم ورقيبا على آثار ربي فيما يورده على قلبي وفي جميع حركاتي وسكناتي ورقيبا أيضا على ربي بموازنة حده المشروع في عباده فكنت أقيم الوزن بين أمره ونهيه وبين إرادته لأرى مواقع الخلاف ممن خالف والوفاق ممن وافق وما جعلني في ذلك إلا ما شيب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وما هو عندي إلا قوله فَاسْتَقِمْ كَما أُمِرْتَ فإذا وافق الأمر الإرادة كانت الاستقامة كما أمر وحصل الوفاق وإذا لم يوافق الأمر الإرادة وقع ما حكمت به الإرادة ولم يكن للأمر حكم في المأمور وعلمنا عند ذلك ما هو الأمر الإلهي الذي لا يعصى ومن هو المخاطب وما هو الأمر الإلهي الذي يعصى في وقت فلم نجده إلا الأمر بالواسطة وهو على الحقيقة أمر لفظي صوري فهو صيغة أمر لا حقيقة أمر وأن المأمور بالأمر الإلهي الذي لا يعصى إنما هو المخاطب عين الممكن الذي توجه من الحق عليه الإيجاد بأن يقول له كُنْ فَيَكُونُ ولا بد فهذا هو الأمر الذي لا يعصيه المخاطب أصلا وإنما الإنسان المكلف هو محل ظهور هذا المكون كما إن المكون محل التكوين فيقول للشهادة كن فتكون الشهادة وما لها محل إلا لسان الشاهد وهو القائل فننسب الشهادة إلى من ظهرت فيه ليس له فيها تكوين وإنما التكوين فيها لله في هذا المحل الخاص وهكذا جميع أفعال المكلفين وكون ذلك الفعل طاعة أو معصية ليس عينه وإنما هو حكم الله فيه فكنت أشاهد تكوين الأشياء في ذاتي وفي ذات غيري أعيانا قائمة ذاكرة لله مسبحة بحمده مع كونها ينطلق عليها اسم معصية وطاعة فطلبت من الله مسمى المعصية هل له عين وجودية أو لا عين له وهل بينه وبين مسمى الطاعة فرقان أم الحكم سواء ف إِنَّ الله لا يَأْمُرُ بِالْفَحْشاءِ وما يتكون شي‏ء إلا عن أمره فهل للمعصية تكوين أم لا فاطلعنا على إن مسمى المعصية إنما هو ترك والترك لا شي‏ء ولا عين له فوجدناها مثل مسمى العدم فإنه اسم ليس تحته عين وجودية فإن الشأن محصور في أمر لا يفعل أو نهي لا يمتثل وغير ذلك ما هو ثم فإذا قيل لي أَقِمِ الصَّلاةَ فلم أفعل فعصيت وخالفت أمر الله فما تحت قولي لم أفعل وخالفت إلا أمر عدمي لا وجود له وكذلك في النهي إذا قيل لي لا تفعل كذا مثل قوله تعالى لا يَغْتَبْ بَعْضُكُمْ بَعْضاً فلم أمتثل نهيه ومدلول لم أمتثل عدم لا عين له في الوجود لأنه نفي فاغتبت ومعنى فاغتبت أي ظهر في محلي عين موجودة أوجدها الحق بالأمر التكويني وهو القول الموجود في لساني على طريق خاص يسمى الغيبة فامتثل ذلك المقول في لساني أمر سيده وموجدة بالإيجاد وما أضيف إلي منه إلا كوني لم أمتثل نهيه فانتفى عن محلي الامتثال فما أخذت‏\nفي الوجهين إلا بأمر عدمي وهو ترك الأمر والنهي ولا بد لي في كل نفس أن أكون في شأن وذلك الشأن ليس لي فإن الشأن الظاهر في وجودي إنما هو لله وهو قوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ وفينا تظهر تلك الشئون وأعياننا أيضا من تلك الشئون والله شهيد على ما يخلق منا وفينا وقوله إِذْ تُفِيضُونَ فِيهِ هو ما جعل فينا من الإرادة الاختيارية في عين الجبر فإنا محل لما يخلق فينا فالمكلف مجبور في اختياره ثم خلق فينا المعنى الذي أوجب حكمه علينا أن نكون به مفيضين في ذلك الشي‏ء المعبر عنه بالشأن وما عرفنا بهذا الشهود منه إلا لنعلم صورة الأمر حتى نكون من أمرنا على بينة من ربنا فإنه ما أمر نبيه صَلَّى اللهُ عَليهِ وسَلَّم إلا بطلب الزيادة من العلم فإن العلم بالأمور سبب الحياة المزيلة لموت الجهالة والحياة نعيم فالعالم والناصح نفسه من لا ينسى الله في شئونه ويكون مراقبا له تعالى عند شهوده فيرى ما يصدر عنه فيه وفي غيره في السماء والأرض والملإ الأعلى والأسفل ثم يرى أنه جميع ما رأى من شئونه بهوية الحق لا بصفة الحق فرأى هويته تعالى عين صفته فما رآه إلا به هذا أعطته هذه المراقبة وهذا هو حكم الدهر الذي نهينا عن سبه فإن الله هو الدهر ليس غيره‏\n\n\n> خذ من الدهر ما صفا *** ودع الدهر يحكم‏\n\n\n> إنما الدهر ربنا *** العلي المقدم‏\n\n\n> حاكم بالذي يرى *** مفصح لا يعجم‏\n\n\n> كلما قال كن لشي‏ء *** يكون المكلم‏\n\n\n> فتأدب ولا تقل *** أنا بالأمر أعلم‏\n\n\n> فإلى الله أمرنا *** راجع فلتسلموا\n\n\n> فهو بالأمر أعلم *** وهو للأمر أحكم‏\n\n\nفقد بان لك الأمر بارتفاع الحجب وعرفت الحجب ومسمى الوفاق والخلاف وعلمت من رأى وبمن رأيت ومن أنت وما هو من طريق الوجود فإنه سبحانه لا يقال فيه إن له ماهية وإن سئل عنه بما فالجواب بصفة التنزيه أو صفة الفعل لا غير ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Thirty-One: Concerning the Gnosis of the State of a Pole [Qutb] Whose Station Was the Saying: <<And you are not engaged in any matter, nor do you recite any portion of the Qur’an, nor do you perform any deed, except that We are witnesses over you when you are engrossed in it.>>\n\nThe servant is engaged in the affair (الشأن) and the All-Merciful is engaged in the affair,\nAnd the affair in which the Real (الحق) is engaged is derived from my own affair.\n\nThus, it is incumbent upon me to annihilate (أفني) the span of my life in His affair,\nSo that I may requite the affair with the affair.\n\nWere it not for Him, my eye would not gaze upon anyone,\nFor we know that He is my eye and my humanity (إنساني).\n\nIndeed, I am made to forget my existence (وجودي) upon witnessing Him,\nAnd I did not forget, rather forgetfulness itself made me forget.\n\n### [Verily, the Uprightness (الاستقامة) with which they were commanded only occurred when the Command coincided with the Will]\n\nThis [station] is a path (هجير) I adhered to for many years, such that I was only named by it, due to my intense devotion to it and my unification with it. We saw blessings in it that I cannot enumerate. It is through this station that I was informed of the Vigilance (المراقبة). Thus, I became a watcher (رقيبا) over my own soul, acting as a deputy for Allah, when He commanded it to be upon a specific state known in the purified Law (الشرع المطهر) revealed upon the tongue of the infallible one (صَلَّى اللهُ عَليهِ وسَلَّم).\n\nAnd [I was] a watcher over the traces of my Lord in what He brings forth upon my heart, and in all my movements and my rests (سكناتي). And I was also a watcher over my Lord by balancing His prescribed limit (حده المشروع) concerning His servants. Thus, I established the balance (الوزن) between His command (أمره) and His prohibition (نهيه) and between His Will (إرادته), so that I might see the points of disagreement (الخلاف) from those who opposed, and the points of agreement (الوفاق) from those who concurred.\n\nNothing placed me in this state except that which caused the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) to turn gray, and in my view, this is nothing other than His saying: <<So stand firm (فَاسْتَقِمْ) as you have been commanded.>> If the Command (الأمر) coincides with the Will (الإرادة), then the Uprightness (الاستقامة) is as commanded, and agreement (الوفاق) is achieved. But if the Command does not coincide with the Will, then what the Will decreed occurs, and the Command has no ruling over the one commanded (المأمور).\n\nAt that point, we knew what the Divine Command (الأمر الإلهي) is that cannot be disobeyed, and who the addressed party (المخاطب) is, and what the Divine Command is that is disobeyed at times. We found the latter to be nothing but the Command through an intermediary (بالواسطة), which is, in reality, a verbal, formal command (أمر لفظي صوري). It is merely the form of a command (صيغة أمر), not the reality of a command (حقيقة أمر).\n\nAs for the one commanded by the Divine Command that cannot be disobeyed, the addressed party is none other than the very essence of the contingent thing (عين الممكن) upon which the Real (الحق) directs existence (الإيجاد) by saying to it: \"Be (كُنْ),\" and it is (فَيَكُونُ), inevitably. This is the Command that the addressed party never disobeys. The responsible human (الإنسان المكلف) is merely the locus of manifestation (محل ظهور) for this thing brought into existence (المكون), just as the thing brought into existence is the locus of the bringing into existence (التكوين).\n\nThus, He says to the testimony (الشهادة), \"Be,\" and the testimony comes into being. And it has no locus except the tongue of the witness, who is the speaker. So, we attribute the testimony to the one in whom it appeared, yet he has no part in its creation (تكوينا) within it; rather, the creation of it belongs to Allah in that specific locus. And similarly, all the acts of the responsible ones (المكلفين): the fact that the act is an obedience (طاعة) or a disobedience (معصية) is not the act's essence (عينه), but rather it is Allah's ruling (حكم الله) concerning it.\n\nI used to witness the creation (تكوينا) of things in my own essence (ذاتي) and in the essence of others, as existing entities (أعيانا قائمة) remembering Allah and glorifying Him with His praise, even though the name of disobedience or obedience is applied to them. So, I sought from Allah the designation of disobedience (مسمى المعصية): Does it have an existent entity (عين وجودية) or does it have no entity? And is there a distinction (فرقان) between it and the designation of obedience, or is the ruling the same?\n\nFor <<Indeed, Allah does not command immorality (الْفَحْشاءِ)>> [Q 7:28], yet nothing comes into being (يتكون) except by His Command. So, does disobedience have a creation (تكوينا) or not? We were informed that the designation of disobedience (مسمى المعصية) is merely a *leaving* (ترك), and leaving is nothing (لا شي‏ء) and has no entity (لا عين له). Thus, we found it to be like the designation of non-existence (مسمى العدم), for it is a name beneath which there is no existent entity (عين وجودية). For the affair (الشأن) is confined to a command that is not performed, or a prohibition that is not complied with; anything else is not there.\n\nIf it is said to me, \"Establish the prayer (أَقِمِ الصَّلاةَ),\" and I do not do so, then I have disobeyed and contravened Allah's command. What lies beneath my saying, \"I did not do so and contravened,\" is nothing but a non-existent matter (أمر عدمي) that has no existence. Likewise, concerning prohibition: If it is said to me, \"Do not do such-and-such,\" such as His saying, <<Let not some of you backbite others (لا يَغْتَبْ بَعْضُكُمْ بَعْضاً)>> [Q 49:12], and I do not comply with His prohibition, the implication of \"I did not comply\" is non-existence (عدم) that has no entity in existence, because it is a negation. Then I backbit (فاغتبت).\n\nThe meaning of \"Then I backbit\" is that an existent entity (عين موجودة) appeared in my locus, which the Real (الحق) brought into existence by the Creative Command (الأمر التكويني), which is the speech existing on my tongue in a specific manner called backbiting (الغيبة). That which was spoken on my tongue complied with the command of its Lord and Creator through the act of bringing into existence (الإيجاد). What was attributed to me from this was only my failure to comply with His prohibition, thus compliance (الامتثال) was negated from my locus. Therefore, in both cases, I was only held accountable by a non-existent matter (أمر عدمي), which is the leaving of the Command and the Prohibition.\n\nIt is necessary for me in every breath to be engaged in an affair (شأن), and that affair does not belong to me. For the affair that manifests in my existence (وجودي) belongs only to Allah, which is His saying: <<Every day He is in [a new] affair (كُلَّ يَوْمٍ هُوَ في شَأْنٍ).>> [Q 55:29]. And in us do those affairs (الشئون) appear, and our fixed entities (أعياننا) are also among those affairs. And Allah is a witness (شهيد) over what He creates from us and in us.\n\nAnd His saying, <<when you are engrossed in it (إِذْ تُفِيضُونَ فِيهِ)>>, refers to the elective will (الإرادة الاختيارية) that He placed within us, even within the very essence of compulsion (عين الجبر). For we are the locus for what is created in us; thus, the responsible one (المكلف) is compelled in his choice. Then He created in us the meaning whose ruling necessitated that we, by means of it, become engrossed (مفيضين) in that thing expressed as the affair (الشأن).\n\nHe only made us know this through this Witnessing (الشهود) so that we might know the form of the Command, and thus be clear about our affair from our Lord. For He only commanded His Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) to seek increase in Knowledge (العلم), since the knowledge of affairs is the cause of the life that removes the death of ignorance, and life is bliss.\n\nThe truly knowledgeable person (العالم) and the one who advises his own soul is he who does not forget Allah in his affairs, and who is vigilant (مراقبا) toward Him, the Exalted, during his witnessing (شهوده). He sees what issues forth from Him, both in himself and in others, in the heavens and the earth, and in the Highest and the Lowest Assembly (الملإ الأعلى والأسفل). Then he sees that all the affairs he witnessed are through the Identity (هوية) of the Real (الحق), not through the Attribute (صفة) of the Real. Thus, he sees His exalted Identity (هويته) as the very essence of His Attribute (صفته). He only saw Him by means of Him. This is what this Vigilance (المراقبة) granted him. This is the ruling of Time/Eternity (الدهر) which we were forbidden to revile, for Allah is Time/Eternity (الدهر) and none other.\n\nTake from Time/Eternity (الدهر) what is pure,\nAnd let Time/Eternity rule.\n\nTime/Eternity is none other than our Lord,\nThe Exalted, the Foremost.\n\nA Ruler by what He sees,\nArticulate, not stammering.\n\nWhenever the Speaker says \"Be\" to a thing,\nIt comes into being.\n\nSo be courteous, and do not say,\n\"I know the Command better.\"\n\nFor to Allah our affair returns,\nSo submit yourselves.\n\nFor He is more knowing of the Command,\nAnd He is wiser concerning the Command.\n\nThe Command has now become clear to you through the lifting of the veils (الحجب). You have known the veils, the designation of agreement (الوفاق) and disagreement (الخلاف), and you have known who saw, by whom you saw, who you are, and what you are in the path of Being (الوجود). For He, Glory be to Him, is not described as having a quiddity (ماهية). If He is asked about by \"What?\" (بما), the answer is by an Attribute of Transcendence (صفة التنزيه) or an Attribute of Act (صفة الفعل), and nothing else. And Allah <<speaks the Truth (يَقُولُ الْحَقَّ) and guides to the way (يَهْدِي السَّبِيلَ).>> [Q 33:4]",
    "ur": "باب پانچ سو اکتیس: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور تم کسی حال میں نہیں ہوتے اور نہ تم اس میں سے کوئی قرآن پڑھتے ہو اور نہ تم کوئی عمل کرتے ہو مگر ہم تم پر گواہ ہوتے ہیں جب تم اس میں مشغول ہوتے ہو\" (یونس ۱۰:۶۱)۔\n\nبندہ بھی ایک شان میں ہے اور رحمن بھی ایک شان میں ہے\nاور جو شان حق (الحق) میں ہے، وہ میری شان میں سے ہے\n\nپس میرے لیے ضروری ہے کہ میں اپنی تمام عمر اس کی شان میں فنا (الفناء) کر دوں\nتاکہ میں شان کا بدلہ شان سے دوں\n\nاگر وہ نہ ہوتا تو میری آنکھ کسی اور کی طرف نہ دیکھتی\nکیونکہ ہم جانتے ہیں کہ وہ میری آنکھ اور میرا انسان (وجود) ہے\n\nمیں اس کے دیدار کے وقت اپنے وجود کو بھلا دیتا ہوں\nاور میں نے نہیں بھلایا بلکہ نسیان نے مجھے بھلا دیا\n\n### [بے شک وہ استقامت جس کا انہیں حکم دیا گیا، وہ تب ہی حاصل ہوئی جب امر موافق ہوا]\n\nیہ ایک ایسا طریقہ ہے جسے میں نے کئی سالوں تک لازم پکڑے رکھا، یہاں تک کہ میں اس کے سوا کسی اور نام سے موسوم نہیں ہوتا تھا، جس میں میں مستغرق اور متحد تھا۔ اور ہم نے اس کی ایسی برکات دیکھیں جن کا میں شمار نہیں کر سکتا۔ یہی وہ چیز ہے جس سے مجھے مراقبہ (المراقبۃ) پر اطلاع ملی۔ پس میں اللہ کی نیابت میں اپنے نفس پر نگران تھا، جب اللہ نے اسے حکم دیا کہ وہ ایک خاص وصف پر ہو جو شریعت مطہرہ میں معلوم ہے جو معصوم (صَلَّى اللهُ عَليهِ وسَلَّم) کی زبان پر نازل ہوئی، اور میں اپنے رب کے آثار پر بھی نگران تھا جو وہ میرے قلب پر وارد کرتا ہے، اور میری تمام حرکات و سکنات میں۔ اور میں اپنے رب پر بھی نگران تھا، اس کی حدِ مشروع کو اس کے بندوں میں متوازن کرتے ہوئے، پس میں اس کے امر (حکم) اور نہی (ممانعت) اور اس کی ارادہ (الإرادۃ) کے درمیان توازن قائم کرتا تھا تاکہ میں دیکھوں کہ کس نے مخالفت کی اور کس نے موافقت کی۔ اور مجھے اس میں کسی چیز نے نہیں لگایا سوائے اس کے جس نے رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) کو بوڑھا کر دیا تھا، اور میرے نزدیک وہ صرف آپ کا یہ قول ہے: \"پس تم استقامت اختیار کرو جیسا کہ تمہیں حکم دیا گیا ہے\" (ہود ۱۱:۱۱۲)۔ پس جب امر (حکم) ارادہ (الإرادۃ) کے موافق ہوا تو استقامت ویسی ہی ہوئی جیسا کہ حکم دیا گیا تھا اور موافقت حاصل ہو گئی۔ اور جب امر ارادہ کے موافق نہ ہوا تو وہی واقع ہوا جس کا حکم ارادہ نے دیا تھا، اور مامور (جسے حکم دیا گیا) میں امر کا کوئی حکم نہیں رہا۔\n\nاور ہم نے اس وقت جان لیا کہ وہ امرِ الٰہی (الأمر الإلٰہی) کیا ہے جس کی نافرمانی نہیں کی جاتی، اور مخاطب کون ہے، اور وہ امرِ الٰہی کیا ہے جس کی بعض اوقات نافرمانی کی جاتی ہے۔ ہم نے اسے صرف واسطے کے ذریعے امر پایا، اور وہ حقیقت میں ایک لفظی، صوری امر ہے، پس وہ امر کا ایک صیغہ ہے نہ کہ امر کی حقیقت۔ اور بے شک وہ مامور جسے امرِ الٰہی دیا جاتا ہے جس کی نافرمانی نہیں کی جاتی، وہ عین ممکن (عین المُمکن) ہے جس پر حق (الحق) کی طرف سے ایجاد (الإیجاد) متوجہ ہوتا ہے، اس طرح کہ وہ اسے کہتا ہے: \"ہو جا\" (کُنْ) تو وہ ہو جاتا ہے (فَیَکُونُ)، اور یہ لازمی ہے۔ پس یہ وہ امر ہے جس کی مخاطب ہرگز نافرمانی نہیں کرتا۔ اور بے شک انسانِ مکلف اس مکوّن (جسے وجود دیا گیا) کے ظہور کا محل ہے، جیسا کہ مکوّن، تکوین (التکوین) کا محل ہے۔ پس وہ شہادت (گواہی) سے کہتا ہے: \"ہو جا\" تو شہادت ہو جاتی ہے، اور اس کا کوئی محل نہیں سوائے گواہ کی زبان کے، اور وہی کہنے والا ہے۔ پس ہم شہادت کو اس کی طرف منسوب کرتے ہیں جس میں وہ ظاہر ہوئی، حالانکہ اس میں اس کا کوئی تکوین نہیں ہے، بلکہ اس خاص محل میں تکوین (پیدا کرنا) اللہ کے لیے ہے۔ اور اسی طرح تمام مکلفین کے افعال ہیں۔\n\nاور اس فعل کا طاعت (اطاعت) یا معصیت (نافرمانی) ہونا اس کی عین ذات نہیں ہے، بلکہ وہ اس میں اللہ کا حکم ہے۔ پس میں اپنی ذات میں اور دوسروں کی ذات میں اشیاء کی تکوین (التکوین) کا مشاہدہ (الشہود) کرتا تھا، جو قائم اعیان (وجود) ہیں، اللہ کا ذکر کرنے والی، اس کی حمد کے ساتھ تسبیح کرنے والی ہیں، باوجود اس کے کہ ان پر معصیت اور طاعت کا نام بولا جاتا ہے۔ پس میں نے اللہ سے معصیت کے مسمیٰ کے بارے میں پوچھا کہ کیا اس کا کوئی وجودی عین ہے یا اس کا کوئی عین نہیں ہے؟ اور کیا اس کے اور طاعت کے مسمیٰ کے درمیان کوئی فرق ہے یا حکم برابر ہے؟ کیونکہ \"بے شک اللہ بے حیائی کا حکم نہیں دیتا\" (الاعراف ۷:۲۸)، اور کوئی چیز اس کے حکم کے بغیر وجود میں نہیں آتی۔ تو کیا معصیت کی کوئی تکوین ہے یا نہیں؟ پس ہمیں یہ اطلاع ملی کہ معصیت کا مسمیٰ دراصل ترک (چھوڑ دینا) ہے، اور ترک کوئی شے نہیں ہے اور نہ ہی اس کا کوئی عین ہے۔ پس ہم نے اسے عدم (العدم) کے مسمیٰ کی طرح پایا، کیونکہ یہ ایک ایسا نام ہے جس کے نیچے کوئی وجودی عین نہیں ہے۔ بے شک شان (الشأن) اس امر میں محدود ہے جو نہیں کیا جاتا یا اس نہی میں جو بجا نہیں لائی جاتی، اور اس کے علاوہ کچھ نہیں ہے۔\n\nپس جب مجھ سے کہا گیا: \"نماز قائم کرو\" (أَقِمِ الصَّلَاةَ) اور میں نے ایسا نہیں کیا، تو میں نے نافرمانی کی اور اللہ کے حکم کی خلاف ورزی کی۔ پس میرے اس قول کے نیچے کہ \"میں نے نہیں کیا اور خلاف ورزی کی\" سوائے ایک عدمی امر کے کچھ نہیں ہے جس کا کوئی وجود نہیں ہے۔ اور اسی طرح نہی (ممانعت) میں بھی، جب مجھ سے کہا گیا کہ ایسا نہ کرو، جیسا کہ اللہ تعالیٰ کا فرمان ہے: \"تم میں سے کوئی کسی کی غیبت نہ کرے\" (الحجرات ۴۹:۱۲)، اور میں نے اس کی نہی کی تعمیل نہیں کی، تو \"میں نے تعمیل نہیں کی\" کا مفہوم ایک عدم ہے جس کا وجود میں کوئی عین نہیں ہے، کیونکہ یہ نفی ہے۔ پس میں نے غیبت کی، اور \"میں نے غیبت کی\" کا مطلب یہ ہے کہ میرے محل میں ایک موجود عین ظاہر ہوا جسے حق (الحق) نے امرِ تکوینی (الأمر التکوینی) کے ذریعے وجود بخشا، اور وہ میرے زبان میں موجود قول ہے جو ایک خاص طریقے پر ہے جسے غیبت کہا جاتا ہے۔ پس میری زبان میں کہی گئی اس بات نے اپنے آقا اور موجد کے امر کو ایجاد کے ذریعے بجا لایا، اور مجھ سے اس میں صرف یہ منسوب ہوا کہ میں نے اس کی نہی کی تعمیل نہیں کی، پس میرے محل سے تعمیل ختم ہو گئی۔ پس میں نے دونوں صورتوں میں صرف ایک عدمی امر کو اختیار کیا، اور وہ امر اور نہی کا ترک ہے۔\n\nاور میرے لیے ہر سانس میں ضروری ہے کہ میں ایک شان (الشأن) میں رہوں، اور وہ شان میری نہیں ہے۔ کیونکہ میرے وجود میں ظاہر ہونے والی شان درحقیقت اللہ کے لیے ہے، اور وہ اس کا یہ قول ہے: \"وہ ہر دن ایک نئی شان میں ہے\" (الرحمن ۵۵:۲۹)۔ اور ہم میں وہ شانیں ظاہر ہوتی ہیں، اور ہمارے اعیان (وجود) بھی انہی شانوں میں سے ہیں۔ اور اللہ اس پر گواہ ہے جو وہ ہم میں اور ہم سے پیدا کرتا ہے۔ اور اس کا قول \"جب تم اس میں مشغول ہوتے ہو\" (إِذْ تُفِيضُونَ فِيهِ) وہ ہے جو اس نے ہم میں جبری طور پر اختیاری ارادہ (الإرادۃ الإختیاریۃ) کے عین میں رکھا ہے۔ کیونکہ ہم اس چیز کا محل ہیں جو ہم میں پیدا کی جاتی ہے، پس مکلف اپنے اختیار میں مجبور ہے۔ پھر اس نے ہم میں وہ معنی پیدا کیا جس نے ہم پر یہ حکم واجب کر دیا کہ ہم اس شے میں مشغول ہونے والے بنیں جسے شان سے تعبیر کیا جاتا ہے۔ اور اس نے ہمیں اس شہود (الشہود) کے ذریعے صرف اس لیے معرفت (المعرفۃ) دی تاکہ ہم امر کی صورت کو جان لیں، یہاں تک کہ ہم اپنے رب کی طرف سے اپنے امر پر واضح دلیل پر ہوں۔ کیونکہ اس نے اپنے نبی (صَلَّى اللهُ عَليهِ وسَلَّم) کو صرف علم میں اضافے کا حکم دیا، کیونکہ امور کا علم اس حیات کا سبب ہے جو جہالت کی موت کو زائل کرتی ہے، اور حیات نعمت ہے۔ پس عالم اور اپنے نفس کا خیر خواہ وہ ہے جو اپنی شانوں میں اللہ کو نہ بھولے، اور اپنے شہود کے وقت اس کی مراقبہ (المراقبۃ) کرتا رہے، پس وہ دیکھے کہ اس سے کیا صادر ہوتا ہے، اس میں اور اس کے غیر میں، آسمان اور زمین میں، اور ملأ اعلیٰ اور اسفل میں۔ پھر وہ دیکھتا ہے کہ جو کچھ اس نے اپنی شانوں میں دیکھا وہ سب حق (الحق) کی ہویت (ہویت) کے ساتھ ہے نہ کہ حق کی صفت (صفۃ) کے ساتھ۔ پس اس نے اس کی ہویت کو عین اس کی صفت دیکھا، پس اس نے اسے صرف اسی کے ذریعے دیکھا۔ یہ وہ چیز ہے جو اس مراقبہ نے اسے عطا کی، اور یہی دہر (زمانہ) کا حکم ہے جس کی برائی کرنے سے ہمیں منع کیا گیا ہے، کیونکہ اللہ ہی دہر ہے، اس کے سوا کوئی نہیں۔\n\nدہر (زمانہ) سے وہ لے جو صاف ہو\nاور دہر کو حکم کرنے دے\n\nبے شک دہر ہمارا رب ہے\nجو بلند اور مقدم ہے\n\nوہ اس چیز کے ساتھ حکم کرنے والا ہے جسے وہ دیکھتا ہے\nواضح کرنے والا ہے، گونگا نہیں\n\nجب بھی وہ کسی شے سے کہتا ہے \"ہو جا\" (کُنْ)\nتو وہ کلام کرنے والا ہو جاتا ہے\n\nپس ادب اختیار کر اور یہ نہ کہہ\nکہ میں امر (حکم) کو زیادہ جانتا ہوں\n\nپس ہمارا امر اللہ کی طرف لوٹنے والا ہے\nلہٰذا تم تسلیم کرو\n\nپس وہ امر کو زیادہ جاننے والا ہے\nاور وہ امر کے لیے زیادہ حکمت والا ہے\n\nپس پردوں (حجب) کے اٹھ جانے سے تمہارے لیے امر واضح ہو گیا، اور تم نے پردوں کو، اور موافقت (الوفاق) اور مخالفت (الخلاف) کے مسمیٰ کو جان لیا، اور تم نے جان لیا کہ کس نے دیکھا اور تم نے کس کے ذریعے دیکھا، اور تم کون ہو، اور وجود (الوجود) کے طریقے سے وہ کیا ہے۔ کیونکہ اس (اللہ) کے بارے میں یہ نہیں کہا جاتا کہ اس کی کوئی ماہیت ہے، اور اگر اس کے بارے میں \"ما\" (کیا) سے سوال کیا جائے تو جواب تنزیہ (التنزیہ) کی صفت یا فعل (الفعل) کی صفت سے دیا جائے گا، اس کے علاوہ نہیں۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (الاحزاب ۳۳:۴)۔",
    "fa": "باب پانصد و سی و یکم در معرفت حال قطبی که منزل او [این آیه] بود: «و در هیچ کاری نیستی و هیچ آیه‌ای از قرآن نمی‌خوانی و هیچ عملی انجام نمی‌دهید مگر آنکه ما بر شما شاهدیم، آنگاه که در آن فرو می‌روید» (إِذْ تُفِيضُونَ فِيهِ).\n\nبنده در شأن است و رحمان در شأن *** و شأن آنچه حق (الحق) در آن است، از شأن من است.\nپس سزاوار است که تمام عمرم را *** در شأن او فانی کنم، تا شأن را با شأن پاداش دهم.\nاگر او نبود، چشمم به هیچ کس نمی‌نگریست *** زیرا می‌دانیم که او چشم و انسان من است.\nمن هستی (الوجود) خود را هنگام دیدارش فراموش می‌کنم *** و فراموش نکرده‌ام، بلکه نسیان مرا به فراموشی انداخته است.\n\n### [همانا استقامتی که بدان امر شدند، تنها زمانی حاصل می‌شود که امر موافق باشد]\n\nاین [مقام]، هجیر (مقام ترک و دوری از غیر) است که سال‌های بسیاری بدان ملتزم بودم، تا جایی که نامی جز آن نداشتم، از بس که شیفته و متحد با آن بودم. و ما برکات بی‌شماری برای آن دیدیم. این همان مقامی است که از طریق آن بر مراقبه آگاه شدم. پس، از جانب حق (الحق)، مراقب نفس خود بودم، آنگاه که به آن امر شد تا بر وصف خاصی که در شرع مطهر نازل شده بر زبان معصوم (صَلَّى اللهُ عَليهِ وسَلَّم) معلوم است، باشد. و نیز مراقب آثار پروردگارم بودم در آنچه بر قلبم وارد می‌کرد و در تمامی حرکات و سکناتم. و همچنین مراقب پروردگارم بودم با موازنه حدّ مشروع او در میان بندگانش. پس، میان امر و نهی او و اراده‌اش، وزن برقرار می‌کردم تا جایگاه‌های مخالفت کسانی که مخالفت کردند و موافقت کسانی که موافقت کردند را ببینم. و مرا در این کار قرار نداد مگر آنچه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را پیر کرد، و آن نزد من چیزی جز این قول او نیست: «پس همان‌گونه که امر شده‌ای، استقامت (پایداری) کن» (فَاسْتَقِمْ كَما أُمِرْتَ).\n\nپس اگر امر با اراده موافق باشد، استقامت (پایداری) همان‌گونه که امر شده است خواهد بود و موافقت حاصل می‌شود. و اگر امر با اراده موافق نباشد، آنچه اراده حکم کرده است واقع می‌شود و امر در مأمور حکمی نخواهد داشت. و در آن هنگام دانستیم که امر الهی که نافرمانی نمی‌شود چیست و مخاطب آن کیست، و امر الهی که گاهی نافرمانی می‌شود چیست. آن را نیافتیم مگر امر به واسطه، که در حقیقت، امری لفظی و صوری است؛ یعنی صیغه امر است نه حقیقت امر. و مأمور به امر الهی که نافرمانی نمی‌شود، همان عین ممکن است که ایجاب (الإيجاد) از جانب حق (الحق) به او متوجه شده است، به این صورت که به او می‌گوید: «باش، پس می‌شود» (كُنْ فَيَكُونُ) و چاره‌ای جز این نیست. پس این همان امری است که مخاطب هرگز از آن سرپیچی نمی‌کند. و انسان مکلف تنها محل ظهور این «مُکَوَّن» است، همان‌طور که مُکَوَّن محل تکوین (التكوين) است. پس به شهادت می‌گوید: «باش»، و شهادت می‌شود، و محل آن جز زبان شاهد که گوینده است، نیست. پس شهادت را به کسی که در او ظاهر شده نسبت می‌دهیم، در حالی که او در آن تکوینی ندارد، بلکه تکوین (التكوين) در آن برای خداست در این محل خاص. و همچنین است تمامی افعال مکلفین.\n\nو اینکه آن فعل طاعت یا معصیت باشد، عین آن فعل نیست، بلکه حکم خدا در آن است. پس من تکوین (التكوين) اشیا را در ذات خود و در ذات غیر خود مشاهده می‌کردم، به صورت اعیانی (ذواتی) قائم که ذاکر خدا و تسبیح‌گوی حمد او هستند، با وجود اینکه نام معصیت و طاعت بر آن‌ها اطلاق می‌شود. پس از خدا خواستم که آیا مسمای معصیت، عین وجودی دارد یا عین ندارد؟ و آیا میان آن و مسمای طاعت فرقی هست یا حکم یکی است؟ زیرا «همانا خداوند به کار زشت فرمان نمی‌دهد» (إِنَّ الله لا يَأْمُرُ بِالْفَحْشاءِ)، و هیچ چیزی جز به امر او تکوین نمی‌یابد. پس آیا معصیت تکوین دارد یا خیر؟ پس آگاه شدیم که مسمای معصیت، تنها «ترک» است، و ترک، شیء نیست و عین ندارد. پس آن را مانند مسمای عدم (نیستی) یافتیم، زیرا عدم اسمی است که زیر آن عین وجودی نیست.\n\nزیرا شأن (الشأن) محدود است به امری که انجام نمی‌شود یا نهیی که اطاعت نمی‌گردد، و غیر از این، چیزی در آنجا نیست. پس اگر به من گفته شود: «نماز را برپا دار» (أَقِمِ الصَّلاةَ)، و من انجام ندهم، پس نافرمانی کرده و امر خدا را مخالفت کرده‌ام. زیر قول من که «انجام ندادم و مخالفت کردم» چیزی جز یک امر عدمی (نیستی) که وجود ندارد، نیست. و همچنین در نهی، اگر به من گفته شود: «چنین مکن»، مانند این قول خداوند متعال: «بعضی از شما غیبت بعضی دیگر را نکند» (لا يَغْتَبْ بَعْضُكُمْ بَعْضاً)، و من نهی او را اطاعت نکنم، مدلول «اطاعت نکردم» عدمی است که در هستی (الوجود) عین ندارد، زیرا نفی است. پس غیبت کردم. و معنای «غیبت کردم» این است که در محل من، عین موجودی ظاهر شد که حق (الحق) آن را با امر تکوینی (التكويني) ایجاد کرده است، و آن همان قولی است که در زبان من به طریق خاصی که غیبت نامیده می‌شود، موجود است. پس آن گفتار موجود در زبان من، امر سَرور و ایجادکننده‌اش را با ایجاب (الإيجاد) اطاعت کرد. و آنچه از آن به من نسبت داده شد، تنها این بود که نهی او را اطاعت نکردم، پس اطاعت از محل من منتفی شد.\n\nدر هر دو وجه، تنها به امر عدمی (نیستی) مؤاخذه شدم، و آن ترک امر و نهی است. و برای من در هر نفسی چاره‌ای نیست جز اینکه در شأنی باشم، و آن شأن از آنِ من نیست. زیرا شأنی که در هستی (الوجود) من ظاهر می‌شود، تنها از آنِ خداست، و آن قول اوست: «هر روز او در شأنی است» (كُلَّ يَوْمٍ هُوَ في شَأْنٍ). و آن شئون در ما ظاهر می‌شوند، و اعیان (ذوات) ما نیز از آن شئون هستند. و خداوند بر آنچه از ما و در ما خلق می‌کند، شاهد است. و قول او: «آنگاه که در آن فرو می‌روید» (إِذْ تُفِيضُونَ فِيهِ)، همان اراده اختیاری است که در عین جبر در ما قرار داده است. زیرا ما محل آنچه در ما خلق می‌شود هستیم. پس مکلف مجبور در اختیار خود است. سپس در ما معنایی خلق شد که حکم آن بر ما واجب کرد که به واسطه آن در آن شیء که به شأن تعبیر می‌شود، فرو رویم (مُفیض باشیم). و ما را به این شهود (الشهود) آگاه نساخت مگر برای آنکه صورت امر را بدانیم تا در کار خود از جانب پروردگارمان بر بینه باشیم. زیرا او پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) را امر نکرد مگر به طلب فزونی علم، چرا که علم به امور، سبب حیاتی است که مرگ جهالت را از بین می‌برد، و حیات، نعمت است. پس دانا و خیرخواه نفس خویش کسی است که خدا را در شئون خود فراموش نکند و هنگام شهود (الشهود)، مراقب او تعالی باشد، پس آنچه از او در خود و در غیر خود، در آسمان و زمین و ملأ اعلی و اسفل صادر می‌شود را ببیند. سپس ببیند که تمامی آنچه از شئون دیده است، به هویت حق (الحق) است نه به صفت حق. پس هویت او تعالی را عین صفت او دیده است، و او را جز به واسطه خودش ندیده است. این همان چیزی است که این مراقبه به او عطا کرده است. و این حکم دهر (روزگار) است که از دشنام دادن به آن نهی شده‌ایم، زیرا خداوند همان دهر است و غیر او نیست.\n\nاز دهر آنچه صافی است بگیر *** و بگذار دهر حکم کند\nهمانا دهر پروردگار ماست *** بلندمرتبه و پیشین\nحکم‌کننده به آنچه می‌بیند *** آشکارکننده است، نه گنگ\nهرگاه به چیزی بگوید «باش» *** آن گوینده می‌شود\nپس ادب نگه دار و مگو *** من به امر داناترم\nپس امر ما به سوی خدا باز می‌گردد *** پس تسلیم شوید\nپس او به امر داناتر است *** و او برای امر محکم‌تر است\n\nپس امر با برداشته شدن حجاب‌ها برای تو آشکار شد و حجاب‌ها و مسمای موافقت و مخالفت را شناختی، و دانستی چه کسی دید و به واسطه چه کسی دیدی، و تو کیستی و او از طریق هستی (الوجود) چیست. زیرا در مورد او سبحانه گفته نمی‌شود که ماهیت دارد، و اگر از او با «ما» (چیستی) سؤال شود، پاسخ با صفت تنزیه یا صفت فعل است و نه غیر آن. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}