{
  "id": 171,
  "title": {
    "ar": "الباب الحادي والسبعون ومائة في معرفة مقام ترك الصحبة",
    "en": "Chapter One Hundred and Seventy-One: Concerning the Gnosis of the Station (مقام) of Renouncing Companionship.",
    "ur": "باب ایک سو اکہتر (۱۷۱): مقام ترک الصحبة (ترك الصحبة) کی معرفت کے بیان میں۔",
    "fa": "باب صد و هفتاد و یکم در معرفت مقام ترک مصاحبت (الصحبة)"
  },
  "content": {
    "ar": "## (الباب الحادي والسبعون ومائة في معرفة مقام ترك الصحبة)\n\n\n> من ترك الصحبة فهو الذي *** يراه من قيده الجاهل‏\n\n\n> وصحبة الحق على كنهه *** يحيلها العالم والعاقل‏\n\n\n> فهو مع العالم في أينه *** وما له أين ولا حامل‏\n\n\n> فانظر إلى الحكمة في قوله *** إني مع الأكوان يا غافل‏\n> هل هو بالذات على حكم من *** يراه أو بالوصف يا عاقل‏\n\n\n### [الصحبة تطلب المناسب‏]\n\n\nاعلم أيدك الله لما كانت الصحبة تطلب المناسب وهو يقول لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ودليل العقل يقضي به فله السيادة والعالم عبيد فخدمة لا صحبة وإنما امتنعت الصحبة من الطرف الواحد وصحت من الطرف الآخر لما نذكره فالحق ليس بصاحب لا حد من المخلوقين إلا بالصحبة التي أرادها الشارع في‏\n\n\nقوله أنت الصاحب في السفر\n\n\nبذلك المعنى كما اتخذناه وكيلا فيما هو ملكه ولأنه الفعال لما يريد كما قال ما يكون فعالا لما تريد أنت إلا إن توافق إرادتك إرادته وما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله أن تشاءوا فمن حيث إنه أراد فعل لا من حيث إنك أردت والصاحب من يترك إرادته لإرادة صاحبه وهذا في جناب الحق محال فلا يصحب الرب إلا ربوبيته لكن يصحبه العالم لصحة هذا الشرط منه فمن صحبه من العالم ترك إرادته وغرضه ومحابه ومراضيه لإرادة سيده وإن كره ذلك العبد فإن دعواه في الصحبة تجعله أن يوافق ويحمل ذلك وكذلك النبي لا يصحب إلا نبوته فإنه لا يتمكن للنبي أن يكون مع صاحبه بحيث ما يريد صاحبه منه وإنما هو مع ما\n\n\nيوحى إليه به لا يفعل إلا بحسبه فيصحب ولا يصحب ولهذا ليست الصحبة فعل فاعلين وكذلك الملك لا يصحب سوى ملكه فيصحب أيضا ولا يصحب فإن الناس مع الرسول في صحبتهم بحكم ما يشرع لهم ما هم بحكم إرادتهم برهانه فَلا ورَبِّكَ لا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيما شَجَرَ بَيْنَهُمْ ثُمَّ لا يَجِدُوا في أَنْفُسِهِمْ حَرَجاً مِمَّا قَضَيْتَ ويُسَلِّمُوا تَسْلِيماً فلذلك صحبوه وما صحبهم والورثة أهل الإلقاء الإلهي يصحبون ولا يصحبون فإنهم مع ما يلقي الله إليهم كتقرير حكم المجتهد يحرم عليه العدول عنه فلا يصحب مؤمن مؤمنا أبدا لأنه لا يمكن له الوفاء معه على الإطلاق بحق الصحبة فإن المؤمن تحت حكم شرعه‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لو أن فاطمة بنت محمد سرقت قطعت يدها\n\n\nفالمحكوم عليه لا يمكن أن يكون صاحبا لأحد كالعبد لا يتمكن له أن يصحب غير سيده لأنه ما هو بحكم نفسه فيمشي على أغراض صاحبه بل هو بحكم سيده فالصحبة لا تصح إلا من الطرف الواحد وهو الأدنى وقد نبهناك فاعلم وقف عند حدك حتى تعلم أنك صاحب أو مصحوب فاعمل بحسب ذلك والكامل من لا يزال صاحبا أبدا\n\n",
    "en": "Chapter 171: Concerning the Knowledge of the Station of Abandoning Companionship\n\nHe who abandons companionship is the one\nWhom the ignorant perceives as restricted.\nAnd companionship with the Real (الحق) according to His essential nature\nIs deemed impossible by the scholar and the rational person.\nYet He is with the world (العالم) in its location (أينه),\nThough He has no location nor support.\nLook then at the wisdom in His saying:\n\"I am with the existents (الأكوان), O heedless one.\"\nIs this by the Essence (الذات), according to the judgment of the one\nWho witnesses Him, or by the Attribute (الوصف), O rational person?\n\n### [Companionship Requires Suitability]\n\nKnow, may Allah support you, that since companionship requires suitability, and He says: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), and the proof of the intellect confirms this, then sovereignty belongs to Him, and the world (العالم) are His servants. Thus, it is service, not companionship.\n\nCompanionship is only precluded from one side and affirmed from the other for the reason we shall mention. The Real (الحق) is not a companion to any of the created beings, except through the companionship intended by the Lawgiver (الشارع) in the supplication: \"You are the Companion in the journey,\" in that specific meaning, just as we take Him as an agent (وكيلا) over what is His dominion. This is also because He is the Doer of what He wills (الفعال لما يريد). As He said, you cannot be a doer of what you will unless your will conforms to His will: <<وَمَا تَشَاؤُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ>> (And you do not will except that Allah wills that you will).\n\nTherefore, the act occurs because He willed it, not because you willed it. A companion (الصاحب) is one who abandons his will for the will of his companion. This is impossible (محال) in the presence of the Real (الحق). Thus, the Lord (الرب) only accompanies His Lordship (ربوبيته).\n\nHowever, the created being (العالم) can accompany Him because this condition is valid on his part. Whoever among creation accompanies Him abandons his will, purpose, desires, and satisfactions for the will of his Master, even if the servant dislikes it. For his claim to companionship compels him to agree and bear that burden.\n\nLikewise, the Prophet (النبي) only accompanies his Prophethood. It is not possible for the Prophet to be with his companion according to what the companion desires of him. Rather, he is with what is revealed to him, acting only in accordance with it. Thus, he accompanies and does not accompany. For this reason, companionship is not the act of two independent doers (فاعلين). Similarly, the King (الملك) only accompanies his kingdom (ملكه). Thus, he also accompanies and does not accompany.\n\nFor people, in their companionship with the Messenger (الرسول), are governed by what he legislates for them, not by the rule of their own will. The proof of this is: <<فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا>> (But no, by your Lord, they will not believe until they make you judge concerning that over which they dispute among themselves, and then find within themselves no discomfort from what you have judged and submit in full submission). For this reason, they accompanied him, but he did not accompany them.\n\nAnd the inheritors (الورثة), who are the people of Divine inspiration (الإلقاء الإلهي), accompany and do not accompany. They are bound by what Allah casts upon them, like the confirmed ruling of the independent jurist (المجتهد) from which he is forbidden to deviate. Thus, no believer (مؤمن) ever accompanies another believer, because it is impossible for him to fulfill the absolute right of companionship with him, for the believer is under the rule of his Law (شرعه).\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"If Fatimah, daughter of Muhammad, were to steal, I would cut off her hand.\"\n\nTherefore, the one who is ruled (المحكوم عليه) cannot be a companion to anyone, just as the servant (العبد) cannot accompany anyone other than his master. He is not governed by his own will to follow the purposes of his companion; rather, he is governed by the rule of his master.\n\nThus, companionship is only valid from one side, which is the lower side (الأدنى). We have alerted you, so know this and stand at your limit until you know whether you are the companion (صاحب) or the accompanied (مصحوب), and act accordingly. The Perfect Human (الكامل) is the one who remains the companion always.",
    "ur": "(باب نمبر ۱۷۱: مقام ترک صحبت (Companionship چھوڑنے کے مقام) کی معرفت میں)\n\nجس نے صحبت کو ترک کیا، وہ ایسا ہے\nجسے جاہل اپنی قید میں دیکھتا ہے\n\nاور ذات حق (الحق) کی صحبت اس کی حقیقت پر\nکو عالم اور عاقل محال سمجھتے ہیں\n\nپس وہ عالم (العالم) کے ساتھ اس کے \"کہاں\" میں ہے\nحالانکہ اس کا نہ کوئی \"کہاں\" ہے اور نہ کوئی اٹھانے والا\n\nپس اس کے قول میں حکمت کو دیکھو:\n\"اے غافل! میں کائناتوں کے ساتھ ہوں\"\n\nکیا وہ ذات (الذات) کے اعتبار سے ہے، اس کے حکم پر جو اسے دیکھتا ہے\nیا وصف (الوصف) کے اعتبار سے، اے عاقل!\n\n### [صحبت (Companionship) مناسبت کا تقاضا کرتی ہے]\n\nجان لو، اللہ تمہاری تائید فرمائے، چونکہ صحبت (Companionship) مناسبت کا تقاضا کرتی ہے، اور وہ (ذات حق) فرماتا ہے: لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس جیسی کوئی چیز نہیں ہے)، اور عقل کی دلیل بھی اسی کا فیصلہ کرتی ہے، لہٰذا سیادت (سرداری) اسی کے لیے ہے اور عالم (العالم) اس کے بندے ہیں۔ پس یہ خدمت ہے، صحبت نہیں۔ صحبت کا ایک طرف سے ممتنع ہونا اور دوسری طرف سے صحیح ہونا اس وجہ سے ہے جو ہم بیان کریں گے۔\n\nپس ذات حق (الحق) مخلوقات میں سے کسی کا بھی صاحب (ساتھی) نہیں ہے، سوائے اس صحبت کے جو شارع (الشارع) نے اپنے قول \"أنت الصاحب في السفر\" (تو سفر میں ساتھی ہے) میں مراد لی ہے، اسی معنی میں جس طرح ہم نے اسے اس چیز میں وکیل بنایا جو اس کی ملکیت ہے۔ اور اس لیے بھی کہ وہ جو چاہتا ہے اسے کرنے والا ہے۔ جیسا کہ اس نے فرمایا: تم اس وقت تک وہ کرنے والے نہیں ہو سکتے جو تم چاہتے ہو، جب تک تمہارا ارادہ اس کے ارادے کے موافق نہ ہو، اور وَمَا تَشَاؤُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ أَنْ تَشَاءُوا (اور تم نہیں چاہتے مگر یہ کہ اللہ چاہے کہ تم چاہو)۔ پس اس نے اس حیثیت سے فعل کیا کہ اس نے ارادہ کیا، نہ کہ اس حیثیت سے کہ تم نے ارادہ کیا۔\n\nاور صاحب (ساتھی) وہ ہے جو اپنے ساتھی کے ارادے کے لیے اپنا ارادہ ترک کر دے۔ اور یہ بات جناب حق (الحق) میں محال ہے۔ پس رب (الرب) صرف اپنی ربوبیت (الربوبیۃ) کی صحبت کرتا ہے، لیکن عالم (العالم) اس کی صحبت کرتا ہے کیونکہ یہ شرط اس کی طرف سے پوری ہو سکتی ہے۔ پس عالم میں سے جو بھی اس کی صحبت کرتا ہے، وہ اپنے آقا کے ارادے کے لیے اپنا ارادہ، اپنا مقصد، اپنی پسندیدہ چیزیں اور اپنی رضامندی کی چیزیں ترک کر دیتا ہے، اگرچہ وہ بندہ (العبد) اسے ناپسند ہی کیوں نہ کرے۔ کیونکہ صحبت میں اس کا دعویٰ اسے اس بات پر مجبور کرتا ہے کہ وہ موافقت کرے اور اسے برداشت کرے۔\n\nاسی طرح نبی (النبی) بھی صرف اپنی نبوت کی صحبت کرتا ہے۔ کیونکہ نبی کے لیے یہ ممکن نہیں کہ وہ اپنے ساتھی کے ساتھ اس طرح ہو جیسا کہ اس کا ساتھی اس سے چاہتا ہے۔ بلکہ وہ اس چیز کے ساتھ ہوتا ہے جو اس کی طرف وحی کی جاتی ہے، وہ صرف اسی کے مطابق عمل کرتا ہے۔ پس وہ صحبت کرتا بھی ہے اور صحبت نہیں بھی کرتا۔ اسی وجہ سے صحبت دو فاعل (کرنے والوں) کا فعل نہیں ہے۔ اسی طرح بادشاہ بھی اپنی بادشاہت کے علاوہ کسی کی صحبت نہیں کرتا۔ پس وہ بھی صحبت کرتا بھی ہے اور صحبت نہیں بھی کرتا۔\n\nکیونکہ لوگ رسول کے ساتھ اپنی صحبت میں اس حکم کے تحت ہوتے ہیں جو وہ ان کے لیے شریعت بناتے ہیں، نہ کہ اپنے ارادوں کے حکم کے تحت۔ اس کی دلیل یہ ہے: فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا (پس تیرے رب کی قسم! وہ ایمان نہیں لائیں گے جب تک کہ وہ اپنے باہمی جھگڑوں میں تجھے حاکم نہ بنا لیں، پھر جو فیصلہ تو کر دے اس پر اپنے دلوں میں کوئی تنگی محسوس نہ کریں اور پوری طرح سر تسلیم خم کر دیں)۔ اسی لیے انہوں نے آپ کی صحبت کی، اور آپ نے ان کی صحبت نہیں کی۔\n\nاور ورثاء (اہلِ وراثت)، جو القاء الٰہی (الہامی القاء) والے ہوتے ہیں، وہ صحبت کرتے بھی ہیں اور صحبت نہیں بھی کرتے۔ کیونکہ وہ اس چیز کے ساتھ ہوتے ہیں جو اللہ ان پر القاء کرتا ہے، جیسے مجتہد کے حکم کا تقرر، جس سے انحراف کرنا اس پر حرام ہوتا ہے۔ پس کوئی مومن کبھی بھی کسی مومن کی صحبت نہیں کرتا، کیونکہ اس کے لیے صحبت کا حق مطلق طور پر پورا کرنا ممکن نہیں ہے۔ اس لیے کہ مومن اپنی شریعت کے حکم کے تحت ہے۔\n\nرسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"اگر محمد کی بیٹی فاطمہ بھی چوری کرتی تو میں اس کا ہاتھ کاٹ دیتا۔\"\n\nپس جس پر حکم نافذ ہو، وہ کسی کا صاحب (ساتھی) نہیں ہو سکتا، جیسے بندہ (العبد) اپنے آقا کے علاوہ کسی کی صحبت نہیں کر سکتا، کیونکہ وہ اپنے نفس کے حکم کے تحت نہیں ہے کہ اپنے ساتھی کے مقاصد پر چلے، بلکہ وہ اپنے آقا کے حکم کے تحت ہے۔ پس صحبت صرف ایک طرف سے صحیح ہوتی ہے، اور وہ ادنیٰ (کمتر) طرف ہے۔ ہم نے تمہیں متنبہ کر دیا ہے، پس جان لو اور اپنی حد پر قائم رہو تاکہ تمہیں معلوم ہو جائے کہ تم صاحب ہو یا مصحوب (جس کی صحبت کی گئی ہو)، پھر اسی کے مطابق عمل کرو۔ اور کامل (الکامل) وہ ہے جو ہمیشہ صاحب ہی رہے۔",
    "fa": "(باب صد و هفتاد و یکم در معرفت مقام ترک مصاحبت)\n\nآن کس که مصاحبت (الصحبة) را ترک کرد، او کسی است\nکه جاهل، او را مقید می‌بیند.\nو مصاحبت حق (الحق) را بر کنه ذاتش\nعالم و عاقل محال می‌دانند.\nپس او با عالَم در «کجایی» (أین) آن است\nدر حالی که او را «کجا» و حاملی نیست.\nپس بنگر به حکمت در قول او (حق) که:\n«ای غافل، من با کائنات هستم.»\nآیا او به ذات است بر حکم کسی\nکه او را می‌بیند، یا به وصف است ای عاقل؟\n\n[مصاحبت، مناسبت را می‌طلبد]\n\nبدان، خداوند تو را تأیید کند، از آنجا که مصاحبت (الصحبة) مناسبت را می‌طلبد و او (حق) می‌فرماید: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست) و دلیل عقل نیز بر این حکم می‌کند، پس سیادت از آن اوست و عالَم بندگان اویند؛ بنابراین، رابطه، خدمت است نه مصاحبت. مصاحبت تنها از یک طرف ممتنع شده و از طرف دیگر صحیح است، به دلیلی که ذکر خواهیم کرد. حق (الحق) با هیچ یک از مخلوقات مصاحب نیست، مگر به مصاحبتی که شارع (الشارع) در قول خود اراده کرده است: «أنت الصاحب في السفر» (تو در سفر همراه هستی)؛ به همان معنایی که ما او را وکیل خود در آنچه ملک اوست قرار داده‌ایم. و به دلیل اینکه او فعال لما یرید (کننده هر آنچه اراده کند) است، چنانکه فرمود: تو فعال لما ترید (کننده آنچه اراده می‌کنی) نخواهی بود مگر آنکه اراده‌ات با اراده او موافق باشد: «وَما تَشاؤُنَ إِلَّا أَنْ يَشاءَ اللهُ» (و شما اراده نمی‌کنید مگر آنکه خداوند اراده کند) که شما اراده کنید. پس فعل از آن جهت که او اراده کرده است واقع می‌شود، نه از آن جهت که تو اراده کرده‌ای. و مصاحب کسی است که اراده خود را برای اراده صاحبش ترک کند، و این در جناب حق (الحق) محال است. پس رب (الرب) مصاحب کسی جز ربوبیت خود نیست، اما عالَم می‌تواند مصاحب او باشد به دلیل صحت این شرط از جانب عالَم. پس هر کس از عالَم مصاحب او شود، اراده، غرض، خواسته‌ها و رضایت‌های خود را برای اراده سرور خود ترک می‌کند، حتی اگر آن بنده از آن کراهت داشته باشد؛ زیرا ادعای او در مصاحبت، او را وادار می‌کند که موافقت کند و آن را تحمل نماید. همچنین، پیامبر (النبی) مصاحب کسی جز نبوت خود نیست؛ زیرا برای پیامبر ممکن نیست که با مصاحب خود آن‌گونه باشد که مصاحبش از او می‌خواهد، بلکه او با آنچه به او وحی می‌شود همراه است و جز بر اساس آن عمل نمی‌کند. پس او مصاحبت می‌کند و مصاحبت نمی‌کند. به همین دلیل، مصاحبت فعل دو فاعل نیست. همچنین، پادشاه مصاحب کسی جز مُلک خود نیست، پس او نیز مصاحبت می‌کند و مصاحبت نمی‌کند.\n\nزیرا مردم در مصاحبت خود با رسول (الرسول)، تابع حکم آنچه او برایشان تشریع می‌کند هستند، نه تابع حکم اراده خودشان. برهان آن این است: «فَلا وَرَبِّكَ لا يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيما شَجَرَ بَيْنَهُمْ ثُمَّ لا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجاً مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيماً» (پس نه، سوگند به پروردگارت، ایمان نمی‌آورند مگر آنکه تو را در آنچه میانشان اختلاف افتاده داور قرار دهند، سپس در دل‌های خود از آنچه حکم کرده‌ای هیچ تنگی و ناراحتی نیابند و کاملاً تسلیم شوند). به همین دلیل، مردم با او مصاحبت کردند، اما او با آنان مصاحبت نکرد. و وارثان (الورثة)، که اهل القای الهی هستند، مصاحبت می‌کنند و مصاحبت نمی‌کنند؛ زیرا آنان با آنچه خداوند به ایشان القا می‌کند همراهند، مانند تثبیت حکم مجتهد که عدول از آن بر او حرام است. پس هیچ مؤمنی هرگز مصاحب مؤمن دیگری نمی‌شود، زیرا برای او ممکن نیست که به طور مطلق حق مصاحبت را با او وفا کند، چرا که مؤمن تحت حکم شریعت خود است. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «لو أن فاطمة بنت محمد سرقت قطعت يدها» (اگر فاطمه دختر محمد دزدی می‌کرد، دستش را قطع می‌کردم). پس کسی که تحت حکم است، نمی‌تواند مصاحب کسی باشد، همانند بنده که نمی‌تواند مصاحب غیر از سرور خود باشد؛ زیرا او تابع حکم نفس خود نیست که بر اساس اغراض مصاحبش رفتار کند، بلکه تابع حکم سرور خود است. بنابراین، مصاحبت جز از یک طرف، که طرف پایین‌تر است، صحیح نیست. ما تو را آگاه ساختیم، پس بدان و در حد خود بایست تا بدانی که آیا تو صاحب هستی یا مصاحب (مصحوب)، و بر اساس آن عمل کن. و انسان کامل (الإنسان الکامل) کسی است که همیشه مصاحب باشد."
  },
  "page_count": 2
}