{
  "id": 301,
  "title": {
    "ar": "الباب الأحد وثلاثمائة في معرفة منزل الكتاب المقسوم بين أهل النعيم وأهل العذاب",
    "en": "Chapter Three Hundred and One: Concerning the Gnosis (معرفة) of the Station (منزل) of the Apportioned Book (الكتاب المقسوم) between the People of Bliss (أهل النعيم) and the People of Torment (أهل العذاب).",
    "ur": "باب نمبر تین سو ایک: اہل نعیم اور اہل عذاب کے درمیان مقسوم (المقسوم) کتاب کی منزل (منزل) کی معرفت (المعرفۃ) کے بیان میں",
    "fa": "باب سیصد و یکم در معرفت منزل کتاب تقسیم‌شده میان اهل نعیم و اهل عذاب"
  },
  "content": {
    "ar": "## «الباب الأحد وثلاثمائة في معرفة منزل الكتاب المقسوم بين أهل النعيم وأهل العذاب»\n\n\n> إن المقرب من كانت سجيته *** سجية البر والأبرار تجهله‏\n\n\n> القرب منزل من لا شي‏ء يشبهه *** عينا قد أنزله فيه منزله‏\n\n\n> إجماله قد علا قدسا ومنزلة *** ولا لسان لمخلوق يفصله‏\n\n\n> إن العوالم بالميزان تدركها *** فلا تفرط ولا تفرط فتهمله‏\n\n\n> القرب أمر إضافي فرب أذى *** يكون قوتا لنفس منه تسأله‏\n\n\n> فليعطه سؤله إن كان ذا كرم *** وليتق الشح أن الشح يقتله‏\n\n\n> إن العذاب الذي يأتيك من كثب *** قد كنت بالغير في دنياك تنزله‏\n\n\n> ومن آتاه الذي قد كان يفعله *** فكيف ينكره أم كيف يجهله‏\n\n\nقال الله عز وجل (الرَّحْمنُ عَلَّمَ الْقُرْآنَ) على أي قلب ينزل (خَلَقَ الْإِنْسانَ) فعين له الصنف المنزل عليه (عَلَّمَهُ الْبَيانَ) أي نزل عليه القرآن فأبان عن المراد الذي في الغيب (الشَّمْسُ والْقَمَرُ بِحُسْبانٍ) ميزان حركات الأفلاك (وَ النَّجْمُ والشَّجَرُ يَسْجُدانِ) لهذا الميزان أي من أجل هذا الميزان فمنه ذو ساق وهو الشجر ومنه ما لا ساق له وهو النجم فاختلفت السجدتان (وَ السَّماءَ رَفَعَها) وهي قبة الميزان (وَ وَضَعَ الْمِيزانَ) ليزن به الثقلان (أَلَّا تَطْغَوْا في الْمِيزانِ) بالإفراط والتفريط من أجل الخسران (وَ أَقِيمُوا الْوَزْنَ بِالْقِسْطِ) مثل اعتدال نشأة الإنسان إذ الإنسان لسان الميزان (وَ لا تُخْسِرُوا الْمِيزانَ) أي لا تفرطوا بترجيح إحدى الكفتين إلا بالفضل وقال تعالى ونَضَعُ الْمَوازِينَ الْقِسْطَ\n\n\n### [ما من صنعة ولا مرتبة إلا والوزن حاكم عليه علما وعملا]\n\n\nفاعلم أنه ما من صنعة ولا مرتبة ولا حال ولا مقام إلا والوزن حاكم عليه علما وعملا فللمعاني ميزان بيد العقل يسمى المنطق يحوي على كفتين تسمى المقدمتين وللكلام ميزان يسمى النحو يوزن به الألفاظ لتحقيق المعاني التي تدل عليه ألفاظ ذلك اللسان ولكل ذي لسان ميزان وهو المقدار المعلوم الذي قرنه الله بإنزال الأرزاق فقال وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ ولكِنْ يُنَزِّلُ بِقَدَرٍ ما يَشاءُ وقد خلق جسد الإنسان على صورة الميزان وجعل كفتيه يمينه وشماله وجعل لسانه قائمة ذاته فهو لأي جانب مال وقرن الله السعادة باليمين وقرن الشقاء بالشمال وجعل الميزان الذي يوزن به الأعمال على شكل القبان ولهذا وصف بالثقل والخفة ليجمع بين الميزان العددي وهو قوله تعالى بِحُسْبانٍ وبين ما يوزن بالرطل وذلك لا يكون إلا في القبان فلذلك لم يعين الكفتين بل قال فَأَمَّا من\n\n\nثَقُلَتْ مَوازِينُهُ في حق السعداء وأَمَّا من خَفَّتْ مَوازِينُهُ في حق الأشقياء ولو كان ميزان الكفتين لقال وأما من ثقلت كفة حسناته فهو كذا وأما من ثقلت كفة سيئاته فهو كذا وإنما جعل ميزان الثقل هو عين ميزان الخفة كصورة القبان ولو كان ذا كفتين لوصف كفة السيئات بالثقل أيضا إذا رجحت على الحسنات وما وصفها قط إلا بالخفة فعرفنا إن الميزان على شكل القبان ومن الميزان الإلهي قوله تعالى أَعْطى كُلَّ شَيْ‏ءٍ خَلْقَهُ وقال صَلَّى اللهُ عَليهِ وسَلَّم وزنت أنا وأبو بكر فرجحت ووزن أبو بكر بالأمة فرجحها!\n\n\n### [الأمر محصور في علم وعمل‏]\n\n\nواعلم أن الأمر محصور في علم وعمل والعمل على قسمين حسي وقلبي والعلم على قسمين عقلي وشرعي وكل قسم فعلى وزن معلوم عند الله في إعطائه وطلب من العبد لما كلفه أن يقيم الوزن بالقسط فلا يطغى فيه ولا يخسره فقال تعالى لا تَغْلُوا في دِينِكُمْ وهو معنى أَلَّا تَطْغَوْا في الْمِيزانِ ولا تَقُولُوا عَلَى الله إِلَّا الْحَقَّ وهو قوله وأَقِيمُوا الْوَزْنَ بِالْقِسْطِ فطلب العدل من عباده في معاملتهم مع الله ومع كل ما سوى الله من أنفسهم وغيرهم فإذا وفق الله العبد لإقامة الوزن فما أبقى له خيرا إلا أعطاه إياه فإن الله قد جعل الصحة والعافية في اعتدال الطبائع وأن لا يترجح إحداهن على الأخرى وجعل العلل والأمراض والموت بترجيح بعضهن على بعض فالاعتدال سبب البقاء والانحراف سبب الهلاك والفناء وترجيح الميزان في موطنه هو إقامته وخفة الميزان في موطنه إقامته فهو بحسب المقامات وإذا كان الأمر على ما قررناه‏\n\n\n### [إن المحقق هو الذي يقيم هذا الميزان على حسب ما يقتضيه من الرجحان‏]\n\n\nفاعلم إن المحقق هو الذي يقيم هذا الميزان في كل حضرة من علم وعمل على حسب ما يقتضيه من الرجحان والخفة في الموزون بالفضل في موضعه والاستحقاق‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم ندب في‏\nقضاء الدين وقبض الثمن إلى الترجيح فقال أرجح له حين وزن له‏\n\n\nفما أعطاه خارجا عن استحقاقه بعين الميزان فهو فضل لا يدخل الميزان إذا الوزن في أصل وضعه إنما وضع للعدل لا للترجيح وكل رجحان يدخله فإنما هو من باب الفضل وإن الله لم يشرع قط الترجيح في الشر جملة واحدة وإنما قال والْجُرُوحَ قِصاصٌ وقال وجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها ولم يقل أرجح منها وقال فَمَنِ اعْتَدى‏ عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ ما اعْتَدى‏ عَلَيْكُمْ ولم يقل بأرجح فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله فرجح في الإنعام وما ندب الله عباده إلى فضيلة وكريم خلق إلا وكان الجناب الإلهي الأعلى أحق بذاك وهذا من سبق رحمته غضبه فالنار ينزل فيها أهلها بالعدل من غير زيادة والجنة ينزل فيها أهلها بالفضل فيرون ما لا تقتضيه أعمالهم من النعيم ولا يرى أهل النار من العذاب إلا قدر أعمالهم من غير زيادة ولا رجحان إلى أن يفعل الله بهم ما يريد بعد ذلك ولذلك قال في عذابهم إِنَّ رَبَّكَ فَعَّالٌ لِما يُرِيدُ وما يعلم أحد من خلق الله حكم إرادة الله في خلقه إلا بتعريفه أ لا تراه في حق السعداء يقول عَطاءً غَيْرَ مَجْذُوذٍ والصورة واحدة والمدة واحدة ولم يقل في العذاب إنه غير مجذوذ لكن يقطع بأنهم غير خارجين من النار ولا يعرف حالتهم فيها في حال الاستثناء ما يفعل الله فيهم فلا يقضى في ذلك بشي‏ء مع علمنا بأن رحمته سبقت غضبه وعلمنا بأن الله يجزي كل نفس بما عملت وقد قام الدليل على الفضل في أهل السعادة وما جاء مثل ذلك في الأشقياء وهذه مسألة يقف عندها صاحب الفكر أو يحكم بغلبة الظن لا بالقطع إلا صاحب الكشف فإنه يعلم بما أعلمه الله من ذلك غير أن ابن قسي وهو من أهل هذا الشأن قال لا يحكم عدله في فضله ولا فضله في عدله وهذا كلام مجمل فلا أدري هل قاله عن كشف أو عن اعتبار وفكر وهذا الكلام من وجه ينافي‏\n\n\nقوله تعالى سبقت رحمتي غضبي‏\n\n\nومن وجه لا ينافيه فإن الحقائق تعطي أن الفضل لا يحكم في العدل وأن العدل لا يحكم في الفضل فإنه ليس كل واحد من النعتين محلا لحكم الآخر وإن محل حكم الصفة أنما هو في المفضول عليه أو المعدول فيه وإنا قد علمنا من الله تعالى إن الله يتفضل بالمغفرة على طائفة من عباده قد عملوا الشر ولم يقم عليهم ميزان العدل ولا آخذهم بعدله وإنما حكم فيهم بفضله ولا يقال في مثل هذا إنه حكم فضله في عدله وهو الذي يليق بابن قسي رحمه الله إنه أنبأ عن حقيقة كما هو الأمر عليه في نفسه وإذا خالف الكشف الذي لنا كشف الأنبياء عليه السلام كان الرجوع إلى كشف الأنبياء عليه السلام وعلمنا إن صاحب ذلك الكشف قد طرأ عليه خلل بكونه زاد على كشفه نوعا من التأويل بفكره فلم يقف مع كشفه كصاحب الرؤيا فإن كشفه صحيح وأخبر عما رأى ويقع الخطاء في التعبير لا في نفس ما رأى فالكشف لا يخطئ أبدا والمتكلم في مدلوله يخطئ ويصيب إلا أن يخبر عن الله في ذلك فأما ميزان العلم العقلي فهو على قسمين قسم يدركه العقل بفكره وهو المسمى بالمنطق في المعاني وبالنحو في الألفاظ وهذا ليس هو طريق أهل هذا الشأن أعني علم ما اصطلحوا عليه من الألفاظ المؤدية إلى العلم به من البرهان الوجودي والجدلي والخطابي والكلية والجزئية والموجبة والسالبة والشرطية وغير الشرطية وإن اجتمعنا معهم في المعاني ولا بد من الاجتماع فيها ولكن لا يلزم من الاجتماع في المعنى أن لا يكون ذلك إلا من طريق هذه الألفاظ وكذلك لا يلزمنا معرفة المبتدأ والابتداء والفاعل والمفعول والمضاف والمصدر والإضافة واسم كان واسم إن والإعراب والبناء وإن علمنا المعاني ولكن لا يلزم أن نعرف هذه الألفاظ فصاحب الكشف على بصيرة من ربه فيما يدعو إليه خلقه ولكن للعقل قبول كماله فكر ولذلك القبول في الكشف ميزان قد عرفه فيقيمه في كل معلوم يستقل العقل بإدراكه لكن لا يعلمه هذا الولي من طريق الفكر وميزان المنطق فالذي دخل في طريقنا من ميزان العلم العقلي هو إذا ورد العلم الذي يحصل عقيب التقوى من قوله تعالى واتَّقُوا الله ويُعَلِّمُكُمُ الله ومن قوله إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً فالعارف عند ذلك ينظر في تقواه وما اتقى الله فيه من الأمور وما كان عليه من العمل وينظر في ذلك العلم ويناسب بينه وبين تقواه في العمل الذي كان عليه فإن موازين المناسبات لا تخطئ فإذا رأى المناسبة محققة بين العلم المفتوح عليه به وبين ذلك العمل ورأى أن ذلك العمل يطلبه فذلك العلم مكتسب له بعمله فإذا رآه خارجا عن الميزان وترتفع المناسبة أو يكون ما زاد من جنس ما حصل ولكن لا يقتضيه قوة عمله لضعف أو نقص كان في عمله فما زاد على هذا المقدار فهو من علوم الوهب وإن كان له أصل في الكسب فيتعين عليه أن يشكر الله سبحانه على‏\nما منحه فيكون ذلك الشكر يجبر له ما نقص من العمل الذي لو عمله نتج له هذا الذي وهب له فهذا مسبب قد تقدم سببه بل عاد سببا لما كان ينبغي أن يكون مسببا عنه ويزيده الله لذلك الشكر فتحا في قلبه على الحد الذي ذكرناه وتؤخذ جميع الأعمال على ذاكم فهذا حد الميزان العقلي في الطريق واختلفنا فيما يستقل العقل بإدراكه إذا أخذه الولي من طريق الكشف والفتح هل يفتح له مع دليله أم لا فذهبنا نحن إلى أنه قد يفتح له فيه ولا يفتح له في دليله وقد ذقناه وذهب بعضهم منهم صاحبنا الشيخ الإمام أبو عبد الله الكتاني بمدينة فاس سمعته يقول لا بد أن يفتح له في الدليل من غير فكر ويرى ارتباطه بمدلوله فعلمت إن الله ما فتح عليه في مثل هذا العلم إلا على هذا الحد فقال أيضا ذوقه فإخباره أنه كذا رآه صحيح وحكمه أنه لا يكون إلا هكذا باطل فإن حكمه كان عن نظره لا عن كشفه فإنه ما أخبر عن الله أنه قال له هكذا أفعله وأن غير هذا الرجل من أهل هذا الشأن قد أدرك ما ذهبنا إليه ولم يعرف دليله العقلي فأخبر كل واحد بما رآه وصدق في إخباره وما يقع الخطاء قط في هذا الطريق من جهة الكشف ولكن يقع من جهة التفقه فيه فيما كشف إذا كان كشف حروف أو صور وأما الميزان الشرعي فهو إن الله إذا أعطاك علما من العلوم الإلهية لا من غيرها فإنا لا نعتبر الغير في هذا الميزان الخاص فننظر في الشرع إن كنا عالمين به وإلا سألنا المحدثين من علماء الشرائع لا نسأل أهل الرأي فنقول لهم هل رويتم عن أحد من الرسل أنه قال عن الله كذا وكذا فإن قالوا نعم فوازنه بما علمت وبما قيل لك واعلم أنك وارث ذلك النبي في تلك المسألة أو ينظر هل يدل عليها القرآن وهو قول الجنيد علمنا هذا مقيد بالكتاب والسنة فهو الميزان وليس يلزم في هذا الميزان عين المسألة أن تكون مذكورة في الكتاب أو السنة وإنما الذي يطلب عليه القوم أن يجمعهما أصل واحد في الشرع المنزل من كتاب أو سنة على أي لسان نبي كان من آدم عليه السلام إلى محمد صَلَّى اللهُ عَليهِ وسَلَّم فإن أمورا كثيرة نرد في الكشف على الأولياء وفي التعريف الإلهي لا تقبلها العقول وترمي بها فإذا قالها الرسول أو النبي عليه السلام قبلت إيمانا وتأويلا ولا تقبل من غيره وذلك لعدم الإنصاف فإن الأولياء إذا عملوا بما شرع لهم هبت عليهم من تلك الحضرة الإلهية نفحات جود إلهي كشف لهم من أعيان تلك الأمور الإلهية التي قبلت من الأنبياء عليه السلام ما شاء الله فإذا جاء بها هذا الولي كفر والذي يكفره يؤمن بها إذا جاء بها الرسول فما أعمى بصيرة هذا الشخص وأقل الأمور أن يقول له إن كان ما تقوله حق إنك خوطبت بهذا أو كشف لك فتأويله كذا وكذا إن كان ذلك من أهل التأويل وإن كان ظاهريا يقول له قد ورد في الخبر النبوي ما يشبه هذا فإن ذلك ليس هو من شرط النبوة ولا حجره الشارع لا في كتاب ولا سنة ومن هذا الباب في هذا المنزل يعلم الإنسان ميزانه من الحضرة الإلهية في‏\n\n\nقوله إن الله خلق آدم على صورته‏\n\n\nفقد أدخله الجود الإلهي في الميزان فيوازن بصورته حضرة موجدة ذاتا وصفة وفعلا ولا يلزم من الوزن الاشتراك في حقيقة الموزونين فإن الذي يوزن به الذهب المسكوك هو صنجة حديد فليس يشبهه في ذاته ولا صفته ولا عدده فيعلم أنه لا يوزن بالصورة الإنسانية إلا ما تطلبه الصورة بجميع ما تحوي عليه بالأسماء الإلهية التي توجهت على إيجاده وأظهرت آثارها فيه وكما لم تكن صنجة الحديد توازن الذهب في حد ولا حقيقة ولا صورة عين كذلك العبد وإن خلقه الله على صورته فلا يجتمع معه في حد ولا حقيقة إذ لا حد لذاته والإنسان محدود بحد ذاتي لا رسمي ولا لفظي وكل مخلوق على هذا الحد والإنسان أكمل المخلوقات وأجمعها من حيث نشأته ومرتبته فإذا وقفت على حقيقة هذا الميزان زال عنك ما توهمته في الصورة من أنه ذات وأنت ذات وإنك موصوف بالحي العالم وسائر الصفات وهو كذلك وتبين لك بهذا الميزان أن الصورة ليس المراد بها هذا ولهذا جمع في صورة واحدة خَلَقَ الْإِنْسانَ ووَضَعَ الْمِيزانَ وأمرك أن تقيمه من غير طغيان ولا خسران وما له إقامة إلا على حد ما ذكرت لك فإنه الله الخالق وأنت العبد المخلوق وكيف للصنعة أن تكون تعلم صانعها وإنما تطلب الصنعة من الصانع صورة علمه بها لا صورة ذاته وأنت صنعة خالقك فصورتك مطابقة لصورة علمه بك وهكذا كل مخلوق ولو لم يكن الأمر كذلك وكان يجمعكما حد وحقيقة كما يجمع زيدا وعمرا لكنت أنت إلها أو يكون هو مألوها حتى يجمعكما حد واحد والأمر على خلاف ذلك فاعلم بأي ميزان تزن نفسك مع ربك ولا تعجب بنفسك واعلم أنك صنجة حديد وزن‏\nبها ياقوتة يتيمة لا أخت لها وإن اجتمعت معها في المقدار فما اجتمعت معها في القدر ولا في الذات ولا في الخاصية تعالى الله فالزم عبوديتك واعرف قدرك‏\n\n\n### [أن الله قد جعل من مخلوقاته من هو أكبر من الإنسان‏]\n\n\nواعلم أن الله قد جعل من مخلوقاته من هو أكبر منك وإن كان خلقه من أجلك ولكن لا يلزم إذا خلق شيئا من أجلك أن تكون أنت أكبر منه فإن السكين عمل من أجل أمور منها قطع يد السارق والنار خلقت من أجل عذاب الإنسان فالإنسان أشرف من النار لأنها خلقت من أجله فهذا الفصل لا يطرد فلا تدخله ميزانك فأنت أنت وهو هو لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ فبهذا قد أعلمتك بالميزان العلمي المشروع والمعقول وما يحتاج إليه من ذلك فلنبين لك ميزان العمل‏\n\n\n### [إن العمل إما حسي وإما قلبي‏]\n\n\nفاعلم إن العمل منه حسي وقلبي وميزانه من جنسه فميزان العمل أن ينظر إلى الشرع وكيف أقام صور الأعمال على أكمل غاياتها قلبيا كان ذلك العمل أو حسيا أو مركبا من حس وقلب كالنية والصلاة من الحركات الحسية فقد أقام الشرع لها صورة روحانية يمسكها عقلك فإذا شرعت في العمل فلتكن عينك في ذلك المثال الذي أخذته من الشارع واعمل ما أمرت بعمله في إقامة تلك الصورة فإذا فرغت منها قابلها بتلك الصورة الروحانية المعبر عنه بالمثال الذي حصلته من الشارع عضوا عضوا ومفصلا مفصلا ظاهرا وباطنا فإن جاءت الصورة فيها بحكم المطابقة من غير نقصان ولا زيادة فقد أقمت الوزن بالقسط ولم تطغ فيه ولم تخسره فإن الزيادة في الحد عين النقص في المحدود فإذا وزنت عملك مثل هذا الوزن كانت صورة عملك مقدارا للجزاء الذي عينه الحق لك عليه سواء كان ذلك العمل محمودا أو مذموما فإن الشرع أيضا كما أقام لك صورة العمل المحمود لتعمله وبينه لك لتعرفه كذلك أقام لك صورة العمل المذموم لتعرفه وتميزه من المحمود ونهاك أن تعمل عليه صورة تطابقه فإن خالفت وعملت صورة تطابق تلك الصورة طلبت تلك الصورة موازنتها من الجزاء فإن اتفق أن يدخلها الحق في الميزان بالجزاء فإنه لا يزيد عليها في المقدار وزن ذرة أصلا هذا إذا أقام الوزن عليه بالجزاء وكان عذابه في النار جزاء على قدر عمله لا يزيد ولا ينقص لا في العمل ولا في مقدار الزمان والإصرار من الأعمال المنهي عن عملها ولا يزيله إلا التوبة فإن مات عليه خيف عليه ولم يقطع وإذا أدخل الحق صورة العمل الصالح الميزان ووزنه بصورة الجزاء رجحت عليه صورة الجزاء أضعافا مضاعفة وخرجت عن الحد والمقدار منة من الله وفضلا وهو قوله تعالى من عَمِلَ سَيِّئَةً فَلا يُجْزى‏ إِلَّا مِثْلَها كما ذكرناه وقال في الأخرى من جاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثالِها وقال مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوالَهُمْ في سَبِيلِ الله كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنابِلَ في كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ والله يُضاعِفُ لِمَنْ يَشاءُ ولم يجعل للتضعيف في الخير مقدارا يوقف عنده بل وصف نفسه بالسعة فقال والله يُضاعِفُ لِمَنْ يَشاءُ والله واسِعٌ عَلِيمٌ وقال إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ وقال ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ وغضبه شي‏ء فقد وسعته الرحمة وحصرته وحكمت عليه فلا يتصرف إلا بحكمها فترسله إذا شاءت وفيه رائحة الرحمة من أجل المنزل وتمسكه إذا شاءت ولهذا ليس في البسملة شي‏ء من أسماء القهر ظاهرا بل هو الله الرحمن الرحيم وإن كان يتضمن الاسم الله القهر فكذلك يتضمن الرحمة فما فيه من أسماء القهر والغلبة والشدة يقابله بما فيه من الرحمة والمغفرة والعفو والصفح وزنا بوزن في الاسم الله من البسملة ويبقى لنا فضل زائد على ما قابلنا به الأسماء في الاسم الله وهو قوله الرَّحْمنِ الرَّحِيمِ فأظهر عين الرحمن وعين الرحيم خارجا زائدا على ما في الاسم الله منه فزاد في الوزن فرجح فكان الله عرفنا بما يحكمه في خلقه وأن الرحمة بما هي في الاسم الله الجامع من البسملة هي رحمته بالبواطن وبما هي ظاهرة في الرَّحْمنِ الرَّحِيمِ هي رحمته بالظواهر فعمت فعظم الرجاء للجميع وما من سورة من سور القرآن إلا والبسملة في أولها فأولناها إنها إعلام من الله بالمال إلى الرحمة فإنه جعلها ثلاثا الرحمة المبطونة في الاسم الله والرحمن الرحيم ولم يجعل للقهر سوى المبطون في الاسم الله فلا عين له موجودة كالكناية في الطلاق ينوي فيه الإنسان بخلاف الصريح فافهم وأما سورة التوبة فاختلف الناس فيها هل هي سورة مستقلة كسائر سور القرآن أو هل هي وسورة الأنفال سورة واحدة فإنهم كانوا لا يعرفون كمال السورة إلا بالفصل بالبسملة ولم يجي‏ء هنا فدل أنها من سورة الأنفال وهو الأوجه وإن كان لتركها وجه وهو عدم المناسبة بين الرحمة والتبري ولكن ما لهذا الوجه تلك القوة بل هو وجه ضعيف وسبب ضعفه أنه في الاسم الله المنعوت بجميع الأسماء ما هو في اسم خاص يقتضي المؤاخذة والبراءة إنما هي‏\nمن الشريك وإذا تبرأ من المشرك فلكونه مشركا لأن متعلقة العدم فإن الخالق لا يتبرأ من المخلوق ولو تبرأ منه من كان يحفظ عليه وجوده ولا وجود للشريك فالشريك معدوم فلا شركة في نفس الأمر فإذا صحت البراءة من الشريك فهي صفة تنزيه وتبرئة لله من الشريك وللرسول من اعتقاد الجهل ووجه آخر في ضعف هذا التأويل الذي ذكرناه وهو أن البسملة موجودة في كل سورة أولها ويل وأين الرحمة من الويل ولهذا كان للقراء في مثل هذه السورة مذهب مستحسن فيمن يثبت البسملة من القراء وفيمن يتركها كقراءة حمزة وفيمن يخير فيها كقراءة ورش والبسملة إثباتها عنده أرجح فأثبتناها عند قراءتنا بحرف حمزة في هذين الموضعين لما فيهما من قبح الوصل بالقراءة وهو أن يقول والْأَمْرُ يَوْمَئِذٍ لِلَّهِ ويل فبسملوا هنا وأما مذهبنا فيه فهو إن يقف على آخر السورة ويقف على آخر البسملة ويبتدئ بالسورة من غير وصل والقراءة في هذا الفصل على أربعة مذاهب المذهب الواحد لا يرونه أصلا وهو أن يصل آخر السورة بالبسملة ويقف ويبتدئ بالسورة هذا لا يرتضيه أحد من القراء العلماء منهم وقد رأيت الأعاجم من الفرس يفعلون مثل هذا مما لا يرتضيه علماء الأداء من القراء والمذهب الحسن الذي ارتضاه الجميع ولا أعرف لهم مخالفا من القراء الوقوف على آخر السورة ووصل البسملة بأول السورة التي يستقبلها والمذهبان الآخران وهما دون هذا في الاستحسان أن يقطع في الجميع أو يصل في الجميع وأجمع الكل أن يبتدئ بالتعوذ والبسملة عند الابتداء بالقراءة في أول السورة وأجمع على قراءة البسملة في الفاتحة جماعة القراء بلا خلاف واختلفوا في سائر سور القرآن ما لم يبتدئ أحد منهم بالسورة فمنهم من خير في ذلك كورش ومنهم من ترك كحمزة ومنهم من بسمل ولم يخير كسائر القراء ولوجه التخيير والترك وعدم الترك لهذه البسملة حكم عجيبة لا يسع الوقت لذكرها ولأنها خارجة عن مقصود هذا الباب وهي آية حيثما وقعت إلا في سورة النمل في كتاب سليمان عليه السلام فإنها بعض آية ولا أعلم فيها خلافا فهذا قد أبنت لك عن الميزان العملي والعلمي على التقريب والاختصار فلنبين لك ما يتضمنه هذا المنزل من الأمور التي لم نذكرها مخافة التطويل فاعلم إن هذا المنزل يتضمن علم علل هذه الموازين التي ذكرناها وفيه علم ما يستحقه الرب من التعظيم وفيه علم الآخرة الذي بين الدنيا ونزول الناس في منازلهم من الجنة والنار وفيه علم البعث وفيه علم بعض منازل الأشقياء والسعداء وفيه علم السور وفيه علم الاصطلام وفيه علم مراتب العالم العلوي والسفلي والطبيعي والروحاني وفيه منزل القربة ولنا فيه جزء لطيف وفيه علم المفاضلة وفيه علم موازنة الجزاء وفيه علم التخليص والامتزاج وفيه معرفة الوصف الذي لا ينبغي أن يتصف به نبي وعصمة الولي من ذلك وهو عزيز وفيه علم ما يكره في الدنيا ويمقت فاعله وهو محبوب في الآخرة وهو ذلك الفعل بعينه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## The 301st Chapter: On the Knowledge of the Book Divided Between the People of Bliss and the People of Torment\n\nIndeed, the intimate one is he whose nature\nIs the nature of piety, yet the righteous are ignorant of him.\n\nNearness (القرب) is a station that nothing resembles\nIn essence; He has caused him to dwell in it, in its dwelling place.\n\nIts comprehensive nature has ascended in sanctity and rank,\nAnd no tongue of a creature can detail it.\n\nIndeed, you perceive the worlds (العوالم) by the Balance (الميزان),\nSo do not go to excess, nor fall short, lest you neglect it.\n\nNearness is a relative matter, for perhaps an affliction\nBecomes sustenance for a soul that asks for it.\n\nSo let Him grant his request if He is generous,\nAnd let him beware of avarice, for avarice kills him.\n\nIndeed, the torment that comes to you soon\nIs what you inflicted upon others in your worldly life.\n\nAnd when that which he used to do comes to him,\nHow can he deny it, or how can he be ignorant of it?\n\nAllah, the Mighty and Majestic, said: <<The All-Merciful taught the Qur'an>> (الرَّحْمَنُ عَلَّمَ الْقُرْآنَ). Upon which heart does it descend? <<He created the human being>> (خَلَقَ الْإِنْسَانَ). Thus, He specified the type upon whom it descends. <<He taught him the clear expression>> (عَلَّمَهُ الْبَيَانَ). Meaning, the Qur'an descended upon him, and he clarified the intended meaning that is in the Unseen. <<The sun and the moon follow a precise calculation>> (الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ). This is the Balance (ميزان) of the movements of the celestial spheres. <<And the star and the tree prostrate>> (وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ). They prostrate to this Balance, meaning, because of this Balance. From it is that which has a stem, which is the tree, and that which has no stem, which is the star, so the two prostrations differ. <<And the heaven, He raised it>> (وَالسَّمَاءَ رَفَعَهَا), which is the dome of the Balance. <<And He established the Balance>> (وَوَضَعَ الْمِيزَانَ), so that the two weighty ones (mankind and jinn) may be weighed by it. <<That you may not transgress the Balance>> (أَلَّا تَطْغَوْا فِي الْمِيزَانِ) by excess (إفراط) and deficiency (تفريط), leading to loss. <<And establish the weighing with justice>> (وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ), like the equilibrium of the human constitution, for the human being is the tongue (indicator) of the Balance. <<And do not diminish the Balance>> (وَلَا تُخْسِرُوا الْمِيزَانَ). Meaning, do not fall short by favoring one of the two pans, except through Grace (فضل). And He, the Exalted, said: <<And We shall set up the Scales of Justice>> (وَنَضَعُ الْمَوَازِينَ الْقِسْطَ).\n\n### [There is no craft nor rank except that the Weighing governs it, in knowledge and in action]\n\nKnow that there is no craft, nor rank (مرتبة), nor state (حال), nor station (مقام) except that the Weighing governs it, in knowledge and in action. For meanings, there is a balance in the hand of the intellect (عقل) called Logic (منطق), which contains two pans called the premises. And for speech, there is a balance called Grammar (نحو), by which words are weighed to verify the meanings indicated by the words of that language. And for every possessor of a tongue, there is a balance, which is the known measure (المقدار المعلوم) that Allah linked to the sending down of provisions, saying: <<And We do not send it down except in a known measure>> (وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ). But He sends down by the measure He wills.\n\nHe created the human body in the form of the Balance, making its two pans its right and its left, and making its tongue (indicator) the pillar of its Essence (ذات), so it inclines to whichever side it leans. Allah linked felicity (سعادة) with the right and wretchedness (شقاء) with the left.\n\nHe made the Balance by which deeds are weighed in the shape of the steelyard (القبان), and for this reason, it is described by heaviness (ثقل) and lightness (خفة), so as to combine the numerical balance—which is His saying: <<by precise calculation>> (بِحُسْبَانٍ)—with that which is weighed by the pound, which only occurs in the steelyard. Therefore, He did not specify the two pans, but rather said: <<As for him whose scales are heavy>> (فَأَمَّا مَنْ ثَقُلَتْ مَوَازِينُهُ) concerning the felicitous, and <<As for him whose scales are light>> (وَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُ) concerning the wretched. Had it been a two-pan balance, He would have said: 'As for him whose pan of good deeds is heavy, he is such-and-such,' and 'As for him whose pan of evil deeds is heavy, he is such-and-such.' Rather, He made the balance of heaviness the very essence of the balance of lightness, like the form of the steelyard. Had it been a two-pan balance, the pan of evil deeds would also have been described as heavy if it outweighed the good deeds, yet He only ever described it by lightness. Thus, we know that the Balance is in the shape of the steelyard.\n\nAnd among the Divine Balance is His saying, the Exalted: <<He gave every thing its creation>> (أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ). And the Prophet, peace and blessings be upon him, said: \"I was weighed against Abu Bakr, and I outweighed him; and Abu Bakr was weighed against the entire Community, and he outweighed them!\"\n\n### [The matter is confined to Knowledge and Action]\n\nKnow that the matter is confined to Knowledge (علم) and Action (عمل). Action is of two types: sensory and cardiac (قلبي). Knowledge is of two types: intellectual (عقلي) and legal/revealed (شرعي). Every division is based on a known measure with Allah in His granting of it, and a demand upon the servant, since he is obligated to establish the weighing with justice (قسط), neither transgressing it nor diminishing it.\n\nThus He said: <<Do not exceed the limits in your religion>> (لَا تَغْلُوا فِي دِينِكُمْ), which is the meaning of <<That you may not transgress the Balance>> (أَلَّا تَطْغَوْا فِي الْمِيزَانِ), and <<Do not say about Allah except the truth>> (وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ), which is His saying: <<And establish the weighing with justice>> (وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ). Thus, He demanded justice (عدل) from His servants in their dealings with Allah and with everything other than Allah, including themselves and others.\n\nIf Allah grants the servant success in establishing the weighing, He withholds no good from him but grants it to him. Indeed, Allah has placed health and well-being in the equilibrium of the temperaments, such that none outweighs the others. And He has placed ailments, diseases, and death in the predominance of some over others. Thus, equilibrium is the cause of subsistence (بقاء), and deviation is the cause of destruction and annihilation (فناء). The favoring (ترجيح) of the Balance in its proper place is its establishment, and the lightness of the Balance in its proper place is its establishment. Thus, it depends on the stations (مقامات). Since the matter is as We have established it:\n\n### [Indeed, the Verifier (المحقق) is the one who establishes this Balance according to the predominance it requires]\n\nKnow that the Verifier (المحقق) is the one who establishes this Balance in every Divine Presence (حضرة) of knowledge and action, according to the predominance (رجحان) and lightness (خفة) required in the thing being weighed, through Grace (فضل) in its proper place and through desert (استحقاق).\n\nFor the Prophet, peace and blessings be upon him, encouraged favoring when settling a debt and receiving payment, saying: \"Give him more when he weighs it for him.\" Thus, whatever is given outside of what is deserved, according to the essence of the Balance, is Grace and does not enter the Balance, since the weighing, in its original setting, was established for justice (عدل), not for favoring. Every favoring that enters it is only from the category of Grace.\n\nAllah never legislated favoring in evil deeds at all. Rather, He said: <<And for wounds is retaliation>> (وَالْجُرُوحَ قِصَاصٌ), and He said: <<The recompense of an evil deed is an evil deed like it>> (وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا), and He did not say 'more than it.' And He said: <<Whoever commits aggression against you, retaliate against him with the like of what he committed against you>> (فَمَنِ اعْتَدَى عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ مَا اعْتَدَى عَلَيْكُمْ), and He did not say 'with more.' <<But whoever pardons and makes reconciliation—his reward is due from Allah>> (فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ). Thus, He favored in beneficence.\n\nAllah never encouraged His servants toward a virtue or noble character except that the Highest Divine Presence (الجناب الإلهي الأعلى) was more deserving of it. This is due to His Mercy preceding His Wrath. The people of the Fire enter it by justice, without increase, while the people of Paradise enter it by Grace, seeing bliss (نعيم) that their deeds did not necessitate. The people of the Fire see no torment (عذاب) except the measure of their deeds, without increase or favoring, until Allah does with them what He wills thereafter. For this reason, concerning their torment, He said: <<Indeed, your Lord is the Doer of what He intends>> (إِنَّ رَبَّكَ فَعَّالٌ لِمَا يُرِيدُ).\n\nNone of Allah's creation knows the ruling of Allah's Will (إرادة) concerning His creation except by His informing them. Do you not see that concerning the felicitous, He says: <<An unceasing gift>> (عَطَاءً غَيْرَ مَجْذُوذٍ)? The form is one and the duration is one. But He did not say concerning the torment that it is unceasing. However, it is definitively stated that they will not exit the Fire, yet their state therein during the period of exception—what Allah will do with them—is unknown. Thus, no judgment is passed on that matter, despite our knowledge that His Mercy preceded His Wrath, and our knowledge that Allah recompenses every soul for what it has earned. The proof for Grace concerning the people of felicity has been established, but nothing similar has come concerning the wretched.\n\nThis is an issue where the person of reflection (صاحب الفكر) pauses, or judges by overwhelming conjecture, but not by certainty, except for the person of Unveiling (صاحب الكشف), for he knows what Allah has informed him concerning it. However, Ibn Qasi, who is one of the people of this discipline, said: \"His Justice does not rule over His Grace, nor does His Grace rule over His Justice.\" This is a general statement, and I do not know whether he said it based on Unveiling or based on consideration and reflection. This statement, from one perspective, contradicts His saying: \"My Mercy preceded My Wrath.\" And from another perspective, it does not contradict it, for the Realities (حقائق) dictate that Grace does not rule over Justice, and Justice does not rule over Grace, since not every one of the two descriptions is a locus for the ruling of the other. The locus of the Attribute's ruling is only in that which is graced or that in which justice is applied.\n\nWe have learned from Allah that He grants forgiveness by Grace to a group of His servants who committed evil, and the Balance of Justice was not established against them, nor did He seize them by His Justice. Rather, He ruled over them by His Grace. In such a case, it is not said that His Grace ruled over His Justice. This is what is appropriate for Ibn Qasi, may Allah have mercy on him, that he informed of a Reality (حقيقة) as the matter is in itself.\n\nIf the Unveiling we possess contradicts the Unveiling of the Prophets, peace be upon them, then the recourse is to the Unveiling of the Prophets. We know that the possessor of that [contradictory] Unveiling has suffered a defect by adding a type of interpretation (تأويل) to his Unveiling through his reflection (فكر), so he did not stop at his Unveiling, like the person who has a dream: his vision is correct, and he reports what he saw, but the error occurs in the interpretation, not in the vision itself. Unveiling never errs, but the one who speaks about its indication errs and is correct, unless he reports directly from Allah concerning it.\n\nAs for the Balance of Intellectual Knowledge (ميزان العلم العقلي), it is of two types: one type that the intellect (عقل) perceives through its reflection, which is called Logic (منطق) concerning meanings and Grammar (نحو) concerning words. This is not the path of the people of this discipline—I mean the knowledge of the terms they have agreed upon, which lead to knowledge of it, such as existential proof, dialectical proof, rhetorical proof, universal, particular, affirmative, negative, conditional, and non-conditional—even though we agree with them on the meanings, and agreement on meanings is necessary. However, agreement on the meaning does not necessitate that it must only be reached through these specific terms. Likewise, we are not obligated to know the subject, the beginning, the agent, the object, the annexed, the verbal noun, annexation, the subject of *kana*, the subject of *inna*, inflection, and immutability, even though we know the meanings. But we are not obligated to know these terms.\n\nThe person of Unveiling (كشف) is upon clear insight from his Lord concerning what He calls His creation to. However, the intellect has a capacity for acceptance that is reflection, and that acceptance in Unveiling has a balance that he has known, so he establishes it in every piece of knowledge that the intellect independently perceives, but which this saint (ولي) does not know through reflection and the balance of logic.\n\nThat which enters our path from the Balance of Intellectual Knowledge is when knowledge arrives that is obtained subsequent to piety (تقوى), based on His saying: <<And fear Allah, and Allah teaches you>> (وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ), and His saying: <<If you fear Allah, He will grant you a criterion [Furqan]>> (إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا). The Gnostic (عارف) then looks at his piety, the matters in which he feared Allah, and the action he was engaged in. He looks at that knowledge and establishes a correspondence (مناسبة) between it and his piety in the action he was engaged in, for the balances of correspondences do not err. If he sees the correspondence verified between the knowledge opened up to him and that action, and sees that that action demands it, then that knowledge is acquired by him through his action. But if he sees it outside the Balance, and the correspondence is lifted, or if the increase is of the same type as what was obtained but is not necessitated by the strength of his action due to weakness or deficiency in his action, then whatever exceeds this measure is from the sciences of Divine Gift (علوم الوهب), even if it has an origin in acquisition (كسب). It is incumbent upon him to thank Allah, the Glorious, for what He has bestowed upon him, and that gratitude compensates for the deficiency in the action which, had he performed it fully, would have resulted in this gift. This is an effect whose cause has preceded it; rather, it has become a cause for what ought to have been its effect. And Allah increases him in opening (فتح) in his heart due to that gratitude, according to the limit we mentioned. All actions are taken according to this. This is the limit of the Intellectual Balance on the Path.\n\nWe differed concerning what the intellect independently perceives when the saint receives it through Unveiling and Opening: whether the proof (دليل) is opened up to him along with it or not. We hold that it may be opened up to him without the proof being opened up to him, and we have tasted this. Some others, including our companion, the Shaykh and Imam Abu Abdullah al-Kattani in the city of Fez, hold that the proof must be opened up to him without reflection, and he sees its connection to what it indicates. I knew that Allah only granted him an opening in such knowledge according to this limit. But I also said: His tasting (ذوق) and his report that he saw it thus is correct, but his judgment that it can only be this way is false, for his judgment was based on his consideration, not on his Unveiling, since he did not report from Allah that He told him: 'I do it this way.' Others among the people of this discipline have attained what we hold, without knowing its intellectual proof. Thus, each one reported what he saw, and was truthful in his report. Error never occurs on this path from the perspective of Unveiling, but it occurs from the perspective of understanding deeply what was unveiled, especially if the unveiling involved letters or forms.\n\nAs for the Revealed Balance (ميزان الشرعي), it is that if Allah grants you knowledge from the Divine Sciences (علوم الإلهية)—not from others, for we do not consider the 'other' in this specific Balance—we look at the Sacred Law (شرع). If we are knowledgeable of it, [we proceed]; otherwise, we ask the traditionists (محدثين) among the scholars of the Law, not the people of opinion (أهل الرأي). We ask them: 'Have you narrated from any of the Messengers that he said such-and-such about Allah?' If they say yes, then weigh what you have learned against what was said to you, and know that you are the heir of that Prophet in that matter. Or one looks to see if the Qur'an indicates it. This is the saying of Al-Junayd: 'This knowledge of ours is bound by the Book and the Sunnah,' for that is the Balance.\n\nIt is not necessary in this Balance that the exact issue be mentioned in the Book or the Sunnah. Rather, what is required by the people [of this path] is that a single principle in the revealed Law—from the Book or the Sunnah, in the language of any Prophet, from Adam, peace be upon him, to Muhammad, peace and blessings be upon him—unites them both. Many matters come to the saints (أولياء) through Unveiling (كشف) and Divine definition (تعريف إلهي) that intellects do not accept and reject. But if the Messenger or Prophet, peace be upon him, says them, they are accepted through faith and interpretation (تأويل), yet they are not accepted from anyone else. This is due to a lack of fairness. When the saints act according to what has been legislated for them, breaths of Divine Generosity (جود إلهي) blow upon them from that Divine Presence (حضرة الإلهية), unveiling to them, by Allah's will, the very essences (أعيان) of those Divine matters that were accepted from the Prophets, peace be upon them. When this saint brings them, he is deemed an unbeliever, yet the one who deems him an unbeliever believes in them when the Messenger brings them. How blind is the insight (بصيرة) of this person! The least that should be said to him is: 'If what you say is true, that you were addressed with this or that it was unveiled to you, then its interpretation is such-and-such'—if the questioner is one of the people of interpretation. If he is a literalist, he should say: 'Something similar to this has been mentioned in the Prophetic tradition,' for that [knowledge] is not a condition of Prophethood, nor has the Lawgiver restricted it, neither in the Book nor the Sunnah.\n\nFrom this section, in this station, the human being learns his measure (ميزان) from the Divine Presence in His saying: \"Indeed, Allah created Adam upon His image.\" Divine Generosity (الجود الإلهي) has admitted him into the Balance, so he weighs, by his image, the Presence that brings into existence (حضرة موجدة) in Essence (ذات), Attribute (صفة), and Act (فعل). The weighing does not necessitate sharing the reality (حقيقة) of the two things being weighed. For the weight used to weigh coined gold is an iron counterweight, which does not resemble the gold in its Essence, its Attribute, or its number. Thus, it is known that nothing is weighed by the human image except what the image demands, with all that it encompasses, through the Divine Names (الأسماء الإلهية) that were directed toward its existence and manifested their effects within it. Just as the iron counterweight does not balance the gold in definition, reality, or essential form, so too the servant (عبد), even though Allah created him upon His image, does not share with Him a definition or a reality, since His Essence has no definition, while the human being is limited by an essential definition—not a formal or verbal one—and every creature is upon this limit. The human being is the most complete of creatures and the most comprehensive in terms of his constitution and rank (مرتبة).\n\nIf you grasp the reality of this Balance, the illusion you held concerning the image—that He is an Essence and you are an essence, and that you are described by the Living, the Knowing, and the rest of the Attributes, and He is likewise—will vanish. It will become clear to you through this Balance that the image is not intended to mean this. For this reason, He combined in one context: <<He created the human being>> (خَلَقَ الْإِنْسَانَ) and <<He established the Balance>> (وَوَضَعَ الْمِيزَانَ), and commanded you to establish it without transgression (طغيان) or diminution (خسران). It has no establishment except according to the limit I mentioned to you, for He is Allah, the Creator (الخالق), and you are the created servant (العبد المخلوق). How can the artifact know its Maker? The artifact only demands from the Maker the form of His knowledge of it, not the form of His Essence. You are the artifact of your Creator, so your form corresponds to the form of His knowledge of you, and thus is every creature. If the matter were not so, and a definition and a reality united you both, just as they unite Zayd and Amr, then you would be a god, or He would be an object of worship (مألوها) such that a single definition unites you both. But the matter is contrary to this. So know by which Balance you weigh yourself with your Lord, and do not be amazed by yourself. Know that you are an iron counterweight by which a unique ruby, which has no peer, is weighed. Even if you share the same measure, you do not share the same worth, nor the same Essence, nor the same property. Exalted is Allah! So adhere to your servitude (عبوديتك) and know your measure.\n\n### [That Allah has made some of His creatures greater than the human being]\n\nKnow that Allah has made some of His creatures greater than you, even if He created them for your sake. But it is not necessary that if He created something for your sake, you must be greater than it. For the knife was made for certain purposes, including cutting off the hand of the thief, and the Fire was created for the torment of the human being. Yet the human being is nobler than the Fire because it was created for his sake. This distinction is not universal, so do not introduce it into your Balance. You are you, and He is He. <<There is no god but He, the Exalted in Might, the Wise>> (لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ). <<There is nothing like Him, and He is the Hearing, the Seeing>> (لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ). By this, I have informed you of the revealed and intellectual Balance of Knowledge (الميزان العلمي المشروع والمعقول) and what is needed from it. Now let us explain to you the Balance of Action.\n\n### [Action is either sensory or cardiac]\n\nKnow that action is sensory (حسي) and cardiac (قلبي), and its balance is of its own kind. The Balance of Action is to look at the Sacred Law (شرع) and how it established the forms of actions upon their most complete ends, whether that action was cardiac, sensory, or a composite of sensory and cardiac, like intention (نية) and prayer (صلاة) consisting of sensory movements. The Law has established for it a spiritual form (صورة روحانية) that your intellect grasps. When you begin the action, let your focus be on that archetype (مثال) you received from the Lawgiver, and perform what you were commanded to do in establishing that form. When you finish it, compare it to that spiritual form—the archetype you obtained from the Lawgiver—limb by limb, joint by joint, outwardly and inwardly. If the form comes forth according to the rule of correspondence, without deficiency or excess, then you have established the weighing with justice (قسط), neither transgressing it nor diminishing it. For increase in the limit is the very deficiency in the limited thing.\n\nWhen you weigh your action with such a weighing, the form of your action becomes the measure (مقدار) for the recompense (جزاء) that The Real (الحق) has appointed for you concerning it, whether that action was praiseworthy or blameworthy. Just as the Law established for you the form of the praiseworthy action for you to perform and clarified it for you to know, so too it established for you the form of the blameworthy action for you to know it and distinguish it from the praiseworthy, and forbade you from performing an action that corresponds to it. If you disobey and perform a form that corresponds to that [blameworthy] form, that form demands its equivalent recompense.\n\nIf The Real agrees to admit it into the Balance for recompense, He will not increase its measure by the weight of an atom at all. This is if He establishes the weighing upon it with recompense, and his torment (عذاب) in the Fire is a recompense according to the measure of his action, neither increasing nor decreasing, neither in the action nor in the duration of time. Persistence (إصرار) is among the forbidden actions, and nothing removes it except repentance (توبة). If he dies upon it, fear is held for him, but no definitive judgment is passed.\n\nBut when The Real admits the form of the righteous action into the Balance and weighs it against the form of the recompense, the form of the recompense outweighs it manifold, exceeding the limit and measure, as a favor (منة) and Grace (فضل) from Allah. This is His saying: <<Whoever does an evil deed will not be recompensed except with the like of it>> (مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزَى إِلَّا مِثْلَهَا), as we mentioned. And He said concerning the other: <<Whoever comes with a good deed will have ten times its like>> (مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا). And He said: <<The example of those who spend their wealth in the way of Allah is like a seed which grows seven spikes, in each spike is a hundred grains. And Allah multiplies for whom He wills>> (مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ).\n\nHe did not set a limit for the multiplication of good that one must stop at. Rather, He described Himself with vastness, saying: <<And Allah multiplies for whom He wills, and Allah is Vast, All-Knowing>> (وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ). And He said: <<Indeed, your Lord is vast in forgiveness>> (إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ). And He said: <<And My Mercy encompasses all things>> (وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ). His Wrath is a thing, so Mercy has encompassed it, confined it, and ruled over it. Thus, it does not act except by Mercy's ruling. Mercy releases it when it wills, and holds it when it wills.\n\nFor this reason, there is nothing of the Names of Compulsion (أسماء القهر) overtly present in the Basmala [Bismillah], but rather it is Allah, the All-Merciful (الرحمن), the Especially Merciful (الرحيم). Although the Name Allah encompasses Compulsion, it likewise encompasses Mercy. Whatever Names of Compulsion, Dominance, and Severity are in it are countered by what is in it of Mercy, Forgiveness, Pardon, and Overlooking, measure for measure, within the Name Allah in the Basmala. And there remains for us an excess of Grace (فضل زائد) beyond what we countered the Names with in the Name Allah, which is His saying: *al-Rahman al-Rahim*. He manifested the essence of the All-Merciful and the essence of the Especially Merciful externally, in addition to what is contained within the Name Allah from them. Thus, He increased the weighing, and it prevailed. Allah thereby informed us of what He rules over His creation: that the Mercy contained within the comprehensive Name Allah in the Basmala is His Mercy toward the inner aspects (بواطن), and the Mercy manifested in *al-Rahman al-Rahim* is His Mercy toward the outer aspects (ظواهر). Thus, it became universal, and hope is great for all.\n\nThere is no chapter (sura) of the Qur'an except that the Basmala is at its beginning. We interpret this as an announcement from Allah that the outcome tends toward Mercy, for He made it three: the Mercy concealed within the Name Allah, and *al-Rahman al-Rahim*. He did not grant Compulsion anything except what is concealed within the Name Allah, so it has no manifest essence, like the implied statement in divorce where a person intends it, unlike the explicit statement. Understand this.\n\nAs for *Surat al-Tawbah* (Repentance), people differed concerning it: Is it an independent chapter like the rest of the Qur'an, or is it and *Surat al-Anfal* (The Spoils) a single chapter? They only recognized the completeness of a chapter by the separation with the Basmala, and it does not appear here. This indicates that it belongs to *Surat al-Anfal*, which is the most plausible view, even though there is a reason for omitting it, which is the lack of correspondence between Mercy and the declaration of disavowal (تبري). However, this reason does not possess great strength; rather, it is a weak reason. The cause of its weakness is that the Name Allah, which is described by all the Names, contains what is in a specific Name that necessitates accountability. The disavowal is only from the partner (شريك). When He disavows the polytheist (مشرك), it is because he is a polytheist, since its object is non-existence. The Creator does not disavow the creature, even if the one who preserves its existence disavows it. And the partner has no existence, so there is no partnership in reality. If the disavowal of the partner is sound, then it is an Attribute of Transcendence (تنزيه) and a declaration of Allah's freedom from a partner, and the Messenger's freedom from the belief in ignorance.\n\nAnother reason for the weakness of the interpretation we mentioned is that the Basmala is present at the beginning of every chapter that begins with \"Woe\" (ويل), and where is Mercy in relation to Woe? For this reason, the reciters (قراء) have an approved method concerning such chapters: those who affirm the Basmala, those who omit it, like the recitation of Hamza, and those who allow a choice, like the recitation of Warsh, for whom affirming the Basmala is preferable. We affirmed it when reciting according to the reading of Hamza in these two places, due to the ugliness of joining the recitation, which would be to say: 'And the command on that Day belongs to Allah, Woe...' So they recited the Basmala here.\n\nAs for our method concerning it, it is to pause at the end of the chapter, pause at the end of the Basmala, and begin the chapter without joining. Recitation in this section follows four methods. One method is not considered valid at all: joining the end of the chapter with the Basmala, pausing, and then beginning the chapter. None of the scholarly reciters approve of this. I have seen non-Arabs from Persia do this, which the scholars of recitation do not approve of. The excellent method, approved by all—and I know of no reciter who disagrees—is pausing at the end of the chapter and joining the Basmala to the beginning of the chapter that follows. The other two methods, which are less preferred, are either to pause completely in all cases or to join completely in all cases. All agree that one should begin with the seeking of refuge (تعوذ) and the Basmala when starting the recitation at the beginning of a chapter. The entire body of reciters agrees, without dispute, on reciting the Basmala in *Al-Fatiha*. They differed concerning the rest of the Qur'an's chapters, provided none of them started the chapter [mid-way]. Some allowed a choice, like Warsh; some omitted it, like Hamza; and some recited the Basmala without allowing a choice, like the rest of the reciters. The reason for allowing choice, omission, and non-omission of this Basmala involves wondrous rulings that time does not permit mentioning, and because they fall outside the scope of this chapter. It is a verse (آية) wherever it occurs, except in *Surat al-Naml* (The Ants), in the letter of Solomon, peace be upon him, where it is part of a verse, and I know of no disagreement on that.\n\nThus, I have clarified for you the Balance of Action (الميزان العملي) and the Balance of Knowledge (العلمي) by approximation and brevity. Now let us clarify what this station (منزل) encompasses of matters we have not mentioned, for fear of prolixity.\n\nKnow that this station encompasses the knowledge of the causes (علل) of these Balances we mentioned. It contains the knowledge of the veneration (تعظيم) due to the Lord. It contains the knowledge of the Hereafter (الآخرة) that lies between the world and the descent of people into their stations in Paradise and the Fire. It contains the knowledge of the Resurrection (البعث). It contains the knowledge of some stations of the wretched (أشقياء) and the felicitous (سعداء). It contains the knowledge of the walls (سور). It contains the knowledge of absorption (اصطلام). It contains the knowledge of the levels (مراتب) of the upper and lower worlds (العالم العلوي والسفلي), the natural and the spiritual. It contains the station of Nearness (منزل القربة), concerning which we have a subtle treatise. It contains the knowledge of preference (مفاضلة). It contains the knowledge of the weighing of recompense (موازنة الجزاء). It contains the knowledge of purification (تخليص) and blending (امتزاج). It contains the knowledge of the description that a Prophet ought not to be described by, and the protection (عصمة) of the saint (ولي) from it—which is rare. And it contains the knowledge of what is disliked in this world and whose doer is hated, yet is beloved in the Hereafter, being that very same act. <<And Allah speaks the Truth, and He guides to the Way>> (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ).",
    "ur": "باب نمبر تین سو ایک: اہل نعمت اور اہل عذاب کے درمیان تقسیم شدہ کتاب کی منزل کی معرفت میں۔\n\nجو مقرب (المقرب) ہے، اس کی سرشت وہی ہے،\nجو نیکی (البر) کی سرشت ہے، اور نیک لوگ اسے نہیں جانتے۔\n\nقرب (القرب) ایسی منزل ہے جس کی کوئی شے مشابہ نہیں،\nحقیقت میں، جس میں اس کے نازل کرنے والے نے اسے اتارا ہے۔\n\nاس کا اجمال قدس اور مرتبے میں بلند ہو چکا ہے،\nاور کسی مخلوق کی زبان اسے بیان نہیں کر سکتی۔\n\nبے شک تم عالموں (العوالم) کو میزان (الميزان) کے ذریعے پاتے ہو،\nپس نہ حد سے بڑھو (إفراط) اور نہ کمی کرو (تفريط) کہ اسے نظر انداز کر دو۔\n\nقرب (القرب) ایک اضافی امر ہے، پس بسا اوقات کوئی تکلیف (أذى)\nاس نفس کے لیے غذا بن جاتی ہے جو اس کا سوال کرتا ہے۔\n\nپس اگر وہ کرم والا ہے تو اسے اس کا سوال دے،\nاور بخل (الشح) سے بچے، کیونکہ بخل اسے ہلاک کر دیتا ہے۔\n\nبے شک وہ عذاب (العذاب) جو تمہارے پاس قریب سے آتا ہے،\nتم دنیا میں اسے دوسروں پر نازل کرتے تھے۔\n\nاور جسے وہ چیز ملے جو وہ خود کرتا تھا،\nتو وہ کیسے اس کا انکار کرے یا کیسے اس سے ناواقف رہے؟\n\nاللہ عزوجل نے فرمایا: (الرَّحْمنُ عَلَّمَ الْقُرْآنَ) \"رحمن نے قرآن سکھایا\" (الرحمن: ۱-۲)۔ یہ کس دل پر نازل ہوتا ہے؟ (خَلَقَ الْإِنْسانَ) \"انسان کو پیدا کیا\" (الرحمن: ۳)۔ پس اس کے لیے وہ صنف متعین کر دی جس پر یہ نازل ہوتا ہے۔ (عَلَّمَهُ الْبَيانَ) \"اسے بیان سکھایا\" (الرحمن: ۴)۔ یعنی اس پر قرآن نازل کیا تو اس نے اس مراد کو واضح کر دیا جو غیب میں تھی۔ (الشَّمْسُ والْقَمَرُ بِحُسْبانٍ) \"سورج اور چاند ایک حساب سے ہیں\" (الرحمن: ۵)۔ یہ افلاک کی حرکات کا میزان ہے۔ (وَ النَّجْمُ والشَّجَرُ يَسْجُدانِ) \"اور تارے اور درخت سجدہ کرتے ہیں\" (الرحمن: ۶)۔ یہ اسی میزان کے لیے ہے، یعنی اسی میزان کی خاطر۔ پس ان میں سے کچھ تنے والے ہیں، جو کہ شجر (درخت) ہیں، اور کچھ بغیر تنے والے ہیں، جو کہ نجم (تارے) ہیں، لہٰذا دونوں کے سجدے مختلف ہیں۔ (وَ السَّماءَ رَفَعَها) \"اور آسمان کو اس نے بلند کیا\" (الرحمن: ۷)۔ اور یہ میزان کی قُبہ (گنبد) ہے۔ (وَ وَضَعَ الْمِيزانَ) \"اور میزان قائم کیا\" (الرحمن: ۷)۔ تاکہ اس سے دونوں بھاری چیزوں (جن و انس) کو تولے۔ (أَلَّا تَطْغَوْا في الْمِيزانِ) \"تاکہ تم میزان میں زیادتی نہ کرو\" (الرحمن: ۸)۔ یعنی خسارے کی وجہ سے افراط (حد سے بڑھنا) اور تفریط (کمی کرنا) نہ کرو۔ (وَ أَقِيمُوا الْوَزْنَ بِالْقِسْطِ) \"اور انصاف کے ساتھ وزن کو قائم رکھو\" (الرحمن: ۹)۔ جیسے انسان کی ساخت کا اعتدال، کیونکہ انسان میزان کی زبان ہے۔ (وَ لا تُخْسِرُوا الْمِيزانَ) \"اور میزان میں کمی نہ کرو\" (الرحمن: ۹)۔ یعنی فضل (فضل) کے بغیر کسی ایک پلڑے کو ترجیح دے کر کمی نہ کرو۔ اور اللہ تعالیٰ نے فرمایا: (وَنَضَعُ الْمَوَازِينَ الْقِسْطَ) \"اور ہم قیامت کے دن انصاف کے ترازو رکھیں گے\" (الأنبیاء: ۴۷)۔\n\n### [کوئی صنعت یا مرتبہ ایسا نہیں جس پر وزن علم اور عمل کے لحاظ سے حاکم نہ ہو]\n\nپس جان لو کہ کوئی صنعت، کوئی مرتبہ، کوئی حال، اور کوئی مقام ایسا نہیں جس پر وزن (الوزن) علم اور عمل کے لحاظ سے حاکم نہ ہو۔ معانی کے لیے ایک میزان ہے جو عقل کے ہاتھ میں ہے، جسے منطق (المنطق) کہا جاتا ہے، جو دو پلڑوں پر مشتمل ہے جنہیں مقدمات (المقدمتين) کہا جاتا ہے۔ اور کلام کے لیے ایک میزان ہے جسے نحو (النحو) کہا جاتا ہے، جس سے الفاظ کو تولا جاتا ہے تاکہ ان معانی کی تحقیق ہو سکے جن پر اس زبان کے الفاظ دلالت کرتے ہیں۔ اور ہر زبان والے کے لیے ایک میزان ہے، اور وہ معلوم مقدار ہے جسے اللہ نے رزق (الأرزاق) کے نازل کرنے کے ساتھ جوڑ دیا ہے۔ چنانچہ فرمایا: (وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ) \"اور ہم اسے ایک معلوم مقدار کے ساتھ ہی نازل کرتے ہیں\" (الحجر: ۲۱)۔ اور فرمایا: (وَلَكِنْ يُنَزِّلُ بِقَدَرٍ مَا يَشَاءُ) \"لیکن وہ ایک اندازے سے نازل کرتا ہے جو وہ چاہتا ہے\" (الشوریٰ: ۲۷)۔ اور انسان کا جسم میزان کی صورت پر پیدا کیا گیا ہے، اور اس کے دونوں پلڑے اس کا دایاں اور بایاں ہاتھ بنائے گئے ہیں، اور اس کی زبان اس کی ذات کا قائمہ بنائی گئی ہے۔ پس وہ جس طرف بھی جھکتا ہے۔ اور اللہ نے سعادت (السعادة) کو دائیں سے اور شقاوۃ (الشقاء) کو بائیں سے جوڑ دیا ہے۔ اور وہ میزان جس سے اعمال تولے جائیں گے، اسے قبان (القبان) (بڑے کانٹے) کی شکل پر بنایا گیا ہے، اسی لیے اسے ثقل (بھاری پن) اور خفت (ہلکے پن) سے موصوف کیا گیا ہے، تاکہ وہ عددی میزان کو جمع کرے، جو کہ اس کا قول ہے: (بِحُسْبَانٍ) \"ایک حساب سے\" (الرحمن: ۵)، اور اس میزان کو جو رطل (وزن کی اکائی) سے تولا جاتا ہے، اور یہ صرف قبان (القبان) میں ہی ہوتا ہے۔ اسی لیے اس نے دونوں پلڑوں کو متعین نہیں کیا، بلکہ فرمایا: (فَأَمَّا مَنْ ثَقُلَتْ مَوَازِينُهُ) \"تو جس کے میزان بھاری ہوں گے\" (القارعة: ۶)۔ یہ سعادت مندوں کے حق میں ہے۔ اور (وَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُ) \"اور جس کے میزان ہلکے ہوں گے\" (القارعة: ۸)۔ یہ بدبختوں کے حق میں ہے۔ اگر یہ دو پلڑوں والا میزان ہوتا تو وہ فرماتا: \"اور جس کے نیکیوں کا پلڑا بھاری ہو گا تو وہ ایسا ہے، اور جس کے برائیوں کا پلڑا بھاری ہو گا تو وہ ایسا ہے\"۔ لیکن اس نے ثقل (بھاری پن) کے میزان کو عین خفت (ہلکے پن) کا میزان بنایا، جیسے قبان (القبان) کی صورت ہوتی ہے۔ اگر یہ دو پلڑوں والا ہوتا تو برائیوں کے پلڑے کو بھی ثقل سے موصوف کیا جاتا جب وہ نیکیوں پر غالب آ جاتا، مگر اس نے اسے کبھی بھی خفت (ہلکے پن) کے سوا موصوف نہیں کیا۔ پس ہم نے جان لیا کہ میزان قبان (القبان) کی شکل پر ہے۔ اور میزانِ الٰہی میں سے اللہ تعالیٰ کا یہ قول ہے: (أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ) \"اس نے ہر چیز کو اس کی خلقت عطا کی\" (طٰہٰ: ۵۰)۔ اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"میرا اور ابوبکر کا وزن کیا گیا تو میں غالب رہا، اور ابوبکر کا وزن امت کے ساتھ کیا گیا تو وہ غالب رہے!\"\n\n### [امر علم اور عمل میں محدود ہے]\n\nاور جان لو کہ امر علم اور عمل میں محدود ہے۔ اور عمل دو قسم کا ہے: حسی اور قلبی۔ اور علم دو قسم کا ہے: عقلی اور شرعی۔ اور ہر قسم اللہ کے ہاں معلوم وزن پر ہے، خواہ وہ عطا کرنے میں ہو یا بندے سے طلب کرنے میں، کیونکہ اسے مکلف کیا گیا ہے کہ وہ وزن کو انصاف (القسط) کے ساتھ قائم کرے، نہ اس میں زیادتی کرے (طغیٰ) اور نہ کمی کرے (خسارہ)۔ چنانچہ اللہ تعالیٰ نے فرمایا: (لَا تَغْلُوا فِي دِينِكُمْ) \"اپنے دین میں غلو نہ کرو\" (النساء: ۱۷۱)۔ اور یہی معنی ہے (أَلَّا تَطْغَوْا فِي الْمِيزَانِ) \"میزان میں زیادتی نہ کرو\" کا۔ اور فرمایا: (وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ) \"اور اللہ پر حق کے سوا کچھ نہ کہو\" (النساء: ۱۷۱)۔ اور یہی اس کا قول ہے: (وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ) \"اور انصاف کے ساتھ وزن کو قائم رکھو\"۔ پس اللہ نے اپنے بندوں سے مطالبہ کیا کہ وہ اللہ کے ساتھ اور اللہ کے سوا ہر چیز کے ساتھ، خواہ وہ ان کے اپنے نفوس ہوں یا دوسرے، اپنے معاملات میں عدل (العدل) قائم کریں۔ پس جب اللہ بندے کو وزن قائم کرنے کی توفیق دیتا ہے، تو کوئی خیر باقی نہیں رہتی مگر وہ اسے عطا کر دیتا ہے۔ کیونکہ اللہ نے صحت اور عافیت کو طبائع کے اعتدال میں رکھا ہے، اور یہ کہ ان میں سے کوئی ایک دوسرے پر غالب نہ آئے۔ اور اس نے بیماریوں، امراض اور موت کو بعض کے بعض پر غالب آنے میں رکھا ہے۔ پس اعتدال بقا (البقاء) کا سبب ہے اور انحراف ہلاکت اور فنا (الفناء) کا سبب ہے۔ اور میزان کو اس کی جگہ پر ترجیح دینا ہی اسے قائم کرنا ہے، اور میزان کا اس کی جگہ پر ہلکا ہونا ہی اسے قائم کرنا ہے۔ پس یہ مقامات کے مطابق ہے۔ اور جب امر اسی طرح ہے جیسا کہ ہم نے مقرر کیا ہے۔\n\n### [محقق وہ ہے جو اس میزان کو رجحان کے تقاضے کے مطابق قائم کرتا ہے]\n\nپس جان لو کہ محقق (المحقق) وہ ہے جو اس میزان کو علم اور عمل کی ہر حضرۃ (حضور) میں، اس رجحان (الرجحان) اور خفت (ہلکے پن) کے مطابق قائم کرتا ہے جو موزون شے کا تقاضا ہو، اس کی جگہ پر فضل (الفضل) اور استحقاق (استحقاق) کے ساتھ۔\n\nکیونکہ نبی اکرم صلی اللہ علیہ وسلم نے قرض کی ادائیگی اور قیمت وصول کرنے میں ترجیح دینے کی ترغیب دی، چنانچہ فرمایا: \"جب اس نے اس کے لیے وزن کیا تو اس نے اسے زیادہ دیا\"۔\n\nپس جو کچھ اس نے میزان (الميزان) کے عین مطابق اس کے استحقاق سے باہر عطا کیا، وہ فضل (الفضل) ہے جو میزان میں داخل نہیں ہوتا، کیونکہ میزان اپنی اصل وضع میں عدل (العدل) کے لیے رکھا گیا ہے نہ کہ ترجیح کے لیے۔ اور ہر ترجیح جو اس میں داخل ہوتی ہے، وہ فضل (الفضل) کے باب سے ہے۔ اور اللہ نے کبھی بھی شر (برائی) میں یکمشت ترجیح کو مشروع نہیں کیا، بلکہ فرمایا: (وَالْجُرُوحَ قِصَاصٌ) \"اور زخموں میں قصاص ہے\" (المائدہ: ۴۵)۔ اور فرمایا: (وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا) \"اور برائی کا بدلہ اسی کے مثل برائی ہے\" (الشوریٰ: ۴۰)۔ اور یہ نہیں فرمایا کہ اس سے زیادہ ترجیح دی جائے۔ اور فرمایا: (فَمَنِ اعْتَدَى عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ مَا اعْتَدَى عَلَيْكُمْ) \"پس جو تم پر زیادتی کرے، تو تم بھی اس پر اتنی ہی زیادتی کرو جتنی اس نے تم پر کی\" (البقرہ: ۱۹۴)۔ اور یہ نہیں فرمایا کہ اس سے زیادہ ترجیح دو۔ (فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ) \"پس جس نے معاف کر دیا اور اصلاح کی، تو اس کا اجر اللہ پر ہے\" (الشوریٰ: ۴۰)۔ پس اس نے انعام میں ترجیح دی۔ اور اللہ نے اپنے بندوں کو کسی فضیلت یا عمدہ خلق کی طرف ترغیب نہیں دی مگر یہ کہ جنابِ الٰہی اعلیٰ اس کا زیادہ حقدار ہے۔ اور یہ اس کی رحمت (رحمت) کا اس کے غضب پر سبقت لے جانے کی وجہ سے ہے۔ پس جہنم میں اس کے اہل عدل (العدل) کے ساتھ داخل ہوں گے، بغیر کسی زیادتی کے۔ اور جنت میں اس کے اہل فضل (الفضل) کے ساتھ داخل ہوں گے، پس وہ ایسی نعمتیں دیکھیں گے جن کا ان کے اعمال تقاضا نہیں کرتے۔ اور اہل جہنم عذاب (العذاب) میں صرف اپنے اعمال کے بقدر ہی دیکھیں گے، بغیر کسی زیادتی یا ترجیح کے، یہاں تک کہ اس کے بعد اللہ ان کے ساتھ جو چاہے گا کرے گا۔ اسی لیے ان کے عذاب کے بارے میں فرمایا: (إِنَّ رَبَّكَ فَعَّالٌ لِمَا يُرِيدُ) \"بے شک تیرا رب جو چاہتا ہے وہ کرتا ہے\" (ہود: ۱۰۷)۔ اور اللہ کی مخلوق میں سے کوئی بھی اس کی مخلوق میں اس کے ارادے کا حکم نہیں جانتا مگر اس کے بتانے سے۔ کیا تم نہیں دیکھتے کہ سعادت مندوں کے حق میں وہ فرماتا ہے: (عَطَاءً غَيْرَ مَجْذُوذٍ) \"ایسی عطا جو کبھی ختم نہ ہو گی\" (ہود: ۱۰۸)۔ حالانکہ صورت اور مدت ایک ہی ہے۔ اور عذاب کے بارے میں یہ نہیں فرمایا کہ وہ غیر مجذوذ (نہ ختم ہونے والا) ہے، لیکن یہ قطعی ہے کہ وہ جہنم سے نہیں نکلیں گے۔ اور استثناء کی حالت میں ان کی حالت کو کوئی نہیں جانتا کہ اللہ ان کے ساتھ کیا کرے گا، لہٰذا اس بارے میں کسی چیز کا فیصلہ نہیں کیا جائے گا، باوجود اس کے کہ ہم جانتے ہیں کہ اس کی رحمت اس کے غضب پر سبقت لے گئی ہے، اور ہم جانتے ہیں کہ اللہ ہر نفس کو اس کے عمل کا بدلہ دے گا۔ اور اہل سعادت کے حق میں فضل (الفضل) پر دلیل قائم ہو چکی ہے، اور بدبختوں کے حق میں ایسی کوئی چیز نہیں آئی۔ اور یہ ایک ایسا مسئلہ ہے جہاں صاحبِ فکر رک جاتا ہے، یا غلبہ ظن سے حکم لگاتا ہے، مگر صاحبِ کشف (الکشف) قطعی حکم لگاتا ہے، کیونکہ وہ جانتا ہے جو اللہ نے اسے اس بارے میں بتایا ہے۔ تاہم، ابن قسی، جو اس شان کے اہل میں سے تھے، نے کہا: \"اس کا عدل اس کے فضل میں حکم نہیں کرتا، اور نہ ہی اس کا فضل اس کے عدل میں حکم کرتا ہے۔\" اور یہ ایک مجمل کلام ہے، پس میں نہیں جانتا کہ آیا اس نے یہ کشف (الکشف) سے کہا یا غور و فکر سے۔ اور یہ کلام ایک لحاظ سے اللہ تعالیٰ کے اس قول کے منافی ہے: \"میری رحمت میرے غضب پر سبقت لے گئی\"۔ اور ایک لحاظ سے منافی نہیں ہے، کیونکہ حقائق (الحقائق) یہ بتاتی ہیں کہ فضل (الفضل) عدل (العدل) میں حکم نہیں کرتا، اور عدل فضل میں حکم نہیں کرتا، کیونکہ دونوں نعتوں میں سے ہر ایک دوسرے کے حکم کا محل نہیں ہے۔ اور صفت کے حکم کا محل تو وہ ہے جس پر فضل کیا گیا ہو یا جس میں عدل کیا گیا ہو۔ اور ہم نے اللہ تعالیٰ سے یہ جان لیا ہے کہ اللہ اپنے بندوں کی ایک جماعت پر مغفرت کے ساتھ فضل کرتا ہے جنہوں نے شر کیا، اور ان پر میزانِ عدل قائم نہیں کیا، اور نہ ہی انہیں اپنے عدل سے پکڑا، بلکہ ان میں اپنے فضل سے حکم کیا۔ اور ایسے موقع پر یہ نہیں کہا جاتا کہ اس کے فضل نے اس کے عدل میں حکم کیا ہے۔ اور یہی وہ بات ہے جو ابن قسی رحمہ اللہ کے شایانِ شان ہے کہ انہوں نے ایک حقیقت کی خبر دی جیسا کہ وہ امر اپنی ذات میں ہے۔ اور اگر ہمارا کشف (الکشف) انبیاء علیہم السلام کے کشف کے خلاف ہو، تو رجوع انبیاء علیہم السلام کے کشف کی طرف ہو گا۔ اور ہم جانتے ہیں کہ اس کشف کے مالک پر خلل طاری ہوا ہے، اس وجہ سے کہ اس نے اپنے کشف پر اپنے فکر سے ایک قسم کی تاویل کا اضافہ کر دیا، پس وہ اپنے کشف پر قائم نہیں رہا، جیسے خواب دیکھنے والا۔ اس کا کشف صحیح ہوتا ہے اور وہ جو دیکھتا ہے اس کی خبر دیتا ہے، اور غلطی تعبیر میں ہوتی ہے نہ کہ نفسِ رویا میں۔ پس کشف (الکشف) کبھی غلطی نہیں کرتا، اور اس کے مدلول میں بات کرنے والا غلطی بھی کرتا ہے اور درست بھی، مگر یہ کہ وہ اس بارے میں اللہ کی طرف سے خبر دے۔\n\nبہرحال، عقلی علم (العلم العقلی) کا میزان دو قسم کا ہے۔ ایک وہ جسے عقل اپنے فکر سے پاتی ہے، اور اسے معانی میں منطق (المنطق) اور الفاظ میں نحو (النحو) کہا جاتا ہے۔ اور یہ ہمارے اہل (اہلِ کشف) کا راستہ نہیں ہے، یعنی ان الفاظ کے علم کا جو انہوں نے وضع کیے ہیں اور جو اس علم کی طرف لے جاتے ہیں، جیسے برہان وجودی (البرهان الوجودي)، جدلی، خطابی، کلیہ، جزئیہ، موجبہ، سالبہ، شرطیہ اور غیر شرطیہ۔ اگرچہ ہم معانی میں ان کے ساتھ متفق ہیں، اور معانی میں اتفاق ناگزیر ہے، لیکن معانی میں اتفاق سے یہ لازم نہیں آتا کہ وہ صرف ان الفاظ کے ذریعے ہی حاصل ہوں۔ اسی طرح ہمیں مبتدا، ابتداء، فاعل، مفعول، مضاف، مصدر، اضافت، اسم کان، اسم ان، اعراب اور بناء کی معرفت لازم نہیں، اگرچہ ہم معانی کو جانتے ہیں، لیکن ہمیں ان الفاظ کو جاننا لازم نہیں۔ پس صاحبِ کشف (صاحب الکشف) اپنے رب کی طرف سے بصیرت پر ہوتا ہے اس چیز میں جس کی طرف وہ اپنی مخلوق کو بلاتا ہے، لیکن عقل میں اس کے کمال کو قبول کرنے کی صلاحیت ہوتی ہے، جو فکر سے حاصل ہوتا ہے۔ اور اس قبولیت کے لیے کشف (الکشف) میں ایک میزان ہے جسے اس نے پہچان لیا ہے، پس وہ اسے ہر اس معلوم میں قائم کرتا ہے جسے عقل تنہا ادراک کر سکتی ہے، لیکن یہ ولی اسے فکر اور منطق (المنطق) کے میزان کے ذریعے نہیں جانتا۔\n\nپس عقلی علم کے میزان میں جو چیز ہمارے طریقے میں داخل ہوئی ہے، وہ یہ ہے کہ جب وہ علم وارد ہوتا ہے جو تقویٰ (التقوى) کے بعد حاصل ہوتا ہے، جیسا کہ اللہ تعالیٰ کا قول ہے: (وَاتَّقُوا اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ) \"اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے\" (البقرہ: ۲۸۲)۔ اور اس کا قول: (إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا) \"اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) بنا دے گا\" (الأنفال: ۲۹)۔ پس عارف اس وقت اپنے تقویٰ (التقوى) اور جن امور میں اس نے اللہ سے ڈر رکھا ہے، اور جس عمل پر وہ قائم تھا، اس پر غور کرتا ہے، اور اس علم پر غور کرتا ہے، اور اس علم اور اس عمل میں مناسبت قائم کرتا ہے۔ کیونکہ مناسبتوں کے میزان کبھی غلطی نہیں کرتے۔ پس جب وہ اس علم کے درمیان جو اس پر کھولا گیا ہے اور اس عمل کے درمیان جو وہ کرتا تھا، مکمل مناسبت دیکھتا ہے، اور دیکھتا ہے کہ وہ عمل اس علم کا تقاضا کرتا ہے، تو وہ علم اس کے عمل سے حاصل شدہ (مکتسب) ہے۔ اور اگر وہ اسے میزان سے باہر دیکھتا ہے، اور مناسبت ختم ہو جاتی ہے، یا جو اضافہ ہوا ہے وہ اسی جنس کا ہے جو حاصل ہوا تھا لیکن اس کا عمل کی قوت اس کا تقاضا نہیں کرتی تھی، عمل میں کمزوری یا نقص کی وجہ سے، تو جو کچھ اس مقدار سے زیادہ ہے وہ علومِ وہب (الوهب) (عطیہ) میں سے ہے۔ اگرچہ اس کی اصل کسب (کسب) میں موجود ہو۔ پس اس پر لازم ہے کہ وہ اللہ سبحانہ کا شکر ادا کرے اس عطا پر جو اس نے اسے بخشی ہے۔ پس یہ شکر اس عمل کی کمی کو پورا کر دے گا، جسے اگر وہ کرتا تو یہ وہبی علم اس کا نتیجہ ہوتا۔ پس یہ مسبب (نتیجہ) ہے جس کا سبب پہلے آ چکا ہے، بلکہ یہ اس چیز کا سبب بن گیا جس کا مسبب ہونا چاہیے تھا۔ اور اللہ اس شکر کی وجہ سے اس کے دل میں مزید کشف (الکشف) عطا کرتا ہے، اسی حد پر جو ہم نے ذکر کی ہے۔ اور تمام اعمال کو اسی طرح لیا جاتا ہے۔ پس یہ اس طریق میں عقلی میزان (الميزان العقلي) کی حد ہے۔ اور ہم نے اس بارے میں اختلاف کیا ہے کہ جب ولی کشف (الکشف) اور فتح کے ذریعے کوئی ایسا علم حاصل کرتا ہے جسے عقل تنہا ادراک کر سکتی ہے، تو کیا وہ اس کی دلیل کے ساتھ کھولا جاتا ہے یا نہیں؟ ہم اس طرف گئے ہیں کہ وہ علم تو کھولا جا سکتا ہے لیکن اس کی دلیل نہیں کھولی جاتی، اور ہم نے اس کا ذوق (تجربہ) کیا ہے۔ اور بعض لوگ، جن میں ہمارے ساتھی شیخ امام ابو عبد اللہ کتانی بھی شامل ہیں، جو فاس شہر میں تھے، میں نے انہیں کہتے سنا کہ: \"اس کے لیے دلیل کا کھولا جانا ضروری ہے، بغیر فکر کے، اور وہ اس کا اپنے مدلول کے ساتھ تعلق دیکھتا ہے۔\" پس میں نے کہا: \"وہ بھی اس کا ذوق کرے\"۔ پس ان کا یہ بتانا کہ انہوں نے اسے اسی طرح دیکھا، صحیح ہے، لیکن ان کا یہ حکم کہ یہ صرف اسی طرح ہو سکتا ہے، باطل ہے۔ کیونکہ ان کا حکم ان کے اپنے غور و فکر سے تھا نہ کہ ان کے کشف (الکشف) سے۔ کیونکہ انہوں نے اللہ کی طرف سے یہ خبر نہیں دی کہ اللہ نے ان سے کہا ہو کہ میں اسے اسی طرح کرتا ہوں۔ اور اس شان کے دوسرے لوگوں نے وہ چیز پائی ہے جس کی طرف ہم گئے ہیں، اور انہیں اس کی عقلی دلیل معلوم نہیں ہوئی۔ پس ہر ایک نے وہی خبر دی جو اس نے دیکھا، اور اپنی خبر میں سچا تھا۔ اور اس طریق میں کشف (الکشف) کی طرف سے کبھی غلطی نہیں ہوتی، لیکن غلطی اس کے فقہ (سمجھ) میں واقع ہوتی ہے جو کشف کیا گیا ہو، اگر وہ حروف یا صورتوں کا کشف ہو۔\n\nبہرحال، میزانِ شرعی (الميزان الشرعي) یہ ہے کہ جب اللہ تمہیں علومِ الٰہیہ میں سے کوئی علم عطا کرے، نہ کہ کسی اور علم میں سے، کیونکہ ہم اس خاص میزان میں غیر کو معتبر نہیں سمجھتے، تو ہم شریعت میں دیکھتے ہیں، اگر ہم خود عالم ہیں، ورنہ ہم علماءِ شرائع (علماء شریعت) میں سے محدثین سے پوچھتے ہیں، نہ کہ اہل الرائے سے۔ پس ہم ان سے کہتے ہیں: \"کیا تم نے کسی رسول سے یہ روایت کیا ہے کہ اس نے اللہ کی طرف سے ایسا ایسا کہا ہو؟\" اگر وہ کہیں: \"ہاں\"، تو تم اس کا موازنہ اس علم سے کرو جو تمہیں معلوم ہوا ہے اور جو تمہیں بتایا گیا ہے، اور جان لو کہ تم اس مسئلے میں اس نبی کے وارث ہو۔ یا یہ دیکھا جائے کہ کیا قرآن اس پر دلالت کرتا ہے؟ اور یہی جنید (الجنید) کا قول ہے: \"ہمارا یہ علم کتاب و سنت سے مقید ہے\"۔ پس یہی میزان ہے۔ اور اس میزان میں یہ لازم نہیں کہ عین مسئلہ کتاب یا سنت میں مذکور ہو، بلکہ قوم پر جو مطلوب ہے وہ یہ ہے کہ ان دونوں کو ایک ہی اصل شرعی جمع کرے جو کتاب یا سنت سے نازل ہوئی ہو، خواہ وہ آدم علیہ السلام سے لے کر محمد صلی اللہ علیہ وسلم تک کسی بھی نبی کی زبان پر ہو۔ کیونکہ بہت سے امور اولیاء پر کشف (الکشف) میں اور تعریفِ الٰہی میں وارد ہوتے ہیں جنہیں عقلیں قبول نہیں کرتیں اور انہیں رد کر دیتی ہیں۔ پس جب رسول یا نبی علیہ السلام انہیں لاتے ہیں تو وہ ایمان اور تاویل کے طور پر قبول کیے جاتے ہیں، اور کسی اور سے قبول نہیں کیے جاتے، اور یہ عدمِ انصاف کی وجہ سے ہے۔ کیونکہ جب اولیاء اس پر عمل کرتے ہیں جو ان کے لیے مشروع کیا گیا ہے، تو ان پر اس حضرۃِ الٰہیہ سے جودِ الٰہی (عطا) کی ایسی نفحات آتی ہیں کہ اللہ ان پر ان امورِ الٰہیہ کے حقائق کھول دیتا ہے جو انبیاء علیہم السلام سے قبول کیے گئے تھے۔ پس جب یہ ولی انہیں لاتا ہے تو اسے کافر قرار دیا جاتا ہے، حالانکہ جو اسے کافر قرار دیتا ہے وہ ان پر ایمان لاتا ہے جب رسول انہیں لاتا ہے۔ پس اس شخص کی بصیرت کتنی اندھی ہے! اور کم از کم یہ ہے کہ وہ اس سے کہے: \"اگر تمہاری بات حق ہے کہ تمہیں اس کا خطاب ہوا ہے یا تم پر یہ کشف ہوا ہے، تو اس کی تاویل ایسی ایسی ہے\"، اگر وہ اہل تاویل میں سے ہو۔ اور اگر وہ ظاہری ہے تو اسے کہے: \"نبوی خبر میں ایسی چیز وارد ہوئی ہے جو اس سے مشابہت رکھتی ہے\"۔ کیونکہ یہ نبوت کی شرط میں سے نہیں ہے، اور نہ ہی شارع نے اسے کتاب یا سنت میں محدود کیا ہے۔\n\nاور اسی باب میں، اسی منزل میں، انسان میزانِ الٰہی سے اپنا وزن جانتا ہے، اللہ کے اس قول میں: \"بے شک اللہ نے آدم کو اپنی صورت (صورۃ) پر پیدا کیا\" (حدیث)۔\n\nپس جودِ الٰہی (الجود الإلهي) نے اسے میزان میں داخل کر دیا، پس وہ اپنی صورت (صورۃ) سے ایک ایسی حضرۃ (حضور) کا موازنہ کرتا ہے جو ذات (ذات)، صفت (صفت) اور فعل (فعل) کے لحاظ سے موجود کرنے والی ہے۔ اور وزن سے یہ لازم نہیں آتا کہ دونوں موزون چیزوں کی حقیقت میں اشتراک ہو۔ کیونکہ جس سے ڈھلے ہوئے سونے کو تولا جاتا ہے وہ لوہے کا باٹ (صنجہ) ہوتا ہے، پس وہ نہ اپنی ذات میں، نہ اپنی صفت میں، اور نہ ہی اپنی تعداد میں اس سے مشابہت رکھتا ہے۔ پس یہ معلوم ہوتا ہے کہ انسانی صورت (الصورة الإنسانية) سے صرف وہی چیز تولی جاتی ہے جس کا تقاضا وہ صورت کرتی ہے، ان تمام اسماءِ الٰہیہ کے ساتھ جو اس کے وجود پر متوجہ ہوئے اور اپنے آثار اس میں ظاہر کیے۔ اور جس طرح لوہے کا باٹ سونے کے ساتھ نہ حد میں، نہ حقیقت میں، اور نہ ہی عین صورت میں مشابہت رکھتا تھا، اسی طرح بندہ بھی، اگرچہ اللہ نے اسے اپنی صورت (صورۃ) پر پیدا کیا، لیکن وہ نہ حد میں اور نہ حقیقت میں اس کے ساتھ جمع ہوتا ہے، کیونکہ اس کی ذات (ذات) کی کوئی حد نہیں ہے، اور انسان ایک ذاتی حد سے محدود ہے، نہ کہ رسمی یا لفظی حد سے۔ اور ہر مخلوق اسی حد پر ہے۔ اور انسان اپنی نشأت اور مرتبے کے لحاظ سے تمام مخلوقات میں سب سے کامل اور جامع ہے۔\n\nپس جب تم اس میزان (الميزان) کی حقیقت پر واقف ہو جاؤ گے، تو وہم دور ہو جائے گا جو تم نے صورت (الصورة) کے بارے میں کیا تھا کہ وہ بھی ذات ہے اور تم بھی ذات ہو، اور یہ کہ تم حی (زندہ) اور عالم (جاننے والے) اور دیگر صفات سے موصوف ہو اور وہ بھی ایسا ہی ہے۔ اور اس میزان سے تمہارے لیے واضح ہو جائے گا کہ صورت (الصورة) سے یہ مراد نہیں ہے۔ اسی لیے اس نے ایک ہی صورت میں جمع کیا: (خَلَقَ الْإِنْسَانَ) \"انسان کو پیدا کیا\" (الرحمن: ۳) اور (وَوَضَعَ الْمِيزَانَ) \"اور میزان قائم کیا\" (الرحمن: ۷)۔ اور تمہیں حکم دیا کہ اسے بغیر طغیان (زیادتی) اور خسارہ (کمی) کے قائم کرو۔ اور اس کا قیام صرف اسی حد پر ہے جو میں نے تمہیں بتائی ہے، کیونکہ وہ اللہ خالق ہے اور تم عبدِ مخلوق ہو۔ اور صنعت اپنے صانع کو کیسے جان سکتی ہے؟ صنعت تو صانع سے اس کے علم کی صورت کا تقاضا کرتی ہے، نہ کہ اس کی ذات کی صورت کا۔ اور تم اپنے خالق کی صنعت ہو، پس تمہاری صورت اس کے تمہارے بارے میں علم کی صورت کے مطابق ہے۔ اور ہر مخلوق اسی طرح ہے۔ اگر معاملہ ایسا نہ ہوتا، اور تمہیں اور اسے ایک حد اور حقیقت جمع کرتی، جیسا کہ زید اور عمرو کو جمع کرتی ہے، تو تم یا تو الٰہ ہوتے یا وہ مألوہ (معبود) ہوتا، تاکہ تمہیں ایک حد جمع کرے۔ اور معاملہ اس کے برعکس ہے۔ پس جان لو کہ تم اپنے رب کے ساتھ کس میزان سے اپنا وزن کرتے ہو، اور اپنے نفس پر تعجب نہ کرو۔ اور جان لو کہ تم لوہے کا باٹ ہو جس سے ایک بے مثال یاقوت کو تولا گیا ہے جس کی کوئی بہن نہیں ہے۔ اور اگر تم مقدار میں اس کے ساتھ جمع ہو بھی جاؤ، تو تم قدر میں، نہ ذات میں، اور نہ ہی خاصیت میں اس کے ساتھ جمع ہو سکتے ہو۔ اللہ تعالیٰ بلند و بالا ہے۔ پس اپنی عبودیت کو لازم پکڑو اور اپنی قدر پہچانو۔\n\n### [بے شک اللہ نے اپنی مخلوقات میں سے کچھ کو انسان سے بڑا بنایا ہے]\n\nاور جان لو کہ اللہ نے اپنی مخلوقات میں سے کچھ کو تم سے بڑا بنایا ہے، اگرچہ اس نے انہیں تمہاری خاطر پیدا کیا ہے۔ لیکن یہ لازم نہیں آتا کہ جب کوئی چیز تمہاری خاطر پیدا کی گئی ہو تو تم اس سے بڑے ہو۔ کیونکہ چاقو بعض امور کے لیے بنایا گیا ہے، جن میں سے ایک چور کا ہاتھ کاٹنا ہے۔ اور آگ انسان کے عذاب کے لیے پیدا کی گئی ہے۔ پس انسان آگ سے زیادہ اشرف ہے، کیونکہ وہ اس کے لیے پیدا کی گئی ہے۔ پس یہ قاعدہ ہر جگہ لاگو نہیں ہوتا، لہٰذا اسے اپنے میزان میں داخل نہ کرو۔ تم تم ہو اور وہ وہ ہے۔ (لَا إِلَهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ) \"اس کے سوا کوئی معبود نہیں، وہ غالب، حکمت والا ہے\" (آل عمران: ۶)۔ (لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ) \"کوئی چیز اس کے مثل نہیں، اور وہ سننے والا، دیکھنے والا ہے\" (الشوریٰ: ۱۱)۔ پس اس کے ذریعے میں نے تمہیں مشروع اور معقول علمی میزان (الميزان العلمي) اور اس کی ضرورت کے بارے میں بتا دیا ہے۔ اب ہم تمہارے لیے عملی میزان (الميزان العملي) بیان کرتے ہیں۔\n\n### [بے شک عمل یا تو حسی ہے یا قلبی]\n\nپس جان لو کہ عمل حسی (حسی) اور قلبی (قلبی) ہوتا ہے، اور اس کا میزان اس کی جنس سے ہے۔ عمل کا میزان یہ ہے کہ شریعت کو دیکھا جائے کہ اس نے اعمال کی صورتوں کو کس طرح ان کی کامل ترین غایات پر قائم کیا ہے، خواہ وہ عمل قلبی ہو یا حسی، یا حس اور قلب سے مرکب ہو، جیسے نیت (النیۃ) اور نماز جو حسی حرکات پر مشتمل ہے۔ پس شریعت نے اس کے لیے ایک روحانی صورت (الصورة الروحانية) قائم کی ہے جسے تمہاری عقل تھامتی ہے۔ پس جب تم عمل شروع کرو تو تمہاری نظر اس مثال پر ہونی چاہیے جو تم نے شارع (الشارع) سے لیا ہے، اور اس صورت کو قائم کرنے میں وہی عمل کرو جس کا تمہیں حکم دیا گیا ہے۔ جب تم اس سے فارغ ہو جاؤ تو اس کا موازنہ اس روحانی صورت سے کرو، جسے اس مثال سے تعبیر کیا گیا ہے جو تم نے شارع سے حاصل کیا ہے، عضو بہ عضو، جوڑ بہ جوڑ، ظاہر اور باطن میں۔ اگر وہ صورت بغیر کسی کمی یا زیادتی کے مکمل مطابقت کے حکم پر آئی، تو تم نے وزن کو انصاف (القسط) کے ساتھ قائم کیا، اور نہ اس میں زیادتی کی اور نہ کمی کی۔ کیونکہ حد میں زیادتی عین محدود میں کمی ہے۔\n\nپس جب تم اپنے عمل کو اس طرح تولو گے، تو تمہارے عمل کی صورت اس جزا (الجزاء) کی مقدار ہو گی جو حق نے تمہارے لیے اس پر مقرر کی ہے، خواہ وہ عمل محمود ہو یا مذموم۔ کیونکہ شریعت نے جس طرح تمہارے لیے محمود عمل کی صورت قائم کی ہے تاکہ تم اسے کرو اور تمہیں اسے جاننے کے لیے بیان کیا ہے، اسی طرح تمہارے لیے مذموم عمل کی صورت بھی قائم کی ہے تاکہ تم اسے جانو اور اسے محمود سے ممتاز کرو، اور تمہیں منع کیا ہے کہ تم اس پر کوئی ایسی صورت عمل کرو جو اس کے مطابق ہو۔ پس اگر تم نے مخالفت کی اور ایک ایسی صورت عمل کی جو اس صورت کے مطابق ہو، تو وہ صورت جزا (الجزاء) سے اپنے موازنے کا مطالبہ کرے گی۔ اگر حق نے اسے جزا کے ساتھ میزان میں داخل کیا، تو وہ مقدار میں ایک ذرہ بھی اس پر اضافہ نہیں کرے گا۔ یہ تب ہے جب وہ اس پر جزا کے ساتھ وزن قائم کرے، اور اس کا عذاب جہنم میں اس کے عمل کے بقدر ہو، نہ عمل میں اور نہ زمانے کی مقدار میں کوئی کمی یا زیادتی ہو۔\n\nاور اصرار (الإصرار) ان اعمال میں سے ہے جن کے کرنے سے منع کیا گیا ہے، اور توبہ کے سوا کوئی چیز اسے زائل نہیں کرتی۔ پس اگر وہ اس پر مر گیا تو اس کے بارے میں خوف کیا جائے گا اور قطعی حکم نہیں لگایا جائے گا۔ اور جب حق صالح عمل کی صورت کو میزان میں داخل کرتا ہے اور اسے جزا کی صورت سے تولتا ہے، تو جزا کی صورت کئی گنا زیادہ ترجیح پا جاتی ہے، اور اللہ کی طرف سے احسان اور فضل (الفضل) کے طور پر حد اور مقدار سے باہر نکل جاتی ہے۔ اور یہی اللہ تعالیٰ کا قول ہے: (مَنْ عَمِلَ سَيِّئَةً فَلَا يُجْزَى إِلَّا مِثْلَهَا) \"جس نے برائی کی تو اسے صرف اسی کے مثل بدلہ دیا جائے گا\" (الأنعام: ۱۶۰)، جیسا کہ ہم نے ذکر کیا۔ اور دوسری جگہ فرمایا: (مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا) \"جو نیکی لائے گا تو اس کے لیے دس گنا ہے\" (الأنعام: ۱۶۰)۔ اور فرمایا: (مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ) \"جو لوگ اپنا مال اللہ کی راہ میں خرچ کرتے ہیں، ان کی مثال اس دانے کی سی ہے جس نے سات بالیں اگائیں، اور ہر بال میں سو دانے ہوں، اور اللہ جسے چاہتا ہے بڑھا دیتا ہے\" (البقرہ: ۲۶۱)۔ اور اس نے خیر میں تضعیف (بڑھانے) کے لیے کوئی ایسی مقدار مقرر نہیں کی جہاں رک جایا جائے، بلکہ اس نے اپنی ذات کو وسعت سے موصوف کیا، چنانچہ فرمایا: (وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ) \"اور اللہ جسے چاہتا ہے بڑھا دیتا ہے، اور اللہ وسعت والا، جاننے والا ہے\" (البقرہ: ۲۶۱)۔ اور فرمایا: (إِنَّ رَبَّكَ وَاسِعُ الْمَغْفِرَةِ) \"بے شک تیرا رب وسیع مغفرت والا ہے\" (النجم: ۳۲)۔ اور اس کا غضب ایک شے ہے، پس رحمت نے اسے گھیر لیا ہے اور اسے محدود کر دیا ہے، اور اس پر اپنا حکم جاری کر دیا ہے۔ پس وہ صرف رحمت کے حکم سے ہی تصرف کرتا ہے۔ وہ اسے جب چاہے بھیجتی ہے، اور اس میں منزل کی وجہ سے رحمت کی خوشبو ہوتی ہے، اور جب چاہے اسے روک لیتی ہے۔ اسی لیے بسم اللہ میں ظاہری طور پر قہر (القہر) کے اسماء میں سے کوئی نہیں ہے، بلکہ وہ اللہ الرحمن الرحیم ہے، اگرچہ اسم اللہ (اللہ) قہر (القہر) کو بھی شامل ہے، اسی طرح وہ رحمت کو بھی شامل ہے۔ پس اس میں قہر، غلبہ اور شدت کے جو اسماء ہیں، ان کا مقابلہ اس میں موجود رحمت، مغفرت، عفو اور صفح (درگزر) سے کیا جاتا ہے، بسم اللہ کے اسم اللہ میں وزن بہ وزن۔ اور جو کچھ ہم نے اسم اللہ میں اسماء کا مقابلہ کیا ہے، اس کے علاوہ ہمارے لیے ایک زائد فضل باقی رہتا ہے، اور وہ اس کا قول ہے: (الرَّحْمَنِ الرَّحِيمِ)۔ پس اس نے عین رحمن اور عین رحیم کو اسم اللہ میں موجود رحمت سے باہر زائد طور پر ظاہر کیا۔ پس اس نے وزن میں اضافہ کیا اور وہ غالب آ گیا۔ پس اللہ نے ہمیں اس چیز سے آگاہ کیا جو وہ اپنی مخلوق میں حکم کرتا ہے، اور یہ کہ رحمت جو بسم اللہ کے اسم اللہ الجامع میں ہے، وہ اس کی باطنوں پر رحمت ہے، اور جو (الرَّحْمَنِ الرَّحِيمِ) میں ظاہر ہے، وہ اس کی ظاہروں پر رحمت ہے۔ پس یہ عام ہو گئی، لہٰذا سب کے لیے امید بڑی ہو گئی۔\n\nاور قرآن کی کوئی سورت ایسی نہیں جس کے شروع میں بسم اللہ نہ ہو، پس ہم نے اس کی تاویل یہ کی کہ یہ اللہ کی طرف سے رحمت کی طرف انجام کی اطلاع ہے۔ کیونکہ اس نے رحمت کو تین بنایا: اسم اللہ میں پوشیدہ رحمت، اور رحمن اور رحیم۔ اور اس نے قہر (القہر) کے لیے صرف اسم اللہ میں پوشیدہ چیز کو رکھا ہے، پس اس کی کوئی موجود عین نہیں ہے، جیسے طلاق میں کنایہ ہوتا ہے جس میں انسان نیت کرتا ہے، برخلاف صریح کے۔ پس سمجھو۔ اور سورۃ التوبہ کے بارے میں لوگوں نے اختلاف کیا ہے کہ آیا یہ قرآن کی دیگر سورتوں کی طرح ایک مستقل سورت ہے، یا یہ اور سورۃ الانفال ایک ہی سورت ہیں؟ کیونکہ وہ سورت کی تکمیل کو صرف بسم اللہ کے ذریعے فصل سے پہچانتے تھے، اور یہاں بسم اللہ نہیں آئی، پس یہ دلالت کرتا ہے کہ یہ سورۃ الانفال کا حصہ ہے، اور یہی زیادہ مناسب ہے۔ اگرچہ اس کے ترک کرنے کی بھی ایک وجہ ہے، اور وہ رحمت اور براءت (اعلانِ لاتعلقی) کے درمیان عدمِ مناسبت ہے۔ لیکن اس وجہ میں وہ قوت نہیں ہے، بلکہ یہ ایک کمزور وجہ ہے۔ اور اس کی کمزوری کا سبب یہ ہے کہ اسم اللہ میں، جو تمام اسماء سے موصوف ہے، وہ چیز موجود ہے جو کسی خاص اسم میں نہیں ہے جو مؤاخذہ کا تقاضا کرے۔ اور براءت (اعلانِ لاتعلقی) صرف شریک سے ہوتی ہے۔ اور جب وہ مشرک سے براءت کرتا ہے، تو یہ اس کے مشرک ہونے کی وجہ سے ہے، کیونکہ اس کا تعلق عدم سے ہے۔ کیونکہ خالق مخلوق سے براءت نہیں کرتا، اگرچہ وہ اس سے براءت کرے جو اس کے وجود کو محفوظ رکھتا ہے۔ اور شریک کا کوئی وجود نہیں ہے، پس شریک معدوم ہے۔ پس نفسِ امر میں کوئی شرکت نہیں ہے۔ پس جب شریک سے براءت صحیح ہو گئی، تو یہ اللہ کے لیے شریک سے تنزیہ اور براءت کی صفت ہے، اور رسول کے لیے جہالت کے اعتقاد سے براءت ہے۔ اور اس تاویل کی کمزوری کی ایک اور وجہ یہ ہے جو ہم نے ذکر کی، اور وہ یہ کہ بسم اللہ ہر اس سورت میں موجود ہے جس کا آغاز \"ویل\" (ہلاکت) سے ہوتا ہے، اور رحمت کا ویل سے کیا تعلق؟ اسی لیے قراء کے لیے ایسی سورتوں میں ایک مستحسن مذہب ہے، ان قراء کے لیے جو بسم اللہ کو ثابت کرتے ہیں، اور ان کے لیے جو اسے ترک کرتے ہیں، جیسے قراءت حمزہ، اور ان کے لیے جو اس میں اختیار دیتے ہیں، جیسے قراءت ورش، اور ان کے نزدیک بسم اللہ کا اثبات زیادہ راجح ہے۔ پس ہم نے اپنی قراءت میں حرف حمزہ کے ساتھ ان دونوں مقامات پر اسے ثابت کیا ہے، کیونکہ ان میں قراءت کے ساتھ وصل کا قبح ہے، اور وہ یہ کہ وہ کہے: (وَالْأَمْرُ يَوْمَئِذٍ لِلَّهِ وَيْلٌ) \"اور اس دن حکم اللہ ہی کا ہو گا، ہلاکت ہے\"۔ پس انہوں نے یہاں بسم اللہ پڑھی۔ اور اس میں ہمارا مذہب یہ ہے کہ سورت کے آخر پر وقف کیا جائے، اور بسم اللہ کے آخر پر وقف کیا جائے، اور سورت کو بغیر وصل کے شروع کیا جائے۔ اور اس فصل میں قراءت کے چار مذاہب ہیں۔ پہلا مذہب جسے وہ بالکل نہیں مانتے، وہ یہ ہے کہ سورت کے آخر کو بسم اللہ سے ملا کر وقف کرے اور پھر سورت شروع کرے۔ اسے علماءِ قراء میں سے کوئی بھی پسند نہیں کرتا۔ اور میں نے عجم کے لوگوں کو، یعنی فارس کے لوگوں کو، ایسا کرتے دیکھا ہے، جسے علماءِ اداء (قراءت کے ماہرین) پسند نہیں کرتے۔ اور دوسرا مستحسن مذہب جسے سب نے پسند کیا ہے، اور میں قراء میں سے کسی مخالف کو نہیں جانتا، وہ یہ ہے کہ سورت کے آخر پر وقف کیا جائے اور بسم اللہ کو اس سورت کے شروع سے ملا دیا جائے جو آگے آ رہی ہے۔ اور باقی دو مذاہب، جو اس سے کم مستحسن ہیں، یہ ہیں کہ سب میں قطع کیا جائے یا سب میں وصل کیا جائے۔ اور سب کا اس پر اجماع ہے کہ سورت کے شروع میں قراءت شروع کرتے وقت تعوذ اور بسم اللہ سے ابتدا کی جائے۔ اور قراء کی جماعت کا سورۃ الفاتحہ میں بسم اللہ کی قراءت پر بلا اختلاف اجماع ہے۔ اور انہوں نے قرآن کی باقی سورتوں میں اختلاف کیا ہے، جب تک کہ ان میں سے کوئی سورت کا آغاز نہ کرے۔ پس ان میں سے بعض نے اختیار دیا ہے، جیسے ورش، اور بعض نے ترک کیا ہے، جیسے حمزہ، اور بعض نے بسم اللہ پڑھی اور اختیار نہیں دیا، جیسے باقی قراء۔ اور اس بسم اللہ کے اختیار، ترک اور عدمِ ترک کے عجیب و غریب احکام ہیں جن کے ذکر کے لیے وقت نہیں ہے، اور اس لیے بھی کہ یہ اس باب کے مقصود سے خارج ہیں۔ اور یہ ایک آیت ہے جہاں بھی واقع ہو، سوائے سورۃ النمل میں سلیمان علیہ السلام کے خط میں، کیونکہ وہ آیت کا بعض حصہ ہے، اور میں اس میں کوئی اختلاف نہیں جانتا۔ پس میں نے تمہیں علمی اور عملی میزان (الميزان العملي والعلمي) کے بارے میں اختصار اور تقریب کے ساتھ بتا دیا ہے۔ اب ہم تمہیں ان امور کے بارے میں بتاتے ہیں جو یہ منزل اپنے اندر رکھتی ہے اور جن کا ہم نے طوالت کے خوف سے ذکر نہیں کیا۔\n\nپس جان لو کہ یہ منزل ان میزانوں کی علتوں (علل الموازين) کے علم کو شامل ہے جن کا ہم نے ذکر کیا ہے۔ اور اس میں رب کے لیے تعظیم کے مستحق ہونے کا علم ہے۔ اور اس میں علمِ آخرت (علم الآخرة) ہے جو دنیا اور لوگوں کے جنت اور جہنم میں اپنی منزلوں میں اترنے کے درمیان ہے۔ اور اس میں علمِ بعث (علم البعث) ہے۔ اور اس میں بدبختوں اور سعادت مندوں کی بعض منزلوں کا علم ہے۔ اور اس میں سورتوں کا علم ہے۔ اور اس میں اصطلام (مغلوبیت) کا علم ہے۔ اور اس میں عالمِ علوی، سفلی، طبعی اور روحانی کے مراتب کا علم ہے۔ اور اس میں قربت (القربة) کی منزل ہے، اور اس بارے میں ہمارا ایک لطیف جزو ہے۔ اور اس میں علمِ مفاضلہ (علم فضیلت) ہے۔ اور اس میں جزا کے موازنے کا علم ہے۔ اور اس میں تخلیص (خالص کرنا) اور امتزاج (ملانا) کا علم ہے۔ اور اس میں اس وصف کی معرفت ہے جس سے کسی نبی کا متصف ہونا مناسب نہیں، اور اس سے ولی کی عصمت، اور یہ ایک نایاب چیز ہے۔ اور اس میں اس چیز کا علم ہے جسے دنیا میں ناپسند کیا جاتا ہے اور اس کے کرنے والے سے نفرت کی جاتی ہے، حالانکہ وہی فعل بعینہ آخرت میں محبوب ہو گا۔ اور (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (الأحزاب: ۴)۔",
    "fa": "«باب سیصد و یکم در معرفت منزل کتاب تقسیم شده میان اهل نعیم و اهل عذاب»\n\nهمانا مقرب کسی است که سرشتش *** سرشت نیکوکاری باشد، در حالی که نیکان او را نشناسند\nقرب (القرب) منزل کسی است که هیچ چیز *** عیناً شبیه آن نیست، کسی که او را در آن منزل جای داده است\nاجمال آن از قداست و منزلت بالا رفته است *** و هیچ زبانی برای مخلوقی نیست که آن را تفصیل دهد\nهمانا عوالم را با میزان (المیزان) درک می‌کنی *** پس نه زیاده‌روی کن و نه کوتاهی تا آن را رها سازی\nقرب (القرب) امری اضافی است، پس بسا آزاری *** که خوراک جانی باشد که آن را از او می‌خواهد\nپس اگر صاحب کرم است، خواسته‌اش را به او بدهد *** و از بخل بپرهیزد، زیرا بخل او را می‌کشد\nهمانا عذابی که از نزدیک به تو می‌رسد *** تو در دنیای خود آن را بر دیگری نازل می‌کردی\nو کسی که آنچه را انجام می‌داده به او برسد *** چگونه آن را انکار کند یا چگونه آن را نشناسد؟\n\nخداوند عز و جل فرمود: «الرَّحْمنُ عَلَّمَ الْقُرْآنَ» (خداوند رحمان، قرآن را تعلیم داد)؛ بر کدام قلب نازل می‌شود؟ «خَلَقَ الْإِنْسانَ» (انسان را آفرید)؛ پس نوعی را که قرآن بر او نازل می‌شود، مشخص کرد. «عَلَّمَهُ الْبَيانَ» (بیان را به او آموخت)؛ یعنی قرآن بر او نازل شد و از مراد غیبی پرده برداشت. «الشَّمْسُ والْقَمَرُ بِحُسْبانٍ» (خورشید و ماه بر اساس حساب و نظمی در حرکتند)؛ این میزان حرکات افلاک است. «وَ النَّجْمُ والشَّجَرُ يَسْجُدانِ» (و گیاه و درخت سجده می‌کنند)؛ برای این میزان، یعنی به خاطر این میزان. پس برخی ساق دارند که شجر (درخت) است و برخی ساق ندارند که نجم (گیاه) است، از این رو دو نوع سجده متفاوت است. «وَ السَّماءَ رَفَعَها» (و آسمان را برافراشت)؛ که گنبد میزان است. «وَ وَضَعَ الْمِيزانَ» (و ترازو را نهاد)؛ تا با آن دو موجود سنگین (جن و انس) را وزن کند. «أَلَّا تَطْغَوْا في الْمِيزانِ» (تا در میزان تجاوز نکنید)؛ با افراط و تفریط که موجب خسران (الخسران) می‌شود. «وَ أَقِيمُوا الْوَزْنَ بِالْقِسْطِ» (و وزن را به عدل برپا دارید)؛ مانند اعتدال سرشت انسان، زیرا انسان زبان میزان است. «وَ لا تُخْسِرُوا الْمِيزانَ» (و در میزان کم نگذارید)؛ یعنی با ترجیح دادن یکی از دو کفه، مگر به فضل، کوتاهی نکنید. و خداوند متعال فرمود: «وَنَضَعُ الْمَوازِينَ الْقِسْطَ» (و ترازوهای عدل را برپا می‌داریم).\n\n### [هیچ صنعت و هیچ مرتبه‌ای نیست مگر آنکه وزن، حاکم بر آن است، چه در علم و چه در عمل]\n\nپس بدان که هیچ صنعت، مرتبه، حال و مقامی نیست مگر آنکه وزن (الوزن) حاکم بر آن است، چه از نظر علم و چه از نظر عمل. برای معانی میزانی در دست عقل است که منطق نامیده می‌شود و شامل دو کفه است که مقدمات نامیده می‌شوند. برای کلام میزانی است که نحو نامیده می‌شود و با آن الفاظ وزن می‌شوند تا معانی‌ای که الفاظ آن زبان بر آن‌ها دلالت می‌کنند، محقق شوند. و برای هر صاحب زبانی میزانی است که همان مقدار معلومی است که خداوند آن را با نزول روزی‌ها قرین ساخت و فرمود: «وَ ما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ» (و ما آن را نازل نمی‌کنیم مگر به اندازه‌ای معلوم) و «وَلَكِنْ يُنَزِّلُ بِقَدَرٍ ما يَشاءُ» (بلکه به اندازه‌ای که بخواهد نازل می‌کند). و جسد انسان را به صورت میزان آفرید و دو کفه‌اش را دست راست و چپ او قرار داد و زبانه‌اش را قائم به ذات او ساخت، پس به هر سمتی که متمایل شود، همان است. و خداوند سعادت را با سمت راست و شقاوت را با سمت چپ قرین ساخت. و میزانی که اعمال با آن وزن می‌شوند را به شکل قپان (القبان) قرار داد. به همین دلیل به سنگینی و سبکی توصیف شد تا میان میزان عددی که همان فرموده خداوند متعال است: «بِحُسْبانٍ» (بر اساس حساب) و آنچه با رطل وزن می‌شود، جمع کند، و این جز در قپان ممکن نیست. از این رو، دو کفه را مشخص نکرد، بلکه فرمود: «فَأَمَّا مَنْ ثَقُلَتْ مَوازِينُهُ» (اما کسی که میزان‌هایش سنگین باشد) در حق سعادتمندان، و «وَ أَمَّا مَنْ خَفَّتْ مَوازِينُهُ» (و اما کسی که میزان‌هایش سبک باشد) در حق شقاوتمندان. اگر میزان دو کفه داشت، می‌فرمود: اما کسی که کفه حسناتش سنگین باشد، چنین است، و اما کسی که کفه سیئاتش سنگین باشد، چنان است. در واقع، میزان سنگینی همان عین میزان سبکی قرار داده شده است، مانند شکل قپان. و اگر دو کفه داشت، کفه سیئات نیز در صورت ترجیح بر حسنات، به سنگینی توصیف می‌شد، در حالی که هرگز جز به سبکی توصیف نشده است. پس دانستیم که میزان به شکل قپان است. و از جمله میزان الهی، فرموده خداوند متعال است: «أَعْطى كُلَّ شَيْ‏ءٍ خَلْقَهُ» (به هر چیزی خلقتش را عطا کرد). و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «من و ابوبکر وزن شدیم، من ترجیح یافتم، و ابوبکر با امت وزن شد، او بر امت ترجیح یافت!»\n\n### [امر در علم و عمل محصور است]\n\nو بدان که امر در علم و عمل محصور است. و عمل بر دو بخش است: حسی و قلبی. و علم بر دو بخش است: عقلی و شرعی. و هر بخش بر وزنی معلوم نزد خداوند است، چه در اعطای آن و چه در طلب از بنده، زیرا او مکلف شده است که وزن را به عدل (القسط) برپا دارد، پس در آن طغیان نکند و آن را زیان نرساند. خداوند متعال فرمود: «لا تَغْلُوا في دِينِكُمْ» (در دین خود غلو نکنید) که همان معنای «أَلَّا تَطْغَوْا في الْمِيزانِ» (در میزان تجاوز نکنید) است، و «وَ لا تَقُولُوا عَلَى الله إِلَّا الْحَقَّ» (و بر خدا جز حق نگویید) که همان فرموده «وَ أَقِيمُوا الْوَزْنَ بِالْقِسْطِ» (و وزن را به عدل برپا دارید) است. پس عدل را از بندگانش در تعامل با خدا و با هر آنچه غیر خداست، از خودشان و دیگران، طلب کرده است. پس اگر خداوند بنده را به برپایی وزن موفق سازد، هیچ خیری برای او باقی نمی‌گذارد مگر آنکه به او عطا می‌کند. زیرا خداوند سلامتی و عافیت را در اعتدال طبایع قرار داده است و اینکه هیچ یک بر دیگری ترجیح نیابد، و علل، بیماری‌ها و مرگ را در ترجیح یافتن برخی بر برخی دیگر قرار داده است. پس اعتدال سبب بقا (البقاء) و انحراف سبب هلاکت و فنا (الفناء) است. و ترجیح میزان در جایگاه خود، برپایی آن است، و سبکی میزان در جایگاه خود، برپایی آن است. پس این امر بسته به مقامات است. و چون امر بر آنچه مقرر کردیم، استوار است.\n\n### [همانا محقق کسی است که این میزان را بر حسب آنچه از ترجیح اقتضا می‌کند، برپا می‌دارد]\n\nپس بدان که محقق (المحقق) کسی است که این میزان را در هر حضرت (حضرة) از علم و عمل، بر حسب آنچه از ترجیح و سبکی در موزون، به فضل در جایگاه خود و استحقاق، برپا می‌دارد.\n\nزیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در قضای دین و گرفتن بها، به ترجیح تشویق کرد و فرمود: «هنگامی که برایش وزن کرد، برای او ترجیح داد.»\n\nپس آنچه خارج از استحقاق او، به عین میزان، به او عطا شده است، فضل است و داخل میزان نمی‌شود، زیرا میزان در اصل وضع خود، تنها برای عدل وضع شده است نه برای ترجیح. و هر ترجیحی که در آن وارد شود، تنها از باب فضل است. و خداوند هرگز ترجیح در شر را به طور کلی تشریع نکرده است، بلکه فرمود: «وَ الْجُرُوحَ قِصاصٌ» (و زخم‌ها قصاص دارند) و فرمود: «وَ جَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها» (و جزای بدی، بدی‌ای مانند آن است) و نفرمود: بیشتر از آن. و فرمود: «فَمَنِ اعْتَدى‏ عَلَيْكُمْ فَاعْتَدُوا عَلَيْهِ بِمِثْلِ ما اعْتَدى‏ عَلَيْكُمْ» (پس هر کس بر شما تجاوز کرد، شما نیز به همان اندازه که بر شما تجاوز کرده، بر او تجاوز کنید) و نفرمود: بیشتر. «فَمَنْ عَفا وَ أَصْلَحَ فَأَجْرُهُ عَلَى الله» (پس هر کس عفو کند و اصلاح نماید، پاداش او بر عهده خداست)؛ پس در انعام ترجیح داد. و خداوند بندگانش را به هیچ فضیلت و خلق کریمی تشویق نکرد، مگر آنکه جناب الهی اعلی به آن سزاوارتر بود. و این از سبقت رحمت او بر غضب اوست. پس اهل آتش به عدل و بدون هیچ افزایشی در آن وارد می‌شوند، و اهل بهشت به فضل در آن وارد می‌شوند، پس نعمتی را می‌بینند که اعمالشان مقتضی آن نیست، و اهل آتش از عذاب جز به اندازه اعمالشان، بدون هیچ افزایش و ترجیحی، نمی‌بینند، تا زمانی که خداوند پس از آن هر چه بخواهد با آنان انجام دهد. به همین دلیل در مورد عذابشان فرمود: «إِنَّ رَبَّكَ فَعَّالٌ لِما يُرِيدُ» (همانا پروردگار تو هر چه بخواهد انجام می‌دهد). و هیچ یک از خلق خدا حکم اراده خدا را در خلقش نمی‌داند مگر به تعریف او. آیا نمی‌بینی که در حق سعادتمندان می‌فرماید: «عَطاءً غَيْرَ مَجْذُوذٍ» (عطایی بی‌منت و بی‌انقطاع)؟ در حالی که صورت و مدت یکی است. و در مورد عذاب نفرمود که بی‌انقطاع است، اما قطعاً می‌گوید که آنان از آتش خارج نمی‌شوند و حالتشان را در آنجا در حال استثناء (آنچه خدا در موردشان انجام می‌دهد) نمی‌داند. پس در این باره به چیزی حکم نمی‌شود، با وجود علم ما به اینکه رحمت او بر غضبش سبقت گرفته است، و علم ما به اینکه خداوند هر نفسی را به آنچه عمل کرده است، جزا می‌دهد. و دلیل بر فضل در مورد اهل سعادت اقامه شده است، در حالی که چنین چیزی در مورد شقاوتمندان نیامده است. و این مسئله‌ای است که صاحب فکر در آن متوقف می‌شود یا با غلبه ظن حکم می‌کند، اما صاحب کشف (الکشف) با قطعیت حکم می‌کند، زیرا او آنچه را که خداوند به او آموخته است، می‌داند. با این حال، ابن قسی که از اهل این شأن است، گفت: «عدل او در فضل او حکم نمی‌کند و فضل او در عدل او حکم نمی‌کند.» و این کلامی مجمل است، پس نمی‌دانم که آیا آن را از روی کشف (الکشف) گفته است یا از روی اعتبار و فکر. و این کلام از یک جهت با فرموده خداوند متعال که «رحمتم بر غضبم سبقت گرفته است» منافات دارد.\n\nو از جهتی منافات ندارد، زیرا حقایق (الحقائق) اقتضا می‌کنند که فضل در عدل حکم نکند و عدل در فضل حکم نکند، زیرا هر یک از این دو صفت، محل حکم دیگری نیست. و محل حکم صفت، تنها در مورد مفضول علیه یا معدول فیه است. و ما از خداوند متعال دانسته‌ایم که خداوند بر گروهی از بندگانش که شر انجام داده‌اند، با مغفرت تفضل می‌کند و میزان عدل را بر آنان اقامه نمی‌کند و آنان را به عدل خود مؤاخذه نمی‌کند، بلکه در مورد آنان به فضل خود حکم می‌کند. و در چنین موردی گفته نمی‌شود که فضل او در عدل او حکم کرده است. و این همان چیزی است که شایسته ابن قسی (رحمه الله) است که از حقیقتی خبر داده است، همان‌گونه که امر در نفس خود بر آن است. و اگر کشف (الکشف) ما با کشف انبیا (علیهم السلام) مخالفت کند، بازگشت به کشف انبیا (علیهم السلام) است. و می‌دانیم که صاحب آن کشف، دچار خللی شده است به این دلیل که نوعی تأویل را با فکر خود بر کشفش افزوده است و بر کشف خود متوقف نشده است، مانند صاحب رؤیا؛ زیرا کشف او صحیح است و از آنچه دیده خبر می‌دهد، اما خطا در تعبیر رخ می‌دهد نه در نفس آنچه دیده است. پس کشف هرگز خطا نمی‌کند، اما متکلم در مدلول آن خطا می‌کند و درست می‌گوید، مگر اینکه در آن باره از جانب خدا خبر دهد. اما میزان علم عقلی (العلم العقلی) بر دو بخش است: بخشی که عقل با فکر خود آن را درک می‌کند و در معانی منطق و در الفاظ نحو نامیده می‌شود. و این راه اهل این شأن نیست، یعنی علم به آنچه از الفاظ که برای رسیدن به علم از طریق برهان وجودی، جدلی، خطابی، کلی، جزئی، موجبه، سالبه، شرطیه و غیر شرطیه وضع کرده‌اند. اگرچه ما با آنان در معانی مشترک هستیم و ناگزیر از اشتراک در آن هستیم، اما اشتراک در معنی مستلزم آن نیست که آن معنی تنها از طریق این الفاظ حاصل شود. همچنین ما ملزم به شناخت مبتدا، ابتداء، فاعل، مفعول، مضاف، مصدر، اضافه، اسم کان، اسم إن، اعراب و بناء نیستیم، اگرچه معانی را می‌دانیم، اما لازم نیست که این الفاظ را بشناسیم. پس صاحب کشف (الکشف) در آنچه خلق را به آن دعوت می‌کند، بر بصیرتی از پروردگار خویش است. اما عقل قابلیت کمال فکری دارد و برای آن قابلیت در کشف (الکشف) میزانی وجود دارد که آن را شناخته است و در هر معلومی که عقل مستقلاً آن را درک می‌کند، برپا می‌دارد، اما این ولی آن را از طریق فکر و میزان منطق نمی‌داند. پس آنچه از میزان علم عقلی (العلم العقلی) وارد طریق ما شده است، این است که اگر علمی که به دنبال تقوا (التقوی) حاصل می‌شود، از فرموده خداوند متعال: «وَ اتَّقُوا الله وَ يُعَلِّمُكُمُ الله» (و از خدا پروا کنید و خدا به شما می‌آموزد) و از فرموده: «إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً» (اگر از خدا پروا کنید، برای شما فرقان قرار می‌دهد) وارد شود، عارف در آن هنگام به تقوای خود و آنچه در آن از امور پرهیز کرده است و عملی که بر آن بوده است، می‌نگرد. و به آن علم می‌نگرد و میان آن و تقوای خود در عملی که بر آن بوده است، تناسب برقرار می‌کند. زیرا میزان‌های تناسبات خطا نمی‌کنند. پس اگر تناسب را میان علم مفتوح شده بر او و آن عمل محقق دید و دید که آن عمل، آن علم را می‌طلبد، پس آن علم به واسطه عملش برای او کسب شده است. و اگر آن را خارج از میزان دید و تناسب از بین رفت، یا آنچه اضافه شده از جنس آنچه حاصل شده باشد، اما قوت عمل او به دلیل ضعف یا نقصی در عملش، مقتضی آن نباشد، پس آنچه بر این مقدار افزوده شده، از علوم وهبی است، اگرچه اصلی در کسب داشته باشد. پس بر او واجب است که خداوند سبحان را بر آنچه به او بخشیده است، شکر کند.\n\nپس آن شکر، نقص عمل او را جبران می‌کند، عملی که اگر آن را انجام می‌داد، این موهبت برای او نتیجه می‌شد. پس این مسبب، سبب خود را پیش انداخته است، بلکه خود سبب چیزی شده است که می‌بایست مسبب از آن باشد. و خداوند به خاطر آن شکر، فتحی در قلب او بر حدی که ذکر کردیم، می‌افزاید. و تمام اعمال بر همین اساس سنجیده می‌شوند. پس این حد میزان عقلی در طریق است. و در مورد آنچه عقل مستقلاً آن را درک می‌کند، اگر ولی آن را از طریق کشف (الکشف) و فتح بگیرد، اختلاف کردیم که آیا دلیل آن نیز بر او گشوده می‌شود یا خیر؟ ما بر این عقیده‌ایم که ممکن است در آن علم بر او گشوده شود، اما در دلیل آن گشوده نشود، و ما آن را چشیده‌ایم. و برخی از آنان، از جمله دوست ما شیخ امام ابوعبدالله کتانی در شهر فاس، بر این عقیده‌اند. از او شنیدم که می‌گفت: حتماً باید دلیل نیز بدون فکر بر او گشوده شود و ارتباط آن را با مدلولش ببیند. پس دانستم که خداوند بر او در چنین علمی جز بر این حد فتح نکرده است. او همچنین گفت: ذوق او صحیح است و خبری که می‌دهد که چنین دیده است، درست است، اما حکم او که «حتماً باید این‌گونه باشد» باطل است، زیرا حکم او از روی نظرش بوده نه از روی کشفش (الکشف)، چرا که او از جانب خدا خبر نداده است که به او گفته باشد: من این‌گونه عمل می‌کنم. و غیر از این مرد از اهل این شأن، آنچه را که ما به آن معتقدیم، درک کرده است و دلیل عقلی آن را نشناخته است. پس هر یک از آنچه دیده خبر داده و در خبر خود صادق بوده است. و خطا هرگز در این طریق از جهت کشف (الکشف) رخ نمی‌دهد، بلکه از جهت تفقه در آنچه کشف شده است، رخ می‌دهد، اگر کشف حروف یا صور باشد. اما میزان شرعی (المیزان الشرعی) این است که اگر خداوند علمی از علوم الهی (نه از غیر آن، زیرا ما غیر را در این میزان خاص در نظر نمی‌گیریم) به تو عطا کرد، به شرع می‌نگریم، اگر عالم به آن باشیم، وگرنه از محدثین از علمای شرایع می‌پرسیم، نه از اهل رأی. پس به آنان می‌گوییم: آیا از یکی از رسولان روایت کرده‌اید که از جانب خدا چنین و چنان گفته باشد؟ اگر گفتند: بله، پس آن را با آنچه دانستی و آنچه به تو گفته شد، بسنج. و بدان که تو وارث آن نبی در آن مسئله هستی. یا می‌نگرد که آیا قرآن بر آن دلالت می‌کند؟ و این همان قول جنید است که: «علم ما مقید به کتاب و سنت است.» پس این میزان است. و در این میزان لازم نیست که عین مسئله در کتاب یا سنت ذکر شده باشد، بلکه آنچه قوم بر آن طلب می‌کنند، این است که یک اصل واحد در شرع نازل شده از کتاب یا سنت، بر هر زبان پیامبری که از آدم (علیه السلام) تا محمد (صَلَّى اللهُ عَليهِ وسَلَّم) بوده است، آن دو را جمع کند. زیرا امور بسیاری در کشف (الکشف) بر اولیا و در تعریف الهی بر ما وارد می‌شود که عقول آن‌ها را نمی‌پذیرند و طرد می‌کنند. اما اگر رسول یا پیامبر (علیه السلام) آن را بگوید، به عنوان ایمان و تأویل پذیرفته می‌شود، ولی از غیر او پذیرفته نمی‌شود. و این به دلیل عدم انصاف است. زیرا هنگامی که اولیا به آنچه برایشان تشریع شده عمل می‌کنند، نفحات جود الهی از آن حضرت الهی بر آنان می‌وزد و از اعیان آن امور الهی که از انبیا (علیهم السلام) پذیرفته شده است، آنچه را که خدا بخواهد، بر آنان کشف (الکشف) می‌شود. پس اگر این ولی آن را بیاورد، تکفیر می‌شود، در حالی که همان کسی که او را تکفیر می‌کند، اگر رسول آن را بیاورد، به آن ایمان می‌آورد. پس بصیرت این شخص چقدر کور است! و کمترین کار این است که به او بگوید: اگر آنچه می‌گویی حق است، تو به این مخاطب شده‌ای یا بر تو کشف شده است، پس تأویل آن چنین و چنان است، اگر از اهل تأویل باشد. و اگر ظاهری باشد، به او می‌گوید: در خبر نبوی چیزی شبیه به این وارد شده است. زیرا این از شرط نبوت نیست و شارع آن را نه در کتاب و نه در سنت منع نکرده است.\n\nو از این باب در این منزل، انسان میزان خود را از حضرت الهی در فرموده او که «إن الله خلق آدم على صورته» (خداوند آدم را بر صورت خود آفرید) می‌شناسد.\n\nپس جود الهی او را وارد میزان کرده است تا با صورت خود، حضرتی را که ذات، صفت و فعل را ایجاد کرده است، بسنجد. و اشتراک در حقیقت دو موزون، از وزن لازم نمی‌آید. زیرا آنچه طلاهای ضرب شده با آن وزن می‌شوند، یک وزنه آهنی است، پس نه در ذات، نه در صفت و نه در عدد شبیه آن نیست. پس دانسته می‌شود که با صورت انسانی وزن نمی‌شود مگر آنچه صورت با تمام آنچه در بر دارد، از اسماء الهی که متوجه ایجاد او شده و آثار خود را در او آشکار کرده‌اند، طلب می‌کند. و همان‌طور که وزنه آهنی در حد، حقیقت و صورت عین، با طلا برابری نمی‌کند، بنده نیز چنین است. اگرچه خداوند او را بر صورت خود آفریده است، اما در حد و حقیقت با او جمع نمی‌شود، زیرا ذات او حدی ندارد و انسان محدود به حدی ذاتی است، نه رسمی و نه لفظی. و هر مخلوقی بر این حد است. و انسان کامل‌ترین مخلوقات و جامع‌ترین آن‌ها از حیث نشأت و مرتبه خود است. پس اگر بر حقیقت این میزان وقوف یابی، آنچه را که در مورد صورت توهم کرده‌ای که او ذاتی است و تو ذاتی، و تو به حی و عالم و سایر صفات موصوفی و او نیز چنین است، از تو زائل می‌شود. و با این میزان برای تو روشن می‌شود که مراد از صورت، این نیست. و به همین دلیل در یک صورت جمع کرد: «خَلَقَ الْإِنْسانَ» (انسان را آفرید) و «وَ وَضَعَ الْمِيزانَ» (و میزان را نهاد) و به تو امر کرد که آن را بدون طغیان و خسران برپا داری. و برپایی آن جز بر حدی که برایت ذکر کردم، نیست. زیرا او خداوند خالق است و تو بنده مخلوق. و چگونه ممکن است که مصنوع، صانع خود را بشناسد؟ مصنوع تنها صورت علم صانع به خود را از صانع می‌طلبد، نه صورت ذات او را. و تو مصنوع خالق خود هستی، پس صورت تو مطابق با صورت علم او به تو است. و هر مخلوقی چنین است. و اگر امر چنین نبود و حد و حقیقتی شما را جمع می‌کرد، همان‌طور که زید و عمرو را جمع می‌کند، تو یا اله بودی یا او مألوه، تا یک حد شما را جمع کند. و امر بر خلاف این است. پس بدان که با کدام میزان خود را با پروردگارت می‌سنجی و به خود مغرور مشو. و بدان که تو یک وزنه آهنی هستی که با آن یک یاقوت یگانه که خواهری ندارد، وزن می‌شود. و اگر در مقدار با آن جمع شدی، در قدر و ذات و خاصیت با آن جمع نشدی. خداوند متعال است. پس بر عبودیت خود پایبند باش و قدر خود را بشناس.\n\n### [اینکه خداوند از مخلوقات خود کسانی را قرار داده که بزرگتر از انسان هستند]\n\nو بدان که خداوند از مخلوقات خود کسانی را قرار داده که بزرگتر از تو هستند، اگرچه خلقت آن‌ها به خاطر تو بوده است. اما لازم نیست که اگر چیزی به خاطر تو آفریده شده باشد، تو بزرگتر از آن باشی. زیرا چاقو برای اموری ساخته شده است، از جمله قطع دست دزد، و آتش برای عذاب انسان آفریده شده است. پس انسان شریف‌تر از آتش است، زیرا آتش برای او آفریده شده است. پس این فصل (قاعده) جاری نیست. پس آن را وارد میزان خود مکن. تو، تو هستی و او، اوست. «لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ» (هیچ معبودی جز او نیست، که عزیز و حکیم است). «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَ هُوَ السَّمِيعُ الْبَصِيرُ» (چیزی مانند او نیست و او شنوای بیناست). با این بیان، میزان علمی مشروع و معقول و آنچه از آن مورد نیاز است را به تو آموختم. پس بگذار میزان عمل را برایت بیان کنیم.\n\n### [همانا عمل یا حسی است و یا قلبی]\n\nو بدان که عمل، برخی حسی و برخی قلبی است، و میزان آن از جنس خود آن است. پس میزان عمل این است که به شرع بنگری و ببینی چگونه صورت‌های اعمال را بر کامل‌ترین غایات آن‌ها برپا داشته است، چه آن عمل قلبی باشد، چه حسی، یا مرکب از حس و قلب، مانند نیت و نماز که از حرکات حسی است. شرع برای آن صورتی روحانی برپا داشته است که عقل تو آن را نگه می‌دارد. پس هنگامی که شروع به عمل کردی، چشمت باید به آن مثال باشد که از شارع گرفته‌ای و آنچه را که به انجام آن امر شده‌ای، در برپایی آن صورت انجام ده. پس هنگامی که از آن فارغ شدی، آن را با آن صورت روحانی که از آن به مثال تعبیر می‌شود و از شارع به دست آورده‌ای، عضو به عضو و مفصل به مفصل، ظاهر و باطن، مقایسه کن. اگر صورت عمل تو با حکم مطابقت، بدون نقصان و زیادت، در آن وارد شد، پس وزن را به عدل (القسط) برپا داشته‌ای و در آن طغیان نکرده‌ای و زیان نرسانده‌ای. زیرا زیادت در حد، عین نقصان در محدود است. پس اگر عمل خود را با چنین وزنی سنجیدی، صورت عمل تو مقدار جزایی خواهد بود که حق برای آن برای تو تعیین کرده است، خواه آن عمل ستوده باشد یا نکوهیده. زیرا شرع همان‌طور که صورت عمل ستوده را برایت برپا داشته تا آن را انجام دهی و برایت بیان کرده تا آن را بشناسی، همچنین صورت عمل نکوهیده را برایت برپا داشته تا آن را بشناسی و از ستوده تمییز دهی و تو را نهی کرده است که صورتی مطابق با آن انجام دهی. پس اگر مخالفت کردی و صورتی مطابق با آن صورت انجام دادی، آن صورت، موازنه خود را از جزا طلب می‌کند. اگر حق موافقت کرد که آن را با جزا وارد میزان کند، در مقدار آن به اندازه ذره‌ای افزایش نمی‌دهد. این در صورتی است که وزن را با جزا بر آن اقامه کند و عذاب او در آتش، جزایی به اندازه عمل او باشد، نه افزایش یابد و نه کاهش، نه در عمل و نه در مقدار زمان. و اصرار بر اعمالی که از انجام آن‌ها نهی شده است، از جمله اعمال است و جز با توبه از بین نمی‌رود. پس اگر بر آن بمیرد، بر او بیم است و قطع نمی‌شود. و اگر حق صورت عمل صالح را وارد میزان کند و آن را با صورت جزا بسنجد، صورت جزا چندین برابر بر آن ترجیح می‌یابد و از حد و مقدار خارج می‌شود، به عنوان منت و فضل از جانب خدا. و این همان فرموده خداوند متعال است: «مَنْ عَمِلَ سَيِّئَةً فَلا يُجْزى‏ إِلَّا مِثْلَها» (هر کس بدی کند، جز به مانند آن جزا داده نمی‌شود) همان‌طور که ذکر کردیم. و در مورد دیگر فرمود: «مَنْ جاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثالِها» (هر کس کار نیکی بیاورد، ده برابر آن برای اوست) و فرمود: «مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوالَهُمْ في سَبِيلِ الله كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنابِلَ في كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَ الله يُضاعِفُ لِمَنْ يَشاءُ» (مَثَل کسانی که اموال خود را در راه خدا انفاق می‌کنند، مانند دانه‌ای است که هفت خوشه برویاند و در هر خوشه صد دانه باشد، و خداوند برای هر کس که بخواهد، چند برابر می‌کند). و برای چند برابر شدن در خیر، مقداری که در آن توقف شود، قرار نداد، بلکه خود را به وسعت توصیف کرد و فرمود: «وَ الله يُضاعِفُ لِمَنْ يَشاءُ وَ الله واسِعٌ عَلِيمٌ» (و خداوند برای هر کس که بخواهد، چند برابر می‌کند و خداوند گشایش‌دهنده و داناست). و فرمود: «إِنَّ رَبَّكَ واسِعُ الْمَغْفِرَةِ» (همانا پروردگار تو بسیار آمرزنده است). و فرمود: «وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ» (و رحمت من همه چیز را فرا گرفته است). و غضب او چیزی است، پس رحمت آن را فرا گرفته و محصور کرده و بر آن حکم رانده است، پس جز به حکم آن تصرف نمی‌کند. پس اگر بخواهد آن را رها می‌کند و در آن بوی رحمتی به خاطر منزل وجود دارد، و اگر بخواهد آن را نگه می‌دارد. به همین دلیل در بسم‌الله (البسملة) هیچ یک از اسماء قهر به صورت ظاهر وجود ندارد، بلکه «الله الرَّحْمَنِ الرَّحِيمِ» است. اگرچه اسم «الله» متضمن قهر است، اما همچنین متضمن رحمت است. پس آنچه در آن از اسماء قهر، غلبه و شدت است، با آنچه در آن از رحمت، مغفرت، عفو و صفح است، وزن به وزن در اسم «الله» از بسم‌الله مقابله می‌شود. و برای ما فضلی باقی می‌ماند که بر آنچه اسماء را با آن مقابله کردیم، در اسم «الله» افزوده است، و آن فرموده «الرَّحْمَنِ الرَّحِيمِ» است. پس عین رحمان و عین رحیم را خارج و افزون بر آنچه در اسم «الله» از آن وجود دارد، آشکار کرد. پس در وزن افزود و ترجیح یافت. پس خداوند ما را به آنچه در خلقش حکم می‌کند، شناساند. و رحمت، به واسطه آنچه در اسم جامع «الله» از بسم‌الله است، رحمت او به بواطن است، و به واسطه آنچه در «الرَّحْمَنِ الرَّحِيمِ» ظاهر است، رحمت او به ظواهر است. پس فراگیر شد و امید برای همگان بزرگ گشت. و هیچ سوره‌ای از سوره‌های قرآن نیست مگر آنکه بسم‌الله در ابتدای آن است. پس ما آن را چنین تأویل می‌کنیم که اعلامی از جانب خدا به سرانجام رحمت است. زیرا آن را سه رحمت قرار داد: رحمت پنهان در اسم «الله» و رحمان و رحیم. و برای قهر جز آنچه در اسم «الله» پنهان است، قرار نداد. پس عین موجودی مانند کنایه در طلاق ندارد که انسان در آن نیت می‌کند، بر خلاف صریح. پس بفهم. اما سوره توبه، مردم در مورد آن اختلاف کرده‌اند که آیا سوره‌ای مستقل مانند سایر سوره‌های قرآن است یا آن و سوره انفال یک سوره واحد هستند؟ زیرا آنان کمال سوره را جز با جدا شدن توسط بسم‌الله نمی‌شناختند و در اینجا نیامده است. پس دلالت می‌کند که آن از سوره انفال است و این وجه موجه‌تر است. اگرچه برای ترک آن نیز وجهی وجود دارد و آن عدم تناسب میان رحمت و برائت است. اما این وجه آن قوت را ندارد، بلکه وجهی ضعیف است. و سبب ضعف آن این است که در اسم «الله» که به تمام اسماء منسوب است، آنچه در اسم خاصی که مقتضی مؤاخذه است، وجود ندارد. و برائت تنها از شریک است. و اگر از مشرک برائت جوید، به دلیل مشرک بودن اوست، زیرا متعلق آن عدم است. خالق از مخلوق برائت نمی‌جوید، حتی اگر کسی که وجود او را حفظ می‌کند، از او برائت جوید. و شریک وجود ندارد. پس شریک معدوم است و در نفس الامر شرکتی نیست. پس اگر برائت از شریک صحیح باشد، صفتی برای تنزیه و تبرئه خداوند از شریک و تبرئه رسول از اعتقاد به جهل است. و وجه دیگری در ضعف این تأویل که ذکر کردیم، این است که بسم‌الله در ابتدای هر سوره‌ای که با «ویل» (وای) شروع می‌شود، موجود است. و رحمت کجا و ویل کجا؟ به همین دلیل، قاریان در مورد چنین سوره‌ای مذهب پسندیده‌ای دارند، در مورد کسانی که بسم‌الله را اثبات می‌کنند و کسانی که آن را ترک می‌کنند، مانند قرائت حمزه، و کسانی که در آن مخیر هستند، مانند قرائت ورش. و اثبات بسم‌الله نزد او ارجح است. پس ما در این دو موضع، هنگام قرائت به حرف حمزه، آن را اثبات کردیم، به دلیل زشتی وصل در قرائت، که این است که بگوید: «وَ الْأَمْرُ يَوْمَئِذٍ لِلَّهِ ويل» (و امر در آن روز از آن خداست، وای). پس در اینجا بسم‌الله گفتند. اما مذهب ما در آن این است که بر آخر سوره وقف کند و بر آخر بسم‌الله وقف کند و با سوره شروع کند بدون وصل. و قرائت در این فصل بر چهار مذهب است. مذهب اول را اصلاً قبول ندارند و آن این است که آخر سوره را به بسم‌الله وصل کند و وقف کند و با سوره شروع کند. این را هیچ یک از قاریان عالم نمی‌پسندند. و من دیده‌ام که عجم‌ها از فارس چنین کاری می‌کنند که علمای اداء از قاریان آن را نمی‌پسندند. و مذهب پسندیده‌ای که همگان آن را پذیرفته‌اند و من مخالفی از قاریان برای آن نمی‌شناسم، وقف بر آخر سوره و وصل بسم‌الله به اول سوره‌ای است که شروع می‌کند. و دو مذهب دیگر که از این کمتر پسندیده هستند، این است که در همه قطع کند یا در همه وصل کند. و همگان اجماع دارند که هنگام شروع قرائت در اول سوره، با تعوذ و بسم‌الله شروع کند. و جماعت قاریان بدون اختلاف بر قرائت بسم‌الله در فاتحه اجماع دارند. و در سایر سوره‌های قرآن اختلاف کردند، به شرطی که هیچ یک از آنان با سوره شروع نکند. پس برخی در آن مخیر هستند، مانند ورش، و برخی ترک می‌کنند، مانند حمزه، و برخی بسم‌الله می‌گویند و مخیر نیستند، مانند سایر قاریان. و برای وجه تخییر و ترک و عدم ترک این بسم‌الله، احکام عجیبی وجود دارد که وقت برای ذکر آن‌ها گنجایش ندارد، و به دلیل اینکه خارج از مقصود این باب هستند. و آن (بسم‌الله) آیه‌ای است هر جا که واقع شود، مگر در سوره نمل در نامه سلیمان (علیه السلام) که بخشی از آیه است و من در آن اختلافی نمی‌دانم. پس این میزان عملی و علمی را به صورت تقریبی و مختصر برایت بیان کردم. پس بگذار آنچه این منزل از اموری که به دلیل ترس از طولانی شدن ذکر نکردیم، در بر دارد، برایت بیان کنیم.\n\nپس بدان که این منزل شامل علم علل این میزان‌هایی است که ذکر کردیم. و در آن علم آنچه پروردگار سزاوار تعظیم است، وجود دارد. و در آن علم آخرت که میان دنیا و نزول مردم در منازلشان از بهشت و آتش است، وجود دارد. و در آن علم بعث وجود دارد. و در آن علم برخی از منازل شقاوتمندان و سعادتمندان وجود دارد. و در آن علم سور (دیوارها) وجود دارد. و در آن علم اصطلام (ریشه‌کن شدن) وجود دارد. و در آن علم مراتب عالم علوی و سفلی و طبیعی و روحانی وجود دارد. و در آن منزل قربت (القربة) وجود دارد و ما در آن جزئی لطیف داریم. و در آن علم مفاضله (برتری دادن) وجود دارد. و در آن علم موازنه جزا وجود دارد. و در آن علم تخلیص و امتزاج وجود دارد. و در آن معرفت (المعرفة) وصفی که شایسته نیست پیامبری به آن متصف شود و عصمت ولی از آن، که امری عزیز است، وجود دارد. و در آن علم آنچه در دنیا مکروه و فاعل آن مورد نفرت است، اما در آخرت محبوب است، که همان عین آن فعل است، وجود دارد. «وَ الله يَقُولُ الْحَقَّ وَ هُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}