{
  "id": 544,
  "title": {
    "ar": "الباب الرابع والأربعون وخمسمائة في معرفة حال قطب كان هجيره ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ",
    "en": "Chapter Five Hundred and Forty-Four: Concerning the Gnosis of the State (حال) of a Pole (قطب) whose constant preoccupation (هجيره) was: <<Not a word does he utter but there is a watcher (رقيب) by him, ready (عتيد)>>.",
    "ur": "باب پانچ سو چوالیس: ایک قطب (القطب) کے حال کی معرفت (المعرفۃ) کے بیان میں جس کا دائمی مشغلہ یہ تھا: \"وہ کوئی بات نہیں کہتا مگر اس کے پاس ایک نگہبان (رقیب) تیار (عتید) ہوتا ہے۔\" (سورۃ ق، ۵۰:۱۸)",
    "fa": "باب پانصد و چهل و چهارم در معرفت حال قطبی که ورد زبانش این بود: «هیچ سخنی بر زبان نمی‌آورد مگر اینکه نزد او نگهبانی آماده است» (ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ)."
  },
  "content": {
    "ar": "## «الباب الرابع والأربعون وخمسمائة في معرفة حال قطب كان هجيره ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ»\n\n\n> إن الرقيب على اللسان موكل *** فعليه فيما تلفظون توكلوا\n\n\n> أنطق به إن كنت صاحب نظرة *** واعمل على عين الحقيقة يا فل‏\n\n\n> وكذا جميع قواك منك فإنها *** هي عينه والعين ما لا تجهل‏\n\n\n> فإذا علمت نصيحتي وشهدتها *** عينا علمت من الرقيب المرسل‏\n\n\n### [إن الله قال على لسان عبده سمع الله لمن حمده‏]\n\n\nقال الله تعالى وإِنَّ عَلَيْكُمْ لَحافِظِينَ كِراماً كاتِبِينَ يَعْلَمُونَ ما تَفْعَلُونَ وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن الله عند لسان كل قائل‏\n\n\nوما خصص قائلا من قائل فأتى به نكرة فكل ذي لسان قائل فهو عند الله وما عِنْدَ الله باقٍ وما كل قائل في كل قول يكون قوله منسوبا إلى الله مثل قوله إن الله قال على لسان عبده سمع الله لمن حمده والمحبوب بإتيان النوافل يكون الحق لسانه فتفاضلت المراتب فالملك الحافظ الكاتب عند الإنسان كل ما لفظ كتبه الملك فلا يكتب إلا ما يلفظ به الإنسان فإذا لفظه ورمى به فبعد الرمي يتلقاه الملك فإن الله عند قوله في حين قوله فيراه الملك نورا قد رمى به هذا القائل الذي الحق عند لسانه فيأخذه الملك أدبا مع القول يحفظه له عنده إلى يوم القيامة وإذا عمل يعلم الملك أنه عمل أمرا ما خاصة ولا يكتبه حتى يتلفظ به فالحفظة تعلم ما يفعل العبد ولكنها ما تكتب له عملا حتى يتلفظ به فإذا تلفظ كتبت فهم شهود إقرار وسبب ذلك عدم اطلاعهم على ما نواه العبد في ذلك الفعل ولهذا ملائكة العروج بالأعمال تصعد بعمل العبد وهي تستقله فيقبل منها ويكتب في عليين وتصعد بالعمل وهي تستكثره فيقال لها اضربوا بهذا العمل وجه صاحبه فإنه ما أراد به وجهي وما أُمِرُوا إِلَّا لِيَعْبُدُوا الله مُخْلِصِينَ لَهُ الدِّينَ حُنَفاءَ فلو علمت الحفظة ما في نية العبد عند العمل ما ورد مثل هذا الخبر فالنية في الأعمال لا تكون من العبد إلا من الوجه الخاص ولهذا لا يعلمه من العامل إلا الله والعامل الذي نوى فيه ما نوى فالملك يرقب حركة العبد ويكتب منه حركة لسانه إذا تلفظ والله شهيد لأنه عند قول عبده على الحقيقة لا عند عبده فهذه الكينونة الإلهية هي التي تحدث بحدوث القول وسبب ذلك أنه تكوين والتكوين لا يكون أبدا إلا عن القول الإلهي في كل كائن فجميع ما يتكون في الوجود فعن القول الإلهي فما بين الحق والعبد مناسبة أتم ولا أعم من مناسبة القول ولهذا كان عند لسان كل قائل فإن القول كون مفارق قائله فإن لم يكن الله عنده ضاع القول وإنما كان الله عنده لينشئه صورة قائمة تامة الخلقة فإنه لا بد أن يكون تعالى مذكورا بها فيتم منها ما نقصه العبد مما تستحقه نشأتها من الكمال كما يقبل الصدقة ليربيها حتى تكون أعظم من‏\nالجبل العظيم فهذا من باب الغيرة والأول من باب الكمال وما ينبغي فالغيرة على الجناب الإلهي من الله الذي له الكمال المطلق ثم لتعلم أن النقص من كمال الوجود لا من كمال الصورة فتنبه فإنه دقيق‏\n\n\n> لو لم يكن في الوجود نقص *** لزال عن رتبة الكمال‏\n\n\n> لكنه ناقص فأبدى *** كماله فيه ذو الجلال‏\n\n\n> فكل صنع من كل خلق *** لم يخله الله من جمال‏\n\n\n> لأنه راجع إليه *** في كل عقد بكل حال‏\n\n\n> فلا كمال ولا جمال *** إلا إلى الله ذي المعال‏\n\n\n> من كل شخص بكل وجه *** في الفعل والحال والمقال‏\n\n\n> يا من يراني بعين حق *** لا تجعل الحكم للخيال‏\n\n\n> لأنه عقد كل هاد *** بل مهتد لا عن الضلال‏\n\n\nوإن كان كذلك فاجهد أن لا تصدر منك صورة إلا مخلقة في غاية الكمال في قول وعمل ولا يغرنك كون النقص من كمال الوجود لأن ذلك من كمال الوجود ما هو من كمال ما وجد عنك فإن جماعة من الناس زلوا في هذا الموضع لقيناهم فينتج هذا الذكر لصاحبه مشاهدة الحق عند قوله وقبوله له ومن شاهد الحفظة فمن هذا المقام شهدهم ولما أشهدنيهم الحق تعالى تعذبت بشهودهم ولم أتعذب بشهود الحق فلم أزل أسأل الله في أن يحجبهم عني فلا أبصرهم ولا أكلمهم ففعل الله معي ذلك وسترهم عن عيني وإنما لم أتعذب بشهود الحق لأنه عند شهود العبد ربه تعالى يشهده شاهد أو مشهود أو شهوده الملك ليس كذلك فإنه يشهده أجنبيا عنه ولو كان الحق بصره فإنه أعظم في الأجنبية وأشد في القلق عند صاحب هذه الصفة لأن الملك لا ينبغي أن يكون رقيبا على الله وهو رقيب فلا بد أن يكون الملك في هذه الحال محجوبا عن الله تعالى لا يشهده صفة عبده إذ لو شهدها لم يتمكن له أن يكون رقيبا عليه فلا بد لهذا العبد أن يتقلق بشهود الملك فإذا غاب عن حسه انفرد بسره بربه وأملى على الملك ما شاء أن يملي عليه ف كانَ الله عَلى‏ كُلِّ شَيْ‏ءٍ رَقِيباً والملائكة حافظون من أمر الله هذا الشخص الإنساني قال تعالى لَهُ مُعَقِّباتٌ من بَيْنِ يَدَيْهِ ومن خَلْفِهِ يَحْفَظُونَهُ من أَمْرِ الله فهم ملائكة تسخير تكون مع العبد بحسب ما يكون العبد عليه فهم تبع له وهذا الفارق بين توكيل السلطان على الشخص فإنه تحكم الوكلاء عليه لا يتعدى الموضع الذي حجره السلطان وحفظة الحق يتبعون العبد حيث تصرف فهو مطلق التصريف في إرادته وإن حجر عليه بعض التصرف فإنه يتصرف فيما حجر عليه ولا يستطيع الملك يمنعه من ذلك لأمرين الواحد لكون الحق قد ذهب الله بسمع هذا العبد عن قوله ويبصره عن شهوده والأمر الآخر لكون الملك الحافظ الموكل به لا يمنعه لشهوده الحق معه في تصرفه الذي أمره بحفظه فلذلك لا يحجر الملك عليه التصرف وتوكيل المخلوق ليس كذلك فإن الحاكم الذي وكل الوكلاء به ليس هو عند الموكل عليه فهذا الفارق بين حكم الوكيل الحق والوكيل المخلوق فوكلاء الخلق يحفظونه من التصرف ووكلاء الحق يحفظونه في التصرف وهذا القدر في هذا الذكر من التنبيه كاف والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 544: Concerning the Knowledge of the State of a Pole Whose Constant Companion Was: <<Not a word does he utter but there is a watcher ready beside him>>\n\nIndeed, the Watcher over the tongue is appointed,\nSo upon Him, in what you utter, rely.\nSpeak with it if you are a person of insight (نظرة),\nAnd act upon the very eye of Reality (عين الحقيقة), O so-and-so.\nAnd likewise, all your powers are from you, for they\nAre His very eye, and the Eye is what you cannot ignore.\nSo if you know my counsel and witness it\nAs the very eye, you will know who the sent Watcher (الرقيب المرسل) is.\n\n[Indeed, Allah speaks through the tongue of His servant: \"Allah hears the one who praises Him.\"]\n\nAllah the Exalted said: <<وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ كِرَامًا كَاتِبِينَ يَعْلَمُونَ مَا تَفْعَلُونَ>> (Indeed, over you are watchers, noble scribes, who know what you do). And the Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Allah is present at the tongue of every speaker.\"\n\nHe did not specify one speaker over another, but brought it in the indefinite form. Thus, every possessor of a speaking tongue is present with Allah, and what is with Allah (ما عِنْدَ الله) endures. Yet, not every speaker, in every utterance, has his speech attributed to Allah, such as the saying: [Indeed, Allah speaks through the tongue of His servant: \"Allah hears the one who praises Him\"]. The beloved servant, through performing supererogatory acts (النوافل), has the Real (الحق) become his tongue. Thus, the Levels (المراتب) are differentiated.\n\nThe preserving, scribing angel (الملك الحافظ الكاتب) is present with the human. Everything he utters is written by the angel. The angel writes only what the human utters. When the human utters it and casts it forth, the angel receives it after the casting, for Allah is present at his speech at the moment of his speech. The angel sees it as a light cast forth by this speaker, whose tongue is the Real (الحق). The angel takes it, out of reverence for the utterance, preserving it with him until the Day of Resurrection.\n\nWhen the servant performs an action, the angel knows that he has performed a specific matter, but does not write it down until the servant articulates it. The Preservers (الحفظة) know what the servant does, but they do not write down an action for him until he articulates it. When he articulates it, they write it. Thus, they are witnesses of affirmation (شهود إقرار).\n\nThe reason for this is their lack of access to what the servant intended (نواه) in that action. This is why the angels who ascend with deeds sometimes ascend with the servant’s deed while deeming it small, yet it is accepted from them and written in *‘Illiyyin* (the highest register). And sometimes they ascend with the deed while deeming it great, and they are told: \"Strike the face of its owner with this deed, for he did not intend My Face (وجهي) by it.\" <<وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ>> (And they were not commanded except to worship Allah, dedicating the religion sincerely to Him, as monotheists).\n\nIf the Preservers (الحفظة) knew what was in the servant’s intention (نية) during the action, such a report would not have been transmitted. The intention (النية) in deeds proceeds from the servant only from the specific aspect (الوجه الخاص), and thus no one knows it from the doer except Allah and the doer who intended what he intended therein.\n\nThe angel watches the movement of the servant and writes down the movement of his tongue when he articulates. Allah is the Witness (شهيد) because He is present at the speech of His servant in reality (على الحقيقة), not merely present with His servant. This Divine Presence (الكينونة الإلهية) occurs with the occurrence of the speech. The reason for this is that speech is a formation (تكوين), and formation never occurs except through the Divine Command (القول الإلهي) in every existent thing (كائن).\n\nAll that is formed in Existence (الوجود) is through the Divine Command. Therefore, there is no relationship (مناسبة) between the Real (الحق) and the servant more perfect or more general than the relationship of speech. This is why He is present at the tongue of every speaker, for speech is an existent thing (كون) that separates from its speaker. If Allah were not present with it, the speech would be lost. Allah is present with it only to bring it into being as a standing form (صورة قائمة) of complete creation (تامة الخلقة), for He must be mentioned by it, and He perfects in it what the servant lacked of the perfection (الكمال) that its formation deserves. This is similar to how He accepts charity to nurture it until it becomes greater than a mighty mountain. This is from the category of Divine Jealousy (الغيرة), while the former is from the category of perfection (الكمال) and what is fitting. The Jealousy is over the Divine Presence (الجناب الإلهي) from Allah, Who possesses Absolute Perfection (الكمال المطلق). Furthermore, you must know that the deficiency (النقص) is in the perfection of Existence (كمال الوجود), not in the perfection of the form (كمال الصورة). Be alert, for this is subtle.\n\nHad there been no deficiency (نقص) in Existence (الوجود),\nIt would have departed from the Degree of Perfection (رتبة الكمال).\nBut it is deficient, so the Possessor of Majesty (ذو الجلال)\nManifested His perfection within it.\nThus, every making by every creature\nAllah did not leave devoid of beauty (جمال).\nBecause it returns to Him\nIn every covenant, in every state.\nSo there is no perfection (كمال) and no beauty (جمال)\nExcept to Allah, the Possessor of Heights,\nFrom every person, in every aspect,\nIn action, state, and speech.\nO you who see me with the eye of the Real (عين حق),\nDo not assign judgment to Imagination (الخيال).\nFor it is the covenant of every guide,\nRather, of the guided, not of error.\n\nIf this is the case, then strive that no form issues from you except one created in the utmost perfection (غاية الكمال), whether in speech or action. Do not be deceived by the fact that deficiency is part of the perfection of Existence (كمال الوجود), because that perfection of Existence is not the perfection of what comes into existence through you. Indeed, a group of people stumbled at this point, and we met them.\n\nThis remembrance (الذكر) results for its practitioner in the witnessing (مشاهدة) of the Real (الحق) at his speech and His acceptance of it. Whoever witnesses the Preservers (الحفظة) witnesses them from this station. When the Real (الحق) the Exalted made me witness them, I suffered distress (تعذبت) from witnessing them, but I did not suffer distress from witnessing the Real. I continuously asked Allah to veil them from me so that I would neither see them nor speak to them. Allah did this for me and concealed them from my sight.\n\nThe reason I did not suffer distress from witnessing the Real is that when the servant witnesses his Lord, the Exalted, He witnesses him as a witness or as the witnessed. The angel’s witnessing is not like that, for the angel witnesses Him as a stranger (أجنبيا) to him. Even if the Real were his sight, the strangeness would be greater and the anxiety (القلق) more intense for the possessor of this attribute, because the angel ought not to be a watcher over Allah, yet he is a watcher. Therefore, the angel must, in this state, be veiled from Allah the Exalted, not witnessing Him as the attribute of His servant. For if he witnessed Him as such, he would not be able to be a watcher over Him.\n\nThus, this servant must feel anxiety (يتقلق) due to the witnessing of the angel. When the angel is absent from his perception (حسه), he is alone with his secret (سره) with his Lord and dictates to the angel whatever he wills to dictate to him.\n\nThus, <<كَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا>> (Allah is ever a Watcher over all things). And the angels are preservers (حافظون) of this human person by the command of Allah. The Exalted said: <<لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ>> (For him are successive [angels] before him and behind him, who guard him by the command of Allah). They are angels of subjugation (ملائكة تسخير) who are with the servant according to the state the servant is in; they are followers of him.\n\nThis is the difference between the delegation of authority (توكيل) by a ruler over a person—where the agents control him and do not exceed the area restricted by the ruler—and the Preservers of the Real (حفظة الحق), who follow the servant wherever he acts. He is absolute in his disposal (مطلق التصريف) in his will. Even if some disposal is restricted for him, he acts in what is restricted, and the angel cannot prevent him from doing so, for two reasons. The first is that Allah has taken the hearing of this servant for the Real (الحق) concerning his speech, and his sight for the Real concerning his witnessing. The second reason is that the preserving angel (الملك الحافظ) appointed over him does not prevent him because he witnesses the Real with him in the disposal that he was commanded to preserve. Therefore, the angel does not restrict his disposal. The delegation of authority by a creature (توكيل المخلوق) is not like this, for the ruler who appointed the agents is not present with the one over whom the authority is delegated. This is the difference between the ruling of the Agent of the Real (الوكيل الحق) and the agent of the creature. The agents of creation preserve him *from* disposal, while the agents of the Real preserve him *in* disposal. This amount of clarification in this remembrance (الذكر) is sufficient. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر پانچ سو چوالیس: اس قطب کے حال کی معرفت میں جس کا ورد یہ تھا کہ \"وہ کوئی بات نہیں کہتا مگر اس کے پاس ایک نگہبان تیار ہوتا ہے\" (مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ)۔\n\nبے شک زبان پر نگہبان (الرقيب) مقرر ہے\nپس جو کچھ تم بولو، اسی پر بھروسہ کرو۔\nاگر تم صاحبِ بصیرت ہو تو اس کے ذریعے بات کرو،\nاور اے فلاں! حقیقت کی آنکھ پر عمل کرو۔\nاور اسی طرح تمہاری تمام قوتیں تم سے ہیں، کیونکہ\nوہ (قوتیں) ہی اس کی آنکھ ہیں، اور آنکھ وہ ہے جسے تم نہیں جانتے۔\nپس جب تم میری نصیحت جان لو اور اسے\nآنکھوں سے دیکھ لو، تو تم جان جاؤ گے کہ بھیجا گیا نگہبان کون ہے۔\n\n[بے شک اللہ نے اپنے بندے کی زبان پر فرمایا: سَمِعَ اللهُ لِمَنْ حَمِدَهُ (اللہ نے اس کی سن لی جس نے اس کی حمد کی)]\n\nاللہ تعالیٰ نے فرمایا: \"اور بے شک تم پر نگہبان (لَحافِظِينَ) مقرر ہیں، معزز لکھنے والے (كِراماً كاتِبِينَ)، جو جانتے ہیں جو تم کرتے ہو\" (وَإِنَّ عَلَيْكُمْ لَحافِظِينَ كِراماً كاتِبِينَ يَعْلَمُونَ ما تَفْعَلُونَ)۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ ہر بات کرنے والے کی زبان کے پاس ہوتا ہے۔\"\n\nاور اس نے کسی ایک بات کرنے والے کو دوسرے سے خاص نہیں کیا، بلکہ اسے نکرہ (عام) لایا۔ پس ہر زبان والا بات کرنے والا اللہ کے پاس ہے۔ اور جو کچھ اللہ کے پاس ہے وہ باقی (باقٍ) ہے۔ لیکن ہر بات کرنے والے کا ہر قول اللہ کی طرف منسوب نہیں ہوتا، جیسے کہ اس کا قول: \"بے شک اللہ نے اپنے بندے کی زبان پر فرمایا: سَمِعَ اللهُ لِمَنْ حَمِدَهُ۔\" اور نوافل کی ادائیگی کے ذریعے محبوب بننے والے کی زبان ذات حق (الحق) بن جاتی ہے۔ پس مراتب میں فرق آ گیا۔ پس نگہبان (الحافظ) اور لکھنے والا فرشتہ انسان کے پاس ہوتا ہے۔ جو کچھ بھی وہ بولتا ہے، فرشتہ اسے لکھ لیتا ہے۔ وہ صرف وہی لکھتا ہے جو انسان اپنی زبان سے نکالتا ہے۔ جب وہ اسے بولتا اور پھینکتا ہے، تو پھینکنے کے بعد فرشتہ اسے وصول کرتا ہے۔ بے شک اللہ اس کے قول کے وقت اس کے قول کے پاس ہوتا ہے۔ پس فرشتہ اسے ایک نور کی صورت میں دیکھتا ہے جسے اس بات کرنے والے نے پھینکا ہے جس کی زبان کے پاس ذات حق (الحق) ہے۔ پس فرشتہ اس قول کو ادب کے ساتھ لے لیتا ہے اور قیامت کے دن تک اسے اپنے پاس محفوظ رکھتا ہے۔\n\nاور جب وہ کوئی عمل کرتا ہے، تو فرشتہ جانتا ہے کہ اس نے کوئی خاص کام کیا ہے، لیکن وہ اسے نہیں لکھتا جب تک کہ وہ اسے زبان سے نہ نکالے۔ پس حفاظت کرنے والے (الحفظۃ) جانتے ہیں کہ بندہ کیا کرتا ہے، لیکن وہ اس کے لیے کوئی عمل نہیں لکھتے جب تک کہ وہ اسے زبان سے نہ نکالے۔ جب وہ زبان سے نکالتا ہے تو وہ لکھ لیتے ہیں۔ پس وہ اقرار کے گواہ ہیں۔ اور اس کی وجہ یہ ہے کہ وہ اس نیت سے واقف نہیں ہوتے جو بندے نے اس فعل میں کی ہے۔ اور اسی وجہ سے اعمال کو لے کر اوپر جانے والے فرشتے بندے کے عمل کو لے کر چڑھتے ہیں اور وہ اسے کم سمجھتے ہیں، پھر بھی وہ ان سے قبول کر لیا جاتا ہے اور علیین میں لکھ دیا جاتا ہے۔ اور وہ عمل کو لے کر چڑھتے ہیں اور اسے بہت زیادہ سمجھتے ہیں، تو ان سے کہا جاتا ہے کہ اس عمل کو اس کے مالک کے چہرے پر مارو، کیونکہ اس نے اس سے میری ذات (وجہی) کا ارادہ نہیں کیا۔ \"حالانکہ انہیں صرف اسی کا حکم دیا گیا تھا کہ وہ اللہ کی عبادت کریں، دین کو اس کے لیے خالص کرتے ہوئے، یکسو ہو کر\" (وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ)۔ اگر حفاظت کرنے والے (الحفظۃ) عمل کے وقت بندے کی نیت کو جانتے ہوتے تو ایسی خبر نہ آتی۔\n\nپس اعمال میں نیت بندے کی طرف سے صرف خاص پہلو سے ہوتی ہے، اور اسی لیے اسے عمل کرنے والے میں سے صرف اللہ اور وہ عامل ہی جانتا ہے جس نے اس میں نیت کی جو اس نے کی۔ پس فرشتہ بندے کی حرکت کی نگرانی کرتا ہے اور جب وہ زبان سے نکالتا ہے تو اس کی زبان کی حرکت کو لکھتا ہے۔ اور اللہ گواہ ہے، کیونکہ وہ حقیقت میں اپنے بندے کے قول کے پاس ہوتا ہے نہ کہ اپنے بندے کے پاس۔ یہ الٰہی کینونت (وجود) ہی ہے جو قول کے وقوع پذیر ہونے سے پیدا ہوتی ہے۔ اور اس کی وجہ یہ ہے کہ یہ تکوین (تخلیق) ہے، اور تکوین (التكوين) ہر موجود (کائن) میں ہمیشہ صرف الٰہی قول سے ہی ہوتی ہے۔ پس ہستی (الوجود) میں جو کچھ بھی تشکیل پاتا ہے، وہ الٰہی قول سے ہوتا ہے۔ پس ذات حق (الحق) اور بندے کے درمیان قول کی مناسبت سے زیادہ کامل اور عام کوئی مناسبت نہیں ہے۔ اور اسی لیے وہ ہر بات کرنے والے کی زبان کے پاس ہوتا ہے۔ بے شک قول ایک وجود (کون) ہے جو اپنے کہنے والے سے جدا ہو جاتا ہے۔ اگر اللہ اس کے پاس نہ ہو تو وہ قول ضائع ہو جاتا ہے۔ اور اللہ اس کے پاس اس لیے ہوتا ہے تاکہ اسے ایک قائم، کامل تخلیق کی صورت میں پیدا کرے، کیونکہ ضروری ہے کہ اللہ تعالیٰ اس کے ذریعے یاد کیا جائے، تاکہ اس میں وہ کمی پوری ہو جائے جو بندے نے اس کے نشو و نما کے کمال کے حق سے کم کر دی تھی۔ جیسا کہ وہ صدقہ قبول کرتا ہے تاکہ اسے بڑھائے یہاں تک کہ وہ عظیم پہاڑ سے بھی بڑا ہو جائے۔ پس یہ غیرت کے باب سے ہے، اور پہلا کمال اور مناسبت کے باب سے ہے۔ پس الٰہی جناب پر غیرت اللہ کی طرف سے ہے، جس کے لیے کمال مطلق ہے۔ پھر تمہیں معلوم ہونا چاہیے کہ نقص کمالِ ہستی (كمال الوجود) میں ہوتا ہے نہ کہ کمالِ صورت میں۔ پس ہوشیار رہو، کیونکہ یہ دقیق (باریک) ہے۔\n\nاگر ہستی (الوجود) میں نقص نہ ہوتا،\nتو وہ کمال کے مرتبے سے زائل ہو جاتا۔\nلیکن وہ ناقص ہے، پس صاحبِ جلال نے\nاس میں اپنا کمال ظاہر کیا۔\nپس ہر مخلوق کا ہر عمل\nاللہ نے جمال سے خالی نہیں رکھا۔\nکیونکہ وہ ہر حال میں ہر عقد میں\nاسی کی طرف لوٹنے والا ہے۔\nپس کوئی کمال اور کوئی جمال نہیں\nمگر اللہ کی طرف، جو بلند مرتبے والا ہے۔\nہر شخص کی طرف سے، ہر پہلو سے،\nفعل، حال اور قول میں۔\nاے وہ جو مجھے حق کی آنکھ سے دیکھتا ہے،\nحکم کو خیال کے لیے نہ بنا۔\nکیونکہ یہ ہر ہدایت دینے والے کا عقد ہے،\nبلکہ ہدایت یافتہ کا، نہ کہ گمراہی سے۔\n\nاور اگر ایسا ہے، تو کوشش کرو کہ تم سے کوئی صورت ظاہر نہ ہو مگر قول اور عمل میں کمال کی انتہا پر تخلیق شدہ ہو۔ اور تمہیں اس بات کا دھوکہ نہ ہو کہ نقص کمالِ ہستی (كمال الوجود) سے ہے، کیونکہ وہ کمالِ ہستی سے ہے نہ کہ اس کمال سے جو تم سے وجود میں آیا ہے۔ بے شک لوگوں کی ایک جماعت اس مقام پر پھسل گئی، ہم ان سے ملے ہیں۔ پس یہ ذکر اپنے صاحب کے لیے اس کے قول کے وقت ذات حق (الحق) کا مشاہدہ اور اس کی قبولیت پیدا کرتا ہے۔ اور جس نے حفاظت کرنے والوں (الحفظۃ) کا شہود (شہود) کیا، تو اس نے انہیں اسی مقام سے دیکھا۔ اور جب ذات حق (الحق) تعالیٰ نے مجھے ان کا شہود کرایا، تو میں ان کے شہود سے تکلیف میں رہا، اور ذات حق (الحق) کے شہود سے تکلیف میں نہیں رہا۔ پس میں مسلسل اللہ سے سوال کرتا رہا کہ وہ انہیں مجھ سے حجاب میں رکھے تاکہ میں انہیں نہ دیکھوں اور نہ ان سے بات کروں۔ پس اللہ نے میرے ساتھ ایسا ہی کیا اور انہیں میری آنکھ سے چھپا دیا۔\n\nاور میں ذات حق (الحق) کے شہود سے اس لیے تکلیف میں نہیں رہا کہ جب بندہ اپنے رب کا شہود کرتا ہے تو وہ اسے شاہد (دیکھنے والا) یا مشہود (دیکھا جانے والا) کے طور پر دیکھتا ہے۔ لیکن فرشتہ کا شہود ایسا نہیں ہے۔ وہ اسے اپنے سے اجنبی کے طور پر دیکھتا ہے، اگرچہ ذات حق (الحق) اس کی بصارت ہو۔ پس اس صفت کے حامل شخص کے نزدیک یہ اجنبیت میں زیادہ بڑا اور بے چینی میں زیادہ شدید ہوتا ہے، کیونکہ فرشتہ کو اللہ پر نگہبان (رقيب) نہیں ہونا چاہیے، حالانکہ وہ نگہبان ہے۔ پس ضروری ہے کہ فرشتہ اس حال میں اللہ تعالیٰ سے محجوب ہو، وہ بندے کی صفت کا شہود نہ کرے۔ کیونکہ اگر وہ اس کا شہود کر لے تو اس کے لیے اس پر نگہبان ہونا ممکن نہیں رہے گا۔ پس اس بندے کے لیے ضروری ہے کہ وہ فرشتہ کے شہود سے بے چین ہو۔ جب وہ اس کے حواس سے غائب ہو جاتا ہے، تو وہ اپنے رب کے ساتھ اپنے راز میں تنہا ہو جاتا ہے اور فرشتہ پر جو چاہے املا کرتا ہے۔ \"اور اللہ ہر چیز پر نگہبان (رَقِيباً) ہے\" (كَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا)۔ اور فرشتے اللہ کے حکم سے اس انسانی شخص کی حفاظت کرتے ہیں۔ اللہ تعالیٰ نے فرمایا: \"اس کے لیے آگے اور پیچھے سے پے در پے آنے والے (مُعَقِّبَاتٌ) ہیں جو اللہ کے حکم سے اس کی حفاظت کرتے ہیں\" (لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ)۔ پس وہ تسخیر کے فرشتے ہیں جو بندے کے ساتھ اس کے حال کے مطابق ہوتے ہیں، پس وہ اس کے تابع ہوتے ہیں۔\n\nاور یہ فرق ہے کسی شخص پر سلطان کے وکیل مقرر کرنے میں، کیونکہ وکیل اس پر قابو پاتے ہیں اور اس جگہ سے تجاوز نہیں کرتے جسے سلطان نے محدود کیا ہے۔ جبکہ ذات حق (الحق) کے حفاظت کرنے والے (حفظۃ) بندے کی پیروی کرتے ہیں جہاں بھی وہ تصرف کرتا ہے۔ پس وہ اپنے ارادے میں مطلق التصرف ہے۔ اور اگرچہ اس پر بعض تصرفات میں پابندی لگائی گئی ہو، وہ اس میں بھی تصرف کرتا ہے جس پر پابندی لگائی گئی ہے، اور فرشتہ اسے دو وجوہات کی بنا پر اس سے روک نہیں سکتا۔ پہلی وجہ یہ کہ ذات حق (الحق) نے اس بندے کی سماعت کو اس کے قول سے اور اس کی بصارت کو اس کے شہود (شہود) سے لے لیا ہے۔ اور دوسری وجہ یہ کہ اس پر مقرر نگہبان (الحافظ) فرشتہ اسے نہیں روکتا کیونکہ وہ اس تصرف میں ذات حق (الحق) کا شہود کرتا ہے جس کی حفاظت کا اسے حکم دیا گیا ہے۔ اس لیے فرشتہ اس پر تصرف میں پابندی نہیں لگاتا۔ اور مخلوق کا وکیل مقرر کرنا ایسا نہیں ہے۔ کیونکہ وہ حاکم جس نے وکیل مقرر کیے ہیں، وہ اس شخص کے پاس نہیں ہوتا جس پر وکیل مقرر کیے گئے ہیں۔ پس یہ ذات حق (الحق) کے وکیل اور مخلوق کے وکیل کے حکم میں فرق ہے۔ پس مخلوق کے وکیل اسے تصرف سے روکتے ہیں، اور ذات حق (الحق) کے وکیل اسے تصرف میں محفوظ رکھتے ہیں۔ اور اس ذکر میں تنبیہ کے لیے یہ مقدار کافی ہے۔ \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و چهل و چهارم در معرفت حال قطبی که ذکر دائمی‌اش این بود: «هیچ سخنی بر زبان نمی‌آورد مگر اینکه نزد او نگهبانی آماده است.» (مَا يَلْفِظُ مِن قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ)\n\nهمانا نگهبان بر زبان گماشته شده است،\nپس در آنچه بر زبان می‌آورید، بر او توکل کنید.\nاگر صاحب بصیرت (نظرة) هستی، به آن سخن بگو،\nو ای فلان، بر عین الحقیقة (عين الحقيقة) عمل کن.\nو همچنین تمام قوای تو از خودت هستند،\nزیرا آنها عین اویند و عین چیزی است که نادانش نیستی.\nپس اگر نصیحت مرا دانستی و آن را به عین شهود (عین) دیدی،\nخواهی دانست که نگهبان فرستاده شده کیست.\n\n[همانا خداوند بر زبان بنده‌اش فرمود: «خداوند سخن کسی را که او را ستایش کند، شنید.»]\n\nخداوند متعال فرمود: «و همانا بر شما نگهبانانی گماشته شده‌اند، بزرگواران و نویسندگانی که آنچه را انجام می‌دهید می‌دانند.» (وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ كِرَامًا كَاتِبِينَ يَعْلَمُونَ مَا تَفْعَلُونَ) و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا خداوند نزد زبان هر گوینده‌ای است.»\n\nو گوینده‌ای را از گوینده‌ای دیگر تخصیص نداد، بلکه آن را به صورت نکره (نكرة) آورد. پس هر صاحب زبانی که گوینده است، نزد خداست، و آنچه نزد خداست، باقی (باقٍ) است. اما نه هر گوینده‌ای در هر سخنی، سخنش منسوب به خدا باشد، مانند این قول که «همانا خداوند بر زبان بنده‌اش فرمود: خداوند سخن کسی را که او را ستایش کند، شنید.» و محبوب (محبوب) با انجام نوافل (نوافل)، حق (الحق) زبان او می‌شود. پس مراتب متفاوت گشتند. فرشته نگهبان و نویسنده نزد انسان، هر آنچه را که بر زبان آورد، می‌نویسد. پس جز آنچه انسان بر زبان می‌آورد، نمی‌نویسد. هنگامی که آن را بر زبان آورد و پرتاب کرد، پس از پرتاب، فرشته آن را دریافت می‌کند، زیرا خداوند هنگام سخن گفتن او، نزد سخن اوست. پس فرشته آن را نوری می‌بیند که این گوینده‌ای که حق (الحق) نزد زبان اوست، پرتاب کرده است. فرشته آن را با ادب نسبت به آن سخن می‌گیرد و نزد خود تا روز قیامت برای او حفظ می‌کند. و هنگامی که بنده عملی انجام می‌دهد، فرشته می‌داند که او کاری خاص انجام داده است، اما آن را نمی‌نویسد تا زمانی که بنده آن را بر زبان آورد. پس نگهبانان آنچه را که بنده انجام می‌دهد می‌دانند، اما عملی را برای او نمی‌نویسند تا زمانی که آن را بر زبان آورد. پس هنگامی که بر زبان آورد، می‌نویسند. بنابراین، آنها شاهدان اقرار هستند. و علت این امر، عدم اطلاع آنها بر نیتی است که بنده در آن فعل داشته است. به همین دلیل، فرشتگان عروج‌دهنده اعمال، با عمل بنده بالا می‌روند در حالی که آن را کم می‌شمارند، اما از آنها پذیرفته می‌شود و در علیین (عليين) نوشته می‌شود. و با عملی بالا می‌روند در حالی که آن را زیاد می‌شمارند، اما به آنها گفته می‌شود: «این عمل را به صورت صاحبش بزنید، زیرا او روی مرا با آن نخواسته است.» و «به آنها دستور داده نشد مگر اینکه خدا را بپرستند، در حالی که دین را برای او خالص گردانند و حق‌گرا باشند.» (وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ). اگر نگهبانان آنچه را که در نیت بنده هنگام عمل است می‌دانستند، چنین خبری وارد نمی‌شد. پس نیت در اعمال از جانب بنده جز از وجه خاص (الوجه الخاص) نیست، و به همین دلیل، جز خدا و عاملی که در آن نیت کرده است، کسی از آن آگاه نیست. پس فرشته حرکت بنده را زیر نظر دارد و حرکت زبان او را هنگامی که سخن می‌گوید، می‌نویسد. و خداوند شهود (شهود) است، زیرا او نزد قول بنده‌اش است بر حقیقت (الحقيقة)، نه نزد بنده‌اش. این کینونت (کینونة) الهی است که با حدوث قول حادث می‌شود، و علت آن این است که آن تکوین (تكوين) است، و تکوین هرگز جز از قول الهی در هر موجودی نیست. پس تمام آنچه در هستی (الوجود) تکوین می‌یابد، از قول الهی است. پس میان حق (الحق) و بنده، مناسبتی کامل‌تر و عام‌تر از مناسبت قول نیست، و به همین دلیل بود که نزد زبان هر گوینده‌ای قرار گرفت. زیرا قول، کونی است که از گوینده‌اش جدا می‌شود. اگر خداوند نزد آن نباشد، قول تباه می‌شود. و خداوند نزد آن بود تا آن را به صورت قائم و کامل‌الخلقه ایجاد کند. زیرا ناگزیر است که خداوند متعال به واسطه آن یاد شود، و از آن، آنچه را که بنده از کمالی که شایسته نشأت آن است، ناقص کرده، کامل سازد. همان‌گونه که صدقه را می‌پذیرد تا آن را پرورش دهد تا از کوه بزرگ نیز بزرگ‌تر شود.\n\nاین از باب غیرت (الغيرة) است و اولی از باب کمال و آنچه شایسته است. پس غیرت بر ساحت الهی از جانب خداوندی است که کمال مطلق (الكمال المطلق) از آن اوست. سپس بدان که نقص از کمال هستی (كمال الوجود) است، نه از کمال صورت. پس آگاه باش که این نکته‌ای دقیق است.\n\nاگر در هستی (الوجود) نقصی نبود،\nاز مرتبه کمال (الكمال) زائل می‌شد.\nاما ناقص است، پس صاحب جلال\nکمال خود را در آن آشکار ساخت.\nپس هیچ ساخته‌ای از هیچ خلقی نیست\nمگر اینکه خداوند آن را از جمال خالی نکرده است.\nزیرا در هر گرهی و در هر حالی\nبه سوی او باز می‌گردد.\nپس هیچ کمال و هیچ جمالی نیست\nمگر به سوی خداوند صاحب رفعت‌ها.\nاز هر شخص و به هر وجهی،\nدر فعل و حال و گفتار.\nای کسی که مرا به عین حق (عين حق) می‌بینی،\nحکم را به خیال (الخیال) مسپار.\nزیرا خیال گره هر هدایت‌گری است،\nبلکه هدایت‌یافته‌ای است که از گمراهی نیست.\n\nو اگر چنین است، بکوش تا هیچ صورتی از تو صادر نشود مگر اینکه در گفتار و عمل، در نهایت کمال (الكمال) خلق شده باشد. و فریب این را نخور که نقص از کمال هستی (كمال الوجود) است، زیرا آن نقص از کمال هستی است، نه از کمال آنچه از تو به وجود آمده است. زیرا گروهی از مردم در این موضع لغزیدند که ما با آنها ملاقات کردیم. پس این ذکر برای صاحبش مشاهده حق (مشاهدة الحق) را هنگام سخن گفتن و پذیرش آن برای او به بار می‌آورد. و هر کس نگهبانان (الحفظة) را مشاهده کند، از این مقام آنها را مشاهده کرده است. و هنگامی که حق تعالی آنها را به من نشان داد، از مشاهده آنها در عذاب بودم و از مشاهده حق (الحق) در عذاب نبودم. پس پیوسته از خداوند می‌خواستم که آنها را از من محجوب سازد تا نه آنها را ببینم و نه با آنها سخن بگویم. و خداوند این کار را برای من انجام داد و آنها را از چشم من پوشاند. و علت اینکه از مشاهده حق در عذاب نبودم این است که بنده هنگام شهود (الشهود) پروردگارش، او را شاهد یا مشهود می‌بیند، اما شهود فرشته این‌گونه نیست، زیرا فرشته او را بیگانه از خود می‌بیند. و حتی اگر حق (الحق) بصر او باشد، در بیگانگی بزرگ‌تر و در اضطراب نزد صاحب این صفت شدیدتر است، زیرا شایسته نیست که فرشته نگهبان خدا باشد، در حالی که او نگهبان است. پس ناگزیر است که فرشته در این حال از خداوند متعال محجوب باشد و صفت بنده‌اش را شهود نکند، زیرا اگر آن را شهود می‌کرد، نمی‌توانست نگهبان او باشد. پس این بنده ناگزیر است که از شهود فرشته مضطرب شود. هنگامی که فرشته از حس او غایب شد، با سرّ خود با پروردگارش خلوت می‌کند و آنچه را که می‌خواهد بر فرشته املا می‌کند. پس «خداوند بر هر چیزی نگهبان است.» (كَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا). و فرشتگان این شخص انسانی را به امر خدا حفظ می‌کنند. خداوند متعال فرمود: «برای او تعقیب‌کنندگانی است که از پیش رو و پشت سر او، او را به امر خدا حفظ می‌کنند.» (لَهُ مُعَقِّبَاتٌ مِّن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ). پس آنها فرشتگان تسخیر (ملائكة تسخير) هستند که همراه بنده می‌باشند، بسته به حالتی که بنده بر آن است، و آنها تابع او هستند. و این تفاوت میان گماشتن وکیل از سوی سلطان بر شخصی است، زیرا وکلا بر او حکم می‌رانند و از موضعی که سلطان او را از آن منع کرده است، تجاوز نمی‌کنند. اما نگهبانان حق (حفظة الحق) بنده را هر جا که تصرف کند، دنبال می‌کنند. پس او در اراده‌اش مطلق‌التصرف است. و اگرچه از برخی تصرفات منع شده باشد، در آنچه منع شده است تصرف می‌کند و فرشته نمی‌تواند او را از آن باز دارد، به دو دلیل: اول اینکه خداوند حق (الحق) را با گوش این بنده از قول او و با بصر او از شهودش برده است. و دلیل دیگر اینکه فرشته نگهبان موکل بر او، او را منع نمی‌کند، زیرا حق (الحق) را در تصرفی که مأمور به حفظ آن است، همراه او شهود می‌کند. به همین دلیل، فرشته تصرف را بر او منع نمی‌کند. و توکیل مخلوق این‌گونه نیست، زیرا حاکمی که وکلا را گماشته است، نزد موکل‌علیه نیست. پس این تفاوت میان حکم وکیل حق (وکیل الحق) و وکیل مخلوق است. وکلای خلق او را از تصرف حفظ می‌کنند، و وکلای حق او را در تصرف حفظ می‌کنند. و این مقدار در این ذکر از تنبیه کافی است. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند.» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}