{
  "id": 446,
  "title": {
    "ar": "الباب السادس والأربعون وأربعمائة في معرفة منازلة في تعمير نواشئ الليل فوائد الخيرات",
    "en": "Chapter Four Hundred and Forty-Six: Concerning the Gnosis of the Stations in the Cultivation of the Emerging Hours of the Night, [and] the Benefits of Blessings.",
    "ur": "باب چار سو چھیالیس (۴۴۶): رات کے ابتدائی حصوں (نواشئ الليل) کو آباد کرنے میں اس کے مقامات (منازل) کی معرفت (المعرفۃ) اور خیرات کے فوائد کا بیان",
    "fa": "باب چهارصد و چهل و ششم در معرفت منازل سالک در آبادانی (تعمیر) نوخاسته‌های شب (نواشئ اللیل) برای فواید خیرات"
  },
  "content": {
    "ar": "## «الباب السادس والأربعون وأربعمائة في معرفة منازلة في تعمير نواشئ الليل فوائد الخيرات»\n\n\n> نواشئ الليل فيها الخير أجمعه *** فيها النزول من الرحمن بالكرم‏\n\n\n> يدنو إلينا بنا حتى يساعدنا *** بما يدليه من طرائف الحكم‏\n\n\n> فالكل يعبده والكل يشكره *** إلا الذي خص بالخسران والنقم‏\n\n\n> إن الولي تراه وقت غفلته *** يبكي ويدعوه في داج من الظلم‏\n\n\n> يا رب يا رب لا يبغي به بدلا *** خلقا عظيما كما قد جاء في القلم‏\n\n\n### [كان خلق محمد صَلَّى اللهُ عَليهِ وسَلَّم القرآن‏]\n\n\nقال الله تعالى وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ وقال إِنَّ ناشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئاً وأَقْوَمُ قِيلًا ولما سألت عائشة عن خلق رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قالت كان خلقه القرآن‏\n\n\nوإنما قالت ذلك لأنه أفرد الخلق ولا بد أن يكون ذلك الخلق المفرد جامعا لمكارم الأخلاق كلها ووصف الله ذلك الخلق بالعظمة كما وصف القرآن في قوله والْقُرْآنَ الْعَظِيمَ فكان القرآن‏\nخلقه فمن أراد أن يرى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ممن لم يدركه من أمته فلينظر إلى القرآن فإذا نظر فيه فلا فرق بين النظر إليه وبين النظر إلى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فكان القرآن انتشا صورة جسدية يقال لها محمد بن عبد الله بن عبد المطلب والقرآن كلام الله وهو صفته فكان محمد صفة الحق تعالى بجملته ف من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله لأنه لا ينطق عن الهوى فهو لسان حق فكان صَلَّى اللهُ عَليهِ وسَلَّم ينشئ في ليل هيكله وظلمة طبيعته بما وفقه الله إليه من العمل الصالح الذي شرعه له صورا عملية ليلية لكون الليل محل التجلي الإلهي الزماني من اسمه الدهر تعالى يستعين بالحق لتجليه في إنشائها على الشهود وهو قوله تعالى إِنَّ قُرْآنَ الْفَجْرِ كانَ مَشْهُوداً ولم تكن هذه الصور إلا الصلاة بالليل دون سائر الأعمال وإنما قلنا بالاستعانة\n\n\nلقوله تعالى قسمت الصلاة بيني وبين عبدي‏\n\n\nوقوله اسْتَعِينُوا بِاللَّهِ ولا يطلب العون إلا من له نوع تعمل في العمل وهو قوله وإِيَّاكَ نَسْتَعِينُ فكن أنت يا وارثه هو المراد بهذا الخطاب في هذا العمل فيكون محمد صَلَّى اللهُ عَليهِ وسَلَّم ما فقد من الدار الدنيا لأنه صورة القرآن العظيم فمن كان خلقه القرآن من ورثته وأنشأ صورة الأعمال في ليل طبيعته فقد بعث محمدا صَلَّى اللهُ عَليهِ وسَلَّم من قبره فحياة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بعد موته حياة سنته ومن أحياه فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً فإنه المجموع الأتم والبرنامج الأكمل ولهذا قال في ناشئة الليل إنها أَقْوَمُ قِيلًا ولا أقوم قيلا من القرآن وكذلك أَشَدُّ وَطْئاً أي أعظم تمهيدا لأنه قال ما فَرَّطْنا في الْكِتابِ من شَيْ‏ءٍ وليس إلا القرآن الجامع وأشد ثباتا فإنه لا ينسخ كما نسخت سائر الكتب قبله به وإن ثبت ما ثبت منها مما ورد في القرآن ولهذا جاء بلفظ المفاضلة في الثبوت فهو أشد ثبوتا منها لاتصاله بالقيامة وفيه ما في الكتب وما ليس في الكتب كما كان في محمد صَلَّى اللهُ عَليهِ وسَلَّم ما كان في كل نبي وكان فيه ما لم يكن في نبي لأن القرآن كان خلقه فأعطى هو وأمته ما لم يعط نبي قبله فإذا أنشأ من أنشأ صورة هذه الأعمال الليلية ونفخ الحق لشهوده من كونه معينا له أرواحها فيها قامت حية ناطقة عن أصل كريم الطرفين بين عبد متحقق بعبوديته موف حق سيده لم يلتفت إلى نفسه ولا إلى صورة ما خلقه الله عليها التي توجب له الكبرياء بل كان عبدا محضا مع هذه المنزلة ولهذا قدم إِيَّاكَ نَعْبُدُ فإنه ما قبل الصورة إلا في ثان حال فقال بذاته إِيَّاكَ نَعْبُدُ وقال بالصورة وإِيَّاكَ نَسْتَعِينُ ثم رجع فقال اهْدِنَا الصِّراطَ الْمُسْتَقِيمَ صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ ولا الضَّالِّينَ فجمع بين الأمرين وبين رب عظيم وفاه حقه على قدر ما شرعه له لا يطالب بغير ذلك فإنه تعالى هو الذي أدبه أي جمع له وفيه جميع فوائد الخيرات فلما نشأت هذه الصورة العملية الليلية بين هذين الطرفين الكريمين كانت وسطا جامعة للطرفين فكانت عبدا سيدا حقا خلقا وبهذه الصفة أنشأ الله العالم ابتداء فإن له في أسمائه ونعوته الطرفين فإنه وصف نفسه بما يتعالى به عن الخلق ووصف نفسه بما هو عليه الخلق ولم يزل بهذين النعتين موصوفا لنفسه وهما طرفا نقيض فجمع بين الضدين ولو لا ما هو الأمر على هذا ما خلق الضدين في العالم والمثلان ضدان فهما ضدا المماثلة حتى تعلم أن العالم على صورته في قبول الضدين بل هو العالم الذي هو عين الضدين صورة من أنشأه فظهر العالم بالأصالة بين الطرفين ومشى الأمر في خلق ما خلق الله بأيدي العالم فللعالم إنشاء الصور وللحق أرواحها وحياتها كما قال في حق عيسى عليه السلام وإِذْ تَخْلُقُ من الطِّينِ كَهَيْئَةِ الطَّيْرِ في الصورة الخلقية فَيَكُونُ طَيْراً بِإِذْنِ الله فجعل الصورة للخلق وكونه طائرا للحق وفي إنشائك قال فَإِذا سَوَّيْتُهُ هو مثل تَخْلُقُ من الطِّينِ كَهَيْئَةِ الطَّيْرِ ثم قال ونَفَخْتُ فِيهِ من رُوحِي وهو قوله فَتَكُونُ طَيْراً بِإِذْنِي فمن كان مع الحق في مقام الشهود والجمع عند إنشاء العبد صور الأعمال قامت حية ناطقة وإن أنشأها على غير هذا النعت من الجمع والشهود كانت صورا بلا أرواح كصور المصورين الذين‏\n\n\nيقول الله لهم يوم القيامة أحيوا ما خلقتم فلا يستطيعون‏\n\n\nلأن الأحياء ليس لهم وإنما هو لله وأعني بالإحياء الأحياء الذي تقع به الفائدة من الحي فإن الطبيعة تعطي حياة في الصورة ولكن حياة لا فائدة معها وهي الحياة التي توجد في المعفنات فليس في قوة الطبيعة أكثر من وجود الإحساس لا غير وأما القوي الروحانية التي عنها تكون الصنائع العملية بالتفكر فمن الروح الإلهي فمن علم مراتب الأرواح يعلم ما أومأنا إليه في هذه العجالة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "Chapter 446: Concerning the Knowledge of its Stations in Cultivating the Arising of the Night (نواشئ الليل) and the Benefits of Good Deeds\n\nThe arising of the night (نواشئ الليل) contains all goodness;\nIn it is the descent of the All-Merciful (الرحمن) with generosity.\n\nHe draws near to us through us, until He aids us,\nWith the wondrous wisdom (طرائف الحكم) that He reveals.\n\nThus, all worship Him, and all thank Him,\nExcept for the one singled out for loss and vengeance.\n\nIndeed, you see the saint (الولي) at the time of his heedlessness,\nWeeping and calling upon Him in the deep darkness (داج من الظلم).\n\n\"O Lord, O Lord,\" he seeks no substitute for Him,\nA magnificent character (خلقا عظيما), as has come down in the Pen (القلم).\n\n[The Character (خلق) of Muhammad (peace and blessings be upon him) was the Quran]\n\nAllah the Exalted said: <<وَإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ>> (And indeed, you are upon a magnificent character). And He said: <<إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا>> (Indeed, the arising of the night is more firm in tread and more upright in speech). When Aisha was asked about the character (خلق) of the Messenger of Allah (peace and blessings be upon him), she replied: \"His character was the Quran.\"\n\nShe only said that because the character (خلق) was singularized, and that singular character must necessarily be comprehensive of all noble moral qualities. Allah described that character with magnificence, just as He described the Quran in His saying: <<وَالْقُرْآنَ الْعَظِيمَ>> (And the Magnificent Quran). Thus, the Quran was his character. Therefore, whoever among his community did not meet the Messenger of Allah (peace and blessings be upon him) but wishes to see him, let him look at the Quran. When he looks into it, there is no difference between looking at it and looking at the Messenger of Allah (peace and blessings be upon him). The Quran was the manifestation of a physical form called Muhammad ibn Abdullah ibn Abd al-Muttalib.\n\nThe Quran is the Speech of Allah, and it is His Attribute (صفة). Thus, Muhammad was the Attribute of the Real (الحق) in its entirety. Therefore, <<مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ>> (Whoever obeys the Messenger has obeyed Allah), because he does not speak out of caprice; he is the tongue of the Real (لسان حق).\n\nThus, the Prophet (peace and blessings be upon him) would cultivate, within the night of his physical structure (هيكله) and the darkness of his nature (طبيعته), practical nocturnal forms through the righteous deeds that Allah guided him to and legislated for him. This is because the night is the locus of the temporal Divine Theophany (التجلي الإلهي الزماني) stemming from His Name, *al-Dahr* (Time/Eternity). He seeks aid from the Real (الحق) for His Self-disclosure (تجليه) in the creation of these forms, leading to Witnessing (الشهود). This is confirmed by His saying: <<إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا>> (Indeed, the recitation of the dawn is ever witnessed). These forms were none other than the prayer (الصلاة) performed at night, distinct from all other deeds. We mentioned seeking aid (الاستعانة) because of His saying, the Exalted: \"I have divided the prayer between Myself and My servant,\" and His saying: <<اسْتَعِينُوا بِاللَّهِ>> (Seek aid through Allah). Aid is only sought by one who has a type of active participation in the deed, which is His saying: <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help).\n\nTherefore, you, O inheritor (وارثه), be the one intended by this address in this action. Thus, Muhammad (peace and blessings be upon him) is not lost from the worldly abode, because he is the image of the Magnificent Quran. Whoever among his inheritors has the Quran as his character (خلق) and cultivates the form of deeds within the night of his nature (طبيعته) has resurrected Muhammad (peace and blessings be upon him) from his grave. The life of the Messenger of Allah (peace and blessings be upon him) after his death is the life of his Sunnah, and whoever revives it is as though <<أَحْيَا النَّاسَ جَمِيعًا>> (he has revived all of mankind).\n\nFor he (the Prophet) is the most complete totality (المجموع الأتم) and the most perfect program (البرنامج الأكمل). This is why He said concerning the arising of the night (ناشئة الليل) that it is <<أَقْوَمُ قِيلًا>> (more upright in speech)—and there is no speech more upright than the Quran. Likewise, it is <<أَشَدُّ وَطْئًا>> (more firm in tread), meaning it is the greatest preparation, because He said: <<مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ>> (We have not neglected in the Register a thing). This Register is none other than the comprehensive Quran. It is also the most stable (أشد ثباتا), for it is not abrogated, unlike the other scriptures that were abrogated by it, even if some parts of those scriptures that are mentioned in the Quran remain established.\n\nFor this reason, the term of preference (المفاضلة) was used regarding its stability; it is more stable than them due to its connection with the Resurrection (القيامة). It contains what is in the other scriptures and what is not in them, just as Muhammad (peace and blessings be upon him) possessed what every prophet possessed, and also possessed what no other prophet possessed, because the Quran was his character (خلق). Thus, he and his community were given what no prophet before him was given.\n\nTherefore, when someone cultivates the form (صورة) of these nocturnal deeds, and the Real (الحق) breathes their spirits (أرواحها) into them—due to the Witnessing (شهود) of the servant, since the Real is aiding him—those deeds stand up alive and speaking, originating from a noble source of two ends: between a servant realized in his servitude (عبوديته), fulfilling the right of his Lord, who does not turn to himself or to the form upon which Allah created him (which might necessitate arrogance), but remains a pure servant despite this high station.\n\nThis is why <<إِيَّاكَ نَعْبُدُ>> (You alone we worship) is placed first, for He only accepted the form (الصورة) in the second instance. So, the servant said, by his Essence (بذاته): <<إِيَّاكَ نَعْبُدُ>> (You alone we worship), and he said, by his form (بالصورة): <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help). Then he returned and said: <<اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ>> (Guide us to the straight path—the path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray). Thus, he combined the two matters and stood between a magnificent Lord whose right he fulfilled according to what He legislated for him, demanding nothing beyond that.\n\nFor He, the Exalted, is the One who disciplined him (أدبه), meaning He gathered for him and within him all the benefits of good deeds (فوائد الخيرات). When this nocturnal practical form (الصورة العملية الليلية) arose between these two noble ends, it became a middle ground (وسطا) combining both ends. Thus, it was a servant and a lord, the Real (حق) and the creation (خلق). It was with this characteristic that Allah initially created the World (العالم), for He possesses the two ends in His Names (الأسماء) and Attributes (النعوت). He described Himself with that by which He transcends creation, and He described Himself with that which creation is upon. He has always been described by Himself with these two characteristics, which are two opposing ends (طرفا نقيض). Thus, He combined the two opposites (الضدين).\n\nWere the matter not thus, He would not have created the two opposites (الضدين) in the World (العالم). Even two similars are opposites, being opposites of similarity, so that you may know that the World is upon His image in accepting the two opposites. Rather, the World, which is the very essence of the two opposites, is the image of the One who created it. Thus, the World appeared essentially between the two ends, and the process of creating what Allah created proceeded through the hands of the World.\n\nThe creation of forms (الصور) belongs to the World (العالم), while their spirits (أرواحها) and life belong to the Real (الحق). This is as He said concerning Jesus (peace be upon him): <<وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ>> (When you create from clay the shape of a bird)—this refers to the created form (الصورة الخلقية)—<<فَيَكُونُ طَيْرًا بِإِذْنِ اللَّهِ>> (and it becomes a bird by Allah’s permission). Thus, He assigned the form to the creation and its becoming a bird to the Real. Regarding your own creation, He said: <<فَإِذَا سَوَّيْتُهُ>> (When I have proportioned him)—which is like <<تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ>> (you create from clay the shape of a bird)—then He said: <<وَنَفَخْتُ فِيهِ مِنْ رُوحِي>> (and breathed into him of My Spirit), which corresponds to His saying: <<فَتَكُونُ طَيْرًا بِإِذْنِي>> (and it becomes a bird by My permission).\n\nTherefore, whoever is with the Real (الحق) in the station of Witnessing (الشهود) and Gathering (الجمع) when the servant cultivates the forms of deeds, those deeds stand up alive and speaking. But if he cultivates them without this characteristic of Gathering and Witnessing, they are forms without spirits, like the images made by painters, to whom Allah will say on the Day of Resurrection: \"Give life to what you have created!\" and they will not be able to, because giving life belongs not to them but only to Allah.\n\nBy \"giving life,\" I mean the life from which benefit is derived from the living thing. For nature (الطبيعة) grants life to the form, but it is a life without benefit, such as the life found in decaying matter. The power of nature extends no further than the existence of mere sensation. As for the spiritual powers (القوي الروحانية) from which practical crafts arise through contemplation, these stem from the Divine Spirit (الروح الإلهي). Whoever knows the Levels of Spirits (مراتب الأرواح) will understand what we have alluded to in this brief discussion. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "## باب نمبر ۴۴۶: رات کے ابتدائی حصوں کو آباد کرنے میں خیرات کے فوائد کے مراتب کی معرفت میں\n\nرات کے ابتدائی حصوں میں تمام خیرات جمع ہیں\nان میں رحمن کی طرف سے کرم کے ساتھ نزول ہوتا ہے\n\nوہ اپنی ذات کے ذریعے ہمارے قریب ہوتا ہے تاکہ ہماری مدد کرے\nان حکمتوں کے ذریعے جو وہ لطائف کی صورت میں نازل کرتا ہے\n\nپس سب اس کی عبادت کرتے ہیں اور سب اس کا شکر ادا کرتے ہیں\nسوائے اس کے جو خسارے اور عذاب کے لیے مخصوص کیا گیا\n\nجب ولی غفلت کے وقت میں ہوتا ہے تو تم اسے دیکھتے ہو\nکہ وہ تاریکی کی رات میں روتا ہے اور اسے پکارتا ہے\n\nاے رب! اے رب! وہ اس کے بدلے میں کچھ نہیں چاہتا\nیہ ایک عظیم خلق ہے جیسا کہ قلم میں آ چکا ہے\n\n### [محمد صلی اللہ علیہ وسلم کا خلق قرآن تھا]\n\nاللہ تعالیٰ نے فرمایا:\n**وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ**\n(اور بے شک آپ اخلاق کے عظیم مرتبے پر فائز ہیں)\n\nاور فرمایا:\n**إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا**\n(بے شک رات کا اٹھنا نفس کو زیادہ پامال کرنے والا اور بات کو زیادہ سیدھا کرنے والا ہے)\n\nاور جب حضرت عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کے خلق کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"آپ کا خلق قرآن تھا\"۔\n\nانہوں نے یہ اس لیے کہا کہ آپ نے خلق کو منفرد کر دیا، اور ضروری ہے کہ وہ منفرد خلق تمام مکارمِ اخلاق کو جامع ہو۔ اور اللہ نے اس خلق کو عظمت سے متصف کیا، جیسا کہ قرآن کو اپنے اس قول میں عظمت سے متصف کیا:\n**وَالْقُرْآنَ الْعَظِيمَ**\n(اور قرآن عظیم)\n\nپس قرآن آپ کا خلق تھا۔ لہٰذا، آپ کی امت میں سے جو شخص آپ کو نہیں پا سکا، اگر وہ رسول اللہ صلی اللہ علیہ وسلم کو دیکھنا چاہتا ہے تو اسے چاہیے کہ وہ قرآن کو دیکھے۔ جب وہ اس میں دیکھے گا تو اس کے دیکھنے اور رسول اللہ صلی اللہ علیہ وسلم کو دیکھنے میں کوئی فرق نہیں ہوگا۔ پس قرآن ایک جسمانی صورت میں ظاہر ہوا جسے محمد بن عبداللہ بن عبدالمطلب کہا جاتا ہے۔ اور قرآن اللہ کا کلام ہے اور وہ اس کی صفت ہے۔ پس محمد (صلی اللہ علیہ وسلم) مکمل طور پر ذات حق (الحق) کی صفت تھے۔\n\nلہٰذا:\n**مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ**\n(جس نے رسول کی اطاعت کی، اس نے اللہ کی اطاعت کی)\n\nکیونکہ وہ خواہش سے نہیں بولتے، پس وہ حق (الحق) کی زبان ہیں۔ پس آپ صلی اللہ علیہ وسلم اپنے جسم کے رات اور اپنی طبیعت کی تاریکی میں، اس عمل صالح کے ذریعے جو اللہ نے آپ کو توفیق دی اور آپ کے لیے مشروع کیا، عملی رات کی صورتیں (صور عملیۃ لیلیۃ) پیدا کرتے تھے، کیونکہ رات اسم الدھر (الدهر) سے الٰہی ظہور (التجلی) کا زمانی مقام ہے۔ آپ حق (الحق) سے مدد طلب کرتے تھے تاکہ اس کے ظہور (التجلی) کے ذریعے ان صورتوں کو شہود (الشہود) پر قائم کر سکیں، اور یہی اللہ تعالیٰ کا قول ہے:\n**إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا**\n(بے شک فجر کا قرآن مشہود ہوتا ہے)\n\nاور یہ صورتیں رات کی نماز کے علاوہ کوئی اور عمل نہیں تھیں۔ اور ہم نے مدد طلب کرنے کی بات اس لیے کہی:\n\nکہ اللہ تعالیٰ کا فرمان ہے: \"میں نے نماز کو اپنے اور اپنے بندے کے درمیان تقسیم کر دیا ہے۔\"\n\nاور اس کا قول:\n**اسْتَعِينُوا بِاللَّهِ**\n(اللہ سے مدد طلب کرو)\n\nاور مدد صرف اسی سے طلب کی جاتی ہے جس کا عمل میں کسی قسم کا عمل دخل ہو، اور یہی اس کا قول ہے:\n**وَإِيَّاكَ نَسْتَعِينُ**\n(اور ہم تجھ ہی سے مدد مانگتے ہیں)\n\nپس اے آپ کے وارث! آپ ہی اس عمل میں اس خطاب کے مخاطب ہیں۔ پس محمد صلی اللہ علیہ وسلم دارِ دنیا سے مفقود نہیں ہوئے، کیونکہ وہ قرآن عظیم کی صورت ہیں۔ پس ان کے وارثوں میں سے جس کا خلق قرآن ہو اور جس نے اپنی طبیعت کی رات میں اعمال کی صورتیں پیدا کیں، اس نے محمد صلی اللہ علیہ وسلم کو ان کی قبر سے دوبارہ مبعوث کر دیا۔ پس رسول اللہ صلی اللہ علیہ وسلم کی وفات کے بعد ان کی زندگی ان کی سنت کی زندگی ہے۔ اور جس نے اسے زندہ کیا،\n**فَكَأَنَّمَا أَحْيَا النَّاسَ جَمِيعًا**\n(تو گویا اس نے تمام انسانوں کو زندہ کر دیا)\n\nکیونکہ وہ مجموعِ اتم اور مکمل پروگرام ہیں۔ اسی لیے رات کے ابتدائی حصے (ناشئۃ اللیل) کے بارے میں فرمایا کہ وہ **أَقْوَمُ قِيلًا** (بات کو زیادہ سیدھا کرنے والا) ہے، اور قرآن سے زیادہ سیدھی بات کوئی نہیں۔ اور اسی طرح **أَشَدُّ وَطْئًا** (زیادہ پامال کرنے والا) یعنی سب سے زیادہ مضبوط بنیاد رکھنے والا، کیونکہ فرمایا:\n**مَا فَرَّطْنَا فِي الْكِتَابِ مِن شَيْءٍ**\n(ہم نے کتاب میں کوئی چیز نہیں چھوڑی)\n\nاور یہ جامع قرآن کے سوا کچھ نہیں۔ اور یہ سب سے زیادہ ثابت قدم ہے، کیونکہ یہ منسوخ نہیں ہوتا، جیسا کہ اس سے پہلے کی تمام کتابیں اس کے ذریعے منسوخ ہو گئیں۔ اگرچہ ان میں سے جو کچھ قرآن میں آیا ہے وہ ثابت رہا۔ اسی لیے ثبوت میں تفضیل کا لفظ آیا ہے، پس یہ ان سے زیادہ مضبوط ثبوت رکھتا ہے کیونکہ یہ قیامت سے متصل ہے۔ اور اس میں وہ سب کچھ ہے جو دیگر کتابوں میں ہے اور وہ بھی جو ان میں نہیں ہے، جیسا کہ محمد صلی اللہ علیہ وسلم میں وہ سب کچھ تھا جو ہر نبی میں تھا اور وہ بھی جو کسی نبی میں نہیں تھا۔ کیونکہ قرآن آپ کا خلق تھا، پس آپ کو اور آپ کی امت کو وہ کچھ عطا کیا گیا جو آپ سے پہلے کسی نبی کو نہیں دیا گیا۔\n\nپس جب کوئی شخص ان رات کے عملی صورتوں کو پیدا کرتا ہے، اور حق (الحق) اس کے لیے مددگار ہونے کی وجہ سے ان میں ان کی روحیں پھونکتا ہے تاکہ وہ ان کا شہود (الشہود) کر سکے، تو وہ زندہ اور ناطق ہو کر کھڑی ہو جاتی ہیں، جو دو کریم فریقوں کے ایک اصل سے ظاہر ہوتی ہیں: ایک بندہ جو اپنی بندگی (عبودیۃ) کو متحقق کرتا ہے اور اپنے آقا کا حق پورا کرتا ہے، جو نہ اپنی طرف متوجہ ہوتا ہے اور نہ ہی اس صورت کی طرف جس پر اللہ نے اسے پیدا کیا ہے جو اس کے لیے تکبر کا موجب ہو، بلکہ وہ اس مرتبے کے باوجود خالص بندہ تھا۔ اسی لیے اس نے **إِيَّاكَ نَعْبُدُ** (ہم تیری ہی عبادت کرتے ہیں) کو مقدم کیا، کیونکہ اس نے صورت کو صرف دوسری حالت میں قبول کیا، پس اس نے اپنی ذات سے کہا: **إِيَّاكَ نَعْبُدُ**، اور صورت کے ساتھ کہا: **وَإِيَّاكَ نَسْتَعِينُ** (اور ہم تجھ ہی سے مدد مانگتے ہیں)۔ پھر رجوع کیا اور کہا:\n**اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ**\n(ہمیں سیدھے راستے پر چلا، ان لوگوں کے راستے پر جن پر تو نے انعام کیا، نہ کہ ان کے راستے پر جن پر غضب ہوا اور نہ گمراہوں کے راستے پر)\n\nپس اس نے دونوں امور کو جمع کیا، اور ایک عظیم رب کے درمیان جس کا حق اس نے اس قدر پورا کیا جتنا اس نے اس کے لیے مشروع کیا، وہ اس کے علاوہ کسی چیز کا مطالبہ نہیں کرتا، کیونکہ وہ (اللہ تعالیٰ) ہی ہے جس نے اسے ادب سکھایا، یعنی اس کے لیے اور اس میں تمام خیرات کے فوائد کو جمع کر دیا۔\n\nپس جب یہ رات کی عملی صورت ان دو کریم فریقوں کے درمیان پیدا ہوئی، تو وہ ایک درمیانی جامع تھی جو دونوں فریقوں کو جمع کرتی تھی، پس وہ ایک بندہ، آقا، حق (الحق)، اور خلق (خلق) تھی۔ اور اسی صفت کے ساتھ اللہ نے ابتداء میں عالم کو پیدا کیا، کیونکہ اس کے اسماء و صفات میں دونوں فریق موجود ہیں۔ پس اس نے اپنی ذات کو ان چیزوں سے متصف کیا جن سے وہ مخلوق سے بلند ہوتا ہے، اور اپنی ذات کو ان چیزوں سے بھی متصف کیا جن پر مخلوق قائم ہے۔ اور وہ ہمیشہ ان دو صفات سے اپنی ذات کے لیے متصف رہا ہے، اور یہ دونوں متضاد فریق ہیں۔ پس اس نے دو متضاد چیزوں کو جمع کیا، اور اگر معاملہ ایسا نہ ہوتا تو وہ عالم میں متضاد چیزوں کو پیدا نہ کرتا۔ اور مماثل چیزیں بھی متضاد ہوتی ہیں، پس وہ مماثلت کے متضاد ہیں، تاکہ تم جان لو کہ عالم متضاد چیزوں کو قبول کرنے میں اس کی صورت پر ہے، بلکہ وہ عالم جو عینِ متضاد ہے، اس کی صورت ہے جس نے اسے پیدا کیا۔ پس عالم اصالت کے ساتھ دونوں فریقوں کے درمیان ظاہر ہوا، اور اللہ نے جو کچھ پیدا کیا اس کی تخلیق کا معاملہ عالم کے ہاتھوں میں چل پڑا۔ پس صورتوں کو پیدا کرنا عالم کے لیے ہے، اور ان کی روحیں اور ان کی زندگی حق (الحق) کے لیے ہے، جیسا کہ اس نے عیسیٰ علیہ السلام کے حق میں فرمایا:\n**وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ**\n(اور جب تم مٹی سے پرندے کی شکل جیسی صورت بناتے تھے)\n\nیہ خلقی صورت میں ہے، پھر فرمایا:\n**فَيَكُونُ طَيْرًا بِإِذْنِ اللَّهِ**\n(تو وہ اللہ کے حکم سے پرندہ بن جاتا تھا)\n\nپس اس نے صورت کو مخلوق کے لیے قرار دیا اور اس کا پرندہ بن جانا حق (الحق) کے لیے۔ اور تمہارے پیدا کرنے کے بارے میں فرمایا:\n**فَإِذَا سَوَّيْتُهُ**\n(پھر جب میں اسے درست کر لوں)\n\nیہ **تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ** کی طرح ہے۔ پھر فرمایا:\n**وَنَفَخْتُ فِيهِ مِن رُّوحِي**\n(اور میں اس میں اپنی روح پھونک دوں)\n\nاور یہی اس کا قول ہے: **فَتَكُونُ طَيْرًا بِإِذْنِي** (تو وہ میرے حکم سے پرندہ بن جاتا ہے)۔\n\nپس جو شخص حق (الحق) کے ساتھ شہود (الشہود) اور جمع (الجمع) کے مقام پر ہو جب بندہ اعمال کی صورتیں پیدا کرتا ہے، تو وہ زندہ اور ناطق ہو کر کھڑی ہو جاتی ہیں۔ اور اگر وہ انہیں جمع (الجمع) اور شہود (الشہود) کی اس صفت کے بغیر پیدا کرے، تو وہ روحوں کے بغیر صورتیں ہوں گی، جیسے مصوروں کی صورتیں جن سے اللہ قیامت کے دن فرمائے گا: \"جو تم نے پیدا کیا اسے زندہ کرو\"، تو وہ ایسا نہیں کر سکیں گے۔\n\nکیونکہ زندہ کرنا ان کے لیے نہیں ہے، بلکہ وہ اللہ کے لیے ہے۔ اور زندہ کرنے سے میری مراد وہ زندگی ہے جس سے زندہ کو فائدہ پہنچتا ہے۔ کیونکہ طبیعت صورت میں زندگی تو دیتی ہے، لیکن ایسی زندگی جس کے ساتھ کوئی فائدہ نہیں ہوتا، اور یہ وہ زندگی ہے جو سڑنے والی چیزوں میں پائی جاتی ہے۔ پس طبیعت کی قوت میں احساس کے وجود سے زیادہ کچھ نہیں ہے، بس۔ اور جہاں تک روحانی قوتوں کا تعلق ہے جن سے غور و فکر کے ذریعے عملی صنعتیں وجود میں آتی ہیں، تو وہ روحِ الٰہی سے ہیں۔ پس جو شخص ارواح کے مراتب کو جانتا ہے، وہ جانتا ہے جس کی طرف ہم نے اس مختصر بیان میں اشارہ کیا ہے۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ**\n(اور اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے)",
    "fa": "باب چهارصد و چهل و ششم: در معرفت منازل (سالک) در آبادانی (احیای) برخاستن‌های شب (نواشئ اللیل) برای کسب فواید خیرات.\n\nبرخاستن‌های شب (نواشئ الليل) تمامی خیر در آن است\nدر آن است نزول (حق) از سوی رحمان با کرم\n\nبه واسطه ما به سوی ما نزدیک می‌شود تا یاری‌مان کند\nبا آنچه از لطایف حکمت (حکم) فرو می‌فرستد\n\nپس همه او را می‌پرستند و همه شکر او را به جا می‌آورند\nمگر آنکه به زیان و انتقام اختصاص یافته است\n\nهمانا ولی (ولیّ) را می‌بینی که در وقت غفلتش\nمی‌گرید و او را در تاریکی شب (داج من الظلم) می‌خواند\n\nای پروردگار، ای پروردگار، او (ولیّ) جایگزینی برای آن نمی‌خواهد\nخلقی عظیم، چنانکه در قلم آمده است\n\n[اخلاق محمد (صلی الله علیه و سلم) قرآن بود]\n\nخداوند متعال می‌فرماید: «و همانا تو بر اخلاقی عظیم هستی» (وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ). و فرمود: «همانا برخاستن شب (ناشِئَةَ اللَّيْلِ) سخت‌تر و گفتار آن استوارتر است» (إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا). و هنگامی که از عایشه درباره اخلاق رسول خدا (صلی الله علیه و سلم) پرسیده شد، گفت: اخلاق او قرآن بود.\n\nو او این سخن را گفت، زیرا اخلاق را منحصر به فرد ساخت و ناگزیر آن اخلاق منحصر به فرد باید جامع تمامی مکارم اخلاق باشد. و خداوند آن اخلاق را به عظمت وصف کرد، چنانکه قرآن را در این سخن خود وصف نمود: «و قرآن عظیم» (وَالْقُرْآنَ الْعَظِيمَ). پس قرآن اخلاق او بود.\n\nپس هر کس از امت او که رسول خدا (صلی الله علیه و سلم) را درک نکرده است، بخواهد او را ببیند، باید به قرآن بنگرد. پس چون در آن نظر کند، تفاوتی میان نگریستن به آن و نگریستن به رسول خدا (صلی الله علیه و سلم) نیست. پس قرآن به صورت یک کالبد جسمانی (صورة جسدیة) که محمد بن عبدالله بن عبدالمطلب نامیده می‌شود، نشأت یافت. و قرآن کلام خدا و صفت اوست. پس محمد (صلی الله علیه و سلم) به تمامی، صفت حق تعالی (الحق تعالی) بود. پس «هر کس از رسول اطاعت کند، قطعاً از خدا اطاعت کرده است» (مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ)، زیرا او از روی هوی و هوس سخن نمی‌گوید، پس او زبان حق (لسان حق) است.\n\nپس او (صلی الله علیه و سلم) در شبِ هیکل خود و تاریکیِ طبیعتش، به واسطه عمل صالحی که خداوند او را بدان موفق ساخت و برایش تشریع نمود، صورت‌های عملی شبانه را ایجاد می‌کرد. زیرا شب، محل تجلی الهی (التجلی الإلهی) زمانی از اسم متعالی او، الدهر، است. او (پیامبر) برای ایجاد این صورت‌ها، از حق (الحق) به واسطه تجلی‌اش بر شهود (الشهود) یاری می‌جوید، و این همان سخن خداوند متعال است: «همانا قرآن فجر (قرائت فجر) مشهود است» (إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا).\n\nو این صورت‌ها چیزی جز نماز شب نبود، نه سایر اعمال. و ما به دلیل سخن خداوند متعال که فرمود: «نماز را میان خود و بنده ام تقسیم کردم»، و سخن او: «از خدا یاری جویید» (اسْتَعِينُوا بِاللَّهِ)، قائل به استعانت (یاری جستن) شدیم. و یاری طلبیده نمی‌شود مگر از کسی که نوعی از عمل در آن کار داشته باشد، و این همان سخن اوست: «و تنها از تو یاری می‌جوییم» (وَإِيَّاكَ نَسْتَعِينُ).\n\nپس تو ای وارث او، همان کسی باش که در این عمل، مخاطب این خطاب است. در نتیجه، محمد (صلی الله علیه و سلم) از سرای دنیا مفقود نشده است، زیرا او صورت قرآن عظیم است. پس هر کس از وارثان او که اخلاقش قرآن باشد و صورت اعمال را در شب طبیعت خود ایجاد کند، محمد (صلی الله علیه و سلم) را از قبرش برانگیخته است. پس حیات رسول خدا (صلی الله علیه و سلم) پس از مرگش، حیات سنت اوست، و هر کس آن را احیا کند، «گویی همه مردم را زنده کرده است» (فَكَأَنَّمَا أَحْيَا النَّاسَ جَمِيعًا).\n\nزیرا او (پیامبر) مجموعه کامل‌تر و برنامه تمام‌تر است. و به همین دلیل درباره برخاستن شب (ناشِئَةَ اللَّيْلِ) فرمود که آن «استوارترین گفتار» (أَقْوَمُ قِيلًا) است، و هیچ گفتاری استوارتر از قرآن نیست. و همچنین «سخت‌تر» (أَشَدُّ وَطْئًا) یعنی عظیم‌ترین تمهید است، زیرا فرمود: «ما در کتاب هیچ چیز را فروگذار نکردیم» (مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ)، و آن چیزی جز قرآن جامع نیست. و همچنین از نظر ثبات شدیدتر است، زیرا نسخ نمی‌شود، برخلاف سایر کتبی که پیش از آن به واسطه آن نسخ شدند، اگرچه آنچه از آنها در قرآن آمده، ثابت مانده است. و به همین دلیل با لفظ تفضیل در ثبوت آمده است، پس ثبات آن از کتب دیگر شدیدتر است، به دلیل اتصالش به قیامت. و در آن چیزی هست که در کتب دیگر است و چیزی که در کتب دیگر نیست، همان‌گونه که در محمد (صلی الله علیه و سلم) آنچه در هر پیامبری بود، وجود داشت و آنچه در هیچ پیامبری نبود نیز در او بود، زیرا قرآن اخلاق او بود.\n\nپس به او و امتش چیزی عطا شد که به هیچ پیامبری پیش از او عطا نشده بود. بنابراین، هنگامی که کسی صورت این اعمال شبانه را ایجاد کند و حق (الحق) برای شهود (الشهود) او، از آن جهت که یاری‌دهنده اوست، روح‌های آنها را در آن بدمد، آن اعمال زنده و گویا برمی‌خیزند، از اصلی که دو طرف آن کریم است. میان بنده‌ای که به عبودیت (عبودیة) خود تحقق یافته و حق مولای خود را به طور کامل ادا کرده است، و به خود و به صورتی که خداوند او را بر آن آفریده و موجب کبریا (کبریاء) برای او می‌شود، توجهی نکرده است، بلکه با وجود این منزلت، بنده‌ای محض بوده است.\n\nو به همین دلیل «تنها تو را می‌پرستیم» (إِيَّاكَ نَعْبُدُ) را مقدم داشت، زیرا صورت را نپذیرفت مگر در حالت دوم. پس با ذات خود گفت: «تنها تو را می‌پرستیم» (إِيَّاكَ نَعْبُدُ)، و با صورت گفت: «و تنها از تو یاری می‌جوییم» (وَإِيَّاكَ نَسْتَعِينُ). سپس بازگشت و گفت: «ما را به راه راست هدایت فرما، راه کسانی که به آنان نعمت دادی، نه کسانی که مورد غضب قرار گرفتند و نه گمراهان» (اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ).\n\nپس میان دو امر و میان پروردگاری عظیم جمع کرد که حق او را به اندازه‌ای که برایش تشریع کرده بود، ادا نمود و به غیر از آن مطالبه‌ای ندارد. زیرا او تعالی کسی است که او را ادب کرد، یعنی تمامی فواید خیرات را برای او و در او جمع نمود. فلما نشأت هذه الصورة العملية الليلية بین هذین الطرفین الکریمین کانت وسطا جامعة للطرفین فکانت عبدا سیدا حقا خلقا.\n\nپس هنگامی که این صورت عملی شبانه میان این دو طرف کریم نشأت گرفت، واسطه‌ای شد که هر دو طرف را جمع می‌کرد. پس او (پیامبر) بنده‌ای بود که در عین حال سید (سرور)، حق (الحق) و خلق (الخلق) بود. و خداوند عالم را در ابتدا با همین صفت ایجاد کرد، زیرا او در اسماء و نعوت خود هر دو طرف را دارد. او خود را به آنچه از خلق متعالی است وصف کرده و خود را به آنچه خلق بر آن است نیز وصف نموده است. و پیوسته با این دو نعت، خود را وصف کرده است، و این دو، دو طرف نقیض هستند. پس میان دو ضد جمع کرد، و اگر امر بر این منوال نبود، دو ضد را در عالم خلق نمی‌کرد. و دو مثل نیز ضد یکدیگرند، پس آنها ضد مماثلت هستند، تا بدانی که عالم بر صورت او (حق) در پذیرش دو ضد است، بلکه عالم که عین دو ضد است، صورت کسی است که آن را ایجاد کرده است.\n\nپس عالم به اصالت میان دو طرف ظاهر شد و امر در خلق آنچه خداوند آفرید، به دست عالم (انسان کامل) جاری شد. پس ایجاد صورت‌ها از آنِ عالم است و روح‌ها و حیات آنها از آنِ حق (الحق) است. چنانکه در حق عیسی (علیه السلام) فرمود: «و هنگامی که از گِل، چیزی به شکل پرنده می‌ساختی» (وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ) در صورت خلقی، «پس به اذن خدا پرنده‌ای می‌شد» (فَيَكُونُ طَيْرًا بِإِذْنِ اللَّهِ). پس صورت را برای خلق قرار داد و پرنده شدن آن را برای حق (الحق). و در ایجاد تو (انسان) فرمود: «پس هنگامی که آن را سامان دادم» (فَإِذَا سَوَّيْتُهُ)، که مانند «از گِل، چیزی به شکل پرنده می‌ساختی» (تَخْلُقُ مِنَ الطِّينِ كَهَيْئَةِ الطَّيْرِ) است، سپس فرمود: «و از روح خود در آن دمیدم» (وَنَفَخْتُ فِيهِ مِنْ رُوحِي)، که همان سخن اوست: «پس به اذن من پرنده‌ای می‌شوی» (فَتَكُونُ طَيْرًا بِإِذْنِي).\n\nپس هر کس که هنگام ایجاد صورت‌های اعمال توسط بنده، در مقام شهود (الشهود) و جمع (الجمع) با حق (الحق) باشد، آن اعمال زنده و گویا برمی‌خیزند. و اگر آنها را بر غیر این وصف از جمع و شهود ایجاد کند، صورت‌هایی بدون روح خواهند بود، مانند صورت‌های نقاشانی که خداوند در روز قیامت به آنها می‌گوید: «آنچه را آفریدید زنده کنید»، پس نمی‌توانند. زیرا زنده کردن از آنِ آنها نیست، بلکه تنها از آنِ خداست. و منظور من از احیا، احیایی است که فایده از موجود زنده حاصل شود. زیرا طبیعت در صورت، حیات می‌بخشد، اما حیاتی که فایده‌ای با آن نیست، و آن همان حیاتی است که در موجودات فاسدشونده (معفنات) یافت می‌شود. پس در قدرت طبیعت بیش از وجود احساس نیست و بس. اما قوای روحانی (القوی الروحانیة) که صنایع عملی به واسطه تفکر از آنها حاصل می‌شود، از روح الهی است.\n\nپس هر کس مراتب ارواح را بداند، آنچه را که در این شتاب به آن اشاره کردیم، می‌داند. و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}