{
  "id": 216,
  "title": {
    "ar": "الباب السادس عشر ومائتان في معرفة الفتوح وأسراره",
    "en": "Chapter Two Hundred and Sixteen: Concerning the Gnosis of the Spiritual Opening (الفتوح) and its Mysteries.",
    "ur": "باب دو سو سولہ (۲۱۶): فتوح (Futūḥ) اور اس کے اسرار کی معرفت (Ma'rifah) کے بیان میں۔",
    "fa": "باب دویست و شانزدهم در معرفت فتوح و اسرار آن"
  },
  "content": {
    "ar": "## «الباب السادس عشر ومائتان في معرفة الفتوح وأسراره»\n\n\n> إن الفتوح هو الراحات أجمعها *** وهو العذاب فلا تفرح إذا وردا\n\n\n> حي ترى عين ما يأتي به فإذا *** رأيته فاتخذ ما شئته سندا\n\n\n> الريح بشرى من الرحمن بين يدي *** ما شاء من رحمة فيها إذا قصدا\n\n\n> وقد تكون عذابا ما استعد له *** كريح عاد بنقل ثابت شهدا\n\n\n> فالمكر منه خفي فاستعد له *** عسى تحوز بذاك الفوز والرشدا\n\n\n### [أن الفتوح على ثلاثة أنواع‏]\n\n\nاعلم أيدنا الله وإياك بما أيد به الخاصة من عباده أن الفتوح عند الطائفة على ثلاثة أنواع‏\n\n\nالنوع الواحد فتوح العبارة في الظاهر\n\n\nقالوا وذلك سببه إخلاص القصد وهو صحيح عندي وقد ذقته وهوقوله عليه السلام أوتيت جوامع الكلام‏\n\n\nومنه إعجاز القرآن وقد سألت في الواقعة عن هذه المسألة فقيل لي لا تخبر إلا عن صدق وأمر واقع محقق من غير زيادة حرف أو تزوير في نفسك فإذا كان كلامك بهذه الصفة كان معجزا\n\n\nوأما النوع الثاني من الفتوح فهو فتوح الحلاوة في الباطن‏\n\n\nقالت الطائفة هو سبب جذب الحق بإعطافه‏\n\n\nوأما النوع الثالث فهو فتوح المكاشفة بالحق‏\n\n\nقالت الطائفة هو سبب المعرفة بالحق والجامع لذلك كله إن كل أمر جاءك من غير تعمل ولا استشراف ولا طلب فهو فتوح ظاهرا كان أو باطنا وله علامة في الذائق الفتوح وهي عدم الأخذ من فتوح الغير أو نتائج الفكر\n\n\nومن شرط الفتوح أن لا يصحبه فكر ولا يكون نتيجة فكر وكان شيخنا أبو مدين يقول في الفتوح أطعمونا لَحْماً طَرِيًّا كما قال الله تعالى لا تطعمونا القديد أي لا تنقلوا إلينا من الفتوح إلا ما يفتح به عليكم في قلوبكم لا تنقلوا إلينا فتوح غيركم يرفع بهذا همة أصحابه لطلب الأخذ من الله تعالى فاعلموا يا إخواننا أن مقام الفتوح محتاج إلى ميزان حقيقي وهو مقام فيه مكر خفي واستدراج فإن الله قد ذكر الفتح بالبركات من السَّماءِ والْأَرْضِ وذكر الفتح بالعذاب هذا حتى لا يفرح العاقل بالفتح عند فتح الباب حتى يرى ما يفتح له قال بعضهم عند الموت هذا باب كنت أقرعه منذ كذا وكذا سنة هو ذا يفتح لي ولا أدري بما ذا قالت عاد هذا عارِضٌ مُمْطِرُنا حجبتهم العادة قيل لهم بَلْ هُوَ ما اسْتَعْجَلْتُمْ به رِيحٌ فِيها عَذابٌ أَلِيمٌ فلا تغتر بالفتح إذا لم تدر ما ثمة وقُلْ رَبِّ زِدْنِي عِلْماً\n\n\n### [الفتح الإلهي‏]\n\n\nولما كان الفتح الإلهي على نوعين في العالم فتح عن قرع وفتح ابتداء لا عن قرع فأما فتح القرع فيعلم أهل الله بما ذا يفتح فإن القرع هو دليلهم على ما يفتح به وليس مطلوب القوم بالفتوح هذا النوع وإنما مطلوبهم بالفتوح ما يكون ابتداء من غير تعمل لذلك وإن كان يطلبه العمل من العبد الذي هو عليه بحكم التضمن ولكن ما يخطر للعبد العامل ذلك جملة واحدة فيكون الفتح في حقه إذا ورد ابتداء وإذا ورد الفتح على اختلاف ضروبه كما قررناه تعين على هذا العبد إقامة الوزن بالقسط كما أمره الله في قوله وأَقِيمُوا الْوَزْنَ بِالْقِسْطِ فيقيم الوزن هذا العبد بين حاله الذي هو عليه وبين الفتح فإن كان الفتح مناسبا للحال فهو نتيجة حاله فيقيم عند ذلك وزنا آخر وهو أن ينظر في مقدار الفتح وقوة الحال فإن ساواه فهو نتيجة بلا شك فليحذر هذا العبد مكر الله في هذا الفتح فإنه نتيجة في غير موطنها فربما عجلت له عطيته وانقلب إلى الدار الآخرة صفر اليدين فإن كان الفتح مما يعطي أدبا وترقيا فليس بمكر بل هو عناية من الله تعالى بهذا العبد حيث زاده فتحا يؤديه إلى زيادة خير عند الله تعالى وإن أقام الوزن بين مقدار الفتح وقوة الحال ورأى الفتح فوق الحال فينزل منه مقدار قوة الحال وما زاد فذلك هو الفتوح الذي ذكرته الطائفة هذا أصل ينبغي أن بعلم ويتحقق وله شواهد يعلمها الذائق له وإن لم يدخل الفتح‏\nفي ميزان الحال جملة واحدة وبقي حاله موفورا عليه كان ذلك الفتح هو الفتح المطلوب عند القوم وبعد أن تقرر هذا فلنذكر كل نوع من أنواع الفتوح أما الفتوح في العبارة فإنه لا يكون إلا للمحمدي الكامل من الرجال ولو كان وارثا لأي نبي كان وأقوى مقام صاحب هذا الفتح الصدق في جميع أقواله وحركاته وسكونه إلى أن يبلغ به الصدق أن يعرف صاحبه وجليسه ما في باطنه من حركة ظاهرة لا يمكن لصاحب هذا الفتح أن يصور كلاما في نفسه ويرتبه بفكره ثم ينطق به بعد ذلك بل زمان نطقه زمان تصوره لذلك اللفظ الذي يعبر به عما في نفسه زمان قيام ذلك المعنى في نفسه وصورته وليس لغير صاحب هذا الفتح هذا الوصف ويكون التنزل على صاحب هذا الفتح من المرتبة التي نزل فيها القرآن خاصة من كونه قرآنا لا من كونه فرقانا ولا من كونه كلام الله فإن كلام الله لا يزال ينزل على قلوب أولياء الله تلاوة فينظر الولي ما تلي عليه مثل ما ينظر النبي فيما أنزل عليه فيعلم ما أريد به في تلك التلاوة كما يعلم النبي ما أنزل عليه فيحكم بحسب ما يقتضيه الأمر هكذا هو الشأن ولهذا التنزل في قلب الولي حلاوة نذكرها في النوع الثاني من الفتح فلا تقع التلاوة لصاحب هذا الفتح إلا من كون المتلو قرآنا لا غير فيفتح الله له في العبارة فيعرب بقلمه أو بلفظه عما في نفسه بحيث أن يوضح المقصود عند السامع إذا كان السامع ممن ألقى السمع ومن علامة صاحب هذا الفتح عند نفسه استصحاب الخشوع وتوالي الاقشعرار عليه في جسده بحيث أن يحس بأجزائه قد تفرقت فإن لم يجد ذلك في نفسه فيعلم أنه ليس ذلك الرجل المطلوب ولا هو صاحب هذا الفتح وهذا فتح ما رأيت له في عمري فيمن لقيته من رجال الله أثرا في أحد وقد يكون في الزمان رجال لهم هذا الفتح ولم ألقهم غير أني منهم بلا شك عندي ولا ريب فلله الحمد على ذلك وسيرد في فصل المنازل في منزل القرآن فرقان ما بين أسمائه فإنه القرآن والفرقان والنور والهدى وغير ذلك من الأسماء الموضوعة له ومهما تصور المتكلم المعبر عما في نفسه ما يتكلم به قبل العبارة ويرتب التعبير عن الأمر في نفسه ويحسنه ويتمعنه بحيث أن يحسن عند كل من\n\n\nيسمع تلك العبارة فليس هو بصاحب فتح فإنه من شأن الفتوح أن يفجأ ويأتي بغتة من غير شعور هكذا كل فتوح يكون في هذا الطريق ثم إنه من حقيقة صاحب هذا الفتح شهود ما يعبر عنه وشهود من يسمع منه وبما يسمع منه فيعطيه من العبارة ما يليق بذلك السمع الخاص فإن لم يكن بهذا الوصف فليس هو بصاحب فتح في العبارة وهذا معنى قولنا إن سببه الإخلاص النوع الثاني من الفتوح الذي هو فتح الحلاوة في الباطن وهو سبب جذب الحق بإعطافه فهذه الحلاوة وإن كانت معنوية فإن أثرها عند صاحبها يحس به كما يحس ببرد الماء البارد وصورة الإحساس بها كصورة الإحساس بكل محسوس وطريقها في الحس من الدماغ ينزل إلى محل الطعم فيجدها ذوقا فيجد عند حصول هذا الذوق استرخاء في الأعضاء والمفاصل وخدرا في الجوارح لقوة اللذة واستفراغا لطاقته ومن أصحاب هذا الفتح من تدوم معه هذه الحلاوة ساعة ويوما وأكثر من ذلك ليس لبقائها زمان مخصوص فإنه اختلف علينا بقاؤها فوقتا نزلت علينا في قضية فدامت معنا ساعة ثم ارتفعت ثم نزلت في واقعة أخرى فدامت أياما ليلا ونهارا وحينئذ ارتفعت فإذا ارتفعت زال ذلك الخدر من الجوارح وهذه الحلاوة لا يمكن أن يشبهها لذة من اللذات المحسوسة لأنها غريبة لكونها معنوية في غير مادة محسوسة فما تشبه حلاوة العسل ولا حلاوة الجماع ولا حلاوة شي‏ء محسوس كما أنها أيضا لا تشبه حلاوة حصول العلوم المعشوقة للطالب بل هي أعلى وأجل وأثرها في الحس أعظم من أثر الحلاوة المركبة في المواد المحسوسة كحلاوة كل حلو وتميزها عن لذات المعاني إنما هو بما لها من الأثر في الحس فافهم ذلك ولما سماني الحق عبدا بأسمائه وفتح لي في هذه الحلاوة ما رأيت أشد أثرا منها في الاسم العزيز فلما ناداني بيا عبد العزيز ومعنى ذلك أن يقام الإنسان عبدا في كل اسم إلهي ليحصل الفرقان بين الحقائق‏\n\n\nلتحصيل العلوم الإلهية وجدت لهذا النداء من الحلاوة ما لم أجد لغيره من الأسماء ونظرت في سبب ذلك فوجدت إن مقام العزة يقتضي أن يكون الأمر كذلك وهذه الحلاوة وإن تميزت عن حلاوة المحسوسات والمعاني فهي متنوعة في نفسها فحلاوة أمر ما منها خلاف حلاوة أمر آخر يجد الذائق الفرق بينهما كحلاوة السكر يجد الإنسان الفرق بينها وبين حلاوة العسل وإن اشتركا في الحلاوة وكذلك الأمر هنا ولا تحصل هذه الحلاوة لا حد\nمن أهل الله إلا بالعطف الإلهي فإذا ورد العطف الإلهي على العبد رزقه الله وجدان هذه الحلاوة في باطنه فيجذبه إليه تعالى لأن النفس مجبولة على الميل إلى كل ما تستلذه ومن أشد حلاوة من هذا الفتح مر علي في هذا الزمان لما تلي علي ن والْقَلَمِ وما يَسْطُرُونَ فلم أجد لذة أعظم من لذة وإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ فهذه أعظم بشرى وردت علي ثم إنه تليت على مرتين في زمانين متتابعين فزادني إعجابا بها تكرار التلاوة علي بها وتكرار التلاوة فينا مثل تكرار نزول الآية أو السورة على الرسول مرتين كما جاء في نزول سورة والمرسلات وغيرها إنها نزلت مرتين فإذا عطف الحق على عبده بهذه الحلاوة فجذبه إليه بها ليمنحه علما لم يكن عنده فإن لم يجد علما فليس بجذب ولا تلك حلاوة فتح فذلك من علامات فتح الحلاوة وإنما يفعل الحق ذلك لتكون حركة العبد معلولة لأنه معلول في الأصل وذلك لإقامة حجة الله عليه فإن العبد يزهو بالقوة الإلهية التي عنده فربما يرى أن له تنزيها بانجذابه إلى الحق دون غيره من العبيد ويزعم أن ذلك إيثار منه لجناب الحق فجعل الله انجذابه عن حلاوة فإن زها كما قلنا قامت الحجة علينا بأنه ما أخذ به إلى الحق إيثار جناب الحق بل وجدان الحلاوة والالتذاذ فلنفسه سعى ولله المنة وحده لا منة لا حد على الله وله الْحُجَّةُ الْبالِغَةُ لا حجة لا حد على الله وكل من قال بغير هذا من أهل الله فإنما قالها شطحا لا حقيقة لغلبة الحال عليه فهو لسان حاله لا لسانه فإذا أفاق قالَ سُبْحانَكَ تُبْتُ إِلَيْكَ فإن قلت فما معنى الجذب هنا مع كونه معه قلنا ليس أحد مع الحق من حيث ما هو الحق لنفسه وإنما هم مع الحق من حيث ما أقامه الحق فيه فيكون من الحق الجذب بهذه الحلاوة من الحال التي أقامه الحق فيها لحال آخر يفيده فيه علما لم يكن عنده ذوقا هكذا على الدوام إلى ما لا نهاية له وسماه جذبا لأن العبد لا بد أن يتعشق بحاله ويألفه فلا ينجذب عنه إلا بما هو أعجب إليه منه فلهذا فتح له في الحلاوة لتخلصه مما وقف معه فإذا انجذب إلى الحق صحبه حاله الذي كان عليه أيضا لأنه لا يفارقه إذ المعلوم لا يجهل فبقي حكم الجذب إنما متعلقة أن لا يتركه يقف مع حاله فيقتصر عليه فيحدث له التشوق إلى تحصيل أمر آخر ليس عنده مع صحبته لما كان عليه من الحال فاعلم ذلك وليس كل أهل الله على هذا القدم الذي ذكرناه وإنما هذا الذي ذكرناه حال الأكابر منهم فإن جماعة من أهل الله يشغلهم ما رجعوا إليه عما كانوا عليه فإن الله قد رفع بعضهم على بعض وفضل كل صنف بعضه على بعض فقال تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ ولَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ واعلم أن أصل وجدان هذه الحلاوة فينا من الجناب الإلهي من الحلاوة الإلهية التي يتضمنها صريح‏\n\n\nقوله عليه السلام لله أفرح بتوبة عبده‏\n\n\nالحديث فمن هناك نشأت هذه الحلاوة في باطن أهل الله فإن فهمت فقد رميت بك على الطريق ولا يعرف هذا إلا العارفون بالله المنعوت في الشرع لا المدلول عليه بالعقل وهكذا جميع ما يأتي من مثل هذا الباب وليس للضحك الإلهي ولا التبشبش مدخل في هذه الحلاوة بل ذلك للفرح فلا تخلط ولا تقس فإن طريق الله لا تدرك بالقياس فما كل أمر يشبه أمرا له حكم ذلك المشبه ليس الأمر كذلك وإنما له منه حكم ما وقع الشبه به كالحمصة تشبه اللؤلؤة في الاستدارة وما لكل واحدة منهما حكم الأخرى كما تختلف العلل أيضا مع أحدية المعلول إذا كان المعلول محمولا كالاستدارة التي وقع التمثيل بها وهي أمر محمول في المستدير كان المستدير ما كان فعلة استدارة الفلك ليست علة استدارة اللؤلؤ فاختلفت العلل لاختلاف محال المعلول والمعلول الاستدارة فاحذر من القياس في العلم الإلهي بل إن تحققت الأمور لم يصح وجود القياس أصلا وإنما هو من الأمور التي غلط فيها أهل النظر في إن حملوا حكم المقيس عليه على المقيس فهذا قد بينا في هذا النوع من الفتح قدر ما تقع به الكفاية لمن أراد تحصيله ذوقا من نفسه فإذا ذاقه علم ما يحتمله من البسط وأما النوع الثالث من الفتوح وهو فتوح المكاشفة الذي هو سبب معرفة الحق اعلم أولا أن الحق أجل وأعلى من أن يعرف في نفسه لكن يعرف في الأشياء فالمكاشفة سبب معرفة الحق في الأشياء والأشياء على الحق كالستور فإذا رفعت وقع الكشف لما وراءها فكانت المكاشفة فيرى المكاشف الحق في الأشياء كشفا كما يرى النبي صلى الله عليه وسلم من وراءه من خلف ظهره فارتفع في حقه الستر وانفتح الباب مع ثبوت الظهر والخلف‏\n\n\nفقال إني أراكم من خلف ظهري‏\n\n\nوقد ذقنا هذا المقام ولله الحمد فلا يعرف الحق في الأشياء إلا مع ظهور الأشياء وارتفاع حكمها فأعين العامة لا تقع إلا على حكم الأشياء والذين لهم فتوح المكاشفة\nلا تقع أعينهم في الأشياء إلا على الحق فمنهم من يرى الحق في الأشياء ومنهم من يرى الأشياء والحق فيها وبينهما فرقان فإن الأول ما تقع عينه عند الفتح الأعلى الحق فيراه في الأشياء والثاني تقع عينه على الأشياء فيرى الحق فيها لوجود الفتح وأصل ظهور هذا الفتح من الجناب الإلهي حالة قوله ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجاهِدِينَ مِنْكُمْ فيرفع الابتلاء حجاب الدعوى الذي كان يدعيه الكون فيكون الكشف وهو التعلق الخاص من العلم الإلهي بما وقع الأمر عليه فعلم صدق دعوى الكون من كذبه فمن هذه الصفة الإلهية ظهر فتح المكاشفة إذ لا يظهر في الوجود حكم إلا وله أصل في الجناب الإلهي إليه استناده ولا يصح أن يكون الأمر إلا هكذا فإنه قد ذكرنا في غير ما موضع أن علم الله بالأشياء من علمه بنفسه فخرج العالم على صورته فلا يشذ عنه حكم أصلا فهو سبحانه رب كل شي‏ء ومليكه فالأشياء مرتبطة به في كل حال وما هو في كل حال مرتبط بالأشياء ولهذا غلط من غلط من أصحابنا ومن بعض النظار في أنهم عرفوا الله ثم عرفوا الأشياء فهم عرفوا الله من حيث إنه واجب الوجود لذاته وأنه لا يصح أن يكون ثم واجب الوجود لذاته فصحت أحدية واجب الوجود هذا كله صحيح لا نزاع فيه عند المنصف ولكن ليس المقصود إلا علم كونه ربا لهذا العالم هذا لا يعرفه ما لم تتقدم له معرفته بالعالم هذا ما يعطيه علم الكمل من رجال الله من أهل الحق ولهذا\n\n\nقال عليه السلام من عرف نفسه عرف ربه‏\n\n\nما قال من عرف ربه عرف نفسه لأنه من حيث نفسه واجب الوجود وله الغني المطلق فلا التفات للغني المطلق إلى غير ذاته إذ لو التفت لم يصح ما قرره فلا يعلم أنه بإله للعالم فإذا أراد أن يعلم أنه إله العالم نظر في العالم فرأى فيه حقيقة الافتقار بإمكانه إلى المرجح فلم يجد إلا هذا الواجب الوجود لذاته الذي أثبته بدليله قبل أن ينظر في هذه المسألة الأخرى فأضافه إليه فقال هذا الواجب هو رب هذا العالم وبغير هذا الطريق في النظر فلا يعرف أنه إله العالم ثم إن أهل النظر انحجبوا عما ثبت في نفوسهم من افتقارهم حين صرفوا النظر إلى معرفة واجب الوجود لذاته فإن ثبت عندهم بالدليل أظهر لهم إمكانهم وافتقارهم من حيث لا يشعرون أن ذلك الواجب الوجود هو الهم فقالوا علمنا بالله متقدم على علمنا بالعالم وصدقوا ما قالوا علمنا بإلهنا أنه إلهنا متقدم على علمنا بنا فلم يشعروا بما وقعوا فيه من الغلط وعلمت بذلك الأنبياء فجعلت العالم دليلا عليه وأعظم فتح المكاشفة في مثل هذه المسألة أن يرى الحق فيكون عين رؤيته إياه عين رؤيته العالم للارتباط المحقق فيكشف العالم من رؤيته الله تعالى ولكن هذه الدقيقة ليست لأهل النظر لأن النظر ليس في قوته ذلك وإنما هو من خصائص الكشف هذا أبلغ ما يمكن أن تحقق به هذه المسألة من تقدم العلم بالله من كونه إلها للعالم على العلم بالعالم فهذا لا يعرف إلا من فتوح المكاشفة وما رأيت أحدا من المتقدمين من أهل الله تعالى نبه في هذا الفتوح الكشفي على هذه المسألة على التعيين فاحمد الله تعالى حيث أجرى على لساني الإبانة عن هذه المسألة فإنه ما كان في نفسي أن أشير إليها فأحرى أن أصرح بها وإنما الغيرة غلبت علي والحرص على نصح العباد الذين أمرني الحق بنصحهم على التخصيص أداني إلى شرح هذا القدر في فتوح المكاشفة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Sixteen: Concerning the Knowledge of Spiritual Openings (الفتوح) and Their Secrets\n\nIndeed, the Spiritual Opening (الفتوح) is all comforts combined,\nYet it is also torment, so do not rejoice when it arrives.\n\nUntil you see the very essence of what it brings,\nAnd when you see it, then take whatever you wish as support.\n\nThe wind is glad tidings from the All-Merciful, preceding\nWhatever Mercy He wills, contained within it when intended.\n\nAnd it may be a torment for those unprepared for it,\nLike the wind of ‘Ad, witnessed by reliable transmission.\n\nFor the Subtlety (المكر) within it is hidden, so prepare for it,\nThat you may thereby attain success and right guidance.\n\n### [That the Spiritual Opening is of Three Types]\n\nAcknowledge—may Allah support us and you with that by which He supports the elite among His servants—that the Spiritual Opening (الفتوح) according to the Sufi community (الطائفة) is of three types:\n\nThe first type is the Spiritual Opening of Expression (فتوح العبارة) in the outward realm.\n\nThey said its cause is sincerity of intention (إخلاص القصد), and this is sound according to me, and I have tasted it. It is related to his (peace be upon him) saying: \"I have been given the comprehensive words (جوامع الكلام).\" And from this is the inimitability (إعجاز) of the Qur’an. I was asked about this matter in a spiritual vision (الواقعة), and it was said to me: \"Do not speak except based on truth and a verified, actual occurrence, without adding a single letter or fabricating anything in your soul. If your speech is of this quality, it will be inimitable.\"\n\nThe second type of Spiritual Opening is the Opening of Sweetness (فتوح الحلاوة) in the inward realm.\n\nThe community said its cause is the attraction (جذب) of The Real (الحق) through His affection (بإعطافه).\n\nThe third type is the Opening of Direct Unveiling (فتوح المكاشفة) by The Real.\n\nThe community said its cause is Gnosis (المعرفة) of The Real. The comprehensive definition for all of this is that every matter that comes to you without effort (تعمل), anticipation, or seeking, whether outwardly or inwardly, is a Spiritual Opening (فتوح). Its sign in the one who tastes the Opening is the absence of taking from the Opening of others or from the results of thought (نتائج الفكر).\n\nA condition of the Opening is that it must not be accompanied by thought (فكر) nor be the result of thought. Our Shaykh Abu Madyan used to say concerning the Opening: \"Feed us fresh meat (لَحْماً طَرِيًّا), as Allah the Exalted said, do not feed us dried meat (القديد).\" Meaning: Do not convey to us from the Openings except what is opened upon your own hearts; do not convey to us the Openings of others. By this, he raised the aspiration (همة) of his companions to seek reception directly from Allah the Exalted.\n\nKnow, O our brothers, that the station of the Opening (مقام الفتوح) requires a true balance (ميزان حقيقي), for it is a station containing hidden Subtlety (مكر خفي) and gradual enticement (استدراج). For Allah mentioned the Opening with blessings from the heavens and the earth, and He mentioned the Opening with torment. This is so that the intelligent person does not rejoice in the Opening when the door is opened until he sees what is opened for him. Some said upon death: \"This is a door I have been knocking on for so many years; now it is opening for me, but I do not know with what.\" The people of ‘Ad said: \"This is a cloud bringing us rain (عارِضٌ مُمْطِرُنا).\" Custom veiled them. It was said to them: <<بَلْ هُوَ مَا اسْتَعْجَلْتُمْ بِهِ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ>> (Nay, but it is that which you sought to hasten: a wind wherein is a painful torment). So, do not be deceived by the Opening if you do not know what is there, and say: <<وَقُلْ رَبِّ زِدْنِي عِلْماً>> (And say: My Lord, increase me in knowledge).\n\n### [The Divine Opening]\n\nSince the Divine Opening (الفتح الإلهي) in the cosmos (العالم) is of two types: an opening resulting from knocking (فتح عن قرع) and an opening that is an initiation (فتح ابتداء) not resulting from knocking. As for the opening resulting from knocking, the People of Allah know what it opens with, for the knocking is their guide to what is opened. However, this type is not what the People seek through the Openings. Rather, what they seek through the Openings is that which occurs as an initiation (ابتداء), without effort toward it, even though the action (العمل) required of the servant is implicitly seeking it by way of inclusion. But the working servant does not anticipate it entirely, so the Opening, when it arrives, is an initiation in his regard.\n\nWhen the Opening arrives in its various forms, as we have established, it becomes incumbent upon this servant to establish the balance with justice (إقامة الوزن بالقسط), as Allah commanded in His saying: <<وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ>> (And establish the balance with justice). This servant establishes the balance between his current spiritual state (حاله) and the Opening. If the Opening is appropriate to the state, it is the result of his state. He must then establish another balance: he must look at the measure of the Opening and the strength of the state. If they are equal, it is undoubtedly a result. Let this servant beware of Allah’s Subtlety (مكر الله) in this Opening, for it is a result in an inappropriate place. Perhaps his gift has been hastened to him, and he will turn to the Hereafter empty-handed.\n\nIf the Opening grants spiritual refinement (أدبا) and ascent (ترقيا), then it is not a Subtlety, but rather Divine Providence (عناية) toward this servant, as He has increased him in an Opening that leads him to greater good with Allah the Exalted. If he establishes the balance between the measure of the Opening and the strength of the state, and he sees the Opening is above the state, he subtracts the measure of the strength of the state, and what remains—that is the Spiritual Opening (الفتوح) mentioned by the community. This is a principle that must be known and verified, and it has evidences known to the one who tastes it. If the Opening does not enter into the balance of the state entirely, and his state remains fully preserved for him, then that Opening is the Opening sought by the People.\n\nAfter this has been established, let us mention each type of Opening.\n\nAs for the Opening of Expression (فتوح العبارة), it occurs only for the Perfect Muhammadan Man (للمحمدي الكامل من الرجال), even if he is the inheritor of any other prophet. The strongest station of the possessor of this Opening is truthfulness (الصدق) in all his sayings, movements, and stillness, until his truthfulness reaches the point where his companion and associate knows what is in his inward realm from his outward movement. The possessor of this Opening cannot formulate speech in his soul, arrange it by thought, and then utter it. Rather, the time of his utterance is the time of his conception of the word by which he expresses what is in his soul, which is the time that meaning arises and takes form within him. No one other than the possessor of this Opening has this characteristic.\n\nThe descent upon the possessor of this Opening comes specifically from the level (المرتبة) in which the Qur’an descended, specifically in its aspect as *Qur’an* (Recitation), not in its aspect as *Furqan* (Criterion), nor merely as the Speech of Allah. The Speech of Allah continually descends upon the hearts of the Friends of Allah (أولياء الله) as recitation (تلاوة). The Friend looks at what is recited to him, just as the Prophet looks at what is revealed to him, and he knows what is intended by that recitation, just as the Prophet knows what is revealed to him, and he judges according to what the matter requires. This is the way of the affair. This descent into the heart of the Friend has a sweetness (حلاوة) which we will mention in the second type of Opening. The recitation does not occur for the possessor of this Opening except from the aspect of the recited text being *Qur’an* and nothing else.\n\nAllah opens for him in Expression, so he articulates with his pen or his tongue what is in his soul, such that the intended meaning is clarified for the listener, provided the listener is one who lends an ear (ألقى السمع). A sign of the possessor of this Opening, known to himself, is the constant presence of humility (الخشوع) and continuous shuddering (توالي الاقشعرار) over his body, such that he feels his parts have separated. If he does not find this in himself, he knows that he is not the required man, nor is he the possessor of this Opening. This is an Opening for which I have not seen a trace in anyone I have met among the Men of Allah (رجال الله) in my lifetime. Yet, there may be men in this time who possess this Opening whom I have not met, although I am undoubtedly one of them. Praise be to Allah for that. In the chapter on the Stations, in the station of the Qur’an, the distinction (فرقان) between its Names will be mentioned, for it is the Qur’an, the Furqan, the Light (النور), the Guidance (الهدى), and other Names assigned to it.\n\nWhenever the speaker who expresses what is in his soul conceives of what he will speak before the expression, and arranges the articulation of the matter in his soul, refining and pondering it so that it sounds good to everyone who hears that expression, then he is not the possessor of the Opening. For it is the nature of the Openings to surprise and come suddenly, without prior awareness. This is true for every Opening on this Path. Furthermore, it is part of the reality of the possessor of this Opening to witness (شهود) what he expresses, and to witness the one who hears from him, and what he hears from him. He then gives him the expression appropriate to that specific hearing. If he is not characterized by this, he is not the possessor of the Opening of Expression. This is the meaning of our statement that its cause is sincerity (الإخلاص).\n\nThe second type of Opening, which is the Opening of Sweetness (فتوح الحلاوة) in the inward realm, is caused by the attraction (جذب) of The Real through His affection. This Sweetness, although conceptual (معنوية), its effect is felt by its possessor just as the coldness of cold water is felt. The form of sensing it is like the form of sensing any sensible thing. Its path in sensation descends from the brain to the place of taste (محل الطعم), where he finds it as a flavor (ذوقا). Upon the occurrence of this flavor, he finds relaxation in the limbs and joints, and numbness (خدرا) in the faculties due to the intensity of the delight and the exhaustion of his capacity.\n\nAmong the possessors of this Opening, this Sweetness may last for an hour, a day, or longer; there is no specific time for its duration. Its duration has varied for us: sometimes it descended upon us in an event and lasted an hour, then lifted. Then it descended in another spiritual vision (واقعة أخرى) and lasted for days, night and day, and then lifted. When it lifts, that numbness in the faculties vanishes. This Sweetness cannot be likened to any sensible pleasure (اللذات المحسوسة) because it is strange, being conceptual (معنوية) in a non-material substance. It does not resemble the sweetness of honey, nor the sweetness of intercourse, nor the sweetness of any sensible thing. Likewise, it does not resemble the sweetness of attaining beloved sciences (العلوم المعشوقة) sought by the seeker; rather, it is higher and grander. Its effect on the senses is greater than the effect of sweetness compounded in sensible materials, like the sweetness of any sweet thing. Its distinction from the delights of conceptual meanings (لذات المعاني) is only due to its effect on the senses, so understand that.\n\nWhen The Real named me a servant by His Names and opened for me in this Sweetness, I saw nothing with a stronger effect than that found in the Name *Al-Aziz* (The Mighty). When He called me, \"O Servant of the Mighty (يا عبد العزيز),\"—the meaning of which is that the human is established as a servant in every Divine Name to achieve the distinction (الفرقان) between the realities for the acquisition of Divine Sciences—I found a Sweetness in this call that I did not find in any other Name. I looked into the reason for this and found that the station of Might (العزة) necessitates that the matter be so.\n\nAlthough this Sweetness is distinct from the sweetness of sensible things and conceptual meanings, it is varied in itself. The sweetness of one matter is different from the sweetness of another, and the taster finds the difference between them, just as a person finds the difference between the sweetness of sugar and the sweetness of honey, even though they share sweetness. The same applies here. This Sweetness does not occur for any of the People of Allah except through Divine Affection (العطف الإلهي). When Divine Affection descends upon the servant, Allah grants him the finding of this Sweetness in his inward realm, thereby attracting him to Himself, because the soul is naturally inclined to everything it finds delightful.\n\nOne of the sweetest Openings that passed over me in this time was when <<ن وَالْقَلَمِ وَمَا يَسْطُرُونَ>> (Nun. By the pen and what they inscribe) was recited to me. I found no delight greater than the delight of <<وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ>> (And indeed, you are upon a tremendous character). This was the greatest glad tidings that came to me. Furthermore, it was recited to me twice in successive periods, and the repetition of the recitation increased my admiration for it. The repetition of recitation for us is like the repetition of the descent of a verse or a chapter upon the Messenger twice, as came concerning the descent of *Surat Al-Mursalat* and others, that they descended twice.\n\nWhen The Real shows affection to His servant with this Sweetness and attracts him by it to bestow upon him knowledge he did not possess, if he does not find knowledge, then it is neither attraction nor the sweetness of an Opening. This is one of the signs of the Opening of Sweetness. The Real does this so that the servant's movement is conditioned (معلولة), because he is conditioned in origin. This is to establish Allah's proof against him. For the servant may become proud of the Divine power he possesses, and he might see that he has a distinction (تنزيها) by being attracted to The Real rather than other servants, claiming that this is a preference (إيثار) on his part for the Divine Presence. So, Allah made his attraction arise from Sweetness. If he becomes proud, as we said, the proof is established against us that what took him to The Real was not preference for the Divine Presence, but the finding of Sweetness and delight. He strove for his own soul, and the favor (المنة) belongs to Allah alone; no one has favor over Allah. And He has <<الْحُجَّةُ الْبَالِغَةُ>> (the conclusive argument); no one has an argument against Allah.\n\nAnyone among the People of Allah who says otherwise only says it as an ecstatic utterance (شطح), lacking reality due to the overwhelming nature of the state (غلبة الحال) upon him. It is the tongue of his state, not his own tongue. When he recovers, he says: <<قَالَ سُبْحَانَكَ تُبْتُ إِلَيْكَ>> (He said: Glory be to You, I repent to You). If you ask, \"What is the meaning of attraction (الجذب) here, given that he is already with Him?\" We say: No one is with The Real purely in the aspect of The Real for His own sake. Rather, they are with The Real in the aspect in which The Real established them. Thus, the attraction from The Real, through this Sweetness, is from the state in which The Real established him to another state, benefiting him with knowledge he did not possess by tasting (ذوقا). This continues perpetually, without end. It is called attraction because the servant inevitably becomes enamored with his state and accustomed to it, and he is not attracted away from it except by something more wondrous to him than it. Therefore, the Opening of Sweetness is granted to him to free him from what he had stopped with. When he is attracted to The Real, his previous state also accompanies him, because he does not abandon it, since what is known is not unknown. Thus, the ruling of attraction is only concerned with preventing him from stopping with his state and being content with it. It generates in him the longing to attain another matter he does not possess, while still retaining the state he was upon. Know this.\n\nNot all the People of Allah are upon this footing we have mentioned. This is the state of the greatest among them. For a group of the People of Allah are distracted by what they return to from what they were upon. For Allah has raised some of them above others and preferred one class over another, saying: <<تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ>> (Those messengers—We preferred some of them over others) and <<وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّينَ عَلَى بَعْضٍ>> (And indeed, We preferred some of the prophets over others).\n\nKnow that the origin of finding this Sweetness in us, from the Divine Presence, comes from the Divine Sweetness implied in the explicit saying (صريح) of the Prophet (peace be upon him): \"Allah rejoices more at the repentance of His servant...\" (the Hadith). From there, this Sweetness originated in the inward realm of the People of Allah. If you understand, you have been cast upon the Path. This is known only by the Gnostics (العارفون بالله) described in the Sacred Law (الشرع), not those indicated by reason (العقل). The same applies to everything that comes from this type of chapter. The Divine Laughter (الضحك الإلهي) or Smiling (التبشبش) has no entry into this Sweetness; rather, that is for joy (الفرح). So do not mix or use analogy (تقس). For the path of Allah is not attained by analogy. Not every matter that resembles another matter has the ruling of that which it resembles. The matter is not so. Rather, it has the ruling only of the aspect in which the resemblance occurred. For example, a chickpea resembles a pearl in roundness, but neither has the ruling of the other. Similarly, causes (العلل) differ even with the unity of the effect (المعلول) if the effect is an attribute carried by a subject, like the roundness used in the example. Roundness is an attribute carried by the round object, whatever that object may be. The cause of the roundness of the celestial sphere is not the cause of the roundness of the pearl. Thus, the causes differed due to the difference in the loci of the effect, while the effect (المعلول) is roundness. Beware of analogy in Divine Knowledge (العلم الإلهي). Indeed, if matters are verified, analogy is fundamentally invalid. It is one of the matters in which the people of speculative thought (أهل النظر) erred when they applied the ruling of the object of comparison (المقيس عليه) to the object being compared (المقيس). We have explained in this type of Opening enough to suffice whoever wishes to attain it by tasting (ذوقا) for himself. When he tastes it, he will know what expansion (البسط) it entails.\n\nAs for the third type of Opening, which is the Opening of Direct Unveiling (فتوح المكاشفة), the cause of which is Gnosis (معرفة الحق). Know first that The Real (الحق) is too majestic and high to be known in His Essence (في نفسه), but He is known in things (في الأشياء). Direct Unveiling (المكاشفة) is the cause of knowing The Real in things. Things are like veils (الستور) over The Real. When they are lifted, the Unveiling (الكشف) of what is behind them occurs, resulting in Direct Unveiling. The one who receives Direct Unveiling sees The Real in things by Unveiling (كشفا), just as the Prophet (peace be upon him) sees what is behind him from his back. The veil was lifted for him, and the door was opened, while the back and the behind remained fixed. He said: \"Indeed, I see you from behind my back.\" We have tasted this station, and praise be to Allah.\n\nThe Real is not known in things except with the manifestation of things and the lifting of their ruling. The eyes of the common people fall only upon the ruling of things. Those who have the Opening of Direct Unveiling (فتوح المكاشفة), their eyes fall upon nothing in things except The Real. Among them, there is one who sees The Real *in* things, and one who sees things *with* The Real in them. There is a distinction (فرقان) between the two. The first, upon the Opening, his eye falls only upon The Real, so he sees Him in things. The second, his eye falls upon things, but he sees The Real in them due to the existence of the Opening.\n\nThe origin of the manifestation of this Opening from the Divine Presence is the state of His saying: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ>> (And We will surely test you until We make evident those who strive among you). The trial (الابتلاء) lifts the veil of the claim (حجاب الدعوى) that the cosmos (الكون) was asserting, and the Unveiling (الكشف) occurs, which is the specific connection of Divine Knowledge (العلم الإلهي) to the actual state of the matter. Thus, He knows the truthfulness of the cosmos's claim from its falsehood. From this Divine Attribute (الصفة الإلهية) the Opening of Direct Unveiling appeared, for no ruling manifests in existence except that it has an origin in the Divine Presence (الجناب الإلهي) to which it is attributed. The matter must be so, for we have mentioned in more than one place that Allah’s knowledge of things stems from His knowledge of Himself. The cosmos (العالم) emerged upon His form, so no ruling deviates from Him whatsoever. He, the Glorified, is the Lord and Sovereign of everything. Things are connected to Him in every state, and He is connected to things in every state.\n\nBecause of this, those among our companions and some speculative thinkers (النظار) who erred, erred by claiming they knew Allah first, and then knew things. They knew Allah in the aspect that He is Necessarily Existent (واجب الوجود) by His Essence, and that it is not possible for there to be another Necessarily Existent being. The Oneness (أحدية) of the Necessarily Existent is thus verified. All this is sound and undisputed among the fair-minded. However, the goal is only the knowledge of His being the Lord (رب) of this cosmos. This cannot be known unless His knowledge of the cosmos precedes it. This is what the knowledge of the Perfect Men (الكمل من رجال الله) among the People of The Real grants. For this reason, the Prophet (peace be upon him) said: \"Whoever knows himself knows his Lord (من عرف نفسه عرف ربه).\" He did not say: \"Whoever knows his Lord knows himself.\"\n\nThis is because, in the aspect of His Essence (نفسه), He is Necessarily Existent and possesses Absolute Independence (الغني المطلق). Absolute Independence pays no attention to anything other than His Essence; if He paid attention, what He established would not be sound. Thus, He does not know that He is the God (إله) of the cosmos. If He wishes to know that He is the God of the cosmos, He looks into the cosmos and sees in it the reality of need (الافتقار) due to its contingency (إمكانه) for a preponderant factor (المرجح). He finds nothing but this Necessarily Existent Being, which He established by His proof before looking into this other matter. So, He attributes it to Himself and says: \"This Necessarily Existent Being is the Lord of this cosmos.\" Without this path of contemplation, He is not known to be the God of the cosmos.\n\nFurthermore, the speculative thinkers were veiled from the need established in their own souls when they directed their contemplation toward knowing the Necessarily Existent by His Essence. When He was established for them by proof, He revealed to them their contingency and need, without them realizing that the Necessarily Existent Being was *them*. They said: \"Our knowledge of Allah precedes our knowledge of the cosmos.\" They spoke truly when they said: \"Our knowledge of our God, that He is our God, precedes our knowledge of ourselves.\" But they did not realize the error they fell into. The Prophets knew this, so they made the cosmos the proof for Him. The greatest Opening of Direct Unveiling (أعظم فتح المكاشفة) in such a matter is to see The Real, such that the very act of seeing Him is the very act of seeing the cosmos, due to the verified connection (الارتباط المحقق). Thus, the cosmos is unveiled through the vision of Allah the Exalted. However, this subtle point (الدقيقة) is not for the people of speculative thought (أهل النظر), because speculation does not possess that power. Rather, it is one of the specific characteristics of Unveiling (الكشف). This is the most eloquent way to verify the issue of the precedence of the knowledge of Allah, in His aspect as God of the cosmos, over the knowledge of the cosmos. This is known only through the Openings of Direct Unveiling.\n\nI have not seen anyone among the predecessors of the People of Allah draw attention to this specific issue within the context of the Opening of Unveiling (الفتوح الكشفي). So, praise Allah the Exalted, since He caused the clarification of this issue to flow upon my tongue. It was not in my soul to even hint at it, much less state it explicitly. However, zeal (الغيرة) overcame me, and the eagerness to advise the servants whom The Real commanded me specifically to advise led me to explain this much concerning the Opening of Direct Unveiling. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو سولہ: فتوح (الفتوح) اور اس کے اسرار کی معرفت میں\n\nفتوح (الفتوح) ہی تمام راحتیں ہیں، اور یہی عذاب بھی ہے، لہٰذا جب یہ وارد ہو تو خوش نہ ہو۔\nجب تک تم آنکھوں سے نہ دیکھ لو کہ یہ کیا لاتا ہے، اور جب تم اسے دیکھ لو تو جو چاہو اسے اپنا سہارا بنا لو۔\nہوا (الریح) رحمن کی طرف سے بشارت ہوتی ہے، اس رحمت کے آگے جو وہ ارادہ کرے اور اس میں ہو۔\nاور یہ عذاب بھی ہو سکتی ہے جس کے لیے وہ تیار نہ ہو، جیسے قوم عاد کی ہوا (ریح عاد) جو ثابت شدہ شہادت کے ساتھ منتقل ہوئی۔\nپس اس کی خفیہ تدبیر (المکر) پوشیدہ ہے، لہٰذا اس کے لیے تیار رہو، تاکہ تم اس کے ذریعے کامیابی اور ہدایت (الرشد) حاصل کر سکو۔\n\n[کہ فتوح (الفتوح) تین اقسام پر ہیں]\n\nجان لو، اللہ ہمیں اور تمہیں اس چیز سے تقویت دے جس سے اس نے اپنے خاص بندوں کو تقویت دی ہے، کہ صوفیہ کی جماعت (الطائفة) کے نزدیک فتوح (الفتوح) تین اقسام پر ہیں۔\n\nپہلی قسم ظاہری تعبیر (العبارة) کی فتوح ہے۔\n\nانہوں نے کہا کہ اس کا سبب نیت کا اخلاص ہے، اور یہ میرے نزدیک صحیح ہے اور میں نے اسے چکھا ہے۔ اور یہ نبی اکرم صلی اللہ علیہ وسلم کا قول ہے: \"مجھے جوامع الکلم (جوامع الكلام) عطا کیے گئے ہیں۔\"\nاور اسی میں قرآن کا اعجاز بھی شامل ہے۔ میں نے ایک واقعہ (الواقعة) میں اس مسئلے کے بارے میں سوال کیا تو مجھے کہا گیا: \"صرف سچائی اور ایک حقیقی، ثابت شدہ امر کے بارے میں خبر دو، بغیر کسی حرف کی زیادتی یا اپنے اندرونی طور پر کسی قسم کی تبدیلی کے۔ اگر تمہارا کلام اس صفت کا ہو گا تو وہ معجزانہ ہو گا۔\"\n\nاور فتوح کی دوسری قسم باطنی حلاوت (الحلاوة) کی فتوح ہے۔\n\nصوفیہ کی جماعت نے کہا کہ یہ ذات حق (الحق) کی طرف سے اپنے عطف کے ذریعے جذب کرنے کا سبب ہے۔\n\nاور تیسری قسم حق کے ساتھ مکاشفہ (المكاشفة) کی فتوح ہے۔\n\nصوفیہ کی جماعت نے کہا کہ یہ حق کی معرفت (المعرفة) کا سبب ہے۔ ان سب کا جامع یہ ہے کہ ہر وہ امر جو تمہارے پاس بغیر کسی کوشش، انتظار، یا طلب کے آئے، وہ فتوح ہے، خواہ وہ ظاہری ہو یا باطنی۔ اور فتوح چکھنے والے (الذائق) میں اس کی ایک علامت یہ ہے کہ وہ غیر کی فتوح یا فکر کے نتائج کو قبول نہیں کرتا۔\n\nاور فتوح کی شرط یہ ہے کہ اس کے ساتھ کوئی فکر شامل نہ ہو اور نہ ہی وہ کسی فکر کا نتیجہ ہو۔ ہمارے شیخ ابو مدین فتوح کے بارے میں فرمایا کرتے تھے: \"ہمیں تازہ گوشت کھلاؤ (أطعمونا لَحْماً طَرِيًّا)،\" جیسا کہ اللہ تعالیٰ نے فرمایا: \"ہمیں قَدِید (خشک گوشت) نہ کھلاؤ۔\" یعنی، تم ہم تک فتوح میں سے صرف وہی منتقل کرو جو تمہارے دلوں پر منکشف ہو، دوسروں کی فتوح ہم تک منتقل نہ کرو۔ اس سے وہ اپنے ساتھیوں کی ہمت کو بلند کرتے تھے تاکہ وہ براہ راست اللہ تعالیٰ سے اخذ کرنے کی طلب کریں۔ پس اے ہمارے بھائیو! جان لو کہ مقام فتوح ایک حقیقی میزان کا محتاج ہے، اور یہ ایسا مقام ہے جس میں خفیہ مکر (مكر خفي) اور تدریجی گرفت (استدراج) شامل ہے۔ کیونکہ اللہ نے آسمان اور زمین کی برکات کے ساتھ فتح کا ذکر کیا ہے، اور عذاب کے ساتھ بھی فتح کا ذکر کیا ہے۔ یہ اس لیے ہے تاکہ عقل مند شخص دروازہ کھلنے پر فوراً خوش نہ ہو جائے جب تک کہ وہ یہ نہ دیکھ لے کہ اس کے لیے کیا کھولا گیا ہے۔ بعض نے موت کے وقت کہا: \"یہ وہ دروازہ ہے جسے میں اتنے سالوں سے کھٹکھٹا رہا تھا، اب یہ میرے لیے کھل رہا ہے، اور میں نہیں جانتا کہ کس چیز کے ساتھ۔\" قوم عاد نے کہا: \"یہ بادل ہے جو ہم پر برسے گا (هذا عارِضٌ مُمْطِرُنا)\"۔ انہیں عادت نے پردے میں رکھا۔ انہیں کہا گیا: \"بَلْ هُوَ ما اسْتَعْجَلْتُمْ بِهِ رِيحٌ فِيها عَذابٌ أَلِيمٌ\" (بلکہ یہ وہی ہے جس کی تم جلدی مچا رہے تھے، ایک ہوا جس میں دردناک عذاب ہے)۔ لہٰذا، اگر تم نہیں جانتے کہ وہاں کیا ہے تو فتح پر مغرور نہ ہو، اور کہو: \"رَبِّ زِدْنِي عِلْماً\" (اے میرے رب! میرے علم میں اضافہ فرما)۔\n\n[الٰہی فتح (الفتح الإلهي)]\n\nاور چونکہ عالم میں الٰہی فتح (الفتح الإلهي) دو قسموں پر ہے: ایک وہ فتح جو کھٹکھٹانے (قرع) سے ہو، اور دوسری وہ فتح جو بغیر کھٹکھٹائے ابتدائی طور پر۔ جہاں تک کھٹکھٹانے والی فتح کا تعلق ہے، اہل اللہ جانتے ہیں کہ کس چیز کے ساتھ فتح ہو گی، کیونکہ کھٹکھٹانا ہی ان کے لیے اس چیز کی دلیل ہے جس کے ساتھ فتح ہوتی ہے۔ لیکن قوم کی مطلوبہ فتوح یہ قسم نہیں ہے، بلکہ ان کی مطلوبہ فتوح وہ ہے جو بغیر کسی کوشش کے ابتدائی طور پر ہو، اگرچہ عمل اس بندے سے اس کے تضمن کے حکم سے طلب کرتا ہے جس پر وہ عمل قائم ہے۔ لیکن عامل بندے کے دل میں یہ سب کچھ یکبارگی نہیں آتا۔ لہٰذا، جب فتح ابتدائی طور پر وارد ہو تو یہ اس کے حق میں فتوح ہوتی ہے۔ اور جب فتوح اپنی مختلف صورتوں میں وارد ہو، جیسا کہ ہم نے بیان کیا، تو اس بندے پر لازم ہے کہ وہ انصاف کے ساتھ وزن قائم کرے، جیسا کہ اللہ نے اسے اپنے قول میں حکم دیا: \"وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ\" (اور انصاف کے ساتھ وزن قائم کرو)۔ پس یہ بندہ اپنی موجودہ حالت اور فتح کے درمیان وزن قائم کرتا ہے۔ اگر فتح حال کے مناسب ہو تو وہ اس کے حال کا نتیجہ ہے۔ اس صورت میں وہ ایک اور وزن قائم کرتا ہے، اور وہ یہ ہے کہ وہ فتح کی مقدار اور حال کی قوت کو دیکھے۔ اگر وہ برابر ہو تو یہ بلاشبہ نتیجہ ہے۔ پس اس بندے کو اس فتح میں اللہ کے مکر سے ہوشیار رہنا چاہیے، کیونکہ یہ اپنے مقام پر نتیجہ نہیں ہے۔ ہو سکتا ہے کہ اس کی عطا کو جلدی دے دیا گیا ہو اور وہ آخرت میں خالی ہاتھ پلٹے۔ لیکن اگر فتح ایسی ہو جو ادب اور ترقی عطا کرے، تو یہ مکر نہیں ہے، بلکہ یہ اللہ تعالیٰ کی طرف سے اس بندے پر عنایت ہے، جہاں اس نے اسے ایسی مزید فتح عطا کی جو اسے اللہ کے ہاں مزید خیر کی طرف لے جاتی ہے۔ اور اگر وہ فتح کی مقدار اور حال کی قوت کے درمیان وزن قائم کرے اور دیکھے کہ فتح حال سے زیادہ ہے، تو وہ اس میں سے حال کی قوت کے برابر مقدار کو نکال دے، اور جو باقی بچے وہ وہی فتوح ہے جس کا ذکر صوفیہ کی جماعت نے کیا ہے۔ یہ ایک اصل ہے جسے جاننا اور اس کی تحقیق کرنا ضروری ہے، اور اس کے شواہد ہیں جنہیں چکھنے والا جانتا ہے، اگرچہ فتح مکمل طور پر حال کے میزان میں داخل نہ ہو۔\n\nاور اگر فتح مکمل طور پر حال کے میزان میں داخل نہ ہو اور اس کا حال اس پر برقرار رہے، تو وہ فتح ہی قوم کے نزدیک مطلوبہ فتح ہے۔ اور جب یہ بات ثابت ہو گئی، تو اب ہم فتوح کی ہر قسم کا ذکر کرتے ہیں۔ جہاں تک تعبیر (العبارة) کی فتوح کا تعلق ہے، یہ صرف کامل محمدی مردوں کے لیے ہوتی ہے، خواہ وہ کسی بھی نبی کے وارث ہوں۔ اس فتح کے حامل شخص کا سب سے مضبوط مقام اس کے تمام اقوال، حرکات اور سکون میں سچائی (الصدق) ہے۔ یہاں تک کہ سچائی اسے اس مقام تک پہنچا دیتی ہے کہ اس کا ساتھی اور ہم نشین اس کے باطن میں موجود چیز کو اس کی ظاہری حرکت سے جان لیتا ہے۔ اس فتح کے حامل شخص کے لیے یہ ممکن نہیں ہے کہ وہ اپنے نفس میں کلام کو تصور کرے، اسے اپنی فکر سے ترتیب دے، اور پھر اس کے بعد اسے زبان سے ادا کرے۔ بلکہ اس کے بولنے کا وقت، اس لفظ کے تصور کا وقت جس سے وہ اپنے نفس کی تعبیر کرتا ہے، اس معنی کے اس کے نفس میں قائم ہونے اور اس کی صورت بننے کا وقت ایک ہی ہوتا ہے۔ اس صفت کا حامل اس فتح کے حامل کے علاوہ کوئی نہیں ہوتا۔ اور اس فتح کے حامل پر نزول (التنزل) خاص طور پر اس مرتبے سے ہوتا ہے جہاں قرآن نازل ہوا، اس کے قرآن ہونے کی حیثیت سے، نہ کہ فرقان ہونے کی حیثیت سے، اور نہ ہی کلام اللہ ہونے کی حیثیت سے۔ کیونکہ کلام اللہ اولیاء اللہ کے دلوں پر تلاوت کی صورت میں مسلسل نازل ہوتا رہتا ہے۔ پس ولی اس چیز کو دیکھتا ہے جو اس پر تلاوت کی گئی، جیسا کہ نبی اس چیز کو دیکھتا ہے جو اس پر نازل کی گئی، اور وہ جانتا ہے کہ اس تلاوت سے کیا مراد ہے، جیسا کہ نبی جانتا ہے کہ اس پر کیا نازل ہوا، اور وہ امر کے تقاضے کے مطابق حکم لگاتا ہے۔ معاملہ اسی طرح ہے۔ اور ولی کے دل میں اس نزول کے لیے ایک حلاوت ہوتی ہے جس کا ذکر ہم فتح کی دوسری قسم میں کریں گے۔ اس فتح کے حامل کے لیے تلاوت صرف اس حیثیت سے واقع ہوتی ہے کہ متلو (تلاوت کی جانے والی چیز) قرآن ہے، اور کچھ نہیں۔ پس اللہ اس کے لیے تعبیر میں کشادگی (فتح) عطا کرتا ہے، اور وہ اپنے قلم یا اپنی زبان سے اپنے نفس کی تعبیر اس طرح کرتا ہے کہ سننے والے کے لیے مقصود واضح ہو جاتا ہے، بشرطیکہ سننے والا ان لوگوں میں سے ہو جو کان دھرتے ہیں۔ اور اس فتح کے حامل کی اپنے اندرونی علامات میں خشوع (الخشوع) کا ساتھ رہنا اور اس کے جسم پر مسلسل کپکپی (الاقشعرار) کا طاری رہنا ہے، یہاں تک کہ وہ محسوس کرتا ہے کہ اس کے اجزاء بکھر گئے ہیں۔ اگر وہ اپنے اندر یہ نہ پائے تو وہ جان لے کہ وہ مطلوبہ شخص نہیں ہے اور نہ ہی وہ اس فتح کا حامل ہے۔ یہ وہ فتح ہے جس کا اثر میں نے اپنی عمر میں اللہ کے جن بندوں سے ملا ہوں، ان میں سے کسی میں نہیں دیکھا۔ ہو سکتا ہے کہ زمانے میں ایسے لوگ ہوں جنہیں یہ فتح حاصل ہو اور میں ان سے نہ ملا ہوں، لیکن میرے نزدیک بلا شک و شبہ میں ان میں سے ہوں۔ پس اس پر اللہ کا شکر ہے۔ اور منازل کے فصل میں منزل القرآن فرقان میں اس کے اسماء کے درمیان فرق بیان کیا جائے گا، کیونکہ یہ قرآن، فرقان، نور، ہدایت اور اس کے لیے رکھے گئے دیگر اسماء ہیں۔ اور جب بھی بات کرنے والا اپنے نفس کی تعبیر کرنے سے پہلے اس چیز کو تصور کرے جس کے بارے میں وہ بات کرنے والا ہے، اور اپنے نفس میں تعبیر کو ترتیب دے، اسے بہتر بنائے، اور اس پر غور کرے، یہاں تک کہ وہ ہر سننے والے کے نزدیک اچھا لگے، تو وہ فتح کا حامل نہیں ہے۔ کیونکہ فتوح کی شان یہ ہے کہ وہ اچانک اور بغیر کسی شعور کے آتی ہے۔ اس راہ میں ہر فتوح اسی طرح ہوتی ہے۔ پھر اس فتح کے حامل کی حقیقت میں یہ شامل ہے کہ وہ اس چیز کا شہود (شہود) کرے جس کی وہ تعبیر کر رہا ہے، اور اس کا بھی شہود کرے جو اس سے سن رہا ہے، اور اس چیز کا بھی شہود کرے جو وہ سن رہا ہے۔ پس وہ اسے ایسی تعبیر عطا کرتا ہے جو اس خاص سماعت کے لائق ہو۔ اگر وہ اس صفت کا حامل نہ ہو تو وہ تعبیر کی فتح کا حامل نہیں ہے۔ اور یہی ہمارے اس قول کا معنی ہے کہ اس کا سبب اخلاص ہے۔\n\nفتوح کی دوسری قسم جو باطنی حلاوت (الحلاوة) کی فتح ہے، اور یہ ذات حق (الحق) کی طرف سے اپنے عطف کے ذریعے جذب کرنے کا سبب ہے۔ اگرچہ یہ حلاوت معنوی ہے، لیکن اس کا اثر اس کے حامل کے نزدیک محسوس ہوتا ہے، جیسا کہ ٹھنڈے پانی کی ٹھنڈک محسوس ہوتی ہے۔ اور اس کے احساس کی صورت ہر محسوس چیز کے احساس کی صورت جیسی ہے۔ اور حس میں اس کا راستہ دماغ سے شروع ہو کر ذائقہ کی جگہ تک جاتا ہے، جہاں وہ اسے ذوق کے طور پر پاتا ہے۔ اس ذوق کے حاصل ہونے پر وہ اعضاء اور جوڑوں میں ڈھیلا پن (استرخاء) اور لذت کی شدت کی وجہ سے اعضاء میں سستی (خدر) اور اپنی طاقت کا خالی ہو جانا (استفراغ) پاتا ہے۔ اور اس فتح کے حاملین میں سے بعض ایسے ہیں جن کے ساتھ یہ حلاوت ایک گھنٹہ، ایک دن، یا اس سے زیادہ رہتی ہے۔ اس کے باقی رہنے کا کوئی مخصوص وقت نہیں ہے۔ کیونکہ اس کا باقی رہنا ہم پر مختلف رہا ہے۔ ایک وقت یہ ایک معاملے میں ہم پر نازل ہوئی تو ایک گھنٹہ ہمارے ساتھ رہی، پھر اٹھ گئی، پھر ایک دوسرے واقعہ میں نازل ہوئی تو کئی دن رات ہمارے ساتھ رہی، اور پھر اٹھ گئی۔ جب یہ اٹھ جاتی ہے تو جوارح سے وہ سستی زائل ہو جاتی ہے۔ اور اس حلاوت کو محسوس لذتوں میں سے کسی بھی لذت سے تشبیہ نہیں دی جا سکتی، کیونکہ یہ عجیب ہے، اس لیے کہ یہ غیر محسوس مادے میں معنوی ہے۔ یہ نہ تو شہد کی حلاوت سے مشابہت رکھتی ہے، نہ جماع کی حلاوت سے، اور نہ ہی کسی محسوس چیز کی حلاوت سے۔ جیسا کہ یہ طالب کے لیے محبوب علوم کے حصول کی حلاوت سے بھی مشابہت نہیں رکھتی، بلکہ یہ اس سے بلند اور عظیم تر ہے۔ اور حس میں اس کا اثر محسوس مادوں میں مرکب حلاوت کے اثر سے زیادہ عظیم ہوتا ہے، جیسے ہر میٹھی چیز کی حلاوت۔ اور معانی کی لذتوں سے اس کا امتیاز صرف اس اثر کی وجہ سے ہے جو اسے حس میں حاصل ہوتا ہے۔ پس اسے سمجھ لو۔ اور جب حق نے مجھے اپنے اسماء کے ساتھ بندہ (عبد) کہا اور اس حلاوت میں میرے لیے کشادگی عطا کی، تو میں نے اسم العزیز میں اس سے زیادہ شدید اثر والی کوئی چیز نہیں دیکھی۔ جب اس نے مجھے \"یا عبد العزیز\" کہہ کر پکارا (اور اس کا مطلب یہ ہے کہ انسان کو ہر الٰہی اسم میں بندہ بنا کر کھڑا کیا جائے تاکہ حقائق کے درمیان فرقان حاصل ہو اور الٰہی علوم حاصل ہوں)، تو میں نے اس پکار میں ایسی حلاوت پائی جو مجھے دوسرے اسماء میں نہیں ملی۔ میں نے اس کا سبب دیکھا تو پایا کہ مقام عزت کا تقاضا یہی ہے کہ معاملہ ایسا ہی ہو۔ اور اگرچہ یہ حلاوت محسوسات اور معانی کی حلاوت سے ممتاز ہے، لیکن یہ خود اپنے اندر بھی متنوع ہے۔ پس اس کے کسی ایک امر کی حلاوت دوسرے امر کی حلاوت سے مختلف ہوتی ہے، اور چکھنے والا ان کے درمیان فرق پاتا ہے، جیسے انسان شکر کی حلاوت اور شہد کی حلاوت کے درمیان فرق پاتا ہے، اگرچہ دونوں میں حلاوت مشترک ہے۔ اور اسی طرح معاملہ یہاں بھی ہے۔ اور یہ حلاوت اہل اللہ میں سے کسی کو بھی الٰہی عطف (العطف الإلهي) کے بغیر حاصل نہیں ہوتی۔ جب الٰہی عطف بندے پر وارد ہوتا ہے، تو اللہ اسے اپنے باطن میں اس حلاوت کا وجدان عطا کرتا ہے، اور اسے اپنی طرف جذب کرتا ہے، کیونکہ نفس ہر اس چیز کی طرف مائل ہونے کے لیے فطرت میں شامل ہے جس سے وہ لذت حاصل کرتا ہے۔ اور اس زمانے میں اس فتح سے زیادہ شدید حلاوت جو مجھ پر گزری، وہ اس وقت تھی جب مجھ پر تلاوت کی گئی: \"ن وَالْقَلَمِ وَمَا يَسْطُرُونَ\" (ن، اور قلم کی قسم اور جو کچھ وہ لکھتے ہیں)۔ تو میں نے \"وَإِنَّكَ لَعَلَى خُلُقٍ عَظِيمٍ\" (اور بے شک تم عظیم اخلاق پر ہو) کی لذت سے بڑھ کر کوئی لذت نہیں پائی۔ یہ سب سے بڑی بشارت تھی جو مجھ پر وارد ہوئی۔ پھر یہ مجھ پر دو متواتر زمانوں میں دو بار تلاوت کی گئی، تو اس تلاوت کے تکرار نے میرے تعجب میں اضافہ کر دیا۔ اور ہم میں تلاوت کا تکرار ایسا ہی ہے جیسے رسول پر آیت یا سورت کا دو بار نازل ہونا، جیسا کہ سورۃ والمرسلات وغیرہ کے نزول میں آیا ہے کہ وہ دو بار نازل ہوئی۔ پس جب حق اپنے بندے پر اس حلاوت کے ساتھ عطف فرماتا ہے اور اسے اپنی طرف جذب کرتا ہے تاکہ اسے ایسا علم عطا کرے جو اس کے پاس نہ تھا، تو اگر اسے علم نہ ملے تو یہ نہ جذب ہے اور نہ ہی وہ فتح کی حلاوت ہے۔ یہ حلاوت کی فتح کی علامات میں سے ہے۔ حق ایسا اس لیے کرتا ہے تاکہ بندے کی حرکت معلول ہو، کیونکہ وہ اصل میں معلول ہے۔ اور یہ اس لیے ہے تاکہ اللہ کی حجت اس پر قائم ہو جائے۔ کیونکہ بندہ اپنے پاس موجود الٰہی قوت پر فخر کرتا ہے، اور شاید وہ یہ سمجھے کہ حق کی جناب کی طرف اس کا انجذاب دوسرے بندوں کے مقابلے میں اس کی پاکیزگی (تنزیہ) ہے، اور وہ یہ گمان کرتا ہے کہ یہ حق کی جناب کے لیے اس کی طرف سے ایثار ہے۔ پس اللہ نے اس کے انجذاب کو حلاوت کے ذریعے بنایا۔ اگر وہ فخر کرے، جیسا کہ ہم نے کہا، تو ہم پر حجت قائم ہو جاتی ہے کہ اسے حق کی طرف لے جانے والی چیز حق کی جناب کا ایثار نہیں تھی، بلکہ حلاوت کا وجدان اور لذت حاصل کرنا تھا۔ پس اس نے اپنے نفس کے لیے کوشش کی، اور احسان صرف اللہ کا ہے، اللہ پر کسی کا کوئی احسان نہیں، اور اسی کی \"الْحُجَّةُ الْبَالِغَةُ\" (کامل حجت) ہے۔ اللہ پر کسی کی کوئی حجت نہیں۔ اور اہل اللہ میں سے جس نے بھی اس کے خلاف کہا، اس نے صرف شطح (شطحا) کے طور پر کہا، نہ کہ حقیقت کے طور پر، کیونکہ اس پر حال کا غلبہ تھا۔ پس وہ اس کے حال کی زبان تھی نہ کہ اس کی اپنی زبان۔ جب وہ ہوش میں آیا تو اس نے کہا: \"سُبْحَانَكَ تُبْتُ إِلَيْكَ\" (تو پاک ہے، میں تیری طرف توبہ کرتا ہوں)۔ اگر تم کہو کہ یہاں جذب (الجذب) کا کیا مطلب ہے جبکہ وہ اس کے ساتھ ہے؟ ہم کہیں گے: کوئی بھی شخص حق کے ساتھ اس حیثیت سے نہیں ہے کہ حق اس کے لیے خود ہے۔ بلکہ وہ حق کے ساتھ اس حیثیت سے ہیں کہ حق نے انہیں اس میں قائم کیا ہے۔ پس حق کی طرف سے اس حلاوت کے ذریعے جذب اس حال سے ہوتا ہے جس میں حق نے اسے قائم کیا ہے، ایک دوسرے حال کی طرف جو اسے ایسا علم دیتا ہے جو اس کے پاس ذوق کے طور پر نہیں تھا۔ یہ ہمیشہ اسی طرح ہوتا ہے، لامتناہی طور پر۔ اور اسے جذب اس لیے کہا گیا کہ بندہ لازمی طور پر اپنے حال سے محبت کرتا ہے اور اس سے مانوس ہو جاتا ہے۔ پس وہ اس سے صرف اسی چیز کے ذریعے کھینچا جاتا ہے جو اس کے لیے اس سے زیادہ عجیب ہو۔ اسی لیے اس کے لیے حلاوت میں کشادگی کی گئی تاکہ اسے اس چیز سے نجات دلائے جس پر وہ رک گیا تھا۔ جب وہ حق کی طرف جذب ہوتا ہے، تو اس کا وہ حال بھی اس کے ساتھ رہتا ہے جس پر وہ تھا، کیونکہ وہ اس سے جدا نہیں ہوتا، اس لیے کہ معلوم چیز کو بھلایا نہیں جاتا۔ پس جذب کا حکم صرف اس بات سے متعلق ہے کہ وہ اسے اپنے حال پر رکنے نہ دے اور اسی پر اکتفا نہ کرے۔ بلکہ اس کے لیے کسی دوسری چیز کے حصول کا شوق پیدا ہو جو اس کے پاس نہیں ہے، جبکہ وہ اپنے سابقہ حال کو بھی ساتھ رکھتا ہے۔ پس یہ جان لو۔ اور اہل اللہ میں سے ہر کوئی اس قدم پر نہیں ہے جس کا ہم نے ذکر کیا ہے۔ بلکہ یہ جو ہم نے ذکر کیا ہے، یہ ان کے اکابر کا حال ہے۔ کیونکہ اہل اللہ کی ایک جماعت کو وہ چیز مشغول کر دیتی ہے جس کی طرف وہ لوٹتے ہیں، اس چیز سے جو وہ پہلے تھے۔ کیونکہ اللہ نے ان میں سے بعض کو بعض پر بلند کیا ہے اور ہر صنف کو بعض پر فضیلت دی ہے۔ اس نے فرمایا: \"تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ\" (یہ رسول ہیں، ہم نے ان میں سے بعض کو بعض پر فضیلت دی) اور \"وَلَقَدْ فَضَّلْنَا بَعْضَ النَّبِيِّينَ عَلَى بَعْضٍ\" (اور بے شک ہم نے بعض نبیوں کو بعض پر فضیلت دی)۔ اور جان لو کہ ہم میں اس حلاوت کے وجدان کی اصل الٰہی جناب سے ہے، اس الٰہی حلاوت سے جو نبی اکرم صلی اللہ علیہ وسلم کے صریح قول میں شامل ہے: \"لله أفرح بتوبة عبده\" (اللہ اپنے بندے کی توبہ پر زیادہ خوش ہوتا ہے...)۔ پس اہل اللہ کے باطن میں یہ حلاوت وہیں سے پیدا ہوئی ہے۔ اگر تم سمجھ گئے تو میں نے تمہیں راستے پر ڈال دیا ہے۔ اور اسے صرف وہ لوگ جانتے ہیں جو شرع میں بیان کردہ عارفین باللہ ہیں، نہ کہ وہ جن پر عقل سے دلالت کی جاتی ہے۔ اور اس باب سے آنے والی تمام چیزیں اسی طرح ہیں۔ اور الٰہی ہنسی (الضحك الإلهي) اور تبشبش (خوش ہونا) کا اس حلاوت میں کوئی دخل نہیں، بلکہ وہ خوشی (الفرح) کے لیے ہے۔ پس خلط نہ کرو اور قیاس نہ کرو، کیونکہ اللہ کا راستہ قیاس (القياس) سے نہیں پایا جاتا۔ ہر وہ امر جو کسی دوسرے امر سے مشابہت رکھتا ہو، اس کا حکم اس مشابہ امر جیسا نہیں ہوتا۔ معاملہ ایسا نہیں ہے۔ بلکہ اس کا حکم صرف اس مشابہت کی حد تک ہوتا ہے جو واقع ہوئی ہو۔ جیسے چنے کا دانہ گولائی میں موتی سے مشابہت رکھتا ہے، لیکن ان میں سے ہر ایک کا حکم دوسرے جیسا نہیں ہے۔ اسی طرح علتیں بھی مختلف ہوتی ہیں جبکہ معلول ایک ہی ہو، اگر معلول محمول ہو، جیسے گولائی (الاستدارة) جس کی مثال دی گئی، اور یہ گول چیز میں ایک محمول امر ہے۔ گول چیز خواہ کچھ بھی ہو، فلک کی گولائی کی علت موتی کی گولائی کی علت نہیں ہے۔ پس علتیں معلول کے محل کے اختلاف کی وجہ سے مختلف ہو گئیں۔ پس الٰہی علم میں قیاس سے بچو۔ بلکہ اگر امور کی تحقیق ہو جائے تو قیاس کا وجود ہی صحیح نہیں رہتا۔ یہ ان امور میں سے ہے جن میں اہل نظر نے غلطی کی کہ انہوں نے مقیس علیہ (جس پر قیاس کیا گیا) کا حکم مقیس (جس کا قیاس کیا گیا) پر لاگو کر دیا۔ پس ہم نے فتح کی اس قسم میں اتنی مقدار بیان کر دی ہے جو اس شخص کے لیے کافی ہو جو اسے اپنے نفس سے ذوق کے طور پر حاصل کرنا چاہتا ہے۔ جب وہ اسے چکھ لے گا تو جان لے گا کہ وہ کس قدر بسط (توسیع) کو برداشت کر سکتا ہے۔\n\nاور فتوح کی تیسری قسم، جو مکاشفہ (المكاشفة) کی فتوح ہے، جو معرفت حق کا سبب ہے۔ سب سے پہلے جان لو کہ حق (الحق) اس سے کہیں زیادہ جلیل اور بلند ہے کہ اسے خود اپنی ذات میں جانا جائے، لیکن اسے اشیاء میں جانا جاتا ہے۔ پس مکاشفہ (المكاشفة) اشیاء میں حق کی معرفت کا سبب ہے۔ اور اشیاء حق پر پردوں (الستور) کی مانند ہیں۔ جب وہ اٹھ جاتے ہیں تو ان کے پیچھے کی چیز کا کشف (الکشف) ہوتا ہے، اور مکاشفہ واقع ہوتا ہے۔ پس مکاشفہ کرنے والا اشیاء میں حق کو کشف کے ذریعے دیکھتا ہے، جیسا کہ نبی صلی اللہ علیہ وسلم اپنے پیچھے سے اپنے پیچھے کی چیز کو دیکھتے تھے۔ پس ان کے حق میں پردہ اٹھ گیا اور دروازہ کھل گیا، جبکہ پیٹھ اور پیچھے کا حصہ اپنی جگہ پر ثابت رہا۔ آپ نے فرمایا: \"إني أراكم من خلف ظهري\" (میں تمہیں اپنی پیٹھ کے پیچھے سے دیکھتا ہوں)۔ اور ہم نے اس مقام کو چکھا ہے، اور اللہ کا شکر ہے۔ اشیاء میں حق کی معرفت صرف اشیاء کے ظاہر ہونے اور ان کے حکم کے اٹھ جانے کے ساتھ ہی ہوتی ہے۔ عام لوگوں کی آنکھیں صرف اشیاء کے حکم پر پڑتی ہیں، اور جنہیں مکاشفہ کی فتوح حاصل ہوتی ہے، ان کی آنکھیں اشیاء میں صرف حق پر پڑتی ہیں۔ ان میں سے بعض وہ ہیں جو حق کو اشیاء میں دیکھتے ہیں، اور بعض وہ ہیں جو اشیاء کو دیکھتے ہیں اور حق ان میں ہوتا ہے۔ اور ان دونوں کے درمیان فرق ہے۔ کیونکہ پہلا وہ ہے جس کی آنکھ فتح کے وقت صرف حق پر پڑتی ہے، اور وہ اسے اشیاء میں دیکھتا ہے۔ اور دوسرا وہ ہے جس کی آنکھ اشیاء پر پڑتی ہے، اور وہ فتح کے وجود کی وجہ سے حق کو ان میں دیکھتا ہے۔ اس فتح کے ظہور کی اصل الٰہی جناب سے اس حالت میں ہے جب اس کا قول ہے: \"وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ\" (اور ہم تمہیں ضرور آزمائیں گے یہاں تک کہ ہم تم میں سے مجاہدین کو جان لیں)۔ پس آزمائش اس دعوے کا پردہ اٹھا دیتی ہے جو کائنات دعویٰ کر رہی تھی۔ پس کشف واقع ہوتا ہے، اور وہ الٰہی علم کا وہ خاص تعلق ہے جس پر امر واقع ہوا، پس اس نے کائنات کے دعوے کی سچائی کو اس کے جھوٹ سے جان لیا۔ پس اس الٰہی صفت سے مکاشفہ کی فتح ظاہر ہوئی، کیونکہ وجود میں کوئی حکم ظاہر نہیں ہوتا مگر یہ کہ اس کی اصل الٰہی جناب میں ہو، جس کی طرف اس کا استناد ہو۔ اور معاملہ ایسا ہی ہونا صحیح ہے، کیونکہ ہم نے کئی جگہ ذکر کیا ہے کہ اللہ کا اشیاء کا علم اس کے اپنے نفس کے علم سے ہے۔ پس عالم اس کی صورت پر ظاہر ہوا، لہٰذا کوئی حکم اس سے باہر نہیں نکل سکتا۔ پس وہ سبحانہ ہر چیز کا رب اور مالک ہے۔ اشیاء ہر حال میں اس سے مربوط ہیں، اور وہ ہر حال میں اشیاء سے مربوط ہے۔ اسی وجہ سے ہمارے بعض ساتھیوں اور بعض اہل نظر نے غلطی کی کہ انہوں نے پہلے اللہ کو جانا اور پھر اشیاء کو جانا۔ انہوں نے اللہ کو اس حیثیت سے جانا کہ وہ واجب الوجود لذاتہ ہے، اور یہ کہ واجب الوجود لذاتہ کا ہونا صحیح نہیں ہے (یعنی ایک سے زیادہ کا ہونا صحیح نہیں ہے)، پس واجب الوجود کی احدیت صحیح ثابت ہوئی۔ یہ سب صحیح ہے اور منصف کے نزدیک اس میں کوئی اختلاف نہیں۔ لیکن مقصود صرف اس کا اس عالم کا رب ہونا جاننا ہے۔ یہ وہ نہیں جانتا جب تک کہ اسے عالم کی معرفت پہلے حاصل نہ ہو۔ یہ وہ ہے جو اہل حق میں سے اللہ کے کامل مردوں کا علم عطا کرتا ہے۔ اسی لیے نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"من عرف نفسه عرف ربه\" (جس نے اپنے نفس کو جانا، اس نے اپنے رب کو جانا)۔ آپ نے یہ نہیں فرمایا: \"جس نے اپنے رب کو جانا، اس نے اپنے نفس کو جانا۔\" کیونکہ وہ اپنی ذات کے لحاظ سے واجب الوجود ہے اور اس کے لیے غنی مطلق (الغني المطلق) ہے۔ اور غنی مطلق اپنی ذات کے علاوہ کسی اور کی طرف توجہ نہیں کرتا، کیونکہ اگر وہ توجہ کرتا تو جو کچھ اس نے مقرر کیا ہے وہ صحیح نہ ہوتا۔ پس وہ یہ نہیں جانتا کہ وہ عالم کا معبود (إله) ہے۔ جب وہ یہ جاننا چاہتا ہے کہ وہ عالم کا معبود ہے، تو وہ عالم میں دیکھتا ہے اور اس میں اپنے امکان کی وجہ سے مرجح (ترجیح دینے والے) کی طرف احتیاج کی حقیقت دیکھتا ہے۔ اور وہ اس واجب الوجود لذاتہ کے علاوہ کسی کو نہیں پاتا جسے اس نے اس دوسرے مسئلے پر غور کرنے سے پہلے اپنی دلیل سے ثابت کیا تھا۔ پس اس نے اسے اس کی طرف منسوب کیا اور کہا: \"یہ واجب الوجود اس عالم کا رب ہے۔\" اور غور و فکر کے اس طریقے کے بغیر، وہ یہ نہیں جان سکتا کہ وہ عالم کا معبود ہے۔ پھر اہل نظر اس چیز سے پردے میں رہ گئے جو ان کے نفوس میں ان کی احتیاج کے بارے میں ثابت تھی، جب انہوں نے اپنی نظر کو واجب الوجود لذاتہ کی معرفت کی طرف موڑا۔ اگرچہ وہ ان کے نزدیک دلیل سے ثابت ہو گیا، لیکن اس نے ان کے امکان اور احتیاج کو ظاہر کیا، اس طرح کہ انہیں یہ شعور بھی نہیں ہوا کہ وہ واجب الوجود ہی ان کا رب ہے۔ پس انہوں نے کہا: \"اللہ کا علم ہمارے علم سے پہلے ہے،\" اور انہوں نے سچ کہا۔ \"ہمارے معبود کا علم کہ وہ ہمارا معبود ہے، ہمارے اپنے علم سے پہلے ہے۔\" لیکن انہیں اس غلطی کا شعور نہیں ہوا جس میں وہ پڑ گئے۔ اور انبیاء نے یہ جان لیا، پس انہوں نے عالم کو اس پر دلیل بنایا۔ اور اس طرح کے مسئلے میں مکاشفہ کی سب سے بڑی فتح یہ ہے کہ وہ حق کو دیکھے، اور اس کا حق کو دیکھنا ہی اس کا عالم کو دیکھنا ہو، اس محقق ربط کی وجہ سے۔ پس وہ اللہ تعالیٰ کے دیکھنے سے عالم کو منکشف کرتا ہے۔ لیکن یہ باریک نکتہ اہل نظر کے لیے نہیں ہے، کیونکہ نظر میں وہ قوت نہیں ہے۔ بلکہ یہ کشف (الکشف) کی خصوصیات میں سے ہے۔ یہ سب سے بلیغ بات ہے جس کے ذریعے اس مسئلے کی تحقیق کی جا سکتی ہے کہ اللہ کا علم اس حیثیت سے کہ وہ عالم کا معبود ہے، عالم کے علم پر مقدم ہے۔ پس یہ صرف مکاشفہ کی فتوح سے ہی جانا جاتا ہے۔ اور میں نے متقدمین اہل اللہ میں سے کسی کو نہیں دیکھا جس نے اس کشفی فتوح میں اس مسئلے پر خاص طور پر تنبیہ کی ہو۔ پس اللہ تعالیٰ کا شکر ادا کرو کہ اس نے میری زبان پر اس مسئلے کی وضاحت جاری فرمائی۔ کیونکہ میرے نفس میں اس کی طرف اشارہ کرنے کا بھی ارادہ نہیں تھا، چہ جائیکہ میں اسے صراحتاً بیان کروں۔ لیکن مجھ پر غیرت غالب آ گئی اور ان بندوں کی نصیحت کا حرص غالب آ گیا جن کی نصیحت کا حق نے مجھے خاص طور پر حکم دیا ہے۔ اسی نے مجھے مکاشفہ کی فتوح میں اس قدر شرح کرنے پر مجبور کیا۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب دویست و شانزدهم در معرفت فتوح و اسرار آن»\n\nهمانا فتوح، تمامی آسودگی‌هاست *** و نیز عذاب است، پس چون وارد شد شادمان مشو\n\nتا آنکه ببینی عین آنچه را که می‌آورد، و چون *** آن را دیدی، هر آنچه خواهی تکیه‌گاه خود ساز\n\nباد، بشارتی از سوی رحمان است پیشاپیش *** آنچه از رحمت که او بخواهد، هرگاه قصد کند\n\nو گاهی عذابی است که برای آن آماده نشده *** مانند باد قوم عاد، با نقل ثابت و شاهد\n\nپس مکر از آن پنهان است، برایش آماده باش *** باشد که با آن به رستگاری و هدایت دست یابی\n\n[فتوح بر سه نوع است]\n\nبدان، خداوند ما و تو را به آنچه خواص بندگانش را تأیید کرده، تأیید کند، که فتوح نزد طایفه (الطائفة) بر سه نوع است:\n\nنوع اول، فتوح عبارت (فتوح العبارة) در ظاهر است.\n\nگفتند: و سبب آن اخلاص قصد است. و این نزد من صحیح است و آن را چشیده‌ام، و آن همان سخن پیامبر (ص) است: «أوتيت جوامع الكلام» (به من جوامع کلمات داده شده است).\n\nو اعجاز قرآن نیز از آن است. در واقعه‌ای (رؤیای صادقه) درباره این مسئله از من سؤال شد، و به من گفته شد: «جز از صدق و امری واقع و محقق، بدون افزودن یک حرف یا تزویر در نفس خود، خبر مده. اگر کلامت چنین صفتی داشته باشد، معجز خواهد بود.»\n\nو اما نوع دوم از فتوح، فتوح حلاوت (فتوح الحلاوة) در باطن است.\n\nطایفه گفتند: سبب آن جذب حق (الحق) با مهربانی اوست.\n\nو اما نوع سوم، فتوح مکاشفه (فتوح المكاشفة) با حق است.\n\nطایفه گفتند: سبب آن معرفت (المعرفة) به حق است. و جامع همه اینها آن است که هر امری که بدون تکلف، انتظار یا طلب به تو رسد، فتوح است، چه ظاهری باشد چه باطنی. و برای کسی که فتوح را می‌چشد، نشانه‌ای است، و آن عدم پذیرش از فتوح دیگران یا نتایج فکر است.\n\nو از شرط فتوح آن است که فکری همراه آن نباشد و نتیجه فکر نباشد. شیخ ما ابومدین درباره فتوح می‌فرمود: «اطعمونا لَحْماً طَرِيًّا» (به ما گوشت تازه بخورانید)، چنانکه خداوند متعال فرمود: «لا تطعمونا القديد» (به ما گوشت خشکیده نخورانید). یعنی: جز آنچه در قلب‌هایتان بر شما گشوده می‌شود، از فتوح به ما منتقل نکنید؛ فتوح دیگران را به ما منتقل نکنید. او با این سخن، همت یارانش را برای طلب اخذ مستقیم از خداوند متعال بالا می‌برد.\n\nپس ای برادران ما، بدانید که مقام فتوح نیازمند یک میزان (ميزان) حقیقی است، و آن مقامی است که در آن مکر پنهان (مكر خفي) و استدراج وجود دارد. زیرا خداوند از گشایش با برکات «مِنَ السَّماءِ وَالْأَرْضِ» (از آسمان و زمین) یاد کرده و از گشایش با عذاب نیز یاد کرده است. این بدان جهت است که عاقل هنگام گشوده شدن در، شادمان نشود تا ببیند چه چیزی بر او گشوده می‌شود. برخی هنگام مرگ گفتند: «این دری است که سال‌ها آن را می‌کوبیدم، اکنون بر من گشوده می‌شود، اما نمی‌دانم با چه چیزی.» قوم عاد گفتند: «هذا عارِضٌ مُمْطِرُنا» (این ابری است که بر ما باران می‌باراند). عادت، آنان را محجوب ساخت. به ایشان گفته شد: «بَلْ هُوَ ما اسْتَعْجَلْتُمْ بِهِ رِيحٌ فِيها عَذابٌ أَلِيمٌ» (بلکه آن همان چیزی است که برایش شتاب می‌کردید، بادی است که در آن عذابی دردناک است). پس اگر نمی‌دانی آنجا چیست، به گشایش مغرور مشو و بگو: «وَقُلْ رَبِّ زِدْنِي عِلْماً» (و بگو پروردگارا، علم مرا بیفزای).\n\n[گشایش الهی]\n\nو چون گشایش الهی (الفتح الإلهي) در عالم بر دو نوع است: گشایشی که از کوبیدن (طلب) حاصل می‌شود و گشایشی که ابتدایی و بدون کوبیدن است. اما گشایش کوبیدن، اهل الله می‌دانند که با چه چیزی گشوده می‌شود، زیرا کوبیدن راهنمای آنان بر چیزی است که با آن گشوده می‌شود. و مطلوب این قوم از فتوح، این نوع نیست، بلکه مطلوب آنان از فتوح، آن چیزی است که ابتدایی و بدون تکلف برای آن باشد، هرچند که عمل، آن را از بنده‌ای که بر آن است، به حکم تضمن طلب می‌کند. اما برای بنده عامل، آن امر به یکباره خطور نمی‌کند. پس گشایش در حق او، اگر ابتدایی وارد شود، فتوح است.\n\nو چون گشایش با انواع مختلفش، چنانکه مقرر کردیم، وارد شود، بر این بنده واجب است که میزان را به قسط برپا دارد، چنانکه خداوند در قولش به او امر کرده است: «وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ» (و میزان را به عدالت برپا دارید). پس این بنده میزان را بین حال خود که بر آن است و بین فتوح برپا می‌دارد. اگر فتوح مناسب حال باشد، نتیجه حال اوست. در این هنگام، میزان دیگری برپا می‌دارد، و آن این است که در مقدار فتوح و قوت حال نظر کند. اگر با آن برابر بود، بی‌شک نتیجه است. پس این بنده باید از مکر خداوند در این گشایش برحذر باشد، زیرا این نتیجه در جایگاه خود نیست. چه بسا عطای او تعجیل شده و دست خالی به سرای آخرت بازگردد. اما اگر فتوح از آن چیزهایی باشد که ادب و ترقی می‌بخشد، مکر نیست، بلکه عنایتی از جانب خداوند متعال به این بنده است، زیرا گشایشی به او افزوده که او را به خیر بیشتری نزد خداوند متعال می‌رساند. و اگر میزان را بین مقدار فتوح و قوت حال برپا داشت و فتوح را بالاتر از حال دید، به اندازه قوت حال از آن کم می‌کند، و آنچه اضافه آمد، همان فتوحی است که طایفه ذکر کرده‌اند. این اصلی است که باید دانسته و محقق شود و شواهدی دارد که چشنده آن می‌داند، حتی اگر فتوح به یکباره وارد میزان حال نشود و حال او بر او محفوظ بماند، آن گشایش همان گشایش مطلوب نزد قوم است.\n\nو پس از آنکه این مقرر شد، هر نوع از انواع فتوح را ذکر می‌کنیم. اما فتوح در عبارت (العبارة)، جز برای محمدی کامل (المحمدي الكامل) از مردان نیست، حتی اگر وارث هر پیامبری باشد. و قوی‌ترین مقام صاحب این فتوح، صدق در تمامی گفتار، حرکات و سکنات اوست، تا جایی که صدق او به جایی رسد که همنشین و جلیس او، آنچه در باطن اوست را از حرکت ظاهری‌اش بشناسد. برای صاحب این فتوح ممکن نیست که کلامی را در نفس خود تصور کند و با فکرش آن را مرتب سازد و سپس به آن نطق کند، بلکه زمان نطق او، زمان تصور آن لفظی است که با آن از آنچه در نفس اوست تعبیر می‌کند، و این همزمان با قیام آن معنا در نفس و صورت اوست. و این وصف برای غیر صاحب این فتوح نیست. و تنزل بر صاحب این فتوح، به طور خاص از مرتبه‌ای است که قرآن در آن نازل شده است، از جهت اینکه قرآن است، نه از جهت اینکه فرقان است و نه از جهت اینکه کلام خداست. زیرا کلام خدا پیوسته به صورت تلاوت بر قلب‌های اولیای خدا نازل می‌شود. پس ولی به آنچه بر او تلاوت شده می‌نگرد، همانند آنچه پیامبر به آنچه بر او نازل شده می‌نگرد. پس می‌داند که در آن تلاوت چه چیزی اراده شده است، همان‌گونه که پیامبر می‌داند در آنچه بر او نازل شده چه اراده شده است، و بر اساس مقتضای امر حکم می‌کند. شأن چنین است. و این تنزل در قلب ولی حلاوتی دارد که آن را در نوع دوم فتوح ذکر می‌کنیم. پس تلاوت برای صاحب این فتوح واقع نمی‌شود مگر از جهت اینکه متلو، قرآن است و نه چیز دیگر. پس خداوند در عبارت (العبارة) بر او می‌گشاید، و او با قلم یا لفظ خود از آنچه در نفسش است تعبیر می‌کند، به گونه‌ای که مقصود را نزد شنونده روشن می‌سازد، اگر شنونده از کسانی باشد که گوش فرا داده است. و از نشانه صاحب این فتوح نزد خودش، همراهی خشوع و پیوستگی لرزش (اقشعرار) بر بدن اوست، به گونه‌ای که احساس کند اجزای بدنش از هم جدا شده‌اند. اگر این را در خود نیافت، می‌داند که آن مرد مطلوب نیست و صاحب این فتوح نمی‌باشد. این گشایشی است که در عمر خود، در میان مردان خدایی که ملاقات کرده‌ام، اثری از آن در کسی ندیده‌ام. و شاید در این زمان مردانی باشند که این فتوح را دارند و من آنها را ملاقات نکرده‌ام، جز اینکه من بی‌شک و تردید از آنان هستم. پس حمد و سپاس از آن خداست. و در فصل منازل، در منزل قرآن، فرقان میان نام‌های آن خواهد آمد، زیرا آن قرآن، فرقان، نور، هدی و دیگر نام‌هایی است که برای آن وضع شده است. و هرگاه متکلمی که از آنچه در نفسش است تعبیر می‌کند، آنچه را که می‌خواهد بگوید قبل از عبارت تصور کند و ترتیب تعبیر از امر را در نفس خود بچیند و آن را نیکو سازد و در آن تأمل کند، به گونه‌ای که نزد هر شنونده‌ای نیکو جلوه کند، او صاحب فتوح نیست. زیرا از شأن فتوح آن است که ناگهانی و بی‌خبر و بدون شعور بیاید. هر فتوحی در این طریق چنین است. سپس، از حقیقت صاحب این فتوح، شهود (شهود) آنچه از آن تعبیر می‌کند، و شهود کسی که از او می‌شنود، و آنچه با آن می‌شنود، است. پس از عبارت، آنچه را که شایسته آن شنیدن خاص است به او می‌دهد. اگر چنین وصفی نداشته باشد، صاحب فتوح در عبارت نیست. و این معنای سخن ماست که سبب آن اخلاص است.\n\nنوع دوم از فتوح که فتوح حلاوت (فتح الحلاوة) در باطن است و سبب آن جذب حق (الحق) با مهربانی اوست. این حلاوت اگرچه معنوی است، اما اثر آن نزد صاحبش احساس می‌شود، همان‌گونه که سردی آب خنک احساس می‌شود. و صورت احساس آن مانند صورت احساس هر محسوس دیگری است. و مسیر آن در حس از مغز است که به محل چشایی فرود می‌آید. پس آن را به صورت ذوق می‌یابد. و هنگام حصول این ذوق، سستی در اعضا و مفاصل و بی‌حسی در جوارح را به دلیل شدت لذت و تخلیه توان خود می‌یابد. از صاحبان این فتوح کسانی هستند که این حلاوت یک ساعت، یک روز و بیشتر با آنها دوام می‌یابد. برای بقای آن زمان مخصوصی نیست. زیرا بقای آن برای ما متفاوت بوده است. گاهی در واقعه‌ای بر ما نازل شد و یک ساعت با ما دوام یافت، سپس مرتفع شد. سپس در واقعه‌ای دیگر نازل شد و شب و روز، روزها دوام یافت و سپس مرتفع شد. هنگامی که مرتفع می‌شود، آن بی‌حسی از جوارح زائل می‌گردد. این حلاوت را هیچ لذتی از لذات محسوس نمی‌تواند شبیه باشد، زیرا غریب است، به دلیل معنوی بودن در غیر ماده محسوس. پس نه شبیه حلاوت عسل است، نه حلاوت جماع، و نه حلاوت هیچ چیز محسوس. همچنین شبیه حلاوت حصول علوم مورد علاقه طالب نیست، بلکه بالاتر و والاتر است. و اثر آن در حس، عظیم‌تر از اثر حلاوت ترکیب شده در مواد محسوس است، مانند حلاوت هر شیرینی. و تمایز آن از لذات معانی، تنها به دلیل اثری است که در حس دارد. پس این را بفهم.\n\nو هنگامی که حق (الحق) مرا بنده‌ای به نام‌های خود خواند و در این حلاوت بر من گشود، شدیدترین اثر آن را در اسم «العزیز» دیدم. هنگامی که مرا «یا عبدالعزیز» (ای بنده عزیز) ندا داد، و معنای آن این است که انسان در هر اسم الهی به عنوان بنده اقامه شود تا فرقان بین حقایق (الحقائق) برای تحصیل علوم الهی حاصل شود، برای این ندا حلاوتی یافتم که برای هیچ‌یک از نام‌های دیگر نیافتم. و در سبب آن نگریستم و یافتم که مقام عزت اقتضا می‌کند که امر چنین باشد. این حلاوت اگرچه از حلاوت محسوسات و معانی متمایز است، اما در خود متنوع است. حلاوت یک امر از آن، خلاف حلاوت امر دیگری است. چشنده فرق بین آنها را می‌یابد، مانند حلاوت شکر که انسان فرق بین آن و حلاوت عسل را می‌یابد، اگرچه هر دو در حلاوت مشترک‌اند. امر در اینجا نیز چنین است. و این حلاوت برای هیچ‌یک از اهل الله حاصل نمی‌شود مگر با عطف (مهربانی) الهی. هنگامی که عطف الهی بر بنده وارد شود، خداوند یافتن این حلاوت را در باطن او روزی‌اش می‌کند. پس او را به سوی خود جذب می‌کند، زیرا نفس بر میل به هر آنچه از آن لذت می‌برد، سرشته شده است. از شدیدترین حلاوت‌هایی که از این فتوح در این زمان بر من گذشت، هنگامی بود که بر من تلاوت شد: «ن وَالْقَلَمِ وَما يَسْطُرُونَ» (نون، سوگند به قلم و آنچه می‌نویسند). پس لذتی عظیم‌تر از لذت «وَإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ» (و همانا تو بر اخلاقی عظیم هستی) نیافتم. این بزرگترین بشارتی بود که بر من وارد شد. سپس دو بار در دو زمان متوالی بر من تلاوت شد. تکرار تلاوت بر من، اعجاب مرا به آن افزود. تکرار تلاوت در ما، مانند تکرار نزول آیه یا سوره بر رسول (ص) دو بار است، چنانکه در نزول سوره «والمرسلات» و غیر آن آمده که دو بار نازل شده است.\n\nهنگامی که حق (الحق) با این حلاوت بر بنده‌اش مهربانی کند و او را با آن به سوی خود جذب کند تا علمی را که نزدش نبوده به او ببخشد، اگر علمی نیابد، آن جذب نیست و آن حلاوت فتوح نمی‌باشد. این از نشانه‌های فتوح حلاوت است. حق این کار را می‌کند تا حرکت بنده معلول باشد، زیرا او در اصل معلول است. و این برای اقامه حجت خداوند بر اوست. زیرا بنده به نیروی الهی که نزد اوست فخر می‌کند. و چه بسا می‌بیند که او به دلیل انجذابش به حق، بر خلاف دیگر بندگان، تنزیهی دارد. و گمان می‌کند که این ایثار او نسبت به ساحت حق است. پس خداوند انجذاب او را از حلاوت قرار داد. اگر فخر کرد، چنانکه گفتیم، حجت بر ما اقامه می‌شود که آنچه او را به سوی حق برده، ایثار ساحت حق نبوده، بلکه یافتن حلاوت و التذاذ بوده است. پس او برای نفس خود کوشیده است، و منت تنها از آن خداست، و هیچ‌کس بر خداوند منتی ندارد. و «وَلَهُ الْحُجَّةُ الْبالِغَةُ» (و حجت رسا از آن اوست). هیچ‌کس بر خداوند حجتی ندارد. و هر کس از اهل الله که غیر از این بگوید، آن را از روی شطح (شطح) گفته است، نه حقیقت، به دلیل غلبه حال بر او. پس آن زبان حال اوست نه زبان (عادی) او. و چون به هوش آید، می‌گوید: «سُبْحانَكَ تُبْتُ إِلَيْكَ» (پاک و منزهی، به سوی تو توبه کردم).\n\nاگر بگویی: پس معنای جذب در اینجا با وجود اینکه او با حق است چیست؟ می‌گوییم: هیچ‌کس با حق از آن جهت که حق برای ذات خود است، همراه نیست. بلکه آنان با حق هستند از آن جهت که حق او را در آن اقامه کرده است. پس جذب از جانب حق با این حلاوت، از حالی که حق او را در آن اقامه کرده، به حال دیگری است که در آن علمی را که نزدش نبوده، به صورت ذوق به او می‌رساند. این‌گونه به طور دائم تا بی‌نهایت ادامه دارد. و آن را جذب نامید، زیرا بنده ناگزیر است که عاشق حال خود شود و با آن انس گیرد. پس جز با چیزی که برایش شگفت‌انگیزتر از آن باشد، از آن جذب نمی‌شود. به همین دلیل، در حلاوت بر او گشود تا او را از آنچه با آن متوقف شده بود، رهایی بخشد. هنگامی که به سوی حق جذب شود، حال قبلی‌اش نیز همراه اوست، زیرا از او جدا نمی‌شود، چرا که معلوم، مجهول نمی‌گردد. پس حکم جذب تنها به این تعلق می‌گیرد که او را وا ندارد تا با حال خود متوقف شود و به آن اکتفا کند، بلکه برای او شوق به تحصیل امر دیگری که نزدش نیست، ایجاد می‌کند، در حالی که حال قبلی‌اش نیز همراه اوست. پس این را بدان.\n\nو همه اهل الله بر این قدمی که ذکر کردیم نیستند. بلکه این حال اکابر (بزرگان) آنان است. زیرا گروهی از اهل الله، آنچه به آن بازگشته‌اند، آنان را از آنچه بر آن بودند، مشغول می‌سازد. زیرا خداوند برخی از آنان را بر برخی دیگر برتری داده و هر صنفی را بر صنف دیگر فضیلت بخشیده است. پس فرمود: «تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ» (آن رسولان، برخی از آنان را بر برخی دیگر برتری دادیم) و «وَلَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ» (و به راستی برخی از پیامبران را بر برخی دیگر برتری دادیم). و بدان که اصل یافتن این حلاوت در ما، از ساحت الهی و از حلاوت الهی است که در صریح سخن پیامبر (ص) متضمن است: «لله أفرح بتوبة عبده» (خداوند به توبه بنده‌اش شادمان‌تر است) (حدیث). پس این حلاوت در باطن اهل الله از آنجا نشأت گرفته است. اگر فهمیدی، تو را بر راه افکنده‌ام. و این را جز عارفان بالله که در شرع وصف شده‌اند، نه کسانی که عقل بر آنان دلالت می‌کند، نمی‌شناسند. و همچنین است تمامی آنچه از این باب می‌آید. و خنده الهی و تبسم (تبشبش) در این حلاوت مدخلی ندارد، بلکه آن برای فرح است. پس مخلوط مکن و قیاس مگیر، زیرا راه خدا با قیاس درک نمی‌شود. چنین نیست که هر امری که شبیه امر دیگری است، حکم آن مشابه را داشته باشد. بلکه حکم آن امر، تنها در همان چیزی است که شباهت در آن واقع شده است، مانند نخود که در گردی شبیه مروارید است. اما هر یک از آنها حکم دیگری را ندارد. همچنین علل نیز با وجود یگانگی معلول، اگر معلول محمول باشد، متفاوت می‌شوند. مانند گردی که با آن مثال زده شد و آن امری است که در شیء گرد حمل می‌شود، هر چه آن شیء گرد باشد. پس علت گردی فلک، علت گردی مروارید نیست. پس علل به دلیل اختلاف محل‌های معلول متفاوت شدند، در حالی که معلول، گردی است. پس از قیاس در علم الهی برحذر باش. بلکه اگر امور محقق شوند، وجود قیاس اصلاً صحیح نیست. و این از اموری است که اهل نظر در آن به خطا رفته‌اند، زیرا حکم مقیس‌علیه را بر مقیس حمل کرده‌اند. پس ما در این نوع از فتوح، به اندازه‌ای که برای کسی که می‌خواهد آن را به صورت ذوق از نفس خود تحصیل کند، کفایت کند، بیان کردیم. و چون آن را چشید، می‌داند که چه بسطی را تحمل می‌کند.\n\nو اما نوع سوم از فتوح، که فتوح مکاشفه (فتوح المكاشفة) است و سبب معرفت حق (الحق) است. ابتدا بدان که حق (الحق) والاتر و بالاتر از آن است که در ذات خود شناخته شود، بلکه در اشیاء شناخته می‌شود. پس مکاشفه سبب معرفت حق در اشیاء است. و اشیاء بر حق مانند پرده‌ها هستند. پس چون برداشته شوند، کشف (الكشف) آنچه در پس آنهاست واقع می‌شود و مکاشفه حاصل می‌گردد. پس مکاشف، حق را در اشیاء به صورت کشف می‌بیند، همان‌گونه که پیامبر (ص) پشت سر خود را می‌دید. پس پرده در حق او برداشته شد و در گشوده گشت، با وجود ثابت بودن پشت و عقب. پس فرمود: «إني أراكم من خلف ظهري» (من شما را از پشت سرم می‌بینم). و ما این مقام را چشیده‌ایم، و حمد از آن خداست. پس حق در اشیاء شناخته نمی‌شود مگر با ظهور اشیاء و برداشته شدن حکم آنها. چشمان عامه جز بر حکم اشیاء نمی‌افتد. و کسانی که فتوح مکاشفه (فتوح المكاشفة) دارند، چشمانشان در اشیاء جز بر حق نمی‌افتد. برخی از آنان حق را در اشیاء می‌بینند و برخی دیگر اشیاء را می‌بینند و حق در آنهاست. و بین این دو فرقانی است. زیرا اولی، هنگام گشایش، چشمش جز بر حق نمی‌افتد و آن را در اشیاء می‌بیند. و دومی، چشمش بر اشیاء می‌افتد و حق را در آنها می‌بیند، به دلیل وجود فتوح.\n\nو اصل ظهور این فتوح از ساحت الهی، در حالت قول اوست: «وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجاهِدِينَ مِنْكُمْ» (و قطعاً شما را می‌آزماییم تا مجاهدان از شما را بشناسیم). پس ابتلا، حجاب دعوایی را که کَوْن (هستی) ادعا می‌کرد، برمی‌دارد و کشف (الكشف) حاصل می‌شود. و آن تعلق خاصی از علم الهی است به آنچه امر بر آن واقع شده است. پس صدق دعوای کَوْن از کذب آن دانسته می‌شود. پس از این صفت الهی، فتوح مکاشفه ظاهر شد. زیرا هیچ حکمی در هستی (الوجود) ظاهر نمی‌شود مگر آنکه اصلی در ساحت الهی داشته باشد که به آن استناد کند. و صحیح نیست که امر جز این باشد، زیرا ما در جاهای متعدد ذکر کرده‌ایم که علم خداوند به اشیاء از علم او به ذات خود است، پس عالم بر صورت او خارج شد. پس هیچ حکمی اصلاً از او خارج نمی‌شود. او سبحانه پروردگار و مالک هر چیزی است. پس اشیاء در هر حالی به او مرتبط‌اند، و او در هر حالی به اشیاء مرتبط است.\n\nو به همین دلیل است که برخی از اصحاب ما و برخی از اهل نظر به خطا رفته‌اند، در اینکه آنان ابتدا خدا را شناختند و سپس اشیاء را شناختند. آنان خدا را از آن جهت که واجب الوجود لذاته است و صحیح نیست که واجب الوجود دیگری باشد، شناختند. پس یگانگی واجب الوجود صحیح است. این همه نزد منصف صحیح و بدون نزاع است. اما مقصود جز علم به ربوبیت او برای این عالم نیست. این شناخته نمی‌شود مگر آنکه معرفت او به عالم مقدم باشد. این چیزی است که علم کاملان از مردان خدا و اهل حق (الحق) آن را می‌بخشد. و به همین دلیل پیامبر (ص) فرمود: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت). نفرمود: هر کس پروردگارش را شناخت، خود را شناخت. زیرا او از جهت ذات خود واجب الوجود است و غنای مطلق از آن اوست. پس غنای مطلق به غیر ذات خود التفات نمی‌کند، زیرا اگر التفات کند، آنچه مقرر کرده صحیح نخواهد بود. پس نمی‌داند که او خدای عالم است. هنگامی که اراده کند بداند که او خدای عالم است، در عالم نظر می‌کند. پس در آن حقیقت افتقار (نیازمندی) را به دلیل امکانش به مرجح می‌بیند. و جز این واجب الوجود لذاته را نمی‌یابد که آن را با دلیل خود قبل از نظر در این مسئله دیگر اثبات کرده بود. پس آن را به او اضافه کرد و گفت: این واجب، پروردگار این عالم است. و بدون این طریق در نظر، شناخته نمی‌شود که او خدای عالم است.\n\nسپس اهل نظر از آنچه در نفوسشان از افتقارشان ثابت بود، محجوب شدند، هنگامی که نظر را به شناخت واجب الوجود لذاته معطوف کردند. اگر با دلیل نزدشان ثابت شد، امکان و افتقارشان را بر آنان آشکار ساخت، در حالی که نمی‌دانستند آن واجب الوجود همان مقصود است. پس گفتند: علم ما به خدا بر علم ما به عالم مقدم است. و در آنچه گفتند صادق بودند: علم ما به اینکه خدای ما، خدای ماست، بر علم ما به خودمان مقدم است. پس متوجه خطایی که در آن افتاده بودند نشدند. و پیامبران این را دانستند. پس عالم را دلیلی بر او قرار دادند. و عظیم‌ترین فتوح مکاشفه (فتوح المكاشفة) در چنین مسئله‌ای این است که حق (الحق) را ببیند، و عین دیدن او، عین دیدن عالم باشد، به دلیل ارتباط محقق. پس عالم از دیدن خداوند متعال کشف می‌شود. اما این نکته دقیق برای اهل نظر نیست، زیرا نظر در توانش این نیست. بلکه از ویژگی‌های کشف (الكشف) است. این رساترین چیزی است که می‌توان با آن این مسئله را محقق ساخت که تقدم علم به خداوند از جهت اینکه او خدای عالم است، بر علم به عالم. پس این جز از فتوح مکاشفه (فتوح المكاشفة) شناخته نمی‌شود. و من ندیدم هیچ‌یک از متقدمین اهل الله متعال در این فتوح کشفی، به طور مشخص به این مسئله تنبه داده باشد. پس خداوند متعال را سپاس گویید که بیان این مسئله را بر زبان من جاری ساخت. زیرا در نفس من نبود که به آن اشاره کنم، چه رسد به اینکه آن را تصریح نمایم. بلکه غیرت بر من غلبه کرد و حرص بر نصیحت بندگانی که حق (الحق) مرا به نصیحت خاص آنان امر کرده بود، مرا به شرح این مقدار در فتوح مکاشفه (فتوح المكاشفة) واداشت. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 4
}