{
  "id": 263,
  "title": {
    "ar": "الباب الثالث والستون ومائتان في معرفة الحقيقة",
    "en": "Chapter 263: On the Gnosis (معرفة) of the Reality (الحقيقة)",
    "ur": "باب دو سو تریسٹھواں: حقیقت (الحقيقة) کی معرفت (المعرفة) کے بارے میں۔",
    "fa": "باب دویست و شصت و سوم در معرفت حقیقت (الحقيقة)"
  },
  "content": {
    "ar": "## «الباب الثالث والستون ومائتان في معرفة الحقيقة»\n\n\nوهي سلب آثار أوصافك عنك بأوصافه أنه الفاعل بك فيك منك لا أنت ما من دَابَّةٍ إِلَّا هُوَ آخِذٌ بِناصِيَتِها\n> إن الحقيقة تعطي واحدا أبدا *** والعقل بالفكر ينفي الواحد الأحدا\n\n\n> فالذات ليس لها ثان فيشفعها *** والكون يطلب من آثاره العددا\n\n\n> والكل ليس سوى عين محققة *** لا أهل فيها ولا أبا ولا ولدا\n\n\n### [أن الحقيقة هي ما هو عليه الوجود بما فيه من الخلاف والتماثل والتقابل‏]\n\n\nأعلم أيدنا الله وإياك بروح منه أن الحقيقة هي ما هو عليه الوجود بما فيه من الخلاف والتماثل والتقابل إن لم تعرف الحقيقة هكذا وإلا فما عرفت فعين الشريعة عين الحقيقة والشريعة حق ولكل حق حقيقة فحق الشريعة وجود عينها وحقيقتها ما تنزل في الشهود منزلة شهود عينها في باطن الأمر فتكون في الباطن كما هي في الظاهر من غير مزيد حتى إذا كشف الغطاء لم يختل الأمر على الناظر\n\n\nقال بعض الصحابة لرسول الله صلى الله عليه وسلم أنا مؤمن حقا فادعى حق الايمان وهو من نعوت الباطن فإنه تصديق والتصديق محله القلب فآثاره في الجوارح إذا كان تصديق له أثر فإن كان تصديق ما له أثر فلا يلزم ظهوره على الجوارح كما قال والفرج يصدق ذلك أو يكذبه فنسب الصدق إلى الفرج وهو عضو ظاهر فقال له رسول الله صلى الله عليه وسلم فما حقيقة إيمانك فقال كأني أنظر إلى عرش ربي بارزا\n\n\nوقد كان صدق رسول الله صلى الله عليه وسلم في قوله إن عرش ربه يبرز يوم القيامة فجعله هذا السامع مشهود الوقوع في خياله فقال كأني أنظر إليه أي هو عندي بمنزلة من أشاهده ببصري فلما أنزله منزلة الشهود البصري والوجود الحسي عرفنا إن الحقيقة تطلب الحق لا تخالفه فما ثم حقيقة تخالف شريعة لأن الشريعة من جملة الحقائق والحقائق أمثال وأشباه فالشرع ينفي ويثبت فيقول لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فنفى وأثبت معا كما يقول وهُوَ السَّمِيعُ الْبَصِيرُ وهذا هو قول الحقيقة بعينه فالشريعة هي الحقيقة فالحقيقة وإن أعطت أحدية الألوهة فإنها أعطت النسب فيها فما أثبتت إلا أحدية الكثرة النسبية لا أحدية الواحد فإن أحدية الواحد ظاهرة بنفسها وأحدية الكثرة عزيزة المنال لا يدركها كل ذي نظر فالحقيقة التي هي أحدية الكثرة لا يعثر عليها كل أحد ولما رأوا أنهم عاملون بالشريعة خصوصا وعموما ورأوا أن الحقيقة لا يعلمها إلا الخصوص فرقوا بين الشريعة والحقيقة فجعلوا الشريعة لما ظهر من أحكام الحقيقة وجعلوا الحقيقة لما بطن من أحكامها لما كان الشارع الذي هو الحق قد تسمى بالظاهر والباطن وهذان الاسمان له حقيقة فالحقيقة ظهور صفة حق خلف حجاب صفة عبد فإذا ارتفع حجاب الجهل عن عين البصيرة رأى أن صفة العبد هي عين صفة الحق عندهم وعندنا إن صفة العبد هي عين الحق لا صفة الحق فالظاهر خلق والباطن حق والباطن منشا الظاهر فإن الجوارح تابعة منقادة لما تريد بها النفس والنفس باطنة العين طاهرة الحكم والجارحة ظاهرة الحكم لا باطن لها لأنه لا حكم لها فينسب الاعوجاج والاستقامة للماشي بالممشي به لا إلى من مشى به والماشي بالخلق إنما هو الحق وذكر أنه على صراط مستقيم فالاعوجاج قد يكون استقامة في الحقيقة كاعوجاج القوس فاستقامته التي أريد لها اعوجاجه فما في العالم إلا مستقيم لأن الآخذ بناصيته هو الماشي به وهو على صراط مستقيم فكل حركة وسكون في الوجود فهي إلهية لأنها بيد حق وصادرة عن حق موصوف بأنه على صراط مستقيم بأخبار الصادق فإن الرسل لا تقول على الله إلا ما تعلمه منه فهم أعلم الخلق بالله وليس للكون معذرة أقوى من هذه فمن رحمة الرسل بالخلق تنبيه الخلق على مثل هذا ولما حكاها الحق عنه يسمعنا مقالته علمنا إن ذلك من رحمته بنا حيث عرفنا بمثل هذا فكان تعريفه إيانا بما قاله رسوله بشرى من الله لنا من قوله لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وكانت البشرى من كلمات الله ولا تَبْدِيلَ لِكَلِماتِ الله ومن باب الحقيقة كونه عين الوجود وهو الموصوف بأن له صفات من كون الموجودات ذات صفات ثم أخبر أنه من حيث عينه عين صفات العبد وأعضائه فقال كنت سمعه فنسب السمع إلى عين الموجود السامع وأضافه إليه وما ثم موجود إلا هو فهو السامع والسمع وهكذا سائر القوي والإدراكات ليست إلا عينه فالحقيقة عين الشريعة فافهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 263: On the Knowledge of the Reality\n\nIt is the stripping away of the effects of your attributes from you by His Attributes, [realizing] that He is the Doer through you, in you, from you, not you. <<مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا>> (There is no creature except that He holds it by its forelock).\n\n> Indeed, the Reality (الحقيقة) always yields the One,\n> While the intellect (العقل) through reflection denies the Single One (الأحد).\n\n> For the Essence (الذات) has no second to pair with it,\n> While the Cosmos seeks multiplicity from its effects.\n\n> And the All is nothing but a verified Essence (عين محققة),\n> Having neither family, nor father, nor child.\n\n### [That the Reality is what Existence is upon, including its difference, similarity, and opposition]\n\nKnow, may Allah support us and you with a spirit from Him, that the Reality (الحقيقة) is what Existence (الوجود) is upon, including its difference (الخلاف), similarity (التماثل), and opposition (التقابل). If you do not know the Reality thus, then you have not known it.\n\nThe very Essence (عين) of the Law (الشريعة) is the very Essence of the Reality (الحقيقة), and the Law is a truth (حق), and every truth has a reality. The truth of the Law is the existence of its essence, and its Reality is what descends into Witnessing (الشهود) to the rank of witnessing its essence in the inner dimension (باطن الأمر). Thus, it is in the inner dimension just as it is in the outer dimension, without addition, so that when the veil (الغطاء) is lifted, the matter is not confused for the observer.\n\nOne of the Companions said to the Messenger of Allah (PBUH), \"I am truly a believer,\" thus claiming the truth of faith, which is among the characteristics of the inner dimension (الباطن). For it is affirmation (تصديق), and the locus of affirmation is the heart. Its effects are seen in the limbs if the affirmation has an effect. If the affirmation has no effect, its appearance on the limbs is not necessary, as [the Prophet] said, \"and the private part confirms or denies that.\" He attributed truthfulness to the private part, which is an outer limb. The Messenger of Allah (PBUH) then asked him, \"What is the Reality (حقيقة) of your faith?\" He replied, \"It is as if I am looking upon the Throne of my Lord, manifest.\"\n\nThe Messenger of Allah (PBUH) had indeed spoken truly when he said that the Throne of his Lord would be manifest on the Day of Resurrection. This listener made it a witnessed occurrence in his Imagination (الخيال), saying, \"It is as if I am looking upon it,\" meaning, \"It is for me in the rank of something I witness with my sight.\" When he brought it down to the rank of visual Witnessing (الشهود البصري) and sensory Existence (الوجود الحسي), we knew that the Reality seeks the Real (الحق) and does not contradict Him. There is no Reality that contradicts a Law (شريعة), because the Law is one of the Realities (الحقائق), and Realities are examples and likenesses. The Law negates and affirms simultaneously, saying <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), thus negating and affirming together, just as He says <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (And He is the All-Hearing, the All-Seeing). This is precisely the statement of the Reality. Thus, the Law is the Reality.\n\nAlthough the Reality yields the Oneness of Divinity (أحدية الألوهة), it also yields the relations (النسب) within it. It only affirms the Oneness of relative Multiplicity (أحدية الكثرة النسبية), not the Oneness of the Single One (أحدية الواحد). For the Oneness of the Single One is manifest by itself, but the Oneness of Multiplicity (أحدية الكثرة) is difficult to attain; not every observer perceives it. The Reality, which is the Oneness of Multiplicity, is not stumbled upon by everyone. When they saw that they were acting according to the Law (الشريعة) both specifically and generally, and they saw that the Reality is known only by the elite (الخصوص), they differentiated between the Law and the Reality. They made the Law that which is manifest of the rulings of the Reality, and they made the Reality that which is hidden of its rulings.\n\nSince the Lawgiver, who is the Real (الحق), has named Himself the Outer (الظاهر) and the Inner (الباطن), and these two Names have a Reality for Him, the Reality is the manifestation of the Attribute of the Real behind the veil of the attribute of the servant. When the veil of ignorance is lifted from the eye of insight (عين البصيرة), he sees that the attribute of the servant is the very Essence (عين) of the Attribute of the Real—according to them. But according to us, the attribute of the servant is the very Essence of the Real (عين الحق), not the Attribute of the Real. The Outer is creation (خلق), and the Inner is the Real, and the Inner is the origin of the Outer. For the limbs are subservient and obedient to what the soul (النفس) desires of them. The soul is inner in essence and pure in ruling, while the limb is outer in ruling and has no inner dimension, because it has no ruling power. Thus, crookedness (الاعوجاج) and straightness (الاستقامة) are attributed to the one who walks by means of the walked-upon, not to the one who walks by means of it. The one who walks with Creation (الخلق) is none other than the Real, and He mentioned that He is upon a straight path (صراط مستقيم). Thus, crookedness may be straightness in Reality, like the crookedness of the bow, whose straightness is the crookedness intended for it. There is nothing in the World (العالم) except what is straight, because the One who holds it by its forelock is the One who walks with it, and He is upon a straight path.\n\nEvery movement and rest in Existence (الوجود) is Divine (إلهية), because it is in the hand of the Real and originates from the Real, who is described as being upon a straight path, according to the report of the Truthful One [the Prophet]. For the Messengers do not speak concerning Allah except what they know from Him; thus, they are the most knowledgeable of creation concerning Allah. The Cosmos (الكون) has no stronger excuse than this. It is out of the mercy of the Messengers toward creation that they alert creation to such a matter. When the Real related this from him [the Prophet], making us hear his statement, we knew that this was out of His mercy toward us, since He made us know such a thing. His making us know what His Messenger said was glad tidings (بشرى) from Allah for us, derived from His saying: <<لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا>> (For them are glad tidings in the life of this world). And the glad tidings are among the Words of Allah, and <<لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ>> (There is no changing the Words of Allah).\n\nIt is part of the category of Reality (الحقيقة) that He is the very Essence (عين) of Existence, and He is the One described as having Attributes (صفات) by virtue of the existent things (الموجودات) possessing attributes. Then He informed us that, from the perspective of His Essence, He is the very Essence of the attributes and limbs of the servant, saying, \"I was his hearing.\" Thus, He attributed hearing to the very Essence of the existent hearer and added it to Himself. Since there is no existent thing but Him, He is the Hearer and the Hearing. Likewise, all other faculties (القوي) and perceptions (الإدراكات) are nothing but His Essence. Therefore, the Reality is the very Essence of the Law. Understand this. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو تریسٹھ: معرفتِ حقیقت (Al-Ḥaqīqah) کے بیان میں\n\nیہ (حقیقت) تمہاری صفات کے آثار کو تم سے اس کی صفات کے ذریعے سلب کر دینا ہے، اس اعتراف کے ساتھ کہ وہی تمہارے ذریعے، تم میں، تم سے فعل کرنے والا ہے، نہ کہ تم۔ (قرآن: سورة ہود ۱۱:۵۶) \"کوئی چلنے والا نہیں مگر وہ اس کی پیشانی پکڑے ہوئے ہے۔\"\n\nحقیقت (Al-Ḥaqīqah) ہمیشہ ایک ہی عطا کرتی ہے\nاور عقل فکر کے ذریعے واحد احد (Al-Aḥad) کی نفی کرتی ہے۔\n\nپس ذات کا کوئی ثانی نہیں جو اس کی شفاعت کرے\nاور کائنات اپنے آثار سے کثرت (Al-Kathrah) کا تقاضا کرتی ہے۔\n\nاور سب کچھ ایک محققہ عین کے سوا کچھ نہیں\nجس میں نہ کوئی اہل ہے، نہ باپ اور نہ بیٹا۔\n\n[حقیقت (Al-Ḥaqīqah) وہ ہے جس پر ہستی (Al-Wujūd) قائم ہے، بشمول اس کے اختلاف، مماثلت اور تقابل کے]\n\nجان لو، اللہ تعالیٰ اپنی روح سے ہماری اور تمہاری تائید فرمائے، کہ حقیقت (Al-Ḥaqīqah) وہ ہے جس پر ہستی (Al-Wujūd) قائم ہے، بشمول اس کے اختلاف، مماثلت اور تقابل کے۔ اگر تم حقیقت کو اس طرح نہیں جانتے تو تم نے اسے نہیں جانا۔ پس شریعت (Al-Sharī‘ah) کا عین ہی حقیقت کا عین ہے۔ اور شریعت حق (Al-Ḥaqq) ہے، اور ہر حق کی ایک حقیقت ہوتی ہے۔ پس شریعت کا حق اس کے عین کا وجود ہے، اور اس کی حقیقت وہ ہے جو باطنِ امر میں اس کے عین کے شہود (Al-Shuhūd) کی منزل پر نازل ہو۔ پس وہ باطن (Al-Bāṭin) میں ویسی ہی ہو جیسی وہ ظاہر (Al-Ẓāhir) میں ہے، بغیر کسی اضافے کے، تاکہ جب پردہ ہٹے تو دیکھنے والے پر معاملہ میں کوئی خلل نہ آئے۔\n\nبعض صحابہ نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: \"میں سچا مؤمن ہوں۔\" اس نے ایمان کے حق کا دعویٰ کیا، اور یہ باطن (Al-Bāṭin) کی صفات میں سے ہے، کیونکہ یہ تصدیق ہے اور تصدیق کا محل قلب ہے۔ اس کے آثار اعضاء پر ظاہر ہوتے ہیں اگر تصدیق اثر رکھتی ہو۔ اگر تصدیق ایسی ہو جس کا کوئی اثر نہ ہو تو اس کا اعضاء پر ظاہر ہونا ضروری نہیں، جیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا: \"اور شرمگاہ اس کی تصدیق کرتی ہے یا تکذیب کرتی ہے۔\" پس آپ نے صدق کو شرمگاہ کی طرف منسوب کیا، جو کہ ایک ظاہری عضو ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے پوچھا: \"تو تمہارے ایمان کی حقیقت کیا ہے؟\" انہوں نے جواب دیا: \"گویا میں اپنے رب کے عرش کو نمایاں دیکھ رہا ہوں۔\"\n\nرسول اللہ صلی اللہ علیہ وسلم نے اپنے اس قول میں سچ فرمایا تھا کہ ان کے رب کا عرش قیامت کے دن نمایاں ہو گا، تو اس سننے والے نے اسے اپنے خیال میں مشہود الوقوع بنا لیا۔ اس نے کہا: \"گویا میں اسے دیکھ رہا ہوں،\" یعنی وہ میرے نزدیک اس شخص کی مانند ہے جسے میں اپنی آنکھوں سے دیکھ رہا ہوں۔ جب اس نے اسے بصری شہود (Al-Shuhūd) اور حسی وجود کی منزل پر اتارا، تو ہم نے جانا کہ حقیقت (Al-Ḥaqīqah) حق (Al-Ḥaqq) کا تقاضا کرتی ہے، اس کی مخالفت نہیں کرتی۔ پس کوئی ایسی حقیقت نہیں جو شریعت (Al-Sharī‘ah) کی مخالفت کرے، کیونکہ شریعت حقائق کے مجموعے میں سے ہے، اور حقائق مثالیں اور مماثلتیں ہیں۔\n\nپس شارع (Al-Shāri‘) نفی بھی کرتا ہے اور اثبات بھی، وہ فرماتا ہے: (قرآن: سورة الشوریٰ ۴۲:۱۱) \"اس کی مانند کوئی چیز نہیں ہے۔\" پس اس نے نفی بھی کی اور ساتھ ہی اثبات بھی، جیسا کہ وہ فرماتا ہے: (قرآن: سورة الشوریٰ ۴۲:۱۱) \"اور وہ سننے والا، دیکھنے والا ہے۔\" اور یہ بعینہٖ حقیقت (Al-Ḥaqīqah) کا قول ہے۔ پس شریعت ہی حقیقت ہے۔ حقیقت اگرچہ الوہیت کی احدیت (Al-Aḥadiyyah) عطا کرتی ہے، لیکن اس میں نسبتیں بھی عطا کرتی ہے۔ پس اس نے صرف نسبتی کثرت (Al-Kathrah) کی احدیت کو ثابت کیا ہے، نہ کہ واحد کی احدیت کو۔ کیونکہ واحد کی احدیت تو بذات خود ظاہر ہے، جبکہ کثرت کی احدیت نایاب ہے، اسے ہر صاحبِ نظر ادراک نہیں کر سکتا۔\n\nپس وہ حقیقت جو کثرت (Al-Kathrah) کی احدیت ہے، ہر کوئی اس تک نہیں پہنچ سکتا۔ اور جب انہوں نے دیکھا کہ وہ شریعت (Al-Sharī‘ah) پر خاص و عام طور پر عمل پیرا ہیں، اور یہ بھی دیکھا کہ حقیقت (Al-Ḥaqīqah) کو صرف خواص ہی جانتے ہیں، تو انہوں نے شریعت اور حقیقت میں فرق کر دیا۔ انہوں نے شریعت کو حقیقت کے ان احکام کے لیے قرار دیا جو ظاہر ہوئے، اور حقیقت کو اس کے ان احکام کے لیے قرار دیا جو باطن (Al-Bāṭin) میں ہیں۔ کیونکہ شارع (Al-Shāri‘) جو کہ حق (Al-Ḥaqq) ہے، اس نے خود کو الظاہر (ظاہر) اور الباطن (باطن) کے ناموں سے موسوم کیا ہے، اور ان دونوں ناموں کی ایک حقیقت ہے۔\n\nپس حقیقت (Al-Ḥaqīqah) بندے (Al-‘Abd) کی صفت کے پردے کے پیچھے حق (Al-Ḥaqq) کی صفت کا ظہور ہے۔ جب جہالت کا پردہ بصیرت کی آنکھ سے اٹھ جاتا ہے، تو وہ دیکھتا ہے کہ بندے کی صفت ہی ان کے نزدیک حق کی صفت کا عین ہے۔ اور ہمارے نزدیک بندے کی صفت ہی عین حق ہے، نہ کہ حق کی صفت۔ پس ظاہر (Al-Ẓāhir) خلق ہے اور باطن (Al-Bāṭin) حق ہے، اور باطن ہی ظاہر کا منبع ہے۔\n\nکیونکہ اعضاء اس چیز کے تابع اور فرمانبردار ہوتے ہیں جو نفس ان سے چاہتا ہے۔ اور نفس باطن (Al-Bāṭin) کی آنکھ ہے، جو حکم میں ظاہر ہے، جبکہ عضو حکم میں ظاہر ہے، اس کا کوئی باطن نہیں، کیونکہ اس کا کوئی حکم نہیں۔ پس کجی اور استقامت کی نسبت چلنے والے کی طرف کی جاتی ہے جس کے ذریعے چلا جاتا ہے، نہ کہ اس کی طرف جو اسے چلاتا ہے۔ اور مخلوق کو چلانے والا تو حق (Al-Ḥaqq) ہی ہے، اور اس نے ذکر کیا کہ وہ صراطِ مستقیم (سیدھے راستے) پر ہے۔\n\nپس کجی بھی حقیقت (Al-Ḥaqīqah) میں استقامت ہو سکتی ہے، جیسے کمان کی کجی۔ اس کی استقامت وہی ہے جس کے لیے اس کی کجی کا ارادہ کیا گیا تھا۔ پس عالم میں کوئی چیز نہیں مگر وہ سیدھی ہے، کیونکہ اس کی پیشانی پکڑنے والا ہی اسے چلانے والا ہے، اور وہ صراطِ مستقیم پر ہے۔ پس ہستی (Al-Wujūd) میں ہر حرکت اور سکون الٰہی ہے، کیونکہ وہ حق (Al-Ḥaqq) کے ہاتھ میں ہے اور حق سے صادر ہوتی ہے، جو صادقین کی خبر کے مطابق صراطِ مستقیم پر ہونے کی صفت سے موصوف ہے۔ کیونکہ رسول اللہ پر وہی کہتے ہیں جو وہ اس سے جانتے ہیں، پس وہ اللہ کے بارے میں مخلوق میں سب سے زیادہ جاننے والے ہیں۔\n\nاور کائنات کے لیے اس سے زیادہ قوی کوئی عذر نہیں ہے۔ پس رسولوں کی مخلوق پر رحمت میں سے یہ ہے کہ وہ مخلوق کو اس جیسی چیزوں پر متنبہ کرتے ہیں۔ اور جب حق (Al-Ḥaqq) نے ان کی بات کو ان سے نقل کیا اور ہمیں ان کا قول سنایا، تو ہم نے جانا کہ یہ اس کی ہم پر رحمت ہے کہ اس نے ہمیں اس طرح کی چیزوں سے آگاہ کیا۔ پس رسول کے ذریعے جو کچھ اس نے ہمیں بتایا، وہ اللہ کی طرف سے ہمارے لیے بشارت تھی، جیسا کہ اس کے قول میں ہے: (قرآن: سورة یونس ۱۰:۶۴) \"ان کے لیے دنیا کی زندگی میں بشارت ہے۔\" اور یہ بشارت اللہ کے کلمات میں سے تھی، اور (قرآن: سورة یونس ۱۰:۶۴) \"اللہ کے کلمات میں کوئی تبدیلی نہیں ہوتی۔\"\n\nاور حقیقت (Al-Ḥaqīqah) کے باب میں سے یہ ہے کہ وہ عین وجود (Al-Wujūd) ہے، اور وہ اس صفت سے موصوف ہے کہ اس کی صفات ہیں، اس لحاظ سے کہ موجودات صفات والی ہیں۔ پھر اس نے خبر دی کہ وہ اپنی عینیت کے اعتبار سے بندے (Al-‘Abd) کی صفات اور اس کے اعضاء کا عین ہے، چنانچہ اس نے فرمایا: \"میں اس کا کان بن جاتا ہوں\" (حدیث قدسی کا مفہوم)۔ پس اس نے سماعت کو سننے والے موجود کے عین کی طرف منسوب کیا اور اسے اپنی طرف مضاف کیا۔ اور وہاں اس کے سوا کوئی موجود نہیں، پس وہی سننے والا ہے اور وہی سماعت ہے۔ اور اسی طرح باقی تمام قوتیں اور ادراکات اس کے عین کے سوا کچھ نہیں۔ پس حقیقت (Al-Ḥaqīqah) عین شریعت (Al-Sharī‘ah) ہے۔ پس سمجھو! اور (قرآن: سورة الأحزاب ۳۳:۴) \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔\"",
    "fa": "«باب دویست و شصت و سوم در معرفت حقیقت (الحقيقة)»\n\nو آن (حقیقت) عبارت است از سلب آثار اوصاف تو از تو، به واسطه اوصاف او؛ به این معنا که او فاعل (الفاعل) در تو، به واسطه تو و از توست، نه تو. «هیچ جنبنده‌ای نیست مگر اینکه او گیرنده ناصیه (پیشانی) آن است.» (مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا)\n\n> همانا حقیقت (الحقيقة) همواره یک واحد را می‌بخشد *** و عقل با تفکر، واحد احد (الأحد) را نفی می‌کند.\n>\n> پس ذات (الذات) را دومی نیست تا آن را شفاعت کند *** و کائنات (الكون) از آثار خود، عدد را می‌طلبد.\n>\n> و همه چیز جز عین محقق شده‌ای نیست *** که در آن نه خویشاوندی است و نه پدری و نه فرزندی.\n\n### [اینکه حقیقت (الحقيقة) همان چیزی است که هستی (الوجود) بر آن است، با آنچه از اختلاف، همانندی و تقابل در آن وجود دارد]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که حقیقت (الحقيقة) همان چیزی است که هستی (الوجود) بر آن است، با آنچه از اختلاف، همانندی و تقابل در آن وجود دارد. اگر حقیقت را این‌گونه نشناسی، پس نشناخته‌ای. پس عین شریعت (الشريعة)، عین حقیقت است و شریعت حق است و هر حقی را حقیقتی است. حق شریعت، وجود عین آن است و حقیقت آن، چیزی است که در شهود (الشهود) به منزله شهود عین آن در باطن امر نازل می‌شود. پس در باطن همان‌گونه باشد که در ظاهر است، بدون هیچ افزایشی، تا زمانی که اگر پرده (الغطاء) برداشته شود، امر بر بیننده مختل نگردد.\n\nبرخی از صحابه به رسول خدا (صلی الله علیه و سلم) گفتند: «من مؤمن حقیقی هستم.» پس او ادعای حق ایمان کرد، و ایمان از صفات باطن است، زیرا تصدیق است و جایگاه تصدیق قلب است. آثار آن در جوارح (اعضا) ظاهر می‌شود، اگر تصدیقی باشد که اثری دارد. اما اگر تصدیقی باشد که اثری ندارد، ظهور آن بر جوارح لازم نیست، چنانکه فرمود: «و فرج (شرمگاه) آن را تصدیق می‌کند یا تکذیب.» پس صدق را به فرج نسبت داد، در حالی که فرج عضوی ظاهری است. رسول خدا (صلی الله علیه و سلم) به او فرمود: «پس حقیقت (الحقيقة) ایمانت چیست؟» او پاسخ داد: «گویی به عرش پروردگارم که آشکار شده است، می‌نگرم.»\n\nو رسول خدا (صلی الله علیه و سلم) در این سخن خود که عرش پروردگارش در روز قیامت آشکار می‌شود، صادق بود. پس این شنونده آن را در خیال خود به منزله وقوع مشهود قرار داد و گفت: «گویی به آن می‌نگرم»، یعنی نزد من به منزله کسی است که او را با چشم خود مشاهده می‌کنم. هنگامی که او آن را به منزله شهود بصری و وجود حسی تنزل داد، دانستیم که حقیقت (الحقيقة) حق را می‌طلبد و با آن مخالفت نمی‌کند. پس هیچ حقیقتی نیست که با شریعت (الشريعة) مخالفت کند، زیرا شریعت از جمله حقایق است و حقایق، امثال و اشباه هستند. پس شرع نفی و اثبات می‌کند و می‌گوید: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ). پس همزمان نفی و اثبات کرد، چنانکه می‌گوید: «و او شنوای بیناست» (وَهُوَ السَّمِيعُ الْبَصِيرُ). و این عیناً همان سخن حقیقت است. پس شریعت همان حقیقت است. حقیقت اگرچه احدیت (الأحدية) الوهیت را می‌بخشد، اما نسبت‌ها را در آن نیز بخشیده است. پس جز احدیت کثرت نسبی را اثبات نکرده است، نه احدیت واحد را. زیرا احدیت واحد (أحدية الواحد) به خودی خود آشکار است، اما احدیت کثرت (أحدية الكثرة) دست‌نیافتنی است و هر صاحب نظری آن را درک نمی‌کند.\n\nپس حقیقتی که همان احدیت کثرت است، برای هر کسی قابل دسترسی نیست. و چون دیدند که عموم و خصوص مردم به شریعت عمل می‌کنند و دیدند که حقیقت را جز خواص نمی‌دانند، بین شریعت و حقیقت فرق گذاشتند. پس شریعت را برای آنچه از احکام حقیقت ظاهر شده قرار دادند و حقیقت را برای آنچه از احکام آن پنهان مانده است، قرار دادند. زیرا شارع که همان حق (الحق) است، به الظاهر و الباطن نامیده شده است و این دو اسم برای او حقیقتی دارند. پس حقیقت، ظهور صفت حق (الحق) در پشت حجاب صفت عبد است. هنگامی که حجاب جهل از چشم بصیرت برداشته شود، می‌بیند که صفت عبد نزد آنان عین صفت حق است، و نزد ما صفت عبد عین حق است نه صفت حق.\n\nپس ظاهر، خلق است و باطن، حق (الحق) است، و باطن منشأ ظاهر است. زیرا جوارح (اعضا) تابع و فرمانبردار چیزی هستند که نفس (النفس) با آن‌ها می‌خواهد. و نفس در عین حال باطن است و حکم آن ظاهر است، در حالی که جارحه (عضو) حکم آن ظاهر است و باطنی ندارد، زیرا حکمی از خود ندارد. پس کجی و راستی به رونده‌ای که با او راه می‌روند نسبت داده می‌شود، نه به کسی که با آن راه رفته است. و رونده با خلق، همانا حق است و ذکر شده که او بر صراط مستقیم است. پس کجی ممکن است در حقیقت (الحقيقة) راستی باشد، مانند کجی کمان؛ پس راستی آن همان کجی است که برای آن خواسته شده است. پس در عالم جز مستقیم نیست، زیرا گیرنده ناصیه (پیشانی) آن، همان رونده با آن است و او بر صراط مستقیم است. پس هر حرکت و سکونی در هستی (الوجود)، الهی است، زیرا در دست حق است و از حقی صادر شده که به خبر صادق، موصوف به صراط مستقیم است.\n\nزیرا رسولان بر خدا جز آنچه از او می‌دانند، نمی‌گویند؛ پس آنان داناترین خلق به خدا هستند. و برای کائنات (الكون) عذری قوی‌تر از این نیست. از رحمت رسولان بر خلق، آگاه ساختن خلق به چنین امری است. و هنگامی که حق (الحق) آن را از ایشان حکایت کرد و سخنشان را به ما شناند، دانستیم که این از رحمت او بر ماست، زیرا ما را به چنین امری آگاه ساخت. پس آگاه ساختن ما به آنچه رسولش فرموده، بشارتی از جانب خدا برای ما بود، از قول او: «برای آنان در زندگی دنیا بشارت است» (لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا). و این بشارت از کلمات خدا بود و «در کلمات خدا تبدیلی نیست» (وَلَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ). و از باب حقیقت (الحقيقة) این است که او عین هستی (الوجود) است و او موصوف به صفاتی است، از آن جهت که موجودات دارای صفات هستند. سپس خبر داد که او از حیث عین خود، عین صفات و اعضای عبد است و فرمود: «گوش او بودم.» پس سمع (شنوایی) را به عین موجود شنونده نسبت داد و آن را به او اضافه کرد، در حالی که جز او موجودی نیست. پس او شنونده و سمع است. و همچنین سایر قوا و ادراکات جز عین او نیستند. پس حقیقت (الحقيقة) عین شریعت (الشريعة) است، پس بفهم. و «خدا حق را می‌گوید و او راه را می‌نمایاند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}