{
  "id": 484,
  "title": {
    "ar": "الباب الرابع والثمانون وأربعمائة في حال قطب كان منزله إِذا بَلَغَتِ الْحُلْقُومَ وأَنْتُمْ حِينَئِذٍ تَنْظُرُونَ ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ",
    "en": "Chapter Four Hundred and Eighty-Four: Concerning the spiritual state (حال) of a Pole (قطب) whose station (منزل) was [defined by the verses]: <<إِذا بَلَغَتِ الْحُلْقُومَ وأَنْتُمْ حِينَئِذٍ تَنْظُرُونَ>> (When [the soul] reaches the throat, and you are at that time looking on) and <<ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ>> (And We are nearer to him than you, but you do not perceive).",
    "ur": "باب چار سو چوراسی: ایک قطب (Quṭb) کے حال (Ḥāl) کے بیان میں جس کا منزل (Manzil) یہ تھا: \"جب وہ (روح) حلقوم (گلے) تک پہنچتی ہے، اور تم اس وقت دیکھ رہے ہوتے ہو (سورۃ الواقعہ ۵۶:۸۳-۸۴)، اور ہم اس سے تم سے زیادہ قریب ہوتے ہیں، لیکن تم نہیں دیکھتے (سورۃ الواقعہ ۵۶:۸۵)۔\"",
    "fa": "باب چهارصد و هشتاد و چهارم در بیان حال قطبی که منزل او [در مقام] «آنگاه که جان به گلوگاه رسد و شما در آن هنگام می‌نگرید و ما به او از شما نزدیک‌تریم ولی شما نمی‌بینید» [بود]."
  },
  "content": {
    "ar": "## «الباب الرابع والثمانون وأربعمائة في حال قطب كان منزله إِذا بَلَغَتِ الْحُلْقُومَ وأَنْتُمْ حِينَئِذٍ تَنْظُرُونَ ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ»\n\n\n> إذا احتضر الإنسان هيأ ذاته *** لرؤية من يلقاه وهو بعينه‏\n\n\n> فيا عجبا من غائب وهو حاضر *** وليس يراه الشخص من أجل كونه‏\n\n\n> فإن زال عن تركيبه وهو زائل *** فإن وجود الحق في ستر صونه‏\n\n\n> ومن فرط قرب الشي‏ء كان حجابه *** فلو زال ذاك القرب قام بعونه‏\n\n\n> فيشهده حالا وعينا بعينه *** وخص بهذا الوصف من أجل حينه‏\n\n\n> فسبحان من لا تشهد العين غيره *** على عزه فيما يزين وشينه‏\n\n\n> فما الشأن إلا في وجودي وكونه *** فمن بينه كانت شواهد بينه‏\n\n\n### [الحق عند العارف في العين وعند غير العارف في الأين‏]\n\n\nالبين الأول الوصل والآخر الفراق وليس إلا آخر الأنفاس فما بعده نفس خارج لأنه ليس ثم وقد خرج وفارق القلب بصورة ما كشف له فإن كان الكشف مطابقا لما كان عليه فهو السعيد وإن لم يكن مطابقا فهو بحسب ما كشفه قبل فراقه القلب لأنه هنالك يكتسب الصورة التي يخرج بها وهذه منة من الله بعبده حتى لا يقبض الله عبدا من عباده إلا كما أخرجه من بطن أمه على الفطرة فإن المحتضر ما فارق موطن الدنيا لا أنه على أهبة الرحيل رجله في غرز ركابه وهنالك ينكشف له شهودا حقيقة قوله وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ وقوله في حق طائفة وبَدا لَهُمْ من الله ما لَمْ يَكُونُوا يَحْتَسِبُونَ غير إن الذين بقيت لهم أنفاس من الحاضرين لا يبصرون معية الحق في أينية هذا العبد فإنهم في حجاب عن ذلك إلا أهل الله فإنهم يكشفون ما هو للمحتضر مشهود كما كان الأمر عندهم فإن عم بقوله لا تبصرون فإنه يريد الذوق فإن ذوق كل شاهد في مشهوده لا يكون لغيره وإن اتصف بالشهود فالحق عند العارف في العين وعند غير العارف في الأين فبرحمة من الله كان هذا الفضل من الله ولو لا الدار ما تجذب أهلها جذب المغناطيس الحديد ولو لا أهلها ما هم كأولاد أم عيسى مع الصبغ ما رموا نفوسهم فيها\n\n\nيقول النبي صَلَّى اللهُ عَليهِ وسَلَّم إنكم لتقتحمون في النار كالفراش وأنا آخذ بحجزكم‏\n\n\nفشبههم بالفراش الذي يعطيه مزاجه أن يلقي نفسه في السراج فيحترق ولكن هؤلاء الذين هم أهلها وأما من يدخلها ورودا عارضا لكونها طريقا إلى دار الجنان فهم الذين يتبرمون بها وتخرجهم شفاعة الشافعين وعناية أرحم الراحمين بعد أن تنال منهم النار ما يقتضيه أعمالهم كما إن الذين هم أهلها في أول دخولهم فيها يتألمون بها أشد الألم ويسألون الخروج منها حتى إذا انتهى الحد فيهم أقاموا فيها بالأهلية لا بالجزاء فعادت النار عليهم نعيما فلو عرضوا عند ذلك على الجنة لتالموا لذلك العرض فينقدح لهذا الذكر أعني لأهله مثل هذه المعارف الشهودية فإن ادعى أحد هذا الهجير وجاء بعلم غير مشهود له معلومه رؤية بصر فليس ذلك نتيجة هذا الذكر بل ذلك أمر آخر فلينتظر فتح هذا الذكر الخاص الذي هو هجيره حتى يمن الله عليه بالشهود البصري لا بد من ذلك فإن الموطن يقتضيه قال الله عز وجل فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ فهو يرى ما لا يرى من عنده من أهله الذين حجبهم الله تعالى عن رؤية ذلك إلى أن يأتيهم أجلهم أيضا جعلنا الله عز وجل في ذلك المقام ممن يشهد ما يسره لا ما يسوءه آمين بعزته والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "## Chapter 484: Concerning the State of a Pole whose Station is when [the soul] reaches the throat, and you are at that time looking on, and We are nearer to him than you, but you do not see\n\nWhen a human being is dying, he prepares his essence\nfor the vision of the One he meets, and He is present with his very eye.\n\nOh, wonder at the Absent One who is Present,\nyet the person does not see Him because of His very Being.\n\nIf he departs from his composition—and he is departing—\nthen the Existence of the Real (وجود الحق) is in the veil of His preservation.\n\nThe excessive proximity of a thing becomes its veil,\nbut if that proximity were removed, He would stand by His aid.\n\nSo he witnesses Him immediately and essentially with his eye,\nand he is distinguished by this description because of his moment.\n\nGlory be to the One whose Eye witnesses none other than Him,\ndespite His might in what He adorns and what He blemishes.\n\nThe matter is only in my existence and His Being,\nfor from His clarity were the signs of His clarity.\n\n### [The Real (الحق) is with the Gnostic (العارف) in the Essence (العين) and with the non-Gnostic in the Where (الأين)]\n\nThe first clarity is connection, and the last is separation. It is nothing but the last breath. What follows it is not an outgoing breath, because it is not there, and it has already departed. The soul separates from the heart in the form of what was unveiled (كشف) to it. If the Unveiling corresponds to what the person was upon, then he is the felicitous one. If it does not correspond, then it is according to what was unveiled to him before his separation from the heart, because it is there that he acquires the form by which he departs. This is a favor from Allah to His servant, so that Allah does not seize any of His servants except as He brought him forth from his mother's womb upon the primordial nature (الفطرة). The dying person has not yet departed the abode of the world; rather, he is ready for departure, his foot in the stirrup. It is there that the reality of His saying is unveiled to him through witnessing (شهود): <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are), and His saying concerning a group: <<وَبَدَا لَهُمْ مِنَ اللَّهِ مَا لَمْ يَكُونُوا يَحْتَسِبُونَ>> (And there appeared to them from Allah what they had not been expecting).\n\nHowever, those present who still have breaths remaining do not perceive the companionship of the Real (الحق) in the 'whereness' (أينية) of this servant, for they are veiled (حجاب) from that, except for the People of Allah (أهل الله). They unveil what is witnessed by the dying person, just as the matter was with them. If He generalizes by His saying, \"you do not see,\" then He intends the tasting (الذوق), for the tasting of every witness in what is witnessed by him cannot belong to another, even if that other is also characterized by witnessing. Thus, the Real is with the Gnostic (العارف) in the Essence (العين), and with the non-Gnostic in the Where (الأين). It is by the mercy of Allah that this favor came from Allah. Were it not for the Abode, it would not attract its people like a magnet attracts iron. And were it not for its people—who are like the children of the mother of Moses with the dye—they would not cast themselves into it.\n\nThe Prophet, may Allah bless him and grant him peace, said: \"Indeed, you rush into the Fire like moths, and I am holding you back by your waistbands.\"\n\nHe likened them to the moths whose nature leads them to cast themselves into the lamp and burn. But these are those who are its people. As for those who enter it by incidental arrival because it is a path to the Abode of Gardens (دار الجنان), they are the ones who are distressed by it, and the intercession of the intercessors and the care of the Most Merciful of the Merciful will bring them out, after the Fire has taken from them what their deeds necessitate. Just as those who are its people, upon their first entry into it, suffer the severest pain and ask to leave it, until, when the limit is reached for them, they reside in it by virtue of their inherent suitability (الأهلية) and not by way of recompense. Thus, the Fire turns into bliss (نعيما) for them. If they were then offered Paradise, they would be pained by that offer. Such witnessed gnosis (المعارف الشهودية) is kindled for this remembrance (الذكر)—meaning, for its people. If someone claims this state of intense heat (الهجير) and brings forth knowledge that is not witnessed, but whose object of knowledge is a vision of the eye, then that is not the result of this remembrance; rather, that is another matter. Let him await the opening of this specific remembrance which is his intense heat, until Allah favors him with visual witnessing (الشهود البصري). This is necessary, for the station demands it. Allah, the Mighty and Majestic, said: <<فَكَشَفْنَا عَنْكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ>> (Then We have removed from you your covering, and your sight, this Day, is sharp). Thus, he sees what is not seen by those near him among his family, whom Allah the Almighty has veiled from seeing that until their appointed term also comes. May Allah the Mighty and Majestic make us, in that station, among those who witness what pleases them, not what grieves them. Amen, by His Might. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو چوراسی، اس قطب کے حال کے بارے میں جس کا مقام یہ تھا: \"جب جان حلق تک پہنچ جاتی ہے اور تم اس وقت دیکھ رہے ہوتے ہو، اور ہم اس سے تم سے زیادہ قریب ہوتے ہیں، لیکن تم نہیں دیکھ سکتے۔\" (إِذا بَلَغَتِ الْحُلْقُومَ وأَنْتُمْ حِينَئِذٍ تَنْظُرُونَ ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ)\n\nجب انسان حالتِ احتضار میں ہوتا ہے تو وہ اپنی ذات کو تیار کرتا ہے،\nاس ہستی کے دیدار کے لیے جس سے وہ ملنے والا ہے، اور وہ ہستی اس کی عین ذات میں ہے۔\n\nپس تعجب ہے اس غائب پر جو حاضر ہے،\nاور شخص اسے اس کے (شدید) وجود کی وجہ سے نہیں دیکھ پاتا۔\n\nپس اگر وہ اپنی ترکیب (جسم) سے زائل ہو جائے، اور وہ زائل ہونے والا ہے،\nتو الوجود (ہستی) الحق (ذات حق) اپنے پردۂ حفاظت میں ہے۔\n\nاور شے کی حد سے زیادہ قربت ہی اس کا حجاب بن جاتی ہے،\nپس اگر وہ قربت زائل ہو جائے تو وہ اس کی مدد سے قائم ہو جائے۔\n\nپس وہ اس کا الشہود (شہود) کرتا ہے، حالاً اور عیناً اپنی آنکھ سے،\nاور وہ اپنے وقت (موت) کی وجہ سے اس وصف کے ساتھ خاص کیا جاتا ہے۔\n\nپس پاک ہے وہ ذات جس کی آنکھ اس کے سوا کسی کا الشہود (شہود) نہیں کرتی،\nاس کی عزت کے باوجود، اس میں جو زینت بخشتا ہے اور جو عیب دار کرتا ہے۔\n\nپس معاملہ صرف میرے الوجود (ہستی) اور اس کے کون (ہونے) میں ہے،\nپس اس کی وضاحت سے ہی اس کے واضح شواہد ظاہر ہوئے۔\n\n### [الحق (ذات حق) عارف کے نزدیک عین (ذات) میں ہے اور غیر عارف کے نزدیک أین (کہاں) میں ہے۔]\n\nپہلی وضاحت (البين الأول) وصل ہے اور آخری وضاحت (الآخر) فراق ہے، اور یہ آخری سانسوں کے سوا کچھ نہیں ہے۔ اس کے بعد کوئی سانس باہر نہیں نکلتی کیونکہ وہاں (اس کے لیے) کوئی جگہ نہیں ہے، اور وہ (نفس) اس صورت کے ساتھ نکل چکا ہے جو اس کے لیے الکشف (کشف) کی گئی تھی۔ پس اگر الکشف (کشف) اس کے مطابق ہو جس پر وہ تھا، تو وہ سعید (خوش بخت) ہے، اور اگر مطابق نہ ہو، تو وہ اس کے مطابق ہے جو اس نے قلب سے جدا ہونے سے پہلے الکشف (کشف) کیا، کیونکہ وہیں وہ وہ صورت حاصل کرتا ہے جس کے ساتھ وہ نکلتا ہے۔ اور یہ اللہ کی طرف سے اپنے بندے پر ایک احسان ہے، تاکہ اللہ اپنے کسی بندے کو قبض نہ کرے مگر اسی طرح جیسے اسے اس کی ماں کے پیٹ سے فطرت پر نکالا تھا۔ کیونکہ محتضر (جان کنی کی حالت میں) دنیا کے مقام سے جدا نہیں ہوا ہوتا، بلکہ وہ کوچ کی تیاری میں ہوتا ہے، اس کا پاؤں رکاب کے تسمے میں ہوتا ہے۔ اور وہیں اسے الشہود (شہود) کے ذریعے اس کے قول کی حقیقت منکشف ہوتی ہے: \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو\" (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ)، اور ایک گروہ کے حق میں اس کے قول کی حقیقت: \"اور ان کے لیے اللہ کی طرف سے وہ ظاہر ہوا جس کا وہ گمان بھی نہیں کرتے تھے\" (وَبَدا لَهُمْ مِنَ اللَّهِ ما لَمْ يَكُونُوا يَحْتَسِبُونَ)۔ سوائے اس کے کہ حاضرین میں سے جن کی سانسیں باقی ہیں، وہ اس بندے کی أینیت (کہاں ہونے) میں الحق (ذات حق) کی معیت کو نہیں دیکھ پاتے، کیونکہ وہ اس سے حجاب میں ہوتے ہیں، سوائے اہل اللہ کے۔ پس وہ اس چیز کا الکشف (کشف) کرتے ہیں جو محتضر کے لیے مشہود ہے، جیسا کہ معاملہ ان کے نزدیک تھا۔ پس اگر اللہ کا قول \"تم نہیں دیکھ سکتے\" (لا تبصرون) عام ہے، تو وہ ذوق (چکھنے) کا ارادہ کرتا ہے، کیونکہ ہر شاہد کا ذوق اس کے مشہود میں کسی دوسرے کے لیے نہیں ہوتا، اگرچہ وہ الشہود (شہود) کے وصف سے متصف ہو۔ پس الحق (ذات حق) عارف کے نزدیک عین (ذات) میں ہے اور غیر عارف کے نزدیک أین (کہاں) میں ہے۔ پس اللہ کی رحمت سے یہ فضل اللہ کی طرف سے تھا، اور اگر یہ دار (دنیا) نہ ہوتی تو وہ اپنے اہل کو یوں نہ کھینچتی جیسے مقناطیس لوہے کو کھینچتا ہے، اور اگر اس کے اہل نہ ہوتے تو وہ ام عیسیٰ کے بچوں کی طرح رنگ کے ساتھ نہ ہوتے، اور وہ اس میں اپنی جانیں نہ ڈالتے۔\n\nنبی اکرم صلی اللہ علیہ وسلم فرماتے ہیں: \"تم آگ میں اس طرح گھستے ہو جیسے پروانے، اور میں تمہاری کمریں پکڑ کر تمہیں روکتا ہوں۔\" (إنكم لتقتحمون في النار كالفراش وأنا آخذ بحجزكم)\n\nپس آپ صلی اللہ علیہ وسلم نے انہیں پروانے سے تشبیہ دی جسے اس کا مزاج یہ دیتا ہے کہ وہ خود کو چراغ میں ڈال دے اور جل جائے۔ لیکن یہ وہ لوگ ہیں جو اس (آگ) کے اہل ہیں۔ اور جو لوگ اس میں عارضی طور پر داخل ہوتے ہیں، اس لیے کہ وہ دار الجنان (جنت کے گھر) کا راستہ ہے، وہ وہ ہیں جو اس سے بیزار ہوتے ہیں، اور انہیں شفاعت کرنے والوں کی شفاعت اور ارحم الراحمین کی عنایت نکال دیتی ہے، اس کے بعد کہ آگ ان سے وہ لے لے جو ان کے اعمال کا تقاضا ہے۔ جیسا کہ وہ لوگ جو اس کے اہل ہیں، وہ اس میں اپنے پہلے داخلے پر شدید ترین تکلیف محسوس کرتے ہیں اور اس سے نکلنے کی درخواست کرتے ہیں، یہاں تک کہ جب ان میں حد پوری ہو جاتی ہے، تو وہ اس میں اہلیت کی بنا پر قیام کرتے ہیں نہ کہ جزا کی بنا پر۔ پس آگ ان کے لیے نعمت بن جاتی ہے۔ اگر اس وقت انہیں جنت پر پیش کیا جائے تو وہ اس پیشکش پر تکلیف محسوس کریں گے۔ پس اس ذکر کے لیے، یعنی اس کے اہل کے لیے، اس طرح کی المعرفۃ (معرفت) الشہودیہ (شہودی) ظاہر ہوتی ہے۔ اگر کوئی شخص اس ہجیر (شدید کوشش) کا دعویٰ کرے اور ایسا علم لائے جو اس کے لیے مشہود (دیکھا ہوا) نہ ہو، بلکہ اس کا معلوم بصری رؤیت ہو، تو یہ اس ذکر کا نتیجہ نہیں ہے، بلکہ یہ کوئی اور معاملہ ہے۔ پس اسے اس خاص ذکر کی فتح کا انتظار کرنا چاہیے جو اس کا ہجیر ہے، یہاں تک کہ اللہ اس پر بصری الشہود (شہود) کا احسان کرے۔ یہ ضروری ہے، کیونکہ یہ مقام اس کا تقاضا کرتا ہے۔ اللہ عزوجل نے فرمایا: \"پس ہم نے تجھ سے تیرا پردہ ہٹا دیا، تو آج تیری نگاہ تیز ہے\" (فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ)۔ پس وہ وہ دیکھتا ہے جو اس کے پاس موجود اس کے اہل نہیں دیکھتے، جنہیں اللہ تعالیٰ نے اس کے دیکھنے سے حجاب میں رکھا ہے، یہاں تک کہ ان کی اجل بھی آ جائے۔ اللہ عزوجل ہمیں اس مقام میں ان لوگوں میں شامل کرے جو وہ الشہود (شہود) کرتے ہیں جو انہیں خوش کرے نہ کہ جو انہیں غمگین کرے، آمین، اپنی عزت کے ساتھ۔ اور اللہ الحق (ذات حق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيل)",
    "fa": "باب چهارصد و هشتاد و چهارم در حال قطبی که منزل او [مقام او] این بود: «آنگاه که [جان] به گلوگاه می‌رسد (إِذا بَلَغَتِ الْحُلْقُومَ) و شما در آن هنگام می‌نگرید (وأَنْتُمْ حِينَئِذٍ تَنْظُرُونَ)، و ما از شما به او نزدیک‌تریم (ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ)، ولی شما نمی‌بینید (ولكِنْ لا تُبْصِرُونَ).»\n\n***\n\nچون انسان در حال احتضار قرار گیرد، ذات خود را\nبرای دیدن کسی که ملاقات می‌کند، آماده می‌سازد، در حالی که او با چشم اوست.\n\nپس شگفتا از غایبی که حاضر است،\nو شخص او را نمی‌بیند به سبب وجود و هستی‌اش.\n\nپس اگر از ترکیب خود زایل شود، در حالی که او زوال‌پذیر است،\nوجود حق (الحق) در پرده‌ی حفظ و صیانت اوست.\n\nو از شدت نزدیکی شیء، حجاب آن پدید می‌آید،\nپس اگر آن نزدیکی زایل شود، به یاری او [حق] قیام می‌کند.\n\nپس او را در حال و عین، با چشم خود مشاهده می‌کند،\nو به خاطر زمان [احتضار] خود، به این وصف اختصاص یافته است.\n\nپس منزه است کسی که چشم جز او را شهود نمی‌کند،\nبا وجود عزت او در آنچه زینت می‌دهد و آنچه عیب می‌شمارد.\n\nپس کار جز در وجود و هستی من و او نیست؛\nپس از میان او [حق]، شواهد آشکار او پدیدار گشت.\n\n***\n\n### [حق نزد عارف در عین (حضور) است و نزد غیر عارف در أین (کجا/مکان)]\n\nجدایی (البين) اول، وصل است و آخر، فراق. و این جز آخرین نفس‌ها نیست؛ پس نفسی که پس از آن خارج می‌شود، [نفس] نیست، زیرا در آنجا [در بدن] وجود ندارد و خارج شده است. و [روح] با صورتی که برایش کشف شده، از قلب جدا می‌شود. پس اگر کشف (الکشف) مطابق با آنچه [در دنیا] بر آن بوده باشد، او سعادتمند است؛ و اگر مطابق نباشد، [حال او] بر حسب چیزی است که پیش از جدایی از قلب برایش کشف شده است، زیرا در آنجا صورتی را کسب می‌کند که با آن خارج می‌شود. و این منتی است از جانب خداوند بر بنده‌اش، تا خداوند هیچ بنده‌ای از بندگانش را قبض نکند مگر همان‌گونه که او را از شکم مادرش بر فطرت خارج ساخت.\n\nهمانا محتضر هنوز از موطن دنیا جدا نشده است، بلکه در آستانه‌ی کوچ است، در حالی که پایش در رکاب قرار دارد. و در آنجا حقیقت این سخن خداوند برای او به شهود (الشهود) منکشف می‌شود: «و او با شماست هر کجا که باشید (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ)» و نیز سخن او در حق گروهی: «و از جانب خداوند برایشان چیزی آشکار شد که گمان نمی‌کردند (وَبَدا لَهُمْ مِنَ اللَّهِ ما لَمْ يَكُونُوا يَحْتَسِبُونَ)».\n\nجز اینکه کسانی از حاضران که هنوز نفس‌هایی برایشان باقی مانده است، معیت (همراهی) حق (الحق) را در «أینیت» (مکان‌مندی) این بنده نمی‌بینند، زیرا آنان در حجاب از آن هستند، مگر اهل الله؛ زیرا آنان آنچه را که برای محتضر مشهود است، کشف می‌کنند، همان‌گونه که امر نزد خودشان [اهل الله] بوده است. پس اگر [خداوند] با سخن خود «نمی‌بینید (لا تُبْصِرُونَ)» عمومیت دهد، مرادش ذوق است؛ زیرا ذوق هر شاهد در مشهودش برای دیگری نخواهد بود، حتی اگر به وصف شهود (الشهود) متصف باشد. پس حق (الحق) نزد عارف در عین (حضور/ذات) است و نزد غیر عارف در أین (مکان). پس این فضل از جانب خداوند به رحمت او بوده است. و اگر خانه [دنیا] نبود، اهلش را مانند جذب آهن توسط مغناطیس جذب نمی‌کرد. و اگر اهلش نبودند، مانند فرزندان مادر عیسی (ع) که با رنگ‌آمیزی [دنیا] همراه بودند، خود را در آن نمی‌انداختند.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «شما مانند پروانه‌ها به سوی آتش می‌شتابید، و من کمرهای شما را می‌گیرم.»\n\nپس ایشان را به پروانه‌ای تشبیه کرد که طبعش او را وامی‌دارد تا خود را در چراغ بیندازد و بسوزد. اما اینان کسانی هستند که اهل آتش‌اند. اما کسی که به صورت ورود عارضی وارد آن می‌شود، به دلیل اینکه [آتش] راهی به سوی سرای بهشت است، آنان کسانی هستند که از آن بیزارند و شفاعت شفاعت‌کنندگان و عنایت ارحم الراحمین آنان را خارج می‌سازد، پس از آنکه آتش به اندازه‌ی اقتضای اعمالشان از آنان بهره گیرد. همان‌گونه که کسانی که اهل آتش‌اند، در ابتدای ورودشان به آن، سخت‌ترین درد را می‌کشند و درخواست خروج از آن را دارند، تا زمانی که حد [عذاب] در موردشان به پایان رسد. آنگاه به سبب اهلیت [و سازگاری] در آن اقامت می‌کنند، نه به سبب جزا؛ پس آتش بر آنان به نعمت تبدیل می‌شود. اگر در آن هنگام بر بهشت عرضه شوند، از این عرضه متألم خواهند شد.\n\nپس برای این ذکر، یعنی برای اهل آن، چنین معارف شهودی (الشهود) شعله‌ور می‌شود. اگر کسی ادعای این هجیر [مقام] را کند و علمی بیاورد که برایش مشهود (الشهود) نیست، بلکه معلوم او رؤیت بصری است، این نتیجه‌ی این ذکر نیست، بلکه امری دیگر است. پس باید منتظر گشایش این ذکر خاص که هجیر اوست بماند تا خداوند با شهود بصری بر او منت نهد. این امر ضروری است، زیرا موطن [احتضار] آن را اقتضا می‌کند. خداوند عز و جل می‌فرماید: «ما پرده را از تو برداشتیم، پس امروز دیده‌ات تیزبین است (فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ)». پس او [محتضر] چیزی را می‌بیند که اطرافیانش از اهل او نمی‌بینند؛ کسانی که خداوند آنان را از دیدن آن محجوب داشته است تا زمانی که اجلشان نیز فرا رسد. خداوند عز و جل ما را در آن مقام از کسانی قرار دهد که آنچه او را شاد می‌کند، شهود کند، نه آنچه او را ناخوش می‌سازد. آمین به عزت او. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيل)."
  },
  "page_count": 1
}