{
  "id": 319,
  "title": {
    "ar": "الباب التاسع عشر وثلاثمائة في معرفة تنزل سراح النفس عن قيد وجه ما من وجوه الشريعة بوجه آخر منها",
    "en": "Chapter Three Hundred and Nineteen: Concerning the Knowledge of the Unfolding of the Soul's Release from the Restriction of One Aspect of the Divine Law by Means of Another Aspect Thereof.",
    "ur": "باب تین سو انیس: نفس کی رہائی کے اس تنزل (تنزل) کی معرفت میں جو شریعت کے کسی ایک پہلو کی قید سے اس کے کسی دوسرے پہلو کے ذریعے واقع ہوتا ہے۔",
    "fa": "باب سیصد و نوزدهم در معرفت تنزل رهایی نفس از قید وجهی از وجوه شریعت به وجهی دیگر از آن"
  },
  "content": {
    "ar": "## «الباب التاسع عشر وثلاثمائة في معرفة تنزل سراح النفس عن قيد وجه ما من وجوه الشريعة بوجه آخر منها»\n\n\nوأن ترك السبب الجالب للرزق من طريق التوكل سبب جالب للرزق وأن المتصف به ما خرج عن رق الأسباب ومن جلس مع الله من كونه رزاقا فهو معلول‏\n\n\n> لله بين السماء والأرض تنزيل *** من أمره فيه تبديل وتحويل‏\n\n\n> ينحط من صور في طيها صور *** يمحو بها صورا لهن تمثيل‏\n\n\n> وصورة الحق فيه إن يكون على *** ما الحق فيه وإن لم فهو تضليل‏\n\n\n> الهو يصاحب مجلى الحق في صور *** وهو الصحيح الذي ما فيه تعليل‏\n\n\n> هذا مقام ابن عباس وحالتنا *** وقد أتى فيه قرآن وتنزيل‏\n\n\n> فلا تغرنك حال لست تعرفها *** فإنها لك تسبيح وتهليل‏\n\n\n> وقل بها والتزامها إنها سند *** أقوى يؤيده شرع ومعقول‏\n\n\n> تقضي به صحف مثلي مطهرة *** منها زبور وتوراة وإنجيل‏\n\n\n> فاشهد هديت علوما عز مدركها *** على العقول فوجه الحق مقبول‏\n\n\n> يحار عقلك فيها إن يكيفها *** فإنه تحت قهر الحس مغلول‏\n\n\n> فالحس أفضل ما تعطاه من منح *** وصاحب الفكر منصور ومخذول‏\n\n\n### [أن من كانت حقيقته مقيدا لا يصح أن يكون مطلقا]\n\n\nاعلم وفقك الله أيها الولي الحميم تولاك الله برحمته وفتح عين فهمك إنه من كانت حقيقته أن يكون مقيدا لا يصح أن يكون مطلقا بوجه من الوجوه ما دامت عينه فإن التقييد صفة نفسية له ومن كانت حقيقته أن يكون مطلقا فلا يقبل التقييد جملة واحدة فإنه صفته النفسية أن يكون مطلقا لكن ليس في قوة المقيد أن يقبل الإطلاق لأن صفته العجز وأن يستصحبه الحفظ الإلهي لبقاء عينه فالافتقار يلزمه وللمطلق أن يقيد نفسه إن شاء وأن لا يقيدها إن شاء فإن ذلك من صفة كونه مطلقا إطلاق مشيئة ومن هنا أوجب الحق على نفسه ودخل تحت العهد لعبده فقال في الوجوب كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ أي أوجب فهو الموجب على نفسه ما أوجب غيره عليه ذلك فيكون مقيدا بغيره فقيد نفسه لعبيده رحمة بهم ولطفا خفيا وقال في العهد وأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ فكلفهم وكلف نفسه لما قام الدليل عندهم بصدقه في قيله ذكر لهم ذلك تأنيسا لهم سبحانه وتعالى ولكن هذا كله أعني دخوله في التقييد لعباده من كونه إلها لا من كونه ذاتا فإن الذات غنية عن العالمين والملك ما هو غني عن الملك إذ لو لا الملك ما صح اسم الملك فالمرتبة أعطت التقييد لا ذات الحق جل وتعالى فالمخلوق كما يطلب الخالق من كونه مخلوقا كذلك الخالق يطلب المخلوق من كونه خالقا أ لا ترى العالم لما كان له العدم من نفسه لم يطلب الخالق ولا المعدم فإن العدم له من ذاته وإنما طلب الخالق من كونه مخلوقا فمن هنا قيد نفسه تعالى بما أوجب على نفسه من الوفاء بالعهد ولما كان المخلوق بهذه المثابة لذلك تعشق بالأسباب ولم يتمكن له إلا الميل إليها طبعا فإنه موجود عن سبب وهو الله تعالى ولهذا أيضا وضع الحق الأسباب في العالم لأنه سبحانه علم أنه لا يصح اسم الخالق وجودا وتقديرا إلا بالمخلوق وجود أو تقدير أو كذلك كل اسم إلهي يطلب الكون مثل الغفور والمالك والشكور والرحيم وغير ذلك من الأسماء فمن هنا وضع الأسباب وظهر العالم مربوطا بعضه ببعضه فلم تنبت سنبلة إلا عن زارع وأرض ومطر وأمر بالاستسقاء إذا عدم المطر تثبيتا منه في قلوب عباده لوجود الأسباب ولهذا لم يكلف عباده قط الخروج عن السبب‏\nفإنه لا تقتضيه حقيقته وإنما عين له سببا دون سبب فقال له أنا سببك فعلي فاعتمد وتوكل كما ورد وعَلَى الله فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ فالرجل من أثبت الأسباب فإنه لو نفاها ما عرف الله ولا عرف نفسه وقال صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nولم يقل عرف ذات ربه فإن ذات الرب لها الغني على الإطلاق وأنى للمقيد بمعرفة المطلق والرب يطلب المربوب بلا شك ففيه رائحة التقييد فبهذا عرف المخلوق ربه ولذلك أمره أن يعلم أنه لا إله إلا هو من كونه إلها لأن الإله يطلب المألوه وذات الحق غنية عن الإضافة فلا تتقيد فإثبات الأسباب أدل دليل على معرفة المثبت لها بربه ومن رفعها رفع ما لا يصح رفعه وإنما ينبغي له أن يقف مع السبب الأول وهو الذي خلق هذه الأسباب ونصبها ومن لا علم له بما أشرنا إليه لا يعلم كيف يسلك الطريق إلى معرفة ربه بالأدب الإلهي فإن رافع الأسباب سيئ الأدب مع الله ومن عزل من ولاة الله فقد أساء الأدب وكذب في عزل ذلك الوالي فانظر ما أجهل من كفر بالأسباب وقال بتركها ومن ترك ما قرره الحق فهو منازع لا عبد وجاهل لا عالم وإني أعظك يا ولي أن تكون من الجاهلين الغافلين وأراك في الحين تكذب نفسك في ترك الأسباب فإني أراك في وقت حديثك معي في ترك الأسباب ورميها وعدم الالتفات إليها والقول بترك استعمالها يأخذك العطش فتترك كلامي وتجري إلى الماء فتشرب منه لتدفع بذلك ألم العطش وكذلك إذا جعت تناولت الخبز فأكلت وغايتك إن لا تتناوله بيدك حتى يجعل في فمك فإذا حصل في فمك مضغته وابتلعته فما أسرع ما أكذبت نفسك بين يدي وكذلك إذا أردت أن تنظر افتقرت إلى فتح عينك فهل فتحتها إلا بسبب وإذا أردت زيارة صديق لك سعيت إليه والسعي سبب في وصولك إليه فكيف تنفي الأسباب بالأسباب أ ترضى لنفسك بهذه الجهالة فالأديب الإلهي العالم من أثبت ما أثبته الله في الموضع الذي أثبته الله وعلى الوجه الذي أثبته الله ومن نفى ما نفاه الله في الموضع الذي نفاه الله وعلى الوجه الذي نفاه الله ثم تكذب نفسك إن كنت صالحا في عبادتك ربك أ ليست عبادتك سببا في سعادتك وأنت تقول بترك الأسباب فلم لا تقطع العمل فما رأيت أحدا من رسول ولا نبي ولا ولي ولا مؤمن ولا كافر ولا شقي ولا سعيد خرج قط عن رق الأسباب مطلقا أدناها التنفس فيا تارك السبب لا تتنفس فإن التنفس سبب حياتك فأمسك نفسك حتى تموت فتكون قاتل نفسك فتحرم عليك الجنة وإذا فعلت هذا فأنت تحت حكم السبب فإن ترك التنفس سبب لموتك وموتك على هذه الصورة سبب في شقائك فما برحت من السبب فما أظنك عاقلا إن كنت تزعم أن ترفع ما نصبه الله وأقامه علما مشهودا ودع عنك ما تسمع من كلام أهل الله تعالى فإنهم لم يريدوا بذلك ما توهمته بل جهلت ما أرادوه بقطع الأسباب كما جهلت ما أراده الحق بوضع الأسباب وقد ألقيت بك على مدرجة الحق وأبنت لك الطريقة التي وضعها الله لعباده وأمرهم بالمشي عليها فاسلك وعَلَى الله قَصْدُ السَّبِيلِ ... ولَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ وبعد هذا\n\n\n### [إن العبد تارة يقيمه الحق في معصيته وتارة يقيمه في طاعته‏]\n\n\nفاعلم إن العبد تارة يقيمه الحق في معصيته وتارة يقيمه في طاعته فأنا أبين لك من أين وقع للعبد هذا القبول للأمرين ونبين لك رتبة الإنسان من العالم وإن الإنسان له أمثال من جنسه والعالم بجملته ليس له مثل وما يتعلق بهذه المسألة من الحقائق والأسرار بعد أن نجمع معاني ما أريد تفصيلها في نظم يكون لك كالأم الجامعة المختصرة الضابطة لرءوس المسائل حتى إذا أردت أن تبسطها لغيرك نبهك هذا النظم على عيونها فقلنا في ذلك نكني عن العبد\n\n\n> إذا عصى الله قد وفى حقيقته *** وإن أطاع فقد وفى طريقته‏\n\n\n> لو لا القبول لما كان الوجود له *** والخلق يطلب بالمعنى خليقته‏\n\n\n> إن المحال دليل إن نظرت فلا *** تعدل به حجة فاعلم حقيقته‏\n\n\n> لا يقبل الكون والإمكان يقبله *** فكل أمر فقد وفى سليقته‏\n\n\n> لذاك فزنا من الأعلى بصورته *** عناية منه أعطاها خليقته‏\n\n\n> لو كان للكون مثل عق تكرمة *** له ليطعمه جودا عقيقته‏\n\n\n> لكنه مفرد والحق ليس له *** عين التغذي فما أعطاه صورته‏\n\n\n### [أن العالم كان ممكنا ولم يكن محالا قبل حاله الوجود]\n\n\nاعلم وفقك الله أيها الولي الحميم أن العالم لما كان ممكنا ولم يكن محالا قبل حاله الوجود والمحال لا يقبل الوجود فخالفت‏\nحقيقة الممكن بقبولها للوجود حقيقة المحال الذي لا يقبله ولما أوجد الله العالم إنسانا كبيرا وجعل آدم وبنيه مختصر هذا العالم ولهذا أعطاه الأسماء كلها أي كل الأسماء المتوجهة على إيجاد العالم وهي الأسماء الإلهية التي يطلبها العالم بذاته إذ كان وجوده عنها\n\n\nفقال صَلَّى اللهُ عَليهِ وسَلَّم إن الله خلق آدم على صورته‏\n\n\nإذ كانت الأسماء له وعنها وجد العالم فالعالم بجملته إنسان كبير ولما كرمه الله بالصورة طلب العالم والأمثال الشكر من الإنسان على ذلك فكانت العقيقة التي جعل الله على كل إنسان شكرا لما خصه به من الوجود على هذه الحالة وجعلها في سابعه إذ كان على حالة لا تقبل التغذي منها لئلا يكون قد سعى لنفسه فأكلها الأمثال وكل إنسان مرهون بعقيقته وينبغي له إذا عق عن نفسه في كبره إن لا يأكل منها شيئا ويطعمها الناس ولذلك لم يعق العالم بجملته عن نفسه وإن كان على الصورة لأنه ما ثم من يأكل عقيقته فإنه ما ثم إلا الله والعالم والمعق عنه لا يأكل منها والحق يتنزه عن الغذاء والأكل وليست هذه المنزلة إلا لله فكانت عقيقة العالم تعود عبثا فجعل سبحانه بدلا من هذا الشكر الذي هو العقيقة التسبيح بحمده شكرا على ما أولاه من وجوده على صورته فقال وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ولكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كانَ حَلِيماً غَفُوراً فبعنايته الأزلية بنا أعطانا الوجود على الصورة ولم يعطنا السورة التي هي منزلته فإن منزلته الربوبية ومنزلتنا المربوبية ولذلك قلنا إن العالم لا يعق عن نفسه ينسك فإنه لا يأكله والحق لا يكون له ذلك ولا ينبغي له فكانت عقيقته التسبيح بحمده لأن التسبيح ينبغي له ولما كانت طبيعة الممكن قبلت الوجود فظهر في عينه بعد أن لم يكن سماه خلقا مشتقا من الخليقة وهي طبيعة الأمر وحقيقته أي مطبوعا على الصورة وهي خليقته ولما أوجده الله على صورته وأوجده لعبادته فكان ما أوجده عليه خلاف ما أوجده له فقال وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ ما أُرِيدُ مِنْهُمْ من رِزْقٍ وما أُرِيدُ أَنْ يُطْعِمُونِ وهو ما أشرنا إليه في العقيقة أنه سبحانه لا ينبغي له أن يطعم فاشترك الجن مع الإنس فيما وجد له لا فيما وجد عليه ولما كانت صورة الحق تعطي أن لا تكون مأمورة ولا منهية لعزتها سرت هذه العزة في الإنسان طبعا فعصى ظاهرا وباطنا من حيث صورته لأنه على صورة من لا يقبل الأمر والنهي والجبر أ لا ترى إبليس لما لم يكن على الصورة لم يعص باطنا فيقول لِلْإِنْسانِ اكْفُرْ فإذا كفر يقول إبليس إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ وما استكبر إلا ظاهرا على آدم فقال أَ أَسْجُدُ لِمَنْ خَلَقْتَ طِيناً وقال أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي من نارٍ والنار أقرب في الإضاءة النورية إلى النور والنور اسم من أسماء الله والطين ظلمة محضة فقال أَنَا خَيْرٌ مِنْهُ أي أقرب إليك من هذا الذي خَلَقْتَهُ من طِينٍ وجهل إبليس ما فطر الله آدم عليه في إن تولى خلقه بيديه كما لا للصورة الإلهية التي خلق عليها ولم يكن عند إبليس ولا الملائكة من ذلك ذوق فاعترض الكل الملائكة بما قالت وإبليس بما قال فمعصية الإنسان بما خلق عليه وطاعته بما خلق له قال تعالى وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ أي يتذللوا لعزتي ويعرفوا منزلتي من منزلتهم فطريقة الإنسان العبادة فإنه عبد والعبد مقيد بسيده كما إن السيد مقيد بوجه بعبده فإنه المسود والله غَنِيٌّ عَنِ الْعالَمِينَ فلم يلحق الممكن بدرجة المحال فزها عليه بقبوله الوجود الذي هو صفة إلهية ولم يلحق بدرجة الوجود المطلق لأن وجوده مستفاد مقيد فإذا نظر إلى المحال ودرجته وما حصل له من ربه من الوجود ونظر في نفسه قبوله وامتيازه من المحال أدركه الكبرياء فعصى وقال أَنَا رَبُّكُمُ الْأَعْلى‏ وادعى الألوهة وما ادعاها أحد من الجن وإذا نظر إلى افتقاره إلى واجب الوجود واستفادته الوجود منه ومنته به عليه وجب الشكر عليه فذل وأطاع ربه فطاعته من وجه ما خلق له ومعصيته من وجه ما خلق عليه وشهوده المحال الذي ليس له هذه المرتبة فلو لم يكن المحال رتبة ثالثة ما وجد الممكن على من يزهو فإن الشي‏ء لا يزهو على نفسه والمفتقر لا يزهو على المفتقر إليه فلم يكن يتصور أن تقع معصية من الممكن فانظر ما أعجب ما تعطيه الحقائق من الآثار والحمد لله على إن علمنا ما لم نكن نعلم وفهمنا ما لم نكن نفهم وكان فضل الله علينا عظيما وهذا القدر كاف في هذا الباب ويحتوي هذا المنزل على‏\n\n\nعلم الدعاء وعلم النبوة وعلم خطاب الكل في عين الواحد وعلم الزمان وعلم التقوى وعلم التعدي وعلم البرهان وتركيبه وعلم مكارم الأخلاق وعلم منزلة نفس الإنسان عند الله من غيره وعلم العجز وعلم الايمان وعلم الأنفاس وعلم التوكل وعلم الغيب وعلم الميزان وعلم التقديس وعلم حضرة الشكوك وعلم من تقدس بعد الخبث وعلم التكوين‏\nوعلم التعليم وعلم الحياة الآخرة وعلم الإجارة من غيره وعلم الرحمة وعلم الشدة وعلم الربح والخسران وعلم مدارك العقول وعلم نهاية المطلب وعلم الأمر الإلهي وعلم العالم وعلم الاقتدار الإلهي وعلم الإحاطة وهل ينتهي علم الله في العالم أم لا وما رأيت قائلا به إلا شخصا واحدا بمكة كان يرى هذا الرأي وهو مذهب معروف لكني ما كنت رأيت قائلا به فإنه ما من مذهب إلا وقد رأيت قائلا به فالله يسلك بنا سواء السبيل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Nineteen: Concerning the Knowledge of the Descent of the Soul’s Release from the Bond of One Aspect of the Law (Shari’a) by Means of Another Aspect Thereof\n\nAnd that abandoning the means (السبب) that brings provision, through the path of reliance (*al-tawakkul*), is itself a means (سبب) that brings provision. And that the one characterized by this has not departed from the servitude of means (*al-asbab*). And whoever sits with Allah based on His being the Provider (*al-Razzaq*) is still conditioned (معلول).\n\n> For Allah, between the heaven and the earth, is a descent (تنزيل)\n> From His command, in which there is change (تبديل) and transformation (تحويل).\n\n> It descends from forms (صور) within which are folded other forms\n> By which He effaces forms that have representation (تمثيل).\n\n> And the form (صورة) of the Real (الحق) in it is that it should be upon\n> What the Real is upon; otherwise, it is misguidance (تضليل).\n\n> The ‘He-ness’ (*al-Huwa*) accompanies the Theophany (مجلى الحق) in forms,\n> And that is the sound truth (الصحيح) in which there is no conditioning (تعليل).\n\n> This is the station (مقام) of Ibn Abbas and our state (حالتنا),\n> And concerning it, the Quran and revelation (تنزيل) have come.\n\n> So let no state (حال) deceive you that you do not know,\n> For it is glorification (*tasbih*) and magnification (*tahlil*) for you.\n\n> Affirm it and adhere to it, for it is a stronger support (سند)\n> Which is confirmed by the Law (شرع) and the intellect (معقول).\n\n> By it are judged purified scriptures like mine,\n> Among them the Psalms (*Zabur*), the Torah (*Tawrat*), and the Gospel (*Injil*).\n\n> So witness, may you be guided, sciences whose comprehension is difficult\n> For the intellects, for the face of the Real (وجه الحق) is acceptable.\n\n> Your intellect will be bewildered by them if it tries to qualify them,\n> For it is bound and shackled beneath the compulsion of the sense (الحس).\n\n> For the sense is the best of the grants you are given,\n> And the man of intellect (صاحب الفكر) is sometimes victorious and sometimes abandoned.\n\n### [That whoever whose reality is restricted cannot be unrestricted]\n\nKnow, may Allah grant you success, O intimate friend (*al-wali al-hamim*), may Allah take charge of you with His mercy and open the eye of your understanding: that whoever whose reality (حقيقته) is to be restricted (مقيدا) cannot be unrestricted (مطلقا) in any way, as long as his essence (*ayn*) remains, for restriction (*al-taqyid*) is an essential attribute (صفة نفسية) for him. And whoever whose reality is to be unrestricted (*mutlaqan*) does not accept restriction at all, for his essential attribute is to be unrestricted. However, it is not within the power of the restricted to accept the unrestricted state, because his attribute is incapacity (*al-ajz*), and he is accompanied by Divine Preservation (الحفظ الإلهي) for the persistence of his essence. Thus, need (*al-iftiqar*) is incumbent upon him.\n\nAs for the Unrestricted, He may restrict Himself if He wills, or not restrict Himself if He wills, for that is an attribute of His being unrestricted by the absoluteness of Will (إطلاق مشيئة). It is from this perspective that the Real (الحق) made obligation upon Himself and entered into a covenant with His servant. Thus, concerning obligation, He said: <<كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ>> (Your Lord has prescribed mercy upon Himself), meaning He made it obligatory. Thus, He is the One Who obligates upon Himself what no other has obligated upon Him, lest He be restricted by another. So, He restricted Himself for His servants out of mercy for them and subtle kindness. And concerning the covenant, He said: <<وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ>> (Fulfill My covenant, and I will fulfill your covenant). Thus, He imposed duties upon them and imposed duties upon Himself, because the proof of His truthfulness in His saying was established for them. He mentioned this to them for the sake of familiarity, exalted is He.\n\nBut all of this—I mean His entering into restriction for His servants—stems from His being God (*Ilah*), not from His being the Essence (*al-Dhat*), for the Essence is independent of the worlds (غنية عن العالمين). The King is not independent of the kingdom, for were it not for the kingdom, the Name ‘King’ would not be valid. Thus, the rank (المرتبة) necessitated the restriction, not the Essence of the Real, exalted is He.\n\nJust as the creature seeks the Creator by virtue of its being a creature, so too does the Creator seek the creature by virtue of His being the Creator. Do you not see that when the world had non-existence from itself, it did not seek the Creator or the Annihilator? For non-existence belongs to it by its own essence. It only sought the Creator by virtue of its being created.\n\nIt is from this perspective that He, exalted is He, restricted Himself by what He obligated upon Himself concerning the fulfillment of the covenant. And since the creature is of this nature, it is naturally attached to the means (*al-asbab*), and it is impossible for it not to incline toward them naturally, for it exists through a means, which is Allah, exalted is He.\n\nFor this reason, the Real also established the means in the world, because He, glorified is He, knew that the Name ‘Creator’ (*al-Khaliq*) is not valid, whether in existence or in estimation, except through the creature, whether in existence or in estimation. Likewise, every Divine Name requires the cosmos (الكون), such as the Forgiving (*al-Ghafur*), the Owner (*al-Malik*), the Appreciative (*al-Shakur*), the Merciful (*al-Rahim*), and other Names.\n\nIt is from this perspective that He established the means, and the world appeared interconnected, one part bound to another. A stalk of grain does not grow except through a sower, land, and rain. And He commanded seeking rain when it was absent, as a confirmation in the hearts of His servants of the existence of means. For this reason, He never commanded His servants to depart from the means, for their reality does not necessitate it. Rather, He appointed one means for them instead of another, saying to them: “I am your means, so rely upon Me and trust in Me,” as it is reported: <<وَعَلَى الله فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ>> (And upon Allah rely, if you are believers).\n\nThe true man is he who affirms the means, for if he negated them, he would not know Allah nor know himself. The Prophet, peace and blessings be upon him, said: “Whoever knows himself knows his Lord.”\n\nHe did not say, “knows the Essence (*Dhat*) of his Lord,” for the Essence of the Lord possesses absolute independence (*al-ghina ‘ala al-itlaq*). How can the restricted know the unrestricted? The Lord (*al-Rabb*) undoubtedly requires the object of Lordship (*al-marbub*), so there is a scent of restriction in Him. It is by this that the creature knows its Lord. Therefore, He commanded him to know that there is no god but He, by virtue of His being God (*Ilah*), because the God requires the object of worship (*al-ma’luh*), whereas the Essence of the Real is independent of any relation and is not restricted.\n\nThus, the affirmation of means is the clearest proof of the one who affirms them knowing his Lord. And whoever rejects them rejects what cannot rightly be rejected. Rather, he should stand with the First Cause, which is the One Who created these means and established them.\n\nWhoever lacks knowledge of what we have indicated will not know how to traverse the path to the knowledge of his Lord with Divine proper conduct (*al-adab al-ilahi*). For the one who rejects the means is ill-mannered toward Allah. And whoever dismisses one of Allah’s governors has behaved badly and lied in dismissing that governor.\n\nLook at the ignorance of the one who disbelieves in the means and advocates abandoning them! Whoever abandons what the Real has established is a disputant, not a servant, and ignorant, not knowing. I admonish you, O friend, not to be among the ignorant and heedless.\n\nI see you, at times, contradicting yourself regarding the abandonment of means. For I see you, while speaking to me about abandoning means, casting them aside, and not paying attention to them, and advocating their non-use—thirst overtakes you, so you abandon my speech and rush to the water, drinking from it to repel the pain of thirst. Likewise, when you are hungry, you take bread and eat. Your utmost effort is perhaps not to take it with your hand until it is placed in your mouth, but once it is in your mouth, you chew and swallow it. How quickly you contradict yourself in my presence!\n\nLikewise, if you wish to look, you are in need of opening your eyes. Did you open them except by a means? And if you wish to visit a friend, you walk toward him, and walking is the means to reaching him. How can you negate means by means? Do you accept this ignorance for yourself?\n\nThe Divinely well-mannered scholar is he who affirms what Allah affirmed, in the place where Allah affirmed it, and in the manner in which Allah affirmed it. And he who negates what Allah negated, in the place where Allah negated it, and in the manner in which Allah negated it.\n\nThen, you contradict yourself if you are righteous in your worship of your Lord. Is not your worship a means to your happiness? Yet you speak of abandoning means. Why then do you not cease action?\n\nI have never seen anyone—neither Messenger, nor Prophet, nor friend (*wali*), nor believer, nor disbeliever, nor wretched, nor happy—who ever departed absolutely from the servitude of means. The least of them is breathing. O abandoner of means, do not breathe! For breathing is the means of your life. Hold your breath until you die, and thus you will be your own killer, and Paradise will be forbidden to you. If you do this, you are still under the rule of means, for stopping breathing is the means to your death, and your death in this manner is the means to your wretchedness. Thus, you have not departed from the means.\n\nI do not think you are rational if you claim to reject what Allah has established and set up as a visible sign. Leave aside what you hear from the speech of the People of Allah, exalted is He, for they did not intend by it what you imagined. Rather, you were ignorant of what they intended by cutting off means, just as you were ignorant of what the Real intended by establishing means. I have placed you upon the path of the Real and clarified for you the way that Allah established for His servants and commanded them to walk upon. So traverse it, <<وَعَلَى الله قَصْدُ السَّبِيلِ>> (And upon Allah is the direction of the way) ... <<وَلَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ>> (And had He willed, He would have guided you all). After this:\n\n### [That the servant is sometimes established by the Real in his disobedience and sometimes established in his obedience]\n\nKnow that the servant is sometimes established by the Real (الحق) in his disobedience and sometimes established in his obedience. I shall explain to you whence the servant acquired this acceptance of both matters, and we shall clarify the rank of the human in relation to the world, and that the human has analogues of his own kind, while the world in its entirety has no analogue. We will also discuss the realities and secrets related to this issue, after we summarize the meanings I wish to detail in a poem that will serve you as a comprehensive, concise summary, controlling the main points of the issues, so that if you wish to elaborate on them for others, this poem will alert you to their core ideas. So we said concerning this, using the servant as a metaphor:\n\n> If he disobeys Allah, he has fulfilled his reality (حقيقته),\n> And if he obeys, he has fulfilled his path (طريقته).\n\n> Were it not for acceptance, existence (الوجود) would not be his,\n> And creation (الخلق) seeks its inherent nature (خليقته) by meaning.\n\n> Indeed, the impossible (*al-muhal*) is a proof if you look, so do not\n> Deviate from it as an argument; know its reality.\n\n> The cosmos (الكون) does not accept it [the impossible], but contingency (الإمكان) accepts it,\n> Thus, every matter has fulfilled its innate disposition (سليقته).\n\n> Therefore, we triumphed from the Highest with His form (صورته),\n> A favor from Him that He granted to His creation (خليقته).\n\n> If the cosmos had an analogue, it would be honored\n> For it, so that He might feed it its *Aqiqah* (sacrifice) out of generosity.\n\n> But it is singular, and the Real does not have\n> The essence of nourishment, so He did not grant it its form.\n\n### [That the world was contingent and not impossible before its state of existence]\n\nKnow, may Allah grant you success, O intimate friend, that when the world (*al-alam*) was contingent (*mumkinan*) and not impossible (*muhalan*) before its state of existence—and the impossible does not accept existence—the reality of the contingent, by accepting existence, contradicted the reality of the impossible, which does not accept it.\n\nWhen Allah brought the world into existence as a Great Human (إنسانا كبيرا), He made Adam and his children the summary (مختصر) of this world. For this reason, He gave him all the Names—that is, all the Divine Names (الأسماء الإلهية) directed toward the creation of the world, which the world seeks by its essence, since its existence came from them.\n\nThe Prophet, peace and blessings be upon him, said: “Indeed, Allah created Adam upon His image (صورته).”\n\nSince the Names belonged to him, and the world came into existence through them, the world in its entirety is a Great Human. When Allah honored him with the Image (الصورة), the world and its analogues (الأمثال) demanded thanks from the human for that. This was the *Aqiqah* (sacrifice) that Allah established for every human as thanks for the existence He specifically granted him in this state. He established it on the seventh day, as the infant was in a state that did not accept nourishment from it, lest he seek reward for himself. So the analogues ate it. Every human is pledged by his *Aqiqah*, and if he performs the sacrifice for himself in adulthood, he should not eat any of it but feed it to others.\n\nFor this reason, the world in its entirety did not perform the *Aqiqah* for itself, even though it is upon the Image, because there is no one there to eat its sacrifice, for there is only Allah and the world, and the one for whom the sacrifice is made does not eat from it, and the Real is transcendent from nourishment and eating. This station belongs only to Allah. Thus, the *Aqiqah* of the world would return as futility.\n\nSo, instead of this thanksgiving, which is the *Aqiqah*, He, glorified is He, established the glorification (*tasbih*) of Him with His praise, as thanks for the existence He bestowed upon it upon His Image. He said: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيمًا غَفُورًا>> (And there is not a thing except that it glorifies [Him] with His praise, but you do not understand their glorification. Indeed, He is ever Clement, Forgiving).\n\nBy His eternal providence toward us, He granted us existence upon the Image (الصورة), but He did not grant us the inner reality (*al-sura*) which is His station, for His station is Lordship (*al-Rububiyya*), and our station is being the object of Lordship (*al-Marbubiyya*). That is why we said that the world does not perform the *Aqiqah* for itself as a ritual sacrifice, for it does not eat it, and the Real does not have that, nor is it fitting for Him. Thus, its *Aqiqah* was the glorification with His praise, because glorification is fitting for it.\n\nSince the nature of the contingent accepted existence, it appeared in its essence after having been non-existent. He named it creation (*khalq*), derived from inherent nature (*khaliqa*), which is the nature and reality of the matter—meaning, stamped upon the Image, which is its inherent nature.\n\nWhen Allah brought him into existence upon His Image, He brought him into existence for His worship. Thus, what He created him *upon* was contrary to what He created him *for*. He said: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ * مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ>> (And I did not create the jinn and mankind except to worship Me. I do not desire from them any provision, nor do I desire that they feed Me). This confirms what we indicated regarding the *Aqiqah*: that it is not fitting for Him, glorified is He, to be fed. Thus, the jinn share with mankind in what they were created *for*, not in what they were created *upon*.\n\nSince the form of the Real (صورة الحق) dictates that it is not commanded or prohibited due to its sovereignty (*izza*), this sovereignty naturally permeated the human. Thus, he disobeys outwardly and inwardly, by virtue of his image, because he is upon the image of One Who does not accept command, prohibition, or compulsion.\n\nDo you not see that Iblis, since he was not upon the Image, did not disobey inwardly? He says to man, “Disbelieve!” but when man disbelieves, Iblis says: <<إِنِّي أَخَافُ الله رَبَّ الْعَالَمِينَ>> (Indeed, I fear Allah, Lord of the worlds). He only showed outward arrogance toward Adam, saying: <<أَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا>> (Shall I prostrate to one You created from clay?) and <<أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ>> (I am better than him; You created me from fire). Fire is closer in luminous illumination to Light (*al-Nur*), and Light is one of Allah’s Names, while clay is pure darkness. So he said, “I am better than him,” meaning, “I am closer to You than this one You created from clay.”\n\nIblis was ignorant of what Allah fashioned Adam upon, in that He undertook his creation with His two hands, as befits the Divine Image upon which he was created. Neither Iblis nor the angels had any taste of this, so they all objected—the angels with what they said, and Iblis with what he said.\n\nThus, the disobedience of the human stems from what he was created *upon*, and his obedience stems from what he was created *for*. Allah, exalted is He, said: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me), meaning, that they should humble themselves before My sovereignty and know My station from their station. The path of the human is worship, for he is a servant (*abd*), and the servant is restricted by his master, just as the master is restricted in one aspect by his servant, for he is the one ruled over.\n\nAllah is <<غَنِيٌّ عَنِ الْعَالَمِينَ>> (Independent of the worlds). The contingent did not reach the degree of the impossible, so it boasted over it by accepting existence, which is a Divine attribute. Yet, it did not reach the degree of Absolute Existence, because its existence is acquired and restricted.\n\nWhen the contingent looks at the impossible and its degree, and at what it received from its Lord—existence—and considers its own acceptance and distinction from the impossible, arrogance overtakes it, and it disobeys, saying: <<أَنَا رَبُّكُمُ الْأَعْلَى>> (I am your Lord, the Most High), and claims divinity. No one among the jinn ever claimed divinity.\n\nBut when the contingent looks at its need for the Necessary Existent (*Wajib al-Wujud*), and its acquisition of existence from Him, and His favor upon it, gratitude becomes incumbent upon it, so it humbles itself and obeys its Lord. Thus, his obedience stems from the aspect for which he was created, and his disobedience stems from the aspect upon which he was created, and his witnessing of the impossible, which does not possess this rank.\n\nIf the impossible had not been a third rank, the contingent would have had no one over whom to boast, for a thing does not boast over itself, and the needy does not boast over the One needed. Thus, it would have been inconceivable for disobedience to occur from the contingent.\n\nLook at how wondrous are the effects produced by the realities! And praise be to Allah for teaching us what we did not know and making us understand what we did not understand. The favor of Allah upon us has been great.\n\nThis much is sufficient for this chapter. This station (*manzil*) contains:\n\nThe science of supplication (*al-du’a*), the science of prophecy (*al-nubuwwa*), the science of addressing the whole in the essence of the one, the science of time (*al-zaman*), the science of piety (*al-taqwa*), the science of transgression (*al-ta’addi*), the science of proof (*al-burhan*) and its composition, the science of noble character (*makarim al-akhlaq*), the science of the station of the human soul with Allah compared to others, the science of incapacity (*al-ajz*), the science of faith (*al-iman*), the science of breaths (*al-anfas*), the science of reliance (*al-tawakkul*), the science of the unseen (*al-ghayb*), the science of the balance (*al-mizan*), the science of sanctification (*al-taqdis*), the science of the presence of doubts (*hadrat al-shukuk*), the science of those who are sanctified after impurity, the science of formation (*al-takwin*), the science of teaching (*al-ta’lim*), the science of the afterlife (*al-hayat al-akhira*), the science of protection from others, the science of mercy (*al-rahma*), the science of severity (*al-shidda*), the science of profit and loss, the science of the intellect’s perceptions (*madarik al-uqul*), the science of the end of the quest (*al-matlab*), the science of the Divine command (*al-amr al-ilahi*), the science of the world (*al-alam*), the science of Divine power (*al-iqtidar al-ilahi*), and the science of encompassing (*al-ihata*)—and whether Allah’s knowledge in the world has an end or not. I have not seen anyone who held this view except one person in Mecca; this is a known doctrine, but I had not seen anyone who affirmed it, for there is no doctrine except that I have seen someone who affirms it. May Allah guide us to the straight path. <<وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو انیس: شریعت کے کسی ایک پہلو کی قید سے نفس کی آزادی کے نزول کی معرفت میں، جو شریعت کے ہی کسی دوسرے پہلو کے ذریعے ہو۔\n\nاور یہ کہ رزق لانے والے سبب کو توکل کے طریقے سے ترک کرنا بھی رزق لانے والا ایک سبب (سبب) ہے، اور جو شخص اس صفت سے متصف ہے وہ اسباب کی غلامی سے باہر نہیں نکلا۔ اور جو شخص اللہ کے ساتھ اس حیثیت سے بیٹھا کہ وہ رزاق ہے، تو وہ معلول (سبب کا پابند) ہے۔\n\nلله بين السماء والأرض تنزيل *** من أمره فيه تبديل وتحويل‏\nاللہ کے لیے آسمان اور زمین کے درمیان ایک نزول ہے، جس کے امر میں تبدیلی اور تحویل ہے۔\n\nينحط من صور في طيها صور *** يمحو بها صورا لهن تمثيل‏\nوہ ایسی صورتوں سے نیچے اترتا ہے جن کے اندر مزید صورتیں ہیں، جن کے ذریعے وہ ان صورتوں کو مٹا دیتا ہے جن کی تمثیل ہے۔\n\nوصورة الحق فيه إن يكون على *** ما الحق فيه وإن لم فهو تضليل‏\nاور اس میں الحق (ذات حق) کی صورت یہ ہے کہ وہ اس پر ہو جو الحق (ذات حق) میں ہے، اور اگر ایسا نہ ہو تو یہ گمراہی ہے۔\n\nالهو يصاحب مجلى الحق في صور *** وهو الصحيح الذي ما فيه تعليل‏\nوہ (ہو) صورتوں میں الحق (ذات حق) کے ظہور (*مجلی الحق*) کا ساتھی ہے، اور یہی وہ صحیح بات ہے جس میں کوئی علت نہیں۔\n\nهذا مقام ابن عباس وحالتنا *** وقد أتى فيه قرآن وتنزيل‏\nیہ ابن عباس کا مقام ہے اور ہماری حالت بھی، اور اس بارے میں قرآن اور تنزیل آ چکی ہے۔\n\nفلا تغرنك حال لست تعرفها *** فإنها لك تسبيح وتهليل‏\nپس کوئی ایسی حالت تمہیں دھوکے میں نہ ڈالے جسے تم نہیں جانتے، کیونکہ وہ تمہارے لیے تسبیح اور تہلیل ہے۔\n\nوقل بها والتزامها إنها سند *** أقوى يؤيده شرع ومعقول‏\nاور اس کے بارے میں کہو اور اس پر قائم رہو کہ یہ ایک مضبوط سند ہے، جس کی تائید شریعت اور عقل کرتی ہے۔\n\nتقضي به صحف مثلي مطهرة *** منها زبور وتوراة وإنجيل‏\nاس کا فیصلہ میرے جیسی پاکیزہ صحیفے کرتے ہیں، جن میں زبور، تورات اور انجیل شامل ہیں۔\n\nفاشهد هديت علوما عز مدركها *** على العقول فوجه الحق مقبول‏\nپس اے ہدایت یافتہ! ان علوم کا الشہود (شہود) کر جن کا ادراک عقلوں پر دشوار ہے، لہٰذا الحق (ذات حق) کا چہرہ قابل قبول ہے۔\n\nيحار عقلك فيها إن يكيفها *** فإنه تحت قهر الحس مغلول‏\nاگر تمہاری عقل ان کی کیفیت بیان کرنا چاہے تو حیران ہو جائے گی، کیونکہ وہ حس کے قہر کے نیچے جکڑی ہوئی ہے۔\n\nفالحس أفضل ما تعطاه من منح *** وصاحب الفكر منصور ومخذول‏\nپس حس بہترین عطیات میں سے ہے جو تمہیں دیے گئے، اور صاحبِ فکر (کبھی) مدد یافتہ ہوتا ہے اور (کبھی) رسوا۔\n\n***\n\n### [یہ کہ جس کی حقیقت مقید ہو، اس کے لیے مطلق ہونا درست نہیں]\n\nجان لو، اللہ تمہیں توفیق دے، اے میرے گہرے ولی! اللہ تمہیں اپنی رحمت میں لے لے اور تمہاری فہم کی آنکھ کھول دے، کہ جس کی حقیقت یہ ہو کہ وہ مقید (مقید) ہو، اس کے لیے کسی بھی صورت میں مطلق (مطلق) ہونا درست نہیں جب تک اس کی عین (ذات) باقی ہے۔ کیونکہ التقیید (قید) اس کی ذاتی صفت (صفة نفسية) ہے۔ اور جس کی حقیقت یہ ہو کہ وہ مطلق (مطلق) ہو، تو وہ کلی طور پر التقیید (قید) کو قبول نہیں کرتا، کیونکہ اس کی ذاتی صفت (صفة نفسية) مطلق ہونا ہے۔ لیکن مقید (مقید) کی طاقت میں نہیں کہ وہ الإطلاق (اطلاق) کو قبول کرے، کیونکہ اس کی صفت عاجزی ہے، اور اس کی عین (ذات) کے باقی رہنے کے لیے اسے حفظ الٰہی کی ضرورت ہوتی ہے۔ لہٰذا، افتقار (محتاجی) اس کے لیے لازم ہے۔ اور مطلق (مطلق) کے لیے یہ اختیار ہے کہ اگر چاہے تو خود کو مقید کر لے، اور اگر چاہے تو مقید نہ کرے۔ کیونکہ یہ اس کے مطلق ہونے کی صفت میں شامل ہے، یعنی مشیت کا الإطلاق (اطلاقِ مشیت)۔ اور اسی بنا پر الحق (ذات حق) نے اپنے اوپر واجب کیا اور اپنے بندے کے لیے عہد کے تحت داخل ہوا، چنانچہ وجوب کے بارے میں فرمایا: **كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ** (تمہارے رب نے اپنے اوپر رحمت کو لازم کر لیا ہے)۔ یعنی واجب کر لیا۔ پس وہ خود اپنے اوپر واجب کرنے والا ہے، جبکہ کوئی دوسرا اس پر یہ واجب نہیں کر سکتا، ورنہ وہ دوسرے کے ذریعے مقید ہو جاتا۔ پس اس نے اپنے بندوں پر رحمت اور خفی لطف کے طور پر خود کو مقید کیا۔ اور عہد کے بارے میں فرمایا: **وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ** (اور میرے عہد کو پورا کرو، میں تمہارے عہد کو پورا کروں گا)۔ پس اس نے ان کو مکلف کیا اور خود کو بھی مکلف کیا، جب ان کے نزدیک اس کے قول کی سچائی کی دلیل قائم ہو گئی، تو اس نے یہ بات ان کے لیے انس پیدا کرنے کے لیے ذکر فرمائی، وہ پاک اور بلند ہے۔ لیکن یہ سب کچھ، یعنی بندوں کے لیے التقیید (قید) میں داخل ہونا، اس کے الٰہ ہونے کی حیثیت سے ہے، نہ کہ اس کی ذات (الذات) کی حیثیت سے۔ کیونکہ ذات (الذات) عالمین سے بے نیاز ہے، اور بادشاہ (الملک) بادشاہت سے بے نیاز نہیں، کیونکہ اگر بادشاہت نہ ہو تو بادشاہ کا نام درست نہیں ہو سکتا۔ پس یہ مرتبہ ہے جس نے التقیید (قید) عطا کیا، نہ کہ الحق (ذات حق) جل و تعالیٰ کی ذات نے۔ پس مخلوق جس طرح خالق (الخالق) کو اس حیثیت سے طلب کرتی ہے کہ وہ مخلوق ہے، اسی طرح خالق (الخالق) بھی مخلوق کو اس حیثیت سے طلب کرتا ہے کہ وہ خالق ہے۔ کیا تم نہیں دیکھتے کہ عالم جب اپنی ذات سے عدم رکھتا تھا، تو اس نے نہ خالق کو طلب کیا اور نہ معدم کو، کیونکہ عدم اس کے لیے اس کی ذات سے ہے۔ اس نے تو خالق کو اس حیثیت سے طلب کیا کہ وہ مخلوق ہے۔ پس اسی بنا پر اس (اللہ) نے خود کو اس چیز سے مقید کیا جو اس نے اپنے اوپر عہد کی وفا کی صورت میں واجب کی۔ اور جب مخلوق اس مقام پر تھی، اسی لیے وہ اسباب سے عشق کرنے لگی، اور طبعاً اس کے لیے اسباب کی طرف مائل ہونا ہی ممکن ہوا، کیونکہ وہ ایک سبب (سبب) یعنی اللہ تعالیٰ کے ذریعے موجود ہوا ہے۔ اور اسی لیے الحق (ذات حق) نے عالم میں اسباب کو رکھا، کیونکہ وہ سبحانہ جانتا تھا کہ خالق (الخالق) کا نام الوجود (ہستی) اور تقدیراً درست نہیں ہو سکتا مگر مخلوق کے الوجود (ہستی) یا تقدیر کے ساتھ۔ اور اسی طرح ہر اسمِ الٰہی جو کون (وجود) کو طلب کرتا ہے، جیسے الغفور، المالک، الشکور، الرحیم اور دیگر اسماء۔ پس اسی بنا پر اس نے اسباب کو رکھا اور عالم ایک دوسرے سے مربوط ہو کر ظاہر ہوا، چنانچہ کوئی بالی نہیں اگتی مگر کاشتکار، زمین اور بارش کے سبب۔ اور جب بارش نہ ہو تو استسقاء (بارش طلب کر نے) کا حکم دیا، تاکہ وہ اپنے بندوں کے دلوں میں اسباب کے الوجود (ہستی) کو ثابت کرے۔ اور اسی لیے اس نے اپنے بندوں کو کبھی بھی سبب (سبب) سے باہر نکلنے کا مکلف نہیں کیا۔\n\nکیونکہ اس کی حقیقت اس کا تقاضا نہیں کرتی۔ بلکہ اس نے اس کے لیے ایک سبب (سبب) مقرر کیا، نہ کہ کوئی دوسرا سبب، اور اس سے کہا کہ میں تمہارا سبب ہوں، پس مجھ پر ہی اعتماد کرو اور توکل کرو، جیسا کہ وارد ہوا ہے: **وَعَلَى اللهِ فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ** (اور اللہ پر ہی توکل کرو اگر تم مومن ہو)۔ پس مرد وہ ہے جو اسباب کو ثابت کرے، کیونکہ اگر وہ ان کی نفی کرتا تو نہ اللہ کو پہچانتا اور نہ خود کو۔ اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: **من عرف نفسه عرف ربه** (جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا)۔\n\nاور یہ نہیں فرمایا کہ اپنے رب کی ذات (ذات) کو پہچانا، کیونکہ رب کی ذات (ذات الرب) مطلق الإطلاق (اطلاق) رکھتی ہے، اور مقید (مقید) کو مطلق (مطلق) کی المعرفۃ (معرفت) کیسے ہو سکتی ہے؟ اور رب (الرب) بلاشبہ مربوب (مربوب) کو طلب کرتا ہے، پس اس میں التقیید (قید) کی بو ہے۔ اسی سے مخلوق نے اپنے رب کو پہچانا۔ اور اسی لیے اسے حکم دیا گیا کہ وہ جان لے کہ اس کے سوا کوئی معبود نہیں، اس کے الٰہ ہونے کی حیثیت سے، کیونکہ الٰہ (معبود) مألوہ (جس کی عبادت کی جائے) کو طلب کرتا ہے، اور الحق (ذات حق) کی ذات اضافت سے بے نیاز ہے، لہٰذا وہ مقید نہیں ہوتی۔ پس اسباب کا اثبات، ان کو ثابت کرنے والے کی اپنے رب کی المعرفۃ (معرفت) پر سب سے بڑی دلیل ہے۔ اور جس نے ان کو اٹھا دیا، اس نے اس چیز کو اٹھا دیا جس کا اٹھانا درست نہیں۔ بلکہ اسے چاہیے کہ وہ سببِ اول کے ساتھ کھڑا ہو، اور وہ وہی ہے جس نے ان اسباب کو پیدا کیا اور انہیں قائم کیا۔ اور جو شخص اس علم سے بے بہرہ ہے جس کی طرف ہم نے اشارہ کیا، وہ نہیں جانتا کہ الٰہی ادب کے ساتھ اپنے رب کی المعرفۃ (معرفت) کا راستہ کیسے طے کرے۔ کیونکہ اسباب کو اٹھا دینے والا اللہ کے ساتھ بدتمیزی کرنے والا ہے۔ اور جس نے اللہ کے مقرر کردہ والیوں میں سے کسی کو معزول کیا، اس نے بدتمیزی کی اور اس والی کو معزول کرنے میں جھوٹ بولا۔ پس دیکھو وہ کتنا جاہل ہے جو اسباب کا انکار کرتا ہے اور ان کے ترک کا قائل ہے۔ اور جس نے اس چیز کو ترک کیا جسے الحق (ذات حق) نے مقرر کیا، وہ ایک جھگڑالو ہے، نہ کہ بندہ، اور جاہل ہے، نہ کہ عالم۔ اور اے میرے ولی! میں تمہیں نصیحت کرتا ہوں کہ تم جاہلوں اور غافلوں میں سے نہ ہو جاؤ۔ اور میں دیکھتا ہوں کہ تم فوراً ہی اسباب کے ترک میں خود کو جھٹلا دیتے ہو۔ کیونکہ میں تمہیں دیکھتا ہوں کہ جب تم میرے ساتھ اسباب کے ترک، انہیں پھینک دینے، ان کی طرف توجہ نہ دینے اور ان کے استعمال کو چھوڑنے کی بات کر رہے ہوتے ہو، تو تمہیں پیاس لگتی ہے، اور تم میری بات چھوڑ کر پانی کی طرف دوڑتے ہو اور اس سے پیتے ہو تاکہ پیاس کی تکلیف کو دور کر سکو۔ اسی طرح جب تمہیں بھوک لگتی ہے تو تم روٹی لیتے ہو اور کھاتے ہو۔ اور تمہاری انتہا یہ ہوتی ہے کہ تم اسے اپنے ہاتھ سے نہیں لیتے، یہاں تک کہ وہ تمہارے منہ میں رکھ دی جائے، اور جب وہ تمہارے منہ میں آ جاتی ہے تو تم اسے چباتے اور نگلتے ہو۔ تم نے میرے سامنے کتنی جلدی خود کو جھٹلا دیا۔ اسی طرح جب تم دیکھنا چاہتے ہو تو تمہیں اپنی آنکھ کھولنے کی محتاجی ہوتی ہے، تو کیا تم نے اسے کسی سبب (سبب) کے بغیر کھولا؟ اور جب تم اپنے کسی دوست سے ملنا چاہتے ہو تو اس کی طرف چلتے ہو، اور چلنا اس تک پہنچنے کا سبب ہے۔ تو تم اسباب کی نفی اسباب کے ذریعے کیسے کرتے ہو؟ کیا تم اپنے لیے اس جہالت کو پسند کرتے ہو؟ پس الٰہی ادیب اور عالم وہ ہے جو اس چیز کو ثابت کرے جسے اللہ نے ثابت کیا، اس جگہ پر جہاں اللہ نے اسے ثابت کیا، اور اس طریقے پر جس پر اللہ نے اسے ثابت کیا۔ اور جو اس چیز کی نفی کرے جسے اللہ نے نفی کیا، اس جگہ پر جہاں اللہ نے اسے نفی کیا، اور اس طریقے پر جس پر اللہ نے اسے نفی کیا۔ پھر تم خود کو جھٹلاتے ہو اگر تم اپنے رب کی عبادت میں صالح ہو؟ کیا تمہاری عبادت تمہاری سعادت کا سبب نہیں ہے؟ اور تم اسباب کے ترک کا کہتے ہو، تو تم عمل کو کیوں نہیں چھوڑ دیتے؟ میں نے کسی رسول، نبی، ولی، مومن، کافر، بدبخت یا نیک بخت کو نہیں دیکھا جو مطلقاً اسباب کی غلامی سے باہر نکلا ہو۔ ان میں سب سے کم تر سانس لینا ہے۔ پس اے سبب (سبب) کو ترک کرنے والے! سانس نہ لو، کیونکہ سانس لینا تمہاری زندگی کا سبب ہے۔ پس اپنی سانس کو روکو یہاں تک کہ تم مر جاؤ، تو تم اپنے آپ کو قتل کرنے والے ہو گے، تو تم پر جنت حرام ہو جائے گی۔ اور اگر تم نے ایسا کیا، تو تم سبب کے حکم کے تحت ہو، کیونکہ سانس روکنا تمہاری موت کا سبب ہے، اور اس صورت میں تمہاری موت تمہاری بدبختی کا سبب ہے۔ پس تم سبب سے باہر نہیں نکلے۔ میں تمہیں عاقل نہیں سمجھتا اگر تم یہ دعویٰ کرتے ہو کہ تم اس چیز کو اٹھا دو گے جسے اللہ نے نصب کیا اور ایک مشہود علامت کے طور پر قائم کیا۔ اور اللہ والوں کے کلام سے جو تم سنتے ہو اسے چھوڑ دو، کیونکہ ان کا مطلب وہ نہیں تھا جو تم نے وہم کیا، بلکہ تم ان کی مراد سے جاہل رہے جو انہوں نے اسباب کو منقطع کرنے سے لی، جیسا کہ تم الحق (ذات حق) کی مراد سے جاہل رہے جو اس نے اسباب کو رکھنے سے لی۔ اور میں نے تمہیں الحق (ذات حق) کی شاہراہ پر ڈال دیا ہے اور وہ طریقہ واضح کر دیا ہے جو اللہ نے اپنے بندوں کے لیے مقرر کیا اور انہیں اس پر چلنے کا حکم دیا۔ پس اس پر چلو، **وَعَلَى اللهِ قَصْدُ السَّبِيلِ** (اور اللہ پر ہی سیدھے راستے کا دکھانا ہے)۔ اور **وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ** (اور اگر وہ چاہتا تو تم سب کو ہدایت دے دیتا)۔ اور اس کے بعد:\n\n***\n\n### [یہ کہ بندے کو الحق (ذات حق) کبھی اس کی نافرمانی میں قائم کرتا ہے اور کبھی اس کی اطاعت میں]\n\nپس جان لو کہ بندے کو الحق (ذات حق) کبھی اس کی نافرمانی میں قائم کرتا ہے اور کبھی اس کی اطاعت میں۔ پس میں تمہیں واضح کرتا ہوں کہ بندے میں ان دونوں چیزوں کا قبول کہاں سے آیا، اور ہم تمہیں عالم میں انسان کا مرتبہ واضح کریں گے، اور یہ کہ انسان کے لیے اس کی جنس سے مثالیں ہیں، جبکہ عالم مجموعی طور پر کوئی مثال نہیں رکھتا، اور وہ حقائق اور اسرار جو اس مسئلے سے متعلق ہیں، اس کے بعد کہ ہم ان معانی کو جمع کریں جن کی تفصیل میں ایک نظم میں چاہتا ہوں، جو تمہارے لیے ایک جامع، مختصر اور مسائل کے سروں کو قابو میں رکھنے والی ماں کی طرح ہو، تاکہ جب تم اسے دوسروں کے لیے کھولنا چاہو تو یہ نظم تمہیں ان کے اہم نکات پر متنبہ کرے۔ پس ہم نے اس بارے میں بندے سے کنایہ کرتے ہوئے کہا:\n\nإذا عصى الله قد وفى حقيقته *** وإن أطاع فقد وفى طريقته‏\nجب وہ اللہ کی نافرمانی کرتا ہے تو اس نے اپنی حقیقت کو پورا کیا، اور اگر وہ اطاعت کرتا ہے تو اس نے اپنے طریقے کو پورا کیا۔\n\nلو لا القبول لما كان الوجود له *** والخلق يطلب بالمعنى خليقته‏\nاگر قبولیت نہ ہوتی تو اس کے لیے الوجود (ہستی) نہ ہوتی، اور مخلوق معنی کے لحاظ سے اپنی فطرت (*خليقته*) کو طلب کرتی ہے۔\n\nإن المحال دليل إن نظرت فلا *** تعدل به حجة فاعلم حقيقته‏\nاگر تم دیکھو تو محال (ناممکن) ایک دلیل ہے، پس اسے کسی دلیل کے برابر نہ ٹھہراؤ، اس کی حقیقت جان لو۔\n\nلا يقبل الكون والإمكان يقبله *** فكل أمر فقد وفى سليقته‏\nوہ (محال) کون (وجود) کو قبول نہیں کرتا، جبکہ الإمكان (امکان) اسے قبول کرتا ہے، پس ہر امر نے اپنی فطرت (*سلیقته*) کو پورا کیا۔\n\nلذاك فزنا من الأعلى بصورته *** عناية منه أعطاها خليقته‏\nاسی لیے ہم نے اعلیٰ سے اس کی صورت کے ذریعے کامیابی حاصل کی، یہ اس کی طرف سے ایک عنایت تھی جو اس نے اپنی مخلوق (*خليقته*) کو عطا کی۔\n\nلو كان للكون مثل عق تكرمة *** له ليطعمه جودا عقيقته‏\nاگر کون (عالم) کی کوئی مثال ہوتی تو وہ اس کی تعظیم میں عقیقہ کرتا تاکہ سخاوت کے طور پر اسے کھلائے۔\n\nلكنه مفرد والحق ليس له *** عين التغذي فما أعطاه صورته‏\nلیکن وہ (عالم) اکیلا ہے، اور الحق (ذات حق) کے لیے تغذیہ (کھانے) کی عین (ذات) نہیں ہے، پس اس نے اسے اپنی صورت نہیں دی۔\n\n***\n\n### [یہ کہ عالم وجود کی حالت سے پہلے ممکن تھا اور محال نہیں تھا]\n\nجان لو، اللہ تمہیں توفیق دے، اے میرے گہرے ولی! کہ عالم جب ممکن (ممکن) تھا اور وجود (الوجود) کی حالت سے پہلے محال (محال) نہیں تھا، اور محال وجود کو قبول نہیں کرتا، تو ممکن کی حقیقت نے وجود کو قبول کر کے محال کی حقیقت کی مخالفت کی جو اسے قبول نہیں کرتا۔ اور جب اللہ نے عالم کو ایک بڑا انسان (*إنسانا كبيرا*) کے طور پر موجود کیا اور آدم اور اس کی اولاد کو اس عالم کا خلاصہ بنایا، اور اسی لیے اسے تمام اسماء عطا کیے، یعنی وہ تمام اسماء جو عالم کے ایجاد پر متوجہ تھے، اور وہ الٰہی اسماء (*الأسماء الإلهية*) ہیں جنہیں عالم اپنی ذات کے ذریعے طلب کرتا تھا، کیونکہ اس کا وجود ان سے تھا۔\n\nپس نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: **إن الله خلق آدم على صورته** (بیشک اللہ نے آدم کو اپنی صورت پر پیدا کیا)۔\n\nچونکہ اسماء اس کے لیے تھے اور ان سے عالم موجود ہوا، پس عالم مجموعی طور پر ایک بڑا انسان ہے۔ اور جب اللہ نے اسے صورت کے ذریعے عزت بخشی، تو عالم اور مثالوں نے انسان سے اس پر شکر کا مطالبہ کیا۔ پس یہی وہ عقیقہ تھا جسے اللہ نے ہر انسان پر مقرر کیا، اس حالت پر الوجود (ہستی) کی تخصیص پر شکر کے طور پر، اور اسے اس کے ساتویں دن مقرر کیا، کیونکہ وہ ایسی حالت پر تھا جو اس سے تغذیہ (کھانا) قبول نہیں کرتی تھی، تاکہ وہ اپنے لیے کوشش کرنے والا نہ ہو، پس اسے مثالوں نے کھایا۔ اور ہر انسان اپنے عقیقے کے ساتھ گروی ہے، اور اسے چاہیے کہ اگر وہ بڑھاپے میں اپنا عقیقہ کرے تو اس میں سے کچھ نہ کھائے اور اسے لوگوں کو کھلائے۔ اور اسی لیے عالم مجموعی طور پر اپنا عقیقہ نہیں کرتا، اگرچہ وہ صورت پر ہے، کیونکہ وہاں کوئی نہیں جو اس کا عقیقہ کھائے، کیونکہ وہاں صرف اللہ اور عالم ہے، اور جس کا عقیقہ کیا جائے وہ اس میں سے نہیں کھاتا، اور الحق (ذات حق) غذا اور کھانے سے پاک ہے۔ اور یہ منزلت صرف اللہ کے لیے ہے۔ پس عالم کا عقیقہ عبث ہو جاتا۔ چنانچہ اس (اللہ) نے اس شکر، جو کہ عقیقہ ہے، کے بدلے اپنی حمد کے ساتھ تسبیح کو مقرر کیا، اس الوجود (ہستی) پر شکر کے طور پر جو اس نے اسے اپنی صورت پر عطا کیا، پس فرمایا: **وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيمًا غَفُورًا** (اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے، لیکن تم ان کی تسبیح کو نہیں سمجھتے۔ بیشک وہ بردبار، بخشنے والا ہے)۔ پس اس کی ازلی عنایت سے اس نے ہمیں صورت پر الوجود (ہستی) عطا کیا، لیکن وہ سورت (منزلہ) عطا نہیں کی جو اس کا مرتبہ ہے۔ کیونکہ اس کا مرتبہ ربوبیت ہے اور ہمارا مرتبہ مربوبیت ہے۔ اور اسی لیے ہم نے کہا کہ عالم اپنا عقیقہ نہیں کرتا، قربانی کے طور پر، کیونکہ وہ اسے نہیں کھاتا، اور الحق (ذات حق) کے لیے یہ درست نہیں اور نہ ہی اسے یہ زیب دیتا ہے۔ پس اس کا عقیقہ اس کی حمد کے ساتھ تسبیح تھا، کیونکہ تسبیح اس کے لیے مناسب ہے۔ اور جب ممکن کی طبیعت نے الوجود (ہستی) کو قبول کیا، تو نہ ہونے کے بعد وہ اپنی عین (ذات) میں ظاہر ہوا، تو اسے خلق (پیدائش) کا نام دیا گیا، جو خلیقہ (فطرت) سے مشتق ہے، اور وہ امر کی طبیعت اور حقیقت ہے، یعنی صورت پر ڈھالا گیا، اور یہی اس کی خلیقہ ہے۔ اور جب اللہ نے اسے اپنی صورت پر موجود کیا اور اسے اپنی عبادت کے لیے موجود کیا، تو جو اس پر موجود کیا وہ اس کے خلاف تھا جس کے لیے اسے موجود کیا، پس فرمایا: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ * مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ** (اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں * میں ان سے کوئی رزق نہیں چاہتا اور نہ یہ چاہتا ہوں کہ وہ مجھے کھلائیں)۔ اور یہ وہی ہے جس کی طرف ہم نے عقیقہ میں اشارہ کیا کہ وہ سبحانہ کو کھلایا جانا مناسب نہیں۔ پس جن اور انس اس چیز میں شریک ہوئے جس کے لیے وہ موجود ہوئے، نہ کہ اس چیز میں جس پر وہ موجود ہوئے۔ اور چونکہ الحق (ذات حق) کی صورت یہ تقاضا کرتی ہے کہ وہ اپنی عزت کی وجہ سے مامور اور منہی نہ ہو، تو یہ عزت انسان میں طبعاً سرایت کر گئی، پس اس نے ظاہراً اور باطناً نافرمانی کی، اپنی صورت کی حیثیت سے، کیونکہ وہ اس کی صورت پر ہے جو امر اور نہی اور جبر کو قبول نہیں کرتا۔ کیا تم نہیں دیکھتے کہ ابلیس جب صورت پر نہیں تھا تو اس نے باطناً نافرمانی نہیں کی، چنانچہ وہ انسان سے کہتا ہے: **اكْفُرْ** (کفر کر)، اور جب وہ کفر کر لیتا ہے تو ابلیس کہتا ہے: **إِنِّي أَخَافُ اللهَ رَبَّ الْعَالَمِينَ** (بیشک میں اللہ سے ڈرتا ہوں جو رب العالمین ہے)۔ اور اس نے صرف آدم پر ظاہراً تکبر کیا، پس کہا: **أَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا** (کیا میں اسے سجدہ کروں جسے تو نے مٹی سے پیدا کیا؟) اور کہا: **أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ** (میں اس سے بہتر ہوں، تو نے مجھے آگ سے پیدا کیا)۔ اور آگ نوری روشنی میں نور کے زیادہ قریب ہے، اور نور اللہ کے اسماء میں سے ایک اسم ہے، اور مٹی خالص ظلمت ہے۔ پس اس نے کہا: **أَنَا خَيْرٌ مِنْهُ** (میں اس سے بہتر ہوں)، یعنی میں اس سے زیادہ تمہارے قریب ہوں جسے تو نے مٹی سے پیدا کیا۔ اور ابلیس اس چیز سے جاہل رہا جس پر اللہ نے آدم کو فطرت دی تھی کہ اس نے اسے اپنے دونوں ہاتھوں سے پیدا کرنے کی ذمہ داری لی، جیسا کہ اس الٰہی صورت کے لیے جو اس پر پیدا کیا گیا، اور ابلیس اور فرشتوں کے پاس اس کا کوئی ذوق نہیں تھا۔ پس سب نے اعتراض کیا، فرشتوں نے جو کہا اس سے اور ابلیس نے جو کہا اس سے۔ پس انسان کی نافرمانی اس چیز کی وجہ سے ہے جس پر وہ پیدا کیا گیا، اور اس کی اطاعت اس چیز کی وجہ سے ہے جس کے لیے وہ پیدا کیا گیا۔ اللہ تعالیٰ نے فرمایا: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ** (اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں)۔ یعنی وہ میری عزت کے لیے عاجزی کریں اور میرے مرتبے کو ان کے مرتبے سے پہچانیں۔ پس انسان کا طریقہ عبادت ہے، کیونکہ وہ عبد (بندہ) ہے، اور بندہ اپنے آقا سے مقید ہے، جیسا کہ آقا بھی ایک لحاظ سے اپنے بندے سے مقید ہے، کیونکہ وہ مسود (جس کی سیادت کی جائے) ہے۔ اور اللہ **غَنِيٌّ عَنِ الْعَالَمِينَ** (عالمین سے بے نیاز ہے)۔ پس ممکن محال کے درجے کو نہیں پہنچا، تو اس نے الوجود (ہستی) کو قبول کر کے اس پر فخر کیا، جو کہ ایک الٰہی صفت ہے، اور وہ مطلق الوجود (الوجود) کے درجے کو نہیں پہنچا، کیونکہ اس کا وجود مستفاد اور مقید ہے۔ پس جب وہ محال اور اس کے درجے کو دیکھتا ہے، اور جو کچھ اسے اپنے رب سے الوجود (ہستی) کی صورت میں حاصل ہوا، اور اپنے نفس میں اس کی قبولیت اور محال سے اس کے امتیاز کو دیکھتا ہے، تو اسے کبریاء (بڑائی) محسوس ہوتی ہے، پس وہ نافرمانی کرتا ہے اور کہتا ہے: **أَنَا رَبُّكُمُ الْأَعْلَى** (میں تمہارا سب سے بڑا رب ہوں) اور الوہیت کا دعویٰ کرتا ہے، اور جنوں میں سے کسی نے یہ دعویٰ نہیں کیا۔ اور جب وہ واجب الوجود کی طرف اپنی محتاجی کو دیکھتا ہے، اور اس سے الوجود (ہستی) حاصل کرنے اور اس کے احسان کو دیکھتا ہے، تو اس پر شکر واجب ہوتا ہے، پس وہ عاجزی کرتا ہے اور اپنے رب کی اطاعت کرتا ہے۔ پس اس کی اطاعت اس پہلو سے ہے جس کے لیے وہ پیدا کیا گیا، اور اس کی نافرمانی اس پہلو سے ہے جس پر وہ پیدا کیا گیا، اور اس محال کا الشہود (شہود) کرنے سے ہے جسے یہ مرتبہ حاصل نہیں۔ پس اگر محال تیسرا مرتبہ نہ ہوتا تو ممکن کو کوئی ایسا نہ ملتا جس پر وہ فخر کرتا، کیونکہ کوئی چیز اپنے آپ پر فخر نہیں کرتی، اور محتاج اس پر فخر نہیں کرتا جس کا وہ محتاج ہے۔ پس یہ تصور نہیں کیا جا سکتا تھا کہ ممکن سے کوئی نافرمانی سرزد ہو۔ پس دیکھو کہ حقائق کتنے عجیب اثرات عطا کرتی ہیں، اور تمام تعریفیں اللہ کے لیے ہیں کہ اس نے ہمیں وہ سکھایا جو ہم نہیں جانتے تھے، اور ہمیں وہ سمجھایا جو ہم نہیں سمجھتے تھے، اور اللہ کا فضل ہم پر بہت بڑا تھا۔ اور یہ مقدار اس باب کے لیے کافی ہے، اور یہ منزل ان علوم پر مشتمل ہے:\n\nعلم الدعاء (دعا کا علم)، علم النبوة (نبوت کا علم)، علم خطاب الكل في عين الواحد (واحد کی عین میں سب سے خطاب کا علم)، علم الزمان (زمانے کا علم)، علم التقوى (تقویٰ کا علم)، علم التعدي (حد سے تجاوز کا علم)، علم البرهان وتركيبه (برہان اور اس کی ترکیب کا علم)، علم مكارم الأخلاق (اخلاق حسنہ کا علم)، علم منزلة نفس الإنسان عند الله من غيره (اللہ کے نزدیک انسان کے نفس کے مرتبے کا علم دوسروں کے مقابلے میں)، علم العجز (عاجزی کا علم)، علم الايمان (ایمان کا علم)، علم الأنفاس (سانسوں کا علم)، علم التوكل (توکل کا علم)، علم الغيب (غیب کا علم)، علم الميزان (میزان کا علم)، علم التقديس (تقدیس کا علم)، علم حضرة الشكوك (شک و شبہات کی حضوری کا علم)، علم من تقدس بعد الخبث (خبث کے بعد پاک ہونے والے کا علم)، علم التكوين (تکوین کا علم)، علم التعليم (تعلیم کا علم)، علم الحياة الآخرة (آخرت کی زندگی کا علم)، علم الإجارة من غيره (دوسرے سے پناہ لینے کا علم)، علم الرحمة (رحمت کا علم)، علم الشدة (سختی کا علم)، علم الربح والخسران (نفع اور نقصان کا علم)، علم مدارك العقول (عقلوں کے ادراک کا علم)، علم نهاية المطلب (مطلب کی انتہا کا علم)، علم الأمر الإلهي (الٰہی امر کا علم)، علم العالم (عالم کا علم)، علم الاقتدار الإلهي (الٰہی اقتدار کا علم)، علم الإحاطة (احاطے کا علم)، اور کیا اللہ کا علم عالم میں ختم ہو جاتا ہے یا نہیں؟ اور میں نے اس کا قائل صرف ایک شخص کو مکہ میں دیکھا جو یہ رائے رکھتا تھا، اور یہ ایک معروف مذہب ہے لیکن میں نے اس کا قائل نہیں دیکھا تھا، کیونکہ کوئی ایسا مذہب نہیں جس کا قائل میں نے نہ دیکھا ہو۔ پس اللہ ہمیں سیدھے راستے پر چلائے، اور **وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و نوزدهم: در معرفت فرود آمدن رهایی نفس از قید یک وجه از وجوه شریعت به وجهی دیگر از آن.\n\nو اینکه ترک سبب (واسطه) جلب روزی از طریق توکل، خود سببی برای جلب روزی است، و کسی که متصف به آن است از بردگی اسباب خارج نشده است. و هر کس با حق (الحق) از جهت رازق بودنش بنشیند، معلول است.\n\n> حق را میان آسمان و زمین تنزیلی است *** که در امر او تبدیل و تحویلی است\n> از صورت‌هایی فرود می‌آید که در خود صورت‌ها دارند *** و صورت‌هایی را که تمثیل دارند، محو می‌کند\n> و صورت حق (الحق) در آن این است که بر *** آنچه حق (الحق) در آن است باشد، وگرنه گمراهی است\n> او (الهو) همراه با مجلای حق (الحق) در صورت‌هاست *** و اوست صحیح که در آن تعلیلی نیست\n> این مقام ابن عباس و حال ماست *** و در آن قرآن و تنزیل آمده است\n> پس حالی که نمی‌شناسی تو را نفریبد *** زیرا آن برای تو تسبیح و تهلیل است\n> و بگو و ملتزم باش که آن سندی است *** قوی‌تر که شرع و معقول آن را تأیید می‌کند\n> صحیفه‌های مطهری چون من به آن حکم می‌کنند *** از جمله زبور و تورات و انجیل\n> پس ای هدایت‌شده، علومی را شهود کن که درکشان *** بر عقل‌ها دشوار است، پس وجه حق (الحق) مقبول است\n> عقل تو در آن حیران می‌شود اگر بخواهد آن را کیفیت دهد *** زیرا زیر قهر حس، در بند است\n> پس حس بهترین چیزی است که از بخشش‌ها به تو داده می‌شود *** و صاحب فکر، یاری‌شده و خوارشده است.\n\n### [اینکه کسی که حقیقتش مقید است، صحیح نیست که مطلق باشد]\n\nبدان، خداوند تو را توفیق دهد ای ولیّ صمیمی، خداوند تو را به رحمتش سرپرستی کند و چشم فهمت را بگشاید، که هر کس حقیقتش این باشد که مقید باشد، مادامی که عینیتش باقی است، به هیچ وجهی صحیح نیست که مطلق (الإطلاق) باشد؛ زیرا تقیید (التقييد) صفتی نفسانی برای اوست. و هر کس حقیقتش این باشد که مطلق باشد، به طور کلی تقیید را نمی‌پذیرد، زیرا صفت نفسانی او این است که مطلق باشد. اما در توان مقید نیست که اطلاق را بپذیرد، زیرا صفت او عجز است و حفظ الهی باید او را همراهی کند تا عینیتش باقی بماند؛ پس افتقار (نیازمندی) ملازم اوست. و مطلق می‌تواند اگر بخواهد خود را مقید کند و اگر بخواهد مقید نکند، زیرا این از صفت مطلق بودن اوست، یعنی اطلاق مشیت. و از همین جاست که حق (الحق) بر خود واجب کرد و تحت عهد با بنده خود درآمد. پس در باب وجوب فرمود: **كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ** (پروردگارتان رحمت را بر خود واجب کرده است). یعنی واجب نمود؛ پس اوست که بر خود واجب کرده، در حالی که دیگری آن را بر او واجب نکرده است که در این صورت مقید به غیر می‌شد. پس خود را برای بندگانش مقید کرد، از روی رحمت به آنان و لطفی پنهان. و در باب عهد فرمود: **وَأَوْفُوا بِعَهْدِي أُوفِ بِعَهْدِكُمْ** (و به عهد من وفا کنید تا من نیز به عهد شما وفا کنم). پس آنان را مکلف کرد و خود را مکلف ساخت، زیرا دلیل صدق او در گفتارش نزد آنان اقامه شده بود. این را برای انس دادن به آنان ذکر کرد، سبحانه و تعالی. اما این همه، یعنی ورود او در تقیید برای بندگانش، از جهت الوهیت اوست، نه از جهت ذات او؛ زیرا ذات از عالمیان بی‌نیاز است. و پادشاه از پادشاهی بی‌نیاز نیست، زیرا اگر پادشاهی نبود، نام پادشاه صحیح نمی‌شد. پس این مرتبه است که تقیید را اعطا کرده، نه ذات حق (الحق) جل و تعالی. همان‌طور که مخلوق، خالق را از جهت مخلوق بودنش می‌طلبد، خالق نیز مخلوق را از جهت خالق بودنش می‌طلبد. آیا نمی‌بینی که عالم، چون از خود عدم داشت، خالق یا معدم را نطلبید؟ زیرا عدم از ذات اوست. بلکه خالق را از جهت مخلوق بودنش طلبید. پس از اینجاست که تعالی خود را به آنچه بر خود واجب کرده است، یعنی وفای به عهد، مقید ساخت. و چون مخلوق چنین بود، به اسباب (واسطه‌ها) عشق ورزید و طبعاً جز میل به آن‌ها برایش ممکن نشد، زیرا او از سببی موجود شده است و آن سبب، خداوند تعالی است. و به همین دلیل نیز حق (الحق) اسباب را در عالم قرار داد، زیرا او سبحانه می‌دانست که نام خالق، وجوداً و تقدیراً، جز با مخلوق، وجوداً و تقدیراً، صحیح نمی‌شود. و همچنین هر اسم الهی که کون را می‌طلبد، مانند غفور، مالک، شکور، رحیم و غیره از اسماء. پس از اینجاست که اسباب را قرار داد و عالم به صورت مرتبط با یکدیگر ظاهر شد. پس خوشه‌ای نمی‌روید مگر از زارع و زمین و باران، و امر به استسقاء (طلب باران) شد هنگامی که باران نبود، تا وجود اسباب را در قلوب بندگانش تثبیت کند. و به همین دلیل هرگز بندگانش را مکلف به خروج از سبب نکرده است.\n\nزیرا حقیقت او مقتضی آن نیست. بلکه سببی را به جای سببی دیگر برای او تعیین کرد و به او فرمود: من سبب تو هستم، پس بر من اعتماد کن و توکل نما، چنانکه وارد شده است: **وَعَلَى اللهِ فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ** (و بر خدا توکل کنید اگر مؤمن هستید). پس مرد (کامل) کسی است که اسباب را اثبات کند، زیرا اگر آن‌ها را نفی می‌کرد، نه خدا را می‌شناخت و نه خود را. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **من عرف نفسه عرف ربه** (هر کس خود را شناخت، پروردگارش را شناخت).\n\nو نفرمود ذات پروردگارش را شناخت، زیرا ذات رب (پروردگار) دارای غنای مطلق است. و مقید را کجا رسد به معرفت (المعرفة) مطلق؟ و پروردگار بی‌شک مربوب (پرورده‌شده) را می‌طلبد، پس در آن بوی تقیید (التقييد) است. به این واسطه مخلوق پروردگارش را شناخت. و به همین دلیل به او امر شد که بداند **لا إله إلا هو** (هیچ معبودی جز او نیست) از جهت الوهیتش، زیرا اله (معبود) مألوه (معبود واقع‌شده) را می‌طلبد، در حالی که ذات حق (الحق) از این اضافه بی‌نیاز است و تقیید نمی‌پذیرد. پس اثبات اسباب، روشن‌ترین دلیل بر معرفت (المعرفة) اثبات‌کننده آن‌ها به پروردگارش است. و هر کس آن‌ها را رفع کند، چیزی را رفع کرده که رفع آن صحیح نیست. بلکه شایسته است که با سبب اول بایستد، که اوست خالق و برپا کننده این اسباب. و کسی که به آنچه اشاره کردیم علم ندارد، نمی‌داند چگونه راه معرفت پروردگارش را با ادب الهی بپیماید. زیرا رفع‌کننده اسباب، بدادب با خداست. و هر کس یکی از والیان خدا را عزل کند، بدادبی کرده و در عزل آن والی دروغ گفته است. پس بنگر که چقدر جاهل است کسی که به اسباب کفر می‌ورزد و به ترک آن‌ها قائل می‌شود. و هر کس آنچه را حق (الحق) مقرر کرده ترک کند، منازع است نه بنده، و جاهل است نه عالم. و ای ولیّ، تو را موعظه می‌کنم که از جاهلان غافل نباشی. و می‌بینم که در همان لحظه، خودت را در ترک اسباب تکذیب می‌کنی. زیرا می‌بینم در وقت سخن گفتن با من درباره ترک اسباب و دور انداختن آن‌ها و عدم التفات به آن‌ها و قول به ترک استعمالشان، تشنگی تو را می‌گیرد، پس کلام مرا رها می‌کنی و به سوی آب می‌شتابی و از آن می‌نوشی تا درد تشنگی را دفع کنی. و همچنین وقتی گرسنه می‌شوی، نان برمی‌داری و می‌خوری. و نهایت کار تو این است که آن را با دستت برنداری تا در دهانت بگذارند، اما وقتی در دهانت قرار گرفت، آن را می‌جوی و می‌بلعی. پس چقدر زود خودت را در حضور من تکذیب کردی! و همچنین وقتی می‌خواهی نگاه کنی، نیازمند باز کردن چشمت هستی، آیا آن را جز به سبب باز کردی؟ و وقتی می‌خواهی دوستت را زیارت کنی، به سوی او می‌شتابی و شتافتن سبب در وصول تو به اوست. پس چگونه اسباب را با اسباب نفی می‌کنی؟ آیا به این جهالت برای خودت راضی می‌شوی؟ پس ادیب الهی و عالم کسی است که آنچه را خدا اثبات کرده، در موضعی که خدا اثبات کرده و بر وجهی که خدا اثبات کرده، اثبات کند. و آنچه را خدا نفی کرده، در موضعی که خدا نفی کرده و بر وجهی که خدا نفی کرده، نفی کند. سپس اگر صالح هستی، خودت را در عبادت پروردگارت تکذیب می‌کنی. آیا عبادت تو سببی در سعادت تو نیست؟ و تو قائل به ترک اسباب هستی، پس چرا عمل را قطع نمی‌کنی؟ من هیچ‌کس را ندیدم، نه رسولی، نه پیامبری، نه ولیّی، نه مؤمنی، نه کافری، نه شقی‌ای و نه سعیدی، که مطلقاً از بردگی اسباب خارج شده باشد. کمترین آن، تنفس است. پس ای ترک‌کننده سبب، نفس نکش! زیرا تنفس سبب حیات توست. پس نفست را حبس کن تا بمیری، و قاتل خود باشی، پس بهشت بر تو حرام شود. و اگر این کار را بکنی، باز هم تحت حکم سبب هستی، زیرا ترک تنفس سبب مرگ توست و مرگ تو به این صورت سبب شقاوت توست. پس از سبب خارج نشدی. گمان نمی‌کنم عاقل باشی اگر گمان کنی آنچه را خدا نصب کرده و به عنوان علامتی مشهود برپا داشته، رفع می‌کنی. و آنچه را از کلام اهل الله تعالی می‌شنوی رها کن، زیرا آنان مقصودشان آن چیزی نبوده که تو توهم کرده‌ای، بلکه تو نادانسته‌ای که آنان از قطع اسباب چه اراده کرده‌اند، همان‌طور که نادانسته‌ای حق (الحق) از وضع اسباب چه اراده کرده است. و من تو را بر شاهراه حق (الحق) افکندم و روشی را که خدا برای بندگانش قرار داده و به آنان امر کرده که بر آن راه بروند، برایت روشن ساختم. پس سلوک کن، **وَعَلَى اللهِ قَصْدُ السَّبِيلِ** (و بر خداست که راه راست را بنمایاند)... **وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ** (و اگر می‌خواست، همه شما را هدایت می‌کرد). و بعد از این:\n\n### [اینکه بنده گاهی حق (الحق) او را در معصیتش برپا می‌دارد و گاهی در طاعتش]\n\nپس بدان که بنده گاهی حق (الحق) او را در معصیتش برپا می‌دارد و گاهی در طاعتش. پس من برای تو بیان می‌کنم که این پذیرش برای هر دو امر از کجا برای بنده حاصل شده است، و رتبه انسان را از عالم بیان می‌کنیم، و اینکه انسان امثالی از جنس خود دارد، در حالی که عالم به تمامیتش مثلی ندارد. و حقایق و اسراری که به این مسئله مربوط می‌شود را بیان خواهیم کرد، پس از آنکه معانی‌ای را که می‌خواهم تفصیل دهم، در نظمی جمع کنیم که برای تو مانند مادر جامع، مختصر و ضابط رؤوس مسائل باشد، تا اگر خواستی آن را برای دیگری بسط دهی، این نظم تو را به چکیده‌های آن آگاه سازد. پس در این باره گفتیم (و از بنده کنایه آوردیم):\n\n> اگر خدا را نافرمانی کند، حقیقتش را وفا کرده است *** و اگر اطاعت کند، طریقه‌اش را وفا کرده است\n> اگر پذیرش (قبول) نبود، هستی (الوجود) برای او نبود *** و خلق، خلقتش (طبیعتش) را به معنا می‌طلبد\n> محال (المحال) اگر بنگری، دلیلی است، پس *** آن را با حجتی برابر مکن، حقیقتش را بدان\n> کون (جهان) نمی‌پذیرد، اما امکان (الإمکان) آن را می‌پذیرد *** پس هر امری به سرشت خود وفا کرده است\n> از این رو، ما از بالا به صورتش فائز شدیم *** این عنایتی از اوست که به خلقتش عطا کرده است\n> اگر برای کون (جهان) مثلی بود، به پاس تکریم *** برایش عقیقه می‌کرد تا از جودش به او بخوراند\n> اما او (کون) منفرد است و حق (الحق) عین تغذیه ندارد *** پس صورتش را به او نداد.\n\n### [اینکه عالم قبل از حالت وجودش، ممکن بود و محال نبود]\n\nبدان، خداوند تو را توفیق دهد ای ولیّ صمیمی، که عالم چون ممکن (الممكن) بود و قبل از حالت وجودش محال (المحال) نبود، و محال وجود را نمی‌پذیرد، پس حقیقت ممکن با پذیرش وجود، با حقیقت محال که آن را نمی‌پذیرد، مخالفت کرد. و چون خداوند عالم را به صورت انسان کبیر (بزرگ) ایجاد کرد و آدم و فرزندانش را خلاصه این عالم قرار داد، به همین دلیل همه اسماء را به او عطا کرد، یعنی تمام اسمائی که متوجه ایجاد عالم بودند، و آن‌ها اسماء الهی هستند که عالم به ذات خود آن‌ها را می‌طلبد، زیرا وجودش از آن‌ها حاصل شده است.\n\nپس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **إن الله خلق آدم على صورته** (خداوند آدم را بر صورت خود آفرید).\n\nزیرا اسماء برای او بود و عالم از آن‌ها موجود شد. پس عالم به تمامیتش انسان کبیر است. و چون خداوند او را با صورت (الهی) گرامی داشت، عالم و امثال، شکر این امر را از انسان طلب کردند. پس عقیقه (قربانی) که خداوند بر هر انسانی قرار داد، شکر این بود که او را به این حالت از وجود اختصاص داده است. و آن را در روز هفتم قرار داد، زیرا در حالتی بود که تغذیه از آن را نمی‌پذیرفت، تا مبادا برای خود تلاش کرده باشد. پس امثال آن را خوردند. و هر انسانی در گرو عقیقه خود است. و شایسته است اگر در بزرگی برای خود عقیقه می‌کند، چیزی از آن نخورد و آن را به مردم اطعام کند. و به همین دلیل، عالم به تمامیتش برای خود عقیقه نکرد، اگرچه بر صورت (الهی) است، زیرا کسی نیست که عقیقه او را بخورد، چرا که جز خدا و عالم کسی نیست، و کسی که عقیقه برایش انجام شده از آن نمی‌خورد، و حق (الحق) از غذا و خوردن منزه است. و این منزلت جز برای خدا نیست. پس عقیقه عالم بیهوده می‌شد. بنابراین، سبحانه به جای این شکر که عقیقه است، تسبیح به حمد خود را قرار داد، به شکرانه‌ای که از وجود بر صورتش به او ارزانی داشت. پس فرمود: **وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيمًا غَفُورًا** (و هیچ چیز نیست مگر اینکه با ستایش او تسبیح می‌گوید، ولی شما تسبیح آن‌ها را نمی‌فهمید. او بردبار و آمرزنده است). پس به عنایت ازلی‌اش به ما، وجود بر صورت (الهی) را به ما عطا کرد، اما سوره (منزلت) او را به ما نداد، زیرا منزلت او ربوبیت است و منزلت ما مربوبیت. و به همین دلیل گفتیم که عالم برای خود عقیقه نمی‌کند و قربانی نمی‌دهد، زیرا کسی آن را نمی‌خورد و این برای حق (الحق) شایسته نیست. پس عقیقه او تسبیح به حمد او بود، زیرا تسبیح برای او شایسته است. و چون طبیعت ممکن، وجود را پذیرفت، پس در عینیتش ظاهر شد بعد از آنکه نبود، آن را خلق نامید که مشتق از خلیقه (طبیعت) است، یعنی طبیعت امر و حقیقت آن، یعنی بر صورت (الهی) که خلیقه اوست، سرشته شده است. و چون خداوند او را بر صورتش ایجاد کرد و برای عبادتش ایجاد کرد، آنچه او را بر آن ایجاد کرد، خلاف چیزی بود که او را برای آن ایجاد کرد. پس فرمود: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ. مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ** (و جن و انس را نیافریدم مگر برای اینکه مرا بپرستند. از آنان روزی نمی‌خواهم و نمی‌خواهم که به من طعام دهند). و این همان چیزی است که در عقیقه به آن اشاره کردیم که سبحانه شایسته نیست که طعام داده شود. پس جن با انس در آنچه برای آن موجود شدند شریک شدند، نه در آنچه بر آن موجود شدند. و چون صورت حق (الحق) اقتضا می‌کند که به دلیل عزتش، مأمور و منهی نباشد، این عزت طبعاً در انسان سرایت کرد. پس انسان ظاهراً و باطناً از جهت صورتش معصیت کرد، زیرا او بر صورت کسی است که امر و نهی و جبر را نمی‌پذیرد. آیا نمی‌بینی که ابلیس چون بر صورت (الهی) نبود، باطناً معصیت نکرد؟ پس به انسان می‌گوید: **اكْفُرْ** (کافر شو)، و هنگامی که کافر شد، ابلیس می‌گوید: **إِنِّي أَخَافُ اللهَ رَبَّ الْعَالَمِينَ** (من از خدا، پروردگار عالمیان، می‌ترسم). و تنها ظاهراً بر آدم تکبر ورزید و گفت: **أَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا** (آیا برای کسی سجده کنم که او را از گِل آفریدی؟) و گفت: **أَنَا خَيْرٌ مِنْهُ خَلَقْتَنِي مِنْ نَارٍ** (من از او بهترم، مرا از آتش آفریدی). و آتش در روشنایی نوری به نور نزدیک‌تر است، و نور اسمی از اسماء خداست، در حالی که گِل ظلمت محض است. پس گفت: **أَنَا خَيْرٌ مِنْهُ** (من از او بهترم)، یعنی به تو نزدیک‌ترم از این کسی که او را **خَلَقْتَهُ مِنْ طِينٍ** (از گِل آفریدی). و ابلیس ندانست که خداوند آدم را بر چه سرشتی آفرید، از این جهت که آفرینش او را با دو دست خود به عهده گرفت، همان‌طور که برای صورت الهی که بر آن آفریده شد، شایسته بود. و ابلیس و ملائکه از این امر ذوقی نداشتند. پس همه اعتراض کردند، ملائکه با آنچه گفتند و ابلیس با آنچه گفت. پس معصیت انسان به سبب چیزی است که بر آن آفریده شده، و طاعتش به سبب چیزی است که برای آن آفریده شده است. خداوند تعالی فرمود: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ** (و جن و انس را نیافریدم مگر برای اینکه مرا بپرستند)، یعنی برای عزت من تذلل کنند و منزلت مرا از منزلت خود بشناسند. پس طریقه انسان عبادت است، زیرا او بنده است و بنده مقید به سید خود است، همان‌طور که سید نیز به وجهی مقید به بنده خود است، زیرا او مسود (کسی که بر او آقایی می‌شود) است. و خداوند **غَنِيٌّ عَنِ الْعَالَمِينَ** (از عالمیان بی‌نیاز است). پس ممکن به درجه محال نرسید، اما با پذیرش وجود که صفتی الهی است، بر آن فخر کرد. و به درجه وجود مطلق نرسید، زیرا وجودش مستفاد و مقید است. پس هنگامی که به محال و درجه آن نگاه می‌کند و به آنچه از پروردگارش از وجود به او رسیده و در خود پذیرش و امتیاز از محال را می‌بیند، کبریا او را درمی‌یابد، پس معصیت می‌کند و می‌گوید: **أَنَا رَبُّكُمُ الْأَعْلَى** (من پروردگار برتر شما هستم) و ادعای الوهیت می‌کند، در حالی که هیچ‌کس از جن چنین ادعایی نکرده است. و هنگامی که به افتقار خود به واجب الوجود و استفاده وجود از او و منت او بر خود می‌نگرد، شکر بر او واجب می‌شود، پس ذلیل می‌شود و پروردگارش را اطاعت می‌کند. پس طاعتش از وجهی است که برای آن آفریده شده، و معصیتش از وجهی است که بر آن آفریده شده، و شهود (الشهود) او نسبت به محال که این مرتبه را ندارد. پس اگر محال مرتبه سومی نبود، ممکن بر کسی فخر نمی‌فروخت، زیرا شیء بر خود فخر نمی‌فروشد و نیازمند بر کسی که به او نیازمند است فخر نمی‌فروشد. پس تصور نمی‌شد که معصیتی از ممکن سر بزند. پس بنگر که حقایق چه آثار شگفت‌انگیزی را عطا می‌کنند. و حمد و سپاس خدا را که آنچه را نمی‌دانستیم به ما آموخت و آنچه را نمی‌فهمیدیم به ما فهماند، و فضل خدا بر ما عظیم بود. و این مقدار در این باب کافی است. و این منزل شامل است بر:\n\nعلم دعا، علم نبوت، علم خطاب کل در عین واحد، علم زمان، علم تقوا، علم تعدی، علم برهان و ترکیب آن، علم مکارم اخلاق، علم منزلت نفس انسان نزد خدا از غیر، علم عجز، علم ایمان، علم انفاس، علم توکل، علم غیب، علم میزان، علم تقدیس، علم حضرت شک‌ها (حضرة الشكوك)، علم کسی که پس از پلیدی تقدیس شد، علم تکوین، علم تعلیم، علم حیات آخرت، علم اجاره از غیر، علم رحمت، علم شدت، علم سود و زیان، علم مدارک عقول، علم نهایت مطلب، علم امر الهی، علم عالم، علم اقتدار الهی، علم احاطه، و اینکه آیا علم خدا در عالم پایان می‌یابد یا نه. و من کسی را ندیدم که به این قائل باشد مگر یک شخص در مکه که این رأی را داشت، و این مذهبی معروف است اما من قائل به آن را ندیده بودم، زیرا هیچ مذهبی نیست مگر اینکه قائل به آن را دیده‌ام. پس خداوند ما را به راه راست هدایت کند. **وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 4
}