{
  "id": 21,
  "title": {
    "ar": "الباب الحادي والعشرون في معرفة ثلاثة علوم كونية وتوالج بعضها في بعض",
    "en": "Chapter Twenty-One: Concerning the Knowledge of Three Cosmic Sciences (علوم كونية) and the Interpenetration (توالج) of Some of Them into Others.",
    "ur": "باب اکیسواں: تین کونیاتی علوم کی معرفت اور ان کا ایک دوسرے میں داخل ہونا",
    "fa": "باب بیست و یکم در معرفت سه علم کونی و تداخل برخی از آن‌ها در برخی دیگر"
  },
  "content": {
    "ar": "## «الباب الحادي والعشرون في معرفة ثلاثة علوم كونية وتوالج بعضها في بعض»\n\n\n> علم التوالج علم الفكر يصحبه *** علم النتائج فانسبه إلى النظر\n\n\n> هي الأدلة إن حققت صورتها *** مثل الدلالة في الأنثى مع الذكر\n\n\n> على الذي أوقف الإيجاد أجمعه *** على حقيقة كن في عالم الصور\n\n\n> والواو لو لا سكون النون أظهرها *** في العين قائمة تمشي على قدر\n\n\n> فاعلم بأن وجود الكون في فلك *** وفي توجهه في جوهر البشر\n\n\n### [العشق الكوني‏]\n\n\nاعلم أيدك الله أن هذا هو علم التوالد والتناسل وهو من علوم الأكوان وأصله من العلم الإلهي فلنبين لك أولا صورته في الأكوان وبعد ذلك نظهره لك في العلم الإلهي فإن كل علم أصله من العلم الإلهي إذ كان كل ما سوى الله من الله قال الله تعالى وسَخَّرَ لَكُمْ ما في السَّماواتِ وما في الْأَرْضِ جَمِيعاً مِنْهُ فهذا علم التوالج سار في كل شي‏ء وهو علم الالتحام والنكاح ومنه حسي ومعنوي والإلهي فاعلم أنك إذا أردت أن تعلم حقيقة هذا فلتنظره أولا في عالم الحس ثم في عالم الطبيعة ثم في المعاني الروحانية ثم في العلم إلهي فأما في الحس فاعلم أنه إذا شاء الله أن يظهر شخصا بين اثنين ذانك الاثنان هما ينتجانه ولا يصح أن يظهر عنهما ثالث ما لم يقم بهما حكم ثالث وهو أن يفضي أحدهما إلى الآخر بالجماع فإذا اجتمعا على وجه مخصوص وشرط مخصوص وهو أن يكون المحل قابلا للولادة لا يفسد البذر إذا قبله ويكون البذر يقبل فتح الصورة فيه هذا هو الشرط الخاص وأما الوجه المخصوص فهو أن يكون التقاء الفرجين وإنزال الماء أو الريح عن شهوة فلا بد من ظهور ثالث وهو المسمى ولدا والاثنان يسميان والدين وظهور الثالث يسمى ولادة واجتماعهما يسمى نكاحا وسفاحا وهذا أمر محسوس واقع في الحيوان وإنما قلنا بوجه مخصوص وشرط مخصوص فإنه ما يكون عن كل ذكر وأنثى يجتمعان بنكاح ولد ولا بد إلا بحصول ما ذكرناه وسنبينه في المعاني بأوضح من هذا إذ المطلوب ذلك وأما في الطبيعة فإن السماء إذا أمطرت الماء وقبلت الأرض الماء ورَبَتْ وهو حملها وأَنْبَتَتْ من كُلِّ زَوْجٍ بَهِيجٍ وكذلك لقاح النخل والشجر ومن كُلِّ شَيْ‏ءٍ خَلَقْنا زَوْجَيْنِ لأجل التوالد\n\n\n### [العشق في عالم المعاني: استنباط الحكم في العقليات والشرعيات‏]\n\n\nوأما في المعاني فهو أن تعلم أن الأشياء على قسمين مفردات ومركبات وأن العلم بالمفرد يتقدم على العلم بالمركب والعلم بالمفرد يقتنص بالحد والعلم بالمركب يقتنص بالبرهان فإذا أردت أن تعلم وجود العالم هل هو عن سبب أو لا فلتعمد إلى مفردين أو ما هو في حكم المفردين مثل المقدمة الشرطية ثم تجعل أحد المفردين موضوعا مبتدأ وتحمل المفرد الآخر عليه على طريق الإخبار به عنه فتقول كل حادث فهذا المسمى مبتدأ فإنه الذي بدأت به وموضوعا أول فإنه الموضوع الأول الذي وضعته لتحمل عليه ما تخبر به عنه وهو مفرد فإن الاسم المضاف في حكم المفرد ولا بد أن تعلم بالحد معنى الحدوث ومعنى كل الذي أضفته إليه وجعلته له كالسور لما يحيط به فإن كل تقتضي الحصر بالوضع في اللسان فإذا علمت الحادث حينئذ حملت عليه مفردا آخر وهو قولك فله سبب فأخبرت به عنه فلا بد أن تعلم أيضا معنى السبب ومعقوليته في الوضع وهذا هو العلم بالمفردات المقتنصة بالحد فقام من هذين المفردين صورة مركبة كما قامت صورة الإنسان من حيوانية ونطق فقلت فيه حيوان ناطق فتركيب المفردين بحمل أحدهما على الآخر لا ينتج شيئا وإنما هي دعوى يفتقر مدعيها إلى دليل على صحتها حتى يصدق الخبر عن الموضوع بما أخبر به عنه فيؤخذ منا ذلك مسلما إذا كان في دعوى خاصة على طريق ضرب المثال مخافة التطويل وليس كتابي هذا بمحل لميزان المعاني وإنما ذلك موقوف على علم المنطق فإنه لا بد أن يكون كل مفرد معلوما وأن يكون ما يخبر به عن المفرد الموضوع معلوما أيضا إما ببرهان حسي أو بديهي أو نظري يرجع إليهما ثم تطلب مقدمة أخرى تعمل فيها ما عملت في الأولى ولا بد أن يكون أحد المفردين مذكورا في المقدمتين فهي أربعة في صورة التركيب وهي ثلاثة في المعنى لما نذكره إن شاء الله وإن لم يكن كذلك فإنه لا ينتج أصلا فتقول في هذه المسألة التي مثلنا بها في المقدمة الأخرى والعالم حادث وتطلب فيه من العلم بحد المفرد فيها ما طلبته في المقدمة الأولى من معرفة العالم ما هو وحمل الحدوث عليه بقولك حادث وقد كان هذا الحادث الذي هو محمول في هذه المقدمة موضوعا في الأولى حين حملت عليه السبب فتكرر\nالحادث في المقدمتين وهو الرابط بينهما فإذا ارتبطا سمي ذلك الارتباط وجه الدليل وسمي اجتماعهما دليلا وبرهانا فينتج بالضرورة أن حدوث العالم له سبب فالعلة الحدوث والحكم السبب فالحكم أعم من العلة فإنه يشترط في هذا العلم أن يكون الحكم أعم من العلة أو مساويا لها وإن لم يكن كذلك فإنه لا يصدق هذا في الأمور العقلية وأما مأخذها في الشرعيات فإذا أردت أن تعلم مثلا أن النبيذ حرام بهذه الطريقة فتقول كل مسكر حرام والنبيذ مسكر فهو حرام وتعتبر في ذلك ما اعتبرت في الأمور العقلية كما مثلت لك فالحكم التحريم والعلة الإسكار فالحكم أعم من العلة الموجبة للتحريم فإن التحريم قد يكون له سبب آخر غير السكر في أمر آخر كالتحريم في الغصب والسرقة والجناية وكل ذلك علل في وجود التحريم في المحرم فلهذا الوجه المخصوص صدق فقد بان لك بالتقريب ميزان المعاني وأن النتائج إنما ظهرت بالتوالج الذي في المقدمتين اللذين هما كالأبوين في الحس وأن المقدمتين مركبة من ثلاثة أو ما هو في حكم الثلاثة فإنه قد يكون للجملة معنى الواحد في الإضافة والشرط فلم تظهر نتيجة إلا من الفردية إذ لو كان الشفع ولا يصحبه الواحد صحبة خاصة ما صح أن يوجد عن الشفع شي‏ء أبدا فبطل الشريك في وجود العالم وثبت الفعل للواحد وأنه بوجوده ظهرت الموجودات عن الموجودات فتبين لك أن أفعال العباد وإن ظهرت منهم أنه لو لا الله ما ظهر لهم فعل أصلا فجمع هذا الميزان بين إضافة الأعمال إلى العباد بالصورة وإيجاد تلك الأفعال لله تعالى وهو قوله والله خَلَقَكُمْ وما تَعْمَلُونَ أي وخلق ما تعملون فنسب العمل إليهم وإيجاده لله تعالى والخلق قد يكون بمعنى الإيجاد ويكون بمعنى التقدير كما أنه قد يكون بمعنى الفعل مثل قوله تعالى ما أَشْهَدْتُهُمْ خَلْقَ السَّماواتِ ويكون بمعنى المخلوق مثل قوله هذا خَلْقُ الله‏\n\n\n### [العشق في العالم الإلهي‏]\n\n\nوأما هذا التوالج في العلم الإلهي والتوالد فاعلم إن ذات الحق تعالى لم يظهر عنها شي‏ء أصلا من كونها ذاتا غير منسوب إليها أمر آخر وهو أن ينسب إلى هذه الذات أنها قادرة على الإيجاد عند أهل السنة أهل الحق أو ينسب إليها كونها علة وليس هذا مذهب أهل الحق ولا يصح وهذا مما لا يحتاج إليه ولكن كان الغرض في سياقه من أجل مخالفي أهل الحق لنقرر عنده أنه ما نسب وجود العالم لهذه الذات من كونها ذاتا وإنما نسبوا العالم لها بالوجود من كونها علة فلهذا أوردنا مقالتهم ومع هذه النسبة وهي كونه قادرا لا بد من أمر ثالث وهو إرادة الإيجاد لهذه العين المقصودة بأن توجد ولا بد من التوجه بالقصد إلى إيجادها بالقدرة عقلا وبالقول شرعا بأن تتكون فما وجد الخلق إلا عن الفردية لا عن الأحدية لأن أحديته لا تقبل الثاني لأنها ليست أحدية عدد فكان ظهور العالم في العلم الإلهي عن ثلاث حقائق معقولة فسرى ذلك في توالد الكون بعضه عن بعض لكون الأصل على هذه الصورة ويكفي هذا القدر من هذا الباب فقد حصل المقصود بهذا التنبيه فإن هذا الفن في مثل طريق أهل الله لا يحتمل أكثر من هذا فإنه ليس من علوم الفكر هذا الكتاب وإنما هو من علوم التلقي والتدلي فلا يحتاج فيه إلى ميزان آخر غير هذا وإن كان له به ارتباط فإنه لا يخلو عنه جملة واحدة ولكن بعد تصحيح المقدمات من العلم بمفرداتها بالحد الذي لا يمنع والمقدمات بالبرهان الذي لا يدفع بقول الله في هذا الباب لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا فهذا مما كنا بصدده في هذا الباب وهذه الآية وأمثالها أحوجتنا إلى ذكر هذا الفن ومن باب الكشف لم يشتغل أهل الله بهذا الفن من العلوم لتضييع الوقت وعمر الإنسان عزيز ينبغي أن لا يقطعه الإنسان إلا في مجالسة ربه والحديث معه على ما شرعه له والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الخامس عشر والحمد لله‏\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "Chapter Twenty-One: Concerning the Knowledge of Three Cosmic Sciences and the Interpenetration of Some of Them into Others\n\nThe science of interpenetration (علم التوالج) is the science of thought that accompanies it,\nThe science of results, so attribute it to contemplation (النظر).\n\nThey are the proofs (الأدلة) if you verify their form,\nLike the indication (الدلالة) in the female with the male,\n\nUpon Him who made all creation (الإيجاد) dependent\nUpon the Reality of 'Be!' (حقيقة كن) in the world of forms (عالم الصور).\n\nAnd the *Wāw* (و) – were it not for the quiescence of the *Nūn* (ن) – would manifest it\nStanding in the Essence (*al-'Ayn*), proceeding according to measure (قدر).\n\nKnow then that the existence of the cosmos (الكون) is in a sphere (فلك),\nAnd in its orientation within the essence of humanity (جوهر البشر).\n\n### [Cosmic Love]\n\nKnow, may Allah strengthen you, that this is the science of procreation (التوالد) and generation (التناسل), and it is one of the cosmic sciences (علوم الأكوان). Its origin is from the Divine Knowledge (العلم الإلهي). We shall first explain its form within the cosmic realms, and thereafter we shall manifest it for you in the Divine Knowledge. For every science originates from the Divine Knowledge, since everything other than Allah is from Allah. Allah the Exalted said: <<وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ>> (And He has subjected to you whatever is in the heavens and whatever is on the earth – all from Him).\n\nThis science of interpenetration (علم التوالج) is operative in everything. It is the science of conjunction (الالتحام) and coupling (النكاح), and it includes the sensory, the intelligible, and the Divine. Know that if you wish to understand the reality of this, you must first observe it in the sensory world (عالم الحس), then in the world of nature (عالم الطبيعة), then in the spiritual meanings (المعاني الروحانية), and finally in the Divine Knowledge.\n\nAs for the sensory realm, know that when Allah wills to manifest a person between two entities, those two entities produce it. A third entity cannot appear from them unless a third ruling (حكم ثالث) is established between them, which is the ingress of one into the other through intercourse (الجماع). When they unite in a specific manner (وجه مخصوص) and under a specific condition (شرط مخصوص): the condition is that the receptacle (المحل) must be capable of bearing offspring, such that it does not corrupt the seed upon receiving it, and the seed must be capable of having the form opened within it. This is the specific condition. The specific manner is the meeting of the two organs and the emission of water or spirit (الريح) driven by desire (شهوة). Inevitably, a third entity appears, which is called the child (ولدا), and the two are called parents (والدين). The appearance of the third is called birth (ولادة), and their union is called marriage (نكاح) or fornication (سفاح). This is a sensory matter occurring in the animal kingdom.\n\nWe specified \"in a specific manner and under a specific condition\" because not every male and female who unite through coupling necessarily produce a child, unless what we mentioned occurs. We shall explain this more clearly in the realm of Intelligibles (المعاني), as that is the objective.\n\nAs for nature (الطبيعة), when the sky rains water and the earth receives the water and swells (which is its pregnancy), it brings forth <<مِن كُلِّ زَوْجٍ بَهِيجٍ>> (of every delightful pair). Likewise is the pollination (لقاح) of the date palm and trees, <<وَمِن كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ>> (And of everything We created pairs) for the purpose of generation.\n\n### [Love in the World of Intelligibles: Deriving Rulings in Rational and Legal Matters]\n\nAs for the Intelligibles (المعاني), it is that you know that things are of two types: simples (مفردات) and composites (مركبات). Knowledge of the simple precedes knowledge of the composite. Knowledge of the simple is captured by definition (الحد), and knowledge of the composite is captured by demonstration (البرهان).\n\nIf you wish to know whether the existence of the world (العالم) is due to a cause or not, you must resort to two simples, or what is equivalent to two simples, such as a conditional premise. Then you make one of the simples the subject (موضوعاً مبتدأ) and predicate the other simple upon it by way of informing about the subject. So you say: \"Every originated thing (حادث)...\" This is called the subject because it is what you began with, and the first premise because it is the first subject you posited in order to predicate upon it what you inform about it. It is a simple, for the annexed noun is equivalent to a simple. You must know by definition the meaning of origination (الحدوث) and the meaning of \"every\" (كل) which you annexed to it and made for it, like a fence surrounding what it encompasses, for \"every\" necessitates restriction according to linguistic usage.\n\nWhen you know the originated thing, you then predicate another simple upon it, which is your statement: \"...then it has a cause (سبب).\" You have thus informed about the subject by means of this predicate. You must also know the meaning of the cause and its intelligibility in usage. This is the knowledge of simples captured by definition.\n\nFrom these two simples arises a composite form, just as the form of the human arises from animality and speech, so you say of him: \"a rational animal.\" The composition of the two simples by predicating one upon the other does not produce anything; rather, it is merely a claim whose claimant requires proof of its validity so that the information about the subject is verified by what is predicated upon it. This is taken as granted by us when it is in a specific claim used as an example, for fear of prolixity. This book of mine is not the place for the balance of intelligibles (ميزان المعاني); rather, that depends upon the science of logic (علم المنطق).\n\nFor every simple must be known, and what is predicated upon the simple subject must also be known, either by sensory, self-evident, or theoretical demonstration that refers back to the first two. Then you seek another premise in which you do what you did in the first. One of the simples must be mentioned in both premises. Thus, they are four in the form of the composition, but three in meaning, as we shall mention, God willing. If this is not the case, it produces no result whatsoever.\n\nSo, in this issue we used as an example, you say in the other premise: \"And the world is originated.\" You seek in this the knowledge of the definition of the simple, just as you sought in the first premise the knowledge of what the world is, and the predication of origination upon it by your saying \"originated.\" This originated thing, which is the predicate in this premise, was the subject in the first premise when you predicated the cause upon it. Thus, the originated thing is repeated in both premises, and it is the link (الرابط) between them.\n\nWhen they are linked, that linkage is called the aspect of the proof (وجه الدليل), and their combination is called the proof and the demonstration (برهانا). It necessarily results that the origination of the world has a cause. The cause (*al-'Illa*) is origination, and the ruling (*al-Hukm*) is the cause. The ruling is more general than the cause, for it is stipulated in this science that the ruling must be more general than the cause or equal to it. If it is not so, this is not valid in rational matters (الأمور العقلية).\n\nAs for its application in legal matters (الشرعيات), if you wish to know, for example, that date wine (*nabīdh*) is forbidden using this method, you say: \"Every intoxicant is forbidden. Date wine is an intoxicant. Therefore, it is forbidden.\" You consider in this what you considered in rational matters, as I exemplified for you. The ruling is prohibition (التحريم), and the cause is intoxication (الإسكار). The ruling is more general than the cause necessitating prohibition, for prohibition may have another cause besides intoxication in another matter, such as prohibition due to usurpation (*ghasb*), theft, or crime. All of these are causes for the existence of prohibition in the forbidden thing. Due to this specific aspect, the conclusion is valid.\n\nThus, the balance of intelligibles has become clear to you by approximation, and that the results (النتائج) only appeared through the interpenetration (التوالج) present in the two premises, which are like the two parents in the sensory realm. The two premises are composed of three elements, or what is equivalent to three, for the whole may have the meaning of the One in annexation and condition. Therefore, no result appeared except from singularity (الفردية). If there were only the pair (الشفع) without the special companionship of the One, nothing could ever come into existence from the pair. Thus, the partner (الشريك) in the existence of the world is nullified, and the Act (الفعل) is established for the One.\n\nAnd that through His Existence, existents appeared from existents. It has become clear to you that even though the acts of the servants appear from them, were it not for Allah, no act would appear for them at all. This balance combines the attribution of deeds to the servants formally, and the origination (إيجاد) of those acts to Allah the Exalted. This is His saying: <<وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do) – meaning, He created what you do. Thus, the deed is attributed to them, but its origination is attributed to Allah the Exalted. And *al-Khalq* (Creation) may mean origination or it may mean determination/pre-measurement (التقدير), just as it may mean the act, such as His saying: <<مَا أَشْهَدتُّهُمْ خَلْقَ السَّمَاوَاتِ>> (I did not make them witness the creation of the heavens), and it may mean the created thing, such as His saying: <<هَذَا خَلْقُ اللَّهِ>> (This is the creation of Allah).\n\n### [Love in the Divine World]\n\nAs for this interpenetration and generation in the Divine Knowledge (العلم الإلهي), know that the Essence (الذات) of the Real (الحق) the Exalted did not manifest anything whatsoever merely by virtue of being the Essence, without another matter being attributed to it. This other matter is that this Essence is attributed with the capacity for origination (الإيجاد) according to the People of the Sunnah (أهل السنة), the People of the Real (أهل الحق), or that it is attributed with being a cause (*'illa*), though this is not the doctrine of the People of the Real and is invalid. This point is unnecessary, but the purpose of mentioning it is for the sake of those who oppose the People of the Real, so that we may establish with them that the existence of the world is not attributed to this Essence merely by virtue of being the Essence, but rather they attribute the world to it through Existence by virtue of it being a cause. This is why we presented their statement.\n\nYet, along with this attribution—that He is Capable (قادر)—a third matter is necessary: the Will (إرادة) to bring into existence that specific entity (العين المقصودة) intended to exist. And there must be an orientation (التوجه) with the intention (القصد) to bring it into existence by Power (القدرة) rationally, and by the Word (القول) legally, that it should \"Be!\" (تتكون).\n\nThus, Creation (الخلق) only came into existence through Singularity (الفردية), not through Absolute Oneness (الأحدية), because His Absolute Oneness does not accept a second, as it is not a numerical oneness. Therefore, the manifestation of the world in the Divine Knowledge occurred through three intelligible Realities (حقائق معقولة).\n\nThis then flowed into the generation of the cosmos (الكون) one part from another, because the Origin (الأصل) is upon this form. This much suffices for this chapter, for the objective has been achieved by this notification. This discipline, in the way of the People of Allah (أهل الله), cannot bear more than this, for this book is not from the sciences of thought (علوم الفكر), but rather from the sciences of reception (التلقي) and descent (التدلي).\n\nTherefore, it does not require another balance (ميزان) besides this, even though it has a connection to it, for it is not entirely devoid of it. However, this is after correcting the premises by knowing their simples through the definition (الحد) that is not prevented, and the premises through the demonstration (البرهان) that is not repelled, based on Allah’s saying regarding this chapter: <<لَوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا>> (Had there been in them [the heavens and the earth] gods besides Allah, they would have been ruined). This is what we were concerned with in this chapter, and this verse and its likes compelled us to mention this discipline.\n\nFrom the perspective of Unveiling (الكشف), the People of Allah do not occupy themselves with this discipline of sciences, lest they waste time. The life of the human being is precious; one should not spend it except in sitting with one's Lord and conversing with Him according to what He has legislated for him. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\n(End of Volume Fifteen and Praise be to Allah.)",
    "ur": "باب اکیسواں تین کونی علوم کی معرفت میں اور ان میں سے بعض کا بعض میں توالج (توالج) (باہم پیوستگی)۔\n\nعلمِ توالج (توالج) وہ علمِ فکر ہے جو اس کے ساتھ ہوتا ہے،\nعلمِ نتائج (علم النتائج) کو نظر (النظر) کی طرف منسوب کر۔\nیہ وہ دلائل ہیں اگر تو ان کی صورت کو محقق کرے،\nجیسے کہ دلالت ہے مؤنث میں مذکر کے ساتھ۔\nاس ذات پر جس نے تمام ایجاد (الإيجاد) کو موقوف کر دیا،\nعالمِ صور میں \"کُن\" کی حقیقت پر۔\nاور واؤ (و) اگر نون (ن) کا سکون نہ ہوتا تو اسے ظاہر کر دیتا،\nعین (العين) میں قائم جو ایک اندازے پر چلتی ہے۔\nپس جان لے کہ کائنات کا وجود فلک میں ہے،\nاور اس کی توجہ جوہرِ بشر میں ہے۔\n\n[عشقِ کونی]\n\nجان لے، اللہ تیری مدد کرے، کہ یہ توالد (التوالد) اور تناسل (التناسل) کا علم ہے، اور یہ اکوان (الأكوان) کے علوم میں سے ہے۔ اس کی اصل علمِ الٰہی (العلم الإلهي) سے ہے۔ پس ہم پہلے تجھے اکوان میں اس کی صورت بیان کریں گے اور اس کے بعد اسے علمِ الٰہی (العلم الإلهي) میں تیرے لیے ظاہر کریں گے۔ کیونکہ ہر علم کی اصل علمِ الٰہی (العلم الإلهي) سے ہے، اس لیے کہ اللہ کے سوا ہر چیز اللہ کی طرف سے ہے۔ اللہ تعالیٰ نے فرمایا:\n**وَسَخَّرَ لَكُمْ ما في السَّماواتِ وما في الْأَرْضِ جَمِيعاً مِنْهُ**\n(اور اس نے تمہارے لیے مسخر کر دیا جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے، سب اپنی طرف سے)۔\nپس یہ علمِ توالج (التوالج) ہر چیز میں جاری و ساری ہے، اور یہ باہم پیوستگی (الالتحام) اور نکاح کا علم ہے۔ اس میں حسی، معنوی اور الٰہی (الإلهي) پہلو ہیں۔\nپس جان لے کہ اگر تو اس کی حقیقت جاننا چاہے تو پہلے اسے عالمِ حس (الحس) میں دیکھ، پھر عالمِ طبیعت (الطبيعة) میں، پھر معانیِ روحانیہ (المعاني الروحانية) میں، اور پھر علمِ الٰہی (العلم الإلهي) میں۔\nجہاں تک حس (الحس) کا تعلق ہے، تو جان لے کہ جب اللہ کسی شخص کو دو کے درمیان ظاہر کرنا چاہتا ہے، تو وہ دو ہی اسے پیدا کرتے ہیں، اور ان دونوں سے تیسرے کا ظاہر ہونا درست نہیں جب تک کہ ان دونوں میں تیسرے کا حکم قائم نہ ہو جائے، اور وہ یہ ہے کہ ان میں سے ایک جماع کے ذریعے دوسرے کی طرف افضا (پہنچ) کرے۔ پس جب وہ ایک مخصوص طریقے اور ایک مخصوص شرط پر جمع ہوں، اور وہ یہ ہے کہ محل (رحم) ولادت کے قابل ہو، بیج کو قبول کرنے کے بعد اسے خراب نہ کرے، اور بیج میں صورت کے کھلنے کی قبولیت ہو۔ یہ خاص شرط ہے۔\nاور جہاں تک مخصوص طریقے کا تعلق ہے، تو وہ یہ ہے کہ دونوں شرمگاہوں کا ملنا اور شہوت کے ساتھ پانی یا ہوا کا انزال ہو۔ پس لازمی طور پر تیسرے کا ظہور ہوتا ہے جسے ولد (بچہ) کہا جاتا ہے، اور ان دونوں کو والدین کہا جاتا ہے، اور تیسرے کے ظہور کو ولادت کہا جاتا ہے، اور ان کے اجتماع کو نکاح یا سفاح کہا جاتا ہے۔ یہ ایک محسوس امر ہے جو حیوانات میں واقع ہوتا ہے۔\nاور ہم نے جو کہا کہ \"مخصوص طریقے اور مخصوص شرط پر\"، تو اس لیے کہ ہر مذکر اور مؤنث کے نکاح سے ملنے سے لازمی طور پر بچہ پیدا نہیں ہوتا، مگر اس صورت میں جو ہم نے ذکر کی ہے۔ ہم اسے معانی میں اس سے زیادہ واضح طور پر بیان کریں گے، کیونکہ مطلوب وہی ہے۔\nاور جہاں تک طبیعت (الطبيعة) کا تعلق ہے، تو جب آسمان پانی برساتا ہے اور زمین پانی کو قبول کرتی ہے، اور وہ اسے پروان چڑھاتی ہے (جو اس کا حمل ہے)، اور **أَنْبَتَتْ مِنْ كُلِّ زَوْجٍ بَهِيجٍ** (اور ہر خوبصورت جوڑے کو اگاتی ہے)۔ اسی طرح کھجور اور درختوں کا لقاح (پراگندہ ہونا)، اور **وَمِنْ كُلِّ شَيْ‏ءٍ خَلَقْنا زَوْجَيْنِ** (اور ہم نے ہر چیز کے دو جوڑے بنائے) توالد (التوالد) کی خاطر۔\n\n[عشق عالمِ معانی میں: عقلیات اور شرعیات میں حکم کا استنباط]\n\nاور جہاں تک معانی کا تعلق ہے، تو وہ یہ ہے کہ تو جان لے کہ اشیاء دو قسموں پر ہیں: مفردات (اکیلی چیزیں) اور مرکبات (مرکب چیزیں)۔ اور مفرد کا علم مرکب کے علم پر مقدم ہوتا ہے۔ مفرد کا علم حد (الحد) (تعریف) کے ذریعے حاصل کیا جاتا ہے، اور مرکب کا علم برہان (البرهان) (دلیل) کے ذریعے حاصل کیا جاتا ہے۔\nپس اگر تو یہ جاننا چاہے کہ عالم کا وجود کسی سبب سے ہے یا نہیں، تو تجھے دو مفردات یا ان کی طرف رجوع کرنا چاہیے جو دو مفردات کے حکم میں ہوں، جیسے کہ شرطیہ مقدمہ (المقدمة الشرطية)۔ پھر تو مفردین میں سے ایک کو موضوع (مبتدا) بنائے اور دوسرے مفرد کو اس پر محمول کرے، اس کے بارے میں خبر دینے کے طریقے پر۔\nپس تو کہے: \"ہر حادث (حادث)۔\" یہ مسمیٰ مبتدا ہے، کیونکہ تو نے اس سے ابتدا کی ہے، اور یہ پہلا موضوع (موضوعاً أول) ہے، کیونکہ یہ وہ پہلا موضوع ہے جسے تو نے اس پر محمول کرنے کے لیے رکھا ہے جس کی تو اس کے بارے میں خبر دے گا۔ اور یہ مفرد ہے، کیونکہ مضاف اسم مفرد کے حکم میں ہوتا ہے۔\nاور تجھے حد (الحد) کے ذریعے حدوث (الحدوث) کے معنی اور \"ہر\" (کل) کے معنی کو جاننا ضروری ہے، جسے تو نے اس کے ساتھ مضاف کیا اور اس کے لیے بنایا، جیسے کہ وہ حصار جو اسے گھیرتا ہے۔ کیونکہ \"ہر\" (کل) لغت میں وضع کے اعتبار سے حصر کا تقاضا کرتا ہے۔\nپس جب تو حادث (الحادث) کو جان لے، تب تو اس پر دوسرا مفرد محمول کرے گا، اور وہ تیرا یہ قول ہے: \"تو اس کا سبب ہے۔\" پس تو نے اس کے بارے میں خبر دی۔ پس تجھے سبب کے معنی اور وضع میں اس کی معقولیت کو بھی جاننا ضروری ہے۔ اور یہ مفردات کا علم ہے جو حد (الحد) کے ذریعے حاصل کیا جاتا ہے۔\nپس ان دو مفردات سے ایک مرکب صورت قائم ہوئی، جیسے کہ انسان کی صورت حیوانیت اور نطق سے قائم ہوئی، پس تو نے اس کے بارے میں کہا: \"حیوانِ ناطق۔\"\nپس دو مفردات کو ایک کو دوسرے پر محمول کرنے سے ترکیب دینا کوئی نتیجہ پیدا نہیں کرتا، بلکہ یہ صرف ایک دعویٰ ہے جس کے دعویدار کو اس کی صحت پر دلیل کی ضرورت ہوتی ہے، تاکہ موضوع کے بارے میں خبر اس چیز سے سچی ہو جائے جس کی خبر اس کے بارے میں دی گئی ہے۔\nپس ہم سے یہ بات مسلمہ طور پر لی جائے گی اگر یہ کسی خاص دعوے میں مثال دینے کے طریقے پر ہو، طوالت کے خوف سے۔ اور میری یہ کتاب معانی کے میزان (میزان المعانی) کی جگہ نہیں ہے، بلکہ یہ علمِ منطق (علم المنطق) پر موقوف ہے۔\nکیونکہ ضروری ہے کہ ہر مفرد معلوم ہو، اور یہ بھی ضروری ہے کہ جو چیز موضوع مفرد کے بارے میں خبر دی جا رہی ہے وہ بھی معلوم ہو، یا تو حسی برہان (برهان حسي) سے، یا بدیہی (بديهي) سے، یا نظری (نظري) سے جو ان دونوں کی طرف لوٹتا ہے۔\nپھر تو ایک اور مقدمہ (مقدمة) طلب کرے گا جس میں تو وہی عمل کرے گا جو تو نے پہلے میں کیا تھا۔ اور ضروری ہے کہ دو مفردات میں سے ایک دونوں مقدموں میں مذکور ہو، پس ترکیب کی صورت میں وہ چار ہیں، اور معنی میں وہ تین ہیں، جیسا کہ ہم ان شاء اللہ ذکر کریں گے۔ اور اگر ایسا نہ ہو تو وہ بالکل کوئی نتیجہ پیدا نہیں کرے گا۔\nپس تو اس مسئلے میں کہ جس کی ہم نے مثال دی، دوسرے مقدمے میں کہے گا: \"اور عالم حادث ہے،\" اور تو اس میں مفرد کی حد کے علم میں وہی طلب کرے گا جو تو نے پہلے مقدمے میں طلب کیا تھا، یعنی عالم کیا ہے اس کی معرفت، اور اس پر حدوث (الحدوث) کو محمول کرنا تیرے اس قول سے کہ \"حادث ہے۔\"\nاور یہ حادث (الحادث) جو اس مقدمے میں محمول ہے، پہلے میں موضوع تھا، جب تو نے اس پر سبب کو محمول کیا تھا۔ پس حادث دونوں مقدموں میں مکرر ہوا، اور یہی ان دونوں کے درمیان رابطہ (الرابط) ہے۔\nپس جب وہ دونوں مربوط ہو جائیں تو اس ربط کو وجہِ دلیل (وجه الدليل) کہا جاتا ہے، اور ان کے اجتماع کو دلیل (دليل) اور برہان (برهان) کہا جاتا ہے۔ پس لازمی طور پر یہ نتیجہ نکلتا ہے کہ عالم کے حدوث کا سبب ہے۔\nپس علت (العلة) حدوث ہے اور حکم (الحكم) سبب ہے۔ پس حکم (الحكم) علت (العلة) سے زیادہ عام ہے۔ کیونکہ اس علم میں یہ شرط ہے کہ حکم علت سے زیادہ عام ہو یا اس کے مساوی ہو، اور اگر ایسا نہ ہو تو یہ عقلی امور میں سچ نہیں ہو سکتا۔\nاور جہاں تک شرعیات میں اس کے ماخذ کا تعلق ہے، تو اگر تو مثال کے طور پر یہ جاننا چاہے کہ نبیذ حرام ہے اس طریقے سے، تو تو کہے گا: \"ہر نشہ آور چیز حرام ہے، اور نبیذ نشہ آور ہے، پس وہ حرام ہے۔\" اور تو اس میں وہی اعتبار کرے گا جو تو نے عقلی امور میں اعتبار کیا، جیسا کہ میں نے تیرے لیے مثال دی۔\nپس حکم (الحكم) تحریم ہے اور علت (العلة) نشہ آوری (الإسكار) ہے۔ پس حکم (التحریم) اس علت سے زیادہ عام ہے جو تحریم کو واجب کرتی ہے، کیونکہ تحریم کا سبب کسی دوسرے امر میں سکر (نشہ) کے علاوہ بھی ہو سکتا ہے، جیسے غصب، چوری اور جنایت میں تحریم۔ اور یہ سب محرم میں تحریم کے وجود کی علتیں ہیں۔ پس اس مخصوص طریقے کی وجہ سے یہ سچ ہوا۔\nپس تجھ پر تقریب کے ذریعے معانی کا میزان (میزان المعانی) واضح ہو گیا، اور یہ کہ نتائج صرف اس توالج (التوالج) سے ظاہر ہوئے جو ان دو مقدموں میں ہے جو حس (الحس) میں والدین کی طرح ہیں، اور یہ کہ دونوں مقدمے تین یا اس کے حکم میں تین چیزوں سے مرکب ہیں، کیونکہ اضافت اور شرط میں مجموعے کا معنی واحد ہو سکتا ہے۔\nپس کوئی نتیجہ فردیت (الفردية) کے بغیر ظاہر نہیں ہوا، کیونکہ اگر جفت (الشفع) ہوتا اور اس کے ساتھ واحد (الواحد) خاص صحبت کے ساتھ نہ ہوتا، تو جفت سے کبھی کوئی چیز وجود میں نہ آ سکتی۔\nپس عالم کے وجود میں شریک باطل ہو گیا، اور فعل واحد (الواحد) کے لیے ثابت ہوا، اور یہ کہ اس کے وجود سے موجودات، موجودات سے ظاہر ہوئیں۔\nپس تجھ پر واضح ہو گیا کہ اگرچہ بندوں کے افعال ان سے ظاہر ہوتے ہیں، لیکن اگر اللہ نہ ہوتا تو ان کا کوئی فعل بالکل ظاہر نہ ہوتا۔ پس اس میزان نے اعمال کی نسبت بندوں کی طرف صورت کے اعتبار سے اور ان افعال کا ایجاد اللہ تعالیٰ کی طرف کرنے کو جمع کر دیا، اور یہی اس کا قول ہے:\n**وَاللَّهُ خَلَقَكُمْ وَما تَعْمَلُونَ**\n(اور اللہ نے تمہیں پیدا کیا اور جو تم عمل کرتے ہو) یعنی اور اس نے پیدا کیا جو تم عمل کرتے ہو۔ پس عمل کی نسبت ان کی طرف کی اور اس کا ایجاد اللہ تعالیٰ کی طرف کیا۔\nاور خلق (الخلق) کبھی ایجاد (الإيجاد) کے معنی میں ہوتا ہے اور کبھی تقدیر کے معنی میں، جیسا کہ وہ کبھی فعل کے معنی میں ہوتا ہے، جیسے اس کا قول:\n**ما أَشْهَدْتُهُمْ خَلْقَ السَّماواتِ**\n(میں نے انہیں آسمانوں کی تخلیق پر گواہ نہیں بنایا)۔\nاور کبھی مخلوق کے معنی میں ہوتا ہے، جیسے اس کا قول:\n**هذا خَلْقُ اللهِ**\n(یہ اللہ کی مخلوق ہے)۔\n\n[عشق عالمِ الٰہی میں]\n\nاور جہاں تک علمِ الٰہی (العلم الإلهي) میں اس توالج (التوالج) اور توالد (التوالد) کا تعلق ہے، تو جان لے کہ ذاتِ حق (ذات الحق) تعالیٰ سے کوئی چیز بالکل ظاہر نہیں ہوئی اس حیثیت سے کہ وہ صرف ذات ہے، جس کی طرف کوئی دوسرا امر منسوب نہ ہو۔\nاور وہ دوسرا امر یہ ہے کہ اس ذات کی طرف یہ نسبت دی جائے کہ وہ اہل سنت (اہل السنة) اہل حق کے نزدیک ایجاد (الإيجاد) پر قادر ہے، یا اس کی طرف یہ نسبت دی جائے کہ وہ علت (علة) ہے، اور یہ اہل حق کا مذہب نہیں ہے اور نہ ہی یہ درست ہے۔\nاور یہ وہ چیز ہے جس کی ضرورت نہیں تھی، لیکن اسے یہاں لانے کا مقصد اہل حق کے مخالفین کی وجہ سے تھا، تاکہ ہم ان کے نزدیک یہ بات ثابت کر دیں کہ عالم کا وجود اس ذات کی طرف اس حیثیت سے منسوب نہیں کیا گیا کہ وہ ذات ہے، بلکہ انہوں نے عالم کو وجود کے اعتبار سے اس کی طرف اس حیثیت سے منسوب کیا کہ وہ علت (علة) ہے۔ اسی لیے ہم نے ان کا قول نقل کیا۔\nاور اس نسبت کے ساتھ، یعنی اس کا قادر ہونا، ایک تیسرے امر کا ہونا ضروری ہے، اور وہ ہے اس مقصود عین کے ایجاد (الإيجاد) کا ارادہ کہ وہ وجود میں آئے۔ اور عقلی طور پر قدرت کے ذریعے اور شرعی طور پر قول کے ذریعے اس کے ایجاد کی طرف قصد کے ساتھ توجہ ضروری ہے کہ وہ \"کون\" (ہو جا) ہو۔\nپس مخلوق فردیت (الفردية) سے ہی وجود میں آئی، احدیت (الأحدية) سے نہیں، کیونکہ اس کی احدیت (الأحدية) دوسرے کو قبول نہیں کرتی، کیونکہ وہ عددی احدیت نہیں ہے۔\nپس عالم کا ظہور علمِ الٰہی (العلم الإلهي) میں تین معقول حقائق سے ہوا، پس یہ چیز کائنات کے بعض کا بعض سے توالد (التوالد) میں سرایت کر گئی، کیونکہ اصل اسی صورت پر ہے۔\nاور اس باب میں یہ مقدار کافی ہے، کیونکہ اس تنبیہ سے مقصود حاصل ہو گیا ہے۔ کیونکہ یہ فن اہل اللہ کے طریقے میں اس سے زیادہ کی گنجائش نہیں رکھتا، کیونکہ یہ کتاب علومِ فکر (علوم الفكر) میں سے نہیں ہے، بلکہ یہ علومِ تلقی (علوم التلقي) اور تدلی (تدلي) (نزول) میں سے ہے۔\nپس اس میں اس میزان کے علاوہ کسی دوسرے میزان کی ضرورت نہیں، اگرچہ اس کے ساتھ اس کا تعلق ہے، کیونکہ یہ اس سے بالکل خالی نہیں ہے، لیکن مقدمات کی تصحیح کے بعد، جو ان کے مفردات کے علم سے اس حد (الحد) کے ذریعے ہو جو مانع نہ ہو، اور مقدمات اس برہان (البرهان) کے ذریعے ہوں جو دفع نہ ہو، جیسا کہ اللہ کا اس باب میں قول ہے:\n**لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا**\n(اگر آسمان و زمین میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں درہم برہم ہو جاتے)۔\nپس یہ وہ چیز تھی جس کے ہم اس باب میں درپے تھے، اور اس آیت اور اس جیسی آیات نے ہمیں اس فن کے ذکر پر مجبور کیا۔\nاور کشف (الکشف) کے باب سے، اہل اللہ نے علوم کے اس فن میں وقت ضائع کرنے کے لیے مشغولیت اختیار نہیں کی، کیونکہ انسان کی عمر قیمتی ہے، اور انسان کو چاہیے کہ وہ اسے صرف اپنے رب کی مجلس میں اور اس کے ساتھ اس طریقے پر بات چیت میں گزارے جو اس نے اس کے لیے مشروع کیا ہے۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ**\n(اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\nپندرہواں حصہ مکمل ہوا، اور تمام تعریفیں اللہ کے لیے ہیں۔\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "«باب بیست و یکم در معرفت سه علم کونی و درهم‌تنیدگی (توالج) برخی از آن‌ها در برخی دیگر»\n\nعلم درهم‌تنیدگی (توالج)، علم اندیشه است که *** علم نتایج آن را همراهی می‌کند، پس آن را به نظر (استدلال) نسبت ده.\nاگر صورت آن‌ها را محقق سازی، آن‌ها همان ادله‌اند *** مانند دلالت در مؤنث همراه با مذکر.\nبر آن کسی که تمام ایجاد را متوقف ساخت *** بر حقیقت «کُن» در عالم صور.\nو اگر سکون نون نبود، واو آن را آشکار می‌ساخت *** در عین (حقیقت) که ایستاده و بر اندازه‌ای راه می‌رود.\nپس بدان که هستی (وجود) کائنات در فلک است *** و در توجه آن در جوهر بشر.\n\n### [عشق کونی]\n\nبدان، خداوند تو را تأیید کند، که این همان علم توالد و تناسل است و از علوم عوالم هستی (الأکوان) می‌باشد و اصل آن از علم الهی است. پس ابتدا صورت آن را در عوالم هستی برای تو بیان می‌کنیم و پس از آن، آن را در علم الهی آشکار می‌سازیم؛ زیرا اصل هر علمی از علم الهی است، چرا که هر آنچه غیر خداست، از خداست. خداوند متعال می‌فرماید: «وَسَخَّرَ لَكُمْ ما فِي السَّماواتِ وَما فِي الْأَرْضِ جَمِيعاً مِنْهُ» (و آنچه در آسمان‌ها و آنچه در زمین است، همه را از جانب خود مسخر شما گردانید). پس این علم درهم‌تنیدگی (توالج) در هر چیزی جاری است و آن علم التیام و نکاح است که شامل حسی، معنوی و الهی می‌شود.\nپس بدان که اگر بخواهی حقیقت این امر را بدانی، باید ابتدا آن را در عالم حس بنگری، سپس در عالم طبیعت، سپس در معانی روحانی (المعاني الروحانية) و سپس در علم الهی.\nاما در عالم حس، بدان که هرگاه خداوند بخواهد شخصی را میان دو نفر آشکار سازد، آن دو نفر هستند که او را تولید می‌کنند و ظهور سومی از آن دو صحیح نیست مگر آنکه حکم سومی در آن‌ها برقرار شود، و آن این است که یکی از آن‌ها با جماع به دیگری بپیوندد. پس هرگاه بر وجهی مخصوص و شرطی مخصوص جمع شوند، که آن شرط این است که محل (رحم) قابلیت ولادت داشته باشد و بذر را پس از پذیرش فاسد نکند، و بذر نیز قابلیت گشودن صورت در خود را بپذیرد؛ این شرط خاص است. و اما وجه مخصوص آن است که التقا و پیوستن دو فرج و انزال آب یا ریح از روی شهوت باشد. در این صورت، ناگزیر سومی ظهور می‌یابد که «ولد» نامیده می‌شود و آن دو «والدین» نامیده می‌شوند و ظهور سومی «ولادت» و اجتماع آن دو «نکاح» یا «سفاح» نامیده می‌شود. این امری محسوس است که در حیوان واقع می‌شود. و ما از این رو گفتیم «به وجه مخصوص و شرط مخصوص» که از هر نر و ماده‌ای که با نکاح جمع شوند، لزوماً فرزندی به وجود نمی‌آید مگر با حصول آنچه ذکر کردیم، و ما این را در معانی به شکلی واضح‌تر بیان خواهیم کرد، زیرا مطلوب همین است.\nو اما در طبیعت، هنگامی که آسمان آب را بباراند و زمین آب را بپذیرد و «رَبَتْ» (بزرگ شود) که همان حمل زمین است، و «أَنْبَتَتْ مِنْ كُلِّ زَوْجٍ بَهِيجٍ» (و از هر جفت دل‌انگیزی برویاند). و همچنین است گرده‌افشانی نخل و درختان، و «وَمِنْ كُلِّ شَيْ‏ءٍ خَلَقْنا زَوْجَيْنِ» (و از هر چیزی دو جفت آفریدیم) به خاطر توالد.\n\n### [عشق در عالم معانی: استنباط حکم در عقلیات و شرعیات]\n\nو اما در معانی، آن است که بدانی اشیاء بر دو قسم‌اند: مفردات و مرکبات. و علم به مفرد بر علم به مرکب مقدم است. علم به مفرد با حد (الحد) به دست می‌آید و علم به مرکب با برهان (البرهان) به دست می‌آید.\nپس اگر بخواهی بدانی که آیا هستی (وجود) عالم از سببی است یا خیر، باید به دو مفرد یا آنچه در حکم دو مفرد است، مانند مقدمه شرطیه، روی آوری. سپس یکی از مفردات را موضوع (مبتدأ) قرار دهی و مفرد دیگر را بر آن حمل کنی به طریق خبر دادن از آن. پس می‌گویی: «هر حادثی...» این همان است که مبتدأ نامیده می‌شود، زیرا با آن آغاز کرده‌ای، و موضوع اول است، زیرا موضوع اولی است که آن را قرار داده‌ای تا آنچه را که با آن خبر می‌دهی بر آن حمل کنی. و این مفرد است، زیرا اسم مضاف در حکم مفرد است. و ناگزیر باید با حد (الحد) معنای حدوث و معنای «هر» را که به آن اضافه کرده‌ای و برای آن قرار داده‌ای، بدانی؛ مانند حصاری برای آنچه آن را احاطه می‌کند، زیرا «هر» به وضع در زبان، حصر را اقتضا می‌کند.\nپس هنگامی که حادث را دانستی، آنگاه مفرد دیگری را بر آن حمل می‌کنی و آن این قول توست: «پس برای آن سببی است». و با آن از آن خبر داده‌ای. پس ناگزیر باید معنای سبب و معقولیت آن را در وضع نیز بدانی. و این همان علم به مفرداتی است که با حد به دست می‌آیند.\nپس از این دو مفرد، صورتی مرکب پدید آمد، همان‌گونه که صورت انسان از حیوانیت و نطق پدید آمد و گفتی: «حیوان ناطق».\nپس ترکیب دو مفرد با حمل یکی بر دیگری، چیزی را نتیجه نمی‌دهد، بلکه صرفاً ادعایی است که مدعی آن نیازمند دلیل بر صحت آن است تا خبر از موضوع با آنچه از آن خبر داده شده، تصدیق شود. پس این امر از ما مسلّم گرفته می‌شود، اگر در ادعایی خاص و به طریق مثال‌آوری باشد، از ترس طولانی شدن کلام. و این کتاب من جایگاه میزان معانی (منطق) نیست، بلکه آن موقوف بر علم منطق است.\nزیرا لازم است که هر مفردی معلوم باشد و آنچه با آن از مفرد موضوع خبر داده می‌شود نیز معلوم باشد، یا با برهان حسی یا بدیهی یا نظری که به آن دو بازگردد.\nسپس مقدمه دیگری را طلب می‌کنی و در آن همان کاری را انجام می‌دهی که در اولی انجام دادی. و لازم است که یکی از مفردات در هر دو مقدمه ذکر شده باشد. پس در صورت ترکیب، چهار چیز است و در معنا سه چیز، به دلیل آنچه ان‌شاءالله ذکر خواهیم کرد. و اگر چنین نباشد، اصلاً نتیجه‌ای حاصل نمی‌شود.\nپس در این مسئله‌ای که مثال زدیم، در مقدمه دیگر می‌گویی: «و عالم حادث است». و در آن از علم به حد مفرد، همان را می‌طلبی که در مقدمه اول طلبیدی، یعنی معرفت به اینکه عالم چیست و حمل حدوث بر آن با قول تو: «حادث است». و این حادث که محمول در این مقدمه است، در مقدمه اول موضوع بود، هنگامی که سبب را بر آن حمل کردی. پس حادث در دو مقدمه تکرار شد و آن رابط میان آن دو است. هنگامی که به هم مرتبط شدند، آن ارتباط «وجه الدلیل» نامیده می‌شود و اجتماع آن دو «دلیل» و «برهان» نامیده می‌شود. پس بالضروره نتیجه می‌دهد که حدوث عالم سببی دارد.\nپس علت (العلة) حدوث است و حکم (الحكم) سبب است. پس حکم اعم از علت است. زیرا در این علم شرط است که حکم اعم از علت یا مساوی با آن باشد، و اگر چنین نباشد، این امر در امور عقلی صادق نیست.\nو اما مأخذ آن در شرعیات: اگر بخواهی مثلاً بدانی که نبیذ حرام است، به این طریق می‌گویی: «هر مسکری حرام است و نبیذ مسکر است، پس حرام است». و در این امر همان را در نظر می‌گیری که در امور عقلی در نظر گرفتی، همان‌گونه که برایت مثال زدم. پس حکم، تحریم است و علت، اسکار (مست‌کنندگی). پس حکم اعم از علتِ موجب تحریم است، زیرا تحریم ممکن است در امر دیگری سببی غیر از سکر داشته باشد، مانند تحریم در غصب، سرقت و جنایت. و همه این‌ها علل در وجود تحریم در محرم هستند.\nپس به این وجه مخصوص، صدق حاصل شد.\nبدین ترتیب، میزان معانی (منطق) به طور تقریبی برای تو آشکار شد و اینکه نتایج تنها با درهم‌تنیدگی (التوالج) در دو مقدمه که مانند دو والد در حس هستند، ظاهر شدند. و اینکه دو مقدمه از سه چیز یا آنچه در حکم سه چیز است، مرکب شده‌اند، زیرا ممکن است جمله در اضافه و شرط، معنای واحد داشته باشد.\nپس نتیجه‌ای جز از فردیت (الفردية) ظاهر نشد، زیرا اگر شفع (زوج) وجود داشت و واحد (فرد) همراهی خاصی با آن نمی‌کرد، هرگز صحیح نبود که چیزی از شفع به وجود آید. پس شریک در هستی (وجود) عالم باطل شد و فعل برای واحد (الواحد) ثابت گشت و اینکه با هستی او، موجودات از موجودات ظاهر شدند.\nپس برای تو روشن شد که افعال بندگان، اگرچه از آن‌ها ظاهر می‌شود، اما اگر خدا نبود، اصلاً فعلی از آن‌ها ظاهر نمی‌شد. پس این میزان، جمع کرد میان نسبت دادن اعمال به بندگان از حیث صورت و ایجاد آن افعال برای خداوند متعال. و این همان قول اوست: «وَاللَّهُ خَلَقَكُمْ وَما تَعْمَلُونَ» (و خداوند شما و آنچه را عمل می‌کنید آفرید)؛ یعنی و آنچه را عمل می‌کنید آفرید. پس عمل را به آن‌ها نسبت داد و ایجاد آن را به خداوند متعال. و خلق گاهی به معنای ایجاد است و گاهی به معنای تقدیر، همان‌گونه که گاهی به معنای فعل است، مانند قول خداوند متعال: «ما أَشْهَدْتُهُمْ خَلْقَ السَّماواتِ» (من آن‌ها را بر آفرینش آسمان‌ها گواه نگرفتم) و گاهی به معنای مخلوق است، مانند قول او: «هذا خَلْقُ اللهِ» (این آفرینش خداست).\n\n### [عشق در عالم الهی]\n\nو اما این درهم‌تنیدگی (التوالج) و توالد در علم الهی، پس بدان که ذات حق تعالی (الحق تعالی) اصلاً چیزی از آن حیث که ذات است، از او ظاهر نشده است، مگر آنکه امر دیگری به آن نسبت داده شود، و آن این است که به این ذات نسبت داده شود که قادر بر ایجاد است، نزد اهل سنت و اهل حق؛ یا به آن نسبت داده شود که علت است، و این مذهب اهل حق نیست و صحیح نمی‌باشد. و این امری است که نیازی به آن نیست، اما غرض از آوردن آن به خاطر مخالفان اهل حق بود تا نزد او مقرر کنیم که هستی (وجود) عالم به این ذات از آن حیث که ذات است، نسبت داده نشده، بلکه عالم را به آن از حیث وجود، به عنوان علت نسبت داده‌اند. به همین دلیل ما گفتار آن‌ها را آوردیم.\nو با وجود این نسبت، یعنی قادر بودن او، ناگزیر امر سومی لازم است و آن اراده ایجاد برای این عین مقصود است که موجود شود. و ناگزیر باید با قصد به سوی ایجاد آن با قدرت، از نظر عقلی، و با قول، از نظر شرعی، توجه شود تا «تکون» (موجود) گردد.\nپس خلق جز از فردیت (الفردية) به وجود نیامد، نه از احدیت (الأحدية)، زیرا احدیت او دومی را نمی‌پذیرد، چون احدیت عددی نیست.\nپس ظهور عالم در علم الهی از سه حقیقت معقول بود. و این امر در توالد کائنات از یکدیگر سریان یافت، به دلیل اینکه اصل بر این صورت است.\nو همین مقدار از این باب کافی است، زیرا مقصود با این تنبیه حاصل شد. چرا که این فن در طریقه اهل الله بیش از این را برنمی‌تابد، زیرا این کتاب از علوم فکر نیست، بلکه از علوم تلقی (دریافت) و تدلی (نزدیک شدن) است. پس در آن به میزان دیگری جز این نیاز نیست، اگرچه با آن ارتباط دارد و به طور کلی از آن خالی نیست، اما پس از تصحیح مقدمات از علم به مفردات آن با حدی که مانع نباشد، و مقدمات با برهانی که دفع نشود، به واسطه قول خداوند در این باب: «لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا» (اگر در آسمان و زمین خدایانی جز الله بودند، قطعاً تباه می‌شدند).\nپس این همان چیزی است که ما در این باب در صدد آن بودیم. و این آیه و امثال آن ما را به ذکر این فن نیازمند ساخت.\nو از باب کشف (الکشف)، اهل الله به این فن از علوم مشغول نشدند تا وقت را ضایع نکنند، و عمر انسان عزیز است و شایسته است که انسان آن را جز در همنشینی با پروردگارش و گفتگو با او بر آنچه برایش تشریع کرده است، سپری نکند. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند).\nپایان جزء پانزدهم و الحمد لله.\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 2
}