{
  "id": 65,
  "title": {
    "ar": "الباب الخامس والستون في معرفة الجنة ومنازلها ودرجاتها وما يتعلق بهذا الباب",
    "en": "Chapter Sixty-Five: Concerning the Knowledge of Paradise, its Stations, its Degrees, and what Pertains to this Chapter.",
    "ur": "پینسٹھواں باب: جنت، اس کے منازل اور درجات کی معرفت اور اس باب سے متعلقہ امور کا بیان۔",
    "fa": "باب شصت و پنجم در معرفت بهشت و منازل و درجات آن و آنچه به این باب تعلق دارد"
  },
  "content": {
    "ar": "## (الباب الخامس والستون في معرفة الجنة ومنازلها ودرجاتها وما يتعلق بهذا الباب)\n\n\n(بسم الله الرحمن الرحيم)\n\n\n> مراتب الجنة المحسوسة انقسمت *** إلى منازل والأعمال تطلبها\n\n\n> فكل ذي عمل تجري ركائبه *** به إليها ورسل الله تحجبها\n\n\n> وجنة الاختصاصات التي انفهقت *** للمكرمين جنان الورث تعقبها\n\n\n> نور الكواكب كنا نستضي‏ء بها *** ونورنا اليوم في عدن مكوكبها\n\n\n> لو أن غير صراط العرش مركبنا *** لزال عند ورود الشرع مركبها\n\n\n> فصالح العمل المشروع يظهرها *** نورا ومن ذاته الإجلال يكسبها\n\n\n### [الجنة جنتان: جنة حسية وجنة معنوية]\n\n\nاعلم أيدنا الله وإياك أن الجنة جنتان جنة محسوسة وجنة معنوية والعقل يعقلهما معا كما إن العالم عالمان عالم لطيف وعالم كثيف وعالم غيب وعالم شهادة والنفس الناطقة المخاطبة المكلفة لها نعيم بما تحمله من العلوم والمعارف من طريق نظرها وفكرها وما وصلت إليه من ذلك بالأدلة العقلية ونعيم بما تحمله من اللذات والشهوات مما يناله بالنفس الحيوانية من طريق قواها الحسية من أكل وشرب ونكاح ولباس وروائح ونغمات طيبة تتعلق بها الأسماع وجمال حي في صورة حسنة معشوقة يعطيها البصر في نساء كاعبات ووجوه حسان وألوان متنوعة وأشجار وأنهار كل ذلك تنقله الحواس إلى النفس الناطقة فتلتذ به من جهة طبيعتها ولو لم يلتذ به إلا الروح الحساس الحيواني لا النفس الناطقة لكان الحيوان يلتذ بالوجه الجميل من المرأة المستحسنة والغلام الحسن الوجه والألوان والمصاغ فلما لم نر شيئا من الحيوان يلتذ بشي‏ء من ذلك علمنا قطعا إن النفس الناطقة هي التي تلتذ بجميع ما تعطيه القوة الحسية مما تشاركها في إدراكه الحيوانات ومما لا تشاركها فيه‏\n\n\n### [الجنة المحسوسة خلقت بطالع الأسد والجنة المعنوية من الفرح الإلهي‏]\n\n\nواعلم أن الله خلق هذه الجنة المحسوسة بطالع الأسد الذي هو الإقليد وبرجه هو الأسد وخلق الجنة المعنوية التي هي روح هذه الجنة المحسوسة من الفرح الإلهي من صفة الكمال والابتهاج والسرور فكانت الجنة المحسوسة كالجسم والجنة المعقولة كالروح وقواه ولهذا سماها الحق تعالى الدار الحيوان لحياتها فأهلها يتنعمون فيها حسا ومعنى فالمعنى الذي هو اللطيفة الإنسانية والجنة أيضا أشد تنعما بأهلها الداخلين فيها ولهذا تطلب ملأها من الساكنين وقد ورد في خبر عن النبي صلى الله عليه وسلم أن الجنة اشتاقت إلى بلال وعلي وعمار وسلمان‏\n\n\nفوصفها بالشوق إلى هؤلاء وما أحسن موافقة هذه الأسماء لما في شوقها من المعاني فإن الشوق من المشتاق فيه ضرب ألم لطلب اللقاء وبلال من أبل الرجل من مرضه واستبل ويقال بل الرجل من دائه وبلال معناه وسلمان من السلامة من الآلام والأمراض وعما رأى بعمارتها بأهلها يزول ألمها فإن الله سبحانه يتجلى لعباده فيها فعلي يعلو بذلك التجلي شأنها على النار التي هي أختها حيث فازت بدرجة التجلي والرؤية إذ كانت النار دار حجاب فانظر في موافقة هذه الأسماء الأربعة لصورة حال الجنة حين وصفها بالشوق إلى هؤلاء الأصحاب من المؤمنين‏\n\n\n### [مراتب الناس في نعيم الجنة]\n\n\nوالناس على أربع مراتب في هذه المسألة فمنهم من يشتهي ويشتهي وهم الأكابر من رجال الله من رسول ونبي وولي كامل ومنهم من يشتهي ولا يشتهي وهم أصحاب الأحوال من رجال الله المهيمون في جلال الله الذين غلب معناهم على حسهم وهم دون الطبقة الأولى فإنهم أصحاب أحوال ومنهم من يشتهي ولا يشتهي وهم عصاة المؤمنين ومنهم من لا يشتهي ولا يشتهي وهم المكذبون بِيَوْمِ الدِّينِ والقائلون بنفي الجنة المحسوسة ولا خامس لهؤلاء الأربعة الأصناف‏\n\n\n### [جنات الاختصاص والميراث والأعمال‏]\n\n\nواعلم أن الجنات ثلاث جنات جنة اختصاص إلهي وهي التي يدخلها الأطفال الذين لم يبلغوا حد العمل وحدهم من أول ما يولد إلى أن يستهل صارخا إلى انقضاء ستة أعوام ويعطي الله من شاء من عباده من جنات الاختصاص ما شاء ومن أهلها المجانين الذين ما عقلوا ومن أهلها أهل التوحيد العلمي ومن أهلها أهل الفترات ومن لم تصل إليهم دعوة رسول والجنة الثانية جنة ميراث ينالها كل من دخل الجنة\nممن ذكرنا ومن المؤمنين وهي الأماكن التي كانت معينة لأهل النار لو دخلوها والجنة الثالثة جنة الأعمال وهي التي ينزل الناس فيها بأعمالهم فمن كان أفضل من غيره في وجوه التفاضل كان له من الجنة أكثر وسواء كان الفاضل دون المفضول أ ولم يكن غير أنه فضله في هذا المقام بهذه الحالة فما من عمل من الأعمال إلا وله جنة ويقع التفاضل فيها بين أصحابها بحسب ما تقتضي أحوالهم‏\n\n\nورد في الحديث الصحيح عن النبي صلى الله عليه وسلم أنه قال لبلال يا بلال بم سبقتني إلى الجنة فما وطئت منها موضعا إلا سمعت خشخشتك أمامي فقال يا رسول الله ما أحدثت قط إلا توضأت ولا توضأت إلا صليت ركعتين فقال رسول الله صلى الله عليه وسلم بهما\n\n\nفعلمنا أنها كانت جنة مخصوصة بهذا العمل فكان رسول الله صلى الله عليه وسلم يقول لبلال بم نلت أن تكون مطرقا بين يدي تحجبني من أين لك هذه المسابقة إلى هذه المرتبة فلما ذكر له ذلك قال له صلى الله عليه وسلم بهما فما من فريضة ولا نافلة ولا فعل خير ولا ترك محرم ومكروه إلا وله جنة مخصوصة ونعيم خاص يناله من دخلها\n\n\n### [مراتب التفاضل في الأعمال والطاعات‏]\n\n\nوالتفاضل على مراتب فمنها بالسن ولكن في الطاعة والإسلام فيفضل الكبير السن على الصغير السن إذا كانا على مرتبة واحدة من العمل بالسن فإنه أقدم منه فيه ويفضل أيضا بالزمان فإن العمل في رمضان وفي يوم الجمعة وفي ليلة القدر وفي عشر ذي الحجة وفي عاشوراء أعظم من سائر الأزمان وكل زمان عينه الشارع وتقع المفاضلة بالمكان كالمصلي في المسجد الحرام أفضل من صلاة المصلي في مسجد المدينة وكذلك الصلاة في مسجد المدينة أفضل من الصلاة في المسجد الأقصى وهكذا فضل الصلاة في المسجد الأقصى على سائر المساجد ويتفاضلون أيضا بالأحوال فإن الصلاة في الجماعة في الفريضة أفضل من صلاة الشخص وحده وأشباه هذا ويتفاضلون بالأعمال فإن الصلاة أفضل من إماطة الأذى وقد فضل الله الأعمال بعضها على بعض ويتفاضلون أيضا في نفس العمل الواحد كالمتصدق على رحمه فيكون صاحب صلة رحم وصدقة والمتصدق على غير رحمه دونه في الأجر وكذلك من أهدى هدية لشريف من أهل البيت أفضل ممن أهدى لغير شريف أو بره أو أحسن إليه ووجوه المفاضلة كثيرة في الشرع وإن كانت محصورة ولكن أريتك منها أنموذجا تعرف به ما قصدناه بالمفاضلة والرسل عليهم السلام إنما ظهر فضلها في الجنة على غيرها بجنة الاختصاص وأما بالعمل فهم في جنات الأعمال بحسب الأحوال كما ذكرنا وكل من فضل غيره ممن ليس في مقامه فمن جنات الاختصاص لا من جنات الأعمال ومن الناس من يجمع في الزمن الواحد أعمالا كثيرة فيصرف سمعه فيما ينبغي في زمان تصريفه بصره في زمان تصريفه يده في زمان صومه في زمان صدقته في زمان صلاته في زمان ذكره في زمان نيته من فعل وترك فيؤجر في الزمن الواحد من وجوه كثيرة فيفضل غيره ممن ليس له ذلك ولذلك لما ذكر رسول الله صلى الله عليه وسلم الثمانية الأبواب من الجنة أن يدخل من أيها شاء\n\n\nقال أبو بكر يا رسول الله وما على الإنسان أن يدخل من الأبواب كلها قال رسول الله صلى الله عليه وسلم أرجو أن تكون منهم يا أبا بكر\n\n\nفأراد أبو بكر بذلك القول ما ذكرنا أن يكون الإنسان في زمان واحد في أعمال كثيرة تعم أبواب الجنة\n\n\n### [النشأة الآخرة والنشأة الدنيا]\n\n\nومن هنا أيضا تعرف النشأة الآخرة فكما لا تشبه الجنة الدنيا في أحوالها كلها وإن اجتمعت في الأسماء كذلك نشأة الإنسان في الآخرة لا تشبه نشأة الدنيا وإن اجتمعتا في الأسماء والصورة الشخصية فإن الروحانية على نشأة الآخرة أغلب من الحسية وقد ذقناه في هذه الدار الدنيا مع كثافة هذه النشأة فيكون الإنسان بعينه في أماكن كثيرة وأما عامة الناس فيدركون ذلك في المنام‏\n\n\n### [رؤيا ابن عربي الكعبة مبنية بلبن فضة وذهب‏]\n\n\nولقد رأيت رؤيا لنفسي في هذا النوع وأخذتها بشرى من الله فإنها مطابقة لحديث نبوي عن رسول الله صلى الله عليه وسلم حين ضرب لنا مثله في الأنبياء عليهم السلام‏\n\n\nفقال صلى الله عليه وسلم مثلي في الأنبياء كمثل رجل بنى حائطا فأكمله إلا لبنة واحدة فكنت أنا تلك اللبنة فلا رسول بعدي ولا نبي‏\n\n\nفشبه النبوة بالحائط والأنبياء باللبن التي قام بها هذا الحائط وهو تشبيه في غاية الحسن فإن مسمى الحائط هنا المشار إليه لم يصح ظهوره إلا باللبن فكان صلى الله عليه وسلم خاتم النبيين فكنت بمكة سنة تسع وتسعين وخمسمائة أرى فيما يرى النائم الكعبة مبنية بلبن فضة وذهب لبنة فضة ولبنة ذهب وقد كملت بالبناء وما بقي فيها شي‏ء وأنا أنظر إليها وإلى حسنها فالتفت إلى الوجه الذي بين الركن اليماني والشامي هو إلى الركن الشامي أقرب فوجدت موضع لبنتين لبنة فضة ولبنة ذهب ينقص من الحائط في الصفين في الصف‏\nالأعلى ينقص لبنة ذهب وفي الصف الذي يليه ينقص لبنة فضة فرأيت نفسي قد انطبعت في موضع تلك اللبنتين فكنت أنا عين تينك اللبنتين وكمل الحائط ولم يبق في الكعبة شي‏ء ينقص وأنا واقف أنظر واعلم إني واقف واعلم إني عين تينك اللبنتين لا أشك في ذلك وأنهما عين ذاتي واستيقظت فشكرت الله تعالى وقلت متأولا إني في الاتباع في صنفي كرسول الله صلى الله عليه وسلم في الأنبياء عليهم السلام وعسى أن أكون ممن ختم الله الولاية بي وما ذلِكَ عَلَى الله بِعَزِيزٍ وذكرت حديث النبي صلى الله عليه وسلم في ضربه المثل بالحائط وأنه كان تلك اللبنة فقصصت رؤياى على بعض علماء هذا الشأن بمكة من أهل توزر فأخبرني في تأويلها بما وقع لي وما سميت له الرائي من هو فالله أسأل أن يتمها علي بكرمه فإن الاختصاص الإلهي لا يقبل التحجير ولا الموازنة ولا العمل وإن ذلِكَ من فَضْلِ الله يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ‏\n\n\n### [جنات الأعمال: درجاتها ومنازلها]\n\n\nواعلم أن جنة الأعمال مائة درجة لا غير كما إن النار مائة درك غير أن كل درجة تنقسم إلى منازل فلنذكر من منازلها ما يكون لهذه الأمة المحمدية وما تفضل به على سائر الأمم فإنها خير أمة أُخْرِجَتْ لِلنَّاسِ بشهادة الحق في القرآن وتعريفه وهذه المائة درجة في كل جنة من الثمان الجنات وصورتها جنة في جنة وأعلاها جنة عدن وهي قصبة الجنة فيها الكثيب الذي يكون اجتماع الناس فيه لرؤية الحق تعالى وهي أعلى جنة في الجنات هي في الجنات بمنزلة دار الملك يدور عليها ثمانية أسوار بين كل سورين جنة فالتي تلي جنة عدن إنما هي جنة الفردوس وهي أوسط الجنات التي دون جنة عدن وأفضلها ثم جنة الخلد ثم جنة النعيم ثم جنة المأوى ثم دار السلام ثم دار المقامة وأما الوسيلة فهي أعلى درجة في جنة عدن وهي لرسول الله صلى الله عليه وسلم حصلت له بدعاء أمته فعل ذلك الحق سبحانه حكمة أخفاها فإنا بسببه نلنا السعادة من الله وبه كنا خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ وبه ختم الله بنا الأمم كما ختم به النبيين وهو صلى الله عليه وسلم بشر كما أمر أن يقول ولنا وجه خاص إلى الله عز وجل نناجيه منه ويناجينا وهكذا كل مخلوق له وجه خاص إلى ربه فأمرنا عن أمر الله أن ندعو له بالوسيلة حتى ينزل فيها وينالها بدعاء أمته فافهم هذا الفضل العظيم وهذا من باب الغيرة الإلهية إن فهمت فلقد كرم الله هذا النبي وهذه الأمة فتحوى درجات الجنة من الدرج فيها على خمسة آلاف درج ومائة درج وخمسة أدراج لا غير وقد تزيد على هذا العدد بلا شك ولكن ذكرنا منها ما اتفق عليه أهل الكشف مما يجري مجرى الأنواع من الأجناس‏\n\n\n### [اختصاصات النبي محمد صَلَّى اللهُ عَليهِ وسَلَّم وأمته في الجنة]\n\n\nوالذي اختصت به هذه الأمة المحمدية على سائر الأمم من هذه الأدراج اثنا عشر درجا لا غير لا يشاركها فيها أحد من الأمم كما\n\n\nفضل صلى الله عليه وسلم غيره من الرسل في الآخرة بالوسيلة وفتح باب الشفاعة وفي الدنيا بست لم يعطها نبي قبله كما ورد في الحديث الصحيح من حديث مسلم بن الحجاج فذكر منها عموم رسالته وتحليل الغنائم والنصر بالرعب وجعلت له الأرض كلها مسجدا وجعلت تربتها له طهورا وأعطى مفاتيح خزائن الأرض‏\n\n\n### [أصناف أهل الجنة الأربعة]\n\n\nثم اعلم أن أهل الجنة أربعة أصناف الرسل وهم الأنبياء والأولياء وهم أتباع الرسل على بصيرة وبينة من ربهم والمؤمنون وهم المصدقون بهم عليهم السلام والعلماء بتوحيد الله إنه لا إله إلا هو من حيث الأدلة العقلية قال الله تعالى شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ وهؤلاء هم الذين أريده بالعلماء وفيهم يقول الله تعالى يَرْفَعِ الله الَّذِينَ آمَنُوا مِنْكُمْ والَّذِينَ أُوتُوا الْعِلْمَ دَرَجاتٍ‏\n\n\n### [الطريق الموصلة إلى العلم بالله‏]\n\n\nوالطريق الموصلة إلى العلم بالله طريقان لا ثالث لهما ومن وحد الله من غير هذين الطريقين فهو مقلد في توحيده (الطريق الواحدة) طريق الكشف وهو علم ضروري يحصل عند الكشف يجده الإنسان في نفسه لا يقبل معه شبهة ولا يقدر على دفعه ولا يعرف لذلك دليلا يستند إليه سوى ما يجده في نفسه إلا أن بعضهم قال يعطي الدليل والمدلول في كشفه فإنه ما لا يعرف إلا بالدليل فلا بد أن يكشف له عن الدليل وكان يقول بهذه المقالة صاحبنا أبو عبد الله بن الكتاني بمدينة فاس سمعت ذلك منه وأخبر عن حاله وصدق وأخطأ في إن الأمر لا يكون إلا كذلك فإن غيره يجد ذلك في نفسه ذوقا من غير أن يكشف له عن الدليل وأما أن يحصل له عن تجل إلهي يحصل له وهم الرسل والأنبياء وبعض الأولياء (و الطريق الثاني) طريق الفكر والاستدلال بالبرهان العقلي وهذا الطريق دون الطريق الأول فإن صاحب النظر في الدليل قد تدخل عليه الشبه القادحة في دليله فيتكلف الكشف عنها والبحث عن وجه الحق في الأمر المطلوب وما ثم طريق ثالث فهؤلاء هم أولو العلم الذين شهدوا بتوحيد\nالله ولفحول هذه الطبقة من العلماء بتوحيد الله دلالة ونظر زيادة علم على التوحيد بتوحيد في الذات بأدلة قطعية لا يعطاها كل أهل الكشف بل بعضهم قد يعطاها\n\n\n### [مقامات أصحاب الجنة في الجنة]\n\n\nوهؤلاء الأربع الطوائف يتميزون في جنات عدن عند رؤية الحق في الكثيب الأبيض وهم فيه على أربعة مقامات طائفة منهم أصحاب منابر وهي الطبقة العليا الرسل والأنبياء والطائفة الثانية هم الأولياء ورثة الأنبياء قولا وعملا وحالا وهم على بينة من ربهم وهم أصحاب الأسرة والعرش والطبقة الثالثة العلماء بالله من طريق النظر البرهاني العقلي وهم أصحاب الكراسي والطبقة الرابعة وهم المؤمنون المقلدون في توحيدهم ولهم المراتب وهم في الحشر مقدمون على أصحاب النظر العقلي وهم في الكثيب عند النظر يتقدمون على المقلدين‏\n\n\n### [تجلى الله لعباده في الزور العام‏]\n\n\nفإذا أراد الله أن يتجلى لعباده في الزور العام نادى منادي الحق في الجنات كلها يا أهل الجنان حي على المنة العظمى والمكانة الزلفى والمنظر الأعلى هلموا إلى زيارة ربكم في جنة عدن فيبادرون إلى جنة عدن فيدخلونها وكل طائفة قد عرفت مرتبتها ومنزلتها فيجلسون ثم يؤمر بالموائد فتنصب بين أيديهم موائد اختصاص ما رأوا مثلها ولا تخيلوه في حياتهم ولا في جناتهم جنات الأعمال وكذلك الطعام ما ذاقوا مثله في منازلهم وكذلك ما تناولوه من الشراب فإذا فرغوا من ذلك خلعت عليهم من الخلع ما لم يلبسوا مثلها فيما تقدم ومصداق ذلك‏\n\n\nقوله صلى الله عليه وسلم في الجنة فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\nفإذا فرغوا من ذلك قاموا إلى كثيب من المسك الأبيض فأخذوا منازلهم فيه على قدر علمهم بالله لا على قدر عملهم فإن العمل مخصوص بنعيم الجنان لا بمشاهدة الرحمن فبينا هم على ذلك إذا بنور قد بهرهم فيخرون سجدا فيسري ذلك النور في أبصارهم ظاهرا وفي بصائرهم باطنا وفي أجزاء أبدانهم كلها وفي لطائف نفوسهم فيرجع كل شخص منهم عينا كله وسمعا كله فيرى بذاته كلها لا تقيده الجهات ويسمع بذاته كلها فهذا يعطيهم ذلك النور فيه يطيقون المشاهدة والرؤية وهي أتم من المشاهدة فيأتيهم رسول من الله يقول لهم تأهبوا لرؤية ربكم جل جلاله فها هو يتجلى لكم فيتأهبون فيتجلى الحق جل جلاله وبينه وبين خلقه ثلاثة حجب حجاب العزة وحجاب الكبرياء وحجاب العظمة فلا يستطيعون نظرا إلى تلك الحجب فيقول الله جل جلاله لأعظم الحجبة عنده ارفعوا الحجب بيني وبين عبادي حتى يروني فترفع الحجب فيتجلى لهم الحق جل جلاله خلف حجاب واحد في اسمه الجميل اللطيف إلى أبصارهم وكلهم بصر واحد فينفهق عليهم نور يسرى في ذواتهم فيكونون به سمعا كلهم وقد أبهتهم جمال الرب وأشرقت ذواتهم بنور ذلك الجمال الأقدس‏\n\n\n### [عود إلى حديث أبي بكر النقاش في مواقف القيامة الخمسين‏]\n\n\nقال رسول الله صلى الله عليه وسلم من حديث النقاش في مواقف القيامة وهذا تمامه فيقول الله جل جلاله سلام عليكم عبادي ومرحبا بكم حياكم الله سلام عليكم من الرحمن الرحيم الحي القيوم طِبْتُمْ فَادْخُلُوها خالِدِينَ طابت لكم الجنة فطيبوا أنفسكم بالنعيم المقيم والثواب من الكريم والخلود الدائم أنتم المؤمنون الآمنون وأنا الله المؤمن المهيمن شققت لكم اسما من أسمائي لا خَوْفٌ عَلَيْكُمْ ولا أَنْتُمْ تَحْزَنُونَ أنتم أوليائي وجيراني وأصفيائي وخاصتي وأهل محبتي وفي داري سلام عليكم يا معشر عبادي المسلمين أنتم المسلمون وأنا السلام وداري دار السلام سأريكم وجهي كما سمعتم كلامي فإذا تجليت لكم وكشفت عن وجهي الحجب فاحمدوني وادخلوا إلى داري غير محجوبين عني بِسَلامٍ آمِنِينَ فردوا علي واجلسوا حولي حتى تنظروا إلي وتروني من قريب فأتحفكم بتحفي وأجيزكم بجوائزي وأخصكم بنوري وأغشيكم بجمالي وأهب لكم من ملكي وأفاكهكم بضحكي وأغلفكم بيدي وأشمكم روحي أنا ربكم الذي كنتم تعبدوني ولم تروني وتحبوني وتخافوني وعزتي وجلالي وعلوي وكبريائي وبهائي وسناى إني عنكم راض وأحبكم وأحب ما تحبون ولكم عندي ما تشتهي أنفسكم وتلذ أعينكم ولكم عندي ما تدعون وما شئتم وكل ما شئتم أشاء فاسألوني ولا تحتشموا ولا تستحيوا ولا تستوحشوا وإني أنا الله الجواد الغني الملي الوفي الصادق وهذه داري قد أسكنتكموها وجنتي قد أبحتكموها ونفسي قد أريتكموها وهذه يدي ذات الندى والطل مبسوطة ممتدة عليكم لا أقبضها عنكم وأنا أنظر إليكم لا أصرف بصري عنكم فاسألوني ما شئتم واشتهيتم فقد آنستكم بنفسي وأنا لكم جليس وأنيس فلا حاجة ولا فاقة بعد هذا ولا بؤس ولا مسكنة ولا ضعف ولا هرم ولا سخط ولا حرج ولا تحويل أبدا سرمدا نعيمكم نعيم الأبد وأنتم الآمنون المقيمون‏\nالماكثون المكرمون المنعمون وأنتم السادة الأشراف الذين أطعتموني واجتنبتم محارمي فارفعوا إلي حوائجكم أقضها لكم وكرامة ونعمة قال فيقولون ربنا ما كان هذا أملنا ولا أمنيتنا ولكن حاجتنا إليك النظر إلى وجهك الكريم أبدا أبدا ورضي نفسك عنا فيقول لهم العلي الأعلى مالك الملك السخي الكريم تبارك وتعالى فهذا وجهي بارز لكم أبدا سرمدا فانظروا إليه وأبشروا فإن نفسي عنكم راضية فتمتعوا وقوموا إلى أزواجكم فعانقوا وأنكحوا وإلى ولائدكم ففاكهوا وإلى غرفكم فادخلوا وإلى بساتينكم فتنزهوا وإلى دوابكم فاركبوا وإلى فرشكم فاتكئوا وإلى جواريكم وسراريكم في الجنان فاستأنسوا وإلى هداياكم من ربكم فأقبلوا وإلى كسوتكم فالبسوا وإلى مجالسكم فتحدثوا ثم قيلوا قائلة لا نوم فيها ولا غائلة في ظل ظليل وأمن مقيل ومجاورة الجليل ثم روحوا إلى نهر الكوثر والكافور والماء المطهر والتسنيم والسلسبيل والزنجبيل فاغتسلوا وتنعموا طوبى لكم وحُسْنُ مَآبٍ ثم روحوا فاتكئوا على الرفارف الخضر والعبقري الحسان والفرش المرفوعة في الظل الممدود والماء المسكوب والفاكهة الكثيرة لا مَقْطُوعَةٍ ولا مَمْنُوعَةٍ ثم تلا رسول الله صلى الله عليه وسلم إِنَّ أَصْحابَ الْجَنَّةِ الْيَوْمَ في شُغُلٍ فاكِهُونَ هُمْ وأَزْواجُهُمْ في ظِلالٍ عَلَى الْأَرائِكِ مُتَّكِؤُنَ لَهُمْ فِيها فاكِهَةٌ ولَهُمْ ما يَدَّعُونَ سَلامٌ قَوْلًا من رَبٍّ رَحِيمٍ ثم تلا هذه الآية أَصْحابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وأَحْسَنُ مَقِيلًا\n\n\n### [رفع الحجاب والتنعم بمشاهدة الذات‏]\n\n\nإلى هنا انتهى حديث أبي بكر النقاش الذي أسندناه في باب القيامة قبل هذا في حديث المواقف ثم إن الحق تعالى بعد هذا الخطاب يرفع الحجاب ويتجلى لعباده فيخرون سجدا فيقول لهم ارفعوا رءوسكم فليس هذا موطن سجوديا عبادي ما دعوتكم إلا لتنعموا بمشاهدتي فيمسكهم في ذلك ما شاء الله فيقول لهم هل بقي لكم شي‏ء بعد هذا فيقولون يا ربنا وأي شي‏ء بقي وقد نجيتنا من النار وأدخلتنا دار رضوانك وأنزلتنا بجوارك وخلعت علينا ملابس كرمك وأريتنا وجهك فيقول الحق جل جلاله بقي لكم فيقولون يا ربنا وما ذاك الذي بقي فيقول دوام رضاي عنكم فلا أسخط عليكم أبدا فما أحلاها من كلمة وما ألذها من بشرى فبدأ سبحانه بالكلام خلقنا فقال كُنْ فأول شي‏ء كان لنا منه السماع فختم بما به بدأ فقال هذه المقالة فختم بالسماع وهو هذه البشرى وتتفاضل الناس في رؤيته سبحانه ويتفاوتون فيها تفاوتا عظيما على قدر علمهم فمنهم ومنهم ثم يقول سبحانه لملائكته ردوهم إلى قصورهم فلا يهتدون لأمرين لما طرأ عليهم من سكر الرؤية ولما زادهم من الخير في طريقهم فلم يعرفوها فلو لا أن الملائكة تدل بهم ما عرفوا منازلهم فإذا وصلوا إلى منازلهم تلقاهم أهلهم من الحور والولدان فيرون جميع ملكهم قد كسي بهاء وجمالا ونورا من وجوههم أفاضوه إفاضة ذاتية على ملكهم فيقولون لهم لقد زدتم نورا وبهاء وجمالا ما تركناكم عليه فيقول لهم أهلهم وكذا كم أنتم قد زدتم من البهاء والجمال ما لم يكن فيكم عند مفارقتكم إيانا فينعم بعضهم ببعض‏\n\n\n### [الراحة المطلقة والرحمة المطلقة في أهل الجنة وفي أهل النار]\n\n\nواعلم أن الراحة والرحمة مطلقة في الجنة كلها وإن كانت الرحمة ليست بأمر وجودي وإنما هي عبارة عن الأمر الذي يلتذ ويتنعم به المرحوم وذلك هو الأمر الوجودي فكل من في الجنة متنعم وكل ما فيها نعيم فحركتهم ما فيها نصب وأعمالهم ما فيها لغوب إلا راحة النوم ما عندهم لأنهم ما ينامون فما عندهم من نعيم النوم شي‏ء ونعيم النوم هو الذي يتنعم به أهل النار خاصة فراحة النوم محلها جهنم ومن رحمة الله بأهل النار في أيام عذابهم خمود النار عنهم ثم تسعر بعد ذلك عليهم فيخف عنهم بذلك من آلام العذاب على قدر ما خبت النار قال تعالى كُلَّما خَبَتْ زِدْناهُمْ سَعِيراً وهذا يدلك أن النار محسوسة بلا شك فإن النار ما تتصف بهذا الوصف إلا من كون قيامها بالأجسام لأن حقيقة النار لا تقبل هذا الوصف من حيث ذاتها ولا الزيادة ولا النقص وإنما هو الجسم المحرق بالنار هو الذي يسجر بالنارية وإن حملنا هذه الآية على الوجه الآخر قلنا قوله تعالى كُلَّما خَبَتْ يعني النار المسلطة على أجسامهم زِدْناهُمْ يعني المعذبين سَعِيراً فإنه لم يقل زدناها ومعنى ذلك أن العذاب ينقلب إلى بواطنهم وهو أشد العذاب الحسي يشغلهم عن العذاب المعنوي فإذا خبت النار في ظواهرهم ووجدوا الراحة من حيث حسهم سلط الله عليهم في بواطنهم التفكر فيما كانوا فرطوا فيه من الأمور التي لو عملوا بها لنالوا السعادة وتسلط عليهم الوهم بسلطانه فيتوهمون عذابا أشد مما كانوا فيه فيكون عذابهم بذلك التوهم في نفوسهم أشد من حلول العذاب المقرون بتسلط النار المحسوسة على أجسامهم وتلك النار التي أعطاها الوهم هي النار الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ\nوهي التي قلنا فيها\n\n\n> النار ناران نار كلها لهب *** ونار معنى على الأرواح تطلع‏\n\n\n> وهي التي ما لها سفع ولا لهب *** لكن لها ألم في القلب ينطبع‏\n\n\n### [من نعيم جنات الاختصاص‏]\n\n\nوكذلك أهل الجنة يعطيهم الله من الأماني والنعيم المتوهم فوق ما هم عليه فما هو إلا أن الشخص منهم يتوهم ذلك أو يتمناه فيكون فيه بحسب ما يتوهمه إن تمناه معنى كان معنى أو توهمه حسا كان محسوسا أي ذلك كان وذلك النعيم من جنات الاختصاص ونعيمها وهو جزاء لمن كان يتوهم هنا ويتمنى أن لو قدر وتمكن أن يكون ممن لا يعصي الله طرفة عين وأن يكون من أهل طاعته وأن يلحق بالصالحين من عباده ولكن قصرت به العناية في الدنيا فيعطي هذا التمني في الجنة فيكون له ما تمناه وتوهمه وأراحه الله في الدنيا من تلك الأعمال الشاقة ولحق في الآخرة بأصحاب تلك الأعمال في الدرجات العلى وقد ثبت عن رسول الله صلى الله عليه وسلم في الرجل الذي لا قوة له ولا مال له فيرى رب المال الموفق يتصدق ويعطي في فك الرقاب ويوسع على الناس ويصل الرحم ويبني المساجد ويعمل أعمالا لا يمكن أن يصل إليها إلا رب المال ويرى أيضا من هو أجلد منه على العبادات التي ليس في قوة جسمه أن يقوم بها ويتمنى أنه لو كان له مثل صاحبه من المال والقوة لعمل مثل عمله قال صلى الله عليه وسلم فهما في الأجر سواء\n\n\nومعنى ذلك أنه يعطي في الجنة مثل ذلك التمني من النعيم الذي أنتجته تلك الأعمال فيكون له ما تمنى وهو أقوى في اللذة والتنعم مما لو وجده في الجنة قبل هذا التمني فلما انفعل عن تمنيه كان النعيم به أعلى فمن جنات الاختصاص ما يخلق الله له من همته وتمنيه فهو اختصاص عن عمل معقول متوهم وتمن لم يكن له وجود ثمرة في الدنيا وهو الذي عنينا بالاختصاص في قولنا\n\n\n> مراتب الجنة مقسومة *** ما بين أعمال وبين اختصاص‏\n\n\n> فيا أولي الألباب سبقا على *** نجب من أعمالكم لا مناص‏\n\n\n> إن بلي لم تعط أطفالنا *** من أثر الأعمال غير الخلاص‏\n\n\n> لأنه لم يك شرعا لهم *** فهو اختصاص ما لديه انتقاص‏\n\n\nفأردنا بالاختصاص الثاني ما لا يكون عن تمن ولا توهم وأردنا بالاختصاص الأول ما يكون عن تمن وتوهم الذي هو جزاء عن تمن وتوهم في الدنيا\n\n\n### [الأماني المذمومة]\n\n\nوأما الأماني المذمومة فهي التي لا يكون لها ثمرة ولكن صاحبها يتنعم بها في الحال كما قيل‏\n\n\n> أماني إن تحصل تكن أحسن المنى *** وإلا فقد عشنا بها زمنا رغدا\n\n\nولكن تكون حسرة في المال وفيها قال الله تعالى وغَرَّتْكُمُ الْأَمانِيُّ حَتَّى جاءَ أَمْرُ الله وفيها يقال أَصْحابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وأَحْسَنُ مَقِيلًا لأنه لا مفاضلة بين الخير والشر فما كان خير أصحاب الجنة أفضل وأحسن إلا من كونه واقعا وجوديا محسوسا فهو أفضل من الخير الذي كان الكافر يتوهمه في الدنيا ويظن أنه يصل إليه بكفره لجهله فلهذا قال فيه خير وأحسن الله فأتى بنية المفاضلة وهي أفعل من كذا فافهم هذا المعنى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## (Chapter Sixty-Five: Concerning the Knowledge of Paradise, its Stations, its Degrees, and Related Matters)\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)\n\nThe sensible degrees of Paradise (الجنة المحسوسة) are divided\nInto stations, and deeds seek them out.\nFor every person of action, his mounts hasten him\nToward it, while the Messengers of Allah veil it.\nAnd the Paradise of Divine Specializations (جنة الاختصاصات) that opened up\nFor the honored ones is followed by the Gardens of Inheritance (جنان الورث).\nWe used to seek light from the light of the stars,\nBut our light today is in the star-filled Garden of Eden.\nIf our vehicle were other than the Path of the Throne (صراط العرش),\nThat vehicle would vanish upon the arrival of the Law (الشرع).\nFor the righteous, legislated deed manifests it as light,\nAnd from its Essence, it gains majesty.\n\n### [Paradise is Two Gardens: A Sensible Garden and an Intelligible Garden]\n\nKnow—may Allah support us and you—that Paradise (الجنة) is two gardens: a sensible garden (جنة محسوسة) and an intelligible garden (جنة معنوية). The intellect comprehends both of them, just as the World (العالم) is two worlds: a subtle world (عالم لطيف) and a dense world (عالم كثيف), a world of the Unseen (عالم غيب) and a world of Witnessing (عالم شهادة). The rational soul (النفس الناطقة), which is addressed and obligated, has enjoyment (نعيم) through the sciences and gnosis (المعارف) it carries, attained through its contemplation and thought, and through what it reaches by means of rational proofs (الأدلة العقلية). It also has enjoyment through the pleasures and desires it attains by means of the animal soul (النفس الحيوانية) through its sensory faculties: eating, drinking, conjugal relations, clothing, fragrances, pleasant melodies that captivate the ears, and living beauty in a lovely, desirable form that sight grants, such as voluptuous women (نساء كاعبات), beautiful faces, diverse colors, trees, and rivers. All of this is conveyed by the senses to the rational soul, which finds pleasure in it due to its nature. If only the sensitive animal spirit (الروح الحساس الحيواني) found pleasure in this, and not the rational soul, then animals would find pleasure in the beautiful face of an attractive woman, a handsome youth, colors, and jewelry. Since we do not see any animal taking pleasure in any of these things, we know with certainty that it is the rational soul that takes pleasure in everything provided by the sensory faculty, both what animals share in perceiving and what they do not share.\n\n### [The Sensible Garden was Created under the Ascendant of Leo, and the Intelligible Garden from the Divine Joy]\n\nKnow that Allah created this sensible Paradise (الجنة المحسوسة) under the ascendant of Leo (طالع الأسد), which is the key (الإقليد), and its sign is Leo. He created the intelligible Paradise (الجنة المعنوية), which is the spirit of this sensible Paradise, from the Divine Joy (الفرح الإلهي), stemming from the Attribute of Perfection (صفة الكمال), delight, and happiness. Thus, the sensible Paradise is like the body, and the intelligible Paradise is like the spirit and its faculties. For this reason, the Real (الحق) Almighty named it the Abode of Life (الدار الحيوان) due to its vitality. Its inhabitants enjoy bliss within it, both sensibly and intelligibly. The intelligible aspect, which is the human subtlety (اللطيفة الإنسانية), and Paradise itself, finds even greater bliss in its inhabitants who enter it. This is why it seeks to be filled with residents. It has been reported in a narration from the Prophet, peace and blessings be upon him, that Paradise longed for Bilal, Ali, Ammar, and Salman.\n\nHe described it as longing (الشوق) for these individuals. How beautifully these names correspond to the meanings inherent in its longing! For longing in the one who longs contains a kind of pain (ألم) due to the desire for encounter. *Bilal* (بلال) derives from the recovery (*aballa*) of a man from his illness (*istaballa*), meaning recovery from his ailment. *Salman* (سلمان) signifies safety (*salāma*) from pains and diseases. As for *Ammar* (عمار), by its being populated (*‘imāra*) with its inhabitants, its pain is removed. For Allah, the Glorious, performs Theophany (يتجلى) for His servants within it. *Ali* (علي) signifies that by this Theophany (التجلي), its rank is elevated above the Fire, which is its sister, as it attained the degree of Theophany and Vision (الرؤية), whereas the Fire is the abode of veiling (حجاب). Reflect upon the correspondence of these four names to the state of Paradise when it was described as longing for these believing Companions.\n\n### [The Degrees of People in the Bliss of Paradise]\n\nPeople fall into four degrees concerning this matter. Among them are those who desire and are desired (يشتهي ويشتهي); these are the great ones among the Men of Allah (رجال الله), such as the Messenger, the Prophet, and the Perfect Saint (ولي كامل). Among them are those who desire but are not desired (يشتهي ولا يشتهي); these are the people of spiritual states (أصحاب الأحوال) among the Men of Allah, those bewildered (المهيمون) in the Majesty of Allah, whose intelligible meaning (معناهم) dominates their senses. They are below the first class, for they are people of states. Among them are those who desire but are not desired (يشتهي ولا يشتهي); these are the disobedient believers (عصاة المؤمنين). And among them are those who neither desire nor are desired (لا يشتهي ولا يشتهي); these are those who deny the Day of Judgment (يَوْمِ الدِّينِ) and those who affirm the non-existence of the sensible Paradise. There is no fifth category to these four types.\n\n### [The Gardens of Specialization, Inheritance, and Deeds]\n\nKnow that the Gardens (الجنات) are three: The Garden of Divine Specialization (جنة اختصاص إلهي), which is entered by children who have not reached the age of accountability for deeds, from the moment they are born crying until the completion of six years. Allah grants whomever He wills among His servants from the Gardens of Specialization (جنات الاختصاص) whatever He wills. Among its inhabitants are the insane who never attained reason, the people of theoretical Monotheism (أهل التوحيد العلمي), the people of the interval periods (أهل الفترات), and those whom the call of a Messenger did not reach. The second Garden is the Garden of Inheritance (جنة ميراث), which is attained by everyone who enters Paradise, both those we mentioned and the believers. These are the places that were designated for the people of the Fire had they entered them. The third Garden is the Garden of Deeds (جنة الأعمال), where people reside according to their actions. Whoever is superior to another in aspects of merit (وجوه التفاضل) will have more of Paradise. It does not matter whether the superior person is below the one he surpasses or not, except that he is favored in this station due to this state. There is no deed among the deeds except that it has a corresponding garden, and the degrees of merit (التفاضل) among its inhabitants occur according to what their states necessitate.\n\nIt is reported in the sound Hadith (الحديث الصحيح) from the Prophet, peace and blessings be upon him, that he said to Bilal, \"O Bilal, by what means have you preceded me to Paradise? I have not trod upon any place in it except that I heard your rustling sound (خشخشتك) before me.\" Bilal replied, \"O Messenger of Allah, I never broke my ablution (أحدثت) except that I performed ablution (توضأت), and I never performed ablution except that I prayed two cycles (ركعتين).\" The Messenger of Allah, peace and blessings be upon him, said, \"By these two.\"\n\nThus, we know that it was a garden specialized for this deed. The Messenger of Allah, peace and blessings be upon him, was asking Bilal, \"By what means did you attain to be a path-breaker (مطرقا) before me, veiling me? From where did you get this precedence to this rank?\" When Bilal mentioned his deeds, the Prophet, peace and blessings be upon him, said to him, \"By these two.\" Therefore, there is no obligatory act (فريضة), supererogatory act (نافلة), good deed, or avoidance of a forbidden or disliked thing, except that it has a specialized garden and a particular bliss (نعيم خاص) attained by the one who enters it.\n\n### [The Degrees of Merit in Deeds and Acts of Obedience]\n\nThe degrees of merit (التفاضل) are based on several levels. One is age, but specifically within obedience and Islam. Thus, the older person is superior to the younger person if they are at the same level of deed, due to the older person’s longer duration in that deed. Merit is also based on time. For instance, a deed performed in Ramadan, on the day of Jumu‘ah (Friday), on the Night of Power (ليلة القدر), during the first ten days of Dhul-Hijjah, or on Ashura, is greater than in other times—any time specified by the Lawgiver (الشارع). Merit also occurs based on place, such as the prayer of one who prays in the Sacred Mosque (المسجد الحرام) being superior to the prayer of one who prays in the Mosque of Medina. Similarly, prayer in the Mosque of Medina is superior to prayer in the Al-Aqsa Mosque, and likewise, prayer in the Al-Aqsa Mosque is superior to all other mosques. They also differ in merit based on states (الأحوال). For example, obligatory prayer in congregation (الجماعة) is superior to the prayer of a person alone, and similar cases. They also differ in merit based on the deeds themselves, for prayer is superior to removing harm from the road (إماطة الأذى). Allah has favored some deeds over others. They also differ in merit within the same deed, such as one who gives charity to his kin (رحمه), thereby combining the reward of maintaining kinship (صلة رحم) and charity, while one who gives charity to non-kin is below him in reward. Similarly, one who gives a gift to a noble person (شريف) from the Prophet’s Household (أهل البيت), or honors him or treats him kindly, is superior to one who gives to a non-noble person. The aspects of merit in the Sacred Law (الشرع) are numerous, though they are finite, but I have shown you a sample (أنموذجا) by which you may understand what we mean by merit. The superiority of the Messengers, peace be upon them, over others in Paradise is manifested only through the Garden of Specialization (جنة الاختصاص). As for deeds, they are in the Gardens of Deeds (جنات الأعمال) according to their states, as we mentioned. Anyone who is superior to another who is not in his station, this superiority stems from the Gardens of Specialization, not the Gardens of Deeds. Among people, there are those who combine many deeds in a single moment: he directs his hearing appropriately at the time he directs his sight, at the time he directs his hand, at the time of his fasting, at the time of his charity, at the time of his prayer, at the time of his remembrance (ذكره), and at the time of his intention (نية) regarding action and omission. Thus, he is rewarded in that single moment from many aspects, thereby surpassing others who do not possess this. This is why, when the Messenger of Allah, peace and blessings be upon him, mentioned the eight gates of Paradise, and that a person may enter through whichever he wishes,\n\nAbu Bakr said, \"O Messenger of Allah, is there any harm if a person enters through all the gates?\" The Messenger of Allah, peace and blessings be upon him, said, \"I hope that you will be one of them, O Abu Bakr.\"\n\nBy that statement, Abu Bakr intended what we mentioned: that a person should be engaged in many deeds simultaneously, encompassing all the gates of Paradise.\n\n### [The Next Life and the Present Life]\n\nFrom this, you also understand the Next Life (النشأة الآخرة). Just as Paradise does not resemble this world (الدنيا) in all its states, even though they share names, so too the formation of the human being in the Next Life does not resemble the formation of this world, even though they share names and the personal form (الصورة الشخصية). For spirituality (الروحانية) is more dominant than sensuality in the formation of the Next Life. We have tasted this even in this worldly abode, despite the density (كثافة) of this formation, where a person can be present in many places simultaneously. As for the common people, they perceive this in sleep (المنام).\n\n### [Ibn Arabi’s Vision of the Ka‘ba Built with Bricks of Silver and Gold]\n\nI saw a vision (رؤيا) concerning myself of this type, and I took it as glad tidings from Allah, for it corresponds to a prophetic Hadith from the Messenger of Allah, peace and blessings be upon him, when he gave us his likeness among the Prophets, peace be upon them.\n\nHe, peace and blessings be upon him, said: \"My likeness among the Prophets is like a man who built a wall and completed it except for one brick. I was that brick, and there is no Messenger after me, nor Prophet.\"\n\nHe likened Prophethood (النبوة) to the wall and the Prophets to the bricks by which this wall stood. This is an exceedingly beautiful analogy, for the designation of the wall referred to here could not be fully manifested except by the bricks. Thus, he, peace and blessings be upon him, was the Seal of the Prophets (خاتم النبيين). I was in Mecca in the year 599 AH (1202 CE), seeing in my sleep the Ka‘ba built with bricks of silver and gold—one silver brick, one gold brick. The construction was complete, and nothing was missing. I was looking at it and its beauty. Then I turned to the side between the Yemeni Corner (الركن اليماني) and the Syrian Corner (الركن الشامي)—it was closer to the Syrian Corner—and I found the place of two missing bricks: one silver brick and one gold brick, missing from the wall in two rows. In the upper row, a gold brick was missing, and in the row below it, a silver brick was missing. I saw myself imprinted in the place of those two bricks, so I was the very essence (عين) of those two bricks. The wall was completed, and nothing was missing from the Ka‘ba. I was standing, looking, and I knew I was standing, and I knew I was the very essence of those two bricks, having no doubt about it, and that they were the essence of my Self (ذاتي). I awoke and thanked Allah Almighty, and I said, interpreting the vision, that in my category of followers (الاتباع), I am like the Messenger of Allah, peace and blessings be upon him, among the Prophets, peace be upon them. And perhaps I am one of those by whom Allah seals the Sainthood (الولاية), and <<وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ>> (And that is not difficult for Allah). I recalled the Hadith of the Prophet, peace and blessings be upon him, where he gave the analogy of the wall and that he was that brick. I recounted my vision to some scholars of this science in Mecca, from the people of Tozeur, and he informed me of its interpretation, which corresponded to what occurred to me, though I did not name the visionary to him. I ask Allah to complete it for me through His generosity, for Divine Specialization (الاختصاص الإلهي) accepts neither restriction, nor comparison, nor deed. And <<إِنَّ ذَلِكَ مِنْ فَضْلِ اللَّهِ يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ>> (Indeed, that is from the favor of Allah; He grants His mercy to whom He wills. And Allah is the Possessor of Great Bounty).\n\n### [The Gardens of Deeds: Their Degrees and Stations]\n\nKnow that the Garden of Deeds (جنة الأعمال) has exactly one hundred degrees (درجة), just as the Fire has one hundred levels (درك). However, each degree is divided into stations (منازل). Let us mention the stations that belong to this Muhammadan Community (الأمة المحمدية) and by which it is favored over all other communities, for it is <<خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ>> (the best community brought forth for mankind), by the testimony and definition of the Real (الحق) in the Quran. These one hundred degrees exist in every one of the eight Gardens, and their form is a garden within a garden. The highest of them is the Garden of Eden (جنة عدن), which is the capital (قصبة) of Paradise. In it is the Dune (الكثيب) where people gather for the Vision (رؤية) of the Real Almighty. It is the highest Garden among the Gardens, holding the rank of the King’s abode among them. Eight walls surround it, and between every two walls is a Garden. The one immediately following the Garden of Eden is the Garden of Firdaws (جنة الفردوس), which is the middle and best of the Gardens below the Garden of Eden. Then comes the Garden of Eternity (جنة الخلد), then the Garden of Bliss (جنة النعيم), then the Garden of Abode (جنة المأوى), then the Abode of Peace (دار السلام), and then the Abode of Residence (دار المقامة). As for the *Wasīlah* (الوسيلة), it is the highest degree in the Garden of Eden, and it belongs to the Messenger of Allah, peace and blessings be upon him, attained by him through the supplication of his Community. The Real, Glorious is He, did this due to a hidden wisdom, for it is through him that we attained happiness from Allah, and through him we were <<خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ>> (the best community brought forth for mankind). Through him, Allah sealed the communities, just as He sealed the Prophets through him. He, peace and blessings be upon him, is a human being (بشر), as he was commanded to say. And we have a special face (وجه خاص) toward Allah, the Mighty and Majestic, from which we secretly converse with Him, and He converses with us. Likewise, every creature has a special face toward its Lord. We were commanded, by the command of Allah, to supplicate for him with the *Wasīlah* so that he may descend into it and attain it through the prayer of his Community. Understand this immense favor. This is from the chapter of Divine Jealousy (الغيرة الإلهية), if you understand. Allah has indeed honored this Prophet and this Community. The degrees of Paradise contain five thousand, one hundred, and five degrees exactly. They may undoubtedly exceed this number, but we have mentioned what the People of Unveiling (أهل الكشف) agree upon, which falls under the category of species within genera.\n\n### [The Specializations of the Prophet Muhammad, peace and blessings be upon him, and his Community in Paradise]\n\nWhat this Muhammadan Community (الأمة المحمدية) is specialized in, over all other communities, among these degrees, are exactly twelve degrees, in which no other community shares. Just as the Prophet, peace and blessings be upon him, was favored over other Messengers in the Hereafter by the *Wasīlah* and the opening of the door of Intercession (الشفاعة), so too in this world, he was given six things that no Prophet before him was given, as reported in the sound Hadith narrated by Muslim ibn al-Hajjaj. Among these six, he mentioned the universality of his message (عموم رسالته), the permissibility of war booty (تحليل الغنائم), victory through awe (النصر بالرعب), the entire earth being made a place of prayer (مسجدا) for him, its dust being made a purifier (طهورا) for him, and his being given the keys to the treasures of the earth.\n\n### [The Four Categories of the People of Paradise]\n\nKnow then that the People of Paradise (أهل الجنة) are four categories: The Messengers (الرسل), who are the Prophets (الأنبياء); The Saints (الأولياء), who are the followers of the Messengers based on insight (بصيرة) and clear proof from their Lord; The Believers (المؤمنون), who are those who affirm the Messengers, peace be upon them; and The Scholars (العلماء) of the Oneness of Allah (توحيد الله)—that there is no god but He—based on rational proofs (الأدلة العقلية). Allah Almighty said: <<شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ>> (Allah bears witness that there is no god but He, and the angels, and those possessed of knowledge). These are the ones I mean by the Scholars. Concerning them, Allah Almighty says: <<يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ>> (Allah will raise those who have believed among you and those who were given knowledge, by degrees).\n\n### [The Path Leading to Knowledge of Allah]\n\nThe path leading to the Knowledge of Allah (العلم بالله) is two paths, and there is no third. Whoever affirms the Oneness of Allah (وحد الله) outside of these two paths is merely an imitator (مقلد) in his affirmation of Oneness. **The First Path** (الطريق الواحدة) is the path of Unveiling (طريق الكشف). This is necessary knowledge (علم ضروري) that occurs upon Unveiling (الكشف); the person finds it within himself, accepting no doubt (شبهة) and being unable to repel it. He knows no proof (دليلا) to rely upon for it other than what he finds within himself. However, some have said that both the proof and the proven are granted in his Unveiling, for what is known only by proof must necessarily be unveiled to him along with the proof. Our companion, Abu Abdullah ibn al-Kattani, in the city of Fez, held this view. I heard this from him, and he spoke truthfully about his own state, but erred in asserting that the matter must always be so. For others find this knowledge within themselves as a direct taste (ذوقا) without the proof being unveiled to them. Alternatively, it may be attained through a Divine Theophany (تجل إلهي), which is the case for the Messengers, the Prophets, and some of the Saints (الأولياء). **The Second Path** (الطريق الثاني) is the path of contemplation (الفكر) and inference through rational demonstration (البرهان العقلي). This path is inferior to the first path, for the one who contemplates the proof may be subject to doubts (الشبه) that invalidate his proof, requiring him to undertake the effort of unveiling them and searching for the true aspect of the desired matter. There is no third path. These are the people of knowledge (أولو العلم) who bore witness to the Oneness of Allah. The masters (فحول) of this class of scholars of the Oneness of Allah, through inference and contemplation, possess an increase in knowledge concerning Oneness—specifically, Oneness in the Essence (توحيد في الذات)—based on definitive proofs (أدلة قطعية), which is not granted to all People of Unveiling, though some of them may be granted it.\n\n### [The Stations of the People of Paradise in Paradise]\n\nThese four groups are distinguished in the Gardens of Eden (جنات عدن) during the Vision of the Real (رؤية الحق) on the White Dune (الكثيب الأبيض). They occupy four stations there: One group consists of the People of the Pulpits (أصحاب منابر), who are the highest class: the Messengers and the Prophets. The second group consists of the Saints (الأولياء), the inheritors of the Prophets in word, deed, and state (حالا), who possess clear proof from their Lord; they are the People of the Couches (الأسرة) and the Throne (العرش). The third class consists of the Scholars of Allah (العلماء بالله) through rational demonstrative contemplation (النظر البرهاني العقلي); they are the People of the Chairs (الكراسي). The fourth class consists of the Believers (المؤمنون) who are imitators (المقلدون) in their affirmation of Oneness; they have their ranks (المراتب). In the Gathering (الحشر), they precede the People of Rational Contemplation, but on the Dune, during the Vision, the People of Rational Contemplation precede the imitators.\n\n### [Allah’s Theophany to His Servants in the General Visit]\n\nWhen Allah desires to perform Theophany (يتجلى) for His servants in the General Visit (الزور العام), the caller of the Real (منادي الحق) announces throughout all the Gardens: \"O People of the Gardens! Hasten to the greatest favor (المنة العظمى), the nearest station (المكانة الزلفى), and the highest sight (المنظر الأعلى)! Come to visit your Lord in the Garden of Eden!\" They rush to the Garden of Eden and enter it. Each group, having recognized its rank and station, sits down. Then, tables are commanded, and tables of specialization (موائد اختصاص) are set before them—tables they have never seen nor imagined in their lives or in their Gardens of Deeds. Likewise, the food is unlike anything they tasted in their stations, and similarly, the drink they partake of. When they finish that, robes (الخلع) are bestowed upon them, the like of which they have never worn before. The confirmation of this is:\n\nHis saying, peace and blessings be upon him, concerning Paradise: \"In it is what no eye has seen, no ear has heard, and what has not occurred to the heart of a human being.\"\n\nWhen they finish this, they proceed to a dune (كثيب) of white musk and take their stations upon it according to their Knowledge of Allah (علمهم بالله), not according to their deeds, for deeds are specific to the bliss of the Gardens, not to the witnessing (مشاهدة) of the All-Merciful. While they are thus, a light overwhelms them, and they fall prostrate. That light permeates their sight outwardly and their inner vision (بصائرهم) inwardly, and all the parts of their bodies, and the subtleties of their souls (لطائف نفوسهم). Consequently, every person among them returns as entirely an eye and entirely an ear. He sees with his entire essence (ذاته كلها), unrestricted by directions (الجهات), and hears with his entire essence. This light grants them the ability to endure the Witnessing (المشاهدة) and the Vision (الرؤية), which is more complete than the Witnessing. Then a Messenger from Allah comes to them and says, \"Prepare yourselves for the Vision of your Lord, Glorious is His Majesty, for behold, He is performing Theophany for you.\" They prepare themselves, and the Real, Glorious is His Majesty, performs Theophany. Between Him and His creation are three veils (حجب): the Veil of Might (حجاب العزة), the Veil of Grandeur (حجاب الكبرياء), and the Veil of Magnificence (حجاب العظمة). They are unable to look at those veils. Then Allah, Glorious is His Majesty, says to the greatest of the veil-keepers near Him, \"Remove the veils between Me and My servants so that they may see Me.\" The veils are lifted, and the Real, Glorious is His Majesty, performs Theophany for them from behind a single veil, in His Beautiful, Subtle Name, directed toward their sights, and all of them become a single sight. A light bursts forth upon them, permeating their essences, and by it, they become entirely hearing. The beauty of the Lord has overwhelmed them, and their essences shine with the light of that Most Holy Beauty.\n\n### [Return to the Hadith of Abu Bakr al-Naqqash concerning the Fifty Stations of the Resurrection]\n\nThe Messenger of Allah, peace and blessings be upon him, said, from the Hadith of Al-Naqqash concerning the Stations of the Resurrection—and this is its completion—that Allah, Glorious is His Majesty, will say: \"Peace be upon you, My servants! Welcome! May Allah grant you life! Peace be upon you from the All-Merciful, the Compassionate, the Living, the Self-Subsisting! <<طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ>> (You have been purified, so enter it eternally). Paradise has been purified for you, so purify yourselves with the everlasting bliss (النعيم المقيم), the reward from the Generous, and eternal permanence. You are the believing, secure ones, and I am Allah, the Believer (المؤمن), the Guardian (المهيمن). I have derived a Name for you from My Names: <<لَا خَوْفٌ عَلَيْكُمْ وَلَا أَنْتُمْ تَحْزَنُونَ>> (No fear will there be upon you, nor will you grieve). You are My allies (أوليائي), My neighbors, My chosen ones (أصفيائي), My intimate ones (خاصتي), and the people of My love, residing in My Abode. Peace be upon you, O assembly of My submitting servants (عبادي المسلمين)! You are the submitters (المسلمون), and I am Peace (السلام), and My Abode is the Abode of Peace (دار السلام). I shall show you My Face just as you have heard My Speech. When I perform Theophany for you and remove the veils from My Face, then praise Me and enter My Abode, un-veiled from Me, <<بِسَلَامٍ آمِنِينَ>> (in peace, secure). Respond to Me and sit around Me so that you may look upon Me and see Me from near. I shall honor you with My gifts, reward you with My prizes, distinguish you with My Light, cover you with My Beauty, bestow upon you from My Dominion, amuse you with My Laughter, embrace you with My Hand, and let you smell My Spirit. I am your Lord whom you used to worship without seeing Me, and whom you loved and feared. By My Might (عزتي) and My Majesty (جلالي), My Loftiness (علوي) and My Grandeur (كبريائي), My Splendor (بهائي) and My Radiance (سناى), I am pleased with you, and I love you and love what you love. You have with Me what your souls desire and what delights your eyes. You have with Me whatever you call for, and whatever you wish—and whatever you wish, I wish. So ask Me, and do not be shy, nor ashamed, nor feel lonely. I am Allah, the Generous (الجواد), the Rich (الغني), the Capable (الملي), the Faithful (الوفي), the Truthful (الصادق). This is My Abode; I have settled you in it. This is My Garden; I have made it permissible for you. And My Self (نفسي); I have shown it to you. And this is My Hand, possessing bounty (الندى) and dew (الطل), outstretched and extended over you; I shall not withdraw it from you. I am looking at you; I shall not turn My gaze away from you. Ask Me whatever you wish and desire. I have made you intimate with My Self, and I am a Companion (جليس) and an Intimate (أنيس) to you. After this, there is no need, no poverty, no misery, no wretchedness, no weakness, no old age, no displeasure, no constraint, and no change, forever and eternally. Your bliss is the bliss of eternity. You are the secure, the resident, the abiding, the honored, the blessed. You are the noble masters who obeyed Me and avoided My prohibitions. Present your needs to Me, and I shall fulfill them for you, as an honor and a blessing.\" The Prophet said: Then they will say, \"Our Lord, this was not our hope nor our wish. Rather, our need is to look upon Your Noble Face forever and ever, and for Your Self to be pleased with us.\" Then the Most High, the Exalted, the Owner of the Dominion, the Generous, the Noble, Blessed and Exalted is He, will say to them: \"This is My Face, manifest to you forever and eternally. Look upon it and rejoice! For My Self is pleased with you. So enjoy yourselves, and go to your wives, embrace them and consummate marriage. Go to your maidservants and amuse yourselves. Enter your chambers. Stroll in your gardens. Ride your mounts. Recline on your couches. Be intimate with your female servants and concubines in the Gardens. Accept your gifts from your Lord. Put on your garments. Converse in your gatherings. Then take a midday rest (قيلولة) in which there is no sleep and no harm, in a deep shade, secure rest, and the proximity of the Majestic (مجاورة الجليل). Then proceed to the River Kawthar, camphor, purified water, Tasnīm, Salsabīl, and Zanjabīl. Wash yourselves and enjoy bliss. Blessed are you, and <<حُسْنُ مَآبٍ>> (an excellent return). Then proceed and recline on green cushions (الرفارف الخضر), beautiful carpets (العبقري الحسان), and raised couches, in extended shade, flowing water, and abundant fruit, <<لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ>> (neither limited nor forbidden).\" Then the Messenger of Allah, peace and blessings be upon him, recited: <<إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ * هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِئُونَ * لَهُمْ فِيهَا فَاكِهَةٌ وَلَهُمْ مَا يَدَّعُونَ * سَلَامٌ قَوْلًا مِنْ رَبٍّ رَحِيمٍ>> (Indeed, the companions of Paradise, that Day, will be busy in enjoyment. They and their spouses will be in shade, reclining on couches. For them therein is fruit, and for them is whatever they request. \"Peace\"—a word from a Merciful Lord). Then he recited this verse: <<أَصْحَابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَأَحْسَنُ مَقِيلًا>> (The companions of Paradise, that Day, will be in a better resting place and a better place for midday rest).\n\n### [The Lifting of the Veil and Enjoyment through Witnessing the Essence]\n\nHere ends the Hadith of Abu Bakr al-Naqqash, which we cited previously in the Chapter on the Resurrection concerning the Hadith of the Stations. Then, after this address, the Real (الحق) Almighty lifts the Veil (الحجاب) and performs Theophany (يتجلى) for His servants, and they fall prostrate. He says to them, \"Raise your heads, My servants, for this is not a place for prostration. I only invited you to enjoy bliss through My Witnessing (مشاهدتي).\" He keeps them in that state for as long as Allah wills. Then He says to them, \"Is there anything left for you after this?\" They reply, \"O our Lord, what could possibly be left? You have saved us from the Fire, admitted us to the Abode of Your Pleasure (دار رضوانك), settled us near You, clothed us in the garments of Your generosity, and shown us Your Face.\" The Real, Glorious is His Majesty, says, \"Something remains for you.\" They ask, \"O our Lord, what is that which remains?\" He says, \"The permanence of My pleasure with you, so that I shall never be displeased with you, ever.\" How sweet is that word, and how delightful is that glad tidings! Glorious is He, He began our creation with Speech, saying, \"Be!\" (كُنْ), so the first thing we received from Him was hearing (السماع). He concluded with that with which He began, by uttering this statement, thus concluding with hearing, which is this glad tidings. People differ in their Vision (رؤيته) of Him, Glorious is He, and they vary greatly in it according to their Knowledge (علمهم). There are those who attain this and those who attain that. Then, Glorious is He, says to His angels, \"Return them to their palaces.\" But they cannot find their way back, due to two things: the intoxication of the Vision (سكر الرؤية) that overcame them, and the increase in goodness they received on their way, so they no longer recognized their homes. Were it not for the angels guiding them, they would not know their stations. When they reach their stations, their families—the houris and the youths (الحور والولدان)—receive them. They see that all their dominion (ملكهم) has been clothed in splendor, beauty, and light emanating from their faces, which they poured forth as an essential emanation (إفاضة ذاتية) upon their dominion. Their families say to them, \"You have increased in light, splendor, and beauty beyond what we left you with.\" Their families reply, \"And likewise, you too have increased in splendor and beauty that was not in you when you parted from us.\" Thus, they enjoy bliss through one another.\n\n### [Absolute Rest and Absolute Mercy for the People of Paradise and the People of the Fire]\n\nKnow that rest (الراحة) and mercy (الرحمة) are absolute throughout Paradise. Although mercy is not an existent thing (أمر وجودي), it is merely an expression for the thing by which the recipient of mercy finds pleasure and bliss, and that thing *is* the existent thing. Thus, everyone in Paradise is in bliss, and everything in it is bliss. Their movement involves no fatigue (نصب), and their deeds involve no weariness (لغوب). However, they do not have the rest of sleep, because they do not sleep, so they have none of the bliss of sleep. The bliss of sleep is enjoyed specifically by the People of the Fire (أهل النار); thus, the place of the rest of sleep is Hell. It is part of Allah’s mercy upon the People of the Fire, during their days of torment, that the Fire subsides (خمود النار) from them, and then it is kindled against them again. This alleviates the pains of the torment for them to the extent that the Fire subsides. Allah Almighty said: <<كُلَّمَا خَبَتْ زِدْنَاهُمْ سَعِيرًا>> (Whenever it subsides, We increase for them the blaze). This indicates to you that the Fire is sensible (محسوسة) without a doubt, for the Fire is only described with this attribute because its existence depends on bodies (الأجسام). The reality of fire, in terms of its Essence (ذاتها), does not accept this attribute, neither increase nor decrease. Rather, it is the body being burned by the fire that is kindled by the fiery nature. If we interpret this verse in another way, we say that His saying, Almighty, <<كُلَّمَا خَبَتْ>> (Whenever it subsides) means the fire imposed upon their bodies, <<زِدْنَاهُمْ>> (We increase them) means the tormented ones, <<سَعِيرًا>> (in blaze), for He did not say, \"We increase *it*.\" The meaning of this is that the torment turns inward to their inner beings, and this is the most severe sensible torment, distracting them from the intelligible torment (العذاب المعنوي). When the fire subsides on their exteriors and they find rest in terms of their senses, Allah imposes upon their inner beings contemplation of the matters they neglected, which, had they acted upon them, would have attained happiness. Imagination (الوهم) is imposed upon them with its authority, so they imagine a torment more severe than what they were in. Thus, their torment through this imagination in their souls is more severe than the occurrence of the torment associated with the imposition of the sensible fire upon their bodies. That fire granted by imagination is the Fire <<الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ>> (which mounts up to the hearts).\n\nConcerning this, we said:\nThe Fire is two fires: a fire entirely of flame,\nAnd a fire of meaning that mounts up to the spirits.\nIt is that which has neither scorching nor flame,\nBut it has a pain imprinted upon the heart.\n\n### [From the Bliss of the Gardens of Specialization]\n\nSimilarly, Allah grants the People of Paradise (أهل الجنة) wishes and imagined bliss (النعيم المتوهم) beyond what they already possess. It is simply that a person among them imagines it or wishes for it, and he finds himself in it according to what he imagines. If he wishes for an intelligible thing, it becomes intelligible; if he imagines a sensible thing, it becomes sensible, whatever that may be. That bliss is from the Gardens of Specialization (جنات الاختصاص) and its enjoyment. It is a reward for one who, in this world, used to imagine and wish that he had the power and ability to be among those who do not disobey Allah for a blink of an eye, to be among the people of His obedience, and to join His righteous servants, but his worldly circumstances (العناية) fell short. This wish is granted to him in Paradise, so he receives what he wished for and imagined. Allah gave him rest from those difficult deeds in the world, yet he joins the people of those deeds in the highest degrees in the Hereafter. It is confirmed from the Messenger of Allah, peace and blessings be upon him, concerning the man who has neither strength nor wealth, who sees the successful wealthy man giving charity, freeing slaves, being generous to people, maintaining kinship, building mosques, and performing deeds that only a wealthy person can achieve. He also sees one who is more vigorous than him in acts of worship that are beyond his physical strength to perform, and he wishes that if he had the wealth and strength of his companion, he would do the same deeds. The Prophet, peace and blessings be upon him, said, \"They are equal in reward.\"\n\nThe meaning of this is that he is granted in Paradise, corresponding to that wish, the bliss produced by those deeds. Thus, he receives what he wished for, and it is stronger in pleasure and enjoyment than if he had found it in Paradise before this wish. Since it was brought into existence by his wish, the bliss derived from it is higher. Part of the Gardens of Specialization is what Allah creates for him from his aspiration (همته) and his wish. This is a specialization based on an intelligible, imagined deed and a wish that had no tangible fruit in the world. This is what we meant by specialization in our poem:\n\nThe degrees of Paradise are divided,\nBetween deeds and between specialization.\nO people of intellects, hasten upon\nNoble mounts of your deeds—there is no escape.\nIf tested, our children are not given\nFrom the effect of deeds anything but salvation.\nBecause it was not a law for them,\nIt is a specialization that has no deficiency.\n\nBy the second specialization (الاختصاص الثاني), we meant that which does not arise from a wish or imagination. By the first specialization (الاختصاص الأول), we meant that which arises from a wish and imagination, which is a reward for a wish and imagination in the world.\n\n### [The Blameworthy Wishes]\n\nAs for the blameworthy wishes (الأماني المذمومة), they are those that bear no fruit, but their possessor enjoys bliss through them immediately, as was said:\n\nWishes, if they are attained, are the best of hopes,\nOtherwise, we have lived a comfortable time by them.\n\nHowever, they result in regret in the end. Concerning them, Allah Almighty said: <<وَغَرَّتْكُمُ الْأَمَانِيُّ حَتَّى جَاءَ أَمْرُ اللَّهِ>> (And [false] hopes deluded you until the command of Allah came). It is concerning this that it is said: <<أَصْحَابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَأَحْسَنُ مَقِيلًا>> (The companions of Paradise, that Day, will be in a better resting place and a better place for midday rest). This is because there is no comparison (مفاضلة) between good and evil. The good of the People of Paradise is only better and more excellent because it is a sensible, existent reality (واقعا وجوديا محسوسا). It is therefore superior to the good that the disbeliever used to imagine in the world, thinking he would attain it through his disbelief due to his ignorance. For this reason, Allah said concerning it \"better\" (*khayr*) and \"more excellent\" (*ahsan*), using the form of comparison (*af‘al min*), which implies superiority over something else. Understand this meaning. And <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "(پینسٹھواں باب: جنت، اس کے منازل اور درجات کی معرفت اور اس باب سے متعلقہ امور کا بیان)\n\n(بسم الله الرحمن الرحيم)\n\n> محسوس جنت کے مراتب تقسیم ہوئے ہیں\n> منازل میں اور اعمال ان کے طالب ہوتے ہیں۔\n\n> پس ہر عمل والے کی سواریاں دوڑتی ہیں\n> اس کے ذریعے اس کی طرف، اور اللہ کے رسول ان پر پردہ ڈالتے ہیں۔\n\n> اور وہ اختصاصات کی جنت جو کھل گئی ہے\n> مکرمین کے لیے، وراثت کی جنتیں اس کے پیچھے آتی ہیں۔\n\n> ہم ستاروں کے نور سے روشنی حاصل کرتے تھے\n> اور آج ہمارا نور عدن میں ستاروں کی مانند ہے۔\n\n> اگر عرش کے صراط کے علاوہ کوئی اور ہماری سواری ہوتی\n> تو شریعت کے ورود پر اس کی سواری زائل ہو جاتی۔\n\n> پس نیک اور مشروع عمل اسے ظاہر کرتا ہے\n> نور کی صورت میں، اور اپنی ذات سے جلال حاصل کرتا ہے۔\n\n### [جنت دو طرح کی ہے: ایک محسوس جنت اور ایک معنوی جنت]\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ جنت دو طرح کی ہے: ایک محسوس جنت (جنة محسوسة) اور ایک معنوی جنت (جنة معنوية)۔ عقل ان دونوں کو ایک ساتھ سمجھتی ہے، جیسا کہ عالم بھی دو ہیں: عالم لطیف اور عالم کثیف، اور عالم غیب اور عالم شہادت۔ نفس ناطقہ (النفس الناطقة) جو مخاطب اور مکلف ہے، اس کے لیے ایک نعمت ان علوم اور معارف (المعارف) کی صورت میں ہے جو وہ اپنے غور و فکر کے ذریعے حاصل کرتا ہے اور جو عقلی دلائل کے ذریعے اس تک پہنچتے ہیں۔ اور ایک نعمت ان لذات اور شہوات کی صورت میں ہے جو وہ حیوانی نفس (النفس الحيوانية) کے ذریعے اپنی حسی قوتوں سے حاصل کرتا ہے، جیسے کھانا، پینا، نکاح، لباس، خوشبوئیں، اور کانوں سے متعلقہ اچھی نغمات، اور خوبصورت صورت میں زندہ جمال جو آنکھوں کو نظر آتا ہے، جیسے خوبصورت عورتیں، حسین چہرے، متنوع رنگ، درخت اور نہریں۔ یہ سب حواس کے ذریعے نفس ناطقہ تک منتقل ہوتا ہے اور وہ اپنی طبیعت کے لحاظ سے اس سے لذت حاصل کرتا ہے۔ اگر صرف حیوانی حساس روح ہی لذت پاتی، نہ کہ نفس ناطقہ، تو حیوان بھی خوبصورت عورت کے حسین چہرے، خوبصورت لڑکے، رنگوں اور زیورات سے لذت پاتا۔ چونکہ ہم کسی بھی حیوان کو ان چیزوں سے لذت پاتے نہیں دیکھتے، اس لیے ہمیں قطعی طور پر معلوم ہوا کہ نفس ناطقہ ہی وہ ہے جو حسی قوت سے حاصل ہونے والی ہر چیز سے لذت حاصل کرتا ہے، خواہ وہ ایسی چیز ہو جس کے ادراک میں حیوانات اس کے شریک ہوں یا نہ ہوں۔\n\n### [محسوس جنت برج اسد کے طالع سے پیدا کی گئی اور معنوی جنت فرح الٰہی سے]\n\nاور جان لو کہ اللہ نے یہ محسوس جنت (الجنة المحسوسة) طالع اسد (برج اسد) کے ساتھ پیدا کی ہے جو کہ اقلید (کلید) ہے اور اس کا برج اسد ہے۔ اور معنوی جنت (الجنة المعنوية) کو، جو اس محسوس جنت کی روح ہے، صفت کمال، شادمانی اور سرور سے پیدا ہونے والے فرح الٰہی (الفرح الإلهي) سے پیدا کیا۔ پس محسوس جنت جسم کی مانند ہے اور معقول جنت روح اور اس کی قوتوں کی مانند ہے۔ اسی لیے الحق (ذات حق) تعالیٰ نے اسے اس کی حیات کی وجہ سے دارالحیوان (زندہ گھر) کا نام دیا۔ پس اس کے رہنے والے اس میں حسی اور معنوی طور پر نعمتیں پاتے ہیں۔ اور وہ معنی جو لطیفہ انسانیہ ہے، اور جنت بھی، اپنے اندر داخل ہونے والوں سے شدید تر نعمت پاتی ہے۔ اسی لیے وہ اپنے رہنے والوں سے بھرنے کی طلبگار رہتی ہے۔ اور نبی اکرم صلی اللہ علیہ وسلم سے ایک خبر میں وارد ہوا ہے کہ جنت کو بلال، علی، عمار اور سلمان کا اشتیاق تھا۔\n\nپس آپ صلی اللہ علیہ وسلم نے جنت کو ان ہستیوں کے اشتیاق سے متصف فرمایا۔ اور ان اسماء کی موافقت ان معانی سے کتنی خوب ہے جو اس کے شوق میں پنہاں ہیں! کیونکہ مشتاق کے شوق میں ملاقات کی طلب کا ایک قسم کا درد شامل ہوتا ہے۔ اور بلال کا لفظ \"ابل الرجل من مرضه واستبل\" (آدمی اپنی بیماری سے صحت یاب ہوا) سے ہے، اور بلال کا معنی ہے شفا۔ اور سلمان سلامتی سے ہے، یعنی دکھوں اور بیماریوں سے سلامتی۔ اور عمار سے مراد اس کے رہنے والوں سے اس کی آبادی ہے جس سے اس کا درد زائل ہو جاتا ہے۔ کیونکہ اللہ سبحانہ و تعالیٰ اس میں اپنے بندوں پر ظہور الٰہی (التجلی) فرمائے گا۔ پس علی (علیٰ) سے مراد اس ظہور الٰہی (التجلی) کے ذریعے اس کی شان کا آگ پر بلند ہونا ہے جو اس کی بہن ہے، کیونکہ جنت ظہور الٰہی (التجلی) اور رؤیت کے درجے سے کامیاب ہوئی، جبکہ آگ پردے کا گھر ہے۔ پس ان چار اسماء کی موافقت پر غور کرو، جب جنت کو ان مؤمن صحابہ کے اشتیاق سے متصف کیا گیا۔\n\n### [جنت کی نعمتوں میں لوگوں کے مراتب]\n\nاور اس مسئلے میں لوگ چار مراتب پر ہیں: ان میں سے کچھ وہ ہیں جو خواہش کرتے ہیں اور جن کی خواہش کی جاتی ہے، اور وہ اللہ کے مردوں میں سے اکابر ہیں، جیسے رسول، نبی اور کامل ولی۔ اور ان میں سے کچھ وہ ہیں جو خواہش کرتے ہیں مگر ان کی خواہش نہیں کی جاتی، اور وہ اللہ کے مردوں میں سے اصحابِ احوال ہیں جو جلالِ الٰہی میں محو ہیں، جن کا معنی ان کے حس پر غالب آ گیا ہے۔ اور یہ پہلے طبقے سے کم ہیں کیونکہ یہ اصحابِ احوال ہیں۔ اور ان میں سے کچھ وہ ہیں جو خواہش نہیں کرتے مگر ان کی خواہش کی جاتی ہے، اور وہ گناہگار مؤمنین ہیں۔ اور ان میں سے کچھ وہ ہیں جو نہ خواہش کرتے ہیں اور نہ ان کی خواہش کی جاتی ہے، اور وہ یومِ جزا (يَوْمِ الدِّينِ) کو جھٹلانے والے اور محسوس جنت (الجنة المحسوسة) کی نفی کرنے والے ہیں۔ اور ان چار اقسام کے علاوہ کوئی پانچویں قسم نہیں ہے۔\n\n### [اختصاص، وراثت اور اعمال کی جنتیں]\n\nاور جان لو کہ جنتیں تین ہیں: ایک جنۃ الاختصاص (اختصاص کی جنت) جو الٰہی اختصاص (اختصاص إلهي) سے حاصل ہوتی ہے، اور اس میں وہ بچے داخل ہوں گے جو عمل کی حد کو نہیں پہنچے، ان کی پیدائش کے وقت سے لے کر چھ سال کی عمر کے اختتام تک۔ اور اللہ اپنے بندوں میں سے جسے چاہتا ہے، اختصاص کی جنتوں (جنات الاختصاص) میں سے عطا کرتا ہے۔ اور اس کے اہل میں وہ مجنون بھی شامل ہیں جنہیں عقل نہیں آئی، اور اس کے اہل میں علمی توحید کے حامل لوگ بھی شامل ہیں، اور اس کے اہل میں اہل فترات (وہ لوگ جن تک رسول کی دعوت نہیں پہنچی) بھی شامل ہیں۔ اور دوسری جنت جنۃ المیراث (وراثت کی جنت) ہے، جو ہر اس شخص کو ملتی ہے جو جنت میں داخل ہوتا ہے، خواہ وہ ان لوگوں میں سے ہو جن کا ہم نے ذکر کیا یا مؤمنین میں سے۔ اور یہ وہ جگہیں ہیں جو اہل نار کے لیے مقرر تھیں اگر وہ ان میں داخل ہوتے۔ اور تیسری جنت جنۃ الأعمال (اعمال کی جنت) ہے، جس میں لوگ اپنے اعمال کے مطابق اتریں گے۔ پس جو شخص فضیلت کے پہلوؤں میں دوسروں سے افضل ہوگا، اسے جنت میں زیادہ حصہ ملے گا، خواہ وہ افضل شخص مفضول سے کم ہو یا نہ ہو، مگر اس نے اس مقام پر اس حالت کے ذریعے فضیلت حاصل کی۔ پس کوئی عمل ایسا نہیں ہے مگر اس کے لیے ایک جنت ہے، اور اس میں اس کے اصحاب کے درمیان ان کے احوال کے تقاضے کے مطابق فضیلت واقع ہوتی ہے۔\n\nصحیح حدیث میں نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے کہ آپ نے بلال رضی اللہ عنہ سے فرمایا: \"اے بلال! تم جنت میں مجھ سے کیسے سبقت لے گئے؟ میں نے جنت میں کسی جگہ قدم نہیں رکھا مگر تمہاری آہٹ اپنے آگے سنی۔\" بلال نے عرض کیا: \"یا رسول اللہ! میں نے جب بھی حدث کیا تو وضو کیا، اور جب بھی وضو کیا تو دو رکعت نماز پڑھی۔\" رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"انہی کی وجہ سے۔\"\n\nپس ہمیں معلوم ہوا کہ یہ اس عمل کے ساتھ مخصوص جنت تھی، تو رسول اللہ صلی اللہ علیہ وسلم بلال سے پوچھ رہے تھے کہ تم نے یہ کیسے حاصل کیا کہ تم میرے آگے آگے چل رہے ہو اور مجھ پر پردہ ڈال رہے ہو؟ تمہیں یہ سبقت اس مرتبے تک کیسے ملی؟ جب انہوں نے یہ ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"انہی کی وجہ سے۔\" پس کوئی فرض، نفل، نیک کام، یا حرام و مکروہ کو ترک کرنا ایسا نہیں ہے مگر اس کے لیے ایک مخصوص جنت اور خاص نعمت ہے جو اس میں داخل ہونے والے کو ملتی ہے۔\n\n### [اعمال اور طاعات میں فضیلت کے مراتب]\n\nاور فضیلت کئی مراتب پر ہے: ان میں سے ایک عمر کے لحاظ سے ہے، لیکن طاعت اور اسلام میں۔ پس بڑی عمر والا چھوٹی عمر والے پر فضیلت رکھتا ہے، اگر وہ دونوں عمل کے ایک ہی مرتبے پر ہوں، تو عمر کی وجہ سے کہ وہ اس میں زیادہ قدیم ہے۔ اور زمان (وقت) کے لحاظ سے بھی فضیلت ہوتی ہے، کیونکہ رمضان میں، جمعہ کے دن، شب قدر میں، ذی الحجہ کے دس دنوں میں، اور عاشوراء میں عمل کرنا دوسرے اوقات سے زیادہ عظیم ہے۔ اور ہر وہ وقت جسے شارع نے مقرر کیا ہے۔ اور مکان (جگہ) کے لحاظ سے بھی فضیلت واقع ہوتی ہے، جیسے مسجد حرام میں نماز پڑھنے والا مسجد نبوی میں نماز پڑھنے والے سے افضل ہے۔ اسی طرح مسجد نبوی میں نماز پڑھنا مسجد اقصیٰ میں نماز پڑھنے سے افضل ہے۔ اور اسی طرح مسجد اقصیٰ میں نماز کی فضیلت باقی تمام مساجد پر ہے۔ اور وہ احوال کے لحاظ سے بھی فضیلت پاتے ہیں، جیسے فرض نماز میں جماعت کے ساتھ نماز پڑھنا اکیلے شخص کی نماز سے افضل ہے، اور اس طرح کی مثالیں۔ اور وہ اعمال کے لحاظ سے بھی فضیلت پاتے ہیں، جیسے نماز ایذا رسانی کو دور کرنے سے افضل ہے۔ اور اللہ نے بعض اعمال کو بعض پر فضیلت دی ہے۔ اور وہ ایک ہی عمل میں بھی فضیلت پاتے ہیں، جیسے وہ شخص جو اپنے رشتہ دار پر صدقہ کرتا ہے، تو وہ صلہ رحمی اور صدقہ دونوں کا مالک ہوتا ہے، اور جو اپنے غیر رشتہ دار پر صدقہ کرتا ہے وہ اجر میں اس سے کم ہوتا ہے۔ اسی طرح جو شخص اہل بیت کے کسی شریف کو ہدیہ دیتا ہے وہ اس سے افضل ہے جو کسی غیر شریف کو ہدیہ دیتا ہے، یا اس کے ساتھ نیکی یا احسان کرتا ہے۔ اور شریعت میں فضیلت کے پہلو بہت زیادہ ہیں، اگرچہ وہ محدود ہیں، لیکن میں نے تمہیں اس کا ایک نمونہ دکھایا ہے جس سے تم ہمارے فضیلت کے مقصد کو سمجھ سکتے ہو۔ اور رسولوں علیہم السلام کی فضیلت جنت میں دوسروں پر جنۃ الاختصاص (اختصاص کی جنتوں) کی وجہ سے ظاہر ہوئی، لیکن اعمال کے لحاظ سے وہ احوال کے مطابق جنات الاعمال (اعمال کی جنتوں) میں ہیں، جیسا کہ ہم نے ذکر کیا۔ اور ہر وہ شخص جو کسی ایسے شخص پر فضیلت رکھتا ہے جو اس کے مقام پر نہیں ہے، تو یہ جنات الاختصاص کی وجہ سے ہے نہ کہ جنات الاعمال کی۔ اور لوگوں میں سے کچھ ایسے ہیں جو ایک ہی وقت میں بہت سے اعمال جمع کر لیتے ہیں، پس وہ اپنی سماعت کو اس میں صرف کرتے ہیں جو مناسب ہے، اسی وقت میں اپنی بصارت کو صرف کرتے ہیں، اسی وقت میں اپنے ہاتھ کو صرف کرتے ہیں، اسی وقت میں روزہ رکھتے ہیں، اسی وقت میں صدقہ کرتے ہیں، اسی وقت میں نماز پڑھتے ہیں، اسی وقت میں ذکر کرتے ہیں، اسی وقت میں فعل اور ترک کی نیت کرتے ہیں، پس انہیں ایک ہی وقت میں کئی پہلوؤں سے اجر ملتا ہے، اور وہ دوسروں پر فضیلت حاصل کرتے ہیں جنہیں یہ حاصل نہیں ہوتا۔ اسی لیے جب رسول اللہ صلی اللہ علیہ وسلم نے جنت کے آٹھ دروازوں کا ذکر کیا کہ وہ جس سے چاہیں داخل ہو سکتے ہیں،\n\nتو ابوبکر رضی اللہ عنہ نے عرض کیا: \"یا رسول اللہ! کیا انسان پر یہ لازم نہیں کہ وہ تمام دروازوں سے داخل ہو؟\" رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"مجھے امید ہے کہ تم ان میں سے ہو گے، اے ابوبکر۔\"\n\nپس ابوبکر رضی اللہ عنہ نے اس قول سے وہی مراد لیا جو ہم نے ذکر کیا کہ انسان ایک ہی وقت میں بہت سے اعمال میں مشغول ہو جو جنت کے دروازوں کو شامل ہوں۔\n\n### [نشأۃ آخرت اور نشأۃ دنیا]\n\nاور یہاں سے تم نشأۃ الآخرۃ (آخرت کی پیدائش) کو بھی جان سکتے ہو۔ جس طرح جنت دنیا سے اپنے تمام احوال میں مشابہت نہیں رکھتی، اگرچہ وہ اسماء میں جمع ہو جائیں، اسی طرح آخرت میں انسان کی نشأۃ (پیدائش) دنیا کی نشأۃ سے مشابہت نہیں رکھتی، اگرچہ وہ اسماء اور شخصی صورت میں جمع ہو جائیں۔ کیونکہ آخرت کی نشأۃ پر روحانیت حسیت سے زیادہ غالب ہے۔ اور ہم نے اس دنیا کے گھر میں، اس نشأۃ کی کثافت کے باوجود، اس کا ذائقہ چکھا ہے، تو انسان اپنی ذات کے ساتھ بہت سی جگہوں پر ہوتا ہے۔ اور عام لوگ اسے خواب میں ادراک کرتے ہیں۔\n\n### [ابن عربی کا خواب کہ کعبہ چاندی اور سونے کی اینٹوں سے بنا ہوا ہے]\n\nاور میں نے اس نوعیت کا ایک خواب اپنے لیے دیکھا اور اسے اللہ کی طرف سے بشارت سمجھا، کیونکہ یہ رسول اللہ صلی اللہ علیہ وسلم کی ایک نبوی حدیث کے مطابق ہے، جب آپ نے انبیاء علیہم السلام میں اپنی مثال بیان فرمائی۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: \"انبیاء میں میری مثال اس شخص کی طرح ہے جس نے ایک دیوار بنائی اور اسے مکمل کر دیا، سوائے ایک اینٹ کے۔ پس میں وہ اینٹ تھا، میرے بعد کوئی رسول نہیں اور نہ کوئی نبی۔\"\n\nپس آپ صلی اللہ علیہ وسلم نے نبوت کو دیوار سے اور انبیاء کو ان اینٹوں سے تشبیہ دی جن سے یہ دیوار قائم ہوئی، اور یہ نہایت خوبصورت تشبیہ ہے۔ کیونکہ یہاں جس دیوار کا اشارہ کیا گیا ہے، اس کا ظہور ان اینٹوں کے بغیر صحیح نہیں ہو سکتا تھا۔ اور آپ صلی اللہ علیہ وسلم خاتم النبیین تھے۔ میں مکہ میں ۵۹۹ھ میں تھا، میں نے خواب میں دیکھا کہ کعبہ چاندی اور سونے کی اینٹوں سے بنا ہوا ہے، ایک اینٹ چاندی کی اور ایک اینٹ سونے کی۔ اور وہ عمارت مکمل ہو چکی تھی اور اس میں کوئی کمی باقی نہیں تھی۔ میں اسے اور اس کی خوبصورتی کو دیکھ رہا تھا۔ پھر میں نے اس چہرے کی طرف دیکھا جو رکن یمانی اور رکن شامی کے درمیان ہے، اور وہ رکن شامی کے زیادہ قریب ہے۔ تو میں نے دو اینٹوں کی جگہ خالی پائی، ایک چاندی کی اینٹ اور ایک سونے کی اینٹ، جو دیوار میں دو صفوں میں کم تھیں۔ اوپر کی صف میں سونے کی اینٹ کم تھی اور اس سے نیچے والی صف میں چاندی کی اینٹ کم تھی۔ میں نے دیکھا کہ میں خود ان دونوں اینٹوں کی جگہ پر منطبع ہو گیا، پس میں ہی وہ دونوں اینٹیں تھا، اور دیوار مکمل ہو گئی اور کعبہ میں کوئی کمی باقی نہ رہی۔ اور میں کھڑا دیکھ رہا تھا اور جانتا تھا کہ میں کھڑا ہوں، اور جانتا تھا کہ میں ہی وہ دونوں اینٹیں ہوں، مجھے اس میں کوئی شک نہیں تھا، اور وہ دونوں میری ذات کا عین تھیں۔ میں بیدار ہوا اور اللہ تعالیٰ کا شکر ادا کیا اور تاویل کرتے ہوئے کہا کہ میں اپنے صنف میں اتباع کے لحاظ سے رسول اللہ صلی اللہ علیہ وسلم کی طرح ہوں جو انبیاء علیہم السلام میں تھے۔ اور شاید میں ان لوگوں میں سے ہوں جن پر اللہ نے ولایت کو ختم کیا ہے، اور یہ اللہ پر کچھ مشکل نہیں (وَما ذلِكَ عَلَى الله بِعَزِيزٍ)۔ اور میں نے نبی صلی اللہ علیہ وسلم کی حدیث یاد کی جس میں آپ نے دیوار کی مثال دی اور فرمایا کہ آپ وہ اینٹ تھے۔ پھر میں نے اپنا خواب مکہ کے بعض علماء کو سنایا جو توزر کے رہنے والے تھے، تو انہوں نے مجھے اس کی تاویل وہی بتائی جو میرے دل میں آئی تھی، اور میں نے انہیں یہ نہیں بتایا کہ خواب دیکھنے والا کون ہے۔ پس میں اللہ سے سوال کرتا ہوں کہ وہ اپنے کرم سے اسے مجھ پر مکمل فرمائے، کیونکہ الٰہی اختصاص (الاختصاص الإلهي) نہ تو تحدید کو قبول کرتا ہے، نہ موازنے کو، اور نہ عمل کو۔ اور یہ اللہ کا فضل ہے، وہ جسے چاہتا ہے اپنی رحمت کے ساتھ خاص کر لیتا ہے (وَإِنَّ ذلِكَ من فَضْلِ الله يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ وَالله ذُو الْفَضْلِ الْعَظِيمِ)۔\n\n### [اعمال کی جنتیں: ان کے درجات اور منازل]\n\nاور جان لو کہ جنۃ الأعمال (اعمال کی جنت) صرف سو درجات پر مشتمل ہے، جیسا کہ جہنم بھی سو درکات پر مشتمل ہے۔ مگر ہر درجہ کئی منازل میں تقسیم ہوتا ہے۔ پس ہم ان منازل میں سے ان کا ذکر کریں گے جو اس امت محمدیہ کے لیے ہیں اور جن کے ذریعے یہ دوسری امتوں پر فضیلت رکھتی ہے، کیونکہ یہ بہترین امت ہے جو لوگوں کے لیے نکالی گئی ہے (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ)، جیسا کہ قرآن میں الحق (ذات حق) کی گواہی اور اس کے تعارف سے ثابت ہے۔ اور یہ سو درجات آٹھوں جنتوں میں سے ہر جنت میں ہیں۔ اور اس کی صورت ایک جنت کے اندر دوسری جنت کی ہے۔ اور ان میں سب سے اعلیٰ جنۃ عدن ہے، اور وہ جنت کا مرکز ہے، اس میں وہ ٹیلہ (الکثیب) ہے جہاں الحق (ذات حق) کے دیدار کے لیے لوگوں کا اجتماع ہوگا۔ اور یہ جنتوں میں سب سے اعلیٰ جنت ہے، یہ جنتوں میں بادشاہ کے گھر کی طرح ہے، جس کے گرد آٹھ دیواریں ہیں، اور ہر دو دیواروں کے درمیان ایک جنت ہے۔ پس جو جنۃ عدن کے قریب ہے وہ جنۃ الفردوس ہے، اور یہ جنۃ عدن سے نیچے والی جنتوں میں سب سے درمیانی اور افضل ہے۔ پھر جنۃ الخلد ہے، پھر جنۃ النعیم، پھر جنۃ المأویٰ، پھر دار السلام، پھر دار المقامہ۔ اور وسیلہ (الوسیلۃ) جنۃ عدن میں سب سے اعلیٰ درجہ ہے، اور یہ رسول اللہ صلی اللہ علیہ وسلم کے لیے ہے جو انہیں ان کی امت کی دعا سے حاصل ہوا۔ الحق (ذات حق) نے یہ ایک حکمت کے تحت کیا جسے اس نے پوشیدہ رکھا، کیونکہ ہم نے اس کی وجہ سے اللہ کی طرف سے سعادت حاصل کی، اور اسی کی وجہ سے ہم لوگوں کے لیے نکالی گئی بہترین امت (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ) بنے، اور اسی کے ذریعے اللہ نے ہم پر امتوں کا خاتمہ کیا، جیسا کہ اس نے آپ پر نبیوں کا خاتمہ کیا۔ اور آپ صلی اللہ علیہ وسلم بشر ہیں جیسا کہ آپ کو کہنے کا حکم دیا گیا، اور ہمارا اللہ عزوجل کی طرف ایک خاص رخ ہے جس سے ہم اس سے سرگوشی کرتے ہیں اور وہ ہم سے سرگوشی کرتا ہے۔ اور اسی طرح ہر مخلوق کا اپنے رب کی طرف ایک خاص رخ ہے۔ پس ہمیں اللہ کے حکم سے حکم دیا گیا کہ ہم آپ کے لیے وسیلہ کی دعا کریں تاکہ آپ اس میں اتریں اور اسے اپنی امت کی دعا سے حاصل کریں۔ پس اس عظیم فضیلت کو سمجھو۔ اور اگر تم سمجھو تو یہ غیرت الٰہی (الغيرة الإلهية) کے باب سے ہے۔ پس اللہ نے اس نبی اور اس امت کو عزت بخشی۔ پس جنت کے درجات میں پانچ ہزار ایک سو پانچ درجات شامل ہیں، صرف یہی۔ اور بلاشبہ یہ تعداد اس سے بڑھ بھی سکتی ہے، لیکن ہم نے ان میں سے وہ ذکر کیا ہے جس پر اہل کشف (أهل الكشف) کا اتفاق ہے، جو اجناس کی انواع کے زمرے میں آتے ہیں۔\n\n### [نبی محمد صلی اللہ علیہ وسلم اور ان کی امت کے جنت میں اختصاصات]\n\nاور جو چیز اس امت محمدیہ کو دوسری امتوں پر ان درجات میں خاص طور پر حاصل ہے، وہ صرف بارہ درجات ہیں، جن میں کوئی بھی امت اس کی شریک نہیں ہے۔ جیسا کہ\n\nآپ صلی اللہ علیہ وسلم کو آخرت میں وسیلہ اور شفاعت کا دروازہ کھولنے کے ذریعے دوسرے رسولوں پر فضیلت دی گئی، اور دنیا میں چھ چیزیں دی گئیں جو آپ سے پہلے کسی نبی کو نہیں دی گئیں، جیسا کہ صحیح حدیث میں مسلم بن حجاج کی روایت میں آیا ہے، پس ان میں سے آپ نے اپنی رسالت کا عموم، مال غنیمت کا حلال ہونا، رعب کے ذریعے مدد، اور آپ کے لیے پوری زمین کو مسجد بنانا، اور اس کی مٹی کو آپ کے لیے پاک کرنے والا بنانا، اور آپ کو زمین کے خزانوں کی چابیاں عطا کرنا ذکر فرمایا۔\n\n### [اہل جنت کی چار اقسام]\n\nپھر جان لو کہ اہل جنت چار اقسام کے ہیں: رسول (الرسل)، اور وہ انبیاء ہیں۔ اور اولیاء (الأولياء)، اور وہ رسولوں کے پیروکار ہیں جو اپنے رب کی طرف سے بصیرت اور دلیل پر ہیں۔ اور مؤمنون (المؤمنون)، اور وہ ان کی تصدیق کرنے والے ہیں۔ اور اللہ کی توحید کے علماء (العلماء)، کہ اس کے سوا کوئی معبود نہیں، عقلی دلائل کی رو سے۔ اللہ تعالیٰ فرماتا ہے: \"اللہ نے گواہی دی کہ اس کے سوا کوئی معبود نہیں، اور فرشتوں نے اور اہل علم نے بھی\" (شَهِدَ الله أَنَّهُ لا إِلهَ إِلَّا هُوَ والْمَلائِكَةُ وأُولُوا الْعِلْمِ)۔ اور یہی وہ لوگ ہیں جنہیں میں علماء سے مراد لیتا ہوں۔ اور ان کے بارے میں اللہ تعالیٰ فرماتا ہے: \"اللہ تم میں سے ایمان لانے والوں اور جنہیں علم دیا گیا ہے، ان کے درجات بلند کرے گا\" (يَرْفَعِ الله الَّذِينَ آمَنُوا مِنْكُمْ والَّذِينَ أُوتُوا الْعِلْمَ دَرَجاتٍ)۔\n\n### [اللہ کی معرفت تک پہنچنے کا راستہ]\n\nاور اللہ کی معرفت (العلم بالله) تک پہنچنے کے دو ہی راستے ہیں، کوئی تیسرا راستہ نہیں۔ اور جو شخص ان دو راستوں کے علاوہ کسی اور طریقے سے اللہ کی توحید بیان کرتا ہے، وہ اپنی توحید میں مقلد (پیروکار) ہے۔ (پہلا راستہ) کشف (الکشف) کا راستہ ہے، اور یہ ایک ضروری علم ہے جو کشف کے وقت حاصل ہوتا ہے، جسے انسان اپنے نفس میں پاتا ہے، جو کسی شبہ کو قبول نہیں کرتا اور نہ ہی اسے دفع کرنے کی قدرت رکھتا ہے، اور نہ ہی اس کے لیے کوئی دلیل جانتا ہے جس پر وہ بھروسہ کرے، سوائے اس کے جو وہ اپنے نفس میں پاتا ہے۔ البتہ بعض نے کہا کہ اسے اپنے کشف میں دلیل اور مدلول دونوں عطا کیے جاتے ہیں، کیونکہ جو چیز دلیل کے بغیر معلوم نہیں ہو سکتی، اس کے لیے دلیل کا کشف ہونا ضروری ہے۔ اور ہمارے ساتھی ابو عبداللہ بن کتانی فاس شہر میں اس قول کے قائل تھے، میں نے ان سے یہ سنا اور انہوں نے اپنے حال کے بارے میں بتایا، اور انہوں نے سچ کہا، لیکن اس بات میں غلطی کی کہ معاملہ صرف ایسا ہی ہوتا ہے، کیونکہ دوسرے لوگ اسے اپنے نفس میں ذوقاً پاتے ہیں بغیر اس کے کہ ان پر دلیل کا کشف ہو۔ یا یہ ظہور الٰہی (تجلّی إلهي) سے حاصل ہو، اور یہ رسولوں، انبیاء اور بعض اولیاء کا حال ہے۔ (اور دوسرا راستہ) فکر اور عقلی برہان (دلیل) کے ذریعے استدلال کا راستہ ہے۔ اور یہ راستہ پہلے راستے سے کم ہے، کیونکہ دلیل میں غور کرنے والے پر ایسے شبہات وارد ہو سکتے ہیں جو اس کی دلیل کو مجروح کر دیں، تو اسے ان شبہات کو دور کرنے اور مطلوبہ امر میں حق کے پہلو کی تلاش کی مشقت اٹھانی پڑتی ہے۔ اور کوئی تیسرا راستہ نہیں ہے۔ پس یہی وہ اہل علم ہیں جنہوں نے اللہ کی توحید کی گواہی دی۔ اور توحید کے ان علماء کے اس طبقے کے فحول (بڑے) لوگوں کے لیے توحید کے علم میں مزید اضافہ ہوتا ہے، جو ذات میں توحید کے بارے میں قطعی دلائل کے ساتھ ہوتا ہے، جو ہر اہل کشف (أهل الكشف) کو نہیں دیے جاتے، بلکہ بعض کو دیے جاتے ہیں۔\n\n### [جنت میں اہل جنت کے مقامات]\n\nاور یہ چاروں گروہ جنۃ عدن میں الحق (ذات حق) کے دیدار کے وقت سفید ٹیلے (الکثیب) پر ممتاز ہوں گے۔ اور وہ اس میں چار مقامات پر ہوں گے: ان میں سے ایک گروہ منبروں والے ہوں گے، اور یہ اعلیٰ طبقہ ہے، یعنی رسول اور انبیاء۔ اور دوسرا گروہ اولیاء (الأولياء) ہیں، جو انبیاء کے قول، عمل اور حال میں وارث ہیں، اور وہ اپنے رب کی طرف سے دلیل پر ہیں۔ اور وہ تختوں اور عرشوں والے ہیں۔ اور تیسرا طبقہ عقلی برہان کے ذریعے اللہ کی معرفت (العلم بالله) حاصل کرنے والے علماء ہیں، اور وہ کرسیوں والے ہیں۔ اور چوتھا طبقہ وہ مؤمنین ہیں جو اپنی توحید میں مقلد (پیروکار) ہیں، اور ان کے لیے مراتب ہیں۔ اور وہ حشر میں عقلی نظر والوں سے مقدم ہوں گے، اور ٹیلے پر دیدار کے وقت وہ مقلدین پر مقدم ہوں گے۔\n\n### [عام زیارت میں اللہ کا اپنے بندوں پر ظہور الٰہی]\n\nپس جب اللہ اپنے بندوں پر عام زیارت (الزور العام) میں ظہور الٰہی (التجلی) کا ارادہ فرمائے گا، تو الحق (ذات حق) کا منادی تمام جنتوں میں ندا دے گا: \"اے اہل جنت! عظیم احسان، قربت کے مقام اور اعلیٰ منظر کی طرف آؤ! اپنے رب کی زیارت کے لیے جنۃ عدن کی طرف چلو!\" پس وہ جنۃ عدن کی طرف تیزی سے بڑھیں گے اور اس میں داخل ہوں گے۔ اور ہر گروہ اپنا مرتبہ اور منزل جانتا ہوگا۔ وہ بیٹھ جائیں گے، پھر دسترخوانوں کا حکم دیا جائے گا، تو ان کے سامنے اختصاص کے دسترخوان لگائے جائیں گے، جن کی مثال انہوں نے اپنی زندگی میں یا اپنی جنات الاعمال (اعمال کی جنتوں) میں نہ دیکھی ہوگی اور نہ تصور کی ہوگی۔ اور اسی طرح کھانا بھی ایسا ہوگا جس کا ذائقہ انہوں نے اپنے منازل میں نہیں چکھا ہوگا۔ اور اسی طرح جو مشروب وہ پئیں گے، وہ بھی ایسا ہی ہوگا۔ جب وہ اس سے فارغ ہوں گے، تو انہیں ایسے خلعتیں پہنائی جائیں گی جو انہوں نے پہلے کبھی نہیں پہنی ہوں گی۔ اور اس کی تصدیق یہ ہے:\n\nآپ صلی اللہ علیہ وسلم کا فرمان ہے: \"جنت میں وہ کچھ ہے جو کسی آنکھ نے نہیں دیکھا، کسی کان نے نہیں سنا، اور کسی انسان کے دل پر اس کا خیال بھی نہیں گزرا۔\"\n\nجب وہ اس سے فارغ ہوں گے، تو وہ سفید مشک کے ایک ٹیلے (کثیب) کی طرف اٹھیں گے، اور اس میں اپنے علم باللہ (اللہ کی معرفت) کے مطابق اپنی منزلیں لیں گے، نہ کہ اپنے عمل کے مطابق۔ کیونکہ عمل جنتوں کی نعمتوں کے لیے مخصوص ہے، نہ کہ رحمن کے مشاہدے کے لیے۔ وہ اسی حال میں ہوں گے کہ اچانک ایک نور ان پر غالب آ جائے گا، تو وہ سجدے میں گر پڑیں گے۔ پس وہ نور ان کی ظاہری آنکھوں میں، ان کی باطنی بصیرتوں میں، ان کے جسم کے تمام اجزاء میں، اور ان کے نفوس کے لطائف میں سرایت کر جائے گا، تو ہر شخص ان میں سے مکمل آنکھ اور مکمل کان بن جائے گا، پس وہ اپنی پوری ذات سے دیکھے گا، اسے جہات کی قید نہیں ہوگی، اور اپنی پوری ذات سے سنے گا۔ پس یہ نور انہیں یہ عطا کرے گا کہ وہ مشاہدہ اور رؤیت کی طاقت رکھیں گے، اور یہ مشاہدے سے زیادہ کامل ہے۔ پھر اللہ کی طرف سے ایک رسول ان کے پاس آئے گا اور کہے گا: \"اپنے رب جل جلالہ کی رؤیت کے لیے تیار ہو جاؤ، وہ تمہارے لیے ظہور الٰہی (التجلی) فرما رہا ہے۔\" پس وہ تیار ہو جائیں گے۔ پھر الحق جل جلالہ ظہور الٰہی (التجلی) فرمائے گا، اور اس کے اور اس کی مخلوق کے درمیان تین پردے ہوں گے: حجاب العزۃ (عزت کا پردہ)، حجاب الکبریاء (کبریائی کا پردہ)، اور حجاب العظمۃ (عظمت کا پردہ)۔ وہ ان پردوں کی طرف دیکھنے کی طاقت نہیں رکھیں گے۔ پس اللہ جل جلالہ اپنے سب سے بڑے حاجب کو حکم دے گا: \"میرے اور میرے بندوں کے درمیان سے پردے اٹھا دو تاکہ وہ مجھے دیکھ سکیں۔\" پس پردے اٹھا دیے جائیں گے۔ پھر الحق جل جلالہ اپنے اسم الجمیل اللطیف میں ایک پردے کے پیچھے سے ان کی آنکھوں پر ظہور الٰہی (التجلی) فرمائے گا، اور وہ سب ایک ہی بصارت ہوں گے۔ پس ان پر ایک نور پھوٹ پڑے گا جو ان کی ذاتوں میں سرایت کر جائے گا، تو وہ سب کے سب کان بن جائیں گے۔ اور رب کا جمال ان پر غالب آ چکا ہوگا اور ان کی ذاتیں اس قدس جمال کے نور سے چمک اٹھی ہوں گی۔\n\n### [ابو بکر نقاش کی حدیث کا بقیہ حصہ: قیامت کے پچاس مواقف]\n\nرسول اللہ صلی اللہ علیہ وسلم نے نقاش کی حدیث میں قیامت کے مواقف کے بارے میں فرمایا، اور یہ اس کا تتمہ ہے: پس اللہ جل جلالہ فرمائے گا: \"سلام ہو تم پر میرے بندو! اور خوش آمدید! اللہ تمہیں زندہ رکھے! سلام ہو تم پر رحمن، رحیم، حی، قیوم کی طرف سے! تم پاکیزہ ہو گئے، پس اس میں ہمیشہ رہنے کے لیے داخل ہو جاؤ (طِبْتُمْ فَادْخُلُوها خالِدِينَ)! جنت تمہارے لیے پاکیزہ ہو گئی، پس اپنے نفوس کو ہمیشہ کی نعمت اور کریم کی طرف سے ثواب اور دائمی بقا کے ساتھ پاکیزہ بناؤ۔ تم مؤمن، امن والے ہو، اور میں اللہ المؤمن المہیمن ہوں۔ میں نے تمہارے لیے اپنے اسماء میں سے ایک اسم نکالا ہے، نہ تم پر کوئی خوف ہے اور نہ تم غمگین ہو گے (لا خَوْفٌ عَلَيْكُمْ ولا أَنْتُمْ تَحْزَنُونَ)۔ تم میرے اولیاء، میرے پڑوسی، میرے برگزیدہ اور میرے خاص لوگ ہو، اور میری محبت والے ہو، اور میرے گھر میں ہو۔ سلام ہو تم پر اے میرے مسلمان بندوں کے گروہ! تم مسلم ہو اور میں السلام ہوں، اور میرا گھر دار السلام ہے۔ میں تمہیں اپنا چہرہ دکھاؤں گا جیسا کہ تم نے میرا کلام سنا۔ پس جب میں تمہارے لیے ظہور الٰہی (التجلی) کروں اور اپنے چہرے سے پردے ہٹا دوں، تو میری حمد کرو اور میرے گھر میں مجھ سے غیر محجوب ہو کر سلامتی کے ساتھ داخل ہو جاؤ (بِسَلامٍ آمِنِينَ)۔ مجھے جواب دو اور میرے ارد گرد بیٹھ جاؤ تاکہ تم میری طرف دیکھو اور مجھے قریب سے دیکھو۔ پس میں تمہیں اپنے تحفوں سے نوازوں گا، اور اپنے انعامات سے تمہاری پذیرائی کروں گا، اور تمہیں اپنے نور سے خاص کروں گا، اور تمہیں اپنے جمال سے ڈھانپ دوں گا، اور تمہیں اپنی بادشاہت میں سے عطا کروں گا، اور تمہیں اپنے ہنسنے سے محظوظ کروں گا، اور تمہیں اپنے ہاتھ سے لپیٹوں گا، اور تمہیں اپنی روح سونگھاؤں گا۔ میں تمہارا رب ہوں جس کی تم عبادت کرتے تھے اور مجھے دیکھتے نہیں تھے، اور مجھ سے محبت کرتے تھے اور مجھ سے ڈرتے تھے۔ میری عزت، میرے جلال، میری بلندی، میری کبریائی، میری بہاء اور میری روشنی کی قسم! میں تم سے راضی ہوں، اور میں تم سے محبت کرتا ہوں اور اس سے محبت کرتا ہوں جس سے تم محبت کرتے ہو۔ اور تمہارے لیے میرے پاس وہ سب کچھ ہے جو تمہارے نفوس چاہیں گے اور تمہاری آنکھیں لذت پائیں گی، اور تمہارے لیے میرے پاس وہ سب کچھ ہے جو تم مانگو گے اور جو تم چاہو گے، اور جو کچھ تم چاہو گے میں چاہوں گا۔ پس مجھ سے سوال کرو اور شرم محسوس نہ کرو، نہ حیا کرو اور نہ گھبراؤ۔ اور میں ہی اللہ ہوں، جواد (سخاوت کرنے والا)، غنی، ملی (مالک)، وفی (وفادار)، صادق ہوں۔ اور یہ میرا گھر ہے، میں نے تمہیں اس میں بسایا ہے، اور میری جنت ہے، میں نے تمہیں اس کی اجازت دی ہے، اور میں نے تمہیں اپنی ذات دکھائی ہے۔ اور یہ میرا ہاتھ ہے جو سخاوت اور شبنم والا ہے، تم پر پھیلا ہوا ہے، میں اسے تم سے نہیں سمیٹوں گا۔ اور میں تمہاری طرف دیکھ رہا ہوں، میں اپنی بصارت تم سے نہیں پھیروں گا۔ پس مجھ سے جو چاہو اور خواہش کرو، سوال کرو۔ میں نے تمہیں اپنی ذات سے مانوس کر دیا ہے، اور میں تمہارا ہم نشین اور مونس ہوں۔ اس کے بعد نہ کوئی حاجت ہے، نہ فاقہ، نہ کوئی بدحالی، نہ مسکینی، نہ کمزوری، نہ بڑھاپا، نہ ناراضگی، نہ تنگی، اور نہ کبھی کوئی تبدیلی، ہمیشہ ہمیشہ کے لیے۔ تمہاری نعمت ابدی نعمت ہے، اور تم امن والے، مقیم، ٹھہرنے والے، مکرم اور نعمت پانے والے ہو۔ تم ہی سردار اور شرف والے ہو جنہوں نے میری اطاعت کی اور میری حرام کردہ چیزوں سے اجتناب کیا۔ پس اپنی حاجتیں میرے سامنے پیش کرو، میں انہیں تمہارے لیے پورا کروں گا، اور یہ کرامت اور نعمت ہے۔\" راوی کہتا ہے: پس وہ کہیں گے: \"اے ہمارے رب! یہ ہماری آرزو اور تمنا نہیں تھی، بلکہ ہماری حاجت یہ ہے کہ ہم ہمیشہ ہمیشہ کے لیے تیرے کریم چہرے کا دیدار کریں، اور تیری رضا ہم پر ہو۔\" پس علی الاعلیٰ، مالک الملک، سخی، کریم، تبارک و تعالیٰ ان سے فرمائے گا: \"پس یہ میرا چہرہ تمہارے لیے ہمیشہ ہمیشہ کے لیے ظاہر ہے، پس اسے دیکھو اور خوش ہو جاؤ، کیونکہ میرا نفس تم سے راضی ہے۔ پس لطف اندوز ہو اور اپنی بیویوں کی طرف جاؤ، پس گلے لگاؤ اور نکاح کرو، اور اپنی باندیوں کے ساتھ خوش گپیاں کرو، اور اپنے کمروں میں داخل ہو جاؤ، اور اپنے باغات میں سیر کرو، اور اپنی سواریوں پر سوار ہو، اور اپنے بستروں پر ٹیک لگاؤ، اور جنتوں میں اپنی حوروں اور باندیوں کے ساتھ انس حاصل کرو، اور اپنے رب کی طرف سے اپنے تحفے قبول کرو، اور اپنے لباس پہنو، اور اپنی مجلسوں میں گفتگو کرو۔ پھر قیلولہ کرو، جس میں نہ نیند ہوگی اور نہ کوئی آفت، گھنے سائے میں اور امن کی جگہ میں، اور جلیل کے پڑوس میں۔ پھر نہر کوثر، کافور، پاکیزہ پانی، تسنیم، سلسبیل اور زنجبیل کی طرف جاؤ، پس غسل کرو اور نعمتیں پاؤ۔ تمہارے لیے خوشخبری اور اچھا ٹھکانہ ہے (طُوبَى لَكُمْ وحُسْنُ مَآبٍ)۔ پھر جاؤ اور سبز مسندوں، خوبصورت عبقری قالینوں، اور بلند بستروں پر ٹیک لگاؤ، لمبے سائے میں، بہتے پانی میں، اور کثرت کے پھلوں میں، جو نہ ختم ہونے والے ہیں اور نہ ممنوع (لا مَقْطُوعَةٍ ولا مَمْنُوعَةٍ)۔\" پھر رسول اللہ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی: \"بے شک جنت والے آج کے دن شغل میں خوش ہوں گے (إِنَّ أَصْحابَ الْجَنَّةِ الْيَوْمَ في شُغُلٍ فاكِهُونَ)۔ وہ اور ان کی بیویاں سایوں میں تختوں پر تکیہ لگائے ہوں گے (هُمْ وأَزْواجُهُمْ في ظِلالٍ عَلَى الْأَرائِكِ مُتَّكِؤُنَ)۔ ان کے لیے اس میں میوے ہوں گے اور ان کے لیے وہ سب کچھ ہوگا جو وہ مانگیں گے (لَهُمْ فِيها فاكِهَةٌ ولَهُمْ ما يَدَّعُونَ)۔ سلام ہے، مہربان رب کی طرف سے قول (سَلامٌ قَوْلًا من رَبٍّ رَحِيمٍ)۔\" پھر آپ نے یہ آیت تلاوت فرمائی: \"جنت والے اس دن ٹھہرنے کی جگہ کے لحاظ سے بہتر اور قیلولہ کی جگہ کے لحاظ سے زیادہ حسین ہوں گے\" (أَصْحابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وأَحْسَنُ مَقِيلًا)۔\n\n### [پردہ اٹھانا اور ذات کے مشاہدے سے نعمت پانا]\n\nیہاں پر ابو بکر نقاش کی حدیث ختم ہوئی جسے ہم نے اس سے پہلے باب القیامہ میں مواقف کی حدیث میں سند کے ساتھ بیان کیا تھا۔ پھر الحق تعالیٰ اس خطاب کے بعد پردہ اٹھا دے گا اور اپنے بندوں پر ظہور الٰہی (التجلی) فرمائے گا، تو وہ سجدے میں گر پڑیں گے۔ پس وہ ان سے فرمائے گا: \"اپنے سر اٹھاؤ، اے میرے بندو! یہ سجدے کی جگہ نہیں ہے۔ میں نے تمہیں صرف اس لیے بلایا ہے تاکہ تم میرے مشاہدے سے نعمت پاؤ۔\" پس وہ انہیں اس حال میں جب تک اللہ چاہے گا روکے رکھے گا۔ پھر ان سے فرمائے گا: \"کیا اس کے بعد تمہارے لیے کچھ باقی رہ گیا ہے؟\" پس وہ کہیں گے: \"اے ہمارے رب! اور کیا باقی رہ گیا ہے؟ تو نے ہمیں آگ سے نجات دی، اور ہمیں اپنی رضوان کے گھر میں داخل کیا، اور ہمیں اپنے پڑوس میں اتارا، اور ہمیں اپنے کرم کے لباس پہنائے، اور ہمیں اپنا چہرہ دکھایا۔\" پس الحق جل جلالہ فرمائے گا: \"تمہارے لیے باقی ہے۔\" پس وہ کہیں گے: \"اے ہمارے رب! وہ کیا ہے جو باقی ہے؟\" پس وہ فرمائے گا: \"تم سے میری رضا کا دوام، پس میں تم پر کبھی ناراض نہیں ہوں گا۔\" پس یہ کتنا شیریں کلمہ ہے اور کتنی لذیذ بشارت ہے! پس سبحانہ و تعالیٰ نے ہمیں پیدا کرنے کے لیے کلام سے آغاز کیا، پس فرمایا: \"ہو جا\" (كُنْ)، تو سب سے پہلی چیز جو ہمیں اس کی طرف سے ملی وہ سماعت تھی۔ پس اس نے اسی چیز پر ختم کیا جس سے اس نے آغاز کیا، پس یہ بات فرمائی، تو سماعت پر ختم کیا، اور وہ یہ بشارت ہے۔ اور لوگ اس کے دیدار میں ایک دوسرے سے فضیلت پائیں گے اور ان کے علم کے مطابق ان میں بہت بڑا تفاوت ہوگا، پس ان میں سے کچھ ہوں گے اور کچھ ہوں گے۔ پھر سبحانہ و تعالیٰ اپنے فرشتوں سے فرمائے گا: \"انہیں ان کے محلات کی طرف واپس لے جاؤ۔\" پس وہ دو وجوہات کی بنا پر راستہ نہیں پہچانیں گے: ایک تو رؤیت کے نشے کی وجہ سے جو ان پر طاری ہوا، اور دوسرے اس خیر کی وجہ سے جو ان کے راستے میں بڑھا دیا گیا، تو وہ اسے نہیں پہچانیں گے۔ اگر فرشتے ان کی رہنمائی نہ کرتے تو وہ اپنی منزلیں نہ پہچانتے۔ پس جب وہ اپنی منزلوں پر پہنچیں گے، تو ان کے اہل، حوریں اور ولدان ان کا استقبال کریں گے، اور وہ دیکھیں گے کہ ان کی تمام بادشاہت ان کے چہروں کے نور سے چمک، جمال اور روشنی سے ڈھکی ہوئی ہے، جو انہوں نے اپنی ذات سے اپنی بادشاہت پر ڈالا ہے۔ پس وہ ان سے کہیں گے: \"تمہارے نور، چمک اور جمال میں اضافہ ہوا ہے، جب ہم نے تمہیں چھوڑا تھا تو ایسا نہیں تھا۔\" پس ان کے اہل ان سے کہیں گے: \"اور تم بھی اسی طرح ہو، تمہارے حسن و جمال میں اضافہ ہوا ہے جو تم میں ہمیں چھوڑ کر جانے کے وقت نہیں تھا۔\" پس وہ ایک دوسرے سے نعمت پائیں گے۔\n\n### [اہل جنت اور اہل نار میں مطلق راحت اور مطلق رحمت]\n\nاور جان لو کہ راحت اور رحمت پوری جنت میں مطلق ہے، اگرچہ رحمت کوئی وجودی امر نہیں ہے، بلکہ یہ اس امر سے تعبیر ہے جس سے مرحوم لذت اور نعمت پاتا ہے، اور وہ وجودی امر ہے۔ پس جنت میں ہر کوئی نعمت پانے والا ہے اور اس میں ہر چیز نعمت ہے۔ پس ان کی حرکت میں کوئی مشقت نہیں اور ان کے اعمال میں کوئی تھکاوٹ نہیں۔ سوائے نیند کی راحت کے، جو ان کے پاس نہیں ہے، کیونکہ وہ سوتے نہیں ہیں۔ پس ان کے پاس نیند کی نعمت میں سے کچھ نہیں ہے۔ اور نیند کی نعمت وہ ہے جس سے خاص طور پر اہل نار لذت پاتے ہیں۔ پس نیند کی راحت کا مقام جہنم ہے۔ اور اہل نار پر اللہ کی رحمت میں سے یہ ہے کہ ان کے عذاب کے دنوں میں آگ ان پر بجھ جاتی ہے، پھر اس کے بعد ان پر بھڑکائی جاتی ہے، پس اس سے ان سے عذاب کی تکلیف ہلکی ہو جاتی ہے، جس قدر آگ بجھتی ہے۔ اللہ تعالیٰ فرماتا ہے: \"جب بھی وہ بجھنے لگے گی، ہم ان پر مزید بھڑکا دیں گے\" (كُلَّما خَبَتْ زِدْناهُمْ سَعِيراً)۔ اور یہ تمہیں بتاتا ہے کہ آگ بلاشبہ محسوس ہے، کیونکہ آگ اس صفت سے متصف نہیں ہوتی مگر اس وجہ سے کہ اس کا قیام اجسام کے ساتھ ہے۔ کیونکہ آگ کی حقیقت اپنی ذات کے لحاظ سے اس صفت کو قبول نہیں کرتی، نہ زیادتی کو اور نہ کمی کو۔ بلکہ یہ وہ جسم ہے جو آگ سے جلتا ہے، وہی ناریت سے بھڑکایا جاتا ہے۔ اور اگر ہم اس آیت کو دوسرے پہلو پر محمول کریں، تو ہم کہیں گے کہ اللہ تعالیٰ کا فرمان: \"جب بھی وہ بجھنے لگے گی\" (كُلَّما خَبَتْ) یعنی ان کے اجسام پر مسلط آگ، \"ہم ان پر مزید بھڑکا دیں گے\" (زِدْناهُمْ سَعِيراً)۔ کیونکہ اس نے یہ نہیں کہا کہ \"ہم اسے مزید بھڑکا دیں گے\"۔ اور اس کا مطلب یہ ہے کہ عذاب ان کے باطن کی طرف پلٹ جائے گا، اور یہ شدید ترین حسی عذاب ہے جو انہیں معنوی عذاب سے مشغول کر دیتا ہے۔ پس جب آگ ان کے ظاہر پر بجھ جاتی ہے اور وہ اپنے حس کے لحاظ سے راحت پاتے ہیں، تو اللہ ان کے باطن پر اس بات کے تفکر کو مسلط کر دیتا ہے کہ انہوں نے کن امور میں کوتاہی کی تھی جن پر عمل کرتے تو وہ سعادت حاصل کر لیتے، اور ان پر وہم اپنے تسلط کے ساتھ غالب آ جاتا ہے، تو وہ ایسے عذاب کا وہم کرتے ہیں جو اس سے زیادہ شدید ہوتا ہے جس میں وہ تھے، پس ان کا عذاب اس وہم کی وجہ سے ان کے نفوس میں اس عذاب کے حلول سے زیادہ شدید ہوتا ہے جو محسوس آگ کے ان کے اجسام پر مسلط ہونے کے ساتھ ہوتا ہے۔ اور وہ آگ جو وہم نے انہیں دی ہے، وہ وہ آگ ہے جو دلوں پر جھانکتی ہے (الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ)۔\n\nاور یہی وہ ہے جس کے بارے میں ہم نے کہا:\n\n> آگ دو طرح کی ہے، ایک وہ جو سب شعلہ ہے\n> اور ایک معنوی آگ جو روحوں پر جھانکتی ہے۔\n\n> اور یہ وہ ہے جس میں نہ کوئی جھلسنا ہے اور نہ کوئی شعلہ\n> لیکن اس میں ایک درد ہے جو دل میں نقش ہو جاتا ہے۔\n\n### [اختصاص کی جنتوں کی نعمتوں میں سے]\n\nاسی طرح اہل جنت کو اللہ تعالیٰ ان کی موجودہ حالت سے بڑھ کر متوہم آرزوئیں اور نعمتیں عطا فرماتا ہے۔ پس ان میں سے کسی شخص کا صرف یہ وہم کرنا یا تمنا کرنا ہی ہوتا ہے کہ وہ اس کے مطابق ہو جاتا ہے جس کا وہ وہم کرتا ہے، اگر وہ معنوی تمنا کرے تو معنوی ہوتا ہے، یا حسی وہم کرے تو محسوس ہوتا ہے۔ یہ نعمت جنات الاختصاص (اختصاص کی جنتوں) اور ان کی نعمتوں میں سے ہے۔ اور یہ اس شخص کا بدلہ ہے جو یہاں دنیا میں یہ وہم کرتا تھا اور تمنا کرتا تھا کہ اگر اسے قدرت اور تمکن حاصل ہوتا تو وہ ان لوگوں میں سے ہوتا جو اللہ کی پلک جھپکنے کے برابر بھی نافرمانی نہیں کرتے، اور اس کی اطاعت گزاروں میں سے ہوتا، اور اپنے نیک بندوں سے مل جاتا، لیکن دنیا میں اس کی عنایت کم پڑ گئی۔ پس اسے یہ تمنا جنت میں عطا کی جاتی ہے، تو اسے وہ ملتا ہے جس کی اس نے تمنا کی اور وہم کیا، اور اللہ نے اسے دنیا میں ان مشقت والے اعمال سے راحت دی، اور آخرت میں وہ ان اعمال کے اصحاب کے ساتھ اعلیٰ درجات میں شامل ہو گیا۔ اور رسول اللہ صلی اللہ علیہ وسلم سے اس شخص کے بارے میں صحیح حدیث ثابت ہے جس کے پاس نہ طاقت ہے اور نہ مال، وہ کامیاب مالدار کو دیکھتا ہے کہ وہ صدقہ کرتا ہے، دیتا ہے، گردنیں آزاد کراتا ہے، لوگوں پر وسعت کرتا ہے، صلہ رحمی کرتا ہے، مسجدیں بناتا ہے، اور ایسے اعمال کرتا ہے جن تک صرف مالدار ہی پہنچ سکتا ہے، اور وہ ایسے شخص کو بھی دیکھتا ہے جو ان عبادات پر اس سے زیادہ مضبوط ہے جنہیں اس کے جسم کی طاقت انجام نہیں دے سکتی، اور وہ تمنا کرتا ہے کہ کاش اس کے پاس بھی اپنے ساتھی جیسا مال اور طاقت ہوتی تو وہ بھی اس جیسا عمل کرتا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: \"وہ دونوں اجر میں برابر ہیں۔\"\n\nاور اس کا مطلب یہ ہے کہ اسے جنت میں اس تمنا کے مطابق نعمتیں دی جائیں گی جو ان اعمال نے پیدا کی تھیں، پس اسے وہ ملے گا جس کی اس نے تمنا کی، اور یہ لذت اور نعمت میں اس سے زیادہ قوی ہوگا اگر وہ اسے اس تمنا سے پہلے جنت میں پاتا۔ پس جب وہ اس کی تمنا سے متاثر ہوا، تو اس کی نعمت زیادہ اعلیٰ ہوئی۔ پس جنات الاختصاص میں سے وہ ہے جسے اللہ اس کی ہمت اور تمنا سے پیدا کرتا ہے۔ پس یہ ایک معقول، متوہم عمل اور تمنا کی وجہ سے اختصاص ہے جس کا دنیا میں کوئی ثمرہ موجود نہیں تھا۔ اور یہی وہ اختصاص ہے جس کا ہم نے اپنے قول میں ذکر کیا:\n\n> جنت کے مراتب تقسیم ہیں\n> اعمال اور اختصاص کے درمیان۔\n\n> پس اے عقل والو! اپنے اعمال کی سواریوں پر سبقت لے جاؤ، کوئی مفر نہیں۔\n\n> اگر بلال کو نہ دیا گیا\n> تو ہمارے بچوں کو اعمال کے اثر سے صرف نجات ملی۔\n\n> کیونکہ یہ ان کے لیے شریعت نہیں تھی\n> پس یہ اختصاص ہے جس میں کوئی کمی نہیں۔\n\nپس ہم نے دوسرے اختصاص سے وہ مراد لیا جو تمنا یا وہم سے نہ ہو، اور پہلے اختصاص سے وہ مراد لیا جو تمنا اور وہم سے ہو، جو دنیا میں تمنا اور وہم کا بدلہ ہے۔\n\n### [مذموم آرزوئیں]\n\nاور جہاں تک مذموم آرزوؤں (الأماني المذمومة) کا تعلق ہے، تو وہ وہ ہیں جن کا کوئی ثمرہ نہیں ہوتا، لیکن ان کا مالک فی الحال ان سے لذت پاتا ہے، جیسا کہ کہا گیا ہے:\n\n> آرزوئیں اگر حاصل ہو جائیں تو بہترین آرزوئیں ہیں\n> ورنہ ہم نے ان کے ساتھ ایک خوشگوار زمانہ گزار لیا۔\n\nلیکن یہ انجام کار حسرت کا باعث بنتی ہیں، اور ان کے بارے میں اللہ تعالیٰ نے فرمایا: \"اور تمہیں آرزوؤں نے دھوکے میں رکھا یہاں تک کہ اللہ کا حکم آ گیا\" (وغَرَّتْكُمُ الْأَمانِيُّ حَتَّى جاءَ أَمْرُ الله)۔ اور ان کے بارے میں کہا جاتا ہے: \"جنت والے اس دن ٹھہرنے کی جگہ کے لحاظ سے بہتر اور قیلولہ کی جگہ کے لحاظ سے زیادہ حسین ہوں گے\" (أَصْحابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وأَحْسَنُ مَقِيلًا)۔ کیونکہ خیر اور شر کے درمیان کوئی فضیلت نہیں ہے۔ پس اہل جنت کا خیر افضل اور احسن نہیں ہوا مگر اس وجہ سے کہ وہ ایک واقعاتی، وجودی اور محسوس چیز ہے، پس وہ اس خیر سے افضل ہے جس کا کافر دنیا میں وہم کرتا تھا اور اپنے جہل کی وجہ سے سمجھتا تھا کہ وہ اپنے کفر کے ساتھ اس تک پہنچ جائے گا۔ اسی لیے اللہ نے اس میں \"خیر\" اور \"احسن\" کہا، اور فضیلت کی نیت لایا، جو \"افعل من کذا\" (فلاں سے زیادہ) ہے۔ پس اس معنی کو سمجھو۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب شصت و پنجم در معرفت بهشت، منازل و درجات آن و آنچه به این باب مربوط می‌شود\n\nبه نام خداوند بخشنده مهربان\n\nمراتب بهشت محسوس تقسیم شده‌اند\nبه منازلی که اعمال آن‌ها را می‌طلبند.\n\nپس هر صاحب عملی، مرکب‌هایش\nاو را به سوی آن می‌رانند و رسولان خدا آن‌ها را حجاب می‌کنند.\n\nو بهشت اختصاصات که گشوده شد\nبرای گرامی‌داشتگان، باغ‌های میراث از پی آن می‌آیند.\n\nنور ستارگان بود که ما به آن روشن می‌شدیم\nو نور ما امروز در عدن، خود ستاره‌ساز است.\n\nاگر مرکب ما غیر از صراط عرش بود\nهنگام ورود شریعت، مرکب آن زائل می‌شد.\n\nپس عمل صالح مشروع، آن را آشکار می‌سازد\nبه صورت نور، و از ذات خود، شکوه (اجلال) کسب می‌کند.\n\n### [بهشت دو نوع است: بهشت حسی و بهشت معنوی]\n\nبدان، خداوند ما و تو را تأیید کند، که بهشت دو بهشت است: بهشت محسوس (جنة حسية) و بهشت معنوی (جنة معنوية). عقل هر دوی آن‌ها را درک می‌کند، همان‌طور که عالم دو عالم است: عالم لطیف و عالم کثیف، و عالم غیب و عالم شهادت. نفس ناطقه که مورد خطاب و تکلیف است، نعمتی دارد که از طریق نظر و فکر خود و آنچه با ادله عقلی به آن رسیده، از علوم و معارف به دست می‌آورد؛ و نعمتی دارد که از لذات و شهواتی که از طریق قوای حسی خود (نفس حیوانی) به دست می‌آورد، شامل خوردن، نوشیدن، نکاح، پوشیدن، بوهای خوش و نغمه‌های دلنشینی که گوش‌ها به آن‌ها تعلق می‌گیرند، و زیبایی زنده‌ای در صورتی نیکو و دلربا که چشم آن را در زنان جوان (کاعبات)، چهره‌های زیبا، رنگ‌های متنوع، درختان و رودها مشاهده می‌کند. همه این‌ها را حواس به نفس ناطقه منتقل می‌کنند و نفس از جهت طبیعت خود از آن لذت می‌برد. اگر تنها روح حساس حیوانی از آن لذت می‌برد و نه نفس ناطقه، حیوان نیز باید از چهره زیبای زن دلربا و نوجوان خوش‌رو و رنگ‌ها و زیورآلات لذت می‌برد. پس چون هیچ حیوانی را نمی‌بینیم که از این‌ها لذت ببرد، قطعاً می‌دانیم که نفس ناطقه است که از تمام آنچه قوه حسی به او می‌دهد، لذت می‌برد، چه در ادراک آن با حیوانات شریک باشد و چه نباشد.\n\n### [بهشت محسوس با طالع اسد و بهشت معنوی از فرح الهی خلق شده است]\n\nو بدان که خداوند این بهشت محسوس (جنة المحسوسة) را با طالع اسد که همان اقلید (کلید) است و برج آن اسد است، خلق کرد؛ و بهشت معنوی (جنة المعنوية) را که روح این بهشت محسوس است، از فرح الهی (الفرح الإلهي) و از صفت کمال، ابتهاج و سرور آفرید. پس بهشت محسوس مانند جسم و بهشت معقول مانند روح و قوای آن است. به همین دلیل، حق تعالی آن را «دار حیوان» (خانه حیات) نامیده است، به دلیل حیات آن. پس اهل آن در آنجا حساً و معناً متنعم می‌شوند. و آن معنا که لطیفه انسانی است و همچنین بهشت، از ورود اهلش به آن، لذت بیشتری می‌برد. به همین دلیل است که بهشت پر شدن خود را از ساکنانش می‌طلبد. و در خبری از پیامبر (صلی الله علیه و سلم) آمده است که بهشت مشتاق بلال، علی، عمار و سلمان بود.\n\nپس بهشت را به شوق به این افراد توصیف کرد. و چه نیکوست موافقت این اسامی با معانی موجود در شوق بهشت؛ زیرا شوق در مشتاق، نوعی درد برای طلب دیدار است. و «بلال» به معنای بهبود است. و «سلمان» از سلامتی از دردها و بیماری‌هاست. و «عمار» با آبادانی آن توسط اهلش، دردش زائل می‌شود. زیرا خداوند سبحان در آنجا بر بندگانش تجلی (التجلی) می‌کند. پس «علی» (علو) شأن بهشت را به واسطه آن تجلی بر آتش که خواهر آن است، بالا می‌برد، چرا که بهشت به درجه تجلی و رؤیت دست یافته است، در حالی که آتش خانه حجاب است. پس بنگر به موافقت این چهار اسم با صورت حال بهشت، هنگامی که آن را به شوق به این اصحاب مؤمن توصیف کرد.\n\n### [مراتب مردم در نعمت بهشت]\n\nو مردم در این مسئله بر چهار مرتبه‌اند: دسته‌ای که هم مشتاقند و هم مورد اشتیاق (یشتهي ويشتهي) هستند، و آن‌ها بزرگان رجال الله از رسول، نبی و ولی کامل هستند. دسته‌ای که مشتاقند اما مورد اشتیاق نیستند (يشتهي ولا يشتهي)، و آن‌ها اصحاب احوال از رجال الله هستند که در جلال حق (جلال الله) غرق شده‌اند و معنای آن‌ها بر حسشان غلبه کرده است، و این‌ها پایین‌تر از طبقه اول هستند، زیرا آن‌ها اصحاب احوالند. دسته‌ای که مورد اشتیاقند اما مشتاق نیستند (لا يشتهي ويشتهي)، و آن‌ها مؤمنان گناهکارند. و دسته‌ای که نه مشتاقند و نه مورد اشتیاق (لا يشتهي ولا يشتهي)، و آن‌ها تکذیب‌کنندگان «يَوْمِ الدِّينِ» (روز جزا) و قائلان به نفی بهشت محسوس (جنة المحسوسة) هستند. و صنف پنجمی برای این چهار دسته وجود ندارد.\n\n### [بهشت‌های اختصاص، میراث و اعمال]\n\nو بدان که بهشت‌ها سه بهشت هستند: ۱. بهشت اختصاص الهی (جنة اختصاص إلهي) که کودکانی که به حد عمل نرسیده‌اند، از لحظه تولد تا پایان شش سالگی، وارد آن می‌شوند. و خداوند از جنات اختصاص به هر یک از بندگانش که بخواهد، عطا می‌کند. از اهل این بهشت، دیوانگانی هستند که عقل ندارند، و اهل توحید علمی، و اهل فترات (کسانی که در فاصله بین دو پیامبر زندگی کرده‌اند) و کسانی که دعوت رسول به آن‌ها نرسیده است. ۲. بهشت میراث (جنة ميراث) که هر کس از مؤمنان که وارد بهشت شود، آن را به دست می‌آورد. این‌ها مکان‌هایی هستند که برای اهل آتش تعیین شده بودند اگر وارد آن می‌شدند. ۳. بهشت اعمال (جنة الأعمال) که مردم بر اساس اعمالشان در آن جای می‌گیرند. پس هر کس در وجوه برتری بر دیگری افضل باشد، سهم بیشتری از بهشت خواهد داشت، خواه آن فاضل (برتر) پایین‌تر از مفضول (برتری داده شده) باشد یا نباشد، جز اینکه او را در این مقام به این حالت برتری داده است. پس هیچ عملی نیست مگر اینکه بهشتی مخصوص به خود دارد و تفاوت در آن میان صاحبانش بر حسب اقتضای احوالشان رخ می‌دهد.\n\nدر حدیث صحیح از پیامبر (صلی الله علیه و سلم) آمده است که به بلال فرمود: «ای بلال، با چه چیزی بر من در بهشت سبقت گرفتی؟ هیچ جایی از آن را قدم نگذاشتم مگر اینکه خش‌خش (صدای پای) تو را پیش روی خود شنیدم.» بلال گفت: «ای رسول خدا، هرگز حدثی (بی‌وضویی) برایم پیش نیامد مگر اینکه وضو گرفتم، و هرگز وضو نگرفتم مگر اینکه دو رکعت نماز خواندم.» رسول خدا (صلی الله علیه و سلم) فرمود: «به واسطه همین دو.»\n\nپس دانستیم که آن بهشت مخصوص این عمل بوده است. رسول خدا (صلی الله علیه و سلم) به بلال می‌فرمود: «چگونه به این مقام رسیدی که پیش روی من باشی و مرا حجاب کنی؟ این سبقت به این مرتبه را از کجا آوردی؟» وقتی بلال آن را ذکر کرد، پیامبر (صلی الله علیه و سلم) فرمود: «به واسطه همین دو.» پس هیچ فریضه، نافله، کار خیر، یا ترک حرام و مکروهی نیست مگر اینکه بهشت مخصوص و نعمت خاصی دارد که هر کس وارد آن شود، به آن می‌رسد.\n\n### [مراتب برتری در اعمال و طاعات]\n\nو برتری‌ها بر مراتب مختلفی هستند: یکی به سن است، اما در طاعت و اسلام. پس فرد مسن‌تر بر فرد جوان‌تر برتری دارد، اگر هر دو در یک مرتبه از عمل باشند، به دلیل سن، زیرا او در آن عمل سابقه‌دارتر است. همچنین به زمان برتری داده می‌شود؛ زیرا عمل در رمضان، روز جمعه، شب قدر، دهه‌ی ذی‌الحجه و عاشورا، بزرگ‌تر از سایر زمان‌هاست. و هر زمانی که شارع آن را تعیین کرده باشد، برتری در آن واقع می‌شود. و برتری به مکان نیز هست، مانند نمازگزار در مسجد الحرام که افضل از نمازگزار در مسجد مدینه است، و همچنین نماز در مسجد مدینه افضل از نماز در مسجد الاقصی است، و به همین ترتیب فضیلت نماز در مسجد الاقصی بر سایر مساجد. و همچنین به احوال برتری داده می‌شوند؛ زیرا نماز جماعت در فریضه افضل از نماز فرد تنها است و امثال این‌ها. و به اعمال برتری داده می‌شوند؛ زیرا نماز افضل از دور کردن آزار از راه است. و خداوند اعمال را بر یکدیگر برتری داده است. و همچنین در نفس عمل واحد برتری داده می‌شوند، مانند کسی که به خویشاوند خود صدقه می‌دهد، که او صاحب صله رحم و صدقه است، و کسی که به غیر خویشاوند خود صدقه می‌دهد، در اجر پایین‌تر از اوست. و همچنین کسی که هدیه‌ای به شریف از اهل بیت می‌دهد، افضل از کسی است که به غیر شریف هدیه می‌دهد یا به او نیکی می‌کند. وجوه برتری در شریعت بسیار است، اگرچه محصورند، اما من نمونه‌ای از آن‌ها را به تو نشان دادم تا مقصود ما را از برتری بشناسی. و برتری رسولان (علیهم السلام) بر دیگران در بهشت، تنها به واسطه بهشت اختصاص (جنة الاختصاص) آشکار می‌شود، اما در مورد عمل، آن‌ها در جنات اعمال بر حسب احوال هستند، همان‌طور که ذکر کردیم. و هر کس بر دیگری که در مقام او نیست، برتری یابد، این برتری از جنات اختصاص است نه از جنات اعمال. و برخی از مردم در یک زمان واحد، اعمال بسیاری را جمع می‌کنند؛ پس گوش خود را در آنچه شایسته است به کار می‌برند، در زمانی که چشم خود را به کار می‌برند، در زمانی که دست خود را به کار می‌برند، در زمانی که روزه می‌گیرند، در زمانی که صدقه می‌دهند، در زمانی که نماز می‌خوانند، در زمانی که ذکر می‌گویند، در زمانی که نیت فعل و ترک دارند. پس در یک زمان واحد از وجوه بسیاری پاداش می‌گیرند و بر دیگرانی که این را ندارند، برتری می‌یابند. به همین دلیل، هنگامی که رسول خدا (صلی الله علیه و سلم) هشت در بهشت را ذکر کرد که هر کس بخواهد می‌تواند از هر کدام وارد شود،\n\nابوبکر گفت: «ای رسول خدا، آیا بر انسان لازم است که از همه درها وارد شود؟» رسول خدا (صلی الله علیه و سلم) فرمود: «امیدوارم که تو از آن‌ها باشی، ای ابوبکر.»\n\nابوبکر با این سخن، همان چیزی را اراده کرد که ما ذکر کردیم؛ اینکه انسان در یک زمان واحد، در اعمال بسیاری باشد که همه درهای بهشت را شامل شود.\n\n### [نشئه آخرت و نشئه دنیا]\n\nو از اینجا نیز نشئه آخرت (النشأة الآخرة) را می‌شناسی. همان‌طور که بهشت در تمام احوالش شبیه دنیا نیست، اگرچه در اسامی مشترکند، نشئه انسان در آخرت نیز شبیه نشئه دنیا نیست، اگرچه در اسامی و صورت شخصی مشترکند. زیرا روحانیت بر نشئه آخرت غالب‌تر از حسیت است. و ما این را در همین سرای دنیا با وجود کثافت این نشئه چشیده‌ایم؛ پس انسان با عین خود در مکان‌های بسیاری است. اما عموم مردم این را در خواب درک می‌کنند.\n\n### [رؤیای ابن عربی درباره کعبه که با خشت‌های نقره و طلا بنا شده بود]\n\nو من رؤیایی برای خود در این نوع دیدم و آن را بشارتی از جانب خدا گرفتم، زیرا مطابق با حدیث نبوی از رسول خدا (صلی الله علیه و سلم) است، هنگامی که مَثَل خود را در میان انبیا (علیهم السلام) بیان فرمود.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «مَثَل من در میان انبیا، مانند مردی است که دیواری ساخت و آن را کامل کرد، جز یک خشت. و من آن خشت بودم. پس رسولی بعد از من نیست و نه پیامبری.»\n\nپس نبوت را به دیوار و انبیا را به خشت‌هایی که این دیوار با آن‌ها برپا شده، تشبیه کرد. و این تشبیهی در نهایت زیبایی است، زیرا مسمای دیوار مورد اشاره، ظهورش صحیح نمی‌شود مگر با خشت‌ها. و پیامبر (صلی الله علیه و سلم) خاتم پیامبران بود. من در مکه در سال ۵۹۹ هجری قمری بودم که در خواب دیدم کعبه با خشت‌های نقره و طلا بنا شده است؛ یک خشت نقره و یک خشت طلا. و بنا کامل شده بود و چیزی در آن باقی نمانده بود. من به آن و زیبایی‌اش نگاه می‌کردم. سپس به سمتی که بین رکن یمانی و شامی است، و به رکن شامی نزدیک‌تر است، روی گرداندم. دیدم جای دو خشت، یک خشت نقره و یک خشت طلا، از دیوار کم است. در ردیف بالا یک خشت طلا و در ردیف زیر آن یک خشت نقره کم بود. دیدم که خودم در جای آن دو خشت منقوش شدم. پس من عین آن دو خشت بودم و دیوار کامل شد و هیچ نقصی در کعبه باقی نماند. من ایستاده بودم و نگاه می‌کردم و می‌دانستم که ایستاده‌ام و می‌دانستم که عین آن دو خشت هستم، بدون شک در این باره، و اینکه آن‌ها عین ذات من هستند. بیدار شدم و خدای تعالی را شکر کردم و با تأویل گفتم: من در پیروی (اتباع) در صنف خود، مانند رسول خدا (صلی الله علیه و سلم) در میان انبیا (علیهم السلام) هستم. و شاید من از کسانی باشم که خداوند ولایت را به واسطه من ختم کرده است، و «وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ» (و این بر خدا دشوار نیست). و حدیث پیامبر (صلی الله علیه و سلم) را در مورد مَثَل دیوار و اینکه او آن خشت بود، به یاد آوردم. رؤیای خود را برای برخی از علمای این شأن در مکه از اهل توزر تعریف کردم، و او در تأویل آن، آنچه برای من رخ داده بود را خبر داد، در حالی که من نام کسی که رؤیا را دیده بود، نبرده بودم. پس از خداوند می‌خواهم که آن را با کرم خود بر من تمام کند. زیرا اختصاص الهی (الاختصاص الإلهي) نه تحجیر (محدودیت) می‌پذیرد، نه موازنه و نه عمل. و «إِنَّ ذَلِكَ مِنْ فَضْلِ اللَّهِ يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ» (این از فضل خداست که رحمت خود را به هر که بخواهد اختصاص می‌دهد، و خداوند صاحب فضل عظیم است).\n\n### [بهشت‌های اعمال: درجات و منازل آن‌ها]\n\nو بدان که بهشت اعمال (جنة الأعمال) فقط صد درجه است، همان‌طور که آتش صد دَرَک (طبقه زیرین) است. با این تفاوت که هر درجه به منازلی تقسیم می‌شود. پس از منازل آن، آنچه مخصوص این امت محمدیه است و آنچه به واسطه آن بر سایر امت‌ها برتری می‌یابد را ذکر می‌کنیم، زیرا به شهادت حق در قرآن و تعریف او، این امت «خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ» (بهترین امتی است که برای مردم پدیدار شده است). و این صد درجه در هر یک از هشت بهشت وجود دارد و صورت آن بهشت در بهشت است. و بالاترین آن‌ها جنة عدن (بهشت عدن) است که پایتخت بهشت است. در آنجا کثیب (تپه شنی) قرار دارد که محل اجتماع مردم برای رؤیت حق تعالی است. این بالاترین بهشت در میان بهشت‌هاست و در میان بهشت‌ها به منزله دارالملک (پایتخت) است. هشت دیوار آن را احاطه کرده‌اند و بین هر دو دیوار یک بهشت قرار دارد. پس بهشتی که بلافاصله پس از جنة عدن است، جنة الفردوس (بهشت فردوس) است که متوسط‌ترین و بهترین بهشت‌ها در زیر جنة عدن است. سپس جنة الخلد (بهشت جاودان)، سپس جنة النعيم (بهشت نعمت)، سپس جنة المأوى (بهشت مأوی)، سپس دار السلام (سرای سلامتی)، سپس دار المقامة (سرای اقامت). اما وسیله (الوسيلة)، بالاترین درجه در جنة عدن است و مخصوص رسول الله (صلی الله علیه و سلم) است که به واسطه دعای امتش به آن دست یافته است. حق سبحانه این کار را به حکمتی انجام داد که آن را پنهان داشت؛ زیرا ما به واسطه او به سعادت از جانب خدا رسیدیم و به واسطه او «خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ» بودیم و به واسطه او خداوند امت‌ها را به ما ختم کرد، همان‌طور که پیامبران را به او ختم کرد. و او (صلی الله علیه و سلم) همان‌طور که دستور داده شد بگوید، بشر است. و ما وجه خاصی به سوی خداوند عز و جل داریم که از آن با او مناجات می‌کنیم و او با ما مناجات می‌کند. و همچنین هر مخلوقی وجه خاصی به سوی پروردگار خود دارد. پس ما به امر خدا مأمور شدیم که برای او طلب وسیله کنیم تا در آن جای گیرد و به واسطه دعای امتش به آن برسد. پس این فضل عظیم را درک کن. و این از باب غیرت الهی است، اگر بفهمی. خداوند این پیامبر و این امت را گرامی داشته است. پس درجات بهشت از درجات موجود در آن، شامل پنج هزار و صد و پنج درجه است و نه بیشتر. و بدون شک ممکن است از این عدد بیشتر باشد، اما ما آنچه را که اهل کشف (أهل الكشف) بر آن توافق دارند و در حکم انواع از اجناس است، ذکر کردیم.\n\n### [اختصاصات پیامبر محمد (صلی الله علیه و سلم) و امتش در بهشت]\n\nو آنچه این امت محمدیه به واسطه آن بر سایر امت‌ها اختصاص یافته است، دوازده درجه است و نه بیشتر، که هیچ امتی در آن با او شریک نیست. همان‌طور که\n\nپیامبر (صلی الله علیه و سلم) بر سایر رسولان در آخرت به واسطه وسیله و گشودن باب شفاعت برتری یافت، و در دنیا به شش چیز که به هیچ پیامبری قبل از او داده نشده بود، همان‌طور که در حدیث صحیح مسلم بن حجاج آمده است. از جمله آن‌ها: عمومیت رسالتش، حلال شدن غنائم، یاری شدن با رعب (ترس)، قرار دادن تمام زمین برای او به عنوان مسجد، قرار دادن خاک آن برای او به عنوان طهور (پاک‌کننده)، و اعطای کلیدهای خزانه‌های زمین به او.\n\n### [چهار صنف اهل بهشت]\n\nسپس بدان که اهل بهشت چهار صنف هستند: ۱. رسولان، که همان انبیا هستند. ۲. اولیا، که پیروان رسولان بر بصیرت و بینه از پروردگارشان هستند. ۳. مؤمنان، که تصدیق‌کنندگان آن‌ها (علیهم السلام) هستند. ۴. دانشمندان به توحید خدا (علماء بتوحيد الله) که «لا إله إلا هو» را از طریق ادله عقلی می‌دانند. خداوند متعال می‌فرماید: «شَهِدَ اللَّهُ أَنَّهُ لَا إِلَهَ إِلَّا هُوَ وَالْمَلَائِكَةُ وَأُولُو الْعِلْمِ» (آل عمران: ۱۸) (خداوند، و فرشتگان، و صاحبان دانش، گواهی می‌دهند که معبودی جز او نیست). و این‌ها همان کسانی هستند که من از آن‌ها به عنوان علما یاد می‌کنم. و درباره آن‌ها خداوند متعال می‌فرماید: «يَرْفَعِ اللَّهُ الَّذِينَ آمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ» (مجادله: ۱۱) (خداوند کسانی از شما را که ایمان آورده‌اند و کسانی را که علم داده شده‌اند، به درجاتی بالا می‌برد).\n\n### [راه رسیدن به علم به خدا]\n\nو راه رسیدن به علم به خدا دو راه است و سومی ندارد. و هر کس خدا را از غیر این دو راه یگانه بداند، در توحید خود مقلد است. (راه اول) راه کشف (طريق الكشف) است، که علمی ضروری است و هنگام کشف (الكشف) حاصل می‌شود. انسان آن را در نفس خود می‌یابد و هیچ شبهه‌ای را نمی‌پذیرد و قادر به دفع آن نیست و دلیلی برای آن نمی‌شناسد جز آنچه در نفس خود می‌یابد. مگر اینکه برخی گفته‌اند: در کشف او، دلیل و مدلول هر دو به او داده می‌شود؛ زیرا آنچه جز با دلیل شناخته نمی‌شود، باید دلیل آن نیز بر او مکشوف شود. و صاحب ما ابوعبدالله بن کتانی در شهر فاس به این قول معتقد بود. من این را از او شنیدم و او از حال خود خبر داد و راست گفت، اما در اینکه امر فقط این‌گونه باشد، خطا کرد؛ زیرا دیگری آن را در نفس خود به صورت ذوق (ذوقاً) می‌یابد، بدون اینکه دلیل بر او مکشوف شود. اما اینکه از تجلی الهی (تجل إلهي) به او حاصل شود، این حال رسولان، انبیا و برخی از اولیا است. (و راه دوم) راه فکر و استدلال با برهان عقلی است. و این راه پایین‌تر از راه اول است؛ زیرا صاحب نظر در دلیل ممکن است دچار شبهاتی شود که دلیل او را خدشه‌دار کند، پس مجبور است برای رفع آن‌ها و جستجوی وجه حق در امر مطلوب، تلاش کند. و راه سومی وجود ندارد. پس این‌ها همان صاحبان علم (أولو العلم) هستند که به توحید خدا شهادت دادند. و برای فحول (بزرگان) این طبقه از علما به توحید خدا از طریق دلالت و نظر، علم بیشتری بر توحید در ذات با ادله قطعی وجود دارد که به هر اهل کشفی داده نمی‌شود، بلکه برخی از آن‌ها ممکن است به آن دست یابند.\n\n### [مقامات صاحبان بهشت در بهشت]\n\nو این چهار طایفه در جنات عدن (بهشت‌های عدن) هنگام رؤیت حق در کثیب سفید (تپه شنی سفید) از یکدیگر متمایز می‌شوند. و آن‌ها در آنجا بر چهار مقام هستند: دسته‌ای از آن‌ها اصحاب منابر هستند، که طبقه بالا یعنی رسولان و انبیا هستند. طایفه دوم اولیا هستند، که وارثان انبیا در قول، عمل و حال هستند و بر بینه از پروردگارشان قرار دارند، و آن‌ها اصحاب تخت‌ها و عرش هستند. طبقه سوم علمای بالله از طریق نظر برهانی عقلی هستند، و آن‌ها اصحاب کرسی‌ها هستند. و طبقه چهارم مؤمنان مقلد در توحید خود هستند، و آن‌ها مراتب دارند. و در حشر بر اصحاب نظر عقلی مقدم هستند، اما در کثیب هنگام نظر (رؤیت حق) بر مقلدین مقدم می‌شوند.\n\n### [تجلی خدا بر بندگانش در دیدار عمومی]\n\nهنگامی که خداوند بخواهد در دیدار عمومی (الزور العام) بر بندگانش تجلی (التجلی) کند، منادی حق در تمام بهشت‌ها ندا می‌دهد: «ای اهل بهشت‌ها، بشتابید به سوی منت بزرگ‌تر، مقام قرب و منظر اعلی! بیایید برای زیارت پروردگارتان در جنة عدن.» پس آن‌ها به سوی جنة عدن می‌شتابند و وارد آن می‌شوند. و هر طایفه‌ای مرتبه و منزلت خود را شناخته است و می‌نشینند. سپس دستور داده می‌شود که سفره‌ها پهن شوند. سفره‌های اختصاصی در برابر آن‌ها پهن می‌شود که هرگز مانند آن را در زندگی خود و در بهشت‌های اعمالشان ندیده و تصور نکرده بودند. و همچنین طعامی که هرگز مانند آن را در منازل خود نچشیده بودند. و همچنین نوشیدنی‌هایی که نوشیدند. هنگامی که از آن فارغ شدند، خلعت‌هایی بر آن‌ها پوشانده می‌شود که قبلاً مانند آن‌ها را نپوشیده بودند. و مصداق این امر\n\nسخن پیامبر (صلی الله علیه و سلم) است که درباره بهشت فرمود: «در آن چیزی است که چشمی ندیده، گوشی نشنیده و بر قلب بشری خطور نکرده است.»\n\nهنگامی که از آن فارغ شدند، به سوی تپه‌ای از مشک سفید (کثیب) می‌روند و منازل خود را در آن بر اساس میزان علمشان به خدا می‌گیرند، نه بر اساس میزان عملشان. زیرا عمل مخصوص نعمت‌های بهشت است، نه مشاهده رحمان. در حالی که آن‌ها بر این حال هستند، ناگهان نوری آن‌ها را خیره می‌کند. پس به سجده می‌افتند. آن نور در ظاهر در دیدگانشان، در باطن در بصیرت‌هایشان، و در تمام اجزای بدنشان و لطایف نفوسشان جاری می‌شود. پس هر شخصی از آن‌ها تماماً چشم و تماماً گوش می‌شود. پس با تمام ذات خود می‌بیند و جهات او را محدود نمی‌کند، و با تمام ذات خود می‌شنود. این نور به آن‌ها توانایی مشاهده و رؤیت می‌دهد، که کامل‌تر از مشاهده است. سپس رسولی از جانب خدا نزد آن‌ها می‌آید و می‌گوید: «آماده شوید برای رؤیت پروردگارتان جل جلاله، اینک او بر شما تجلی می‌کند.» پس آماده می‌شوند. و حق جل جلاله تجلی می‌کند. و بین او و خلقش سه حجاب است: حجاب عزت، حجاب کبریا و حجاب عظمت. آن‌ها نمی‌توانند به آن حجاب‌ها نگاه کنند. پس خداوند جل جلاله به بزرگ‌ترین حاجبان نزد خود می‌فرماید: «حجاب‌ها را بین من و بندگانم بردارید تا مرا ببینند.» پس حجاب‌ها برداشته می‌شود. و حق جل جلاله از پشت یک حجاب، در اسم جمیل لطیف خود بر دیدگان آن‌ها تجلی می‌کند. و همه آن‌ها یک چشم می‌شوند. پس نوری بر آن‌ها گشوده می‌شود که در ذواتشان جاری می‌شود و به واسطه آن تماماً گوش می‌شوند. و زیبایی پروردگار آن‌ها را مبهوت کرده و ذواتشان با نور آن جمال اقدس درخشیده است.\n\n### [بازگشت به حدیث ابوبکر نقاش درباره پنجاه موقف قیامت]\n\nرسول خدا (صلی الله علیه و سلم) از حدیث نقاش در مواقف قیامت فرمود، و این تمام آن است: پس خداوند جل جلاله می‌فرماید: «سلام بر شما بندگانم، و خوش آمدید. خداوند شما را زنده بدارد. سلام بر شما از جانب رحمان رحیم، حی قیوم. «طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ» (زمر: ۷۳) (پاکیزه شدید، پس جاودانه وارد آن شوید). بهشت بر شما پاکیزه شد، پس نفس‌های خود را به نعمت پایدار و پاداش از کریم و جاودانگی دائمی خوش سازید. شما مؤمنان ایمن هستید و من الله، مؤمن، مهیمن هستم. اسمی از اسم‌های خود را برای شما شکافتم: «لَا خَوْفٌ عَلَيْكُمْ وَلَا أَنْتُمْ تَحْزَنُونَ» (هیچ ترسی بر شما نیست و اندوهگین نخواهید شد). شما اولیای من، همسایگان من، برگزیدگان من، خاصان من و اهل محبت من هستید و در سرای من. سلام بر شما ای گروه بندگان مسلمان من. شما مسلمانان هستید و من سلام هستم و سرای من دار السلام (سرای سلامتی) است. روی خود را به شما نشان خواهم داد، همان‌طور که کلام مرا شنیدید. پس هنگامی که بر شما تجلی کردم و حجاب‌ها را از روی خود برداشتم، مرا حمد کنید و بدون حجاب از من، «بِسَلَامٍ آمِنِينَ» (با سلامتی و ایمنی) وارد سرای من شوید. به من پاسخ دهید و اطراف من بنشینید تا به من بنگرید و مرا از نزدیک ببینید. پس شما را به تحفه‌هایم گرامی می‌دارم و جوایزم را به شما می‌دهم و شما را به نور خود اختصاص می‌دهم و شما را با جمال خود می‌پوشانم و از مُلک خود به شما می‌بخشم و با خنده‌ام با شما شوخی می‌کنم و شما را با دست خود در آغوش می‌گیرم و روح خود را به شما می‌بویم. من پروردگار شما هستم که مرا می‌پرستیدید و مرا نمی‌دیدید، و مرا دوست می‌داشتید و از من می‌ترسیدید. به عزت و جلال و علو و کبریا و بها و نورم سوگند، من از شما راضی هستم و شما را دوست دارم و آنچه را دوست دارید، دوست دارم. و نزد من برای شماست آنچه نفس‌هایتان آرزو کند و چشمانتان از آن لذت ببرد. و نزد من برای شماست آنچه می‌طلبید و هر چه بخواهید، من می‌خواهم. پس از من بخواهید و حیا نکنید و خجالت نکشید و وحشت نکنید. و من الله، جواد، غنی، ملی (توانگر)، وفی و صادق هستم. و این سرای من است که شما را در آن ساکن کردم و بهشتم را برای شما مباح ساختم و نفس خود را به شما نشان دادم. و این دست من است که دارای بخشش و تری است، بر شما گشوده و دراز است و آن را از شما قبض نمی‌کنم. و من به شما نگاه می‌کنم و چشم خود را از شما برنمی‌گردانم. پس هر چه می‌خواهید و آرزو دارید، از من بخواهید. من با نفس خود با شما انس گرفتم و من برای شما همنشین و مونس هستم. پس بعد از این نه حاجتی است و نه فقر، نه بدبختی و نه مسکنت، نه ضعف و نه پیری، نه خشم و نه تنگی، و نه تحولی، ابداً و سرمداً. نعمت شما نعمت ابدی است و شما ایمن‌شدگان، مقیمان، ماندگاران، گرامی‌شدگان و متنعم‌شدگان هستید. و شما سروران و اشرافی هستید که مرا اطاعت کردید و از محارم من دوری جستید. پس حوائج خود را به سوی من بالا برید تا آن‌ها را برای شما برآورده سازم، به عنوان کرامت و نعمت.» راوی می‌گوید: پس می‌گویند: «پروردگارا، این آرزو و امید ما نبود، بلکه حاجت ما به تو، نظر به وجه کریم تو برای همیشه و همیشه و رضایت نفس تو از ماست.» پس علی اعلی، مالک الملک، سخی کریم، تبارک و تعالی، به آن‌ها می‌فرماید: «این روی من است که برای شما همیشه و جاودانه آشکار است. پس به آن بنگرید و شاد باشید، زیرا نفس من از شما راضی است. پس بهره‌مند شوید و به سوی همسرانتان برخیزید و در آغوش بگیرید و نکاح کنید، و به سوی کنیزکانتان بروید و شوخی کنید، و به سوی غرفه‌هایتان وارد شوید، و در باغ‌هایتان گردش کنید، و بر مرکب‌هایتان سوار شوید، و بر فرش‌هایتان تکیه زنید، و با کنیزان و سراری خود در بهشت‌ها انس بگیرید، و هدایای خود را از پروردگارتان بپذیرید، و لباس‌هایتان را بپوشید، و در مجالس خود سخن بگویید. سپس قیلوله‌ای (استراحتی) کنید که در آن خواب و غائله‌ای نیست، در سایه‌ای گسترده و امنی پایدار و همجواری جلیل.» سپس به سوی نهر کوثر، کافور، آب مطهر، تسنیم، سلسبیل و زنجبیل بروید، پس غسل کنید و متنعم شوید. «طُوبَى لَهُمْ وَحُسْنُ مَآبٍ» (رعد: ۲۹) (خوشا به حالشان و چه بازگشت نیکویی). سپس بروید و بر بالش‌های سبز و فرش‌های نفیس زیبا و بستر‌های برافراشته در سایه‌ای کشیده و آبی ریخته شده و میوه‌های فراوان «لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ» (واقعه: ۳۳) (نه بریده و نه ممنوع) تکیه زنید. سپس رسول خدا (صلی الله علیه و سلم) این آیه را تلاوت کرد: «إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ * هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِئُونَ * لَهُمْ فِيهَا فَاكِهَةٌ وَلَهُمْ مَا يَدَّعُونَ * سَلَامٌ قَوْلًا مِنْ رَبٍّ رَحِيمٍ» (یس: ۵۵-۵۸) (همانا اهل بهشت امروز در کاری خوشحال‌کننده مشغولند. آن‌ها و همسرانشان در سایه‌ها بر تخت‌ها تکیه زده‌اند. برای آن‌ها در آنجا میوه است و هر چه بخواهند برایشان هست. سلام، قولی است از پروردگار مهربان). سپس این آیه را تلاوت کرد: «أَصْحَابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَأَحْسَنُ مَقِيلًا» (فرقان: ۲۴) (اهل بهشت در آن روز، از نظر قرارگاه بهتر و از نظر استراحتگاه نیکوترند).\n\n### [برداشتن حجاب و متنعم شدن به مشاهده ذات]\n\nتا اینجا حدیث ابوبکر نقاش که در باب قیامت قبل از این در حدیث مواقف اسناد دادیم، به پایان رسید. سپس حق تعالی بعد از این خطاب، حجاب را برمی‌دارد و بر بندگانش تجلی می‌کند. پس آن‌ها به سجده می‌افتند. خداوند به آن‌ها می‌فرماید: «سرهای خود را بلند کنید، ای بندگان من، اینجا جای سجده نیست. من شما را دعوت نکردم مگر برای اینکه به مشاهده من متنعم شوید.» پس آن‌ها را در آن حال تا هر زمان که خدا بخواهد نگه می‌دارد. سپس به آن‌ها می‌فرماید: «آیا چیزی بعد از این برای شما باقی مانده است؟» می‌گویند: «پروردگارا، چه چیزی باقی مانده است؟ در حالی که ما را از آتش نجات دادی و به سرای رضوان خود وارد کردی و در جوار خود جای دادی و لباس‌های کرم خود را بر ما پوشاندی و روی خود را به ما نشان دادی.» حق جل جلاله می‌فرماید: «باقی مانده است.» می‌گویند: «پروردگارا، آن چیست که باقی مانده است؟» می‌فرماید: «دوام رضایت من از شما، که هرگز بر شما خشمگین نشوم.» و چه کلام شیرینی و چه بشارت لذت‌بخشی! او سبحانه با کلام، خلقت ما را آغاز کرد و فرمود: «کُن» (باش). پس اولین چیزی که از او برای ما بود، شنیدن بود. و با همان چیزی که آغاز کرد، ختم نمود و این سخن را فرمود. پس با شنیدن ختم کرد، که همین بشارت است. و مردم در رؤیت او سبحانه بر یکدیگر برتری می‌یابند و تفاوت عظیمی در آن دارند، به اندازه علمشان. پس برخی از آن‌ها چنین و چنان هستند. سپس سبحانه به فرشتگانش می‌فرماید: «آن‌ها را به قصورهایشان بازگردانید.» پس آن‌ها به دو دلیل راه را نمی‌یابند: یکی به دلیل مستی رؤیتی که بر آن‌ها عارض شده است، و دیگری به دلیل خیری که در راه به آن‌ها افزوده شده است. پس قصرهای خود را نمی‌شناسند. اگر فرشتگان آن‌ها را راهنمایی نکنند، منازل خود را نمی‌شناسند. هنگامی که به منازل خود می‌رسند، اهلشان از حور و ولدان به استقبال آن‌ها می‌آیند و می‌بینند که تمام مُلک آن‌ها از وجوهشان، بها، جمال و نوری کسب کرده است که به صورت ذاتی بر مُلکشان افاضه کرده‌اند. پس به آن‌ها می‌گویند: «شما نور و بها و جمالی افزوده‌اید که ما شما را با آن ترک نکرده بودیم.» اهلشان نیز به آن‌ها می‌گویند: «و شما نیز از بها و جمالی افزوده‌اید که هنگام جدایی ما از شما در شما نبود.» پس برخی از آن‌ها به واسطه برخی دیگر متنعم می‌شوند.\n\n### [آسایش مطلق و رحمت مطلق در اهل بهشت و اهل آتش]\n\nو بدان که آسایش (الراحة) و رحمت (الرحمة) در تمام بهشت مطلق است، اگرچه رحمت امری وجودی نیست، بلکه تعبیری است از امری که شخص مورد رحمت از آن لذت می‌برد و متنعم می‌شود، و آن امر وجودی است. پس هر کس در بهشت است، متنعم است و هر چه در آن است، نعمت است. پس حرکت آن‌ها در آنجا سختی ندارد و اعمالشان خستگی ندارد، مگر آسایش خواب که نزد آن‌ها نیست، زیرا آن‌ها نمی‌خوابند. پس هیچ نعمتی از خواب نزد آن‌ها نیست. و نعمت خواب مخصوصاً نعمتی است که اهل آتش از آن متنعم می‌شوند. پس جایگاه آسایش خواب، جهنم است. و از رحمت خدا بر اهل آتش در ایام عذابشان، خاموش شدن آتش از آن‌هاست، سپس دوباره بر آن‌ها شعله‌ور می‌شود. پس به واسطه آن، از آلام عذاب به اندازه‌ای که آتش فروکش کرده، از آن‌ها کاسته می‌شود. خداوند متعال می‌فرماید: «كُلَّمَا خَبَتْ زِدْنَاهُمْ سَعِيرًا» (اسراء: ۹۷) (هرگاه خاموش شود، شعله آن را بر آنان بیشتر می‌کنیم). و این به تو نشان می‌دهد که آتش بدون شک محسوس است؛ زیرا آتش با این وصف توصیف نمی‌شود مگر به دلیل قیام آن به اجسام، زیرا حقیقت آتش از حیث ذات خود، این وصف و نه افزایش و نه کاهش را نمی‌پذیرد، بلکه این جسمی است که با آتش سوزانده می‌شود و با آتش‌زایی شعله‌ور می‌گردد. و اگر این آیه را بر وجه دیگر حمل کنیم، می‌گوییم: قول خداوند متعال «كُلَّمَا خَبَتْ» یعنی آتشی که بر اجسامشان مسلط شده است، «زِدْنَاهُمْ سَعِيرًا» (شعله آن را بر آنان بیشتر می‌کنیم) یعنی معذبین را، زیرا نفرمود «زدناها» (آن را بیشتر کردیم). و معنای آن این است که عذاب به باطن آن‌ها منتقل می‌شود، و این شدیدترین عذاب حسی است که آن‌ها را از عذاب معنوی مشغول می‌سازد. پس هنگامی که آتش در ظواهرشان فروکش می‌کند و از جهت حس خود آسایش می‌یابند، خداوند در باطنشان تفکر در آنچه از اموری که اگر انجام می‌دادند به سعادت می‌رسیدند، کوتاهی کرده بودند، مسلط می‌کند. و وهم با سلطه خود بر آن‌ها مسلط می‌شود و عذابی شدیدتر از آنچه در آن بودند، تصور می‌کنند. پس عذاب آن‌ها به واسطه آن توهم در نفوسشان، شدیدتر از حلول عذاب همراه با تسلط آتش محسوس بر اجسامشان خواهد بود. و آن آتشی که وهم به آن‌ها می‌دهد، همان آتشی است که «الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ» (همانا آتشی که بر دل‌ها چیره می‌شود) (همزه: ۷).\n\nو این همان است که ما درباره‌اش گفتیم:\n\nآتش دو آتش است، آتشی که تماماً شعله است\nو آتش معنایی که بر ارواح چیره می‌شود.\n\nو آن آتشی است که نه سیاهی دارد و نه شعله\nاما دردی دارد که در قلب نقش می‌بندد.\n\n### [از نعمت‌های بهشت‌های اختصاص]\n\nو همچنین خداوند به اهل بهشت از آرزوها و نعمت‌های متوهم، فراتر از آنچه بر آن هستند، عطا می‌کند. پس کافی است که شخص از آن‌ها آن را توهم کند یا آرزو نماید، تا بر حسب آنچه توهم می‌کند، در آن باشد؛ اگر آرزوی معنایی کند، معنایی خواهد بود، یا اگر توهم حسی کند، محسوس خواهد بود. و آن نعمت از جنات اختصاص (جنات الاختصاص) و نعمت آن است. و این پاداش کسی است که در دنیا توهم می‌کرد و آرزو می‌نمود که اگر قدرت و توانایی داشت، از کسانی باشد که لحظه‌ای خدا را نافرمانی نمی‌کنند و از اهل طاعت او باشند و به صالحان از بندگانش ملحق شوند، اما عنایت در دنیا او را کوتاه کرد. پس این آرزو در بهشت به او داده می‌شود و آنچه آرزو و توهم کرده، برایش محقق می‌شود. و خداوند او را در دنیا از آن اعمال شاق راحت کرد و در آخرت به اصحاب آن اعمال در درجات بالا ملحق ساخت. و در حدیث صحیح از رسول خدا (صلی الله علیه و سلم) درباره مردی که نه قوت دارد و نه مال، و صاحب مال موفق را می‌بیند که صدقه می‌دهد و در راه آزاد کردن بردگان می‌بخشد و بر مردم گشایش می‌دهد و صله رحم می‌کند و مسجد می‌سازد و اعمالی انجام می‌دهد که جز صاحب مال نمی‌تواند به آن‌ها برسد، و همچنین کسی را می‌بیند که در عبادات از او قوی‌تر است و در توان جسمی او نیست که آن‌ها را انجام دهد، و آرزو می‌کند که اگر مالی و قوتی مانند صاحبش داشت، مانند عمل او را انجام می‌داد، آمده است که پیامبر (صلی الله علیه و سلم) فرمود: «پس آن دو در اجر مساوی هستند.»\n\nو معنای آن این است که در بهشت، مانند آن آرزو از نعمتی که آن اعمال تولید کرده‌اند، به او داده می‌شود. پس آنچه آرزو کرده، برای او خواهد بود و در لذت و تنعم قوی‌تر از آن است که اگر قبل از این آرزو آن را در بهشت می‌یافت. پس چون از آرزوی او حاصل شده است، نعمت آن بالاتر است. پس از جنات اختصاص، چیزی است که خداوند از همت و آرزوی او خلق می‌کند. پس این اختصاصی است که از عمل معقول متوهم و آرزویی است که ثمره‌ای در دنیا نداشته است. و این همان چیزی است که ما در قول خود به اختصاص به آن اشاره کردیم:\n\nمراتب بهشت تقسیم شده‌اند\nمیان اعمال و میان اختصاص.\n\nای صاحبان خرد، سبقت گیرید بر\nمرکب‌هایی از اعمالتان که گریزی نیست.\n\nاگر بلای (آزمایش) نبود، به کودکان ما داده نمی‌شد\nاز اثر اعمال جز رهایی.\n\nزیرا برای آن‌ها شریعتی نبود\nپس این اختصاصی است که در آن نقصی نیست.\n\nپس ما از اختصاص دوم، آنچه را که از آرزو و توهم نیست، اراده کردیم. و از اختصاص اول، آنچه را که از آرزو و توهم است، اراده کردیم، که پاداش آرزو و توهم در دنیاست.\n\n### [آرزوهای نکوهیده]\n\nاما آرزوهای نکوهیده (الأماني المذمومة) آن‌هایی هستند که ثمره‌ای ندارند، اما صاحبش در حال حاضر از آن‌ها متنعم می‌شود، چنانکه گفته شده است:\n\nآرزوهایی که اگر حاصل شوند، بهترین آرزوها خواهند بود\nوگرنه، ما زمانی را با آن‌ها در خوشی زندگی کردیم.\n\nاما در نهایت حسرت خواهند بود. و درباره آن‌ها خداوند متعال می‌فرماید: «وَغَرَّتْكُمُ الْأَمَانِيُّ حَتَّى جَاءَ أَمْرُ اللَّهِ» (حدید: ۱۴) (و آرزوها شما را فریب داد تا فرمان خدا فرا رسید). و در مورد آن گفته می‌شود: «أَصْحَابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَأَحْسَنُ مَقِيلًا» (فرقان: ۲۴) (اهل بهشت در آن روز، از نظر قرارگاه بهتر و از نظر استراحتگاه نیکوترند). زیرا تفاوتی بین خیر و شر وجود ندارد. پس خیر اهل بهشت افضل و نیکوتر نیست، مگر به دلیل اینکه امری واقع و وجودی و محسوس است. پس آن افضل از خیری است که کافر در دنیا توهم می‌کرد و به دلیل جهلش گمان می‌کرد که با کفر خود به آن می‌رسد. به همین دلیل خداوند در مورد آن فرمود: «خَيْرٌ وَأَحْسَنُ» (بهتر و نیکوتر) و صیغه تفضیل (أفعل من کذا) را آورد. پس این معنا را درک کن. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (احزاب: ۴) (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}