{
  "id": 421,
  "title": {
    "ar": "الباب الأحد والعشرون وأربعمائة في معرفة منازلة من طلب الوصول إلي بالدليل والبرهان لم يصل إلي أبدا فإنه لا يشبهني شي‏ء",
    "en": "Chapter Four Hundred and Twenty-One: Concerning the Knowledge of the Station of him who seeks Attainment to Me through Logical Proof (الدليل) and Demonstration (البرهان), [knowing that] he shall never attain Me, for nothing resembles Me.",
    "ur": "باب چار سو اکیس: اس شخص کے مقام کی معرفت میں جس نے دلیل اور برہان کے ذریعے مجھ تک رسائی چاہی، وہ مجھ تک کبھی نہیں پہنچے گا، کیونکہ کوئی شے میری مشابہت نہیں رکھتی۔",
    "fa": "باب چهارصد و بیست و یکم در معرفت (معرفة) مقام کسی که طلب وصول به من کرد به واسطه دلیل و برهان، هرگز به من نرسید، زیرا هیچ چیز شبیه من نیست."
  },
  "content": {
    "ar": "## «الباب الأحد والعشرون وأربعمائة في معرفة منازلة من طلب الوصول إلي بالدليل والبرهان لم يصل إلي أبدا فإنه لا يشبهني شي‏ء»\n\n\n> توحيد ربك لا عن كشف برهان *** فكر فوحدته لا تقبل الثاني‏\n\n\n> وكل من يقبل الثاني فمتصف *** في حكمه بزيادات ونقصان‏\n\n\n> وذاك واحد أعداد فيقبله *** وواحد العين لا يدري ببرهان‏\n\n\n> من يقبل المثل قد حارت خواطرنا *** فيه وهل رى‏ء سر عين إعلان‏\n\n\n> إن الدليل على التركيب نشأته *** فكيف يعطي وحيد العين في الشأن‏\n> يا بانيا عقده على الدليل لقد *** جهلت أين أساس القصد يا باني‏\n\n\n> من كان ذا صفة فأين وحدته *** المنزل القاصي ليس المنزل الداني‏\n\n\n> من الذي هو قاص في دلالتنا *** وقد أتيت على هذا بسلطان‏\n\n\n> الشرع توحيده توحيد مرتبة *** والحق يعضده من جانب ثاني‏\n\n\n### [تسمية البصر في العقل عين البصيرة]\n\n\nقال الله تعالى لا تُدْرِكُهُ الْأَبْصارُ يعني من كل عين من أعين الوجوه وأعين القلوب فإن القلوب ما ترى إلا بالبصر وأعين الوجوه لا ترى إلا بالبصر فالبصر حيث كان به يقع الإدراك فيسمى البصر في العقل عين البصيرة ويسمى في الظاهر بصر العين والعين في الظاهر محل للبصر والبصيرة في الباطن محل للعين الذي هو بصر في عين الوجه فاختلف الاسم عليه وما اختلف هو في نفسه فكما لا تدركه العيون بأبصارها كذلك لا تدركه البصائر بأعينها\n\n\nورد في الخبر عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن الله احتجب عن العقول كما احتجب عن الأبصار وإن الملأ الأعلى يطلبونه كما تطلبونه أنتم‏\n\n\nفاشتركنا في الطلب مع الملإ الأعلى واختلفنا في الكيفية فمنا من يطلبه بفكره والملأ الأعلى له العقل وما له الفكر ومنا من يطلبه به وليس في الملإ الأعلى من يطلبه به لأن الكامل منا هو على الصورة الإلهية التي خلقه الله عليها وليس الملك عليها فلهذا صح ممن هذه صفته أن يطلب الله به ومن طلبه به وصل إليه فإنه لم يصل إليه غيره وإن الكامل منا له نافلة تزيد على فرائضه إذا تقرب العبد بها إلى ربه أحبه فإذا أحبه كان سمعه وبصره فإذا كان الحق بصر مثل هذا العبد رآه وأدركه ببصره لأن بصره الحق فما أدركه إلا به لا بنفسه وما ثم ملك يتقرب إلى الله بنافلة بل هم في الفرائض ففرائضهم قد استغرقت أنفاسهم فلا نفل عندهم فليس لهم مقام ينتج لهم أن يكون الحق بصرهم حتى يدركوه به فهم عبيد اضطرار ونحن عبيد اضطرار من فرائضنا وعبيد اختيار من نوافلنا كما هو رب ذاتي من وجودنا ورب مشيئة من حكمه فينا فالربوبية الذاتية ضرورية لا يمكن رفعها وربوبية المشيئة عينها الإمكان في الممكنات فيرجح بها ما شاء فمن لا مشيئة له لا ترجيح له كمن لا نافلة له لا يكون الحق بصره وإن أمكن خلاف هذا عقلا ولكن كلامنا في الواقع الذي أعطاه الكشف ما كلامنا في الجواز العقلي لأنه يستحيل عندنا أن ينسب الجوار إلى الله حتى يقال يجوز أن يغفر الله لك ويجوز أن لا يغفر الله لك ويجوز أن يخلق ويجوز أن لا يخلق هذا على الله محال لأنه عين الافتقار إلى المرجح لوقوع أحد الجائزين وما ثم إلا الله وأصحاب هذا المذهب قد افتقروا إلى ما التزموه من هذا الحكم إلى إثبات الإرادة حتى يكون الحق يرجح بها ولا خفاء بما في هذا المذهب من الغلط فإنه يرجع الحق محكوما عليه بما هو زائد على ذاته وهو عين ذات أخرى وإن لم يقل فيها صاحب هذا المذهب إن تلك الذات الزائدة عين الحق ولا غير عينه فالذي نقول به إن هذه العين المخلوقة من كونها ممكنة تقبل الوجود وتقبل العدم فجائز إن تخلق فتوجد وجائز أن لا تخلق فلا توجد فإذا وجدت فبالمرجح وهو الله وإذا لم توجد فبالمرجح وهو الله يستقيم الكلام ويكون الأدب مع الله أتم بل هو الواجب أن يكون الأمر كما قلنا وأما احتجاجهم بقوله لَوْ شاءَ الله ولَوْ أَرادَ الله فهو عليهم هذا الاحتجاج لا لهم لزومية إن لو حرف امتناع لامتناع وبلا حرف امتناع لوجود\n\n\n> فانظروا وجوبه واعتبروا *** وهو نفي أن ذا سر عجيب‏\n\n\n> مثل من يدعو وما ثم لمن *** فهو يدعو نفسه ثم يجيب‏\n\n\n> وبهذا ورد النص إلى *** كل ذي عقل سليم ونجيب‏\n\n\n> ولقد كان على مثل الذي *** جاءه يطوف دهرا ويجوب‏\n\n\n> مثل ذا زرت فتى من هاشم *** أصله ما بين لخم وتجيب‏\n\n\n> واستجيبوا للذي أسمعكم *** إنه المحروم من لا يستجيب‏\n\n\n### [إن الإمكان للممكن هو حكم الذي أظهر الاختيار في المرجح‏]\n\n\nفاعلم إن الإمكان للممكن هو حكم الذي أظهر الاختيار في المرجح والذي عند المرجح أمر واحد وهو أحد الأمرين‏\nلا غير فما ثم بالنظر إلى الحق إلا أحدية محضة خالصة لا يشوبها اختيار أ لا تراه يقول تعالى لو شاء كذا لكان كذا فما شاء فما كان ذلك فنفى عن نفسه تعلق هذه المشيئة فنفى الكون عن ذلك المذكور غير إن لله تعالى نسبتين في الحكم الواقع في العالم بالامتناع أو بالوقوع فالنسبة الواحدة ما ظهر من العالم في العالم من الأحكام الواقعة والممتنعة بمشيئتهم أعني بمشيئة العالم التي أوجدها الله في العالم والنسبة الأخرى ما يظهر من الأحكام في العالم لا من العالم وذلك من الله بالوجه الخاص الذي لله في كل كائن الذي لا يعلمه إلا أهل الله خاصة والمشيئة التي يشاء بها العالم من العالم مشاءة لله تعالى من الوجه الخاص ثم هي لله كالآلة للصانع ظاهرة التعلق منفية الحكم فالعلماء بالله ينسبون الواقع بالآلة إلى الله والذين لا علم لهم ينسبونها إلى الآلة وطائفة متوسطة ينسبون إلى الآلة ما ينسب الحق إليها على حد علمه في ذلك وينسبون الكل إلى الله أدبا مع الله وحقيقة فهم الأدباء مع الله المحققين وهم الذين جمعوا بين الشرع والعقل والوجه الصحيح في العلم الإلهي لا يتمكن للعقل أن يصل إليه من حيث نظره لا بل ولا من جهة شهوده ولا من تجليه وإنما يعلم بإعلامه على الوجه الذي يكون إعلامه لمن اختصه من صور عباده الظاهرة في وجوده فإن العلم بالله من حيث النظر والشهود على السواء ما يضبط الناظر ولا المشاهد إلا الحيرة المحضة فإذا وقع الإعلام الإلهي لمن وقع حيث وقع من دنيا وآخرة حصل المقصود\n\n\n> دلالات الوجود على وجودي *** تعارضها دلالات الشهود\n\n\n> فإن العين ما شهدت سواه *** بعين شهودها عند الوجود\n\n\n> وأين الغير لم يثبت فيبدو *** مع التكثير من عين المزيد\n\n\n> عجبت لمن يعز وقد تعالى *** ويظهر في المراد وفي المريد\n\n\n> لقد نزلت معاليه وجلت *** بأحكام الدلائل بالسعود\n\n\n> أمن بعد النزول يكون مرقى *** وعين نزوله عين الصعود\n\n\n> إضافات الأمور لها احتكام *** فكون الرب في كون العبيد\n\n\n> فلو لا الأصل ما ظهرت فروع *** تدل على الأصول من الشهيد\n\n\n> لقد أظهرت سر الأمر فيه *** لكل مثاقف ندب جليد\n\n\n> صبور لا يقاومه صبور *** عزيز في تصرفه شديد\n\n\nفإن الدليل يعطي وجودي إذ ليس الدليل سوى عيني ولا عيني سوى إمكاني ومدلولي وجود الحق الذي إليه استنادي ونفي ما هو حق لي عمن إليه استنادي والشهود ينفي وجودي لا ينفي حكمي فيمن ظهر فيه ما ينسب إليه أنه عيني وهو حكمي والوجود لله فاستفدت من الحق ظهور حكمي بالصور الظاهرة لا حكم ظهور عيني فيقال وما ثم قائل غيري إن هذه الصور الظاهرة في الوجود الحق التي هي عين حكمي إنها عيني هذا يعطيه الشهود فالشهود يعارض الأدلة النظرية والخلق لله يعلمه وعلمه ليس سوى ما أعطاه ما أنا عليه في عيني وليس في البراهين أصح من برهان إن وهو عند القائلين بالبراهين البرهان الوجودي وليس يدل شي‏ء منه على معرفة هوية الحق وغايته علمه بنسبة الوجود إليه وأن عينه عين وجودي ونفي ما يستحقه الحادث عنه غير هذا لا يعرف منه بالبرهان وساعده الشرع وهو ما أوحى به إلى الرسول المترجم عنه الذي أخبر عنه أنه لا ينطق عن الهوى وأنزله في الكون منزلته فمما نطقه به مما يساعد النظر الفكري لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهو من الكلام الظاهر الذي يمكن أن يكون له وجه غير الوجه الذي يضبطه العقل منه ويكون له الوجه الذي يضبطه العقل منه وما ورد السمع بأقوى من هذه الدلالة مع هذا الاحتمال الذي فيها\n\n\n> أصح البراهين برهان إن *** وليس يريك من الحق عينا\n\n\n> ففي الحق يعطيك نفيا وسلبا *** وفيما عدا الحق يعطيك كونا\n\n\n> وينفي نعوتا أتاك القرآن *** بها مثل قول المشرع أينا\n> ويأتى به علما ظاهر *** يريد بذلك حفظا وصونا\n\n\n> وعلم إلا له بما قاله *** أصح دليل وأقواه بينا\n\n\n> تحيل العقول ببرهانها *** وجود الذي ساقه الشرع عونا\n\n\n> ويقبله كل عقل سليم *** ويكسوه حمدا فيكسوه زينا\n\n\nولما كان الدليل النظري مثلنا في المعنى مربعا في الظاهر والتثليث فرد والتربيع شفع لذلك لم يعلم من الحق إلا فردية المرتبة ولم تعلم إلا بالخلق فارتبط الحق بالخلق والخلق بالحق ارتباط التربيع بالتثليث والتثليث بالتربيع في المقدمتين اللتين أعطت العلم بتوحيد الله في ألوهيته فانظر إلى حكم الحقائق كيف اقتضت في الأدلة أن تكون على هذه الصورة فضم الوجود حقا وخلقا وواجبا لنفسه وواجبا بغيره‏\n\n\n> إن الدليل مثلث الأركان *** كالبيت وهو مربع محسوس‏\n\n\n> وكذلك الحق الذي دلت عليه *** الكائنات يبينه التقديس‏\n\n\n> حظ الدليل من الإله وجوده *** ما حظه الترجيل والتعريس‏\n\n\n> إن قلت إن الحق عنك منزه *** فدليل شرع أنه ملموس‏\n\n\n> ومنزه أيضا بشرعك فاعتبر *** في الحالتين فعقلك المنحوس‏\n\n\n> إن جاء كرب الفكر من تنزيهه *** يتلوه من رحماته التنفيس‏\n\n\n> لله عين في المراتب كلها *** تثليث أو تربيع أو تسديس‏\n\n\n> فإذا أراد الله حفظ وجوده *** في قلبكم يأتي به التخميس‏\n\n\n> الحق يحفظ نفسه وعباده *** كالخمس والعشرين يا مرءوس‏\n\n\n> فإذا أتيت بخمسة مضروبة *** في خمسة قد زال عنك البؤس‏\n\n\n> ولحقت بالملإ المقدس كونه *** وتعين التأصيل والتأسيس‏\n\n\n> ودعيت في الملاين إن حققت من *** يدعوك يا من غره إبليس‏\n\n\n> أنت المقدم في الوجود كآدم *** في كونه سبقا فأنت رئيس‏\n\n\nأراد بالبيت في هذا النظم المشبه به الكعبة فإنها ذات ثلاثة أركان مثلثة الشكل ولهذا جعل الحجر فلما اقتطع من البيت مقدار سبعة أذرع حجروا عليها بالحجر حتى يصح الطواف بالبيت فإنه‏\n\n\nصح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن الكعبة لما بنيت قصرت بهم النفقة فتركوا من البيت سبعة أذرع في الحجر\n\n\nولهذا ردها عبد الله بن الزبير على قواعد إبراهيم عليه السلام فأمر عبد الملك بن مروان الحجاج بن يوسف أن يردها على ما كانت عليه أولا ثم ندم وقال يا ليتني تركت ابن الزبير وما تحمل ثم ترك الأمر وأدار الحجر كما كان احتراما للبيت لئلا يتعرض إليه بالهدم في كل وقت من الخلفاء على ما يعطيهم في ذلك فأبقاه سدا لهذه الذريعة فاعلم ذلك أما تثليثه ليكون على اثنتي عشرة قاعدة كل ثلث من العلم بالله فالثلث الواحد من العلم بالله هو ما يعلم من الله بالدليل والثلث الآخر ما يعلم منه سبحانه بالشهود عند التجلي والثلث الثالث هو ما يعلم منه بإعلامه سبحانه وهو أصح الأقسام في العلم بالله وتفصيل قواعده يطول وقد أحلناك في العلم بها عليه سبحانه لتدرك ذلك ذوقا إن شاء الله تعالى وعن هذه القواعد ظهرت بروج الفلك وهي الحمل والثور والتومان والسرطان والأسد والسنبلة والميزان والعقرب والقوس والجدي والدالي والحوت ثلاثة منها بارية وهي الحمل والأسد والقوس وثلاثة ترابية وهي الثور والسنبلة والجدي وثلاثة هوائية وهي الجوز أو تسمى التومان ثم الميزان والدالي وثلاثة مائية وهي السرطان والعقرب والحوت فهي أربع مراتب مضروبة في ثلاثة المجموع اثنا عشر وهو انتهاء أسماء العدد من جهة بسائطه ثم يقع التركيب إلى ما لا يتناهى فمن واحد إلى تسعة والعقد ثلاثة عشرات ومئون وآلاف فالمجموع اثنا عشر وأما التسديس من ذلك فالتثليث نصفه فهما طرفان‏\nالتسديس وهو الأكثر والتثليث وهو الأقل والمتوسط بين التثليث والتسديس التربيع كل ربع تسعة وهي منتهى بسائط مفردات العدد في الآحاد فللتسعة نظر إلى الاثني عشر ونظر إلى الستة والكل ست وثلاثون قاعدة أمهات وتنتهي إلى ثلاثمائة وستين قاعدة منها ظهر درج الفلك التي الكواكب تقطعه بسيرها وقد ربط الله ما يحدثه في عالم الأركان بقطع هذه الكواكب في هذه القواعد على كثرة الكواكب وأما ما يحدثه في عالم الجنان دون النار والدنيا فيما تعطيه القواعد بحركتها لا بما يعطيه قطع الكواكب في هذه القواعد ولذلك اختلف الحكم فيما يتكون في الجنة وما يتكون في الدنيا والنار فما في الجنة مانع يمنع ما تعطيه حركة القواعد وفي الدنيا والنار موانع تمنع ما في قوة القواعد من التكوين وهذه الموانع عين قطع الكواكب في تلك القواعد\n\n\n> ما أن أقول ولا سمعت بمثله *** من ناظر في الله بالبرهان‏\n\n\n> أن الإله يراه وهو منزه *** بدليله في صورة الإنسان‏\n\n\n> إلا الذي قال الدليل بفصله *** وبعلمه من عالم الأركان‏\n\n\n> ذاك الرسول وكل وارث حكمه *** من كل معصوم من الشيطان‏\n\n\n> الفكر يعجز عن تحقق علمه *** بالله حين يجول في الأكوان‏\n\n\n> ما للجهالة في الذي جاءت به *** أقواله في الله من سلطان‏\n\n\n> فهو الوجود وما سواه باطل *** في كل ما يبدو من الأعيان‏\n\n\nفقد بان لك إن كنت من أهل الأذواق بالعلم بالله أنه لا يعلم إلا بإعلامه سبحانه وتعالى وكل من قال إنه عز وجل يعلم بالدليل أو بالشهود فإنه يضرب في حديد بارد من جميع العلماء الناظرين في العلم بالأشياء بالدليل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Twenty-One: Concerning the knowledge of the station of Him who said: \"Whoever seeks to reach Me through proof and demonstration will never reach Me, for nothing resembles Me.\"\n\nThe Oneness (توحيد) of your Lord is not through the unveiling of rational proof (برهان) or thought (فكر); for His Unity (وحدته) does not accept a second.\nAnd whoever accepts a second is characterized, in his judgment, by additions and deficiencies.\nThat [unity] is the unity of numbers (واحد أعداد), which accepts it; but the Unity of the Essence (واحد العين) is not known by proof.\nHe who accepts a like (المثل)—our thoughts are bewildered concerning Him. Has the secret of the manifest Essence (سر عين إعلان) ever been seen?\nIndeed, the proof (الدليل) originates from composition (التركيب); so how can it yield the Unique Essence (وحيد العين) in this matter?\nO builder whose doctrine rests upon proof, you have surely ignored where the foundation of the intention lies, O builder!\nIf He possesses an attribute [that allows comparison], then where is His Unity? The distant station (المنزل القاصي) is not the near station (المنزل الداني).\nWho is it that is distant in our indication (دلالتنا)? I have come upon this with authority (سلطان).\nThe Oneness of the Law (الشرع) is the Oneness of a level (توحيد مرتبة), and the Real (الحق) supports it from another side.\n\n### [Naming the Sight (البصر) in the Intellect the Eye of Insight (عين البصيرة)]\n\nAllah the Exalted said: <<لَا تُدْرِكُهُ الْأَبْصارُ>> (The sights do not perceive Him). This means from every eye of the faces (أعين الوجوه) and every eye of the hearts (أعين القلوب). For hearts only see by sight (البصر), and the eyes of the faces only see by sight. Thus, sight, wherever it is, is the means by which perception (الإدراك) occurs. Therefore, the sight in the intellect (العقل) is called the eye of insight (عين البصيرة), and in the manifest (الظاهر) it is called the sight of the eye (بصر العين). The eye in the manifest is the locus (محل) for sight, and insight (البصيرة) in the inward (الباطن) is the locus for the eye, which is the sight in the eye of the face. Thus, the name differs, but the thing itself does not differ. Just as the eyes do not perceive Him with their sights, so too the insights (البصائر) do not perceive Him with their eyes.\n\nIt is related in the tradition from the Messenger of Allah, peace and blessings be upon him, that God veiled Himself from the intellects (العقول) just as He veiled Himself from the sights (الأبصار), and that the Highest Assembly (الملأ الأعلى) seeks Him just as you seek Him.\n\nSo we share the seeking with the Highest Assembly, but we differ in the manner. Some of us seek Him through their thought (فكر), while the Highest Assembly possesses the Intellect (العقل) but not thought. Some of us seek Him by Him (به), and there is none in the Highest Assembly who seeks Him by Him, because the Perfect Human (الكامل) among us is upon the Divine Form (الصورة الإلهية) upon which God created him, and the angel is not upon it. For this reason, it is valid for one whose description is this to seek God by Him, and whoever seeks Him by Him reaches Him, for none other reaches Him. Furthermore, the Perfect Human among us has supererogatory acts (نافلة) that exceed his obligatory duties (فرائضه). When the servant draws near to his Lord through them, He loves him. When He loves him, He becomes his hearing and his sight. If the Real (الحق) is the sight of such a servant, that servant sees Him and perceives Him by His sight, because his sight is the Real. Thus, he perceives Him only by Him, not by himself. There is no angel who draws near to God through supererogatory acts; rather, they are in the obligatory duties. Their obligatory duties have consumed their breaths, so they have no supererogatory acts. Therefore, they do not have a station that results in the Real becoming their sight, so that they might perceive Him by it. They are servants of necessity (عبيد اضطرار), and we are servants of necessity in our obligatory duties, and servants of choice (عبيد اختيار) in our supererogatory acts. This is just as He is the Lord of Essence (رب ذاتي) from our existence, and the Lord of Will (رب مشيئة) from His ruling concerning us. Essential Lordship (الربوبية الذاتية) is necessary and cannot be removed, while the Lordship of Will is the very essence of possibility (الإمكان) in the possibles (الممكنات), by which He preponderates whatever He wills. Whoever has no will has no preponderance, just as whoever has no supererogatory acts will not have the Real as his sight, even if the opposite were rationally possible. However, our discussion concerns the reality granted by Unveiling (الكشف), not rational possibility (الجواز العقلي). For it is impossible, in our view, to attribute contingency (الجواز) to God, such that one might say: \"It is possible that God forgives you, and it is possible that He does not forgive you,\" or \"It is possible that He creates, and it is possible that He does not create.\" This is impossible for God, because it is the very essence of needing a Preponderator (المرجح) for one of the two possibilities to occur, and there is none but God. The adherents of this doctrine have been compelled, by the ruling they committed themselves to, to affirm the Will (الإرادة) so that the Real may preponderate by it. The error in this doctrine is not hidden, for it results in the Real being ruled by something that is an addition to His Essence (ذاته), which is the essence of another essence, even if the adherent of this doctrine does not say that this added essence is the Essence of the Real or other than His Essence. What we affirm is that this created entity (العين المخلوقة), by virtue of its contingency (إمكان), accepts existence and accepts non-existence. Thus, it is possible that it be created and exist, and it is possible that it not be created and not exist. If it exists, it is by the Preponderator, who is God. And if it does not exist, it is by the Preponderator, who is God. This makes the discourse sound, and the reverence toward God (الأدب مع الله) is more complete; rather, it is obligatory that the matter be as we have stated. As for their argument using His saying: <<لَوْ شاءَ الله>> (If God willed) and <<لَوْ أَرادَ الله>> (If God intended), this argument is against them, not for them, due to the necessity that *law* (لو) is a particle of impossibility due to impossibility (امتناع لامتناع), and not a particle of impossibility due to existence.\n\nLook at His necessity (وجوبه) and reflect, for it is a negation (نفي)—that is a wondrous secret.\nLike one who calls, yet there is no one there; so he calls himself, and then answers.\nAnd by this, the text (النص) came to every sound and noble intellect.\nAnd indeed, he who came upon it was circling and traversing for an age.\nLike this, I visited a youth of Hashim, whose origin was between Lakhm and Tujib.\nAnd respond to Him who makes you hear, for the deprived is he who does not respond.\n\n### [Indeed, the Possibility (الإمكان) of the Possible (الممكن) is the ruling of Him who manifested Choice (الاختيار) in the Preponderator (المرجح)]\n\nKnow that the possibility (الإمكان) of the possible (الممكن) is the ruling of Him who manifested Choice (الاختيار) in the Preponderator (المرجح). And what is with the Preponderator is one matter, which is one of the two matters, nothing else. Thus, when looking at the Real (الحق), there is only a pure, unadulterated Oneness (أحدية محضة خالصة) that is not tainted by choice. Do you not see that He, the Exalted, says: \"If He willed such-and-such, it would have been such-and-such.\" But He did not will, so that thing did not come into being. Thus, He negated the attachment of this Will to Himself, thereby negating the existence (الكون) of that mentioned thing. Nevertheless, God the Exalted has two relations (نسبتين) in the ruling that occurs in the world, whether by impossibility or by occurrence. The first relation is what appears in the world from the rulings that occur and those that are impossible, by their will—meaning by the will of the world which God created in the world. The second relation is what appears from the rulings in the world, but not *from* the world; rather, it is from God by the Special Aspect (الوجه الخاص) that belongs to God in every existent thing, which is known only to the People of God (أهل الله) specifically. The will by which the world wills from the world is willed by God the Exalted from the Special Aspect. Then, it is for God like the tool (الآلة) is for the Artisan (الصانع): manifest in its attachment, but negated in its ruling. The Gnostics (العلماء بالله) attribute the event (الواقع) via the tool to God, while those who have no knowledge attribute it to the tool. An intermediate group attributes to the tool what the Real attributes to it, according to His knowledge in that regard, and attributes the whole (الكل) to God out of reverence (أدبا مع الله) and reality. They are the reverent ones (الأدباء) with God, the realized ones (المحققين), who combine the Law (الشرع) and the Intellect (العقل). The sound aspect of Divine Science (العلم الإلهي) cannot be reached by the intellect through its speculation (نظره), nor even through its witnessing (شهوده) or its theophany (تجليه). Rather, it is known through His Notification (إعلامه), in the manner that His notification occurs to those whom He singles out from the forms of His servants that are manifest in His Existence. For knowledge of God, whether through speculation or witnessing, equally leaves the speculator and the witness with nothing but pure bewilderment (الحيرة المحضة). When the Divine Notification (الإعلام الإلهي) occurs to the one to whom it occurs, wherever it occurs, whether in this world or the Hereafter, the goal is achieved.\n\nThe indications of Existence (الوجود) upon my existence are contradicted by the indications of Witnessing (الشهود).\nFor the Essence (العين) witnessed none other than Him, with the eye of its witnessing, in Existence.\nAnd where is the other (الغير)? It is not established so as to appear, along with multiplicity (التكثير), from the Essence of the Increase (عين المزيد).\nI wonder at Him who is mighty and exalted, yet appears in the desired (المراد) and the desirer (المريد).\nHis high stations have descended and become manifest, by the rulings of the proofs (الدلائل) and by auspiciousness.\nIs there an ascent (مرقى) after the descent? Yet the Essence of His descent is the Essence of the ascent.\nThe attributions (إضافات) of things have their ruling: the being of the Lord (الرب) is in the being of the servants (العبيد).\nWere it not for the Origin (الأصل), no branches would appear, indicating the origins from the Witnessed (الشهيد).\nI have revealed the secret of the matter within it, for every cultured, active, and steadfast person.\nPatient, whom no patient one can resist; Mighty in His disposal, Severe.\n\nIndeed, the proof (الدليل) yields my existence, since the proof is nothing but my essence (عيني), and my essence is nothing but my possibility (إمكاني). And the proven thing (مدلولي) is the Existence of the Real (وجود الحق), upon whom I rely, and the negation of what is rightfully mine from Him upon whom I rely. Witnessing (الشهود) negates my existence, but it does not negate my ruling (حكمي) in those forms in which what is attributed to Him appears as my essence, which is my ruling. Existence belongs to God. Thus, I benefited from the Real by the manifestation of my ruling in the apparent forms, not the ruling of the manifestation of my essence. And there is no speaker other than me who says that these apparent forms in the Existence of the Real, which are the essence of my ruling, are my essence. This is what Witnessing provides. Thus, Witnessing contradicts theoretical proofs. Creation (الخلق) belongs to God, and He knows it. His knowledge is nothing but what He granted to what I am upon in my essence. Among the proofs, there is none sounder than *Burhan In* (برهان إن), which, according to those who affirm proofs, is the Existential Proof (البرهان الوجودي). Nothing in it indicates the knowledge of the Reality (هوية) of the Real. Its utmost limit is knowledge of the relation of Existence to Him, and that His Essence is the essence of my existence, and the negation of what the contingent deserves from Him. Nothing beyond this is known of Him by proof. The Law (الشرع) supports this, which is what was revealed to the Messenger, the interpreter of Him, who was informed that he does not speak from caprice, and whom He placed in the cosmos in his proper station. Among what he spoke that supports rational speculation is: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (Nothing is like Him). This is from the manifest discourse that can have an aspect other than the one the intellect grasps from it, and it can have the aspect that the intellect grasps from it. The transmitted text (السمع) did not bring a stronger indication than this, despite the possibility it contains.\n\nThe soundest of proofs is *Burhan In*, yet it does not show you the Essence (عينا) of the Real.\nRegarding the Real, it gives you negation and denial; and regarding what is other than the Real, it gives you being (كونا).\nIt negates attributes (نعوتا) that the Quran brought to you, such as the saying of the Lawgiver: \"Where are we?\"\nAnd it brings forth manifest knowledge, intending thereby preservation and protection.\nAnd knowledge of the Divine through what He said is the soundest and clearest proof.\nIntellects, by their proof, deem impossible the existence of that which the Law brought as aid.\nYet every sound intellect accepts it, clothing it in praise, thus clothing it in beauty.\n\nSince theoretical proof (الدليل النظري) is like us in meaning—square (مربع) in appearance—and the triangle (التثليث) is odd (فرد) while the square (التربيع) is even (شفع), therefore only the singularity of the Level (فردية المرتبة) of the Real is known, and this is only known through Creation (الخلق). Thus, the Real is linked to Creation, and Creation is linked to the Real, like the link of the square to the triangle, and the triangle to the square, in the two premises that yield the knowledge of God's Oneness in His Divinity (ألوهيته). Look at how the ruling of the Realities (الحقائق) necessitated that the proofs be upon this form. Thus, Existence encompasses the Real and Creation, the Necessary by Himself (واجب لنفسه) and the Necessary by another (واجب بغيره).\n\nIndeed, the proof is triangular in its pillars, like the House (البيت), yet it is a perceptible square.\nLikewise, the Real, to whom the created things (الكائنات) point, is clarified by Sanctification (التقديس).\nThe share of the proof concerning the Divine is His existence; its share is not combing the hair or resting at night.\nIf you say the Real is transcendent (منزه) from you, the proof of the Law is that He is tangible (ملموس).\nAnd He is also transcendent by your Law, so reflect upon both states, for your intellect is ill-fated (المنحوس).\nIf the distress of thought comes to you from His transcendence, relief follows it from His mercies.\nGod has an Essence (عين) in all the Levels (المراتب), whether triangular, square, or hexagonal.\nIf God wills to preserve His existence in your heart, He brings it forth through the pentad (التخميس).\nThe Real preserves Himself and His servants, like the twenty-five, O subordinate.\nIf you come with five multiplied by five, misery will depart from you.\nAnd you will join the sacred Assembly (الملأ المقدس) in its being, and the establishment of the foundation (التأسيس) will be determined.\nAnd you will be called among the millions, if you realize who calls you, O you whom Iblis has deceived.\nYou are the foremost in Existence, like Adam, in his precedence of being, so you are the chief.\n\nBy the House (البيت) in this poem, He meant the Ka'ba, which has three corners, triangular in shape. For this reason, the *Hijr* (Hatim) was made. When a measure of seven cubits was cut off from the House, they fenced it off with the *Hijr* so that the circumambulation (الطواف) of the House would be valid.\n\nIt is authentically related from the Messenger of Allah, peace and blessings be upon him, that when the Ka'ba was built, their funds fell short, so they left seven cubits of the House in the *Hijr*.\n\nFor this reason, Abdullah ibn al-Zubayr restored it upon the foundations of Abraham, peace be upon him. Then, Abd al-Malik ibn Marwan commanded al-Hajjaj ibn Yusuf to restore it to what it was originally. Then he regretted it and said, \"Would that I had left Ibn al-Zubayr and what he undertook.\" Then he abandoned the matter and circled the *Hijr* as it had been, out of respect for the House, lest the Caliphs demolish it every time based on what they deemed appropriate. So he kept it as a barrier against this pretext. Know this. As for its triangular nature, it is so that it may rest upon twelve foundations, each third being a third of the knowledge of God. The first third of the knowledge of God is what is known of God by proof (الدليل). The second third is what is known of Him, the Glorified, by witnessing (الشهود) during the Theophany (التجلي). The third third is what is known of Him by His Notification (إعلامه), the Glorified, and this is the soundest of the divisions in the knowledge of God. The detail of its foundations is lengthy, and we have referred you concerning the knowledge of them to Him, the Glorified, so that you may attain that by taste (ذوقا), God willing. From these foundations appeared the signs of the Zodiac (بروج الفلك): Aries, Taurus, Gemini, Cancer, Leo, Virgo, Libra, Scorpio, Sagittarius, Capricorn, Aquarius, and Pisces. Three of them are fiery: Aries, Leo, and Sagittarius. Three are earthy: Taurus, Virgo, and Capricorn. Three are airy: Gemini (also called *al-Tawmān*), Libra, and Aquarius. And three are watery: Cancer, Scorpio, and Pisces. These are four levels (مراتب) multiplied by three, totaling twelve, which is the end of the names of the numbers in terms of their simple units. Then composition occurs to what is endless: from one to nine, and the decades, hundreds, and thousands. The total is twelve. As for the hexad (التسديس) from that, the triangle (3) is half of it. So they are two extremes: the hexad, which is the greater, and the triangle, which is the lesser. The mean between the triangle and the hexad is the square (التربيع). Each quarter is nine, which is the end of the simple units of number in the ones. Thus, the nine has a relation to the twelve and a relation to the six. The total is thirty-six fundamental rules (قاعدة أمهات), which terminate in three hundred and sixty rules, from which appeared the degrees of the sphere (درج الفلك) that the planets traverse in their course. God has linked what He creates in the elemental world (عالم الأركان) to the traversing of these planets in these rules, despite the multitude of the planets. As for what He creates in the world of Gardens (عالم الجنان)—excluding the Fire and the world—it is based on what the rules yield by their movement, not by what the traversing of the planets yields in these rules. For this reason, the ruling differs between what comes into being in Paradise and what comes into being in the world and the Fire. In Paradise, there is a barrier that prevents what the movement of the rules yields. In the world and the Fire, there are barriers that prevent what is in the potential of the rules from coming into being. These barriers are the very traversing of the planets in those rules.\n\nI have not said, nor have I heard the like of it, from any speculator concerning God through proof:\nThat the Divine is seen, yet He is transcendent, by his proof, in the form of the human (صورة الإنسان).\nExcept for him who spoke of the proof by its distinction, and by his knowledge from the world of the elements (عالم الأركان).\nThat is the Messenger, and every heir to his ruling, from every one protected from Satan.\nThought (الفكر) is incapable of realizing knowledge of Him, when it roams the cosmos (الأكوان).\nIgnorance has no authority in what his sayings brought concerning God.\nHe is Existence (الوجود), and everything other than Him is false (باطل) in all the Fixed Entities (الأعيان).\n\nIt has become clear to you, if you are among the People of Tastes (أهل الأذواق) in the knowledge of God, that He is only known through His Notification (إعلامه), the Glorified and Exalted. And whoever says that He, the Mighty and Majestic, is known by proof or by witnessing, is striking cold iron (يضرب في حديد بارد) in the view of all scholars who speculate on the knowledge of things by proof. And God <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو اکیس: ان لوگوں کے مقام کی معرفت میں جو دلیل اور برہان کے ذریعے مجھ تک رسائی چاہتے ہیں، وہ کبھی مجھ تک نہیں پہنچیں گے، کیونکہ کوئی شے میری مانند نہیں ہے۔\n\nاپنے رب کی توحید کسی فکری برہان کے کشف سے نہیں ہے،\nپس اس کی توحید دوسرے کو قبول نہیں کرتی۔\n\nاور جو بھی دوسرے کو قبول کرتا ہے، وہ اپنے حکم میں\nزیادتیوں اور کمیوں سے متصف ہوتا ہے۔\n\nاور وہ (جو دوسرا قبول کرتا ہے) اعداد کا واحد ہے، لہٰذا وہ اسے قبول کرتا ہے،\nلیکن واحد العین (Waḥid al-‘Ayn) کو برہان سے نہیں جانا جا سکتا۔\n\nجو مثل کو قبول کرتا ہے، ہمارے خواطر اس کے بارے میں حیران ہیں،\nاور کیا عینِ اعلان کا راز دیکھا گیا ہے؟\n\nبے شک دلیل کی پیدائش ترکیب پر دلالت کرتی ہے،\nتو وہ اس معاملے میں واحد العین (Waḥid al-‘Ayn) کو کیسے بیان کر سکتی ہے؟\n\nاے وہ جو اپنے عقیدے کی بنیاد دلیل پر رکھتا ہے،\nاے بنانے والے! تو نے مقصد کی بنیاد کو نہیں جانا۔\n\nجو اس صفت کا حامل ہو، اس کی وحدت کہاں ہے؟\nدور کا مقام قریب کا مقام نہیں ہے۔\n\nہماری دلالت میں کون ہے جو دور ہے؟\nجبکہ تو اس پر ایک دلیل (سلطان) کے ساتھ آیا ہے۔\n\nشریعت کی توحید مرتبے کی توحید ہے،\nاور الحق (الحق) دوسرے پہلو سے اس کی تائید کرتا ہے۔\n\n### عقل میں بصر (بصارت) کو عین البصیرۃ (Ain al-Baṣīra) کا نام دینا\n\nاللہ تعالیٰ نے فرمایا: \"اسے نگاہیں نہیں پا سکتیں\" (لَا تُدْرِكُهُ الْأَبْصَارُ)۔ یعنی چہروں کی آنکھوں اور دلوں کی آنکھوں میں سے ہر آنکھ سے۔ کیونکہ دل بھی بصر (بصارت) کے بغیر نہیں دیکھتے اور چہروں کی آنکھیں بھی بصر کے بغیر نہیں دیکھتیں۔ پس بصر جہاں بھی ہو، اسی کے ذریعے ادراک واقع ہوتا ہے۔ لہٰذا عقل میں بصر کو عین البصیرۃ (Ain al-Baṣīra) کہا جاتا ہے، اور ظاہر میں اسے بصر العین (آنکھ کی بصارت) کہا جاتا ہے۔ ظاہر میں آنکھ بصر کا محل ہے، اور باطن میں بصیرت اس عین کا محل ہے جو چہرے کی آنکھ میں بصر ہے۔ پس اس پر نام مختلف ہوئے، لیکن وہ اپنی ذات میں مختلف نہیں ہوا۔ لہٰذا جس طرح آنکھیں اپنی بصارتوں سے اسے نہیں پا سکتیں، اسی طرح بصیرتیں بھی اپنی آنکھوں سے اسے نہیں پا سکتیں۔\n\nرسول اللہ صلی اللہ علیہ وسلم سے روایت میں آیا ہے کہ اللہ تعالیٰ نے عقلوں سے بھی اسی طرح پردہ کر لیا ہے جس طرح نگاہوں سے پردہ کیا ہے، اور بے شک ملأ اعلیٰ (فرشتوں کی جماعت) بھی اسے اسی طرح طلب کرتے ہیں جس طرح تم اسے طلب کرتے ہو۔\n\nپس ہم ملأ اعلیٰ کے ساتھ طلب میں شریک ہیں، لیکن کیفیت میں مختلف ہیں۔ ہم میں سے کچھ ایسے ہیں جو اسے اپنی فکر سے طلب کرتے ہیں، جبکہ ملأ اعلیٰ کے پاس عقل ہے، فکر نہیں۔ اور ہم میں سے کچھ ایسے ہیں جو اسے (اپنے نفس) سے طلب کرتے ہیں، جبکہ ملأ اعلیٰ میں کوئی ایسا نہیں جو اسے اس سے طلب کرے۔ کیونکہ ہم میں سے جو کامل (الإنسان الکامل) ہے، وہ اس صورتِ الٰہیہ پر ہے جس پر اللہ نے اسے پیدا کیا، جبکہ فرشتہ اس صورت پر نہیں ہے۔ اسی لیے جس کی یہ صفت ہو، اس کے لیے جائز ہے کہ وہ اللہ کو اس (صورت) کے ذریعے طلب کرے، اور جس نے اسے اس کے ذریعے طلب کیا، وہ اس تک پہنچ گیا، کیونکہ اس کے سوا کوئی دوسرا اس تک نہیں پہنچا۔ اور ہم میں سے کامل کے لیے نوافل ہیں جو اس کے فرائض سے زیادہ ہیں، جب بندہ ان کے ذریعے اپنے رب کا قرب حاصل کرتا ہے تو وہ اس سے محبت کرتا ہے۔ جب وہ اس سے محبت کرتا ہے تو وہ اس کی سماعت اور اس کی بصارت بن جاتا ہے۔ پس جب الحق (الحق) ایسے بندے کی بصارت بن جاتا ہے، تو وہ اسے دیکھتا ہے اور اپنی بصارت سے اس کا ادراک کرتا ہے، کیونکہ اس کی بصارت الحق (الحق) ہے۔ پس اس نے اس کا ادراک صرف اسی (الحق) کے ذریعے کیا، نہ کہ اپنے نفس کے ذریعے۔ اور وہاں کوئی فرشتہ نہیں جو نفل کے ذریعے اللہ کا قرب حاصل کرے، بلکہ وہ فرائض میں مشغول ہیں، اور ان کے فرائض نے ان کے سانسوں کو گھیر رکھا ہے، لہٰذا ان کے پاس نفل نہیں ہے۔ پس ان کے لیے کوئی ایسا مقام نہیں جو یہ نتیجہ دے کہ الحق (الحق) ان کی بصارت بن جائے تاکہ وہ اس کے ذریعے اس کا ادراک کر سکیں۔ پس وہ اضطرار کے بندے ہیں، اور ہم اپنے فرائض کی وجہ سے اضطرار کے بندے ہیں، اور اپنے نوافل کی وجہ سے اختیار کے بندے ہیں۔ جیسا کہ وہ ہمارے الوجود (الوجود) سے ربِ ذاتی ہے، اور ہمارے بارے میں اپنے حکم سے ربِ مشیئت ہے۔ پس ربوبیتِ ذاتیہ ضروری ہے جسے ختم نہیں کیا جا سکتا، اور ربوبیتِ مشیئت ممکنات میں عینِ امکان ہے، جس کے ذریعے وہ جو چاہتا ہے ترجیح دیتا ہے۔ پس جس کے پاس مشیئت نہیں، اس کے پاس ترجیح نہیں، جیسے جس کے پاس نفل نہیں، الحق (الحق) اس کی بصارت نہیں بنتا۔ اگرچہ عقلی طور پر اس کے خلاف ممکن ہو، لیکن ہماری گفتگو اس واقعے کے بارے میں ہے جو الکشف (الکشف) نے عطا کیا ہے، نہ کہ عقلی جواز کے بارے میں۔ کیونکہ ہمارے نزدیک اللہ کی طرف جواز (امکان) کی نسبت کرنا محال ہے، یہاں تک کہ یہ کہا جائے کہ اللہ کے لیے جائز ہے کہ وہ تمہیں بخش دے اور جائز ہے کہ وہ تمہیں نہ بخشے، اور جائز ہے کہ وہ پیدا کرے اور جائز ہے کہ وہ پیدا نہ کرے۔ یہ اللہ پر محال ہے، کیونکہ یہ دو جائز امور میں سے کسی ایک کے وقوع کے لیے مرجح (ترجیح دینے والے) کی محتاجی کا عین ہے۔ اور وہاں اللہ کے سوا کچھ نہیں۔ اور اس مذہب کے پیروکار اس حکم کو لازم کرنے میں ارادے کے اثبات کے محتاج ہوئے تاکہ الحق (الحق) اس کے ذریعے ترجیح دے۔ اور اس مذہب کی غلطی پوشیدہ نہیں ہے، کیونکہ یہ الحق (الحق) کو اس چیز کا محکوم بناتا ہے جو اس کی ذات پر زائد ہے، اور وہ عینِ ذاتِ دیگر ہے، اگرچہ اس مذہب کا پیروکار یہ نہ کہے کہ وہ زائد ذات عینِ الحق (الحق) ہے یا غیرِ عین ہے۔ پس جو ہم کہتے ہیں وہ یہ ہے کہ یہ مخلوق عین، ممکن ہونے کی وجہ سے، الوجود (الوجود) کو بھی قبول کرتی ہے اور عدم کو بھی قبول کرتی ہے۔ پس جائز ہے کہ وہ پیدا کی جائے اور موجود ہو جائے، اور جائز ہے کہ وہ پیدا نہ کی جائے اور موجود نہ ہو۔ پس جب وہ موجود ہوتی ہے تو مرجح (ترجیح دینے والے) کے ذریعے، اور وہ اللہ ہے۔ اور جب وہ موجود نہیں ہوتی تو مرجح کے ذریعے، اور وہ اللہ ہے۔ اس طرح بات درست ہوتی ہے اور اللہ کے ساتھ ادب مکمل ہوتا ہے، بلکہ یہ واجب ہے کہ معاملہ ویسا ہی ہو جیسا ہم نے کہا۔ اور جہاں تک ان کا قول \"اگر اللہ چاہتا\" (لَوْ شَاءَ اللَّهُ) اور \"اگر اللہ ارادہ کرتا\" (لَوْ أَرَادَ اللَّهُ) سے احتجاج کرنا ہے، تو یہ احتجاج ان کے خلاف ہے نہ کہ ان کے حق میں، کیونکہ \"لو\" حرفِ امتناع لامتناع (ایک کے ممتنع ہونے کی وجہ سے دوسرے کا ممتنع ہونا) ہے، اور \"بلا\" حرفِ امتناع لوجود (وجود کی وجہ سے امتناع) ہے۔\n\nپس تم اس کے وجوب کو دیکھو اور غور کرو،\nاور یہ نفی ہے، بے شک یہ ایک عجیب راز ہے۔\n\nاس شخص کی مثال جو پکارتا ہے اور وہاں کوئی نہیں،\nپس وہ خود کو پکارتا ہے اور پھر جواب دیتا ہے۔\n\nاور اسی کے ساتھ نص ہر سلیم\nاور نجیب عقل والے تک پہنچی ہے۔\n\nاور بے شک وہ اس کی مثل پر تھا جو اس کے پاس آیا،\nوہ زمانے تک طواف کرتا اور گھومتا رہا۔\n\nاس کی مثل میں نے ہاشم کے ایک جوان کی زیارت کی،\nجس کی اصل لخم اور تجیب کے درمیان ہے۔\n\nاور اس کی بات قبول کرو جس نے تمہیں سنایا،\nبے شک وہ محروم ہے جو قبول نہیں کرتا۔\n\n### بے شک ممکن کے لیے امکان اس ذات کا حکم ہے جس نے مرجح (ترجیح دینے والے) میں اختیار کو ظاہر کیا۔\n\nپس جان لو کہ ممکن کے لیے امکان اس ذات کا حکم ہے جس نے مرجح (ترجیح دینے والے) میں اختیار کو ظاہر کیا۔ اور مرجح کے پاس ایک ہی امر ہے، اور وہ دو امور میں سے ایک ہے، بس۔ پس الحق (الحق) کے اعتبار سے وہاں صرف احدیتِ محضہ خالصہ ہے، جس میں اختیار کی آمیزش نہیں ہے۔ کیا تم نہیں دیکھتے کہ اللہ تعالیٰ فرماتا ہے: \"اگر وہ ایسا چاہتا تو ایسا ہوتا\"۔ پس اس نے نہیں چاہا تو وہ نہیں ہوا۔ پس اس نے اپنے آپ سے اس مشیئت کے تعلق کی نفی کی، اور اس مذکورہ چیز سے وجود (کون) کی نفی کر دی۔ البتہ اللہ تعالیٰ کے لیے عالم میں واقع ہونے والے حکم میں، خواہ وہ امتناع ہو یا وقوع، دو نسبتیں ہیں۔ ایک نسبت وہ ہے جو عالم میں عالم سے ظاہر ہوئی، یعنی وہ احکام جو واقع ہوئے یا ممتنع ہوئے، ان کی مشیئت سے، میرا مطلب ہے عالم کی اس مشیئت سے جسے اللہ نے عالم میں پیدا کیا۔ اور دوسری نسبت وہ ہے جو عالم میں احکام ظاہر ہوتے ہیں، لیکن عالم سے نہیں، اور یہ اللہ کی طرف سے اس خاص پہلو سے ہے جو ہر موجود میں اللہ کے لیے ہے، جسے صرف اہل اللہ ہی جانتے ہیں۔ اور وہ مشیئت جس کے ذریعے عالم، عالم سے چاہتا ہے، وہ اللہ کی مشیئت ہے ایک خاص پہلو سے۔ پھر وہ اللہ کے لیے صانع کے آلے کی مانند ہے، جس کا تعلق تو ظاہر ہے لیکن حکم کی نفی ہے۔ پس اللہ کے علماء آلے کے ذریعے واقع ہونے والے کو اللہ کی طرف منسوب کرتے ہیں، اور جو علم نہیں رکھتے وہ اسے آلے کی طرف منسوب کرتے ہیں۔ اور ایک درمیانی گروہ ہے جو آلے کی طرف وہی منسوب کرتا ہے جو الحق (الحق) اس کی طرف منسوب کرتا ہے، اس بارے میں اپنے علم کی حد تک، اور ادب کے طور پر اور حقیقت میں سب کو اللہ کی طرف منسوب کرتے ہیں۔ پس یہی وہ محققین ہیں جو اللہ کے ساتھ باادب ہیں، اور یہی وہ ہیں جنہوں نے شریعت اور عقل کو جمع کیا۔ اور علمِ الٰہی میں صحیح پہلو وہ ہے جہاں عقل اپنی نظر سے نہیں پہنچ سکتی، بلکہ نہ ہی اپنے الشہود (الشہود) کی جہت سے اور نہ ہی اپنے التجلی (التجلی) سے۔ بلکہ یہ صرف اس کے اعلام (خبر دینے) سے معلوم ہوتا ہے، اس طریقے پر جس طرح وہ اپنے ان بندوں کی صورتوں میں اعلام کرتا ہے جنہیں اس نے اپنے الوجود (الوجود) میں ظاہر کیا ہے۔ کیونکہ اللہ کا علم، نظر اور الشہود (الشہود) کے اعتبار سے، دیکھنے والے اور مشاہدہ کرنے والے کو محض حیرت کے سوا کچھ نہیں دیتا۔ پس جب الٰہی اعلام اس شخص کو حاصل ہو جائے جسے حاصل ہونا ہے، خواہ دنیا میں ہو یا آخرت میں، تو مقصود حاصل ہو جاتا ہے۔\n\nمیرے الوجود (الوجود) پر الوجود (الوجود) کی دلالتیں،\nان کی مخالفت الشہود (الشہود) کی دلالتیں کرتی ہیں۔\n\nکیونکہ عین نے الوجود (الوجود) کے وقت اپنی عینِ الشہود (الشہود) سے\nاس کے سوا کسی کا مشاہدہ نہیں کیا۔\n\nاور غیر کہاں ہے جو ثابت نہیں ہوا کہ وہ کثرت کے ساتھ\nعینِ مزید سے ظاہر ہو؟\n\nمجھے اس پر تعجب ہے جو عزیز ہے اور بلند ہے،\nاور وہ مراد (چاہنے والے) اور مرید (چاہے جانے والے) میں ظاہر ہوتا ہے۔\n\nبے شک اس کی بلندیاں نازل ہوئیں اور دلائل کے احکام کے ساتھ\nسعادتوں میں جلوہ گر ہوئیں۔\n\nکیا نزول کے بعد کوئی چڑھائی ہو سکتی ہے؟\nجبکہ اس کے نزول کی عین، عینِ صعود ہے۔\n\nامور کی اضافات کے لیے حکم ہے،\nپس رب کا وجود بندوں کے وجود میں ہے۔\n\nاگر اصل نہ ہوتی تو شاخیں ظاہر نہ ہوتیں\nجو شاہد سے اصولوں پر دلالت کرتی ہیں۔\n\nبے شک میں نے اس میں امر کا راز ہر سمجھدار،\nچست اور مضبوط شخص کے لیے ظاہر کر دیا ہے۔\n\nوہ صابر ہے، کوئی صابر اس کا مقابلہ نہیں کر سکتا،\nوہ اپنے تصرف میں عزیز اور شدید ہے۔\n\nپس بے شک دلیل میرے الوجود (الوجود) کو عطا کرتی ہے، کیونکہ دلیل میری عین کے سوا کچھ نہیں، اور میری عین میرے امکان کے سوا کچھ نہیں، اور میرا مدلول الحق (الحق) کا الوجود (الوجود) ہے جس پر میرا انحصار ہے، اور اس چیز کی نفی ہے جو میرے لیے حق ہے اس ذات سے جس پر میرا انحصار ہے۔ اور الشہود (الشہود) میرے الوجود (الوجود) کی نفی کرتا ہے، لیکن اس شخص میں میرے حکم کی نفی نہیں کرتا جس میں وہ ظاہر ہوا جسے میری عین کہا جاتا ہے، اور وہ میرا حکم ہے۔ اور الوجود (الوجود) اللہ کے لیے ہے۔ پس میں نے الحق (الحق) سے ظاہری صورتوں میں اپنے حکم کے ظہور کا فائدہ اٹھایا، نہ کہ اپنی عین کے ظہور کا حکم۔ اور وہاں میرے سوا کوئی کہنے والا نہیں کہ الوجود (الوجود) الحق (الحق) میں یہ ظاہری صورتیں جو میرے حکم کا عین ہیں، وہ میری عین ہیں۔ یہ الشہود (الشہود) عطا کرتا ہے۔ پس الشہود (الشہود) نظری دلائل کی مخالفت کرتا ہے۔ اور مخلوق اللہ کے لیے ہے، وہ اسے جانتا ہے، اور اس کا علم اس کے سوا کچھ نہیں جو اس نے مجھے میری عین میں ہونے کی حیثیت سے عطا کیا۔ اور براہین میں \"برہانِ اِنّ\" سے زیادہ صحیح کوئی برہان نہیں، اور یہ براہین کے قائلین کے نزدیک البرہان الوجودي (وجود کا برہان) ہے۔ اور اس میں سے کوئی چیز الحق (الحق) کی ہویت کی المعرفۃ (المعرفۃ) پر دلالت نہیں کرتی۔ اس کی انتہا یہ ہے کہ اس کے الوجود (الوجود) کی نسبت کا علم ہو، اور یہ کہ اس کی عین میرے الوجود (الوجود) کا عین ہے، اور حادث کے مستحق امور کی اس سے نفی ہو۔ اس کے علاوہ برہان سے کچھ معلوم نہیں ہوتا۔ اور شریعت نے اس کی مدد کی، اور وہ وہ ہے جو رسولِ مترجم کی طرف وحی کیا گیا، جس کے بارے میں خبر دی گئی کہ وہ خواہش سے نہیں بولتے، اور اسے کائنات میں اس کا مقام دیا۔ پس جو کچھ انہوں نے کہا جو فکری نظر کی تائید کرتا ہے، وہ یہ ہے: \"اس کی مثل کوئی شے نہیں\" (لَيْسَ كَمِثْلِهِ شَيْءٌ)۔ اور یہ کلامِ ظاہر میں سے ہے جس کا ایک پہلو وہ ہو سکتا ہے جسے عقل اس سے ضبط کرتی ہے، اور ایک پہلو وہ ہو سکتا ہے جسے عقل اس سے ضبط نہیں کرتی۔ اور اس احتمال کے باوجود، سماعت میں اس دلالت سے زیادہ قوی کوئی چیز وارد نہیں ہوئی۔\n\nبراہین میں سب سے صحیح برہانِ اِنّ ہے،\nاور وہ تمہیں الحق (الحق) کی عین نہیں دکھاتا۔\n\nپس الحق (الحق) میں وہ تمہیں نفی اور سلب عطا کرتا ہے،\nاور الحق (الحق) کے سوا میں وہ تمہیں وجود (کون) عطا کرتا ہے۔\n\nاور ان صفات کی نفی کرتا ہے جو قرآن تمہارے پاس لایا،\nجیسے شارع کا قول: \"ہم کہاں ہیں؟\"\n\nاور وہ اسے ایک ظاہر علم کے ساتھ لاتا ہے،\nجس سے وہ حفاظت اور بچاؤ کا ارادہ رکھتا ہے۔\n\nاور اس کے کہے ہوئے کا علمِ الٰہی\nسب سے صحیح اور واضح ترین دلیل ہے۔\n\nعقلیں اپنے برہان سے اس ذات کے الوجود (الوجود) کو محال قرار دیتی ہیں\nجسے شریعت نے مدد کے طور پر پیش کیا۔\n\nاور ہر سلیم عقل اسے قبول کرتی ہے،\nاور اسے حمد کا لباس پہنا کر زینت بخشتی ہے۔\n\nاور چونکہ نظری دلیل معنی میں ہماری طرح ہے، ظاہر میں مربع ہے، اور تثلیث (تین ہونا) طاق ہے اور تربع (چار ہونا) جفت ہے۔ اسی لیے الحق (الحق) میں صرف مرتبے کی فردیت معلوم ہوئی، اور وہ بھی مخلوق کے ذریعے ہی معلوم ہوئی۔ پس الحق (الحق) مخلوق سے اور مخلوق الحق (الحق) سے اس طرح جڑ گئی جس طرح تربع تثلیث سے اور تثلیث تربع سے ان دو مقدمات میں جڑ گئی جنہوں نے اللہ کی الوہیت میں توحید کا علم دیا۔ پس دیکھو کہ حقائق کے حکم نے دلائل میں کس طرح یہ صورت اختیار کی، پس الوجود (الوجود) کو الحق (الحق) اور مخلوق، اور واجب لنفسہ اور واجب بغیرہ کو شامل کیا۔\n\nبے شک دلیل کے ارکان مثلث ہیں،\nجیسے بیت (کعبہ) جو محسوس طور پر مربع ہے۔\n\nاور اسی طرح الحق (الحق) جس پر کائنات دلالت کرتی ہے،\nاسے تقدیس بیان کرتی ہے۔\n\nدلیل کا الٰہ سے حصہ اس کا الوجود (الوجود) ہے،\nاس کا حصہ کنگھی کرنا اور رات کو ٹھہرنا نہیں ہے۔\n\nاگر تم کہو کہ الحق (الحق) تم سے منزہ ہے،\nتو شرعی دلیل یہ ہے کہ وہ ملموس (چھوا جانے والا) ہے۔\n\nاور تمہاری شریعت سے وہ منزہ بھی ہے، پس دونوں حالتوں میں غور کرو،\nتمہاری عقل منحوس ہے۔\n\nاگر تمہارے پاس اس کی تنزیہہ سے فکر کی پریشانی آئے،\nتو اس کے بعد اس کی رحمتوں سے کشادگی آتی ہے۔\n\nاللہ کے لیے تمام مراتب میں ایک عین ہے،\nخواہ وہ تثلیث ہو یا تربع یا تسدیس (چھ ہونا)۔\n\nپس جب اللہ تمہارے دل میں اپنے الوجود (الوجود) کی حفاظت چاہتا ہے،\nتو وہ اسے تخمیس (پانچ ہونے) کے ساتھ لاتا ہے۔\n\nالحق (الحق) اپنی ذات اور اپنے بندوں کی حفاظت کرتا ہے،\nاے متبوع! پچیس کی طرح۔\n\nپس جب تم پانچ کو پانچ سے ضرب دے کر آؤ گے،\nتو تم سے بدحالی دور ہو جائے گی۔\n\nاور تم مقدس ملأ کے وجود سے جا ملو گے،\nاور تاصیل (اصل قائم کرنا) اور تاسیس (بنیاد رکھنا) متعین ہو جائے گی۔\n\nاور تم ملأ میں پکارے جاؤ گے، اگر تم نے اس کو پہچان لیا جو تمہیں پکارتا ہے،\nاے وہ جسے ابلیس نے دھوکہ دیا۔\n\nتم الوجود (الوجود) میں آدم کی طرح مقدم ہو،\nاپنے وجود میں سبقت کی وجہ سے، پس تم رئیس ہو۔\n\nاس نظم میں بیت (گھر) سے مراد کعبہ ہے، کیونکہ اس کے تین ارکان مثلث شکل کے ہیں۔ اسی لیے حجر (حطیم) بنایا گیا۔ جب بیت اللہ سے تقریباً سات ہاتھ کاٹ دیے گئے تو انہوں نے حجر کے ذریعے اس پر حد بندی کر دی تاکہ بیت اللہ کا طواف صحیح ہو سکے۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم سے صحیح روایت ہے کہ جب کعبہ کی تعمیر ہوئی تو ان کے پاس خرچ کم پڑ گیا، چنانچہ انہوں نے بیت اللہ کا سات ہاتھ کا حصہ حجر میں چھوڑ دیا۔ اسی لیے عبداللہ بن زبیر رضی اللہ عنہ نے اسے قواعدِ ابراہیم علیہ السلام پر واپس کر دیا، پھر عبدالملک بن مروان نے حجاج بن یوسف کو حکم دیا کہ اسے پہلی حالت پر واپس کر دے۔ پھر اسے ندامت ہوئی اور اس نے کہا: کاش میں ابن زبیر کو چھوڑ دیتا اور جو کچھ اس نے کیا اسے رہنے دیتا۔ پھر اس نے معاملہ چھوڑ دیا اور حجر کو ویسا ہی کر دیا جیسا وہ پہلے تھا، بیت اللہ کے احترام میں، تاکہ خلفاء ہر وقت اسے منہدم کرنے کی جسارت نہ کریں، اس لیے اس نے اسے اس فتنے کو روکنے کے لیے باقی رکھا۔ پس یہ جان لو۔ جہاں تک اس کی تثلیث (تین ہونے) کا تعلق ہے، تو یہ اس لیے ہے تاکہ وہ بارہ قواعد پر ہو، اور اللہ کے علم کا ہر تہائی حصہ۔ پس اللہ کے علم کا ایک تہائی وہ ہے جو اللہ کے بارے میں دلیل سے معلوم ہوتا ہے، اور دوسرا تہائی وہ ہے جو اللہ سبحانہ و تعالیٰ کے بارے میں الشہود (الشہود) کے وقت التجلی (التجلی) سے معلوم ہوتا ہے، اور تیسرا تہائی وہ ہے جو اللہ سبحانہ و تعالیٰ کے اعلام (خبر دینے) سے معلوم ہوتا ہے، اور یہ اللہ کے علم کے سب سے صحیح حصے ہیں۔ اور اس کے قواعد کی تفصیل طویل ہے، اور ہم نے تمہیں ان کے علم کے لیے اللہ سبحانہ و تعالیٰ کی طرف رجوع کرایا ہے تاکہ تم اسے ذوقاً (ذوق) حاصل کر سکو، ان شاء اللہ تعالیٰ۔ اور ان قواعد سے فلک کے برج ظاہر ہوئے، جو یہ ہیں: حمل، ثور، توامان (جوزا)، سرطان، اسد، سنبلہ، میزان، عقرب، قوس، جدی، دالی (دلو) اور حوت۔ ان میں سے تین ناری ہیں: حمل، اسد اور قوس۔ اور تین خاکی ہیں: ثور، سنبلہ اور جدی۔ اور تین ہوائی ہیں: جوزا (جسے توامان بھی کہتے ہیں)، پھر میزان اور دالی۔ اور تین آبی ہیں: سرطان، عقرب اور حوت۔ پس یہ چار مراتب ہیں جو تین سے ضرب کھاتی ہیں، مجموعہ بارہ ہے، اور یہ اعداد کے ناموں کی انتہا ہے ان کے بسیط ہونے کی جہت سے۔ پھر ترکیب واقع ہوتی ہے جو لامتناہی تک جاتی ہے۔ پس ایک سے نو تک، اور عقد تین ہیں: دہائیاں، سینکڑے اور ہزار۔ پس مجموعہ بارہ ہے۔ اور جہاں تک اس میں تسدیس (چھ ہونے) کا تعلق ہے، تو تثلیث اس کا نصف ہے، پس یہ دو کنارے ہیں: تسدیس جو زیادہ ہے، اور تثلیث جو کم ہے۔ اور تثلیث اور تسدیس کے درمیان متوسط تربع (چار ہونا) ہے، ہر چوتھا حصہ نو ہے، اور یہ آحاد میں عدد کے مفرداتِ بسیطہ کی انتہا ہے۔ پس نو کا تعلق بارہ سے بھی ہے اور چھ سے بھی۔ اور کل چھتیس امہات قواعد ہیں، اور یہ تین سو ساٹھ قواعد تک پہنچتی ہیں، جن سے فلک کے درجے ظاہر ہوئے جنہیں کواکب اپنی گردش سے قطع کرتے ہیں۔ اور اللہ نے عالمِ ارکان میں جو کچھ پیدا کیا ہے، اسے ان قواعد میں ان کواکب کے قطع کرنے سے جوڑ دیا ہے، کواکب کی کثرت کے باوجود۔ اور جہاں تک عالمِ جنان (جنت) میں، نہ کہ دوزخ اور دنیا میں، جو کچھ پیدا ہوتا ہے، وہ قواعد کی حرکت سے عطا ہوتا ہے، نہ کہ ان قواعد میں کواکب کے قطع کرنے سے۔ اسی لیے جنت میں جو کچھ بنتا ہے اور دنیا و دوزخ میں جو کچھ بنتا ہے، اس کے حکم میں اختلاف ہے۔ پس جنت میں ایک مانع ہے جو قواعد کی حرکت سے عطا ہونے والی چیز کو روکتا ہے، اور دنیا و دوزخ میں موانع ہیں جو قواعد کی قوت میں موجود تکوین (پیدائش) کو روکتے ہیں، اور یہ موانع ان قواعد میں کواکب کے قطع کرنے کا عین ہیں۔\n\nمیں یہ نہیں کہتا، اور نہ ہی میں نے اس کی مثل کسی ایسے شخص سے سنا\nجو اللہ کے بارے میں برہان سے غور کرتا ہو،\n\nکہ الٰہ کو دیکھا جاتا ہے، جبکہ وہ اپنی دلیل سے\nانسان کی صورت میں منزہ ہے۔\n\nسوائے اس کے جس نے دلیل کو اس کی تفصیل کے ساتھ کہا،\nاور اپنے علم کے ساتھ عالمِ ارکان سے۔\n\nوہ رسول ہیں، اور ہر وہ شخص جو ان کے حکم کا وارث ہے،\nجو شیطان سے معصوم ہے۔\n\nجب فکر کائنات میں گھومتی ہے تو وہ اللہ کے علم کی تحقیق سے عاجز رہتی ہے۔\n\nجہالت کے لیے اس میں کوئی دلیل (سلطان) نہیں ہے\nجو اس کے اقوال اللہ کے بارے میں لائے ہیں۔\n\nپس وہی الوجود (الوجود) ہے، اور اس کے سوا ہر وہ چیز باطل ہے\nجو اعیان (حقائق) میں ظاہر ہوتی ہے۔\n\nپس اگر تم اللہ کے علم کے ساتھ اہل ذوق میں سے ہو تو تمہارے لیے یہ واضح ہو گیا کہ وہ سبحانہ و تعالیٰ صرف اپنے اعلام (خبر دینے) سے ہی معلوم ہوتا ہے۔ اور جو کوئی یہ کہتا ہے کہ وہ عز و جل دلیل یا الشہود (الشہود) سے معلوم ہوتا ہے، تو وہ تمام ان علماء کے نزدیک ٹھنڈے لوہے پر چوٹ مار رہا ہے جو دلیل کے ذریعے اشیاء کے علم میں غور کرتے ہیں۔ اور اللہ الحق (الحق) کہتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "باب چهارصد و بیست و یکم در معرفت جایگاه کسی که طلب وصول به من را با دلیل و برهان کند، هرگز به من نخواهد رسید، زیرا هیچ چیز شبیه من نیست.\n\nتوحید پروردگارت نه از کشف برهان است\nپس توحید او دومی را نمی‌پذیرد.\n\nو هر کس که دومی را بپذیرد، در حکم خود\nبه زیادات و نقصان متصف است.\n\nو آن [دومی] واحد اعداد است که آن را می‌پذیرد\nو واحد عین (وحدت ذاتی) با برهان درک نمی‌شود.\n\nکسی که مِثل را می‌پذیرد، خواطر ما در او حیران شده است\nآیا راز عین اعلان (حقیقت آشکار) دیده شده است؟\n\nهمانا دلیل بر ترکیب، نشأت آن است\nپس چگونه به واحد عین (وحدت ذاتی) در این شأن دست می‌دهد؟\n\nای کسی که گره خود را بر دلیل بنا نهادی، به تحقیق\nندانستی که اساس قصد کجاست، ای بناکننده!\n\nکسی که دارای صفت باشد، وحدت او کجاست؟\nمنزل دور است، نه منزل نزدیک.\n\nکیست که در دلالت ما دور است؟\nو تو بر این با سلطانی (برهانی) آمده‌ای.\n\nتوحید شرع، توحید مرتبه است\nو حق (الحق) آن را از جانب دیگر تأیید می‌کند.\n\n### [نامیدن بصر در عقل، عین بصیرت (البصيرة) است]\n\nخداوند متعال می‌فرماید: **«چشم‌ها او را درک نمی‌کنند»** (لَا تُدْرِكُهُ الْأَبْصَارُ)؛ یعنی از هر چشمی از اعیان وجوه و اعیان قلوب. زیرا قلب‌ها جز با بصر (بینایی) نمی‌بینند و اعیان وجوه جز با بصر نمی‌بینند. پس بصر، هر جا که باشد، ادراک به واسطه آن واقع می‌شود. از این رو، بصر در عقل، عین بصیرت (البصيرة) نامیده می‌شود و در ظاهر، بصرِ چشم نامیده می‌شود. چشم در ظاهر محل بصر است و بصیرت در باطن محل عین است که همان بصر در عین وجه است. پس نام بر آن مختلف شده، اما خودِ آن در ذاتش مختلف نشده است. همان‌گونه که چشم‌ها او را با ابصارشان درک نمی‌کنند، بصیرت‌ها نیز او را با اعیانشان درک نمی‌کنند.\n\nدر خبر از رسول خدا (صلی الله علیه و سلم) وارد شده است که خداوند از عقول محجوب گشته، همان‌گونه که از ابصار محجوب شده است، و ملأ اعلی (فرشتگان برتر) او را می‌طلبند، همان‌گونه که شما او را می‌طلبید.\n\nپس ما در طلب با ملأ اعلی مشترک هستیم، اما در کیفیت متفاوتیم. برخی از ما او را با فکر خود می‌طلبند، در حالی که ملأ اعلی عقل دارد و فکر ندارد. برخی از ما او را با [آنچه در وجودش است] می‌طلبند، در حالی که در ملأ اعلی کسی نیست که او را با آن بطلبد، زیرا کامل (الکامل) از میان ما بر صورت الهی است که خداوند او را بر آن آفریده، در حالی که ملک (فرشته) بر آن صورت نیست. به همین دلیل، برای کسی که صفتش این است، صحیح است که خداوند را با آن بطلبد، و هر کس او را با آن بطلبد، به او می‌رسد، زیرا جز او کسی به او نرسیده است.\n\nو همانا کامل از میان ما دارای نافله‌ای است که بر فرائضش افزوده می‌شود؛ هنگامی که بنده با آن به پروردگارش تقرب جوید، خداوند او را دوست می‌دارد. پس چون او را دوست بدارد، گوش و بصر او می‌شود. هنگامی که حق (الحق) بصر چنین بنده‌ای باشد، او را می‌بیند و با بصر خود او را درک می‌کند، زیرا بصر او حق است. پس او را جز به واسطه حق درک نکرده، نه به واسطه خودش. و در آنجا (عالم فرشتگان) هیچ ملکی نیست که با نافله به خدا تقرب جوید، بلکه آنان در فرائض هستند. فرائضشان تمام انفاسشان را فرا گرفته است، پس نزد آنان نافله‌ای نیست. از این رو، مقامی ندارند که نتیجه‌اش این باشد که حق بصرشان شود تا او را به واسطه آن درک کنند.\n\nپس آنان بندگان اضطرارند، و ما بندگان اضطرار از جهت فرائضمان هستیم، و بندگان اختیار از جهت نوافل‌مان. همان‌گونه که او رب ذاتی (ربوبیت ذاتی) از جهت وجود ماست، و رب مشیئت (ربوبية المشيئة) از جهت حکم او در ماست. ربوبیت ذاتی (الربوبية الذاتية) ضروری است و رفع آن ممکن نیست، و ربوبیت مشیئت عین امکان در ممکنات است، که با آن هر چه بخواهد ترجیح می‌دهد. پس کسی که مشیئت (خواست) ندارد، ترجیحی برای او نیست، مانند کسی که نافله ندارد و حق بصر او نمی‌شود. اگرچه خلاف این عقلاً ممکن است، اما سخن ما در مورد واقع است که کشف (الکشف) آن را داده است، نه در مورد جواز عقلی. زیرا نزد ما محال است که جواز به خداوند نسبت داده شود تا گفته شود: جایز است که خداوند تو را ببخشد و جایز است که تو را نبخشد؛ و جایز است که خلق کند و جایز است که خلق نکند. این بر خداوند محال است، زیرا عین افتقار به مرجّح برای وقوع یکی از دو امر جایز است، و در آنجا جز خداوند نیست.\n\nو اصحاب این مذهب به آنچه از این حکم ملتزم شده‌اند، نیازمند شده‌اند تا اراده را اثبات کنند تا حق با آن ترجیح دهد. و پوشیده نیست که در این مذهب چه غلطی وجود دارد، زیرا حق (الحق) را محکوم به چیزی می‌کند که زائد بر ذات اوست، و آن عین ذات دیگری است، اگرچه صاحب این مذهب نگفته باشد که آن ذات زائد عین حق است یا غیر عین او. آنچه ما می‌گوییم این است که این عین مخلوق، به دلیل ممکن بودن، وجود و عدم را می‌پذیرد. پس جایز است که خلق شود و موجود گردد، و جایز است که خلق نشود و موجود نگردد. اگر موجود شود، به واسطه مرجّح است و آن خداوند است؛ و اگر موجود نشود، به واسطه مرجّح است و آن خداوند است. این‌گونه سخن استوار می‌شود و ادب با خداوند کامل‌تر است، بلکه واجب است که امر همان‌گونه باشد که گفتیم. و اما احتجاج آنان به قول خداوند: **«اگر خدا می‌خواست»** (لَوْ شَاءَ اللَّهُ) و **«اگر خدا اراده می‌کرد»** (لَوْ أَرَادَ اللَّهُ)، این احتجاج علیه خودشان است نه به نفعشان، زیرا «لو» حرف امتناع برای امتناع است، نه حرف امتناع برای وجود.\n\nپس وجوب آن را بنگرید و عبرت گیرید\nو آن نفی است که این رازی شگفت است.\n\nمانند کسی که می‌خواند و در آنجا کسی نیست\nپس او خود را می‌خواند و سپس پاسخ می‌دهد.\n\nو با این، نص به سوی\nهر صاحب عقل سلیم و نجیب وارد شده است.\n\nو به تحقیق بر مثل آن کسی بود که\nدهری را طواف می‌کرد و می‌گشت.\n\nمانند این، جوانی از هاشم را زیارت کردم\nکه اصلش میان لخم و تجیب بود.\n\nو اجابت کنید کسی را که شما را شنوا ساخت\nهمانا محروم کسی است که اجابت نمی‌کند.\n\n### [همانا امکان (الإمكان) برای ممکن، حکم کسی است که اختیار را در مرجّح آشکار ساخت]\n\nپس بدان که امکان (الإمكان) برای ممکن، حکم کسی است که اختیار را در مرجّح آشکار ساخت. و آنچه نزد مرجّح است، یک امر است و آن یکی از دو امر است و نه غیر آن. پس با نظر به حق (الحق)، جز احدیت (أحدية) محض و خالص نیست که اختیار آن را آلوده نمی‌کند. آیا نمی‌بینی که خداوند متعال می‌فرماید: اگر چنین می‌خواست، چنان می‌شد؟ پس نخواست و آن واقع نشد. پس تعلق این مشیئت (خواست) را از خود نفی کرد و وقوع آن مذکور را نفی نمود. جز اینکه برای خداوند متعال دو نسبت در حکم واقع شده در عالم، چه به امتناع و چه به وقوع، وجود دارد. نسبت اول: آنچه از عالم در عالم از احکام واقع شده و ممتنع، به مشیئت آنان (یعنی به مشیئت عالم که خداوند آن را در عالم ایجاد کرده) ظاهر شده است. نسبت دیگر: آنچه از احکام در عالم ظاهر می‌شود، نه از عالم، بلکه از جانب خداوند است، با وجه خاصی که خداوند در هر موجودی دارد و جز اهل الله خاصه (اهل الله خاصة) آن را نمی‌دانند.\n\nو مشیئتی که عالم با آن از عالم می‌خواهد، مشیئت خداوند متعال است از وجه خاص، سپس برای خداوند مانند ابزار برای صنعتگر است؛ تعلقش آشکار و حکمش منتفی است. پس عالمان به خداوند، واقع شده به واسطه ابزار را به خداوند نسبت می‌دهند، و کسانی که علم ندارند، آن را به ابزار نسبت می‌دهند. و طایفه‌ای متوسط، آنچه را که حق (الحق) به آن نسبت می‌دهد، بر اساس علم خود در آن، به ابزار نسبت می‌دهند و همه را از روی ادب با خداوند و حقیقت به خداوند نسبت می‌دهند. آنان ادیبان محقق (المحققين) با خداوند هستند و کسانی‌اند که میان شرع و عقل جمع کرده‌اند.\n\nو وجه صحیح در علم الهی، عقل نمی‌تواند از جهت نظر خود به آن برسد، بلکه حتی از جهت شهود (الشهود) و تجلی (التجلی) نیز نمی‌تواند. بلکه تنها با اعلام او (إعلامه) دانسته می‌شود، بر وجهی که اعلام او برای کسی باشد که او را از صور بندگانش که در وجود او ظاهر شده‌اند، اختصاص داده است. زیرا علم به خداوند از جهت نظر و شهود به طور مساوی، ناظر و مشاهده‌گر را جز به حیرت محض (الحيرة المحضة) نمی‌کشاند. پس هنگامی که اعلام الهی برای کسی که واقع شده، در هر کجا که واقع شده، چه در دنیا و چه در آخرت، حاصل شود، مقصود به دست می‌آید.\n\nدلالات هستی (الوجود) بر وجود من\nبا دلالات شهود (الشهود) در تعارض است.\n\nزیرا عین (ذات) جز او را شهود نکرد\nبا چشم شهودش هنگام هستی.\n\nو غیر کجاست که ثابت نشده تا آشکار شود\nبا کثرت از عین مزید (ذات افزوده).\n\nدر شگفتم از کسی که عزیز است و متعالی\nو در مراد و مرید ظاهر می‌شود.\n\nبه تحقیق معالی او نازل شد و جلیل گشت\nبا احکام دلایل به سعادت‌ها.\n\nآیا پس از نزول، صعودی خواهد بود؟\nو عین نزول او، عین صعود است.\n\nاضافات امور دارای حکم است\nپس بودن رب (الرب) در بودن عبید (بندگان).\n\nو اگر اصل نبود، فروعی ظاهر نمی‌شد\nکه بر اصول از شاهد دلالت کند.\n\nبه تحقیق راز امر را در آن آشکار ساختم\nبرای هر دانشمند زیرک و قوی.\n\nصبوری که صبوری دیگر با او مقاومت نمی‌کند\nعزیزی که در تصرفش شدید است.\n\nهمانا دلیل، وجود مرا می‌دهد، زیرا دلیل جز عین من نیست، و عین من جز امکان من نیست. و مدلول من، وجود حق (الحق) است که استناد من به اوست، و نفی آنچه حق من است از کسی که استناد من به اوست. و شهود (الشهود) وجود مرا نفی می‌کند، اما حکم مرا در کسی که در او ظاهر شده و به او نسبت داده می‌شود که عین من است، نفی نمی‌کند. و وجود از آنِ خداوند است. پس من از حق (الحق) ظهور حکم خود را به واسطه صور ظاهره استفاده کردم، نه حکم ظهور عین خود را. و گفته می‌شود – و گوینده‌ای جز من نیست – که این صور ظاهره در وجود حق (الحق) که عین حکم من هستند، عین من می‌باشند. این را شهود می‌دهد. پس شهود با ادله نظری معارضه می‌کند.\n\nو خلق از آنِ خداوند است، او آن را می‌داند و علم او جز آنچه به من داده است که من در عین خود بر آن هستم، نیست. و در میان براهین، صحیح‌تر از برهان «إن» نیست، و آن نزد قائلین به براهین، برهان وجودی است. و هیچ چیز از آن بر معرفت هویت حق (الحق) دلالت نمی‌کند. نهایت آن، علم به نسبت وجود به اوست، و اینکه عین او، عین وجود من است، و نفی آنچه شایسته حادث است از او. جز این با برهان شناخته نمی‌شود. و شرع (الشّرع) آن را تأیید کرده است، و آن چیزی است که به رسولی که از او ترجمه می‌کند، وحی شده است؛ کسی که خبر داده شده که از روی هوی سخن نمی‌گوید، و او را در کون (هستی) در جایگاهش نازل کرده است. از جمله آنچه او به زبان آورده و نظر فکری را یاری می‌کند، این قول است: **«چیزی مانند او نیست»** (لَيْسَ كَمِثْلِهِ شَيْءٌ). و این از کلام ظاهر است که ممکن است وجهی غیر از وجهی که عقل از آن درک می‌کند، داشته باشد، و نیز وجهی که عقل از آن درک می‌کند، داشته باشد. و سمع (وحی) با دلالتی قوی‌تر از این، با وجود این احتمالی که در آن است، وارد نشده است.\n\nصحیح‌ترین براهین، برهان «إن» است\nو عین حق (الحق) را به تو نشان نمی‌دهد.\n\nپس در مورد حق، به تو نفی و سلب می‌دهد\nو در مورد غیر حق، به تو کون (هستی) می‌دهد.\n\nو صفاتی را که قرآن برای تو آورده، نفی می‌کند\nمانند قول شارع: «کجا هستیم؟»\n\nو علم ظاهری به آن می‌آید\nکه با آن حفظ و صیانت می‌خواهد.\n\nو علم به او جز به آنچه گفته است\nصحیح‌ترین و قوی‌ترین دلیل آشکار است.\n\nعقول با برهان خود محال می‌دانند\nوجودی را که شرع به عنوان یاری آورده است.\n\nو هر عقل سلیمی آن را می‌پذیرد\nو ستایش بر آن می‌پوشاند و زینت می‌بخشد.\n\nو چون دلیل نظری مانند ما در معنا، در ظاهر مربع است، و تثلیث (سه تایی) فرد است و تربع (چهار تایی) زوج، به همین دلیل از حق (الحق) جز فردیت مرتبه دانسته نشد، و آن نیز جز به واسطه خلق دانسته نشد. پس حق (الحق) به خلق و خلق به حق مرتبط شد، ارتباط تربع به تثلیث و تثلیث به تربع، در دو مقدمه‌ای که علم به توحید خداوند در الوهیتش را داد. پس بنگر به حکم حقایق (الحقائق) که چگونه اقتضا کرد که ادله بر این صورت باشند. پس وجود را حق و خلق، و واجب بالذات و واجب بالغیر در بر گرفت.\n\nهمانا دلیل، مثلث‌الارکان است\nمانند خانه (کعبه) که محسوس و مربع است.\n\nو همچنین حق (الحق) که کائنات بر او دلالت کردند\nتقدیس او را بیان می‌کند.\n\nبهره دلیل از اله، وجود اوست\nنه بهره او از ترجیل (شانه زدن) و تعریس (استراحت شبانه).\n\nاگر بگویی که حق از تو منزه است\nدلیل شرع این است که او ملموس است.\n\nو با شرع تو نیز منزه است، پس در نظر بگیر\nدر هر دو حالت، عقل تو منحوس است.\n\nاگر اندوه فکر از تنزیه او به تو رسید\nبه دنبال آن از رحمت‌های او تنفیس (گشایش) می‌آید.\n\nبرای خداوند در تمام مراتب، عین (ذات) است\nتثلیث یا تربع یا تسدیس (شش تایی).\n\nپس اگر خداوند بخواهد وجود خود را\nدر قلب شما حفظ کند، آن را به تخمیس (پنج تایی) می‌آورد.\n\nحق (الحق) خود و بندگانش را حفظ می‌کند\nمانند بیست و پنج، ای فرمانبردار.\n\nپس اگر پنج ضرب در پنج بیاوری\nبه تحقیق بدبختی از تو زائل می‌شود.\n\nو به ملأ مقدس (فرشتگان) وجودش ملحق شدی\nو تأصیل و تأسیس معین گشت.\n\nو در میان میلیون‌ها نفر خوانده شدی، اگر محقق کنی کسی را که\nتو را می‌خواند، ای کسی که ابلیس او را فریب داده است.\n\nتو در هستی (الوجود) مقدم هستی، مانند آدم\nدر بودن او که سبقت گرفت، پس تو رئیس هستی.\n\nمنظور از «خانه» (البيت) در این نظم که به آن تشبیه شده، کعبه است، زیرا دارای سه رکن است و شکلش مثلث است. به همین دلیل حجر (حطیم) را قرار داد. پس چون به اندازه هفت ذراع از خانه جدا شد، آن را با حجر محصور کردند تا طواف به دور خانه صحیح باشد.\n\nاز رسول خدا (صلی الله علیه و سلم) صحیح است که چون کعبه بنا شد، هزینه کم آوردند و هفت ذراع از خانه را در حجر (حطیم) رها کردند.\n\nبه همین دلیل عبدالله بن زبیر آن را بر قواعد ابراهیم (علیه السلام) بازگرداند. سپس عبدالملک بن مروان به حجاج بن یوسف دستور داد که آن را به حالت اول بازگرداند. سپس پشیمان شد و گفت: ای کاش ابن زبیر را با آنچه بر عهده گرفت، رها می‌کردم. سپس امر را رها کرد و حجر را همان‌گونه که بود، گرداند، به احترام خانه، تا مبادا هر بار خلفا بر اساس آنچه به نظرشان می‌رسد، به تخریب آن بپردازند. پس آن را باقی گذاشت تا این بهانه را سد کند. این را بدان.\n\nاما تثلیث (سه تایی) آن برای این است که بر دوازده قاعده باشد. هر ثلث (یک سوم) از علم به خداوند است. ثلث اول از علم به خداوند، آن است که با دلیل دانسته می‌شود. ثلث دیگر، آن است که با شهود (الشهود) هنگام تجلی (التجلی) دانسته می‌شود. و ثلث سوم، آن است که با اعلام او (إعلامه) دانسته می‌شود، و این صحیح‌ترین بخش‌ها در علم به خداوند است. و تفصیل قواعد آن طولانی است. ما تو را در علم به آن‌ها به خود او (سبحانه و تعالی) ارجاع دادیم تا آن را به ذوق (ذوقاً) درک کنی، ان‌شاءالله تعالی.\n\nو از این قواعد، برج‌های فلک (آسمان) ظاهر شدند: حمل، ثور، توأمان (جوزا)، سرطان، اسد، سنبله، میزان، عقرب، قوس، جدی، دالی (دلو) و حوت. سه تای آن‌ها آتشی (ناری) هستند: حمل، اسد و قوس. سه تای آن‌ها خاکی (ترابی) هستند: ثور، سنبله و جدی. سه تای آن‌ها هوایی هستند: جوزا (توأمان)، میزان و دالی. و سه تای آن‌ها آبی هستند: سرطان، عقرب و حوت. پس آن‌ها چهار مرتبه هستند که در سه ضرب شده‌اند و مجموع دوازده است، که انتهای نام‌های عدد از جهت بسیط‌های آن است. سپس ترکیب تا بی‌نهایت واقع می‌شود. از یک تا نه، و عقد (دهگان) سه تاست: عشرات، مئون و آلاف. مجموع دوازده است. و اما تسدیس (شش تایی) از آن، تثلیث نصف آن است. پس آن‌ها دو طرف هستند: تسدیس که بیشتر است و تثلیث که کمتر است. و متوسط میان تثلیث و تسدیس، تربع (چهار تایی) است. هر ربع نه است، که انتهای بسیط‌های مفردات عدد در آحاد است. پس نه، نظری به دوازده دارد و نظری به شش. و کل سی و شش قاعده مادر است و به سیصد و شصت قاعده ختم می‌شود. از این قواعد، درجات فلک ظاهر شد که کواکب با سیر خود آن را قطع می‌کنند. و خداوند آنچه را که در عالم ارکان (عناصر) ایجاد می‌کند، به قطع این کواکب در این قواعد، با وجود کثرت کواکب، مرتبط ساخته است. و اما آنچه در عالم جنان (بهشت) رخ می‌دهد، نه در آتش و دنیا، بر اساس آنچه قواعد با حرکت خود می‌دهند، نه بر اساس آنچه قطع کواکب در این قواعد می‌دهد. به همین دلیل، حکم در آنچه در بهشت تکوین می‌یابد و آنچه در دنیا و آتش تکوین می‌یابد، متفاوت است. آنچه در بهشت است، مانعی است که از آنچه حرکت قواعد می‌دهد، جلوگیری می‌کند. و در دنیا و آتش، موانعی وجود دارد که از آنچه در قوه قواعد از تکوین است، جلوگیری می‌کند. و این موانع، عین قطع کواکب در آن قواعد است.\n\nمن نمی‌گویم و مانند آن را نشنیده‌ام\nاز ناظری که در مورد خداوند با برهان نظر می‌کند.\n\nکه اله او را می‌بیند در حالی که منزه است\nبا دلیل خود در صورت انسان.\n\nمگر کسی که دلیل با فصل خود گفته است\nو با علم خود از عالم ارکان.\n\nاو رسول است و هر وارث حکم او\nاز هر معصومی از شیطان.\n\nفکر از تحقق علمش عاجز است\nبه خداوند هنگامی که در اکوان (هستی‌ها) جولان می‌دهد.\n\nجهالت در آنچه\nاقوال او در مورد خداوند آورده، سلطانی ندارد.\n\nپس او هستی (الوجود) است و غیر او باطل است\nدر هر آنچه از اعیان (ذوات) آشکار می‌شود.\n\nپس برای تو آشکار شد، اگر از اهل اذواق (اهل ذوق) در علم به خداوند باشی، که او دانسته نمی‌شود مگر با اعلام او (إعلامه) سبحانه و تعالی. و هر کس بگوید که او عز و جل با دلیل یا با شهود (الشهود) دانسته می‌شود، در آهن سرد می‌کوبد، از نظر همه علمای ناظر در علم به اشیاء با دلیل. و خداوند **«حق را می‌گوید و او راه را هدایت می‌کند»** (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}