{
  "id": 527,
  "title": {
    "ar": "الباب السابع والعشرون وخمسمائة في معرفة حال قطب كان منزله واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ الآية",
    "en": "Chapter Five Hundred and Twenty-Seven: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ>> (And keep your soul patient with those who call upon their Lord morning and evening, desiring His Face. And let not your eyes pass beyond them...) (The Verse).",
    "ur": "باب ۵۲۷: ایک قطب (Qutb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) یہ تھا:\n\"اور اپنے آپ کو ان لوگوں کے ساتھ روکے رکھو جو صبح و شام اپنے رب کو پکارتے ہیں، اس کی ذات (وجہ) کے طالب ہیں، اور تمہاری نگاہیں ان سے نہ ہٹیں...\" (واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ الآية)",
    "fa": "باب پانصد و بیست و هفتم در معرفت حال قطبی که منزلگاهش این آیه بود: «و با کسانی که پروردگار خود را صبح و شام می‌خوانند و وجه او را می‌خواهند، شکیبا باش و چشمانت از ایشان مگذر» (وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ الآية)."
  },
  "content": {
    "ar": "## (الباب السابع والعشرون وخمسمائة في معرفة حال قطب كان منزله واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ الآية)\n\n\n> لله قوم وفوا بما له خلقوا *** فما مضى طبق إلا بدا طبق‏\n> فاصبر مع القوم نفسا ليس تشكرها *** إلا إذا رزقت مثل الذي رزقوا\n\n\n> من انكسار ومن ذل ومتربة *** فيها روائح مسك نشره عبق‏\n\n\n> فلا يغرنك أوصافي فإن لها *** مواطنا وبها لأقوام قد نطقوا\n\n\n### [أن لله عبادا كانت أحوالهم ذكرا يتقرب به إلى الله‏]\n\n\nاعلم أيدنا الله وإياك بما أيدهم به من الروح القدسي أن لله عبادا كانت أحوالهم وأفعالهم ذكرا يتقرب به إلى الله وينتج من العلم بالله ما لا يعلمه إلا من ذاقه فمن حبس نفسه مع هذا الذكر لحق بهم فإنه كل ما أمر الله به نبيه صَلَّى اللهُ عَليهِ وسَلَّم ونهاه عنه هو كان عين أحوالهم وأفعالهم مع كون هذه الطائفة الذي نزل فيهم هذا القرآن من أصحاب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فما نالوا ما نالوه إلا باتباعه وفهم ما فهموا عنه ومع هذا عاتب الله تعالى نبيه صَلَّى اللهُ عَليهِ وسَلَّم فيهم حتى‏\n\n\nكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا لقي أحدا منهم أو قعد في مجلس يكونون فيه لا يزال يحبس نفسه معهم ما داموا جلوسا حتى يكونوا هم الذين ينصرفون وحينئذ ينصرف رسول الله ص‏\n\n\nوكان صَلَّى اللهُ عَليهِ وسَلَّم إذا حضروا لا تعدو عيناه عنهم ويقول إذا جاءوا إليه أو لقيهم مرحبا بمن عاتبني الله فيهم ولما عرفوا بذلك كانوا يخففون الجلوس مع رسول الله ص‏\n\n\nوالحديث لما علموا من تقييده بهم وصبره نفسه معهم فمن لزم هذا الذكر فإنه ينتج له معرفة وجه الحق في كل شي‏ء فلا يرى شيئا إلا ويرى وجه الحق فيه فإنهم ما دعوا ربهم بالغداة والعشي الذي هو زمان تحصيل الرزق في المرزوقين كما قال لَهُمْ رِزْقُهُمْ فِيها بُكْرَةً وعَشِيًّا وهو الصبوح والغبوق عند العرب فكان رزق هؤلاء بالغداة والعشي ما يحصل لهم من معرفة الوجه الذي كان مرادهم لأنه قال يُرِيدُونَ وَجْهَهُ يعني بذلك الدعاء بِالْغَداةِ والْعَشِيِّ وجه الحق لما علموا أن كل شي‏ء هالِكٌ إِلَّا وَجْهَهُ فطلبوا ما يبقى وآثروه على ما يفنى فإذا تجلى لهم وجه الحق في الأشياء ولهذا الذاكر بهذا الذكر لم تعد عيناه عن هذا الوجه ولا يتمكن أن تعدو عيناه عنه لأنه بذاته يقيد كل ناظر إليه وإنما جاء بالنهي في هذا الذكر لأنهم ليسوا عين الوجه بل هم المشاهدون للوجه فمن كان منهم قد حصل له تجلى الوجه وبقي معه هذا الذكر فإنما يريد بقاء شهود ذلك الوجه دائما لما يعرف من حال الممكن وما ينبغي لجلال الله من الأدب معه حيث لا يحكم عليه بشي‏ء ولا بد وإن حكم هو بذلك على نفسه هذا هو الأدب الإلهي ومن لم يبدله بعد ذلك الوجه المطلوب فيطلب بدعائه ذلك الوجه المراد له وعلى كل حال فلا تعد عينا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عنهم إلى غيرهم ما داموا حاضرين ومن هنا\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في صفة أولياء الله هم الذين إذا رأوا ذكر الله لما حصل لهم من نور\n\n\nهذا الوجه الذي هو مراد لهؤلاء فإن الذي يتجلى له هذا الوجه لا بد أن يكون فيه أثر معلوم له ولا بد فمنه جلي بحيث أن يراه الغير منه ومنه خفي بحيث أن لا يراه منه إلا أهل الكشف أو لا يراه أحد وهو الأخفى إلا أنه له في نفسه جلى لأنه صاحب الشهود وحكم غير الأنبياء في مثل هذه الأمور خلاف حكم الأنبياء فإن الأنبياء وإن شاهدوا هؤلاء في حال شهودهم للوجه الذي أرادوه من الله تعالى بدعائهم وإنهم من حيث إنهم أرسلوا لمصالح العباد لا يتقيدون بهم على الإطلاق وإنما يتقيدون بالمصالح التي بعثوا بسببها فوقتا يعتبون مع كونهم في مصلحة مثل هذه الآية ومثل آية الأعمى الذي نزل فيه عَبَسَ وتَوَلَّى فإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما أعرض عن الأعمى الذي عتبة فيه الحق إلا حرصا وطمعا في إسلام من يسلم لإسلامه خلق كثير ومن يؤيد الله به الدين ومع هذا وقع عليه العتب من حقيقة أخرى لا من هذه الجهة فمن ذلك قوله أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى فذكر الصفة ولم يذكر الشخص والغناء صفة إلهية فما حادت عين رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إلا إلى صفة إلهية لتحققه صَلَّى اللهُ عَليهِ وسَلَّم بالفقر فأراد الحق أن ينبهه على الإحاطة الإلهية فلا تقيده صفة عن صفة فليس شهوده صَلَّى اللهُ عَليهِ وسَلَّم لغني الحق في قوله فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ بأولى من شهوده صَلَّى اللهُ عَليهِ وسَلَّم لطلب الحق في قوله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ وأين مقام الغناء من هذا الطلب وقوله وأَقْرِضُوا الله قَرْضاً حَسَناً فغار عليه سبحانه أن تقيده صفة عن صفة بل كان يظهر لأولئك من البشاشة على قدر ما يليق بهم ويظهر للأعمى من الفرح به على قدر ما تقع به المصلحة في حق أولئك الجبابرة فإن التواضع والبشاشة محبوبة بالذات من كل أحد فإنها من مكارم الأخلاق وما زال الله يؤدب نبيه ص‏\nحتى تحقق بالأدب الإلهي‏\n\n\nفقال إن الله أدبني فأحسن أدبي‏\n\n\nفإن الله له نسبة إلى الأغنياء كما له نسبة إلى الفقراء فالعارف ينبغي له أن لا يفوته من الحق شي‏ء في كل شي‏ء فما أحسن تعليم الله عباده فنحن إذا فتح الله أعين بصائرنا وأفهامنا علمنا أن تعليم الله نبيه صَلَّى اللهُ عَليهِ وسَلَّم الآداب مع المراتب إنا أيضا مرادون بذلك التعليم وننظره في النبي صَلَّى اللهُ عَليهِ وسَلَّم كالمثل السائر إياك أعني فاسمعي يا جارة وإن كان هو صَلَّى اللهُ عَليهِ وسَلَّم المقصود لله بالأدب فنحن أيضا المقصودون لله بالتأسي به والاقتداء لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ فكل خطاب خاطب به نبيه صَلَّى اللهُ عَليهِ وسَلَّم مؤدبا له فلنا في ذلك الخطاب اشتراك لا بد من ذلك فانظر يا ولي في هذا الذكر ما ذا نتج من الخير الكثير والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 527: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was [Defined by the Verse]: <<وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ>> (And restrain yourself patiently with those who call upon their Lord morning and evening, desiring His Face, and let not your eyes pass beyond them...) [Q 18:28]\n\nFor God are a people who fulfilled that for which they were created,\nNo level passed except that another level appeared.\nSo restrain your soul patiently with the people; you will not thank it\nExcept when it is granted the like of what they were granted:\nOf brokenness, lowliness, and abjection,\nIn which are fragrances of musk whose pervasive scent is sweet.\nSo let not my descriptions deceive you, for they have stations,\nAnd by them, certain people have spoken.\n\n### [That God has servants whose states were a remembrance (dhikr) by which one draws near to God]\n\nKnow—may God support us and you with the Holy Spirit (الروح القدسي) by which He supported them—that God has servants whose states and actions were a remembrance (dhikr) by which one draws near to God, and which produces a Knowledge (العلم) of God that none knows save him who has tasted it. Whoever restrains his soul patiently with this remembrance joins them, for everything God commanded or forbade His Prophet (peace and blessings be upon him) was the very essence (عين) of their states and actions.\n\nEven though this group, concerning whom this Quranic verse was revealed, were among the Companions of the Messenger of God (peace and blessings be upon him), they attained what they attained only by following him and understanding what they understood from him. Despite this, God Almighty admonished His Prophet (peace and blessings be upon him) concerning them, to the extent that the Messenger of God (peace and blessings be upon him), whenever he met one of them or sat in a gathering where they were present, would continuously restrain himself patiently with them as long as they remained seated, until they were the ones who departed. Only then would the Messenger of God (peace and blessings be upon him) depart.\n\nAnd when they were present, his eyes (peace and blessings be upon him) would not pass beyond them. When they came to him or he met them, he would say, \"Welcome to those concerning whom God admonished me.\" When they realized this, they would shorten their sittings and conversation with the Messenger of God (peace and blessings be upon him), knowing of his commitment to them and his patient restraint of himself with them.\n\nWhoever adheres to this remembrance (dhikr) will gain the Gnosis (معرفة) of the Face of The Real (وجه الحق) in everything. He will not see a thing except that he sees the Face of The Real within it. For they did not call upon their Lord morning and evening (الغداة والعشي) merely as a time for obtaining provision, as is the case for those who are provided for, concerning whom He said: <<لَهُمْ رِزْقُهُمْ فِيها بُكْرَةً وعَشِيًّا>> (They will have their provision therein morning and evening) [Q 19:62], which is the morning and evening drink (al-sabūḥ wa al-ghabūq) among the Arabs. Rather, the provision of these people, morning and evening, was the Gnosis of the Face that was their object of desire, because He said: <<يُرِيدُونَ وَجْهَهُ>> (Desiring His Face). By this calling upon Him morning and evening, they desired the Face of The Real (وجه الحق), knowing that <<كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ>> (Everything is perishing except His Face) [Q 28:88]. Thus, they sought what remains and preferred it over what perishes.\n\nWhen the Face of The Real (وجه الحق) manifests (تجلى) to them in things, the eyes of the one engaged in this remembrance will not pass beyond this Face, nor is it possible for his eyes to pass beyond it, because it inherently restrains every observer of it. The prohibition in this remembrance was only given because they are not the very essence (عين) of the Face, but rather the Witnessers (المشاهدون) of the Face. Whoever among them has attained the Theophany (تجلي) of the Face and maintains this remembrance, he only desires the permanence of the Witnessing (شهود) of that Face, due to his knowledge of the state of the contingent (الممكن) and the proper etiquette (الأدب) due to God’s Majesty, whereby he does not impose any judgment upon Him, even if he must impose that judgment upon himself. This is the Divine Etiquette (الأدب الإلهي). And whoever has not yet attained that desired Face seeks that intended Face through his invocation. In any case, the eyes of the Messenger of God (peace and blessings be upon him) would not pass beyond them to others as long as they were present.\n\nIt is from this context that the Messenger of God (peace and blessings be upon him) said, describing the Friends of God (أولياء الله), that they are those who, when they are seen, God is remembered, due to the light of this Face (الوجه) that is the object of desire for these people. For whoever receives the Theophany of this Face must inevitably bear a discernible trace of it. Some of this trace is manifest (جلي), such that others can see it in him, and some is hidden (خفي), such that only the People of Unveiling (أهل الكشف) can see it in him, or perhaps no one sees it—this is the most hidden (الأخفى)—yet it is manifest to him inwardly because he is the master of Witnessing (الشهود).\n\nThe ruling concerning such matters for those who are not Prophets differs from the ruling for the Prophets. For the Prophets, even though they witness these people in their state of witnessing the Face they desired from God Almighty through their invocation, they are not absolutely bound by them, since they were sent for the welfare of the servants. Rather, they are bound by the welfare for which they were sent. Thus, at times, they are admonished even when acting in the interest of welfare, as in the case of this verse, and the verse concerning the blind man in which <<عَبَسَ وَتَوَلَّى>> (He frowned and turned away) [Q 80:1-2] was revealed.\n\nThe Messenger of God (peace and blessings be upon him) only turned away from the blind man—concerning whom The Real (الحق) admonished him—out of eagerness and hope for the conversion of those whose conversion would lead to the conversion of many people and by whom God would strengthen the religion. Despite this, the admonishment came from another Reality (حقيقة), not from this perspective. This is evident in His saying: <<أَمَّا مَنِ اسْتَغْنَى * فَأَنْتَ لَهُ تَصَدَّى>> (As for him who is self-sufficient, to him you attend) [Q 80:5-6]. He mentioned the Attribute (الصفة) and did not mention the person. Self-Sufficiency (الغناء) is a Divine Attribute. The eye of the Messenger of God (peace and blessings be upon him) only turned toward a Divine Attribute because of his realization (تحقق) of Poverty (الفقر). The Real desired to alert him to the Divine Comprehensiveness (الإحاطة الإلهية), so that no single Attribute would restrict him from another Attribute.\n\nHis Witnessing (شهود) of the Self-Sufficiency (غني) of The Real in His saying: <<فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ>> (Indeed, God is Self-Sufficient above the worlds) [Q 3:97] is no more worthy than his Witnessing of the Demand (طلب) of The Real in His saying: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me) [Q 51:56], and His saying: <<وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا>> (And lend to God a goodly loan) [Q 73:20]. Where is the station of Self-Sufficiency compared to this Demand? Thus, the Glorified One was jealous that a single Attribute should restrict him from another Attribute. Rather, he used to show those people cheerfulness (البشاشة) commensurate with what was appropriate for them, and he showed the blind man joy in him commensurate with the welfare that would result concerning those tyrants. For humility and cheerfulness are inherently beloved by everyone, as they are among the noble traits of character (مكارم الأخلاق). God continued to discipline His Prophet (peace and blessings be upon him) until he realized the Divine Etiquette (الأدب الإلهي).\n\nSo he said: \"Indeed, God disciplined me and perfected my discipline.\"\n\nIndeed, God has a relation to the rich just as He has a relation to the poor. Therefore, the Gnostic (العارف) should not miss anything of The Real (الحق) in anything. How excellent is God’s teaching of His servants! When God opens the eyes of our insights (بصائر) and our understandings, we know that God’s teaching of etiquette (الآداب) to His Prophet (peace and blessings be upon him) concerning the various Levels (المراتب) means that we, too, are intended by that teaching. We view it in the Prophet (peace and blessings be upon him) like the common proverb: \"I mean you, so listen, neighbor!\" Even though he (peace and blessings be upon him) was the one intended by God for discipline, we are also intended by God to emulate (التأسي) and follow him: <<لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ>> (Indeed, in the Messenger of God you have an excellent example) [Q 33:21]. Thus, every address by which God addressed His Prophet (peace and blessings be upon him) in discipline, we necessarily share in that address. So look, O Friend (ولي), at the abundant good produced by this remembrance (dhikr). <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And God speaks the Truth, and He guides to the Way) [Q 33:4].",
    "ur": "باب نمبر ۵۲۷: اس قطب کے حال کی معرفت میں جس کا مقام یہ آیت تھی: \"اور اپنے آپ کو ان لوگوں کے ساتھ روکے رکھو جو صبح و شام اپنے رب کو پکارتے ہیں، اس کی ذات (وجہ) کے طالب ہیں، اور تمہاری نگاہیں ان سے نہ ہٹیں...\" (الکہف: ۲۸)\n\nاللہ کے لیے کچھ ایسے لوگ ہیں جنہوں نے اس چیز کو پورا کیا جس کے لیے وہ پیدا کیے گئے تھے، پس کوئی طبقہ (حال) نہیں گزرا مگر دوسرا طبقہ ظاہر ہو گیا۔\n\nپس ان لوگوں کے ساتھ اپنے نفس کو روکے رکھو، تم اس کا شکر ادا نہیں کرو گے، مگر جب تمہیں بھی وہی رزق ملے جو انہیں ملا ہے۔\n\nیعنی انکسار، ذلت اور خاکساری کا رزق، جس میں مشک کی خوشبوئیں ہیں جن کی مہک پھیلی ہوئی ہے۔\n\nپس میری صفات تمہیں دھوکے میں نہ ڈالیں، کیونکہ ان کے لیے مقامات ہیں، اور ان صفات کے ذریعے کچھ لوگوں نے کلام کیا ہے۔\n\n### [بے شک اللہ کے کچھ بندے ایسے ہیں جن کے احوال وہ ذکر تھے جس کے ذریعے اللہ کا قرب حاصل کیا جاتا ہے]\n\nجان لو، اللہ ہمیں اور تمہیں اس روح القدس (الروح القدسي) کے ذریعے تائید بخشے جس کے ذریعے اس نے ان کی تائید کی، کہ اللہ کے کچھ بندے ایسے ہیں جن کے احوال اور افعال وہ ذکر تھے جس کے ذریعے اللہ کا قرب حاصل کیا جاتا ہے اور اس سے اللہ کی ایسی معرفت (المعرفۃ) پیدا ہوتی ہے جسے وہی جانتا ہے جس نے اسے چکھا ہو۔ پس جس نے اپنے آپ کو اس ذکر کے ساتھ روکے رکھا، وہ ان سے جا ملا۔ کیونکہ ہر وہ چیز جس کا اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا یا جس سے منع کیا، وہ ان کے احوال اور افعال کا عین تھی۔ حالانکہ یہ گروہ جن کے بارے میں یہ قرآن نازل ہوا، رسول اللہ صلی اللہ علیہ وسلم کے اصحاب میں سے تھے۔ انہوں نے جو کچھ حاصل کیا، وہ صرف آپ صلی اللہ علیہ وسلم کی پیروی اور آپ سے سمجھی ہوئی باتوں کے فہم کے ذریعے ہی حاصل کیا۔ اس کے باوجود، اللہ تعالیٰ نے ان کے معاملے میں اپنے نبی صلی اللہ علیہ وسلم پر عتاب فرمایا، یہاں تک کہ\n\nرسول اللہ صلی اللہ علیہ وسلم جب ان میں سے کسی سے ملتے یا کسی ایسی مجلس میں بیٹھتے جہاں وہ موجود ہوتے، تو جب تک وہ بیٹھے رہتے، آپ صلی اللہ علیہ وسلم اپنے آپ کو ان کے ساتھ روکے رکھتے، یہاں تک کہ وہ خود اٹھ کر چلے جاتے، تب رسول اللہ صلی اللہ علیہ وسلم بھی تشریف لے جاتے۔\n\nاور جب وہ حاضر ہوتے تو آپ صلی اللہ علیہ وسلم کی نگاہیں ان سے نہ ہٹتیں۔ جب وہ آپ کے پاس آتے یا آپ ان سے ملتے تو فرماتے: \"خوش آمدید ان لوگوں کو جن کے بارے میں اللہ نے مجھ پر عتاب فرمایا۔\" جب انہیں اس بات کا علم ہوا تو وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بیٹھنے میں تخفیف کرتے۔\n\nاور یہ بات اس لیے تھی کہ وہ آپ صلی اللہ علیہ وسلم کے ان کے ساتھ مقید ہونے اور اپنے نفس کو ان کے ساتھ روکے رکھنے کو جانتے تھے۔ پس جو شخص اس ذکر کو لازم پکڑتا ہے، اس کے لیے ہر چیز میں حق (الحق) کے وجہ (ذات) کی معرفت (المعرفۃ) پیدا ہو جاتی ہے۔ چنانچہ وہ کوئی چیز نہیں دیکھتا مگر اس میں حق (الحق) کا وجہ دیکھتا ہے۔ انہوں نے صبح و شام اپنے رب کو اس لیے نہیں پکارا جو کہ رزق پانے والوں کے لیے رزق حاصل کرنے کا وقت ہے، جیسا کہ اللہ نے فرمایا: لَهُمْ رِزْقُهُمْ فِيها بُكْرَةً وعَشِيًّا (ان کے لیے اس میں صبح و شام ان کا رزق ہے) جو کہ عربوں کے ہاں صبح کا ناشتہ اور شام کا کھانا ہے۔ بلکہ ان لوگوں کا رزق صبح و شام وہ معرفت (المعرفۃ) تھی جو انہیں اس وجہ (ذات) کی حاصل ہوتی تھی جو ان کا مقصود تھا۔ کیونکہ اللہ نے فرمایا: يُرِيدُونَ وَجْهَهُ (وہ اس کی ذات کے طالب ہیں)۔ یعنی اس صبح و شام کے پکارنے سے ان کا مقصد حق (الحق) کا وجہ (ذات) تھا۔ کیونکہ وہ جانتے تھے کہ ہر چیز ہالِكٌ إِلَّا وَجْهَهُ (ہلاک ہونے والی ہے سوائے اس کی ذات کے)۔ پس انہوں نے باقی رہنے والی چیز کو طلب کیا اور اسے فانی چیز پر ترجیح دی۔ جب حق (الحق) کا وجہ (ذات) ان کے لیے اشیاء میں تجلی (التجلی) کرتا ہے، تو اس ذکر کرنے والے کی نگاہیں اس وجہ (ذات) سے نہیں ہٹتیں۔ اور نہ ہی اس کی نگاہیں اس سے ہٹ سکتی ہیں، کیونکہ وہ اپنی ذات سے ہر دیکھنے والے کو مقید کر دیتا ہے۔ اور اس ذکر میں نہی (منع) صرف اس لیے آئی ہے کہ وہ خود عین وجہ (ذات) نہیں ہیں، بلکہ وہ وجہ (ذات) کا مشاہدہ (الشہود) کرنے والے ہیں۔ پس ان میں سے جسے وجہ (ذات) کی تجلی (التجلی) حاصل ہو گئی اور وہ اس ذکر کے ساتھ باقی رہا، تو وہ ہمیشہ اس وجہ (ذات) کے شہود (الشہود) کے بقا کا طالب ہوتا ہے، اس لیے کہ وہ ممکن کے حال کو جانتا ہے اور اس ادب کو جانتا ہے جو جلالِ الٰہی کے ساتھ لازم ہے، جہاں وہ اس پر کسی چیز کا حکم نہیں لگاتا، اگرچہ وہ خود اپنے اوپر اس کا حکم لگائے۔ یہ ہے ادبِ الٰہی۔ اور جس کے لیے وہ مطلوبہ وجہ (ذات) ظاہر نہیں ہوا، تو وہ اپنی دعا کے ذریعے اس مطلوبہ وجہ (ذات) کو طلب کرتا ہے۔ اور بہر حال، جب تک وہ حاضر ہوتے، رسول اللہ صلی اللہ علیہ وسلم کی نگاہیں ان سے ہٹ کر کسی اور کی طرف نہیں جاتیں۔ اور اسی وجہ سے\n\nرسول اللہ صلی اللہ علیہ وسلم نے اولیاء اللہ کی صفت میں فرمایا: \"وہ لوگ ہیں کہ جب انہیں دیکھا جائے تو اللہ یاد آ جائے۔\" یہ اس نور کی وجہ سے ہے جو انہیں اس وجہ (ذات) سے حاصل ہوا جو ان لوگوں کا مقصود ہے۔ کیونکہ جس پر یہ وجہ (ذات) تجلی (التجلی) کرتا ہے، اس میں لازماً ایک معلوم اثر ہوتا ہے۔ یہ اثر کبھی جلی (ظاہر) ہوتا ہے، اس طرح کہ اسے دوسرا شخص بھی دیکھ لیتا ہے، اور کبھی خفی (پوشیدہ) ہوتا ہے، اس طرح کہ اسے صرف اہل کشف (الکشف) ہی دیکھ پاتے ہیں، یا کوئی بھی نہیں دیکھ پاتا، اور یہ اخفیٰ (انتہائی پوشیدہ) ہوتا ہے، مگر اس کے لیے خود اس کی ذات میں جلی ہوتا ہے، کیونکہ وہ صاحب شہود (الشہود) ہے۔ اور غیر انبیاء کا حکم ایسے معاملات میں انبیاء کے حکم سے مختلف ہوتا ہے۔ کیونکہ انبیاء اگرچہ ان لوگوں کو ان کے اس حال میں دیکھتے ہیں جب وہ اپنی دعا کے ذریعے اللہ سے مطلوبہ وجہ (ذات) کا شہود (الشہود) کر رہے ہوتے ہیں، لیکن چونکہ وہ بندوں کی مصلحتوں کے لیے بھیجے گئے ہیں، اس لیے وہ مطلقاً ان کے ساتھ مقید نہیں ہوتے۔ بلکہ وہ ان مصلحتوں کے ساتھ مقید ہوتے ہیں جن کی وجہ سے وہ مبعوث کیے گئے ہیں۔ چنانچہ بعض اوقات ان پر عتاب ہوتا ہے، حالانکہ وہ مصلحت میں ہوتے ہیں، جیسے کہ یہ آیت اور جیسے نابینا کی آیت جس میں عَبَسَ وتَوَلَّى (اس نے تیوری چڑھائی اور منہ موڑ لیا) نازل ہوئی۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے اس نابینا سے منہ نہیں موڑا جس کے بارے میں حق (الحق) نے آپ پر عتاب کیا، مگر اس حرص اور طمع کی وجہ سے کہ وہ شخص اسلام قبول کر لے جس کے اسلام لانے سے بہت سی مخلوق اسلام لائے گی اور جس کے ذریعے اللہ دین کی تائید کرے گا۔ اس کے باوجود، آپ پر عتاب ایک دوسری حقیقت کی بنا پر ہوا، نہ کہ اس جہت سے۔ چنانچہ اسی میں سے اللہ کا یہ قول ہے: أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى (لیکن جو شخص بے پرواہی کرتا ہے، تو تم اس کی طرف متوجہ ہوتے ہو)۔ پس اللہ نے صفت کا ذکر کیا اور شخص کا ذکر نہیں کیا۔ اور غنا (بے نیازی) ایک صفتِ الٰہیہ ہے۔ پس رسول اللہ صلی اللہ علیہ وسلم کی نگاہ صرف ایک صفتِ الٰہیہ کی طرف مائل ہوئی، کیونکہ آپ صلی اللہ علیہ وسلم فقر (محتاجی) کے ساتھ متحقق تھے۔ پس حق (الحق) نے چاہا کہ آپ کو احاطہ الٰہیہ پر متنبہ کرے، تاکہ کوئی صفت آپ کو دوسری صفت سے مقید نہ کرے۔ چنانچہ آپ صلی اللہ علیہ وسلم کا حق (الحق) کی غنا (بے نیازی) کا شہود (الشہود) اس قول میں: فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ (بے شک اللہ تمام جہانوں سے بے نیاز ہے) آپ صلی اللہ علیہ وسلم کے حق (الحق) کے طلب کا شہود (الشہود) اس قول میں: وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا) سے زیادہ اولیٰ نہیں ہے۔ اور غنا (بے نیازی) کا مقام اس طلب اور اس قول سے کہاں ہے: وأَقْرِضُوا الله قَرْضاً حَسَناً (اور اللہ کو قرضِ حسنہ دو)۔ پس اللہ سبحانہ کو غیرت آئی کہ کوئی صفت آپ کو دوسری صفت سے مقید کر دے۔ بلکہ آپ صلی اللہ علیہ وسلم ان لوگوں کے لیے ان کے شایانِ شان بشاشت ظاہر کرتے تھے اور نابینا کے لیے اس قدر خوشی ظاہر کرتے تھے جس سے ان جباروں کے حق میں مصلحت واقع ہوتی۔ کیونکہ تواضع اور بشاشت ہر ایک کی طرف سے بالذات محبوب ہے، کیونکہ یہ مکارمِ اخلاق میں سے ہے۔ اور اللہ اپنے نبی صلی اللہ علیہ وسلم کی مسلسل تادیب فرماتا رہا\n\nیہاں تک کہ آپ ادبِ الٰہی کے ساتھ متحقق ہو گئے۔\n\nپس آپ نے فرمایا: \"بے شک اللہ نے مجھے ادب سکھایا اور میرے ادب کو بہترین بنا دیا۔\"\n\nبے شک اللہ کا اغنیاء (مالداروں) سے بھی وہی نسبت ہے جو فقراء (محتاجوں) سے ہے۔ پس عارف (العارف) کے لیے ضروری ہے کہ ہر چیز میں حق (الحق) کی کوئی چیز اس سے فوت نہ ہو۔ پس اللہ کا اپنے بندوں کو تعلیم دینا کتنا اچھا ہے۔ جب اللہ ہماری بصیرتوں اور فہم کی آنکھیں کھول دیتا ہے، تو ہم جان لیتے ہیں کہ اللہ کا اپنے نبی صلی اللہ علیہ وسلم کو مراتب کے ساتھ آداب سکھانا، اس تعلیم سے ہم بھی مراد ہیں۔ اور ہم اسے نبی صلی اللہ علیہ وسلم میں ایک ضرب المثل کے طور پر دیکھتے ہیں: \"اے پڑوسن، میں تمہیں مخاطب کرتا ہوں، پس تم سنو۔\" اگرچہ آپ صلی اللہ علیہ وسلم ہی اللہ کے ادب کا مقصود تھے، لیکن ہم بھی آپ کی پیروی اور اقتداء کے ذریعے اللہ کے مقصود ہیں: لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ (بے شک تمہارے لیے رسول اللہ میں بہترین نمونہ ہے)۔ پس ہر وہ خطاب جس سے اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو مخاطب کیا، آپ کو ادب سکھاتے ہوئے، اس خطاب میں ہمارا بھی اشتراک ہے، یہ ضروری ہے۔ پس اے ولی! اس ذکر میں غور کرو کہ اس سے کتنی زیادہ خیر پیدا ہوئی ہے۔ واللّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب پانصد و بیست و هفتم در شناخت حال قطبی که منزل او [این آیه] بود: **«و خویشتن را با کسانی که پروردگارشان را صبح و شام می‌خوانند و روی او را می‌خواهند، شکیبا ساز و چشمانت را از ایشان برمگیر»** (وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَداةِ والْعَشِيِّ يُرِيدُونَ وَجْهَهُ ولا تَعْدُ عَيْناكَ عَنْهُمْ الآية))\n\nبرای خدا قومی هستند که به آنچه برایش آفریده شدند وفا کردند *** پس هیچ طبقه‌ای نگذشت مگر آنکه طبقه‌ای دیگر آشکار شد\nپس با این قوم، نفسی را شکیبا ساز که سپاسگزارش نیستی *** مگر آنکه به مانند آنچه روزی آنان شد، روزی داده شوی\nاز شکستگی و خواری و خاکساری *** که در آن رایحه‌های مشک است و بوی آن خوشبوست\nپس مبادا اوصاف من تو را بفریبد، زیرا برای آن [اوصاف] *** جایگاه‌هایی است و اقوامی به واسطه آن سخن گفته‌اند\n\n[اینکه برای خدا بندگانی است که احوالشان ذکری بود که با آن به خدا تقرب جسته می‌شد]\n\nبدان، خداوند ما و تو را به آنچه آنان را به واسطه روح القدس (الروح القدسي) تأیید کرد، تأیید نماید، که برای خدا بندگانی است که احوال و افعالشان ذکری بود که با آن به خدا تقرب جسته می‌شد و از آن، معرفتی (المعرفة) نسبت به حق حاصل می‌شد که جز کسی که آن را چشیده باشد، نمی‌داند. پس هر کس نفس خود را با این ذکر حبس کند، به آنان ملحق می‌شود. زیرا هر آنچه خداوند پیامبرش (صلی الله علیه و سلم) را به آن امر کرد و از آن نهی نمود، عین احوال و افعال آنان بود، با وجود اینکه این طایفه که این قرآن در حقشان نازل شد، از اصحاب رسول خدا (صلی الله علیه و سلم) بودند. آنان به آنچه رسیدند، جز با پیروی از او و فهم آنچه از او فهمیدند، نرسیدند. با این حال، خداوند متعال پیامبرش (صلی الله علیه و سلم) را در مورد آنان عتاب کرد تا...\n\nرسول خدا (صلی الله علیه و سلم) هرگاه یکی از آنان را ملاقات می‌کرد یا در مجلسی می‌نشست که آنان در آن بودند، پیوسته نفس خود را با آنان حبس می‌کرد تا زمانی که خودشان منصرف می‌شدند و آنگاه رسول خدا (صلی الله علیه و سلم) نیز منصرف می‌شد.\n\nو پیامبر (صلی الله علیه و سلم) هرگاه آنان حاضر می‌شدند، چشمانش از ایشان برنمی‌گشت و هرگاه نزد او می‌آمدند یا آنان را ملاقات می‌کرد، می‌فرمود: «خوش آمدید به کسانی که خداوند مرا به خاطرشان عتاب کرد.» و چون آنان این را دانستند، نشستن با رسول خدا (صلی الله علیه و سلم) را سبک می‌کردند.\n\nو این سخن [اشاره به آیه] به دلیل آن بود که آنان از مقید شدن پیامبر (صلی الله علیه و سلم) به خودشان و شکیبایی او با آنان آگاه بودند. پس هر کس ملازم این ذکر شود، برای او معرفت وجه حق (وجه الحق) در هر چیزی حاصل می‌شود، به طوری که هیچ چیزی را نمی‌بیند مگر آنکه وجه حق را در آن می‌بیند. زیرا آنان پروردگارشان را صبح و شام (بِالْغَداةِ والْعَشِيِّ) نخواندند که زمان تحصیل روزی برای روزی‌خواران است، چنانکه فرمود: **«روزی آنان در آنجا بامدادان و شامگاهان است»** (لَهُمْ رِزْقُهُمْ فِيها بُكْرَةً وعَشِيًّا)، که نزد عرب همان صبوح و غبوق است. بلکه روزی اینان در صبح و شام، همان معرفتی بود که از وجهی که مرادشان بود، برایشان حاصل می‌شد. زیرا فرمود: **«روی او را می‌خواهند»** (يُرِيدُونَ وَجْهَهُ)، یعنی با آن دعا در صبح و شام، وجه حق را می‌خواهند، چون می‌دانستند که **«هر چیزی جز روی او نابود شونده است»** (هالِكٌ إِلَّا وَجْهَهُ). پس آنچه باقی می‌ماند را طلب کردند و آن را بر آنچه فانی می‌شود ترجیح دادند. پس وجه حق در اشیاء بر آنان تجلی (التجلی) می‌کند. و به همین دلیل، چشمان این ذاکر به این ذکر، از این وجه برنمی‌گردد و نمی‌تواند برگردد، زیرا آن [وجه] به ذات خود هر بیننده‌ای را مقید می‌سازد. و نهی در این ذکر تنها به این دلیل آمده است که آنان عین وجه نیستند، بلکه مشاهده‌کنندگان (الشهود) وجه هستند. پس هر کس از آنان که تجلی (التجلی) وجه برایش حاصل شده و با این ذکر باقی مانده است، تنها بقای شهود (الشهود) دائمی آن وجه را می‌خواهد، به دلیل آنچه از حال ممکن می‌داند و آنچه شایسته جلال خداوند از ادب با اوست، به طوری که بر او به چیزی حکم نمی‌کند، هرچند او خود بر نفس خویش حکم کند. این همان ادب الهی است. و کسی که آن وجه مطلوب برایش تبدیل نشده است، با دعای خود آن وجه مراد را می‌طلبد. و در هر حال، چشمان رسول خدا (صلی الله علیه و سلم) تا زمانی که آنان حاضر بودند، از ایشان به سوی دیگری برنمی‌گشت. و از همین جاست که...\n\nرسول خدا (صلی الله علیه و سلم) در وصف اولیای خدا فرمود: «آنان کسانی هستند که هرگاه دیده شوند، خدا یاد می‌شود»، به دلیل نوری که از این وجه که مراد اینان است، برایشان حاصل شده است. زیرا کسی که این وجه بر او تجلی (التجلی) کند، ناگزیر اثری معلوم و حتمی در او خواهد بود. برخی از این آثار آشکار است، به طوری که دیگری آن را در او می‌بیند، و برخی پنهان است، به طوری که جز اهل کشف (الکشف) آن را در او نمی‌بینند، یا هیچ کس آن را نمی‌بیند و آن اخفی است، اما برای خود او آشکار است، زیرا او صاحب شهود (الشهود) است. و حکم غیر انبیا در چنین اموری، خلاف حکم انبیاست. زیرا انبیا، هرچند آنان را در حال شهود (الشهود) وجهی که با دعایشان از خداوند خواسته‌اند، مشاهده کنند، اما از آنجا که برای مصالح بندگان فرستاده شده‌اند، به طور مطلق مقید به آنان نمی‌شوند، بلکه مقید به مصالحی می‌شوند که به سبب آن مبعوث شده‌اند. پس گاهی مورد عتاب قرار می‌گیرند، با وجود اینکه در مصلحتی مانند این آیه هستند، و مانند آیه نابینایی که در حق او **«چهره درهم کشید و روی گرداند»** (عَبَسَ وتَوَلَّى) نازل شد. زیرا رسول خدا (صلی الله علیه و سلم) از نابینایی که حق او را عتاب کرد، روی نگرداند مگر به دلیل حرص و طمع در اسلام آوردن کسی که با اسلام آوردن او، خلق بسیاری اسلام می‌آورند و خداوند دین را به واسطه او تأیید می‌کند. با این حال، عتاب از حقیقتی دیگر بر او واقع شد، نه از این جهت. از جمله آن [عتاب]، سخن خداوند است: **«اما آن کس که خود را بی‌نیاز می‌بیند، تو به او می‌پردازی»** (أَمَّا مَنِ اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى). پس صفت را ذکر کرد و شخص را ذکر نکرد. و غنا صفتی الهی است. پس چشم رسول خدا (صلی الله علیه و سلم) منحرف نشد مگر به سوی صفتی الهی، به دلیل تحقق او (صلی الله علیه و سلم) به فقر. پس حق خواست او را بر احاطه الهی آگاه سازد تا صفتی او را از صفتی دیگر مقید نسازد. پس شهود (الشهود) او (صلی الله علیه و سلم) برای غنای حق در قولش: **«همانا خداوند از جهانیان بی‌نیاز است»** (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ)، اولی‌تر از شهود او (صلی الله علیه و سلم) برای طلب حق در قولش: **«و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند»** (وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ) نیست. و مقام غنا کجا و این طلب کجا؟ و [همچنین] قولش: **«و به خدا قرض نیکو دهید»** (وَأَقْرِضُوا الله قَرْضاً حَسَناً). پس خداوند سبحان بر او غیرت ورزید که صفتی او را از صفتی دیگر مقید سازد. بلکه او (صلی الله علیه و سلم) برای آنان [فقرا] از بشاشت به اندازه‌ای که شایسته آنان بود، آشکار می‌ساخت و برای نابینا از شادی به اندازه‌ای که مصلحت در حق آن جباران واقع شود، آشکار می‌ساخت. زیرا تواضع و بشاشت ذاتاً نزد هر کسی محبوب است، چرا که از مکارم اخلاق است. و خداوند پیوسته پیامبرش (صلی الله علیه و سلم) را تأدیب می‌کرد...\n\nتا آنکه به ادب الهی تحقق یافت.\n\nپس فرمود: **«همانا خداوند مرا ادب کرد و نیکو ادب کرد»** (إن الله أدبني فأحسن أدبي).\n\nزیرا خداوند نسبت به اغنیا دارد، همانطور که نسبت به فقرا دارد. پس شایسته عارف است که هیچ چیزی از حق در هیچ چیزی از او فوت نشود. پس چه نیکوست تعلیم خداوند به بندگانش! ما نیز اگر خداوند چشمان بصیرت و فهم‌هایمان را بگشاید، خواهیم دانست که تعلیم آداب خداوند به پیامبرش (صلی الله علیه و سلم) با مراتب مختلف، ما نیز مراد آن تعلیم هستیم و به آن در پیامبر (صلی الله علیه و سلم) می‌نگریم، مانند ضرب‌المثل رایج: «ایاک أعنی فاسمعی یا جارة» (منظورم تو هستی، پس ای همسایه بشنو). و اگرچه او (صلی الله علیه و سلم) مقصود خداوند برای ادب بود، ما نیز مقصود خداوند برای تأسی و اقتدا به او هستیم: **«همانا برای شما در رسول خدا سرمشقی نیکوست»** (لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ). پس هر خطابی که خداوند پیامبرش (صلی الله علیه و سلم) را با آن مورد خطاب قرار داد و او را ادب کرد، ما نیز در آن خطاب اشتراک داریم و این ضروری است. پس ای ولی، در این ذکر بنگر که چه خیر کثیری حاصل شد. و **«خداوند حق را می‌گوید و او راه را هدایت می‌کند»** (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}