{
  "id": 183,
  "title": {
    "ar": "الباب الثالث والثمانون ومائة في معرفة مقام ترك السماع",
    "en": "Chapter One Hundred and Eighty-Three: Concerning the Knowledge of the Station (مقام) of Abandoning the Spiritual Audition (ترك السماع)",
    "ur": "باب ایک سو تراسی (۱۸۳) معرفتِ مقامِ ترک السماع (ترك السماع) کے بیان میں۔",
    "fa": "باب صد و هشتاد و سوم در معرفت مقام ترک سماع"
  },
  "content": {
    "ar": "## (الباب الثالث والثمانون ومائة في معرفة مقام ترك السماع)\n\n\n> الله الله لا عقل يصوره *** والوهم يعبده في صورة البشر\n\n\n> فالشرع يطلقه وقتا ويحصره *** والكون يثبته في سائر الصور\n\n\n> ترك السماع مقام ليس يدركه *** إلا القوي من الأقوام في الخبر\n\n\n> إن قال كن فلمن والعين واحدة *** ولم يكن غيره في العين والأثر\n\n\n> فما لكن عند هذا القول من أثر *** بل عين كن لم تكن إن كنت ذا نظر\n\n\n> ولم يقل بسماع القول غير فتى *** متيم بمعاني الآي والصور\n\n\n> لو لا الكلام لما كان السماع وقد *** جاء الكلام فكن منه على حذر\n\n\n### [السماع الذي يتركه الغناء]\n\n\nالسماع المطلق لا يمكن تركه والذي يتركه الأكابر إنما هو السماع المقيد المتعارف وهو الغناء قيل لسيدنا أبي السعود ابن الشبلي البغدادي ما تقول في السماع فقال هو على المبتدئ حرام والمنتهي لا يحتاج إليه فقيل له فلمن فقال لقوم متوسطين أصحاب قلوب وجاءت امرأة إلى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقالت يا رسول الله إني نذرت أن أضرب بين يديك بالدف فقال لها إن كنت نذرت وإلا فلا فهو وإن كان مباحا فالتنزيه عنه عند الأكابر أولى وكان أبو يزيد البسطامي يكرهه ولا يقول به وقيل لابن جريج فيه فقال ليتني أخرج منه رأسا برأس لا علي ولا لي‏\n\n\n### [رأى ابن العربي في السماع‏]\n\n\nوأما مذهبنا فيه فإن الرجل المتمكن من نفسه لا يستدعيه وإذا حضر لا يخرج بسببه وهو عندنا مباح على الإطلاق لأنه لم يثبت في تحريمه شي‏ء عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فإن كان الرجل ممن لا يجد قلبه مع ربه إلا فيه فواجب عليه تركه أصلا فإنه مكر إلهي خفي ثم إن كان يجد قلبه فيه وفي غيره وعلى كل حال ولكنه يجده في النغمات أكثر فحرام عليه حضوره ولا أعني بالنغمات المسموعة في الشعر فقط وإنما أعني بوجود النغمة في الشعر وفي غيره حتى في القرآن إذا وجد قلبه فيه لحسن صوت القارئ ولا يجد قلبه فيه عند ما يسمعه من قارئ غير طيب الصوت فلا يعول على ذلك الوجد\nولا على ما يجد فيه من الرقة في الجناب الإلهي فإنه معلول وتلك رقة الطبيعة فإن كان\n\n\nعارفا بالتفصيل ويفرق بين سماعه الإلهي والروحاني والطبيعي ما يلتبس عليه ولا يخلط ولا يقول في سماع الطبيعة إنه سماعه بالله فمثل هذا لا يحجر عليه وتركه أولى ولا سيما إن كان ممن يقتدى به من المشايخ فيستتر به المدعي الكاذب أو الجاهل بحاله وإن لم يقصد الكذب‏\n\n",
    "en": "Chapter One Hundred and Eighty-Three: Concerning the Knowledge of the Station of Abandoning Audition (Sama')\n\nAllah, Allah! No intellect can conceive Him,\nYet imagination worships Him in the form of humanity.\n\nThe Sacred Law (الشرع) sometimes releases Him and sometimes restricts Him,\nWhile the Cosmos (الكون) affirms Him in all forms.\n\nAbandoning Audition (ترك السماع) is a station not grasped\nExcept by the strong among the people, according to the report.\n\nIf He said 'Be!' (كن), for whom was it, when the Essence (العين) is one?\nAnd there was none other than Him in the Essence and the trace (الأثر).\n\nThus, 'Be!' (كن) has no effect (أثر) when this Saying occurs,\nRather, the very essence of 'Be!' (عين كن) was not, if you possess insight (نظر).\n\nAnd none speaks of hearing the Saying except a youth\nEnamored by the meanings of the signs (الآي) and the forms (الصور).\n\nWere it not for the Speech (الكلام), there would be no Audition (السماع);\nAnd the Speech has come, so be wary of it.\n\n### [The Audition that is Abandoned, which is Singing]\n\nThe absolute Audition (السماع المطلق) cannot be abandoned. What the great masters (الأكابر) abandon is only the restricted, conventional Audition, which is singing (الغناء). It was said to our master Abu al-Su'ud ibn al-Shibli al-Baghdadi: \"What do you say about Audition (السماع)?\" He replied: \"It is forbidden (حرام) for the beginner, and the one who has reached the end (المنتهي) has no need for it.\" He was asked: \"Then for whom is it?\" He said: \"For a group of intermediates, people of hearts (أصحاب قلوب).\" A woman came to the Messenger of Allah (PBUH) and said: \"O Messenger of Allah, I vowed to beat the drum (الدف) before you.\" He said to her: \"If you have vowed, [fulfill it]; otherwise, no.\" Although it is permissible (مباح), abstaining from it (التنزيه عنه) is more fitting for the great masters. Abu Yazid al-Bistami disliked it and did not approve of it. Ibn Jurayj was asked about it and said: \"I wish I could emerge from it even, neither for me nor against me.\"\n\n### [Ibn Arabi's View on Audition]\n\nAs for our doctrine (مذهبنا) concerning it: The man who is established in control of his soul (المتمكن من نفسه) does not seek it out, and if it is present, he does not leave because of it. It is, in our view, permissible (مباح) absolutely (على الإطلاق), because nothing has been established regarding its prohibition (تحريمه) from the Messenger of Allah (PBUH).\n\nHowever, if a man is one who does not find his heart (قلبه) with his Lord except through it, then it is obligatory (واجب) for him to abandon it entirely (أصلا), for that is a subtle Divine deception (مكر إلهي خفي). Furthermore, if he finds his heart in it and in other things, and in every state, but finds it more intensely in the melodies (النغمات), then it is forbidden (حرام) for him to attend it. I do not mean by melodies only those heard in poetry, but I mean the finding of the melody in poetry and in other things, even in the Quran, if he finds his heart in it due to the beautiful voice of the reciter (القارئ), and does not find his heart in it when he hears it from a reciter whose voice is not pleasant. He should not rely upon that spiritual finding (الوجد) nor upon the tenderness (الرقة) he finds in it toward the Divine Presence (الجناب الإلهي), for it is defective (معلول), and that is the tenderness of nature (رقة الطبيعة).\n\nIf he is a Gnostic (عارف) who understands the details (بالتفصيل) and can distinguish between his Divine (الإلهي), Spiritual (الروحاني), and Natural (الطبيعي) Audition, so that it is not confused for him and he does not mix them, and he does not claim that his natural Audition is his Audition *by* Allah—such a person is not restricted. However, abandoning it is more fitting (أولى), especially if he is one of the Shaykhs who is followed as an example, lest the false claimant (المدعي الكاذب) or the ignorant person (الجاهل) use him as a cover for their state, even if they do not intend falsehood.",
    "ur": "## (باب ایک سو تراسی: سماع کو ترک کرنے کے مقام کی معرفت میں)\n\n> اللہ، اللہ! کوئی عقل اس کی صورت نہیں بنا سکتی\n> اور وہم اس کی عبادت انسانی صورت میں کرتا ہے\n\n> پس شریعت اسے کبھی مطلق کرتی ہے اور کبھی محدود کرتی ہے\n> اور کائنات اسے تمام صورتوں میں ثابت کرتی ہے\n\n> سماع کا ترک ایک ایسا مقام ہے جسے نہیں پا سکتا\n> مگر وہ جو خبر میں قوموں میں سے قوی ہو\n\n> اگر وہ (الحق) کہے \"کُن\" (ہو جا) تو کس کے لیے؟ جبکہ عین (ذات) ایک ہے\n> اور عین (ذات) اور اثر میں اس کے سوا کوئی نہیں تھا\n\n> پس اس قول کے نزدیک \"کُن\" کا کوئی اثر نہیں\n> بلکہ \"کُن\" کی عین بھی نہیں تھی، اگر تم صاحبِ نظر ہو\n\n> اور اس قول کے سماع کا قائل نہیں ہوا مگر وہ جوان\n> جو آیات اور صورتوں کے معانی پر فریفتہ ہے\n\n> اگر کلام نہ ہوتا تو سماع نہ ہوتا، اور کلام آ چکا ہے\n> پس تم اس سے ہوشیار رہو\n\n### [وہ سماع جسے ترک کیا جاتا ہے، یعنی غناء]\n\nمطلق سماع کو ترک کرنا ممکن نہیں، اور جسے اکابر ترک کرتے ہیں وہ درحقیقت مقید اور معروف سماع ہے، جو کہ غناء (گانا) ہے۔ ہمارے سردار ابو السعود ابن الشبلی البغدادی سے پوچھا گیا کہ آپ سماع کے بارے میں کیا کہتے ہیں؟ تو انہوں نے فرمایا: \"یہ مبتدی کے لیے حرام ہے، اور منتہی کو اس کی ضرورت نہیں ہے۔\" ان سے پوچھا گیا: \"تو پھر یہ کس کے لیے ہے؟\" انہوں نے فرمایا: \"متوسط درجے کے لوگوں کے لیے جو اصحابِ قلوب ہیں۔\"\n\nاور ایک عورت رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی خدمت میں حاضر ہوئی اور عرض کیا: \"یا رسول اللہ! میں نے نذر مانی تھی کہ آپ کے سامنے دف بجاؤں گی۔\" آپ نے اس سے فرمایا: \"اگر تم نے نذر مانی ہے (تو بجا لو)، ورنہ نہیں۔\"\n\nپس اگرچہ یہ (سماع) مباح ہے، لیکن اکابر کے نزدیک اس سے تنزیہ (پرہیز) اولیٰ ہے۔ اور ابو یزید بسطامی اسے ناپسند کرتے تھے اور اس کے قائل نہیں تھے۔ ابن جریج سے اس کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"کاش میں اس سے سرابرابر (نہ نفع نہ نقصان) نکل جاؤں، نہ میرے حق میں ہو اور نہ میرے خلاف۔\"\n\n### [ابن عربی کی سماع کے بارے میں رائے]\n\nاور جہاں تک اس بارے میں ہمارا مسلک ہے، تو وہ یہ ہے کہ جو شخص اپنے نفس پر متمکن ہو وہ اسے طلب نہیں کرتا، اور جب وہ حاضر ہو جائے تو اس کی وجہ سے باہر نہیں نکلتا۔ اور ہمارے نزدیک یہ مطلقاً مباح ہے، کیونکہ اس کی حرمت میں رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم سے کوئی چیز ثابت نہیں ہے۔\n\nلیکن اگر کوئی شخص ایسا ہو کہ وہ اپنے رب کے ساتھ اپنے قلب کو صرف اسی (سماع) میں پاتا ہو، تو اس پر لازم ہے کہ وہ اسے بالکل ترک کر دے، کیونکہ یہ ایک خفی الٰہی مکر ہے۔\n\nپھر اگر وہ اپنے قلب کو اس میں اور اس کے علاوہ میں بھی پاتا ہو، اور ہر حال میں پاتا ہو، لیکن نغمات میں اسے زیادہ پاتا ہو، تو اس پر اس کا حاضر ہونا حرام ہے۔ اور نغمات سے میری مراد صرف وہ نہیں جو شعر میں سنی جاتی ہیں، بلکہ میری مراد نغمہ کا وجود شعر میں اور اس کے علاوہ میں بھی ہے، یہاں تک کہ قرآن میں بھی، اگر وہ قاری کی اچھی آواز کی وجہ سے اس میں اپنے قلب کو پائے، اور جب وہ اسے کسی ایسے قاری سے سنے جس کی آواز اچھی نہ ہو تو اپنے قلب کو اس میں نہ پائے، تو اسے اس وجد (وجد) پر بھروسہ نہیں کرنا چاہیے۔\n\nاور نہ ہی اس رقت پر جو وہ جنابِ الٰہی میں اس (سماع) میں پاتا ہے، کیونکہ یہ معلول ہے اور یہ طبیعت کی رقت ہے۔\n\nلیکن اگر وہ تفصیل کے ساتھ عارف ہو اور اپنے سماعِ الٰہی، روحانی، اور طبیعی کے درمیان فرق کر سکتا ہو، تو اس پر کوئی التباس نہیں ہوتا اور وہ خلط نہیں کرتا، اور وہ طبیعی سماع کے بارے میں یہ نہیں کہتا کہ یہ اللہ کے ساتھ اس کا سماع ہے۔ تو ایسے شخص پر کوئی پابندی نہیں لگائی جائے گی، لیکن اس کا ترک کرنا اولیٰ ہے، خاص طور پر اگر وہ ان شیوخ میں سے ہو جن کی اقتدا کی جاتی ہے، تاکہ جھوٹا مدعی یا وہ جاہل جو اپنے حال سے واقف نہیں ہے، اس کے ذریعے پردہ پوشی نہ کرے، اگرچہ اس کا ارادہ جھوٹ بولنے کا نہ ہو۔",
    "fa": "باب صد و هشتاد و سوم در معرفت مقام ترک سماع (Samāʿ)\n\nالله، الله، هیچ عقلی او را تصور نمی‌کند *** و وهم او را در صورت بشر می‌پرستد.\n\nپس شریعت گاهی او را رها می‌کند و گاهی محدود می‌سازد *** و هستی (الوجود) او را در همه صورت‌ها ثابت می‌دارد.\n\nترک سماع (Samāʿ) مقامی است که آن را درک نمی‌کند *** مگر قوی‌ترین افراد در خبر (دانش).\n\nاگر بگوید \"باش\" (کن)، برای کیست؟ در حالی که عین (ذات) یکی است *** و در عین و اثر (نتیجه) جز او نبوده است.\n\nپس برای \"باش\" (کن) نزد این قول اثری نیست *** بلکه عین \"باش\" (کن) وجود نداشته است اگر اهل نظر باشی.\n\nو به شنیدن این قول (سماع) نگفته است مگر جوانی *** که شیفته معانی آیات و صورت‌هاست.\n\nاگر کلام نبود، سماع (Samāʿ) نیز نبود *** و کلام آمده است، پس از آن بر حذر باش.\n\n### [سماع (Samāʿ) که غنا (آوازخوانی) است و ترک می‌شود]\n\nترک سماع (Samāʿ) مطلق ممکن نیست، و آنچه بزرگان (الأکابر) ترک می‌کنند، تنها سماع (Samāʿ) مقید و متعارف است که همان غنا (آوازخوانی) است. از سرور ما ابوالسعود ابن شبلی بغدادی پرسیده شد: درباره سماع (Samāʿ) چه می‌گویی؟ گفت: برای مبتدی حرام است و منتهی (سالک به کمال رسیده) به آن نیازی ندارد. از او پرسیده شد: پس برای کیست؟ گفت: برای گروهی متوسط که صاحبان قلب هستند. و زنی نزد رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) آمد و گفت: یا رسول الله، من نذر کرده‌ام که در حضور شما دف بزنم. پیامبر به او فرمود: «إن كنت نذرت وإلا فلا» (اگر نذر کرده‌ای [اجرا کن]، وگرنه [لازم نیست]). پس اگرچه مباح است، اما پرهیز از آن نزد بزرگان (الأکابر) اولی‌تر است. و ابویزید بسطامی آن را ناخوش می‌داشت و به آن قائل نبود. و به ابن جریج درباره آن گفته شد، پس گفت: «لیتنی أخرج منه رأسا برأس لا علي ولا لي» (ای کاش سر به سر از آن بیرون آیم، نه به سود من باشد و نه به زیان من).\n\n### [رأی ابن عربی در سماع (Samāʿ)]\n\nاما مذهب ما در این باره این است که مردی که بر نفس خود متمکن (مسلط) است، آن را طلب نمی‌کند، و اگر حاضر شود، به سبب آن خارج نمی‌شود. و نزد ما مطلقاً مباح است، زیرا هیچ چیز در تحریم آن از رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) ثابت نشده است.\n\nاگر مردی باشد که قلب خود را با پروردگارش جز در آن (سماع) نمی‌یابد، ترک آن بر او واجب است، زیرا آن مکر الهی (مکر إلهی) پنهانی است. سپس اگر قلب خود را در آن و در غیر آن و در هر حال می‌یابد، اما آن را در نغمه‌ها بیشتر می‌یابد، حضور در آن بر او حرام است. و منظورم از نغمه‌ها، تنها نغمه‌های شنیده شده در شعر نیست، بلکه منظورم وجود نغمه در شعر و در غیر آن است، حتی در قرآن، اگر قلب خود را در آن به دلیل خوش‌صدایی قاری بیابد، و قلب خود را در آن نیابد هنگامی که آن را از قاری‌ای که صدای خوشی ندارد می‌شنود، پس نباید بر آن وجد (وجد) تکیه کند. و نه بر رقتی که در آستان الهی در آن می‌یابد، زیرا آن معلول (بیمارگونه) است و آن رقت، رقت طبیعت است.\n\nپس اگر عارف (عارف) به تفصیل باشد و میان سماع (Samāʿ) الهی، روحانی و طبیعی خود تمایز قائل شود، به گونه‌ای که بر او مشتبه نشود و خلط نکند و درباره سماع (Samāʿ) طبیعت نگوید که آن سماع (Samāʿ) به واسطه حق (الحق) است، بر چنین کسی منعی نیست. و ترک آن اولی‌تر است، به ویژه اگر از مشایخی باشد که به او اقتدا می‌شود، زیرا مدعی دروغین یا جاهل به حال خود، هرچند قصد دروغ نداشته باشد، به واسطه او پنهان می‌شود (و عمل او را توجیه می‌کند)."
  },
  "page_count": 2
}