{
  "id": 271,
  "title": {
    "ar": "الباب الأحد والسبعون ومائتان في معرفة منزل عند الصباح يحمد القوم السري من المناجاة المحمدية وهو أيضا من منازل الأمر",
    "en": "Chapter Two Hundred and Seventy-One: Concerning the Gnosis of the Station [منزل] of \"At Dawn, the People Praise the Night Journey,\" which is derived from the Muhammadan Intimate Discourse [المناجاة المحمدية], and which is also one of the Stations of the Command [الأمر].",
    "ur": "باب دو سو اکہتر: اس منزل کی معرفت کے بیان میں جہاں صبح کے وقت سالکین (قوم) شبانہ سفر (سري) کی تعریف کرتے ہیں، جو محمدی مناجات (Munājāt) میں سے ہے اور یہ منازلِ امر (Manāzil al-Amr) میں سے بھی ہے۔",
    "fa": "باب دویست و هفتاد و یکم در معرفت منزل «عند الصباح یحمد القوم السری» (هنگام صبح، قوم از سیر شبانه خود سپاسگزاری می‌کنند) از مناجات محمدیه، و این نیز از منازل امر است."
  },
  "content": {
    "ar": "## «الباب الأحد والسبعون ومائتان في معرفة منزل عند الصباح يحمد القوم السري من المناجاة المحمدية وهو أيضا من منازل الأمر»\n> ما لفظة يقولها كل الورى *** عند الصباح يحمد القوم السري‏\n\n\n> ما ذا ترى في قولهم يا من يرى *** كل الأنام في الإمام والورا\n\n\n> قد خاب في إنبائه من افترى *** على الإله عالما بما جرى‏\n\n\nاعلم أيدنا الله وإياك بروح منه أن هذا المنزل منزل علم السري وأهله ويتضمن معرفة عالم الخلق والظلال ومنه يعرف كسوف القمر أهل الكشف وأنه من الخشوع الطارئ عن القمر من التجلي ويتعلق بهذا المنزل علم هاروت وماروت من علم السحر وعلم طلوع الأنوار\n\n\n### [أن الأنوار على قسمين أنوار أصلية وأنوار متولدة عن ظلمة الكون‏]\n\n\nاعلم وفقك الله للقبول أن الأنوار على قسمين أنوار أصلية وأنوار متولدة عن ظلمة الكون كنور قوله تعالى وآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ فَإِذا هُمْ مُظْلِمُونَ وكقوله عز وجل فالِقُ الْإِصْباحِ وجَعَلَ اللَّيْلَ سَكَناً ينظر إلى ذلك ومن آياتِهِ أَنْ خَلَقَ لَكُمْ من أَنْفُسِكُمْ أَزْواجاً لِتَسْكُنُوا إِلَيْها ليكون له على النور ولادة والنور المتكلم عليه في هذا المنزل هو النور المولد الزماني وهذا المنزل مخصوص بالإمام الواحد من الإمامين اللذين للقطب وهو المسمى بعبد ربه وتارة يكون هذا النور ذكرا وتارة يكون أنثى فإذا غشى الليل النهار فالمتولد منه هو النور المطلوب وهذا النور المولد الذي شرعنا فيه هو نور العصمة للنبي والحفظ للولي وهو يعطي الحياء والكشف التام فإنه يكشف ويكشف به والنور الأصلي يكشف ولا يكشف به لأنه يغلب على نور الأبصار فتزول الفائدة التي جاء لها النور ولهذا تلجأ نفوس العارفين بالأنوار ومراتبها إلى هذا النور المولد من الظلمة للمناسبة التي بيننا وبينه من خلق أرواحنا فإن الأرواح الجزئية متولدة عن الروح الكلي المضاف إلى الحق والأجسام الطبيعية الظلمانية بعد تسويتها وحصول استعدادها للقبول فيظهر بينهما في الجسم الروح الجزئي الذي هو روح الإنسان ينفلق عنه الجسم كانفلاق الصباح من فالق الإصباح في الليل فتقع المناسبة بين هذا النور وبين روح الإنسان فلذلك يأنس به ويستفيد منه وهكذا أجرى الله العادة ولم يعط من القوة أكثر من هذا ولو شاء لفعل وهكذا جرت المظاهر الإلهية المعبر عنها بالتجليات فإن النور الأصلي مبطون فيها غيب لنا والصور التي يقع فيها التجلي محل لظهور المظهر فتقع الرؤية منا على المظاهر ولهذا هي المظاهر مقيدة بالصور ليكون الإدراك منا بمناسبة صحيحة فإن المقصود من ذلك حصول الفائدة به وبما يكون منه وهذا منزل عال كبير القدر العالم به متميز على أبناء جنسه وهو سار في الأشياء فكما أنه سبحانه ذكر أنه فالِقُ الْإِصْباحِ كذلك هو فالِقُ الْحَبِّ والنَّوى‏ بما يظهر منهما فما وقعت الفوائد إلا بمثل هذا النور وكانت الأنبياء عليهم السلام تتخذه وقاية تتقي به حوادث إلا كون التي هي ظلم الأغيار وكما تبين لك قدر هذا النور المولد ومنزلته فلنبين ما يتخذ له وقاية وذلك أن الوقاية لا تكون إلا من أجل الأمور التي يكرهها الإنسان طبعا وشرعا وهي أمور مخصوصة بعالم الخلق والتركيب الطبيعي لا بعالم الأمر وقد بينا في هذا الكتاب وغيره ما نريده بعالم الأمر وعالم الخلق والكل لله تعالى قال عز وجل أَلا لَهُ الْخَلْقُ والْأَمْرُ تَبارَكَ الله رَبُّ الْعالَمِينَ فخصه بالاسم الرب دون غيره ولما كان عالم الخلق والتركيب يقتضي الشر لذاته لهذا قال عالم الأمر الذي هو الخير الذي لا شر فيه حين رأى خلق الإنسان وتركيبه من الطبائع المتنافرة والتنافر هو عين التنازع والنزاع أمر مؤد إلى الفساد قالُوا أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ من غير تعرض لمواقع الأحكام المشروعة وكذلك وقع مثل ما قالوه ورأوا الحق سبحانه يقول والله لا يُحِبُّ الْمُفْسِدِينَ وقال والله لا يُحِبُّ الْفَسادَ فكرهوا ما كره الله وأحبوا ما أحب الله وجرى حكم الله في الخلق بما قدره العزيز العليم فما ظهر من عالم التركيب من الشرور فمن طبيعته التي ذكرتها الملائكة وما ظهر منه من خير فمن روحه الإلهي الذي هو النور المولد فصدقت الملائكة ولذلك قال وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ وإذا كان عالم الخلق بهذه المثابة فواجب على كل عاقل أن يعتصم بهذا النور المذكور في هذا المنزل فالشرور كلها مضافة إلى عالم الخلق والخير كله مضاف إلى عالم الأمر\n\n\n### [أن الطبيعة تألفت لظهور عالم الخلق ليكون مظهرا لذلك النور]\n\n\nواعلم أن الطبيعة لما تألفت واجتمعت لظهور عالم الخلق بعد أن كانت متنافرة ليظهر بذلك شرف هذا النور بما يكون فيه من الخير مع تولده من هذا التركيب لقوته وغلبة عالم الأمر على نشأته دخلت في الوجود الحسي فسميت جسما وحيوانا ونباتا وجمادا وما من شي‏ء من هذا كله إلا والفساد والتغيير موجود فيه في كل حال ولو لا هذا النور الاعتصامي لهلك عالم الخلق جملة واحدة فأمر الله‏\nسبحانه أن يلجأ إليه بالدعاء في دفع هذه المكاره كلها فيؤيد الله هذا الروح بما يعطيه من هذا النور من الاسم الرب ليدفع به ما تقع له به المضرة من جانب ظلمة الطبع‏\n\n\n### [مسمى الشر والخير]\n\n\nواعلم أن مسمى الشر على الحقيقة ومسمى الخير إنما هو راجع إما لوضع إلهي جاءت به ألسن الشرائع وإما لملاءمة مزاج فيكون خيرا في حقه أو منافرة مزاج فيكون شرا في حقه وإما لكمال مقرر اقتضاه الدليل فيكون خيرا أو نقص عن تلك الدرجة فيكون شرا وإما لحصول غرض فيكون خيرا في نظره أو عدم حصوله فيكون شرا في نظره فإذا رفع الناظر نظره عن هذه الأشياء كلها لم تبق إلا أعيان موجودات لا تتصف بالخير ولا بالشر هذا هو المرجوع إليه عند الإنصاف والتحقيق ولكن ما فعل الله سبحانه إلا ما قد حصل في الوجود من كمال ونقص وملاءمة ومنافرة وشرائع موضوعة بتحسين وتقبيح وأغراض موجودة في نفوس تنال وقتا ولا تنال وقتا وما خلا الوجود من هذه المراتب وكلام المتكلم إنما هو بما حصل في الوجود لا بالنظر الآخر المنسوب إلى جانب الحق ثم أصل هذا الأمر كله إنما هو من جانب وجود واجب الوجود لذاته وهو الخير المحض الذي لا شر فيه ومن جانب العدم المطلق الذي في مقابلة الوجود المطلق وهذا العدم هو الشر المحض الذي لا خير فيه فما ظهر من شر في العالم فهذا أصله لأنه عدم الكمال أو عدم الملاءمة أو عدم حصول الغرض فهي نسب وما ظهر من خير فالوجود المطلق فاعله ولذلك قال قُلْ كُلٌّ من عِنْدِ الله وما هو موصوف بأنه عندك فليس هو عينك والإعدام والإيجاد بين إرادته سبحانه وقدرته ولهذا قلنا إن الخير فعل الحق ولم نقل في الشر فعلا وإنما قلنا إن ذلك العدم المطلق أصله فحررنا العبارة عنه ليعرف العاقل الناظر في كتابي هذا ما أردناه وإذ قد تبين هذا الأصل النافع في هذا الباب فلنقل ومما يلجأ إليه في دفع ما يكره من الأفعال ما تتلوه الشياطين على ملك سليمان من علم السحر الذي مزجوه بما أنزل على الملكين هاروت وماروت من علم الحق فعلم الحق من ذلك هو العلم بالأمور التي تسمى معجزات فإن الحق معجز وهو النور الذي يستند إليه وعلم الباطل من ذلك علم الخيال الذي قال فيه يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏ ولهذا سمي السحر سحرا مأخوذ من السحر وهو اختلاط الضوء والظلمة فالسحر له وجه إلى الظلمة وليس ظلاما خالصا وله وجه إلى الضوء وليس ضوءا خالصا كذلك السحر له وجه إلى الحق وهو ما ظهر إلى بصر الناظر فإنه حق وله وجه إلى الباطل لأنه ليس الأمر في نفسه على ما أدركه البصر فلهذا سمته العرب سحرا وسمي العامل به ساحر إلا العالم به ولهذا سمي كيدا من كاد يكيد أي كاد يقارب الحق قال تعالى إِنَّهُمْ يَكِيدُونَ كَيْداً أي يقاربون الحق فيما يظهر لكم وكاد من أفعال المقاربة تقول العرب كاد العروس يكون أميرا أي قارب إن يكون أميرا قال تعالى إِنَّما صَنَعُوا كَيْدُ ساحِرٍ أي فعلوا ما يقارب الحق في الصورة الظاهرة للبصر فإذا لم يكن حقا فَما ذا بَعْدَ الْحَقِّ إِلَّا الضَّلالُ فَأَنَّى تُصْرَفُونَ أي كيف تصرفون عن معرفة هذه الحقائق ومما يتعلق بهذا العلم من الشر مقلوب الحمد ولهذا قال فَلا تَكْفُرْ فإن مقلوب الحمد كفر وهو الذم إذ الحمد هو الثناء على المحمود بما هو عليه من الخلال وبما يكون منه مما تعطيه مكارم الأخلاق والذم في مقابلة ما ذكرناه قال تعالى فَيَتَعَلَّمُونَ مِنْهُما أي من المعلمين ما يُفَرِّقُونَ به بَيْنَ الْمَرْءِ وزَوْجِهِ والله قد كره ذلك وقد ذمه وندب إلى الألفة وانتظام الشمل ولما علم سبحانه أن الافتراق لا بد منه لكل مجموع مؤلف لحقيقة خفيت عن أكثر الناس شرع الطلاق رحمة بعباده ليكونوا مأجورين في أفعالهم محمودين غير مذمومين إرغاما للشياطين ومع هذا\n\n\nفقد ورد في الخبر النبوي أنه صلى الله عليه وسلم قال ما خلق الله حلالا أبغض إليه من الطلاق‏\n\n\nلأنه رجوع إلى العدم إذ كان بائتلاف الطبائع ظهر وجود التركيب وبعدم الائتلاف كان العدم فكانت الأسماء الإلهية معطلة التأثير فمن أجل هذه الرائحة كره الفرقة بين الزوجين فعدم عين الاجتماع أي هذه الحالة ارتفعت بافتراق هذين الزوجين وإن بقيت أعيانهما وإن كان الاجتماع والافتراق والحركة والسكون الحاصل من ذلك راجع إلى نسب معقولة لا أعيان موجودة كما يراه بعضهم وبهذا النور الخاص بهذا المنزل يندفع جميع ما ذكرناه من الشرور وما لم نذكره مما ينطلق عليه اسم شر بالإضافة إلى ما قررناه من الكمال والملاءمة وغير ذلك وهذا القدر من السحر الذي يعطي التفرقة هو الذي يدفعه سبب وجود هذا النور في هذا المنزل خاصة وعند الخروج من هذه السدف والظلم بالإدلاج فيها حتى يطلع لك الصباح وتشرق الأنوار وذلك عالم الآخرة حيث كان حينئذ تحمد مسعاك وما فاتك‏\nبذلك السهر في سيرك من لذة النوم والاضطجاع والسكون فوضعوا لذلك لفظا مطابقا وهو قولهم عند الصباح يحمد القوم السري والصباح عبارة عن هذا النور ومن حصل له هذا النور كان الناس فيه بين غابط وحاسد فالغابط من طلب من الله أن يكون له مثل ما حصل لهذا من هذه الحال من غير إن يسلب ذلك عن صاحبه والحاسد من يطلب زوال هذا الأمر من صاحبه ولا يتعرض في طلبه لنيله جملة واحدة فإن طلب مع طلب إزالته من ذلك نيله فبه يقع الاشتراك بين الغابط والحاسد وما يقع به الاشتراك غير ما يقع به الامتياز فطلب نيل ذلك محمود وهو الغبط وطلب إزالته مذموم وهو الحسد فلذلك فصلنا فيه هذا التفصيل وإن كان الشرع قد أطلق لفظ الحسد في موضع الغبط\n\n\nفقال صلى الله عليه وسلم لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق فهو ينفق منه ويفرقه يمينا وشمالا\n\n\nوفي هذا سر وتنبيه على فضل الكرم والعطاء لغير عوض فإنه من أعطى لعوض فهو شراء ليس بكرم إذ الكريم من لا يطلب المعاوضة فلذا قال يمينا وشمالا ولو عني بالشمال الإنفاق في معصية من زنا أو غيره فليس بكرم لأنه يحصل به عوضا هو أحب إليه من المال فإن قيل إن العوض له لازم فإن الثناء بالكرم لازم لذي الكرم قلنا هذا لا يقع إلا من الجاهل لأن الثناء الحسن من لوازم الكرم سواء طلبه أو لم يطلبه فاشتغاله بطلب الحاصل جهل فإن الحاصل لا يبتغى واللازم للشي‏ء لا بد له منه وإلا فليس بلازم فإن فعل ذلك التحق بأصحاب الأعواض ولم يتصف عند ذلك بالكرم ولا لبسه‏\n\n\nوالرجل الآخر رجل آتاه الله علما فهو يبثه في الناس‏\n\n\nأي يفرقه فيهم الحديث كما قاله عليه السلام فإنا أوردناه من جهة المعنى وبعض ألفاظه صلى الله عليه وسلم فسماه حسدا وقد يسمى الشي‏ء باسم الشي‏ء بما يقاربه أو يكون منه بسبب وبعد أن فصلنا ما أردنا ارتفع الإشكال فيما قصدناه ونحن إنما أردنا ما أراد الله تعالى بقوله ومن شَرِّ حاسِدٍ إِذا حَسَدَ وليس الشر في طلب نيل مثله وإنما الشر في طلب زواله ممن هو عنده ولما قلنا إن عبد الرب له خمس درجات وإنه يزيد على عبد الملك بأربع درجات كان هذا المنزل على خمس درجات والدرجة السادسة التي لهذا المنزل فيها خلاف بين أهل هذا الشأن فمنهم من جعلها درجة مستقلة بنفسها لكنها فاصلة بين مقامين من المقامات الإلهية وليس هو مذهبنا ومنهم من جعلها درجة سادسة في عين هذا المقام وهو مذهبنا وهذه الدرجة تتضمن منزلا واحدا من منازل الغيب بالإجماع من أهل هذا الشأن وقيل ثلاث منازل بخلاف بينهم فأما ابن برجان فانفرد دون الجماعة بإظهار المنزل الثاني في هذه الدرجة من منازل الغيب ولم أعلم ذلك لغيره وله وجه في ذلك ولكن فيه بعد عظيم وإن كنا نحن قد ذهبنا إلى هذا المذهب في بعض كتبنا ولكن ليس في وجوده تلك القوة وإنما يظهر عند صنعة التحليل والكلام على المفردات من علم هذا الطريق وهو مما يتعلق بمعرفة الهوية ولهذه الدرجة تسعة عشر منزلا من منازل الشهادة كل منزل من هذه المنازل يمنع ملكا من التسعة عشر الذين على النار فلا يصيب صاحب هذه الدرجة من النار شي‏ء قال تعالى عَلَيْها تِسْعَةَ عَشَرَ فلوجود هذه المنازل في هذه الدرجة جعلت ملائكة النار تسعة عشر ولا نعكس فنقول من أجل هؤلاء الملائكة جعلت هذه المنازل تسعة عشر فإن الأمر لم يكن كذلك ولم تكن هذه المنازل بحكم الجعل بخلاف الملائكة فإن هذه الدرجة اقتضت هذه المنازل لذاتها وقال في الملائكة وما جَعَلْنا عِدَّتَهُمْ إِلَّا فِتْنَةً فكانوا بحكم الجعل وكانوا في عالم الشهادة لأن النار محسوسة مشهودة وتتضمن هذه الدرجة السادسة من العلوم علم الأسماء الإلهية المتعلقة بالكون ولها صورة في العموم من حيث الإيجاد وفي الخصوص من حيث السعادة\n\n\n### [المنزل عبارة عن المقام الذي ينزل الحق فيه إليك أو تنزل أنت فيه عليه‏]\n\n\nواعلم أنه ما من منزل من هذه المنازل التي في هذا الكتاب إلا وله هذه الدرجة وتختلف آثارها باختلاف المنازل إلا منزلا واحدا من منازل القهر وسيأتي ذكره إن شاء الله وكنا قد ذكرنا في كتاب هياكل الأنوار هذا المنزل وما يختص به وما يعطيه هيكله فلينظر هناك وهو الهيكل الثاني عشر ومائة وهذه العجالة تضيق عن أسرارها في كل منزل من هذه المنازل المودعة فيه أعني في هذا الكتاب وكذلك المنازلات والفرق بين المنزل والمنازلات ما نبينه لك وذلك أن المنزل عبارة عن المقام الذي ينزل الحق فيه إليك أو تنزل أنت فيه عليه ولتعلم الفرق بين إليك وعليه والمنازلة أن يريد هو النزول إليك ويجعل في قلبك طلب النزول عليه فتتحرك الهمة حركة روحانية لطيفة للنزول عليه فيقع الاجتماع به بين نزولين نزول منك عليه قبل إن تبلغ المنزل ونزول منه إليك أي توجه اسم إلهي‏\nقبل أن يبلغ المنزل فوقوع هذا الاجتماع في غير المنزلين يسمى منازلة وهنا يكون لصاحب هذه الحالة أحد ثلاثة أمور إما تحصل الفائدة عند اللقاء المطلوبة لذلك الاسم من هذا العبد ولهذا العبد من ذلك الاسم فينفصل عنه الاسم إلى مسماه ويرجع العبد إلى مقامه الذي منه خرج وإما أن يحكم عليه الاسم الإلهي بالرجوع إلى ما منه خرج ويكون ذلك الاسم الإلهي معه إلى أن يوصله إلى ما منه خرج وإما أن يأخذه الاسم الإلهي معه ويعرج به إلى مسماه وأي الأمرين حصل من هذا الذي ذكرنا فيسمى عندنا هذا المنزل الذي رجعا إليه بهذه الصفة الخاصة منزل المنازلات لأنه يعطي من الأحكام خلاف ما يعطيه إذا لم يكن نزوله عن منازلة يعرف هذا أهل الأذواق وأهل الشرب والري وقد جعلنا في هذا الكتاب من المنازلات ما تقف عليه إن شاء الله‏\n\n\n### [المنزل والموطن‏]\n\n\nواعلم أن المنازل لا ينطلق عليها هذا الاسم إلا عند النزول فيها فإن أقام فيها ولم ينتقل عنها حدث لها اسم الموطن لاستيطانه فيها واسم المسكن لسكونه إليها وعدم انتقاله إلى منزل إلا أنه لا بد له أن ينتقل في نفس هذا المنزل في دقائقه بحيث لا يخرج عنه كمثل الذي يتصرف في بيوت الدار التي هو ساكنها فما دام العارف مستصحبا لاسم واحد إلهي مع اختلاف تصرفه فيه كان موطنا له من حيث الجملة ومن المحال أن يقيم أحد نفسين على حالة واحدة فلا بد له من الانتقال في كل نفس ولهذا منع بعضهم من أهل الله أن يكون الاسم موطنا أو مسكنا لأنه تخيل أن لكل نفس وكل حال اسما إلهيا ولم يدر أن الاسم الإلهي قد يكون له حكم أو يكون له أحكام كثيرة مختلفة فيكون موطنا لهذا الشخص ما دام يتصرف تحت أحكامه فأما قولهم من المحال بقاؤه نفسين على حكم واحد على إن يكون واحد نعتا لحكم فصحيح وأما أن أرادوا استحالة بقائه نفسين على حكم واحد على طريق الإضافة إضافة الحكم إلى الواحد فليس بصحيح فإن الوجوه لهذا الاسم الإلهي فالغفار يستره عن كذا وكذا وكذا وكذا بحسب المطالب التي تطلبه في كل نفس مما يصح أن يستره عنها الاسم الغفار على التتالي والتتابع من غير أن يتخللها ما يطلب اسما آخر ولهذا صحت فيه المبالغة لأنه يكثر منه ذلك وهكذا الخلاق والرزاق وجميع الأسماء التي لها حكم في الكون إذا توالى على الإنسان ما يطلب هذا الاسم ولا بد فالأسماء الإلهية منازل بوجه ومساكن ومواطن بوجه وقد بينا في هذا الباب على طريق الإشارة وضيق الوقت ما تقع به الفائدة لصاحب الذوق وما نودع كل باب مما عندنا فيه إلا نقطة من بحر محيط هذا بالنظر إلى ما عندنا فيه فكيف هو بالنظر إلى ما هو عليه في نفسه هو البحر الذي لا ساحل له وهذا المنزل من منازل الأمر وهذه المنازل الأمرية وإن كانت سبعة في العدد فمن حيث الأمهات وإنما هي أكثر من ذلك ولا بد لنا أن تفرغنا إليها من حصرنا إياه حتى يعلم إلى كم تنتهي من جناب الحق فإن فيها فوائد جمة هي مثبوتة في كتبنا والله سبحانه يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وفي هذا المنزل من العلوم علم إخراج المغيبات بالأسماء الإلهية وعلم الخلق وعلم الغيب الداخل في الشهادة وعلم الشبه وعلم نفث الروح في الروع‏\n\n",
    "en": "## Chapter 271: Concerning the Knowledge of the Station \"At Dawn, the Travelers Praise the Journey,\" which is from the Muhammadan Intimate Discourses, and is also one of the Stations of the Command (منازل الأمر)\n\n> What is the phrase that all creatures utter,\n> At dawn, the travelers praise the journey?\n\n> What do you see in their saying, O you who sees\n> All humanity in the Leader and the posterity?\n\n> He who fabricates against God, knowing what has transpired,\n> Has failed in his reporting.\n\nKnow, may Allah support us and you with a spirit from Him, that this station is the station of the knowledge of the traveler (السري) and its people. It includes the knowledge of the world of Creation (عالم الخلق) and shadows (الظلال). From it, the people of Unveiling (أهل الكشف) know the eclipse of the moon, and that it is from the sudden awe (الخشوع) that befalls the moon due to the Theophany (التجلي). Related to this station is the knowledge of Harut and Marut concerning the science of sorcery (علم السحر) and the science of the rising of Lights (الأنوار).\n\n### [That Lights are of Two Kinds: Original Lights and Lights Generated from the Darkness of the Cosmos]\n\nKnow, may Allah grant you acceptance, that Lights are of two kinds: Original Lights (أنوار أصلية) and Lights generated from the darkness of the Cosmos (الكون). This is like the light in His saying, the Exalted: <<And a sign for them is the night. We withdraw the day from it, and behold, they are in darkness.>> And like His saying, the Mighty and Majestic: <<[He is] the Cleaver of the dawn and has made the night a rest.>> One looks at that, and at: <<And of His signs is that He created for you from yourselves mates that you may find tranquility in them,>> so that there is a birth upon the Light.\n\nThe Light discussed in this station is the generated temporal Light. This station is specific to the single Imam, one of the two Imams belonging to the Axis (القطب), and he is called the Servant of his Lord (عبد ربه). Sometimes this Light is male, and sometimes it is female. When the night covers the day, what is generated from it is the desired Light.\n\nThis generated Light which we have begun discussing is the Light of infallibility (العصمة) for the Prophet and the preservation (الحفظ) for the Saint (الولي). It grants modesty and perfect Unveiling (الكشف التام), for it unveils and is unveiled by. The Original Light (النور الأصلي) unveils but is not unveiled by, because it overwhelms the light of the eyes, thus removing the benefit for which the Light came. For this reason, the souls of the Gnostics (العارفين) concerning the Lights and their Levels (المراتب) resort to this Light generated from darkness, due to the affinity (المناسبة) between us and it, stemming from the creation of our spirits.\n\nFor the partial spirits (الأرواح الجزئية) are generated from the Universal Spirit (الروح الكلي) attributed to The Real (الحق), and the dark natural bodies (الأجسام الطبيعية) after their shaping and their readiness for acceptance. The partial spirit, which is the human spirit, appears between them in the body. The body splits open from it, like the splitting of the dawn from the Cleaver of the dawn in the night. Thus, an affinity occurs between this Light and the human spirit, which is why the human finds comfort in it and benefits from it.\n\nThus has Allah established the custom, and He did not grant more power than this, though had He willed, He would have done so. And thus have the Divine Manifestations (المظاهر الإلهية), expressed as Theophanies (التجليات), proceeded. The Original Light is concealed within them, hidden from us. The forms in which the Theophany occurs are the locus for the manifestation of the Manifested, so our vision falls upon the Manifestations. For this reason, the Manifestations are restricted by the forms, so that our perception is based on a correct affinity. The purpose of this is the attainment of benefit through it and through what proceeds from it.\n\nThis is a lofty station of great worth; the one who knows it is distinguished among his peers, and it permeates all things. Just as He, glory be to Him, mentioned that He is the Cleaver of the dawn, so too is He the Cleaver of the grain and the date-seed, by what manifests from them. Benefits only occur through a Light such as this. The Prophets, peace be upon them, used it as a shield (وقاية) to guard against the accidents of the Cosmos (الكون), which are the darkness of the others (الأغيار).\n\nJust as the worth and station of this generated Light have become clear to you, let us explain what is taken as a shield for it. A shield is only necessary against matters that a human naturally and legally dislikes, and these matters are specific to the world of Creation (عالم الخلق) and natural composition (التركيب الطبيعي), not to the world of Command (عالم الأمر). We have explained in this book and elsewhere what we mean by the world of Command and the world of Creation, and all belongs to Allah, the Exalted. He, the Mighty and Majestic, said: <<Unquestionably, to Him belongs the creation and the command. Blessed is Allah, Lord of the worlds.>> Thus, He specified it with the Name the Lord (الرب) above all others.\n\nSince the world of Creation and composition necessitates evil (الشر) by its very nature, the world of Command, which is the good (الخير) that contains no evil, said—when it saw the creation of man and his composition from conflicting natures, and conflict is the very essence of contention, and contention leads to corruption (الفساد)—: <<Will You place upon it one who causes corruption therein and sheds blood?>> They said: <<Will You place upon it one who causes corruption therein and sheds blood?>> without addressing the loci of the prescribed rulings. And what they said occurred, and they saw The Real (الحق), glory be to Him, saying: <<And Allah does not love the corrupters,>> and He said: <<And Allah does not love corruption.>> So they disliked what Allah disliked and loved what Allah loved.\n\nAnd the decree of Allah proceeded in Creation according to what the Almighty, the All-Knowing, ordained. Whatever evils manifest from the world of composition are due to its nature, which the angels mentioned, and whatever good manifests from it is due to its Divine Spirit, which is the generated Light. Thus, the angels spoke the truth. And for that reason, He said: <<And whatever evil befalls you is from yourself.>> If the world of Creation is of this nature, then it is incumbent upon every rational person to seek refuge in this Light mentioned in this station. For all evils are attributed to the world of Creation, and all good is attributed to the world of Command.\n\n### [That Nature was Harmonized for the Manifestation of the World of Creation, so that it might be a Locus of Manifestation for that Light]\n\nKnow that when Nature (الطبيعة) was harmonized and gathered for the manifestation of the world of Creation, after having been conflicting—so that the nobility of this Light might be revealed through the good contained within it, despite its generation from this composition, due to its strength and the dominance of the world of Command over its origination—it entered into sensible Existence (الوجود الحسي) and was named body, animal, plant, and inanimate object. There is nothing of all this in which corruption and change are not present at all times. Were it not for this Light of refuge (النور الاعتصامي), the world of Creation would perish entirely. So Allah, glory be to Him, commanded that refuge be sought in Him through supplication (الدعاء) to repel all these detested things. Thus, Allah supports this spirit with what He grants it of this Light from the Name the Lord (الرب), so that it may repel the harm that befalls it from the side of the darkness of nature (ظلمة الطبع).\n\n### [The Denotation of Evil and Good]\n\nKnow that the true denotation of evil and the denotation of good refer either to a Divine ordinance brought by the tongues of the revealed laws (الشرائع); or to the suitability of a temperament, in which case it is good for that person, or the incompatibility of a temperament, in which case it is evil for that person; or to an established perfection necessitated by the proof, in which case it is good, or a deficiency from that degree, in which case it is evil; or to the attainment of a purpose, in which case it is good in his view, or the failure to attain it, in which case it is evil in his view.\n\nIf the observer lifts his gaze from all these things, nothing remains but existing entities (أعيان موجودات) that are not described as either good or evil. This is the point of reference when fairness and verification are applied. However, Allah, glory be to Him, only acted upon what has occurred in Existence (الوجود): perfection and deficiency, suitability and incompatibility, revealed laws established with commendation and condemnation, and purposes existing in souls that are attained at one time and not attained at another. Existence is not devoid of these Levels (المراتب), and the speech of the speaker is only concerning what has occurred in Existence, not concerning the other perspective attributed to the side of The Real (الحق).\n\nFurthermore, the origin of this entire matter is from the side of the Existence (وجود) of the Necessary Being by His Essence (واجب الوجود لذاته), who is Pure Goodness (الخير المحض) in which there is no evil. And from the side of Absolute Non-existence (العدم المطلق), which is opposite Absolute Existence (الوجود المطلق). This Non-existence is Pure Evil (الشر المحض) in which there is no good. Whatever evil appears in the World (العالم), this is its origin, because it is the non-existence of perfection, or the non-existence of suitability, or the non-attainment of purpose; thus, they are relations (نسب). And whatever good appears, Absolute Existence is its agent. For that reason, He said: <<Say, 'All is from Allah.'>> And what is described as being 'from you' is not your Essence (عينك). Non-existence (الإعدام) and bringing into existence (الإيجاد) are between His Will, glory be to Him, and His Power.\n\nFor this reason, we said that good is the Act (فعل) of The Real, and we did not say that evil is an act. Rather, we said that Absolute Non-existence is its origin. Thus, we have clarified the expression concerning it, so that the rational person looking into this book of mine may know what we intended.\n\nSince this beneficial principle has been clarified in this chapter, let us say: Among the things resorted to for repelling disliked actions is what the devils recited over the kingdom of Solomon concerning the science of sorcery (علم السحر), which they mixed with what was revealed to the two angels, Harut and Marut, concerning the knowledge of The Real (علم الحق). The knowledge of The Real from that is the knowledge of matters called miracles (معجزات), for The Real is the Miraculous, and He is the Light upon which reliance is placed. And the knowledge of falsehood from that is the science of Imagination (الخيال), concerning which He said: <<It seemed to him from their magic that they were running.>>\n\nFor this reason, sorcery (السحر) was named *sihr*, derived from *sahar*, which is the mixing of light and darkness. Sorcery has a face toward darkness, but is not pure darkness, and it has a face toward light, but is not pure light. Likewise, sorcery has a face toward The Real, which is what appeared to the eye of the observer, for that appearance is real; and it has a face toward falsehood, because the matter in itself is not as the eye perceived it. For this reason, the Arabs named it *sihr*, and the one who practices it is called a sorcerer, except for the one who knows its reality.\n\nFor this reason, it is called *kayd* (cunning/plot), from *kāda yakīdu*, meaning 'it almost approaches The Real.' The Exalted said: <<Indeed, they are planning a plot [kayd],>> meaning they almost approach The Real in what appears to you. And *kāda* is one of the verbs of approximation. The Arabs say: *kāda al-arus yakūnu amīran* (The groom almost became a prince), meaning he approached being a prince. The Exalted said: <<What they have produced is only the plot [kayd] of a sorcerer,>> meaning they performed what approximates The Real in the form apparent to the eye. If it is not The Real, then <<What is there after the truth except error? So how are you averted?>> meaning, how are you turned away from the knowledge of these Realities (حقائق)?\n\nAmong the evils related to this knowledge is the inversion of praise (*al-hamd*). For this reason, He said: <<So do not disbelieve,>> for the inversion of praise is disbelief (*kufr*), which is blame (*al-dhamm*). Praise is the commendation of the Praised One for the qualities He possesses and for what proceeds from Him that noble character dictates, while blame is the opposite of what we mentioned.\n\nThe Exalted said: <<And they learn from them [the two teachers] that by which they cause separation between a man and his wife.>> Allah has disliked that, condemned it, and encouraged harmony and the ordering of the whole. Since He, glory be to Him, knew that separation is inevitable for every composite whole, due to a reality hidden from most people, He legislated divorce (الطلاق) as a mercy to His servants, so that they might be rewarded for their actions, praised, not blamed, and to spite the devils. Nevertheless, it is reported in the Prophetic narration that he, peace and blessings be upon him, said: \"Allah has not created anything lawful more hateful to Him than divorce.\"\n\nThis is because it is a return to Non-existence (العدم), since the Existence of composition appeared through the harmony of natures, and Non-existence occurred through the lack of harmony, rendering the Divine Names (الأسماء الإلهية) inactive in their effect. Because of this scent [of Non-existence], separation between spouses was disliked. The Essence (عين) of the union—that is, this state—was lifted by the separation of these two spouses, even if their Fixed Entities (أعيانهما) remained. Even though the union, separation, movement, and stillness resulting from that refer back to intelligible relations (نسب معقولة), not existing entities, as some see it.\n\nBy means of this Light specific to this station, all the evils we mentioned, and those we did not mention that fall under the name of evil in relation to the perfection, suitability, and other concepts we established, are repelled. This measure of sorcery that causes separation is what the cause of the existence of this Light specifically repels in this station.\n\nAnd upon exiting these veils and darknesses by traveling through them until the dawn breaks for you and the Lights shine—that is the World of the Hereafter (عالم الآخرة)—it is then that you praise your endeavor and what you missed of the pleasure of sleep, lying down, and stillness during that wakefulness in your journey. Thus, they coined a corresponding phrase for that, which is their saying: \"At dawn, the travelers praise the journey.\" And the dawn (الصباح) is an expression for this Light.\n\nWhoever attains this Light, people regarding him are divided between the envier (غابط) and the jealous one (حاسد). The envier is one who asks Allah to grant him the like of what this person has attained of this state, without wishing to strip it from its possessor. The jealous one is one who seeks the removal of this matter from its possessor and does not seek to attain it himself at all. If he seeks to attain it along with seeking its removal, then the envier and the jealous one share that aspect. What causes the sharing is different from what causes the distinction. The seeking of attainment is praiseworthy, and that is envy (*ghibta*), while the seeking of its removal is blameworthy, and that is jealousy (*hasad*). Therefore, we made this distinction, even though the Law (الشرع) sometimes uses the term *hasad* (jealousy) in the place of *ghibta* (envy).\n\nHe, peace and blessings be upon him, said: \"There is no jealousy [hasad] except in two cases: a man whom Allah has given wealth and enabled him to spend it in truth, so he spends and distributes it right and left.\" In this is a secret and an indication of the virtue of generosity and giving without compensation. For whoever gives for compensation, that is a purchase, not generosity, since the generous person is one who does not seek recompense. That is why he said \"right and left.\" If \"left\" meant spending in disobedience, such as fornication or otherwise, it would not be generosity, because he obtains a compensation that is dearer to him than the money. If it is said that compensation is necessary for him, since praise for generosity is necessary for the generous person, we say: This only occurs from the ignorant, because good praise is a necessary consequence of generosity, whether he seeks it or not. To busy oneself seeking what is already obtained is ignorance. For what is obtained is not sought, and what is necessary for a thing must occur, otherwise it is not necessary. If he does that, he joins the ranks of those who seek compensation and is not described as generous nor does he wear its mantle.\n\n\"And the other man is a man whom Allah has given knowledge, and he spreads it among the people.\" Meaning, he distributes it among them—the Hadith as he, peace be upon him, said it, for we have cited it according to its meaning and some of his, peace be upon him, wording—and he called it *hasad*. Sometimes a thing is named after another thing that approximates it or is related to it by cause. Now that we have detailed what we intended, the ambiguity regarding our purpose is removed. We only intended what Allah, the Exalted, intended by His saying: <<And from the evil of an envier [hasid] when he envies.>> The evil is not in seeking to attain the like of it, but rather the evil is in seeking its removal from the one who possesses it.\n\nSince we said that the Servant of the Lord (عبد الرب) has five degrees, and that he exceeds the Servant of the King (عبد الملك) by four degrees, this station has five degrees. Regarding the sixth degree belonging to this station, there is disagreement among the people of this discipline (أهل هذا الشأن). Some of them made it an independent degree, but one that separates two Divine Stations (مقامات إلهية), and this is not our doctrine. Others made it a sixth degree within the very essence of this Station (مقام), and this is our doctrine.\n\nThis degree includes one station from the Stations of the Unseen (منازل الغيب) by the consensus of the people of this discipline. And it is said to be three stations, due to a difference of opinion among them. As for Ibn Barrajān, he was unique among the group in manifesting the second station within this degree from the Stations of the Unseen, and I do not know of anyone else who did so. He has a justification for this, but it is greatly distant [from the common view]. Although we ourselves have adopted this doctrine in some of our books, its existence does not possess that strength. It only appears during the process of analysis and discussion of the particulars of the knowledge of this Path, and it relates to the knowledge of the Ipseity (الهوية).\n\nThis degree has nineteen stations from the Stations of the Witnessed (منازل الشهادة). Each of these stations prevents one of the nineteen angels who are over the Fire, so nothing of the Fire touches the possessor of this degree. The Exalted said: <<Over it are nineteen.>> Due to the existence of these stations in this degree, the angels of the Fire were made nineteen. We do not reverse this and say that these stations were made nineteen because of those angels, for the matter was not so. These stations were not by the ruling of appointment (الجعل), unlike the angels, for this degree necessitated these stations by its Essence (لذاتها). And concerning the angels, He said: <<And We have not made their number except as a trial.>> Thus, they were by the ruling of appointment, and they were in the world of the Witnessed (عالم الشهادة) because the Fire is sensible and witnessed. This sixth degree includes the knowledge of the Divine Names (الأسماء الإلهية) related to the Cosmos (الكون), and it has a form in generality regarding bringing into existence (الإيجاد) and in particularity regarding felicity (السعادة).\n\n### [The Station is an Expression for the Spiritual State in which The Real Descends to You or in which You Descend Upon Him]\n\nKnow that there is no station among these stations in this book that does not possess this degree, though their effects differ according to the difference of the stations, except for one station from the Stations of Compulsion (منازل القهر), which will be mentioned, God willing. We had mentioned this station in the book *Hayākil al-Anwār* (Temples of Lights), along with what is specific to it and what its temple grants. Let it be consulted there; it is the 112th Temple. This brief work is too constrained for the secrets of every station deposited within it—I mean, in this book.\n\nLikewise, the Spiritual Encounters (المنازلات). The difference between the Station (المنزل) and the Spiritual Encounters is what we shall clarify for you. The Station is an expression for the Spiritual State (المقام) in which The Real descends to you, or in which you descend upon Him. Note the difference between \"to you\" and \"upon Him.\" The Spiritual Encounter (المنازلة) is when He intends to descend to you and places in your heart the desire to descend upon Him. The spiritual aspiration (الهمة) moves with a subtle spiritual movement to descend upon Him, and the meeting with Him occurs between two descents: a descent from you upon Him before you reach the Station, and a descent from Him to you—that is, the turning of a Divine Name (اسم إلهي)—before it reaches the Station. The occurrence of this meeting outside the two Stations is called a Spiritual Encounter.\n\nHere, the possessor of this state experiences one of three things: Either the benefit sought by that Name from this servant, and by this servant from that Name, is attained upon the meeting, and the Name separates from him to its Denoted Reality (مسماه), and the servant returns to the state from which he departed. Or the Divine Name decrees that he return to the place from which he departed, and that Divine Name remains with him until it delivers him to the place from which he departed. Or the Divine Name takes him along with it and ascends with him to its Denoted Reality. Whichever of the two matters occurs, this station to which they returned is called, in our terminology, the Station of Spiritual Encounters (منزل المنازلات) with this specific description, because it yields rulings different from those it yields when the descent is not preceded by an Encounter. This is known by the people of spiritual taste (أهل الأذواق) and the people of drinking and quenching (أهل الشرب والري). We have included in this book some Spiritual Encounters that you will come across, God willing.\n\n### [The Station and the Dwelling]\n\nKnow that the stations (المنازل) are not referred to by this name except when one descends into them. If one resides in it and does not move away from it, it acquires the name Dwelling (الموطن) due to settling there, and the name Abode (المسكن) due to finding tranquility in it and not moving to another station. However, he must necessarily move within the subtleties of this very station without leaving it, like one who moves around in the rooms of the house he inhabits. As long as the Gnostic (العارف) maintains companionship with a single Divine Name (اسم واحد إلهي), despite the variation in his activity within it, it is a Dwelling for him in general terms.\n\nIt is impossible for anyone to remain in one state for two breaths (نفسين), so he must necessarily move in every breath. For this reason, some of the people of Allah forbade calling the Name a Dwelling or Abode, because they imagined that every breath and every state has a Divine Name, and they did not realize that a Divine Name may have one ruling or many different rulings, and thus it becomes a Dwelling for that person as long as he acts under its rulings. As for their saying that it is impossible for him to remain for two breaths under one ruling, if 'one' is an adjective for the ruling, then it is correct. But if they meant the impossibility of remaining for two breaths under one ruling by way of attribution—attributing the ruling to the One—then it is not correct.\n\nFor the Divine Name has aspects. The Forgiving One (الغفار) covers him from such-and-such, and such-and-such, according to the demands that seek Him in every breath, which the Name the Forgiving One can rightly cover him from, continuously and successively, without anything intervening that requires another Name. For this reason, the intensive form (المبالغة) is valid for it, because that action is frequent from Him. Likewise, the Creator (الخلاق), the Provider (الرزاق), and all the Names that have a ruling in the Cosmos (الكون), when what requires that Name necessarily follows upon the human.\n\nThus, the Divine Names are stations in one respect, and abodes and dwellings in another respect. We have explained in this chapter, by way of allusion and due to the constraint of time, what will benefit the person of spiritual taste (صاحب الذوق). We deposit in every chapter only a drop from an encompassing ocean of what we possess concerning it. This is when viewed in relation to what we possess; how then is it when viewed in relation to what it is in itself? It is the shoreless ocean.\n\nThis station is one of the Stations of the Command (منازل الأمر). Although these Stations of the Command are seven in number in terms of their mothers (الأمهات), they are actually more than that. We must, when we dedicate ourselves to them, enumerate them so that it may be known how many they ultimately reach from the side of The Real (جناب الحق), for they contain immense benefits that are recorded in our books. And Allah, glory be to Him, <<says the truth, and He guides to the way.>> Among the sciences contained in this station are the science of bringing forth hidden things (المغيبات) by means of the Divine Names, the science of Creation, the science of the Unseen (الغيب) entering the Witnessed (الشهادة), the science of similitudes (الشبه), and the science of the blowing of the Spirit into the heart (الروع).",
    "ur": "باب دو سو اکہتر: اس منزل کی معرفت میں جہاں صبح کے وقت شب کا سفر کرنے والے (السري) کی تعریف کی جاتی ہے، جو مناجات محمدیہ میں سے ہے اور یہ بھی منازل امر (منازل الأمر) میں سے ہے۔\n\nوہ کون سا لفظ ہے جو تمام مخلوق کہتی ہے،\nجب صبح ہوتی ہے تو قوم شب کے سفر کرنے والے (السري) کی تعریف کرتی ہے۔\nاے وہ جو تمام مخلوقات کو امام اور پیچھے والوں میں دیکھتا ہے،\nتو ان کے اس قول میں کیا دیکھتا ہے؟\nوہ شخص اپنی خبر دینے میں ناکام رہا جس نے اللہ پر جھوٹ باندھا،\nحالانکہ وہ جانتا تھا کہ کیا ہوا ہے۔\n\nجان لو، اللہ تعالیٰ اپنی روح سے ہماری اور تمہاری تائید فرمائے، کہ یہ منزل شب کے سفر (السري) اور اس کے اہل کے علم کی منزل ہے۔ یہ عالم خلق (عالم الخلق) اور سایوں کی معرفت پر مشتمل ہے۔ اسی سے اہل کشف (أهل الکشف) چاند گرہن کو پہچانتے ہیں، اور یہ کہ یہ چاند پر ظہور الٰہی (التجلی) سے طاری ہونے والے خشوع میں سے ہے۔ اس منزل سے ہاروت اور ماروت کا علم سحر اور انوار کے طلوع کا علم متعلق ہے۔\n\n### [انوار دو قسم کے ہیں: نور اصلی اور وہ انوار جو کائنات کی تاریکی سے پیدا ہوتے ہیں]\n\nجان لو، اللہ تمہیں قبولیت کی توفیق دے، کہ انوار دو قسم کے ہیں: نور اصلی (أنوار أصلية) اور وہ انوار جو کائنات کی تاریکی سے پیدا ہوتے ہیں (أنوار متولدة)، جیسے اللہ تعالیٰ کا یہ فرمان: **\"اور ان کے لیے ایک نشانی رات ہے، ہم اس سے دن کو کھینچ نکالتے ہیں، تو وہ اچانک اندھیرے میں رہ جاتے ہیں۔\" (یس: ۳۷)** اور جیسے اس کا فرمان ہے: **\"صبح کو پھاڑنے والا ہے اور اس نے رات کو سکون بنایا۔\" (انعام: ۹۶)** اس پر غور کیا جائے، اور **\"اور اس کی نشانیوں میں سے یہ ہے کہ اس نے تمہارے لیے تمہاری ہی جنس سے بیویاں پیدا کیں تاکہ تم ان سے سکون حاصل کرو۔\" (روم: ۲۱)** تاکہ نور پر اس کی ولادت ہو۔ اور جس نور پر اس منزل میں بات کی جا رہی ہے وہ زمانی نور مولد (پیدا شدہ نور) ہے۔ یہ منزل قطب کے دو اماموں میں سے ایک امام کے لیے مخصوص ہے، جسے عبد ربہ کہا جاتا ہے۔ کبھی یہ نور مذکر ہوتا ہے اور کبھی مؤنث۔ جب رات دن کو ڈھانپ لیتی ہے تو اس سے پیدا ہونے والا نور ہی مطلوب ہوتا ہے۔ اور یہ نور مولد جس کا ہم نے آغاز کیا ہے، وہ نبی کے لیے نور عصمت اور ولی کے لیے نور حفظ ہے۔ یہ حیا اور کشف تام (الکشف التام) عطا کرتا ہے، کیونکہ یہ خود بھی کشف کرتا ہے اور اس کے ذریعے بھی کشف کیا جاتا ہے۔ جبکہ نور اصلی (النور الأصلي) کشف کرتا ہے لیکن اس کے ذریعے کشف نہیں کیا جاتا، کیونکہ وہ آنکھوں کے نور پر غالب آ جاتا ہے، اور وہ فائدہ زائل ہو جاتا ہے جس کے لیے نور آیا تھا۔ اسی لیے انوار اور ان کے مراتب کو جاننے والے عارفین کی روحیں اس نور مولد کی طرف پناہ لیتی ہیں جو تاریکی سے پیدا ہوا ہے، اس مناسبت کی وجہ سے جو ہمارے اور اس کے درمیان ہماری روحوں کی تخلیق سے ہے۔ کیونکہ جزوی روحیں اس روح کلی سے پیدا ہوئی ہیں جو ذات حق (الحق) کی طرف منسوب ہے، اور تاریک طبعی اجسام کی تسویہ اور قبولیت کے لیے ان کی استعداد حاصل ہونے کے بعد، ان دونوں کے درمیان جسم میں جزوی روح ظاہر ہوتی ہے جو انسان کی روح ہے۔ جسم اس سے یوں پھٹتا ہے جیسے رات میں فالق الاصباح (صبح کو پھاڑنے والے) سے صبح پھٹتی ہے۔ پس اس نور اور انسان کی روح کے درمیان مناسبت پیدا ہو جاتی ہے، اسی لیے انسان اس سے مانوس ہوتا ہے اور فائدہ حاصل کرتا ہے۔ اللہ تعالیٰ نے اسی طرح عادت جاری کی ہے اور اس سے زیادہ قوت نہیں دی، اگر وہ چاہتا تو کر سکتا تھا۔ اور اسی طرح مظاہر الٰہیہ جاری ہوئے جنہیں ظہور الٰہی (التجلیات) سے تعبیر کیا جاتا ہے۔ ان میں نور اصلی ہمارے لیے غیب کے طور پر پوشیدہ ہوتا ہے، اور وہ صورتیں جن میں ظہور الٰہی (التجلی) واقع ہوتا ہے، وہ مظہر کے ظاہر ہونے کا مقام ہوتی ہیں۔ پس ہماری رؤیت مظاہر پر واقع ہوتی ہے۔ اسی لیے یہ مظاہر صورتوں کے ساتھ مقید ہیں تاکہ ہمارا ادراک صحیح مناسبت کے ساتھ ہو، کیونکہ اس کا مقصد اس سے اور جو کچھ اس سے ہوتا ہے، فائدہ کا حصول ہے۔ اور یہ ایک بلند اور عظیم قدر والی منزل ہے، اس کا عالم اپنے ہم جنسوں پر ممتاز ہوتا ہے، اور یہ چیزوں میں سرایت کیے ہوئے ہے۔ جس طرح اس نے خود فرمایا کہ وہ **فَالِقُ الْإِصْبَاحِ (صبح کو پھاڑنے والا)** ہے، اسی طرح وہ **فَالِقُ الْحَبِّ وَالنَّوَىٰ (دانے اور گٹھلی کو پھاڑنے والا)** بھی ہے، ان دونوں سے جو کچھ ظاہر ہوتا ہے۔ پس فوائد اسی نور کے ذریعے حاصل ہوئیں۔ اور انبیاء علیہم السلام اسے ڈھال بناتے تھے، جس سے وہ کونی حادثات سے بچتے تھے جو اغیار کا ظلم ہیں۔ اور جس طرح تمہارے لیے اس نور مولد کی قدر اور اس کی منزل واضح ہو گئی ہے، تو اب ہم بیان کرتے ہیں کہ اس کے لیے کیا ڈھال بنائی جاتی ہے۔ اور وہ یہ ہے کہ ڈھال صرف ان امور کے لیے ہوتی ہے جنہیں انسان طبعاً اور شرعاً ناپسند کرتا ہے، اور یہ امور عالم خلق (عالم الخلق) اور طبعی ترکیب کے ساتھ مخصوص ہیں، نہ کہ عالم امر (عالم الأمر) کے ساتھ۔ ہم نے اس کتاب میں اور دیگر کتب میں بیان کیا ہے کہ عالم امر اور عالم خلق سے ہماری کیا مراد ہے۔ اور سب کچھ اللہ تعالیٰ کے لیے ہے۔ اس نے فرمایا: **\"خبردار! اسی کے لیے خلق (پیدا کرنا) اور امر (حکم دینا) ہے۔ اللہ، تمام جہانوں کا رب، بڑی برکت والا ہے۔\" (اعراف: ۵۴)** پس اس نے اسے رب کے نام کے ساتھ خاص کیا، نہ کہ کسی اور کے ساتھ۔ اور چونکہ عالم خلق اور ترکیب اپنی ذات میں شر کا تقاضا کرتے ہیں، اسی لیے عالم امر، جو کہ وہ خیر ہے جس میں کوئی شر نہیں، نے جب انسان کی تخلیق اور متنافر طبائع سے اس کی ترکیب کو دیکھا، اور تنافر ہی نزاع کا عین ہے اور نزاع فساد کی طرف لے جانے والا امر ہے، تو انہوں نے کہا: **\"کیا تو اس میں ایسے کو پیدا کرے گا جو اس میں فساد پھیلائے گا اور خون بہائے گا؟\" (بقرہ: ۳۰)** بغیر اس کے کہ وہ شرعی احکام کے مواقع کا ذکر کریں۔ اور ایسا ہی ہوا جیسا انہوں نے کہا تھا، اور انہوں نے دیکھا کہ ذات حق (الحق) فرماتی ہے: **\"اور اللہ فساد پھیلانے والوں کو پسند نہیں کرتا۔\" (مائدہ: ۶۴)** اور فرمایا: **\"اور اللہ فساد کو پسند نہیں کرتا۔\" (بقرہ: ۲۰۵)** پس انہوں نے اسے ناپسند کیا جسے اللہ نے ناپسند کیا، اور اسے پسند کیا جسے اللہ نے پسند کیا۔ اور اللہ کا حکم مخلوق میں اسی طرح جاری ہوا جیسا کہ عزیز و علیم نے مقدر کیا تھا۔ پس ترکیب کے عالم سے جو شرور ظاہر ہوئے وہ اس کی طبیعت کی وجہ سے ہیں جس کا ذکر فرشتوں نے کیا تھا، اور جو خیر اس سے ظاہر ہوا وہ اس کی روح الٰہی کی وجہ سے ہے جو نور مولد ہے۔ پس فرشتے سچے تھے۔ اسی لیے فرمایا: **\"اور جو برائی تمہیں پہنچتی ہے، وہ تمہاری اپنی جان کی طرف سے ہے۔\" (نساء: ۷۹)** اور اگر عالم خلق اس مقام پر ہے، تو ہر عقل مند پر واجب ہے کہ وہ اس نور سے پناہ پکڑے جس کا ذکر اس منزل میں کیا گیا ہے، کیونکہ تمام شرور عالم خلق کی طرف منسوب ہیں اور تمام خیر عالم امر کی طرف منسوب ہے۔\n\n### [طبیعت کا عالم خلق کے ظہور کے لیے جمع ہونا تاکہ وہ اس نور کا مظہر بن سکے]\n\nجان لو کہ جب طبیعت عالم خلق (عالم الخلق) کے ظہور کے لیے جمع ہوئی اور متحد ہوئی، اس کے بعد کہ وہ متنافر تھی، تاکہ اس نور کی شرافت ظاہر ہو، اس خیر کے ذریعے جو اس میں ہوتا ہے، باوجود اس کے کہ وہ اس ترکیب سے پیدا ہوا ہے، اس کی قوت اور عالم امر (عالم الأمر) کے اس کی نشوونما پر غلبے کی وجہ سے، تو وہ حسی وجود میں داخل ہوئی اور جسم، حیوان، نبات اور جماد کہلائی۔ اور ان سب میں کوئی چیز ایسی نہیں جس میں ہر حال میں فساد اور تبدیلی موجود نہ ہو۔ اور اگر یہ نور اعتصامی (پناہ دینے والا نور) نہ ہوتا تو عالم خلق یکمشت ہلاک ہو جاتا۔ پس اللہ سبحانہ نے حکم دیا کہ ان تمام ناپسندیدہ چیزوں کو دور کرنے کے لیے دعا کے ذریعے اس کی پناہ لی جائے، تو اللہ اس روح کی تائید کرتا ہے اس نور کے ذریعے جو اسے اسم رب سے عطا ہوتا ہے، تاکہ وہ اس کے ذریعے اس نقصان کو دور کر سکے جو اسے طبع کی تاریکی کی طرف سے پہنچتا ہے۔\n\n### [شر اور خیر کا مفہوم]\n\nجان لو کہ شر کا حقیقی مفہوم اور خیر کا مفہوم یا تو کسی الٰہی وضع کی طرف لوٹتا ہے جسے شریعتوں کی زبانیں لائی ہیں، یا مزاج کی موافقت کی طرف، تو اس کے حق میں خیر ہوتا ہے، یا مزاج کی منافرت کی طرف، تو اس کے حق میں شر ہوتا ہے۔ یا کسی مقررہ کمال کی طرف جس کا تقاضا دلیل نے کیا ہو، تو وہ خیر ہوتا ہے، یا اس درجے سے کمی کی طرف، تو وہ شر ہوتا ہے۔ یا کسی غرض کے حصول کی طرف، تو اس کی نظر میں خیر ہوتا ہے، یا اس کے عدم حصول کی طرف، تو اس کی نظر میں شر ہوتا ہے۔ پس جب دیکھنے والا ان تمام چیزوں سے اپنی نظر ہٹا لیتا ہے تو صرف موجودات کے اعیان باقی رہ جاتے ہیں جو نہ خیر سے متصف ہوتے ہیں اور نہ شر سے۔ انصاف اور تحقیق کے وقت یہی وہ مرجع ہے جس کی طرف رجوع کیا جاتا ہے۔ لیکن اللہ سبحانہ نے وہی کیا جو وجود میں حاصل ہوا ہے، کمال اور نقص، موافقت اور منافرت، اور شریعتیں جو تحسین اور تقبیح کے ساتھ وضع کی گئی ہیں، اور وہ اغراض جو نفوس میں موجود ہیں جو کبھی حاصل ہوتی ہیں اور کبھی حاصل نہیں ہوتیں۔ اور وجود ان مراتب سے خالی نہیں ہے۔ اور متکلم کا کلام صرف اس چیز کے بارے میں ہوتا ہے جو وجود میں حاصل ہوئی ہے، نہ کہ اس دوسرے نقطہ نظر کے بارے میں جو ذات حق (الحق) کی طرف منسوب ہے۔ پھر اس سارے معاملے کی اصل واجب الوجود لذاتہ کی ہستی (الوجود) کی طرف سے ہے، اور وہ خیر محض ہے جس میں کوئی شر نہیں، اور وجود مطلق کے مقابلے میں عدم مطلق کی طرف سے ہے، اور یہ عدم ہی شر محض ہے جس میں کوئی خیر نہیں۔ پس عالم میں جو شر ظاہر ہوا، اس کی اصل یہی ہے، کیونکہ وہ کمال کا عدم ہے، یا موافقت کا عدم ہے، یا غرض کے حصول کا عدم ہے، پس یہ سب نسبتیں ہیں۔ اور جو خیر ظاہر ہوا، تو وجود مطلق (الوجود المطلق) اس کا فاعل ہے۔ اسی لیے فرمایا: **\"کہہ دو: سب کچھ اللہ کی طرف سے ہے۔\" (نساء: ۷۸)** اور جو تمہارے پاس ہونے سے موصوف ہے، وہ تمہارا عین نہیں ہے۔ اور اعدام (معدوم کرنا) اور ایجاد (پیدا کرنا) اس کی ارادے اور قدرت کے درمیان ہیں۔ اسی لیے ہم نے کہا کہ خیر ذات حق (الحق) کا فعل ہے، اور ہم نے شر کو فعل نہیں کہا، بلکہ ہم نے کہا کہ وہ عدم مطلق اس کی اصل ہے۔ پس ہم نے اس کی عبارت کو واضح کر دیا تاکہ میری اس کتاب کو دیکھنے والا عقل مند جان لے کہ ہماری مراد کیا ہے۔ اور جب یہ نفع بخش اصل اس باب میں واضح ہو گئی ہے، تو ہم کہتے ہیں: اور جن افعال کو ناپسند کیا جاتا ہے، ان کو دور کرنے کے لیے جن چیزوں کی پناہ لی جاتی ہے، ان میں وہ علم سحر بھی شامل ہے جو شیاطین سلیمان کے ملک پر پڑھتے تھے، جسے انہوں نے اس علم حق کے ساتھ ملا دیا جو دو فرشتوں ہاروت اور ماروت پر نازل کیا گیا تھا۔ پس اس میں سے علم حق وہ علم ہے جو ان امور کے بارے میں ہے جنہیں معجزات کہا جاتا ہے، کیونکہ ذات حق (الحق) معجزہ ہے، اور وہ نور ہے جس پر بھروسہ کیا جاتا ہے۔ اور اس میں سے علم باطل وہ علم خیال ہے جس کے بارے میں فرمایا: **\"ان کے جادو کے زور سے اسے خیال ہوتا تھا کہ وہ دوڑ رہے ہیں۔\" (طٰہٰ: ۶۶)** اسی لیے سحر کو سحر کہا گیا، جو سحر (صبح کے وقت) سے ماخوذ ہے، اور وہ روشنی اور تاریکی کا اختلاط ہے۔ پس سحر کا ایک رخ تاریکی کی طرف ہے، لیکن وہ خالص تاریکی نہیں ہے، اور اس کا ایک رخ روشنی کی طرف ہے، لیکن وہ خالص روشنی نہیں ہے۔ اسی طرح سحر کا ایک رخ حق کی طرف ہے، اور وہ وہ ہے جو دیکھنے والے کی آنکھ کو ظاہر ہوتا ہے، کیونکہ وہ حق ہے۔ اور اس کا ایک رخ باطل کی طرف ہے، کیونکہ معاملہ اپنی ذات میں ویسا نہیں ہے جیسا آنکھ نے ادراک کیا۔ اسی لیے عرب نے اسے سحر کہا، اور اس کا عامل ساحر کہلایا، سوائے اس کے عالم کے۔ اور اسی لیے اسے کید (سازش) کہا گیا، جو کاد یکید سے ہے، یعنی حق کے قریب ہوا۔ اللہ تعالیٰ نے فرمایا: **\"بے شک وہ ایک چال چل رہے ہیں۔\" (طارق: ۱۵)** یعنی جو کچھ تمہیں ظاہر ہوتا ہے، اس میں وہ حق کے قریب ہوتے ہیں۔ اور کاد افعال مقاربہ (قریب ہونے والے افعال) میں سے ہے۔ عرب کہتے ہیں: کاد العروس یکون امیراً (دلہا امیر ہونے کے قریب تھا)، یعنی امیر ہونے کے قریب ہوا۔ اللہ تعالیٰ نے فرمایا: **\"جو کچھ انہوں نے بنایا ہے، وہ تو جادوگر کی چال ہے۔\" (طٰہٰ: ۶۹)** یعنی انہوں نے وہ کام کیا جو آنکھ کو ظاہر ہونے والی صورت میں حق کے قریب ہے۔ پس جب وہ حق نہیں ہے، تو **\"حق کے بعد گمراہی کے سوا کیا ہے؟ پس تم کہاں پھیرے جا رہے ہو؟\" (یونس: ۳۲)** یعنی تم ان حقائق کی معرفت سے کیسے پھیرے جا رہے ہو؟ اور اس علم کے شر میں سے جو چیز متعلق ہے، وہ حمد کا الٹ ہے۔ اسی لیے فرمایا: **\"پس کفر نہ کرو۔\" (بقرہ: ۱۵۲)** کیونکہ حمد کا الٹ کفر ہے، اور وہ ذم (برائی بیان کرنا) ہے۔ کیونکہ حمد، محمود کی ان خوبیوں پر تعریف ہے جو اس میں ہیں اور جو اس سے صادر ہوتی ہیں جو اخلاق کریمہ عطا کرتی ہیں۔ اور ذم اس کے مقابلے میں ہے جس کا ہم نے ذکر کیا۔ اللہ تعالیٰ نے فرمایا: **\"پس وہ ان دونوں سے سیکھتے تھے\"** یعنی ان دو معلموں سے، **\"جس کے ذریعے وہ مرد اور اس کی بیوی کے درمیان جدائی ڈالتے تھے۔\" (بقرہ: ۱۰۲)** اور اللہ نے اسے ناپسند کیا ہے اور اس کی مذمت کی ہے، اور الفت اور اتحاد کی ترغیب دی ہے۔ اور جب اللہ سبحانہ نے جان لیا کہ ہر جمع شدہ اور مؤلف چیز کے لیے جدائی ناگزیر ہے، اس حقیقت کی وجہ سے جو اکثر لوگوں سے پوشیدہ ہے، تو اس نے اپنے بندوں پر رحمت کرتے ہوئے طلاق کو مشروع کیا، تاکہ وہ اپنے افعال میں ماجور ہوں، محمود ہوں، مذموم نہ ہوں، اور شیاطین کو ذلیل کیا جائے۔ اس کے باوجود، حدیث نبوی میں آیا ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا: **\"اللہ نے کوئی حلال چیز ایسی پیدا نہیں کی جو اسے طلاق سے زیادہ ناپسند ہو۔\"** کیونکہ یہ عدم کی طرف لوٹنا ہے۔ چونکہ طبائع کے ائتلاف سے ترکیب کا وجود ظاہر ہوا تھا، اور عدم ائتلاف سے عدم پیدا ہوا، تو اس طرح اسماء الٰہیہ کا اثر معطل ہو گیا۔ پس اسی بو کی وجہ سے اللہ نے میاں بیوی کے درمیان جدائی کو ناپسند کیا۔ پس اجتماع کا عین معدوم ہو گیا، یعنی یہ حالت ان دونوں میاں بیوی کے جدا ہونے سے ختم ہو گئی، اگرچہ ان کے اعیان باقی رہے۔ اگرچہ اجتماع اور افتراق، اور اس سے پیدا ہونے والی حرکت اور سکون، معقول نسبتوں کی طرف لوٹتے ہیں، نہ کہ موجود اعیان کی طرف، جیسا کہ بعض لوگ سمجھتے ہیں۔ اور اس منزل کے ساتھ خاص اس نور کے ذریعے وہ تمام شرور دور ہو جاتے ہیں جن کا ہم نے ذکر کیا، اور وہ بھی جن کا ہم نے ذکر نہیں کیا، جو کمال، موافقت وغیرہ کے بارے میں ہمارے مقرر کردہ اصول کے لحاظ سے شر کے نام کے تحت آتے ہیں۔ اور سحر کا وہ حصہ جو تفریق پیدا کرتا ہے، خاص طور پر اس منزل میں اس نور کے وجود کے سبب سے دور ہو جاتا ہے۔ اور جب تم ان تاریکیوں اور اندھیروں سے نکلتے ہو، ان میں شب روی کرتے ہوئے، یہاں تک کہ تمہارے لیے صبح طلوع ہو جائے اور انوار چمک اٹھیں، اور وہ عالم آخرت ہے، تو اس وقت تمہاری کوشش کی تعریف کی جاتی ہے اور اس نیند، لیٹنے اور سکون کی لذت کی تلافی ہو جاتی ہے جو تمہارے سفر میں جاگنے کی وجہ سے فوت ہو گئی تھی۔ پس انہوں نے اس کے لیے ایک مطابق لفظ وضع کیا، اور وہ ان کا قول ہے: **\"عند الصباح يحمد القوم السري (صبح کے وقت قوم شب کے سفر کرنے والے کی تعریف کرتی ہے)۔\"** اور صباح (صبح) اس نور سے عبارت ہے۔ اور جسے یہ نور حاصل ہو جائے، لوگ اس کے بارے میں غبطہ کرنے والے اور حسد کرنے والے کے درمیان ہوتے ہیں۔ پس غبطہ کرنے والا وہ ہے جو اللہ سے یہ طلب کرے کہ اسے بھی وہی حال حاصل ہو جو اس شخص کو حاصل ہوا ہے، بغیر اس کے کہ وہ اس کے ساتھی سے چھین لیا جائے۔ اور حاسد وہ ہے جو اس امر کے اپنے ساتھی سے زائل ہونے کی طلب کرے اور اسے خود حاصل کرنے کی طلب بالکل نہ کرے۔ لیکن اگر وہ اس کے زائل ہونے کی طلب کے ساتھ ساتھ اسے حاصل کرنے کی بھی طلب کرے، تو اس میں غبطہ کرنے والا اور حسد کرنے والا شریک ہو جاتے ہیں۔ اور جس چیز میں اشتراک ہوتا ہے وہ اس سے مختلف ہوتی ہے جس میں امتیاز ہوتا ہے۔ پس اس کے حصول کی طلب محمود ہے، اور وہ غبطہ ہے۔ اور اس کے زائل ہونے کی طلب مذموم ہے، اور وہ حسد ہے۔ اسی لیے ہم نے اس میں یہ تفصیل بیان کی، اگرچہ شریعت نے غبطہ کی جگہ بھی حسد کا لفظ استعمال کیا ہے۔ چنانچہ آپ صلی اللہ علیہ وسلم نے فرمایا: **\"حسد صرف دو چیزوں میں ہے: ایک وہ شخص جسے اللہ نے مال دیا اور اسے حق میں خرچ کرنے پر مسلط کر دیا، پس وہ اس میں سے خرچ کرتا ہے اور اسے دائیں بائیں تقسیم کرتا ہے۔\"** اور اس میں ایک راز ہے اور بغیر عوض کے سخاوت اور عطا کی فضیلت پر تنبیہ ہے۔ کیونکہ جو شخص عوض کے لیے دیتا ہے، وہ خرید و فروخت ہے، سخاوت نہیں، کیونکہ سخی وہ ہے جو معاوضہ طلب نہیں کرتا۔ اسی لیے آپ نے فرمایا: \"دائیں بائیں\"۔ اور اگر شمال (بائیں) سے مراد زنا یا کسی اور معصیت میں خرچ کرنا ہوتا، تو یہ سخاوت نہ ہوتی، کیونکہ اس سے اسے وہ عوض حاصل ہوتا ہے جو اسے مال سے زیادہ محبوب ہے۔ اگر یہ کہا جائے کہ عوض اس کے لیے لازم ہے، کیونکہ سخاوت کی تعریف سخی کے لیے لازم ہے، تو ہم کہیں گے کہ یہ بات صرف جاہل ہی کہے گا، کیونکہ اچھی تعریف سخاوت کے لوازم میں سے ہے، خواہ وہ اسے طلب کرے یا نہ کرے۔ پس حاصل شدہ چیز کو طلب کرنے میں مشغول ہونا جہالت ہے۔ کیونکہ حاصل شدہ چیز کی طلب نہیں کی جاتی، اور کسی چیز کا لازم اس کے لیے ضروری ہوتا ہے، ورنہ وہ لازم نہیں ہے۔ اگر اس نے ایسا کیا تو وہ عوض طلب کرنے والوں میں شامل ہو جائے گا اور اس وقت وہ سخاوت سے متصف نہیں ہو گا اور نہ ہی اسے پہنے گا۔ **\"اور دوسرا شخص وہ ہے جسے اللہ نے علم دیا، پس وہ اسے لوگوں میں پھیلاتا ہے۔\"** یعنی ان میں تقسیم کرتا ہے، جیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا، کیونکہ ہم نے اسے معنی کے لحاظ سے اور آپ صلی اللہ علیہ وسلم کے بعض الفاظ کے ساتھ بیان کیا ہے۔ پس آپ نے اسے حسد کا نام دیا۔ اور کبھی کسی چیز کو اس کے قریب ہونے یا اس سے کسی سبب سے ہونے کی وجہ سے دوسرے نام سے موسوم کیا جاتا ہے۔ اور جب ہم نے اپنی مراد کی تفصیل بیان کر دی تو ہمارے مقصد میں کوئی اشکال باقی نہیں رہا۔ اور ہماری مراد وہی ہے جو اللہ تعالیٰ نے اپنے اس فرمان میں چاہی: **\"اور حسد کرنے والے کے شر سے جب وہ حسد کرے۔\" (فلق: ۵)** اور شر اس کے مثل کے حصول کی طلب میں نہیں ہے، بلکہ شر اس کے زائل ہونے کی طلب میں ہے جو اس کے پاس ہے۔ اور جب ہم نے کہا کہ عبد الرب کے پانچ درجات ہیں اور وہ عبد الملک سے چار درجات زیادہ ہے، تو یہ منزل پانچ درجات پر تھی۔ اور اس منزل کے چھٹے درجے میں اہل اس شان کے درمیان اختلاف ہے۔ ان میں سے بعض نے اسے ایک مستقل درجہ قرار دیا ہے، لیکن وہ مقامات الٰہیہ میں سے دو مقامات کے درمیان فاصلہ ہے۔ اور یہ ہمارا مذہب نہیں ہے۔ اور بعض نے اسے اسی مقام میں چھٹا درجہ قرار دیا ہے، اور یہ ہمارا مذہب ہے۔ اور یہ درجہ اہل اس شان کے اجماع سے غیب کی منازل میں سے ایک منزل پر مشتمل ہے۔ اور بعض کے اختلاف کے ساتھ تین منازل بھی کہی گئی ہیں۔ لیکن ابن برجان نے جماعت سے الگ ہو کر اس درجے میں غیب کی دوسری منزل کو ظاہر کیا، اور میں کسی اور کے لیے یہ نہیں جانتا۔ اور اس کی اس میں ایک وجہ ہے، لیکن اس میں بہت دوری ہے۔ اگرچہ ہم نے اپنی بعض کتابوں میں اس مذہب کو اختیار کیا ہے، لیکن اس کے وجود میں وہ قوت نہیں ہے، بلکہ یہ صرف تحلیل کے فن اور اس طریق کے علم کے مفردات پر کلام کے وقت ظاہر ہوتا ہے، اور یہ معرفت ہویت (الہویۃ) سے متعلق ہے۔ اور اس درجے کے لیے الشہود (شہادت) کی منازل میں سے انیس منازل ہیں، ان منازل میں سے ہر منزل ان انیس فرشتوں میں سے ایک کو روکتی ہے جو آگ پر ہیں، پس اس درجے والے کو آگ سے کچھ نہیں پہنچتا۔ اللہ تعالیٰ نے فرمایا: **\"اس پر انیس ہیں۔\" (مدثر: ۳۰)** پس اس درجے میں ان منازل کے وجود کی وجہ سے آگ کے فرشتوں کو انیس بنایا گیا، اور ہم اس کا الٹ نہیں کرتے کہ ان فرشتوں کی وجہ سے یہ منازل انیس بنائی گئیں، کیونکہ معاملہ ایسا نہیں تھا۔ اور یہ منازل جعل (بنائے جانے) کے حکم سے نہیں تھیں، برخلاف فرشتوں کے۔ کیونکہ اس درجے نے ان منازل کا تقاضا اپنی ذات سے کیا تھا۔ اور فرشتوں کے بارے میں فرمایا: **\"اور ہم نے ان کی تعداد کو صرف ایک آزمائش بنایا ہے۔\" (مدثر: ۳۱)** پس وہ جعل کے حکم سے تھے، اور وہ عالم الشہود (شہادت) میں تھے، کیونکہ آگ محسوس اور مشہود ہے۔ اور یہ چھٹا درجہ کائنات سے متعلق اسماء الٰہیہ کے علم پر مشتمل ہے، اور اس کی ایک صورت عموم میں ایجاد کے لحاظ سے اور خصوص میں سعادت کے لحاظ سے ہے۔\n\n### [منزل اس مقام سے عبارت ہے جہاں ذات حق (الحق) تمہاری طرف نزول فرماتی ہے یا تم اس پر نزول کرتے ہو]\n\nجان لو کہ اس کتاب میں موجود ان منازل میں سے کوئی منزل ایسی نہیں جس میں یہ درجہ نہ ہو، اور اس کے اثرات منازل کے اختلاف سے مختلف ہوتے ہیں، سوائے منازل قہر میں سے ایک منزل کے، جس کا ذکر ان شاء اللہ عنقریب آئے گا۔ ہم نے کتاب *ہیاکل الانوار* میں اس منزل کا اور اس کی خصوصیات کا اور اس کے ہیکل کے عطا کردہ امور کا ذکر کیا تھا، پس وہاں دیکھا جائے، اور وہ ایک سو بارہواں ہیکل ہے۔ اور یہ مختصر تحریر ان تمام منازل کے اسرار کے لیے تنگ ہے جو اس میں ودیعت کیے گئے ہیں، یعنی اس کتاب میں۔ اور اسی طرح منازلات بھی۔ اور منزل اور منازلات کے درمیان فرق ہم تمہارے لیے واضح کرتے ہیں۔ وہ یہ ہے کہ منزل اس مقام سے عبارت ہے جہاں ذات حق (الحق) تمہاری طرف نزول فرماتی ہے یا تم اس پر نزول کرتے ہو۔ اور \"تمہاری طرف\" اور \"اس پر\" کے درمیان فرق کو جان لو۔ اور منازلہ یہ ہے کہ وہ تمہاری طرف نزول کا ارادہ کرے اور تمہارے دل میں اس پر نزول کی طلب پیدا کر دے، پس ہمت ایک لطیف روحانی حرکت کے ساتھ اس پر نزول کے لیے حرکت کرتی ہے، تو اس کے ساتھ دو نزولوں کے درمیان ملاقات واقع ہوتی ہے: ایک تمہارا اس پر نزول منزل تک پہنچنے سے پہلے، اور دوسرا اس کا تمہاری طرف نزول، یعنی کسی اسم الٰہی کا توجہ کرنا منزل تک پہنچنے سے پہلے۔ پس ان دو منزلوں کے علاوہ کسی اور جگہ یہ ملاقات واقع ہونا منازلہ کہلاتا ہے۔ اور یہاں اس حال والے کے لیے تین امور میں سے کوئی ایک ہوتا ہے: یا تو ملاقات کے وقت وہ فائدہ حاصل ہو جائے جو اس اسم کو اس بندے سے مطلوب تھا اور اس بندے کو اس اسم سے مطلوب تھا، تو وہ اسم اس سے جدا ہو کر اپنے مسمیٰ کی طرف چلا جاتا ہے اور بندہ اپنے اس مقام کی طرف لوٹ جاتا ہے جہاں سے وہ نکلا تھا۔ یا اسم الٰہی اس پر حکم لگاتا ہے کہ وہ اس چیز کی طرف لوٹ جائے جہاں سے وہ نکلا تھا، اور وہ اسم الٰہی اس کے ساتھ رہتا ہے یہاں تک کہ اسے وہاں پہنچا دے جہاں سے وہ نکلا تھا۔ یا اسم الٰہی اسے اپنے ساتھ لے جاتا ہے اور اسے اپنے مسمیٰ کی طرف عروج کراتا ہے۔ اور ان دونوں امور میں سے جو بھی حاصل ہو، تو ہمارے نزدیک یہ منزل جس کی طرف وہ لوٹے ہیں، اس خاص صفت کے ساتھ منزل المنازلات کہلاتی ہے، کیونکہ یہ ایسے احکام عطا کرتی ہے جو اس وقت عطا نہیں کرتی جب اس کا نزول منازلہ کے ذریعے نہ ہو۔ یہ بات اہل اذواق اور اہل شرب و ری (سیرابی) جانتے ہیں۔ اور ہم نے اس کتاب میں منازلات میں سے وہ کچھ رکھا ہے جس پر تم ان شاء اللہ واقف ہو گے۔\n\n### [منزل اور موطن]\n\nجان لو کہ منازل پر یہ نام صرف اس وقت بولا جاتا ہے جب ان میں نزول کیا جائے۔ لیکن اگر کوئی ان میں قیام کرے اور ان سے منتقل نہ ہو، تو اس کے لیے موطن (وطن) کا نام پیدا ہو جاتا ہے، اس میں اس کے مستقل قیام کی وجہ سے، اور مسکن (رہائش گاہ) کا نام اس کے سکون اور کسی دوسری منزل کی طرف منتقل نہ ہونے کی وجہ سے۔ البتہ اس کے لیے ضروری ہے کہ وہ اسی منزل کے اندر اس کی باریکیوں میں منتقل ہوتا رہے، اس سے باہر نہ نکلے، جیسے کوئی شخص اس گھر کے کمروں میں تصرف کرتا ہے جس میں وہ رہ رہا ہے۔ پس جب تک عارف ایک ہی اسم الٰہی کو اپنے تصرف کے اختلاف کے باوجود اپنے ساتھ رکھتا ہے، تو وہ مجموعی طور پر اس کا موطن ہوتا ہے۔ اور یہ محال ہے کہ کوئی شخص دو سانسوں تک ایک ہی حالت پر قائم رہے۔ پس ہر سانس میں اس کے لیے انتقال ضروری ہے۔ اسی لیے بعض اہل اللہ نے اسم کو موطن یا مسکن ہونے سے منع کیا، کیونکہ انہوں نے یہ خیال کیا کہ ہر سانس اور ہر حال کے لیے ایک اسم الٰہی ہوتا ہے، اور انہیں یہ معلوم نہ ہوا کہ اسم الٰہی کا ایک حکم ہو سکتا ہے یا اس کے بہت سے مختلف احکام ہو سکتے ہیں، تو وہ اس شخص کے لیے موطن ہوتا ہے جب تک وہ اس کے احکام کے تحت تصرف کرتا ہے۔ پس جہاں تک ان کا یہ قول ہے کہ دو سانسوں تک ایک ہی حکم پر باقی رہنا محال ہے، اس طرح کہ واحد حکم کی صفت ہو، تو یہ صحیح ہے۔ لیکن اگر ان کی مراد یہ ہے کہ دو سانسوں تک ایک ہی حکم پر باقی رہنا محال ہے، اضافت کے طریقے پر، یعنی حکم کی اضافت واحد کی طرف، تو یہ صحیح نہیں ہے۔ کیونکہ اس اسم الٰہی کے لیے کئی وجوہ ہیں۔ پس الغفار اسے فلاں فلاں چیز سے پردہ ڈالتا ہے، ان مطالبات کے مطابق جو ہر سانس میں اس سے طلب کیے جاتے ہیں، ان چیزوں میں سے جن پر اسم الغفار پردہ ڈال سکتا ہے، مسلسل اور پے در پے، بغیر اس کے کہ ان کے درمیان کوئی ایسی چیز حائل ہو جو کسی دوسرے اسم کا تقاضا کرے۔ اسی لیے اس میں مبالغہ صحیح ہے، کیونکہ اس سے یہ کثرت سے ہوتا ہے۔ اور اسی طرح الخلاق اور الرزاق اور تمام وہ اسماء جن کا کون (کائنات) میں حکم ہے، جب انسان پر وہ چیزیں مسلسل آتی رہیں جو اس اسم کا تقاضا کرتی ہیں، اور یہ ضروری ہے۔ پس اسماء الٰہیہ ایک لحاظ سے منازل ہیں اور ایک لحاظ سے مساکن اور مواطن ہیں۔ اور ہم نے اس باب میں اشارے کے طور پر اور وقت کی تنگی کے پیش نظر وہ کچھ بیان کر دیا ہے جس سے صاحب ذوق کو فائدہ حاصل ہو جائے۔ اور ہم ہر باب میں اپنے پاس موجود علم میں سے صرف ایک نقطہ ہی ودیعت کرتے ہیں، جو ایک محیط سمندر کا نقطہ ہے۔ یہ اس لحاظ سے ہے جو ہمارے پاس ہے، تو پھر اس لحاظ سے کیا ہو گا جو وہ اپنی ذات میں ہے؟ وہ تو ایسا سمندر ہے جس کا کوئی کنارہ نہیں۔ اور یہ منزل منازل امر (منازل الأمر) میں سے ہے۔ اور یہ منازل امریہ اگرچہ عدد میں سات ہیں، تو یہ امہات (بنیادی اصول) کے لحاظ سے ہیں، اور حقیقت میں یہ اس سے زیادہ ہیں۔ اور جب ہمیں اس کی فرصت ملے گی تو ہم اسے محدود کریں گے تاکہ معلوم ہو سکے کہ یہ ذات حق (الحق) کی جناب میں کہاں تک منتہی ہوتی ہیں، کیونکہ ان میں بہت سے فوائد ہیں جو ہماری کتابوں میں ثابت ہیں۔ اور اللہ سبحانہ **\"حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\" (احزاب: ۴)** اور اس منزل کے علوم میں اسماء الٰہیہ کے ذریعے مغیبات کو ظاہر کرنے کا علم، علم خلق، اور علم غیب جو الشہود (شہادت) میں داخل ہے، علم شبہ اور روح کو دل میں پھونکنے کا علم شامل ہے۔",
    "fa": "باب دویست و هفتاد و یکم: در معرفت منزلی که در آن «هنگام صبح، قوم از سیر شبانه (السري) سپاسگزاری می‌کنند» از مناجات محمدیه، و این منزل نیز از منازل امر است.\n\nچه کلمه‌ای است که همه خلایق آن را می‌گویند\nهنگام صبح که قوم از سیر شبانه (السري) سپاسگزاری می‌کنند؟\n\nای کسی که همه مردمان را در امام و پشت سر می‌بینی،\nدر گفتار آنان چه می‌بینی؟\n\nهر کس که با علم به آنچه گذشته است،\nبر خداوند افترا بندد، در خبر دادن خود زیانکار است.\n\nبدان، خداوند ما و تو را به روحی از جانب خود تأیید کند، که این منزل، منزل علم سیر شبانه (السري) و اهل آن است. این منزل دربردارنده معرفت عالم خلق و ظلال (سایه‌ها) است و از آنجا اهل کشف (الکشف) خسوف قمر را می‌شناسند و می‌دانند که این از خشوعی است که از تجلی (التجلی) بر قمر عارض می‌شود. همچنین علم هاروت و ماروت از علم سحر و علم طلوع انوار به این منزل مرتبط است.\n\n### [انوار بر دو قسم‌اند: انوار اصلی و انوار متولد شده از ظلمت هستی (الکون)]\n\nبدان، خداوند تو را برای پذیرش توفیق دهد، که انوار بر دو قسم‌اند: انوار اصلی و انوار متولد شده از ظلمت هستی (الکون)، مانند نور در این فرموده حق تعالی: «و نشانه‌ای برای ایشان شب است که روز را از آن برمی‌کنیم، پس ناگهان آنان در تاریکی فرو می‌روند» (وآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهارَ فَإِذا هُمْ مُظْلِمُونَ). و مانند این فرموده عز و جل: «شکافنده صبح است و شب را مایه آرامش قرار داد» (فالِقُ الْإِصْباحِ وجَعَلَ اللَّيْلَ سَكَناً). به این آیه نیز بنگر: «و از نشانه‌های او این است که برای شما از جنس خودتان همسرانی آفرید تا به سوی آنان آرامش یابید» (ومن آياتِهِ أَنْ خَلَقَ لَكُمْ من أَنْفُسِكُمْ أَزْواجاً لِتَسْكُنُوا إِلَيْها) تا برای او بر نور، ولادتی باشد. نوری که در این منزل درباره آن سخن می‌گوییم، نور متولد زمانی است. این منزل مخصوص امام واحد از دو امامی است که برای قطب (القطب) هستند و او «عبد ربه» نامیده می‌شود. گاهی این نور مذکر و گاهی مؤنث است. پس هنگامی که شب، روز را بپوشاند، آنچه از آن متولد می‌شود، همان نور مطلوب است. این نور متولد که شرح آن را آغاز کردیم، نور عصمت برای پیامبر و نور حفظ برای ولی است. این نور، حیا و کشف (الکشف) تام را می‌بخشد، زیرا هم خود کشف می‌کند و هم به وسیله آن کشف می‌شود. اما نور اصلی، کشف می‌کند ولی به وسیله آن کشف نمی‌شود، زیرا بر نور دیدگان غلبه می‌کند و فایده‌ای که نور برای آن آمده است، از بین می‌رود. به همین دلیل، نفوس عارفان به انوار و مراتب آن‌ها، به این نور متولد شده از ظلمت پناه می‌برند، به دلیل مناسبتی که بین ما و آن از جهت آفرینش ارواحمان وجود دارد؛ زیرا ارواح جزئی از روح کلی که به حق (الحق) اضافه شده، متولد شده‌اند. و اجسام طبیعی ظلمانی پس از تسویه و حصول استعداد پذیرش، روح جزئی که روح انسان است، بین آن دو در جسم ظاهر می‌شود. جسم از آن می‌شکافد، مانند شکافته شدن صبح از شکافنده صبح (فالق الإصباح) در شب. پس مناسبتی بین این نور و روح انسان برقرار می‌شود. به همین دلیل، انسان با آن انس می‌گیرد و از آن بهره می‌برد. خداوند عادت را این‌گونه جاری ساخته و نیرویی بیش از این عطا نکرده است، اگرچه اگر می‌خواست، انجام می‌داد. مظاهر الهی که با تجلیات (التجلیات) از آن‌ها تعبیر می‌شود، نیز این‌گونه جاری شده‌اند؛ زیرا نور اصلی در آن‌ها پنهان است و از ما غایب است، و صوری که تجلی (التجلی) در آن‌ها واقع می‌شود، محل ظهور مظهر هستند. پس رؤیت ما بر مظاهر واقع می‌شود. به همین دلیل، مظاهر مقید به صور هستند تا ادراک ما با مناسبتی صحیح صورت گیرد؛ زیرا مقصود از آن، حصول فایده به وسیله آن و آنچه از آن حاصل می‌شود، است. این منزلی بلند و بزرگ‌قدر است و کسی که به آن عالم باشد، بر هم‌نوعان خود برتری می‌یابد. این نور در اشیاء جاری است. همان‌طور که خداوند سبحان فرمود که او «شکافنده صبح» (فالِقُ الْإِصْباحِ) است، همچنین «شکافنده دانه و هسته» (فالِقُ الْحَبِّ والنَّوى‏) است، به واسطه آنچه از آن دو ظاهر می‌شود. پس فواید جز به مانند این نور حاصل نشده است. پیامبران (علیهم السلام) آن را سپری قرار می‌دادند که به وسیله آن از حوادث هستی (الکون) که ظلمت اغیار است، دوری می‌جستند. و همان‌طور که قدر و منزلت این نور متولد برای تو روشن شد، اکنون بیان می‌کنیم که چه چیزی برای آن سپر قرار داده می‌شود. سپر جز برای اموری که انسان طبعاً و شرعاً از آن‌ها کراهت دارد، نیست، و این امور مخصوص عالم خلق و ترکیب طبیعی است، نه عالم امر. ما در این کتاب و کتب دیگر، منظور خود از عالم امر و عالم خلق را بیان کرده‌ایم، و همه از آنِ خداوند تعالی است. فرمود عز و جل: «آگاه باشید که خلق و امر از آن اوست، پربرکت است خداوند، پروردگار جهانیان» (أَلا لَهُ الْخَلْقُ والْأَمْرُ تَبارَكَ الله رَبُّ الْعالَمِينَ). پس آن را به اسم «رب» (پروردگار) اختصاص داد نه غیر آن. و چون عالم خلق و ترکیب ذاتاً مقتضی شر است، از این رو عالم امر که خیر محض است و شری در آن نیست، هنگامی که آفرینش انسان و ترکیب او از طبایع متنافر را دید (و تنافر عین تنازع است و نزاع امری است که به فساد می‌انجامد)، گفتند: «آیا در آن کسی را قرار می‌دهی که فساد می‌کند و خون‌ها می‌ریزد؟» (قالُوا أَ تَجْعَلُ فِيها من يُفْسِدُ فِيها ويَسْفِكُ الدِّماءَ) بدون اینکه متعرض مواضع احکام مشروع شوند. و همان‌طور که گفتند، واقع شد و حق سبحانه را دیدند که می‌فرماید: «و خداوند مفسدان را دوست ندارد» (والله لا يُحِبُّ الْمُفْسِدِينَ) و فرمود: «و خداوند فساد را دوست ندارد» (والله لا يُحِبُّ الْفَسادَ). پس آنچه را که خداوند ناپسند داشت، ناپسند داشتند و آنچه را که خداوند دوست داشت، دوست داشتند. و حکم خداوند در خلق بر اساس آنچه عزیز و علیم مقدر کرده بود، جاری شد. پس آنچه از عالم ترکیب از شرور ظاهر شد، از طبیعت آن است که ملائکه ذکر کردند، و آنچه از خیر ظاهر شد، از روح الهی آن است که همان نور متولد است. پس ملائکه راست گفتند. به همین دلیل فرمود: «و هر بدی که به تو رسد، از خود توست» (وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ). و چون عالم خلق چنین است، بر هر عاقلی واجب است که به این نور مذکور در این منزل پناه برد. پس همه شرور به عالم خلق اضافه می‌شوند و همه خیر به عالم امر اضافه می‌شود.\n\n### [طبیعت برای ظهور عالم خلق تألیف یافت تا مظهر آن نور باشد]\n\nو بدان که چون طبیعت تألیف یافت و برای ظهور عالم خلق گرد آمد، پس از آنکه متنافر بود، تا شرافت این نور به واسطه خیری که در آن است، با وجود تولدش از این ترکیب، به دلیل قوت و غلبه عالم امر بر نشأت آن، آشکار شود، وارد هستی حسی (الوجود الحسي) شد و جسم، حیوان، نبات و جماد نامیده شد. و هیچ یک از این‌ها نیست مگر اینکه فساد و تغییر در هر حال در آن وجود دارد. و اگر این نور اعتصامی (پناهگاهی) نبود، عالم خلق به کلی نابود می‌شد. پس خداوند سبحان امر فرمود که برای دفع همه این مکروهات به او پناه برده شود. پس خداوند این روح را با آنچه از این نور از اسم «رب» (پروردگار) به او می‌دهد، تأیید می‌کند تا به وسیله آن، آنچه از جانب ظلمت طبع به او ضرر می‌رساند، دفع کند.\n\n### [مسمای شر و خیر]\n\nو بدان که مسمای شر و مسمای خیر در حقیقت، یا به وضع الهی بازمی‌گردد که زبان‌های شرایع آن را آورده‌اند، یا به سازگاری مزاج که در حق او خیر است، یا به ناسازگاری مزاج که در حق او شر است، یا به کمال مقرر که دلیل آن را اقتضا کرده و خیر است، یا به نقص از آن درجه که شر است، یا به حصول غرض که در نظر او خیر است، یا به عدم حصول آن که در نظر او شر است. پس اگر ناظر، نظر خود را از همه این اشیاء بردارد، جز اعیان موجوداتی باقی نمی‌ماند که به خیر و شر متصف نمی‌شوند. این همان مرجعی است که هنگام انصاف و تحقیق به آن بازگشت می‌شود. اما خداوند سبحان جز آنچه در هستی (الوجود) حاصل شده است، انجام نداده است؛ از کمال و نقص، سازگاری و ناسازگاری، شرایع وضع شده با تحسین و تقبیح، و اغراضی که در نفوس وجود دارند و گاهی به دست می‌آیند و گاهی نه. و هستی از این مراتب خالی نیست. و سخن متکلم تنها درباره آنچه در هستی حاصل شده است، می‌باشد، نه درباره نظر دیگری که به جانب حق (الحق) نسبت داده می‌شود. سپس، اصل همه این امر، از جانب وجود واجب الوجود لذاته است که خیر محض است و شری در آن نیست، و از جانب عدم مطلق (العدم المطلق) که در مقابل هستی مطلق (الوجود المطلق) است. و این عدم، شر محض است که خیری در آن نیست. پس هر شری که در عالم ظاهر شد، اصلش این است، زیرا آن عدم کمال یا عدم سازگاری یا عدم حصول غرض است، و این‌ها نسبت‌ها هستند. و هر خیری که ظاهر شد، هستی مطلق فاعل آن است. به همین دلیل فرمود: «بگو: همه از جانب خداست» (قُلْ كُلٌّ من عِنْدِ الله). و آنچه به اینکه «نزد توست» توصیف می‌شود، عین تو نیست. و اعدام و ایجاد بین اراده سبحانه و قدرت اوست. به همین دلیل گفتیم که خیر، فعل حق (الحق) است و در مورد شر، فعل نگفتیم، بلکه گفتیم که اصل آن، عدم مطلق است. پس عبارت را درباره آن دقیق کردیم تا عاقلی که در این کتاب من می‌نگرد، منظور ما را بداند. و چون این اصل سودمند در این باب روشن شد، می‌گوییم: از جمله اموری که برای دفع افعال ناپسند به آن پناه برده می‌شود، همان علم سحری است که شیاطین بر ملک سلیمان می‌خواندند و آن را با آنچه بر دو فرشته، هاروت و ماروت، از علم حق (الحق) نازل شده بود، آمیختند. پس علم حق (الحق) از آن، علم به اموری است که معجزات نامیده می‌شوند، زیرا حق (الحق) معجز است و آن نوری است که به آن استناد می‌شود. و علم باطل از آن، علم خیال است که درباره آن فرمود: «چنین به نظرش می‌رسید که آن‌ها در اثر سحرشان می‌دوند» (يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏). به همین دلیل، سحر، سحر نامیده شد که از «سَحَر» گرفته شده است و آن اختلاط نور و ظلمت است. پس سحر یک روی به ظلمت دارد و ظلمت خالص نیست، و یک روی به نور دارد و نور خالص نیست. همچنین سحر یک روی به حق (الحق) دارد و آن چیزی است که برای چشم بیننده ظاهر می‌شود، زیرا آن حق است، و یک روی به باطل دارد، زیرا امر در نفس خود بر آن چیزی نیست که چشم درک کرده است. به همین دلیل، عرب آن را سحر نامید و عامل آن را ساحر، مگر کسی که به آن عالم باشد. و به همین دلیل، «کید» نامیده شد، از «کاد یکید» یعنی نزدیک شد به حق (الحق). فرمود تعالی: «آنان مکر می‌کنند، مکری» (إِنَّهُمْ يَكِيدُونَ كَيْداً) یعنی در آنچه برای شما ظاهر می‌شود، به حق نزدیک می‌شوند. و «کاد» از افعال مقاربت است. عرب می‌گوید: «کاد العروس یکون أمیراً» یعنی نزدیک بود که داماد امیر شود. فرمود تعالی: «آنچه ساختند، مکر ساحر است» (إِنَّما صَنَعُوا كَيْدُ ساحِرٍ) یعنی کاری کردند که در صورت ظاهری برای چشم، به حق نزدیک است. پس اگر حق نباشد، «بعد از حق جز گمراهی چیست؟ پس چگونه بازگردانده می‌شوید؟» (فَما ذا بَعْدَ الْحَقِّ إِلَّا الضَّلالُ فَأَنَّى تُصْرَفُونَ) یعنی چگونه از معرفت این حقایق بازگردانده می‌شوید؟ و از جمله اموری که به این علم از شر مربوط می‌شود، «مقلوب الحمد» (وارونه سپاس) است. به همین دلیل فرمود: «پس کفران مکن» (فَلا تَكْفُرْ)، زیرا مقلوب حمد، کفر است و آن ذم (نکوهش) است. زیرا حمد، ثنا گفتن بر محمود به خاطر صفاتی است که دارد و به خاطر آنچه از او صادر می‌شود که مکارم اخلاق اقتضای آن را دارد. و ذم در مقابل آنچه ذکر کردیم، قرار دارد. فرمود تعالی: «پس از آن دو [فرشته] می‌آموختند آنچه را که به وسیله آن بین مرد و همسرش جدایی می‌انداختند» (فَيَتَعَلَّمُونَ مِنْهُما ما يُفَرِّقُونَ به بَيْنَ الْمَرْءِ وزَوْجِهِ). و خداوند آن را ناپسند داشته و آن را نکوهش کرده و به الفت و انتظام جمع تشویق نموده است. و چون سبحانه می‌دانست که جدایی برای هر مجموعه تألیف یافته‌ای به دلیل حقیقتی که بر بیشتر مردم پنهان است، ناگزیر است، طلاق را تشریع کرد تا رحمتی برای بندگانش باشد و در افعالشان مأجور و ستوده باشند نه نکوهیده، و این برای به خشم آوردن شیاطین است. با این حال، در خبر نبوی وارد شده است که پیامبر (صلی الله علیه و سلم) فرمود: «خداوند حلالی را نیافریده که نزد او منفورتر از طلاق باشد» (ما خلق الله حلالا أبغض إليه من الطلاق‏). زیرا طلاق بازگشت به عدم است، چرا که با ائتلاف طبایع، وجود ترکیب ظاهر شد و با عدم ائتلاف، عدم حاصل شد. در نتیجه، اسماء الهی از تأثیر معطل ماندند. به خاطر این بوی (عدم)، جدایی بین زوجین ناپسند شمرده شد. پس عدم عین اجتماع، یعنی این حالت با جدایی این دو زوج از بین رفت، اگرچه اعیان آن‌ها باقی ماند. اگرچه اجتماع و افتراق و حرکت و سکونی که از آن حاصل می‌شود، به نسبت‌های معقول بازمی‌گردد نه به اعیان موجود، چنانکه برخی می‌پندارند. و به وسیله این نور مخصوص این منزل، همه شروری که ذکر کردیم و آنچه را که ذکر نکردیم و نام شر بر آن اطلاق می‌شود، با توجه به آنچه از کمال و سازگاری و غیره مقرر کردیم، دفع می‌شود. و این مقدار از سحر که جدایی می‌آورد، همان چیزی است که سبب وجود این نور در این منزل به خصوص آن را دفع می‌کند. و هنگام خروج از این تاریکی‌ها و ظلمت‌ها با سیر شبانه (الإدلاج) در آن‌ها، تا زمانی که صبح برای تو طلوع کند و انوار بتابد، و آن عالم آخرت است، در آن هنگام است که از تلاش خود و آنچه از لذت خواب و آسودن و سکون در سیرت از دست دادی، سپاسگزاری می‌کنی. پس برای آن لفظی مطابق وضع کردند و آن این قولشان است: «هنگام صبح، قوم از سیر شبانه (السري) سپاسگزاری می‌کنند». و صبح، عبارت از این نور است. و کسی که این نور به او برسد، مردم نسبت به او بین غبطه‌خورنده و حسود هستند. غبطه‌خورنده کسی است که از خداوند می‌خواهد که برای او نیز مانند آنچه برای صاحب این حال حاصل شده، به دست آید، بدون اینکه آن را از صاحبش سلب کند. و حسود کسی است که زوال این امر را از صاحبش می‌خواهد و در طلب خود به نیل آن به طور کلی نمی‌پردازد. اما اگر همراه با طلب زوال آن، نیل به آن را نیز طلب کند، در این صورت اشتراک بین غبطه‌خورنده و حسود واقع می‌شود. و آنچه موجب اشتراک می‌شود، غیر از چیزی است که موجب امتیاز می‌شود. پس طلب نیل به آن ستوده است و آن غبطه است، و طلب زوال آن نکوهیده است و آن حسد است. به همین دلیل، ما در این باره این تفصیل را بیان کردیم، اگرچه شرع در موضع غبطه، لفظ حسد را به طور مطلق به کار برده است.\n\nپس پیامبر (صلی الله علیه و سلم) فرمود: «حسد (لا حسد) جز در دو مورد نیست: مردی که خداوند به او مالی داده و او را بر هلاکت آن در راه حق مسلط کرده است، پس از آن انفاق می‌کند و آن را به راست و چپ تقسیم می‌کند» (لا حسد إلا في اثنتين رجل آتاه الله مالا فسلطه على هلكته في الحق فهو ينفق منه ويفرقه يمينا وشمالا).\n\nو در این، رازی و تنبیهی بر فضیلت کرم و بخشش بدون عوض است؛ زیرا کسی که برای عوضی ببخشد، آن خرید و فروش است و کرم نیست. زیرا کریم کسی است که طلب معاوضه نمی‌کند. به همین دلیل فرمود: «به راست و چپ». و اگر منظور از «شمال» (چپ)، انفاق در معصیتی مانند زنا یا غیر آن بود، کرم نبود، زیرا در این صورت عوضی به دست می‌آورد که نزد او محبوب‌تر از مال است. اگر گفته شود که عوض برای او لازم است، زیرا ثنای نیکو به کرم، لازمه شخص کریم است، می‌گوییم: این جز از جاهل سر نمی‌زند، زیرا ثنای نیکو از لوازم کرم است، چه آن را طلب کند و چه طلب نکند. پس مشغول شدن به طلب آنچه حاصل است، جهل است، زیرا حاصل طلب نمی‌شود. و لازمه شیء ناگزیر از آن است، وگرنه لازم نیست. اگر چنین کند، به صاحبان عوض ملحق می‌شود و در آن حال به کرم متصف نمی‌شود و لباس آن را نمی‌پوشد.\n\nو مرد دیگر، مردی است که خداوند به او علمی داده و او آن را در میان مردم منتشر می‌کند (والرجل الآخر رجل آتاه الله علما فهو يبثه في الناس).\n\nیعنی آن را در میانشان تقسیم می‌کند. حدیث همان‌طور است که پیامبر (علیه السلام) فرمود، زیرا ما آن را از جهت معنا و برخی الفاظ پیامبر (صلی الله علیه و سلم) نقل کردیم. پس آن را حسد نامید. و گاهی شیء به نام شیء دیگری نامیده می‌شود به دلیل نزدیکی یا سببی که از آن حاصل می‌شود. و پس از آنکه آنچه را می‌خواستیم تفصیل دادیم، اشکال در آنچه قصد کرده بودیم، برطرف شد. و ما جز آنچه خداوند تعالی با این فرموده‌اش قصد کرده است، نخواستیم: «و از شر حسود هنگامی که حسد ورزد» (ومن شَرِّ حاسِدٍ إِذا حَسَدَ). و شر در طلب نیل به مثل آن نیست، بلکه شر در طلب زوال آن از کسی است که نزد اوست. و چون گفتیم که «عبد الرب» پنج درجه دارد و چهار درجه بر «عبد الملک» افزون است، این منزل نیز پنج درجه داشت. و در مورد درجه ششم این منزل، بین اهل این فن اختلاف است. برخی آن را درجه‌ای مستقل به خود دانسته‌اند، اما فاصل بین دو مقام از مقامات الهی است، و این مذهب ما نیست. و برخی آن را درجه ششم در عین همین مقام دانسته‌اند، و این مذهب ماست. این درجه به اجماع اهل این فن، یک منزل از منازل غیب را در بر می‌گیرد. و گفته شده است که سه منزل است که در آن اختلاف دارند. اما ابن برجان به تنهایی، منزل دوم از منازل غیب را در این درجه آشکار کرد و من این را از غیر او ندانسته‌ام. و او در این باره وجهی دارد، اما بسیار دور است، اگرچه ما خود در برخی کتبمان به این مذهب رفته‌ایم، ولی وجود آن قوت چندانی ندارد و تنها هنگام صنعت تحلیل و سخن گفتن درباره مفردات این طریق علمی ظاهر می‌شود. و این مربوط به معرفت هویّت است. و برای این درجه، نوزده منزل از منازل شهود (الشهود) وجود دارد. هر منزلی از این منازل، مانع یک فرشته از نوزده فرشته‌ای است که بر آتش گماشته شده‌اند. پس صاحب این درجه چیزی از آتش به او نمی‌رسد. فرمود تعالی: «بر آن نوزده نفرند» (عَلَيْها تِسْعَةَ عَشَرَ). پس به دلیل وجود این منازل در این درجه، فرشتگان آتش نوزده نفر قرار داده شدند. و برعکس نمی‌گوییم که به دلیل این فرشتگان، این منازل نوزده نفر قرار داده شدند، زیرا امر چنین نبوده است. و این منازل به حکم جعل (قرار دادن) نبودند، برخلاف فرشتگان. زیرا این درجه ذاتاً مقتضی این منازل بود. و درباره فرشتگان فرمود: «و تعداد آن‌ها را جز برای فتنه قرار ندادیم» (وما جَعَلْنا عِدَّتَهُمْ إِلَّا فِتْنَةً). پس آن‌ها به حکم جعل بودند و در عالم شهود (الشهود) بودند، زیرا آتش محسوس و مشهود است. و این درجه ششم از علوم، علم اسماء الهی مربوط به هستی (الکون) را در بر می‌گیرد و از حیث ایجاد، صورتی در عموم دارد و از حیث سعادت، صورتی در خصوص.\n\n### [منزل عبارت است از مقامی که حق (الحق) در آن به سوی تو نازل می‌شود یا تو در آن به سوی او نازل می‌شوی]\n\nو بدان که هیچ منزلی از این منازل که در این کتاب است، نیست مگر اینکه این درجه را دارد و آثار آن به اختلاف منازل متفاوت است، جز یک منزل از منازل قهر که ذکر آن به خواست خداوند خواهد آمد. ما در کتاب «هیاکل الأنوار» این منزل و آنچه به آن اختصاص دارد و آنچه هیکل آن می‌بخشد را ذکر کرده‌ایم، پس باید به آنجا نگریست، و آن هیکل صد و دوازدهم است. و این عجاله برای اسرار آن در هر منزلی از این منازل که در آن (یعنی در این کتاب) گنجانده شده، تنگ است. همچنین منازلات. و فرق بین منزل و منازلات را برای تو بیان می‌کنیم: منزل عبارت است از مقامی که حق (الحق) در آن به سوی تو نازل می‌شود یا تو در آن به سوی او نازل می‌شوی. و باید فرق بین «به سوی تو» و «به سوی او» را بدانی. و منازله آن است که او اراده نزول به سوی تو کند و در قلب تو طلب نزول بر او را قرار دهد. پس همت (الهمة) یک حرکت روحانی لطیف برای نزول بر او پیدا می‌کند. پس اجتماع با او بین دو نزول واقع می‌شود: نزولی از جانب تو بر او قبل از رسیدن به منزل، و نزولی از جانب او به سوی تو، یعنی توجه اسم الهی، قبل از رسیدن به منزل. وقوع این اجتماع در غیر دو منزل، منازله نامیده می‌شود. و در اینجا صاحب این حالت یکی از سه امر را دارد: یا فایده‌ای که برای آن اسم از این بنده و برای این بنده از آن اسم مطلوب است، هنگام ملاقات حاصل می‌شود، پس اسم از او جدا شده و به مسمای خود بازمی‌گردد و بنده به مقام خود که از آن خارج شده بود، برمی‌گردد. یا اسم الهی بر او حکم می‌کند که به جایی که از آن خارج شده بود، بازگردد و آن اسم الهی با اوست تا او را به جایی که از آن خارج شده بود، برساند. یا اسم الهی او را با خود می‌برد و به مسمای خود عروج می‌دهد. و هر یک از این دو امر که از آنچه ذکر کردیم، حاصل شود، نزد ما این منزلی که به آن بازگشته‌اند، با این صفت خاص، «منزل المنازلات» نامیده می‌شود، زیرا احکامی متفاوت با آنچه در صورت عدم نزول از منازله می‌بخشد، عطا می‌کند. این را اهل اذواق و اهل شرب و سیراب شدن می‌دانند. و ما در این کتاب از منازلات، آنچه را که به خواست خداوند بر آن واقف خواهی شد، قرار داده‌ایم.\n\n### [منزل و موطن]\n\nو بدان که منازل تنها هنگام نزول در آن‌ها، این نام بر آن‌ها اطلاق می‌شود. اما اگر در آن اقامت کند و از آن منتقل نشود، نام «موطن» به دلیل وطن گرفتن در آن، و نام «مسکن» به دلیل آرام گرفتن در آن و عدم انتقال به منزل دیگر، برای آن حادث می‌شود. با این حال، ناگزیر است که در نفس این منزل در دقایق آن منتقل شود، به طوری که از آن خارج نشود، مانند کسی که در خانه‌های سرایی که در آن ساکن است، تصرف می‌کند. پس تا زمانی که عارف یک اسم الهی را همراه خود دارد، با وجود اختلاف تصرف او در آن، آن منزل از حیث کلی، موطن اوست. و محال است که کسی دو نفس بر یک حالت بماند. پس ناگزیر است که در هر نفس منتقل شود. به همین دلیل، برخی از اهل الله منع کردند که اسم، موطن یا مسکن باشد، زیرا تصور کردند که برای هر نفس و هر حالی، یک اسم الهی وجود دارد. و ندانستند که اسم الهی ممکن است یک حکم یا احکام بسیاری داشته باشد. پس تا زمانی که شخص تحت احکام آن تصرف می‌کند، آن اسم موطن اوست. اما قول آن‌ها که محال است دو نفس بر یک حکم باقی بماند، به شرطی که «واحد» نعت حکم باشد، صحیح است. اما اگر منظورشان محال بودن بقای دو نفس بر یک حکم به طریق اضافه (اضافه حکم به واحد) باشد، صحیح نیست. زیرا وجوه برای این اسم الهی وجود دارد. پس «غفار» او را از فلان و فلان و فلان و فلان می‌پوشاند، بر حسب مطالبی که در هر نفس از او طلب می‌شود و صحیح است که اسم غفار او را از آن‌ها بپوشاند، به صورت پی در پی و متوالی، بدون اینکه چیزی که اسم دیگری را طلب کند، در میان آن‌ها فاصله اندازد. به همین دلیل، مبالغه در آن صحیح است، زیرا این کار از او زیاد سر می‌زند. و همچنین «خلاق» و «رزاق» و همه اسمایی که در هستی (الکون) حکم دارند، اگر آنچه این اسم را می‌طلبد، پی در پی بر انسان وارد شود، ناگزیر است. پس اسماء الهی از یک جهت منازل هستند و از جهتی دیگر مساکن و مواطن. و ما در این باب به طریق اشاره و به دلیل تنگی وقت، آنچه را که برای صاحب ذوق فایده دارد، بیان کردیم. و ما در هر بابی از آنچه نزد ماست، جز نقطه‌ای از دریای محیط نمی‌گنجانیم. این با توجه به آنچه نزد ماست، است. پس چگونه است با توجه به آنچه در نفس خود آن است؟ آن دریایی است که ساحلی ندارد. و این منزل از منازل امر است. و این منازل امری، اگرچه از حیث امهات هفت عدد هستند، اما در حقیقت بیش از آن هستند. و ناگزیر است که اگر فراغتی برای ما حاصل شود، آن‌ها را احصا کنیم تا معلوم شود که تا کجا به جناب حق (الحق) منتهی می‌شوند، زیرا در آن‌ها فواید بسیاری است که در کتب ما ثبت شده است. و خداوند سبحان «حق را می‌گوید و راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ). و در این منزل از علوم، علم استخراج امور غیبی به وسیله اسماء الهی، علم خلق، علم غیب داخل در شهود (الشهود)، علم شبه و علم دمیدن روح در دل (الروع) وجود دارد."
  },
  "page_count": 5
}