{
  "id": 98,
  "title": {
    "ar": "الباب الثامن والتسعون في معرفة مقام السهر",
    "en": "Chapter Ninety-Eight, Concerning the Gnosis (معرفة) of the Station (مقام) of Vigilance (السهر)",
    "ur": "باب اٹھانوے (۹۸) مقام السہر (مقام السهر) کی معرفت (المعرفۃ) کے بیان میں",
    "fa": "باب نود و هشتم در معرفت مقام بیداری (السهر)"
  },
  "content": {
    "ar": "## (الباب الثامن والتسعون في معرفة مقام السهر)\n\n\n> من لا تنام له عين وليس له *** قلب ينام فذاك الواحد الأحد\n\n\n> مقامه الحفظ والأعيان تعبده *** ولا يقيده طبع ولا جسد\n\n\n> هو الإمام وما تسري إمامته *** في العالمين فلم يظفر به أحد\n> كرسيه تخزن الأكوان فيه ولا *** يؤده حفظ شي‏ء ضمه عدد\n\n\n### [القيومية هي لله على ما تعطيه ذاته وللعبد على ما تعطيه ذاته‏]\n\n\nهذا المقام يسمى مقام القيومية واختلف أصحابنا هل يتخلق به أم لا ولقيت أبا عبد الله بن جنيد من شيوخ الطائفة من أهل قبرفيق من أعمال رندة وكان معتزلي المذهب فرأيته يمنع من التخلق بالقيومية فرددته عن ذلك من مذهبه فإنه كان يقول بخلق الأفعال للعباد فلما رجع إلى قولنا وأبنت له معنى قوله تعالى الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ فقد أثبت لهم درجة في القيومية وكان قد أتى إلى زيارتنا فلما رجع إلى بلده مشيت إلى زيارته في بلده فرددته وجميع أصحابه عن مذهبه في خلق الأفعال فشكر الله على ذلك رحمه الله فيتخيل من لا معرفة له بالحقائق أنها من خصائص الحق ولا فرق عندنا بينها وبين سائر الأسماء الإلهية كلها في التخلق بها على ما تعطيه حقيقة الخلق كما هي لله بحسب ما تعطيه ذاته تعالى وتقدس‏\n\n\n### [السهر أحد الأركان التي قام عليها بيت الأبدال‏]\n\n\nوالسهر من أحد الأربعة الأركان التي قام عليها بيت الأبدال وهي السهر والجوع والصمت والعزلة وقد أفردنا لمعرفة هذه الأربعة جزءا عملناه بالطائف سميناه حلية الأبدال ونظمناها في أبيات في الجزء المذكور سؤال صاحبي عبد الله بدر الخادم ومحمد بن خالد الصدفي وهذه هي الأبيات‏\n\n\n> يا من أراد منازل الأبدال *** من غير قصد منه للأعمال‏\n\n\n> لا تطمعن بها فلست من أهلها *** إن لم تزاحمهم على الأحوال‏\n\n\n> بيت الولاية قسمت أركانه *** ساداتنا فيه من الأبدال‏\n\n\n> ما بين صمت واعتزال دائم *** والجوع والسهر النزيه العالي‏\n\n\n### [من تنام عينه ولا ينام قلبه‏]\n\n\nفجعلوا السهر ركنا من أركان المقام الذي يكون من صفات الأبدال وآيتهم من كتاب الله تعالى سيدة آي القرآن الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ ولا نَوْمٌ إلى قوله تعالى ولا يَؤُدُهُ حِفْظُهُما وهُوَ الْعَلِيُّ الْعَظِيمُ فانظر ما أعجب هذه الآية ولهذه الصفة عنت الوجوه منا والمراد بالوجوه حقائقنا إذ وجه الشي‏ء حقيقته فقال تعالى وعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ وقال كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ فإذا لم يحفظ العبد بسهر قلبه ذاته الباطنة كما يحفظ بسهر عينه ذاته الظاهرة وإن كان نائما فيكون ممن ينام عينه ولا ينام قلبه ويحفظ غيره بحفظه فما سهر من ليست هذه صفته وتكون الخمسة من الأعداد أتم منه في مقامها في حفظها نفسها وغيرها\n\n\n### [من له درجة الخمسة من العدد هو المتخلق بالقيومية]\n\n\nومن لا يقدر أن يكون له درجة الخمسة من العدد وهي جزء مما لا يتناهى فإنها جزء من العدد والعدد لا نهاية له فكيف يتمكن له أن يتخلق بالقيومية مطلقا ليس ذلك في وسع البشر مثل الكلام سواء وغاية من يقوم بها قطب الوقت فإن له الأكثر فيها من سواه فالذي يتعين علينا حفظ هذه الصفة فنحن نسهر لحفظ الكون وإقامته ما يلزمنا أكثر من هذا والله حفيظ عليم لا نحن فإذا قامت هذه الصفة بنا فقد وفينا المقام حقه‏\n\n\n### [صاحب مقام السهر حافظ كل شي‏ء بعين الله الحافظة لكل شي‏ء]\n\n\nفينبغي لصاحب هذا المقام إذا سهر أن يسهر بعين الله وعين الله حافظته بلا شك الحفظ الذي يعلمه الله لا الحفظ العرضي فإن الله تعالى ما رأيناه يحفظ على كل عين صورتها بل الواقع غير ذلك وهو مطلق الحفظ فاذن ليس الحفظ ما يتخيل من حفظ الصور على أعيانها وإنما ينظر صاحب هذا المقام إلى الحفظ المطلق وينظر في المحفوظ وإذا كان من عالم التغيير والاستحالات فيحفظ عليه التغيير والاستحالات فإن لم يتغير ولا استحال فما حفظ عليه ما تستحقه ذاته فينظر صاحب هذا المقام مراتب الموجودات ويكون حفظه في سهره بحسب ما تعطيه رتبة ذلك العالم ولا يلتفت إلى أغراض أشخاص ذلك النوع فإن الضدين لا يجتمعان فإذا أراد السكون أن يحفظ عليه ذاته في ساكن معين لم يتمكن أن يجيبه إلى ذلك فإن الساكن مأمور من الله بتغيير حاله من سكون إلى قيام لصلاة أو لأمر مشروع أو طبع كقضاء حاجته ولا يكون هذا إلا بأن يتغير وينتقل إلى حكم الحركة وكذلك المتحرك إذا توجه عليه الأمر بالسكون فالحافظ هنا إنما يحفظ عليه حكم التغيير فإن لم يحفظ عليه ذلك فما سهر ولا تحقق بالقيومية فهذا ما يعطيه مقام السهر وحاله فافهم فإنه ما من مقام وإلا ويتسع المجال فيه لو تكلمنا على تفاصيله لكن نومئ إلى ما لا بد منه في كل مقام وحال بأمر كلي تقع به المنفعة ويندرج فيه كل تفصيل يحتمله فإذا بحثت عليه في كلامنا تجدنا قد وفينا المقصود انتهى الجزء السادس والتسعون‏\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "## (Chapter Ninety-Eight: Concerning the Gnosis of the Station of Vigilance)\n\nHe whose eye does not sleep, and who does not possess\nA heart that sleeps—that is the Unique, the One (الأحد).\n\nHis station is Preservation, and the Fixed Entities (الأعيان) worship Him,\nNeither nature (طبع) nor body (جسد) restricts Him.\n\nHe is the Imam, yet His imamate does not flow\nThrough the worlds, so no one attains Him.\nHis Throne (Kursi) stores the universes within it, and\nThe preservation of anything encompassed by number does not weary Him.\n\n### [Sustaining (القيومية) belongs to Allah according to what His Essence grants, and to the servant according to what his essence grants.]\n\nThis station is called the station of Sustaining (القيومية). Our companions differed on whether one can ethically embody (يتخلق) this attribute or not. I met Abu Abd Allah ibn Junayd, one of the shaykhs of the Sufi community from Qabrafiq, which is part of the district of Ronda. He was Mu'tazili in doctrine, and I saw that he forbade the ethical embodiment of Sustaining (القيومية). I refuted him on this point based on his own doctrine, for he held that the actions of the servants are created by them. When he returned to our view, and I clarified for him the meaning of the Almighty’s saying: <<الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ>> (Men are maintainers/sustainers of women), this established a degree of Sustaining (القيومية) for them. He had come to visit us, and when he returned to his town, I traveled to visit him there. I refuted him and all his companions regarding his doctrine concerning the creation of actions, for which he thanked God—may God have mercy on him.\n\nThose who lack gnosis (معرفة) of the Realities (الحقائق) imagine that this attribute is exclusive to the Real (الحق). However, in our view, there is no difference between it and all the other Divine Names (الأسماء الإلهية) regarding the ethical embodiment of them, according to what the reality of creation (حقيقة الخلق) grants, just as it belongs to God according to what His Exalted and Sanctified Essence (ذاته) grants.\n\n### [Vigilance (السهر) is one of the pillars upon which the house of the Substitutes (الأبدال) is founded.]\n\nVigilance (السهر) is one of the four pillars upon which the house of the Substitutes (الأبدال) is founded: Vigilance, Hunger (الجوع), Silence (الصمت), and Seclusion (العزلة). We dedicated a separate treatise to the gnosis (معرفة) of these four, which we composed in Ta'if and named *Hilyat al-Abdal* (The Ornament of the Substitutes). We also rendered them into verses in that treatise, in response to the request of my two companions, Abd Allah Badr the servant and Muhammad ibn Khalid al-Sadafi. These are the verses:\n\nO you who desire the stations of the Substitutes (الأبدال)\nWithout intending the necessary spiritual works (الأعمال),\n\nDo not covet them, for you are not of their people\nUnless you strive alongside them for the spiritual states (الأحوال).\n\nThe house of Sainthood (الولاية)—its pillars were divided\nAmong our masters, the Substitutes (الأبدال), within it,\n\nBetween silence and perpetual seclusion,\nAnd hunger, and the pure, lofty vigilance (السهر).\n\n### [He whose eye sleeps but whose heart does not sleep.]\n\nThus, they made Vigilance (السهر) a pillar among the pillars of the station (مقام) that constitutes the attributes of the Substitutes (الأبدال). Their sign from the Book of God Almighty is the Mistress of the verses of the Quran: <<الله لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ ولا نَوْمٌ>> (Allah! There is no deity except Him, the Living, the Sustainer. Neither slumber nor sleep overtakes Him) up to His saying: <<ولا يَؤُدُهُ حِفْظُهُما وهُوَ الْعَلِيُّ الْعَظِيمُ>> (And the preservation of both [the heavens and the earth] does not weary Him, and He is the Most High, the Magnificent).\n\nLook at how wondrous this verse is! It is for this Attribute that the faces (الوجوه) among us submit—and by faces, we mean our realities (حقائقنا), since the face of a thing is its reality. Thus, the Almighty said: <<وعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ>> (And [all] faces shall be humbled before the Living, the Sustainer), and He said: <<كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ>> (Everything will perish except His Face/Reality).\n\nIf the servant does not preserve his inner essence (ذاته الباطنة) through the vigilance of his heart, just as he preserves his outer essence (ذاته الظاهرة) through the vigilance of his eye—even if he is asleep—then he is among those whose eye sleeps but whose heart does not sleep, and who preserves others through his preservation. He whose attribute is not this has not truly practiced vigilance (سهر). In that case, the number Five (الخمسة من الأعداد) would be more complete than him in its station regarding the preservation of itself and others.\n\n### [He who possesses the degree of the number Five is the one who ethically embodies Sustaining (القيومية).]\n\nHe who is unable to attain the degree of the number Five—which is a part of the infinite, for it is a part of number, and number has no end—how can he possibly ethically embody Sustaining (القيومية) absolutely? That is not within human capacity, just like speech (الكلام) itself. The utmost attainment in this is reached by the Pole (قطب الوقت), for he possesses the greatest share of it compared to anyone else.\n\nWhat is incumbent upon us is the preservation of this attribute. We maintain vigilance for the preservation and establishment of the cosmos (الكون). Nothing more than this is required of us, for God is the Preserver (حفيظ) and the All-Knowing (عليم), not us. If this attribute is established within us, then we have fulfilled the station's due.\n\n### [The possessor of the station of Vigilance (السهر) is the preserver of everything by the Eye of God, which preserves everything.]\n\nIt is necessary for the possessor of this station, when he maintains vigilance (سهر), to maintain vigilance by the Eye of God. The Eye of God is undoubtedly the Preserver—the preservation that God knows, not accidental preservation. For we have not seen God Almighty preserve the form of every entity (عين) upon that entity; rather, the reality is otherwise, and it is absolute preservation (الحفظ المطلق).\n\nTherefore, preservation is not what is imagined—the preservation of forms upon their essences (أعيانها). Rather, the possessor of this station looks toward absolute preservation and considers the preserved object. If the object belongs to the world of change and transformation (التغيير والاستحالات), then he preserves change and transformation upon it. If it does not change or transform, then what its essence (ذاته) deserves has not been preserved upon it.\n\nThe possessor of this station observes the levels (مراتب) of existing things, and his preservation during his vigilance is according to what the rank (رتبة) of that world grants. He does not pay attention to the specific purposes of the individuals of that type, for opposites do not combine. If stillness (السكون) desired that its essence (ذاته) be preserved upon a specific still object, it would be unable to respond to that, for the still object is commanded by God to change its state from stillness to standing for prayer, or for a lawful matter, or for a natural necessity, such as relieving itself. This cannot happen except by changing and moving to the rule of motion (الحركة). Likewise, the moving object, when the command for stillness is directed upon it. The Preserver here only preserves the rule of change upon it. If he does not preserve that upon it, then he has not maintained vigilance (سهر) nor realized Sustaining (القيومية).\n\nThis is what the station (مقام) of Vigilance and its state (حال) grant. Understand this, for there is no station that does not have a vast scope if we were to speak of its details. However, we point to what is indispensable in every station and state through a universal principle (أمر كلي) by which benefit is achieved and under which every possible detail is subsumed. If you search for this in our discourse, you will find that we have fulfilled the intended purpose.\n\nEnd of the Ninety-Sixth Section. (In the Name of God, the Most Compassionate, the Most Merciful)",
    "ur": "(باب اٹھانوے: مقام سہر (بیداری) کی معرفت میں)\n\nجس کی آنکھ نہیں سوتی اور نہ ہی *** اس کا دل سوتا ہے، وہی واحد (الواحد) احد (الأحد) ہے\nاس کا مقام حفظ (نگہبانی) ہے اور اعیان (الأعیان) اس کی عبادت کرتے ہیں *** اور اسے نہ کوئی طبع (فطرت) قید کرتی ہے اور نہ کوئی جسد (جسم)\nوہ امام ہے، مگر اس کی امامت *** تمام جہانوں میں سرایت نہیں کرتی، لہٰذا کوئی اس پر غالب نہیں آ سکا\nاس کی کرسی میں تمام کائناتیں محفوظ ہیں *** اور کسی بھی چیز کا حفظ (نگہبانی) اسے تھکاتا نہیں جسے کوئی عدد گھیرے ہوئے ہو\n\n[قیومیت (القیومیۃ) اللہ کے لیے اس کے مطابق ہے جو اس کی ذات عطا کرتی ہے، اور بندے کے لیے اس کے مطابق ہے جو اس کی ذات عطا کرتی ہے]\n\nاس مقام کو مقام قیومیت (القیومیۃ) کہا جاتا ہے۔ ہمارے اصحاب میں اختلاف ہے کہ آیا اس سے تخلق (اختیار) کیا جا سکتا ہے یا نہیں۔ میں ابو عبداللہ بن جنید سے ملا، جو طائفہ کے شیوخ میں سے تھے اور رندہ کے علاقے قبرفیق سے تعلق رکھتے تھے، اور معتزلی مذہب رکھتے تھے۔ میں نے دیکھا کہ وہ قیومیت (القیومیۃ) سے تخلق کرنے سے منع کرتے تھے۔ میں نے انہیں ان کے اپنے مذہب کے اصولوں سے اس سے رجوع کروایا، کیونکہ وہ بندوں کے لیے افعال کی تخلیق کے قائل تھے۔ جب وہ ہمارے قول کی طرف لوٹے اور میں نے انہیں اللہ تعالیٰ کے اس فرمان کا معنی واضح کیا: \"الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ\" (مرد عورتوں پر نگہبان ہیں) [النساء: ۳۴]، تو اس سے ان کے لیے قیومیت (القیومیۃ) میں ایک درجہ ثابت ہو گیا۔ وہ ہماری زیارت کے لیے آئے تھے، اور جب وہ اپنے شہر واپس گئے تو میں ان کی زیارت کے لیے ان کے شہر گیا اور انہیں اور ان کے تمام اصحاب کو افعال کی تخلیق کے بارے میں ان کے مذہب سے رجوع کروایا۔ اللہ ان پر رحم فرمائے، انہوں نے اس پر اللہ کا شکر ادا کیا۔ وہ شخص جسے حقائق (الحقائق) کی معرفت (المعرفۃ) نہیں ہے، وہ یہ گمان کرتا ہے کہ یہ (قیومیت) ذات حق (الحق) کی خصوصیات میں سے ہے، جبکہ ہمارے نزدیک اس میں اور دیگر تمام اسماء الٰہیہ میں کوئی فرق نہیں ہے، بشرطیکہ ان سے تخلق (التخلق) اس طرح کیا جائے جو حقیقت خلق (حقیقۃ الخلق) کا تقاضا ہو، جیسا کہ یہ اللہ کے لیے اس کے مطابق ہے جو اس کی ذات تعالیٰ و تقدس عطا کرتی ہے۔\n\n[سہر (بیداری) ان ارکان میں سے ایک ہے جن پر ابدال (الأبدال) کا گھر قائم ہے]\n\nاور سہر (السہر) ان چار ارکان میں سے ایک ہے جن پر ابدال (الأبدال) کا گھر قائم ہے، اور وہ ہیں: سہر، بھوک (الجوع)، خاموشی (الصمت)، اور خلوت (العزلۃ)۔ ہم نے ان چاروں کی معرفت کے لیے ایک الگ جزء مختص کیا ہے جسے ہم نے طائف میں تیار کیا تھا اور اس کا نام \"حلیۃ الأبدال\" رکھا ہے۔ ہم نے اس مذکورہ جزء میں اپنے ساتھیوں عبداللہ بدر الخادم اور محمد بن خالد الصدفی کے سوال پر اسے اشعار میں بھی نظم کیا تھا۔ اور یہ ہیں وہ اشعار:\n\nاے وہ شخص جو ابدال (الأبدال) کے مقامات کا ارادہ رکھتا ہے *** بغیر کسی عمل کے قصد کے\nان کی طمع نہ کر، تو ان کے اہل میں سے نہیں ہے *** اگر تو ان کے احوال (الأحوال) میں ان کے ساتھ مقابلہ نہیں کرتا\nولایت کے گھر کے ارکان تقسیم کیے گئے ہیں *** ہمارے سرداروں میں جو ابدال میں سے ہیں\nدائمی خاموشی (صمت) اور خلوت (اعتزال) کے درمیان *** اور بھوک (جوع) اور پاکیزہ و بلند سہر (بیداری)\n\n[وہ شخص جس کی آنکھ سوتی ہے مگر دل نہیں سوتا]\n\nپس انہوں نے سہر (السہر) کو اس مقام کے ارکان میں سے ایک قرار دیا جو ابدال (الأبدال) کی صفات میں سے ہے، اور ان کی آیت اللہ تعالیٰ کی کتاب میں قرآن کی آیات کی سردار آیت ہے: \"اللَّهُ لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ ولا نَوْمٌ\" (اللہ، اس کے سوا کوئی معبود نہیں، وہ زندہ ہے، سب کو قائم رکھنے والا ہے، نہ اسے اونگھ آتی ہے اور نہ نیند) [البقرۃ: ۲۵۵]، تا آنکہ اللہ تعالیٰ کا یہ فرمان: \"ولا يَؤُدُهُ حِفْظُهُما وهُوَ الْعَلِيُّ الْعَظِيمُ\" (اور نہ ہی ان دونوں کی نگہبانی اسے تھکاتی ہے، اور وہ بلند و بالا، عظمت والا ہے) [البقرۃ: ۲۵۵]۔ پس دیکھو یہ آیت کتنی عجیب ہے۔ اور اسی صفت کے لیے ہم میں سے تمام چہرے جھک گئے، اور چہروں سے مراد ہماری حقائق (حقائقنا) ہیں، کیونکہ کسی شے کا چہرہ اس کی حقیقت ہوتی ہے۔ چنانچہ اللہ تعالیٰ نے فرمایا: \"وعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ\" (اور تمام چہرے حی القیوم کے سامنے جھک گئے) [طٰہٰ: ۱۱۱]، اور فرمایا: \"كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ\" (ہر چیز فنا ہونے والی ہے سوائے اس کی ذات کے) [القصص: ۸۸]۔ پس اگر بندہ اپنے باطنی ذات کو اپنے دل کے سہر (بیداری) سے محفوظ نہ رکھے، جیسا کہ وہ اپنی ظاہری ذات کو اپنی آنکھ کے سہر سے محفوظ رکھتا ہے، اگرچہ وہ سو رہا ہو، تو وہ ان لوگوں میں سے ہو گا جن کی آنکھ سوتی ہے مگر دل نہیں سوتا، اور وہ اپنے حفظ (نگہبانی) کے ذریعے دوسروں کو محفوظ رکھتا ہے۔ پس وہ شخص سہر (بیداری) نہیں کرتا جس کی یہ صفت نہ ہو، اور اعداد میں سے پانچ کا عدد اس سے زیادہ کامل ہو گا اپنے مقام میں، اپنے آپ کو اور دوسروں کو محفوظ رکھنے میں۔\n\n[جس شخص کو عدد میں سے پانچ کا درجہ حاصل ہو، وہی قیومیت (القیومیۃ) سے متخلق ہوتا ہے]\n\nاور جو شخص عدد میں سے پانچ کا درجہ حاصل کرنے کی قدرت نہیں رکھتا، جو کہ لامتناہی کا ایک جز ہے، کیونکہ یہ عدد کا ایک جز ہے اور عدد کی کوئی انتہا نہیں، تو وہ مطلق قیومیت (القیومیۃ) سے کیسے متخلق ہو سکتا ہے؟ یہ بشر کی وسعت میں نہیں ہے، یہ کلام کی طرح ہے۔ اور جو شخص اس پر قائم ہوتا ہے، اس کی انتہا قطب الوقت (قطب الوقت) ہے، کیونکہ اسے دوسروں کے مقابلے میں اس میں زیادہ حصہ ملتا ہے۔ پس ہم پر اس صفت کا حفظ (نگہبانی) متعین ہے، لہٰذا ہم کون (الکون) کے حفظ اور اس کے قیام کے لیے سہر (بیداری) کرتے ہیں، اس سے زیادہ ہم پر لازم نہیں ہے۔ اور اللہ ہی حفیظ (الحفیظ) اور علیم (العلیم) ہے، نہ کہ ہم۔ پس جب یہ صفت ہم میں قائم ہو جاتی ہے، تو ہم نے مقام کا حق ادا کر دیا۔\n\n[صاحب مقام سہر (بیداری) ہر چیز کو اللہ کی نگہبان آنکھ سے محفوظ رکھتا ہے]\n\nپس اس مقام کے صاحب کو چاہیے کہ جب وہ سہر (بیداری) کرے تو اللہ کی آنکھ سے سہر کرے، اور اللہ کی آنکھ بلا شک و شبہ نگہبان ہے، وہ حفظ جو اللہ جانتا ہے، نہ کہ عرضی حفظ۔ کیونکہ ہم نے نہیں دیکھا کہ اللہ تعالیٰ ہر آنکھ پر اس کی صورت کو محفوظ رکھتا ہے، بلکہ حقیقت اس کے برعکس ہے، اور وہ مطلق حفظ (الحفظ المطلق) ہے۔ لہٰذا، حفظ وہ نہیں ہے جو صورتوں کو ان کے اعیان (أعیان) پر محفوظ رکھنے سے گمان کیا جاتا ہے۔ بلکہ اس مقام کا صاحب مطلق حفظ کی طرف دیکھتا ہے اور محفوظ شے میں غور کرتا ہے۔ اور اگر وہ تغیرات اور تبدیلیوں کے عالم (عالم التغییر والاستحالات) سے ہو، تو وہ اس پر تغیر اور تبدیلیوں کو محفوظ رکھتا ہے۔ اگر وہ متغیر نہ ہو اور نہ بدلے، تو اس پر وہ چیز محفوظ نہیں رکھی گئی جو اس کی ذات کا حق ہے۔ پس اس مقام کا صاحب موجودات کے مراتب کو دیکھتا ہے اور اس کا حفظ (نگہبانی) اس کے سہر (بیداری) میں اس کے مطابق ہوتا ہے جو اس عالم کا مرتبہ عطا کرتا ہے، اور وہ اس نوع کے اشخاص کے اغراض کی طرف توجہ نہیں کرتا۔ کیونکہ دو ضدیں جمع نہیں ہو سکتیں۔ پس اگر ساکن یہ چاہے کہ اس کی ذات کو ایک معین ساکن حالت میں محفوظ رکھا جائے، تو وہ (صاحب مقام) اسے اس کی اجازت نہیں دے سکتا۔ کیونکہ ساکن کو اللہ کی طرف سے حکم ہے کہ وہ اپنی حالت کو سکون سے قیام کی طرف تبدیل کرے، خواہ نماز کے لیے ہو یا کسی شرعی یا طبعی امر کے لیے، جیسے اپنی حاجت پوری کرنا۔ اور یہ تب ہی ہو سکتا ہے جب وہ متغیر ہو اور حرکت کے حکم کی طرف منتقل ہو۔ اسی طرح متحرک بھی جب اس پر سکون کا حکم آتا ہے۔ پس یہاں حافظ (نگہبان) صرف تغیر کے حکم کو محفوظ رکھتا ہے۔ اگر وہ اس پر یہ محفوظ نہ رکھے، تو اس نے نہ سہر کیا اور نہ ہی قیومیت (القیومیۃ) سے تحقق حاصل کیا۔ پس یہ وہ ہے جو مقام سہر (السہر) اور اس کا حال عطا کرتا ہے۔ پس سمجھ لو، کیونکہ کوئی مقام ایسا نہیں جس میں میدان وسیع نہ ہو اگر ہم اس کی تفصیلات پر بات کریں، لیکن ہم ہر مقام اور حال میں صرف اس کلی امر کی طرف اشارہ کرتے ہیں جو ضروری ہے، جس سے فائدہ حاصل ہو اور جس میں ہر ممکن تفصیل شامل ہو جائے۔ پس اگر تم ہمارے کلام میں اس پر تحقیق کرو گے تو تم پاؤ گے کہ ہم نے مقصود کو پورا کر دیا ہے۔\n\nچھانوےواں جزء ختم ہوا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے)",
    "fa": "(باب نود و هشتم در معرفت مقام سهر (بیداری))\n\nآن کس که چشمش به خواب نرود و قلبی ندارد که بخوابد، او همان واحد احد است.\nمقام او حفظ است و اعیان (حقایق ثابت) او را می‌پرستند، و هیچ طبع و جسدی او را مقید نمی‌سازد.\nاو امام است، اما امامت او در جهان‌ها جاری نمی‌شود، پس کسی به او دست نمی‌یابد.\nکرسی اوست که اکوان (جهان‌ها) در آن ذخیره می‌شوند، و حفظ هیچ چیزی که عدد آن را در بر گیرد، او را خسته نمی‌کند.\n\n[قیومیت از آنِ حق است بر اساس آنچه ذاتش اقتضا می‌کند، و از آنِ بنده است بر اساس آنچه ذاتش اقتضا می‌کند]\n\nاین مقام، مقام قیومیت (القيومية) نامیده می‌شود. اصحاب ما در این باره اختلاف کرده‌اند که آیا می‌توان به آن تخلق (تخلق) یافت یا خیر. من با ابوعبدالله بن جنید، از شیوخ طایفه اهل قبرفیق از توابع رنده، ملاقات کردم. او معتزلی مذهب بود و دیدم که از تخلق به قیومیت منع می‌کرد. من او را از این رأی بر اساس مذهب خودش بازگرداندم، زیرا او قائل به خلق افعال برای بندگان بود. هنگامی که به قول ما بازگشت و من معنای این سخن خداوند متعال را برایش روشن ساختم: الرِّجالُ قَوَّامُونَ عَلَى النِّساءِ (مردان سرپرست زنان هستند)، در واقع درجه‌ای از قیومیت را برای آنان اثبات کرده بود. او برای زیارت ما آمده بود. هنگامی که به شهر خود بازگشت، من برای زیارت او به شهرش رفتم و او و تمامی اصحابش را از مذهبشان در خلق افعال بازگرداندم. خداوند او را رحمت کند و بر این امر شکرگزار بود. کسانی که معرفت (المعرفة) به حقایق (الحقائق) ندارند، گمان می‌کنند که این مقام از خصائص حق (الحق) است، در حالی که نزد ما هیچ تفاوتی میان آن و سایر اسماء الهی در تخلق (التخلق) به آن‌ها وجود ندارد، بر اساس آنچه حقیقت خلق اقتضا می‌کند، همان‌گونه که برای خداوند نیز بر اساس آنچه ذات متعالی و مقدسش اقتضا می‌کند، ثابت است.\n\n[سهر یکی از ارکانی است که خانه ابدال بر آن بنا شده است]\n\nسهر (بیداری) یکی از چهار رکنی است که خانه ابدال (الأبدال) بر آن بنا شده است، و آن ارکان عبارتند از: سهر، گرسنگی (جوع)، سکوت (صمت) و عزلت. ما برای شناخت این چهار رکن، جزوه‌ای جداگانه تألیف کردیم که آن را در طائف ساختیم و «حلیة الأبدال» نامیدیم، و آن را در ابیاتی در همان جزوه به درخواست دوستم عبدالله بدر خادم و محمد بن خالد صدفی به نظم درآوردیم. این ابیات از این قرارند:\n\nای آن که منازل ابدال را می‌خواهی *** بدون آنکه قصدی برای اعمال داشته باشی\nبه آن طمع مبند، که تو از اهل آن نیستی *** اگر در احوال با آنان رقابت نکنی\nخانه ولایت ارکانش تقسیم شده است *** سروران ما در آن از ابدال هستند\nمیان سکوت و اعتزال دائمی *** و گرسنگی و سهر (بیداری) پاک و والا.\n\n[کسی که چشمش می‌خوابد ولی قلبش نمی‌خوابد]\n\nپس سهر را رکنی از ارکان مقامی قرار دادند که از صفات ابدال و نشانه آنان از کتاب خداوند متعال است؛ یعنی سرور آیات قرآن: اللَّهُ لا إِلهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ ولا نَوْمٌ (خداوند است که هیچ معبودی جز او نیست، زنده و قیوم است، نه چرت او را می‌گیرد و نه خواب) تا این سخن خداوند متعال: ولا يَؤُدُّهُ حِفْظُهُما وهُوَ الْعَلِيُّ الْعَظِيمُ (و نگهداری آن دو (آسمان‌ها و زمین) او را خسته نمی‌کند و او بلندمرتبه و بزرگ است). پس بنگر که این آیه چقدر شگفت‌انگیز است. و به خاطر این صفت است که وجوه ما خاضع شده‌اند، و منظور از وجوه، حقایق (الحقائق) ماست، زیرا وجه هر شیء، حقیقت آن است. پس خداوند متعال فرمود: وعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ (و چهره‌ها در برابر [خدای] زنده قیوم خاضع شدند). و فرمود: كُلُّ شَيْ‏ءٍ هالِكٌ إِلَّا وَجْهَهُ (هر چیزی جز وجه او نابود شونده است). پس اگر بنده با سهر (بیداری) قلبش، ذات باطنی خود را حفظ نکند، همان‌گونه که با سهر چشمش، ذات ظاهری خود را حفظ می‌کند، هرچند در خواب باشد، در این صورت او از کسانی خواهد بود که چشمش می‌خوابد ولی قلبش نمی‌خوابد و با حفظ خود، دیگری را نیز حفظ می‌کند. کسی که این صفت او نیست، سهر نکرده است، و در این صورت، عدد پنج در مقام خود در حفظ خود و دیگری، کامل‌تر از او خواهد بود.\n\n[کسی که درجه عدد پنج را داراست، همان کسی است که به قیومیت تخلق یافته است]\n\nو کسی که نتواند درجه عدد پنج را داشته باشد، که جزئی از چیزی است که پایان ندارد، زیرا آن جزئی از عدد است و عدد را پایانی نیست، چگونه می‌تواند به طور مطلق به قیومیت (القيومية) تخلق (التخلق) یابد؟ این در توان بشر نیست، مانند کلام (سخن گفتن) است. و نهایت کسی که به آن قیام می‌کند، قطب زمان است، زیرا او بیشترین سهم را در آن نسبت به دیگران دارد. پس آنچه بر ما واجب است، حفظ این صفت است. ما برای حفظ و برپایی کون (الكون) سهر می‌کنیم، اما این بیشتر از آنچه بر ما لازم است، نیست. خداوند حافظ و داناست، نه ما. پس اگر این صفت در ما برقرار شود، حق مقام را ادا کرده‌ایم.\n\n[صاحب مقام سهر، حافظ هر چیزی است به واسطه چشم خداوند که حافظ هر چیزی است]\n\nپس شایسته است که صاحب این مقام، هنگامی که سهر می‌کند، با عین الله (چشم خداوند) سهر کند، و عین الله بی‌شک حافظ اوست. این حفظی است که خداوند آن را می‌داند، نه حفظ عرضی. زیرا ما ندیده‌ایم که خداوند صورت هر شیء را بر عین آن حفظ کند، بلکه واقعیت غیر از این است و آن حفظ مطلق است. بنابراین، حفظ آن نیست که از حفظ صور بر اعیانشان تصور می‌شود، بلکه صاحب این مقام به حفظ مطلق می‌نگرد و در محفوظ نظر می‌کند. و اگر آن محفوظ از عالم تغییر و استحالات (دگرگونی‌ها) باشد، تغییر و استحالات بر آن حفظ می‌شود. اگر تغییر نکند و دگرگون نشود، آنچه را که ذاتش مستحق آن است، بر آن حفظ نکرده است. پس صاحب این مقام به مراتب موجودات می‌نگرد و حفظ او در سهرش بر اساس آنچه رتبه آن عالم اقتضا می‌کند، خواهد بود و به اغراض اشخاص آن نوع توجه نمی‌کند. زیرا دو ضد با هم جمع نمی‌شوند. اگر ساکن بخواهد که ذاتش در یک ساکن معین حفظ شود، نمی‌تواند به این خواسته پاسخ دهد، زیرا ساکن از جانب خداوند مأمور است که حال خود را از سکون به قیام برای نماز یا امری مشروع یا طبعی مانند قضای حاجت تغییر دهد، و این جز با تغییر و انتقال به حکم حرکت ممکن نیست. همچنین متحرک اگر امر به سکون بر او وارد شود. در اینجا، حافظ تنها حکم تغییر را بر آن حفظ می‌کند. اگر این را بر آن حفظ نکند، سهر نکرده و به قیومیت (القيومية) تحقق نیافته است. این چیزی است که مقام سهر و حال آن اقتضا می‌کند، پس بفهم. زیرا هیچ مقامی نیست مگر اینکه اگر درباره جزئیات آن سخن بگوییم، مجال گسترده می‌شود، اما ما به آنچه در هر مقام و حالی ضروری است، با یک امر کلی اشاره می‌کنیم که منفعت از آن حاصل شود و هر جزئیاتی که محتمل است، در آن مندرج گردد. پس اگر در کلام ما به دنبال آن بگردی، خواهی یافت که ما مقصود را به طور کامل ادا کرده‌ایم. پایان جزء نود و ششم.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 3
}