{
  "id": 238,
  "title": {
    "ar": "الباب الثامن والثلاثون ومائتان في الوقت",
    "en": "Chapter Two Hundred and Thirty-Eight: Concerning the Time (الوقت)",
    "ur": "۲۳۸ واں باب وقت (الوقت) کے بیان میں",
    "fa": "باب دویست و سی و هشتم در وقت (الوقت)"
  },
  "content": {
    "ar": "## «الباب الثامن والثلاثون ومائتان في الوقت»\n\n\n> الوقت ما أنت موصوف به أبدا *** فلا تزال بحكم الوقت مشهودا\n\n\n> فالله يجعل وقتي منه مشهده *** فإن في الوقت مذموما ومحمودا\n\n\n> له الشئون من الرحمن وهي بنا *** تقوم شرعا وإيمانا وتوحيدا\n\n\n### [أن حقيقة الوقت هو أمر وجودي بين عدمين‏]\n\n\nاعلم أن القوم اصطلحوا على إن حقيقة الوقت ما أنت به وعليه في زمان الحال وهو أمر وجودي بين عدمين وقيل‏\nالوقت ما يصادفهم من تصريف الحق لهم دون ما يختارون لأنفسهم وقيل الوقت ما يقتضيه الحق ويجريه عليك وقيل الوقت مبرد يسحقك ولا يمحقك وقيل الوقت كل ما حكم عليك ومدار الكل على أنه الحاكم ومستند الوقت في الإلهية وصفه نفسه تعالى إنه كل يوم في شأن فالوقت ما هو به في الأصل إنما يظهر وجوده في الفرع الذي هو الكون فتظهر شئون الحق في أعيان الممكنات فالوقت على الحقيقة ما أنت به وما أنت به هو عين استعدادك فلا يظهر فيك من شئون الحق التي هو عليها إلا ما يطلبه استعدادك فالشأن محكوم عليه بالأصالة فإن حكم استعداد الممكن بالإمكان أدى إلى أن يكون شأن الحق فيه الإيجاد أ لا ترى أن المحال لا يقبله فأصل الوقت من الكون لا من الحق وهو من التقدير ولا حكم للتقدير إلا في المخلوق فصاحب الوقت هو الكون فالحكم حكم الكون كما قررنا في ظهور الحق في أعيان الممكنات بحسب ما تعطيه من الاستعداد فتنوعه بها وهو في نفسه الغني عن العالمين ولما كانت أذواق القوم في الوقت تختلف لذلك اختلفت عباراتهم عنه والوقت حقيقة كل ما عبروا به عنه وهكذا كل مقام وحال ليس يقصدون في التعبير عنه الحد الذاتي وإنما يذكرونه بنتائجه وما يكون عنه مما لا يكون إلا فيمن ذلك المقام أو الحال نعته وصفته فمن أحكامه فيهم وفي غيرهم أن الله قد رتب لهم أمورا معتادة يتصرفون فيها بحكم العادة مما لا جناح عليهم فيها أو مما قد اقترن به خطاب من الحق بأنه قربة فيختارون لأنفسهم فعل ذلك على جهة القربة إن كان من القرب أو على كونه مرفوع الحرج فيصادفهم من الحق أمر لم يكن في خاطرهم ولا اختاروه لأنفسهم فيعلمون إن الوقت أعطى ذلك الأمر وأن الله اختاره لهم فإنه القائل ورَبُّكَ يَخْلُقُ ما يَشاءُ أي يقدر ويوجد ثم قال ويَخْتارُ ونفى أن تكون لهم الخيرة فقال ما كانَ لَهُمُ الْخِيَرَةُ وعندنا إن ما هنا اسم وهو في موضع نصب على أنه مفعول بقوله ويَخْتارُ الذي كان لهم الخيرة يعني فيه فإذا علم العبد ذلك سلم الحكم فيه لله واستسلم وكان بحكم وقت ما يمضيه الله فيه لا بحكم ما يختاره لنفسه في المنشط والمكره ويرى أن الكل له فيه خير فيعامله الله في كل ذلك بخير فإن كان وقته يعطي نعمة وكان عقده مع الله مثل هذا رزقه الشكر عليها والقيام بحق الله فيها وأعين عليها وإن كان بلاء رزق الصبر عليه والرضاء به وجعل الله له مخرجا من حَيْثُ لا يَحْتَسِبُ كرجل يريد أن يسبح الله مائة ألف تسبيحة فيحتاج إلى زمان طويل في ذلك مع ما فيه من التعب والتفرغ إليه من الحضور فيعثر\n\n\nعلى خبر صدق أن النبي صلى الله عليه وسلم جعل قول الإنسان سبحان الله عدد خلقه سبحان الله زنة عرشه سبحان الله رضاء نفسه سبحان الله مداد كلماته ثلاث مرات والحمد لله مثل ذلك والله أكبر مثل ذلك ولا إله إلا الله مثل ذلك أفضل مما أراده هذا العبد فقال هذا القول الذي جاءه بحكم المصادفة وإن لم يكن عنده منه خبر وترك ما كان يريد أن يذكره وعلم إن الذي اختار الله له بهذا التعريف في هذا الوقت أعظم مما اختاره لنفسه وقد وقع هذا من رسول الله صلى الله عليه وسلم مع عجوز مر عليها والحديث مشهور\n\n\nفإذا اقتضى الحق أمرا وكان له بك عناية أجراه عليك ورزقك القيام بحقه فالعاقل من أهل الله من يرى أن الخير كله الذي يكون للعبد هو فيما اقتضاه الحق فيما شرع لعباده وبعث به رسوله صلى الله عليه وسلم فمن استعمله الله في اقتضاء الحق المشروع فما بعد عناية الله به من عناية لمن عقل عن الله فالوقت المعلوم من جانب الحق هو عين ما خاطبك به الشرع في الحال فكن بحسب قول الشارع في كل حال تكن صاحب وقت وهو علامة على أنك من السعداء عند الله وهذا عزيز الوجود في أهل الله هو لآحاد منهم من أهل المراقبة لا يغفلون عن حكم الله في الأشياء وهنا زلت أقدام طائفة من أهل الحضور مع الله في كل شي‏ء فهم لا يغفلون عن الله طرفة عين ولكنهم يغفلون عن حكم الله في الأشياء أو في بعضها أو أكثرها فمن لم يغفل عن حكم الله في الأشياء فما غفل عن الله فقد جمعوا بين الحضور مع الله ومع حكمه فهم أكثر علما وأعظم سعادة وهم أصحاب الوقت الذي يعطي السعادة وبعض رجال الله علم إن الله لا يعدم الأشياء القائمة بأنفسها بعد وجودها ولا يتصف بإعدام أحوالها ولا أعراضها بعد وجودها وإنما الأشياء تكون على أحوال فتزول تلك الأحوال عنها فيخلع الله عليها أحوالا غيرها أمثالا كانت أو أضدادا مع جواز إعدام الأشياء بمسكه الإمداد بما به بقاء أعيانها لكن قضى القضية أن لا يكون الأمر إلا هكذا ولذلك قال إِنْ يَشَأْ يُذْهِبْكُمْ ويَأْتِ بِخَلْقٍ جَدِيدٍ ولكن ما فعل فإن الإرادة والمشيئة ما تحدث له إذ ليس محلا للحوادث فمشيئته‏\nأحدية التعلق لكنه في الأشياء بين أن يجمعها أو يفرقها كلا أو بعضا وهي الأكوان فالوقت على الحقيقة عند الكامل جمع وتفرقة دائما ومن الناس من يشهد التفرقة خاصة في الجمع ولا يشهد جمع التفرقة فيتخيل إن ذلك عين الوقت فإذا سئل عن الوقت يشبهه بالمبرد فيقول الوقت مبرد يسحقك ولا يمحقك يقول يفرق جمعيتك ولا يذهب عينك فمن عرف الوقت وأن الحكم له فيه سكن تحت ما حكم به عليه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Thirty-Eight: Concerning The Moment (al-Waqt)\n\nThe Moment is that by which you are eternally described,\nSo you cease not to be witnessed by the ruling of The Moment.\n\nMay Allah make my Moment a witnessing from Him,\nFor in The Moment there is that which is blameworthy and that which is praiseworthy.\n\nTo Him belong the Affairs (al-Shu'un) from the All-Merciful, and they, through us,\nAre established as Law (Shar'), Faith (Iman), and Unity (Tawhid).\n\n### [That the Reality of The Moment (al-Waqt) is an Existential Matter between Two Non-existences]\n\nKnow that the People [Sufis] have agreed by convention that the Reality of The Moment (حقيقة الوقت) is that by which you are, and upon which you stand, in the time of the present state (الحال). It is an existential matter (أمر وجودي) between two non-existences (عدمين). It was also said: The Moment is that which befalls them from the disposal of The Real (الحق) for them, not what they choose for themselves. And it was said: The Moment is what The Real necessitates and causes to flow over you. And it was said: The Moment is a file (مبرد) that grinds you down but does not annihilate you. And it was said: The Moment is everything that rules over you. The pivot of all these definitions is that He [The Real] is the Ruler.\n\nThe basis of The Moment in Divinity is His own description of Himself, exalted is He, that <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [a Divine] Affair). Thus, The Moment is what He is essentially (في الأصل), but its existence only appears in the derivative, which is the Cosmos (الكون). The Affairs (شئون) of The Real then manifest in the Fixed Entities (أعيان الممكنات).\n\nThe Moment, in reality, is what you are, and what you are is the very essence of your Preparedness (استعدادك). Therefore, nothing of the Affairs of The Real manifests in you except what your Preparedness demands. The Affair (الشأن) is ruled by the origin. If the Preparedness of the contingent entity rules by contingency (الإمكان), this leads to the Affair of The Real within it being the act of bringing into existence (الإيجاد). Do you not see that the impossible does not accept it?\n\nThus, the origin of The Moment is from the Cosmos (الكون), not from The Real (الحق). It stems from Predetermination (التقدير), and Predetermination has no ruling except in the created being (المخلوق). The master of The Moment is the Cosmos, so the ruling is the ruling of the Cosmos, as we established regarding the manifestation of The Real in the Fixed Entities (أعيان الممكنات) according to the Preparedness they grant, thereby diversifying Him, while He Himself is <<الْغَنِيُّ عَنِ الْعَالَمِينَ>> (The Independent of the worlds).\n\nSince the spiritual tastes (أذواق) of the People concerning The Moment differ, their expressions regarding it have varied. The Moment is, in reality, everything by which they have expressed it. This is true for every spiritual station (مقام) and state (حال); in expressing it, they do not intend the essential definition (الحد الذاتي), but rather mention it by its results and what arises from it—results that only occur in the one whose description and attribute is that station or state.\n\nAmong its rulings upon them and others is that Allah has arranged for them customary matters in which they act according to habit, matters concerning which there is no blame upon them, or matters associated with a Divine address (خطاب من الحق) indicating that it is an act of proximity (قربة). They choose to perform this for themselves as an act of proximity, if it is among the acts of proximity, or on the basis that the constraint is lifted. Then, an affair from The Real befalls them, which was neither in their minds nor chosen by them. They then know that The Moment granted that affair and that Allah chose it for them.\n\nFor He is the One who says: <<وَرَبُّكَ يَخْلُقُ مَا يَشَاءُ>> (And your Lord creates what He wills)—meaning, He decrees and brings into existence—then He said: <<وَيَخْتَارُ>> (And He chooses). He negated that they possess the choice (الخيرة) when He said: <<مَا كَانَ لَهُمُ الْخِيَرَةُ>> (The choice was not theirs). In our view, the word *mā* (ما) here is a noun, in the accusative case (نصب) as the object of the verb *wa yakhtāru* (وَيَخْتَارُ), meaning that which was the object of their choice.\n\nWhen the servant knows this, he submits the ruling therein to Allah and surrenders. He lives according to the ruling of the Moment (وقت) that Allah executes through him, not according to what he chooses for himself, whether in ease or hardship. He sees that all of it contains good for him, and Allah deals with him in all of that with goodness. If his Moment grants a blessing (نعمة), and his covenant with Allah is of this nature, he is granted gratitude (الشكر) for it, the fulfillment of Allah’s right concerning it, and assistance in it. If it is a trial (بلاء), he is granted patience (الصبر) concerning it and contentment (الرضاء) with it, and Allah makes for him a way out <<مِنْ حَيْثُ لَا يَحْتَسِبُ>> (from where he does not expect).\n\n[This is] like a man who wishes to glorify Allah (يسبح الله) one hundred thousand times, which requires a long time, along with the fatigue involved and the need for presence (الحضور) to dedicate himself to it. He then stumbles upon a truthful report that the Prophet, peace and blessings be upon him, considered a person’s saying: *Subhan Allah ‘adada khalqihi* (Glory be to Allah, the number of His creation), *Subhan Allah zinata ‘arshihi* (Glory be to Allah, the weight of His Throne), *Subhan Allah ridā’a nafsihi* (Glory be to Allah, the pleasure of His Self), *Subhan Allah midāda kalimātihi* (Glory be to Allah, the ink of His words)—said three times—and *Al-Hamdu Lillah* (Praise be to Allah) likewise, and *Allahu Akbar* (Allah is Greater) likewise, and *Lā ilāha illā Allah* (There is no god but Allah) likewise, to be superior to what this servant intended. So he utters this saying, which came to him by way of coincidence (المصادفة), even if he had no prior knowledge of it, and he abandons what he intended to recite. He knows that what Allah chose for him through this definition in this Moment is greater than what he chose for himself. This incident occurred with the Messenger of Allah, peace and blessings be upon him, when he passed by an old woman, and the hadith is well-known.\n\nTherefore, if The Real necessitates an affair and has care (عناية) for you, He causes it to flow over you and grants you the fulfillment of His right concerning it. The wise person among the People of Allah (أهل الله) is he who sees that all the good that comes to the servant lies in what The Real has necessitated within the Divine Law (الشرع) He prescribed for His servants and with which He sent His Messenger, peace and blessings be upon him. For the one whom Allah employs in the necessity of the prescribed Law—what care could be greater than Allah’s care for him, for those who understand from Allah?\n\nThe known Moment (الوقت المعلوم) from the side of The Real is the very thing with which the Divine Law (الشرع) addresses you in the present state (الحال). Be according to the saying of the Lawgiver in every state, and you will be a Master of the Moment (صاحب وقت). This is a sign that you are among the fortunate ones (السعداء) in the sight of Allah. This is rare among the People of Allah; it belongs only to a few of them, those who are people of Vigilance (المراقبة) who do not neglect Allah’s ruling concerning things.\n\nIt is here that the feet of a group of the People of Presence (أهل الحضور) with Allah in everything have slipped. They do not neglect Allah for the blink of an eye, but they neglect Allah’s ruling concerning things, or concerning some or most of them. Whoever does not neglect Allah’s ruling concerning things has not neglected Allah. They have combined Presence with Allah and Presence with His ruling. They are greater in Knowledge (علما) and mightier in felicity (سعادة), and they are the Masters of the Moment (أصحاب الوقت) that grants felicity.\n\nSome men of Allah know that Allah does not annihilate things that subsist by themselves after their existence, nor is He described by the annihilation of their states (أحوالها) or their accidents (أعراضها) after their existence. Rather, things exist in states, and those states depart from them, and Allah clothes them in other states, whether they be similar or opposite. This is despite the possibility of annihilating things by withholding the sustenance (الإمداد) by which their essences (أعيانها) subsist. However, the Decree (القضية) has ruled that the matter shall only be thus. For this reason, He said: <<إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ>> (If He wills, He can do away with you and bring forth a new creation). But He has not done so, for Will (الإرادة) and Willing (المشيئة) do not newly occur for Him, as He is not a locus for occurrences (الحوادث). His Willing (مشيئته) is singular in its relation (أحدية التعلق). However, concerning things, He is between gathering them or separating them, wholly or partially, and these are the Cosmoses (الأكوان).\n\nTherefore, The Moment (الوقت), in reality, according to the Perfect Human (الكامل), is perpetually a gathering (جمع) and a separation (تفرقة). Among people, there are those who witness separation specifically within gathering, but do not witness the gathering of separation. They imagine that this is the very essence of The Moment. When asked about The Moment, they liken it to a file, saying: \"The Moment is a file (مبرد) that grinds you down but does not annihilate you.\" Meaning, it separates your collectedness (جمعيتك) but does not remove your essence (عينك). Whoever knows The Moment and that the ruling belongs to it, settles under what it rules over him. And <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو اڑتیس: وقت کے بیان میں\n\nوقت وہ ہے جس سے تو ہمیشہ موصوف ہے\nپس تو وقت کے حکم سے ہمیشہ مشہود (شہود) رہتا ہے\nپس اللہ میرے وقت کو اپنے مشاہدے سے بنا دے\nکیونکہ وقت میں مذموم (قابل مذمت) بھی ہے اور محمود (قابل تعریف) بھی\nرحمٰن کی شانیں (شئون) اسی کے لیے ہیں اور وہ ہمارے ذریعے\nشریعت، ایمان اور توحید کے طور پر قائم ہوتی ہیں۔\n\n[کہ حقیقت وقت دو عدموں کے درمیان ایک وجودی امر ہے]\n\nجان لو کہ اہل تصوف (القوم) نے اس بات پر اتفاق کیا ہے کہ حقیقت وقت وہ ہے جس کے ساتھ اور جس پر تم موجودہ زمانے میں ہو، اور یہ دو عدموں کے درمیان ایک وجودی امر (الوجود) ہے۔ اور کہا گیا ہے کہ وقت وہ ہے جو ذات حق (الحق) کی طرف سے ان پر تصرف کے طور پر وارد ہوتا ہے، نہ کہ وہ جو وہ اپنے لیے خود اختیار کرتے ہیں۔ اور کہا گیا ہے کہ وقت وہ ہے جس کا حق تقاضا کرتا ہے اور اسے تم پر جاری کرتا ہے۔ اور کہا گیا ہے کہ وقت ایک ریتی (مبرد) ہے جو تمہیں گھساتی ہے مگر مٹاتی نہیں۔ اور کہا گیا ہے کہ وقت وہ سب کچھ ہے جو تم پر حکم لگائے۔ اور ان سب کا محور اس بات پر ہے کہ وہی حاکم ہے۔ اور الوہیت میں وقت کا ماخذ خود ذات حق کا یہ وصف ہے کہ وہ **كُلَّ يَوْمٍ فِي شَأْنٍ** (ہر دن ایک نئی شان میں ہے)۔ پس وقت جو اصل میں وہ (ذات حق) ہے، اس کا وجود صرف فرع میں ظاہر ہوتا ہے جو کہ کون (الکون) ہے۔ پس حق کی شانیں ممکنات کے اعیان میں ظاہر ہوتی ہیں۔ لہٰذا، حقیقت میں وقت وہ ہے جس کے ساتھ تم ہو، اور جس کے ساتھ تم ہو وہ تمہاری استعداد (الاستعداد) کا عین ہے۔ پس تم میں حق کی شانوں میں سے صرف وہی ظاہر ہوتا ہے جس کا تمہاری استعداد تقاضا کرتی ہے۔ پس شان پر اصالتاً حکم لگایا گیا ہے۔ اگر ممکن کی استعداد نے امکان کا حکم دیا، تو اس کا نتیجہ یہ نکلا کہ حق کی شان اس میں ایجاد (وجود بخشنا) ہو۔ کیا تم نہیں دیکھتے کہ محال اسے قبول نہیں کرتا؟ پس وقت کی اصل کون (الکون) سے ہے نہ کہ حق سے، اور یہ تقدیر سے ہے، اور تقدیر کا حکم صرف مخلوق میں ہوتا ہے۔ پس صاحب وقت کون (الکون) ہے۔ لہٰذا حکم کون کا حکم ہے، جیسا کہ ہم نے ممکنات کے اعیان میں حق کے ظہور کے بارے میں طے کیا ہے، جو اس استعداد کے مطابق ہوتا ہے جو وہ عطا کرتے ہیں، پس حق ان کے ذریعے متنوع ہوتا ہے، حالانکہ وہ بذات خود **الْغَنِيُّ عَنِ الْعَالَمِينَ** (تمام جہانوں سے بے نیاز) ہے۔\n\nاور چونکہ اہل تصوف (القوم) کے وقت کے بارے میں ذوق مختلف تھے، اس لیے ان کی عبارات بھی اس کے بارے میں مختلف ہو گئیں۔ اور وقت حقیقت میں وہ سب کچھ ہے جس کے ذریعے انہوں نے اس کا اظہار کیا۔ اور اسی طرح ہر مقام اور حال کے بارے میں بھی ہے؛ وہ اس کی تعبیر میں اس کی ذاتی تعریف (الحد الذاتی) کا ارادہ نہیں کرتے، بلکہ وہ اسے اس کے نتائج اور اس سے پیدا ہونے والی چیزوں کے ذریعے بیان کرتے ہیں، جو صرف اسی شخص میں ہوتی ہیں جس کا وہ مقام یا حال وصف ہو۔ پس ان میں اور دوسروں میں اس کے احکام میں سے یہ ہے کہ اللہ نے ان کے لیے کچھ معمول کے امور مقرر کیے ہیں جن میں وہ عادت کے حکم سے تصرف کرتے ہیں، جن میں ان پر کوئی حرج نہیں، یا وہ امور جن کے ساتھ حق کی طرف سے یہ خطاب جڑا ہوا ہے کہ وہ قربت کا ذریعہ ہیں۔ پس وہ اپنے لیے اس فعل کو قربت کی نیت سے اختیار کرتے ہیں اگر وہ قربتوں میں سے ہو، یا اس بنیاد پر کہ اس میں کوئی حرج نہیں ہے۔ پھر ان پر حق کی طرف سے کوئی ایسا امر وارد ہوتا ہے جو ان کے خیال میں نہیں تھا اور نہ ہی انہوں نے اسے اپنے لیے اختیار کیا تھا، تو وہ جان لیتے ہیں کہ وقت نے یہ امر عطا کیا ہے اور اللہ نے اسے ان کے لیے چنا ہے۔ کیونکہ وہی فرماتا ہے: **وَرَبُّكَ يَخْلُقُ مَا يَشَاءُ** (اور تمہارا رب جو چاہتا ہے پیدا کرتا ہے) یعنی مقدر کرتا ہے اور وجود بخشتا ہے۔ پھر فرمایا: **وَيَخْتَارُ** (اور چنتا ہے)۔ اور اس نے ان کے لیے اختیار ہونے کی نفی کی، پس فرمایا: **مَا كَانَ لَهُمُ الْخِيَرَةُ** (ان کے لیے کوئی اختیار نہیں ہے)۔ اور ہمارے نزدیک یہاں \"ما\" اسم ہے اور یہ \"یختار\" کے لیے مفعول ہونے کی جگہ میں نصب ہے، یعنی وہ چیز جس میں ان کے لیے اختیار تھا۔ پس جب بندہ یہ جان لیتا ہے، تو وہ اس میں حکم اللہ کے سپرد کر دیتا ہے اور تسلیم کر لیتا ہے، اور وہ اس وقت کے حکم کے مطابق ہوتا ہے جو اللہ اس میں جاری کرتا ہے، نہ کہ اس حکم کے مطابق جو وہ خوشی یا ناخوشی میں اپنے لیے اختیار کرتا ہے۔ اور وہ دیکھتا ہے کہ ہر چیز میں اس کے لیے خیر ہے، پس اللہ ہر حال میں اس کے ساتھ خیر کا معاملہ کرتا ہے۔ اگر اس کا وقت نعمت کا تقاضا کرے اور اس کا اللہ کے ساتھ معاہدہ ایسا ہی ہو، تو اللہ اسے اس پر شکر اور اس میں اللہ کا حق ادا کرنے کی توفیق دیتا ہے اور اس پر مدد کرتا ہے۔ اور اگر وہ بلا ہو، تو اسے اس پر صبر اور رضا کی توفیق دیتا ہے، اور اللہ اس کے لیے وہاں سے نکلنے کا راستہ بنا دیتا ہے **مِنْ حَيْثُ لَا يَحْتَسِبُ** (جہاں سے وہ گمان بھی نہیں کرتا)۔\n\nجیسے ایک شخص جو اللہ کی ایک لاکھ تسبیحات کرنا چاہتا ہے، اور اس کے لیے اسے ایک طویل وقت درکار ہوتا ہے، ساتھ ہی اس میں تھکاوٹ اور حضور (حضور) سے فارغ ہونے کی ضرورت ہوتی ہے۔ پھر اسے ایک سچی خبر ملتی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے انسان کے اس قول کو کہ \"سبحان اللہ عدد خلقہ، سبحان اللہ زنۃ عرشہ، سبحان اللہ رضاء نفسہ، سبحان اللہ مداد کلماتہ\" (اللہ پاک ہے اپنی مخلوق کی تعداد کے برابر، اللہ پاک ہے اپنے عرش کے وزن کے برابر، اللہ پاک ہے اپنی ذات کی رضا کے برابر، اللہ پاک ہے اپنے کلمات کی سیاہی کے برابر) تین بار، اور الحمد للہ اسی طرح، اور اللہ اکبر اسی طرح، اور لا الہ الا اللہ اسی طرح، اس سے افضل قرار دیا ہے جو اس بندے نے ارادہ کیا تھا۔ پس اس نے یہ قول کہا جو اسے اتفاقاً وقت کے حکم سے ملا، اگرچہ اسے اس کی خبر نہیں تھی۔ اور اس نے وہ ذکر چھوڑ دیا جو وہ کرنا چاہتا تھا، اور جان لیا کہ جو اللہ نے اس وقت میں اس تعریف کے ذریعے اس کے لیے چنا ہے، وہ اس سے کہیں زیادہ عظیم ہے جو اس نے اپنے لیے چنا تھا۔ اور یہ واقعہ رسول اللہ صلی اللہ علیہ وسلم سے ایک بوڑھی عورت کے ساتھ پیش آیا تھا جس کے پاس سے آپ گزرے تھے، اور یہ حدیث مشہور ہے۔\n\nپس جب ذات حق (الحق) کسی امر کا تقاضا کرتی ہے اور اس کی تم پر عنایت ہوتی ہے، تو وہ اسے تم پر جاری کر دیتا ہے اور تمہیں اس کا حق ادا کرنے کی توفیق دیتا ہے۔ پس اہل اللہ میں سے عقل مند وہ ہے جو یہ دیکھتا ہے کہ بندے کے لیے تمام خیر اسی میں ہے جس کا حق نے تقاضا کیا، جو اس نے اپنے بندوں کے لیے مشروع کیا اور جس کے ساتھ اپنے رسول صلی اللہ علیہ وسلم کو مبعوث فرمایا۔ پس جسے اللہ نے مشروع حق کے تقاضے میں استعمال کیا، تو اس کے بعد اللہ کی عنایت سے بڑھ کر اور کیا عنایت ہو سکتی ہے، اس شخص کے لیے جو اللہ کی طرف سے عقل رکھتا ہے۔ پس حق کی جانب سے معلوم وقت عین وہی ہے جس کے ساتھ شریعت نے تمہیں موجودہ حال میں مخاطب کیا ہے۔ پس ہر حال میں شارع کے قول کے مطابق رہو، تو تم صاحب وقت بن جاؤ گے، اور یہ اس بات کی علامت ہے کہ تم اللہ کے نزدیک سعادت مندوں میں سے ہو۔ اور یہ اہل اللہ میں بہت کم پایا جاتا ہے، یہ ان میں سے صرف چند افراد کے لیے ہے جو اہل مراقبہ ہیں اور اشیاء میں اللہ کے حکم سے غافل نہیں ہوتے۔ اور یہاں اہل حضور (حضور) میں سے ایک گروہ کے قدم ڈگمگا گئے جو ہر چیز میں اللہ کے ساتھ ہوتے ہیں؛ وہ پلک جھپکنے کے برابر بھی اللہ سے غافل نہیں ہوتے، لیکن وہ اشیاء میں یا ان میں سے بعض یا اکثر میں اللہ کے حکم سے غافل ہو جاتے ہیں۔ پس جو شخص اشیاء میں اللہ کے حکم سے غافل نہیں ہوا، وہ اللہ سے غافل نہیں ہوا۔ پس انہوں نے اللہ کے ساتھ حضور اور اس کے حکم کے ساتھ حضور کو جمع کر لیا۔ پس وہ زیادہ علم والے اور عظیم تر سعادت والے ہیں، اور وہی صاحب وقت ہیں جو سعادت عطا کرتا ہے۔\n\nاور بعض رجال اللہ نے یہ جانا کہ اللہ موجود ہونے کے بعد قائم بالذات اشیاء کو معدوم نہیں کرتا، اور نہ ہی وہ موجود ہونے کے بعد ان کے احوال یا اعراض کو معدوم کرنے سے متصف ہوتا ہے۔ بلکہ اشیاء مختلف احوال پر ہوتی ہیں، پھر وہ احوال ان سے زائل ہو جاتے ہیں، تو اللہ ان پر دوسرے احوال ڈال دیتا ہے، خواہ وہ مماثل ہوں یا متضاد۔ اگرچہ اشیاء کو معدوم کرنا اس امداد کو روکنے سے جائز ہے جس سے ان کے اعیان کی بقا ہے، لیکن اس نے یہ فیصلہ کر دیا ہے کہ معاملہ اسی طرح ہو گا۔ اور اسی لیے اس نے فرمایا: **إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ** (اگر وہ چاہے تو تمہیں لے جائے اور ایک نئی مخلوق لے آئے)۔ لیکن اس نے ایسا نہیں کیا، کیونکہ ارادہ اور مشیئت اس کے لیے حادث نہیں ہیں، کیونکہ وہ حوادث کا محل نہیں ہے۔ پس اس کی مشیئت (مشیئۃ) کا تعلق احدی (احدیۃ التعلق) ہے۔ لیکن وہ اشیاء میں ان کو مکمل یا جزوی طور پر جمع کرنے یا انہیں منتشر کرنے کے درمیان ہے، اور یہی اکوان (الاکوان) ہیں۔ پس کامل کے نزدیک حقیقت میں وقت ہمیشہ جمع اور تفرقہ (تفریق) ہے۔ اور لوگوں میں سے کچھ ایسے ہیں جو خاص طور پر جمع میں تفرقہ کا شہود (شہود) کرتے ہیں، لیکن تفرقہ کے جمع کا شہود نہیں کرتے، تو وہ خیال کرتے ہیں کہ یہی عین وقت ہے۔ پس جب ان سے وقت کے بارے میں پوچھا جاتا ہے تو وہ اسے ریتی (مبرد) سے تشبیہ دیتے ہیں اور کہتے ہیں: \"وقت ایک ریتی ہے جو تمہیں گھساتی ہے مگر مٹاتی نہیں\"۔ یعنی وہ تمہاری جمعیت کو منتشر کرتا ہے لیکن تمہاری عینیت کو ختم نہیں کرتا۔ پس جس نے وقت کو پہچان لیا اور یہ کہ حکم اسی کا ہے، وہ اس کے حکم کے تحت سکون اختیار کر لیتا ہے جو اس پر نافذ کیا گیا ہے۔ اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و سی و هشتم در باب وقت (الوقت)\n\nوقت آن چیزی است که تو پیوسته بدان وصف می‌شوی *** پس همواره به حکم وقت مشهود هستی\n\nپس خداوند وقت مرا از آنِ خود، محل شهود قرار دهد *** زیرا در وقت، نکوهیده و ستوده وجود دارد\n\nشؤون (الشئون) از جانب رحمان از آنِ اوست *** و این شؤون به واسطه ما، شرعاً، ایماناً و توحیداً برپا می‌گردد.\n\n[اینکه حقیقت وقت، امری وجودی (وجودی) میان دو نیستی (عدم) است]\n\nبدان که اهل طریقت (القوم) بر این اصطلاح کرده‌اند که حقیقت وقت (الوقت)، آن چیزی است که تو در زمان حال (الحال) بدان هستی و بر آن قرار داری، و آن امری وجودی (وجودی) میان دو نیستی (عدم) است. و گفته شده است: وقت آن چیزی است که از تصریف (گرداندن) حق (الحق) بر آنان وارد می‌شود، نه آنچه خود برای خویش برمی‌گزینند. و گفته شده است: وقت آن چیزی است که حق (الحق) اقتضا می‌کند و بر تو جاری می‌سازد. و گفته شده است: وقت سوهانی است که تو را می‌ساید اما محو نمی‌کند. و گفته شده است: وقت هر آن چیزی است که بر تو حکم رانده است. و محور همه اینها بر این است که او (حق) حاکم است. و مستند وقت (الوقت) در الوهیت، وصف خود اوست که تعالی می‌فرماید: «إِنَّهُ كُلَّ يَوْمٍ فِي شَأْنٍ» (او هر روز در شأنی است).\n\nپس وقت، آنچه در اصل هستی (الوجود) اوست، وجودش تنها در فرع که همان کَوْن (الکون) است، آشکار می‌شود. در نتیجه، شؤون (الشئون) حق (الحق) در اعیان ممکنات (ذوات ممکنات) ظاهر می‌گردد. بنابراین، وقت (الوقت) در حقیقت همان چیزی است که تو بدان هستی، و آنچه تو بدان هستی، عین استعداد (الاستعداد) توست. پس از شؤون (الشئون) حق (الحق) که او بر آن است، جز آنچه استعداد (الاستعداد) تو طلب می‌کند، در تو ظاهر نمی‌شود. شأن (تجلی) در اصل محکوم به استعداد است. اگر حکم استعداد ممکن به امکان (ممکن بودن) منجر شود، نتیجه آن می‌شود که شأن حق (الحق) در آن، ایجاب (به وجود آوردن) باشد. آیا نمی‌بینی که محال آن را نمی‌پذیرد؟ پس اصل وقت از کَوْن (الکون) است نه از حق (الحق)، و آن از تقدیر (التقدیر) است و حکم تقدیر تنها در مخلوق جاری است. پس صاحب وقت، کَوْن است و حکم، حکم کَوْن است، همان‌گونه که در باب ظهور حق (الحق) در اعیان ممکنات بر اساس آنچه از استعداد (الاستعداد) می‌دهند، مقرر کردیم؛ پس حق به واسطه آنها متنوع می‌شود، در حالی که او در ذات خود «الْغَنِيُّ عَنِ الْعَالَمِينَ» (بی‌نیاز از جهانیان) است.\n\nو چون ذوق‌های اهل طریقت (القوم) در باب وقت متفاوت بود، عباراتشان درباره آن نیز مختلف شد. و وقت (الوقت) در حقیقت، تمام آن چیزی است که با آن از وقت تعبیر کرده‌اند. و همچنین است هر مقام و حالی؛ آنان در تعبیر از آن، حد ذاتی را قصد نمی‌کنند، بلکه آن را با نتایج و آثارش ذکر می‌کنند، آثاری که جز در کسی که آن مقام یا حال، نعت و صفت اوست، وجود ندارد. از احکام وقت (الوقت) در مورد آنان و دیگران این است که خداوند اموری عادی را برایشان ترتیب داده که به حکم عادت در آنها تصرف می‌کنند، اموری که گناهی بر آنان نیست، یا اموری که با خطاب حق (الحق) مبنی بر اینکه آن عمل، قُربت است، همراه شده است. پس آنان انجام آن را برای خود برمی‌گزینند، اگر از قُربات باشد به قصد قُربت، یا به دلیل اینکه حرج (سختی) از آن برداشته شده است. سپس امری از جانب حق (الحق) بر آنان وارد می‌شود که نه در خاطرشان بوده و نه آن را برای خود انتخاب کرده‌اند. پس می‌دانند که وقت (الوقت)، آن امر را عطا کرده و خداوند آن را برایشان برگزیده است، زیرا اوست که می‌فرماید: «وَرَبُّكَ يَخْلُقُ مَا يَشَاءُ» (و پروردگار تو هر چه را بخواهد می‌آفریند) یعنی تقدیر می‌کند و به وجود می‌آورد، سپس فرمود: «وَيَخْتَارُ» (و برمی‌گزیند). و اختیار (الخيرة) را از آنان نفی کرد و فرمود: «مَا كَانَ لَهُمُ الْخِيَرَةُ» (آنان را اختیاری نیست). نزد ما، «ما» در اینجا اسم است و در محل نصب، مفعول برای «وَيَخْتَارُ» است، یعنی آنچه را که در آن اختیار داشتند، برمی‌گزیند. پس هنگامی که بنده این را دانست، حکم را در آن به خدا واگذار می‌کند و تسلیم می‌شود و به حکم وقت (الوقت) که خداوند در آن جاری می‌سازد، عمل می‌کند، نه به حکم آنچه خود در خوشی و ناخوشی برای خویش برمی‌گزیند. و می‌بیند که در همه اینها برای او خیر است، پس خداوند در همه اینها با او به خیر رفتار می‌کند.\n\nاگر وقت او نعمت را اقتضا کند و پیمان او با خدا چنین باشد، شکر بر آن و قیام به حق خدا در آن را روزی او می‌سازد و یاری‌اش می‌کند. و اگر بلا باشد، صبر بر آن و رضایت به آن را روزی او می‌سازد و خداوند برای او از «حَيْثُ لَا يَحْتَسِبُ» (از جایی که گمان نمی‌برد) راه خروجی قرار می‌دهد. مانند مردی که می‌خواهد صد هزار تسبیح بگوید و این کار نیاز به زمان طولانی دارد، به علاوه خستگی و فراغت از حضور (حضور قلب) که لازم است. سپس بر خبر راستی دست می‌یابد که پیامبر (صلی الله علیه و سلم) فرموده‌اند: گفتن «سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ، سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ، سُبْحَانَ اللَّهِ رِضَاءَ نَفْسِهِ، سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ» (پاک است خدا به تعداد آفریدگانش، پاک است خدا به وزن عرشش، پاک است خدا به رضایت ذاتش، پاک است خدا به اندازه مرکب کلماتش) سه بار، و «الْحَمْدُ لِلَّهِ» (ستایش از آن خداست) مانند آن، و «اللَّهُ أَكْبَرُ» (خدا بزرگتر است) مانند آن، و «لَا إِلَهَ إِلَّا اللَّهُ» (هیچ معبودی جز خدا نیست) مانند آن، بهتر از آن چیزی است که این بنده اراده کرده بود. پس او این ذکر را که به حکم مصادفه (برخورد) به او رسیده بود، گفت، هرچند قبلاً خبری از آن نداشت، و آنچه را که می‌خواست ذکر کند، رها کرد و دانست که آنچه خداوند با این تعریف در این وقت (الوقت) برای او برگزیده، بزرگتر از آن چیزی است که خود برای خویش انتخاب کرده بود. و این واقعه از رسول خدا (صلی الله علیه و سلم) با پیرزنی که از کنارش گذشت، رخ داده است و حدیث مشهور است.\n\nپس اگر حق (الحق) امری را اقتضا کند و عنایتی به تو داشته باشد، آن را بر تو جاری می‌سازد و قیام به حق آن را روزی تو می‌کند. پس عاقل از اهل الله کسی است که می‌بیند تمام خیری که برای بنده حاصل می‌شود، در آن چیزی است که حق (الحق) اقتضا کرده و در آنچه برای بندگانش تشریع نموده و رسولش (صلی الله علیه و سلم) را بدان مبعوث کرده است. پس کسی که خداوند او را در اقتضای حق مشروع به کار گیرد، برای کسی که از جانب خدا تعقل کند، چه عنایتی بالاتر از عنایت خدا به او وجود دارد؟ وقت معلوم از جانب حق (الحق)، عین همان چیزی است که شریعت در حال (الحال) با تو بدان خطاب کرده است. پس در هر حالی بر اساس قول شارع باش تا صاحب وقت (الوقت) گردی، و این نشانه‌ای است بر اینکه تو از سعادتمندان نزد خدا هستی. و این امر در میان اهل الله کمیاب است و تنها برای افراد انگشت‌شماری از آنان که اهل مراقبه هستند و از حکم خدا در اشیاء غافل نمی‌شوند، حاصل می‌شود. و در اینجا پای گروهی از اهل حضور (الحضور) با خدا در هر چیز لغزیده است؛ آنان لحظه‌ای از خدا غافل نمی‌شوند، اما از حکم خدا در اشیاء یا در برخی از آنها یا بیشترشان غافل می‌گردند. پس کسی که از حکم خدا در اشیاء غافل نشود، از خدا غافل نشده است. اینان میان حضور (الحضور) با خدا و حضور با حکم او جمع کرده‌اند، پس علمشان بیشتر و سعادتشان عظیم‌تر است و آنان صاحبان وقتی هستند که سعادت می‌بخشد.\n\nو برخی از رجال الله دانسته‌اند که خداوند اشیائی را که قائم به ذات خود هستند، پس از وجودشان معدوم نمی‌سازد، و به معدوم کردن احوال و اعراض آنها پس از وجودشان متصف نمی‌شود. بلکه اشیاء بر احوالی هستند، سپس آن احوال از آنها زایل می‌شود و خداوند احوال دیگری را بر آنها می‌پوشاند، خواه امثال باشند یا اضداد؛ با وجود اینکه معدوم کردن اشیاء با قطع امداد (مدد) که بقای اعیان آنها بدان است، جایز است. اما قضا (القضاء) چنین حکم کرده است که امر جز این نباشد. و به همین دلیل فرمود: «إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ» (اگر بخواهد شما را می‌برد و خلقی جدید می‌آورد)، اما این کار را نکرده است. زیرا اراده و مشیئت (خواست) برای او حادث نمی‌شود، چرا که او محل حوادث نیست. پس مشیئت او، احدی‌التعلق (تعلق یگانه) است، اما در اشیاء میان جمع کردن یا پراکنده ساختن آنها، به طور کلی یا جزئی، قرار دارد و اینها همان کَوْن‌ها (جهان‌ها) هستند. پس وقت (الوقت) در حقیقت نزد انسان کامل (الإنسان الکامل)، همیشه جمع و تفرقه (پراکندگی) است. و برخی از مردم تنها تفرقه را به ویژه در جمع مشاهده می‌کنند و جمع تفرقه را مشاهده نمی‌کنند، پس گمان می‌کنند که آن، عین وقت است. هنگامی که از وقت سؤال می‌شود، آن را به سوهان تشبیه می‌کند و می‌گوید: وقت سوهانی است که تو را می‌ساید اما محو نمی‌کند. یعنی جمعیت (تمرکز) تو را پراکنده می‌کند اما عین (ذات) تو را از بین نمی‌برد. پس کسی که وقت را شناخت و دانست که حکم در آن از آنِ اوست، زیر آنچه بر او حکم شده است، آرام می‌گیرد. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}