{
  "id": 19,
  "title": {
    "ar": "الباب التاسع عشر في سبب نقص العلوم وزيادتها",
    "en": "Chapter Nineteen: On the Cause of the Decrease and Increase of Knowledges.",
    "ur": "انیسواں باب: علوم کی کمی اور زیادتی کے سبب کے بیان میں",
    "fa": "باب نوزدهم در سبب نقصان و افزایش علوم"
  },
  "content": {
    "ar": "## «الباب التاسع عشر» في سبب نقص العلوم وزيادتها\n\n\nوقوله تعالى وقُلْ رَبِّ زِدْنِي عِلْماً وقوله صلى الله عليه وسلم إن الله لا يقبض العلم انتزاعا ينتزعه من صدور العلماء ولكن يقبضه بقبض العلماء\n\n\n> تجلى وجود الحق في فلك النفس *** دليل على ما في العلوم من النقص‏\n\n\n> وإن غاب عن ذاك التجلي بنفسه *** فهل مدرك إياه بالبحث والفحص‏\n\n\n> وإن ظهرت للعلم في النفس كثرة *** فقد ثبت الستر المحقق بالنص‏\n> ولم يبد من شمس الوجود ونورها *** على عالم الأرواح شي‏ء سوى القرص‏\n\n\n> وليست تنال العين في غير مظهر *** ولو هلك الإنسان من شدة الحرص‏\n\n\n> ولا ريب في قولي الذي قد بثثته *** وما هو بالزور المموه والخرص‏\n\n\n### [العلم: مراتبه وأطواره‏]\n\n\nاعلم أيدك الله أن كل حيوان وكل موصوف بإدراك فإنه في كل نفس في علم جديد من حيث ذلك الإدراك لكن الشخص المدرك قد لا يكون ممن يجعل باله أن ذلك علم فهذا هو في نفس الأمر علم فاتصاف العلوم بالنقص في حق العالم هو أن الإدراك قد حيل بينه وبين أشياء كثيرة مما كان يدركها لو لم يقم به هذا المانع كمن طرأ عليه العمي أو الصمم أو غير ذلك ولما كانت العلوم تعلو وتتضع بحسب المعلوم لذلك تعلقت الهمم بالعلوم الشريفة العالية التي إذا اتصف بها الإنسان زكت نفسه وعظمت مرتبته فأعلاها مرتبة العلم بالله وأعلى الطرق إلى العلم بالله علم التجليات ودونها علم النظر وليس دون النظر علم إلهي وإنما هي عقائد في عموم الخلق لا علوم وهذه العلوم هي التي أمر الله نبيه عليه السلام بطلب الزيادة منها قال تعالى ولا تَعْجَلْ بِالْقُرْآنِ من قَبْلِ أَنْ يُقْضى‏ إِلَيْكَ وَحْيُهُ وقُلْ رَبِّ زِدْنِي عِلْماً أي زدني من كلامك ما نزيد به علما بك فإنه قد زاد هنا من العلم العلم بشرف التأني عند الوحي أدبا مع المعلم الذي أتاه به من قبل ربه ولهذا أردف هذه الآية بقوله وعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ أي ذلت فأراد علوم التجلي والتجلي أشرف الطرق إلى تحصيل العلوم وهي علوم الأذواق‏\n\n\n### [العلم: ازدياده وزيادته‏]\n\n\nواعلم أن للزيادة والنقص بابا آخر نذكره أيضا إن شاء الله وذلك أن الله جعل لكل شي‏ء ونفس الإنسان من جملته الأشياء ظاهرا وباطنا فهي تدرك بالظاهر أمورا تسمى عينا وتدرك بالباطن أمورا تسمى علما والحق سبحانه هو الظاهر والباطن فبه وقع الإدراك فإنه ليس في قدرة كل ما سوى الله أن يدرك شيئا بنفسه وإنما أدركه بما جعل الله فيه وتجلى الحق لكل من تجلى له من أي عالم كان من عالم الغيب أو الشهادة إنما هو من الاسم الظاهر وأما الاسم الباطن فمن حقيقة هذه النسبة أنه لا يقع فيها تجل أبدا لا في الدنيا ولا في الآخرة إذ كان التجلي عبارة عن ظهوره لمن تجلى له في ذلك المجلى وهو الاسم الظاهر فإن معقولية النسب لا تتبدل وإن لم يكن لها وجود عيني لكن لها الوجود العقلي فهي معقولة فإذا تجلى الحق إما منة أو إجابة لسؤال فيه فتجلى لظاهر النفس وقع الإدراك بالحس في الصورة في برزخ التمثل فوقعت الزيادة عند المتجلي له في علوم الأحكام إن كان من علماء الشريعة وفي علوم موازين المعاني إن كان منطقيا وفي علوم ميزان الكلام إن كان نحويا وكذلك صاحب كل علم من علوم الأكوان وغير الأكوان تقع له الزيادة في نفسه من علمه الذي هو بصدده فأهل هذه الطريقة يعلمون أن هذه الزيادة إنما كانت من ذلك التجلي الإلهي لهؤلاء الأصناف فإنهم لا يقدرون على إنكار ما كشف لهم وغير العارفين يحسون بالزيادة وينسبون ذلك إلى أفكارهم وغير هذين يجدون من الزيادة ولا يعلمون أنهم استزادوا شيئا فهم في المثل كَمَثَلِ الْحِمارِ يَحْمِلُ أَسْفاراً بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآياتِ الله وهي هذه الزيادة وأصلها والعجب من الذين نسبوا ذلك إلى أفكارهم وما علم إن فكره ونظره وبحثه في مسألة من المسائل هو من زيادة العلوم في نفسه من ذلك التجلي الذي ذكرناه فالناظر مشغول بمتعلق نظره وبغاية مطلبه فيحجب عن علم الحال فهو في مزيد علم وهو لا يشعر وإذا وقع التجلي أيضا بالاسم الظاهر لباطن النفس وقع الإدراك بالبصيرة في عالم الحقائق والمعاني المجردة عن المواد وهي المعبر عنها بالنصوص إذ النص ما لا إشكال فيه ولا احتمال بوجه من الوجوه وليس ذلك إلا في المعاني فيكون صاحب المعاني مستريحا من تعب الفكر فتقع الزيادة له عند التجلي في العلوم الإلهية وعلوم الأسرار وعلوم الباطن وما يتعلق بالآخرة وهذا مخصوص بأهل طريقنا فهذا سبب الزيادة\n\n\n### [العلم: نقصانه‏]\n\n\nوأما سبب نقصها فامران إما سوء في المزاج في أصل النش‏ء أو فساد عارض في القوة الموصلة إلى ذلك وهذا لا ينجبر كما قال الخضر في الغلام إنه طبع كافرا فهذا في أصل النش‏ء وأما الأمر العارض فقد يزول إن كان في القوة بالطب وإن كان في النفس فشغله حب الرئاسة واتباع الشهوات عن اقتناء العلوم التي فيها شرفه وسعادته فهذا أيضا قد يزول بداعي الحق من قلبه فيرجع إلى الفكر الصحيح فيعلم إن الدنيا منزل من منازل المسافر وأنها جسر يعبر وأن الإنسان إذا لم تتحل نفسه هنا بالعلوم ومكارم الأخلاق وصفات الملإ الأعلى من الطهارة والتنزه عن‏\nالشهوات الطبيعية الصارفة عن النظر الصحيح واقتناء العلوم الإلهية فيأخذ في الشروع في ذلك فهذا أيضا سبب نقص العلوم ولا أعني بالعلوم التي يكون النقص منها عيبا في الإنسان إلا العلوم الإلهية وإلا فالحقيقة تعطي أنه ما ثم نقص قط وأن الإنسان في زيادة علم أبدا دائما من جهة ما تعطيه حواسه وتقلبات أحواله في نفسه وخواطره فهو في مزيد علوم لكن لا منفعة فيها والظن والشك والنظر والجهل والغفلة والنسيان كل هذا وأمثاله لا يكون معها العلم بما أنت فيه بحكم الظن أو الشك أو النظر أو الجهل أو الغفلة أو النسيان و\n\n\n### [علوم التجلي: نقصها وزيادتها]\n\n\nأما نقص علوم التجلي وزيادتها فالإنسان على إحدى حالتين خروج الأنبياء بالتبليغ أو الأولياء بحكم الوراثة النبوية كما قيل لأبي يزيد حين خلع عليه خلع النيابة وقال له اخرج إلى خلقي بصفتي فمن رآك رآني فلم يسعه إلا امتثال أمر ربه فخطا خطوة إلى نفسه من ربه فغشي عليه فإذا النداء ردوا على حبيبي فلا صبر له عني فإنه كان مستهلكا في الحق كأبي عقال المغربي فرد إلى مقام الاستهلاك فيه الأرواح الموكلة به المؤيدة له لما أمر بالخروج فرد إلى الحق وخلعت عليه خلع الذلة والافتقار والانكسار فطاب عيشه ورأى ربه فزاد أنسه واستراح من حمل الأمانة المعارة التي لا بد له أن تؤخذ منه‏\n\n\n### [معراج الإنسان في سلم العرفان‏]\n\n\nوالإنسان من وقت رقية في سلم المعراج يكون له تجل إلهي بحسب سلم معراجه فإنه لكل شخص من أهل الله سلم يخصه لا يرقى فيه غيره ولو رقى أحد في سلم أحد لكانت النبوة مكتسبة فإن كل سلم يعطي لذاته مرتبة خاصة لكل من رقى فيه وكانت العلماء ترقي في سلم الأنبياء فتنال النبوة برقيها فيه والأمر ليس كذلك وكان يزول الاتساع الإلهي بتكرار الأمر وقد ثبت عندنا أنه لا تكرار في ذلك الجناب غير إن عدد درج المعالي كلها الأنبياء والأولياء والمؤمنون والرسل على السواء لا يزيد سلم على سلم درجة واحدة فالدرجة الأولى الإسلام وهو الانقياد وآخر الدرج الفناء في العروج والبقاء في الخروج وبينهما ما بقي وهو الايمان والإحسان والعلم والتقديس والتنزيه والغني والفقر والذلة والعزة والتلوين والتمكين في التلوين والفناء إن كنت خارجا والبقاء إن كنت داخلا إليه وفي كل درج في خروجك عنه ينقص من باطنك بقدر ما يزيد في ظاهرك من علوم التجلي إلى أن تنتهي إلى آخر درج فإن كنت خارجا ووصلت إلى آخر درج ظهر بذاته في ظاهرك على قدرك وكنت له مظهرا في خلقه ولم يبق في باطنك منه شي‏ء أصلا وزالت عنك تجليات الباطن جملة واحدة فإذا دعاك إلى الدخول إليه فهي أول درج يتجلى لك في باطنك بقدر ما ينقص من ذلك التجلي في ظاهرك إلى أن تنتهي إلى آخر درج فيظهر على باطنك بذاته ولا يبقى في ظاهرك تجل أصلا وسبب ذلك أن لا يزال العبد والرب معا في كمال وجود كل واحد لنفسه فلا يزال العبد عبدا والرب ربا مع هذه الزيادة والنقص فهذا هو سبب زيادة علوم التجليات ونقصها في الظاهر والباطن وسبب ذلك التركيب ولهذا كان جميع ما خلقه الله وأوجده في عينه مركبا له ظاهر وله باطن والذي نسمعه من البسائط إنما هي أمور معقولة لا وجود لها في أعيانها فكل موجود سوى الله تعالى مركب هذا أعطانا الكشف الصحيح الذي لا مرية فيه وهو الموجب لاستصحاب الافتقار له فإنه وصف ذاتي له فإن فهمت فقد أوضحنا لك المنهاج ونصبنا لك المعراج فاسلك وأعرج تبصر وتشاهد ما بيناه لك ولما عينا لك درج المعارج ما أبقينا لك في النصيحة التي أمرنا بها رسول الله صلى الله عليه وسلم فإنه لو وصفنا لك الثمرات والنتائج ولم نعين لك الطريق إليها لشوقناك إلى أمر عظيم لا تعرف الطريق الموصل إليه فو الذي نفسي بيده أنه لهو المعراج والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Nineteen: Concerning the Cause of the Decrease and Increase of Knowledges\n\nAnd His saying, the Exalted: <<And say: My Lord, increase me in knowledge>>. And his saying, peace and blessings be upon him: \"Indeed, Allah does not seize Knowledge by snatching it away from the breasts of the scholars, but He seizes it by seizing the scholars (i.e., by their death).\"\n\nThe Self-disclosure (تجلي) of the Existence (وجود) of the Real (الحق) in the sphere of the Soul (النفس)\nIs proof of the deficiency inherent in knowledges.\nAnd if He is absent from that Self-disclosure (تجلي) by Himself,\nCan anyone perceive Him through searching and investigation?\nAnd if multiplicity (كثرة) appears for Knowledge in the Soul (النفس),\nThen the verified veiling (ستر) is established by the revealed text (نص).\nAnd nothing of the Sun of Existence (وجود) and its light appeared\nUpon the world of Spirits (الأرواح) except the disk.\nAnd the Essence (العين) is not attained except in a manifestation (مظهر),\nEven if the human perishes from intense eagerness.\nAnd there is no doubt in my saying which I have disseminated,\nNor is it a deceptive falsehood or mere conjecture.\n\n### [Knowledge: Its Levels and Stages]\n\nKnow, may Allah support you, that every living creature and everything described by perception (إدراك) is, in every breath, in a new knowledge (علم جديد) by virtue of that perception. However, the perceiving individual may not be one who pays attention that this is knowledge. Yet, this is, in the reality of the matter (في نفس الأمر), knowledge. Thus, the description of knowledges as deficient (نقص) concerning the knower (العالم) means that perception has been prevented from reaching many things that the knower would have perceived had this impediment not arisen, such as someone afflicted by blindness, deafness, or the like.\n\nSince knowledges rise and fall in rank according to the object of knowledge (المعلوم), aspirations (الهمم) have attached themselves to the noble and elevated knowledges, which, when a human is characterized by them, purify his soul (نفسه) and magnify his rank (مرتبته). The highest of these in rank is the Knowledge (العلم) of Allah. The highest path to the Knowledge of Allah is the knowledge of Theophanies (علم التجليات), and below that is the knowledge derived from speculation (علم النظر). Below speculation (النظر), there is no divine knowledge (علم إلهي); rather, these are merely beliefs (عقائد) held by the general populace, not true knowledges.\n\nThese are the knowledges from which Allah commanded His Prophet, peace be upon him, to seek increase. The Exalted said: <<Do not hasten with the Qur’an before its revelation is concluded to you, and say: My Lord, increase me in knowledge>>. That is, increase me from Your speech (كلامك) that by which we increase in Knowledge of You. For here, the knowledge gained was the knowledge of the nobility of deliberation during revelation, as a matter of courtesy (أدبا) toward the Teacher who brought it to him from his Lord. This is why He followed this verse with His saying: <<And faces shall be humbled before the Living, the Self-Subsisting>>—meaning, they were subjugated. Thus, He intended the knowledges of Theophany (علوم التجلي), and Theophany (التجلي) is the noblest path to acquiring knowledges, and these are the knowledges of spiritual tastes (علوم الأذواق).\n\n### [Knowledge: Its Growth and Increase]\n\nKnow that increase and decrease have another aspect, which we shall also mention, if Allah wills. This is that Allah has made for everything—and the human soul (نفس الإنسان) is among these things—an outer (ظاهر) and an inner (باطن). By the outer, it perceives matters called essence (عينا), and by the inner, it perceives matters called knowledge (علما). The Real (الحق), glory be to Him, is the Outer (الظاهر) and the Inner (الباطن). By Him, perception occurs, for it is not within the capacity of anything other than Allah to perceive anything by itself; rather, it perceives by what Allah has placed within it.\n\nAnd the Self-disclosure (تجلي) of the Real (الحق) to whomever He discloses Himself, from whatever world—whether the World of the Unseen (عالم الغيب) or the World of Witnessing (الشهادة)—is only from the Name the Outer (الاسم الظاهر). As for the Name the Inner (الاسم الباطن), it is of the nature of this relationship that no Self-disclosure (تجلي) ever occurs within it, neither in this world nor in the Hereafter, since Theophany (التجلي) is an expression of His manifestation to the one to whom He discloses Himself in that locus of manifestation (المجلى), which is the Name the Outer. For the intelligibility of the relationships (النسب) does not change, and even if they do not have an essential existence (وجود عيني), they possess mental existence (الوجود العقلي), so they are intelligible.\n\nSo, when the Real (الحق) discloses Himself, either as a grace (منة) or in response to a request, and He discloses Himself to the outer aspect of the soul (ظاهر النفس), perception occurs through the senses (الحس) in the form within the Isthmus of Representation (برزخ التمثل). The increase then occurs for the recipient of the Theophany (المتجلي له) in the knowledges of rulings (علوم الأحكام) if he is a scholar of the Sacred Law (الشريعة), or in the knowledges of the measures of meanings (موازين المعاني) if he is a logician, or in the knowledges of the measure of speech (ميزان الكلام) if he is a grammarian. Likewise, the possessor of every science, whether of the cosmic sciences (علوم الأكوان) or otherwise, experiences an increase within himself concerning the knowledge he is engaged in.\n\nThe people of this Way (الطريقة) know that this increase was only due to that Divine Theophany (التجلي الإلهي) granted to these various types of people, for they cannot deny what has been unveiled (كشف) to them. Those who are not Gnostics (العارفين) sense the increase but attribute it to their own thoughts (أفكارهم). Others, besides these two groups, find an increase but do not know that they have gained anything; they are, in the parable, <<like the donkey carrying volumes of books. Evil is the example of the people who denied the signs of Allah>>—and these signs are this increase and its origin. And it is astonishing concerning those who attribute this to their thoughts, not knowing that their thinking, speculation (نظر), and investigation (بحث) into any issue is itself an increase in knowledges within their soul (نفسه) resulting from that Theophany (التجلي) we mentioned. The speculator is preoccupied with the object of his speculation and the goal of his quest, so he is veiled from the knowledge of the state (علم الحال). Thus, he is in an increase of knowledge without realizing it.\n\nAnd when the Theophany (التجلي) also occurs through the Name the Outer (الاسم الظاهر) to the inner aspect of the soul (باطن النفس), perception occurs through insight (البصيرة) in the World of Realities (عالم الحقائق) and meanings (المعاني) abstracted from matter. These are what are expressed by the definitive texts (النصوص), since a definitive text (النص) is that which contains no ambiguity or possibility of interpretation whatsoever, and this occurs only in meanings. Thus, the possessor of meanings is relieved from the toil of thought, and the increase occurs for him during the Theophany (التجلي) in the Divine Knowledges (العلوم الإلهية), the knowledges of secrets (علوم الأسرار), the knowledges of the Inner (علوم الباطن), and what relates to the Hereafter. This is specific to the people of our Way (طريقنا). This, then, is the cause of increase.\n\n### [Knowledge: Its Decrease]\n\nAs for the cause of its decrease, there are two matters: either a defect in the temperament (المزاج) in the original creation (أصل النشء), or an accidental corruption in the faculty (القوة) that leads to it. The former cannot be remedied, as Al-Khidr said concerning the youth, that he was \"naturally inclined to disbelief\" (طبع كافرا). This relates to the original creation. As for the accidental matter, it may be removed if it is in the faculty, through medicine. If it is in the soul (النفس), it is due to the preoccupation with the love of leadership and the pursuit of desires (الشهوات), distracting it from acquiring the knowledges in which its nobility and felicity lie. This, too, may be removed by the call of the Real (الحق) from his heart, causing him to return to sound reflection.\n\nHe then knows that the world (الدنيا) is but one station among the stations of the traveler, and that it is a bridge to be crossed. And that if the human soul does not adorn itself here with knowledges, noble character, and the attributes of the Highest Assembly (الملإ الأعلى)—such as purity and detachment from natural desires (الشهوات الطبيعية) that divert one from sound speculation (النظر الصحيح) and the acquisition of Divine Knowledges (العلوم الإلهية)—he should begin to embark upon that path. This, too, is a cause of the decrease of knowledges.\n\nI do not mean by the knowledges whose decrease constitutes a defect in the human except the Divine Knowledges (العلوم الإلهية). Otherwise, the Reality (الحقيقة) dictates that there is never any decrease whatsoever, and that the human is always and perpetually in an increase of knowledge (زيادة علم) derived from what his senses provide and the fluctuations of his states (أحواله) within himself and his thoughts (خواطره). Thus, he is in an increase of knowledges, but there is no benefit in them. Conjecture (الظن), doubt (الشك), speculation (النظر), ignorance (الجهل), heedlessness (الغفلة), and forgetfulness (النسيان)—all of these and their like do not accompany the knowledge of what you are in, whether by the ruling of conjecture, doubt, speculation, ignorance, heedlessness, or forgetfulness.\n\n### [Knowledges of Theophany: Their Decrease and Increase]\n\nAs for the decrease and increase of the knowledges of Theophany (علوم التجلي), the human is in one of two states: the outward journey (خروج) of the Prophets for the purpose of conveying the message, or the outward journey of the Saints (الأولياء) by virtue of prophetic inheritance (الوراثة النبوية). Just as it was said to Abu Yazid when the robe of vicegerency (خلع النيابة) was bestowed upon him: \"Go out to My creation with My Attribute, for whoever sees you sees Me.\" He could only comply with the command of his Lord, so he took one step toward his own self away from his Lord, and he fainted. Then came the call: \"Return My beloved to Me, for he has no patience away from Me.\" For he was annihilated (مستهلكا) in the Real (الحق), like Abu ‘Uqal al-Maghribi. The spirits (الأرواح) entrusted to him and supporting him returned him to the station of annihilation (الاستهلاك) within the Real when he was commanded to go out. He was returned to the Real, and the robes of humility (الذلة), destitution (الافتقار), and brokenness (الانكسار) were bestowed upon him. His life became pleasant, he witnessed his Lord, his intimacy increased, and he rested from bearing the borrowed trust (الأمانة المعارة) that must inevitably be taken back from him.\n\n### [The Human’s Ascent on the Ladder of Gnosis]\n\nFrom the moment the human begins his ascent (رقية) on the ladder of the spiritual ascension (سلم المعراج), he receives a Divine Theophany (تجل إلهي) corresponding to the ladder of his ascension. For every person among the People of Allah (أهل الله) has a specific ladder that no one else ascends. If one were to ascend another’s ladder, prophethood would be acquired (مكتسبة). For every ladder inherently grants a specific rank (مرتبة خاصة) to everyone who ascends it. If scholars were to ascend the ladder of the Prophets, they would attain prophethood by their ascent therein, but the matter is not so. The Divine Vastness (الاتساع الإلهي) would cease through the repetition of the command, and it is established with us that there is no repetition in that Divine Presence (الجناب). However, the number of all the degrees of ascent (درج المعالي)—for the Prophets, the Saints (الأولياء), the believers, and the Messengers—is equal; no ladder exceeds another by a single degree.\n\nThe first degree is Islam, which is submission (الانقياد). The last degree is Annihilation (الفناء) in the ascent and Subsistence (البقاء) in the outward journey (الخروج). Between them lies what remains: Faith (الإيمان), Excellence (الإحسان), Knowledge (العلم), Sanctification (التقديس), Transcendence (التنزيه), Wealth (الغني), Poverty (الفقر), Humility (الذلة), Might (العزة), Fluctuation (التلوين), and Stability (التمكين) within Fluctuation. Annihilation (الفناء) if you are journeying outward, and Subsistence (البقاء) if you are journeying inward toward Him.\n\nIn every degree of your outward journey away from Him, your inner aspect (باطنك) decreases by the measure that your outer aspect (ظاهرك) increases in the knowledges of Theophany (علوم التجلي), until you reach the last degree. If you are journeying outward and reach the last degree, He manifests by His Essence (بذاته) in your outer aspect according to your capacity, and you become a manifestation (مظهرا) for Him among His creation. Nothing of Him remains in your inner aspect (باطنك) whatsoever, and the Theophanies of the Inner (تجليات الباطن) vanish from you entirely.\n\nThen, if He calls you to enter toward Him, that is the first degree where He discloses Himself to your inner aspect (باطنك) by the measure that the Theophany (التجلي) decreases in your outer aspect, until you reach the last degree, where He manifests upon your inner aspect by His Essence (بذاته), and no Theophany (تجلي) remains in your outer aspect whatsoever. The reason for this is that the servant (العبد) and the Lord (الرب) remain together in the perfection of the existence (وجود) of each one for himself. Thus, the servant remains a servant and the Lord remains a Lord, despite this increase and decrease. This, then, is the cause of the increase and decrease of the knowledges of Theophanies (علوم التجليات) in the outer (الظاهر) and the inner (الباطن), and the cause of this is composition (التركيب).\n\nThis is why everything Allah created and brought into essential existence (في عينه) is composite (مركبا), having an outer and an inner. What we hear of simple entities (البسائط) are merely intelligible matters (أمور معقولة) that have no existence in their essences (أعيانها). Thus, every existent thing other than Allah, the Exalted, is composite. This has granted us the sound Unveiling (الكشف الصحيح) about which there is no doubt, and it necessitates the constant accompaniment of destitution (الافتقار) toward Him, for destitution is an essential attribute (وصف ذاتي) of the servant. If you have understood, then we have clarified the path (المنهاج) for you and established the ladder of ascension (المعراج). So traverse and ascend, and you will perceive and witness what we have explained to you. Since we have specified for you the degrees of the ascensions (درج المعارج), we have left nothing unsaid in the counsel (النصيحة) commanded by the Messenger of Allah, peace and blessings be upon him. For if we had described the fruits and results to you without specifying the path to them, we would have made you yearn for a great matter without knowing the way that leads to it. By Him in Whose Hand is my soul, verily, this is the Ascension (المعراج). And <<Allah speaks the Truth, and He guides to the Way>>.",
    "ur": "**باب انیسواں** علوم کی کمی اور زیادتی کے سبب کے بیان میں\n\nاور اللہ تعالیٰ کا فرمان: \"اور کہو کہ اے میرے رب! میرے علم میں اضافہ فرما\" (وَقُلْ رَبِّ زِدْنِي عِلْماً)۔ اور نبی اکرم صلی اللہ علیہ وسلم کا فرمان: \"بے شک اللہ علم کو اس طرح نہیں اٹھا لے گا کہ اسے علماء کے سینوں سے کھینچ لے، بلکہ وہ علماء کو اٹھا لینے کے ذریعے علم کو اٹھا لے گا\" (إِنَّ اللَّهَ لَا يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنْ صُدُورِ الْعُلَمَاءِ وَلَكِنْ يَقْبِضُهُ بِقَبْضِ الْعُلَمَاءِ)۔\n\nذات حق (الحق) کی ہستی (الوجود) کا نفس کے مدار میں ظہور (التجلی) ہونا،\nعلوم میں موجود کمی پر دلیل ہے۔\nاور اگر وہ (نفس) اس ظہور (التجلی) سے خود غائب ہو جائے،\nتو کیا کوئی اسے محض بحث اور چھان بین سے پا سکتا ہے؟\nاور اگرچہ نفس میں علم کی کثرت ظاہر ہو،\nتو بھی یقینی پردہ نص سے ثابت ہے۔\nاور ہستی (الوجود) کے سورج اور اس کے نور سے\nعالم ارواح پر قرص کے سوا کچھ ظاہر نہیں ہوا۔\nاور آنکھ کسی مظہر کے بغیر اسے نہیں پا سکتی،\nاگرچہ انسان شدید حرص کے باعث ہلاک ہو جائے۔\nاور میرے اس قول میں کوئی شک نہیں جسے میں نے پھیلا دیا ہے،\nاور یہ کوئی جھوٹا، ملمع شدہ یا محض اندازہ نہیں ہے۔\n\n### [علم: اس کے مراتب اور اطوار]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ ہر حیوان اور ہر وہ شے جو ادراک سے متصف ہے، وہ ہر لمحے اس ادراک کے لحاظ سے ایک نئے علم میں ہے۔ لیکن ادراک کرنے والا شخص شاید اس بات پر توجہ نہ دے کہ یہ ایک علم ہے۔ پس یہ نفس الامر میں علم ہے۔ علوم کا عالم کے حق میں کمی سے متصف ہونا یہ ہے کہ ادراک اور بہت سی چیزوں کے درمیان رکاوٹ حائل ہو جائے جن کا وہ ادراک کر سکتا تھا اگر یہ مانع اس میں نہ ہوتا، جیسے کسی پر اندھا پن یا بہرا پن یا کوئی اور عارضہ لاحق ہو جائے۔ اور چونکہ علوم معلوم کے اعتبار سے بلند اور پست ہوتے ہیں، اس لیے ہمتیں ان شریف اور اعلیٰ علوم سے وابستہ ہو گئیں کہ جب انسان ان سے متصف ہوتا ہے تو اس کا نفس پاکیزہ ہو جاتا ہے اور اس کا مرتبہ بلند ہو جاتا ہے۔ پس ان میں سب سے اعلیٰ مرتبہ اللہ کے علم کا ہے، اور اللہ کے علم تک پہنچنے کا سب سے اعلیٰ راستہ ظہور الٰہی (التجلی) کا علم ہے، اور اس سے کم تر نظر کا علم ہے۔ اور نظر سے کم تر کوئی الٰہی علم نہیں ہے، بلکہ وہ عام مخلوق میں محض عقائد ہیں، علوم نہیں۔ اور یہ وہی علوم ہیں جن میں اللہ نے اپنے نبی علیہ السلام کو زیادتی طلب کرنے کا حکم دیا ہے۔ اللہ تعالیٰ نے فرمایا: \"اور قرآن کے ساتھ جلدی نہ کرو اس سے پہلے کہ تمہاری طرف اس کی وحی پوری کی جائے، اور کہو کہ اے میرے رب! میرے علم میں اضافہ فرما\" (وَلَا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضَى إِلَيْكَ وَحْيُهُ وَقُلْ رَبِّ زِدْنِي عِلْماً)۔ یعنی میرے کلام میں مزید اضافہ فرما جس سے ہم تجھ سے متعلق علم میں اضافہ کریں، کیونکہ یہاں علم میں اس بات کا اضافہ ہوا کہ وحی کے وقت تأنی (دھیما پن) اختیار کرنا ادب ہے اس معلم کے ساتھ جو اسے اس کے رب کی طرف سے لایا ہے۔ اور اسی لیے اس آیت کے بعد یہ فرمان آیا: \"اور تمام چہرے حی و قیوم کے سامنے جھک گئے\" (وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ)۔ یعنی ذلیل ہو گئے۔ پس اس سے مراد علوم ظہور الٰہی (التجلی) ہیں، اور ظہور الٰہی (التجلی) علوم کے حصول کا سب سے اشرف راستہ ہے، اور یہ علومِ اذواق ہیں۔\n\n### [علم: اس کا بڑھنا اور اضافہ]\n\nجان لیجیے کہ زیادتی اور کمی کا ایک اور پہلو بھی ہے جسے ہم ان شاء اللہ ذکر کریں گے۔ وہ یہ کہ اللہ نے ہر شے کے لیے، اور انسان کا نفس بھی ان اشیاء میں شامل ہے، ایک ظاہر اور ایک باطن بنایا ہے۔ پس وہ ظاہر کے ذریعے ایسے امور کا ادراک کرتا ہے جنہیں عین (آنکھوں سے دیکھی جانے والی حقیقت) کہا جاتا ہے، اور باطن کے ذریعے ایسے امور کا ادراک کرتا ہے جنہیں علم کہا جاتا ہے۔ اور حق سبحانہ (الحق) ہی الظاہر (ظاہر) اور الباطن (باطن) ہے۔ پس اسی کے ذریعے ادراک واقع ہوتا ہے، کیونکہ اللہ کے سوا کسی بھی شے کی قدرت میں نہیں ہے کہ وہ خود سے کسی چیز کا ادراک کر سکے، بلکہ وہ اس کا ادراک اس چیز کے ذریعے کرتا ہے جو اللہ نے اس میں پیدا کی ہے۔ اور حق کا ظہور (التجلی) ہر اس شخص کے لیے جس پر وہ ظاہر ہوتا ہے، خواہ وہ عالم غیب سے ہو یا عالم شہادت سے، وہ صرف اسم الظاہر (الظاہر) کی طرف سے ہوتا ہے۔ لیکن اسم الباطن (الباطن) کی حقیقت یہ ہے کہ اس میں کبھی بھی ظہور (التجلی) واقع نہیں ہوتا، نہ دنیا میں اور نہ آخرت میں، کیونکہ ظہور (التجلی) اس کے لیے ظاہر ہونے کا نام ہے جس پر وہ اس مجلیٰ (مظہر) میں ظاہر ہوا، اور وہ اسم الظاہر (الظاہر) ہے۔ اگرچہ نسبتوں کا کوئی وجود عینی نہیں ہوتا، لیکن ان کا وجود عقلی ہوتا ہے، پس وہ معقول ہیں۔ جب حق ظہور فرماتا ہے، خواہ یہ احسان کے طور پر ہو یا کسی سوال کے جواب میں، اور وہ نفس کے ظاہر پر ظہور فرماتا ہے، تو ادراک حس کے ذریعے تمثل کے برزخ میں صورت میں واقع ہوتا ہے۔ پس ظہور پانے والے کے ہاں احکام کے علوم میں اضافہ ہوتا ہے اگر وہ علماء شریعت میں سے ہو، اور معانی کے موازین کے علوم میں اضافہ ہوتا ہے اگر وہ منطقی ہو، اور کلام کے موازین کے علوم میں اضافہ ہوتا ہے اگر وہ نحوی ہو۔ اسی طرح ہر علم والا، خواہ وہ علوم اکوان میں سے ہو یا غیر اکوان میں سے، اس کے اپنے علم میں اضافہ ہوتا ہے جس میں وہ مشغول ہے۔ پس اس طریقے کے اہل جانتے ہیں کہ یہ اضافہ ان اصناف کے لیے اس الٰہی ظہور (التجلی) کی وجہ سے ہوا ہے، کیونکہ وہ اس کا انکار نہیں کر سکتے جو ان پر منکشف ہوا ہے۔ اور غیر عارفین اس اضافے کو محسوس کرتے ہیں اور اسے اپنے افکار کی طرف منسوب کرتے ہیں۔ اور ان دونوں کے علاوہ وہ ہیں جو اضافہ پاتے ہیں لیکن انہیں یہ معلوم نہیں ہوتا کہ انہوں نے کوئی اضافہ کیا ہے۔ پس ان کی مثال اس گدھے کی سی ہے جو کتابیں لادے ہوئے ہو، ان لوگوں کی بری مثال ہے جنہوں نے اللہ کی آیات کو جھٹلایا (كَمَثَلِ الْحِمارِ يَحْمِلُ أَسْفاراً بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآياتِ الله)، اور یہ اضافہ اور اس کی اصل ہے۔ اور تعجب ہے ان لوگوں پر جنہوں نے اسے اپنے افکار کی طرف منسوب کیا، حالانکہ انہیں یہ معلوم نہیں کہ کسی مسئلے میں ان کا فکر، نظر اور بحث ان کے نفس میں علوم کی زیادتی ہے جو اس ظہور (التجلی) سے ہوئی جس کا ہم نے ذکر کیا۔ پس ناظر اپنے متعلقِ نظر اور اپنے مطلوب کی غایت میں مشغول ہوتا ہے، تو وہ حال کے علم سے پردے میں رہتا ہے۔ پس وہ علم میں اضافے میں ہے اور اسے شعور نہیں ہے۔ اور جب اسم الظاہر (الظاہر) کے ذریعے نفس کے باطن پر بھی ظہور (التجلی) واقع ہوتا ہے، تو ادراک بصیرت کے ذریعے حقائق اور مواد سے مجرد معانی کے عالم میں واقع ہوتا ہے، جنہیں نصوص سے تعبیر کیا جاتا ہے، کیونکہ نص وہ ہے جس میں کسی بھی پہلو سے کوئی اشکال یا احتمال نہ ہو، اور یہ صرف معانی میں ہوتا ہے۔ پس صاحب معانی فکر کی مشقت سے راحت پاتا ہے، تو ظہور (التجلی) کے وقت اسے علوم الٰہیہ، علوم اسرار اور علوم باطن میں اور ان علوم میں جو آخرت سے متعلق ہیں، اضافہ ہوتا ہے۔ اور یہ ہمارے طریقے کے اہل کے ساتھ خاص ہے۔ پس یہ زیادتی کا سبب ہے۔\n\n### [علم: اس کی کمی]\n\nاور اس کی کمی کے دو سبب ہیں: یا تو اصل نشوونما میں مزاج کی خرابی، یا اس قوت میں عارضی فساد جو اس تک پہنچاتی ہے۔ اور یہ (پہلا سبب) ٹھیک نہیں ہو سکتا، جیسا کہ خضر نے اس لڑکے کے بارے میں کہا تھا کہ وہ کافر طبع پیدا ہوا تھا۔ یہ اصل نشوونما میں خرابی ہے۔ اور عارضی امر زائل ہو سکتا ہے اگر وہ قوت میں ہو تو طب کے ذریعے، اور اگر وہ نفس میں ہو تو ریاست کی محبت اور شہوات کی پیروی اسے ان علوم کے حصول سے مشغول کر دیتی ہے جن میں اس کی شرافت اور سعادت ہے۔ پس یہ بھی حق کی پکار سے اس کے دل سے زائل ہو سکتا ہے، تو وہ صحیح فکر کی طرف لوٹتا ہے اور جانتا ہے کہ دنیا مسافر کی منزلوں میں سے ایک منزل ہے اور یہ ایک پل ہے جسے عبور کرنا ہے، اور یہ کہ انسان اگر یہاں علوم، اخلاق حسنہ اور ملأ اعلیٰ کی صفات سے، یعنی طہارت اور ان طبعی شہوات سے پاکیزگی سے جو صحیح نظر اور علوم الٰہیہ کے حصول سے روکتی ہیں، مزین نہ ہو، تو وہ اس میں شروع ہو جاتا ہے۔ پس یہ بھی علوم کی کمی کا سبب ہے۔ اور میں ان علوم سے مراد نہیں لیتا جن کی کمی انسان میں عیب ہو، سوائے علوم الٰہیہ کے۔ ورنہ حقیقت یہ بتاتی ہے کہ وہاں کوئی کمی نہیں ہے، اور انسان ہمیشہ اپنے حواس اور اپنے نفس میں احوال کے تغیرات اور اپنے خواطر کے ذریعے ہمیشہ علم میں اضافے میں رہتا ہے، پس وہ علوم میں اضافے میں ہے لیکن ان میں کوئی فائدہ نہیں ہے۔ اور ظن، شک، نظر، جہل، غفلت اور نسیان، یہ سب اور ان جیسے امور کے ساتھ وہ علم نہیں ہوتا جس میں آپ ہیں، خواہ وہ ظن، شک، نظر، جہل، غفلت یا نسیان کے حکم سے ہو۔\n\n### [علوم ظہور الٰہی: ان کی کمی اور زیادتی]\n\nاور علوم ظہور الٰہی (التجلی) کی کمی اور زیادتی کا معاملہ یہ ہے کہ انسان دو حالتوں میں سے ایک پر ہوتا ہے: انبیاء کا تبلیغ کے لیے خروج، یا اولیاء کا وراثت نبوی کے حکم سے خروج۔ جیسا کہ ابو یزید سے کہا گیا جب انہیں نیابت کی خلعت پہنائی گئی اور ان سے کہا گیا کہ میری صفت کے ساتھ میری مخلوق کی طرف نکلو، پس جس نے تمہیں دیکھا اس نے مجھے دیکھا۔ تو ان کے لیے اپنے رب کے حکم کی تعمیل کے سوا کوئی چارہ نہ تھا۔ پس انہوں نے اپنے رب کی طرف سے اپنے نفس کی جانب ایک قدم بڑھایا تو اس پر غشی طاری ہو گئی۔ تو ندا آئی: میرے حبیب کو واپس لاؤ، کیونکہ وہ مجھ سے صبر نہیں کر سکتے۔ کیونکہ وہ حق میں مستہلک (فنا) تھے، جیسے ابو عقال مغربی۔ پس انہیں ان کی مؤید ارواح کے ذریعے جو ان پر مقرر تھیں، مقام استہلاک (فنا) کی طرف لوٹا دیا گیا جب انہیں خروج کا حکم دیا گیا تھا۔ پس انہیں حق کی طرف لوٹا دیا گیا اور انہیں ذلت، افتقار اور انکسار کی خلعت پہنائی گئی، تو ان کی زندگی خوشگوار ہو گئی اور انہوں نے اپنے رب کو دیکھا، تو ان کے انس میں اضافہ ہوا اور وہ اس عارضی امانت کے بوجھ سے راحت پا گئے جو ان سے واپس لی جانی تھی۔\n\n### [انسان کا عرفان کی سیڑھی میں معراج]\n\nاور انسان جب عرفان کی سیڑھی (سلم المعراج) میں چڑھنا شروع کرتا ہے، تو اسے اس کی معراج کی سیڑھی کے مطابق ظہور الٰہی (التجلی) حاصل ہوتا ہے۔ کیونکہ اہل اللہ میں سے ہر شخص کے لیے ایک خاص سیڑھی ہوتی ہے جس پر اس کے سوا کوئی دوسرا نہیں چڑھتا۔ اور اگر کوئی شخص کسی دوسرے کی سیڑھی پر چڑھتا تو نبوت کسبی ہو جاتی۔ کیونکہ ہر سیڑھی اپنے لیے ایک خاص مرتبہ عطا کرتی ہے ہر اس شخص کو جو اس پر چڑھتا ہے۔ اور اگر علماء انبیاء کی سیڑھی پر چڑھتے تو وہ اس پر چڑھنے سے نبوت حاصل کر لیتے۔ اور معاملہ ایسا نہیں ہے۔ اور امر کے تکرار سے الٰہی وسعت زائل ہو جاتی۔ اور ہمارے نزدیک یہ ثابت ہے کہ اس جناب میں تکرار نہیں ہے۔ البتہ معراج کے تمام درجات کی تعداد انبیاء، اولیاء، مؤمنین اور رسول سب کے لیے برابر ہے، کوئی سیڑھی کسی دوسری سیڑھی سے ایک درجہ بھی زیادہ نہیں ہے۔ پس پہلا درجہ اسلام ہے، جو انقیاد (فرمانبرداری) ہے، اور آخری درجہ عروج میں فنا (الفناء) اور خروج میں بقا (البقاء) ہے۔ اور ان کے درمیان جو باقی ہے وہ ایمان، احسان، علم، تقدیس، تنزیہ، غنی، فقر، ذلت، عزت، تلوین (تغیر) اور تلوین میں تمکین (استحکام) ہے۔ اور فنا (الفناء) اگر آپ خارج ہو رہے ہیں، اور بقا (البقاء) اگر آپ اس کی طرف داخل ہو رہے ہیں۔ اور آپ کے اس سے خروج کے ہر درجے میں، آپ کے باطن میں اتنی کمی ہوتی ہے جتنا آپ کے ظاہر میں علوم ظہور الٰہی (التجلی) میں اضافہ ہوتا ہے، یہاں تک کہ آپ آخری درجے تک پہنچ جائیں۔ پس اگر آپ خارج ہو رہے ہیں اور آخری درجے تک پہنچ گئے، تو وہ اپنی ذات کے ساتھ آپ کے ظاہر میں آپ کی قدر کے مطابق ظاہر ہو گا، اور آپ اس کی مخلوق میں اس کے لیے مظہر ہوں گے، اور آپ کے باطن میں اس سے کچھ بھی باقی نہیں رہے گا، اور باطن کے ظہورات (تجلیات) آپ سے یکسر زائل ہو جائیں گے۔ پھر جب وہ آپ کو اپنی طرف داخل ہونے کی دعوت دیتا ہے، تو یہ پہلا درجہ ہے جس میں وہ آپ کے باطن میں ظہور فرماتا ہے، اس قدر جتنا اس ظہور (التجلی) میں آپ کے ظاہر میں کمی ہوتی ہے، یہاں تک کہ آپ آخری درجے تک پہنچ جائیں، تو وہ آپ کے باطن پر اپنی ذات کے ساتھ ظاہر ہو گا اور آپ کے ظاہر میں کوئی ظہور (التجلی) باقی نہیں رہے گا۔ اور اس کا سبب یہ ہے کہ بندہ اور رب ہمیشہ ایک ساتھ رہیں، ہر ایک کی اپنی ہستی (الوجود) کے کمال میں، تاکہ بندہ ہمیشہ بندہ رہے اور رب ہمیشہ رب رہے، اس زیادتی اور کمی کے ساتھ۔ پس یہ علوم ظہور الٰہی (التجلی) کی ظاہر اور باطن میں زیادتی اور کمی کا سبب ہے، اور اس کا سبب ترکیب (التّركيب) ہے۔ اور اسی لیے اللہ نے جو کچھ بھی پیدا کیا اور وجود بخشا، وہ اپنی عین میں مرکب ہے، اس کا ظاہر بھی ہے اور باطن بھی۔ اور جو ہم بسیط (سادہ) چیزوں کے بارے میں سنتے ہیں، وہ محض معقول امور ہیں جن کا اپنی اعیان میں کوئی وجود نہیں ہے۔ پس اللہ تعالیٰ کے سوا ہر موجود مرکب ہے۔ یہ ہمیں وہ صحیح کشف (الکشف) عطا ہوا ہے جس میں کوئی شک نہیں، اور یہی اس کے لیے افتقار (احتیاج) کو لازم قرار دیتا ہے، کیونکہ یہ اس کی ذاتی صفت ہے۔ اگر آپ سمجھ گئے ہیں تو ہم نے آپ کے لیے راستہ واضح کر دیا ہے اور آپ کے لیے معراج نصب کر دی ہے، پس اس پر چلیں اور عروج کریں، تو آپ دیکھیں گے اور مشاہدہ کریں گے جو ہم نے آپ کے لیے بیان کیا ہے۔ اور جب ہم نے آپ کے لیے معراج کے درجات متعین کر دیے، تو ہم نے اس نصیحت میں کوئی کسر نہیں چھوڑی جس کا ہمیں رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا تھا۔ کیونکہ اگر ہم آپ کے لیے ثمرات اور نتائج بیان کرتے اور ان تک پہنچنے کا راستہ متعین نہ کرتے، تو ہم آپ کو ایک عظیم امر کی طرف شوق دلاتے جس تک پہنچنے کا راستہ آپ نہیں جانتے۔ پس اس ذات کی قسم جس کے ہاتھ میں میری جان ہے، بے شک یہی معراج ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "«باب نوزدهم» در سبب نقصان و ازدیاد علوم\n\nو این سخن خداوند متعال: «و بگو: پروردگارا، بر علم من بیفزا» (وَقُلْ رَبِّ زِدْنِي عِلْماً) و این سخن پیامبر (صلی الله علیه و سلم): «همانا خداوند علم را با بیرون کشیدن آن از سینه‌های دانشمندان قبض نمی‌کند، بلکه با قبض روح دانشمندان آن را قبض می‌کند.»\n\nتجلی (التجلی) هستی (الوجود) حق (الحق) در فلک نفس (النفس) *** دلیلی است بر آنچه در علوم از نقص است.\nو اگر از آن تجلی (التجلی) به ذات خود غایب شود *** آیا کسی او را با جستجو و کاوش درک خواهد کرد؟\nو اگر کثرتی از علم در نفس (النفس) ظاهر شود *** همانا پرده پوشی محقق با نص ثابت شده است.\nو از خورشید هستی (الوجود) و نور آن *** بر عالم ارواح چیزی جز قرص (خورشید) آشکار نشد.\nو چشم در غیر مظهر (محل ظهور) به آن دست نمی‌یابد *** حتی اگر انسان از شدت حرص هلاک شود.\nو در سخن من که آن را پراکنده‌ام شکی نیست *** و آن سخن باطل آراسته و گمان نیست.\n\n### [علم: مراتب و اطوار آن]\n\nبدان، خداوند تو را تأیید کند، که هر حیوانی و هر موجودی که به ادراک (الإدراك) وصف شده باشد، از حیث آن ادراک (الإدراك) در هر نفسی در علم جدیدی است؛ اما ممکن است شخص درک‌کننده از کسانی نباشد که توجه کند آن ادراک، علم است. پس این در نفس‌الامر علم است. بنابراین، متصف شدن علوم به نقصان در حق عالم، به این معناست که میان ادراک (الإدراك) او و بسیاری از چیزهایی که اگر این مانع برایش پیش نمی‌آمد درک می‌کرد، حائل شده است؛ مانند کسی که کوری یا کری یا غیر آن بر او عارض شود. و چون علوم بر حسب معلوم، رفعت و پستی می‌یابند، از این رو همت‌ها به علوم شریف و عالی تعلق گرفته است که اگر انسان به آن‌ها متصف شود، نفس (النفس) او تزکیه یافته و مرتبه‌اش عظیم می‌شود. پس بالاترین مرتبه، علم به خداوند است و عالی‌ترین راه‌ها به سوی علم به خداوند، علم تجلیات (التجلیات) است و پایین‌تر از آن، علم نظر (استدلال) است. و پایین‌تر از نظر، علم الهی نیست، بلکه این‌ها عقایدی در عموم خلق هستند نه علوم. و این علوم همان‌هایی هستند که خداوند پیامبرش (علیه السلام) را به طلب ازدیاد از آن‌ها امر فرمود. خداوند متعال می‌فرماید: «و پیش از آنکه وحی آن بر تو تمام شود، در [خواندن] قرآن شتاب مکن و بگو: پروردگارا، بر علم من بیفزا» (وَلا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضى إِلَيْكَ وَحْيُهُ وَقُلْ رَبِّ زِدْنِي عِلْماً). یعنی: از کلام خود بر من بیفزا تا علم ما به تو افزایش یابد. زیرا در اینجا از علم، علم به شرافت تأنی هنگام وحی، به جهت ادب با معلمی که آن را از جانب پروردگارش برای او آورده، افزوده شده است. و به همین دلیل این آیه را با این سخن دنبال کرد: «و چهره‌ها در برابر [خدای] زنده پاینده خضوع کرده‌اند» (وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ) یعنی ذلیل شدند. پس مراد، علوم تجلی (التجلی) است و تجلی (التجلی) شریف‌ترین راه‌ها برای تحصیل علوم است و آن علوم، علوم اذواق (چشیدن‌های عرفانی) هستند.\n\n### [علم: افزایش و ازدیاد آن]\n\nو بدان که برای ازدیاد و نقصان، باب دیگری نیز هست که ان‌شاءالله آن را ذکر خواهیم کرد. و آن این است که خداوند برای هر چیزی، و نفس (النفس) انسان نیز از جمله آن چیزهاست، ظاهر (الظاهر) و باطنی (الباطن) قرار داده است. پس نفس (النفس) با ظاهر (الظاهر) اموری را درک می‌کند که عین نامیده می‌شوند و با باطن (الباطن) اموری را درک می‌کند که علم نامیده می‌شوند. و حق (الحق) سبحانه، ظاهر (الظاهر) و باطن (الباطن) است، پس ادراک (الإدراك) به واسطه او واقع می‌شود؛ زیرا در توانایی هر آنچه غیر خداست نیست که چیزی را به ذات خود درک کند، بلکه آن را به واسطه آنچه خداوند در او قرار داده درک می‌کند. و تجلی (التجلی) حق (الحق) برای هر کس که بر او تجلی (التجلی) کند، از هر عالمی که باشد، از عالم غیب یا شهادت، تنها از اسم ظاهر (الظاهر) است. اما اسم باطن (الباطن)، از حقیقت این نسبت است که هرگز در آن تجلی (التجلی) واقع نمی‌شود، نه در دنیا و نه در آخرت؛ زیرا تجلی (التجلی) عبارت است از ظهور او برای کسی که بر او تجلی (التجلی) کرده، در آن مَجلا (محل تجلی) که همان اسم ظاهر (الظاهر) است. زیرا معقولیت نسبت‌ها دگرگون نمی‌شود، اگرچه وجود عینی نداشته باشند، اما وجود عقلی دارند و معقول هستند. پس هرگاه حق (الحق) تجلی (التجلی) کند، یا از روی منت یا در پاسخ به سؤالی که در آن است، و بر ظاهر (الظاهر) نفس (النفس) تجلی (التجلی) کند، ادراک (الإدراك) با حس در صورت، در برزخ تمثل واقع می‌شود. پس برای کسی که بر او تجلی (التجلی) شده، افزایش در علوم احکام رخ می‌دهد اگر از علمای شریعت باشد، و در علوم موازین معانی اگر منطقی باشد، و در علوم میزان کلام اگر نحوی باشد. و همچنین صاحب هر علمی از علوم اکوان و غیر اکوان، در نفس (النفس) خود از علمش که در صدد آن است، افزایش می‌یابد. پس اهل این طریقه می‌دانند که این افزایش تنها از آن تجلی (التجلی) الهی برای این اصناف بوده است، زیرا نمی‌توانند آنچه بر ایشان کشف (الکشف) شده را انکار کنند. و غیر عارفان، افزایش را حس می‌کنند و آن را به افکار خود نسبت می‌دهند. و غیر از این دو گروه، افزایش را می‌یابند اما نمی‌دانند که چیزی بر علمشان افزوده شده است. پس مَثَل آن‌ها مانند «مَثَلِ درازگوشی است که کتاب‌هایی را حمل می‌کند. چه بد مَثَلی است برای قومی که آیات خدا را تکذیب کردند» (كَمَثَلِ الْحِمارِ يَحْمِلُ أَسْفاراً بِئْسَ مَثَلُ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآياتِ الله) و آن آیات همین افزایش و اصل آن است. و شگفتا از کسانی که آن را به افکار خود نسبت دادند و ندانستند که فکر و نظر و بحث او در مسئله‌ای از مسائل، از افزایش علوم در نفس (النفس) او از همان تجلی (التجلی) است که ذکر کردیم. پس ناظر مشغول به متعلق نظر خود و نهایت مطلوب خویش است، لذا از علم حال محجوب می‌ماند؛ در حالی که در ازدیاد علم است و خود نمی‌داند. و هرگاه تجلی (التجلی) نیز با اسم ظاهر (الظاهر) بر باطن (الباطن) نفس (النفس) واقع شود، ادراک (الإدراك) با بصیرت در عالم حقایق و معانی مجرد از مواد رخ می‌دهد، و این همان چیزی است که به نصوص تعبیر می‌شود؛ زیرا نص چیزی است که هیچ اشکال و احتمالی در آن نباشد، و این جز در معانی نیست. پس صاحب معانی از رنج فکر آسوده می‌شود و هنگام تجلی (التجلی)، افزایش در علوم الهی و علوم اسرار و علوم باطن (الباطن) و آنچه به آخرت مربوط است، برای او رخ می‌دهد. و این مخصوص اهل طریقت ماست. پس این سبب ازدیاد است.\n\n### [علم: نقصان آن]\n\nاما سبب نقصان آن دو چیز است: یا سوء مزاج در اصل آفرینش، یا فساد عارضی در قوه‌ای که به آن [علم] می‌رساند. و این [سوء مزاج اصلی] جبران نمی‌شود، چنانکه خضر درباره آن نوجوان گفت که او کافر آفریده شده است. این مربوط به اصل آفرینش است. اما امر عارضی، اگر در قوه باشد ممکن است با طبابت زائل شود، و اگر در نفس (النفس) باشد، مشغول شدن آن به حب ریاست و پیروی از شهوات، او را از کسب علومی که شرف و سعادتش در آن است باز می‌دارد. این نیز ممکن است با دعوت حق (الحق) از قلبش زائل شود و به فکر صحیح بازگردد و بداند که دنیا منزلی از منازل مسافر است و پلی است که باید از آن عبور کرد، و اینکه اگر انسان در اینجا نفس (النفس) خود را به علوم و مکارم اخلاق و صفات ملأ اعلی از طهارت و تنزه از شهوات طبیعی که او را از نظر صحیح و کسب علوم الهی باز می‌دارد، آراسته نکند، پس شروع به آن [کسب علوم] می‌کند. پس این نیز سبب نقصان علوم است. و من از علومی که نقصان آن‌ها عیب در انسان محسوب می‌شود، جز علوم الهی را قصد نمی‌کنم. وگرنه حقیقت اقتضا می‌کند که هرگز نقصی وجود ندارد و انسان همیشه و پیوسته در ازدیاد علم است، از جهت آنچه حواسش و دگرگونی‌های احوالش در نفس (النفس) و خواطرش به او می‌دهد. پس او در ازدیاد علوم است، اما منفعتی در آن‌ها نیست. و گمان و شک و نظر و جهل و غفلت و نسیان، همه این‌ها و امثال آن‌ها، با علم به آنچه در آن هستی، به حکم گمان یا شک یا نظر یا جهل یا غفلت یا نسیان همراه نخواهد بود.\n\n### [علوم تجلی (التجلی): نقصان و ازدیاد آن‌ها]\n\nاما نقصان و ازدیاد علوم تجلی (التجلی)، انسان بر یکی از دو حالت است: خروج انبیا برای تبلیغ، یا خروج اولیا به حکم وراثت نبوی. چنانکه به ابویزید گفته شد هنگامی که خلعت نیابت بر او پوشانده شد و به او فرمود: «به سوی خلق من با صفت من خارج شو، پس هر کس تو را ببیند مرا دیده است.» پس او را چاره‌ای جز امتثال امر پروردگارش نبود. گامی از پروردگارش به سوی نفس (النفس) خود برداشت، پس بیهوش شد. ناگهان ندا آمد: «محبوب مرا بازگردانید، زیرا او را صبر دوری از من نیست.» زیرا او مستهلک در حق (الحق) بود، مانند ابوعقال مغربی. پس ارواح موکل و مؤید او، هنگامی که به خروج امر شد، او را به مقام استهلاک در حق (الحق) بازگرداندند. و خلعت ذلت و افتقار و انکسار بر او پوشانده شد، پس زندگی‌اش خوش شد و پروردگارش را دید و انسش افزون گشت و از حمل امانت عاریه‌ای که ناگزیر باید از او گرفته شود، آسوده شد.\n\n### [معراج انسان در نردبان عرفان (المعرفة)]\n\nو انسان از هنگام بالا رفتن در نردبان معراج، تجلی (التجلی) الهی متناسب با نردبان معراج خود خواهد داشت. زیرا برای هر شخصی از اهل الله، نردبانی مخصوص به اوست که غیر او در آن بالا نمی‌رود. و اگر کسی در نردبان دیگری بالا می‌رفت، نبوت اکتسابی می‌شد؛ زیرا هر نردبانی به ذات خود مرتبه‌ای خاص به هر کس که در آن بالا رود می‌دهد. و در این صورت علما در نردبان انبیا بالا می‌رفتند و با بالا رفتن در آن به نبوت می‌رسیدند، در حالی که امر چنین نیست. و اتساع الهی با تکرار امر زائل می‌شد. و نزد ما ثابت شده است که در آن جناب تکراری نیست، جز اینکه تعداد درجات معالی برای همه، انبیا و اولیا و مؤمنان و رسولان، یکسان است و هیچ نردبانی بر نردبان دیگر یک درجه افزون نیست. پس درجه اول اسلام است که همان انقیاد است، و آخرین درجه، فنا (الفناء) در عروج و بقا (البقاء) در خروج است. و میان این دو، آنچه باقی می‌ماند، ایمان و احسان و علم و تقدیس و تنزیه و غنا و فقر و ذلت و عزت و تلوین (دگرگونی حال) و تمکین (ثبات) در تلوین است. و فنا (الفناء) اگر خارج باشی، و بقا (البقاء) اگر به سوی او داخل باشی. و در هر درجه‌ای در خروجت از او، از باطن (الباطن) تو به همان اندازه کاسته می‌شود که بر ظاهر (الظاهر) تو از علوم تجلی (التجلی) افزوده می‌گردد، تا اینکه به آخرین درجه برسی. اگر خارج باشی و به آخرین درجه رسیدی، حق (الحق) به ذات خود در ظاهر (الظاهر) تو به اندازه ظرفیتت ظاهر می‌شود و تو مظهر او در خلقش خواهی بود و اصلاً چیزی از او در باطن (الباطن) تو باقی نمی‌ماند و تجلیات (التجلیات) باطن (الباطن) به کلی از تو زائل می‌شود. پس اگر تو را به دخول به سوی خود فراخواند، آن اولین درجه‌ای است که به همان اندازه که از آن تجلی (التجلی) در ظاهر (الظاهر) تو کاسته می‌شود، در باطن (الباطن) تو تجلی (التجلی) می‌کند، تا اینکه به آخرین درجه برسی، پس بر باطن (الباطن) تو به ذات خود ظاهر می‌شود و اصلاً تجلی (التجلی) در ظاهر (الظاهر) تو باقی نمی‌ماند. و سبب این امر آن است که بنده و رب همواره با هم در کمال هستی (الوجود) هر یک برای خود باشند، پس بنده همواره بنده بماند و رب همواره رب، با وجود این ازدیاد و نقصان. پس این سبب ازدیاد و نقصان علوم تجلیات (التجلیات) در ظاهر (الظاهر) و باطن (الباطن) است و سبب آن، ترکیب است. و به همین دلیل، هر آنچه خداوند خلق کرده و در عین خود ایجاد نموده، مرکب است و ظاهر (الظاهر) و باطن (الباطن) دارد. و آنچه ما از بسیط‌ها می‌شنویم، تنها امور معقولی هستند که در اعیان خود وجود ندارند. پس هر موجودی غیر از خداوند متعال، مرکب است. این همان کشف (الکشف) صحیحی است که هیچ شکی در آن نیست و موجب همراهی افتقار به اوست، زیرا افتقار وصف ذاتی اوست. اگر فهمیدی، پس ما راه را برای تو روشن ساختیم و نردبان معراج را برایت برپا کردیم. پس سلوک کن و عروج نما تا آنچه را برایت بیان کردیم ببینی و مشاهده کنی. و چون درجات معارج را برایت تعیین کردیم، در نصیحتی که رسول خدا (صلی الله علیه و سلم) ما را به آن امر فرمود، کوتاهی نکردیم. زیرا اگر ثمرات و نتایج را برایت وصف می‌کردیم و راه رسیدن به آن‌ها را تعیین نمی‌کردیم، تو را به امری عظیم مشتاق می‌ساختیم که راه وصول به آن را نمی‌دانستی. پس سوگند به آنکه جانم در دست اوست، همانا آن، معراج است. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}