{
  "id": 118,
  "title": {
    "ar": "الباب الثامن عشر ومائة في مقام التوكل",
    "en": "Chapter 118: Concerning the Station (مقام) of Absolute Reliance (التوكل)",
    "ur": "باب ایک سو اٹھارہواں: مقامِ توکل",
    "fa": "باب صد و هجدهم در مقام توکل"
  },
  "content": {
    "ar": "## (الباب الثامن عشر ومائة في مقام التوكل)\n\n\n> من يتخذ رب العباد وكيلا *** سلك الصراط وكان أَقْوَمُ قِيلًا\n\n\n> إن الذي فيه يوكل ربه *** عبد الإله يقارن التنزيلا\n\n\n> يا طالبا ما ليس يعلم ما له *** لا تتخذ غير الإله وكيلا\n\n\n### [التوكل اعتماد القلب على الله مع عدم الاضطراب عند فقد الأسباب‏]\n\n\nالتوكل اعتماد القلب على الله تعالى مع عدم الاضطراب عند فقد الأسباب الموضوعة في العالم التي من شأن النفوس أن تركن إليها فإن اضطرب فليس بمتوكل‏\n\n\n### [التوكل لا يكون للعالم إلا من كونه مؤمنا]\n\n\nوهو من صفات المؤمنين فما ظنك بالعلماء من المؤمنين وإن كان التوكل لا يكون للعالم إلا من كونه مؤمنا كما قيده الله به وما قيده سدى فلو كان من صفات العلماء ويقتضيه العلم النظري ما قيده بالإيمان فلا يقع في التوكل مشاركة من غير المؤمن بأي شريعة كان وسبب ذلك أن الله تعالى لا يجب عليه شي‏ء عقلا إلا ما أوجبه على نفسه فيقبله بصفة الايمان لا بصفة العلم فإنه فَعَّالٌ لِما يُرِيدُ فلما ضمن ما ضمن وأخبر بأنه يفعل أحد\nالممكنين اعتمدنا عليه في ذلك على التعيين وصدقناه لأنه بالدليل والعلم النظري فعلم صدقه فسكوننا وعدم اضطرابنا عند فقد الأسباب إنما هو من إيماننا بضمانه فلو بقينا مع العلم اضطربنا فالعالم إذا سكن فمن كونه مؤمنا وكونه مؤمنا من كونه عالما بصدق الضامن‏\n\n\n### [الوكالة من يستحقها الله أم العالم أم لكل منهما نصيب‏]\n\n\nوتحقيق الوكالة من يستحقها هل الله أو هل العالم أو هل لله منها نصيب وللعالم نصيب فاعلم إن الوكالة لا تصح إلا في موكل فيه وذلك الموكل فيه أمر يكون للموكل ليس لغيره فيقيم فيه وكيلا ويتصرف فيما للموكل أن يتصرف فيه مطلقا فمن نظر أن الأشياء ما عدا الإنسان خلقت من أجل الإنسان كان كل شي‏ء له فيه مصلحة يطلبها بذاته ملكا له ولما جهل مصالح نفسه ومصالحه ما فيها سعادته خاف من سوء التصرف في ذلك وقد ورد فيما أوحى الله لموسى يا ابن آدم خلقت الأشياء من أجلك وخلقتك من أجلي‏\n\n\n### [حظ الناظر الأول في تحقيق الوكالة ومن يستحقها]\n\n\nفقال إذ وقد خلق الأشياء من أجلي فما خلق إلا ما يصلح لي وأنا جاهل بالمصلحة التي في استعمالها نجاتي وسعادتي فلنوكله في أموري فهو أعلم بما يصلح لي فكما أنه خلقها هو أولى بالتصرف فيها هذا يقتضيه نظري وعقلي من غير إن يقترن بذلك أمر إلهي فكيف وقد ورد به الأمر الإلهي فقال لا إِلهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا نبه بهذا الأمر أنه لا ينبغي الوكالة إلا لمن هو إله لأنه عالم بالمصالح إذ هو خالقها كما قال أَ لا يَعْلَمُ من خَلَقَ وهُوَ اللَّطِيفُ الْخَبِيرُ فاتخذه المؤمن العالم وكيلا وسلم إليه أموره وجعل زمامها بيده كما هو في نفس الأمر فما زاد شيئا مما هو الأمر عليه في الوجود ومدحه الله بذلك وما أثر في الملك شيئا وهذا غاية الكرم الثناء بالأثر على غير المؤثر بل الكل منه وإليه فهذا حظ الناظر الأول‏\n\n\n### [حظ الناظر الثاني في تحقيق الوكالة ومن يستحقها]\n\n\nوالناظر الثاني هو أن يقول ما خلق الله الأشياء من أجل الأشياء وإنما خلقها ليسبحه كل جنس من الممكنات بما يليق به من صلاة وتسبيح لتسري عظمته في جميع الأكوان وأجناس الممكنات وأنواعها وأشخاصها فقال كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ وقال وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ فالكل له تعالى ملك وإذا كان الأمر على هذا ولم يخلق على الصورة الإلهية سوانا ووصف نفسه بالغيب عن الأشياء وأسدل الحجب بينها وبين أن ندركه فهو يدركها ولا تدركه لأنها لا تعرفه فأقام الإنسان خليفة وهو الوكيل فقال وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ فحد لنا في الوكالة أمورا لا نتعداها فما هي وكالة مطلقة مثل ما وكلناه نحن فحد حدودا لنا إن تعديناها تعدينا حدود الله ومن يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ‏\n\n\n### [حظ الناظر الثالث في تحقيق الوكالة ومن يستحقها]\n\n\nوعلى النظر الأول جاء القرآن كله فإنه ما قال إلا توكلوا وقال المتوكلون فرجح النظر الأول وهو أن نتخذ وكيلا في المصلحة لنا لا في الأشياء فيجمع بين النظرين وهي حالة ثالثة شهدناها وما رأيناها لأحد من طريقتنا فقلنا إنه خلق الأشياء له لا لنا وأَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ ومن خلقنا افتقارنا إلى ما يكون به صلاحنا حيث كنا من دنيا وآخرة ولا نعلم طريقنا إلى المصلحة لأنه ما خلق الأشياء من أجلنا فوكلناه ليسخر لنا من هذه الأشياء ما يرى فيه المصلحة لنا امتنانا منه وامتثالا لأمره فنكون في توكلنا عليه عبيدا مأمورين ممتثلين أمره نرجو بذلك خيره فوقع التوكل في المصالح لا في عين الأشياء وهذا برزخ دقيق لا يشعر به كل أحد للطافته وهو جمع بين الاثنين وتثبيت للحكمين وإن كان قد تكلم أهل هذا المقام فيه وما من أحد منهم إلا نزع لأحد الطرفين من غير جمع بينهما\n\n\n### [حالات المتوكلين العارفين مع وكيلهم وهو الله رب العالمين‏]\n\n\nفالرجال المنعوتون بهذا المقام منهم من يكون بين يدي الله فيه كالميت بين يدي الغاسل يقلبه كيف يشاء ولا يعترض عليه في شي‏ء ومنهم من حالته فيه حال العبد مع سيده في مال سيده ومنهم من حاله فيه حال الولد مع والده في مال ولده ومنهم من حاله فيه حال الوكيل مع موكله بجعل كان أو بغير جعل‏\n\n\n### [التوكل لا يصح في الإنسان على الإطلاق على الكمال‏]\n\n\nوالذي عليه المحققون وبه نقول إن التوكل لا يصح في الإنسان على الإطلاق على الكمال لأن الافتقار الطبيعي بحكم ذاته فيه والإنسان مركب من أمر طبيعي وملكوتي ولما علم الحق أنه على هذا الحد وقد أمر بالتوكل وما أمر به إلا وهو ممكن الاتصاف به وقد وصف نفسه بالغيرة على الألوهية فأقام نفسه مقام كل شي‏ء في خلقه إذ هو المفتقر إليه بكل وجه وفي كل حال فقال يا أيها الناس وما خص مؤمنا ولا غيره أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ فما افتقرتم إليه من الأشياء هو لنا وبأيدينا وما هو لنا فما يطلب إلا منا فإلينا الافتقار لا إليه إذ هو غير مستقل إلا بنا\n\n\n### [الأحوال التي يصح اتصاف التوكل بها]\n\n\nوليكن للتوكل أحوال يصح الاتصاف بها بها يسمى توكلا وبلغني عن واحد من أهل طريق الله أنه قال بما أشرنا إليه في هذه المسألة متنا وما شممنا لهذا التوكل رائحة لأنه يطلب سريانه في الكل للافتقار الطبيعي الذي فيه والتوكل مقام لا يتبعض إلا بالمجاز ونحن أهل‏\nحقائق فلو صح في وجه كما يزعم هذا المدعي لصح في جميع الوجوه‏\n\n\n### [درجات التوكل عند العارفين‏]\n\n\nوله الدعوى وصاحبه مسئول وله الكشف ودرجاته عند العارفين أربعمائة وسبع وثمانون ودرجات الملاميين فيه أربعمائة وست وخمسون وله نسب إلى العالم كله من ملك وملكوت وجبروت‏\n\n",
    "en": "Chapter One Hundred and Eighteen: Concerning the Station of Reliance upon God (مقام التوكل)\n\nWhoever takes the Lord of the servants as an Agent (وكيلا),\nHe treads the Path and his saying is most upright.\n\nIndeed, the one who relies upon his Lord in it\nIs a servant of God who accompanies the Revelation (التنزيلا).\n\nO seeker of that whose nature he does not know,\nDo not take any agent other than God.\n\n### [Reliance upon God (التوكل): The heart’s dependence upon God coupled with the absence of agitation when the means are lacking.]\n\nReliance upon God (التوكل) is the heart’s (القلب) dependence upon God, the Exalted, coupled with the absence of agitation when the means (الأسباب) established in the World (العالم)—upon which souls naturally rely—are lacking. If the heart is agitated, then that person is not one who relies upon God (متوكل).\n\n### [Reliance upon God (التوكل) only exists for the Knower (العالم) by virtue of his being a Believer (مؤمنا).]\n\nIt is one of the attributes of the believers (مؤمنين); what then do you think of the knowers (علماء) among the believers? Although reliance upon God (التوكل) only exists for the knower by virtue of his being a believer, as God has qualified it, and He does not qualify things in vain. If it were merely an attribute of the knowers, necessitated by theoretical knowledge (العلم النظري), He would not have qualified it with faith (الإيمان). Therefore, no non-believer, regardless of their law (شريعة), can share in reliance upon God. The reason for this is that God, the Exalted, is not obligated by anything rationally, except that which He obligates upon Himself. Thus, one accepts Him through the attribute of faith, not the attribute of knowledge, for He is <<فَعَّالٌ لِما يُرِيدُ>> (Active in what He wills). When He guaranteed what He guaranteed and informed us that He would perform one of the two possibilities, we relied upon Him in that specific matter and believed Him, because His truthfulness is known through demonstration and theoretical knowledge. Our tranquility and lack of agitation when the means are lacking stem only from our faith (إيماننا) in His guarantee. If we remained solely with knowledge (العلم), we would be agitated. Therefore, when the knower (العالم) is tranquil, it is because he is a believer, and his being a believer stems from his being a knower of the truthfulness of the Guarantor.\n\n### [The Agency (الوكالة): Who deserves it—God, or the World, or does each have a share?]\n\nKnow that Agency (الوكالة) is only valid concerning a matter entrusted (موكل فيه), and that entrusted matter is something belonging to the principal (الموكل), not to anyone else. The principal appoints an agent (وكيلا) therein, and the agent acts absolutely in what the principal is entitled to act. Whoever holds the view that things, apart from the human being, were created for the sake of the human being, considers everything in which he seeks a benefit for himself to be his property. However, because he is ignorant of his own interests and the interests that contain his happiness, he fears acting poorly in that regard. It has been related in what God revealed to Moses: \"O Son of Adam, I created things for your sake, and I created you for My sake.\"\n\n### [The share of the First Contemplator (الناظر الأول) in realizing Agency and who deserves it.]\n\nHe said: Since He created things for my sake, He created nothing except what is suitable for me. Yet, I am ignorant of the interest (المصلحة) in their utilization that leads to my salvation and happiness. Therefore, let us appoint Him as Agent (وكيلا) in my affairs, for He knows best what is suitable for me. Just as He created them, He is more entitled to dispose of them. This is what my contemplation (نظري) and intellect (عقلي) necessitate, even without an accompanying Divine command. How much more so when the Divine command has been revealed concerning it, saying: <<لا إِلهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا>> (There is no god but He, so take Him as an Agent). By this command, He drew attention to the fact that Agency (الوكالة) is only appropriate for the One who is God (إله), because He is the Knower of interests, since He is their Creator, as He said: <<أَ لا يَعْلَمُ من خَلَقَ وهُوَ اللَّطِيفُ الْخَبِيرُ>> (Does He who created not know? And He is the Subtle, the All-Aware). The believing knower (المؤمن العالم) thus takes Him as an Agent, submits his affairs to Him, and places their reins in His hand, just as the matter stands in reality. He has added nothing to the reality of the matter in Existence (الوجود). God praised him for this, yet this reliance had no effect on the Dominion (الملك) itself. This is the ultimate generosity: praise for an effect that has no independent influence, but rather everything is from Him and returns to Him. This is the share of the First Contemplator.\n\n### [The share of the Second Contemplator (الناظر الثاني) in realizing Agency and who deserves it.]\n\nThe Second Contemplator holds that God did not create things for the sake of things, but rather created them so that every genus of possibilities (الممكنات) might glorify Him with the prayer and glorification appropriate to it, so that His Greatness might flow through all the realms (الأكوان), genera of possibilities, their types, and their individuals. Thus, He said: <<كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ>> (Each one knows its prayer and its glorification), and He said: <<وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (There is nothing except that it glorifies Him with praise). Thus, everything belongs to Him, the Exalted, as property. Since this is the case, and since no one other than us was created upon the Divine Form (الصورة الإلهية), and He described Himself as hidden from things, drawing veils between them and the possibility of their grasping Him—He grasps them, but they do not grasp Him because they do not know Him—He established the human being as the Vicegerent (خليفة), who is the Agent (الوكيل). He said: <<وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ>> (And spend out of that over which He has made you successors [vicegerents]). Thus, He defined for us certain matters in the Agency that we must not transgress. It is not an absolute agency, like the one we entrusted to Him. He set limits for us; if we transgress them, we transgress the limits of God, and <<ومن يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ‏>> (Whoever transgresses the limits of God has certainly wronged himself).\n\n### [The share of the Third Contemplator (الناظر الثالث) in realizing Agency and who deserves it.]\n\nThe entire Quran follows the First Contemplation, for it only says, \"Rely upon God (توكلوا),\" and speaks of \"those who rely upon God (المتوكلون).\" Thus, the First Contemplation is preferred: that we take an Agent concerning the interest (المصلحة) that is for us, not concerning the things themselves. This combines the two contemplations, resulting in a third state (حالة ثالثة) that we have witnessed, though we have not seen it in anyone else of our path. We say: He created things for His sake, not for ours, and <<أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ>> (He gave everything its creation). Part of our creation is our neediness (افتقارنا) for that which constitutes our well-being (صلاحنا), whether in this world or the Hereafter. We do not know our path to well-being because He did not create things for our sake. Therefore, we appoint Him as Agent so that He may subject these things to us—out of His grace and in compliance with His command—in whatever He sees fit for our interest. Thus, in our reliance upon Him, we are commanded servants (عبيدا مأمورين) complying with His order, hoping for His goodness thereby. Reliance upon God (التوكل) thus occurs concerning the interests (المصالح), not concerning the essence of the things (عين الأشياء). This is a subtle Isthmus (برزخ دقيق) that not everyone perceives due to its subtlety. It is a synthesis of the two views and an affirmation of both rulings, even though the people of this station have spoken about it, and every one of them has inclined toward one of the two extremes without combining them.\n\n### [The states of the Gnostic (العارفين) ones who rely upon God (المتوكلين) with their Agent, who is God, Lord of the Worlds.]\n\nThe men characterized by this station (مقام) include those who are before God in it like the dead body before the washer, who turns it as he wills, and the body offers no objection to anything. Among them are those whose state in it is that of the servant with his master concerning the master’s property. Among them are those whose state in it is that of the child with his father concerning the child’s property. And among them are those whose state in it is that of the agent (الوكيل) with his principal (الموكل), whether by contract or without contract.\n\n### [Reliance upon God (التوكل) is not absolutely valid for the human being in perfection.]\n\nThe realized masters (المحققون) hold, and we agree, that reliance upon God (التوكل) is not absolutely valid for the human being in perfection, because natural neediness (الافتقار الطبيعي) is inherent in him by virtue of his essence (ذاته). The human being is composed of a natural (طبيعي) and a celestial (ملكوتي) element. When the Real (الحق) knew that the human being was of this nature, and yet commanded reliance upon God—and He only commands what is possible to be characterized by—and He described Himself as possessing jealousy over the Divinity (الألوهية), He established Himself in the place of everything in His creation, since He is the One needed in every aspect and in every state. He said: <<يا أيها الناس>> (O mankind)—and He did not specify a believer or a non-believer—<<أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ>> (You are the needy toward Allah, and Allah is the Self-Sufficient, the Praiseworthy). Thus, the things you need are Ours and are in Our hands. What is Ours is sought only from Us. Therefore, the neediness is directed toward Us, not toward the thing itself, since the thing is not independent except through Us.\n\n### [The states by which the attribute of Reliance upon God (التوكل) is valid.]\n\nReliance upon God must have states by which it is valid to be characterized, and by which it is called *Tawakkul*. I was informed that one of the people of God’s path said concerning the matter we alluded to: \"We died and never smelled the scent of this reliance upon God (التوكل).\" This is because he demands its flow throughout the whole due to the natural neediness (الافتقار الطبيعي) inherent in it. Reliance upon God is a station (مقام) that cannot be divided except metaphorically, and we are people of Realities (حقائق). If it were valid in one aspect, as this claimant asserts, it would be valid in all aspects.\n\n### [The degrees of Reliance upon God (التوكل) according to the Gnostics (العارفين).]\n\nHe has the claim, and its claimant is responsible. He possesses the Unveiling (الكشف). Its degrees according to the Gnostics (العارفين) are four hundred and eighty-seven. Its degrees among the People of Blame (الملاميين) are four hundred and fifty-six. It has a relationship to the entire World (العالم), including the Dominion (ملك), the Celestial Realm (ملكوت), and the Realm of Power (جبروت).",
    "ur": "## (باب ایک سو اٹھارہ: مقامِ توکل کے بیان میں)\n\nجو ربِ عباد کو وکیل بناتا ہے،\nوہ صراط پر چلتا ہے اور اس کی بات سب سے سیدھی ہوتی ہے۔\nبے شک وہ شخص جو اپنے رب کو وکیل بناتا ہے،\nوہ اللہ کا بندہ ہے جو تنزیل (وحی) کے ساتھ جڑا ہوا ہے۔\nاے طالب! جو نہیں جانتا کہ اس کے لیے کیا بہتر ہے،\nاللہ کے سوا کسی کو وکیل نہ بنا۔\n\n### [توکل: اسباب کے فقدان پر اضطراب نہ ہونے کے ساتھ اللہ پر قلب کا اعتماد]\n\nتوکل (التوکل) اللہ تعالیٰ پر قلب کا اعتماد ہے، اس کے ساتھ دنیا میں مقرر کردہ اسباب (الأسباب) کے فقدان پر اضطراب (بے چینی) کا نہ ہونا جن کی طرف نفوس کا جھکاؤ ہوتا ہے۔ پس اگر وہ مضطرب ہو جائے تو وہ متوکل نہیں ہے۔\n\n### [توکل عالم کے لیے صرف اس کے مومن ہونے کی حیثیت سے ہوتا ہے]\n\nاور یہ (توکل) مومنین کی صفات میں سے ہے، تو مومن علماء کے بارے میں تمہارا کیا خیال ہے؟ اگرچہ توکل عالم کے لیے صرف اس کے مومن ہونے کی حیثیت سے ہی ہوتا ہے، جیسا کہ اللہ نے اسے اسی کے ساتھ مقید کیا ہے، اور اس نے اسے بے فائدہ مقید نہیں کیا۔ اگر یہ علماء کی صفات میں سے ہوتا اور علم نظری اس کا تقاضا کرتا تو اللہ اسے ایمان کے ساتھ مقید نہ کرتا۔ لہٰذا، توکل میں کسی بھی شریعت کے غیر مومن کی شرکت واقع نہیں ہو سکتی۔ اس کی وجہ یہ ہے کہ اللہ تعالیٰ پر عقلی طور پر کوئی چیز واجب نہیں ہے سوائے اس کے جو اس نے خود پر واجب کر لیا ہے۔ پس وہ اسے صفتِ ایمان کے ساتھ قبول کرتا ہے نہ کہ صفتِ علم کے ساتھ، کیونکہ وہ \"جو چاہتا ہے کرنے والا ہے\" (فَعَّالٌ لِما يُرِيدُ)۔ جب اس نے جو ضمانت دی، وہ دی، اور خبر دی کہ وہ دو ممکنات میں سے ایک کو کرے گا، تو ہم نے اس پر خاص طور پر اعتماد کیا اور اس کی تصدیق کی، کیونکہ دلیل اور علم نظری سے اس کی سچائی معلوم ہو چکی ہے۔ پس اسباب (الأسباب) کے فقدان پر ہمارا سکون اور عدم اضطراب درحقیقت اس کی ضمانت پر ہمارے ایمان کی وجہ سے ہے۔ اگر ہم صرف علم کے ساتھ رہتے تو مضطرب ہو جاتے۔ لہٰذا، عالم جب سکون اختیار کرتا ہے تو وہ اپنے مومن ہونے کی وجہ سے کرتا ہے، اور اس کا مومن ہونا ضامن (اللہ) کی سچائی کو جاننے کی وجہ سے ہے۔\n\n### [وکالت کا مستحق کون ہے؟ اللہ یا عالم یا دونوں کا حصہ ہے؟]\n\nاور وکالت (الوکالة) کی تحقیق یہ ہے کہ اس کا مستحق کون ہے؟ کیا اللہ ہے یا عالم (دنیا) ہے، یا کیا اللہ کا اس میں حصہ ہے اور عالم کا حصہ ہے؟ پس جان لو کہ وکالت (الوکالة) صرف موکل فیہ (جس میں وکالت دی گئی ہو) میں ہی صحیح ہوتی ہے، اور وہ موکل فیہ ایسا معاملہ ہوتا ہے جو موکل کا ہوتا ہے، کسی اور کا نہیں۔ پس وہ اس میں ایک وکیل مقرر کرتا ہے اور وکیل اس میں تصرف کرتا ہے جس میں موکل کو مطلقاً تصرف کا حق ہے۔ پس جس نے یہ دیکھا کہ انسان کے علاوہ تمام اشیاء انسان کے لیے پیدا کی گئی ہیں، تو ہر وہ چیز جس میں اس کے لیے کوئی مصلحت ہو جسے وہ اپنی ذات کے لیے طلب کرتا ہے، وہ اس کی ملکیت ہے۔ اور جب انسان اپنی مصلحتوں اور ان مصلحتوں سے ناواقف ہوا جن میں اس کی سعادت ہے، تو اسے اس میں برے تصرف کا خوف ہوا۔ اور یہ بات اس وحی میں وارد ہوئی ہے جو اللہ نے موسیٰ علیہ السلام پر نازل کی: \"اے ابن آدم! میں نے اشیاء کو تیرے لیے پیدا کیا اور تجھے اپنے لیے پیدا کیا۔\"\n\n### [وکالت کی تحقیق اور اس کے مستحق کے بارے میں پہلے ناظر کا حصہ]\n\nپس اس (پہلے ناظر) نے کہا: چونکہ اس نے اشیاء کو میرے لیے پیدا کیا ہے، تو اس نے صرف وہی پیدا کیا جو میرے لیے مناسب ہے۔ اور میں اس مصلحت سے ناواقف ہوں جس کے استعمال میں میری نجات اور سعادت ہے۔ لہٰذا، ہم اسے اپنے معاملات میں وکیل بنا لیں، کیونکہ وہ زیادہ جانتا ہے کہ میرے لیے کیا مناسب ہے۔ جس طرح اس نے انہیں پیدا کیا، وہی ان میں تصرف کا زیادہ حقدار ہے۔ یہ میرے نظریے اور عقل کا تقاضا ہے، بغیر اس کے کہ اس کے ساتھ کوئی الٰہی حکم شامل ہو۔ تو پھر کیا کہنا جب الٰہی حکم بھی اس کے ساتھ وارد ہوا ہے، جیسا کہ فرمایا:\n\"اس کے سوا کوئی معبود نہیں، پس تم اسی کو کارساز (وکیل) بناؤ۔\" (لَا إِلَهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا)\nاس حکم کے ذریعے اس نے متنبہ کیا کہ وکالت صرف اسی کے لیے مناسب ہے جو الٰہ (معبود) ہو، کیونکہ وہ مصلحتوں کا عالم ہے، چونکہ وہی ان کا خالق ہے، جیسا کہ فرمایا:\n\"کیا وہی نہیں جانے گا جس نے پیدا کیا؟ اور وہ باریک بین، باخبر ہے۔\" (أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ اللَّطِيفُ الْخَبِيرُ)\nپس مومن عالم نے اسے وکیل بنایا اور اپنے معاملات اس کے سپرد کر دیے اور ان کی باگ ڈور اس کے ہاتھ میں دے دی، جیسا کہ حقیقت میں ہے۔ پس اس نے وجود میں اس امر پر کوئی اضافہ نہیں کیا جو پہلے سے موجود تھا، اور اللہ نے اس پر اس کی تعریف کی، اور اس نے ملک (کائنات) میں کوئی اثر نہیں ڈالا۔ اور یہ کمالِ کرم ہے کہ غیر مؤثر پر اثر کے ذریعے تعریف کی جائے، بلکہ سب کچھ اسی کی طرف سے ہے اور اسی کی طرف لوٹنے والا ہے۔ پس یہ پہلے ناظر کا حصہ ہے۔\n\n### [وکالت کی تحقیق اور اس کے مستحق کے بارے میں دوسرے ناظر کا حصہ]\n\nاور دوسرا ناظر یہ کہتا ہے کہ اللہ نے اشیاء کو اشیاء کے لیے پیدا نہیں کیا، بلکہ انہیں اس لیے پیدا کیا تاکہ ممکنات کی ہر جنس اپنی مناسب نماز اور تسبیح کے ذریعے اس کی تسبیح کرے، تاکہ اس کی عظمت تمام اکوان (کائناتوں)، ممکنات کی اجناس، انواع اور اشخاص میں سرایت کر جائے۔ پس فرمایا:\n\"ہر ایک نے اپنی نماز اور اپنی تسبیح کو جان لیا ہے۔\" (كُلٌّ قَدْ عَلِمَ صَلَاتَهُ وَتَسْبِيحَهُ)\nاور فرمایا:\n\"اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے۔\" (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)\nپس سب کچھ اللہ تعالیٰ کی ملکیت ہے۔ اور جب معاملہ یہ ہے، اور اس نے ہمارے سوا کسی کو صورتِ الٰہیہ پر پیدا نہیں کیا، اور اس نے اپنے آپ کو اشیاء سے غیب کے ساتھ موصوف کیا اور ان کے اور ہمارے درمیان پردے ڈال دیے کہ ہم اسے ادراک نہ کر سکیں، پس وہ انہیں ادراک کرتا ہے اور وہ اسے ادراک نہیں کرتیں کیونکہ وہ اسے نہیں پہچانتیں۔ پس اس نے انسان کو خلیفہ مقرر کیا اور وہی وکیل ہے۔ پس فرمایا:\n\"اور اس میں سے خرچ کرو جس میں اس نے تمہیں نائب (مستخلف) بنایا ہے۔\" (وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ)\nپس اس نے ہمارے لیے وکالت میں ایسے امور مقرر کر دیے جن سے ہم تجاوز نہیں کر سکتے۔ لہٰذا، یہ مطلق وکالت نہیں ہے جیسا کہ ہم نے اسے وکیل بنایا ہے۔ پس اس نے ہمارے لیے حدود مقرر کیں، اگر ہم ان سے تجاوز کریں گے تو ہم اللہ کی حدود سے تجاوز کریں گے، اور\n\"جو اللہ کی حدود سے تجاوز کرتا ہے، تو اس نے یقیناً اپنی جان پر ظلم کیا۔\" (وَمَنْ يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ)\n\n### [وکالت کی تحقیق اور اس کے مستحق کے بارے میں تیسرے ناظر کا حصہ]\n\nاور پہلے نظریے کے مطابق پورا قرآن آیا ہے، کیونکہ اس نے صرف توکل کرنے کا حکم دیا اور متوکلین (توکل کرنے والوں) کا ذکر کیا۔ پس اس نے پہلے نظریے کو ترجیح دی، اور وہ یہ ہے کہ ہم اپنے لیے مصلحت میں وکیل بنائیں نہ کہ اشیاء میں۔ پس یہ دونوں نظریوں کو جمع کرتا ہے، اور یہ ایک تیسری حالت ہے جس کا ہم نے مشاہدہ کیا ہے اور اپنے طریقہ (طریقت) کے کسی فرد میں نہیں دیکھا۔ پس ہم نے کہا کہ اس نے اشیاء کو اپنے لیے پیدا کیا ہے نہ کہ ہمارے لیے، اور\n\"اس نے ہر چیز کو اس کی خلقت عطا کی۔\" (وَأَعْطَى كُلَّ شَيْءٍ خَلْقَهُ)\nاور ہماری خلقت میں سے یہ ہے کہ ہم دنیا اور آخرت میں جہاں بھی ہوں، اپنی اصلاح کے لیے ضروری چیزوں کے محتاج ہیں۔ اور ہم مصلحت تک پہنچنے کا راستہ نہیں جانتے، کیونکہ اس نے اشیاء کو ہمارے لیے پیدا نہیں کیا۔ پس ہم نے اسے وکیل بنایا تاکہ وہ ان اشیاء میں سے ہمارے لیے وہ چیزیں مسخر کر دے جن میں وہ ہمارے لیے مصلحت دیکھتا ہے، یہ اس کی طرف سے احسان ہے اور اس کے حکم کی تعمیل ہے۔ پس ہم اس پر اپنے توکل (التوکل) میں ایسے بندے بنتے ہیں جنہیں حکم دیا گیا ہے اور جو اس کے حکم کی تعمیل کرتے ہیں، اور اس کے ذریعے اس کی بھلائی کی امید رکھتے ہیں۔ پس توکل (التوکل) مصالح میں واقع ہوا ہے نہ کہ اشیاء کی عین ذات میں۔ اور یہ ایک باریک برزخ (برزخ دقيق) ہے جس کی لطافت کی وجہ سے ہر کوئی اسے محسوس نہیں کر سکتا۔ اور یہ دونوں (نظریوں) کا مجموعہ ہے اور دونوں احکام کو ثابت کرنا ہے۔ اگرچہ اس مقام کے اہل نے اس میں کلام کیا ہے، لیکن ان میں سے ہر ایک نے دونوں کو جمع کیے بغیر کسی ایک طرف جھکاؤ رکھا ہے۔\n\n### [عارف متوکلین کے اپنے وکیل یعنی اللہ رب العالمین کے ساتھ حالات]\n\nپس وہ رجال (مردانِ حق) جو اس مقام کے ساتھ موصوف ہیں، ان میں سے بعض وہ ہیں جو اس میں اللہ کے سامنے ایسے ہوتے ہیں جیسے غسال کے ہاتھوں میں میت، وہ اسے جیسے چاہے پلٹتا ہے اور وہ کسی چیز میں اعتراض نہیں کرتا۔ اور ان میں سے بعض کی حالت اس میں ایسی ہوتی ہے جیسے آقا کے مال میں غلام کی حالت۔ اور ان میں سے بعض کی حالت اس میں ایسی ہوتی ہے جیسے بیٹے کی اپنے والد کے مال میں حالت۔ اور ان میں سے بعض کی حالت اس میں ایسی ہوتی ہے جیسے وکیل کی اپنے موکل کے ساتھ، خواہ وہ اجرت کے ساتھ ہو یا بغیر اجرت کے۔\n\n### [توکل انسان میں مطلقاً کمال کے ساتھ صحیح نہیں ہو سکتا]\n\nاور جس پر محققین (اہل تحقیق) قائم ہیں اور جسے ہم کہتے ہیں، وہ یہ ہے کہ توکل (التوکل) انسان میں مطلقاً کمال کے ساتھ صحیح نہیں ہو سکتا، کیونکہ اس میں اپنی ذات کے حکم سے طبعی محتاجی (الافتقار الطبيعي) موجود ہے۔ اور انسان طبعی (طبيعي) اور ملکوتی (ملكوتي) امر سے مرکب ہے۔ اور جب الحق (ذات حق) نے جان لیا کہ وہ اس حد پر ہے، اور اس نے توکل کا حکم دیا، اور اس نے اس کا حکم نہیں دیا مگر جب کہ اس کے ساتھ متصف ہونا ممکن ہو۔ اور اس نے اپنے آپ کو الوہیت (الألوهية) پر غیرت کے ساتھ موصوف کیا، پس اس نے اپنی مخلوق میں ہر چیز کی جگہ خود کو قائم کیا، کیونکہ ہر لحاظ سے اور ہر حال میں اسی کی طرف محتاجی ہے۔ پس فرمایا:\n\"اے لوگو!\" (اور اس نے مومن یا غیر مومن کی تخصیص نہیں کی)\n\"تم سب اللہ کے محتاج ہو، اور اللہ ہی بے نیاز، قابل تعریف ہے۔\" (أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ)\nپس جن اشیاء کے تم محتاج ہو، وہ ہمارے لیے ہیں اور ہمارے ہاتھوں میں ہیں، اور جو ہمارے لیے ہے وہ صرف ہم سے ہی طلب کیا جائے گا، پس محتاجی ہماری طرف ہے نہ کہ اس (چیز) کی طرف، کیونکہ وہ ہمارے بغیر مستقل نہیں ہے۔\n\n### [وہ حالات جن کے ساتھ توکل کا اتصاف صحیح ہوتا ہے]\n\nاور توکل (التوکل) کے لیے ایسے حالات ہونے چاہئیں جن کے ساتھ متصف ہونا صحیح ہو، اور اسی کے ذریعے اسے توکل کہا جاتا ہے۔ اور مجھے اہل طریق اللہ میں سے ایک شخص کے بارے میں یہ بات پہنچی ہے کہ اس نے اس مسئلے میں جس کی طرف ہم نے اشارہ کیا ہے، کہا: \"ہم نے اس توکل کی بو تک نہیں سونگھی، کیونکہ وہ اس میں موجود طبعی محتاجی (الافتقار الطبيعي) کی وجہ سے سب میں اس کے سرایت کرنے کا طالب ہے۔ اور توکل ایک مقام ہے جو مجاز کے سوا تقسیم نہیں ہوتا، اور ہم اہل حقائق ہیں۔ پس اگر یہ ایک پہلو سے صحیح ہوتا جیسا کہ یہ دعویٰ کرنے والا گمان کرتا ہے، تو یہ تمام پہلوؤں سے صحیح ہوتا۔\"\n\n### [عارفین کے نزدیک توکل کے درجات]\n\nاور اس (توکل) کا دعویٰ ہے اور اس کا صاحب مسئول (جواب دہ) ہے۔ اور اس کے لیے کشف (الکشف) ہے، اور عارفین (العارفين) کے نزدیک اس کے درجات چار سو ستاسی (۴۸۷) ہیں۔ اور ملامیین (ملامتیوں) کے نزدیک اس کے درجات چار سو چھپن (۴۵۶) ہیں۔ اور اس کا تعلق ملک (دنیا)، ملکوت (عالم ملکوت) اور جبروت (عالم جبروت) سے پورے عالم (کائنات) کے ساتھ ہے۔",
    "fa": "(باب صد و هجدهم در مقام توکل)\n\nآن کس که پروردگار بندگان را وکیل گیرد *** راه را پیموده و گفتارش استوارتر است.\n\nهمانا آن کس که پروردگارش را وکیل می‌سازد *** بنده خداست که با تنزیل (وحی) همراه است.\n\nای طالب آنچه نمی‌دانی چه برای توست *** جز خدا را وکیل مگیر.\n\n### [توکل، اعتماد قلب بر خداست با عدم پریشانی هنگام فقدان اسباب]\n\nتوکل (التوکل)، اعتماد قلب بر خداوند متعال است، همراه با عدم پریشانی هنگام فقدان اسبابی که در عالم قرار داده شده‌اند و نفوس عادت دارند به آن‌ها تکیه کنند؛ پس اگر پریشان شود، متوکل نیست.\n\n### [توکل برای عالم (دانشمند) جز از جهت مؤمن بودن او حاصل نمی‌شود]\n\nو توکل از صفات مؤمنان است، پس گمانت درباره علمای مؤمن چیست؟ اگرچه توکل برای عالم (دانشمند) جز از جهت مؤمن بودن او حاصل نمی‌شود، همان‌گونه که خداوند آن را به ایمان مقید کرده است و این تقیید بیهوده نبوده است. اگر توکل از صفات علما بود و علم نظری آن را اقتضا می‌کرد، خداوند آن را به ایمان مقید نمی‌ساخت. بنابراین، غیر مؤمن، با هر شریعتی که باشد، در توکل مشارکتی ندارد. دلیل این امر آن است که عقلاً هیچ چیزی بر خداوند واجب نیست، مگر آنچه خود بر خویشتن واجب کرده است. پس او (خداوند) آن را با صفت ایمان می‌پذیرد نه با صفت علم؛ زیرا او فَعَّالٌ لِما يُرِيدُ (هر چه بخواهد انجام می‌دهد). هنگامی که او آنچه را ضمانت کرد، ضمانت نمود و خبر داد که یکی از ممکنات را انجام خواهد داد، ما در آن امر به طور مشخص بر او اعتماد کردیم و او را تصدیق نمودیم، زیرا با دلیل و علم نظری، صدق او دانسته شد. پس آرامش ما و عدم پریشانی‌مان هنگام فقدان اسباب، تنها از ایمان ما به ضمانت اوست. اگر تنها با علم باقی می‌ماندیم، پریشان می‌شدیم. بنابراین، عالم (دانشمند) اگر آرام گیرد، از جهت مؤمن بودن اوست، و مؤمن بودن او از جهت عالم بودن او به صدق ضامن است.\n\n### [وکالت را چه کسی سزاوار است؟ آیا خدا یا عالم (انسان) یا هر یک از آن‌ها نصیبی دارند؟]\n\nو تحقیق درباره وکالت (الوکالة) این است که چه کسی سزاوار آن است؟ آیا حق (الحق) یا عالم (انسان) یا آیا برای حق نصیبی از آن هست و برای عالم نصیبی؟ بدان که وکالت تنها در مورد «موکلٌ فیه» (آنچه وکالت داده شده) صحیح است، و آن موکلٌ فیه امری است که متعلق به موکل است و نه دیگری. پس او در آن وکیلی را منصوب می‌کند و وکیل در آنچه موکل حق تصرف مطلق در آن را دارد، تصرف می‌کند. کسی که معتقد است اشیاء، به جز انسان، برای انسان خلق شده‌اند، هر چیزی که در آن مصلحتی برای او باشد و آن را ذاتاً طلب کند، ملک اوست. و چون انسان مصالح خود و مصالحی که سعادتش در آن‌هاست را نمی‌داند، از سوء تصرف در آن می‌ترسد. و در آنچه خداوند به موسی وحی کرد، آمده است: «ای فرزند آدم، اشیاء را برای تو آفریدم و تو را برای خودم آفریدم.»\n\n### [بهره ناظر اول در تحقیق وکالت و اینکه چه کسی سزاوار آن است]\n\nپس گفت: چون اشیاء را برای من آفریده است، جز آنچه برای من صلاح است، نیافریده است؛ و من به مصلحتی که در به کار بردن آن‌هاست و نجات و سعادت من در آن است، جاهلم. پس او را در امور خود وکیل می‌گیریم، زیرا او به آنچه برای من صلاح است، داناتر است. همان‌گونه که او آن‌ها را آفریده، سزاوارتر است که در آن‌ها تصرف کند. این چیزی است که نظر و عقل من اقتضا می‌کند، بدون اینکه امر الهی به آن ضمیمه شود. پس چگونه است در حالی که امر الهی نیز به آن وارد شده است و فرموده: لا إِلهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا (هیچ معبودی جز او نیست، پس او را وکیل بگیر). با این امر، متوجه ساخت که وکالت شایسته نیست مگر برای کسی که إله (معبود) است، زیرا او به مصالح آگاه است، چرا که خالق آن‌هاست، چنانکه فرمود: أَ لا يَعْلَمُ من خَلَقَ وهُوَ اللَّطِيفُ الْخَبِيرُ (آیا کسی که آفریده است نمی‌داند؟ و او لطیف و آگاه است). پس مؤمن عالم او را وکیل گرفت و امور خود را به او سپرد و زمام آن‌ها را به دست او داد، همان‌گونه که در واقع امر چنین است. پس چیزی بر آنچه امر در هستی (الوجود) بر آن است، نیفزود و خداوند او را به این کار ستود، در حالی که در مُلک (جهان) هیچ تأثیری نگذاشت. و این نهایت کرم است که ستایش به سبب اثر بر غیر مؤثر باشد، بلکه همه چیز از اوست و به سوی او باز می‌گردد. این بهره ناظر اول است.\n\n### [بهره ناظر دوم در تحقیق وکالت و اینکه چه کسی سزاوار آن است]\n\nو ناظر دوم کسی است که می‌گوید: خداوند اشیاء را نه برای اشیاء، بلکه آفرید تا هر جنس از ممکنات او را با آنچه شایسته آن است از نماز و تسبیح، تسبیح گوید تا عظمت او در تمامی اکوان و اجناس ممکنات و انواع و اشخاص آن‌ها جاری شود. پس فرمود: كُلٌّ قَدْ عَلِمَ صَلاتَهُ وتَسْبِيحَهُ (هر یک نماز و تسبیح خود را می‌داند) و فرمود: وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ (و هیچ چیز نیست مگر آنکه با ستایش او تسبیح می‌گوید). پس همه چیز ملک اوست. و چون امر بر این منوال است و جز ما کسی بر صورت الهی خلق نشده است و او خود را به غیب بودن از اشیاء وصف کرده و حجاب‌ها را بین آن‌ها و ادراک او آویخته است، پس او آن‌ها را درک می‌کند و آن‌ها او را درک نمی‌کنند، زیرا او را نمی‌شناسند. پس انسان را به عنوان خلیفه (الخليفة) منصوب کرد و او وکیل است. پس فرمود: وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ (و از آنچه شما را در آن جانشین قرار داده است، انفاق کنید). پس برای ما در وکالت اموری را تعیین کرد که نباید از آن‌ها تجاوز کنیم. بنابراین، این وکالت مطلقی نیست مانند آنچه ما او را وکیل گرفتیم. پس برای ما حدودی تعیین کرد که اگر از آن‌ها تجاوز کنیم، از حدود خدا تجاوز کرده‌ایم، و مَن يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ (و هر کس از حدود خدا تجاوز کند، به تحقیق به خود ستم کرده است).\n\n### [بهره ناظر سوم در تحقیق وکالت و اینکه چه کسی سزاوار آن است]\n\nو تمامی قرآن بر اساس نظر اول آمده است، زیرا جز «توکل کنید» نگفته و «متوکلون» (توکل‌کنندگان) را ذکر کرده است. پس نظر اول ترجیح داده شد و آن این است که ما وکیلی را در مصلحت خود بگیریم نه در خود اشیاء. این حالت، جمع بین دو نظر است و حالتی سومی است که ما آن را شهود (الشهود) کرده‌ایم و برای هیچ‌یک از اهل طریقت خود ندیده‌ایم. پس گفتیم: او اشیاء را برای خود آفریده نه برای ما، و أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ (به هر چیزی خلقتش را عطا کرد). و از خلقت ما، نیاز ما به چیزی است که صلاح ما در آن باشد، چه در دنیا و چه در آخرت. و ما راه خود را به مصلحت نمی‌دانیم، زیرا او اشیاء را برای ما نیافریده است. پس او را وکیل گرفتیم تا از این اشیاء آنچه را که مصلحت ما در آن می‌بیند، از روی منت و امتثال امرش، برای ما مسخر سازد. پس ما در توکل (التوکل) بر او، بندگانی هستیم که مأمور و مطیع امر او هستیم و با این کار خیر او را امید داریم. بنابراین، توکل در مصالح واقع می‌شود نه در عین اشیاء. و این یک برزخ (برزخ) دقیق است که به دلیل لطافتش هر کسی آن را درک نمی‌کند، و آن جمع بین دو نظر و تثبیت هر دو حکم است، اگرچه اهل این مقام درباره آن سخن گفته‌اند، اما هیچ‌یک از آن‌ها جز به یکی از دو طرف متمایل نشده‌اند، بدون اینکه بین آن‌ها جمع کنند.\n\n### [حالات متوکلان عارف با وکیلشان که خداوند پروردگار جهانیان است]\n\nپس مردانی که به این مقام توصیف شده‌اند، برخی از آن‌ها در این مقام در برابر خداوند مانند مرده‌ای در دست غسال هستند که او را هرگونه بخواهد می‌گرداند و در هیچ چیز بر او اعتراض نمی‌کند. و برخی از آن‌ها حالشان در این مقام، حال بنده با مولای خود در مال مولاست. و برخی از آن‌ها حالشان، حال فرزند با پدرش در مال فرزند است. و برخی از آن‌ها حالشان، حال وکیل با موکل خود است، چه با اجرت باشد و چه بدون اجرت.\n\n### [توکل به طور مطلق و کامل در انسان صحیح نیست]\n\nو آنچه محققان بر آن هستند و ما نیز به آن قائل هستیم این است که توکل (التوکل) به طور مطلق و کامل در انسان صحیح نیست، زیرا افتقار (نیاز) طبیعی به حکم ذاتش در او وجود دارد و انسان مرکب از امر طبیعی و ملکوت (ملکوت) است. و چون حق (الحق) دانست که انسان بر این حد است و به توکل امر کرده است، و به چیزی امر نکرده مگر آنکه اتصاف به آن ممکن باشد، و خود را به غیرت بر الوهیت (الألوهية) وصف کرده است، پس خود را در مقام هر چیزی در خلقش قرار داد، زیرا اوست که در هر جهت و در هر حال، مورد نیاز است. پس فرمود: ای مردم (و مؤمن و غیر مؤمن را تخصیص نداد): أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ (شما نیازمندان به سوی خدا هستید و خداست که بی‌نیاز و ستوده است). پس آنچه از اشیاء به آن نیازمندید، از آنِ ماست و در دست ماست، و آنچه از آنِ ماست، جز از ما طلب نمی‌شود. پس افتقار (نیاز) به سوی ماست نه به سوی او، زیرا او جز به واسطه ما مستقل نیست.\n\n### [احوالی که اتصاف به توکل با آن‌ها صحیح است]\n\nو برای توکل (التوکل) احوالی است که اتصاف به آن‌ها صحیح است و به واسطه آن‌ها توکل نامیده می‌شود. و از یکی از اهل طریق خدا به من رسیده است که در این مسئله به آنچه اشاره کردیم، گفت: ما مردیم و بوی این توکل را استشمام نکردیم، زیرا او (توکل) خواهان سریان در کل است به دلیل افتقار (نیاز) طبیعی که در آن است، و توکل مقامی است که جز به مجاز تجزیه نمی‌پذیرد، و ما اهل حقائق (الحقائق) هستیم. پس اگر در یک وجه صحیح بود، چنانکه این مدعی گمان می‌کند، باید در تمامی وجوه صحیح باشد.\n\n### [درجات توکل نزد عارفان]\n\nو او (توکل) دارای دعوی است و صاحبش مسئول است، و دارای کشف (الکشف) است. و درجات آن نزد عارفان (العارفین) چهارصد و هشتاد و هفت درجه است، و درجات ملامیان (المالامیین) در آن چهارصد و پنجاه و شش درجه است، و برای آن نسبتی به تمامی عالم از مُلک و ملکوت (ملکوت) و جبروت (جبروت) وجود دارد."
  },
  "page_count": 3
}