{
  "id": 267,
  "title": {
    "ar": "الباب السابع والستون ومائتان في معرفة النفس بسكون الفاء",
    "en": "Chapter Two Hundred and Sixty-Seven, Concerning the Gnosis (معرفة) of the Soul (النفس) with the quiescence of the *fāʾ*.",
    "ur": "باب دو سو سڑسٹھواں: نفس (النفس) کی معرفت کے بیان میں، فاء پر سکون کے ساتھ۔",
    "fa": "باب دویست و شصت و هفتم در معرفت نفس (النفس) با سکون فاء"
  },
  "content": {
    "ar": "## «الباب السابع والستون ومائتان في معرفة النفس بسكون الفاء»\n\n\nوهو عندهم ما كان معلولا من أوصاف العبد وهو المصطلح عليه في الغالب»\n\n\n> النفس من عالم البرازخ *** فكل سر منها يبين‏\n\n\n> مقامها في العلوم شامخ *** وكل صعب بها يهون‏\n\n\n> وروحها في العماء راسخ *** يمده روحه الأمين‏\n\n\n> منسوخها بالنكاح ناسخ *** وسره في الورى دفين‏\n\n\n> سامي العلى مجدها وباذخ *** سبحانه ما يشأ يكون‏\n\n\n### [إن لفظة النفس في اصطلاح القوم على الوجهين‏]\n\n\nاعلم أنه لما كان الغالب في اصطلاح القوم بالنفس أنه المعلول من أوصاف العبد اقتصرنا على الكلام فيه خاصة في هذا الباب فإنهم قد يطلقون النفس على اللطيفة الإنسانية وسنومئ في هذا الباب إن شاء الله إلى النفس ولكن بما هي علة لهذا المعلول فاعلم إن لفظة النفس في اصطلاح القوم على الوجهين من عالم البرازخ حتى النفس الكلية لأن البرزخ لا يكون برزخا إلا حتى يكون ذا وجهين لمن هو برزخ بينهما ولا موجود إلا الله وقد جعل ظهور الأشياء عند الأسباب فلا يتمكن وجود المسبب إلا بالسبب فلكل موجود عند سبب وجه إلى سببه ووجه إلى الله فهو برزخ بين السبب وبين الله فأول البرازخ في الأعيان وجود النفس الكلية فإنها وجدت عن العقل والموجد الله فلها وجه إلى سببها ولها وجه إلى الله فهي أول برزخ ظهر فإذا علمت هذا فالنفس التي هي لطيفة العبد المدبرة هذا الجسم لم يظهر لها عين إلا عند تسوية هذا الجسد وتعديله فحينئذ نفخ فيه الحق من روحه فظهرت النفس بين النفخ الإلهي والجسد المسوي ولهذا كان المزاج يؤثر فيها وتفاضلت النفوس فإنه من حيث النفخ الإلهي لا تفاضل وإنما التفاضل في القوابل فلها وجه إلى الطبيعة ووجه إلى الروح الإلهي فجعلناها من عالم البرازخ وكذلك المعلول من أوصاف العبد من عالم البرازخ فإنه من جهة النفس مذموم عند القوم وأكثر العلماء ومن كونه مضافا إلى الله من حيث هو فعله محمود فكان من عالم البرازخ بين الحمد والذم لا من حيث السبب بل الذم فيه من حيث السبب لا عينه فكل وصف يكون لنفس العبد لا يكون الحق للنفس في ذلك الوصف مشهودا عند وجود عينه فهو معلول فلذلك قيل فيه إنه نفس أي ما شهد فيه سوى نفسه وما رآه من الحق كما يراه بعضهم فيكون الحق مشهودا له فيه وكذلك إذا ظهر عليه هذا الوصف لعلة كونية لا تعلق لها بالله في شهودها ولا خطر عندها نسبة ذلك إلى الله فهو معلول لتلك العلة الكونية التي حركت هذا العبد لقيام هذا الوصف به كمن يقوم مريد العرض من أعراض الدنيا لا يحركه قولا أو فعلا إلا ذلك الغرض وحبه لا يخطر له جانب الحق في ذلك بخاطر فيقال هذه حركة معلولة أي ليس لله فيها مدخل في شهودك كما قال تُرِيدُونَ عَرَضَ الدُّنْيا يعني فداء أسارى بدر فأرسل الخطاب عاما في أعراض الدنيا والله يُرِيدُ الْآخِرَةَ فالعرض القريب هو السبب الظاهر الأول الذي لا تعرف العامة مشهودا سواه والأمر الأخروي غيب عنها وعن أصحاب الغفلة لأنه مشهود بعين الايمان وقد يغيب الإنسان في وقت عن معرفة كونه مؤمنا لشغله بشهود أمر آخر لغفلته ولو مات على تلك الحالة لمات مؤمنا بلا شك مع غفلته فإن الغافل من إذا استحضر حضر والجاهل ليس كذلك لا يحضر إذا استحضر فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Sixty-Seven: Concerning the Knowledge of the *Nafs* (Soul/Self) with the *Fāʾ* having *Sukūn*\n\nAnd it [the *Nafs*] is, according to them, that which is the caused aspect (*ma‘lūl*) among the attributes of the servant, and this is the term generally used.\n\n> The *Nafs* (Soul/Self) is from the World of Isthmuses (عالم البرازخ) / For every secret within it becomes manifest.\n>\n> Its station in the sciences is lofty / And every difficulty is made easy through it.\n>\n> And its spirit is firmly rooted in the Cloud of Unknowing (العماء) / Sustained by the Trustworthy Spirit (روحه الأمين).\n>\n> Its abrogated aspect is the abrogation through marriage / And its secret is hidden among mankind.\n>\n> Its glory is sublime and magnificent / Glory be to Him, whatever He wills comes to be.\n\n### [Indeed, the term *Nafs* in the terminology of the People has two aspects]\n\nKnow that since the prevailing usage of the term *Nafs* (Soul/Self) in the terminology of the People [of Sufism] is that it refers to the caused aspect (*ma‘lūl*) among the attributes of the servant, we have restricted our discussion specifically to this meaning in this chapter. However, they sometimes apply the *Nafs* to the subtle human essence (اللطيفة الإنسانية). In this chapter, God willing, we shall allude to the *Nafs* in its capacity as the cause (*‘illah*) of this caused aspect (*ma‘lūl*).\n\nTherefore, know that the term *Nafs* in the terminology of the People has two aspects, both belonging to the World of Isthmuses (عالم البرازخ), even the Universal Soul (النفس الكلية). This is because an Isthmus (برزخ) is only an Isthmus if it possesses two faces for that which it stands between. There is no existent save Allah, yet He has ordained the manifestation of things through secondary causes (الأسباب). Thus, the existence of the effect (*musabbab*) cannot be realized except through the cause (*sabab*). Therefore, every existent that has a cause possesses one face toward its cause and one face toward Allah. It is thus an Isthmus between the cause and Allah.\n\nThe first of the Isthmuses among the Fixed Entities (الأعيان الثابتة) is the existence of the Universal Soul, for it came into existence from the Intellect (العقل), while the Originator is Allah. Thus, it has a face toward its cause and a face toward Allah, making it the first Isthmus to appear.\n\nIf you have understood this, then the *Nafs* which is the subtle essence of the servant that governs this body did not manifest its entity (عين) until this body was perfected and harmonized (تسوية). It was then that the Real (الحق) breathed into it of His Spirit (روحه). Thus, the *Nafs* appeared between the Divine Breath (النفخ الإلهي) and the perfected body. This is why the temperament (*mizāj*) affects it, and why souls differ in degree. For, from the perspective of the Divine Breath, there is no difference; the difference lies only in the receptive capacities (القوابل). Therefore, the *Nafs* has one face toward Nature (الطبيعة) and one face toward the Divine Spirit (الروح الإلهي), and for this reason, we consider it to be from the World of Isthmuses.\n\nLikewise, the caused aspect (*ma‘lūl*) among the attributes of the servant is from the World of Isthmuses. From the perspective of the *Nafs*, it is blameworthy (مذموم) according to the People [of Sufism] and most scholars; yet, by virtue of its being attributed to Allah as His Act (فعله), it is praiseworthy (محمود). Thus, it is from the World of Isthmuses, standing between praise (الحمد) and blame (الذم)—not blame from the perspective of the cause itself, but blame from the perspective of the secondary cause (*sabab*).\n\nTherefore, every attribute belonging to the servant’s *Nafs* in which the Real (الحق) is not witnessed by the *Nafs* when that attribute manifests is considered a caused attribute (*ma‘lūl*). For this reason, it is said to be *Nafs* (Self), meaning that nothing was witnessed in it except the self, and the person did not see the Real in it, as some others see Him, whereby the Real is witnessed within that attribute. Similarly, if this attribute appears in the servant due to a cosmic cause (*‘illah kawniyyah*) that has no connection to Allah in the servant’s witnessing, and the servant does not consider attributing it to Allah, then it is a caused attribute (*ma‘lūl*) due to that cosmic cause which moved the servant to manifest this attribute.\n\nThis is like someone who acts desiring a worldly gain (عرض من أعراض الدنيا); nothing moves him, neither in word nor deed, except that specific goal and the love for it. The aspect of the Real (جانب الحق) does not cross his mind concerning that action. Such a movement is called a caused movement (*ḥarakah ma‘lūlah*), meaning that Allah has no entry point in your witnessing of it, as He said: <<تُرِيدُونَ عَرَضَ الدُّنْيا>> (You desire the transient goods of this world) [Q. 8:67], referring to the ransom of the prisoners of Badr, though the address was sent generally concerning worldly gains. And Allah <<يُرِيدُ الْآخِرَةَ>> (desires the Hereafter). The immediate gain (العرض القريب) is the first apparent cause (*sabab*) beyond which the common people know no witnessed reality. The matter of the Hereafter is hidden from them and from the people of heedlessness (أصحاب الغفلة), because it is witnessed only by the eye of faith (عين الإيمان). A person may, at times, be unaware of his state of being a believer due to his preoccupation with witnessing some other matter out of his heedlessness. Yet, if he were to die in that state, he would undoubtedly die a believer, despite his heedlessness. For the heedless person (*ghāfil*) is one who, when reminded, becomes present, whereas the ignorant person (*jāhil*) is not like that; he does not become present when reminded. Know this. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the Way) [Q. 33:4].",
    "ur": "## «باب نمبر دو سو سڑسٹھ: نفس کی معرفت میں (جس میں فاء ساکن ہے)»\n\nاور یہ (نفس) اہل تصوف کے نزدیک وہ ہے جو بندے کے اوصاف میں سے معلول (المعلول) ہو، اور یہی وہ اصطلاح ہے جو عام طور پر رائج ہے۔\n\n> نفس عالم برازخ (عالم البرازخ) سے ہے، *** پس ہر راز اس سے ظاہر ہوتا ہے۔\n> علوم میں اس کا مقام بلند ہے، *** اور ہر مشکل اس سے آسان ہوتی ہے۔\n> اس کی روح عماء (العماء) میں پیوست ہے، *** جسے روح الامین (جبرائیل) مدد دیتا ہے۔\n> اس کا منسوخ نکاح کے ذریعے ناسخ ہوتا ہے، *** اور اس کا راز مخلوق میں پوشیدہ ہے۔\n> اس کی بزرگی بلند اور عالی شان ہے، *** پاک ہے وہ (ذات حق) جو چاہتا ہے، ہو جاتا ہے۔\n\n### [بے شک اہل تصوف کی اصطلاح میں لفظ نفس دو پہلوؤں پر مشتمل ہے]\n\nجان لو کہ چونکہ اہل تصوف (القوم) کی اصطلاح میں نفس سے مراد عام طور پر بندے کے اوصاف میں سے معلول (المعلول) ہوتا ہے، اس لیے ہم نے اس باب میں خاص طور پر اسی پر کلام کرنے پر اکتفا کیا ہے۔ اگرچہ وہ کبھی کبھار نفس کا اطلاق لطیفہ انسانیہ (اللطيفة الإنسانية) پر بھی کرتے ہیں۔ ہم اس باب میں ان شاء اللہ نفس کی طرف اشارہ کریں گے، لیکن اس حیثیت سے کہ وہ اس معلول کی علت ہے۔ پس جان لو کہ اہل تصوف کی اصطلاح میں لفظ نفس عالم برازخ (عالم البرازخ) کے دو پہلوؤں پر مشتمل ہے، یہاں تک کہ نفس کلیہ (النفس الکلیۃ) بھی۔ کیونکہ برزخ (البرزخ) تب تک برزخ نہیں ہوتا جب تک کہ اس کے دو رخ نہ ہوں ان دو چیزوں کے لیے جن کے درمیان وہ برزخ ہے۔ اور اللہ کے سوا کوئی موجود نہیں، اور اس نے اسباب کے ذریعے اشیاء کا ظہور مقرر کیا ہے۔ پس مسبب کا وجود سبب کے بغیر ممکن نہیں ہوتا۔ لہٰذا ہر موجود کے لیے سبب کے پاس ایک رخ اپنے سبب کی طرف ہوتا ہے اور ایک رخ اللہ کی طرف ہوتا ہے، پس وہ سبب اور اللہ کے درمیان برزخ ہے۔\n\nاعیان (الأعیان) میں سب سے پہلا برزخ نفس کلیہ (النفس الکلیۃ) کا وجود ہے، کیونکہ وہ عقل سے وجود میں آئی اور وجود بخشنے والا اللہ ہے۔ پس اس کا ایک رخ اپنے سبب کی طرف ہے اور ایک رخ اللہ کی طرف ہے۔ لہٰذا یہ سب سے پہلا برزخ ہے جو ظاہر ہوا۔\n\nجب تم یہ جان چکے، تو وہ نفس جو بندے کا لطیفہ ہے اور اس جسم کی تدبیر کرنے والا ہے، اس کا وجود اس وقت تک ظاہر نہیں ہوا جب تک کہ اس جسد کی تسویہ اور تعدیل نہ ہو گئی۔ تب ذات حق (الحق) نے اس میں اپنی روح سے نفخ کیا، پس نفس نفخ الٰہی (النفخ الإلهي) اور مسویٰ جسد کے درمیان ظاہر ہوا۔ اسی وجہ سے مزاج اس پر اثر انداز ہوتا ہے اور نفوس میں تفاوت پیدا ہوتا ہے، کیونکہ نفخ الٰہی کی حیثیت سے کوئی تفاوت نہیں ہے، بلکہ تفاوت صرف قابل (قبول کرنے والی جگہوں) میں ہے۔ پس اس کا ایک رخ طبیعت کی طرف ہے اور ایک رخ روح الٰہی کی طرف ہے۔ لہٰذا ہم نے اسے عالم برازخ (عالم البرازخ) میں شامل کیا۔\n\nاسی طرح بندے کے اوصاف میں سے معلول (المعلول) بھی عالم برازخ سے ہے۔ کیونکہ نفس کی جہت سے یہ اہل تصوف اور اکثر علماء کے نزدیک مذموم ہے، اور اس حیثیت سے کہ یہ اللہ کی طرف منسوب ہے، اس کا فعل محمود ہے۔ پس یہ حمد اور ذم کے درمیان عالم برازخ میں ہوا، نہ کہ سبب کی حیثیت سے۔ بلکہ اس میں ذم سبب کی حیثیت سے ہے نہ کہ اس کی عین (حقیقت) کی حیثیت سے۔\n\nہر وہ وصف جو بندے کے نفس کے لیے ہو، اور اس وصف کے وجود کے وقت نفس کے لیے اس وصف میں حق (الحق) کا شہود (الشہود) نہ ہو، تو وہ معلول ہے۔ اسی لیے اس کے بارے میں کہا گیا کہ یہ نفس ہے، یعنی اس نے اس میں اپنے نفس کے سوا کسی کا شہود نہیں کیا اور نہ ہی حق کو دیکھا جیسا کہ بعض لوگ دیکھتے ہیں، جس سے حق ان کے لیے اس میں مشہود ہو جاتا ہے۔\n\nاسی طرح اگر یہ وصف کسی ایسی علت کونیہ (کائنات سے متعلق سبب) کی وجہ سے اس پر ظاہر ہو جس کا اس کے شہود میں اللہ سے کوئی تعلق نہ ہو اور نہ ہی اس کے نزدیک اس کی نسبت اللہ کی طرف کرنے کا کوئی خیال ہو، تو وہ اس علت کونیہ کا معلول ہے جس نے اس بندے کو اس وصف کے قیام کے لیے متحرک کیا۔ جیسے کوئی شخص دنیاوی اغراض میں سے کسی غرض کا ارادہ کرتے ہوئے کھڑا ہو، اور اسے قولاً یا فعلاً صرف وہی غرض اور اس کی محبت حرکت دے، اور حق کا پہلو اس کے دل میں نہ آئے، تو کہا جاتا ہے کہ یہ حرکت معلولہ ہے، یعنی تمہارے شہود میں اللہ کا اس میں کوئی دخل نہیں۔ جیسا کہ اللہ تعالیٰ نے فرمایا: **﴿تُرِيدُونَ عَرَضَ الدُّنْيا﴾** (تم دنیا کا مال چاہتے ہو) یعنی بدر کے قیدیوں کا فدیہ۔ پس یہ خطاب دنیاوی اغراض کے بارے میں عام بھیجا گیا، جبکہ اللہ **﴿يُرِيدُ الْآخِرَةَ﴾** (آخرت کا ارادہ کرتا ہے)۔\n\nپس قریب کا عرض (دنیاوی مال) وہ ظاہر پہلا سبب ہے جس کے سوا عام لوگ کسی اور مشہود کو نہیں جانتے، اور امر اخروی ان سے اور غفلت والوں سے غیب ہے، کیونکہ اس کا شہود عین ایمان سے ہوتا ہے۔ اور انسان کبھی کسی دوسرے امر کے شہود میں مشغول ہونے کی وجہ سے اپنی غفلت کے سبب اپنے مومن ہونے کی معرفت سے غائب ہو جاتا ہے۔ اور اگر وہ اسی حالت پر مر جائے تو وہ اپنی غفلت کے باوجود بلاشبہ مومن مرے گا، کیونکہ غافل وہ ہے جو جب یاد کرے تو حاضر ہو جائے، اور جاہل اس کے برعکس ہے، وہ یاد کرنے پر بھی حاضر نہیں ہوتا۔ پس یہ جان لو، اور اللہ **﴿يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ﴾** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و شصت و هفتم در معرفت نفس (با سکون فاء)\n\nو آن (نفس) نزد ایشان (صوفیان) صفتی از اوصاف بنده است که معلول (ناقص) باشد و غالباً اصطلاح بر آن جاری است.\n\n> نفس از عالم برزخ‌هاست (عالم البرازخ) *** پس هر رازی از آن آشکار می‌شود\n> مقامش در علوم بلند است (شامخ) *** و هر دشواری به واسطه آن آسان می‌گردد\n> و روحش در غیب مطلق (العماء) ریشه‌دار است *** که روح امین آن را مدد می‌رساند\n> منسوخ آن با نکاح، ناسخ می‌شود *** و رازش در میان خلق پنهان است\n> عزت و شکوهش بلندمرتبه و والاست *** پاک است او (سبحانه)، هر چه بخواهد می‌شود\n\n### [همانا لفظ نفس در اصطلاح اهل طریقت (القوم) بر دو وجه است]\n\nبدان که چون غالب در اصطلاح اهل طریقت (القوم) این است که نفس، همان صفت معلول (المعلول) از اوصاف بنده است، ما در این باب به طور خاص به سخن گفتن درباره آن اکتفا کردیم. زیرا ایشان گاهی نفس را بر لطیفه انسانی (اللطيفة الإنسانية) نیز اطلاق می‌کنند. و در این باب، ان‌شاءالله، به نفس اشاره خواهیم کرد، اما از آن جهت که علت این معلول است. پس بدان که لفظ نفس در اصطلاح اهل طریقت (القوم) بر دو وجه از عالم برزخ‌ها (عالم البرازخ) است، حتی نفس کلیه (النفس الکلیة). زیرا برزخ، برزخ نمی‌شود مگر آنکه برای کسی که برزخ میان آن دو است، دارای دو وجه باشد. و موجودی جز حق (الله) نیست، و حق (الحق) ظهور اشیاء را به اسباب قرار داده است. پس وجود مسبَّب جز به سبب ممکن نمی‌شود. از این رو، هر موجودی که نزد سببی قرار دارد، یک وجه به سوی سبب خود و یک وجه به سوی حق (الله) دارد؛ پس آن موجود برزخی است میان سبب و حق (الله).\n\nپس اولین برزخ‌ها در اعیان، وجود نفس کلیه (النفس الکلیة) است، زیرا از عقل پدید آمد و پدیدآورنده حق (الله) است. پس نفس کلیه یک وجه به سوی سبب خود و یک وجه به سوی حق (الله) دارد، و از این رو اولین برزخی است که ظاهر شد. حال که این را دانستی، نفس که لطیفه بنده و مدبر این جسم است، عینیتش ظاهر نشد مگر هنگام تسویه و تعدیل این جسد. در آن هنگام، حق (الحق) از روح خود در آن دمید (نفخ)، پس نفس میان نفخ الهی (النفخ الإلهي) و جسد تسویه‌شده ظاهر گشت. به همین دلیل، مزاج در آن تأثیر می‌گذارد و نفوس با یکدیگر متفاوت شدند؛ زیرا از جهت نفخ الهی (النفخ الإلهي) تفاوتی نیست، بلکه تفاوت در قابلیت‌ها (القوابل) است. پس نفس یک وجه به سوی طبیعت و یک وجه به سوی روح الهی دارد، و از این رو ما آن را از عالم برزخ‌ها (عالم البرازخ) قرار دادیم.\n\nو همچنین صفت معلول (المعلول) از اوصاف بنده نیز از عالم برزخ‌ها (عالم البرازخ) است. زیرا از جهت نفس، نزد اهل طریقت (القوم) و بیشتر علما مذموم است، و از جهت انتسابش به حق (الله) - از آن حیث که فعل اوست - محمود است. پس این صفت از عالم برزخ‌ها (عالم البرازخ) است، میان ستایش (الحمد) و نکوهش (الذم). نکوهش آن نه از حیث ذات صفت، بلکه از حیث سبب آن است. پس هر وصفی که برای نفس بنده باشد و حق (الحق) در آن وصف، هنگام وجود عین آن، برای نفس مشهود نباشد، آن وصف معلول است. به همین دلیل درباره آن گفته شده است که «نفس» است؛ یعنی چیزی که بنده در آن جز خود را شهود نکرده و حق (الحق) را ندیده است، برخلاف آنچه برخی دیگر می‌بینند که حق (الحق) در آن برایشان مشهود می‌گردد.\n\nو همچنین اگر این وصف به سبب یک علت کونی (علة کونیة) بر بنده ظاهر شود که در شهود آن، تعلقی به حق (الله) نداشته باشد و نسبت دادن آن به حق (الله) در خاطرش خطور نکند، آن وصف معلول است به واسطه آن علت کونی که این بنده را برای قیام به آن وصف به حرکت درآورده است. مانند کسی که طالب متاعی از متاع‌های دنیاست و هیچ قول یا فعلی او را به حرکت درنمی‌آورد مگر آن غرض و محبت آن؛ و جانب حق (الحق) در آن کار به خاطرش خطور نمی‌کند. پس گفته می‌شود این حرکتی معلول است؛ یعنی در شهود تو، حق (الله) در آن دخالتی ندارد. چنانکه حق (الحق) فرمود: «تُرِيدُونَ عَرَضَ الدُّنْيا» (شما متاع دنیا را می‌خواهید) [سوره انفال، آیه ۶۷] یعنی فدیه اسیران بدر. پس این خطاب را به طور عام در مورد متاع‌های دنیا فرستاد، در حالی که حق (الله) «يُرِيدُ الْآخِرَةَ» (آخرت را می‌خواهد). [سوره انفال، آیه ۶۷] پس متاع نزدیک، همان سبب ظاهر اولی است که عوام جز آن را مشهود نمی‌شناسند، و امر اخروی از ایشان و از اهل غفلت پنهان است، زیرا با چشم ایمان شهود می‌شود. و گاهی انسان در لحظه‌ای از معرفت مؤمن بودن خود غافل می‌شود، به دلیل مشغولیتش به شهود امری دیگر به واسطه غفلتش. و اگر در آن حال بمیرد، بی‌شک با وجود غفلتش، مؤمن مرده است. زیرا غافل کسی است که اگر او را به یاد آورند، حاضر می‌شود؛ اما جاهل چنین نیست و اگر او را به یاد آورند، حاضر نمی‌شود. پس این را بدان، و حق (الله) «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏» (حق را می‌گوید و اوست که راه را می‌نمایاند). [سوره احزاب، آیه ۴]"
  },
  "page_count": 1
}