{
  "id": 407,
  "title": {
    "ar": "الباب السابع وأربعمائة في معرفة منازلة في أسرع من الطرفة تختلس مني إن نظرت إلى غيري لا لضعفي ولكن لضعفك",
    "en": "Chapter 407: On the Gnosis (معرفة) of His Station (منازلة) that is Snatched Away from Me Faster than a Blink of the Eye (طرفة) if I Gaze upon Other-than-Him (غيري), not due to My Weakness, but due to Your Weakness.",
    "ur": "باب چار سو سات (۴۰۷): اس روحانی منزل کی معرفت کے بیان میں جو پلک جھپکنے سے بھی کم وقت میں مجھ سے اچک لی جاتی ہے اگر میں غیر کی طرف دیکھوں، یہ میری کمزوری کے سبب نہیں بلکہ تمہاری کمزوری کے سبب ہے۔",
    "fa": "باب چهارصد و هفتم: در معرفت منزلتی که سریع‌تر از یک چشم بر هم زدن از من ربوده می‌شود، اگر به غیر خود بنگرم؛ نه به سبب ضعف من، بلکه به سبب ضعف تو."
  },
  "content": {
    "ar": "## «الباب السابع وأربعمائة في معرفة منازلة في أسرع من الطرفة تختلس مني إن نظرت إلى غيري لا لضعفي ولكن لضعفك»\n\n\n> التفات المصلي عين اختلاسه *** يلعب الدهر كيف شاء بناسه‏\n\n\n> وهو الدهر والمشيئة منه *** وأناس الزمان عين أناسه‏\n\n\n> كل شي‏ء له لباس مسمى *** وقلوب الرجال عين لباسه‏\n\n\n> وأنا صورة له ثم يخفى *** بوجودي كالظي عند كناسه‏\n\n\n> لحدود قامت بصورة كوني *** يتعالى عنها بأصل أساسه‏\n\n\n### [رجال الأربعة ما هو]\n\n\nدخلت على شيخنا أبي محمد عبد الله الشكاز بأغرناطة من بلاد الأندلس وكان من أهل باغة وهو من أكبر من لقيته في طريق الله فقال لي يا أخي الرجال أربعة وما أَرْسَلْنا قَبْلَكَ إِلَّا رِجالًا رِجالٌ لا تُلْهِيهِمْ تِجارَةٌ ولا بَيْعٌ عَنْ ذِكْرِ الله ورِجالٌ صَدَقُوا ما عاهَدُوا الله عَلَيْهِ وأَذِّنْ في النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجالًا يريد على أرجلهم لا يركبون وعَلَى الْأَعْرافِ رِجالٌ فأراد بالرجال الأربعة حصر المراتب لأنه ما ثم إلا رسول ونبي وولي ومؤمن وما عدا هؤلاء الأربعة فلا اعتبار لهم من حيث أعيانهم لأن الشي‏ء لا يعتبر إلا من حيث منزلته لا من حيث عينه الإنسانية فالإنسانية واحدة العين في كل إنسان وإنما\nيتفاضل الناس بالمنازل لا بالعين حتى في الصورة من جميل وأجمل وغير جميل ولهذا ما جاء رضي الله عنه في ذكر الرجال بأكثر من أربعة فما أراد بالأربعة إلا ما ذكرناه وما أراد بالرجال في هذه الآيات الذكران خاصة وإنما أراد هذا الصنف الإنساني ذكرا كان أو أنثى ولما قلت له في قوله يَأْتُوكَ رِجالًا المراد به من أنى ماشيا على رجله قال رضي الله عنه الرجل لا يكون محمولا والراكب محمول فعلمت ما أراد فإنه قد علم إن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما أسرى به إلا محمولا على البراق فسلمت إليه ما قال وما أعلمته رضي الله عنه إن البقاء على الأصل هو المطلوب لله من الخلق ولهذا ذكره تعالى بقوله وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً يعني موجودا يقول له ينبغي لك أن تكون وأنت في وجودك من الحال معي كما كنت وأنت في حال عدمك من قبولك لاوامري وعدم اعتراضك يأمره بالوقوف عند حدوده ومر اسمه فيتكلم حيث رسم له أن يتكلم ويتكلم بما أمره به أن يتكلم فيكون سبحانه هو المتكلم بذلك على لسان عبده وكذلك في جميع حركاته وسكناته وأحواله الظاهرة والباطنة لا يقول في وجوده إنه موجود بل يرى نفسه على صورته في حال عدمه هذا مراد الحق منه بالخطاب فهو محمول بالأصالة غير مستقل فإن المحدث لا يستقل بالوجود من غير المرجح فلا بد أن يكون محمولا ولهذا ما أسرى برسول قط إلا على براق إذا كان إسراء جسميا محسوسا وإذا كان بالإسراء الخيالي الذي يعبر عنه بالرؤيا فقد يرى نفسه محمولا على مركب وقد لا يرى نفسه محمولا على مركب لكن يعلم أنه محمول في الصورة التي يرى نفسه فيها إذ قد علمنا أن جسمه في فراشه وفي بيته نائم فاعلم ذلك وأما ما ذهب إليه الشيخ من الاستقلال وعدم الركوب فذلك هو الذي يحذر منه فإنه الاختلاس الذي ذكرنا فإن العبد هنا اختلسته نفسه بالاستقلال وهو في نفسه غير مستقل فأخذه ذلك الاختلاس من يد الحق فتخيل أنه غير محمول فلم يعرف نفسه ومن لم يعرف نفسه جهل ربه فكان الغير هنا الذي نظر إليه عين نفسه وذلك لضعفه في العلم بالأصل الذي هو عليه ولا شك أن مرتبة الرسل عليه السلام قد جمعت جميع مراتب الرجال من نبوة وولاية وإيمان وهم المحمولون فمن ورثهم وكان محمولا يعلم ذلك من نفسه وإنما قلنا يعلم ذلك من نفسه لأن الأمر في نفسه أنه محمول ولا بد ولكن من لا علم له بذلك يتخيل أنه غير محمول فلهذا قيدنا وفي قوله يَأْتُوكَ رِجالًا فالذي دعاهم قال لهم قولوا وإِيَّاكَ نَسْتَعِينُ وقال لهم اسْتَعِينُوا بِاللَّهِ واصبر وأو كل معنى محمول بلا شك فإنه غير مستقل بالأمر إذ لو استقل به لما طلب العون والمعين وقوله رضي الله عنه رِجالٌ لا تُلْهِيهِمْ تِجارَةٌ ولا بَيْعٌ عَنْ ذِكْرِ الله فهم في تجارتهم في ذكر الله لأن التجارة على الحد المرسوم الإلهي من ذكر الله كما\n\n\nقالت عائشة عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه كان يذكر الله على كل أحيانه مع كونه يمازح العجوز والصغير\n\n\nوكل ذلك عند العالم ذكر الله لأنه ما من شي‏ء إلا وهو يذكر بالله فمن رأى شيئا لا يذكر الله عند رؤيته فما رآه فإن الله ما وضعه في الوجود إلا مذكرا فلم تلههم التجارة ولا البيع عن ذكر الله وكذلك رِجالٌ صَدَقُوا ما عاهَدُوا الله عَلَيْهِ في أخذ الميثاق الذي أخذ الله عليهم فوفوا به وقيل فيهم صدقوا لأنهم غالبوا فيه وفي الوفاء به الدعاوي المركوزة في النفوس التي أخرجت بعض من أخذ عليه الميثاق أو أكثره عن الوفاء بِما عاهَدَ عَلَيْهُ الله فليس الرجل إلا من صدق مع الله في الوفاء بما أخذ عليه كما صدق النبي فيما أخذ الله عليه في ميثاق النبيين والمرسلين وقوله وعَلَى الْأَعْرافِ رِجالٌ وهم أعظم الرجال في المنزلة فإن لهم الاستشراف على المنازل فما أشار بالأعراف هنا هذا الشيخ إلى من تساوت حسناته وسيئاته وإنما أخذه من حيث منزلة الاستشراف فإن الأعراف هنا هو السور الذي بين الجنة والنار باطِنُهُ فِيهِ الرَّحْمَةُ وهو الذي يلي الجنة وظاهِرُهُ من قِبَلِهِ الْعَذابُ وهو الذي يلي النار فجعل النار من قبله أي يقابله والمقابل ضد فلم يجعل السور محلا للعذاب وجعله محلا للرحمة بقوله باطِنُهُ فِيهِ الرَّحْمَةُ فانظر ما أعجب تنبيه الله عباده بحقائق الأمور على ما هي عليه ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ فأهل الأعراف في محل رحمة الله وذلك هو الذي أطمعهم في الجنة وإن كانوا بعد ما دخلوها ثم ذكر أن لهم المعرفة بمقام الخلق فقال يَعْرِفُونَ كُلًّا بِسِيماهُمْ أي بما جعلنا فيهم من العلامة وقوله ونادَوْا أَصْحابَ الْجَنَّةِ ... لَمْ يَدْخُلُوها فإنهم في مقام الكشف للأشياء فلو دخلوا الجنة استتر عنهم بدخولهم فيها وسترتهم لأنها جنة عن كشف ما هم له كاشفون وقولهم سَلامٌ عَلَيْكُمْ تحية إقبال عليهم لمعرفتهم بهم وتحية لانصرافهم عنهم‏\nإلى جناتهم يقول الله اسْتَعِينُوا بِاللَّهِ واصْبِرُوا ويقول أنا أغنى الشركاء عن الشرك ومعلوم أن الاستعانة شرك في العمل فإن كان العمل له فأين العبد وإن كان للعبد فقد أشرك نفسه فاختلسه هذا القدر من توحيد الأفعال فمن علم أن العبد محل لظهور العمل فلا بد منه ولا بد من القبول إن قيل إنه تعالى أوجد العبد والعمل فلو لم يكن العبد قابلا لإيجاد القادر إياه لما وجد دليلنا المحال فلا بد من قبول الممكن فلا بد من الاشتراك في الإيجاد إن كان في إيجاد العبد فلا بد منه وإن كان في إيجاد العمل التكليفي فلا بد من العبد فعلى كل حال لا بد منك ومنه إلا أنك منعوت بالضعف فقال تعالى الله الَّذِي خَلَقَكُمْ من ضَعْفٍ لكون الممكن لا يستطيع أن يدفع عن نفسه الترجيح على كل حال ثم جعل من بعد ضعف قوة للتكليف إلا أنه لا يستقل فأمر بطلب المعونة فلو لا أن للمكلف نسبة وأثرا في العمل ما صح التكليف ولا صح طلب المعونة من ذي القوة المتين فإن شئت سميت أنت ذلك القدر من الاشتراك كسبا وإن شئت سميته خلقا بعد أن عرفت المعنى وأما أهل الله أرباب الكشف فكما قلنا إن ذلك كله أحكام أعيان الممكنات في العين الوجودية الظاهرة في الصور عن آثار الأسماء الإلهية الحسنى من حيث إن الممكن متصف بها فهي للحق أسماء وهي للممكن نعوت وصفات في حال عدم الممكن لأن وجود عينه من حيث الحقيقة قد بينا أنه لا يتصور فما استفاد الممكن إلا ظهور أحكامه بوجود الصور التي تتبعها أسماء الممكنات فكما أن أسماء الله الحسنى للممكن على طريق النعتية كذلك الأسماء الكونية التي تنطلق على الصور الكائنة في عين الوجود هي أسماء للعين الوجودية قال تعالى قُلْ سَمُّوهُمْ في معرض الدلالة فإذا سموهم قالوا هذا حجر هذا شجر هذا كوكب والكل اسم عبد ثم أبان الحق تعالى ذلك كله ليعقل عنه فقال تعالى إِنْ هِيَ إِلَّا أَسْماءٌ سَمَّيْتُمُوها أَنْتُمْ وآباؤُكُمْ ما أَنْزَلَ الله بِها من سُلْطانٍ فقلتم عن العين من أجل الصورة إنها حجر أو شجر أو كوكب أو أي اسم كان من المعبودين الذين ما لهم اسم الله فما قال أحد من خلق الله أنا الله إلا الله المرقوم في القراطيس إذا نطق يقول أنا الله فتعلم عند ذلك ما معنى قوله أنا الله وإنه حق أعني هذا القول في ذلك اللسان المصطلح عليه ويقوله أيضا العبد الكامل الذي الحق لسانه وسمعه وبصره وقواه وجوارحه كأبي يزيد وأمثاله وما عدا هذين فلا يقول أنا الله وإنما يقول الاسم الخاص الذي له في ذلك اللسان له فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 407: Concerning the Knowledge of its Descent, which is Snatched Away from Me in Less Time Than a Blink of an Eye if I Look Toward Other Than Me—Not Due to My Weakness, but Due to Your Weakness.\n\nThe turning away of the worshipper is the very essence of its being snatched away;\nTime plays with its people however it wills.\n\nHe is Time (الدهر), and the Will proceeds from Him;\nAnd the people of Time are the very essence of His people.\n\nEverything has a designated garment;\nAnd the hearts of men are the very essence of His garment.\n\nAnd I am a form for Him, then He is hidden\nBy my existence, like the gazelle near its lair.\n\nFor limits that arose in the form of my being,\nHe transcends them by the root of His foundation.\n\n### [What are the Four Categories of Men (رجال الأربعة)]\n\nI visited our Shaykh, Abu Muhammad Abdullah al-Shakkaz, in Granada (أغرناطة) in the lands of al-Andalus. He was from the people of Baqha and was one of the greatest I met on the path of Allah. He said to me, \"My brother, men (الرجال) are four categories.\"\n\nHe then cited the verses: <<وَمَا أَرْسَلْنَا قَبْلَكَ إِلَّا رِجَالًا>> (And We did not send before you except men); <<رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ>> (Men whom neither commerce nor selling distracts from the remembrance of Allah); <<وَرِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ>> (And men who were true to what they covenanted with Allah); and <<وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالًا>> (And proclaim among the people the Pilgrimage; they will come to you on foot [رجالًا]), meaning on their legs, not riding; and <<وَعَلَى الْأَعْرَافِ رِجَالٌ>> (And on the Heights [al-A'raf] are men).\n\nBy these four categories of men, he intended to limit the spiritual Levels (المراتب), because there is nothing beyond them except the Messenger (رسول), the Prophet (نبي), the Saint (ولي), and the Believer (مؤمن). Those outside these four have no consideration from the perspective of their Fixed Entities (أعيانهم), because a thing is only considered based on its spiritual station (منزلته), not based on its human essence (عينه الإنسانية). The human essence is one and the same in every human being. People are differentiated by their stations, not by their essence, even regarding physical form—from beautiful, more beautiful, and not beautiful. This is why the Prophet (رضي الله عنه) did not mention more than four categories of men. By the four, he intended only what we have mentioned.\n\nHe did not intend by the term 'men' (الرجال) in these verses males specifically, but rather this human species (الصنف الإنساني), whether male or female. When I asked him about the verse <<يَأْتُوكَ رِجَالًا>> (they will come to you on foot), meaning one who comes walking on his leg, he (رضي الله عنه) said, \"The man is not carried (محمول), while the rider is carried.\" I then understood what he meant. For he knew that the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم) was only transported (أسرى به) while being carried upon the Buraq. So, I submitted to what he said.\n\nI did not inform him (رضي الله عنه) that remaining upon the Origin (الأصل) is what Allah desires from Creation (الخلق). This is why He mentioned it in His saying: <<وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا>> (And I had created you before, when you were nothing)—meaning, nothing existent. He says to him: \"It is incumbent upon you that your state with Me in your existence (وجودك) should be the same as your state in your non-existence (عدمك) regarding your acceptance of My commands and your lack of objection.\"\n\nHe commands him to stand at His limits (حدوده) and the place where His Name passes. He speaks where he has been designated to speak, and he speaks what He commanded him to speak. Thus, the Holy One (سبحانه) is the Speaker through the tongue of His servant. Likewise, in all his movements, stillness, and outward and inward states. He does not claim in his existence that he is existent, but rather sees himself in the form of his state of non-existence. This is what the Real (الحق) intends from him through the Divine Address (الخطاب).\n\nTherefore, he is fundamentally carried (محمول بالأصالة), not independent (غير مستقل). For the originated thing (المحدث) cannot be independent in its Existence (الوجود) without the determining factor (المرجح). Thus, he must necessarily be carried. This is why no Messenger was ever transported except upon the Buraq, if the transportation was physical and sensory. If the transportation was imaginary (الإسراء الخيالي), which is expressed as a vision (الرؤيا), he might see himself carried upon a mount, or he might not see himself carried upon a mount, but he knows that he is carried in the form in which he sees himself, since we know that his body is in his bed and in his house, asleep. Know this.\n\nAs for the Shaykh's view regarding independence (الاستقلال) and not riding, that is precisely what one must beware of, for it is the snatching away (الاختلاس) that we mentioned. Here, the servant is snatched away by his own soul (نفسه) through the claim of independence, while in reality, he is not independent. This snatching away takes him from the hand of the Real, and he imagines that he is not carried. Thus, he does not know himself. And whoever does not know himself is ignorant of his Lord. The 'other' (الغير) that he looked toward was thus his own self (عين نفسه). This is due to his weakness in the knowledge of the Origin (الأصل) upon which he stands.\n\nThere is no doubt that the rank of the Messengers (عليه السلام) encompasses all the ranks of men: Prophethood (نبوة), Sainthood (ولاية), and Faith (إيمان). And they are the ones who are carried (المحمولون). Whoever inherits from them and is carried knows this about himself. We say \"knows this about himself\" because the reality of the matter is that he is necessarily carried, but the one who lacks knowledge of this imagines that he is not carried. Therefore, we added this qualification.\n\nRegarding the verse <<يَأْتُوكَ رِجَالًا>> (they will come to you on foot), the One who called them said to them, \"Say: <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help),\" and He said to them, <<اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا>> (Seek help through Allah and be patient). Every meaning of being carried is without doubt present, for he is not independent in the matter. If he were independent, he would not seek aid (العون) and the Helper (المعين).\n\nAs for his saying (رضي الله عنه), <<رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ>> (Men whom neither commerce nor selling distracts from the remembrance of Allah), they are in the remembrance of Allah (ذكر الله) even within their commerce, because commerce, when conducted according to the prescribed Divine limit (الحد المرسوم الإلهي), is part of the remembrance of Allah.\n\nAs Aisha said about the Messenger of Allah (صَلَّى اللهُ عَليهِ وسَلَّم), he used to remember Allah at all times, even while joking with the old woman and the child.\n\nAll of that is the remembrance of Allah in the view of the Gnostic (العالم), because there is nothing that does not remember Allah. Whoever sees something and does not remember Allah upon seeing it has not truly seen it, for Allah only placed it in Existence as a reminder (مذكرا). Thus, commerce and selling did not distract them from the remembrance of Allah.\n\nLikewise, <<رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ>> (And men who were true to what they covenanted with Allah) refers to the taking of the Covenant (الميثاق) that Allah took from them, and they fulfilled it. It is said they were \"true\" because they struggled against the claims (الدعاوي) embedded in the souls (النفوس) in fulfilling it—claims which led some, or most, of those upon whom the Covenant was taken away from fulfilling <<مَا عَاهَدَ عَلَيْهُ اللَّهَ>> (what they covenanted with Allah). The true man is only he who is truthful with Allah in fulfilling what was taken from him, just as the Prophet was truthful in what Allah took from him in the covenant of the Prophets and Messengers.\n\nAnd His saying, <<وَعَلَى الْأَعْرَافِ رِجَالٌ>> (And on the Heights [al-A'raf] are men)—they are the greatest of men in station, for they have the capacity to overlook (الاستشراف) the stations. The Shaykh here did not refer by al-A'raf to those whose good deeds and bad deeds are equal. Rather, he took it from the perspective of the station of overlooking. Al-A'raf here is the wall (السور) between Paradise (الجنة) and the Fire (النار). <<بَاطِنُهُ فِيهِ الرَّحْمَةُ>> (Its interior contains mercy), which is the side facing Paradise, and <<وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ>> (and its exterior, from its direction, is torment), which is the side facing the Fire. He made the Fire \"from its direction,\" meaning opposite it, and the opposite is the contrary. Thus, He did not make the wall a place of torment, but made it a place of mercy by His saying, <<بَاطِنُهُ فِيهِ الرَّحْمَةُ>> (Its interior contains mercy).\n\nLook at how wondrously Allah alerts His servants to the realities of things as they truly are, <<وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ>> (but most people do not know). The People of al-A'raf are in a place of Allah's mercy, and that is what gives them hope for Paradise, even though they have not yet entered it. Then He mentioned that they possess knowledge of the station of Creation (مقام الخلق) by saying, <<يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ>> (They will recognize each by their marks), meaning by the sign We placed in them.\n\nAnd His saying, <<وَنَادَوْا أَصْحَابَ الْجَنَّةِ ... لَمْ يَدْخُلُوهَا>> (And they called out to the companions of Paradise... while they have not yet entered it). They are in the station of Unveiling (الكشف) of things. If they were to enter Paradise, it would conceal things from them by their entry into it, and it would veil them from the unveiling of that which they are now unveiling.\n\nAnd their saying, <<سَلَامٌ عَلَيْكُمْ>> (Peace be upon you), is a greeting of welcome (تحية إقبال) to them due to their knowledge of them, and a greeting of farewell (تحية انصراف) as they depart from them to their Paradises.\n\nAllah says, <<اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا>> (Seek help through Allah and be patient), and He says, \"I am the richest of partners, having no need of partnership (الشرك).\" It is known that seeking aid (الاستعانة) is partnership in the act (العمل). If the act belongs to Him, where is the servant? And if it belongs to the servant, he has associated himself. This degree of partnership snatches him away from the Unity of Acts (توحيد الأفعال).\n\nWhoever knows that the servant is the locus (محل) for the manifestation of the act—it must necessarily proceed from him, and acceptance (القبول) is necessary. If it is said that He (the Exalted) brought the servant and the act into existence, then if the servant were not receptive (قابلا) to the creation of the All-Powerful (القادر) of him, he would not have existed. Our proof is the impossible. The acceptance of the contingent (الممكن) is necessary. Therefore, partnership in the act of creation is necessary. If it is in the creation of the servant, it is necessary. If it is in the creation of the mandated act (العمل التكليفي), the servant is necessary.\n\nIn every case, both you and He are necessary, except that you are described by weakness (الضعف). Thus, the Exalted said, <<اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ>> (Allah is the one who created you from weakness), because the contingent cannot repel the determination (الترجيح) from itself in any case. Then He established strength after weakness for the purpose of mandate (للتكليف), yet the servant is not independent. So, He commanded the seeking of aid. If the mandated person (المكلف) did not have a relation and an effect in the act, the mandate would not be valid, nor would the seeking of aid from the Possessor of Strength, the Firm One (ذي القوة المتين), be valid. If you wish, you may call that degree of partnership acquisition (كسبًا), and if you wish, you may call it creation (خلقًا), provided you understand the meaning.\n\nAs for the People of Allah (أهل الله), the masters of Unveiling (أرباب الكشف), as we have said, all of that consists of the rulings (أحكام) of the Fixed Entities (أعيان الممكنات) in the existent Essence (العين الوجودية) that manifest in forms (الصور) through the effects of the Most Beautiful Divine Names (الأسماء الإلهية الحسنى). This is because the contingent is described by them; they are Names for the Real (الحق) and they are descriptions and attributes (نعوت وصفات) for the contingent in its state of non-existence, because the existence of its essence, from the perspective of Reality (الحقيقة), we have already shown to be inconceivable.\n\nThe contingent has only benefited from the manifestation of its rulings through the existence of the forms that follow the names of the contingents. Just as the Most Beautiful Names of Allah are for the contingent by way of description, so too the cosmic names (الأسماء الكونية) applied to the existing forms in the very Essence of Existence (عين الوجود) are names for the Existent Essence.\n\nThe Exalted said, <<قُلْ سَمُّوهُمْ>> (Say, 'Name them'), in the context of indication. When they name them, they say, \"This is a stone, this is a tree, this is a star.\" And all of it is the name of a servant ('abd). Then the Real clarified all of that so that He might be understood, saying, <<إِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا أَنْتُمْ وَآبَاؤُكُمْ مَا أَنْزَلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ>> (They are nothing but names which you and your fathers have named, for which Allah has sent down no authority).\n\nSo, you said about the Essence, because of the form, that it is a stone, or a tree, or a star, or whatever name it may be among the worshipped things that do not possess the Name of Allah. No one among Allah's creation has ever said, \"I am Allah,\" except the word 'Allah' inscribed on papers when it speaks, saying, \"I am Allah.\"\n\nYou will then learn the meaning of His saying, \"I am Allah,\" and that it is the truth—I mean this statement spoken by that conventional tongue (اللسان المصطلح عليه). It is also spoken by the Perfect Servant (العبد الكامل) whose tongue, hearing, sight, powers, and limbs the Real has become, such as Abu Yazid and his likes. Other than these two, no one says, \"I am Allah.\" Rather, he says the specific name that belongs to him in that tongue. Know this. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو سات، ان منازل کی معرفت کے بیان میں جو پلک جھپکنے سے بھی کم وقت میں مجھ سے چھین لی جاتی ہیں اگر میں غیر کی طرف دیکھوں، یہ میری کمزوری کی وجہ سے نہیں بلکہ تمہاری کمزوری کی وجہ سے ہے۔\n\nنمازی کا التفات (توجہ ہٹانا) ہی عین اس کا چھین لیا جانا ہے،\nزمانہ اپنے لوگوں کے ساتھ جیسے چاہے کھیلتا ہے۔\n\nاور وہ (ذات حق) ہی زمانہ ہے اور مشیئت (ارادہ) اسی کی طرف سے ہے،\nاور زمانے کے لوگ ہی عین اس کے لوگ ہیں۔\n\nہر شے کے لیے ایک مخصوص لباس ہے،\nاور مردوں کے دل ہی عین اس کا لباس ہیں۔\n\nاور میں اس کی صورت ہوں، پھر وہ میرے وجود کے ذریعے چھپ جاتا ہے،\nجیسے شکار اپنے ٹھکانے پر چھپ جاتا ہے۔\n\nان حدود کے لیے جو میری کونی صورت میں قائم ہوئیں،\nوہ اپنے بنیادی اصل کے ذریعے ان سے بلند ہے۔\n\n### [چار رجال (مردانِ حق) کیا ہیں]\n\nمیں اپنے شیخ ابو محمد عبداللہ الشکاز سے غرناطہ، اندلس کے علاقے میں ملا۔ وہ باغہ کے رہنے والے تھے اور ان عظیم ترین ہستیوں میں سے تھے جن سے میں طریقِ حق میں ملا۔ انہوں نے مجھ سے فرمایا: اے میرے بھائی! رجال (مردانِ حق) چار ہیں۔\n\n(پہلا) \"اور ہم نے آپ سے پہلے نہیں بھیجے مگر مرد (رجال)\" (وَمَا أَرْسَلْنَا قَبْلَكَ إِلَّا رِجَالًا) (الأنبياء: 7).\n(دوسرا) \"ایسے مرد جنہیں تجارت اور خرید و فروخت اللہ کے ذکر سے غافل نہیں کرتی\" (رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ) (النور: 37).\n(تیسرا) \"اور ایسے مرد جنہوں نے اللہ سے کیے ہوئے عہد کو سچ کر دکھایا\" (وَرِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ) (الأحزاب: 23).\n(چوتھا) \"اور لوگوں میں حج کا اعلان کر دو، وہ تمہارے پاس پیدل آئیں گے\" (وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالًا)، یعنی اپنے پیروں پر چل کر آئیں گے، سوار نہیں ہوں گے۔\n(پانچواں) \"اور اعراف پر کچھ مرد ہوں گے\" (وَعَلَى الْأَعْرَافِ رِجَالٌ) (الأعراف: 46).\n\nان چار رجال سے ان کا مقصد مراتب کو محدود کرنا تھا، کیونکہ وہاں رسول، نبی، ولی اور مؤمن کے سوا کوئی نہیں ہے۔ ان چاروں کے علاوہ ان کی اعیان (ذاتوں) کے اعتبار سے کوئی اہمیت نہیں، کیونکہ کسی شے کا اعتبار اس کی منزلت کے لحاظ سے ہوتا ہے، نہ کہ اس کی انسانی عین (ذات) کے لحاظ سے۔ انسانیت ہر انسان میں ایک ہی عین (ذات) ہے، اور لوگ صرف منازل کے اعتبار سے ایک دوسرے سے افضل ہوتے ہیں، نہ کہ عین کے اعتبار سے، یہاں تک کہ صورت میں بھی (جیسے) خوبصورت، زیادہ خوبصورت اور غیر خوبصورت۔ اسی لیے (شیخ) نے رجال کے ذکر میں چار سے زیادہ کا ذکر نہیں کیا۔ ان چار سے ان کا مقصد وہی تھا جو ہم نے ذکر کیا، اور ان آیات میں رجال سے مراد صرف مذکر نہیں ہیں، بلکہ اس سے مراد یہ انسانی صنف ہے، خواہ وہ مذکر ہو یا مؤنث۔\n\nجب میں نے ان سے قولِ باری تعالیٰ \"يَأْتُوكَ رِجَالًا\" (وہ تمہارے پاس پیدل آئیں گے) کے بارے میں پوچھا کہ اس سے مراد وہ ہے جو اپنے پاؤں پر چل کر آئے، تو انہوں نے فرمایا: \"رجل (پیدل چلنے والا) محمول (اٹھایا ہوا) نہیں ہوتا، جبکہ سوار محمول ہوتا ہے۔\" میں ان کی مراد سمجھ گیا، کیونکہ وہ جانتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کو معراج میں براق پر سوار کر کے ہی لے جایا گیا تھا۔ میں نے ان کی بات تسلیم کر لی۔\n\nاور میں نے انہیں یہ نہیں بتایا کہ اصل پر باقی رہنا ہی مخلوق سے اللہ کا مطلوب ہے۔ اسی لیے اللہ تعالیٰ نے اسے اپنے اس قول سے ذکر فرمایا: \"اور میں نے تمہیں اس سے پہلے پیدا کیا جبکہ تم کوئی شے نہ تھے\" (وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا) (مریم: 9). یعنی موجود۔ وہ (اللہ) اس سے فرماتا ہے کہ تمہارے لیے ضروری ہے کہ تم اپنے وجود میں میرے ساتھ اسی حال پر رہو جس حال پر تم اپنے عدم (غیر موجودگی) میں تھے، یعنی میرے احکام کو قبول کرنے اور اعتراض نہ کرنے کے لحاظ سے۔ وہ اسے اپنی حدود پر ٹھہرنے کا حکم دیتا ہے، اور اس کا نام گزرتا ہے، تو وہ وہیں کلام کرتا ہے جہاں اسے کلام کرنے کا حکم دیا گیا ہے، اور وہ وہی کلام کرتا ہے جس کا اسے حکم دیا گیا ہے۔ پس سبحانہ و تعالیٰ ہی اپنے بندے کی زبان پر متکلم (کلام کرنے والا) ہوتا ہے۔ اسی طرح اس کی تمام حرکات و سکنات اور ظاہری و باطنی احوال میں، وہ اپنے وجود میں یہ نہیں کہتا کہ وہ موجود ہے، بلکہ وہ اپنے آپ کو اپنے عدم (غیر موجودگی) کی حالت کی صورت پر دیکھتا ہے۔\n\nیہ خطاب کے ذریعے الحق (ذات حق) کی اس سے مراد ہے۔ پس وہ اصالتاً محمول (اٹھایا ہوا) ہے، غیر مستقل (آزاد) نہیں۔ کیونکہ محدث (پیدا کی گئی شے) مرجح (ترجیح دینے والے) کے بغیر وجود (الوجود) میں خود مختار نہیں ہو سکتی۔ لہٰذا اس کا محمول ہونا ضروری ہے۔ اسی لیے کسی رسول کو کبھی بھی براق کے بغیر معراج نہیں کرائی گئی، اگر وہ جسمانی اور محسوس معراج ہو۔ اور اگر معراج خیالی ہو، جسے خواب سے تعبیر کیا جاتا ہے، تو وہ اپنے آپ کو کسی سواری پر محمول دیکھ سکتا ہے، اور کبھی سواری پر محمول نہیں بھی دیکھتا، لیکن وہ جانتا ہے کہ وہ اس صورت میں محمول ہے جس میں وہ اپنے آپ کو دیکھتا ہے، کیونکہ ہم جانتے ہیں کہ اس کا جسم اس کے بستر پر اور اس کے گھر میں سو رہا ہے۔ پس یہ جان لو۔\n\nاور جہاں تک شیخ کا استقلال (خود مختاری) اور سوار نہ ہونے کی طرف جانا ہے، تو یہ وہی ہے جس سے ڈرایا جاتا ہے، کیونکہ یہ وہی اختلاس (چھین لیا جانا) ہے جس کا ہم نے ذکر کیا۔ کیونکہ یہاں بندے کو اس کے نفس نے استقلال کے ذریعے چھین لیا، حالانکہ وہ اپنی ذات میں غیر مستقل ہے۔ پس اس اختلاس نے اسے الحق (ذات حق) کے ہاتھ سے لے لیا۔ اس نے یہ گمان کیا کہ وہ محمول نہیں ہے، لہٰذا اس نے اپنے نفس کو نہ پہچانا، اور جس نے اپنے نفس کو نہ پہچانا، اس نے اپنے رب کو نہ جانا (المعرفۃ). پس یہاں جس غیر کی طرف اس نے دیکھا، وہ عین اس کا اپنا نفس تھا، اور یہ اس اصل کے علم میں اس کی کمزوری کی وجہ سے تھا جس پر وہ قائم ہے۔\n\nاور اس میں کوئی شک نہیں کہ رسولوں علیہم السلام کا مرتبہ رجال کے تمام مراتب (نبوت، ولایت، اور ایمان) کو جمع کرتا ہے، اور وہ محمولون (اٹھائے ہوئے) ہیں۔ پس جس نے ان کی وراثت پائی اور محمول ہوا، وہ یہ بات اپنے نفس سے جانتا ہے۔ اور ہم نے یہ اس لیے کہا کہ وہ اپنے نفس سے جانتا ہے، کیونکہ معاملہ اپنی ذات میں یہ ہے کہ وہ محمول ہے اور لازمی ہے۔ لیکن جسے اس کا علم نہیں ہوتا، وہ یہ گمان کرتا ہے کہ وہ غیر محمول ہے، اسی لیے ہم نے یہ قید لگائی۔\n\nاور اس کے قول \"يَأْتُوكَ رِجَالًا\" (وہ تمہارے پاس پیدل آئیں گے) کے بارے میں، جس نے انہیں بلایا، اس نے ان سے کہا کہ کہو: \"اور ہم تجھ ہی سے مدد مانگتے ہیں\" (وَإِيَّاكَ نَسْتَعِينُ) (الفاتحة: 5). اور ان سے کہا: \"اللہ سے مدد مانگو اور صبر کرو\" (اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا). اور ہر معنی میں محمول ہونا بلا شک ہے، کیونکہ وہ امر میں مستقل نہیں ہے۔ اگر وہ مستقل ہوتا تو مدد اور مددگار طلب نہ کرتا۔\n\nاور ان کا قول \"رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ\" (ایسے مرد جنہیں تجارت اور خرید و فروخت اللہ کے ذکر سے غافل نہیں کرتی)، تو وہ اپنی تجارت میں بھی اللہ کے ذکر میں ہوتے ہیں۔ کیونکہ الٰہی حد پر قائم تجارت اللہ کے ذکر میں شامل ہے، جیسا کہ حضرت عائشہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کے بارے میں فرمایا کہ آپ ہر حال میں اللہ کا ذکر کرتے تھے، باوجود اس کے کہ آپ بوڑھی عورتوں اور بچوں سے مزاح بھی کرتے تھے۔ اور عالم (جاننے والے) کے نزدیک یہ سب اللہ کا ذکر ہے، کیونکہ کوئی شے ایسی نہیں جو اللہ کے ذریعے ذکر نہ کر رہی ہو۔ پس جس نے کسی شے کو دیکھا اور اس کے دیکھنے پر اللہ کا ذکر نہ کیا، تو اس نے اسے دیکھا ہی نہیں۔ کیونکہ اللہ نے اسے وجود (الوجود) میں رکھا ہی نہیں مگر اس حال میں کہ وہ ذکر کرنے والا ہو۔ پس تجارت اور خرید و فروخت نے انہیں اللہ کے ذکر سے غافل نہیں کیا۔\n\nاسی طرح \"وَرِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ\" (اور ایسے مرد جنہوں نے اللہ سے کیے ہوئے عہد کو سچ کر دکھایا)، یہ اس میثاق (عہد) کے بارے میں ہے جو اللہ نے ان سے لیا تھا، پس انہوں نے اسے پورا کیا۔ اور انہیں صادق اس لیے کہا گیا کہ انہوں نے اس میں اور اس کے پورا کرنے میں ان دعووں پر غلبہ پایا جو نفوس میں پیوست تھے، جنہوں نے بعض یا اکثر ان لوگوں کو جن سے میثاق لیا گیا تھا، اس عہد کو پورا کرنے سے روک دیا۔ پس رجل (مردِ حق) وہی ہے جو اللہ کے ساتھ اس عہد کو پورا کرنے میں سچا ہو جو اس سے لیا گیا، جیسا کہ نبی نے اس عہد کو سچ کر دکھایا جو اللہ نے نبیوں اور رسولوں کے میثاق میں ان سے لیا تھا۔\n\nاور اس کا قول \"وَعَلَى الْأَعْرَافِ رِجَالٌ\" (اور اعراف پر کچھ مرد ہوں گے)، یہ منزلت میں سب سے عظیم رجال ہیں، کیونکہ انہیں منازل پر جھانکنے (استشراف) کا موقع ملتا ہے۔ اس شیخ نے یہاں اعراف سے ان لوگوں کی طرف اشارہ نہیں کیا جن کی نیکیاں اور برائیاں برابر ہوں، بلکہ انہوں نے اسے استشراف (جھانکنے) کی منزلت کے لحاظ سے لیا۔ کیونکہ یہاں اعراف وہ دیوار ہے جو جنت اور دوزخ کے درمیان ہے، \"اس کا باطن جس میں رحمت ہے\" (بَاطِنُهُ فِيهِ الرَّحْمَةُ)، اور یہ وہ حصہ ہے جو جنت کی طرف ہے۔ اور \"اس کا ظاہر جس کی طرف سے عذاب ہے\" (وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ)، اور یہ وہ حصہ ہے جو دوزخ کی طرف ہے۔ پس اس نے دوزخ کو اس کے \"قِبل\" (طرف) سے بنایا، یعنی اس کے مقابل۔ اور مقابل ضد ہوتا ہے۔ پس اس نے دیوار کو عذاب کی جگہ نہیں بنایا، بلکہ اسے رحمت کی جگہ بنایا اپنے قول \"بَاطِنُهُ فِيهِ الرَّحْمَةُ\" کے ذریعے. پس دیکھو کہ اللہ اپنے بندوں کو حقائقِ امور پر کس قدر عجیب طریقے سے متنبہ کرتا ہے، \"لیکن اکثر لوگ نہیں جانتے\" (وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ). پس اہل اعراف اللہ کی رحمت کی جگہ پر ہیں، اور یہی وہ چیز ہے جس نے انہیں جنت کی امید دلائی، اگرچہ وہ ابھی اس میں داخل نہیں ہوئے۔ پھر ذکر کیا کہ انہیں مخلوق کے مقام کی معرفت (المعرفۃ) حاصل ہے، پس فرمایا: \"وہ ہر ایک کو ان کی نشانیوں سے پہچانیں گے\" (يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ)، یعنی ان علامتوں سے جو ہم نے ان میں رکھی ہیں۔ اور اس کا قول: \"اور وہ جنت والوں کو پکاریں گے... حالانکہ وہ اس میں داخل نہیں ہوئے ہوں گے\" (وَنَادَوْا أَصْحَابَ الْجَنَّةِ... لَمْ يَدْخُلُوهَا)، کیونکہ وہ اشیاء کے کشف (الکشف) کے مقام پر ہیں۔ اگر وہ جنت میں داخل ہو جاتے تو ان کا داخلہ انہیں (حقائق سے) چھپا دیتا اور جنت انہیں چھپا لیتی، کیونکہ وہ اس کشف (الکشف) سے پردہ ہے جس کے وہ کاشف ہیں۔ اور ان کا قول \"سَلَامٌ عَلَيْكُمْ\" (تم پر سلامتی ہو) ان کی طرف متوجہ ہونے کا سلام ہے، کیونکہ وہ انہیں پہچانتے ہیں، اور ان کے اپنی جنتوں کی طرف جانے پر ان سے رخصت ہونے کا سلام ہے۔\n\nاللہ فرماتا ہے: \"اللہ سے مدد مانگو اور صبر کرو\" (اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا)، اور وہ یہ بھی فرماتا ہے: \"میں شرکاء میں شرک سے سب سے زیادہ بے نیاز ہوں\"۔ اور یہ معلوم ہے کہ استعانت (مدد مانگنا) عمل میں شرک ہے۔ اگر عمل صرف اسی (الحق) کے لیے ہے تو بندہ کہاں ہے؟ اور اگر بندے کے لیے ہے تو اس نے اپنے نفس کو شریک کر لیا۔ پس اس قدر نے اسے توحید الافعال (افعال کی توحید) سے چھین لیا۔ پس جس نے یہ جان لیا کہ بندہ عمل کے ظہور کا محل ہے، تو اس کا ہونا ضروری ہے، اور قبولیت کا ہونا بھی ضروری ہے۔ اگر یہ کہا جائے کہ اللہ تعالیٰ نے بندے اور عمل کو وجود بخشا، تو اگر بندہ قادر کے اسے وجود بخشنے کو قبول نہ کرتا تو ہماری محال دلیل وجود میں نہ آتی۔ پس ممکن (الممکن) کی قبولیت ضروری ہے۔ پس ایجاد (وجود بخشنے) میں اشتراک ضروری ہے۔ اگر یہ بندے کے ایجاد میں ہے تو بندے کا ہونا ضروری ہے، اور اگر یہ تکلیفی عمل کے ایجاد میں ہے تو بندے کا ہونا ضروری ہے۔ پس بہر حال تم اور وہ (الحق) دونوں ضروری ہیں، سوائے اس کے کہ تم ضعف (کمزوری) سے متصف ہو۔ پس اللہ تعالیٰ نے فرمایا: \"اللہ ہی ہے جس نے تمہیں کمزوری سے پیدا کیا\" (اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ) (الروم: 54). کیونکہ ممکن (الممکن) ہر حال میں اپنے آپ سے ترجیح کو دور نہیں کر سکتا۔ پھر اس نے ضعف کے بعد تکلیف (شرعی ذمہ داری) کے لیے قوت پیدا کی، لیکن وہ مستقل نہیں ہے، لہٰذا اسے مدد طلب کرنے کا حکم دیا گیا۔ اگر مکلف (ذمہ دار شخص) کا عمل میں کوئی نسبت اور اثر نہ ہوتا تو نہ تکلیف صحیح ہوتی اور نہ ہی ذی القوۃ المتین (قوت والے، مضبوط) سے مدد طلب کرنا صحیح ہوتا۔ پس اگر تم چاہو تو تم اشتراک کی اس مقدار کو کسب (کمائی) کا نام دو، اور اگر چاہو تو اسے خلق (تخلیق) کا نام دو، بشرطیکہ تم معنی کو جان چکے ہو۔\n\nاور جہاں تک اہل اللہ، یعنی اربابِ کشف (الکشف) کا تعلق ہے، تو جیسا کہ ہم نے کہا، یہ سب ممکنات (الممکنات) کی اعیان (ذاتوں) کے احکام ہیں جو وجودی عین (العین الوجودیہ) میں ظاہر ہوتے ہیں، جو اسماء الٰہیہ حسنیٰ کے آثار سے صورتوں میں ظاہر ہوتے ہیں۔ اس لحاظ سے کہ ممکن ان سے متصف ہے، تو وہ الحق (ذات حق) کے لیے اسماء ہیں، اور ممکن کے لیے نعوت (اوصاف) اور صفات ہیں، ممکن کے عدم (غیر موجودگی) کی حالت میں۔ کیونکہ اس کی عین (ذات) کا وجود حقیقت کے لحاظ سے جیسا کہ ہم بیان کر چکے ہیں، متصور نہیں ہے۔ پس ممکن نے صرف اپنے احکام کے ظہور سے فائدہ اٹھایا، ان صورتوں کے وجود کے ذریعے جن کے پیچھے ممکنات کے اسماء آتے ہیں۔ پس جس طرح اسماء اللہ الحسنیٰ ممکن کے لیے وصفی (نعت) طریقے پر ہیں، اسی طرح کونی اسماء جو عین الوجود (العین الوجود) میں موجود صورتوں پر بولے جاتے ہیں، وہ وجودی عین (العین الوجودیہ) کے لیے اسماء ہیں۔ اللہ تعالیٰ نے فرمایا: \"کہو، انہیں نام دو\" (قُلْ سَمُّوهُمْ) (النجم: 28) دلالت کے موقع پر۔ پس جب انہوں نے انہیں نام دیے تو کہا: یہ پتھر ہے، یہ درخت ہے، یہ ستارہ ہے، اور یہ سب عبد (بندے) کا نام ہے۔ پھر الحق (ذات حق) نے یہ سب واضح کر دیا تاکہ اس سے عقل حاصل کی جائے، پس اللہ تعالیٰ نے فرمایا: \"یہ تو صرف نام ہیں جو تم نے اور تمہارے آباؤ اجداد نے رکھ لیے ہیں، اللہ نے ان کے لیے کوئی سند نازل نہیں کی\" (إِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا أَنْتُمْ وَآبَاؤُكُمْ مَا أَنْزَلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ) (النجم: 23). پس تم نے صورت کی وجہ سے عین (ذات) کے بارے میں کہا کہ یہ پتھر ہے یا درخت ہے یا ستارہ ہے یا کوئی بھی نام ہو ان معبودوں میں سے جن کا نام اللہ نہیں ہے۔ پس اللہ کی مخلوق میں سے کسی نے \"أنا الله\" (میں اللہ ہوں) نہیں کہا، سوائے اس اللہ کے جو کاغذات میں لکھا ہوا ہے، جب وہ بولتا ہے تو کہتا ہے: \"میں اللہ ہوں\"۔ پس تم اس وقت جان لو کہ اس کے قول \"أنا الله\" کا کیا معنی ہے، اور یہ کہ یہ حق ہے، میرا مطلب ہے یہ قول اس اصطلاحی زبان میں۔ اور یہ بات وہ عبد الکامل (انسان کامل) بھی کہتا ہے جس کی زبان، سماعت، بصارت، قوتیں اور جوارح (اعضاء) الحق (ذات حق) بن جاتا ہے، جیسے ابو یزید اور ان جیسے دیگر۔ اور ان دو کے علاوہ کوئی \"أنا الله\" نہیں کہتا، بلکہ وہ خاص نام کہتا ہے جو اس زبان میں اس کے لیے ہے۔ پس یہ جان لو۔ اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) (الاحزاب: 4).",
    "fa": "«باب چهارصد و هفتم در معرفت منزلت او که در سریع‌تر از یک چشم بر هم زدن از من ربوده می‌شود، اگر به غیر خود بنگرم؛ نه به دلیل ضعف من، بلکه به دلیل ضعف تو.»\n\nروی گرداندن نمازگزار عین ربوده شدن اوست\nروزگار هر طور که بخواهد با مردمانش بازی می‌کند\n\nو او (حق) همان روزگار است و مشیت از اوست\nو مردمان زمانه عین مردمان اویند\n\nهر چیزی لباسی نام‌گذاری شده دارد\nو قلب‌های مردان عین لباس اوست\n\nو من صورتی برای او هستم، سپس پنهان می‌شود\nبا وجود من، مانند آهو در کمینگاهش\n\nبرای حدودی که به صورت هستی من برپا شده‌اند\nاو (حق) از آن‌ها به اصل اساس خود برتر است\n\n[مردان چهارگانه چیستند]\n\nبر شیخ ما، ابومحمد عبدالله شکاز، در غرناطه از سرزمین‌های اندلس وارد شدم. او اهل باغه بود و از بزرگترین کسانی بود که در راه حق (طریق الله) ملاقات کردم. او به من گفت: ای برادر، مردان چهار دسته‌اند. و [آیه]: «و پیش از تو نفرستادیم مگر مردانی (رِجَالًا) [که به آن‌ها وحی می‌کردیم]» (وَمَا أَرْسَلْنَا قَبْلَكَ إِلَّا رِجَالًا). [و آیه]: «مردانی (رِجَالٌ) که تجارت و خرید و فروش آنان را از یاد خدا (ذِكْرِ الله) باز نمی‌دارد» (رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ). و [آیه]: «و مردانی (رِجَالٌ) که بر آنچه با خدا عهد بستند صادق ماندند» (وَرِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ). و [آیه]: «و در میان مردم برای حج بانگ برآور تا پیاده (رِجَالًا) نزد تو آیند» (وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالًا)؛ منظورش این است که بر روی پاهایشان می‌آیند و سوار نمی‌شوند. و [آیه]: «و بر اعراف مردانی (رِجَالٌ) هستند» (وَعَلَى الْأَعْرَافِ رِجَالٌ).\n\nپس او با مردان چهارگانه قصد حصر مراتب را داشت، زیرا در آنجا جز رسول، نبی، ولی و مؤمن نیست. و غیر از این چهار دسته، از حیث اعیانشان اعتباری ندارند؛ زیرا شیء تنها از حیث منزلتش اعتبار می‌یابد، نه از حیث عین انسانی‌اش. پس عین انسانیت در هر انسانی یکی است و مردم تنها به واسطه منازل (مقامات) با یکدیگر تفاوت می‌یابند، نه به واسطه عین (ذات)، حتی در صورت ظاهری از زیبا و زیباتر و غیر زیبا. به همین دلیل، او (رضی الله عنه) در ذکر مردان بیش از چهار مورد نیاورد. پس منظور او از چهار مورد جز آنچه ذکر کردیم نبود. و منظور او از «رجال» (مردان) در این آیات، به طور خاص مردان مذکر نیست، بلکه منظور این صنف انسانی است، چه مرد باشد و چه زن.\n\nو هنگامی که به او گفتم در آیه «پیاده (رِجَالًا) نزد تو آیند» (يَأْتُوكَ رِجَالًا) منظور کسی است که پیاده بر پای خود می‌آید، او (رضی الله عنه) گفت: «رجل (پیاده) محمول نیست، در حالی که سواره محمول است.» پس دانستم که منظور او چیست، زیرا او می‌دانست که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) جز در حالی که بر براق حمل می‌شد، به معراج نرفت. پس آنچه را گفت پذیرفتم. و به او (رضی الله عنه) آگاهاندم که بقا بر اصل، همان چیزی است که خداوند از خلق می‌خواهد. به همین دلیل، خداوند آن را با این سخن یادآور شد: «و تو را پیش از این آفریدم، در حالی که چیزی (موجود) نبودی» (وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئًا).\n\nبه او می‌گوید: سزاوار است که تو در حال وجودت، در وضعیتی با من باشی که در حال عدمت بودی؛ از جهت پذیرش اوامر من و عدم اعتراض تو. او را به ایستادن در حدودش امر می‌کند و نامش می‌گذرد، پس در جایی که برایش ترسیم شده سخن می‌گوید و با آنچه به او امر شده سخن می‌گوید. پس او (سبحانه) متکلم به آن بر زبان بنده‌اش خواهد بود. و همچنین در تمام حرکات، سکنات و احوال ظاهری و باطنی‌اش، در وجود خود نمی‌گوید که موجود است، بلکه خود را بر صورتش در حال عدم (نیستی) می‌بیند. این مراد حق (الحق) از او در این خطاب است. پس او در اصل محمول است و مستقل نیست؛ زیرا موجود حادث (المحدث) بدون مرجح نمی‌تواند در هستی (الوجود) مستقل باشد، پس ناگزیر باید محمول باشد.\n\nبه همین دلیل، هیچ رسولی جز بر براق به معراج نرفت، اگر معراج جسمانی و محسوس بود. و اگر معراج خیالی باشد که از آن به رؤیا تعبیر می‌شود، گاهی خود را سوار بر مرکبی می‌بیند و گاهی خود را سوار بر مرکبی نمی‌بیند، اما می‌داند که در صورتی که خود را در آن می‌بیند، محمول است؛ زیرا می‌دانیم که جسم او در بستر و در خانه‌اش خفته است. پس این را بدان. اما آنچه شیخ (ابومحمد شکاز) به آن رفت، یعنی استقلال و عدم سوار شدن، همان چیزی است که از آن باید حذر کرد؛ زیرا آن همان ربایش (الاختلاس) است که ذکر کردیم. در اینجا بنده، نفسش او را با استقلال ربوده است، در حالی که او در ذات خود مستقل نیست. پس آن ربایش (الاختلاس) او را از دست حق (الحق) گرفت و او خیال کرد که محمول نیست، در نتیجه خود را نشناخت. و هر کس خود را نشناسد، پروردگارش را نشناخته است. پس «غیر»ی که در اینجا به آن نگریست، عین نفس او بود، و این به دلیل ضعف او در علم به اصلی است که بر آن است.\n\nو شکی نیست که مرتبه رسولان (علیهم السلام) همه مراتب مردان (رجال) از نبوت، ولایت و ایمان را در خود جمع کرده است و آنان محمول هستند. پس هر کس وارث آنان باشد و محمول باشد، این را از خود می‌داند. و ما گفتیم «از خود می‌داند» زیرا امر در ذات خود این است که او ناگزیر محمول است، اما کسی که به این علم ندارد، خیال می‌کند که محمول نیست؛ به همین دلیل ما قید زدیم. و در سخن او (خداوند): «پیاده (رِجَالًا) نزد تو آیند» (يَأْتُوكَ رِجَالًا)، کسی که آنان را فراخوانده، به ایشان گفته است که بگویید: «و تنها از تو یاری می‌جوییم» (وَإِيَّاكَ نَسْتَعِينُ). و به آنان گفته است: «از خدا یاری جویید و صبر کنید» (اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا). و یا هر معنایی که بدون شک محمول بودن را می‌رساند؛ زیرا او در امر خود مستقل نیست، چرا که اگر مستقل بود، طلب یاری و یاور نمی‌کرد.\n\nو سخن او (رضی الله عنه): «مردانی (رِجَالٌ) که تجارت و خرید و فروش آنان را از یاد خدا (ذِكْرِ الله) باز نمی‌دارد» (رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ)؛ آنان در تجارت خود در حال ذکر خدا هستند، زیرا تجارت بر حد ترسیم شده الهی، خود از ذکر خداست. چنانکه عایشه درباره رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود که او در همه احوالش ذکر خدا می‌گفت، با وجود اینکه با پیرزن و کودک شوخی می‌کرد.\n\nو همه این‌ها نزد عارف، ذکر خداست؛ زیرا هیچ چیزی نیست مگر آنکه به واسطه خدا ذکر می‌گوید. پس هر کس چیزی را ببیند که هنگام دیدنش ذکر خدا نمی‌گوید، آن را ندیده است؛ زیرا خداوند آن را در هستی (الوجود) قرار نداده مگر در حال ذکر. پس تجارت و خرید و فروش آنان را از ذکر خدا باز نداشت. و همچنین: «مردانی (رِجَالٌ) که بر آنچه با خدا عهد بستند صادق ماندند» (رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ)؛ در گرفتن میثاقی که خداوند از آنان گرفت، پس به آن وفا کردند. و گفته شده که آنان صادق بودند، زیرا در آن و در وفای به آن، بر ادعاهای ریشه‌دار در نفوس غلبه کردند؛ ادعاهایی که برخی یا بیشتر کسانی را که از آنان میثاق گرفته شده بود، از وفای به آنچه با خدا عهد بستند، خارج ساخت. پس مرد (رجل) نیست مگر کسی که در وفای به آنچه بر عهده گرفته، با خدا صادق باشد، همان‌گونه که پیامبر در آنچه خداوند در میثاق پیامبران و رسولان بر عهده او نهاد، صادق بود.\n\nو سخن او (خداوند): «و بر اعراف مردانی (رِجَالٌ) هستند» (وَعَلَى الْأَعْرَافِ رِجَالٌ)؛ آنان بزرگترین مردان از نظر منزلت هستند، زیرا بر منازل (مقامات) اشراف دارند. این شیخ در اینجا با «اعراف» به کسانی که حسنات و سیئاتشان برابر است اشاره نکرد، بلکه آن را از حیث منزلت اشراف (استشراف) گرفت. زیرا اعراف در اینجا دیواری است که میان بهشت و دوزخ قرار دارد: «باطن آن رحمت است» (بَاطِنُهُ فِيهِ الرَّحْمَةُ) و آن سمتی است که به بهشت می‌چسبد، و «ظاهر آن از سوی عذاب است» (وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ) و آن سمتی است که به دوزخ می‌چسبد. پس آتش را از قِبَل آن قرار داد، یعنی مقابل آن. و مقابل، ضد است. پس دیوار را محل عذاب قرار نداد، بلکه آن را محل رحمت قرار داد با این سخن: «باطن آن رحمت است» (بَاطِنُهُ فِيهِ الرَّحْمَةُ). پس بنگر که خداوند چگونه بندگانش را به حقایق امور، آن‌گونه که هستند، آگاه می‌سازد، «ولی بیشتر مردم نمی‌دانند» (وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ).\n\nپس اهل اعراف در محل رحمت خداوند هستند و این همان چیزی است که آنان را به بهشت امیدوار کرده است، اگرچه هنوز وارد آن نشده‌اند. سپس ذکر کرد که آنان به مقام خلق معرفت (المعرفة) دارند و فرمود: «هر یک را به سیمایشان می‌شناسند» (يَعْرِفُونَ كُلًّا بِسِيمَاهُمْ)؛ یعنی به علامتی که در آنان قرار داده‌ایم. و سخن او (خداوند): «و اهل بهشت را ندا می‌دهند... در حالی که هنوز وارد آن نشده‌اند» (وَنَادَوْا أَصْحَابَ الْجَنَّةِ... لَمْ يَدْخُلُوهَا)؛ زیرا آنان در مقام کشف (الکشف) اشیا هستند. اگر وارد بهشت می‌شدند، با ورودشان در آن، از آنان پنهان می‌شد و بهشت آنان را می‌پوشاند، زیرا بهشت مانع کشف (الکشف) چیزی است که آنان کاشف آن هستند. و سخن آنان: «سلام بر شما» (سَلَامٌ عَلَيْكُمْ)، تحیت روی آوردن به سوی آنان به دلیل معرفتشان به ایشان است و تحیت روی گرداندن آنان از ایشان به سوی بهشت‌هایشان.\n\nخداوند می‌فرماید: «از خدا یاری جویید و صبر کنید» (اسْتَعِينُوا بِاللَّهِ وَاصْبِرُوا). و می‌فرماید: «من بی‌نیازترین شریکان از شرک هستم.» و معلوم است که استعانت (یاری خواستن) شرک در عمل است. اگر عمل از آنِ اوست، پس بنده کجاست؟ و اگر از آنِ بنده است، پس او خود را شریک کرده است. پس این مقدار از توحید افعال (توحید الأفعال) او را ربوده است. کسی که بداند بنده محل ظهور عمل است، پس وجود او ضروری است و پذیرش (قبول) نیز ضروری است. اگر گفته شود که خداوند بنده و عمل را ایجاد کرده است، اگر بنده پذیرای ایجاد قادر نبود، محال بود که وجود یابد. پس پذیرش ممکن (الممکن) ضروری است. پس اشتراک در ایجاد ضروری است؛ اگر در ایجاد بنده باشد، وجود بنده ضروری است، و اگر در ایجاد عمل تکلیفی باشد، وجود بنده ضروری است. پس در هر حال، وجود تو و او (خداوند) ضروری است، جز اینکه تو به ضعف منسوب هستی.\n\nپس خداوند متعال فرمود: «خداوند کسی است که شما را از ضعف آفرید» (اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ)؛ به این دلیل که ممکن (الممکن) نمی‌تواند در هر حال، ترجیح را از خود دور کند. سپس بعد از ضعف، قدرتی برای تکلیف قرار داد، اما او مستقل نیست. پس به طلب یاری امر شد. اگر مکلف در عمل نسبتی و اثری نداشت، تکلیف صحیح نبود و طلب یاری از صاحب نیروی استوار (ذی القوة المتین) نیز صحیح نبود. پس اگر خواستی، تو آن مقدار از اشتراک را کسب بنام، و اگر خواستی، آن را خلق بنام، پس از آنکه معنا را شناختی.\n\nاما اهل الله (أهل الله)، صاحبان کشف (الکشف)، همان‌طور که گفتیم، همه این‌ها احکام اعیان ممکنات (الممکنات) در عین هستی (العین الوجودية) هستند که در صور، از آثار اسماء حسنای الهی (الأسماء الإلهية الحسنى) ظاهر شده‌اند؛ از این جهت که ممکن به آن‌ها متصف است. پس آن‌ها برای حق (الحق) اسماء هستند و برای ممکن، نعت‌ها و صفات در حال عدم ممکن؛ زیرا وجود عین ممکن از حیث حقیقت، چنانکه بیان کردیم، قابل تصور نیست. پس ممکن جز ظهور احکامش را با وجود صورهایی که اسماء ممکنات تابع آن‌ها هستند، به دست نیاورده است. همان‌گونه که اسماء حسنای خداوند برای ممکن به طریق وصفی (نعتية) است، همچنین اسماء کونی (الأسماء الكونية) که بر صورهای موجود در عین هستی (العین الوجودية) اطلاق می‌شوند، اسماء برای عین هستی هستند.\n\nخداوند متعال فرمود: «بگو: آن‌ها را نام ببرید» (قُلْ سَمُّوهُمْ) در مقام دلالت. پس هنگامی که آن‌ها را نام می‌برند، می‌گویند: این سنگ است، این درخت است، این ستاره است؛ و همه این‌ها اسم بنده است. سپس حق (الحق) متعال همه این‌ها را آشکار ساخت تا از او تعقل شود، پس فرمود: «این‌ها جز نام‌هایی نیستند که شما و پدرانتان آن‌ها را نامیده‌اید و خداوند هیچ حجتی برای آن‌ها نازل نکرده است» (إِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا أَنْتُمْ وَآبَاؤُكُمْ مَا أَنْزَلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ). پس شما به خاطر صورت، درباره عین (هستی) گفتید که آن سنگ است یا درخت یا ستاره یا هر نامی که از معبودان بود که نام خدا را نداشتند. پس هیچ کس از خلق خدا «أنا الله» (من خدا هستم) نگفت، مگر «الله» که در کاغذها نوشته شده است، که اگر به سخن آید می‌گوید: «أنا الله». پس در آن هنگام معنای سخن او «أنا الله» را می‌فهمی و اینکه آن حق است؛ منظورم این سخن در آن زبان اصطلاحی است. و همچنین بنده کامل (الإنسان الکامل) که حق (الحق) زبان و گوش و چشم و قوای او و جوارح اوست، مانند بایزید و امثال او، این سخن را می‌گوید. و غیر از این دو، کسی «أنا الله» نمی‌گوید، بلکه اسم خاصی را که در آن زبان برای اوست، می‌گوید. پس این را بدان. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 3
}