{
  "id": 543,
  "title": {
    "ar": "الباب الثالث والأربعون وخمسمائة في معرفة حال قطب كان منزله وما آتاكُمُ الرَّسُولُ فَخُذُوهُ",
    "en": "Chapter Five Hundred and Forty-Three: Concerning the knowledge of the state of a Pole (قطب) whose station was: \"And whatever the Messenger gives you, take it.\"",
    "ur": "باب پانچ سو تینتالیسواں (۵۴۳): ایک قطب (قطب) کے حال (حال) کی معرفت (معرفت) کے بارے میں جس کا منزل (منزل) یہ تھا: \"اور جو کچھ رسول تمہیں دیں وہ لے لو۔\" (وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ)",
    "fa": "باب پانصد و چهل و سوم در معرفت حال قطبی که منزل او این آیه است: «و آنچه را پیامبر برای شما آورده بگیرید» (وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ)"
  },
  "content": {
    "ar": "## «الباب الثالث والأربعون وخمسمائة في معرفة حال قطب كان منزله وما آتاكُمُ الرَّسُولُ فَخُذُوهُ»\n\n\n> عين الرسالة ما تأتي به الرسل *** فخذه لا تتوقف أيها الرجل‏\n\n\n> أنت المليك الذي جاءت رسالته *** إليك فاعمل بها يصعد لك العمل‏\n\n\n> إليه من غير قطع في مساحته *** فإن توهمته فذلك الزلل‏\n\n\n> واصعد إليه تنل عين البقاء به *** وإن قعدت أتاك الصعق والخبل‏\n\n\n> إن الظروف لتحوي من يحل بها *** والأمر أنزه أن يجري له مثل‏\n\n\n> عليك بالمنزل الأعلى فحل به *** لا تقطعنكم الأغراض والعلل‏\n\n\n> هو المنزه عن نعت وعن صفة *** فلا يقوم به أمن ولا وجل‏\n\n\n> فأنت أنت إذا إن كنت صاحبه *** فاعمل لنفسك ما أصحابه عملوا\n\n\n> ولا يقم بك فيما قد أتيت به *** عجز ولا كسل فيه ولا ملل‏\n\n\n### [إن الله هو المعطى لعباده‏]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أن الله يعطي عباده منه إليهم وعلى أيدي الرسل فما جاءك على يد الرسول فخذه من غير ميزان وما جاءك من يد الله فخذه بميزان فإن الله عين كل معط وقد نهاك أن تأخذ كل عطاء وهو قوله وما نَهاكُمْ عَنْهُ فَانْتَهُوا فصار أخذك من الرسول أنفع لك وأحصل لسعادتك فأخذك من الرسول على الإطلاق ومن الله على التقييد فالرسول مقيد والأخذ مطلق منه والله مطلق عن التقييد والأخذ منه مقيد فانظر في هذا الأمر ما أعجبه فهذا مثل الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ فظهر التقييد والإطلاق في الجانبين وذلك أن الرسول صَلَّى اللهُ عَليهِ وسَلَّم ما بعثه الله ليمكر بنا أعني بأمته وإنما بعثه ليبين لهم ما نُزِّلَ إِلَيْهِمْ فلهذا أطلق لنا الأخذ عن الرسول والوقوف عند قوله من غير تقييد فإنا آمنون فيه من مكر الله والأخذ عن الله ليس كذلك فإن لله مكرا في عباده لا يشعر به قال تعالى ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ وقال سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ وقال وأَكِيدُ كَيْداً وقال إِنَّ كَيْدِي مَتِينٌ وقال والله خَيْرُ الْماكِرِينَ ولم يجعل للرسل في هذه الصفة قدما لأنهم بعثوا مبينين فبشروا وأنذروا وكله صدق وأعطى الرسول الميزان الموضوع فمن أراد السلامة من مكر الله فلا يزل الميزان المشروع من يده الذي أخذه عن الرسول وورثه فكل ما جاءه من عند الله وضعه في ذلك الميزان فإن قبله ملكه وإن لم يقبله سلمه لله وتركه فإن تركه عمل به ولم يجعل نفسه محلا لقبوله يقول الجنيد رضي الله عنه علمنا هذا مقيد بالكتاب والسنة وهما كفتا الميزان ومعنى قوله أنه نتيجة عن العمل بالكتاب والسنة فإن عزمت على الأخذ عن الله ولا بد لحال غلب عليك فقل لا خلابة فإنك إذا قلت لا خلابة فإن كان من عند الله ثبت فأخذته وإن كان من مكر الله ذهب من بين يديك فلم تحده عند قولك لا خلابة فإن الأمر بيع وشراء وإن الله‏\nتعالى لا يدخل تحت الشرط هذا يقتضيه مقام الحق بالذوق فإنما يشترط على الله من يجهل الله أو يدل عليه لأنه ظن به خيرا كما أمره سبحانه فإنه لو علم أن الله ما يبعثه في شغل حتى يهيئه لذلك الشغل فإنه حكيم خبير فلا تقس الله على المخلوق فإن المخلوق يجهل كثيرا منك ومن نفسه والحق ليس كذلك فلا فائدة للاشتراط يقول موسى عليه السلام حين بعثه ربه رَبِّ اشْرَحْ لِي صَدْرِي ويَسِّرْ لِي أَمْرِي واحْلُلْ عُقْدَةً من لِسانِي يَفْقَهُوا قَوْلِي واجْعَلْ لِي وَزِيراً من أَهْلِي هارُونَ أَخِي اشْدُدْ به أَزْرِي وأَشْرِكْهُ في أَمْرِي فأعطاه ذلك كله ولم يقل محمد صَلَّى اللهُ عَليهِ وسَلَّم شيئا من هذا كله فالأولى أن تكون محمديا فإنه ما ذكر الله من حديث موسى عليه السلام ما ذكر إلا ليعلم أن الاشتراط على المستخلف جائز ولا حرج عليه في ذلك لو اشترط أ لا ترى موسى عليه السلام كيف قال لمحمد صَلَّى اللهُ عَليهِ وسَلَّم ليلة إسرائه حين فرض الله عليه الصلاة راجع ربك فإن أمتك لا تطيق ذلك ثم علل وقال فإني بلوت بنى إسرائيل وما راجع محمد صَلَّى اللهُ عَليهِ وسَلَّم في ذلك إلا امتثالا لأمر الله فإن الله لما ذكر الأنبياء عليه السلام قال له أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ فامتثل أمره في رجوعه فكان خيرا وهذا فائدة الشيخ المتخذ في الطريق فاعلم ذلك‏\n\n\n> فخذ منه ما أعطاك إن كنت تابعا *** ولا تتوقف فالتوقف يصعب‏\n\n\n> فإن كنت ذا لب وعلم وفطنة *** فقد جاءك الأمر الذي كنت تطلب‏\n\n\nوالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Forty-Three: Concerning the Gnosis (معرفة) of the State of a Pole (قطب) Whose Station (منزل) was <<وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ>> (And whatever the Messenger gives you, take it)\n\nThe very Essence (عين) of the Message is what the Messengers bring,\nSo take it, O man, do not hesitate.\nYou are the Sovereign (المليك) whose Message has come to you,\nSo act upon it, and your deed will ascend for you.\nTo Him, without interruption in His expanse,\nIf you imagine otherwise, that is the error (الزلل).\nAscend to Him, and you will attain the very Essence of Subsistence (عين البقاء) through Him,\nBut if you remain seated, stunning (الصعق) and confusion (الخبل) will come upon you.\nIndeed, circumstances (الظروف) contain those who dwell within them,\nBut the Command (الأمر) is too transcendent (أنزه) to have an equal.\nHold fast to the Highest Station (المنزل الأعلى) and dwell therein,\nLet not purposes (الأغراض) or excuses (العلل) cut you off.\nHe is Transcendent (المنزه) beyond description (نعت) and Attribute (صفة),\nThus, neither security (أمن) nor fear (وجل) can stand in Him.\nThen you are truly you if you are His companion,\nSo work for yourself what His companions have worked.\nLet neither inability (عجز), nor laziness (كسل), nor weariness (ملل) stand in your way regarding what you have been given.\n\n### [Indeed, Allah is the Giver to His Servants]\n\nKnow—may Allah support us and you with a Spirit (روح) from Him—that Allah gives to His servants, from Himself to them, and upon the hands of the Messengers (الرسل). Therefore, whatever comes to you upon the hand of the Messenger, take it without a scale (ميزان). But whatever comes to you from the Hand of Allah, take it with a scale.\n\nFor Allah is the very Essence (عين) of every giver, yet He has forbidden you from taking every gift, which is His saying: <<وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا>> (And whatever He forbids you from, abstain). Thus, your taking from the Messenger is more beneficial for you and more conducive to your felicity (سعادتك). Your taking from the Messenger is absolute (على الإطلاق), and your taking from Allah is restricted (على التقييد). The Messenger is restricted (مقيد), yet the taking from him is absolute. And Allah is absolute (مطلق) from restriction, yet the taking from Him is restricted.\n\nLook at how wondrous this matter is! This is like The First (الْأَوَّلُ), The Last (الْآخِرُ), The Manifest (الظَّاهِرُ), and The Hidden (الْباطِنُ). Restriction and Absoluteness (الإطلاق) have appeared in both aspects.\n\nThis is because the Messenger, peace and blessings be upon him, was not sent by Allah to practice subtlety (ليمكر) against us—meaning, against his community (أمته). Rather, he was sent to clarify for them what was revealed to them. For this reason, taking from the Messenger and adhering to his word without restriction is made absolute for us, for we are safe therein from the subtlety (مكر) of Allah.\n\nTaking directly from Allah is not like that, for Allah has a subtlety concerning His servants that they do not perceive. He, the Exalted, said: <<وَمَكَرْنا مَكْراً وَهُمْ لَا يَشْعُرُونَ>> (And We planned a plan, while they perceived not). And He said: <<سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ>> (We will gradually lead them to destruction from where they do not know). And He said: <<وَأَكِيدُ كَيْدًا>> (And I plan a plan). And He said: <<إِنَّ كَيْدِي مَتِينٌ>> (Indeed, My plan is firm). And He said: <<وَاللَّهُ خَيْرُ الْمَاكِرِينَ>> (And Allah is the best of planners).\n\nThe Messengers were not given a footing (قدما) in this Attribute (صفة) because they were sent as clarifiers (مبينين). They gave glad tidings and warnings, and all of it is truth. The Messenger was given the established Scale (الميزان الموضوع).\n\nWhoever desires safety from the subtlety of Allah must not let the Divinely Legislated Scale (الميزان المشروع)—which he received and inherited from the Messenger—leave his hand. Everything that comes to him directly from Allah, he places it upon that Scale. If the Scale accepts it, he possesses it. If it does not accept it, he submits it to Allah and leaves it. If he leaves it, he acts upon the Scale and does not make himself the locus (محلا) of its acceptance. Junayd, may Allah be pleased with him, said: \"Our knowledge (علمنا هذا) is restricted (مقيد) by the Book and the Sunnah, and they are the two pans of the Scale (كفتا الميزان).\" The meaning of his statement is that this knowledge is the result (نتيجة) of acting upon the Book and the Sunnah.\n\nIf you resolve to take directly from Allah—which is inevitable due to a state (حال) that overcomes you—then say: \"No deception (لا خلابة).\" For when you say \"No deception,\" if it is truly from Allah, it will remain firm, and you will take it. But if it is from the subtlety of Allah, it will vanish from before you, and you will not find it when you say \"No deception.\"\n\nFor the matter is one of buying and selling. And indeed, Allah, the Exalted, does not fall under conditions (لا يدخل تحت الشرط). This is necessitated by the Station of The Real (مقام الحق) through direct experience (الذوق). Only he who is ignorant of Allah, or who relies upon Him because he thinks well of Him as He commanded, sets conditions upon Allah. If he knew that Allah does not send him into an occupation until He has prepared him for that occupation—for He is Wise (حكيم) and All-Aware (خبير)—he would not compare Allah to the created being (المخلوق). For the created being is ignorant of much concerning you and concerning himself, but The Real (الحق) is not like that. Thus, there is no benefit in setting conditions.\n\nMoses (Musa), peace be upon him, said when his Lord sent him: <<رَبِّ اشْرَحْ لِي صَدْرِي * وَيَسِّرْ لِي أَمْرِي * وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي * يَفْقَهُوا قَوْلِي * وَاجْعَل لِّي وَزِيرًا مِّنْ أَهْلِي * هَارُونَ أَخِي * اشْدُدْ بِهِ أَزْرِي * وَأَشْرِكْهُ فِي أَمْرِي>> (My Lord, expand for me my breast, and ease for me my task, and untie the knot from my tongue, that they may understand my speech, and appoint for me a minister from my family, Aaron, my brother; strengthen my back with him, and make him share in my task). And He granted him all of that.\n\nBut Muhammad, peace and blessings be upon him, did not say any of this. Therefore, it is better (الأولى) for you to be Muhammadan (محمديا). For Allah only mentioned the account of Moses, peace be upon him, so that it might be known that setting conditions upon the one appointed as successor (المستخلف) is permissible, and there is no blame upon him if he sets conditions.\n\nDo you not see how Moses, peace be upon him, said to Muhammad, peace and blessings be upon him, on the night of his Ascension (إسرائه) when Allah obligated the prayer upon him: \"Go back to your Lord, for your community will not be able to bear that.\" Then he gave the reason, saying: \"For I have tested the Children of Israel.\" And Muhammad, peace and blessings be upon him, only returned regarding that matter in compliance with the command of Allah. For when Allah mentioned the Prophets, peace be upon them, He said to him: <<أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided; so follow their guidance). Thus, he complied with His command in returning, and that was good. This is the benefit of the spiritual guide (الشيخ المتخذ) taken on the Path (الطريق). Know this.\n\nSo take from him what he gives you if you are a follower,\nAnd do not hesitate, for hesitation makes things difficult.\nBut if you possess intellect (لب), knowledge (علم), and discernment (فطنة),\nThen the Command (الأمر) you were seeking has come to you.\n\n<<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر پانچ سو تینتالیس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور جو کچھ تمہیں رسول دیں وہ لے لو\" (وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ)۔\n\nرسالت کا جوہر وہ ہے جو رسول لاتے ہیں\nپس اے مرد! اسے لے لو، توقف نہ کرو۔\n\nتو ہی وہ بادشاہ ہے جس کا پیغام تیرے پاس آیا\nپس اس پر عمل کر، تیرا عمل تیرے لیے اوپر چڑھے گا۔\n\nاس کی وسعت میں بغیر کسی انقطاع کے\nاگر تو اس کا وہم کرے گا تو وہ لغزش ہے۔\n\nاور اس کی طرف صعود کر، تو اس کے ذریعے عین البقاء (بقا) کو پائے گا\nاور اگر تو بیٹھا رہا تو تجھے ہلاکت اور تباہی آ لے گی۔\n\nبے شک حالات ان کو گھیر لیتے ہیں جو ان میں ٹھہرتے ہیں\nاور الأمر (امر) اس سے پاک ہے کہ اس کی کوئی مثال ہو۔\n\nتجھ پر لازم ہے کہ اعلیٰ منزل کو اختیار کر، پس اس میں قیام کر\nکہیں خواہشات اور بہانے تمہیں کاٹ نہ دیں۔\n\nوہ نعت اور صفت سے پاک (المنزه) ہے\nپس نہ اس میں امن قائم ہوتا ہے اور نہ خوف۔\n\nپس تو ہی تو ہے، اگر تو اس کا ساتھی ہے\nتو اپنے لیے وہ عمل کر جو اس کے ساتھیوں نے کیے۔\n\nاور جو کچھ تو لایا ہے اس میں تجھ میں نہ عجز\nنہ سستی اور نہ ہی اکتاہٹ پیدا ہو۔\n\n### [بے شک اللہ ہی اپنے بندوں کو عطا کرنے والا ہے]\n\nجان لو، اللہ اپنی طرف سے ایک روح کے ذریعے ہماری اور تمہاری تائید فرمائے، کہ اللہ اپنے بندوں کو اپنی طرف سے ان کی جانب اور رسولوں کے ہاتھوں پر عطا کرتا ہے۔ پس جو کچھ تمہارے پاس رسول کے ہاتھ سے آئے، اسے بغیر کسی میزان (ترازو) کے لے لو، اور جو کچھ تمہارے پاس اللہ کے ہاتھ سے آئے، اسے میزان کے ساتھ لو۔ کیونکہ اللہ ہر عطا کرنے والے کی عین (جوہر) ہے، اور اس نے تمہیں ہر عطیہ لینے سے منع فرمایا ہے، اور یہی اس کا قول ہے: \"اور جس سے وہ تمہیں روکیں، تو رک جاؤ\" (وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا)۔\n\nپس رسول سے تمہارا لینا تمہارے لیے زیادہ نفع بخش اور تمہاری سعادت کے لیے زیادہ یقینی ہے۔ لہٰذا رسول سے تمہارا لینا علی الإطلاق (بالکل مطلق) ہے، اور اللہ سے لینا علی التقیید (مقید) ہے۔ پس رسول مقید (محدود) ہیں اور ان سے لینا مطلق (غیر محدود) ہے، اور اللہ تقیید (حد بندی) سے مطلق (آزاد) ہے، لیکن اس سے لینا مقید ہے۔ اس معاملے میں غور کرو کہ یہ کتنا عجیب ہے! یہ الْأَوَّلُ (اول)، الْآخِرُ (آخر)، الظَّاهِرُ (ظاہر) اور الْباطِنُ (باطن) کی مثال ہے۔ پس تقیید اور اطلاق دونوں جانبوں میں ظاہر ہوئے۔\n\nاور یہ اس لیے ہے کہ رسول (صَلَّى اللهُ عَليهِ وسَلَّم) کو اللہ نے اس لیے نہیں بھیجا کہ وہ ہم سے مکر (مکر) کریں—میرا مطلب ہے، اپنی امت سے۔ بلکہ انہیں اس لیے بھیجا کہ وہ ان کے لیے اس چیز کو واضح کریں جو ان پر نازل کی گئی ہے۔ اسی لیے ہمارے لیے رسول سے لینا اور ان کے قول پر بغیر کسی تقیید کے ٹھہر جانا مطلق کر دیا گیا ہے، کیونکہ ہم اس میں اللہ کے مکر (مکر) سے محفوظ ہیں۔ اور اللہ سے لینا ایسا نہیں ہے، کیونکہ اللہ کا اپنے بندوں کے بارے میں مکر (مکر) ہے جسے وہ محسوس نہیں کرتے۔ اللہ تعالیٰ نے فرمایا: \"اور ہم نے ایک تدبیر کی، اور وہ بے خبر رہے\" (وَمَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ)۔ اور فرمایا: \"ہم انہیں آہستہ آہستہ وہاں سے پکڑیں گے جہاں سے انہیں علم بھی نہ ہوگا\" (سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ)۔ اور فرمایا: \"اور میں بھی ایک تدبیر کرتا ہوں\" (وَأَكِيدُ كَيْدًا)۔ اور فرمایا: \"بے شک میری تدبیر (كَيْدِي) مضبوط ہے\" (إِنَّ كَيْدِي مَتِينٌ)۔ اور فرمایا: \"اور اللہ سب سے بہتر تدبیر کرنے والا ہے\" (وَاللَّهُ خَيْرُ الْمَاكِرِينَ)۔\n\nاور اس صفت میں رسولوں کے لیے کوئی قدم نہیں رکھا، کیونکہ وہ مبینین (واضح کرنے والے) بنا کر بھیجے گئے، پس انہوں نے بشارت دی اور ڈرایا، اور یہ سب سچ ہے۔ اور رسول کو مقرر کردہ میزان (الميزان) عطا کیا گیا۔ پس جو شخص اللہ کے مکر (مکر) سے سلامتی چاہتا ہے، وہ اس میزان المشروع (شریعت کے میزان) کو اپنے ہاتھ سے جدا نہ کرے جو اس نے رسول سے لیا اور وراثت میں پایا۔ پس جو کچھ بھی اس کے پاس اللہ کی طرف سے آئے، وہ اسے اس میزان میں رکھے، اگر وہ اسے قبول کر لے تو وہ اس کا مالک ہو جائے، اور اگر وہ اسے قبول نہ کرے تو اسے اللہ کے سپرد کر دے اور چھوڑ دے۔ اگر وہ اسے چھوڑ دے تو اس پر عمل کرے، لیکن خود کو اس کے قبول کرنے کا محل نہ بنائے۔\n\nجنید (رضي الله عنه) فرماتے ہیں: \"ہمارا یہ علم کتاب و سنت کے ساتھ مقید ہے، اور یہ دونوں میزان (ترازو) کے دو پلڑے ہیں۔\" ان کے قول کا مطلب یہ ہے کہ یہ کتاب و سنت پر عمل کرنے کا نتیجہ ہے۔ پس اگر تم اللہ سے لینے کا عزم کرو، اور یہ اس حال کی وجہ سے ناگزیر ہو جو تم پر غالب آ جائے، تو کہو: \"کوئی فریب نہیں (لا خلابة)\"۔ کیونکہ جب تم \"کوئی فریب نہیں\" کہو گے، تو اگر وہ اللہ کی طرف سے ہوگا تو ثابت رہے گا اور تم اسے لے لو گے، اور اگر وہ اللہ کے مکر (مکر) میں سے ہوگا تو تمہارے ہاتھوں سے غائب ہو جائے گا، اور تم اسے \"کوئی فریب نہیں\" کہنے پر نہیں پاؤ گے۔ کیونکہ یہ معاملہ خرید و فروخت کا ہے، اور اللہ تعالیٰ کسی شرط کے تحت نہیں آتے۔ یہ بات مقام الحق (ذات حق) کا الذوق (ذوق) کے ذریعے تقاضا ہے۔\n\nپس اللہ پر شرط صرف وہی لگاتا ہے جو اللہ سے ناواقف ہو، یا جو اس پر بھروسہ کرتا ہے کیونکہ اس نے اس کے بارے میں اچھا گمان کیا، جیسا کہ اس نے (سبحانہ) حکم دیا۔ کیونکہ اگر وہ جانتا کہ اللہ اسے کسی کام میں نہیں بھیجتے جب تک کہ وہ اسے اس کام کے لیے تیار نہ کر دیں—کیونکہ وہ حکیم و خبیر ہیں—تو اللہ کو مخلوق پر قیاس نہ کرو۔ کیونکہ مخلوق تمہارے بارے میں اور اپنے بارے میں بہت کچھ نہیں جانتی، لیکن الحق (ذات حق) ایسا نہیں ہے۔ لہٰذا شرط لگانے کا کوئی فائدہ نہیں۔\n\nموسیٰ (عليه السلام) نے جب ان کے رب نے انہیں بھیجا تو کہا: \"اے میرے رب! میرا سینہ میرے لیے کھول دے، اور میرے کام کو میرے لیے آسان کر دے، اور میری زبان کی گرہ کھول دے، تاکہ وہ میری بات سمجھ سکیں، اور میرے اہل میں سے میرے لیے ایک وزیر مقرر کر دے، ہارون کو جو میرا بھائی ہے، اس کے ذریعے میری کمر مضبوط کر دے، اور اسے میرے کام میں شریک کر دے\" (رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي وَاجْعَلْ لِي وَزِيرًا مِنْ أَهْلِي هَارُونَ أَخِي اشْدُدْ بِهِ أَزْرِي وَأَشْرِكْهُ فِي أَمْرِي)۔ پس اللہ نے انہیں یہ سب عطا کر دیا۔ لیکن محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نے ان میں سے کچھ بھی نہیں کہا۔ لہٰذا تمہارے لیے بہتر ہے کہ تم محمدی (محمدی) بنو۔ کیونکہ اللہ نے موسیٰ (عليه السلام) کا ذکر صرف اس لیے کیا تاکہ یہ معلوم ہو جائے کہ خلیفہ بنائے گئے شخص کے لیے شرط لگانا جائز ہے، اور اگر وہ شرط لگائے تو اس پر کوئی حرج نہیں۔\n\nکیا تم نہیں دیکھتے کہ موسیٰ (عليه السلام) نے شبِ معراج کو محمد (صَلَّى اللهُ عَليهِ وسَلَّم) سے کیا کہا جب اللہ نے ان پر نماز فرض کی تھی: \"اپنے رب کی طرف رجوع کرو، کیونکہ تمہاری امت اس کی طاقت نہیں رکھے گی۔\" پھر انہوں نے وجہ بیان کی اور کہا: \"کیونکہ میں نے بنی اسرائیل کو آزمایا ہے۔\" اور محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نے اس بارے میں رجوع صرف اللہ کے حکم کی تعمیل میں کیا، کیونکہ جب اللہ نے انبیاء (عليه السلام) کا ذکر کیا تو ان سے فرمایا: \"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس تم ان کی ہدایت کی پیروی کرو\" (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ)۔ پس انہوں نے رجوع کرنے میں اس کے حکم کی تعمیل کی، اور یہ بہتر تھا۔ اور یہ وہ فائدہ ہے جو راہِ سلوک میں اختیار کیے گئے شیخ (الشيخ المتخذ) کا ہوتا ہے۔ پس یہ جان لو۔\n\nپس اس سے وہ لے لو جو وہ تمہیں عطا کرے، اگر تم تابعدار ہو\nاور توقف نہ کرو، کیونکہ توقف مشکل پیدا کرتا ہے۔\n\nاور اگر تم عقل، علم اور فطانت والے ہو\nتو وہ امر جو تم طلب کر رہے تھے، تمہارے پاس آ چکا ہے۔\n\nاور اللہ حق کہتا ہے اور وہی راہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و چهل و سوم (۵۴۳) در شناخت حال قطبی که منزل او [این آیه] بود: «وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ» (و آنچه پیامبر به شما داد، بگیرید).\n\nجوهر رسالت همان چیزی است که رسولان می‌آورند؛\nپس ای مرد، آن را بگیر و درنگ مکن.\nتو آن فرمانروایی هستی که رسالتش به سوی تو آمده است؛\nپس بدان عمل کن تا عملت برای تو صعود کند.\nبه سوی او [صعود کن] بدون هیچ گسستی در قلمرو او؛\nزیرا اگر چنین گسستی را توهم کنی، آن لغزش است.\nو به سوی او صعود کن تا جوهر بقا (البقاء) را به واسطه او به دست آوری؛\nو اگر بنشینی، صاعقه و تباهی به تو خواهد رسید.\nهمانا ظروف، کسی را که در آن‌ها فرود آید، در بر می‌گیرند؛\nاما امر [الهی] منزه‌تر از آن است که مثالی برایش جاری شود.\nبر تو باد به منزلگاه برتر؛ پس در آن فرود آی؛\nمبادا که اغراض و علت‌ها شما را قطع کنند.\nاو [حق] منزه از هر نعت و صفتی است؛\nپس نه ایمنی و نه ترس (وجل) در او جای می‌گیرد.\nپس اگر تو صاحب او باشی، آنگاه تو، تو هستی؛\nپس برای خودت همان کاری را انجام ده که یارانش انجام دادند.\nو در آنچه به آن آمده‌ای، ناتوانی، سستی یا ملال در تو برنخیزد.\n\n### [همانا خداوند بخشنده به بندگانش است]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که خداوند از جانب خود به بندگانش و بر دست رسولان عطا می‌کند. پس آنچه از طریق رسول به تو رسید، بدون میزان (سنجش) بگیر، و آنچه از دست خدا به تو رسید، با میزان بگیر. زیرا خداوند جوهر هر بخشنده‌ای است، و تو را از گرفتن هر عطایی نهی کرده است، و آن سخن اوست: «وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا» (و از آنچه شما را نهی کرد، باز ایستید).\n\nپس گرفتن تو از رسول برایت سودمندتر و برای سعادتت دست‌یافتنی‌تر است. بنابراین، گرفتن تو از رسول به صورت مطلق (الإطلاق) است و از خدا به صورت مقید (التقييد). رسول مقید است و گرفتن از او مطلق، و خداوند مطلق از تقیید است و گرفتن از او مقید. پس در این امر شگفت‌انگیز بنگر؛ این مانند [تجلی] الْأَوَّلُ و الْآخِرُ و الظَّاهِرُ و الْباطِنُ است. پس تقیید و اطلاق در هر دو جانب ظاهر شد.\n\nو این بدان سبب است که رسول (صَلَّى اللهُ عَليهِ وسَلَّم) را خداوند نفرستاد تا با ما – یعنی با امت او – مکر کند، بلکه او را فرستاد تا آنچه بر ایشان نازل شده است را تبیین کند. به همین دلیل، گرفتن از رسول و توقف در کلام او را بدون تقیید برای ما مطلق ساخت، زیرا ما در آن از مکر خدا در امان هستیم.\n\nاما گرفتن از خدا این‌گونه نیست، زیرا خداوند در بندگانش مکری دارد که از آن آگاه نمی‌شوند. خداوند متعال می‌فرماید: «وَمَكَرْنا مَكْراً وَهُمْ لَا يَشْعُرُونَ» (و مکر کردیم، مکری، در حالی که آنان درک نمی‌کردند). و فرمود: «سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ» (به تدریج آنان را از جایی که نمی‌دانند، فرو خواهیم برد). و فرمود: «وَأَكِيدُ كَيْداً» (و من نیز تدبیری می‌اندیشم). و فرمود: «إِنَّ كَيْدِي مَتِينٌ» (همانا مکر من استوار است). و فرمود: «وَاللَّهُ خَيْرُ الْمَاكِرِينَ» (و خداوند بهترین مکرکنندگان است). و برای رسولان در این صفت [مکر] جایگاهی قرار نداد، زیرا آنان مبعوث شدند تا تبیین کنند؛ پس بشارت دادند و انذار کردند، و همه آن صدق است. و خداوند میزان وضع شده را به رسول عطا کرد.\n\nپس هر کس که سلامت از مکر خدا را می‌خواهد، نباید میزان مشروعی را که از رسول گرفته و به ارث برده است، از دست خود دور کند. پس هر آنچه از نزد خدا به او رسید، آن را در آن میزان قرار دهد. اگر آن را پذیرفت، مالک آن می‌شود، و اگر نپذیرفت، آن را به خدا تسلیم کرده و رها می‌کند. اگر آن را رها کرد، بدان عمل می‌کند و خود را محل پذیرش آن قرار نمی‌دهد.\n\nجنید (رضی الله عنه) می‌گوید: «علم ما مقید به کتاب و سنت است»، و این دو کفه میزان هستند. و معنای سخن او این است که [این علم] نتیجه عمل به کتاب و سنت است.\n\nپس اگر عزم بر گرفتن از خدا کردی، و این به دلیل حالی بود که بر تو غلبه کرده است، بگو: «لا خلابة» (فریبی در کار نیست). زیرا اگر بگویی «لا خلابة»، اگر آن [عطا] از نزد خدا باشد، ثابت می‌ماند و آن را می‌گیری، و اگر از مکر خدا باشد، از پیش رویت می‌رود و با گفتن «لا خلابة» آن را نخواهی یافت.\n\nزیرا این امر، داد و ستد است، و خداوند متعال تحت شرط در نمی‌آید. این چیزی است که مقام حق (الحق) به واسطه ذوق (عرفان) اقتضا می‌کند. تنها کسی بر خدا شرط می‌گذارد که خدا را نشناسد، یا کسی که بر او ناز می‌کند، زیرا به او گمان نیک برده است، همان‌گونه که سبحانه به او امر کرده است. زیرا اگر می‌دانست که خداوند او را به کاری نمی‌فرستد مگر آنکه او را برای آن کار آماده سازد، [می‌فهمید] که او حکیم و خبیر است. پس خدا را با مخلوق قیاس مکن، زیرا مخلوق نسبت به بسیاری از امور تو و خودش جاهل است، اما حق (الحق) این‌گونه نیست. پس شرط گذاشتن فایده‌ای ندارد.\n\nموسی (علیه السلام) هنگامی که پروردگارش او را مبعوث کرد، گفت: «رَبِّ اشْرَحْ لِي صَدْرِي * وَيَسِّرْ لِي أَمْرِي * وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي * يَفْقَهُوا قَوْلِي * وَاجْعَلْ لِي وَزِيراً مِنْ أَهْلِي * هَارُونَ أَخِي * اشْدُدْ بِهِ أَزْرِي * وَأَشْرِكْهُ فِي أَمْرِي» (پروردگارا، سینه‌ام را برایم بگشا * و کارم را برایم آسان گردان * و گره از زبانم باز کن * تا سخنم را بفهمند * و وزیری از خاندانم برایم قرار ده * هارون، برادرم * پشتم را به او محکم کن * و او را در کارم شریک گردان). پس خداوند همه این‌ها را به او عطا کرد، در حالی که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) هیچ یک از این‌ها را نگفت.\n\nپس شایسته‌تر آن است که محمدی باشی، زیرا خداوند داستان موسی (علیه السلام) را ذکر نکرد مگر برای آنکه دانسته شود که شرط گذاشتن بر کسی که جانشین شده، جایز است و اگر شرط می‌گذاشت، حرجی بر او نبود. آیا نمی‌بینی که موسی (علیه السلام) در شب معراج، هنگامی که خداوند نماز را بر او واجب کرد، چگونه به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) گفت: «به پروردگارت بازگرد، زیرا امت تو توانایی این کار را ندارند»؟ سپس دلیل آورد و گفت: «من بنی اسرائیل را آزموده‌ام». و محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در این باره بازنگشت مگر به فرمانبرداری از امر خدا. زیرا هنگامی که خداوند پیامبران (علیهم السلام) را ذکر کرد، به او فرمود: «أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ» (آنان کسانی هستند که خداوند هدایتشان کرده است؛ پس به هدایت آنان اقتدا کن). پس او امر [خدا] را در بازگشت [به سوی پروردگار] امتثال کرد و این خیر بود. و این فایده شیخ (مرشد) پذیرفته شده در طریق (سلوک) است؛ پس این را بدان.\n\nپس اگر پیرو هستی، آنچه را به تو عطا کرد، بگیر؛\nو درنگ مکن که درنگ کردن دشوار است.\nو اگر صاحب خرد و علم و فطانت باشی،\nهمانا امری که در طلبش بودی، به تو رسیده است.\n\nو خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند."
  },
  "page_count": 2
}