{
  "id": 138,
  "title": {
    "ar": "الباب الثامن والثلاثون ومائة في معرفة مقام الحياء وأسراره",
    "en": "Chapter One Hundred and Thirty-Eight: Concerning the Knowledge of the Station of Modesty (مقام الحياء) and its Mysteries.",
    "ur": "باب ایک سو اڑتیس، مقام حیاء اور اس کے اسرار کی معرفت میں",
    "fa": "باب صد و سی و هشتم در معرفت مقام حیاء (الحياء) و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثامن والثلاثون ومائة في معرفة مقام الحياء وأسراره)\n\n\n> إن الحياء من الايمان جاء به *** لفظ النبي وخير كله فبه‏\n\n\n> فليتصف كل من يرعى مشاهده *** وليس يعرف هذا غير منتبه‏\n\n\n> مستيقظ غير نوام ولا كسل *** مراقب قلبه لدى تقلبه‏\n\n\n> إن الحي من أسماء الإله وقد *** جاء التخلق بالأسماء فأحظ به‏\n\n\n### [الترك من كل موجود بقاء على الأصل والعمل فرع وجودى زائد]\n\n\nورد في الخبر أن الحي اسم من أسماء الله تعالى‏\n\n\nوقال تعالى إِنَّ الله لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا ما بَعُوضَةً فَما فَوْقَها يعني في الصغر وهو من صفات الايمان ومن صفات المؤمن ومن أسمائه تعالى المؤمن فالحيي نعت للمؤمن‏\n\n\nفإن الحياء من الايمان والحياء خير كله والحياء لا يأتي إلا بخير وهذه كلها أخبار صحيحة\n\n\nوحقيقتها أعني هذه الصفة الترك لأن الترك من كل موجود بقاء على الأصل والعمل فرع وجودي زائد على الأصل فلهذا قيل فيه خير كله فالحياء نعت سلبي فالعبد إذا ترك‏\nما لله لله وما يقول الكون إنه للعبد من الأمور الوجودية يتركه أيضا لله على حقيقة ما يترك ما هو لله بالإجماع من كل نفس لله فقد استحيا من الله حق الحياء\n\n\n### [النعوت كلها بحكم الأصالة وهي للعبد بحكم خلقه على الصورة]\n\n\nومن ترك ما لله لله خاصة فقد استحيا من الله ولكن لا حق الحياء وذلك أن النعوت التي نعت الحق بها نفسه من المسمى إخبار التشبيه وآيات التشبيه على ما يزعم علماء الرسوم وأنه تنزل إلهي رحمة بالعباد ولطفا إلهيا وهو عندنا نعت حقيقي لا ينبغي إلا له تعالى وأنه في العبد مستعار كسائر ما يتخلق به من أسمائه فإنه خَيْرُ الْماكِرِينَ والله يستهزئ بالمستهزئين من عباده باستهزاء ومكر هو له من حيث لا يشعرون وهو لا يصف نفسه بالحوادث فدل إن هذه النعوت بحكم الأصالة لله وما ظهرت في العبد الإلهي إلا لكونه خلق على الصورة من جميع الوجوه ولما عرف العارفون هذا ورأوا قوله تعالى وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ وهذه النعوت الظاهرة في الأكوان التي يعتقد فيها علماء الرسوم أنها حق للعبد من جملة الأمور التي ترجع إلى الله تركوها لله لاستحيائهم من الله حق الحياء وهو من نعوت الاسم المؤمن والمؤمن المصدق بأن هذه النعوت له أزلا وإن لم يظهر حكمها إلا في المحدثات فالحياء يدخل في الصدق ولهذا\n\n\nقال الحياء من الايمان‏\n\n\n### [البقاء على الأصل لا يأتى إلا بخير]\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم في الحياء إنه لا يأتي إلا بخير\n\n\nفهي كلمة صحيحة صادقة فإن البقاء على الأصل لا يأتي إلا بخير فإنها لا تصحبها دعوى فهو قابل لكل نعت إلهي يريد الحق أن ينعته به وما في المحل ضد يرده ولا مقابل يصده فيبقى الحق يفعل ما يريد بغير معارض ولا منازع وأما نعت الحق به فهو تركه العبد يتصف بنعوت الحق ويسلمها له ولا يخجله فيها بل يصدقه ويعلى بها رتبته ولا يكذبه في دعواه فإنه مجلاه فهذا من كون الحق حيا\n\n\n### [الحق يوقر عبده ويستحى أن يكذب شيبته‏]\n\n\nورد في الخبر أن شيخا يوم القيامة يقول الله له يا عبدي عملت كذا وكذا لأمور لم يكن ينبغي له أن يعملها فيقول يا رب ما فعلت وهو قد فعل فيقول الحق سيروا به إلى الجنة فتقول الملائكة التي أحصت عليه عمله يا ربنا أ لست تعلم أنه فعل كذا وكذا فيقول بلى ولكنه لما أنكر استحييت منه أن أكذب شيبته‏\n\n\nفإذا كان الحق يستحي من العبد أن يكذب شيبته ويوقره فالعبد بهذه الصفة أولى‏\n\n\n### [درجات الحياء عند العارفين وعند الملاميين‏]\n\n\nوللحياء درجات عند العارفين وعند الملاميين فدرجاته في العارفين إحدى وخمسون درجة وفي الملاميين عشرون درجة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الواحد ومائة\n\n\n( (بسم الله الرحمن الرحيم))\n\n\n### [أثر الحياء في وجه الإنسان‏]\n\n\nلما كان الحياء صفة تنسب إلى الايمان فهو من ذات الايمان كان أثره من ظاهر صورة الإنسان في الوجه إذ الوجه ذات الشي‏ء وعينه وحقيقته‏\n\n\n### [الحياء كالإيمان ينقسم إلى بضع وسبعين شعبة]\n\n\nفالحياء ينقسم كما\n\n\nينقسم الايمان إلى بضع وسبعين شعبة أرفعها لا إله إلا الله وأدناها إماطة الأذى عن الطريق‏\n\n\nوالمناسبة بين العالي والدون أن الشرك أذى في طريق التوحيد إماطته الأدلة العقلية والإنباءات الشرعية لما جعلته في طريق التوحيد الشبه المضلة والأهواء الشيطانية\n\n\n### [أعلى صور الحياء الذي يدرك الموحد في توحيده‏]\n\n\nوصورة الحياء الذي يدرك الموحد في توحيده ويزيل الأذى من طريق الخلق تلفظه بنفي الإله قبل وصوله إلى إيجابه إلى من يستحقه وهو قوله لا إله والنفي عدم فوقع الحياء من العبد المؤمن حيث بدأ بالعدم وهو عينه لأن المحدث نعته تقدم حال العدم عليه ثم استفاد الوجود الذي هو بمنزلة الإيجاب لما وقع عليه النفي ولم يتمكن للمحدث أن يقول إلا هذا لأنه لا يصح العدم بعد الوجود ولا النفي بعد الإثبات فإنه لو تجلى له الحق ابتداء لم ينفه في الشريك لأنه كان يراه عينه لو كان له وجود وإن لم يكن له وجود فيكون نظر الموحد عند وقوعه على وجود الحق لا يتمكن أن يرى مع هذا الوجود عدما فكان لا يتلفظ بكلمة التوحيد أبدا ولا يرى نفسه أبدا فمن رحمة الله تعالى بالإنسان أنه أشهده أولا نفسه فرأى في نفسه قوى ينبغي أن لا تكون إلا لمن هو إله فلما حقق النظر بعقله ونظر إلى العوارض الطارئة عليه بغير إرادته ومخالفة أغراضه ووجد الافتقار في نفسه علم قطعا إن عين وجوده شبهة وأن هذه الصفات لا ينبغي أن تكون لمن هو إله فنفى تلك الألوهة التي قامت له من نفسه فقال لا إله ثم إنه لما أمعن النظر وجد نفسه قائما بغيره غير مستقل في وجوده فأوجب فقال عند ذلك إلا الله فلما أثبت نظر إلى هذا الذي أثبته فرآه عين صورة ما نفاه مرتبطا به ارتباط الظل بالشخص بنور العلم الذي فتح عينه إلى هذا الإدراك وقد كان نفاه بقوله لا إله فاستحى كيف أطلق لا إله ولهذا جعلته طائفة من أذكار العموم وكان بعض شيوخنا لا يقول في ذكره‏\nسوى لفظة الله الله كان لا يقول لا إله إلا الله فسألته عن ذلك فقال إن روحي بيد الله ما هي في حكمي وفي كل نفس أنتظر الموت واللقاء وكل حرف من حروف الكلام نفس فيمكن إذا انصرف أن تكون المفارقة في انصرافه ولا يأتي من الله بعده نفس آخر فإذا قلت لا أو عشت حتى أقول لا إله ثم أفارق قبل الوصول إلى الإيجاب فأقبض في وحشة النفي لا في أنس الإيجاب فلهذا عدلت إلى ذكر الجلالة إذ ليس لي مشهود سواه فمن كان هذا حاله فلا بد أن يستحيي في قوله لا إله إلا الله وهو أشد الحياء فكانت أرفع شعب الايمان فكانت أرفع شعب الحياء من الله حيث نظر إلى نفسه قبل نظره إلى خالقه وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nوقوله سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ إذ كان عين ما نفى عين ما أثبت فإنه ما نفى إلا الإله ولا أثبت إلا الإله‏\n\n\n### [أدنى صور الحياء الذي يدرك الموحد في توحيده‏]\n\n\nوأما حياؤه في إماطته الأذى عن طريق الخلق فإنه مأمور بإماطته ثم إنه يرى وجه الحق فيه بالضرورة لأنه أدنى المراتب فهو بمنزلة الآخر من الأسماء الإلهية وإليه ينظر كما كان لا إله إلا الله الاسم الأول وجاءت الهوية فأخذت الاسمين لها فقالت هُوَ الْأَوَّلُ والْآخِرُ فبقي مترددا بين حق ما يستحقه الاسم الآخر الظاهر في كون هذا أذى في طريق الخلق ويرى أن الخلق متصرفون بأسماء إلهية بين هذين الاسمين فلا تقع عين هذا المؤمن إلا على الله أولا وآخرا وما بينهما والأمر متوجه عليه بالإماطة فيستحيي من الأمر أن لا يبادر لما أمره به من الإماطة ويستحيي من الاسم الآخر الذي يراه في عين الأذى فإذا أدركه هذا الحياء ناداه الاسم من الأذى يا فلان بي تميط هذا الأذى عن طريق الخلق فإنا في الأذى كما أنا في الإماطة ما أزلته بغيري فلا تستحي انظر في‏\n\n\nقوله أدناها إماطة الأذى‏\n\n\nفعلق الأذى بالإماطة وهو آخر درجات الايمان فنحن في عين الإماطة ما نحن غيرها فيتجبر عند ذلك صاحب هذه الحال فيميطه به كما نفى الإله بالإله‏\n\n\n### [الحياء من الله أن لا يراك حيث نهاك ولا يفقدك حيث أمرك‏]\n\n\nوإذا كان حال العبد في حيائه من الله في الأول والآخر والأعلى والأدون انحصرت المتوسطات بين هذين الطرفين فكان معصوم الحال محفوظ المقام كالصلاة تحريمها التكبير وتحليلها التسليم فظهرت المنة في الطرفين ليسلم الوسط بينهما وسبب ذلك الحصر فتبين لك بعد ما أوقفتك عليه من الحقائق أن الحياء من الله أن يراك حيث نهاك ولا يفقدك حيث أمرك فعم بهذا جميع شعب الايمان وهو مقام يصحبه الأمر والنهي والتكليف فإذا انقضى زمان التكليف كان ينبغي له أن يزول وليس الأمر كذلك فاعلم أنه من حقيقة وجود الحياء وجود العلم بما يجب لله تعالى وأنت القائم به والمطلوب عقلا وشرعا ومحال أن يقدر مخلوق على الوفاء بما يجب لله تعالى عليه من تعظيمه عقلا وشرعا ولا بد له من لقاء ربه وشهوده ومقامه هذا فالحياء يصحبه في الدنيا والآخرة لأنه لا يزال ذاكرا لما يجب عليه وذاكر العدم قيامه في حق الله بما يجب له وقد ورد في الخبر ما يؤيد هذا أن الحق إذا تجلى لعباده يوم الزور الأعظم ويرفع الحجب عن عباده فإذا نظروا إليه جل جلاله قالوا سبحانك ما عبدناك حق عبادتك‏\n\n\nفهذا الاعتراف أوجبه الحياء من الله عز وجل فالحياء أنطقهم بذلك‏\n\n",
    "en": "## Chapter 138: On the Gnosis of the Station of Modesty (مقام الحياء) and its Secrets\n\n> Indeed, Modesty is from Faith, the Prophet’s word brought it,\n> And all good is in it, so be characterized by it.\n> Let everyone who guards his witnessing (مشاهده) be characterized by it,\n> And none knows this save the vigilant one.\n> Awake, neither sleeping nor lazy,\n> Watching his heart during its transformations.\n> Indeed, The Living (الحي) is one of the Names of God,\n> And the adoption of the Divine Attributes (التخلق بالأسماء) has come, so attain your share of it.\n\n### [Abandonment of Every Existing Thing is Subsistence upon the Origin, and Action is a Superfluous Existential Branch]\n\nIt is reported in the Tradition (الخبر) that The Living (الحي) is one of the Names of Allah, the Exalted.\n\nAnd He, the Exalted, said: <<إِنَّ اللهَ لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا ما بَعُوضَةً فَما فَوْقَها>> (Indeed, Allah is not ashamed to present an example—that of a mosquito or what is above it) [Q 2:26]. Meaning, in terms of smallness. And [Modesty] is one of the attributes of Faith (الايمان) and one of the attributes of the believer, and one of His Names, the Exalted, is The Faithful (المؤمن). Thus, the Modest One (الحيي) is an attribute of the believer.\n\nFor Modesty is from Faith, and Modesty is entirely good, and Modesty brings nothing but good. These are all sound traditions. And its reality—I mean, the reality of this attribute—is Abandonment (الترك). Because the abandonment of every existing thing is subsistence upon the Origin (الأصل). And action (العمل) is a superfluous existential branch (فرع وجودي زائد) added to the Origin. For this reason, it was said that it is entirely good. Thus, Modesty is a negative attribute (نعت سلبي). When the servant abandons what belongs to God, for God, and also abandons what the cosmos (الكون) declares belongs to the servant from existential matters (الأمور الوجودية), abandoning it also for God—upon the reality of abandoning what is unanimously agreed to belong to God, from every soul belonging to God—then he has been truly modest (استحيا) before God (حق الحياء).\n\n### [All Attributes are by Virtue of Origin, and they belong to the Servant by Virtue of His Creation upon the Form]\n\nAnd whoever abandons what belongs to God, specifically for God, has been modest before God, but not with true Modesty (حق الحياء). This is because the attributes (النعوت) by which the Real (الحق) described Himself—from the named reports of similitude (إخبار التشبيه) and the verses of similitude (آيات التشبيه), as scholars of external forms (علماء الرسوم) claim—are a Divine descent (تنزل إلهي), a mercy upon the servants, and a Divine subtlety (لطفا إلهيا). But for us, it is a real attribute (نعت حقيقي) that is only fitting for Him, the Exalted, and it is borrowed (مستعار) in the servant, like all the Names by which the servant adopts the Divine Attributes (يتخلق به). For He is <<خَيْرُ الْماكِرِينَ>> (the best of plotters) [Q 3:54], and Allah mocks those who mock Him among His servants with a mockery and plotting that belongs to Him, though they do not perceive it. Yet, He does not describe Himself with contingent events (الحوادث). This indicates that these attributes belong to God by virtue of Origin (بحكم الأصالة), and they only appeared in the Divine servant (العبد الإلهي) because he was created upon the Form (على الصورة) in all respects. When the Gnostics (العارفون) understood this and saw His saying, the Exalted, <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him the whole affair is returned) [Q 11:123], and realized that these attributes appearing in the cosmos (الأكوان)—which the scholars of external forms believe truly belong to the servant—are among the matters that return to God, they abandoned them for God, out of their true Modesty (حق الحياء) before Him. This Modesty is one of the attributes of the Name The Faithful (المؤمن), and The Faithful is the one who confirms that these attributes belong to Him eternally (أزلا), even if their ruling only appears in contingent beings (المحدثات). Thus, Modesty enters into Truthfulness (الصدق), and for this reason, [the Prophet] said: Modesty is from Faith.\n\n### [Subsistence upon the Origin Brings Nothing but Good]\n\nHis saying, peace and blessings be upon him, concerning Modesty, that it brings nothing but good, is a sound and truthful statement. For subsistence upon the Origin (البقاء على الأصل) brings nothing but good, as it is not accompanied by any claim (دعوى). Thus, [the servant] is receptive to every Divine Attribute (نعت إلهي) that the Real desires to characterize him with. There is no opposing force (ضد) in the locus (المحل) to reject it, nor an opposite (مقابل) to repel it. So the Real remains doing what He wills without opposition or contention. As for the Real characterizing Himself with it [Modesty], it is His leaving the servant to be characterized by the attributes of the Real, and the servant surrenders them to Him. He does not shame him in them, but rather confirms him and elevates his rank thereby, and does not deny his claim, for the servant is His manifestation (مجلاه). This is derived from the Real being The Living (الحي).\n\n### [The Real Honors His Servant and is Ashamed to Deny His Gray Hair]\n\nIt is reported in the Tradition that on the Day of the Greatest Visitation (يوم الزور الأعظم), God will say to an old man, \"O My servant, you did such and such,\" referring to deeds he ought not to have done. The man will say, \"O Lord, I did not do it,\" though he had done it. The Real will say, \"Take him to Paradise.\" The angels who recorded his deeds will say, \"O our Lord, do You not know that he did such and such?\" He will say, \"Yes, but when he denied it, I was ashamed (استحييت) to deny his gray hair (شيبته) [i.e., to contradict the old man].\" If the Real is ashamed to deny His servant's gray hair and honors him, then the servant is more deserving of this attribute.\n\n### [The Degrees of Modesty according to the Gnostics and the Malamiyya]\n\nModesty has degrees (درجات) among the Gnostics (العارفين) and among the Malamiyya. Its degrees among the Gnostics are fifty-one degrees, and among the Malamiyya, twenty degrees. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way) [Q 33:4]. End of Part 101.\n\n### [The Effect of Modesty upon the Human Face]\n\nSince Modesty is an attribute attributed to Faith (الايمان), and is of the very Essence (ذات) of Faith, its effect appears on the external form of the human being, specifically in the face (الوجه), since the face is the essence (ذات), the eye (عين), and the reality (حقيقة) of the thing.\n\n### [Modesty, like Faith, is Divided into Seventy-Odd Branches]\n\nModesty is divided, just as Faith is divided, into seventy-odd branches (شعبة). The highest of them is *Lā ilāha illā Allāh* (There is no god but Allah), and the lowest is the removal of harm (إماطة الأذى) from the path. The connection (المناسبة) between the highest and the lowest is that polytheism (الشرك) is harm (أذى) in the path of Unity (التوحيد). Its removal is achieved by rational proofs (الأدلة العقلية) and legal reports (الإنباءات الشرعية), due to the misleading doubts (الشبه المضلة) and satanic desires (الأهواء الشيطانية) that placed it in the path of Unity.\n\n### [The Highest Form of Modesty Realized by the Monotheist in His Affirmation of Unity]\n\nThe form of Modesty that the monotheist (الموحد) realizes in his affirmation of Unity (توحيده) and which removes harm from the path of creation (الخلق) is his utterance of the negation of divinity (*Lā ilāh*) before arriving at its affirmation (*illā Allāh*) for the One who deserves it. This is his saying, *Lā ilāh* (There is no god). Negation is non-existence (عدم). Thus, the Modesty of the believing servant occurred when he began with non-existence, which is his very essence (عينه), because the characteristic of the contingent being (المحدث) is that the state of non-existence precedes him. Then he acquired Existence (الوجود), which is equivalent to the affirmation that follows the negation. It was not possible for the contingent being to say anything other than this, because non-existence is not valid after existence, nor is negation valid after affirmation. If the Real had disclosed Himself (تجلى له الحق) to him initially, he would not have negated the partner, because he would have seen the partner as His very essence (عينه) if the partner had existence, or even if he had no existence. Therefore, the monotheist, upon witnessing the Existence of the Real, would not be able to see non-existence alongside this Existence. He would never utter the word of Unity (كلمة التوحيد) and would never see himself. It is from Allah’s mercy upon humanity that He first made him witness himself. He saw in himself powers that ought only to belong to one who is God. But when he investigated deeply with his intellect and looked at the accidental attributes (العوارض) that afflicted him without his will and contrary to his purposes, and found neediness (الافتقار) within himself, he knew with certainty that the essence of his existence was a doubt (شبهة) and that these attributes ought not to belong to one who is God. So he negated that divinity which arose from himself, saying, *Lā ilāh*. Then, when he looked further, he found himself subsisting by another, not independent in his existence, so he affirmed, saying *illā Allāh* (but Allah). When he affirmed, he looked at this affirmed reality and saw it as the very form (عين صورة) of what he had negated, connected to it like the connection of the shadow to the person, by the light of Knowledge (نور العلم) that opened his eye to this realization. Yet, he had negated it with his saying, *Lā ilāh*. So he felt shame (استحى) at how he had uttered *Lā ilāh*. For this reason, a group made it [the full phrase] part of the general litanies (أذكار العموم). Some of our Shaykhs would only say the word *Allāh, Allāh* in their litany; they would not say *Lā ilāha illā Allāh*. I asked him about this, and he said: \"My soul is in the hand of God; it is not under my command. With every breath, I await death and the encounter. Every letter of speech is a breath (نفس). It is possible that when the breath is exhaled, separation (المفارقة) occurs during its exhalation, and another breath from God does not follow it. If I say *Lā* (No), and I live until I say *Lā ilāh*, and then I separate [die] before reaching the affirmation, I will be seized in the desolation of negation (وحشة النفي) and not in the intimacy of affirmation (أنس الإيجاب). For this reason, I turned to the remembrance of the Majesty (ذكر الجلالة), since I witness nothing other than Him.\" Whoever is in this state must feel shame (يستحيي) in his saying *Lā ilāha illā Allāh*, and this is the most intense Modesty. Thus, it was the highest branch of Faith, and consequently, the highest branch of Modesty before God, since he looked at himself before looking at his Creator. This is the meaning of his saying, peace and blessings be upon him: \"Whoever knows himself knows his Lord.\" And His saying: <<سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ>> (We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the Truth [The Real]) [Q 41:53]. For the very thing he negated was the very thing he affirmed, since he negated nothing but the God (الإله) and affirmed nothing but the God (الإله).\n\n### [The Lowest Form of Modesty Realized by the Monotheist in His Affirmation of Unity]\n\nAs for his Modesty in removing harm (إماطته الأذى) from the path of creation, he is commanded to remove it. Yet, he necessarily sees the Face of the Real (وجه الحق) in it, because it is the lowest of the Levels (المراتب). It is equivalent to the Last (الآخر) of the Divine Names. He looks toward it, just as *Lā ilāha illā Allāh* was the First Name, and the Identity (الهوية) came and took both Names for itself, saying: <<هُوَ الْأَوَّلُ وَالْآخِرُ>> (He is the First and the Last) [Q 57:3]. So he remains hesitant between the reality deserved by the Name The Last, which manifests in the existence of this harm (أذى) in the path of creation, and seeing that creation acts through Divine Names situated between these two Names. The eye of this believer falls only upon Allah, First and Last, and what is between them. The command is directed at him to remove the harm, so he feels shame (يستحيي) before the command not to hasten to what he was commanded to do—the removal—and he feels shame before the Name The Last, which he sees in the very essence of the harm. When this Modesty overtakes him, the Name calls out to him from the harm: \"O so-and-so, it is by Me that you remove this harm from the path of creation, for We are in the harm just as We are in the removal. You did not remove it by other than Me. So do not be ashamed. Look at His saying: 'The lowest of them is the removal of harm.' He connected the harm to the removal, and it is the last degree of Faith. We are in the very essence of the removal; We are not other than it.\" At that point, the person in this state becomes empowered (يتجبر) and removes it by Him, just as he negated the God (الإله) by the God (الإله).\n\n### [Modesty before God is that He does not see you where He forbade you, nor miss you where He commanded you]\n\nWhen the state of the servant in his Modesty before God—in the First and the Last, the Highest and the Lowest—encompasses the intermediate states between these two extremes, he becomes protected in his state (معصوم الحال) and preserved in his station (محفوظ المقام), like the prayer whose consecration is the *Takbīr* and whose conclusion is the *Taslīm*. The favor (المنة) appears in the two extremes so that the middle remains safe between them. The cause of this is the encompassing nature [of Modesty]. Thus, it becomes clear to you, after I have informed you of these realities (الحقائق), that Modesty before God is that He does not see you where He forbade you, nor miss you where He commanded you. This encompasses all the branches of Faith. It is a station accompanied by command, prohibition, and obligation (التكليف). If the time of obligation were to end, this station ought to cease, but this is not the case. Know that the reality of the existence of Modesty (وجود الحياء) is the existence of the Knowledge (العلم) of what is due to Allah, the Exalted, and that you are the one upholding it, and that which is required rationally and legally. It is impossible for any creature to fulfill what is due to Allah, the Exalted, in terms of glorifying Him, rationally and legally. He must inevitably meet his Lord, witness Him (شهوده), and maintain this station. Thus, Modesty accompanies him in this world and the Hereafter, because he never ceases remembering what is due from him and remembering his inability (العدم) to fulfill what is due to God. This is supported by the Tradition that when the Real discloses Himself (تجلى) to His servants on the Day of the Greatest Visitation (يوم الزور الأعظم) and lifts the veils from His servants, when they look upon Him, exalted is His Majesty, they say: \"Glory be to You! We have not worshipped You as You ought to be worshipped.\" This confession is necessitated by Modesty before Allah, the Mighty and Majestic. Thus, Modesty made them speak that way.",
    "ur": "(باب ایک سو اڑتیس: مقام حیا اور اس کے اسرار کی معرفت میں)\n\n> حیا ایمان کا حصہ ہے، نبی کے لفظ سے آیا ہے\n> اور یہ سراسر خیر ہے، پس اسی کے ساتھ ہو جا\n> ہر وہ شخص جو اس کے مشاہدات کی نگہبانی کرتا ہے، اسے اس صفت سے متصف ہونا چاہیے\n> اور اسے کوئی نہیں جانتا سوائے اس کے جو بیدار ہو\n> جو جاگتا ہو، نہ سونے والا ہو اور نہ سست\n> جو اپنے قلب کی نگرانی کرتا ہو جب وہ پلٹتا ہے\n> بے شک \"الحی\" (زندہ) اللہ کے اسماء میں سے ہے، اور اسماء کے ساتھ متخلق ہونے کا حکم آیا ہے، پس اس سے اپنا حصہ حاصل کر۔\n\n### [ہر موجود کا ترک کرنا اصل پر باقی رہنا ہے اور عمل ایک زائد وجودی فرع ہے]\n\nخبر میں آیا ہے کہ \"الحی\" (زندہ) اللہ تعالیٰ کے اسماء میں سے ایک اسم ہے۔\n\nاور اللہ تعالیٰ نے فرمایا: **إِنَّ الله لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا ما بَعُوضَةً فَما فَوْقَها** (بے شک اللہ اس بات سے حیا نہیں کرتا کہ وہ مچھر یا اس سے بھی چھوٹی چیز کی مثال بیان کرے) یعنی صغر (چھوٹا ہونے) میں۔ اور یہ (حیا) ایمان کی صفات میں سے ہے اور مؤمن کی صفات میں سے ہے۔ اور اللہ تعالیٰ کے اسماء میں سے \"المؤمن\" (مصدق) ہے۔ پس حیا والا مؤمن کی صفت ہے۔\n\nبے شک حیا ایمان کا حصہ ہے، اور حیا سراسر خیر ہے، اور حیا صرف خیر ہی لاتی ہے۔ اور یہ سب صحیح اخبار ہیں۔\n\nاور اس کی حقیقت، یعنی اس صفت کی حقیقت، ترک (چھوڑ دینا) ہے۔ کیونکہ ہر موجود کا ترک کرنا اصل پر باقی رہنا ہے، اور عمل اصل پر ایک زائد وجودی فرع ہے۔ اسی لیے اس کے بارے میں کہا گیا کہ یہ سراسر خیر ہے۔ پس حیا ایک سلبی صفت ہے۔ جب بندہ وہ چیزیں جو اللہ کی ہیں، اللہ کے لیے چھوڑ دیتا ہے، اور وہ وجودی امور بھی جو کائنات کہتی ہے کہ بندے کے لیے ہیں، انہیں بھی اللہ کے لیے چھوڑ دیتا ہے، اس حقیقت پر کہ وہ ہر نفس کو اللہ کے لیے چھوڑتا ہے جس پر اجماع ہے کہ وہ اللہ کے لیے ہے، تو اس نے اللہ سے حق حیا کیا۔\n\n### [تمام صفات (نعوت) اصالت کے حکم سے ہیں اور بندے کے لیے یہ اس کی صورت پر تخلیق ہونے کے حکم سے ہیں]\n\nاور جس نے صرف وہ چیزیں جو اللہ کی ہیں، اللہ کے لیے چھوڑ دیں، تو اس نے اللہ سے حیا کیا، لیکن حق حیا نہیں کیا۔ اور یہ اس لیے کہ وہ صفات جن سے ذات حق (الحق) نے خود کو متصف کیا ہے، جنہیں علماء رسوم تشبیہ کی خبریں اور تشبیہ کی آیات سمجھتے ہیں، اور یہ کہ یہ بندوں پر رحمت اور الٰہی لطف کے طور پر ایک الٰہی تنزل ہے—جبکہ ہمارے نزدیک یہ حقیقی صفت ہے جو صرف اللہ تعالیٰ کے لیے ہی مناسب ہے۔ اور بندے میں یہ مستعار ہے، جیسے اس کے دیگر اسماء جن سے وہ متخلق ہوتا ہے۔\n\nبے شک وہ **خَيْرُ الْماكِرِينَ** (بہترین تدبیر کرنے والا) ہے۔ اور اللہ اپنے بندوں میں سے مذاق کرنے والوں سے مذاق کرتا ہے، اور ایسی تدبیر کرتا ہے جو اس کے لیے ہے جہاں سے وہ شعور نہیں رکھتے۔ اور وہ خود کو حوادث (عارضی چیزوں) سے متصف نہیں کرتا۔ پس یہ اس بات کی دلیل ہے کہ یہ صفات اصالت کے حکم سے اللہ کے لیے ہیں، اور بندہ الٰہی میں یہ صرف اس لیے ظاہر ہوئیں کہ وہ ہر لحاظ سے (اللہ کی) صورت پر پیدا کیا گیا ہے۔ اور جب عارفین نے یہ جان لیا اور اللہ تعالیٰ کے اس قول کو دیکھا: **وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں)، تو انہوں نے کائنات میں ظاہر ہونے والی ان صفات کو، جن کے بارے میں علماء رسوم کا عقیدہ ہے کہ وہ بندے کا حق ہیں، ان امور میں شامل کرتے ہوئے جو اللہ کی طرف لوٹتے ہیں، انہیں اللہ کے لیے چھوڑ دیا، کیونکہ انہوں نے اللہ سے حق حیا کیا۔\n\nاور یہ اسم المؤمن (مصدق) کی صفات میں سے ہے، اور مؤمن وہ ہے جو اس بات کی تصدیق کرتا ہے کہ یہ صفات ازل سے اسی (اللہ) کے لیے ہیں، اگرچہ ان کا حکم صرف محدثات (نئی پیدا شدہ چیزوں) میں ظاہر ہوتا ہے۔ پس حیا صدق میں داخل ہے، اور اسی لیے کہا گیا: حیا ایمان کا حصہ ہے۔\n\n### [اصل پر باقی رہنا صرف خیر ہی لاتا ہے]\n\nنبی اکرم صلی اللہ علیہ وسلم کا حیا کے بارے میں یہ فرمان کہ یہ صرف خیر ہی لاتا ہے۔\n\nیہ ایک صحیح اور سچا قول ہے، کیونکہ اصل پر باقی رہنا صرف خیر ہی لاتا ہے۔ اس کے ساتھ کوئی دعویٰ نہیں ہوتا۔ پس وہ ہر اس الٰہی صفت کو قبول کرنے والا ہوتا ہے جس سے ذات حق (الحق) اسے متصف کرنا چاہتا ہے۔ اور اس محل (بندے) میں کوئی ضد نہیں ہوتی جو اسے رد کرے، اور نہ کوئی مقابل جو اسے روکے۔ پس ذات حق (الحق) جو چاہتا ہے وہ بغیر کسی معارض یا جھگڑنے والے کے کرتا رہتا ہے۔ اور جہاں تک ذات حق (الحق) کا اس (بندے) کو متصف کرنا ہے، تو وہ یہ ہے کہ وہ بندے کو حق کی صفات سے متصف ہونے دیتا ہے اور انہیں اس کے سپرد کر دیتا ہے، اور اسے ان میں شرمندہ نہیں کرتا، بلکہ اس کی تصدیق کرتا ہے اور اس کے ذریعے اس کا مرتبہ بلند کرتا ہے، اور اس کے دعوے میں اسے جھٹلاتا نہیں، کیونکہ وہ (بندہ) اس کا مظہر ہے۔ پس یہ ذات حق (الحق) کے \"حی\" (زندہ) ہونے کی وجہ سے ہے۔\n\n### [ذات حق اپنے بندے کی تعظیم کرتا ہے اور اس کی سفیدی کو جھٹلانے سے حیا کرتا ہے]\n\nخبر میں آیا ہے کہ قیامت کے دن ایک بوڑھے شخص سے اللہ تعالیٰ فرمائے گا: اے میرے بندے! تو نے فلاں فلاں کام کیے جو تجھے نہیں کرنے چاہیے تھے۔ تو وہ کہے گا: اے رب! میں نے نہیں کیے۔ حالانکہ اس نے کیے ہوں گے۔ تو ذات حق (الحق) فرمائے گا: اسے جنت کی طرف لے جاؤ۔ تو وہ فرشتے جنہوں نے اس کے اعمال کا احصاء کیا تھا، عرض کریں گے: اے ہمارے رب! کیا تو نہیں جانتا کہ اس نے فلاں فلاں کام کیے تھے؟ تو اللہ فرمائے گا: ہاں، لیکن جب اس نے انکار کیا تو مجھے اس کی سفیدی (بڑھاپے) کو جھٹلانے سے حیا آیا۔\n\nپس جب ذات حق (الحق) بندے کی سفیدی کو جھٹلانے سے حیا کرتا ہے اور اس کی تعظیم کرتا ہے، تو بندہ اس صفت کا زیادہ حقدار ہے۔\n\n### [عارفین اور ملامتیوں کے نزدیک حیا کے درجات]\n\nاور حیا کے درجات عارفین کے نزدیک ہیں اور ملامتیوں کے نزدیک بھی۔ عارفین میں اس کے درجات اکیاون (۵۱) ہیں اور ملامتیوں میں بیس (۲۰) درجات ہیں۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ (ایک سو ایکواں حصہ ختم ہوا)۔\n\n(بسم الله الرحمن الرحيم)\n\n### [انسان کے چہرے پر حیا کا اثر]\n\nچونکہ حیا ایک ایسی صفت ہے جو ایمان سے منسوب ہے، پس یہ ایمان کی ذات میں سے ہے۔ اس لیے اس کا اثر انسان کی ظاہری صورت میں چہرے پر ظاہر ہوتا ہے، کیونکہ چہرہ ہی شے کی ذات، اس کی عین اور اس کی حقیقت ہے۔\n\n### [حیا ایمان کی طرح ستر سے کچھ اوپر شاخوں میں تقسیم ہوتا ہے]\n\nپس حیا بھی اسی طرح تقسیم ہوتا ہے جیسے ایمان ستر سے کچھ اوپر شاخوں میں تقسیم ہوتا ہے، جن میں سب سے اعلیٰ **لا إله إلا الله** (کوئی معبود نہیں سوائے اللہ کے) ہے اور سب سے ادنیٰ راستے سے تکلیف دہ چیز کو ہٹانا ہے۔\n\nاعلیٰ اور ادنیٰ کے درمیان مناسبت یہ ہے کہ شرک توحید کے راستے میں ایک تکلیف دہ چیز (اذیٰ) ہے۔ اس کو ہٹانا عقلی دلائل اور شرعی خبروں کے ذریعے ہوتا ہے، جب کہ گمراہ کن شبہات اور شیطانی خواہشات اسے توحید کے راستے میں ڈال دیتی ہیں۔\n\n### [حیا کی اعلیٰ ترین صورت جو موحد اپنے توحید میں پاتا ہے]\n\nاور حیا کی وہ صورت جو موحد اپنے توحید میں پاتا ہے اور خلق کے راستے سے تکلیف کو دور کرتا ہے، وہ اس کا مستحق (اللہ) کے لیے ایجاب (اثبات) تک پہنچنے سے پہلے معبود کی نفی کرنا ہے، اور وہ اس کا قول **لا إله** (کوئی معبود نہیں) ہے۔\n\nاور نفی عدم (نہ ہونا) ہے۔ پس مؤمن بندے کی طرف سے حیا واقع ہوا، کیونکہ اس نے عدم سے آغاز کیا، اور عدم ہی اس کی عین (حقیقت) ہے، کیونکہ محدث (پیدا شدہ) کی صفت یہ ہے کہ اس پر عدم کی حالت مقدم ہوتی ہے۔ پھر اس نے الوجود (ہستی) حاصل کیا جو ایجاب (اثبات) کے درجے میں ہے جب اس پر نفی واقع ہوئی۔ اور محدث کے لیے اس کے سوا کچھ کہنا ممکن نہیں، کیونکہ وجود کے بعد عدم اور اثبات کے بعد نفی صحیح نہیں ہے۔ کیونکہ اگر ذات حق (الحق) اس پر ابتداءً تجلی (ظہور الٰہی) کرتا، تو وہ اسے شریک میں نفی نہ کرتا، کیونکہ اگر شریک کا وجود ہوتا تو وہ اسے اس کی عین دیکھتا، اور اگر وجود نہ ہوتا (تو نفی کی ضرورت نہ ہوتی)۔ پس موحد کی نظر جب وجود حق (الحق) پر پڑتی ہے تو وہ اس وجود کے ساتھ عدم کو نہیں دیکھ سکتا۔ لہٰذا وہ کبھی بھی کلمہ توحید ادا نہ کرتا اور نہ کبھی خود کو دیکھتا۔\n\nپس انسان پر اللہ تعالیٰ کی رحمت میں سے یہ ہے کہ اس نے پہلے اسے اس کا نفس (ذات) دکھایا۔ پس اس نے اپنے نفس میں ایسی قوتیں دیکھیں جو صرف اس کے لیے ہونی چاہئیں جو معبود ہو۔ پھر جب اس نے اپنی عقل سے غور کیا اور ان عارضی چیزوں کو دیکھا جو اس پر اس کی مرضی کے بغیر طاری ہوتی ہیں اور اس کے مقاصد کے خلاف ہوتی ہیں، اور اپنے نفس میں محتاجی پائی، تو اسے یقین ہو گیا کہ اس کے وجود کی عین (حقیقت) ایک شبہ ہے، اور یہ صفات اس کے لیے مناسب نہیں جو معبود ہو۔ پس اس نے اس الوہیت کی نفی کی جو اس کے نفس سے قائم ہوئی تھی، اور کہا: **لا إله** (کوئی معبود نہیں)۔\n\nپھر جب اس نے مزید غور کیا تو اس نے پایا کہ اس کا نفس دوسرے کے ذریعے قائم ہے اور اپنے وجود میں خود مختار نہیں ہے۔ پس اس نے ایجاب (اثبات) کیا اور اس وقت کہا: **إلا الله** (سوائے اللہ کے)۔ جب اس نے اثبات کیا، تو اس نے اس چیز کو دیکھا جس کا اس نے اثبات کیا تھا، اور اسے وہی صورت نظر آئی جس کی اس نے نفی کی تھی، جو اس کے ساتھ اس طرح جڑی ہوئی تھی جیسے سایہ شخص کے ساتھ جڑا ہوتا ہے، اس نور علم کے ذریعے جس نے اس کی آنکھ کو اس ادراک کے لیے کھولا۔ حالانکہ اس نے اپنے قول **لا إله** سے اس کی نفی کی تھی۔ پس اسے حیا آیا کہ اس نے **لا إله** کیسے کہہ دیا۔ اسی لیے ایک گروہ نے اسے عام اذکار میں شامل کر دیا۔ اور ہمارے بعض شیوخ اپنے ذکر میں صرف لفظ \"اللہ اللہ\" کہتے تھے، وہ **لا إله إلا الله** نہیں کہتے تھے۔ میں نے ان سے اس بارے میں پوچھا تو انہوں نے فرمایا: میری روح اللہ کے ہاتھ میں ہے، میرے اختیار میں نہیں۔ اور میں ہر سانس میں موت اور ملاقات کا منتظر ہوں۔ اور کلام کے حروف میں سے ہر حرف ایک سانس ہے۔ ممکن ہے جب وہ سانس نکلے تو اسی کے نکلنے پر مفارقت ہو جائے، اور اس کے بعد اللہ کی طرف سے کوئی دوسرا سانس نہ آئے۔ پس اگر میں \"لا\" کہوں اور ایجاب (اثبات) تک پہنچنے سے پہلے مفارقت ہو جائے، تو میں نفی کی وحشت میں قبض کیا جاؤں گا نہ کہ ایجاب کے انس میں۔ اسی لیے میں نے ذکر جلالہ کی طرف رجوع کیا، کیونکہ میرے مشاہدے میں اس کے سوا کوئی نہیں۔ پس جس کا یہ حال ہو، اسے **لا إله إلا الله** کہنے میں ضرور حیا آئے گا، اور یہ شدید ترین حیا ہے۔ پس یہ ایمان کی سب سے اعلیٰ شاخ تھی، اور اللہ سے حیا کی سب سے اعلیٰ شاخ تھی، کیونکہ اس نے اپنے خالق کو دیکھنے سے پہلے اپنے نفس کو دیکھا۔ اور یہی نبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے: **من عرف نفسه عرف ربه** (جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا)۔\n\nاور اللہ کا یہ فرمان: **سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ** (ہم انہیں آفاق میں اور ان کے نفوس میں اپنی نشانیاں دکھائیں گے، یہاں تک کہ ان پر واضح ہو جائے کہ وہی ذات حق ہے)، کیونکہ جس چیز کی اس نے نفی کی وہ عین وہی تھی جس کا اس نے اثبات کیا، اس نے معبود کے سوا کسی کی نفی نہیں کی اور معبود کے سوا کسی کا اثبات نہیں کیا۔\n\n### [حیا کی ادنیٰ ترین صورت جو موحد اپنے توحید میں پاتا ہے]\n\nاور جہاں تک خلق کے راستے سے تکلیف دہ چیز کو ہٹانے میں اس کا حیا ہے، تو اسے ہٹانے کا حکم دیا گیا ہے۔ پھر وہ اس میں ذات حق (الحق) کا چہرہ ضرورتاً دیکھتا ہے، کیونکہ یہ ادنیٰ ترین مرتبہ ہے۔ پس یہ الٰہی اسماء میں سے \"الآخر\" (آخر) کے درجے میں ہے، اور اسی کی طرف دیکھتا ہے، جیسے **لا إله إلا الله** اسم اول تھا، اور ہویت (ذات) آئی اور دونوں اسماء کو اپنے لیے لے لیا اور کہا: **هُوَ الْأَوَّلُ والْآخِرُ** (وہی اول ہے اور وہی آخر ہے)۔\n\nپس وہ اس حق کے درمیان متردد رہتا ہے جس کا اسم الآخر (آخر) مستحق ہے، جو خلق کے راستے میں اس تکلیف دہ چیز کے ہونے میں ظاہر ہے۔ اور وہ دیکھتا ہے کہ خلق ان دونوں اسماء کے درمیان الٰہی اسماء کے ذریعے متصرف ہیں۔ پس اس مؤمن کی نظر اولاً و آخراً اور ان کے درمیان صرف اللہ پر پڑتی ہے۔ اور اس پر ہٹانے کا حکم متوجہ ہے۔ پس وہ حکم سے حیا کرتا ہے کہ وہ اس چیز کو ہٹانے میں جلدی نہ کرے جس کا اسے حکم دیا گیا ہے، اور وہ اسم الآخر (آخر) سے بھی حیا کرتا ہے جسے وہ عین تکلیف دہ چیز میں دیکھتا ہے۔\n\nپس جب یہ حیا اسے پا لیتا ہے، تو وہ اسم اس تکلیف دہ چیز سے اسے پکارتا ہے: اے فلاں! تو میرے ذریعے خلق کے راستے سے اس تکلیف دہ چیز کو ہٹا رہا ہے۔ کیونکہ ہم تکلیف دہ چیز میں بھی ہیں جیسے ہم ہٹانے میں ہیں۔ تو نے اسے میرے سوا کسی اور سے نہیں ہٹایا، پس حیا نہ کر۔ اس کے اس قول پر غور کر: \"ادنیٰ ترین شاخ راستے سے تکلیف دہ چیز کو ہٹانا ہے\"۔ پس اس نے تکلیف دہ چیز کو ہٹانے سے جوڑ دیا، اور یہ ایمان کے آخری درجات میں سے ہے۔ پس ہم عین ہٹانے میں ہیں، ہم اس کے سوا کچھ نہیں۔ تب اس حال کا مالک جرات پکڑتا ہے اور اسے اسی (اللہ) کے ذریعے ہٹاتا ہے، جیسے اس نے معبود کی نفی معبود کے ذریعے کی۔\n\n### [اللہ سے حیا یہ ہے کہ وہ تجھے وہاں نہ دیکھے جہاں اس نے منع کیا اور تجھے وہاں سے غائب نہ پائے جہاں اس نے حکم دیا]\n\nاور جب بندے کا حال اللہ سے حیا میں اول و آخر اور اعلیٰ و ادنیٰ میں ہو، تو ان دونوں اطراف کے درمیان کی درمیانی چیزیں محدود ہو جاتی ہیں۔ پس وہ معصوم الحال اور محفوظ المقام ہو جاتا ہے، جیسے نماز جس کی تحریم تکبیر ہے اور تحلیل سلام ہے۔ پس دونوں اطراف میں احسان ظاہر ہوا تاکہ ان کے درمیان کا حصہ محفوظ رہے۔ اور اس کی وجہ یہ تحدید ہے۔\n\nپس ان حقائق کے بعد جن پر میں نے تمہیں مطلع کیا، تمہارے لیے واضح ہو گیا کہ اللہ سے حیا یہ ہے کہ وہ تجھے وہاں نہ دیکھے جہاں اس نے منع کیا اور تجھے وہاں سے غائب نہ پائے جہاں اس نے حکم دیا۔ پس یہ تمام شعبہائے ایمان کو شامل ہے۔ اور یہ وہ مقام ہے جس کے ساتھ امر، نہی اور تکلیف (شرعی ذمہ داری) جڑی ہوئی ہے۔ پس جب تکلیف کا زمانہ ختم ہو جائے تو اسے (حیا کو) زائل ہو جانا چاہیے، لیکن معاملہ ایسا نہیں ہے۔ پس جان لو کہ حیا کے وجود کی حقیقت میں وہ علم شامل ہے جو اللہ تعالیٰ کے لیے واجب ہے، اور تم اس کے قائم کرنے والے ہو، اور عقلی و شرعی طور پر مطلوب ہو۔ اور یہ محال ہے کہ کوئی مخلوق عقلی اور شرعی طور پر اللہ تعالیٰ کی تعظیم کے اس حق کو پورا کر سکے جو اس پر واجب ہے۔ اور اسے اپنے رب سے ملاقات، اس کے شہود (مشاہدہ) اور اس مقام کا سامنا کرنا ہے۔ پس حیا دنیا اور آخرت میں اس کے ساتھ رہے گا۔ کیونکہ وہ ہمیشہ اس چیز کو یاد رکھتا ہے جو اس پر واجب ہے، اور اس بات کو بھی یاد رکھتا ہے کہ وہ اللہ کے حق میں اس کے واجبات کو پورا کرنے سے قاصر ہے۔ اور خبر میں وہ چیز آئی ہے جو اس کی تائید کرتی ہے کہ جب ذات حق (الحق) روزِ زورِ اعظم (قیامت) کو اپنے بندوں پر تجلی (ظہور الٰہی) کرے گا اور ان سے پردے اٹھا دے گا، تو جب وہ اس کی طرف دیکھیں گے، جل جلالہ، تو کہیں گے: **سبحانك ما عبدناك حق عبادتك** (تو پاک ہے، ہم نے تیری عبادت کا حق ادا نہیں کیا)۔\n\nپس یہ اعتراف اللہ عزوجل سے حیا نے واجب کیا، اور حیا نے ہی انہیں یہ بات کہلوائی۔",
    "fa": "(باب صد و سی و هشتم در معرفت مقام حیاء و اسرار آن)\n\nهمانا حیاء از ایمان است، که سخن پیامبر آن را آورد، و تماماً خیر است، پس به آن متصف شو.\n\nپس هر کس که مراقب مشاهدات (شهود) خود است، باید به آن متصف شود؛ و این را جز بیدار دل (منتبه) نمی‌داند.\n\nبیدار است، نه خواب‌آلود و نه تنبل؛ مراقب قلب خویش در هنگام دگرگونی‌های آن است.\n\nهمانا «الحی» (زنده) از اسماء الهی است، و تخلق (تخلق) به اسماء الهی آمده است، پس بهره خود را از آن ببر.\n\n### [ترک هر موجودی، بقا بر اصل است و عمل، فرعی وجودی و زائد است]\n\nدر خبر آمده است که «الحی» (زنده) اسمی از اسماء الله تعالی است.\n\nو خداوند متعال می‌فرماید: **إِنَّ الله لا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا ما بَعُوضَةً فَما فَوْقَها** (همانا خداوند از اینکه مَثَلی به پشه یا بالاتر از آن بزند، حیاء نمی‌کند)؛ یعنی در کوچکی (مثال). و حیاء از صفات ایمان و از صفات مؤمن است، و از اسماء او تعالی «المؤمن» (مؤمن) است؛ پس «الحیی» (بسیار با حیاء) نعت مؤمن است.\n\nزیرا حیاء از ایمان است، و حیاء تماماً خیر است، و حیاء جز خیر نمی‌آورد؛ و اینها همه اخبار صحیحی هستند.\n\nو حقیقت آن، یعنی این صفت، «ترک» است؛ زیرا ترک هر موجودی، بقا بر اصل است، و عمل فرعی وجودی است که بر اصل افزوده می‌شود. به همین دلیل گفته شده است که حیاء تماماً خیر است. پس حیاء نعت سلبی است. بنابراین، بنده هنگامی که ترک می‌کند\n\nآنچه را که برای خداست، برای خدا، و آنچه را که کائنات می‌گویند از امور وجودی برای بنده است، آن را نیز برای خدا ترک می‌کند، بر اساس حقیقتی که آنچه را که به اجماع برای خداست، از هر نفسی برای خدا ترک می‌کند، در این صورت حق حیاء را از خداوند به جا آورده است.\n\n### [تمام صفات (نعوت) به حکم اصالت برای حق است و برای بنده به حکم خلق شدن بر صورت الهی است]\n\nو هر کس آنچه را که برای خداست، فقط برای خدا ترک کند، از خداوند حیاء کرده است، اما نه حق حیاء را. و این بدان سبب است که صفاتی (نعوت) که حق (الحق) خود را بدانها وصف کرده است، از جمله اخبار تشبیه و آیات تشبیه نامیده می‌شوند، آن‌گونه که علمای رسوم (علماء الرسوم) می‌پندارند، و اینکه آن تنزلی الهی است از روی رحمت به بندگان و لطفی الهی است. در حالی که نزد ما، آن نعت حقیقی است که جز برای او تعالی شایسته نیست، و در بنده عاریتی است، مانند سایر صفاتی که بنده به واسطه اسماء الهی به آنها تخلق (تخلق) می‌یابد. زیرا او **خَيْرُ الْماكِرِينَ** (بهترین مکرکنندگان) است، و خداوند با استهزاکنندگان از بندگانش به استهزاء و مکری که از آنِ اوست، در حالی که آنان نمی‌دانند، استهزاء می‌کند. و او خود را به حوادث وصف نمی‌کند. پس این دلالت دارد که این صفات به حکم اصالت برای خداست و در بنده الهی ظاهر نشده است مگر به دلیل اینکه او از جمیع وجوه بر صورت الهی خلق شده است. و هنگامی که عارفان (عارفون) این را دانستند و قول خداوند متعال را دیدند که: **وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (و همه امور به سوی او بازگردانده می‌شود)، و این صفات ظاهر شده در کائنات را که علمای رسوم معتقدند حق بنده است، از جمله اموری دانستند که به سوی خدا بازمی‌گردد، آنها را برای خدا ترک کردند، به دلیل اینکه حق حیاء را از خداوند به جا آوردند. و این (حیاء) از صفات اسم «المؤمن» (مؤمن) است، و مؤمن کسی است که تصدیق می‌کند که این صفات از ازل برای اوست، اگرچه حکم آنها جز در موجودات حادث ظاهر نشده است. پس حیاء در صدق (راستی) داخل می‌شود و به همین دلیل است که\n\nفرمود: حیاء از ایمان است.\n\n### [بقا بر اصل جز خیر نمی‌آورد]\n\nسخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره حیاء که فرمود: «همانا جز خیر نمی‌آورد»،\n\nکلامی صحیح و صادق است؛ زیرا بقا بر اصل جز خیر نمی‌آورد، چرا که ادعایی همراه آن نیست. پس بنده پذیرای هر صفت الهی است که حق (الحق) بخواهد او را بدان متصف سازد، و در آن محل، ضدی نیست که آن را رد کند و مقابلی نیست که آن را بازدارد. پس حق باقی می‌ماند و آنچه را می‌خواهد بدون معارض و منازع انجام می‌دهد. و اما وصف کردن حق به آن (حیاء)، این است که بنده را رها می‌کند تا به صفات حق متصف شود و آنها را به او تسلیم می‌کند و او را در آن صفات خجل نمی‌سازد، بلکه او را تصدیق می‌کند و رتبه او را بالا می‌برد و در ادعایش او را تکذیب نمی‌کند، زیرا بنده مَجلای (محل ظهور) اوست. پس این از آن جهت است که حق «حی» (زنده) است.\n\n### [حق بنده خود را گرامی می‌دارد و حیاء می‌کند که موی سپید او را تکذیب کند]\n\nدر خبر آمده است که در روز قیامت، خداوند به پیری می‌گوید: ای بنده من، فلان و فلان کار را انجام دادی، کارهایی که شایسته نبود انجام دهی. او می‌گوید: پروردگارا، من انجام ندادم، در حالی که انجام داده است. حق (الحق) می‌فرماید: او را به سوی بهشت ببرید. فرشتگانی که اعمال او را ثبت کرده‌اند، می‌گویند: پروردگارا، آیا نمی‌دانی که او فلان و فلان کار را انجام داده است؟ حق می‌فرماید: بله، اما چون او انکار کرد، حیاء کردم که موی سپید او را تکذیب کنم.\n\nپس اگر حق (الحق) از بنده حیاء می‌کند که موی سپید او را تکذیب کند و او را گرامی می‌دارد، بنده به این صفت سزاوارتر است.\n\n### [درجات حیاء نزد عارفان و نزد ملامیان]\n\nو حیاء نزد عارفان (عارفین) و نزد ملامیان (ملامیین) درجاتی دارد. درجات آن در عارفان پنجاه و یک درجه و در ملامیان بیست درجه است. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را هدایت می‌کند). (پایان جزء صد و یکم)\n\n(بسم الله الرحمن الرحیم)\n\n### [اثر حیاء در چهره انسان]\n\nاز آنجا که حیاء صفتی است که به ایمان نسبت داده می‌شود، پس از ذات ایمان است. اثر آن از ظاهر صورت انسان در چهره (وجه) است، زیرا چهره ذات شیء، عین آن و حقیقت آن است.\n\n### [حیاء مانند ایمان به هفتاد و چند شعبه تقسیم می‌شود]\n\nپس حیاء تقسیم می‌شود، همان‌گونه که ایمان به هفتاد و چند شعبه تقسیم می‌شود؛ بالاترین آنها **لا إله إلا الله** (هیچ معبودی جز خدا نیست) و پایین‌ترین آنها دور کردن آزار از راه است.\n\nو مناسبت میان بالا و پایین این است که شرک، آزاری در راه توحید است. دور کردن آن (شرک) به وسیله دلایل عقلی و اخبار شرعی است، در مقابل شبهات گمراه‌کننده و هواهای شیطانی که آن را در راه توحید قرار داده‌اند.\n\n### [بالاترین صورت‌های حیاء که موحد در توحید خود درک می‌کند]\n\nو صورت حیایی که موحد (موحد) در توحید خود درک می‌کند و آزار را از راه خلق برمی‌دارد، تلفظ او به نفی معبود (إله) پیش از رسیدن به اثبات آن برای کسی است که شایسته آن است، و آن سخن اوست: **لا إله** (هیچ معبودی نیست). و نفی، عدم است. پس حیاء از بنده مؤمن واقع شد، زیرا با عدم آغاز کرد، و عدم عین اوست؛ چرا که صفت موجود حادث، تقدم حال عدم بر اوست. سپس وجود را کسب کرد که به منزله ایجاب (اثبات) است، هنگامی که نفی بر آن واقع شد. و برای موجود حادث ممکن نیست که جز این بگوید، زیرا عدم پس از وجود و نفی پس از اثبات صحیح نیست. اگر حق (الحق) از ابتدا بر او تجلی (تجلی) می‌کرد، او را در شریک نفی نمی‌کرد، زیرا اگر شریک وجودی داشت، آن را عین حق می‌دید، و اگر وجودی نداشت، باز هم نفی نمی‌کرد. پس نظر موحد هنگامی که بر وجود حق واقع می‌شود، نمی‌تواند با این وجود، عدمی را ببیند. در نتیجه، هرگز کلمه توحید را بر زبان نمی‌آورد و هرگز خود را نمی‌بیند. پس از رحمت خداوند متعال بر انسان این است که ابتدا خود او را به شهود (شهود) خود رساند. پس در خود نیروهایی دید که شایسته نیست جز برای کسی باشد که معبود است. هنگامی که با عقل خود در نظر دقیق شد و به عوارض ناخواسته‌ای که بر او عارض می‌شد و با اهدافش مخالفت می‌کرد، نگریست و در خود فقر (افتقار) یافت، قطعاً دانست که عین وجود او شبهه است و این صفات شایسته کسی که معبود است، نیست. پس آن الوهیتی را که از جانب خودش برایش پدید آمده بود، نفی کرد و گفت: **لا إله** (هیچ معبودی نیست). سپس هنگامی که در نظر تعمق کرد، خود را قائم به غیر دید و در وجود خود مستقل نبود. پس اثبات کرد و در آن هنگام گفت: **إلا الله** (جز خدا). هنگامی که اثبات کرد، به این که اثبات کرده بود نگریست و آن را عین صورت چیزی دید که نفی کرده بود، در حالی که به آن مرتبط بود، مانند ارتباط سایه با شخص، به واسطه نور علمی که چشم او را به این ادراک گشوده بود. و او پیش از این با گفتن **لا إله** آن را نفی کرده بود، پس حیاء کرد که چگونه **لا إله** را بر زبان آورد. و به همین دلیل، گروهی آن را از اذکار عمومی قرار دادند. و برخی از شیوخ ما در ذکر خود جز لفظ «الله الله» نمی‌گفتند و **لا إله إلا الله** را نمی‌گفتند. از او درباره این موضوع پرسیدم، گفت: روح من در دست خداست و تحت حکم من نیست، و در هر نفسی منتظر مرگ و لقاء هستم. و هر حرفی از حروف کلام، یک نفس است. ممکن است هنگامی که (نفس) برگردد، مفارقت (جدایی) در بازگشت آن باشد و نفس دیگری از جانب خدا پس از آن نیاید. پس اگر بگویم «لا» (نه) و زنده بمانم تا بگویم **لا إله**، سپس پیش از رسیدن به ایجاب (اثبات) مفارقت کنم، در وحشت نفی قبض می‌شوم، نه در انس ایجاب. به همین دلیل به ذکر جلاله روی آوردم، زیرا مشهودی جز او ندارم. پس کسی که حالش چنین است، ناگزیر است که در گفتن **لا إله إلا الله** حیاء کند، و این شدیدترین حیاء است. پس این (کلمه) بالاترین شعبه ایمان بود، و بالاترین شعبه حیاء از خدا بود، زیرا پیش از نظر به خالقش، به خود نگریست، و این همان سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است که فرمود: «هر کس خود را شناخت، پروردگارش را شناخت.»\n\nو سخن خداوند: **سَنُرِيهِمْ آياتِنا فِي الْآفاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ** (به زودی آیات خود را در آفاق و در خودشان به آنان نشان خواهیم داد تا برایشان آشکار شود که او حق است)؛ زیرا عین چیزی که نفی کرد، عین چیزی بود که اثبات نمود. او جز معبود (إله) را نفی نکرد و جز معبود (إله) را اثبات ننمود.\n\n### [پایین‌ترین صورت‌های حیاء که موحد در توحید خود درک می‌کند]\n\nو اما حیاء او در دور کردن آزار از راه خلق، این است که او به دور کردن آن مأمور شده است. سپس او وجه حق (الحق) را در آن به ضرورت می‌بیند، زیرا این پایین‌ترین مراتب است. پس آن به منزله «الآخر» (آخر) از اسماء الهی است و به سوی آن می‌نگرد، همان‌گونه که **لا إله إلا الله** اسم «الأول» (اول) بود. و هویت (الهویه) آمد و هر دو اسم را برای خود گرفت و گفت: **هُوَ الْأَوَّلُ وَالْآخِرُ** (اوست اول و آخر). پس (موحد) متردد می‌ماند میان حقی که اسم «الآخر» شایسته آن است و در این آزار بودن در راه خلق ظاهر شده است، و می‌بیند که خلق به واسطه اسماء الهی میان این دو اسم تصرف می‌کنند. پس چشم این مؤمن جز بر خدا، اول و آخر و آنچه میان آن دو است، نمی‌افتد. و امر به دور کردن آزار متوجه اوست. پس از امر حیاء می‌کند که به آنچه به او امر شده است، مبادرت نورزد، و از اسم «الآخر» که آن را در عین آزار می‌بیند، حیاء می‌کند. هنگامی که این حیاء او را درمی‌یابد، آن اسم از درون آزار او را ندا می‌دهد: ای فلان، به واسطه من این آزار را از راه خلق دور می‌کنی. زیرا ما در آزار هستیم، همان‌گونه که در دور کردن آزار هستیم. تو آن را به غیر من برطرف نکردی، پس حیاء مکن. در این سخن بنگر که:\n\nسخن او (پیامبر) که: «پایین‌ترین آن، دور کردن آزار است.»\n\nپس آزار را به دور کردن آن مرتبط ساخت، و آن آخرین درجه ایمان است. پس ما در عین دور کردن آزار هستیم و غیر آن نیستیم. در این هنگام، صاحب این حال قوی می‌شود و آن را به واسطه او (حق) دور می‌کند، همان‌گونه که معبود (إله) را به واسطه معبود (إله) نفی کرد.\n\n### [حیاء از خدا این است که تو را در جایی که نهی کرده است نبیند و در جایی که امر کرده است، تو را گم نکند]\n\nو هنگامی که حال بنده در حیای او از خداوند در اول و آخر و بالا و پایین باشد، متوسطات میان این دو طرف محصور می‌شوند. پس او معصوم الحال و محفوظ المقام خواهد بود، مانند نماز که تحریم آن تکبیر و تحلیل آن سلام است. پس منت (نعمت) در دو طرف ظاهر شد تا میانه میان آن دو سالم بماند، و سبب آن، همین حصر است. پس برای تو آشکار شد، پس از آنکه تو را بر حقایق (حقائق) آگاه ساختم، که حیاء از خداوند این است که تو را در جایی که نهی کرده است نبیند و در جایی که امر کرده است، تو را گم نکند. پس این (تعریف) شامل تمام شعبه‌های ایمان می‌شود. و این مقامی است که امر و نهی و تکلیف همراه آن است. اگر زمان تکلیف به پایان می‌رسید، شایسته بود که این مقام نیز زائل شود، اما امر چنین نیست. پس بدان که از حقیقت وجود حیاء، وجود علم به آنچه بر خداوند واجب است، می‌باشد، و تو قیام‌کننده به آن هستی، و این مطلوب عقلی و شرعی است. و محال است که مخلوقی بتواند به آنچه از تعظیم خداوند تعالی عقلاً و شرعاً بر او واجب است، وفا کند. و ناگزیر است که پروردگارش را ملاقات کند و به شهود (شهود) او برسد و این مقام اوست. پس حیاء در دنیا و آخرت همراه اوست، زیرا او پیوسته به یاد آنچه بر او واجب است، و به یاد عدم قیام خود در حق خدا به آنچه برای او واجب است، می‌باشد. و در خبر آمده است که این امر را تأیید می‌کند: هنگامی که حق (الحق) در روز «زور اعظم» بر بندگانش تجلی (تجلی) می‌کند و حجاب‌ها را از بندگانش برمی‌دارد، وقتی به او جل جلاله می‌نگرند، می‌گویند: «سبحانک ما عبدناك حق عبادتك» (منزهی تو، ما تو را آن‌گونه که شایسته عبادت توست، عبادت نکردیم).\n\nپس این اعتراف را حیاء از خداوند عز و جل واجب ساخت، و حیاء آنان را به این سخن واداشت."
  },
  "page_count": 3
}