{
  "id": 128,
  "title": {
    "ar": "الباب الثامن والعشرون ومائة في معرفة مقام الرضى وأسراره",
    "en": "Chapter One Hundred and Twenty-Eight, Concerning the Knowledge of the Station of Contentment (مقام الرضى) and its Secrets.",
    "ur": "باب ایک سو اٹھائیس (۱۲۸): مقامِ رضائے الٰہی (مقام الرضى) کی معرفت اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و بیست و هشتم در معرفت مقام رضا و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثامن والعشرون ومائة في معرفة مقام الرضى وأسراره)\n\n\n> سألت ربي عصمة *** من كل سوء وأذى‏\n\n\n> وإن أرى من أجله *** كروحه منتبذا\n\n\n> مختطفا عن نفسه *** مستهلكا متخذا\n\n\n> حتى أقول صادقا *** من حالنا يا حبذا\n\n\n> رضيت منه بكذا *** رضيت عنه لكذا\n\n\n> وهكذا نسبه *** إليه حكما هكذا\n\n\n> وهو دليل قاطع *** على يسير فإذا\n\n\n> أفردته عن من وعن *** وصفته بذا وذا\n\n\n> وكنت ذا معرفة *** بحقه وجهبذا\n\n\n### [الرضى يدل على حصول يسير من كثير]\n\n\nاعلم وفقك الله أن قولي دليل قاطع على يسير أعني الرضي يدل على يسير من كثير فيرضى به أدبا مع الله لأنه وكله‏\n\n\n### [الرضا أمر مختلف فيه: هل هو مقام أو حال‏]\n\n\nوالرضي أمر مختلف فيه عند أهل الله هل هو مقام أو حال فمن رآه حالا ألحقه بالمواهب ومن رآه مقاما ألحقه بالمكاسب وهو نعت إلهي وكل نعت إلهي إذا أضيف إلى الله فليس يقبل الوهب ولا الكسب فهو على غير المعنى الذي إذا نسبناه للخلق لم يبق له تلك الصفة فحصل له بنسبته للخلق إن ثبت كان مقاما وإن زال كان حالا وهو على الحقيقة يقبل الوصفين وهو الصحيح فهو في حق بعض الناس حال وفي حق بعض الناس مقام وكل نعت إلهي بهذه المثابة فتجرى النعوت الإلهية إذا نسبت إلى الخلق مجرى الاعتقادات فكما أنه يقبل كل اعتقاد ويصدق فيه كل معتقد كذلك النعوت الإلهية إذا نسبت للخلق تقبل صفات المقامات وصفات الأحوال هذا هو تحرير هذه الصفة وأمثالها وهو الذي عليه الأمر\n\n\n### [الاستطاعة حدها أول درجات الحرج‏]\n\n\nوقد وصف الله نفسه وهو ما أعطاه العبد من نفسه رضي الله به ورضي عنه فيه وإن لم يبذل استطاعته فإنه لو بذل استطاعته التي إذا بذلها وقع في الحرج كان قد بذلها على جهد ومشقة وقد رفع الله الحرج عن عباده في دينه فعلمنا أن المراد بالاستطاعة في مثل قوله فَاتَّقُوا الله ما اسْتَطَعْتُمْ ولا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها وما آتاها إن حدها أول درجات الحرج فإذا أحس به أو استشرف عليه قبل الإحساس به فذلك حد الاستطاعة المأمور بها شرعا ليجمع بين قوله تعالى فَاتَّقُوا الله ما اسْتَطَعْتُمْ وبين قوله ما (جَعَلَ) عَلَيْكُمْ في الدِّينِ من حَرَجٍ ودين الله يسر\n\n\nويُرِيدُ الله بِكُمُ الْيُسْرَ في قوله ما اسْتَطَعْتُمْ ولما فهمت الصحابة من الاستطاعة ما ذكرناه لذلك كانت رخصة لعزمة قوله حَقَّ تُقاتِهِ فرضي الله منك إذا أعطيته مما كلفك حد الاستطاعة التي لا حرج عليك فيها ورضيت منه أنت بالذي أعطاك من حال الدنيا ورضيت عنه في ذلك وقد عرفت أحوال الدنيا أنها الطاعة خاصة كما بيناها في باب المراقبة\n\n\n### [عطاء الحق في الدنيا والآخرة قليل بالنسبة إلى ما عنده‏]\n\n\nوكلما أعطاك الحق في الدنيا والآخرة من الخير والنعم فهو قليل بالنسبة إلى ما عنده فإن الذي عنده لا نهاية له وكل ما حصل لك من ذلك فهو متناه بحصوله في الوجود ونسبة ما يتناهى إلى ما لا يتناهى أقل القليل كما\n\n\nقال الخضر لموسى لما نقر الطائر بمنقره في البحر ليشرب من مائه فشبهه بما هم عليه من العلم وبعلم الله‏\n\n\nفلذلك قال رضي الله عنهم في يسير العمل ورضوا عنه‏\nفي يسير الثواب لأنه لا يتمكن تحصيل ما لا يتناهى في الوجود لأنه لا يتناهى فلذلك قلنا متعلق الرضي اليسير وهو الرضي بالموجود فرضي به من الله وعن الله فيه وما قدم الله رضاه عن عبيد بما قبله من اليسير من أعمالهم التي كلفهم إلا ليرضوا عنه في يسير الثواب لما علموا إن عنده ما هو أكثر من الذي وصل إليهم فهو يصل إليهم مع الآنات حالا بعد حال أبد الآباد من غير انقطاع مع انقطاع أعمالهم التي كانت عن تكليف مشروع فانقطعت الأعمال منهم ولم تتقطع العبادة\n\n\n### [بقاء جزاء العبادة في السعداء وجزاء العبودية في الأشقياء]\n\n\nفإذا تناهي حد العمل الحسن والقبيح في أهل الجنة وأهل النار بقي جزاؤهم جزاء العبادة في السعداء وجزاء العبودية في أهل النار وهو جزاء لا ينقطع أبدا فهذا أعطاهم اتساع الرحمة وشمولها فإن المجرمين لم يزل عنهم شهود عبوديتهم وإن ادعوا ربانية فيعلمون من نفوسهم أنهم كاذبون بما يجدونه فتزول الدعوى بزوال أوانها وتبقي عليهم نسبة العبودية التي كانوا عليها في حال الدعوى وقبل الدعوى ويجنون ثمرة قولهم بَلى‏ فكانوا بمنزلة من أسلم بعد ارتداده فحكم على الكل سلطان بلي فأعقبهم سعادة بعد ما مسهم من الشقاء بقدر ما كانوا عليه من زمان الدعوى فما زال حكم بلي يصحبهم من وقته إلى ما لا يتناهى دنيا وبرزخا وآخرة وعرضت عوارض لبعض الناس أخرجتهم في الظاهر عن حكم توحيدهم بما ادعوه من الألوهة في الشركاء فأثبتوه وزادوا فقام لهم الشركاء مقام الأسباب للمؤمنين‏\n\n\n### [كل عارض زائل وحكمه يزول بزواله‏]\n\n\nوكل عارض زائل وحكمه يزول بزواله ويرجع الحكم إلى الأصل والأصل يقتضي السعادة فمال الكل إن شاء الله إليها مع عمارة الدارين ولكل واحدة ملؤها والرحمة تصحبها كما صحبت هنا العبودية لكل أحد ممن بقي عليها أو ادعى الربوبية فإنه ادعى أمرا يعلم من نفسه خلافه فمقام الرضي ما ثنته لك فقل فيه بعد هذا ما شئت حال أو مقام أو لا حال ولا مقام واعلم الفرق فيه بين النسبتين نسبته لله ونسبته للخلق والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter One Hundred and Twenty-Eight: Concerning the Gnosis of the Station of Contentment (مقام الرضى) and its Secrets\n\nI asked my Lord for preservation\nFrom every evil and harm,\n\nAnd that I may see, for His sake,\nMyself separated like His Spirit,\n\nSnatched away from my self,\nAnnihilated (مستهلكا), and taken (by Him),\n\nUntil I say truthfully,\nConcerning our state, \"How excellent!\"\n\nI am content with Him concerning such-and-such,\nI am content with Him for such-and-such.\n\nAnd thus is its attribution\nTo Him, a judgment thus.\n\nAnd it is a conclusive proof\nConcerning the little (the meager), so when—\n\nYou isolate it from 'from whom' and 'from what,'\nAnd describe it with 'this and that,'\n\nAnd you are possessed of Gnosis (معرفة)\nConcerning His right, and a master (جهبذا).\n\n### [Contentment Indicates the Attainment of the Little from the Much]\n\nKnow, may Allah grant you success, that my statement, \"a conclusive proof concerning the little,\" means that Contentment (الرضى) indicates the attainment of the little from the much. Thus, one is content with it out of proper conduct (أدبا) toward Allah, because He has entrusted him (with it).\n\n### [Contentment is a Matter Disputed: Is it a Station or a State?]\n\nContentment (الرضى) is a matter disputed among the People of Allah (أهل الله): Is it a station (مقام) or a state (حال)? Whoever views it as a state attributes it to Divine Gifts (المواهب), and whoever views it as a station attributes it to acquired efforts (المكاسب).\n\nIt is a Divine Attribute (نعت إلهي), and every Divine Attribute, when attributed to Allah, accepts neither gift nor acquisition. Therefore, it is upon a meaning different from that which, when we attribute it to creation (الخلق), does not retain that quality. Thus, by its attribution to creation, if it is fixed, it is a station; and if it vanishes, it is a state.\n\nIn reality, it accepts both descriptions, and this is the correct view. So, for some people, it is a state, and for others, it is a station. Every Divine Attribute is of this nature. Thus, Divine Attributes, when attributed to creation, follow the course of beliefs (الاعتقادات). Just as He accepts every belief and every believer is truthful in it, so too do the Divine Attributes, when attributed to creation, accept the qualities of stations and the qualities of states. This is the precise definition (تحرير) of this Attribute and its likes, and this is the established matter.\n\n### [Capacity: Its Limit is the First Degree of Hardship]\n\nAllah has described Himself, and that which the servant gives of himself, Allah is content with it and content with the servant concerning it, even if he does not exert his full capacity (استطاعته). For if he were to exert his capacity such that by exerting it he fell into hardship (الحرج), he would have exerted it with strain and difficulty. Allah has removed hardship from His servants in His religion.\n\nThus, we know that the meaning intended by capacity in verses like His saying: <<فَاتَّقُوا اللهَ مَا اسْتَطَعْتُمْ>> (So fear Allah as much as you are able) and <<لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا>> (And Allah does not burden a soul beyond its capacity) and what He has given it—is that its limit is the first degree of hardship. So, when one senses it (hardship) or anticipates it before sensing it, that is the limit of the capacity commanded by the Law (شرعا).\n\nThis is to reconcile between His saying, the Exalted: <<فَاتَّقُوا اللهَ مَا اسْتَطَعْتُمْ>> (So fear Allah as much as you are able) and His saying: <<مَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ>> (He has not placed upon you in the religion any difficulty/hardship), for the religion of Allah is ease. And <<وَيُرِيدُ اللهُ بِكُمُ الْيُسْرَ>> (Allah intends for you ease) is contained within His saying, \"as much as you are able.\"\n\nBecause the Companions understood capacity in the way we mentioned, it became a concession (رخصة) for the strict command (عزمة) of His saying: <<حَقَّ تُقَاتِهِ>> (the fear due to Him). So, Allah is content with you when you give Him, from what He has obligated upon you, the limit of capacity in which there is no hardship upon you. And you are content with Him concerning what He has given you of the state of the world (حال الدنيا), and you are content with Him in that. And you have known that the states of the world are specifically obedience, as we explained in the Chapter on Vigilance (باب المراقبة).\n\n### [The Gift of the Real in This World and the Hereafter is Little Compared to What is With Him]\n\nWhatever the Real (الحق) gives you in this world and the Hereafter of goodness and blessings is little compared to what is with Him. For that which is with Him has no end, while everything that comes to you is finite by virtue of its occurrence in Existence (الوجود). And the ratio of what is finite to what is infinite is the least of the little, just as Al-Khidr said to Moses when the bird dipped its beak into the sea to drink from its water, likening it to the knowledge they possessed compared to the Knowledge of Allah.\n\nTherefore, He said, \"Allah is content with them\" concerning the little of their deeds, and \"they are content with Him\" concerning the little of the reward. This is because the attainment of that which is infinite is impossible in Existence, since it is endless. For this reason, we said that the object of Contentment (الرضى) is the little (اليسير), which is contentment with what is existent (بالموجود). So, one is content with it from Allah and concerning Allah in it.\n\nAllah did not precede His contentment with His servants by accepting the little of the deeds He obligated upon them, except so that they might be content with Him concerning the little of the reward, because they knew that what is with Him is far greater than what has reached them. This (greater reward) reaches them moment after moment, state after state, for the eternity of eternities, without interruption, even though their deeds, which were based on prescribed obligation, have ceased. The deeds ceased from them, but the worship (العبادة) did not cease.\n\n### [The Subsistence of the Recompense of Worship in the Felicitous and the Recompense of Servanthood in the Wretched]\n\nWhen the limit of good and evil deeds is reached for the people of Paradise and the people of the Fire, their recompense remains: the recompense of worship (العبادة) for the felicitous (السعداء), and the recompense of servanthood (العبودية) for the people of the Fire. This is a recompense that never ceases. This grants them the vastness and comprehensiveness of Mercy (الرحمة).\n\nFor the criminals never lose the witnessing (شهود) of their servanthood, even if they claim Lordship (ربانية). They know within themselves that they are liars based on what they find, so the claim vanishes when its time vanishes, and the attribution of servanthood remains upon them, which they held during the time of the claim and before the claim. And they reap the fruit of their saying, \"Yes (بلى).\"\n\nThus, they are in the position of one who embraces Islam after apostasy. The sovereignty of \"Yes (بلى)\" rules over all of them. So, He grants them felicity (سعادة) after the misery (الشقاء) that touched them, corresponding to the duration of their claim. The ruling of \"Yes (بلى)\" continues to accompany them from that moment onward into the infinite, through the world, the Isthmus (برزخ), and the Hereafter.\n\nIncidental factors (عوارض) occurred to some people which outwardly removed them from the ruling of their Unity (توحيدهم) due to the divinity (الألوهة) they claimed for their partners (الشركاء), which they affirmed and augmented. Thus, the partners stood for them in the place of secondary causes (الأسباب) for the believers.\n\n### [Every Incidental Factor is Transient, and its Ruling Vanishes with its Vanishing]\n\nEvery incidental factor is transient, and its ruling vanishes with its vanishing. And the ruling returns to the Origin (الأصل), and the Origin necessitates felicity. Therefore, all incline toward it, if Allah wills, along with the habitation of the two abodes, and each abode has its fullness. And Mercy accompanies it, just as servanthood accompanied everyone here, whether they remained upon it or claimed Lordship (الربوبية). For he claimed something whose opposite he knows within himself.\n\nSo, the Station of Contentment (مقام الرضى) is what I have detailed for you. Say concerning it after this whatever you wish: a state, a station, or neither a state nor a station. And know the difference therein between the two attributions: its attribution to Allah and its attribution to creation. And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## (باب ایک سو اٹھائیس: مقام رضا اور اس کے اسرار کی معرفت میں)\n\nمیں نے اپنے رب سے ہر برائی اور تکلیف سے حفاظت (عصمت) کا سوال کیا،\nاور یہ کہ میں اس کی خاطر اسے اس کی روح کی طرح الگ تھلگ دیکھوں،\nاپنی ذات سے اچک لیا گیا، فنا کر دیا گیا، اور اپنا لیا گیا،\nیہاں تک کہ میں سچائی سے کہوں: ہمارے حال میں کیا ہی خوب ہے!\nمیں اس سے اس چیز پر راضی ہوا، میں اس سے اس چیز کے لیے راضی ہوا،\nاور اسی طرح اس کی نسبت اس کی طرف حکماً اسی طرح ہے،\nاور یہ ایک قطعی دلیل ہے تھوڑے پر، پس جب\nتو اسے \"من\" (سے) اور \"عن\" (سے) سے الگ کر دے، اور اسے اس اور اس سے وصف کرے،\nاور تو اس کے حق کا جاننے والا اور ماہر (جہبذ) ہو.\n\n### [رضا کثیر میں سے قلیل کے حصول پر دلالت کرتی ہے]\n\nجان لے، اللہ تجھے توفیق دے، کہ میرا قول \"قطعی دلیل ہے تھوڑے پر\" سے میری مراد یہ ہے کہ رضا (الرضى) کثیر میں سے قلیل پر دلالت کرتی ہے، پس وہ اللہ کے ساتھ ادب کی بنا پر اس پر راضی ہوتا ہے کیونکہ اللہ نے اسے اپنا وکیل بنایا ہے۔\n\n### [رضا ایک اختلافی امر ہے: آیا یہ مقام ہے یا حال]\n\nاور رضا (الرضى) اہل اللہ کے نزدیک ایک اختلافی امر ہے کہ آیا یہ مقام ہے یا حال۔ پس جس نے اسے حال سمجھا، اس نے اسے عطیات (مواہب) میں شامل کیا، اور جس نے اسے مقام سمجھا، اس نے اسے کسب (مکاسب) میں شامل کیا۔ اور یہ ایک صفت الٰہی (نعت إلهي) ہے، اور ہر صفت الٰہی جب اللہ کی طرف منسوب کی جاتی ہے تو وہ نہ عطیہ (وہب) قبول کرتی ہے اور نہ کسب۔ پس وہ اس معنی پر نہیں ہے جو اس وقت ہوتا ہے جب ہم اسے مخلوق کی طرف منسوب کرتے ہیں، تو اس کی وہ صفت باقی نہیں رہتی۔ پس مخلوق کی طرف اس کی نسبت سے اسے یہ حاصل ہوا کہ اگر وہ ثابت رہے تو مقام ہے، اور اگر زائل ہو جائے تو حال ہے۔ اور حقیقت میں یہ دونوں اوصاف قبول کرتی ہے، اور یہی صحیح ہے۔ پس یہ بعض لوگوں کے حق میں حال ہے اور بعض کے حق میں مقام ہے۔ اور ہر صفت الٰہی اسی طرح ہے۔ پس صفات الٰہیہ جب مخلوق کی طرف منسوب کی جاتی ہیں تو اعتقادات کی طرح جاری ہوتی ہیں۔ پس جس طرح وہ ہر اعتقاد کو قبول کرتا ہے اور ہر معتقد اس میں سچا ہوتا ہے، اسی طرح صفات الٰہیہ جب مخلوق کی طرف منسوب کی جاتی ہیں تو مقامات کی صفات اور احوال کی صفات کو قبول کرتی ہیں۔ یہ اس صفت اور اس جیسی صفات کی تحقیق ہے، اور امر اسی پر ہے۔\n\n### [استطاعت کی حد حرج کی پہلی منزل ہے]\n\nاور اللہ نے اپنی ذات کو اس سے موصوف کیا ہے جو بندے نے اپنی ذات سے دیا، اللہ اس پر راضی ہوا اور اس میں اس سے راضی ہوا، اگرچہ اس نے اپنی استطاعت (استطاعتہ) صرف نہ کی ہو۔ کیونکہ اگر وہ اپنی وہ استطاعت صرف کرتا کہ جب وہ اسے صرف کرتا تو حرج میں پڑ جاتا، تو اس نے اسے مشقت اور تکلیف پر صرف کیا ہوتا۔ اور اللہ نے اپنے بندوں سے اپنے دین میں حرج کو اٹھا لیا ہے۔ پس ہم نے جانا کہ استطاعت سے مراد اس طرح کے قول میں:\n**فَاتَّقُوا الله ما اسْتَطَعْتُمْ** (پس اللہ سے ڈرو جہاں تک تم استطاعت رکھو)\nاور **لا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها** (اللہ کسی جان کو اس کی وسعت سے زیادہ تکلیف نہیں دیتا)\nاور جو کچھ اسے دیا ہے، اس کی حد حرج کی پہلی منزل ہے۔ پس جب وہ اسے محسوس کرے یا محسوس کرنے سے پہلے اس پر جھانک لے، تو وہی شرعاً مامور استطاعت کی حد ہے، تاکہ اللہ تعالیٰ کے قول **فَاتَّقُوا الله ما اسْتَطَعْتُمْ** (پس اللہ سے ڈرو جہاں تک تم استطاعت رکھو) اور اس کے قول **ما جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ** (اور اس نے تم پر دین میں کوئی تنگی نہیں رکھی) کے درمیان جمع ہو جائے، اور اللہ کا دین آسان ہے۔\n\nاور **وَيُرِيدُ الله بِكُمُ الْيُسْرَ** (اور اللہ تمہارے لیے آسانی چاہتا ہے) اس کے قول **ما اسْتَطَعْتُمْ** (جہاں تک تم استطاعت رکھو) میں ہے۔ اور جب صحابہ نے استطاعت سے وہی سمجھا جو ہم نے ذکر کیا، اسی لیے یہ ان کے قول **حَقَّ تُقاتِهِ** (جیسا کہ اس کا حق ہے) کے عزم کے لیے رخصت تھی۔ پس اللہ تجھ سے راضی ہوا جب تو نے اسے اس چیز میں سے دیا جس کا اس نے تجھے مکلف بنایا تھا، یعنی استطاعت کی وہ حد جس میں تجھ پر کوئی حرج نہیں، اور تو اس سے اس چیز پر راضی ہوا جو اس نے تجھے دنیا کے حال میں عطا کیا، اور تو اس میں اس سے راضی ہوا۔ اور تو دنیا کے احوال کو جان چکا ہے کہ وہ خاص طور پر طاعت ہے، جیسا کہ ہم نے باب مراقبہ میں بیان کیا ہے۔\n\n### [حق کا دنیا اور آخرت میں عطاء اس کے پاس موجود کے مقابلے میں قلیل ہے]\n\nاور جو کچھ بھی حق (الحق) تجھے دنیا اور آخرت میں خیر اور نعمتوں میں سے عطا کرتا ہے، وہ اس کے پاس موجود کے مقابلے میں قلیل ہے، کیونکہ جو کچھ اس کے پاس ہے اس کی کوئی انتہا نہیں ہے۔ اور جو کچھ بھی تجھے اس میں سے حاصل ہوتا ہے وہ وجود میں حاصل ہونے کی وجہ سے متناہی (محدود) ہے۔ اور متناہی کی نسبت لامتناہی کی طرف کم سے کم قلیل ہے، جیسا کہ\nخضر (علیہ السلام) نے موسیٰ (علیہ السلام) سے کہا جب پرندے نے اپنی چونچ سے سمندر میں ٹھونگ ماری تاکہ اس کا پانی پیے، تو انہوں نے اسے اس علم سے تشبیہ دی جس پر وہ تھے اور اللہ کے علم سے۔\n\nاسی لیے اس نے قلیل عمل پر ان سے راضی ہونے کا کہا، اور وہ قلیل ثواب پر اس سے راضی ہوئے، کیونکہ وجود میں لامتناہی کا حصول ممکن نہیں ہے کیونکہ وہ لامتناہی ہے۔ اسی لیے ہم نے کہا کہ رضا (الرضى) کا تعلق قلیل سے ہے، اور وہ موجود پر رضا ہے۔ پس وہ اللہ کی طرف سے اس پر راضی ہوا اور اس میں اللہ سے راضی ہوا۔ اور اللہ نے اپنے بندوں سے اپنی رضا کو ان کے اعمال کے قلیل حصے کو قبول کرنے سے پہلے نہیں رکھا جس کا اس نے انہیں مکلف بنایا تھا، مگر اس لیے کہ وہ قلیل ثواب پر اس سے راضی ہوں، جب وہ جان لیں کہ اس کے پاس اس سے کہیں زیادہ ہے جو ان تک پہنچا ہے۔ پس وہ ان تک آنات (لمحات) کے ساتھ، حال کے بعد حال، ابد الآباد تک پہنچتا رہے گا، بغیر کسی انقطاع کے، جبکہ ان کے وہ اعمال جو مشروع تکلیف کے تحت تھے، منقطع ہو چکے ہیں۔ پس اعمال ان سے منقطع ہو گئے لیکن عبادت منقطع نہیں ہوئی۔\n\n### [سعداء میں عبادت کا بدلہ اور اشقیاء میں عبودیت کا بدلہ باقی رہنا]\n\nپس جب نیک اور برے عمل کی حد اہل جنت اور اہل نار میں ختم ہو جائے گی، تو ان کا بدلہ باقی رہے گا: سعداء میں عبادت کا بدلہ اور اہل نار میں عبودیت کا بدلہ۔ اور یہ ایسا بدلہ ہے جو کبھی منقطع نہیں ہوگا۔ پس یہ چیز انہیں رحمت کی وسعت اور شمولیت عطا کرتی ہے۔ کیونکہ مجرموں سے ان کی عبودیت کا شہود (شہود) زائل نہیں ہوا، اگرچہ انہوں نے ربوبیت کا دعویٰ کیا، تو وہ اپنی جانوں سے جانتے ہیں کہ وہ جھوٹے ہیں اس چیز کی بنا پر جو وہ پاتے ہیں۔ پس دعویٰ اپنے وقت کے زائل ہونے سے زائل ہو جاتا ہے، اور ان پر عبودیت کی وہ نسبت باقی رہتی ہے جس پر وہ دعویٰ کے حال میں اور دعویٰ سے پہلے تھے۔ اور وہ اپنے قول **بَلَى** (کیوں نہیں) کا پھل کاٹتے ہیں۔ پس وہ اس شخص کے مقام پر تھے جو اپنے ارتداد کے بعد اسلام لایا۔ پس سب پر \"بَلَى\" (کیوں نہیں) کے سلطان نے حکم کیا، پس اس نے انہیں اس شقاوت کے بعد سعادت عطا کی جو انہیں دعویٰ کے زمانے کے بقدر پہنچی تھی۔ پس \"بَلَى\" کا حکم اس وقت سے لے کر لامتناہی تک، دنیا، برزخ اور آخرت میں ان کے ساتھ رہا۔ اور بعض لوگوں کے لیے کچھ عوارض پیش آئے جنہوں نے انہیں ظاہری طور پر ان کی توحید کے حکم سے نکال دیا، اس الوہیت کے دعویٰ کی بنا پر جو انہوں نے شرکاء میں ثابت کی اور اس میں اضافہ کیا، پس شرکاء ان کے لیے مومنین کے لیے اسباب کے مقام پر کھڑے ہو گئے۔\n\n### [ہر عارض زائل ہونے والا ہے اور اس کا حکم اس کے زائل ہونے سے زائل ہو جاتا ہے]\n\nاور ہر عارض زائل ہونے والا ہے، اور اس کا حکم اس کے زائل ہونے سے زائل ہو جاتا ہے، اور حکم اصل کی طرف لوٹ جاتا ہے۔ اور اصل سعادت کا تقاضا کرتی ہے۔ پس ان شاء اللہ سب کا انجام اسی کی طرف ہے، دونوں جہانوں کی آبادی کے ساتھ۔ اور ہر ایک کے لیے اس کی بھرائی ہے، اور رحمت اس کے ساتھ ہے، جیسا کہ یہاں عبودیت ہر اس شخص کے ساتھ رہی جو اس پر باقی رہا یا جس نے ربوبیت کا دعویٰ کیا، کیونکہ اس نے ایک ایسی چیز کا دعویٰ کیا جس کے خلاف وہ اپنی جان سے جانتا ہے۔ پس مقام رضا (الرضى) وہ ہے جو میں نے تیرے لیے بیان کیا، پس اس کے بعد تو اس کے بارے میں جو چاہے کہہ، حال یا مقام، یا نہ حال اور نہ مقام۔ اور اس میں دونوں نسبتوں کے درمیان فرق جان لے: اللہ کی طرف اس کی نسبت اور مخلوق کی طرف اس کی نسبت۔ اور **وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب صد و بیست و هشتم در معرفت مقام رضا (الرضى) و اسرار آن\n\nاز پروردگارم عصمت (مصونیت) خواستم *** از هر بدی و آزاری\nو اینکه به خاطر او ببینم *** همچون روحش که جدا شده است\nربوده شده از خویش *** مستهلک و پذیرفته شده\nتا صادقانه بگویم *** چه خوش است حال ما\nاز او به فلان چیز راضی شدم *** و از او برای فلان چیز خشنود گشتم\nو این‌گونه نسبت او *** به سوی او حکمی چنین است\nو آن دلیلی قاطع است *** بر اندکی، پس آنگاه که\nاو را از \"مِن\" (از) و \"عَن\" (از جانب) جدا کنی *** و او را به این و آن وصف نمایی\nو تو صاحب معرفت (المعرفة) *** به حق او و دانشمند باشی\n\n### [رضا (الرضى) دلالت بر حصول اندکی از بسیاری دارد]\n\nبدان، خداوند تو را توفیق دهد، که سخن من [که گفتم] «دلیل قاطع بر اندکی است» یعنی رضا (الرضى) دلالت بر اندکی از بسیاری دارد. پس بنده به آن اندک راضی می‌شود، از باب ادب با خداوند، زیرا خداوند او را وکیل کرده است.\n\n### [رضا (الرضى) امری است که در آن اختلاف وجود دارد: آیا مقام است یا حال]\n\nو رضا (الرضى) امری است که نزد اهل الله (أهل الله) در آن اختلاف است که آیا مقام (مقام) است یا حال (حال). پس هر کس آن را حال بداند، آن را به مواهب (بخشایش‌های الهی) ملحق می‌سازد، و هر کس آن را مقام بداند، آن را به مکاسب (دستاوردهای بنده) ملحق می‌کند. و آن صفتی الهی است. هر صفت الهی‌ای که به خداوند اضافه شود، نه بخشش را می‌پذیرد و نه کسب را. پس معنای آن غیر از آن معنایی است که اگر آن را به خلق نسبت دهیم، آن صفت برایش باقی نمی‌ماند. بنابراین، به واسطه نسبت دادن آن به خلق، اگر ثابت بماند، مقام است و اگر زائل شود، حال است. و در حقیقت، هر دو وصف را می‌پذیرد و این صحیح است. پس در حق برخی از مردم حال و در حق برخی دیگر مقام است. و هر صفت الهی‌ای چنین است. پس صفات الهی هنگامی که به خلق نسبت داده می‌شوند، مانند اعتقادات جاری می‌شوند. همان‌گونه که خداوند هر اعتقادی را می‌پذیرد و هر معتقدی را در آن تصدیق می‌کند، همچنین صفات الهی هنگامی که به خلق نسبت داده می‌شوند، صفات مقامات و صفات احوال را می‌پذیرند. این است تبیین این صفت و امثال آن، و امر بر همین منوال است.\n\n### [حد استطاعت (الاستطاعة)، اولین درجه از حرج (الحرج) است]\n\nو خداوند خود را وصف کرده است، و آن چیزی است که بنده از نفس خود به او داده است، که خداوند به آن راضی شده و در آن از او خشنود گشته است، حتی اگر استطاعت (الاستطاعة) خود را به طور کامل بذل نکرده باشد. زیرا اگر استطاعت خود را که با بذل آن در حرج (الحرج) و تنگنا می‌افتد، بذل می‌کرد، آن را با سختی و مشقت انجام داده بود. و خداوند حرج را از بندگانش در دین خود برداشته است. پس دانستیم که مراد از استطاعت در مثل این فرموده: «فَاتَّقُوا الله ما اسْتَطَعْتُمْ» (پس تا می‌توانید از خدا پروا کنید) و «وَلا يُكَلِّفُ الله نَفْساً إِلَّا وُسْعَها» (و خداوند هیچ کس را جز به اندازه توانایی‌اش تکلیف نمی‌کند) و آنچه به او داده است، این است که حد آن اولین درجه از حرج است. پس هرگاه آن را احساس کند یا پیش از احساس آن، بر آن مشرف شود، آن حد استطاعتی است که شرعاً به آن امر شده است تا میان این فرموده خداوند متعال: «فَاتَّقُوا الله ما اسْتَطَعْتُمْ» (پس تا می‌توانید از خدا پروا کنید) و این فرموده: «ما جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ» (و در دین برای شما هیچ حرجی قرار نداده است) جمع شود، و دین خدا آسان است.\n\nو «وَيُرِيدُ الله بِكُمُ الْيُسْرَ» (و خداوند برای شما آسانی می‌خواهد) در فرموده او «ما اسْتَطَعْتُمْ» (آنچه توانستید) [مستتر است]. و چون صحابه از استطاعت همان را فهمیدند که ما ذکر کردیم، از این رو، این [آیه] رخصتی برای عزیمتِ فرموده او «حَقَّ تُقاتِهِ» (حق تقوای او) بود. پس خداوند از تو راضی می‌شود اگر از آنچه تو را مکلف کرده است، حد استطاعتی را که در آن حرجی بر تو نیست، به او بدهی؛ و تو نیز از او به آنچه از حال دنیا به تو داده است، راضی شوی و در آن از او خشنود گردی. و تو احوال دنیا را شناخته‌ای که به طور خاص همان طاعت است، چنانکه در باب مراقبه (المراقبة) بیان کردیم.\n\n### [عطای حق (الحق) در دنیا و آخرت نسبت به آنچه نزد اوست، اندک است]\n\nو هر آنچه حق (الحق) در دنیا و آخرت از خیر و نعمت به تو عطا کند، نسبت به آنچه نزد اوست، اندک است؛ زیرا آنچه نزد اوست، بی‌نهایت است. و هر آنچه از آن برای تو حاصل شود، به واسطه حصولش در هستی (الوجود) متناهی است. و نسبت آنچه متناهی است به آنچه نامتناهی است، کمتر از اندک است، چنانکه خضر به موسی گفت، هنگامی که پرنده‌ای با منقار خود در دریا زد تا از آب آن بنوشد، و آن را به آنچه آنان از علم داشتند و به علم خداوند تشبیه کرد.\n\nاز این رو [خداوند] در مورد عمل اندک از آنان راضی شد و آنان نیز در مورد ثواب اندک از او راضی شدند، زیرا تحصیل آنچه نامتناهی است در هستی (الوجود) ممکن نیست، چون نامتناهی است. به همین دلیل گفتیم که متعلق رضا (الرضى)، اندک است، و آن رضایت به موجود است. پس بنده به آن از جانب خداوند و در آن از خداوند راضی شد. و خداوند رضایت خود را از بندگانش به واسطه پذیرش اعمال اندکشان که آنان را مکلف کرده بود، مقدم نداشت، مگر برای اینکه آنان نیز در مورد ثواب اندک از او راضی شوند، زیرا می‌دانستند که نزد او چیزی بیش از آنچه به ایشان رسیده است، وجود دارد. و این [ثواب] با لحظات، حالی پس از حال، تا ابدالآباد بدون انقطاع به آنان می‌رسد، در حالی که اعمالشان که ناشی از تکلیف مشروع بود، منقطع شده است، پس اعمال از آنان منقطع شد، اما عبادت (العبادة) منقطع نگردید.\n\n### [بقا و استمرار جزای عبادت (العبادة) در سعادتمندان و جزای عبودیت (العبودية) در شقاوتمندان]\n\nپس هنگامی که حد عمل نیک و زشت در اهل بهشت و اهل دوزخ به پایان رسد، جزای آنان باقی می‌ماند؛ جزای عبادت (العبادة) در سعادتمندان و جزای عبودیت (العبودية) در اهل دوزخ، و آن جزایی است که هرگز منقطع نمی‌شود. این [امر] وسعت و شمول رحمت را به آنان بخشیده است، زیرا مجرمان شهود عبودیت (العبودية) خود را از دست نداده‌اند، حتی اگر ادعای ربوبیت کنند، زیرا از درون خود می‌دانند که به واسطه آنچه می‌یابند، دروغگو هستند. پس ادعا با زوال زمانش از بین می‌رود و نسبت عبودیتی که در حال ادعا و پیش از ادعا بر آن بودند، بر آنان باقی می‌ماند و ثمره سخن خود «بَلى» (آری) را می‌چینند. پس آنان به منزله کسی بودند که پس از ارتداد، اسلام آورد. پس سلطان «بَلی» (آری) بر همگان حکم راند و به دنبال آن، سعادتی را برایشان آورد، پس از آنکه به اندازه زمانی که بر ادعا بودند، شقاوت به آنان رسیده بود. پس حکم «بَلی» از همان زمان تا بی‌نهایت، در دنیا، برزخ و آخرت، همراه آنان باقی می‌ماند. و عوارضی برای برخی از مردم پیش آمد که آنان را در ظاهر از حکم توحیدشان خارج ساخت، به واسطه آنچه از الوهیت در شرکا ادعا کردند و آن را اثبات نمودند و افزودند. پس شرکا برای آنان در جایگاه اسباب برای مؤمنان قرار گرفتند.\n\n### [هر عارضی زائل است و حکم آن با زوالش از بین می‌رود]\n\nو هر عارضی زائل است و حکم آن با زوالش از بین می‌رود و حکم به اصل باز می‌گردد، و اصل مقتضی سعادت است. پس همگان، ان‌شاءالله، به سوی آن متمایل می‌شوند، همراه با آبادانی هر دو سرا، و هر یک از آن دو پر است و رحمت همراه آن است، همان‌گونه که عبودیت (العبودية) در اینجا همراه هر کسی بود که بر آن باقی ماند یا ادعای ربوبیت کرد، زیرا او امری را ادعا کرد که خود می‌داند خلاف آن است. پس مقام رضا (الرضى) همان است که برای تو تبیین کردم. پس بعد از این، هر چه می‌خواهی در مورد آن بگو: حال (حال) یا مقام (مقام) یا نه حال و نه مقام. و تفاوت میان دو نسبت را در آن بدان: نسبت آن به خداوند و نسبت آن به خلق. «وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}