{
  "id": 262,
  "title": {
    "ar": "الباب الثاني والستون ومائتان في معرفة الشريعة",
    "en": "Chapter 262: Concerning the Gnosis (معرفة) of the Divine Law (الشريعة)",
    "ur": "باب دو سو باسٹھ: شریعت کی معرفت میں",
    "fa": "باب دویست و شصت و دوم در معرفت شریعت"
  },
  "content": {
    "ar": "## «الباب الثاني والستون ومائتان في معرفة الشريعة»\n\n\nالشريعة التزام العبودية بنسبة الفعل إليك‏\n\n\n> إن الشريعة حد ما له عوج *** عليه أهل مقامات العلى درجوا\n> علوا معارج من عقل ومن همم *** لحضرة دخلوا فيها وما خرجوا\n\n\n> جاءوا بأمر عظيم القدر منه وما *** عليهم في الذي جاءوا به حرج‏\n\n\n### [الشريعة التزام العبودية بنسبة الفعل إليك‏]\n\n\nالشريعة السنة الظاهرة التي جاءت بها الرسل عن أمر الله والسنن التي ابتدعت على طريق القربة إلى الله كقوله تعالى ورَهْبانِيَّةً ابْتَدَعُوها وقول الرسول صلى الله عليه وسلم من سن سنة حسنة\n\n\nفأجاز لنا ابتداع ما هو حسن وجعل فيه الأجر لمن ابتدعه ولمن عمل به وأخبر أن العابد لله بما يعطيه نظره إذا لم يكن على شرع من الله معين أنه يحشر أمة وحده بغير إمام يتبعه فجعله خيرا وألحقه بالأخيار كما قال في إبراهيم إِنَّ إِبْراهِيمَ كانَ أُمَّةً قانِتاً لِلَّهِ وذلك قبل إن يوحى إليه وقال عليه السلام بعثت لأتمم مكارم الأخلاق‏\n\n\nفمن كان على مكارم الأخلاق فهو على شرع من ربه وإن لم يعلم ذلك وسماه النبي صلى الله عليه وسلم خيرا في حديث حكيم بن حزام وإنه كان يتبرر في الجاهلية بأمور من عتق وصدقة وصلة رحم وكرم وأمثال ذلك فقال له رسول الله صلى الله عليه وسلم لما سأله عن ذلك أسلمت على ما أسلفت من خير\n\n\nفسماه خيرا وجازاه الله به فالشريعة إن لم تفهم هكذا وإلا فما فهمت الشريعة وأما تتمة مكارم الأخلاق فهي تعريتها مما نسب إليها من السفسفة فإن سفساف الأخلاق أمر عرضي ومكارم الأخلاق أمر ذاتي لأن السفساف ليس له مستند إلهي فهو نسبة عرضية مبناها الأغراض النفسية ومكارم الأخلاق لها مستند إلهي وهو الأخلاق الإلهية فتتمة النبي صلى الله عليه وسلم مكارم الأخلاق ظهر في تبيينه مصارفها فعين لها مصارف تكون بها مكارم أخلاق وتعرى بذلك عن ملابس سفساف الأخلاق فما في الكون إلا شريعة\n\n\n### [الشريعة أتت بلسان ما تواطأت عليه الأمة]\n\n\nثم اعلم أن الشريعة أتت بلسان ما تواطأت عليه الأمة التي شرع الله لها ما شرع فمنه ما كان عن طلب من الأمة ومنه ما شرعه ابتداء من الأحكام ولهذا\n\n\nكان يقول صلى الله عليه وسلم اتركوني ما تركتكم‏\n\n\nفإن كثيرا من الشريعة نزل بسؤال من الأمة لو لم يسألوه ما نزل وأسباب الأحكام دنيا وآخرة معلومة عند العلماء بأسباب النزول والحكم يقال شرعت الرمح قبله أي قصدته به مستقبلا والشريعة من جملة الحقائق فهي حقيقة لكن تسمى شريعة وهي حق كلها والحاكم بها حاكم بحق مثاب عند الله لأنه حكم بما كلف إن يحكم به وإن كان المحكوم له على باطل والمحكوم عليه على حق فهل هو عند الله كما هو في الحكم أو كما هو في نفس الأمر فمنا من يرى أنه عند الله كما هو في الحكم ومنا من يرى أنه عند الله كما هو في نفس الأمر وفي هذه المسألة نظر يحتاج إلى سبر أدلة فإن العقوبة قد أوقعها الله في رمى المحصنات وإن صدقوا إذ لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَداءَ وقال في قضية خاصة في ذلك كان الرامي كاذبا فيها فقال لَوْ لا جاؤُ عَلَيْهِ بِأَرْبَعَةِ شُهَداءَ كما قرر في الحكم فَإِذْ لَمْ يَأْتُوا بِالشُّهَداءِ فَأُولئِكَ عِنْدَ الله هُمُ الْكاذِبُونَ فقوله أولئك هل يريد بهذه الإشارة هذه القضية الخاصة أو يريد عموم الحكم في ذلك فجلد الرامي إنما كان لرميه ولكونه ما جاء بأربعة شهداء وقد يكون الشهداء شهداء زور في نفس الأمر وتحصل العقوبة بشهادتهم في المرمي فيقتل وله الأجر التام في الأخرى مع ثبوت الحكم عليه في الدنيا وعلى شهود الزور والمفتري العقوبة في الأخرى وإن حكم الحق في الدنيا بقوله وشهادة شهود الزور فيه ولهذا\n\n\nقال رسول الله صلى الله عليه وسلم إنما أنا بشر وإنكم لتختصمون إلي ولعل أحدكم يكون ألحن بحجته من الآخر فمن قضيت له بحق أخيه فلا يأخذه فإنما أقطع له قطعة من النار\n\n\nفقد قضى له بما هو حق لأخيه وجعله له حقا مع كونه معاقبا عليه في الآخرة كما يعاقب على الغيبة والنميمة مع كونهما حقا فما كان حق في الشرع تقترون به السعادة ولما كان الشريعة عبارة عن الحكم في المشروع له والتحكم فيه بها كان المشروع له عبدا فالتزم عبوديته لكون الحكم لا يتركه يرفع رأسه بنفسه فما له من حركة ولا سكون إلا وللشرع في ذلك حكم عليه بما يراه فلذلك جعلت الطائفة الشريعة التزام العبودية فإن العبد محكوم عليه أبدا وأما قولهم بنسبة الفعل إليك فإنك إن لم تفعل ما يريده السيد منك وإلا فما وجب عليك الأخذ به ولذلك رفع القلم عمن لا عقل له ويكفي هذا القدر في علم الشريعة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Sixty-Two: Concerning the Knowledge of the Sacred Law\n\nThe Sacred Law [الشريعة] is the commitment to servitude [العبودية] by attributing the act to you.\n\n> Indeed, the Sacred Law is a boundary without deviation,\n> Upon which the people of the highest stations ascend.\n> They ascend the steps of intellect and spiritual resolve,\n> Into a Presence [حضرة] they enter and never leave.\n> They came with a matter of great worth from Him,\n> And there is no constraint upon them in what they brought.\n\n### [The Sacred Law is the commitment to servitude by attributing the act to you]\n\nThe Sacred Law [الشريعة] is the manifest Prophetic Way (Sunna) brought by the Messengers by the command of Allah, and also the ways (sunan) that were innovated [ابتداع] as a path of proximity (qurba) to Allah, such as His saying, <<وَرَهْبَانِيَّةً ابْتَدَعُوهَا>> (And monasticism, which they innovated), and the saying of the Messenger, peace and blessings be upon him, \"Whoever establishes a good way (sunna hasana)...\"\n\nThus, He permitted us to innovate what is good and placed reward (ajr) in it for the one who innovates it and for the one who acts upon it. He also informed us that the one who worships Allah according to what his own insight grants him, provided it is not based on a specific Divine Law [شرع من الله معين], will be resurrected as a nation (umma) unto himself, without an Imam to follow. He made this good and joined him with the righteous, just as He said concerning Abraham: <<إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً قَانِتًا لِلَّهِ>> (Indeed, Abraham was a nation [umma], obedient to Allah), and that was before revelation came to him.\n\nAnd he, peace be upon him, said, \"I was sent to perfect the noble qualities of character (makarim al-akhlaq).\"\n\nTherefore, whoever possesses the noble qualities of character is upon a Sacred Law from his Lord, even if he does not know it. The Prophet, peace and blessings be upon him, called this \"good\" in the hadith of Hakim ibn Hizam, who used to perform acts of piety (tabarrur) during the Age of Ignorance (Jahiliyya), such as freeing slaves, giving charity, maintaining kinship ties, generosity, and similar deeds. When Hakim asked the Messenger of Allah, peace and blessings be upon him, about this, he replied, \"You have embraced Islam upon the good you previously performed.\"\n\nSo, he called it good, and Allah rewarded him for it. If the Sacred Law [الشريعة] is not understood in this manner, then the Sacred Law has not been understood.\n\nAs for the perfection of the noble qualities of character, it is the stripping away of the trivialities (safsafah) attributed to them. For the trivialities of character (safsaf al-akhlaq) are an accidental matter (amr ‘aradi), while the noble qualities of character (makarim al-akhlaq) are an essential matter (amr dhati). This is because triviality has no Divine basis (mustanad ilahi); it is an accidental attribution founded upon egoistic purposes (al-aghrad al-nafsiyya). The noble qualities of character, however, have a Divine basis, which is the Divine Qualities (al-akhlaq al-ilahiyya).\n\nThe Prophet’s perfection of the noble qualities of character appeared in his clarification of their proper channels (masarif). He designated channels for them by which they become noble qualities of character, thereby stripping them of the garments of trivialities. Thus, there is nothing in the cosmos [الكون] except the Sacred Law.\n\n### [The Sacred Law came in the language upon which the community agreed]\n\nKnow then that the Sacred Law [الشريعة] came in the language upon which the community (umma) agreed—the community for whom Allah legislated what He legislated. Part of it came in response to a request from the community, and part of it He legislated initially as rulings (ahkam). This is why he, peace and blessings be upon him, used to say, \"Leave me alone as long as I leave you alone.\"\n\nIndeed, much of the Sacred Law was revealed due to a question from the community; had they not asked, it would not have been revealed. The worldly and otherworldly reasons (asbab) for the rulings are known to the scholars of the reasons for revelation (asbab al-nuzul) and the ruling itself.\n\nIt is said, \"I directed (shara‘tu) the spear toward him,\" meaning I aimed it at him, facing him. The Sacred Law [الشريعة] is among the Realities (al-haqa’iq); it is a Reality [حقيقة], but it is called *Shari'a*. It is entirely Truth (Haqq). The judge who rules by it is ruling by the Truth and is rewarded by Allah because he ruled according to what he was obligated to rule, even if the one judged in favor of is upon falsehood (batil) and the one judged against is upon truth (haqq).\n\nIs the matter, then, with Allah as it is in the ruling, or as it is in the reality of the matter (fi nafs al-amr)? Some of us hold that it is with Allah as it is in the ruling, and some of us hold that it is with Allah as it is in the reality of the matter. This issue requires consideration and a thorough examination of the evidence.\n\nFor Allah has imposed punishment for slandering chaste women, even if the accusers spoke the truth, since <<لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَدَاءَ>> (they did not bring four witnesses). And concerning a specific case where the accuser was indeed lying, He said, <<لَوْلَا جَاءُوا عَلَيْهِ بِأَرْبَعَةِ شُهَدَاءَ>> (Why did they not bring four witnesses against him?), as established in the ruling: <<فَإِذْ لَمْ يَأْتُوا بِالشُّهَدَاءِ فَأُولَئِكَ عِنْدَ اللَّهِ هُمُ الْكَاذِبُونَ>> (And since they did not bring the witnesses, then it is those who are the liars in the sight of Allah).\n\nDoes His saying \"those\" refer specifically to this particular case, or does it refer to the generality of the ruling in this matter? The flogging of the accuser was only due to his accusation and his failure to bring four witnesses. Yet, the witnesses might, in the reality of the matter, be false witnesses (shuhud zur), and punishment may be inflicted upon the accused based on their testimony—he may be killed. He will have the full reward (ajr) in the Hereafter, despite the ruling being established against him in this world. The false witnesses and the slanderer, however, face punishment in the Hereafter, even if the Truth (Haqq) was ruled in this world based on their statement and the testimony of the false witnesses.\n\nFor this reason, the Messenger of Allah, peace and blessings be upon him, said, \"I am only a human being, and you bring your disputes to me. Perhaps one of you is more eloquent in presenting his argument than the other. So, if I rule in his favor concerning the right of his brother, he should not take it, for I am only cutting off for him a piece of the Fire.\"\n\nThus, he ruled in his favor concerning what was rightfully his brother's, making it his right [in the worldly sense], despite the fact that he will be punished for it in the Hereafter, just as one is punished for backbiting (ghiba) and slander (namima), even though the content of both might be true.\n\nTherefore, whatever is Truth (Haqq) in the Sacred Law [الشرع] is what you acquire happiness through. Since the Sacred Law [الشريعة] is the expression of the ruling concerning the one for whom it is legislated, and the control exercised over him by it, the one for whom it is legislated is a servant (‘abd). He commits himself to his servitude (‘ubudiyya) because the ruling does not allow him to raise his head by himself. He has no movement or stillness except that the Sacred Law has a ruling concerning it, judging him according to what it sees fit.\n\nFor this reason, the Sufi group (al-Ta'ifa) defined the Sacred Law as the commitment to servitude, for the servant is always subject to ruling. As for their saying, \"by attributing the act to you,\" this is because if you do not perform what the Master desires of you, then it would not be obligatory for you to adhere to it. For this reason, the Pen is lifted from the one who has no intellect (‘aql). This much suffices for the knowledge of the Sacred Law. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو باسٹھ: شریعت کی معرفت میں\n\nشریعت، فعل کو تمہاری طرف منسوب کرتے ہوئے بندگی (العبودية) کو لازم پکڑنا ہے۔\n\n> بے شک شریعت وہ حد ہے جس میں کوئی کجی نہیں\n> اس پر بلند مقامات کے اہل چلے ہیں\n> وہ عقل اور ہمتوں کی سیڑھیوں پر چڑھ کر\n> ایک ایسی بارگاہ میں داخل ہوئے جہاں سے وہ کبھی باہر نہیں نکلے\n> وہ ایک عظیم قدر والا امر لے کر آئے، اور جو کچھ وہ لائے اس میں ان پر کوئی تنگی نہیں ہے۔\n\n### [شریعت، فعل کو تمہاری طرف منسوب کرتے ہوئے بندگی (العبودية) کو لازم پکڑنا ہے]\n\nشریعت وہ ظاہری سنت ہے جسے رسول اللہ کے حکم سے لائے، اور وہ سنتیں جو اللہ سے قربت کے راستے پر ایجاد کی گئیں، جیسا کہ اللہ تعالیٰ کا فرمان ہے:\n> وَرَهْبانِيَّةً ابْتَدَعُوها\n> \"اور رہبانیت جو انہوں نے خود ایجاد کر لی\" (الحدید: 27)\nاور رسول صلی اللہ علیہ وسلم کا فرمان ہے:\n> من سن سنة حسنة\n> \"جس نے کوئی اچھا طریقہ (سنت) جاری کیا\"\n\nپس آپ نے ہمیں ہر اس چیز کو ایجاد کرنے کی اجازت دی جو اچھی ہو اور اس میں اس شخص کے لیے اجر رکھا جس نے اسے ایجاد کیا اور اس کے لیے بھی جس نے اس پر عمل کیا۔ اور آپ نے خبر دی کہ جو شخص اللہ کی عبادت اپنے فکری مشاہدے کے مطابق کرتا ہے، اگرچہ وہ اللہ کی طرف سے کسی متعین شریعت پر نہ ہو، تو وہ اکیلا ایک امت کی صورت میں اٹھایا جائے گا، جس کا کوئی امام نہیں ہوگا جس کی وہ پیروی کرے۔ پس آپ نے اسے خیر قرار دیا اور اسے نیک لوگوں کے ساتھ شامل کیا، جیسا کہ آپ نے ابراہیم علیہ السلام کے بارے میں فرمایا:\n> إِنَّ إِبْراهِيمَ كانَ أُمَّةً قانِتاً لِلَّهِ\n> \"بے شک ابراہیم ایک امت تھے، اللہ کے فرمانبردار\" (النحل: 120)\nاور یہ اس سے پہلے تھا کہ ان پر وحی نازل ہو۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا:\n> بعثت لأتمم مكارم الأخلاق‏\n> \"میں مکارم اخلاق کی تکمیل کے لیے بھیجا گیا ہوں۔\"\n\nپس جو شخص مکارم اخلاق پر ہے، وہ اپنے رب کی شریعت پر ہے، اگرچہ وہ یہ نہ جانتا ہو۔ اور نبی صلی اللہ علیہ وسلم نے اسے خیر (بھلائی) کا نام دیا، جیسا کہ حکیم بن حزام کی حدیث میں ہے، کہ وہ زمانہ جاہلیت میں آزادی، صدقہ، صلہ رحمی، سخاوت اور اسی طرح کے امور کے ذریعے نیکی کے کام کرتے تھے۔ جب انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس بارے میں پوچھا، تو آپ نے فرمایا:\n> أسلمت على ما أسلفت من خير\n> \"تم نے اس خیر پر اسلام قبول کیا جو تم پہلے کر چکے تھے۔\"\nپس آپ نے اسے خیر کا نام دیا اور اللہ نے اسے اس کا بدلہ دیا۔ اگر شریعت کو اس طرح نہ سمجھا جائے تو پھر شریعت کو سمجھا ہی نہیں گیا۔ جہاں تک مکارم اخلاق کی تکمیل کا تعلق ہے، تو وہ انہیں ان چیزوں سے پاک کرنا ہے جو ان کی طرف سفسفہ (بے ہودہ باتوں) کے طور پر منسوب کی جاتی ہیں۔ کیونکہ سفساف اخلاق ایک عرضی (عارضی) امر ہے اور مکارم اخلاق ایک ذاتی امر ہے۔ اس لیے کہ سفساف کا کوئی الٰہی ماخذ نہیں ہے، بلکہ یہ ایک عرضی نسبت ہے جس کی بنیاد نفسانی اغراض پر ہے۔ جبکہ مکارم اخلاق کا ایک الٰہی ماخذ ہے، اور وہ اخلاقِ الٰہیہ ہیں۔ پس نبی صلی اللہ علیہ وسلم کا مکارم اخلاق کو مکمل کرنا ان کے مصارف کو واضح کرنے میں ظاہر ہوا، چنانچہ آپ نے ان کے لیے ایسے مصارف متعین کیے جن کے ذریعے وہ مکارم اخلاق بنتے ہیں اور اس طرح وہ سفساف اخلاق کے لباس سے پاک ہو جاتے ہیں۔ پس کائنات میں شریعت کے سوا کچھ نہیں ہے۔\n\n### [شریعت اس زبان میں آئی جس پر امت متفق تھی]\n\nپھر جان لو کہ شریعت اس زبان میں آئی جس پر وہ امت متفق تھی جس کے لیے اللہ نے جو کچھ مشروع کیا، مشروع کیا۔ پس اس میں سے کچھ امت کی طلب پر تھا اور کچھ احکام اللہ نے خود ابتداءً مشروع کیے۔ اسی لیے\nرسول صلی اللہ علیہ وسلم فرمایا کرتے تھے:\n> اتركوني ما تركتكم‏\n> \"مجھے چھوڑ دو جب تک میں تمہیں چھوڑے رکھوں۔\"\nکیونکہ شریعت کا ایک بڑا حصہ امت کے سوال پر نازل ہوا، اگر وہ سوال نہ کرتے تو وہ نازل نہ ہوتا۔ احکام کے اسباب، خواہ دنیاوی ہوں یا اخروی، علماء کے نزدیک اسباب نزول کے ذریعے معلوم ہیں۔ اور حکم (حکم) کے بارے میں کہا جاتا ہے: \"میں نے نیزے کو اس کے سامنے شرع کیا\" یعنی میں نے اس کا رخ اس کی طرف کر کے اس کا قصد کیا۔ اور شریعت حقائق کے مجموعے میں سے ہے، پس وہ ایک حقیقت ہے لیکن اسے شریعت کہا جاتا ہے، اور وہ پوری کی پوری حق ہے۔ اور اس کے ذریعے فیصلہ کرنے والا ذات حق (الحق) کے ذریعے فیصلہ کرنے والا ہے، جو اللہ کے ہاں اجر پانے والا ہے، کیونکہ اس نے اس چیز کے مطابق فیصلہ کیا جس کا اسے حکم دیا گیا تھا کہ وہ اس کے مطابق فیصلہ کرے۔\n\nاگرچہ جس کے حق میں فیصلہ کیا گیا وہ باطل پر ہو اور جس کے خلاف فیصلہ کیا گیا وہ حق پر ہو۔ تو کیا وہ اللہ کے نزدیک ویسا ہی ہے جیسا کہ فیصلے میں ہے یا جیسا کہ نفس الامر (حقیقت حال) میں ہے؟ ہم میں سے کچھ یہ رائے رکھتے ہیں کہ وہ اللہ کے نزدیک ویسا ہی ہے جیسا کہ فیصلے میں ہے، اور ہم میں سے کچھ یہ رائے رکھتے ہیں کہ وہ اللہ کے نزدیک ویسا ہی ہے جیسا کہ نفس الامر میں ہے۔ اس مسئلے میں غور و فکر کی ضرورت ہے جس کے لیے دلائل کی جانچ پڑتال ضروری ہے۔ کیونکہ اللہ نے پاک دامن عورتوں پر تہمت لگانے والوں کے لیے سزا مقرر کی ہے، اگرچہ وہ سچے ہوں، جب\n> إِذْ لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَداءَ\n> \"جب وہ چار گواہ نہ لائے\" (النور: 4)\nاور ایک خاص واقعے میں، جس میں تہمت لگانے والا جھوٹا تھا، اللہ نے فرمایا:\n> لَوْ لا جاؤُ عَلَيْهِ بِأَرْبَعَةِ شُهَداءَ\n> \"انہوں نے اس پر چار گواہ کیوں نہ پیش کیے؟\" (النور: 13)\nجیسا کہ حکم میں طے کیا گیا،\n> فَإِذْ لَمْ يَأْتُوا بِالشُّهَداءِ فَأُولئِكَ عِنْدَ الله هُمُ الْكاذِبُونَ\n> \"پس جب وہ گواہ نہیں لائے، تو وہی لوگ اللہ کے نزدیک جھوٹے ہیں\" (النور: 13)\nتو کیا اس قول \"أولئك\" (وہی لوگ) سے مراد یہ خاص واقعہ ہے یا اس سے مراد اس حکم کا عموم ہے؟ تہمت لگانے والے کو کوڑے مارنا صرف اس کی تہمت لگانے کی وجہ سے تھا اور اس وجہ سے کہ وہ چار گواہ نہیں لایا۔ اور ہو سکتا ہے کہ گواہ نفس الامر میں جھوٹے گواہ ہوں اور ان کی گواہی کی وجہ سے جس پر تہمت لگائی گئی ہے اسے سزا ہو، اور وہ قتل کر دیا جائے، جبکہ آخرت میں اس کے لیے پورا اجر ہو، باوجود اس کے کہ دنیا میں اس پر حکم ثابت ہو چکا ہو۔ اور جھوٹے گواہوں اور بہتان لگانے والے کے لیے آخرت میں سزا ہے، اگرچہ دنیا میں حق کا فیصلہ ان کے قول اور جھوٹے گواہوں کی گواہی کی بنا پر ہو جائے۔ اسی لیے\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n> إنما أنا بشر وإنكم لتختصمون إلي ولعل أحدكم يكون ألحن بحجته من الآخر فمن قضيت له بحق أخيه فلا يأخذه فإنما أقطع له قطعة من النار\n> \"میں تو صرف ایک بشر ہوں، اور تم میرے پاس جھگڑے لے کر آتے ہو، اور ہو سکتا ہے کہ تم میں سے کوئی اپنی دلیل میں دوسرے سے زیادہ فصیح ہو۔ پس جس کے حق میں میں اس کے بھائی کا حق فیصلہ کر دوں، تو وہ اسے نہ لے، کیونکہ میں اسے آگ کا ایک ٹکڑا کاٹ کر دے رہا ہوں۔\"\n\nپس آپ نے اس کے حق میں فیصلہ کیا جو اس کے بھائی کا حق تھا، اور اسے اس کے لیے حق قرار دیا، باوجود اس کے کہ وہ آخرت میں اس پر سزا پائے گا، جیسا کہ وہ غیبت اور چغلی پر سزا پاتا ہے، حالانکہ وہ دونوں حق ہیں۔ پس جو کچھ شریعت میں حق ہے، تم اس کے ذریعے سعادت حاصل کرتے ہو۔ اور چونکہ شریعت سے مراد وہ حکم ہے جو اس شخص پر نافذ ہوتا ہے جس کے لیے وہ مشروع کی گئی ہے، اور اس کے ذریعے اس پر حکمرانی کی جاتی ہے، اس لیے وہ شخص جس کے لیے شریعت مشروع کی گئی ہے، وہ ایک بندہ ہے۔ پس اس نے اپنی بندگی (العبودية) کو لازم پکڑا، کیونکہ حکم اسے اجازت نہیں دیتا کہ وہ خود سے اپنا سر اٹھائے۔ پس اس کی کوئی حرکت یا سکون ایسا نہیں ہے مگر یہ کہ شریعت کا اس پر کوئی حکم ہے جو وہ دیکھتی ہے۔ اسی لیے اس گروہ (صوفیاء) نے شریعت کو بندگی (العبودية) کو لازم پکڑنا قرار دیا، کیونکہ بندے پر ہمیشہ حکم نافذ ہوتا ہے۔ اور جہاں تک ان کے قول \"فعل کو تمہاری طرف منسوب کرتے ہوئے\" کا تعلق ہے، تو اگر تم وہ کام نہ کرو جو آقا تم سے چاہتا ہے، تو تم پر اسے اختیار کرنا واجب نہیں ہوتا۔ اسی لیے بے عقل شخص سے قلم اٹھا لیا گیا ہے۔ شریعت کے علم میں یہ مقدار کافی ہے، اور\n> وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n> \"اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (الاحزاب: 4)",
    "fa": "باب دویست و شصت و دوم در معرفت شریعت (Sharī‘ah)\n\nشریعت عبارت است از التزام به بندگی (العبودية) با نسبت دادن فعل به تو.\n\n> شریعت مرزی است که کژی ندارد\n> بر آن، اهل مقامات والا گام نهادند\n> با نردبان‌هایی از عقل و همت بالا رفتند\n> به محضری درآمدند که از آن بیرون نشدند\n> با امری بس عظیم‌القدر از آن آمدند\n> و در آنچه آوردند، بر آنان حرج و تنگی نیست.\n\n### [شریعت التزام به بندگی با نسبت دادن فعل به تو]\n\nشریعت، سنت آشکاری است که پیامبران به فرمان خداوند آورده‌اند، و نیز سنت‌هایی که به قصد تقرب به خداوند بدعت نهاده شده‌اند، مانند این سخن خداوند متعال: «وَرَهْبَانِيَّةً ابْتَدَعُوهَا» (و رهبانیتی که خود بدعت نهادند) و سخن رسول خدا (صلی الله علیه و سلم): «هر کس سنت نیکویی را بنا نهد...»\n\nپس، بدعت نهادن آنچه نیکوست را برای ما مجاز شمرد و در آن برای کسی که آن را بنا نهاده و کسی که بدان عمل کند، پاداش قرار داد. و خبر داد که عابد برای خدا، بر اساس آنچه نظرش به او می‌دهد، اگر بر شرع معینی از جانب خدا نباشد، به تنهایی و بدون امامی که از او پیروی کند، به عنوان یک امت محشور می‌شود. پس او را نیکوکار قرار داد و به نیکان ملحق ساخت، چنانکه درباره ابراهیم فرمود: «إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً قَانِتًا لِلَّهِ» (همانا ابراهیم امتی فرمانبردار برای خدا بود) و این پیش از آن بود که به او وحی شود. و پیامبر (علیه السلام) فرمود: «من مبعوث شدم تا مکارم اخلاق را کامل کنم.»\n\nپس هر کس بر مکارم اخلاق باشد، بر شریعتی از پروردگار خویش است، هرچند خود نداند. و پیامبر (صلی الله علیه و سلم) در حدیث حكیم بن حزام آن را خیر نامید؛ زیرا او در جاهلیت به اموری چون آزاد کردن بنده، صدقه، صله رحم، کرم و امثال آن نیکوکاری می‌کرد. هنگامی که حكیم از رسول خدا (صلی الله علیه و سلم) در این باره پرسید، ایشان فرمودند: «بر آنچه از خیر پیش فرستاده بودی، اسلام آوردی.»\n\nپس آن را خیر نامید و خداوند او را به سبب آن پاداش داد. اگر شریعت (Sharī‘ah) این‌گونه فهم نشود، پس شریعت فهمیده نشده است. و اما تکمیل مکارم اخلاق، عبارت است از پیراستن آن از آنچه از سفسفه (سفسفة) به آن نسبت داده شده است؛ زیرا سفساف اخلاق (اخلاق پست) امری عرضی است و مکارم اخلاق امری ذاتی. چون سفساف مستند الهی ندارد، بلکه نسبتی عرضی است که بر اغراض نفسانی بنا شده است. در حالی که مکارم اخلاق مستند الهی دارد که همان اخلاق الهی است. پس تکمیل مکارم اخلاق توسط پیامبر (صلی الله علیه و سلم) در تبیین مصارف آن آشکار شد؛ بدین ترتیب که مصارفی را برای آن تعیین کرد که به واسطه آن‌ها مکارم اخلاق محقق می‌شود و از پوشش‌های سفساف اخلاق عاری می‌گردد. پس در هستی (الوجود) جز شریعت نیست.\n\n### [شریعت به زبانی آمد که امت بر آن توافق داشتند]\n\nسپس بدان که شریعت به زبانی آمد که امتی که خداوند برایشان تشریع کرد، بر آن توافق داشتند. بخشی از آن به درخواست امت بود و بخشی دیگر از احکام را خداوند ابتدائاً تشریع فرمود. به همین دلیل بود که پیامبر (صلی الله علیه و سلم) می‌فرمود: «مرا واگذارید تا زمانی که من شما را واگذاشته‌ام.»\n\nزیرا بسیاری از شریعت به سبب سؤال امت نازل شد که اگر سؤال نمی‌کردند، نازل نمی‌شد. اسباب احکام دنیوی و اخروی نزد علمای اسباب نزول معلوم است. در مورد حکم گفته می‌شود: «شرعت الرمح قبله» یعنی با آن نیزه، او را روبرو قصد کردم. و شریعت از جمله حقایق است؛ پس آن یک حقیقت است، اما شریعت نامیده می‌شود و تماماً حق است. و حاکم به آن، حاکم به حق است و نزد خداوند پاداش می‌گیرد، زیرا به آنچه مکلف به حکم کردن به آن شده، حکم کرده است؛ هرچند کسی که به نفع او حکم شده بر باطل باشد و کسی که علیه او حکم شده بر حق.\n\nپس آیا نزد خداوند همان‌گونه است که در حکم آمده، یا همان‌گونه که در نفس‌الامر (واقعیت) است؟ برخی از ما بر این باورند که نزد خداوند همان‌گونه است که در حکم آمده، و برخی دیگر بر این باورند که نزد خداوند همان‌گونه است که در نفس‌الامر است. این مسئله نیازمند تأمل و بررسی ادله است. زیرا خداوند مجازات را برای تهمت‌زنندگان به زنان پاکدامن مقرر کرده است، حتی اگر راست گفته باشند، چرا که «لَمْ يَأْتُوا بِأَرْبَعَةِ شُهَدَاءَ» (چهار شاهد نیاورده‌اند). و در یک قضیه خاص که تهمت‌زننده در آن دروغگو بود، فرمود: «لَوْلَا جَاءُوا عَلَيْهِ بِأَرْبَعَةِ شُهَدَاءَ» (چرا چهار شاهد بر آن نیاوردند؟) همان‌طور که در حکم مقرر شد: «فَإِذْ لَمْ يَأْتُوا بِالشُّهَدَاءِ فَأُولَئِكَ عِنْدَ اللَّهِ هُمُ الْكَاذِبُونَ» (پس چون شاهدان را نیاوردند، آنان نزد خداوند همان دروغگویانند).\n\nپس آیا منظور از این اشاره «أُولَئِكَ» (آنان) این قضیه خاص است یا عموم حکم در این باره؟ شلاق زدن تهمت‌زننده تنها به دلیل تهمت او و به دلیل نیاوردن چهار شاهد بود. و چه بسا شهود در نفس‌الامر (واقعیت) شاهدان دروغ باشند و به شهادت آنان، مجازات بر متهم وارد شود و کشته شود، در حالی که او در آخرت پاداش کامل دارد، با وجود ثبوت حکم علیه او در دنیا. و بر شاهدان دروغ و تهمت‌زننده در آخرت عقوبت است، هرچند حکم حق در دنیا بر اساس سخن او و شهادت شاهدان دروغ صادر شده باشد. به همین دلیل\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «من تنها یک بشر هستم و شما نزد من برای خصومت می‌آیید، و شاید یکی از شما در بیان دلیل خود از دیگری فصیح‌تر باشد. پس اگر برای کسی به حق برادرش حکم کردم، نباید آن را بگیرد، زیرا من تنها قطعه‌ای از آتش را برای او می‌بُرم.»\n\nپس برای او به چیزی حکم کرده که حق برادرش بوده و آن را حق او قرار داده است، در حالی که در آخرت بر آن مجازات می‌شود، همان‌طور که بر غیبت و سخن‌چینی مجازات می‌شود، با وجود اینکه ممکن است آن دو (غیبت و نمیمه) حق باشند. پس آنچه در شرع حق است، سعادت را به آن پیوند می‌دهید. و چون شریعت عبارت است از حکم کردن در مورد کسی که برای او تشریع شده و حاکمیت بر او به واسطه آن، پس کسی که برای او تشریع شده بنده است. از این رو، او به بندگی (العبودية) خود ملتزم شد، زیرا حکم شرع او را رها نمی‌کند تا خودسرانه عمل کند. هیچ حرکت و سکونی برای او نیست مگر اینکه شرع در آن حکمی بر او دارد که آن را می‌بیند. به همین دلیل، این طایفه (صوفیه) شریعت را التزام به بندگی (العبودية) قرار دادند.\n\nو اما سخن آنان مبنی بر «نسبت دادن فعل به تو»، به این دلیل است که اگر آنچه مولا از تو می‌خواهد انجام ندهی، پس عمل به آن بر تو واجب نشده است. به همین دلیل قلم از کسی که عقل ندارد برداشته شده است. و این مقدار در علم شریعت کافی است. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}