{
  "id": 185,
  "title": {
    "ar": "الباب الخامس والثمانون ومائة في معرفة مقام ترك الكرامات",
    "en": "Chapter One Hundred and Eighty-Five: Concerning the Knowledge of the Station (مقام) of Renouncing the Miraculous Gifts (الكرامات)",
    "ur": "باب ایک سو پچاسی، کرامات کے ترک (ترک) کے مقام (مقام) کی معرفت (معرفۃ) میں",
    "fa": "باب صد و هشتاد و پنجم در معرفت مقام ترک کرامات"
  },
  "content": {
    "ar": "## (الباب الخامس والثمانون ومائة في معرفة مقام ترك الكرامات)\n\n\n> ترك الكرامة لا يكون دليلا *** فاصخ لقولي فهو أقوم قيلا\n\n\n> إن الكرامة قد يكون وجودها *** حظ المكرم ثم ساء سبيلا\n\n\n> فاحرص على العلم الذي كلفته *** لا تتخذ غير الإله بديلا\n\n\n> ستر الكرامة واجب متحقق *** عند الرجال فلا تكن مخذولا\n\n\n> وظهورها في المرسلين فريضة *** وبها تنزل وحيه تنزيلا\n\n\n### [يجب على الولى ستر الكرامة]\n\n\nكما إن الآيات والكرامات واجب على الرسول إظهارها من أجل دعواه كذلك يجب على الولي التابع سترها هذا مذهب الجماعة لأنه غير مدع ولا ينبغي له الدعوى فإنه ليس بمشرع وميزان الشرع موضوع في العالم قد قام به علماء الرسوم أهل الفتاوى في دين الله فهم أرباب التجريح والتعديل وهذا الولي مهما خرج عن ميزان الشرع الموضوع مع وجود عقل التكليف عنده سلم له حاله للاحتمال الذي في نفس الرحمن في حقه وهو أيضا موجود في الميزان المشروع فإن ظهر بأمر يوجب حدا في ظاهر الشرع ثابت عند الحاكم أقيمت عليه الحدود ولا بد ولا يعصمه ذلك الاحتمال الذي في نفس الأمر من أن يكون من العبيد الذين أبيح لهم فعل ما حرم على غيرهم شرعا فأسقط الله عنهم المؤاخذة ولكن في الدار الآخرة فإنه قال في أهل بدر ما قد ثبت من إباحة الأفعال لهم وكذلك‏\n\n\nفي الخبر الوارد افعل ما شئت فقد غفرت لك‏\n\n\nولم يقل أسقطت عنك الحد في الدنيا فالذي يقيم عليه الحد مأجور وهو في نفسه غير مأثوم كالحلاج ومن جرى مجراه‏\n\n\n### [إن ترك الكرامة قد يكون ابتداء من الله‏]\n\n\nثم إن ترك الكرامة قد يكون ابتداء من الله وهو أنه عز وجل لا يمكن هذا الولي في نفسه من شي‏ء من ذلك جملة واحدة مع كونه عنده من أكابر عباده وأعني خرق العوائد الظاهرة لا العلم بالله وقد يكون هذا الولي أعطاه الله تعالى في نفسه التمكن من ذلك فيترك ذلك كله لله فلا يظهر عليه منه شي‏ء أصلا وقد رأينا ممن هو على هذا القدم جماعة كما قال سيدنا أبو السعود بن الشبل عاقل زمانه وقد سأله بعض من لا يكتمه من حاله شيئا هل أعطاك الله التصرف وهو أصل الكرامات فقال نعم منذ خمس عشرة سنة وتركناه تظرفا فالحق بتصرف لنا يريد رضي الله عنه أنه امتثل أمر الله في اتخاذه عز وجل وكيلا فقال له السائل ما ثم فقال الصلوات الخمس وانتظار الموت الرجل مثل ساعي الطير فم مشغول وقدم تسعى وكان يقول‏\nما أعجبني فيما قيل إلا قوله‏\n\n\n> وأثبت في مستنقع الموت رجله *** وقال لها من دون أخمصك الحشر\n\n\nهكذا هو الرجل وإلا فلا يدعى أنه رجل وفي حين تقييدي هذا الوجه من هذه النسخة خاطبني الحق في سرى من اتخذني وكيلا فقد ولاني ومن ولاني فله مطالبتي وعلى إقامة الحساب فيما ولاني فيه فانعكس الأمر وتبدلت المراتب هذا صنع الله مع عباده الذين ارتضاهم واصطفاهم وما فوق هذا الامتنان امتنان ترتقي الهمة إلى طلبه فالعبد المحقق لا تخرجه هذه الرتبة عن علمه بقدره فما يتخذ الله وكيلا إلا من كان الحق قواه وجوارحه إذ يستحيل تبدل الحقائق فالعبد عبد والرب رب والحق حق والخلق خلق فإذا ظهر خرق عادة على مثل هذا فما هي كرامة عندنا لأن الكرامة تعود على من ظهرت عليه وإنما يتفق لمن هذا مقامه مثل ما اتفق لنا في مجلس حضرنا فيه سنة ست وثمانين وخمسمائة وقد حضر عندنا شخص فيلسوف ينكر النبوة على الحد الذي يثبتها المسلمون وينكر ما جاءت به الأنبياء من خرق العوائد وأن الحقائق لا تتبدل وكان زمان البرد والشتاء وبين أيدينا منقل عظيم يشتعل نارا فقال المنكر المكذب إن العامة تقول إن إبراهيم عليه السلام ألقى في النار فلم تحرقه والنار محرقة بطبعها الجسوم القابلة للإحراق وإنما كانت النار المذكورة في القرآن في قصة إبراهيم الخليل عبارة عن غضب نمرود عليه وحنقه فهي نار الغضب وكونه ألقى فيها لأن الغضب كان عليه وكونها لم تحرقه أي لم يؤثر فيه غضب الجبار لما ظهر به عليه من الحجة بما أقامه من الأدلة فيما ذكر من أفول الأنوار وأنها لو كانت آلهة ما أفلت فركب له من ذلك دليلا فلما فرغ من قوله قال له بعض الحاضرين ممن كان له هذا المقام ولم تكن فإن أريتك أنا صدق ما قاله الله تعالى في النار أنها لم تحرق إبراهيم وأن الله جعلها عليه كما قال بردا وسلاما وأنا أقوم لك في هذا المقام مقام إبراهيم عليه السلام في الذب عنه لا إن ذلك كرامة في حقي فقال المنكر هذا لا يكون فقال له أ ليست هذه هي النار المحرقة قال نعم قال تراها في نفسك ثم ألقى النار التي في المنقل في حجر المنكر وبقيت على ثيابه مدة يقلبها المنكر بيده فلما رآها ما تحرقه تعجب ثم ردها إلى المنقل ثم قال له قرب يدك أيضا منها فقرب يده فأحرقته فقال له هكذا كان الأمر وهي مأمورة تحرق بالأمر وتترك الإحراق كذلك والله تعالى الفاعل لما يشاء فأسلم ذلك المنكر واعترف فمثل هذا يظهر على تارك الكرامات فإنه يقيمها في زمانه نيابة عن الرسول صَلَّى اللهُ عَليهِ وسَلَّم في المعجزة والآية على صدقه فجاء بها لإقامة الدليل على صدق الشارع والدين لا على نفسه إنه ولي لله بخرق هذه العادة فهذا معنى ترك الكرامات ولها رجال وهم الملامية خاصة وأما الصوفية فيظهرون بها وهي عند الأكابر من رعونات النفوس إلا على حد ما ذكرناه‏\n\n",
    "en": "## Chapter One Hundred and Eighty-Five: Concerning the Knowledge of the Station of Abandoning Miraculous Gifts (مقام ترك الكرامات)\n\nAbandoning the miraculous gift is not a proof,\nSo listen closely to my saying, for it is the most upright speech.\n\nIndeed, the existence of the miraculous gift\nMay be the portion of the one granted it, yet it is a bad path.\n\nSo be eager for the Knowledge (العلم) with which you were charged;\nDo not take anything other than the God (الإله) as a substitute.\n\nConcealing the miraculous gift is an established obligation (واجب متحقق)\nAmong the Men (الرجال), so do not be abandoned.\n\nAnd its manifestation in the Messengers is a divine duty (فريضة),\nAnd by it, His revelation (وحي) descends as a sending down (تنزيلا).\n\n### The Saint Must Conceal the Miraculous Gift\n\nJust as it is obligatory for the Messenger to manifest the signs (الآيات) and miraculous gifts (الكرامات) because of his claim, so too is it obligatory for the following saint (الولي التابع) to conceal them. This is the doctrine (مذهب) of the community, because he is not a claimant, nor is it proper for him to claim, for he is not a lawgiver (مشرع).\n\nThe balance of the Law (ميزان الشرع) is established in the world, upheld by the scholars of external forms (علماء الرسوم), the people of legal rulings (أهل الفتاوى) in the religion of Allah. They are the masters of invalidation and validation (أرباب التجريح والتعديل). Whenever this saint deviates from the established balance of the Law, while possessing the intellect of obligation (عقل التكليف), his state (حاله) is accepted due to the possibility (الاحتمال) that exists in the Self of the All-Merciful (نفس الرحمن) concerning him, which is also present within the sanctioned Balance.\n\nHowever, if he manifests an act that necessitates a legal penalty (حد) in the external Law (ظاهر الشرع) and is established before the judge (الحاكم), the penalties must inevitably be carried out upon him. Nor does that possibility in the matter itself protect him from being one of the servants (العبيد) for whom the performance of what is legally forbidden to others has been permitted, and from whom Allah has dropped the accountability (المؤاخذة)—but only in the Hereafter (الدار الآخرة). For He said concerning the people of Badr what has been established regarding the permissibility of their actions. And likewise, in the reported tradition: \"Do what you wish, for I have forgiven you.\" But He did not say, \"I have dropped the legal penalty from you in this world.\" Thus, the one who carries out the penalty upon him is rewarded (مأجور), while the saint himself is not sinful (غير مأثوم), like al-Hallaj and those who followed his path.\n\n### The Abandonment of the Miraculous Gift May Be an Initiative from Allah\n\nFurthermore, the abandonment of the miraculous gift (ترك الكرامة) may be an initiative (ابتداء) from Allah, which is that He, the Mighty and Majestic, does not enable this saint internally (في نفسه) to perform any of that whatsoever, even though he is one of His greatest servants. And I mean the breaking of manifest customs (خرق العوائد الظاهرة), not the Knowledge of Allah (العلم بالله).\n\nIt may also be that Allah the Exalted has granted this saint the internal ability (التمكن) to perform such acts, but he forsakes all of that for the sake of Allah, so nothing of it appears from him at all. We have seen a group of people who stand upon this footing (القدم), such as our master Abu al-Su'ud ibn al-Shibl, the wise man of his time. When he was asked by someone to whom he concealed nothing of his state: \"Has Allah granted you the power of disposal (التصرف), which is the root of miraculous gifts?\" He replied: \"Yes, for fifteen years, and we abandoned it out of refinement (تظرفا). The Real (الحق) is disposing for us.\"\n\nHe meant, may Allah be pleased with him, that he obeyed Allah's command in taking Him, the Mighty and Majestic, as his Agent (وكيلا). The questioner then asked him, \"What is there then?\" He replied, \"The five prayers and awaiting death. The man is like the bird catcher: a busy mouth and a foot that strives.\" He used to say: Nothing that has been said impressed me except the saying:\n\nAnd he planted his foot firmly in the swamp of death,\nAnd said to it: \"Beyond your sole is the Gathering (الحشر).\"\n\nThis is what the Man (الرجل) is; otherwise, he should not claim to be a man.\n\nWhile I was recording this aspect in this copy, the Real addressed me in my secret heart: \"Whoever takes Me as an Agent has appointed Me, and whoever appoints Me has the right to demand from Me, and I am responsible for establishing the account regarding what he appointed Me for.\" Thus, the matter was reversed, and the Levels (المراتب) were exchanged. This is the making of Allah with His servants whom He has approved and chosen. There is no favor (امتنان) above this favor that the spiritual aspiration (الهمة) might ascend to seek.\n\nThe realized servant (العبد المحقق) is not removed by this rank from his knowledge of his own measure. For no one takes Allah as an Agent except one whose powers and limbs (قواه وجوارحه) are the Real. Since the realities (الحقائق) cannot be exchanged: the servant is a servant, the Lord is a Lord, the Real is the Real, and creation is creation.\n\nTherefore, if a breaking of custom (خرق عادة) appears through such a person, it is not a miraculous gift (كرامة) according to us, because the miraculous gift redounds to the benefit of the one through whom it appears. Rather, it happens to one whose station (مقام) is this, just as it happened to us in a gathering we attended in the year 586 AH (1190 CE).\n\nA philosopher was present with us who denied prophethood according to the way Muslims affirm it, and who denied the breaking of customs brought by the prophets, claiming that realities do not change. It was a time of cold and winter, and before us was a large brazier (منقل) burning with fire.\n\nThe denier and disbeliever said: \"The common people say that Abraham, peace be upon him, was thrown into the fire, and it did not burn him. Yet fire, by its nature (بطبعها), burns bodies susceptible to burning. The fire mentioned in the Quran in the story of Abraham the Friend (الخليل) was merely an expression of Nimrod's anger and rage toward him; thus, it was the fire of wrath. And his being thrown into it meant that the wrath was directed at him, and its not burning him meant that the tyrant's anger did not affect him, due to the proof he manifested against him by establishing evidence regarding the setting of the lights (أفول الأنوار), arguing that if they were gods, they would not set. Thus, he constructed an argument from that.\"\n\nWhen he finished his speech, one of those present who held this station—and he was not one of the deniers—said to him: \"What if I show you the truth of what Allah the Exalted said about the fire, that it did not burn Abraham, and that Allah made it, as He said, 'coolness and safety' (بردا وسلاما)? And I will stand for you in this station as a defender of Abraham, peace be upon him, not claiming that this is a miraculous gift in my right.\" The denier said, \"This cannot be.\"\n\nHe asked him, \"Is this not the burning fire?\" He said, \"Yes.\" He said, \"Watch it for yourself.\" Then he threw the fire from the brazier into the lap of the denier, and it remained on his clothes for a while, and the denier turned it over with his hand. When he saw that it did not burn him, he was astonished. Then he returned it to the brazier. Then he said to him, \"Bring your hand close to it again.\" He brought his hand close, and it burned him.\n\nHe said to him, \"This is how the matter was. The fire is commanded: it burns by command and it ceases burning likewise. And Allah the Exalted is the Doer of what He wills.\" That denier submitted (أسلم) and confessed.\n\nSuch an event appears through the one who abandons miraculous gifts (تارك الكرامات), for he establishes it in his time as a deputy (نيابة) for the Messenger (صَلَّى اللهُ عَليهِ وسَلَّم) in the miracle (المعجزة) and the sign (الآية) testifying to his truthfulness. Thus, he brought it forth to establish proof of the truthfulness of the Lawgiver (الشارع) and the Religion, not to prove himself to be a saint (ولي) of Allah by breaking this custom. This is the meaning of abandoning miraculous gifts. It has its Men, who are specifically the Malamatiyya (الملامية). As for the Sufis, they manifest them, but among the great masters (الأكابر), they are considered among the follies of the lower souls (رعونات النفوس), except within the limits we have mentioned.",
    "ur": "## (باب ایک سو پچاسی: کرامات کو ترک کرنے کے مقام کی معرفت میں)\n\nکرامت کا ترک کرنا کوئی دلیل نہیں ہوتا\nپس میری بات کو غور سے سن، کیونکہ یہ سب سے سیدھی بات ہے\nکرامت کا وجود کبھی کبھی\nاس شخص کا حصہ ہوتا ہے جسے کرامت دی گئی، پھر وہ برا راستہ اختیار کرتا ہے\nپس اس علم پر حریص ہو جا جس کا تجھے مکلف بنایا گیا ہے\nاور اللہ کے سوا کسی کو اپنا بدل (معبود) نہ بنا\nکرامت کو چھپانا اہل اللہ کے نزدیک\nایک یقینی واجب ہے، پس تو محروم نہ ہو\nاور رسولوں میں اس کا ظاہر ہونا فرض ہے\nاور اسی کے ذریعے ان پر وحی نازل ہوتی ہے۔\n\n### [ولی پر کرامت کا چھپانا واجب ہے]\n\nجس طرح رسول پر اپنی دعوت کی وجہ سے آیات اور کرامات کا ظاہر کرنا واجب ہے، اسی طرح پیروکار ولی پر ان کو چھپانا واجب ہے۔ یہ جماعت (صوفیاء) کا مسلک ہے، کیونکہ وہ مدعی نہیں ہے اور نہ ہی اسے دعویٰ کرنا چاہیے، اس لیے کہ وہ شارع نہیں ہے۔ اور شریعت (الشرع) کا میزان دنیا میں رکھا ہوا ہے، جس پر دینِ الٰہی میں فتاویٰ دینے والے ظاہری علماء قائم ہیں، پس وہی جرح و تعدیل کے مالک ہیں۔ اور یہ ولی جب بھی مقررہ میزانِ شرع سے باہر نکلے، جبکہ اس کے پاس عقلِ تکلیف موجود ہو، تو اس کا حال اس احتمال کی وجہ سے محفوظ رہتا ہے جو رحمن کے نفس میں اس کے حق میں موجود ہے۔ اور یہ (احتمال) بھی مشروع میزان میں موجود ہے۔ پس اگر وہ کسی ایسے امر کے ساتھ ظاہر ہو جو ظاہرِ شرع میں حد کو واجب کرتا ہو اور حاکم کے نزدیک ثابت ہو جائے، تو اس پر حدود ضرور قائم کی جائیں گی، اور وہ احتمال جو نفسِ امر میں ہے، اسے اس بات سے نہیں بچائے گا کہ وہ ان بندوں میں سے ہو جن کے لیے شرعاً وہ فعل مباح کر دیا گیا جو دوسروں پر حرام تھا، پس اللہ نے ان سے مؤاخذہ ساقط کر دیا، لیکن آخرت میں۔ کیونکہ اللہ تعالیٰ نے اہلِ بدر کے بارے میں وہ فرمایا ہے جو ان کے لیے افعال کے مباح ہونے سے ثابت ہے۔ اور اسی طرح\n\nوارد شدہ خبر میں ہے:\n\"افعل ما شئت فقد غفرت لك\" (جو چاہے کر، میں نے تجھے بخش دیا)۔\n\nاور یہ نہیں فرمایا کہ میں نے تجھ سے دنیا میں حد ساقط کر دی۔ پس جو شخص اس پر حد قائم کرتا ہے وہ ماجور (اجر والا) ہے، اور وہ (ولی) اپنی ذات میں گناہگار نہیں ہے، جیسے حلاج اور جو اس کے راستے پر چلے۔\n\n### [کرامت کا ترک کرنا کبھی اللہ کی طرف سے ابتداء ہوتا ہے]\n\nپھر کرامت کا ترک کرنا کبھی اللہ کی طرف سے ابتداء ہوتا ہے، اور وہ یہ ہے کہ اللہ عز و جل اس ولی کو اپنی ذات میں ان چیزوں میں سے کسی پر بھی یکسر قدرت نہیں دیتا، باوجود اس کے کہ وہ اس کے نزدیک اس کے بڑے بندوں میں سے ہوتا ہے۔ اور میری مراد ظاہری خرقِ عادات (عادت کے خلاف امور) ہیں نہ کہ اللہ کی معرفت (المعرفۃ)۔ اور کبھی ایسا بھی ہوتا ہے کہ اللہ تعالیٰ اس ولی کو اپنی ذات میں اس پر قدرت عطا کرتا ہے، لیکن وہ یہ سب کچھ اللہ کے لیے ترک کر دیتا ہے، پس اس پر اس میں سے کچھ بھی ظاہر نہیں ہوتا۔ ہم نے ایسے قدم پر قائم ایک جماعت کو دیکھا ہے، جیسا کہ ہمارے سردار ابو السعود بن الشبل، جو اپنے زمانے کے عاقل تھے، انہوں نے فرمایا۔ ان سے کسی ایسے شخص نے سوال کیا جس سے وہ اپنا کوئی حال نہیں چھپاتے تھے: کیا اللہ نے آپ کو تصرف (اختیار) عطا کیا ہے، جو کرامات کی اصل ہے؟ انہوں نے کہا: ہاں، پندرہ سال سے، اور ہم نے اسے تظرفاً (ادب اور ناز کے طور پر) ترک کر دیا ہے۔ پس ذات حق (الحق) ہمارے تصرف کے ساتھ ہے۔ وہ رضی اللہ عنہ یہ مراد لیتے تھے کہ انہوں نے اللہ عز و جل کو وکیل بنانے میں اس کے حکم کی تعمیل کی۔ سائل نے ان سے پوچھا: پھر کیا ہے؟ تو انہوں نے کہا: پانچ نمازیں اور موت کا انتظار۔ مرد پرندے کے شکاری کی طرح ہے، منہ مشغول اور قدم دوڑتے ہیں۔ اور وہ کہا کرتے تھے:\n\nمجھے کہی گئی باتوں میں سے صرف یہ قول پسند آیا:\n\"وأثبت في مستنقع الموت رجله *** وقال لها من دون أخمصك الحشر\"\n(اور اس نے موت کے دلدل میں اپنا قدم جما دیا، اور اس سے کہا کہ تیرے تلوے کے نیچے حشر ہے)۔\n\nمرد ایسا ہی ہوتا ہے، ورنہ وہ مرد ہونے کا دعویٰ نہ کرے۔ اور جب میں اس نسخے سے اس پہلو کو مقید کر رہا تھا، تو ذات حق (الحق) نے میرے باطن میں مجھ سے خطاب کیا: \"جس نے مجھے وکیل بنایا، اس نے مجھے اپنا والی بنا لیا، اور جس نے مجھے اپنا والی بنایا، اسے مجھ سے مطالبہ کرنے کا حق ہے، اور مجھ پر لازم ہے کہ میں اس معاملے میں حساب قائم کروں جس میں اس نے مجھے اپنا والی بنایا ہے۔\" پس معاملہ الٹ گیا اور مراتب بدل گئے۔ یہ اللہ کا سلوک ہے اپنے ان بندوں کے ساتھ جنہیں اس نے پسند کیا اور چن لیا۔ اور اس احسان سے بڑھ کر کوئی احسان نہیں جس کے طلب کی طرف ہمت بلند ہو۔ پس محقق بندہ یہ رتبہ پا کر بھی اپنے قدر کے علم سے باہر نہیں نکلتا، کیونکہ اللہ کو وکیل وہی بناتا ہے جس کی قوتیں اور جوارح ذات حق (الحق) بن چکا ہو، اس لیے کہ حقائق کا بدلنا محال ہے۔ پس بندہ بندہ ہے، رب رب ہے، ذات حق (الحق) حق ہے، اور خلق خلق ہے۔ پس اگر ایسا خرقِ عادت (عادت کے خلاف امر) ایسے شخص پر ظاہر ہو، تو وہ ہمارے نزدیک کرامت نہیں ہوتی، کیونکہ کرامت اس شخص کی طرف لوٹتی ہے جس پر وہ ظاہر ہوئی ہو۔ بلکہ جس کا یہ مقام ہو، اس کے ساتھ ایسا ہی واقعہ پیش آتا ہے جیسا کہ ہمارے ساتھ ایک مجلس میں پیش آیا جس میں ہم ۵۸۶ھ میں حاضر تھے۔ ہمارے پاس ایک فلسفی شخص آیا جو نبوت کا اس حد تک انکار کرتا تھا جس حد تک مسلمان اسے ثابت کرتے ہیں، اور وہ ان خرقِ عادات کا انکار کرتا تھا جو انبیاء لے کر آئے تھے، اور یہ کہ حقائق نہیں بدلتے۔ سردی اور جاڑے کا زمانہ تھا، اور ہمارے سامنے ایک بڑی انگیٹھی تھی جس میں آگ جل رہی تھی۔ اس منکر و جھٹلانے والے نے کہا کہ عام لوگ کہتے ہیں کہ ابراہیم علیہ السلام کو آگ میں ڈالا گیا تو اس نے انہیں نہیں جلایا، حالانکہ آگ اپنی طبیعت کے اعتبار سے جلنے والے اجسام کو جلانے والی ہے۔ اور ابراہیم خلیل کے قصے میں قرآن میں مذکور آگ صرف نمرود کے غصے اور اس کی تپش کا اظہار تھی، پس وہ غضب کی آگ تھی۔ اور انہیں اس میں ڈالے جانے کا مطلب یہ تھا کہ غضب ان پر تھا۔ اور اس کا انہیں نہ جلانا یعنی جبار (نمرود) کے غصے نے ان پر اثر نہیں کیا، اس دلیل کی وجہ سے جو انہوں نے انوار کے غروب ہونے کے بارے میں قائم کی تھی، اور یہ کہ اگر وہ معبود ہوتے تو غروب نہ ہوتے۔ پس اس نے اس سے ایک دلیل بنا لی۔ جب وہ اپنی بات سے فارغ ہوا تو حاضرین میں سے ایک شخص نے، جو اس مقام پر فائز تھا، اس سے کہا: اگر میں تمہیں اس بات کی سچائی دکھاؤں جو اللہ تعالیٰ نے آگ کے بارے میں فرمائی کہ اس نے ابراہیم کو نہیں جلایا، اور یہ کہ اللہ نے اسے ان پر جیسا کہ اس نے فرمایا: \"برداً و سلاماً\" (ٹھنڈک اور سلامتی) بنا دیا، اور میں اس مقام پر ابراہیم علیہ السلام کی طرف سے دفاع کے لیے کھڑا ہو جاؤں، نہ کہ یہ میرے حق میں کرامت ہو، تو کیا تم مانو گے؟ منکر نے کہا: یہ نہیں ہو سکتا۔ اس نے اس سے پوچھا: کیا یہ جلانے والی آگ نہیں ہے؟ اس نے کہا: ہاں۔ اس نے کہا: تم اسے اپنے نفس میں دیکھ رہے ہو۔ پھر اس نے انگیٹھی کی آگ منکر کی گود میں ڈال دی، اور وہ اس کے کپڑوں پر رہی، اور منکر اسے اپنے ہاتھ سے پلٹتا رہا۔ جب اس نے دیکھا کہ وہ اسے نہیں جلا رہی تو وہ حیران ہوا، پھر اس نے اسے انگیٹھی میں واپس ڈال دیا۔ پھر اس نے اس سے کہا: اپنا ہاتھ بھی اس کے قریب کرو۔ اس نے اپنا ہاتھ قریب کیا تو آگ نے اسے جلا دیا۔ اس نے اس سے کہا: معاملہ ایسا ہی تھا، اور یہ (آگ) مامور ہے، حکم سے جلاتی ہے اور اسی طرح حکم سے جلانا چھوڑ دیتی ہے۔ اور اللہ تعالیٰ جو چاہتا ہے کرنے والا ہے۔ پس وہ منکر مسلمان ہو گیا اور اعتراف کر لیا۔ تو ایسی چیزیں کرامات کو ترک کرنے والے پر ظاہر ہوتی ہیں، کیونکہ وہ اپنے زمانے میں رسول صَلَّى اللهُ عَليهِ وسَلَّم کی نیابت میں ان کے صدق پر معجزے اور آیت کے طور پر انہیں قائم کرتا ہے۔ پس وہ اسے شارع اور دین کی سچائی پر دلیل قائم کرنے کے لیے لایا، نہ کہ اپنے آپ پر کہ وہ اس خرقِ عادت کے ذریعے اللہ کا ولی ہے۔ یہ ہے کرامات کو ترک کرنے کا معنی، اور اس کے خاص مرد ملامتیہ (الملامیۃ) ہیں۔ اور جہاں تک صوفیہ کا تعلق ہے، تو وہ انہیں ظاہر کرتے ہیں، حالانکہ وہ اکابر کے نزدیک نفس کی رعونتوں میں سے ہیں، سوائے اس حد کے جو ہم نے بیان کیا۔",
    "fa": "باب صد و هشتاد و پنجم در معرفت مقام ترک کرامات (الکرامات)\n\nترک کرامت (الکرامة) دلیل [بر برتری] نیست،\nپس به سخن من گوش فرا ده که آن راست‌ترین گفتار است.\nهمانا وجود کرامت (الکرامة) ممکن است\nبهره‌ی کسی باشد که کرامت به او داده شده، سپس راهش بد شود.\nپس بر علمی که مکلّف به آن شده‌ای حریص باش،\nو جز خدا را جایگزین مگیر.\nپنهان کردن کرامت (الكرامة) نزد مردان [اهل حق] واجبی محقق است، پس نومید مباش.\nو آشکار ساختن آن در رسولان فریضه است،\nو به واسطه‌ی آن، وحی او نازل می‌شود.\n\nهمان‌گونه که اظهار آیات و کرامات (الكرامات) بر رسول به دلیل ادعای او واجب است، بر ولی (الولی) تابع نیز پنهان کردن آن واجب است. این مذهب جماعت [صوفیه] است، زیرا او مدعی نیست و شایسته نیست که ادعایی داشته باشد، چرا که او قانون‌گذار (مشرّع) نیست. معیار شریعت (الشرع) در جهان وضع شده است و علمای رسوم و اهل فتوا در دین خدا به آن قیام کرده‌اند؛ آنان صاحبان جرح و تعدیل هستند. این ولی (الولی)، هرگاه از معیار شریعت (الشرع) وضع شده خارج شود، با وجود عقل تکلیف نزد او، حالش به دلیل احتمالی که در نفس رحمان در حق او وجود دارد، محفوظ می‌ماند؛ و این احتمال نیز در معیار مشروع موجود است. اگر [ولی] با امری ظاهر شود که در ظاهر شریعت (الشرع) موجب حد باشد و نزد حاکم ثابت شود، حدود بر او اقامه خواهد شد و چاره‌ای نیست. و آن احتمال که در نفس‌الامر وجود دارد، او را از این امر که از بندگانی (العبید) باشد که انجام آنچه بر دیگران حرام شده، شرعاً برایشان مباح گشته و خداوند مؤاخذه را از آنان ساقط کرده است، معصوم نمی‌دارد، اما این [سقوط مؤاخذه] در سرای آخرت است. زیرا خداوند درباره‌ی اهل بدر آنچه را که از مباح بودن افعال برایشان ثابت شده، فرموده است. و همچنین در خبر وارد شده: «افعل ما شئت فقد غفرت لك» (هر چه می‌خواهی انجام ده، همانا تو را آمرزیدم). و نفرموده است که حد را در دنیا از تو ساقط کردم. پس کسی که حد را بر او اقامه می‌کند، مأجور است، در حالی که [ولی] در نفس خود گناهکار نیست، مانند حلاج و کسانی که راه او را پیمودند.\n\nسپس ترک کرامت (الكرامة) ممکن است از جانب خداوند باشد؛ و آن این است که خداوند عز و جل این ولی (الولی) را در نفس خود به هیچ وجه قادر به انجام هیچ یک از آن [خوارق عادات] نمی‌سازد، با وجود اینکه او نزد خداوند از بزرگان بندگانش است. و منظورم خرق عادات ظاهری است، نه علم به خدا. و گاهی ممکن است خداوند متعال به این ولی (الولی) در نفس خود توانایی انجام آن را داده باشد، اما او همه‌ی آن را به خاطر خدا ترک کند و هیچ چیز از آن بر او ظاهر نشود. ما جماعتی را دیده‌ایم که بر این قدم بوده‌اند، چنانکه سید ما ابوالسعود بن الشبل، عاقل زمان خود، فرمود. هنگامی که یکی از کسانی که هیچ چیز از حال خود را از او پنهان نمی‌کرد، از او پرسید: آیا خداوند تصرف (التصرف) را که اصل کرامات (الكرامات) است، به تو عطا کرده است؟ گفت: بله، از پانزده سال پیش، و ما آن را از روی ظرافت ترک کردیم، پس حق (الحق) با تصرف ماست. منظور او (رضی الله عنه) این است که امر خدا را در وکیل گرفتن او عز و جل امتثال کرده است. پس سؤال کننده به او گفت: پس آنجا چیست؟ گفت: نمازهای پنج‌گانه و انتظار مرگ. مرد مانند قاصد پرنده است، دهانش مشغول و پایش در تلاش است. و می‌گفت: در میان آنچه گفته شده، چیزی مرا شگفت‌زده نکرد جز این قول:\n\n«وأثبت في مستنقع الموت رجله *** وقال لها من دون أخمصك الحشر»\n(و پایش را در گنداب مرگ استوار کرد *** و به آن گفت: حشر (الحشر) زیر کف پایت است.)\n\nمرد این‌گونه است، وگرنه نباید ادعا کند که مرد است. و در حین ثبت این وجه از این نسخه، حق (الحق) در سِرّ من با من خطاب کرد: «هر کس مرا وکیل گیرد، همانا مرا ولی خود ساخته است، و هر کس مرا ولی خود سازد، حق مطالبه از من را دارد و بر من است که در آنچه مرا ولی خود ساخته، حسابرسی کنم.» پس امر معکوس شد و مراتب دگرگون گشت. این صنع خدا با بندگانش است که آنان را پسندیده و برگزیده است. و بالاتر از این منت، منتی نیست که همت به طلب آن ارتقا یابد. پس بنده‌ی محقق را این رتبه از علمش به قدر خود خارج نمی‌سازد. و خدا را وکیل نمی‌گیرد مگر کسی که حق (الحق) قوای او و جوارح او باشد، زیرا تبدیل حقایق (الحقائق) محال است؛ پس بنده، بنده است و رب، رب است و حق (الحق)، حق است و خلق، خلق است. پس اگر خرق عادتی بر چنین کسی ظاهر شود، نزد ما کرامت (الكرامة) نیست، زیرا کرامت به کسی که بر او ظاهر شده باز می‌گردد. بلکه برای کسی که این مقام را دارد، چیزی رخ می‌دهد شبیه آنچه برای ما در مجلسی که در سال پانصد و هشتاد و شش هجری در آن حاضر بودیم، اتفاق افتاد. شخصی فیلسوف نزد ما حاضر شد که نبوت را به آن حدی که مسلمانان اثبات می‌کنند، انکار می‌کرد و خوارق عاداتی را که انبیا آورده‌اند و اینکه حقایق (الحقائق) تغییر نمی‌کنند، منکر بود. زمان، زمان سرما و زمستان بود و در مقابل ما منقلی بزرگ پر از آتش شعله‌ور بود. آن منکر تکذیب‌کننده گفت: عوام می‌گویند که ابراهیم (علیه السلام) در آتش افکنده شد و او را نسوزاند، در حالی که آتش طبعاً اجسام قابل احتراق را می‌سوزاند. و آتش مذکور در قرآن در داستان ابراهیم خلیل، تنها تعبیری از غضب نمرود بر او و غیظ او بود، پس آن آتش غضب بود. و اینکه او در آن افکنده شد، به این دلیل بود که غضب بر او بود. و اینکه او را نسوزاند، یعنی غضب آن جبار در او تأثیر نکرد، به دلیل حجتی که ابراهیم با اقامه‌ی دلایل در مورد افول انوار آورد و گفت که اگر آنها خدا بودند، افول نمی‌کردند. پس او از این امر دلیلی ساخت. هنگامی که از سخن خود فارغ شد، یکی از حاضران که دارای این مقام بود و [کرامت را] پنهان می‌کرد، به او گفت: اگر من به تو صدق آنچه را که خداوند متعال درباره‌ی آتش فرموده که ابراهیم را نسوزاند و خداوند آن را بر او «برداً و سلاماً» (سرد و سلامت) قرار داد، نشان دهم، و من در این مقام، به نیابت از ابراهیم (علیه السلام) برای دفاع از او قیام کنم، نه اینکه آن در حق من کرامت (الكرامة) باشد، چه می‌گویی؟ منکر گفت: این ممکن نیست. آن شخص به او گفت: آیا این همان آتش سوزاننده نیست؟ گفت: بله. گفت: آن را در نفس خود می‌بینی. سپس آتش درون منقل را در دامن آن منکر انداخت و مدتی بر لباس‌های او ماند و منکر با دست خود آن را زیر و رو می‌کرد. هنگامی که دید او را نمی‌سوزاند، تعجب کرد. سپس آن را به منقل بازگرداند. سپس به او گفت: دستت را نیز نزدیک آن ببر. دستش را نزدیک برد و آتش او را سوزاند. پس به او گفت: امر این‌گونه بود؛ آتش مأمور است، با امر می‌سوزاند و ترک احتراق نیز می‌کند. و خداوند متعال فاعل هر آن چیزی است که می‌خواهد. پس آن منکر اسلام آورد و اعتراف کرد. چنین چیزی بر کسی که کرامات (الكرامات) را ترک می‌کند، ظاهر می‌شود، زیرا او آن را در زمان خود به نیابت از رسول (صَلَّى اللهُ عَليهِ وسَلَّم) در معجزه و آیه بر صدق او اقامه می‌کند. پس آن را برای اقامه‌ی دلیل بر صدق شارع و دین می‌آورد، نه بر نفس خود که او ولی (الولی) خداست به واسطه‌ی این خرق عادت. این است معنای ترک کرامات (الكرامات). و این مقام را مردانی دارند که به ویژه ملامتیه (الملامية) هستند. اما صوفیه (الصوفية) آن را آشکار می‌سازند، در حالی که نزد بزرگان، کرامت از رعونات نفوس است، مگر در حدی که ذکر کردیم."
  },
  "page_count": 2
}