{
  "id": 8,
  "title": {
    "ar": "الباب الثامن في معرفة الأرض التي خلقت من بقية خميرة طينة آدم ع‏",
    "en": "Chapter Eight: Concerning the Knowledge of the Earth that was created from the residue of the leaven of Adam’s clay.",
    "ur": "آٹھواں باب: اس زمین کی (المعرفۃ) کے بیان میں جو آدم علیہ السلام کی مٹی کے خمیر کے باقی ماندہ حصے سے تخلیق کی گئی۔",
    "fa": "باب هشتم در معرفت زمینی که از باقیمانده خمیرمایه گِل آدم (علیه السلام) خلق شد."
  },
  "content": {
    "ar": "## (الباب الثامن) في معرفة الأرض التي خلقت من بقية خميرة طينة آدم ع‏\n\n\nوهي أرض الحقيقة وذكر بعض ما فيها من الغرائب والعجائب‏\n\n\n> يا أخت بل يا عمتي المعقولة *** أنت الأميمة عندنا المجهولة\n\n\n> نظر البنون إليك أخت أبيهم *** فتنافسوا عن همة مغلوله‏\n\n\n> إلا القليل من البنين فإنهم *** عطفوا عليك بأنفس مجبوله‏\n\n\n> يا عمتي قل كيف أظهر سره *** فيك الاخى محققا تنزيله‏\n\n\n> حتى بدا من مثل ذاتك عالم *** قد يرتضي رب الورى توكيله‏\n\n\n> أنت الإمامة والإمام أخوك و*** المأموم أمثال له مسلوله‏\n\n\n### [النخلة أخت آدم‏]\n\n\nاعلم أن الله تعالى لما خلق آدم عليه السلام الذي هو أول جسم إنساني تكون وجعله أصلا لوجود الأجسام الإنسانية وفضلت من خميرة طينته فضلة خلق منها النخلة فهي أخت لآدم عليه السلام وهي لنا عمة وسماها الشرع عمة وشبهها بالمؤمن ولها أسرار عجيبة دون سائر النبات وفضل من الطينة بعد خلق النخلة قدر السمسمة في الخفاء فمد الله في تلك الفضلة أرضا واسعة الفضاء إذا جعل العرش وما حواه والكرسي والسموات والأرضون وما تحت الثرى والجنات كلها والنار في هذه الأرض كان الجميع فيها كحلقة ملقاة في فلاة من الأرض وفيها من العجائب والغرائب ما لا يقدر قدره ويبهر العقول أمره وفي كل نفس خلق الله فيها عوالم يُسَبِّحُونَ اللَّيْلَ والنَّهارَ لا يَفْتُرُونَ وفي هذه الأرض ظهرت عظمة الله وعظمت عند المشاهد\nلها قدرته وكثير من المحالات العقلية التي قام الدليل الصحيح العقلي على إحالتها هي موجودة في هذه الأرض وهي مسرح عيون العارفين العلماء بالله وفيها يجولون وخلق الله من جملة عوالمها عالما على صورنا إذا أبصرهم العارف يشاهد نفسه فيها وقد أشار إلى مثل ذلك عبد الله بن عباس رضي الله عنه فيما روى عنه في حديث هذه الكعبة وإنها بيت واحد من أربعة عشر بيتا وأن في كل أرض من السبع الأرضين خلقا مثلنا حتى إن فيهم ابن عباس مثلي وصدقت هذه الرواية عند أهل الكشف‏\n\n\n### [مجلس الرحمة في أرض الحقيقة]\n\n\nفلنرجع إلى ذكر هذه الأرض واتساعها وكثرة عالمها المخلوقين فيها ومنها ويقع للعارفين فيها تجليات إلهية أخبر بعض العارفين بأمر أعرفه شهودا قال دخلت فيها يوما مجلسا يسمى مجلس الرحمة لم أر مجلسا قط أعجب منه فبينا أنا فيه إذ ظهر لي تجل إلهي لم يأخذني عني بل أبقاني معي وهذا من خاصية هذه الأرض فإن التجليات الواردة على العارفين في هذه الدار في هذه الهياكل تأخذهم عنهم وتفنيهم عن شهودهم من الأنبياء والأولياء وكل من وقع له ذلك وكذلك عالم السموات العلى والكرسي الأزهى وعالم العرش المحيط الأعلى إذا وقع لهم تجل إلهي أخذهم عنهم وصعقوا وهذه الأرض إذا حصل فيها صاحب الكشف العارف ووقع له تجل لم يفنه عن شهوده ولا اختطفه عن وجوده وجمع له بين الرؤية والكلام قال واتفق لي في هذا المجلس أمور وأسرار لا يسعني ذكرها لغموض معانيها وعدم وصول الإدراكات قبل أن يشهد مثل هذه المشاهد لها وفيها من البساتين والجنات والحيوان والمعادن ما لا يعلم قدر ذلك إلا الله تعالى وكل ما فيها من هذا كله حي ناطق كحياة كل حي ناطق ما هو مثل ما هي الأشياء في الدنيا وهي باقية لا تفني ولا تتبدل ولا يموت عالمها وليست تقبل هذه الأرض شيئا من الأجسام الطبيعية الطينية البشرية سوى عالمها أو عالم الأرواح منا بالخاصية وإذا دخلها العارفون إنما يدخلونها بأرواحهم لا بأجسامهم فيتركون هياكلهم في هذه الأرض الدنيا ويتجردون‏\n\n\n### [مراسم الدخول في أرض الحقيقة]\n\n\nوفي تلك الأرض صور عجيبة النش‏ء بديعة الخلق قائمون على أفواه السكك المشرفة على هذا العالم الذي نحن فيه من الأرض والسماء والجنة والنار فإذا أراد واحد منا الدخول لتلك الأرض من العارفين من أي نوع كان من إنس أو جن أو ملك أو أهل الجنة بشرط المعرفة وتجرد عن هيكله وجد تلك الصور على أفواه السكك قائمين موكلين بها قد نصبهم الله سبحانه لذلك الشغل فيبادر واحد منهم إلى هذا الداخل فيخلع عليه حلة على قدر مقامه ويأخذ بيده ويجول به في تلك الأرض ويتبوأ منها حيث يشاء ويعتبر في مصنوعات الله ولا يمر بحجر ولا شجر ولا مدر ولا شي‏ء ويريد أن يكلمه إلا كلمه كما يكلم الرجل صاحبه ولهم لغات مختلفة وتعطي هذه الأرض بالخاصية لكل من دخلها الفهم بجميع ما فيها من الألسنة فإذا قضى منها وطره وأراد الرجوع إلى موضعه مشى معه رفيقه إلى أن يوصله إلى الموضع الذي دخل منه يوادعه ويخلع عنه تلك الحلة التي كساه وينصرف عنه وقد حصل علوما جمة ودلائل وزاد في علمه بالله ما لم يكن عنده مشاهدة وما رأيت الفهم ينفد أسرع مما ينفد إذا حصل في هذه الأرض‏\n\n\n### [حكاية الشيخ أوحد الدين الكرماني مع شيخه‏]\n\n\nوقد ظهر عندنا في هذه الدار وهذه النشأة ما يعضد هذا القول فمن ذلك ما شاهدناه ولا أذكره ومنها ما حدثني أوحد الدين حامد بن أبي الفخر الكرماني وفقه الله قال كنت أخدم شيخا وأنا شاب فمرض الشيخ وكان في محارة وقد أخذه البطن فلما وصلنا تكريت قلت له يا سيدي اتركني أطلب لك دواء ممسكا من صاحب مارستان سنجار من السبيل فلما رأى احتراقي قال لي رح إليه قال فرحت إلى صاحب السبيل وهو في خيمته جالس ورجاله بين يديه قائمون والشمعة بين يديه وكان لا يعرفني ولا أعرفه فرآني واقفا بين الجماعة فقام إلي وأخذ بيدي وأكرمني وسألني ما حاجتك فذكرت له حال الشيخ فاستحضر الدواء وأعطاني إياه وخرج معي في خدمتي والخادم بالشمعة بين يديه فخفت أن يراه الشيخ فيحرج فحلفت عليه أن يرجع فرجع فجئت الشيخ وأعطيته الدواء وذكرت له كرامة الأمير صاحب السبيل بي فتبسم الشيخ وقال لي يا ولدي إني أشفقت عليك لما رأيت من احتراقك من أجلي فأذنت لك فلما مشيت خفت أن يخجلك الأمير بعدم إقباله عليك فتجردت عن هيكلي هذا ودخلت في هيكل ذلك الأمير وقعدت في موضعه فلما جئت أكرمتك وفعلت معك ما رأيت ثم عدت إلى هيكلي هذا ولا حاجة لي في هذا الدواء وما استعمله فهذا شخص قد ظهر في صورة غيره فكيف أهل تلك الأرض‏\n\n\n### [تربة أرض الحقيقة وثمرها]\n\n\nقال لي بعض العارفين لما دخلت هذه الأرض رأيت فيها أرضا كلها مسك عطر لو شمه أحد\nمنا في هذه الدنيا لهلك لقوة رائحته تمتد ما شاء الله إن تمتد ودخلت في هذه الأرض أرضا من الذهب الأحمر اللين فيها أشجار كلها ذهب وثمرها ذهب فيأخذ التفاحة أو غيرها من الثمر فيأكلها فيجد من لذة طعمها وحسن رائحتها ونعمتها ما لا يصفها واصف تقصر فاكهة الجنة عنها فكيف فاكهة الدنيا والجسم والشكل والصورة ذهب والصورة والشكل كصورة الثمرة وشكلها عندنا وتختلف في الطعم وفي الثمرة من النقش البديع والزينة الحسنة ما لا تتوهمه نفس فأحرى إن تشهده عين ورأيت من كبر ثمرها بحيث لو جعلت الثمرة بين السماء والأرض لحجبت أهل الأرض عن رؤية السماء ولو جعلت على الأرض لفضلت عليها أضعافا وإذا قبض عليها الذي يريد أكلها بهذه اليد المعهودة في القدر عمها بقبضته لنعمتها ألطف من الهواء يطبق عليها يده مع هذا العظم وهذا مما تحيله العقول هنا في نظرها ولما شاهدها ذو النون المصري نطق بما حكي عنه من إيراد الكبير على الصغير من غير أن يصغر الكبير أو يكبر الصغير أو يوسع الضيق أو يضيق الواسع فالعظم في التفاحة على ما ذكرته باق والقبض عليها باليد الصغيرة والإحاطة بها موجود والكيفية مشهودة مجهولة لا يعرفها إلا الله وهذا العلم مما انفرد الحق به واليوم الواحد الزماني عندنا هو عدة سنين عندهم وأزمنة تلك الأرض مختلفة قال ودخلت فيها أرضا من فضة بيضاء في الصورة ذات شجر وأنهار وثمر شهي كل ذلك فضة وأجسام أهلها منها كلها فضة وكذلك كل أرض شجرها وثمرها وأنهارها وبحارها وخلقها من جنسها فإذا تنوولت وأكلت وجد فيها من الطعم والروائح والنعمة مثل سائر المأكولات غير أن اللذة لا توصف ولا تحكي ودخلت فيها أرضا من الكافور الأبيض وهي في أماكن منها أشد حرارة من النار يخوضها الإنسان ولا تحرقه وأماكن منها معتدلة وأماكن باردة وكل أرض من هذه الأرضين التي هي أماكن في هذه الأرض الكبيرة لو جعلت السماء فيها لكانت كحلقة في فلاة بالنسبة إليها وما في جميع أراضيها أحسن عندي ولا أوفق لمزاجي من أرض الزعفران وما رأيت عالما من عالم كل أرض أبسط نفوسا منهم ولا أكثر بشاشة بالوارد عليهم يتلقونه بالترحيب والتأهيل ومن عجائب مطعوماتها أنه أي شي‏ء أكلت منها إذا قطعت من الثمرة قطعة نبتت في زمان قطعك إياها مكانها ما سد تلك الثلمة أو تقطف بيدك ثمرة من ثمرها فزمان قطفك إياها يتكون مثلها بحيث لا يشعر بها إلا الفطن فلا يظهر فيها نقص أصلا\n\n\n### [نساء الأرض الحقيقة وبحارها ومراكبها]\n\n\nوإذا نظرت إلى نسائها ترى أن النساء الكائنين في الجنة من الحور بالنسبة إليهن كنسائنا من البشر بالنسبة إلى الحور في الجنان وأما مجامعتهن فلا يشبه لذتها لذة وأهلها أعشق الخلق فيمن برد عليهم وليس عندهم تكليف بل هم مجبولون على تعظيم الحق وجلاله تعالى لو راموا خلاف ذلك ما استطاعوا وأما أبنيتهم فمنها ما يحدث عن همهم ومنها ما يحدث كما تبنى عندنا من اتخاذ الآلات وحسن الصنعة ثم إن بحارها لا يمتزج بعضها ببعض كما قال تعالى مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ فتعاين منتهى بحر الذهب تصطفق أمواجه ويباشره بالمجاورة بحر الحديد فلا يدخل من واحد في الآخر شي‏ء وماؤهم ألطف من الهواء في الحركة والسيلان وهو من الصفاء بحيث أن لا يخفى عنك من دوابه ولا من الأرض التي يجري البحر عليها شي‏ء فإذا أردت أن تشرب منه وجدت له من اللذة ما لا تجده لمشروب أصلا وخلقها ينبتون فيها كسائر النباتات من غير تناسل بل يتكونون من أرضها تكون الحشرات عندنا ولا ينعقد من مائهم في نكاحهم ولد وإن نكاحهم إنما هو لمجرد الشهوة والنعيم وأما مراكبهم فتعظم وتصغر بحسب ما يريده الراكب وإذا سافروا من بلد إلى بلد فإنهم يسافرون برا وبحرا وسرعة مشيهم في البر والبحر أسرع من إدراك البصر للمبصر وخلقها متفاوتون في الأحوال ففيهم من تغلب عليهم الشهوات وفيهم من يغلب عليهم تعظيم جناب الحق ورأيت فيها ألوانا لا أعرفها في ألوان الدنيا ورأيت فيها معادن تشبه الذهب وما هي بذهب ولا نحاس وأحجارا من اللآلي ينفذها البصر لصفائها شفافة من اليواقيت الحمر\n\n\n### [عجائب أرض الحقيقة]\n\n\nومن أعجب ما فيها إدراك الألوان في الأجسام السفلية التي هي كالهواء ويتعلق الإدراك بألوانها كما يتعلق بالألوان التي في الأجسام الكثيفة وعلى أبواب مدائنها عقود من الأحجار الياقوتية كل حجر منها يزيد على الخمسمائة ذراع وعلو الباب في الهواء عظيم وعليه معلق من الأسلحة والعدد ما لو اجتمع ملك الأرض كلها ما وفي بها وعندهم ظلمة ونور من غير شمس تتعاقب وبتعاقبهما يعرفون الزمان وظلمتهم لا تحجب البصر عن مدركه كما لا يحجبه النور ويغزو بعضهم‏\nبعضا من غير شحناء ولا عداوة ولا فساد بنية وإذا سافروا في البحر وغرقوا لا يعدو عليهم الماء كما يعدو علينا بل يمشون فيه كمشي دوابه حتى يلحقوا بالساحل وتحل بتلك الأرض زلازل لو حلت بنا لانقلبت الأرض وهلك ما كان عليها وقال لقد كنت يوما مع جماعة منهم في حديث وجاءت زلزلة شديدة بحيث إني رأيت الأبنية تتحرك كلها تحركا لا يقدر البصر يتمكن من رؤيتها السرعة الحركة مرورا وكرورا وما عندنا خبر وكانا على الأرض قطعة منها إلى أن فرغت الزلزلة فلما فرغت وسكنت الأرض أخذت الجماعة بيدي وعزتني في ابنة لي اسمها فاطمة فقلت للجماعة إني تركتها في عافية عند والدتها قالوا صدقت ولكن هذه الأرض ما تزلزل بنا وعندنا أحد إلا مات ذلك الشخص أو مات له أحد وإن هذه الزلزلة لموت ابنتك فانظر في أمرها فقعدت معهم ما شاء الله وصاحبي ينتظرني فلما أردت فراقهم مشوا معي إلى فم السكة وأخذوا خلعتهم وجئت إلى بيتي فلقيت صاحبي فقال لي إن فاطمة تنازع فدخلت عليها فقضت وكنت بمكة مجاورا فجهزناها ودفناها بالمعلى فهذا من أعجب ما أخبرت عن تلك الأرض ورأيت بها كعبة يطوف بها أهلها غير مكسوة وتكون أكبر من البيت الذي بمكة ذات أركان أربعة تكلمهم إذا طافوا بها وتحييهم وتفيدهم علوما لم تكن عندهم ورأيت في هذه الأرض بحرا من تراب يجري مثل ما يجري الماء ورأيت حجارة صغارا وكبارا يجري بعضها إلى بعض كما يجري الحديد إلى المغناطيس فتتألف هذه الحجارة ولا تنفصل بعضها من بعض بطبعها إلا إن فصلها فاصل مثل ما يفصل الحديد عن المغناطيس ليس في قوته أن يمتنع فإذا ترك وطبعه جرت بعضها إلى بعض على مقدار من المساحة مخصوص فتضم هذه الحجارة بعضها إلى بعض فينشأ منها صورة سفينة ورأيت منها مركبا صغيرا وشينيين فإذا التأمت السفينة من تلك الحجارة رموا بها في بحر التراب وركبوا فيها وسافروا حيث يشتهون من البلاد غير إن قاع السفينة من رمل أو تراب يلصق بعضه ببعض لصوق الخاصية فمما رأيت فيما رأيت أعجب من جريان هذه السفن في ذلك البحر وصورة الإنشاء في المراكب سواء غير أن لهم في جناحي السفينة مما يلي مؤخرها أسطوانتين عظيمتين تعلو المركب أكثر من القامة وأرض المركب من جهة مؤخره ما بين الأسطوانتين مفتوح متساو مع البحر ولا يدخل فيه من رمل ذلك البحر شي‏ء أصلا بالخاصية وهذا شكله‏\n\n\n### [مدائن أرض الحقيقة]\n\n\nوفي هذه الأرض مدائن تسمى مدائن النور لا يدخلها من العارفين إلا كل مصطفى مختار وهي ثلاث عشرة مدينة وهي على سطح واحد وبنيانها عجيب وذلك أنهم عمدوا إلى موضع في هذه الأرض فبنوا فيه مدينة صغيرة لها أسوار عظيمة يسير الراكب فيها إذا أراد أن يدور بها مسيرة ثلاثة أعوام فلما أقاموها جعلوها خزانة لمنافعهم ومصالحهم وعددهم وأقاموا على بعد من جوانبها أبراجا تعلو على أبراج المدينة بما دار بها ومدوا البناء بالحجارة حتى صار للمدينة كالسقف للبيت وجعلوا ذلك السقف أرضا بنوا عليه مدينة أعظم من التي بنوا أولا وعمروها واتخذوها مسكنا فضاقت عنهم فبنوا عليها مدينة أخرى أكبر منها وما زال يكثر عمارها وهم يصعدون بالبنيان طبقة فوق طبقة حتى بلغت ثلاث عشرة مدينة\n\n\n### [ملوك أرض الحقيقة]\n\n\nثم إني غبت عنهم مدة ثم دخلت إليهم مرة أخرى فوجدتهم قد زادوا مدينتين واحدة فوق أخرى ولهم ملوك فيهم لطف وحنان صحبت منهم جماعة منهم التالي وهو التابع بمنزلة القيل في حمير ولم أر ملكا أكثر منه ذكر الله قد شغله ذكر الله عن تدبير ملكه انتفعت به وكان كثير المجالسة لي ومنهم ذو العرف وهو ملك عظيم لم أر في ملوك الأرض أكثر من تأتي‏\nإليه الرسل من الملوك منه وهو كثير الحركة هين لين يصل إليه كل أحد يتلطف في النزول لكنه إذا غضب لم يقم لغضبه شي‏ء أعطاه الله من القوة ما شاء ورأيت لبحرها ملكا منيع الحمى يدعي السابح هو قليل المجالسة مع من يقصد إليه وما له ذلك الالتفات إلى أحد غير أنه مع ما يخطر له لا مع ما يراد منه ويجاوره سلطان عظيم اسمه السابق إذا دخل عليه الوافد قام إليه من مجلسه وبش في وجهه وأظهر السرور بقدومه وقام له بجميع ما يحتاج إليه من قبل أن يسأله عن شي‏ء فقلت له في ذلك فقال لي أكره أن أرى في وجه السائل ذلة السؤال لمخلوق غيرة أن يذل أحد لغير الله وما كل أحد يقف مع الله على قدم التوحيد وإن أكثر الوجوه مصروفة إلى الأسباب الموضوعة مع الحجاب عن الله فهذا يجعلني أن أبادر إلى ما ترى من كرامة الوافد قال ودخلت على ملك آخر يدعي القائم بأمر الله لا يلتفت إلى الوافد عليه لاستيلاء عظمة الحق على قلبه فلا يشعر بالوافد وما يفد عليه من يفد من العارفين إلا لينظروا إلى حاله التي هو عليها تراه واقفا قد عقد يديه إلى صدره عقد العبد الذليل الجاني مطرقا إلى موضع قدميه لا تتحرك منه شعرة ولا يضطرب منه مفصل كما قيل في قوم هذه حالتهم مع سلطانهم‏\n\n\n> كأنما الطير منهم فوق أ رءوسهم *** لا خوف ظلم ولكن خوف إجلال‏\n\n\nيتعلم العارفون منه حال المراقبة قال ورأيت ملكا يدعي بالرداع مهيب المنظر لطيف المخبر شديد الغيرة دائم الفكرة فيما كلف النظر فيه إذا رأى أحدا يخرج عن طريق الحق رده إلى الحق قال صحبته وانتفعت به وجالست من ملوكهم كثيرا ورأيت منهم من العجائب مما يرجع إلى ما عندهم من تعظيم الله ما لو سطرناه لأعيا الكاتب والسامع فاقتصرنا على هذا القدر من عجائب هذه الأرض ومدائنها لا تحصى كثرة ومدائنها أكثر من ضياعها وجميع من يملكها من الملوك ثمانية عشر سلطانا منهم من ذكرنا ومنهم من سكتنا عنه ولكل سلطان سيرة وأحكام ليست لغيره‏\n\n\n### [ترتيب مملكة أرض الحقيقة]\n\n\nقال وحضرت يوما في ديوانهم لأرى ترتيبهم فمما رأيت أن الملك منهم هو الذي يقوم برزق رعيته بلغوا ما بلغوا فرأيتهم إذا استوى الطعام وقف خلق لا يحصى عددهم كثرة يسمونهم الجباة وهم رسل أهل كل بيت فيعطيه الأمين من المطبخ على قدر عائلته ويأخذه الجابي وينصرف وأما الذي يقسمه عليهم شخص واحد لا غير له من الأيدي على قدر الجباة فيغرف في الزمن الواحد لكل شخص طعامه في وعائه وينصرف وما فضل من ذلك يرفع إلى خزانة فإذا فرغ منهم ذلك القاسم دخل الخزانة وأخذ ما فضل وخرج به إلى الصعاليك الذين على باب دار الملك فيلقيه إليهم فيأكلوه وهكذا في كل يوم ولكل ملك شخص حسن الهيئة هو على الخزانة يدعونه الخازن بيده جميع ما يملكه ذلك الملك ومن شرعهم أنه إذا ولاة ليس له عزله ورأيت فيهم شخصا أعجبتني حركاته وهو جالس إلى جانب الملك وكنت على يمين الملك فسألته ما منزلة هذا عندكم فتبسم وقال أعجبك قلت له نعم قال هذا المعمار الذي يبني لنا المساكن والمدن وجميع ما تراه من آثار عمله ورأيت في سوق صيارفهم أنه لا ينتقد لهم سكتهم إلا واحد في المدينة كلها وفيما تحت يد ذلك الملك من المدن‏\n\n\n### [المستحيل في دار الدنيا جائز واقع في أرض الحقيقة]\n\n\nقال وهكذا رأيت سيرتهم في كل أمر لا يقوم به إلا واحد لكن له وزعة وأهل هذه الأرض أعرف الناس بالله وكل ما أحاله العقل بدليله عندنا وجدناه في هذه الأرض ممكنا قد وقع وإن الله على كل شي‏ء قدير فعلمنا إن العقول قاصرة وإن الله قادر على جمع الضدين ووجود الجسم في مكانين وقيام العرض بنفسه وانتقاله وقيام المعنى بالمعنى وكل حديث وآية وردت عندنا مما صرفها العقل عن ظاهرها وجدناها على ظاهرها في هذه الأرض وكل جسد يتشكل فيه الروحاني من ملك وجن وكل صورة يرى الإنسان فيها نفسه في النوم فمن أجساد هذه الأرض لها من هذه الأرض موضع مخصوص ولهم رقائق ممتدة إلى جميع العالم وعلى كل رقيقة أمين فإذا عاين ذلك الأمين روحا من الأرواح قد استعد لصورة من هذه الصور التي بيده كساه إياها كصورة دحية لجبريل وسبب ذلك أن هذه الأرض مدها الحق تعالى في البرزخ وعين منها موضعا لهذه الأجساد التي تلبسها الروحانيات وتنتقل إليها النفوس عند النوم وبعد الموت فنحن من بعض عالمها ومن هذه الأرض طرف يدخل في الجنة يسمى السوق ونحن نبين لك مثال صورة امتداد الطرف الذي يلي العالم من هذه الأرض وذلك أن الإنسان إذا نظر إلى السراج أو الشمس والقمر ثم حال بأهداب أجفانه بين الناظر والجسم المستنير يبصر من ذلك الجسم‏\nالمستنير إلى عينيه شبه الخطوط من النور تتصل من السراج إلى عينيه متعددة فإذا رفع تلك الأهداب من مقابلة الناظر قليلا قليلا يرى تلك الخطوط الممتدة تنقبض إلى الجسم المستنير فالجسم المستنير مثال للموضع المعين من هذه الأرض لتلك الصور والناظر مثال العالم وامتداد تلك الخطوط كصور الأجساد التي تنتقل إليها في النوم وبعد الموت وفي سوق الجنة والتي تلبسها الأرواح وقصدك إلى رؤية تلك الخطوط بذلك الفعل من إرسال الأهداب الحائلة بين الناظر والجسم النير مثال الاستعداد وانبعاث تلك الخطوط عند هذه الحال انبعاث الصور عند الاستعداد وانقباض الخطوط إلى الجسم النير عند رفع الحائل رجوع الصور إلى تلك الأرض عند زوال الاستعداد وليس بعد هذا البيان بيان وقد بسطنا القول في عجائب هذه الأرض وما يتعلق بها من المعارف في كتاب كبير لنا فيها خاصة انتهى الجزء الحادي عشر\n\n",
    "en": "## The Eighth Chapter\n\nConcerning the knowledge of the Earth that was created from the remainder of the leaven of the clay of Adam (peace be upon him), which is the Earth of Reality (أرض الحقيقة), and mentioning some of the wonders and marvels contained within it.\n\n> O sister, nay, O my intelligible aunt,\n> You are the little mother, unknown to us.\n> The sons looked upon you, the sister of their father,\n> And competed with a constrained zeal.\n> Except for a few of the sons, for they\n> Turned toward you with souls naturally inclined.\n> O my aunt, say how He manifested His secret\n> In you, the brother, realizing its descent.\n> Until a world appeared from your very Essence (ذات),\n> Which the Lord of creatures may approve to entrust.\n> You are the Imamate, and the Imam is your brother,\n> And the followers are like him, drawn forth.\n\n### [The Date Palm, Adam's Sister]\n\nKnow that when Allah the Exalted created Adam (peace be upon him), who was the first human body to be formed, and made him the origin for the existence of human bodies, a remainder was left over from the leaven of his clay. From this remainder, the date palm (النخلة) was created. Thus, it is a sister to Adam (peace be upon him) and an aunt to us. The Sacred Law (الشرع) named it an aunt and likened it to the believer. It possesses wondrous secrets unlike any other plant.\n\nAfter the creation of the date palm, a portion of the clay remained, the size of a sesame seed in hiddenness. Allah extended that remainder into an Earth vast in space. If the Throne (العرش) and all it contains, the Footstool (الكرسي), the heavens, the earths, what is beneath the moist earth (الثرى), all the Gardens (الجنات), and the Fire were placed in this Earth, they would all be within it like a ring cast in a desert plain.\n\nIt contains wonders and marvels whose measure cannot be estimated and whose nature bewilders the intellects. In every breath, Allah has created worlds within it that glorify [Him] night and day without ceasing. In this Earth, the magnificence of Allah is manifested, and His power is magnified in the eyes of those who witness it. Many of the rational impossibilities that sound intellectual proof established as impossible are actually existent in this Earth. It is the roaming ground for the eyes of the Gnostics (العارفين) who possess Knowledge of Allah (العلماء بالله), and in it they wander.\n\nFrom the totality of its worlds, Allah created a world in our image. When the Gnostic perceives them, he witnesses himself within them. Abdullah ibn Abbas (may Allah be pleased with him) alluded to something similar in what was narrated from him concerning the Ka‘ba, stating that it is one house out of fourteen houses, and that in each of the seven earths there are creatures like us, even including an Ibn Abbas like me. This narration is confirmed by the People of Unveiling (أهل الكشف).\n\n### [The Assembly of Mercy in the Earth of Reality]\n\nLet us return to mentioning this Earth, its vastness, and the multitude of its created worlds, both within it and originating from it. Divine Theophanies (تجليات إلهية) occur there for the Gnostics. One Gnostic informed me of an event I know through witnessing (شهود). He said: \"I entered it one day into an assembly called the Assembly of Mercy (مجلس الرحمة). I have never seen an assembly more wondrous than it. While I was there, a Divine Theophany (تجلي إلهي) appeared to me, which did not take me away from myself, but kept me with myself.\"\n\nThis is a specific property (خاصية) of this Earth. For the Theophanies that descend upon Gnostics in this abode, within these physical structures (هياكل)—whether they are Prophets, Saints, or anyone else to whom this occurs—take them away from themselves and annihilate them from their witnessing (شهود). Likewise, when a Divine Theophany occurs to the world of the high heavens, the glorious Footstool (الكرسي الأزهى), and the world of the encompassing High Throne (العرش المحيط الأعلى), it takes them away from themselves and they are struck senseless (صعقوا).\n\nHowever, when the Gnostic who possesses Unveiling (الكشف) is present in this Earth and a Theophany occurs to him, it does not annihilate him from his witnessing (شهود) nor snatch him away from his existence (وجود). Rather, it combines for him vision and speech. He said: \"In this assembly, matters and secrets occurred to me that I cannot mention due to the obscurity of their meanings and the inability of perceptions to grasp them before witnessing such scenes.\"\n\nThis Earth contains gardens, paradises, animals, and minerals whose measure is known only to Allah the Exalted. Everything in it—all these things—is living and speaking (ناطق), possessing a life like the life of every living, speaking being, but not like the things in this world. They are everlasting; they do not perish or change, and their world does not die.\n\nThis Earth does not accept any of the natural, earthly, human bodies, except for its own world or the world of spirits (الأرواح) from among us, by its specific property (بالخاصية). When the Gnostics enter it, they enter only with their spirits, not their bodies. They leave their physical structures (هياكلهم) in this lower world and become disembodied (يتجردون).\n\n### [Rites of Entry into the Earth of Reality]\n\nIn that Earth are forms of marvelous growth and wondrous creation, standing at the mouths of the pathways (السكك) that overlook this world in which we reside, including the earth, the heaven, Paradise, and the Fire.\n\nIf one of us—a Gnostic of any type, whether human, jinn, angel, or inhabitant of Paradise—wishes to enter that Earth, provided he possesses Gnosis (المعرفة) and has stripped himself of his physical structure (هيكل), he finds those forms standing at the mouths of the pathways, appointed by Allah the Glorious for that task. One of them immediately approaches the entrant and clothes him in a robe (حلة) commensurate with his station. He takes his hand and tours him through that Earth, allowing him to settle wherever he wishes and contemplate the creations of Allah. He does not pass by a stone, a tree, a clod of earth, or anything that he wishes to speak to, but that it speaks to him. They possess various languages.\n\nThis Earth, by its specific property, grants understanding of all the languages within it to everyone who enters it. When the Gnostic has satisfied his need and wishes to return to his place, his companion walks with him until he reaches the point of entry. He bids him farewell, removes the robe he had clothed him in, and departs. The Gnostic returns having acquired abundant knowledge (علما جمة) and proofs, and having increased his witnessed knowledge of Allah (علمه بالله) beyond what he previously possessed. I have never seen understanding absorbed faster than it is absorbed when attained in this Earth.\n\n### [The Story of Shaykh Awḥad al-Dīn al-Kirmānī with his Shaykh]\n\nIn this abode and this state of existence, something has appeared to us that supports this statement. Some of it we have witnessed, but I will not mention it. Among the things I was told is the account of Awḥad al-Dīn Ḥāmid ibn Abī al-Fakhr al-Kirmānī (may Allah grant him success). He said:\n\n\"I was serving a Shaykh when I was young. The Shaykh fell ill and was suffering from diarrhea in a small room. When we reached Tikrit, I said to him, 'My master, allow me to seek a constipating medicine for you from the owner of the Sinjar hospital (māristān), which is a public charity (sabīl).' When he saw my ardent desire (احتراقي), he told me, 'Go to him.'\n\n\"So I went to the owner of the charity, who was sitting in his tent with his men standing before him and a candle between his hands. He did not know me, nor did I know him. He saw me standing among the group, stood up, took my hand, honored me, and asked me what my need was. I informed him of the Shaykh’s condition. He prepared the medicine and gave it to me, and then walked out with me, serving me, with his servant carrying the candle before him. I feared the Shaykh would be embarrassed if he saw him, so I swore to him that he should return, and he did.\n\n\"I came to the Shaykh and gave him the medicine, mentioning the generosity of the Amir, the owner of the charity, toward me. The Shaykh smiled and said to me, 'My son, I took pity on you when I saw your ardent desire on my behalf, so I gave you permission. But when you left, I feared the Amir might embarrass you by not receiving you well. So, I stripped myself of this physical structure (هيكلي) and entered the structure (هيكل) of that Amir. I sat in his place, and when you arrived, I honored you and did what you saw. Then I returned to this physical structure. I have no need for this medicine, and I will not use it.'\n\n\"This is a person who appeared in the form of another. What then of the inhabitants of that Earth?\"\n\n### [The Soil and Fruit of the Earth of Reality]\n\nOne of the Gnostics said to me: \"When I entered this Earth, I saw an earth entirely of fragrant musk (مسك عطر). If anyone among us in this world were to smell it, he would perish due to the strength of its scent. It extends as far as Allah wills it to extend.\n\n\"I entered within this Earth an earth made of soft red gold. It contained trees entirely of gold, and their fruit was gold. One takes an apple or other fruit and eats it, finding a sweetness of taste, a pleasant fragrance, and a delight that no describer can describe. The fruit of Paradise falls short of it, so how much more so the fruit of this world? The body, form, and shape are gold, and the form and shape are like the form and shape of the fruit we know, but they differ in taste. The fruit possesses marvelous engravings and beautiful adornments that no soul can imagine, much less witness with the eye.\n\n\"I saw fruit so large that if one fruit were placed between the heaven and the earth, it would conceal the inhabitants of the earth from seeing the heaven. If it were placed on the earth, it would exceed the earth many times over. Yet, when the one who wishes to eat it grasps it with this familiar hand, he encompasses it with his grasp, for its delicacy (نعمتها) is subtler than air. He covers it with his hand despite this immense size. This is something that intellects here deem impossible in their consideration.\n\n\"When Dhū al-Nūn al-Miṣrī witnessed this, he spoke of what was narrated from him concerning the insertion of the large into the small without the large becoming small, or the small becoming large, or the narrow becoming wide, or the wide becoming narrow. The immense size of the apple, as I described it, remains, and the grasping of it by the small hand and the encompassing of it are actualized. The modality is witnessed yet unknown; only Allah knows it. This knowledge is something The Real (الحق) has kept unique to Himself.\n\n\"One temporal day (اليوم الواحد الزماني) for us is several years for them, and the durations of that Earth are varied.\n\n\"He said: I entered within it an earth of white silver, beautiful in form, with trees, rivers, and delicious fruit, all of silver. The bodies of its inhabitants are entirely of silver, just as every earth, its trees, its fruit, its rivers, its seas, and its creatures are of its own kind. When these are consumed and eaten, they possess the same taste, fragrances, and delight as other edibles, except that the pleasure is indescribable and ineffable.\n\n\"I entered within it an earth of white camphor. In some places, it is hotter than fire, yet a person wades through it and it does not burn him. Other places are temperate, and others are cold.\n\n\"Every one of these earths, which are places within this great Earth, if the heaven were placed within it, the heaven would be like a ring in a desert plain compared to it.\n\n\"Among all its lands, none is more beautiful to me or more suited to my temperament than the earth of saffron. I have never seen a world among the worlds of any earth whose inhabitants are more expansive in spirit (نفوسا) than them, nor more cheerful toward those who arrive, whom they meet with welcome and hospitality.\n\n\"Among the marvels of its edibles is that whatever you eat from it, if you cut a piece from the fruit, it grows back in its place at the very moment you cut it, filling that gap. Or, if you pluck a fruit with your hand, one exactly like it forms at the moment you pluck it, so that only the perceptive person notices it. Thus, no deficiency ever appears in it.\"\n\n### [The Women, Seas, and Vessels of the Earth of Reality]\n\nIf you look at its women, you will see that the women existing in Paradise, the Ḥūr (Houris), are, compared to them, like our women of humanity compared to the Ḥūr in the Gardens. As for intercourse with them, its pleasure is unlike any other pleasure. Its inhabitants are the most passionately loving of creation toward those who arrive among them. They have no religious obligation (تكليف); rather, they are naturally inclined (مجبولون) to glorify The Real (الحق) and His Majesty. If they attempted to do otherwise, they would be unable.\n\nAs for their buildings, some are generated by their sheer will (همهم), and others are built as we build, by using tools and fine craftsmanship.\n\nFurthermore, their seas do not mix with one another, as Allah the Exalted said: <<He has released the two seas meeting [side by side]; between them is an Isthmus (برزخ) which neither transgresses.>> (Quran 55:19-20). You witness the end of the sea of gold, its waves crashing, immediately adjacent to the sea of iron, yet nothing from one enters the other. Their water is subtler than air in movement and flow, and it is so clear that nothing of its creatures or the earth over which the sea flows is hidden from you. If you wish to drink from it, you find a pleasure in its taste that you find in no other drink whatsoever.\n\nIts creatures grow in it like other plants, without procreation. Rather, they are formed from its earth, just as insects are formed among us. No child is conceived from their water in their marriage, for their marriage is solely for the sake of pleasure and delight.\n\nAs for their vessels (مراكب), they grow large and small according to the rider's will. When they travel from one land to another, they travel by land and sea, and the speed of their movement on land and sea is faster than the eye's perception of the visible object.\n\nIts creatures vary in their states: among them are those dominated by desires, and among them are those dominated by the glorification of the Divine Presence of The Real (الحق). I saw colors there that I do not recognize among the colors of this world. I saw minerals resembling gold, yet they were neither gold nor copper, and stones of pearls so clear that the sight penetrates them, transparent like red rubies.\n\n### [Wonders of the Earth of Reality]\n\nAmong the most wondrous things in it is the perception of colors in the lower bodies that are like air, and the perception relates to their colors just as it relates to the colors in dense bodies.\n\nAt the gates of their cities are arches of ruby stones, each stone exceeding five hundred cubits, and the height of the gate in the air is immense. Upon it are hung weapons and equipment that, if all the kings of the earth gathered, they could not supply.\n\nThey possess darkness and light that succeed each other without a sun, and by their succession, they know the time. Their darkness does not veil the sight from what it perceives, just as the light does not veil it.\n\nThey raid one another without malice, enmity, or intent to cause harm. If they travel by sea and sink, the water does not overwhelm them as it overwhelms us; rather, they walk in it like its creatures walk until they reach the shore.\n\nEarthquakes occur in that Earth that, if they occurred here, the earth would be overturned and everything upon it would perish.\n\nHe said: \"One day I was with a group of them in conversation when a severe earthquake came, so intense that I saw all the buildings moving with a speed of passing and returning that the eye could not manage to perceive. We had no news of it, and we remained on a piece of the earth until the earthquake subsided. When it subsided and the earth settled, the group took my hand and offered me condolences for a daughter of mine named Fatima. I said to the group, 'I left her in good health with her mother.' They said, 'You speak the truth, but this Earth does not quake while someone is with us unless that person dies or someone related to him dies. This earthquake was for the death of your daughter. Look into her matter.'\n\n\"I sat with them for as long as Allah willed, and my companion was waiting for me. When I wished to leave them, they walked with me to the mouth of the pathway, took their robe, and I came to my house. I met my companion, who told me that Fatima was struggling. I went in to her, and she passed away. I was residing in Mecca at the time, so we prepared her and buried her in Al-Mu‘allā.\"\n\nThis is among the most wondrous things I was informed about concerning that Earth.\n\nI saw in it a Ka‘ba around which its inhabitants circumambulate, which is not covered (unveiled). It is larger than the House in Mecca, possessing four corners. It speaks to them when they circumambulate it, greets them, and imparts knowledge (علما) they did not possess.\n\nI saw in this Earth a sea of dust/earth (تراب) that flows just as water flows. I saw stones, small and large, flowing toward one another just as iron flows toward a magnet. These stones coalesce and do not separate from one another by their nature, unless separated by a separator, just as iron is separated from a magnet, though it is not in its power to resist. If left to its nature, they flow toward one another at a specific distance. These stones join together, and from them, the form of a ship is generated. I saw a small vessel and two large ships formed this way. When the ship is assembled from these stones, they launch it into the sea of dust, ride in it, and travel wherever they desire. The bottom of the ship is made of sand or dust that adheres together by specific property (لصوق الخاصية).\n\nAmong the things I saw, nothing was more wondrous than the movement of these ships in that sea. The method of construction for the vessels is the same, except that they have two great pillars on the wings of the ship near the stern, rising higher than a man's height above the vessel. The floor of the vessel at the stern, between the two pillars, is open and level with the sea, yet none of the sand of that sea enters it at all, by its specific property. This is its shape.\n\n### [Cities of the Earth of Reality]\n\nIn this Earth are cities called the Cities of Light (مدائن النور). Only the chosen and selected Gnostics (كل مصطفى مختار) enter them. They are thirteen cities, all on one surface, and their construction is wondrous.\n\nThey took a place in this Earth and built a small city there with mighty walls. A rider, if he wished to circle it, would travel for three years. When they established it, they made it a treasury for their benefits, interests, and equipment. At a distance from its sides, they erected towers that rose higher than the city's towers all around it. They extended the construction with stones until it became like a roof for the city. They made that roof an earth, upon which they built a city larger than the first one. They inhabited it and made it their dwelling. When it became too small for them, they built another city upon it, larger than the previous one. Their population continued to increase, and they continued to ascend with the construction, layer upon layer (طبقة فوق طبقة), until they reached thirteen cities.\n\n### [Kings of the Earth of Reality]\n\nThen I was absent from them for a period, and then I entered among them again. I found that they had added two more cities, one above the other.\n\nThey have kings characterized by gentleness and compassion. I accompanied a group of them, including Al-Tālī (The Successor), who is the follower, holding the rank of the Qayl among the Ḥimyar. I have never seen a king who engaged in the remembrance of Allah (ذكر الله) more than him; the remembrance of Allah preoccupied him from managing his kingdom. I benefited from him, and he frequently sat with me.\n\nAmong them is Dhū al-‘Arf (The Possessor of Recognition). He is a great king. I have never seen a king to whom more messengers come from other kings than him. He is very active, gentle, and lenient; everyone can reach him. He is subtle in descending [to meet people], but when he becomes angry, nothing can withstand his wrath. Allah has granted him power as He willed.\n\nI saw a king of their sea, whose domain is protected, called Al-Sābiḥ (The Swimmer). He rarely sits with those who seek him, and he does not pay attention to anyone except according to what occurs to him, not according to what is desired from him.\n\nAdjacent to him is a great Sultan named Al-Sābiq (The Foremost). When a visitor enters upon him, he rises from his seat, greets him cheerfully, shows joy at his arrival, and provides him with everything he needs before he even asks for anything. I asked him about this, and he said to me: \"I dislike seeing the humiliation of asking a creature on the face of the petitioner, out of zeal that no one should be humbled before other than Allah. Not everyone stands with Allah upon the footing of Unity (التوحيد), and most faces are turned toward the established means (الأسباب) while veiled from Allah. This makes me hasten to offer the honor you see to the visitor.\"\n\nHe said: I entered upon another king called Al-Qā’im bi-Amr Allāh (The One Standing by the Command of Allah). He does not pay attention to the visitor who comes to him, due to the overwhelming majesty of The Real (الحق) upon his heart, so he is unaware of the visitor. The Gnostics who visit him only do so to observe the state he is in. You see him standing, folding his hands across his chest like a humble, guilty servant, gazing down at the place of his feet. Not a hair moves from him, nor does a joint tremble, as was said of people in this state with their sultan:\n\n> As if birds were upon their heads,\n> Not from fear of injustice, but from fear of majesty.\n\nThe Gnostics learn the state of spiritual vigilance (المراقبة) from him.\n\nHe said: I saw a king called Al-Raddā‘ (The Restrainer), majestic in appearance, gentle in disposition, intensely zealous (شديد الغيرة), and constantly contemplating what he was tasked to observe. If he saw anyone deviating from the path of The Real (الحق), he would restore him to The Real. I accompanied him and benefited from him.\n\nI sat with many of their kings and saw wonders concerning their glorification of Allah that, if we were to write them down, would exhaust the scribe and the listener. Therefore, we have limited ourselves to this much concerning the marvels of this Earth.\n\nIts cities are countless in number, and its cities are more numerous than its villages. All those who rule it are eighteen Sultans, some of whom we have mentioned and some we have kept silent about. Each Sultan has a conduct and rulings that are not shared by others.\n\n### [The Order of the Kingdom of the Earth of Reality]\n\nHe said: One day I attended their court (ديوانهم) to observe their order. Among what I saw was that the King himself provides the sustenance (رزق) for his subjects, however numerous they may be. I saw that when the food was ready, an uncountable multitude of people stood, whom they call the Collectors (الجباة). They are the messengers of every household. The trustee of the kitchen gives each one according to the size of his family. The Collector takes it and departs.\n\nThe person who distributes it to them is only one individual. He has hands equal to the number of Collectors, so he serves the food for each person into his container simultaneously, and the Collector departs. Whatever remains is taken up to a treasury. When that distributor is finished with them, he enters the treasury, takes what remained, and goes out with it to the destitute (الصعاليك) who are at the gate of the King’s house, and throws it to them, and they eat it. This happens every day.\n\nEach king has a person of handsome appearance who is in charge of the treasury, whom they call the Treasurer (الخازن). In his hand is everything that the king owns. It is one of their laws that once he is appointed, the king cannot dismiss him.\n\nI saw a person among them whose movements pleased me. He was sitting next to the King, and I was on the King’s right. I asked, \"What is the status of this man among you?\" The King smiled and said, \"Did he please you?\" I said, \"Yes.\" He said, \"This is the Architect (المعمار) who builds our dwellings and cities, and all the structures you see are the result of his work.\"\n\nI saw in their money changers' market (سوق صيارفهم) that only one person validates their coinage (سكتهم) in the entire city and in all the cities under that king's authority.\n\n### [The Impossible in the World of Abode is Permissible and Actual in the Earth of Reality]\n\nHe said: Thus, I saw their conduct in every matter: only one person performs it, though he has assistants.\n\nThe people of this Earth are the people who know Allah best. Everything that the intellect deems impossible by its proof among us, we found possible and actualized in this Earth. Indeed, Allah is capable of all things. Thus, we knew that intellects (العقول) are deficient, and that Allah is capable of combining opposites, the existence of a body in two places, the subsistence of an accident (عرض) by itself and its transference, and the subsistence of a meaning (معنى) by a meaning.\n\nEvery Hadith and verse that reached us, whose literal meaning the intellect diverted, we found to be according to its literal meaning in this Earth. Every body in which a spiritual being (الروحاني) from among the angels or jinn takes form, and every image in which a person sees himself in sleep, originates from the bodies of this Earth, which has a specific place for them.\n\nThey have subtle membranes (رقائق) extending to the entire cosmos (العالم), and on each membrane is a trustee (أمين). When that trustee perceives a spirit (روح) that has prepared itself for one of the forms under his charge, he clothes it in that form, such as the form of Diḥya for Gabriel.\n\nThe reason for this is that The Real (الحق) extended this Earth in the Isthmus (البرزخ) and designated a place within it for these bodies that the spiritual beings wear, and to which souls (النفوس) transfer during sleep and after death. We are part of its world.\n\nA section of this Earth enters Paradise and is called the Market (السوق). We will show you an example of the form of the extension of the section that faces the world from this Earth:\n\nWhen a person looks at a lamp, the sun, or the moon, and then interposes the edges of his eyelids between the viewer and the luminous body, he perceives from that luminous body lines of light extending to his eyes, which are numerous. If he gradually raises those eyelids from the viewer's sight, he sees those extended lines contracting back toward the luminous body.\n\nThe luminous body is the example of the designated place in this Earth for those forms. The viewer is the example of the world. The extension of those lines is like the forms of the bodies to which the souls transfer during sleep, after death, and in the Market of Paradise, and which the spirits wear. Your intention to see those lines by the act of interposing the veiling eyelids is the example of preparedness (الاستعداد). The emanation of those lines in this state is the emanation of the forms upon preparedness. The contraction of the lines toward the luminous body upon the removal of the veil is the return of the forms to that Earth upon the cessation of preparedness.\n\nThere is no further elucidation (بيان) after this explanation. We have elaborated on the wonders of this Earth and the Gnosis (المعارف) related to it in a large book dedicated specifically to it.\n\nThe Eleventh Section is concluded.",
    "ur": "(آٹھواں باب) اس زمین کی معرفت میں جو آدم علیہ السلام کی مٹی کے خمیر کے بقیہ سے پیدا کی گئی، اور یہ حقیقت کی زمین (أرض الحقيقة) ہے، اور اس میں موجود بعض عجیب و غریب چیزوں کا ذکر۔\n\n> اے بہن، بلکہ اے میری قابل فہم پھوپھی!\n> تو ہمارے نزدیک وہ انجانی ماں ہے\n> بیٹوں نے تجھے اپنے باپ کی بہن سمجھ کر دیکھا،\n> تو وہ بندھی ہوئی ہمت کے ساتھ مقابلہ کرنے لگے\n> مگر بیٹوں میں سے تھوڑے ہی ایسے ہیں،\n> جنہوں نے جبلی (فطری) جانوں کے ساتھ تجھ پر مہربانی کی\n> اے میری پھوپھی! بتا کہ بھائی نے اپنا راز تجھ میں کیسے ظاہر کیا،\n> اس کی تنزیل (نزول) کو محقق کرتے ہوئے؟\n> یہاں تک کہ تیری ہی ذات کی مانند ایک عالم ظاہر ہوا،\n> جسے ربِ مخلوقات اپنی وکالت کے لیے پسند کرتا ہے۔\n> تو امامت ہے اور امام تیرا بھائی ہے،\n> اور مقتدی اس کی کھینچی ہوئی مثالیں ہیں۔\n\n### [کھجور کا درخت آدم کی بہن]\n\nجان لو کہ جب اللہ تعالیٰ نے آدم علیہ السلام کو پیدا کیا جو کہ پہلا انسانی جسم تھا جس کی تخلیق ہوئی اور اسے انسانی اجسام کے وجود کی اصل بنایا، اور ان کی مٹی کے خمیر سے کچھ بقیہ بچا، تو اس بقیہ سے کھجور کا درخت (النخلة) پیدا کیا گیا۔ پس یہ آدم علیہ السلام کی بہن ہے اور یہ ہمارے لیے پھوپھی ہے۔ شریعت نے اسے پھوپھی کا نام دیا ہے اور اسے مومن سے تشبیہ دی ہے۔ اس میں دیگر نباتات کے مقابلے میں عجیب و غریب راز پائے جاتے ہیں۔ اور کھجور کے درخت کی تخلیق کے بعد بھی اس مٹی سے ایک تل کے برابر بقیہ بچا جو پوشیدگی میں تھا۔ پس اللہ نے اس بقیہ کو ایک وسیع فضا والی زمین میں پھیلا دیا۔ اگر عرش اور جو کچھ اس میں ہے، اور کرسی، اور آسمان و زمینیں، اور جو کچھ تحت الثریٰ میں ہے، اور تمام جنتیں اور دوزخ، سب اس زمین میں رکھ دیے جائیں تو یہ سب اس میں ایسے ہوں گے جیسے کسی چٹیل میدان میں پڑا ہوا ایک حلقہ۔ اور اس میں ایسی عجیب و غریب چیزیں ہیں جن کا اندازہ نہیں لگایا جا سکتا اور جن کا معاملہ عقلوں کو حیران کر دیتا ہے۔ اور اس میں ہر سانس میں اللہ نے ایسے عالم پیدا کیے ہیں جو \"رات دن تسبیح کرتے ہیں اور تھکتے نہیں (يُسَبِّحُونَ اللَّيْلَ والنَّهارَ لا يَفْتُرُونَ)\"۔ اور اس زمین میں اللہ کی عظمت ظاہر ہوئی ہے اور اس کی قدرت ان لوگوں کے نزدیک عظیم ہو گئی ہے جو اس کا مشاہدہ (الشہود) کرتے ہیں۔ اور بہت سے عقلی محالات (المحالات العقلية) جن کے باطل ہونے پر صحیح عقلی دلیل قائم ہے، وہ اس زمین میں موجود ہیں۔ اور یہ اللہ کے عارف علماء (العارفين العلماء بالله) کی آنکھوں کی جولان گاہ ہے اور وہ اسی میں گھومتے ہیں۔ اور اللہ نے اس کے عوالم میں سے ایک عالم کو ہماری صورت پر پیدا کیا ہے۔ جب عارف انہیں دیکھتا ہے تو وہ خود کو ان میں دیکھتا ہے۔ عبداللہ بن عباس رضی اللہ عنہ نے بھی اسی طرح کی طرف اشارہ کیا ہے، جیسا کہ ان سے اس کعبہ کے بارے میں روایت کیا گیا ہے کہ یہ چودہ گھروں میں سے ایک گھر ہے، اور یہ کہ ساتوں زمینوں میں ہم جیسی مخلوق ہے، یہاں تک کہ ان میں مجھ جیسا ابن عباس بھی ہے۔ اور یہ روایت اہل کشف (الکشف) کے نزدیک سچی ہے۔\n\n### [حقیقت کی زمین میں مجلس رحمت]\n\nاب ہم اس زمین کے ذکر، اس کی وسعت اور اس میں پیدا کیے گئے عوالم کی کثرت کی طرف لوٹتے ہیں۔ اور عارفین کے لیے اس میں ظہور الٰہی (التجلی) واقع ہوتے ہیں۔ ایک عارف نے ایک ایسے معاملے کے بارے میں بتایا جسے میں نے مشاہدہ (الشہود) سے جانا ہے، اس نے کہا: میں ایک دن اس میں داخل ہوا، ایک مجلس میں جسے مجلس رحمت کہا جاتا ہے۔ میں نے کبھی اس سے زیادہ حیرت انگیز مجلس نہیں دیکھی۔ جب میں اس میں تھا، تو مجھ پر ایک ظہور الٰہی (التجلی) ظاہر ہوا جس نے مجھے مجھ سے دور نہیں کیا بلکہ میرے ساتھ ہی باقی رکھا۔ اور یہ اس زمین کی خاصیت ہے۔ کیونکہ اس دنیا میں ان ہیاکل (جسمانی ڈھانچوں) میں عارفین پر وارد ہونے والے ظہور الٰہی (التجلی) انہیں ان سے دور کر دیتے ہیں اور انبیاء اور اولیاء میں سے ہر اس شخص کو جو اس کا تجربہ کرتا ہے، ان کے مشاہدہ (الشہود) سے فنا (الفناء) کر دیتے ہیں۔ اسی طرح آسمانِ علوی، کرسیِ ازہیٰ، اور عرشِ محیطِ اعلیٰ کے عالم کو جب ظہور الٰہی (التجلی) ہوتا ہے تو وہ انہیں ان سے دور کر دیتا ہے اور وہ بے ہوش ہو جاتے ہیں۔ لیکن یہ زمین ایسی ہے کہ جب صاحب کشف (الکشف) عارف اس میں موجود ہوتا ہے اور اس پر ظہور (التجلی) واقع ہوتا ہے تو وہ اسے اس کے مشاہدہ (الشہود) سے فنا (الفناء) نہیں کرتا اور نہ ہی اس کے وجود سے اسے اچک لیتا ہے، بلکہ اس کے لیے رؤیت (دیکھنا) اور کلام (بات کرنا) دونوں کو جمع کر دیتا ہے۔ اس نے کہا: اور اس مجلس میں میرے ساتھ ایسے امور اور راز پیش آئے جن کا ذکر ان کے معانی کی گہرائی اور اس طرح کے مشاہدات کو دیکھنے سے پہلے ادراکات کی عدم رسائی کی وجہ سے میرے لیے ممکن نہیں ہے۔ اور اس میں ایسے باغات، جنتیں، حیوانات اور معدنیات ہیں جن کی قدر صرف اللہ تعالیٰ ہی جانتا ہے۔ اور اس میں یہ سب کچھ زندہ اور ناطق ہے، جیسے ہر زندہ ناطق کی زندگی ہوتی ہے، لیکن یہ اس طرح نہیں ہے جیسے دنیا میں چیزیں ہیں۔ اور یہ باقی رہنے والی ہیں، نہ فنا ہوتی ہیں، نہ بدلتی ہیں، اور نہ ہی ان کا عالم مرتا ہے۔ اور یہ زمین بشری، طبعی، مٹی کے اجسام میں سے کسی چیز کو قبول نہیں کرتی، سوائے اپنے عالم کے یا ہم میں سے ارواح (الأرواح) کے عالم کو خاصیت کے ذریعے۔ اور جب عارفین اس میں داخل ہوتے ہیں تو وہ صرف اپنی ارواح کے ساتھ داخل ہوتے ہیں، اپنے اجسام کے ساتھ نہیں۔ وہ اپنے ہیاکل (جسمانی ڈھانچوں) کو اس دنیا کی زمین میں چھوڑ دیتے ہیں اور مجرد ہو جاتے ہیں۔\n\n### [حقیقت کی زمین میں داخلے کے مراسم]\n\nاور اس زمین میں عجیب و غریب نشوونما اور انوکھی تخلیق کی صورتیں ہیں جو ان راستوں (السکک) کے دہانوں پر کھڑی ہیں جو اس عالم کی طرف جھانکتے ہیں جس میں ہم ہیں، یعنی زمین، آسمان، جنت اور دوزخ۔ پس جب ہم میں سے کوئی عارف اس زمین میں داخل ہونا چاہتا ہے، خواہ وہ انسان، جن، فرشتہ یا اہل جنت میں سے ہو، بشرطیکہ وہ معرفت (المعرفۃ) رکھتا ہو اور اپنے ہیکل سے مجرد ہو جائے، تو وہ ان صورتوں کو راستوں کے دہانوں پر کھڑا ہوا پاتا ہے، جنہیں اللہ سبحانہ و تعالیٰ نے اس کام کے لیے مقرر کیا ہے۔ ان میں سے ایک اس داخل ہونے والے کی طرف لپکتا ہے اور اسے اس کے مقام کے مطابق ایک خلعت پہناتا ہے، اور اس کا ہاتھ پکڑ کر اسے اس زمین میں گھماتا ہے اور وہ جہاں چاہے وہاں ٹھہرتا ہے اور اللہ کی مصنوعات پر غور کرتا ہے۔ اور وہ کسی پتھر، درخت، مٹی کے ڈھیلے یا کسی بھی چیز کے پاس سے نہیں گزرتا جس سے وہ بات کرنا چاہے مگر وہ اس سے بات کرتی ہے، جیسے کوئی شخص اپنے ساتھی سے بات کرتا ہے۔ اور ان کی مختلف زبانیں ہیں۔ اور یہ زمین خاصیت کے ذریعے ہر داخل ہونے والے کو اس میں موجود تمام زبانوں کی سمجھ عطا کرتی ہے۔ پس جب وہ اپنی ضرورت پوری کر لیتا ہے اور اپنی جگہ واپس جانا چاہتا ہے، تو اس کا ساتھی اس کے ساتھ چلتا ہے یہاں تک کہ اسے اس جگہ پہنچا دیتا ہے جہاں سے وہ داخل ہوا تھا، اسے الوداع کہتا ہے اور وہ خلعت جو اسے پہنائی تھی، اتار لیتا ہے اور اس سے جدا ہو جاتا ہے۔ اور اس نے بہت سے علوم اور دلائل حاصل کر لیے ہوتے ہیں اور اللہ کے بارے میں اس کے علم میں وہ اضافہ ہو جاتا ہے جو اس کے پاس مشاہدہ (الشہود) کے ذریعے نہیں تھا۔ اور میں نے نہیں دیکھا کہ فہم اتنی تیزی سے ختم ہو جائے جتنا کہ وہ اس زمین میں حاصل ہونے کے بعد ختم ہوتا ہے۔\n\n### [شیخ اوحد الدین کرمانی کا اپنے شیخ کے ساتھ واقعہ]\n\nاور اس دنیا اور اس نشأة میں ہمارے سامنے ایسی چیزیں ظاہر ہوئی ہیں جو اس قول کی تائید کرتی ہیں۔ ان میں سے وہ ہیں جن کا میں نے مشاہدہ کیا اور میں ان کا ذکر نہیں کروں گا۔ اور ان میں سے وہ ہے جو مجھے اوحد الدین حامد بن ابی الفخر کرمانی نے بیان کیا، اللہ اسے توفیق دے، اس نے کہا: میں جوانی میں ایک شیخ کی خدمت کرتا تھا۔ شیخ بیمار ہو گئے اور انہیں اسہال ہو گیا تھا۔ جب ہم تکریت پہنچے تو میں نے ان سے کہا: اے میرے آقا! مجھے اجازت دیں کہ میں سنجار کے مارستان (ہسپتال) کے صاحب سبیل سے آپ کے لیے کوئی روکنے والی دوا لاؤں۔ جب انہوں نے میری بے چینی دیکھی تو مجھ سے کہا: اس کے پاس جاؤ۔ اس نے کہا: میں صاحب سبیل کے پاس گیا، وہ اپنے خیمے میں بیٹھا تھا اور اس کے آدمی اس کے سامنے کھڑے تھے اور شمع اس کے سامنے تھی۔ وہ مجھے نہیں جانتا تھا اور نہ میں اسے جانتا تھا۔ اس نے مجھے جماعت کے درمیان کھڑا دیکھا تو میری طرف اٹھا اور میرا ہاتھ پکڑا، میری عزت کی اور پوچھا: تمہاری کیا ضرورت ہے؟ میں نے شیخ کا حال بیان کیا۔ اس نے دوا منگوائی اور مجھے دے دی اور میری خدمت میں میرے ساتھ باہر نکلا، اور خادم شمع لے کر اس کے آگے چل رہا تھا۔ مجھے ڈر ہوا کہ شیخ اسے دیکھ کر شرمندہ ہوں گے، تو میں نے اسے قسم دی کہ وہ واپس چلا جائے۔ وہ واپس چلا گیا۔ میں شیخ کے پاس آیا اور انہیں دوا دی اور امیر صاحب سبیل کی میرے ساتھ کی گئی کرامت کا ذکر کیا۔ شیخ مسکرائے اور مجھ سے کہا: اے میرے بیٹے! میں نے تمہاری خاطر تمہاری بے چینی دیکھ کر تم پر شفقت کی اور تمہیں اجازت دی۔ جب تم چلے گئے تو مجھے ڈر ہوا کہ امیر تمہاری طرف توجہ نہ دے کر تمہیں شرمندہ کرے گا، تو میں نے اپنے اس ہیکل (جسمانی ڈھانچے) سے تجرد اختیار کیا اور اس امیر کے ہیکل میں داخل ہو گیا اور اس کی جگہ بیٹھ گیا۔ جب تم آئے تو میں نے تمہاری عزت کی اور تمہارے ساتھ وہ سب کیا جو تم نے دیکھا، پھر میں اپنے اس ہیکل میں واپس آ گیا۔ اور مجھے اس دوا کی کوئی ضرورت نہیں ہے اور میں اسے استعمال نہیں کروں گا۔ پس یہ ایک شخص ہے جو دوسرے کی صورت میں ظاہر ہوا، تو پھر اس زمین کے لوگوں کا کیا حال ہو گا؟\n\n### [حقیقت کی زمین کی مٹی اور اس کا پھل]\n\nبعض عارفین نے مجھ سے کہا: جب میں اس زمین میں داخل ہوا تو میں نے اس میں ایک ایسی زمین دیکھی جو پوری کی پوری خوشبودار مشک کی تھی، اگر ہم میں سے کوئی اسے اس دنیا میں سونگھ لے تو اس کی خوشبو کی شدت سے ہلاک ہو جائے گا۔ یہ جہاں تک اللہ چاہے پھیلی ہوئی ہے۔ اور میں اس زمین میں سرخ نرم سونے کی ایک زمین میں داخل ہوا، جس میں تمام درخت سونے کے تھے اور ان کا پھل بھی سونے کا تھا۔ وہ سیب یا کوئی اور پھل لیتا اور اسے کھاتا تو اس کے ذائقے کی لذت، خوشبو کی عمدگی اور نعمت کو ایسا پاتا کہ کوئی بیان کرنے والا اسے بیان نہیں کر سکتا۔ جنت کا پھل بھی اس کے سامنے کم پڑ جاتا ہے، تو دنیا کے پھل کا کیا کہنا۔ اور جسم، شکل اور صورت سونے کی ہوتی ہے، اور صورت اور شکل ہمارے ہاں کے پھل کی صورت اور شکل جیسی ہوتی ہے، لیکن ذائقے میں مختلف ہوتی ہے۔ اور پھل میں ایسی انوکھی نقش و نگاری اور خوبصورت سجاوٹ ہوتی ہے جس کا کوئی نفس تصور بھی نہیں کر سکتا، چہ جائیکہ کوئی آنکھ اسے دیکھ سکے۔ اور میں نے اس کے پھلوں کو اتنا بڑا دیکھا کہ اگر ایک پھل کو آسمان اور زمین کے درمیان رکھ دیا جائے تو وہ اہل زمین کو آسمان دیکھنے سے روک دے، اور اگر اسے زمین پر رکھ دیا جائے تو وہ زمین سے کئی گنا زیادہ ہو جائے۔ اور جب اسے کھانے کا ارادہ کرنے والا اس جانے پہچانے ہاتھ سے پکڑتا ہے تو وہ اپنی گرفت میں اسے گھیر لیتا ہے، اس کی نزاکت کی وجہ سے جو ہوا سے بھی زیادہ لطیف ہے۔ وہ اس عظمت کے باوجود اس پر اپنا ہاتھ بند کر لیتا ہے۔ اور یہ وہ چیز ہے جسے عقلیں یہاں اپنے نقطہ نظر سے محال قرار دیتی ہیں۔ اور جب ذوالنون مصری نے اس کا مشاہدہ کیا تو انہوں نے وہی بات کہی جو ان سے روایت کی گئی ہے کہ بڑے کا چھوٹے پر وارد ہونا، بغیر اس کے کہ بڑا چھوٹا ہو جائے یا چھوٹا بڑا ہو جائے، یا تنگ کشادہ ہو جائے یا کشادہ تنگ ہو جائے۔ پس سیب میں وہ عظمت جو میں نے بیان کی، باقی رہتی ہے، اور چھوٹے ہاتھ سے اسے پکڑنا اور اس کا احاطہ کرنا موجود ہوتا ہے، اور کیفیت مشاہدہ شدہ مگر مجہول ہوتی ہے، جسے صرف اللہ ہی جانتا ہے۔ اور یہ علم ان علوم میں سے ہے جن میں حق تعالیٰ منفرد ہے۔ اور ہمارے ہاں کا ایک زمانی دن ان کے ہاں کئی سالوں کے برابر ہوتا ہے۔ اور اس زمین کے زمانے مختلف ہیں۔ اس نے کہا: اور میں اس میں ایک سفید چاندی کی زمین میں داخل ہوا، جو صورت میں درختوں، نہروں اور لذیذ پھلوں والی تھی، یہ سب چاندی کے تھے۔ اور اس کے باشندوں کے اجسام بھی اسی جنس کے، سب چاندی کے تھے۔ اور اسی طرح ہر زمین، اس کے درخت، اس کے پھل، اس کی نہریں، اس کے سمندر اور اس کی مخلوق اسی جنس کی ہوتی ہے۔ پس جب انہیں کھایا جاتا ہے تو ان میں ذائقہ، خوشبو اور نعمت وہی پائی جاتی ہے جو دیگر کھانوں میں ہوتی ہے، مگر لذت ناقابل بیان اور ناقابل ذکر ہوتی ہے۔ اور میں اس میں سفید کافور کی ایک زمین میں داخل ہوا، جو اس کے بعض مقامات پر آگ سے بھی زیادہ گرم تھی، انسان اس میں سے گزرتا ہے اور وہ اسے نہیں جلاتی۔ اور اس کے بعض مقامات معتدل اور بعض ٹھنڈے ہیں۔ اور اس بڑی زمین میں موجود ان زمینوں میں سے ہر زمین ایسی ہے کہ اگر آسمان کو اس میں رکھ دیا جائے تو وہ اس کے مقابلے میں چٹیل میدان میں ایک حلقے کی مانند ہو گا۔ اور اس کی تمام زمینوں میں مجھے زعفران کی زمین سے زیادہ خوبصورت اور میرے مزاج کے مطابق کوئی چیز نہیں ملی۔ اور میں نے کسی بھی زمین کے عالم کو ان سے زیادہ کشادہ دل اور اپنے پاس آنے والوں سے زیادہ خوش اخلاق نہیں دیکھا، وہ ان کا استقبال خوش آمدید اور اہلاً و سہلاً کہہ کر کرتے ہیں۔ اور اس کے کھانوں کی عجیب و غریب چیزوں میں سے یہ ہے کہ تم اس میں سے جو بھی چیز کھاؤ، جب تم پھل کا ایک ٹکڑا کاٹتے ہو، تو اسی وقت اس کی جگہ وہ چیز اگ آتی ہے جو اس خلا کو بھر دیتی ہے، یا تم اپنے ہاتھ سے اس کا کوئی پھل توڑتے ہو، تو تمہارے توڑنے کے وقت ہی اس جیسا پھل بن جاتا ہے، جسے صرف سمجھدار ہی محسوس کر سکتا ہے۔ پس اس میں کوئی کمی ظاہر نہیں ہوتی۔\n\n### [حقیقت کی زمین کی عورتیں، سمندر اور کشتیاں]\n\nاور جب تم اس کی عورتوں کو دیکھتے ہو، تو جنت میں موجود حوریں ان کے مقابلے میں ایسی ہیں جیسے جنتوں میں حوروں کے مقابلے میں ہماری بشری عورتیں ہیں۔ اور ان سے مباشرت کی لذت کسی اور لذت سے مشابہت نہیں رکھتی۔ اور اس کے باشندے ان لوگوں سے سب سے زیادہ عشق کرنے والے ہیں جو ان کے پاس آتے ہیں۔ اور ان پر کوئی تکلیف نہیں ہے، بلکہ وہ حق تعالیٰ کی تعظیم اور جلال پر فطری طور پر پیدا کیے گئے ہیں، اگر وہ اس کے خلاف ارادہ بھی کریں تو نہیں کر سکتے۔ اور ان کی عمارتیں، ان میں سے کچھ ان کے ارادے سے وجود میں آتی ہیں، اور کچھ اس طرح بنتی ہیں جیسے ہمارے ہاں آلات کے استعمال اور عمدہ کاریگری سے بنائی جاتی ہیں۔ پھر ان کے سمندر آپس میں نہیں ملتے، جیسا کہ اللہ تعالیٰ نے فرمایا: \"اس نے دو سمندروں کو ملا دیا جو آپس میں ملتے ہیں، ان کے درمیان ایک پردہ ہے جس سے وہ تجاوز نہیں کرتے (مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ)\"۔ پس تم سونے کے سمندر کی انتہا دیکھتے ہو، اس کی لہریں ٹکرا رہی ہوتی ہیں، اور لوہے کا سمندر اس کے ساتھ متصل ہوتا ہے، لیکن ایک کا پانی دوسرے میں بالکل داخل نہیں ہوتا۔ اور ان کا پانی حرکت اور بہاؤ میں ہوا سے زیادہ لطیف ہوتا ہے، اور وہ اتنا صاف ہوتا ہے کہ اس کی کوئی بھی مچھلی یا وہ زمین جس پر سمندر بہہ رہا ہے، تم سے پوشیدہ نہیں رہتی۔ پس جب تم اس میں سے پینا چاہتے ہو تو تمہیں اس میں ایسی لذت ملتی ہے جو تمہیں کسی بھی مشروب میں نہیں ملتی۔ اور اس کی مخلوق اس میں دیگر نباتات کی طرح اگتی ہے، بغیر تناسل کے، بلکہ وہ اس کی زمین سے ایسے ہی بنتے ہیں جیسے ہمارے ہاں حشرات بنتے ہیں۔ اور ان کے نکاح میں ان کے پانی سے کوئی اولاد پیدا نہیں ہوتی، بلکہ ان کا نکاح صرف شہوت اور نعمت کے لیے ہوتا ہے۔ اور ان کی کشتیاں سوار کی مرضی کے مطابق بڑی اور چھوٹی ہو جاتی ہیں۔ اور جب وہ ایک شہر سے دوسرے شہر کا سفر کرتے ہیں تو وہ خشکی اور سمندر کے ذریعے سفر کرتے ہیں، اور ان کی خشکی اور سمندر میں چلنے کی رفتار دیکھنے والے کی بصارت کے ادراک سے بھی زیادہ تیز ہوتی ہے۔ اور اس کی مخلوق احوال میں مختلف ہوتی ہے، ان میں سے کچھ ایسے ہیں جن پر شہوات غالب ہوتی ہیں، اور کچھ ایسے ہیں جن پر جناب حق کی تعظیم غالب ہوتی ہے۔ اور میں نے اس میں ایسے رنگ دیکھے جنہیں میں دنیا کے رنگوں میں نہیں پہچانتا۔ اور میں نے اس میں ایسی معدنیات دیکھیں جو سونے سے مشابہت رکھتی ہیں مگر نہ وہ سونا ہیں اور نہ تانبا۔ اور موتیوں کے ایسے پتھر دیکھے جنہیں بصارت ان کی صفائی کی وجہ سے پار کر جاتی ہے، وہ سرخ یاقوت کی طرح شفاف ہوتے ہیں۔\n\n### [حقیقت کی زمین کے عجائبات]\n\nاور اس میں سب سے زیادہ عجیب چیز یہ ہے کہ نچلے اجسام میں رنگوں کا ادراک ہوتا ہے جو ہوا کی طرح ہوتے ہیں، اور ادراک ان کے رنگوں سے ایسے ہی متعلق ہوتا ہے جیسے ٹھوس اجسام میں موجود رنگوں سے متعلق ہوتا ہے۔ اور اس کے شہروں کے دروازوں پر یاقوتی پتھروں کے محراب ہیں، ان میں سے ہر پتھر پانچ سو ذراع سے زیادہ بڑا ہے۔ اور دروازے کی بلندی ہوا میں بہت زیادہ ہے، اور اس پر ایسے ہتھیار اور ساز و سامان لٹکے ہوئے ہیں کہ اگر پوری زمین کے بادشاہ جمع ہو جائیں تو وہ انہیں پورا نہیں کر سکتے۔ اور ان کے ہاں سورج کے بغیر تاریکی اور روشنی کا ایک سلسلہ ہے جو باری باری آتا ہے، اور اسی کی باری باری آمد سے وہ وقت کو پہچانتے ہیں۔ اور ان کی تاریکی بصارت کو اس کے مدرک سے نہیں روکتی، جیسے روشنی نہیں روکتی۔ اور وہ آپس میں ایک دوسرے پر حملہ کرتے ہیں، بغیر کسی بغض، دشمنی یا نیت کی خرابی کے۔ اور جب وہ سمندر میں سفر کرتے ہیں اور ڈوب جاتے ہیں، تو پانی ان پر ایسے غالب نہیں آتا جیسے ہم پر آتا ہے، بلکہ وہ اس میں ایسے چلتے ہیں جیسے اس کے جانور چلتے ہیں، یہاں تک کہ وہ ساحل پر پہنچ جاتے ہیں۔ اور اس زمین پر ایسے زلزلے آتے ہیں کہ اگر وہ ہم پر آ جائیں تو زمین الٹ جائے اور جو کچھ اس پر ہے وہ ہلاک ہو جائے۔ اس نے کہا: میں ایک دن ان میں سے ایک جماعت کے ساتھ بات چیت میں تھا، اور ایک شدید زلزلہ آیا، یہاں تک کہ میں نے عمارتوں کو پوری طرح حرکت کرتے دیکھا، اتنی تیزی سے حرکت کرتے ہوئے کہ بصارت ان کی حرکت کی رفتار کو آتے جاتے ہوئے ٹھیک سے نہیں دیکھ سکتی تھی۔ اور ہمیں کوئی خبر نہیں تھی، اور ہم زمین کے ایک ٹکڑے پر تھے، یہاں تک کہ زلزلہ ختم ہو گیا۔ جب وہ ختم ہوا اور زمین ساکن ہو گئی، تو جماعت نے میرا ہاتھ پکڑا اور میری بیٹی فاطمہ کی موت پر مجھے تعزیت پیش کی۔ میں نے جماعت سے کہا: میں تو اسے اس کی والدہ کے پاس عافیت سے چھوڑ کر آیا تھا۔ انہوں نے کہا: تم سچ کہتے ہو، لیکن یہ زمین ہمارے ہاں کسی کے ہوتے ہوئے زلزلہ نہیں لاتی مگر یہ کہ وہ شخص مر جائے یا اس کا کوئی عزیز مر جائے۔ اور یہ زلزلہ تمہاری بیٹی کی موت کے لیے آیا ہے۔ پس اس کے معاملے میں غور کرو۔ میں ان کے ساتھ بیٹھا رہا جب تک اللہ نے چاہا، اور میرا ساتھی میرا انتظار کر رہا تھا۔ جب میں نے ان سے جدا ہونے کا ارادہ کیا، تو وہ میرے ساتھ راستے کے دہانے تک چلے اور مجھ سے میری خلعت لے لی۔ اور میں اپنے گھر آیا تو اپنے ساتھی سے ملا، اس نے مجھ سے کہا کہ فاطمہ نزع کی حالت میں ہے۔ میں اس کے پاس داخل ہوا تو اس کی روح پرواز کر چکی تھی۔ اور میں مکہ میں مجاور تھا، تو ہم نے اسے تیار کیا اور اسے معلیٰ میں دفن کر دیا۔ پس یہ ان عجیب ترین چیزوں میں سے ہے جو مجھے اس زمین کے بارے میں بتائی گئیں۔ اور میں نے وہاں ایک کعبہ دیکھا جس کا طواف اس کے باشندے کرتے ہیں، وہ بغیر غلاف کے ہوتا ہے، اور وہ مکہ کے گھر سے بڑا ہوتا ہے، اس کے چار کونے ہوتے ہیں، جب وہ اس کا طواف کرتے ہیں تو وہ ان سے بات کرتا ہے اور انہیں سلام کرتا ہے اور انہیں ایسے علوم سکھاتا ہے جو ان کے پاس نہیں تھے۔ اور میں نے اس زمین میں مٹی کا ایک سمندر دیکھا جو ایسے بہتا ہے جیسے پانی بہتا ہے۔ اور میں نے چھوٹے اور بڑے پتھر دیکھے جو ایک دوسرے کی طرف ایسے دوڑتے ہیں جیسے لوہا مقناطیس کی طرف دوڑتا ہے۔ پس یہ پتھر آپس میں مل جاتے ہیں اور اپنی فطرت کے مطابق ایک دوسرے سے جدا نہیں ہوتے، مگر یہ کہ کوئی جدا کرنے والا انہیں جدا کرے، جیسے لوہے کو مقناطیس سے جدا کیا جاتا ہے، اس میں اتنی طاقت نہیں ہوتی کہ وہ مزاحمت کرے۔ پس جب اسے اس کی فطرت پر چھوڑ دیا جاتا ہے، تو وہ ایک مخصوص فاصلے سے ایک دوسرے کی طرف دوڑتے ہیں، پس یہ پتھر آپس میں مل کر ایک کشتی کی صورت اختیار کر لیتے ہیں۔ اور میں نے ان میں سے ایک چھوٹی کشتی اور دو بڑے جہاز دیکھے۔ پس جب کشتی ان پتھروں سے مکمل ہو جاتی ہے، تو وہ اسے مٹی کے سمندر میں ڈال دیتے ہیں اور اس میں سوار ہو کر جہاں چاہتے ہیں سفر کرتے ہیں۔ مگر کشتی کا پیندا ریت یا مٹی کا ہوتا ہے جو خاصیت کے ذریعے آپس میں چپک جاتا ہے۔ پس جو کچھ میں نے دیکھا، ان میں سے اس سمندر میں ان کشتیوں کے چلنے اور کشتیوں کی ساخت کی تخلیق سے زیادہ عجیب کوئی چیز نہیں دیکھی۔ البتہ ان کی کشتی کے دونوں پروں میں، جو پچھلے حصے کی طرف ہوتے ہیں، دو بڑے ستون ہوتے ہیں جو کشتی سے قد سے زیادہ اونچے ہوتے ہیں، اور کشتی کا پچھلا حصہ دونوں ستونوں کے درمیان کھلا ہوتا ہے اور سمندر کے ساتھ برابر ہوتا ہے، اور اس سمندر کی ریت کا کوئی حصہ خاصیت کے ذریعے اس میں بالکل داخل نہیں ہوتا۔ اور یہ اس کی شکل ہے۔\n\n### [حقیقت کی زمین کے شہر]\n\nاور اس زمین میں ایسے شہر ہیں جنہیں نور کے شہر کہا جاتا ہے، ان میں عارفین میں سے صرف ہر چنا ہوا اور منتخب شخص ہی داخل ہوتا ہے۔ اور یہ تیرہ شہر ہیں، اور یہ ایک ہی سطح پر ہیں، اور ان کی عمارت عجیب ہے۔ وہ اس طرح کہ انہوں نے اس زمین میں ایک جگہ کا ارادہ کیا اور وہاں ایک چھوٹا شہر بنایا جس کی دیواریں عظیم تھیں، سوار اگر اس کا چکر لگانا چاہے تو اسے تین سال کا سفر طے کرنا پڑے۔ جب انہوں نے اسے قائم کر لیا، تو اسے اپنے فوائد، مصلحتوں اور ساز و سامان کا خزانہ بنا لیا۔ اور اس کے اطراف میں کچھ فاصلے پر ایسے برج قائم کیے جو شہر کے برجوں سے بلند تھے۔ اور انہوں نے پتھروں سے عمارت کو بڑھایا یہاں تک کہ وہ شہر کے لیے گھر کی چھت کی طرح ہو گیا۔ اور انہوں نے اس چھت کو ایک زمین بنا دیا، جس پر انہوں نے پہلے سے بڑا ایک اور شہر بنایا اور اسے آباد کیا اور اسے رہائش گاہ بنا لیا۔ جب وہ ان کے لیے تنگ ہو گیا، تو انہوں نے اس پر ایک اور شہر بنایا جو اس سے بڑا تھا۔ اور اس کے آباد کار بڑھتے رہے اور وہ عمارت کو ایک کے اوپر ایک منزل بناتے رہے یہاں تک کہ وہ تیرہ شہروں تک پہنچ گئے۔\n\n### [حقیقت کی زمین کے بادشاہ]\n\nپھر میں ان سے کچھ مدت کے لیے غائب رہا، پھر ایک بار دوبارہ ان کے پاس داخل ہوا تو میں نے دیکھا کہ انہوں نے دو مزید شہروں کا اضافہ کر لیا ہے، ایک کے اوپر دوسرا۔ اور ان کے بادشاہوں میں لطف اور شفقت پائی جاتی ہے۔ میں نے ان میں سے ایک جماعت کی صحبت اختیار کی، ان میں سے ایک التالی (پیروکار) ہے جو حمیریوں میں قیل (سردار) کے درجے میں ہے۔ میں نے کوئی بادشاہ ایسا نہیں دیکھا جو اس سے زیادہ ذکر اللہ کرتا ہو، ذکر اللہ نے اسے اپنی بادشاہت کی تدبیر سے مشغول کر رکھا تھا۔ مجھے اس سے فائدہ ہوا اور وہ میرے ساتھ کثرت سے بیٹھتا تھا۔ اور ان میں سے ایک ذو العرف ہے، جو ایک عظیم بادشاہ ہے۔ میں نے زمین کے بادشاہوں میں سے کسی کو ایسا نہیں دیکھا جس کے پاس اس سے زیادہ بادشاہوں کے قاصد آتے ہوں۔ وہ بہت زیادہ حرکت کرنے والا، نرم خو اور ملنسار ہے۔ ہر کوئی اس تک پہنچ سکتا ہے، وہ نیچے آنے میں نرمی برتتا ہے، لیکن جب وہ غصہ ہوتا ہے تو کوئی چیز اس کے غصے کے سامنے کھڑی نہیں ہو سکتی۔ اللہ نے اسے جو قوت چاہی عطا کی۔ اور میں نے ان کے سمندر کے لیے ایک بادشاہ دیکھا جو اپنی حدود کی حفاظت کرنے والا ہے، اسے السابح (تیرنے والا) کہا جاتا ہے۔ وہ ان لوگوں کے ساتھ کم بیٹھتا ہے جو اس کے پاس آتے ہیں، اور وہ کسی کی طرف زیادہ توجہ نہیں دیتا، مگر جو اس کے دل میں آتا ہے، اس کے ساتھ ہوتا ہے، نہ کہ جو اس سے چاہا جاتا ہے۔ اور اس کے پڑوس میں ایک عظیم سلطان ہے جس کا نام السابق (سبقت کرنے والا) ہے۔ جب کوئی آنے والا اس کے پاس داخل ہوتا ہے تو وہ اپنی جگہ سے اٹھ کر اس کی طرف جاتا ہے اور اس کے چہرے پر مسکراہٹ لاتا ہے اور اس کی آمد پر خوشی کا اظہار کرتا ہے، اور اس سے کچھ پوچھنے سے پہلے ہی اس کی تمام ضروریات پوری کر دیتا ہے۔ میں نے اس سے اس بارے میں پوچھا تو اس نے مجھ سے کہا: میں اس بات کو ناپسند کرتا ہوں کہ سائل کے چہرے پر مخلوق سے سوال کرنے کی ذلت دیکھوں، یہ غیرت کی وجہ سے ہے کہ کوئی غیر اللہ کے لیے ذلیل ہو۔ اور ہر کوئی توحید کے قدم پر اللہ کے ساتھ کھڑا نہیں ہوتا، اور اکثر چہرے اسباب کی طرف متوجہ ہوتے ہیں جو اللہ سے حجاب کے ساتھ رکھے گئے ہیں۔ پس یہ چیز مجھے اس بات پر آمادہ کرتی ہے کہ میں آنے والے کی عزت و تکریم میں پہل کروں جو تم دیکھتے ہو۔ اس نے کہا: اور میں ایک اور بادشاہ کے پاس داخل ہوا جسے القائم بأمر اللہ (اللہ کے حکم سے قائم رہنے والا) کہا جاتا ہے۔ وہ اپنے پاس آنے والے کی طرف توجہ نہیں دیتا، کیونکہ حق تعالیٰ کی عظمت اس کے دل پر غالب ہوتی ہے، پس وہ آنے والے کو محسوس نہیں کرتا۔ اور عارفین میں سے جو بھی اس کے پاس آتا ہے، وہ صرف اس کے حال کو دیکھنے کے لیے آتا ہے جس پر وہ قائم ہے۔ تم اسے کھڑا ہوا دیکھو گے، اس نے اپنے دونوں ہاتھ اپنے سینے پر باندھ رکھے ہیں، ایک ذلیل اور گنہگار بندے کی طرح، اپنی نگاہیں اپنے قدموں کی جگہ پر جھکائے ہوئے، نہ اس کا کوئی بال حرکت کرتا ہے اور نہ کوئی جوڑ ہلتا ہے، جیسا کہ ان لوگوں کے بارے میں کہا گیا ہے جن کا اپنے سلطان کے ساتھ یہ حال ہوتا ہے:\n\n> گویا پرندے ان کے سروں پر ہیں،\n> ظلم کا خوف نہیں بلکہ جلال کا خوف ہے۔\n\nعارفین اس سے مراقبہ کا حال سیکھتے ہیں۔ اس نے کہا: اور میں نے ایک بادشاہ دیکھا جسے الرداع (روکنے والا) کہا جاتا ہے۔ وہ ہیبت ناک منظر والا، لطیف خبر دینے والا، شدید غیرت مند، اور اس چیز کے بارے میں مسلسل غور و فکر کرنے والا ہے جس کے دیکھنے کا اسے حکم دیا گیا ہے۔ جب وہ کسی کو حق کے راستے سے ہٹتے ہوئے دیکھتا ہے تو اسے حق کی طرف لوٹا دیتا ہے۔ اس نے کہا: میں نے اس کی صحبت اختیار کی اور اس سے فائدہ اٹھایا، اور میں ان کے بہت سے بادشاہوں کے ساتھ بیٹھا۔ اور میں نے ان میں اللہ کی تعظیم سے متعلق ایسے عجائبات دیکھے کہ اگر ہم انہیں لکھیں تو لکھنے والا اور سننے والا تھک جائے۔ پس ہم نے اس زمین کے عجائبات کے اس قدر پر اکتفا کیا۔ اور اس کے شہروں کی کثرت بے شمار ہے، اور اس کے شہر اس کی بستیوں سے زیادہ ہیں۔ اور اس پر حکومت کرنے والے تمام بادشاہ اٹھارہ سلطان ہیں، جن میں سے کچھ کا ہم نے ذکر کیا اور کچھ کے بارے میں خاموشی اختیار کی۔ اور ہر سلطان کی اپنی سیرت اور احکام ہیں جو دوسروں کے لیے نہیں ہیں۔\n\n### [حقیقت کی زمین کی مملکت کا انتظام]\n\nاس نے کہا: اور میں ایک دن ان کے دربار میں حاضر ہوا تاکہ ان کا انتظام دیکھوں۔ جو کچھ میں نے دیکھا ان میں سے یہ تھا کہ ان کا بادشاہ ہی اپنی رعایا کے رزق کا انتظام کرتا ہے، خواہ وہ کتنے ہی ہوں۔ میں نے دیکھا کہ جب کھانا تیار ہوتا ہے تو بے شمار لوگ کھڑے ہو جاتے ہیں جنہیں الجباة (جمع کرنے والے) کہا جاتا ہے، اور وہ ہر گھر کے نمائندے ہوتے ہیں۔ پس باورچی خانے کا امین ان کو ان کے خاندان کے مطابق دیتا ہے، اور جابی (جمع کرنے والا) اسے لے کر چلا جاتا ہے۔ اور جو شخص اسے تقسیم کرتا ہے وہ صرف ایک ہی شخص ہوتا ہے، اس کے ہاتھ جباة کی تعداد کے مطابق ہوتے ہیں، پس وہ ایک ہی وقت میں ہر شخص کے لیے اس کے برتن میں کھانا نکالتا ہے اور وہ چلا جاتا ہے۔ اور جو بچ جاتا ہے اسے خزانے میں اٹھا لیا جاتا ہے۔ پس جب وہ تقسیم کرنے والا ان سے فارغ ہو جاتا ہے، تو وہ خزانے میں داخل ہوتا ہے اور جو بچا ہوا ہوتا ہے اسے لے کر بادشاہ کے گھر کے دروازے پر موجود فقیروں کے پاس جاتا ہے اور انہیں دے دیتا ہے، پس وہ اسے کھا لیتے ہیں۔ اور ہر روز ایسا ہی ہوتا ہے۔ اور ہر بادشاہ کے پاس ایک خوبصورت ہیئت کا شخص ہوتا ہے جو خزانے پر ہوتا ہے، جسے وہ الخازن (خزانچی) کہتے ہیں، اس کے ہاتھ میں وہ سب کچھ ہوتا ہے جو اس بادشاہ کی ملکیت میں ہے۔ اور ان کے قوانین میں سے یہ ہے کہ جب وہ اسے مقرر کر دیتا ہے تو اسے معزول نہیں کر سکتا۔ اور میں نے ان میں ایک شخص کو دیکھا جس کی حرکات مجھے بہت پسند آئیں، وہ بادشاہ کے پہلو میں بیٹھا تھا۔ اور میں بادشاہ کے دائیں طرف تھا۔ میں نے اس سے پوچھا کہ اس کا تمہارے ہاں کیا مقام ہے؟ وہ مسکرایا اور کہا: کیا تمہیں یہ پسند آیا؟ میں نے کہا: ہاں۔ اس نے کہا: یہ وہ معمار ہے جو ہمارے لیے مکانات، شہر اور وہ سب کچھ بناتا ہے جو تم اس کے کام کے آثار میں دیکھتے ہو۔ اور میں نے ان کے صرافوں کے بازار میں دیکھا کہ ان کے سکوں کو صرف ایک ہی شخص پورے شہر میں اور اس بادشاہ کے زیر انتظام تمام شہروں میں جانچتا ہے۔\n\n### [دنیا میں محال چیز حقیقت کی زمین میں جائز اور واقع ہے]\n\nاس نے کہا: اور اسی طرح میں نے ان کی سیرت ہر معاملے میں دیکھی کہ اسے صرف ایک ہی شخص انجام دیتا ہے، لیکن اس کے مددگار ہوتے ہیں۔ اور اس زمین کے لوگ اللہ کو سب سے زیادہ جاننے والے ہیں۔ اور ہر وہ چیز جسے عقل نے ہمارے ہاں اپنی دلیل سے محال قرار دیا ہے، ہم نے اسے اس زمین میں ممکن پایا ہے اور وہ واقع ہو چکی ہے۔ اور اللہ ہر چیز پر قادر ہے۔ پس ہم نے جانا کہ عقلیں قاصر ہیں، اور اللہ دو متضاد چیزوں کو جمع کرنے، جسم کو دو جگہوں پر موجود کرنے، عرض کا بذات خود قائم ہونے اور منتقل ہونے، اور معنی کا معنی کے ساتھ قائم ہونے پر قادر ہے۔ اور ہر وہ حدیث اور آیت جو ہمارے ہاں وارد ہوئی ہے جسے عقل نے اس کے ظاہری معنی سے پھیر دیا ہے، ہم نے اسے اس زمین میں اس کے ظاہری معنی پر پایا ہے۔ اور ہر وہ جسم جس میں روحانی (الروحاني) یعنی فرشتہ اور جن شکل اختیار کرتا ہے، اور ہر وہ صورت جس میں انسان خود کو نیند میں دیکھتا ہے، وہ اس زمین کے اجسام میں سے ہے، اور اس زمین میں ان کے لیے ایک مخصوص جگہ ہے۔ اور ان کے پاس باریک چادریں ہیں جو پورے عالم تک پھیلی ہوئی ہیں، اور ہر چادر پر ایک امین ہے۔ پس جب وہ امین کسی روح کو دیکھتا ہے جو ان صورتوں میں سے کسی صورت کے لیے تیار ہو چکی ہے جو اس کے ہاتھ میں ہے، تو وہ اسے وہ صورت پہنا دیتا ہے، جیسے جبریل کے لیے دحیہ کی صورت۔ اور اس کی وجہ یہ ہے کہ حق تعالیٰ نے اس زمین کو برزخ (البرزخ) میں پھیلایا ہے اور اس میں سے ان اجسام کے لیے ایک جگہ مقرر کی ہے جنہیں روحانیات پہنتے ہیں اور جن میں نفوس نیند کے وقت اور موت کے بعد منتقل ہوتے ہیں۔ پس ہم اس کے بعض عالم میں سے ہیں۔ اور اس زمین کا ایک کنارہ جنت میں داخل ہوتا ہے جسے بازار کہا جاتا ہے۔ اور ہم تمہیں اس کنارے کی تصویر کی مثال بیان کرتے ہیں جو اس زمین سے عالم کی طرف پھیلا ہوا ہے۔ وہ اس طرح کہ جب انسان چراغ یا سورج اور چاند کو دیکھتا ہے، پھر اپنی پلکوں کے کناروں کو دیکھنے والے اور روشن جسم کے درمیان حائل کرتا ہے، تو وہ اس روشن جسم سے اپنی آنکھوں تک نور کی خطوط کی مانند چیزیں دیکھتا ہے جو چراغ سے اس کی آنکھوں تک متصل ہوتی ہیں اور متعدد ہوتی ہیں۔ پس جب وہ ان پلکوں کو دیکھنے والے کے سامنے سے آہستہ آہستہ ہٹاتا ہے، تو وہ دیکھتا ہے کہ وہ پھیلی ہوئی خطوط روشن جسم کی طرف سمٹ رہی ہیں۔ پس روشن جسم اس زمین کے اس مخصوص مقام کی مثال ہے جو ان صورتوں کے لیے مقرر ہے، اور دیکھنے والا عالم کی مثال ہے، اور ان خطوط کا پھیلاؤ ان اجسام کی صورتوں کی طرح ہے جن میں وہ نیند میں اور موت کے بعد اور جنت کے بازار میں منتقل ہوتے ہیں، اور جنہیں ارواح پہنتے ہیں۔ اور تمہارا ان خطوط کو دیکھنے کا ارادہ اس عمل کے ذریعے، یعنی دیکھنے والے اور روشن جسم کے درمیان حائل پلکوں کو بھیجنا، استعداد کی مثال ہے۔ اور اس حال میں ان خطوط کا نکلنا، استعداد کے وقت صورتوں کے نکلنے کی طرح ہے۔ اور حائل کو ہٹانے پر خطوط کا روشن جسم کی طرف سمٹنا، استعداد کے زائل ہونے پر صورتوں کا اس زمین کی طرف لوٹ جانے کی طرح ہے۔ اور اس بیان کے بعد کوئی بیان نہیں ہے۔ اور ہم نے اس زمین کے عجائبات اور اس سے متعلقہ معارف پر اپنی ایک بڑی کتاب میں تفصیل سے بات کی ہے۔ گیارہواں حصہ ختم ہوا۔",
    "fa": "(باب هشتم) در معرفت سرزمینی که از باقیمانده خمیرمایه گِل آدم (ع) خلق شد. و آن سرزمین حقیقت (أرض الحقيقة) است و ذکر برخی از عجایب و غرایب آن.\n\n> ای خواهر، بلکه ای عمه معقول ما / تو نزد ما آن مادر ناشناخته‌ای\n> پسران به تو، ای خواهر پدرشان، نگریستند / و با همتی در بند، به رقابت پرداختند\n> مگر اندکی از پسران که / با جان‌هایی سرشته شده، به تو روی آوردند\n> ای عمه من، بگو چگونه برادر، راز خود را / در تو آشکار ساخت و تنزیل (نزول) آن را محقق نمود\n> تا آنکه از مانند ذات تو، عالمی پدیدار شد / که پروردگار خلق، وکالت او را می‌پسندد\n> تو امامت هستی و امامت برادر توست / و مأموم، نمونه‌هایی است که از او بیرون کشیده شده‌اند\n\n### [نخل، خواهر آدم]\n\nبدان که چون خداوند متعال آدم (ع) را که نخستین جسم انسانی شکل‌گرفته بود، آفرید و او را اصل وجود اجسام انسانی قرار داد، از خمیرمایه گِل او باقیمانده‌ای فزونی یافت که از آن درخت نخل را خلق کرد. پس نخل خواهر آدم (ع) و عمه ماست، و شریعت آن را عمه نامیده و به مؤمن تشبیه کرده است. نخل اسرار عجیبی دارد که در سایر گیاهان نیست. و پس از خلق نخل، به اندازه دانه کنجدی از آن گِل در خفا باقی ماند. پس خداوند آن باقیمانده را به سرزمینی وسیع و گسترده تبدیل کرد؛ سرزمینی که اگر عرش و آنچه در بر دارد، و کرسی و آسمان‌ها و زمین‌ها و آنچه زیر خاک است، و همه بهشت‌ها و دوزخ در آن قرار گیرند، همگی در آن مانند حلقه‌ای باشند که در بیابانی از زمین افکنده شده است. و در آن سرزمین عجایب و غرایبی است که قدر آن را نتوان دانست و امر آن عقل‌ها را حیران می‌سازد. و در هر نَفَسی که خداوند در آن خلق کرده است، عوالمی وجود دارند که: يُسَبِّحُونَ اللَّيْلَ والنَّهارَ لا يَفْتُرُونَ (شب و روز تسبیح می‌گویند و سستی نمی‌ورزند). و در این سرزمین عظمت خداوند آشکار شده و قدرت او نزد کسانی که آن را مشاهده می‌کنند، بزرگ می‌نماید. و بسیاری از محالات عقلی که دلیل صحیح عقلی بر محال بودن آن‌ها اقامه شده است، در این سرزمین موجودند. و این سرزمین جولانگاه دیدگان عارفان (العارفين) و دانایان به حق (الله) است و در آن سیر می‌کنند. و خداوند از جمله عوالم آن، عالمی را بر صورت ما خلق کرده است که اگر عارف آن‌ها را ببیند، خود را در آن مشاهده می‌کند. عبدالله بن عباس (رضی الله عنه) به مانند این اشاره کرده است در روایتی که از او درباره این کعبه نقل شده است که آن خانه‌ای از چهارده خانه است و در هر یک از هفت زمین، خلقی مانند ما وجود دارد، تا آنجا که در میان آن‌ها ابن عباسی مانند من هست. و این روایت نزد اهل کشف (الكشف) تصدیق شده است.\n\n### [مجلس رحمت در سرزمین حقیقت]\n\nحال به ذکر این سرزمین و وسعت آن و کثرت عوالم مخلوق در آن بازگردیم. تجلیات الهی (تجلیات إلهية) برای عارفان در آنجا رخ می‌دهد. یکی از عارفان از امری که خود به شهود (الشهود) دریافته بود، خبر داد و گفت: روزی وارد مجلسی در آن سرزمین شدم که «مجلس رحمت» نامیده می‌شد. هرگز مجلسی عجیب‌تر از آن ندیده بودم. در آنجا بودم که تجلی الهی (تجلی إلهي) بر من ظاهر شد که مرا از خودم نگرفت، بلکه مرا با خودم باقی گذاشت. و این از ویژگی‌های خاص این سرزمین است؛ زیرا تجلیاتی که بر عارفان در این دنیا و در این هیکل‌ها (هياكل) وارد می‌شود، آنان را از خودشان می‌گیرد و از شهودشان فانی می‌سازد، چه از انبیا باشند و چه از اولیا و هر کس که این واقعه برایش رخ دهد. همچنین است عالم آسمان‌های بالا و کرسی درخشان و عالم عرش محیط اعلی؛ اگر تجلی الهی بر آن‌ها واقع شود، آنان را از خودشان می‌گیرد و مدهوش می‌شوند. اما این سرزمین، اگر صاحب کشف (الكشف) و عارف در آن حضور یابد و تجلی بر او واقع شود، او را از شهودش فانی نمی‌سازد و از وجودش ربوده نمی‌کند، بلکه رؤیت و کلام را برای او جمع می‌نماید. او گفت: در این مجلس امور و اسراری برای من اتفاق افتاد که به دلیل پیچیدگی معانی و عدم درک آن‌ها پیش از مشاهده چنین صحنه‌هایی، نمی‌توانم آن‌ها را ذکر کنم. در آنجا باغ‌ها و بوستان‌ها و حیوانات و معادنی وجود دارد که قدر آن‌ها را جز خداوند متعال نمی‌داند. و هر آنچه در آنجاست، زنده و گویاست (حي ناطق)، مانند حیات هر موجود زنده و گویایی، اما نه مانند اشیای این دنیا. و آن‌ها باقی هستند و فانی نمی‌شوند و تغییر نمی‌کنند و عالمیان آن نمی‌میرند. و این سرزمین هیچ یک از اجسام طبیعی گِلین بشری را نمی‌پذیرد، مگر عالمیان خود یا عالم ارواح ما را به واسطه خاصیتی که دارد. و عارفان هنگامی که وارد آن می‌شوند، تنها با ارواح خود وارد می‌شوند، نه با اجسامشان؛ پس هیکل‌های خود را در این زمین دنیا رها کرده و مجرد می‌شوند.\n\n### [مراسم ورود به سرزمین حقیقت]\n\nدر آن سرزمین صورت‌هایی با نشأت عجیب و خلقت بدیع وجود دارند که بر دهانه گذرگاه‌هایی ایستاده‌اند که مشرف بر این عالم ما (از زمین و آسمان و بهشت و دوزخ) است. پس اگر یکی از عارفان ما، از هر نوعی که باشد (از انسان یا جن یا ملک یا اهل بهشت)، بخواهد وارد آن سرزمین شود، به شرط معرفت (المعرفة) و تجرد از هیکلش، آن صورت‌ها را بر دهانه گذرگاه‌ها ایستاده و موکل بر آن‌ها می‌یابد. خداوند سبحان آنان را برای این کار گماشته است. پس یکی از آنان به سوی این واردشونده می‌شتابد و خلعت (حلة) متناسب با مقامش را بر او می‌پوشاند و دستش را می‌گیرد و او را در آن سرزمین می‌گرداند و هر جا که بخواهد منزل می‌گزیند و در مصنوعات خداوند تأمل می‌کند. و از هیچ سنگ، درخت، کلوخ یا چیزی نمی‌گذرد که بخواهد با او سخن بگوید، مگر اینکه با او سخن می‌گوید، همان‌گونه که مرد با دوستش سخن می‌گوید. و آن‌ها زبان‌های مختلفی دارند و این سرزمین به واسطه خاصیت خود، به هر کس که وارد آن شود، فهم تمام زبان‌های موجود در آن را عطا می‌کند. پس هنگامی که عارف حاجت خود را از آن برآورد و خواست به جایگاه خود بازگردد، رفیقش با او همراهی می‌کند تا او را به موضعی که از آن وارد شده است، برساند. با او وداع می‌کند و آن خلعت را از او می‌گیرد و از او جدا می‌شود، در حالی که عارف علوم فراوان و دلایل بسیاری کسب کرده و بر علمش به خداوند افزوده شده است، به گونه‌ای که پیش از آن به شهود (مشاهدة) نرسیده بود. و من ندیدم که فهمی سریع‌تر از زمانی که در این سرزمین حاصل می‌شود، نفوذ کند.\n\n### [حکایت شیخ اوحدالدین کرمانی با شیخ خود]\n\nدر این دنیا و این نشأت ما، امری ظاهر شده است که این سخن را تأیید می‌کند. از جمله آن، چیزی است که خود مشاهده کرده‌ام و ذکر نمی‌کنم، و از جمله آن چیزی است که اوحدالدین حامد بن ابی الفخر کرمانی (خداوند او را موفق بدارد) برایم نقل کرد. او گفت: در جوانی در خدمت شیخی بودم. شیخ بیمار شد و در محفلی بود و دچار اسهال شده بود. وقتی به تکریت رسیدیم، به او گفتم: ای سرورم، اجازه دهید از صاحب مارستان (بیمارستان) سنجار برای شما داروی قابض رایگان بگیرم. چون اشتیاق مرا دید، گفت: برو نزد او. او گفت: نزد صاحب سبیل (بیمارستان) رفتم. او در خیمه‌اش نشسته بود و مردانش در مقابلش ایستاده بودند و شمعی پیش رویش بود. او مرا نمی‌شناخت و من او را نمی‌شناختم. مرا دید که میان جمع ایستاده‌ام. به سویم برخاست و دستم را گرفت و مرا گرامی داشت و پرسید: حاجتت چیست؟ من حال شیخ را برایش گفتم. او دارو را حاضر کرد و به من داد و با خادم و شمعی در خدمتم بیرون آمد. ترسیدم که شیخ او را ببیند و شرمنده شود، پس او را قسم دادم که بازگردد. او بازگشت. من نزد شیخ آمدم و دارو را به او دادم و کرامت امیر صاحب سبیل را در حق خود ذکر کردم. شیخ تبسم کرد و به من گفت: ای فرزندم، چون دیدم که از جهت من چقدر مشتاق و نگران هستی، به تو اجازه دادم. اما وقتی رفتی، ترسیدم که امیر با بی‌اعتنایی خود تو را خجل سازد. پس از این هیکل (هيكلي هذا) تجرد کردم و وارد هیکل آن امیر شدم و در جای او نشستم. وقتی آمدی، تو را گرامی داشتم و آنچه دیدی انجام دادم، سپس به این هیکل خود بازگشتم. و من نیازی به این دارو ندارم و آن را مصرف نکردم. پس این شخصی است که در صورت دیگری ظاهر شده است؛ حال اهل آن سرزمین چگونه‌اند؟\n\n### [خاک و میوه سرزمین حقیقت]\n\nیکی از عارفان به من گفت: هنگامی که وارد این سرزمین شدم، در آن خاکی دیدم که تماماً مشک خوشبو بود. اگر کسی از ما در این دنیا آن را می‌بویید، به دلیل شدت بوی آن هلاک می‌شد. این خاک تا جایی که خداوند می‌خواست، امتداد داشت. و در این سرزمین، وارد سرزمینی از طلای سرخ نرم شدم که درختانش تماماً طلا و میوه‌هایش طلا بود. شخص سیب یا میوه دیگری را از آن می‌گیرد و می‌خورد و از لذت طعم و خوشبویی و نعمت آن چیزی می‌یابد که هیچ وصف‌کننده‌ای نمی‌تواند آن را توصیف کند؛ میوه‌های بهشت در برابر آن کم می‌آورند، چه رسد به میوه‌های دنیا. جسم و شکل و صورت آن طلا است و شکل و صورت آن مانند شکل و صورت میوه در نزد ماست، اما در طعم متفاوت است. و در میوه، نقش و نگار بدیع و زینت زیبایی وجود دارد که هیچ نفسی آن را تصور نمی‌کند، چه رسد به اینکه چشمی آن را ببیند. و میوه‌هایی دیدم که از بزرگی چنان بودند که اگر میوه را بین آسمان و زمین قرار می‌دادند، اهل زمین را از دیدن آسمان باز می‌داشت، و اگر بر زمین قرار می‌دادند، چندین برابر زمین فزونی می‌یافت. و هنگامی که کسی که می‌خواهد آن را بخورد، با همین دست معمولی خود آن را می‌گیرد، به دلیل لطافت آن که از هوا لطیف‌تر است، دستش آن را در بر می‌گیرد، با وجود این عظمت. و این چیزی است که عقل‌ها در اینجا آن را محال می‌دانند. و چون ذوالنون مصری آن را مشاهده کرد، به آنچه از او حکایت شده است، سخن گفت؛ یعنی وارد شدن بزرگ در کوچک، بدون اینکه بزرگ کوچک شود یا کوچک بزرگ گردد، یا تنگ وسیع شود یا وسیع تنگ گردد. پس عظمت در سیب، همان‌گونه که ذکر کردم، باقی است و گرفتن آن با دست کوچک و احاطه بر آن موجود است. و کیفیت آن مشهود و مجهول است و جز خداوند آن را نمی‌داند. و این علمی است که حق (الحق) به آن اختصاص یافته است. و یک روز زمانی در نزد ما، در نزد آنان چندین سال است. و زمان‌های آن سرزمین متفاوت است. او گفت: و در آنجا وارد سرزمینی از نقره سفید شدم که دارای درختان و رودها و میوه‌های لذیذ بود و همه از نقره بودند. و اجسام اهل آن نیز تماماً از نقره بود. و همچنین است هر سرزمینی که درختان و میوه‌ها و رودها و دریاها و خلق آن از جنس خودش است. پس هنگامی که خورده می‌شوند، طعم و بوها و نعمتی مانند سایر خوردنی‌ها در آن‌ها یافت می‌شود، با این تفاوت که لذت آن قابل وصف و حکایت نیست. و در آنجا وارد سرزمینی از کافور سفید شدم که در برخی نقاط از آتش گرم‌تر است و انسان در آن فرو می‌رود و نمی‌سوزد، و برخی نقاط آن معتدل و برخی سرد است. و هر سرزمینی از این سرزمین‌ها که مکان‌هایی در این سرزمین بزرگ هستند، اگر آسمان در آن قرار داده شود، نسبت به آن مانند حلقه‌ای در بیابان خواهد بود. و در میان تمام سرزمین‌های آن، هیچ چیز نزد من زیباتر و موافق‌تر با مزاج من از سرزمین زعفران نبود. و هیچ عالمی از عالمیان هر سرزمینی را گشاده‌روتر و بشاش‌تر از آنان در برخورد با واردشونده ندیدم که با خوشامدگویی و احترام از او استقبال می‌کنند. و از عجایب خوردنی‌های آن این است که هر چیزی از آن بخوری، اگر قطعه‌ای از میوه را ببری، در همان لحظه بریدن، جای آن پر می‌شود و آن شکاف را می‌پوشاند، یا اگر با دست خود میوه‌ای را بچینی، در همان لحظه چیدن، مانند آن تشکیل می‌شود، به گونه‌ای که جز شخص زیرک متوجه آن نمی‌شود و هیچ نقصی در آن ظاهر نمی‌گردد.\n\n### [زنان سرزمین حقیقت، دریاها و کشتی‌های آن]\n\nو اگر به زنان آن بنگری، می‌بینی که زنان موجود در بهشت از حوریان، نسبت به آنان مانند زنان بشری ما نسبت به حوریان در بهشت‌ها هستند. و آمیزش با آنان لذتی دارد که هیچ لذتی شبیه آن نیست. و اهل آن عاشق‌ترین خلق نسبت به کسانی هستند که بر آنان وارد می‌شوند. و آنان تکلیفی ندارند، بلکه بر تعظیم حق (الحق) و جلال او سرشته شده‌اند و اگر بخواهند خلاف آن عمل کنند، نمی‌توانند. و اما بناهای آنان، برخی از همت (همم) و اراده آنان پدید می‌آید و برخی مانند بناهای ما با استفاده از ابزار و صنعت نیکو ساخته می‌شود. سپس دریاهای آن با یکدیگر مخلوط نمی‌شوند، چنانکه خداوند متعال می‌فرماید: مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ (دو دریا را به هم آمیخت که به هم می‌رسند، میان آن دو حایلی است که تجاوز نمی‌کنند). پس انتهای دریای طلا را می‌بینی که امواجش به هم می‌خورد و دریای آهن در مجاورت آن است، اما هیچ یک از آن‌ها وارد دیگری نمی‌شود. و آب آن‌ها در حرکت و جریان از هوا لطیف‌تر است و چنان صاف است که هیچ یک از جنبندگان آن و زمینی که دریا بر آن جاری است، از تو پنهان نمی‌ماند. و اگر بخواهی از آن بنوشی، لذتی در آن می‌یابی که در هیچ نوشیدنی دیگری نمی‌یابی. و خلق آن مانند سایر گیاهان در آن می‌رویند، بدون تناسل، بلکه مانند حشرات در نزد ما از خاک آن تشکیل می‌شوند. و از ازدواج آنان فرزندی منعقد نمی‌شود، بلکه ازدواجشان تنها برای شهوت و نعمت است. و اما کشتی‌های آنان، بر حسب اراده سوار، بزرگ و کوچک می‌شوند. و هنگامی که از شهری به شهر دیگر سفر می‌کنند، از راه خشکی و دریا سفر می‌کنند و سرعت حرکتشان در خشکی و دریا از درک چشم بیننده سریع‌تر است. و خلق آن در احوال متفاوتند؛ در میانشان کسانی هستند که شهوات بر آنان غلبه دارد و کسانی که تعظیم جناب حق (الحق) بر آنان غلبه دارد. و در آنجا رنگ‌هایی دیدم که در رنگ‌های دنیا نمی‌شناسم. و در آنجا معادنی دیدم که شبیه طلا بودند، اما نه طلا بودند و نه مس، و سنگ‌هایی از مروارید که چشم به دلیل شفافیتشان در آن‌ها نفوذ می‌کرد، و یاقوت‌های سرخ شفاف.\n\n### [عجایب سرزمین حقیقت]\n\nو از عجیب‌ترین چیزهای آن، درک رنگ‌ها در اجسام زیرین است که مانند هوا هستند و ادراک به رنگ‌های آن‌ها تعلق می‌گیرد، همان‌گونه که به رنگ‌های اجسام کثیف تعلق می‌گیرد. و بر دروازه‌های شهرهای آن، طاق‌هایی از سنگ‌های یاقوتی وجود دارد که هر سنگی از آن‌ها بیش از پانصد ذراع است و ارتفاع دروازه در هوا عظیم است و بر آن سلاح‌ها و ابزارهایی آویزان است که اگر تمام پادشاهان زمین جمع شوند، نمی‌توانند آن را فراهم کنند. و در نزد آنان ظلمت و نوری است که بدون خورشید به دنبال هم می‌آیند و با تعاقب آن‌ها زمان را می‌شناسند. و ظلمت آنان مانع دید چشم از درک خود نمی‌شود، همان‌گونه که نور مانع نمی‌شود. و برخی از آنان با برخی دیگر می‌جنگند، بدون کینه و دشمنی و فساد نیت. و اگر در دریا سفر کنند و غرق شوند، آب بر آنان غلبه نمی‌کند، همان‌گونه که بر ما غلبه می‌کند، بلکه در آن راه می‌روند، مانند راه رفتن جنبندگان آن، تا به ساحل برسند. و در آن سرزمین زلزله‌هایی رخ می‌دهد که اگر بر ما رخ می‌داد، زمین زیر و رو می‌شد و هر آنچه بر آن بود، هلاک می‌شد. او گفت: روزی با گروهی از آنان در حال گفتگو بودم که زلزله شدیدی آمد، به گونه‌ای که دیدم بناها همگی با سرعتی حرکت می‌کنند که چشم نمی‌توانست به دلیل سرعت رفت و برگشت، رؤیت آن‌ها را تثبیت کند. و ما خبری نداشتیم و بر قطعه‌ای از زمین بودیم تا اینکه زلزله تمام شد. وقتی تمام شد و زمین آرام گرفت، آن گروه دستم را گرفتند و به خاطر دخترم که فاطمه نام داشت، به من تسلیت گفتند. به آن گروه گفتم: من او را در عافیت نزد مادرش گذاشتم. گفتند: راست گفتی، اما این سرزمین نزد ما زلزله نمی‌شود، مگر اینکه آن شخص بمیرد یا یکی از نزدیکانش بمیرد. و این زلزله برای مرگ دختر تو بود. پس در کار او بنگر. من مدتی که خداوند خواست، با آنان نشستم و دوستم منتظرم بود. وقتی خواستم از آنان جدا شوم، با من تا دهانه گذرگاه آمدند و خلعت مرا گرفتند. به خانه‌ام آمدم و دوستم را دیدم. او به من گفت: فاطمه در حال جان دادن است. بر او وارد شدم و جان داد. من در مکه مجاور بودم، پس او را تجهیز کردیم و در مَعلی دفن نمودیم. این از عجیب‌ترین چیزهایی است که از آن سرزمین به من خبر داده شد. و در آنجا کعبه‌ای دیدم که اهل آن به دورش طواف می‌کنند، بدون اینکه پوشیده باشد. و آن بزرگ‌تر از خانه‌ای است که در مکه است و چهار رکن دارد. هنگامی که به دورش طواف می‌کنند، با آنان سخن می‌گوید و به آنان سلام می‌کند و علومی به آنان می‌آموزد که پیش از آن نداشتند. و در این سرزمین دریایی از خاک دیدم که مانند آب جاری بود. و سنگ‌های کوچک و بزرگی دیدم که برخی به سوی برخی دیگر جاری می‌شدند، همان‌گونه که آهن به سوی مغناطیس جاری می‌شود. پس این سنگ‌ها با هم ترکیب می‌شوند و به طور طبیعی از هم جدا نمی‌شوند، مگر اینکه جداکننده‌ای آن‌ها را جدا کند، مانند جدا کردن آهن از مغناطیس که در توان آن نیست که امتناع ورزد. پس اگر به حال خود رها شود، برخی به سوی برخی دیگر جاری می‌شوند، در مساحتی مخصوص. پس این سنگ‌ها به هم می‌پیوندند و از آن‌ها صورتی شبیه کشتی پدید می‌آید. و من از آن یک کشتی کوچک و دو کشتی بزرگ دیدم. هنگامی که کشتی از آن سنگ‌ها به هم پیوست، آن را در دریای خاک انداختند و در آن سوار شدند و به هر کجا که می‌خواستند، سفر کردند. با این تفاوت که کف کشتی از شن یا خاکی است که به واسطه خاصیت خود به هم می‌چسبد. از آنچه دیدم، هیچ چیز عجیب‌تر از جریان این کشتی‌ها در آن دریا نبود. و صورت ساخت کشتی‌ها یکسان است، با این تفاوت که در دو بال کشتی، در قسمت عقب آن، دو ستون عظیم دارند که از قامت کشتی بلندتر است. و زمین کشتی از سمت عقب آن، میان دو ستون، باز است و با دریا هم‌سطح است، اما به واسطه خاصیت، هیچ چیز از شن آن دریا وارد آن نمی‌شود. و شکل آن چنین است.\n\n### [شهرهای سرزمین حقیقت]\n\nو در این سرزمین شهرهایی است که «مدائن النور» (شهرهای نور) نامیده می‌شوند. و از عارفان تنها هر مصطفای برگزیده‌ای (مصطفى مختار) وارد آن می‌شود. و آن‌ها سیزده شهر هستند که بر یک سطح قرار دارند و بنای آن‌ها عجیب است. به این صورت که آنان در موضعی از این سرزمین شهری کوچک ساختند که دیوارهای عظیمی داشت و اگر سواره‌ای می‌خواست دور آن بگردد، سه سال راه بود. هنگامی که آن را برپا کردند، آن را خزانه‌ای برای منافع و مصالح و ابزارهای خود قرار دادند. و در فاصله‌ای از اطراف آن، برج‌هایی برپا کردند که از برج‌های شهر بلندتر بود و بنا را با سنگ‌ها امتداد دادند تا برای شهر مانند سقف برای خانه شد. و آن سقف را زمینی قرار دادند و بر روی آن شهری بزرگ‌تر از شهر اول ساختند و آن را آباد کردند و مسکن خود قرار دادند. چون برایشان تنگ شد، شهر دیگری بزرگ‌تر از آن بر روی آن ساختند. و همچنان جمعیت آنان زیاد می‌شد و آنان بنا را طبقه به طبقه بالا می‌بردند تا به سیزده شهر رسید.\n\n### [پادشاهان سرزمین حقیقت]\n\nسپس من مدتی از آنان غایب شدم. بار دیگر وارد آنان شدم و دیدم که دو شهر دیگر، یکی بر روی دیگری، اضافه کرده‌اند. و آنان پادشاهانی دارند که دارای لطف و مهربانی هستند. با گروهی از آنان مصاحبت کردم. از جمله آنان «التالی» (پیرو) است که به منزله «قیل» در حِمیَر است. و پادشاهی را ندیدم که بیشتر از او ذکر خدا (ذكر الله) کند. ذکر خدا او را از تدبیر ملکش باز داشته بود. از او بهره بردم و او بسیار با من همنشین بود. و از جمله آنان «ذو العرف» است که پادشاهی عظیم است. ندیدم که رسولان پادشاهان بیشتر از او نزد کسی بیایند. او بسیار فعال، آسان‌گیر و نرم‌خو است و هر کس می‌تواند به او برسد. در فرود آمدن (از مقام خود) لطافت به خرج می‌دهد، اما اگر خشمگین شود، هیچ چیز در برابر خشم او تاب نمی‌آورد. خداوند از قدرت آنچه می‌خواست، به او عطا کرده بود. و برای دریای آنان پادشاهی دیدم که حریم او محفوظ است و «السايح» (شناور) نامیده می‌شود. او کمتر با کسانی که قصد او می‌کنند، همنشین می‌شود و توجهی به کسی ندارد، بلکه با آنچه به قلبش خطور می‌کند، همراه است، نه با آنچه از او خواسته می‌شود. و در مجاورت او سلطانی عظیم است که «السابق» (پیشتاز) نامیده می‌شود. هنگامی که واردشونده‌ای بر او وارد می‌شود، از جای خود برمی‌خیزد و در روی او گشاده‌رویی می‌کند و از آمدنش شادمانی نشان می‌دهد و تمام نیازهای او را قبل از اینکه چیزی بپرسد، برآورده می‌سازد. در این باره از او پرسیدم. گفت: من از اینکه ذلت سؤال از مخلوق را در چهره سائل ببینم، کراهت دارم، از روی غیرت (غيرة) که مبادا کسی برای غیر خدا ذلیل شود. و همه مردم بر قدم توحید با خدا نمی‌ایستند و بیشتر چهره‌ها به سوی اسباب ظاهری معطوف است، در حالی که از خدا محجوبند. این امر مرا وامی‌دارد که به آنچه می‌بینی، یعنی اکرام واردشونده، مبادرت ورزم. او گفت: و بر پادشاه دیگری وارد شدم که «القائم بأمر الله» (برپادارنده امر خدا) نامیده می‌شود. او به واردشونده توجهی نمی‌کند، زیرا عظمت حق (عظمة الحق) بر قلبش مستولی شده است و واردشونده را احساس نمی‌کند. و هیچ کس از عارفان بر او وارد نمی‌شود، مگر برای اینکه به حالتی که او در آن است، بنگرند. او را می‌بینی که ایستاده و دستانش را بر سینه‌اش گره زده است، مانند گره زدن بنده ذلیل گناهکار، و سر به زیر به جای قدم‌هایش دوخته است. هیچ مویی از او حرکت نمی‌کند و هیچ مفصلی از او مضطرب نمی‌شود، چنانکه درباره قومی که حالشان با سلطانشان چنین است، گفته شده:\n\n> گویی پرنده بر سرشان نشسته است / نه از ترس ظلم، بلکه از ترس جلال و هیبت\n\nعارفان از او حالت مراقبه (المراقبة) را می‌آموزند. او گفت: و پادشاهی دیدم که «الرداع» (بازدارنده) نامیده می‌شود. هیبت‌انگیز در ظاهر، لطیف در باطن، شدیدالغیرت، و دائم‌الفکر در آنچه مأمور به نظر در آن شده است. اگر کسی را ببیند که از راه حق (الحق) خارج می‌شود، او را به حق بازمی‌گرداند. او گفت: با او مصاحبت کردم و از او بهره بردم. و با بسیاری از پادشاهان آنان همنشین شدم و از آنان عجایبی دیدم که به تعظیم آنان نسبت به خداوند بازمی‌گردد. اگر آن‌ها را می‌نوشتیم، نویسنده و شنونده را خسته می‌کرد. پس به همین مقدار از عجایب این سرزمین اکتفا کردیم. و شهرهای آن از کثرت قابل شمارش نیستند و شهرهای آن بیشتر از روستاهای آن است. و مجموع کسانی که بر آن حکومت می‌کنند، هجده سلطان هستند که برخی از آنان را ذکر کردیم و از برخی سکوت نمودیم. و هر سلطانی سیره و احکامی دارد که برای دیگری نیست.\n\n### [ترتیب مملکت سرزمین حقیقت]\n\nاو گفت: روزی در دیوان آنان حاضر شدم تا ترتیب کارشان را ببینم. از جمله آنچه دیدم این بود که پادشاه آنان کسی است که رزق رعیت خود را تأمین می‌کند، هر چقدر هم که باشند. دیدم هنگامی که غذا آماده می‌شود، خلقی بی‌شمار که تعدادشان قابل شمارش نیست، می‌ایستند. آنان را «الجباة» (نمایندگان) می‌نامند و فرستادگان اهل هر خانه هستند. پس امین آشپزخانه به اندازه عائله‌اش به او می‌دهد و جابی آن را می‌گیرد و می‌رود. و اما کسی که آن را بین آنان تقسیم می‌کند، تنها یک نفر است. او به تعداد جابی‌ها دست دارد. پس در یک زمان، غذای هر شخص را در ظرفش می‌کشد و می‌رود. و آنچه از آن باقی می‌ماند، به خزانه برده می‌شود. هنگامی که آن تقسیم‌کننده کارش تمام شد، وارد خزانه می‌شود و آنچه باقی مانده است را برمی‌دارد و نزد فقیرانی (الصعاليك) که بر در خانه پادشاه هستند، می‌برد و آنان آن را می‌خورند. و هر روز چنین است. و هر پادشاهی شخصی خوش‌هیئت دارد که بر خزانه است و او را «خازن» (خزانه‌دار) می‌نامند. تمام آنچه آن پادشاه مالک است، در دست اوست. و از شریعت آنان این است که اگر او را به ولایت گماشت، حق عزل او را ندارد. و در میان آنان شخصی را دیدم که حرکاتش مرا به شگفتی واداشت. او در کنار پادشاه نشسته بود و من در سمت راست پادشاه بودم. از پادشاه پرسیدم: منزلت این شخص نزد شما چیست؟ تبسم کرد و گفت: آیا او تو را به شگفتی واداشت؟ گفتم: بله. گفت: این «المعمار» (معمار) است که برای ما خانه‌ها و شهرها و تمام آثاری که می‌بینی، می‌سازد. و در بازار صرافان آنان دیدم که تنها یک نفر در کل شهر و در تمام شهرهایی که تحت سلطه آن پادشاه است، سکه آنان را نقد می‌کند.\n\n### [محال در این دنیا، در سرزمین حقیقت ممکن و واقع است]\n\nاو گفت: و سیره آنان را در هر امری چنین دیدم که تنها یک نفر آن را انجام می‌دهد، اما او دستیاران و توزیع‌کنندگانی دارد. و اهل این سرزمین آشناترین مردم به خداوند هستند. و هر آنچه عقل با دلیل خود در نزد ما آن را محال دانسته است، ما در این سرزمین آن را ممکن و واقع شده یافتیم. و خداوند بر هر چیزی تواناست. پس دانستیم که عقل‌ها قاصرند و خداوند قادر است که اضداد را جمع کند، و جسم در دو مکان وجود داشته باشد، و عَرَض (کیفیت) به خودی خود قائم باشد و منتقل شود، و معنی به معنی قائم باشد. و هر حدیث و آیه‌ای که در نزد ما وارد شده و عقل آن را از ظاهرش منصرف کرده است، ما آن را بر ظاهرش در این سرزمین یافتیم. و هر جسمی که روحانی (روحانیات) از ملک و جن در آن شکل می‌گیرد، و هر صورتی که انسان خود را در خواب در آن می‌بیند، از اجساد این سرزمین است و برای آن موضع مخصوصی در این سرزمین وجود دارد. و آنان رگه‌هایی دارند که تا تمام عالم امتداد یافته است و بر هر رگه‌ای امینی گماشته شده است. پس هنگامی که آن امین روحی از ارواح را ببیند که برای صورتی از این صورت‌هایی که در دست اوست، استعداد یافته است، آن صورت را بر او می‌پوشاند، مانند صورت دحیه برای جبرئیل. و علت آن این است که حق تعالی این سرزمین را در برزخ (البرزخ) امتداد داده و موضعی را از آن برای این اجسادی که روحانیات می‌پوشند و نفوس هنگام خواب و پس از مرگ به آن منتقل می‌شوند، تعیین کرده است. پس ما بخشی از عالم آن هستیم. و یک طرف از این سرزمین وارد بهشت می‌شود که «السوق» (بازار) نامیده می‌شود. و ما برای تو مثالی از صورت امتداد آن طرفی که به عالم ما می‌رسد، بیان می‌کنیم: هنگامی که انسان به چراغ یا خورشید و ماه نگاه می‌کند، سپس با مژه‌های پلک‌هایش بین بیننده و جسم نورانی حائل می‌شود، از آن جسم نورانی به چشمانش خطوطی از نور می‌بیند که متعددند و از چراغ به چشمانش متصل می‌شوند. پس اگر آن مژه‌های حائل را کم‌کم از مقابل بیننده بردارد، می‌بیند که آن خطوط ممتد به سوی جسم نورانی جمع می‌شوند. جسم نورانی مثال موضع معین از این سرزمین برای آن صورت‌هاست، و بیننده مثال عالم است، و امتداد آن خطوط مانند صورت‌های اجسادی است که نفوس در خواب و پس از مرگ و در بازار بهشت به آن‌ها منتقل می‌شوند. و قصد تو برای دیدن آن خطوط با آن عمل فرستادن مژه‌های حائل بین بیننده و جسم نورانی، مثال استعداد (الاستعداد) است. و بیرون آمدن آن خطوط در این حالت، بیرون آمدن صورت‌ها هنگام استعداد است. و جمع شدن خطوط به سوی جسم نورانی هنگام برداشته شدن حائل، بازگشت صورت‌ها به آن سرزمین هنگام زوال استعداد است. و پس از این بیان، بیانی نیست. و ما سخن را در عجایب این سرزمین و معارفی که به آن تعلق دارد، در کتاب بزرگی که به طور خاص درباره آن نوشته‌ایم، بسط داده‌ایم.\n\nپایان جزء یازدهم."
  },
  "page_count": 6
}