{
  "id": 214,
  "title": {
    "ar": "الباب الرابع عشر ومائتين في حال الحرية",
    "en": "Chapter 214: Concerning the State of Freedom (الحرية)",
    "ur": "باب دو سو چودہواں: حریت (الحرية) کے حال کے بیان میں",
    "fa": "باب دویست و چهاردهم در بیان حال آزادی (الحرية)"
  },
  "content": {
    "ar": "## «الباب الرابع عشر ومائتين في حال الحرية»\n\n\n> إذا كان حال الفتى عينه *** فذلك حر وإن لم يكن‏\n\n\n> وإن كان ما لم يكن لم يكن *** بأكوانه كائن يستكن‏\n\n\n> فحرية العبد معلولة *** ولا رق إلا لمن قال كن‏\n\n\n> فيا أيها الحر لا تفتقر *** فجنبك من فقره قد وهن‏\n\n\n> ولا بد منه فما ذا ترى *** ولا بد منك فقد آن إن‏\n\n\n> أضم غناه إلى فقرنا *** وذلك عندي من أقوى الجنن‏\n\n\n### [أن الحرية الاسترقاق بالكلية من جميع الوجوه فتكون حرا عن كل ما سوى الله‏]\n\n\nاعلم أن الحرية عند الطائفة الاسترقاق بالكلية من جميع الوجوه فتكون حرا عن كل ما سوى الله وهي عندنا إزالة صفة العبد بصفة الحق وذلك إذا كان الحق سمعه وبصره وجميع قواه وما هو عبد إلا بهذه الصفات التي أذهبها الحق، بوجوده مع ثبوت عين هذا الشخص والحق لا يكون مملوكا فكان هذا المحل حرا إذ لا معنى له من عينه ما لم يكن موصوفا بهذه الصفات وهي الحق عينها لا صفات الحق عينها فثبت عين الشخص بوجود الضمير في‏\n\n\nقوله كنت سمعه‏\n\n\nفهذه الهاء عينه والصفة عين الحق لا عينه فثبتت الحرية لهذا الشخص فهو محل لأحكام هذه الصفات التي هي عين الحق لا غيره كما يليق بجلاله فنعته سبحانه بنفسه لا بصفته فهذا الشخص من حيث عينه هو ومن حيث صفته لا هو\n\n\n> فوصفك معدوم وعينك ظاهر *** وأنت له آل كما هو آخر\n\n\n> وأنت له ملك ولست بعبده *** فما أنت مزجور ولما أنت هو زاجر\n\n\nوعلى الحقيقة لا يقال في الحق إنه حر لكن يقال إنه ليس بعبد إذ كان لا يعرف إلا بالنعت السلبي لا بالنعت الثبوتي النفسي لكن للمظاهر حكم فيه من حيث ما هو ظاهر فيها فينسب إليه جميع ما ينسب إلى المظهر من نعوت نقص عرفي ونعوت كمال وتمام‏\n\n\n> وليس إلا الحق لا غيره *** فعينه الظاهر نعت العبيد\n\n\n> ولا تقل بأنه عينهم *** بل قل كما قلته لا تزيد\n\n\nوألسنة الشرائع الإلهية بهذا نطقت حقيقة لا مجازا والأدلة العقلية النظرية تنفي مثل هذا عن الجناب الإلهي وإذا وردت به الشرائع فإن فحول علمائهم يتأولون مثل هذا العدم الكشف إذ لم يكن الحق بصرهم‏\n\n\n> تقلدوا الفكر على قصوره *** وما استضاءوا ساعة بنوره‏\n\n\n> فسبحان من أخفى عن العين ذاته *** وأظهرها في خلقه بصفاتهم‏\n\n\n> فلا حر ولا عبد فأين العهد والوعد *** فلله وجود الأمد من قبل ومن بعد\n\n\n### [أن الحر مالك الأمور بأزمتها ولا مملوك‏]\n\n\nواعلم أن الحر من ملك الأمور بأزمتها ولم تملكه وصرفها ولم تصرفه وهذا غير موجود في الجنابين فإن الله يقول ادْعُونِي أَسْتَجِبْ لَكُمْ وطلب منا الإجابة لما دعانا فحصل التصريف من جانب الحق ومن جانب العبد فلو لا دعاء العبد وسؤاله ما كان الحق مجيبا والإجابة نعته فقد ظهر من العبد صورة تصرف في الحق وقد ظهر من الحق تصرف في العبد لا صورة تصرف فهذا القدر بين الحق والعبد ولا يكون حرا مطلق الحرية من هذا نعته ففي الحقيقة ليس للحرية وجود عين فإن الإضافات تمنع من ذلك لكن حقيقة الحرية في غنى الذات عن العالمين مع ظهور العالم عنه لذاته لا لأمر آخر فهو غَنِيٌّ عَنِ الْعالَمِينَ فهو حر والعالم مفتقر إليه فالعالم عبيد فلا حرية لهم أبدا فإذا طلبتهم الألوهة بما كلفتهم به من الأحكام التي‏\nلا ظهور للالوهية إلا بها ظهرت الإضافات فصار الأمر موقوفا من الطرفين كل طرف على صاحبه فامتنعت الحرية أن تقوم بواحد من المضافين فمن قد قال إن الحق معروف فلا يدري كما من قال إن الحق مجهول فلا يدي فهذا حال الحرية قد استوفيناه مختصرا قريب المأخذ والمتناول‏\n\n",
    "en": "## Chapter Two Hundred and Fourteen: Concerning the State of Freedom\n\n> If the state of the youth is his very essence,\n> Then that one is free, even if he is not.\n> And if what was not, was not,\n> By its existences, an existing thing is concealed.\n> The freedom of the servant is conditioned,\n> And there is no servitude except for the One who said \"Be!\" (كن).\n> O free one, do not be needy,\n> For your side has weakened from its neediness.\n> There is no escape from Him, so what do you see?\n> And there is no escape from you, so the time has come that\n> I join His richness to our poverty,\n> And that, in my view, is among the strongest shields.\n\n### [That Freedom is Absolute Servitude in all respects, so one is free from everything other than Allah]\n\nKnow that Freedom (الحرية), according to the Sufi community (الطائفة), is Absolute Servitude (الاسترقاق بالكلية) in all respects, such that one becomes free from everything other than Allah.\n\nAnd according to us, it is the removal of the servant's attribute (صفة العبد) by the Attribute of the Real (صفة الحق). This occurs when the Real (الحق) becomes his hearing, his sight, and all his powers. He is only a servant by means of these attributes which the Real removes by His own Being (وجوده), while the essence (عين) of this person remains fixed.\n\nThe Real cannot be owned (مملوكا), so this locus (المحل) is free, since it has no meaning derived from its own essence unless it is described by these attributes—which are the very Essence of the Real (الحق عينها), not merely the Attributes of the Real (صفات الحق عينها).\n\nThus, the essence of the person is established by the existence of the pronoun in His saying: \"I was his hearing.\" This pronoun (هاء) is his essence, and the attribute is the very Essence of the Real, not His essence. Thus, freedom is established for this person.\n\nHe is therefore the locus for the rulings (أحكام) of these attributes, which are the very Essence of the Real and nothing else, as befits His Majesty (جلاله). Thus, the Glorified One describes him by His own Self (بنفسه), not by His attribute. Therefore, this person, in terms of his essence (عينه), is *him*, but in terms of his attribute (صفته), he is *not him*.\n\n> Your attribute is non-existent, but your essence is manifest.\n> And you are an instrument for Him, just as He is the Last.\n> You are a possession for Him, and you are not His servant.\n> So you are not restrained, nor are you the restrainer.\n\nIn reality (الحقيقة), it is not said of the Real that He is free, but rather it is said that He is not a servant (ليس بعبد), since He is known only by negative description (النعت السلبي), not by affirmative essential description (النعت الثبوتي النفسي). However, the manifestations (المظاهر) have a ruling concerning Him, insofar as He is manifest within them. Thus, everything attributed to the manifestation—whether conventional attributes of deficiency or attributes of perfection and completeness—is attributed to Him.\n\n> There is nothing but the Real and none other.\n> So His manifest essence is the attribute of the servants.\n> And do not say that He is their essence,\n> But say as I have said, and do not add anything.\n\nThe tongues of the Divine Laws (الشرائع الإلهية) have spoken this truly, not metaphorically. However, theoretical rational proofs (الأدلة العقلية النظرية) negate such a thing concerning the Divine Presence (الجناب الإلهي). And when the Divine Laws mention this, the masters among their scholars interpret such a thing due to the absence of Unveiling (الكشف), since the Real was not their sight.\n\n> They relied upon thought despite its deficiency,\n> And they were not illuminated for a moment by His Light.\n> Glory be to the One who concealed His Essence (ذاته) from the eye,\n> And manifested it in His creation through their attributes.\n> So there is neither free nor servant. Where then is the covenant and the promise?\n> For to Allah belongs the existence of eternity (الأمد), from before and from after.\n\n### [That the Free One is the Master of Affairs by their reins, and is not owned]\n\nKnow that the free one (الحر) is he who masters affairs by their reins (أزمتها) and is not mastered by them, and who directs them and is not directed by them.\n\nThis is not found in either of the two Presences (الجنابين). For Allah says: <<ادْعُونِي أَسْتَجِبْ لَكُمْ>> (Call upon Me; I will respond to you), and He requested a response from us when He called upon us. Thus, direction (التصريف) occurred from the side of the Real and from the side of the servant.\n\nWere it not for the servant's calling and asking, the Real would not have been the Responder, and responding is His attribute. Thus, a form of direction appeared from the servant toward the Real, and direction appeared from the Real toward the servant, but not a *form* of direction. This is the measure between the Real and the servant, and one whose description is this cannot be absolutely free (حرا مطلق الحرية).\n\nTherefore, in reality, freedom does not have an essential existence (وجود عين), for the relations (الإضافات) prevent that. However, the reality of freedom (حقيقة الحرية) lies in the self-sufficiency (غنى الذات) of the Essence (الذات) from the worlds (العالمين), along with the manifestation of the world from Him for His own Essence, not for any other reason. He is <<غَنِيٌّ عَنِ الْعالَمِينَ>> (Self-Sufficient above the worlds), so He is free. The world is needy of Him, so the world consists of servants and they have no freedom whatsoever.\n\nWhen Divinity (الألوهة) demands from them the rulings (الأحكام) with which it has charged them—rulings without which Divinity has no manifestation—the relations appear. The matter then becomes dependent from both sides, each side upon the other. Thus, freedom is prevented from subsisting in either of the related parties (المضافين).\n\nThus, whoever has said that the Real is known does not know, just as whoever has said that the Real is unknown does not know. This is the state of Freedom (حال الحرية), which we have completed in a concise manner, easy to grasp and attain.",
    "ur": "«باب نمبر دو سو چودہ: حالِ آزادی (الحرية) کے بیان میں»\n\nاگر جوان کا حال ہی اس کی عین (حقیقت) ہو،\nتو وہ آزاد ہے، اگرچہ وہ نہ ہو،\nاور اگر جو نہ تھا، وہ نہ ہو،\nتو اس کی ہستیوں میں کوئی موجود پوشیدہ رہتا ہے۔\nپس بندے کی آزادی (الحرية) معلول (سبب کی پابند) ہے،\nاور بندگی (رق) صرف اس کے لیے ہے جس نے 'کن' (ہو جا) کہا۔\nاے آزاد! محتاج نہ ہو،\nکیونکہ تیرا پہلو اس کی محتاجی سے کمزور ہو چکا ہے۔\nاور اس (ذات حق) کا ہونا ضروری ہے، تو تم کیا دیکھتے ہو؟\nاور تمہارا ہونا بھی ضروری ہے، پس وقت آ گیا ہے کہ\nمیں اس کی بے نیازی کو اپنی محتاجی میں شامل کر لوں،\nاور یہ میرے نزدیک مضبوط ترین ڈھالوں (الجنن) میں سے ہے۔\n\n[یہ کہ آزادی (الحرية) تمام پہلوؤں سے کلی طور پر بندگی (الاسترقاق) ہے، پس تم اللہ کے سوا ہر چیز سے آزاد ہو جاؤ]\n\nجان لو کہ اس گروہ (صوفیاء) کے نزدیک آزادی (الحرية) تمام پہلوؤں سے کلی طور پر بندگی (الاسترقاق) ہے، پس تم اللہ کے سوا ہر چیز سے آزاد ہو جاؤ۔ اور ہمارے نزدیک یہ بندے کی صفت کو ذات حق (الحق) کی صفت سے زائل کر دینا ہے۔ یہ تب ہوتا ہے جب ذات حق (الحق) اس کی سماعت، بصارت اور اس کی تمام قوتیں بن جائے۔ اور وہ بندہ صرف انہی صفات کی وجہ سے ہے جنہیں ذات حق (الحق) نے اپنے وجود سے زائل کر دیا، اس شخص کی عین (حقیقت) کے ثابت رہنے کے باوجود۔ اور ذات حق (الحق) مملوک نہیں ہو سکتا، لہٰذا یہ محل آزاد ہو گیا، کیونکہ اس کی عین (حقیقت) میں اس کا کوئی معنی نہیں جب تک کہ وہ ان صفات سے موصوف نہ ہو، اور وہ صفات عین ذات حق (الحق) ہیں نہ کہ صفات ذات حق (الحق) کی عین۔ پس شخص کی عین (حقیقت) اس کے اس قول میں ضمیر (الضمير) کے وجود سے ثابت ہوئی:\n\n\"میں اس کی سماعت تھا\" (كنت سمعه)\n\nپس یہ 'ہا' (ضمیر) اس کی عین (حقیقت) ہے، اور صفت عین ذات حق (الحق) ہے نہ کہ اس کی عین۔ پس اس شخص کے لیے آزادی (الحرية) ثابت ہو گئی، کیونکہ وہ ان صفات کے احکام کا محل ہے جو عین ذات حق (الحق) ہیں نہ کہ کوئی اور، جیسا کہ اس کے جلال کے لائق ہے۔ پس وہ سبحانہ و تعالیٰ اپنی ذات سے موصوف ہے نہ کہ اپنی صفت سے۔ لہٰذا یہ شخص اپنی عین (حقیقت) کے لحاظ سے 'وہ' ہے، اور اپنی صفت کے لحاظ سے 'وہ نہیں' ہے۔\n\nپس تیری صفت معدوم ہے اور تیری عین (حقیقت) ظاہر ہے،\nاور تو اس کے لیے آل (آلہ/محل) ہے جیسا کہ وہ آخر ہے۔\nاور تو اس کے لیے مالک ہے اور اس کا بندہ نہیں،\nپس نہ تو تو ڈانٹا گیا ہے اور نہ ہی تو ڈانٹنے والا ہے۔\n\nاور حقیقت میں ذات حق (الحق) کے بارے میں یہ نہیں کہا جاتا کہ وہ آزاد ہے، بلکہ یہ کہا جاتا ہے کہ وہ بندہ نہیں ہے، کیونکہ وہ صرف نعتِ سلبی (منفی صفت) سے پہچانا جاتا ہے نہ کہ نعتِ ثبوتی نفسی (اثباتی ذاتی صفت) سے۔ لیکن مظاہر (المظاهر) کا اس میں حکم ہے، اس لحاظ سے کہ وہ ان میں ظاہر ہے، پس اس کی طرف وہ تمام چیزیں منسوب کی جاتی ہیں جو مظہر کی طرف منسوب ہوتی ہیں، خواہ وہ عرفی نقص کی صفات ہوں یا کمال و تمام کی صفات۔\n\nاور ذات حق (الحق) کے سوا کچھ نہیں، اس کے علاوہ کوئی نہیں۔\nپس اس کی ظاہر عین (حقیقت) بندوں کی صفت ہے۔\nاور یہ نہ کہو کہ وہ ان کی عین (حقیقت) ہے،\nبلکہ وہی کہو جو میں نے کہا ہے، اس میں اضافہ نہ کرو۔\n\nاور الٰہی شریعتوں کی زبانیں اسی بات کو حقیقت کے طور پر بولتی ہیں نہ کہ مجاز کے طور پر۔ اور نظری عقلی دلائل اس جیسی چیز کو جنابِ الٰہی سے نفی کرتے ہیں۔ اور جب شریعتیں اس کے ساتھ وارد ہوتی ہیں، تو ان کے بڑے علماء اس طرح کے کشف (الکشف) کے عدم کی تاویل کرتے ہیں، کیونکہ ذات حق (الحق) ان کی بصارت نہیں بنا۔\n\nانہوں نے اپنی کوتاہی کے باوجود فکر کو اپنا لیا،\nاور ایک لمحہ بھی اس کے نور سے روشنی حاصل نہ کی۔\nپس پاک ہے وہ ذات جس نے اپنی ذات کو آنکھ سے چھپا لیا،\nاور اسے اپنی مخلوق میں ان کی صفات کے ذریعے ظاہر کیا۔\nپس نہ کوئی آزاد ہے اور نہ کوئی بندہ، تو عہد اور وعدہ کہاں ہے؟\nپس اللہ ہی کے لیے ہے مدت کا وجود، پہلے بھی اور بعد میں بھی۔\n\n[یہ کہ آزاد (الحر) تمام امور کی باگ ڈور کا مالک ہوتا ہے اور مملوک نہیں ہوتا]\n\nاور جان لو کہ آزاد (الحر) وہ ہے جو امور کی باگ ڈور کا مالک ہو اور وہ امور اس کے مالک نہ ہوں، اور وہ انہیں تصرف میں لائے اور وہ اسے تصرف میں نہ لائیں۔ اور یہ دونوں جنابوں (ذات حق اور بندے) میں موجود نہیں ہے۔ کیونکہ اللہ تعالیٰ فرماتا ہے: \"تم مجھے پکارو، میں تمہاری دعا قبول کروں گا\" (ادْعُونِي أَسْتَجِبْ لَكُمْ) اور جب اس نے ہمیں پکارا تو ہم سے جواب طلب کیا۔ پس تصرف ذات حق (الحق) کی جانب سے بھی ہوا اور بندے کی جانب سے بھی۔ اگر بندے کی دعا اور سوال نہ ہوتا تو ذات حق (الحق) جواب دینے والا نہ ہوتا، حالانکہ جواب دینا اس کی صفت ہے۔ پس بندے کی طرف سے ذات حق (الحق) میں تصرف کی ایک صورت ظاہر ہوئی ہے، اور ذات حق (الحق) کی طرف سے بندے میں تصرف ظاہر ہوا ہے، نہ کہ تصرف کی صورت۔ پس یہ وہ حد ہے جو ذات حق (الحق) اور بندے کے درمیان ہے۔ اور جس کی یہ صفت ہو وہ مطلق آزادی (الحرية) والا آزاد نہیں ہو سکتا۔ پس حقیقت میں آزادی (الحرية) کا کوئی وجودِ عین (حقیقی وجود) نہیں ہے، کیونکہ اضافات (تعلقات) اس سے مانع ہیں۔ لیکن آزادی (الحرية) کی حقیقت ذات حق (الحق) کا تمام جہانوں سے بے نیاز ہونا ہے، اس کے ساتھ کہ عالم اس سے اپنی ذات کے لیے ظاہر ہوا ہے نہ کہ کسی اور امر کے لیے۔ پس وہ: \"جہانوں سے بے نیاز ہے\" (غَنِيٌّ عَنِ الْعالَمِينَ) پس وہ آزاد ہے، اور عالم اس کا محتاج ہے۔ لہٰذا عالم بندے ہیں، اور انہیں کبھی آزادی (الحرية) حاصل نہیں۔\n\nپس جب الوہیت نے ان سے ان احکام کا مطالبہ کیا جن کا انہیں مکلف بنایا گیا ہے، اور جن کے بغیر الوہیت کا ظہور نہیں ہوتا، تو اضافات (تعلقات) ظاہر ہو گئے۔ پس معاملہ دونوں طرف سے موقوف ہو گیا، ہر طرف اپنے ساتھی پر۔ لہٰذا آزادی (الحرية) کے لیے یہ ممکن نہ رہا کہ وہ مضافین (متعلقین) میں سے کسی ایک میں قائم ہو۔ پس جس نے کہا کہ ذات حق (الحق) معروف ہے، وہ نہیں جانتا، جیسا کہ جس نے کہا کہ ذات حق (الحق) مجہول ہے، وہ بھی نہیں جانتا۔ یہ حالِ آزادی (الحرية) ہے جسے ہم نے مختصر طور پر، آسان فہم اور قابلِ حصول انداز میں مکمل کر دیا ہے۔",
    "fa": "«باب دویست و چهاردهم در حال آزادی (الحرية)»\n\nاگر حال جوانمرد عین او باشد، *** پس او آزاد است، حتی اگر (در ظاهر) نباشد.\nو اگر آنچه نبود، نبود، *** با هستی‌هایش، هستی‌ای پنهان می‌ماند.\nپس آزادی بنده معلول است، *** و بندگی (رق) نیست مگر برای کسی که گفت: «باش (كن)».\nای آزاده، فقیر (نیازمند) مباش، *** که پهلویت از فقرش سست شده است.\nو از او چاره‌ای نیست، پس چه می‌بینی؟ *** و از تو چاره‌ای نیست، پس اکنون زمان آن رسیده که...\nغنای او را به فقر ما ضمیمه کنم، *** و این نزد من از قوی‌ترین سپرهاست.\n\n### [اینکه آزادی، بندگی کامل از جمیع وجوه است، پس از هر آنچه غیر خداست، آزاد می‌شوی]\n\nبدان که آزادی (الحرية) نزد این طایفه (صوفیه)، بندگی (الاسترقاق) کامل از جمیع وجوه است، پس از هر آنچه غیر حق است، آزاد می‌شوی. و آن (آزادی) نزد ما، زدودن صفت بنده با صفت حق (الحق) است. و این زمانی است که حق، گوش و چشم و تمامی قوای او باشد. و بنده نیست مگر به واسطه همین صفاتی که حق آن‌ها را با وجود خود از بین برده است، در حالی که عین (ذات) این شخص ثابت است. و حق مملوک نمی‌شود، پس این محل آزاد بود، زیرا از عین خود معنایی ندارد مگر آنکه به این صفات موصوف باشد، و این صفات عین حق هستند نه صفات حق. پس عین شخص با وجود ضمیر در این قول (حدیث قدسی) ثابت شد: «كنت سمعه (من گوش او بودم)». این ضمیر (هاء) عین اوست و صفت، عین حق است نه عین او. پس آزادی (الحرية) برای این شخص ثابت شد. او محلی است برای احکام این صفات که عین حق هستند نه غیر او، آن‌گونه که شایسته جلال اوست. پس حق سبحانه او را به ذات خود وصف می‌کند نه به صفت خود. بنابراین، این شخص از حیث عین خود، اوست؛ و از حیث صفت خود، او نیست.\n\nپس وصف تو معدوم است و عین تو ظاهر، *** و تو برای او آل (ابزار) هستی، همان‌گونه که او آخر است.\nو تو ملک او هستی و بنده او نیستی، *** پس نه تو رانده شده‌ای و نه او راننده توست.\n\nو در حقیقت، درباره حق (الحق) گفته نمی‌شود که او آزاد است، بلکه گفته می‌شود که او بنده نیست، زیرا او شناخته نمی‌شود مگر با نعت سلبی، نه با نعت ثبوتی نفسی. اما مظاهر، حکمی در او دارند از آن جهت که او در آن‌ها ظاهر است، پس تمامی آنچه به مظهر نسبت داده می‌شود، از نعوت نقص عرفی و نعوت کمال و تمام، به او نیز نسبت داده می‌شود.\n\nو جز حق، دیگری نیست، *** پس عین ظاهر او نعت بندگان است.\nو مگو که او عین آن‌هاست، *** بلکه بگو همان‌گونه که گفتم و چیزی اضافه مکن.\n\nو زبان‌های شرایع الهی به این حقیقت نطق کرده‌اند نه به مجاز. و ادله عقلی نظری، چنین چیزی را از ساحت الهی نفی می‌کنند. و هنگامی که شرایع به آن وارد می‌شوند، بزرگان علمای آن‌ها چنین چیزی را تأویل می‌کنند، زیرا فاقد کشف (الکشف) هستند، چرا که حق، بصیرت آن‌ها نبوده است.\n\nفکر را با وجود قصورش بر گردن آویختند، *** و لحظه‌ای به نور او روشن نشدند.\nپس منزه است کسی که ذات خود را از چشم پنهان کرد، *** و آن را در خلقش با صفات آن‌ها آشکار ساخت.\nپس نه آزادی هست و نه بندگی، پس عهد و وعده کجاست؟ *** وجود زمان (الأمد) از پیش و پس، از آنِ حق است.\n\n### [اینکه آزاده (الحر) مالک امور با زمام آن‌هاست و مملوک نیست]\n\nو بدان که آزاده (الحر) کسی است که مالک امور با زمام آن‌ها باشد و امور مالک او نباشند، و او آن‌ها را بگرداند و آن‌ها او را نگردانند. و این در هیچ یک از دو ساحت (حق و خلق) موجود نیست. زیرا خداوند می‌فرماید: «ادْعُونِي أَسْتَجِبْ لَكُمْ (مرا بخوانید تا شما را اجابت کنم)» و از ما اجابت خواست هنگامی که ما را خواند. پس تصرف از جانب حق و از جانب بنده حاصل شد. اگر دعای بنده و سؤال او نبود، حق اجابت‌کننده نبود، در حالی که اجابت نعت اوست. پس از بنده، صورت تصرفی در حق ظاهر شد، و از حق، تصرفی در بنده ظاهر شد نه صورت تصرف. این مقدار میان حق و بنده است. و کسی که نعتش این باشد، آزاد مطلق (الحرية) نخواهد بود. پس در حقیقت، آزادی (الحرية) وجود عین ندارد، زیرا اضافات (نسبت‌ها) مانع از آن می‌شوند. اما حقیقت آزادی (الحرية) در بی‌نیازی ذات از عالمیان است، با وجود ظهور عالم از او به خاطر ذاتش نه به خاطر امر دیگری. پس او «غَنِيٌّ عَنِ الْعالَمِينَ (از عالمیان بی‌نیاز است)»، پس او آزاد است و عالم به او نیازمند است، پس عالم بندگان هستند و هرگز آزادی ندارند. پس هنگامی که الوهیت آن‌ها را به احکامی که مکلف کرده است، می‌طلبد، احکامی که ظهور الوهیت جز به واسطه آن‌ها نیست، اضافات (نسبت‌ها) ظاهر می‌شوند. پس امر از دو طرف متوقف بر یکدیگر می‌شود. پس آزادی ممتنع است که در یکی از مضافین (طرفین نسبت) برقرار باشد. پس کسی که گفته است حق معروف است، نمی‌داند؛ همان‌گونه که کسی که گفته است حق مجهول است، نمی‌داند. این است حال آزادی (الحرية) که آن را به اختصار و با دسترسی و فهم آسان به پایان رساندیم."
  },
  "page_count": 2
}