{
  "id": 419,
  "title": {
    "ar": "الباب التاسع عشر وأربعمائة في معرفة منازلة الصكوك وهي المناشير والتوقيعات الإلهية",
    "en": "Chapter Four Hundred and Nineteen: Concerning the Gnosis of the Level of the Decrees (منازلة الصكوك), which are the Divine Proclamations (المناشير) and Endorsements (التوقيعات الإلهية).",
    "ur": "باب چار سو انیس: صکوک (الصكوك) کی منازل (منازلة) کی معرفت (المعرفۃ) کے بارے میں، جو کہ الٰہی مناشیر (المناشير) اور توقیعات (التوقيعات الإلهية) ہیں۔",
    "fa": "باب چهارصد و نوزدهم در معرفت منازل صکوک (الصكوك) که همان منشورها و توقیعات الهی هستند"
  },
  "content": {
    "ar": "## «الباب التاسع عشر وأربعمائة في معرفة منازلة الصكوك وهي المناشير والتوقيعات الإلهية»\n\n\n> إن التواقيع برهان يدل على *** ثبوت ملك الذي في الحكم يعطيها\n\n\n> بها قد استخلف الرحمن والدنا *** فهي الدليل على إثبات معطيها\n\n\n> والحكم يكشفها في كل نازلة *** وعندنا حالة فيها تغطيها\n\n\n> إن النفوس لتدري ما نطقت به *** وليس يمنعها إلا تعاطيها\n\n\n### [إن لله في أرضه سفيرا وهو الروح الأمين‏]\n\n\nاعلم أن الله تعالى لما شاء أن يجعل في أرضه خلفاء على من يعمرها من الإنس والجان وجميع الحيوانات وقدمهم ورشحهم للامامة دون غيرهم من جنسهم جعل بينه وبينهم سفيرا وهو الروح الأمين وسخر لهم ما في السَّماواتِ من ملك وكوكب سابح في فلك وما في الْأَرْضِ وما بينهما من الخلق جَمِيعاً مِنْهُ وأباح لهم جميع ما في الأرض أن‏\n\n\nيتصرفوا فيه وأيد هؤلاء الخلفاء بالآيات البينات ليعلم المرسلون إليهم أن هؤلاء خلفاء الله عليهم ومكنهم من الحكم في رعيتهم بالأسماء الإلهية على وجه يسمى التعلق وشرع لهم في نفوسهم شرائع وحد لهم حدودا ورسم لهم مراسم يقفون عندها يختصون بها لا يجوز لأحد من رعاياهم أن يتخذوها لأنفسهم شرائع ولا يقتدون بهم فيها ثم نصب لهم شرائع يعملون بها هم ورعيتهم وكتب لهم كتبا بذلك نزلت بها السفراء عليهم ليسمعوها رعيتهم فيعلموا حدود ما أنزل الله الذي استخلف عليهم فيقفوا عندها ويعملوا بها سرا وجهرا فمنها ما كتبه بيده تعالى وهو التوراة ومنها ما نَزَلَ به الرُّوحُ الْأَمِينُ عليهم من الكتاب المكنون الذي نزل من الله من عرشه المنقول من الدفتر الأعظم وهو الإمام المبين فهو معه على عرشه ونقل منه في اللوح المحفوظ قدر ما يقع به التصريف في الدنيا إلى يوم القيامة يتضمن ما في العالم من حركة وسكون واجتماع وافتراق ورزق وأجل وعمل ثم أنزل ذلك كله في كِتابٍ مَكْنُونٍ إلى السماء الدنيا وجعله بِأَيْدِي سَفَرَةٍ كِرامٍ بَرَرَةٍ مطهرين أرواح قدس صحفا مكرمة مرفوعة مطهرة فيها توقيعات إلهية بما وعد الله المؤمنين بالله وملائكته وكتبه ورسله وما جاءت به رسله من اليوم الآخر والبعث الآخر وما يكون في ذلك اليوم من حكم الله في خلقه وتولى الله ذلك كله بنفسه على صورة الحق الذي بعث به رسله ليصدقهم عند عبيده فعلا بحكمه ذلك فيهم كما صدقهم في حال احتجابه بما أيدهم به من الآيات فآمن من آمن وكفر من كفر فتوقف الأمر على ظهوره لعباده فيتولى الفصل بينهم بحكمه بنفسه وهُوَ الْعَزِيزُ الْعَلِيمُ فإذا فصل وحكم وعدل وأفضل جعلهم في الفصل فريقين فَرِيقٌ في الْجَنَّةِ وفَرِيقٌ في السَّعِيرِ وهو سجن الرحمن إنا جَعَلْنا جَهَنَّمَ لِلْكافِرِينَ حَصِيراً يريد سجنا يحصرهم فيه وينزل الفريق السعيد في دار كرامته وقيم ذلك الدار رضوان فإنها دار الرضوان ومتولي الدار الأخرى التي هي السجن مالك ومعناه الشديد يقال ملكت العجين إذا شددت عجنه قال قيس ابن الخطيم يصف طعنة\n\n\n> ملكت بها كفي فانهرت فتقها *** يرى قائم من دونها ما وراءها\n\n\nيقول شددت بها كفي فنزلت التوقيعات بما للمؤمنين من الخير عند الله العاملين الحافظين حدود الله من الْمُسْلِمِينَ والْمُسْلِماتِ ... والْقانِتِينَ والْقانِتاتِ والصَّادِقِينَ والصَّادِقاتِ والصَّابِرِينَ والصَّابِراتِ والْخاشِعِينَ والْخاشِعاتِ والْمُتَصَدِّقِينَ والْمُتَصَدِّقاتِ والصَّائِمِينَ والصَّائِماتِ والْحافِظِينَ فُرُوجَهُمْ والْحافِظاتِ والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ والتائبين والتائبات والعابدين والعابدات والحامدين والحامدات والسائحين والسائحات والراكعين والراكعات والساجدين والساجدات والآمرين بالمعروف والآمرات والناهين عن المنكر والناهيات والمعرضين عن اللغو والمعرضات والَّذِينَ هُمْ عَلى‏ صَلاتِهِمْ دائِمُونَ وما هم عنها بساهين إلى مثل هذا مما أوقع الله في توقيعاته من الصفات المرضية التي‏\nيحمدها ثم بشرهم تعالى بأنهم الوارثون الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ وهو أوسط الجنات فقال هُمْ فِيها خالِدُونَ يبشرهم بالبقاء والدوام في النعيم وأخبرهم في التوقيع أنه عنهم راض تعالى وتقدس جلاله ثم إنه ناب عنهم في الخطاب بأنهم عنه راضون فقال تعالى رَضِيَ الله عَنْهُمْ ورَضُوا عَنْهُ وهنا نكتة لمن فهم ما تدل عليه ألفاظ القرآن من الرضي فقطع عليهم بذلك لعلمه بأنه واقع منهم ثم إنه أنزل في الكتب والصحف وعلى السنة الخلفاء صلوات الله عليهم وسلامه من الوعيد والتهديد وأخذ من كفر بالله ونافق أو آمن ببعض وكفر ببعض مما أنزله الله وجحد وأشرك وكذب وظلم واعتدى وأساء وخالف وعصى وأعرض وفسق وتولى وأدبر وأخبر في التوقيع أنه من كان بهذه المثابة وقامت به هذه الصفات في الحياة الدنيا أو بعضها ثم تاب إلى الله منها في الدنيا ومات على توبة من ذلك كله فإنه يلقي ربه وهو راض عنه فإن فسح له وأنسا الله في أجله بعد توبته فعمل عملا صالحا بدل الله سيئاته حسنات أي ما كان يتصرف به من السوء عاد يتصرف فيه حسنا فبدل الله فعله بما وفقه إليه من طاعته ورحمه وغفر له جميع ما كان وقع منه قبل ذلك ولم يؤاخذه بشي‏ء منه وما زالت التوقيعات الإلهية تنزل من الله على خلفائه بما يعدهم الله به من آمن بالله ورسله من الخير وما توعد به لمن كفر به من الشر مدة إقامة ذلك الخليفة المنزل عليه وهو الرسول إلى حين موته فمن زمان خلافته إلى انتهاء مدة عمره لا تزال التوقيعات الإلهية تنزل عليه فإذا مات واستخلف من شاء بوحي من الله له في ذلك أو ترك الأمر شورى بين أصحابه فيولون من يجمعون عليه إلى أن يبعث الله من عنده رسولا فيقيم فيهم خليفة آخر إلا إذا كان خاتم الخلفاء فإن الله يقيم نوابا عنه فيكونون خلفاء الخليفة من عند الله لا إنهم في منزلة الرسل خلفاء من عند الله وهم الأقطاب وأمراء المؤمنين إلى يوم القيامة فمن هؤلاء النواب من يكشف الله عنه الغطاء فيكون من أهل العين والشهود فيدعو إلى الله على بصيرة كما دعا الرسول عليه السلام ولو لا إن الزمان قد اقتضى أن لا يكون مشرع بعد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لكان هؤلاء مشرعين وإن لم يأتوا إلا بشرع رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فإنهم كانوا يكونون فيه كما كان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في شرع من قبله إذا حكم به في أمته فهو فيه بمنزلة الأول الذي كان قبله لا أنه خليفة عنه في ذلك وإن قرره فلما منع الله ذلك في هذه الأمة علمنا أنهم خلفاء رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وإن دعوا إلى الله على بصيرة كما دعا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم كما ورد في القرآن العزيز عنه في قوله أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وسمانا ورثة وأخبر صَلَّى اللهُ عَليهِ وسَلَّم أنه ما ورثنا إلا العلم‏\n\n\nإن دعاءه صَلَّى اللهُ عَليهِ وسَلَّم في إن يمتعه الله بسمعه ليسمع كلام الله وبصره ليرى آيات الله في الآفاق وفي نفسه ثم قال واجعل ذلك الوارث منا\n\n\nيعني السمع والبصر فإن الله هو خير الوارثين وقد قال تعالى في الخبر الصحيح عنه كنت سمعه وبصره‏\n\n\nفهوية الحق إذا كانت سمع العبد وبصره كان الحق الوارث منه الذي هو عين سمعه وبصره فدعا بهذه الصفة أن تكون له حتى يقبض عليها فكأنه يقول اللهم متعنا بك فأنت سمعنا وبصرنا وأنت ترثنا إذا متنا فإنك أخبرت إنك خير الوارثين وإنك ترث الْأَرْضَ ومن عَلَيْها أي أنت الخير الذي يرثه الوارثون من خلفائهم وهم متبعو الرسل صلوات الله عليهم فهو تعالى الخير الذي يناله الوارثون كما أنه خير الوارثين من حيث إنه وارث وهكذا الإشارة في كل خير منسوب مضاف مثل خير الصابرين والشاكرين ومثل هذا مما ورد عن الله في أي شرع ورد ومن التوقيعات الإلهية أيضا المبشرات وهي جزء من أجزاء النبوة فأما أن تكون من الله إليه أو من الله على يدي بعض عباده إليه وهي الرؤيا يراها الرجل المسلم أو ترى له فإن جاءته من الله في رؤياه على يدي رسوله صَلَّى اللهُ عَليهِ وسَلَّم فإن كان حكما تعبد نفسه به ولا بد بشرط أن يرى الرسول صَلَّى اللهُ عَليهِ وسَلَّم على الصورة الجسدية التي كان عليها في الدنيا كما نقل إليه من الوجه الذي صح عنده حتى أنه إن رأى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يراه مكسور الثنية العليا فإن لم يره بهذا الأثر فما هو ذاك وإن تحقق أنه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ورآه شيخا أو شابا مغايرا للصورة التي كان عليها في الدنيا ومات عليها ورآه في حسن أزيد مما وصف له أو قبح صورة أو يرى الرائي إساءة أدب من نفسه معه فذلك كله الحق الذي جاء به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما هو رسول الله فيكون ما رآه هذا الرائي عين الشرع إما في البقعة التي يراه فيها وإما أن يرجع ما يراه‏\nإلى حال الرائي أو إلى المجموع غير ذلك لا يكون فإن جاءه بحكم في هذه الصورة فلا يأخذ به إن اقتضى ذلك نسخ حكم ثابت بالخبر المنقول الصحيح المعمول به بخلاف حكمه لو رآه على صورته فيلزمه الأخذ به ولا يلزم غيره ذلك فإن الله يقول الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ هذا هو الفرقان عند أهل الله بين الأمرين فإنهم قد يرونه صَلَّى اللهُ عَليهِ وسَلَّم في كشفهم فيصحح لهم من الأخبار ما ضعف عندهم بالنقل وقد ينفون من الأخبار ما ثبت عندنا بالنقل كما\n\n\nذكر مسلم في صدر كتابه عن شخص أنه رأى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في المنام فعرض عليه ألف حديث كان في حفظه فأثبت له صَلَّى اللهُ عَليهِ وسَلَّم من الألف ستة أحاديث وأنكر صَلَّى اللهُ عَليهِ وسَلَّم ما بقي‏\n\n\nفمن رآه صَلَّى اللهُ عَليهِ وسَلَّم في المنام فقد رآه في اليقظة ما لم تتغير عليه الصورة فإن الشيطان لا يتمثل على صورته أصلا فهو معصوم الصورة حيا وميتا فمن رآه فقد رآه في أي صورة رآه فالمبشرات من التوقيعات الإلهية وثم توقيعات أخر إلهية من الأسماء الإلهية تعرف إذا وردت على قلوب العارفين بالله في كشفهم وهو أن يكون التوقيع الذي يجي‏ء إلى هذا الولي من اسم خاص إلهي من الأسماء الحسنى مما دون الاسم الله فإنه ما يخرج منه في توقيع أصلا من حيث دلالته وإنما يخرج منه إذا ذكر مقيدا بحال يستدعي اسما خاصا بذلك الحال كني عن ذلك الاسم بالاسم الله لتضمنه خاصة وأكثر ما تخرج التوقيعات لأولياء الله من الله والرحمن والرب والملك لا غير هذا هو الغالب المستمر فإن خرج باسم غير ما ذكرنا فهو شاذ يحكم به على حد ما تعطيه حقيقة ذلك الاسم وهو دليل على مضمون ذلك التوقيع لهذا الولي فيتصرف فيه به بحسب ما يقتضيه ويحتاج هذا الولي إلى علم عظيم بالمواطن وصور الأحوال ومراتب العالم وعلم المحو والإثبات والشئون الإلهية كل ذلك لا بد أن يعرفه العلماء بالله وإن لم يعرفوا ذلك وأمثاله فلا يتعدى قدره وليدخل في عمار الناس ويلزم الجماعة فإن يد الله معهم ومن شذ من الجماعة على غير بصيرة فقد شذ إلى النار بل صاحب البصيرة من المحال أن يشذ عن الجماعة فإنه لا يشذ عن يد الله ولكن يعلم وهو في الجماعة ومعها ما لا يعلمه واحد وأحد من الجماعة إلا من كان مثله فهو مع من هو مثله جماعة ما هو ممن صلى وحده فالسعيد من وقف عند حدود الله ولم يتجاوزها وأنا والله ما تجاوزنا منها حدا ولكن أعطانا الله من الفهم عنه تعالى فيها ما لم يعطه كثيرا من خلقه فدعونا إلى الله على بصيرة من أمره إذ كنا على بينة من ربنا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 419: Concerning the Knowledge of the Descent of the Decrees (al-Ṣukūk), which are the Divine Edicts (al-Manāshīr) and Signatures (al-Tawqī‘āt)\n\nIndeed, the Signatures are a proof that indicates\nThe established sovereignty of the One who grants them in the Decree.\n\nBy them, the All-Merciful appointed our father (Adam) as Vicegerent,\nThus, they are the evidence for establishing the Giver thereof.\n\nAnd the Decree unveils them in every descent (or event),\nYet, we have a state in which it conceals them.\n\nIndeed, the souls know what I have spoken,\nAnd nothing prevents them (from knowing) except their own engagement (with the world).\n\n### [Indeed, Allah has an Ambassador on His earth, and that is the Trustworthy Spirit (al-Rūḥ al-Amīn)]\n\nKnow that when Allah the Exalted willed to place Vicegerents (khulafā’) on His earth over those who inhabit it—humans, jinn, and all animals—He advanced them and nominated them for the Imamate (leadership) above others of their kind. He established an Ambassador between Himself and them, who is the Trustworthy Spirit (al-Rūḥ al-Amīn). He subjugated to them what is in the heavens—of angels and planets swimming in their orbits—and what is in the earth and what is between them of creation, all of it being *from Him*. He permitted them to dispose of all that is on the earth. He supported these Vicegerents with clear signs (al-āyāt al-bayyināt) so that those sent to them would know that these are Allah’s Vicegerents over them. He enabled them to rule over their subjects by means of the Divine Names (al-Asmā’ al-Ilāhiyya) in a manner called \"attachment\" (al-ta‘alluq).\n\nHe legislated for them, within their own souls, specific laws (sharā’i‘), defined boundaries (ḥudūd), and prescribed rites (marāsim) at which they must stop, which are exclusive to them. It is not permissible for any of their subjects to adopt these as laws for themselves or to imitate them in these matters. Then He established for them laws by which they and their subjects operate. He wrote Books for them concerning this, which the Ambassadors brought down to them so that their subjects might hear them, know the boundaries of what Allah—Who appointed them as Vicegerents—has revealed, and thus abide by them and act upon them secretly and openly.\n\nOf these, some He wrote with His own Hand, which is the Torah (al-Tawrāh). And some were brought down to them by the Trustworthy Spirit (al-Rūḥ al-Amīn) from the Hidden Book (al-Kitāb al-Maknūn), which descended from Allah’s Throne, transferred from the Greatest Register (al-Daftar al-A‘ẓam), which is the Clear Imam (al-Imām al-Mubīn). This Register is with Him upon His Throne. From it, a measure was transferred into the Preserved Tablet (al-Lawḥ al-Maḥfūẓ)—the measure by which the disposition (al-taṣrīf) of the world occurs until the Day of Resurrection—encompassing all movement and stillness, gathering and separation, provision, appointed term (ajal), and action within the Cosmos (al-‘Ālam).\n\nThen He sent all of that down in a <<كِتابٍ مَكْنُونٍ>> (Hidden Book) to the lowest heaven, placing it <<بِأَيْدِي سَفَرَةٍ كِرامٍ بَرَرَةٍ>> (in the hands of noble, righteous scribes/messengers)—purified, holy spirits, in honored, exalted, and purified scrolls (ṣuḥuf mukarrama)—containing Divine Signatures (tawqī‘āt ilāhiyya). These Signatures contain what Allah promised the believers in Allah, His angels, His Books, and His Messengers, and what His Messengers brought concerning the Last Day and the Final Resurrection, and what Allah’s judgment will be concerning His creation on that Day.\n\nAllah undertook all of this Himself, in the form of the Reality (al-Ḥaqq) with which He sent His Messengers, so that He might confirm them before His servants through the actual execution of His judgment upon them, just as He confirmed them during His concealment by the signs (al-āyāt) with which He supported them. Thus, some believed and some disbelieved. The matter then rests upon His manifestation to His servants, whereupon He will undertake the separation between them by His own judgment, <<وَهُوَ الْعَزِيزُ الْعَلِيمُ>> (and He is the Almighty, the All-Knowing).\n\nWhen He separates, judges, acts justly, and shows favor, He places them into two groups in the separation: <<فَرِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِ>> (a group in Paradise and a group in the Blazing Fire). The Fire is the prison of the All-Merciful, for <<إِنَّا جَعَلْنَا جَهَنَّمَ لِلْكَافِرِينَ حَصِيراً>> (Indeed, We have made Hell a confinement for the disbelievers), meaning a prison that confines them therein. He settles the felicitous group in the Abode of His Generosity, the custodian of which is Riḍwān, for it is the Abode of Contentment (Dār al-Riḍwān). The superintendent of the other abode, which is the prison, is Mālik, whose name means \"the Severe\" or \"the Strong.\"\n\nIt is said, \"I *malaktu* the dough\" when you kneaded it vigorously (i.e., made it strong). Qays ibn al-Khaṭīm said, describing a stab:\n\nI strengthened my hand with it, and its opening gushed forth,\nOne standing before it sees what lies behind it.\n\nHe means: I strengthened my hand with it. The Signatures then descended concerning the good that awaits the believers with Allah—those who act and preserve the boundaries of Allah—of the Muslim men and Muslim women, the devout men and devout women, the truthful men and truthful women, the patient men and patient women, the humble men and humble women, the charitable men and charitable women, the fasting men and fasting women, the men who guard their private parts and the women who guard them, and the men who remember Allah often and the women who remember Him, and the repentant men and repentant women, the worshipping men and worshipping women, the praising men and praising women, the traveling/fasting men and traveling/fasting women, the bowing men and bowing women, the prostrating men and prostrating women, the men who enjoin good and the women who enjoin good, the men who forbid evil and the women who forbid evil, the men who turn away from vain talk and the women who turn away, and <<الَّذِينَ هُمْ عَلَى صَلَاتِهِمْ دَائِمُونَ>> (those who are constant in their prayer) and are not heedless of it—and similar qualities that Allah has decreed in His Signatures, which are the praiseworthy attributes that He commends.\n\nThen the Exalted gave them glad tidings that they are the inheritors, <<الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ>> (who will inherit al-Firdaws), which is the middle of the Gardens. He said, <<هُمْ فِيهَا خَالِدُونَ>> (They will abide therein eternally), giving them glad tidings of subsistence (al-baqā’) and permanence in bliss. He informed them in the Signature that He is pleased with them—Exalted and Sanctified is His Majesty. Then He spoke on their behalf, stating that they are pleased with Him, saying the Exalted, <<رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ>> (Allah is pleased with them, and they are pleased with Him). Herein lies a subtle point (nukta) for whoever understands what the words of the Quran indicate regarding contentment (al-riḍā): He decisively affirmed this for them because of His Knowledge that it would certainly occur from them.\n\nFurthermore, He revealed in the Books and Scrolls, and upon the tongues of the Vicegerents (may the blessings and peace of Allah be upon them), warnings and threats, and the seizure of those who disbelieved in Allah, or were hypocrites, or believed in part of what Allah revealed and disbelieved in part, or denied, or associated partners (shirk), or lied, or oppressed, or transgressed, or acted wrongly, or opposed, or disobeyed, or turned away, or acted wickedly, or retreated, or turned their backs. He informed in the Signature that whoever was in this state and possessed these attributes, or some of them, during the life of this world, and then repented to Allah from them while in the world, and died upon repentance from all of that, he will meet his Lord, and He will be pleased with him. If his term (ajal) was extended for him, and Allah granted him a delay after his repentance, and he performed righteous deeds, Allah will exchange his evil deeds for good deeds. That is, what he previously manifested as evil action, he returned to manifesting as good action. Thus, Allah exchanged his action through the obedience He granted him, and He showed him mercy and forgave all that had occurred from him before that, and He will not hold him accountable for any of it.\n\nThe Divine Signatures (al-Tawqī‘āt al-Ilāhiyya) continued to descend from Allah upon His Vicegerents (khulafā’), containing the good that Allah promised those who believe in Allah and His Messengers, and the evil He threatened those who disbelieve in Him, throughout the duration of the stay of that Vicegerent upon whom the revelation descends—who is the Messenger—until his death. From the time of his vicegerency until the end of his life span, the Divine Signatures continue to descend upon him. When he dies, and Allah appoints a successor (khalīfa) by revelation to him concerning that, or if he leaves the matter as consultation (shūrā) among his companions, who then appoint the one upon whom they agree, this continues until Allah sends a Messenger from Himself who establishes another Vicegerent among them.\n\nThis is unless he is the Seal of the Vicegerents (Khātim al-Khulafā’), in which case Allah establishes deputies (nuwwāb) on his behalf. These deputies are the Vicegerents of the Vicegerent, appointed by Allah, but they are not in the rank of Messengers who are Vicegerents appointed by Allah. These are the Poles (al-Aqṭāb) and the Commanders of the Faithful (Umara’ al-Mu’minīn) until the Day of Resurrection.\n\nAmong these deputies are those from whom Allah removes the veil (al-ghiṭā’), so they become people of direct vision (al-‘ayn) and Witnessing (al-shuhūd). They call to Allah upon clear insight (baṣīra), just as the Messenger (peace be upon him) called. Were it not that the age necessitated that there be no lawgiver (musharri‘) after the Messenger of Allah (PBUH), these individuals would have been lawgivers. Even if they only brought the Law (shar‘) of the Messenger of Allah (PBUH), they would have been in relation to it as the Messenger of Allah (PBUH) was in relation to the Law of those before him: when he judged by it among his community, he was in the position of the first one who preceded him, not merely a successor to him in that matter, even if he confirmed it. Since Allah prohibited this (new legislation) for this Community, we know that they are the Vicegerents of the Messenger of Allah (PBUH), even though they call to Allah upon clear insight (baṣīra), just as the Messenger of Allah (PBUH) called, as mentioned in the Glorious Quran concerning him in His saying: <<أَدْعُوا إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I call to Allah upon clear insight—I and whoever follows me). He named us inheritors (waratha), and the Prophet (PBUH) informed us that he only bequeathed Knowledge (al-‘Ilm) to us.\n\nIndeed, his prayer (PBUH) was that Allah grant him enjoyment of his hearing, so that he might hear the Speech of Allah, and his sight, so that he might see the signs (āyāt) of Allah in the horizons and in himself. Then he said, \"And make that the inheritor from us,\" meaning the hearing and the sight, for Allah is the Best of Inheritors (Khayr al-Wārithīn). The Exalted has said in the authentic sacred narration (al-khabar al-ṣaḥīḥ): \"I was his hearing and his sight.\" If the Identity of the Real (Huwiyyat al-Ḥaqq) is the servant’s hearing and sight, then the Real (al-Ḥaqq) is the Inheritor from him, being the very essence (‘ayn) of his hearing and sight. Thus, he prayed for this Attribute to be his until he is taken by it. It is as if he were saying: \"O Allah, grant us enjoyment through You, for You are our hearing and our sight, and You inherit us when we die, for You informed us that You are the Best of Inheritors (Khayr al-Wārithīn), and that You <<تَرِثُ الْأَرْضَ وَمَنْ عَلَيْهَا>> (inherit the earth and whoever is upon it).\" That is, You are the Good (al-Khayr) that the inheritors—who are the followers of the Messengers (may the blessings of Allah be upon them)—inherit from their predecessors. Thus, He the Exalted is the Good that the inheritors attain, just as He is the Best of Inheritors in the sense that He is the Inheritor. This is the implication in every attributed and annexed \"Good,\" such as \"the Best of the Patient\" (Khayr al-Ṣābirīn) and \"the Best of the Thankful\" (Khayr al-Shākirīn), and similar phrases that have been reported from Allah in any revealed Law (shar‘).\n\nAmong the Divine Signatures are also the Glad Tidings (al-Mubashshirāt), which are a part of prophecy (al-Nubuwwa). These may come either from Allah directly to him, or from Allah through the hands of some of His servants to him. This is the vision (al-ru’yā) that the Muslim man sees, or that is seen for him. If it comes to him from Allah in his vision through the Messenger (PBUH), and it contains a ruling, he must necessarily worship Allah according to it, provided that he sees the Messenger (PBUH) in the physical form he possessed in the world, as authentically transmitted to him. This means that if he sees the Messenger of Allah (PBUH), he must see him with the broken upper incisor tooth (al-thaniyya al-‘ulyā). If he does not see him with this mark, then it is not that (i.e., not a binding ruling).\n\nHowever, if he is certain that it is the Messenger of Allah (PBUH), yet he sees him as an old man or a young man, differing from the form he had in the world and upon which he died, or he sees him with greater beauty than described to him, or with an ugly form, or the seer perceives a lack of proper conduct from himself toward the Prophet—all of that is the Reality (al-Ḥaqq) that the Messenger of Allah (PBUH) brought, but it is not the Messenger of Allah himself (in his physical form). Thus, what this seer sees is the very essence (‘ayn) of the Law (al-Shar‘), either concerning the location where he sees it, or relating to the state of the seer himself, or relating to the collective—it cannot be otherwise. If a ruling comes to him in this (changed) form, he should not adopt it if it necessitates the abrogation (naskh) of a ruling established by authentic, transmitted, and practiced tradition. This differs from a ruling received if he sees him in his (original) form, in which case he is obligated to adopt it, though no one else is obligated. This is because Allah says: <<الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ>> (This day I have perfected for you your religion).\n\nThis is the Criterion (al-Furqān) among the People of Allah (Ahl Allāh) between the two matters. They may see him (PBUH) in their Unveiling (kashf), and he may authenticate for them traditions (akhbār) that were weak according to transmission (naql), or they may negate traditions that were established for us by transmission, just as Muslim mentioned at the beginning of his book concerning a person who saw the Messenger of Allah (PBUH) in a dream and presented to him a thousand hadiths he had memorized. The Prophet (PBUH) authenticated only six hadiths out of the thousand and rejected the rest.\n\nWhoever sees him (PBUH) in a dream has indeed seen him in wakefulness, provided the form does not change for him, for Satan cannot assume his form at all. His form is protected (ma‘ṣūm), alive or dead. Whoever sees him has seen him, in whatever form he saw him.\n\nThe Glad Tidings (al-Mubashshirāt) are among the Divine Signatures. There are also other Divine Signatures derived from the Divine Names (al-Asmā’ al-Ilāhiyya), which are recognized when they descend upon the hearts of the Gnostics (al-‘Ārifīn bi-Allāh) during their Unveiling (kashf). This occurs when the Signature that comes to this Saint (walī) originates from a specific Divine Name among the Beautiful Names (al-Asmā’ al-Ḥusnā), excluding the Name *Allah*. Nothing issues forth from the Name *Allah* in a Signature, in terms of its specific indication. Rather, it issues forth from it only when mentioned restricted by a state that necessitates a specific Name for that state, and that Name is then referred to by the Name *Allah* because it encompasses that specific quality. Most Signatures issued to the Saints of Allah originate from *Allah*, *al-Raḥmān* (the All-Merciful), *al-Rabb* (the Lord), and *al-Malik* (the Sovereign), and no others. This is the continuous and dominant pattern. If a Signature issues forth under a Name other than those mentioned, it is an anomaly (shādhdh). It is judged according to what the Reality (ḥaqīqa) of that Name grants, and it serves as evidence for the content of that Signature for that Saint. He then acts upon it according to what it requires. This Saint requires great Knowledge (‘ilm ‘aẓīm) concerning the stations (al-mawāṭin), the forms of the states (ṣuwar al-aḥwāl), the Levels of the Cosmos (marātib al-‘ālam), the science of Effacement and Affirmation (al-Maḥw wa al-Ithbāt), and the Divine Affairs (al-Shu’ūn al-Ilāhiyya).\n\nAll of this must be known by the Scholars of Allah (al-‘Ulamā’ bi-Allāh). If they do not know this and similar matters, they should not exceed their capacity, but should join the general populace (al-nās) and adhere to the Community (al-Jamā‘a), for the Hand of Allah is with them. Whoever deviates from the Community without clear insight (baṣīra) has deviated toward the Fire. Rather, it is impossible for the possessor of clear insight (ṣāḥib al-baṣīra) to deviate from the Community, for he does not deviate from the Hand of Allah. However, while he is within the Community and with it, he knows what no single member of the Community knows, except for those who are like him. Thus, he is a community (jamā‘a) with those who are like him, not one who prays alone. Therefore, the felicitous one is he who stops at the boundaries of Allah and does not transgress them. By Allah, we have not transgressed any boundary, but Allah has granted us such understanding of Him concerning them that He has not granted to many of His creation. Thus, we call to Allah upon clear insight (baṣīra) regarding His command, since we are upon clear evidence from our Lord. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو انیس (419): صکوک (فرامین) کے مقامات کی معرفت میں، جو کہ منشورات اور توقیعات الٰہیہ (الٰہی دستخط شدہ احکام) ہیں۔\n\n> بے شک توقیعات (توقیعات) وہ برہان ہیں جو اس حاکم کی بادشاہت کے ثبوت پر دلالت کرتی ہیں جو انہیں حکم میں عطا کرتا ہے۔\n>\n> انہی کے ذریعے رحمن نے ہمارے والد (آدم) کو خلیفہ بنایا، پس یہ ان کے عطا کرنے والے کے اثبات پر دلیل ہیں۔\n>\n> اور حکم (حکم) ہر نازل ہونے والے معاملے میں انہیں ظاہر کرتا ہے، اور ہمارے ہاں ایک ایسی حالت ہے جس میں وہ انہیں چھپا دیتا ہے۔\n>\n> بے شک نفوس جانتے ہیں کہ انہوں نے کیا کہا، اور انہیں اس سے صرف ان کا دنیاوی تعامل (تعاطی) ہی روکتا ہے۔\n\n### [بے شک اللہ کے لیے اس کی زمین میں ایک سفیر ہے اور وہ الروح الأمین (روح الامین) ہے]\n\nجان لو کہ جب اللہ تعالیٰ نے اپنی زمین میں ان لوگوں پر خلفاء (خلفاء) مقرر کرنے کا ارادہ فرمایا جو اسے آباد کرتے ہیں، یعنی انسان، جن اور تمام حیوانات، اور انہیں ان کی جنس کے دوسروں کے بجائے امامت کے لیے آگے بڑھایا اور نامزد کیا، تو اس نے اپنے اور ان کے درمیان ایک سفیر مقرر کیا، اور وہ الروح الأمین (روح الامین) ہے۔ اور اس نے ان کے لیے آسمانوں میں موجود ہر چیز کو مسخر کر دیا، جیسے فرشتے، اور فلک میں تیرتے ستارے، اور زمین میں موجود ہر چیز، اور جو کچھ ان دونوں کے درمیان ہے، تمام مخلوقات کو اپنی طرف سے (جَمِيعاً مِنْهُ)۔ اور انہیں زمین میں موجود ہر چیز میں تصرف کرنے کی اجازت دی، اور ان خلفاء (خلفاء) کی واضح نشانیوں (آیات بینات) کے ذریعے تائید کی تاکہ جن کی طرف انہیں بھیجا گیا ہے وہ جان لیں کہ یہ ان پر اللہ کے خلفاء (خلفاء) ہیں۔ اور اس نے انہیں اسماء الٰہیہ (الأسماء الإلهية) کے ذریعے اپنی رعایا پر حکم چلانے کی طاقت دی، اس طریقے پر جسے التعلق (تعلق) کہا جاتا ہے۔ اور ان کے نفوس میں ان کے لیے شریعتیں مقرر کیں، ان کے لیے حدود مقرر کیں، اور ان کے لیے ایسے مراسم (طریقے) وضع کیے جن پر وہ ٹھہرتے ہیں، جو ان کے ساتھ خاص ہیں، اور ان کی رعایا میں سے کسی کے لیے جائز نہیں کہ وہ انہیں اپنے لیے شریعت بنائے یا ان میں ان کی پیروی کرے۔ پھر اس نے ان کے لیے ایسی شریعتیں مقرر کیں جن پر وہ اور ان کی رعایا عمل کرتے ہیں، اور اس بارے میں ان کے لیے کتابیں لکھیں جنہیں سفراء (سفراء) ان پر لے کر نازل ہوئے تاکہ ان کی رعایا انہیں سنیں اور ان حدود کو جانیں جو اللہ نے نازل کی ہیں جس نے انہیں ان پر خلیفہ بنایا ہے، تاکہ وہ ان پر ٹھہریں اور ان پر خفیہ اور اعلانیہ عمل کریں۔ ان میں سے کچھ وہ ہیں جو اللہ تعالیٰ نے اپنے ہاتھ سے لکھیں، اور وہ تورات ہے۔ اور ان میں سے کچھ وہ ہیں جو الرُّوحُ الْأَمِينُ (روح الامین) ان پر لے کر نازل ہوئے، جو الْكِتَابِ الْمَكْنُونِ (کتاب مکنون) ہے جو اللہ کی طرف سے اس کے عرش سے نازل ہوا، جو الدفتر الأعظم (دفتر اعظم) سے منتقل کیا گیا ہے، اور وہ الْإِمَامِ الْمُبِينِ (امام مبین) ہے۔ پس وہ اس کے عرش پر اس کے ساتھ ہے، اور اس میں سے اللوح المحفوظ (لوح محفوظ) میں اتنی مقدار منتقل کی گئی ہے جس سے دنیا میں قیامت تک تصرف واقع ہوتا ہے، جس میں عالم کی حرکت و سکون، اجتماع و افتراق، رزق، مدت، اور عمل شامل ہے۔ پھر یہ سب کچھ ایک كِتَابٍ مَكْنُونٍ (کتاب مکنون) میں آسمان دنیا پر نازل کیا گیا، اور اسے بِأَيْدِي سَفَرَةٍ كِرَامٍ بَرَرَةٍ (ایسے لکھنے والوں کے ہاتھوں میں جو معزز، نیکوکار ہیں) رکھا گیا، جو پاکیزہ قدسی ارواح ہیں، مکرم، بلند، پاکیزہ صحیفے ہیں، جن میں توقیعات الٰہیہ (توقيعات إلهية) ہیں، ان وعدوں کے ساتھ جو اللہ نے اللہ، اس کے فرشتوں، اس کی کتابوں اور اس کے رسولوں پر ایمان لانے والوں سے کیے ہیں، اور جو کچھ اس کے رسول یوم آخرت اور بعث آخرت کے بارے میں لائے ہیں، اور جو کچھ اس دن اللہ کا اپنی مخلوق کے بارے میں حکم ہو گا۔ اور اللہ نے یہ سب کچھ خود اپنے ذمہ لیا، اس الحق (حق) کی صورت میں جسے اس نے اپنے رسولوں کے ساتھ بھیجا تاکہ وہ اپنے بندوں کے سامنے اپنے حکم کے ذریعے ان کی تصدیق کرے، جیسا کہ اس نے ان کی پردہ پوشی کی حالت میں ان کی تائید آیات کے ذریعے کی، پس جس نے ایمان لانا تھا وہ ایمان لایا اور جس نے کفر کرنا تھا وہ کفر کیا۔ پس معاملہ اپنے بندوں کے سامنے اس کے ظہور پر موقوف ہو گیا، تاکہ وہ خود اپنے حکم سے ان کے درمیان فیصلہ کرے۔ اور وہُوَ الْعَزِيزُ الْعَلِيمُ (وہ غالب، جاننے والا ہے)۔ پس جب وہ فیصلہ کرے گا، حکم دے گا، عدل کرے گا اور فضل کرے گا، تو وہ انہیں فیصلے میں دو گروہوں میں تقسیم کر دے گا: فَرِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِ (ایک گروہ جنت میں اور ایک گروہ دوزخ میں)۔ اور دوزخ رحمن کا قید خانہ ہے۔ إِنا جَعَلْنا جَهَنَّمَ لِلْكافِرِينَ حَصِيراً (بے شک ہم نے جہنم کو کافروں کے لیے قید خانہ بنا دیا ہے)، یعنی ایک قید خانہ جس میں وہ انہیں محدود کر دے گا۔ اور وہ سعید گروہ کو اپنی عزت کے گھر میں اتارے گا، اور اس گھر کا نگران رضوان ہے، کیونکہ وہ دار الرضوان (رضا کا گھر) ہے۔ اور دوسرے گھر کا متولی جو کہ قید خانہ ہے، مالک ہے، اور اس کا معنی ہے \"شدید\"۔ کہا جاتا ہے: \"ملکت العجین\" جب تم نے آٹے کو سختی سے گوندھا۔ قیس ابن الخطیم ایک نیزے کے وار کی تعریف کرتے ہوئے کہتا ہے:\n\n> میں نے اس کے ذریعے اپنی ہتھیلی کو مضبوط کیا، پس اس کا شگاف بہہ نکلا، جو اس کے پیچھے کھڑا ہے وہ اس کے پار دیکھتا ہے۔\n\nوہ کہتا ہے کہ میں نے اس کے ذریعے اپنی ہتھیلی کو مضبوط کیا، پس توقیعات (توقیعات) نازل ہوئیں جن میں ان مومنین کے لیے اللہ کے ہاں خیر کا ذکر ہے جو عمل کرنے والے، اللہ کی حدود کی حفاظت کرنے والے ہیں، جن میں الْمُسْلِمِينَ وَالْمُسْلِمَاتِ (مسلمان مرد اور مسلمان عورتیں)، وَالْقَانِتِينَ وَالْقَانِتَاتِ (فرمانبردار مرد اور فرمانبردار عورتیں)، وَالصَّادِقِينَ وَالصَّادِقَاتِ (سچے مرد اور سچی عورتیں)، وَالصَّابِرِينَ وَالصَّابِرَاتِ (صبر کرنے والے مرد اور صبر کرنے والی عورتیں)، وَالْخَاشِعِينَ وَالْخَاشِعَاتِ (عاجزی کرنے والے مرد اور عاجزی کرنے والی عورتیں)، وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ (صدقہ دینے والے مرد اور صدقہ دینے والی عورتیں)، وَالصَّائِمِينَ وَالصَّائِمَاتِ (روزہ رکھنے والے مرد اور روزہ رکھنے والی عورتیں)، وَالْحَافِظِينَ فُرُوجَهُمْ وَالْحَافِظَاتِ (اپنی شرمگاہوں کی حفاظت کرنے والے مرد اور حفاظت کرنے والی عورتیں)، وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ (اللہ کو کثرت سے یاد کرنے والے مرد اور یاد کرنے والی عورتیں)، اور توبہ کرنے والے مرد و عورتیں، عبادت کرنے والے مرد و عورتیں، حمد کرنے والے مرد و عورتیں، سیاحت کرنے والے مرد و عورتیں، رکوع کرنے والے مرد و عورتیں، سجدہ کرنے والے مرد و عورتیں، نیکی کا حکم دینے والے مرد و عورتیں، برائی سے روکنے والے مرد و عورتیں، لغو سے اعراض کرنے والے مرد و عورتیں، اور الَّذِينَ هُمْ عَلَى صَلَاتِهِمْ دَائِمُونَ (جو اپنی نمازوں پر ہمیشہ قائم رہتے ہیں) اور وہ اس سے غافل نہیں ہوتے، یہاں تک کہ ایسی ہی دیگر صفات مرضیہ (پسندیدہ صفات) جو اللہ نے اپنی توقیعات (توقیعات) میں نازل کیں جن کی وہ تعریف کرتا ہے۔ پھر اللہ تعالیٰ نے انہیں یہ خوشخبری دی کہ وہ وارث ہیں، الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ (جو فردوس کے وارث ہوں گے)، اور وہ جنتوں کا درمیانی حصہ ہے۔ پس فرمایا: هُمْ فِيهَا خَالِدُونَ (وہ اس میں ہمیشہ رہیں گے)، انہیں نعمتوں میں بقا (البقاء) اور دوام کی خوشخبری دی۔ اور توقیع (توقیع) میں انہیں خبر دی کہ وہ ان سے راضی ہے، اللہ تعالیٰ کی جلالت پاک اور بلند ہے۔ پھر اس نے ان کی طرف سے خطاب میں نیابت کی کہ وہ اس سے راضی ہیں، پس اللہ تعالیٰ نے فرمایا: رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ (اللہ ان سے راضی ہوا اور وہ اس سے راضی ہوئے)۔ اور یہاں ایک لطیف نکتہ ہے اس شخص کے لیے جو قرآن کے الفاظ سے رضا (الرضی) کی دلالت کو سمجھتا ہے، پس اس نے ان پر اس کا فیصلہ کر دیا کیونکہ وہ جانتا تھا کہ یہ ان کی طرف سے واقع ہو گا۔ پھر اس نے کتابوں اور صحیفوں میں اور خلفاء (خلفاء) کی زبانوں پر، ان پر اللہ کے درود و سلام ہوں، وعید اور دھمکی نازل کی، اور اس شخص کے لیے پکڑ کا ذکر کیا جس نے اللہ کا کفر کیا، یا منافقت کی، یا اللہ کی نازل کردہ بعض چیزوں پر ایمان لایا اور بعض کا کفر کیا، اور انکار کیا، اور شرک کیا، اور جھوٹ بولا، اور ظلم کیا، اور زیادتی کی، اور برا کیا، اور مخالفت کی، اور نافرمانی کی، اور اعراض کیا، اور فسق کیا، اور منہ موڑا، اور پیٹھ پھیری۔ اور توقیع (توقیع) میں خبر دی کہ جو شخص اس مرتبے پر تھا اور یہ صفات یا ان میں سے کچھ دنیا کی زندگی میں اس میں قائم تھیں، پھر اس نے دنیا میں ان سب سے اللہ کی طرف توبہ کی اور اسی توبہ پر فوت ہوا، تو وہ اپنے رب سے اس حال میں ملے گا کہ وہ اس سے راضی ہو گا۔ اور اگر اس کی توبہ کے بعد اس کی مدت میں وسعت دی گئی اور اللہ نے اسے مہلت دی، تو اس نے نیک عمل کیا، اللہ اس کی برائیوں کو نیکیوں سے بدل دے گا، یعنی جس برائی میں وہ تصرف کرتا تھا، وہ نیکی میں تصرف کرنے لگا، پس اللہ نے اس کے فعل کو اس اطاعت سے بدل دیا جس کی اس نے اسے توفیق دی، اور اس پر رحم کیا، اور اس سے پہلے جو کچھ بھی اس سے سرزد ہوا تھا اسے بخش دیا، اور اس پر کسی چیز کا مواخذہ نہیں کیا۔ اور توقیعات الٰہیہ (التوقيعات الإلهية) اللہ کی طرف سے اس کے خلفاء (خلفاء) پر مسلسل نازل ہوتی رہیں، ان خیر کے وعدوں کے ساتھ جو اللہ نے اللہ اور اس کے رسولوں پر ایمان لانے والوں سے کیے، اور اس شر کی وعید کے ساتھ جو اس نے کفر کرنے والوں سے کیا، اس خلیفہ (خلیفہ) کے قیام کی مدت تک جس پر وہ نازل ہوئیں، اور وہ رسول ہیں، ان کی وفات تک۔ پس ان کی خلافت کے زمانے سے لے کر ان کی عمر کی مدت کے اختتام تک توقیعات الٰہیہ (التوقيعات الإلهية) ان پر نازل ہوتی رہتی ہیں۔ پھر جب وہ فوت ہو جاتے ہیں اور اللہ جسے چاہتا ہے اس بارے میں وحی کے ذریعے خلیفہ مقرر کرتا ہے، یا وہ معاملہ اپنے اصحاب کے درمیان شوریٰ کے لیے چھوڑ دیتے ہیں، تو وہ اس شخص کو والی بناتے ہیں جس پر وہ متفق ہو جائیں، یہاں تک کہ اللہ اپنی طرف سے کوئی رسول بھیجے جو ان میں کوئی دوسرا خلیفہ (خلیفہ) مقرر کرے۔ سوائے اس کے کہ جب وہ خاتم الخلفاء (خاتم الخلفاء) ہوں، تو اللہ ان کی طرف سے نائبین مقرر کرتا ہے، جو اللہ کی طرف سے خلیفہ (خلیفہ) کے خلفاء (خلفاء) ہوتے ہیں، نہ کہ وہ رسولوں کے مرتبے میں اللہ کی طرف سے خلفاء (خلفاء) ہوں۔ اور وہ اقطاب (الأقطاب) اور امیر المؤمنین ہیں قیامت تک۔ ان نائبین میں سے کچھ ایسے ہیں جن سے اللہ پردہ ہٹا دیتا ہے، پس وہ اہل عین اور الشہود (شہود) میں سے ہوتے ہیں، اور وہ اللہ کی طرف بصیرت کے ساتھ دعوت دیتے ہیں، جیسا کہ رسول علیہ السلام نے دعوت دی۔ اور اگر زمانے کا تقاضا یہ نہ ہوتا کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے بعد کوئی نئی شریعت لانے والا نہ ہو، تو یہ لوگ شریعت لانے والے ہوتے، اگرچہ وہ صرف رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی شریعت ہی لاتے، کیونکہ وہ اس میں ایسے ہی ہوتے جیسے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم اپنے سے پہلے کی شریعت میں تھے جب وہ اپنی امت میں اس کے مطابق حکم کرتے تھے، تو وہ اس میں پہلے والے کے مرتبے میں ہوتے، نہ کہ اس کے خلیفہ (خلیفہ)۔ اگرچہ وہ اسے برقرار رکھتے۔ پس جب اللہ نے اس امت میں اس سے منع فرما دیا، تو ہم نے جان لیا کہ وہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے خلفاء (خلفاء) ہیں، اگرچہ وہ اللہ کی طرف بصیرت کے ساتھ دعوت دیتے ہیں، جیسا کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے دعوت دی، جیسا کہ قرآن عزیز میں ان کے قول میں وارد ہوا ہے: أَدْعُوا إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي (میں اور میرے پیروکار اللہ کی طرف بصیرت کے ساتھ دعوت دیتے ہیں)۔ اور اس نے ہمیں وارث کہا، اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے خبر دی کہ انہوں نے ہمارے لیے صرف علم ہی وراثت میں چھوڑا ہے۔\n\nبے شک رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی دعا کہ اللہ انہیں ان کے کان سے فائدہ دے تاکہ وہ اللہ کا کلام سنیں، اور ان کی آنکھ سے فائدہ دے تاکہ وہ آفاق اور اپنے نفس میں اللہ کی آیات دیکھیں، پھر فرمایا: \"اور اس وارث کو ہم میں سے بنا دے\"، یعنی کان اور آنکھ کو، کیونکہ اللہ ہی خیر الوارثین (بہترین وارث) ہے۔ اور اللہ تعالیٰ نے صحیح خبر میں ان کے بارے میں فرمایا ہے: \"میں اس کا کان اور اس کی آنکھ بن جاتا ہوں\"۔ پس جب الحق (ذات حق) کی ہویت (ہویت) بندے کا کان اور اس کی آنکھ ہو، تو الحق (ذات حق) ہی اس کا وارث ہوتا ہے جو اس کے کان اور اس کی آنکھ کا عین ہے۔ پس آپ صَلَّى اللهُ عَليهِ وسَلَّم نے اس صفت کے لیے دعا کی کہ وہ آپ کو حاصل ہو یہاں تک کہ آپ اس پر قبض کر لیں، فکأنه (گویا) آپ کہہ رہے تھے: \"اے اللہ! ہمیں اپنے ساتھ فائدہ دے، پس تو ہی ہمارا کان اور ہماری آنکھ ہے، اور تو ہی ہمیں وراثت میں لے گا جب ہم مر جائیں، کیونکہ تو نے خبر دی ہے کہ تو خیر الوارثین (بہترین وارث) ہے، اور تو ہی الْأَرْضَ وَمَنْ عَلَيْهَا (زمین اور جو کچھ اس پر ہے) کا وارث ہے\"۔ یعنی تو ہی وہ خیر ہے جسے وارث اپنے خلفاء (خلفاء) سے پاتے ہیں، اور وہ رسولوں کے پیروکار ہیں، ان سب پر اللہ کے درود ہوں۔ پس وہ تعالیٰ وہ خیر ہے جسے وارث حاصل کرتے ہیں، جیسا کہ وہ وارث ہونے کے لحاظ سے خیر الوارثین (بہترین وارث) ہے۔ اور اسی طرح اشارہ ہر منسوب اور مضاف خیر میں ہے، جیسے خیر الصابرین (صبر کرنے والوں کا بہترین) اور الشاکرین (شکر کرنے والوں کا بہترین)، اور اس طرح کی چیزیں جو اللہ کی طرف سے کسی بھی شریعت میں وارد ہوئی ہیں۔ اور توقیعات الٰہیہ (التوقيعات الإلهية) میں سے مبشرات (خوشخبریاں) بھی ہیں، اور وہ نبوت کے اجزاء میں سے ایک جز ہیں۔ یا تو وہ اللہ کی طرف سے براہ راست اس (ولی) کے لیے ہوتی ہیں، یا اللہ کی طرف سے اس کے بعض بندوں کے ہاتھوں اس تک پہنچتی ہیں، اور وہ رؤیا (رؤیا) ہے جو مسلمان شخص دیکھتا ہے یا اس کے لیے دیکھا جاتا ہے۔ اگر وہ رؤیا (رؤیا) میں اللہ کی طرف سے اس کے رسول صَلَّى اللهُ عَليهِ وسَلَّم کے ہاتھوں آئی ہے، تو اگر وہ کوئی حکم ہے تو وہ خود کو اس کا پابند بنائے گا اور یہ ضروری ہے، بشرطیکہ وہ رسول صَلَّى اللهُ عَليهِ وسَلَّم کو اسی جسمانی صورت پر دیکھے جو دنیا میں ان کی تھی، جیسا کہ اس شخص تک صحیح طریقے سے نقل کیا گیا ہے، یہاں تک کہ اگر وہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کو دیکھیں تو انہیں اوپر کا دانت ٹوٹا ہوا نظر آئے، اگر وہ انہیں اس اثر کے ساتھ نہ دیکھیں تو وہ آپ نہیں ہیں۔ اور اگر اسے یقین ہو جائے کہ وہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم ہیں، لیکن انہیں بوڑھا یا جوان دیکھے جو اس صورت سے مختلف ہو جس پر وہ دنیا میں تھے اور جس پر ان کی وفات ہوئی، یا انہیں بیان کردہ حسن سے زیادہ حسن میں دیکھے، یا بری صورت میں دیکھے، یا دیکھنے والا اپنے آپ سے ان کے ساتھ بدتمیزی دیکھے، تو یہ سب وہ الحق (حق) ہے جو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم لائے تھے، وہ رسول اللہ نہیں ہیں۔ پس جو کچھ اس دیکھنے والے نے دیکھا وہ عین شریعت ہو گا، یا تو اس جگہ کے بارے میں جہاں وہ انہیں دیکھتا ہے، یا جو کچھ وہ دیکھتا ہے وہ دیکھنے والے کے حال کی طرف لوٹے گا، یا مجموعی حالت کی طرف، اس کے علاوہ نہیں ہو سکتا۔ پس اگر وہ اس صورت میں کوئی حکم لے کر آئے تو وہ اسے نہ اپنائے اگر اس کا تقاضا صحیح منقول خبر سے ثابت شدہ معمول بہ حکم کو منسوخ کرنا ہو، بخلاف اس حکم کے اگر وہ انہیں ان کی صورت پر دیکھے، تو اس پر اس حکم کو اپنانا لازم ہو گا، لیکن دوسرے پر یہ لازم نہیں ہو گا۔ کیونکہ اللہ فرماتا ہے: الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ (آج میں نے تمہارے لیے تمہارا دین مکمل کر دیا)۔ اہل اللہ کے نزدیک ان دو معاملات میں یہی فرقان (فرق) ہے۔ کیونکہ وہ انہیں صَلَّى اللهُ عَليهِ وسَلَّم اپنے کشف (الکشف) میں دیکھ سکتے ہیں، تو وہ ان کے لیے ان اخبار کی تصحیح کر دیتے ہیں جو نقل کے ذریعے ان کے نزدیک ضعیف ہو چکی تھیں، اور کبھی وہ ان اخبار کی نفی کر دیتے ہیں جو ہمارے نزدیک نقل سے ثابت ہیں۔ جیسا کہ مسلم نے اپنی کتاب کے شروع میں ایک شخص کے بارے میں ذکر کیا کہ اس نے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کو خواب میں دیکھا، تو اس نے اپنے حفظ میں موجود ایک ہزار احادیث ان پر پیش کیں، تو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے ان ایک ہزار میں سے چھ احادیث کو ثابت کیا اور باقی کا انکار کر دیا۔ پس جس نے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کو خواب میں دیکھا، تو اس نے انہیں بیداری میں دیکھا، جب تک کہ ان کی صورت تبدیل نہ ہو۔ کیونکہ شیطان ان کی صورت پر ہرگز متمثل نہیں ہو سکتا، پس وہ زندہ اور مردہ دونوں حالتوں میں صورت کے لحاظ سے معصوم ہیں۔ پس جس نے انہیں دیکھا، اس نے انہیں دیکھا، خواہ وہ انہیں کسی بھی صورت میں دیکھے۔ پس مبشرات (خوشخبریاں) توقیعات الٰہیہ (التوقيعات الإلهية) میں سے ہیں۔ اور پھر دیگر توقیعات الٰہیہ (توقيعات إلهية) بھی ہیں جو اسماء الٰہیہ (الأسماء الإلهية) سے ہوتی ہیں، جنہیں اللہ کے عارفین (عارفین) اپنے کشف (الکشف) میں ان کے دلوں پر وارد ہونے پر پہچانتے ہیں۔ اور وہ یہ ہے کہ جو توقیع (توقیع) اس ولی کے پاس آتا ہے وہ اسماء الحسنیٰ (الأسماء الحسنى) میں سے کسی خاص اسم الٰہی (اسم إلهي) کی طرف سے ہوتا ہے، جو اسم اللہ سے کم تر ہو۔ کیونکہ اسم اللہ سے اس کی دلالت کے لحاظ سے کوئی توقیع (توقیع) بالکل نہیں نکلتا۔ بلکہ اس سے تب نکلتا ہے جب وہ کسی ایسی حالت کے ساتھ مقید ہو کر ذکر کیا جائے جو اس خاص حالت کے لیے ایک خاص اسم کا تقاضا کرتی ہو، اور اس اسم کو اسم اللہ سے کنایہ کیا گیا ہو کیونکہ وہ اس خاصیت کو شامل ہے۔ اور اولیاء اللہ کے لیے اکثر توقیعات (توقیعات) اللہ، الرحمن، الرب اور الملک کی طرف سے نکلتی ہیں، اس کے علاوہ نہیں۔ یہ غالب اور مسلسل طریقہ ہے۔ اگر وہ مذکورہ اسماء کے علاوہ کسی اور اسم سے نکلے تو وہ شاذ (غیر معمولی) ہے، اور اس پر اس حد تک حکم لگایا جائے گا جو اس اسم کی حقیقت عطا کرتی ہے۔ اور یہ اس ولی کے لیے اس توقیع (توقیع) کے مضمون پر دلیل ہوتا ہے، پس وہ اس کے تقاضے کے مطابق اس میں تصرف کرتا ہے۔ اور اس ولی کو مقامات، احوال کی صورتوں، عالم کے مراتب، اور علم المحو والإثبات (مٹانے اور ثابت کرنے کا علم) اور الشئون الإلهية (الٰہی شانوں) کا عظیم علم درکار ہوتا ہے۔ یہ سب کچھ اللہ کے علماء (علماء باللہ) کے لیے جاننا ضروری ہے، اور اگر وہ یہ اور اس جیسی چیزیں نہیں جانتے تو انہیں اپنی حد سے تجاوز نہیں کرنا چاہیے اور عام لوگوں کی آبادی میں شامل ہو جانا چاہیے اور جماعت کو لازم پکڑنا چاہیے، کیونکہ اللہ کا ہاتھ ان کے ساتھ ہے۔ اور جو شخص بصیرت کے بغیر جماعت سے الگ ہوا، تو وہ آگ کی طرف الگ ہوا۔ بلکہ صاحب بصیرت (بصیرت والا) کے لیے جماعت سے الگ ہونا محال ہے، کیونکہ وہ اللہ کے ہاتھ سے الگ نہیں ہوتا، لیکن وہ جماعت میں رہتے ہوئے اور ان کے ساتھ وہ کچھ جانتا ہے جو جماعت کا کوئی ایک فرد نہیں جانتا، سوائے اس کے جو اس جیسا ہو۔ پس وہ اپنے جیسے لوگوں کے ساتھ جماعت میں ہے، وہ ان میں سے نہیں جو اکیلے نماز پڑھتے ہیں۔ پس خوش نصیب وہ ہے جو اللہ کی حدود پر ٹھہرا اور ان سے تجاوز نہیں کیا۔ اور میں، اللہ کی قسم، ان میں سے کسی حد سے تجاوز نہیں کیا، لیکن اللہ نے ہمیں ان حدود میں اس سے ایسا فہم عطا کیا جو اس نے اپنی بہت سی مخلوق کو نہیں دیا، پس ہم نے اللہ کی طرف اس کے حکم کی بصیرت کے ساتھ دعوت دی، کیونکہ ہم اپنے رب کی طرف سے واضح دلیل پر تھے۔ اور وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و نوزدهم در معرفت جایگاه صکوک (فرامین)، که همان مناشیر و توقیعات الهی هستند.\n\nهمانا توقیعات، برهانی هستند که دلالت می‌کنند *** بر ثبوت مُلک کسی که در حکم، آن‌ها را عطا می‌کند.\n\nبه واسطه آن‌هاست که رحمان پدر ما را خلیفه ساخت *** پس آن‌ها دلیلی بر اثبات عطا کننده خود هستند.\n\nو حکم، آن‌ها را در هر واقعه‌ای آشکار می‌سازد *** و نزد ما حالتی است که در آن، آن‌ها را می‌پوشاند.\n\nهمانا نفوس می‌دانند آنچه را که به آن سخن گفته‌ام *** و چیزی جز پرداختن به آن، مانعشان نمی‌شود.\n\n### [همانا خداوند در زمین خود سفیری دارد و او روح الامین است]\n\nبدان که چون خداوند تعالی خواست در زمین خود بر کسانی که آن را آباد می‌کنند، از انس و جن و تمامی حیوانات، خلفایی قرار دهد و آن‌ها را بر دیگران از جنس خودشان برای امامت مقدم و شایسته ساخت، سفیری میان خود و آن‌ها قرار داد و او الروح الأمين (روح الامین) است. و آنچه در السَّماواتِ (آسمان‌ها) است از فرشتگان و ستارگان شناور در فلک، و آنچه در الْأَرْضِ (زمین) و آنچه میان آن دو است از خلق، جَمِيعاً مِنْهُ (همه از جانب اوست)، برای آن‌ها مسخر ساخت. و برایشان مباح ساخت که در تمام آنچه در زمین است تصرف کنند. و این خلفا را با آیات بینات (آیات روشن) تأیید کرد تا فرستادگان به سوی آن‌ها بدانند که اینان خلفای حق (الحق) بر آن‌ها هستند. و آن‌ها را قادر ساخت تا بر رعیت خود با اسماء الهی بر وجهی که التعلق (تعلق) نامیده می‌شود، حکم کنند. و در نفوسشان شرایعی وضع کرد و برایشان حدودی تعیین نمود و رسومی ترسیم کرد که نزد آن‌ها توقف کنند؛ این‌ها مختص به خودشان است و برای هیچ یک از رعایایشان جایز نیست که آن‌ها را برای خود شریعت قرار دهند یا در آن از ایشان پیروی کنند. سپس برای آن‌ها شرایعی نصب کرد که هم خودشان و هم رعیتشان به آن‌ها عمل کنند. و برایشان کتاب‌هایی در این باره نوشت که سفیران آن‌ها را بر ایشان نازل کردند تا رعیتشان آن‌ها را بشنوند و حدود آنچه را که خداوند، که آن‌ها را خلیفه خود قرار داده، نازل کرده است، بدانند و نزد آن‌ها توقف کرده و در نهان و آشکار به آن‌ها عمل کنند.\n\nپس برخی از آن‌ها را خداوند تعالی با دست خود نوشت و آن تورات است. و برخی دیگر را الرُّوحُ الْأَمِينُ (روح الامین) بر آن‌ها نازل کرد که از الْكِتابِ الْمَكْنُونِ (کتاب مکنون) است که از جانب خداوند از عرش او نازل شده و از دفتر اعظم که همان الإمام المبين (امام مبین) است، منتقل شده است. این کتاب نزد او بر عرش اوست و به اندازه آنچه تصرف در دنیا تا روز قیامت به آن واقع می‌شود، از آن در اللوح المحفوظ (لوح محفوظ) منتقل شده است؛ شامل هر آنچه در عالم است از حرکت و سکون، اجتماع و افتراق، رزق و اجل و عمل. سپس همه این‌ها را در كِتابٍ مَكْنُونٍ (کتابی پوشیده) به آسمان دنیا نازل کرد و آن را بِأَيْدِي سَفَرَةٍ كِرامٍ بَرَرَةٍ (به دست سفیرانی بزرگوار و نیکوکار) قرار داد؛ ارواح قدسی مطهر، صحیفه‌هایی گرامی، مرفوع و پاکیزه که در آن‌ها توقیعات الهی (توقيعات إلهية) است؛ شامل آنچه خداوند به مؤمنان به خدا و فرشتگان و کتاب‌ها و رسولانش وعده داده است، و آنچه رسولانش از روز آخر و بعث آخر آورده‌اند، و آنچه در آن روز از حکم خداوند در خلقش خواهد بود. و خداوند خود متولی همه آن شد بر صورت حقی (الحق) که رسولانش را با آن مبعوث کرد تا آن‌ها را نزد بندگانش عملاً با حکم خود در مورد ایشان تصدیق کند، همان‌گونه که در حال احتجاب (پنهانی) با تأیید آن‌ها به وسیله آیات، ایشان را تصدیق کرد. پس کسی که ایمان آورد، ایمان آورد و کسی که کفر ورزید، کفر ورزید. پس امر متوقف بر ظهور او برای بندگانش است تا خود به حکم خویش میان آن‌ها داوری کند و هُوَ الْعَزِيزُ الْعَلِيمُ (او عزیز و داناست) [قرآن، ابراهیم: ۴]. هنگامی که داوری و حکم کرد و عدالت ورزید و فضل نمود، آن‌ها را در داوری دو گروه قرار می‌دهد: فَرِيقٌ في الْجَنَّةِ (گروهی در بهشت) و فَرِيقٌ في السَّعِيرِ (گروهی در آتش سوزان) [قرآن، شوری: ۷]، که همان زندان رحمان است. إنا جَعَلْنا جَهَنَّمَ لِلْكافِرِينَ حَصِيراً (ما جهنم را برای کافران زندانی قرار دادیم) [قرآن، اسراء: ۱۰۴]؛ یعنی زندانی که آن‌ها را در آن محصور می‌کند. و گروه سعادتمند را در سرای کرامت خود جای می‌دهد و نگهبان آن سرا رضوان است، زیرا آن دار الرضوان (سرای خشنودی) است. و متولی سرای دیگر که زندان است، مالک است و معنای آن «شدید» است. گفته می‌شود: «ملکت العجین» یعنی خمیر را محکم ورز دادم. قیس بن خطیم در وصف ضربه‌ای می‌گوید:\n\nبا آن، دستم را محکم کردم، پس شکافش گشوده شد *** کسی که در مقابل آن ایستاده، پشت آن را می‌بیند.\n\n(می‌گوید: دستم را با آن محکم کردم.)\n\nپس توقیعاتی نازل شد شامل خیراتی که برای مؤمنانِ عامل و حافظ حدود الهی نزد خداوند است، از الْمُسْلِمِينَ والْمُسْلِماتِ (مردان و زنان مسلمان) و الْقانِتِينَ والْقانِتاتِ (مردان و زنان فرمانبردار) و الصَّادِقِينَ والصَّادِقاتِ (مردان و زنان راستگو) و الصَّابِرِينَ والصَّابِراتِ (مردان و زنان شکیبا) و الْخاشِعِينَ والْخاشِعاتِ (مردان و زنان فروتن) و الْمُتَصَدِّقِينَ والْمُتَصَدِّقاتِ (مردان و زنان صدقه‌دهنده) و الصَّائِمِينَ والصَّائِماتِ (مردان و زنان روزه‌دار) و الْحافِظِينَ فُرُوجَهُمْ والْحافِظاتِ (مردان و زنان حافظ عفت خود) و الذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ (مردان و زنانی که خدا را بسیار یاد می‌کنند) [قرآن، احزاب: ۳۵] و توبه‌کنندگان و توبه‌کنندگان زن، و عبادت‌کنندگان و عبادت‌کنندگان زن، و ستایشگران و ستایشگران زن، و سیاحت‌کنندگان و سیاحت‌کنندگان زن، و رکوع‌کنندگان و رکوع‌کنندگان زن، و سجده‌کنندگان و سجده‌کنندگان زن، و امرکنندگان به معروف و امرکنندگان زن، و نهی‌کنندگان از منکر و نهی‌کنندگان زن، و روی‌گردانان از لغو و روی‌گردانان زن، و الَّذِينَ هُمْ عَلى‏ صَلاتِهِمْ دائِمُونَ (آنان که بر نمازهایشان مداومت دارند) [قرآن، معارج: ۲۳] و کسانی که از آن غافل نیستند، تا امثال این‌ها از صفات پسندیده‌ای که خداوند در توقیعات خود قرار داده و آن‌ها را می‌ستاید.\n\nسپس خداوند تعالی به آن‌ها بشارت داد که آن‌ها وارثان هستند، الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ (آنان که فردوس را به ارث می‌برند) [قرآن، مؤمنون: ۱۱]، که بهترین و میانی‌ترین بهشت‌هاست. پس فرمود: هُمْ فِيها خالِدُونَ (آنان در آن جاودانند) [قرآن، مؤمنون: ۱۱]؛ و به آن‌ها بشارت بقا (البقاء) و دوام در نعمت می‌دهد. و در توقیع خبر داد که او از آن‌ها راضی است، تعالی و تقدس جلاله. سپس از جانب آن‌ها در خطاب نیابت کرد که آن‌ها نیز از او راضی هستند، پس فرمود: رَضِيَ الله عَنْهُمْ ورَضُوا عَنْهُ (خداوند از آن‌ها خشنود است و آن‌ها نیز از او خشنودند) [قرآن، مائده: ۱۱۹]. و در اینجا نکته‌ای است برای کسی که بفهمد الفاظ قرآن بر چه دلالت دارند، از الرضی (رضایت)؛ و خداوند به دلیل علمش به وقوع این امر از جانب آن‌ها، این را قطعی ساخت.\n\nسپس در کتاب‌ها و صحیفه‌ها و بر زبان خلفا (صلوات الله علیهم و سلامه) از الوعيد والتهديد (وعده عذاب و تهدید) و مؤاخذه کسی که به خدا کفر ورزید و نفاق کرد یا به بخشی از آنچه خداوند نازل کرده ایمان آورد و به بخشی کفر ورزید و انکار کرد و شرک ورزید و تکذیب کرد و ظلم نمود و تجاوز کرد و بدی کرد و مخالفت ورزید و نافرمانی کرد و روی گرداند و فسق ورزید و پشت کرد، نازل کرد. و در توقیع خبر داد که هر کس چنین باشد و این صفات یا برخی از آن‌ها در زندگی دنیا در او وجود داشته باشد، سپس در دنیا از آن‌ها به سوی خدا توبه کند و بر توبه از همه آن بمیرد، پروردگارش را ملاقات می‌کند در حالی که او از وی راضی است. و اگر خداوند پس از توبه‌اش عمر او را طولانی کند و به او مهلت دهد و او عمل صالحی انجام دهد، خداوند بدی‌های او را به حسنات تبدیل می‌کند؛ یعنی آنچه را که با آن به بدی تصرف می‌کرد، به نیکی تصرف می‌کند. پس خداوند عمل او را با توفیقی که به طاعتش و رحمتش به او داد، تبدیل کرد و همه آنچه را که پیش از آن از او سر زده بود، آمرزید و به هیچ چیز از آن مؤاخذه نکرد. و توقیعات الهی (التوقيعات الإلهية) پیوسته از جانب خداوند بر خلفای او نازل می‌شد، شامل آنچه خداوند به مؤمنان به خدا و رسولانش از خیر وعده داده و آنچه به کافران از شر وعده داده است، در طول مدت اقامت آن خلیفه که توقیع بر او نازل شده است، یعنی رسول، تا هنگام مرگش. پس از زمان خلافتش تا پایان عمرش، توقیعات الهی پیوسته بر او نازل می‌شود. اما هنگامی که او بمیرد و خداوند به وحی خود کسی را به جای او خلیفه کند، یا امر را به صورت شورا میان اصحابش واگذارد تا کسی را که بر او اجماع می‌کنند، به ولایت برسانند، تا زمانی که خداوند رسولی از نزد خود مبعوث کند و خلیفه دیگری را در میان آن‌ها برپا دارد، مگر اینکه آن خلیفه، خاتم خلفا باشد. در این صورت، خداوند نایبانی از جانب او برپا می‌دارد که خلفای آن خلیفه از جانب خدا خواهند بود، نه اینکه در منزلت رسولان، خلفای از جانب خدا باشند. و آن‌ها الأقطاب (اقطاب) و امیران مؤمنان تا روز قیامت هستند.\n\nاز میان این نایبان، کسانی هستند که خداوند الغطاء (پرده) را از آن‌ها برمی‌دارد، پس از اهل العين والشهود (عین و شهود) می‌شوند و بر بصیرت (البصيرة) به سوی خدا دعوت می‌کنند، همان‌گونه که رسول (صَلَّى اللهُ عَليهِ وسَلَّم) دعوت کرد. و اگر زمان اقتضا نمی‌کرد که پس از رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) شریعت‌گذاری نباشد، اینان شریعت‌گذار می‌بودند، هرچند جز به شریعت رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) عمل نمی‌کردند. زیرا آن‌ها در آن شریعت همان‌گونه می‌بودند که رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) در شریعت کسی که پیش از او بود، اگر به آن در امت خود حکم می‌کرد؛ پس او در آن به منزله اولی است که پیش از او بود، نه اینکه خلیفه او در آن باشد، هرچند آن را تأیید کند. پس چون خداوند این امر را در این امت منع کرد، دانستیم که آن‌ها خلفای رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) هستند، هرچند بر بصیرت (البصيرة) به سوی خدا دعوت کنند، همان‌گونه که رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) دعوت کرد، چنانکه در قرآن عزیز در مورد او آمده است: أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي (من و هر که از من پیروی کند، بر بصیرت به سوی خدا دعوت می‌کنیم) [قرآن، یوسف: ۱۰۸]. و ما را وارثان نامید و رسول (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داد که جز علم را برای ما به ارث نگذاشته است.\n\nهمانا دعای او (صَلَّى اللهُ عَليهِ وسَلَّم) این بود که خداوند او را به گوشش بهره‌مند سازد تا کلام خدا را بشنود و به چشمش تا آیات خدا را در آفاق و در نفس خود ببیند، سپس فرمود: واجعل ذلك الوارث منا (و آن وارث را از ما قرار ده). یعنی سمع و بصر را، زیرا خداوند خیر الوارثين (بهترین وارثان) است. و خداوند تعالی در خبر صحیح از او فرموده است: كنت سمعه وبصره (من گوش و چشم او بودم). پس اگر هویت حق (هوية الحق) سمع و بصر بنده باشد، حق (الحق) همان وارثی است که عین سمع و بصر اوست. پس با این صفت دعا کرد که این برای او باشد تا بر آن قبض کند. گویی می‌گوید: خداوندا، ما را به خودت بهره‌مند ساز، زیرا تو گوش و چشم ما هستی و تو وارث ما هستی هنگامی که بمیریم، زیرا خبر دادی که تو خیر الوارثين (بهترین وارثان) هستی و تو الْأَرْضَ ومن عَلَيْها (زمین و هر که بر آن است) را به ارث می‌بری [قرآن، حجر: ۲۳]؛ یعنی تو خیری هستی که وارثان از خلفای خود به آن می‌رسند و آن‌ها پیروان رسولان (صلوات الله علیهم) هستند. پس او تعالی خیری است که وارثان به آن می‌رسند، همان‌گونه که از حیث اینکه وارث است، خیر الوارثین است. و اشاره در هر خیری که منسوب و مضاف است، مانند خیر الصابرین (بهترین صابران) و الشاکرین (بهترین شاکران) و امثال این‌ها که از جانب خداوند در هر شریعتی وارد شده است، همین‌گونه است.\n\nو از توقیعات الهی (التوقيعات الإلهية) نیز المبشرات (مبشرات) هستند که جزئی از اجزای نبوت می‌باشند؛ یا از جانب خدا به سوی اوست، یا از جانب خدا بر دست برخی از بندگانش به سوی اوست، و آن الرؤيا (رؤیایی) است که مرد مسلمان می‌بیند یا برای او دیده می‌شود. اگر در رؤیای او از جانب خدا بر دست رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) به او برسد، اگر حکمی باشد، باید خود را به آن متعبد سازد، به شرط آنکه رسول (صَلَّى اللهُ عَليهِ وسَلَّم) را بر همان الصورة الجسدية (صورت جسمانی) که در دنیا بر آن بود، ببیند، همان‌گونه که از وجه صحیح به او نقل شده است، تا جایی که اگر رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) را ببیند، او را با دندان ثنایای بالایی شکسته ببیند. اگر او را با این اثر نبیند، آن شخص، او نیست. و اگرچه یقین کند که او رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) است و او را پیر یا جوانی ببیند که با صورتی که در دنیا بر آن بود و بر آن درگذشت، متفاوت است، یا او را در زیبایی بیشتر از آنچه برایش وصف شده یا در زشتی صورت ببیند، یا بیننده از خود نسبت به او بی‌ادبی ببیند، همه این‌ها حق (الحق) است که رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) آورده است، اما آن شخص، رسول الله نیست. پس آنچه این بیننده دیده، عین شریعت است، یا در آن مکانی که او را در آن می‌بیند، یا به حال بیننده باز می‌گردد، یا به مجموعه، و غیر از این نمی‌تواند باشد.\n\nپس اگر در این صورت حکمی به او برسد، نباید به آن عمل کند، اگر آن حکم مقتضی نسخ حکمی باشد که با خبر منقول صحیح و معمول به، ثابت شده است. برخلاف حکمی که اگر او را بر صورت خودش ببیند، که در این صورت عمل به آن بر او لازم است و بر غیر او لازم نیست، زیرا خداوند می‌فرماید: الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ (امروز دین شما را برایتان کامل کردم) [قرآن، مائده: ۳]. این همان فرقان (تمییز) نزد أهل الله (اهل الله) میان این دو امر است. زیرا آن‌ها ممکن است او (صَلَّى اللهُ عَليهِ وسَلَّم) را در کشف (الکشف) خود ببینند و اخباری را که نزد آن‌ها به نقل ضعیف است، تصحیح کند، و ممکن است اخباری را که نزد ما به نقل ثابت شده است، نفی کند، چنانکه:\n\nمسلم در مقدمه کتاب خود از شخصی ذکر کرده است که رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) را در خواب دید و هزار حدیثی را که در حفظ داشت بر او عرضه کرد. پس رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) از آن هزار حدیث، شش حدیث را برای او تأیید کرد و بقیه را انکار نمود.\n\nپس هر کس او (صَلَّى اللهُ عَليهِ وسَلَّم) را در خواب ببیند، او را در بیداری دیده است، مادامی که صورت بر او تغییر نکرده باشد، زیرا شیطان اصلاً به صورت او تمثل نمی‌یابد. پس صورت او در حیات و ممات معصوم است. پس هر کس او را ببیند، در هر صورتی که دیده باشد، او را دیده است.\n\nو المبشرات (مبشرات) از توقیعات الهی (التوقيعات الإلهية) هستند. و توقیعات الهی دیگری نیز وجود دارد که از الأسماء الإلهية (اسماء الهی) شناخته می‌شوند، هنگامی که در کشف (الکشف) بر قلوب العارفين بالله (عارفان به حق) وارد می‌شوند. و آن این است که توقیعی که به این ولی می‌رسد، از اسم خاص الهی از اسماء الحسنی است که پایین‌تر از اسم «الله» است، زیرا از اسم «الله» اصلاً توقیعی از حیث دلالت آن خارج نمی‌شود. بلکه تنها زمانی از آن خارج می‌شود که مقید به حالی ذکر شود که اسم خاصی را برای آن حال اقتضا کند و از آن اسم خاص با اسم «الله» کنایه آورده شود، به دلیل دربرداشتن آن خاصیت. و بیشتر توقیعات برای أولياء الله (اولیای حق) از جانب «الله» و «الرحمن» و «الرب» و «الملک» خارج می‌شود و نه غیر این‌ها. این امر غالب و مستمر است.\n\nپس اگر توقیع با اسمی غیر از آنچه ذکر کردیم خارج شود، شاذ است و بر اساس آنچه حقیقت آن اسم اقتضا می‌کند، حکم می‌شود. و این دلیل بر مضمون آن توقیع برای این ولی است، پس او بر حسب اقتضای آن در آن تصرف می‌کند. و این ولی نیازمند علم عظیمی به مواطن و صور احوال و مراتب عالم و علم المحو والإثبات (محو و اثبات) و الشئون الإلهية (شئون الهی) است. همه این‌ها را باید العلماء بالله (عالمان به حق) بدانند. و اگر این‌ها و امثال آن‌ها را ندانند، نباید از قدر خود تجاوز کنند و باید وارد آبادکنندگان مردم شوند و ملازم جماعت باشند، زیرا دست خدا با آن‌هاست. و هر کس از جماعت بدون بصیرت (البصيرة) جدا شود، به سوی آتش جدا شده است. بلکه محال است که صاحب بصیرت از جماعت جدا شود، زیرا او از دست خدا جدا نمی‌شود، بلکه او در جماعت و همراه آن، چیزی را می‌داند که هیچ فردی از جماعت نمی‌داند، مگر کسی که مانند او باشد. پس او با کسی که مانند اوست، جماعت است و از کسانی نیست که تنها نماز می‌خواند.\n\nپس سعادتمند کسی است که نزد حدود خدا توقف کند و از آن‌ها تجاوز نکند. و به خدا سوگند، ما از هیچ حدی از آن‌ها تجاوز نکردیم، بلکه خداوند از فهم درباره او تعالی، چیزی به ما عطا کرد که به بسیاری از خلق خود عطا نکرده است. پس ما بر بصیرت (البصيرة) از امر او به سوی خدا دعوت کردیم، زیرا بر بینه‌ای از پروردگارمان بودیم. و الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند) [قرآن، احزاب: ۴]."
  },
  "page_count": 3
}