{
  "id": 63,
  "title": {
    "ar": "الباب الثالث والستون في معرفة بقاء الناس في البرزخ بين الدنيا والبعث",
    "en": "Chapter Sixty-Three: Concerning the Knowledge of the Subsistence of People in the Isthmus (البرزخ) between the World and the Resurrection.",
    "ur": "باب تریسٹھواں: دنیا اور بعث کے درمیان برزخ میں لوگوں کے بقا (البقاء) کی معرفت (المعرفۃ) کے بارے میں",
    "fa": "باب شصت و سوم در معرفت بقای مردم در برزخ میان دنیا و بعث (رستاخیز)"
  },
  "content": {
    "ar": "### (الباب الثالث والستون في معرفة بقاء الناس في البرزخ بين الدنيا والبعث)\n\n\n> بين القيامة والدنيا لذي نظر *** مراتب برزخيات لها سور\n\n\n> تحوي على حكم ما قد كان صاحبها *** قبل الممات عليه اليوم فاعتبروا\n\n\n> لها على الكل أقدام وسلطنة *** تبدي العجائب لا تُبْقِي ولا تَذَرُ\n\n\n> لها مجال رحيب في الوجود بلا *** تقيد وهي لا عين ولا أثر\n\n\n> تقول للحق كن والحق خالقها *** فكيف يخرج عن أحكامها بشر\n\n\n> فيها العلوم وفيها كل قاصمة *** فيها الدلائل والإعجاز والعبر\n\n\n> لو لا الخيال لكنا اليوم في عدم *** ولا انقضى غرض فينا ولا وطر\n\n\n> كان سلطانها إن كنت تعقلها *** الشرع جاء به والعقل والنظر\n\n\n> من الحروف لها كاف الصفات فما *** تنفك عن صور إلا أتت صور\n\n\n### [البرزخ: أمر فاصل بين أمرين بلا تطرف‏]\n\n\nقولنا كان سلطانها برفع سلطانها أي سلطان الخيال هو عين كان وهو معنى‏\n\n\nقوله صلى الله عليه وسلم اعبد الله كأنك تراه‏\n\n\nفهي خير وسلطانها مبتدأ تقدير الكلام سلطان حضرة الخيال من الألفاظ هو كان اعلم أن البرزخ عبارة عن أمر فاصل بين أمرين لا يكون متطرفا أبدا كالخط الفاصل بين الظل والشمس وكقوله تعالى مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ ومعنى لا يَبْغِيانِ أي لا يختلط أحدهما بالآخر وإن عجز الحس عن الفصل بينهما والعقل يقضي أن بينهما حاجزا يفصل بينهما فذلك الحاجز المعقول هو البرزخ فإن أدرك بالحس فهو أحد الأمرين ما هو البرزخ وكل أمرين يفتقران إذا تجاورا إلى برزخ ليس هو عين أحدهما وفيه قوة كل واحد منهما ولما كان البرزخ أمرا فاصلا بين معلوم وغير معلوم وبين معدوم وموجود وبين منفي ومثبت وبين معقول وغير معقول سمي برزخا اصطلاحا وهو معقول في نفسه وليس إلا الخيال فإنك إذا أدركته وكنت عاقلا تعلم أنك أدركت شيئا وجوديا وقع بصرك عليه وتعلم قط ما بدليل أنه ما ثم شي‏ء رأسا وأصلا فما هو هذا الذي أثبت له شيئية وجودية ونفيتها عنه في حال إثباتك إياها\n\n\n### [الخيال كالبرزخ لا موجود ولا معدوم لا معلوم ولا مجهول‏]\n\n\nفالخيال لا موجود ولا معدوم ولا معلوم ولا مجهول ولا منفي ولا مثبت كما يدرك الإنسان صورته في المرآة يعلم قطعا أنه أدرك صورته بوجه ويعلم قطعا أنه ما أدرك صورته بوجه لما يرى فيها من الدقة إذا كان جرم المرآة صغيرا ويعلم أن صورته أكبر من التي رأى بما لا يتقارب وإذا كان جرم المرآة كبيرا فيرى صورته في غاية الكبر ويقطع أن صورته أصغر مما رأى ولا يقدر أن ينكر أنه رأى صورته ويعلم أنه ليس في المرآة صورته ولا هي بينه وبين المرآة ولا هو انعكاس شعاع البصرة إلى الصورة المرئية فيها من خارج سواء كانت صورته أو غيرها إذ لو كان كذلك لأدرك الصورة على قدرها وما هي عليه وفي رؤيتها في السيف من الطول أو العرض يتبين لك ما ذكرنا مع علمه أنه رأى صورته بلا شك فليس بصادق ولا كاذب في قوله إنه رأى صورته ما رأى صورته فما تلك الصورة المرئية وأين محلها وما شأنها فهي منفية ثابتة موجودة معدومة معلومة مجهولة أظهر الله سبحانه هذه الحقيقة لعبده ضرب مثال ليعلم ويتحقق أنه إذا عجز وحار في درك حقيقة هذا وهو من العالم ولم يحصل عنده علم بحقيقته فهو بخالقها أعجز وأجهل وأشد حيرة ونبهه بذلك أن تجليات الحق له أرق وألطف معنى من هذا الذي قد حارت العقول فيه وعجزت عن إدراك حقيقته إلى أن بلغ عجزها أن تقول هل لهذا ماهية أو لا ماهية له فإنها لا تلحقه بالعدم المحض وقد أدرك البصر شيئا ما ولا بالوجود المحض وقد علمت أنه ما ثم شي‏ء ولا بالإمكان المحض‏\n\n\n### [النوم وما بعد الموت إلى حين البعث وحال المكاشفة]\n\n\nوإلى مثل هذه الحقيقة يصير الإنسان في نومه وبعد موته فيرى الأعراض صورا قائمة بنفسها تخاطبه ويخاطبها\nأجسادا لا يشك فيها والمكاشف يرى في يقظته ما يراه النائم في حال نومه والميت بعد موته كما يرى في الآخرة صور الأعمال توزن مع كونها أعراضا ويرى الموت كبشا أملح بذبح والموت نسبة مفارقة عن اجتماع فسبحان من يجهل فلا يعلم ويعلم فلا يجهل لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ‏\n\n\n### [عين الحس وعين الخيال‏]\n\n\nومن الناس من يدرك هذا المتخيل بعين الحس ومن الناس من يدركه بعين الخيال وأعني في حال اليقظة وأما في النوم فبعين الخيال قطعا فإذا أراد الإنسان أن يفرق في حال يقظته حيث كان في الدنيا أو يوم القيامة فلينظر إلى المتخيل وليقيده بنظره فإن اختلفت عليه أكوان المنظور إليه لاختلافه في التكوينات وهو لا ينكر أنه ذلك بعينه ولا يقيده النظر عن اختلاف التكوينات فيه كالناظر إلى الحرباء في اختلاف الألوان عليها فذلك عين الخيال بلا شك ما هو عين الحس فأدركت الخيال بعين الخيال لا بعين الحس وقليل من يتفطن إلى هذا ممن يدعي كشف الأرواح النارية والنورية إذا تمثلت لعينه صورا مدركة لا يدري بما أدركها هل بعين الخيال أو بعين الحس وكلاهما أعني الإدراكين بحاسة العين فإنها تعطي الإدراك بعين الخيال وبعين الحس وهو علم دقيق أعني العلم بالفصل بين العينين وبين حاسة العين وعين الحس وإذا أدركت العين المتخيل ولم تغفل عنه ورأته لا تختلف عليه التكوينات ولا رأته في مواضع مختلفات معا في حال واحدة والذات واحدة لا يشك فيها ولا انتقلت ولا تحولت في أكوان مختلفة فتعلم أنها محسوسة لا متخيلة وأنه أدركها بعين الحس لا بعين الخيال ومن هنا يعرف إدراك الإنسان في المنام ربه تعالى وهو منزه عن الصورة والمثال وضبط الإدراك إياه وتقييده ومن هنا تعرف‏\n\n\nما ورد في الخبر الصحيح من كون الباري يتحلى في أدنى صورة من التي رأوه فيها\n\n\nوفي تحوله في صورة يعرفونها وقد كانوا أنكروه وتعوذوا منه فيعلم بأي عين تراه فقد أعلمتك أن الخيال يدرك بنفسه نريد بعين الخيال أو يدرك بالبصر وما الصحيح في ذلك حتى نعتمد عليه ولنا في ذلك‏\n\n\n> إذا تجلى حبيبي *** بأي عين أراه‏\n\n\n> بعينه لا بعيني *** فما يراه سواه‏\n\n\nتنزيها لمقامه وتصديقا بكلامه فإنه القائل لا تُدْرِكُهُ الْأَبْصارُ ولم يخص دارا من دار بل أرسلها آية مطلقة ومسألة معينة محققة فلا يدركه سواه فبعينه سبحانه أراه في الخبر الصحيح كنت بصره الذي يبصر به فتيقظ أيها الغافل النائم عن مثل هذا وانتبه فلقد فتحت عليك بابا من المعارف لا تصل إليه الأفكار لكن تصل إلى قبوله العقول إما بالعناية الإلهية أو بجلاء القلوب بالذكر والتلاوة فيقبل العقل ما يعطيه التجلي ويعلم أن ذلك خارج عن قوة نفسه من حيث فكره وأن فكره لا يعطيه ذلك أبدا فيشكر الله تعالى الذي أنشأه نشأة يقبل بها مثل هذا وهي نشأة الرسل والأنبياء وأهل العناية من الأولياء وذلك ليعلم أن قبوله أشرف من فكره فتحقق يا أخي بعد هذا من يتجلى لك من خلف هذا الباب فهي مسألة عظيمة حارت فيها الألباب‏\n\n\n### [النفخ في الصور والنقر في الناقور]\n\n\nثم إن الشارع وهو الصادق سمي هذا الباب الذي هو الحضرة البرزخية التي تنتقل إليها بعد الموت ونشهد نفوسنا فيها بالصور والناقور والصور هنا جمع صورة بالصاد فينفخ في الصور وينقر في الناقور وهو هو بعينه واختلفت عليه الأسماء لاختلاف الأحوال والصفات واختلفت الصفات فاختلفت الأسماء فصارت أسماؤه كهو يحار فيها من عادته يفلي الحقائق ولا يرمى منها بشي‏ء فإنه لا يتحقق له أن النقر أصل في وجود اسم الناقور أو الناقور أصل في وجود اسم النقر كمسألة النحوي هل الفعل مشتق من المصدر أو المصدر مشتق من الفعل ثم فارق مسألة النحوي بشي‏ء آخر حتى لا يشبه مسألة النحوي في الاشتقاق بقوله يُنْفَخُ في الصُّورِ ولم يقل في المنفوخ فيه فهل كونه صورا أصل في وجود النفخ أو وجود نفخ أصل في وجود اسم الصور ولما ذكر الله تعديل صورة الإنسان قال ونَفَخْتُ فِيهِ وقال في عيسى عليه السلام قبل خلق صورته فَنَفَخْنا فِيها من رُوحِنا فظهرت الصورة فوقعت الحيرة ما هو الأصل هل الصورة في وجود النفخ أو النفخ في وجود الصورة فهذا من ذلك القبيل ولا سيما وجبريل عليه السلام في الوقت المذكور في حال التمثل بالبشر ومريم قد تخيلت أنه بشر فهل أدركته بالبصر الحسي أو بعين الخيال فتكون ممن أدرك الخيال بالخيال وإذا كان هذا فينفتح عليك ما هو أعظم وهو هل في قوة الخيال أن يعطي‏\nصورة حسية حقيقة فلا يكون للحس فضل على الخيال لأن الحس يعطي الصور للخيال فكيف يكون المؤثر فيه مؤثرا فيمن هو مؤثر فيه فما هو مؤثر فيما هو مؤثر فيه وهذا محال عقلا فتفطن لهذه الكنوز فإن كنت حصلتها ما يكون في العالم أعني منك إلا من يساويك في ذلك‏\n\n\n### [صور النشور وسلطان الخيال‏]\n\n\nأن رسول الله صلى الله عليه وسلم لما سئل عن الصور ما هو فقال صلى الله عليه وسلم هو قرن من نور ألقمه إسرافيل‏\n\n\nفأخبر أن شكله شكل القرن فوصف بالسعة والضيق فإن القرن واسع ضيق وهو عندنا على خلاف ما يتخيله أهل النظر في الفرق بين ما هو أعلى القرن وأسفله ونذكره إن شاء الله بعد هذا في هذا الباب فاعلم إن سعة هذا القرن في غاية السعة لا شي‏ء من الأكوان أوسع منه وذلك أنه يحكم بحقيقته على كل شي‏ء وعلى ما ليس بشي‏ء ويتصور العدم المحض والمحال والواجب والإمكان ويجعل الوجود عدما والعدم وجودا وفيه‏\n\n\nيقول النبي صلى الله عليه وسلم أي من حضرة هذا اعبد الله كأنك تراه‏\n\n\nوالله في قبلة المصلي‏\n\n\nأي نخيله في قبلتك وأنت تواجهه لتراقبه وتستحيي منه وتلزم الأدب معه في صلاتك فإنك إن لم تفعل هذا أسأت الأدب‏\n\n\n### [الخيال أوسع الأشياء وأضيقها]\n\n\nفلو لا أن الشارع علم أن عندك حقيقة تسمى الخيال لها هذا الحكم ما قال لك كأنك تراه ببصرك فإن الدليل العقلي بمنع من كان فإنه يحيل بدليله التشبيه والبصر فما أدرك شيئا سوى الجدار فعلمنا إن الشارع خاطبك أن تتخيل أنك تواجه الحق في قبلتك المشروع لك استقبالها والله يقول فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله ووجه الشي‏ء حقيقته وعينه فقد صور الخيال من يستحيل عليه بالدليل العقلي الصورة والتصور فلهذا كان واسعا وأما ما فيه من الضيق فإنه ليس في وسع الخيال أن يقبل أمرا من الأمور الحسية والمعنوية والنسب والإضافة وجلال الله وذاته إلا بالصورة ولو رام أن يدرك شيئا من غير صورة لم تعط حقيقته ذلك لأنه عين الوهم لا غيره فمن هنا هو ضيق في غاية الضيق فإنه لا يجرد المعاني عن المواد أصلا ولهذا كان الحس أقرب شي‏ء إليه فإنه من الحس أخذ الصور وفي الصور الحسية يجلي المعاني فهذا من ضيقه وإنما كان هذا حتى لا يتصف بعدم التقييد وبإطلاق الوجود وبالفعال لما يريد إلا الله تعالى وحده ليس كمثله شي‏ء فالخيال أوسع المعلومات ومع هذه السعة العظيمة التي يحكم بها على كل شي‏ء قد عجز أن يقبل المعاني مجردة عن المواد كما هي في ذاتها فيرى العلم في صورة لبن أو عسل وخمر ولؤلؤ ويرى الإسلام في صورة قبة وعمد ويرى القرآن في صورة سمن وعسل ويرى الدين في صورة قيد ويرى الحق في صورة إنسان وفي صورة نور فهو الواسع الضيق والله واسع على الإطلاق عليم بما أوجد الله عليه خلقه كما قال تعالى أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ ثُمَّ هَدى‏ أي بين الأمور على ما هي عليه بإعطاء كل شي‏ء خلقه‏\n\n\n### [النور وقرن النشور وعموم سلطان الخيال‏]\n\n\nوأما كون القرن من نور فإن النور سبب الكشف والظهور إذ لو لا النور ما أدرك البصر شيئا فجعل الله هذا الخيال نورا يدرك به تصوير كل شي‏ء أي أمر كان كما ذكرناه فنوره ينفذ في العدم المحض فيصوره وجودا فالخيال أحق باسم النور من جميع المخلوقات الموصوفة بالنورية فنوره لا يشبه الأنوار وبه تدرك التجليات وهو نور عين الخيال لا نور عين الحس فافهم فإنه ينفعك معرفة كونه نورا فتعلم الإصابة فيه ممن لا يعلم ذلك وهو الذي يقول هذا خيال فاسد وذلك لعدم معرفة هذا القائل بإدراك النور الخيالي الذي أعطاه الله تعالى كما إن هذا القائل يخطئ الحس في بعض مدركاته وإدراكه صحيح والحكم لغيره لا إليه فالحاكم أخطأ لا الحس كذلك الخيال أدرك بنوره ما أدرك وما له حكم وإنما الحكم لغيره وهو العقل فلا ينسب إليه الخطاء فإنه ما ثم خيال فاسد قط بل هو صحيح كله‏\n\n\n### [الخيال كصور النشور أعلاه ضيق وأسفله واسع‏]\n\n\nوأما أصحابنا فغلطوا في هذا القرن فأكثر العقلاء جعل أضيقه المركز وأعلاه الفلك الأعلى الذي لا فلك فوقه وأن الصور التي يحوي عليها صور العالم فجعلوا واسع القرن الأعلى وضيقه الأسفل من العالم وليس الأمر كما زعموا بل لما كان الخيال كما قلنا يصور الحق فمن دونه من العالم حتى العدم كان أعلاه الضيق وأسفله الواسع وهكذا خلقه الله فأول ما خلق منه الضيق وآخر ما خلق منه ما اتسع وهو الذي يلي رأس الحيوان ولا شك أن حضرة الأفعال والأكوان أوسع ولهذا لا يكون للعارف اتساع في العلم إلا بقدر ما يعلمه من العالم ثم إنه إذا أراد أن ينتقل إلى العلم بأحدية الله تعالى لا يزال يرقى من السعة إلى الضيق قليلا قليلا فتقل علومه كلما رقى في العلم بذات الحق كشفا إلى أن لا يبقى له معلوم إلا الحق وحده وهو أضيق ما في القرن فضيقه هو الأعلى على الحقيقة وفيه الشرف التام وهو الأول الذي نظهر منه إذا أنبته الله في رأس الحيوان فلا يزال يصعد على صورته من الضيق وأسفله تسع وهو لا يتغير عن حاله‏\nفهو المخلوق الأول أ لا ترى الحق سبحانه أول ما خلق القلم أو قل العقل كما قال فما خلق إلا واحدا ثم أنشأ الحلق من ذلك الواحد فاتسع العالم وكذلك العدد منشؤه من الواحد ثم الذي يقبل الثاني لا من الواحد الوجود ثم يقبل التضعيف والتركيب في المراتب فيتسع اتساعا عظيما إلى ما لا يتناهى فإذا انتهيت فيه من الاتساع إلى حد ما من الآلاف وغيرها ثم تطلب الواحد الذي نشأ منه العدد لا يزال في ذلك تقلل العدد ويزول عنك ذلك الاتساع الذي كنت فيه حتى تنتهي إلى الاثنين التي بوجودها ظهر العدد إذ كان الواحد أولاها فالواحد أضيق الأشياء وليس بالنظر إلى ذاته بعدد في نفسه ولكن بما هو اثنان أو ثلاثة أو أربعة فلا يجمع بين اسمه وعينه أبدا فاعلم ذلك‏\n\n\n### [أرواح الأجسام المودعة في البرزخ وإدراكاتها]\n\n\nوالناس في وصف الصور بالقرن على خلاف ما ذكرناه وبعد ما قررناه فلتعلم إن الله سبحانه إذا قبض لأرواح من هذه الأجسام الطبيعية حيث كانت والعنصرية أودعها صورا جسدية في مجموع هذا القرن النوري فجميع ما يدركه الإنسان بعد الموت في البرزخ من الأمور إنما يدركه بعين الصورة التي هو فيها في القرن وبنورها وهو إدراك حقيقي ومن الصور هنالك ما هي مقيدة عن التصرف ومنها ما هي مطلقة كأرواح الأنبياء كلهم وأرواح الشهداء ومنها ما يكون لها نظر إلى عالم الدنيا في هذه الدار ومنها ما يتحلى للنائم في حضرة الخيال التي هي فيه وهو الذي تصدق رؤياه أبدا وكل رؤيا صادقة ولا تخطئ فإذا أخطأت الرؤيا فالرؤيا ما أخطأت ولكن العابر الذي يعبرها هو المخطئ حيث لم يعرف ما المراد بتلك الصورة\n\n\nأ لا تراه صلى الله عليه وسلم ما قال لأبي بكر حين عبر رؤيا الشخص المذكور أصبت بعضا وأخطأت بعضا\n\n\nقال في الرجل الذي رأى في النوم ضربت عنقه فوقع رأسه فجعل الرأس يتدهده وهو يكلمه فذكر له رسول الله أن الشيطان يلعب به‏\n\n\nفعلم رسول الله صلى الله عليه وسلم صورة ما رآه وما قال له خيالك فاسد فإنه رأى حقا ولكن أخطأ في التأويل فأخبره صلى الله عليه وسلم بحقيقة ما رآه ذلك النائم وكذلك قوم فرعون يعرضون على النار في تلك الصور غدوة وعشية ولا يدخلونها فإنهم محبوسون في ذلك القرن وفي تلك الصورة ويوم القيامة يدخلون أشد العذاب وهو العذاب المحسوس لا المتخيل الذي كان لهم في حال موتهم بالعرض‏\n\n\n### [عين الخيال تدرك الصورة الخيالية المطلقة المحسوسة]\n\n\nفتدرك بعين الخيال الصور الخيالية والصور المحسوسة معا فيدرك المتخيل الذي هو الإنسان بعين خياله وقتا ما هو متخيل‏\n\n\nكقوله صلى الله عليه وسلم مثلت لي الجنة في عرض هذا الحائط\n\n\nفأدرك ذلك بعين حسه وإنما قلنا بعين حسه لأنه تقدم حين رأى الجنة ليأخذ قطفا منها وتأخر حين رأى النار وهو في صلاته ونحن نعرف أن عنده من القوة بحيث إنه لو أدرك ذلك بعين خياله لا بعين حسه ما أثر في جسمه تقدما ولا تأخرا فإنا نجد ذلك وما نحن في قوته ولا في طبقته صلى الله عليه وسلم وكل إنسان في البرزخ مرهون بكسبه محبوس في صور أعماله إلى أن يبعث يوم القيامة من تلك الصور في النشأة الآخرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الثامن والعشرون‏\n\n",
    "en": "### Chapter Sixty-Three: Concerning the Knowledge of the Subsistence of People in the Isthmus (البرزخ) between the World and the Resurrection.\n\nBetween the Resurrection and the world, for one who possesses insight,\nThere are levels (مراتب) of the Isthmus (برزخيات) surrounded by walls.\n\nThey contain the judgment of whatever state its inhabitant was upon\nBefore death; therefore, take heed.\n\nIt possesses precedence and sovereignty over all things,\nManifesting wonders, leaving nothing untouched or spared.\n\nIt has a vast domain in Existence (الوجود) without restriction,\nYet it is neither an essence (عين) nor a trace (أثر).\n\nIt says to the Real (الحق), \"Be!\"—though the Real is its Creator.\nSo how can a human escape its decrees?\n\nIn it are the sciences, and in it is every decisive matter;\nIn it are the proofs, the miracles, and the lessons.\n\nWere it not for Imagination (الخيال), we would be in non-existence (عدم) today,\nAnd no purpose or desire within us would be fulfilled.\n\nIts sovereignty—if you understand it—is what the Law (الشرع)\nThe intellect (العقل), and contemplation (النظر) brought forth.\n\nAmong the letters, it possesses the *Kaf* of the Attributes (كاف الصفات);\nThus, it never ceases to produce forms (صور) whenever forms depart.\n\n### [The Isthmus (البرزخ): A Separating Matter Between Two Things Without Extremity]\n\nOur statement, \"Its sovereignty (سلطانها) was,\" with the nominative case on *sultan*, means that the sovereignty of the Imagination (الخيال) is the very essence of \"was\" (كان). This is the meaning of His saying, peace and blessings be upon him: \"Worship Allah as if you see Him.\"\n\nThus, it is good, and its sovereignty is the subject. The intended meaning of the phrase is: The sovereignty of the Presence of Imagination (حضرة الخيال) among the expressions is \"was\" (كان). Know that the Isthmus (البرزخ) is an expression for a separating matter between two things, never being one of the extremes. It is like the line separating shadow and sun, or like His saying, the Exalted: <<مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ>> (He has released the two seas, meeting [side by side]; between them is an Isthmus (برزخ) which they do not transgress). The meaning of <<لا يَبْغِيانِ>> (they do not transgress) is that neither mixes with the other. Even if the senses fail to distinguish between them, the intellect dictates that there is a barrier separating them. That intelligible barrier is the Isthmus (البرزخ). If it were perceived by the senses, it would be one of the two things, not the Isthmus. Every two things that require an Isthmus when they adjoin are such that the Isthmus is not the essence (عين) of either of them, yet it contains the power of both. Since the Isthmus is a separating matter between the known and the unknown, between the non-existent and the existent, between the negated and the affirmed, and between the intelligible and the non-intelligible, it is conventionally called the Isthmus (برزخ). It is intelligible in itself, and it is nothing other than the Imagination (الخيال). For when you perceive it, and you are rational, you know that you have perceived something existent (وجوديا) upon which your sight fell, and yet you know absolutely, by proof, that nothing is there fundamentally or essentially. So, what is this thing to which you affirm existential reality (شيئية وجودية) while simultaneously negating it?\n\n### [Imagination is like the Isthmus (البرزخ): Neither Existent nor Non-Existent, Neither Known nor Unknown]\n\nThe Imagination (الخيال) is thus neither existent (موجود) nor non-existent (معدوم), neither known (معلوم) nor unknown (مجهول), neither negated (منفي) nor affirmed (مثبت). This is like when a person perceives his image in a mirror: he knows with certainty that he has perceived his image in one respect, and he knows with certainty that he has *not* perceived his image in another respect. This is evident in the smallness he sees if the mirror’s body is small, and he knows that his actual image is incomparably larger than what he saw. If the mirror’s body is large, he sees his image as extremely large and is certain that his actual image is smaller than what he saw. Yet, he cannot deny that he saw his image. He knows that his image is not *in* the mirror, nor is it between him and the mirror, nor is it a reflection of the visual ray onto the image seen therein from outside—whether it is his image or another’s. If it were so, he would perceive the image according to its true size and reality. In seeing the image in a sword, whether elongated or widened, what we have mentioned becomes clear to you, along with his knowledge that he undoubtedly saw his image. Thus, he is neither truthful nor false in saying, \"I saw my image,\" and \"I did not see my image.\" So, what is that perceived image? Where is its location? What is its nature? It is negated, affirmed, existent, non-existent, known, unknown. Allah, the Glorified, manifested this Reality (الحقيقة) to His servant by giving an example, so that he may know and realize that if he is incapable and bewildered in grasping the reality of this thing—which is part of the cosmos (العالم)—and has not attained knowledge of its reality, then he is even more incapable, ignorant, and bewildered concerning its Creator. He alerts him thereby that the Theophanies (تجليات) of the Real (الحق) to him are subtler and more delicate in meaning than this thing about which intellects have been bewildered and incapable of grasping its reality, to the point where their incapacity leads them to ask: Does this thing have a quiddity (ماهية) or not? For they cannot attach it to pure non-existence (العدم المحض), since the sight has perceived *something*, nor to pure existence (الوجود المحض), since they know that nothing is truly there, nor to pure possibility (الإمكان المحض).\n\n### [Sleep, the State After Death Until the Resurrection, and the State of Unveiling]\n\nTo a reality similar to this, a person reverts in his sleep and after his death until the Resurrection. He sees accidents (الأعراض) as forms (صورا) subsisting in themselves, addressing him, and which he addresses—bodies about which he has no doubt. The one who experiences Unveiling (المكاشف) sees in his wakefulness what the sleeper sees in his sleep and what the deceased sees after his death. This is like seeing the forms of deeds weighed in the Hereafter, despite them being accidents. And seeing Death slaughtered in the form of a speckled ram. Death is a relative separation from an aggregation. Glory be to Him who is ignorant, yet knows not, and knows, yet is not ignorant! <<لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ>> (There is no god but He, the All-Mighty, the All-Wise).\n\n### [The Eye of Sense and the Eye of Imagination]\n\nAmong people, there are those who perceive this imagined thing (المتخيل) with the eye of sense (عين الحس), and among them are those who perceive it with the eye of Imagination (عين الخيال). I mean this in the state of wakefulness. As for sleep, it is certainly with the eye of Imagination. If a person wishes to differentiate in his state of wakefulness, whether he is in the world or on the Day of Resurrection, let him look at the imagined thing and restrict it with his gaze. If the states (أكوان) of the object of sight vary for him due to its variation in formations (التكوينات), yet he does not deny that it is the very same thing, and the gaze does not restrict it from the variation in its formations—like one looking at a chameleon whose colors change—then that is certainly the essence of Imagination (عين الخيال), not the eye of sense (عين الحس). Thus, you perceived the Imagination with the eye of Imagination, not with the eye of sense. Few are those who pay attention to this among those who claim the unveiling (كشف) of fiery and luminous spirits when they manifest themselves to their sight as perceived forms, yet they do not know by what they perceived them: whether by the eye of Imagination or the eye of sense. Both perceptions, I mean, occur through the faculty of the eye (حاسة العين), for it grants perception both by the eye of Imagination and by the eye of sense. This is a subtle knowledge—I mean the knowledge of distinguishing between the two eyes and between the faculty of the eye and the eye of sense. If the eye perceives the imagined thing and does not neglect it, and sees that the formations do not vary for it, nor does it see it in different places simultaneously in one state, and the essence (الذات) is one about which there is no doubt, and it has neither moved nor transformed into different states, then you know that it is sensible (محسوسة), not imagined (متخيلة), and that he perceived it with the eye of sense, not with the eye of Imagination. From this, one understands the perception of the Lord, the Exalted, by a person in a dream, though He is transcendent above form and likeness, and the control and restriction of the perception of Him. From this, you understand what is mentioned in the authentic report concerning the Creator manifesting Himself in the lowest form of those in which they saw Him, and His transformation into a form they recognize, after they had denied Him and sought refuge from Him. Thus, one knows by which eye He is seen. I have informed you that the Imagination perceives by itself—meaning by the eye of Imagination—or it perceives by sight. What is the correct view in this matter upon which we should rely? We have a poem concerning this:\n\nWhen my Beloved manifests Himself,\nWith which eye do I see Him?\nWith His eye, not with mine,\nFor none but He sees Him.\n\nThis is a transcendence (تنزيها) of His station and a confirmation of His speech, for He is the One who said: <<لا تُدْرِكُهُ الْأَبْصارُ>> (Vision comprehends Him not). He did not specify one abode over another, but sent it forth as an absolute sign and a specific, verified matter. Thus, none but He perceives Him. Therefore, by His eye, the Glorified, I see Him, as stated in the authentic report: \"I was his sight with which he sees.\" So, be alert, O heedless one, sleeping concerning such matters, and awaken! For I have opened for you a door of Gnosis (المعارف) that thoughts cannot reach, though intellects can reach its acceptance—either through Divine Providence (العناية الإلهية) or through the polishing of hearts by remembrance (*dhikr*) and recitation. The intellect then accepts what the Theophany (التجلي) grants and knows that this is outside the power of its own self, in terms of its thought, and that its thought could never grant it this. So, he thanks Allah, the Exalted, who created him in a state (نشأة) by which he accepts such things—which is the state of the Messengers, the Prophets, and the people of Providence among the Saints (الأولياء). This is so that he may know that his acceptance is more noble than his thought. So, verify, O my brother, after this, who manifests to you from behind this door. This is a tremendous matter in which minds have been bewildered.\n\n### [The Blowing into the Trumpet and the Striking of the Bell]\n\nThen, the Lawgiver (الشارع), who is the Truthful One, named this door—which is the Presence of the Isthmus (الحضرة البرزخية) to which we transition after death and in which we witness our souls—*al-Sūr* (الصور) and *al-Nāqūr* (الناقور). *Al-Sūr* here is the plural of *Sūrah* (صورة - form), with the letter *ṣād*. So, \"the blowing into the Forms (*al-Sūr*)\" and \"the striking of the Bell (*al-Nāqūr*)\"—it is the very same thing, but the names differ due to the difference in states and attributes. When the attributes differed, the names differed. Thus, His names became like Him, bewildering anyone whose habit is to scrutinize realities (الحقائق) without discarding anything from them. For he cannot ascertain whether the striking (*naqr*) is the origin of the existence of the name *Nāqūr*, or whether the *Nāqūr* is the origin of the existence of the name *naqr*. This is like the grammarian's question: Is the verb derived from the verbal noun (masdar), or the verbal noun derived from the verb? Then, it differs from the grammarian's question in another respect, so as not to resemble the grammarian's question of derivation, by His saying: <<يُنْفَخُ فِي الصُّورِ>> (It is blown into the Forms/Trumpet), and He did not say \"into that which is blown.\" So, is its being Forms (*Sūr*) the origin of the existence of the blowing (*nafkh*), or is the existence of the blowing the origin of the existence of the name *Sūr*? When Allah mentioned the fashioning of the human form, He said: <<وَنَفَخْتُ فِيهِ>> (And I breathed into him). And concerning Jesus, peace be upon him, before the creation of his form, He said: <<فَنَفَخْنا فِيها مِنْ رُوحِنا>> (Then We breathed into her [Mary] from Our Spirit). The form appeared, and bewilderment arose: What is the origin? Is the form the origin of the existence of the blowing, or the blowing the origin of the existence of the form? This matter is of that same category. Especially since Gabriel, peace be upon him, at the time mentioned, was in the state of representation as a human, and Mary imagined (تخيلت) that he was a human. Did she perceive him with the sensory sight (البصر الحسي) or with the eye of Imagination (عين الخيال)? If the latter, she would be among those who perceive Imagination with Imagination. If this is the case, then something greater opens up to you: Does the power of Imagination have the capacity to grant a truly sensory form (صورة حسية حقيقة)? If so, the sense (الحس) would have no superiority over the Imagination, because the sense grants forms to the Imagination. How can that which is influenced by it be an influence upon that which influences it? This is rationally impossible. Pay attention to these treasures, for if you have attained them, there will be none in the world—meaning among humankind—except those who equal you in that.\n\n### [The Forms of Resurrection and the Sovereignty of Imagination]\n\nWhen the Messenger of Allah, peace and blessings be upon him, was asked what the *Sūr* (الصور/Trumpet) was, he replied, peace and blessings be upon him: \"It is a horn of light (قرن من نور) which Isrāfīl holds to his mouth.\"\n\nHe informed us that its shape is that of a horn, describing it with both breadth and narrowness, for a horn is wide and narrow. In our view, this is contrary to what speculative thinkers (أهل النظر) imagine regarding the difference between the top and bottom of the horn. We shall mention this later in this chapter, God willing. Know that the breadth of this horn is of the utmost vastness; nothing in the cosmos (الأكوان) is wider than it. This is because its reality governs everything, and even what is not a thing. It forms the image of pure non-existence (العدم المحض), the impossible (المحال), the necessary (الواجب), and the possible (الإمكان). It makes existence non-existence and non-existence existence. It is concerning this that the Prophet, peace and blessings be upon him, says—meaning from the Presence of this [Imagination]: \"Worship Allah as if you see Him.\"\n\nAnd \"Allah is in the direction of the worshipper's prayer (قبلة المصلي),\" meaning we imagine Him (نخيله) in your direction of prayer, and you face Him so that you may observe Him, feel shame before Him, and maintain proper conduct with Him in your prayer. For if you do not do this, you have behaved improperly.\n\n### [Imagination is the Widest and Narrowest of Things]\n\nHad the Lawgiver not known that you possess a reality called Imagination (الخيال) that holds this decree, He would not have said to you, \"as if you see Him\" with your sight. For rational proof (الدليل العقلي) prevents this for anyone, as it rationally deems impossible both anthropomorphism and sight. The sight perceives nothing but the wall. Thus, we know that the Lawgiver addressed you to *imagine* (تتخيل) that you are facing the Real (الحق) in the direction of prayer prescribed for you to face. And Allah says: <<فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله>> (So wherever you turn, there is the Face of Allah). The Face (*Wajh*) of a thing is its reality and its essence (حقيقته وعينه). Thus, the Imagination has formed the image of One upon whom form and conception are rationally impossible. For this reason, it is vast. As for the narrowness within it, it is not within the capacity of the Imagination to accept any matter—sensory or intelligible, relations or attributions, the Majesty of Allah, or His Essence (ذاته)—except through a form (صورة). If it attempted to perceive anything without a form, its reality would not grant that, because it is nothing but the essence of illusion (*wahm*). From this perspective, it is extremely narrow, for it never strips meanings (*ma'ānī*) from materials (*mawādd*) fundamentally. This is why the sense (الحس) is the closest thing to it, for it takes forms from the sense, and it manifests meanings in sensory forms. This is its narrowness. This is only so that it may not be described by the absence of restriction, by the absolute nature of Existence (إطلاق الوجود), or by being the Doer of what He wills, except for Allah alone, the Exalted: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). The Imagination is the widest of all known things. Yet, despite this immense breadth by which it governs everything, it is incapable of accepting meanings stripped of materials as they are in themselves. Thus, it sees knowledge (*al-ilm*) in the form of milk, honey, wine, or pearls. It sees Islam in the form of a dome and pillars. It sees the Quran in the form of clarified butter and honey. It sees religion (*al-dīn*) in the form of a fetter. It sees the Real (الحق) in the form of a human or in the form of light. Thus, it is the Wide and the Narrow. And Allah is Wide absolutely, All-Knowing of what He created His creatures upon, as the Exalted said: <<أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدى‏>> (He gave everything its creation, then guided). That is, He clarified matters according to their reality by giving everything its creation.\n\n### [Light, the Horn of Resurrection, and the Universality of the Sovereignty of Imagination]\n\nAs for the horn being made of light (نور), light is the cause of unveiling (الكشف) and manifestation (الظهور), for without light, sight would perceive nothing. Thus, Allah made this Imagination (الخيال) a light by which the depiction of everything—whatever the matter—is perceived, as we mentioned. Its light penetrates pure non-existence (العدم المحض) and forms it into existence. The Imagination is more deserving of the name Light (النور) than all creatures described by luminosity. Its light does not resemble other lights. By it, the Theophanies (التجليات) are perceived. It is the light of the eye of Imagination (نور عين الخيال), not the light of the eye of sense. Understand this, for knowing it to be light will benefit you. You will then know the correctness of the perception of those who do not know this, those who say, \"This is a corrupt imagination (خيال فاسد).\" This is due to the lack of knowledge of this speaker concerning the perception of the imaginative light (النور الخيالي) that Allah, the Exalted, has granted. Just as this speaker errs concerning the sense (الحس) in some of its perceptions—though its perception is correct, and the judgment belongs to another, not to it—the judge has erred, not the sense. Likewise, the Imagination perceives by its light what it perceives, and it has no judgment; rather, the judgment belongs to another, which is the intellect (العقل). Therefore, error is not attributed to it, for there is never a corrupt imagination; rather, it is all correct.\n\n### [Imagination, like the Forms of Resurrection, is Narrow at the Top and Wide at the Bottom]\n\nOur companions (أصحابنا) have erred concerning this horn. Most rationalists (العقلاء) made its narrowest part the center and its highest part the uppermost sphere (الفلك الأعلى) above which there is no sphere. They claimed that the forms it contains are the forms of the cosmos (العالم). Thus, they made the wide part of the horn the top and the narrow part the bottom of the cosmos. The matter is not as they claimed. Rather, since the Imagination, as we said, forms the image of the Real (الحق) and everything below Him in the cosmos, even non-existence (العدم), its top is the narrow part and its bottom is the wide part. This is how Allah created it. The first thing created from it was the narrow part, and the last thing created from it was that which expanded, which is the part adjacent to the head of the animal. There is no doubt that the Presence of Acts (حضرة الأفعال) and states (الأكوان) is wider. For this reason, the Gnostic (العارف) only achieves breadth in knowledge commensurate with what he knows of the cosmos. Then, if he wishes to transition to the knowledge of the Oneness (أحدية) of Allah, the Exalted, he continuously ascends from breadth to narrowness, little by little. His knowledge decreases the higher he ascends in the Gnosis of the Essence (ذات الحق) through Unveiling (كشفا), until he has no known thing left except the Real (الحق) alone. This is the narrowest part of the horn. Its narrow part is truly the highest, and in it is complete honor. It is the First from which we emerge when Allah causes it to grow in the head of the animal. It continuously ascends upon its form from the narrowness, and its bottom expands, yet it does not change its state.\n\nIt is the First Created Thing. Do you not see that Allah, the Glorified, first created the Pen (القلم), or say the Intellect (العقل), as He said? He created only one, and then He originated creation (الحلق) from that one, and the cosmos expanded. Likewise, number originates from the One. Then, that which accepts the Second does not originate from the One Existence (الواحد الوجود), but then accepts doubling and composition in the Levels (المراتب), expanding immensely to infinity. If you reach a certain limit of expansion in it, such as thousands or otherwise, and then seek the One from which the number originated, the number continuously decreases, and that expansion you were in vanishes until you reach the Two, by whose existence number appeared, since the One was its beginning. The One is the narrowest of things, and it is not a number in itself when viewed in relation to its Essence (ذاته), but only by virtue of being two, three, or four. Thus, its name and its essence (عينه) are never combined. Know that.\n\n### [The Spirits of Bodies Deposited in the Isthmus (البرزخ) and Their Perceptions]\n\nPeople hold views concerning the description of the Forms (*Sūr*) as a horn that differ from what we have mentioned and established. Know that when Allah, the Glorified, takes the spirits (أرواح) from these natural and elemental bodies, wherever they may be, He deposits them as corporeal forms (صورا جسدية) within the totality of this Luminous Horn (القرن النوري). All matters that a person perceives after death in the Isthmus (البرزخ) are perceived only by the eye of the form (عين الصورة) in which he resides within the Horn, and by its light. This is a true perception. Among the forms there, some are restricted from action, and some are absolute, such as the spirits of all the Prophets and the spirits of the martyrs. Among them are those who look upon the world in this abode, and among them are those who manifest themselves to the sleeper in the Presence of Imagination (حضرة الخيال) where he resides—and whose vision is always truthful and never errs. If a vision errs, the vision itself has not erred, but the interpreter (العابر) who interprets it is the one who errs, since he did not know what was intended by that form.\n\nDo you not see that the Prophet, peace and blessings be upon him, did not say to Abu Bakr, when he interpreted the vision of the person mentioned, \"You were right in part and wrong in part\"?\n\nHe spoke concerning the man who saw in his sleep that his neck was struck and his head fell off, and the head rolled while speaking to him. The Messenger of Allah informed him that Satan was playing with him.\n\nThe Messenger of Allah, peace and blessings be upon him, knew the reality of the form he saw and did not say to him, \"Your imagination is corrupt.\" For he truly saw something, but he erred in the interpretation. Thus, the Prophet, peace and blessings be upon him, informed him of the reality of what that sleeper saw. Likewise, the people of Pharaoh are exposed to the Fire in those forms morning and evening, but they do not enter it, for they are confined within that Horn and in that form. On the Day of Resurrection, they will enter the severest punishment, which is the sensible (محسوس) punishment, not the imagined (متخيل) one that they experienced at the time of their death through exposure.\n\n### [The Eye of Imagination Perceives the Absolute Imaginal and Sensory Form]\n\nThe eye of Imagination (عين الخيال) perceives both imaginal forms (الصور الخيالية) and sensory forms (الصور المحسوسة) simultaneously. The imagined one, who is the human, perceives with his eye of Imagination what is imagined at a certain time.\n\nThis is like his saying, peace and blessings be upon him: \"Paradise was represented to me in the breadth of this wall.\"\n\nHe perceived that with his eye of sense (عين حسه). We say \"with his eye of sense\" because he advanced when he saw Paradise to take a cluster of fruit from it, and he retreated when he saw the Fire, while he was in his prayer. We know that he possessed a power such that if he had perceived that with his eye of Imagination and not his eye of sense, it would not have affected his body by advancing or retreating. We find this to be true, though we are not in his power or his rank, peace and blessings be upon him. Every person in the Isthmus (البرزخ) is held hostage by his earning, confined within the forms of his deeds, until he is resurrected on the Day of Resurrection from those forms into the Other Creation (النشأة الآخرة). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way). End of the Twenty-Eighth Part.",
    "ur": "باب تریسٹھواں: دنیا اور بعث (دوبارہ اٹھائے جانے) کے درمیان برزخ (عالم برزخ) میں لوگوں کے باقی رہنے کی معرفت میں۔\n\n> بین القيامة والدنيا لذي نظر *** مراتب برزخيات لها سور\n> تحوي على حكم ما قد كان صاحبها *** قبل الممات عليه اليوم فاعتبروا\n> لها على الكل أقدام وسلطنة *** تبدي العجائب لا تُبْقِي ولا تَذَرُ\n> لها مجال رحيب في الوجود بلا *** تقيد وهي لا عين ولا أثر\n> تقول للحق كن والحق خالقها *** فكيف يخرج عن أحكامها بشر\n> فيها العلوم وفيها كل قاصمة *** فيها الدلائل والإعجاز والعبر\n> لو لا الخيال لكنا اليوم في عدم *** ولا انقضى غرض فينا ولا وطر\n> كان سلطانها إن كنت تعقلها *** الشرع جاء به والعقل والنظر\n> من الحروف لها كاف الصفات فما *** تنفك عن صور إلا أتت صور\n\nقیامت اور دنیا کے درمیان، صاحب نظر کے لیے، برزخی (برزخيات) مراتب ہیں جن کی دیواریں ہیں۔\nوہ اس حکم کو اپنے اندر سموئے ہوئے ہیں جس پر اس کا مالک موت سے پہلے تھا، سو تم عبرت حاصل کرو۔\nاس کی سب پر فوقیت اور سلطنت ہے، جو عجائبات ظاہر کرتی ہے، نہ باقی رکھتی ہے اور نہ چھوڑتی ہے۔\nہستی (الوجود) میں اس کا میدان وسیع ہے بغیر کسی قید کے، اور یہ نہ کوئی عین (جوہر) ہے اور نہ کوئی اثر۔\nیہ ذات حق (الحق) سے کہتی ہے 'ہو جا'، اور ذات حق اس کا خالق ہے، تو کوئی بشر اس کے احکام سے کیسے باہر نکل سکتا ہے؟\nاس میں تمام علوم ہیں اور ہر تباہ کن چیز ہے، اس میں دلائل، اعجاز اور عبرتیں ہیں۔\nاگر خیال (الخيال) نہ ہوتا تو آج ہم عدم میں ہوتے، اور نہ ہم میں کوئی غرض پوری ہوتی اور نہ کوئی خواہش۔\nاگر تم اسے سمجھتے ہو تو اس کی سلطنت وہ ہے جسے شرع (الشرع)، عقل اور نظر لائے ہیں۔\nحروف میں سے اس کے لیے صفت کا 'کاف' ہے، پس یہ ایک صورت سے جدا نہیں ہوتی مگر دوسری صورت لے آتی ہے۔\n\n**[برزخ (البرزخ): دو چیزوں کے درمیان فاصل امر بغیر کسی انتہا کے]**\n\nہمارا یہ کہنا کہ \"اس کی سلطنت تھی\" (کان سلطانها) میں \"سلطانها\" کو رفع کے ساتھ پڑھا گیا ہے، یعنی خیال (الخيال) کی سلطنت ہی عین \"کان\" (تھا) ہے، اور یہی اس فرمان کا مفہوم ہے:\n\n> قوله صلى الله عليه وسلم اعبد الله كأنك تراه‏\n> نبی اکرم صلی اللہ علیہ وسلم کا فرمان: \"اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو۔\"\n\nیہ خیر ہے اور اس کی سلطنت مبتدا ہے، کلام کی تقدیر یہ ہے کہ حضرۃ الخیال (خیال کی حضوری) کی سلطنت الفاظ میں \"کان\" ہے۔ جان لو کہ برزخ (البرزخ) ایک ایسی چیز کا نام ہے جو دو چیزوں کے درمیان فاصل ہو اور کبھی بھی انتہا پر نہ ہو۔ جیسے سایہ اور دھوپ کے درمیان فاصل خط، اور جیسا کہ اللہ تعالیٰ کا فرمان ہے:\n\n> مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ\n> \"اس نے دو سمندروں کو ملا دیا جو آپس میں ملتے ہیں، ان کے درمیان ایک برزخ (حاجز) ہے کہ وہ تجاوز نہیں کرتے۔\"\n\nاور \"لا يَبْغِيانِ\" (وہ تجاوز نہیں کرتے) کا مطلب ہے کہ وہ ایک دوسرے میں خلط نہیں ہوتے، اگرچہ حواس ان کے درمیان فرق کرنے سے عاجز ہوں، لیکن عقل یہ فیصلہ کرتی ہے کہ ان کے درمیان ایک حاجز ہے جو انہیں جدا کرتا ہے۔ پس وہ معقول حاجز ہی برزخ (البرزخ) ہے۔ اگر اسے حواس سے محسوس کیا جائے تو وہ دو چیزوں میں سے ایک بن جائے گا، جو کہ برزخ نہیں ہے۔ اور ہر دو چیزیں جو ایک دوسرے کے ساتھ ہوں، انہیں ایک برزخ کی ضرورت ہوتی ہے جو ان میں سے کسی کا عین نہ ہو، مگر اس میں دونوں کی قوت موجود ہو۔ چونکہ برزخ معلوم اور غیر معلوم، معدوم اور موجود، منفی اور مثبت، اور معقول اور غیر معقول کے درمیان ایک فاصل امر ہے، اس لیے اصطلاحاً اسے برزخ کہا جاتا ہے۔ یہ بذات خود معقول ہے اور یہ صرف خیال (الخيال) ہی ہے۔ کیونکہ جب تم اسے محسوس کرتے ہو اور تم عاقل ہو، تو تم جانتے ہو کہ تم نے ایک وجودی شے کا ادراک کیا ہے جس پر تمہاری نظر پڑی ہے، اور تم قطعی طور پر جانتے ہو کہ وہ وہاں بالکل اور اصلاً کوئی شے نہیں ہے۔ تو یہ کیا ہے جسے تم نے وجودی شے کے طور پر ثابت بھی کیا اور اسی حال میں اس کی نفی بھی کر دی؟\n\n**[خیال (الخيال) برزخ کی طرح ہے: نہ موجود نہ معدوم، نہ معلوم نہ مجہول]**\n\nپس خیال (الخيال) نہ موجود ہے اور نہ معدوم، نہ معلوم ہے اور نہ مجہول، نہ منفی ہے اور نہ مثبت۔ جیسا کہ انسان آئینے میں اپنی صورت دیکھتا ہے، تو وہ قطعی طور پر جانتا ہے کہ اس نے ایک لحاظ سے اپنی صورت کا ادراک کیا ہے، اور قطعی طور پر جانتا ہے کہ اس نے دوسرے لحاظ سے اپنی صورت کا ادراک نہیں کیا، کیونکہ اگر آئینے کا جسم چھوٹا ہو تو وہ اس میں باریک بینی دیکھتا ہے، اور جانتا ہے کہ اس کی صورت اس سے کہیں زیادہ بڑی ہے جو اس نے دیکھی، جس میں کوئی تقابل نہیں۔ اور اگر آئینے کا جسم بڑا ہو تو وہ اپنی صورت کو انتہائی بڑا دیکھتا ہے اور یقین رکھتا ہے کہ اس کی صورت اس سے چھوٹی ہے جو اس نے دیکھی۔ اور وہ اس بات کا انکار نہیں کر سکتا کہ اس نے اپنی صورت دیکھی ہے، اور وہ جانتا ہے کہ نہ تو اس کی صورت آئینے کے اندر ہے اور نہ ہی وہ اس کے اور آئینے کے درمیان ہے۔ اور نہ ہی یہ بصری شعاع کا باہر سے نظر آنے والی صورت کی طرف انعکاس ہے، خواہ وہ اس کی اپنی صورت ہو یا کوئی اور، کیونکہ اگر ایسا ہوتا تو وہ صورت کو اس کے اصل حجم کے مطابق دیکھتا۔ تلوار میں اس صورت کو لمبائی یا چوڑائی میں دیکھنے سے تمہیں وہ بات واضح ہو جائے گی جو ہم نے بیان کی، اس کے باوجود کہ وہ بلا شک جانتا ہے کہ اس نے اپنی صورت دیکھی ہے۔ پس وہ اپنے اس قول میں نہ سچا ہے اور نہ جھوٹا کہ \"میں نے اپنی صورت دیکھی\" اور \"میں نے اپنی صورت نہیں دیکھی\"۔ تو وہ نظر آنے والی صورت کیا ہے؟ اور اس کا محل کہاں ہے؟ اور اس کی شان کیا ہے؟ پس وہ منفی بھی ہے، ثابت بھی، موجود بھی، معدوم بھی، معلوم بھی، مجہول بھی۔ اللہ سبحانہ نے اپنے بندے کے لیے اس حقیقت کو ظاہر کیا تاکہ وہ مثال کے ذریعے جان لے اور یقین کر لے کہ جب وہ اس حقیقت کو سمجھنے میں عاجز اور حیران ہو گیا، حالانکہ یہ عالم (دنیا) کی چیز ہے اور اسے اس کی حقیقت کا علم حاصل نہیں ہوا، تو وہ اس کے خالق کے بارے میں زیادہ عاجز، زیادہ جاہل اور زیادہ حیران ہو گا۔ اور اس کے ذریعے اسے متنبہ کیا کہ ذات حق (الحق) کے ظہورات (التجلیات) اس چیز سے زیادہ لطیف اور نازک ہیں جس میں عقلیں حیران ہو گئیں اور اس کی حقیقت کے ادراک سے عاجز ہو گئیں، یہاں تک کہ ان کی عاجزی اس حد تک پہنچ گئی کہ وہ کہنے لگیں کہ کیا اس کی کوئی ماہیت ہے یا نہیں؟ کیونکہ وہ اسے نہ تو عدم محض سے ملاتی ہیں، حالانکہ آنکھ نے کچھ نہ کچھ ادراک کیا ہے، اور نہ ہی وجود محض سے، حالانکہ اسے معلوم ہے کہ وہاں کوئی شے نہیں ہے، اور نہ ہی امکان محض سے۔\n\n**[نیند، موت کے بعد بعث تک کا وقت اور کشف (الکشف) کی حالت]**\n\nاور اسی حقیقت کی طرف انسان اپنی نیند میں اور اپنی موت کے بعد ہو جاتا ہے، پس وہ اعراض (عارضی چیزوں) کو قائم بالذات صورتوں میں دیکھتا ہے جو اس سے ہم کلام ہوتی ہیں اور وہ ان سے ہم کلام ہوتا ہے۔ ایسے اجسام جن میں اسے کوئی شک نہیں ہوتا۔ اور مکاشف (کشف) اپنی بیداری میں وہی دیکھتا ہے جو سونے والا اپنی نیند میں اور مرنے والا اپنی موت کے بعد دیکھتا ہے۔ جیسا کہ آخرت میں اعمال کی صورتیں دیکھی جائیں گی جن کا وزن کیا جائے گا، حالانکہ وہ اعراض ہیں۔ اور موت کو ایک چتکبرے مینڈھے کی صورت میں دیکھا جائے گا جسے ذبح کیا جائے گا۔ اور موت اجتماع سے مفارقت کی نسبت ہے۔ پس پاک ہے وہ ذات جو جاہل ہو کر بھی جانتی نہیں اور جان کر بھی جاہل نہیں ہوتی۔\n\n> لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ‏\n> \"اس کے سوا کوئی معبود نہیں، وہ غالب ہے، حکمت والا ہے۔\"\n\n**[عین حس (عین الحس) اور عین خیال (عین الخيال)]**\n\nاور لوگوں میں سے کچھ ایسے ہیں جو اس متخیل (خیالی چیز) کا ادراک عین حس (حسی آنکھ) سے کرتے ہیں، اور کچھ ایسے ہیں جو اس کا ادراک عین خیال (خیالی آنکھ) سے کرتے ہیں، اور میرا مطلب بیداری کی حالت میں ہے۔ جہاں تک نیند کا تعلق ہے، تو وہ قطعی طور پر عین خیال سے ہوتا ہے۔ پس اگر انسان اپنی بیداری کی حالت میں، خواہ وہ دنیا میں ہو یا قیامت کے دن، فرق کرنا چاہے، تو اسے متخیل کی طرف دیکھنا چاہیے اور اپنی نظر سے اسے مقید کرنا چاہیے۔ اگر دیکھی جانے والی چیز کی حالتیں اس پر مختلف ہو جائیں، اس کے باوجود کہ وہ تکوینیات میں مختلف ہے، اور وہ اس بات کا انکار نہ کرے کہ وہ بعینہ وہی ہے، اور نظر اسے اس میں تکوینیات کے اختلاف سے مقید نہ کرے، جیسے گرگٹ کو دیکھنے والا اس پر رنگوں کا اختلاف دیکھتا ہے، تو یہ بلا شک عین خیال (عین الخيال) ہے، عین حس (عین الحس) نہیں ہے۔ پس تم نے خیال کا ادراک عین خیال سے کیا، نہ کہ عین حس سے۔ اور بہت کم لوگ ہیں جو اس پر توجہ دیتے ہیں، ان لوگوں میں سے جو ناری اور نوری ارواح کے کشف (الکشف) کا دعویٰ کرتے ہیں، جب وہ ان کی آنکھوں کے سامنے محسوس ہونے والی صورتوں میں متمثل ہوتی ہیں، تو وہ نہیں جانتے کہ انہوں نے ان کا ادراک کس چیز سے کیا، کیا عین خیال سے یا عین حس سے؟ اور میرا مطلب ہے کہ دونوں ادراک حاسۂ آنکھ سے ہوتے ہیں، کیونکہ یہ عین خیال اور عین حس دونوں سے ادراک دیتی ہے۔ اور یہ ایک دقیق علم ہے، یعنی دونوں آنکھوں کے درمیان، اور حاسۂ آنکھ اور عین حس کے درمیان فرق کرنے کا علم۔ اور جب آنکھ متخیل کا ادراک کرے اور اس سے غافل نہ ہو، اور اسے دیکھے کہ اس پر تکوینیات مختلف نہیں ہوتیں، اور نہ ہی اسے ایک ہی حال میں مختلف مقامات پر دیکھتی ہے، اور ذات ایک ہی ہو جس میں کوئی شک نہ ہو، اور وہ مختلف حالتوں میں منتقل یا تبدیل نہ ہوئی ہو، تو تم جان لو کہ وہ محسوس ہے، متخیل نہیں، اور اس کا ادراک عین حس سے ہوا ہے نہ کہ عین خیال سے۔ اور یہیں سے انسان کا خواب میں اپنے رب تعالیٰ کا ادراک کرنا معلوم ہوتا ہے، حالانکہ وہ صورت اور مثال سے منزہ ہے، اور اس ادراک کو ضبط کرنا اور مقید کرنا بھی یہیں سے معلوم ہوتا ہے۔ اور یہیں سے تم جان سکتے ہو:\n\n> ما ورد في الخبر الصحيح من كون الباري يتحلى في أدنى صورة من التي رأوه فيها\n> جو صحیح حدیث میں آیا ہے کہ باری تعالیٰ اس سے کم تر صورت میں جلوہ گر ہوں گے جس میں انہوں نے اسے دیکھا تھا۔\n\nاور اس کا ایسی صورت میں تبدیل ہونا جسے وہ پہچانتے ہیں، حالانکہ انہوں نے پہلے اس کا انکار کیا تھا اور اس سے پناہ مانگی تھی۔ پس معلوم ہو جائے گا کہ وہ اسے کس آنکھ سے دیکھتے ہیں۔ میں نے تمہیں بتا دیا ہے کہ خیال (الخيال) بذات خود ادراک کرتا ہے، یعنی عین خیال سے، یا وہ بصر (آنکھ) سے ادراک کرتا ہے۔ اور اس میں صحیح کیا ہے جس پر ہم اعتماد کریں؟ اور اس بارے میں ہمارا قول ہے:\n\n> إذا تجلى حبيبي *** بأي عين أراه‏\n> بعينه لا بعيني *** فما يراه سواه‏\n> جب میرا محبوب ظہور الٰہی (التجلی) فرمائے گا، تو میں اسے کس آنکھ سے دیکھوں گا؟\n> اس کی آنکھ سے، نہ کہ میری آنکھ سے، پس اسے اس کے سوا کوئی نہیں دیکھتا۔\n\nیہ اس کے مقام کی تنزیہ (پاکیزگی) ہے اور اس کے کلام کی تصدیق ہے، کیونکہ وہی فرمانے والا ہے:\n\n> لا تُدْرِكُهُ الْأَبْصارُ\n> \"نگاہیں اسے نہیں پا سکتیں۔\"\n\nاور اس نے کسی ایک دار (دنیا یا آخرت) کو خاص نہیں کیا، بلکہ اسے ایک مطلق آیت اور ایک معین محقق مسئلہ کے طور پر بھیجا ہے۔ پس اسے اس کے سوا کوئی نہیں دیکھتا۔ پس صحیح حدیث میں اس کی آنکھ سے ہی میں اسے دیکھتا ہوں: \"میں اس کی بصارت بن جاتا ہوں جس سے وہ دیکھتا ہے۔\" پس اے غافل، اس طرح کی چیز سے سوئے ہوئے، بیدار ہو جا اور ہوشیار ہو جا! کیونکہ میں نے تم پر معرفت (المعرفۃ) کا ایک ایسا دروازہ کھول دیا ہے جہاں تک افکار نہیں پہنچ سکتیں، لیکن عقلیں اسے قبول کرنے تک پہنچ جاتی ہیں، یا تو عنایت الٰہیہ سے یا ذکر اور تلاوت سے دلوں کی صفائی کے ذریعے، پس عقل اس چیز کو قبول کر لیتی ہے جو ظہور الٰہی (التجلی) اسے دیتا ہے، اور جانتی ہے کہ یہ اس کی اپنی قوتِ فکر سے باہر ہے، اور اس کی فکر اسے کبھی بھی یہ نہیں دے سکتی۔ پس وہ اللہ تعالیٰ کا شکر ادا کرتا ہے جس نے اسے ایسی نشأت میں پیدا کیا جس سے وہ اس طرح کی چیز کو قبول کر سکتا ہے، اور یہ رسولوں، انبیاء اور اولیاء میں سے اہل عنایت کی نشأت ہے۔ اور یہ اس لیے ہے تاکہ وہ جان لے کہ اس کا قبول کرنا اس کی فکر سے زیادہ شرف والا ہے۔ پس اے میرے بھائی! اس کے بعد تحقیق کر کہ اس دروازے کے پیچھے سے کون تجھ پر جلوہ گر ہوتا ہے؟ یہ ایک عظیم مسئلہ ہے جس میں عقلیں حیران ہو گئی ہیں۔\n\n**[صور (الصور) میں پھونکنا اور ناقور (الناقور) میں نقر کرنا]**\n\nپھر شارع (شریعت لانے والے) جو کہ صادق ہیں، انہوں نے اس دروازے کو، جو کہ حضرۃ برزخیہ (برزخی حضوری) ہے جس میں تم موت کے بعد منتقل ہوتے ہو اور ہم اس میں اپنی جانوں کو صور (الصور) اور ناقور (الناقور) کے ذریعے دیکھتے ہیں، نام دیا ہے۔ اور یہاں \"الصور\" صاد کے ساتھ \"صورۃ\" کی جمع ہے۔ پس صور میں پھونکا جائے گا اور ناقور میں نقر کیا جائے گا، اور یہ بعینہ وہی ہے، اور حالات اور صفات کے اختلاف کی وجہ سے اس پر نام مختلف ہو گئے ہیں۔ اور صفات مختلف ہوئیں تو نام مختلف ہو گئے، پس اس کے نام بھی اسی کی طرح ہو گئے، جس میں وہ شخص حیران ہو جاتا ہے جس کی عادت حقائق کو چھاننا ہے اور ان میں سے کسی چیز کو ترک نہیں کرتا۔ کیونکہ اسے یہ تحقیق نہیں ہو پاتی کہ کیا نقر (بجانا) ناقور کے نام کے وجود میں اصل ہے یا ناقور نقر کے نام کے وجود میں اصل ہے، جیسے نحویوں کا مسئلہ کہ کیا فعل مصدر سے مشتق ہے یا مصدر فعل سے مشتق ہے؟ پھر یہ نحویوں کے مسئلے سے ایک اور چیز میں جدا ہو جاتا ہے، تاکہ یہ اشتقاق میں نحویوں کے مسئلے سے مشابہ نہ ہو، اللہ تعالیٰ کے اس فرمان کی وجہ سے:\n\n> يُنْفَخُ في الصُّورِ\n> \"صور میں پھونکا جائے گا۔\"\n\nاور یہ نہیں فرمایا کہ \"منفوخ فیہ\" (جس میں پھونکا گیا) میں۔ تو کیا اس کا صور ہونا نفخ (پھونکنے) کے وجود میں اصل ہے یا نفخ کا وجود صور کے نام کے وجود میں اصل ہے؟ اور جب اللہ نے انسان کی صورت کی تعدیل کا ذکر کیا تو فرمایا:\n\n> ونَفَخْتُ فِيهِ\n> \"اور میں نے اس میں پھونکا۔\"\n\nاور عیسیٰ علیہ السلام کے بارے میں ان کی صورت کی تخلیق سے پہلے فرمایا:\n\n> فَنَفَخْنا فِيها من رُوحِنا\n> \"پس ہم نے اس میں اپنی روح پھونکی۔\"\n\nپس صورت ظاہر ہوئی، تو حیرت واقع ہوئی کہ اصل کیا ہے؟ کیا صورت نفخ کے وجود میں اصل ہے یا نفخ صورت کے وجود میں اصل ہے؟ پس یہ اسی قبیل سے ہے۔ خاص طور پر جب جبرائیل علیہ السلام مذکورہ وقت میں بشر کی صورت میں متمثل ہوئے اور مریم نے خیال کیا کہ وہ بشر ہیں، تو کیا انہوں نے ان کا ادراک بصر حسی سے کیا یا عین خیال سے؟ پس وہ ان لوگوں میں سے ہوں گی جنہوں نے خیال کا ادراک خیال سے کیا۔ اور اگر ایسا ہے تو تم پر اس سے بھی بڑی چیز کھل جائے گی، اور وہ یہ کہ کیا خیال میں یہ قوت ہے کہ وہ حقیقی حسی صورت دے سکے؟ تو پھر حس کو خیال پر کوئی فضیلت نہیں رہے گی، کیونکہ حس خیال کو صورتیں دیتی ہے۔ تو کیسے ہو سکتا ہے کہ اس پر اثر انداز ہونے والا اس پر بھی اثر انداز ہو جس پر وہ خود اثر انداز ہوتا ہے؟ اور یہ عقلاً محال ہے۔ پس ان خزانوں پر غور کرو، اگر تم نے انہیں حاصل کر لیا تو دنیا میں کوئی ایسا نہیں ہو گا، یعنی تم میں سے، جو اس میں تمہارے برابر ہو۔\n\n**[صور النشور (دوبارہ اٹھائے جانے کی صورتیں) اور خیال (الخيال) کی سلطنت]**\n\nجب رسول اللہ صلی اللہ علیہ وسلم سے صور (الصور) کے بارے میں پوچھا گیا کہ وہ کیا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا:\n\n> هو قرن من نور ألقمه إسرافيل‏\n> \"وہ نور کا ایک سینگ ہے جسے اسرافیل نے اپنے منہ سے لگایا ہوا ہے۔\"\n\nپس آپ نے خبر دی کہ اس کی شکل سینگ جیسی ہے، پس اسے وسعت اور تنگی سے موصوف کیا گیا۔ کیونکہ سینگ وسیع بھی ہوتا ہے اور تنگ بھی۔ اور ہمارے نزدیک یہ اس کے برعکس ہے جو اہل نظر سینگ کے اوپر اور نیچے کے فرق کے بارے میں خیال کرتے ہیں۔ اور ہم ان شاء اللہ اس باب میں اس کے بعد اس کا ذکر کریں گے۔ پس جان لو کہ اس سینگ کی وسعت انتہائی وسعت میں ہے، کوئی بھی کائنات اس سے زیادہ وسیع نہیں ہے۔ اور یہ اس لیے کہ یہ اپنی حقیقت کے ساتھ ہر چیز پر اور اس چیز پر بھی حکم کرتا ہے جو شے نہیں ہے، اور یہ عدم محض، محال، واجب اور امکان کی صورت گری کرتا ہے، اور وجود کو عدم اور عدم کو وجود بنا دیتا ہے۔ اور اسی کے بارے میں:\n\n> يقول النبي صلى الله عليه وسلم أي من حضرة هذا اعبد الله كأنك تراه‏\n> نبی صلی اللہ علیہ وسلم فرماتے ہیں، یعنی اس حضوری (خیال کی حضوری) سے: \"اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو۔\"\n\nاور \"اللہ نمازی کے قبلہ میں ہے\"\nیعنی ہم اسے تمہارے قبلہ میں متخیل کرتے ہیں، اور تم اس کا سامنا کرتے ہو تاکہ تم اس کی نگرانی کرو، اس سے شرم کرو اور اپنی نماز میں اس کے ساتھ ادب لازم کرو۔ کیونکہ اگر تم ایسا نہیں کرو گے تو تم نے بے ادبی کی۔\n\n**[خیال (الخيال) سب سے وسیع اور سب سے تنگ چیز ہے]**\n\nاگر شارع (شریعت لانے والے) کو یہ معلوم نہ ہوتا کہ تمہارے پاس ایک حقیقت ہے جسے خیال (الخيال) کہا جاتا ہے اور اس کا یہ حکم ہے، تو وہ تم سے یہ نہ کہتے کہ \"گویا تم اسے اپنی آنکھ سے دیکھ رہے ہو\"۔ کیونکہ عقلی دلیل اس سے منع کرتی ہے جو ایسا کرتا ہے، کیونکہ وہ اپنی دلیل سے تشبیہ اور بصر (آنکھ) کو محال قرار دیتی ہے۔ اور آنکھ نے دیوار کے سوا کچھ ادراک نہیں کیا۔ پس ہم نے جانا کہ شارع نے تمہیں مخاطب کیا کہ تم یہ خیال کرو کہ تم ذات حق (الحق) کا سامنا کر رہے ہو اپنے اس قبلہ میں جس کا تمہیں استقبال کرنے کا حکم دیا گیا ہے۔ اور اللہ فرماتا ہے:\n\n> فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله\n> \"پس تم جس طرف بھی رخ کرو، وہیں اللہ کا چہرہ (وجہ اللہ) ہے۔\"\n\nاور کسی شے کا چہرہ اس کی حقیقت اور اس کا عین ہوتا ہے۔ پس خیال نے اس کی صورت گری کی جس پر عقلی دلیل سے صورت اور تصور محال ہے۔ اسی لیے یہ وسیع تھا۔ اور جہاں تک اس میں تنگی کا تعلق ہے، تو یہ ہے کہ خیال کے بس میں نہیں ہے کہ وہ حسی اور معنوی امور، نسبتوں، اضافوں، اللہ کے جلال اور اس کی ذات کو قبول کرے مگر صورت کے ساتھ۔ اور اگر وہ بغیر صورت کے کسی چیز کا ادراک کرنا چاہے تو اس کی حقیقت اسے یہ نہیں دے گی، کیونکہ یہ محض وہم (الوہم) ہی ہے۔ پس اس لحاظ سے یہ انتہائی تنگی میں ہے۔ کیونکہ یہ معانی کو مواد سے اصلاً مجرد نہیں کرتا۔ اور اسی وجہ سے حس (الحس) اس کے سب سے قریب ہے، کیونکہ یہ حس سے صورتیں لیتا ہے اور حسی صورتوں میں معانی کو جلوہ گر کرتا ہے۔ پس یہ اس کی تنگی ہے۔ اور یہ اس لیے ہے تاکہ یہ عدمِ تقیید، وجود کے اطلاق اور \"جو چاہے کرنے والا\" (الفعال لما يريد) کی صفت سے صرف اللہ تعالیٰ ہی متصف ہو، لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں)۔ پس خیال (الخيال) معلوم چیزوں میں سب سے زیادہ وسیع ہے، اور اس عظیم وسعت کے باوجود جس سے وہ ہر چیز پر حکم کرتا ہے، وہ معانی کو مواد سے مجرد حالت میں قبول کرنے سے عاجز ہے جیسا کہ وہ اپنی ذات میں ہیں۔ پس وہ علم کو دودھ، شہد، شراب اور موتی کی صورت میں دیکھتا ہے، اور اسلام کو گنبد اور ستونوں کی صورت میں دیکھتا ہے، اور قرآن کو گھی اور شہد کی صورت میں دیکھتا ہے، اور دین کو قید کی صورت میں دیکھتا ہے، اور ذات حق (الحق) کو انسان کی صورت میں اور نور کی صورت میں دیکھتا ہے۔ پس وہ وسیع بھی ہے اور تنگ بھی۔ اور اللہ مطلقاً وسیع ہے، اس چیز کا جاننے والا ہے جس پر اس نے اپنی مخلوق کو پیدا کیا، جیسا کہ اللہ تعالیٰ نے فرمایا:\n\n> أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدى‏\n> \"اس نے ہر چیز کو اس کی تخلیق عطا کی، پھر ہدایت دی۔\"\n\nیعنی ہر چیز کو اس کی تخلیق عطا کر کے امور کو ان کی اصل حالت پر واضح کر دیا۔\n\n**[نور، صور النشور (دوبارہ اٹھائے جانے کا سینگ) اور خیال (الخيال) کی سلطنت کا عموم]**\n\nاور جہاں تک سینگ (قرن) کے نور سے ہونے کا تعلق ہے، تو نور کشف (الکشف) اور ظہور کا سبب ہے۔ کیونکہ اگر نور نہ ہوتا تو آنکھ کسی چیز کا ادراک نہ کرتی۔ پس اللہ نے اس خیال (الخيال) کو ایک نور بنا دیا جس سے ہر چیز کی صورت گری کا ادراک ہوتا ہے، یعنی جو بھی امر ہو، جیسا کہ ہم نے ذکر کیا۔ پس اس کا نور عدم محض میں بھی نفوذ کرتا ہے اور اسے وجود کی صورت دیتا ہے۔ پس خیال (الخيال) نوری صفت سے موصوف تمام مخلوقات سے زیادہ نور کے نام کا حقدار ہے۔ پس اس کا نور انوار سے مشابہت نہیں رکھتا، اور اسی سے ظہورات الٰہی (التجلیات) کا ادراک ہوتا ہے۔ اور یہ عین خیال (عین الخيال) کا نور ہے، نہ کہ عین حس (عین الحس) کا نور۔ پس سمجھو، کیونکہ اس کا نور ہونا جاننا تمہیں فائدہ دے گا۔ پس تم اس شخص کی درستگی کو جان لو گے جو اس کا علم نہیں رکھتا، اور وہ کہتا ہے کہ یہ فاسد خیال ہے۔ اور یہ اس لیے ہے کہ اس کہنے والے کو اس خیالی نور کے ادراک کی معرفت نہیں ہے جو اللہ تعالیٰ نے عطا کیا ہے۔ جیسا کہ یہ کہنے والا حس کو اس کے بعض مدرکات میں غلط قرار دیتا ہے، حالانانکہ اس کا ادراک صحیح ہوتا ہے اور حکم کسی اور کے لیے ہوتا ہے نہ کہ اس کے لیے۔ پس حکم کرنے والے نے غلطی کی، نہ کہ حس نے۔ اسی طرح خیال نے اپنے نور سے جو ادراک کیا، اور اس کا کوئی حکم نہیں ہے، بلکہ حکم کسی اور کے لیے ہے، اور وہ عقل ہے۔ پس اس کی طرف غلطی منسوب نہیں کی جاتی، کیونکہ وہاں کوئی فاسد خیال نہیں ہے، بلکہ وہ سب کا سب صحیح ہے۔\n\n**[خیال (الخيال) صور النشور کی طرح ہے: اس کا اوپر والا حصہ تنگ اور نیچے والا وسیع ہے]**\n\nاور جہاں تک ہمارے اصحاب کا تعلق ہے، تو انہوں نے اس سینگ (قرن) کے بارے میں غلطی کی، پس اکثر عقلمندوں نے اس کے سب سے تنگ حصے کو مرکز اور اس کے سب سے اوپر والے حصے کو فلک اعلیٰ قرار دیا جس کے اوپر کوئی فلک نہیں ہے، اور یہ کہ جو صورتیں اس میں شامل ہیں وہ عالم کی صورتیں ہیں۔ پس انہوں نے سینگ کے وسیع حصے کو اوپر والا اور اس کے تنگ حصے کو عالم کا نیچے والا حصہ قرار دیا۔ حالانکہ معاملہ ایسا نہیں ہے جیسا کہ انہوں نے گمان کیا۔ بلکہ چونکہ خیال (الخيال)، جیسا کہ ہم نے کہا، ذات حق (الحق) کی صورت گری کرتا ہے اور اس کے نیچے عالم کی بھی، یہاں تک کہ عدم کی بھی، اس لیے اس کا اوپر والا حصہ تنگ اور نیچے والا حصہ وسیع ہے۔ اور اللہ نے اسے اسی طرح پیدا کیا۔ پس سب سے پہلے جو اس میں سے پیدا کیا وہ تنگ حصہ تھا اور سب سے آخر میں جو پیدا کیا وہ وسیع ہوا، اور وہ وہ ہے جو حیوان کے سر کے قریب ہے۔ اور بلا شک افعال اور اکوان (کائنات) کی حضوری زیادہ وسیع ہے۔ اور اسی وجہ سے عارف کے لیے علم میں وسعت نہیں ہوتی مگر اسی قدر جس قدر وہ عالم کو جانتا ہے۔ پھر جب وہ اللہ تعالیٰ کی احدیت کے علم کی طرف منتقل ہونا چاہتا ہے تو وہ آہستہ آہستہ وسعت سے تنگی کی طرف چڑھتا جاتا ہے، پس اس کے علوم کم ہوتے جاتے ہیں جتنا وہ ذات حق (الحق) کے علم میں کشف (الکشف) کے ذریعے اوپر چڑھتا ہے، یہاں تک کہ اس کے لیے معلوم صرف ذات حق ہی رہ جاتی ہے، اور یہ سینگ میں سب سے تنگ حصہ ہے۔ پس اس کا تنگ حصہ حقیقت میں سب سے اوپر ہے اور اس میں مکمل شرف ہے، اور یہ وہ اول ہے جس سے ہم ظاہر ہوتے ہیں جب اللہ اسے حیوان کے سر میں اگاتا ہے۔ پس وہ اپنی صورت پر تنگی سے اوپر چڑھتا رہتا ہے اور اس کا نچلا حصہ وسیع ہوتا جاتا ہے، اور وہ اپنی حالت سے تبدیل نہیں ہوتا۔\nپس وہ پہلی مخلوق ہے۔ کیا تم نہیں دیکھتے کہ حق سبحانہ نے سب سے پہلے قلم کو پیدا کیا یا عقل کو، جیسا کہ کہا گیا ہے، پس اس نے صرف ایک کو پیدا کیا، پھر اس ایک سے مخلوق کو پیدا کیا، پس عالم وسیع ہو گیا۔ اور اسی طرح عدد کا منبع بھی واحد سے ہے، پھر جو دوسرا عدد قبول کرتا ہے وہ واحد الوجود سے نہیں ہوتا، پھر وہ مراتب میں تضعیف اور ترکیب کو قبول کرتا ہے، پس وہ عظیم وسعت اختیار کرتا ہے جو لامتناہی ہے۔ پس جب تم اس میں ہزاروں وغیرہ کی حد تک وسعت میں پہنچ جاتے ہو، پھر تم اس واحد کو تلاش کرتے ہو جس سے عدد پیدا ہوا، تو اس میں عدد کم ہوتا جاتا ہے اور وہ وسعت جو تم میں تھی وہ زائل ہو جاتی ہے، یہاں تک کہ تم دو پر پہنچ جاتے ہو جس کے وجود سے عدد ظاہر ہوا، کیونکہ واحد اس کا پہلا تھا۔ پس واحد سب سے تنگ چیز ہے، اور اپنی ذات کے لحاظ سے وہ بذات خود عدد نہیں ہے، لیکن اس لحاظ سے کہ وہ دو یا تین یا چار ہے۔ پس اس کے نام اور اس کے عین کو کبھی جمع نہ کرو۔ پس یہ جان لو۔\n\n**[برزخ (البرزخ) میں ودیعت کردہ اجسام کی ارواح اور ان کے ادراکات]**\n\nاور لوگ سینگ (قرن) کے ساتھ صور (الصور) کی صفت بیان کرنے میں اس کے برعکس ہیں جو ہم نے ذکر کیا اور جو ہم نے مقرر کیا۔ پس جان لو کہ جب اللہ سبحانہ ان ارواح کو ان جسموں سے قبض کرتا ہے، خواہ وہ طبعی ہوں یا عنصری، تو انہیں اس نوری سینگ کے مجموعے میں جسمانی صورتوں میں ودیعت کر دیتا ہے۔ پس انسان موت کے بعد برزخ (البرزخ) میں جن امور کا بھی ادراک کرتا ہے، وہ صرف اس صورت کی آنکھ سے ادراک کرتا ہے جس میں وہ سینگ میں ہے اور اس کے نور سے، اور یہ ایک حقیقی ادراک ہے۔ اور وہاں کی صورتوں میں سے کچھ ایسی ہیں جو تصرف سے مقید ہیں، اور کچھ مطلق ہیں، جیسے تمام انبیاء کی ارواح اور شہداء کی ارواح۔ اور ان میں سے کچھ ایسی ہیں جن کی نظر اس دنیا کے عالم کی طرف ہوتی ہے، اور کچھ ایسی ہیں جو سونے والے کے لیے اس حضرۃ الخیال (خیال کی حضوری) میں جلوہ گر ہوتی ہیں جس میں وہ ہے، اور یہی وہ ہے جس کا خواب ہمیشہ سچا ہوتا ہے۔ اور ہر سچا خواب غلطی نہیں کرتا۔ پس اگر خواب غلطی کرے تو خواب نے غلطی نہیں کی، بلکہ تعبیر کرنے والے نے غلطی کی جہاں اسے یہ معلوم نہ ہوا کہ اس صورت سے کیا مراد ہے۔\n\n> أ لا تراه صلى الله عليه وسلم ما قال لأبي بكر حين عبر رؤيا الشخص المذكور أصبت بعضا وأخطأت بعضا\n> کیا تم نہیں دیکھتے کہ نبی صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ سے اس شخص کے خواب کی تعبیر کے وقت یہ نہیں فرمایا کہ \"تم نے کچھ درست کہا اور کچھ غلطی کی\"؟\n\nآپ نے اس شخص کے بارے میں فرمایا جس نے خواب میں دیکھا کہ اس کی گردن ماری گئی اور اس کا سر گر گیا، اور وہ سر لڑھکتا ہوا اس سے باتیں کر رہا تھا۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اسے بتایا کہ شیطان اس سے کھیل رہا ہے۔\nپس رسول اللہ صلی اللہ علیہ وسلم نے اس صورت کو جان لیا جو اس نے دیکھی تھی، اور آپ نے یہ نہیں فرمایا کہ \"تمہارا خیال فاسد ہے\"۔ کیونکہ اس نے حق دیکھا تھا، لیکن تعبیر میں غلطی کی تھی۔ پس نبی صلی اللہ علیہ وسلم نے اسے اس حقیقت کے بارے میں بتایا جو اس سونے والے نے دیکھی تھی۔ اور اسی طرح فرعون کی قوم کو صبح و شام ان صورتوں میں آگ پر پیش کیا جاتا ہے اور وہ اس میں داخل نہیں ہوتے، کیونکہ وہ اس سینگ (قرن) میں اور اس صورت میں محبوس ہیں۔ اور قیامت کے دن وہ سخت ترین عذاب میں داخل ہوں گے، اور وہ حسی عذاب ہو گا، نہ کہ وہ متخیل عذاب جو انہیں موت کے وقت پیش کرنے سے ہوا تھا۔\n\n**[عین خیال (عین الخيال) مطلق خیالی اور محسوس صورت کا ادراک کرتی ہے]**\n\nپس عین خیال (عین الخيال) سے خیالی صورتوں اور حسی صورتوں کا ادراک ایک ساتھ ہوتا ہے۔ پس متخیل جو کہ انسان ہے، وہ اپنی عین خیال سے کبھی متخیل کا ادراک کرتا ہے۔\n\n> كقوله صلى الله عليه وسلم مثلت لي الجنة في عرض هذا الحائط\n> جیسا کہ نبی صلی اللہ علیہ وسلم کا فرمان: \"میرے لیے جنت کو اس دیوار کے عرض میں متمثل کیا گیا۔\"\n\nپس آپ نے اس کا ادراک اپنی عین حس (عین الحس) سے کیا۔ اور ہم نے یہ اس لیے کہا کہ آپ نے آگے بڑھ کر جنت کو دیکھا تاکہ اس میں سے ایک خوشہ لے لیں، اور پیچھے ہٹے جب آپ نے آگ کو دیکھا، اور آپ نماز میں تھے۔ اور ہم جانتے ہیں کہ آپ کے پاس اتنی قوت تھی کہ اگر آپ نے اس کا ادراک عین خیال سے کیا ہوتا نہ کہ عین حس سے، تو آپ کے جسم میں آگے بڑھنے یا پیچھے ہٹنے کا کوئی اثر نہ ہوتا۔ کیونکہ ہم یہ پاتے ہیں، حالانکہ ہم آپ صلی اللہ علیہ وسلم کی قوت اور مرتبے میں نہیں ہیں۔ اور برزخ (البرزخ) میں ہر انسان اپنے کسب کا گروی ہے، اپنے اعمال کی صورتوں میں محبوس ہے، یہاں تک کہ قیامت کے دن ان صورتوں سے دوسری نشأت میں اٹھایا جائے گا۔ اور اللہ یَقُولُ الْحَقَّ وهُوَ یَهْدِی السَّبِیلَ (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب شصت و سوم: در معرفت بقای مردم در برزخ (البرزخ) میان دنیا و رستاخیز)\n\nمیان قیامت و دنیا برای صاحب نظر *** مراتبی برزخی است که دیوارهایی دارد\n\nکه دربرگیرنده حکم آن چیزی است که صاحبش *** پیش از مرگ بر آن بوده است؛ پس عبرت گیرید\n\nبر همه چیز قدم‌ها و سلطنتی دارد *** که عجایب را آشکار می‌کند، نه باقی می‌گذارد و نه رها می‌کند\n\nدر هستی (الوجود) میدانی فراخ دارد بدون *** هیچ قیدی، و نه عین است و نه اثر\n\nبه حق (الحق) می‌گوید باش، و حق (الحق) آفریننده آن است *** پس چگونه بشری از احکام آن خارج شود؟\n\nعلوم در آن است و هر شکننده کمر در آن *** دلایل و اعجاز و عبرت‌ها در آن است\n\nاگر خیال (الخيال) نبود، امروز در نیستی بودیم *** و هیچ غرض و حاجتی در ما برآورده نمی‌شد\n\nاگر آن را تعقل کنی، سلطانش «کان» (بود) است *** که شرع و عقل و نظر آن را آورده است\n\nاز حروف، کاف صفات از آن اوست، پس *** از صورتی جدا نمی‌شود مگر آنکه صورتی دیگر می‌آید\n\n### [برزخ (البرزخ): امری جداکننده میان دو چیز بدون افراط]\n\nقول ما «سلطانها کان» (سلطانش بود) با رفع (ضمه) سلطانها، یعنی سلطان خیال (الخيال) عین «کان» (بود) است و این همان معنای قول پیامبر (ص) است: «اعبد الله كأنك تراه» (خدا را چنان بپرست که گویی او را می‌بینی).\n\nپس آن (خیال) خیر است و سلطانش مبتدا است. تقدیر کلام این است: سلطان حضرت خیال (الخيال) از الفاظ، «کان» است. بدان که برزخ (البرزخ) عبارت است از امری جداکننده میان دو چیز که هرگز متطرف (افراطی) نیست، مانند خط جداکننده میان سایه و آفتاب، و مانند قول خداوند متعال: «مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ» (دو دریا را به هم آمیخت، در حالی که به هم می‌رسند، میان آن دو برزخی است که تجاوز نمی‌کنند). و معنای «لا يَبْغِيانِ» (تجاوز نمی‌کنند) این است که هیچ یک با دیگری مخلوط نمی‌شود، اگرچه حس از جدا کردن میان آن دو عاجز باشد. عقل حکم می‌کند که میان آن دو مانعی است که آن‌ها را از هم جدا می‌کند؛ پس آن مانع معقول، برزخ (البرزخ) است. اگر با حس درک شود، آن یکی از آن دو امر است، نه برزخ. هر دو امری که در مجاورت به برزخی نیاز دارند که عین هیچ یک از آن دو نیست، اما نیروی هر دوی آن‌ها در آن وجود دارد. و چون برزخ (البرزخ) امری جداکننده میان معلوم و غیر معلوم، میان معدوم و موجود، میان منفی و مثبت، و میان معقول و غیر معقول است، به اصطلاح برزخ نامیده شده است. و آن در ذات خود معقول است و چیزی جز خیال (الخيال) نیست. زیرا وقتی آن را درک می‌کنی و عاقل هستی، می‌دانی که چیزی وجودی را درک کرده‌ای که چشمت بر آن افتاده است، و قطعاً می‌دانی که آنجا اصلاً و ریشه‌ای چیزی نیست. پس این چیست که برایش شیئیت وجودی اثبات کردی و در عین اثبات، آن را از او نفی نمودی؟\n\n### [خیال (الخيال) مانند برزخ (البرزخ) نه موجود است و نه معدوم، نه معلوم است و نه مجهول]\n\nپس خیال (الخيال) نه موجود است و نه معدوم، نه معلوم است و نه مجهول، نه منفی است و نه مثبت. همان‌طور که انسان صورت خود را در آینه درک می‌کند، قطعاً می‌داند که صورت خود را به وجهی درک کرده است، و قطعاً می‌داند که صورت خود را به وجهی درک نکرده است، زیرا اگر جرم آینه کوچک باشد، ظرافت (دقت) را در آن می‌بیند و می‌داند که صورتش بسیار بزرگ‌تر از آن چیزی است که دیده است. و اگر جرم آینه بزرگ باشد، صورت خود را در نهایت بزرگی می‌بیند و یقین دارد که صورتش کوچک‌تر از آن چیزی است که دیده است. و نمی‌تواند انکار کند که صورت خود را دیده است، و می‌داند که صورتش نه در آینه است و نه میان او و آینه. و این بازتاب شعاع بصر به سوی صورت مرئی در آن از بیرون نیست، چه صورت خودش باشد یا غیر آن؛ زیرا اگر چنین بود، صورت را به اندازه واقعی‌اش درک می‌کرد. در دیدن صورت در شمشیر از نظر طول یا عرض، آنچه را ذکر کردیم برایت روشن می‌شود، با علم به اینکه بدون شک صورت خود را دیده است. پس در این قول که صورت خود را دیده است، نه راستگو است و نه دروغگو، و صورت خود را ندیده است. پس آن صورت مرئی چیست و محل آن کجاست و شأن آن چیست؟ آن منفی و ثابت، موجود و معدوم، معلوم و مجهول است. خداوند سبحان این حقیقت را برای بنده‌اش آشکار ساخت و مثالی زد تا بداند و یقین کند که وقتی در درک حقیقت این امر که خود از عالم است، عاجز و سرگردان می‌شود و علمی به حقیقت آن ندارد، پس نسبت به خالق آن عاجزتر و جاهل‌تر و سرگردان‌تر است. و با این مثال او را آگاه ساخت که تجلیات حق (الحق) برای او از این امری که عقول در آن حیران شده‌اند و از درک حقیقتش عاجز مانده‌اند، لطیف‌تر و دقیق‌تر است، تا جایی که عجزشان به آنجا رسیده که می‌گویند آیا این ماهیتی دارد یا ماهیتی ندارد؟ زیرا آن را به عدم محض ملحق نمی‌کنند، در حالی که بصر چیزی را درک کرده است، و نه به وجود محض، در حالی که دانسته‌اند که آنجا چیزی نیست، و نه به امکان محض.\n\n### [خواب و آنچه پس از مرگ تا زمان رستاخیز است و حال کشف (الکشف)]\n\nو انسان در خواب و پس از مرگش تا زمان بعث (رستاخیز) به چنین حقیقتی می‌رسد، پس اعراض را به صورت‌هایی می‌بیند که قائم به خود هستند و با او سخن می‌گویند و او با آن‌ها سخن می‌گوید، به صورت اجسادی که در آن‌ها شک نمی‌کند. و صاحب کشف (المکاشف) در بیداری خود چیزی را می‌بیند که شخص خوابیده در حال خوابش و مرده پس از مرگش می‌بیند، همان‌طور که در آخرت صورت اعمال را می‌بیند که وزن می‌شوند، با وجود اینکه اعراض هستند. و مرگ را به صورت قوچی ابلق می‌بیند که ذبح می‌شود. و مرگ نسبتی است که جدایی از اجتماع را نشان می‌دهد. پس منزه است کسی که جاهل می‌شود و نمی‌داند، و می‌داند و جاهل نمی‌شود. «لا إِلهَ إِلَّا هُوَ الْعَزِيزُ الْحَكِيمُ» (هیچ معبودی جز او نیست، که عزیز و حکیم است).\n\n### [چشم حس و چشم خیال (الخيال)]\n\nو برخی از مردم این متخیل را با چشم حس درک می‌کنند و برخی با چشم خیال (الخيال)، و منظورم در حال بیداری است. اما در خواب، قطعاً با چشم خیال (الخيال) است. پس اگر انسان بخواهد در حال بیداری خود، چه در دنیا باشد و چه در روز قیامت، تفاوت بگذارد، باید به متخیل نگاه کند و آن را با نگاه خود مقید سازد. اگر اکوان (حالات) آن منظوری که به آن نگاه می‌کند، به دلیل اختلاف در تکوینات، بر او مختلف شود، در حالی که انکار نمی‌کند که عین همان است، و نگاه او را از اختلاف تکوینات در آن باز نمی‌دارد، مانند کسی که به آفتاب‌پرست نگاه می‌کند و اختلاف رنگ‌ها را بر آن می‌بیند، پس آن بدون شک عین خیال (الخيال) است، نه عین حس. پس خیال (الخيال) را با چشم خیال (الخيال) درک کرده‌ای، نه با چشم حس. و اندکی از کسانی که ادعای کشف (الکشف) ارواح ناری و نوری می‌کنند، به این نکته پی می‌برند، هنگامی که آن ارواح به صورت‌هایی محسوس برای چشمشان متمثل می‌شوند، و نمی‌دانند که با چه چیزی آن را درک کرده‌اند، آیا با چشم خیال (الخيال) یا با چشم حس؟ و هر دو ادراک، یعنی ادراک با حاسه چشم است، زیرا چشم هم ادراک با عین خیال (الخيال) و هم با عین حس را می‌دهد. و این علمی دقیق است، یعنی علم به جدایی میان دو چشم و میان حاسه چشم و عین حس. و اگر چشم، متخیل را درک کند و از آن غافل نشود و ببیند که تکوینات بر آن مختلف نمی‌شود و آن را در یک حال در مواضع مختلف به طور همزمان نمی‌بیند، و ذات یکی است و در آن شک نمی‌کند و در اکوان مختلف منتقل و متحول نشده است، پس می‌داند که آن محسوس است نه متخیل، و آن را با چشم حس درک کرده است نه با چشم خیال (الخيال). و از اینجاست که درک انسان در خواب، پروردگار متعال خود را شناخته می‌شود، در حالی که او منزه از صورت و مثال است، و ضبط و تقید ادراک او نسبت به حق. و از اینجاست که می‌شناسی:\n\nآنچه در خبر صحیح آمده است مبنی بر اینکه باری تعالی در پست‌ترین صورتی که او را دیده‌اند، تجلی می‌کند.\n\nو در تحول او به صورتی که آن را می‌شناسند، در حالی که قبلاً آن را انکار کرده و از آن پناه برده بودند. پس دانسته می‌شود که با کدام چشم او را می‌بیند. من به تو گفتم که خیال (الخيال) به خودی خود درک می‌کند، منظورم با چشم خیال (الخيال) است، یا با بصر درک می‌شود؟ و صحیح در این باره چیست تا بر آن اعتماد کنیم؟ و ما در این باره می‌گوییم:\n\nاگر تجلی کند حبیبم *** با کدام چشم او را ببینم؟\n\nبا چشم او نه با چشم من *** زیرا جز او کسی او را نمی‌بیند\n\nاین تنزیه مقام او و تصدیق کلام اوست، زیرا اوست که فرمود: «لا تُدْرِكُهُ الْأَبْصارُ» (چشم‌ها او را درک نمی‌کنند). و هیچ سرایی را از سرای دیگر استثنا نکرد، بلکه آن را به عنوان آیه‌ای مطلق و مسئله‌ای معین و محقق فرستاد. پس جز او کسی او را درک نمی‌کند. پس با چشم او سبحانه او را می‌بینم، در خبر صحیح آمده است: «كنت بصره الذي يبصر به» (من چشم او هستم که با آن می‌بیند). پس ای غافل خفته از مانند این، بیدار شو و آگاه باش! که دری از معارف بر تو گشودم که افکار به آن نمی‌رسند، اما عقول به پذیرش آن می‌رسند، یا به واسطه عنایت الهی یا به واسطه جلای قلوب با ذکر و تلاوت. پس عقل آنچه را که تجلی (التجلی) به او می‌دهد، می‌پذیرد و می‌داند که آن از نیروی نفس او از جهت فکرش خارج است و فکرش هرگز آن را به او نمی‌دهد. پس خدای تعالی را شکر می‌کند که او را به نشأتی آفرید که با آن چنین چیزی را می‌پذیرد، و آن نشأت رسولان و انبیا و اهل عنایت از اولیا است. و این برای آن است که بداند پذیرش او شریف‌تر از فکر اوست. پس ای برادر، پس از این تحقیق کن که چه کسی از پشت این در بر تو تجلی می‌کند؟ این مسئله‌ای عظیم است که خردها در آن حیران شده‌اند.\n\n### [دمیدن در صور (الصور) و نواختن در ناقور (الناقور)]\n\nسپس شارع که صادق است، این باب را که همان حضرت برزخی است که پس از مرگ به آن منتقل می‌شویم و نفوس خود را در آن مشاهده می‌کنیم، صور (الصور) و ناقور (الناقور) نامیده است. و صور (الصور) در اینجا جمع «صورة» (صورت) با صاد است. پس در صور دمیده می‌شود و در ناقور نواخته می‌شود، و آن عین همان است و نام‌ها به دلیل اختلاف احوال و صفات بر آن مختلف شده‌اند. و چون صفات مختلف شدند، نام‌ها نیز مختلف شدند. پس نام‌های آن مانند خود آن شده است که کسی که عادتش تفکیک حقایق است و چیزی از آن‌ها را رها نمی‌کند، در آن حیران می‌شود. زیرا برای او محقق نمی‌شود که آیا نقر (نواختن) اصل در وجود اسم ناقور (الناقور) است یا ناقور (الناقور) اصل در وجود اسم نقر؟ مانند مسئله نحوی که آیا فعل از مصدر مشتق شده یا مصدر از فعل؟ سپس از مسئله نحوی با چیز دیگری فاصله می‌گیرد تا شبیه مسئله نحوی در اشتقاق نباشد، با این قول خداوند: «يُنْفَخُ فِي الصُّورِ» (در صور دمیده می‌شود) و نگفت: در منفوخٌ فیه (آنچه در آن دمیده می‌شود). پس آیا صورت بودن آن اصل در وجود نفخ (دمیدن) است یا وجود نفخ اصل در وجود اسم صور (الصور)؟ و هنگامی که خداوند تعدیل صورت انسان را ذکر کرد، فرمود: «وَنَفَخْتُ فِيهِ» (و در آن دمیدم). و درباره عیسی (ع) پیش از خلق صورتش فرمود: «فَنَفَخْنا فِيها مِنْ رُوحِنا» (پس در آن از روح خود دمیدیم). پس صورت ظاهر شد و حیرت واقع شد که اصل چیست؟ آیا صورت در وجود نفخ است یا نفخ در وجود صورت؟ این از همان قبیل است، به ویژه که جبرئیل (ع) در زمان مذکور در حال تمثل به بشر بود و مریم تخیل کرد که او بشر است. پس آیا او را با بصر حسی درک کرد یا با چشم خیال (الخيال)؟ در این صورت او از کسانی است که خیال (الخيال) را با خیال (الخيال) درک کرده است. و اگر چنین باشد، چیزی عظیم‌تر بر تو گشوده می‌شود و آن این است که آیا در نیروی خیال (الخيال) هست که صورت حسی حقیقی بدهد؟ در این صورت حس بر خیال (الخيال) فضیلتی ندارد، زیرا حس صور را به خیال (الخيال) می‌دهد. پس چگونه ممکن است مؤثر در آن، در کسی که خود مؤثر در اوست، مؤثر باشد؟ و این محال عقلی است. پس به این گنج‌ها توجه کن، زیرا اگر آن‌ها را به دست آورده باشی، در عالم کسی جز تو که با تو در این امر مساوی باشد، نخواهد بود.\n\n### [صور (الصور) رستاخیز و سلطنت خیال (الخيال)]\n\nهنگامی که از رسول خدا (ص) درباره صور (الصور) سؤال شد که چیست، فرمود: «هو قرن من نور ألقمه إسرافيل» (آن شیپوری از نور است که اسرافیل آن را در دهان گرفته است).\n\nپس خبر داد که شکل آن به شکل شیپور است و به وسعت و تنگی وصف شده است، زیرا شیپور هم وسیع است و هم تنگ. و نزد ما بر خلاف آن چیزی است که اهل نظر در تفاوت میان بالای شیپور و پایین آن تخیل می‌کنند، و ان‌شاءالله پس از این در همین باب آن را ذکر خواهیم کرد. پس بدان که وسعت این شیپور در نهایت وسعت است و هیچ یک از اکوان از آن وسیع‌تر نیست، زیرا با حقیقت خود بر هر چیزی و بر آنچه که شیء نیست، حکم می‌کند. و عدم محض و محال و واجب و امکان را صورت می‌بخشد و وجود را عدم و عدم را وجود می‌سازد. و در آن است که:\n\nپیامبر (ص) می‌فرماید: یعنی از حضرت این (خیال): «اعبد الله كأنك تراه» (خدا را چنان بپرست که گویی او را می‌بینی).\n\nو خداوند در قبله نمازگزار است.\n\nیعنی او را در قبله خود تخیل می‌کنی و با او مواجه می‌شوی تا او را مراقبه کنی و از او حیا کنی و ادب را در نمازت با او رعایت کنی. زیرا اگر این کار را نکنی، بی‌ادبی کرده‌ای.\n\n### [خیال (الخيال) وسیع‌ترین و تنگ‌ترین چیزهاست]\n\nاگر شارع نمی‌دانست که نزد تو حقیقتی به نام خیال (الخيال) وجود دارد که این حکم را دارد، به تو نمی‌گفت: «كأنك تراه» (گویی او را می‌بینی) با چشمت. زیرا دلیل عقلی از آن منع می‌کند، چرا که با دلیل خود تشبیه و بصر را محال می‌داند. و بصر چیزی جز دیوار را درک نکرده است. پس دانستیم که شارع تو را خطاب کرده است که تخیل کنی که با حق (الحق) در قبله‌ای که برایت مشروع شده است، مواجه هستی. و خداوند می‌فرماید: «فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله» (پس به هر سو رو کنید، آنجا وجه خداست). و وجه شیء حقیقت و عین آن است. پس خیال (الخيال) کسی را صورت بخشیده است که صورت و تصور بر او به دلیل عقلی محال است. به همین دلیل وسیع بوده است. اما تنگی آن، به این دلیل است که در وسع خیال (الخيال) نیست که امری از امور حسی و معنوی و نسبت‌ها و اضافات و جلال خدا و ذات او را بپذیرد مگر با صورت. و اگر بخواهد چیزی را بدون صورت درک کند، حقیقتش آن را به او نمی‌دهد، زیرا آن عین وهم است و نه غیر آن. پس از این جهت در نهایت تنگی است، زیرا معانی را هرگز از مواد مجرد نمی‌سازد. به همین دلیل حس نزدیک‌ترین چیز به آن است، زیرا صور را از حس می‌گیرد و معانی را در صور حسی متجلی می‌سازد. این از تنگی آن است. و این به این دلیل است که به عدم تقیید و اطلاق وجود و «فعال لما یرید» (انجام‌دهنده آنچه می‌خواهد) وصف نشود، مگر خداوند متعال به تنهایی. «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست). پس خیال (الخيال) وسیع‌ترین معلومات است و با این وسعت عظیمی که بر هر چیزی حکم می‌کند، عاجز است که معانی را مجرد از مواد، آن‌گونه که در ذات خود هستند، بپذیرد. پس علم را در صورت شیر یا عسل و شراب و مروارید می‌بیند، و اسلام را در صورت گنبد و ستون‌ها می‌بیند، و قرآن را در صورت روغن و عسل می‌بیند، و دین را در صورت قید می‌بیند، و حق (الحق) را در صورت انسان و در صورت نور می‌بیند. پس او وسیع و تنگ است، و خداوند وسیع مطلق است و به آنچه خلق خود را بر آن آفریده، داناست، چنانکه فرمود: «أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدى‏» (به هر چیزی خلقتش را داد، سپس هدایت کرد). یعنی امور را بر آنچه هستند، با دادن خلقت هر چیز به آن، بیان نمود.\n\n### [نور و شیپور رستاخیز و عمومیت سلطنت خیال (الخيال)]\n\nو اما اینکه شیپور از نور است، به این دلیل است که نور سبب کشف (الکشف) و ظهور است، زیرا اگر نور نبود، بصر چیزی را درک نمی‌کرد. پس خداوند این خیال (الخيال) را نوری قرار داد که با آن تصویر هر چیزی، هر امری که باشد، درک می‌شود، همان‌طور که ذکر کردیم. پس نور آن در عدم محض نفوذ می‌کند و آن را به صورت وجود درمی‌آورد. پس خیال (الخيال) به نام نور از همه مخلوقاتی که به نوری بودن وصف شده‌اند، سزاوارتر است. و نور آن شبیه انوار نیست و با آن تجلیات (التجلیات) درک می‌شود. و آن نور عین خیال (الخيال) است نه نور عین حس. پس بفهم، زیرا معرفت به نوری بودن آن برایت سودمند است. پس درمی‌یابی که کسی که این را نمی‌داند، در حکم خود خطا می‌کند، و او کسی است که می‌گوید: این خیال (الخيال) فاسد است. و این به دلیل عدم معرفت این گوینده به ادراک نور خیالی است که خداوند متعال به او داده است. همان‌طور که این گوینده حس را در برخی از مدرکاتش به خطا می‌اندازد، در حالی که ادراک حس صحیح است و حکم برای غیر آن است نه برای خود آن. پس حاکم خطا کرده است نه حس. همچنین خیال (الخيال) با نور خود آنچه را درک کرده، درک نموده است و حکمی ندارد، بلکه حکم برای غیر آن است و آن عقل است. پس خطا به آن نسبت داده نمی‌شود، زیرا اصلاً خیال (الخيال) فاسدی وجود ندارد، بلکه همه آن صحیح است.\n\n### [خیال (الخيال) مانند صور (الصور) رستاخیز است، بالای آن تنگ و پایین آن وسیع است]\n\nاما اصحاب ما در مورد این شیپور اشتباه کرده‌اند. بیشتر عقلا تنگ‌ترین جای آن را مرکز و بالاترین آن را فلک اعلی قرار داده‌اند که فلکی بالاتر از آن نیست، و صورتی که دربردارد، صور عالم است. پس آن‌ها وسیع‌ترین جای شیپور را بالا و تنگ‌ترین آن را پایین عالم قرار داده‌اند. در حالی که امر آن‌گونه که گمان کرده‌اند، نیست. بلکه چون خیال (الخيال)، همان‌طور که گفتیم، حق (الحق) و مادون آن از عالم، حتی عدم را صورت می‌بخشد، بالای آن تنگ و پایین آن وسیع است. و خداوند آن را این‌گونه آفریده است. پس اولین چیزی که از آن آفریده شد، تنگی است و آخرین چیزی که از آن آفریده شد، وسعت است، و آن همان است که به سر حیوان متصل است. و شکی نیست که حضرت افعال و اکوان وسیع‌تر است. به همین دلیل، عارف وسعتی در علم ندارد مگر به اندازه‌ای که از عالم می‌داند. سپس وقتی می‌خواهد به علم احدیت خداوند متعال منتقل شود، پیوسته از وسعت به تنگی، اندک اندک، بالا می‌رود. پس هرچه در علم به ذات حق (الحق) از طریق کشف (الکشف) بالاتر رود، علومش کمتر می‌شود تا جایی که معلومی جز حق (الحق) به تنهایی برایش باقی نمی‌ماند. و این تنگ‌ترین جای شیپور است. پس تنگی آن در حقیقت بالاترین است و در آن شرافت کامل است. و آن همان اولی است که از آن ظاهر می‌شویم، هنگامی که خداوند آن را در سر حیوان می‌رویاند. پس پیوسته بر صورت خود از تنگی بالا می‌رود و پایین آن وسعت می‌یابد، در حالی که از حال خود تغییر نمی‌کند.\n\nآن مخلوق اول است. آیا نمی‌بینی که حق (الحق) سبحانه اولین چیزی که آفرید، قلم بود یا بگو عقل، چنانکه گفته شده است؟ پس جز یکی نیافرید، سپس خلق را از آن واحد ایجاد کرد و عالم وسعت یافت. همچنین عدد، منشأ آن از واحد است، سپس دومی را می‌پذیرد، نه از واحد وجود. سپس تضعیف و ترکیب را در مراتب می‌پذیرد و وسعتی عظیم تا بی‌نهایت می‌یابد. پس وقتی در آن از وسعت به حدی از هزاران و غیره رسیدی، سپس واحدی را که عدد از آن نشأت گرفته است، طلب می‌کنی، پیوسته عدد در آن کاهش می‌یابد و آن وسعتی که در آن بودی، از تو زایل می‌شود تا به عدد دو برسی که با وجود آن عدد ظاهر شد، زیرا واحد اول آن بود. پس واحد تنگ‌ترین چیزهاست و با نظر به ذات خود، عدد نیست، بلکه به اعتبار اینکه دو یا سه یا چهار است. پس هرگز میان اسم و عین آن جمع نمی‌شود. این را بدان.\n\n### [ارواح اجسامی که در برزخ (البرزخ) سپرده شده‌اند و ادراکات آن‌ها]\n\nو مردم در وصف صور (الصور) به شیپور بر خلاف آنچه ذکر کردیم و پس از آنچه مقرر نمودیم، هستند. پس بدان که خداوند سبحان هنگامی که ارواح را از این اجسام طبیعی و عنصری قبض می‌کند، آن‌ها را در صورت‌های جسدی در مجموعه این شیپور نوری می‌سپارد. پس تمام آنچه انسان پس از مرگ در برزخ (البرزخ) از امور درک می‌کند، تنها با چشم صورتی است که در شیپور در آن قرار دارد و با نور آن است، و این ادراکی حقیقی است. و از صورت‌های آنجا، برخی مقید از تصرف هستند و برخی مطلق، مانند ارواح همه انبیا و ارواح شهدا. و برخی از آن‌ها به عالم دنیا در این سرا نظر دارند. و برخی از آن‌ها برای شخص خوابیده در حضرت خیال (الخيال) که در آن است، متجلی می‌شوند، و او کسی است که رؤیایش همیشه صادق است. و هر رؤیایی صادق است و خطا نمی‌کند. پس اگر رؤیا خطا کرد، رؤیا خطا نکرده است، بلکه تعبیرکننده‌ای که آن را تعبیر می‌کند، خطاکار است، زیرا ندانسته است که منظور از آن صورت چیست.\n\nآیا نمی‌بینی که پیامبر (ص) به ابوبکر هنگامی که رؤیای شخص مذکور را تعبیر کرد، نگفت: «بخشی را درست گفتی و بخشی را خطا کردی»؟\n\nدرباره مردی که در خواب دید گردنش زده شد و سرش افتاد و سر در حال غلتیدن با او سخن می‌گفت، رسول خدا (ص) به او فرمود که شیطان با او بازی می‌کند.\n\nپس رسول خدا (ص) صورت آنچه را که دیده بود، دانست و به او نگفت: «خیال (الخيال) تو فاسد است». زیرا او حقیقتی را دیده بود، اما در تأویل خطا کرد. پس پیامبر (ص) حقیقت آنچه را که آن شخص خوابیده دیده بود، به او خبر داد. همچنین قوم فرعون در آن صورت‌ها صبح و شام بر آتش عرضه می‌شوند و وارد آن نمی‌شوند، زیرا آن‌ها در آن شیپور و در آن صورت محبوس هستند. و روز قیامت وارد سخت‌ترین عذاب می‌شوند، و آن عذاب محسوس است نه متخیل، که در حال مرگشان به صورت عرضه شدن برایشان بود.\n\n### [چشم خیال (الخيال) صورت خیالی مطلق محسوس را درک می‌کند]\n\nپس با چشم خیال (الخيال)، صورت‌های خیالی و صورت‌های محسوس به طور همزمان درک می‌شوند. و متخیل که همان انسان است، با چشم خیال (الخيال) خود، گاهی آنچه را که متخیل است، درک می‌کند.\n\nمانند قول پیامبر (ص): «مثلت لي الجنة في عرض هذا الحائط» (بهشت در عرض این دیوار برای من متمثل شد).\n\nپس آن را با چشم حس خود درک کرد. و ما گفتیم با چشم حس، زیرا هنگامی که بهشت را دید، پیش رفت تا خوشه‌ای از آن بگیرد و هنگامی که آتش را دید، عقب رفت، در حالی که در نماز بود. و ما می‌دانیم که او نیرویی دارد که اگر آن را با چشم خیال (الخيال) درک می‌کرد نه با چشم حس، در جسم او پیشروی و عقب‌نشینی تأثیری نمی‌گذاشت. زیرا ما این را می‌یابیم، در حالی که ما در نیروی او و در طبقه او (ص) نیستیم. و هر انسانی در برزخ (البرزخ) در گرو کسب خود است و در صورت اعمال خود محبوس است تا روز قیامت از آن صورت‌ها در نشأت آخرت مبعوث شود. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند). پایان جزء بیست و هشتم."
  },
  "page_count": 4
}