{
  "id": 86,
  "title": {
    "ar": "الباب السادس والثمانون في تقوى الحدود الدنياوية",
    "en": "Chapter Eighty-Six: Concerning the Piety (تقوى) of the Worldly Limits (الحدود الدنياوية)",
    "ur": "چھیاسیواں باب: دنیاوی حدود کی تقویٰ",
    "fa": "باب هشتاد و ششم در تقوای حدود دنیوی (الدنياوية)"
  },
  "content": {
    "ar": "## (الباب السادس والثمانون في تقوى الحدود الدنياوية)\n\n\nاعلم وفقك الله‏\n\n\n> المتقون حدود الله أفراد *** بهذه الدار والأفراد آحاد\n\n\n> إن الحدود إذا حققت صورتها *** برازخ وهي في التحقيق إشهاد\n\n\n> فلتتقي حدك الرسمي أن له *** غورا وفي غور ذاك الغور إلحاد\n\n\n> وقف لدى حظك الذاتي تحظ بما *** حظي به من له سعد وإسعاد\n\n\n> الفقر والعجز في دنيا وآخرة *** فغاية القرب قرب فيه إبعاد\n\n\n> هذي طريقة أقوام لهم همم *** فازوا بها وبها على الورى سادوا\n\n\n### [الدنيا دار امتزاج ونطفة أمشاج والآخرة دار تمييز]\n\n\nقال الله تعالى واتَّقُوا فِتْنَةً لا تُصِيبَنَّ الَّذِينَ ظَلَمُوا مِنْكُمْ خَاصَّةً واعْلَمُوا أَنَّ الله شَدِيدُ الْعِقابِ وأي عقوبة أشد من عقوبة تعم المستحق بها وغير المستحق والظالم وغير الظالم والبري‏ء والفاعل وهي هذه الحدود الدنيوية لأنها دار امتزاج ونطفة أمشاج فتعم عقوبتها لعدم التمييز وحدود الآخرة ليست كذلك فإنها دار تمييز فلا تصيب العقوبة إلا أهلها فلو كانت نشأة الآخرة من نطفة أمشاج كما ذهب إليه ابن قسي لعمت العقوبة أهلها وغير أهلها ومن هنا إن نظرت تعرف نشأة الآخرة أنها على غير مثال سبق كما أن نشأة الدنيا على غير مثال سبق وهو قوله ولَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولى‏ فَلَوْ لا تَذَكَّرُونَ أنها كانت على غير مثال ولهذا أتى بكلمة التحضيض‏\n\n\n### [الفتنة العامة والعقوبة الشاملة والحدود المتداخلة]\n\n\nوهذه الفتنة العامة والعقوبة الشاملة والحدود المتداخلة من صفة قوله فَعَّالٌ لِما يُرِيدُ فإن ظاهرها لا يقتضي العدل وباطنها يقتضي الفضل الإلهي ففي الآخرة لا تَزِرُ وازِرَةٌ وِزْرَ أُخْرى‏ وهنا ليس كذلك في عموم صورة العقوبة ولكن ما هي في البري‏ء عقوبة وإنما هي فتنة وفي الظالم عقوبة لأنها جاءته عقيب ظلمه فما يستوجبها البري‏ء ولكن حكم الدار عليه كما يحكم على أهل دار الكفر الدار وإن كان فيها من لا يستحق ما يستحقه الكفار قال تعالى ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ والنبي صلى الله عليه وسلم قد جعل مولى القوم منهم في الحكم‏\n\n\nوما هو منهم في نفس الأمر جعلنا الله ممن عامله بفضله ولم يطلبه بواجب حقه‏\n\n\n### [ظلم المصطفين من عباد الله‏]\n\n\nإذا قال الله في حق من اصطفاه من عباده إنه ظالِمٌ لِنَفْسِهِ حيث حمل الأمانة وهذا هو ظلم المصطفين من عباد الله لا ظلم يتعدى الحدود الإلهية فإنه من يَتَعَدَّ حُدُودَ الله فَقَدْ ظَلَمَ نَفْسَهُ لأن لنفسه حدا تقف عنده وهي عليه في نفسها وذلك الحد هو عين عبوديتها وحد الله هو الذي يكون له فإذا دخل العبد في نعت الربوبية وهو الله فقد تعدى حدود الله ومن يَتَعَدَّ حُدُودَ الله فَأُولئِكَ هُمُ الظَّالِمُونَ لأن حد الشي‏ء يمنع ما هو منه أن يخرج منه وما ليس منه أن يدخل فيه هذه هي الحدود الذاتية فمن يتقيها فَأُولئِكَ هُمُ الْمُفْلِحُونَ تِلْكَ حُدُودُ الله فَلا تَقْرَبُوها كَذلِكَ يُبَيِّنُ الله آياتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ فوصفهم بالتقوى إذا لم يتعدوها وجعلوها وقاية لهم‏\n\n\n### [الحدود الذاتية لله والرسمية]\n\n\nوليس بأيدينا من الحدود الذاتية لله شي‏ء والذي عندنا إنما هي الحدود\nالرسمية ولهذا اجترأ العباد عليها وتعدوها ومنها عوقبوا كما إذا أدخلهم الحق صاحب الحد فيما هو له لم يتصف بالظلم فما استوجب عقوبة ولما كان حدا رسميا قبل العبد الدخول فيه فإن دخل فيه بنفسه من غير إدخال صاحبه فقد عرض نفسه للعقوبة فصاحب الحد بخير النظرين إن شاء عاقب وإن شاء عفا وإن شاء أثنى كالمتصف بالكرم والعفو والصفح وهذه كلها حدود رسمية للحق‏\n\n\n### [حدود الله اللفظية]\n\n\nفاعلم ما نبهتك عليه من العلم الغريب في هذه المسألة فإنها من لباب المعرفة بالله وأما حدود الله اللفظية فما حجر منها شيئا سوى كلمة الله واختلفوا في كلمة الرحمن بالألف واللام وكذلك أيضا لم يتسم أحد بالرحمن الرحيم على أن يكون من الأسماء المركبة مثل بعل بك ورام‏هرمز وبلال‏آباذ والحماية لهذا الاسم لم يكن عن أمر إلا هي مشروع وإنما كانت حماية غيبية أغفل الله عن التسمية بهذا الاسم المركب الناس ويكفي هذا القدر من تقوى الحدود\n\n",
    "en": "Chapter Eighty-Six: Concerning the Guarding of Mundane Boundaries (تقوى الحدود الدنياوية)\n\nKnow, may Allah grant you success:\n\n> Those who guard the boundaries of Allah are individuals (أفراد) in this Abode,\n> And these individuals are unique ones (آحاد).\n> If you realize the form of the boundaries, they are Isthmuses (برازخ),\n> And in reality, they are a Witnessing (إشهاد).\n> So, guard your formal boundary (حدك الرسمي), for it has a depth,\n> And in the depth of that depth is deviation/heresy (إلحاد).\n> Stand at your essential portion (حظك الذاتي), and you will attain\n> What is attained by those who possess felicity and bliss.\n> Poverty and incapacity are in this world and the Hereafter,\n> For the ultimate proximity is a proximity that contains distance.\n> This is the path of a people who possess high aspirations (همم);\n> By them, they triumphed, and by them, they ruled over mankind.\n\n### [The World is the Abode of Mixture and Mixed Drops, and the Hereafter is the Abode of Distinction]\n\nAllah the Exalted said: <<And guard against a trial (فتنة) which will not afflict those who have wronged among you exclusively, and know that Allah is severe in penalty>>. And what punishment is more severe than a punishment that encompasses the deserving and the undeserving, the wrongdoer and the non-wrongdoer, the innocent and the perpetrator? This is the nature of these mundane boundaries (الحدود الدنيوية), because this Abode (الدنيا) is the abode of mixture (امتزاج) and mixed drops (نطفة أمشاج). Thus, its punishment is general due to the lack of distinction (التمييز).\n\nThe boundaries of the Hereafter are not like this, for it is the abode of distinction, so the punishment afflicts only those who belong to it. If the origination (نشأة) of the Hereafter were from mixed drops, as Ibn Qasi held, the punishment would encompass those who belong to it and those who do not. From this perspective, if you look, you will know that the origination of the Hereafter is not based on a prior example, just as the origination of the world was not based on a prior example. This is His saying: <<And certainly you have known the first origination (النشأة الأولى); why then do you not remember?>> that it was without a prior example. For this reason, He used the word of incitement.\n\n### [The General Trial, the Comprehensive Punishment, and the Intertwined Boundaries]\n\nThis general trial (الفتنة العامة), comprehensive punishment (العقوبة الشاملة), and intertwined boundaries (الحدود المتداخلة) stem from the Attribute of His saying: <<Doer of what He intends>>. For its outward aspect does not necessitate justice, but its inward aspect necessitates Divine Grace (الفضل الإلهي).\n\nIn the Hereafter, <<No bearer of burdens will bear the burden of another>>. But here (in the world), this is not the case regarding the generality of the form of the punishment. However, for the innocent (البريئ), it is not a punishment (عقوبة) but rather a trial (فتنة). For the wrongdoer (الظالم), it is a punishment because it came to him following his wrongdoing. The innocent does not deserve it, but the ruling of the Abode (حكم الدار) applies to him, just as the ruling of the Abode of Disbelief applies to its inhabitants, even if there are those within it who do not deserve what the disbelievers deserve. The Exalted said: <<And do not incline toward those who do wrong, lest the Fire touch you>>. And the Prophet, peace and blessings be upon him, made the client (مولى) of a people to be counted among them in the ruling, even if he is not truly one of them in reality (في نفس الأمر). May Allah make us among those whom He treats with His Grace (فضله) and does not demand from us the obligation of His right (واجب حقه).\n\n### [The Wrongdoing of the Chosen among Allah's Servants]\n\nWhen Allah says concerning one whom He has chosen among His servants that he is <<wronging himself (ظالِمٌ لِنَفْسِهِ)>> by bearing the Trust (الأمانة), this is the wrongdoing of the chosen among Allah’s servants, not a wrongdoing that transgresses the Divine Boundaries (الحدود الإلهية). For <<whoever transgresses the boundaries of Allah has certainly wronged himself>>. This is because the self (النفس) has a boundary at which it must stop, and that boundary is incumbent upon the self itself. That boundary is the very essence of its servitude (عبوديتها). The boundary of Allah is that which belongs to Him. Thus, if the servant enters into the description of Lordship (نعت الربوبية), which belongs to Allah, he has transgressed the boundaries of Allah. <<And whoever transgresses the boundaries of Allah—it is those who are the wrongdoers>>.\n\nBecause the boundary (حد) of a thing prevents what belongs to it from leaving it, and prevents what does not belong to it from entering it. These are the essential boundaries (الحدود الذاتية). So, whoever guards them, <<it is those who are the successful>>. <<These are the boundaries of Allah, so do not approach them. Thus does Allah make clear His signs to the people that they may become righteous (يَتَّقُونَ)>>. He described them with piety (التقوى) if they do not transgress these boundaries and make them a shield (وقاية) for themselves.\n\n### [The Essential and Formal Boundaries of Allah]\n\nWe possess nothing of the essential boundaries (الحدود الذاتية) of Allah. What we have are only the formal boundaries (الحدود الرسمية). For this reason, servants dared to approach and transgress them, and because of this, they were punished. Just as when the Real (الحق), the Possessor of the Boundary, admits them into what belongs to Him, He is not described by wrongdoing, and thus no punishment is incurred. But since it is a formal boundary, the servant accepts entering it. If he enters it by himself without the Possessor of the Boundary admitting him, he has exposed himself to punishment. The Possessor of the Boundary has the choice of two views: if He wills, He punishes; if He wills, He pardons; and if He wills, He praises, like one described by generosity, forgiveness, and overlooking. All of these are formal boundaries (حدود رسمية) belonging to the Real (الحق).\n\n### [The Verbal Boundaries of Allah]\n\nKnow what I have alerted you to concerning the subtle knowledge (العلم الغريب) in this matter, for it is from the core of Gnosis (المعرفة) of Allah. As for the verbal boundaries (حدود الله اللفظية), nothing was restricted from them except the word *Allah*, and there is disagreement regarding the word *al-Rahman* (The All-Merciful) with the definite article. Likewise, no one has named himself *al-Rahman al-Rahim* (The All-Merciful, the Especially Merciful) as a compound name, such as Ba'labakk, Ramhormuz, or Bilalabad. The protection (الحماية) of this Name was not due to a prescribed command, but rather it was an unseen protection (حماية غيبية) by which Allah caused people to neglect naming themselves with this compound Name. This much suffices concerning the guarding of the boundaries (تقوى الحدود).",
    "ur": "(چھیاسیواں باب دنیاوی حدود کی تقویٰ کے بیان میں)\n\nجان لو، اللہ تمہیں توفیق دے۔\n\n> اللہ کی حدود کی تقویٰ کرنے والے اس دنیا میں افراد (اَفراد) ہیں، اور افراد (اَفراد) ہی آحاد (اٰحاد) ہیں۔\n> اگر حدود کی صورت کو حقیقت میں دیکھا جائے تو وہ برزخیں (برازخ) ہیں، اور حقیقت میں وہ شہود (إشهاد) ہیں۔\n> پس تم اپنی رسمی حد کی تقویٰ کرو، کیونکہ اس کی ایک گہرائی ہے، اور اس گہرائی کی گہرائی میں الحاد ہے۔\n> اپنے ذاتی حصے کے پاس ٹھہرو، تاکہ تم وہ حاصل کر سکو جو خوش نصیبی اور سعادت والے نے حاصل کیا۔\n> دنیا اور آخرت میں فقر اور عجز ہے، پس قرب کی انتہا وہ قرب ہے جس میں دوری ہو۔\n> یہ ان لوگوں کا طریقہ ہے جن کے عزائم بلند ہیں، وہ ان کے ذریعے کامیاب ہوئے اور ان کے ذریعے مخلوق پر غالب آئے۔\n\n### [دنیا امتزاج کا گھر اور اخلاط کا نطفہ ہے، اور آخرت تمیز کا گھر ہے]\n\nاللہ تعالیٰ نے فرمایا:\n**وَاتَّقُوا فِتْنَةً لَّا تُصِيبَنَّ الَّذِينَ ظَلَمُوا مِنكُمْ خَاصَّةً ۖ وَاعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ**\n(اور اس فتنے سے ڈرو جو خاص طور پر صرف تم میں سے ظالموں کو ہی نہیں پہنچے گا، اور جان لو کہ اللہ سخت عذاب دینے والا ہے۔)\n\nاور کون سا عذاب اس عذاب سے زیادہ سخت ہے جو مستحق اور غیر مستحق، ظالم اور غیر ظالم، بے گناہ اور فاعل سب کو عام ہو؟ اور وہ یہی دنیاوی حدود ہیں، کیونکہ یہ امتزاج کا گھر اور اخلاط کا نطفہ (نطفة أمشاج) ہے، لہٰذا اس کا عذاب تمیز نہ ہونے کی وجہ سے عام ہوتا ہے۔ اور آخرت کی حدود ایسی نہیں ہیں، کیونکہ وہ تمیز کا گھر ہے، پس عذاب صرف اس کے اہل کو ہی پہنچے گا۔ پس اگر آخرت کی نشأت اخلاط کے نطفے (نطفة أمشاج) سے ہوتی، جیسا کہ ابن قسی کا خیال ہے، تو عذاب اس کے اہل اور غیر اہل سب کو عام ہو جاتا۔ اور اگر تم یہاں سے دیکھو تو تمہیں معلوم ہو جائے گا کہ آخرت کی نشأت کسی سابقہ مثال پر نہیں ہے، جیسا کہ دنیا کی نشأت بھی کسی سابقہ مثال پر نہیں تھی۔ اور یہی اس کا قول ہے:\n**وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَىٰ فَلَوْلَا تَذَكَّرُونَ**\n(اور تم پہلی پیدائش کو تو جان چکے ہو، پھر تم کیوں نہیں نصیحت حاصل کرتے؟)\nکہ وہ کسی مثال پر نہیں تھی، اور اسی لیے اس نے ترغیب کا کلمہ (فَلَوْلَا) استعمال کیا۔\n\n### [عام فتنہ، شامل عذاب اور باہم ملی ہوئی حدود]\n\nاور یہ عام فتنہ، شامل عذاب اور باہم ملی ہوئی حدود اس کے قول **فَعَّالٌ لِّمَا يُرِيدُ** (جو چاہتا ہے اسے خوب کرنے والا) کی صفت میں سے ہیں۔ کیونکہ اس کا ظاہر عدل کا تقاضا نہیں کرتا، لیکن اس کا باطن فضل الٰہی کا تقاضا کرتا ہے۔ پس آخرت میں:\n**لَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ**\n(کوئی بوجھ اٹھانے والا دوسرے کا بوجھ نہیں اٹھائے گا۔)\nاور یہاں عذاب کی عمومی صورت میں ایسا نہیں ہے۔ لیکن بے گناہ کے حق میں یہ عذاب نہیں ہے، بلکہ یہ صرف فتنہ ہے۔ اور ظالم کے حق میں یہ عذاب ہے، کیونکہ یہ اس کے ظلم کے بعد آیا ہے۔ پس بے گناہ اس کا مستحق نہیں ہوتا، لیکن اس پر گھر کا حکم لاگو ہوتا ہے، جیسا کہ دار الکفر کے رہنے والوں پر گھر کا حکم لاگو ہوتا ہے، اگرچہ اس میں ایسے لوگ بھی ہوں جو اس کے مستحق نہ ہوں جس کے مستحق کفار ہیں۔\n\nاللہ تعالیٰ نے فرمایا:\n**وَلَا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ**\n(اور ظالموں کی طرف مت جھکو، ورنہ تمہیں آگ چھو لے گی۔)\nاور نبی صلی اللہ علیہ وسلم نے قوم کے مولیٰ کو حکم میں انہی میں سے قرار دیا ہے۔\n\nحالانکہ وہ حقیقت میں ان میں سے نہیں ہوتا۔ اللہ ہمیں ان لوگوں میں شامل کرے جن سے وہ اپنے فضل کے ساتھ معاملہ کرتا ہے اور اپنے حق کے واجب کے ساتھ مطالبہ نہیں کرتا۔\n\n### [اللہ کے چنے ہوئے بندوں کا ظلم]\n\nجب اللہ اپنے چنے ہوئے بندوں کے حق میں فرماتا ہے کہ وہ **ظَالِمٌ لِّنَفْسِهِ** (اپنی جان پر ظلم کرنے والا) ہے، اس لیے کہ اس نے امانت اٹھائی۔ اور یہ اللہ کے چنے ہوئے بندوں کا ظلم ہے، نہ کہ وہ ظلم جو حدود الٰہیہ سے تجاوز کرے۔ کیونکہ:\n**وَمَن يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ**\n(اور جو اللہ کی حدود سے تجاوز کرے تو اس نے یقیناً اپنی جان پر ظلم کیا۔)\nکیونکہ نفس کی ایک حد ہے جہاں وہ ٹھہرتا ہے، اور وہ حد نفس پر ہی لاگو ہوتی ہے، اور وہ حد عین اس کی عبودیت ہے۔ اور اللہ کی حد وہ ہے جو اس کے لیے ہو۔ پس جب بندہ ربوبیت کی صفت میں داخل ہوتا ہے، جو کہ اللہ کی صفت ہے، تو وہ اللہ کی حدود سے تجاوز کر جاتا ہے۔\n**وَمَن يَتَعَدَّ حُدُودَ اللَّهِ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ**\n(اور جو اللہ کی حدود سے تجاوز کریں، تو وہی ظالم ہیں۔)\nکیونکہ کسی شے کی حد اسے اس بات سے روکتی ہے کہ جو اس میں سے ہے وہ باہر نکل جائے، اور جو اس میں سے نہیں ہے وہ اندر داخل ہو جائے۔ یہ ذاتی حدود (الحدود الذاتیۃ) ہیں۔ پس جو ان کی تقویٰ کرتا ہے:\n**فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ**\n(تو وہی فلاح پانے والے ہیں۔)\n**تِلْكَ حُدُودُ اللَّهِ فَلَا تَقْرَبُوهَا ۗ كَذَٰلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ**\n(یہ اللہ کی حدود ہیں، پس ان کے قریب مت جاؤ۔ اسی طرح اللہ اپنی آیات لوگوں کے لیے بیان کرتا ہے تاکہ وہ تقویٰ اختیار کریں۔)\nپس اللہ نے انہیں متقی قرار دیا جب انہوں نے ان حدود سے تجاوز نہیں کیا اور انہیں اپنے لیے ڈھال بنا لیا۔\n\n### [اللہ کی ذاتی حدود اور رسمی حدود]\n\nاور اللہ کی ذاتی حدود (الحدود الذاتیۃ) میں سے کوئی چیز ہمارے اختیار میں نہیں ہے۔ اور جو ہمارے پاس ہے وہ صرف رسمی حدود (الحدود الرسمیۃ) ہیں۔ اور اسی وجہ سے بندوں نے ان پر جرات کی اور ان سے تجاوز کیا، اور انہی کی وجہ سے انہیں سزا دی گئی۔ جیسا کہ جب حق (الحق)، جو حد کا مالک ہے، انہیں اس میں داخل کرتا ہے جو اس کا ہے، تو وہ ظلم سے متصف نہیں ہوتا، لہٰذا وہ سزا کا مستحق نہیں ہوتا۔ اور جب یہ ایک رسمی حد تھی، تو بندے نے اس میں داخل ہونے سے پہلے قبول کیا۔ پس اگر وہ اپنے مالک کے داخل کیے بغیر خود اس میں داخل ہو گیا، تو اس نے اپنے آپ کو سزا کے لیے پیش کر دیا۔ پس حد کا مالک دونوں صورتوں میں بہترین ہے: اگر چاہے تو سزا دے، اور اگر چاہے تو معاف کر دے، اور اگر چاہے تو تعریف کرے، جیسے وہ جو کرم، عفو اور درگزر کی صفات سے متصف ہے۔ اور یہ سب حق (الحق) کی رسمی حدود ہیں۔\n\n### [اللہ کی لفظی حدود]\n\nپس جان لو جو میں نے تمہیں اس مسئلے میں عجیب علم (العلم الغریب) سے آگاہ کیا ہے، کیونکہ یہ معرفت باللہ (المعرفۃ باللہ) کا مغز ہے۔ اور جہاں تک اللہ کی لفظی حدود (حدود اللہ اللفظیۃ) کا تعلق ہے، تو اس نے لفظ \"اللہ\" کے سوا کسی چیز کو محدود نہیں کیا۔ اور \"الرحمن\" کے لفظ میں الف لام کے ساتھ اختلاف کیا گیا ہے۔ اسی طرح کسی نے بھی \"الرحمن الرحیم\" سے مرکب نام نہیں رکھا، جیسے بعلبک، رام ہرمز اور بلال آباد۔ اور اس نام کی حفاظت کسی مشروع حکم کی وجہ سے نہیں تھی، بلکہ یہ ایک غیبی حفاظت تھی کہ اللہ نے لوگوں کو اس مرکب نام سے نام رکھنے سے غافل کر دیا۔ اور حدود کی تقویٰ کے لیے یہ مقدار کافی ہے۔",
    "fa": "(باب هشتاد و ششم در تقوای حدود دنیوی)\n\nبدان، خداوند تو را توفیق دهد:\n\n> پرهیزکارانِ حدود حق (حدود الله) در این سرا افرادند * و افراد نیز یگانه‌اند.\n> اگر حدود را در صورتشان محقق سازی، برزخ‌هایی هستند * و در حقیقت، شهود (إشهاد) می‌باشند.\n> پس از حد رسمی خود پرهیز کن، زیرا آن را ژرفایی است * و در ژرفای آن ژرفا، الحاد (کفر) است.\n> و نزد بهره ذاتی خود بایست تا بهره‌مند شوی از آنچه * کسی که سعادت و نیک‌بختی دارد، بهره‌مند شد.\n> فقر و عجز در دنیا و آخرت است * پس نهایت قرب، قربی است که در آن دوری باشد (إبعاد).\n> این روش اقوامی است که همت‌هایی دارند * که با آن رستگار شدند و با آن بر مردمان سروری یافتند.\n\n### [دنیا سرای آمیزش و نطفه امشاج (نطفة أمشاج) است و آخرت سرای تمییز]\n\nخداوند متعال فرمود: «و از فتنه‌ای بپرهیزید که تنها به کسانی از شما که ستم کرده‌اند نمی‌رسد، و بدانید که خداوند سخت‌کیفر است.» (وَاتَّقُوا فِتْنَةً لَا تُصِيبَنَّ الَّذِينَ ظَلَمُوا مِنْكُمْ خَاصَّةً وَاعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ) و چه عقوبتی سخت‌تر از عقوبتی که مستحق و غیر مستحق، ظالم و غیر ظالم، و بی‌گناه و فاعل را در بر می‌گیرد؟ و آن همین حدود دنیوی است، زیرا دنیا سرای آمیزش و نطفه امشاج (نطفة أمشاج) است، پس عقوبت آن به دلیل نبود تمییز، فراگیر است. اما حدود آخرت چنین نیست، زیرا آن سرای تمییز است، پس عقوبت جز به اهلش نمی‌رسد. اگر نشأة (نشأة) آخرت نیز از نطفه امشاج بود، چنانکه ابن قسی بدان معتقد است، عقوبت اهلش و غیر اهلش را فرا می‌گرفت. از اینجاست که اگر بنگری، درمی‌یابی که نشأة آخرت بر غیر مثال پیشین است، همان‌گونه که نشأة دنیا بر غیر مثال پیشین بود، و این همان قول اوست: «و قطعاً نشأة نخستین را دانستید، پس چرا متذکر نمی‌شوید؟» (وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى فَلَوْلَا تَذَكَّرُونَ) که آن بر غیر مثال بود، و به همین دلیل کلمه تحضیض (تشویق) را آورد.\n\n### [فتنه عمومی، عقوبت فراگیر و حدود درهم‌تنیده]\n\nاین فتنه عمومی، عقوبت فراگیر و حدود درهم‌تنیده از صفات قول اوست: «هر چه بخواهد انجام می‌دهد.» (فَعَّالٌ لِمَا يُرِيدُ) زیرا ظاهر آن مقتضی عدل نیست، اما باطن آن مقتضی فضل الهی است. در آخرت «هیچ باربرداری بار دیگری را بر نمی‌دارد.» (لَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى) اما در اینجا در عموم صورت عقوبت چنین نیست. با این حال، آنچه بر بی‌گناه می‌آید، عقوبت نیست، بلکه فتنه است؛ و بر ظالم عقوبت است، زیرا پس از ظلمش به او رسیده است. پس بی‌گناه مستوجب آن نیست، اما حکم دار (سرای دنیا) بر او جاری می‌شود، همان‌گونه که بر اهل دار کفر حکم می‌شود، هرچند در آن کسی باشد که مستحق آنچه کفار مستحق‌اند نباشد. خداوند متعال فرمود: «و به کسانی که ستم کرده‌اند متمایل نشوید که آتش شما را فرا می‌گیرد.» (وَلَا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ) و پیامبر (صلی الله علیه و سلم) مولای قوم را در حکم، از خودشان قرار داده است.\n\nدر حالی که او در نفس امر (حقیقت) از آنان نیست. خداوند ما را از کسانی قرار دهد که با فضل خود با آنان رفتار می‌کند و آنان را به واجب حقش مطالبه نمی‌کند.\n\n### [ظلم برگزیدگان از بندگان خدا]\n\nآنجا که خداوند در حق کسی که از بندگانش برگزیده است می‌فرماید که او «ستمکار بر خویشتن است» (ظَالِمٌ لِنَفْسِهِ)، زیرا امانت را بر دوش کشید. این همان ظلم برگزیدگان از بندگان خداست، نه ظلمی که از حدود الهی تجاوز کند. زیرا «هر کس از حدود خدا تجاوز کند، قطعاً به خویشتن ستم کرده است.» (وَمَنْ يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ) چون نفس را حدی است که باید نزد آن توقف کند و آن حد بر نفس واجب است، و آن حد عین عبودیت (بندگی) اوست. و حد خدا آن است که برای او باشد. پس اگر بنده وارد نعت ربوبیت (ربوبية) شود، که آن خداست، از حدود خدا تجاوز کرده است. و «کسانی که از حدود خدا تجاوز کنند، آنان همان ستمکارانند.» (فَأُولَئِكَ هُمُ الظَّالِمُونَ) زیرا حد هر شیء مانع می‌شود که آنچه از آن است از آن خارج شود و آنچه از آن نیست به آن وارد شود. اینها حدود ذاتی (الحدود الذاتية) هستند. پس کسانی که از آن پرهیز کنند، «آنان همان رستگارانند.» (فَأُولَئِكَ هُمُ الْمُفْلِحُونَ) «اینها حدود خداست، پس به آنها نزدیک نشوید. این‌گونه خداوند آیات خود را برای مردم بیان می‌کند، باشد که پرهیزکار شوند.» (تِلْكَ حُدُودُ اللَّهِ فَلَا تَقْرَبُوهَا كَذَلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ) پس آنان را به تقوا (تقوى) وصف کرد، اگر از آن تجاوز نکنند و آن را برای خود سپری قرار دهند.\n\n### [حدود ذاتی و رسمی خداوند]\n\nهیچ‌یک از حدود ذاتی (الحدود الذاتية) خداوند در اختیار ما نیست، و آنچه نزد ماست، تنها حدود رسمی (الحدود الرسمية) است. به همین دلیل بندگان بر آن جسارت ورزیدند و از آن تجاوز کردند و از همین رو عقوبت شدند. همان‌گونه که اگر حق (الحق)، صاحب حد، آنان را وارد چیزی کند که از آنِ اوست، به ظلم متصف نمی‌شود، پس مستوجب عقوبت نیست. اما چون حد، رسمی بود، بنده ورود به آن را پذیرفت. اگر خودسرانه و بدون وارد کردن صاحبش وارد آن شود، خود را در معرض عقوبت قرار داده است. پس صاحب حد در بهترین دو نظر است: اگر بخواهد عقوبت می‌کند، و اگر بخواهد عفو می‌کند، و اگر بخواهد ثنا می‌گوید، مانند کسی که به کرم و عفو و گذشت متصف است. و اینها همه حدود رسمی (حدود رسمية) برای حق (الحق) هستند.\n\n### [حدود لفظی خداوند]\n\nپس آنچه را که در این مسئله از علم غریب به تو تذکر دادم، بدان، زیرا آن از مغز معرفت (المعرفة) به خداست. اما حدود لفظی (حدود الله اللفظية) خداوند، هیچ چیزی را جز کلمه «الله» محدود نکرده است. و در کلمه «الرحمن» با الف و لام اختلاف کرده‌اند. همچنین هیچ‌کس به «الرحمن الرحیم» نامیده نشده است، به این صورت که از اسماء مرکب باشد، مانند بعلبک و رامهرمز و بلال‌آباد. و حمایت از این اسم نه از روی امر مشروع بود، بلکه حمایتی غیبی بود که خداوند مردم را از نام‌گذاری با این اسم مرکب غافل ساخت. و این مقدار از تقوای حدود کافی است."
  },
  "page_count": 2
}