{
  "id": 508,
  "title": {
    "ar": "الباب الثامن وخمسمائة في معرفة حال قطب كان منزله الله وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ من الظُّلُماتِ إِلَى النُّورِ",
    "en": "Chapter Five Hundred and Eight, concerning the knowledge of the state of a Pole (قطب) whose station was defined by the verse: <<الله وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ من الظُّلُماتِ إِلَى النُّورِ>> (Allah is the Protector of those who believe. He brings them out from the darknesses into the light).",
    "ur": "پانچ سو آٹھواں باب: اس قطب (Qutb) کے حال کی معرفت کے بیان میں جس کا مقام یہ ہے: \"اللہ ایمان والوں کا ولی ہے، وہ انہیں تاریکیوں سے نکال کر نور کی طرف لے جاتا ہے۔\" (سورۃ البقرہ ۲:۲۵۷)",
    "fa": "باب پانصد و هشتم در معرفت حال قطبی که منزلگاهش این سخن خداوند بود: «اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ» (خداوند سرپرست کسانی است که ایمان آوردند، آنان را از تاریکی‌ها به سوی نور بیرون می‌آورد)."
  },
  "content": {
    "ar": "## «الباب الثامن وخمسمائة في معرفة حال قطب كان منزله الله وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ من الظُّلُماتِ إِلَى النُّورِ»\n\n\n> لو لا الولاية كنت في الظلمات *** فاختصني الرحمن بالحركات‏\n\n\n> فخرجت منها أبتغي النور الذي *** جمعتني فيه وعين شتاتي‏\n\n\n> ورأيت محياي الذي أسعى له *** وعلمت شأني فيه بعد وفاتي‏\n\n\n> ورأيت في الإنسان كل فضيلة *** والعلم أكمل فيه في الدرجات‏\n\n\n> فضممت للإيمان علما بالذي *** كان الوجود به بغير صفات‏\n\n\n> وبدت لي الأسماء خلف حجابه *** فشهدتها بالكشف عين سماتي‏\n\n\n> إن العناية أشرقت أنوارها *** فسعيت في الأنوار طول حياتي‏\n\n\n> لو لا وجود النور في أبصارنا *** وقلوبنا لسعيت في الظلمات‏\n\n\n> فالله أكبر والكبير بدايتي *** ما دامت الدنيا وبعد مماتي‏\n\n\n> إن الخلافة لا يكون كمالها *** إلا هنا لا في الذي هو آتي‏\n\n\n> فيزول في الجنات نصف وجودها *** لا زالة الأحكام في الدركات‏\n\n\n> لما رأيت عموم رحمة ذاته *** في النشأة الأخرى ولم أر يأتي‏\n> أمر مزيل حكمها من خلقه *** فعلمت منه خلافتي بالذات‏\n\n\n> فأنا المبرز في كمال خلافتي *** عنه ويعلم ذاك كل موات‏\n\n\n### [المؤمن اسم لله تعالى وللإنسان‏]\n\n\nاعلم أيدنا الله وإياك بروح القدس أن الكشف المختص بهذا الذكر أن تطلع منه ذوقا على كون المؤمنين بَعْضُهُمْ أَوْلِياءُ بَعْضٍ والْمُؤْمِنُ اسم لله تعالى والمؤمن اسم للإنسان وقد عم في الولاية بين المؤمنين فهو ولي الذين آمنوا بإخراجه إياهم من الظلمات إلى النور وليس إلا إخراجهم من العلم بهم إلى العلم بالله‏\n\n\nفإنه يقول من عرف نفسه عرف ربه‏\n\n\nفيعلم أنه الحق فيخرج العارف المؤمن الحق بولايته التي أعطاه الله من ظلمة الغيب إلى نور الشهود فيشهد ما كان غيبا له فيعطيه كونه مشهودا ولم يكن له هذا الحكم من هذا الشخص قبل هذا فهذا للعبد تول بهذا القدر من كون الحق له اسم المؤمن كما تولى الحق عبده من كونه مؤمنا وكون الشخص مؤمنا سببا في إخراجه من الظلمات إلى النور وذلك نصرته المؤمنين من عباده فالمؤمن للمؤمن كالبنيان المرصوص يشد بعضه بعضا وهذا من باب الإشارة إلى حكم الأسماء فيشد منا ونشد منه قال تعالى إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ من حيث هو المؤمن ونحن المؤمنون‏\n\n\n> فلنا منه التولي *** وله مني ذلك‏\n\n\n> وإذا لم يكن الأمر *** كذا فالكل هالك‏\n\n\n> أنا مال الله فاحفظ *** يا إلهي عين مالك‏\n\n\n> فأنا حفظت فقري *** وهو مالي من هنالك‏\n\n\nما في قوله مالي هو بمعنى الذي‏\n\n\n### [أن ظلمة الإمكان عين الجهل المحض‏]\n\n\nفاعلم يا ولي أن ظلمة الإمكان أشد الظلمات فإنها عين الجهل المحض فإذا تولى الله عبده أخرجه من ظلمة هذا الجهل الذي هو الإمكان وليس إلا نظره لنفسه معرى عن نظره للذي تولاه فيخرجه بهذا التولي من ظلمة إمكانه إلى نور وجوب وجوده به وهو المنعوت بالواجب فأخرجه منه لنفسه وفرق بين الوجوب الذي حكمه لله وبين حكم الوجوب الذي لنا بالتقيد به فوجوبه تعالى لنفسه ووجوبنا به‏\n\n\n> فاشتركنا في الوجوب *** وافترقنا في القيود\n\n\n> ثم حزنا بالوجود *** ما لنا من الحدود\n\n\n> حين حزنا بالوجود *** ما لنا من الحدود\n\n\n> فنسميه إلها *** واختصصنا بالعبيد\n\n\n> فهو لي أشرف وسم *** وأنا منه بعيد\n\n\n> ومشى بذاك أمري *** في قريب وبعيد\n\n\n> فأنا أحمد ربي *** حين أدعي بالحميد\n\n\n> وعلمنا ذاك حقا *** في مغيب وشهود\n\n\n> ثم لو جحدت هذا *** ما تمشي لي جحودي‏\n\n\n> ولذا أنزلت بدري *** بمنازل السعود\n\n\n> ورأيت عين ذاتي *** في هبوط وصعود\n\n\n> فأنا من أجل هذا *** أتسمي بالسعيد\n\n\n> فإنا إن كنت شيخا *** عقلنا عقل الوليد\n\n\n### [ولاية الرب وولاية العبد]\n\n\nفولاية العبد ربه وولاية الرب عبده في قوله إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ وبين الولايتين فرق دقيق فجعل تعالى نصره جزاء وجعل مرتبة الإنشاء إليك كما قدمك في العلم بك على العلم به وذلك لتعلم من أين علمك فتعلم علمه بك كيف كان لأنه قال ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ وقد ذكرنا في كتاب المشاهد القدسية أنه قال لي أنت الأصل وأنا الفرع على وجوه منها علمه بنا منا لا منه فانظر فإن هنا سرا غامضا جدا وهو عند أكثر النظار منه لا منا أوقعهم في ذلك حدوثنا والكشف يعطي ما ذكرناه وهو الحق الذي لا يسعنا جهله ولما سألني عن هذه اللفظة مفتي الحجاز أبو عبد الله محمد بن أبي الصيف اليمني نزيل مكة ذكرت له أن علمنا به فرع عن علمنا بنا إذ نحن عين الدليل‏\n\n\nيقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nكما إن وجودنا فرع عنه ووجوده أصل فهو أصل في وجودنا فرع في علمنا به وهو من مدلول هذه اللفظة فسر بذلك وابتهج رحمه الله وهذا الوجه الآخر من مدلولها أيضا وهو أعلى ولكن ما ذكرناه له رحمه الله في ذلك المجلس لأنه ما يحتمله ولا يقدر أن ينكره وما ثم ذلك الايمان القوي عنده ولا العلم ولا النظر السليم فكان يحار فأبرزنا له من الوجوه ما يلائم مزاج عقله وهو صحيح فإنه ما ثم وجه إلا وهو صحيح في الحق وليس الفضل إلا العثور على ذلك فالله ولي المؤمن والمؤمن ولي الله‏\n\n\nسئل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فقيل له من أولياء الله فقال صَلَّى اللهُ عَليهِ وسَلَّم الذين إذا رأوا ذكر الله‏\n\n\nفذكر وعلم وشهد برؤيتنا إياهم فجعلهم أولياء الله كما جاء عن الله أنه وَلِيُّ الَّذِينَ آمَنُوا\nفالمؤمن من أعطى الأمان في الحق أن منه يضيف إليه ما لا يستحق جلاله أن يوصف به مما ذكر تعالى أن ذلك ليس له بصفة كالذلة والافتقار وهذه أرفع الدرجات أن نصف العبد بأنه مؤمن فإن المؤمن أيضا من يعطي الأمان نفوس العالم بإيصال حقوقهم إليهم فهم في أمان منه من تعديه فيها ومتى لم يكن كذا فليس بمؤمن فالولاية مشتركة بين الله وبين المؤمنين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 508: On Knowing the State of a Pole (قطب) whose Station is: \"Allah is the Protector (ولي) of those who believe. He brings them out of the depths of darkness (الظلمات) into the light (النور).\"\n\nHad it not been for the Guardianship (الولاية), I would have been in the darknesses,\nBut the All-Merciful singled me out with the movements.\n\nSo I emerged from them, seeking the Light\nIn which You gathered me and the essence of my dispersion.\n\nAnd I saw my countenance for which I strive,\nAnd I knew my affair therein after my death.\n\nAnd I saw in the Human every virtue,\nAnd Knowledge (العلم) is perfected therein in degrees.\n\nSo I joined to faith a knowledge of that\nBy which Existence (الوجود) was, without Attributes (صفات).\n\nAnd the Names (الأسماء) appeared to me behind His veil,\nSo I witnessed them through Unveiling (الكشف), the very essence of my traits.\n\nIndeed, Divine Care (العناية) shone forth its lights,\nSo I strove within the lights throughout my life.\n\nHad it not been for the existence of Light (النور) in our eyes\nAnd in our hearts, I would have striven in the darknesses.\n\nAllah is Greater (أكبر), and the Great One (الكبير) is my beginning,\nAs long as the world endures, and after my death.\n\nIndeed, the Vicegerency (الخلافة) is not perfected\nExcept here, not in that which is coming (the Hereafter).\n\nFor half of its existence vanishes in the Gardens (Jannat),\nNot the removal of rulings in the lower degrees.\n\nWhen I saw the universality of the Mercy of His Essence (رحمة ذاته)\nIn the Other Creation (النشأة الأخرى), and I did not see coming—\n\nAn order removing its ruling from His creation,\nI knew from Him my Vicegerency (خلافتي) by the Essence (بالذات).\n\nSo I am the one manifested in the perfection of my Vicegerency\nFrom Him, and every dead thing knows that.\n\n***\n\n### [The Believer (المؤمن) is a Name for Allah the Exalted and for the Human]\n\nKnow—may Allah support us and you with the Holy Spirit—that the Unveiling (الكشف) specific to this mention is that you attain a taste (ذوقا) of the reality that the believers are <<SOME OF THEM ARE PROTECTORS (أَوْلِياءُ) OF OTHERS>> (Q 9:71). The Believer (المؤمن) is a Name (اسم) for Allah the Exalted, and the Believer is a name for the human. He has made Guardianship (الولاية) universal among the believers, for He is the Protector (ولي) of those who believe by bringing them out of the darknesses (الظلمات) into the Light (النور). This is nothing other than bringing them out of the knowledge of themselves into the Knowledge of Allah.\n\nFor He says: \"Whoever knows his self knows his Lord.\"\n\nThus, he knows that He is the Real (الحق). So, the Gnostic (العارف), the believing Real, brings him out, through the Guardianship (ولايته) that Allah granted him, from the darkness of the Unseen (الغيب) into the Light of Witnessing (نور الشهود). He witnesses what was unseen to him, and this grants him the state of being witnessed. This ruling was not possessed by this person before this. This is a turning (تول) toward the servant to this extent, due to the Real having the Name al-Mu'min (The Believer), just as the Real turns toward His servant because the servant is a believer. The servant being a believer is a cause for his being brought out of the darknesses into the Light. This is His support (نصرته) for the believers among His servants. The believer is to the believer like a solid structure, one part strengthening the other. This is an allusion to the ruling of the Names (الأسماء): He strengthens us, and we strengthen Him. Allah the Exalted says: <<IF YOU SUPPORT ALLAH, HE WILL SUPPORT YOU>> (Q 47:7), in the sense that He is the Believer (المؤمن) and we are the believers.\n\nFor us is the turning (التولي) from Him,\nAnd for Him is that from me.\n\nAnd if the matter were not\nThus, then all would perish.\n\nI am the property of Allah, so guard,\nO my God, the essence of Your property.\n\nFor I guarded my poverty (فقري),\nAnd that is my wealth from that place.\n\nThe word *mālī* (my wealth) in his saying is in the sense of *alladhī* (that which).\n\n***\n\n### [That the Darkness of Contingency is the Essence of Pure Ignorance]\n\nKnow, O Protector (ولي), that the darkness of contingency (ظلمة الإمكان) is the most intense of darknesses, for it is the very essence of pure ignorance (الجهل المحض). When Allah takes charge of His servant, He brings him out of the darkness of this ignorance, which is contingency (الإمكان). This darkness is nothing but the servant’s contemplation of himself, stripped of his contemplation of the One who takes charge of him. Through this taking charge (التولي), He brings him out of the darkness of his contingency into the Light of the necessity of His Being (وجوب وجوده) through him—He who is described as the Necessary (الواجب). Thus, He brings him out of it for Himself. And there is a distinction between the necessity (الوجوب) whose ruling belongs to Allah, and the ruling of necessity that belongs to us through being restricted by Him. His necessity, the Exalted, is for His Essence (لنفسه), and our necessity is through Him (به).\n\nSo we share in Necessity (الوجوب),\nBut we differ in the restrictions (القيود).\n\nThen we attained through Existence (الوجود)\nWhat we possess of limits (الحدود).\n\nWhen we attained through Existence\nWhat we possess of limits.\n\nSo we name Him God (إلها),\nAnd we are singled out as servants (العبيد).\n\nHe is for me the noblest mark,\nYet I am far from Him.\n\nAnd by that, my affair proceeds\nIn the near and the far.\n\nSo I praise my Lord (أحمد ربي)\nWhen I am called the Praised One (الحميد).\n\nAnd we know that truly\nIn the Unseen (مغيب) and in Witnessing (شهود).\n\nThen, even if I denied this,\nMy denial would not proceed for me.\n\nAnd for this, I caused my full moon to descend\nInto the stations of felicity.\n\nAnd I saw the essence of my Essence (عين ذاتي)\nIn descent and ascent.\n\nSo I, for the sake of this,\nAm named the Fortunate One (السعيد).\n\nFor indeed, though I am a Shaykh,\nOur intellect is the intellect of the newborn.\n\n***\n\n### [The Guardianship of the Lord and the Guardianship of the Servant]\n\nThe Guardianship (ولاية) of the servant toward his Lord and the Guardianship of the Lord toward His servant are found in His saying: <<IF YOU SUPPORT ALLAH, HE WILL SUPPORT YOU>> (Q 47:7). There is a subtle difference (فرق دقيق) between the two Guardianships. The Exalted made His support a reward, and He made the rank of origination (الإنشاء) belong to you, just as He prioritized your knowledge of yourself over your knowledge of Him. This is so that you may know the source of your knowledge, and thus know how His Knowledge of you came to be, because He said: <<AND WE WILL SURELY TEST YOU UNTIL WE KNOW>> (Q 47:31). We have mentioned in the book *Al-Mashahid al-Qudsiyya* (The Holy Witnesses) that He said to me: \"You are the Origin (الأصل) and I am the Branch (الفرع),\" based on several aspects, among them being His Knowledge of us derived from us, not from Him.\n\nLook closely, for here is a very profound secret (سرا غامضا جدا). Most speculative thinkers (النظار) hold that it is from Him, not from us; our createdness (حدوثنا) led them to this conclusion. However, Unveiling (الكشف) grants what we have mentioned, and that is the Real (الحق) which we cannot afford to ignore. When the Mufti of the Hijaz, Abu Abd Allah Muhammad ibn Abi al-Sayf al-Yamani, resident of Mecca, asked me about this phrase, I mentioned to him that our knowledge of Him is a branch (فرع) of our knowledge of ourselves, since we are the very essence of the proof (عين الدليل).\n\nThe Messenger of Allah, peace and blessings be upon him, says: \"Whoever knows his self knows his Lord.\"\n\nJust as our existence (وجودنا) is a branch of Him and His Existence is the Origin (أصل), so He is the Origin in our existence, but the Branch in our knowledge of Him. This is part of the meaning of that phrase. He was pleased and delighted by that, may Allah have mercy on him. This is also the other aspect of its meaning, and it is higher, but we did not mention it to him, may Allah have mercy on him, in that gathering, because he could not bear it nor could he deny it. He did not possess that strong faith, nor the knowledge, nor the sound speculation (النظر السليم), so he would have been bewildered. Thus, we presented to him aspects that suited the temperament of his intellect, and it is correct, for there is no aspect that is not correct in the Real (الحق). The merit lies only in discovering that.\n\nSo Allah is the Protector (ولي) of the believer, and the believer is the protector (ولي) of Allah.\n\nThe Messenger of Allah, peace and blessings be upon him, was asked, \"Who are the Protectors (أولياء) of Allah?\" He replied, peace and blessings be upon him: \"Those who, when they are seen, Allah is remembered.\"\n\nThus, He remembered, knew, and witnessed through our seeing them, and He made them the Protectors of Allah, just as it came from Allah that He is <<THE PROTECTOR (وَلِيُّ) OF THOSE WHO BELIEVE>> (Q 2:257). The Believer (المؤمن) is he who grants security (الأمان) in the Real (الحق) that from Him, one attributes to Him what His Majesty does not deserve to be described with, such as what the Exalted mentioned is not an Attribute (صفة) for Him, like lowliness (الذلة) and need (الافتقار). This is the highest of degrees: that we describe the servant as a believer. For the believer is also he who grants security to the souls of the world by delivering their rights to them. They are safe from his transgression against those rights. If he is not thus, then he is not a believer. Thus, Guardianship (الولاية) is shared between Allah and the believers. And <<ALLAH SPEAKS THE TRUTH AND HE GUIDES TO THE WAY>> (Q 33:4).",
    "ur": "باب نمبر پانچ سو آٹھ قطب کے حال کی معرفت میں جس کی منزل اللہ کا یہ قول تھا: \"اللہ ان لوگوں کا ولی ہے جو ایمان لائے، وہ انہیں تاریکیوں سے نکال کر نور کی طرف لے جاتا ہے۔\" (وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ من الظُّلُماتِ إِلَى النُّورِ)\n\nاگر ولایت (الولایۃ) نہ ہوتی تو میں تاریکیوں میں ہوتا،\nپس رحمن نے مجھے حرکات کے ساتھ خاص کر دیا۔\n\nتو میں ان سے نکل آیا، اس نور کی تلاش میں جو\nمجھے اس میں جمع کرتا ہے اور میری پراگندگی کی اصل ہے۔\n\nاور میں نے اپنی زندگی کو دیکھا جس کے لیے میں کوشاں ہوں،\nاور اپنی وفات کے بعد اس میں اپنی شان کو جان لیا۔\n\nاور میں نے انسان میں ہر فضیلت دیکھی،\nاور علم اس میں درجات کے لحاظ سے کامل ہے۔\n\nپس میں نے ایمان کے ساتھ اس ذات کا علم شامل کر لیا\nجس کے ذریعے ہستی (الوجود) صفات کے بغیر تھی۔\n\nاور اس کے حجاب کے پیچھے میرے لیے اسماء ظاہر ہوئے،\nپس میں نے انہیں کشف (الکشف) کے ذریعے اپنی صفات کی اصل کے طور پر مشاہدہ (الشہود) کیا۔\n\nبے شک عنایت کے انوار چمک اٹھے،\nپس میں اپنی پوری زندگی ان انوار میں کوشاں رہا۔\n\nاگر ہماری آنکھوں اور ہمارے دلوں میں نور کا وجود نہ ہوتا،\nتو میں تاریکیوں میں بھٹکتا رہتا۔\n\nپس اللہ سب سے بڑا ہے، اور وہ کبیر میری ابتدا ہے،\nجب تک دنیا باقی ہے اور میری موت کے بعد بھی۔\n\nبے شک خلافت کا کمال صرف یہیں ہوتا ہے،\nنہ کہ اس میں جو آنے والا ہے۔\n\nپس جنتوں میں اس کا نصف وجود زائل ہو جائے گا،\nنہ کہ درکات (جہنم کے درجات) میں احکام کا زائل ہونا۔\n\nجب میں نے دوسری نشأت (آخرت) میں اس کی ذات کی رحمت کا عموم دیکھا،\nاور میں نے یہ نہیں دیکھا کہ کوئی ایسا حکم آئے\n\nجو اس کے حکم کو اس کی مخلوق سے زائل کر دے،\nتو میں نے اس سے اپنی خلافت کو بالذات جان لیا۔\n\nپس میں ہی اپنی خلافت کے کمال میں اس کی طرف سے ظاہر کیا گیا ہوں،\nاور یہ بات ہر مردہ جانتا ہے۔\n\n### [المؤمن (مومن) اللہ تعالیٰ اور انسان کا نام ہے]\n\nجان لو، اللہ روح القدس کے ذریعے ہماری اور تمہاری تائید کرے، کہ اس ذکر سے متعلق کشف (الکشف) یہ ہے کہ تم ذوق کے ذریعے اس حقیقت پر مطلع ہو جاؤ کہ مومن (المؤمنین) \"آپس میں ایک دوسرے کے دوست ہیں\" (بَعْضُهُمْ أَوْلِياءُ بَعْضٍ)۔ اور المؤمن (المؤمن) اللہ تعالیٰ کا نام ہے اور المؤمن انسان کا بھی نام ہے۔ اور ولایت (الولایۃ) مومنوں کے درمیان عام ہو چکی ہے، پس وہ ان لوگوں کا ولی ہے جو ایمان لائے، انہیں تاریکیوں سے نور کی طرف نکالنے کے ذریعے، اور یہ صرف انہیں ان کے اپنے علم سے نکال کر اللہ کے علم کی طرف لے جانا ہے۔\n\nکیونکہ وہ فرماتا ہے: \"جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا۔\" (من عرف نفسه عرف ربه)\n\nپس وہ جانتا ہے کہ وہ (اللہ) الحق (ذات حق) ہے۔ تو عارف مومن کو اللہ کی عطا کردہ ولایت (الولایۃ) کے ذریعے غیب کی تاریکی سے شہود (الشہود) کے نور کی طرف نکالتا ہے، پس وہ اس چیز کا مشاہدہ (الشہود) کرتا ہے جو اس کے لیے غیب تھی، تو اسے مشہود ہونے کا حکم عطا کرتا ہے۔ اور اس شخص کے لیے یہ حکم اس سے پہلے نہیں تھا۔ پس یہ بندے کے لیے اس قدر تولّی (دوستی) ہے کہ الحق (ذات حق) کے لیے المؤمن کا نام ہے، جیسا کہ الحق (ذات حق) نے اپنے بندے کی تولّی کی اس کے مومن ہونے کی وجہ سے۔ اور شخص کا مومن ہونا اسے تاریکیوں سے نور کی طرف نکالنے کا سبب ہے، اور یہ اس کے مومن بندوں کی مدد ہے۔ پس مومن مومن کے لیے سیسہ پلائی ہوئی دیوار کی طرح ہے، جو ایک دوسرے کو مضبوط کرتا ہے۔ اور یہ اسماء (الأسماء) کے حکم کی طرف اشارہ ہے، کہ وہ ہم سے مضبوط ہوتا ہے اور ہم اس سے مضبوط ہوتے ہیں۔ اللہ تعالیٰ فرماتا ہے: \"اگر تم اللہ کی مدد کرو گے تو وہ تمہاری مدد کرے گا\" (إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ)۔ یہ اس حیثیت سے ہے کہ وہ المؤمن ہے اور ہم المؤمنون ہیں۔\n\nپس ہمارے لیے اس کی طرف سے تولّی ہے،\nاور اس کے لیے میری طرف سے وہ (تولّی) ہے۔\n\nاور اگر معاملہ ایسا نہ ہو،\nتو سب ہلاک ہونے والے ہیں۔\n\nمیں اللہ کا مال ہوں، پس اے میرے معبود!\nاپنے مال کی اصل کی حفاظت فرما۔\n\nپس میں نے اپنی فقر (محتاجی) کی حفاظت کی،\nاور وہیں سے میرا مال ہے۔\n\nاس کے قول \"مالی\" (میرا مال) میں \"ما\" کا معنی \"الذی\" (جو) کے معنی میں ہے۔\n\n### [امکان کی تاریکی ہی محض جہل ہے]\n\nپس اے ولی! جان لو کہ امکان (الإمکان) کی تاریکی سب سے شدید تاریکی ہے، کیونکہ یہ محض جہل (الجہل المحض) کی اصل ہے۔ پس جب اللہ اپنے بندے کی تولّی کرتا ہے، تو اسے اس جہل کی تاریکی سے نکالتا ہے جو کہ امکان (الإمکان) ہے۔ اور یہ صرف اس کا اپنے نفس کی طرف دیکھنا ہے جو اس ذات کی طرف نظر سے خالی ہے جس نے اس کی تولّی کی۔ پس وہ اس تولّی کے ذریعے اسے اس کے امکان کی تاریکی سے اس کے ذریعے اس کے وجوب وجود (وجوب الوجود) کے نور کی طرف نکالتا ہے، اور وہ الواجب (واجب الوجود) کے نام سے موصوف ہے۔ پس اس نے اسے اس سے اپنے لیے نکالا۔ اور اس وجوب (الوجود) کے حکم میں فرق ہے جو اللہ کے لیے ہے، اور اس وجوب کے حکم میں جو ہمارے لیے اس کے ساتھ مقید ہونے کی وجہ سے ہے۔ پس اللہ تعالیٰ کا وجوب اس کی اپنی ذات کے لیے ہے، اور ہمارا وجوب اس کے ذریعے ہے۔\n\nپس ہم وجوب (الوجود) میں شریک ہوئے،\nاور قیود (پابندیوں) میں جدا ہو گئے۔\n\nپھر ہم نے وجود (الوجود) کے ذریعے وہ حاصل کیا\nجو ہماری حدود (الحدود) میں ہے۔\n\nجب ہم نے وجود (الوجود) کے ذریعے وہ حاصل کیا\nجو ہماری حدود میں ہے۔\n\nپس ہم اسے معبود (إلها) کہتے ہیں،\nاور ہم بندوں (العبید) کے ساتھ خاص ہو گئے۔\n\nپس وہ میرے لیے سب سے معزز نشان ہے،\nاور میں اس سے دور ہوں۔\n\nاور اسی کے ذریعے میرا معاملہ\nقریب اور دور میں چلتا ہے۔\n\nپس میں اپنے رب کی حمد کرتا ہوں،\nجب مجھے الحمید (تعریف کیا گیا) کہہ کر پکارا جاتا ہے۔\n\nاور ہم نے اس کو حق کے طور پر\nغیب اور شہود (الشہود) میں جانا۔\n\nپھر اگر میں اس کا انکار کروں،\nتو میرا انکار میرے لیے کارآمد نہیں ہو گا۔\n\nاور اسی لیے میں نے اپنے بدر (چاند) کو\nسعد (نیک) منازل میں اتارا۔\n\nاور میں نے اپنی ذات کی اصل کو\nنزول اور عروج میں دیکھا۔\n\nپس میں اسی وجہ سے\nالسعید (خوش بخت) کہلاتا ہوں۔\n\nپس اگرچہ میں شیخ ہوں،\nلیکن ہماری عقل بچے کی عقل ہے۔\n\n### [رب کی ولایت اور بندے کی ولایت]\n\nپس بندے کی ولایت (الولایۃ) اپنے رب کے لیے اور رب کی ولایت اپنے بندے کے لیے اس کے قول میں ہے: \"اگر تم اللہ کی مدد کرو گے تو وہ تمہاری مدد کرے گا\" (إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ)۔ اور دونوں ولایتوں کے درمیان ایک باریک فرق ہے۔ اللہ تعالیٰ نے اپنی مدد کو جزا بنایا، اور ابتداء (الإنشاء) کا مرتبہ تمہاری طرف کر دیا، جیسا کہ اس نے تمہیں اپنے علم پر تمہارے علم میں مقدم کیا۔ اور یہ اس لیے ہے تاکہ تم جانو کہ تمہارا علم کہاں سے آیا، اور تم جانو کہ اس کا علم تمہارے بارے میں کیسا تھا، کیونکہ اس نے فرمایا: \"اور ہم تمہیں ضرور آزمائیں گے تاکہ ہم جان لیں\" (وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ)۔ اور ہم نے کتاب المشاہد القدسیہ میں ذکر کیا ہے کہ اس نے مجھ سے کہا: \"تم اصل ہو اور میں فرع ہوں،\" اس کی کئی وجوہات ہیں، جن میں سے ایک یہ ہے کہ اس کا علم ہمارے بارے میں ہم سے ہے نہ کہ اس سے۔ پس غور کرو، کیونکہ یہاں ایک بہت ہی گہرا راز ہے، اور اکثر اہل نظر کے نزدیک یہ اس کی طرف سے ہے نہ کہ ہماری طرف سے، اور ہمارے حادث ہونے نے انہیں اس غلط فہمی میں ڈالا۔ جبکہ کشف (الکشف) وہی دیتا ہے جو ہم نے ذکر کیا، اور یہی وہ الحق (ذات حق) ہے جس سے ہم ناواقف نہیں رہ سکتے۔ اور جب مفتی حجاز ابو عبد اللہ محمد بن ابی الصیف یمنی، جو مکہ کے رہائشی تھے، نے مجھ سے اس لفظ کے بارے میں پوچھا، تو میں نے انہیں بتایا کہ ہمارا علم اس کے بارے میں ہمارے اپنے علم کی فرع ہے، کیونکہ ہم ہی دلیل کی اصل ہیں۔\n\nرسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: \"جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا۔\" (من عرف نفسه عرف ربه)\n\nجیسا کہ ہمارا وجود اس کی فرع ہے اور اس کا وجود اصل ہے۔ پس وہ ہمارے وجود میں اصل ہے، اور اس کے بارے میں ہمارے علم میں فرع ہے، اور یہی اس لفظ کے مدلول میں سے ہے۔ پس وہ (مفتی) اس سے خوش ہوئے اور مسرور ہوئے، اللہ ان پر رحم فرمائے۔ اور اس کے مدلول کا یہ دوسرا پہلو بھی ہے، جو کہ اعلیٰ ہے، لیکن ہم نے اس مجلس میں ان کے لیے وہی ذکر کیا، کیونکہ وہ اسے برداشت نہیں کر سکتے تھے اور نہ ہی اس کا انکار کر سکتے تھے۔ اور ان کے پاس وہ قوی ایمان، علم، اور سلیم نظر نہیں تھی، لہٰذا وہ حیران ہو جاتے تھے۔ پس ہم نے ان کے سامنے وہ پہلو ظاہر کیے جو ان کی عقلی مزاج کے مطابق تھے، اور وہ صحیح بھی ہیں، کیونکہ الحق (ذات حق) میں کوئی پہلو ایسا نہیں جو صحیح نہ ہو۔ اور فضیلت صرف اس کو پا لینے میں ہے۔ پس اللہ مومن کا ولی ہے اور مومن اللہ کا ولی ہے۔\n\nرسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا، تو عرض کیا گیا: \"اللہ کے اولیاء کون ہیں؟\" تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"وہ لوگ جنہیں دیکھ کر اللہ یاد آ جائے۔\" (الذين إذا رأوا ذكر الله)\n\nپس اس نے ہمارے ان کو دیکھنے سے ذکر کیا، جانا اور مشاہدہ (الشہود) کیا، تو انہیں اللہ کا ولی بنا دیا، جیسا کہ اللہ کی طرف سے آیا ہے کہ وہ \"ان لوگوں کا ولی ہے جو ایمان لائے\" (وَلِيُّ الَّذِينَ آمَنُوا)۔ پس مومن (المؤمن) وہ ہے جو الحق (ذات حق) میں امان دیتا ہے کہ اس کی طرف سے اس کی طرف وہ چیزیں منسوب کی جائیں جن سے اس کی جلالت موصوف ہونے کی مستحق نہیں، ان چیزوں میں سے جنہیں اللہ تعالیٰ نے ذکر کیا کہ وہ اس کی صفت نہیں ہیں، جیسے ذلت اور محتاجی (الافتقار)۔ اور یہ سب سے بلند درجات میں سے ہے کہ ہم بندے کو مومن ہونے کی صفت سے موصوف کریں۔ کیونکہ مومن وہ بھی ہے جو عالم کے نفوس کو ان کے حقوق ان تک پہنچا کر امان دیتا ہے، پس وہ ان حقوق میں اس کی زیادتی سے امان میں ہوتے ہیں۔ اور جب ایسا نہ ہو تو وہ مومن نہیں ہے۔ پس ولایت (الولایۃ) اللہ اور مومنوں کے درمیان مشترک ہے، اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و هشتم در معرفت حال قطبی که منزلگاهش این سخن خداوند بود: «خداوند ولیّ کسانی است که ایمان آورده‌اند، آنان را از ظلمات (تاریکی‌ها) به سوی نور بیرون می‌آورد.»\n\nاگر ولایت (الولایة) نبود، در ظلمات (تاریکی‌ها) می‌ماندم؛\nپس خداوند رحمان مرا به حرکات (سلوک) اختصاص داد.\n\nپس از آن ظلمات بیرون آمدم و نوری را طلب کردم\nکه مرا در آن جمع کردی و عین پریشانی‌ام بود.\n\nو چهره‌ای را که برایش تلاش می‌کردم دیدم،\nو شأن خود را در آن پس از مرگ دانستم.\n\nو در انسان هر فضیلتی را دیدم،\nو علم در درجات آن کامل‌تر است.\n\nپس به ایمان، علمی را ضمیمه کردم به آن حقیقتی\nکه هستی (الوجود) به واسطه او بود، بدون صفات.\n\nو اسماء (الهی) از پس حجابش بر من آشکار شد،\nپس آن‌ها را به واسطه کشف (الکشف)، عین نشانه‌های خود شهود (الشهود) کردم.\n\nهمانا عنایت، انوارش را تاباند،\nپس در طول زندگی‌ام در آن انوار کوشیدم.\n\nاگر وجود نور در دیدگان و قلب‌های ما نبود،\nدر ظلمات (تاریکی‌ها) تلاش می‌کردم.\n\nپس الله اکبر است و کبیر آغاز من است،\nتا زمانی که دنیا باقی است و پس از مرگم.\n\nهمانا کمال خلافت جز در اینجا (دنیا) نیست،\nنه در آنچه که خواهد آمد (آخرت).\n\nزیرا در بهشت‌ها نیمی از وجود آن (خلافت) زائل می‌شود،\nنه زوال احکام در درکات (پایین‌ترین درجات).\n\nهنگامی که عموم رحمت ذات او را در نشأت دیگر دیدم\nو ندیدم که امری بیاید که حکم آن (رحمت) را از خلقش زائل کند،\nپس خلافت خود را بالذات از او دانستم.\n\nپس منم که در کمال خلافتم از جانب او آشکار شده‌ام،\nو هر مرده‌ای (هر آنچه فاقد حیات است) این را می‌داند.\n\n### [المؤمن (المؤمن) نامی برای خداوند متعال و برای انسان است]\n\nبدان، خداوند ما و تو را به روح القدس تأیید کند، که کشف (الکشف) مختص به این ذکر آن است که از آن، ذوقاً بر این حقیقت آگاه شوی که مؤمنان بَعْضُهُمْ أَوْلِياءُ بَعْضٍ (برخی از آنان ولیّ برخی دیگرند). و «المؤمن (المؤمن)» نامی برای خداوند متعال است و «المؤمن (المؤمن)» نامی برای انسان است. و خداوند ولایت (الولایة) را میان مؤمنان عمومیت بخشیده است، پس او ولیّ کسانی است که ایمان آورده‌اند، به واسطه بیرون آوردن آنان از ظلمات (الظلمات) به سوی نور (النور). و این بیرون آوردن چیزی نیست جز خارج کردن آنان از علم به خودشان به سوی علم به خداوند.\n\nزیرا او می‌فرماید: «هر کس خود را شناخت، پروردگارش را شناخت.»\n\nپس می‌داند که او حق (الحق) است. در نتیجه، عارف مؤمن را به واسطه ولایتش (الولایة) که خداوند به او عطا کرده است، از ظلمت غیب به نور شهود (الشهود) بیرون می‌آورد. پس آنچه برای او غیب بود، شهود می‌کند. و خداوند به او این حکم را می‌دهد که مشهود باشد، در حالی که این شخص پیش از این، چنین حکمی نداشت. پس این تولّی (ولایت) به این مقدار برای بنده است، از آن جهت که حق (الحق) نام «المؤمن (المؤمن)» را دارد، همان‌گونه که حق (الحق) بنده خود را از آن جهت که مؤمن است، تولّی کرده است. و مؤمن بودن شخص، سببی است در بیرون آمدن او از ظلمات (تاریکی‌ها) به سوی نور، و آن، یاری رساندن خداوند به بندگان مؤمنش است. پس مؤمن برای مؤمن مانند بنای محکمی است که اجزای آن یکدیگر را محکم می‌کنند. و این از باب اشاره به حکم اسماء (الهی) است؛ او ما را محکم می‌کند و ما او را محکم می‌کنیم. خداوند متعال می‌فرماید: إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ (اگر خدا را یاری کنید، شما را یاری می‌کند) از آن جهت که او «المؤمن (المؤمن)» است و ما نیز مؤمنان هستیم.\n\nپس تولّی (ولایت) از او برای ماست،\nو آن (تولّی) از من برای اوست.\n\nو اگر امر چنین نباشد،\nپس همه هلاک شونده‌اند.\n\nمن مال خداوند هستم، پس ای خدای من،\nعین مال خود را حفظ کن.\n\nپس من فقر خود را حفظ کردم،\nو آن (فقر) مال من از آنجاست.\n\n«ما» در سخن او (مالی) به معنای «الذی» (آنچه) است.\n\n### [همانا ظلمت امکان (الإمكان)، عین جهل محض است]\n\nپس ای ولیّ (ولیّ)، بدان که ظلمت امکان (الإمكان) شدیدترین ظلمات (تاریکی‌ها) است، زیرا آن عین جهل محض است. پس هنگامی که خداوند بنده خود را تولّی کند، او را از ظلمت این جهل که همان امکان (الإمكان) است، بیرون می‌آورد. و این بیرون آوردن چیزی نیست جز اینکه بنده به خودش نظر کند در حالی که از نظر به کسی که او را تولّی کرده است، عاری باشد. پس خداوند او را به واسطه این تولّی از ظلمت امکانش (ممکن بودن) به سوی نور وجوب وجودش (وجوب الوجود) به واسطه او خارج می‌سازد، و او (خداوند) به واجب (الواجب) توصیف شده است. پس او را از خودش برای خودش خارج ساخت. و میان وجوبی که حکم آن برای خداوند است و حکم وجوبی که برای ماست، به واسطه مقید شدن به آن، تفاوت است. پس وجوب او (خداوند) برای ذات خودش است و وجوب ما به واسطه اوست.\n\nپس در وجوب (واجب بودن) شریک شدیم،\nو در قیود (محدودیت‌ها) جدا گشتیم.\n\nسپس به واسطه هستی (الوجود)،\nآنچه از حدود (محدودیت‌ها) برای ماست، به دست آوردیم.\n\nهنگامی که به واسطه هستی (الوجود)،\nآنچه از حدود (محدودیت‌ها) برای ماست، به دست آوردیم.\n\nپس او را «إله» می‌نامیم،\nو ما به «عبید» (بندگان) اختصاص یافتیم.\n\nپس او برای من شریف‌ترین نشان است،\nدر حالی که من از او دورم.\n\nو امر من به واسطه آن (نشان)\nدر نزدیک و دور جریان یافت.\n\nپس من پروردگارم را می‌ستایم،\nهنگامی که به «حمید» (ستوده) خوانده می‌شوم.\n\nو این را به حق در غیب و شهود (الشهود) دانستیم.\n\nسپس اگر این را انکار کنم،\nانکار من برایم کارساز نخواهد بود.\n\nو به همین دلیل، ماه کامل خود را\nدر منازل سعد (خوشبختی) فرود آوردم.\n\nو عین ذات خود را\nدر فرود و صعود دیدم.\n\nپس من به خاطر این،\n«سعید» (خوشبخت) نامیده می‌شوم.\n\nزیرا اگرچه من شیخم،\nعقل ما عقل کودک است.\n\n### [ولایت (الولایة) پروردگار و ولایت (الولایة) بنده]\n\nپس ولایت (الولایة) بنده، پروردگارش است و ولایت (الولایة) پروردگار، بنده اوست، در سخن خداوند: إِنْ تَنْصُرُوا الله يَنْصُرْكُمْ (اگر خدا را یاری کنید، شما را یاری می‌کند). و میان این دو ولایت (الولایة) فرق دقیقی وجود دارد. خداوند متعال یاری خود را پاداش قرار داد و مرتبه ایجاد (انشاء) را به تو واگذار کرد، همان‌گونه که در علم به تو، تو را بر علم به خودش مقدم داشت. و این برای آن است که بدانی علم تو از کجا آمده است، پس بدانی که علم او به تو چگونه بوده است، زیرا فرمود: وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ (و قطعاً شما را می‌آزماییم تا بدانیم). و ما در کتاب «المشاهد القدسیة» ذکر کرده‌ایم که خداوند به من فرمود: «تو اصل هستی و من فرع»، بر وجوهی که یکی از آن‌ها علم او به ماست که از جانب ماست نه از جانب او. پس بنگر، زیرا در اینجا رازی بسیار پنهان است، و آن راز نزد بیشتر اهل نظر این است که علم از جانب اوست نه از جانب ما. آنچه آنان را به این نتیجه رسانده، حدوث (مخلوق بودن) ماست، در حالی که کشف (الکشف) آنچه را که ما ذکر کردیم، می‌دهد و آن حق (الحق) است که جهل به آن برای ما جایز نیست. و هنگامی که مفتی حجاز، ابوعبدالله محمد بن ابی الصیف یمنی، مقیم مکه، از من درباره این عبارت سؤال کرد، به او گفتم که علم ما به او فرع بر علم ما به خودمان است، زیرا ما عین دلیل هستیم.\n\nرسول خدا (صلی الله علیه و آله و سلم) می‌فرماید: «هر کس خود را شناخت، پروردگارش را شناخت.»\n\nهمان‌گونه که وجود ما فرع بر اوست و وجود او اصل است. پس او در وجود ما اصل است و در علم ما به او فرع است، و این از مدلول‌های این عبارت است. پس او (مفتی) از این سخن شادمان شد و به وجد آمد، خداوند او را رحمت کند. و این وجه دیگر نیز از مدلول‌های آن است و بالاتر است، اما آنچه را که ما در آن مجلس برای او ذکر کردیم (وجه اول)، به این دلیل بود که او تحمل آن را نداشت و نمی‌توانست آن را انکار کند، و آن ایمان قوی و علم و نظر سلیم نزد او نبود، پس متحیر می‌شد. از این رو، ما وجوهی را برای او آشکار کردیم که با مزاج عقل او سازگار بود، و آن وجه صحیح است، زیرا هیچ وجهی نیست مگر اینکه در حق (الحق) صحیح است، و فضیلت تنها در یافتن آن است. پس خداوند ولیّ مؤمن است و مؤمن ولیّ خداوند است.\n\nاز رسول خدا (صلی الله علیه و آله و سلم) سؤال شد و گفته شد: اولیاء الله چه کسانی هستند؟ فرمود: «کسانی که چون دیده شوند، خدا یاد شود.»\n\nپس به واسطه دیدن ما، ذکر و علم و شهود (الشهود) حاصل می‌شود. پس خداوند آنان را اولیاء الله قرار داد، همان‌گونه که از جانب خداوند آمده است که او وَلِيُّ الَّذِينَ آمَنُوا (ولیّ کسانی است که ایمان آورده‌اند).\n\nپس مؤمن کسی است که در حق (الحق) امان می‌دهد که خداوند چیزی را به او نسبت دهد که جلالش شایسته توصیف به آن نیست، از جمله آنچه خداوند متعال ذکر کرده که صفت او نیست، مانند ذلت و افتقار. و این بالاترین درجات است که بنده را به مؤمن بودن توصیف کنیم. زیرا مؤمن همچنین کسی است که به نفوس عالَم امان می‌دهد، به واسطه رساندن حقوقشان به آنان. پس آنان از تجاوز او در حقوقشان در امان هستند. و اگر چنین نباشد، او مؤمن نیست. پس ولایت (الولایة) میان خداوند و مؤمنان مشترک است. و خداوند يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}