{
  "id": 53,
  "title": {
    "ar": "الباب الثالث والخمسون في معرفة ما يلقي المريد على نفسه من الأعمال قبل وجود الشيخ",
    "en": "Chapter Fifty-Three: Concerning the knowledge of the spiritual practices (الأعمال) the aspirant (المريد) imposes upon himself before the presence of the spiritual master (الشيخ).",
    "ur": "باب ترپن (۵۳): اس معرفت (المعرفۃ) کے بیان میں کہ مرید (المريد) شیخ (الشیخ) کی موجودگی سے قبل اپنے نفس پر کون سے اعمال (الأعمال) لازم کرتا ہے۔",
    "fa": "باب پنجاه و سوم در معرفت آنچه سالک (مرید) پیش از یافتن شیخ بر خود از اعمال لازم می‌گرداند."
  },
  "content": {
    "ar": "## (الباب الثالث والخمسون في معرفة ما يلقي المريد على نفسه من الأعمال قبل وجود الشيخ)\n\n\n> إذا لم تلق أستاذا *** فكن في نعت من لاذا\n\n\n> وقطع نفسه والليل *** أفلاذا فافلاذا\n\n\n> وتسبيحا وقرآنا *** فاسهده بمن حاذى‏\n\n\n> وأضعفه وأحياه *** فلما لم يقل ما ذا\n\n\n> فكان له الذي يبغيه *** تلميذا وأستاذا\n\n\n> وجاءته معارفه *** زرافات وأفذاذا\n\n\n> فهذا قد أبنت له *** فلا ينفك عن هذا\n\n\n### [حركات الأفلاك التسع وما يقابلها من أعمال الباطن والظاهر]\n\n\nاعلم أيدك الله ونورك أنه أول ما يجب على الداخل في هذه الطريقة الإلهية المشروعة طلب الأستاذ حتى يجده وليعمل في هذه المدة التي يطلب فيها الأستاذ الأعمال التي أذكرها به وهي أن يلزم نفسه تسعة أشياء فإنها بسائط الأعداد فيكون له في التوحيد إذا عمل عليها قدم راسخة ولهذا جعل الله الأفلاك تسعة أفلاك فانظر ما ظهر من الحكمة الإلهية في حركات هذه التسعة فاجعل منها أربعة في ظاهرك وخمسة في باطنك فالتي في ظاهرك الجوع والسهر والصمت والعزلة فاثنان فاعلان وهما الجوع والعزلة واثنان منفعلان وهما السهر والصمت وأعني بالصمت ترك كلام الناس والاشتغال بذكر القلب ونطق النفس عن نطق اللسان إلا فيما أوجب الله عليه مثل قراءة أم القرآن أو ما تَيَسَّرَ من الْقُرْآنِ في الصلاة والتكبير فيها وما شرع من التسبيح والأذكار والدعاء والتشهد والصلاة على رسول الله صلى الله عليه وسلم إلى أن تسلم منها فتتفرغ لذكر القلب بصمت اللسان فالجوع يتضمن السهر والصمت تتضمنه العزلة وأما الخمسة الباطنة فهي الصدق والتوكل والصبر والعزيمة واليقين فهذه التسعة أمهات الخير تتضمن الخير كله والطريقة مجموعة فيها فألزمها حتى تجد الشيخ‏\n\n\n### (وصل شارح) [ذكر الأعمال الظاهرة والباطنة التي يأخذ بها المريد نفسه‏]\n\n\nوأنا أذكر لك من شأن كل واحدة من هذه الخصال ما يحرضك على العمل بها والدءوب عليها والله ينفعنا وإياك وبجعلنا من أهل عنايته ولنبتدئ بالظاهرة أولا ولنقل‏\n\n\nأما العزلة وهي رأس الأربعة المعتبرة التي ذكرناها عند الطائفة أخبرني أخي في الله تعالى عبد المجيد بن سلمة خطيب مرشانة الزيتون من أعمال إشبيلية من بلاد الأندلس وكان من أهل الجد والاجتهاد في العبادة فأخبرني سنة ست وثمانين وخمسمائة قال كنت بمنزلي بمرشانة ليلة من الليالي فقمت إلى حزبي من الليل فبينا أنا واقف في مصلاي وباب الدار وباب البيت علي مغلق وإذا بشخص قد دخل علي وسلم وما أدري كيف دخل فجزعت منه وأوجزت في صلاتي فلما سلمت قال لي يا عبد المجيد من تأنس بالله لم يجزع ثم نفض الثوب الذي كان تحتي أصلي عليه ورمى به وبسط تحتي حصيرا صغيرا كان عنده وقال لي صل على هذا قال ثم أخذني وخرج بي من الدار ثم من البلد ومشى بي في أرض لا أعرفها وما كنت أدري أين أنا من أرض الله فذكرنا الله تعالى في تلك الأماكن ثم ردني إلى بيتي حيث كنت قال فقلت له يا أخي بما ذا يكون الأبدال أبدالا فقال لي بالأربعة التي ذكرها أبو طالب في القوت ثم سماها لي الجوع والسهر والصمت والعزلة قلبا ثم قال لي عبد المجيد هذا هو الحصير فصليت عليه وهذا الرجل كان من أكابرهم يقال له معاذ بن أشرس فأما العزلة فهي أن يعتزل المريد كل صفة مذمومة وكل خلق دني‏ء هذه عزلته في حاله وأما في قلبه فهو أن يعتزل بقلبه عن التعلق بأحد من خلق الله من أهل ومال وولد وصاحب وكل ما يحول بينه وبين ذكر ربه بقلبه حتى عن خواطره ولا يكن له هم إلا واحد وهو تعلقه بالله وأما في حسه فعزلته في ابتداء حاله الانقطاع عن الناس وعن المألوفات إما في بيته وإما بالسياحة في أرض الله فإن كان في مدينة فبحيث لا يعرف وإن لم يكن في مدينة فيلزم السواحل والجبال‏\nوالأماكن البعيدة من الناس فإن أنست به الوحوش وتألفت به وأنطقها الله في حقه فكلمته أو لم تكلمه فليعتزل عن الوحوش والحيوانات ويرغب إلى الله تعالى في أن لا يشغله بسواه وليثابر على الذكر الخفي وإن كان من حفاظ القرآن فيكون له منه حزب في كل ليلة يقوم به في صلاته لئلا ينساه ولا يكثر الأوراد ولا الحركات وليرد اشتغاله إلى قلبه دائما هكذا يكون دأبه وديدنه‏\n\n\nوأما الصمت فهو أن لا يتكلم مع مخلوق من الوحوش والحشرات التي لزمته في سياحته أو في موضع عزلته وإن ظهر له أحد من الجن أو من الملإ الأعلى فيغمض عينه عنهم ولا يشغل نفسه بالحديث معهم وإن كلموه فإن تفرض عليه الجواب أجاب بقدر أداء الفرض بغير مزيد وإن لم يتفرض عليه سكت عنهم واشتغل بنفسه فإنهم إذا رأوه على هذه الحالة اجتنبوه ولم يتعرضوا له واحتجبوا عنه فإنهم قد علموا أنه من شغل مشغولا بالله عن شغله به عاقبه الله أشد عقوبة وأما صمته في نفسه عن حديث نفسه فلا يحدث نفسه بشي‏ء مما يرجو تحصيله من الله فيما انقطع إليه فإنه تضييع للوقت فيما ليس بحاصل فإنه من الأماني وإذا عود نفسه بحديث نفسه حال بينه وبين ذكر الله في قلبه فإن القلب لا يتسع للحديث والذكر معا فيفوته السبب المطلوب منه في عزلته وصمته وهو ذكر الله تعالى الذي تتجلى به مرآة قلبه فيحصل له تجلى ربه‏\n\n\nوأما الجوع فهو التقليل من الطعام فلا يتناول منه إلا قدر ما يقيم صلبه لعبادة ربه في صلاة فريضته فإن التنفل في الصلاة قاعدا بما يجده من الضعف لقلة الغذاء أنفع وأفضل وأقوى في تحصيل مراده من الله من القوة التي تحصل له من الغذاء لأداء النوافل قائما فإن الشبع داع إلى الفضول فإن البطن إذا شبع طغت الجوارح وتصرفت في الفضول من الحركة والنظر والسماع والكلام وهذه كلها قواطع له عن المقصود\n\n\nوأما السهر فإن الجوع يولده لقلة الرطوبة والأبخرة الجالبة للنوم ولا سيما شرب الماء فإنه نوم كله وشهوته كاذبة وفائدة السهر التيقظ للاشتغال مع الله بما هو بصدده دائما فإنه إذا نام انتقل إلى عالم البرزخ بحسب ما نام عليه لا يزيد فيفوته خير كثير مما لا يعلمه إلا في حال السهر وأنه إذا التزم ذلك سرى السهر إلى عين القلب وانجلى عين البصيرة بملازمة الذكر فيرى من الخير ما شاء الله تعالى وفي حصول هذه الأربعة التي هي أساس المعرفة لأهل الله وقد اعتنى بها الحارث بن أسد المحاسبي أكثر من غيره وهي معرفة الله ومعرفة النفس ومعرفة الدنيا ومعرفة الشيطان وقد ذكر بعضهم معرفة الهوى بدلا من معرفة الله وأنشدوا في ذلك‏\n\n\n> أني بليت بأربع يرمينني *** بالنبل من قوس لها توتير\n\n\n> إبليس والدنيا ونفسي والهوى *** يا رب أنت على الخلاص قدير\n\n\nوقال الآخر\n\n\n> إبليس والدنيا ونفسي والهوى *** كيف الخلاص وكلهم أعدائي‏\n\n\n### [الأعمال الباطنة في طريق الله‏]\n\n\nوأما الخمسة الباطنة فإنه حدثتني المرأة الصالحة مريم بنت محمد بن عبدون بن عبد الرحمن البجائي قالت رأيت في منامي شخصا كان يتعاهدني في وقائعي وما رأيت له شخصا قط في عالم الحس فقال لها تقصدين الطريق قالت فقلت له إي والله أقصد الطريق ولكن لا أدري بما ذا قالت فقال لي بخمسة وهي التوكل واليقين والصبر والعزيمة والصدق فعرضت رؤياها علي فقلت لها هذا مذهب القوم وسيأتي الكلام عليها إن شاء الله تعالى في داخل الكتاب فإن لها أبوابا تخصها وكذلك الأربعة التي ذكرناها لها أيضا أبواب تخصها في الفصل الثاني من فصول هذا الكتاب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء السادس والعشرون‏\n\n",
    "en": "If you have not found a Master (ustadh), then be in the state of one who takes refuge,\nAnd cuts his soul and the night into pieces, piece by piece,\nAnd by glorification (tasbih) and Quran, witness it by the One who is near.\nAnd he weakened it (the self) and revived it (the spirit), and when he did not ask, \"What is this?\"\nThe One he sought became for him both disciple and Master.\nAnd his gnosis (ma‘arif) came to him, in groups and individually.\nThis I have made clear to him, so let him not depart from this (path).\n\n### [The Movements of the Nine Spheres and Their Corresponding Inner and Outer Practices]\n\nKnow—may Allah aid and illuminate you—that the first thing incumbent upon the one entering this prescribed Divine Path (tariqa) is the search for the Master (ustadh) until he finds him. During this period of searching, he should undertake the practices I shall mention. These are nine things he must impose upon himself, for they are the simple elements of numbers, and by acting upon them, he will establish a firm footing (qadam rasikha) in the doctrine of Unity (Tawhid).\n\nFor this reason, Allah made the celestial spheres (aflak) nine spheres. Look at the Divine Wisdom (al-Hikma al-Ilahiyya) manifested in the movements of these nine, and assign four of them to your outer being (zahir) and five to your inner being (batin).\n\nThose belonging to your outer being are Hunger (al-Ju‘), Vigilance (al-Sahar), Silence (al-Samt), and Seclusion (al-‘Uzla). Two of these are active principles (fa‘ilan): Hunger and Seclusion. Two are passive principles (munfa‘ilan): Vigilance and Silence.\n\nBy Silence, I mean abandoning conversation with people and occupying oneself with the remembrance of the heart (dhikr al-qalb), allowing the soul to speak instead of the tongue, except in matters Allah has made obligatory, such as reciting the Mother of the Quran (Surat al-Fatiha) or whatever is easy of the Quran in prayer, the *takbir* (magnification) therein, and the prescribed glorifications (tasbih), invocations (adhkar), supplications (du‘a), the testification (tashahhud), and the prayer upon the Messenger of Allah (peace and blessings be upon him), until one concludes the prayer. Then, one dedicates oneself to the remembrance of the heart by the silence of the tongue.\n\nHunger implies Vigilance, and Silence is implied by Seclusion.\n\nAs for the five inner principles (al-khamsa al-batina), they are Sincerity (al-Sidq), Reliance (al-Tawakkul), Patience (al-Sabr), Determination (al-‘Azima), and Certainty (al-Yaqin). These nine are the Mothers of Goodness (ummahaat al-khayr); they encompass all goodness, and the Path (al-Tariqa) is gathered within them. Adhere to them until you find the Shaykh.\n\n### (Explanatory Continuation) [Mention of the Outer and Inner Practices the Seeker Imposes Upon Himself]\n\nI shall mention to you concerning each of these qualities that which will encourage you to practice them and persevere in them. May Allah benefit us and you, and make us among the people of His special care. Let us begin with the outer practices first, and we say:\n\nAs for Seclusion (al-‘Uzla), it is the head of the four esteemed practices mentioned by the Sufi community (al-Ta'ifa). My brother in Allah, Abd al-Majid ibn Salama, the preacher of Marshana al-Zaytun in the district of Seville in al-Andalus—who was among the people of earnestness (jidd) and striving (ijtihad) in worship—informed me in the year 586 AH (1190 CE). He said: I was in my house in Marshana one night, and I rose for my portion (hizb) of the night prayer. While I was standing at my prayer rug, with the door of the house and the door of the room closed upon me, suddenly a person entered and greeted me. I did not know how he entered. I was alarmed by him and shortened my prayer. When I concluded the prayer, he said to me, \"O Abd al-Majid, whoever is intimate with Allah (ta'nas bi-Allah) is not alarmed.\" Then he shook the garment I was praying upon, threw it away, and spread a small mat (hasir) he had, saying to me, \"Pray upon this.\" He said: Then he took me and led me out of the house, then out of the town, and walked with me through a land I did not recognize. I did not know where I was in Allah's earth. We remembered Allah (dhikr) in those places, and then he returned me to my house where I had been. I said to him, \"O my brother, by what means do the Substitutes (al-Abdal) become Substitutes?\" He replied, \"By the four mentioned by Abu Talib in *Al-Qut*,\" and then he named them for me: Hunger, Vigilance, Silence, and Seclusion of the heart. Then he said to me, \"Abd al-Majid, this is the mat,\" and I prayed upon it. This man was one of their great figures, named Mu'adh ibn Ashras.\n\nAs for Seclusion (al-‘Uzla), it is that the seeker (murid) secludes himself from every blameworthy quality (sifa madhmuma) and every base character (khuluq dani'). This is his seclusion in his spiritual state (hal). As for his heart, it is that he secludes his heart from attachment to any of Allah's creation—family, wealth, children, companion—and everything that intervenes between him and the remembrance of his Lord in his heart, even from his own passing thoughts (khawatir). He should have no concern (hamm) except one: his attachment to Allah.\n\nAs for his physical sense, his seclusion in the beginning of his state is the severance from people and from familiar things, either in his house or by traveling (siyaha) in Allah's earth. If he is in a city, he should be where he is not known. If he is not in a city, he should adhere to the coasts, mountains, and places far from people. If wild beasts become intimate with him and accustomed to him, and Allah causes them to speak concerning him, whether they speak to him or not, he must seclude himself even from the wild beasts and animals, and implore Allah not to distract him with anything other than Him. He should persevere in silent remembrance (al-dhikr al-khafi). If he is a memorizer of the Quran (huffaz), he should have a portion (hizb) of it every night to recite in his prayer so that he does not forget it. He should not multiply his litanies (awrad) or his movements, and he should always direct his occupation back to his heart. This should be his constant habit and practice.\n\nAs for Silence (al-Samt), it is that he does not speak with any creature, including the wild beasts and insects that accompany him in his travels or place of seclusion. If someone from the Jinn or the Highest Assembly (al-Mala' al-A'la) appears to him, he should close his eyes to them and not occupy himself with conversation with them, even if they speak to him. If answering becomes an obligation (fard) upon him, he should answer only to the extent necessary to fulfill the obligation, without addition. If it is not obligatory, he should remain silent concerning them and occupy himself with his own soul. For when they see him in this state, they will avoid him, refrain from interfering with him, and veil themselves from him, knowing that whoever distracts one who is occupied with Allah from his occupation with Him, Allah will punish him with the severest punishment.\n\nAs for his silence concerning the discourse of his own soul (hadith nafsihi), he should not speak to himself about anything he hopes to attain from Allah through his seclusion, for that is a waste of time on what is not yet realized, as it belongs to mere wishes (al-amani). If he habituates his soul to self-discourse, it will intervene between him and the remembrance of Allah (dhikr Allah) in his heart, for the heart cannot accommodate both discourse and remembrance simultaneously. Thus, he misses the very purpose required of him in his seclusion and silence, which is the remembrance of Allah, by which the mirror of his heart is polished (tanjali), leading to the Theophany (tajalli) of his Lord.\n\nAs for Hunger (al-Ju‘), it is the reduction of food. He should consume only enough to keep his back straight for the worship of his Lord in his obligatory prayer (salat faridatihi). For performing supererogatory prayers (al-tanafful) sitting down due to the weakness he finds from lack of nourishment is more beneficial, superior, and stronger in attaining his desire from Allah than the strength he gains from food to perform supererogatory prayers standing up. Satiety (al-shab‘) is an invitation to excess (al-fudul). When the stomach is full, the limbs become rebellious (taghat) and engage in excesses of movement, looking, hearing, and speaking, and all of these are obstacles (qawati‘) preventing him from his goal.\n\nAs for Vigilance (al-Sahar), Hunger generates it due to the scarcity of moisture and vapors that induce sleep, especially drinking water, which is entirely sleep, and the desire for it is false. The benefit of Vigilance is wakefulness (al-yaqaz) for constant occupation with Allah in the matter he is pursuing. For when he sleeps, he transfers to the World of the Isthmus (alam al-Barzakh) according to the state upon which he slept, and he does not increase, thus missing much good that he only knows in the state of Vigilance. When he adheres to this, Vigilance flows into the eye of the heart (ayn al-qalb), and the eye of insight (ayn al-basira) is polished by constant remembrance (dhikr), allowing him to see whatever good Allah wills.\n\nIn the attainment of these four lies the foundation of Gnosis (Ma'rifa) for the People of Allah. Al-Harith ibn Asad al-Muhasibi paid more attention to these than others, namely: Knowledge of Allah (Ma'rifat Allah), Knowledge of the Self (Ma'rifat al-Nafs), Knowledge of the World (Ma'rifat al-Dunya), and Knowledge of Satan (Ma'rifat al-Shaytan). Some have mentioned Knowledge of Caprice (Ma'rifat al-Hawa) instead of Knowledge of Allah, and they recited concerning this:\n\nI have been afflicted by four that shoot at me,\nWith arrows from a taut bow:\nIblis, the World, my Self, and Caprice (al-Hawa).\nO Lord, You are powerful over deliverance.\n\nAnd another said:\n\nIblis, the World, my Self, and Caprice (al-Hawa)—\nHow can there be deliverance when all of them are my enemies?\n\n### [The Inner Practices on the Path of Allah]\n\nAs for the five inner principles, the righteous woman Maryam bint Muhammad ibn Abdun ibn Abd al-Rahman al-Baja'i narrated to me. She said: I saw in my sleep a person who used to attend to me in my spiritual occurrences (waqa'i'), though I had never seen his physical form in the sensory world (alam al-hiss). He asked her, \"Do you intend the Path (al-Tariq)?\" She replied, \"Yes, by Allah, I intend the Path, but I do not know by what means.\" She said: He replied to me, \"By five: Reliance (al-Tawakkul), Certainty (al-Yaqin), Patience (al-Sabr), Determination (al-‘Azima), and Sincerity (al-Sidq).\"\n\nShe presented her vision to me, and I said to her, \"This is the doctrine (madhhab) of the People (al-Qawm). Discussion concerning them will come, if Allah wills, later in the book, for they have chapters dedicated specifically to them. Likewise, the four we mentioned also have chapters dedicated to them in the second section of the divisions of this book.\"\n\nAnd Allah says the Truth (al-Haqq), and He guides to the Way (al-Sabil). End of the Twenty-Sixth Part.",
    "ur": "(باب ترپن: ان اعمال کی معرفت جو مرید شیخ کے ملنے سے پہلے اپنے اوپر لازم کرتا ہے)\n\nاگر تجھے کوئی استاد (شیخ) نہ ملے\nتو اس شخص کی صفت میں ہو جا جس نے پناہ لی (اللہ کی)\nاور اپنے نفس کو اور رات کو ٹکڑوں ٹکڑوں میں تقسیم کر دیا\nاور تسبیح اور قرآن کے ذریعے\nاسے (رات کو) اس ذات کے ساتھ بیدار رکھ جس نے اسے گھیر رکھا ہے\nاور اسے (نفس کو) کمزور کیا اور اسے زندہ کیا، پس جب اس نے نہ کہا کہ کیا ہے (یعنی اعتراض نہ کیا)\nتو جو کچھ وہ چاہتا تھا وہ اسے مل گیا، شاگرد بھی اور استاد بھی\nاور اس کی معرفتیں (المعرفة) اس کے پاس گروہ در گروہ اور تنہا آئیں\nپس یہ میں نے اس کے لیے واضح کر دیا ہے، لہٰذا وہ اس سے جدا نہ ہو\n\n[نو افلاک کی حرکات اور ان کے مقابل باطن اور ظاہر کے اعمال]\n\nجان لو، اللہ تمہاری مدد کرے اور تمہیں منور کرے، کہ اس الٰہی مشروع طریقہ (الطريقة الإلهية المشروعة) میں داخل ہونے والے پر سب سے پہلے جو چیز واجب ہے وہ استاد (شیخ) کی تلاش ہے، یہاں تک کہ وہ اسے پا لے۔ اور اس مدت میں جب وہ استاد کی تلاش کر رہا ہو، وہ ان اعمال کو کرے گا جن کا میں ذکر کر رہا ہوں، اور وہ یہ ہیں کہ وہ اپنے اوپر نو چیزیں لازم کرے، کیونکہ یہ اعداد کی اساس (بسیط) ہیں۔ پس جب وہ ان پر عمل کرے گا تو توحید میں اس کا قدم راسخ ہو جائے گا۔ اسی لیے اللہ تعالیٰ نے افلاک کو نو افلاک بنایا ہے۔ پس تم دیکھو کہ ان نو کی حرکات میں کیا الٰہی حکمت (الحکمة الإلهية) ظاہر ہوئی ہے، تو ان میں سے چار کو اپنے ظاہر میں اور پانچ کو اپنے باطن میں رکھو۔\n\nجو تمہارے ظاہر میں ہیں وہ ہیں: بھوک (الجوع)، بیداری (السهر)، خاموشی (الصمت)، اور خلوت (العزلة)۔ ان میں سے دو فاعل ہیں، اور وہ بھوک (الجوع) اور خلوت (العزلة) ہیں۔ اور دو منفعل ہیں، اور وہ بیداری (السهر) اور خاموشی (الصمت) ہیں۔ خاموشی (الصمت) سے میری مراد لوگوں سے بات چیت ترک کرنا اور ذکر قلب (ذکر القلب) میں مشغول ہونا اور زبان کی گویائی کے بجائے نفس کی گویائی سے کام لینا ہے، سوائے ان چیزوں کے جو اللہ نے واجب کی ہیں، جیسے نماز میں سورۃ فاتحہ یا جو قرآن میسر ہو اس کی تلاوت، اور اس میں تکبیر، اور جو تسبیح، اذکار، دعا، تشہد، اور رسول اللہ صلی اللہ علیہ وسلم پر درود مشروع ہے، یہاں تک کہ تم نماز سے سلام پھیرو، پھر تم زبان کی خاموشی کے ساتھ ذکر قلب (ذکر القلب) کے لیے فارغ ہو جاؤ۔ بھوک (الجوع) اپنے اندر بیداری (السهر) کو شامل کرتی ہے، اور خاموشی (الصمت) کو خلوت (العزلة) شامل کرتی ہے۔\n\nاور جو پانچ باطنی ہیں وہ ہیں: سچائی (الصدق)، توکل (التوکل)، صبر (الصبر)، عزم (العزيمة)، اور یقین (الیقین)۔ یہ نو چیزیں خیر کی مائیں ہیں، جو تمام خیر کو اپنے اندر شامل کرتی ہیں، اور طریقہ (الطريقة) ان میں جمع ہے۔ پس ان کو لازم پکڑو یہاں تک کہ تم شیخ (الشیخ) کو پا لو۔\n\n(شارح کا وصل) [ظاہری اور باطنی اعمال کا ذکر جنہیں مرید اپنے اوپر لازم کرتا ہے]\n\nاور میں تمہیں ان میں سے ہر خصلت کے بارے میں وہ بات بتاؤں گا جو تمہیں ان پر عمل کرنے اور ان پر ثابت قدم رہنے پر ابھارے گی۔ اللہ ہمیں اور تمہیں نفع دے اور ہمیں اپنے اہل عنایت میں شامل کرے۔ اور ہم پہلے ظاہری اعمال سے شروع کرتے ہیں اور کہتے ہیں:\n\nجہاں تک خلوت (العزلة) کا تعلق ہے، جو کہ طائفہ (صوفیاء) کے نزدیک ان چار معتبر چیزوں کا سر ہے جن کا ہم نے ذکر کیا، تو مجھے میرے بھائی فی اللہ عبد المجید بن سلمہ، جو اندلس کے علاقے اشبیلیہ کے اعمال میں سے مرشانۃ الزیتون کے خطیب تھے اور عبادت میں جدوجہد اور کوشش کرنے والوں میں سے تھے، نے ۵۸۶ھ میں خبر دی، انہوں نے کہا: میں مرشانہ میں اپنے گھر میں ایک رات تھا، تو میں رات کے اپنے وظیفے کے لیے کھڑا ہوا۔ جب میں اپنی جائے نماز پر کھڑا تھا، اور گھر کا دروازہ اور کمرے کا دروازہ مجھ پر بند تھا، تو اچانک ایک شخص اندر داخل ہوا اور سلام کیا، اور مجھے نہیں معلوم کہ وہ کیسے داخل ہوا۔ میں گھبرا گیا اور میں نے اپنی نماز مختصر کر دی۔ جب میں نے سلام پھیرا تو اس نے مجھ سے کہا: اے عبد المجید! جو اللہ سے انس رکھتا ہے وہ نہیں گھبراتا۔ پھر اس نے وہ کپڑا جھاڑا جس پر میں نماز پڑھ رہا تھا اور اسے پھینک دیا، اور اس کے پاس سے ایک چھوٹی چٹائی بچھا دی اور مجھ سے کہا: اس پر نماز پڑھو۔ انہوں نے کہا: پھر وہ مجھے لے کر گھر سے باہر نکلے، پھر شہر سے باہر، اور مجھے ایک ایسی زمین میں چلایا جسے میں نہیں جانتا تھا، اور مجھے نہیں معلوم تھا کہ میں اللہ کی زمین میں کہاں ہوں۔ پھر ہم نے ان جگہوں پر اللہ کا ذکر کیا۔ پھر وہ مجھے میرے گھر واپس لے آئے جہاں میں تھا۔ انہوں نے کہا: میں نے ان سے پوچھا: اے میرے بھائی! ابدال کن چیزوں سے ابدال بنتے ہیں؟ تو انہوں نے مجھ سے کہا: ان چار چیزوں سے جن کا ذکر ابو طالب نے \"القوت\" میں کیا ہے، پھر انہوں نے ان کے نام بتائے: بھوک (الجوع)، بیداری (السهر)، خاموشی (الصمت)، اور خلوت (العزلة) قلباً۔ پھر انہوں نے مجھ سے کہا: اے عبد المجید! یہ وہی چٹائی ہے، اور میں نے اس پر نماز پڑھی۔ یہ شخص ان کے اکابر میں سے تھا، جسے معاذ بن اشرس کہا جاتا تھا۔\n\nجہاں تک خلوت (العزلة) کا تعلق ہے، تو یہ ہے کہ مرید ہر مذموم صفت اور ہر گھٹیا خُلق سے کنارہ کشی اختیار کرے۔ یہ اس کے حال میں اس کی خلوت ہے۔ اور جہاں تک اس کے قلب (القلب) کا تعلق ہے، تو یہ ہے کہ وہ اپنے قلب کو اللہ کی مخلوق میں سے کسی سے بھی تعلق رکھنے سے الگ کر لے، خواہ وہ اہل و عیال، مال، اولاد، یا دوست ہو، اور ہر وہ چیز جو اس کے اور اس کے رب کے ذکر قلب (ذکر القلب) کے درمیان حائل ہو، یہاں تک کہ اپنے خطرات (خواطر) سے بھی۔ اور اس کی کوئی فکر نہ ہو سوائے ایک کے، اور وہ ہے اللہ سے اس کا تعلق۔\n\nاور جہاں تک اس کے حواس کا تعلق ہے، تو اس کے حال کے آغاز میں اس کی خلوت لوگوں سے اور مانوس چیزوں سے کٹ جانا ہے، یا تو اپنے گھر میں، یا اللہ کی زمین میں سیاحت کے ذریعے سے۔ اگر وہ کسی شہر میں ہو تو ایسی جگہ ہو جہاں اسے کوئی نہ پہچانے، اور اگر وہ شہر میں نہ ہو تو وہ ساحلوں اور پہاڑوں اور لوگوں سے دور جگہوں کو لازم پکڑے۔ اگر وحشی جانور اس سے مانوس ہو جائیں اور اس سے الفت پیدا کر لیں، اور اللہ انہیں اس کے حق میں گویائی دے دے اور وہ اس سے بات کریں، یا بات نہ بھی کریں، تو اسے چاہیے کہ وہ وحشی جانوروں اور حیوانات سے بھی کنارہ کشی اختیار کرے اور اللہ تعالیٰ سے رغبت کرے کہ وہ اسے اپنے سوا کسی چیز میں مشغول نہ کرے۔ اور اسے چاہیے کہ وہ ذکر خفی (الذکر الخفي) پر ثابت قدم رہے، اور اگر وہ حافظ قرآن ہے تو ہر رات نماز میں اس کا ایک حزب ہو جسے وہ ادا کرے تاکہ وہ اسے بھول نہ جائے، اور وہ اوراد اور حرکات کی کثرت نہ کرے، اور اپنی مشغولیت کو ہمیشہ اپنے قلب (القلب) کی طرف لوٹائے۔ اس طرح اس کا معمول اور طریقہ ہونا چاہیے۔\n\nاور جہاں تک خاموشی (الصمت) کا تعلق ہے، تو یہ ہے کہ وہ کسی مخلوق سے بات نہ کرے، نہ ان وحشی جانوروں اور حشرات سے جو اس کی سیاحت یا اس کی خلوت کی جگہ میں اس کے ساتھ ہو گئے ہیں، اور اگر اس کے سامنے جنات میں سے کوئی یا ملأ اعلیٰ (الملإ الأعلى) میں سے کوئی ظاہر ہو تو وہ ان سے آنکھیں بند کر لے اور ان سے بات چیت میں خود کو مشغول نہ کرے۔ اور اگر وہ اس سے بات کریں، تو اگر اس پر جواب دینا فرض ہو تو وہ فرض کی ادائیگی کے بقدر جواب دے، اس سے زیادہ نہیں۔ اور اگر اس پر فرض نہ ہو تو وہ ان سے خاموش رہے اور اپنے کام میں مشغول رہے۔ کیونکہ جب وہ اسے اس حالت پر دیکھیں گے تو اس سے گریز کریں گے اور اس سے تعرض نہیں کریں گے اور اس سے پردہ کر لیں گے۔ کیونکہ وہ جانتے ہیں کہ جو شخص اللہ میں مشغول شخص کو اپنے کام میں مشغول کرے گا، اللہ اسے سخت ترین سزا دے گا۔\n\nاور جہاں تک اس کے نفس کی خاموشی (الصمت) کا تعلق ہے، تو وہ یہ ہے کہ وہ اپنے نفس سے کسی ایسی چیز کے بارے میں بات نہ کرے جس کے حصول کی وہ اللہ سے امید رکھتا ہے جس کے لیے وہ منقطع ہوا ہے، کیونکہ یہ وقت کا ضیاع ہے ایسی چیز میں جو حاصل نہیں ہونے والی، کیونکہ یہ محض آرزوئیں ہیں۔ اور جب وہ اپنے نفس کو اپنے آپ سے بات کرنے کا عادی بنا لے گا تو یہ اس کے اور اس کے قلب (القلب) میں ذکر اللہ کے درمیان حائل ہو جائے گا، کیونکہ قلب (القلب) ایک ساتھ بات چیت اور ذکر (الذکر) دونوں کے لیے گنجائش نہیں رکھتا۔ پس اس سے وہ مطلوبہ سبب فوت ہو جائے گا جو اس کی خلوت (العزلة) اور خاموشی (الصمت) سے مقصود ہے، اور وہ ہے اللہ کا ذکر (ذکر اللہ) جس سے اس کے قلب (القلب) کا آئینہ منجلی ہوتا ہے، اور اسے اپنے رب کا ظہور الٰہی (التجلی) حاصل ہوتا ہے۔\n\nاور جہاں تک بھوک (الجوع) کا تعلق ہے، تو یہ کھانے میں کمی کرنا ہے، پس وہ اس میں سے صرف اتنی مقدار لے جو اس کی کمر کو اس کے رب کی عبادت کے لیے، اس کی فرض نماز میں، سیدھا رکھے۔ کیونکہ کم غذا کی وجہ سے جو کمزوری اسے محسوس ہوتی ہے، اس کے ساتھ نفل نماز بیٹھ کر ادا کرنا، اس قوت سے زیادہ نفع بخش، افضل اور اس کے مطلوب کو اللہ سے حاصل کرنے میں زیادہ قوی ہے جو اسے کھڑے ہو کر نوافل ادا کرنے کے لیے غذا سے حاصل ہوتی ہے۔ کیونکہ شکم سیری فضول کاموں کی طرف بلاتی ہے۔ جب پیٹ بھر جاتا ہے تو اعضاء سرکشی کرتے ہیں اور حرکت، نظر، سماعت اور کلام کے فضول کاموں میں مشغول ہو جاتے ہیں، اور یہ سب مقصود سے کاٹنے والی چیزیں ہیں۔\n\nاور جہاں تک بیداری (السهر) کا تعلق ہے، تو بھوک اسے پیدا کرتی ہے، کیونکہ رطوبت اور نیند لانے والے بخارات کم ہو جاتے ہیں، خاص طور پر پانی پینا، کیونکہ یہ مکمل طور پر نیند لاتا ہے اور اس کی خواہش جھوٹی ہے۔ بیداری (السهر) کا فائدہ یہ ہے کہ ہمیشہ اللہ کے ساتھ اس کام میں مشغول رہنے کے لیے بیدار رہنا جس کا وہ ارادہ رکھتا ہے۔ کیونکہ جب وہ سوتا ہے تو وہ عالم برزخ (عالم البرزخ) میں منتقل ہو جاتا ہے، اس حالت کے مطابق جس پر وہ سویا تھا، اس میں اضافہ نہیں ہوتا، اور اس سے بہت سی بھلائی فوت ہو جاتی ہے جسے وہ صرف بیداری (السهر) کی حالت میں جانتا ہے۔ اور جب وہ اس کو لازم پکڑتا ہے تو بیداری (السهر) قلب (القلب) کی آنکھ تک سرایت کر جاتی ہے اور ذکر (الذکر) کو لازم پکڑنے سے بصیرت کی آنکھ منجلی ہو جاتی ہے، پس وہ اللہ تعالیٰ کی مشیت کے مطابق بھلائی دیکھتا ہے۔ اور ان چار چیزوں کا حصول اہل اللہ کے لیے معرفت (المعرفة) کی بنیاد ہے۔ حارث بن اسد المحاسبی نے دوسروں کے مقابلے میں ان پر زیادہ توجہ دی ہے، اور وہ ہیں: اللہ کی معرفت (معرفة الله)، نفس کی معرفت (معرفة النفس)، دنیا کی معرفت (معرفة الدنيا)، اور شیطان کی معرفت (معرفة الشيطان)۔ بعض نے اللہ کی معرفت (معرفة الله) کے بجائے خواہش نفس (معرفة الهوى) کی معرفت کا ذکر کیا ہے، اور اس بارے میں اشعار کہے ہیں:\n\nمیں چار چیزوں میں مبتلا ہوا ہوں جو مجھے تیروں سے مارتی ہیں\nاس کمان سے جس میں تانت چڑھی ہوئی ہے\nابلیس، اور دنیا، اور میرا نفس، اور خواہش نفس (الہویٰ)\nاے میرے رب! تو ہی نجات پر قادر ہے\n\nاور دوسرے نے کہا:\nابلیس، اور دنیا، اور میرا نفس، اور خواہش نفس (الہویٰ)\nنجات کیسے ہو جبکہ یہ سب میرے دشمن ہیں؟\n\n[اللہ کے راستہ میں باطنی اعمال]\n\nاور جہاں تک پانچ باطنی اعمال کا تعلق ہے، تو مجھے نیک خاتون مریم بنت محمد بن عبدون بن عبد الرحمن البجائی نے بتایا، انہوں نے کہا: میں نے خواب میں ایک شخص کو دیکھا جو میرے واقعات میں میری دیکھ بھال کرتا تھا، اور میں نے عالم حس (عالم الحس) میں کبھی اس کی شکل نہیں دیکھی تھی۔ اس نے مجھ سے کہا: کیا تم راستہ (الطریق) کا ارادہ رکھتی ہو؟ انہوں نے کہا: میں نے اس سے کہا: ہاں، اللہ کی قسم! میں راستہ کا ارادہ رکھتی ہوں، لیکن مجھے نہیں معلوم کہ کس چیز سے؟ انہوں نے کہا: تو اس نے مجھ سے کہا: پانچ چیزوں سے، اور وہ ہیں: توکل (التوکل)، یقین (الیقین)، صبر (الصبر)، عزم (العزيمة)، اور صدق (الصدق)۔\n\nپس انہوں نے اپنا خواب مجھ پر پیش کیا، تو میں نے ان سے کہا: یہ قوم (صوفیاء) کا مسلک ہے۔ اور ان شاء اللہ کتاب کے اندر ان پر کلام آئے گا، کیونکہ ان کے لیے مخصوص ابواب ہیں۔ اور اسی طرح ان چار چیزوں کے لیے بھی جن کا ہم نے ذکر کیا، اس کتاب کے دوسرے فصل میں ان کے لیے بھی مخصوص ابواب ہیں۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔\nچھبیسواں حصہ مکمل ہوا۔",
    "fa": "باب پنجاه و سوم در معرفت اعمالی که مرید پیش از یافتن شیخ بر خود لازم می‌سازد.\n\nاگر استادی نیافتی، *** پس در وصف کسی باش که پناه جُست.\nو نفس خود و شب را *** پاره پاره کرد (به عبادت).\nو با تسبیح و قرآن، *** آن را با کسی که هم‌ردیف اوست بیدار نگه داشت.\nو او را ضعیف کرد و زنده ساخت، *** پس چون نگفت که «چه؟» (اعتراضی نکرد).\nآنچه می‌خواست برایش حاصل شد، *** هم شاگرد و هم استاد.\nو معارفش به سوی او آمد، *** گروه گروه و تک تک.\nاین را برایت آشکار ساختم، *** پس از این (راه) جدا مشو.\n\n[حرکات افلاک نه‌گانه و آنچه از اعمال باطن و ظاهر در مقابل آنها قرار می‌گیرد]\n\nبدان، خداوند تو را تأیید و نورانی گرداند، که نخستین چیزی که بر سالکِ وارد شونده به این طریقت الهیِ مشروع واجب است، طلب استاد است تا او را بیابد. و در این مدتی که در جستجوی استاد است، باید اعمالی را که ذکر می‌کنم انجام دهد؛ و آن این است که نُه چیز را بر خود لازم سازد، زیرا اینها بسیط‌های اعداد هستند و اگر بر آنها عمل کند، در توحید قدمی راسخ خواهد داشت. به همین دلیل خداوند افلاک را نُه فلک قرار داد. پس بنگر به حکمتی الهی که در حرکات این نُه (فلک) آشکار شده است، و چهار مورد از آنها را در ظاهر خود و پنج مورد را در باطن خود قرار ده.\nآنچه در ظاهر توست عبارتند از: جوع (گرسنگی)، سهر (بیدارخوابی)، صمت (سکوت) و عزلت. دو مورد از آنها فاعل هستند که جوع و عزلت می‌باشند، و دو مورد منفعل هستند که سهر و صمت می‌باشند. منظورم از صمت (سکوت)، ترک سخن گفتن با مردم و مشغول شدن به ذکر قلب و نطق نفس به جای نطق زبان است، مگر در آنچه خداوند بر او واجب کرده است؛ مانند خواندن ام‌القرآن یا ما تَيَسَّرَ مِنَ الْقُرْآنِ (آنچه از قرآن میسر شود) در نماز و تکبیر در آن، و آنچه از تسبیحات و اذکار و دعا و تشهد و صلوات بر رسول خدا (صلی الله علیه و سلم) مشروع شده است، تا زمانی که از نماز سلام دهد و با صمت (سکوت) زبان، برای ذکر قلب فارغ شود.\nجوع، سهر را در بر می‌گیرد و صمت، در عزلت گنجانده می‌شود.\nاما پنج مورد باطنی عبارتند از: الصدق (صدق)، التوکل (توکل)، الصبر (صبر)، العزيمة (عزم) و الیقین (یقین). این نُه مورد، مادران خیر هستند که تمام خیر را در بر می‌گیرند و طریقت مجموعه در آنهاست. پس به آنها ملتزم باش تا شیخ را بیابی.\n\n(فصل شرح‌دهنده) [ذکر اعمال ظاهری و باطنی که مرید خود را به آنها ملزم می‌سازد]\n\nمن در مورد هر یک از این خصلت‌ها مطلبی را برایت ذکر می‌کنم که تو را به عمل کردن و مداومت بر آنها ترغیب کند. خداوند ما و تو را بهره‌مند سازد و ما را از اهل عنایت خود قرار دهد. ابتدا از اعمال ظاهری شروع می‌کنیم و می‌گوییم:\n\nاما العزلة (عزلت)، که سرآمد چهار خصلت معتبری است که نزد این طایفه (صوفیه) ذکر کردیم: برادرم در راه خدا، عبدالمجید بن سلمه، خطیب مرشانة الزیتون از توابع اشبیلیه در سرزمین اندلس، که از اهل جد و اجتهاد در عبادت بود، در سال پانصد و هشتاد و شش به من خبر داد و گفت: شبی از شب‌ها در منزل خود در مرشانه بودم. برای انجام حِزب شبانه‌ام برخاستم. در حالی که در مصلای خود ایستاده بودم و درب خانه و درب اتاق بر من بسته بود، ناگهان شخصی بر من وارد شد و سلام کرد، و من ندانستم چگونه وارد شد. از او ترسیدم و نمازم را کوتاه کردم. وقتی سلام دادم، به من گفت: ای عبدالمجید، کسی که با خدا انس بگیرد، نمی‌ترسد. سپس پارچه‌ای را که زیر پایم برای نماز بود تکان داد و دور انداخت و حصیری کوچک که نزدش بود زیر پایم پهن کرد و به من گفت: بر روی این نماز بخوان.\nسپس مرا گرفت و از خانه و سپس از شهر بیرون برد و در سرزمینی که نمی‌شناختم به راه افتاد. نمی‌دانستم کجای زمین خدا هستم. در آن مکان‌ها خدای تعالی را ذکر کردیم. سپس مرا به خانه‌ام، همان جایی که بودم، بازگرداند.\nگفت: به او گفتم: ای برادر، ابدال چگونه ابدال می‌شوند؟ گفت: به واسطه چهار خصلتی که ابوطالب در کتاب «قوت القلوب» ذکر کرده است. سپس آنها را برایم نام برد: الجوع (جوع)، السهر (سهر)، الصمت (صمت) و العزلة (عزلت) قلبی. سپس به من گفت: عبدالمجید، این همان حصیر است (که زیر پایت پهن کردم) و من بر آن نماز خواندم. این مرد از بزرگان آنها بود که به او معاذ بن اشرس می‌گفتند.\nاما العزلة (عزلت): این است که مرید از هر صفت نکوهیده و هر خُلق پستی کناره‌گیری کند. این عزلت او در حالش است.\nاما عزلت در قلبش: این است که با قلب خود از تعلق به هر یک از خلق خدا، اعم از خانواده، مال، فرزند، دوست و هر آنچه میان او و ذکر پروردگارش با قلبش حائل می‌شود، کناره‌گیری کند، حتی از خواطر خود. و نباید جز یک همّ داشته باشد و آن تعلق او به خداست.\nاما عزلت در حواسش: در ابتدای حالش، انقطاع از مردم و از عادات مألوف است؛ یا در خانه‌اش، یا با سیاحت در زمین خدا. اگر در شهری است، باید به گونه‌ای باشد که شناخته نشود، و اگر در شهر نیست، باید سواحل و کوه‌ها و مکان‌های دور از مردم را برگزیند.\nاگر وحوش با او انس گرفتند و به او متمایل شدند و خداوند آنها را به نفع او به سخن آورد و با او صحبت کردند یا نکردند، باید از وحوش و حیوانات نیز کناره‌گیری کند و از خدای تعالی بخواهد که او را به غیر خود مشغول نسازد. و باید بر ذکر خفی مداومت ورزد. اگر از حافظان قرآن است، باید هر شب حزبی از آن را در نماز خود بخواند تا آن را فراموش نکند. نباید اوراد و حرکات را زیاد کند، بلکه باید اشتغال خود را همیشه به قلبش بازگرداند. این باید روش و عادت او باشد.\n\nاما الصمت (سکوت): این است که با هیچ مخلوقی از وحوش و حشراتی که در سیاحت یا در محل عزلتش با او همراه شده‌اند، سخن نگوید. و اگر کسی از جن یا از ملأ اعلی بر او ظاهر شد، چشم خود را از آنها بپوشاند و خود را به گفتگو با آنها مشغول نسازد، حتی اگر با او سخن بگویند. اگر پاسخ دادن بر او فرض شد، به اندازه ادای فرض و بدون زیاده پاسخ دهد، و اگر فرض نشد، از آنها سکوت کند و به خود مشغول شود. زیرا آنها وقتی او را بر این حال ببینند، از او دوری می‌کنند و متعرضش نمی‌شوند و از او پنهان می‌گردند. چرا که می‌دانند هر کس مشغول به خدا را از اشتغالش به او باز دارد، خداوند او را به سخت‌ترین عقوبت مجازات می‌کند.\nاما صمت او در نفس خود از حدیث نفس: این است که نفس خود را به چیزی که امید دارد از خدا در این انقطاع به دست آورد، مشغول نسازد؛ زیرا این تلف کردن وقت در چیزی است که حاصل نمی‌شود، چرا که از آرزوهاست. و اگر نفس خود را به حدیث نفس عادت دهد، میان او و ذکر خدا در قلبش حائل می‌شود، زیرا قلب گنجایش حدیث و ذکر را به طور همزمان ندارد، و در نتیجه سببی که از عزلت و صمت او مطلوب است، یعنی ذکر خدای تعالی که آینه قلبش با آن جلا می‌یابد و تجلی (التجلی) پروردگارش برای او حاصل می‌شود، از دست می‌رود.\n\nاما الجوع (گرسنگی): عبارت است از کم خوردن غذا، به طوری که جز به اندازه‌ای که پشت او را برای عبادت پروردگارش در نماز فریضه راست نگه دارد، از آن نخورد. زیرا نماز نافله نشسته به دلیل ضعفی که از کمبود غذا به او دست می‌دهد، برای رسیدن به مرادش از خدا سودمندتر، بهتر و قوی‌تر است تا نیرویی که از غذا برای ادای نوافل ایستاده به دست می‌آورد. زیرا سیری، دعوت کننده به فضول (زیاده‌روی) است. وقتی شکم سیر شود، جوارح طغیان می‌کنند و در زیاده‌روی‌ها از حرکت، نگاه، شنیدن و سخن گفتن تصرف می‌کنند، و همه اینها موانعی برای او از رسیدن به مقصود هستند.\n\nاما السهر (بیدارخوابی): جوع آن را به وجود می‌آورد، به دلیل کمبود رطوبت و بخاراتی که خواب‌آور هستند، به ویژه نوشیدن آب که تماماً خواب است و شهوت آن کاذب است. فایده سهر، تیقظ (هوشیاری) برای اشتغال دائمی با خدا در آنچه در صدد آن است، می‌باشد. زیرا وقتی می‌خوابد، به عالم برزخ منتقل می‌شود، مطابق با آنچه بر آن خوابیده است و افزون نمی‌شود، و خیر بسیاری را از دست می‌دهد که جز در حال سهر نمی‌داند. و اگر به این (سهر) ملتزم شود، بیدارخوابی به عین القلب (چشم قلب) سرایت می‌کند و عین البصیرة (چشم بصیرت) با ملازمة الذکر (مداومت بر ذکر) جلا می‌یابد و از خیر آنچه خدا بخواهد می‌بیند.\nو در حصول این چهار (خصلت) که اساس المعرفة (معرفت) برای اهل الله هستند، حارث بن اسد محاسبی بیش از دیگران به آنها توجه کرده است، و آنها عبارتند از: معرفة الله (معرفت خدا)، معرفة النفس (معرفت نفس)، معرفة الدنیا (معرفت دنیا) و معرفة الشیطان (معرفت شیطان). برخی نیز معرفة الهوی (معرفت هوی) را به جای معرفة الله ذکر کرده‌اند و در این باره سروده‌اند:\n\nمن به چهار (چیز) مبتلا شده‌ام که *** با تیر از کمانی که زه دارد، مرا هدف قرار می‌دهند.\nابلیس و دنیا و نفس من و هوی (هوس) *** ای پروردگار، تو بر الخلاص (رهایی) قدیر (توانا) هستی.\n\nو دیگری گفته است:\n\nابلیس و دنیا و نفس من و هوی (هوس) *** چگونه الخلاص (رهایی) یابم در حالی که همه آنها دشمنان من هستند.\n\n[اعمال باطنی در راه خدا]\n\nاما در مورد پنج خصلت باطنی: زن صالحه، مریم بنت محمد بن عبدون بن عبدالرحمن البجائی، برایم نقل کرد که در خوابم شخصی را دیدم که در وقایع (مکاشفات) با من همراهی می‌کرد، در حالی که هرگز شخص او را در عالم حس ندیده بودم. او به من گفت: آیا قصد الطریق (طریقت) داری؟ گفتم: آری به خدا، قصد الطریق (طریقت) دارم، اما نمی‌دانم به واسطه چه چیزی. گفت: به واسطه پنج چیز، و آنها عبارتند از: التوکل (توکل)، الیقین (یقین)، الصبر (صبر)، العزيمة (عزم) و الصدق (صدق).\nاو رؤیای خود را بر من عرضه کرد و من به او گفتم: این مذهب القوم (این طایفه) است. و سخن در مورد آنها ان‌شاءالله تعالی در داخل کتاب خواهد آمد، زیرا برای هر یک از آنها باب‌های مخصوصی وجود دارد. همچنین چهار خصلتی که ذکر کردیم نیز در فصل دوم از فصول این کتاب، باب‌های مخصوص به خود را دارند.\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند).\nجزء بیست و ششم به پایان رسید."
  },
  "page_count": 2
}