{
  "id": 272,
  "title": {
    "ar": "الباب الثاني والسبعون ومائتان في معرفة منزل تنزيه التوحيد",
    "en": "Chapter Two Hundred and Seventy-Two: On the Gnosis of the Station (منزل) of the Transcendence (تنزيه) of Unity (التوحيد)",
    "ur": "باب دو سو بہتر (۲۷۲) توحید کے تنزیہ کی منزل کی معرفت کے بیان میں۔",
    "fa": "باب دویست و هفتاد و دوم در معرفت منزل تنزیه التوحید (تنزيه التوحيد)"
  },
  "content": {
    "ar": "## «الباب الثاني والسبعون ومائتان في معرفة منزل تنزيه التوحيد»\n\n\n> بتنزيه توحيد الإله أقول *** وذلك نور ما لديه أقول‏\n\n\n> وتنزيهه ما بين ذات ورتبة *** وإن الذي يدري به لقليل‏\n\n\n> تنزه عن تنزيه كل منزه *** فمن شاء قولا فليقل بيقول‏\n\n\n> فإن وجود الحق في حرف غيبه *** فحرف حضور ما عليه قبول‏\n\n\n### [أن المراد بلفظة تنزيه التوحيد أمران‏]\n\n\nاعلم أيدنا الله وإياك بروح منه أن المراد بلفظة تنزيه التوحيد أمران الواحد أن يكون التوحيد متعلق التنزيه لا الحق سبحانه والأمر الآخر أن يكون التنزيه مضافا إلى التوحيد على معنى أن الحق تعالى قد ينزه بتنزيه التوحيد إياه لا بتنزيه من نزهة من المخلوقين بالتوحيد مثل حمد الحمد فإن قيام الصفة بالموصوف ما فيها دعوى ولا يتطرق إليها احتمال والواصف نفسه أو غيره بصفة ما يفتقر إلى دليل على صدق دعواه فيتعلق بهذا فصول تدل عليها آيات من الكتاب منها هل يصح الإضمار قبل الذكر في غير ضرورة الشعر أم لا فالشاعر يقول‏\n\n\nجزى ربه عني عدي بن حاتم‏\n\n\nفأضمر قبل الذكر ولكن الشعر موضع الضرورة ومن فصول هذا المنزل‏\nالأمر بتوحيد الله فلا يكون فيه توحيد الحق نفسه ويتعلق به التقليد في التوحيد لأن الأمر لا يتعلق بمن يعطيه الدليل ذلك إلا أن يكون متعلق الأمر الاستدلال لا التعريف على طريق التسليم أو الاستدلال بالتنبيه على موضع الدلالة مثل قوله إِذاً لَذَهَبَ كُلُّ إِلهٍ بِما خَلَقَ وكقوله لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا وكقوله لَمْ يَلِدْ ولَمْ يُولَدْ ومن فصول هذا المنزل قوله تعالى ما اتَّخَذَ صاحِبَةً ولا وَلَداً لعدم الكفاءة إذ لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ فلو كانت الكفاءة موجودة لجاز ذلك قال عز وجل ولا تَنْكِحُوا الْمُشْرِكاتِ حَتَّى يُؤْمِنَّ فجعل الكفاءة بالدين وقوله لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً فجعله من قبيل الإمكان فقال لَاصْطَفى‏ والاصطفاء جعل والمجعول ينافي الكفاءة للجاعل وأين مرتبة الفاعل من المفعول ومن فصول هذا المنزل التنزيه أن يكون مدركا بالمقدمات التي تنتج وجوده أو المعرفة به تعالى الله عن ذلك علوا كبيرا ومن فصول هذا المنزل إنه لا يكون مقدمة لإنتاج شي‏ء للتركيب الذي يتصف به المقدمات والسبب الرابط في المقدمات فيستدعي المناسبة والمناسبة بين الخلق والحق غير معقولة ولا موجودة فلا يكون عنه شي‏ء من حيث ذاته ولا يكون عن شي‏ء من حيث ذاته وكل ما دل عليه الشرع أو اتخذه العقل دليلا إنما متعلقة الألوهة لا الذات والله من كونه إلها هو الذي يستند إليه الممكن لإمكانه فلنذكر ما يتعلق بفصول هذا المنزل على الاختصار إن شاء الله‏\n\n\n### [الحضرة الإلهية تنقسم إلى ثلاثة أقسام ذات وصفات وأفعال‏]\n\n\nاعلم أن هذا المنزل هو الرابع من منزل العظمة في حق أصحاب البدايات وهو الحادي عشر والعاشر ومائة في حق الأكابر الروحانيين ولما كانت الحضرة الإلهية تنقسم إلى ثلاثة أقسام ذات وصفات وأفعال كان هذا المنزل أحدها وهو الثالث منها ولما كانت الصفات على قسمين صفة فعل وصفة تنزيه كان هذا المنزل صفة التنزيه منهما فأما تنزيه التوحيد فهو أن هذا التوحيد الذي ننسبه إلى جناب الحق منزه أن ينسب إلى غير الحق فهو المنزه على الحقيقة لا الحق وإنما قلنا هذا لأنه يجوز أن يوصف به غير الحق فيما يعطيه اللفظ كما وقعت المشاركة في إطلاق لفظة الوجود والعلم والقدرة وسائر الأسماء في حق الحق والخلق فهذا المنزل ينزه هذا التوحيد المنسوب إلى الله أن يوصف به غيره فإنه توحيد الذات من جميع الوجوه ولا يوصف بهذا التوحيد غيره لا في اللفظ ولا في المعنى وكانت ذات الحق المنسوب إليها هذا التوحيد لا يتعلق بها تنزيه لأنه لا يجوز عليها فتبعد عن وصفها الذي يجوز عليها إذ كانت في نفس الأمر منزهة لا بتنزيه منزه وأما إذا كان تنزيه التوحيد متعلقة الحق سبحانه فيكون منزها من حيث ذاته بلسان عين هذا الوصف الذي هو التوحيد له كثناء لسان صفة الكرم بالكريم لقيامه به لا بقول القائل ودليل الناظر إنه سبحانه واحد فقد كان له هذا الوصف ولا أنت وله هذا الوصف وأنت أنت وإذا كان هذا الأمر على هذا الحد فما ثم موجود يصح أن يضمر قبل الذكر إلا من يستحق الغيب المطلق الذي لا يمكن أن يشهد بحال من الأحوال فيكون ضمير الغيب له كالاسم الجامد العلم للمسمى يدل عليه بأول وهلة من غير أن يحتاج إلى ذكر متقدم مقرر في نفس السامع يعود عليه هذا الضمير فلا يصح أن يقال هو إلا في الله خاصة فإذا أطلق على غير الله فلا يطلق إلا بعد ذكر متقدم معروف بأي وجه كان مما يعرف به فيقال هو وعين محل هذا الضمير مشهود عند من لا يصح أن يقال فيه هو لحضوره عنده فيزول عنه اسم الهو بالنظر إلى ذلك ويثبت له اسم الهو بالنظر إلى من غاب عنه فإن قيل إذا صح ما قررته فإنه سبحانه مشهود لنفسه فيزول عنه الهو بالنظر إلى شهوده نفسه فإذا الهو ليس له بمنزلة الاسم العلم كما زعمت قلنا وإن شهد نفسه فإن الهوية معلومة غير مشهودة وهي التي ينطلق عليها اسم الهو هذا على مذهبنا وهو مذهب أهل الحق كيف وثم طائفة تقول إنه لا يعلم نفسه فلا يزال الهو له منا ومنه قال تعالى في أول سورة الإخلاص لنبيه عليه السلام قُلْ هُوَ الله أَحَدٌ فابتدأ بالضمير ولم يجر له ذكر متقدم يعود عليه في نفس القرآن وإن كانت اليهود قد قالت له انسب لنا ربك فربما يتوهم صاحب اللسان أن هذا الضمير يعود على الرب الذي ذكرته اليهود ولتعلم إن هذا الضمير لا يراد به الرب الذي ذكرته اليهود لأن الله يتعالى أن يدرك معرفة ذاته خلقه ولذلك قال هُوَ الله وما ذكر في السورة كلها شيئا يدل على الخلق بل أودع تلك السورة التبري من الخلق فلم يجعل المعرفة به نتيجة عن الخلق فقال تعالى ولَمْ يُولَدْ ولم يجعل الخلق في وجوده نتيجة عنه كما يزعم بعضهم بأي نسبة كانت فقال تعالى لَمْ يَلِدْ\nونفى التشبيه بأحدية كل أحد بقوله ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ وأثبت له أحدية لا نكون لغيره وأثبت له الصمدانية وهي صفة تنزيه وتبرئة فارتفع إن يكون الضمير يعود على الرب المذكور المضاف إلى الخلق في قولهم له صلى الله عليه وسلم انسب لنا ربك فأضافوه إليه لا إليهم ولما نسبه صلى الله عليه وسلم بما أنزل عليه لم يضفه لا إليه ولا إليهم بل ذكره بما يستحقه جلاله فإذا ليس الضمير في هو الله يعود على من ذكر وأين المطلق من المقيد فهوية المقيد ليست هوية المطلق فهوية المقيد نسبة تتعلق بالكون فتتقيد به إذ تقيد الكون بها فيقال خالق ومخلوق وقادر ومقدور وعالم ومعلوم ومريد ومراد وسميع ومسموع وبصير ومبصر ومكلم ومكلم والحي ليس كذلك فهو هويته لا تعلق له بالكون وليس القيوم كذلك فإذا عرفت ما ذكرناه عرفت أن الإضمار قبل الذكر لا يصح إلا على الله وبعد الذكر تقع فيه المشاركة قال تعالى الله الَّذِي لا إِلهَ إِلَّا هُوَ فأعاد الضمير على الله المذكور في أول الآية\n\n\n### [أن التوحيد الذي يؤمر به العبد غير التوحيد الذي يوحد الحق به نفسه‏]\n\n\nواعلم أن التوحيد الذي يؤمر به العبد أن يعلمه أو يقوله ليس هو التوحيد الذي يوحد الحق به نفسه فإن توحيد الأمر مركب فإن المأمور بذلك مخلوق ولا يصدر عن المخلوق إلا ما يناسبه وهو مخلوق عن مخلوق فهو أبعد في الخلق عن الله من الذي وجد عنه هذا التوحيد\n\n\nعلى كل مذهب من نفاة الأفعال عن المخلوقين ومثبتيها لأن النفاة قائلون بالكسب وغير النفاة قائلون بالإيجاد فكيف يليق بالجناب العزيز ما هو مضاف إلى الخلق وإن كنا تعبدنا به شرعا فنقرره في موضعه ونقوله كما أمرنا به على جهة القربة إليه مع ثبوت قدمنا فيما أشهدنا الحق من المعرفة به من كونه لا يعرف في لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وفيما ذكره في سورة الإخلاص وفي عموم قوله بالتسبيح الذي هو التنزيه رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ والعزة تقتضي المنع أن يوصل إلى معرفته ومن أسرار هذا المنزل قوله لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً فإن كان لو حرف امتناع ولكنه امتناع شي‏ء لامتناع غيره فهو عدم لعدم فإذا جاء حرف لا بعد لو كان لو حرف امتناع لوجود ولم يأت في هذه الآية لا فنفى الإرادة أن تتعلق باتخاذ الولد ولم يقل إن يلد ولدا فإنه يقول لَمْ يَلِدْ والولد المتخذ يكون موجود العين من غير أن يكون ولدا فيتبنى بحكم الاصطفاء والتقريب في المنزلة أن ينزله من نفسه منزلة الولد من الوالد الذي يكون له عليه ولادة والحقيقة تمنع من الولادة والتبني لأن النسبة مرتفعة عن الذات والنسبة الإلهية من الله لجميع الخلق نسبة واحدة لا تفاضل فيها إذا لتفاضل يستدعي الكثرة فلهذا أتى بلفظة لو ولم يجعل بعدها لفظة لا فكان حرف امتناع أي لم يقع ذلك ولا يقع لامتناع الذات إن توصف بما لا تستحقه ولهذا قال ما اتَّخَذَ صاحِبَةً ولا وَلَداً بعد قوله تعالى وأَنَّهُ تَعالى‏ جَدُّ رَبِّنا فوصفه بالعلو عن قيام هذا الوصف لعظمة الرب المضاف إلى المربوب بالذكر فكيف بالرب من غير إضافة لفظية فكيف بالاسم الله فكيف بالذات من غير اسم فأعظم من هذا التنزيه ما يكون وأما نفي الكفاءة والمثل فربما يتوهم من لا معرفة له بالحقائق أنه لو وجدت الكفاءة جاز وقوع الولد بوجود الصاحبة التي هي كفؤ فليعلم إن الكفاءة مشروعة لا معقولة والشرع إنما لزمها من الطرف الواحد لا من الطرفين فمنع المرأة أن تنكح ما ليس لها بكف‏ء ولم يمنع الرجل أن ينكح ما ليس بكف‏ء له ولهذا له أن ينكح أمته بملك اليمين وليس للمرأة أن ينكحها عبدها والحق ليس بمخلوق وهو الوالد لو كان له ولد والكفاءة من جهة الصاحبة لا تلزم فارتفع المانع لوجود الولد لا لعدم الكفاءة بل لما تستحقه الذات من ارتفاع النسب والنسب ولما تستحقه أحدية الألوهة إذا لولد شبيه بأبيه فبطل مفهوم من حمل ما اتَّخَذَ صاحِبَةً ولا وَلَداً على جواز ذلك إذ كان متخذا وكان المفهوم منه ومن نفي الكف‏ء والمثل ما ذكرناه ولما كان التنزيه للذات على ما قررناه بطل أن تكون المعرفة به القائمة بنا نتيجة عن معرفتنا بنا لاستنادنا إليه من حيث إمكاننا وإن ذلك لا يتضمن معرفة ذاته بالصفة الثبوتية النفسية التي هو عليها بالأصح من ذلك إلا الاستناد لذات منزهة عما ينسب إلينا مجهولة عندنا ما ينسب إليها من حيث نفسيتها فلا يعرف سبحانه أبدا وإذا كانت المعرفة به من النزاهة والعلو بهذا الحد فأحرى إن يكون وجوده معلولا لعلة تتقدمه في الرتبة أو مشروطا بشرط متقدم أو محققا لحقيقة حاكة أو مدلولا لدليل يربطه به وجه ذلك الدليل فلا جامع سبحانه بيننا وبينه من هذه الجوامع الأربعة فالتحقت المعرفة به منا بوجوده في النزاهة والرفعة عن الإدراك لها وكما لم يصح أن ينتجه شي‏ء فلا تكون هويته أيضا من حيث هويته لا من حيث مرتبته تنتج شيئا إذ لو ارتبط به شي‏ء من حيث هويته لارتبطت‏\nهويته بذلك الشي‏ء فلا يصح أن يكون علة لمعلول ولا شرطا لمشروط ولا حقيقة لمحقق ولا دليلا لمدلول ولا سيما وقد قال سبحانه لَمْ يَلِدْ مطلقا وما قيد فلو كان حقيقة لولد محققا ولو كان دليلا لولد مدلولا ولو كان علة لولد معلولا ولو كان شرطا لولد مشروطا فهو سبحانه المستند المجهول الذي لا تدركه العقول ولا تفصل إجماله الفصول فهذا أيضا وجه من وجوه تنزيه التوحيد وأما ما يتعلق بالواحد والأحد من التوحيد في أحديته فإن لفظ الأحدية جاءت ثابتة الإطلاق على من سواه فقال ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً وإن كان المفهوم منه بالنظر إلى تفسير المعاني على طريق أهل الله أنه لا يعبد من حيث أحديته لأن الأحدية تنافي وجود العابد فكأنه يقول لا يعبد إلا الرب من حيث ربوبيته فإن الرب أوجدك فتعلق به وتذلل له ولا تشرك الأحدية مع الربوبية في العبادة فتتذلل لها كما تتذلل للربوبية فإن الأحدية لا تعرفك ولا تقبلك فيكون تعبد في غير معبد وتطمع في غير مطمع وتعمل في غير معمل وهي عبادة الجاهل فنفى عبادة العابدين من التعلق بالأحدية فإن الأحدية لا ثبت إلا لله مطلقا وأما ما سوى الله فلا أحدية له مطلقا فهذا هو المفهوم من هذه الآية عندنا من حيث طريقنا في تفسير القرآن ويأخذ أهل الرسوم من ذلك قسطهم أيضا تفسيرا للمعنى فيحملون الأحد المذكور على ما اتخذوه من الشركاء وهو تفسير صحيح أيضا فالقرآن هو البحر الذي لا ساحل له إذ كان المنسوب إليه يقصد به جميع ما يطلبه الكلام من المعاني بخلاف كلام المخلوقين وإذا علمت هذا علمت المراد بقوله جل ثناؤه لنبيه عليه السلام قُلْ هُوَ الله أَحَدٌ أي لا يشارك في هذه الصفة وأما الواحد فإنا نظرنا في القرآن هل أطلقه على غيره كما أطلق الأحدية فلم أجده وما أنا منه على يقين فإن كان لم يطلقه فهو أخص من الأحدية ويكون اسما للذات علما لا يكون صفة كالأحدية فإن الصفة محل الاشتراك ولهذا أطلقت لاحدية على كل ما سوى الله في القرآن ولا يعتبر كلام الناس واصطلاحهم وإنما ينظر ما ورد في القرآن الذي هو كلام الله فإن وجد في كلام الله لفظ الواحد كان حكمه حكم لاحدية للاشتراك اللفظي فيه وإن كان لا يوجد في كلام الله لفظ الواحد يطلق على الغير فيلحقه بخصائص ما تستحقه الذات ويكون كالاسم الله الذي لم يتسم به أحد سواه ومما يتعلق بهذا المنزل من التنزيه الخاص به ما يحصل من المعارف التي ذكرناها في كتاب مواقع النجوم في التجلي الصمداني ولا نريد بذلك ما أراد العارف أبو عبد الله البستي في كتابه الذي جعله في عبد الرب وعبد الصمد فإن الصمد الذي نريده لا يضاف ولا يضاف إليه فإن المتضايفين لا بد أن يكون لهما بينية فيكون بينهما نسبة رابطة بها يصح أن تكون الإضافة محققة لهما فالصمد الذي أراده البستي بعبد الصمد هو الذي يلجأ إليه ويتعلق به ويقابل بالتوجه ولهذا نهت الشريعة للمصلي إذا استتر بأصطوانة أو عصا أو مؤخرة رحل أو ما هو مثلها أن يصمد إليها صمدا ولكن ينحرف عنها قليلا يمينا أو شمالا وليس من أوصاف التنزيه من يصمد إليه ولكنه من أوصاف الكرم فالصمدية المطلقة عن هذا التقييد هي التي تستحق أن تكون صفة تنزيه إذ لا تعلق للكون بها وهي المطلوبة في هذا المنزل وشرحها في اللغة مذكور الأسماء الإلهية\n\n\n### [أن منزل تنزية التوحيد يطلب الأحدية]\n\n\nواعلم أن هذا المنزل وإن كان يطلب الأحدية والتنزيه من جميع الوجوه فإنه يظهر في الكشف الصوري المقيد بالظاهر كالبيت القائم على خمسة أعمدة عليها سقف مرفوع محيط به حيطان لا باب فيها مفتوح فليس لأحد فيه دخول بوجه من الوجوه لكن خارج البيت عمود قائم ملصق إلى حائط البيت يتمسح به أهل الكشف كما يقبلون ويتمسحون بالحجر الأسود الذي جعله الله خارج البيت وجعله يمينا له وأضافه إليه لا إلى البيت كذلك هذا العمود لا يضاف إلى هذا المنزل وإن كان منه إلا أنه ليس هو خاصا به فإنه موجود في كل منزل إلهي وكأنه ترجمان بيننا وبين ما تعطيه المنازل من المعارف وقد نبه على ذلك ابن مسرة الجبلي في كتاب الحروف له وهذا العمود له لسان فصيح يعبر لنا عما تحويه المنازل فنستفيد منه علم ذلك ومن المنازل ما ندخل فيه ونمشي في زواياه فنجد الأمر على حد ما عرفناه فيه ومن المنازل ما لا سبيل لنا إلى الدخول فيه مثل هذا المنزل فنأخذ من هذا العمود التعريف بحكم التسليم فإنه قد قام الدليل لنا على عصمته فيما يخاطبنا به في عالم الكشف كالرسول في عالم الحس فهو لسان حق ومن الناس من يلحقه بأعمدة البيت فإن بعض الحائط عليه ولا يظهر لنا منه إلا وجه واحد وسائره مستور في الحائط فيقول بعض المكاشفين إن البيت قائم على ستة أعمدة فلا تناقض بين مثبتي الخمسة والستة\nفي قيام البيت عليها فقد بينا لك ذلك حتى لا تتخيل أن الحق في أحد القولين ومع إحدى الطائفتين فكل طائفة منهما صادقة فلهذا أخبرتك بكيفية ذلك وهكذا جميع ما يظهر للناس أنهم اختلفوا فيه فليس بين القوم بحمد الله خلاف فيما يتحققون به بل هم في شغلهم أصح وأحق من أهل الحس فيما يدركونه بحواسهم واعلم أن الدخول لهذا المنزل من الدينار الثاني الذي للرجولية والنهاية فيه إلى الدينار الرابع وهو تمام الرجولية التي بها يسمى الشخص رجلا كما قد قدمناه في ترتيب الايمان والولاية والنبوة والرسالة ولا خامس لها يكون خامس خمسة بل قد يكون لها خامس أربعة فاعلم ذلك وإذا تفطنت إلى ما فصله الحق تعالى عرفت أنت تفصيله فيما أجمله في قوله ولا أَدْنى‏ من ذلِكَ يعني الاثنين ولا أَكْثَرَ يعني السبعة فما فوقها من الأفراد ففصل الحق بقوله ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ ولم يقل ولا أربعة إلا هو خامسهم فعرفنا من أدنى ذلك وأكثر أنه يريد الأفراد يشفعها بما ليس منها فتحققنا إن الغيرة حكمت هنا فلم تثبت لأحد فردية إلا شفعتها هوية الحق حتى لا تكون الأحدية إلا له فلا يشفع فرديته مخلوق ويشفع هو فردية المخلوقين ولذلك قال وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ ولم يقل وأنتم معه لأنه مجهول المصاحبة فيعلم سبحانه كيف يصحبنا ولا نعرف كيف نصحبه فالمعية له ثابتة فينا منفية عنا فيه فلم يقل ولا أربعة إلا هو خامسهم ولا اثنين إلا هو ثالثهما لأن الغيرة لا تتعلق بالشفعية في الأكوان لأن الشفع لها حقيقة وإنما تتعلق بالوترية إذا نسبت إلى الأكوان وهي لا تستحقها فنوترها بالحق ليكون الظهور له تعالى في الأشياء وهذا من أقوى الدلائل على وصفه تعالى بالغيرة لأنها مشتقة من رؤية الغير لأنه يستدعي المشاركة والله بري‏ء من مشاركة الغير فهو بري‏ء أن يكون غير الأحد أو يكون أحد غير إله‏\n\n\nقال صلى الله عليه وسلم لا أحد أو كما قال أغير من الله‏\n\n\nفوصفه بالغيرة وحكمها في هذا المقام قوي فهذا قد ذكرنا نبذا مما يعطيه هذا المنزل على ضيق الوقت والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ وفي هذا المنزل من العلوم علم الأحدية والفرق بينها وبين الوحدانية وعلم النسب الإلهي‏\n\n\nيقول الله تعالى يوم القيامة اليوم أضع نسبكم وأرفع نسبي أين المتقون‏\n\n\nوعلم البسائط والعلم الضروري وعلم التماثل والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ‏\n\n",
    "en": "## Chapter Two Hundred and Seventy-Two: Concerning the Knowledge of the Station of the Transcendence of Unity (تنزيه التوحيد)\n\n> I speak by the transcendence of the Unity of the God,\n> And that is the Light concerning which I speak.\n\n> And His transcendence is between Essence (ذات) and Level (رتبة),\n> And indeed, those who know this are few.\n\n> He is transcendent beyond the transcendence of every transcender,\n> So whoever wills a saying, let him speak with sayings.\n\n> For the Existence (وجود) of the Real (الحق) is in the letter of His Unseen,\n> So the letter of presence has no acceptance upon it.\n\n### [That the term ‘Transcendence of Unity (تنزيه التوحيد)’ refers to two matters]\n\nKnow—may Allah support us and you with a Spirit from Him—that the term ‘Transcendence of Unity (تنزيه التوحيد)’ refers to two matters. The first is that Unity (التوحيد) is the object of transcendence, not the Real (الحق) exalted is He. The second matter is that transcendence is attributed to Unity, meaning that the Real, exalted is He, is transcendent by the transcendence of His own Unity, not by the transcendence of any creature who attempts to transcend Him through Unity. This is like the praise of praise (حمد الحمد), for the establishment of the Attribute in the qualified subject involves no claim and admits no possibility of doubt. However, the one who describes himself or another with an attribute requires proof of the truth of his claim. Related to this are chapters indicated by verses from the Book, including the question of whether it is permissible to use a pronoun before mentioning the noun (الإضمار قبل الذكر) outside the necessity of poetry. The poet says:\n\n> جزى ربه عني عدي بن حاتم‏\n> *May his Lord reward ‘Adī ibn Ḥātim on my behalf.*\n\nHe used the pronoun (his Lord) before mentioning the noun (‘Adī), but poetry is a place of necessity.\n\nAmong the chapters of this Station is the command to unify Allah (توحيد الله), which means it is not the Real unifying Himself. Related to this is blind following (التقليد) in Unity, because the command does not relate to one who is given the proof, unless the object of the command is the demonstration of proof (الاستدلال) itself, rather than mere acceptance through submission (التسليم), or demonstration through drawing attention to the point of evidence, such as His saying: <<إِذاً لَذَهَبَ كُلُّ إِلهٍ بِما خَلَقَ>> (Then each god would have taken away what he created), and His saying: <<لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا>> (Had there been in them [heaven and earth] gods besides Allah, they would surely have been corrupted), and His saying: <<لَمْ يَلِدْ ولَمْ يُولَدْ>> (He neither begets nor is begotten).\n\nAmong the chapters of this Station is His saying, exalted is He: <<ما اتَّخَذَ صاحِبَةً ولا وَلَداً>> (He has taken neither a consort nor a son) due to the absence of parity (الكفاءة), since <<لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ>> (There is none comparable to Him). If parity were present, that would have been permissible. He, mighty and majestic, said: <<ولا تَنْكِحُوا الْمُشْرِكاتِ حَتَّى يُؤْمِنَّ>> (And do not marry polytheist women until they believe), thus making parity dependent on religion. And His saying: <<لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً>> (Had Allah intended to take a son), He placed it in the category of possibility, saying: <<لَاصْطَفى‏>> (He would have chosen). Choosing (الاصطفاء) is an act of making (جعل), and what is made contradicts parity with the Maker. And where is the level of the Agent (الفاعل) compared to the effect (المفعول)?\n\nAmong the chapters of this Station is that Transcendence (التنزيه) cannot be grasped by premises that result in His Existence (وجوده) or Gnosis (المعرفة) of Him—exalted is Allah far above that!\n\nAmong the chapters of this Station is that He cannot be a premise for the production of anything, due to the composition (التركيب) that characterizes premises and the connecting cause (السبب الرابط) within them. This necessitates suitability (المناسبة), and suitability between Creation (الخلق) and the Real (الحق) is neither conceivable nor existent. Therefore, nothing proceeds from Him in terms of His Essence (ذاته), nor does He proceed from anything in terms of His Essence. Everything indicated by the Sacred Law (الشرع) or taken by the intellect as proof relates only to Divinity (الألوهة), not the Essence (الذات). And Allah, by virtue of being God, is that upon which the contingent relies due to its contingency. Let us now mention briefly what relates to the chapters of this Station, if Allah wills.\n\n### [The Divine Presence (الحضرة الإلهية) is divided into three sections: Essence, Attributes, and Acts]\n\nKnow that this Station is the fourth from the Station of Magnificence (العظمة) for those at the beginning, and the one hundred and eleventh for the great spiritual masters (الأكابر الروحانيين). Since the Divine Presence (الحضرة الإلهية) is divided into three sections—Essence (ذات), Attributes (صفات), and Acts (أفعال)—this Station is one of them, being the third. And since the Attributes are of two kinds—Attributes of Act and Attributes of Transcendence (تنزيه)—this Station is the Attribute of Transcendence among them.\n\nAs for the Transcendence of Unity (تنزيه التوحيد), it means that this Unity which we attribute to the Divine Presence is transcendent from being attributed to anything other than the Real (الحق). Thus, Unity is the truly transcendent thing, not the Real Himself. We say this because it is permissible for something other than the Real to be described by Unity in what the term conveys, just as there is a linguistic sharing in the application of the terms Existence (الوجود), Knowledge (العلم), Power (القدرة), and all other Names, both to the Real and to creation. This Station, therefore, transcends this Unity attributed to Allah from being described by anything else, for it is the Unity of the Essence (توحيد الذات) in all respects, and nothing else is described by this Unity, neither in wording nor in meaning.\n\nThe Essence of the Real (ذات الحق) to which this Unity is attributed is not subject to transcendence, because transcendence is not permissible for Him such that He would be removed from a description permissible for Him, since He is, in reality, transcendent not by the transcendence of a transcender.\n\nHowever, if the Transcendence of Unity relates to the Real, exalted is He, then He is transcendent in terms of His Essence by the tongue of this very description, which is Unity for Him, like the praise of the tongue of the Attribute of Generosity (الكرم) for the Generous (الكريم) due to its establishment in Him, not by the saying of a speaker or the proof of a contemplator. He, exalted is He, is One, and this description belonged to Him even without you, and this description belongs to Him while you are you.\n\nIf this matter is of this nature, then there is no existent thing for which the pronoun before the noun (الإضمار قبل الذكر) is valid, except for the one who deserves Absolute Unseenness (الغيب المطلق), who cannot be witnessed under any circumstances. Thus, the pronoun of the Unseen (ضمير الغيب) is for Him like a proper noun (الاسم الجامد العلم) for the named, indicating Him at the first instance without needing a preceding mention established in the listener’s mind to which this pronoun refers. Therefore, it is not valid to say *He* (هو) except specifically for Allah. If it is applied to anything other than Allah, it is only applied after a preceding mention known by whatever means it is known, and then *He* (هو) is said.\n\nThe very locus of this pronoun is witnessed by those for whom it is not valid to say *He* (هو) due to His presence with them. Thus, the name *He* (الهو) vanishes from Him when viewed by them, but the name *He* (الهو) is established for Him when viewed by those from whom He is absent. If it is said that if what you have established is correct, then He, exalted is He, is witnessed by Himself, and thus the *He* vanishes from Him when viewed by His witnessing Himself, meaning *He* is not for Him in the position of a proper noun as you claimed, we reply: Even if He witnesses Himself, the Ipseity (الهوية) is known but not witnessed, and it is that upon which the name *He* (الهو) is applied. This is according to our doctrine, which is the doctrine of the People of the Real (أهل الحق).\n\nHow can this be, when there is a group that says He does not know Himself? Thus, the *He* remains for Him, both from us and from Him. Allah, exalted is He, said in the beginning of Sūrat al-Ikhlāṣ to His Prophet, peace be upon him: <<قُلْ هُوَ الله أَحَدٌ>> (Say: He is Allah, [the] Single). He began with the pronoun (هو) without a preceding mention in the Qur’an to which it refers, even though the Jews had said to him, \"Describe your Lord to us.\" A linguist might imagine that this pronoun refers back to the Lord mentioned by the Jews. But know that this pronoun is not intended to refer to the Lord mentioned by the Jews, because Allah is too exalted for His creation to grasp the Gnosis (معرفة) of His Essence. That is why He said: <<هُوَ الله>> (He is Allah). Nothing in the entire Sūrah indicates creation; rather, that Sūrah contains the disavowal of creation. He did not make Gnosis of Him a result of creation, saying, exalted is He: <<ولَمْ يُولَدْ>> (Nor is He begotten). Nor did He make creation a result of His Existence, as some claim, by any relation whatsoever, saying, exalted is He: <<لَمْ يَلِدْ>> (He neither begets).\n\nHe negated resemblance by the Singleness (أحدية) of every one, saying: <<ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ>> (And there is none comparable to Him). He established for Himself a unique Singleness (أحدية) that belongs to no other, and He established for Himself the Quality of Self-Sufficiency (الصمدانية)—a quality of transcendence and disavowal. Thus, the pronoun cannot refer back to the Lord mentioned and attributed to creation in their saying to him, peace be upon him, \"Describe your Lord to us,\" for they attributed Him to the Prophet, not to themselves. When the Prophet, peace be upon him, described Him according to what was revealed to him, he attributed Him neither to himself nor to them, but mentioned Him with what His Majesty deserves. Therefore, the pronoun in <<هُوَ الله>> does not refer back to the one mentioned. And where is the Absolute (المطلق) compared to the restricted (المقيد)? The Ipseity (هوية) of the restricted is not the Ipseity of the Absolute. The Ipseity of the restricted is a relation connected to the cosmos (الكون) and is restricted by it, as the cosmos is restricted by it. Thus, one says Creator and created, Powerful and empowered, Knowing and known, Willing and willed, Hearing and heard, Seeing and seen, Speaker and spoken to. The Living (الحي) is not like that; His Ipseity has no connection to the cosmos. Nor is the Self-Subsisting (القيوم) like that.\n\nIf you have understood what we have mentioned, you know that the use of a pronoun before the noun (الإضمار قبل الذكر) is valid only for Allah. After the noun is mentioned, participation occurs. Allah, exalted is He, said: <<الله الَّذِي لا إِلهَ إِلَّا هُوَ>> (Allah, there is no god except Him), thus referring the pronoun back to Allah, who was mentioned at the beginning of the verse.\n\n### [That the Unity commanded to the servant is different from the Unity by which the Real unifies Himself]\n\nKnow that the Unity (التوحيد) that the servant is commanded to know or utter is not the Unity by which the Real unifies Himself. For the commanded Unity is composite (مركب), since the one commanded is a creature (مخلوق), and nothing proceeds from the creature except what is suitable for it. Being a creature derived from a creature, it is further removed in creation from Allah than that from which this Unity originated—\n\n—according to every doctrine, whether of those who negate acts from creatures or those who affirm them, because the negators affirm acquisition (الكسب), and the non-negators affirm origination (الإيجاد). How can what is attributed to creation be suitable for the Glorious Presence (الجناب العزيز)? Even though we are obligated by the Sacred Law to perform it, we establish it in its proper place and utter it as commanded, as a means of drawing near to Him, while maintaining our firm footing in the Gnosis (المعرفة) with which the Real has graced us: that He is not known in <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (Nothing is like Him), and in what He mentioned in Sūrat al-Ikhlāṣ, and in the generality of His saying concerning glorification (التسبيح), which is transcendence: <<رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Lord of Might, [exalted] above what they describe). Might (العزة) necessitates the prevention of reaching Gnosis of Him.\n\nAmong the secrets of this Station is His saying: <<لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً>> (Had Allah intended to take a son). Although *law* (لو) is a particle of impossibility (حرف امتناع), it signifies the impossibility of one thing due to the impossibility of another—it is a non-existence due to a non-existence. If the particle *lā* (لا) follows *law*, then *law* is a particle of impossibility due to existence. But *lā* does not appear in this verse. Thus, He negated the intention (الإرادة) from relating to the taking of a son, and He did not say *if He were to beget a son*, for He says: <<لَمْ يَلِدْ>> (He neither begets).\n\nThe adopted son (الولد المتخذ) would be an existent entity (موجود العين) without being a begotten son, and would be adopted by virtue of selection (الاصطفاء) and proximity in rank, so that He would place him in the position of a son to a father who has begotten him. But Reality (الحقيقة) prevents both begetting and adoption, because relation (النسبة) is elevated above the Essence (الذات). The Divine relation (النسبة الإلهية) from Allah to all creation is a single relation in which there is no differentiation, for differentiation necessitates multiplicity (الكثرة).\n\nFor this reason, He used the word *law* (لو) and did not follow it with *lā* (لا). Thus, it was a particle of impossibility—meaning that did not happen and will not happen—due to the impossibility of the Essence being described by what it does not deserve. That is why He said: <<ما اتَّخَذَ صاحِبَةً ولا وَلَداً>> (He has taken neither a consort nor a son) after His saying, exalted is He: <<وأَنَّهُ تَعالى‏ جَدُّ رَبِّنا>> (And that He—exalted is the Majesty [جد] of our Lord). He described Himself with elevation above the establishment of this description, due to the Magnificence of the Lord (الرب) attributed to the creature (المربوب) by mention. How much more so for the Lord without a verbal attribution? How much more so for the Name Allah? How much more so for the Essence without a Name? What greater transcendence can there be than this?\n\nAs for the negation of parity (الكفاءة) and likeness (المثل), one who lacks Gnosis of the Realities might imagine that if parity existed, the occurrence of a son would be permissible through the existence of a consort who is a peer. Let him know that parity is prescribed (مشروعة), not rationally conceivable (معقولة). The Sacred Law only made it binding from one side, not both. It forbade the woman from marrying one who is not her peer, but it did not forbid the man from marrying one who is not his peer. That is why he may marry his slave woman by right of ownership, but the woman may not marry her slave. The Real is not a creature, and He would be the Begetter if He had a son. Parity is not binding from the side of the consort. Thus, the impediment to having a son is removed, not due to the absence of parity, but due to what the Essence deserves: the elevation above relations and lineages (النسب والنسب). And due to what the Singleness (أحدية) of Divinity deserves, for a son resembles his father. Thus, the understanding of those who interpreted <<ما اتَّخَذَ صاحِبَةً ولا وَلَداً>> as implying the permissibility of adoption is nullified. The true meaning derived from this and from the negation of peer and likeness is what we have mentioned.\n\nSince the transcendence of the Essence is as we have established, it is nullified that the Gnosis of Him established in us is a result of our Gnosis of ourselves, based on our reliance upon Him due to our contingency. This reliance does not entail Gnosis of His Essence by the essential self-subsisting Attribute (الصفة الثبوتية النفسية) upon which He truly is, except for reliance upon a transcendent Essence, unknown to us, regarding what is attributed to it in terms of its Ipseity. Thus, He is never known.\n\nIf Gnosis of Him is of this degree of purity and elevation, then it is even more fitting that His Existence should not be caused by a cause preceding Him in rank, or conditioned by a prior condition, or realized by a defining reality (حقيقة حاكة), or indicated by a proof that connects Him to the face of that proof. There is no connector (جامع), exalted is He, between us and Him among these four connectors. Thus, our Gnosis of Him is joined with His Existence in transcendence and elevation above comprehension.\n\nJust as it is not valid for anything to produce Him, His Ipseity (هويته)—in terms of His Ipseity, not His rank—cannot produce anything either. For if anything were connected to Him in terms of His Ipseity, His Ipseity would be connected to that thing. Therefore, it is not valid for Him to be a cause for an effect, a condition for a conditioned thing, a reality for a realized thing, or a proof for a proven thing. Especially since He, exalted is He, said: <<لَمْ يَلِدْ>> (He neither begets) absolutely, without restriction. If He were a reality, He would beget a realized thing. If He were a proof, He would beget a proven thing. If He were a cause, He would beget an effect. If He were a condition, He would beget a conditioned thing. He, exalted is He, is the Unknown Support (المستند المجهول) that intellects cannot grasp, nor can chapters detail His generality. This is also one of the aspects of the Transcendence of Unity (تنزيه التوحيد).\n\nAs for what relates to the One (الواحد) and the Single (الأحد) concerning Unity in His Singleness (أحديته): the term Singleness (الأحدية) is found to be applied absolutely to others besides Him, as He said: <<ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً>> (And let him not associate anyone [أحداً] in the worship of his Lord). Although the meaning understood from this, according to the interpretation of meanings by the People of Allah (أهل الله), is that one should not worship Him in terms of His Singleness (أحديته), because Singleness negates the existence of the worshipper. It is as if He says: Worship only the Lord (الرب) in terms of His Lordship (ربوبيته), for the Lord brought you into existence, so cling to Him and humble yourself before Him. Do not associate Singleness with Lordship in worship, humbling yourself before it as you humble yourself before Lordship, for Singleness neither knows you nor accepts you. This would be worship in a place that is not worshipped, seeking hope where there is no hope, and acting in a place that is not acted upon—it is the worship of the ignorant. Thus, He negated the worship of worshippers from clinging to Singleness, for Singleness is established absolutely only for Allah. As for everything other than Allah, it has no absolute Singleness. This is the meaning understood from this verse according to our method of Qur’anic exegesis. The people of external forms (أهل الرسوم) also take their share of this interpretation of the meaning, applying the mentioned *aḥad* (anyone) to the partners they have taken, and this is also a correct interpretation. The Qur’an is the shoreless ocean, since the one to whom it is attributed intends by it all the meanings that speech requires, unlike the speech of creatures.\n\nIf you know this, you know the meaning of His saying, glorious is His praise, to His Prophet, peace be upon him: <<قُلْ هُوَ الله أَحَدٌ>> (Say: He is Allah, [the] Single)—meaning, He is not shared in this Attribute.\n\nAs for the One (الواحد), we have examined the Qur’an to see if He applied it to others, as He applied Singleness (الأحدية), but I did not find it, and I am not certain about this. If He did not apply it, then it is more specific than Singleness and would be a proper Name (اسم علم) for the Essence, not an Attribute like Singleness, for the Attribute is a locus of sharing. That is why Singleness was applied to everything other than Allah in the Qur’an. The speech and terminology of people are not considered; rather, one looks at what is contained in the Qur’an, which is the Word of Allah. If the word *al-Wāḥid* (The One) is found in the Word of Allah applied to others, its ruling would be the same as Singleness due to the linguistic sharing. But if the word *al-Wāḥid* is not found in the Word of Allah applied to others, then it is attached to the specific characteristics deserved by the Essence, and it becomes like the Name Allah, which no one else has been named with.\n\nAmong the specific transcendence related to this Station is the knowledge we mentioned in the book *Mawāqi‘ al-Nujūm* concerning the Self-Sufficient Theophany (التجلي الصمداني). We do not mean by this what the Gnostic Abū ‘Abd Allāh al-Bastī intended in his book concerning the servant of the Lord (*‘Abd al-Rabb*) and the servant of the Self-Sufficient (*‘Abd al-Ṣamad*). For the Self-Sufficient (الصمد) that we intend is neither attributed nor attributed to. For correlatives (المتضايفين) must necessarily have an intermediate state (بينية), so that there is a connecting relation between them by which the attribution is validly realized for both. The *Ṣamad* intended by al-Bastī in *‘Abd al-Ṣamad* is the one sought for refuge and clung to, and who is met with attention. That is why the Sacred Law forbade the worshipper, when veiled by a pillar, a staff, the back of a saddle, or the like, from facing it directly (*ṣamdan*), but rather to turn slightly away from it, right or left. The one who is faced directly is not among the descriptions of transcendence, but rather among the descriptions of generosity. The Absolute Self-Sufficiency (الصمدية المطلقة) free from this restriction is what deserves to be an Attribute of Transcendence, since the cosmos has no connection to it, and this is what is sought in this Station. Its linguistic explanation is mentioned in the Divine Names.\n\n### [That the Station of the Transcendence of Unity seeks Singleness (Aḥadiyya)]\n\nKnow that although this Station seeks Singleness (الأحدية) and Transcendence (التنزيه) in all respects, it appears in the formal Unveiling (الكشف الصوري) restricted by the manifest, like a House standing on five pillars (أعمدة) with a raised roof, surrounded by walls with no open door. Thus, no one can enter it in any way. However, outside the House stands a pillar attached to the wall of the House, which the People of Unveiling (أهل الكشف) touch, just as they kiss and touch the Black Stone (الحجر الأسود) which Allah placed outside the House and made it His Right Hand, attributing it to Himself, not to the House. Likewise, this pillar is not attributed to this Station, even though it is part of it, except that it is not exclusive to it, for it exists in every Divine Station. It is like an interpreter between us and the Gnosis that the Stations bestow. Ibn Masarra al-Jabalī drew attention to this in his Book of Letters. This pillar has an eloquent tongue that expresses to us what the Stations contain, so we benefit from the knowledge of that.\n\nAmong the Stations are those we enter and walk in their corners, finding the matter exactly as we knew it therein. And among the Stations are those we have no way of entering, like this Station. So, we take the definition from this pillar by way of submission (التسليم), for proof has been established for us regarding its infallibility in what it addresses us with in the world of Unveiling, just as the Messenger is in the sensory world. It is a tongue of the Real (لسان حق).\n\nSome people attach it to the pillars of the House, for part of the wall rests upon it, and only one face of it appears to us, while the rest is concealed within the wall. Thus, some of the mystics (المكاشفين) say that the House stands on six pillars. There is no contradiction between those who affirm five and those who affirm six pillars supporting the House. We have clarified this for you so that you do not imagine that the truth lies with only one of the two sayings or one of the two groups. Every group is truthful. That is why I informed you of its nature.\n\nSimilarly, in all matters where people appear to differ, there is, praise be to Allah, no disagreement among the people concerning what they realize. Rather, they are more correct and truthful in their occupation than the people of the senses concerning what they perceive with their senses.\n\nKnow that the entry to this Station is from the second *dīnār* of Manhood (الرجولية) and the end of it is at the fourth *dīnār*, which is the completion of Manhood by which a person is called a man, as we previously established in the ordering of Faith, Sainthood (الولاية), Prophethood (النبوة), and Messengership (الرسالة). There is no fifth to be the fifth of five, but there may be a fifth of four. Know that.\n\nIf you reflect upon what the Real, exalted is He, detailed, you will know His detailing in what He summarized in His saying: <<ولا أَدْنى‏ من ذلِكَ>> (Nor fewer than that)—meaning two—<<ولا أَكْثَرَ>> (Nor more)—meaning seven and above of the odd numbers (الأفراد). The Real detailed this by His saying: <<ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ>> (There is no secret counsel of three but that He is their fourth, nor of five but that He is their sixth). He did not say, \"nor of four but that He is their fifth,\" nor \"nor of two but that He is their third.\" We understood from \"fewer than that\" and \"more than that\" that He intends the odd numbers (الأفراد), which He makes even (يشفعها) with what is not of them. We realized that Divine Jealousy (الغيرة) ruled here, so He did not establish singularity (فردية) for anyone unless He made it even with the Ipseity (هوية) of the Real, so that Singleness (الأحدية) belongs only to Him. Thus, no creature makes His singularity even, but He makes the singularity of creatures even. That is why He said: <<وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (And He is with you wherever you are), and He did not say, \"And you are with Him,\" because His companionship is unknown. He, exalted is He, knows how He accompanies us, but we do not know how we accompany Him. Companionship (المعية) is established for Him in us, but negated from us in Him.\n\nHe did not say, \"nor of four but that He is their fifth,\" nor \"nor of two but that He is their third,\" because Jealousy does not relate to evenness (الشفعية) in the cosmos, for evenness has its own reality. Rather, it relates to oddness (الوترية) when attributed to the cosmos, which does not deserve it. So, He makes it odd with the Real, so that the Manifestation (الظهور) belongs to Him, exalted is He, in things. This is one of the strongest proofs for describing Him, exalted is He, with Jealousy, because it is derived from seeing the other (الغير), which necessitates participation. Allah is free from the participation of the other, and thus He is free from being other than the Single (الأحد) or having a single one other than God.\n\nThe Prophet, peace be upon him, said:\n> لا أحد أو كما قال أغير من الله‏\n> *No one—or words to that effect—is more jealous than Allah.*\n\nHe described Him with Jealousy, and its ruling in this station is strong. We have mentioned a summary of what this Station bestows, given the constraint of time. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\nIn this Station are the sciences of Singleness (الأحدية) and the difference between it and Unity (الوحدانية), and the science of Divine Lineage (النسب الإلهي).\n\nAllah, exalted is He, will say on the Day of Resurrection:\n> اليوم أضع نسبكم وأرفع نسبي أين المتقون‏\n> *Today I abolish your lineage and raise My lineage. Where are the pious?*\n\nAnd the science of Simples (البسائط), Necessary Knowledge (العلم الضروري), and the science of Analogy (التماثل). And <<الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (Praise be to Allah, Lord of the Worlds).",
    "ur": "باب نمبر دو سو بہتر: تنزیہ التوحید (تنزيه التوحيد) کے مقام کی معرفت میں\n\nمیں کہتا ہوں کہ معبود کی توحید (التوحيد) کی تنزیہ (التنزيه) کے ساتھ،\nاور یہ وہ نور ہے جو اس کے پاس ہے، میں کہتا ہوں۔\nاور اس کی تنزیہ ذات (الذات) اور مرتبہ (الرتبة) کے درمیان ہے،\nاور جو اسے جانتا ہے وہ بہت کم ہے۔\nوہ ہر تنزیہ کرنے والے کی تنزیہ سے منزہ ہے،\nپس جو کوئی بات کہنا چاہے تو وہ کہے، کہنے کے ساتھ۔\nکیونکہ ذات حق (الحق) کی ہستی (الوجود) اس کے غیب کے حرف میں ہے،\nپس حضور کا حرف اس پر قبول نہیں ہوتا۔\n\n[کہ لفظ تنزیہ التوحید (تنزيه التوحيد) سے دو چیزیں مراد ہیں]\n\nجان لو، اللہ ہمیں اور تمہیں اپنی روح سے تائید بخشے، کہ لفظ تنزیہ التوحید (تنزيه التوحيد) سے دو چیزیں مراد ہیں۔ پہلی یہ کہ توحید تنزیہ کا متعلق ہو نہ کہ حق سبحانہ (الحق سبحانه)۔ دوسری یہ کہ تنزیہ توحید کی طرف اس معنی میں مضاف ہو کہ حق تعالیٰ (الحق تعالى) کو توحید کی تنزیہ کے ذریعے منزہ کیا جاتا ہے، نہ کہ مخلوق میں سے کسی تنزیہ کرنے والے کی توحید کی تنزیہ کے ذریعے۔ یہ ایسا ہی ہے جیسے حمد کی حمد کرنا، کیونکہ صفت کا موصوف کے ساتھ قائم ہونا کسی دعوے کا محتاج نہیں ہوتا اور نہ ہی اس میں کسی احتمال کی گنجائش ہوتی ہے۔ جبکہ وہ شخص جو خود کو یا کسی اور کو کسی صفت سے متصف کرتا ہے، اسے اپنے دعوے کی سچائی پر دلیل کی ضرورت ہوتی ہے۔ اس سے کئی فصول (مباحث) متعلق ہیں جن پر کتاب (قرآن) کی آیات دلالت کرتی ہیں۔ ان میں سے ایک یہ ہے کہ کیا شعر کی مجبوری کے علاوہ ذکر سے پہلے ضمیر (الإضمار قبل الذكر) لانا درست ہے یا نہیں؟ شاعر کہتا ہے:\n\n**جزى ربه عني عدي بن حاتم**\n(اس کے رب نے میری طرف سے عدی بن حاتم کو جزا دی)\n\nپس اس نے ذکر سے پہلے ضمیر لایا، لیکن شعر مجبوری کا مقام ہے۔\n\nاور اس مقام کے فصول میں سے یہ ہے کہ اللہ کی توحید (التوحيد) کا حکم دیا جائے، تو اس میں حق (الحق) کی اپنی توحید شامل نہیں ہوتی۔ اور اس سے توحید میں تقلید کا مسئلہ متعلق ہوتا ہے، کیونکہ حکم اس شخص سے متعلق نہیں ہوتا جسے دلیل خود ہی مل جاتی ہے، الا یہ کہ حکم کا تعلق استدلال سے ہو نہ کہ تسلیم کے طریقے پر تعریف سے، یا پھر دلالت کی جگہ پر تنبیہ کے ذریعے استدلال سے، جیسا کہ اس کا فرمان ہے:\n\n**إِذاً لَذَهَبَ كُلُّ إِلهٍ بِما خَلَقَ**\n(تب تو ہر معبود اپنی مخلوق کو لے کر الگ ہو جاتا)\n\nاور جیسا کہ اس کا فرمان ہے:\n\n**لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا**\n(اگر آسمانوں اور زمین میں اللہ کے سوا اور معبود ہوتے تو وہ دونوں تباہ ہو جاتیں)\n\nاور جیسا کہ اس کا فرمان ہے:\n\n**لَمْ يَلِدْ ولَمْ يُولَدْ**\n(نہ اس نے کسی کو جنا اور نہ وہ جنا گیا)\n\nاور اس مقام کے فصول میں سے حق تعالیٰ کا یہ فرمان ہے: **ما اتَّخَذَ صاحِبَةً ولا وَلَداً** (نہ اس نے کوئی بیوی بنائی اور نہ کوئی اولاد) عدم کفاءت (برابری) کی وجہ سے، کیونکہ: **لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ** (اور کوئی اس کا ہمسر نہیں)۔ اگر کفاءت موجود ہوتی تو یہ جائز ہوتا۔ اللہ عزوجل نے فرمایا: **ولا تَنْكِحُوا الْمُشْرِكاتِ حَتَّى يُؤْمِنَّ** (اور مشرک عورتوں سے نکاح نہ کرو جب تک وہ ایمان نہ لے آئیں)۔ پس اس نے کفاءت کو دین کے ساتھ جوڑا۔ اور اس کا فرمان: **لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً** (اگر اللہ ارادہ کرتا کہ وہ کوئی اولاد بنائے)۔ اس نے اسے امکان کے قبیل سے قرار دیا، پھر فرمایا: **لَاصْطَفى‏** (تو وہ ضرور چن لیتا)۔ اور اصطفاء (چننا) ایک عمل ہے، اور جو چیز بنائی جاتی ہے وہ بنانے والے کے لیے کفاءت (برابری) کی نفی کرتی ہے، اور فاعل کا مرتبہ مفعول کے مرتبے سے کہاں؟\n\nاور اس مقام کے فصول میں سے یہ ہے کہ تنزیہ (التنزيه) ان مقدمات کے ذریعے مدرک نہ ہو جو اس کی ہستی (الوجود) یا اس کی معرفت (المعرفۃ) کو نتیجہ خیز کرتی ہیں۔ اللہ اس سے بہت بلند و برتر ہے۔\n\nاور اس مقام کے فصول میں سے یہ ہے کہ وہ کسی چیز کو نتیجہ خیز کرنے کے لیے مقدمہ نہ ہو، کیونکہ مقدمات میں ترکیب (جو ان کی صفت ہے) اور مقدمات میں جوڑنے والا سبب (السبب الرابط) ہوتا ہے، جو مناسبت کا تقاضا کرتا ہے۔ اور خلق اور حق (الحق) کے درمیان مناسبت نہ تو معقول ہے اور نہ ہی موجود۔ پس نہ تو اس کی ذات (الذات) سے کوئی چیز صادر ہوتی ہے اور نہ ہی اس کی ذات سے کوئی چیز صادر ہوتی ہے۔ اور جو کچھ بھی شریعت نے دلالت کی یا عقل نے دلیل کے طور پر اختیار کیا، اس کا تعلق صرف الوہیت (الألوهة) سے ہے نہ کہ ذات (الذات) سے۔ اور اللہ کا الٰہ ہونا ہی وہ ہے جس پر ممکن (الممکن) اپنے امکان کی وجہ سے انحصار کرتا ہے۔ پس ہم ان شاء اللہ اس مقام کے فصول سے متعلقہ امور کو اختصار کے ساتھ بیان کرتے ہیں۔\n\n[کہ حضرت الٰہیہ (الحضرة الإلهية) تین اقسام میں منقسم ہے: ذات، صفات اور افعال]\n\nجان لو کہ یہ مقام، اصحاب بدايات (ابتدائی سالکین) کے حق میں عظمت کے مقام کا چوتھا مقام ہے، اور اکابر روحانیین کے حق میں ایک سو گیارہواں اور دسواں مقام ہے۔ چونکہ حضرت الٰہیہ (الحضرة الإلهية) تین اقسام میں منقسم ہے: ذات (الذات)، صفات (الصفات) اور افعال (الأفعال)، اس لیے یہ مقام ان میں سے ایک ہے اور ان کا تیسرا ہے۔ اور چونکہ صفات دو قسم کی ہیں: صفت فعل اور صفت تنزیہ (صفة تنزيه)، اس لیے یہ مقام ان دونوں میں سے صفت تنزیہ ہے۔\n\nتو جہاں تک تنزیہ التوحید (تنزيه التوحيد) کا تعلق ہے، تو وہ یہ ہے کہ یہ توحید جسے ہم جناب حق (الحق) کی طرف منسوب کرتے ہیں، اس بات سے منزہ ہے کہ اسے غیر حق کی طرف منسوب کیا جائے۔ پس حقیقت میں منزہ تو وہ (توحید) ہے نہ کہ حق (الحق)۔ ہم نے یہ اس لیے کہا کہ غیر حق کو بھی اس سے متصف کرنا جائز ہے، اس لحاظ سے جو لفظ دیتا ہے، جیسا کہ لفظ ہستی (الوجود)، علم (العلم)، قدرت (القدرة) اور دیگر اسماء کے اطلاق میں حق (الحق) اور خلق (الخلق) کے حق میں اشتراک واقع ہوا ہے۔ پس یہ مقام اس توحید کو، جو اللہ کی طرف منسوب ہے، اس بات سے منزہ کرتا ہے کہ اس کے ذریعے کسی غیر کو متصف کیا جائے۔ کیونکہ یہ ہر لحاظ سے توحید الذات (توحيد الذات) ہے، اور اس توحید کے ذریعے کسی غیر کو متصف نہیں کیا جاتا، نہ لفظ میں اور نہ معنی میں۔ اور حق کی وہ ذات جس کی طرف یہ توحید منسوب ہے، اس سے تنزیہ متعلق نہیں ہوتی، کیونکہ اس پر (نقص) جائز نہیں ہے کہ اسے اس وصف سے دور کیا جائے جو اس پر جائز ہے، کیونکہ وہ فی نفس الامر منزہ ہے، نہ کہ کسی تنزیہ کرنے والے کی تنزیہ کے ذریعے۔\n\nاور اگر تنزیہ التوحید (تنزيه التوحيد) کا تعلق حق سبحانہ (الحق سبحانه) سے ہو، تو وہ اپنی ذات (الذات) کے لحاظ سے منزہ ہوگا، اس وصف کی عین زبان سے جو کہ اس کے لیے توحید ہے۔ یہ ایسا ہی ہے جیسے صفت کرم کی زبان کا کریم کی تعریف کرنا، اس کے ساتھ اس کے قیام کی وجہ سے، نہ کہ کسی کہنے والے کے قول اور کسی دیکھنے والے کی دلیل سے۔ وہ سبحانہ واحد ہے، پس یہ وصف اس کے لیے تھا اور تم نہیں تھے، اور یہ وصف اس کے لیے ہے اور تم تم ہو۔ جب یہ معاملہ اس حد پر ہے، تو وہاں کوئی موجود نہیں ہے جس کے لیے ذکر سے پہلے ضمیر لانا درست ہو، سوائے اس کے جو غیب مطلق (الغيب المطلق) کا مستحق ہو، جسے کسی بھی حال میں مشاہدہ نہیں کیا جا سکتا۔ پس غیب کا ضمیر (ضمير الغيب) اس کے لیے ایسا ہی ہے جیسے مسمیٰ کے لیے اسم جامد علم، جو پہلی نظر میں اس پر دلالت کرتا ہے، بغیر اس کے کہ کسی متقدم ذکر کی ضرورت ہو جو سامع کے ذہن میں مقرر ہو اور جس پر یہ ضمیر لوٹے۔ پس \"ھو\" (هو) کا اطلاق صرف اللہ کے حق میں ہی درست ہے۔ اور جب یہ اللہ کے علاوہ کسی اور پر مطلق کیا جاتا ہے، تو یہ صرف کسی متقدم ذکر کے بعد ہی مطلق کیا جاتا ہے جو کسی بھی پہلو سے معروف ہو جس سے وہ پہچانا جاتا ہے، تب کہا جاتا ہے \"ھو\" (هو)۔ اور اس ضمیر کا عین محل اس شخص کے نزدیک مشہود ہے جس کے حق میں \"ھو\" (هو) کہنا درست نہیں، کیونکہ وہ اس کے پاس حاضر ہے۔ پس اس لحاظ سے اس سے \"ھو\" (هو) کا نام زائل ہو جاتا ہے، اور اس کے لیے \"ھو\" (هو) کا نام اس لحاظ سے ثابت ہوتا ہے جو اس سے غائب ہے۔\n\nاگر کہا جائے کہ اگر جو کچھ تم نے مقرر کیا ہے وہ درست ہے، تو وہ سبحانہ اپنے لیے مشہود ہے، پس اس کے اپنے شہود (الشهود) کے لحاظ سے اس سے \"ھو\" (هو) زائل ہو جائے گا، تو پھر \"ھو\" (هو) اس کے لیے اسم علم کے درجے میں نہیں رہا جیسا کہ تم نے دعویٰ کیا؟ ہم کہیں گے: اگرچہ وہ خود کو مشاہدہ کرتا ہے، لیکن ہویت (الهوية) معلوم ہے، مشہود نہیں، اور یہی وہ ہے جس پر \"ھو\" (هو) کا نام لاگو ہوتا ہے۔ یہ ہمارے مذہب کے مطابق ہے، اور یہی اہل حق کا مذہب ہے۔ کیسے نہیں، جبکہ ایک گروہ کہتا ہے کہ وہ خود کو نہیں جانتا، تو \"ھو\" (هو) اس کے لیے ہم سے اور اس سے زائل نہیں ہوتا۔ اسی لیے اللہ تعالیٰ نے سورۃ الاخلاص کے آغاز میں اپنے نبی علیہ السلام سے فرمایا: **قُلْ هُوَ الله أَحَدٌ** (کہو، وہ اللہ ایک ہے)۔ پس اس نے ضمیر سے ابتدا کی اور کوئی متقدم ذکر نہیں کیا جس پر وہ قرآن کے اندر لوٹے۔ اگرچہ یہودیوں نے آپ سے کہا تھا کہ ہمیں اپنے رب کا نسب بتاؤ، تو شاید صاحب لسان یہ وہم کرے کہ یہ ضمیر اس رب کی طرف لوٹتا ہے جس کا ذکر یہودیوں نے کیا تھا۔ لیکن جان لو کہ اس ضمیر سے وہ رب مراد نہیں ہے جس کا ذکر یہودیوں نے کیا، کیونکہ اللہ اس سے بلند ہے کہ اس کی ذات (الذات) کی معرفت (المعرفۃ) کو اس کی مخلوق ادراک کرے۔ اسی لیے اس نے فرمایا: **هُوَ الله**۔ اور پوری سورت میں کوئی ایسی چیز ذکر نہیں کی جو خلق پر دلالت کرے، بلکہ اس سورت میں خلق سے براءت (پاکیزگی) رکھی۔ پس اس نے اپنی معرفت کو خلق کا نتیجہ نہیں بنایا، چنانچہ فرمایا: **ولَمْ يُولَدْ**۔ اور نہ ہی اس نے خلق کو اپنے وجود کا نتیجہ بنایا، جیسا کہ بعض لوگ کسی بھی نسبت سے دعویٰ کرتے ہیں، چنانچہ فرمایا: **لَمْ يَلِدْ**۔ اور اس نے ہر ایک کی احدیت (أحدية) سے تشبیہ کی نفی کی، اپنے اس فرمان سے: **ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ** (اور کوئی اس کا ہمسر نہیں)۔ اور اس کے لیے ایسی احدیت ثابت کی جو کسی اور کے لیے نہیں ہے، اور اس کے لیے صمدیت (الصمدانية) ثابت کی، جو کہ صفت تنزیہ (صفة تنزيه) اور براءت ہے۔ پس یہ بات ختم ہو گئی کہ ضمیر اس رب کی طرف لوٹے جو خلق کی طرف مضاف تھا، ان کے اس قول میں کہ انہوں نے آپ صلی اللہ علیہ وسلم سے کہا: \"ہمیں اپنے رب کا نسب بتاؤ\"، پس انہوں نے اسے آپ کی طرف منسوب کیا نہ کہ اپنی طرف۔ اور جب آپ صلی اللہ علیہ وسلم نے اس کا نسب بیان کیا جو آپ پر نازل ہوا، تو نہ اسے اپنی طرف منسوب کیا اور نہ ان کی طرف، بلکہ اسے اس چیز کے ساتھ ذکر کیا جس کا اس کا جلال مستحق ہے۔ پس \"ھو اللہ\" میں ضمیر اس کی طرف نہیں لوٹتا جس کا ذکر کیا گیا، اور مطلق کا مقید سے کیا مقابلہ؟ پس مقید کی ہویت (هوية المقيد) مطلق کی ہویت نہیں ہے۔ مقید کی ہویت ایک نسبت ہے جو کون (وجود) سے متعلق ہوتی ہے، پس وہ اس کے ساتھ مقید ہو جاتی ہے، کیونکہ کون اس کے ساتھ مقید ہوتا ہے، چنانچہ کہا جاتا ہے: خالق اور مخلوق، قادر اور مقدور، عالم اور معلوم، مرید اور مراد، سمیع اور مسموع، بصیر اور مبصر، اور کلام کرنے والا اور جس سے کلام کیا گیا ہو۔ جبکہ حی (الحي) ایسا نہیں ہے، پس اس کی ہویت کا کون سے کوئی تعلق نہیں ہے۔ اور قیوم (القيوم) بھی ایسا نہیں ہے۔ پس جب تم نے وہ جان لیا جو ہم نے ذکر کیا، تو تم نے جان لیا کہ ذکر سے پہلے ضمیر لانا صرف اللہ کے لیے ہی درست ہے، اور ذکر کے بعد اس میں اشتراک واقع ہوتا ہے۔ اللہ تعالیٰ نے فرمایا: **الله الَّذِي لا إِلهَ إِلَّا هُوَ** (اللہ وہ ہے جس کے سوا کوئی معبود نہیں)۔ پس اس نے ضمیر کو اس اللہ کی طرف لوٹایا جو آیت کے شروع میں مذکور ہے۔\n\n[کہ وہ توحید جس کا بندے کو حکم دیا جاتا ہے، وہ اس توحید سے مختلف ہے جس کے ذریعے حق (الحق) خود کو واحد قرار دیتا ہے]\n\nاور جان لو کہ وہ توحید جس کا بندے کو علم حاصل کرنے یا کہنے کا حکم دیا جاتا ہے، وہ اس توحید سے مختلف ہے جس کے ذریعے حق (الحق) خود کو واحد قرار دیتا ہے۔ کیونکہ توحید امر (توحيد الأمر) مرکب ہے، اس لیے کہ جس کو اس کا حکم دیا گیا ہے وہ مخلوق ہے، اور مخلوق سے وہی صادر ہوتا ہے جو اس کے مناسب ہو، اور وہ مخلوق سے مخلوق ہے، پس وہ اللہ سے خلق میں اس سے زیادہ دور ہے جس سے یہ توحید وجود میں آئی۔ یہ ہر اس مذہب پر ہے جو مخلوق سے افعال کی نفی کرتے ہیں اور جو انہیں ثابت کرتے ہیں، کیونکہ نفی کرنے والے کسب (اختیار) کے قائل ہیں اور نفی نہ کرنے والے ایجاد (پیدا کرنے) کے قائل ہیں۔ پس جناب عزیز کے لیے وہ چیز کیسے لائق ہو سکتی ہے جو خلق کی طرف مضاف ہے؟ اگرچہ ہمیں شرعاً اس کی عبادت کا حکم دیا گیا ہے، تو ہم اسے اس کی جگہ پر مقرر کرتے ہیں اور اسے ویسے ہی کہتے ہیں جیسا کہ ہمیں اس کی قربت (القربة) کی نیت سے حکم دیا گیا ہے، اس کے ساتھ کہ ہم اس معرفت (المعرفۃ) میں اپنے قدم کو ثابت رکھیں جو حق (الحق) نے ہمیں اپنے بارے میں مشاہدہ کرائی ہے، کہ وہ نہیں جانا جاتا: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (کوئی چیز اس کے مثل نہیں)۔ اور اس میں جو اس نے سورۃ الاخلاص میں ذکر کیا، اور اس کے عمومی فرمان میں تسبیح (جو کہ تنزیہ ہے) کے ذریعے: **رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ** (عزت کا رب ان چیزوں سے پاک ہے جو وہ بیان کرتے ہیں)۔ اور عزت (العزة) اس بات کا تقاضا کرتی ہے کہ اس کی معرفت تک پہنچنے سے روکا جائے۔\n\nاور اس مقام کے اسرار میں سے اس کا فرمان ہے: **لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً** (اگر اللہ ارادہ کرتا کہ وہ کوئی اولاد بنائے)۔ اگرچہ \"لو\" حرف امتناع ہے، لیکن یہ ایک چیز کا امتناع ہے کسی دوسری چیز کے امتناع کی وجہ سے، پس یہ عدم ہے عدم کی وجہ سے۔ اور جب \"لو\" کے بعد \"لا\" کا حرف آتا ہے، تو \"لو\" وجود کے لیے حرف امتناع ہوتا ہے۔ اور اس آیت میں \"لا\" نہیں آیا۔ پس اس نے ولد (اولاد) بنانے سے ارادے کے تعلق کی نفی کی، اور یہ نہیں کہا کہ وہ ولد کو جنتا، کیونکہ وہ کہتا ہے: **لَمْ يَلِدْ**۔ اور متخذ (بنائی گئی) اولاد موجود العین ہوتی ہے، بغیر اس کے کہ وہ جنی گئی ہو، پس اسے اصطفاء (چننے) اور مرتبے میں قربت کے حکم سے اپنایا جاتا ہے، کہ وہ اسے اپنے آپ سے اس درجے پر اتارے جس درجے پر اولاد والد سے ہوتی ہے جس سے اس کی ولادت ہوتی ہے۔ اور حقیقت ولادت اور تبنی (گود لینے) سے منع کرتی ہے، کیونکہ نسبت ذات (الذات) سے بلند ہے۔ اور اللہ کی طرف سے تمام مخلوق کے لیے الٰہی نسبت ایک ہی ہے، اس میں کوئی تفاضل (فرق) نہیں، کیونکہ تفاضل کثرت کا تقاضا کرتا ہے۔ اسی لیے اس نے لفظ \"لو\" لایا اور اس کے بعد لفظ \"لا\" نہیں لایا، پس یہ حرف امتناع تھا، یعنی یہ واقع نہیں ہوا اور نہ ہی واقع ہوگا، کیونکہ ذات (الذات) کا اس وصف سے متصف ہونے کا امتناع ہے جس کی وہ مستحق نہیں ہے۔ اسی لیے اس نے اپنے فرمان **وأَنَّهُ تَعالى‏ جَدُّ رَبِّنا** (اور یہ کہ ہمارے رب کی شان بہت بلند ہے) کے بعد فرمایا: **ما اتَّخَذَ صاحِبَةً ولا وَلَداً** (نہ اس نے کوئی بیوی بنائی اور نہ کوئی اولاد)۔ پس اس نے اسے اس وصف کے قیام سے بلند ہونے کے ساتھ متصف کیا، اس رب کی عظمت کی وجہ سے جو ذکر کے ذریعے مربوب (مخلوق) کی طرف مضاف ہے۔ تو پھر بغیر لفظی اضافت کے رب کا کیا حال ہوگا؟ اور اسم اللہ کا کیا حال ہوگا؟ اور بغیر اسم کے ذات (الذات) کا کیا حال ہوگا؟ پس اس تنزیہ (التنزيه) سے بڑھ کر کیا تنزیہ ہو سکتی ہے؟\n\nاور جہاں تک کفاءت (برابری) اور مثل کی نفی کا تعلق ہے، تو شاید وہ شخص جسے حقائق کی معرفت (المعرفۃ) نہیں ہے، یہ وہم کرے کہ اگر کفاءت موجود ہوتی تو ولد کا واقع ہونا جائز ہوتا، اس صاحبہ (بیوی) کے وجود سے جو کفو (ہمسر) ہے۔ پس اسے جان لینا چاہیے کہ کفاءت مشروعه ہے، معقول نہیں، اور شریعت نے اسے صرف ایک طرف سے لازم کیا ہے نہ کہ دونوں طرف سے۔ پس عورت کو اس سے نکاح کرنے سے منع کیا جو اس کا کفو نہیں، لیکن مرد کو اس سے نکاح کرنے سے منع نہیں کیا جو اس کا کفو نہیں ہے۔ اسی لیے اسے اپنی لونڈی سے ملک یمین کے ذریعے نکاح کرنے کی اجازت ہے، اور عورت کو اپنے غلام سے نکاح کرنے کی اجازت نہیں ہے۔ اور حق (الحق) مخلوق نہیں ہے، اور اگر اس کی اولاد ہوتی تو وہ والد ہوتا۔ اور صاحبہ کی طرف سے کفاءت لازم نہیں ہوتی۔ پس ولد کے وجود کا مانع ختم ہو گیا، نہ کہ کفاءت کے عدم کی وجہ سے، بلکہ اس وجہ سے کہ ذات (الذات) نسب اور نسبتوں سے بلند ہونے کی مستحق ہے۔ اور اس وجہ سے کہ الوہیت (الألوهة) کی احدیت (أحدية) اس کی مستحق ہے، کیونکہ اولاد اپنے باپ کی طرح ہوتی ہے۔ پس اس شخص کا مفہوم باطل ہو گیا جس نے **ما اتَّخَذَ صاحِبَةً ولا وَلَداً** کو اس کے جواز پر محمول کیا، جب کہ وہ متخذ (بنایا گیا) تھا۔ اور اس سے اور کفو اور مثل کی نفی سے جو مفہوم ہوتا ہے وہ وہی ہے جو ہم نے ذکر کیا۔\n\nاور چونکہ ذات (الذات) کے لیے تنزیہ (التنزيه) اس طرح ہے جیسا کہ ہم نے مقرر کیا، تو یہ بات باطل ہو گئی کہ اس کی معرفت (المعرفۃ) جو ہم میں قائم ہے، ہماری اپنی معرفت کا نتیجہ ہو، کیونکہ ہم اپنے امکان کے لحاظ سے اس پر انحصار کرتے ہیں۔ اور یہ (انحصار) اس کی ذاتی ثبوتی صفت (الصفة الثبوتية النفسية) کی معرفت کو شامل نہیں کرتا جس پر وہ ہے، بلکہ اس سے صرف ایک ایسی منزہ ذات (ذات منزهة) پر انحصار کرنا مراد ہے جو ان چیزوں سے مجہول ہے جو ہماری طرف منسوب کی جاتی ہیں، اور ہمارے نزدیک وہ چیزیں مجہول ہیں جو اس کی طرف اس کی نفسیت کے لحاظ سے منسوب کی جاتی ہیں۔ پس وہ سبحانہ کبھی بھی نہیں جانا جاتا۔ اور جب اس کی معرفت (المعرفۃ) نزاہت اور بلندی میں اس حد تک ہے، تو یہ زیادہ لائق ہے کہ اس کی ہستی (الوجود) کسی ایسی علت کی معلول نہ ہو جو مرتبے میں اس سے پہلے ہو، یا کسی متقدم شرط سے مشروط نہ ہو، یا کسی حاکم حقیقت کے لیے محقق نہ ہو، یا کسی ایسی دلیل کا مدلول نہ ہو جو اس دلیل کے پہلو سے اس سے جڑی ہو۔ پس سبحانہ ہمارے اور اس کے درمیان ان چاروں جوڑنے والی چیزوں میں سے کوئی جامع نہیں ہے۔ پس ہماری طرف سے اس کی معرفت (المعرفۃ) نزاہت اور ادراک سے بلندی میں اس کی ہستی (الوجود) کے ساتھ ملحق ہو گئی۔ اور جس طرح یہ درست نہیں کہ کوئی چیز اسے نتیجہ خیز کرے، اسی طرح اس کی ہویت (هويته) بھی، اپنی ہویت کے لحاظ سے نہ کہ اپنے مرتبے کے لحاظ سے، کسی چیز کو نتیجہ خیز نہیں کرتی۔ کیونکہ اگر کوئی چیز اس کی ہویت کے لحاظ سے اس سے جڑ جاتی، تو اس کی ہویت اس چیز سے جڑ جاتی۔ پس یہ درست نہیں کہ وہ کسی معلول کے لیے علت ہو، نہ کسی مشروط کے لیے شرط، نہ کسی محقق کے لیے حقیقت، اور نہ کسی مدلول کے لیے دلیل۔ خاص طور پر جب اس نے سبحانہ نے مطلقاً فرمایا: **لَمْ يَلِدْ** (اس نے نہیں جنا) اور کوئی قید نہیں لگائی۔ اگر وہ حقیقت ہوتا تو محقق کو جنتا، اور اگر وہ دلیل ہوتا تو مدلول کو جنتا، اور اگر وہ علت ہوتا تو معلول کو جنتا، اور اگر وہ شرط ہوتا تو مشروط کو جنتا۔ پس وہ سبحانہ وہ مستند (انحصار کی جگہ) ہے جو مجہول ہے، جسے عقلیں ادراک نہیں کر سکتیں اور نہ ہی فصول اس کے اجمال کو تفصیل دے سکتی ہیں۔ پس یہ بھی تنزیہ التوحید (تنزيه التوحيد) کے پہلوؤں میں سے ایک پہلو ہے۔\n\nاور جہاں تک توحید (التوحيد) میں واحد (الواحد) اور احد (الأحد) کا اس کی احدیت (أحديته) سے متعلق ہے، تو لفظ احدیت (الأحدية) اس کے سوا کسی اور پر ثابت الاطلاق نہیں آیا، چنانچہ فرمایا: **ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً** (اور اپنے رب کی عبادت میں کسی کو شریک نہ کرے)۔ اگرچہ اہل اللہ کے طریقے پر معانی کی تفسیر کے لحاظ سے اس سے یہ مفہوم ہوتا ہے کہ اس کی احدیت (أحديته) کے لحاظ سے اس کی عبادت نہ کی جائے، کیونکہ احدیت عابد کے وجود کی نفی کرتی ہے۔ تو گویا وہ کہہ رہا ہے کہ صرف رب کی ربوبیت (ربوبيته) کے لحاظ سے ہی عبادت کی جائے، کیونکہ رب نے تمہیں وجود بخشا، پس اس سے تعلق رکھو اور اس کے لیے عاجزی کرو، اور عبادت میں احدیت کو ربوبیت کے ساتھ شریک نہ کرو کہ تم اس کے لیے بھی عاجزی کرو جیسا کہ ربوبیت کے لیے کرتے ہو، کیونکہ احدیت تمہیں نہ جانتی ہے اور نہ قبول کرتی ہے۔ پس یہ غیر معبد میں عبادت ہوگی، اور غیر مطمع میں طمع ہوگی، اور غیر معمول میں عمل ہوگا۔ اور یہ جاہل کی عبادت ہے۔ پس اس نے عابدین کی عبادت کی نفی کی کہ وہ احدیت سے تعلق رکھیں، کیونکہ احدیت مطلقاً صرف اللہ کے لیے ہی ثابت ہے۔ اور جہاں تک اللہ کے سوا کسی اور کا تعلق ہے، تو اس کے لیے مطلقاً کوئی احدیت نہیں ہے۔ پس یہ اس آیت سے ہمارے نزدیک ہمارے طریقے کے لحاظ سے قرآن کی تفسیر میں مفہوم ہوتا ہے۔ اور اہل رسوم (ظاہری علماء) بھی اس سے اپنا حصہ لیتے ہیں، معنی کی تفسیر کرتے ہوئے، اور وہ مذکورہ احد (الأحد) کو ان شرکاء پر محمول کرتے ہیں جنہیں انہوں نے اختیار کیا ہے، اور یہ بھی ایک صحیح تفسیر ہے۔ پس قرآن وہ سمندر ہے جس کا کوئی کنارہ نہیں، کیونکہ جس کی طرف یہ منسوب ہے، اس سے کلام کے تمام مطلوبہ معانی مراد ہوتے ہیں، برخلاف مخلوق کے کلام کے۔\n\nاور جب تم یہ جان لو، تو تم اس کے فرمان جل ثناؤہ کا اپنے نبی علیہ السلام سے مراد جان لو گے: **قُلْ هُوَ الله أَحَدٌ** (کہو، وہ اللہ ایک ہے)، یعنی اس صفت میں کوئی شریک نہیں۔ اور جہاں تک واحد (الواحد) کا تعلق ہے، تو ہم نے قرآن میں دیکھا کہ کیا اس نے اسے کسی اور پر مطلق کیا ہے جیسا کہ اس نے احدیت (الأحدية) کو مطلق کیا؟ تو مجھے نہیں ملا، اور میں اس پر یقین کے ساتھ نہیں ہوں۔ اگر اس نے اسے مطلق نہیں کیا، تو یہ احدیت سے زیادہ خاص ہے، اور یہ ذات (الذات) کے لیے اسم علم ہوگا، صفت کی طرح نہیں ہوگا جیسا کہ احدیت ہے۔ کیونکہ صفت اشتراک کا محل ہوتی ہے۔ اسی لیے احدیت کو قرآن میں اللہ کے سوا ہر چیز پر مطلق کیا گیا ہے، اور لوگوں کے کلام اور ان کی اصطلاح پر اعتبار نہیں کیا جائے گا، بلکہ صرف اس پر نظر رکھی جائے گی جو قرآن میں آیا ہے جو کہ اللہ کا کلام ہے۔ پس اگر اللہ کے کلام میں لفظ واحد (الواحد) پایا جائے، تو لفظی اشتراک کی وجہ سے اس کا حکم احدیت کا حکم ہوگا۔ اور اگر اللہ کے کلام میں لفظ واحد غیر پر مطلق ہوتا ہوا نہ پایا جائے، تو اسے ان خصوصیات کے ساتھ ملحق کیا جائے گا جن کی ذات (الذات) مستحق ہے، اور یہ اسم اللہ کی طرح ہوگا جسے اس کے سوا کسی نے اختیار نہیں کیا۔\n\nاور اس مقام سے متعلق خاص تنزیہ (التنزيه) میں سے وہ معارف ہیں جن کا ہم نے کتاب *مواقع النجوم* میں التجلی الصمدانی (الصمدانی ظہور) میں ذکر کیا ہے۔ اور اس سے ہماری مراد وہ نہیں ہے جو عارف ابو عبد اللہ البستی نے اپنی کتاب میں چاہی تھی جو انہوں نے عبد الرب اور عبد الصمد کے بارے میں لکھی۔ کیونکہ جس صمد (الصمد) کو ہم چاہتے ہیں وہ نہ تو مضاف ہوتا ہے اور نہ ہی اس کی طرف کوئی چیز مضاف کی جاتی ہے۔ کیونکہ متضايفین (جن میں اضافت ہو) کے درمیان بینیت (درمیانی نسبت) کا ہونا ضروری ہے، تاکہ ان کے درمیان ایک جوڑنے والی نسبت ہو جس سے اضافت ان دونوں کے لیے محقق ہو سکے۔ پس وہ صمد جسے البستی نے عبد الصمد سے مراد لیا، وہ ہے جس کی طرف پناہ لی جاتی ہے اور جس سے تعلق رکھا جاتا ہے اور جس کا رخ کیا جاتا ہے۔ اسی لیے شریعت نے نمازی کو منع کیا ہے کہ جب وہ کسی ستون، لاٹھی، کجاوے کے پچھلے حصے یا اس جیسی کسی چیز کے پیچھے ہو تو اس کی طرف صمد (رخ) نہ کرے، بلکہ اس سے تھوڑا سا دائیں یا بائیں ہٹ جائے۔ اور جس کی طرف صمد کیا جائے وہ تنزیہ (التنزيه) کے اوصاف میں سے نہیں ہے، بلکہ وہ کرم کے اوصاف میں سے ہے۔ پس مطلق صمدیت (الصمدية المطلقة) جو اس قید سے آزاد ہے، وہی تنزیہ کی صفت ہونے کی مستحق ہے، کیونکہ کون (وجود) کا اس سے کوئی تعلق نہیں ہے، اور یہی اس مقام میں مطلوب ہے۔ اور اس کی لغوی تشریح اسماء الٰہیہ میں مذکور ہے۔\n\n[کہ تنزیہ التوحید (تنزيه التوحيد) کا مقام احدیت (الأحدية) کا طالب ہے]\n\nاور جان لو کہ اگرچہ یہ مقام ہر لحاظ سے احدیت (الأحدية) اور تنزیہ (التنزيه) کا طالب ہے، لیکن یہ کشف صوری (الکشف الصوری) میں ظاہر ہوتا ہے جو ظاہر کے ساتھ مقید ہے۔ یہ ایک ایسے گھر کی طرح ہے جو پانچ ستونوں پر قائم ہے، جن پر ایک چھت اٹھائی گئی ہے، اور اس کے ارد گرد دیواریں ہیں جن میں کوئی کھلا دروازہ نہیں ہے۔ پس کسی کے لیے بھی کسی بھی طرح سے اس میں داخل ہونا ممکن نہیں ہے۔ لیکن گھر کے باہر ایک ستون (عمود) کھڑا ہے جو گھر کی دیوار سے ملا ہوا ہے، اہل کشف (أهل الكشف) اس سے مس کرتے ہیں، جیسا کہ وہ حجر اسود کو بوسہ دیتے اور مس کرتے ہیں، جسے اللہ نے گھر کے باہر رکھا اور اسے اپنا دایاں ہاتھ بنایا اور اسے اپنی طرف منسوب کیا نہ کہ گھر کی طرف۔ اسی طرح یہ ستون بھی اس مقام کی طرف منسوب نہیں ہے، اگرچہ یہ اس کا حصہ ہے، لیکن یہ صرف اسی کے لیے خاص نہیں ہے۔ کیونکہ یہ ہر الٰہی مقام میں موجود ہے۔ اور گویا یہ ہمارے اور ان معارف کے درمیان ترجمان ہے جو یہ مقامات عطا کرتے ہیں۔ ابن مسرہ الجبلی نے اپنی کتاب *الحروف* میں اس پر تنبیہ کی ہے۔ اور اس ستون کی ایک فصیح زبان ہے جو ہمیں ان چیزوں کے بارے میں بتاتی ہے جو یہ مقامات اپنے اندر رکھتے ہیں، پس ہم اس سے اس کا علم حاصل کرتے ہیں۔ اور بعض مقامات ایسے ہیں جن میں ہم داخل ہوتے ہیں اور ان کے کونوں میں چلتے ہیں، تو ہم معاملے کو اسی حد پر پاتے ہیں جس پر ہم نے اسے جانا تھا۔ اور بعض مقامات ایسے ہیں جن میں داخل ہونے کا ہمارے لیے کوئی راستہ نہیں، جیسے کہ یہ مقام۔ پس ہم اس ستون سے تسلیم کے حکم کے ذریعے تعریف حاصل کرتے ہیں، کیونکہ ہمارے لیے اس کی عصمت پر دلیل قائم ہو چکی ہے کہ وہ عالم کشف (عالم الكشف) میں ہم سے جو مخاطبت کرتا ہے، وہ عالم حس (عالم الحس) میں رسول کی طرح ہے۔ پس وہ حق کی زبان ہے۔\n\nاور بعض لوگ اسے گھر کے ستونوں کے ساتھ ملحق کرتے ہیں، کیونکہ دیوار کا کچھ حصہ اس پر ہے۔ اور ہمیں اس کا صرف ایک ہی رخ نظر آتا ہے اور باقی دیوار میں چھپا ہوا ہے۔ پس بعض مکاشفین کہتے ہیں کہ گھر چھ ستونوں پر قائم ہے۔ پس پانچ کو ثابت کرنے والوں اور چھ کو ثابت کرنے والوں کے درمیان گھر کے قیام میں کوئی تناقض نہیں ہے۔ ہم نے تمہارے لیے یہ واضح کر دیا تاکہ تم یہ خیال نہ کرو کہ حق دونوں اقوال میں سے کسی ایک میں ہے اور دونوں گروہوں میں سے کسی ایک کے ساتھ ہے۔ پس ان میں سے ہر گروہ سچا ہے۔ اسی لیے میں نے تمہیں اس کی کیفیت سے آگاہ کیا۔ اور اسی طرح ہر وہ چیز ہے جس میں لوگوں کے درمیان اختلاف ظاہر ہوتا ہے، تو اللہ کے فضل سے قوم کے درمیان اس چیز میں کوئی اختلاف نہیں ہے جس کا وہ تحقق کرتے ہیں، بلکہ وہ اپنے کام میں اہل حس (حواس والوں) سے زیادہ درست اور حق پر ہیں، ان چیزوں میں جنہیں وہ اپنے حواس سے ادراک کرتے ہیں۔\n\nاور جان لو کہ اس مقام میں داخلہ رجولیت (مردانگی) کے دوسرے دینار سے ہوتا ہے، اور اس میں انتہا چوتھے دینار تک ہے، جو رجولیت کی تکمیل ہے جس کے ذریعے شخص کو رجل (مرد) کہا جاتا ہے، جیسا کہ ہم ایمان، ولایت، نبوت اور رسالت کی ترتیب میں پہلے بیان کر چکے ہیں۔ اور ان کا کوئی پانچواں نہیں ہوتا جو پانچ کا پانچواں ہو، بلکہ ان کا چار کا پانچواں ہو سکتا ہے۔ پس یہ جان لو۔ اور جب تم اس تفصیل پر غور کرو گے جو حق تعالیٰ نے بیان کی ہے، تو تم اس کی تفصیل کو جان لو گے جو اس نے اپنے اس فرمان میں اجمالاً بیان کی ہے: **ولا أَدْنى‏ من ذلِكَ** (اور نہ اس سے کم)، یعنی دو، **ولا أَكْثَرَ** (اور نہ اس سے زیادہ)، یعنی سات اور اس سے اوپر کے افراد (طاق اعداد)۔ پس حق نے اپنے اس فرمان سے تفصیل بیان کی: **ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ** (تین آدمیوں کی کوئی سرگوشی نہیں ہوتی مگر وہ ان کا چوتھا ہوتا ہے، اور نہ پانچ کی مگر وہ ان کا چھٹا ہوتا ہے)۔ اور اس نے یہ نہیں کہا کہ \"اور نہ چار کی مگر وہ ان کا پانچواں ہوتا ہے\"۔ پس ہم نے اس کے \"اس سے کم\" اور \"اس سے زیادہ\" سے جانا کہ وہ افراد (طاق اعداد) مراد لیتا ہے، جنہیں وہ اس چیز کے ساتھ شفع (جفت) بناتا ہے جو ان میں سے نہیں ہے۔ پس ہمیں یقین ہو گیا کہ یہاں غیرت (الغيرة) نے حکم کیا، پس اس نے کسی کے لیے فردیت (طاق ہونا) ثابت نہیں کی، مگر یہ کہ اس نے حق کی ہویت (هوية الحق) کے ساتھ اسے شفع بنا دیا، تاکہ احدیت (الأحدية) صرف اسی کے لیے ہو۔ پس کوئی مخلوق اس کی فردیت کو شفع نہ بنائے، اور وہ مخلوق کی فردیت کو شفع بنائے۔ اسی لیے اس نے فرمایا: **وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ** (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو)۔ اور یہ نہیں کہا کہ \"اور تم اس کے ساتھ ہو\"، کیونکہ وہ مصاحبت میں مجہول ہے، پس وہ سبحانہ جانتا ہے کہ وہ کیسے ہمارے ساتھ ہے، اور ہم نہیں جانتے کہ ہم کیسے اس کے ساتھ ہیں۔ پس معیت (ساتھ ہونا) اس کے لیے ہم میں ثابت ہے، اور ہم سے اس میں منفی ہے۔ اور اس نے یہ نہیں کہا کہ \"اور نہ چار کی مگر وہ ان کا پانچواں ہوتا ہے\" اور نہ \"اور نہ دو کی مگر وہ ان کا تیسرا ہوتا ہے\"، کیونکہ غیرت (الغيرة) اکوان (موجودات) میں شفعیت (جفت ہونے) سے متعلق نہیں ہوتی، کیونکہ شفع کی ایک حقیقت ہے۔ بلکہ یہ وتریت (طاق ہونے) سے متعلق ہوتی ہے جب اسے اکوان کی طرف منسوب کیا جائے، اور وہ اس کی مستحق نہیں ہیں۔ پس ہم اسے حق کے ساتھ وتر (طاق) بناتے ہیں تاکہ اشیاء میں ظہور صرف اسی کا ہو۔ اور یہ اس کے غیرت (الغيرة) کے وصف پر سب سے قوی دلائل میں سے ہے، کیونکہ یہ غیر کو دیکھنے سے مشتق ہے، کیونکہ یہ شرکت کا تقاضا کرتا ہے، اور اللہ غیر کی شرکت سے پاک ہے۔ پس وہ اس بات سے پاک ہے کہ وہ احد (الأحد) کے علاوہ ہو یا کوئی اور الٰہ ہو۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: **لا أحد أو كما قال أغير من الله** (اللہ سے زیادہ غیرت مند کوئی نہیں، یا جیسا کہ آپ نے فرمایا)\n\nپس اس نے اسے غیرت (الغيرة) کے ساتھ متصف کیا، اور اس مقام میں اس کا حکم قوی ہے۔ پس ہم نے اس مقام کے عطا کردہ علوم میں سے کچھ کا ذکر کیا، وقت کی تنگی کے باوجود۔ **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔ اور اس مقام میں احدیت (الأحدية) کا علم، اور اس کا وحدانیت (الوحدانية) سے فرق، اور نسب الٰہی کا علم شامل ہے۔\n\nاللہ تعالیٰ قیامت کے دن فرمائے گا: **اليوم أضع نسبكم وأرفع نسبي أين المتقون** (آج میں تمہارے نسب گراتا ہوں اور اپنا نسب بلند کرتا ہوں، متقی کہاں ہیں؟)\n\nاور بسائط (سادہ چیزوں) کا علم، اور علم ضروری، اور تماثل (یکسانیت) کا علم۔ **والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ** (اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔",
    "fa": "باب دویست و هفتاد و دوم در معرفت منزل تنزیه التوحید (Tanzīh al-Tawḥīd)\n\nبه تنزیه توحید الهی سخن می‌گویم،\nو آن نوری است که نزد اوست و من می‌گویم.\nو تنزیه او میان ذات و مرتبه است،\nو همانا کسی که آن را می‌داند، اندک است.\nاو از تنزیه هر منزّهی منزّه است،\nپس هر که سخنی خواهد، بگوید به گفتار.\nزیرا هستی (al-Wujūd) حق (al-Ḥaqq) در حرف غیب اوست،\nپس حرف حضور را بر آن پذیرشی نیست.\n\n[اینکه مراد از لفظ تنزیه التوحید (Tanzīh al-Tawḥīd) دو امر است]\n\nبدان، خداوند ما و شما را به روحی از جانب خود تأیید کند، که مراد از لفظ تنزیه التوحید (Tanzīh al-Tawḥīd) دو امر است: اول اینکه توحید (al-Tawḥīd) متعلق تنزیه (al-Tanzīh) باشد، نه حق (al-Ḥaqq) سبحانه؛ و امر دیگر اینکه تنزیه به توحید اضافه شود، به این معنا که حق تعالی ممکن است به تنزیه توحیدِ خود منزّه شود، نه به تنزیه کسی از مخلوقات که او را به توحید منزّه کرده است. مانند ستایشِ ستایش، زیرا ثبوت صفت برای موصوف، ادعایی در آن نیست و احتمال در آن راه نمی‌یابد، در حالی که وصف‌کننده خود یا دیگری به صفتی، نیازمند دلیلی بر صدق ادعای خویش است. در این باره فصولی مطرح می‌شود که آیات کتاب بر آن‌ها دلالت دارند، از جمله اینکه آیا اضمار (ذکر ضمیر قبل از مرجع) پیش از ذکر مرجع در غیر ضرورت شعر صحیح است یا خیر؟ شاعر می‌گوید:\n\nجزى ربه عني عدي بن حاتم\n(پروردگارش از جانب من به عدی بن حاتم پاداش داد)\n\nپس ضمیر را قبل از ذکر مرجع آورده است، اما شعر جایگاه ضرورت است.\nاز فصول این منزل، امر به توحید خداوند است، پس در آن توحیدِ خودِ حق (al-Ḥaqq) نیست و تقلید در توحید به آن مربوط می‌شود، زیرا امر به کسی که دلیل را به او می‌دهد، تعلق نمی‌گیرد، مگر اینکه متعلق امر، استدلال باشد نه تعریف از طریق تسلیم، یا استدلال از طریق تنبیه بر موضع دلالت، مانند قول او: إِذاً لَذَهَبَ كُلُّ إِلهٍ بِما خَلَقَ (در آن صورت، هر خدایی آنچه را آفریده بود، با خود می‌برد) و مانند قول او: لَوْ كانَ فِيهِما آلِهَةٌ إِلَّا الله لَفَسَدَتا (اگر در آسمان و زمین خدایانی جز الله بودند، قطعاً تباه می‌شدند) و مانند قول او: لَمْ يَلِدْ ولَمْ يُولَدْ (نزاده است و زاده نشده است).\nاز فصول این منزل، قول خدای تعالی است: ما اتَّخَذَ صاحِبَةً ولا وَلَداً (نه همسری برگزیده و نه فرزندی) به دلیل نبود کفویت، زیرا لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ (و هیچ‌کس همتای او نبوده است). پس اگر کفویت موجود بود، این امر جایز می‌شد. خداوند عز و جل فرمود: ولا تَنْكِحُوا الْمُشْرِكاتِ حَتَّى يُؤْمِنَّ (و با زنان مشرک ازدواج نکنید تا ایمان بیاورند)، پس کفویت را به دین قرار داد. و قول او: لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً (اگر خداوند می‌خواست فرزندی برگزیند)، پس آن را از قبیل امکان قرار داد و فرمود: لَاصْطَفى‏ (قطعاً برمی‌گزید). و اصطفا (برگزیدن) نوعی جعل (قرار دادن) است و مجعول (قرار داده شده) با کفویت برای جاعل (قرار دهنده) منافات دارد. و مرتبه فاعل کجا و مرتبه مفعول کجا؟\nاز فصول این منزل، تنزیه (al-Tanzīh) از این است که با مقدماتی که وجود او یا معرفت (al-Ma‘rifah) به او را نتیجه می‌دهند، درک شود. خداوند از این امر بسیار برتر است.\nاز فصول این منزل، این است که او مقدمه‌ای برای تولید چیزی نباشد، به دلیل ترکیبی که مقدمات به آن متصف می‌شوند و سبب رابط در مقدمات که مستلزم مناسبت است. و مناسبت میان خلق و حق (al-Ḥaqq) نه معقول است و نه موجود. پس چیزی از حیث ذات او صادر نمی‌شود و او نیز از حیث ذات خود از چیزی صادر نمی‌شود. و هر آنچه شرع بر آن دلالت کرده یا عقل آن را دلیل قرار داده است، متعلق آن تنها الوهیت است نه ذات. و خداوند از حیث اینکه اله است، همان کسی است که ممکن (al-Mumkin) برای امکان خود به او استناد می‌کند. پس آنچه به فصول این منزل مربوط می‌شود را به اختصار ذکر می‌کنیم، ان‌شاءالله.\n\n[حضرت الهی به سه بخش ذات، صفات و افعال تقسیم می‌شود]\n\nبدان که این منزل، چهارمین منزل از منزل عظمت در حق اصحاب بدايات است و صد و یازدهمین منزل در حق اکابر روحانیین است. و چون حضرت الهی به سه بخش ذات، صفات و افعال تقسیم می‌شود، این منزل یکی از آن‌ها و سومین بخش از آن‌هاست. و چون صفات بر دو قسم صفت فعل و صفت تنزیه (al-Tanzīh) هستند، این منزل صفت تنزیه از آن دو است.\nاما تنزیه التوحید (Tanzīh al-Tawḥīd) این است که این توحیدی (al-Tawḥīd) که ما به جناب حق (al-Ḥaqq) نسبت می‌دهیم، منزّه است از اینکه به غیر حق نسبت داده شود. پس منزّه حقیقی، توحید است نه حق. و ما این را گفتیم زیرا جایز است که غیر حق به آنچه لفظ اقتضا می‌کند، وصف شود، چنانکه مشارکت در اطلاق لفظ هستی (al-Wujūd)، علم، قدرت و سایر اسماء در حق حق و خلق واقع شده است. پس این منزل، این توحید منسوب به خدا را تنزیه می‌کند از اینکه غیر او به آن وصف شود، زیرا این توحید ذات از جمیع وجوه است و غیر او نه در لفظ و نه در معنا به این توحید وصف نمی‌شود.\nو ذات حق که این توحید به او منسوب است، تنزیه به آن تعلق نمی‌گیرد، زیرا تنزیه بر او جایز نیست تا از وصفی که بر او جایز است، دور شود، چرا که او در نفس‌الامر منزّه است، نه به تنزیه منزّه‌کننده‌ای.\nاما اگر تنزیه التوحید (Tanzīh al-Tawḥīd) متعلق به حق سبحانه باشد، پس او از حیث ذات خود به زبان عین این وصف که توحید برای اوست، منزّه می‌شود، مانند ثنای زبان صفت کرم به کریم، به دلیل قیام آن صفت به موصوف، نه به قول گوینده و دلیل ناظر. اینکه او سبحانه واحد است، پس این وصف را داشته است و تو نبودی، و این وصف را دارد و تو هستی.\nو چون این امر بر این حد باشد، پس هیچ موجودی نیست که صحیح باشد قبل از ذکر، ضمیر آن آورده شود، مگر کسی که مستحق غیب مطلق است که به هیچ وجهی نمی‌تواند مشهود شود. پس ضمیر غیب برای او مانند اسم جامد عَلَم (اسم خاص) برای مسمّی است که در اولین وهله بر او دلالت می‌کند، بدون اینکه نیازی به ذکر متقدمی باشد که در نفس شنونده مقرر شده باشد و این ضمیر به آن بازگردد. پس صحیح نیست که «هو» (او) گفته شود مگر به طور خاص در مورد الله.\nو اگر بر غیر الله اطلاق شود، تنها پس از ذکر متقدم معروفی که به هر وجهی شناخته شده است، اطلاق می‌شود و گفته می‌شود: «هو». و عین محل این ضمیر نزد کسی که صحیح نیست در مورد او «هو» گفته شود، مشهود است، به دلیل حضور او نزد وی. پس اسم «هو» (ضمیر غایب) با نظر به آن از او زائل می‌شود و با نظر به کسی که از او غایب است، اسم «هو» برای او ثابت می‌گردد.\nاگر گفته شود: اگر آنچه مقرر کردی صحیح باشد، پس او سبحانه برای خود مشهود است و با نظر به شهود خود، «هو» از او زائل می‌شود، پس «هو» برای او به منزله اسم عَلَم نیست، چنانکه گمان کردی.\nمی‌گوییم: اگرچه خود را شهود می‌کند، اما هویت (al-Huwiyyah) معلوم است نه مشهود، و این همان است که اسم «هو» بر آن اطلاق می‌شود. این بر مذهب ماست که مذهب اهل حق است. چگونه، در حالی که گروهی هستند که می‌گویند او خود را نمی‌داند، پس «هو» برای او از جانب ما و از جانب خودش زائل نمی‌شود.\nخدای تعالی در ابتدای سوره اخلاص به پیامبرش (صلی الله علیه و سلم) فرمود: قُلْ هُوَ الله أَحَدٌ (بگو: اوست خدا، یکتا). پس با ضمیر شروع کرد و ذکری متقدم که در نفس قرآن به آن بازگردد، نیامد. اگرچه یهود به او گفتند: پروردگارت را برای ما وصف کن. پس شاید صاحب زبان توهم کند که این ضمیر به پروردگاری که یهود ذکر کردند، بازمی‌گردد.\nو باید بدانی که مراد از این ضمیر، پروردگاری نیست که یهود ذکر کردند، زیرا خداوند متعالی است از اینکه خلقش معرفت ذات او را درک کنند. و به همین دلیل فرمود: هُوَ الله. و در تمام سوره چیزی که دلالت بر خلق کند، ذکر نشده است، بلکه آن سوره را مملو از تبرّی از خلق قرار داد. پس معرفت (al-Ma‘rifah) به خود را نتیجه‌ای از خلق قرار نداد و خدای تعالی فرمود: ولَمْ يُولَدْ (و زاده نشده است). و خلق را در وجود خود نتیجه‌ای از خود قرار نداد، چنانکه برخی با هر نسبتی گمان می‌کنند، پس خدای تعالی فرمود: لَمْ يَلِدْ (نزاده است).\nو تشبیه را با احدیت (al-Aḥadiyyah) هر احدی نفی کرد به قولش: ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ (و هیچ‌کس همتای او نبوده است). و احدیتی را برای او اثبات کرد که برای غیر او نیست. و صمدانیت را برای او اثبات کرد که صفت تنزیه و تبرئه است. پس این احتمال که ضمیر به پروردگار مذکور که مضاف به خلق است در قولشان به پیامبر (صلی الله علیه و سلم): «انسب لنا ربک» (پروردگارت را برای ما وصف کن)، بازگردد، منتفی شد. زیرا آنان او را به خودشان اضافه کردند نه به حق. و هنگامی که پیامبر (صلی الله علیه و سلم) او را به آنچه بر او نازل شد، نسبت داد، او را نه به خود و نه به آنان اضافه نکرد، بلکه او را به آنچه جلالش مستحق آن است، ذکر کرد.\nپس ضمیر در «هو الله» به کسی که ذکر شد، بازنمی‌گردد. و مطلق کجا و مقید کجا؟ هویت (al-Huwiyyah) مقید، هویت مطلق نیست. هویت مقید نسبتی است که به کَوْن (al-Kawn) تعلق می‌گیرد و به آن مقید می‌شود، زیرا کَوْن به آن مقید شده است. پس گفته می‌شود: خالق و مخلوق، قادر و مقدور، عالم و معلوم، مرید و مراد، سمیع و مسموع، بصیر و مبصَر، متکلم و مُکلَّم. اما حی (زنده) چنین نیست، پس هویت او تعلقی به کَوْن ندارد. و قیوم نیز چنین نیست.\nپس اگر آنچه را ذکر کردیم دانستی، فهمیدی که اضمار قبل از ذکر تنها در مورد الله صحیح است و پس از ذکر، مشارکت در آن واقع می‌شود. خدای تعالی فرمود: الله الَّذِي لا إِلهَ إِلَّا هُوَ (اوست خدایی که جز او معبودی نیست)، پس ضمیر را به الله که در ابتدای آیه ذکر شده بود، بازگرداند.\n\n[اینکه توحیدی که بنده به آن امر می‌شود، غیر از توحیدی است که حق خود را به آن واحد می‌داند]\n\nو بدان که توحیدی (al-Tawḥīd) که بنده به دانستن یا گفتن آن امر می‌شود، آن توحیدی نیست که حق (al-Ḥaqq) خود را به آن واحد می‌داند. زیرا توحیدِ امر، مرکب است، چرا که مأمور به آن مخلوق است و از مخلوق جز آنچه مناسب اوست صادر نمی‌شود، و او مخلوق از مخلوق است. پس در خلق، از آن کسی که این توحید از او موجود شده، از خدا دورتر است.\nاین حکم بر هر مذهبی از نفی‌کنندگان افعال از مخلوقین و اثبات‌کنندگان آن جاری است، زیرا نفی‌کنندگان قائل به کسب هستند و غیر نفی‌کنندگان قائل به ایجاد. پس چگونه آنچه مضاف به خلق است، شایسته جناب عزیز باشد؟ اگرچه ما شرعاً به آن تعبد یافته‌ایم، پس آن را در جایگاه خود مقرر می‌کنیم و آن را چنانکه به ما امر شده است، به قصد قربت به او می‌گوییم، در حالی که قدم ما در آنچه حق از معرفت (al-Ma‘rifah) به خود به ما شهود (al-Shuhūd) داده است، ثابت است؛ از این حیث که او در لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست) شناخته نمی‌شود، و در آنچه در سوره اخلاص ذکر کرده است، و در عموم قولش به تسبیح که همان تنزیه (al-Tanzīh) است: رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ (پروردگار عزت از آنچه وصف می‌کنند، منزّه است). و عزت اقتضای منع از رسیدن به معرفت او را دارد.\nو از اسرار این منزل، قول اوست: لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً (اگر خداوند می‌خواست فرزندی برگزیند). اگرچه «لو» حرف امتناع است، اما امتناع چیزی به دلیل امتناع غیر آن است، پس آن عدم برای عدم است. اگر حرف «لا» بعد از «لو» بیاید، «لو» حرف امتناع برای وجود خواهد بود. و در این آیه «لا» نیامده است. پس اراده را از تعلق به اتخاذ ولد (برگزیدن فرزند) نفی کرد و نگفت: «اگر فرزندی می‌زایید»، زیرا او می‌گوید: لَمْ يَلِدْ (نزاده است).\nو فرزند برگزیده (متّخذ) موجودالعین است بدون اینکه فرزند حقیقی باشد، پس به حکم اصطفا (برگزیدن) و تقریب در منزلت، او را از جانب خود به منزله فرزند از پدری که برای او ولادت دارد، قرار می‌دهد. و حقیقت از ولادت و تبنّی (به فرزندی گرفتن) منع می‌کند، زیرا نسبت از ذات مرتفع است. و نسبت الهی از جانب خدا به جمیع خلق، نسبتی واحد است که در آن تفاضلی نیست، زیرا تفاضل مستلزم کثرت است.\nبه همین دلیل لفظ «لو» را آورد و بعد از آن لفظ «لا» را قرار نداد. پس حرف امتناع بود، یعنی آن واقع نشده و واقع نمی‌شود، به دلیل امتناع ذات از اینکه به آنچه شایسته آن نیست، وصف شود. و به همین دلیل بعد از قول خدای تعالی: وأَنَّهُ تَعالى‏ جَدُّ رَبِّنا (و اینکه شأن پروردگار ما بسیار والاست)، فرمود: ما اتَّخَذَ صاحِبَةً ولا وَلَداً (نه همسری برگزیده و نه فرزندی). پس او را به علو از قیام این وصف، به دلیل عظمت رب (پروردگار) که به مربوب (پرورده شده) اضافه شده است، وصف کرد. پس چگونه است در مورد رب بدون اضافه لفظی؟ و چگونه است در مورد اسم «الله»؟ و چگونه است در مورد ذات بدون اسم؟ پس تنزیهی بزرگ‌تر از این چه می‌تواند باشد؟\nو اما نفی کفویت و مِثل، شاید کسی که معرفت (al-Ma‘rifah) به حقایق ندارد، توهم کند که اگر کفویت موجود بود، وقوع ولد به وجود صاحبه‌ای که کفو است، جایز می‌شد. پس باید بداند که کفویت، مشروع است نه معقول. و شرع تنها از یک طرف آن را لازم دانسته است نه از دو طرف. پس زن را از ازدواج با کسی که کفو او نیست، منع کرد، اما مرد را از ازدواج با کسی که کفو او نیست، منع نکرد. و به همین دلیل مرد می‌تواند با کنیز خود به ملک یمین ازدواج کند، اما زن نمی‌تواند با بنده خود ازدواج کند. و حق (al-Ḥaqq) مخلوق نیست و او والد بود اگر فرزندی داشت. و کفویت از جهت صاحبه لازم نیست. پس مانع برای وجود ولد، نه به دلیل عدم کفویت، بلکه به دلیل آنچه ذات از ارتفاع نسب و نسبت‌ها مستحق آن است، و آنچه احدیت (al-Aḥadiyyah) الوهیت مستحق آن است، مرتفع شد. زیرا فرزند شبیه پدرش است. پس مفهوم کسی که ما اتَّخَذَ صاحِبَةً ولا وَلَداً را بر جواز آن حمل کرده است، باطل شد، زیرا آن متّخذ (برگزیده) بود. و مفهوم از آن و از نفی کفو و مِثل، همان است که ذکر کردیم.\nو چون تنزیه (al-Tanzīh) برای ذات بر آنچه مقرر کردیم، ثابت شد، باطل است که معرفت (al-Ma‘rifah) به او که در ما قائم است، نتیجه‌ای از معرفت ما به خودمان باشد، به دلیل استناد ما به او از حیث امکانمان. و این امر متضمن معرفت ذات او به صفت ثبوتی نفسی که او بر آن است، نیست. بلکه صحیح‌تر از آن، تنها استناد به ذاتی است که از آنچه به ما نسبت داده می‌شود، منزّه است و آنچه از حیث نفسیت به او نسبت داده می‌شود، نزد ما مجهول است. پس او سبحانه هرگز شناخته نمی‌شود.\nو چون معرفت (al-Ma‘rifah) به او از نزاهت و علو به این حد است، سزاوارتر است که وجود او معلولِ علتی نباشد که در مرتبه بر او تقدم داشته باشد، یا مشروط به شرطی متقدم، یا محققِ حقیقتی حاکم، یا مدلولِ دلیلی که وجه آن دلیل او را به آن مرتبط سازد. پس سبحانه هیچ جامعی از این چهار جامع میان ما و او نیست. پس معرفت ما به او، در نزاهت و رفعت از ادراک، به وجود او ملحق شد.\nو همان‌طور که صحیح نبود که چیزی او را تولید کند، هویت (al-Huwiyyah) او نیز از حیث هویتش، نه از حیث مرتبه‌اش، چیزی را تولید نمی‌کند. زیرا اگر چیزی از حیث هویتش به او مرتبط می‌شد، هویت او به آن چیز مرتبط می‌شد. پس صحیح نیست که او علت برای معلول، یا شرطا برای مشروط، یا حقیقت برای محقق، یا دلیل برای مدلول باشد. به ویژه که او سبحانه مطلقاً فرمود: لَمْ يَلِدْ (نزاده است) و قیدی نگذاشت. پس اگر حقیقت بود، محققی را می‌زایید، و اگر دلیل بود، مدلولی را می‌زایید، و اگر علت بود، معلولی را می‌زایید، و اگر شرط بود، مشروطی را می‌زایید. پس او سبحانه مستند مجهولی است که عقول آن را درک نمی‌کنند و فصول، اجمال آن را تفصیل نمی‌دهند. این نیز وجهی از وجوه تنزیه التوحید (Tanzīh al-Tawḥīd) است.\nو اما آنچه به واحد (al-Wāḥid) و احد (al-Aḥad) از توحید (al-Tawḥīd) در احدیت (al-Aḥadiyyah) او مربوط می‌شود، لفظ احدیت به طور ثابت بر غیر او اطلاق نشده است. پس فرمود: ولا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً (و هیچ‌کس را در عبادت پروردگارش شریک نسازد). اگرچه مفهوم آن با نظر به تفسیر معانی بر طریق اهل الله این است که او از حیث احدیتش عبادت نمی‌شود، زیرا احدیت با وجود عابد منافات دارد. پس گویی می‌گوید: جز رب (پروردگار) از حیث ربوبیتش عبادت نمی‌شود. زیرا رب تو را ایجاد کرده است، پس به او تعلق بگیر و برای او تذلل کن. و احدیت را با ربوبیت در عبادت شریک مساز تا برای آن تذلل کنی، چنانکه برای ربوبیت تذلل می‌کنی. زیرا احدیت تو را نمی‌شناسد و نمی‌پذیرد. پس این تعبد در غیر معبد و طمع در غیر مطمع و عمل در غیر مَعمَل است و این عبادت جاهل است. پس عبادت عابدان را از التعلق بالأحدية نفی کرد، زیرا احدیت مطلقاً جز برای خدا ثابت نیست. و اما آنچه غیر خداست، مطلقاً احدیتی برای او نیست. این همان مفهومی است که ما از این آیه داریم، از حیث طریق ما در تفسیر قرآن. و اهل رسوم نیز سهم خود را از آن می‌گیرند، به عنوان تفسیری برای معنا، و احد مذکور را بر آنچه از شرکا برگزیده‌اند، حمل می‌کنند، و این نیز تفسیر صحیحی است. پس قرآن دریایی است که ساحلی ندارد، زیرا مقصود از آنچه به آن نسبت داده می‌شود، جمیع معانی‌ای است که کلام طلب می‌کند، برخلاف کلام مخلوقین.\nو چون این را دانستی، مراد از قول جل ثناؤه به پیامبرش (صلی الله علیه و سلم) را دانستی: قُلْ هُوَ الله أَحَدٌ (بگو: اوست خدا، یکتا)، یعنی در این صفت شریک ندارد.\nو اما واحد (al-Wāḥid)، ما در قرآن نظر کردیم که آیا آن را بر غیر خود اطلاق کرده است، چنانکه احدیت را اطلاق کرده است؟ آن را نیافتم و در این باره یقین ندارم. اگر آن را اطلاق نکرده باشد، پس اخص از احدیت است و اسم عَلَم برای ذات خواهد بود و صفت نخواهد بود، مانند احدیت، زیرا صفت محل اشتراک است. و به همین دلیل احدیت بر هر آنچه غیر خداست در قرآن اطلاق شده است. و کلام مردم و اصطلاح آن‌ها معتبر نیست، بلکه به آنچه در قرآن که کلام خداست، وارد شده، نگریسته می‌شود. پس اگر در کلام خدا لفظ واحد (al-Wāḥid) یافت شود، حکم آن حکم احدیت خواهد بود به دلیل اشتراک لفظی در آن. و اگر در کلام خدا لفظ واحد که بر غیر اطلاق شود، یافت نشود، آن را به خصایصی که ذات مستحق آن است، ملحق می‌کند و مانند اسم «الله» خواهد بود که هیچ‌کس جز او به آن نامیده نشده است.\nو از آنچه به این منزل از تنزیه (al-Tanzīh) خاص آن مربوط می‌شود، معارفی است که در کتاب *مواقع النجوم* در تجلی صمدانی (al-Tajallī al-Ṣamadānī) ذکر کرده‌ایم. و مراد ما از آن، چیزی نیست که عارف ابوعبدالله البستی در کتاب خود که درباره عبد الرب و عبد الصمد نوشته، اراده کرده است. زیرا صمدی که ما اراده می‌کنیم، نه اضافه می‌شود و نه به آن اضافه می‌شود. زیرا متضایفین (دو چیزی که به هم اضافه می‌شوند) ناگزیر باید بینیت (نسبت میانی) داشته باشند تا نسبتی رابط میانشان باشد که به واسطه آن اضافه برایشان محقق شود.\nپس صمدی که بستی در «عبد الصمد» اراده کرده، کسی است که به او پناه برده می‌شود و به او تعلق گرفته می‌شود و با توجه با او مقابله می‌شود. و به همین دلیل شریعت نمازگزار را نهی کرده است که اگر پشت ستون یا عصا یا انتهای رحل یا مانند آن پنهان شد، مستقیماً به آن صمد (قصد) کند، بلکه کمی به راست یا چپ از آن منحرف شود. و کسی که به او صمد می‌شود، از اوصاف تنزیه نیست، بلکه از اوصاف کرم است. پس صمدیت مطلقه از این تقیید، همان است که شایسته صفت تنزیه است، زیرا تعلقی به کَوْن (al-Kawn) ندارد و این همان مطلوب در این منزل است و شرح آن در لغت در [کتاب] اسماء الهی مذکور است.\n\n[اینکه منزل تنزیه التوحید (Tanzīh al-Tawḥīd) احدیت (al-Aḥadiyyah) را می‌طلبد]\n\nو بدان که این منزل، اگرچه احدیت (al-Aḥadiyyah) و تنزیه (al-Tanzīh) را از جمیع وجوه می‌طلبد، اما در کشف (al-Kashf) صوریِ مقید به ظاهر، به صورت خانه‌ای ظاهر می‌شود که بر پنج ستون ایستاده و سقفی برافراشته بر آن است و دیوارهایی آن را احاطه کرده‌اند که هیچ دری در آن‌ها باز نیست. پس برای هیچ‌کس به هیچ وجهی در آن دخول نیست. اما خارج از خانه، ستونی قائم است که به دیوار خانه چسبیده است و اهل کشف (al-Kashf) به آن تبرک می‌جویند، همان‌طور که حجرالاسود را که خداوند خارج از خانه قرار داده و آن را دست راست خود قرار داده و به خود اضافه کرده است نه به خانه، می‌بوسند و به آن تبرک می‌جویند. همچنین این ستون به این منزل اضافه نمی‌شود، اگرچه از آن است، اما خاص آن نیست، زیرا در هر منزل الهی موجود است و گویی ترجمانی است میان ما و معارفی که منازل می‌دهند.\nابن مسرّه جبلی در کتاب *الحروف* خود به این نکته توجه داده است. و این ستون زبانی فصیح دارد که آنچه را منازل در بر دارند، برای ما بیان می‌کند و ما از آن علم آن را استفاده می‌کنیم. و از منازل، برخی هستند که در آن‌ها وارد می‌شویم و در زوایای آن‌ها راه می‌رویم و امر را بر همان حدی که در آن شناخته‌ایم، می‌یابیم. و از منازل، برخی هستند که راهی برای دخول به آن‌ها نداریم، مانند این منزل. پس ما از این ستون، تعریف را به حکم تسلیم می‌گیریم، زیرا دلیل بر عصمت آن در آنچه در عالم کشف (al-Kashf) با ما سخن می‌گوید، برای ما قائم شده است، مانند رسول در عالم حس. پس او زبان حق (al-Ḥaqq) است.\nو برخی از مردم آن را به ستون‌های خانه ملحق می‌کنند، زیرا بخشی از دیوار بر آن است و جز یک وجه از آن برای ما ظاهر نمی‌شود و بقیه آن در دیوار مستور است. پس برخی از مکاشفین می‌گویند که خانه بر شش ستون قائم است. پس تناقضی میان اثبات‌کنندگان پنج ستون و شش ستون در قیام خانه بر آن‌ها نیست. ما این را برای تو بیان کردیم تا گمان نکنی که حق در یکی از دو قول و با یکی از دو طایفه است. پس هر دو طایفه صادق هستند. به همین دلیل کیفیت آن را به تو خبر دادم. و همچنین است جمیع آنچه برای مردم ظاهر می‌شود که در آن اختلاف کرده‌اند. به حمدالله میان این قوم در آنچه به آن متحقق می‌شوند، اختلافی نیست، بلکه آنان در کار خود صحیح‌تر و محق‌تر از اهل حس در آنچه با حواس خود درک می‌کنند، هستند.\nو بدان که دخول به این منزل از دینار دوم که برای رجولیت (مردانگی) و نهایت در آن است، تا دینار چهارم است که تمام رجولیت است و شخص به واسطه آن مرد نامیده می‌شود، چنانکه پیش‌تر در ترتیب ایمان، ولایت، نبوت و رسالت بیان کردیم. و پنجمی برای آن نیست که پنجمِ پنج باشد، بلکه ممکن است برای چهار، پنجمی باشد. پس این را بدان.\nو اگر به آنچه حق تعالی تفصیل داده است، توجه کنی، تو نیز تفصیل آن را در آنچه او به اجمال گفته است، خواهی دانست، در قولش: ولا أَدْنى‏ من ذلِكَ (و نه کمتر از آن)، یعنی دو، ولا أَكْثَرَ (و نه بیشتر از آن)، یعنی هفت و افراد بالاتر از آن. پس حق با قولش تفصیل داد: ما يَكُونُ من نَجْوى‏ ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ ولا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ (هیچ رازگویی سه نفری نیست مگر اینکه او چهارمین آن‌هاست، و نه پنج نفری مگر اینکه او ششمین آن‌هاست). و نگفت: «و نه چهار نفری مگر اینکه او پنجمین آن‌هاست» و «نه دو نفری مگر اینکه او سومین آن‌هاست».\nپس از «کمتر از آن» و «بیشتر از آن» دانستیم که او افراد (اعداد فرد) را اراده کرده است و آن‌ها را با آنچه از آن‌ها نیست، شفع (جفت) می‌کند. پس محقق شدیم که غیرت (al-Ghayrah) در اینجا حکم کرده است. پس برای هیچ‌کس فردیت (al-Fardiyyah) را ثابت نکرد، مگر اینکه هویت (al-Huwiyyah) حق (al-Ḥaqq) آن را شفع کند، تا احدیت (al-Aḥadiyyah) جز برای او نباشد. پس مخلوق، فردیت او را شفع نمی‌کند و او فردیت مخلوقین را شفع می‌کند. و به همین دلیل فرمود: وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ (و او با شماست هر جا که باشید). و نگفت: «و شما با او هستید»، زیرا مصاحبت او مجهول است. پس او سبحانه می‌داند چگونه با ما مصاحبت می‌کند و ما نمی‌دانیم چگونه با او مصاحبت کنیم. پس معیت (همراهی) برای او در ما ثابت است و از ما در او نفی شده است.\nو نگفت: «و نه چهار نفری مگر اینکه او پنجمین آن‌هاست» و «نه دو نفری مگر اینکه او سومین آن‌هاست»، زیرا غیرت (al-Ghayrah) به شفعیت (زوجیت) در اکوان (al-Akwān) تعلق نمی‌گیرد، زیرا شفع برای خود حقیقتی دارد. بلکه تنها به وتریت (فردیت) تعلق می‌گیرد، هنگامی که به اکوان نسبت داده شود، در حالی که اکوان مستحق آن نیستند. پس ما آن را با حق وتر (فرد) می‌کنیم تا ظهور برای او تعالی در اشیاء باشد. و این از قوی‌ترین دلایل بر وصف او تعالی به غیرت (al-Ghayrah) است، زیرا غیرت مشتق از دیدن غیر است، چون مستلزم مشارکت است. و خداوند از مشارکت غیر مبراست. پس او مبراست از اینکه غیرِ احد باشد یا احدی غیرِ اله باشد.\nپیامبر (صلی الله علیه و سلم) فرمود:\nلا أحد أو كما قال أغير من الله\n(هیچ‌کس یا چنانکه فرمود، از خدا غیورتر نیست)\nپس او را به غیرت وصف کرد و حکم آن در این مقام قوی است. این بود آنچه به اختصار از عطایای این منزل ذکر کردیم، با وجود تنگی وقت. و الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند).\nو در این منزل از علوم، علم احدیت (al-Aḥadiyyah) و فرق میان آن و وحدانیت، و علم نسب الهی است.\nخداوند متعال روز قیامت می‌فرماید:\nاليوم أضع نسبكم وأرفع نسبي أين المتقون\n(امروز نسب شما را فرومی‌نهم و نسب خود را فرامی‌برم. پرهیزگاران کجایند؟)\nو علم بسائط، و علم ضروری، و علم تماثل. و الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (و ستایش از آن خداست که پروردگار جهانیان است)."
  },
  "page_count": 5
}