{
  "id": 554,
  "title": {
    "ar": "الباب الرابع والخمسون وخمسمائة في معرفة حال قطب كان منزله لا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِما أَتَوْا ويُحِبُّونَ أَنْ يُحْمَدُوا بِما لَمْ يَفْعَلُوا",
    "en": "Chapter Five Hundred and Fifty-Four: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا>> (Do not think that those who rejoice in what they have brought and love to be praised for what they did not do).",
    "ur": "باب نمبر پانچ سو چوون (۵۵۴)\n\nایک قطب (Qutb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا روحانی مقام (منزل) یہ تھا: \"ہرگز یہ گمان نہ کرنا کہ وہ لوگ جو اپنے کیے پر خوش ہوتے ہیں اور یہ پسند کرتے ہیں کہ ان کی تعریف ایسے کاموں پر کی جائے جو انہوں نے نہیں کیے\" (لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا)۔",
    "fa": "باب پانصد و پنجاه و چهارم در معرفت حال قطبی که منزلگاهش این آیه بود: «گمان مبر کسانی که به آنچه انجام داده‌اند شادمان می‌شوند و دوست دارند به خاطر آنچه نکرده‌اند ستایش شوند» (آل عمران: ۱۸۸)."
  },
  "content": {
    "ar": "## «الباب الرابع والخمسون وخمسمائة في معرفة حال قطب كان منزله لا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِما أَتَوْا ويُحِبُّونَ أَنْ يُحْمَدُوا بِما لَمْ يَفْعَلُوا»\n\n\n> لا تحسبن رجالا يفرحون بما *** أتوا وليس لهم فيما أتوا قدم‏\n\n\n> ويفرحون بحمد الخلق فيه وما *** لهم من الفعل إلا الفقد والعدم‏\n\n\n> وذاك هجير ختم الأولياء ومن *** يكن له مثل هذا الوصف ينعدم‏\n> وهو الإمام الذي رست قواعده *** الطيب الطاهر المحسان والعلم‏\n\n\n> تعنو له أوجه الأملاك قاطبة *** والخلق تعنو له واللوح والقلم‏\n\n\n### [العذاب والألم‏]\n\n\nاعلم أيدنا الله وإياك بِرُوحٍ مِنْهُ أني التزمت هذا الذكر أيضا سنين متعددة حتى كنت أسمي به في بلدي كما كنت أسمي أيضا يغيره من الأذكار ورأيت له بركات ظاهرة فلا بقوله أَتَوْا ولا بقوله بِما لَمْ يَفْعَلُوا فهو قوله فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ وقوله وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ فيجي‏ء الإنسان بالفعل من كون الفعل ظهر فيه فيحب إن يحمد بما فعل فيه والفعل ليس له فله من الالتذاذ بذلك على قدر دعواه إلا أنه التذاذ موجع لكونه يعلم الأمر على خلاف دعواه كالمتكبر الجبار الذي لا يمكن له أن ينتزح عن ضروراته وافتقاره إلى أدنى الأسباب المريحة له من ألمه فقوله فَلا تَحْسَبَنَّهُمْ بِمَفازَةٍ من الْعَذابِ يقول لا تظن أنهم يلتذون بذلك إشارة لا حقيقة ويستعذبونه بل لهم فيه استعذاب إن كانوا عارفين فجمعوا في هذا الذوق بين العذاب والألم فهم من وجه في نعيم ومن وجه في ألم مؤلم كما قال بعضهم‏\n\n\n> فهل سمعتم بصب *** سليم طرف سقيم‏\n\n\n> منعم بعذاب *** معذب بنعيم‏\n\n\n### [إن الكمل من الرجال بمنزلة اسم من الأسماء الإلهي‏]\n\n\nواعلم أن كل ذكر ينتج خلاف المفهوم الأول منه فإنه يدل ما ينتجه على حال الذاكر كما شرطناه التفسير الكبير لنا إلا لكامل من الرجال فإنه يعلم جميع ما ينتجه ذلك الذكر لعدم تقييده وخروجه عن تلك الصفات والأسماء التي تحت ولاية الاسم الله فإن الكامل من الرجال بمنزلة الاسم الله من الأسماء وإن كان له الإطلاق فلا ينطق به إلا مقيدا بالحال أو اللفظ لا بد من ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Five Hundred and Fifty-Four: Concerning the Gnosis of the State of a Pole (قطب) whose station is: <<Do not think that those who rejoice in what they have brought forth and love to be praised for what they have not done>> (Q 3:188)\n\nDo not think that men rejoice in what they have brought forth,\nWhen they have no footing in what they have done.\n\nAnd they rejoice in the praise of creation concerning it,\nYet they have nothing of the Act except absence and non-existence.\n\nThat is the abandonment of the Seal of the Saints (ختم الأولياء), and whoever possesses such a quality is annihilated.\nHe is the Imam whose foundations are firmly established, the good, the pure, the benefactor, and the banner.\n\nThe faces of the angels (الأملاك) bow down to him entirely,\nAnd creation bows down to him, as do the Preserved Tablet (اللوح) and the Pen (القلم).\n\n### [Torment and Pain (العذاب والألم)]\n\nKnow—may Allah support us and you with a Spirit from Him—that I also adhered to this invocation (الذكر) for many years, until I was named by it in my city, just as I was named by other invocations, and I saw manifest blessings from it.\n\nNeither by His saying, \"they have brought forth,\" nor by His saying, \"what they have not done,\" for it is His saying, <<You did not kill them, but Allah killed them>> (Q 8:17), and His saying, <<And you did not throw when you threw, but Allah threw>> (Q 8:17).\n\nThus, the human comes to the Act because the Act appeared in him, so he loves to be praised for what was done in him, yet the Act does not belong to him. He receives pleasure (التذاذ) from that according to the measure of his claim, except that it is a painful pleasure because he knows the matter is contrary to his claim. [He is] like the arrogant tyrant who cannot detach himself from his necessities and his need for the slightest causes that might relieve him of his pain.\n\nSo His saying, <<Do not think that they are safe from the torment>> (Q 3:188), means: Do not imagine that they find pleasure in that, metaphorically but not truly, or that they find it sweet. Rather, they do find sweetness in it if they are Gnostics (عارفين), for they have combined in this tasting (الذوق) both torment and pain. Thus, from one perspective they are in bliss (نعيم), and from another perspective they are in painful agony, as one of them said:\n\nHave you ever heard of a lover\nWhose eye is sound, yet his side is sick?\nBlessed by torment,\nTormented by bliss.\n\n### [Indeed, the Perfect Men are in the station of a Divine Name]\n\nKnow that every invocation (ذكر) that produces a result contrary to its initial understood meaning, then what it produces indicates the state of the invoker (الذاكر), as we stipulated in our Great Commentary (التفسير الكبير), except for the Perfect Human (الكامل من الرجال). For he knows everything that that invocation produces due to his lack of restriction and his emergence from those Attributes (الصفات) and Names (الأسماء) that are under the governance of the Name Allah.\n\nFor the Perfect Human (الكامل من الرجال) is in the station of the Name Allah among the Names. And even though he possesses absolute freedom (الإطلاق), he is only spoken of as restricted by the state (الحال) or by the utterance (اللفظ); this is necessary. And <<Allah speaks the Truth, and He guides to the Way>> (Q 33:4).",
    "ur": "باب نمبر پانچ سو چون (۵۵۴) قطب کے حال کی معرفت میں جس کا مقام یہ آیت تھی: \"آپ ہرگز یہ گمان نہ کریں کہ جو لوگ اپنے کیے پر خوش ہوتے ہیں اور چاہتے ہیں کہ ان کی تعریف ایسے کاموں پر کی جائے جو انہوں نے نہیں کیے\" (لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا)\n\nآپ ان لوگوں کو مت سمجھیں جو اپنے کیے پر خوش ہوتے ہیں\nحالانکہ جو کچھ انہوں نے کیا اس میں ان کا کوئی حصہ نہیں\n\nاور وہ اس پر مخلوق کی تعریف سے خوش ہوتے ہیں\nحالانکہ اس فعل میں ان کے لیے صرف فقدان اور عدم (الفقد والعدم) ہے\n\nاور یہ اولیاء کے خاتمے کا ترک ہے، اور جو شخص\nایسی صفت رکھتا ہو وہ معدوم ہو جاتا ہے\nاور وہ امام ہے جس کی بنیادیں مضبوط ہیں\nجو پاکیزہ، طاہر، احسان کرنے والا اور علم والا ہے\n\nتمام فرشتوں کے چہرے اس کے سامنے جھکتے ہیں\nاور مخلوق، لوح اور قلم بھی اس کے سامنے جھکتے ہیں\n\n### [عذاب اور درد (العذاب والألم)]\n\nجان لو، اللہ تعالیٰ اپنی روح (بِرُوحٍ مِنْهُ) کے ذریعے ہماری اور تمہاری تائید فرمائے، کہ میں نے بھی کئی سالوں تک اس ذکر کو لازم پکڑے رکھا، یہاں تک کہ میں اپنے شہر میں اس نام سے پکارا جاتا تھا، جیسا کہ میں دوسرے اذکار کے نام سے بھی پکارا جاتا تھا۔ اور میں نے اس کی ظاہری برکات دیکھی ہیں۔\n\nپس نہ تو اس کے قول \"جو انہوں نے کیا\" (أَتَوْا) سے اور نہ ہی اس کے قول \"جو انہوں نے نہیں کیا\" (بِما لَمْ يَفْعَلُوا) سے (مراد ہے)، بلکہ یہ اللہ کا قول ہے: \"پس تم نے انہیں قتل نہیں کیا بلکہ اللہ نے انہیں قتل کیا\" (فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ) اور اس کا قول: \"اور جب آپ نے پھینکا تو آپ نے نہیں پھینکا بلکہ اللہ نے پھینکا\" (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَى).\n\nچنانچہ انسان فعل کے ساتھ اس لیے آتا ہے کہ فعل اس میں ظاہر ہوا، پس وہ چاہتا ہے کہ اس کام پر اس کی تعریف کی جائے جو اس میں ہوا، حالانکہ فعل اس کا نہیں ہے۔ لہٰذا، اس دعوے کے مطابق اسے اس سے لذت حاصل ہوتی ہے، مگر یہ ایک تکلیف دہ لذت ہے کیونکہ وہ حقیقت کو اپنے دعوے کے برعکس جانتا ہے۔ جیسے متکبر جبار (الجبار) جو اپنی مجبوریوں اور اپنے درد سے راحت دینے والے ادنیٰ اسباب کی محتاجی سے دور نہیں ہو سکتا۔\n\nپس اللہ کا یہ قول: \"آپ ہرگز یہ گمان نہ کریں کہ وہ عذاب سے نجات میں ہیں\" (فَلَا تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِنَ الْعَذَابِ) کا مطلب ہے کہ یہ مت سمجھو کہ وہ اس سے حقیقی طور پر نہیں بلکہ اشارتاً لذت حاصل کرتے ہیں اور اسے شیریں سمجھتے ہیں۔ بلکہ اگر وہ عارفین (العارفین) ہوں تو ان کے لیے اس میں ایک شیرینی ہوتی ہے، چنانچہ وہ اس ذوق میں عذاب اور درد کو جمع کر لیتے ہیں۔ پس وہ ایک لحاظ سے نعمت میں ہیں اور ایک لحاظ سے تکلیف دہ درد میں ہیں۔ جیسا کہ کسی نے کہا ہے:\n\nکیا تم نے کسی عاشق کے بارے میں سنا ہے؟\nجو ظاہری طور پر تو سلامت ہو مگر اندر سے بیمار ہو\n\nعذاب کے ذریعے نعمت پانے والا\nاور نعمت کے ذریعے عذاب دیا جانے والا\n\n### [بے شک کامل مرد اسماء الٰہی میں سے ایک اسم کے مقام پر ہیں (إن الكمل من الرجال بمنزلة اسم من الأسماء الإلهي)]\n\nاور جان لو کہ ہر وہ ذکر جو اپنے پہلے مفہوم کے خلاف نتیجہ پیدا کرتا ہے، تو وہ نتیجہ ذاکر کے حال پر دلالت کرتا ہے، جیسا کہ ہم نے اپنی تفسیر کبیر میں شرط لگائی ہے، سوائے کامل مردوں (الکامل من الرجال) کے۔ کیونکہ وہ اس ذکر کے تمام نتائج کو جانتا ہے، اس لیے کہ وہ ان صفات اور اسماء کی قید سے آزاد ہو چکا ہے جو اسم اللہ (الاسم اللہ) کی ولایت کے تحت ہیں۔\n\nبے شک کامل مرد (الکامل من الرجال) اسماء میں سے اسم اللہ (الاسم اللہ) کے مقام پر ہے، اور اگرچہ اسے اطلاق حاصل ہے، لیکن اس کا تلفظ حال یا لفظ کی قید کے بغیر نہیں کیا جاتا، یہ ضروری ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ).",
    "fa": "باب پانصد و پنجاه و چهارم در معرفت حال قطبی که منزل او آیه «گمان مبر کسانی که به آنچه انجام داده‌اند شادمان می‌شوند و دوست دارند به آنچه نکرده‌اند ستایش شوند» (لَا تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا) بود.\n\nگمان مبر مردانی شادمان می‌شوند به آنچه *** آورده‌اند، در حالی که در آنچه آورده‌اند، قدمی (حقیقی) ندارند.\n\nو شادمان می‌شوند به ستایش خلق در آن، در حالی که *** از فعل، جز فقدان و نیستی ندارند.\n\nو این، دوری‌گزیدن (هجیر) از ختم اولیاست، و هر که *** چنین وصفی داشته باشد، معدوم می‌شود.\n\nو او امامی است که قواعدش استوار گشته *** پاک، طاهر، نیکوکار و دانشمند است.\n\nچهره‌های فرشتگان جملگی در برابرش خضوع می‌کنند *** و خلق و لوح و قلم نیز در برابرش خاضع‌اند.\n\n### [عذاب و درد]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که من نیز این ذکر را سال‌های متمادی بر خود لازم دانستم، تا جایی که در شهر خود با آن نامیده می‌شدم، همان‌طور که با اذکار دیگر نیز نامیده می‌شدم، و برکات آشکاری برای آن دیدم. پس نه به سبب قولش «آورده‌اند» (أَتَوْا) و نه به سبب قولش «به آنچه نکرده‌اند» (بِمَا لَمْ يَفْعَلُوا)؛ بلکه این همان قول اوست: «شما آنان را نکشتید، بلکه خدا آنان را کشت» (فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ) و قول او: «و چون پرتاب کردی، تو پرتاب نکردی، بلکه خدا پرتاب کرد» (وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَى).\n\nپس انسان به واسطه اینکه فعل در او ظاهر شده است، با آن فعل می‌آید؛ و دوست دارد به آنچه در او انجام شده ستایش شود، در حالی که فعل از آنِ او نیست. بنابراین، بهره او از التذاذ (لذت بردن) از آن به اندازه ادعای اوست، اما این التذاذی دردناک است، زیرا او می‌داند که حقیقت امر برخلاف ادعای اوست؛ مانند متکبر جبار که نمی‌تواند از نیازهای ضروری و فقر خود به کمترین اسباب تسکین‌دهنده دردش رهایی یابد.\n\nپس قول او: «گمان مبر که آنان از عذاب رهایی یافته‌اند» (فَلَا تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِنَ الْعَذَابِ) یعنی گمان مبر که آنان از روی حقیقت به آن لذت می‌برند و آن را شیرین می‌یابند، بلکه اگر عارف باشند، در آن شیرینی‌ای برایشان هست. پس در این ذوق، عذاب و درد را با هم جمع کرده‌اند. آنان از یک جهت در نعمت و از جهت دیگر در دردی رنج‌آور هستند، چنانکه برخی گفته‌اند:\n\nآیا درباره عاشقی شنیده‌اید *** که تنش سالم و دیده‌اش بیمار است؟\n\nبه واسطه عذاب در نعمت است *** و به واسطه نعمت در عذاب.\n\n### [انسان‌های کامل به منزله اسمی از اسماء الهی هستند]\n\nو بدان که هر ذکری که نتیجه‌ای خلاف مفهوم اولیه خود بدهد، آن نتیجه بر حال ذاکر دلالت می‌کند، چنانکه در تفسیر کبیر خود شرط کرده‌ایم؛ مگر برای انسان کامل (الإنسان الکامل) از میان مردان. زیرا او تمام آنچه را که آن ذکر نتیجه می‌دهد می‌داند، به دلیل عدم تقیید او و خروجش از آن صفات و اسمایی که تحت ولایت اسم «الله» هستند.\n\nزیرا انسان کامل (الإنسان الکامل) از میان مردان، به منزله اسم «الله» در میان اسماء است. و اگرچه او اطلاق دارد، اما جز مقید به حال یا لفظ، به او نطق نمی‌شود؛ این امر ضروری است. و خداوند حق را می‌گوید و او راه را می‌نمایاند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}