{
  "id": 324,
  "title": {
    "ar": "الباب الرابع والعشرون وثلاثمائة في معرفة منزل جمع النساء الرجال في بعض المواطن الإلهية وهو من الحضرة العاصمية",
    "en": "Chapter 324: Concerning the Gnosis of the Station where the Feminine gathers the Masculine in certain Divine Contexts, and which belongs to the Preserving Presence (الحضرة العاصمية).",
    "ur": "باب تین سو چوبیس: بعض الٰہی مقامات میں اس منزل کی معرفت کے بارے میں جو عورتوں اور مردوں کو جمع کرتی ہے، اور یہ الحضرة العاصمية سے ہے۔",
    "fa": "باب سیصد و بیست و چهارم در معرفت منزل جمع زنان و مردان در برخی از مواطن الهی، و آن از حضرت عاصمیه (الحضرة العاصمية) است."
  },
  "content": {
    "ar": "## «الباب الرابع والعشرون وثلاثمائة في معرفة منزل جمع النساء الرجال في بعض المواطن الإلهية وهو من الحضرة العاصمية»\n\n\n> إن النساء شقائق الذكران *** في عالم الأرواح والأبدان‏\n\n\n> والحكم متحد الوجود عليهما *** وهو المعبر عنه بالإنسان‏\n\n\n> وتفرقا عنه بأمر عارض *** فصل الإناث به من الذكران‏\n\n\n> من رتبة الإجماع يحكم فيهما *** بحقيقة التوحيد في الأعيان‏\n\n\n> وإذا نظرت إلى السماء وأرضها *** فرقت بينهما بلا فرقان‏\n\n\n> انظر إلى الإحسان عينا واحدا *** وظهوره بالحكم عن إحسان‏\n\n\n### [أن الإنسانية جامعة للرجل والمرأة ولهذا لم يكن للرجال على النساء درجة من حيث الإنسانية]\n\n\nاعلم أيدك الله أن الإنسانية لما كانت حقيقة جامعة للرجل والمرأة لم يكن للرجال على النساء درجة من حيث الإنسانية كما إن الإنسان مع العالم الكبير يشتركان في العالمية فليس للعالم على الإنسان درجة من هذه الجهة وقد ثبت أن للرجال على النساء درجة وقد ثبت أن خلق السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ وأن أكثر الناس لا يعلم ذلك مع الاشتراك في الدلالة والعلامة على وجود المرجح وقد قال أَ أَنْتُمْ أَشَدُّ خَلْقاً أَمِ السَّماءُ بَناها وذكر ما يختص بالسماء ثم ذكر الأرض ودحيها وما يختص بها كل ذلك في معرض التفضيل على الإنسان فوجدنا الدرجة التي فضل بها السماء والأرض على الإنسان هي بعينها التي فضل بها الرجل على المرأة وهو أن الإنسان منفعل عن السماء والأرض ومولد بينهما منهما والمنفعل لا يقوي قوة الفاعل لما هو منفعل عنه كذلك وجدنا حواء منفعلة عن آدم مستخرجة متكونة من الضلع القصير فقصرت بذلك أن تلحق بدرجة من انفعلت عنه فلا تعلم من مرتبة الرجل إلا حد ما خلقت منه وهو الضلع فقصر إدراكها عن حقيقة الرجل كذلك الإنسان لا يعلم من العالم إلا قدر ما أخذ في وجوده من العالم لا غير فلا يلحق الإنسان أبدا بدرجة العالم بجملته وإن كان مختصرا منه كذلك المرأة لا تلحق بدرجة الرجل أبدا مع كونها نقاوة من هذا المختصر وأشبهت المرأة الطبيعة من كونها محلا للانفعال فيها وليس الرجل كذلك فإن الرجل يلقي الماء في الحرم لا غير والرحم محل التكوين والخلق فيظهر أعيان ذلك النوع في الأنثى لقبولها التكوين والانتقالات في الأطوار الخلقية خلقا من بعد خلق إلى أن يخرج بشرا سويا فبهذا القدر يمتاز الرجال عن النساء ولهذا كانت النساء ناقصات العقل عن الرجال لأنهن ما يعقلن إلا قدر ما أخذت المرأة من خلق الرجل في أصل النشأة وأما نقصان الدين فيها فإن الجزاء على قدر العمل والعمل لا يكون إلا عن علم والعلم على قدر قبول العالم وقبول العالم على قدر استعداده في أصل نشأته واستعدادها ينقص عن استعداد الرجل لأنها جزء منه فلا بد أن تتصف المرأة بنقصان الدين عن الرجل وهذا الباب يطلب الصفة التي يجتمع فيها النساء والرجال وهي فيما ذكرناه كونهما في مقام الانفعال هذا من جهة الحقائق وأما من جهة ما يعرض لهما فمثل قوله إِنَّ الْمُسْلِمِينَ والْمُسْلِماتِ والْمُؤْمِنِينَ والْمُؤْمِناتِ إلى قوله والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ‏\nوقوله تعالى التَّائِبُونَ الْعابِدُونَ الْحامِدُونَ السَّائِحُونَ وقوله تائِباتٍ عابِداتٍ سائِحاتٍ وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم كمل من الرجال كثيرون ومن النساء مريم بنت عمران وآسية امرأة فرعون‏\n\n\nفاجتمع الرجال والنساء في درجة الكمال وفضل الرجل بالأكملية لا بالكمالية فإن كملا بالنبوة فقد فضل الرجل بالرسالة والبعثة ولم يكن للمرأة درجة البعثة والرسالة مع أن المقام الواحد المشترك يقع التفاضل في أصحابه بينهم فيه كما قال تعالى تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ وقال ولَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ وقد شرك الله بين الرجال والنساء في التكليف فكلف النساء كما كلف الرجال وإن اختصت المرأة بحكم لا يكون للرجل فقد يختص الرجل بحكم لا يكون للمرأة وإن كان النساء شقائق الرجال‏\n\n\n### [أن منزلة المرأة من الرجل في أصل الإيجاد منزلة الرحم من الرحمن‏]\n\n\nثم اعلم أن منزلة المرأة من الرجل في أصل الإيجاد منزلة الرحم من الرحمن فإنها شجنة منه فخرجت على صورته وقد ورد في بعض الروايات أن الله خلق آدم على صورة الرحمن‏\n\n\nوثبت أن الرحم فينا شجنة من الرحمن فنزلنا من الرحمن منزلة حواء من آدم وهي محل التناسل وظهور أعيان الأبناء كذلك نحن محل ظهور الأفعال فالفعل وإن كان لله فما يظهر إلا على أيدينا ولا ينسب بالحس إلا إلينا ولو لم نكن شجنة من الرحمن لما صح النسب الإلهي وهو كوننا عبيدا له ومولى القوم منهم فافتقارنا إليه افتقار الجزء إلى الكل ولو لا هذا القدر من النسبة لما كان للعزة الإلهية والغني المطلق أن يعطف علينا ولا إن ينظر إلينا فبهذا النسب صرنا مجلاها فلا تشهد ذاتها إلا فينا لما خلقنا عليه من الصورة الإلهية فملكنا الأسماء الإلهية كلها فما من اسم إلهي إلا ولنا فيه نصيب ولا يقوم بنا أمر إلا ويسرى حكمه في الأصل قال النبي صَلَّى اللهُ عَليهِ وسَلَّم في هذا الاسم في أعضاء الإنسان إنه إذا أحس عضو منه بألم تداعي له سائر الجسم بالحمى فأثر وجود ذلك الألم في العضو الخاص الحمى في سائر الأعضاء فيتألم كله لتالم جزء من جسمه فما ظنك بالنفس الناطقة التي هي سلطانة هذَا الْبَلَدِ الْأَمِينِ فإن حاملة الحمى النفس الحيوانية في هذا الموضع وهي للنفس الناطقة بمنزلة ملك اختل عليه بعض ملكه فهمه يكون أشد أ لا ترى الحق سبحانه قد وصف نفسه بالغضب وبالرحمة وبالقبول وبالإجابة وأمثال هذا وجعل ذلك كله مسببا عن أسباب تكون منا فإذا عصيناه مجاهرة أغضبناه وإذا قلنا قولا يرتضيه منا أرضيناه كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم ولا نقول إلا ما يرضى ربنا\n\n\nوإذا تبنا آثرنا القبول عنده ولو لا سيئاتنا ما عاقب ولا عفا وهذا كله مما يصحح النسب ويثبت النسب ويقوي آثار السبب فنحن أولاد علات أم واحدة وآباء مختلفون فهو السبب الأول بالدليل لا بالمشاهدة ولما تقرر ما ذكرناه أيد هذا النسب بقوله فمن وصلها وصله الله ومن قطعها قطعه الله فانظر ما أعجب هذا الحكم إن قطعها سبحانه من الرحمن وجعل السعادة لنا والوصلة به في وصل ما قطعه فالصورة صورة منازعة وفيها القرب الإلهي ليكون لنا حكم الوصل وهو رد الغريب إلى أهله وليس للحكمة الإلهية في هذا إلا نفي التشبيه فإنه قال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فإذا قطعناها أشبهناه في القطع فإنه جعلها شجنة من الرحمن فمن قطعها فقد تشبه به وهو لا يشبه شيئا ولا يشبهه شي‏ء بحكم الأصل فتوعد من قطعها بقطعه إياه من رحمته لا منه وأمرنا بأن نصلها وهو أن نردها إلى من قطعت منه فإنه قال وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فَاعْبُدْهُ وتَوَكَّلْ عَلَيْهِ وما رَبُّكَ بِغافِلٍ عَمَّا تَعْمَلُونَ فأضاف العمل لك وجعل نفسه رقيبا عليه وشهيدا لا يغفل ولا ينسى ذلك لتقتدي أنت به فيما كلفك من الأعمال فلا تغفل ولا تنسى لأنك أولى بهذه الصفة لافتقارك وغناه عنك ولما كانت حواء شجنة من آدم جعل بينهما مَوَدَّةً ورَحْمَةً ينبه أن بين الرحم والرحمن مودة ورحمة ولذلك أمرك أن تصلها بمن قطعت منه فيكون القطع له والوصل لك فيكون لك حظ في هذا الأمر تشرف به على سائر العالم فالمودة المجعولة بين الزوجين هو الثبات على النكاح الموجب للتوالد والرحمة المجعولة هو ما يجده كل واحد من الزوجين من الحنان إلى صاحبه فيحن إليه ويسكن فمن حيث المرأة حنين الجزء إلى كله والفرع إلى أصله والغريب إلى وطنه وحنين الرجل إلى زوجته حنين الكل إلى جزئه لأنه به يصح عليه اسم الكل وبزواله لا يثبت له هذا الاسم وحنين الأصل إلى الفرع لأنه يمده فلو لم يكن لم تظهر له ربانية الإمداد كما إن الكون لولاه لم يصح أن يكون ربا على نفسه وهورب فلا بد من العالم ولم يزل ربا فلم تزل الأعيان الثابتة تنظر إليه بالافتقار أزلا ليخلع عليها اسم الوجود ولم يزل ينظر إليها لاستدعائها بعين الرحمة فلم يزل ربا سبحانه وتعالى في حال عدمنا وفي حال وجودنا والإمكان لنا كالوجوب له قال‏\n> حقق يعقلك إن فكرت مصدرنا *** نفيا لنفي وإثباتا لإثبات‏\n\n\n> من أعجب الأمر إني لم أزل أزلا *** وإنني مع هذا محدث الذات‏\n\n\n> قد كان ربك موجودا وما معه *** شي‏ء سواه ولا ماض ولا آت‏\n\n\nفبالمودة والرحمة طلب الكل جزأه والجزء كله فالتحما فظهر عن ذلك الالتحام أعيان الأبناء فصح لهم اسم الأبوة فأعطى وجود الأبناء حكما للآباء لم يكونوا عليه وهو الأبوة وليس الرب كذلك فإنه لم يزل ربا أزلا فإن الممكن في إمكانه لم يزل موصوفا بالإمكان سواء وجد الممكن أو اتصف بالعدم فإن النظر إليه لم يزل في حال عدمه وتقدم العدم للممكن على وجوده نعت أزلي فلم يزل مربوبا وإن لم يكن موجودا فهذا الفارق بين ما يجب لله وبين ما يجب للعبد من حيث الاسمية والمرتبة التي حدثت له بوجود الابن فالتحق النساء بالرجال في الأبوة ومن لحوق النساء بالرجال بل تقوم المرأة في بعض المواطن مقام رجلين إذ لا يقطع الحاكم بالحكم إلا بشهادة رجلين فقامت المرأة في بعض المواطن مقامهما وهو قبول الحاكم قولها في حيض العدة وقبول الزوج قولها في إن هذا ولده مع الاحتمال المتطرق إلى ذلك وقبول قولها إنها حائض فقد تنزلت هاهنا منزلة شاهدين عدلين كما تنزل الرجل في شهادة الدين منزلة امرأتين فتداخلا في الحكم‏\n\n\n> فناب الكثير مناب القليل *** وناب القليل مناب الكثير\n\n\n> فمن شاء ألحقه بالثرى *** ومن شاء ألحقه بالأثير\n\n\nلو لا كمال الصورة ما صحت الخلافة فمن طلبها وكل إليها ومن جاءته من غير طلب أعين عليها فالطالب مدع في القيام بحقها ومن طلب بها مستقيل منها لأنها أمانة ثَقُلَتْ في السَّماواتِ والْأَرْضِ وكل مدع ممتحن كانت هذه الصفة فيمن كانت لا أحاشي أحدا وامتحانه على صورة ما يدعيه وسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ ويَوْمَ يَمُوتُ ويَوْمَ يُبْعَثُ حَيًّا شهادة إلهية مقطوع بها فهذه منزلة من جاءته الخلافة من غير طلب والعناية من غير تعمل والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ ويَوْمَ أَمُوتُ ويَوْمَ أُبْعَثُ حَيًّا دعوى موضع الامتحان لو لا ما شفع فيه حالة المهد لعدم استحكام العقل فكان حكمه حكم يحيى وهو الأولى هذا إن كان منطقا غير متعقل ما ينطق به وإن تعقله فاستحكم عقله وتقوت آلاؤه في نفس الأمر وفي مشهود العادة عند الحاضرين هو خرق عادة فإن كان مأمورا بما نطق به فهو مخبر بما آتاه الله وأمر أن يخبر به فليس بمدع ولا طالب فخرا كما\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنا سيد ولد آدم ولا فخر\n\n\nبالراء وهو التبجح بالباطل فهذا معرف عن أمر إلهي فمثل هذا لا يمتحن ولا يختبر فإنه ليس بمدع وهذه كلها أحوال يشترك فيها النساء والرجال ويشتركان في جميع المراتب حتى في القطبية ولا يحجبك‏\n\n\nقول الرسول صَلَّى اللهُ عَليهِ وسَلَّم لن يفلح قوم ولوا أمرهم امرأة\n\n\nفنحن نتكلم في تولية الله لا في تولية الناس والحديث جاء فيمن ولاة الناس ولو لم يرد إلا\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم في هذه المسألة إن النساء شقائق الرجال‏\n\n\nلكان فيه غنية أي كل ما يصح أن يناله الرجل من المقامات والمراتب والصفات يمكن أن يكون لمن شاء الله من النساء كما كان لمن شاء الله من الرجال أ لا تنظر إلى حكمة الله تعالى فيما زاد للمرأة على الرجل في الاسم فقال في الرجل المرء وقال في الأنثى المرأة فزادها هاء في الوقف تاء في الوصل على اسم المرء للرجل فلها على الرجل درجة في هذا المقام ليس للمرء في مقابلة قوله ولِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ فسد تلك الثلمة بهذه الزيادة في المرأة وكذلك ألف حبلى وهمزة حمراء وإن ذكرت تعليل الحق في إقامة المرأتين في الشهادة مقام الرجل الواحد بالنسيان في قوله أَنْ تَضِلَّ إِحْداهُما فَتُذَكِّرَ إِحْداهُمَا الْأُخْرى‏ والتذكر لا يكون إلا عن نسيان فقد أخبر الله تعالى عن آدم أنه نسي وقال صَلَّى اللهُ عَليهِ وسَلَّم فنسي آدم فنسيت ذريته‏\n\n\nفنسيان بنى آدم ذرية عن نسيان آدم كما نحن ذريته وهو وصف إلهي منه صدر في العالم قال تعالى نَسُوا الله فَنَسِيَهُمْ على إن الحق ما وصف إحدى المرأتين إلا بالحيرة فيما شهدت فيه ما وصفها بالنسيان والحيرة نصف النسيان لا كله ونسب النسيان على الكمال للرجل فقال فَنَسِيَ ولَمْ نَجِدْ لَهُ عَزْماً فقد يمكن أن ينسى الرجل الشهادة رأسا ولا يتذكرها ولا يمكن أن تنسى إحدى المرأتين وهي المذكرة لا على التعيين فتذكر التي ضلت عما شهدت فيه فإن خبر الله صدق بلا شك وهو قد أخبر في هذه الآية أن إحداهما تذكر الأخرى فلا بد أن تكون‏\nالواحدة لا تضل عن الشهادة ولا تنسى فقد اتصفت المرأة الواحدة في الشهادة بأخبار الحق عنها بصفة إلهية وهو قول موسى الذي حكي عنه في القرآن لا يَضِلُّ رَبِّي ولا يَنْسى‏ ولو لم يكن في شرف التأنيث إلا إطلاق الذات على الله وإطلاق الصفة وكلاهما لفظ التأنيث جبر القلب المرأة الذي يكسره من لا علم له من الرجال بالأمر وقد نهانا الشارع أن نتفكر في ذات الله وما منعنا من الكلام في توحيد الله بل أمر بذلك فقال فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله واسْتَغْفِرْ لِذَنْبِكَ وهو هنا ما يخطر لمن نظر في توحيد الله من طلب ماهيته وحقيقته وهو معرفة ذاته التي ما تعرف وحجر التفكر فيها لعظيم قدرها وعدم المناسبة بينها وبين ما يتوهم أن يكون دليلا عليها فلا يتصورها وهم ولا يقيدها عقل بل لها الجلال والتعظيم بل لا يجوز أن تطلب بما كما طلب فرعون فأخطأ في السؤال ولهذا عدل موسى عليه السلام عن جواب سؤاله لأن السؤال إذا كان خطأ لا يلزم الجواب عنه وكان مجلس عامة فلذلك تكلم موسى بما تكلم به ورأى فرعون أنه ما أجابه على حد ما سأل لأنه تخيل أن سؤاله ذلك متوجه وما علم إن ذات الحق تعالى لا تدخل تحت مطلب ما وإنما تدخل تحت مطلب هل وهل سؤال عن وجود المسئول عنه هل هو متحقق أم لا فقال فرعون وقد علم ما وقع فيه من الجهل إشغالا للحاضرين لئلا يتفطنوا لذلك إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ ولو لا ما علم الحق فرعون ما أثبت في هذا الكلام أنه أرسله مرسل وأنه ما جاء من نفسه لأنه دعا إلى غيره وكذا نسبه فرعون إلى ما كان عليه موسى فوصفه بأنه مجنون أي مستور عنكم فلا تعرفونه فعرفه موسى بجوابه إياه وما عرفه الحاضرون كما عرفه علماء السحرة وما عرفه الجاهلون بالسحر وبقيت تلك الخميرة عند فرعون يختمر بها عجين طينته وما ظهر حكمها ولا اختمر عجينه إلا في الوقت الذي قال فيه آمنت بالذي آمَنَتْ به بَنُوا إِسْرائِيلَ وما سمى الله ليرفع اللبس والشك إذ قدم علم الحاضرون أن بنى إسرائيل ما آمنت إلا بالإله الذي جاء موسى وهارون من عنده إليهم فلو قال آمنت بالله وهو قد قرر إنه ما علم لقومه من إله غيره لقالوا لنفسه شهد لا للذي أرسل موسى إلينا كما شهد الله لنفسه فرفع هذا اللبس بما قاله وأما تحقيق هذه المسألة فما يعرف ذلك إلا من يعرف مرتبة الطبيعة من الأمر الإلهي فإن المرأة من الرجل بمنزلة الطبيعة من الأمر الإلهي لأن المرأة محل وجود أعيان الأبناء كما إن الطبيعة للأمر الإلهي محل ظهور أعيان الأجسام فيها تكونت وعنها ظهرت فأمر بلا طبيعة لا يكون وطبيعة بلا أمر لا تكون فالكون متوقف على الأمرين ولا تقل إن الله قادر على إيجاد شي‏ء من غير إن ينفعل أمر آخر فإن الله يرد عليك في ذلك بقوله إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ فتلك الشيئية العامة لكل شي‏ء خاص وهو الذي وقع فيها الاشتراك هي التي أثبتناها وإن الأمر الإلهي عليها يتوجه لظهور شي‏ء خاص في تلك الشيئية المطلقة فإذا ظهرت الأجسام أو الأجساد ظهرت الصور والأشكال والأعراض وجميع القوي الروحانية والحسية وربما قيل هو المعبر عنه بلسان الشرع العلماء الذي هو للحق قبل خلق الخلق ما تحته هواء وما فوقه هواء فذكره وسماه باسم موجود يقبل الصور والأشكال وقد ذكرنا مرتبة الطبيعة وهي هذه الشيئية المطلقة في كتاب النكاح الأول الذي ظهر عنه العالم أسفله وأعلاه وكل ما سوى الله من كثيف ولطيف ومعقول ومحسوس متصف بالوجود فلا نعرف منها إلا قدر ما يظهر لنا كما لا نعرف من الأسماء الإلهية إلا قدر ما وصل إلينا فمن عرف مرتبة الطبيعة عرف مرتبة المرأة ومن عرف الأمر الإلهي فقد عرف مرتبة الرجل وأن الموجودات مما سوى الله متوقف وجودها على هاتين الحقيقتين غير إن هذه الحقيقة تخفى وتدق بحيث يجهلها أبناؤها من العقول فلا تثبتها في العالم البسيط وتثبتها في العالم المركب وذلك لجهلها بمرتبتها كما جهلت هنا مرتبة المرأة مع تنبيه الشارع على منزلتها\n\n\nبقوله صَلَّى اللهُ عَليهِ وسَلَّم إن النساء شقائق الرجال‏\n\n\nفالأمر بينهما يكون علوا وسفلا أ لا ترى التجليات والروحانيات المتجسدة هل تظهر في غير صور طبيعية وإن كانت تلك الأجساد سريعة الاستحالة فلم تخرج عنها وهذا منزل واسع يتسع المجال فيه فلنذكر أمهات ما يتضمنه من المسائل دون التفريع فمنها من أي‏\n\n\nمقام ينادي المؤمن وهل يختلف النداء باختلاف المنادي أم لا وفي هذا المنزل أيضا علم سبب العداوة بين الله وبين خلقه وهل من شرط العداوة أن توجد من الطرفين أو من الطرف الواحد وهل يعادي أحد من أجل أحد أو لا تكون العداوة إلا من أجل نفسه‏\nلا من أجل غيره وعلم إلقاء المحبة في القلوب وثباتها فيه وهل إلقاؤها انتقال وجودي أو خلق يخلق في المحل وهل من شرط الحب المناسبة أم لا وعلم التغريب عن الأوطان لموجب النقيض وعلم مشقات السبل الإلهية وعلم طلب الرضاء في المنشط والمكره وعلم السر والعلن وعلم الحيرة عن طريق خاص وعلم محبة الستر على التجلي وعلم ثبات السبب الموجب لقطع ما أمر بوصله فيكون قطعه قربة ووصله بعد أو علم المواطن وكيف ترد الأمور بحكمها وتأثيرها في الأمور الكونية والأحكام الإلهية وهو علم واسع وعلم رؤية الأعمال مع كونها أعراضا كونية والأعراض الكونية ترى أحكامها لا أعيانها بخلاف الأعراض اللونية فإنه يرى أعيانها وأحكامها وعلم الاقتداء بالمتقدمين واتباع الفاضل المفضول وعلم التبري من الجمع لا من أحدية الجمع وعلم ستر أحدية الجمع والكثرة وعلم الحب المشروط والبغض المشروط وهل يصح في نفس الأمر ذلك أو لا يصح وهل يصح فيه استثناء أو لا يصح وهل يقدح في العلم الإلهي رجوع العبد في توكله وأحواله إلى اسم خاص دون سائر الأسماء الإلهية أم لا وعلم الصيرورة من علم الرد والرجوع والفرق بينهما وبين كل واحد منهما وبين الآخر وعلم الاختيار فيما يحمد ويذم وعلم تضمن العزة الحكمة وعلم الرجاء المشترك وعلم ما ينتجه التولي عن الحق المطلق والمقيد وهل يتأثر من يتولى عنه عند التولي أو لا يتأثر وعلم المقاربة من الشي‏ء هل يتصف بها الحق أم لا وعلم كون الرحمة قد تكون بالستر وبغير الستر وعلم سبب إكرام الكريم ومجازاة اللئيم هل يكون بلؤم فيشتركان وإن كان الواحد جزاء أو لا يجازيه إلا بالإحسان وهل يكون لؤم الجزاء لؤما في نفس الأمر أو هو صفة اللئيم تعود عليه لما ظهرت له في غيره فكرهها منه فعلم بذلك أنها صفته وأنها في المجازي أمر عرضي أظهرها للتعليم وهو علم شريف نافع يعرف منه عقوبة الله عباده على أعمالهم مع غناه في نفسه عن ذلك وعدم تضرره به وهل يمكن للخلق أن يكونوا في الجزاء باللؤم على هذا الحد عند مجازاة اللئيم أو لا يكونون وعلم ما يعامل به أصحاب الدعاوي وعلم الحكم بالعلم وإن الظن قد يسمى علما شرعا ولما ذا يسمى الظن علما وهو ضده وهل العلم هنا عبارة عن العلامة التي يحصل بها الظن في نفس الظان الحاكم به فيكون علمه بتلك العلامة علما بأن هذا ظن غالب يجب الحكم به لرائحة العلم بالعلامة إذ العلم ليس سوى عين العلامة وبه سمي علما فبالعلم يعلم العلم كما يعلم به سائر المعلومات فهي كلها علامات ولذلك قال ذلك مبلغهم من العلم ولم يكن علما فكأنه قال ذلك الذي أعطتهم العلامة في ذلك الأمر وعلم الحلال والحرام العقلي والشرعي وعلم المعاوضة في الأبضاع وهو علم عجيب لأنه لا متعلق للمشتري في ذلك إلا الاستمتاع خاصة فكأنه مشتري الاستمتاع وعلم العدل في الحكم الإلهي والنيابة فيه وعلم الفرق بين العلم والحكمة وعلم اتخاذ الله وقاية مما ذا وهل ذلك من مرتبة العلم أو مرتبة الايمان وعلم أحكام التابع والمتبوع هل يجتمعان في أمر أو لا يجتمعان في أمر وعلم مبايعة الإمام الذي هو السلطان هل حكمها حكم البيع فيتعين ما بيع وما اشترى وهل يدخل فيها بيع النفوس وهو المبايعة على الموت أم لا وعلم التشبيه فهذا ما يتضمنه هذا المنزل من العلوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 324: On the Knowledge of the Station where Women and Men are United in Certain Divine Presences, which belongs to the Preserving Presence (الحضرة العاصمية)\n\nIndeed, women are the counterparts of men,\nIn the world of spirits and bodies.\nAnd the ruling of existence is unified upon them both,\nWhich is expressed by the term 'Human' (الإنسان).\nAnd they separated from it by a contingent matter,\nBy which the females were distinguished from the males.\nFrom the level of unification, judgment is passed upon them both\nBy the Reality of Unity (حقيقة التوحيد) within the Entities (الأعيان).\nAnd if you look upon the Heaven and its Earth,\nYou distinguish between them without distinction.\nLook upon Perfection (الإحسان) as a single essence,\nAnd its manifestation through the ruling derived from perfection.\n\n### [That Humanity unites man and woman, and therefore men have no degree of superiority over women in terms of humanity]\n\nKnow, may Allah support you, that since humanity (الإنسانية) is a reality that unites both man and woman, men have no degree of superiority over women from the perspective of humanity. This is just as the Human and the Greater World (العالم الكبير) share in the quality of 'worldliness' (العالمية), so the World has no superiority over the Human in this regard.\n\nYet, it is established that men do have a degree of superiority over women. And it is established that the creation of the heavens and the earth is greater than the creation of mankind, though most people do not know this, despite their shared indication and sign pointing to the existence of a preference. He said: <<أَ أَنْتُمْ أَشَدُّ خَلْقاً أَمِ السَّماءُ بَناها>> (Are you a harder creation or is the heaven, which He constructed?). He then mentioned what pertains specifically to the heaven, and then mentioned the earth and its spreading, and what pertains specifically to it—all in the context of preferring them over the Human.\n\nWe find that the degree by which Heaven and Earth are preferred over the Human is precisely the same degree by which the Man is preferred over the Woman. This is because the Human is passive (منفعل) relative to Heaven and Earth, being generated and born between them and from them. The passive cannot possess the strength of the active agent (الفاعل) from which it is passive. Likewise, we find that Eve (حواء) is passive relative to Adam, extracted and formed from the short rib (الضلع القصير). She is thereby shortened from attaining the degree of the one from whom she was passive. She only knows of the man's rank the limit of what she was created from—the rib. Her comprehension is thus shortened from the reality of the man.\n\nSimilarly, the Human only knows of the Cosmos (العالم) the measure taken from the Cosmos in his existence, nothing more. The Human can never attain the degree of the Cosmos in its entirety, even though he is a summary of it. Likewise, the Woman can never attain the degree of the Man, despite her being the essence (نقاوة) of this summary.\n\nThe Woman resembles Nature (الطبيعة) in that she is the locus of passivity (محل للانفعال). The Man is not like this, for the Man only deposits the water (sperm) into the sanctuary (الرحم - the womb). The womb is the locus of formation and creation, and the essences (أعيان) of that species appear in the female due to her acceptance of formation and transitions through the stages of creation, creation after creation, until a perfect human emerges.\n\nIt is by this capacity that men are distinguished from women. This is why women are deficient in intellect (ناقصات العقل) compared to men, because they only comprehend the measure taken by the woman from the man's creation in the original formation (أصل النشأة). As for her deficiency in religion (نقصان الدين), recompense is according to action, and action is only based on knowledge, and knowledge is according to the acceptance of the knowable, and the acceptance of the knowable is according to her preparedness in her original formation. Her preparedness is less than the man's because she is a part of him. Therefore, the woman must be characterized by a deficiency in religion compared to the man.\n\nThis chapter seeks the attribute in which women and men unite, which is, as we mentioned, their shared position in the state of passivity (مقام الانفعال)—this is from the perspective of realities (الحقائق). As for contingent matters that affect them, they are united, such as His saying: <<إِنَّ الْمُسْلِمِينَ والْمُسْلِماتِ والْمُؤْمِنِينَ والْمُؤْمِناتِ>>... to His saying: <<والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ>> (And the men who remember Allah often and the women who remember). And His saying, the Exalted: <<التَّائِبُونَ الْعابِدُونَ الْحامِدُونَ السَّائِحُونَ>> (The penitent, the worshippers, the praisers, the travelers), and His saying: <<تائِباتٍ عابِداتٍ سائِحاتٍ>> (Penitent women, worshipping women, traveling women).\n\nAnd the Messenger of Allah, peace and blessings be upon him, said: \"Many men attained perfection, and among women, Maryam daughter of Imran and Asiya the wife of Pharaoh.\"\n\nThus, men and women unite in the degree of perfection (الكمال). The man is superior by *more complete perfection* (الأكملية), not merely perfection (الكمالية). If they attain perfection through prophethood (النبوة), the man is superior by Messengership (الرسالة) and mission (البعثة), and the woman does not possess the degree of mission or messengership. Nevertheless, the single shared station may contain degrees of preference among its occupants, as the Exalted said: <<تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ>> (Those messengers—We preferred some of them over others), and He said: <<وَلَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ>> (And We have preferred some of the prophets over others).\n\nAllah has made men and women partners in religious obligation (التكليف), obligating women just as He obligated men. Although a woman may be distinguished by a ruling that does not apply to a man, a man may also be distinguished by a ruling that does not apply to a woman, even though women are the counterparts of men (شقائق الرجال).\n\n### [That the station of the woman relative to the man in the origin of creation is the station of the Womb (الرحم) relative to the All-Merciful (الرحمن)]\n\nThen know that the station of the woman relative to the man in the origin of creation (أصل الإيجاد) is the station of the Womb (الرحم) relative to the All-Merciful (الرحمن). She is a branch (شجنة) from him and emerged in his form. It has been narrated in some reports that Allah created Adam upon the form of the All-Merciful (الرحمن).\n\nIt is established that the Womb (الرحم) in us is a branch of the All-Merciful. Thus, our position relative to the All-Merciful is like Eve's position relative to Adam. She is the locus of procreation and the manifestation of the essences of the children. Similarly, we are the locus for the manifestation of Acts (الأفعال). Although the Act belongs to Allah, it only appears through our hands and is attributed to us perceptually. If we were not a branch of the All-Merciful, the Divine relationship (النسب الإلهي)—our being His servants—would not be valid, for the patron of a people is one of them. Our need for Him is the need of the part for the whole. Were it not for this degree of relationship, the Divine Might and Absolute Richness would not incline toward us or look upon us.\n\nThrough this relationship, we become His manifestation (مجلاها). His Essence (الذات) is only witnessed in us because we were created upon the Divine Form (الصورة الإلهية). We possess all the Divine Names (الأسماء الإلهية). There is no Divine Name in which we do not have a share, and no matter is established by us unless its ruling flows into the Origin.\n\nThe Prophet, peace and blessings be upon him, spoke about this Name in relation to the limbs of the human: that if one limb feels pain, the rest of the body responds with fever (الحمى). The existence of that pain in the specific limb causes fever in all other limbs, so the whole body suffers for the suffering of a part of its body. What then do you think of the Rational Soul (النفس الناطقة), which is the sovereign of this Secure Land (هذَا الْبَلَدِ الْأَمِينِ)? The Animal Soul (النفس الحيوانية) carries the fever in this instance, and it is to the Rational Soul like a king whose kingdom is partially disrupted, making his concern more intense.\n\nDo you not see that the Real (الحق), the Exalted, described Himself with Wrath, Mercy, Acceptance, and Response, and similar attributes, and made all of this contingent upon causes originating from us? If we disobey Him openly, we anger Him; and if we say a word that pleases Him, we satisfy Him, as the Messenger of Allah, peace and blessings be upon him, said: \"We only say what pleases our Lord.\"\n\nAnd if we repent, He prefers to accept us. If not for our sins, He would neither punish nor forgive. All of this validates the relationship, establishes the lineage, and strengthens the effects of the cause. We are children of co-wives (أولاد علات) with one mother and different fathers. He is the First Cause (السبب الأول) by proof, not by witnessing.\n\nSince what we mentioned is established, this relationship is supported by His saying: \"Whoever connects her (the Womb/رحم), Allah connects him, and whoever cuts her off, Allah cuts him off.\" Look at how astonishing this ruling is: He, the Exalted, cut her off from the All-Merciful (الرحمن) and yet made our happiness and connection (الوصلة) with Him dependent on connecting what He cut off. The appearance is one of contradiction, yet it contains Divine Proximity (القرب الإلهي), so that we may have the ruling of connection, which is returning the stranger to its people.\n\nThe Divine Wisdom in this is only to negate resemblance (التشبيه), for He said: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like Him). If we cut her off, we resemble Him in cutting off, since He made her a branch of the All-Merciful. Whoever cuts her off has resembled Him, and He does not resemble anything, nor does anything resemble Him, by the ruling of the Origin. Thus, He threatened the one who cuts her off with cutting him off from His Mercy, not from Himself. He commanded us to connect her, which means returning her to the One from whom she was cut off, for He said: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ>> (And to Him the matter is returned entirely, so worship Him and rely upon Him. And your Lord is not unaware of what you do). He attributed the action to you and made Himself a vigilant witness who neither neglects nor forgets, so that you may emulate Him in the duties He assigned you, and not be heedless or forgetful, because you are more deserving of this attribute due to your need and His richness beyond you.\n\nSince Eve was a branch of Adam, He placed between them love (مَوَدَّةً) and mercy (رَحْمَةً), signaling that there is love and mercy between the Womb (الرحم) and the All-Merciful (الرحمن). Therefore, He commanded you to connect her to the One from whom she was cut off. The cutting off belongs to Him, and the connection belongs to you, so that you may have a share in this matter by which you are honored above the rest of the Cosmos.\n\nThe love established between the spouses is the stability in marriage that necessitates procreation. The mercy established is the tenderness (الحنان) each spouse finds toward the other, inclining toward them and finding solace. From the perspective of the woman, this is the yearning of the part for its whole, the branch for its root, and the stranger for its homeland. The man's yearning for his wife is the yearning of the whole for its part, because only with the part is the name 'Whole' valid for him, and without it, this name is not established for him. It is the yearning of the root for the branch because the branch provides sustenance. If the branch did not exist, the Lordship of Sustenance (ربانية الإمداد) would not manifest for Him. Just as the Cosmos is necessary for Him to be a Lord over Himself—and He is Lord—the Cosmos is necessary. He has always been Lord, and the Fixed Entities (الأعيان الثابتة) have always looked to Him in need eternally (أزلا) so that He might bestow upon them the name of Existence (الوجود). He has always looked upon them in response to their call with the eye of Mercy. He has always been Lord, the Exalted, in our state of non-existence and in our state of existence. Possibility (الإمكان) for us is like Necessity (الوجوب) for Him.\n\nRealize, if your intellect contemplates our source,\nA negation of negation, and an affirmation of affirmation.\nAmong the most wondrous matters is that I have been eternal, without beginning,\nYet despite this, I am contingent in Essence (محدث الذات).\nYour Lord was existent, and nothing was with Him\nOther than Him, neither past nor future.\n\nThrough love and mercy, the whole sought its part, and the part sought its whole. They merged, and from that merging, the essences of the children appeared. This validated the name of Fatherhood (الأبوة) for the parents, a ruling they did not possess before the children's existence. The Lord (الرب) is not like this, for He has always been Lord eternally. The possible (الممكن) in its possibility has always been described by possibility, whether the possible exists or is characterized by non-existence. The precedence of non-existence for the possible over its existence is an eternal attribute. Thus, it has always been the object of Lordship (مربوب), even if non-existent. This is the difference between what is necessary for Allah and what is necessary for the servant in terms of nomenclature and the rank that arose for him through the existence of the son.\n\nWomen join men in Fatherhood. Furthermore, a woman sometimes stands in the place of two men, since the judge only rules based on the testimony of two men. Yet, the woman stands in their place in certain situations: the judge accepting her word regarding the menstrual period for the waiting period (عدة), and the husband accepting her word that this is his child (despite potential doubt), and accepting her word that she is menstruating. Here, she is treated as two just witnesses, just as the man is treated as two women in debt testimony. They intermingle in the ruling.\n\nSo the many acted on behalf of the few,\nAnd the few acted on behalf of the many.\nWhoever He wills, He joins him to the dust,\nAnd whoever He wills, He joins him to the ether.\n\nIf not for the perfection of the form (كمال الصورة), Vicegerency (الخلافة) would not be valid. He who seeks it is entrusted with it. He who receives it without seeking is aided in it. The seeker is a claimant (مدع) to upholding its right. He who is sought for it is one who resigns from it, because it is a trust that weighed heavily upon the heavens and the earth. Every claimant is tested, whoever he may be, and his test corresponds to the nature of his claim.\n\n<<وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا>> (And peace is upon him the day he was born and the day he dies and the day he is raised alive) is Divine testimony, conclusive. This is the station of one who received Vicegerency without seeking and Divine care without effort.\n\n<<وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا>> (And peace is upon me the day I was born and the day I die and the day I am raised alive) is a claim (دعوى) in a place of testing. If not for the intercession of his state in the cradle (due to the lack of established intellect), his ruling would be the same as Yahya's (John's), which is the preferred view. This is if he spoke without conscious intellect regarding what he uttered. If he spoke with conscious intellect, and his intellect was established and his signs were strengthened in reality and in the witnessed custom of the attendees, it is a breaking of custom (خرق عادة). If he was commanded to speak, he was merely reporting what Allah gave him and commanded him to report, so he is neither a claimant nor one who boasts of superiority, as the Messenger of Allah, peace and blessings be upon him, said: \"I am the master of the children of Adam, and no boasting (فخر).\" Boasting is rejoicing in falsehood. This statement is a report of a Divine matter. Such a person is not tested or examined, for he is not a claimant.\n\nAll these are states shared by women and men. They share all ranks (المراتب), even the rank of the Pole (القطبية). Do not be veiled by the Messenger's saying, peace and blessings be upon him: \"A people who entrust their affairs to a woman will never succeed.\" We are speaking of Allah's appointment, not the appointment by people, and the Hadith refers to those appointed by people.\n\nIf nothing else were available except the Prophet's saying on this matter: \"Women are the counterparts of men (شقائق الرجال),\" it would be sufficient. This means that everything a man can attain in stations, ranks, and attributes can be attained by any woman Allah wills, just as it can be attained by any man Allah wills.\n\nDo you not consider Allah's wisdom in what He added to the woman's name over the man's? For the man, He said *al-Mar'* (المرء). For the female, He said *al-Mar'ah* (المرأة), adding the *ha'* (هاء) in pause (or *ta'* in connection) to the name of the man. She has a degree of superiority over the man in this station, which compensates for the verse: <<وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ>> (And for men is a degree over them). This addition compensates for that deficiency. Likewise, the *alif* in *hublā* (pregnant) and the *hamza* in *hamrā'* (red).\n\nIf you mention the justification of the Real for establishing two women in testimony in place of one man by citing forgetfulness in His saying: <<أَنْ تَضِلَّ إِحْدَاهُمَا فَتُذَكِّرَ إِحْدَاهُمَا الْأُخْرَى>> (Lest one of them should err, and the other remind her), reminding only occurs after forgetting. Allah informed us that Adam forgot, and the Prophet, peace and blessings be upon him, said: \"Adam forgot, so his progeny forgot.\"\n\nThe forgetfulness of the children of Adam stems from Adam's forgetfulness, which is a Divine attribute that appeared in the Cosmos, as the Exalted said: <<نَسُوا اللَّهَ فَنَسِيَهُمْ>> (They forgot Allah, so He forgot them). However, the Real only described one of the two women with confusion (الحيرة) regarding her testimony, not complete forgetfulness (النسيان). Confusion is half of forgetfulness, not all of it. Complete forgetfulness is attributed to the man, for He said: <<فَنَسِيَ وَلَمْ نَجِدْ لَهُ عَزْمًا>> (He forgot, and We found not in him determination).\n\nIt is possible for the man to forget the testimony entirely and not recall it. But it is impossible for the woman who is the reminder—not the one who erred—to forget, for she reminds the one who erred regarding what she testified to. Since Allah's word is undoubtedly true, one of them must not err or forget. Thus, the single woman in testimony is described by the Real with a Divine attribute, which is Moses' saying, recounted in the Quran: <<لَا يَضِلُّ رَبِّي وَلَا يَنْسَى>> (My Lord neither errs nor forgets).\n\nIf there were no honor in the feminine gender (التأنيث) except the application of the term Essence (الذات) and Attribute (الصفة)—both feminine nouns—it would mend the heart of the woman which is broken by ignorant men.\n\nThe Lawgiver forbade us from contemplating the Essence of Allah (ذات الله), but did not prevent us from speaking about His Unity (توحيد الله). Rather, He commanded it, saying: <<فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ>> (So know that there is no god but Allah and ask forgiveness for your sin). The sin here is the desire that occurs to one who contemplates the Unity of Allah to seek His quiddity and reality—the knowledge of His Essence which is unknowable and forbidden to contemplate due to its immense magnitude and the lack of correspondence between it and what is imagined to be a proof for it. No imagination can conceive it, and no intellect can confine it. Rather, it possesses Majesty and Glorification. It is not permissible to seek it with the question *Mā* (What), as Pharaoh sought, erring in his question. For this reason, Moses, peace be upon him, avoided answering his question, because an erroneous question does not necessitate an answer, and the setting was public. Therefore, Moses spoke as he did, and Pharaoh felt that he had not answered his question as asked, because he imagined his question was valid. He did not know that the Essence of the Real, the Exalted, does not fall under the question *Mā*, but only under the question *Hal* (Is/Does), which asks about the existence of the questioned thing.\n\nPharaoh, realizing the ignorance he had fallen into, diverted the attention of the attendees so they would not notice, saying: <<إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ>> (Indeed, your messenger who has been sent to you is surely mad). If the Real had not informed Pharaoh, he would not have affirmed in this statement that a messenger was sent to them, and that Moses did not come on his own accord, because he called to another. Pharaoh attributed to Moses what Moses was upon, describing him as *majnūn* (mad/veiled), meaning veiled from you, so you do not know him. Moses made him known through his answer, but the attendees did not know him as the learned magicians knew him. That inner confusion remained with Pharaoh, fermenting the dough of his nature, and its ruling did not appear, nor did his dough ferment, until the moment he said: <<آمَنْتُ بِالَّذِي آمَنَتْ بِهِ بَنُوا إِسْرَائِيلَ>> (I believe in the One in whom the Children of Israel believe). He did not name Allah to remove ambiguity and doubt, since the attendees already knew that the Children of Israel only believed in the God from whom Moses and Aaron came to them. If he had said, \"I believe in Allah,\" and he had previously asserted that he knew no god for his people other than himself, they would have said he testified for himself, not for the One who sent Moses to us, just as Allah testified for Himself. He removed this ambiguity by what he said.\n\nAs for the realization of this matter, it is only known by those who know the rank of Nature (الطبيعة) relative to the Divine Command (الأمر الإلهي). The woman is to the man as Nature is to the Divine Command, because the woman is the locus of the existence of the children's essences (أعيان الأبناء), just as Nature is the locus for the manifestation of the essences of bodies (أعيان الأجسام) for the Divine Command, in which they are formed and from which they appear. Command without Nature cannot be, and Nature without Command cannot be. Existence (الكون) depends on both matters.\n\nDo not say that Allah is capable of bringing something into existence without another thing being passive, for Allah refutes you in that by His saying: <<إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Indeed, Our word to a thing when We intend it is only that We say to it, \"Be,\" and it is). That general 'thing-ness' (الشيئية العامة) common to everything, which is where the sharing occurs, is what we established. The Divine Command is directed toward it for the manifestation of a specific thing within that absolute 'thing-ness.' When bodies or physical forms appear, so do images, shapes, accidents (الأعراض), and all spiritual and sensory forces.\n\nPerhaps this is what the scholars of the Law refer to as what was with the Real before the creation of creation, \"below it no air, and above it no air.\" He mentioned it and named it with the name of an existent entity that accepts forms and shapes. We have mentioned the rank of Nature, which is this absolute 'thing-ness,' in the book of the First Marriage (النكاح الأول) from which the Cosmos appeared, its lower and upper parts.\n\nEverything other than Allah—whether dense or subtle, intelligible or sensible—is characterized by existence. We only know of it what manifests to us, just as we only know of the Divine Names what has reached us. Whoever knows the rank of Nature knows the rank of the Woman. Whoever knows the Divine Command knows the rank of the Man. The existence of created things depends on these two realities. However, this reality (Nature/Woman) is so subtle and hidden that its own children (the intellects) are ignorant of it. They affirm it in the composite world but deny it in the simple world, due to their ignorance of its rank, just as the rank of the woman is ignored here, despite the Lawgiver's warning by his saying, peace and blessings be upon him: \"Women are the counterparts of men.\"\n\nThe Command between them flows high and low. Do you not see that the Theophanies (التجليات) and embodied spiritual entities (الروحانيات المتجسدة) only appear in natural forms (صور طبيعية), even if those bodies are subject to rapid transformation? They do not emerge outside of Nature.\n\nThis is a vast station that allows for extensive discussion. We will mention the main issues it contains without detailing the branches. Among them are:\n\nKnowledge of the station from which the believer is called, and whether the call differs according to the caller.\nKnowledge of the cause of enmity between Allah and His creation, and whether enmity requires existence from both parties or only one.\nKnowledge of whether one can be an enemy for the sake of another, or whether enmity is only for one's own sake, not for the sake of another.\nKnowledge of the casting of love into hearts and its permanence therein, and whether its casting is an existential transition or a creation created in the locus.\nKnowledge of whether suitability is a prerequisite for love.\nKnowledge of banishment from homelands due to the necessity of the opposite.\nKnowledge of the hardships of the Divine paths.\nKnowledge of seeking contentment in activity and aversion.\nKnowledge of the secret and the manifest.\nKnowledge of confusion regarding a specific path.\nKnowledge of the love of concealment over Theophany (التجلي).\nKnowledge of the permanence of the cause that necessitates cutting off what was commanded to be connected, such that cutting it off becomes an act of proximity and connecting it becomes distance.\nKnowledge of the stations and how matters are returned by their ruling and their effect on cosmic matters and Divine rulings—this is a vast knowledge.\nKnowledge of seeing actions, despite their being cosmic accidents (أعراض كونية), and cosmic accidents are seen by their rulings, not their essences, unlike color accidents, whose essences and rulings are seen.\nKnowledge of following predecessors and the superior following the inferior.\nKnowledge of disavowal from the collective, but not from the Oneness of the collective.\nKnowledge of the concealment of the Oneness of the collective and Multiplicity (الكثرة).\nKnowledge of conditional love and conditional hatred, and whether that is valid in reality or not.\nKnowledge of whether exception is valid in it or not.\nKnowledge of whether the servant's reliance in his trust and states on a specific Name, rather than all the Divine Names, impairs Divine Knowledge or not.\nKnowledge of becoming (الصيرورة) from the knowledge of return (الرد) and reversion (الرجوع), and the difference between them and between each one and the other.\nKnowledge of choice in what is praised and blamed.\nKnowledge of the inclusion of Wisdom (الحكمة) within Might (العزة).\nKnowledge of shared hope (الرجاء المشترك).\nKnowledge of what results from turning away from the Absolute and Restricted Real (الحق المطلق والمقيد), and whether the one who turns away is affected by the turning away or not.\nKnowledge of whether proximity to a thing is an attribute of the Real or not.\nKnowledge of Mercy sometimes being through concealment and sometimes without concealment.\nKnowledge of the reason for honoring the generous and recompensing the base: whether it is by baseness, so they share it even if one is recompense, or whether He only recompenses him with beneficence.\nKnowledge of whether the baseness of the recompense is baseness in reality, or whether it is an attribute of the base person that returns to him when it manifests to him in another, so he dislikes it from that other, thereby knowing that it is his own attribute, and that in the Recompenser it is a contingent matter manifested for instruction. This is a noble and beneficial knowledge from which one understands Allah's punishment of His servants for their actions, despite His self-sufficiency from it and His lack of harm from it.\nKnowledge of whether creation can be characterized by baseness in recompense to this extent when punishing the base person, or not.\nKnowledge of how claimants are dealt with.\nKnowledge of ruling by Knowledge (العلم), and that conjecture (الظن) may be called Knowledge legally, and why conjecture is called Knowledge when it is its opposite.\nKnowledge of whether Knowledge here refers to the sign (العلامة) by which conjecture is attained in the mind of the conjecturing ruler, so his knowledge of that sign is knowledge that this is a dominant conjecture that must be ruled by, due to the scent of Knowledge in the sign, since Knowledge is nothing but the essence of the sign, and by it, it is called Knowledge. By Knowledge, Knowledge is known, just as all other known things are known by it, for they are all signs. Therefore, He said: <<ذَلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ>> (That is the extent of their knowledge), and it was not Knowledge. It is as if He said: that is what the sign gave them regarding that matter.\nKnowledge of the rational and legal lawful and unlawful.\nKnowledge of exchange in private parts (المعاوضة في الأبضاع)—this is a strange knowledge, because the buyer's only concern in that is enjoyment (الاستمتاع) specifically, so it is as if he is buying enjoyment.\nKnowledge of justice in Divine ruling and representation therein.\nKnowledge of the difference between Knowledge (العلم) and Wisdom (الحكمة).\nKnowledge of Allah taking a shield (وقاية) from what, and whether that belongs to the rank of Knowledge or the rank of Faith (الإيمان).\nKnowledge of the rulings of the follower and the followed: whether they unite in a matter or not.\nKnowledge of the pledge of allegiance (مبايعة) to the Imam (the ruler): whether its ruling is the ruling of sale, so what is sold and bought is specified.\nKnowledge of whether the sale of souls—the pledge unto death—is included in it or not.\nKnowledge of resemblance (التشبيه).\n\nThis is what this station contains of sciences. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو چوبیس: اس منزل کی معرفت میں جو بعض مواطن الٰہیہ میں عورتوں اور مردوں کو جمع کرتی ہے، اور یہ منزل الحضرة العاصمية (الحضرة العاصمية) سے ہے۔\n\nبے شک عورتیں مردوں کی ہمشکل (شقائق الذکران) ہیں،\nعالم ارواح اور اجسام میں۔\nاور حکمِ ہستی (الوجود) ان دونوں پر متحد ہے،\nجسے انسان سے تعبیر کیا جاتا ہے۔\nاور وہ ایک عارضی امر کے سبب اس سے جدا ہوئے،\nجس سے عورتیں مردوں سے الگ ہو گئیں۔\nمرتبہ اجماع سے ان دونوں میں\nاعیان میں حقیقت توحید (حقيقة التوحيد) کے ساتھ حکم لگایا جاتا ہے۔\nاور جب تم آسمان اور زمین کو دیکھو گے،\nتو تم ان دونوں میں بغیر کسی فرق کے فرق کرو گے۔\nاحسان کو ایک ہی آنکھ سے دیکھو،\nاور اس کا ظہور حکم کے ذریعے احسان سے ہوتا ہے۔\n\n[کہ انسانیت مرد اور عورت کو جامع ہے، اور اسی لیے انسانیت کے لحاظ سے مردوں کو عورتوں پر کوئی درجہ حاصل نہیں ہے]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ جب انسانیت مرد اور عورت کے لیے ایک جامع حقیقت (حقيقة جامعة) ہے، تو انسانیت کے لحاظ سے مردوں کو عورتوں پر کوئی درجہ حاصل نہیں ہے۔ جیسا کہ انسان اور عالم کبیر (العالم الکبیر) عالمیت میں شریک ہیں، لہٰذا اس جہت سے عالم کو انسان پر کوئی درجہ حاصل نہیں ہے۔ اور یہ ثابت ہو چکا ہے کہ مردوں کو عورتوں پر ایک درجہ حاصل ہے، اور یہ بھی ثابت ہو چکا ہے کہ سَمَاوَاتِ اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے (خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ)، اور اکثر لوگ یہ نہیں جانتے، باوجود اس کے کہ ترجیح کے وجود پر دلالت اور علامت میں اشتراک ہے۔ اور ذات حق نے فرمایا: کیا تمہاری تخلیق زیادہ مشکل ہے یا آسمان کی جسے اس نے بنایا؟ (أَ أَنْتُمْ أَشَدُّ خَلْقاً أَمِ السَّماءُ بَناها)۔ اور پھر ان چیزوں کا ذکر کیا جو آسمان کے ساتھ خاص ہیں، پھر زمین اور اس کے پھیلانے کا ذکر کیا، اور جو چیزیں اس کے ساتھ خاص ہیں، یہ سب انسان پر فضیلت دینے کے ضمن میں ہے۔\n\nپس ہم نے پایا کہ وہ درجہ جس کے ذریعے آسمان اور زمین کو انسان پر فضیلت دی گئی ہے، بعینہٖ وہی ہے جس کے ذریعے مرد کو عورت پر فضیلت دی گئی ہے۔ اور وہ یہ ہے کہ انسان آسمان اور زمین سے منفعل (منفعل) ہے اور ان دونوں کے درمیان ان ہی سے پیدا ہوا ہے۔ اور منفعل (متاثر ہونے والا) اس فاعل (اثر ڈالنے والے) کی قوت کو حاصل نہیں کر سکتا جس سے وہ منفعل ہوا ہے۔ اسی طرح ہم نے پایا کہ حوا آدم سے منفعل تھیں، چھوٹی پسلی سے نکالی گئیں اور وجود میں آئیں۔ پس اس وجہ سے وہ اس درجے کو پانے میں قاصر رہیں جس سے وہ منفعل ہوئی تھیں۔ لہٰذا وہ مرد کے مرتبے میں سے صرف اس حد کو جانتی ہیں جس سے وہ پیدا کی گئیں، یعنی پسلی۔ پس ان کا ادراک مرد کی حقیقت (حقيقة الرجل) سے قاصر رہا۔ اسی طرح انسان عالم میں سے صرف اسی قدر جانتا ہے جتنا اس نے اپنے وجود میں عالم سے لیا ہے، بس۔ لہٰذا انسان کبھی بھی پورے عالم کے درجے کو نہیں پہنچ سکتا، اگرچہ وہ اس کا خلاصہ ہی کیوں نہ ہو۔ اسی طرح عورت کبھی بھی مرد کے درجے کو نہیں پہنچ سکتی، باوجود اس کے کہ وہ اس خلاصے کا نچوڑ ہے۔\n\nاور عورت طبیعت (الطبيعة) سے مشابہت رکھتی ہے، اس لحاظ سے کہ وہ انفعال (انفعال) کا محل ہے۔ اور مرد ایسا نہیں ہے۔ کیونکہ مرد صرف رحم (الحرم) میں پانی ڈالتا ہے، اور رحم تخلیق اور پیدائش کا محل ہے۔ پس اس نوع کے اعیان (أعيان) انثیٰ میں ظاہر ہوتے ہیں، کیونکہ وہ تخلیق اور خلقی اطوار میں ایک تخلیق کے بعد دوسری تخلیق کے انتقال کو قبول کرتی ہے، یہاں تک کہ وہ ایک مکمل بشر کی صورت میں باہر آئے۔ پس اسی قدر سے مرد عورتوں سے ممتاز ہوتے ہیں۔ اور اسی لیے عورتیں مردوں سے عقل میں ناقص ہوتی ہیں، کیونکہ وہ صرف اسی قدر عقل رکھتی ہیں جتنا عورت نے اصل نشأت میں مرد کی تخلیق سے لیا ہے۔\n\nاور جہاں تک ان میں دین کے نقصان کا تعلق ہے، تو جزا عمل کے مطابق ہوتی ہے، اور عمل علم کے بغیر نہیں ہوتا، اور علم عالم (العالم) کے قبول کرنے کی صلاحیت کے مطابق ہوتا ہے، اور عالم کا قبول کرنا اصل نشأت میں اس کی استعداد (استعداده) کے مطابق ہوتا ہے۔ اور اس کی استعداد مرد کی استعداد سے کم ہے، کیونکہ وہ اس کا ایک جزو ہے۔ لہٰذا عورت کا مرد سے دین میں ناقص ہونا لازمی ہے۔\n\nاور یہ باب اس صفت کا متلاشی ہے جس میں عورتیں اور مرد جمع ہوتے ہیں، اور وہ وہی ہے جو ہم نے ذکر کی، یعنی حقائق (الحقائق) کے لحاظ سے ان کا مقام انفعال (مقام الانفعال) میں ہونا۔ اور جہاں تک ان عوارض کا تعلق ہے جو ان پر طاری ہوتے ہیں، تو اس کی مثال ذات حق کا یہ قول ہے: بے شک مسلمان مرد اور مسلمان عورتیں، اور مومن مرد اور مومن عورتیں... یہاں تک کہ فرمایا: اور اللہ کو کثرت سے یاد کرنے والے مرد اور یاد کرنے والی عورتیں (إِنَّ الْمُسْلِمِينَ وَالْمُسْلِماتِ وَالْمُؤْمِنِينَ وَالْمُؤْمِناتِ... وَالذَّاكِرِينَ اللَّهَ كَثِيراً وَالذَّاكِراتِ)۔\n\nاور ذات حق کا یہ قول: توبہ کرنے والے، عبادت کرنے والے، حمد کرنے والے، سیاحت کرنے والے (التَّائِبُونَ الْعابِدُونَ الْحامِدُونَ السَّائِحُونَ)۔ اور اس کا یہ قول: توبہ کرنے والیاں، عبادت کرنے والیاں، سیاحت کرنے والیاں (تائِباتٍ عابِداتٍ سائِحاتٍ)۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مردوں میں سے بہت سے کامل ہوئے اور عورتوں میں سے مریم بنت عمران اور آسیہ زوجہ فرعون۔\n\nپس مرد اور عورتیں کمال کے درجے میں جمع ہوئے، اور مرد کو اکملیت (الأكملية) کے ذریعے فضیلت دی گئی، نہ کہ کمالیت (الكمالية) کے ذریعے۔ اگر وہ نبوت کے ذریعے کامل ہوئے، تو مرد کو رسالت اور بعثت کے ذریعے فضیلت دی گئی، اور عورت کو بعثت اور رسالت کا درجہ حاصل نہیں ہوا۔ باوجود اس کے کہ ایک ہی مشترک مقام میں اس کے اصحاب کے درمیان تفاضل واقع ہوتا ہے، جیسا کہ ذات حق نے فرمایا: یہ وہ رسول ہیں جن میں سے ہم نے بعض کو بعض پر فضیلت دی (تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ)۔ اور فرمایا: اور بے شک ہم نے بعض نبیوں کو بعض پر فضیلت دی (وَلَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ)۔ اور اللہ نے مردوں اور عورتوں کو تکلیف (تکلیف) میں شریک کیا، پس عورتوں کو بھی مکلف کیا جیسا کہ مردوں کو مکلف کیا، اگرچہ عورت کسی ایسے حکم کے ساتھ خاص ہو جو مرد کے لیے نہ ہو، تو مرد بھی کسی ایسے حکم کے ساتھ خاص ہو سکتا ہے جو عورت کے لیے نہ ہو، اگرچہ عورتیں مردوں کی ہمشکل (شقائق الرجال) ہیں۔\n\n[کہ اصل ایجاد میں عورت کا مرتبہ مرد سے وہی ہے جو رحم کا الرحمن سے ہے]\n\nپھر جان لیجیے کہ اصل ایجاد میں عورت کا مرتبہ مرد سے وہی ہے جو رحم (الرحم) کا الرحمن (الرحمن) سے ہے، کیونکہ وہ اس کی ایک شاخ (شجنة) ہے، پس وہ اس کی صورت (صورته) پر نکلی۔ اور بعض روایات میں آیا ہے کہ اللہ نے آدم کو الرحمن کی صورت پر پیدا کیا۔\n\nاور یہ ثابت ہے کہ ہم میں رحم الرحمن کی ایک شاخ (شجنة) ہے۔ پس ہم الرحمن سے اس مرتبے پر نازل ہوئے جو حوا کا آدم سے تھا، اور وہ تناسل (التناسل) اور بیٹوں کے اعیان (أعيان) کے ظہور کا محل ہے۔ اسی طرح ہم افعال کے ظہور کا محل ہیں۔ پس اگرچہ فعل اللہ کا ہے، لیکن وہ ہمارے ہاتھوں کے بغیر ظاہر نہیں ہوتا، اور حسی طور پر اس کی نسبت ہماری طرف ہی کی جاتی ہے۔ اور اگر ہم الرحمن کی شاخ نہ ہوتے، تو الٰہی نسبت (النسب الإلهي) صحیح نہ ہوتی، یعنی ہمارا اس کا بندہ ہونا، اور قوم کا مولیٰ ان ہی میں سے ہوتا ہے۔ پس ہمارا اس کا محتاج ہونا جزو کا کل کا محتاج ہونا ہے۔ اور اگر یہ نسبت نہ ہوتی، تو عزت الٰہیہ (العزة الإلهية) اور غنی مطلق (الغني المطلق) کے لیے یہ جائز نہ ہوتا کہ وہ ہم پر مہربانی کرے اور نہ ہی ہماری طرف دیکھے۔ پس اسی نسبت کے ذریعے ہم اس کے مظہر (مجلاها) بن گئے، پس وہ اپنی ذات (ذات) کا شہود (شہود) ہمارے اندر ہی کرتا ہے، اس الٰہی صورت (الصورة الإلهية) کی وجہ سے جس پر اس نے ہمیں پیدا کیا۔ پس ہم نے تمام الٰہی اسماء (الأسماء الإلهية) کے مالک بن گئے، پس کوئی الٰہی اسم ایسا نہیں جس میں ہمارا کوئی حصہ نہ ہو، اور کوئی امر ہمارے ذریعے قائم نہیں ہوتا مگر اس کا حکم اصل میں سرایت کرتا ہے۔\n\nنبی صلی اللہ علیہ وسلم نے اس اسم کے بارے میں انسان کے اعضاء میں فرمایا کہ جب اس کا کوئی عضو درد محسوس کرتا ہے، تو باقی جسم بخار کے ذریعے اس کی طرف متوجہ ہوتا ہے۔ پس اس خاص عضو میں درد کے وجود کا اثر باقی اعضاء میں بخار کی صورت میں ظاہر ہوتا ہے، پس وہ سب دکھ محسوس کرتے ہیں کیونکہ ان کے جسم کا ایک جزو دکھ محسوس کر رہا ہے۔ تو آپ کا کیا خیال ہے اس نفس ناطقہ (النفس الناطقة) کے بارے میں جو اس بلد امین (هَذَا الْبَلَدِ الْأَمِينِ) کی سلطانہ ہے؟ اس مقام پر بخار کو اٹھانے والا نفس حیوانی (النفس الحيوانية) ہے، اور وہ نفس ناطقہ کے لیے اس بادشاہ کی طرح ہے جس کی کچھ سلطنت میں خلل پڑ جائے، تو اس کی پریشانی زیادہ شدید ہوتی ہے۔\n\nکیا آپ نہیں دیکھتے کہ ذات حق سبحانہ نے اپنے آپ کو غضب، رحمت، قبولیت اور اجابت جیسی صفات سے متصف کیا ہے، اور یہ سب ہمارے اعمال سے پیدا ہونے والے اسباب کا نتیجہ قرار دیا ہے۔ پس جب ہم کھلم کھلا اس کی نافرمانی کرتے ہیں تو ہم اسے غضبناک کرتے ہیں، اور جب ہم کوئی ایسا قول کہتے ہیں جسے وہ ہم سے پسند کرتا ہے تو ہم اسے راضی کرتے ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اور ہم نہیں کہتے مگر وہی جو ہمارا رب راضی ہو۔\n\nاور جب ہم توبہ کرتے ہیں تو ہم اس کے ہاں قبولیت کو ترجیح دیتے ہیں۔ اور اگر ہماری برائیاں نہ ہوتیں تو وہ نہ سزا دیتا اور نہ معاف کرتا۔ اور یہ سب کچھ نسبت کو صحیح ثابت کرتا ہے، نسبت کو قائم کرتا ہے، اور سبب کے آثار کو مضبوط کرتا ہے۔ پس ہم علاتی اولاد ہیں، ماں ایک ہے اور باپ مختلف ہیں۔ پس وہ دلیل کے ذریعے پہلا سبب ہے، نہ کہ مشاہدے کے ذریعے۔\n\nاور جب وہ بات جو ہم نے ذکر کی، ثابت ہو گئی، تو اس نسبت کو اس کے قول سے تقویت ملی: پس جس نے اسے جوڑا، اللہ نے اسے جوڑا، اور جس نے اسے کاٹا، اللہ نے اسے کاٹ دیا۔ پس دیکھیے یہ حکم کتنا عجیب ہے کہ اس نے اسے الرحمن سے کاٹ دیا، اور ہمارے لیے سعادت اور اس کے ساتھ وصل کو اس چیز کے وصل میں قرار دیا جسے اس نے کاٹا تھا۔ پس صورت تو منازعت کی ہے، اور اس میں قرب الٰہی (القرب الإلهي) ہے، تاکہ ہمارے لیے وصل کا حکم ہو، اور وہ اجنبی کو اس کے اہل کی طرف لوٹانا ہے۔ اور اس میں حکمت الٰہیہ (الحكمة الإلهية) کے لیے صرف تشبیہ کی نفی ہے، کیونکہ اس نے فرمایا: کوئی چیز اس کے مثل نہیں ہے (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)۔ پس جب ہم اسے کاٹتے ہیں تو ہم کاٹنے میں اس سے مشابہت اختیار کرتے ہیں، کیونکہ اس نے اسے الرحمن کی شاخ (شجنة) بنایا ہے۔ پس جس نے اسے کاٹا، اس نے اس سے تشبیہ اختیار کی، حالانکہ وہ کسی چیز سے مشابہت نہیں رکھتا اور نہ ہی کوئی چیز اصل کے حکم کے مطابق اس سے مشابہت رکھتی ہے۔ پس اس نے اسے کاٹنے والے کو اپنی رحمت سے کاٹنے کی وعید سنائی، نہ کہ اپنی ذات سے۔ اور ہمیں حکم دیا کہ ہم اسے جوڑیں، یعنی اسے اس کی طرف لوٹا دیں جس سے وہ کاٹی گئی تھی۔ کیونکہ اس نے فرمایا: اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں، پس اسی کی عبادت کرو اور اسی پر بھروسہ کرو، اور تمہارا رب تمہارے اعمال سے غافل نہیں ہے (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ)۔ پس اس نے عمل کی نسبت آپ کی طرف کی اور اپنی ذات کو اس پر نگران اور گواہ بنایا جو نہ غافل ہوتا ہے اور نہ بھولتا ہے، تاکہ آپ اس کی پیروی کریں ان اعمال میں جن کا اس نے آپ کو مکلف بنایا ہے، پس آپ نہ غافل ہوں اور نہ بھولیں، کیونکہ آپ اس صفت کے زیادہ حقدار ہیں، آپ کے محتاج ہونے اور اس کے آپ سے بے نیاز ہونے کی وجہ سے۔\n\nاور جب حوا آدم کی شاخ (شجنة) تھیں، تو اس نے ان دونوں کے درمیان محبت اور رحمت (مَوَدَّةً وَرَحْمَةً) پیدا کر دی، تاکہ یہ تنبیہ ہو کہ رحم اور الرحمن کے درمیان محبت اور رحمت ہے۔ اور اسی لیے اس نے آپ کو حکم دیا کہ آپ اسے اس سے جوڑیں جس سے وہ کاٹی گئی تھی، پس کاٹنا اس کے لیے ہو اور وصل آپ کے لیے ہو، تاکہ آپ کو اس امر میں ایک حصہ ملے جس سے آپ باقی عالم پر شرف حاصل کریں۔\n\nپس میاں بیوی کے درمیان پیدا کی گئی محبت (المودة) نکاح پر ثابت قدمی ہے جو توالد (توالد) کا موجب ہے۔ اور پیدا کی گئی رحمت (الرحمة) وہ ہے جو ہر ایک زوجین اپنے ساتھی کے لیے شفقت محسوس کرتا ہے، پس وہ اس کی طرف مائل ہوتا ہے اور سکون پاتا ہے۔ پس عورت کی طرف سے یہ جزو کا کل کی طرف، فرع کا اصل کی طرف، اور اجنبی کا وطن کی طرف مائل ہونا ہے۔ اور مرد کا اپنی بیوی کی طرف مائل ہونا کل کا اپنے جزو کی طرف مائل ہونا ہے، کیونکہ اسی سے اس پر کل کا نام صحیح ہوتا ہے، اور اس کے زوال سے یہ نام اس کے لیے ثابت نہیں ہوتا۔ اور اصل کا فرع کی طرف مائل ہونا اس لیے ہے کہ وہ اسے مدد فراہم کرتا ہے، پس اگر وہ نہ ہوتا تو اس کی امداد کی ربانیت (ربانية الإمداد) ظاہر نہ ہوتی۔ جیسا کہ اگر کائنات نہ ہوتی تو اس کے لیے اپنے آپ پر رب ہونا صحیح نہ ہوتا، حالانکہ وہ رب ہے۔ پس عالم کا ہونا ضروری ہے، اور وہ ہمیشہ سے رب رہا ہے، پس اعیان ثابتہ (الأعيان الثابتة) ہمیشہ سے ازل میں محتاجی کی نظر سے اسے دیکھتی رہی ہیں تاکہ وہ ان پر ہستی (الوجود) کا نام ڈال دے۔ اور وہ ہمیشہ سے ان کی طرف رحمت کی آنکھ سے دیکھتا رہا ہے، ان کے استدعا کرنے کی وجہ سے۔ پس وہ سبحانہ و تعالیٰ ہمارے عدم کی حالت میں بھی اور ہمارے وجود کی حالت میں بھی ہمیشہ سے رب رہا ہے۔ اور ہمارے لیے امکان (الإمكان) ویسا ہی ہے جیسا اس کے لیے وجوب (الوجوب) ہے۔\n\n> اگر تم ہمارے مصدر پر غور کرو تو تمہاری عقل اسے ثابت کر دے گی،\n> نفی کی نفی اور اثبات کا اثبات کرتے ہوئے۔\n> یہ عجیب امر ہے کہ میں ازل سے ہمیشہ رہا ہوں،\n> اور اس کے باوجود میری ذات محدث ہے۔\n> تمہارا رب موجود تھا اور اس کے ساتھ\n> نہ کوئی اور چیز تھی، نہ ماضی اور نہ مستقبل۔\n\nپس محبت اور رحمت کے ذریعے کل نے اپنے جزو کو طلب کیا اور جزو نے اپنے کل کو، پس وہ دونوں مل گئے، اور اس ملاپ سے بیٹوں کے اعیان (أعيان الأبناء) ظاہر ہوئے، پس ان کے لیے ابوت (الأبوة) کا نام صحیح ہوا۔ پس بیٹوں کے وجود نے باپوں کو ایک ایسا حکم دیا جس پر وہ پہلے نہیں تھے، اور وہ ابوت ہے۔ اور رب ایسا نہیں ہے، کیونکہ وہ ازل سے ہمیشہ رب رہا ہے۔ کیونکہ ممکن (الممكن) اپنے امکان میں ہمیشہ سے امکان کی صفت سے متصف رہا ہے، خواہ ممکن موجود ہو یا عدم کی صفت سے متصف ہو۔ کیونکہ اس کی طرف نظر اس کے عدم کی حالت میں بھی ہمیشہ سے رہی ہے، اور ممکن کے لیے وجود سے پہلے عدم کا ہونا ایک ازلی صفت ہے۔ پس وہ ہمیشہ سے مربوب رہا ہے، اگرچہ وہ موجود نہ ہو۔ پس یہ وہ فرق ہے جو اللہ کے لیے واجب ہونے والی چیز اور بندے کے لیے واجب ہونے والی چیز کے درمیان ہے، اسمیت اور اس مرتبے کے لحاظ سے جو اسے بیٹے کے وجود سے حاصل ہوا۔\n\nپس عورتیں ابوت میں مردوں کے ساتھ شامل ہو گئیں، اور عورتوں کا مردوں کے ساتھ شامل ہونا، بلکہ عورت بعض مواطن میں دو مردوں کا مقام سنبھالتی ہے، کیونکہ حاکم دو مردوں کی گواہی کے بغیر حکم نہیں لگاتا۔ پس عورت بعض مواطن میں ان دونوں کا مقام سنبھالتی ہے، اور وہ یہ ہے کہ حاکم اس کے قول کو عدت کے حیض کے بارے میں قبول کرتا ہے، اور شوہر اس کے قول کو قبول کرتا ہے کہ یہ اس کا بیٹا ہے، باوجود اس کے کہ اس میں احتمال موجود ہے۔ اور اس کے قول کو قبول کرنا کہ وہ حائضہ ہے، پس وہ یہاں دو عادل گواہوں کے مرتبے پر نازل ہوئی، جیسا کہ مرد دین کی گواہی میں دو عورتوں کے مرتبے پر نازل ہوا۔ پس وہ حکم میں ایک دوسرے میں داخل ہو گئے۔\n\n> پس کثیر نے قلیل کی جگہ لی،\n> اور قلیل نے کثیر کی جگہ لی۔\n> پس جو چاہے اسے مٹی سے جوڑ دے،\n> اور جو چاہے اسے اثیر سے جوڑ دے۔\n\nاگر صورت کا کمال نہ ہوتا تو خلافت (الخلافة) صحیح نہ ہوتی۔ پس جس نے اسے طلب کیا، وہ اس کے سپرد کر دی گئی، اور جسے وہ بغیر طلب کے ملی، اس کی مدد کی گئی۔ پس طلب کرنے والا اس کے حق کو ادا کرنے کا مدعی ہے، اور جو اس کے ذریعے طلب کیا گیا وہ اس سے استعفیٰ دینے والا ہے، کیونکہ یہ ایک امانت ہے جو آسمانوں اور زمین پر بھاری ہو گئی (ثَقُلَتْ فِي السَّمَاوَاتِ وَالْأَرْضِ)۔ اور ہر مدعی آزمایا جاتا ہے، یہ صفت جس میں بھی ہو، میں کسی کو مستثنیٰ نہیں کرتا۔ اور اس کا امتحان اس دعوے کی صورت پر ہوتا ہے جو وہ کرتا ہے۔ اور سلامتی ہو اس پر جس دن وہ پیدا ہوا، اور جس دن وہ مرے گا، اور جس دن وہ زندہ اٹھایا جائے گا (وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا)۔ یہ ایک الٰہی گواہی ہے جو یقینی ہے۔ پس یہ اس شخص کا مرتبہ ہے جسے خلافت بغیر طلب کے ملی اور عنایت بغیر کوشش کے ملی۔ اور سلامتی ہو مجھ پر جس دن میں پیدا ہوا، اور جس دن میں مروں گا، اور جس دن میں زندہ اٹھایا جاؤں گا (وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا)۔ یہ امتحان کے مقام کا دعویٰ ہے، اگر اس میں گہوارے کی حالت کی شفاعت نہ ہوتی، عقل کے مستحکم نہ ہونے کی وجہ سے، تو اس کا حکم یحییٰ جیسا ہوتا، اور وہ زیادہ اولیٰ ہے۔ یہ اس صورت میں ہے جب وہ غیر معقول بات کر رہا ہو جسے وہ سمجھتا نہ ہو۔ اور اگر وہ اسے سمجھتا ہو، اور اس کی عقل مستحکم ہو چکی ہو، اور اس کی نعمتیں نفس الامر میں اور حاضرین کے مشہود عادت میں قوی ہو چکی ہوں، تو یہ خرق عادت ہے۔ پس اگر اسے اس بات کا حکم دیا گیا ہو جو اس نے کہی، تو وہ اس چیز کی خبر دے رہا ہے جو اللہ نے اسے دی اور اسے خبر دینے کا حکم دیا۔ پس وہ نہ مدعی ہے اور نہ فخر کا طالب، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں اولاد آدم کا سردار ہوں اور کوئی فخر نہیں (أنا سيد ولد آدم ولا فخر)۔\n\n\"فخر\" (بالراء) باطل پر تبجح (شیخی بگھارنا) ہے۔ پس یہ ایک الٰہی امر سے آگاہ کرنے والا ہے۔ پس ایسا شخص نہ آزمایا جاتا ہے اور نہ اس کا امتحان لیا جاتا ہے، کیونکہ وہ مدعی نہیں ہے۔\n\nاور یہ سب وہ احوال ہیں جن میں عورتیں اور مرد شریک ہیں، اور وہ تمام مراتب میں شریک ہیں، یہاں تک کہ قطبیت (القطبية) میں بھی۔ اور آپ کو رسول اللہ صلی اللہ علیہ وسلم کا یہ قول حجاب میں نہ ڈالے: وہ قوم کبھی فلاح نہیں پائے گی جس نے اپنا معاملہ کسی عورت کے سپرد کر دیا (لن يفلح قوم ولوا أمرهم امرأة)۔ کیونکہ ہم اللہ کی ولایت کے بارے میں بات کر رہے ہیں، نہ کہ لوگوں کی ولایت کے بارے میں۔ اور حدیث ان لوگوں کے بارے میں آئی ہے جنہیں لوگوں نے والی بنایا۔ اور اگر اس مسئلے میں صرف نبی صلی اللہ علیہ وسلم کا یہ قول نہ بھی آتا کہ: بے شک عورتیں مردوں کی ہمشکل ہیں (إن النساء شقائق الرجال)، تو یہ کافی ہوتا۔ یعنی ہر وہ مقام، مرتبہ اور صفت جو مرد کو حاصل ہو سکتی ہے، وہ اللہ کی مشیت سے عورتوں میں سے جسے چاہے حاصل ہو سکتی ہے، جیسا کہ اللہ کی مشیت سے مردوں میں سے جسے چاہے حاصل ہوئی۔\n\nکیا آپ اللہ تعالیٰ کی حکمت پر غور نہیں کرتے کہ اس نے عورت کے نام میں مرد کے نام پر اضافہ کیا؟ پس اس نے مرد کے لیے \"المرء\" کہا، اور عورت کے لیے \"المرأة\" کہا۔ پس اس نے وقف میں ہاء اور وصل میں تاء کا اضافہ کیا مرد کے نام \"المرء\" پر۔ پس اس مقام پر عورت کو مرد پر ایک درجہ حاصل ہے، جو مرد کو اس کے قول کے مقابلے میں حاصل نہیں ہے: اور مردوں کو ان پر ایک درجہ حاصل ہے (وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ)۔ پس اس نے اس کمی کو عورت میں اس اضافے سے پورا کر دیا۔ اور اسی طرح \"حُبْلَى\" (حاملہ) کا الف اور \"حَمْرَاء\" (سرخ) کا ہمزہ۔\n\nاور اگر آپ شہادت میں ایک مرد کے مقابلے میں دو عورتوں کو کھڑا کرنے میں حق کی علت کا ذکر کریں، تو وہ بھولنے کی وجہ سے ہے، اس کے قول میں: تاکہ اگر ان میں سے ایک بھول جائے تو دوسری اسے یاد دلا دے (أَنْ تَضِلَّ إِحْدَاهُمَا فَتُذَكِّرَ إِحْدَاهُمَا الْأُخْرَىٰ)۔ اور یاد دلانا بھولنے کے بغیر نہیں ہوتا۔ اور اللہ تعالیٰ نے آدم کے بارے میں خبر دی کہ وہ بھول گئے، اور صلی اللہ علیہ وسلم نے فرمایا: آدم بھول گئے تو ان کی ذریت بھول گئی۔\n\nپس بنی آدم کا بھولنا آدم کے بھولنے کی وجہ سے ہے، جیسا کہ ہم ان کی ذریت ہیں۔ اور یہ ایک الٰہی صفت ہے جو عالم میں اس سے صادر ہوئی، ذات حق نے فرمایا: انہوں نے اللہ کو بھلا دیا تو اس نے انہیں بھلا دیا (نَسُوا اللَّهَ فَنَسِيَهُمْ)۔\n\nاس کے باوجود ذات حق نے دو عورتوں میں سے ایک کو صرف اس چیز میں حیرت (الحيرة) سے متصف کیا جس کی اس نے گواہی دی، اسے نسیان (النسيان) سے متصف نہیں کیا۔ اور حیرت نسیان کا نصف ہے، پورا نہیں۔ اور نسیان کو کمال کے ساتھ مرد کی طرف منسوب کیا، پس فرمایا: پس وہ بھول گیا اور ہم نے اس میں کوئی عزم نہ پایا (فَنَسِيَ وَلَمْ نَجِدْ لَهُ عَزْماً)۔ پس ممکن ہے کہ مرد گواہی کو بالکل بھول جائے اور اسے یاد نہ کرے، اور یہ ممکن نہیں کہ دو عورتوں میں سے ایک بھول جائے، اور وہ یاد دلانے والی ہے، نہ کہ تعین کے ساتھ، پس وہ اسے یاد دلائے گی جو اس چیز کے بارے میں بھٹک گئی جس کی اس نے گواہی دی تھی۔ کیونکہ اللہ کی خبر بلاشبہ سچی ہے، اور اس نے اس آیت میں خبر دی ہے کہ ان میں سے ایک دوسری کو یاد دلائے گی۔ پس ضروری ہے کہ ایک ایسی ہو جو گواہی سے نہ بھٹکے اور نہ بھولے۔ پس ایک عورت گواہی میں حق کی خبر کے ذریعے ایک الٰہی صفت سے متصف ہوئی، اور وہ موسیٰ کا قول ہے جو قرآن میں ان سے حکایت کیا گیا: میرا رب نہ گمراہ ہوتا ہے اور نہ بھولتا ہے (لَا يَضِلُّ رَبِّي وَلَا يَنْسَىٰ)۔\n\nاور اگر تانیث (التأنيث) کے شرف میں صرف ذات (الذات) کا اللہ پر اطلاق اور صفت (الصفة) کا اطلاق نہ ہوتا، اور یہ دونوں تانیث کے الفاظ ہیں، تو یہ عورت کے دل کو تسلی دینے کے لیے کافی تھا، جسے مردوں میں سے وہ لوگ توڑتے ہیں جنہیں اس امر کا علم نہیں ہے۔\n\nاور شارع نے ہمیں اللہ کی ذات میں غور و فکر کرنے سے منع کیا ہے، اور اس نے ہمیں اللہ کی توحید (التوحيد) کے بارے میں بات کرنے سے نہیں روکا، بلکہ اس کا حکم دیا، پس فرمایا: پس جان لو کہ اللہ کے سوا کوئی معبود نہیں اور اپنے گناہوں کی مغفرت طلب کرو (فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ)۔ اور یہاں وہ چیز ہے جو اللہ کی توحید پر غور کرنے والے کے دل میں آتی ہے، یعنی اس کی ماہیت اور حقیقت (حقيقته) کی طلب، اور وہ اس کی ذات کی معرفت ہے جو جانی نہیں جاتی، اور اس میں غور و فکر کو اس کی عظمت اور اس کے اور اس چیز کے درمیان عدم مناسبت کی وجہ سے ممنوع قرار دیا گیا ہے جسے اس پر دلیل سمجھا جاتا ہے۔ پس نہ تو وہم اس کا تصور کر سکتا ہے اور نہ عقل اسے قید کر سکتی ہے، بلکہ اس کے لیے جلال اور تعظیم ہے۔ بلکہ یہ جائز نہیں کہ اسے \"ما\" (کیا) کے ذریعے طلب کیا جائے، جیسا کہ فرعون نے طلب کیا اور سوال میں غلطی کی۔ اور اسی لیے موسیٰ علیہ السلام نے اس کے سوال کے جواب سے گریز کیا، کیونکہ جب سوال غلط ہو تو اس کا جواب دینا ضروری نہیں ہوتا، اور وہ ایک عام مجلس تھی۔ اس لیے موسیٰ نے وہ بات کہی جو انہوں نے کہی، اور فرعون نے سمجھا کہ انہوں نے اس کے سوال کے مطابق جواب نہیں دیا، کیونکہ اس نے خیال کیا کہ اس کا سوال درست ہے، اور اسے یہ معلوم نہیں تھا کہ ذات حق تعالیٰ \"ما\" (کیا) کے مطالبے کے تحت نہیں آتی، بلکہ \"ہل\" (کیا وہ ہے) کے مطالبے کے تحت آتی ہے، اور \"ہل\" مسئول عنہ کے وجود کے بارے میں سوال ہے کہ کیا وہ متحقق ہے یا نہیں؟\n\nپس فرعون نے حاضرین کو مشغول کرنے کے لیے، تاکہ وہ اس جہالت کو نہ سمجھیں جس میں وہ پڑا تھا، کہا: بے شک تمہارا رسول جو تمہاری طرف بھیجا گیا ہے، یقیناً پاگل ہے (إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ)۔ اور اگر حق تعالیٰ فرعون کو یہ نہ بتاتا کہ اسے ایک بھیجنے والے نے بھیجا ہے اور وہ خود سے نہیں آیا، کیونکہ وہ کسی اور کی طرف دعوت دے رہا تھا، تو فرعون نے اس کی نسبت اس چیز کی طرف کی جو موسیٰ پر تھی، پس اسے مجنون (پاگل) قرار دیا، یعنی تم سے پوشیدہ ہے، پس تم اسے نہیں جانتے۔ پس موسیٰ نے اسے اپنے جواب سے پہچنوایا، اور حاضرین نے اسے نہیں پہچانا جیسا کہ جادوگروں کے علماء نے پہچانا، اور جادو سے ناواقف لوگ اسے نہیں پہچانے۔ اور وہ خمیر فرعون کے پاس باقی رہا، جس سے اس کی مٹی کا گوندھ تیار ہوتا رہا، اور اس کا حکم ظاہر نہیں ہوا اور نہ ہی اس کا گوندھ تیار ہوا مگر اس وقت جب اس نے کہا: میں اس پر ایمان لایا جس پر بنی اسرائیل ایمان لائے (آمَنْتُ بِالَّذِي آمَنَتْ بِهِ بَنُو إِسْرَائِيلَ)۔ اور اس نے اللہ کا نام نہیں لیا تاکہ ابہام اور شک کو دور کرے، کیونکہ حاضرین کو پہلے سے معلوم تھا کہ بنی اسرائیل صرف اسی معبود پر ایمان لائے ہیں جس کی طرف سے موسیٰ اور ہارون ان کے پاس آئے تھے۔ پس اگر وہ کہتا کہ میں اللہ پر ایمان لایا، حالانکہ اس نے یہ طے کر رکھا تھا کہ وہ اپنی قوم کے لیے اپنے سوا کسی معبود کو نہیں جانتا، تو وہ کہتے کہ اس نے اپنے لیے گواہی دی ہے، نہ کہ اس کے لیے جس نے موسیٰ کو ہماری طرف بھیجا، جیسا کہ اللہ نے اپنے لیے گواہی دی۔ پس اس نے اپنے قول سے اس ابہام کو دور کر دیا۔\n\nاور جہاں تک اس مسئلے کی تحقیق کا تعلق ہے، تو اسے صرف وہی جانتا ہے جو امر الٰہی (الأمر الإلهي) سے طبیعت (الطبيعة) کے مرتبے کو جانتا ہے۔ کیونکہ عورت مرد سے طبیعت کا امر الٰہی سے وہی مرتبہ رکھتی ہے۔ کیونکہ عورت بیٹوں کے اعیان (أعيان الأبناء) کے وجود کا محل ہے، جیسا کہ طبیعت امر الٰہی کے لیے اجسام کے اعیان کے ظہور کا محل ہے، ان میں وہ وجود میں آئے اور ان سے ظاہر ہوئے۔ پس طبیعت کے بغیر امر نہیں ہوتا، اور امر کے بغیر طبیعت نہیں ہوتی۔ پس کائنات ان دونوں امور پر موقوف ہے۔ اور یہ نہ کہو کہ اللہ کسی چیز کو کسی دوسرے امر کے منفعل ہوئے بغیر پیدا کرنے پر قادر ہے، کیونکہ اللہ اس بارے میں آپ کو اپنے اس قول سے جواب دیتا ہے: ہمارا قول کسی چیز کے لیے جب ہم اس کا ارادہ کرتے ہیں تو صرف یہ ہے کہ ہم اسے کہیں: ہو جا، پس وہ ہو جاتی ہے (إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ)۔\n\nپس وہ شیئیت عامہ (الشيئية العامة) جو ہر خاص چیز کے لیے ہے، اور جس میں اشتراک واقع ہوا ہے، وہی ہے جسے ہم نے ثابت کیا ہے۔ اور یہ کہ امر الٰہی اس پر متوجہ ہوتا ہے تاکہ اس مطلق شیئیت میں کوئی خاص چیز ظاہر ہو۔ پس جب اجسام یا اجساد ظاہر ہوتے ہیں تو صورتیں، شکلیں، اعراض اور تمام روحانی اور حسی قوتیں ظاہر ہوتی ہیں۔ اور بعض اوقات کہا جاتا ہے کہ یہ وہی ہے جسے شرع کی زبان میں علماء نے تعبیر کیا ہے کہ وہ خلق سے پہلے حق کے لیے تھا، اس کے نیچے ہوا نہیں تھی اور نہ اس کے اوپر ہوا تھی۔ پس اس نے اس کا ذکر کیا اور اسے ایک موجود نام سے موسوم کیا جو صورتوں اور شکلوں کو قبول کرتا ہے۔ اور ہم نے طبیعت کے مرتبے کا ذکر کیا ہے، اور وہ یہی مطلق شیئیت ہے، کتاب النکاح الاول میں جس سے عالم کا نچلا اور بالائی حصہ ظاہر ہوا، اور اللہ کے سوا ہر چیز، خواہ وہ کثیف ہو یا لطیف، معقول ہو یا محسوس، ہستی (الوجود) سے متصف ہے۔ پس ہم ان میں سے صرف اسی قدر جانتے ہیں جتنا ہمارے لیے ظاہر ہوتا ہے، جیسا کہ ہم الٰہی اسماء (الأسماء الإلهية) میں سے صرف اسی قدر جانتے ہیں جتنا ہم تک پہنچا ہے۔ پس جس نے طبیعت کے مرتبے کو جانا، اس نے عورت کے مرتبے کو جانا، اور جس نے امر الٰہی کو جانا، اس نے مرد کے مرتبے کو جانا۔ اور یہ کہ اللہ کے سوا موجودات کا وجود ان دو حقیقتوں پر موقوف ہے۔ البتہ یہ حقیقت پوشیدہ اور دقیق ہے، یہاں تک کہ عقلوں میں سے اس کے بیٹے بھی اس سے ناواقف رہتے ہیں، پس وہ اسے عالم بسیط (العالم البسيط) میں ثابت نہیں کرتے اور عالم مرکب (العالم المركب) میں ثابت کرتے ہیں۔ اور یہ اس کے مرتبے سے ان کی جہالت کی وجہ سے ہے، جیسا کہ یہاں عورت کے مرتبے سے جہالت کی گئی، باوجود اس کے کہ شارع نے اس کے مرتبے پر اپنے اس قول سے تنبیہ کی:\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: بے شک عورتیں مردوں کی ہمشکل ہیں (إن النساء شقائق الرجال)۔\n\nپس ان دونوں کے درمیان امر بلندی اور پستی کا ہوتا ہے۔ کیا آپ ظہور الٰہی (التجلی) اور متجسم ہونے والی روحانیات کو نہیں دیکھتے کہ کیا وہ غیر طبعی صورتوں میں ظاہر ہوتی ہیں؟ اگرچہ وہ اجساد تیزی سے تبدیل ہونے والے ہوں، لیکن وہ ان سے باہر نہیں نکلتے۔ اور یہ ایک وسیع منزل ہے جس میں میدان وسیع ہوتا ہے۔ پس ہم ان مسائل کی ماؤں کا ذکر کرتے ہیں جو اس میں شامل ہیں، بغیر تفریع کے۔\n\nان میں سے یہ ہے کہ مؤمن کو کس مقام سے پکارا جاتا ہے؟ اور کیا پکارنے والے کے اختلاف سے پکار میں اختلاف ہوتا ہے یا نہیں؟ اور اس منزل میں اللہ اور اس کی مخلوق کے درمیان عداوت کے سبب کا علم بھی ہے، اور کیا عداوت کے لیے ضروری ہے کہ وہ دونوں طرف سے پائی جائے یا ایک طرف سے؟ اور کیا کوئی کسی کی خاطر کسی سے عداوت کرتا ہے، یا عداوت صرف اپنی ذات کی خاطر ہوتی ہے، نہ کہ کسی اور کی خاطر؟\n\nاور دلوں میں محبت ڈالنے اور اس کے اس میں ثابت رہنے کا علم، اور کیا اس کا ڈالنا وجودی انتقال ہے یا محل میں پیدا کی جانے والی تخلیق؟ اور کیا محبت کے لیے مناسبت شرط ہے یا نہیں؟ اور نقیض کے موجب سے وطن سے دور کیے جانے کا علم۔ اور الٰہی راستوں کی مشقتوں کا علم۔ اور خوشی اور ناخوشی میں رضا طلب کرنے کا علم۔ اور راز اور علانیہ کا علم۔ اور ایک خاص راستے سے حیرت (الحيرة) کا علم۔ اور ظہور الٰہی (التجلی) پر پردہ ڈالنے کی محبت کا علم۔ اور اس سبب کے ثابت رہنے کا علم جو اس چیز کو کاٹنے کا موجب ہے جسے جوڑنے کا حکم دیا گیا ہے، پس اس کا کاٹنا قربت ہو اور اس کا جوڑنا دوری ہو۔ اور مواطن کا علم، اور کس طرح امور اپنے حکم اور اپنے اثر کے ساتھ کونی امور اور الٰہی احکام میں لوٹتے ہیں، اور یہ ایک وسیع علم ہے۔\n\nاور اعمال کو دیکھنے کا علم، باوجود اس کے کہ وہ کونی اعراض ہیں، اور کونی اعراض کے احکام دیکھے جاتے ہیں نہ کہ ان کے اعیان، برخلاف لونی اعراض کے، کیونکہ ان کے اعیان اور احکام دونوں دیکھے جاتے ہیں۔ اور متقدمین کی پیروی کا علم، اور فاضل کا مفضول کی پیروی کرنا۔ اور جمع سے بیزاری کا علم، نہ کہ جمع کی احدیت (أحدية الجمع) سے۔ اور جمع اور کثرت کی احدیت پر پردہ ڈالنے کا علم۔ اور مشروط محبت اور مشروط بغض کا علم، اور کیا نفس الامر میں یہ صحیح ہے یا صحیح نہیں؟ اور کیا اس میں استثناء صحیح ہے یا صحیح نہیں؟ اور کیا بندے کا اپنے توکل اور احوال میں تمام الٰہی اسماء (الأسماء الإلهية) کے بجائے کسی خاص اسم کی طرف رجوع کرنا الٰہی علم میں نقص پیدا کرتا ہے یا نہیں؟\n\nاور صیرورت (الصيرورة) کا علم، رد اور رجوع (الرد والرجوع) کے علم سے، اور ان دونوں کے درمیان اور ہر ایک کا دوسرے سے فرق۔ اور اس چیز میں اختیار کا علم جس کی تعریف کی جاتی ہے اور جس کی مذمت کی جاتی ہے۔ اور عزت کا حکمت کو شامل ہونے کا علم۔ اور مشترک رجاء (امید) کا علم۔ اور حق مطلق اور مقید سے منہ موڑنے کا نتیجہ کیا نکلتا ہے، اور کیا منہ موڑنے والا منہ موڑنے کے وقت متاثر ہوتا ہے یا نہیں؟ اور کسی چیز سے قربت کا علم، کیا ذات حق اس صفت سے متصف ہوتی ہے یا نہیں؟ اور رحمت کا پردہ ڈالنے کے ساتھ اور بغیر پردہ ڈالنے کے ہونے کا علم۔ اور کریم کے اکرام اور لئیم کو جزا دینے کا سبب، کیا وہ لئامت کی وجہ سے ہوتا ہے، پس وہ شریک ہوتے ہیں، اگرچہ ایک جزا ہو، یا وہ اسے صرف احسان سے جزا دیتا ہے؟ اور کیا جزا کی لئامت نفس الامر میں لئامت ہے، یا یہ لئیم کی صفت ہے جو اس پر لوٹتی ہے جب وہ اسے کسی اور میں دیکھتا ہے، پس اسے ناپسند کرتا ہے، پس اسے معلوم ہوتا ہے کہ یہ اس کی صفت ہے، اور یہ کہ جزا دینے والے میں یہ ایک عارضی امر ہے جسے اس نے تعلیم کے لیے ظاہر کیا؟ اور یہ ایک شریف اور نفع بخش علم ہے، جس سے اللہ کا اپنے بندوں کو ان کے اعمال پر سزا دینے کا علم ہوتا ہے، باوجود اس کے کہ وہ خود اس سے بے نیاز ہے اور اسے اس سے کوئی نقصان نہیں ہوتا۔ اور کیا مخلوق کے لیے لئیم کو جزا دینے میں اس حد تک لئامت کے ساتھ جزا دینا ممکن ہے یا نہیں؟ اور دعویداروں کے ساتھ کیے جانے والے سلوک کا علم۔ اور علم کے ساتھ حکم کرنے کا علم، اور یہ کہ ظن کو شرعاً علم کہا جا سکتا ہے، اور ظن کو علم کیوں کہا جاتا ہے حالانکہ وہ اس کی ضد ہے؟ اور کیا یہاں علم سے مراد وہ علامت ہے جس سے حکم کرنے والے ظن کرنے والے کے نفس میں ظن پیدا ہوتا ہے، پس اس کا اس علامت کے ذریعے علم ہونا یہ علم ہے کہ یہ غالب ظن ہے جس کے ساتھ حکم کرنا واجب ہے، علامت کے علم کی خوشبو کی وجہ سے، کیونکہ علم صرف عین علامت ہے، اور اسی لیے اسے علم کہا گیا؟ پس علم کے ذریعے علم جانا جاتا ہے، جیسا کہ اس کے ذریعے باقی معلومات جانی جاتی ہیں، پس وہ سب علامات ہیں۔ اور اسی لیے فرمایا: یہ ان کے علم کی انتہا ہے (ذَلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ)، اور اسے علم نہیں کہا۔ پس گویا اس نے کہا کہ یہ وہ چیز ہے جو علامت نے انہیں اس امر میں دی ہے۔\n\nاور عقلی اور شرعی حلال اور حرام کا علم۔ اور ابضاع (شرمگاہوں) میں معاوضہ کا علم، اور یہ ایک عجیب علم ہے، کیونکہ خریدار کا اس میں صرف استمتاع (لطف اندوز ہونا) سے تعلق ہے، پس گویا وہ استمتاع خریدتا ہے۔ اور الٰہی حکم میں عدل اور اس میں نیابت کا علم۔ اور علم اور حکمت کے درمیان فرق کا علم۔ اور اللہ کا کس چیز سے بچاؤ اختیار کرنے کا علم، اور کیا یہ علم کے مرتبے سے ہے یا ایمان کے مرتبے سے؟ اور تابع اور متبوع کے احکام کا علم، کیا وہ کسی امر میں جمع ہوتے ہیں یا کسی امر میں جمع نہیں ہوتے؟ اور امام (جو سلطان ہے) کی بیعت کا علم، کیا اس کا حکم بیع جیسا ہے، پس جو بیچا گیا اور جو خریدا گیا وہ متعین ہو؟ اور کیا اس میں نفوس کا بیچنا شامل ہے، اور وہ موت پر بیعت کرنا ہے یا نہیں؟ اور تشبیہ کا علم۔ پس یہ وہ علوم ہیں جو اس منزل میں شامل ہیں، اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب سیصد و بیست و چهارم: در معرفت منزلگاهی که زنان و مردان را در برخی از مواطن الهی گرد هم می‌آورد، و این منزل از حضرت عاصمیه (الحضرة العاصمية) است.\n\nزنان همتایان مردان (الذکران) هستند، در عالم ارواح و ابدان.\nو حکم هستی (الوجود) بر هر دوی آن‌ها یکی است، و آن همان است که به انسان (الإنسان) تعبیر می‌شود.\nو از آن (حکم واحد) به واسطه‌ی امری عارضی جدا شدند، که به سبب آن، زنان از مردان جدا گشتند.\nاز مرتبه‌ی اجماع، در مورد هر دوی آن‌ها به حقیقت توحید (التوحيد) در اعیان حکم می‌شود.\nو اگر به آسمان و زمینش بنگری، میان آن دو تفاوت می‌گذاری، بی‌آنکه تفاوتی باشد.\nبه احسان به مثابه‌ی یک عین واحد بنگر، و ظهور آن به حکم از احسان است.\n\n[اینکه انسانیت (الإنسانية) جامع مرد و زن است و از این رو مردان از حیث انسانیت بر زنان برتری ندارند]\n\nبدان، خداوند تو را یاری کند، که چون انسانیت (الإنسانية) حقیقتی جامع برای مرد و زن است، مردان از حیث انسانیت بر زنان برتری (درجه) ندارند، همان‌طور که انسان با عالم کبیر در \"عالمیّت\" مشترک است، پس عالم از این جهت بر انسان برتری ندارد. در حالی که ثابت شده است که مردان بر زنان برتری دارند، و ثابت شده است که «خَلْقُ السَّماواتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ» (آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است) و بیشتر مردم این را نمی‌دانند، با وجود اشتراک در دلالت و نشانه بر وجود مرجّح (برتری‌دهنده). و خداوند فرمود: «أَأَنْتُمْ أَشَدُّ خَلْقاً أَمِ السَّماءُ بَناها» (آیا آفرینش شما دشوارتر است یا آسمانی که آن را بنا نهاد؟) و آنچه را که مختص آسمان است ذکر کرد، سپس زمین و گسترش آن و آنچه مختص آن است را ذکر نمود. همه‌ی این‌ها در مقام برتری دادن بر انسان است. پس ما دریافتیم که آن برتری (درجه) که آسمان و زمین به واسطه‌ی آن بر انسان برتری یافتند، دقیقاً همان برتری است که مرد به واسطه‌ی آن بر زن برتری یافته است. و آن این است که انسان منفعل (پذیرنده اثر) از آسمان و زمین است و میان آن دو متولد شده است. و منفعل، قدرت فاعل را ندارد، زیرا منفعل از اوست. به همین ترتیب، ما حوا را منفعل از آدم یافتیم، که از دنده‌ی کوتاه استخراج و تکوّن یافته است. پس به همین دلیل، از رسیدن به درجه‌ی کسی که از او منفعل شده، کوتاه آمد. بنابراین، او از مرتبه‌ی مرد نمی‌داند مگر به اندازه‌ی حدی که از آن خلق شده است، یعنی دنده. پس ادراک او از حقیقت مرد کوتاه آمد. همچنین، انسان از عالم نمی‌داند مگر به اندازه‌ی سهمی که در وجود خود از عالم گرفته است و نه بیشتر. پس انسان هرگز به درجه‌ی کل عالم نمی‌رسد، اگرچه خلاصه‌ای از آن است. به همین ترتیب، زن هرگز به درجه‌ی مرد نمی‌رسد، با وجود اینکه او عصاره‌ای از این خلاصه‌شده است. و زن به طبیعت (الطبيعة) شباهت یافت، از این جهت که محل انفعال (پذیرش اثر) در آن است. و مرد چنین نیست، زیرا مرد فقط آب را در رَحِم می‌اندازد. و رَحِم محل تکوین و خلق است. پس اعیان آن نوع در زن ظاهر می‌شود، به دلیل پذیرش تکوین و انتقال‌ها در اطوار خلقی، «خَلْقاً مِنْ بَعْدِ خَلْقٍ» (آفرینشی پس از آفرینش)، تا آنکه به صورت بشری کامل خارج شود. پس به همین اندازه، مردان از زنان متمایز می‌شوند. و به همین دلیل، زنان از نظر عقل نسبت به مردان ناقص‌ترند، زیرا تعقل نمی‌کنند مگر به اندازه‌ی سهمی که زن در اصل نشأت از خلقت مرد گرفته است. و اما نقصان دین در او، به این دلیل است که جزا به اندازه‌ی عمل است، و عمل جز از علم حاصل نمی‌شود، و علم به اندازه‌ی پذیرش عالم است، و پذیرش عالم به اندازه‌ی استعداد در اصل نشأت است. و استعداد زن از استعداد مرد ناقص‌تر است، زیرا او جزئی از مرد است. پس ناگزیر زن به نقصان دین نسبت به مرد متصف می‌شود. و این باب، صفتی را می‌طلبد که زنان و مردان در آن جمع می‌شوند، و آن در آنچه ذکر کردیم، یعنی قرار گرفتن هر دو در مقام انفعال (پذیرش اثر) است. این از جهت حقایق است. و اما از جهت آنچه بر آن‌ها عارض می‌شود، مانند این فرموده‌ی خداوند: «إِنَّ الْمُسْلِمِينَ وَالْمُسْلِماتِ وَالْمُؤْمِنِينَ وَالْمُؤْمِناتِ» (همانا مردان مسلمان و زنان مسلمان، و مردان مؤمن و زنان مؤمن...) تا آنجا که می‌فرماید: «وَالذَّاكِرِينَ اللَّهَ كَثِيراً وَالذَّاكِراتِ» (و مردانی که خدا را بسیار یاد می‌کنند و زنانی که یاد می‌کنند). و فرموده‌ی تعالی: «التَّائِبُونَ الْعابِدُونَ الْحامِدُونَ السَّائِحُونَ» (توبه‌کنندگان، عبادت‌کنندگان، سپاس‌گزاران، سیاحت‌کنندگان) و فرموده‌ی: «تائِباتٍ عابِداتٍ سائِحاتٍ» (زنان توبه‌کننده، عبادت‌کننده، سیاحت‌کننده). و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «كمل من الرجال كثيرون ومن النساء مريم بنت عمران وآسية امرأة فرعون» (از مردان بسیاری به کمال رسیدند و از زنان مریم دختر عمران و آسیه همسر فرعون). پس مردان و زنان در درجه‌ی کمال (الکمال) جمع شدند، و مرد به اکملیت (الأکملیة) برتری یافت، نه به کمالیت (الکمّالیة). اگر به نبوت به کمال رسیدند، مرد به رسالت و بعثت برتری یافت، و زن درجه‌ی بعثت و رسالت را نداشت. با وجود اینکه در یک مقام واحد مشترک، تفاضل (برتری) میان صاحبان آن واقع می‌شود، چنانکه تعالی فرمود: «تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ» (آن رسولان، برخی از آنان را بر برخی دیگر برتری دادیم) و فرمود: «وَلَقَدْ فَضَّلْنا بَعْضَ النَّبِيِّينَ عَلى‏ بَعْضٍ» (و به راستی برخی از پیامبران را بر برخی دیگر برتری دادیم). و خداوند مردان و زنان را در تکلیف شریک ساخت، پس زنان را مکلف کرد همان‌طور که مردان را مکلف کرد. و اگر زن به حکمی اختصاص یابد که برای مرد نیست، مرد نیز ممکن است به حکمی اختصاص یابد که برای زن نیست، اگرچه زنان همتایان مردان هستند.\n\n[اینکه منزلت زن نسبت به مرد در اصل ایجاد، منزلت رَحِم نسبت به رحمان (الرحمن) است]\n\nسپس بدان که منزلت زن نسبت به مرد در اصل ایجاد، منزلت رَحِم نسبت به رحمان (الرحمن) است، زیرا رَحِم شاخه‌ای (شجنة) از اوست و بر صورت او خارج شده است. و در برخی روایات آمده است که: «أن الله خلق آدم على صورة الرحمن» (خداوند آدم را بر صورت رحمان آفرید). و ثابت شده است که رَحِم در ما شاخه‌ای (شجنة) از رحمان (الرحمن) است. پس ما نسبت به رحمان (الرحمن) در منزلت حوا نسبت به آدم قرار گرفتیم. و رَحِم محل تناسل و ظهور اعیان فرزندان است. همچنین ما محل ظهور افعال هستیم. پس اگرچه فعل از آنِ خداست، اما جز بر دست ما ظاهر نمی‌شود و از نظر حسی جز به ما نسبت داده نمی‌شود. و اگر ما شاخه‌ای (شجنة) از رحمان (الرحمن) نبودیم، نسبت الهی صحیح نمی‌بود، یعنی اینکه ما بندگان او هستیم، و مولای قوم از خود آن‌هاست. پس نیاز ما به او، نیاز جزء به کل است. و اگر این مقدار از نسبت نبود، برای عزت الهی و غنای مطلق (الغني المطلق) جایز نبود که به ما توجه کند یا به ما بنگرد. پس به واسطه‌ی این نسبت، ما مَجلای او شدیم. پس ذات خود را جز در ما شهود (الشهود) نمی‌کند، به دلیل صورتی الهی که ما بر آن خلق شدیم. پس ما مالک همه‌ی اسماء الهی شدیم. هیچ اسم الهی نیست مگر اینکه ما در آن نصیبی داریم. و هیچ امری به واسطه‌ی ما برقرار نمی‌شود مگر اینکه حکم آن در اصل جاری است. پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در مورد این اسم در اعضای انسان فرمود: «إنه إذا أحس عضو منه بألم تداعي له سائر الجسم بالحمى» (اگر عضوی از آن احساس درد کند، سایر بدن با تب به آن پاسخ می‌دهد). پس اثر وجود آن درد در عضو خاص، تب را در سایر اعضا ایجاد می‌کند، و همه‌ی بدن به دلیل درد یک جزء، درد می‌کشد. پس گمانت درباره‌ی نفس ناطقه (النفس الناطقة) که سلطان «هذَا الْبَلَدِ الْأَمِينِ» (این شهر امن) است، چیست؟ در این موضع، حامل تب، نفس حیوانی (النفس الحیوانية) است، و آن برای نفس ناطقه (النفس الناطقة) به منزله‌ی پادشاهی است که بخشی از قلمرو او دچار اختلال شده، پس اندوه او شدیدتر است. آیا نمی‌بینی که حق سبحانه خود را به غضب و رحمت و قبول و اجابت و امثال آن وصف کرده است؟ و همه‌ی این‌ها را ناشی از اسبابی قرار داده که از ما سر می‌زند. پس اگر آشکارا نافرمانی کنیم، او را به غضب می‌آوریم، و اگر سخنی بگوییم که مورد رضایت اوست، او را راضی می‌کنیم، چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «ولا نقول إلا ما يرضى ربنا» (و نمی‌گوییم مگر آنچه پروردگارمان را راضی کند). و اگر توبه کنیم، قبول نزد او را برمی‌گزینیم. و اگر بدی‌های ما نبود، نه عقاب می‌کرد و نه عفو می‌نمود. و همه‌ی این‌ها چیزی است که نسبت را تصحیح می‌کند، و نسب را تثبیت می‌کند، و آثار سبب را تقویت می‌نماید. ما فرزندان علّات (برادران از یک مادر و پدران مختلف) هستیم. پس او سبب اول است، به دلیل نه به مشاهده. و چون آنچه ذکر کردیم مقرر شد، این نسبت را با این فرموده‌ی پیامبر تأیید کرد: «فمن وصلها وصله الله ومن قطعها قطعه الله» (پس هر کس آن را وصل کند، خداوند او را وصل کند، و هر کس آن را قطع کند، خداوند او را قطع کند). پس بنگر که این حکم چقدر شگفت‌انگیز است! او (خداوند) آن را از رحمان (الرحمن) قطع کرد و سعادت و وصله به خود را برای ما در وصل کردن آنچه او قطع کرده، قرار داد. پس صورت، صورت منازعه است، و در آن قرب الهی است تا حکم وصل برای ما باشد، و آن بازگرداندن غریب به اهلش است. و حکمت الهی در این امر، جز نفی تشبیه نیست، زیرا فرمود: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست). پس اگر ما آن را قطع کنیم، در قطع کردن به او شبیه شده‌ایم، زیرا او آن را شاخه‌ای (شجنة) از رحمان (الرحمن) قرار داد. پس هر کس آن را قطع کند، به او تشبه جسته است، در حالی که او به چیزی شبیه نیست و چیزی به او شبیه نیست، به حکم اصل. پس کسی را که آن را قطع کند، به قطع کردن او از رحمتش تهدید کرده است، نه از خودش. و به ما امر کرده است که آن را وصل کنیم، یعنی آن را به کسی که از او قطع شده است، بازگردانیم. زیرا فرمود: «وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ وَما رَبُّكَ بِغافِلٍ عَمَّا تَعْمَلُونَ» (و همه‌ی امور به سوی او بازگردانده می‌شود، پس او را بپرست و بر او توکل کن، و پروردگار تو از آنچه انجام می‌دهید غافل نیست). پس عمل را به تو نسبت داد و خود را نگهبان و شاهد بر آن قرار داد که غفلت نمی‌کند و فراموش نمی‌کند. این برای آن است که تو در اعمالی که مکلف شده‌ای، به او اقتدا کنی، پس غفلت نکنی و فراموش نکنی، زیرا تو به دلیل نیازت و بی‌نیازی او از تو، سزاوارتر به این صفت هستی. و چون حوا شاخه‌ای (شجنة) از آدم بود، خداوند میان آن دو «مَوَدَّةً وَرَحْمَةً» (دوستی و رحمت) قرار داد، تا هشدار دهد که میان رَحِم و رحمان (الرحمن) نیز دوستی و رحمت است. و به همین دلیل به تو امر کرد که آن را به کسی که از او قطع شده است، وصل کنی. پس قطع برای او باشد و وصل برای تو، تا تو در این امر بهره‌ای داشته باشی که به واسطه‌ی آن بر سایر عالم شرافت یابی. مودت (المودة) قرار داده شده میان زوجین، همان ثبات بر نکاح است که موجب توالد می‌شود. و رحمت (الرحمة) قرار داده شده، همان مهربانی است که هر یک از زوجین نسبت به دیگری می‌یابد، پس به او میل می‌کند و آرامش می‌یابد. پس از جهت زن، این میل جزء به کل، فرع به اصل، و غریب به وطن است. و میل مرد به همسرش، میل کل به جزء است، زیرا به واسطه‌ی او نام کل بر او صحیح می‌شود، و با زوال او این نام برایش ثابت نمی‌ماند. و میل اصل به فرع، به این دلیل است که فرع به او مدد می‌رساند. و اگر فرع نبود، ربوبیت امداد برای او ظاهر نمی‌شد. همان‌طور که اگر کَوْن (جهان) نبود، صحیح نبود که خداوند بر خود نام رب بگذارد، در حالی که او رب است. پس ناگزیر عالم باید باشد. و او همواره رب بوده است، پس اعیان ثابته همواره از ازل با چشم نیاز به او می‌نگریستند تا نام هستی (الوجود) را بر آن‌ها بپوشاند. و او همواره به آن‌ها می‌نگریست، به دلیل طلب آن‌ها با چشم رحمت. پس او سبحانه و تعالی همواره رب بوده است، چه در حال عدم ما و چه در حال وجود ما. و امکان (الإمکان) برای ما مانند وجوب (الوجوب) برای اوست.\n\nاگر در مبدأ ما اندیشه کنی، عقلت را محقق ساز، با نفیِ نفی و اثباتِ اثبات.\nاز شگفت‌ترین امور این است که من از ازل بوده‌ام، و با این حال، ذاتم حادث (محدث) است.\nپروردگار تو موجود بود و چیزی جز او با او نبود، نه گذشته‌ای و نه آینده‌ای.\n\nپس به واسطه‌ی مودت (المودة) و رحمت (الرحمة)، کل، جزء خود را طلبید و جزء، کل خود را. پس به هم پیوستند، و از آن پیوستگی، اعیان فرزندان ظاهر شد. پس نام پدری (الأبوة) برای آن‌ها صحیح شد. و وجود فرزندان، حکمی را به پدران داد که پیش از آن نداشتند، و آن ابوت (الأبوة) است. و رب (الرب) چنین نیست، زیرا او همواره از ازل رب بوده است. زیرا ممکن (الممکن) در امکان خود، همواره به صفت امکان موصوف بوده است، چه ممکن موجود شود و چه به عدم متصف گردد. زیرا نظر به او همواره در حال عدم او بوده است. و تقدم عدم برای ممکن بر وجودش، نعت ازلی است. پس همواره مربوب بوده است، اگرچه موجود نبوده است. این همان وجه تمایز میان آنچه برای خدا واجب است و آنچه برای بنده واجب است، از حیث اسمیت و مرتبه‌ای است که با وجود فرزند برای او حادث شده است. پس زنان در ابوت (الأبوة) به مردان ملحق شدند. بلکه زن در برخی مواطن، مقام دو مرد را دارد، زیرا حاکم جز با شهادت دو مرد حکم نمی‌کند. پس زن در برخی مواطن، مقام آن دو را گرفت، و آن پذیرش قول او توسط حاکم در مورد حیضِ عده، و پذیرش قول او توسط شوهر در مورد اینکه این فرزند اوست، با وجود احتمالاتی که در آن راه دارد، و پذیرش قول او مبنی بر اینکه حائض است. پس در اینجا، زن منزلت دو شاهد عادل را یافت، همان‌طور که مرد در شهادت دین، منزلت دو زن را یافت. پس در حکم با هم تداخل کردند.\n\nپس کثیر (بسیار) به جای قلیل (اندک) نشست، و قلیل به جای کثیر نشست.\nپس هر که خواهد، او را به خاک (ثرى) ملحق کند، و هر که خواهد، او را به اثیر (الأثير) ملحق کند.\n\nاگر کمال صورت نبود، خلافت (الخلافة) صحیح نمی‌شد. پس هر کس آن را طلب کند، به آن واگذار می‌شود، و هر کس بدون طلب به او برسد، بر آن یاری می‌شود. طالب، مدعیِ قیام به حق آن است. و کسی که خلافت به او طلبیده شود، از آن استعفا می‌دهد، زیرا امانتی است که بر «السَّماواتِ وَالْأَرْضِ» (آسمان‌ها و زمین) سنگین آمد. و هر مدعی مورد امتحان قرار می‌گیرد، این صفت در هر کس که باشد، استثنایی نیست. و امتحان او بر صورت آنچه ادعا می‌کند، است. «وَسَلامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا» (و سلام بر او روزی که زاده شد و روزی که می‌میرد و روزی که زنده برانگیخته می‌شود) شهادتی الهی و قطعی است. این منزلت کسی است که خلافت بدون طلب به او رسیده و عنایت بدون تکلف به او شده است. «وَالسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ أَمُوتُ وَيَوْمَ أُبْعَثُ حَيًّا» (و سلام بر من روزی که زاده شدم و روزی که می‌میرم و روزی که زنده برانگیخته می‌شوم) ادعایی در موضع امتحان است. اگر شفاعت حالت گهواره به دلیل عدم استحکام عقل نبود، حکم او حکم یحیی بود، و او (یحیی) اولی‌تر است. این در صورتی است که سخن گفتن او غیر معقول باشد (یعنی بدون تعقل سخن بگوید). و اگر آن را تعقل کرده باشد و عقلش مستحکم شده باشد و قوای او در نفس‌الامر و در مشهود عادت نزد حاضران قوی شده باشد، این خرق عادت است. و اگر به آنچه نطق کرده مأمور بوده، پس او از آنچه خدا به او داده و امر کرده که خبر دهد، خبر می‌دهد. پس نه مدعی است و نه طالب فخر، چنانکه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «أنا سيد ولد آدم ولا فخر» (من سرور فرزندان آدم هستم و فخری نیست). فخر (الفخر) که با راء است، به معنای مباهات به باطل است. پس این (سخنان پیامبر) معرفت از امری الهی است. چنین کسی نه امتحان می‌شود و نه آزموده می‌شود، زیرا مدعی نیست. و همه‌ی این‌ها احوالی است که زنان و مردان در آن مشترک هستند و در همه‌ی مراتب، حتی در قطبیت (القطبية)، شریک‌اند. و سخن رسول (صَلَّى اللهُ عَليهِ وسَلَّم) تو را محجوب نسازد که فرمود: «لن يفلح قوم ولوا أمرهم امرأة» (قومی که کار خود را به زنی بسپارند، رستگار نخواهند شد). ما در مورد تولیت (ولایت) خدا سخن می‌گوییم، نه در مورد تولیت مردم. و حدیث در مورد کسی است که مردم او را ولی قرار دهند. و اگر جز این سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در این مسئله نیامده بود که: «إن النساء شقائق الرجال» (زنان همتایان مردان هستند)، همین کافی بود. یعنی هر آنچه برای مرد از مقامات و مراتب و صفات صحیح است که به آن برسد، ممکن است برای هر زنی که خدا بخواهد، باشد، همان‌طور که برای هر مردی که خدا بخواهد، بوده است. آیا به حکمت خداوند تعالی نمی‌نگری در آنچه برای زن بر مرد افزوده است؟ در مورد مرد، «المرء» (مرد) گفت، و در مورد زن، «المرأة» (زن) گفت. پس در وقف، یک هاء و در وصل، یک تاء بر اسم مرد افزوده است. پس زن در این مقام بر مرد برتری (درجه) دارد که برای مرد در مقابل این فرموده‌ی خداوند نیست: «وَلِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ» (و مردان بر آنان برتری دارند). پس آن شکاف را با این افزایش در زن پر کرد. و همچنین الفِ «حبلى» (باردار) و همزه‌ی «حمراء» (سرخ). و اگر تعلیل حق را در قرار دادن دو زن در شهادت به جای یک مرد، به نسیان (فراموشی) در این فرموده‌ی او ذکر کنی: «أَنْ تَضِلَّ إِحْداهُما فَتُذَكِّرَ إِحْداهُمَا الْأُخْرى‏» (تا اگر یکی از آن دو گمراه شد، دیگری او را یادآوری کند). و یادآوری (تذکر) جز پس از نسیان (فراموشی) نیست. خداوند تعالی خبر داده است که آدم فراموش کرد و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «فنسي آدم فنسيت ذريته» (آدم فراموش کرد، پس ذریه‌اش فراموش کردند). پس نسیان بنی آدم، ذریه‌ی نسیان آدم است، همان‌طور که ما ذریه‌ی او هستیم. و این وصفی الهی است که در عالم صادر شده است. تعالی فرمود: «نَسُوا اللَّهَ فَنَسِيَهُمْ» (خدا را فراموش کردند، پس او نیز آن‌ها را فراموش کرد). با این حال، حق تعالی یکی از دو زن را جز به حیرت (الحيرة) در آنچه شهادت داده، وصف نکرده است، نه به نسیان. و حیرت نصف نسیان است، نه همه‌ی آن. و نسیان کامل را به مرد نسبت داد و فرمود: «فَنَسِيَ وَلَمْ نَجِدْ لَهُ عَزْماً» (پس فراموش کرد و برای او عزمی نیافتیم). پس ممکن است مرد شهادت را به کلی فراموش کند و آن را به یاد نیاورد، اما ممکن نیست یکی از دو زن که یادآوری‌کننده است (نه به تعیین)، فراموش کند، بلکه او زنی را که از آنچه شهادت داده گمراه شده، یادآوری می‌کند. زیرا خبر خدا بدون شک راست است. و او در این آیه خبر داده است که یکی از آن دو، دیگری را یادآوری می‌کند. پس ناگزیر باید یکی از آن‌ها از شهادت گمراه نشود و فراموش نکند. پس زن واحد در شهادت، به واسطه‌ی خبر حق از او، به صفتی الهی متصف شده است، و آن سخن موسی است که در قرآن از او حکایت شده است: «لا يَضِلُّ رَبِّي وَلا يَنْسى‏» (پروردگار من نه گمراه می‌شود و نه فراموش می‌کند). و اگر در شرف تأنیث (مؤنث بودن) جز اطلاق ذات (الذات) بر خدا و اطلاق صفت (الصفة) نبود، که هر دو لفظ تأنیث هستند، قلب زن را که مردان بی‌علم به این امر می‌شکنند، جبران می‌کرد. و شارع ما را از تفکر در ذات خدا نهی کرده است، اما ما را از سخن گفتن در توحید (التوحيد) خدا منع نکرده، بلکه به آن امر کرده است و فرموده: «فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ» (پس بدان که هیچ معبودی جز الله نیست و برای گناهت استغفار کن). و گناه در اینجا، همان چیزی است که برای کسی که در توحید خدا می‌نگرد، خطور می‌کند، یعنی طلب ماهیت و حقیقت او، که همان معرفت ذات اوست که شناخته نمی‌شود و تفکر در آن به دلیل عظمت قدرش و عدم تناسب میان آن و آنچه توهم می‌شود که دلیل بر آن باشد، ممنوع شده است. پس نه وهمی آن را تصور می‌کند و نه عقلی آن را مقید می‌سازد، بلکه جلال و تعظیم از آن اوست. بلکه جایز نیست که ذات با «ما» (چیست) طلب شود، چنانکه فرعون طلب کرد و در سؤال اشتباه نمود. به همین دلیل، موسی (علیه السلام) از پاسخ به سؤال او عدول کرد، زیرا اگر سؤال اشتباه باشد، پاسخ دادن به آن لازم نیست. و چون آن مجلس، مجلس عمومی بود، موسی به آنچه گفت، سخن گفت. و فرعون گمان کرد که او به اندازه‌ی سؤالش پاسخ نداده است، زیرا تصور می‌کرد که سؤالش صحیح است. و نمی‌دانست که ذات حق تعالی تحت طلب «ما» (چیست) قرار نمی‌گیرد، بلکه تحت طلب «هل» (آیا هست) قرار می‌گیرد. و «هل» سؤالی است درباره‌ی وجود مسئول‌عنه، که آیا محقق است یا خیر. فرعون که به جهل خود پی برد، برای مشغول کردن حاضران تا متوجه نشوند، گفت: «إِنَّ رَسُولَكُمُ الَّذِي أُرْسِلَ إِلَيْكُمْ لَمَجْنُونٌ» (همانا پیامبر شما که به سوی شما فرستاده شده، دیوانه است). اگر حق، فرعون را آگاه نکرده بود، او در این سخن اثبات نمی‌کرد که فرستنده‌ای او را فرستاده است و او از جانب خود نیامده است، زیرا به سوی دیگری دعوت می‌کرد. و همچنین فرعون او را به آنچه موسی بر آن بود، نسبت داد و او را به دیوانگی (مجنون) وصف کرد، یعنی از شما پوشیده است و او را نمی‌شناسید. پس موسی او را با پاسخ خود شناساند. و حاضران او را نشناختند، چنانکه علمای ساحران او را شناختند، و جاهلان به سحر او را نشناختند. و آن خمیرمایه نزد فرعون باقی ماند و خمیر سرشت او با آن ور آمد، و حکم آن ظاهر نشد و خمیرش ور نیامد مگر در زمانی که گفت: «آمَنْتُ بِالَّذِي آمَنَتْ بِهِ بَنُوا إِسْرائِيلَ» (ایمان آوردم به کسی که بنی اسرائیل به او ایمان آوردند). و نام خدا را نبرد تا ابهام و شک را برطرف کند، زیرا حاضران می‌دانستند که بنی اسرائیل جز به خدایی که موسی و هارون از نزد او آمده‌اند، ایمان نیاورده‌اند. اگر می‌گفت: «ایمان آوردم به خدا»، در حالی که او قبلاً مقرر کرده بود که برای قومش خدایی جز خود نمی‌شناسد، می‌گفتند: برای خودش شهادت داد، نه برای کسی که موسی را به سوی ما فرستاد. پس این ابهام را با آنچه گفت، برطرف کرد. اما تحقیق این مسئله را جز کسی که مرتبه‌ی طبیعت (الطبيعة) را از امر الهی (الأمر الإلهي) بشناسد، نمی‌داند. زیرا زن نسبت به مرد، به منزله‌ی طبیعت (الطبيعة) نسبت به امر الهی (الأمر الإلهي) است. زیرا زن محل وجود اعیان فرزندان است، همان‌طور که طبیعت برای امر الهی، محل ظهور اعیان اجسام است که در آن تکوین یافته و از آن ظاهر شده‌اند. پس امر بدون طبیعت نمی‌شود و طبیعت بدون امر نمی‌شود. پس کَوْن (جهان) متوقف بر این دو امر است. و مگو که خداوند قادر است چیزی را بدون اینکه امر دیگری منفعل شود، ایجاد کند. زیرا خداوند با این فرموده‌ی خود به تو پاسخ می‌دهد: «إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ» (همانا سخن ما برای چیزی، هنگامی که اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود). پس آن «شیئیت» (الشیئية) عام که برای هر شیء خاصی است و اشتراک در آن واقع شده، همان است که ما اثبات کردیم. و امر الهی بر آن متوجه می‌شود تا شیء خاصی در آن شیئیت مطلق ظاهر شود. پس هنگامی که اجسام یا اجساد ظاهر شدند، صور و اشکال و اعراض و همه‌ی قوای روحانی و حسی ظاهر شدند. و شاید گفته شود که آن همان چیزی است که در زبان شرع، علما از آن تعبیر می‌کنند که برای حق پیش از خلق خلق بود، نه زیر آن هوا بود و نه بالای آن هوا. پس آن را ذکر کرد و به نام موجودی نامید که صور و اشکال را می‌پذیرد. و ما مرتبه‌ی طبیعت (الطبيعة) را ذکر کردیم، و آن همین شیئیت مطلق (الشیئية المطلقة) است. در کتاب «النکاح الأول» (ازدواج اول) که عالم، زیر و بالای آن، و هر آنچه غیر خداست، از کثیف و لطیف و معقول و محسوس، متصف به هستی (الوجود) است، از آن ظاهر شد. پس ما از آن‌ها نمی‌دانیم مگر به اندازه‌ی آنچه برای ما ظاهر می‌شود، همان‌طور که از اسماء الهی نمی‌دانیم مگر به اندازه‌ی آنچه به ما رسیده است. پس هر کس مرتبه‌ی طبیعت (الطبيعة) را شناخت، مرتبه‌ی زن را شناخت. و هر کس امر الهی (الأمر الإلهي) را شناخت، مرتبه‌ی مرد را شناخت. و وجود موجودات غیر خدا، متوقف بر این دو حقیقت است. با این تفاوت که این حقیقت (طبیعت) چنان پنهان و دقیق است که فرزندانش از عقول، آن را نمی‌شناسند. پس آن را در عالم بسیط اثبات نمی‌کنند و در عالم مرکب اثبات می‌کنند. و این به دلیل جهل آن‌ها به مرتبه‌ی آن است، همان‌طور که در اینجا مرتبه‌ی زن را نشناختند، با وجود اینکه شارع بر منزلت او تنبیه کرده است، با این فرموده‌ی او (صَلَّى اللهُ عَليهِ وسَلَّم): «إن النساء شقائق الرجال» (زنان همتایان مردان هستند). پس امر میان آن دو، علو (بالا) و سفل (پایین) است. آیا نمی‌بینی که تجلیات (التجلیات) و روحانیات متجسد، آیا جز در صور طبیعی ظاهر می‌شوند؟ اگرچه آن اجساد سریع‌الاستحاله باشند، اما از آن خارج نشده‌اند. و این منزلگاهی وسیع است که مجال در آن گسترده می‌شود. پس به ذکر رئوس مسائلی که در بر می‌گیرد، بدون تفصیل، می‌پردازیم. از جمله: از کدام مقام مؤمن ندا داده می‌شود و آیا ندا با اختلاف نداکننده متفاوت است یا خیر. و در این منزل همچنین علم سبب دشمنی میان خدا و خلقش، و آیا شرط دشمنی این است که از دو طرف وجود داشته باشد یا از یک طرف. و آیا کسی به خاطر دیگری دشمنی می‌کند یا دشمنی جز به خاطر خودش نیست. و علم القای محبت در قلب‌ها و ثبات آن، و آیا القای آن انتقال وجودی است یا خلقی است که در محل خلق می‌شود. و آیا شرط حب، مناسبت است یا خیر. و علم غریب شدن از اوطان به موجب نقیض. و علم مشقات راه‌های الهی. و علم طلب رضایت در خوشی و ناخوشی. و علم سر و علن. و علم حیرت از طریق خاص. و علم محبت ستر بر تجلی (التجلی). و علم ثبات سببی که موجب قطع آنچه به وصلش امر شده، می‌شود، به طوری که قطع آن قربت و وصل آن بُعد باشد. و علم مواطن و چگونه امور به حکم و تأثیرشان در امور کونی و احکام الهی بازگردانده می‌شوند، و آن علمی وسیع است. و علم رؤیت اعمال با وجود اینکه اعراض کونی هستند، و اعراض کونی احکامشان دیده می‌شود نه اعیانشان، برخلاف اعراض لونی که اعیان و احکامشان دیده می‌شود. و علم اقتدا به پیشینیان و تبعیت فاضل از مفضول. و علم تبری از جمع، نه از احدیت جمع. و علم ستر احدیت جمع و کثرت. و علم حب مشروط و بغض مشروط، و آیا این در نفس‌الامر صحیح است یا خیر. و آیا استثنا در آن صحیح است یا خیر. و آیا رجوع بنده در توکل و احوالش به اسم خاصی، به جای سایر اسماء الهی، در علم الهی قدح می‌کند یا خیر. و علم صیرورت (الصيرورة) از علم رد و رجوع، و فرق میان هر یک از آن‌ها با دیگری. و علم اختیار در آنچه ستوده و نکوهیده می‌شود. و علم تضمن عزت (العزة) حکمت را. و علم رجاء مشترک. و علم آنچه از تولّی از حق مطلق و مقید نتیجه می‌شود. و آیا کسی که از او روی می‌گرداند، هنگام روی گرداندن متأثر می‌شود یا خیر. و علم مقارب بودن به شیء، و آیا حق (الحق) به آن متصف می‌شود یا خیر. و علم اینکه رحمت (الرحمة) ممکن است با ستر و بدون ستر باشد. و علم سبب اکرام کریم و مجازات لئیم، آیا به دلیل لئامت است، پس مشترک می‌شوند، اگرچه یکی جزا باشد، یا او را جز به احسان جزا نمی‌دهد. و آیا لئامت جزا، در نفس‌الامر لئامت است یا صفتی از لئیم است که به او باز می‌گردد، زیرا آن را در غیر خود دیده و از آن کراهت داشته است، پس دانسته که آن صفت اوست و در مجازات‌کننده امری عرضی است که برای تعلیم آن را ظاهر کرده است، و آن علمی شریف و نافع است که از آن عقوبت خدا بر بندگانش به خاطر اعمالشان، با وجود بی‌نیازی او و عدم ضرر دیدن از آن، شناخته می‌شود. و آیا خلق می‌توانند در جزای به لئامت، در این حد هنگام مجازات لئیم باشند یا خیر. و علم آنچه با صاحبان دعاوی معامله می‌شود. و علم حکم کردن به علم، و اینکه ظن (الظن) شرعاً ممکن است علم نامیده شود. و چرا ظن، علم نامیده می‌شود در حالی که ضد آن است. و آیا علم در اینجا عبارت از علامتی است که ظن در نفس ظن‌کننده حکم‌کننده به آن حاصل می‌شود، پس علم او به آن علامت، علمی است که باید به آن حکم شود، زیرا علم جز عین علامت نیست. و به همین دلیل فرمود: «ذلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ» (این نهایت دانش آن‌هاست) و آن علم نبود. پس گویی فرمود: این همان چیزی است که علامت در آن امر به آن‌ها داده است. و علم حلال و حرام عقلی و شرعی. و علم معاوضه در ابضاع (الأبضاع)، و آن علم شگفت‌انگیزی است، زیرا خریدار در آن جز استمتاع (لذت بردن) تعلق دیگری ندارد. پس گویی خریدار استمتاع است. و علم عدل در حکم الهی و نیابت در آن. و علم فرق میان علم و حکمت. و علم اتخاذ خدا وقایه (سپر) از چه چیزی، و آیا آن از مرتبه‌ی علم است یا مرتبه‌ی ایمان. و علم احکام تابع و متبوع، آیا در امری با هم جمع می‌شوند یا در امری جمع نمی‌شوند. و علم مبایعه (الْمُبايَعَة) با امام که سلطان است، آیا حکم آن حکم بیع است، پس آنچه فروخته و خریده شده، معین می‌شود. و آیا بیع نفوس که همان مبایعه بر مرگ است، در آن داخل می‌شود یا خیر. و علم تشبیه (التشبيه). این‌ها مسائلی است که این منزل در بر می‌گیرد. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 5
}