{
  "id": 99,
  "title": {
    "ar": "الباب التاسع والتسعون في مقام النوم",
    "en": "Chapter Ninety-Nine: Concerning the Station of Sleep",
    "ur": "۹۹واں باب: مقامِ نیند (النوم) کے بیان میں",
    "fa": "باب نود و نهم در مقام خواب (النوم)"
  },
  "content": {
    "ar": "## (الباب التاسع والتسعون في مقام النوم)\n\n\n> النوم جامع أمر ليس يجمعه *** غير المنام ففكر فيه واعتبر\n\n\n> أن الخيال له حكم وسلطنة *** على الوجودين من معنى ومن صور\n\n\n> وليس يدرك في غير المنام ولا *** تبدو له صور في حضرة السور\n\n\n> يختص بالصاد لا بالسين حضرته *** فهو المحيط بما في الغيب من صور\n\n\n> من لا يكيف يأبى النوم يحصره *** بالكيف والكم للتحديد بالعبر\n\n\n### [النوم حالة انتقال من مشاهدة عالم الحس إلى شهود عالم البرزخ‏]\n\n\nاعلم أيدك الله أن النوم حالة تنقل العبد من مشاهدة عالم الحس إلى شهود عالم البرزخ وهو أكمل العالم فلا أكمل منه هو أصل مصدر العالم له الوجود الحقيقي والتحكم في الأمور كلها يجسد المعاني ويرد ما ليس قائما بنفسه قائما بنفسه وما لا صورة له يجعل له صورة ويرد المحال ممكنا ويتصرف في الأمور كيف يشاء\n\n\n### [قدرة الخيال على المحال والخيال من خلق الله‏]\n\n\nفإذا كان له هذا الإطلاق وهو خلق مخلوق لله فما ظنك بالخالق سبحانه الذي خلقه وأعطاه هذه القوة فكيف تريد أن تحكم على الله بالتقيد وتقول إن الله غير قادر على المحال وأنت تشهد من نفسك قدرة الخيال على المحال والخيال خلق من خلق الله ولا تشك فيما تراه من المعاني التي جسدها لك وأراها إياك أشخاصا قائمة فكذلك يأتي الله بأعمال بنى آدم مع كونها أعراضا صورا قائمة توضع في الموازين لإقامة القسط ويؤتى بالموت مع كونه نسبة فوق العرض في البعد عن التجسد في صورة كبش أملح يريد أنه في غاية الوضوح لهذا وصفه بالملحة وهي البياض فيعرفه جميع الناس فهذا محال مقدور\n\n\n### [حدود حكم العقل وفساد تأويله على الله فيما هو فوق مستواه‏]\n\n\nفأين حكم العقل على الله وفساد تأويله وكذلك نعيم الجنان في فواكهه لا مَقْطُوعَةٍ ولا مَمْنُوعَةٍ فيتأوله من لا علم له بحمله على فصول السنة إن الفاكهة تنقضي بانقضاء زمانها ثم تعود في السنة الأخرى وفاكهة الجنة دائمة التكوين لا تنقطع هذا مبلغ علمهم في هذه المسألة وهي عندنا كما قال الله لا مَقْطُوعَةٍ ولا مَمْنُوعَةٍ فإن الله جاعل لنا فيها رزقا يسمى قطفا وتناولا كما جعل الله لعالم الجن في العظام رزقا وما نرى ينقص من العظم شي‏ء ونحن بلا شك نأكل من فاكهة الجنة قطفا دانيا مع كون الثمرة في موضعها من الشجرة ما زال عينها لأنها دار بقاء لما يتكون فيها فهي دار تكوين لا دار إعدام وكذلك سوق الجنة ندخل في أي صورة شئنا من صور السوق مع كوننا على صورتنا لا ينكرنا أحد من أهلنا ولا من معارفنا ونحن نعلم أن قد لبسنا صورة جديدة تكوينية مع بقائنا على صورتنا فأين العقول والمعقول هنا\n\n\n> لا يعرف الله إلا الله فاعتبروا *** ما عقل عين كعقل قلد الفكرا\n\n\n### [تنزيه الله عن النوم ونتائج ذلك على مستوى العلم الإلهي والكمال الروحي‏]\n\n\nولما نزه الله نفسه عن صفة النوم فقال لا تَأْخُذُهُ سِنَةٌ ولا نَوْمٌ أي ما يغيبه شهود البرازخ عن شهود عالم الحس عن شهود المعاني الخارجة عن المواد في حال عدم حصولها في البرزخ وتحت حكمه وقد يمنح الله بعض عباده بهذا الإدراك مع كونه لا يتصف بأنه لا ينام أعني في حالة الدنيا ونشأتها وأما في الآخرة فإنه لا ينام أهل الجنة في الجنة ولا يغيب عنهم شي‏ء من العالم بل كل عالم على مرتبته مشهود لهم مع كونهم غير متصفين بالنوم يقال نام فلان فرأى كذا أي رأى مقلوبة وهو مان أي كذب في عرف العادة فإن العلم ما هو لبن والقرآن ما هو عسل ولكن هكذا تراه فإذا كملت رأيته علما في حضرة المعاني في حال رؤيتك إياه لبنا في حضرة البرزخ وهو هو لا غيره‏\n\n\n### [المعرفة المطلوبة منا بالإله وقبول ما جاء به الشرع مما ترده العقول‏]\n\n\nفتحقق ما أعلمناك به فقد أرحناك بما ذكرناه راحة الأبد وقد عرفناك بالإله المعرفة المطلوبة منا وإذا تحققت ما أومأنا إليه في هذا الباب علمت جميع ما جاء به الشرع في الكتاب والسنة قديما وحديثا من النعوت الإلهية التي تردها العقول ببراهينها القاصرة عن هذا الإدراك فمعرفة وجود الحق مدرك العقول من حيث ما هي مفكرة وصاحبة دلالات ومعرفة ما هو الحق عليه في نفسه هو ما أعطاه الوجود لكل إدراك في عالمه فما ثم إلا حق ومصيب فسبحان من طور الأطوار وجعل في اليوم حقيقة الليل والنهار وأنزل الأحكام وشرعها على التفصيل لا على الإجمال والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n### [النوم من أحكام الطبيعة في مولدات العناصر]\nمن أحكام الطبيعة في مولدات العناصر خاصة والنشأة الآخرة ليست من مولدات العناصر بل هي من مولدات الطبيعة فلذلك لا تنام ولا تقبل النوم كالملائكة وما علا عن العناصر ونشأة الإنسان في الآخرة على غير مثال كما كانت نشأته في الدنيا على غير مثال فما ظهر قبله من هو على صورته ولهذا جاء كَما بَدَأَكُمْ يعني على غير مثال تَعُودُونَ على غير مثال يعني في نشأة الآخرة وقال ولَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولى‏ فَلَوْ لا تَذَكَّرُونَ أنها كانت على غير مثال سبق فاشحذ فؤادك ووفر زادك فإنك راحل عن نشأة أنت فيها وما أنت فيها\n\n",
    "en": "## (Chapter Ninety-Nine: Concerning the Station of Sleep)\n\nSleep gathers a matter that nothing else gathers, save the sleeping state; so reflect upon it and take heed.\nFor the Imagination (الخيال) holds sway and sovereignty over the two modes of Being (الوجودين): that of meaning and that of forms.\nIt is not perceived except in the sleeping state, nor do its forms appear in the Presence of Forms (حضرة السور).\nIts Presence (حضرة) is specific to the letter *Ṣād* (ص), not the *Sīn* (س); thus, it encompasses the forms contained within the Unseen (الغيب).\nHe who does not qualify [The Real] refuses that sleep should confine Him by qualification (*kayf*) and quantity (*kamm*), limiting Him by examples.\n\n### [Sleep is a state of transition from witnessing the sensory world to witnessing the world of the Isthmus]\n\nKnow, may Allah strengthen you, that sleep is a state that transfers the servant from witnessing the sensory world (عالم الحس) to witnessing the world of the Isthmus (عالم البرزخ). This is the most perfect of worlds, and there is none more perfect than it. It is the original source of the cosmos (العالم). It possesses true Being (الوجود الحقيقي) and control over all matters. It embodies meanings, makes that which is not self-subsistent (قائما بنفسه) self-subsistent, gives form to that which has no form, renders the impossible (المحال) possible, and disposes of matters as it wills.\n\n### [The power of Imagination over the impossible, and Imagination is a creation of Allah]\n\nIf [the Isthmus/Imagination] possesses this absolute freedom, and yet it is a creation created by Allah, what then do you suppose of the Creator, glory be to Him, Who created it and granted it this power? How can you seek to judge Allah by limitation and say that Allah is incapable of the impossible (المحال), when you witness within yourself the power of the Imagination (الخيال) over the impossible? The Imagination is a creation among the creations of Allah, and you do not doubt the meanings that it embodies for you and shows you as subsistent entities (أشخاصا قائمة). Likewise, Allah will bring the deeds of the children of Adam—even though they are accidents (*a'rāḍ*)—as subsistent forms (صورا قائمة) to be placed in the Scales (الموازين) for the establishment of justice (القسط). And Death (الموت), despite being a relation far removed from embodiment (التجسد)—even beyond the category of accident—will be brought forth in the form of a speckled ram (كبش أملح). This means that it is in the utmost clarity, which is why He described it with *al-mulḥah* (speckledness), which is whiteness, so that all people may recognize it. This is an impossible thing made possible (محال مقدور).\n\n### [The limits of the Intellect's judgment and the corruption of its interpretation concerning Allah regarding what is above its level]\n\nWhere, then, is the judgment of the Intellect (العقل) upon Allah and the corruption of its interpretation? Likewise, the bliss of the Gardens (الجنان) in its fruits: <<لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ>> (neither cut off nor forbidden). Those who lack Knowledge (العلم) interpret this by relating it to the seasons, arguing that fruit ceases when its time ends and returns the following year, whereas the fruit of Paradise is of perpetual origination (دائمة التكوين) and does not cease. This is the extent of their knowledge regarding this matter. But for us, it is as Allah said: <<لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ>> (neither cut off nor forbidden). For Allah makes for us therein a provision called 'plucking' and 'consumption,' just as Allah made provision for the world of the Jinn in bones, yet we do not see the bone diminish at all. We undoubtedly eat the fruit of Paradise by plucking it close at hand, even though the fruit remains in its place on the tree, its essence (عينها) undiminished, because Paradise is the abode of Subsistence (دار بقاء) for what originates within it; it is an abode of origination (دار تكوين), not an abode of annihilation (دار إعدام). Similarly, in the market of Paradise, we enter in whatever form we wish from the forms of the market, while remaining in our own form, and none of our family or acquaintances deny us. Yet we know that we have assumed a new originated form (صورة جديدة تكوينية) while remaining in our original form. Where, then, are the intellects (العقول) and the rationally conceivable (المعقول) here?\n\nNone knows Allah save Allah, so take heed! The Intellect (عقل) that imitates thought is not the Intellect of the Essence (عقل عين).\n\n### [The transcendence of Allah above sleep and the results of that on the level of Divine Knowledge and spiritual perfection]\n\nWhen Allah declared Himself transcendent above the attribute of sleep, saying: <<لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ>> (Slumber overtakes Him not, nor sleep), this means that the witnessing of the Barzakhs (شهود البرازخ) does not veil Him from the witnessing of the sensory world (عالم الحس), nor from the witnessing of meanings (المعاني) external to materials, even when they have not yet come into existence in the Barzakh (البرزخ) and under its rule. Allah may grant some of His servants this comprehensive perception, even though they are not described as being sleepless—I mean, in the state and origination (نشأتها) of this world. As for the Hereafter, the people of the Garden (أهل الجنة) do not sleep in the Garden, and nothing of the cosmos (العالم) is veiled from them. Rather, every world, at its own level (مرتبته), is witnessed by them, even though they are not characterized by sleep. It is said, \"So-and-so slept and saw such-and-such,\" meaning he saw its inversion, and he is a liar (*mān*) according to common usage. For Knowledge (العلم) is not milk, and the Quran is not honey, yet this is how you see it [in a dream]. But when you become perfected, you see it as Knowledge (علما) in the Presence of Meanings (حضرة المعاني) while simultaneously seeing it as milk in the Presence of the Barzakh (حضرة البرزخ), and it is truly that, nothing else.\n\n### [The Gnosis required of us concerning the Deity and the acceptance of what the Law brings that the intellects reject]\n\nTherefore, realize what we have informed you of, for we have given you eternal rest through what we have mentioned. We have made known to you the Deity (الإله) with the Gnosis (المعرفة) required of us. If you realize what we have alluded to in this chapter, you will know all that the Law (الشرع) brought, both ancient and modern, in the Book and the Sunnah, concerning the Divine Attributes (النعوت الإلهية) that the intellects (العقول) reject due to their proofs being deficient in attaining this perception. The knowledge of the Being of The Real (وجود الحق) is what the intellects perceive insofar as they are thinking and possess indications. But the knowledge of what The Real (الحق) is in Himself is what Being (الوجود) has granted to every perception in its own world. Thus, there is nothing there except The Real (حق) and the correct. Glory be to Him Who developed the stages (طور الأطوار) and placed within the day the reality of night and day, and sent down the rulings and legislated them in detail, not in summary. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\n### [Sleep is among the rulings of Nature in the originations of the elements]\n\n[Sleep] is specifically among the rulings of Nature (الطبيعة) in the originations of the elements (مولدات العناصر). The origination of the Hereafter (النشأة الآخرة) is not from the originations of the elements, but rather from the originations of Nature (الطبيعة). Therefore, it does not sleep and does not accept sleep, just like the angels and whatever transcends the elements. The origination of the human being in the Hereafter is without precedent (على غير مثال), just as his origination in this world was without precedent, for none appeared before him who was upon his form. For this reason, it came: <<كَمَا بَدَأَكُمْ>> (As He originated you)—meaning without precedent—<<تَعُودُونَ>> (you will return)—meaning without precedent—in the origination of the Hereafter. And He said: <<وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى فَلَوْلَا تَذَكَّرُونَ>> (And you have certainly known the first origination, so why will you not remember) that it was without any prior precedent? So sharpen your heart (فؤادك) and increase your provision, for you are departing from an origination in which you are, and yet you are not in it.",
    "ur": "## (باب ننانوے: مقامِ نیند کے بیان میں)\n\nنیند ایک ایسا امر جامع ہے جسے خواب کے سوا کوئی اور جمع نہیں کرتا، پس اس میں غور کر اور عبرت حاصل کر۔\n\nبے شک خیال (الخيال) کو معنی اور صورتوں کی دونوں ہستیوں (الوجودين) پر حکم اور سلطنت حاصل ہے۔\n\nاور وہ (خیال) نیند کے علاوہ ادراک نہیں کیا جاتا، اور نہ ہی اس کی صورتیں صورتوں کی حضوری میں ظاہر ہوتی ہیں۔\n\nاس کی حضوری صاد (ص) کے ساتھ خاص ہے نہ کہ سین (س) کے ساتھ، پس وہ ان صورتوں پر محیط ہے جو غیب میں ہیں۔\n\nجو ذات کیفیت (کیف) سے پاک ہے، وہ نیند کو قبول نہیں کرتی کہ اسے کیفیت اور کمیت کے ذریعے عبرتوں سے محدود کیا جائے۔\n\n### [نیند عالم محسوسات (عالم الحس) کے مشاہدے سے عالم برزخ (عالم البرزخ) کے شہود (الشہود) کی طرف منتقلی کی حالت ہے]\n\nجان لو، اللہ تمہاری تائید کرے، کہ نیند ایک ایسی حالت ہے جو بندے کو عالم محسوسات (عالم الحس) کے مشاہدے سے عالم برزخ (عالم البرزخ) کے شہود (الشہود) کی طرف منتقل کرتی ہے۔ اور یہ سب سے کامل عالم ہے، اس سے زیادہ کامل کوئی نہیں۔ یہ عالم کا اصل مصدر ہے، اسے حقیقی ہستی (الوجود الحقيقي) حاصل ہے اور تمام امور پر اس کا مکمل تصرف ہے۔ یہ معانی کو مجسم کرتا ہے اور جو چیز بذات خود قائم نہیں ہے اسے بذات خود قائم کر دیتا ہے، اور جس کی کوئی صورت نہیں ہے اس کے لیے صورت بنا دیتا ہے، اور محال (المحال) کو ممکن بنا دیتا ہے، اور امور میں جیسے چاہتا ہے تصرف کرتا ہے۔\n\n### [محال پر خیال (الخيال) کی قدرت اور یہ کہ خیال اللہ کی مخلوق میں سے ہے]\n\nپس جب اسے یہ مطلق اختیار حاصل ہے، حالانکہ یہ اللہ کی مخلوق ہے، تو تم اس خالق سبحانہ کے بارے میں کیا گمان کرتے ہو جس نے اسے پیدا کیا اور یہ قوت عطا کی؟ تم کس طرح اللہ پر پابندی کا حکم لگانا چاہتے ہو اور کہتے ہو کہ اللہ محال (المحال) پر قادر نہیں ہے، جبکہ تم خود اپنے اندر محال پر خیال (الخيال) کی قدرت کا مشاہدہ کرتے ہو، اور خیال اللہ کی مخلوق میں سے ہے۔ اور تم ان معانی کے بارے میں شک نہیں کرتے جنہیں اس نے تمہارے لیے مجسم کیا اور تمہیں قائم اشخاص کی صورت میں دکھایا۔ اسی طرح اللہ تعالیٰ بنی آدم کے اعمال کو، باوجود ان کے اعراض ہونے کے، قائم صورتوں میں لائے گا جنہیں میزانوں میں عدل قائم کرنے کے لیے رکھا جائے گا۔ اور موت کو، باوجود اس کے کہ وہ تجسیم (التجسد) سے دوری میں عرض سے بھی زیادہ بعید ایک نسبت ہے، ایک سفید و سیاہ مینڈھے کی صورت میں لایا جائے گا۔ اس سے مراد یہ ہے کہ وہ انتہائی واضح ہو گا، اسی لیے اسے \"املح\" (سفیدی مائل) سے موصوف کیا گیا، یعنی سفیدی، تاکہ تمام لوگ اسے پہچان لیں۔ پس یہ ایک محال ہے جو مقدور ہے۔\n\n### [عقل کے حکم کی حدود اور ان امور میں اللہ پر اس کی تاویل کا فساد جو اس کے معیار سے بالاتر ہیں]\n\nتو اللہ پر عقل کا حکم اور اس کی تاویل کا فساد کہاں؟ اسی طرح جنت کی نعمتیں، اس کے پھل ہیں: لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ (نہ ختم ہونے والے اور نہ روکے جانے والے)۔ پس وہ شخص جسے علم نہیں ہے، وہ اس کی تاویل سال کے موسموں پر محمول کر کے کرتا ہے کہ پھل اپنے وقت کے ختم ہونے پر ختم ہو جاتے ہیں اور پھر اگلے سال واپس آتے ہیں، جبکہ جنت کا پھل دائمی تخلیق (تکوین) والا ہے، جو منقطع نہیں ہوتا۔ یہ ان کا اس مسئلے میں علم کی انتہا ہے۔ اور ہمارے نزدیک یہ ویسا ہی ہے جیسا کہ اللہ نے فرمایا: لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ (نہ ختم ہونے والے اور نہ روکے جانے والے)۔ کیونکہ اللہ نے ہمارے لیے اس میں ایک رزق مقرر کیا ہے جسے چننا اور تناول کرنا کہتے ہیں، جیسا کہ اللہ نے عالم جنات کے لیے ہڈیوں میں رزق مقرر کیا ہے، اور ہم نہیں دیکھتے کہ ہڈی میں سے کوئی چیز کم ہوتی ہو۔ اور ہم بلاشبہ جنت کے پھلوں کو قریب سے چن کر کھاتے ہیں، باوجود اس کے کہ پھل درخت پر اپنی جگہ پر موجود رہتا ہے، اس کی اصل باقی رہتی ہے، کیونکہ وہ بقا کا گھر ہے اس چیز کے لیے جو اس میں تخلیق ہوتی ہے، پس وہ تخلیق کا گھر ہے، فنا کا گھر نہیں۔ اسی طرح جنت کے بازار میں ہم بازار کی جس صورت میں چاہیں داخل ہوتے ہیں، باوجود اس کے کہ ہم اپنی اصل صورت پر ہوتے ہیں، اور ہمارے اہل و عیال یا ہمارے جاننے والوں میں سے کوئی بھی ہمیں نہیں پہچانتا۔ اور ہم جانتے ہیں کہ ہم نے ایک نئی تکوینی صورت اختیار کی ہے، باوجود اس کے کہ ہم اپنی اصل صورت پر قائم ہیں۔ تو یہاں عقلیں اور معقولات کہاں ہیں؟\n\nاللہ کو اللہ کے سوا کوئی نہیں جانتا، پس عبرت حاصل کرو۔ وہ عقل جو فکر کی تقلید کرتی ہے، وہ عین (حقیقت) کو نہیں جانتی۔\n\n### [اللہ کو نیند کی صفت سے پاک قرار دینا اور اس کے نتائج علم الٰہی اور روحانی کمال کے معیار پر]\n\nاور جب اللہ نے اپنے آپ کو نیند کی صفت سے پاک قرار دیا، تو فرمایا: لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ (نہ اسے اونگھ آتی ہے اور نہ نیند)۔ یعنی کوئی چیز اسے عالم برزخ (عالم البرزخ) کے شہود (الشہود) سے غائب نہیں کرتی، نہ عالم محسوسات (عالم الحس) کے شہود (الشہود) سے، نہ ان معانی کے شہود (الشہود) سے جو مواد سے خارج ہیں، اس حالت میں جب وہ برزخ میں اور اس کے حکم کے تحت حاصل نہیں ہوتے۔ اور اللہ اپنے بعض بندوں کو یہ ادراک عطا کرتا ہے، باوجود اس کے کہ وہ اس صفت سے متصف نہیں ہوتے کہ وہ نہیں سوتے، میرا مطلب دنیا کی حالت اور اس کی نشأت میں ہے۔ لیکن آخرت میں، اہل جنت جنت میں نہیں سوئیں گے، اور دنیا کی کوئی چیز ان سے غائب نہیں ہو گی، بلکہ ہر عالم اپنے مرتبے پر ان کے لیے مشہود (مشاہدہ شدہ) ہو گا، باوجود اس کے کہ وہ نیند کی صفت سے متصف نہیں ہوں گے۔ کہا جاتا ہے کہ فلاں سویا اور اس نے یہ دیکھا، یعنی اس نے الٹی چیز دیکھی، اور یہ عرفِ عادت میں جھوٹ (مان) ہے۔ کیونکہ علم وہ نہیں جو دودھ ہے، اور قرآن وہ نہیں جو شہد ہے، لیکن تم اسے اسی طرح دیکھتے ہو۔ پس جب تم کامل ہو جاؤ گے تو اسے معانی کی حضوری میں علم دیکھو گے، اس حالت میں جب تم اسے عالم برزخ (عالم البرزخ) کی حضوری میں دودھ دیکھ رہے ہو، اور وہ وہی ہے، کوئی اور نہیں۔\n\n### [ہم سے مطلوبہ الٰہی معرفت (المعرفۃ) اور شریعت میں آئی ہوئی ان چیزوں کا قبول کرنا جنہیں عقلیں رد کرتی ہیں]\n\nپس جو کچھ ہم نے تمہیں بتایا ہے اسے متحقق کر لو، کیونکہ ہم نے تمہیں جو کچھ ذکر کیا ہے اس سے تمہیں ابدی راحت پہنچا دی ہے۔ اور ہم نے تمہیں الٰہ کی وہ معرفت (المعرفۃ) کرائی ہے جو ہم سے مطلوب ہے۔ اور جب تم اس چیز کو متحقق کر لو گے جس کی طرف ہم نے اس باب میں اشارہ کیا ہے، تو تم ان تمام الٰہی صفات کو جان لو گے جو شریعت میں کتاب و سنت میں قدیم و جدید طور پر آئی ہیں، جنہیں عقلیں اپنے ان دلائل کی بنا پر رد کرتی ہیں جو اس ادراک سے قاصر ہیں۔ پس ذات حق (الحق) کے وجود کی معرفت عقلوں کا ادراک ہے، اس حیثیت سے کہ وہ غور و فکر کرنے والی اور دلائل کی حامل ہیں۔ اور اس بات کی معرفت کہ ذات حق (الحق) بذات خود کیا ہے، وہ ہے جو ہستی (الوجود) نے ہر ادراک کو اس کے عالم میں عطا کیا ہے۔ پس وہاں حق اور درست کے سوا کچھ نہیں ہے۔ پس پاک ہے وہ ذات جس نے اطوار کو بدلا اور دن میں رات اور دن کی حقیقت رکھی، اور احکام نازل کیے اور انہیں اجمال کے بجائے تفصیل سے مشروع کیا۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\n\n### [نیند عناصر کے مولدات میں طبیعت کے احکام میں سے ہے]\n\n(نیند) خاص طور پر عناصر کے مولدات میں طبیعت کے احکام میں سے ہے۔ اور آخرت کی نشأت عناصر کے مولدات میں سے نہیں ہے، بلکہ وہ طبیعت کے مولدات میں سے ہے، اسی لیے وہ نہیں سوتی اور نہ ہی نیند کو قبول کرتی ہے، جیسے فرشتے اور وہ جو عناصر سے بلند ہیں۔ اور آخرت میں انسان کی نشأت بے مثال ہو گی، جیسا کہ دنیا میں اس کی نشأت بے مثال تھی، کیونکہ اس سے پہلے کوئی ایسا ظاہر نہیں ہوا جو اس کی صورت پر ہو۔ اسی لیے فرمایا: كَمَا بَدَأَكُمْ (جیسے اس نے تمہیں شروع کیا) یعنی بے مثال، تَعُودُونَ (تم لوٹو گے) یعنی آخرت کی نشأت میں بے مثال۔ اور فرمایا: وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَىٰ فَلَوْلَا تَذَكَّرُونَ (اور تم پہلی پیدائش کو تو جان چکے ہو، تو تم کیوں نہیں نصیحت حاصل کرتے) کہ وہ کسی سابقہ مثال کے بغیر تھی۔ پس اپنے دل کو تیز کرو اور اپنا زادِ راہ بڑھاؤ، کیونکہ تم اس نشأت سے کوچ کرنے والے ہو جس میں تم ہو، اور تم اس میں نہیں ہو۔",
    "fa": "(باب نود و نهم در مقام خواب)\n\nخواب امری را در خود جمع دارد که *** جز عالم خواب آن را جمع نمی‌کند، پس در آن بیندیش و عبرت گیر.\n\nکه خیال (الخيال) را حکمی و سلطنتی است *** بر هر دو هستی (الوجودين)، چه از معنا و چه از صورت.\n\nو در غیر خواب درک نمی‌شود و *** صورت‌هایی برای آن در حضرت دیوارها (حس) آشکار نمی‌گردد.\n\nحضورش به حرف صاد (ص) اختصاص دارد نه سین (س) *** پس اوست که بر آنچه در غیب است از صورت‌ها احاطه دارد.\n\nآن کس که کیفیت نمی‌دهد، خواب از او سر باز می‌زند که او را *** با چگونگی (کیف) و کمیت (کم) برای تحدید به واسطه عبرت‌ها محدود کند.\n\n### [خواب حالت انتقال از مشاهده عالم حس به شهود عالم برزخ است]\n\nبدان، خداوند تو را تأیید کند، که خواب حالتی است که بنده را از مشاهده عالم حس (عالم الحس) به شهود عالم برزخ (عالم البرزخ) منتقل می‌سازد. و آن کامل‌ترین عالم است و هیچ کاملی‌تر از آن نیست. آن اصل و منبع عالم است، هستی حقیقی (الوجود الحقيقي) و تسلط بر همه امور از آن اوست. معانی را جسمیت می‌بخشد و آنچه قائم به ذات خود نیست را قائم به ذات خود می‌گرداند، و آنچه صورت ندارد برایش صورت می‌سازد، و محال (المحال) را ممکن می‌سازد و در امور هرگونه که بخواهد تصرف می‌کند.\n\n### [قدرت خیال بر محال و اینکه خیال مخلوق خداست]\n\nپس اگر برای او (خیال) چنین اطلاقی باشد، در حالی که او مخلوقی است که خداوند آفریده، گمانت به خالق سبحان که او را آفریده و این قدرت را به او بخشیده چیست؟ چگونه می‌خواهی بر خداوند حکم به محدودیت کنی و بگویی که خداوند بر محال (المحال) قادر نیست، در حالی که خودت شاهد قدرت خیال (الخيال) بر محال هستی، و خیال مخلوقی از مخلوقات خداست؟ و در آنچه از معانی می‌بینی که خیال برایت جسمیت بخشیده و آن‌ها را به صورت اشخاصی قائم به تو نشان داده است، شک مکن. به همین ترتیب، خداوند اعمال بنی‌آدم را، با وجود اینکه اعراض هستند، به صورت‌هایی قائم می‌آورد که در میزان‌ها برای برپایی عدل قرار داده می‌شوند. و مرگ آورده می‌شود، با اینکه نسبتی است فراتر از عرض در دوری از تجسد، در صورت قوچی سفید و سیاه (کبش أملح). منظور این است که در نهایت وضوح است، به همین دلیل آن را به \"ملحه\" (سفیدی) وصف کرده است، و همه مردم آن را می‌شناسند. پس این محالی است که مقدور (قابل انجام) است.\n\n### [حدود حکم عقل و فساد تأویل آن بر خداوند در آنچه فراتر از سطح آن است]\n\nپس حکم عقل بر خداوند و تأویل فاسد آن کجاست؟ و همچنین نعمت‌های بهشت در میوه‌هایش که: «لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ» (نه بریده می‌شوند و نه ممنوع می‌گردند). کسی که علم ندارد، آن را بر فصول سال حمل می‌کند که میوه با پایان زمانش تمام می‌شود و سپس در سال دیگر باز می‌گردد، در حالی که میوه‌های بهشت دائمی التکوین هستند و قطع نمی‌شوند. این نهایت علم آن‌ها در این مسئله است، در حالی که نزد ما همان‌گونه است که خداوند فرموده: «لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ» (نه بریده می‌شوند و نه ممنوع می‌گردند). زیرا خداوند در آنجا برای ما رزقی قرار داده که «قطف» (چیدن) و «تناول» (برداشتن) نامیده می‌شود، همان‌گونه که خداوند برای عالم جن در استخوان‌ها رزقی قرار داده و ما نمی‌بینیم که چیزی از استخوان کم شود. و ما بدون شک از میوه‌های بهشت، قطفی نزدیک می‌خوریم، در حالی که عین میوه همچنان در جای خود بر درخت باقی است، زیرا آنجا سرای بقا (دار بقاء) برای آنچه در آن تکوین می‌یابد است؛ پس آن سرای تکوین است نه سرای نابودی. و همچنین بازار بهشت؛ ما به هر صورتی که بخواهیم از صورت‌های بازار وارد می‌شویم، در حالی که بر صورت خودمان هستیم و هیچ‌یک از خانواده و آشنایان ما را انکار نمی‌کنند، و ما می‌دانیم که صورتی جدید و تکوینی پوشیده‌ایم، با وجود اینکه بر صورت اصلی خود باقی مانده‌ایم. پس عقل‌ها و معقولات در اینجا کجایند؟\n\nخدا را جز خدا نمی‌شناسد، پس عبرت گیرید *** عقلی که عین (حقیقت) است، مانند عقلی نیست که از فکر تقلید کند.\n\n### [تنزیه خداوند از خواب و نتایج آن در سطح علم الهی و کمال روحی]\n\nو چون خداوند خود را از صفت خواب منزه دانست و فرمود: «لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ» (نه چرت او را می‌گیرد و نه خواب)، یعنی شهود عوالم برزخ (البرازخ) او را از شهود عالم حس (عالم الحس) و از شهود معانی خارج از مواد، در حال عدم حصول آن‌ها در برزخ و تحت حکم آن، غافل نمی‌سازد. و گاهی خداوند برخی از بندگانش را با این ادراک (الإدراك) بهره‌مند می‌سازد، با اینکه متصف به این نیستند که نمی‌خوابند، منظورم در حالت دنیا و نشأت آن است. اما در آخرت، اهل بهشت در بهشت نمی‌خوابند و چیزی از عالم از آن‌ها غایب نمی‌شود، بلکه هر عالمی در مرتبه خود برای آن‌ها مشهود است، با اینکه متصف به خواب نیستند. گفته می‌شود: فلان خوابید و چنین دید، یعنی مقلوب (وارونه) دید و در عرف عادت، او دروغگو است. زیرا علم شیر نیست و قرآن عسل نیست، اما تو آن را این‌گونه می‌بینی. پس هنگامی که کامل شدی، آن را در حضرت معانی، علم می‌بینی، در حالی که در حضرت برزخ (البرزخ) آن را شیر می‌دیدی، و آن همان است و نه چیز دیگر.\n\n### [معرفت مطلوب از ما نسبت به خداوند و پذیرش آنچه شریعت آورده و عقول آن را رد می‌کنند]\n\nپس آنچه را که به تو آگاهاندیم، محقق ساز، که ما با آنچه ذکر کردیم، تو را آسایش ابدی بخشیدیم. و تو را به خداوند، به معرفتی (المعرفة) که از ما خواسته شده، شناساندیم. و اگر آنچه را که در این باب به آن اشاره کردیم، محقق سازی، تمام آنچه را که شریعت در کتاب و سنت، قدیم و جدید، از صفات الهی آورده است و عقول با براهین قاصر خود از این ادراک (الإدراك) آن را رد می‌کنند، خواهی دانست. پس معرفت هستی حق (وجود الحق) درک عقول است از آن جهت که متفکر و صاحب دلالات هستند، و معرفت آنچه حق (الحق) در ذات خود بر آن است، همان چیزی است که هستی (الوجود) به هر ادراکی در عالمش بخشیده است. پس در آنجا جز حق و صواب نیست. پاک و منزه است کسی که اطوار را دگرگون ساخت و در روز، حقیقت شب و روز را قرار داد و احکام را نازل کرد و آن‌ها را به تفصیل تشریع نمود نه به اجمال. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند).\n\n### [خواب از احکام طبیعت در مولدات عناصر است]\n\n(خواب) از احکام طبیعت در مولدات عناصر به طور خاص است، در حالی که نشأت آخرت از مولدات عناصر نیست، بلکه از مولدات طبیعت است. به همین دلیل نمی‌خوابد و خواب را نمی‌پذیرد، مانند فرشتگان و آنچه فراتر از عناصر است. و نشأت انسان در آخرت بر غیر مثال است، همان‌گونه که نشأت او در دنیا بر غیر مثال بود؛ زیرا پیش از او کسی که بر صورت او باشد، ظاهر نشده بود. و به همین دلیل آمده است: «كَمَا بَدَأَكُمْ» (همان‌گونه که شما را آغاز کرد)، یعنی بر غیر مثال، «تَعُودُونَ» (باز می‌گردید)، یعنی بر غیر مثال در نشأت آخرت. و فرمود: «وَلَقَدْ عَلِمْتُمُ النَّشْأَةَ الْأُولَى فَلَوْلَا تَذَكَّرُونَ» (و قطعاً نشأت نخستین را دانسته‌اید، پس چرا متذکر نمی‌شوید؟) که آن بر غیر مثال پیشین بود. پس دلت را تیز کن و توشه‌ات را فراوان ساز، زیرا تو از نشأتی که در آن هستی، و در عین حال در آن نیستی، در حال کوچ هستی."
  },
  "page_count": 2
}