{
  "id": 23,
  "title": {
    "ar": "الباب الثالث والعشرون في معرفة الأقطاب المصونين وأسرار صونهم",
    "en": "Chapter Twenty-Three: Concerning the Knowledge of the Preserved Poles (الأقطاب المصونين) and the Secrets of their Preservation.",
    "ur": "تیئیسواں باب: محفوظ اقطاب کی معرفت اور ان کے محفوظ ہونے کے اسرار کے بیان میں",
    "fa": "باب بیست و سوم در معرفت اقطاب مصون (محفوظ) و اسرار صیانت (حفاظت) آنان"
  },
  "content": {
    "ar": "## «الباب الثالث والعشرون في معرفة الأقطاب المصونين وأسرار صونهم»\n\n\n> إن لله حكمة أخفاها *** في وجودي فليس عين تراها\n\n\n> خلق الجسم دار لهو وأنس *** فبناها وجوده سواها\n\n\n> ثم لما تعدلت واستقامت *** جاء روح من عنده أحياها\n\n\n> ثم لما تحقق الحق علما *** حبه وانقياده لهواها\n\n\n> قال للموت خذ إليك عبيدي *** فدعاه له بما أخلاها\n\n\n> وتجلى له فقال إلهي *** أين أنسي فقال ما تنساها\n\n\n> كيف أنسي دارا جعلت قواها *** من قواكم فهي التي لا تضاهي‏\n> يا إلهي وسيدي واعتمادي *** ما عشقنا منها سوى معناها\n\n\n> أعلمتنا بما تريدون منا *** بلسان الرسول من أعلاها\n\n\n> فقطعنا أيامنا في سرور *** بك يا سيدي فما أحلاها\n\n\n> قال ردوا عليه دار هواه *** صدق الروح إنه يهواها\n\n\n> فرددنا مخلدين سكارى *** طربا دائما إلى سكناها\n\n\n> وبناها على اعتدال قواها *** وتجلى لها بما قواها\n\n\n### [الملامية أو مقام القرية في الولاية]\n\n\nاعلم أيدك الله أن هذا الباب يتضمن ذكر عباد الله المسمين بالملامية وهم الرجال الذين حلوا من الولاية في أقصى درجاتها وما فوقهم إلا درجة النبوة وهذا يسمى مقام القربة في الولاية وآيتهم من القرآن حُورٌ مَقْصُوراتٌ في الْخِيامِ ينبه بنعوت نساء الجنة وحورها على نفوس رجال الله الذين اقتطعهم إليه وصانهم وحبسهم في خيام صون الغيرة الإلهية في زوايا الكون أن تمتد إليهم عين فتشغلهم لا والله ما يشغلهم نظر الخلق إليهم لكنه ليس في وسع الخلق أن يقوموا بما لهذه الطائفة من الحق عليهم لعلو منصبها فتقف العباد في أمر لا يصلون إليه أبدا فحبس ظواهرهم في خيمات العادات والعبادات من الأعمال الظاهرة والمثابرة على الفرائض منها والنوافل فلا يعرفون بخرق عادة فلا يعظمون ولا يشار إليهم بالصلاح الذي في عرف العامة مع كونهم لا يكون منهم فساد فهم الأخفياء الأبرياء الأمناء في العالم الغامضون في الناس فيهم‏\n\n\n### [أغبط الأولياء عند الله‏]\n\n\nقال رسول الله صلى الله عليه وسلم عن ربه عز وجل إن أغبط أوليائي عندي لمؤمن خفيف الحاذ ذو حظ من صلاة أحسن عبادة ربه وأطاعه في السر والعلانية وكان غامضا في الناس‏\n\n\nيريد أنهم لا يعرفون بين الناس بكبير عبادة ولا ينتهكون المحارم سرا وعلنا قال بعض الرجال في صفتهم لما سئل عن العارف قال مسود الوجه في الدنيا والآخرة فإن كان أراد ما ذكرناه من أحوال هذه الطائفة فإنه يريد باسوداد الوجه استفراغ أوقاته كلها في الدنيا والآخرة في تجليات الحق له ولا يرى الإنسان عندنا في مرآة الحق إذا تجلى له غير نفسه ومقامه وهو كون من الأكوان والكون في نور الحق ظلمة فلا يشهد إلا سواده فإن وجه الشي‏ء حقيقته وذاته ولا يدوم التجلي إلا لهذه الطائفة على الخصوص فهم مع الحق في الدنيا والآخرة على ما ذكرناه من دوام التجلي وهم الأفراد وأما إن أراد بالتسويد من السيادة وأراد بالوجه حقيقة الإنسان أي له السيادة في الدنيا والآخرة فيمكن ولا يكون ذلك إلا للرسل خاصة فإنه كما لهم وهو في الأولياء نقص لأن الرسل مضطرون في الظهور لأجل التشريع والأولياء ليس لهم ذلك‏\n\n\n### [الكمال أو رجوع النفس إلى الله‏]\n\n\nأ لا ترى الله سبحانه لم أكمل الدين كيف أمره في السورة التي نعى الله إليه فيها نفسه فأنزل عليه إِذا جاءَ نَصْرُ الله والْفَتْحُ ورَأَيْتَ النَّاسَ يَدْخُلُونَ في دِينِ الله أَفْواجاً فَسَبِّحْ بِحَمْدِ رَبِّكَ واسْتَغْفِرْهُ أي أشغل نفسك بتنزيه ربك والثناء عليه بما هو أهله فاقتطعه بهذا الأمر من العالم لما كمل ما أريد منه من تبليغ الرسالة وطلب بالاستغفار أن يستره عن خلقه في حجاب صونه لينفرد به دون خلقه دائما فإنه كان في زمان التبليغ والإرشاد وشغله بأداء الرسالة فإن له وقتا لا يسعه فيه غير ربه وسائر أوقاته فيما أمر به من النظر في أمور الخلق فرده إلى ذلك الوقت الواحد الذي كان يختلسه من أوقات شغله بالخلق وإن كان عن أمر الحق ثم قوله إِنَّهُ كانَ تَوَّاباً أي يرجع الحق إليك رجوعا مستصحبا لا يكون للخلق عندك فيه دخول بوجه من الوجوه ولما تلا رسول الله صلى الله عليه وسلم هذه السورة بكى أبو بكر الصديق رضي الله عنه وحده دون من كان في ذلك المجلس وعلم أن الله تعالى قد نعى إلى رسول الله صلى الله عليه وسلم نفسه وهو كان أعلم الناس به وأخذ الحاضرون يتعجبون من بكائه ولا يعرفون سبب ذلك‏\n\n\n### [الظهور أو التصرف في الكون‏]\n\n\nوالأولياء الأكابر إذا تركوا وأنفسهم لم يختر أحد منهم الظهور أصلا لأنهم علموا أن الله ما خلقهم لهم ولا لأحد من خلقه بالتعلق من القصد الأول وإنما خلقهم له سبحانه فشغلوا أنفسهم بما خلقوا له فإن أظهرهم الحق عن غير اختيار منهم بأن يجعل في قلوب الخلق تعظيمهم فذلك إليه سبحانه ما لهم فيه تعمل وإن سترهم فلم يجعل لهم في قلوب الناس قدرا يعظمونهم من أجله فذلك إليه تعالى فهم لا اختيار لهم مع اختيار الحق فإن خيرهم ولا بد فيختارون الستر عن الخلق والانقطاع إلى الله ولما كان حالهم ستر مرتبتهم عن نفوسهم فكيف عن غيرهم تعين علينا أن نبين منازل‏\n### [منازل صون الأولياء]\n\n\nفمن منازل صونهم أداء الفرائض في الجماعات والدخول مع الناس في كل بلد بزى ذلك البلد ولا يوطن مكانا في المسجد وتختلف أماكنه في المسجد الذي تقام فيه الجمعة حتى تضيع عينه في غمار الناس وإذا كلم الناس فيكلمهم ويرى الحق رقيبا عليه في كلامه وإذا سمع كلام الناس سمع كذلك ويقلل من مجالسة الناس إلا من جيرانه حتى لا يشعر به ويقضي حاجة الصغير والأرملة ويلاعب أولاده وأهله بما يرضي الله تعالى ويمزح ولا يقول إلا حقا وإن عرف في موضع انتقل عنه إلى غيره فإن لم يتمكن له الانتقال استقضى من يعرفه وألح عليهم في حوائج الناس حتى يرغبوا عنه وإن كان عنده مقام التحول في الصور تحول كما كان للروحاني التشكل في صور بنى آدم فلا يعرف أنه ملك وكذلك كان قضيب البان وهذا كله ما لم يرد الحق إظهاره ولا شهرته من حيث لا يشعر ثم إن هذه الطائفة إنما نالوا هذه المرتبة عند الله لأنهم صانوا قلوبهم أن يدخلها غير الله أو تتعلق بكون من الأكوان سوى الله فليس لهم جلوس إلا مع الله ولا حديث إلا مع الله فهم بالله قائمون وفي الله ناظرون وإلى الله راحلون ومنقلبون وعن الله ناطقون ومن الله آخذون وعلى الله متوكلون وعند الله قاطنون فما لهم معروف سواه ولا مشهود إلا إياه صانوا نفوسهم عن نفوسهم فلا تعرفهم نفوسهم فهم في غيابات الغيب محجوبون هم ضنائن الحق المستخلصون يأكلون الطعام ويمشون في الأسواق مشي ستر وأكل حجاب فهذه حالة هذه الطائفة المذكورة في هذا الباب‏\n\n\n### (تتمة شريفة) لهذا الباب [الولي يتبع النبي على بصيرة]\n\n\nقلنا ومن هذه الحضرة بعثت الرسل سلام الله عليهم أجمعين مشرعين ووجد معهم هؤلاء تابعين لهم قائمين بأمرهم من عين واحدة أخذ عنها الأنبياء والرسل ما شرعوا وأخذ عنها الأولياء ما اتبعوهم فيه فهم التابعون على بصيرة العالمون بمن اتبعوه وفيما اتبعوه وهم العارفون بمنازل الرسل ومناهج السبل من الله ومقاديرهم عند الله تعالى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء السادس عشر والحمد لله‏\n\n\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "**The Twenty-Third Chapter: Concerning the Knowledge of the Preserved Poles (الأقطاب المصونين) and the Secrets of Their Preservation**\n\nIndeed, Allah possesses a wisdom He concealed\nwithin my existence, which no eye can perceive.\n\nHe created the body as a dwelling of amusement and intimacy,\nand His Existence built and perfected it.\n\nThen, when it became balanced and upright,\na Spirit came from Him and gave it life.\n\nThen, when the Real (الحق) realized its knowledge,\nits love and submission were directed toward its inclination.\n\nHe said to Death, \"Take My servant unto yourself,\"\nand called him to Him by that which emptied it (of worldly attachments).\n\nAnd He manifested (تجلى) to him, and he said, \"My God,\nwhere is my intimacy?\" And He replied, \"You shall not forget it.\"\n\nHow can I forget a dwelling whose powers I made\nfrom your own powers? For it is truly incomparable.\n\nO my God, my Master, and my reliance,\nWe loved nothing of it except its inner meaning.\n\nYou informed us of what You desire from us,\nby the tongue of the Messenger, from its highest station.\n\nSo we spent our days in joy\nwith You, O my Master, how sweet that was!\n\nHe said, \"Return to him the dwelling of his desire;\nthe Spirit spoke truly, he yearns for it.\"\n\nSo we were returned, abiding, intoxicated,\nin perpetual rapture toward dwelling within it.\n\nAnd He built it upon the balance of its powers,\nand disclosed Himself (تجلى) to it by that which strengthened it.\n\n**[The Malamiyya or the Station of Nearness (القربة) in Sainthood (الولاية)]**\n\nKnow, may Allah aid you, that this chapter includes the mention of Allah’s servants called the Malamiyya (الملامية). They are the men who have attained the highest degrees of Sainthood (الولاية), and above them is only the degree of Prophethood. This is called the Station of Nearness (مقام القربة) in Sainthood. Their sign from the Quran is: <<حُورٌ مَقْصُوراتٌ في الْخِيامِ>> (Houris, confined in pavilions). This description of the women of Paradise and its Houris serves to alert us to the souls of the men of Allah whom He has singled out for Himself, preserved, and confined within the pavilions of the preservation of Divine Jealousy (الغيرة الإلهية) in the corners of the Cosmos (الكون), lest an eye extend toward them and distract them. No, by Allah, the gaze of creation upon them does not distract them, but rather, it is not within the capacity of creation to fulfill the right that this group holds over them, due to the loftiness of their station. Thus, the servants (of Allah) would stand in a matter they could never attain. Therefore, He confined their outward appearances within the tents of customs and acts of worship (العبادات), consisting of apparent deeds and perseverance in obligatory duties (الفرائض) and supererogatory acts (النوافل). They are not known for breaking custom, so they are neither glorified nor pointed to as possessing the righteousness known in common parlance, even though no corruption issues from them. They are the hidden ones (الأخفياء), the innocent ones (الأبرياء), the trustworthy ones (الأمناء) in the world, the obscure ones among the people.\n\n**[The Most Envied of the Saints (الأولياء) in the Sight of Allah]**\n\nThe Messenger of Allah (peace and blessings be upon him) said, relating from his Lord, the Mighty and Majestic: \"The most envied of My saints (أوليائي) in My sight is a believer who is light of burden (خفيف الحاذ), who has a share of prayer, who perfects the worship of his Lord and obeys Him in secret and in public, and who is obscure among the people (غامضا في الناس).\"\n\nHe means that they are not known among people for great acts of worship, nor do they violate prohibitions secretly or openly. Some men, when asked about the Gnostic (العارف), described them, saying: \"He is one whose face is blackened in this world and the Hereafter.\" If he intended what we have mentioned concerning the state of this group, then by the blackening of the face, he means the complete emptying of all their time, in this world and the Hereafter, in the Theophanies (تجليات) of the Real (الحق) to them. The human being, in the mirror of the Real when He discloses Himself to him, sees nothing but his own self and his station, which is one of the existents (الأكوان). And existence (الكون) in the light of the Real is darkness (ظلمة). Thus, he witnesses nothing but his own blackness. For the face of a thing is its reality (حقيقته) and its Essence (ذاته). The Theophany (التجلي) endures only for this specific group. Therefore, they are with the Real in this world and the Hereafter, based on what we mentioned regarding the permanence of the Theophany. They are the Singular Ones (الأفراد). However, if by \"blackening\" (التسويد) he meant \"mastery\" or \"lordship\" (السيادة), and by \"face\" (الوجه) he meant the reality of the human being—that is, he possesses mastery in this world and the Hereafter—this is possible, but it belongs exclusively to the Messengers. For while it belongs to them, it is a deficiency in the saints, because the Messengers are compelled to manifest for the sake of legislation (التشريع), whereas the saints are not required to do so.\n\n**[Perfection or the Return of the Soul to Allah]**\n\nDo you not see that when Allah, the Glorified, perfected the religion, He commanded him (the Prophet) in the Surah in which Allah announced His own death to him? He revealed to him: <<إِذا جاءَ نَصْرُ الله والْفَتْحُ ورَأَيْتَ النَّاسَ يَدْخُلُونَ في دِينِ الله أَفْواجاً فَسَبِّحْ بِحَمْدِ رَبِّكَ واسْتَغْفِرْهُ إِنَّهُ كانَ تَوَّاباً>> (When the help of Allah and the victory arrive, and you see the people entering the religion of Allah in crowds, then glorify your Lord with praise and seek His forgiveness. Indeed, He is ever-returning [in mercy]). That is, occupy yourself with declaring your Lord free of imperfection and praising Him as is befitting of Him. By this command, He separated him from the world, since what was desired of him—the conveyance of the message—was complete. By seeking forgiveness (الاستغفار), He requested that He veil him from His creation in the curtain of His preservation (صونه), so that he might be alone with Him perpetually, without His creation. For during the time of conveyance, guidance, and occupation with performing the message, he had a specific time when none but his Lord could contain him. All his other times were dedicated to what he was commanded: looking after the affairs of creation. So, He returned him to that single time which he used to steal from his moments of occupation with creation, even if that occupation was by the command of the Real. Then His saying, <<إِنَّهُ كانَ تَوَّاباً>> (Indeed, He is ever-returning), means that the Real returns to you with a continuous return (رجوعا مستصحبا) in which creation has no entry whatsoever. When the Messenger of Allah (peace and blessings be upon him) recited this Surah, Abu Bakr al-Siddiq (may Allah be pleased with him) wept alone, unlike those present in that gathering. He knew that Allah the Almighty had announced the death of the Messenger of Allah (peace and blessings be upon him) to him, and he was the most knowledgeable of people concerning him. The attendees began to wonder at his weeping, not knowing the reason for it.\n\n**[Manifestation (الظهور) or the Disposal of the Cosmos (التصرف في الكون)]**\n\nThe great saints (الأولياء الأكابر), if left to themselves, none of them would ever choose manifestation (الظهور). This is because they know that Allah did not create them for themselves, nor for any of His creation through attachment to the primary intention (القصد الأول). Rather, He created them for Himself, the Glorified. Thus, they occupy themselves with that for which they were created. If the Real manifests them without their choice, by placing their veneration in the hearts of creation, that is up to Him, the Glorified; they have no agency in it. And if He conceals them, not placing in people's hearts any esteem for which they would be venerated, that is up to Him, the Almighty. They have no choice alongside the choice of the Real. If they were given a choice, they would inevitably choose concealment from creation and devotion (الانقطاع) to Allah. Since their state is the concealment of their station even from their own souls, how much more so from others? It is therefore incumbent upon us to clarify the stations of...\n\n**[The Stations of the Preservation (صون) of the Saints]**\n\nAmong the stations of their preservation (صونهم) is performing the obligatory prayers (الفرائض) in congregation (الجماعات), and entering among the people in every town wearing the attire of that town. They do not settle in one place in the mosque, but rather vary their locations in the mosque where the Friday prayer is held, so that their identity is lost among the masses. When they speak to people, they speak, seeing the Real as a Watcher (رقيبا) over their speech. When they hear the speech of people, they listen likewise. They minimize sitting with people, except for their neighbors, so that they are not noticed. They fulfill the needs of the young and the widow, and they play with their children and family in a way that pleases Allah the Almighty. They joke, but speak only the truth. If they become known in one place, they move to another. If they are unable to move, they seek out those who know them and press upon them the needs of the people until they become undesirable (to the people). If they possess the station of transformation of forms (التحول في الصور), they transform, just as the spiritual being (الروحاني) can take the form of the children of Adam, so that he is not known to be an angel. Such was the case with Qadib al-Ban. All of this is done unless the Real wills their manifestation and fame from a source they do not perceive. Furthermore, this group attained this rank with Allah only because they preserved their hearts (صانوا قلوبهم) from the entry of anything other than Allah, or from becoming attached to any existent (كون) other than Allah. They sit only with Allah, and their conversation is only with Allah. They are established by Allah, looking into Allah, journeying toward Allah, returning to Allah, speaking from Allah, taking from Allah, relying upon Allah, and dwelling with Allah. They have no known object (معروف) other than Him, nor anything witnessed (مشهود) except Him. They preserve their souls from their own souls, so their souls do not know them. They are concealed in the abysses of the Unseen (غيابات الغيب). They are the cherished ones (ضنائن الحق), the chosen ones. They eat food and walk in the markets with the gait of concealment and the eating of veiling (حجاب). This is the state of this group mentioned in this chapter.\n\n**(A Noble Supplement (تتمة شريفة) to this Chapter) [The Saint Follows the Prophet with Insight]**\n\nWe say: It is from this Presence (الحضرة) that the Messengers (peace be upon them all) were sent as legislators, and alongside them were found these followers, upholding their command, taking from a single source (عين واحدة). From this source, the Prophets and Messengers took what they legislated, and from it, the Saints (الأولياء) took what they followed them in. They are the followers who possess insight (بصيرة), who know whom they follow and in what they follow them. They are the Gnostics (العارفون) concerning the stations of the Messengers, the methodologies of the paths from Allah, and their measures in the sight of Allah the Almighty. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way). The Sixteenth Part is concluded, and praise belongs to Allah.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب تئیسواں: محفوظ اقطاب (الأقطاب المصونين) کی معرفت اور ان کے تحفظ کے اسرار کے بیان میں\n\nبے شک اللہ نے ایک حکمت چھپا رکھی ہے\nمیری ہستی (الوجود) میں، جسے کوئی آنکھ نہیں دیکھتی۔\nاس نے جسم کو لہو و انس کا گھر بنایا،\nپھر اس کی ہستی (الوجود) نے اسے سنوار کر تعمیر کیا۔\nپھر جب وہ معتدل اور سیدھا ہو گیا،\nتو اس کی طرف سے ایک روح آئی جس نے اسے زندہ کیا۔\nپھر جب ذات حق (الحق) نے علم کے ذریعے اس کی تصدیق کی،\nتو اس کی محبت اور اس کی خواہش کے سامنے سر تسلیم خم کیا۔\nموت سے کہا: میرے بندوں کو اپنے پاس لے جا،\nتو موت نے اسے پکارا جب اس نے اسے خالی کر دیا۔\nاور اس پر ظہور الٰہی (التجلی) ہوا، تو اس نے کہا: اے میرے معبود!\nمیرا انس کہاں ہے؟ تو فرمایا: جسے تم نہیں بھولتے۔\nمیں اس گھر کو کیسے بھول جاؤں جس کی قوتیں\nتمہاری قوتوں سے بنائی گئی ہیں، پس وہ بے مثال ہے۔\nاے میرے معبود، میرے آقا اور میرے سہارے!\nہم نے اس میں اس کے معنی کے سوا کسی سے عشق نہیں کیا۔\nآپ نے ہمیں بتا دیا جو آپ ہم سے چاہتے ہیں،\nرسول کے ذریعے جو سب سے بلند ہیں۔\nپس ہم نے اپنی زندگی کے دن خوشی میں گزارے،\nآپ کے ساتھ، اے میرے آقا! وہ کتنے شیریں ہیں۔\nفرمایا: اسے اس کے عشق کا گھر واپس کر دو،\nروح نے سچ کہا، بے شک وہ اس سے محبت کرتا ہے۔\nپس ہم ہمیشہ کے لیے لوٹا دیے گئے، مست و سرشار،\nاس کے ٹھکانے کی طرف ہمیشہ مائل۔\nاور اس نے اسے اس کی قوتوں کے اعتدال پر بنایا،\nاور اس پر ظہور الٰہی (التجلی) کیا جس سے اسے قوت ملی۔\n\n[ملامیہ (الملامية) یا ولایت (الولایۃ) میں مقام قربت (مقام القربة)]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ یہ باب اللہ کے ان بندوں کے ذکر پر مشتمل ہے جنہیں ملامیہ (الملامية) کہا جاتا ہے۔ یہ وہ مردانِ حق ہیں جو ولایت (الولایۃ) کے انتہائی بلند درجات پر فائز ہیں، اور ان سے اوپر صرف نبوت کا درجہ ہے۔ اسے ولایت (الولایۃ) میں مقام قربت (مقام القربة) کہا جاتا ہے۔ قرآن میں ان کی آیت یہ ہے:\n**حُورٌ مَقْصُوراتٌ في الْخِيامِ** (خیموں میں روکے رکھی گئی حوریں)۔\nیہ آیت جنت کی عورتوں اور حوروں کی صفات کے ذریعے اللہ کے ان بندوں کی نفوس کی طرف اشارہ کرتی ہے جنہیں اللہ نے اپنے لیے چن لیا، انہیں محفوظ رکھا، اور انہیں غیرت الٰہیہ (الغیرۃ الإلٰہیۃ) کے تحفظ کے خیموں میں کون (الکون) کے گوشوں میں قید کر دیا تاکہ کوئی آنکھ ان کی طرف نہ بڑھے اور انہیں مشغول نہ کرے۔ نہیں، اللہ کی قسم! انہیں مخلوق کا دیکھنا مشغول نہیں کرتا، لیکن مخلوق کی طاقت میں نہیں ہے کہ وہ اس گروہ کے حق کو پورا کر سکے جو ان کے بلند منصب کی وجہ سے ان پر واجب ہے۔ پس بندے ایک ایسے معاملے میں رک جاتے ہیں جہاں وہ کبھی نہیں پہنچ سکتے۔ لہٰذا، ان کے ظواہر کو عادات اور عبادات کے خیموں میں قید کر دیا گیا ہے، یعنی ظاہری اعمال اور فرائض و نوافل پر ثابت قدمی۔ وہ کسی خرقِ عادت (کرامت) کے ذریعے پہچانے نہیں جاتے، نہ ان کی تعظیم کی جاتی ہے، اور نہ ہی انہیں عام لوگوں کے عرف میں نیکوکاری کے طور پر اشارہ کیا جاتا ہے، حالانکہ ان سے کوئی فساد سرزد نہیں ہوتا۔ پس وہ دنیا میں پوشیدہ، بے گناہ اور امانت دار ہیں، جو لوگوں میں گمنام رہتے ہیں۔\n\n[اللہ کے نزدیک سب سے زیادہ قابل رشک اولیاء]\n\nرسول اللہ صلی اللہ علیہ وسلم نے اپنے رب عزوجل سے روایت کرتے ہوئے فرمایا:\n\"بے شک میرے نزدیک میرے اولیاء میں سب سے زیادہ قابل رشک وہ مومن ہے جو ہلکا پھلکا ہو، نماز میں حصہ رکھتا ہو، اپنے رب کی عبادت بہترین طریقے سے کرتا ہو، اور خفیہ اور اعلانیہ طور پر اس کی اطاعت کرتا ہو، اور لوگوں میں گمنام ہو۔\"\nاس سے مراد یہ ہے کہ وہ لوگوں میں بڑی عبادت کے ذریعے پہچانے نہیں جاتے، اور نہ ہی وہ خفیہ یا اعلانیہ طور پر محرمات کا ارتکاب کرتے ہیں۔ جب بعض رجالِ حق سے عارف کی صفت کے بارے میں پوچھا گیا تو انہوں نے کہا: \"دنیا اور آخرت میں سیاہ رو۔\" اگر اس سے مراد وہ احوال ہیں جو ہم نے اس گروہ کے بارے میں ذکر کیے ہیں، تو سیاہ روئی سے مراد یہ ہے کہ وہ دنیا اور آخرت میں اپنے تمام اوقات ذات حق (الحق) کے ظہور الٰہی (التجلی) میں صرف کر دیتے ہیں۔ اور جب ذات حق (الحق) کسی انسان پر ظہور الٰہی (التجلی) فرماتی ہے تو وہ ہمارے نزدیک حق کے آئینے میں اپنی ذات اور اپنے مقام کے سوا کچھ نہیں دیکھتا، اور وہ کون (الکون) میں سے ایک کون ہے، اور کون (الکون) حق کے نور میں ظلمت ہے۔ پس وہ صرف اپنی سیاہی کا شہود (الشہود) کرتا ہے، کیونکہ شے کا چہرہ اس کی حقیقت اور ذات ہے۔ اور ظہور الٰہی (التجلی) کا دوام خاص طور پر صرف اسی گروہ کے لیے ہوتا ہے۔ پس وہ دنیا اور آخرت میں حق کے ساتھ ہیں جیسا کہ ہم نے دوامِ ظہور الٰہی (التجلی) کے بارے میں ذکر کیا، اور یہی افراد (الأفراد) ہیں۔ لیکن اگر تسوید (سیاہ روئی) سے مراد سیادت (سرداری) ہو، اور وجہ (چہرے) سے مراد انسان کی حقیقت ہو، یعنی اسے دنیا اور آخرت میں سیادت حاصل ہو، تو یہ ممکن ہے، لیکن یہ صرف رسولوں کے لیے خاص ہے، کیونکہ یہ ان کے لیے کمال ہے، جبکہ اولیاء کے لیے یہ نقص ہے، کیونکہ رسول تشریع (قانون سازی) کی خاطر ظاہر ہونے پر مجبور ہوتے ہیں، اور اولیاء کے لیے یہ ضروری نہیں۔\n\n[کمال یا نفس کا اللہ کی طرف رجوع]\n\nکیا آپ نہیں دیکھتے کہ جب اللہ سبحانہ و تعالیٰ نے دین کو مکمل کیا تو اس سورت میں آپ صلی اللہ علیہ وسلم کو کیا حکم دیا جس میں اللہ نے آپ کو آپ کی وفات کی خبر دی؟ پس اس پر نازل فرمایا:\n**إِذا جاءَ نَصْرُ الله والْفَتْحُ ورَأَيْتَ النَّاسَ يَدْخُلُونَ في دِينِ الله أَفْواجاً فَسَبِّحْ بِحَمْدِ رَبِّكَ واسْتَغْفِرْهُ** (جب اللہ کی مدد اور فتح آ جائے، اور آپ لوگوں کو گروہ در گروہ اللہ کے دین میں داخل ہوتے دیکھیں، تو اپنے رب کی حمد کے ساتھ تسبیح کیجیے اور اس سے مغفرت طلب کیجیے)۔\nیعنی اپنے آپ کو اپنے رب کی تنزیہ اور اس کی ایسی تعریف میں مشغول کر لیجیے جس کا وہ اہل ہے۔ پس اس حکم کے ذریعے آپ کو عالم سے منقطع کر دیا گیا جب آپ سے مطلوبہ رسالت کی تبلیغ مکمل ہو چکی۔ اور استغفار کے ذریعے یہ طلب کیا گیا کہ اللہ آپ کو اپنی مخلوق سے اپنے تحفظ کے پردے میں چھپا لے تاکہ آپ ہمیشہ کے لیے مخلوق کے بجائے صرف اسی کے ساتھ منفرد ہو جائیں۔ کیونکہ آپ تبلیغ اور ارشاد کے زمانے میں تھے اور رسالت کی ادائیگی میں مشغول تھے۔ بے شک آپ کا ایک وقت ایسا تھا جس میں آپ کے لیے آپ کے رب کے سوا کوئی گنجائش نہ تھی، اور آپ کے باقی اوقات مخلوق کے معاملات میں نظر کرنے کے حکم میں صرف ہوتے تھے (اگرچہ وہ حق کے حکم سے ہی تھا)۔ پس اللہ نے آپ کو اسی ایک وقت کی طرف لوٹا دیا جسے آپ مخلوق کے ساتھ مشغولیت کے اوقات سے چوری کرتے تھے۔ پھر اس کا قول: **إِنَّهُ كانَ تَوَّاباً** (بے شک وہ بہت توبہ قبول کرنے والا ہے)۔ یعنی ذات حق (الحق) آپ کی طرف ایسا رجوع فرمائے گا جو ہمیشہ ساتھ رہنے والا ہو گا، جس میں مخلوق کا آپ کے پاس کسی بھی صورت میں کوئی دخل نہیں ہو گا۔ اور جب رسول اللہ صلی اللہ علیہ وسلم نے یہ سورت تلاوت فرمائی تو اس مجلس میں موجود لوگوں میں سے صرف ابوبکر صدیق رضی اللہ عنہ رو پڑے، اور وہ جان گئے کہ اللہ تعالیٰ نے رسول اللہ صلی اللہ علیہ وسلم کو ان کی وفات کی خبر دے دی ہے، اور وہ لوگوں میں سب سے زیادہ آپ کے بارے میں جاننے والے تھے۔ اور حاضرین ان کے رونے پر تعجب کرنے لگے اور اس کی وجہ نہیں جانتے تھے۔\n\n[ظہور یا کون (الکون) میں تصرف]\n\nاور بڑے اولیاء (الأولیاء الأکابر) جب اپنے نفسوں پر چھوڑ دیے جاتے ہیں تو ان میں سے کوئی بھی ہرگز ظہور کو اختیار نہیں کرتا، کیونکہ وہ جانتے ہیں کہ اللہ نے انہیں نہ تو ان کے لیے پیدا کیا ہے اور نہ ہی کسی اور مخلوق کے لیے، بلکہ انہیں صرف اپنے لیے پیدا کیا ہے۔ پس وہ اپنے آپ کو اسی چیز میں مشغول رکھتے ہیں جس کے لیے وہ پیدا کیے گئے ہیں۔ اگر ذات حق (الحق) انہیں ان کے اختیار کے بغیر ظاہر کر دے، اس طرح کہ مخلوق کے دلوں میں ان کی تعظیم ڈال دے، تو یہ اللہ سبحانہ و تعالیٰ کی طرف سے ہے، اس میں ان کا کوئی عمل دخل نہیں۔ اور اگر وہ انہیں پوشیدہ رکھے، اور لوگوں کے دلوں میں ان کے لیے کوئی قدر و منزلت نہ رکھے جس کی وجہ سے وہ ان کی تعظیم کریں، تو یہ بھی اللہ تعالیٰ کی طرف سے ہے۔ پس حق کے اختیار کے مقابلے میں ان کا کوئی اختیار نہیں ہے۔ اگر انہیں اختیار دیا جائے تو وہ لازماً مخلوق سے پردہ پوشی اور اللہ کی طرف انقطاع کو اختیار کریں گے۔ اور چونکہ ان کا حال یہ ہے کہ وہ اپنے مرتبے کو اپنے نفسوں سے بھی چھپاتے ہیں، تو دوسروں سے کیسے نہ چھپائیں گے؟ لہٰذا ہم پر لازم ہے کہ ہم بیان کریں:\n\n[اولیاء کے تحفظ کے منازل]\n\nان کے تحفظ کے منازل میں سے یہ ہے کہ وہ فرائض جماعت کے ساتھ ادا کرتے ہیں، اور ہر شہر میں وہاں کے لباس میں لوگوں کے ساتھ گھل مل جاتے ہیں۔ وہ مسجد میں کسی ایک جگہ کو اپنا ٹھکانہ نہیں بناتے، اور جس مسجد میں جمعہ قائم ہوتا ہے وہاں ان کی جگہیں بدلتی رہتی ہیں تاکہ وہ عام لوگوں کے ہجوم میں گم ہو جائیں۔ جب وہ لوگوں سے بات کرتے ہیں تو بات کرتے ہیں اور اپنے کلام میں ذات حق (الحق) کو اپنا نگران دیکھتے ہیں۔ اور جب لوگوں کی بات سنتے ہیں تو اسی طرح سنتے ہیں۔ وہ لوگوں کی مجلسوں کو کم کرتے ہیں سوائے اپنے پڑوسیوں کے تاکہ وہ پہچانے نہ جائیں۔ وہ چھوٹے اور بیوہ کی حاجت پوری کرتے ہیں، اور اپنے بچوں اور اہل خانہ کے ساتھ اللہ کی رضا کے مطابق کھیلتے ہیں، اور مزاح کرتے ہیں لیکن حق کے سوا کچھ نہیں کہتے۔ اگر وہ کسی جگہ پہچانے جائیں تو وہاں سے دوسری جگہ منتقل ہو جاتے ہیں۔ اگر ان کے لیے منتقل ہونا ممکن نہ ہو تو وہ ان لوگوں سے جو انہیں جانتے ہیں، لوگوں کے کاموں میں اصرار کرتے ہیں یہاں تک کہ لوگ ان سے بیزار ہو جائیں۔ اور اگر ان کے پاس صورتوں میں تبدیل ہونے کا مقام ہو تو وہ تبدیل ہو جاتے ہیں، جیسا کہ روحانی کے لیے بنی آدم کی صورتوں میں متشکل ہونا ممکن ہے، پس یہ معلوم نہیں ہوتا کہ وہ فرشتہ ہے، اور اسی طرح قضیب البان کا حال تھا۔ یہ سب اس وقت تک ہے جب تک ذات حق (الحق) ان کے ظہور یا شہرت کا ارادہ نہ کرے، اس طرح کہ انہیں خبر بھی نہ ہو۔ پھر یہ گروہ اللہ کے ہاں یہ مرتبہ اس لیے پایا کہ انہوں نے اپنے دلوں کو اس بات سے محفوظ رکھا کہ اس میں اللہ کے سوا کوئی داخل ہو، یا اللہ کے سوا کسی کون (الکون) سے تعلق رکھے۔ پس ان کا بیٹھنا صرف اللہ کے ساتھ ہوتا ہے، اور ان کی گفتگو صرف اللہ کے ساتھ ہوتی ہے۔ وہ اللہ کے ذریعے قائم ہیں، اللہ میں دیکھنے والے ہیں، اللہ کی طرف کوچ کرنے والے اور پلٹنے والے ہیں، اللہ کی طرف سے بولنے والے ہیں، اللہ سے لینے والے ہیں، اللہ پر توکل کرنے والے ہیں، اور اللہ کے پاس مقیم ہیں۔ پس ان کے لیے اس کے سوا کوئی معروف نہیں، اور نہ ہی اس کے سوا کوئی مشہود (المشہود) ہے۔ انہوں نے اپنے نفوس کو اپنے نفوس سے محفوظ رکھا، پس ان کے نفوس انہیں نہیں پہچانتے۔ وہ غیب کی گہرائیوں میں پردہ نشین ہیں۔ وہ ذات حق (الحق) کے چنے ہوئے خزانے ہیں۔ وہ کھانا کھاتے ہیں اور بازاروں میں چلتے ہیں، لیکن ان کا چلنا پردے کا چلنا ہے اور ان کا کھانا حجاب کا کھانا ہے۔ پس یہ اس گروہ کا حال ہے جس کا ذکر اس باب میں کیا گیا ہے۔\n\n(اس باب کا ایک شریف تتمہ) [ولی بصیرت کے ساتھ نبی کی پیروی کرتا ہے]\n\nہم کہتے ہیں کہ اسی حضور (الحضرۃ) سے تمام رسولوں کو سلام اللہ علیہم اجمعین، شریعت ساز بنا کر بھیجا گیا، اور ان کے ساتھ یہ لوگ ان کے تابعین کے طور پر پائے گئے جو ان کے حکم پر قائم تھے، اور یہ سب ایک ہی سرچشمہ سے اخذ کرتے ہیں، جس سے انبیاء اور رسولوں نے وہ لیا جو انہوں نے شریعت بنائی، اور اسی سے اولیاء نے وہ لیا جس میں انہوں نے ان کی پیروی کی۔ پس وہ بصیرت کے ساتھ پیروی کرنے والے ہیں، جو جانتے ہیں کہ وہ کس کی پیروی کر رہے ہیں اور کس چیز میں پیروی کر رہے ہیں۔ اور وہ رسولوں کے منازل، اللہ کی طرف سے راستوں کے طریقوں اور اللہ تعالیٰ کے ہاں ان کے مقام و مرتبہ کو جاننے والے ہیں۔ اور اللہ **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\nسولہواں حصہ مکمل ہوا، اور تمام تعریفیں اللہ کے لیے ہیں۔\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "باب بیست و سوم در شناخت اقطاب مصون (الأقطاب المصونين) و اسرار صیانت آنان\n\nهمانا خداوند حکمتی را پنهان کرد *** در هستی (الوجود) من که هیچ چشمی آن را نمی‌بیند\nجسم را خانه‌ی لهو و انس آفرید *** پس هستی (وجوده) او آن را بنا نهاد و سامان داد\nسپس چون معتدل و راست گشت *** روحی از جانب او آمد و آن را زنده کرد\nسپس چون حق (الحق) از روی علم محقق شد *** عشق و انقیادش به سوی هوای آن رفت\nبه مرگ گفت: بندگانم را به سوی خود ببر *** پس او را به آنچه از آن خالی کرده بود، فراخواند\nو بر او تجلی (التجلی) کرد و گفت: ای معبود من، انس من کجاست؟ *** فرمود: آنچه را فراموش نمی‌کنی\nچگونه خانه‌ای را فراموش کنم که نیروهایش را *** از نیروهای شما قرار دادم؟ پس آن خانه‌ای است که نظیری ندارد\nای معبود و سرور و تکیه‌گاه من *** ما از آن جز معنایش را عشق نورزیدیم\nما را به آنچه از ما می‌خواهید آگاه ساختید *** به زبان رسولی که او را برتری دادید\nپس روزگارمان را در سرور *** با تو ای سرورم گذراندیم، چه شیرین است!\nفرمود: خانه‌ی هوای او را به او بازگردانید *** روح راست گفت، همانا او آن را دوست دارد\nپس ما را جاودانه و مست بازگرداندند *** در طرب دائمی به سوی سکونتگاهش\nو آن را بر اعتدال نیروهایش بنا نهاد *** و بر آن تجلی (التجلی) کرد به آنچه نیرویش بخشید.\n\n### [ملامتیه (الملامية) یا مقام قربت (مقام القربة) در ولایت (الولاية)]\n\nبدان، خداوند تو را تأیید کند، که این باب شامل ذکر بندگان خداست که ملامتیه (الملامية) نامیده می‌شوند. آنان مردانی هستند که در بالاترین درجات ولایت (الولاية) جای گرفته‌اند و بالاتر از ایشان جز درجه‌ی نبوت نیست. این مقام، مقام قربت (مقام القربة) در ولایت نامیده می‌شود. و نشانه‌ی آنان از قرآن این آیه است: «حُورٌ مَقْصُورَاتٌ فِي الْخِيَامِ» (حوریانی که در خیمه‌ها مستورند). این آیه با توصیف زنان بهشت و حوریان، بر نفوس مردان خدا هشدار می‌دهد؛ کسانی که خداوند آنان را برای خود برگزیده و صیانت کرده و در خیمه‌های صیانت غیرت الهی در گوشه‌های هستی (الکون) محبوس کرده است تا چشمی به سوی آنان دراز نشود و ایشان را مشغول نسازد.\n\nنه به خدا سوگند، نظر خلق آنان را مشغول نمی‌کند، بلکه در توان خلق نیست که حق این طایفه را به دلیل والایی منصبشان ادا کنند. پس بندگان در امری می‌ایستند که هرگز به آن نمی‌رسند. از این رو، خداوند ظواهر آنان را در خیمه‌های عادات و عبادات، از اعمال ظاهری و مداومت بر فرایض و نوافل، محبوس کرده است. پس به خارق عادت شناخته نمی‌شوند و تعظیم نمی‌گردند و به صلاحی که در عرف عامه است، به آنان اشاره نمی‌شود، با وجود اینکه هیچ فسادی از ایشان سر نمی‌زند. پس آنان پنهان‌کاران، بی‌گناهان و امینان در جهان هستند که در میان مردم ناشناخته‌اند.\n\n### [غبطه‌برانگیزترین اولیا نزد خداوند]\n\nرسول خدا (صلی الله علیه و سلم) از پروردگار عز و جل خود فرمود: «همانا غبطه‌برانگیزترین اولیای من نزد من، مؤمنی است که سبک‌بار باشد، بهره‌ای از نماز داشته باشد، عبادت پروردگارش را نیکو انجام دهد و در نهان و آشکار او را اطاعت کند و در میان مردم ناشناخته باشد.»\n\nمنظور این است که آنان در میان مردم به عبادت بزرگ شناخته نمی‌شوند و محارم را نه در نهان و نه در آشکار هتک نمی‌کنند. برخی از رجال در وصف آنان، هنگامی که از عارف پرسیده شد، گفتند: «سیاه‌روی در دنیا و آخرت.» اگر منظور او همان احوال این طایفه باشد که ذکر کردیم، پس مرادش از سیاه‌رویی، صرف کردن تمام اوقات در دنیا و آخرت در تجلیات (التجلیات) حق (الحق) برای اوست. و انسان نزد ما در آینه‌ی حق (الحق) هنگامی که بر او تجلی (تجلی) می‌کند، جز خود و مقامش را نمی‌بیند، و آن خود کونی از اکوان است. و کون (الکون) در نور حق (الحق) ظلمت است، پس جز سیاهی خود را شهود (الشهود) نمی‌کند؛ زیرا وجه هر شیء، حقیقت و ذات آن است. و تجلی (التجلی) جز برای این طایفه به طور خاص دوام نمی‌یابد. پس آنان در دنیا و آخرت با حق (الحق) هستند، بر اساس آنچه از دوام تجلی (التجلی) ذکر کردیم، و آنان افراد (الأفراد) هستند.\n\nاما اگر منظور او از «تسوید» (سیاه‌کردن) سیادت (سروری) باشد و مرادش از «وجه» حقیقت انسان باشد، یعنی برای او سیادت در دنیا و آخرت است، این ممکن است، اما این مقام فقط برای رسولان است. زیرا این سیادت کمالی برای آنان است، در حالی که برای اولیا نقص محسوب می‌شود؛ چرا که رسولان برای تشریع (قانون‌گذاری) ناچار به ظهور هستند، اما اولیا چنین وظیفه‌ای ندارند.\n\n### [کمال یا رجوع نفس به سوی خدا]\n\nآیا نمی‌بینی که خداوند سبحان هنگامی که دین را کامل کرد، چگونه در سوره‌ای که در آن خبر مرگ پیامبر را به او داد، امر فرمود؟ پس بر او نازل کرد: «إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ * وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا * فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ» (هنگامی که یاری خدا و پیروزی فرا رسد * و ببینی که مردم گروه گروه به دین خدا درمی‌آیند * پس پروردگارت را با ستایش تسبیح گوی و از او آمرزش بخواه). یعنی خود را به تنزیه پروردگارت و ثنا گفتن بر او به آنچه شایسته‌ی اوست مشغول کن. پس با این امر، او را از عالم جدا کرد، زیرا آنچه از او خواسته شده بود، یعنی ابلاغ رسالت، کامل شده بود. و با استغفار خواست که او را از خلقش در حجاب صیانت خود بپوشاند تا همیشه بدون خلقش با او تنها باشد. زیرا او در زمان تبلیغ و ارشاد و مشغولیت به ادای رسالت بود، در حالی که او را وقتی است که جز پروردگارش در آن نگنجد، و سایر اوقاتش در آنچه به آن امر شده بود، یعنی رسیدگی به امور خلق، می‌گذشت. پس او را به آن وقت واحد بازگرداند که آن را از اوقات مشغولیتش به خلق، هرچند به امر حق (الحق) بود، می‌ربود. سپس قول او: «إِنَّهُ كَانَ تَوَّابًا» (همانا او بسیار توبه‌پذیر است)، یعنی حق (الحق) به سوی تو باز می‌گردد، بازگشتی همراه و پیوسته که خلق به هیچ وجه در آن نزد تو دخالتی ندارند. و هنگامی که رسول خدا (صلی الله علیه و سلم) این سوره را تلاوت کرد، ابوبکر صدیق (رضی الله عنه) به تنهایی، بدون دیگر حاضران در آن مجلس، گریست و دانست که خداوند متعال خبر مرگ رسول خدا (صلی الله علیه و سلم) را به او داده است، و او داناترین مردم به پیامبر بود. و حاضران شروع به تعجب از گریه‌ی او کردند و سبب آن را نمی‌دانستند.\n\n### [ظهور (الظهور) یا تصرف در هستی (الکون)]\n\nو اولیای بزرگ (الأولياء الأكابر) اگر به حال خود رها شوند، هیچ یک از آنان هرگز ظهور (الظهور) را انتخاب نمی‌کند، زیرا می‌دانند که خداوند آنان را برای خودشان یا برای هیچ یک از خلقش، از قصد اول، نیافریده است، بلکه آنان را برای خود سبحان آفریده است. پس خود را به آنچه برای آن آفریده شده‌اند، مشغول کردند. پس اگر حق (الحق) آنان را بدون اختیار خودشان ظاهر سازد، به این صورت که تعظیم آنان را در دل‌های خلق قرار دهد، این امر به سوی خداوند سبحان است و آنان در آن هیچ دخالتی ندارند. و اگر آنان را بپوشاند و در دل‌های مردم قدر و منزلتی قرار ندهد که به خاطر آن تعظیم شوند، این نیز به سوی خداوند متعال است. پس آنان با وجود اختیار حق (الحق)، اختیاری ندارند. اما اگر ناگزیر مخیر شوند، ستر از خلق و انقطاع به سوی خدا را انتخاب می‌کنند. و چون حال آنان پوشاندن مرتبه‌ی خود از نفس‌هایشان است، چگونه از دیگران پنهان نباشد؟ پس بر ما واجب است که منازل [آنان] را بیان کنیم.\n\n### [منازل صیانت اولیا]\n\nاز منازل صیانت آنان، ادای فرایض در جماعت‌ها و وارد شدن با مردم در هر شهر با لباس آن شهر است. و در مسجد مکانی را وطن خود قرار نمی‌دهد و جایگاهش در مسجدی که جمعه در آن اقامه می‌شود، تغییر می‌کند تا چشم او در میان انبوه مردم گم شود. و هنگامی که با مردم سخن می‌گوید، با آنان سخن می‌گوید و حق (الحق) را در کلامش ناظر بر خود می‌بیند. و هنگامی که سخن مردم را می‌شنود، نیز چنین می‌شنود. و از همنشینی با مردم، جز همسایگانش، می‌کاهد تا کسی متوجه او نشود. و حاجت کوچک و بیوه را برآورده می‌کند و با فرزندان و خانواده‌اش به آنچه خداوند متعال راضی است، بازی می‌کند و شوخی می‌کند، اما جز حق نمی‌گوید. و اگر در جایی شناخته شود، از آنجا به جای دیگری منتقل می‌شود. و اگر نتوانست منتقل شود، از کسی که او را می‌شناسد، می‌خواهد و در حوائج مردم بر آنان اصرار می‌ورزد تا از او رویگردان شوند. و اگر مقام تحول در صور (التحول في الصور) را داشته باشد، تغییر شکل می‌دهد، همان‌طور که برای روحانی (الروحاني) تشکل در صورت بنی‌آدم ممکن است و شناخته نمی‌شود که او فرشته است. و قضيب البان نیز چنین بود. و این همه تا زمانی است که حق (الحق) نخواهد او را ظاهر سازد یا شهرتش دهد، به گونه‌ای که خود متوجه نشود. سپس، این طایفه این مرتبه را نزد خدا به دست آوردند، زیرا قلب‌های خود را صیانت کردند که غیر خدا وارد آن نشود یا به کونی (الکون) جز خدا تعلق پیدا نکند. پس نشستن آنان جز با خدا نیست و سخن گفتنشان جز با خدا نیست. آنان به واسطه‌ی خدا قائم‌اند، در خدا ناظرند، به سوی خدا کوچ می‌کنند و باز می‌گردند، از خدا سخن می‌گویند، از خدا می‌گیرند، بر خدا توکل می‌کنند و نزد خدا مقیم‌اند. پس برای آنان شناخته‌شده‌ای جز او نیست و مشهودی (المشهود) جز او نیست. آنان نفوس خود را از نفوس خود صیانت کردند، پس نفوسشان آنان را نمی‌شناسند. آنان در غیابات غیب محجوب‌اند. آنان گنجینه‌های حق (الحق) هستند که برگزیده شده‌اند. غذا می‌خورند و در بازارها راه می‌روند، اما راه رفتنشان پوشیده و خوردنشان در حجاب است. این است حال این طایفه‌ای که در این باب ذکر شد.\n\n### (تتمه‌ی شریفه) برای این باب [ولی (الولي) از روی بصیرت (بصيرة) از نبی (النبي) پیروی می‌کند]\n\nگفتیم که از این حضرت (الحضرة) رسولان (سلام الله علیهم اجمعین) به عنوان قانون‌گذار مبعوث شدند و اینان (ملامتیه) همراه آنان یافت شدند، در حالی که تابع ایشان و قائم به امرشان بودند. این امر از یک چشمه‌ی واحد گرفته شده است که انبیا و رسولان آنچه را تشریع کردند، از آن گرفتند و اولیا آنچه را که در آن از آنان پیروی کردند، از آن گرفتند. پس آنان تابعان بر بصیرت (بصيرة) هستند، دانایان به کسی که از او پیروی کردند و به آنچه در آن پیروی کردند. و آنان عارفان (العارفون) به منازل رسولان و روش‌های راه‌هایی هستند که از جانب خداست و به مقادیر آنان نزد خداوند متعال. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند). جزء شانزدهم به پایان رسید و الحمد لله.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 3
}