{
  "id": 163,
  "title": {
    "ar": "الباب الثالث والستون ومائة في معرفة مقام الغني وأسراره",
    "en": "Chapter One Hundred and Sixty-Three: Concerning the Gnosis (معرفة) of the Station (مقام) of Self-Sufficiency (الغني) and its Secrets (أسرار)",
    "ur": "ایک سو تریسٹھواں باب: مقام الغنی (مقام الغني) اور اس کے اسرار کی معرفت (معرفة) کے بیان میں۔",
    "fa": "باب صد و شصت و سوم در معرفت مقام بی‌نیازی (الغني) و اسرار آن."
  },
  "content": {
    "ar": "## (الباب الثالث والستون ومائة في معرفة مقام الغني وأسراره)\n\n\n> إن الغني صفة سلبية ولذا *** تمتاز عن نسب الأسماء رتبتها\n\n\n> يخصه حكمها والعين في عدم *** منها وليس لها كون فينعتها\n\n\n> إن الدلالة في التحقيق مجهلة *** ممن يقول بها والعقل يثبتها\n\n\n> لذاك قال غني في تنزله *** عن عالم الكون جاءت فيه آيتها\n\n\n> في العنكبوت فدبره تجده على *** ما قلت من نفي ما تعطي دلالتها\n\n\n> وليس يعرف إلا من علامته *** دنيا وآخرة والشرع مثبتها\n\n\n### [أن الغنى صفة ذاتية لله تعالى‏]\n\n\nاعلم أيدك الله أن الغني صفة ذاتية للحق تعالى فإن الله لَهُوَ الْغَنِيُّ الْحَمِيدُ أي المثنى عليه بهذه الصفة وأما الغني للعبد فهو غنى النفس بالله عن العالمين‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ليس الغني عن كثرة العرض لكن الغني غنى النفس خرجه الترمذي‏\n\n\nوالعرض المال وهذه كلمة نبوية صحيحة فإن غنى الإنسان عن العالم لا يصح ويصح غناه عن‏\nالمال فإن الله سبحانه قد جعل مصالح العبد في استعمال أعيان بعض الأشياء وهي من العالم فلا غنى له عن استعمالها فلا غنى له عن العالم فلذلك خصصه بالمال فلا يوصف بالغنى عن العالم إلا الله تعالى من حيث ذاته جل وتعالى والغني في الإنسان من العالم فليس الإنسان بغني عن الغني فهو فقير إليه‏\n\n\n### [أن الغني والعزة صفتان لا يصح للعبد]\n\n\nواعلم أن الغني وإن كان بالله والعزة وإن كانت بالله فإنهما صفتان لا يصح للعبد أن يدخل بهما على الله تعالى وإن كان بالله فيهما فلا بد أن يتركهما فيدخل فقيرا ذليلا ومعنى الدخول التوجه إلى الله فلا يتوجه إلى الله بغناه به ولا بعزته به وإنما يتوجه إلى الله بذله وافتقاره فإن حضرة الحق لها الغيرة ذاتية فلا تقبل عزيزا ولا غنيا وهذا ذوق لا يقدر أحد على إنكاره من نفسه قال تعالى مؤدبا لنبيه صَلَّى اللهُ عَليهِ وسَلَّم في ظاهر الأمر وهو يؤدبنا به لنتعلم أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى فكان مشهود محمد صَلَّى اللهُ عَليهِ وسَلَّم الصفة الإلهية وهو الغني فتصدى لها لما تعطيه حقيقتها من الشرف والنبي في ذلك الوقت في حال الفقر في الدعوة إلى الله وأن تعم دعوته وعلم إن الرؤساء والأغنياء تبع الخلق لهم أكثر من تبع من ليس له هذا النعت فإذا أسلم من هذه صفته أسلم لإسلامه خلق كثير والنبي صَلَّى اللهُ عَليهِ وسَلَّم له على مثل هذا حرص عظيم وقد شهد الله تعالى عندنا له بذلك فقال عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ أي عنادكم يعز عليه للحق المبين حَرِيصٌ عَلَيْكُمْ في إن تسلموا وتنقادوا إلى ما فيه سعادتكم وهو الايمان بالله وما جاء من عند الله ومع هذا الحضور النبوي أوقع العتب عليه تعليما لنا وإيقاظا له فإن الإنسان محل الغفلات وهو فقير بالذات وقد استحق الجاه والمال أن يستغني بهما من قاما به ولذلك قال أَمَّا من اسْتَغْنى‏ وما قال أما من هو غني فإنه على التحقيق ليس بغني بل هو فقير لما استغنى به‏\n\n\nفقال صَلَّى اللهُ عَليهِ وسَلَّم إن الله أدبني فأحسن أدبي‏\n\n\n### [من مكارم الأخلاق الإقبال على الفقراء والإعراض عن الأغنياء]\n\n\nفمن مكارم الأخلاق الإقبال على الفقراء والإعراض عن الأغنياء بالعرض من جاه أو مال فإذا رى‏ء ممن هذه صفته الفقر والذلة بنزوله عن هاتين المرتبتين وجب على أهل الله الإقبال عليهم فإنهم إن أقبلوا عليهم وهم مستحضرون لما هم عليه من الجاه والمال تخيلوا أن إقبال أهل الله عليهم لجاههم ولمالهم فيزيدون رغبة في بقاء ما هم عليه فلذلك منع الله أهله أن يقبلوا عليهم إلا بصفة الزهد فيهم فإذا اجتمع في مجلس أهل الله من هو فقير ذليل منكسر وغني بماله ذو جاه في الدنيا أظهر القبول والإقبال على الفقير أكثر من إظهاره على الغني ذي الجاه لأنه المقصود بالأدب الذي أدب الله تعالى به نبيه صَلَّى اللهُ عَليهِ وسَلَّم غير إن صاحب هذه الصفة يحتاج إلى ميزان الحق في ذلك فإن غفل عنه كان الخطاء أسرع إليه من كل شي‏ء وصورة الوزن فيه أن لا يرى في نفسه شغفا عليه ولا يخاطبه أعني لا يخاطب هذا الغني ولا ذا الجاه بصفة قهر تذله فإنه لا يذل تحتها بل ينفر ويزيد عظمة وأنت مأمور بالدعوة إلى الله فادعوه كما أمر الله نبيه صَلَّى اللهُ عَليهِ وسَلَّم أن يدعو الناس تعليما له ولنا فإنا مخاطبون بالدعاء إلى الله كما قال أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وقال له ادْعُ إِلى‏ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ والْمَوْعِظَةِ الْحَسَنَةِ فإن جادلوك ف جادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ وقال لَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا من حَوْلِكَ هذه هي الصفة اللازمة التي ينبغي أن يكون الداعي عليها ولا يجعل في نفسه عند دعائه لمن هذه نعوته من عباد الله طمعا فيما في أيديهم من عرض الدنيا ولا فيما هو عليه من الجاه فإن العزة لله ولِرَسُولِهِ ولِلْمُؤْمِنِينَ فلا تخلعن ثوبا ألبسكه الله وليس له تصرف إلا في هذا الموطن فهذا معنى الحكمة وما عتب الله نبيه صَلَّى اللهُ عَليهِ وسَلَّم في الأول إلا لعزة قامت بنفس أولئك النفر مثل الأقرع بن حابس وغيره فقالوا لو أفرد لنا محمد مجلسا جلسنا إليه فإنا نأنف أن نجالس هؤلاء الأعبد يعنون بذلك بلالا وخبابا وغيرهما فرغب النبي صَلَّى اللهُ عَليهِ وسَلَّم لحرصه على إيمانهم ولعلمه أنه يرجع لرجوعهم إلى الله بشر كثير فأجابهم إلى ما سألوا وتصدى إليهم لما حضروا وأعرض عن الفقراء فانكسرت قلوبهم لذلك فأنزل الله ما أنزل جبرا لقلوب الفقراء فانكسر الباقي من نفوس أولئك الأغنياء الأعزاء\n\n\nوقيل له فَإِنَّما عَلَيْكَ الْبَلاغُ ولَيْسَ عَلَيْكَ هُداهُمْ ولكِنَّ الله يَهْدِي من يَشاءُ ونزل الله عليه عَبَسَ وتَوَلَّى الآيات وأنزل عليه واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ الآيات وفيها وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ ثم ذكر ما للظالمين عند الله في الآخرة فطريقة الإرشاد والدعاء إلى الله ميزانها الغني بالله عما في أيديهم وما يكون بسببهم فإن لم تكن في نفسك بهذه المثابة فلا تدع واشتغل بدعاء نفسك إلى الاتصاف بهذه الصفات المحمودة عند الله ولا تتعد الحد الذي أنت عليه ولا تخط في غير ما تملكه‏\nفتكون غاصبا والصلاة في الدار المغصوبة لا تجوز بخلاف والدعاء إلى الله صلاة والإخلاص فيها الحرية عن استرقاق من يدعوهم إليه فهذا هو محل الغني بالله وهنا يستعمل فإن عدلت به إلى غير هذا فقد أخسرت الميزان والله يقول ولا تُخْسِرُوا الْمِيزانَ وأَلَّا تَطْغَوْا في الْمِيزانِ فتخرجوه عن حده وهو قوله لا تَغْلُوا في دِينِكُمْ والغلو والطغيان هما الرفعة فوق الحد الذي يستحقه المتغالي فيه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter One Hundred and Sixty-Three: Concerning the Knowledge of the Station of Self-Sufficiency (مقام الغني) and its Secrets\n\nIndeed, Self-Sufficiency (الغني) is a Negative Attribute (صفة سلبية), and thus\nIts rank is distinguished from the relations of the Names.\n\nIts ruling is specific to Him, while the entity (العين) is in non-existence\nFrom it, and it has no being (كون) to describe it.\n\nIndeed, the indication (دلالة) in realization (تحقيق) is unknown\nTo those who speak of it, though the intellect affirms it.\n\nTherefore, He said, \"Self-Sufficient,\" in His transcendence (تنزله)\nFrom the world of contingent being (عالم الكون), wherein its verse came.\n\nIn *Al-Ankabut* (The Spider), so reflect upon it, and you will find it upon\nWhat I have said concerning the negation implied by its indication.\n\nAnd it is not known except through its sign\nIn this world and the Hereafter, and the Law (الشرع) affirms it.\n\n### That Self-Sufficiency is an Essential Attribute of God Almighty\n\nKnow, may Allah support you, that Self-Sufficiency (الغني) is an Essential Attribute (صفة ذاتية) of the Real (الحق) Almighty, for Allah is <<لَهُوَ الْغَنِيُّ الْحَمِيدُ>> (He is indeed the Self-Sufficient, the Praiseworthy), meaning, the One praised by this Attribute. As for the Self-Sufficiency of the servant (العبد), it is the soul’s independence through Allah from the worlds (العالمين).\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Self-Sufficiency is not due to an abundance of possessions (العرض), but true Self-Sufficiency is the Self-Sufficiency of the soul.\" (Reported by Al-Tirmidhi).\n\nPossessions (العرض) mean wealth. This is a sound prophetic statement, for the independence of the human being from the World (العالم) is not valid, though his independence from wealth (المال) is valid. Indeed, Allah, the Glorious, has placed the servant’s interests in the utilization of the entities (أعيان) of certain things, which belong to the World. Thus, the servant cannot dispense with their utilization, and therefore, he is not independent of the World. For this reason, the Prophet specified wealth (in the hadith). Therefore, none is described as being independent of the World except Allah Almighty, in respect of His Essence (ذاته), Glorious and Exalted is He. The Self-Sufficiency found in the human being is derived from the World, so the human being is not independent of the Self-Sufficient (الغني); rather, he is poor (فقير) toward Him.\n\n### That Self-Sufficiency and Might are two Attributes that are not proper for the servant\n\nKnow that even though Self-Sufficiency (الغني) is through Allah, and Might (العزة) is through Allah, they are two Attributes with which the servant cannot properly approach Allah Almighty. Even if he possesses them through Allah, he must abandon them and enter poor (فقيرا) and humble (ذليلا). The meaning of \"approaching\" (الدخول) is turning toward Allah. One should not turn toward Allah by means of his Self-Sufficiency through Him, nor by his Might through Him. Rather, he turns toward Allah through his humility (ذله) and his neediness (افتقاره). This is because the Divine Presence (حضرة الحق) possesses intrinsic Jealousy (الغيرة ذاتية); thus, it does not accept one who is mighty (عزيزا) or one who is self-sufficient (غنيا). This is a spiritual taste (ذوق) that no one can deny within himself. Allah Almighty said, disciplining His Prophet, peace and blessings be upon him, concerning an apparent matter—and He disciplines us through him so that we may learn: <<أَمَّا مَنِ اسْتَغْنَى فَأَنْتَ لَهُ تَصَدَّى>> (As for him who considers himself self-sufficient, to him you attend).\n\nThe object of Muhammad’s witnessing (مشهود) was the Divine Attribute, which is Self-Sufficiency (الغني), and he attended to it because of the honor that its reality confers. At that time, the Prophet was in a state of neediness (الفقر) regarding the call to Allah and the desire for his message to be widespread. He knew that the followers of the chiefs and the wealthy were more numerous than the followers of those who lacked this status. Thus, if a person of such status embraced Islam, many people would embrace Islam because of his conversion. The Prophet, peace and blessings be upon him, had a great eagerness (حرص عظيم) for this. Allah Almighty testified to this eagerness for us when He said: <<عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ>> (Grievous to him is what distresses you), meaning, your obstinacy is grievous to him, for the manifest Truth; <<حَرِيصٌ عَلَيْكُمْ>> (He is eager for you) to submit and yield to that which contains your happiness, which is faith in Allah and what came from Allah. Despite this prophetic presence, the reproach (العتب) was directed at him as a lesson for us and an awakening for him, for the human being is a locus of heedlessness (الغفلات) and is essentially poor (فقير بالذات). Status (الجاه) and wealth (المال) are worthy of being used for self-sufficiency by those who possess them. That is why He said, <<أَمَّا مَنِ اسْتَغْنَى>> (As for him who *considers himself* self-sufficient), and did not say, \"As for him who *is* self-sufficient,\" for in reality, he is not self-sufficient; rather, he is poor toward that by which he sought independence.\n\nThe Prophet, peace and blessings be upon him, said: \"Indeed, Allah disciplined me and perfected my discipline.\"\n\n### Among the Noble Character Traits is Turning Toward the Poor and Turning Away from the Wealthy\n\nAmong the noble character traits (مكارم الأخلاق) is turning toward the poor and turning away from the wealthy in terms of possessions, whether status (جاه) or wealth (مال). If poverty (الفقر) and humility (الذلة) are observed in a person of this description, by his descent from these two levels (status and wealth), then it is incumbent upon the People of Allah (أهل الله) to turn toward them. If the People of Allah turn toward the wealthy while the latter are mindful of their status and wealth, they will imagine that the People of Allah are turning toward them because of their status and wealth, thereby increasing their desire to maintain their current state. For this reason, Allah forbade His people from turning toward the wealthy except with the attribute of asceticism (الزهد) regarding them. If a gathering of the People of Allah includes someone who is poor, humble, and broken, alongside someone who is wealthy and possesses worldly status, they should show acceptance and attention to the poor person more than they show to the wealthy person of status, because the poor person is the intended recipient of the discipline (الأدب) with which Allah Almighty disciplined His Prophet, peace and blessings be upon him.\n\nHowever, the possessor of this attribute needs the Balance of the Real (ميزان الحق) in this matter, for if he is heedless of it, error will be swifter to him than anything else. The form of this balance is that he should not feel any attachment (شغفا) to the wealthy person in his soul, nor should he address him—meaning, he should not address this wealthy person or the person of status—with an attribute of subjugation (قهر) that humiliates him. For he will not be humbled by it; rather, he will be repelled and increase in arrogance. You are commanded to call to Allah, so call to Him as Allah commanded His Prophet, peace and blessings be upon him, to call people, as a lesson for him and for us. We are addressed with the call to Allah, as He said: <<أَدْعُوا إِلَى اللهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (Say: This is my way; I call to Allah upon clear insight—I and those who follow me). And He said to him: <<ادْعُ إِلَى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ>> (Call to the way of your Lord with wisdom and good instruction). And if they argue with you, then <<جَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ>> (argue with them in a way that is best). And He said: <<لَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا مِنْ حَوْلِكَ>> (If you had been rude [or] harsh in heart, they would have dispersed from around you). This is the necessary attribute upon which the caller should be. He should not harbor any greed (طمعا) in his soul, when calling those servants of Allah who possess these characteristics, for the worldly possessions in their hands, nor for the status they hold. For <<الْعِزَّةُ لِلَّهِ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ>> (Might belongs to Allah and to His Messenger and to the believers). So, do not cast off a garment with which Allah has clothed you, and which has no effect except in this station. This is the meaning of wisdom (الحكمة). Allah only reproached His Prophet, peace and blessings be upon him, initially because of the sense of might (عزة) that resided in the souls of those individuals, such as Al-Aqra’ ibn Habis and others. They said, \"If Muhammad would set aside a separate gathering for us, we would sit with him, for we disdain to sit with these slaves,\" meaning Bilal, Khabbab, and others. The Prophet, peace and blessings be upon him, desired this due to his eagerness for their faith and his knowledge that many people would return to Allah through their return. So, he granted their request and attended to them when they arrived, turning away from the poor. Their hearts were broken because of this. Then Allah revealed what He revealed, mending the hearts of the poor, and the remaining arrogance in the souls of those wealthy and mighty ones was broken.\n\nAnd it was said to him: <<فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَلَيْسَ عَلَيْكَ هُدَاهُمْ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ>> (Your duty is only the delivery [of the message], and their guidance is not incumbent upon you, but Allah guides whom He wills). And Allah revealed to him the verses: <<عَبَسَ وَتَوَلَّى>> (He frowned and turned away). And He revealed to him the verses: <<وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ>> (And keep yourself patient with those who call upon their Lord...). And within those verses: <<وَقُلِ الْحَقُّ مِنْ رَبِّكُمْ فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ>> (And say, \"The Truth is from your Lord,\" so whoever wills—let him believe; and whoever wills—let him disbelieve). Then He mentioned what awaits the wrongdoers (الظالمين) with Allah in the Hereafter. Thus, the path of guidance (الإرشاد) and the call to Allah (الدعاء إلى الله) has as its balance (ميزانها) Self-Sufficiency through Allah (الغني بالله) from what is in their hands and what comes about through them. If you are not inwardly established in this station, then do not call others, but busy yourself with calling your own soul to be characterized by these praiseworthy attributes before Allah. Do not transgress the limit (الحد) upon which you stand, nor step into what you do not possess.\n\nOtherwise, you would be an usurper (غاصبا), and prayer in a usurped house is not permissible. The call to Allah is a prayer (صلاة), and sincerity (الإخلاص) within it is freedom from the enslavement of those whom one calls to Him. This is the locus of Self-Sufficiency through Allah (الغني بالله), and here it is employed. If you deviate with it to anything else, you have diminished the balance (أخسرت الميزان). Allah says: <<وَلَا تُخْسِرُوا الْمِيزَانَ>> (And do not diminish the balance), and <<أَلَّا تَطْغَوْا فِي الْمِيزَانِ>> (That you not transgress the balance), thereby taking it beyond its limit, which is His saying: <<لَا تَغْلُوا فِي دِينِكُمْ>> (Do not exceed the limits in your religion). Exceeding the limits (الغلو) and transgression (الطغيان) are the elevation above the limit deserved by that in which one exceeds the limit. And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "(باب ایک سو تریسٹھ: مقام غنیٰ [Al-Ghinā] اور اس کے اسرار کی معرفت میں)\n\nبے نیازی (الغنی) ایک صفت سلبیہ ہے، اسی لیے\nاس کا مرتبہ اسماء کے نسب سے ممتاز ہے۔\nاس کا حکم اسے خاص کرتا ہے، جبکہ اس کی عین (حقیقت) اس سے عدم میں ہے،\nاور اس کا کوئی وجود نہیں ہے جو اسے بیان کرے۔\nتحقیق میں، اس کی دلالت اس شخص کے لیے مجہول ہے جو اس کا قائل ہے، جبکہ عقل اسے ثابت کرتی ہے۔\nاسی لیے (ذات حق) نے اپنے تنزل میں خود کو غنیٰ کہا،\nعالمِ کون سے متعلق اس کی آیت (قرآن میں) آئی ہے۔\nسورۃ العنکبوت میں، پس اس پر غور کرو، تم اسے اسی طرح پاؤ گے\nجیسا کہ میں نے کہا کہ یہ اس چیز کی نفی کرتی ہے جس پر اس کی دلالت ہے۔\nاور اسے دنیا اور آخرت میں صرف اس کی علامت سے پہچانا جاتا ہے، اور شریعت اسے ثابت کرتی ہے۔\n\n[کہ غنیٰ حق تعالیٰ کی صفات ذاتیہ میں سے ہے]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ غنیٰ (بے نیازی) حق تعالیٰ کی صفات ذاتیہ میں سے ہے۔ کیونکہ اللہ ہی ہے: لَهُوَ الْغَنِيُّ الْحَمِيدُ (وہی بے نیاز، قابل تعریف ہے) یعنی وہ ذات جس کی اس صفت کے ساتھ تعریف کی جاتی ہے۔ اور بندے کے لیے غنیٰ (بے نیازی) یہ ہے کہ وہ اللہ کے ذریعے تمام جہانوں سے بے نیاز ہو جائے۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ليس الغني عن كثرة العرض لكن الغني غنى النفس (غنیٰ مال و متاع کی کثرت سے نہیں ہوتا، بلکہ غنیٰ نفس کی بے نیازی ہے)۔ اسے ترمذی نے روایت کیا ہے۔\n\nاور \"العرض\" سے مراد مال ہے۔ یہ ایک صحیح نبوی کلمہ ہے۔ کیونکہ انسان کا عالم (کائنات) سے بے نیاز ہونا درست نہیں، البتہ اس کا مال سے بے نیاز ہونا درست ہے۔ اس لیے کہ اللہ سبحانہ و تعالیٰ نے بندے کے مصالح بعض اشیاء کے استعمال میں رکھے ہیں، اور وہ اشیاء عالم کا حصہ ہیں۔ لہٰذا بندے کے لیے ان کے استعمال سے بے نیازی نہیں ہے، پس وہ عالم سے بے نیاز نہیں ہو سکتا۔ اسی لیے (نبی صلی اللہ علیہ وسلم نے) اسے مال کے ساتھ خاص کیا (کہ مال سے بے نیازی غنیٰ ہے)۔ پس عالم سے بے نیازی کی صفت صرف اللہ تعالیٰ کے لیے ہی بیان کی جا سکتی ہے، اس کی ذات کے اعتبار سے، جو جلیل اور بلند ہے۔ اور انسان میں غنیٰ عالم سے متعلق ہے، پس انسان غنیٰ (ذات حق) سے بے نیاز نہیں ہے، بلکہ وہ اس کا محتاج ہے۔\n\n[کہ غنیٰ اور عزت دو ایسی صفات ہیں جو بندے کے لیے درست نہیں]\n\nجان لیجیے کہ اگرچہ غنیٰ (بے نیازی) اللہ کے ذریعے ہے اور عزت بھی اللہ کے ذریعے ہے، لیکن یہ دونوں ایسی صفات ہیں جن کے ساتھ بندے کے لیے حق تعالیٰ پر داخل ہونا درست نہیں، اگرچہ وہ ان دونوں میں اللہ کے ذریعے ہی ہو۔ اسے لازم ہے کہ وہ ان دونوں کو چھوڑ دے اور فقیر و ذلیل ہو کر داخل ہو۔ اور \"داخل ہونے\" کا مطلب اللہ کی طرف متوجہ ہونا ہے۔ پس وہ اللہ کی طرف اپنی بے نیازی یا اپنی عزت کے ساتھ متوجہ نہ ہو، بلکہ وہ اللہ کی طرف اپنی ذلت اور اپنی محتاجی کے ساتھ متوجہ ہو۔ کیونکہ حضرۃ الحق (ذات حق) کے لیے ذاتی غیرت (الغيرة الذاتية) ہے، پس وہ کسی عزیز یا غنیٰ کو قبول نہیں کرتی۔ اور یہ ایک ایسا ذوق ہے جس کا انکار کوئی شخص اپنے نفس سے نہیں کر سکتا۔ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو ظاہری طور پر ادب سکھاتے ہوئے فرمایا، اور وہ اس کے ذریعے ہمیں ادب سکھا رہا ہے تاکہ ہم سیکھیں: أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى (جس نے بے نیازی اختیار کی، تو آپ اس کی طرف متوجہ ہوئے)۔ محمد صلی اللہ علیہ وسلم کا مشہود (شہود) صفت الٰہیہ تھی، جو کہ غنیٰ (بے نیازی) ہے، پس آپ نے اس کی طرف توجہ کی اس شرف کی وجہ سے جو اس کی حقیقت عطا کرتی ہے۔ اور نبی صلی اللہ علیہ وسلم اس وقت اللہ کی طرف دعوت دینے میں فقر کی حالت میں تھے، اور آپ چاہتے تھے کہ آپ کی دعوت عام ہو، اور آپ جانتے تھے کہ رؤسا اور مالداروں کی پیروی عام لوگوں کی پیروی سے زیادہ ہوتی ہے، پس جب ایسا شخص اسلام قبول کر لے گا تو اس کے اسلام لانے کی وجہ سے بہت سی مخلوق اسلام قبول کر لے گی۔ اور نبی صلی اللہ علیہ وسلم کو اس پر بہت زیادہ حرص تھی۔ اور اللہ تعالیٰ نے ہمارے نزدیک اس کی گواہی دی ہے، پس فرمایا: عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ (تمہاری مشقت میں پڑنا اس پر گراں ہے) یعنی تمہاری سرکشی اس پر گراں گزرتی ہے، حق مبین کے لیے حَرِيصٌ عَلَيْكُمْ (وہ تمہارے لیے حریص ہیں) کہ تم اسلام لاؤ اور اس چیز کی طرف جھک جاؤ جس میں تمہاری سعادت ہے، اور وہ اللہ پر ایمان لانا اور جو کچھ اللہ کی طرف سے آیا ہے۔ اس نبوی حضور کے باوجود، اللہ نے آپ پر عتاب نازل کیا تاکہ ہمیں تعلیم دے اور آپ کو بیدار کرے، کیونکہ انسان غفلتوں کا محل ہے اور وہ بالذات فقیر ہے۔ اور بلاشبہ جاہ اور مال اس بات کے مستحق ہیں کہ جو شخص ان کا حامل ہو وہ ان کے ذریعے بے نیازی اختیار کرے۔ اسی لیے اللہ نے فرمایا: أَمَّا من اسْتَغْنَى (جس نے بے نیازی اختیار کی) اور یہ نہیں فرمایا: \"اما من هو غني\" (جو غنیٰ ہے)، کیونکہ درحقیقت وہ غنیٰ نہیں ہے بلکہ وہ اس چیز کی وجہ سے فقیر ہے جس کے ذریعے اس نے بے نیازی اختیار کی۔\n\nپس آپ صلی اللہ علیہ وسلم نے فرمایا: إن الله أدبني فأحسن أدبي (بیشک اللہ نے مجھے ادب سکھایا اور بہترین ادب سکھایا)۔\n\n[مکارم اخلاق میں سے فقراء کی طرف متوجہ ہونا اور مالداروں سے اعراض کرنا ہے]\n\nپس مکارم اخلاق میں سے فقراء کی طرف متوجہ ہونا اور مال و جاہ کے دنیاوی ساز و سامان (العرض) کی وجہ سے مالداروں سے اعراض کرنا ہے۔ پس جب کسی شخص میں فقر اور ذلت کی صفت دیکھی جائے، ان دونوں مرتبوں (مال و جاہ) سے نیچے اترنے کی وجہ سے، تو اہل اللہ پر ان کی طرف متوجہ ہونا واجب ہے۔ کیونکہ اگر اہل اللہ ان کی طرف متوجہ ہوں گے جبکہ وہ اپنے جاہ اور مال کو حاضر رکھے ہوئے ہیں، تو وہ یہ گمان کریں گے کہ اہل اللہ کا ان کی طرف متوجہ ہونا ان کے جاہ اور مال کی وجہ سے ہے، پس وہ اس چیز کے باقی رہنے کی رغبت میں بڑھ جائیں گے جس پر وہ ہیں۔ اسی لیے اللہ نے اپنے اہل کو منع فرمایا کہ وہ ان کی طرف متوجہ ہوں مگر ان سے زہد کی صفت کے ساتھ۔ پس جب اہل اللہ کی مجلس میں کوئی فقیر، ذلیل، شکستہ دل اور کوئی مالدار، دنیا میں صاحب جاہ جمع ہو جائیں، تو فقیر کی طرف قبولیت اور توجہ کا اظہار اس مالدار صاحب جاہ کی نسبت زیادہ کیا جائے گا، کیونکہ وہ اس ادب کا مقصود ہے جس کا ادب اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو سکھایا۔ تاہم، اس صفت کے حامل شخص کو اس معاملے میں میزان الحق (حق کا ترازو) کی ضرورت ہوتی ہے، کیونکہ اگر وہ اس سے غافل ہو گیا تو غلطی ہر چیز سے زیادہ تیزی سے اس کی طرف آئے گی۔ اور اس میں وزن کی صورت یہ ہے کہ وہ اپنے نفس میں ان کی طرف کوئی رغبت نہ دیکھے، اور نہ ہی ان سے مخاطب ہو—یعنی نہ اس مالدار سے اور نہ ہی اس صاحب جاہ سے—کسی ایسی قہر کی صفت کے ساتھ جو اسے ذلیل کرے، کیونکہ وہ اس کے تحت ذلیل نہیں ہو گا بلکہ وہ متنفر ہو گا اور اس کی عظمت میں اضافہ ہو جائے گا۔ اور آپ کو اللہ کی طرف دعوت دینے کا حکم دیا گیا ہے، پس انہیں اسی طرح دعوت دیں جس طرح اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو لوگوں کو دعوت دینے کا حکم دیا، جو آپ کے لیے اور ہمارے لیے تعلیم ہے۔ کیونکہ ہمیں اللہ کی طرف دعوت دینے کا حکم دیا گیا ہے، جیسا کہ فرمایا: أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي (میں اور میرے پیروکار بصیرت کے ساتھ اللہ کی طرف بلاتے ہیں)۔ اور آپ سے فرمایا: ادْعُ إِلى‏ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ والْمَوْعِظَةِ الْحَسَنَةِ (اپنے رب کے راستے کی طرف حکمت اور اچھی نصیحت کے ساتھ بلائیے)۔ اور اگر وہ آپ سے جھگڑا کریں تو: جادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ (ان سے اس طریقے سے بحث کیجیے جو سب سے بہتر ہو)۔ اور فرمایا: لَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا من حَوْلِكَ (اگر آپ تند مزاج اور سخت دل ہوتے تو وہ آپ کے ارد گرد سے منتشر ہو جاتے)۔ یہ وہ لازمی صفت ہے جس پر داعی کو ہونا چاہیے، اور وہ اللہ کے بندوں میں سے ان لوگوں کو دعوت دیتے وقت جن کی یہ صفات ہیں، اپنے نفس میں ان کے ہاتھوں میں موجود دنیاوی ساز و سامان (عرض) یا ان کے جاہ کی کوئی طمع نہ رکھے۔ کیونکہ عزت اللہ کے لیے ہے، ولِرَسُولِهِ ولِلْمُؤْمِنِينَ (اور اس کے رسول کے لیے اور مومنوں کے لیے ہے)۔ پس اس لباس کو نہ اتاریں جو اللہ نے آپ کو پہنایا ہے، اور اس کا تصرف صرف اسی مقام پر ہے۔ پس یہ حکمت کا معنی ہے۔ اور اللہ نے اپنے نبی صلی اللہ علیہ وسلم پر پہلے عتاب صرف اس عزت کی وجہ سے کیا جو ان چند افراد، جیسے اقرع بن حابس وغیرہ، کے نفس میں قائم تھی۔ انہوں نے کہا: اگر محمد ہمارے لیے ایک الگ مجلس مقرر کر دیں تو ہم ان کے پاس بیٹھیں گے، کیونکہ ہم ان غلاموں کے ساتھ بیٹھنے سے نفرت کرتے ہیں، ان کا مطلب بلال اور خباب وغیرہ سے تھا۔ نبی صلی اللہ علیہ وسلم نے ان کے ایمان کی حرص کی وجہ سے اور یہ جاننے کی وجہ سے کہ ان کے اللہ کی طرف رجوع کرنے سے بہت سے لوگ رجوع کریں گے، رغبت فرمائی۔ پس آپ نے ان کی درخواست قبول کر لی اور جب وہ حاضر ہوئے تو ان کی طرف متوجہ ہوئے اور فقراء سے اعراض کیا، جس سے ان کے دل ٹوٹ گئے۔ پس اللہ نے وہ نازل فرمایا جو فقراء کے دلوں کو تسلی دینے کے لیے نازل کیا، اور ان مالدار اور معزز لوگوں کے نفوس کا باقی ماندہ حصہ بھی ٹوٹ گیا۔\n\nاور آپ سے کہا گیا: فَإِنَّما عَلَيْكَ الْبَلاغُ ولَيْسَ عَلَيْكَ هُداهُمْ ولكِنَّ الله يَهْدِي من يَشاءُ (آپ پر صرف پہنچا دینا ہے، ان کو ہدایت دینا آپ کے ذمے نہیں، لیکن اللہ جسے چاہتا ہے ہدایت دیتا ہے)۔ اور اللہ نے آپ پر عَبَسَ وتَوَلَّى (اس نے تیوری چڑھائی اور منہ موڑا) کی آیات نازل فرمائیں، اور آپ پر واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ (اور اپنے آپ کو ان لوگوں کے ساتھ روکے رکھیے جو صبح و شام اپنے رب کو پکارتے ہیں) کی آیات نازل فرمائیں، اور ان میں یہ بھی ہے: وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ (اور کہہ دیجیے کہ حق تمہارے رب کی طرف سے ہے، پس جو چاہے ایمان لائے اور جو چاہے کفر کرے)۔ پھر اللہ نے آخرت میں ظالموں کے لیے جو کچھ ہے اس کا ذکر کیا۔ پس ارشاد اور اللہ کی طرف دعوت کا طریقہ یہ ہے کہ اس کا میزان (ترازو) اللہ کے ذریعے اس چیز سے بے نیازی (الغنی باللہ) ہے جو ان کے ہاتھوں میں ہے اور جو ان کی وجہ سے حاصل ہو سکتا ہے۔ اگر آپ اپنے نفس میں اس مرتبے پر نہیں ہیں تو دعوت نہ دیں، اور اپنے نفس کو ان صفات محمودہ (قابل تعریف صفات) سے متصف کرنے میں مشغول ہوں جو اللہ کے نزدیک پسندیدہ ہیں۔ اور اس حد سے تجاوز نہ کریں جس پر آپ ہیں، اور اس چیز میں قدم نہ رکھیں جس کے آپ مالک نہیں ہیں۔\nپس آپ غاصب ہوں گے، اور غصب شدہ گھر میں نماز جائز نہیں ہے، اس کے برعکس (دعوت الی اللہ)۔ اور اللہ کی طرف دعوت دینا ایک نماز ہے، اور اس میں اخلاص یہ ہے کہ جنہیں وہ دعوت دے رہا ہے ان کی غلامی سے آزادی ہو۔ پس یہ غنیٰ باللہ (اللہ کے ذریعے بے نیازی) کا محل ہے اور یہیں اسے استعمال کیا جاتا ہے۔ اگر آپ اسے اس کے علاوہ کسی اور طرف مائل کریں گے تو آپ نے میزان میں کمی کی، اور اللہ فرماتا ہے: ولا تُخْسِرُوا الْمِيزانَ (اور میزان میں کمی نہ کرو) اور أَلَّا تَطْغَوْا في الْمِيزانِ (اور میزان میں حد سے تجاوز نہ کرو) تاکہ تم اسے اس کی حد سے باہر نہ نکالو، اور وہ اس کا یہ قول ہے: لا تَغْلُوا في دِينِكُمْ (اپنے دین میں غلو نہ کرو)۔ اور غلو اور طغیان اس حد سے اوپر اٹھنا ہے جس کا مستحق وہ شخص ہے جس میں غلو کیا جا رہا ہے۔ اور وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب صد و شصت و سوم در معرفت مقام غنا (الغني) و اسرار آن\n\nغنا (الغني) صفتی سلبی است و از این رو *** رتبه‌اش از نسبت‌های اسماء متمایز است\nحکم آن مخصوص اوست و عین (العین) در عدم *** از آن است و وجودی ندارد که آن را وصف کند\nدلالت آن در تحقیق، برای کسی که به آن قائل است، مجهول است *** و عقل آن را اثبات می‌کند\nاز این رو، در تنزیه (تنزل) خود فرمود: غنی *** آیه آن از عالم هستی (الکون) آمده است\nدر سوره عنکبوت است، پس در آن تدبر کن تا آن را *** بر آنچه گفتم بیابی، یعنی نفی آنچه دلالتش می‌بخشد\nو شناخته نمی‌شود مگر از نشانه‌اش *** در دنیا و آخرت، و شریعت آن را اثبات می‌کند.\n\n### [غنا (الغنى) صفتی ذاتی برای حق تعالی است]\n\nبدان، خداوند تو را تأیید کند، که غنا (الغني) صفتی ذاتی (صفة ذاتية) برای حق تعالی (الحق تعالی) است، زیرا خداوند: لَهُوَ الْغَنِيُّ الْحَمِيدُ (اوست بی‌نیاز ستوده)، یعنی کسی که به این صفت ستایش شده است. اما غنا برای بنده، غنای نفس به واسطه خداوند از عالمیان است.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: ليس الغني عن كثرة العرض لكن الغني غنى النفس (غنا به فراوانی متاع دنیا (العرض) نیست، بلکه غنا، غنای نفس است). (ترمذی آن را روایت کرده است).\n\nو متاع دنیا (العرض) همان مال است. این سخنی نبوی و صحیح است، زیرا بی‌نیازی انسان از عالم صحیح نیست، اما بی‌نیازی او از مال صحیح است. چرا که خداوند سبحان مصالح بنده را در استفاده از اعیان برخی اشیاء قرار داده است و این اشیاء از عالم هستند، پس بنده از استفاده از آن‌ها بی‌نیاز نیست و در نتیجه از عالم بی‌نیاز نیست. به همین دلیل، غنا را به مال اختصاص داد. پس جز خداوند متعال، از حیث ذاتش، کسی به بی‌نیازی از عالم وصف نمی‌شود. و غنا در انسان از عالم است، پس انسان از غنی (الحق) بی‌نیاز نیست، بلکه فقیر و نیازمند اوست.\n\n### [غنا (الغني) و عزت (العزة) دو صفتی هستند که برای بنده صحیح نیستند]\n\nو بدان که غنا (الغني) اگرچه به واسطه خداست، و عزت (العزة) اگرچه به واسطه خداست، اما این دو صفتی هستند که برای بنده صحیح نیست که با آن‌ها بر خداوند متعال وارد شود. اگرچه بنده به واسطه خدا در این دو صفت باشد، اما ناگزیر است که آن‌ها را ترک کند و فقیر و ذلیل وارد شود. و معنای ورود، توجه به خداست. پس با غنای خود به واسطه او، و با عزت خود به واسطه او، به خدا توجه نمی‌کند، بلکه با خواری (الذل) و نیازمندی (الافتقار) خود به خدا توجه می‌کند. زیرا حضرت حق (الحق) دارای غیرت ذاتی است و عزیز و غنی را نمی‌پذیرد. این یک ذوق (ذوق) عرفانی است که هیچ کس نمی‌تواند آن را در درون خود انکار کند. خداوند متعال در ظاهر امر، پیامبرش (صلی الله علیه و سلم) را ادب کرد و در واقع ما را ادب می‌کند تا بیاموزیم: أَمَّا من اسْتَغْنى‏ فَأَنْتَ لَهُ تَصَدَّى (اما آن کس که خود را بی‌نیاز می‌بیند، تو به او روی می‌آوری). پس مشهود محمد (صلی الله علیه و سلم) صفت الهی، یعنی غنی (الغني)، بود. او به دلیل شرافتی که حقیقت این صفت می‌بخشید، به آن روی آورد. و پیامبر در آن زمان در حال فقر (الفقر) در دعوت به سوی خدا بود و می‌خواست دعوتش فراگیر شود. او می‌دانست که تبعیت مردم از رؤسا و ثروتمندان بیشتر از تبعیت از کسانی است که این صفت را ندارند. پس اگر کسی با این صفت اسلام آورد، به واسطه اسلام آوردن او خلق بسیاری اسلام می‌آورند. و پیامبر (صلی الله علیه و سلم) بر چنین امری حرص عظیمی داشت. و خداوند متعال نزد ما بر این امر برای او شهادت داده و فرموده است: عَزِيزٌ عَلَيْهِ ما عَنِتُّمْ (آنچه شما را به رنج می‌اندازد بر او گران است)، یعنی عناد شما بر او به خاطر حق آشکار گران است، حَرِيصٌ عَلَيْكُمْ (بر شما حریص است) که اسلام بیاورید و تسلیم شوید به آنچه سعادت شما در آن است، یعنی ایمان به خدا و آنچه از نزد خدا آمده است. با وجود این حضور نبوی، عتاب بر او واقع شد تا ما را تعلیم دهد و او را بیدار سازد. زیرا انسان جایگاه غفلت‌هاست و ذاتاً فقیر است. و جاه و مال سزاوار آن است که هر کس آن‌ها را داشته باشد، به واسطه آن‌ها احساس بی‌نیازی کند. به همین دلیل فرمود: أَمَّا من اسْتَغْنى‏ (اما آن کس که خود را بی‌نیاز دید) و نفرمود: اما آن کس که غنی است. زیرا در حقیقت او غنی نیست، بلکه به واسطه آنچه خود را به آن بی‌نیاز دیده، فقیر است.\n\nپس فرمود (صلی الله علیه و سلم): إن الله أدبني فأحسن أدبي (همانا خداوند مرا ادب کرد و نیکو ادب کردنم).\n\n### [از مکارم اخلاق، روی آوردن به فقرا و روی گرداندن از اغنیا است]\n\nپس از مکارم اخلاق، روی آوردن به فقرا و روی گرداندن از اغنیا به سبب متاع دنیوی از جاه یا مال است. پس اگر در کسی که این صفت اوست، فقر و خواری (الذلة) دیده شود، به واسطه نزول او از این دو مرتبه، بر اهل الله واجب است که به او روی آورند. زیرا اگر اهل الله به اغنیا روی آورند در حالی که آن‌ها جاه و مال خود را حاضر می‌بینند، گمان می‌کنند که روی آوردن اهل الله به خاطر جاه و مال آن‌هاست، و در نتیجه رغبتشان به بقای آنچه دارند بیشتر می‌شود. به همین دلیل، خداوند اهل خود را منع کرد که به اغنیا روی آورند مگر با صفت زهد (الزهد) نسبت به آن‌ها. پس اگر در مجلس اهل الله، فردی فقیر، ذلیل و دل‌شکسته و فردی غنی به مال و صاحب جاه دنیوی جمع شوند، باید پذیرش و روی آوردن به فقیر را بیشتر از روی آوردن به غنی صاحب جاه آشکار سازد. زیرا این همان مقصود از ادبی است که خداوند متعال پیامبرش (صلی الله علیه و سلم) را به آن ادب کرد. با این حال، صاحب این صفت نیازمند میزان حق (میزان الحق) در این امر است؛ زیرا اگر از آن غافل شود، خطا سریع‌تر از هر چیز دیگری به او روی می‌آورد. و صورت وزن در این امر آن است که در نفس خود هیچ شیفتگی نسبت به او نبیند و با او سخن نگوید—یعنی با این غنی و صاحب جاه—با صفتی از قهر که او را خوار سازد. زیرا او تحت آن خوار نمی‌شود، بلکه رمیده و بر عظمتش افزوده می‌شود. و تو مأمور به دعوت به سوی خدا هستی، پس او را دعوت کن همان‌گونه که خداوند پیامبرش (صلی الله علیه و سلم) را امر کرد که مردم را دعوت کند، برای تعلیم او و ما. زیرا ما مخاطب به دعوت به سوی خدا هستیم، چنانکه فرمود: أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي (من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم). و به او فرمود: ادْعُ إِلى‏ سَبِيلِ رَبِّكَ بِالْحِكْمَةِ والْمَوْعِظَةِ الْحَسَنَةِ (به راه پروردگارت با حکمت و اندرز نیکو دعوت کن). پس اگر با تو مجادله کردند: جادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ (با نیکوترین شیوه با آنان مجادله کن). و فرمود: لَوْ كُنْتَ فَظًّا غَلِيظَ الْقَلْبِ لَانْفَضُّوا من حَوْلِكَ (اگر تندخو و سخت‌دل بودی، از اطراف تو پراکنده می‌شدند). این همان صفت لازمی است که داعی باید بر آن باشد. و هنگام دعوت کسانی از بندگان خدا که دارای این اوصاف هستند، در نفس خود طمعی به متاع دنیوی که در دست آن‌هاست، یا به جاهی که دارند، قرار ندهد. زیرا العزة (عزت) از آن خدا و از آن رسول او و از آن مؤمنان است. پس جامه‌ای را که خدا بر تو پوشانده است، از تن مکن، و این جامه جز در این موطن (مقام) تصرفی ندارد. این معنای حکمت است. و خداوند پیامبرش (صلی الله علیه و سلم) را در ابتدا عتاب نکرد مگر به دلیل عزتی که در نفس آن افراد، مانند اقرع بن حابس و دیگران، وجود داشت. آن‌ها گفتند: اگر محمد مجلسی را برای ما جدا کند، نزد او می‌نشینیم، زیرا ما از همنشینی با این بردگان، یعنی بلال و خباب و دیگران، ننگ داریم. پیامبر (صلی الله علیه و سلم) به دلیل حرصش بر ایمان آن‌ها و علمش به اینکه با بازگشت آن‌ها به سوی خدا، خلق بسیاری باز می‌گردند، رغبت نشان داد. پس خواسته آن‌ها را اجابت کرد و هنگامی که حاضر شدند، به آن‌ها روی آورد و از فقرا روی گرداند. در نتیجه دل‌های فقرا شکست. پس خداوند آنچه را نازل کرد تا دل‌های فقرا را جبران کند، و باقی‌مانده نفوس آن اغنیای عزیز نیز شکسته شد.\n\nو به او گفته شد: فَإِنَّما عَلَيْكَ الْبَلاغُ ولَيْسَ عَلَيْكَ هُداهُمْ ولكِنَّ الله يَهْدِي من يَشاءُ (جز این نیست که بر عهده تو رساندن پیام است و هدایت آن‌ها بر عهده تو نیست، بلکه خداوند هر که را بخواهد هدایت می‌کند). و خداوند آیات عَبَسَ وتَوَلَّى (چهره درهم کشید و روی گرداند) را بر او نازل کرد. و نیز بر او نازل کرد: واصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُمْ (و خود را با کسانی که پروردگارشان را می‌خوانند شکیبا ساز) تا آخر آیات. و در آن آیات است: وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ (و بگو: حق از جانب پروردگار شماست، پس هر که می‌خواهد ایمان بیاورد و هر که می‌خواهد کفر ورزد). سپس آنچه را که برای ستمکاران نزد خدا در آخرت است، ذکر کرد. پس روش ارشاد و دعوت به سوی خدا، میزانش غنا (الغني بالله) به واسطه خداست از آنچه در دست مردم است و آنچه به سبب آن‌ها حاصل می‌شود. اگر در نفس خود به این مرتبه نرسیده‌ای، دعوت مکن و به دعوت نفس خود به آراسته شدن به این صفات ستوده نزد خدا مشغول شو. و از حدی که بر آن هستی تجاوز مکن و در غیر آنچه مالک آن هستی، قدم مگذار.\nدر این صورت غاصب خواهی بود، و نماز در خانه غصبی جایز نیست. و دعوت به سوی خدا نماز است، و اخلاص در آن، آزادی از به بردگی گرفتن کسانی است که آن‌ها را به سوی خدا دعوت می‌کنی. این محل غنا (الغني بالله) به واسطه خداست و در اینجا باید به کار رود. اگر آن را به غیر از این منحرف سازی، میزان را زیان رسانده‌ای. و خداوند می‌فرماید: ولا تُخْسِرُوا الْمِيزانَ (و در میزان زیان نرسانید) و أَلَّا تَطْغَوْا في الْمِيزانِ (و در میزان طغیان نکنید) تا آن را از حدش خارج سازید، که همان فرموده اوست: لا تَغْلُوا في دِينِكُمْ (در دین خود غلو نکنید). و غلو و طغیان، همان بالا بردن چیزی بیش از حدی است که مستحق آن است. و خداوند الْحَقَّ يَقُولُ (حق را می‌گوید) و هُوَ يَهْدِي السَّبِيلَ (او راه را می‌نمایاند)."
  },
  "page_count": 3
}