{
  "id": 16,
  "title": {
    "ar": "الباب السادس عشر في معرفة المنازل السفلية والعلوم الكونية",
    "en": "Chapter Sixteen: Concerning the Knowledge of the Lower Stations and the Cosmic Sciences.",
    "ur": "باب سولہواں: نچلی منازل (المنازل السفلية) کی معرفت اور کونیاتی علوم (العلوم الكونية) کے بیان میں۔",
    "fa": "باب شانزدهم در معرفت منازل سُفلی و علوم کونی (العلوم الكونية)"
  },
  "content": {
    "ar": "## «الباب السادس عشر» في معرفة المنازل السفلية والعلوم الكونية\n\n\nومبدأ معرفة الله منها ومعرفة الأوتاد والأبدال ومن تولاهم من الأرواح العلوية وترتيب أفلاكها\n\n\n> علم الكثائف أعلام مرتبة *** هي الدليل على المطلوب للرسل‏\n\n\n> وهي التي حجبت أسرار ذي عمه *** وهي التي كشفت معالم السبل‏\n\n\n> لها من العالم العلوي سبعته *** من الهلال وخذ علوا إلى زحل‏\n\n\n> شلو لا الذي أوجد الأوتاد أربعة *** رسى بها الأرض فابتزت من الميل‏\n\n\n> لما استقر عليها من يكون بها *** فأعجب له مثلا ناهيك من مثل‏\n\n\n### [منافذ الشيطان الأربعة من جهات الإنسان الأربعة]\n\n\nاعلم أيدك الله أنا قد ذكرنا في الباب الذي قبل هذا منازل الأبدال ومقاماتهم ومن تولاهم من الأرواح العلوية وترتيب أفلاكها وما للنيرات فيهم من الآثار وما لهم من الأقاليم فلنذكر في هذا الباب ما بقي مما ترجمت عليه المنازل السفلية هنا عبارة عن الجهات الأربع التي يأتي منها الشيطان إلى الإنسان وسميناها سفلية لأن الشيطان من عالم السفل فلا يأتي إلى الإنسان إلا من المنازل التي تناسبه وهي اليمين والشمال والخلف والأمام قال تعالى ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ‏\nويستعين على الإنسان بالطبع فإنه المساعد له فيما يدعوه إليه من اتباع الشهوات فأمر الإنسان أن يقاتله من هذه الجهات وأن يحصن هذه الجهات بما أمره الشرع أن يحصنها به حتى لا يجد الشيطان إلى الدخول إليه منها سبيلا فإن جاءك من بين يديك وطردته لاحت لك من العلوم علوم النور منة من الله عليك وجزاء حيث آثرت جناب الله على هواك وعلوم النور على قسمين علوم كشف وعلوم برهان بصحيح فكر فيحصل له من طريق البرهان ما يرد به الشبه المضلة القادحة في وجود الحق وتوحيده وأسمائه وأفعاله فبالبرهان يرد على المعطلة ويدل على إثبات وجود الإله وبه يرد على أهل الشرك الَّذِينَ يَجْعَلُونَ مَعَ الله إِلهاً آخَرَ ويدل على توحيد الإله من كونه إلها وبه يرد على من ينفي أحكام الأسماء الإلهية وصحة آثارها في الكون ويدل على إثباتها بالبرهان السمعي من طريق الإطلاق وبالبرهان العقلي من طريق المعاني وبه يرد على نفاة الأفعال من الفلاسفة ويدل على أنه سبحانه فاعل وأن المفعولات مرادة له سمعا وعقلا وأما علوم الكشف فهو ما يحصل له من المعارف الإلهية في التجليات في المظاهر وإن جاءك من خلفك وهو ما يدعوك إليه أن تقول على الله ما لا تعلم وتدعى النبوة والرسالة وإن الله قد أوحي إليك وذلك أن الشيطان إنما ينظر في كل ملة كل صفة علق الشارع المذمة عليها في تلك الأمة فيأمرك بها وكل صفة علق المحمدة عليها نهاك عنها هذا على الإطلاق والملك على النقيض منه يأمرك بالمحمود منها وينهاك عن المذموم فإذا طردته من خلفك لاحت لك علوم الصدق ومنازله وأين ينتهي بصاحبه كما قال تعالى في مَقْعَدِ صِدْقٍ إلا أن ذلك صدقهم هو الذي أقعدهم ذلك المقعد عِنْدَ مَلِيكٍ مُقْتَدِرٍ فإن الاقتدار يناسب الصدق فإن معناه القوي يقال رمح صدق أي صلب قوي ولما كانت القوة صفة هذا الصادق حيث قوى على نفسه فلم يتزين بما ليس له والتزم الحق في أقواله وأحواله وأفعاله وصدق فيها أقعده الحق عِنْدَ مَلِيكٍ مُقْتَدِرٍ أي أطلعه على القوة الإلهية التي أعطته القوة في صدقه الذي كان عليه فإن الملك هو الشديد أيضا فهو مناسب للمقتدر قال قيس بن الحطيم يصف طعنة\n\n\n> ملكت بها كفي فانهرت فتقها *** يرى قائم من دونها ما وراءها\n\n\nأي شددت كفي بها يقال ملكت العجين إذا شددت عجنه فيحصل لك إذا خالفته في هذا الأمر الذي جاءك به علم تعلق الاقتدار الإلهي بالإيجاد وهي مسألة خلاف بين أهل الحقائق من أصحابنا ويحصل لك علم العصمة والحفظ الإلهي حتى لا يؤثر فيك وهمك ولا غيرك فتكون خالصا لربك وإن جاءك من جهة اليمين فقويت عليه ودفعته فإنه إذا جاءك من هذه الجهة الموصوفة بالقوة فإنه يأتي إليك ليضعف إيمانك ويقينك ويلقي عليك شبها في أدلتك ومكاشفاتك فإنه له في كل كشف يطلعك الحق عليه أمرا من عالم الخيال ينصبه لك مشابها لحالك الذي أنت به في وقتك فإن لم يكن لك علم قوي بما تميز به بين الحق وما يخيله لك فتكون موسوي المقام وإلا التبس عليك الأمر كما خيلت السحرة للعامة أن الحبال والعصي حيات ولم تكن كذلك‏\n\n\n### [عصا موسى وحبال السحرة]\n\n\nوقد كان موسى عليه السلام لما ألقى عصاه فكانت حَيَّةٌ تَسْعى‏ خاف منها على نفسه على مجرى العادة وإنما قدم الله بين يديه معرفة هذا قبل جمع السحرة ليكون على يقين من الله أنها آية وأنها لا تضره وكان خوفه الثاني عند ما ألقت السحرة الحبال والعصي فصارت حيات في أبصار الحاضرين على الأمة لئلا يلتبس عليهم الأمر فلا يفرقون بين الخيال والحقيقة أو بين ما هو من عند الله وبين ما ليس من عند الله فاختلف تعلق الخوفين فإنه عليه السلام على بينة من ربه قوي الجأش بما تقدم له إذ قيل له في الإلقاء الأول خُذْها ولا تَخَفْ سَنُعِيدُها سِيرَتَهَا الْأُولى‏ أي ترجع عصا كما كانت في عينك فأخفى تعالى العصا في روحانية الحية البرزخية فتلقفت جميع حيات السحرة المتخيلة في عيون الحاضرين فلم يبق لتلك الحبال والعصي عين ظاهرة في أعينهم وهي ظهور حجته على حججهم في صور حبال وعصى فأبصرت السحرة والناس حبال السحرة وعصيهم التي ألقوها حبالا وعصيا فهذا كان تلقفها لا أنها انعدمت الحبال والعصي إذ لو انعدمت لدخل عليهم التلبيس في عصا موسى وكانت الشبهة تدخل عليهم فلما رأى الناس الحبال حبالا علموا أنها مكيدة طبيعية يعضدها قوة كيدية روحانية فتلقفت عصا موسى صور الحيات من الحبال والعصي كما يبطل كلام الخصم إذا كان على غير حق أن يكون حجة لا إن ما أتى به ينعدم بل يبقى محفوظا معقولا\nعند السامعين ويزول عندهم كونه حجة فلما علمت السحرة قدر ما جاء به موسى من قوة الحجة وأنه خارج عما جاءوا به وتحققت شفوف ما جاء به على ما جاءوا به ورأوا خوفه علموا أن ذلك من عند الله ولو كان من عنده لم يخف لأنه يعلم ما يجري فآيته عند السحرة خوفه وآيته عند الناس تلقف عصاه فآمنت السحرة قيل كانوا ثمانين ألف ساحر وعلموا إن أعظم الآيات في هذا الموطن تلقف هذه الصور من أعين الناظرين وإبقاء صورة حية عصا موسى في أعينهم والحال عندهم واحدة فعلموا صدق موسى فيما يدعوهم إليه وأن هذا الذي أتى به خارج عن الصور والحيل المعلومة في السحر فهو أمر إلهي ليس لموسى عليه السلام فيه تعمل فصدقوا برسالته على بصيرة واختاروا عذاب فرعون على عذاب الله وآثروا الآخرة على الدنيا وعلموا من علمهم بذلك أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ وأَنَّ الله قَدْ أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً وأن الحقائق لا تتبدل وأن عصا موسى مبطونة في صورة الحية عن أعين الجميع وعن الذي ألقاها بخوفه الذي شهدوا منه فهذه فائدة العلم‏\n\n\n### [التشكيك في الحواس وغلط السوفسطائية]\n\n\nوإن جاءك الشيطان من جهة الشمال بشبهات التعطيل أو وجود الشريك لله تعالى في ألوهيته فطردته فإن الله يقويك على ذلك بدلائل التوحيد وعلم النظر فإن الخلف للمعطلة ودفعهم بضرورة العلم الذي يعلم به وجود الباري فالخلف للتعطيل والشمال للشرك واليمين للضعف ومن بين أيديهم التشكيك في الحواس ومن هنا دخل التلبيس على السوفسطائية حيث أدخل لهم الغلط في الحواس وهي التي يستند إليها أهل النظر في صحة أدلتهم وإلى البديهيات في العلم الإلهي وغيره فلما أظهر لهم الغلط في ذلك قالوا ما ثم علم أصلا يوثق به فإن قيل لهم فهذا علم بأنه ما ثم علم فما مستندكم وأنتم غير قائلين به قالوا وكذلك نقول إن قولنا هذا ليس بعلم وهو من جملة الأغاليط يقال لهم فقد علمتم إن قولكم هذا ليس بعلم وقولكم إن هذا أيضا من جملة الأغاليط إثبات ما نفيتموه فأدخل عليهم الشبه فيما يستندون إليه في تركيب مقدماتهم في الأدلة ويرجعون إليه فيها ولهذا عصمنا الله من ذلك فلم يجعل للحس غلطا جملة واحدة وإن الذي يدركه الحس حق فإنه موصل ما هو حاكم بل شاهد وإنما العقل هو الحاكم والغلط منسوب إلى الحاكم في الحكم ومعلوم عند القائلين بغلط الحس وغير القائلين به إن العقل يغلط إذا كان النظر فاسدا أعني نظر الفكر فإن النظر ينقسم إلى صحيح وفاسد فهذا هو من بين أيديهم‏\n\n\n### [ترتيب مدينة بدن الإنسان‏]\n\n\nثم لتعلم أن الإنسان قد جعله الحق قسمين في ترتيب مدينة بدنه وجعل القلب بين القسمين منه كالفاصل بين الشيئين فجعل في القسم الأعلى الذي هو الرأس جميع القوي الحسية والروحانية وما جعل في النصف الآخر من القوي الحساسة إلا حاسة اللمس فيدرك الخشن واللين والحار والبارد والرطب واليابس بروحه الحساس من حيث هذه القوة الخاصة السارية في جميع بدنه لا غير ذلك وأما من القوي الطبيعية المتعلقة بتدبير البدن فالقوة الجاذبة وبها تجذب النفس الحيوانية ما به صلاح العضو من الكبد والقلب والقوة الماسكة وبها تمسك ما جذبته الجاذبة على العضو حتى يأخذ منه ما فيه منافعه فإن قلت فإذا كان المقصود المنفعة فمن أين دخل المرض على الجسد فاعلم إن المرض من الزيادة على ما يستحقه من الغذاء أو النقص مما يستحقه فهذه القوة ما عندها ميزان الاستحقاق فإذا جذبت زائدا على ما يحتاج إليه البدن أو نقصت عنه كان المرض فإن حقيقتها الجذب ما حقيقتها الميزان فإذا أخذته على الوزن الصحيح فذلك لها بحكم الاتفاق ومن قوة أخرى لا بحكم القصد وذلك ليعلم المحدث نقصه وأن الله يَفْعَلُ ما يُرِيدُ وكذلك فيه أيضا القوة الدافعة وبها يعرق البدن فإن الطبيعة ما هي دافعة بمقدار مخصوص لأنها تجهل الميزان وهي محكومة لأمر آخر من فضول تطرأ في المزاج تعطيها القوة الشهوانية وكذلك أيضا هذا كله سار في جميع البدن علوا وسفلا وأما سائر القوي فمحلها النصف الأعلى وهو النصف الأشرف محل وجود الحياتين حياة الدم وحياة النفس فأي عضو مات من هذه الأعضاء زالت عنه القوي التي كانت فيه من المشروط وجودها بوجود الحياة وما لم يمت العضو وطرأ على محل قوة ما خلل فإن حكمها يفسد ويتخبط ولا يعطي علما صحيحا كمحل الخيال إذا طرأت فيه علة فالخيال لا يبطل وإنما يبطل قبول الصحة فيما يراه علما وكذلك العقل وكل قوة روحانية وأما القوي الحسية فهي أيضا موجودة لكن تطرأ حجب بينها وبين مدركاتها في العضو القائمة به من ماء ينزل في العين وغير ذلك وأما القوي ففي محالها ما زالت ولا برحت ولكن الحجب طرأت فمنعت فالأعمى يشاهد الحجاب ويراه وهو الظلمة التي يجدها فهي ظلمة الحجاب فمشهده الحجاب وكذلك ذائق‏\nالعسل والسكر إذا وجده مرا فالمباشر للعضو القائم به قوة الذوق إنما هو المرة الصفراء فلذلك أدرك المرارة فالحس يقول أدركت مرارة والحاكم إن أخطأ يقول هذا السكر مر وإن أصاب عرف العلة فلم يحكم على السكر بالمرارة وعرف ما أدركت القوة وعرف أن الحس الذي هو الشاهد مصيب على كل حال وأن القاضي يخطئ ويصيب‏\n\n\n### «فصل» [معرفة الحق من المنازل السفلية]\n\n\nوأما معرفة الحق من هذا المنزل فاعلم إن الكون لا تعلق له بعلم الذات أصلا وإنما متعلقة العلم بالمرتبة وهو مسمى الله فهو الدليل المحفوظ الأركان الساد على معرفة الإله وما يجب أن يكون عليه سبحانه من أسماء الأفعال ونعوت الجلال وبأية حقيقة يصدر الكون من هذه الذات المنعوتة بهذه المرتبة المجهولة العين والكيف وعندنا لا خلاف في أنها لا تعلم بل يطلق عليها نعوت تنزيه صفات الحدث وأن القدم لها والأزل الذي يطلق لوجودها إنما هي أسماء تدل على سلوب من نفي الأولية وما يليق بالحدوث وهذا يخالفنا فيه جماعة من المتكلمين الأشاعرة ويتخيلون أنهم قد علموا من الحق صفة نفسية ثبوتية وهيهات أنى لهم بذلك وأخذت طائفة ممن شاهدناهم من المتكلمين كأبي عبد الله الكتاني وأبي العباس الأشقر والضرير السلاوي صاحب الأرجوزة في علم الكلام على أبي سعيد الخراز وأبي حامد وأمثالهما في قولهم لا يعرف الله إلا الله وإنما اختلف أصحابنا في رؤية الله تعالى إذا رأيناه في الدار الآخرة بالأبصار ما الذي نرى وكلامهم فيه معلوم عند أصحابنا وقد أوردنا تحقيق ذلك في هذا الكتاب مفرقا في أبواب منازله وغيرها بطريق الإيماء لا بالتصريح فإنه مجال ضيق تقف العقول فيه لمناقضته أدلتها فهو المرئي سبحانه على الوجه الذي قاله وقاله رسول الله صلى الله عليه وسلم وعلى ما أراده من ذلك فإن الناظرين فيما قاله وأوحي به إلينا اختلفوا في تأويله وليس بعض الوجوه بأولى من بعض فتركنا الخوض في ذلك إذا الخلاف فيه لا يرتفع من العالم بكلامنا ولا بما نورده فيه‏\n\n\n### «فصل» [في مراتب الأوتاد ومنازلهم‏]\n\n\nوأما حديث الأوتاد الذي يتعلق معرفتهم بهذا الباب فاعلم إن الأوتاد الذين يحفظ الله بهم العالم أربعة لا خامس لهم وهم أخص من الأبدال والإمامان أخص منهم والقطب هو أخص الجماعة والأبدال في هذا الطريق لفظ مشترك يطلقون الأبدال على من تبدلت أوصافه المذمومة بالمحمودة ويطلقونه على عدد خاص وهم أربعون عند بعضهم لصفة يجتمعون فيها ومنهم من قال عددهم سبعة والذين قالوا سبعة منا من جعل السبعة الأبدال خارجين عن الأوتاد متميزين ومنا من قال إن الأوتاد الأربعة من الأبدال فالأبدال سبعة ومن هذه السبعة أربعة هم الأوتاد واثنان هما الإمامان وواحد هو القطب وهذه الجملة هم الأبدال وقالوا سموا أبدالا لكونهم إذا مات واحد منهم كان الآخر بدله ويؤخذ من الأربعين واحد وتكمل الأربعون بواحد من الثلاثمائة وتكمل الثلاثمائة بواحد من صالحي المؤمنين وقيل سموا أبدالا لأنهم أعطوا من القوة أن يتركوا بدلهم حيث يريدون لأمر يقوم في نفوسهم على علم منهم فإن لم يكن على علم منهم فليس من أصحاب هذا المقام فقد يكون من صلحاء الأمة وقد يكون من الأفراد وهؤلاء الأوتاد الأربعة لهم مثل ما للابدال الذين ذكرناهم في الباب قبل هذا روحانية إلهية وروحانية إلية فمنهم من هو على قلب آدم والآخر على قلب إبراهيم والآخر على قلب عيسى والآخر على قلب محمد عليهم السلام فمنهم من تمده روحانية إسرافيل وآخر روحانية ميكائيل وآخر روحانية جبريل وآخر روحانية عزرائيل ولكل وتدركن من أركان البيت فالذي على قلب آدم عليه السلام له الركن الشامي والذي على قلب إبراهيم له الركن العراقي والذي على قلب عيسى عليه السلام له الركن اليماني والذي على قلب محمد صلى الله عليه وسلم له ركن الحجر الأسود وهو لنا بحمد الله وكان بعض الأركان في زماننا الربيع بن محمود المارديني الحطاب فلما مات خلفه شخص آخر وكان الشيخ أبو علي الهواري قد أطلعه الله عليهم في كشفه قبل أن يعرفهم وتحقق صورهم فما مات حتى أبصر منهم ثلاثة في عالم الحس أبصر ربيعا المارديني وأبصر الآخر وهو رجل فارسي وأبصرنا ولازمنا إلى أن مات سنة تسع وتسعين وخمسمائة أخبرني بذلك وقال لي ما أبصرت الرابع وهو رجل حبشي واعلم أن هؤلاء الأوتاد يحوون على علوم جمة كثيرة فالذي لا بد لهم من العلم به وبه يكونون أوتادا فما زاد من العلوم فمنهم من له خمسة عشر علما ومنهم من له ولا بد ثمانية عشر علما ومنهم من له أحد وعشرون علما ومنهم من له أربعة وعشرون علما فإن أصناف العدد كثيرة هذا العدد من أصناف العلوم لكل واحد\nمنهم لا بد له منه وقد يكون الواحد أو كلهم يجمع أو يجمعون علم الجماعة وزيادة ولكن الخاص لكل واحد منهم ما ذكرنا من العدد فهو شرط فيه وقد لا يكون له ولا لواحد منهم علم زائد لا من الذي عند أصحابه ولا مما ليس عندهم فمنهم من له الوجه وهو قوله تعالى عن إبليس ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ ولكل جهة وتد يشفع يوم القيامة فيمن دخل عليه إبليس من جهته فالذي له الوجه له من العلوم علم الاصطلام والوجد والشوق والعشق وغامضات المسائل وعلم النظر وعلم الرياضة وعلم الطبيعة والعلم الإلهي وعلم الميزان وعلم الأنوار وعلم السبحات الوجهية وعلم المشاهدة وعلم الفناء وعلم تسخير الأرواح وعلم استنزال الروحانيات العلى وعلم الحركة وعلم إبليس وعلم المجاهدة وعلم الحشر وعلم النشر وعلم موازين الأعمال وعلم جهنم وعلم الصراط والذي له الشمال له علم الأسرار وعلم الغيوب وعلم الكنوز وعلم النبات وعلم المعدن وعلم الحيوان وعلم خفيات الأمور وعلم المياه وعلم التكوين وعلم التلوين وعلم الرسوخ وعلم الثبات وعلم المقام وعلم القدم وعلم الفصول المقومة وعلم الأعيان وعلم السكون وعلم الدنيا وعلم الجنة وعلم الخلود وعلم التقلبات والذي له اليمين له علم البرازخ وعلم الأرواح البرزخية وعلم منطق الطير وعلم لسان الرياح وعلم التنزل وعلم الاستحالات وعلم الزجر وعلم مشاهدة الذات وعلم تحريك النفوس وعلم الميل وعلم المعراج وعلم الرسالة وعلم الكلام وعلم الأنفاس وعلم الأحوال وعلم السماع وعلم الحيرة وعلم الهوى والذي له الخلف له علم الحياة وعلم الأحوال المتعلقة بالعقائد وعلم النفس وعلم التجلي وعلم المنصات وعلم النكاح وعلم الرحمة وعلم التعاطف وعلم التودد وعلم الذوق وعلم الشرب وعلم الري وعلم جواهر القرآن وعلم درر الفرقان وعلم النفس الأمارة فكل شخص كما ذكرنا لا بد له من هذه العلوم فما زاد على ذلك فذلك من الاختصاص الإلهي فهذا قد بينا مراتب الأوتاد وكنا في الباب الذي قبله بينا ما يختص به الأبدال وبينا في فصل المنازل من هذا الكتاب ما يختص به القطب والإمامان مستوفى الأصول في باب يخصه وهو السبعون ومائتان من أبواب هذا الكتاب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Sixteen: Concerning the Knowledge of the Lower Stations and the Cosmic Sciences\n\nAnd the beginning of the Gnosis of Allah derived from them, and the knowledge of the Poles (al-Awtad) and the Substitutes (al-Abdal), and those of the Celestial Spirits (al-Arwah al-'Ulwiyya) who govern them, and the arrangement of their spheres (Aflak).\n\n> The science of dense things (al-Katha'if) are ordered signs,\n> They are the guide to what is sought by the Messengers.\n> And they are what veiled the secrets of the one who is blind,\n> And they are what unveiled the landmarks of the paths.\n> For them, from the Upper World (al-'Alam al-'Ulwi), are its seven [planets],\n> Starting from the crescent moon and ascending to Saturn (Zuhal).\n> A remnant for the One who brought into existence the four Poles (al-Awtad),\n> By whom He anchored the Earth, so it was stripped of tilting.\n> When those who exist through them settled upon it,\n> Marvel at this example, sufficient as an example for you.\n\n### [The Four Inlets of Satan from the Four Directions of the Human Being]\n\nKnow, may Allah support you, that we have mentioned in the preceding chapter the stations (manazil) and ranks (maqamat) of the Substitutes (al-Abdal), those of the Celestial Spirits (al-Arwah al-'Ulwiyya) who govern them, the arrangement of their spheres, the effects of the luminous bodies (al-Nayyirat) upon them, and the regions (al-Aqalīm) assigned to them. Let us mention in this chapter what remains of the subject matter. The Lower Stations (al-Manazil al-Sufliyya) here refer to the four directions from which Satan approaches the human being. We named them \"lower\" because Satan belongs to the lower world (al-Sufli) and only approaches the human being from the stations that suit him, which are the right, the left, the back, and the front. Allah the Exalted said: <<ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ>> (Then I will come upon them from before them and from behind them and from their right and from their left).\n\nHe seeks aid against the human being through nature (al-Tab'), for nature assists him in what he calls the human to, namely, the pursuit of desires (al-Shahawat). Therefore, the human being was commanded to fight him from these directions and to fortify these directions with what the Divine Law (al-Shar') commanded him to fortify them with, so that Satan finds no way to enter through them.\n\nIf he comes to you from before you (min bayni aydeekum) and you repel him, the sciences of Light (Ulum al-Nur) will become manifest to you, as a grace (minna) from Allah upon you and a reward, since you preferred the Divine Presence (Janab Allah) over your caprice (Hawa). The sciences of Light are of two types: sciences of Unveiling (Kashf) and sciences of Demonstration (Burhan) based on sound reflection (Fikr). Through Demonstration, he attains what refutes the misleading doubts that impugn the existence of the Real (al-Haqq), His Unity (Tawhid), His Names (Asma'), and His Acts (Af'al). By Demonstration, he refutes the Deniers (al-Mu'attila) and proves the existence of the Deity (al-Ilah). By it, he refutes the polytheists (Ahl al-Shirk) <<الَّذِينَ يَجْعَلُونَ مَعَ الله إِلهاً آخَرَ>> (who set up another god alongside Allah) and proves the Unity of the Deity based on His being the Deity. By it, he refutes those who deny the rulings (Ahkam) of the Divine Names and the validity of their effects (Athar) in the Cosmos (al-Kawn). He proves their validity through Auditory Demonstration (al-Burhan al-Sam'i) by way of absolute declaration (al-Itlaq) and through Intellectual Demonstration (al-Burhan al-'Aqli) by way of meanings (al-Ma'ani). By it, he refutes the philosophers who deny the Acts and proves that He, glory be to Him, is the Doer (Fa'il), and that the things done (al-Maf'ulat) are willed by Him, both audibly (Sam'an) and intellectually ('Aqlan). As for the sciences of Unveiling (Kashf), they are the Divine Gnosis (al-Ma'arif al-Ilahiyya) that he attains in the Theophanies (al-Tajalliyat) within the Manifestations (al-Mazahir).\n\nAnd if he comes to you from behind you (min khalfikum), this is what calls you to speak about Allah what you do not know, and to claim prophethood (al-Nubuwwa) or messengership (al-Risala), claiming that Allah has revealed something to you. This is because Satan looks in every religious community (Milla) for every quality upon which the Lawgiver (al-Shari') has attached blame (al-Madhamm) and commands you to adopt it. And every quality upon which praise (al-Mahmada) is attached, he forbids you from it. This is generally speaking. The Angel (al-Malak) is the opposite: he commands you to the praiseworthy and forbids you from the blameworthy. If you repel him from behind you, the sciences of Truthfulness (al-Sidq) and its stations will become manifest to you, and where it leads its possessor, as Allah the Exalted said, <<فِي مَقْعَدِ صِدْقٍ>> (in a seat of truthfulness). However, it is their truthfulness that seated them in that seat <<عِنْدَ مَلِيكٍ مُقْتَدِرٍ>> (with a Sovereign Omnipotent King). For Omnipotence (al-Iqtidar) is suitable for truthfulness (al-Sidq), for its meaning is strength. It is said, \"a spear of truthfulness (rumh sidq),\" meaning solid and strong. Since strength was the attribute of this truthful person, as he gained strength over his self (Nafs) and did not adorn himself with what was not his, and adhered to the Real (al-Haqq) in his sayings, states (Ahwal), and acts (Af'al), and was truthful in them, the Real seated him <<عِنْدَ مَلِيكٍ مُقْتَدِرٍ>> (with a Sovereign Omnipotent King), meaning He informed him of the Divine Power (al-Quwwa al-Ilahiyya) which granted him strength in the truthfulness he maintained. For the King (al-Malik) is also the Severe (al-Shadid), thus fitting for the Omnipotent (al-Muqtadir). Qays ibn al-Hatim said, describing a stab:\n\n> I strengthened my hand with it, and its opening flowed,\n> So that one standing before it could see what was behind it.\n\nmeaning, I strengthened my hand with it. It is said, \"I strengthened the dough (malaktu al-'ajin)\" when you kneaded it firmly. Thus, if you oppose him (Satan) in this matter he brought to you, you will attain the knowledge concerning the relation of Divine Omnipotence (al-Iqtidar al-Ilahi) to bringing things into existence (al-Ijad)—a point of disagreement among the People of Realities (Ahl al-Haqa'iq) among our companions. You will also attain the knowledge of Infallibility ('Isma) and Divine Preservation (al-Hifz al-Ilahi), so that neither your imagination (Wahm) nor anything else affects you, and you become pure (khalisan) for your Lord.\n\nAnd if he comes to you from the right side (al-Yamin) and you prevail over him and repel him—for when he comes from this direction, which is characterized by strength—he comes to weaken your faith (Iman) and certainty (Yaqin) and to cast doubts (Shubah) upon your proofs (Adilla) and your unveilings (Mukashafat). For in every unveiling that the Real (al-Haqq) grants you, he has a matter from the world of Imagination (al-Khayal) which he sets up for you, resembling your current state (Hal) at that moment. If you do not possess strong knowledge by which you can distinguish between the Real and what he imagines for you, you will be of the station of Moses (Musa), otherwise the matter will become confused for you, just as the sorcerers made it appear to the common people that the ropes and staffs were snakes, when they were not.\n\n### [The Staff of Moses and the Ropes of the Sorcerers]\n\nWhen Moses, peace be upon him, cast down his staff and it became <<حَيَّةٌ تَسْعى>> (a serpent moving swiftly), he feared for himself, according to the usual course of events. However, Allah had presented him with the knowledge of this beforehand, before the gathering of the sorcerers, so that he would be certain from Allah that it was a sign (Aya) and would not harm him. His second fear, when the sorcerers cast down the ropes and staffs and they became snakes in the eyes of the onlookers, was for the community (al-Umma), lest the matter become confused for them, so that they would not distinguish between Imagination (al-Khayal) and Reality (al-Haqiqa), or between what is from Allah and what is not from Allah. Thus, the object of the two fears differed. For he, peace be upon him, was upon clear evidence from his Lord and strong of heart, due to what preceded for him, since it was said to him during the first casting, <<خُذْها ولا تَخَفْ سَنُعِيدُها سِيرَتَهَا الْأُولى>> (Take it and fear not; We shall restore it to its former state), meaning, it will return to being a staff in your sight. So Allah the Exalted concealed the staff within the spirituality (Ruhaniyya) of the serpentine Isthmus (al-Hayya al-Barzakhiyya). Then it swallowed all the snakes of the sorcerers, which were merely imagined in the eyes of the onlookers. Thus, no apparent entity (Ayn Zahira) remained of those ropes and staffs in their eyes. This was the manifestation of his proof (Hujja) over their proofs, in the form of ropes and staffs. The sorcerers and the people then saw the ropes and staffs that the sorcerers had cast down as ropes and staffs. This was the swallowing—not that the ropes and staffs ceased to exist. For if they had ceased to exist, confusion (al-Talbis) would have entered concerning the staff of Moses, and doubt (al-Shubha) would have entered upon them. When the people saw the ropes as ropes, they knew that it was a natural trick (Makida Tab'iyya) supported by a spiritual, tricky power (Quwwa Kaydiyya Ruhaniyya). So the staff of Moses swallowed the forms of the snakes derived from the ropes and staffs, just as the speech of an opponent, if it is not based on the Real (al-Haqq), is invalidated from being a proof (Hujja)—not that what he brought ceases to exist, but rather it remains preserved and intelligible ('Ma'qulan) to the listeners, but its status as a proof vanishes for them. When the sorcerers realized the magnitude of the strength of the proof that Moses brought, and that it was outside of what they had brought, and they verified the superiority of what he brought over what they had brought, and they saw his fear, they knew that this was from Allah. Had it been from himself, he would not have feared, because he would know what was happening. Thus, his sign (Aya) for the sorcerers was his fear, and his sign for the people was the swallowing by his staff. So the sorcerers believed—it is said they were eighty thousand sorcerers. They knew that the greatest sign in this situation was the swallowing of these forms from the eyes of the beholders, while the serpentine form of Moses' staff remained in their eyes. Yet the state (al-Hal) was one for them. They thus knew the truthfulness of Moses in what he called them to, and that what he brought was outside the forms and tricks known in sorcery. It was a Divine matter (Amr Ilahi) in which Moses, peace be upon him, had no personal agency. So they believed in his messengership (Risala) with insight (Basira) and chose the punishment of Pharaoh over the punishment of Allah and preferred the Hereafter (al-Akhira) over the World (al-Dunya). And they knew, from their knowledge of that, that <<أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (Indeed Allah is over all things Competent) and that <<أَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا>> (Indeed Allah has encompassed all things in Knowledge). And that Realities (al-Haqa'iq) do not change, and that the staff of Moses was concealed within the form of the serpent from the eyes of everyone, and even from the one who cast it down, due to the fear they witnessed from him. This is the benefit of knowledge.\n\n### [Casting Doubt on the Senses and the Error of the Sophists]\n\nAnd if Satan comes to you from the left side (al-Shimal) with the doubts of Denial (al-Ta'til) or the existence of a partner to Allah the Exalted in His Divinity (Uluhiyya), and you repel him, Allah will strengthen you against that with the proofs of Unity (al-Tawhid) and the science of Speculation (Ilm al-Nazar). For the back (al-Khalf) is for the Deniers (al-Mu'attila) and repelling them by the necessity of knowledge (Darurat al-'Ilm) by which the existence of the Creator (al-Bari) is known. So the back is for Denial, the left is for Polytheism (al-Shirk), and the right is for Weakness. And the front (min bayni aydeehim) is for casting doubt upon the senses (al-Hawass). It is from here that confusion (al-Talbis) entered upon the Sophists (al-Sufusta'iyya), as error was introduced to them concerning the senses, which are relied upon by the People of Speculation (Ahl al-Nazar) for the validity of their proofs, and upon self-evident truths (al-Badihiyyat) in Divine Knowledge (al-'Ilm al-Ilahi) and otherwise. When error was shown to them in this, they said, \"There is no knowledge whatsoever that can be trusted.\" If it is said to them, \"But this is knowledge—that there is no knowledge. What is your basis?\" and you do not affirm it? They said, \"We also say that this statement of ours is not knowledge, but is among the errors.\" It is said to them, \"Then you have known that your statement is not knowledge, and your statement that this is also among the errors is an affirmation of what you denied.\" Thus, doubts were introduced to them concerning what they rely upon in constructing the premises of their proofs and what they refer back to in them. For this reason, Allah preserved us from that, and did not make the sense perception (al-Hiss) entirely erroneous. Indeed, what the sense perceives is true, for it is a conveyor, not a judge, but a witness (Shahid). It is the Intellect (al-'Aql) that is the judge (al-Hakim). And the error is attributed to the judge in the judgment. It is known among those who affirm the error of the senses and those who deny it, that the Intellect errs if the speculation (al-Nazar) is corrupt—I mean the speculation of reflection (Nazar al-Fikr), for speculation is divided into sound and corrupt. This, then, is the front (min bayni aydeehim).\n\n### [The Arrangement of the City of the Human Body]\n\nThen know that the Real (al-Haqq) has made the human being into two divisions in the arrangement of the city of his body (Madinat Badanihi). He placed the Heart (al-Qalb) between the two divisions, like a separator between two things. He placed in the upper division, which is the head, all the sensory (al-Hissiyya) and spiritual (al-Ruhaniyya) faculties. And He placed in the other half, of the sensitive faculties (al-Quwa al-Hassasa), only the sense of touch (Hassat al-Lams). By it, the sensitive spirit (Ruhuhu al-Hassas) perceives roughness and softness, heat and cold, wetness and dryness, by means of this specific power that permeates his entire body, and nothing else.\n\nAs for the natural faculties (al-Quwa al-Tabi'iyya) related to the management of the body, there is the attractive faculty (al-Quwwa al-Jadhiba), by which the animal soul (al-Nafs al-Hayawaniyya) draws what is beneficial for the organ from the liver and the heart. And the retentive faculty (al-Quwwa al-Masika), by which it holds what the attractive faculty has drawn to the organ, until the organ takes from it what is beneficial to it. If you ask, \"If the purpose is benefit, then where does illness enter the body?\" Know that illness comes from an excess of the nourishment deserved, or a deficiency of what is deserved. This faculty does not possess the scale of desert (Mizan al-Istihqaq). If it attracts more than the body needs, or less than it needs, illness results. For its reality (Haqiqatuha) is attraction, not the scale. If it takes it according to the correct weight, that is due to coincidence (Hukm al-Ittifaq) and from another faculty, not by way of intention (Qasd). This is so that the originated being (al-Muhdath) may know its deficiency, and that Allah <<يَفْعَلُ مَا يُرِيدُ>> (does what He wills). Likewise, there is also the expulsive faculty (al-Quwwa al-Dafi'a) in it, by which the body sweats. For nature does not expel by a specific measure, because it is ignorant of the scale and is governed by another matter, namely, excesses that occur in the temperament (al-Mizaj) which the appetitive faculty (al-Quwwa al-Shahwaniyya) grants it. Likewise, all of this permeates the entire body, upper and lower.\n\nAs for the rest of the faculties, their location is the upper half, which is the nobler half, the location of the existence of the two lives: the life of the blood and the life of the breath (al-Nafs). Whichever of these organs dies, the faculties that were in it vanish, those whose existence is conditioned by the existence of life. If the organ does not die, but a defect (Khalal) occurs in the location of a faculty, its function becomes corrupted and confused, and it does not yield sound knowledge. For example, if an ailment occurs in the location of Imagination (al-Khayal), the Imagination is not invalidated, but rather the acceptance of soundness in what it perceives as knowledge is invalidated. The same applies to the Intellect (al-'Aql) and every spiritual faculty (Quwwa Ruhaniyya). As for the sensory faculties (al-Quwa al-Hissiyya), they also exist, but veils (Hujub) occur between them and their percepts in the organ where they reside, such as water descending into the eye, and so forth. As for the faculties, they remain in their locations and have not departed, but the veils have occurred and prevented perception. Thus, the blind person witnesses the veil and sees it, which is the darkness he perceives. It is the darkness of the veil, so his witnessing (Mashhad) is the veil. Likewise, the one who tastes honey or sugar and finds it bitter—the immediate agent acting upon the organ where the faculty of taste resides is the yellow bile (al-Marra al-Safra'). Therefore, he perceives bitterness. The sense says, \"I perceived bitterness.\" If the judge (al-Hakim) errs, he says, \"This sugar is bitter.\" If he is correct, he knows the cause and does not judge the sugar to be bitter. He knows what the faculty perceived and knows that the sense, which is the witness (al-Shahid), is correct in every case, but the judge (al-Qadi) errs and is correct.\n\n### Section: The Gnosis of the Real from the Lower Stations\n\nKnow that the Cosmos (al-Kawn) has absolutely no relation to the knowledge of the Essence (Ilm al-Dhat). Rather, the object of knowledge is the Level (al-Martaba), which is the Named One, Allah. He is the guide (al-Dalil), whose pillars are preserved, leading to the Gnosis of the Deity (al-Ilah), and what must be attributed to Him, glory be to Him, of the Names of Acts (Asma' al-Af'al) and the descriptions of Majesty (Nu'ut al-Jalal), and by which Reality (Haqiqa) the Cosmos issues forth from this Essence (al-Dhat), which is described by this Level (al-Martaba), whose entity (al-'Ayn) and modality (al-Kayf) are unknown. In our view, there is no disagreement that it (the Essence) is not known. Rather, descriptions of transcendence (Nu'ut Tanzih) are applied to it, negating the attributes of origination (Sifat al-Hadath). And that Eternity (al-Qidam) belongs to it, and the Pre-eternity (al-Azal) that is applied to its Existence (Wujud), are merely Names (Asma') that indicate negations (Sulub), such as the denial of beginning (Nafy al-Awwaliyya) and what is appropriate for origination. A group of the Ash'ari theologians (al-Mutakallimin al-Asha'ira) disagree with us on this, imagining that they have known an essential, affirmative attribute (Sifa Nafsiyya Thubutiyya) of the Real (al-Haqq). Far be it! How could they achieve that? A group of the theologians whom we witnessed, such as Abu Abd Allah al-Kattani, Abu al-Abbas al-Ashqar, and al-Darir al-Salawi, the author of the *Urjuza* (didactic poem) on the science of theology, followed Abu Sa'id al-Kharraz, Abu Hamid, and their likes, in their saying: \"None knows Allah but Allah.\" Our companions only differed concerning the Vision (Ru'ya) of Allah the Exalted: when we see Him in the Abode of the Hereafter (al-Dar al-Akhira) with our eyes, what is it that we see? Their discussion on this is known among our companions. We have presented the verification of this in this book, dispersed throughout the chapters of its stations and others, by way of allusion (al-Ima') and not by explicit declaration (al-Tasrih). For it is a narrow field where intellects halt due to its contradiction of their proofs. He, glory be to Him, is the One Seen, according to the manner He stated and His Messenger, may Allah bless him and grant him peace, stated, and according to what He intended by that. For those who speculate upon what He said and what was revealed to us have differed in its interpretation (Ta'wil). And none of the interpretations is more preferable than another. Therefore, we have abandoned delving into this, since the disagreement concerning it will not be removed from the world by our speech or by what we present regarding it.\n\n### Section: Concerning the Levels and Stations of the Poles (al-Awtad)\n\nAs for the discussion of the Poles (al-Awtad), whose knowledge is related to this chapter, know that the Poles, by whom Allah preserves the World (al-'Alam), are four, and there is no fifth. They are more specific than the Substitutes (al-Abdal), and the Two Imams (al-Imaman) are more specific than them, and the Pole (al-Qutb) is the most specific of the group. The term Substitutes (al-Abdal) in this path is a shared term. They apply the term *Abdal* to those whose blameworthy qualities have been substituted (tabaddalat) by praiseworthy ones. They also apply it to a specific number, which is forty according to some, due to a quality in which they gather. And among them are those who said their number is seven. Among those who said seven, some of us made the seven Substitutes distinct and separate from the Poles. And some of us said that the four Poles are among the Substitutes, so the Substitutes are seven, and of these seven, four are the Poles, two are the Imams, and one is the Pole (al-Qutb). This entire group constitutes the Substitutes. They said they were named *Abdal* (Substitutes) because when one of them dies, another takes his place (badaluhu). One is taken from the Forty, and the Forty is completed by one from the Three Hundred, and the Three Hundred is completed by one from the righteous believers (Salihī al-Mu'minin). It was also said they were named *Abdal* because they were given the power to leave their substitute (badal) wherever they wish, for a matter that arises in their souls (Nufus), based on knowledge (Ilm) from them. If it is not based on knowledge from them, then he is not among the possessors of this station (Maqam). He may be one of the righteous of the community (Umma) or one of the Individuals (al-Afrad).\n\nThese four Poles possess the same as the Substitutes we mentioned in the previous chapter: Divine Spirituality (Ruhaniyya Ilahiyya) and Instrumental Spirituality (Ruhaniyya Iliyya). One of them is upon the Heart of Adam, another upon the Heart of Abraham, another upon the Heart of Jesus, and another upon the Heart of Muhammad, peace be upon them. One of them is supported by the spirituality of Israfil, another by the spirituality of Michael, another by the spirituality of Gabriel, and another by the spirituality of Azrael. And for every Pole, there is a corner (Rukn) of the House (al-Bayt, i.e., the Ka'ba). The one who is upon the Heart of Adam, peace be upon him, has the Syrian Corner (al-Rukn al-Shami). The one who is upon the Heart of Abraham has the Iraqi Corner (al-Rukn al-'Iraqi). The one who is upon the Heart of Jesus, peace be upon him, has the Yemeni Corner (al-Rukn al-Yamani). And the one who is upon the Heart of Muhammad, may Allah bless him and grant him peace, has the Corner of the Black Stone (Rukn al-Hajar al-Aswad)—and that was ours, praise be to Allah. One of the Corners in our time was al-Rabi' ibn Mahmud al-Mardini al-Hattab (the woodcutter). When he died, another person succeeded him. Shaykh Abu Ali al-Hawwari had been informed of them by Allah in his Unveiling (Kashf) before he knew them, and he verified their forms. He did not die until he saw three of them in the sensory world ('Alam al-Hiss): he saw Rabi' al-Mardini, and he saw the other, who was a Persian man, and he saw us. He stayed with us until he died in the year 599 AH. He informed me of this and told me, \"I did not see the fourth, who is an Abyssinian man.\"\n\nKnow that these Poles encompass many vast sciences. The knowledge that is indispensable for them, and by which they become Poles, is [a specific number]. As for the additional sciences, some of them possess fifteen sciences, some must possess eighteen sciences, some possess twenty-one sciences, and some possess twenty-four sciences. For the types of numbers are many. This number of types of sciences is indispensable for each one of them. It may be that one of them, or all of them, gathers the knowledge of the entire group and more. But the specific number we mentioned is particular to each one of them and is a condition for him. It may be that he, or none of them, possesses additional knowledge, neither from what his companions possess nor from what they do not possess.\n\nOne of them has the Front (al-Wajh), which is the saying of Allah the Exalted concerning Iblis: <<ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ>> (Then I will come upon them from before them and from behind them and from their right and from their left). And for every direction, there is a Pole who will intercede on the Day of Resurrection for those whom Iblis entered from his direction.\n\nThe one who has the Front possesses the sciences of: Rapture (Istilam), Ecstasy (Wajd), Longing (Shawq), Passionate Love ('Ishq), Obscure Issues, Speculation (Nazar), Spiritual Discipline (Riyada), Nature (Tabi'a), Divine Science (al-'Ilm al-Ilahi), The Scale (Mizan), Lights (Anwar), The Glories of the Face (Subuhat al-Wajhiyya), Witnessing (Mushahada), Annihilation (Fana'), Subjugation of Spirits (Taskhir al-Arwah), Bringing Down the Celestial Spiritualities (Istinzal al-Ruhaniyyat al-'Ula), Movement (Haraka), Iblis, Struggle (Mujahada), Gathering (Hashr), Resurrection (Nashr), Scales of Deeds (Mawazin al-A'mal), Hell (Jahannam), and The Bridge (al-Sirat).\n\nThe one who has the Left possesses the sciences of: Secrets (Asrar), Hidden Things (Ghuyub), Treasures (Kunuz), Plants (Nabat), Minerals (Ma'dan), Animals (Hayawan), Hidden Matters (Khafiyyat al-Umur), Waters (Miyah), Creation/Formation (Takwin), Coloring/Change (Talwin), Firmness (Rusukh), Steadfastness (Thabat), Station (Maqam), Foot/Pre-eternity (Qadam), The Rectifying Seasons (Fusul al-Muqawwima), Entities (al-A'yan), Stillness (Sukun), The World (al-Dunya), Paradise (al-Janna), Eternity/Immortality (Khulud), and Transformations (Taqallubat).\n\nThe one who has the Right possesses the sciences of: Isthmuses (al-Barazikh), Isthmus Spirits (al-Arwah al-Barzakhiyya), Language of the Birds (Mantiq al-Tayr), Tongue of the Winds (Lisan al-Riyah), Descent (Tanazzul), Transformations/Metamorphoses (Istihalat), Repulsion/Chastisement (Zajr), Witnessing the Essence (Mushahadat al-Dhat), Moving the Souls (Tahrik al-Nufus), Inclination (Mayl), Ascent (Mi'raj), Messengership (Risala), Speech/Theology (Kalam), Breaths (Anfas), States (Ahwal), Audition/Sama', Bewilderment (Hayra), and Caprice/Love (Hawa).\n\nThe one who has the Back possesses the sciences of: Life (Hayat), States related to Creeds ('Aqa'id), The Soul/Self (Nafs), Theophany/Self-disclosure (Tajalli), Platforms/Pulpits (Manssat), Marriage/Union (Nikah), Mercy (Rahma), Mutual Affection (Ta'atuf), Affability (Tawaddud), Taste (Dhawq), Drinking (Shurb), Quenching Thirst (Riyy), Essences of the Qur'an (Jawahir al-Qur'an), Pearls of the Criterion (Durar al-Furqan), and The Commanding Soul (al-Nafs al-Ammara).\n\nThus, every person, as we mentioned, must possess these sciences. Whatever exceeds that is due to Divine Specialization (al-Ikhtisas al-Ilahi). We have thus clarified the levels (Maratib) of the Poles (al-Awtad). And in the preceding chapter, we clarified what is specific to the Substitutes (al-Abdal). And we clarified in the section on Stations (al-Manazil) in this book what is specific to the Pole (al-Qutb) and the Two Imams (al-Imaman), with a full account of the principles in a chapter dedicated to it, which is the two hundred and seventieth chapter of this book. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "**باب سولہواں: نچلی منازل اور کونیاتی علوم کی معرفت میں**\n\n**اور ان سے معرفتِ الٰہی کا آغاز، نیز اوتاد (الأوتاد) اور ابدال (الأبدال) کی معرفت، اور وہ علوی ارواح جو ان کی سرپرستی کرتی ہیں، اور ان کے افلاک کی ترتیب۔**\n\n> کثافتوں کا علم مرتب نشانیاں ہیں،\n>\n> جو رسولوں کے لیے مطلوب (ذات حق) کی دلیل ہیں۔\n>\n> اور یہی وہ ہیں جنہوں نے حیرت زدہ شخص کے اسرار کو چھپایا،\n>\n> اور یہی وہ ہیں جنہوں نے راستوں کی نشانیاں ظاہر کیں۔\n>\n> ان کے لیے عالم علوی سے سات ہیں،\n>\n> ہلال (چاند) سے لے کر زحل تک بلندی کی طرف۔\n>\n> اس ذات کی تعریف جس نے چار اوتاد (الأوتاد) کو وجود بخشا،\n>\n> جن کے ذریعے زمین کو مضبوط کیا گیا اور وہ جھکنے سے بچ گئی۔\n>\n> جب اس پر وہ ٹھہر گیا جو اس کے ساتھ ہوتا ہے،\n>\n> تو اس مثال پر تعجب کرو، یہ تمہارے لیے کافی مثال ہے۔\n\n### [انسان کی چار جہات سے شیطان کے چار راستے]\n\nجان لو، اللہ تمہاری تائید فرمائے، کہ ہم نے اس سے پچھلے باب میں ابدال (الأبدال) کی منازل اور ان کے مقامات، اور وہ علوی ارواح جو ان کی سرپرستی کرتی ہیں، اور ان کے افلاک کی ترتیب، اور ان میں نیرات (روشن ستاروں) کے اثرات، اور ان کے لیے جو اقالیم ہیں، ان کا ذکر کیا ہے۔ پس ہم اس باب میں ان باقی ماندہ امور کا ذکر کریں گے جن کا عنوان نچلی منازل (المنازل السفلية) ہے۔ یہاں نچلی منازل سے مراد وہ چار جہات ہیں جن سے شیطان انسان کی طرف آتا ہے، اور ہم نے انہیں نچلی (سفلیہ) اس لیے کہا کہ شیطان عالم سفل (عالم السفل) سے ہے، لہٰذا وہ انسان کے پاس صرف ان منازل سے آتا ہے جو اس کے مناسب ہیں، اور وہ دائیں، بائیں، پیچھے اور سامنے ہیں۔ اللہ تعالیٰ نے فرمایا: **\"پھر میں ان کے پاس ان کے آگے سے اور ان کے پیچھے سے اور ان کے دائیں سے اور ان کے بائیں سے آؤں گا\"** (سورۃ الاعراف: ۱۷)۔\n\nاور وہ انسان پر طبع (الطبع) کے ذریعے مدد لیتا ہے، کیونکہ وہ شہوات کی پیروی کی طرف بلانے میں اس کا مددگار ہے۔ لہٰذا انسان کو حکم دیا گیا ہے کہ وہ ان جہات سے اس سے لڑے اور ان جہات کو ان چیزوں سے مضبوط کرے جن سے شریعت نے انہیں مضبوط کرنے کا حکم دیا ہے، تاکہ شیطان کو ان میں داخل ہونے کا کوئی راستہ نہ ملے۔ پس اگر وہ تمہارے آگے سے آئے اور تم اسے بھگا دو، تو تم پر علومِ نور (علوم النور) ظاہر ہوں گے، یہ اللہ کی طرف سے تم پر احسان اور جزا ہے، کیونکہ تم نے اپنی خواہش پر جنابِ الٰہی کو ترجیح دی۔ اور علومِ نور دو قسموں پر ہیں: علومِ کشف (علوم کشف) اور صحیح فکر کے ذریعے حاصل ہونے والے علومِ برہان (علوم برہان)۔ پس اسے برہان (البرہان) کے طریقے سے وہ چیز حاصل ہوتی ہے جس سے وہ گمراہ کن شبہات کو رد کرتا ہے جو ذات حق (الحق) کے وجود، اس کی توحید، اس کے اسماء اور اس کے افعال میں قدح کرتے ہیں۔ پس برہان کے ذریعے وہ معطلہ (تعطیل کرنے والوں) کو رد کرتا ہے اور وجودِ الٰہ کے اثبات پر دلیل دیتا ہے، اور اسی کے ذریعے وہ اہل شرک کو رد کرتا ہے جو **\"اللہ کے ساتھ کوئی دوسرا معبود بناتے ہیں\"** اور الٰہ کی توحید پر دلیل دیتا ہے کہ وہ الٰہ ہے۔ اور اسی کے ذریعے وہ ان لوگوں کو رد کرتا ہے جو اسماءِ الٰہیہ کے احکام اور کائنات میں ان کے آثار کی صحت کی نفی کرتے ہیں، اور اطلاق کے طریقے سے سمعی برہان (البرہان السمعي) کے ذریعے اور معانی کے طریقے سے عقلی برہان (البرہان العقلي) کے ذریعے ان کے اثبات پر دلیل دیتا ہے۔ اور اسی کے ذریعے وہ فلاسفہ میں سے افعال کے منکروں کو رد کرتا ہے اور دلیل دیتا ہے کہ وہ سبحانہ فاعل ہے اور مفعولات اس کے ارادے میں شامل ہیں، سمعاً اور عقلاً۔ اور جہاں تک علومِ کشف (علوم الکشف) کا تعلق ہے، تو وہ وہ معارفِ الٰہیہ (المعارف الإلهية) ہیں جو مظاہر (المظاہر) میں تجلیات (التجلیات) کے وقت اسے حاصل ہوتے ہیں۔\n\nاور اگر وہ تمہارے پیچھے سے آئے، اور یہ وہ چیز ہے جس کی طرف وہ تمہیں بلاتا ہے کہ تم اللہ پر وہ بات کہو جو تم نہیں جانتے، اور نبوت اور رسالت کا دعویٰ کرو، اور یہ کہ اللہ نے تمہاری طرف وحی کی ہے۔ یہ اس لیے کہ شیطان ہر ملت میں ہر اس صفت کو دیکھتا ہے جس پر شارع نے اس امت میں مذمت کا حکم لگایا ہے، تو وہ تمہیں اس کا حکم دیتا ہے، اور ہر وہ صفت جس پر تعریف کا حکم لگایا ہے، وہ تمہیں اس سے منع کرتا ہے۔ یہ علی الاطلاق ہے، اور فرشتہ اس کے برعکس ہے، وہ تمہیں محمود (قابل تعریف) چیزوں کا حکم دیتا ہے اور مذموم (قابل مذمت) چیزوں سے منع کرتا ہے۔ پس جب تم اسے اپنے پیچھے سے بھگا دو گے، تو تم پر علومِ صدق (علوم الصدق) اور اس کی منازل ظاہر ہوں گی، اور یہ کہ وہ اپنے صاحب کو کہاں تک پہنچاتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: **\"سچائی کی جگہ میں، ایک مقتدر بادشاہ کے پاس\"** (سورۃ القمر: ۵۵)۔ مگر ان کا وہ صدق ہی ہے جس نے انہیں اس مقام پر ایک مقتدر بادشاہ (مَلِيكٍ مُقْتَدِرٍ) کے پاس بٹھایا۔ کیونکہ اقتدار صدق کے مناسب ہے، اس لیے کہ اس کا معنی قوی ہے۔ کہا جاتا ہے: \"رمح صدق\" (سچا نیزہ) یعنی مضبوط اور قوی۔ اور چونکہ قوت اس صادق کی صفت تھی، جہاں اس نے اپنے نفس پر قوت حاصل کی اور اس چیز سے زینت اختیار نہیں کی جو اس کی نہیں تھی، اور اپنے اقوال، احوال اور افعال میں حق کو لازم پکڑا اور ان میں سچا رہا، تو حق نے اسے ایک مقتدر بادشاہ (مَلِيكٍ مُقْتَدِرٍ) کے پاس بٹھایا، یعنی اسے اس الٰہی قوت پر مطلع کیا جس نے اسے اس صدق میں قوت بخشی جس پر وہ قائم تھا۔ کیونکہ ملک (بادشاہ) بھی شدید (طاقتور) ہوتا ہے، لہٰذا وہ مقتدر کے مناسب ہے۔ قیس بن حطیم ایک وار کی تعریف کرتے ہوئے کہتا ہے:\n\n> میں نے اس کے ذریعے اپنی ہتھیلی کو مضبوط کیا، پس اس کا شگاف بہہ نکلا،\n>\n> جو اس کے سامنے کھڑا ہے وہ اس کے پیچھے کی چیز دیکھتا ہے۔\n\nیعنی میں نے اس کے ذریعے اپنی ہتھیلی کو مضبوط کیا۔ کہا جاتا ہے: \"ملکت العجین\" جب تم آٹے کو مضبوطی سے گوندھتے ہو۔ پس جب تم اس امر میں اس کی مخالفت کرتے ہو جو وہ تمہارے پاس لایا ہے، تو تمہیں ایجاد سے متعلق الٰہی اقتدار (الاقتدار الإلهي) کا علم حاصل ہوتا ہے، اور یہ ہمارے اصحابِ حقائق (أهل الحقائق) کے درمیان اختلافی مسئلہ ہے۔ اور تمہیں عصمت اور الٰہی حفاظت (الحفظ الإلهي) کا علم حاصل ہوتا ہے، یہاں تک کہ تمہارا وہم یا کوئی اور چیز تم پر اثر انداز نہیں ہوتی، پس تم اپنے رب کے لیے خالص ہو جاتے ہو۔\n\nاور اگر وہ تمہارے پاس دائیں طرف سے آئے اور تم اس پر غالب آ کر اسے دفع کر دو، تو جب وہ اس قوت سے موصوف جہت سے تمہارے پاس آتا ہے، تو وہ تمہارے ایمان اور تمہارے یقین (الیقین) کو کمزور کرنے کے لیے آتا ہے اور تمہاری دلیلوں اور تمہارے مکاشفات (مکاشفات) میں شبہات ڈالتا ہے۔ کیونکہ حق تمہیں جس کشف (الکشف) پر بھی مطلع کرتا ہے، اس کے لیے عالمِ خیال (عالم الخيال) سے ایک امر ہوتا ہے جسے وہ تمہارے لیے نصب کرتا ہے، جو تمہارے اس حال سے مشابہ ہوتا ہے جس میں تم اس وقت ہو۔ پس اگر تمہارے پاس وہ قوی علم نہ ہو جس سے تم حق اور اس چیز کے درمیان تمیز کر سکو جو وہ تمہیں خیال میں دکھاتا ہے، تو تم موسوی مقام پر ہو گے، ورنہ معاملہ تم پر مشتبہ ہو جائے گا، جیسا کہ جادوگروں نے عام لوگوں کو یہ خیال دلایا کہ رسیاں اور لاٹھیاں سانپ ہیں، حالانکہ وہ ایسا نہیں تھیں۔\n\n### [موسیٰ کا عصا اور جادوگروں کی رسیاں]\n\nاور موسیٰ علیہ السلام نے جب اپنا عصا ڈالا تو وہ ایک دوڑتا ہوا سانپ (حَيَّةٌ تَسْعىٰ) بن گیا، تو انہوں نے معمول کے مطابق اپنے لیے خوف محسوس کیا۔ اللہ نے اس سے پہلے جادوگروں کے جمع ہونے سے پہلے ہی اس کی معرفت ان کے سامنے پیش کر دی تھی تاکہ وہ اللہ کی طرف سے یقین پر ہوں کہ یہ ایک نشانی ہے اور یہ انہیں نقصان نہیں پہنچائے گی۔ اور ان کا دوسرا خوف اس وقت تھا جب جادوگروں نے رسیاں اور لاٹھیاں ڈالیں اور وہ حاضرین کی نگاہوں میں سانپ بن گئیں، تو یہ خوف امت کے لیے تھا تاکہ ان پر معاملہ مشتبہ نہ ہو جائے اور وہ خیال اور حقیقت کے درمیان یا جو اللہ کی طرف سے ہے اور جو اللہ کی طرف سے نہیں ہے، اس کے درمیان فرق نہ کر سکیں۔ پس دونوں خوفوں کا تعلق مختلف تھا۔ کیونکہ وہ علیہ السلام اپنے رب کی طرف سے واضح دلیل پر تھے اور ان کا دل مضبوط تھا، کیونکہ پہلی بار عصا ڈالنے پر ان سے کہا گیا تھا: **\"اسے پکڑ لو اور ڈرو نہیں، ہم اسے اس کی پہلی حالت پر لوٹا دیں گے\"** (سورۃ طٰہٰ: ۲۱)، یعنی وہ تمہاری نظر میں دوبارہ عصا بن جائے گا۔ پس اللہ تعالیٰ نے عصا کو برزخی سانپ کی روحانیت میں چھپا دیا، تو اس نے حاضرین کی آنکھوں میں جادوگروں کے تمام خیالی سانپوں کو نگل لیا۔ پس ان رسیوں اور لاٹھیوں کی کوئی ظاہری صورت ان کی آنکھوں میں باقی نہ رہی۔ اور یہ ان کی دلیلوں پر ان کی حجت کا ظاہر ہونا تھا جو رسیوں اور لاٹھیوں کی صورت میں تھیں۔ پس جادوگروں اور لوگوں نے جادوگروں کی رسیوں اور لاٹھیوں کو جو انہوں نے ڈالی تھیں، رسیوں اور لاٹھیوں کی صورت میں دیکھا۔ پس یہ ان کا نگلنا تھا، نہ یہ کہ رسیاں اور لاٹھیاں معدوم ہو گئیں، کیونکہ اگر وہ معدوم ہو جاتیں تو موسیٰ کے عصا میں بھی ان پر التباس داخل ہو جاتا اور ان پر شبہہ پڑ جاتا۔ پس جب لوگوں نے رسیوں کو رسیاں دیکھا تو انہیں معلوم ہوا کہ یہ ایک طبعی چال ہے جسے روحانی چال کی قوت مدد دیتی ہے۔ پس موسیٰ کے عصا نے رسیوں اور لاٹھیوں سے سانپوں کی صورتوں کو نگل لیا، جیسا کہ جب مخالف کا کلام حق پر نہ ہو تو وہ حجت ہونے سے باطل ہو جاتا ہے، نہ یہ کہ جو کچھ وہ لایا ہے وہ معدوم ہو جاتا ہے، بلکہ وہ سننے والوں کے پاس محفوظ اور معقول رہتا ہے اور ان کے نزدیک اس کا حجت ہونا زائل ہو جاتا ہے۔ پس جب جادوگروں کو موسیٰ کی لائی ہوئی حجت کی قوت کا اندازہ ہوا اور یہ کہ وہ اس سے باہر ہے جو وہ لائے تھے، اور انہیں اس بات کا یقین ہو گیا کہ جو کچھ وہ لائے ہیں اس پر یہ غالب ہے، اور انہوں نے ان کا خوف دیکھا، تو انہیں معلوم ہوا کہ یہ اللہ کی طرف سے ہے۔ اگر یہ ان کی اپنی طرف سے ہوتا تو وہ نہ ڈرتے، کیونکہ وہ جانتے کہ کیا ہونے والا ہے۔ پس جادوگروں کے نزدیک ان کی نشانی ان کا خوف تھا، اور لوگوں کے نزدیک ان کی نشانی ان کے عصا کا نگلنا تھا۔ پس جادوگر ایمان لے آئے، کہا جاتا ہے کہ وہ اسی ہزار جادوگر تھے۔ اور انہیں اپنے علم سے معلوم ہوا کہ اس مقام پر سب سے بڑی نشانی ان صورتوں کا دیکھنے والوں کی آنکھوں سے نگل جانا ہے اور موسیٰ کے عصا کی سانپ کی صورت کا ان کی آنکھوں میں باقی رہنا ہے، حالانکہ ان کے نزدیک حالت ایک ہی تھی۔ پس انہیں موسیٰ کی سچائی کا یقین ہو گیا جس کی طرف وہ انہیں بلا رہے تھے، اور یہ کہ جو کچھ وہ لائے ہیں وہ جادو میں معلوم صورتوں اور حیلوں سے باہر ہے۔ پس یہ ایک الٰہی امر ہے جس میں موسیٰ علیہ السلام کا کوئی عمل دخل نہیں ہے۔ پس انہوں نے بصیرت کے ساتھ ان کی رسالت کی تصدیق کی اور فرعون کے عذاب پر اللہ کے عذاب کو ترجیح دی اور دنیا پر آخرت کو مقدم جانا، اور انہیں اپنے علم سے معلوم ہوا کہ **\"اللہ ہر چیز پر قادر ہے\"** (سورۃ البقرہ: ۱۰۶) اور **\"اللہ نے ہر چیز کو علم سے گھیر رکھا ہے\"** (سورۃ الطلاق: ۱۲)، اور یہ کہ حقائق تبدیل نہیں ہوتے، اور یہ کہ موسیٰ کا عصا سانپ کی صورت میں سب کی آنکھوں سے اور اس شخص کی آنکھوں سے بھی پوشیدہ تھا جس نے اسے ڈالا تھا، ان کے اس خوف کی وجہ سے جس کا انہوں نے مشاہدہ کیا۔ پس یہ علم کا فائدہ ہے۔\n\n### [حواس میں شک پیدا کرنا اور سوفسطائیوں کی غلطی]\n\nاور اگر شیطان تمہارے پاس شمال کی جہت سے تعطیل (التعطیل) کے شبہات یا اللہ تعالیٰ کی الوہیت میں شریک کے وجود کے شبہات کے ساتھ آئے اور تم اسے بھگا دو، تو اللہ تمہیں توحید کی دلیلوں اور علمِ نظر کے ذریعے اس پر قوت بخشتا ہے۔ کیونکہ پیچھے کی جہت معطلہ (تعطیل کرنے والوں) کے لیے ہے اور انہیں اس علم کی ضرورت سے دفع کرنا ہے جس سے باری تعالیٰ کا وجود معلوم ہوتا ہے۔ پس پیچھے کی جہت تعطیل (التعطیل) کے لیے ہے، اور شمال شرک (الشرک) کے لیے ہے، اور دائیں کی جہت ضعف کے لیے ہے، اور آگے کی جہت حواس (الحواس) میں شک پیدا کرنے کے لیے ہے۔ اور یہیں سے سوفسطائیہ (السوفسطائية) پر التباس داخل ہوا، جہاں ان کے لیے حواس میں غلطی داخل کی گئی، اور یہی وہ ہیں جن پر اہل نظر اپنی دلیلوں کی صحت میں اور علمِ الٰہی اور دیگر علوم میں بدیہیات پر انحصار کرتے ہیں۔ پس جب ان کے لیے اس میں غلطی ظاہر کی گئی تو انہوں نے کہا کہ سرے سے کوئی ایسا علم نہیں ہے جس پر بھروسہ کیا جا سکے۔ اگر ان سے کہا جائے کہ یہ علم ہے کہ کوئی علم نہیں ہے، تو تمہارا مستند کیا ہے، حالانکہ تم اس کے قائل نہیں ہو؟ تو انہوں نے کہا کہ ہم بھی یہی کہتے ہیں کہ ہمارا یہ قول علم نہیں ہے اور یہ غلطیوں کے مجموعے میں سے ہے۔ ان سے کہا جاتا ہے کہ تم نے یہ جان لیا کہ تمہارا یہ قول علم نہیں ہے اور تمہارا یہ کہنا کہ یہ بھی غلطیوں کے مجموعے میں سے ہے، اس چیز کا اثبات ہے جس کی تم نے نفی کی ہے۔ پس ان پر ان چیزوں میں شبہہ داخل کیا گیا جن پر وہ اپنی دلیلوں میں مقدمات کی ترکیب میں انحصار کرتے ہیں اور جن کی طرف وہ رجوع کرتے ہیں۔ اور اسی لیے اللہ نے ہمیں اس سے بچایا، پس اس نے حس (الحس) کو کلی طور پر غلط نہیں بنایا، اور جو کچھ حس ادراک کرتی ہے وہ حق ہے، کیونکہ وہ پہنچانے والا ہے، وہ حاکم نہیں بلکہ شاہد ہے۔ اور عقل ہی حاکم ہے، اور غلطی حکم میں حاکم کی طرف منسوب ہوتی ہے۔ اور حواس کی غلطی کے قائل اور غیر قائل دونوں کے نزدیک یہ معلوم ہے کہ اگر نظر فاسد ہو تو عقل غلطی کرتی ہے، یعنی فکر کی نظر۔ کیونکہ نظر صحیح اور فاسد میں تقسیم ہوتی ہے۔ پس یہ آگے کی جہت کا معاملہ ہے۔\n\n### [انسان کے بدن کی شہر کی ترتیب]\n\nپھر تمہیں معلوم ہونا چاہیے کہ ذات حق (الحق) نے انسان کو اس کے بدن کی شہر کی ترتیب میں دو حصوں میں تقسیم کیا ہے، اور قلب کو ان دونوں حصوں کے درمیان دو چیزوں کے درمیان فاصل کی طرح بنایا ہے۔ پس اس نے بالائی حصے میں جو کہ سر ہے، تمام حسی اور روحانی قوتیں رکھی ہیں، اور دوسرے نصف میں حسی قوتوں میں سے صرف قوتِ لمس رکھی ہے، پس وہ اپنے حسی روح کے ذریعے جو اس خاص قوت سے پورے بدن میں سرایت کیے ہوئے ہے، کھردری اور نرم، گرم اور ٹھنڈی، تر اور خشک چیزوں کو محسوس کرتا ہے، اس کے علاوہ نہیں۔ اور جہاں تک بدن کی تدبیر سے متعلق طبعی قوتوں کا تعلق ہے، تو وہ قوتِ جاذبہ (کھینچنے والی قوت) ہے، اور اس کے ذریعے نفسِ حیوانی اس چیز کو کھینچتا ہے جو جگر اور دل سے عضو کی اصلاح کے لیے ہوتی ہے۔ اور قوتِ ماسکہ (پکڑنے والی قوت) ہے، اور اس کے ذریعے وہ اس چیز کو روکے رکھتی ہے جسے جاذبہ نے عضو پر کھینچا ہے تاکہ وہ اس میں سے اپنے منافع حاصل کرے۔ اگر تم کہو کہ جب مقصود فائدہ ہے تو جسم میں بیماری کہاں سے داخل ہوئی؟ تو جان لو کہ بیماری اس غذا کی زیادتی سے ہوتی ہے جس کا وہ مستحق ہے یا اس کی کمی سے جس کا وہ مستحق ہے۔ پس اس قوت کے پاس استحقاق کا کوئی میزان نہیں ہے۔ پس اگر اس نے بدن کی ضرورت سے زیادہ کھینچا یا اس سے کم کیا تو بیماری ہو گی۔ کیونکہ اس کی حقیقت کھینچنا ہے، اس کی حقیقت میزان نہیں ہے۔ پس اگر وہ اسے صحیح وزن پر لے لے تو یہ اتفاق سے ہوتا ہے، کسی دوسری قوت کے حکم سے، نہ کہ قصد کے حکم سے۔ اور یہ اس لیے ہے تاکہ مخلوق اپنی کمی کو جان لے اور یہ کہ اللہ **\"جو چاہتا ہے کرتا ہے\"** (سورۃ ابراہیم: ۲۷)۔ اور اسی طرح اس میں قوتِ دافعہ (دفع کرنے والی قوت) بھی ہے، اور اس کے ذریعے بدن پسینہ خارج کرتا ہے۔ کیونکہ طبیعت کسی مخصوص مقدار میں دفع کرنے والی نہیں ہے، کیونکہ وہ میزان سے ناواقف ہے، اور وہ کسی دوسرے امر کے تابع ہے جو مزاج میں عارضی طور پر پیدا ہونے والی فضول چیزوں سے متعلق ہے جو اسے شہوانی قوت دیتی ہے۔ اور اسی طرح یہ سب کچھ پورے بدن میں اوپر اور نیچے سرایت کیے ہوئے ہے۔ اور جہاں تک باقی قوتوں کا تعلق ہے، تو ان کا مقام بالائی نصف ہے، اور وہ اشرف نصف ہے، جو دو حیاتوں، خون کی حیات اور نفس کی حیات، کا مقام ہے۔ پس ان اعضاء میں سے جو بھی عضو مر جاتا ہے، اس سے وہ قوتیں زائل ہو جاتی ہیں جن کا وجود حیات کے وجود سے مشروط تھا۔ اور جو عضو نہیں مرتا اور اس کی قوت کے مقام پر کوئی خلل پیدا ہو جاتا ہے، تو اس کا حکم فاسد ہو جاتا ہے اور وہ گڑبڑ کرتا ہے اور صحیح علم نہیں دیتا، جیسے محلِ خیال (قوتِ متخیلہ کا مقام) میں جب کوئی بیماری آ جاتی ہے، تو خیال باطل نہیں ہوتا، بلکہ جو کچھ وہ دیکھتا ہے اس میں صحت کا قبول کرنا باطل ہو جاتا ہے۔ اور اسی طرح عقل اور ہر روحانی قوت کا حال ہے۔ اور جہاں تک حسی قوتوں کا تعلق ہے، تو وہ بھی موجود ہیں، لیکن ان کے اور ان کے مدرکات کے درمیان اس عضو میں پردے آ جاتے ہیں جس میں وہ قائم ہیں، جیسے آنکھ میں پانی کا اترنا اور دیگر چیزیں۔ اور جہاں تک قوتوں کا تعلق ہے، تو وہ اپنے مقامات پر ہیں، نہ زائل ہوئی ہیں اور نہ ہٹی ہیں، لیکن پردے آ گئے ہیں جنہوں نے روک دیا ہے۔ پس نابینا پردے کا مشاہدہ کرتا ہے اور اسے دیکھتا ہے، اور وہ وہ تاریکی ہے جسے وہ پاتا ہے، پس وہ پردے کی تاریکی ہے۔ پس اس کا مشاہدہ پردہ ہے۔ اور اسی طرح شہد اور شکر چکھنے والا جب اسے کڑوا پاتا ہے، تو ذائقہ کی قوت جس عضو میں قائم ہے، اس سے براہ راست ملنے والی چیز صرف صفراوی کڑواہٹ ہے، اس لیے اس نے کڑواہٹ کا ادراک کیا۔ پس حس کہتا ہے کہ میں نے کڑواہٹ کا ادراک کیا، اور اگر حاکم (عقل) غلطی کرتا ہے تو کہتا ہے کہ یہ شکر کڑوی ہے، اور اگر وہ صحیح فیصلہ کرتا ہے تو علت کو پہچان لیتا ہے اور شکر پر کڑواہٹ کا حکم نہیں لگاتا اور جان لیتا ہے کہ قوت نے کیا ادراک کیا، اور جانتا ہے کہ حس جو کہ شاہد ہے، ہر حال میں صحیح ہے، اور قاضی غلطی بھی کرتا ہے اور صحیح بھی ہوتا ہے۔\n\n### فصل: [نچلی منازل سے ذات حق (الحق) کی معرفت]\n\nاور جہاں تک اس منزل سے ذات حق (الحق) کی معرفت کا تعلق ہے، تو جان لو کہ کائنات کا علمِ ذات (علم الذات) سے کوئی تعلق نہیں ہے۔ بلکہ علم کا تعلق مرتبے (المرتبة) سے ہے، اور وہ مسمیٰ اللہ ہے۔ پس وہی محفوظ ارکان والی دلیل ہے جو الٰہ کی معرفت پر دلالت کرتی ہے، اور اس پر کہ وہ سبحانہ افعال کے اسماء اور جلال کی صفات میں کیسا ہونا چاہیے، اور کس حقیقت کے ذریعے کائنات اس ذات سے صادر ہوتی ہے جو اس مرتبے سے موصوف ہے، جس کی عین (ذات) اور کیفیت (الکیف) مجہول ہے۔ اور ہمارے نزدیک اس میں کوئی اختلاف نہیں ہے کہ وہ معلوم نہیں ہے، بلکہ اس پر تنزیہ (تنزيه) کی صفات کے اوصاف کا اطلاق کیا جاتا ہے جو حدوث (الحدث) کی صفات کی نفی کرتے ہیں، اور قدم اور ازل جو اس کے وجود کے لیے استعمال ہوتے ہیں، وہ صرف سلوب (نفی) پر دلالت کرنے والے اسماء ہیں جو اولیت کی نفی اور حدوث کے لائق چیزوں کی نفی کرتے ہیں۔ اور اس میں متکلمین اشاعرہ کی ایک جماعت ہم سے اختلاف کرتی ہے اور وہ یہ خیال کرتے ہیں کہ انہوں نے ذات حق (الحق) کی کوئی نفسیاتی ثبوتی صفت جان لی ہے، اور یہ کہاں ممکن ہے! اور متکلمین میں سے ایک گروہ جن کا ہم نے مشاہدہ کیا، جیسے ابو عبد اللہ کتانی، ابو العباس اشقر، اور ضریر سلاوی، جو علم کلام میں ارجوزہ کے مصنف ہیں، ابو سعید الخراز اور ابو حامد اور ان جیسے دیگر، ان کے اس قول کو اختیار کیا کہ اللہ کو اللہ کے سوا کوئی نہیں جانتا۔ اور ہمارے اصحاب میں اختلاف صرف اللہ تعالیٰ کے دیدار کے بارے میں ہے کہ جب ہم اسے آخرت میں آنکھوں سے دیکھیں گے تو کیا دیکھیں گے، اور ان کا کلام اس بارے میں ہمارے اصحاب کے نزدیک معلوم ہے۔ اور ہم نے اس کتاب میں اس کی تحقیق کو اس کی منازل کے ابواب اور دیگر ابواب میں اشارے کے طریقے سے متفرق طور پر بیان کیا ہے، نہ کہ صراحت کے ساتھ، کیونکہ یہ ایک تنگ میدان ہے جہاں عقلیں ٹھہر جاتی ہیں کیونکہ یہ ان کی دلیلوں سے متصادم ہوتا ہے۔ پس وہ سبحانہ اسی صورت پر مرئی ہو گا جو اس نے خود بیان کی اور جو رسول اللہ صلی اللہ علیہ وسلم نے بیان کی، اور اس کے مطابق جو اس نے اس سے ارادہ کیا۔ کیونکہ جن لوگوں نے اس بات پر غور کیا جو اس نے کہا اور جو ہماری طرف وحی کیا گیا، انہوں نے اس کی تاویل میں اختلاف کیا، اور بعض وجوہ بعض سے زیادہ اولیٰ نہیں ہیں، لہٰذا ہم نے اس میں غور و خوض ترک کر دیا، اگرچہ اس میں اختلاف ہمارے کلام یا اس میں ہماری پیش کردہ باتوں سے دنیا میں ختم نہیں ہو گا۔\n\n### فصل: [اوتاد (الأوتاد) کے مراتب اور ان کی منازل]\n\nاور جہاں تک اوتاد (الأوتاد) کا معاملہ ہے جن کی معرفت کا تعلق اس باب سے ہے، تو جان لو کہ اوتاد (الأوتاد) جن کے ذریعے اللہ دنیا کو محفوظ رکھتا ہے، وہ چار ہیں، پانچواں کوئی نہیں۔ اور وہ ابدال (الأبدال) سے زیادہ خاص ہیں، اور دو امام ان سے زیادہ خاص ہیں، اور قطب (القطب) اس جماعت میں سب سے زیادہ خاص ہے۔ اور ابدال (الأبدال) کا لفظ اس طریق میں مشترک لفظ ہے؛ وہ ابدال کا اطلاق ان لوگوں پر کرتے ہیں جن کی مذموم صفات محمود صفات سے بدل گئی ہوں، اور وہ اس کا اطلاق ایک خاص تعداد پر بھی کرتے ہیں، اور وہ بعض کے نزدیک چالیس ہیں، ایک ایسی صفت کی وجہ سے جس میں وہ جمع ہوتے ہیں۔ اور ان میں سے بعض نے کہا کہ ان کی تعداد سات ہے۔ اور جن لوگوں نے سات کہا، ان میں سے بعض نے سات ابدال (الأبدال) کو اوتاد (الأوتاد) سے خارج اور ممتاز قرار دیا، اور ہم میں سے بعض نے کہا کہ چار اوتاد (الأوتاد) ابدال میں سے ہیں۔ پس ابدال سات ہیں، اور ان سات میں سے چار اوتاد ہیں، اور دو امام ہیں، اور ایک قطب (القطب) ہے۔ اور یہ پوری جماعت ابدال ہے۔ اور انہوں نے کہا کہ انہیں ابدال اس لیے کہا گیا کہ جب ان میں سے کوئی ایک مر جاتا ہے تو دوسرا اس کا بدل بن جاتا ہے۔ اور چالیس میں سے ایک لیا جاتا ہے، اور چالیس کی تعداد تین سو میں سے ایک کے ذریعے پوری کی جاتی ہے، اور تین سو کی تعداد صالح مومنین میں سے ایک کے ذریعے پوری کی جاتی ہے۔ اور کہا گیا کہ انہیں ابدال اس لیے کہا گیا کہ انہیں یہ قوت دی گئی ہے کہ وہ اپنے نفسوں میں پیدا ہونے والے کسی امر کی بنا پر، اپنے علم کے ساتھ، جہاں چاہیں اپنا بدل چھوڑ کر جا سکتے ہیں۔ پس اگر یہ ان کے علم کے ساتھ نہ ہو تو وہ اس مقام کے اصحاب میں سے نہیں ہے۔ پس وہ امت کے صالحین میں سے ہو سکتا ہے یا افراد میں سے ہو سکتا ہے۔ اور ان چار اوتاد (الأوتاد) کے لیے وہی روحانیت ہے جو ہم نے اس سے پچھلے باب میں ابدال کے لیے ذکر کی تھی، یعنی الٰہی روحانیت اور الی روحانیت۔ پس ان میں سے ایک قلبِ آدم پر ہے، اور دوسرا قلبِ ابراہیم پر، اور تیسرا قلبِ عیسیٰ پر، اور چوتھا قلبِ محمد علیہم السلام پر ہے۔ پس ان میں سے ایک کو اسرافیل کی روحانیت مدد دیتی ہے، اور دوسرے کو میکائیل کی روحانیت، اور تیسرے کو جبریل کی روحانیت، اور چوتھے کو عزرائیل کی روحانیت۔ اور ہر وتد کے لیے بیت اللہ کے ارکان میں سے ایک رکن ہے۔ پس جو قلبِ آدم علیہ السلام پر ہے، اس کے لیے رکنِ شامی ہے، اور جو قلبِ ابراہیم پر ہے، اس کے لیے رکنِ عراقی ہے، اور جو قلبِ عیسیٰ علیہ السلام پر ہے، اس کے لیے رکنِ یمانی ہے، اور جو قلبِ محمد صلی اللہ علیہ وسلم پر ہے، اس کے لیے حجر اسود کا رکن ہے، اور وہ الحمد للہ ہمارے لیے تھا۔ اور ہمارے زمانے میں ارکان میں سے ایک ربیع بن محمود الماردینی الحطاب تھے۔ جب وہ فوت ہوئے تو ان کی جگہ دوسرے شخص نے لی۔ اور شیخ ابو علی الہواری کو اللہ نے ان کے کشف (الکشف) میں ان سے واقف کرایا تھا اس سے پہلے کہ وہ انہیں پہچانیں اور ان کی صورتوں کی تحقیق کریں۔ پس وہ اس وقت تک فوت نہیں ہوئے جب تک انہوں نے ان میں سے تین کو عالمِ حس میں نہیں دیکھ لیا۔ انہوں نے ربیع الماردینی کو دیکھا، اور دوسرے کو دیکھا جو ایک فارسی شخص تھے، اور ہمیں دیکھا اور ہمارے ساتھ رہے یہاں تک کہ وہ پانچ سو ننانوے (۵۹۹ھ) میں فوت ہو گئے۔ انہوں نے مجھے یہ خبر دی اور کہا کہ میں نے چوتھے کو نہیں دیکھا، اور وہ ایک حبشی شخص ہیں۔ اور جان لو کہ یہ اوتاد (الأوتاد) بہت سے علوم پر حاوی ہوتے ہیں۔ پس وہ علم جو ان کے لیے ضروری ہے اور جس کے ذریعے وہ اوتاد بنتے ہیں، اس سے جو علوم زیادہ ہوتے ہیں، تو ان میں سے بعض کے پاس پندرہ علوم ہوتے ہیں، اور بعض کے پاس اٹھارہ علوم کا ہونا ضروری ہے، اور بعض کے پاس اکیس علوم ہوتے ہیں، اور بعض کے پاس چوبیس علوم ہوتے ہیں۔ کیونکہ اعداد کی اقسام بہت ہیں۔ یہ تعداد ان علوم کی اقسام میں سے ہے جو ان میں سے ہر ایک کے لیے ضروری ہے۔ اور ہو سکتا ہے کہ ایک شخص یا وہ سب، یا وہ سب مل کر، جماعت کا علم اور اس سے زیادہ جمع کر لیں، لیکن ان میں سے ہر ایک کے لیے خاص وہ تعداد ہے جو ہم نے ذکر کی، پس یہ اس میں شرط ہے۔ اور ہو سکتا ہے کہ اس کے پاس یا ان میں سے کسی کے پاس کوئی زائد علم نہ ہو، نہ ان کے اصحاب کے پاس سے اور نہ ان کے پاس سے جو ان کے پاس نہیں ہے۔ پس ان میں سے ایک کے لیے وجہ (سامنے کی جہت) ہے، اور وہ ابلیس کے بارے میں اللہ تعالیٰ کا قول ہے: **\"پھر میں ان کے پاس ان کے آگے سے اور ان کے پیچھے سے اور ان کے دائیں سے اور ان کے بائیں سے آؤں گا\"** (سورۃ الاعراف: ۱۷)۔ اور ہر جہت کے لیے ایک وتد (الوتد) ہے جو قیامت کے دن اس شخص کی شفاعت کرے گا جس پر ابلیس اس کی جہت سے داخل ہوا تھا۔ پس جس کے لیے وجہ (سامنے کی جہت) ہے، اس کے لیے علوم میں سے علمِ اصطلام (مغلوبیت)، وجد، شوق، عشق، مسائل کی گہرائیاں، علمِ نظر، علمِ ریاضت، علمِ طبیعت، علمِ الٰہی، علمِ میزان، علمِ انوار، علمِ سبحاتِ وجہیہ، علمِ مشاہدہ، علمِ فنا (الفناء)، علمِ تسخیرِ ارواح، علوی روحانیات کو نازل کرنے کا علم، علمِ حرکت، علمِ ابلیس، علمِ مجاہدہ، علمِ حشر، علمِ نشر، علمِ اعمال کے میزان، علمِ جہنم، اور علمِ صراط ہے۔ اور جس کے لیے شمال (بائیں) کی جہت ہے، اس کے لیے علمِ اسرار، علمِ غیوب، علمِ خزانوں، علمِ نباتات، علمِ معدنیات، علمِ حیوانات، پوشیدہ امور کا علم، علمِ پانیوں، علمِ تکوین، علمِ تلوین، علمِ رسوخ، علمِ ثبات، علمِ مقام، علمِ قدم، مقوم فصول کا علم، اعیان کا علم، علمِ سکون، علمِ دنیا، علمِ جنت، علمِ خلود، اور علمِ انقلابات ہے۔ اور جس کے لیے یمین (دائیں) کی جہت ہے، اس کے لیے علمِ برازخ، برزخی ارواح کا علم، منطق الطیر (پرندوں کی بولی کا علم)، زبانِ ریاح (ہواؤں کی زبان کا علم)، علمِ تنزل، علمِ استحالات، علمِ زجر، علمِ مشاہدہ ذات، نفوس کو حرکت دینے کا علم، علمِ میل، علمِ معراج، علمِ رسالت، علمِ کلام، علمِ انفاس، علمِ احوال، علمِ سماع، علمِ حیرت، اور علمِ ہوس ہے۔ اور جس کے لیے خلف (پیچھے) کی جہت ہے، اس کے لیے علمِ حیات، عقائد سے متعلق احوال کا علم، علمِ نفس، علمِ تجلی (التجلی)، علمِ منصات، علمِ نکاح، علمِ رحمت، علمِ تعاطف، علمِ تودد، علمِ ذوق، علمِ شرب، علمِ سیرابی، جواہرِ قرآن کا علم، دررِ فرقان کا علم، اور نفسِ امارہ کا علم ہے۔ پس ہر شخص کے لیے جیسا کہ ہم نے ذکر کیا، ان علوم کا ہونا ضروری ہے، اور جو اس سے زیادہ ہو، وہ الٰہی اختصاص میں سے ہے۔ پس ہم نے اوتاد (الأوتاد) کے مراتب بیان کر دیے ہیں، اور اس سے پچھلے باب میں ہم نے ابدال (الأبدال) کے لیے خاص چیزیں بیان کی تھیں، اور اس کتاب کے منازل کے ایک فصل میں ہم نے قطب (القطب) اور دو اماموں کے لیے خاص چیزیں بیان کی ہیں، جو اس کے اصول کے ساتھ مکمل ہیں، اور وہ اس کتاب کے ابواب میں سے دو سو سترواں باب ہے۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "«باب شانزدهم» در معرفت منازل سُفلی (المنازل السفلية) و علوم کونی (العلوم الكونية) و مبدأ معرفت حق (الله) از این منازل، و معرفت اوتاد (الأوتاد) و ابدال (الأبدال) و ارواح علوی (الأرواح العلوية) که متولی امور آن‌ها هستند و ترتیب افلاکشان.\n\nعلم کثائف، پرچم‌هایی مرتب است\nکه راهنمای مطلوب برای رسولان است\nو آن علمی است که اسرار صاحب حیرت را پوشانده\nو آن علمی است که نشانه‌های راه‌ها را آشکار کرده است\nاز عالم علوی، هفت سیاره برای آن است\nاز هلال (ماه) بگیر و تا زحل بالا برو\nبنگر به کسی که چهار اوتاد (الأوتاد) را هستی بخشید\nکه زمین را با آن‌ها استوار کرد و از لرزش بازداشت\nهنگامی که کسی که باید بر آن باشد، بر آن مستقر شد\nپس از این مَثَل شگفت‌زده شو، که چه مَثَل کاملی است.\n\n### [چهار منفذ شیطان از چهار جهت انسان]\n\nبدان، خداوند تو را تأیید کند، که ما در باب پیش از این، منازل ابدال (الأبدال) و مقاماتشان و ارواح علوی (الأرواح العلوية) که متولی آن‌ها هستند و ترتیب افلاکشان و آثاری که نیرات (اجرام نورانی) در آن‌ها دارند و اقالیمی که به آن‌ها اختصاص دارد را ذکر کردیم. پس در این باب آنچه را که باقی مانده و عنوان آن منازل سُفلی (المنازل السفلية) است، ذکر می‌کنیم. منازل سُفلی در اینجا عبارت است از چهار جهتی که شیطان از آن‌ها به سوی انسان می‌آید و ما آن‌ها را سُفلی نامیدیم، زیرا شیطان از عالم سُفل (پایین) است و جز از منازلی که با او تناسب دارند، یعنی راست، چپ، پشت و جلو، به سوی انسان نمی‌آید. خداوند متعال می‌فرماید: «ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ» (سپس از پیش رو و از پشت سر و از راست و از چپشان به سراغشان می‌آیم).\n\nشیطان بر ضد انسان از طبع او یاری می‌جوید، زیرا طبع در آنچه او را به سوی پیروی از شهوات می‌خواند، یاور شیطان است. پس انسان مأمور شده است که از این جهات با شیطان بجنگد و این جهات را با آنچه شرع به او امر کرده است، مستحکم سازد تا شیطان راهی برای ورود از آن‌ها نیابد. اگر شیطان از پیش رویت به سراغ تو آمد و او را راندی، علوم نور (علوم النور) بر تو آشکار می‌شود؛ این منّتی از جانب حق (الله) بر تو و پاداشی است به سبب اینکه تو جانب حق (الله) را بر هوای نفس خود ترجیح دادی. علوم نور (علوم النور) بر دو قسم است: علوم کشف (كشف) و علوم برهان (برهان) که از طریق تفکر صحیح به دست می‌آید. از طریق برهان (برهان)، آنچه را که شبهات گمراه‌کننده و طعنه‌زننده بر وجود حق (الحق)، توحید او، اسماء و افعال اوست، دفع می‌کند. پس با برهان (برهان) بر معطّله (منکران صفات) رد می‌کند و بر اثبات وجود خداوند دلالت می‌نماید. و با آن بر اهل شرک که «الَّذِينَ يَجْعَلُونَ مَعَ الله إِلهاً آخَرَ» (کسانی که با خداوند، خدای دیگری قرار می‌دهند) رد می‌کند و بر توحید خداوند از جهت الوهیت او دلالت می‌نماید. و با آن بر کسانی که احکام اسماء الهی و صحت آثار آن‌ها را در هستی (الكون) نفی می‌کنند، رد می‌کند و بر اثبات آن‌ها با برهان (برهان) سمعی از طریق اطلاق و با برهان (برهان) عقلی از طریق معانی دلالت می‌نماید. و با آن بر نفی‌کنندگان افعال از فلاسفه رد می‌کند و دلالت می‌نماید بر اینکه او سبحانه فاعل است و مفعولات، مراد او هستند، چه از طریق سمع و چه از طریق عقل. و اما علوم کشف (كشف)، آن چیزی است که از معارف الهی در تجلیات (التجلیات) در مظاهر برای سالک حاصل می‌شود.\n\nو اگر شیطان از پشت سرت به سراغ تو آمد، که تو را به گفتن آنچه نمی‌دانی بر حق (الله) و ادعای نبوت و رسالت و اینکه خداوند به تو وحی کرده است، فرامی‌خواند؛ این بدان سبب است که شیطان در هر ملتی، به هر صفتی که شارع، مذمت را بر آن در آن امت مترتب کرده است، می‌نگرد و تو را به آن امر می‌کند، و از هر صفتی که ستایش را بر آن مترتب کرده است، تو را نهی می‌کند. این حکم به طور مطلق است، در حالی که فرشته برعکس او عمل می‌کند؛ تو را به صفات ستوده امر می‌کند و از صفات نکوهیده نهی می‌نماید. پس اگر او را از پشت سرت راندی، علوم صدق و منازل آن و اینکه صاحبش به کجا می‌رسد، بر تو آشکار می‌شود، چنانکه خداوند متعال می‌فرماید: «فِي مَقْعَدِ صِدْقٍ» (در جایگاه صدق). با این حال، این صدق آن‌هاست که آنان را در آن جایگاه «عِنْدَ مَلِيكٍ مُقْتَدِرٍ» (نزد پادشاهی مقتدر) نشانده است. زیرا اقتدار با صدق تناسب دارد، چرا که معنای آن قوی است. گفته می‌شود: «رمح صدق» (نیزه صدق)، یعنی محکم و قوی. و چون قوت، صفت این صادق بود، زیرا بر نفس خود قوی شد و به آنچه از آنِ او نبود، آراسته نشد و حق را در گفتار، احوال و افعال خود لازم گرفت و در آن‌ها صادق بود، حق (الحق) او را «عِنْدَ مَلِيكٍ مُقْتَدِرٍ» (نزد پادشاهی مقتدر) نشاند؛ یعنی او را بر قوت الهی که به او در صدقش قوت بخشیده بود، آگاه ساخت. زیرا «ملک» نیز به معنای شدید است و با «مقتدر» مناسبت دارد. قیس بن حطیم در وصف ضربه‌ای می‌گوید:\n\nملکت بها کفی فانهرت فتقها *** یری قائم من دونها ما وراءها\n(با آن، دستم را محکم کردم، پس شکافش گشوده شد * کسی که پایین‌تر از آن ایستاده، پشت آن را می‌بیند)\n\nیعنی دستم را با آن محکم کردم. پس اگر با شیطان در این امری که به سراغ تو آمده است، مخالفت کنی، علم تعلق اقتدار الهی به ایجاد برای تو حاصل می‌شود، که این خود مسئله‌ای اختلافی میان اهل حقائق (أهل الحقائق) از اصحاب ماست. و همچنین علم عصمت و حفظ الهی برای تو حاصل می‌شود تا نه وهم تو و نه غیر تو در تو تأثیر نگذارد و برای پروردگارت خالص شوی.\n\nو اگر از جهت راست به سراغ تو آمد و بر او غلبه یافتی و او را دفع کردی، زیرا وقتی از این جهت که به قوت توصیف شده است، می‌آید، برای تضعیف ایمان و یقین تو می‌آید و شبهاتی را در دلایل و مکاشفات تو می‌اندازد. زیرا او در هر کشفی (الكشف) که حق (الحق) تو را بر آن آگاه می‌سازد، امری از عالم خیال برای تو برپا می‌کند که شبیه حال تو در آن زمان است. پس اگر علم قوی نداشته باشی که با آن میان حق و آنچه شیطان برای تو خیال‌پردازی می‌کند، تمایز قائل شوی، مقام تو موسوی نخواهد بود وگرنه امر بر تو مشتبه می‌شود، چنانکه ساحران برای مردم عادی خیال کردند که طناب‌ها و عصاها مار هستند، در حالی که چنین نبود.\n\n### [عصای موسی و طناب‌های ساحران]\n\nموسی (علیه السلام) هنگامی که عصای خود را انداخت و «حَيَّةٌ تَسْعى‏» (ماری شد که به سرعت حرکت می‌کرد)، طبق روال عادی از آن بر خود ترسید. اما خداوند معرفت این امر را پیش از جمع شدن ساحران برای او فراهم کرده بود تا بر یقین باشد که آن یک آیه (نشانه) است و به او ضرر نمی‌رساند. ترس دوم او هنگامی بود که ساحران طناب‌ها و عصاهای خود را انداختند و در چشمان حاضران به صورت مار درآمدند. این ترس برای امت بود تا امر بر آن‌ها مشتبه نشود و میان خیال و حقیقت یا میان آنچه از جانب حق (الله) است و آنچه از جانب حق (الله) نیست، فرق بگذارند. پس تعلق دو ترس متفاوت بود. موسی (علیه السلام) بر بینه‌ای از پروردگارش بود و به سبب آنچه پیشتر به او گفته شده بود، قوی‌دل بود، زیرا در انداختن اول به او گفته شد: «خُذْها ولا تَخَفْ سَنُعِيدُها سِيرَتَهَا الْأُولى‏» (آن را بگیر و نترس، ما آن را به حالت اولش بازمی‌گردانیم)؛ یعنی در چشم تو دوباره عصا خواهد شد. پس خداوند متعال عصا را در روحانیت مار برزخی پنهان کرد و آن مار، تمام مارهای ساحران را که در چشمان حاضران خیال شده بودند، بلعید. در نتیجه، برای آن طناب‌ها و عصاها در چشمان آن‌ها هیچ عین ظاهری باقی نماند. این همان ظهور حجت موسی بر حجت‌های آن‌ها در صورت طناب‌ها و عصاها بود. پس ساحران و مردم، طناب‌ها و عصاهای ساحران را که انداخته بودند، به صورت طناب و عصا دیدند. این بود بلعیدن آن، نه اینکه طناب‌ها و عصاها معدوم شدند؛ زیرا اگر معدوم می‌شدند، در مورد عصای موسی نیز بر آن‌ها تدلیس (اشتباه‌اندازی) وارد می‌شد و شبهه به آن‌ها راه می‌یافت. هنگامی که مردم طناب‌ها را به صورت طناب دیدند، دانستند که آن یک مکر طبیعی است که با نیروی مکرآمیز روحانی تقویت شده است. پس عصای موسی، صورت مارهای حاصل از طناب‌ها و عصاها را بلعید، همان‌گونه که سخن خصم اگر بر حق نباشد، از حجیت ساقط می‌شود، نه اینکه آنچه آورده است معدوم شود، بلکه نزد شنوندگان محفوظ و معقول باقی می‌ماند و حجیت آن از بین می‌رود. هنگامی که ساحران قدرت حجتی را که موسی آورده بود، دانستند و اینکه آن خارج از حیله‌های شناخته شده در سحر است و برتری آنچه او آورده بود بر آنچه خود آورده بودند، برایشان محقق شد و ترس موسی را دیدند، دانستند که آن از جانب حق (الله) است؛ زیرا اگر از جانب خودش بود، نمی‌ترسید، چون می‌دانست چه اتفاقی می‌افتد. پس نشانه (آیه) موسی نزد ساحران، ترس او بود و نشانه او نزد مردم، بلعیدن عصایش بود. پس ساحران ایمان آوردند؛ گفته شده هشتاد هزار ساحر بودند. و دانستند که بزرگترین آیه (نشانه) در این موطن، بلعیدن این صور از چشمان ناظران و باقی ماندن صورت مار عصای موسی در چشمان آن‌هاست، در حالی که حال نزد آن‌ها یکی بود. پس صدق موسی را در آنچه به آن دعوت می‌کرد، دانستند و اینکه آنچه او آورده، خارج از صور و حیله‌های معلوم در سحر است و امری الهی است که موسی (علیه السلام) در آن تصرفی ندارد. پس با بصیرت به رسالت او ایمان آوردند و عذاب فرعون را بر عذاب حق (الله) ترجیح دادند و آخرت را بر دنیا مقدم داشتند و از علم خود به این امر دانستند که «أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ» (که خداوند بر هر چیزی تواناست) و «أَنَّ الله قَدْ أَحاطَ بِكُلِّ شَيْ‏ءٍ عِلْماً» (و اینکه خداوند علمش بر هر چیزی احاطه دارد) و اینکه حقائق (الحقائق) دگرگون نمی‌شوند و عصای موسی در صورت مار، از چشمان همگان و از کسی که آن را انداخت (موسی) به سبب ترسی که از او مشاهده کردند، پنهان بود. این است فایده علم.\n\n### [تشکیک در حواس و خطای سوفسطائیان]\n\nو اگر شیطان از جهت شمال با شبهات تعطیل (نفی صفات) یا وجود شریک برای خداوند متعال در الوهیتش به سراغ تو آمد و او را راندی، خداوند تو را بر آن با دلایل توحید و علم نظر (فلسفی) تقویت می‌کند. پس جهت پشت سر (الخلف) برای معطّله (منکران صفات) و دفع آن‌ها با ضرورت علمی است که وجود باری تعالی با آن دانسته می‌شود. پس پشت سر برای تعطیل (نفی صفات) است و شمال برای شرک و راست برای ضعف (ایمان) و پیش رو (بین أیدیهم) برای تشکیک در حواس است. و از همین جا تدلیس (اشتباه‌اندازی) بر سوفسطائیان وارد شد، زیرا خطا در حواس را برای آن‌ها وارد کرد، در حالی که حواس همان چیزی است که اهل نظر در صحت دلایل خود و در علم الهی و غیر آن به بدیهیات استناد می‌کنند. هنگامی که خطا در آن را برای آن‌ها آشکار کرد، گفتند: اصلاً علمی وجود ندارد که بتوان به آن اعتماد کرد. اگر به آن‌ها گفته شود: پس این خود علم است که علمی وجود ندارد، مستند شما چیست، در حالی که شما به آن قائل نیستید؟ می‌گویند: ما نیز می‌گوییم که این سخن ما علم نیست و از جمله اغالیط (اشتباهات) است. به آن‌ها گفته می‌شود: پس شما دانستید که این سخن شما علم نیست و اینکه می‌گویید این نیز از جمله اغالیط است، اثبات چیزی است که آن را نفی کردید. پس شبهه در آنچه به آن استناد می‌کنند و در ترکیب مقدمات دلایل خود به آن بازمی‌گردند، بر آن‌ها وارد شد. به همین دلیل، خداوند ما را از آن مصون داشت و برای حس، خطای کلی قرار نداد، بلکه آنچه را که حس درک می‌کند، حق است، زیرا حس، رساننده است، نه حاکم، بلکه شاهد است. و تنها عقل است که حاکم است و خطا به حاکم در حکم نسبت داده می‌شود. و نزد کسانی که قائل به خطای حس هستند و کسانی که قائل نیستند، معلوم است که عقل هنگامی که نظر (فکر) فاسد باشد، خطا می‌کند؛ منظورم نظر فکری است، زیرا نظر به صحیح و فاسد تقسیم می‌شود. پس این (تشکیک در حواس) از جهت پیش روی آن‌هاست.\n\n### [ترتیب شهر بدن انسان]\n\nسپس بدان که حق (الحق) انسان را در ترتیب شهر بدنش به دو بخش تقسیم کرده و قلب را میان این دو بخش، مانند جداکننده دو چیز قرار داده است. در بخش بالایی که سر است، تمام قوای حسی و روحانی را قرار داده است. و در نیمه دیگر از قوای حساسه، جز حاسه لمس را قرار نداده است. پس زبر و نرم، گرم و سرد، تر و خشک را با روح حساس خود از جهت این نیروی خاص که در تمام بدنش جاری است، درک می‌کند و نه چیز دیگر. و اما از قوای طبیعی مربوط به تدبیر بدن، قوه جاذبه است که با آن، نفس حیوانی آنچه را که صلاح عضو است، از کبد و قلب جذب می‌کند. و قوه ماسکه (نگهدارنده) است که با آن، آنچه را که جاذبه جذب کرده است، بر عضو نگه می‌دارد تا عضو منافع خود را از آن بگیرد. اگر بگویی: پس اگر مقصود منفعت است، بیماری از کجا وارد جسم می‌شود؟ بدان که بیماری از زیاده بر آنچه از غذا استحقاق دارد یا نقص از آنچه استحقاق دارد، ناشی می‌شود. این قوه، میزان استحقاق را ندارد. پس اگر بیش از نیاز بدن جذب کند یا کمتر از آن، بیماری رخ می‌دهد، زیرا حقیقت آن جذب است، نه میزان. پس اگر آن را بر وزن صحیح بگیرد، این به حکم اتفاق است و از قوه دیگری است، نه به حکم قصد. و این برای آن است که مُحدَث (مخلوق) نقص خود را بداند و اینکه «أَنَّ الله يَفْعَلُ ما يُرِيدُ» (خداوند آنچه را می‌خواهد انجام می‌دهد). همچنین در بدن، قوه دافعه نیز وجود دارد که با آن بدن عرق می‌کند. طبیعت به مقدار مخصوص دفع نمی‌کند، زیرا میزان را نمی‌داند و محکوم به امر دیگری است که از فضول (مواد زائد) است که در مزاج عارض می‌شود و قوه شهوانی آن را می‌دهد. همچنین این همه در تمام بدن، بالا و پایین، جاری است. اما سایر قوا، محل آن‌ها نیمه بالایی است که نیمه شریف‌تر است و محل وجود دو حیات، یعنی حیات خون و حیات نفس است. هر عضوی از این اعضا که بمیرد، قوایی که در آن بود و وجودشان مشروط به وجود حیات بود، از بین می‌رود. و اگر عضو نمیرد و در محل قوه‌ای خللی عارض شود، حکم آن فاسد می‌شود و به هم می‌ریزد و علم صحیحی نمی‌دهد، مانند محل خیال که اگر در آن علتی عارض شود، خیال باطل نمی‌شود، بلکه پذیرش صحت در آنچه علم می‌بیند، باطل می‌شود. و همچنین عقل و هر قوه روحانی دیگر. و اما قوای حسی نیز موجودند، اما حجاب‌هایی میان آن‌ها و مدرکاتشان در عضوی که در آن مستقرند، عارض می‌شود، مانند آبی که در چشم فرود می‌آید و غیر آن. اما قوا در محل‌های خود هستند و زایل نشده‌اند، بلکه حجاب‌ها عارض شده و مانع شده‌اند. پس نابینا حجاب را مشاهده می‌کند و آن را می‌بیند، که همان ظلمتی است که می‌یابد. پس آن ظلمت حجاب است و مشهود او حجاب است. و همچنین کسی که عسل و شکر را می‌چشد و آن را تلخ می‌یابد، آنچه مستقیماً با عضوی که قوه ذوق در آن مستقر است، تماس می‌یابد، همان صفرا (زردآب) است. به همین دلیل، تلخی را درک می‌کند. پس حس می‌گوید: تلخی را درک کردم. و حاکم (عقل) اگر خطا کند، می‌گوید: این شکر تلخ است. و اگر درست حکم کند، علت را می‌شناسد و بر شکر حکم به تلخی نمی‌کند و می‌داند که قوه چه چیزی را درک کرده است و می‌داند که حس که شاهد است، در هر حال مصیب است و قاضی (عقل) خطا می‌کند و درست می‌گوید.\n\n### «فصل» [معرفت حق (الحق) از منازل سُفلی (المنازل السفلية)]\n\nو اما معرفت حق (الحق) از این منزل، بدان که هستی (الكون) اصلاً به علم ذات تعلق ندارد، بلکه متعلق علم به مرتبه است که همان مسمای حق (الله) است. پس او دلیل محفوظ‌الارکان است که راهنمای معرفت خداوند و آنچه بر او سبحانه از اسماء افعال و نُعوت جلال واجب است و اینکه هستی (الكون) با چه حقیقتی از این ذات که به این مرتبه توصیف شده و عین و چگونگی‌اش مجهول است، صادر می‌شود. نزد ما اختلافی نیست که ذات دانسته نمی‌شود، بلکه بر آن نُعوت تنزیهی از صفات حَدَث (مخلوق) اطلاق می‌شود و اینکه قِدَم و اَزَل که بر وجود او اطلاق می‌شود، تنها اسم‌هایی هستند که بر سَلْب (نفی) اولیت و آنچه شایسته حدوث است، دلالت می‌کنند. گروهی از متکلمان اشاعره با ما در این مورد مخالفند و خیال می‌کنند که صفتی نفسی و ثبوتی از حق (الحق) را دانسته‌اند، اما هیهات که چگونه می‌توانند به آن دست یابند؟ و گروهی از متکلمان که ما آن‌ها را مشاهده کردیم، مانند ابوعبدالله کتانی، ابوالعباس اشقر، و ضریر سلاوی صاحب ارجوزه در علم کلام بر ابوسعید خراز و ابوحامد و امثال آن‌ها، بر این قول هستند که «خداوند را جز خداوند نمی‌شناسد». اما اصحاب ما در مورد رؤیت خداوند متعال، هنگامی که او را در سرای آخرت با چشم می‌بینیم، اختلاف کرده‌اند که چه چیزی را می‌بینیم. سخن آن‌ها در این باره نزد اصحاب ما معلوم است و ما تحقیق آن را در این کتاب به صورت پراکنده در ابواب منازل و غیر آن به طریق ایماء (اشاره) آورده‌ایم، نه به تصریح، زیرا این میدان تنگی است که عقول در آن به دلیل تناقض با دلایل خود، متوقف می‌شوند. پس او سبحانه مرئی است بر وجهی که خود فرموده و رسول خدا (صلی الله علیه و سلم) فرموده است و بر آنچه از آن اراده کرده است. زیرا کسانی که در آنچه او فرموده و به ما وحی شده است، نظر کرده‌اند، در تأویل آن اختلاف کرده‌اند و هیچ یک از وجوه بر دیگری اولویت ندارد. پس ما از ورود در این بحث خودداری کردیم، زیرا اختلاف در آن با سخن ما یا آنچه در آن می‌آوریم، از عالم برطرف نمی‌شود.\n\n### «فصل» [در مراتب اوتاد (الأوتاد) و منازلشان]\n\nو اما سخن از اوتاد (الأوتاد) که معرفت آن‌ها به این باب تعلق دارد، بدان که اوتاد (الأوتاد) که خداوند عالم را به واسطه آن‌ها حفظ می‌کند، چهار نفرند و پنجمی ندارند. آن‌ها از ابدال (الأبدال) خاص‌ترند و دو امام از آن‌ها خاص‌ترند و قطب (القطب) خاص‌ترینِ این جماعت است. ابدال (الأبدال) در این طریق، لفظی مشترک است؛ آن را بر کسی اطلاق می‌کنند که اوصاف نکوهیده او به اوصاف ستوده تبدیل شده باشد، و آن را بر عدد خاصی نیز اطلاق می‌کنند که نزد برخی چهل نفرند به دلیل صفتی که در آن جمع می‌شوند. و برخی گفته‌اند تعداد آن‌ها هفت نفر است. از کسانی که هفت نفر گفته‌اند، برخی از ما هفت ابدال (الأبدال) را خارج از اوتاد (الأوتاد) و متمایز از آن‌ها قرار داده‌اند، و برخی گفته‌اند که چهار اوتاد (الأوتاد) از ابدال (الأبدال) هستند، پس ابدال (الأبدال) هفت نفرند که از این هفت نفر، چهار نفر اوتاد (الأوتاد) هستند و دو نفر امامان و یک نفر قطب (القطب) است، و این مجموعه همان ابدال (الأبدال) هستند. و گفته‌اند که آن‌ها را ابدال (الأبدال) نامیده‌اند، زیرا هرگاه یکی از آن‌ها بمیرد، دیگری جایگزین او می‌شود. و یکی از چهل نفر گرفته می‌شود و چهل نفر با یکی از سیصد نفر کامل می‌شود و سیصد نفر با یکی از صالحان مؤمنان کامل می‌شود. و گفته شده است که آن‌ها را ابدال (الأبدال) نامیده‌اند، زیرا به آن‌ها این قدرت داده شده است که هر جا بخواهند، برای امری که در نفسشان بر اساس علم آن‌ها پدید می‌آید، بدل (جایگزین) خود را بگذارند. اگر این کار بر اساس علم آن‌ها نباشد، از اصحاب این مقام نیستند، بلکه ممکن است از صالحان امت یا از افراد (الأفراد) باشند. این چهار اوتاد (الأوتاد) همانند ابدال (الأبدال) که در باب پیش از این ذکر کردیم، دارای روحانیت الهی و روحانیت اِلی (مربوط به ابزار) هستند. یکی از آن‌ها بر قلب آدم، دیگری بر قلب ابراهیم، دیگری بر قلب عیسی و دیگری بر قلب محمد (علیهم السلام) است. یکی از آن‌ها را روحانیت اسرافیل، دیگری را روحانیت میکائیل، دیگری را روحانیت جبرئیل و دیگری را روحانیت عزرائیل مدد می‌رساند. و برای هر وتد (وتد)، رکنی از ارکان بیت (کعبه) است. آنکه بر قلب آدم (علیه السلام) است، رکن شامی (شمالی) از آن اوست؛ و آنکه بر قلب ابراهیم است، رکن عراقی از آن اوست؛ و آنکه بر قلب عیسی (علیه السلام) است، رکن یمانی از آن اوست؛ و آنکه بر قلب محمد (صلی الله علیه و سلم) است، رکن حجرالأسود از آن اوست، که به حمد حق (الله) این رکن برای ما بود. و یکی از ارکان در زمان ما ربیع بن محمود ماردینی حطّاب بود. هنگامی که او درگذشت، شخص دیگری جانشین او شد. شیخ ابوعلی هواری، خداوند او را در کشفش (كشف) پیش از آنکه آن‌ها را بشناسد، بر آن‌ها آگاه ساخته بود و صور آن‌ها را محقق کرده بود. او نمرد تا اینکه سه نفر از آن‌ها را در عالم حس دید: ربیع ماردینی را دید، و دیگری را که مردی فارسی بود، دید، و ما را دید و تا سال پانصد و نود و نه با ما همراه بود تا درگذشت. او این را به من خبر داد و گفت: چهارمی را که مردی حبشی بود، ندیدم. و بدان که این اوتاد (الأوتاد) علوم بسیار زیادی را در بر دارند. آنچه برای آن‌ها ضروری است و با آن اوتاد (الأوتاد) می‌شوند، علمی است که اگر بر آن افزوده شود، برخی از آن‌ها پانزده علم دارند، برخی هجده علم دارند، برخی بیست و یک علم دارند و برخی بیست و چهار علم دارند. زیرا انواع عدد زیاد است. این تعداد از انواع علوم برای هر یک از آن‌ها ضروری است. و ممکن است یک نفر یا همه آن‌ها، علم جماعت را جمع کنند یا جمع شوند و بیشتر از آن داشته باشند، اما آنچه برای هر یک از آن‌ها خاص است، همان تعداد ذکر شده است که شرط در اوتاد بودن است. و ممکن است هیچ یک از آن‌ها علم زائدی نداشته باشد، نه از آنچه نزد اصحابش است و نه از آنچه نزد آن‌ها نیست. یکی از آن‌ها صاحب وجه (جلو) است که همان قول خداوند متعال از قول ابلیس است: «ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ» (سپس از پیش رو و از پشت سر و از راست و از چپشان به سراغشان می‌آیم). و برای هر جهت، وتدی (وتد) است که روز قیامت برای کسی که ابلیس از جهت او بر او وارد شده است، شفاعت می‌کند. آنکه صاحب وجه (جلو) است، از علوم، علم اصطلام (غرق شدن در حق)، وجد، شوق، عشق، مسائل غامض، علم نظر، علم ریاضت، علم طبیعت، علم الهی، علم میزان، علم انوار، علم سُبحات وجهیه (تجلیات جمال)، علم مشاهده (المشاهدة)، علم فنا (الفناء)، علم تسخیر ارواح، علم استنزال روحانیات عُلی، علم حرکت، علم ابلیس، علم مجاهده، علم حشر، علم نشر، علم موازین اعمال، علم جهنم و علم صراط را داراست. و آنکه صاحب شمال است، علم اسرار، علم غیوب، علم گنج‌ها، علم نبات، علم معدن، علم حیوان، علم امور پنهان، علم آب‌ها، علم تکوین، علم تلوین (تغییر حال)، علم رسوخ، علم ثبات، علم مقام، علم قدم، علم فصول مقوّمه، علم اعیان، علم سکون، علم دنیا، علم بهشت، علم خلود و علم تقلبات (دگرگونی‌ها) را داراست. و آنکه صاحب یمین (راست) است، علم برازخ، علم ارواح برزخی، علم منطق الطیر، علم زبان بادها، علم تنزل، علم استحالات (دگرگونی‌های ماهوی)، علم زجر (نهی)، علم مشاهده ذات، علم تحریک نفوس، علم میل، علم معراج، علم رسالت، علم کلام، علم انفاس، علم احوال، علم سماع، علم حیرت و علم هوی (میل نفسانی) را داراست. و آنکه صاحب خلف (پشت) است، علم حیات، علم احوال مربوط به عقاید، علم نفس، علم تجلی (التجلی)، علم منصات (جایگاه‌ها)، علم نکاح، علم رحمت، علم تعاطف، علم تودد (دوستی)، علم ذوق، علم شرب، علم ری (سیراب شدن)، علم جواهر قرآن، علم دُرَر فرقان و علم نفس امّاره را داراست. پس همان‌طور که ذکر کردیم، هر شخص ناگزیر از داشتن این علوم است و آنچه بر آن افزوده شود، از اختصاص الهی است. این بود بیان مراتب اوتاد (الأوتاد). و ما در باب پیش از این، آنچه را که به ابدال (الأبدال) اختصاص دارد، بیان کردیم و در فصل منازل این کتاب، آنچه را که به قطب (القطب) و دو امام اختصاص دارد، با استیفای اصول در بابی مخصوص به خود که باب دویست و هفتادم از ابواب این کتاب است، بیان کردیم. «وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}