{
  "id": 135,
  "title": {
    "ar": "الباب الخامس والثلاثون ومائة في معرفة ترك الإخلاص وأسراره",
    "en": "Chapter One Hundred and Thirty-Five: Concerning the Gnosis of the Abandonment of Sincerity (ترك الإخلاص) and its Secrets.",
    "ur": "باب ایک سو پینتیس: اخلاص کو ترک کرنے اور اس کے اسرار کی معرفت میں",
    "fa": "باب صد و سی و پنجم در معرفت ترک اخلاص و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الخامس والثلاثون ومائة في معرفة ترك الإخلاص وأسراره)\n\n\n> من أخلص الدين فقد أشركا *** وقيد المطلق من وصفه‏\n\n\n> من يجهل الأمر فذاك الذي *** يدرك ذات المسك من عرفه‏\n\n\n### [رؤية الإخلاص منك في العمل مجوسية محضة]\n\n\nقال رجل للجنيد ومن العالم حتى يذكر مع الله وكان من أهل الأحوال وقال تعالى أَ إِلهٌ مَعَ الله وقال بعضهم رؤية الإخلاص منك في العمل مجوسية محضة يريد الشرك وإنما ينبغي أن يشاهد المكلف مجرى العمل ومنشئه وكان أبو مدين يأمر أصحابه بإظهار الطاعات فإنه لم يكن عنده فاعل إلا الله والتخليص يؤذن بالمنازع ولا بد للمنازع أن يطلب من المكلف أن يكون عبدا له والعمل من جملة أفعال الله الذي المكلف مظهرها فأجهل الناس من يجعل موجد الفعل تحت طاعة من يفعل من أجله وهو إما إبليس وإما الرياء\n\n\n### [العين واحدة وهو على صراط مستقيم‏]\n\n\nإذا كان المكلف يقوم إلى العمل بهذه النية والمنازع ما هو هناك فالمخلص أثبت العدم وجودا وجهل الأمر على ما هو في نفسه فمن حكم عليه ما ذكرناه ورأى نواصي كل دابة بيد الله ورأى ربه على صراط مستقيم ومن أخذ بناصيتك لم يعدل بك عن طريقه الذي هو عليه فاذن لم يكن الإخلاص إلا عبارة عن رؤيته في مشهد ما معين لا في كل مظهر وهو في كل مظهر ولا يقدر صاحب هذه الحال أن يرى حجابا بينه وبين مشهوده فلا يتمكن له أن يميز شيئا من شي‏ء فإن العين واحدة وهي على صراط مستقيم‏\n\n",
    "en": "## Chapter 135: Concerning the Knowledge of Abandoning Sincerity and its Secrets\n\nWhoever attributes sincerity to himself in religion has committed association [with God] (أشركا)\nAnd has constrained the Absolute (المطلق) in His description.\n\nWhoever is ignorant of the [true] matter (الأمر) is the one\nWho perceives the essence of musk through its fragrance.\n\n### [Seeing sincerity in the action as coming from you is pure Zoroastrianism (مجوسية محضة)]\n\nA man said to Junayd, who was one of the people of spiritual states (أهل الأحوال), \"And who is the knower (العالم) that he should be mentioned alongside Allah?\" And Allah the Exalted said: <<أَ إِلهٌ مَعَ الله>> (Is there a god alongside Allah?). And some of them said: \"Seeing sincerity (الإخلاص) in the action as coming from you is pure Zoroastrianism (مجوسية محضة),\" meaning association [with God] (الشرك).\n\nRather, the obligated servant (المكلف) should witness the flow of the action (مجرى العمل) and its origin (منشئه). Abu Madyan used to command his companions to display acts of obedience (إظهار الطاعات), for in his view, there was no agent (فاعل) except Allah.\n\nThe act of making sincere (التخليص) implies a claimant (المنازع), and the claimant must necessarily demand that the obligated servant be a slave to him [the claimant]. The action (العمل) is among the totality of Allah’s Acts (أفعال الله), of which the obligated servant is merely the locus of manifestation (مظهرها). The most ignorant of people is he who places the Originator of the Act (موجد الفعل) under the obedience of the one for whom the act is performed, and that [claimant] is either Iblis or hypocrisy (الرياء).\n\n### [The Eye (العين) is One, and He is upon a Straight Path (صراط مستقيم)]\n\nIf the obligated servant undertakes the action with this intention [of sincerity], and the claimant (المنازع) is not present there, then the one who seeks sincerity (المخلص) has affirmed non-existence (العدم) as existence (وجودا) and has been ignorant of the matter as it is in itself.\n\nThus, whoever judges according to what we have mentioned, and sees the forelocks (نواصي) of every creature in the Hand of Allah, sees his Lord upon a Straight Path (صراط مستقيم). And whoever takes hold of your forelock will not deviate you from the path upon which He [Allah] is.\n\nTherefore, sincerity (الإخلاص) is nothing but an expression of witnessing Him (رؤيته) in a specific locus of witnessing (مشهد ما معين), not in every manifestation (مظهر), even though He is in every manifestation. The possessor of this spiritual state (الحال) is unable to see a veil (حجابا) between himself and what he witnesses (مشهوده). Thus, it is impossible for him to distinguish one thing from another, for the Eye (العين) is One, and it is upon a Straight Path (صراط مستقيم).",
    "ur": "## (باب ایک سو پینتیس: اخلاص کو ترک کرنے اور اس کے اسرار کی معرفت میں)\n\nجس نے دین میں اخلاص برتا، اس نے شرک کیا،\nاور اس نے مطلق (الوجود) کو اس کی صفت سے مقید کر دیا۔\n\nجو شخص اس امر سے ناواقف ہے، وہی ہے جو\nکستوری کی ذات کو اس کی خوشبو سے پہچانتا ہے۔\n\n### [عمل میں آپ کی طرف سے اخلاص کا دیکھنا خالص مجوسیت ہے]\n\nایک شخص نے جنید (رحمۃ اللہ علیہ) سے کہا: \"کون ہے وہ عالم جو اللہ کے ساتھ ذکر کیا جائے؟\" (وہ شخص اہل احوال میں سے تھا)۔ اور اللہ تعالیٰ نے فرمایا: أَ إِلهٌ مَعَ الله (کیا اللہ کے ساتھ کوئی اور معبود ہے؟) [النمل: 60]۔ اور بعض نے کہا: \"عمل میں آپ کی طرف سے اخلاص (الإخلاص) کا دیکھنا خالص مجوسیت ہے،\" یعنی شرک۔\n\nاور درحقیقت مکلف (بندے) کو چاہیے کہ وہ عمل کے بہاؤ اور اس کے منبع کا مشاہدہ کرے۔ اور ابو مدین (رحمۃ اللہ علیہ) اپنے ساتھیوں کو طاعات کے اظہار کا حکم دیتے تھے، کیونکہ ان کے نزدیک اللہ کے سوا کوئی فاعل (فاعل) نہیں تھا۔\n\nاور اخلاص (تخلیص) ایک منازع (حریف) کی خبر دیتا ہے، اور منازع کے لیے ضروری ہے کہ وہ مکلف سے مطالبہ کرے کہ وہ اس کا بندہ بن جائے۔ اور عمل اللہ کے افعال میں سے ہے جس کا مکلف صرف مظہر ہے۔ پس سب سے زیادہ جاہل وہ شخص ہے جو فعل کے موجد (پیدا کرنے والے) کو اس کی اطاعت میں لے آئے جس کے لیے وہ فعل کیا جا رہا ہے، اور وہ (منازع) یا تو ابلیس ہے یا ریا (دکھاوا)۔\n\n### [عین (حقیقت) ایک ہے اور وہ صراط مستقیم پر ہے]\n\nجب مکلف اس نیت سے عمل کے لیے کھڑا ہوتا ہے اور منازع وہاں موجود نہیں ہوتا، تو مخلص نے عدم (غیر ہستی) کو وجود (ہستی) ثابت کیا اور امر (حقیقت) کو جیسا کہ وہ فی نفسہ ہے، اس سے ناواقف رہا۔\n\nپس جس پر ہم نے جو کچھ ذکر کیا ہے، اس کا حکم لاگو ہوتا ہے، اور جس نے ہر جاندار کی پیشانی کو اللہ کے ہاتھ میں دیکھا، اور اپنے رب کو صراط مستقیم پر دیکھا۔ اور جس نے تمہاری پیشانی پکڑی، وہ تمہیں اس راستے سے نہیں ہٹائے گا جس پر وہ خود ہے۔\n\nلہٰذا، اخلاص (الإخلاص) صرف ایک مخصوص مشہد (جلوہ گاہ) میں اس (الحق) کے مشاہدے کا اظہار ہے، نہ کہ ہر مظہر میں، حالانکہ وہ (الحق) ہر مظہر میں ہے۔ اور اس حال کا حامل اپنے اور اپنے مشہود (جس کا مشاہدہ کیا جا رہا ہے) کے درمیان کوئی حجاب (پردہ) نہیں دیکھ سکتا، لہٰذا اس کے لیے ممکن نہیں کہ وہ کسی چیز کو کسی دوسری چیز سے ممتاز کر سکے، کیونکہ عین (حقیقت) ایک ہے اور وہ صراط مستقیم پر ہے۔",
    "fa": "باب صد و سی و پنجم در معرفت ترک اخلاص و اسرار آن\n\nآنکه دین را خالص گرداند، شرک ورزیده است *** و مطلق را از وصفش مقید ساخته است\n\nآنکه امر را نادان است، او کسی است *** که ذات مشک را از بوی آن درمی‌یابد\n\n[دیدن اخلاص از جانب تو در عمل، مجوسیت محض است]\n\nمردی به جنید گفت: «و عالم کیست که همراه با خدا ذکر شود؟» و او از اهل احوال (أهل الأحوال) بود. و خداوند متعال می‌فرماید: «آیا معبودی با الله است؟» (أَ إِلهٌ مَعَ الله). و برخی گفته‌اند: «دیدن اخلاص (الإخلاص) از جانب تو در عمل، مجوسیت محض است»، یعنی شرک. و شایسته است که مکلف، جریان عمل و منشأ آن را مشاهده کند. و ابومدین یاران خود را به آشکار کردن طاعات امر می‌کرد، زیرا نزد او فاعلی جز الله (الحق) نبود. و خالص‌سازی (التخليص) به وجود منازع (المنازع) (رقیب) اشاره دارد. و منازع ناگزیر است که از مکلف بخواهد بنده او باشد. و عمل از جمله افعال الله است که مکلف مظهر آن است. پس نادان‌ترین مردم کسی است که موجد فعل را تحت اطاعت کسی قرار دهد که عمل به خاطر او انجام می‌شود، و آن یا ابلیس است یا ریا (الرياء).\n\n[چشم یکی است و او بر صراط مستقیم است]\n\nاگر مکلف با این نیت به عمل برخیزد و منازع در آنجا نباشد، پس مخلص (المخلص) عدم را وجود اثبات کرده و امر را آن‌گونه که در نفس خود هست، نادانسته است. پس کسی که بر او حکم کند آنچه را ذکر کردیم و ببیند که ناصیه (پیشانی) هر جنبنده‌ای در دست الله است، و پروردگارش را بر صراط مستقیم (صراط مستقيم) ببیند، و کسی که ناصیه تو را بگیرد، تو را از راهی که او بر آن است منحرف نمی‌سازد. بنابراین، اخلاص (الإخلاص) چیزی نیست جز عبارتی از دیدن او در مشهدی (مشهد) معین، نه در هر مظهر، در حالی که او در هر مظهر است. و صاحب این حال نمی‌تواند حجابی میان خود و مشهودش ببیند. پس برای او ممکن نیست که چیزی را از چیز دیگر تمییز دهد. زیرا چشم (العين) یکی است و آن بر صراط مستقیم (صراط مستقيم) است."
  },
  "page_count": 1
}