{
  "id": 497,
  "title": {
    "ar": "الباب السابع والتسعون وأربعمائة في معرفة حال قطب كان منزله وما يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وهُمْ مُشْرِكُونَ",
    "en": "Chapter Four Hundred and Ninety-Seven: Concerning the Knowledge of the State (حال) of a Pole (قطب) Whose Station (منزل) Was: <<And most of them do not believe in Allah except while they associate partners (with Him)>>.",
    "ur": "باب چار سو ستانوے: ایک قطب (Qutb) کے حال کی معرفت (Ma'rifah) کے بیان میں جس کا منزل (Manzil) یہ تھا: \"اور ان میں سے اکثر لوگ اللہ پر ایمان نہیں لاتے مگر اس حال میں کہ وہ شرک کرنے والے ہوتے ہیں\" (وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وَهُمْ مُشْرِكُونَ)",
    "fa": "باب چهارصد و نود و هفتم در معرفت حال قطبی که منزل او «وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وَهُمْ مُشْرِكُونَ» (و بیشترشان به خدا ایمان نمی‌آورند مگر در حالی که مشرک هستند) است."
  },
  "content": {
    "ar": "## «الباب السابع والتسعون وأربعمائة في معرفة حال قطب كان منزله وما يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وهُمْ مُشْرِكُونَ»\n\n\n> الشرع يقبله عقل وإيمان *** وللعقول موازين وأوزان‏\n\n\n> عند الإله علوم ليس يعرفها *** إلا لبيب له في الوزن رجحان‏\n\n\n> فالأمر عقل وإيمان إذ اشتركا *** في حكم تنزيهه ما فيه خسران‏\n\n\n> وثم ينفرد الايمان في طبق *** بما تماثله بالشرع أكوان‏\n\n\n> شو العقل من حيث حكم الفكر يدفعه *** بما يؤيده في ذاك برهان‏\n\n\n> لو أن غير رسول الله جاء به *** في الحين كفره زور وبهتان‏\n\n\n> إذا تأوله من غير وجهته *** وقال ما لي على ما قال سلطان‏\n\n\n> لله في ذاك سر ليس يعلمه *** إلا فريد وذاك الفرد إنسان‏\n\n\n> قد كمل الله في الإنشاء صورته *** بصورة الحق فالقرآن فرقان‏\n\n\n> العين واحدة والحكم مختلف *** للجانبين فما في النش‏ء نقصان‏\n\n\n### [ما المراد بالموحدين‏]\n\n\nقال الله تعالى إِلَّا الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ وقَلِيلٌ ما هُمْ على أن تكون ما زائدة وليس القليل إلا من آمن بالله فإن الموحدين بالله هم الذين وحدوا الله بالله وأما الموحدون الذين وحدوا الله لا بالله بل بأنفسهم فهم الذين أشركوا في توحيده غير إن هذا الهجير لا يعطي الايمان بتوحيد الله وإنما يعطي مشاهدة ميثاق الذرية إذ أخذ الله من بَنِي آدَمَ من ظُهُورِهِمْ ذُرِّيَّتَهُمْ وأَشْهَدَهُمْ عَلى‏ أَنْفُسِهِمْ أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى‏ وما كان إلا التصديق بالوجود والملك لا بالتوحيد وإن كان فيه توحيد فغايته توحيد الملك فجاء قوله تعالى وما يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وهُمْ مُشْرِكُونَ لما خرجوا إلى الدنيا لأن الفطرة إنما كانت إيمانهم بوجود الحق والملك لا بالتوحيد فلما عدم التوحيد من الفطرة ظهر الشرك في الأكثر ممن يزعم أنه موحد وما أدى من أداه إلى ذلك إلا التكليف فإنه لما كلفهم تحقق أكثرهم إن الله ما كلفهم إلا وقد علم إن لهم اقتدارا نفسيا على إيجاد ما كلفهم به من الأفعال فلم يخلص لهم توحيد فلو علموا من ذلك أن الله ما كلفهم إلا لما فيهم من الدعوى في نسبة الأفعال إليهم التي نسبوها إلى أنفسهم ليتجردوا عنها بالله لا بنفوسهم كما فعل أهل الشهود فإذا ألزم الذاكر نفسه هذا الذكر نتج له إقامة العذر عند الله لعباد الله فيما أشركوا فيه عند إيمانهم فإن الله أثبت لهم الايمان بالله وهو خير كثير وعناية عظيمة إذا نظروا إلى من قال فيهم تبارك وتعالى والَّذِينَ آمَنُوا بِالْباطِلِ وكَفَرُوا بِاللَّهِ فأظهروا ما ليس بوجود وجودا وأزالوا في عقدهم وجود ما هو وجود وهو الله فسماه الله سترا فكان مستورا عنهم وجود الحق بما ستروه إذ لم يستروه حتى تصوروه وبعد التصور ستروه فكانوا كافرين ومن شأن الحق أنه حيث ما تصور كان له وجود في ذلك التصور ولا يزول برجوع ذلك المتصور عما تصور بخلاف المخلوق فإن المخلوق إذا تصورته كان له وجود في تصورك فإذا تبين لك أنه ليس كذلك زال من الوجود بزوال تصورك ما تصورته فهذا فرقان بين الله وبين المخلوق وهو علم دقيق لا يعلمه كثير من الناس فلهذا ثبت الشرك في العالم لأنه قابل صورة كل معتقد ولو لم يكن كذلك ما كان إلها فإذا سمع السامع الخبر النبوي بوجود الله آمن به على ما يتصوره فما آمن إلا بما تصوره والله موجود عند كل تصور كما هو موجود في خلاف ذلك التصور بعينه فما آمن أَكْثَرُهُمْ بِاللَّهِ إِلَّا وهُمْ مُشْرِكُونَ لما يطرأ عليهم في نفوسهم من مزيد العلم بالله ولو في كل مزيد تصور فيه ليس عين الأول وليس إلا الله في ذلك كله فما جاء الله بهذه الآية إلا لإقامة عذرهم ولم يتعرض سبحانه للتوحيد ولو تعرض للتوحيد لم يصح قوله إِلَّا وهُمْ مُشْرِكُونَ‏\nمع ثبوت الايمان فدل أنه ما أراد الايمان بالتوحيد وإنما أراد الايمان بالوجود ثم ظهر التوحيد لمن ظهر في ثاني حال فمن ادعى هذا الذكر هجيرا ولم يحصل عنده عذر العالم فيما أشركوا فيه فما هو من أهل هذا الذكر فإنه ما له ذوق إلا هذا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Ninety-Seven: Concerning the Knowledge of the State of a Pole (قطب) whose Station was <<And most of them do not believe in Allah except while they associate others with Him>> (Q 12:106).\n\nThe Divine Law (الشرع) is accepted by intellect and faith,\nAnd intellects possess scales and weights.\n\nWith the Divine are sciences known only\nTo the discerning one who has preponderance in the weighing.\n\nThe matter, therefore, is intellect and faith when they share\nIn the ruling of His transcendence (تنزيهه), wherein there is no loss.\n\nAnd then faith is singled out in a degree\nBy that which the universes (أكوان) resemble through the Divine Law.\n\nThe intellect, from the perspective of the ruling of thought, repels it,\nBy that which a proof supports it in that.\n\nIf anyone other than the Messenger of Allah had brought it,\nImmediately, his disbelief would be falsehood and calumny.\n\nIf he interprets it from other than its proper direction,\nAnd says, \"I have no authority over what he said.\"\n\nFor Allah in that is a secret none knows\nExcept a unique one (فريد), and that unique one is a human.\n\nAllah has perfected his form in creation\nWith the form of The Real (صورة الحق), so the Quran is a Criterion (فرقان).\n\nThe Essence (العين) is one, but the ruling is different\nFor the two sides, so there is no deficiency in the origination.\n\n### [What is Meant by the Monotheists]\n\nAllah the Exalted said: <<Except those who believe and do righteous deeds, and few are they>> (Q 38:24), assuming that *mā* is augmentative. The few are only those who believe in Allah. For the monotheists (الموحدين) *by* Allah are those who affirmed the Unity (وحدوا) of Allah *by* Allah. As for the monotheists who affirmed the Unity of Allah not by Allah but by their own selves, they are the ones who associated partners (أشركوا) in His affirmation of Unity (توحيده).\n\nHowever, this affirmation does not grant faith in the Unity of Allah; rather, it grants the witnessing (مشاهدة) of the Covenant of the Offspring (ميثاق الذرية), when Allah took from the Children of Adam, from their loins, their descendants, and made them testify concerning themselves, <<Am I not your Lord?>> They said, <<Yes, indeed>> (Q 7:172). This was nothing but the affirmation of Being (الوجود) and Sovereignty (الملك), not of Unity. Even if there was unity in it, its utmost extent was the unity of Sovereignty.\n\nThus came His saying, the Exalted: <<And most of them do not believe in Allah except while they associate others with Him>> (Q 12:106), when they came out into the world. This is because the primordial nature (الفطرة) was merely their belief in the Being of The Real (وجود الحق) and Sovereignty, not in Unity. When Unity was absent from the primordial nature, polytheism (الشرك) appeared in the majority of those who claim to be monotheists.\n\nAnd nothing led those whom it led to this except the Divine Command (التكليف). For when He commanded them, most of them realized that Allah only commanded them because He knew they possessed a psychic capacity (اقتدارا نفسيا) to bring into existence the acts (الأفعال) with which He charged them. Thus, their affirmation of Unity was not pure. If they had known that Allah only commanded them because of the claim they held regarding the attribution of acts to themselves—the acts they attributed to their own selves—so that they might divest themselves of them *by* Allah, not by their own selves, as the People of Witnessing (أهل الشهود) did.\n\nWhen the one who remembers (الذاكر) obligates himself to this remembrance (الذكر), the result for him is the establishment of an excuse before Allah for the servants of Allah regarding the polytheism they committed alongside their faith. For Allah affirmed their faith in Allah, and that is a great good and tremendous providence, especially when they look at those concerning whom the Blessed and Exalted said: <<And those who believe in falsehood and disbelieve in Allah>> (Q 29:52). They manifested as existence that which is not existence, and they removed in their belief the existence of that which *is* existence, namely Allah. Allah called this a veiling (ستراً). Thus, the Being of The Real (وجود الحق) was veiled from them by what they veiled, for they did not veil it until they had conceived of it (تصوروه), and after the conception, they veiled it. Thus, they were disbelievers.\n\nIt is characteristic of The Real that wherever He is conceived, He has existence in that conception, and He does not vanish when the conceiver retracts that conception. This is contrary to the created being (المخلوق). If you conceive of a created being, it has existence in your conception, but if it becomes clear to you that it is not as you conceived, it vanishes from existence with the disappearance of your conception of it. This is a criterion (فرقان) between Allah and the created being, and it is a subtle knowledge (علم دقيق) that many people do not know.\n\nFor this reason, polytheism is established in the world, because He accepts the form of every belief; were it not so, He would not be God. Thus, when the listener hears the prophetic report of Allah’s Being, he believes in Him according to what he conceives. He only believes in what he has conceived. And Allah is existent in every conception, just as He is existent in the opposite of that conception itself.\n\nThus, <<most of them do not believe in Allah except while they associate others with Him>> because of the increase in knowledge of Allah that occurs to them in their souls, even if in every increase there is a conception that is not the same as the first, and yet there is nothing but Allah in all of that. Allah only brought this verse to establish an excuse for them, and the Exalted did not address the issue of Unity. If He had addressed Unity, His saying <<except while they associate others with Him>> would not be sound alongside the establishment of faith. This indicates that He did not intend faith in Unity, but rather faith in Being. Then Unity appeared to those to whom it appeared in a second state.\n\nTherefore, whoever claims this remembrance as an affirmation but does not achieve the excuse for the world regarding the polytheism they committed, he is not one of the People of this Remembrance, for he has no spiritual taste (ذوق) except this. And Allah <<says the Truth, and He guides to the way>> (Q 33:4).",
    "ur": "باب نمبر چار سو ستانوے، اس قطب کے حال کی معرفت میں جس کی منزل یہ تھی: \"اور ان میں سے اکثر اللہ پر ایمان نہیں لاتے مگر اس حال میں کہ وہ شرک کرنے والے ہوتے ہیں\" (وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وَهُمْ مُشْرِكُونَ)۔\n\nشریعت کو عقل اور ایمان قبول کرتے ہیں، اور عقلوں کے لیے میزانیں اور اوزان ہیں۔\n\nاللہ کے پاس ایسے علوم ہیں جنہیں کوئی نہیں جانتا، سوائے اس دانا کے جس کا وزن میں پلڑا بھاری ہو۔\n\nپس معاملہ عقل اور ایمان کا ہے، جب وہ تنزیہہ (اللہ کو نقائص سے پاک قرار دینے) کے حکم میں شریک ہوتے ہیں، تو اس میں کوئی نقصان نہیں۔\n\nاور پھر ایمان ایک ایسے طبقے میں منفرد ہو جاتا ہے، جس کی مماثلت شریعت کے ذریعے کائناتوں میں ہوتی ہے۔\n\nعقل کو فکر کے حکم کے لحاظ سے دیکھو، جو اسے اس چیز سے دھکیلتا ہے جس کی تائید اس میں برہان (دلیل) کرتی ہے۔\n\nاگر رسول اللہ (صلی اللہ علیہ وسلم) کے علاوہ کوئی اور اسے لاتا، تو فوراً اس کا کفر، جھوٹ اور بہتان قرار دیا جاتا۔\n\nجب وہ اس کی تاویل اس کے صحیح رخ کے بغیر کرتا، اور کہتا کہ جو کچھ اس نے کہا اس پر میرا کوئی اختیار نہیں۔\n\nاللہ کے لیے اس میں ایک راز ہے جسے کوئی نہیں جانتا، سوائے ایک فردِ واحد کے، اور وہ فرد انسان ہے۔\n\nاللہ نے تخلیق میں اس کی صورت کو ذات حق (الحق) کی صورت سے کامل کیا، پس قرآن فرقان (حق و باطل میں فرق کرنے والا) ہے۔\n\nحقیقت (العین) ایک ہے، لیکن دونوں جانبوں کے لیے حکم مختلف ہے، پس تخلیق (النشء) میں کوئی کمی نہیں۔\n\n### [موحدین سے کیا مراد ہے؟]\n\nاللہ تعالیٰ نے فرمایا: \"سوائے ان لوگوں کے جو ایمان لائے اور نیک عمل کیے، اور وہ بہت کم ہیں\" (إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَا هُمْ)۔ اس صورت میں کہ \"ما\" زائدہ ہو، اور یہ قلیل صرف وہی ہیں جو اللہ پر ایمان لائے۔ کیونکہ اللہ کے ذریعے توحید کرنے والے (الموحدون باللہ) وہ ہیں جنہوں نے اللہ کی توحید اللہ کے ذریعے کی، اور وہ موحدین جنہوں نے اللہ کی توحید اللہ کے ذریعے نہیں بلکہ اپنی ذاتوں کے ذریعے کی، وہ ہیں جنہوں نے اس کی توحید میں شرک کیا۔ تاہم، یہ ذکر (الہجیر) توحیدِ الٰہی پر ایمان نہیں دیتا، بلکہ یہ صرف میثاقِ ذریت (ذرّوں کے عہد) کا مشاہدہ کراتا ہے، جب اللہ نے بنی آدم کی پشتوں سے ان کی ذریت کو نکالا اور انہیں ان کی جانوں پر گواہ بنایا: \"کیا میں تمہارا رب نہیں ہوں؟\" (أَلَسْتُ بِرَبِّكُمْ)۔ انہوں نے کہا: \"کیوں نہیں!\" (قَالُوا بَلَى)۔ اور یہ صرف ہستی (الوجود) اور ملکیت کی تصدیق تھی، نہ کہ توحید کی، اگرچہ اس میں توحید تھی بھی تو اس کی انتہا توحیدِ ملکیت تھی۔\n\nپس اللہ تعالیٰ کا یہ فرمان آیا: \"اور ان میں سے اکثر اللہ پر ایمان نہیں لاتے مگر اس حال میں کہ وہ شرک کرنے والے ہوتے ہیں\" (وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وَهُمْ مُشْرِكُونَ)، جب وہ دنیا میں آئے، کیونکہ فطرت صرف ذات حق (الحق) کی ہستی (الوجود) اور ملکیت پر ایمان تھی، نہ کہ توحید پر۔ جب فطرت سے توحید مفقود ہوئی تو اکثر ان لوگوں میں شرک ظاہر ہوا جو خود کو موحد سمجھتے ہیں۔ اور انہیں اس طرف لے جانے والی چیز صرف تکلیف (شرعی ذمہ داری) تھی۔ کیونکہ جب اللہ نے انہیں مکلف بنایا تو ان میں سے اکثر نے یہ سمجھا کہ اللہ نے انہیں مکلف نہیں بنایا مگر اس لیے کہ وہ جانتا تھا کہ ان کے پاس ان افعال کو وجود میں لانے کی نفسیاتی قدرت ہے جن کا انہیں مکلف بنایا گیا ہے۔ چنانچہ ان کی توحید خالص نہ ہو سکی۔\n\nاگر وہ یہ جان لیتے کہ اللہ نے انہیں مکلف صرف اس لیے بنایا ہے کہ ان میں افعال کو اپنی طرف منسوب کرنے کا دعویٰ موجود ہے، تاکہ وہ اللہ کے ذریعے ان سے پاک ہو جائیں نہ کہ اپنی ذاتوں کے ذریعے، جیسا کہ اہل شہود (الشہود) نے کیا۔ پس جب ذاکر اپنی ذات پر یہ ذکر لازم کرتا ہے، تو اس کا نتیجہ یہ نکلتا ہے کہ وہ اللہ کے بندوں کے لیے ان کے شرک میں ان کا عذر قائم کرتا ہے جو انہوں نے اپنے ایمان کے ساتھ کیا۔ کیونکہ اللہ نے ان کے لیے اللہ پر ایمان ثابت کیا ہے، اور یہ بہت بڑی بھلائی اور عظیم عنایت ہے، جب وہ ان لوگوں کو دیکھتے ہیں جن کے بارے میں اللہ تبارک و تعالیٰ نے فرمایا: \"اور وہ لوگ جو باطل پر ایمان لائے اور اللہ کا کفر کیا\" (وَالَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ)۔\n\nپس انہوں نے اس چیز کو ہستی (الوجود) کے طور پر ظاہر کیا جو وجود نہیں تھی، اور اپنے عقیدے میں اس وجود کو زائل کر دیا جو حقیقت میں وجود ہے، یعنی اللہ۔ پس اللہ نے اسے پردہ (ستر) قرار دیا۔ چنانچہ ذات حق (الحق) کی ہستی (الوجود) ان سے پردہ پوش رہی اس چیز کے ذریعے جسے انہوں نے پردہ ڈالا، کیونکہ انہوں نے اسے پردہ نہیں ڈالا جب تک کہ اس کا تصور نہ کر لیا، اور تصور کے بعد اسے پردہ ڈالا، پس وہ کافر ہو گئے۔ اور ذات حق (الحق) کی شان یہ ہے کہ جہاں بھی اس کا تصور کیا جائے، اس تصور میں اس کی ہستی (الوجود) ہوتی ہے، اور وہ اس متصور کے اپنے تصور سے رجوع کرنے سے زائل نہیں ہوتی۔ برخلاف مخلوق کے، کہ جب تم اس کا تصور کرتے ہو تو تمہارے تصور میں اس کی ہستی ہوتی ہے، لیکن جب تمہیں یہ واضح ہو جاتا ہے کہ وہ ایسا نہیں ہے، تو تمہارے تصور کے زائل ہونے سے وہ وجود سے زائل ہو جاتی ہے۔ پس یہ اللہ اور مخلوق کے درمیان فرقان (فرق کرنے والی چیز) ہے، اور یہ ایک دقیق علم ہے جسے بہت سے لوگ نہیں جانتے۔\n\nاسی لیے دنیا میں شرک ثابت ہوا، کیونکہ وہ ہر معتقد کی صورت کو قبول کرنے والا ہے، اور اگر وہ ایسا نہ ہوتا تو وہ الٰہ نہ ہوتا۔ پس جب سننے والا اللہ کی ہستی (الوجود) کے بارے میں نبوی خبر سنتا ہے، تو وہ اس پر ایمان لاتا ہے جیسا کہ وہ اس کا تصور کرتا ہے۔ پس اس نے صرف اسی چیز پر ایمان لایا جس کا اس نے تصور کیا، اور اللہ ہر تصور کے پاس موجود ہے، جیسا کہ وہ بعینہٖ اس تصور کے خلاف میں بھی موجود ہے۔ پس ان میں سے اکثر اللہ پر ایمان نہیں لائے مگر اس حال میں کہ وہ شرک کرنے والے ہوتے ہیں (وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وَهُمْ مُشْرِكُونَ)، اس اضافی علم کی وجہ سے جو ان کے نفوس پر اللہ کے بارے میں طاری ہوتا ہے، اگرچہ ہر اضافی تصور میں وہ پہلے تصور کا عین نہیں ہوتا، اور ان سب میں اللہ کے سوا کچھ نہیں۔ پس اللہ یہ آیت صرف ان کا عذر قائم کرنے کے لیے لایا، اور اس نے توحید کا ذکر نہیں کیا۔ اگر وہ توحید کا ذکر کرتا تو ایمان کے ثابت ہونے کے باوجود اس کا یہ فرمان درست نہ ہوتا کہ \"مگر اس حال میں کہ وہ شرک کرنے والے ہوتے ہیں\" (إِلَّا وَهُمْ مُشْرِكُونَ)۔ پس اس سے یہ ثابت ہوا کہ اس نے توحید پر ایمان مراد نہیں لیا، بلکہ ہستی (الوجود) پر ایمان مراد لیا۔ پھر توحید اس شخص کے لیے دوسری حالت میں ظاہر ہوئی جس کے لیے وہ ظاہر ہوئی۔ پس جس نے اس ذکر کا دعویٰ کیا اور اس کے پاس دنیا والوں کے شرک میں ان کا عذر حاصل نہ ہوا، تو وہ اس ذکر کے اہل میں سے نہیں ہے، کیونکہ اس کا ذوق صرف یہی ہے۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و نود و هفتم در معرفت حال قطبی که منزل او [آیه] «وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وَهُمْ مُشْرِكُونَ» (و بیشترشان به خدا ایمان نمی‌آورند مگر در حالی که مشرک‌اند) بود.\n\nشریعت را عقل و ایمان می‌پذیرد *** و برای عقل‌ها ترازوها و وزن‌هایی است.\n\nنزد خداوند علومی است که نمی‌شناسد آنها را *** مگر خردمندی که در وزن [سنجش] برتری دارد.\n\nپس امر [دین] عقل و ایمان است، آنگاه که شریک شوند *** در حکم تنزیه (پاک دانستن خداوند)، در آن زیانی نیست.\n\nو سپس ایمان در مرتبه‌ای منفرد می‌شود *** به آنچه که عوالم (اکوان) با شریعت با آن همانندی می‌یابند.\n\nعقل را از آن جهت که حکم فکر آن را می‌راند، ببین *** به آنچه که برهان در آن تأییدش می‌کند.\n\nاگر غیر از رسول خدا آن را می‌آورد *** در آن لحظه کفر، دروغ و بهتان بود.\n\nاگر آن را از غیر جهت صحیحش تأویل کند *** و بگوید: «بر آنچه او گفت، من سلطه‌ای ندارم.»\n\nبرای خداوند در آن سری است که نمی‌داند آن را *** مگر فردی یگانه، و آن فرد، انسان است.\n\nخداوند صورت او را در آفرینش کامل ساخت *** به صورت الحق (حق)، پس قرآن فرقان (جداکننده حق از باطل) است.\n\nالعین (ذات) یکی است و حکم برای دو طرف متفاوت *** پس در آفرینش (نشأة) نقصی نیست.\n\n### [مراد از موحدین چیست؟]\n\nخداوند متعال فرمود: «إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَا هُمْ» (مگر کسانی که ایمان آوردند و کارهای شایسته انجام دادند، و آنان اندک‌اند). [این آیه] بر این اساس است که «ما» زائده باشد، و اندک نیست مگر کسی که به خدا ایمان آورده است. زیرا موحدین (یکتاپرستان) بالله (به واسطه خدا) کسانی هستند که خدا را به واسطه خدا توحید کردند. اما موحدینی که خدا را نه به واسطه خدا، بلکه به واسطه خودشان توحید کردند، آنان کسانی هستند که در توحید (یکتاپرستی) او شریک قائل شدند. با این حال، این ذکر (هجیر) ایمان به توحید (یکتاپرستی) خدا را نمی‌دهد، بلکه مشاهده میثاق ذریه را می‌دهد، آنگاه که خداوند از پشت‌های فرزندان آدم، ذریه (نسل) آنان را گرفت و آنان را بر خودشان گواه گرفت: «أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى» (آیا من پروردگار شما نیستم؟ گفتند: بله). و این [پاسخ] چیزی نبود جز تصدیق به الوجود (هستی) و مُلک (مالکیت)، نه به التوحید (یکتاپرستی). و اگرچه در آن توحیدی بود، نهایت آن توحید مُلک بود. پس قول خداوند متعال: «وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وَهُمْ مُشْرِكُونَ» (و بیشترشان به خدا ایمان نمی‌آورند مگر در حالی که مشرک‌اند) هنگامی آمد که به دنیا خارج شدند، زیرا فطرت (سرشت) تنها ایمانشان به وجود الحق (هستی حق) و مُلک بود، نه به التوحید.\n\nپس چون التوحید (یکتاپرستی) از فطرت (سرشت) غایب شد، شرک (دوگانه‌پرستی) در بیشتر کسانی که گمان می‌کنند موحدند، ظاهر گشت. و چیزی جز تکلیف (وظیفه شرعی) آنان را به این امر نکشاند. زیرا هنگامی که خداوند آنان را مکلف ساخت، بیشترشان یقین کردند که خداوند آنان را مکلف نساخته مگر آنکه می‌دانسته است که آنان اقتدار نفسی بر ایجاد افعالی که به آن مکلف شده‌اند، دارند. از این رو، توحید (یکتاپرستی) برایشان خالص نشد. اگر از این امر می‌دانستند که خداوند آنان را مکلف نساخته مگر به سبب ادعایی که در نسبت دادن افعال به خودشان دارند – افعالی که به خود نسبت دادند تا به واسطه خدا، نه به واسطه نفس‌هایشان، از آن ادعا مجرد شوند – همان‌گونه که اهل الشهود (اهل شهود/مشاهده) انجام دادند.\n\nپس اگر ذاکر (یادکننده) نفس خود را ملزم به این ذکر (یادآوری) کند، نتیجه آن برای او اقامه عذر نزد خداوند برای بندگان خداست در آنچه هنگام ایمانشان در آن شرک ورزیدند. زیرا خداوند ایمان به خدا را برای آنان ثابت کرده است، و این خیر کثیر و عنایت عظیمی است، اگر به کسانی بنگرند که خداوند تبارک و تعالی درباره‌شان فرمود: «وَالَّذِينَ آمَنُوا بِالْبَاطِلِ وَكَفَرُوا بِاللَّهِ» (و کسانی که به باطل ایمان آوردند و به خدا کفر ورزیدند). پس آنان آنچه را که وجود (هستی) نبود، وجودی آشکار ساختند و در اعتقاد خود وجود آنچه را که وجود است، یعنی خداوند، از بین بردند. پس خداوند آن را سِتر (پوشش) نامید. بنابراین، وجود الحق (هستی حق) از آنان پوشیده ماند به واسطه آنچه پوشاندند، زیرا آنان آن را نپوشاندند مگر پس از آنکه تصورش کردند، و پس از تصور آن را پوشاندند، پس کافر (پوشاننده) بودند.\n\nو از شأن الحق (حق) این است که هر جا تصور شود، در آن تصور وجودی دارد و با بازگشت آن متصور از آنچه تصور کرده است، زائل نمی‌شود. برخلاف مخلوق؛ زیرا مخلوق اگر آن را تصور کنی، در تصور تو وجودی دارد، اما اگر برایت آشکار شود که آن‌گونه نیست، با زوال تصور تو از آنچه تصور کرده‌ای، از الوجود (هستی) زائل می‌شود. پس این فرقان (جداکننده) میان خدا و مخلوق است، و این علمی دقیق است که بسیاری از مردم آن را نمی‌دانند.\n\nبه همین دلیل شرک (دوگانه‌پرستی) در عالم ثابت شد، زیرا [خداوند] صورت هر معتقدی را می‌پذیرد، و اگر چنین نبود، او إله (معبود) نمی‌بود. پس هنگامی که شنونده خبر نبوی را درباره وجود (هستی) خدا می‌شنود، بر اساس آنچه تصور می‌کند به آن ایمان می‌آورد. پس او ایمان نیاورده مگر به آنچه تصور کرده است. و خداوند نزد هر تصوری موجود است، همان‌گونه که در خلاف آن تصور نیز موجود است. پس «وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلَّا وَهُمْ مُشْرِكُونَ» (و بیشترشان به خدا ایمان نمی‌آورند مگر در حالی که مشرک‌اند) به سبب علم فزونی است که در نفوسشان درباره خدا عارض می‌شود، هرچند در هر فزونی، تصوری باشد که عین تصور اول نیست، و در تمام آن جز خدا نیست.\n\nپس خداوند این آیه را نیاورد مگر برای اقامه عذر آنان، و سبحانه (پاک و منزه) متعرض التوحید (یکتاپرستی) نشد. و اگر متعرض التوحید می‌شد، قول او «إِلَّا وَهُمْ مُشْرِكُونَ» (مگر در حالی که مشرک‌اند) با وجود ثبوت ایمان صحیح نبود. پس دلالت می‌کند که او ایمان به التوحید را اراده نکرده، بلکه ایمان به الوجود (هستی) را اراده کرده است. سپس التوحید برای کسی که در حال دوم برایش ظاهر شد، آشکار گشت. پس هر کس این ذکر (یادآوری) را ادعا کند و عذر عالم را در آنچه شرک ورزیده‌اند، نزد خود حاصل نکند، او از اهل این ذکر نیست، زیرا ذوق (تجربه عرفانی) او جز این نیست. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}