{
  "id": 201,
  "title": {
    "ar": "الباب الحادي ومائتان في حال الفصل",
    "en": "Chapter 201: Concerning the State of Separation (حال الفصل)",
    "ur": "دو سو گیارھواں باب، فصل (الوجود) کے حال کے بیان میں",
    "fa": "باب دویست و یازدهم در حال جدایی (فصل)"
  },
  "content": {
    "ar": "## «الباب الحادي ومائتان في حال الفصل»\n\n\n> الفصل فوت الرجاء إن كنت تعقله *** ودع يفوتك فالمرجو قد حصلا\n\n\n> من غير ما هو مرجو لطالبه *** وهو الدليل لعبد الله إذن كملا\n\n\n> لا بد منا ومنه والدليل لنا *** الفرق ما بين من يدري ومن جهلا\n\n\n### [أن الفصل فوت ما ترجوه من محبوبك‏]\n\n\nاعلم أن الفصل عند الطائفة فوت ما ترجوه من محبوبك وعندنا الفصل هو تمييزك عنه بعد كونه سمعك وبصرك فإن وقع لك التمييز قبل هذا فليس هو الفصل المذكور في هذا الباب فإن المراد به هنا الفصل الذي يكون عن الوصل وهذا هو الذوق وقبل الذوق قد يخطر للعبد من الرجاء أن يكون الحق فيتفق أن يطلع على إحالة هذه الكينونة فيكون أيضا هذا من الفصل المبوب عليه في هذا الباب وما ثم أعلى من هذا الرجاء ثم ينزل من هذا إلى ما يرجوه من التحقق بالأسماء والصفات والنعوت في الأكوان علوها وسفلها فكل ما فاتك من هذه الأمور فهو فصل أيضا من هذا الباب ولكن من شرط هذا الفصل والوصل أن يكون من مقام المحبة وإن كانت من طريق الإرادة فإن المحبة وإن كانت عين الإرادة فهي تعلق خاص كالشهوة لها تعلق خاص وهي إرادة وكذلك العزم حال خاص في الإرادة والهم والنية والقصد كل ذلك أحوال للإرادة\n\n\n### [أن الرجاء من صفات المؤمنين‏]\n\n\nواعلم أن الرجاء من صفات المؤمنين من حيث ما هو مؤمن والفعل تابع له فهو من أحوال المؤمنين ما هو من أحوال العارفين فإنهم على بصيرة من أمرهم فلا رجاء عندهم وهكذا نعت كل من هو من أمره على بصيرة كما قال لا يَمْلِكُونَ مَوْتاً ولا حَياةً ولا نُشُوراً وكَما يَئِسَ الْكُفَّارُ من أَصْحابِ الْقُبُورِ فالفصل الذي يكون للعارفين ما هو فوت ما يرجى وإنما هو تحقيق ما يقع به التمييز بين الحقائق ولا يكون ذلك إلا للعلماء بترتيب الحكمة في الأمور فيعطي كل ذي حق حقه كما فصل كل شي‏ء بما يتميز به عن أن يشترك مع غيره فأما في الأسماء الإلهية فبما تدل عليه من حيث ما هي عدد فلما قبلت الكثرة احتيج إلى الفصل إما في ذات المسمى من نسبة معانيها إليه وإما من حيث ما تظهر فيه آثارها فيحدث‏\nلها الكثرة من المؤثر فيه لا من اسم الفاعل الذي هو المؤثر فتكون الآثار تكثر النسب إلى العين الواحدة فذلك الفصل في الآثار لا في الأسماء ولا في المسمى ولا في المؤثر فيه فهذا تحقيق الفصل في المعرفة عند العارفين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n( «بسم الله الرحمن الرحيم»)\n\n",
    "en": "## Chapter Two Hundred and One Concerning the State of Separation\n\nSeparation (الفصل) is the loss of hope (الرجاء), if you understand it,\nSo let it pass you by, for the hoped-for has already been attained,\nFrom that which is not hoped for by its seeker,\nAnd this is the proof for the servant of God when he is perfected.\nThere is no escape from us and from Him, and the proof for us is\nThe distinction between the one who knows and the one who is ignorant.\n\n### That Separation (الفصل) is the loss of what you hope for from your Beloved\n\nKnow that Separation (الفصل), according to the [Sufi] group (الطائفة), is the loss of what you hope for from your Beloved. But according to us, Separation (الفصل) is your distinguishing Him [The Real] after He has become your hearing and your sight. If this distinction occurs for you before this [state], then it is not the Separation mentioned in this chapter. For what is intended here is the Separation that follows Union (الوصل). This is the Tasting (الذوق).\n\nBefore the Tasting, the servant may conceive the hope (الرجاء) that he might *be* The Real (الحق), and it may happen that he is informed of the impossibility (إحالة) of this mode of being (الكينونة). This, too, is part of the Separation categorized in this chapter. And there is nothing higher than this hope.\n\nThen he descends from this [high state] to what he hopes for: the realization (التحقق) of the Names (الأسماء), Attributes (الصفات), and Descriptions (النعوت) in the cosmos (الأكوان), both its heights and its depths. Thus, everything you miss of these matters is also a Separation (فصل) belonging to this chapter.\n\nHowever, a condition for this Separation and Union is that it must stem from the station of Love (المحبة), even if it is via the path of Will (الإرادة). For Love, although it is the very essence of Will, is a specific attachment (تعلق خاص), just as desire (الشهوة) has a specific attachment and is [a form of] Will. Likewise, determination (العزم) is a specific state within Will, and concern (الهم), intention (النية), and purpose (القصد)—all of these are states of the Will.\n\n### That Hope (الرجاء) is one of the Attributes of the Believers\n\nKnow that Hope (الرجاء) is one of the attributes of the believers (المؤمنين) insofar as one is a believer, and the action follows it. Thus, it belongs to the states of the believers, not the states of the Gnostics (العارفين). For they possess clear insight (بصيرة) regarding their affair, so they have no hope [in the conventional sense].\n\nAnd this is the description of everyone who possesses clear insight regarding his affair, as He said: <<لا يَمْلِكُونَ مَوْتاً ولا حَياةً ولا نُشُوراً>> (They possess no power over death, nor life, nor resurrection), and <<كَما يَئِسَ الْكُفَّارُ من أَصْحابِ الْقُبُورِ>> (Just as the disbelievers despair of the dwellers of the graves).\n\nTherefore, the Separation (الفصل) that occurs for the Gnostics is not the loss of what is hoped for; rather, it is the realization by which the distinction (التمييز) between the Realities (الحقائق) occurs. And this only occurs for those who possess Knowledge (العلماء) of the arrangement of Wisdom (الحكمة) in all matters. Thus, he gives every possessor of a right its due, just as He separated (فصل) everything by that which distinguishes it from sharing [a characteristic] with anything else.\n\nAs for the Divine Names (الأسماء الإلهية), [the distinction is] by what they signify insofar as they are number. Since they accepted Multiplicity (الكثرة), Separation became necessary. [This Separation is necessary] either in the Essence (الذات) of the Named One (المسمى) through the attribution of their meanings to Him, or insofar as their effects (آثارها) appear in Him, thereby generating Multiplicity from the recipient of the effect (المؤثر فيه), not from the active Name (اسم الفاعل) which is the effector. Thus, the effects multiply the relations (النسب) to the Single Entity (العين الواحدة). That Separation is in the effects, not in the Names, nor in the Named One, nor in the recipient of the effect.\n\nThis, then, is the realization of Separation in Gnosis (المعرفة) according to the Gnostics. And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\n(In the Name of Allah, the Most Compassionate, the Most Merciful)",
    "ur": "باب نمبر دو سو گیارہ: فصل (جدائی) کے حال میں\n\nفصل (جدائی) رجاء (امید) کا فوت ہونا ہے اگر تم اسے سمجھتے ہو\nاور اسے جانے دو، کیونکہ جس کی امید تھی وہ حاصل ہو چکا ہے۔\n\nاس کے علاوہ جو طالب کے لیے مرجو (امید کیا گیا) تھا\nاور یہ عبد اللہ (اللہ کے بندے) کے لیے دلیل ہے کہ وہ تب کامل ہو گیا۔\n\nہم سے اور اس (الحق) سے ہونا ضروری ہے، اور ہمارے لیے دلیل\nاس شخص کے درمیان فرق ہے جو جانتا ہے اور جو جاہل ہے۔\n\n### [کہ فصل (جدائی) تمہارے محبوب سے جس کی تم امید رکھتے ہو اس کا فوت ہونا ہے]\n\nجان لو کہ طائفہ کے نزدیک فصل (جدائی) تمہارے محبوب سے جس کی تم امید رکھتے ہو اس کا فوت ہونا ہے، اور ہمارے نزدیک فصل (جدائی) یہ ہے کہ اس کے تمہاری سماعت اور بصارت بن جانے کے بعد تم اس سے اپنا امتیاز (تمییز) قائم کرو۔ اگر یہ امتیاز تمہیں اس سے پہلے حاصل ہو جائے تو یہ وہ فصل نہیں ہے جس کا ذکر اس باب میں کیا گیا ہے۔ کیونکہ یہاں اس سے مراد وہ فصل ہے جو وصل (ملاپ) کے بعد ہوتا ہے، اور یہی ذوق (تجربہ) ہے۔ ذوق سے پہلے، بندے کے دل میں یہ رجاء (امید) پیدا ہو سکتی ہے کہ وہ الحق (ذات حق) ہو جائے، پھر اتفاق سے وہ اس کینونت (ہونے) کے محال ہونے پر مطلع ہو جاتا ہے، تو یہ بھی اس فصل میں شامل ہے جس پر یہ باب قائم کیا گیا ہے۔ اور اس رجاء (امید) سے بلند کوئی چیز نہیں ہے۔ پھر وہ اس سے نیچے اترتا ہے اس چیز کی طرف جس کی وہ اکوان (کائناتوں) کے علو اور سفل (بلندی اور پستی) میں اسماء و صفات اور نعوت (اوصاف) سے متحقق ہونے کی امید رکھتا ہے۔ پس ان امور میں سے جو بھی تم سے فوت ہو جائے، وہ بھی اس باب کا فصل (جدائی) ہے۔ لیکن اس فصل اور وصل کی شرط یہ ہے کہ یہ مقام المحبۃ (محبت) سے ہو، اگرچہ یہ طریق الإرادة (ارادہ) سے ہو۔ کیونکہ المحبۃ (محبت)، اگرچہ عین الإرادة (ارادہ) ہے، لیکن یہ ایک خاص تعلق ہے، جیسے شہوت کا ایک خاص تعلق ہے اور وہ بھی ارادہ ہے۔ اسی طرح عزم ارادہ میں ایک خاص حال ہے، اور ہم (فکر)، نیت اور قصد، یہ سب ارادہ کے احوال ہیں۔\n\n### [کہ رجاء (امید) مؤمنین کی صفات میں سے ہے]\n\nاور جان لو کہ رجاء (امید) مؤمنین کی صفات میں سے ہے اس حیثیت سے کہ وہ مؤمن ہے، اور فعل اس کے تابع ہے۔ پس یہ مؤمنین کے احوال میں سے ہے، نہ کہ عارفین کے احوال میں سے، کیونکہ وہ اپنے امر پر بصیرت رکھتے ہیں، لہٰذا ان کے ہاں کوئی رجاء (امید) نہیں ہوتی۔ اور یہی ہر اس شخص کی صفت ہے جو اپنے امر پر بصیرت رکھتا ہو، جیسا کہ (اللہ تعالیٰ نے) فرمایا: **لَا يَمْلِكُونَ مَوْتًا وَلَا حَيَاةً وَلَا نُشُورًا** (وہ نہ موت کے مالک ہیں اور نہ زندگی کے اور نہ دوبارہ اٹھائے جانے کے)۔ اور جیسا کہ فرمایا: **كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ** (جیسا کہ کفار قبر والوں سے مایوس ہو چکے ہیں)۔\n\nپس وہ فصل (جدائی) جو عارفین کے لیے ہوتا ہے، وہ اس چیز کا فوت ہونا نہیں ہے جس کی امید کی جاتی ہے، بلکہ وہ اس چیز کا تحقق (حقیقت بننا) ہے جس کے ذریعے حقائق (الحقائق) کے درمیان امتیاز (تمییز) واقع ہوتا ہے۔ اور یہ صرف ان علماء کو حاصل ہوتا ہے جو امور میں حکمت کی ترتیب کو جانتے ہیں، پس وہ ہر حقدار کو اس کا حق دیتے ہیں، جیسا کہ ہر چیز کو اس چیز کے ذریعے فصل (جدا) کیا گیا ہے جس سے وہ دوسروں کے ساتھ شریک ہونے سے ممتاز ہو جاتی ہے۔\n\nجہاں تک اسماء الٰہیہ (الأسماء الإلهية) کا تعلق ہے، تو (فصل) اس چیز کے ذریعے ہوتا ہے جس پر وہ دلالت کرتی ہیں اس حیثیت سے کہ وہ عدد ہیں۔ پس جب انہوں نے کثرت (Multiplicity) کو قبول کیا تو فصل (جدائی) کی ضرورت پیش آئی، یا تو مسمیٰ (جس کا نام لیا گیا) کی ذات میں ان کے معانی کی نسبت سے، یا اس حیثیت سے کہ ان کے آثار اس میں ظاہر ہوتے ہیں، تو اس کے لیے کثرت مؤثر فیہ (جس پر اثر کیا گیا) کی طرف سے پیدا ہوتی ہے، نہ کہ اسم فاعل (فاعل اسم) کی طرف سے جو کہ مؤثر ہے۔ پس آثار عین واحدہ (العين الواحدة) کی طرف نسبتوں کو بڑھا دیتے ہیں۔ تو یہ فصل (جدائی) آثار میں ہے، نہ کہ اسماء میں، نہ مسمیٰ میں اور نہ ہی مؤثر فیہ میں۔ پس عارفین کے نزدیک المعرفۃ (معرفت) میں فصل (جدائی) کا یہ تحقق ہے۔\n\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\n\n(بسم اللہ الرحمن الرحیم)",
    "fa": "«باب دویست و یکم در حال فصل (جدایی)»\n\nفصل (جدایی)، از دست دادن امید است اگر آن را دریابی *** و بگذار از دستت برود، زیرا مراد (مطلوب) حاصل شده است.\n\nنه از آن جهت که مطلوب طالبش باشد *** و این دلیل است بر اینکه بنده خدا (عبدالله) آنگاه کامل شده است.\n\nچاره‌ای نیست از ما و از او، و دلیل ما *** تفاوت میان کسی است که می‌داند و کسی که نادان است.\n\n### [اینکه فصل (جدایی)، از دست دادن چیزی است که از محبوبت امید داری]\n\nبدان که فصل (جدایی) نزد طایفه (صوفیه)، از دست دادن چیزی است که از محبوبت امید داری؛ و نزد ما، فصل (جدایی) عبارت است از تمییز (جداسازی) تو از او پس از آنکه او گوش و چشم تو شده باشد. اگر تمییز (جداسازی) پیش از این برای تو رخ دهد، آن فصل (جدایی) مذکور در این باب نیست؛ زیرا مراد از آن در اینجا فصلی است که پس از وصل (اتصال) رخ می‌دهد، و این همان ذوق (الذوق) است. پیش از ذوق (الذوق)، ممکن است این امید برای بنده خطور کند که حق (الحق) باشد، و سپس اتفاق می‌افتد که بر محال بودن این کینونت (هستی یافتن) آگاه شود؛ این نیز از فصلی است که این باب برای آن تدوین شده است. و هیچ چیز بالاتر از این رجاء (امید) نیست. سپس از این مقام، به آنچه امید دارد از تحقق یافتن به اسماء و صفات و نعوت (ویژگی‌ها) در عوالم (الأکوان)، اعم از علوی و سفلی، فرود می‌آید. پس هر آنچه از این امور از دست دهی، آن نیز فصلی (جدایی) از این باب است. اما شرط این فصل (جدایی) و وصل (اتصال) آن است که از مقام محبت باشد، هرچند از طریق اراده باشد؛ زیرا محبت (المحبة)، اگرچه عین اراده است، اما تعلقی خاص است، همانند شهوت که تعلقی خاص دارد و آن نیز اراده است. همچنین عزم، حالتی خاص در اراده است، و همّ و نیت و قصد، همه اینها احوال اراده هستند.\n\n### [اینکه رجاء (امید) از صفات مؤمنان است]\n\nو بدان که رجاء (امید) از صفات مؤمنان است از آن حیث که مؤمن هستند و فعل تابع آن است. پس رجاء از احوال مؤمنان است، نه از احوال عارفان (العارفين)؛ زیرا عارفان (العارفين) بر بصیرت (بینش) از امر خود هستند و نزد آنان رجاء (امید) وجود ندارد. و این چنین است وصف هر کس که بر امر خود بصیرت دارد، چنانکه [خداوند] فرمود: «لَا يَمْلِكُونَ مَوْتًا وَلَا حَيَاةً وَلَا نُشُورًا» (مالک مرگ و زندگی و برانگیختن نیستند) و «كَمَا يَئِسَ الْكُفَّارُ مِنْ أَصْحَابِ الْقُبُورِ» (همان‌گونه که کافران از [بازگشت] اهل قبور ناامید شدند). پس فصلی (جدایی) که برای عارفان (العارفين) رخ می‌دهد، از دست دادن چیزی نیست که امید می‌رود، بلکه تحقق (التحقق) چیزی است که به واسطه آن تمییز (جداسازی) میان حقایق (الحقائق) صورت می‌گیرد. و این امر جز برای عالمانی که به ترتیب حکمت در امور آگاهند، رخ نمی‌دهد؛ پس به هر صاحب حقی، حقش را می‌دهد، همان‌گونه که هر چیزی را به واسطه آنچه که آن را از اشتراک با غیر متمایز می‌سازد، فصل (جداسازی) کرده است. اما در مورد اسماء الهی، [فصل] به واسطه چیزی است که آن اسماء از حیث عدد بودن بر آن دلالت می‌کنند. پس چون کثرت را پذیرفتند، نیاز به فصل (جداسازی) پیدا شد؛ یا در ذات مسمّا از نسبت معانی آنها به او، و یا از حیث ظهور آثارشان در آن، که کثرت برای آنها از مؤثر فیه (آنچه اثر در آن واقع شده) پدید می‌آید، نه از اسم فاعل که مؤثر است. پس آثار، نسبت‌ها را به سوی عین (ذات) واحد زیاد می‌کنند. بنابراین، آن فصل (جدایی) در آثار است، نه در اسماء و نه در مسمّا و نه در مؤثر فیه. این است تحقیق فصل (جدایی) در معرفت (المعرفة) نزد عارفان (العارفين). و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند).\n\n(به نام خداوند بخشنده مهربان)"
  },
  "page_count": 2
}