{
  "id": 458,
  "title": {
    "ar": "الباب الثامن والخمسون وأربعمائة في معرفة منازلة إدراك السبحات الوجهية",
    "en": "Chapter Four Hundred and Fifty-Eight: Concerning the Gnosis of the Stations of the Perception of the Countenance Splendors.",
    "ur": "باب چار سو اٹھاون (۴۵۸) سبحاتِ وجہیہ (السبحات الوجهية) کے ادراک کی منازل کی معرفت کے بارے میں۔",
    "fa": "باب چهارصد و پنجاه و هشتم در معرفت منازل ادراک سبحات وجهی (السبحات الوجهية)"
  },
  "content": {
    "ar": "## «الباب الثامن والخمسون وأربعمائة في معرفة منازلة إدراك السبحات الوجهية»\n\n\n> سبحات الوجه تدركنا *** وهي بالإدراك تعد منا\n\n\n> غيرة منها عليه فهل *** أحد منكم يفهمنا\n\n\n> كيف كان الأمر فيه فلم *** تلق موجودا يعرفنا\n\n\n### [لو رفع الحجاب أحرقت سبحات الوجه‏]\n\n\nقال الله تعالى الله نُورُ السَّماواتِ والْأَرْضِ وقال صَلَّى اللهُ عَليهِ وسَلَّم في الحجب الإلهية المرسلة بينه وبين خلقه إنه تعالى لو رفعها لأحرقت سبحات الوجه ما أدركه بصره من خلقه‏\n\n\nوقيل له صَلَّى اللهُ عَليهِ وسَلَّم أ رأيت ربك فقال نوراني أراه‏\n\n\nفهذه الحجب إن كانت مخلوقة فكيف تبقي للسبحات فإنها غير محجوبة عنها لكن اعلم أنه سر أخفاه الله عن عباده سمي ذلك الإخفاء حجبا نورية وظلامية فالنور منها ما حجب به من المعارف الفكرية به والظلمة منها ما حجب به من الأمور الطبيعية المعتادة فلو رفع هذه الحجب عن بصائر عباده لأحرقت سبحات وجهه ما أدركه بصره من خلقه وهذا الإحراق إنما هو اندراج نور أدنى هم فيه بل هم هو في نور أعلى كاندراج أنوار الكواكب في نور الشمس كما يقال في الكوكب إذا كان تحت الشعاع مع وجود النور في ذات الكوكب أنه محترق فلا يراد به العدم بل تبدل الحال على العين الواجدة في نظر الناظر فانتقل الاسم عليه وعنه بانتقال الحكم كان الحطب حطبا فلما احترق سمي فحما والجوهر واحد ومعلوم أن الكواكب على ضوئها في نفسها ولكن لا نراها لضعف الإدراك فلو رفعها في حق العلماء لرأوا نفوسهم عينه وكان الأمر واحدا لكنه رفعها عنهم فرأوا ذواتهم ذاتا واحدة فقالوا ما حكي عنهم من أنا الله وسبحاني لكن العامة لم ترفع عنهم فلم يشهدوا الأمر على ما هو عليه فَتَنازَعُوا أَمْرَهُمْ بَيْنَهُمْ وأسر العارفون النجوى أدبا مع الله فإنهم الأدباء\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم لا تعطوا الحكمة غير أهلها فتظلموها ولا تمنعوها أهلها فتظلموهم‏\n\n\nفما قال الشارع للعارفين شيئا أشد تكليفا من هذا الحكم لأنه أمرهم بالمراقبة لكل شخص شخص فهم يراقبون العالم من أجل هذا الحديث لأنهم أهل حكمة فمن رأوا فيه الأهلية أعطوه لئلا يتصفوا بالظلم في حقه وإن لم يروا فيه أهلية لم يعطوه لئلا\nيتصفوا بالظلم في حقها فلا يزالون مراقبين للعالم دائما أبدا وهذا حظهم من قوله وكانَ الله عَلى‏ كُلِّ شَيْ‏ءٍ رَقِيباً فمن راقب بعين الله لم يشغله شأن عن شأن فهو يتصرف في كل شي‏ء بذاته لأنه إلهي المشهد والقبول من المتصرف فيه فالمتصرف مستريح من هذا الوجه ومن راقب بعين نفسه من خلف حجاب ذاته فهو في غاية من الجهد والتعب فلا يزال في نصب ما دامت هذه صفته‏\n\n\n> فبالنور تدرك أنواره *** وبالنور يدرك ما يدرك‏\n\n\n> فمن يكن بنعت حق له *** يملك بالذات ولا يملك‏\n\n\nوهذا القدر من الإشارة في هذه المنازلة كاف لمن عقل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 458: On the Knowledge of the Station of Perceiving the Glories of the Countenance\n\nThe Glories of the Countenance perceive us,\nAnd through this perception, they are counted as belonging to us.\n\nOut of protective zeal (غيرة) for Him,\nIs there anyone among you who can make us understand\n\nHow the matter stands therein?\nFor you will not find any existent being who truly knows us.\n\n### [If the Veil were lifted, the Glories of the Countenance would burn]\n\nAllah the Exalted said: <<الله نُورُ السَّماواتِ والْأَرْضِ>> (Allah is the Light of the heavens and the earth). And the Prophet, may Allah bless him and grant him peace, said concerning the Divine Veils (الحجب الإلهية) sent down between Him and His creation: \"If He were to lift them, the Glories of the Countenance (سبحات الوجه) would burn everything reached by His gaze of His creation.\"\n\nAnd when he, may Allah bless him and grant him peace, was asked, \"Did you see your Lord?\" he replied, \"A Light (نوراني); how could I see Him?\"\n\nIf these Veils are created, then how can they remain before the Glories (للسّبحات)? For the Glories are not veiled from them. But know that this is a secret which Allah has concealed from His servants. That concealment is named luminous (نورية) and dark (ظلامية) veils. The luminous veils are those by which He conceals the intellectual gnoses (المعارف الفكرية) through Him, and the dark veils are those by which He conceals the customary natural affairs (الأمور الطبيعية المعتادة).\n\nIf He were to lift these veils from the inner sight (بصائر) of His servants, the Glories of His Countenance (سبحات وجهه) would burn everything reached by His gaze of His creation. This burning is nothing but the absorption (اندراج) of a lower light—in which they exist, or rather, which they are—into a higher light. This is like the absorption of the lights of the stars into the light of the sun. Just as it is said of a star that is \"under the ray\" (تحت الشعاع)—even though light exists in the essence (ذات) of the star—that it is burned. This does not mean annihilation (العدم), but rather a change of state (تبدل الحال) for the perceiving eye (العين الواجدة) in the view of the observer. The name shifts upon it and away from it due to the shift in the ruling (الحكم). Wood (الحطب) was wood, but when it is burned, it is called charcoal (فحما), yet the substance (الجوهر) is one. It is known that the stars retain their own light in themselves, but we do not see them due to the weakness of perception (الإدراك).\n\nIf He were to lift them for the people of Knowledge (العلماء), they would see their own souls (نفوسهم) as His very Essence (عينه), and the matter would be one. But He lifted them from them, and they saw their essences (ذواتهم) as a single Essence (ذاتا واحدة), so they spoke what has been related from them, such as \"I am Allah\" and \"Glory be to me (سبحاني).\" However, the veils were not lifted from the common people (العامة), so they did not witness the matter as it truly is, <<فَتَنازَعُوا أَمْرَهُمْ بَيْنَهُمْ>> (so they disputed their affair among themselves). But the Gnostics (العارفون) kept the secret counsel (النجوى) out of proper conduct (أدبا) with Allah, for they are the people of proper conduct.\n\nThe Prophet, may Allah bless him and grant him peace, said: \"Do not give wisdom (الحكمة) to those who are not worthy of it, lest you wrong it; and do not withhold it from those who are worthy of it, lest you wrong them.\"\n\nThe Lawgiver (الشارع) did not impose any command upon the Gnostics (العارفون) more burdensome than this ruling (الحكم), because it commands them to observe (المراقبة) every single person. Thus, they observe the world (العالم) because of this hadith, for they are the people of wisdom. Whoever they see possessing the worthiness (الأهلية), they grant it to him, lest they be characterized by injustice (الظلم) toward him. And if they do not see worthiness in someone, they do not grant it, lest they be characterized by injustice toward the wisdom itself. They remain observers of the world perpetually and eternally. This is their portion of His saying: <<وكانَ الله عَلى‏ كُلِّ شَيْ‏ءٍ رَقِيباً>> (And Allah is ever an Observer over all things).\n\nWhoever observes with the Eye of Allah (بعين الله) is not distracted by one affair from another. He acts (يتصرف) in everything by his very essence (بذاته), because his witnessing (المشهد) is Divine, and acceptance comes from the one acted upon. Thus, the actor is at rest in this respect. But whoever observes with the eye of his own self (بعين نفسه) from behind the veil of his essence (حجاب ذاته) is in the utmost difficulty and fatigue, and he remains in hardship as long as this is his characteristic.\n\nBy the Light (النور) are His lights perceived,\nAnd by the Light is whatever is perceived, perceived.\n\nWhoever possesses a description belonging to the Real (الحق)\nPossesses by the Essence (بالذات) but is not possessed.\n\nThis much of an allusion concerning this station (المنازلة) is sufficient for one who understands. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو اٹھاون: سبحات الوجه (ذات حق کے چہرے کی تجلیات) کے ادراک کی منزل کی معرفت میں\n\nسبحات الوجه (ذات حق کے چہرے کی تجلیات) ہمارا ادراک کرتی ہیں،\nاور ادراک کے ذریعے وہ ہم میں شمار ہوتی ہیں۔\n\nیہ اس پر ان کی غیرت ہے، تو کیا تم میں سے کوئی ہمیں سمجھا سکتا ہے؟\nکہ اس میں معاملہ کیسا تھا؟ کیونکہ تم کسی ایسے موجود کو نہیں پاؤ گے جو ہمیں جانتا ہو۔\n\n[اگر حجاب اٹھا دیا جائے تو سبحات الوجه (ذات حق کے چہرے کی تجلیات) جلا ڈالیں گی]\n\nاللہ تعالیٰ نے فرمایا: \"اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ\" (اللہ آسمانوں اور زمین کا نور ہے)۔ اور نبی اکرم صلی اللہ علیہ وسلم نے اپنے اور اپنی مخلوق کے درمیان حائل الٰہی حجابات کے بارے میں فرمایا کہ اگر اللہ تعالیٰ انہیں اٹھا دے تو سبحات الوجه (ذات حق کے چہرے کی تجلیات) اس کی مخلوق میں سے ہر اس چیز کو جلا ڈالیں گی جسے اس کی نگاہ نے پایا۔\n\nاور آپ صلی اللہ علیہ وسلم سے پوچھا گیا: \"کیا آپ نے اپنے رب کو دیکھا؟\" تو آپ نے فرمایا: \"وہ نور ہے، میں اسے دیکھتا ہوں۔\"\n\nپس اگر یہ حجابات مخلوق ہیں تو سبحات (تجلیات) کے لیے کیسے باقی رہ سکتے ہیں، کیونکہ وہ ان سے محجوب نہیں ہیں۔ لیکن جان لو کہ یہ ایک راز ہے جسے اللہ نے اپنے بندوں سے چھپا رکھا ہے، اور اس اخفاء کو نوری اور ظلامی (تاریک) حجابات کا نام دیا گیا ہے۔ ان میں سے نوری حجاب وہ ہے جس کے ذریعے فکری معارف (المعارف الفكرية) سے پردہ ڈالا گیا ہے، اور ظلامی (تاریک) حجاب وہ ہے جس کے ذریعے طبعی امور (الأمور الطبيعية) سے پردہ ڈالا گیا ہے جو معمول میں ہیں۔ پس اگر وہ یہ حجابات اپنے بندوں کی بصیرتوں سے اٹھا دے تو سبحات وجهه (اس کے چہرے کی تجلیات) اس کی مخلوق میں سے ہر اس چیز کو جلا ڈالیں گی جسے اس کی نگاہ نے پایا۔\n\nاور یہ جلانا (الإحراق) درحقیقت ادنیٰ نور کا اعلیٰ نور میں مدغم ہو جانا ہے، بلکہ وہ (ادنیٰ نور) خود ہی اعلیٰ نور میں مدغم ہو جاتا ہے، جیسے سورج کے نور میں ستاروں کے انوار کا مدغم ہو جانا۔ جیسا کہ ستارے کے بارے میں کہا جاتا ہے کہ جب وہ شعاع کے نیچے ہو تو وہ جل گیا ہے، حالانکہ ستارے کی ذات میں نور موجود ہوتا ہے۔ اس سے مراد عدم (نیستی) نہیں ہے، بلکہ دیکھنے والے کی نظر میں موجود (الواجدة) آنکھ پر حال کا بدل جانا ہے۔ پس حکم کے بدلنے سے اس پر اور اس سے نام منتقل ہو جاتا ہے۔ جیسے لکڑی لکڑی تھی، جب وہ جل گئی تو کوئلہ کہلائی، حالانکہ جوہر (ذات) ایک ہی ہے۔\n\nاور یہ معلوم ہے کہ ستارے اپنی ذات میں روشن ہیں لیکن ہم انہیں ادراک (الإدراك) کی کمزوری کی وجہ سے نہیں دیکھ پاتے۔ پس اگر اللہ تعالیٰ ان (حجابات) کو علماء کے حق میں اٹھا دے تو وہ اپنی ذاتوں کو عین ذات حق دیکھیں گے اور معاملہ ایک ہو جائے گا۔ لیکن اس نے ان (عارفین) سے انہیں اٹھا دیا، تو انہوں نے اپنی ذاتوں کو ایک ہی ذات دیکھا، اور وہی کہا جو ان سے حکایت کیا گیا ہے، جیسے \"أنا الله\" (میں اللہ ہوں) اور \"سبحانی\" (میں پاک ہوں)۔ لیکن عوام سے یہ حجابات نہیں اٹھائے گئے، لہٰذا انہوں نے معاملے کا شہود (الشہود) ویسا نہیں کیا جیسا کہ وہ ہے، پس \"فَتَنَازَعُوا أَمْرَهُمْ بَيْنَهُمْ\" (تو انہوں نے آپس میں اپنے معاملے میں جھگڑا کیا)۔ اور عارفین (العارفون) نے اللہ کے ساتھ ادب کی وجہ سے سرگوشی کو راز رکھا، کیونکہ وہ ہی اہل ادب ہیں۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"حکمت (الحکمة) کو نااہل لوگوں کو نہ دو، ورنہ تم اس پر ظلم کرو گے، اور نہ ہی اسے اہل لوگوں سے روکو، ورنہ تم ان پر ظلم کرو گے۔\"\n\nشارع (نبی اکرم صلی اللہ علیہ وسلم) نے عارفین (العارفون) کو اس حکم سے زیادہ سخت کوئی ذمہ داری نہیں دی، کیونکہ اس نے انہیں ہر شخص کی انفرادی نگرانی (المراقبة) کا حکم دیا ہے۔ پس وہ اس حدیث کی وجہ سے دنیا کی نگرانی کرتے ہیں، کیونکہ وہ اہل حکمت ہیں۔ پس جس میں وہ اہلیت دیکھتے ہیں، اسے دے دیتے ہیں تاکہ اس کے حق میں ظلم کے وصف سے متصف نہ ہوں، اور اگر وہ اس میں اہلیت نہیں دیکھتے تو اسے نہیں دیتے تاکہ حکمت کے حق میں ظلم کے وصف سے متصف نہ ہوں۔ لہٰذا وہ ہمیشہ دنیا کی نگرانی کرتے رہتے ہیں۔ اور یہ ان کا حصہ ہے اللہ تعالیٰ کے اس فرمان سے: \"وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا\" (اور اللہ ہر چیز پر نگہبان ہے)۔\n\nپس جو شخص اللہ کی آنکھ سے نگرانی (المراقبة) کرتا ہے، اسے کوئی معاملہ دوسرے معاملے سے مشغول نہیں کرتا، لہٰذا وہ ہر چیز میں اپنی ذات کے ذریعے تصرف کرتا ہے، کیونکہ اس کا مشاہدہ الٰہی ہے اور قبولیت اس کی طرف سے ہے جس میں تصرف کیا جا رہا ہے۔ پس متصرف (تصرف کرنے والا) اس لحاظ سے راحت میں ہوتا ہے۔ اور جو شخص اپنی ذات کے حجاب کے پیچھے سے اپنی نفس کی آنکھ سے نگرانی کرتا ہے، وہ انتہائی مشقت اور تھکاوٹ میں ہوتا ہے، اور جب تک اس کی یہ صفت رہتی ہے، وہ ہمیشہ مشقت میں رہتا ہے۔\n\nپس نور کے ذریعے ہی اس کے انوار کا ادراک ہوتا ہے،\nاور نور کے ذریعے ہی اس کا ادراک ہوتا ہے جس کا ادراک کیا جاتا ہے۔\n\nپس جو شخص ذات حق (الحق) کی صفت کے ساتھ ہو،\nوہ بالذات مالک ہوتا ہے اور مالک نہیں بھی ہوتا۔\n\nاور اس منزل (المنازلة) میں اشارے کی یہ مقدار عقل رکھنے والے کے لیے کافی ہے۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب چهارصد و پنجاه و هشتم در معرفت منزلگاه ادراک سبحات وجهی (سبحات الوجهية)»\n\nجلوه‌های وجه (سبحات الوجه) ما را درمی‌یابند *** و خودشان با ادراک، از ما شمرده می‌شوند\nاین از غیرت آنها بر اوست، آیا *** کسی از شما ما را می‌فهماند؟\nکه امر در آن چگونه بوده است، زیرا *** موجودی را نمی‌یابی که ما را بشناسد.\n\n[اگر حجاب برداشته شود، سبحات وجه (سبحات الوجه) هر آنچه را که دیده درک کند، می‌سوزاند]\n\nخداوند متعال فرمود: «اللَّهُ نُورُ السَّماواتِ وَالْأَرْضِ» (خداوند نور آسمان‌ها و زمین است). و پیامبر (صلی الله علیه و سلم) درباره حجاب‌های الهی که میان او و خلقش فرستاده شده‌اند، فرمود: اگر خداوند متعال آنها را بردارد، سبحات وجه (سبحات الوجه) هر آنچه را که دیده‌اش از خلق درک کند، خواهد سوزاند.\nو به ایشان (صلی الله علیه و سلم) گفته شد: آیا پروردگارت را دیدی؟ فرمود: «نوراني أراه» (نوری است که آن را می‌بینم).\n\nپس اگر این حجاب‌ها مخلوق باشند، چگونه برای سبحات (سبحات) باقی می‌مانند، در حالی که سبحات از آنها محجوب نیستند؟ اما بدان که این رازی است که خداوند از بندگانش پنهان داشته و آن پنهان‌کاری را حجاب‌های نوری و ظلمانی نامیده است. نور از آن حجاب‌ها، چیزی است که با آن از معارف فکری (المعارف الفكرية) محجوب شده است، و ظلمت از آن، چیزی است که با آن از امور طبیعی و معمول محجوب شده است. پس اگر این حجاب‌ها را از بصیرت‌های بندگانش بردارد، سبحات وجهش (سبحات وجهه) هر آنچه را که دیده‌اش از خلق درک کند، خواهد سوزاند.\n\nو این سوختن (الإحراق) چیزی نیست جز درهم فرورفتن (اندراج) نور پایین‌تر در نوری بالاتر، که خودشان در آن هستند، بلکه خودشان آن نور بالاترند؛ مانند درهم فرورفتن انوار ستارگان در نور خورشید. چنانکه درباره ستاره‌ای که زیر شعاع خورشید قرار دارد، با وجود نور در ذات ستاره، گفته می‌شود که سوخته است؛ اما منظور از آن نیستی نیست، بلکه دگرگونی حال بر چشم یابنده (العين الواجدة) در نگاه بیننده است. پس با انتقال حکم، اسم بر آن و از آن منتقل می‌شود؛ مانند هیزم که هیزم بود، اما وقتی سوخت، زغال نامیده شد، در حالی که جوهر یکی است.\n\nو معلوم است که ستارگان در ذات خود نور دارند، اما ما آنها را به دلیل ضعف ادراک نمی‌بینیم. پس اگر خداوند این حجاب‌ها را در حق عالمان (اهل معرفت) بردارد، آنها نفوس خود را عین او می‌بینند و امر یکی خواهد بود. اما او این حجاب‌ها را از ایشان برداشت، پس ذوات خود را یک ذات واحد دیدند و آنچه از ایشان حکایت شده است را گفتند، مانند «أنا الله» (من خدا هستم) و «سبحانی» (پاکا من). اما حجاب از عامه برداشته نشد، پس امر را آن‌گونه که هست شهود (الشهود) نکردند، در نتیجه «فَتَنَازَعُوا أَمْرَهُمْ بَيْنَهُمْ» (پس در کار خود با یکدیگر به نزاع پرداختند). و عارفان (العارفون) به دلیل ادب با خداوند، راز را پنهان داشتند، زیرا آنان اهل ادب هستند.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «لا تعطوا الحكمة غير أهلها فتظلموها ولا تمنعوها أهلها فتظلموهم» (حکمت را به نااهلان ندهید که به آن ستم کرده‌اید، و آن را از اهلش دریغ نکنید که به آنان ستم کرده‌اید).\nشارع (پیامبر) برای عارفان (العارفين) حکمی دشوارتر از این تکلیف بیان نکرده است، زیرا ایشان را به مراقبت تک‌تک افراد امر کرده است. پس آنان به خاطر این حدیث، عالم را زیر نظر دارند، زیرا ایشان اهل حکمت هستند. پس به هر کس که اهلیت دیدند، عطا می‌کنند تا به ستم در حق او متصف نشوند، و اگر اهلیتی ندیدند، عطا نمی‌کنند تا به ستم در حق حکمت متصف نشوند. بنابراین، آنان پیوسته و همیشه مراقب عالم هستند.\n\nو این بهره آنان از این سخن خداوند است که: «وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَقِيبًا» (و خداوند بر هر چیزی نگهبان است). پس هر کس با چشم خدا مراقبت کند، کاری او را از کار دیگر باز نمی‌دارد، و او در هر چیزی به ذات خود تصرف می‌کند، زیرا مشهد او الهی است و پذیرش از سوی کسی است که در او تصرف می‌شود. پس متصرف از این جهت آسوده است. اما کسی که با چشم نفس خود از پشت حجاب ذاتش مراقبت کند، در نهایت کوشش و خستگی است و تا زمانی که این صفت اوست، پیوسته در رنج خواهد بود.\n\nپس با نور، انوار او درک می‌شود *** و با نور، هر آنچه درک می‌شود، درک می‌گردد.\nپس هر کس به وصف حق (الحق) باشد *** به ذات مالک است و مالک نیست.\n\nو این مقدار اشاره در این منزلگاه برای کسی که تعقل کند کافی است. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 2
}