{
  "id": 381,
  "title": {
    "ar": "الباب الأحد والثمانون وثلاثمائة في معرفة منزل التوحيد والجمع‏",
    "en": "Chapter Three Hundred and Eighty-One: On the Knowledge of the Station (منزل) of Unification (التوحيد) and Gathering (الجمع)",
    "ur": "باب تین سو اکیاسی: توحید (التوحيد) اور جمع (الجمع) کے منزل کی معرفت کے بیان میں",
    "fa": "باب سیصد و هشتاد و یکم در معرفت منزل توحید و جمع"
  },
  "content": {
    "ar": "## «الباب الأحد والثمانون وثلاثمائة» في معرفة منزل التوحيد والجمع‏\n\n\nوهو يحتوي على خمسة آلاف مقام رفرفى وهو من الحضرة المحمدية وأكمل مشاهده من شاهده في نصف الشهر أو في آخره‏\n\n\n> يا مريم ابنة عمران التي خلقت *** فرشا كريما لروح جل من روح‏\n> تحصنت فأتاها الروح يمنحها *** من فوق سبع سماوات من اللوح‏\n\n\n> أهدى لها هبة عليا مشرفة *** أسنى وأشرق فينا من سنا يوح‏\n\n\n> تحيي وليس لها سيف تميت به *** تدعى إذا دعيت باللطف بالروح‏\n\n\n### [عالم العماء]\n\n\nنعني بالهبة عيسى روح الله من قول جبريل لمريم لِأَهَبَ لَكِ غُلاماً زَكِيًّا\n\n\nورد في الخبر أنه قيل لرسول الله صَلَّى اللهُ عَليهِ وسَلَّم أين كان ربنا قبل أن يخلق خلقه فقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم كان في عماء ما فوقه هواء وما تحته هواء\n\n\nوقد ذكرنا فيما تقدم حديث العماء وأن فيه انفتحت صور العالم والذي يقوم عليه الدليل إن كل شي‏ء سوى الله حادث ولم يكن ثم كان فينفي الدليل كون ما سوى الله في كينونة الحق الواجب الوجود لذاته فدوام الإيجاد لله تعالى ودوام الانفعال للممكنات والممكنات هي العالم فلا يزال التكوين على الدوام والأعيان تظهر على الدوام فلا يزال امتداد الخلأ إلى غير نهاية لأن أعيان الممكنات توجد إلى غير نهاية ولا تعمر بأعيانها إلا الخلأ وقولنا فيما تقدم إن العالم ما عمر سوى الخلأ نريد أنه ما يمكن أن يعمر ملا لأن الملأ هو العامر فلا يعمر في ملا وما ثم إلا ملا أو خلافا لعالم في تجديد أبدا فالآخرة لا نهاية لها ولو لا نحن لما قيل دنيا ولا آخرة وإنما كان يقال ممكنات وجدت وتوجد كما هو الأمر فلما عمرنا نحن من الممكنات المخلوقة أماكن معينة إلى أجل مسمى من حين ظهرت أعياننا ونحن صور من صور العالم سمينا ذلك الموطن الدار الدنيا أي الدار القريبة التي عمرناها في أول وجودنا لأعياننا وقد كان العالم ولم نكن نحن مع أن الله تعالى جعل لنا في عمارة الدار الدنيا آجالا ننتهي إليها ثم تنتقل إلى موطن آخر يسمى آخرة فيها ما في هذه الدار الدنيا ولكن متميز بالدار كما هو هنا متميز بالحال ولم يجعل لإقامتنا في تلك الدار الآخرة أجلا تنتهي إليه مدة إقامتنا وجعل تلك الدار محلا للتكوين دائما أبدا إلى غير نهاية وبدل\n\n\nالصفة على الدار الدنيا فصارت بهذا التبديل آخرة والعين باقية وبقي من لا علم له من الله بالأمور في حيرة فعلى الحقيقة ما ثم حيرة في حق العلماء بالله وبنسبة العالم إلى الله فالعلماء في فرحة أبدا ومن عداهم في ظلم الحيرة تائهون دنيا وآخرة ولو لا تجديد الخلق مع الأنفاس لوقع الملل في الأعيان لأن الطبيعة تقتضي الملل وهذا الاقتضاء هو الذي حكم بتجديد الأعيان ولذلك‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عن الله تعالى إن الله لا يمل حتى تملوا\n\n\nفعين ملل العالم هو ملل الحق ولا يمل من العالم إلا من لا كشف له ولا يشهد تجديد العالم مع الأنفاس على الدوام ولا يشهد الله خلاقا على الدوام والملل لا يقع إلا بالاستصحاب فإن قلت فالدوام على تجديد الخلق استصحاب والملل ما وقع مع وجود الاستصحاب قلنا الأحكام الذاتية لا يمكن فيها تبدل والخلاق لذاته يخلق والعالم لذاته ينفعل فلا يصح وجود الملل فالتقليب في النعيم الجديد لا يقتضي الملل في المنقلب فيه لأنه شهود ما لم يشهد بفرح وابتهاج وسرور ولهذا قال تعالى ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ وجد ويوجد إلى غير نهاية فإن الرحمة حكم لا عين فلو كانت عينا وجوديا لانتهت وضاقت عن حصول ما لا يتناهى فيها وإنما هي حكم يحدث في الموجودات بحدوث أعيان الموجودات من الرحمن الرحيم والرَّاسِخُونَ في الْعِلْمِ يعني في العلم بالله يَقُولُونَ آمَنَّا به كُلٌّ من عِنْدِ رَبِّنا الرحمة والمرحوم وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ وهم الغواصون الذين يستخرجون لب الأمور إلى الشهادة العينية بعد ما كان يستر ذلك اللب القشر الظاهر الذي كان به صونه وهذا يحوي على تسعة آلاف مقام هكذا وقع الإخبار من أهل الكشف والوجود منها ألف مقام لطائفة خاصة ولطائفة أخرى ثلاثة آلاف مقام ولطائفة ثالثة خمسة آلاف مقام فارفع الطوائف الطائفة التي لها ألف مقام وتليها في الرفعة الطائفة التي لها ثلاثة آلاف مقام وتليها الطائفة التي لها خمسة آلاف مقام في الرفعة وأعلى الطوائف من لا مقام له وذلك لأن المقامات حاكمة على من كان فيها ولا شك أن أعلى الطوائف من له الحكم لا من يحكم عليه وهم الإلهيون لكون الحق عينهم وهو أحكم الحاكمين وليس ذلك لأحد من الناس إلا للمحمديين خاصة عناية إلهية سبقت لهم كما قال تعالى في أمثالهم إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ يعني النار فإن النار من جملة هذه المقامات فهم على الحقيقة عن المقامات مبعدون فأصحاب المقامات هم الذين قد انحصرت هممهم إلى غايات ونهايات فإذا وصلوا إلى تلك الغايات تجددت لهم في قلوبهم غايات أخر تكون تلك الغايات التي وصلوا إليها لهم بدايات إلى هذه‏\nالغايات الأخر فتحكم عليهم الغايات بالطلب لها ولا يزال لهم هذا الأمر دائما وأما المحمدي فما له هذا الحكم ولا هذا الحصر فاتساعه اتساع الحق وليس للحق غاية في نفسه ينتهي إليها وجوده والحق مشهود المحمدي فلا غاية له في شهوده وما سوى المحمدي فإنه مشاهدا مكانه فما من حالة يقام فيها ولا مقام إلا ويجوز عنده انقضاؤه وتبدل الحال عليه أو إعدامه ويرى أن ذلك من غاية المعرفة بالله حيث وفي الحكم حقه بالنظر إلى نفسه وإلى ربه وعيسى عليه السلام محمدي ولهذا ينزل في آخر الزمان وبه يختم الله الولاية الكبرى وهو روح الله وكلمته وكلمات الحق لا تنفد فليس للمحمدي غاية في خاطره ينتهي إليها\n\n\n### [المقامات لا تدرك إلا بعين الخيال‏]\n\n\nفاعلم إن هذه المقامات المذكورة لا تدرك إلا بعين الخيال إذا شوهدت فإن صورها إذا مثلها الله فيما شاء أن بمثلها متخيلة فتراه أشخاصا رأى العين كما ترى المحسوسات بالعين وكما ترى المعاني بعين البصيرة فإن الله إذا قلل الكثير وهو كثير في نفس الأمر أو كثر القليل وهو قليل في نفس الأمر فما تراه إلا بعين الخيال لا بعين الحس وهو البصر نفسه في الحالين كما قال تعالى وإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ في أَعْيُنِكُمْ قَلِيلًا ويُقَلِّلُكُمْ في أَعْيُنِهِمْ وقال يَرَوْنَهُمْ مِثْلَيْهِمْ رَأْيَ الْعَيْنِ وما كانوا مثليهم في الحس فلو لم ترهم بعين الخيال لكان ما رأيت من العدد كذبا ولكان الذي يريه غير صادق فيما أراه إياك وإذا كان الذي أراك ذلك أراكه بعين الخيال كانت الكثرة في القليل حقا والقلة في الكثرة حقا لأنه حق في الخيال وليس بحق في الحس كما أراك اللبن في الخيال فشربته ولم يكن ذلك اللبن سوى عين العلم فما رأيته لبنا وهو علم إلا بعين الخيال ورأيت تلقينك ذلك العلم ممن تلقنته في صورة شربك اللبن كذلك في عين الخيال والعلم ليس بلبن والتلقين ليس بشرب وقد رأيته كذلك فلو رأيته بعين الحس لكان كذبا لأنك رأيت الأمر على خلاف ما هو عليه في نفسه فما رأيته إلا بعين الخيال في حال يقظتك وإن كنت لا تشعر أنت بذلك فكذلك هو في نفس الأمر لأن الله صادق فيما يعلمه وهو في الخيال صدق كما رأيته وكذلك تلقيك العلوم من الله بالضربة باليد فعلم الضروب بتلك الضربة علم الأولين والآخرين والعلم لا يحصل إلا بالتعليم بالخطاب من المعلم أو بخلق في النفس ضرورة وقد حصل في حضرة الخيال بالضرب فلا بد أن يكون الضرب مخيلا والمضروب في عينه مخيلا إن كان في نوم أو يقظة لصدق الذي يرى ذلك وهو الله كما قال تعالى يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏ ولم تسع في نفس الأمر وهكذا كل ما تراه على خلاف ما هو عليه في نفسه ما تراه إلا بعين الخيال حتى يكون صدقا ولهذا يعبر كل ما وقع من ذلك أي يجوز به العابر إلى المعنى الذي أراد الله بتلك الصورة فلا تغفل عن مثل هذا العلم وفرق بين الأعين واعلم أنك لا تقدر على ذلك إلا بقوة إلهية يعطيها الله من شاء من عباده فتعرض لتحصيلها من الله فإنك مخبر بما رأيت أنك رأيته بحسك ولم يكن الأمر كذلك فتحرر في العبارة فيما تراه كما يفعله المصنف أ لا ترى الصحابة لو وفوا النظر الصحيح حقه وأعطوا المراتب حقها لم يقولوا في جبريل عليه السلام إنه دحية الكلبي ولقالوا إن لم يكن روحانيا تجسد وإلا فهو دحية الكلبي أدركناه بالعين الحسي فلم يحرروا ولا أعطوا الأمر الإلهي حقه فهم الصادقون الذين ما صدقوا فقال لهم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم هو جبريل فحينئذ عرفوا ما رأوا وبما ذا رأوا كما قالوا فيه لما تمثل لهم في صورة أعرابي مجهول عندهم حين جاء يعلم الناس دينهم‏\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أ تدرون من السائل فقالوا الله ورسوله أعلم لكونه ظهر في صورة مجهولة عندهم فقال لهم هذا جبريل‏\n\n\nفإن كان هذا الحديث بعد حديث دحية فقولهم الله ورسوله أعلم يحتمل أنهم أرادوا احتمال المعنى أو الصورة الروحية أو يكون إنسانا في نفس الأمر وإن كان هذا الحديث أو لا فما جهلوا أنه إنسان ولكن جهلوا اسمه ولمن ينتسب من قبائل العرب فلا يعرف الرائي أنه أدرك ما أدركه بعين الخيال ما لم يعلم المدرك ما هو وما في الكون أعظم شبهة من التباس الخيال بالحس فإن الإنسان إن تمكن في هذا النظر شك في العلوم الضرورية وإن لم يتمكن فيه أنزل بعض الأمور غير منزلتها فإذا أعطاه الله قوة التفصيل أبان له عن الأمور إذا رآها بأي عين رآها فيعلم ما هي إذا علم العين التي رآها به من نفسه فأكد ما على أهل علم الله هذا العلم وكثير من أهل الله من لا يجعل باله لما ذكرناه ولو لا علمه بنومه فيما يراه أنه رآه في حال نومه ما قال إنه خيال فكم يرى في حال اليقظة مثل هذا ويقول إنه رأى محسوسا بحسه أ لا تراه صَلَّى اللهُ عَليهِ وسَلَّم في صدق رؤياه إنه ما يجري على نفسه حال في جسده إلا ويظهر ذلك له في صورة\nمجسدة إذا هو نام فيحكم على محسوسه بما علمه من صورة متخيلة فقيل له في الوضوء عند ما نام ونفخ فلم يتوضأ وصلى بالوضوء الذي نام عليه إن عيني تنامان ولا ينام قلبي يقول إنه لما انقلب إلى عالم الخيال ورأى صورته هناك وهو قد نام على طهارة ما رأى أن تلك الصورة أحدثت ما يوجب الوضوء فعلم أن جسده المحسوس ما طرأ عليه ما ينقض وضوء الذي نام عليه ولهذا نقول في النوم إنه سبب للحدث وما هو حدث فمن حصل له هذا المقام وكان بهذه الصفة ونام على طهارة ورأى نفسه في النوم فلينظر في تلك الصورة المرئية التي هي عينه فإن أحس بحدث فما يقوم بها حدث حتى يحدث بجسده النائم أي يكون منه ما ينقض الوضوء إما بعين ذلك الحدوث وإما أن يكون صورة تعريف بأنه أحدث فيتوضأ إذا قام من نومه فإن من الأحداث في النوم ما يكون له أثر في الجسد النائم كالاحتلام في بعض الأوقات وكالذي يرى أنه يبول فيبول في فراشه فيستيقظ فيجد في الحس قد وقع ما رآه في النوم وقد لا يجد لذلك أثرا فيكون تنبيها له إنه أحدث هذا يطرأ للعلماء بهذه الصفة وقد كان مثل هذا للشيخ الضرير أبي الربيع المالقي شيخ أبي عبد الله القرشي بمصر فكان يوم الإثنين خاصة إذا نام فيه تنام عيناه ولا ينام قلبه وهذا باب واسع المجال وهو عند علماء الرسوم غير معتبر ولا عند الحكماء الذين يزعمون أنهم قد علموا الحكمة وقد نقصهم علم شموخ هذه المرتبة على سائر المراتب ولا قدر لها عندهم فلا يعرف قدرها ولا قوة سلطانها إلا الله ثم أهله من نبي أو ولي مختص غير هذين فلا يعرف قدر هذه المرتبة والعلم بها أول مقامات النبوة ولهذا\n\n\nكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذا أصبح وجلس مجلسه بين أصحابه يقول لهم هل فيكم من رأى رؤيا\n\n\nوذلك ليرى ما أحدث الله البارحة في العالم أو ما يحدثه في المستقبل وقد أوحى به إلى هذا الرائي في منامه إما صريح وحي وإما وحي في صورة يعلمها الرائي ولا يعلم ما أريد بها فيعبرها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لما أراد الله بها فهذا كان من اعتنائه صَلَّى اللهُ عَليهِ وسَلَّم بهذه المرتبة المجهولة عند العلماء وما أحسن تنبيه الله أولي الألباب من عباده وأهل الاعتبار إذ قال هُوَ الَّذِي يُصَوِّرُكُمْ في الْأَرْحامِ كَيْفَ يَشاءُ فمن الأرحام ما يكون خيالا فيصور فيه المتخيلات كيف يشاء عن نكاح معنوي وحمل معنوي يفتح الله في ذلك الرحم المعاني في أي صورة ما شاء ركبها فيريك الإسلام فيه والقرآن سمنا وعسلا والقيد ثبات في الدين والدين قميصا سابغا وقصيرا درعا ومجولا ونقيا ودنسا على حسب ما يكون الرائي أو من يرى له عليه من الدين ولقد رأيت لقاضي دمشق عند ما ولي القضاء بدمشق وهو شمس الدين أحمد بن مهذب الدين خليل الجوني وفقه الله وسدده بملائكته وعصمه في أحكامه وقائل يقول له في النوم إن الله قد خلع عليك ثوبا نقيا سابغا فلا تدنسه ولا تقلصه واستيقظت وذكرتها له فالله يجعله ممن حفظ الوصية الإلهية فالخيال من جملة الأرحام التي تظهر\n\n\nفيها الصور وهذه الحضرة الخيالية لما قبلت المعاني صورا قال الله فيها زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَواتِ من النِّساءِ أي في النساء فصور الحب صورة زينها لمن شاء من عباده فأحبها بنفسها ما أحبها بغيرها لأنه تعالى ما زين له إلا حب الشهوة فيما ذكره فالحب المطلق زين له ثم علقه بالشهوة فيما ذكره وعلقه لمن شاء في الشهوة أيضا في أمر آخر وإنما ذكر الشهوة لأنها صورة طبيعية فإن الخيال حصرته الطبيعة ثم يحكم الخيال عليها فيجسدها إذا شاء فهذا فرع يحكم على أصله لأنه فرع كريم ما أوجد الله أعظم منه منزلة ولا أعم حكما يسرى حكمه في جميع الموجودات والمعدومات من محال وغيره فليس للقدرة الإلهية فيما أوجدته أعظم وجودا من الخيال فبه ظهرت القدرة الإلهية والاقتدار الإلهي وبه كَتَبَ عَلى‏ نَفْسِهِ الرَّحْمَةَ وأمثال ذلك وأوجب عموما وهو حضرة المجلى الإلهي في القيامة وفي الاعتقادات فهو أعظم شعائر الله على الله ومن قوة حكم سلطانه ما تثبته الحكماء مع كونهم لا يعلمون ما قالوه ولا يوفونه حقه وذلك أن الخيال وإن كان من الطبيعة فله سلطان عظيم على الطبيعة بما أيده الله به من القوة الإلهية فإذا أراد الإنسان أن ينجب ولده فليقم في نفسه عند اجتماعه مع امرأته صورة من شاء من أكابر العلماء وإن أراد أن يحكم أمر ذلك فليصورها في صورتها التي نقلت إليه أو رآه عليها المصور ويذكر لامرأته حسن ما كانت عليه تلك الصورة وإذا صورها المصور فليصورها على صورة حسن علمه وأخلاقه وإن كانت صورته المحسوسة قبيحة المنظر فلا يصورها إلا حسنة المنظر بقدر حسن علمه وأخلاقه كأنه يجسد تلك المعاني ويحضر تلك الصورة لامرأته ولعينه عند الجماع‏\nويستفرغان في النظر إلى حسنها فإن وقع للمرأة حمل من ذلك الجماع أثر في ذلك الحمل ما تخيلا من تلك الصورة في النفس فيخرج المولود بتلك المنزلة ولا بد حتى أنه إن لم يخرج كذلك فلأمر طرأ في نفس الوالدين عند نزول النطفة في الرحم أخرجهما ذلك الأمر عن مشاهدة تلك الصورة في الخيال من حيث لا يشعرون وتعبر عنه العامة بتوحم المرأة وقد يقع بالاتفاق عند الوقاع في نفس أحد الزوجين أو الزوجين صورة كلب أو أسد أو حيوان ما فيخرج الولد من ذلك الوقاع في أخلاقه على صورة ما وقع للوالدين من تخيل ذلك الحيوان وإن اختلفا فيظهر في الولد صورة ما تخيله الوالد وصورة ما تخيلته الأم حتى في الحس الظاهر في الصورة أو في القبح وهم مع معرفتهم بهذا السلطان لا يرفعون به رأسا في اقتناء العلوم الإلهية لأنهم لجهلهم يطمعون في غير مطمع وهو التجرد عن المواد وذلك لا يكون أبدا لا في الدنيا ولا في الآخرة فهو أمر أعني التجرد عن المواد يعقل ولا يشهد وليس لأهل النظر غلط أعظم من هذا ولا يشعرون بغلطهم ويتخيلون أنهم في الحاصل وهم في الفائت فيقطعون أعمارهم في تحصيل ما ليس يحصل لهم ولهذا لا يسلم عقل من حكم وهم ولا خيال وهو في عالم الملائكة والأرواح إمكان فلا يسلم روح ولا عالم بالله من إمكان يقع له في كل ما يشهده لأن كل ما سوى الله حقيقته من ذاته الإمكان والشي‏ء لا يزول عن حكم نفسه فلا يرى ما يراه من قديم ومحدث إلا بنفسه فيصحبه الإمكان دائما ولا يشعر به إلا من علم الأمر على ما هو عليه فيعقل التجريد وهما ولا يقدر عليه في نفسه لأنه ليس ثم وهنا زلت أقدام الكثيرين إلا أهل الله الخاصة فإنهم علموا ذلك بإعلام الله أ لا ترى إلى زكريا عليه السلام لما دخل على مريم المحراب وهي بتول محررة وقد علم زكريا ذلك ورأى عندها رزقا آتاها الله فطلب من الله عند ذلك أن يهبه ولدا حين تعشق بحالها فقال رب هب لي من لدنك يقول من عندك عندية رحمة ولين وعطف ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعاءِ ومريم في خياله من حيث مرتبتها وما أعطاها الله من الاختصاص بالعناية الإلهية فَنادَتْهُ الْمَلائِكَةُ وهُوَ قائِمٌ يُصَلِّي في الْمِحْرابِ لأنه دخل عليها المحراب عند ما وجد عندها الرزق أَنَّ الله يُبَشِّرُكَ بِيَحْيى‏ مُصَدِّقاً بِكَلِمَةٍ من الله وسَيِّداً وهو الكمال لأن مريم كملت فكمل يحيى بالنبوة وحَصُوراً وهو الذي اقتطعه الله عن مباشرة النساء وهو العنين عندنا كما اقتطع مريم عن مباشرة الرجال وهي البتول فكان يحيى عليه السلام زير نساء كما كانت حنة مريم لأن المريم المنقطعة من الرجال واسمها حنة ومريم لقب لها وصفت به لما ذكرناه آنفا فانظر ما أثر سلطان الخيال من زكريا في ابنه يحيى عليه السلام حين استفرغت قوة زكريا في حسن حال مريم عليه السلام لما أعطاها الله من المنزلة ونَبِيًّا من الصَّالِحِينَ فما عصى الله قط وهو طلب الأنبياء كلهم أن يدخلهم الله برحمته في عباده الصالحين وهم الذين لم يقع منهم معصية قط كبيرة ولا صغيرة وما رأيت أعجب من حال زكريا عليه السلام وما رأيت من ظهر فيه سلطان الإنسانية مثله هو الذي يقول هَبْ لِي من لَدُنْكَ ذُرِّيَّةً طَيِّبَةً فما سأل حتى تصور الوقوع ولا بقوله رَبِّ أَنَّى يَكُونُ لِي غُلامٌ وقَدْ بَلَغَنِيَ الْكِبَرُ وامْرَأَتِي عاقِرٌ فأين هذه الحالة من تلك الحالة فإن لم يكن ثم قرينة حال جعلته أن يقول مثل هذا حتى يقال له في الوحي كَذلِكَ الله يَفْعَلُ ما يَشاءُ فيكون قصده إعلام الله بذلك حتى يعلم غيره إِنَّ الله يَفْعَلُ ما يَشاءُ في المعتاد أن يخرقه كما وقع وإن كان ذلك القول من نفسه فقد أعطته الإنسانية قوتها فإن الإنسان بذاته كما ذكره الله في كتابه فما ذكره الله في موضع إلا وذكر عند ذكره صفة نقص تدل على خلاف ما خلق له لأن الله خلق الإنسان في أَحْسَنِ تَقْوِيمٍ وهو أنه خلقه تعالى ثم رده إلى أسفل سافلين ليكون له الرقي إلى ما خلقه الله له ليقع الثناء عليه بما ظهر منه من رقية فمن الناس من بقي في أسفل سافلين الذي رد إليه وإنما رد إليه لأنه منه خلق ولو لا\n\n\nذلك ما صح رده وليس أريد بأسفل سافلين إلا حكم الطبيعة التي منه نشأ عند ما أنشأ الله صورة جسده وروحه المدبرة له فرده إلى أصل ما خلقه منه فلم ينظر ابتداء إلا إلى طبيعته وما يصلح جسده وأين هو من قوله بلى عن معرفة صحيحة\n\n\n### [أن في حضرة الخيال في الدنيا يكون الحق محل تكوين العبد]\n\n\nواعلم أن في حضرة الخيال في الدنيا يكون الحق محل تكوين العبد فلا يخطر له خاطر في أمر ما إلا والحق يكونه في هذه الحضرة كتكوينه أعيان الممكنات إذا شاء ما يشاء منها فمشيئة العبد في هذه الحضرة من مشيئة الحق فإن العبد ما يشاء إلا أن يشاء الله فما شاء الحق إلا أن يشاء العبد في الدنيا ويقع بعض ما يشاء العبد في الدنيا في الحس وأما في الخيال فكمشيئة الحق في النفوذ فالحق‏\nمع العبد في هذه الحضرة على كل ما يشاؤه العبد كما هو في الآخرة في عموم حكم المشيئة لأن باطن الإنسان هو ظاهره في الآخرة فلذلك يتكون عن مشيئته كل شي‏ء إذا اشتهاه فالحق في تصريف الإنسان في هذه الحضرة في الدنيا وفي شهوته في الآخرة لا في الدنيا حسا فالحق تابع في هذه في الحضرة وفي الآخرة لشهوة العبد كما هو العبد في مشيئته تحت مشيئته الحق فما للحق شأن إلا مراقبة العبد ليوجد له جميع ما يريد إيجاده في هذه الحضرة في الدنيا وكذلك في الآخرة والعبد تبع للحق في صور التجلي فما يتجلى الحق له في صورة إلا انصبغ بها فهو يتحول في الصور لتحول الحق والحق يتحول في الإيجاد لتحول مشيئة العبد في هذه الحضرة الخيالية في الدنيا خاصة وفي الآخرة في الجنة عموما ولما خلق الله همما فعالة في الوجود في الحس وهمما غير فعالة في الوجود في الحس ظهر بذلك التفاضل في الهمم كما ظهر التفاضل في جميع الأشياء حتى في الأسماء الإلهية والهمم الفعالة في الدنيا قد تفعل في همم غير أصحابها وقد لا نفعل مثل قوله فيما لا تفعل إِنَّكَ لا تَهْدِي من أَحْبَبْتَ فبعض الهمم الفعالة والمنفعلة قد لا تنفعل لهمة فعالة فيريد منه أن يريد أمرا ما فلا يريده من يريد منه أن يريده لأن الهمم تتقابل للجنسية فلهذا قد لا تؤثر فيها فإذا تعلقت بغير الجنس أثرت كل همة فعالة ولا بد وأما في جنسها أعني في الهمم فقد تنفعل لها بعض الهمم وقد لا تنفعل وقد ظهر ذلك في الرسل عليه السلام وأتباعهم يريد الرسول من شخص أن يريد الإسلام فيريده فيسلم ويريد من آخر إن يريد الإسلام فلا يريده فلو تعلقت همة الرسول بتحريك الألسنة بالشهادة بالتوحيد من غير إرادة الناطق بها لوقعت عموما ولكن لا تنفع صاحبها وإن كانت تنفع للسانه فإن لسانه ما عصى الله قط من حيث نفسه وإنما وقعت فيه المخالفة لا منه من حركة المريد تحريكه فهو مجبور حيث لم يعط الدفع عن نفسه لكونه من آلات النفس فهو طائع من ذاته ولو فتح الله سمع صاحبه لنطق اللسان الذاتي إذا جعلته النفس يتلفظ بمخالفة ما أراد الشرع أن يتلفظ به لبهت فلهذا قلنا إن المخالفة ظهرت فيه للجبر لا منه فإنه طائع بالذات شاهد عدل على محركه كما ورد يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ بها وكذلك كل جارحة مصرفة من سمع وبصر وفؤاد وجلد وعصب وفرج ونفس وحركة\n\n\n> والناس في غفلة عما يراد بهم *** وفي عماية عماهم عليه له‏\n\n\nفالإنسان سعيد من حيث نشأته الطبيعية ومن حيث نشأة نفسه الناطقة بانفراد كل نشأة عن صاحبتها وبالمجموع ظهرت المخالفة وما عين المخالفة إلا التكليف فإذا ارتفع التكليف حيث ارتفع الحكم بالمخالفة ولم يبق إلا موافقة دائمة وطاعة ممكن لواجب مستمرة كما هو في نفس الأمر في وقت المخالفة مطيع للمشيئة مخالف لأمر الواسطة للحسد الذي في الجنس وفي هذا المنزل من العلوم علم توحيد الحق وتصديق المخبرين عن الحق وهم التراجمة السفراء من بشر وملك وخاطر وعلم الفرقان بالعلم بما تميزت به الأشياء وهذا هو علم التوحيد العالم الذي يسرى في كل واحد واحد من العالم وعلم الكشف الإلهي وفيه علم التناسل الذي لا ينقطع دنيا ولا آخرة وفيه علم الحضرة التي وقع فيها التشبيه بين الأشياء والاشتراك في الصورة وفيه علم ما ينفرد به الحق من العلم دون الخلق مما لا يعلمه الخلق إلا بإعلام الله وفيه علم الميل والاستقامة وفيه علم الجمع للتفصيل وفيه علم العوائد لما ذا ترجع وما ثم تكرار والإعادة تكرار فالأمر مشكل وسبب أشكاله ذكر الحق العادة والإعادة والكشف يعطي عدم الإعادة في الكون لا الإعادة في نش‏ء الآخرة فإن تلك الإعادة حكم إلهي في حق أمر ما مخصص بمنزلة من خرج من دار ثم عاد إليها فالدار الدار والخارج الداخل وما ثم إلا انتقال في أحوال لا ظهور أعيان مع صحة إطلاقها أن الخارج من الدار عاد إلى داره فعلمنا متعلق الإعادة وفيه علم المفاضلة بالدار وفيه علم نعوت أهل الله وفيه علم ما يشترك فيه الحق والعالم العالم بالله وما ثم إلا عالم بالله‏\n\n\nغير أنه من العلماء من يعلم أنه عالم بالله ومن الناس من لا يعلم أنه عالم بالله وهو على\n\n\nعلم بمن يشهد ويعاين ولا يعلم أنه الحق فلو سألته هل تعلم الله قال لا فلو سألته فيما شهده هل تعلم هذا الذي شهدته من حيث ما هو مشهود لك يقول نعم يقال له فمن هو يقول هذا الذي أشهده فيقال له فمن يقال له يقول لا أدري فإذا قيل له هو كذا أي هو فلان بالاسم الذي يعرفه به ولكن ما عرف أن هذا المشهود هو مسمى ذلك الاسم فما جهل‏\nإلا حمل هذا الاسم على هذا المشهود فقد كان موصوفا بعلم الاسم وموصوفا بعلم المشهود من حيث ما هو مشهود له وما استفاد إلا كون هذا المشهود مسمى ذلك الاسم المعلوم وفيه علم انقياد الخلق للحق وأنه نتيجة عن انقياد الحق للخلق لطلب الممكن الواجب فانقاد له الواجب فيما طلبه فأوجده ولم يكن شيئا وفيه علم سبب الاختلاف الواقع في العالم مع العلم بما يوجب رفع الاختلاف فما الذي حكم على العلم مع قوة سلطانه وفيه علم الاغترار وما سببه الذي أظهره وفيه علم ما هو العمل والكسب والفرق بين الكسب والاكتساب لأن الله ميز الكسب من الاكتساب باللام وبعلي فقال لَها ما كَسَبَتْ وعَلَيْها ما اكْتَسَبَتْ وفيه علم الاختيار الإلهي وفيه علم متى يستند إلى الضد فيكون الضد رحمة لضده مع أنه عدو له بالطبع وفيه علم التحجير عن الخوض في الله وفيه علم الإحاطة بالأعمال إحاطة مشاهدة لا إحاطة تلبس وفي أي خزانة ادخرت إلى وقت شهودها وما حكمها بعد شهودها في نفسها وفيما يعود منها على العامل لها وفيه علم ما الحضرة التي تقلب الحقائق ولا تقلب نفسها وهي من جملة الحقائق وفيه علم المناسبات وفيه علم ما يرجع إليه في الحكم مما لا يتصف بالقول ومع ذلك فله الفصل في بعض القضايا وهو الاقتراع وأمثاله وفيه علم الغاية التي تطلبها الرسل من الله في هذه الدار وفيه علم النيابة الإلهية في التكوين وفيه علم غريب متعلق بالمحبة وهو الزهد في المحبوب من أجل المحبوب مع اتصافه بالحب في المزهود فيه وبقاء ذلك الوصف عليه وفيه علم الاعتصام وفيه علم البياض والسواد ولبعض أهل الطريق تأليف فيه سماه البياض والسواد وفيه علم فضل الأمم بعضهم على بعض وفضل هذه الأمة المحمدية على سائر الأمم وهل من أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم من كان قبل بعثته فرآه في كشفه وآمن به واتبعه في قدر ما كشف له منه وهل يحشر من هذه صفته في أمته أو يحشر أمة وحده أو كان صاحب هذا الكشف متبعا لشرع نبي خاص كعيسى أو موسى أو من كان من الرسل عليه السلام فرأى مشاهدة أن الشرع الذي جاء به ذلك النبي الخاص الذي هذا متبعة إنه نائب فيه عن محمد صَلَّى اللهُ عَليهِ وسَلَّم وأن ذلك شرعه فاتبعه على أنه شرع محمد صَلَّى اللهُ عَليهِ وسَلَّم وأن ذلك الرسول مبلغ عنه ما ظهر به من الشرع فهل يحشر مثل هذا في أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم أو يكون من أمة ذلك النبي ثم إنه إذا اتفق أن يحشر في أمة ذلك الرسول ثم دخل الجنة ونال منزلته هل ينالها في منازل هذه الأمة المحمدية أو لا ينزل منها إلا في منازل أتباع ذلك الرسول وأمته أو له في منازل ذلك الرسول مع أمته منازل من حيث ما هو متبع وله منازل مع الأمة المحمدية من حيثما اتبعه بما أعطاه الكشف الذي ذكرناه آنفا وفيه علم الصحبة ومن يصحبك بالصفة ومن يصحبك بالوجه ومن يصحبك بالوجه ومن يصحبك لك ومن يصحبك لنفسه ومن يصحبك لله ومن أولى بالصحبة ومن يصحب الله ومن له مقام أن يصحب ولا يصحب أحدا والفرق بين الصحبة والمصاحبة وفيه علم المقامات والأحوال وفيه علم نعم وبئس وفيه علم الجزاء في الدنيا وفيه علم اتصاف العالم بالاستفادة فيما هو به عالم وفيه علم أصناف المقربين ودرجاتهم في القربة من كل أمة وفيه علم من يريد الله ومن يريد غير الله وما متعلق الإرادة وهل يصدق من يقول إنه يريد الله أو لا يصدق وفيه علم الالتباس في الموت ومن اتصف بالضدين وفيه علم الاستدراج وفيه علم ما يقبله الحق من النعوت ولا ينبغي أن تنسب إليه لكونها في العرف والشرع صفة نقص في الجناب الإلهي وهي شرف ورفعة في المحدث وفيه علم فنون من العلوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Eighty-One: On the Knowledge of the Station of Unification and Gathering (منزل التوحيد والجمع)\n\nIt contains five thousand *rafraf* stations (مقام رفرفى). It originates from the Muhammadan Presence (الحضرة المحمدية), and its most perfect witnessing is for him who witnesses it in the middle of the month or at its end.\n\n> O Mary, daughter of Imran, who created\n> A noble couch for a Spirit, exalted is He who breathed it.\n> She guarded herself, and the Spirit came to her, granting her\n> [A gift] from above seven heavens, from the Tablet (اللوح).\n> He gifted her a sublime, honored gift,\n> More radiant and shining among us than the light of Yuh.\n> She gives life, yet has no sword by which to kill;\n> She is called, when invoked with gentleness, 'The Spirit' (الروح).\n\n### The World of the Cloud (عالم العماء)\n\nBy the gift, we mean Jesus, the Spirit of Allah, based on the saying of Gabriel to Mary: <<لِأَهَبَ لَكِ غُلاماً زَكِيًّا>> (That I may bestow upon you a pure boy).\n\nIt is reported in the tradition that the Messenger of Allah, peace and blessings be upon him, was asked: \"Where was our Lord before He created His creation?\" The Messenger of Allah, peace and blessings be upon him, replied: \"He was in a Cloud (عماء), with no air above it and no air below it.\"\n\nWe have mentioned previously the hadith of the Cloud (العماء) and that within it the forms of the World (العالم) were opened up. That which the proof establishes is that everything other than Allah is originated, having not been, and then came into being. Thus, the proof negates the existence of anything other than Allah within the Being (كينونة) of the Real (الحق), Who is Necessary of Existence (الواجب الوجود) by His Essence (الذات). Therefore, the permanence of bringing into existence belongs to Allah the Exalted, and the permanence of receptivity (الانفعال) belongs to the possibles (الممكنات). The possibles are the World. Thus, creation (التكوين) continues perpetually, and the essences (الأعيان) appear perpetually.\n\nThe extension of the void (الخلأ) continues without end, because the essences of the possibles (أعيان الممكنات) come into existence without end, and they only populate the void with their essences. Our previous statement that the World only populated the void means that it is impossible for it to populate the plenum (ملا), because the plenum is that which is already populated, so it cannot be populated within a plenum. And there is nothing there except plenum or void, contrary to a world in perpetual renewal.\n\nThe Hereafter (الآخرة) has no end. Were it not for us, neither 'this world' (دنيا) nor 'the Hereafter' would be spoken of. Rather, it would simply be said: 'possibles that existed and are existing,' as is the case. But when we, being created possibles, populated specific places for a fixed term (أجل مسمى) from the moment our essences appeared—and we are forms among the forms of the World—we named that abode *al-Dar al-Dunya* (the Near Abode), meaning the near abode which we populated at the beginning of the existence of our essences. The World existed, and we did not, even though Allah the Exalted appointed for us, in the populating of the Near Abode, terms to which we must reach, and then we transfer to another abode called the Hereafter. It contains what is in this Near Abode, but distinguished by the abode, just as here it is distinguished by the state (الحال). He did not appoint for our residence in that Abode of the Hereafter a term to which the duration of our residence would end. He made that Abode a place for perpetual creation, forever, without end. And He changed the description of the Near Abode, so by this change, it became the Hereafter, while the essence (العين) remains.\n\nHe who lacks knowledge of Allah concerning these matters remains in confusion (حيرة). In reality, there is no confusion for those who possess Gnosis of Allah (العلماء بالله) regarding the relationship of the World to Allah. Thus, the Gnostics are in perpetual joy, while those besides them are lost in the darkness of confusion, both in this world and the Hereafter.\n\nWere it not for the renewal of creation (تجديد الخلق) with every breath, boredom (الملل) would occur in the essences, because nature necessitates boredom. This necessity is what decreed the renewal of the essences. For this reason, the Messenger of Allah, peace and blessings be upon him, said concerning Allah the Exalted: \"Indeed, Allah does not become bored until you become bored.\"\n\nThus, the very boredom of the World is the boredom of the Real (الحق). No one becomes bored with the World except he who lacks Unveiling (كشف), who does not witness the perpetual renewal of the World with every breath, and who does not witness Allah as the perpetual Creator (خلاق) always. Boredom only occurs through continuity (الاستصحاب). If you say: 'But the permanence of the renewal of creation is continuity, yet boredom has not occurred despite the existence of continuity,' we reply: Essential decrees (الأحكام الذاتية) cannot be changed. The Creator, by His Essence (الذات), creates, and the World, by its essence, is receptive. Therefore, the existence of boredom is impossible. The constant transformation within new bliss does not necessitate boredom in the one being transformed, because it is the witnessing of what has not been witnessed before, accompanied by joy, delight, and happiness.\n\nFor this reason, the Exalted said: <<ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (And My Mercy encompasses all things) that exist and will exist without end. For Mercy (الرحمة) is a decree (حكم), not an entity (عين). If it were an existent entity, it would end and be too narrow to contain the occurrence of the infinite within it. Rather, it is a decree that occurs in the existents (الموجودات) through the origination of the essences of the existents, proceeding from the All-Merciful (الرحمن) and the Compassionate (الرحيم). And <<الرَّاسِخُونَ في الْعِلْمِ>> (Those firmly rooted in Knowledge)—meaning in the Knowledge of Allah—<<يَقُولُونَ آمَنَّا به كُلٌّ من عِنْدِ رَبِّنا>> (Say: 'We believe in it; all is from our Lord')—both the Mercy and the recipient of Mercy—<<وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ>> (And none will take heed except those of understanding [أُولُوا الْأَلْبابِ]). They are the divers who extract the kernel (لب) of matters into ocular witnessing (الشهادة العينية), after that kernel had been concealed by the apparent husk (القشر) which provided its protection.\n\nThis contains nine thousand stations (مقامات). This is how the report came from the People of Unveiling (الكشف) and Existence (الوجود): one thousand stations for a specific group, three thousand stations for another group, and five thousand stations for a third group. The highest of the groups is the one with one thousand stations, followed in rank by the group with three thousand stations, and followed in rank by the group with five thousand stations. The highest of the groups is the one who has no station, because the stations rule over those who are in them. Undoubtedly, the highest of the groups is the one who possesses the ruling authority, not the one who is ruled over. These are the Divine Ones (الإلهيون), because the Real (الحق) is their very essence, and He is the Wisest of Rulers. This is not granted to anyone among mankind except the Muhammadans (المحمديين) specifically, due to a divine providence that preceded them, as the Exalted said concerning their likes: <<إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ>> (Indeed, those for whom the best [الحسنى] has preceded from Us—those are far removed from it)—meaning the Fire. For the Fire is among these stations. Thus, in reality, they are far removed from the stations.\n\nThe People of the Stations (أصحاب المقامات) are those whose aspirations (همم) are confined to goals and ends. When they reach those goals, other goals are renewed in their hearts, and the goals they reached become beginnings for them toward these other goals. Thus, the goals rule over them by demanding pursuit, and this state remains perpetual for them. As for the Muhammadan, he does not have this ruling or this confinement. His vastness is the vastness of the Real, and the Real has no goal in Himself to which His Existence (وجوده) ends. And the Real is the witnessed object (مشهود) of the Muhammadan, so he has no goal in his witnessing. But everyone other than the Muhammadan witnesses his place. There is no state (حالة) in which one resides, nor any station, whose termination, change of state, or annihilation is not permissible in his view. He sees that this is the ultimate degree of Gnosis of Allah (المعرفة بالله), since he fulfills the decree (الحكم) its due right by looking at himself and at his Lord. And Jesus, peace be upon him, is a Muhammadan. This is why he descends at the end of time, and through him, Allah seals the Greater Sainthood (الولاية الكبرى). He is the Spirit of Allah and His Word (كلمته), and the Words of the Real do not run out. Thus, the Muhammadan has no goal in his mind (خاطره) to which he reaches an end.\n\n### The Stations are only perceived by the Eye of Imagination (عين الخيال)\n\nKnow that these mentioned stations are only perceived by the eye of Imagination (الخيال) when they are witnessed. For their forms, when Allah represents them in whatever way He wills to represent them, are imagined (متخيلة). You see them as physical persons, visible to the eye, just as you see sensibles with the eye, and just as you see meanings with the eye of insight (البصيرة). For when Allah diminishes the many—which is many in reality—or increases the few—which is few in reality—you only see it with the eye of Imagination, not with the eye of sense perception (الحس), although it is the sight itself in both cases. As the Exalted said: <<وإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ في أَعْيُنِكُمْ قَلِيلًا ويُقَلِّلُكُمْ في أَعْيُنِهِمْ>> (And [remember] when He showed them to you, when you met, as few in your eyes, and He made you few in their eyes). And He said: <<يَرَوْنَهُمْ مِثْلَيْهِمْ رَأْيَ الْعَيْنِ>> (They saw them as twice their number, visible to the eye). Yet, they were not twice their number in sense perception. Had you not seen them with the eye of Imagination, the number you saw would have been a lie, and the One showing it would not have been truthful in what He showed you. But if the One who showed you that showed it to you with the eye of Imagination, then the multiplicity in the few was true, and the fewness in the many was true, because it is true in Imagination, though not true in sense perception.\n\nJust as He showed you milk in Imagination, and you drank it, yet that milk was nothing but the very essence of Knowledge (العلم). You only saw it as milk, while it was Knowledge, through the eye of Imagination. And you saw your reception of that Knowledge from the one who imparted it to you in the form of your drinking the milk, likewise through the eye of Imagination. Knowledge is not milk, and imparting is not drinking, yet you saw it as such. Had you seen it with the eye of sense perception, it would have been a lie, because you would have seen the matter contrary to what it is in itself. You only saw it with the eye of Imagination, even in your waking state, though you may not realize it. This is how it is in reality, because Allah is truthful in what He makes known, and it is truth in Imagination, just as you saw it.\n\nLikewise, your reception of sciences from Allah through a strike of the hand: the knowledge of the strikes through that single strike is the knowledge of the first and the last. Knowledge is only acquired through instruction by discourse from the teacher, or by the creation of necessity within the soul. Yet, it occurred in the Presence of Imagination (حضرة الخيال) through the strike. Therefore, the strike must be imagined (مخيل), and the one struck, in his essence, must be imagined, whether he is asleep or awake, due to the truthfulness of the One who shows that, Who is Allah. As the Exalted said: <<يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏>> (It seemed to him, from their magic, that they were moving), yet they were not moving in reality. Thus, everything you see contrary to what it is in itself, you only see it with the eye of Imagination, so that it may be true. For this reason, everything that occurs in this manner is interpreted, meaning the interpreter passes through it to the meaning that Allah intended by that form.\n\nDo not be heedless of such knowledge. Distinguish between the eyes, and know that you cannot achieve this except through a divine power that Allah grants to whomever He wills among His servants. Therefore, expose yourself to obtaining it from Allah. For you report what you saw as having been seen by your sense perception, yet the matter was not so. Therefore, be precise in expressing what you see, as the author does.\n\nDo you not see that if the Companions (الصحابة) had given the correct observation its due right and given the levels (المراتب) their due right, they would not have said concerning Gabriel, peace be upon him, that he was Dihya al-Kalbi? Rather, they would have said: 'Either he is a spirit who materialized, or he is Dihya al-Kalbi whom we perceived with the sensory eye.' They were not precise and did not give the divine matter its due right. They are the truthful ones who did not speak the truth [in their description]. Then the Messenger of Allah, peace and blessings be upon him, told them: \"He is Gabriel.\" Only then did they know what they had seen and with what [eye] they had seen it. Just as they said concerning him when he appeared to them in the form of a Bedouin unknown to them, when he came to teach the people their religion. The Messenger of Allah, peace and blessings be upon him, asked them: \"Do you know who the questioner was?\" They replied: \"Allah and His Messenger know best,\" because he appeared in a form unknown to them. Then he told them: \"This was Gabriel.\"\n\nIf this hadith occurred after the hadith of Dihya, their saying 'Allah and His Messenger know best' suggests that they considered the possibility of the meaning, or the spiritual form, or that he was a human being in reality. But if this hadith was first, they did not ignore that he was a human, but they ignored his name and to which Arab tribe he belonged.\n\nThe seer does not know that he perceived what he perceived with the eye of Imagination unless he knows what the perceived object is. There is no greater ambiguity in the Cosmos (الكون) than the confusion of Imagination with sense perception. If a person becomes proficient in this observation, he doubts necessary knowledge; and if he does not become proficient, he places certain matters in a rank other than their own. But when Allah grants him the power of distinction (قوة التفصيل), He clarifies matters for him, showing him with which eye he saw them. Thus, he knows what they are when he knows the eye with which he saw them from himself. Therefore, this knowledge is emphasized for the People of the Knowledge of Allah (أهل علم الله), yet many of the People of Allah do not pay attention to what we have mentioned. Were it not for his knowledge of his sleep regarding what he sees—that he saw it while asleep—he would not say it was Imagination. How often does one see something similar in the waking state and say that he saw a sensible object with his sense perception?\n\nDo you not see the Prophet, peace and blessings be upon him, in the truthfulness of his vision (رؤياه), that no state occurs to his soul in his body except that it appears to him in a materialized form when he sleeps? Thus, he judges his sensible state based on what he learned from an imagined form. It was said to him concerning ablution (الوضوء) when he slept and snored, yet did not perform ablution and prayed with the ablution upon which he slept: \"My eyes sleep, but my heart does not sleep.\" He means that when he turned to the World of Imagination (عالم الخيال) and saw his form there, having slept in a state of purity (طهارة), he did not see that form commit anything necessitating ablution. Thus, he knew that his sensible body had not been affected by anything that would nullify the ablution upon which he slept. For this reason, we say that sleep is a cause of ritual impurity (حدث), but is not the impurity itself.\n\nWhoever attains this station and possesses this characteristic, and sleeps in a state of purity and sees himself in sleep, let him look at that visible form which is his essence. If he perceives an impurity, that impurity does not stand until it occurs in his sleeping body—meaning, something that nullifies the ablution proceeds from him—either by the very occurrence of that impurity, or it is a form of notification that he has incurred impurity, so he performs ablution when he rises from his sleep. For some impurities in sleep have an effect on the sleeping body, such as nocturnal emission (الاحتلام) at times, or like one who sees himself urinating and then urinates in his bed, waking up to find that what he saw in sleep has occurred in the sensory world. And sometimes he finds no trace of it, and it is merely an alert that he has incurred impurity. This happens to the Gnostics who possess this characteristic. Something similar happened to the blind Shaykh Abu al-Rabi‘ al-Malaqi, the Shaykh of Abu ‘Abdullah al-Qurashi in Egypt. Specifically on Mondays, when he slept, his eyes would sleep, but his heart would not sleep.\n\nThis is a vast field, yet it is not considered valid by the scholars of external forms (علماء الرسوم), nor by the philosophers (الحكماء) who claim to have attained wisdom, but who lack the knowledge of the loftiness of this level (المرتبة) above all other levels, and who hold no value for it. Its worth and the strength of its dominion are known only to Allah, and then to its people: a Prophet or a specially designated Saint (ولي). No one besides these two knows the worth of this level, and the knowledge of it is the first of the stations of Prophethood (النبوة).\n\nFor this reason, when the Messenger of Allah, peace and blessings be upon him, awoke and sat in his gathering among his Companions, he would ask them: \"Has anyone among you seen a vision (رؤيا)?\" This was so that he might see what Allah had originated in the World the previous night, or what He would originate in the future, which He had revealed to this seer in his sleep, either as a clear revelation (وحي صريح) or as a revelation in a form that the seer knows but does not know what is intended by it. The Messenger of Allah, peace and blessings be upon him, would then interpret it according to what Allah intended by it. This shows his, peace and blessings be upon him, attention to this level, which is unknown to the scholars.\n\nHow excellent is Allah’s warning to those of understanding (أولي الألباب) among His servants and the people of reflection, when He said: <<هُوَ الَّذِي يُصَوِّرُكُمْ في الْأَرْحامِ كَيْفَ يَشاءُ>> (It is He Who shapes you in the wombs [الأرحام] however He wills). Among the wombs is that which is Imagination (خيال). In it, He shapes the imagined forms however He wills, through a spiritual marriage and a spiritual pregnancy. Allah opens up meanings in that womb, assembling them in whatever form He wills. Thus, He shows you Islam in it, and the Quran as butter and honey, and a fetter as steadfastness in religion, and religion as a flowing garment, or a short one, or armor, or a coat of mail, or pure, or soiled, depending on the state of the religion of the seer or the one for whom the vision is seen. I saw a vision for the Qadi of Damascus when he assumed the judgeship there—Shams al-Din Ahmad ibn Muhadhdhab al-Din Khalil al-Jawni, may Allah grant him success, guide him with His angels, and protect him in his judgments—where a speaker told him in his sleep: 'Allah has bestowed upon you a pure, flowing garment, so do not soil it or shorten it.' I woke up and mentioned it to him. May Allah make him one of those who preserve the divine counsel.\n\nThus, Imagination is among the wombs in which forms appear. When this Imaginative Presence (الحضرة الخيالية) accepted meanings as forms, Allah said concerning it: <<زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَواتِ من النِّساءِ>> (Beautified for mankind is the love of desires [الشهوات] from women)—meaning, *in* women. So He formed the love into a shape which He beautified for whomever He willed among His servants, and he loved it for its own sake, not for the sake of something else, because the Exalted only beautified for him the love of desire in what He mentioned. Absolute love was beautified for him, then He attached it to desire in what He mentioned, and He also attached it for whomever He willed to desire in another matter. He only mentioned desire because it is a natural form. Imagination is confined by nature, and then Imagination rules over nature, materializing it when it wills.\n\nThis is a branch that rules over its root, because it is a noble branch. Allah has not brought into existence anything greater in rank than it, nor anything whose decree is more pervasive, its ruling extending through all existents and non-existents, whether possible or otherwise. The Divine Power (القدرة الإلهية) has no greater existence among what it brought forth than Imagination. Through it, the Divine Power and Divine Capability appeared, and through it, He <<كَتَبَ عَلى‏ نَفْسِهِ الرَّحْمَةَ>> (decreed Mercy upon Himself) and similar things, making it universally binding. It is the Presence of the Divine Manifestation (المجلى الإلهي) on the Day of Resurrection and in beliefs. Thus, it is the greatest of Allah’s signs concerning Allah.\n\nPart of the strength of its ruling dominion is what the philosophers (الحكماء) affirm, even though they do not know what they are saying and do not give it its due right. This is because Imagination, although it originates from nature, possesses a great dominion over nature due to the divine power with which Allah supports it. If a person wishes to beget a noble child, let him establish in his soul, when uniting with his wife, the image of whomever he wills among the great scholars. If he wishes to confirm this matter, let him visualize it in the form that was conveyed to him or in which the visualizer saw it, and let him mention to his wife the beauty of that form. And when the visualizer visualizes it, let him visualize it in the form of the beauty of his knowledge and character. Even if his sensible form is ugly in appearance, he should only visualize it as beautiful in appearance, commensurate with the beauty of his knowledge and character, as if he is materializing those meanings and presenting that image to his wife and to his own eye during intercourse. They should both immerse themselves in gazing upon its beauty. If the woman conceives from that union, what they imagined of that image in the soul will affect the pregnancy, and the newborn will inevitably emerge with that rank. If the child does not emerge thus, it is due to some matter that occurred in the souls of the parents when the sperm descended into the womb, distracting them from witnessing that image in Imagination without their realizing it. The common people refer to this as the woman's craving (توحم).\n\nIt may happen by chance during intercourse that the image of a dog, a lion, or some animal occurs in the soul of one or both spouses. The child resulting from that union will emerge with the character corresponding to the animal imagined by the parents. Even if they differ, the image imagined by the father and the image imagined by the mother will appear in the child, even in the apparent sensory form, whether in beauty or ugliness.\n\nYet, despite their knowledge of this dominion, they pay no heed to it in acquiring divine sciences, because, due to their ignorance, they aspire to the unattainable: detachment from matter (التجرد عن المواد). This will never happen, neither in this world nor in the Hereafter. This matter—I mean detachment from matter—is conceived intellectually as an illusion (وهم) but not witnessed. There is no greater error for the people of speculation than this, yet they are unaware of their mistake, imagining they are in the attained when they are in the missed. They spend their lives pursuing what they will not attain. For this reason, no intellect is safe from the ruling of illusion, nor is Imagination safe—and it is possibility (إمكان) in the world of angels and spirits. No spirit, nor Gnostic of Allah (عالم بالله), is safe from the possibility that occurs to him in everything he witnesses, because the reality of everything other than Allah is possibility by its very essence, and a thing does not depart from its own decree. Thus, he only sees what he sees, whether eternal or originated, through himself, and possibility accompanies him perpetually. No one perceives this except he who knows the matter as it truly is. He understands detachment intellectually as an illusion, but cannot achieve it in himself, because it is not there. Here, the feet of many have slipped, except for the select People of Allah (أهل الله الخاصة), for they knew this through Allah’s notification.\n\nDo you not see Zachariah, peace be upon him, when he entered the sanctuary (المحراب) where Mary was—a consecrated virgin, and Zachariah knew this—and he saw provision (رزق) that Allah had given her? He then asked Allah to grant him a child, having been captivated by her state. So he said: \"My Lord, grant me from Your Presence (من لدنك)\"—meaning, from Your immediate Presence, a Presence of Mercy, gentleness, and compassion—<<ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعاءِ>> (A good offspring. Indeed, You are the Hearer of supplication). And Mary was in his Imagination in terms of her rank and the distinction Allah granted her through divine providence. <<فَنادَتْهُ الْمَلائِكَةُ وهُوَ قائِمٌ يُصَلِّي في الْمِحْرابِ>> (Then the angels called him while he was standing praying in the sanctuary)—because he entered the sanctuary to her when he found the provision with her—<<أَنَّ الله يُبَشِّرُكَ بِيَحْيى‏ مُصَدِّقاً بِكَلِمَةٍ من الله وسَيِّداً>> (That Allah gives you good tidings of John [Yahya], confirming a Word from Allah, and a master [سيد])—which is perfection, because Mary was perfected, so John was perfected through Prophethood. And <<حَصُوراً>> (Chaste/Restrained)—meaning one whom Allah cut off from physical contact with women, which for us means impotent, just as He cut off Mary from physical contact with men, she being the virgin (البتول). John, peace be upon him, was a 'lover of women' (زير نساء) just as Hannah was Mary's mother, because the Maryam [Mary] who was cut off from men—her name was Hannah, and Maryam was a title given to her due to the description we just mentioned. Look at the effect of Zachariah’s dominion of Imagination (سلطان الخيال) upon his son John, peace be upon him, when Zachariah’s power was poured out into the beauty of Mary’s state, due to the rank Allah granted her. And <<نَبِيًّا من الصَّالِحِينَ>> (A Prophet from the righteous). He never disobeyed Allah at all. This is what all the Prophets sought: that Allah admit them by His Mercy among His righteous servants—those from whom no disobedience, major or minor, ever occurred.\n\nI have never seen anything stranger than the state of Zachariah, peace be upon him, nor anyone in whom the dominion of humanity (سلطان الإنسانية) appeared like him. He is the one who said: <<هَبْ لِي من لَدُنْكَ ذُرِّيَّةً طَيِّبَةً>> (Grant me from Your Presence a good offspring), yet he did not ask until he had imagined the occurrence. Nor did he say: <<رَبِّ أَنَّى يَكُونُ لِي غُلامٌ وقَدْ بَلَغَنِيَ الْكِبَرُ وامْرَأَتِي عاقِرٌ>> (My Lord, how can I have a boy when old age has reached me and my wife is barren)? Where is this state compared to that state? If there was no contextual indication that made him say such a thing, so that it would be said to him in revelation: <<كَذلِكَ الله يَفْعَلُ ما يَشاءُ>> (Thus Allah does what He wills)—then his intention was to inform Allah of this so that others might know that <<إِنَّ الله يَفْعَلُ ما يَشاءُ>> (Indeed, Allah does what He wills) regarding the customary order, which He breaks, as occurred. But if that saying came from himself, then humanity gave him its power. For man, by his essence, is as Allah mentioned him in His Book. There is no place where Allah mentioned him without mentioning, alongside that mention, a quality of deficiency indicating the opposite of what he was created for. Because Allah created man <<في أَحْسَنِ تَقْوِيمٍ>> (in the best of stature), which is that He created him, the Exalted, then returned him to the lowest of the low (أسفل سافلين), so that he might ascend to that for which Allah created him, and thus receive praise for the ascent that appeared from him. Some people remain in the lowest of the low to which he was returned. He was only returned to it because he was created from it; otherwise, his return would not have been valid. By 'the lowest of the low,' I only mean the decree of nature (حكم الطبيعة) from which he originated when Allah established the form of his body and the spirit governing it. He returned him to the origin from which He created him, so he initially looked only at his nature and what benefits his body. Where is this compared to his saying 'Yes' based on sound Gnosis (معرفة صحيحة)?\n\n### That in the Presence of Imagination in this World, the Real is the locus of the servant’s creation\n\nKnow that in the Presence of Imagination (حضرة الخيال) in this world, the Real (الحق) is the locus of the servant’s creation (تكوين). No thought (خاطر) occurs to him concerning any matter except that the Real creates it in this Presence, just as He creates the Fixed Entities (أعيان الممكنات) of the possibles when He wills whatever He wills of them. The servant’s will (مشيئة) in this Presence is from the Will of the Real, for the servant only wills that Allah wills. Thus, the Real only willed that the servant should will in this world. Some of what the servant wills occurs in the sensory world (الحس) in this life. But in Imagination, it is like the Will of the Real in its effectiveness.\n\nThe Real is with the servant in this Presence regarding everything the servant wills, just as He is in the Hereafter in the universality of the decree of the Will, because the inner reality of man is his outer reality in the Hereafter. Therefore, everything is created from his will when he desires it. The Real is subject to man’s disposition (تصريف) in this Presence in this world, and to his desire (شهوة) in the Hereafter, but not sensually in this world. Thus, the Real is subordinate in this Presence and in the Hereafter to the servant’s desire, just as the servant is subordinate in his will to the Will of the Real. The Real has no concern except observing the servant so that He may bring into existence for him everything he wishes to bring into existence in this Presence in this world, and likewise in the Hereafter.\n\nThe servant is subordinate to the Real in the forms of Theophany (التجلي). The Real does not manifest to him in a form except that the servant is colored by it. Thus, he transforms in forms due to the transformation of the Real, and the Real transforms in bringing into existence due to the transformation of the servant’s will, specifically in this Imaginative Presence in this world, and generally in Paradise in the Hereafter.\n\nWhen Allah created aspirations (همم) that are active in sensory existence and aspirations that are inactive in sensory existence, the differentiation in aspirations became apparent, just as differentiation appeared in all things, even in the Divine Names (الأسماء الإلهية). Active aspirations in this world may act upon the aspirations of others, or they may not, such as His saying concerning what does not act: <<إِنَّكَ لا تَهْدِي من أَحْبَبْتَ>> (Indeed, you do not guide whom you love). Some active and receptive aspirations may not be receptive to an active aspiration. Thus, one may wish for another to will a certain matter, but the one desired does not will it, because aspirations confront each other due to their shared genus, and thus may not affect each other. But if an active aspiration relates to something outside its genus, it will inevitably have an effect. As for its own genus—meaning, among aspirations—some may be receptive to it, and some may not.\n\nThis was evident in the Messengers, peace be upon them, and their followers. The Messenger wishes for a person to will Islam, and he wills it and submits. He wishes for another to will Islam, but he does not will it. If the Messenger’s aspiration were attached to moving tongues to bear witness to Unification (التوحيد) without the will of the speaker, it would occur universally, but it would not benefit the speaker, although it would benefit his tongue. For his tongue has never disobeyed Allah in itself. Rather, the transgression occurred in it, not from it, due to the movement of the one who wills its movement. It is compelled, as it was not given the power to defend itself, being one of the soul’s instruments. Thus, it is obedient by its essence. If Allah were to open the hearing of its owner, the essential tongue, when the soul makes it utter what the Law (الشرع) did not intend it to utter, would be astonished. For this reason, we said that the transgression appeared in it due to compulsion, not from it, for it is essentially obedient, a just witness against the one who moves it, as reported: <<يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ بها>> (The Day when their tongues, their hands, and their feet will bear witness against them as to what they used to do with them). And likewise, every instrument that is disposed of: hearing, sight, heart (فؤاد), skin, nerves, private parts, soul (نفس), and movement.\n\n> And people are heedless of what is intended for them,\n> And in blindness concerning what is due to them.\n\nMan is fortunate (سعيد) in terms of his natural origin and in terms of the origin of his rational soul (نفس ناطقة), when each origin is considered separately from the other. But through the combination, transgression (المخالفة) appeared. The very essence of transgression is nothing but obligation (التكليف). When obligation is lifted, the decree of transgression is lifted, and nothing remains but perpetual conformity and continuous obedience of the possible to the Necessary, just as, in reality, even at the time of transgression, he is obedient to the Will (المشيئة), transgressing the command of the intermediary due to the envy (الحسد) inherent in the genus.\n\nIn this station (منزل) are sciences: the knowledge of the Unification of the Real (توحيد الحق) and the verification of those who report about the Real—who are the ambassadors and interpreters, whether human, angel, or thought (خاطر); and the knowledge of the Criterion (الفرقان) through knowing how things are distinguished. This is the universal knowledge of Unification that flows through every single thing in the World. And the knowledge of Divine Unveiling (الكشف الإلهي). In it is the knowledge of procreation (التناسل) that does not cease in this world or the Hereafter. In it is the knowledge of the Presence (الحضرة) where analogy (التشبيه) occurred between things and the sharing of form. In it is the knowledge of what Allah alone possesses of Knowledge, excluding creation, which creation only knows through Allah’s notification. In it is the knowledge of inclination and uprightness. In it is the knowledge of Gathering (الجمع) for the sake of distinction (التفصيل). In it is the knowledge of customs (العوائد)—to what do they return? There is no repetition (تكرار), yet 'return' (الإعادة) is repetition. The matter is problematic, and the cause of its difficulty is the Real’s mention of custom and return. Unveiling grants the non-repetition in the Cosmos (الكون), but not the return in the origination of the Hereafter (نشء الآخرة). For that return is a divine decree concerning a specific matter, like the status of one who left a house and then returned to it: the house is the house, and the one who left is the one who entered. There is only a transition in states, not the appearance of essences, while it is still valid to say that the one who left the house returned to his house. Thus, we know the object of the return.\n\nIn it is the knowledge of differentiation by abode. In it is the knowledge of the descriptions of the People of Allah (أهل الله). In it is the knowledge of what the Real and the Gnostic of Allah (العالم بالله) share—and there is nothing but a Gnostic of Allah. However, among the Gnostics, some know that they are Gnostics of Allah, and some people do not know that they are Gnostics of Allah, even though they have knowledge of the one they witness and observe, but they do not know that He is the Real (الحق). If you asked him, 'Do you know Allah?' he would say, 'No.' If you asked him concerning what he witnessed, 'Do you know this that you witnessed, in terms of its being witnessed by you?' he would say, 'Yes.' He is asked, 'Then who is He?' He says, 'This one whom I witness.' He is asked, 'Then who is He?' He says, 'I do not know.' Then if it is said to him, 'He is such-and-such,' meaning, He is so-and-so by the Name he knows Him by, he still has not known that this witnessed object is the referent of that Name. All he was ignorant of was applying this Name to this witnessed object. He was already characterized by the knowledge of the Name and characterized by the knowledge of the witnessed object in terms of its being witnessed by him. All he gained was the fact that this witnessed object is the referent of that known Name.\n\nIn it is the knowledge of the submission of creation (الخلق) to the Real, and that this is a result of the submission of the Real to creation, due to the demand of the necessary possible. The Necessary submitted to it in what it demanded, and brought it into existence when it was nothing. In it is the knowledge of the cause of the disagreement (الاختلاف) occurring in the World, along with the knowledge of what necessitates the removal of disagreement. So, what decreed against Knowledge (العلم) despite the strength of its dominion? In it is the knowledge of delusion (الاغترار) and the cause that manifested it. In it is the knowledge of what action (العمل) and acquisition (الكسب) are, and the difference between *al-kasb* and *al-iktisab*, because Allah distinguished *al-kasb* from *al-iktisab* using the prepositions *la* (for) and *‘alayha* (against), saying: <<لَها ما كَسَبَتْ وعَلَيْها ما اكْتَسَبَتْ>> (For it is what it earned [kasabat], and against it is what it acquired [iktasabat]).\n\nIn it is the knowledge of Divine Choice (الاختيار الإلهي). In it is the knowledge of when one relies upon the opposite, so that the opposite becomes a mercy for its opposite, even though it is naturally its enemy. In it is the knowledge of the prohibition against delving into Allah. In it is the knowledge of the encompassing of deeds (الأعمال)—an encompassing of witnessing, not an encompassing of embodiment—and in which treasury they are stored until the time of their witnessing, and what their decree is after their witnessing, both in themselves and in what returns from them to the one who performed them. In it is the knowledge of the Presence (الحضرة) that transforms realities (الحقائق) but does not transform itself, though it is one of the realities. In it is the knowledge of correspondences (المناسبات). In it is the knowledge of what is referred to for judgment, which is not characterized by speech, yet still has the final say in certain matters, such as drawing lots (الاقتراع) and similar things.\n\nIn it is the knowledge of the goal that the Messengers seek from Allah in this abode. In it is the knowledge of Divine Vicegerency (النيابة الإلهية) in creation (التكوين). In it is a strange knowledge related to Love (المحبة): asceticism (الزهد) toward the Beloved for the sake of the Beloved, while still being characterized by love for the object of asceticism, and that description remaining upon him. In it is the knowledge of adherence (الاعتصام). In it is the knowledge of White and Black (البياض والسواد); some of the People of the Path have a treatise on it which they named *The White and the Black*. In it is the knowledge of the superiority of some nations over others, and the superiority of this Muhammadan Nation (الأمة المحمدية) over all other nations. And is there anyone from the Nation of Muhammad, peace and blessings be upon him, who existed before his mission, saw him in his Unveiling (كشف), believed in him, and followed him to the extent of what was unveiled to him? Will one who possesses this characteristic be resurrected within his Nation, or will he be resurrected as a nation unto himself? Or was the possessor of this Unveiling a follower of the Law (شرع) of a specific Prophet, such as Jesus or Moses or any of the Messengers, peace be upon them, and saw through witnessing that the Law brought by that specific Prophet whom he followed was a deputization (نائب) for Muhammad, peace and blessings be upon him, and that it was Muhammad’s Law? So he followed it on the basis that it was the Law of Muhammad, peace and blessings be upon him, and that the Messenger was merely conveying from Muhammad what appeared of the Law. Will such a person be resurrected within the Nation of Muhammad, peace and blessings be upon him, or will he belong to the nation of that Prophet? Furthermore, if it happens that he is resurrected within the nation of that Messenger, and then enters Paradise and attains his rank, will he attain it within the stations of this Muhammadan Nation, or will he only descend into the stations of the followers and nation of that Messenger? Or will he have stations within the ranks of that Messenger and his nation, by virtue of his being a follower, and also have stations with the Muhammadan Nation, by virtue of his following him through the Unveiling we mentioned earlier?\n\nIn it is the knowledge of Companionship (الصحبة): who accompanies you by description, who accompanies you by face, who accompanies you for your sake, who accompanies you for his own sake, who accompanies you for Allah’s sake, who is most worthy of companionship, who accompanies Allah, and who has the station to accompany but does not accompany anyone, and the difference between *al-suhba* (companionship) and *al-musahaba* (mutual companionship). In it is the knowledge of the Stations (المقامات) and the States (الأحوال). In it is the knowledge of 'Excellent is...' (نعم) and 'Wretched is...' (بئس). In it is the knowledge of recompense in this world. In it is the knowledge of the Gnostic’s characterization by benefit in that of which he is knowledgeable. In it is the knowledge of the categories of the Near Ones (المقربين) and their degrees of nearness from every nation. In it is the knowledge of who wills Allah and who wills other than Allah, and what the object of the Will is, and whether one who says he wills Allah is truthful or not. In it is the knowledge of ambiguity in death, and of one who is characterized by two opposites. In it is the knowledge of gradual enticement (الاستدراج). In it is the knowledge of the attributes that the Real accepts but which should not be ascribed to Him, because they are considered attributes of deficiency in the Divine Presence according to custom and Law, yet they are honor and elevation in the originated being. In it is the knowledge of various branches of sciences. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (Speaks the Truth, and He guides to the Way).",
    "ur": "## باب تین سو اکیاسی: توحید اور جمع کی منزل کی معرفت میں\n\nیہ پانچ ہزار رفرفی مقامات پر مشتمل ہے، اور یہ الحضرة المحمدية (الحضرة المحمدية) سے ہے، اور اس کے کامل ترین مشاہدات وہ ہیں جن کا شہود (الشہود) کرنے والا اسے نصف مہینے یا اس کے آخر میں دیکھتا ہے۔\n\n> اے مریم بنت عمران، جس نے روح کے لیے ایک معزز بستر بنایا، وہ روح جو ہر روح سے جلیل ہے،\n> اس نے خود کو محفوظ کیا تو روح اس کے پاس آئی، اسے سات آسمانوں کے اوپر سے لوح سے عطا کرنے کے لیے۔\n> اس نے اسے ایک اعلیٰ، شرف بخشنے والا تحفہ دیا، جو ہم میں یوح کی چمک سے زیادہ روشن اور تابناک ہے۔\n> وہ زندہ کرتی ہے اور اس کے پاس کوئی تلوار نہیں جس سے وہ مارے، جب اسے پکارا جاتا ہے تو اسے لطف کے ساتھ روح کہہ کر پکارا جاتا ہے۔\n\n### [عالم العماء]\n\nاس تحفے سے ہماری مراد عیسیٰ روح اللہ ہیں، جیسا کہ جبریل کا مریم سے یہ قول ہے: لِأَهَبَ لَكِ غُلاماً زَكِيًّا (تاکہ میں تجھے ایک پاکیزہ لڑکا عطا کروں) [مریم: ۱۹]۔\n\nحدیث میں آیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا کہ مخلوق کو پیدا کرنے سے پہلے ہمارا رب کہاں تھا؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"وہ عماء (ایک بادل) میں تھا، جس کے اوپر ہوا نہیں تھی اور جس کے نیچے ہوا نہیں تھی۔\"\n\nہم نے پہلے عماء کی حدیث کا ذکر کیا ہے اور یہ کہ اس میں عالم کی صورتیں منکشف ہوئیں، اور جس پر دلیل قائم ہے وہ یہ ہے کہ ذات حق (الحق) کے سوا ہر شے حادث ہے، وہ نہیں تھی پھر ہو گئی، لہٰذا دلیل اس بات کی نفی کرتی ہے کہ ذات حق (الحق) کے سوا کوئی شے واجب الوجود لذاتہ کی ہستی (الوجود) میں شامل ہو۔ پس ایجاد کا دوام اللہ تعالیٰ کے لیے ہے اور ممکنات کے لیے انفعال کا دوام ہے، اور ممکنات ہی عالم ہیں۔ پس تخلیق ہمیشہ جاری رہتی ہے اور اعیان (Essences) ہمیشہ ظاہر ہوتے رہتے ہیں۔ اور خلا (Void) کا پھیلاؤ ہمیشہ لامتناہی رہتا ہے، کیونکہ ممکنات کے اعیان لامتناہی طور پر وجود میں آتے ہیں، اور ان کے اعیان صرف خلا کو ہی آباد کرتے ہیں۔ اور ہمارا یہ قول کہ عالم نے خلا کے سوا کسی چیز کو آباد نہیں کیا، اس سے ہماری مراد یہ ہے کہ وہ ملا (Plenum) کو آباد نہیں کر سکتا، کیونکہ ملا خود آباد ہے۔ پس وہ ملا میں آباد نہیں ہوتا، اور وہاں ہمیشہ ملا یا خلا ہی ہوتا ہے، جو عالم کے لیے ہمیشہ تجدید کا باعث ہے۔ آخرت کی کوئی انتہا نہیں ہے۔ اگر ہم نہ ہوتے تو دنیا اور آخرت کا نام نہ لیا جاتا، بلکہ صرف یہ کہا جاتا کہ ممکنات وجود میں آئے اور آتے رہیں گے، جیسا کہ حقیقت ہے۔ پس جب ہم نے، جو مخلوق ممکنات ہیں، اپنے اعیان کے ظاہر ہونے کے وقت سے ایک مقررہ مدت تک مخصوص مقامات کو آباد کیا، اور ہم عالم کی صورتوں میں سے ایک صورت ہیں، تو ہم نے اس مقام کو دارِ دنیا یعنی قریب کی جگہ کا نام دیا جسے ہم نے اپنے اعیان کے پہلے وجود میں آباد کیا۔ عالم تو موجود تھا لیکن ہم نہیں تھے۔ اس کے باوجود اللہ تعالیٰ نے ہمارے لیے دارِ دنیا کی آبادی میں ایسی مدتیں مقرر کیں جن پر ہم ختم ہو جائیں گے، پھر ہم ایک دوسرے مقام کی طرف منتقل ہوں گے جسے آخرت کہا جاتا ہے، جس میں وہی کچھ ہے جو اس دارِ دنیا میں ہے، لیکن وہ دار کے لحاظ سے ممتاز ہے، جیسا کہ یہاں حال کے لحاظ سے ممتاز ہے۔ اور اللہ نے اس دارِ آخرت میں ہمارے قیام کے لیے کوئی ایسی مدت مقرر نہیں کی جو ہمارے قیام کی انتہا ہو، اور اس دار کو ہمیشہ ہمیشہ کے لیے، لامتناہی طور پر، تخلیق کا مقام بنا دیا۔ اور دارِ دنیا پر صفت بدل دی گئی، پس اس تبدیلی سے وہ آخرت بن گئی، جبکہ عین (حقیقت) باقی ہے۔ اور وہ شخص جو اللہ کی طرف سے امور کا علم نہیں رکھتا، وہ حیرت میں رہا۔ پس حقیقت میں، اللہ کے عالموں کے حق میں کوئی حیرت نہیں ہے، اور عالم کی نسبت اللہ کی طرف ہے۔ پس علماء ہمیشہ خوشی میں رہتے ہیں، اور ان کے علاوہ لوگ دنیا اور آخرت میں حیرت کے اندھیروں میں بھٹکتے رہتے ہیں۔ اگر سانسوں کے ساتھ خلق کی تجدید نہ ہوتی تو اعیان میں اکتاہٹ (ملال) پیدا ہو جاتی، کیونکہ طبیعت اکتاہٹ کا تقاضا کرتی ہے، اور یہی تقاضا ہے جس نے اعیان کی تجدید کا حکم دیا۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کی طرف سے فرمایا: \"بے شک اللہ نہیں اکتاتا یہاں تک کہ تم اکتا جاؤ۔\"\n\nعالم کی اکتاہٹ ہی ذات حق (الحق) کی اکتاہٹ ہے، اور عالم سے وہی نہیں اکتاتا جسے کشف (الکشف) حاصل نہیں ہوتا، اور جو سانسوں کے ساتھ عالم کی دائمی تجدید کا شہود (الشہود) نہیں کرتا، اور جو اللہ کو ہمیشہ خالق کے طور پر نہیں دیکھتا۔ اکتاہٹ صرف استصحاب (تسلسل) سے واقع ہوتی ہے۔ اگر تم کہو کہ خلق کی تجدید کا دوام بھی استصحاب ہے، اور استصحاب کے باوجود اکتاہٹ واقع نہیں ہوئی، تو ہم کہیں گے کہ ذاتی احکام میں تبدیلی ممکن نہیں ہے۔ اور خالق اپنی ذات کے لیے خلق کرتا ہے، اور عالم اپنی ذات کے لیے منفعل ہوتا ہے، لہٰذا اکتاہٹ کا وجود درست نہیں ہے۔ نئے انعام میں پلٹنا اس شخص کے لیے اکتاہٹ کا تقاضا نہیں کرتا جو اس میں پلٹ رہا ہے کیونکہ یہ اس چیز کا شہود (الشہود) ہے جس کا پہلے شہود (الشہود) نہیں کیا گیا، خوشی، مسرت اور شادمانی کے ساتھ۔ اسی لیے اللہ تعالیٰ نے فرمایا: ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ (اور میری رحمت ہر چیز پر محیط ہے) [الأعراف: ۱۵۶] جو موجود ہے اور لامتناہی طور پر موجود ہوتا رہے گا۔ کیونکہ رحمت ایک حکم ہے، عین (حقیقت) نہیں ہے۔ اگر وہ وجودی عین ہوتی تو ختم ہو جاتی اور اس میں لامتناہی چیزوں کے حصول کے لیے تنگ پڑ جاتی۔ بلکہ یہ ایک حکم ہے جو موجودات میں رحمن و رحیم کی طرف سے موجودات کے اعیان کے ظہور کے ساتھ پیدا ہوتا ہے۔ اور الرَّاسِخُونَ في الْعِلْمِ (علم میں پختہ لوگ) یعنی اللہ کی معرفت (المعرفة) کے علم میں، يَقُولُونَ آمَنَّا به كُلٌّ من عِنْدِ رَبِّنا (وہ کہتے ہیں کہ ہم اس پر ایمان لائے، سب کچھ ہمارے رب کی طرف سے ہے) [آل عمران: ۷]، رحمت اور مرحوم دونوں۔ وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ (اور نصیحت صرف عقل والے ہی حاصل کرتے ہیں) [آل عمران: ۷]، اور وہ غوطہ خور ہیں جو امور کے مغز کو عینی شہود (الشہود) تک نکال لاتے ہیں، بعد اس کے کہ اس مغز کو ظاہری چھلکا چھپائے ہوئے تھا جس سے اس کی حفاظت ہوتی تھی۔ اور یہ نو ہزار مقامات پر مشتمل ہے، جیسا کہ اہل کشف (الکشف) اور ہستی (الوجود) کی طرف سے خبر دی گئی ہے۔ ان میں سے ایک ہزار مقامات ایک خاص گروہ کے لیے ہیں، اور تین ہزار مقامات دوسرے گروہ کے لیے، اور پانچ ہزار مقامات تیسرے گروہ کے لیے ہیں۔ سب سے بلند گروہ وہ ہے جس کے لیے ایک ہزار مقام ہیں، اور رفعت میں اس کے بعد وہ گروہ ہے جس کے لیے تین ہزار مقامات ہیں، اور اس کے بعد وہ گروہ ہے جس کے لیے پانچ ہزار مقامات ہیں۔ اور سب سے اعلیٰ گروہ وہ ہے جس کا کوئی مقام نہیں، اور یہ اس لیے کہ مقامات ان پر حاکم ہوتے ہیں جو ان میں ہوتے ہیں۔ اور بلاشبہ سب سے اعلیٰ گروہ وہ ہے جس کے لیے حکم ہے نہ کہ وہ جس پر حکم کیا جائے، اور وہ الٰہیون ہیں، کیونکہ ذات حق (الحق) ان کا عین ہے، اور وہ احکم الحاکمین ہے۔ اور یہ کسی بھی انسان کے لیے نہیں ہے سوائے محمدیوں کے خاص طور پر، یہ ایک الٰہی عنایت ہے جو ان کے لیے سبقت لے گئی، جیسا کہ اللہ تعالیٰ نے ان کی مثال میں فرمایا: إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ (بے شک وہ لوگ جن کے لیے ہماری طرف سے بھلائی سبقت لے گئی، وہ اس سے دور رکھے گئے ہیں) [الأنبياء: ۱۰۱]، یعنی آگ سے، کیونکہ آگ ان مقامات میں سے ایک ہے۔ پس وہ حقیقت میں مقامات سے دور رکھے گئے ہیں۔ پس مقامات والے وہ ہیں جن کی ہمتیں غایات اور انتہاؤں تک محدود ہو چکی ہیں، پس جب وہ ان غایات تک پہنچتے ہیں تو ان کے دلوں میں دوسری غایات پیدا ہو جاتی ہیں، اور وہ غایات جن تک وہ پہنچے تھے، ان کے لیے ان دوسری غایات کی طرف ابتدائی منزلیں بن جاتی ہیں، پس وہ غایات ان پر ان کے طلب کرنے کا حکم لگاتی ہیں، اور یہ معاملہ ان کے لیے ہمیشہ جاری رہتا ہے۔ اور محمدی کے لیے یہ حکم اور یہ تحدید نہیں ہے، پس اس کی وسعت ذات حق (الحق) کی وسعت ہے، اور ذات حق (الحق) کے لیے اپنی ذات میں کوئی ایسی غایت نہیں ہے جس پر اس کا وجود ختم ہو جائے، اور ذات حق (الحق) محمدی کا مشہود (الشہود) ہے، لہٰذا اس کے شہود (الشہود) میں کوئی غایت نہیں ہے۔ اور محمدی کے سوا ہر کوئی اپنے مقام کا مشاہدہ کرنے والا ہے، پس کوئی حال یا مقام ایسا نہیں ہے جس میں وہ قائم ہو، مگر اس کے نزدیک اس کا ختم ہونا اور حال کا بدل جانا یا اس کا معدوم ہو جانا جائز ہے۔ اور وہ دیکھتا ہے کہ یہ اللہ کی معرفت (المعرفة) کی انتہا میں سے ہے، جہاں اس نے اپنے نفس اور اپنے رب کے لحاظ سے حکم میں اس کا حق پورا کیا۔ اور عیسیٰ علیہ السلام محمدی ہیں، اور اسی لیے وہ آخر زمانے میں نازل ہوں گے، اور ان کے ذریعے اللہ ولایت کبریٰ کو ختم کرے گا، اور وہ روح اللہ اور اس کا کلمہ ہیں، اور ذات حق (الحق) کے کلمات ختم نہیں ہوتے۔ پس محمدی کے دل میں کوئی ایسی غایت نہیں ہے جس پر وہ ختم ہو۔\n\n### [مقامات کا ادراک صرف آنکھِ خیال سے ہوتا ہے]\n\nپس جان لو کہ یہ مذکورہ مقامات جب مشاہدہ کیے جاتے ہیں تو صرف آنکھِ خیال (Imagination) سے ہی ادراک کیے جاتے ہیں۔ کیونکہ جب اللہ ان کی صورتوں کو جس طرح چاہتا ہے، خیالی صورت میں ظاہر کرتا ہے، تو تم انہیں آنکھ کے سامنے اشخاص کی طرح دیکھتے ہو، جیسے تم محسوسات کو آنکھ سے دیکھتے ہو، اور جیسے تم معانی کو بصیرت کی آنکھ سے دیکھتے ہو۔ پس جب اللہ کثیر کو کم کر دیتا ہے، حالانکہ وہ حقیقت میں کثیر ہوتا ہے، یا قلیل کو زیادہ کر دیتا ہے، حالانکہ وہ حقیقت میں قلیل ہوتا ہے، تو تم اسے صرف آنکھِ خیال سے دیکھتے ہو نہ کہ آنکھِ حس سے، حالانکہ دونوں حالتوں میں وہ خود بصارت ہی ہوتی ہے۔ جیسا کہ اللہ تعالیٰ نے فرمایا: وإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ في أَعْيُنِكُمْ قَلِيلًا ويُقَلِّلُكُمْ في أَعْيُنِهِمْ (اور جب تم آپس میں ملے تو اس نے انہیں تمہاری آنکھوں میں کم دکھایا اور تمہیں ان کی آنکھوں میں کم دکھایا) [الأنفال: ۴۴]۔ اور فرمایا: يَرَوْنَهُمْ مِثْلَيْهِمْ رَأْيَ الْعَيْنِ (وہ انہیں اپنی آنکھوں سے دو گنا دیکھتے تھے) [آل عمران: ۱۳]، حالانکہ وہ حس میں دو گنا نہیں تھے۔ اگر تم انہیں آنکھِ خیال سے نہ دیکھتے تو جو تعداد تم نے دیکھی وہ جھوٹ ہوتی، اور دکھانے والا اس میں سچا نہ ہوتا جو اس نے تمہیں دکھایا۔ اور جب دکھانے والے نے تمہیں وہ چیز آنکھِ خیال سے دکھائی، تو قلیل میں کثرت حق تھی اور کثرت میں قلت حق تھی، کیونکہ وہ خیال میں حق ہے، حس میں حق نہیں ہے۔ جیسا کہ اس نے تمہیں خیال میں دودھ دکھایا اور تم نے اسے پی لیا، حالانکہ وہ دودھ علم کے عین کے سوا کچھ نہیں تھا۔ پس تم نے اسے دودھ کی صورت میں، حالانکہ وہ علم تھا، صرف آنکھِ خیال سے دیکھا۔ اور تم نے اس علم کی تلقین کو، جس سے تم نے اسے حاصل کیا، دودھ پینے کی صورت میں دیکھا، یہ بھی آنکھِ خیال میں ہوا۔ حالانکہ علم دودھ نہیں ہے اور تلقین پینا نہیں ہے، لیکن تم نے اسے اسی طرح دیکھا۔ اگر تم اسے آنکھِ حس سے دیکھتے تو یہ جھوٹ ہوتا، کیونکہ تم نے معاملہ کو اس کی اصل حقیقت کے خلاف دیکھا۔ پس تم نے اسے صرف بیداری کی حالت میں آنکھِ خیال سے دیکھا، اگرچہ تمہیں اس کا شعور نہ ہو۔ پس حقیقت میں بھی ایسا ہی ہے، کیونکہ اللہ اس چیز میں سچا ہے جو وہ جانتا ہے، اور وہ خیال میں سچ ہے جیسا کہ تم نے اسے دیکھا۔ اسی طرح اللہ کی طرف سے ہاتھ کی ضرب سے علوم کا حاصل کرنا۔ پس اس ضرب سے حاصل ہونے والا علم، اولین و آخرین کا علم ہے۔ اور علم یا تو معلم کی طرف سے خطاب کے ذریعے تعلیم سے حاصل ہوتا ہے، یا نفس میں ضرورت پیدا کرنے سے۔ اور یہاں خیال کی حضور میں ضرب سے حاصل ہوا، لہٰذا ضروری ہے کہ ضرب بھی خیالی ہو اور جس پر ضرب لگائی گئی وہ بھی اپنی عین میں خیالی ہو، خواہ وہ نیند میں ہو یا بیداری میں، تاکہ دیکھنے والے کی سچائی ثابت ہو، اور وہ اللہ ہے۔ جیسا کہ اللہ تعالیٰ نے فرمایا: يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏ (ان کے جادو کے اثر سے اسے خیال ہوتا تھا کہ وہ دوڑ رہے ہیں) [طٰہٰ: ۶۶]، حالانکہ وہ حقیقت میں نہیں دوڑ رہے تھے۔ اسی طرح ہر وہ چیز جسے تم اس کی اصل حقیقت کے خلاف دیکھتے ہو، تم اسے صرف آنکھِ خیال سے دیکھتے ہو تاکہ وہ سچ ہو۔ اسی لیے اس طرح واقع ہونے والی ہر چیز کی تعبیر کی جاتی ہے، یعنی تعبیر کرنے والا اس کے ذریعے اس معنی تک پہنچتا ہے جو اللہ نے اس صورت سے مراد لیا ہے۔ پس تم اس علم سے غافل نہ ہو، اور آنکھوں کے درمیان فرق کرو۔ اور جان لو کہ تم اس پر قادر نہیں ہو سکتے مگر ایک الٰہی قوت کے ذریعے جو اللہ اپنے بندوں میں سے جسے چاہتا ہے عطا کرتا ہے۔ پس تم اللہ سے اس کے حصول کی کوشش کرو۔ کیونکہ تمہیں اس چیز کی خبر دی جاتی ہے جسے تم نے اپنی حس سے دیکھا، حالانکہ معاملہ ایسا نہیں تھا۔ پس جو کچھ تم دیکھتے ہو اس کی تعبیر میں احتیاط کرو، جیسا کہ مصنف کرتا ہے۔ کیا تم نہیں دیکھتے کہ اگر صحابہ کرام صحیح نظر کا حق ادا کرتے اور مراتب کو ان کا حق دیتے تو وہ جبریل علیہ السلام کے بارے میں یہ نہ کہتے کہ وہ دحیہ کلبی ہیں، بلکہ وہ کہتے کہ اگر وہ روحانی نہیں ہیں جو مجسم ہوئے ہیں، تو وہ دحیہ کلبی ہیں جنہیں ہم نے حسی آنکھ سے دیکھا ہے۔ پس انہوں نے احتیاط نہیں کی اور الٰہی امر کو اس کا حق نہیں دیا، حالانکہ وہ سچے تھے جنہوں نے سچ نہیں کہا۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: \"وہ جبریل تھے۔\" تب انہوں نے جانا کہ انہوں نے کیا دیکھا اور کس چیز سے دیکھا، جیسا کہ انہوں نے اس وقت کہا جب وہ ان کے سامنے ایک ایسے اعرابی کی صورت میں آئے جسے وہ نہیں جانتے تھے، جب وہ لوگوں کو ان کا دین سکھانے آئے تھے۔\n\nتو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"کیا تم جانتے ہو کہ سوال کرنے والا کون تھا؟\" انہوں نے کہا: \"اللہ اور اس کا رسول بہتر جانتے ہیں۔\" کیونکہ وہ ان کے سامنے ایک نامعلوم صورت میں ظاہر ہوئے تھے۔ تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا: \"یہ جبریل تھے۔\"\n\nپس اگر یہ حدیث دحیہ والی حدیث کے بعد کی ہے، تو ان کا قول \"اللہ اور اس کا رسول بہتر جانتے ہیں\" اس بات کا احتمال رکھتا ہے کہ ان کی مراد معنی کا احتمال یا روحانی صورت تھی، یا یہ کہ وہ حقیقت میں انسان تھے۔ اور اگر یہ حدیث پہلے کی ہے، تو انہوں نے یہ نہیں جانا کہ وہ انسان ہے، بلکہ وہ اس کا نام اور عرب کے قبائل میں اس کا نسب نہیں جانتے تھے۔ دیکھنے والا یہ نہیں جانتا کہ اس نے جو ادراک کیا ہے وہ آنکھِ خیال سے کیا ہے، جب تک کہ وہ یہ نہ جان لے کہ مدرک کیا ہے۔ اور کائنات میں حس کے ساتھ خیال کے التباس سے بڑھ کر کوئی بڑا شبہ نہیں ہے۔ کیونکہ اگر انسان اس نظر میں پختہ ہو جائے تو وہ ضروری علوم میں شک کرنے لگتا ہے، اور اگر وہ اس میں پختہ نہ ہو تو بعض امور کو ان کے مقام سے ہٹا دیتا ہے۔ پس جب اللہ اسے تفصیل کی قوت عطا کرتا ہے تو وہ امور کو واضح کر دیتا ہے کہ جب اس نے انہیں دیکھا تو کس آنکھ سے دیکھا، پس وہ جان لیتا ہے کہ وہ کیا ہیں، جب وہ اس آنکھ کو جان لیتا ہے جس سے اس نے انہیں اپنے نفس سے دیکھا۔ پس اللہ کے علم والوں پر اس علم کی تاکید کی گئی ہے۔ اور اللہ کے بہت سے اہل ایسے ہیں جو اس بات پر توجہ نہیں دیتے جس کا ہم نے ذکر کیا ہے۔ اگر وہ اپنی نیند کے بارے میں یہ نہ جانتے کہ جو کچھ انہوں نے دیکھا وہ نیند کی حالت میں دیکھا ہے، تو وہ اسے خیال نہ کہتے۔ پس کتنی ہی چیزیں وہ بیداری کی حالت میں دیکھتے ہیں اور کہتے ہیں کہ انہوں نے اسے اپنی حس سے محسوس کیا ہے۔ کیا تم رسول اللہ صلی اللہ علیہ وسلم کو نہیں دیکھتے کہ ان کے خواب کی سچائی میں، ان کے جسم پر جو بھی حال گزرتا ہے، وہ انہیں ایک مجسم صورت میں ظاہر ہوتا ہے جب وہ سوتے ہیں؟ پس وہ اپنے محسوس پر اس چیز کا حکم لگاتا ہے جو اس نے خیالی صورت سے جانی۔ پس جب وہ سوئے اور خراٹے لیے تو وضو کے بارے میں ان سے کہا گیا، لیکن انہوں نے وضو نہیں کیا اور اسی وضو سے نماز پڑھی جس پر وہ سوئے تھے، (اور فرمایا) \"میری آنکھیں سوتی ہیں لیکن میرا دل نہیں سوتا۔\" آپ کا مطلب یہ ہے کہ جب آپ عالمِ خیال کی طرف پلٹے اور اپنی صورت کو وہاں دیکھا، اور آپ طہارت پر سوئے تھے، تو آپ نے نہیں دیکھا کہ اس صورت نے کوئی ایسی چیز پیدا کی ہو جو وضو کو واجب کرتی ہو۔ پس آپ نے جان لیا کہ آپ کے محسوس جسم پر کوئی ایسی چیز طاری نہیں ہوئی جس سے وہ وضو ٹوٹ جائے جس پر آپ سوئے تھے۔ اسی لیے ہم کہتے ہیں کہ نیند حدث کا سبب ہے، لیکن خود حدث نہیں ہے۔ پس جسے یہ مقام حاصل ہو اور وہ اس صفت پر ہو، اور طہارت پر سوئے اور خواب میں اپنے آپ کو دیکھے، تو اسے اس مرئی صورت کو دیکھنا چاہیے جو اس کا عین ہے۔ اگر وہ کسی حدث کو محسوس کرے، تو اس صورت میں حدث قائم نہیں ہوتا جب تک کہ اس کے سوئے ہوئے جسم سے حدث نہ ہو، یعنی اس سے کوئی ایسی چیز نہ نکلے جو وضو کو توڑ دے، یا تو اس حدث کے عین سے، یا یہ کہ وہ ایک تعریفی صورت ہو کہ اس نے حدث کیا ہے، تو وہ اٹھ کر وضو کرے۔ کیونکہ نیند میں بعض ایسے احداث ہوتے ہیں جن کا اثر سوئے ہوئے جسم پر ہوتا ہے، جیسے بعض اوقات احتلام ہونا، اور جیسے کوئی دیکھے کہ وہ پیشاب کر رہا ہے اور وہ اپنے بستر پر پیشاب کر دے، پھر بیدار ہو تو حس میں پائے کہ جو اس نے خواب میں دیکھا تھا وہ واقع ہو گیا ہے۔ اور بعض اوقات اس کا کوئی اثر نہیں پاتا، تو یہ اس کے لیے تنبیہ ہوتی ہے کہ اس نے حدث کیا ہے۔ یہ چیز ان علماء پر طاری ہوتی ہے جو اس صفت کے حامل ہیں۔ اور ایسا ہی شیخ ضریر ابو الربیع المالقی، جو مصر میں ابو عبد اللہ القرشی کے شیخ تھے، کے ساتھ ہوتا تھا۔ خاص طور پر پیر کے دن جب وہ سوتے تھے تو ان کی آنکھیں سوتی تھیں لیکن ان کا دل نہیں سوتا تھا۔ یہ ایک وسیع میدان ہے، اور یہ علماءِ رسوم کے نزدیک قابلِ اعتبار نہیں ہے، اور نہ ہی ان حکماء کے نزدیک جو یہ دعویٰ کرتے ہیں کہ انہوں نے حکمت جان لی ہے، حالانکہ انہیں اس مرتبے کی دیگر مراتب پر بلندی کا علم حاصل نہیں ہوا۔ اور ان کے نزدیک اس کی کوئی قدر نہیں ہے۔ پس اس کی قدر اور اس کے سلطان کی قوت کو اللہ کے سوا کوئی نہیں جانتا، پھر اس کے اہل، یعنی نبی یا خاص ولی۔ ان دونوں کے علاوہ کوئی اس مرتبے کی قدر نہیں جانتا۔ اور اس کا علم نبوت کے مقامات میں سے پہلا ہے۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم جب صبح کرتے اور اپنے صحابہ کے درمیان اپنی مجلس میں بیٹھتے تو ان سے فرماتے: \"کیا تم میں سے کسی نے کوئی خواب دیکھا ہے؟\"\n\nاور یہ اس لیے تھا تاکہ آپ دیکھیں کہ اللہ نے گزشتہ رات عالم میں کیا نیا پیدا کیا ہے یا مستقبل میں کیا پیدا کرے گا، اور اس خواب دیکھنے والے کو اس کے خواب میں اس کی وحی کی گئی ہے، یا تو صریح وحی کی صورت میں یا ایسی صورت میں وحی جو دیکھنے والا جانتا ہے لیکن یہ نہیں جانتا کہ اس سے کیا مراد ہے، تو رسول اللہ صلی اللہ علیہ وسلم اس کی تعبیر کرتے تھے جو اللہ نے اس سے مراد لیا تھا۔ پس یہ آپ صلی اللہ علیہ وسلم کی اس مرتبے پر توجہ کی وجہ سے تھا جو علماء کے نزدیک نامعلوم ہے۔ اور اللہ نے اپنے بندوں میں سے عقل والوں اور عبرت حاصل کرنے والوں کو کیا خوب تنبیہ کی ہے، جب اس نے فرمایا: هُوَ الَّذِي يُصَوِّرُكُمْ في الْأَرْحامِ كَيْفَ يَشاءُ (وہی ہے جو تمہاری صورتیں رحموں میں بناتا ہے جیسے چاہتا ہے) [آل عمران: ۶]۔ پس رحموں میں سے کچھ خیال (Imagination) ہوتے ہیں، جس میں وہ خیالی صورتوں کو جیسے چاہتا ہے، معنوی نکاح اور معنوی حمل کے ذریعے بناتا ہے۔ اللہ اس رحم میں معانی کو کھولتا ہے اور انہیں جس صورت میں چاہتا ہے، ترتیب دیتا ہے۔ پس وہ تمہیں اس میں اسلام کو گھی اور شہد کی صورت میں دکھاتا ہے، اور قید کو دین میں ثابت قدمی، اور دین کو ایک لمبا اور چھوٹا قمیص، زرہ، اور پاکیزہ یا گندا، دیکھنے والے یا جس کے لیے دیکھا جا رہا ہے، کے دین کی حالت کے مطابق دکھاتا ہے۔ اور میں نے قاضی دمشق کے لیے، جب وہ دمشق کے قاضی بنے، اور وہ شمس الدین احمد بن مہذب الدین خلیل الجونی تھے، اللہ انہیں توفیق دے، اپنے فرشتوں کے ذریعے ان کی رہنمائی کرے اور ان کے احکام میں انہیں محفوظ رکھے، خواب میں ایک کہنے والے کو یہ کہتے ہوئے دیکھا کہ \"اللہ نے تجھے ایک پاکیزہ، لمبا لباس پہنایا ہے، پس اسے گندا نہ کرنا اور نہ ہی اسے چھوٹا کرنا۔\" اور میں بیدار ہوا اور انہیں یہ بات بتائی۔ پس اللہ انہیں ان لوگوں میں شامل کرے جنہوں نے الٰہی وصیت کو محفوظ رکھا۔ پس خیال (Imagination) ان رحموں میں سے ہے جن میں صورتیں ظاہر ہوتی ہیں۔ یہ خیالی حضور، جب اس نے معانی کو صورتوں کے طور پر قبول کیا، تو اللہ نے اس کے بارے میں فرمایا: زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَواتِ من النِّساءِ (لوگوں کے لیے عورتوں میں شہوتوں کی محبت مزین کر دی گئی ہے) [آل عمران: ۱۴]، یعنی عورتوں میں۔ پس اس نے محبت کو ایک صورت میں ڈھالا جسے اس نے اپنے بندوں میں سے جس کے لیے چاہا مزین کر دیا، پس اس نے اسے بذاتِ خود محبوب رکھا، نہ کہ کسی اور وجہ سے، کیونکہ اللہ تعالیٰ نے اس کے لیے صرف شہوت کی محبت کو مزین کیا جس کا اس نے ذکر کیا۔ پس مطلق محبت اس کے لیے مزین کی گئی، پھر اس نے اسے شہوت کے ساتھ منسلک کر دیا جس کا اس نے ذکر کیا، اور جسے چاہا اس کے لیے کسی دوسرے امر میں بھی شہوت کے ساتھ منسلک کر دیا۔ اور اس نے شہوت کا ذکر اس لیے کیا کہ یہ ایک طبعی صورت ہے، کیونکہ خیال (Imagination) کو طبیعت نے محدود کیا ہے، پھر خیال اس پر حکم لگاتا ہے اور جب چاہتا ہے اسے مجسم کر دیتا ہے۔ پس یہ ایک فرع ہے جو اپنی اصل پر حکم لگاتی ہے، کیونکہ یہ ایک معزز فرع ہے، اللہ نے اس سے زیادہ بلند مرتبہ اور زیادہ عام حکم والی کوئی چیز وجود میں نہیں لائی، جس کا حکم تمام موجودات اور معدومات، مقامات اور غیر مقامات میں جاری ہوتا ہے۔ پس اللہ کی قدرت کے لیے اس نے جو کچھ وجود میں لایا ہے، اس میں خیال (Imagination) سے بڑھ کر کوئی عظیم وجود نہیں ہے۔ پس اسی کے ذریعے الٰہی قدرت اور الٰہی اقتدار ظاہر ہوا، اور اسی کے ذریعے كَتَبَ عَلى‏ نَفْسِهِ الرَّحْمَةَ (اس نے اپنے اوپر رحمت کو لازم کر لیا) [الأنعام: ۱۲] اور اس جیسی چیزیں، اور عموم کو واجب کیا۔ اور یہ قیامت میں اور اعتقادات میں الٰہی ظہور (التجلی) کی حضور ہے۔ پس یہ اللہ پر اللہ کی سب سے بڑی نشانیوں میں سے ہے۔ اور اس کے سلطان کے حکم کی قوت میں سے یہ ہے کہ حکماء اسے ثابت کرتے ہیں، حالانکہ وہ نہیں جانتے کہ انہوں نے کیا کہا اور نہ ہی وہ اسے اس کا حق دیتے ہیں۔ اور یہ اس لیے ہے کہ اگرچہ خیال (Imagination) طبیعت سے ہے، لیکن اسے طبیعت پر ایک عظیم سلطنت حاصل ہے، اس الٰہی قوت کے ذریعے جس سے اللہ نے اس کی تائید کی ہے۔ پس جب انسان چاہے کہ اس کی اولاد نیک ہو، تو اسے اپنی بیوی کے ساتھ مباشرت کے وقت اپنے نفس میں بڑے علماء میں سے کسی کی صورت قائم کرنی چاہیے، اور اگر وہ اس معاملے کو پختہ کرنا چاہے تو اسے اس صورت میں ڈھالے جو اسے منتقل کی گئی ہے یا جسے مصور نے دیکھا ہے، اور اپنی بیوی کو اس صورت کی خوبصورتی یاد دلائے۔ اور جب مصور اسے صورت دے، تو اسے اس کے علم اور اخلاق کی خوبصورتی کی صورت میں ڈھالے، اگرچہ اس کی محسوس صورت بدصورت ہو، تو اسے صرف اس کے علم اور اخلاق کی خوبصورتی کے مطابق حسین صورت میں ڈھالے، گویا وہ ان معانی کو مجسم کر رہا ہے اور جماع کے وقت اپنی بیوی اور اپنی آنکھ کے سامنے اس صورت کو حاضر کر رہا ہے۔ اور وہ دونوں اس کی خوبصورتی کو دیکھنے میں پوری توجہ صرف کریں۔ پس اگر اس جماع سے عورت کو حمل ٹھہر جائے، تو اس حمل میں وہ اثر پڑے گا جو انہوں نے نفس میں اس صورت کا تخیل کیا تھا، اور بچہ اسی مرتبے پر پیدا ہو گا، اور یہ ضروری ہے۔ یہاں تک کہ اگر وہ ایسا پیدا نہ ہو، تو یہ کسی ایسے امر کی وجہ سے ہو گا جو نطفے کے رحم میں اترنے کے وقت والدین کے نفس پر طاری ہوا، جس نے انہیں اس صورت کے خیالی مشاہدے سے نکال دیا، جہاں انہیں شعور بھی نہیں ہوا۔ اور عام لوگ اسے عورت کی توحم سے تعبیر کرتے ہیں۔ اور کبھی اتفاق سے مباشرت کے وقت میاں بیوی میں سے کسی ایک کے یا دونوں کے نفس میں کتے، شیر یا کسی بھی حیوان کی صورت آ جاتی ہے، تو اس مباشرت سے پیدا ہونے والے بچے کے اخلاق میں اس حیوان کی صورت کا اثر ظاہر ہوتا ہے جس کا والدین نے تخیل کیا تھا۔ اور اگر وہ مختلف ہوں، تو بچے میں والد کے تخیل کی صورت اور ماں کے تخیل کی صورت ظاہر ہوتی ہے، یہاں تک کہ ظاہری حس میں بھی، صورت یا بدصورتی میں۔ اور وہ اس سلطنت کو جاننے کے باوجود الٰہی علوم کے حصول میں اس کی طرف توجہ نہیں کرتے، کیونکہ وہ اپنی جہالت کی وجہ سے ایسی چیز کی طمع کرتے ہیں جو طمع کے قابل نہیں، اور وہ مواد سے تجرد ہے، اور یہ کبھی نہیں ہو سکتا، نہ دنیا میں اور نہ آخرت میں۔ پس یہ امر، یعنی مواد سے تجرد، عقلی ہے لیکن مشہود (الشہود) نہیں ہے۔ اور اہل نظر کی اس سے بڑی کوئی غلطی نہیں ہے، اور انہیں اپنی غلطی کا شعور بھی نہیں ہوتا، اور وہ خیال کرتے ہیں کہ وہ حاصل میں ہیں، حالانکہ وہ فوت شدہ میں ہیں۔ پس وہ اپنی عمریں ایسی چیز کے حصول میں گزار دیتے ہیں جو انہیں حاصل نہیں ہو سکتی۔ اسی لیے کوئی عقل وہم کے حکم سے محفوظ نہیں رہتی، اور نہ ہی خیال (Imagination)، اور وہ فرشتوں اور ارواح کے عالم میں امکان ہے۔ پس کوئی روح اور نہ ہی اللہ کا عالم اس امکان سے محفوظ رہتا ہے جو اسے ہر اس چیز میں پیش آتا ہے جس کا وہ شہود (الشہود) کرتا ہے، کیونکہ اللہ کے سوا ہر چیز کی حقیقت اس کی ذات سے امکان ہے۔ اور کوئی شے اپنے حکم سے زائل نہیں ہوتی۔ پس وہ جو کچھ دیکھتا ہے، قدیم اور حادث، اسے صرف اپنے نفس سے دیکھتا ہے، پس امکان ہمیشہ اس کے ساتھ رہتا ہے، اور اس کا شعور صرف وہی رکھتا ہے جو معاملہ کو اس کی اصل حقیقت پر جانتا ہے۔ پس وہ تجرید کو وہم کے طور پر سمجھتا ہے، لیکن اپنے نفس میں اس پر قادر نہیں ہوتا، کیونکہ وہاں وہم نہیں ہے۔ یہاں بہت سے لوگوں کے قدم ڈگمگا گئے، سوائے اللہ کے خاص اہل کے، کیونکہ انہوں نے یہ اللہ کے بتانے سے جانا۔ کیا تم زکریا علیہ السلام کو نہیں دیکھتے، جب وہ مریم کے پاس محراب میں داخل ہوئے، حالانکہ وہ کنواری اور وقف شدہ تھیں، اور زکریا یہ جانتے تھے، اور انہوں نے ان کے پاس اللہ کی طرف سے عطا کردہ رزق دیکھا، تو انہوں نے اس وقت اللہ سے اولاد طلب کی، جب انہیں ان کے حال سے محبت ہو گئی، پس انہوں نے کہا: رَبِّ هَبْ لِي من لَدُنْكَ (اے میرے رب! مجھے اپنی طرف سے عطا فرما) [آل عمران: ۳۸]، یعنی اپنی رحمت، نرمی اور شفقت کی عندیت سے، ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعاءِ (پاکیزہ اولاد، بے شک تو دعا سننے والا ہے) [آل عمران: ۳۸]۔ اور مریم ان کے خیال (Imagination) میں تھیں، ان کے مرتبے اور الٰہی عنایت کے ساتھ جو اللہ نے انہیں عطا کی تھی۔ فَنادَتْهُ الْمَلائِكَةُ وهُوَ قائِمٌ يُصَلِّي في الْمِحْرابِ (پس فرشتوں نے انہیں آواز دی، جب وہ محراب میں کھڑے نماز پڑھ رہے تھے) [آل عمران: ۳۹]، کیونکہ وہ ان کے پاس محراب میں داخل ہوئے جب انہوں نے ان کے پاس رزق پایا۔ أَنَّ الله يُبَشِّرُكَ بِيَحْيى‏ مُصَدِّقاً بِكَلِمَةٍ من الله وسَيِّداً (کہ اللہ تمہیں یحییٰ کی بشارت دیتا ہے، جو اللہ کے ایک کلمے کی تصدیق کرنے والا ہو گا، اور سردار ہو گا) [آل عمران: ۳۹]، اور وہ کمال ہے، کیونکہ مریم کامل ہوئیں، پس یحییٰ نبوت کے ساتھ کامل ہوئے، وحَصُوراً (اور حصور) [آل عمران: ۳۹]، اور وہ وہ ہے جسے اللہ نے عورتوں سے مباشرت سے کاٹ دیا، اور وہ ہمارے نزدیک عنین (نامرد) ہے۔ جیسا کہ اس نے مریم کو مردوں سے مباشرت سے کاٹ دیا، اور وہ بتول (کنواری) تھیں۔ پس یحییٰ علیہ السلام عورتوں سے دور رہنے والے تھے، جیسا کہ مریم کی والدہ حنہ تھیں۔ کیونکہ مردوں سے منقطع ہونے والی مریم کا نام حنہ تھا اور مریم ان کا لقب تھا جو انہیں اس صفت کی وجہ سے دیا گیا جس کا ہم نے ابھی ذکر کیا۔ پس دیکھو کہ زکریا کے خیال (Imagination) کے سلطان نے ان کے بیٹے یحییٰ علیہ السلام میں کیا اثر ڈالا، جب زکریا کی قوت مریم علیہ السلام کے حسنِ حال میں پوری طرح صرف ہوئی، اس مرتبے کی وجہ سے جو اللہ نے انہیں عطا کیا تھا۔ ونَبِيًّا من الصَّالِحِينَ (اور صالحین میں سے ایک نبی) [آل عمران: ۳۹]۔ پس انہوں نے کبھی اللہ کی نافرمانی نہیں کی، اور یہ تمام انبیاء کی طلب تھی کہ اللہ انہیں اپنی رحمت سے اپنے صالح بندوں میں داخل کرے۔ اور میں نے زکریا علیہ السلام کے حال سے زیادہ عجیب کوئی چیز نہیں دیکھی، اور نہ ہی میں نے کسی کو دیکھا جس میں انسانیت کا سلطان ان کی طرح ظاہر ہوا ہو۔ وہی ہیں جو کہتے ہیں: هَبْ لِي من لَدُنْكَ ذُرِّيَّةً طَيِّبَةً (مجھے اپنی طرف سے پاکیزہ اولاد عطا فرما) [آل عمران: ۳۸]۔ پس انہوں نے سوال نہیں کیا جب تک کہ وقوع کا تصور نہ کر لیا، اور نہ ہی ان کے اس قول سے: رَبِّ أَنَّى يَكُونُ لِي غُلامٌ وقَدْ بَلَغَنِيَ الْكِبَرُ وامْرَأَتِي عاقِرٌ (اے میرے رب! میرے ہاں لڑکا کیسے ہو گا جبکہ مجھے بڑھاپا آ چکا ہے اور میری بیوی بانجھ ہے) [آل عمران: ۴۰]۔ پس یہ حالت اس حالت سے کہاں؟ اگر وہاں کوئی قرینہِ حال نہ ہوتا جس نے انہیں ایسا کہنے پر مجبور کیا، یہاں تک کہ انہیں وحی میں کہا گیا: كَذلِكَ الله يَفْعَلُ ما يَشاءُ (اسی طرح اللہ جو چاہتا ہے کرتا ہے) [آل عمران: ۴۰]، تو ان کا مقصد اللہ کو اس سے آگاہ کرنا تھا تاکہ دوسرے جان لیں کہ إِنَّ الله يَفْعَلُ ما يَشاءُ (بے شک اللہ جو چاہتا ہے کرتا ہے) [آل عمران: ۴۰]، معمول کے خلاف بھی، جیسا کہ واقع ہوا۔ اور اگر یہ قول ان کی اپنی طرف سے تھا، تو انسانیت نے انہیں اپنی قوت عطا کی، کیونکہ انسان اپنی ذات کے لحاظ سے ایسا ہی ہے جیسا کہ اللہ نے اپنی کتاب میں ذکر کیا ہے۔ پس اللہ نے اسے جس جگہ بھی ذکر کیا ہے، اس کے ذکر کے ساتھ نقص کی صفت کا ذکر کیا ہے جو اس کے خلاف ہے جس کے لیے اسے پیدا کیا گیا تھا، کیونکہ اللہ نے انسان کو أَحْسَنِ تَقْوِيمٍ (بہترین ساخت) [التین: ۴] میں پیدا کیا، اور وہ یہ ہے کہ اللہ نے اسے پیدا کیا، پھر اسے أَسْفَلَ سافِلِينَ (سب سے نچلے درجے) [التین: ۵] کی طرف لوٹا دیا، تاکہ اسے اس چیز کی طرف ترقی حاصل ہو جس کے لیے اللہ نے اسے پیدا کیا تھا، تاکہ اس کی ترقی سے جو ظاہر ہوا اس پر اس کی تعریف ہو۔ پس لوگوں میں سے کچھ اس أَسْفَلَ سافِلِينَ میں ہی رہے جس کی طرف اسے لوٹا دیا گیا، اور اسے اس طرف صرف اس لیے لوٹایا گیا کہ وہ اسی سے پیدا ہوا تھا، اور اگر ایسا نہ ہوتا تو اس کا لوٹایا جانا درست نہ ہوتا۔ اور أَسْفَلَ سافِلِينَ سے میری مراد صرف طبیعت کا حکم ہے جس سے وہ پیدا ہوا جب اللہ نے اس کے جسم کی صورت اور اس کی تدبیر کرنے والی روح کو پیدا کیا، پس اسے اس کی اصل کی طرف لوٹا دیا جس سے اسے پیدا کیا گیا تھا۔ پس اس نے ابتداء میں صرف اپنی طبیعت اور اپنے جسم کی اصلاح کی طرف دیکھا، اور وہ صحیح معرفت سے \"بَلَىٰ\" کہنے سے کہاں ہے؟\n\n### [دنیا میں حضرہِ خیال میں ذات حق کا بندے کی تخلیق کا محل ہونا]\n\nاور جان لو کہ دنیا میں حضرہِ خیال (Imagination) میں ذات حق (الحق) بندے کی تخلیق کا محل ہوتا ہے۔ پس اس کے دل میں کسی بھی معاملے کا کوئی خیال نہیں آتا مگر ذات حق (الحق) اسے اس حضور میں تخلیق کر دیتا ہے، جیسے وہ ممکنات کے اعیان کو تخلیق کرتا ہے جب وہ ان میں سے جو چاہتا ہے چاہتا ہے۔ پس اس حضور میں بندے کی مشیت ذات حق (الحق) کی مشیت میں سے ہے۔ کیونکہ بندہ نہیں چاہتا مگر یہ کہ اللہ چاہے، پس ذات حق (الحق) نے نہیں چاہا مگر یہ کہ بندہ دنیا میں چاہے۔ اور بندے کی بعض مشیت دنیا میں حس میں واقع ہوتی ہے، لیکن خیال (Imagination) میں وہ نفاذ میں ذات حق (الحق) کی مشیت کی طرح ہے۔ پس ذات حق (الحق) اس حضور میں بندے کے ساتھ ہے جو کچھ بھی بندہ چاہتا ہے، جیسا کہ آخرت میں مشیت کے حکم کے عموم میں ہے۔ کیونکہ انسان کا باطن آخرت میں اس کا ظاہر ہو گا، اسی لیے اس کی مشیت سے ہر چیز تخلیق ہو جاتی ہے جب وہ اسے چاہے گا۔ پس ذات حق (الحق) دنیا میں اس حضور میں انسان کے تصرف میں ہے، اور آخرت میں اس کی شہوت میں، دنیا میں حس میں نہیں۔ پس ذات حق (الحق) اس حضور میں اور آخرت میں بندے کی شہوت کا تابع ہے، جیسا کہ بندہ اپنی مشیت میں ذات حق (الحق) کی مشیت کے تحت ہے۔ پس ذات حق (الحق) کا کوئی کام نہیں سوائے بندے کی نگرانی کے، تاکہ وہ اس کے لیے وہ سب کچھ وجود میں لائے جو وہ اس حضور میں دنیا میں وجود میں لانا چاہتا ہے، اور اسی طرح آخرت میں جنت میں عموماً۔ اور جب اللہ نے ہستی (الوجود) میں فعال ہمتیں اور حس میں غیر فعال ہمتیں پیدا کیں، تو اس سے ہمتوں میں تفاضل ظاہر ہوا، جیسا کہ تمام چیزوں میں تفاضل ظاہر ہوا، یہاں تک کہ الٰہی اسماء میں بھی۔ اور دنیا میں فعال ہمتیں کبھی دوسروں کی ہمتوں میں بھی عمل کرتی ہیں اور کبھی نہیں کرتیں، جیسے اس قول میں جہاں وہ عمل نہیں کرتیں: إِنَّكَ لا تَهْدِي من أَحْبَبْتَ (بے شک تم جسے چاہو ہدایت نہیں دے سکتے) [القصص: ۵۶]۔ پس بعض فعال اور منفعل ہمتیں کسی فعال ہمت سے منفعل نہیں ہوتیں، پس وہ اس سے کسی چیز کا ارادہ کروانا چاہتا ہے، لیکن وہ شخص جس سے وہ ارادہ کروانا چاہتا ہے، وہ ارادہ نہیں کرتا، کیونکہ ہمتیں جنسیت کی وجہ سے ایک دوسرے کے مقابل ہوتی ہیں۔ اسی لیے وہ ان پر اثر انداز نہیں ہوتی ہیں۔ لیکن جب وہ غیر جنس سے متعلق ہوتی ہیں، تو ہر فعال ہمت ضرور اثر انداز ہوتی ہے۔ لیکن اپنی جنس میں، یعنی ہمتوں میں، بعض ہمتیں اس سے منفعل ہو سکتی ہیں اور بعض نہیں ہوتیں۔ اور یہ رسولوں علیہم السلام اور ان کے پیروکاروں میں ظاہر ہوا ہے۔ رسول کسی شخص سے اسلام کا ارادہ کروانا چاہتا ہے، تو وہ ارادہ کرتا ہے اور اسلام قبول کر لیتا ہے، اور کسی دوسرے سے اسلام کا ارادہ کروانا چاہتا ہے، تو وہ ارادہ نہیں کرتا۔ اگر رسول کی ہمت اس شخص کی ارادے کے بغیر توحید کی شہادت کے ساتھ زبانوں کو حرکت دینے سے متعلق ہوتی، تو یہ عموماً واقع ہو جاتی، لیکن یہ اس کے مالک کو فائدہ نہ دیتی، اگرچہ اس کی زبان کو فائدہ دیتی۔ کیونکہ اس کی زبان نے اپنی ذات کے لحاظ سے کبھی اللہ کی نافرمانی نہیں کی، بلکہ اس میں مخالفت واقع ہوئی، نہ کہ اس کی طرف سے، بلکہ اسے حرکت دینے والے کے ارادے سے۔ پس وہ مجبور ہے، کیونکہ اسے اپنے نفس سے دفاع کی قوت نہیں دی گئی، کیونکہ وہ نفس کے آلات میں سے ہے۔ پس وہ اپنی ذات سے فرمانبردار ہے، اپنے محرک پر گواہِ عدل ہے، جیسا کہ فرمایا گیا: يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ (جس دن ان کے خلاف ان کی زبانیں، ان کے ہاتھ اور ان کے پاؤں گواہی دیں گے جو وہ کرتے تھے) [النور: ۲۴]۔ اور اسی طرح ہر وہ عضو جو تصرف میں ہے، جیسے کان، آنکھ، دل، جلد، پٹھے، شرمگاہ اور نفس اور حرکت۔\n\n> اور لوگ اس سے غفلت میں ہیں جو ان سے مراد لیا جاتا ہے،\n> اور اس چیز کی اندھیرے میں ہیں جس پر ان کا عماء (بادل) ہے۔\n\nپس انسان اپنی طبعی نشوونما کے لحاظ سے اور اپنے ناطق نفس کی نشوونما کے لحاظ سے خوش بخت ہے، ہر نشوونما کے اپنی ساتھی سے انفرادیت کے ساتھ۔ اور مجموعی طور پر مخالفت ظاہر ہوئی، اور مخالفت کا عین صرف تکلیف (شرعی ذمہ داری) ہے۔ پس جب تکلیف اٹھ جائے گی، جہاں مخالفت کا حکم اٹھ جائے گا، تو صرف دائمی موافقت اور واجب کے لیے ممکن کی مسلسل اطاعت باقی رہے گی، جیسا کہ حقیقت میں مخالفت کے وقت بھی وہ مشیت کا مطیع ہوتا ہے، اور جنس میں حسد کی وجہ سے واسطے کے حکم کا مخالف ہوتا ہے۔ اور اس منزل کے علوم میں ذات حق (الحق) کی توحید کا علم، اور ذات حق (الحق) کی طرف سے خبر دینے والوں کی تصدیق کا علم ہے، اور وہ سفیر مترجم ہیں، خواہ انسان ہوں، فرشتے ہوں یا خواطر (خیالات)۔ اور فرقان کا علم، اس علم کے ذریعے کہ اشیاء کس چیز سے ممتاز ہوئیں، اور یہی عالمگیر توحید کا علم ہے جو عالم کے ہر ایک فرد میں سرایت کرتا ہے۔ اور کشف (الکشف) الٰہی کا علم، اور اس میں تناسل کا علم ہے جو دنیا اور آخرت میں منقطع نہیں ہوتا۔ اور اس میں اس حضور کا علم ہے جس میں اشیاء کے درمیان تشبیہ اور صورت میں اشتراک واقع ہوا۔ اور اس میں اس علم کا علم ہے جس میں ذات حق (الحق) خلق کے بغیر منفرد ہے، جسے خلق اللہ کے بتانے کے بغیر نہیں جانتی۔ اور اس میں میلان اور استقامت کا علم ہے۔ اور اس میں تفصیل کے لیے جمع کا علم ہے۔ اور اس میں عادات کا علم ہے کہ وہ کس طرف لوٹتی ہیں، اور وہاں کوئی تکرار نہیں ہے، اور اعادہ تکرار ہے۔ پس معاملہ مشکل ہے، اور اس کی مشکل کی وجہ ذات حق (الحق) کا عادت اور اعادہ کا ذکر کرنا ہے۔ اور کشف (الکشف) کائنات میں اعادہ نہ ہونے کا حکم دیتا ہے، نہ کہ آخرت کی نشوونما میں اعادہ کا، کیونکہ وہ اعادہ کسی مخصوص امر کے حق میں ایک الٰہی حکم ہے، اس شخص کی منزل کی طرح جو ایک گھر سے نکلا اور پھر اس میں واپس آ گیا، تو گھر وہی گھر ہے اور نکلنے والا داخل ہونے والا ہے، اور وہاں صرف احوال میں انتقال ہے، اعیان کا ظہور نہیں، اس کے باوجود یہ اطلاق درست ہے کہ گھر سے نکلنے والا اپنے گھر واپس آ گیا۔ پس ہم نے اعادہ کے متعلق کو جان لیا۔ اور اس میں دار کے ذریعے فضیلت کا علم ہے۔ اور اس میں اہل اللہ کی صفات کا علم ہے۔ اور اس میں اس چیز کا علم ہے جس میں ذات حق (الحق) اور عالم، جو اللہ کا عالم ہے، شریک ہیں، اور وہاں اللہ کے عالم کے سوا کوئی نہیں ہے۔ مگر ان علماء میں سے کچھ ایسے ہیں جو جانتے ہیں کہ وہ اللہ کے عالم ہیں، اور لوگوں میں سے کچھ ایسے ہیں جو نہیں جانتے کہ وہ اللہ کے عالم ہیں۔ اور وہ اس چیز کا علم رکھتے ہیں جس کا وہ شہود (الشہود) اور مشاہدہ کرتے ہیں، لیکن وہ نہیں جانتے کہ وہ ذات حق (الحق) ہے۔ پس اگر تم اس سے پوچھو کہ کیا تم اللہ کو جانتے ہو؟ تو وہ کہے گا: نہیں۔ اور اگر تم اس سے پوچھو کہ جو کچھ تم نے شہود (الشہود) کیا ہے، کیا تم اسے جانتے ہو جس حیثیت سے وہ تمہارے لیے مشہود ہے؟ تو وہ کہے گا: ہاں۔ اسے کہا جائے گا: تو وہ کون ہے؟ وہ کہے گا: یہ وہ ہے جس کا میں شہود (الشہود) کر رہا ہوں۔ اسے کہا جائے گا: تو اسے کیا کہا جاتا ہے؟ وہ کہے گا: میں نہیں جانتا۔ پس جب اسے کہا جائے گا کہ وہ فلاں ہے، یعنی وہ اس نام سے ہے جسے وہ جانتا ہے، لیکن اس نے یہ نہیں جانا کہ یہ مشہود اس نام کا مسمیٰ ہے۔ پس اس نے صرف اس معلوم نام کو اس مشہود پر منطبق کرنے میں جہالت کی۔ اور اس میں ذات حق (الحق) کے لیے خلق کی فرمانبرداری کا علم ہے، اور یہ کہ یہ خلق کے لیے ذات حق (الحق) کی فرمانبرداری کا نتیجہ ہے، ممکن کے واجب کو طلب کرنے کی وجہ سے۔ پس واجب نے اس کے لیے اس چیز میں فرمانبرداری کی جو اس نے طلب کی، اور اسے وجود میں لایا حالانکہ وہ کچھ نہیں تھا۔ اور اس میں عالم میں واقع ہونے والے اختلاف کا علم ہے، اس علم کے ساتھ جو اختلاف کو ختم کرنے کا موجب ہے، پس کس چیز نے علم پر اس کے سلطان کی قوت کے باوجود حکم لگایا؟ اور اس میں دھوکے کا علم ہے اور اس کا سبب کیا ہے جس نے اسے ظاہر کیا؟ اور اس میں عمل اور کسب کا علم ہے، اور کسب اور اکتساب کے درمیان فرق کا علم ہے، کیونکہ اللہ نے کسب کو اکتساب سے لام (ل) اور علی (علی) کے ذریعے ممتاز کیا، پس فرمایا: لَها ما كَسَبَتْ وعَلَيْها ما اكْتَسَبَتْ (اس کے لیے ہے جو اس نے کمایا اور اس پر ہے جو اس نے حاصل کیا) [البقرہ: ۲۸۶]۔ اور اس میں الٰہی اختیار کا علم ہے۔ اور اس میں اس بات کا علم ہے کہ کب ضد پر بھروسہ کیا جائے، تو ضد اپنی ضد کے لیے رحمت بن جائے، حالانکہ وہ طبعاً اس کی دشمن ہے۔ اور اس میں اللہ میں غور و خوض سے روکنے کا علم ہے۔ اور اس میں اعمال کا احاطہ کرنے کا علم ہے، مشاہدے کا احاطہ، نہ کہ تلبس (ملوث ہونے) کا احاطہ۔ اور وہ کس خزانے میں ذخیرہ کیے گئے ہیں ان کے شہود (الشہود) کے وقت تک، اور ان کا حکم کیا ہو گا ان کے شہود (الشہود) کے بعد، اپنی ذات میں اور اس میں جو ان کے عامل پر لوٹتا ہے۔ اور اس میں اس حضور کا علم ہے جو حقائق کو پلٹ دیتی ہے لیکن خود نہیں پلٹتی، حالانکہ وہ حقائق میں سے ہے۔ اور اس میں مناسبات کا علم ہے۔ اور اس میں اس چیز کا علم ہے جس کی طرف حکم میں رجوع کیا جاتا ہے جو قول سے متصف نہیں ہے، اس کے باوجود بعض فیصلوں میں اس کے لیے فیصلہ کن حیثیت ہے، اور وہ قرعہ اندازی اور اس جیسی چیزیں ہیں۔ اور اس میں اس غایت کا علم ہے جسے رسول اس دنیا میں اللہ سے طلب کرتے ہیں۔ اور اس میں تخلیق میں الٰہی نیابت کا علم ہے۔ اور اس میں محبت سے متعلق ایک عجیب علم ہے، اور وہ محبوب کی خاطر محبوب سے زہد اختیار کرنا ہے، اس کے باوجود کہ وہ زہد اختیار کی گئی چیز میں محبت کی صفت سے متصف ہو، اور وہ صفت اس پر باقی رہے۔ اور اس میں اعتصام (پکڑنے) کا علم ہے۔ اور اس میں سفیدی اور سیاہی کا علم ہے، اور بعض اہل طریق نے اس پر ایک تصنیف لکھی ہے جسے انہوں نے \"البیاض والسواد\" کا نام دیا ہے۔ اور اس میں امتوں کی ایک دوسرے پر فضیلت کا علم ہے، اور اس امت محمدیہ کی دیگر تمام امتوں پر فضیلت کا علم ہے۔ اور کیا امت محمدیہ صلی اللہ علیہ وسلم میں سے کوئی ایسا تھا جو آپ کی بعثت سے پہلے تھا اور اس نے اپنے کشف (الکشف) میں آپ کو دیکھا اور آپ پر ایمان لایا اور اس قدر آپ کی پیروی کی جس قدر آپ کا کشف (الکشف) اسے حاصل ہوا؟ اور کیا ایسا شخص اپنی امت میں حشر کیا جائے گا یا اکیلا ایک امت حشر کیا جائے گا؟ یا کیا اس کشف (الکشف) کا مالک کسی خاص نبی کی شریعت کا پیروکار تھا، جیسے عیسیٰ یا موسیٰ یا ان رسولوں میں سے کوئی، اور اس نے مشاہدہ کیا کہ وہ خاص نبی جس کی یہ پیروی کر رہا ہے، اس کی لائی ہوئی شریعت میں وہ محمد صلی اللہ علیہ وسلم کا نائب ہے، اور یہ کہ وہ شریعت محمد صلی اللہ علیہ وسلم کی ہے، پس اس نے اس کی پیروی اس حیثیت سے کی کہ وہ محمد صلی اللہ علیہ وسلم کی شریعت ہے، اور یہ کہ وہ رسول اس شریعت کو پہنچانے والا ہے جو اس کے ذریعے ظاہر ہوئی؟ تو کیا ایسا شخص امت محمدیہ صلی اللہ علیہ وسلم میں حشر کیا جائے گا یا اس نبی کی امت میں ہو گا؟ پھر اگر وہ اس رسول کی امت میں حشر کیا جائے اور پھر جنت میں داخل ہو کر اپنا مقام حاصل کرے، تو کیا وہ اسے اس امت محمدیہ کے منازل میں حاصل کرے گا یا صرف اس رسول کے پیروکاروں اور اس کی امت کے منازل میں ہی اترے گا؟ یا اس کے لیے اس رسول کے منازل میں اس کی امت کے ساتھ منازل ہوں گی اس حیثیت سے کہ وہ پیروکار ہے، اور اس کے لیے امت محمدیہ کے ساتھ منازل ہوں گی اس حیثیت سے کہ اس نے اس کشف (الکشف) کے ذریعے آپ کی پیروی کی جس کا ہم نے ابھی ذکر کیا؟ اور اس میں صحبت کا علم ہے، اور کون تمہاری صحبت صفت کے ساتھ کرتا ہے، اور کون چہرے کے ساتھ، اور کون تمہارے لیے تمہاری صحبت کرتا ہے، اور کون اپنے نفس کے لیے تمہاری صحبت کرتا ہے، اور کون اللہ کے لیے تمہاری صحبت کرتا ہے، اور کون صحبت کا زیادہ حقدار ہے، اور کون اللہ کی صحبت کرتا ہے، اور کس کا مقام یہ ہے کہ وہ صحبت کرے لیکن کسی کی صحبت نہ کرے، اور صحبت اور مصاحبت کے درمیان فرق کا علم ہے۔ اور اس میں مقامات اور احوال کا علم ہے۔ اور اس میں \"نعم\" (ہاں) اور \"بئس\" (برا) کا علم ہے۔ اور اس میں دنیا میں جزا کا علم ہے۔ اور اس میں عالم کے اس چیز سے استفادہ کی صفت کا علم ہے جس کا وہ عالم ہے۔ اور اس میں ہر امت کے مقربین کی اقسام اور قربت میں ان کے درجات کا علم ہے۔ اور اس میں اس کا علم ہے جو اللہ کا ارادہ کرتا ہے اور جو اللہ کے علاوہ کا ارادہ کرتا ہے، اور ارادے کا متعلق کیا ہے، اور کیا وہ شخص سچا ہے جو کہتا ہے کہ وہ اللہ کا ارادہ کرتا ہے یا نہیں؟ اور اس میں موت میں التباس کا علم ہے، اور وہ جو دو ضدوں سے متصف ہو۔ اور اس میں استدراج (تدریجی گرفت) کا علم ہے۔ اور اس میں ان صفات کا علم ہے جنہیں ذات حق (الحق) قبول کرتا ہے لیکن انہیں اس کی طرف منسوب نہیں کرنا چاہیے، کیونکہ وہ عرف اور شرع میں الٰہی جناب میں نقص کی صفت ہیں، حالانکہ وہ مخلوق کے لیے شرف اور بلندی ہیں۔ اور اس میں علوم کے فنون کا علم ہے، اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے) [الأحزاب: ۴]۔",
    "fa": "«باب سیصد و هشتاد و یکم» در معرفت منزل توحید و جمع\n\nاین باب شامل پنج هزار مقام رفرفی است و از حضرت محمدیه (الحضرة المحمدية) می‌باشد. کامل‌ترین شهودهای آن برای کسی است که آن را در نیمه ماه یا در پایان آن مشاهده کند.\n\n> ای مریم دختر عمران که آفریدی *** بستری کریم برای روحی که از هر روح والاتر است\n> خود را حفظ کردی، پس روح نزد تو آمد و بخشید *** از فراز هفت آسمان، از لوح\n> هدیه‌ای والا و شریف به او اهدا کرد *** که در ما از فروغ «یوح» درخشان‌تر و نورانی‌تر است\n> زنده می‌کند و شمشیری برای میراندن ندارد *** اگر با لطف خوانده شود، به «روح» خوانده می‌شود.\n\n### [عالم عماء]\n\nمنظور ما از آن هدیه، عیسی روح‌الله است، از قول جبرئیل به مریم: **لِأَهَبَ لَكِ غُلاماً زَكِيًّا** (تا پسری پاکیزه به تو ببخشم).\n\nدر خبر آمده است که از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) پرسیده شد: پروردگار ما پیش از آنکه خلقش را بیافریند کجا بود؟ رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «**كان في عماء ما فوقه هواء وما تحته هواء**» (در عماء (العماء) بود که نه بالای آن هوا بود و نه زیر آن هوا).\n\nپیش‌تر حدیث عماء (العماء) را ذکر کردیم و گفتیم که صور عالم در آن گشوده شد. آنچه دلیل بر آن استوار است این است که هر چیزی جز حق (الحق) حادث است و نبوده و سپس موجود شده است. پس دلیل، وجود ما سوی الله را در کینونت حق (الحق) که واجب الوجود بالذات است، نفی می‌کند. بنابراین، دوام ایجاد از آنِ خداوند متعال است و دوام انفعال از آنِ ممکنات (الممكنات) است، و ممکنات همان عالم هستند. پس تکوین پیوسته ادامه دارد و اعیان (الأعيان) دائماً ظاهر می‌شوند. امتداد خلأ (الخلأ) نیز تا بی‌نهایت ادامه دارد، زیرا اعیان ممکنات تا بی‌نهایت موجود می‌شوند و اعیان آن‌ها جز خلأ را آباد نمی‌کند. منظور ما از اینکه پیش‌تر گفتیم عالم جز خلأ را آباد نکرده است، این است که ممکن نیست ملأ (الملأ) را آباد کند، زیرا ملأ خود آباد است. پس در ملأ آباد نمی‌شود و در آنجا جز ملأ یا خلأ وجود ندارد، برخلاف عالمی که پیوسته در تجدید است. پس آخرت پایانی ندارد. اگر ما نبودیم، نه دنیا گفته می‌شد و نه آخرت، بلکه گفته می‌شد ممکناتی که موجود شدند و موجود می‌شوند، همان‌گونه که امر چنین است. پس چون ما از ممکنات مخلوق، مکان‌های معینی را تا اجلی معین، از زمان ظهور اعیانمان، آباد کردیم، و ما صورتی از صور عالم هستیم، آن موطن را دار دنیا نامیدیم؛ یعنی سرای نزدیکی که در آغاز هستی (الوجود) اعیانمان آن را آباد کردیم. عالم وجود داشت و ما نبودیم، با این حال خداوند متعال برای ما در آبادانی دار دنیا اجل‌هایی قرار داد که به آن‌ها پایان می‌یابیم، سپس به موطن دیگری منتقل می‌شویم که آخرت نامیده می‌شود. در آنجا نیز همان چیزی هست که در این دار دنیا وجود دارد، اما به واسطه دار متمایز است، همان‌گونه که در اینجا به واسطه حال متمایز است. و برای اقامت ما در آن دار آخرت، اجلی قرار نداد که مدت اقامت ما به آن پایان یابد، و آن دار را محل تکوین دائمی و ابدی تا بی‌نهایت قرار داد و صفت دار دنیا را تغییر داد، پس با این تبدیل، آخرت شد، در حالی که عین (ذات) باقی است. و کسی که از امور، علم الهی ندارد، در حیرت باقی می‌ماند. اما در حقیقت، در حق علمای بالله و نسبت عالم به حق (الحق)، هیچ حیرتی نیست. پس علما همیشه در شادی هستند و غیر از آن‌ها در ظلمت حیرت، در دنیا و آخرت سرگردانند.\n\nو اگر تجدید خلق همراه با انفاس نبود، ملال در اعیان (الأعيان) رخ می‌داد، زیرا طبیعت مقتضی ملال است. و همین اقتضا است که حکم به تجدید اعیان کرده است. به همین دلیل، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) از خداوند متعال فرمود: «**إن الله لا يمل حتى تملوا**» (خداوند ملول نمی‌شود تا زمانی که شما ملول شوید).\n\nپس عین ملال عالم، ملال حق (الحق) است. و از عالم ملول نمی‌شود مگر کسی که کشف (الکشف) ندارد و تجدید عالم را همراه با انفاس به طور دائم مشاهده نمی‌کند و خداوند را پیوسته خلاق نمی‌بیند. ملال جز با استصحاب (پیوستگی) رخ نمی‌دهد. اگر بگویی: دوام بر تجدید خلق، استصحاب است و با وجود استصحاب، ملال رخ نداده است؟ می‌گوییم: احکام ذاتی قابل تبدیل نیستند. خلاق بالذات خلق می‌کند و عالم بالذات منفعل می‌شود، پس وجود ملال صحیح نیست. دگرگونی در نعمت جدید، مقتضی ملال در کسی که در آن دگرگون می‌شود نیست، زیرا این شهود (الشهود) چیزی است که پیش از آن با شادی و سرور مشاهده نشده بود. به همین دلیل خداوند متعال فرمود: **ورَحْمَتِي وَسِعَتْ كُلَّ شَيْ‏ءٍ** (و رحمت من همه چیز را فرا گرفته است) که موجود شده و تا بی‌نهایت موجود می‌شود. زیرا رحمت یک حکم است نه یک عین (ذات). اگر عین وجودی بود، پایان می‌یافت و از شمول آنچه پایان ندارد، تنگ می‌شد. بلکه رحمت حکمی است که در موجودات با حدوث اعیان موجودات از جانب رحمن و رحیم پدید می‌آید. و **الرَّاسِخُونَ في الْعِلْمِ** (راسخان در علم)، یعنی در علم به حق (الحق)، **يَقُولُونَ آمَنَّا به كُلٌّ من عِنْدِ رَبِّنا** (می‌گویند: به آن ایمان آوردیم، همه از جانب پروردگار ماست)، رحمت و مرحوم. **وما يَذَّكَّرُ إِلَّا أُولُوا الْأَلْبابِ** (و جز خردمندان پند نمی‌گیرند)، و آن‌ها غواصانی هستند که مغز امور را به شهود عینی استخراج می‌کنند، پس از آنکه آن مغز را پوسته‌ی ظاهری که حافظ آن بود، می‌پوشاند. این باب شامل نُه هزار مقام است. این‌گونه از اهل کشف (الکشف) و هستی (الوجود) خبر رسیده است: هزار مقام برای طایفه‌ای خاص، سه هزار مقام برای طایفه‌ای دیگر، و پنج هزار مقام برای طایفه‌ی سوم. والاترین طوایف، طایفه‌ای است که هزار مقام دارد، و پس از آن در رفعت، طایفه‌ای است که سه هزار مقام دارد، و پس از آن طایفه‌ای است که پنج هزار مقام دارد. و بالاترین طوایف، کسانی هستند که مقامی ندارند، زیرا مقامات بر کسی که در آن‌هاست حاکم هستند، و شکی نیست که والاترین طوایف کسانی هستند که حکم از آنِ آن‌هاست، نه کسانی که بر آن‌ها حکم می‌شود. آن‌ها الهیون هستند، زیرا حق (الحق) عین آن‌هاست و او احکم الحاکمین است. و این مقام جز برای محمدیان (المحمديين) خاص نیست، به واسطه‌ی عنایت الهی که برایشان سبقت گرفته است، چنانکه خداوند متعال در مورد امثال آن‌ها فرمود: **إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنى‏ أُولئِكَ عَنْها مُبْعَدُونَ** (کسانی که از جانب ما وعده‌ی نیکو به آن‌ها سبقت گرفته است، آنان از آن دور داشته شده‌اند)، یعنی آتش. زیرا آتش جزئی از این مقامات است، پس آن‌ها در حقیقت از مقامات دور داشته شده‌اند.\n\nپس صاحبان مقامات کسانی هستند که همت‌هایشان به غایات و نهایت‌ها محدود شده است. هنگامی که به آن غایات می‌رسند، غایات دیگری در قلب‌هایشان برایشان تجدید می‌شود، و آن غایاتی که به آن‌ها رسیده‌اند، برای این غایات دیگر، آغازهایی می‌شوند. پس غایات بر آن‌ها حکم می‌کنند که آن‌ها را طلب کنند، و این امر پیوسته برایشان ادامه دارد. اما محمدی (المحمدي) این حکم و این حصر را ندارد، پس وسعت او وسعت حق (الحق) است. و حق (الحق) در ذات خود غایتی ندارد که هستی (الوجود)اش به آن پایان یابد، و حق مشهود محمدی است، پس در شهود او غایتی نیست. اما غیر محمدی، مکان خود را مشاهده می‌کند. هیچ حالی و مقامی نیست که در آن اقامت کند، مگر اینکه نزد او انقضای آن، یا تبدل حال بر آن، یا معدوم شدن آن جایز است. و او این را از غایت معرفت (المعرفة) به خداوند می‌بیند، زیرا حق حکم را با نظر به خود و پروردگارش ادا کرده است. و عیسی علیه السلام محمدی است، و به همین دلیل در آخرالزمان نازل می‌شود و خداوند ولایت کبری را به او ختم می‌کند. او روح‌الله و کلمه‌ی اوست، و کلمات حق (الحق) پایان نمی‌پذیرد. پس محمدی در خاطر خود غایتی ندارد که به آن برسد.\n\n### [مقامات جز با چشم خیال درک نمی‌شوند]\n\nبدان که این مقامات مذکور، جز با چشم خیال (الخيال) درک نمی‌شوند، هنگامی که مشاهده گردند. زیرا صور آن‌ها، هنگامی که خداوند بخواهد آن‌ها را تمثل بخشد، به صورت متخیّل درمی‌آیند، و تو آن‌ها را به صورت اشخاصی با دیده‌ی چشم می‌بینی، همان‌گونه که محسوسات را با چشم می‌بینی و معانی را با چشم بصیرت. پس اگر خداوند کثیر را کم جلوه دهد، در حالی که در نفس‌الامر کثیر است، یا قلیل را زیاد جلوه دهد، در حالی که در نفس‌الامر قلیل است، تو آن را جز با چشم خیال نمی‌بینی، نه با چشم حس، در حالی که در هر دو حال همان بینایی است. چنانکه خداوند متعال فرمود: **وإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ في أَعْيُنِكُمْ قَلِيلًا ويُقَلِّلُكُمْ في أَعْيُنِهِمْ** (و هنگامی که با هم برخورد کردید، آنان را در چشمان شما اندک جلوه داد و شما را در چشمان آنان اندک نمود). و فرمود: **يَرَوْنَهُمْ مِثْلَيْهِمْ رَأْيَ الْعَيْنِ** (آنان را دو برابر خودشان با دیده‌ی چشم می‌دیدند)، در حالی که در حس دو برابر نبودند. اگر آن‌ها را با چشم خیال نمی‌دیدی، آنچه از عدد می‌دیدی دروغ بود و کسی که آن را به تو نشان می‌داد، در آنچه به تو نشان داده بود، صادق نبود. اما هنگامی که کسی که آن را به تو نشان داد، آن را با چشم خیال به تو نشان داد، کثرت در قلیل حق است و قلت در کثیر حق است، زیرا در خیال حق است و در حس حق نیست. همان‌گونه که شیر را در خیال به تو نشان داد و تو آن را نوشیدی، در حالی که آن شیر چیزی جز عین علم نبود. پس تو آن را که علم بود، جز با چشم خیال (الخيال) به صورت شیر ندیدی. و دیدی که آن علم را از کسی که از او فرا گرفتی، به صورت نوشیدن شیر به تو تلقین کرد، و این نیز در چشم خیال بود. علم، شیر نیست و تلقین، نوشیدن نیست، اما تو آن را این‌گونه دیدی. پس اگر آن را با چشم حس می‌دیدی، دروغ بود، زیرا امر را بر خلاف آنچه در نفس خود هست، دیده‌ای. پس تو آن را جز با چشم خیال در حال بیداری ندیدی، هرچند خودت متوجه آن نباشی. و در نفس‌الامر نیز چنین است، زیرا خداوند در آنچه می‌داند صادق است و آن در خیال صدق است، همان‌گونه که تو آن را دیدی. همچنین است دریافت علوم از خداوند با ضربه زدن با دست؛ پس علم ضرب‌ها با آن ضربه، علم اولین و آخرین است. و علم جز با تعلیم از طریق خطاب معلم یا با خلق ضرورتی در نفس حاصل نمی‌شود. و این در حضرت خیال (الخيال) با ضربه حاصل شده است. پس ناگزیر است که ضربه، متخیّل باشد و مضروب در عین خود متخیّل باشد، چه در خواب باشد و چه در بیداری، به دلیل صدق کسی که آن را می‌بیند و او خداوند است. چنانکه خداوند متعال فرمود: **يُخَيَّلُ إِلَيْهِ من سِحْرِهِمْ أَنَّها تَسْعى‏** (به نظرش می‌آمد که از سحرشان آن ریسمان‌ها می‌دوند)، در حالی که در نفس‌الامر نمی‌دویدند.\n\nو بدین‌سان، هر آنچه را که بر خلاف آنچه در نفس خود هست می‌بینی، جز با چشم خیال (الخيال) نمی‌بینی تا صدق باشد. و به همین دلیل، هر آنچه از این قبیل رخ داده است، تعبیر می‌شود؛ یعنی تعبیرکننده به واسطه‌ی آن به معنایی که خداوند از آن صورت اراده کرده است، عبور می‌کند. پس از چنین علمی غافل مشو و میان چشم‌ها فرق بگذار. و بدان که بر این کار قادر نیستی مگر با نیرویی الهی که خداوند به هر کس از بندگانش که بخواهد عطا می‌کند. پس برای تحصیل آن از خداوند تلاش کن. زیرا تو از آنچه دیده‌ای خبر می‌دهی که آن را با حس خود دیده‌ای، در حالی که امر چنین نبوده است. پس در عبارت‌پردازی آنچه می‌بینی، دقت کن، همان‌گونه که مصنف انجام می‌دهد. آیا نمی‌بینی که اگر صحابه حق نظر صحیح را ادا می‌کردند و حق مراتب را می‌دادند، در مورد جبرئیل علیه السلام نمی‌گفتند که او دحیه کلبی است؟ بلکه می‌گفتند: اگر روحانی‌ای متجسد نباشد، پس دحیه کلبی است که او را با چشم حسی درک کردیم. پس آن‌ها دقت نکردند و حق امر الهی را ادا ننمودند. آن‌ها صادقانی هستند که صدق نکردند. پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به آن‌ها فرمود: «او جبرئیل است». در آن هنگام دانستند چه دیده‌اند و با چه دیده‌اند. همان‌گونه که در مورد او گفتند، هنگامی که به صورت اعرابی‌ای که برایشان ناشناس بود، تمثل یافت و آمد تا دینشان را به مردم بیاموزد. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «آیا می‌دانید پرسشگر کیست؟» گفتند: «الله و رسولش داناترند»، زیرا او در صورتی ناشناس برایشان ظاهر شده بود. پس به آن‌ها فرمود: «این جبرئیل است».\n\nاگر این حدیث پس از حدیث دحیه باشد، قول آن‌ها که «الله و رسولش داناترند» این احتمال را دارد که منظورشان احتمال معنا یا صورت روحانی بوده، یا اینکه در نفس‌الامر انسانی باشد. و اگر این حدیث اول باشد، نادانسته‌اند که او انسان است، اما نام او و اینکه به کدام قبیله از اعراب منتسب است را نادانسته‌اند. پس بیننده نمی‌داند که آنچه را درک کرده، با چشم خیال (الخيال) درک کرده است، مگر اینکه بداند مدرَک چیست. و در هستی (الوجود) هیچ شبهه‌ای بزرگ‌تر از التباس خیال (الخيال) با حس نیست. زیرا اگر انسان در این نظر متمکن شود، در علوم ضروری شک می‌کند، و اگر متمکن نشود، برخی امور را در غیر منزلت خود قرار می‌دهد. پس هنگامی که خداوند به او نیروی تفصیل دهد، برای او امور را آشکار می‌سازد که با کدام چشم آن‌ها را دیده است. پس هنگامی که چشم بیننده را از خود بشناسد، می‌داند که آن امور چیست. پس این علم بر اهل علم بالله تأکید شده است. و بسیاری از اهل الله به آنچه ذکر کردیم توجه نمی‌کنند. اگر علم او به خوابش نبود که آنچه را دیده در حال خواب دیده است، نمی‌گفت که آن خیال است. پس چه بسیار که در حال بیداری چنین چیزی می‌بیند و می‌گوید که محسوس را با حس خود دیده است. آیا نمی‌بینی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در صدق رؤیای خود، هر حالی که در جسدش بر او عارض می‌شد، هنگامی که می‌خوابید، آن حال به صورت مجسد برایش ظاهر می‌شد؟ پس بر محسوس خود حکم می‌کند به آنچه از صورت متخیّل دانسته است. در مورد وضو به او گفته شد، هنگامی که خوابید و خرناس کشید، و وضو نگرفت و با همان وضویی که خوابیده بود نماز خواند: «چشمانم می‌خوابند، اما قلبم نمی‌خوابد». می‌گوید: هنگامی که به عالم خیال (الخيال) منتقل شد و صورت خود را در آنجا دید، در حالی که با طهارت خوابیده بود، ندید که آن صورت، چیزی را که موجب وضو شود، حادث کرده باشد. پس دانست که بر جسد محسوس او چیزی که وضوی او را باطل کند، عارض نشده است. به همین دلیل می‌گوییم خواب سبب حدث است، نه خود حدث. پس کسی که این مقام برایش حاصل شده و دارای این صفت باشد و با طهارت بخوابد و خود را در خواب ببیند، باید به آن صورت مرئی که عین اوست بنگرد. اگر احساس حدث کرد، آن حدث در آن صورت رخ نمی‌دهد مگر اینکه در جسد خفته‌اش حادث شود؛ یعنی چیزی از او خارج شود که وضو را باطل کند، یا عین آن حدوث باشد و یا صورت تعریفی باشد که او محدث شده است، پس هنگامی که از خواب برخاست وضو بگیرد. زیرا برخی از احداث در خواب اثری در جسد خفته دارند، مانند احتلام در بعضی اوقات، و مانند کسی که می‌بیند ادرار می‌کند و در بسترش ادرار می‌کند، پس بیدار می‌شود و در حس می‌یابد که آنچه در خواب دیده، واقع شده است. و گاهی اثری از آن نمی‌یابد، پس این تنبیهی است برای او که محدث شده است. این امر برای علمای دارای این صفت عارض می‌شود. و چنین چیزی برای شیخ نابینا ابوالربیع المالقی، شیخ ابوعبدالله القرشی در مصر، رخ می‌داد. او به ویژه روز دوشنبه، هنگامی که می‌خوابید، چشمانش می‌خوابیدند اما قلبش نمی‌خوابید. این بابی است گسترده، که نزد علمای رسوم (ظاهر) و نیز نزد حکمایی که گمان می‌کنند حکمت را دانسته‌اند، معتبر نیست، در حالی که علم به عظمت این مرتبه بر سایر مراتب از آن‌ها فوت شده است و نزد آن‌ها قدر و منزلتی ندارد. پس قدر و نیروی سلطان آن را جز خداوند و سپس اهل آن، از پیامبر یا ولی مختص، نمی‌داند. غیر از این دو، کسی قدر این مرتبه را نمی‌داند. و علم به آن، اولین مقامات نبوت است. به همین دلیل، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که صبح می‌شد و در مجلس خود میان اصحابش می‌نشست، به آن‌ها می‌فرمود: «آیا کسی از شما رؤیایی دیده است؟» و این برای آن بود که ببیند خداوند دیشب چه چیزی در عالم حادث کرده یا در آینده حادث خواهد کرد، و آن را به این بیننده در خوابش وحی کرده است، یا وحی صریح یا وحی در صورتی که بیننده آن را می‌داند اما نمی‌داند چه چیزی از آن اراده شده است، پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را بر اساس آنچه خداوند اراده کرده، تعبیر می‌نماید. پس این از توجه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به این مرتبه‌ی ناشناخته نزد علما بود. و چه نیکو است تنبیه خداوند به خردمندان از بندگانش و اهل اعتبار، آنجا که فرمود: **هُوَ الَّذِي يُصَوِّرُكُمْ في الْأَرْحامِ كَيْفَ يَشاءُ** (اوست که شما را در رحم‌ها هرگونه که بخواهد صورت می‌بخشد). پس از رحم‌ها، آنچه خیال (الخيال) است، وجود دارد، و خداوند متخیّلات را در آن هرگونه که بخواهد صورت می‌بخشد، از طریق نکاح معنوی و حمل معنوی. خداوند در آن رحم، معانی را در هر صورتی که بخواهد، می‌گشاید و ترکیب می‌کند. پس اسلام را در آن به تو نشان می‌دهد، و قرآن را به صورت روغن و عسل، و قید را به صورت ثبات در دین، و دین را به صورت پیراهنی بلند و یا کوتاه، زره و یا جامه، پاک و یا آلوده، بسته به حال بیننده یا کسی که رؤیا برای او دیده می‌شود. و من برای قاضی دمشق، هنگامی که قضاوت دمشق را بر عهده گرفت، و او شمس‌الدین احمد بن مهذب‌الدین خلیل الجونی بود، که خداوند او را موفق بدارد و با فرشتگانش یاری کند و در احکامش حفظ نماید، دیدم که گوینده‌ای در خواب به او می‌گفت: «خداوند بر تو جامه‌ای پاک و بلند پوشانده است، پس آن را آلوده مکن و کوتاه مساز». و بیدار شدم و آن را برایش ذکر کردم. پس خداوند او را از کسانی قرار دهد که وصیت الهی را حفظ کردند. پس خیال (الخيال) از جمله‌ی رحم‌هایی است که صور در آن ظاهر می‌شوند. و چون این حضرت خیالیه (الحضرة الخيالية) معانی را به صورت پذیرفت، خداوند در مورد آن فرمود: **زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَواتِ من النِّساءِ** (دوست داشتن شهوات از زنان برای مردم آراسته شده است)، یعنی در زنان. پس صورت حب را صورتی آراست که برای هر کس از بندگانش که خواست، آن را آراست. پس آن را به ذات خود دوست داشت، نه به غیر آن، زیرا خداوند جز حب شهوت را در آنچه ذکر کرد، برای او نیاراست. پس حب مطلق برای او آراسته شد، سپس آن را به شهوت در آنچه ذکر کرد، معلق ساخت، و برای هر کس که خواست، در شهوت نیز در امر دیگری معلق ساخت. و شهوت را ذکر کرد، زیرا آن صورتی طبیعی است. زیرا خیال (الخيال) را طبیعت محدود کرده است، سپس خیال بر آن حکم می‌کند و هرگاه بخواهد آن را مجسد می‌سازد. پس این فرعی است که بر اصل خود حکم می‌کند، زیرا فرعی کریم است که خداوند وجودی عظیم‌تر از آن در منزلت و حکمی فراگیرتر که حکمش در تمام موجودات و معدومات، از محل‌ها و غیر آن، جاری شود، نیافریده است. پس در آنچه قدرت الهی ایجاد کرده، وجودی عظیم‌تر از خیال (الخيال) نیست. پس قدرت الهی و اقتدار الهی به واسطه‌ی آن ظاهر شد، و به واسطه‌ی آن **كَتَبَ عَلى‏ نَفْسِهِ الرَّحْمَةَ** (رحمت را بر خود واجب ساخت) و امثال آن را، و عمومیت را واجب کرد. و آن حضرت مجلای الهی در قیامت و در اعتقادات است. پس آن بزرگ‌ترین شعائر خداوند بر خداوند است. و از نیروی حکم سلطان آن، چیزی است که حکما آن را اثبات می‌کنند، با وجود اینکه آنچه را گفته‌اند نمی‌دانند و حق آن را ادا نمی‌کنند. و آن این است که خیال (الخيال)، اگرچه از طبیعت است، اما به واسطه‌ی نیروی الهی که خداوند آن را تأیید کرده است، سلطانی عظیم بر طبیعت دارد. پس اگر انسان بخواهد فرزندش نجیب شود، هنگام آمیزش با همسرش، صورت هر یک از علمای بزرگ را که می‌خواهد، در نفس خود حاضر کند. و اگر بخواهد امر آن را محکم کند، آن صورت را در شکلی که به او منتقل شده یا مصور آن را دیده است، تصور کند و برای همسرش زیبایی آن صورت را یادآوری کند. و اگر مصور آن را تصور کند، باید آن را به صورت زیبایی علم و اخلاقش تصور کند. و اگر صورت محسوس او زشت‌منظر باشد، آن را جز به صورت نیکو، به اندازه‌ی زیبایی علم و اخلاقش، تصور نکند. گویی آن معانی را مجسد می‌سازد و آن صورت را برای همسرش و برای چشم خود هنگام جماع حاضر می‌کند و در نگریستن به زیبایی آن، تمام نیروی خود را به کار می‌برند. اگر زن از آن جماع حامله شود، آنچه از آن صورت در نفس تخیل کرده‌اند، در آن حمل اثر می‌گذارد، و مولود ناگزیر با آن منزلت خارج می‌شود. حتی اگر چنین خارج نشود، به دلیل امری است که هنگام نزول نطفه در رحم، در نفس والدین عارض شده و آن امر، آن‌ها را ناخودآگاه از مشاهده‌ی آن صورت در خیال (الخيال) خارج کرده است. و عوام از آن به «توحم زن» تعبیر می‌کنند. و گاهی به طور اتفاقی هنگام آمیزش، صورت سگ یا شیر یا حیوانی در نفس یکی از زوجین یا هر دو رخ می‌دهد، پس فرزند حاصل از آن آمیزش، در اخلاق خود به صورت آنچه از تخیل آن حیوان برای والدین رخ داده است، خارج می‌شود، حتی اگر اختلاف داشته باشند. و در فرزند، صورت آنچه پدر تخیل کرده و صورت آنچه مادر تخیل کرده، ظاهر می‌شود، حتی در حس ظاهر، در زیبایی یا زشتی. و آن‌ها با وجود معرفت به این سلطان، در کسب علوم الهی به آن توجهی نمی‌کنند، زیرا به دلیل جهلشان، به چیزی طمع می‌ورزند که مطمع نیست، و آن تجرد از مواد است. و این هرگز رخ نمی‌دهد، نه در دنیا و نه در آخرت. پس آن امر، یعنی تجرد از مواد، تعقل می‌شود اما مشاهده نمی‌گردد. و برای اهل نظر، غلطی بزرگ‌تر از این نیست، و آن‌ها از غلط خود آگاه نیستند و گمان می‌کنند که در حال تحصیل هستند، در حالی که در فوت شده‌اند. پس عمر خود را در تحصیل چیزی که برایشان حاصل نمی‌شود، سپری می‌کنند. به همین دلیل، هیچ عقلی از حکم وهم و هیچ خیالی (الخيال) از آن سالم نمی‌ماند. و آن در عالم ملائکه و ارواح، امکان است. پس هیچ روح و هیچ عالم باللهی از امکانی که در هر آنچه مشاهده می‌کند برایش رخ می‌دهد، سالم نمی‌ماند. زیرا حقیقت هر آنچه جز خداوند است، از ذات خود امکان است. و شیء از حکم خود زایل نمی‌شود. پس آنچه را می‌بیند، از قدیم و حادث، جز به نفس خود نمی‌بیند، پس امکان پیوسته همراه اوست. و جز کسی که امر را بر آنچه هست می‌داند، به آن آگاه نمی‌شود. پس تجرید را به صورت وهم تعقل می‌کند، اما در نفس خود بر آن قادر نیست، زیرا در آنجا ضعفی نیست. در اینجا پای بسیاری لغزیده است، مگر اهل الله خاصه، زیرا آن‌ها این را با اعلام خداوند دانسته‌اند. آیا به زکریا علیه السلام نمی‌نگری، هنگامی که وارد محراب مریم شد، در حالی که او بتول و محرره بود، و زکریا این را می‌دانست و نزد او رزقی دید که خداوند به او داده بود. پس در آن هنگام از خداوند خواست که به او فرزندی ببخشد، هنگامی که عاشق حال او شد. پس گفت: **رَبِّ هَبْ لِي من لَدُنْكَ** (پروردگارا، از نزد خود به من ببخش)، یعنی از نزد خودت، نزدیکی رحمت و نرمی و عطوفت، **ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعاءِ** (فرزندی پاکیزه، همانا تو شنونده‌ی دعایی). و مریم در خیال (الخيال) او بود، از حیث مرتبه‌اش و آنچه خداوند از اختصاص به عنایت الهی به او داده بود. **فَنادَتْهُ الْمَلائِكَةُ وهُوَ قائِمٌ يُصَلِّي في الْمِحْرابِ** (پس فرشتگان او را ندا دادند، در حالی که او ایستاده در محراب نماز می‌خواند)، زیرا هنگامی که نزد او رزق یافت، وارد محراب او شد. **أَنَّ الله يُبَشِّرُكَ بِيَحْيى‏ مُصَدِّقاً بِكَلِمَةٍ من الله وسَيِّداً** (که خداوند تو را به یحیی بشارت می‌دهد، تصدیق‌کننده‌ی کلمه‌ای از جانب خدا و سید). و سید همان کمال است، زیرا مریم کامل شد، پس یحیی با نبوت کامل شد. و **حَصُوراً** (حصور)، و او کسی است که خداوند او را از مباشرت زنان بازداشته است، که نزد ما عنّین است، همان‌گونه که مریم را از مباشرت مردان بازداشت، و او بتول است. پس یحیی علیه السلام مانند حنه‌ی مریم، از زنان دوری می‌کرد، زیرا مریمِ منقطع از مردان، نامش حنه است و مریم لقب اوست که به دلیل آنچه پیش‌تر ذکر کردیم، به آن وصف شد. پس بنگر که سلطان خیال (الخيال) زکریا چه اثری در پسرش یحیی علیه السلام گذاشت، هنگامی که نیروی زکریا در زیبایی حال مریم علیه السلام، به دلیل منزلتی که خداوند به او داده بود، به نهایت رسید. و **نَبِيًّا من الصَّالِحِينَ** (و پیامبری از صالحان). پس او هرگز خداوند را عصیان نکرد. و این همان چیزی است که همه‌ی انبیا طلب کردند که خداوند آن‌ها را به رحمت خود در بندگان صالحش داخل کند، و آن‌ها کسانی هستند که هرگز معصیت بزرگ یا کوچکی از آن‌ها سر نزده است. و من چیزی عجیب‌تر از حال زکریا علیه السلام ندیدم، و کسی را ندیدم که سلطان انسانیت در او مانند او ظاهر شده باشد. او کسی است که می‌گوید: **هَبْ لِي من لَدُنْكَ ذُرِّيَّةً طَيِّبَةً** (از نزد خود فرزندی پاکیزه به من ببخش). پس سؤال نکرد مگر اینکه وقوع را تصور کرد. و نه با قولش: **رَبِّ أَنَّى يَكُونُ لِي غُلامٌ وقَدْ بَلَغَنِيَ الْكِبَرُ وامْرَأَتِي عاقِرٌ** (پروردگارا، چگونه برای من پسری خواهد بود، در حالی که پیری به من رسیده و همسرم نازا است؟). پس این حالت کجا و آن حالت کجا؟ اگر قرینه‌ی حالی نبود که او را وادار به گفتن چنین چیزی کند، تا در وحی به او گفته شود: **كَذلِكَ الله يَفْعَلُ ما يَشاءُ** (خداوند این‌گونه هر چه بخواهد انجام می‌دهد)، پس قصد او اعلام خداوند به این امر بود تا دیگران بدانند که **إِنَّ الله يَفْعَلُ ما يَشاءُ** (همانا خداوند هر چه بخواهد انجام می‌دهد) در مورد عادتی که آن را می‌شکند، همان‌گونه که واقع شد. و اگر آن قول از نفس او بود، انسانیت نیروی خود را به او داده بود. زیرا انسان به ذات خود، همان‌گونه که خداوند در کتابش ذکر کرده است، چنین است. خداوند او را در هیچ موضعی ذکر نکرده، مگر اینکه هنگام ذکر او، صفت نقصی را ذکر کرده که بر خلاف آنچه برای آن خلق شده، دلالت دارد. زیرا خداوند انسان را در **أَحْسَنِ تَقْوِيمٍ** (بهترین ساختار) آفرید، و آن این است که او را آفرید، سپس او را به **أَسْفَلِ سافِلِينَ** (پست‌ترین پستی‌ها) بازگرداند تا برای او ترقی به سوی آنچه خداوند برای آن خلقش کرده، ممکن شود، تا ثنا بر او به واسطه‌ی ترقی‌ای که از او ظاهر می‌شود، واقع گردد. پس برخی از مردم در همان اسفل سافلین که به آن بازگردانده شد، باقی ماندند. و او به آن بازگردانده شد، زیرا از آن خلق شده بود، وگرنه بازگرداندن او صحیح نبود. و منظور از اسفل سافلین جز حکم طبیعت نیست که از آن نشأت گرفت، هنگامی که خداوند صورت جسد و روح مدبر آن را ایجاد کرد. پس او را به اصل آنچه از آن خلق کرده بود، بازگرداند. پس در ابتدا جز به طبیعت خود و آنچه جسدش را اصلاح می‌کند، ننگریست. و او کجا و قول «بله» از روی معرفت (المعرفة) صحیح کجا؟\n\n### [اینکه در حضرت خیال در دنیا، حق محل تکوین بنده است]\n\nو بدان که در حضرت خیال (الخيال) در دنیا، حق (الحق) محل تکوین بنده است. هیچ خاطری در مورد امری به ذهن او خطور نمی‌کند، مگر اینکه حق (الحق) آن را در این حضرت تکوین می‌بخشد، مانند تکوین اعیان ممکنات (الممكنات) هنگامی که هر چه از آن‌ها بخواهد، اراده کند. پس مشیت بنده در این حضرت، از مشیت حق (الحق) است. زیرا بنده چیزی نمی‌خواهد مگر اینکه خداوند بخواهد. پس حق (الحق) چیزی نخواسته مگر اینکه بنده در دنیا بخواهد. و برخی از آنچه بنده در دنیا می‌خواهد، در حس واقع می‌شود. اما در خیال (الخيال)، مانند مشیت حق (الحق) در نفوذ است. پس حق (الحق) در این حضرت با بنده است بر هر آنچه بنده می‌خواهد، همان‌گونه که در آخرت در عموم حکم مشیت چنین است. زیرا باطن انسان در آخرت، ظاهر اوست. به همین دلیل، هر چیزی که آرزو کند، از مشیت او تکوین می‌یابد. پس حق (الحق) در تصریف انسان در این حضرت در دنیا و در شهوت او در آخرت است، نه در دنیا به صورت حسی. پس حق (الحق) در این حضرت و در آخرت، تابع شهوت بنده است، همان‌گونه که بنده در مشیت خود تحت مشیت حق (الحق) است. پس حق (الحق) شأنی جز مراقبت بنده ندارد تا هر آنچه بنده می‌خواهد ایجاد کند، در این حضرت در دنیا و همچنین در آخرت، برای او ایجاد کند. و بنده در صور تجلی (التجلی) تابع حق (الحق) است. پس حق (الحق) در هیچ صورتی بر او تجلی نمی‌کند، مگر اینکه بنده به آن رنگ می‌پذیرد. پس او در صور متحول می‌شود به دلیل تحول حق (الحق)، و حق (الحق) در ایجاد متحول می‌شود به دلیل تحول مشیت بنده در این حضرت خیالیه (الحضرة الخيالية) به ویژه در دنیا و به طور عموم در بهشت در آخرت. و هنگامی که خداوند همت‌های فعال در هستی (الوجود) در حس و همت‌های غیر فعال در هستی در حس را آفرید، به واسطه‌ی آن، تفاضل در همت‌ها ظاهر شد، همان‌گونه که تفاضل در همه‌ی اشیا، حتی در اسماء الهی، ظاهر شد. و همت‌های فعال در دنیا ممکن است در همت‌های غیر صاحبانشان تأثیر بگذارند و ممکن است تأثیر نگذارند، مانند قول خداوند در مورد آنچه تأثیر نمی‌گذارد: **إِنَّكَ لا تَهْدِي من أَحْبَبْتَ** (همانا تو کسی را که دوست داری هدایت نمی‌کنی). پس برخی از همت‌های فعال و منفعل ممکن است تحت تأثیر همت فعال قرار نگیرند. پس کسی که می‌خواهد از او امری را اراده کند، او آن را اراده نمی‌کند، زیرا همت‌ها به دلیل جنسیت با هم مقابله می‌کنند، به همین دلیل ممکن است در آن‌ها تأثیر نگذارند. اما هنگامی که به غیر جنس تعلق یابد، هر همت فعالی ناگزیر تأثیر می‌گذارد. اما در جنس خود، یعنی در همت‌ها، ممکن است برخی از همت‌ها تحت تأثیر آن قرار گیرند و برخی قرار نگیرند. و این در مورد رسولان علیهم السلام و پیروانشان ظاهر شد. رسول از شخصی می‌خواهد که اسلام را اراده کند، پس او اراده می‌کند و مسلمان می‌شود. و از دیگری می‌خواهد که اسلام را اراده کند، اما او اراده نمی‌کند. اگر همت رسول به حرکت دادن زبان‌ها به شهادت توحید، بدون اراده‌ی گوینده‌ی آن، تعلق می‌گرفت، به طور عموم واقع می‌شد، اما برای صاحبش سودی نداشت، اگرچه برای زبانش سودمند بود. زیرا زبان او هرگز از حیث نفس خود، خداوند را عصیان نکرده است، بلکه مخالفت در آن رخ داده است، نه از جانب او، بلکه از حرکت کسی که می‌خواهد آن را حرکت دهد. پس او مجبور است، زیرا به او قدرت دفع از خود داده نشده است، چون از آلات نفس است. پس او از ذات خود مطیع است. و اگر خداوند گوش صاحبش را باز می‌کرد، زبان ذاتی سخن می‌گفت، هنگامی که نفس آن را وادار می‌کرد که به مخالفت با آنچه شرع خواسته است، سخن بگوید، مبهوت می‌شد. به همین دلیل گفتیم که مخالفت در آن به دلیل جبر ظاهر شده است، نه از جانب او. زیرا او بالذات مطیع است و شاهد عدل بر حرکت‌دهنده‌ی خود است، چنانکه وارد شده است: **يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ بِما كانُوا يَعْمَلُونَ** (روزی که زبان‌ها و دست‌ها و پاهایشان بر ضد آن‌ها به آنچه انجام می‌دادند، شهادت می‌دهند). و همچنین است هر جارحه‌ی تصرف شده‌ای از گوش و چشم و فؤاد و پوست و عصب و فرج و نفس و حرکت.\n\n> و مردم در غفلت‌اند از آنچه برایشان اراده شده *** و در کوری‌اند از آنچه بر آن کور شده‌اند.\n\nپس انسان از حیث نشأت طبیعی خود و از حیث نشأت نفس ناطقه‌ی خود، با انفراد هر نشأت از دیگری، سعادتمند است. و با مجموع، مخالفت ظاهر شد. و عین مخالفت جز تکلیف نیست. پس هنگامی که تکلیف برداشته شود، حکم به مخالفت نیز برداشته می‌شود و جز موافقت دائمی و اطاعت مستمر ممکن از واجب باقی نمی‌ماند، همان‌گونه که در نفس‌الامر در وقت مخالفت، مطیع مشیت و مخالف امر واسطه است، به دلیل حسدی که در جنس وجود دارد. و در این منزل از علوم، علم توحید حق (الحق) و تصدیق خبردهندگان از حق (الحق) وجود دارد، که آن‌ها مترجمان و سفیران از بشر و ملک و خاطر هستند. و علم فرقان (تمییز) با علم به آنچه اشیا به واسطه‌ی آن متمایز شده‌اند، وجود دارد. و این همان علم توحید عالم است که در هر یک از افراد عالم جاری است. و علم کشف (الکشف) الهی در آن است. و در آن علم تناسلی است که در دنیا و آخرت قطع نمی‌شود. و در آن علم حضرتی است که در آن تشبیه میان اشیا و اشتراک در صورت رخ داده است. و در آن علم آنچه حق (الحق) در علم به آن منفرد است، بدون خلق، وجود دارد، که خلق آن را نمی‌دانند مگر با اعلام خداوند. و در آن علم میل و استقامت است. و در آن علم جمع برای تفصیل است. و در آن علم عوائد است که به چه چیزی بازمی‌گردند. و در آنجا تکراری نیست، در حالی که اعاده تکرار است. پس امر مشکل است و سبب اشکال آن، ذکر حق (الحق) از عادت و اعاده است. و کشف (الکشف) عدم اعاده در کون را می‌دهد، نه اعاده در نشأت آخرت را. زیرا آن اعاده، حکم الهی در حق امری خاص است، به منزله‌ی کسی که از خانه‌ای خارج شده و سپس به آن بازگشته است. پس خانه همان خانه است و خارج شده همان داخل شده است. و در آنجا جز انتقال در احوال نیست، نه ظهور اعیان، با وجود صحت اطلاق این که خارج شده از خانه به خانه‌اش بازگشته است. پس ما متعلق اعاده را دانستیم. و در آن علم برتری دادن به واسطه‌ی دار است. و در آن علم نعوت اهل الله است. و در آن علم آنچه حق (الحق) و عالمِ عالم بالله در آن مشترک هستند، وجود دارد. و در آنجا جز عالم بالله نیست. با این حال، برخی از علما می‌دانند که عالم بالله هستند و برخی از مردم نمی‌دانند که عالم بالله هستند. و او به کسی که مشاهده و معاینه می‌کند، علم دارد، اما نمی‌داند که او حق (الحق) است. پس اگر از او بپرسی: آیا خداوند را می‌شناسی؟ می‌گوید: نه. اگر از او در مورد آنچه مشاهده کرده بپرسی: آیا این را که مشاهده کرده‌ای، از حیث آنچه برای تو مشهود است، می‌شناسی؟ می‌گوید: بله. به او گفته می‌شود: پس او کیست؟ می‌گوید: این همان است که مشاهده می‌کنم. به او گفته می‌شود: پس به چه کسی گفته می‌شود؟ می‌گوید: نمی‌دانم. پس هنگامی که به او گفته شود: او چنین است، یعنی او فلان است، با اسمی که او را با آن می‌شناسد، اما او ندانسته که این مشهود، مسمای آن اسم است. پس او جز حمل این اسم بر این مشهود را نادانسته است. پس او به علم اسم و به علم مشهود، از حیث آنچه برای او مشهود است، موصوف بوده است. و جز این فایده‌ای نبرده که این مشهود، مسمای آن اسم معلوم است. و در آن علم انقیاد خلق برای حق (الحق) است، و اینکه آن نتیجه‌ی انقیاد حق (الحق) برای خلق است، به دلیل طلب ممکن از واجب. پس واجب در آنچه ممکن طلب کرد، برای او انقیاد کرد و آن را ایجاد نمود، در حالی که چیزی نبود. و در آن علم سبب اختلاف واقع شده در عالم است، همراه با علم به آنچه موجب رفع اختلاف می‌شود. پس چه چیزی بر علم با وجود نیروی سلطانش حکم کرده است؟ و در آن علم اغترار (فریب خوردن) و سبب آن که آن را ظاهر کرده است، وجود دارد. و در آن علم چیستی عمل و کسب و فرق میان کسب و اکتساب است، زیرا خداوند کسب را از اکتساب با «لام» و «علی» متمایز کرده است، پس فرمود: **لَها ما كَسَبَتْ وعَلَيْها ما اكْتَسَبَتْ** (آنچه کسب کرده به سود اوست و آنچه اکتساب کرده به زیان اوست). و در آن علم اختیار الهی است. و در آن علم این است که چه زمانی به ضد استناد می‌شود، پس ضد برای ضد خود رحمت است، با وجود اینکه بالطبع دشمن اوست. و در آن علم منع از خوض در خداوند است. و در آن علم احاطه به اعمال، احاطه‌ی مشاهده است نه احاطه‌ی تلبس. و اینکه در کدام خزانه تا وقت شهودشان ذخیره شده‌اند و حکم آن‌ها پس از شهودشان در نفس خود و در آنچه از آن‌ها به عاملشان بازمی‌گردد، چیست. و در آن علم ما الحضرة التي تقلب الحقائق ولا تقلب نفسها وهي من جملة الحقائق (کدام حضرت است که حقایق را دگرگون می‌کند و خود را دگرگون نمی‌کند، در حالی که خود از جمله‌ی حقایق است) وجود دارد. و در آن علم مناسبات است. و در آن علم آنچه در حکم به آن رجوع می‌شود، که به قول متصف نیست، و با این حال در برخی از قضاوت‌ها فصل‌کننده است، و آن قرعه و امثال آن است. و در آن علم غایتی است که رسولان در این سرا از خداوند طلب می‌کنند. و در آن علم نیابت الهی در تکوین است. و در آن علم غریبی متعلق به محبت است، و آن زهد در محبوب به خاطر محبوب است، با وجود اتصاف به حب در مورد مزهود فیه و بقای آن وصف بر او. و در آن علم اعتصام است. و در آن علم بیاض و سواد (سفیدی و سیاهی) است، و برخی از اهل طریق تألیفی در این باره دارند که آن را «البیاض والسواد» نامیده‌اند. و در آن علم برتری امت‌ها بر یکدیگر و برتری این امت محمدیه (المحمدية) بر سایر امت‌ها است. و آیا کسی از امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) بوده که پیش از بعثت او، او را در کشف (الکشف) خود دیده و به او ایمان آورده و به اندازه‌ی آنچه از او برایش کشف شده، از او پیروی کرده است؟ و آیا کسی که این صفت را دارد، در امت او محشور می‌شود یا به تنهایی امتی محشور می‌شود؟ یا صاحب این کشف (الکشف) پیرو شریعت پیامبر خاصی مانند عیسی یا موسی یا یکی از رسولان علیهم السلام بوده است، و مشاهده کرده که شریعتی که آن پیامبر خاص آورده و او پیرو آن است، در آن نایب از محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است و آن شریعت، شریعت اوست، پس از آن پیروی کرده به این عنوان که شریعت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است و آن رسول، ابلاغ‌کننده‌ی آن چیزی است که از شریعت به واسطه‌ی او ظاهر شده است؟ آیا چنین کسی در امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) محشور می‌شود یا از امت آن پیامبر خواهد بود؟ سپس اگر قرار باشد در امت آن رسول محشور شود و سپس وارد بهشت شود و به منزلت او برسد، آیا آن را در منازل این امت محمدیه (المحمدية) به دست می‌آورد یا جز در منازل پیروان آن رسول و امت او فرود نمی‌آید؟ یا برای او در منازل آن رسول همراه با امتش، منازلی از حیث پیروی و منازلی همراه با امت محمدیه (المحمدية) از حیث پیروی از او به واسطه‌ی کشفی (الکشف) که پیش‌تر ذکر کردیم، وجود دارد؟ و در آن علم صحبت (همنشینی) است: چه کسی با صفت با تو همنشین می‌شود، چه کسی با وجه (وجه) با تو همنشین می‌شود، چه کسی برای تو با تو همنشین می‌شود، چه کسی برای نفس خود با تو همنشین می‌شود، و چه کسی برای خداوند با تو همنشین می‌شود. و چه کسی سزاوارتر به صحبت است، و چه کسی با خداوند همنشین می‌شود، و چه کسی مقام آن را دارد که همنشین باشد و با هیچ کس همنشین نشود. و فرق میان صحبت و مصاحبت. و در آن علم مقامات و احوال است. و در آن علم «نِعم» و «بِئس» است. و در آن علم جزا در دنیا است. و در آن علم اتصاف عالم به استفاده در آنچه به آن عالم است، وجود دارد. و در آن علم اصناف مقربین و درجات آن‌ها در قرب از هر امتی است. و در آن علم کسی که خداوند را می‌خواهد و کسی که غیر خداوند را می‌خواهد، و متعلق اراده چیست، و آیا کسی که می‌گوید خداوند را می‌خواهد، تصدیق می‌شود یا نه. و در آن علم التباس در مرگ و کسی که به دو ضد متصف شده است، وجود دارد. و در آن علم استدراج است. و در آن علم آنچه حق (الحق) از نعوت می‌پذیرد و شایسته نیست که به او نسبت داده شود، به دلیل اینکه در عرف و شرع صفت نقص در جناب الهی است، در حالی که در محدَث شرف و رفعت است، وجود دارد. و در آن علم فنونی از علوم است. و **والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 7
}