{
  "id": 81,
  "title": {
    "ar": "الباب الحادي والثمانون في ترك العزلة",
    "en": "Chapter Eighty-One: Concerning the Abandonment of Seclusion (العزلة)",
    "ur": "اکیاسیواں باب: عزلت (تنہائی) ترک کرنے کے بیان میں",
    "fa": "باب هشتاد و یکم در ترک عزلت"
  },
  "content": {
    "ar": "## (الباب الحادي والثمانون في ترك العزلة)\n\n\n> لا تفرحن بالاعتزال فإنه *** جهل وأين الله والأرواح‏\n\n\n> نور الإله أجل منك نفاسة *** ومع الجلال جليسه المصباح‏\n\n\n> لم يعتزل عن نور كون حادث *** وإلى التعلق ذاته ترتاح‏\n\n\n> لو أن نور الحق معتزل لما *** ظهر الوجود ودامت الأفراح‏\n\n\n> بالنور من فلك البهاء إذا بدا *** للناظرين أضاءت الأشباح‏\n\n\n### [مثير العزلة إنما هو خوف القواطع أو رجاء الوصلة]\n\n\nاعلم أيدنا الله وإياك أن مثير العزلة إنما هو خوف القواطع عن الوصلة بالجناب الإلهي أو رجاء الوصلة بالعزلة به لما كان في حجاب نفسه وظلمة كونه وحقيقة ذاته يبعثها على طلب الوصلة ما هي عليه من الصورة الإلهية كما يطلب الرحم الوصلة بالرحمن لما كانت شجنة منه‏\n\n\n### [ارتباط الكون بالله وصف ذاتى للكون‏]\n\n\nثم إن العبد رأى ارتباط الكون بالله ارتباطا لا يمكن الانفكاك عنه لأنه وصف ذاتي له وتجلى له في هذا الارتباط وعرف من هذا التجلي وجوبه به وأنه لا تثبت لمطلوبه هذه الرتبة إلا به وأنه سرها الذي لو بطل لبطلت الربوبية ورآه في كل شي‏ء مثل ما هو عنده ونسبة كل شي‏ء إليه كنسبته هو إليه فلم يتمكن له الاعتزال‏\n\n\n### [النور والمشكاة والمصباح‏]\n\n\nفتأدب مع قوله تعالى مَثَلُ نُورِهِ كَمِشْكاةٍ فِيها مِصْباحٌ أي صفة نوره صفة المصباح ولم يقل صفة الشمس فإن الإمداد في نور الشمس يخفى بخلاف المصباح فإن الزيت والدهن يمده لبقاء الإضاءة فهو باق بإمداد دهني من شجرة نسبة الجهات إليها نسبة واحدة منزهة عن الاختصاص بحكم جهة وهو قوله لا شَرْقِيَّةٍ ولا غَرْبِيَّةٍ وهذا الإمداد من نور السبحات الظاهرة من وراء سبحات العزة والكبرياء والجلال فما ينفذ من نور سبحات هذه الحجب هو نُورُ السَّماواتِ والْأَرْضِ ومثله كمثل المصباح والنور الذي في الدهن معلوم غير مشهود وضوء المصباح من أثره يدل عليه وعلى الحقيقة ما هو نور وإنما هو سبب لبقاء النور واستمراره فالنور العلمي منفر ظلمة الجهل من النفس فإذا أضاءت ذات النفس أبصرت ارتباطها بربها في كونها وفي كون كل كون فلم تر عمن تعتزل‏\n\n\n### [النشأتان الظاهرة والباطنة شاهدتان على النفس المدبرة]\n\n\nوجعل هذا النور في مشكاة وزجاجة مخافة الهواء أن يجيره ويشتد عليه فيطفيه فكان مشكاته وزجاجته نشأته الظاهرة والباطنة فإنهما من حيث هما عاصمان فإنهما من الذين يُسَبِّحُونَ بحمد الله اللَّيْلَ والنَّهارَ لا يَفْتُرُونَ وهما اللذان يشهدان على النفس المدبرة إذا أنكرت بين يدي الله فهما أهل عدالة قال تعالى شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وأَبْصارُهُمْ وهما من النشأة الباطنة وجلودهم وهي من النشأة الظاهرة فما من شخص يروم مخالفة حق إلا ونشأتاه تقولان له لا تفعل أيها الملك ولا تحوجنا أن نكون سببا في إهلاكك فإن الله إن استشهدنا شهدنا\n\n\nأ لا ترى الرسول صلى الله عليه وسلم لما بلغ وأنذر ووعد وأوعد قال لقومه إنكم لتسئلون عني فما أنتم قائلون قالوا نشهد أنك بلغت ونصحت وأديت فقال اللهم اشهد\n\n\nوقد سأل هود قومه مع شركهم فقال اشْهَدُوا أَنِّي بَرِي‏ءٌ مِمَّا تُشْرِكُونَ فاستشهدهم لعلمه أنهم لا بد أن يسألهم ونحن رعيتك ولا حركة لنا إلا بك فلا تحركنا إلا\nفي أمر يكون لك لا عليك والمحجوب غافل عن هذا غير سامع لصمم قام به من شدة الهواء الذي أصمه فالله يجعلنا ممن سمع نطق جوارحه بالموعظة قبل سماعه إياها بالشهادة إنه ولي جواد كريم ذُو الْفَضْلِ الْعَظِيمِ‏\n\n",
    "en": "## (Chapter Eighty-One: On Abandoning Seclusion)\n\nDo not rejoice in seclusion (الاعتزال), for it is *** ignorance. Where are Allah and the spirits (الأرواح)?\nThe Light of the God (الإله) is nobler than you in preciousness, *** and despite the Majesty (الجلال), its companion is the lamp (المصباح).\nIt did not seclude itself from the light of a contingent cosmos (كون حادث), *** and its Essence (ذاته) inclines toward connection (التعلق).\nIf the Light of the Real (الحق) were secluded, *** Existence (الوجود) would not have appeared, nor would joys have endured.\nBy the Light from the sphere of Splendor (فلك البهاء), when it appears *** to the observers, the forms (الأشباح) are illuminated.\n\n### [The Impetus for Seclusion is only the Fear of Obstacles or the Hope for Union]\n\nKnow, may Allah support us and you, that the impetus for seclusion (العزلة) is either the fear of obstacles (القواطع) preventing union (الوصلة) with the Divine Presence, or the hope for union through seclusion with Him. When the seeker is in the veil of his self, the darkness of his cosmos, and the reality of his essence, what compels him to seek union is the Divine Form (الصورة الإلهية) upon which he is constituted, just as the womb (الرحم) seeks connection with the All-Merciful (الرحمن) because it is derived from Him (شجنة منه).\n\n### [The Connection of the Cosmos to Allah is an Essential Attribute of the Cosmos]\n\nFurthermore, the servant perceives the connection of the Cosmos (الكون) to Allah as an inseparable bond, because this connection is an essential attribute (وصف ذاتي) of the Cosmos itself. The Real (الحق) manifests Himself (تجلى) to the servant within this very connection. Through this Theophany (التجلي), the servant recognizes the necessity of the Cosmos being bound to Him, and that the rank sought by the Cosmos cannot be established except through Him. He is the secret (سرها) of the Cosmos, such that if He were annulled, Lordship (الربوبية) itself would be annulled. The servant sees Him in everything just as He is present with the servant, and the relation of everything to Him is identical to the servant’s relation to Him. Therefore, seclusion (الاعتزال) is rendered impossible for him.\n\n### [The Light, the Niche, and the Lamp]\n\nBe mindful of His saying, the Exalted: <<مَثَلُ نُورِهِ كَمِشْكاةٍ فِيها مِصْباحٌ>> (The likeness of His Light is as a niche wherein is a lamp). This means that the description of His Light is the description of the lamp, and He did not say the description of the sun. For the sustenance (الإمداد) in the sun's light is hidden, unlike the lamp, where the oil and fat sustain it for the continuation of illumination. Thus, it persists by an oily sustenance from a tree whose relation to the directions is a single relation, purified from being specified by the rule of a direction, which is His saying: <<لا شَرْقِيَّةٍ ولا غَرْبِيَّةٍ>> (neither eastern nor western).\n\nThis sustenance comes from the light of the Veils (السبحات) that appear from behind the Veils of Might (العزة), Grandeur (الكبرياء), and Majesty (الجلال). What penetrates from the light of the Veils of these barriers is <<نُورُ السَّماواتِ والْأَرْضِ>> (the Light of the heavens and the earth). Its likeness is like the lamp. The light that is in the oil is known but not witnessed (غير مشهود). The glow of the lamp, which is its effect, indicates it. In reality, the oil itself is not light, but rather a cause for the persistence and continuation of the light.\n\nThus, the light of Knowledge (النور العلمي) dispels the darkness of ignorance from the soul (النفس). When the essence of the soul is illuminated, it perceives its connection to its Lord in its own existence and in the existence of every cosmos. Therefore, it sees no one from whom to seclude itself.\n\n### [The Outer and Inner Constitutions Bear Witness Against the Governing Soul]\n\nAnd He placed this Light in a niche (مشكاة) and a glass (زجاجة) for fear that the air might disturb it, intensify against it, and extinguish it. Thus, its niche and its glass are its Outer and Inner Constitutions (نشأته الظاهرة والباطنة). Insofar as they are protectors, they are among those who <<يُسَبِّحُونَ بحمد الله اللَّيْلَ والنَّهارَ لا يَفْتُرُونَ>> (glorify Allah with praise night and day, without tiring). They are the two that bear witness against the governing soul (النفس المدبرة) if it denies before Allah, for they are people of justice. Allah the Exalted said: <<شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وأَبْصارُهُمْ>> (Their hearing and their sight bore witness against them)—these are from the Inner Constitution—<<وجلودهم>> (and their skins)—this is from the Outer Constitution. There is no person who intends to violate a truth except that his two constitutions say to him: \"Do not do it, O King! Do not compel us to be the cause of your destruction, for if Allah calls upon us to testify, we shall testify.\"\n\nDo you not see that when the Messenger (peace and blessings be upon him) delivered the message, warned, promised, and threatened, he said to his people: \"You will surely be questioned about me. What will you say?\" They replied: \"We bear witness that you have delivered the message, advised sincerely, and fulfilled the trust.\" He then said: \"O Allah, bear witness!\"\n\nAnd Hud asked his people, despite their polytheism, saying: <<اشْهَدُوا أَنِّي بَرِي‏ءٌ مِمَّا تُشْرِكُونَ>> (Bear witness that I am innocent of what you associate [with Allah]). He called them to witness because he knew that they would inevitably be questioned. [The organs continue speaking:] \"We are your subjects, and we have no movement except through you, so do not move us except in a matter that is for your benefit, not against you.\" The veiled one (المحجوب) is heedless of this, not hearing due to the deafness caused by the intensity of the air that has deafened him. May Allah make us among those who hear the speech of their limbs giving counsel before hearing them bear witness. Indeed, He is a Protecting Friend, Generous, Noble, <<ذُو الْفَضْلِ الْعَظِيمِ>> (Possessor of Great Bounty).",
    "ur": "(اکیاسیواں باب: عزلت (تنہائی) ترک کرنے کے بیان میں)\n\nعزلت (تنہائی) پر خوش نہ ہو، کیونکہ یہ جہالت ہے، اور اللہ اور ارواح کہاں ہیں؟\nنور الٰہی تم سے زیادہ نفیس اور عظیم ہے، اور جلال کے ساتھ اس کا ہم نشین چراغ ہے۔\nوہ (نور) کسی حادث (عارضی) کونی نور سے الگ نہیں ہوا، اور اس کی ذات تعلق کی طرف مائل ہے۔\nاگر نور الحق (ذات حق کا نور) معتزل (الگ تھلگ) ہوتا، تو ہستی (الوجود) ظاہر نہ ہوتی اور نہ ہی مسرتیں باقی رہتیں۔\nجب نورِ بہاء (فلك البهاء) سے نور دیکھنے والوں کے لیے ظاہر ہوتا ہے، تو اجسام (الأشباح) روشن ہو جاتے ہیں۔\n\n### [عزلت کا محرک یا تو قواطع (رکاوٹوں) کا خوف ہے یا وصل کی امید]\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ عزلت (تنہائی) کا محرک دراصل یا تو بارگاہ الٰہی (الجناب الإلهي) سے وصل (الوصلة) میں حائل ہونے والی رکاوٹوں (القواطع) کا خوف ہے، یا پھر اس کے ذریعے وصل کی امید ہے۔ جب سالک اپنے نفس کے حجاب، اپنی کونی تاریکی اور اپنی ذات کی حقیقت میں ہوتا ہے، تو اس کی ذات کو وصل کی طلب پر وہ صورت الٰہیہ ابھارتی ہے جس پر وہ قائم ہے، جیسا کہ رحم (رشتہ داری) رحمن سے وصل کا طالب ہوتا ہے کیونکہ وہ اسی کی ایک شاخ (شجنة) ہے۔\n\n### [کائنات کا اللہ سے تعلق کائنات کی ذاتی صفت ہے]\n\nپھر بندے نے کائنات کا اللہ سے ایسا تعلق (ارتباط) دیکھا جس سے علیحدگی ممکن نہیں، کیونکہ یہ کائنات کی ذاتی صفت ہے۔ اور اس تعلق میں اس کے لیے ظہور الٰہی (التجلی) ہوا، اور اس ظہور الٰہی (التجلی) سے اس نے اس (اللہ) کے ساتھ کائنات کے وجوب کو پہچانا، اور یہ جانا کہ اس کے مطلوب (کائنات) کے لیے یہ مرتبہ اس (اللہ) کے بغیر ثابت نہیں ہو سکتا، اور وہ (اللہ) اس کا وہ راز ہے کہ اگر وہ باطل ہو جائے تو ربوبیت باطل ہو جائے گی۔ اور اس نے اسے (اللہ کو) ہر شے میں ویسا ہی دیکھا جیسا کہ وہ اس کے پاس ہے، اور ہر شے کی نسبت اس (اللہ) کی طرف ویسی ہی ہے جیسی اس (بندے) کی نسبت اس کی طرف ہے۔ لہٰذا اس کے لیے عزلت اختیار کرنا ممکن نہ رہا۔\n\n### [نور، طاق اور چراغ]\n\nپس اللہ تعالیٰ کے اس قول کے ساتھ ادب اختیار کرو:\n**مَثَلُ نُورِهِ كَمِشْكاةٍ فِيها مِصْباحٌ**\n(اس کے نور کی مثال ایسی ہے جیسے ایک طاق ہو جس میں چراغ ہو)\nیعنی اس کے نور کی صفت چراغ کی صفت ہے۔ اور یہ نہیں فرمایا کہ سورج کی صفت، کیونکہ سورج کے نور میں امداد پوشیدہ ہوتی ہے، برخلاف چراغ کے، کہ تیل اور روغن اسے روشنی کے باقی رہنے کے لیے مدد فراہم کرتے ہیں۔ پس وہ ایک روغنی امداد کے ذریعے باقی ہے جو ایک ایسے درخت سے ہے جس کی نسبت تمام جہات سے ایک جیسی ہے، اور وہ کسی ایک جہت کے حکم سے مخصوص ہونے سے پاک ہے، اور یہی اس کا قول ہے:\n**لَا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ**\n(نہ مشرقی ہے اور نہ مغربی)\nاور یہ امداد سبحاتِ عزت، کبریا اور جلال کے پردوں کے پیچھے سے ظاہر ہونے والے نورِ سبحات سے ہے۔ پس جو نور ان حجابات کی سبحات سے نفوذ کرتا ہے، وہی\n**نُورُ السَّمَاوَاتِ وَالْأَرْضِ**\n(آسمانوں اور زمین کا نور)\nہے۔ اور اس کی مثال چراغ کی سی ہے۔ اور جو نور تیل میں ہے وہ معلوم ہے مگر مشہود (دیکھا ہوا) نہیں، اور چراغ کی روشنی اس کے اثر سے اس پر دلالت کرتی ہے۔ اور حقیقت میں وہ (تیل) نور نہیں ہے، بلکہ وہ نور کے باقی رہنے اور اس کے تسلسل کا سبب ہے۔ پس علمی نور نفس سے جہالت کی تاریکی کو دور کرتا ہے۔ جب نفس کی ذات روشن ہو جاتی ہے تو وہ اپنی ہستی میں اور ہر ہستی کے وجود میں اپنے رب کے ساتھ اپنا تعلق (ارتباط) دیکھ لیتی ہے، لہٰذا وہ نہیں دیکھتی کہ کس سے عزلت اختیار کرے۔\n\n### [ظاہری اور باطنی دونوں نشأتیں تدبیر کرنے والے نفس پر گواہ ہیں]\n\nاور اس نور کو طاق (مشکاۃ) اور شیشے (زجاجہ) میں رکھا گیا تاکہ ہوا اسے گھیر کر اس پر شدت نہ کرے اور اسے بجھا نہ دے۔ پس اس کا طاق اور شیشہ اس کی ظاہری اور باطنی نشأتیں (پیدائشیں) ہیں۔ کیونکہ یہ دونوں اس حیثیت سے کہ وہ بچانے والے ہیں، ان لوگوں میں سے ہیں جو:\n**يُسَبِّحُونَ بِحَمْدِ اللَّهِ اللَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ**\n(رات دن اللہ کی حمد کے ساتھ تسبیح کرتے ہیں اور تھکتے نہیں)\nاور یہ دونوں ہی ہیں جو تدبیر کرنے والے نفس پر گواہی دیں گے جب وہ اللہ کے حضور انکار کرے گا۔ پس یہ دونوں اہل عدل ہیں۔ اللہ تعالیٰ نے فرمایا:\n**شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ**\n(ان پر ان کے کان اور ان کی آنکھیں گواہی دیں گی)\nاور یہ دونوں باطنی نشأۃ سے ہیں، اور\n**وَجُلُودُهُمْ**\n(اور ان کی کھالیں)\nاور یہ ظاہری نشأۃ سے ہے۔ پس کوئی شخص ایسا نہیں جو حق کی مخالفت کا ارادہ کرے مگر اس کی دونوں نشأتیں اسے کہتی ہیں: \"اے بادشاہ! ایسا نہ کر، اور ہمیں مجبور نہ کر کہ ہم تیری ہلاکت کا سبب بنیں، کیونکہ اگر اللہ ہم سے گواہی طلب کرے گا تو ہم گواہی دیں گے۔\"\nکیا تم نہیں دیکھتے کہ رسول اللہ صلی اللہ علیہ وسلم نے جب تبلیغ کی، ڈرایا، وعدہ کیا اور وعید سنائی، تو اپنی قوم سے فرمایا: \"تم سے میرے بارے میں ضرور پوچھا جائے گا، تو تم کیا کہو گے؟\" انہوں نے کہا: \"ہم گواہی دیتے ہیں کہ آپ نے پیغام پہنچا دیا، نصیحت کی اور حق ادا کر دیا۔\" تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"اللهم اشهد (اے اللہ! گواہ رہنا۔)\"\nاور ہود علیہ السلام نے اپنی مشرک قوم سے پوچھا تھا:\n**اشْهَدُوا أَنِّي بَرِيءٌ مِمَّا تُشْرِكُونَ**\n(تم گواہ رہو کہ میں ان چیزوں سے بری ہوں جنہیں تم شریک ٹھہراتے ہو)\nپس انہوں نے انہیں گواہ بنایا کیونکہ وہ جانتے تھے کہ ان سے ضرور پوچھا جائے گا۔ اور (یہ نشأتیں کہتی ہیں:) \"ہم تیری رعیت ہیں اور ہماری کوئی حرکت تیرے بغیر نہیں، پس ہمیں صرف اسی کام میں حرکت دے جو تیرے لیے ہو، نہ کہ تیرے خلاف۔\" اور محجوب (پردے میں رہنے والا) اس سے غافل ہوتا ہے، وہ نہیں سنتا کیونکہ اس ہوا کی شدت سے اس میں بہرا پن پیدا ہو گیا ہے جس نے اسے بہرا کر دیا۔ پس اللہ ہمیں ان لوگوں میں شامل کرے جنہوں نے اپنے اعضاء کی نصیحت آمیز گفتگو کو گواہی کے طور پر سننے سے پہلے سنا۔ بے شک وہ ولی، جواد، کریم اور\n**ذُو الْفَضْلِ الْعَظِيمِ**\n(عظیم فضل والا) ہے۔",
    "fa": "باب هشتاد و یکم در ترک عزلت\n\nبه گوشه‌نشینی شادمان مباش، زیرا آن نادانی است؛ و حق (الحق) و ارواح کجایند؟\nنور الهی از تو گرانبهاتر و والاتر است، و با جلال (الجلال) الهی، همنشینش چراغ است.\nاز نور هستیِ حادث (کون حادث) کناره نگرفته است، و ذاتش به تعلق (التعلق) آرام می‌گیرد.\nاگر نور حق (الحق) کناره‌گیر بود، هستی (الوجود) ظاهر نمی‌شد و شادی‌ها دوام نمی‌یافت.\nبا نور از فلک بهاء (درخشش)، هنگامی که بر ناظران آشکار شد، اجسام روشن گشتند.\n\n### [انگیزه عزلت، همانا ترس از موانع یا امید به وصل است]\n\nبدان، خداوند ما و شما را تأیید کند، که انگیزاننده عزلت (العزلة) همانا ترس از موانعی است که از وصل (الوصلة) به ساحت الهی جلوگیری می‌کنند، یا امید به وصل از طریق عزلت به اوست. زیرا [سالک] در حجاب نفس خود، و تاریکی هستی (الکون) خود، و حقیقت ذات خود بود. آنچه او را به طلب وصل برمی‌انگیزد، همان صورت الهی است که بر آن است، همان‌گونه که رَحِم (خویشاوندی) طلب وصل به رحمان را دارد، زیرا شاخه‌ای از اوست.\n\n### [ارتباط هستی با حق (الله)، وصف ذاتی هستی است]\n\nسپس بنده ارتباط هستی (الکون) با حق (الله) را ارتباطی دید که گسستن از آن ممکن نیست، زیرا آن وصف ذاتی برای هستی است. و حق (الحق) در این ارتباط بر او تجلی (التجلی) کرد، و از این تجلی (التجلی) دانست که هستی به او واجب است، و این مرتبه برای مطلوبش جز به واسطه او ثابت نمی‌شود، و او سرّ آن است که اگر باطل شود، ربوبیت (الربوبية) نیز باطل می‌گردد. و او را در هر چیزی دید، همان‌گونه که نزد اوست، و نسبت هر چیزی به او، مانند نسبت خود او به اوست. پس گوشه‌نشینی (الاعتزال) برای او ممکن نشد.\n\n### [نور، مشکات و مصباح]\n\nپس با این سخن خداوند متعال ادب ورز: مَثَلُ نُورِهِ كَمِشْكاةٍ فِيها مِصْباحٌ (مَثَل نور او چون چراغدانی است که در آن چراغی است). یعنی صفت نور او صفت چراغ است، و نگفت صفت خورشید. زیرا مدد در نور خورشید پنهان است، برخلاف چراغ؛ چرا که روغن و چربی آن را مدد می‌رساند تا روشنایی باقی بماند. پس آن [نور] به مدد روغنی از درختی باقی است که نسبت جهات به آن نسبتی واحد است و از اختصاص به حکم جهتی منزه است، و آن سخن اوست: لا شَرْقِيَّةٍ ولا غَرْبِيَّةٍ (نه شرقی است و نه غربی). و این مدد از نور سبحات (پوشش‌های نوری) است که از ورای سبحات (پوشش‌های) عزت و کبریا و جلال (الجلال) ظاهر می‌شوند. پس آنچه از نور سبحات این حجاب‌ها نفوذ می‌کند، همان نُورُ السَّماواتِ والْأَرْضِ (نور آسمان‌ها و زمین) است. و مَثَل آن مانند مَثَل چراغ است. و نوری که در روغن است، معلوم است اما مشهود (الشهود) نیست، و روشنایی چراغ از اثر آن است که بر آن دلالت می‌کند. و در حقیقت، آن [روغن] نور نیست، بلکه سببی برای بقای نور و استمرار آن است. پس نور علمی، تاریکی جهل را از نفس دور می‌کند. پس هنگامی که ذات نفس روشن شد، ارتباط خود را با پروردگارش در هستی (الکون) خود و در هستیِ هر هستی (کون کل کون) می‌بیند. پس نمی‌بیند که از چه کسی کناره‌گیری کند.\n\n### [دو نشأت ظاهری و باطنی بر نفس مدبر گواهی می‌دهند]\n\nو این نور را در چراغدان و شیشه قرار داد، از ترس اینکه هوا بر آن غلبه کند و شدت یابد و آن را خاموش سازد. پس چراغدان و شیشه آن، نشأت ظاهری و باطنی او بودند. زیرا آن دو از این جهت که نگهدارنده هستند [مهم‌اند]، چرا که آن دو از کسانی هستند که شب و روز به ستایش حق (الله) تسبیح می‌گویند و سستی نمی‌ورزند. و آن دو کسانی هستند که بر نفس مدبر (تدبیرکننده) گواهی می‌دهند، هنگامی که در پیشگاه حق (الله) انکار کند. پس آن دو اهل عدالت هستند. خداوند متعال فرمود: شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وأَبْصارُهُمْ (گوش‌ها و دیدگانشان بر ضد آنان گواهی دادند) و این دو از نشأت باطنی هستند، و جلودهم (پوست‌هایشان) که از نشأت ظاهری است. پس هیچ شخصی قصد مخالفت با حقی را ندارد، مگر اینکه دو نشأت او به او می‌گویند: ای فرمانروا، این کار را مکن، و ما را مجبور مکن که سببی برای هلاکت تو باشیم، زیرا اگر حق (الله) از ما گواهی بخواهد، گواهی خواهیم داد.\n\nآیا نمی‌بینی که رسول (صلی الله علیه و سلم) هنگامی که رسالت را ابلاغ کرد و انذار داد و وعده و وعید داد، به قومش فرمود: «شما درباره من سؤال خواهید شد، پس چه خواهید گفت؟» گفتند: «گواهی می‌دهیم که تو ابلاغ کردی و نصیحت نمودی و رسالت را ادا کردی.» پس فرمود: «اللهم اشهد (خداوندا گواه باش).»\n\nو هود با وجود شرک قومش از آنان خواست و گفت: اشْهَدُوا أَنِّي بَرِي‏ءٌ مِمَّا تُشْرِكُونَ (گواه باشید که من از آنچه شریک می‌سازید بیزارم). پس از آنان گواهی خواست، زیرا می‌دانست که ناگزیر از آنان سؤال خواهد شد. و ما رعیت تو هستیم و هیچ حرکتی جز به واسطه تو نداریم، پس ما را حرکت مده مگر در امری که به سود تو باشد نه به زیان تو. و محجوب (کسی که در حجاب است) از این غافل است و نمی‌شنود، به دلیل کری‌ای که از شدت هوایی که او را کر کرده، در او پدید آمده است. پس خداوند ما را از کسانی قرار دهد که نطق جوارح خود را به موعظه شنیدند، پیش از آنکه آن را به شهادت بشنوند. همانا او ولی، بخشنده، کریم و ذُو الْفَضْلِ الْعَظِيمِ (صاحب فضل بزرگ) است."
  },
  "page_count": 2
}