{
  "id": 113,
  "title": {
    "ar": "الباب الثالث عشر ومائة في معرفة مساعدة النفس في أغراضها",
    "en": "Chapter One Hundred and Thirteen: Concerning the Knowledge of Assisting the Soul (النفس) in its Aims.",
    "ur": "باب ایک سو تیرہ: نفس کی اس کے مقاصد میں معاونت کی معرفت (Ma'rifah) کے بیان میں",
    "fa": "باب صد و سیزدهم در معرفت یاری رساندن به نفس در اغراضش"
  },
  "content": {
    "ar": "## (الباب الثالث عشر ومائة في معرفة مساعدة النفس في أغراضها)\n\n\n> ساعد النفس إنها نفس الحق *** ونعت له فأين تغيب‏\n\n\n> أنظر الحق في الوجود تراه *** عينه فالبغيض فيه الحبيب‏\n\n\n> ليس عيني سواه إن كنت تدري *** فهو عين البعيد وهو القريب‏\n\n\n> إن رآني به فمني أراه *** أو دعاني إليه فهو المجيب‏\n\n\n### [مساعدتها النفس إنما هي في مخالفتها]\n\n\nمخالفتها عين مساعدتها فإنها بها تخالفها فانتقلت منها إليها فما زلت عنها\n\n\n### [الغرض الذاتي والعرضي للنفس‏]\n\n\nثم اعلم أن للنفس غرضين ذاتي وعرضي فالذاتي هو جلب المنافع ودفع المضار والعرضي هو ما عرض لها من جانب الشريعة وقد يكون من جانب الغرض وقد يكون من جانب ملاءمة الطبع وقد يكون من جانب طلب الكمال فكلها في الطريق الذي نحن بسبيله غير معتبر إلا جانب الشريعة خاصة فإنها التي وضعت الأسباب الفاضلة التي بفعل ما أمرت بفعله وبترك ما نهت عن فعله وجبت السعادة وحصلت المحبة الإلهية وكان الحق سمع العبد وبصره‏\n\n\n### [الشارع فصل للنفس جميع ما يرضيه وما يسخطه منها]\n\n\nففصل الشارع لها جميع ما يرضيه منها وما يسخطه من ذلك عليها إن فعلته وما لا سخط فيه ولا رضي فما كان مما يرضي الله فهو إلقاء ملكي وفي حق النبي إلقاء ملكي وإلهي وليس للإلقاء الإلهي مدخل في الأولياء الأتباع جملة واحدة أعني في الأحكام بتحليل أو تحريم وما كان مما يسخط الله فهو إلقاء شيطاني لا ناري فمن الجن من يلقي الخير في قلوب الصالحين لهم بهم تلبس عظيم وامتزاج ومحبة فما كان مما يلقي الشيطان فهو ملذوذ للنفس ومحبب لها ومزين في عينها في الوقت مر العاقبة في المال وإلقاء الملك قد يكون مرا في الوقت لكنه ملذوذ في المال وكلتا الحالتين لا تقتضيهما النفس من ذاتها\n\n\n### [مواقف الناس أمام أغراض النفس‏]\n\n\nفلا ينبغي للعاقل أن يساعد النفس فيما تتعلق به من الأمور التي تأمره بها مما يقع له فيها غرض إما عرضي أو ذاتي إلا المؤمن والعارف فالمؤمن يساعدها في الغرض الذاتي وهو كل ما تأمره به من المباح خاصة ومن ملذوذات الطاعات وأما العارف الذي الحق سمعه وقواه فيساعدها في جميع أغراضها فإنه نور كله والنور ما لا ظلمة فيه ولذلك‏\n\n\nكان صَلَّى اللهُ عَليهِ وسَلَّم يقول في دعائه واجعلني نورا\n\n\nلأن النفس ما ينسب إليها ذم إلا بعد تصريفها آلتها في المذموم وهو الظلمة فيقال قد اغتاب الغيبة المحرمة عليه وقد كذب الكذب المحرم عليه وقد نظر النظر المحرم عليه وما لم يظهر الفعل على الآلات لم يتعلق بها ذم والعارف قد وقع الإخبار الإلهي عنه بأن الحق جميع قواه فذكر الآلات فلهذا أبحنا للعارف مساعدة النفس لما هو عليه من العصمة في ظاهره الذي هو الحفظ\n\n",
    "en": "## Chapter One Hundred and Thirteen: Concerning the Knowledge of Assisting the Self in its Purposes\n\nAssist the Self, for it is the Self of the Real (نفس الحق),\nAnd an attribute belonging to Him, so where can it be absent?\n\nLook upon the Real (الحق) in Existence (الوجود), and you will see Him\nAs its very Essence, so the hateful one within it is the beloved.\n\nMy eye sees none other than Him, if you but know;\nHe is the Essence (عين) of the distant and He is the near.\n\nIf He sees me through Him, then I see Him through myself;\nOr if He calls me to Him, then He is the Answerer.\n\n### [Assisting the Self is only found in opposing it]\n\nOpposing the Self (مخالفتها) is the very essence (عين) of assisting it, for by opposing it, you move away from it, transitioning from it to Him, and thus you never cease from Him.\n\n### [The Essential and Contingent Purposes of the Self]\n\nKnow then that the Self (النفس) has two purposes: an essential (ذاتي) and a contingent (عرضي) one. The essential purpose is the acquisition of benefits and the repulsion of harms. The contingent purpose is that which arises for it from the side of the Law (الشريعة), or perhaps from the side of natural inclination, or perhaps from the side of seeking perfection. All of these purposes are disregarded on the path we follow, except specifically the side of the Law. For it is the Law that established the virtuous means by which, through performing what it commanded and abandoning what it forbade, felicity becomes incumbent, Divine Love (المحبة الإلهية) is attained, and the Real (الحق) becomes the servant’s hearing and sight.\n\n### [The Lawgiver Distinguished Everything that Pleases Him and Everything that Displeases Him Concerning the Self]\n\nThe Lawgiver (الشارع) thus distinguished for the Self everything that pleases Him concerning it, and everything that displeases Him concerning it if it performs that action, and also what contains neither displeasure nor pleasure. That which pleases Allah is a celestial suggestion (إلقاء ملكي). In the case of the Prophet, it is both a celestial and a Divine suggestion (إلقاء إلهي). The Divine suggestion has absolutely no entry point for the follower-saints (الأولياء الأتباع)—I mean, concerning legal rulings of permissibility or prohibition. That which displeases Allah is a satanic suggestion (إلقاء شيطاني), not a fiery one. For among the Jinn are those who cast good into the hearts of the righteous, due to a great attachment, blending, and love they have for them. That which Satan casts is pleasurable to the Self, beloved by it, and adorned in its eye at the moment, though bitter in its ultimate consequence. The celestial suggestion may be bitter at the moment, but it is pleasurable in its ultimate consequence. The Self does not demand either of these two states from its own essence (ذاتها).\n\n### [The Stances of People Regarding the Purposes of the Self]\n\nIt is not fitting, therefore, for the rational person to assist the Self in the matters it clings to and commands him to do, in which he finds a purpose, whether contingent or essential—except for the Believer (المؤمن) and the Gnostic (العارف). The Believer assists the Self in the essential purpose, which is everything it commands him to do that is specifically permissible, and also the pleasures found in acts of obedience. As for the Gnostic, whose hearing and faculties the Real (الحق) has become, he assists the Self in all its purposes, for he is entirely Light (نور), and Light is that which contains no darkness. This is why the Prophet, peace and blessings be upon him, used to say in his supplication: \"And make me Light.\"\n\nFor the Self is only attributed blame after it directs its instruments toward the blameworthy, which is darkness. Thus, it is said: \"He committed the backbiting forbidden to him,\" or \"He told the lie forbidden to him,\" or \"He cast the glance forbidden to him.\" As long as the action has not manifested through the instruments, no blame is attached to them. The Gnostic, however, has been the subject of Divine declaration that the Real is all his faculties. Since the instruments were mentioned [in the Divine declaration], we therefore permit the Gnostic to assist the Self, due to the state of infallibility (العصمة) he possesses in his outward manifestation, which is preservation (الحفظ).",
    "ur": "(باب ایک سو تیرہواں: نفس کے اغراض میں اس کی مدد کرنے کی معرفت کے بیان میں)\n\nنفس کی مدد کر، کیونکہ یہ نفس الحق (نفس الحق) ہے،\nاور یہ اس (حق) کی صفت ہے، تو یہ کہاں غائب ہو سکتی ہے؟\n\nوجود (الوجود) میں حق (الحق) کو دیکھ، تو اسے اس کی عین ذات پائے گا،\nپس اس میں ناپسندیدہ بھی محبوب ہے۔\n\nاگر تو جانتا ہے تو میری عین ذات اس کے سوا کوئی نہیں،\nپس وہی دور ہے اور وہی قریب ہے۔\n\nاگر وہ مجھے اس کے ذریعے دیکھتا ہے تو میں اسے اپنی طرف سے دیکھتا ہوں،\nیا اگر وہ مجھے اپنی طرف بلاتا ہے تو وہی جواب دینے والا (المجیب) ہے۔\n\n### [نفس کی مدد درحقیقت اس کی مخالفت میں ہے]\n\nاس کی مخالفت ہی عین اس کی مدد ہے، کیونکہ اس (مخالفت) کے ذریعے تو اس (نفس) کی مخالفت کرتا ہے، پس تو اس سے اس کی طرف منتقل ہو گیا، اور تو اس سے زائل نہیں ہوا۔\n\n### [نفس کا ذاتی اور عرضی غرض]\n\nپھر جان لے کہ نفس کے دو غرض (مقصد) ہیں: ذاتی (ذاتی) اور عرضی (عرضی)۔ پس ذاتی غرض منافع کو حاصل کرنا اور نقصانات کو دور کرنا ہے، اور عرضی غرض وہ ہے جو شریعت کی جانب سے اس پر عارض ہو۔ اور کبھی یہ غرض کی جانب سے ہوتا ہے، اور کبھی طبع کی موافقت کی جانب سے ہوتا ہے، اور کبھی کمال (الکمال) کے طلب کی جانب سے ہوتا ہے۔ پس وہ سب اس راستے میں جس پر ہم ہیں، قابلِ اعتبار نہیں ہیں، سوائے خاص طور پر شریعت کی جانب کے۔ کیونکہ شریعت ہی نے وہ فضیلت والے اسباب مقرر کیے ہیں جن کے ذریعے ان افعال کو کرنے سے جن کا حکم دیا گیا ہے، اور ان افعال کو ترک کرنے سے جن سے منع کیا گیا ہے، سعادت واجب ہوتی ہے اور محبت الٰہیہ (المحبۃ الإلٰہیۃ) حاصل ہوتی ہے، اور حق (الحق) بندے کی سماعت اور اس کی بصارت بن جاتا ہے۔\n\n### [شارع نے نفس کے لیے وہ سب تفصیل سے بیان کر دیا جو اسے پسند ہے اور جو اسے ناپسند]\n\nپس شارع نے نفس کے لیے وہ سب تفصیل سے بیان کر دیا جو اسے (اللہ کو) پسند ہے اور جو اسے ناپسند ہے اگر وہ اسے کرے۔ اور وہ بھی جس میں نہ ناراضگی ہے اور نہ رضامندی۔ پس جو چیز اللہ کو راضی کرنے والی ہو، وہ القاء ملکی (إلقاء ملکی) ہے۔ اور نبی کے حق میں وہ القاء ملکی (إلقاء ملکی) اور الٰہی (إلقاء إلٰہی) ہوتا ہے۔ اور القاء الٰہی (الإلقاء الإلٰہی) کا اولیاء (الأولیاء) متبعین میں بالکل کوئی دخل نہیں ہے، میرا مطلب ہے تحلیل (حلال قرار دینے) یا تحریم (حرام قرار دینے) کے احکام میں۔ اور جو چیز اللہ کو ناراض کرنے والی ہو، وہ القاء شیطانی (إلقاء شیطانی) ہے، نہ کہ ناری (آتشی)۔ کیونکہ جنات میں سے کچھ ایسے بھی ہیں جو صالحین کے دلوں میں خیر ڈالتے ہیں، ان کے ساتھ ان کا عظیم تلبس (گہرا تعلق)، امتزاج اور محبت ہوتی ہے۔ پس جو کچھ شیطان ڈالتا ہے، وہ نفس کے لیے لذت بخش، اسے محبوب اور اس کی نظر میں اسی وقت مزین ہوتا ہے، لیکن انجام میں اس کا نتیجہ تلخ ہوتا ہے۔ اور القاء ملک (إلقاء الملک) وقت پر تلخ ہو سکتا ہے، لیکن انجام میں لذت بخش ہوتا ہے۔ اور نفس اپنی ذات سے ان دونوں حالتوں کا تقاضا نہیں کرتا۔\n\n### [نفس کے اغراض کے سامنے لوگوں کے موقف]\n\nپس عاقل کے لیے مناسب نہیں کہ وہ نفس کی ان امور میں مدد کرے جن سے وہ متعلق ہوتی ہے اور جن کا وہ اسے حکم دیتی ہے، جن میں اس کا کوئی غرض (مقصد) واقع ہوتا ہے، خواہ وہ عرضی (عرضی) ہو یا ذاتی (ذاتی)، سوائے مومن اور عارف (العارف) کے۔ پس مومن اس کی مدد ذاتی غرض میں کرتا ہے، اور وہ ہر وہ چیز ہے جس کا وہ اسے حکم دیتی ہے، خاص طور پر مباحات میں اور طاعات کی لذتوں میں۔ اور جہاں تک عارف (العارف) کا تعلق ہے جس کی سماعت اور قوتوں کو حق (الحق) نے اپنی قوتیں بنا لیا ہے، تو وہ اس کے تمام اغراض میں اس کی مدد کرتا ہے، کیونکہ وہ سراسر نور (نور) ہے، اور نور وہ ہے جس میں کوئی ظلمت (ظلمت) نہ ہو۔ اور اسی لیے نبی اکرم صلی اللہ علیہ وسلم اپنی دعا میں فرمایا کرتے تھے:\n\"اور مجھے نور (نور) بنا دے۔\"\nکیونکہ نفس کی طرف مذمت کی نسبت تب ہی کی جاتی ہے جب وہ اپنے آلات کو مذموم (برے) کام میں استعمال کرے، اور وہ ظلمت (ظلمت) ہے۔ پس کہا جاتا ہے کہ اس نے وہ غیبت کی جو اس پر حرام تھی، اور اس نے وہ جھوٹ بولا جو اس پر حرام تھا، اور اس نے وہ نظر ڈالی جو اس پر حرام تھی۔ اور جب تک فعل آلات پر ظاہر نہ ہو، اس سے کوئی مذمت متعلق نہیں ہوتی۔ اور عارف (العارف) کے بارے میں خبر الٰہی (الإخبار الإلٰہی) آ چکی ہے کہ حق (الحق) اس کی تمام قوتیں بن چکا ہے۔ پس آلات کا ذکر کیا گیا، اسی لیے ہم نے عارف (العارف) کے لیے نفس کی مدد کرنا مباح قرار دیا، کیونکہ وہ اپنے ظاہر میں عصمت (العصمۃ) پر فائز ہے، جو کہ حفظ (حفاظت) ہے۔",
    "fa": "باب صد و سیزدهم در معرفت یاری رساندن به نفس در اغراض آن.\n\nبه نفس یاری رسان، زیرا که آن نفسِ حق است\nو نعت اوست، پس کجا پنهان می‌شوی؟\n\nحق (الحق) را در هستی (الوجود) بنگر، او را عین آن می‌بینی\nپس ناپسند در آن، همان دوست‌داشتنی است.\n\nاگر بدانی، چشم من جز او نیست\nاو عین دور و عین نزدیک است.\n\nاگر مرا به واسطه او ببیند، من او را از خود می‌بینم\nیا اگر مرا به سوی خود بخواند، اوست که اجابت‌کننده است.\n\n### یاری رساندن به نفس، تنها در مخالفت با آن است\n\nمخالفت با نفس، عین یاری رساندن به آن است؛ زیرا نفس به واسطه این مخالفت، از خود به سوی حق (الحق) منتقل می‌شود و از آن زوال نمی‌یابد.\n\n### غرض ذاتی و عرضی نفس\n\nسپس بدان که نفس دو غرض دارد: ذاتی و عرضی. غرض ذاتی، جلب منافع و دفع مضار است؛ و غرض عرضی، آن است که از جانب شریعت برای نفس عارض می‌شود. و گاهی ممکن است از جانب غرض (هدف)، گاهی از جانب سازگاری طبع، و گاهی از جانب طلب کمال باشد. همه اینها در راهی که ما در آن هستیم، غیر معتبرند، مگر به طور خاص جانب شریعت؛ زیرا شریعت است که اسباب فاضله را وضع کرده است که با انجام آنچه امر شده و ترک آنچه نهی شده، سعادت (السعادة) واجب می‌شود و محبت الهی (المحبة الإلهية) حاصل می‌گردد و حق (الحق) گوش و چشم بنده می‌شود.\n\n### شارع تمام آنچه را که موجب رضایت و خشم حق از نفس می‌شود، تفصیل داده است\n\nپس شارع (الشارع) برای نفس تفصیل داده است تمام آنچه را که موجب رضایت حق از آن می‌شود و آنچه را که اگر انجام دهد موجب خشم حق بر آن می‌گردد، و آنچه را که نه خشم در آن است و نه رضایت. آنچه موجب رضایت خداوند است، القای ملکی است؛ و در حق پیامبر، القای ملکی و الهی است. و القای الهی به طور کلی در اولیای تابع (الأولياء الأتباع) مدخلی ندارد، منظورم در احکام به تحلیل یا تحریم است. و آنچه موجب خشم خداوند است، القای شیطانی است نه ناری (آتشین)؛ زیرا برخی از جن‌ها هستند که خیر را در قلوب صالحان القا می‌کنند، چرا که با آنان تلبس و امتزاج و محبتی عظیم دارند. آنچه شیطان القا می‌کند، برای نفس لذت‌بخش و دوست‌داشتنی است و در لحظه در چشم او آراسته می‌شود، اما عاقبت آن تلخ است. و القای ملکی ممکن است در لحظه تلخ باشد، اما عاقبت آن لذت‌بخش است. و نفس هیچ یک از این دو حالت را از ذات خود اقتضا نمی‌کند.\n\n### مواضع مردم در برابر اغراض نفس\n\nپس شایسته نیست که عاقل، نفس را در اموری که به آن تعلق می‌یابد و نفس او را به انجام آن امر می‌کند و غرضی اعم از عرضی یا ذاتی در آن برای او حاصل می‌شود، یاری رساند؛ مگر مؤمن (المؤمن) و عارف (العارف). مؤمن نفس را در غرض ذاتی یاری می‌دهد، که عبارت است از هر آنچه نفس او را به انجام آن امر می‌کند، به ویژه از مباحات و از لذت‌های طاعات. اما عارف (العارف) که حق (الحق) گوش و قوای او شده است، نفس را در تمام اغراضش یاری می‌دهد، زیرا او سراسر نور است و نور چیزی است که ظلمت در آن نیست. به همین دلیل،\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در دعای خود می‌فرمود: «و مرا نور قرار ده.»\nزیرا مذمت به نفس نسبت داده نمی‌شود مگر پس از آنکه ابزار خود را در مذموم که همان ظلمت است، به کار گیرد. پس گفته می‌شود: غیبت حرام را انجام داد، دروغ حرام را گفت، و نگاه حرام را کرد. و تا زمانی که فعل بر ابزارها ظاهر نشود، مذمتی به آن تعلق نمی‌گیرد. و درباره عارف (العارف)، خبر الهی رسیده است که حق (الحق) تمام قوای او شده است، و ابزارها را ذکر کرده است. به همین دلیل، ما یاری رساندن به نفس را برای عارف مباح دانستیم، به سبب عصمتی که در ظاهر خود دارد و آن همان حفظ الهی است."
  },
  "page_count": 1
}