{
  "id": 404,
  "title": {
    "ar": "الباب الرابع وأربعمائة في معرفة منازلة من شق على رعيته سعى في هلاك ملكه ومن رفق بهم بقي ملكا كل سيد قتل عبدا من عبيده فإنما قتل سيادة من سياداته إلا أنا فانظره",
    "en": "Chapter 404: Concerning the Knowledge of the Station of Him Who Imposes Hardship upon His Subjects, Striving for the Destruction of His Kingdom, and Him Who Is Gentle Towards Them, Remaining a King. Every Master [سيد] Who Kills a Servant [عبد] from Among His Servants Has Only Killed a Lordship [سيادة] from Among His Lordships, Except for Me, So Consider Him.",
    "ur": "باب چار سو چار: اس شخص کے مقام (منازلة) کی معرفت میں جو اپنی رعایا پر سختی کرتا ہے، وہ اپنی بادشاہت کی تباہی کے لیے کوشش کرتا ہے، اور جو ان کے ساتھ نرمی کرتا ہے وہ بادشاہ باقی رہتا ہے۔ ہر آقا جو اپنے غلاموں میں سے کسی غلام کو قتل کرتا ہے، تو وہ اپنی سیادتوں میں سے ایک سیادت کو ہی قتل کرتا ہے۔ سوائے میرے، پس اس پر غور کر۔",
    "fa": "باب چهارصد و چهارم: در معرفت منزلت کسی که بر رعیت خود سخت می‌گیرد، در نابودی مُلک خود می‌کوشد، و کسی که با آنان مدارا می‌کند، پادشاه باقی می‌ماند. هر آقایی که بنده‌ای از بندگانش را بکشد، جز این نیست که سیادتی از سیادات خود را کشته است، مگر من، پس به آن بنگر."
  },
  "content": {
    "ar": "## «الباب الرابع وأربعمائة في معرفة منازلة من شق على رعيته سعى في هلاك ملكه ومن رفق بهم بقي ملكا كل سيد قتل عبدا من عبيده فإنما قتل سيادة من سياداته إلا أنا فانظره»\n\n\n> حكم الإضافة يبقيه ويبقينا *** وتلك حكمته سبحانه فينا\n\n\n> لو لا العبيد لما كانت سيادة من *** ساد العباد ولا كانوا موالينا\n\n\n> قد قال في خلدي ما كان معتقدي *** عند النداء كما كنا يكونونا\n\n\n> ما يعدم الحق موجودا لزلته *** وكيف يعدم من فيه يوالينا\n\n\n> بكونه كان خلاقا وليس له *** في نفسه أثر ولا يبارينا\n\n\n### [إن الإمامة اعطا الله على الإنسان‏]\n\n\nقال الله تعالى الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ لم يقل رب نفسه لأن الشي‏ء لا يضاف إلى نفسه فهذه وصية إلهية لعباده لما خلقهم على صورته وأعطى من أعطى منهم الإمامة الكبرى والدنيا وما بينهما وذلك‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم كلكم راع ومسئول عن رعيته‏\n\n\nفأعلى الرعاء الإمامة الكبرى وأدناها إمامة الإنسان على جوارحه وما بينهما ممن له الإمامة على أهله وولده وتلامذته ومماليكه فما من إنسان إلا وهو مخلوق على الصورة ولهذا أعمت الإمامة جميع الأناسي والحكم في الكل واحد من حيث ما هو إمام والملك يتسع ويضيق كما قررنا فالإمام مراقب أحوال مماليكه مع الأنفاس وهذا هو الإمام الذي عرف قدر ما ولاة الله عليه وقدمه كل ذلك ليعلم أن الله رقيب عليه وهو الذي استخلفه ثم نبهه على أمر لو عقل عن الله وذلك أن السيد إذا نقصه عين أو حال ممن ساد عليه فإنه قد نقص من سيادته بقدر ذلك وعزل بقدر ذلك كمن أعتق شقصا له في عبد فقد عتق من العبد ما عتق ولم يسر العتق في العبد كله إلا أن يعتق كله كذلك الإمام إن غفل بلهوه وشأنه وشارك رعيته فيما هم عليه من فنون اللذات ونيل الشهوات ولم ينظر من أحوال ما هو مأمور بالنظر في أحواله‏\nمن رعاياه فقد عزل نفسه بفعله ورمت به المرتبة وبقي عليه السؤال من الله والوبال والخيبة وفقد الرئاسة والسيادة وحرمه الله خيرها وندم حيث لم ينفعه الندم فإنه لو لم يسأل عن ذلك وترك وشأنه لكان بعض شي‏ء إلا الحق فإنه لا ينقص عنه من ملكه شي‏ء فإن عبده إذا مات من الحياة الدنيا انتقل إليه في البرزخ فبقي حكم السيادة لله عليه بخلاف الإنسان إذا مات عبده ماتت سيادته التي كان بها سيدا عليه فهذا الفرق بيننا وبين الحق في الربوبية\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم إن الله يحب الرفق في الأمر كله‏\n\n\nفالعالم من علم الرفق والرفيق والمرفوق فما من إنسان إلا وهو رفيق مرفوق به فهو مملوك من وجه مالك من وجه ورفع بعضكم فوق بعض درجات ليتخذ بعضكم بعضا سخريا والله رَفِيعُ الدَّرَجاتِ فنحن له كما هو لنا وكما نحن لنا فنحن لنا وله وهو لنا لا له وليس في هذا الباب أشكل من إضافة العلم الإلهي إلى المعلومات ولا القدرة إلى المقدورات ولا الإرادة إلى المرادات لحدوث التعلق أعني تعلق كل صفة بمتعلقها من حيث العالم والقادر والمريد فإن المعلومات والمقدورات والمرادات لا نهاية لها فهو يحيط علما بأنها لا تتناهى ولما كان الأمر على ما أشرنا إليه وعثر على ذلك من عثر عليه من المتكلمين قال بالاسترسال وعبر آخر بحدوث التعلق وقال الله في هذا المقام حَتَّى نَعْلَمَ وأنكر بعض العلماء من القدماء تعلق العلم الإلهي بالتفصيل لعدم التناهي في ذلك وكونه غير داخل في الوجود فيعلم التفصيل من حيث ما هو تفصيل في أمر ما لا في كذا على التعيين واضطربت العقول فيه لاضطراب أفكارها ورفع الإشكال في هذه المسألة عندنا أهل الكشف والوجود والإلقاء الإلهي أن العلم نسبة بين العالم والمعلومات وما ثم إلا ذات الحق وهي عين وجوده وليس لوجوده مفتتح ولا منتهى فيكون له طرف والمعلومات متعلق وجوده فتعلق ما لا يتناهى وجودا بما لا يتناهى معلوما ومقدورا ومرادا فتفطن فإنه أمر دقيق فإن الحق عين وجوده لا يتصف بالدخول في الوجود فيتناهى فإنه كل ما دخل في الوجود فهو متناه والبارئ هو عين الوجود ما هو داخل في الوجود لأن وجوده عين ماهيته وما سوى الحق فمنه ما دخل في الوجود فتناهى بدخوله في الوجود ومنه ما لم يدخل في الوجود فلا يتصف بالتناهي فتحقق ما نبهتك عليه فإنك ما تجده في غير هذا الموضع وعلى هذا تأخذ المقدورات والمرادات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 404: Concerning the knowledge of the station of him who deals harshly with his subjects, thereby striving for the destruction of his kingdom; and of him who treats them gently, thereby remaining a king. Every master who kills a slave among his slaves has only killed a lordship (سيادة) among his own lordships, except for Me, so consider this.\n\nThe rule of attribution sustains Him and sustains us,\nAnd that is His wisdom, glory be to Him, concerning us.\n\nWere it not for the servants, there would be no lordship for him\nWho rules the servants, nor would they be our masters.\n\nHe has spoken in my heart what was my creed,\nAt the summons, as we were, so shall they be.\n\nThe Real (الحق) does not annihilate an existent thing due to its error,\nAnd how could He annihilate him in whom He is loyal to us?\n\nBy His being the Creator, and having\nNo trace in Himself, nor does He rival us.\n\n[Verily, the Imamate (Leadership) is a gift from Allah to humanity]\n\nAllah the Exalted said: <<الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (Praise belongs to Allah, Lord of the Worlds). He did not say, \"Lord of Himself,\" because a thing is not attributed to itself. This is a Divine injunction (وصية إلهية) to His servants, since He created them upon His Form (صورته) and granted the Supreme Imamate (الإمامة الكبرى), the world, and what is between them, to those He chose among them. This is confirmed by His saying, peace and blessings be upon him: \"Each of you is a shepherd and responsible for his flock (رعيته).\"\n\nThe highest level of shepherding is the Supreme Imamate, and the lowest is the imamate of a human being over his own limbs (جوارحه). Between these are those who hold imamate over their family, children, students, and slaves. There is no human being who is not created upon the Form, and for this reason, the Imamate encompasses all people. The ruling principle is the same for everyone insofar as he is an Imam, and the kingdom expands and contracts as we have established.\n\nThus, the Imam monitors the states of his subjects (مماليكه) with every breath. This is the Imam who knows the measure of what Allah has entrusted him with and elevated him to. All of this is so that he may know that Allah is a Watcher (رقيب) over him, and that He is the One who appointed him as vicegerent (استخلفه). Then He alerted him to a matter, if he were to understand it from Allah: When a master loses an entity (عين) or a state (حال) from those over whom he holds lordship, he has diminished his own lordship (سيادته) by that measure and been deposed by that measure. This is like someone who frees his share in a slave: that portion of the slave is freed, but the freedom does not extend to the entire slave unless he frees the whole of him. Likewise, if the Imam is heedless due to his amusement and affairs, and shares with his subjects in their various pleasures and attainment of desires, and fails to look into the states of those subjects whose affairs he is commanded to oversee, he has deposed himself by his own action. The rank (المرتبة) casts him off, and there remains upon him the questioning from Allah, the calamity, the disappointment, the loss of leadership (الرئاسة) and lordship (السيادة). Allah deprives him of its goodness, and he regrets when regret is of no benefit to him.\n\nFor if he were not questioned about that and were left to his own devices, he would be something—but The Real (الحق) is not diminished in His dominion (ملك) by anything. For when His servant dies from the life of this world, he transfers to Him in the Isthmus (البرزخ), and the rule of lordship (حكم السيادة) remains upon him for Allah. This is contrary to the human being: when his slave dies, the lordship by which he was master over him dies. This is the difference between us and The Real concerning Lordship (الربوبية).\n\nHe said, peace and blessings be upon him: \"Indeed, Allah loves gentleness (الرفق) in all matters.\"\n\nThe Gnostic (العالم) is he who knows gentleness, the Gentle One (الرفيق), and the one treated gently (المرفوق). There is no human being who is not gentle and treated gently. Thus, he is a possessed one (مملوك) from one perspective and an owner (مالك) from another. <<ورفع بعضكم فوق بعض درجات ليتخذ بعضكم بعضا سخريا>> (And He has raised some of you above others in degrees, so that some may take others into service). And Allah is <<رَفِيعُ الدَّرَجاتِ>> (Exalter of Ranks). So we are for Him, just as He is for us; and just as we are for ourselves, we are for ourselves and for Him; and He is for us, not for Himself.\n\nThere is nothing more problematic in this chapter than the attribution (إضافة) of Divine Knowledge (العلم الإلهي) to the known things (المعلومات), nor Power (القدرة) to the things empowered (المقدورات), nor Will (الإرادة) to the things willed (المرادات), due to the origination of the relationship (حدوث التعلق). I mean the relationship (تعلق) of each Attribute (صفة) to its correlate, insofar as He is the Knower (العالم), the Powerful (القادر), and the Willer (المريد). For the known things, the empowered things, and the willed things have no end. He encompasses them with Knowledge (علما) that they are without end. Since the matter is as we have indicated, and when some of the theologians (المتكلمين) stumbled upon this, one spoke of \"unrestricted extension\" (الاسترسال), and another expressed it as \"the origination of the relationship.\" And Allah said in this context: <<حَتَّى نَعْلَمَ>> (So that We may know). Some of the ancient scholars denied the relationship of Divine Knowledge to details (التفصيل) because of the lack of finality (عدم التناهي) in that, and because it is not contained within Existence (الوجود). Thus, He knows the detail insofar as it is a detail in a certain matter, but not in such-and-such specifically. Minds have been confused regarding this due to the confusion of their thoughts.\n\nThe resolution of this difficulty, according to us, the People of Unveiling (الكشف), Existence (الوجود), and Divine Inspiration (الإلقاء الإلهي), is that Knowledge (العلم) is a relationship (نسبة) between the Knower (العالم) and the known things (المعلومات). And there is nothing there except the Essence (الذات) of The Real (الحق), which is the very eye of His Existence (عين وجوده). His Existence has neither beginning nor end, so that it might have a limit. The known things are the correlates of His Existence. Thus, that which is endless in Existence relates to that which is endless as known, empowered, and willed. Be attentive, for this is a subtle matter. For The Real is the very eye of His Existence; He is not characterized by entering into Existence (الدخول في الوجود) so as to be finite. For everything that enters into Existence is finite. The Creator (البارئ) is the very eye of Existence; He is not *in* Existence, because His Existence is the eye of His quiddity (ماهيته). As for everything other than The Real, some of it has entered into Existence and become finite by its entry into Existence, and some of it has not entered into Existence and is therefore not characterized by finitude. Realize what I have alerted you to, for you will not find it in any other place. And upon this principle, you should understand the empowered things (المقدورات) and the willed things (المرادات). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو چار: اس شخص کے مرتبے کی معرفت میں جو اپنی رعیت پر سختی کرتا ہے، وہ اپنی بادشاہت کی تباہی کے لیے کوشاں ہوتا ہے، اور جو ان سے نرمی کرتا ہے وہ بادشاہ باقی رہتا ہے۔ ہر آقا جو اپنے غلاموں میں سے کسی کو قتل کرتا ہے، تو وہ درحقیقت اپنی سیادتوں (السیادات) میں سے ایک سیادت کو قتل کرتا ہے، سوائے میرے (ذات حق) کے، پس اس پر غور کرو۔\n\nاضافت (نسبت) کا حکم اسے (بادشاہ کو) اور ہمیں باقی رکھتا ہے،\nاور یہ ہم میں اس سبحانہ کی حکمت ہے۔\n\nاگر غلام نہ ہوتے تو ان لوگوں کی کوئی سیادت نہ ہوتی\nجو بندوں پر سرداری کرتے ہیں، اور نہ وہ ہمارے آقا ہوتے۔\n\nمیرے دل میں وہی بات کہی گئی جو میرا عقیدہ تھا،\nپکار کے وقت جیسا کہ ہم تھے، ویسے ہی ہوں گے۔\n\nذات حق (الحق) کسی موجود کو اس کی لغزش کی وجہ سے معدوم نہیں کرتا،\nاور وہ کیسے معدوم ہو سکتا ہے جو اس میں ہماری مدد کرتا ہے؟\n\nاس لیے کہ وہ خالق ہے، اور اس کے لیے\nاس کی ذات میں کوئی اثر نہیں ہے اور نہ وہ ہم سے مقابلہ کرتا ہے۔\n\n### [بے شک امامت انسان پر اللہ کا عطیہ ہے]\n\nاللہ تعالیٰ نے فرمایا: **الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ** (تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔ یہ نہیں فرمایا کہ \"رب نفسہ\" (اپنا رب) کیونکہ کوئی شے اپنی ذات کی طرف مضاف نہیں ہوتی۔ یہ بندوں کے لیے ایک الٰہی وصیت ہے، جب اس نے انہیں اپنی صورت پر پیدا کیا اور ان میں سے جسے چاہا اسے امامت کبریٰ (الإمامة الکبریٰ) اور دنیا اور جو کچھ ان کے درمیان ہے، عطا کیا۔ اور یہی ہے نبی اکرم صلی اللہ علیہ وسلم کا فرمان: **تم میں سے ہر ایک نگہبان ہے اور اپنی رعیت کے بارے میں جواب دہ ہے۔**\n\nپس نگہبانوں میں سب سے اعلیٰ امامت کبریٰ (الإمامة الکبریٰ) ہے اور سب سے ادنیٰ انسان کی اپنے اعضاء پر امامت ہے۔ اور ان کے درمیان وہ شخص ہے جسے اپنے اہل، اولاد، شاگردوں اور غلاموں پر امامت حاصل ہے۔ کوئی انسان ایسا نہیں جو اس صورت پر پیدا نہ کیا گیا ہو، اور اسی وجہ سے امامت تمام انسانوں کو شامل ہے۔ اور حکم سب میں ایک ہی ہے اس لحاظ سے کہ وہ امام ہے۔ اور بادشاہت پھیلتی اور سکڑتی ہے جیسا کہ ہم نے طے کیا ہے۔ پس امام اپنے زیردستوں کے احوال کی نگرانی سانسوں کے ساتھ کرتا ہے۔ اور یہی وہ امام ہے جس نے اس قدر کو پہچانا جو اللہ نے اسے سونپا اور اسے مقدم کیا۔ یہ سب اس لیے ہے تاکہ وہ جان لے کہ اللہ اس پر نگہبان ہے اور وہی ہے جس نے اسے خلیفہ بنایا۔ پھر اسے ایک ایسے معاملے پر متنبہ کیا جو اگر وہ اللہ کی طرف سے سمجھ لیتا تو یہ ہوتا کہ جب آقا کو اس شخص کی طرف سے کوئی نقص یا حال پہنچتا ہے جس پر وہ سردار ہے، تو وہ اسی قدر اپنی سیادت (السیادۃ) میں کمی کرتا ہے اور اسی قدر معزول ہو جاتا ہے۔ جیسے کسی نے کسی غلام میں اپنے حصے کا کچھ حصہ آزاد کر دیا، تو غلام کا وہ حصہ آزاد ہو گیا جو آزاد ہوا، لیکن آزادی پورے غلام میں سرایت نہیں کرتی جب تک کہ وہ پورا آزاد نہ ہو جائے۔ اسی طرح امام اگر اپنی لہو و لعب اور اپنے معاملات میں غفلت برتے، اور اپنی رعیت کے ساتھ لذتوں کے فنون اور شہوات کے حصول میں شریک ہو جائے، اور ان احوال پر نظر نہ ڈالے جن کے احوال کی نگرانی کا اسے حکم دیا گیا ہے، تو وہ اپنے فعل سے خود کو معزول کر دیتا ہے، اور مرتبہ اسے چھوڑ دیتا ہے۔ اور اس پر اللہ کی طرف سے سوال، وبال اور ناکامی باقی رہتی ہے، اور وہ ریاست و سیادت (السیادۃ) سے محروم ہو جاتا ہے، اور اللہ اسے اس کی بھلائی سے محروم کر دیتا ہے، اور وہ اس وقت نادم ہوتا ہے جب ندامت اسے فائدہ نہیں دیتی۔ کیونکہ اگر اس سے اس بارے میں سوال نہ کیا جاتا اور اسے اس کے حال پر چھوڑ دیا جاتا تو یہ کچھ اور ہوتا۔ سوائے ذات حق (الحق) کے، کہ اس کی بادشاہت میں کوئی کمی نہیں آتی۔ کیونکہ جب اس کا بندہ دنیاوی زندگی سے مر جاتا ہے تو وہ برزخ میں اس کی طرف منتقل ہو جاتا ہے، پس اس پر اللہ کی سیادت (السیادۃ) کا حکم باقی رہتا ہے۔ برخلاف انسان کے، جب اس کا غلام مر جاتا ہے تو اس کی وہ سیادت مر جاتی ہے جس کی وجہ سے وہ اس پر آقا تھا۔ پس یہ ہمارے اور ذات حق (الحق) کے درمیان ربوبیت میں فرق ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: **بے شک اللہ ہر معاملے میں نرمی (الرفق) کو پسند کرتا ہے۔**\n\nپس عالم وہ ہے جو نرمی (الرفق)، نرمی کرنے والے (الرفیق) اور جس پر نرمی کی گئی (المرفوق) کو جانتا ہے۔ کوئی انسان ایسا نہیں جو رفیق (نرمی کرنے والا) اور مرفوق (جس پر نرمی کی گئی) نہ ہو۔ پس وہ ایک لحاظ سے مملوک (غلام) ہے اور ایک لحاظ سے مالک۔ **وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِّيَتَّخِذَ بَعْضُكُم بَعْضًا سُخْرِيًّا** (اور اس نے تم میں سے بعض کو بعض پر درجات میں بلند کیا تاکہ تم میں سے بعض، بعض کو خدمت میں لائیں)۔ اور اللہ **رَفِيعُ الدَّرَجَاتِ** (درجات کو بلند کرنے والا) ہے۔ پس ہم اس کے لیے ہیں جیسا کہ وہ ہمارے لیے ہے، اور جیسا کہ ہم اپنے لیے ہیں، پس ہم اپنے لیے بھی ہیں اور اس کے لیے بھی، اور وہ ہمارے لیے ہے نہ کہ اپنے لیے۔\n\nاس باب میں علم الٰہی (العلم الإلهي) کی معلومات (المعلومات) کی طرف اضافت، یا قدرت کی مقدورات (المقدورات) کی طرف، یا ارادے کی مرادات (المرادات) کی طرف اضافت سے زیادہ کوئی چیز مشکل نہیں ہے، کیونکہ تعلق کا حدوث ہوتا ہے— میرا مطلب ہے ہر صفت کا اپنے متعلق سے تعلق، اس لحاظ سے کہ وہ عالم (جاننے والا)، قادر (قدرت رکھنے والا) اور مرید (ارادہ کرنے والا) ہے۔ کیونکہ معلومات (المعلومات)، مقدورات (المقدورات) اور مرادات (المرادات) کی کوئی انتہا نہیں ہے۔ پس وہ علم کے ذریعے اس بات کا احاطہ کرتا ہے کہ ان کی کوئی انتہا نہیں ہے۔ اور جب معاملہ اسی طرح تھا جیسا کہ ہم نے اشارہ کیا، اور متکلمین (علم کلام کے ماہرین) میں سے جس نے اس پر ٹھوکر کھائی، اس نے استرسال (تسلسل) کا قول کیا، اور دوسرے نے حدوث تعلق (تعلق کا نیا ہونا) سے تعبیر کیا۔ اور اللہ نے اس مقام پر فرمایا: **حَتَّى نَعْلَمَ** (تاکہ ہم جان لیں)۔ اور بعض قدیم علماء نے اس میں عدم تناہیت کی وجہ سے اور اس کے وجود (الوجود) میں داخل نہ ہونے کی وجہ سے علم الٰہی (العلم الإلهي) کے تفصیلی تعلق کا انکار کیا۔ پس وہ تفصیل کو اس لحاظ سے جانتا ہے کہ وہ کسی معاملے میں تفصیل ہے، نہ کہ کسی متعین چیز میں۔ اور عقلیں اس میں مضطرب ہو گئیں کیونکہ ان کے افکار مضطرب تھے۔\n\nاور ہمارے نزدیک، اہل کشف (أهل الکشف)، ہستی (الوجود) اور الٰہی القاء (الإلقاء الإلهي) والوں کے نزدیک، اس مسئلے میں اشکال یوں رفع ہوتا ہے کہ علم، عالم (جاننے والے) اور معلومات (المعلومات) کے درمیان ایک نسبت ہے۔ اور وہاں ذات حق (ذات الحق) کے سوا کچھ نہیں ہے، اور وہ اس کی ہستی (الوجود) کا عین ہے۔ اور اس کی ہستی (الوجود) کا نہ کوئی آغاز ہے اور نہ کوئی انتہا، کہ اس کا کوئی کنارہ ہو۔ اور معلومات اس کی ہستی (الوجود) کا متعلق ہیں۔ پس جو ہستی (الوجود) میں غیر متناہی ہے، اس کا تعلق اس سے ہے جو معلوم، مقدور اور مراد میں غیر متناہی ہے۔ پس غور کرو، کیونکہ یہ ایک دقیق معاملہ ہے۔\n\nکیونکہ ذات حق (الحق) اپنی ہستی (الوجود) کا عین ہے، وہ وجود (الوجود) میں داخل ہونے سے متصف نہیں ہوتا کہ وہ متناہی ہو جائے۔ کیونکہ جو کچھ بھی وجود (الوجود) میں داخل ہوا وہ متناہی ہے۔ اور باری تعالیٰ عین ہستی (الوجود) ہے، وہ وجود (الوجود) میں داخل نہیں ہے، کیونکہ اس کی ہستی (الوجود) اس کی ماہیت کا عین ہے۔ اور ذات حق (الحق) کے سوا جو کچھ ہے، اس میں سے کچھ وہ ہے جو وجود (الوجود) میں داخل ہوا اور وجود (الوجود) میں داخل ہونے کی وجہ سے متناہی ہو گیا، اور کچھ وہ ہے جو وجود (الوجود) میں داخل نہیں ہوا، پس وہ تناہیت سے متصف نہیں ہوتا۔ پس اس بات کی تحقیق کرو جس پر میں نے تمہیں متنبہ کیا ہے، کیونکہ تم اسے اس جگہ کے علاوہ کہیں نہیں پاؤ گے۔ اور اسی پر تم مقدورات (المقدورات) اور مرادات (المرادات) کو قیاس کرو۔ اور اللہ **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و چهارم در معرفت جایگاه کسی که بر رعیت خود سخت بگیرد و در نابودی مُلک خویش بکوشد، و کسی که با آنان رفق ورزد، پادشاه باقی بماند. هر سروری که بنده‌ای از بندگان خود را بکشد، در واقع سیادتی از سیادات خویش را کشته است، مگر من (حق)، پس در این بنگر.\n\nحکم اضافه (نسبت) او را و ما را باقی می‌دارد\nو این حکمت اوست، سبحانه، در ما.\n\nاگر بندگان نبودند، سیادتی برای کسی که\nبر بندگان سروری می‌کند، وجود نداشت و آنان (بندگان) نیز موالی ما نمی‌شدند.\n\nآنچه اعتقاد من بود، در خاطرم گفت\nهنگام ندا، همان‌گونه که بودیم، خواهند بود.\n\nحق (الحق) موجودی را به خاطر لغزشش معدوم نمی‌سازد\nو چگونه معدوم شود کسی که در او با ما دوستی می‌ورزد؟\n\nبه سبب آنکه او همواره خالق بوده است و برای او\nدر ذات خویش اثری نیست و با ما رقابت نمی‌کند.\n\n### [همانا امامت عطای خداوند بر انسان است]\n\nخداوند متعال می‌فرماید: الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (ستایش از آنِ خداوندی است که پروردگار جهانیان است). نگفت پروردگار خویش، زیرا شیء به خودش اضافه نمی‌شود. این وصیتی الهی به بندگانش است، هنگامی که آنان را بر صورت خویش آفرید و به هر کس از ایشان که خواست، امامت کبری (الإمامة الکبری) و دنیا و آنچه میان آن دو است، عطا کرد. و این همان است که:\n\nپیامبر (صلی الله علیه و سلم) فرمود: كلكم راع ومسئول عن رعيته (همه شما شبان هستید و در برابر رعیّت خود مسئولید).\n\nپس بالاترین مراتب شبانی، امامت کبری (الإمامة الکبری) است و پایین‌ترین آن، امامت انسان بر جوارح خویش است، و آنچه میان این دو است، شامل کسی است که بر خانواده، فرزندان، شاگردان و بردگانش امامت دارد. هیچ انسانی نیست مگر آنکه بر صورت (الهی) آفریده شده است و به همین دلیل، امامت همه انسان‌ها را در بر گرفته است. و حکم در مورد همه، از آن جهت که امام هستند، یکی است. و مُلک (پادشاهی) گسترش می‌یابد و تنگ می‌شود، همان‌گونه که مقرر کردیم. پس امام باید احوال زیردستان خود را با هر نفس مراقبت کند. و این همان امامی است که قدر آنچه خداوند او را بر آن ولایت داده و مقدم داشته است، می‌داند. همه اینها برای آن است که بداند خداوند مراقب اوست و اوست که وی را خلیفه ساخته است. سپس او را بر امری آگاه ساخت که اگر از جانب خداوند تعقل می‌کرد (می‌فهمید): و آن این است که اگر سرور، نقصانی در عین یا حال کسی که بر او سیادت دارد، ببیند، به همان اندازه از سیادت او کاسته شده و به همان اندازه معزول گشته است. مانند کسی که سهمی از بنده خود را آزاد کند؛ به همان اندازه که آزاد کرده، از بنده آزاد شده است و آزادی در تمام بنده جاری نمی‌شود مگر آنکه تمام او آزاد شود. همچنین امام، اگر به لهو و کار خویش غفلت ورزد و با رعیت خود در انواع لذات و نیل به شهواتی که بر آن هستند، شریک شود و در احوال کسانی از رعیتش که مأمور به نظر در احوال آنان است، ننگرد، با این کار، خود را با عمل خویش عزل کرده و مرتبه او را به دور افکنده است و سؤال از جانب خداوند، و وبال و ناامیدی بر او باقی می‌ماند و ریاست و سیادت را از دست می‌دهد و خداوند او را از خیر آن محروم می‌سازد و پشیمان می‌شود در حالی که پشیمانی سودی ندارد. زیرا اگر از او در این باره سؤال نمی‌شد و به حال خود رها می‌گشت، باز هم چیزی بود. مگر حق (الحق) که چیزی از مُلک او کاسته نمی‌شود، زیرا بنده او اگر از زندگی دنیا بمیرد، در برزخ به سوی او منتقل می‌شود و حکم سیادت خداوند بر او باقی می‌ماند. برخلاف انسان که اگر بنده او بمیرد، سیادت او که به واسطه آن سرور بود، از بین می‌رود. پس این تفاوت میان ما و حق (الحق) در ربوبیت است.\n\nپیامبر (صلی الله علیه و سلم) فرمود: إن الله يحب الرفق في الأمر كله (همانا خداوند رفق و مدارا را در هر کاری دوست دارد).\n\nپس دانا کسی است که رفق (الرفق)، رفیق (رفاقت‌کننده) و مرفوق (کسی که با او رفاقت می‌شود) را بشناسد. هیچ انسانی نیست مگر آنکه رفیق است و با او رفاقت می‌شود؛ پس از یک جهت مملوک است و از جهتی مالک. و رَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُكُمْ بَعْضًا سُخْرِيًّا (و برخی از شما را بر برخی دیگر به درجاتی برتری داد تا بعضی از شما، بعضی دیگر را به خدمت گیرند). و خداوند رَفِيعُ الدَّرَجاتِ (بالابرنده درجات) است. پس ما برای او هستیم، همان‌گونه که او برای ماست، و همان‌گونه که ما برای خودمان هستیم، پس ما برای خودمان و برای او هستیم، و او برای ماست نه برای خودش. و در این باب، هیچ چیز دشوارتر از اضافه کردن علم الهی به معلومات، و قدرت به مقدورات، و اراده به مرادات نیست، به دلیل حدوث تعلق؛ یعنی تعلق هر صفت به متعلق خود از حیث عالم، قادر و مرید بودن. زیرا معلومات، مقدورات و مرادات بی‌نهایت هستند و او احاطه علمی دارد به اینکه آنها پایان نمی‌پذیرند.\n\nو چون امر بر همان منوال بود که اشاره کردیم، و برخی از متکلمین که بر این امر آگاه شدند، قائل به استرسال (پیوستگی و جریان) شدند و دیگری به حدوث تعلق تعبیر کرد. و خداوند در این مقام فرمود: حَتَّى نَعْلَمَ (تا بدانیم). و برخی از علمای متقدم، تعلق علم الهی به تفصیل را به دلیل عدم تناهی در آن و اینکه داخل در هستی (الوجود) نیست، انکار کردند. پس تفصیل را از آن جهت که تفصیل است در امری کلی می‌داند، نه در فلان چیز به طور معین. و عقل‌ها در این باره مضطرب شدند به دلیل اضطراب افکارشان. و رفع اشکال در این مسئله نزد ما اهل کشف (الکشف) و شهود (الشهود) و القای الهی این است که علم، نسبتی است میان عالِم و معلومات، و در آنجا جز ذات حق (الحق) نیست که عین هستی (الوجود) اوست. و هستی (الوجود) او نه آغازی دارد و نه پایانی که حدی برای آن باشد. و معلومات، متعلق هستی (الوجود) او هستند. پس تعلق آنچه از حیث هستی (الوجود) پایان نمی‌پذیرد، به آنچه از حیث معلوم، مقدور و مراد پایان نمی‌پذیرد، برقرار است. پس هوشیار باش، زیرا این امری دقیق است. همانا حق (الحق) عین هستی (الوجود) خویش است و به وصف داخل شدن در هستی (الوجود) متصف نمی‌شود تا متناهی گردد، زیرا هر آنچه داخل در هستی (الوجود) شود، متناهی است. و بارئ (آفریننده) عین هستی (الوجود) است و داخل در هستی (الوجود) نیست، زیرا هستی او عین ماهیت اوست. و آنچه غیر از حق (الحق) است، برخی از آن داخل در هستی (الوجود) شده و با ورود به هستی (الوجود) متناهی گشته است، و برخی از آن داخل در هستی (الوجود) نشده و به وصف تناهی متصف نمی‌شود. پس آنچه را به تو تذکر دادم، محقق ساز، زیرا آن را در جای دیگری نخواهی یافت. و بر همین اساس، مقدورات و مرادات را نیز در نظر بگیر. و خداوند يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}