{
  "id": 400,
  "title": {
    "ar": "الباب الموفي أربعمائة في معرفة منازلة من ظهر لي بطنت له ومن وقف عند حدي اطلعت عليه",
    "en": "Chapter Four Hundred: Concerning the Gnosis of the Spiritual Stations (منازلة) of him who was manifest to me while I was hidden to him, and of him who stood at my boundary, I oversaw him.",
    "ur": "چار سوواں باب: ان کی منازل کی معرفت کے بیان میں جو مجھ پر ظاہر ہوا تو میں اس کے لیے باطن ہو گیا، اور جو میری حد پر ٹھہرا، میں نے اس پر اطلاع دی۔",
    "fa": "باب چهارصد و یکم در معرفت منازل کسی که برای من آشکار شد، برای او پنهان گشت، و کسی که نزد حدّ من توقف کرد، من بر او مطلع شدم."
  },
  "content": {
    "ar": "## «الباب الموفي أربعمائة في معرفة منازلة من ظهر لي بطنت له ومن وقف عند حدي اطلعت عليه»\n\n\n> ظهوري بطون الحق في كل موطن *** وحدي وجود الحق في كل مطلع‏\n\n\n> فإن كان عيني في وجودي لم يكن *** وإن كان لم يظهر وضاق من اتسع‏\n\n\n> فيا خيبة الأكوان إن لم يكن بها *** ويا سعدها إن كان في عينها طلع‏\n\n\n> هو البرق إلا أنه هو خلب *** فما يسبحه رعد ولا مطر يقع‏\n\n\n### [إن الله هو الأول والآخر]\n\n\nاعلم أيدنا الله وإياك أن الله تعالى يقول عن الهوية هُوَ الْأَوَّلُ والْآخِرُ وما ثم إلا أنا وهو وكان ولم يكن ثم كنت وعند وجودي قسم الصلاة بيني وبينه نصفين وما ثم إلا مصل كل قد علم صلاته وتسبيحه وهو السمع والبصر مني فما أسمع إلا نفسه ف هُوَ الْأَوَّلُ والْآخِرُ ما هو أنا فإن الآلة لا حكم لها إلا بالصانع بها كما كان صانعا فيها فصنع فيها بها وبنفسه بها من حيث قبولها وبنفسه من حيث تجليه بخطابه‏\n\n\n> تعددت الأعيان والأمر واحد *** وأشهدت الأكوان والله شاهد\n\n\n> فما ثم إلا الله ما ثم غيره *** أقر بتوحيد ما هو جاحد\n\n\nفإذا ظهرت بعيني في الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ بطن تعالى في خطابي وسمع إيماني وقال أثنى على عبدي فسمى آخريته عبدا وفي الجواب هو الرب فالأولية ردها إلي فإنه لم يقل حتى قلت كما أني لم أوجد حتى قال كن فكنت أول سامع وكان أول قائل ثم كنت أول قائل وكان أول سامع فتعين الباطن والظاهر وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ بي وبنفسه وما ظهر إلا بي وما بطن إلا بي وما صحت الأولية إلا بي وما ثبتت الآخرية إلا بي فإنا كل شي‏ء فهو بي عليم فلو لم أكن بمن كان يكون عالما فأنا أعطيته العلم وهو أعطاني والوجود فارتبطت الأمور بيني وبينه وقد اعترف لي بذلك في تقسيمه الصلاة بيني وبينه على السواء لأنه علم أنه لي كما أنه له فلا بد مني ومنه فلا بد من واجب وممكن ولو لم يكن كذلك لكان عاطلا غير حال فإنا زينته فهو أرضي إنا جعلنا ما على الأرض زينة لها فظهر بي اقتداره ونفوذ أحكامه وسلطان مشيئته فلو لم أكن لم تكن زينته ثم قلب الأمر فجعلني أرضا وكان زينة لي وقلدني الإمامة فلم أجد على من أكون إماما إلا عليه وعين إمامتي ما زينتي به وما زينتي إلا بهويته فهو سمعي وبصري ولساني ويدي ورجلي ومؤيدي وجعلني نورا كلي فزينني به له وأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّها وهو نُورُ السَّماواتِ والْأَرْضِ وذكر أن الأرض ذلول وهل ثم أذل مني وأنا تحت عزته ولما خلق الخلق وعرفني بما خلق قال لي اجعل بالك وتفرج في صنعي بخلقي فكلف وأنا أنظر إلى ما يريد إظهاره مما لا علم لي به فحد الحدود فتجاوزتها العبيد وقال فلم يسمع له مقال وأمر فلم يمتثل أمره ابتداء ونهي فلم يمتثل له نهي ابتداء وقال فاعترض كيف تجعل فيها من يفسد فيها فجعلوا نظرهم أصلح من نظره وعلمهم أتم من علمه فقال لي أنت قلت إنك ذلول ولا ذلة أعظم من ذلتك وأي ذلة أعظم من ذلة من أذلة الذليل هذا الملك يعترض هذا الخليفة وليته ونهيته فعصى هذا اللعين أمرته بالسجود فأبى وادعى الخيرية على من هو خير منه فهل رأيت بعينك إلا من اعترف بعظمتي ونفوذ اقتداري ومع ذلك خالفني واعترض علي وتعدى حدي فلو كانت عزتي وعظمتي حالا لهم زينتهم بها ما وقع شي‏ء من ذلك فهم أرض مرداء جرداء لا نبات فيها فلا زينة عليها فعلمت أنه متى أتيت علي فزينتهم بي فرأيتني زينتي فعظموني وما عظمني إلا زينتي فقال المعترض لا علم لنا وقال من نهيته ربنا ظلمنا أنفسنا وقال من خالف أمري إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ فأين هذا المقام من ذلك وأين دار رضوان من دار مالك ف إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فمن العزيز ومن الذليل فلو لا ما اطلع على من تجاوز الحدود والرسوم ما رجعوا إلى حدودهم فإن الاطلاع ما يكون إلا من رفيع وهو رَفِيعُ الدَّرَجاتِ فخافوا فاعترفوا كما قلنا بجهالتهم وظلمهم أنفسهم وخوفهم من تعدى حدود سيدهم فقال يا عِبادِيَ الَّذِينَ أَسْرَفُوا عَلى‏ أَنْفُسِهِمْ وتجاوزوا حدود سيدهم لا تَقْنَطُوا من رَحْمَةِ الله فإن الله للرحمة خلقهم ولهذا تسمى بالرحمن واستوى به على العرش وأرسل أكمل الرسل وأجلهم قدرا وأعمهم رسالة رحمة للعالمين ولم يخص عالما من عالم فدخل المطيع والعاصي والمؤمن والمكذب والموحد والمشرك في هذا الخطاب الذي هو مسمى العالم ولما أعطاه ص‏\nمقام الغيرة على جناب الله تعالى وما يستحقه أخذ يقنت في صلاته شهرا يدعو على طائفة من عباد الله بالهلاك رعل وذكوان وعصية عصت الله ورسوله فأنزل الله عليه وحيه بواسطة الروح الأمين يا محمد إن الله يقول لك ما أرسلك سبابا ولا لعانا وإنما بعثك رحمة أي لترحم مثل هؤلاء كأنه يقول له بدل دعائك عليهم كنت تدعوني لهم ثم تلا عليه كلام ربه وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ أي لترحمهم فإنك إذا دعوتني لهم ربما وفقتهم لطاعتي فترى سرور عينك وقرتها في طاعتهم وإذا لعنتهم ودعوت عليهم وأجبت دعاك فيهم لم يتمكن أن آخذهم إلا بأن يزيدوا طغيانا وإثما مبينا وذلك كله إنما كان بدعائك عليهم فكانت أمرتهم بالزيادة في الطغيان الذي نؤاخذهم به فتنبه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لما أدبه به ربه فقال صَلَّى اللهُ عَليهِ وسَلَّم إن الله أدبني فحسن أدبي وقال بعد ذلك اللهم اهد قومي فإنهم لا يعلمون وقام ليلة إلى الصباح لا يتلو فيها إلا قوله تعالى إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبادُكَ وإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ‏\n\n\nوهو قول عيسى عليه السلام والله تعالى قد قال له لما ذكر رسله أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ وكان من هدى عيسى عليه السلام هذه الآية التي قام بها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ليلة كله إلى الصباح أين هذا المقام من دعائه صَلَّى اللهُ عَليهِ وسَلَّم على رعل وذكوان الله يَغْفِرُ الذُّنُوبَ جَمِيعاً وما خص ذنبا من ذنب كما لم يخص إسرافا من إسراف كما لم يخص في إرسال محمد صَلَّى اللهُ عَليهِ وسَلَّم عالما من عالم إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ بالألف واللام للشمول مع عمارة الدارين فلا بد من شمول الرحمة ولو لا إن الأمور قد عين الله لها آجالا مسماة وأياما معدودات لكان عين الانتقال بالموت إلى الله عين الرحمة بهم التي تكون لهم بعد استيفاء الحدود لتعديهم الحدود فتعديهم الحدود هو الذي أقام عليهم في الدار الآخرة الحدود كما أقامها على بعضهم في الدار الدنيا فما مات أحد من خلق الله إلا كما ولد مؤمنا وما وقع الأخذ إلا بما كان بين الإيمانين فإن رحمة الله وَسِعَتْ كُلَّ شَيْ‏ءٍ وباطِنُهُ فِيهِ الرَّحْمَةُ ولهذا\n\n\nقال من ظهر لي بطنت له‏\n\n\nلأنه ما ظهر أحد لله حتى فارقه إذ لو لم يفارقه لما ميز نفسه عنه فبطن الحق في ظهوره فهو السور الذي باطِنُهُ فِيهِ الرَّحْمَةُ وظاهِرُهُ من قِبَلِهِ الْعَذابُ والناس لا يشعرون والكلام في هذا الباب لا يتناهى فصوله وهذا القدر من التنبيه على ما فيه كاف إن شاء الله لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ «انتهى الجزء الثالث من كتاب الفتوحات المكية بحمد الله وعونه وحسن توفيقه ويتلوه المجلد الرابع أوله الباب الحادي وأربعمائة»\n# [الجزء الرابع‏]\n\n\nالجزء الرابع من كتاب الفتوحات المكية التي فتح الله بها على الشيخ الإمام العامل الراسخ الكامل خاتم الأولياء الوارثين برزخ البرازخ محيي الحق و الدين أبي عبدالله محمّد بن علي المعروف بابن عربي الحاتمي الطائي قدّس الله روحه و نوّر ضريحه آمين طبع على النسخة المقابلة على نسخة المؤلف الموجودة بمدينة قونية وقام بهذا المهم جماعة من العلماء بأمر المغقور له الأمير عبد القادر الجزايرلي رحم الله الجميع وأثابهم المكان الرفيع طبع بمطبعة دار الكتب العربية الكبرى بمصر على نفقة الحاج فدا محمد الكشميري وشركاه‏\n(بسم الله الرحمن الرحيم)\n\n",
    "en": "Chapter Four Hundred: Concerning the Knowledge of the Station of Him Who Appeared to Me, I Became Hidden to Him, and Him Who Stopped at My Boundary, I Looked Upon Him\n\nMy appearance is the hiddenness (بطون) of the Real (الحق) in every place,\nAnd my boundary is the Existence (وجود) of the Real in every rising point.\n\nIf my essence (عيني) were in my existence, He would not be;\nAnd if He were, He would not appear, and that which is vast would become narrow.\n\nOh, the disappointment of the universes if He is not in them!\nAnd oh, their bliss if He appears in their very essence!\n\nHe is the lightning, yet He is deceptive (خلب);\nNo thunder glorifies Him, nor does rain fall.\n\n### [<<Indeed, Allah is the First and the Last>>]\n\nKnow—may Allah support us and you—that Allah the Exalted speaks concerning the Ipseity (الهوية): <<He is the First and the Last.>> And there was nothing there except I and He. He was, and there was nothing, then I was. Upon my existence, He divided the prayer (الصلاة) between me and Him into two halves. And there is nothing there except one who prays, each having known his prayer and his glorification (تسبيحه). And He is the Hearing and the Sight from me, so I hear nothing but Himself. Thus, <<He is the First and the Last>> is not I, for the instrument (الآلة) has no ruling power except through the Maker (الصانع) who uses it, just as He was the Maker within it. So He made within it, by means of it, and by Himself through it, from the perspective of its receptivity (قبولها), and by Himself from the perspective of His Self-disclosure (تجلي) through His address.\n\nThe entities (الأعيان) are multiple, but the Command (الأمر) is one;\nThe universes are made to witness, and Allah is the Witness.\n\nThere is nothing there but Allah, there is no other than Him;\nHe affirms the Unity (توحيد) of that which is not deniable.\n\nWhen I appeared with my essence (عيني) in <<Praise belongs to Allah, Lord of the Worlds,>> He became hidden (بطن) in my address, heard my faith, and said, \"My servant has praised Me.\" Thus, He named His Lastness (آخريته) a servant, and in the response, He is the Lord. So He returned the Firstness (الأولية) to me, for He did not speak until I spoke, just as I was not brought into existence until He said, \"Be,\" and I was. I was the first hearer, and He was the first speaker; then I was the first speaker, and He was the first hearer. Thus, the Hidden (الباطن) and the Manifest (الظاهر) were determined, and <<He is Knower of all things>>—of me and of Himself. He did not manifest except through me, nor was He hidden except through me. The Firstness was not valid except through me, nor was the Lastness established except through me. For I am every thing, so He is Knower through me. If I had not been, through whom would He have been Knower? So I gave Him Knowledge (العلم), and He gave me Existence (الوجود). Thus, all matters are linked between me and Him. He has acknowledged this to me in His equal division of the prayer between me and Him, because He knew that it belongs to me just as it belongs to Him. Therefore, there must be me and there must be Him; there must be the Necessary (واجب) and the contingent (ممكن). If it were not so, He would be idle (عاطلا), not active. For I am His adornment (زينته), and He is my earth. <<Indeed, We have made that which is on the earth an adornment for it.>> So through me, His power (اقتداره), the execution of His decrees, and the sovereignty of His Will (مشيئته) became manifest. If I had not been, His adornment would not have existed. Then He reversed the matter, making me the earth and Him the adornment for me. He entrusted me with the Imamate (الإمامة), and I found no one over whom I could be an Imam except Him. The essence of my Imamate is that with which He adorned me, and my adornment is nothing but His Ipseity (هويته). So He is my hearing, my sight, my tongue, my hand, my foot, and my supporter. He made me a total light, so He adorned me with it for Himself, and <<The earth will shine with the light of its Lord.>> And He is the <<Light of the heavens and the earth.>> He mentioned that the earth is submissive (ذلول). And is there anyone more submissive than I, while I am beneath His Might (عزته)?\n\nWhen He created the Creation (الخلق) and made me know what He created, He said to me, \"Pay attention and observe My making in My creation.\" So He imposed duties, and I looked upon what He wished to manifest, of which I had no prior knowledge. He set boundaries, but the servants transgressed them. He spoke, but His word was not heard. He commanded, but His command was not obeyed initially. He forbade, but His prohibition was not obeyed initially. He spoke, and they objected: \"How will You place therein one who causes corruption?\" Thus, they made their view more righteous than His view, and their knowledge more complete than His knowledge. Then He said to me, \"You said that you are submissive, and there is no greater submission than yours. And what submission is greater than the submission of the one whom the submissive one humiliates? This angel objects, this Caliph I appointed and forbade, yet he disobeyed. This accursed one I commanded to prostrate, but he refused and claimed superiority over one who is better than him. Did you see with your own eye anyone except those who acknowledged My Greatness (عظمتي) and the execution of My power (اقتداري), yet despite that, they opposed Me, objected to Me, and transgressed My boundary? If My Might and My Greatness were a state (حال) for them, with which I adorned them, none of that would have occurred. Thus, they are barren, desolate earth, in which there is no vegetation, and therefore no adornment upon it. So I knew that whenever I came upon them and adorned them with Myself, they saw Me as their adornment, and thus they magnified Me. And nothing magnified Me except My adornment. Then the objector said, 'We have no knowledge.' And he whom I forbade said, 'Our Lord, we have wronged ourselves.' And he who opposed My command said, <<Indeed, I fear Allah, Lord of the Worlds.>> So where is this station compared to that? And where is the Abode of Contentment (دار رضوان) compared to the Abode of Malik (Hell)? For <<To Him returns the whole Command (الأمر).>> So who is the Mighty (العزيز) and who is the submissive (الذليل)? Were it not for what He looked upon in those who transgressed the boundaries and ordinances (الرسوم), they would not have returned to their limits. For the looking upon (الاطلاع) only comes from the Exalted, and He is <<Exalter of Ranks (رفيع الدرجات).>> So they feared, and they confessed, as we said, their ignorance, their wronging of themselves, and their fear of transgressing the boundaries of their Lord. So He said, <<O My servants who have transgressed against themselves>> and exceeded the boundaries of their Lord, <<do not despair of the Mercy of Allah.>> For Allah created them for Mercy (الرحمة), and for this reason, He named Himself the All-Merciful (الرحمن) and established Himself upon the Throne by it. And He sent the most perfect of Messengers, the greatest in rank, and the most universal in message, as a mercy to the worlds (رحمة للعالمين), without specifying one world over another. Thus, the obedient and the disobedient, the believer and the denier, the monotheist and the polytheist, all entered into this address, which is the designation of 'the world' (العالم).\n\nAnd when He granted him [the Prophet] the station of protective jealousy (الغيرة) over the Divine Presence and what it deserves, he began to perform *qunut* (supplication) in his prayer for a month, praying for the destruction of a group of Allah’s servants: Ri’l, Dhakwan, and Usayya, who disobeyed Allah and His Messenger. Then Allah sent down His revelation to him through the Trustworthy Spirit (الروح الأمين): \"O Muhammad, Allah says to you: 'I did not send you as an insulter or a curser, but rather I sent you as a Mercy,' meaning, so that you may have mercy upon the likes of these.\" It is as if He was saying to him: Instead of praying against them, you should have prayed to Me for them. Then He recited to him the word of his Lord: <<And We have not sent you except as a Mercy to the worlds.>> Meaning, so that you may have mercy upon them. For if you pray to Me for them, perhaps I will grant them success in obeying Me, and you will see the joy and comfort of your eye in their obedience. But if you curse them and pray against them, and I answer your prayer concerning them, I cannot seize them except by their increasing in manifest transgression (طغيانا) and sin. And all of that would only have occurred because of your prayer against them, so you would have commanded them to increase in the transgression for which We hold them accountable. The Messenger of Allah (may Allah bless him and grant him peace) became aware of the discipline (أدبه) with which his Lord disciplined him, and he said, \"Indeed, Allah disciplined me, and He perfected my discipline.\" And after that, he said, \"O Allah, guide my people, for they do not know.\" And he stood one night until morning, reciting nothing but the saying of the Exalted: <<If You punish them, they are Your servants; but if You forgive them, indeed, You are the Mighty, the Wise.>>\n\nThis is the saying of Jesus (peace be upon him). And Allah the Exalted said to him [Muhammad] when mentioning His Messengers: <<Those are the ones whom Allah has guided, so follow their guidance.>> And part of the guidance of Jesus (peace be upon him) was this verse, with which the Messenger of Allah (may Allah bless him and grant him peace) stood the entire night until morning. Where is this station compared to his prayer (may Allah bless him and grant him peace) against Ri’l and Dhakwan? <<Allah forgives all sins,>> and He did not specify one sin over another, just as He did not specify one transgression (إسراف) over another, nor did He specify one world over another in the sending of Muhammad (may Allah bless him and grant him peace). <<Indeed, He is the Forgiving, the Merciful>> (using the definite article for comprehensiveness), along with the flourishing of the two abodes (this world and the Hereafter). Thus, the comprehensiveness of Mercy is necessary. Were it not that Allah has appointed for all matters fixed terms (آجالا مسماة) and numbered days, the very act of transitioning to Allah through death would be the essence of the Mercy that awaits them after the fulfillment of the penalties (الحدود) for their transgression of boundaries. Their transgression of the boundaries is what established the penalties upon them in the Hereafter, just as He established them upon some of them in this world. No one among Allah’s creation dies except as he was born: a believer. The seizure (الأخذ) only occurs because of what transpired between the two states of faith. For <<The Mercy of Allah encompasses all things,>> and its interior (باطنه) contains Mercy.\n\nAnd for this reason, He said: \"Of him who appeared to Me, I became hidden to him.\"\n\nBecause no one appeared to Allah until he separated from Him; for if he had not separated from Him, he would not have distinguished himself from Him. So the Real (الحق) is hidden in His manifestation. Thus, He is the wall (السور) <<the interior of which contains Mercy, and the exterior of which is the torment.>> And people do not perceive this. The discussions in this chapter are endless in their sections. This much of an indication regarding what it contains is sufficient, God willing, <<for whoever has a heart or lends an ear while he is a witness.>> And Allah <<speaks the Truth, and He guides to the way.>>\n\n[End of the Third Volume of *Al-Futuhat al-Makkiyya* (The Meccan Revelations), by the praise, aid, and good success of Allah. It is followed by the Fourth Volume, the beginning of which is Chapter Four Hundred and One.]\n\n***\n\n### [The Fourth Volume]\n\nThe Fourth Volume of *Al-Futuhat al-Makkiyya* (The Meccan Revelations), which Allah opened up to the Shaykh, the Imam, the Active Gnostic, the Deeply Rooted, the Perfect, the Seal of the Inheriting Saints (خاتم الأولياء الوارثين), the Isthmus of Isthmuses (برزخ البرازخ), the Reviver of the Truth and the Religion (محيي الحق و الدين), Abu Abdullah Muhammad ibn Ali, known as Ibn Arabi al-Hatimi al-Ta'i—may Allah sanctify his soul and illuminate his tomb, Amen. Printed based on the copy collated against the author's own manuscript found in the city of Konya. This important task was undertaken by a group of scholars by order of the late Amir Abd al-Qadir al-Jaza'irli (may Allah have mercy on all of them and reward them with a high station). Printed at the Great Arab Book Press in Egypt, at the expense of Al-Hajj Fida Muhammad al-Kashmiri and his partners.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "باب نمبر چار سو میں اس شخص کے مقام کی معرفت جس کے لیے میں ظاہر ہوا تو وہ میرے لیے باطن ہو گیا، اور جس نے میری حد پر قیام کیا تو میں اس پر مطلع ہو گیا۔\n\nمیرا ظہور ہر مقام پر ذات حق (الحق) کا بطون ہے،\nاور میری حد ہر طلوع ہونے والی شے میں ذات حق (الحق) کی ہستی (الوجود) ہے۔\nپس اگر وہ میری ہستی (الوجود) میں میری آنکھ ہو تو وہ نہیں ہوتا،\nاور اگر وہ ظاہر نہ ہو تو وہ تنگ ہو جاتا ہے جو وسیع تھا۔\nاے کائنات کی محرومی اگر وہ ان میں نہ ہو،\nاور اے ان کی خوش نصیبی اگر وہ ان کی آنکھ میں طلوع ہو جائے۔\nوہ بجلی ہے مگر وہ جھوٹی چمک ہے،\nپس نہ کوئی گرج اس کی تسبیح کرتی ہے اور نہ کوئی بارش برستی ہے۔\n\n### [بے شک اللہ ہی اول اور آخر ہے]\n\nجان لو، اللہ ہمیں اور تمہیں تائید بخشے، کہ اللہ تعالیٰ ہویت (Huwiyyah) کے بارے میں فرماتا ہے: **هُوَ الْأَوَّلُ والْآخِرُ** (وہی اول ہے اور وہی آخر ہے)۔ اور وہاں میرے اور اس کے سوا کچھ نہیں تھا۔ وہ تھا اور میں نہیں تھا، پھر میں وجود (الوجود) میں آیا۔ اور میرے وجود (الوجود) کے وقت اس نے نماز کو میرے اور اپنے درمیان نصف نصف تقسیم کر دیا۔ اور وہاں نماز پڑھنے والے کے سوا کوئی نہیں ہے، ہر ایک اپنی نماز اور تسبیح کو جانتا ہے۔ اور وہ مجھ سے سننا اور دیکھنا ہے۔ پس میں اس کے سوا کسی کو نہیں سنتا۔ پس **هُوَ الْأَوَّلُ والْآخِرُ** (وہی اول ہے اور وہی آخر ہے) وہ میں نہیں ہوں۔ کیونکہ آلہ کا کوئی حکم نہیں ہوتا مگر اس صانع کے ذریعے جو اسے بناتا ہے، جیسا کہ وہ اس میں صانع تھا۔ پس اس نے اس میں اس کے ذریعے اور اپنے نفس کے ذریعے بنایا، اس کے قبول کرنے کے اعتبار سے، اور اپنے نفس کے ذریعے اپنے خطاب کے ساتھ ظہور الٰہی (التجلی) کے اعتبار سے۔\n\nاعیان (حقائق) متعدد ہوئے اور امر ایک ہے،\nاور کائناتوں کو گواہ بنایا گیا اور اللہ گواہ ہے۔\nپس وہاں اللہ کے سوا کچھ نہیں، وہاں اس کے سوا کوئی نہیں،\nوہ توحید کا اقرار کرتا ہے جس کا وہ منکر ہے۔\n\nپس جب میں اپنی آنکھ سے **الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ** (تمام تعریف اللہ کے لیے ہے جو تمام جہانوں کا رب ہے) میں ظاہر ہوا، تو وہ میرے خطاب میں باطن ہو گیا اور میرے ایمان کو سنا اور فرمایا: \"میرے بندے نے میری تعریف کی ہے۔\" پس اس نے میری آخریت کو بندہ (عبد) کہا، اور جواب میں وہ رب ہے۔ پس اولیت اس نے میری طرف لوٹا دی، کیونکہ اس نے تب تک نہیں کہا جب تک میں نے نہیں کہا، جیسا کہ میں تب تک وجود میں نہیں آیا جب تک اس نے 'کن' (ہو جا) نہیں کہا۔ پس میں پہلا سننے والا تھا اور وہ پہلا کہنے والا تھا۔ پھر میں پہلا کہنے والا تھا اور وہ پہلا سننے والا تھا۔ پس باطن اور ظاہر متعین ہو گئے، اور **وَهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ** (اور وہ ہر چیز کو جاننے والا ہے) مجھے بھی اور اپنے نفس کو بھی۔ اور وہ میرے بغیر ظاہر نہیں ہوا، اور میرے بغیر باطن نہیں ہوا۔ اور اولیت میرے بغیر صحیح نہیں ہوئی، اور آخریت میرے بغیر ثابت نہیں ہوئی۔ پس ہم ہر شے ہیں، تو وہ میرے ذریعے علیم ہے۔ اگر میں نہ ہوتا تو وہ کس کے ذریعے عالم ہوتا؟ پس میں نے اسے علم دیا اور اس نے مجھے ہستی (الوجود) دی۔ پس معاملات میرے اور اس کے درمیان مربوط ہو گئے۔ اور اس نے نماز کو میرے اور اپنے درمیان برابر تقسیم کر کے اس کا اعتراف کیا، کیونکہ وہ جانتا تھا کہ یہ میرے لیے ہے جیسا کہ اس کے لیے ہے۔ پس مجھ سے اور اس سے چارہ نہیں، پس واجب (واجب الوجود) اور ممکن (ممکن الوجود) سے چارہ نہیں۔ اور اگر ایسا نہ ہوتا تو وہ معطل ہوتا، غیر حال ہوتا۔ پس میں اس کی زینت ہوں اور وہ میری زمین ہے۔ **إِنَّا جَعَلْنَا مَا عَلَى الْأَرْضِ زِينَةً لَهَا** (بے شک ہم نے جو کچھ زمین پر ہے اسے اس کے لیے زینت بنایا ہے)۔ پس میرے ذریعے اس کی قدرت، اس کے احکام کا نفاذ، اور اس کی مشیئت کا غلبہ ظاہر ہوا۔ پس اگر میں نہ ہوتا تو اس کی زینت نہ ہوتی۔ پھر اس نے معاملہ پلٹ دیا اور مجھے زمین بنا دیا اور وہ میرے لیے زینت بن گیا۔ اور اس نے مجھے امامت کا قلادہ پہنایا، تو میں نے اس کے سوا کسی کو نہ پایا جس پر میں امام بنوں۔ اور میری امامت کی آنکھ وہ ہے جس سے اس نے مجھے مزین کیا، اور میری زینت اس کی ہویت (Huwiyyah) کے سوا کچھ نہیں۔ پس وہ میرا سننا، میرا دیکھنا، میری زبان، میرا ہاتھ، میرا پاؤں اور میرا مددگار ہے۔ اور اس نے مجھے کلی نور بنا دیا، پس اس نے مجھے اس کے ذریعے اس کے لیے مزین کیا، اور **وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا** (اور زمین اپنے رب کے نور سے چمک اٹھے گی) اور وہ **نُورُ السَّماواتِ والْأَرْضِ** (آسمانوں اور زمین کا نور) ہے۔ اور اس نے ذکر کیا کہ زمین ذلیل ہے، اور کیا مجھ سے زیادہ کوئی ذلیل ہے جبکہ میں اس کی عزت کے تحت ہوں؟\n\nاور جب اس نے مخلوق (الخلق) کو پیدا کیا اور مجھے اس سے متعارف کرایا جو اس نے پیدا کیا، تو اس نے مجھ سے کہا: \"اپنا دھیان رکھو اور میری مخلوق میں میری کاریگری کا نظارہ کرو۔\" پس اس نے مکلف بنایا اور میں دیکھ رہا تھا کہ وہ کیا ظاہر کرنا چاہتا ہے جس کا مجھے علم نہیں تھا۔ پس اس نے حدود مقرر کیں تو بندوں نے ان سے تجاوز کیا۔ اور اس نے کہا تو اس کی بات نہیں سنی گئی، اور اس نے حکم دیا تو ابتدا میں اس کے حکم کی تعمیل نہیں کی گئی، اور اس نے منع کیا تو ابتدا میں اس کی ممانعت کی تعمیل نہیں کی گئی۔ اور اس نے کہا تو اعتراض کیا گیا کہ \"تو اس میں ایسے شخص کو کیوں بناتا ہے جو اس میں فساد کرے گا؟\" پس انہوں نے اپنے خیال کو اس کے خیال سے بہتر اور اپنے علم کو اس کے علم سے کامل سمجھا۔ تو اس نے مجھ سے کہا: \"تم نے کہا تھا کہ تم ذلیل ہو، اور تمہاری ذلت سے بڑی کوئی ذلت نہیں ہے۔ اور اس شخص کی ذلت سے بڑی کیا ذلت ہو گی جسے ذلیل نے ذلیل کیا؟ اس فرشتے نے اعتراض کیا، اس خلیفہ کو میں نے ولایت دی اور منع کیا تو اس نے نافرمانی کی، اس ملعون کو میں نے سجدے کا حکم دیا تو اس نے انکار کیا اور اس شخص پر فضیلت کا دعویٰ کیا جو اس سے بہتر ہے۔\" پس کیا تم نے اپنی آنکھ سے اس کے سوا کسی کو دیکھا جس نے میری عظمت اور میرے اقتدار کے نفاذ کا اعتراف کیا ہو؟ اور اس کے باوجود اس نے میری مخالفت کی، مجھ پر اعتراض کیا اور میری حد سے تجاوز کیا۔ پس اگر میری عزت اور عظمت ان کے لیے حال ہوتی جس سے میں انہیں مزین کرتا تو ان میں سے کچھ بھی واقع نہ ہوتا۔ پس وہ بنجر، خشک زمین ہیں جس میں کوئی نباتات نہیں، لہٰذا ان پر کوئی زینت نہیں۔ پس میں نے جان لیا کہ جب بھی میں ان کے پاس آیا اور انہیں اپنے ذریعے مزین کیا، تو انہوں نے مجھے اپنی زینت دیکھا، پس انہوں نے میری تعظیم کی، اور میری تعظیم میری زینت کے سوا کسی نے نہیں کی۔ پس اعتراض کرنے والے نے کہا: **لَا عِلْمَ لَنَا** (ہمیں کوئی علم نہیں ہے)۔ اور جسے میں نے منع کیا تھا اس نے کہا: **رَبَّنَا ظَلَمْنَا أَنْفُسَنَا** (اے ہمارے رب! ہم نے اپنی جانوں پر ظلم کیا)۔ اور جس نے میرے حکم کی مخالفت کی اس نے کہا: **إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ** (بے شک میں اللہ سے ڈرتا ہوں جو تمام جہانوں کا رب ہے)۔ پس یہ مقام اس مقام سے کہاں ہے؟ اور دار رضوان (جنت) دار مالک (جہنم) سے کہاں ہے؟ پس **إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اسی کی طرف تمام معاملات لوٹائے جاتے ہیں)۔ پس کون عزیز ہے اور کون ذلیل؟ اگر وہ لوگ جو حدود اور رسوم سے تجاوز کر گئے تھے، ان پر اطلاع نہ ہوتی تو وہ اپنی حدود کی طرف واپس نہ آتے۔ اور اطلاع صرف بلند ذات کی طرف سے ہوتی ہے، اور وہ **رَفِيعُ الدَّرَجَاتِ** (بلند درجات والا) ہے۔ پس وہ ڈر گئے اور اعتراف کیا، جیسا کہ ہم نے کہا، اپنی جہالت، اپنی جانوں پر ظلم اور اپنے آقا کی حدود سے تجاوز کرنے کے خوف کا۔\n\nپس اس نے فرمایا: **يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ** (اے میرے وہ بندو جنہوں نے اپنی جانوں پر زیادتی کی) اور اپنے آقا کی حدود سے تجاوز کیا، **لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ** (اللہ کی رحمت سے مایوس نہ ہو)۔ کیونکہ اللہ نے انہیں رحمت کے لیے پیدا کیا ہے، اور اسی لیے اس نے اپنا نام رحمن رکھا اور اس کے ذریعے عرش پر استواء فرمایا۔ اور اس نے سب سے کامل رسول، سب سے بلند قدر والے اور سب سے عام رسالت والے کو تمام جہانوں کے لیے رحمت بنا کر بھیجا، اور کسی ایک عالم کو دوسرے عالم سے خاص نہیں کیا۔ پس فرمانبردار اور نافرمان، مومن اور جھٹلانے والا، موحد اور مشرک سب اس خطاب میں داخل ہو گئے جو عالم (جہان) کا نام ہے۔ اور جب اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو اللہ کی جناب پر غیرت کا مقام اور جو کچھ اس کا حق ہے عطا فرمایا، تو آپ صلی اللہ علیہ وسلم نے ایک ماہ تک اپنی نماز میں قنوت پڑھنا شروع کر دیا، جس میں آپ صلی اللہ علیہ وسلم اللہ کے بندوں کے ایک گروہ (رعل، ذکوان اور عُصَیَّہ) کے لیے ہلاکت کی دعا کرتے تھے جنہوں نے اللہ اور اس کے رسول کی نافرمانی کی تھی۔ پس اللہ نے روح الامین کے ذریعے آپ صلی اللہ علیہ وسلم پر وحی نازل فرمائی: \"اے محمد! اللہ آپ سے فرماتا ہے کہ میں نے آپ کو گالی دینے والا یا لعنت کرنے والا بنا کر نہیں بھیجا، بلکہ آپ کو رحمت بنا کر بھیجا ہے، یعنی تاکہ آپ ان جیسے لوگوں پر رحم کریں۔\" گویا وہ آپ صلی اللہ علیہ وسلم سے فرما رہا تھا کہ ان کے خلاف دعا کرنے کے بجائے، آپ میرے لیے ان کے حق میں دعا کرتے۔ پھر اس نے آپ صلی اللہ علیہ وسلم پر اپنے رب کا کلام تلاوت فرمایا: **وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ** (اور ہم نے آپ کو تمام جہانوں کے لیے رحمت بنا کر ہی بھیجا ہے)۔ یعنی تاکہ آپ ان پر رحم کریں، کیونکہ جب آپ ان کے لیے مجھ سے دعا کریں گے تو شاید میں انہیں اپنی اطاعت کی توفیق دے دوں، پس آپ ان کی اطاعت میں اپنی آنکھ کی ٹھنڈک اور خوشی دیکھیں گے۔ اور جب آپ ان پر لعنت کریں گے اور ان کے خلاف دعا کریں گے اور میں آپ کی دعا قبول کر لوں گا، تو میں انہیں تب تک نہیں پکڑ سکتا جب تک وہ سرکشی اور کھلے گناہ میں اضافہ نہ کر دیں۔ اور یہ سب کچھ آپ کی ان کے خلاف دعا کی وجہ سے ہی ہوا، پس گویا آپ نے انہیں اس سرکشی میں اضافے کا حکم دیا جس پر ہم انہیں پکڑیں گے۔ پس رسول اللہ صلی اللہ علیہ وسلم اس بات پر متنبہ ہوئے جس کے ذریعے ان کے رب نے انہیں ادب سکھایا تھا۔ پس آپ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ نے مجھے ادب سکھایا اور میرے ادب کو خوبصورت بنا دیا۔\" اور اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا: \"اے اللہ! میری قوم کو ہدایت دے، کیونکہ وہ نہیں جانتے۔\" اور آپ صلی اللہ علیہ وسلم ایک رات سے صبح تک کھڑے رہے، اس میں صرف اللہ تعالیٰ کا یہ قول تلاوت کرتے رہے: **إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ** (اگر تو انہیں عذاب دے تو وہ تیرے ہی بندے ہیں، اور اگر تو انہیں بخش دے تو بے شک تو ہی غالب، حکمت والا ہے)۔\n\nاور یہ عیسیٰ علیہ السلام کا قول ہے۔ اور اللہ تعالیٰ نے جب اپنے رسولوں کا ذکر کیا تو آپ صلی اللہ علیہ وسلم سے فرمایا: **أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ** (یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کریں)۔ اور عیسیٰ علیہ السلام کی ہدایت میں یہ آیت بھی شامل تھی جس کے ساتھ رسول اللہ صلی اللہ علیہ وسلم پوری رات صبح تک کھڑے رہے۔ آپ صلی اللہ علیہ وسلم کا رعل اور ذکوان کے خلاف دعا کرنا اس مقام سے کہاں ہے؟ اللہ **يَغْفِرُ الذُّنُوبَ جَمِيعًا** (تمام گناہوں کو بخش دیتا ہے)، اور اس نے کسی گناہ کو دوسرے گناہ سے خاص نہیں کیا، جیسا کہ اس نے کسی زیادتی کو دوسری زیادتی سے خاص نہیں کیا، جیسا کہ محمد صلی اللہ علیہ وسلم کی رسالت میں کسی عالم کو دوسرے عالم سے خاص نہیں کیا۔ **إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ** (بے شک وہی بخشنے والا، نہایت رحم کرنے والا ہے) الف لام کے ساتھ شمولیت کے لیے ہے، دونوں جہانوں کی آبادی کے ساتھ۔ پس رحمت کا شمول ضروری ہے۔ اور اگر یہ نہ ہوتا کہ اللہ نے معاملات کے لیے مقررہ مدتیں اور گنے ہوئے دن مقرر کر رکھے ہیں، تو موت کے ذریعے اللہ کی طرف منتقل ہونا ہی ان کے لیے عین رحمت ہوتا، جو انہیں حدود سے تجاوز کرنے کے بعد حدود پوری ہونے پر حاصل ہوتی۔ پس ان کا حدود سے تجاوز کرنا ہی وہ چیز ہے جس نے ان پر آخرت کے گھر میں حدود قائم کیں، جیسا کہ ان میں سے بعض پر دنیا کے گھر میں قائم کیں۔ پس اللہ کی مخلوق میں سے کوئی بھی نہیں مرتا مگر اسی طرح جیسے وہ مومن پیدا ہوا تھا، اور پکڑ صرف ان دو ایمانوں کے درمیان واقع ہونے والے عمل پر ہوتی ہے۔ کیونکہ اللہ کی رحمت **وَسِعَتْ كُلَّ شَيْءٍ** (ہر چیز پر محیط ہے) اور اس کا باطن رحمت رکھتا ہے۔ اور اسی لیے\n\nاس نے فرمایا: \"جو میرے لیے ظاہر ہوا، میں اس کے لیے باطن ہو گیا۔\"\n\nکیونکہ کوئی بھی اللہ کے لیے ظاہر نہیں ہوا جب تک کہ اس سے جدا نہ ہو گیا، کیونکہ اگر وہ اس سے جدا نہ ہوتا تو وہ اپنے آپ کو اس سے ممتاز نہ کر پاتا۔ پس ذات حق (الحق) اپنے ظہور میں باطن ہو گئی، پس وہ وہ دیوار ہے جس کا **بَاطِنُهُ فِيهِ الرَّحْمَةُ وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ** (جس کے اندر رحمت ہے اور جس کے باہر کی طرف عذاب ہے)، اور لوگ نہیں جانتے۔ اور اس باب میں کلام کے ابواب ختم نہیں ہوتے۔ اور اس میں جو کچھ ہے اس پر یہ تنبیہ کافی ہے، ان شاء اللہ، **لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ** (جس کے پاس دل ہو یا جو کان لگائے اور وہ حاضر ہو)۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔ \"اللہ کی حمد، اس کی مدد اور اس کی حسن توفیق سے کتاب الفتوحات المکیہ کا تیسرا حصہ مکمل ہوا۔ اس کے بعد چوتھی جلد شروع ہو گی جس کا پہلا باب چار سو ایک ہے۔\"\n\n# [چوتھا حصہ]\n\nالفتوحات المکیہ کا چوتھا حصہ، جو اللہ نے شیخ، امام، عامل، راسخ، کامل، خاتم الاولیاء الوارثین، برزخ البرازخ، محی الحق و الدین، ابو عبداللہ محمد بن علی المعروف بابن عربی الحاتمی الطائی پر کھولیں، قدس اللہ روحہ و نور ضریحہ آمین۔ یہ نسخہ مصنف کے قونیہ میں موجود نسخے کے مقابلے میں چھاپا گیا، اور یہ اہم کام مرحوم امیر عبدالقادر الجزائری (اللہ سب پر رحم کرے اور انہیں بلند مقام عطا فرمائے) کے حکم پر علماء کی ایک جماعت نے انجام دیا۔ یہ دار الکتب العربیہ الکبریٰ پریس، مصر میں الحاج فدا محمد کشمیری اور ان کے شرکاء کے خرچ پر چھاپا گیا۔\n\n(شروع اللہ کے نام سے جو بڑا مہربان، نہایت رحم والا ہے)",
    "fa": "باب چهارصد و یکم در معرفت جایگاه کسی که برای من آشکار شد، من برای او پنهان گشتم، و کسی که نزد حدّ من توقف کرد، من بر او آگاه شدم.\n\nظهور من، بطون (پنهانی) حق (الحق) است در هر جایگاه\nو حدّ من، هستی (الوجود) حق (الحق) است در هر مطلع\n\nپس اگر چشم من در هستی (الوجود) من باشد، او نیست\nو اگر او نباشد، آنکه وسعت یافته، تنگ می‌شود\n\nای ناامیدی کائنات اگر او در آن‌ها نباشد\nو ای سعادت آن‌ها اگر او در چشمشان طلوع کند\n\nاو برق است، جز اینکه او برقی دروغین (خلب) است\nپس نه رعدی او را تسبیح می‌گوید و نه بارانی می‌بارد\n\n### [همانا خداوند اول و آخر است]\n\nبدان، خداوند ما و تو را تأیید کند، که خداوند متعال درباره هویت (الهویه) می‌فرماید: «هُوَ الْأَوَّلُ وَالْآخِرُ» (اوست اول و آخر). و در آنجا جز من و او نبود. او بود و من نبودم، سپس من بودم. و هنگام هستی (الوجود) من، نماز را میان من و خود به دو نیم تقسیم کرد. و در آنجا جز نمازگزار نبود، که هر یک نماز و تسبیح خود را می‌دانست. و او سمع و بصر از جانب من است، پس من جز خود او را نمی‌شنوم. پس «هُوَ الْأَوَّلُ وَالْآخِرُ» (اوست اول و آخر) من نیستم؛ زیرا آلت (ابزار) حکمی ندارد مگر به واسطه سازنده‌اش، همان‌گونه که او در آن سازنده بود. پس در آن به واسطه آن و به واسطه خود در آن ساخت، از حیث پذیرش آن (آلت) و به واسطه خود از حیث تجلی (التجلی) او با خطابش.\n\nاعیان (حقایق ثابت) متعدد گشتند و امر یکی است\nو کائنات به شهادت طلبیده شدند و خداوند شاهد است\n\nپس در آنجا جز الله نیست، و غیر او نیست\nبه توحید (یگانگی) کسی اقرار می‌کنم که منکر نیست\n\nپس هنگامی که با چشم خود در «الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ» (ستایش از آنِ خداوندی است که پروردگار جهانیان است) آشکار شدم، او تعالی در خطاب من پنهان گشت و ایمان مرا شنید و فرمود: «بنده‌ام مرا ستود.» پس آخریت (آخر بودن) مرا بنده نامید و در جواب، او پروردگار است. پس اولیت (اول بودن) را به من بازگرداند، زیرا او نگفت تا من گفتم، همان‌گونه که من موجود نشدم تا او گفت: «باش»، پس من بودم. پس من اولین شنونده بودم و او اولین گوینده بود. سپس من اولین گوینده بودم و او اولین شنونده بود. پس باطن و ظاهر مشخص شد و «وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ» (و او به هر چیزی داناست) به من و به خود. و جز به واسطه من آشکار نشد و جز به واسطه من پنهان نماند. و اولیت (اول بودن) جز به واسطه من صحیح نشد و آخریت (آخر بودن) جز به واسطه من ثابت نگشت. پس ما هر دو چیز هستیم، و او به واسطه من داناست. اگر من نبودم، به واسطه چه کسی دانا می‌بود؟ پس من به او علم دادم و او به من هستی (الوجود) داد. پس امور میان من و او مرتبط گشت. و او به این امر برای من اعتراف کرد در تقسیم نماز میان من و خود به طور مساوی، زیرا دانست که آن برای من است همان‌گونه که برای اوست. پس چاره‌ای از من و او نیست. پس چاره‌ای از واجب و ممکن نیست. و اگر چنین نبود، او معطل و بی‌کار می‌ماند. پس من زینت او هستم و او زمین من است: «إِنَّا جَعَلْنَا مَا عَلَى الْأَرْضِ زِينَةً لَهَا» (ما آنچه را بر روی زمین است، زینت آن قرار دادیم). پس اقتدار او و نفوذ احکامش و سلطنت مشیّتش به واسطه من آشکار شد. اگر من نبودم، زینت او وجود نداشت. سپس امر را برگرداند و مرا زمین قرار داد و او زینت من بود و امامت را به گردن من نهاد. پس کسی را نیافتم که بر او امام باشم جز خودش. و عین امامت من، همان چیزی است که او مرا به آن زینت داد، و زینت من جز به هویت (الهویه) او نیست. پس او سمع و بصر و زبان و دست و پای و تأییدکننده من است. و مرا نوری کلی قرار داد، پس مرا به واسطه آن برای خود زینت داد و «وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا» (و زمین به نور پروردگارش روشن شد) و او «نُورُ السَّمَاوَاتِ وَالْأَرْضِ» (نور آسمان‌ها و زمین) است. و ذکر کرد که زمین رام است، و آیا در آنجا رام‌تر از من هست، در حالی که من تحت عزّت او هستم؟\n\nو هنگامی که خلق را آفرید و مرا به آنچه آفرید شناساند، به من گفت: «توجه کن و در صنع من با خلقم تماشا کن.» پس تکلیف کرد و من به آنچه می‌خواست آشکار کند و من به آن علم نداشتم، می‌نگریستم. پس حدود را تعیین کرد، اما بندگان از آن تجاوز کردند. و گفت، اما سخنش شنیده نشد. و امر کرد، اما امرش در ابتدا اطاعت نشد. و نهی کرد، اما نهی‌اش در ابتدا امتثال نشد. و گفت: «پس چگونه اعتراض می‌کنی که در آن کسی را قرار می‌دهی که فساد می‌کند؟» پس نظر خود را بهتر از نظر او و علم خود را کامل‌تر از علم او دانستند. پس به من گفت: «تو گفتی که رام هستی، و هیچ خواری‌ای بزرگ‌تر از خواری تو نیست. و چه خواری‌ای بزرگ‌تر از خواری کسی که ذلیل، او را خوار کند؟ این فرشته اعتراض می‌کند، این خلیفه را ولیّ قرار دادم و نهی‌اش کردم، اما نافرمانی کرد. این ملعون را به سجده امر کردم، اما سر باز زد و ادعای برتری بر کسی کرد که از او بهتر است. آیا با چشمت جز کسی را دیدی که به عظمت من و نفوذ اقتدارم اعتراف کرد، با این حال با من مخالفت کرد و بر من اعتراض نمود و از حدّ من تجاوز کرد؟» پس اگر عزّت و عظمت من حال آن‌ها بود و من آن‌ها را به آن زینت می‌دادم، هیچ یک از این‌ها واقع نمی‌شد. پس آن‌ها زمینی بی‌گیاه و خشک هستند که در آن هیچ رستنی نیست، پس زینتی بر آن نیست. پس دانستم که هرگاه بر من وارد شوم و آن‌ها را به واسطه خود زینت دهم، مرا زینت خود می‌بینند، پس مرا تعظیم می‌کنند، و مرا تعظیم نکرد مگر زینت من. پس معترض گفت: «ما را علمی نیست.» و کسی که او را نهی کردم گفت: «رَبَّنَا ظَلَمْنَا أَنْفُسَنَا» (پروردگارا، ما به خودمان ستم کردیم). و کسی که با امر من مخالفت کرد گفت: «إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ» (من از خداوند، پروردگار جهانیان، می‌ترسم). پس این مقام کجا و آن کجا؟ و دار رضوان کجا و دار مالک (جهنم) کجا؟ پس «إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ» (همه امور به سوی او بازگردانده می‌شود). پس عزیز کیست و ذلیل کیست؟ اگر آگاهی بر کسانی که از حدود و رسوم تجاوز کردند نبود، به حدود خود باز نمی‌گشتند. زیرا آگاهی جز از سوی بلندمرتبه نیست، و او «رَفِيعُ الدَّرَجَاتِ» (بالابرنده درجات) است. پس ترسیدند و همان‌گونه که گفتیم به جهالت و ظلم خود بر نفسشان و ترسشان از تجاوز به حدود سرورشان اعتراف کردند. پس فرمود: «يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ» (ای بندگان من که بر خود اسراف کرده‌اید) و از حدود سرورشان تجاوز کرده‌اند، «لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ» (از رحمت خداوند ناامید نشوید). زیرا خداوند آن‌ها را برای رحمت آفریده است. و به همین دلیل به «الرحمن» نامیده شد و با آن بر عرش استوا یافت. و کامل‌ترین رسولان و بزرگ‌ترین آن‌ها از نظر قدر و عام‌ترین آن‌ها از نظر رسالت را فرستاد، که رحمتی برای جهانیان بود، و عالمی را از عالم دیگر استثنا نکرد. پس مطیع و عاصی، مؤمن و تکذیب‌کننده، موحد و مشرک در این خطاب که نام عالم است، داخل شدند.\n\nو هنگامی که به پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) مقام غیرت بر ساحت خداوند متعال و آنچه شایسته اوست داده شد، یک ماه در نماز خود قنوت گرفت و بر گروهی از بندگان خدا به هلاکت دعا کرد: رِعل و ذَکوان و عُصَیّه که نافرمانی خدا و رسولش را کردند. پس خداوند وحی خود را به واسطه روح‌الامین بر او نازل کرد: «ای محمد، خداوند به تو می‌گوید: ما تو را دشنام‌دهنده و لعنت‌کننده نفرستادیم، بلکه تو را رحمت برانگیختیم، یعنی تا بر امثال این‌ها رحم کنی.» گویی به او می‌گوید: «به جای نفرین کردن بر آن‌ها، برایشان دعا می‌کردی.» سپس کلام پروردگارش را بر او تلاوت کرد: «وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ» (و ما تو را جز رحمتی برای جهانیان نفرستادیم)، یعنی تا بر آن‌ها رحم کنی. زیرا اگر برایشان دعا می‌کردی، شاید آن‌ها را به طاعت من موفق می‌ساختم، پس شادی و روشنی چشمت را در طاعت آن‌ها می‌دیدی. و اگر آن‌ها را لعنت می‌کردی و بر آن‌ها دعا می‌نمودی و دعای تو را در موردشان اجابت می‌کردم، نمی‌توانستم آن‌ها را مؤاخذه کنم مگر به این صورت که بر طغیان و گناه آشکار بیفزایند، و همه این‌ها تنها به واسطه دعای تو بر آن‌ها بود. پس گویی تو آن‌ها را به افزایش در طغیانی که ما به واسطه آن مؤاخذه‌شان می‌کنیم، امر کرده بودی. پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به آنچه پروردگارش او را ادب کرده بود، آگاه شد و فرمود: «خداوند مرا ادب کرد و ادبم را نیکو ساخت.» و پس از آن فرمود: «بار خدایا، قوم مرا هدایت کن، زیرا آنان نمی‌دانند.» و شبی تا صبح ایستاد و در آن جز این قول خداوند متعال را تلاوت نمی‌کرد: «إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ» (اگر آن‌ها را عذاب کنی، پس آنان بندگان تو هستند؛ و اگر آن‌ها را ببخشی، پس تو خود عزیز (قدرتمند) و حکیم (فرزانه) هستی).\n\nو این سخن عیسی (علیه السلام) است. و خداوند متعال هنگامی که رسولانش را ذکر کرد، به او فرمود: «أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ» (آنان کسانی هستند که خداوند هدایتشان کرده است، پس به هدایت آنان اقتدا کن). و از هدایت عیسی (علیه السلام) همین آیه بود که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) تمام شب تا صبح با آن قیام کرد. این مقام کجا و دعای پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بر رِعل و ذَکوان کجا؟ «اللَّهُ يَغْفِرُ الذُّنُوبَ جَمِيعًا» (خداوند همه گناهان را می‌آمرزد) و گناهی را از گناه دیگر استثنا نکرد، همان‌گونه که اسرافی را از اسراف دیگر استثنا نکرد، و همان‌گونه که در فرستادن محمد (صَلَّى اللهُ عَليهِ وسَلَّم) عالمی را از عالم دیگر استثنا نکرد. «إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ» (همانا اوست آمرزنده مهربان) با الف و لام برای شمول، همراه با آبادانی دو سرا. پس شمول رحمت ضروری است. و اگر نبود که خداوند برای امور، اجل‌های نامگذاری شده و روزهای معدودی تعیین کرده است، عین انتقال به واسطه مرگ به سوی خدا، عین رحمتی بود که پس از استیفای حدود به دلیل تجاوزشان از حدود، برای آن‌ها حاصل می‌شود. پس تجاوز آن‌ها از حدود همان چیزی است که حدود را در سرای آخرت بر آن‌ها اقامه کرد، همان‌گونه که بر برخی از آن‌ها در سرای دنیا اقامه کرد. هیچ یک از خلق خدا نمرد مگر همان‌گونه که مؤمن متولد شد، و مؤاخذه واقع نشد مگر به آنچه میان دو ایمان بود. زیرا رحمت خداوند «وَسِعَتْ كُلَّ شَيْءٍ» (همه چیز را فرا گرفته است) و «بَاطِنُهُ فِيهِ الرَّحْمَةُ» (باطن آن، رحمت است). و به همین دلیل\n\nفرمود: کسی که برای من آشکار شد، من برای او پنهان گشتم.\n\nزیرا هیچ کس برای حق (الحق) آشکار نشد مگر اینکه از او جدا شد، چرا که اگر از او جدا نمی‌شد، خود را از او متمایز نمی‌ساخت. پس حق (الحق) در ظهور او پنهان گشت. پس او همان دیوار (سور) است که «بَاطِنُهُ فِيهِ الرَّحْمَةُ وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ» (باطن آن، رحمت است و ظاهرش از سوی آن، عذاب است) و مردم درک نمی‌کنند. و سخن در این باب، فصل‌هایش پایان نمی‌پذیرد. و این مقدار از تنبیه بر آنچه در آن است، کافی است ان شاء الله، «لِمَنْ كَانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وَهُوَ شَهِيدٌ» (برای کسی که قلبی دارد یا گوش فرا دهد در حالی که شاهد است). و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند). «جلد سوم کتاب الفتوحات المکیه (الفتوحات المکیه) با حمد و یاری و توفیق نیکوی خداوند به پایان رسید و جلد چهارم که آغاز آن باب چهارصد و یکم است، به دنبال آن می‌آید.»\n\n# [جلد چهارم]\n\nجلد چهارم از کتاب الفتوحات المکیه (الفتوحات المکیه) که خداوند آن را بر شیخ، امام، عامل، راسخ، کامل، خاتم اولیای وارث، برزخ برزخ‌ها، محیی الحق و الدین، ابوعبدالله محمد بن علی، معروف به ابن عربی حاتمی طائی، گشوده است. خداوند روحش را تقدیس کند و ضریحش را نورانی گرداند، آمین. این نسخه بر اساس نسخه‌ای که با نسخه مؤلف موجود در شهر قونیه مقابله شده، به چاپ رسیده است. و گروهی از علما به دستور امیر عبدالقادر جزایری مغفور، این مهم را به انجام رساندند. خداوند بر همه رحمت آورد و جایگاه رفیع نصیبشان گرداند. در مطبعه دارالکتب العربیه الکبری در مصر، به هزینه حاج فدا محمد کشمیری و شرکایش به چاپ رسید.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 4
}