{
  "id": 397,
  "title": {
    "ar": "الباب السابع والتسعون وثلاثمائة في معرفة منازلة إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ يَرْفَعُهُ هذا قول الله الصادق",
    "en": "Chapter Three Hundred and Ninety-Seven: Concerning the Gnosis of its Stations regarding the verse: <<إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ>> (To Him ascends the good word, and the righteous deed elevates it). This is the saying of the Truthful God.",
    "ur": "باب تین سو ستانوے: اس منزل کی معرفت کے بیان میں جس کی طرف پاکیزہ کلمات (الْكَلِمُ الطَّيِّبُ) چڑھتے ہیں اور نیک عمل (الْعَمَلُ الصَّالِحُ) اسے بلند کرتا ہے۔ یہ اللہ تعالیٰ کا سچا قول ہے: \"إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ\" (اسی کی طرف پاکیزہ کلمات چڑھتے ہیں اور نیک عمل اسے بلند کرتا ہے)۔",
    "fa": "باب سیصد و نود و هفتم در معرفت منازل [جایی که] «سخنان پاکیزه به سوی او صعود می‌کند و عمل صالح آن را بالا می‌برد» (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ يَرْفَعُهُ)؛ این سخن راستین خداوند است."
  },
  "content": {
    "ar": "## «الباب السابع والتسعون وثلاثمائة في معرفة منازلة إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ يَرْفَعُهُ هذا قول الله الصادق»\n\n\n> إن الرجال رجال الله كلهم *** والعارفين ومن يبقى ومن غبرا\n> ما منهم أحد يدري حقيقته *** إلا الذي جمع الآيات والسورا\n\n\n> وقام بالحق سباقا على قدم *** وما يبالي بمن قد ذم أو شكرا\n\n\n> من الإله علينا في خلافتنا *** بخاتم الحكم لم يخصص به بشرا\n\n\n> ولا نريد بذا فخرا فيلحقنا *** نقص لذلك أو يلحق بنا غيرا\n\n\n### [مهاجر إلى الله‏]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الله عز وجل يقول ومن يَخْرُجْ من بَيْتِهِ مُهاجِراً إِلَى الله ورَسُولِهِ وقال صَلَّى اللهُ عَليهِ وسَلَّم فمن كانت هجرته إلى الله‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم لا هجرة بعد الفتح‏\n\n\nيعني فتح مكة فإنه ما ثم إلى أين وقد جعل الله بيوت النفوس الإنسانية هذه الأجسام الطبيعية التي خلقها وسواها وعدلها بالبناء لسكنى هذه النفوس الإنسانية التي هي من جملة كلهم الحق فلما نفخها فيها وأسكنها\n\n\n### [أوقات التدبير ومقادير ذلك وجهاته‏]\n\n\nواعلم هذه النفس بما لها عند الله في تدبير هذه المملكة التي ملكها الله وركز في جبلتها علم التدبير مطلقا ثم عين لها في تدبيرها الخاص والعالم أوقات التدبير ومقادير ذلك وجهاته بلسان الشرع موافقا لميزان الطبع فيحمد ذلك التدبير الخاص والعالم فقال أهل هذا الشأن من علماء الطبيعة ما قال أحد في أصل هذا العلم أجمع ولا أبدع من‏\n\n\nقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إذ قال المعدة بيت الداء والحمية رأس الدواء وأصل كل داء البردة وأمر في الأكل إن كثر ولا بد فثلث للطعام وثلث للشراب وثلث للنفس‏\n\n\nوقال صَلَّى اللهُ عَليهِ وسَلَّم بحسب ابن آدم لقيمات يقمن صلبه‏\n\n\nهذا في تدبير هذا البيت فما زال يحكم فيه بحكم الله إلى أن انقدح له في سره أنه وإن حكم فيه بحكم الله إنه إنما يحكم فيه الله بحكم الله مع ثبوت عينه عنده فلما عاين ذلك أنف من الحصر في ظلمة هذا الهيكل وطلب التنزيه عنه فوجد الله قد هيأ له من عمله مركبا ذلولا غير جموح برزخيا دون البغل وفوق الحمار سماه براقا لأنه تولد من عالم الطبيعة كما يتولد البرق في عالم الجو فأعطاه الله السرعة في السير فيضع حافره عند منتهى طرفه يراكبه فخرج مهاجرا من مدينة جسمه وأخذ في ملكوت الملإ الأعلى وآياته بعين الاعتبار لما تعطيه الآيات من العلم بالله فتلقاه الحق عند وروده عليه من أكوانه وأكوان الموجودات فأنزله عنده خير منزل وعرفه بما لم يكن قبل ذلك يعرف معرفة خطاب إلهي وشهود مشيئة من أجل المناسبة حتى لا يفجئوه الأمر بغتة فيهلك عند ذلك كما صعق موسى عليه السلام فإنه تعالى ما يتجلى له إلا في صورة محمدية فيراه برؤية محمدية وهي أكمل رؤية يرى فيها الحق وبها فيرفعه بها منزلا لا يناله إلا المحمديون وهو منزل الهوية فلا يزال في الغيب مشهده فلا يرى له أثر في الحس وهذا كان مشهد أبي السعود ابن الشبل ببغداد من أخص أصحاب عند القادر الجيلي فإذا كان صاحب هذا الشهود غير صاحب هوية بل يشهده في الملكوت مليكا وكل مشاهد لا بد أن يلبس صورة مشهوده فيظهر صاحب هذا الشهود بصورة الملك فيظهر بالاسم الظاهر في عالم الكون بالتأثير والتصريف والحكم والدعوى العريضة والقوة الإلهية كعبد القادر الجيلي وكأبي العباس السبتي بمراكش لقيته وفاوضته وكان شياعي الميزان أعطى ميزان الجود وعبد القادر أعطى الصولة والهمة فكان أتم من السبتي في شغله وأصحاب هذا المقام على قسمين منهم من يحفظ عليه أدب اللسان كأبي يزيد البسطامي وسليمان الدنبلي ومنهم من تغلب عليه الشطحات لتحققه بالحق كعبد القادر فيظهر العلو على أمثاله وأشكاله وعلى من هو أعلى منه في مقامه وهذا عندهم في الطريق سوء أدب بالنظر إلى المحفوظ فيه وأما الذي يشطح بالله على الله فذلك أكثر أدب مع الله من الذي يشطح على أمثاله فإن الله يقبل الشطح عليه لقبوله جميع الصور والمخلوق لا يقبل الشطح عليه لأنه مربوط بمقام إلهي عند الله مجهول من الوجه الخاص فالشاطح عليه قد يكذب من غير قصد ولا تعمد وعلى الله فما يكذب كالهيولى الكل التي تقبل كل صورة في العالم فأي صورة نسبت إليها أو أظهرتها صدقت في النسبة إليها وصدق الظهور فإن الصور تظهرها والهيولى الصناعية لا تقبل ذلك وإنما تقبل صورا مخصوصة فقد يمكن أن يجهل إنسان في النسبة إليها فينسب إليها صورا لا تقبلها الهيولى الصناعية هكذا هو الأمر فيما ذكرناه من الشطح على الله والشطح على أهل الله أصحاب المنازل وكان عبد القادر الجيلي رحمه الله ممن يشطح على الأولياء والأنبياء بصورة حق في حاله‏\nفكان غير معصوم اللسان ورأيت أقواما يشطحون على الله وعلى أهل الله من شهود في حضرة خيالية فهؤلاء ما لنا معهم كلام فإنهم مطرودون من باب الحق مبعدون عن مقعد الصدق فتراهم في أغلب أحوالهم لا يرفعون بالأحكام المشروعة رأسا ولا يقفون عند حدود الله مع وجود عقل التكليف عندهم وبالجملة فإن الإدلال على الله لا يصح من المقربين من أهل الله جملة واحدة ومن ادعى التقريب مع الإدلال فلا علم له بمقام التقريب ولا بالأهلية الصحيحة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Ninety-Seven: Concerning the Knowledge of the Station of <<TO HIM ASCENDS THE GOOD WORD, AND THE RIGHTEOUS DEED RAISES IT UP>> (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ يَرْفَعُهُ) – This is the Saying of the Truthful God\n\nIndeed, all men are the men of God,\nIncluding the Gnostics (العارفين), those who remain, and those who have passed away.\nNone among them knows his own Reality (حقيقته),\nExcept the one who has gathered the signs (آيات) and the chapters (سور).\nAnd who stood by the Real (الحق), racing forward on a firm footing,\nAnd who cares not for those who blame or those who praise.\n[This is] a grace from the God upon us in our vicegerency (خلافتنا),\nBy the Seal of Judgment (خاتم الحكم), which He did not specify for any other human.\nNor do we desire pride through this, lest deficiency attach to us because of it,\nOr lest change (غيرا) attach to us.\n\n### The Emigrant to God (مهاجر إلى الله)\n\nKnow—may God support us and you with a spirit from Him—that God, the Mighty and Majestic, says: <<وَمَن يَخْرُجْ مِن بَيْتِهِ مُهَاجِرًا إِلَى اللَّهِ وَرَسُولِهِ>> (And whoever leaves his house, emigrating to God and His Messenger). And the Prophet, peace and blessings be upon him, said: \"So whoever's emigration (هجرة) is to God...\"\n\nThe Prophet, peace and blessings be upon him, also said: \"There is no emigration after the Conquest.\" He meant the Conquest of Mecca, for there is nowhere else to go. God has made the houses of the human souls (النفوس الإنسانية) these natural bodies (الأجسام الطبيعية) which He created, perfected, and balanced in their structure for the dwelling of these human souls, which are part of the totality of the Real (الحق). When He breathed them into these bodies and settled them...\n\n### Times of Management, their Measures, and Directions\n\n...He informed this soul (النفس) of what it possesses with God concerning the management (تدبير) of this kingdom (المملكة) that God has granted it dominion over. He implanted in its nature (جبلتها) the science of management absolutely, then specified for it, in its particular and universal management, the times of management, their measures, and their directions, through the language of the Law (الشرع), which conforms to the balance of Nature (الطبع). This particular and universal management is praised.\n\nThe masters of this discipline among the natural scientists (علماء الطبيعة) have said that no one has spoken more comprehensively or originally regarding the foundation of this science than the Messenger of God, peace and blessings be upon him, when he said: \"The stomach is the house of disease, and abstinence (الحمية) is the head of the remedy, and the origin of every disease is coldness (البردة).\" And concerning eating, if one must eat much, he commanded: \"A third for food, a third for drink, and a third for the breath (النفس).\"\n\nAnd he, peace and blessings be upon him, said: \"A few morsels are sufficient for the son of Adam to keep his back straight.\"\n\nThis pertains to the management of this house [the body]. The soul continues to rule within it by God’s decree until it is revealed to its innermost being (سره) that even though it rules by God’s decree, it is truly God who rules within it by God’s decree, while its immutable essence (عين) remains fixed with Him. When it witnesses this, it disdains confinement within the darkness of this structure (الهيكل) and seeks transcendence (التنزيه) from it.\n\nIt finds that God has prepared for it, from its own action, a docile, non-recalcitrant, intermediary mount (مركب برزخي), less than a mule and more than a donkey, which He named Buraq (براقا) because it is generated from the world of Nature (عالم الطبيعة), just as lightning (البرق) is generated in the atmospheric world. God granted it speed in travel, placing its hoof at the limit of its gaze. The soul mounts it and departs, emigrating from the city of its body (مدينة جسمه), and proceeds into the Kingdom (ملكوت) of the Highest Assembly (الملإ الأعلى) and its signs (آيات), viewing them with the eye of contemplation (عين الاعتبار) for the Knowledge of God (العلم بالله) that these signs impart.\n\nThe Real (الحق) meets it upon its arrival from its own states (أكوانه) and the states of all existing things (أكوان الموجودات). He settles it with Him in the best dwelling and grants it Gnosis (معرفة) of what it did not know before—a Gnosis of Divine address (خطاب إلهي) and the witnessing (شهود) of the Will (مشيئة)—due to the suitability [of the soul], so that the matter does not suddenly overwhelm it, causing it to perish, as happened when Moses, peace be upon him, was struck unconscious.\n\nFor the Exalted One does not disclose Himself (يتجلى) to the soul except in a Muhammadan form (صورة محمدية). Thus, the soul sees Him with a Muhammadan vision, which is the most perfect vision through which and by which the Real (الحق) is seen. By this vision, He raises the soul to a station (منزل) attained only by the Muhammadans (المحمديون), which is the station of Ipseity (الهوية). Its witnessing (مشهد) remains perpetually in the Unseen (الغيب), so no trace of it is seen in the sensory world (الحس).\n\nThis was the witnessing of Abu al-Su'ud ibn al-Shibl in Baghdad, one of the most intimate companions of Abd al-Qadir al-Jili.\n\nIf the possessor of this witnessing (شهود) is not a possessor of Ipseity (هوية), but rather witnesses Him in the Kingdom (الملكوت) as a King, and every witness must necessarily assume the form of what he witnesses, then the possessor of this witnessing appears in the form of the King. He manifests through the Name the Manifest (الاسم الظاهر) in the world of creation (عالم الكون) through influence (التأثير), disposal (التصريف), judgment (الحكم), vast claims (الدعوى العريضة), and Divine power (القوة الإلهية)—such as Abd al-Qadir al-Jili and Abu al-Abbas al-Sabti in Marrakesh. I met him and conversed with him. He was a follower of the Balance (شياعي الميزان), granted the balance of Generosity (الجود), while Abd al-Qadir was granted awe and spiritual resolve (الهمة). Thus, Abd al-Qadir was more complete than al-Sabti in his work.\n\nThe masters of this station (مقام) are of two types: those who maintain the propriety (أدب) of the tongue, such as Abu Yazid al-Bistami and Sulayman al-Dunbuli; and those who are overcome by ecstatic utterances (الشطحات) due to their realization of the Real (تحققه بالحق), such as Abd al-Qadir, who manifests superiority over his peers, his likes, and even those who are higher than him in station. This is considered by them, in the Path (الطريق), a lack of propriety (سوء أدب) when viewed from the perspective of the one who is preserved [from such utterances].\n\nAs for the one who utters ecstatic statements *by* God *against* God, that one possesses greater propriety (أدب) with God than the one who utters them against his peers. This is because God accepts the ecstatic utterance directed against Him due to His acceptance of all forms (الصور), whereas the creature does not accept the ecstatic utterance directed against him, because he is bound by a Divine station (مقام إلهي) known to God from a specific perspective. The one who utters ecstatic statements against a creature may lie unintentionally and without deliberation. But the one who utters them against God does not lie, like the Universal Hyle (الهيولى الكل) which accepts every form in the world. Any form attributed to it or manifested by it is truthful in its attribution and truthful in its manifestation, for the forms manifest it. However, the artificial hyle (الهيولى الصناعية) does not accept this; it only accepts specific forms. Thus, a person may be ignorant in attributing forms to it and attribute forms that the artificial hyle does not accept. This is the case regarding what we mentioned concerning ecstatic utterances against God and ecstatic utterances against the People of God (أهل الله), the masters of the stations.\n\nAbd al-Qadir al-Jili, may God have mercy on him, was among those who uttered ecstatic statements against the saints (الأولياء) and the prophets (الأنبياء) in a form of truth (صورة حق) pertaining to his state (حال). Thus, his tongue was not preserved [from error]. I have seen people who utter ecstatic statements against God and against the People of God (أهل الله) based on a witnessing (شهود) in the Imaginal Presence (حضرة خيالية). We have no discussion with these, for they are driven away from the door of the Real (الحق) and distanced from the seat of Truth (مقعد الصدق). You find them, in most of their states, paying no heed to the prescribed rulings (الأحكام المشروعة) and not stopping at the limits set by God, despite possessing the intellect of responsibility (عقل التكليف).\n\nIn summary, presumption (الإدلال) toward God is absolutely not proper for those among the People of God (أهل الله) who are brought near (المقربين). Whoever claims nearness (التقريب) while exhibiting presumption has no knowledge of the station of nearness nor of true qualification (الأهلية الصحيحة). And God <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو ستانوے: اس منزل کی معرفت میں جہاں **إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ** (اسی کی طرف کلمہ طیبہ چڑھتا ہے اور عمل صالح اسے بلند کرتا ہے)۔ یہ اللہ کا سچا قول ہے۔\n\nبے شک تمام مردانِ خدا ہی مرد ہیں\nاور عارفین، اور وہ جو باقی رہے اور وہ جو گزر گئے\nان میں سے کوئی بھی ان کی حقیقت نہیں جانتا\nسوائے اس کے جس نے آیات اور سورتوں کو جمع کیا۔\n\nاور وہ الحق (ذات حق) کے ساتھ قدم پر سبقت لے جانے والا بن کر کھڑا ہوا\nاور وہ پرواہ نہیں کرتا کہ کس نے مذمت کی یا کس نے شکر ادا کیا۔\n\nیہ ہماری خلافت میں اللہ کی طرف سے ہم پر احسان ہے\nحکم کی مہر کے ساتھ، جسے اس نے کسی بشر کے لیے خاص نہیں کیا۔\n\nاور ہم اس سے فخر نہیں چاہتے کہ اس وجہ سے ہمیں کوئی کمی لاحق ہو\nیا ہم پر کوئی تبدیلی (نقصان) آ جائے۔\n\n### [اللہ کی طرف ہجرت کرنے والا]\n\nجان لو، اللہ اپنی روح سے ہماری اور تمہاری تائید کرے، کہ اللہ عزوجل فرماتا ہے: **وَمَن يَخْرُجْ مِن بَيْتِهِ مُهَاجِرًا إِلَى اللَّهِ وَرَسُولِهِ** (اور جو کوئی اپنے گھر سے اللہ اور اس کے رسول کی طرف ہجرت کرتے ہوئے نکلے)۔ اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"پس جس کی ہجرت اللہ کی طرف ہو...\"\n\nنبی اکرم صلی اللہ علیہ وسلم نے یہ بھی فرمایا: \"فتح (مکہ) کے بعد کوئی ہجرت نہیں ہے۔\"\n\nاس سے مراد فتح مکہ ہے، کیونکہ اس کے بعد کوئی اور جگہ نہیں رہی جہاں ہجرت کی جا سکے۔ اور اللہ نے انسانی نفوس کے گھروں کو یہ طبعی اجسام بنا دیا ہے جنہیں اس نے پیدا کیا، سنوارا اور تعمیر کے ذریعے متوازن کیا تاکہ یہ انسانی نفوس ان میں سکونت اختیار کریں، جو کہ سب کے سب الحق (ذات حق) کے مجموعے میں شامل ہیں۔ پس جب اللہ نے ان نفوس کو ان اجسام میں پھونکا اور انہیں بسایا۔\n\n### [تدبیر کے اوقات، اس کی مقداریں اور اس کی جہات]\n\nاور اس نفس کو اس مملکت کی تدبیر میں جو کچھ اللہ کے ہاں اس کے لیے ہے، اس سے آگاہ کیا، جس کا مالک اللہ نے اسے بنایا ہے، اور اس کی فطرت میں تدبیر کا علم مطلقاً مرکوز کر دیا۔ پھر اس کی خاص اور عالمگیر تدبیر میں، شریعت کی زبان کے ذریعے، طبعی میزان کے مطابق، تدبیر کے اوقات، اس کی مقداریں اور اس کی جہات مقرر کر دیں۔ پس اس خاص اور عالمگیر تدبیر کی تعریف کی جاتی ہے۔ اس فن کے ماہرین میں سے علماءِ طبیعت نے اس علم کی بنیاد میں رسول اللہ صلی اللہ علیہ وسلم کے اس قول سے زیادہ جامع اور انوکھا قول کسی نے نہیں کہا، جب آپ صلی اللہ علیہ وسلم نے فرمایا: \"معدہ بیماری کا گھر ہے، اور پرہیز دوا کی جڑ ہے، اور ہر بیماری کی اصل ٹھنڈک (برودت) ہے۔\" اور کھانے کے بارے میں حکم دیا کہ اگر زیادہ کھانا ناگزیر ہو تو ایک تہائی کھانے کے لیے، ایک تہائی پینے کے لیے، اور ایک تہائی سانس (نفس) کے لیے ہو۔\n\nاور آپ صلی اللہ علیہ وسلم نے فرمایا: \"ابن آدم کے لیے چند لقمے کافی ہیں جو اس کی کمر کو سیدھا رکھیں۔\"\n\nیہ اس گھر (جسم) کی تدبیر کے بارے میں ہے۔ پس وہ اس میں اللہ کے حکم سے حکومت کرتا رہا، یہاں تک کہ اس کے باطن میں یہ بات روشن ہو گئی کہ اگرچہ وہ اس میں اللہ کے حکم سے حکومت کر رہا ہے، لیکن درحقیقت اللہ ہی اس میں اللہ کے حکم سے حکومت کر رہا ہے، جبکہ اس کی اپنی عینیت (وجود) اللہ کے ہاں ثابت ہے۔ جب اس نے یہ مشاہدہ کیا تو اس نے اس ہیکل (جسم) کی تاریکی میں محصور ہونے سے نفرت محسوس کی اور اس سے پاکیزگی (تنزيه) طلب کی۔ پس اس نے پایا کہ اللہ نے اس کے عمل سے اس کے لیے ایک ایسی سواری تیار کر دی ہے جو رام ہے، سرکش نہیں، برزخ (برزخ) سے تعلق رکھتی ہے، خچر سے چھوٹی اور گدھے سے بڑی، جسے براق کا نام دیا گیا، کیونکہ وہ عالمِ طبیعت سے پیدا ہوا جیسے عالمِ فضا میں بجلی (برق) پیدا ہوتی ہے۔ پس اللہ نے اسے سیر میں تیزی عطا کی، وہ اپنا سُم وہاں رکھتا ہے جہاں اس کی نظر کی انتہا ہوتی ہے۔ وہ اس پر سوار ہوتا ہے اور اپنے جسم کے شہر سے ہجرت کرتے ہوئے نکلتا ہے اور ملأ اعلیٰ (فرشتوں کی بلند جماعت) کی بادشاہت اور اس کی آیات میں غور و فکر کی نگاہ سے داخل ہوتا ہے، اس علم کی وجہ سے جو آیات اللہ کے بارے میں عطا کرتی ہیں۔ پس الحق (ذات حق) نے اس کے وارد ہونے پر، اس کے اکوان (وجودات) اور موجودات کے اکوان سے، اس کا استقبال کیا اور اسے اپنے پاس بہترین منزل پر اتارا اور اسے اس چیز کی المعرفۃ (معرفت) کرائی جو وہ اس سے پہلے نہیں جانتا تھا، یہ المعرفۃ (معرفت) ایک الٰہی خطاب اور مشیت کا الشہود (شہود) تھا، مناسبت کی وجہ سے، تاکہ معاملہ اسے اچانک آ کر نہ دبوچ لے اور وہ ہلاک ہو جائے، جیسا کہ موسیٰ علیہ السلام بے ہوش ہو گئے تھے۔ کیونکہ اللہ تعالیٰ اس پر صرف صورتِ محمدیہ میں ہی التجلی (ظہور الٰہی) فرماتا ہے، پس وہ اسے رؤیتِ محمدیہ کے ذریعے دیکھتا ہے، اور یہ اکمل رؤیت ہے جس میں اور جس کے ذریعے الحق (ذات حق) کو دیکھا جاتا ہے۔ پس اللہ اسے اس کے ذریعے ایک ایسی منزل پر بلند کرتا ہے جو صرف محمدیوں کو ہی حاصل ہوتی ہے، اور وہ منزلِ ہویت (ذاتِ مطلقہ) ہے۔ پس اس کا مشہد غیب میں رہتا ہے اور حواس میں اس کا کوئی اثر نظر نہیں آتا۔ اور یہ مشہد بغداد میں ابو السعود ابن الشبل کا تھا، جو عبدالقادر جیلانی کے خاص اصحاب میں سے تھے۔\n\nپس اگر اس الشہود (شہود) کا حامل شخص منزلِ ہویت (ذاتِ مطلقہ) کا حامل نہ ہو، بلکہ وہ اسے ملکوت میں ایک بادشاہ کی صورت میں دیکھتا ہو، اور ہر مشاہدہ کرنے والے کے لیے ضروری ہے کہ وہ اپنے مشہود کی صورت اختیار کرے، تو اس الشہود (شہود) کا حامل شخص بادشاہ کی صورت میں ظاہر ہوتا ہے، اور عالمِ کون میں الاسم الظاہر (ظاہر نام) کے ذریعے اثر اندازی، تصرف، حکم، وسیع دعوے اور قوتِ الٰہیہ کے ساتھ ظاہر ہوتا ہے، جیسے عبدالقادر جیلانی اور مراکش میں ابو العباس سبتی۔ میں ان سے ملا اور گفتگو کی، وہ میزانِ سخاوت کے حامل تھے، انہیں جود (سخاوت) کا میزان عطا ہوا تھا، جبکہ عبدالقادر کو صولت (دبدبہ) اور ہمت عطا ہوئی تھی، لہٰذا وہ اپنے کام میں سبتی سے زیادہ کامل تھے۔ اور اس مقام کے حاملین دو قسموں پر ہیں: ان میں سے کچھ وہ ہیں جو زبان کے آداب کی حفاظت کرتے ہیں، جیسے ابو یزید بسطامی اور سلیمان دنبلی۔ اور ان میں سے کچھ وہ ہیں جن پر شطحات (وجدانی کلام) غالب آ جاتے ہیں، الحق (ذات حق) کے ساتھ ان کے تحقق کی وجہ سے، جیسے عبدالقادر، پس وہ اپنے ہم مثلوں، ہم شکلوں اور ان پر بھی برتری ظاہر کرتے ہیں جو مقام میں ان سے بلند ہیں۔ اور یہ چیز ان کے نزدیک طریقت میں سوءِ ادب ہے، اس شخص کے اعتبار سے جس کی حفاظت کی گئی ہے۔ لیکن جو شخص اللہ کے ذریعے اللہ پر شطح (وجدانی کلام) کرتا ہے، وہ اس شخص سے زیادہ اللہ کے ساتھ باادب ہے جو اپنے ہم مثلوں پر شطح کرتا ہے۔ کیونکہ اللہ اپنے اوپر شطح کو قبول کرتا ہے، اس لیے کہ وہ تمام صورتوں کو قبول کرنے والا ہے، جبکہ مخلوق اپنے اوپر شطح کو قبول نہیں کرتی، کیونکہ وہ اللہ کے ہاں ایک خاص پہلو سے نامعلوم الٰہی مقام سے جڑی ہوئی ہے۔ پس جو شخص مخلوق پر شطح کرتا ہے، وہ غیر ارادی طور پر جھوٹ بول سکتا ہے، لیکن جو اللہ پر شطح کرتا ہے، وہ جھوٹ نہیں بولتا، جیسے ہیولیٰ الکل (کُل مادہ) جو عالم کی ہر صورت کو قبول کرتا ہے، پس جو بھی صورت اس کی طرف منسوب کی جائے یا اس کے ذریعے ظاہر کی جائے، وہ نسبت میں سچی ہوتی ہے اور ظہور بھی سچا ہوتا ہے، کیونکہ صورتیں اسے ظاہر کرتی ہیں۔ جبکہ ہیولیٰ صناعیہ (مصنوعی مادہ) اسے قبول نہیں کرتا، بلکہ صرف مخصوص صورتوں کو قبول کرتا ہے۔ پس ممکن ہے کہ کوئی انسان اس کی نسبت میں جہالت کا مظاہرہ کرے اور اس کی طرف ایسی صورتیں منسوب کر دے جنہیں ہیولیٰ صناعیہ قبول نہیں کرتی۔ اسی طرح معاملہ ہے جو ہم نے اللہ پر شطح کرنے اور اللہ والوں (اہل اللہ) اصحابِ منازل پر شطح کرنے کے بارے میں ذکر کیا۔ اور عبدالقادر جیلانی رحمۃ اللہ علیہ ان لوگوں میں سے تھے جو اپنے حال میں حق کی صورت میں اولیاء اور انبیاء پر شطح کرتے تھے۔\n\nپس وہ زبان کی عصمت سے محفوظ نہ تھے۔ اور میں نے ایسے لوگ بھی دیکھے جو ایک خیالی (وہم) حضور میں الشہود (شہود) کی بنا پر اللہ پر اور اہل اللہ پر شطح (وجدانی کلام) کرتے ہیں۔ پس ان کے ساتھ ہمارا کوئی کلام نہیں، کیونکہ وہ بابِ الحق (ذات حق کا دروازہ) سے دھتکارے ہوئے اور مقعدِ صدق (سچائی کی جگہ) سے دور کیے ہوئے ہیں۔ آپ انہیں ان کے اکثر احوال میں دیکھیں گے کہ وہ شرعی احکام کو کوئی اہمیت نہیں دیتے اور اللہ کی حدود پر نہیں ٹھہرتے، حالانکہ ان کے پاس عقلِ تکلیف موجود ہوتی ہے۔ خلاصہ یہ کہ اللہ کے مقربین (اہل اللہ) کے لیے اللہ پر ناز کرنا (ادلال) بالکل بھی درست نہیں ہے۔ اور جس نے ناز کرنے کے ساتھ تقرب کا دعویٰ کیا، اسے نہ تو مقامِ تقرب کا علم ہے اور نہ ہی صحیح اہلیت کا۔ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و نود و هفتم در معرفت منزلتی که: «إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ يَرْفَعُهُ» (سخنان پاکیزه به سوی او صعود می‌کند و عمل صالح آن را بالا می‌برد) این سخن خداوند راستگوست.\n\nمردان، همگی مردان خدایند *** و عارفان و آنان که می‌مانند و آنان که رفتند\nهیچ‌یک از ایشان حقیقت خود را نمی‌داند *** مگر آنکه آیات و سوره‌ها را جمع کرده است\n\nو با حق، پیشتازانه بر قدمی ایستاد *** و باکی از آنکه نکوهش کرد یا سپاس گفت، ندارد\n\nاین از جانب خدا بر ما در خلافت ماست *** با خاتم حکم که به هیچ بشری اختصاص داده نشده است\n\nو ما با این کار، فخر نمی‌خواهیم تا نقصی *** به ما برسد یا دیگری به ما ملحق شود\n\n### [مهاجر به سوی خدا]\n\nبدان، خداوند ما و تو را با روحی از جانب خود تأیید کند، که خدای عز و جل می‌فرماید: «وَمَن يَخْرُجْ مِن بَيْتِهِ مُهَاجِرًا إِلَى اللَّهِ وَرَسُولِهِ» (و هر کس از خانه‌اش به قصد هجرت به سوی خدا و رسولش خارج شود). و پیامبر (صلی الله علیه و سلم) فرمود: «فمن كانت هجرته إلى الله» (پس هر که هجرتش به سوی خدا باشد).\n\nپیامبر (صلی الله علیه و سلم) فرمود: «لا هجرة بعد الفتح» (پس از فتح، هجرتی نیست).\n\nمنظور فتح مکه است، زیرا دیگر جایی برای رفتن نمانده است. و خداوند خانه‌های نفوس انسانی را همین اجسام طبیعی قرار داده است که آن‌ها را آفرید و سامان داد و با بنای آن‌ها تعدیل کرد تا این نفوس انسانی در آن‌ها ساکن شوند، نفوسی که جملگی از جمله حق هستند. پس چون خداوند آن را در آن‌ها دمید و ساکن ساخت،\n\n### [اوقات تدبیر و مقادیر و جهات آن]\n\nو این نفس را به آنچه نزد خدا در تدبیر این مُلک دارد، آگاه ساخت. مُلکی که خداوند به او بخشید و در سرشت او علم تدبیر را به طور مطلق نهاد، سپس برای تدبیر خاص و عام او، اوقات تدبیر و مقادیر و جهات آن را با زبان شرع، موافق با میزان طبع، تعیین کرد. پس آن تدبیر خاص و عام را ستود. اهل این شأن از علمای طبیعت، سخنی نگفته‌اند که در اصل این علم جامع‌تر و بدیع‌تر از\n\nسخن رسول خدا (صلی الله علیه و سلم) باشد که فرمود: «المعدة بيت الداء والحمية رأس الدواء وأصل كل داء البردة» (معده خانه درد است و پرهیز سرآمد درمان، و ریشه هر دردی سردی است). و در مورد خوردن امر فرمود که اگر زیاد شد و چاره‌ای نبود، یک سوم برای طعام، یک سوم برای نوشیدنی و یک سوم برای نفس باشد.\n\nو فرمود (صلی الله علیه و سلم): «بحسب ابن آدم لقيمات يقمن صلبه» (برای فرزند آدم چند لقمه که پشت او را راست نگه دارد، کافی است).\n\nاین در تدبیر این خانه است. پس پیوسته در آن به حکم خدا حکم می‌راند تا اینکه در سِرّ او این امر منقدح شد که اگرچه او در آن به حکم خدا حکم می‌کند، اما در واقع این خداست که در آن به حکم خدا حکم می‌کند، با ثبوت عین او نزد حق. پس چون این را مشاهده کرد، از محصور بودن در ظلمت این هیکل (جسم) بیزار شد و طلب تنزیه از آن کرد. پس یافت که خداوند از عمل او مرکبی رام و غیر چموش، برزخی، پایین‌تر از قاطر و بالاتر از الاغ، برای او مهیا کرده است و آن را براق نامید، زیرا از عالم طبیعت متولد شده است، همان‌گونه که برق در عالم جو متولد می‌شود. پس خداوند به او سرعت در سیر عطا کرد که سُم خود را در منتهای دیدگانش می‌نهد. بر آن سوار شد و مهاجرت‌کنان از شهر جسم خود خارج شد و با چشم اعتبار به ملکوت ملأ اعلی و آیات آن پرداخت، به سبب علمی که آیات از خدا به او می‌دهند. پس حق او را هنگام ورودش از اکوان خود و اکوان موجودات ملاقات کرد و او را نزد خود در بهترین منزل جای داد و او را به آنچه پیش از آن نمی‌دانست، آگاه ساخت؛ معرفتی از طریق خطاب الهی و شهود مشیّت، به خاطر مناسبت، تا مبادا امر ناگهان او را غافلگیر کند و در آن حال هلاک شود، همان‌گونه که موسی (علیه السلام) مدهوش شد. زیرا خداوند متعال بر او تجلی نمی‌کند مگر در صورت محمدیه، پس او را با رؤیت محمدیه می‌بیند، و آن کامل‌ترین رؤیتی است که حق در آن و با آن دیده می‌شود. پس او را با آن به منزلتی بالا می‌برد که جز محمدیان به آن نمی‌رسند، و آن منزلت هویّت (الهوية) است. پس پیوسته مشهد او در غیب است و اثری از او در حس دیده نمی‌شود. این مشهد ابوالسعود ابن الشبل در بغداد بود که از خاص‌ترین اصحاب نزد عبدالقادر گیلانی بود. اما اگر صاحب این شهود، صاحب هویّت نباشد، بلکه او را در ملکوت به صورت پادشاهی مشاهده کند، و هر مشاهده‌کننده‌ای ناگزیر است که صورت مشهود خود را بپوشد، پس صاحب این شهود به صورت ملک ظاهر می‌شود و با اسم الظاهر در عالم کون، با تأثیر و تصریف و حکم و ادعای بزرگ و نیروی الهی ظاهر می‌گردد، مانند عبدالقادر گیلانی و ابوالعباس سبتی در مراکش که او را ملاقات کردم و با او به گفتگو پرداختم. او شیّاعی المیزان (دارای ترازوی پخش‌کننده) بود و میزان جود به او داده شده بود، و به عبدالقادر صولت و همت داده شده بود، پس عبدالقادر در کار خود کامل‌تر از سبتی بود. و اصحاب این مقام بر دو دسته‌اند: برخی از آنان ادب زبان بر ایشان حفظ می‌شود، مانند بایزید بسطامی و سلیمان دنبلی، و برخی دیگر شطحیات بر آنان غلبه می‌کند به دلیل تحققشان به حق، مانند عبدالقادر. پس بر امثال و اشباه خود و بر کسی که در مقام از او بالاتر است، علوّ (برتری) نشان می‌دهد. و این نزد آنان در طریقت، سوء ادب محسوب می‌شود، با توجه به کسی که ادب بر او حفظ شده است. اما کسی که با خدا بر خدا شطح می‌زند، ادب او با خدا بیشتر از کسی است که بر امثال خود شطح می‌زند. زیرا خداوند شطح بر خود را می‌پذیرد، به دلیل پذیرش همه صور، اما مخلوق شطح بر خود را نمی‌پذیرد، زیرا او به مقامی الهی نزد خدا که از وجه خاص مجهول است، مرتبط است. پس شطح‌زننده بر او ممکن است بدون قصد و عمد دروغ بگوید، اما بر خدا دروغ نمی‌گوید، مانند هیولای کلی که هر صورتی را در عالم می‌پذیرد. پس هر صورتی که به آن نسبت داده شود یا آن را ظاهر کند، در نسبت دادن به آن راست گفته شده و ظهور آن راست است، زیرا صور آن را ظاهر می‌کنند. اما هیولای صناعی این را نمی‌پذیرد و تنها صور مخصوصی را قبول می‌کند. پس ممکن است انسانی در نسبت دادن به آن جاهل باشد و صورتی را به آن نسبت دهد که هیولای صناعی آن را نمی‌پذیرد. امر در مورد شطح بر خدا و شطح بر اهل خدا، صاحبان منازل، که ذکر کردیم، این‌گونه است. و عبدالقادر گیلانی (رحمه الله) از کسانی بود که بر اولیا و انبیا با صورت حقی در حال خود شطح می‌زد.\n\nپس زبانش معصوم نبود. و اقوامی را دیدم که از شهودی در حضرت خیالی، بر خدا و بر اهل خدا شطح می‌زنند. پس ما با اینان سخنی نداریم، زیرا آنان از درگاه حق رانده شده و از جایگاه صدق دور گشته‌اند. آنان را در اغلب احوالشان می‌بینی که به احکام مشروع اعتنایی نمی‌کنند و با وجود عقل تکلیف نزدشان، از حدود خدا نمی‌گذرند. به طور کلی، ادلال (ناز کردن و جرأت ورزیدن) بر خدا از مقربین اهل خدا به هیچ وجه صحیح نیست، و هر کس ادعای تقریب کند همراه با ادلال، پس او علمی به مقام تقریب و اهلیت صحیح ندارد. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}