{
  "id": 501,
  "title": {
    "ar": "الباب الواحد وخمسمائة في معرفة حال قطب كان منزله أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ وكان هذا هجير الشيخ أبي مدين شيخنا رضي الله عنه",
    "en": "Chapter Five Hundred and One: Concerning the knowledge of the spiritual state (حال) of a Pole (قطب) whose spiritual station (منزل) was [the verse]: <<أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ>> (Is it other than Allah that you call upon, if you are truthful?), and this was the constant practice (هجير) of our Shaykh, Abu Madyan, may Allah be pleased with him.",
    "ur": "باب پانچ سو ایک: ایک قطب (Quṭb) کے حال کی معرفت میں جس کا روحانی مقام (منزل) یہ تھا: \"أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ\" (کیا تم اللہ کے سوا کسی اور کو پکارتے ہو، اگر تم سچے ہو؟)، اور یہ ہمارے شیخ، شیخ ابو مدین رضی اللہ عنہ کا مستقل ورد (ہجیر) تھا۔",
    "fa": "باب پانصد و یکم در معرفت حال قطبی که منزل او «آیا غیر خدا را می‌خوانید اگر راستگویید؟» (أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ) بود، و این ورد (هجیر) شیخ ما ابومدین (رضی الله عنه) بود."
  },
  "content": {
    "ar": "## «الباب الواحد وخمسمائة في معرفة حال قطب كان منزله أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ وكان هذا هجير الشيخ أبي مدين شيخنا رضي الله عنه»\n\n\n> أ فغير الله يدعو صادق *** أم بغير الله فوه ينطق‏\n\n\n> بل به ينطق لا يعقبه *** ولذا في كل حال يصدق‏\n\n\n> ثم يدعوه إذا يدعو به *** فهو الداع الذي لا يلحق‏\n\n\n> أخلق الخالق ما يخلقه *** لجديد بعد هذا يخلق‏\n\n\n> ليت شعري هل ترى من كائن *** قائم العين به لا يخلق‏\n\n\n> حجب الأمثال ما قام بها *** من فناء كونه يحقق‏\n\n\n### [هل الحاكم يحكم بعلمه أم لا]\n\n\nقال الله تعالى بَلْ إِيَّاهُ تَدْعُونَ فَيَكْشِفُ ما تَدْعُونَ إِلَيْهِ إِنْ شاءَ وتَنْسَوْنَ ما تُشْرِكُونَ أي تتركون الشرك فانتج هذا الذكر هذه الشهادة الإلهية وإذا كان الحاكم عين الشاهد بقيت الحيرة في هل يحكم الحاكم بعلمه أم لا فإن الشهادة علم والحكم قد يكون عن غلبة ظن وعن علم وموضع الشهادة بَلْ إِيَّاهُ تَدْعُونَ ... وتَنْسَوْنَ ما تُشْرِكُونَ وهو قوله وإِذا مَسَّكُمُ الضُّرُّ في الْبَحْرِ ضَلَّ من تَدْعُونَ إِلَّا إِيَّاهُ وقوله أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذا دَعاهُ فقد شهد على نفسه لنا في دار التكليف بتوحيده في المهمات ولا يعرف الكريم إلا المسي‏ء ولا أكرم من الله وقد نبه الله المسي‏ء أن يقول بكرم الحق لكونه يحكم بالكرم في حقه فقال يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ هذا ليقول كرمك وما يعني بالإنسان هنا إلا المسي‏ء صاحب الكبيرة فإنه لا يقاوم كبير كرمه إلا بأكبر الكبائر فهناك يظهر عموم الكرم الإلهي وقوته فهو وإن لم يغفر فلا بد من الكرم الإلهي في المال وإن لم يخرج من النار لأنها موطنه ومنها خلق حتى لو أخرج منها في المال لتضرر فله فيها نعيم مقيم لا يشعر به إلا العلماء بالله فلما كشف الله غطاء الجهل والعماء عمن كشفه أبصر أن أحدا من الخلق ما دعا في حال شدته إلا الله فلو لم يكن في علمه في حال الرخاء إن حل الشدائد بيد الله خاصة وهذا هو التوحيد ما أظهر ذلك الاعتقاد عند الشدائد فلم يزل المشرك موحدا بشهادة الله في حال الرخاء والشدة غير إن المشرك في حال الرخاء لا يظهر عليه علم من إعلام التوحيد الذي هو معتقده فإذا اضطر رجع إلى علمه بتوحيد خالقه لم يظهر عليه علم من أعلام الشرك وكل ذلك في دار التكليف وأكثر علماء الرسوم غائبون عن هذا الفضل الإلهي والكرم فيعطي هذا الذكر من العلم بكرم الله ما ليس عند أحد من خلق الله ممن ليس له هذا الذكر والدءوب عليه ولم أسمع عن أحد تحقق به في زماني مثل الشيخ أبي مدين ببجاية رحمه الله وإذا اجتمع في دار التكليف في الشخص ظهور التوحيد في وقت وظهور الشرك في وقت مع استصحاب التوحيد في الباطن مع وجوده في أصل الفطرة والرجوع إليه في المال في حال الاحتضار قبل الخروج من الدنيا فكان زمانه أكثر من زمان الشرك فلو قابلنا الأمر بالزمان بينهما لكان زمان التوحيد غالبا بالفطرة والاستصحاب في الباطن دائما علما وعقدا وكان ظهوره في وقت الشدائد بأزمانه أكثر من زمان الشرك فلا يحجبنك حكم الدار عن هذا الذي أومأنا إليه في هذا\nالهجير فإنه ينفعك ولو قدرت أنه لا ينفك فإنه لا يضرك فقل به على كل حال واعتمد عليه ولا تك ممن يرد شهادة الله حين شهد لهم بذلك عندك وما شهد عندك حتى جعلك حاكما فأنزلك منزلته في الحكم وأنزل نفسه منزلتك في الشهادة فإن لم تحكم بما قررناه فقد رددت شهادة العدل فَما ذا بَعْدَ الْحَقِّ إِلَّا الضَّلالُ فَأَنَّى تُصْرَفُونَ ... إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ ثم قوله إِنْ كُنْتُمْ صادِقِينَ أي إن صدقتم ولا تكتمون ما تجدونه في نفوسكم من قولي إنكم ما تدعون في الشدائد إلا الله الذي ما زالت قلوبكم منطوية عليه فهم بلا شك مصدقون لعلمهم فهل يصدقون إذا سألوا أم لا\n\n\n> فقد يصدقون وقد يكذبون *** وقد يعلمون وقد يجهلون‏\n\n\n> فلا تصغين إلى قولهم *** فإني عليم بما يقصدون‏\n\n\n> فكن واحد العصر لا تلتفت *** إلى ما يقولون إذ يفشرون‏\n\n\n> فإني خبير بأقوالهم *** وعلمي بهم أنهم يخرصون‏\n\n\n> ولو كنت أدري بهم أنهم *** إذا ما يقولونه يصدقون‏\n\n\n> لقد كنت أصغى إلى قولهم *** فهم إذ يقولون ما يشعرون‏\n\n\n> فهم إذ يقولون ما في العما *** وفي العرش إلا الذي يفترون‏\n\n\n> فقد حرفوا القول فاستنصروا *** عليهم بهم أنهم ينصرون‏\n\n\nومتى لم يعلم الكاذب أنه كاذب فإنه غير مؤاخذ بكذبه فإن أخذ فما يؤاخذ إلا بتفريطه في تحصيل ما ينبغي له أن يحصله من العلم والعمل بما فيه نجاته وسعادته لا من جهة كذبه فلا يؤاخذ الكاذب إلا إذا كان عالما بكذبه في المواطن التي كلف إن يصدق فيها وهو الجاحد إذا كان هناك من يطلب منه الإقرار في ذلك الأمر المطلوب منه مثل قوله تعالى في حق من كان بهذه الصفة وجَحَدُوا بِها واسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وعُلُوًّا وقد قررنا أنه إذا أخذ من لا يعلم أنه كاذب إنما يؤخذ من حيث إنه فرط في اقتناء العلم الذي يطلعه على هذا الأمر الذي كذب فيه من غير علم به أنه ليس بحق ففرق بين مؤاخذة الكاذب ومتى هو كاذب وبين مؤاخذة المفرط في اقتناء العلم الذي يعرفه الصدق من الكذب والصادق من الكاذب فينزل كل شي‏ء منزلته بصفته وهذا عزيز في الناس قليل وجوده والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ جعلنا الله وإياكم من العلماء العاملين على كل حال ولا يحول بيننا وبين مقام الصادقين والصديقين أنه الملي‏ء بذلك والقادر عليه آمين بعزته‏\n\n",
    "en": "Chapter 501: Concerning the Knowledge of the State of a Pole (قطب) whose Station (منزله) was [the verse]: <<أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ>> (Do you call upon other than Allah, if you are truthful?) And this was the daily spiritual practice (هجير) of our Shaykh, Abu Madyan, may Allah be pleased with him.\n\nDoes a truthful one call upon other than Allah?\nOr does his mouth speak with other than Him?\n\nRather, he speaks by Him, following nothing else,\nAnd thus in every state, he is truthful.\n\nThen he calls upon Him when he calls by Him,\nFor he is the Caller who cannot be surpassed.\n\nDid the Creator create what He creates\nFor a new thing to be created after this?\n\nI wish I knew if you see any existent thing\nWhose fixed entity (قائم العين) is not created by Him.\n\nThe veiling of similitudes (الأمثال) is realized by what stands in them,\nThrough the annihilation (فناء) of their being.\n\n### [Does the Judge Rule by His Knowledge or Not?]\n\nAllah the Exalted said: <<بَلْ إِيَّاهُ تَدْعُونَ فَيَكْشِفُ ما تَدْعُونَ إِلَيْهِ إِنْ شاءَ وتَنْسَوْنَ ما تُشْرِكُونَ>> (Nay, but Him alone you call upon, and He will remove that for which you call upon Him, if He wills, and you forget what you associate [with Him]). Meaning, you abandon the association (الشرك).\n\nThis remembrance (الذكر) thus produced this Divine Witnessing (الشهادة الإلهية). If the Judge (الحاكم) is the very essence of the Witness (الشاهد), confusion remains as to whether the Judge rules by his knowledge (بعلمه) or not, for witnessing is knowledge (علم), while judgment may be based on predominant conjecture or on knowledge.\n\nThe locus of the witnessing is <<بَلْ إِيَّاهُ تَدْعُونَ ... وتَنْسَوْنَ ما تُشْرِكُونَ>> and His saying: <<وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُونَ إِلَّا إِيَّاهُ>> (And when affliction touches you in the sea, lost are those you call upon except Him) and His saying: <<أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ>> (Or who answers the distressed one when he calls upon Him?).\n\nThus, He has testified concerning Himself to us, in the Abode of Responsibility (دار التكليف), regarding His Unity (توحيده) in matters of importance. None knows the Generous (الكريم) except the wrongdoer (المسيء), and none is more Generous than Allah.\n\nAllah has alerted the wrongdoer to speak of the generosity of the Real (كرم الحق), because He judges by generosity concerning him, saying: <<يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ>> (O man, what has deluded you concerning your Generous Lord?). This is so that he may say: \"Your generosity.\" And by \"man\" (الإنسان) here, He means none other than the wrongdoer, the perpetrator of major sins (صاحب الكبيرة), for nothing resists the greatness of His generosity except the greatest of major sins. It is there that the universality and power of the Divine Generosity (الكرم الإلهي) become manifest. Even if He does not forgive, the Divine Generosity is inevitable in the end (في المال). Even if He does not remove him from the Fire, because it is his dwelling place (موطنه) and he was created from it—such that if he were removed from it in the end, he would be harmed—he has in it an enduring bliss (نعيم مقيم) which none perceives except those who possess Gnosis of Allah (العلماء بالله).\n\nWhen Allah removed the veil of ignorance and blindness from whomever He willed, that person perceived that no one among creation called upon anyone but Allah in a state of distress (شدته). Even if he did not possess the knowledge during times of ease (الرخاء) that the removal of distress is exclusively in the hand of Allah—and this is the Unity (التوحيد)—he manifested that belief during times of distress. Thus, the polytheist (المشرك) never ceased to be a monotheist (موحدا) by the testimony of Allah, both in times of ease and distress. However, the polytheist in times of ease does not manifest any sign (علم) of the Unity which is his underlying belief (معتقده). But when he is compelled (اضطر), he returns to his knowledge (علمه) of the Unity of his Creator, and no sign of polytheism appears upon him.\n\nAll of this occurs in the Abode of Responsibility (دار التكليف), and most scholars of external forms (علماء الرسوم) are unaware of this Divine Grace (الفضل الإلهي) and Generosity. This remembrance (الذكر) grants knowledge of Allah’s Generosity that is not possessed by anyone else among Allah’s creation who does not practice this remembrance and persist in it. I have not heard of anyone in my time who realized this state (تحقق به) like Shaykh Abu Madyan in Bijaya, may Allah have mercy on him.\n\nIf, in the Abode of Responsibility, the manifestation of Unity appears in a person at one time, and the manifestation of polytheism at another, while the Unity is maintained inwardly (في الباطن), existing in the original disposition (أصل الفطرة), and is returned to in the end (في المال) during the state of agony (الاحتضار) before leaving the world, then the time of Unity was greater than the time of polytheism. If we compare the matter temporally between the two, the time of Unity would be dominant due to the original disposition (الفطرة) and its constant inward maintenance (الاستصحاب في الباطن), both as knowledge (علما) and conviction (عقدا). Furthermore, its manifestation during times of distress (الشدائد) is temporally greater than the time of polytheism.\n\nTherefore, let not the ruling of the Abode (حكم الدار) veil you from that to which we have alluded in this daily practice (الهجير), for it will benefit you. Even if you assume that he does not separate from it, it will not harm you. So, speak by it in every state and rely upon it. And do not be among those who reject the testimony of Allah when He testified to them concerning that in your presence. He only testified in your presence so that He might make you a judge (حاكما), thus placing you in His station (منزلته) in judgment, and placing Himself in your station in witnessing (الشهادة). If you do not judge according to what we have established, then you have rejected the testimony of the Just One. <<فَمَاذَا بَعْدَ الْحَقِّ إِلَّا الضَّلَالُ فَأَنَّى تُصْرَفُونَ>> (And what is there after the truth except error? So how are you averted?) ... <<إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ>> (Indeed, I advise you lest you be among the ignorant).\n\nThen His saying: <<إِنْ كُنْتُمْ صَادِقِينَ>> (If you are truthful), meaning, if you speak the truth and do not conceal what you find within yourselves regarding My statement that you call upon none but Allah in distress, the One upon whom your hearts have always been folded. They are, without doubt, truthful concerning their knowledge (لعلمهم). But will they speak truthfully when questioned, or not?\n\nThey may speak truthfully, and they may lie,\nThey may know, and they may be ignorant.\n\nSo do not listen to their saying,\nFor I am knowing of what they intend.\n\nBe the unique one of the age (واحد العصر), do not turn\nTo what they say when they speak frivolously.\n\nFor I am expert in their sayings,\nAnd my knowledge of them is that they merely conjecture.\n\nIf I knew concerning them that they speak truthfully\nWhen they say what they say,\n\nI would certainly listen to their saying,\nBut they are unaware of what they say.\n\nWhen they speak, they say there is nothing in the Cloud (العما)\nOr the Throne (العرش) except what they fabricate.\n\nThey have distorted the saying, so seek victory\nOver them by means of themselves, that they may be victorious.\n\nIf the liar does not know that he is lying, he is not held accountable (مؤاخذ) for his lie. If he is held accountable, he is only held accountable for his negligence (تفريطه) in acquiring the knowledge and action necessary for his salvation and felicity, not on account of his lie itself. The liar is only held accountable if he is aware of his lie in the situations where he is obligated to speak truthfully. This refers to the denier (الجاحد) when someone demands affirmation from him regarding the matter required of him, such as the saying of the Exalted concerning those who possess this characteristic: <<وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ ظُلْمًا وَعُلُوًّا>> (And they rejected them, while their souls were certain of them, out of injustice and arrogance).\n\nWe have established that if someone who does not know he is lying is held accountable, he is only held accountable because he neglected to acquire the knowledge that would inform him about this matter concerning which he lied, without knowing that it was not the truth. Thus, there is a difference between holding the liar accountable when he is a liar, and holding accountable the one who is negligent in acquiring the knowledge that distinguishes truth from falsehood and the truthful from the liar, so that he may place everything in its proper station (منزلته) according to its attribute (بصفته). This is rare among people and seldom found. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way). May Allah make us and you among the knowledgeable ones who act upon their knowledge in every state, and may He not place a barrier between us and the station of the truthful (الصادقين) and the veracious (الصديقين). Indeed, He is fully capable of that and has the power over it. Amen, by His Might.",
    "ur": "باب نمبر پانچ سو ایک: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"کیا تم اللہ کے سوا کسی اور کو پکارتے ہو، اگر تم سچے ہو؟\" اور یہ ہمارے شیخ ابو مدین رضی اللہ عنہ کا وظیفہ (ہجیر) تھا۔\n\nکیا کوئی سچا شخص اللہ کے سوا کسی اور کو پکارتا ہے؟ یا کیا اس کا منہ اللہ کے سوا کسی اور سے بولتا ہے؟\nبلکہ وہ اسی (ذات حق) کے ذریعے بولتا ہے، اس سے پیچھے نہیں ہٹتا، اسی لیے وہ ہر حال میں سچا ہوتا ہے۔\nپھر وہ اسے پکارتا ہے جب وہ اس کے ذریعے پکارتا ہے، پس وہی پکارنے والا ہے جس کا کوئی ثانی نہیں۔\nکیا خالق نے جو کچھ پیدا کیا ہے، اسے اس لیے پیدا کیا ہے کہ اس کے بعد کوئی نئی چیز پیدا ہو؟\nکاش میں جانتا کہ کیا تم کسی ایسی ہستی کو دیکھتے ہو جو اپنی عین (ذات) کے ساتھ قائم ہو اور وہ پیدا نہ کی گئی ہو؟\nمثالوں نے اس چیز کو چھپا دیا جو ان میں قائم ہے، اس کے فنا (الفناء) ہونے سے اس کا وجود متحقق ہوتا ہے۔\n\n[کیا حاکم اپنے علم کی بنیاد پر فیصلہ کرتا ہے یا نہیں؟]\n\nاللہ تعالیٰ نے فرمایا: \"بلکہ تم اسی کو پکارتے ہو، پھر وہ اس چیز کو دور کر دیتا ہے جس کے لیے تم اسے پکارتے ہو، اگر وہ چاہے، اور تم بھول جاتے ہو جسے تم شریک ٹھہراتے ہو (وَتَنْسَوْنَ مَا تُشْرِكُونَ)\" یعنی تم شرک کو چھوڑ دیتے ہو۔ پس اس ذکر نے یہ شہادتِ الٰہیہ پیدا کی۔ اور جب حاکم (الحاکم) ہی شاہد (الشاہد) کی عین (ذات) ہو، تو یہ حیرت باقی رہتی ہے کہ کیا حاکم اپنے علم کی بنیاد پر فیصلہ کرتا ہے یا نہیں؟ کیونکہ شہادت (گواہی) علم ہے، جبکہ فیصلہ کبھی غلبۂ ظن کی بنیاد پر ہوتا ہے اور کبھی علم کی بنیاد پر۔ اور شہادت کا مقام یہ ہے: \"بلکہ تم اسی کو پکارتے ہو... اور تم بھول جاتے ہو جسے تم شریک ٹھہراتے ہو (وَتَنْسَوْنَ مَا تُشْرِكُونَ)\"۔ اور یہی اس کا قول ہے: \"اور جب تمہیں سمندر میں کوئی تکلیف پہنچتی ہے تو وہ سب گم ہو جاتے ہیں جنہیں تم پکارتے ہو سوائے اس کے (وَإِذَا مَسَّكُمُ الضُّرُّ فِي الْبَحْرِ ضَلَّ مَنْ تَدْعُونَ إِلَّا إِيَّاهُ)\" اور اس کا قول: \"یا وہ کون ہے جو بے قرار کی دعا قبول کرتا ہے جب وہ اسے پکارتا ہے (أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ)\"۔\n\nپس اس (ذات حق) نے دارِ تکلیف میں ہمارے لیے اہم معاملات میں اپنی توحید (التوحید) کی گواہی دی ہے۔ اور کریم (سخی) کو صرف گناہ گار ہی جانتا ہے، اور اللہ سے بڑھ کر کوئی کریم نہیں۔ اور اللہ نے گناہ گار کو متنبہ کیا ہے کہ وہ حق کے کرم (الكرم) کا اقرار کرے، کیونکہ وہ اس کے حق میں کرم کے ساتھ فیصلہ کرتا ہے۔ چنانچہ فرمایا: \"اے انسان! تجھے تیرے رب کریم (الْكَرِيمِ) کے بارے میں کس چیز نے دھوکے میں ڈال دیا (يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ)\"۔ یہ اس لیے ہے تاکہ وہ کہے کہ \"تیرے کرم نے\"۔ اور یہاں انسان سے مراد صرف گناہ گار، کبیرہ گناہ کا مرتکب شخص ہے، کیونکہ اس کے عظیم کرم کا مقابلہ صرف سب سے بڑے کبیرہ گناہوں سے ہی کیا جا سکتا ہے۔ پس وہاں کرم الٰہی کی عمومیت اور قوت ظاہر ہوتی ہے۔ لہٰذا، اگرچہ وہ (اللہ) معاف نہ بھی کرے، تب بھی انجام کار میں کرم الٰہی (الكرم الإلهي) کا ہونا ضروری ہے، اگرچہ وہ اسے جہنم سے نہ نکالے، کیونکہ وہ اس کا وطن ہے اور وہ اسی سے پیدا کیا گیا ہے، یہاں تک کہ اگر اسے انجام کار میں وہاں سے نکال دیا جائے تو اسے نقصان پہنچے گا۔ پس اس کے لیے جہنم میں بھی دائمی نعمت ہے، جسے صرف اللہ کے عالم ہی محسوس کرتے ہیں۔\n\nپس جب اللہ نے جس سے چاہا جہالت اور اندھے پن کا پردہ ہٹا دیا، تو اس نے دیکھا کہ مخلوق میں سے کسی نے بھی اپنی سختی کی حالت میں اللہ کے سوا کسی کو نہیں پکارا۔ اگرچہ خوشحالی کی حالت میں اس کے علم میں یہ نہ ہو کہ مصیبتوں کا حل خاص طور پر اللہ کے ہاتھ میں ہے، اور یہی توحید (التوحید) ہے۔ اس نے اس اعتقاد کو سختیوں کے وقت ظاہر نہیں کیا۔ پس مشرک (المشرك) اللہ کی گواہی کے مطابق خوشحالی اور سختی کی حالت میں ہمیشہ موحد (موحداً) ہی رہا، مگر یہ کہ مشرک پر خوشحالی کی حالت میں توحید (التوحید) کی کوئی علامت ظاہر نہیں ہوتی جو اس کا اعتقاد ہے۔ لیکن جب وہ بے قرار ہوتا ہے تو اپنے خالق کی توحید کے علم کی طرف لوٹ جاتا ہے، اور اس پر شرک (الشرك) کی کوئی علامت ظاہر نہیں ہوتی۔ یہ سب دارِ تکلیف میں ہے۔ اور اکثر ظاہری علوم کے علماء اس فضل الٰہی اور کرم (الكرم) سے غافل ہیں۔ پس یہ ذکر اللہ کے کرم کا وہ علم عطا کرتا ہے جو اللہ کی مخلوق میں سے کسی ایسے شخص کے پاس نہیں ہوتا جو اس ذکر کو نہ کرتا ہو اور اس پر مداومت نہ رکھتا ہو۔ اور میں نے اپنے زمانے میں شیخ ابو مدین ببجایہ رحمہ اللہ کے سوا کسی کو نہیں سنا جو اس (مقام) سے متحقق ہوا ہو۔\n\nاور جب دارِ تکلیف میں کسی شخص میں توحید (التوحید) کا ظہور ایک وقت میں ہو اور شرک (الشرك) کا ظہور دوسرے وقت میں، جبکہ باطن میں توحید کا استصحاب (ہمیشہ ساتھ رہنا) موجود ہو، اور وہ اصل فطرت میں بھی موجود ہو، اور دنیا سے نکلنے سے پہلے حالتِ احتضار میں انجام کار اسی کی طرف لوٹنا ہو، تو اس کا زمانہ شرک کے زمانے سے زیادہ ہوتا ہے۔ اگر ہم ان دونوں کے درمیان معاملے کا موازنہ زمانے کے لحاظ سے کریں، تو توحید کا زمانہ فطرت اور باطن میں دائمی استصحاب کے ساتھ، علم اور اعتقاد کے طور پر غالب رہے گا۔ اور سختیوں کے وقت اس کا ظہور اپنے اوقات کے لحاظ سے شرک کے زمانے سے زیادہ ہوگا۔ پس اس دار (دنیا) کا حکم تمہیں اس چیز سے نہ روکے جس کی طرف ہم نے اس وظیفہ (ہجیر) میں اشارہ کیا ہے، کیونکہ یہ تمہیں فائدہ دے گا۔ اور اگر تم یہ فرض بھی کر لو کہ وہ (توحید) اس سے جدا نہیں ہوتی، تب بھی یہ تمہیں نقصان نہیں دے گی۔ پس ہر حال میں اس (توحید) کو کہو اور اس پر بھروسہ کرو۔ اور ان لوگوں میں سے نہ بنو جو اللہ کی گواہی کو رد کرتے ہیں جب اس نے تمہارے پاس ان کے لیے اس کی گواہی دی، اور اس نے تمہارے پاس گواہی نہیں دی یہاں تک کہ اس نے تمہیں حاکم (الحاکم) بنا دیا، پس اس نے تمہیں حکم میں اپنی منزلت پر اتارا اور خود کو شہادت (گواہی) میں تمہاری منزلت پر اتارا۔ پس اگر تم اس کے مطابق فیصلہ نہ کرو جو ہم نے مقرر کیا ہے، تو تم نے عدل کی گواہی کو رد کر دیا: \"پس حق (الْحَقِّ) کے بعد گمراہی (الضَّلَالُ) کے سوا کیا ہے؟ پھر تم کہاں پھیرے جا رہے ہو (فَمَاذَا بَعْدَ الْحَقِّ إِلَّا الضَّلَالُ فَأَنَّى تُصْرَفُونَ)\"... \"میں تمہیں نصیحت کرتا ہوں کہ تم جاہلوں میں سے نہ ہو (إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ)\"۔\n\nپھر اس کا قول: \"اگر تم سچے ہو (إِنْ كُنْتُمْ صَادِقِينَ)\"، یعنی اگر تم سچ بولو اور اس چیز کو نہ چھپاؤ جو تم اپنے نفوس میں پاتے ہو، میرے اس قول کے بارے میں کہ تم سختیوں میں صرف اللہ کو پکارتے ہو، جس پر تمہارے دل ہمیشہ لپٹے ہوئے ہیں۔ پس وہ بلاشبہ اپنے علم کی وجہ سے تصدیق کرنے والے ہیں، تو کیا وہ سوال کیے جانے پر سچ بولیں گے یا نہیں؟\n\nپس وہ کبھی سچ بولتے ہیں اور کبھی جھوٹ، اور کبھی جانتے ہیں اور کبھی جاہل ہوتے ہیں۔\nپس تم ان کی بات پر کان نہ دھرو، کیونکہ میں جانتا ہوں کہ وہ کیا ارادہ رکھتے ہیں۔\nتم زمانے کے واحد (فرد) بن جاؤ، اس طرف توجہ نہ دو جو وہ کہتے ہیں جب وہ جھوٹ بولتے ہیں۔\nکیونکہ میں ان کے اقوال سے باخبر ہوں، اور میرا علم ان کے بارے میں یہ ہے کہ وہ صرف اٹکلیں لگاتے ہیں۔\nاور اگر میں ان کے بارے میں جانتا کہ جب وہ کچھ کہتے ہیں تو سچ بولتے ہیں۔\nتو میں ضرور ان کی بات سنتا، لیکن وہ جب بولتے ہیں تو انہیں شعور نہیں ہوتا۔\nوہ جب کہتے ہیں کہ \"عماء (الغیب) میں اور عرش میں وہی ہے جو وہ جھوٹ گھڑتے ہیں\" (تو وہ جھوٹ بولتے ہیں)۔\nانہوں نے قول کو بدل ڈالا، پس ان کے ذریعے ان کے خلاف مدد طلب کرو کہ وہ مدد کیے جائیں گے۔\n\nاور جب جھوٹ بولنے والے کو یہ معلوم نہ ہو کہ وہ جھوٹا ہے، تو اس کے جھوٹ پر اس سے مؤاخذہ نہیں کیا جائے گا۔ اور اگر اس سے مؤاخذہ کیا جائے، تو صرف اس علم کے حصول میں کوتاہی کی وجہ سے کیا جائے گا جو اسے حاصل کرنا چاہیے تھا، اور اس عمل کی وجہ سے جس میں اس کی نجات اور سعادت ہے، نہ کہ اس کے جھوٹ کی وجہ سے۔ پس جھوٹے سے مؤاخذہ صرف اسی صورت میں کیا جائے گا جب وہ ان مقامات پر اپنے جھوٹ کو جانتا ہو جہاں اسے سچ بولنے کا مکلف بنایا گیا ہے، اور وہ منکر (جاحد) ہے جب اس سے اس مطلوبہ امر کا اقرار طلب کیا جائے۔ جیسا کہ اللہ تعالیٰ کا قول ان لوگوں کے حق میں جو اس صفت پر تھے: \"اور انہوں نے ظلم اور تکبر کی وجہ سے ان کا انکار کر دیا، حالانکہ ان کے دلوں نے انہیں یقین کر لیا تھا (وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ ظُلْمًا وَعُلُوًّا)\"۔ اور ہم یہ طے کر چکے ہیں کہ جب کسی ایسے شخص سے مؤاخذہ کیا جاتا ہے جو یہ نہیں جانتا کہ وہ جھوٹا ہے، تو اس سے مؤاخذہ اس لیے کیا جاتا ہے کہ اس نے علم حاصل کرنے میں کوتاہی کی جو اسے اس معاملے سے آگاہ کرتا جس میں اس نے جھوٹ بولا، بغیر یہ جانے کہ وہ حق نہیں ہے۔ پس جھوٹے کے مؤاخذے میں اور اس وقت میں جب وہ جھوٹا ہے، اور اس شخص کے مؤاخذے میں فرق ہے جس نے علم حاصل کرنے میں کوتاہی کی جو اسے سچ کو جھوٹ سے اور سچے کو جھوٹے سے پہچنواتا ہے۔ پس ہر چیز کو اس کی صفت کے ساتھ اس کے مقام پر اتارا جائے۔ اور یہ لوگوں میں نایاب ہے اور اس کا وجود کم ہے۔ اور اللہ حق (الْحَقَّ) فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔ اللہ ہمیں اور آپ کو ہر حال میں عمل کرنے والے علماء میں سے بنائے، اور ہمارے اور صادقین اور صدیقین کے مقام کے درمیان کوئی رکاوٹ نہ ڈالے، بے شک وہ اس کا مالک ہے اور اس پر قادر ہے۔ آمین، اپنی عزت کے ساتھ۔",
    "fa": "باب پانصد و یکم در معرفت حال قطبی که منزل او [آیه] «آیا غیر خدا را می‌خوانید اگر راستگویید؟» (أَ غَيْرَ الله تَدْعُونَ إِنْ كُنْتُمْ صادِقِينَ) بود، و این [باب] هجیر (ذکر دائمی) شیخ ما ابومدین (رضی الله عنه) بود.\n\nآیا راستگو غیر خدا را می‌خواند؟\nیا دهانش به غیر خدا سخن می‌گوید؟\n\nبلکه به او (حق) سخن می‌گوید و از او باز نمی‌ماند،\nو از این رو در هر حالی راست می‌گوید.\n\nسپس او را می‌خواند، هنگامی که به واسطه او می‌خواند،\nپس اوست خواننده‌ای که به او نمی‌رسند.\n\nآیا خالق آنچه را که می‌آفریند،\nبرای چیز جدیدی پس از این می‌آفریند؟\n\nکاش می‌دانستم، آیا موجودی را می‌بینی\nکه ذاتش به او (حق) قائم باشد و خلق نشود؟\n\nامثال (نمونه‌ها) را آنچه که در آنها\nاز فنای هستی‌شان محقق می‌شود، حجاب کرده است.\n\n### [آیا حاکم به علم خود حکم می‌کند یا خیر؟]\n\nخداوند متعال فرمود: «بلکه تنها او را می‌خوانید، پس اگر بخواهد، آنچه را که به خاطر آن او را می‌خوانید برطرف می‌کند و آنچه را شریک او قرار داده‌اید فراموش می‌کنید» (بَلْ إِيَّاهُ تَدْعُونَ فَيَكْشِفُ ما تَدْعُونَ إِلَيْهِ إِنْ شاءَ وتَنْسَوْنَ ما تُشْرِكُونَ). یعنی شرک را ترک می‌کنید. پس این ذکر، این شهادت الهی را نتیجه داد. و اگر حاکم عین شاهد باشد، حیرت باقی می‌ماند که آیا حاکم به علم خود حکم می‌کند یا خیر؟ زیرا شهادت، علم است، در حالی که حکم گاهی بر اساس غلبه ظن و گاهی بر اساس علم است. و موضع شهادت [همان آیه] «بلکه تنها او را می‌خوانید... و آنچه را شریک او قرار داده‌اید فراموش می‌کنید» (بَلْ إِيَّاهُ تَدْعُونَ ... وتَنْسَوْنَ ما تُشْرِكُونَ) است، و همچنین قول او [خداوند]: «و چون در دریا به شما زیانی رسد، جز او هر که را می‌خوانید گم می‌شود» (وإِذا مَسَّكُمُ الضُّرُّ في الْبَحْرِ ضَلَّ من تَدْعُونَ إِلَّا إِيَّاهُ) و قول او: «یا کیست آن که درمانده را چون بخواند اجابت می‌کند؟» (أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذا دَعاهُ). پس او (حق) در دار تکلیف (دنیای وظیفه) برای ما به توحید خود در امور مهم شهادت داده است. و کریم را جز بدکار نمی‌شناسد، و هیچ کریمی‌تر از خدا نیست. و خداوند بدکار را آگاه ساخت که به کرم حق سخن بگوید، زیرا او در حق او به کرم حکم می‌کند، پس فرمود: «ای انسان، چه چیز تو را در برابر پروردگار کریمت مغرور ساخته است؟» (يا أَيُّهَا الْإِنْسانُ ما غَرَّكَ بِرَبِّكَ الْكَرِيمِ). این برای آن است که بگوید: کرم تو [مرا مغرور ساخت]. و منظور از انسان در اینجا جز بدکار صاحب گناه کبیره نیست، زیرا با بزرگی کرم او (حق) جز با بزرگترین گناهان کبیره مقابله نمی‌شود. در آنجاست که عمومیت و قدرت کرم الهی آشکار می‌شود. پس او (بدکار) اگرچه آمرزیده نشود، اما ناگزیر کرم الهی در نهایت (في المال) شامل حال او می‌شود، حتی اگر از آتش خارج نشود، زیرا آتش موطن اوست و از آن خلق شده است، به طوری که اگر در نهایت از آن خارج شود، زیان می‌بیند. پس برای او در آنجا نعمتی پایدار است که جز عالمان بالله آن را درک نمی‌کنند.\n\nپس هنگامی که خداوند پرده جهل و کوری را از کسی که برایش کشف کرد (کشف)، برداشت، دید که هیچ‌کس از خلق در حال شدت و سختی جز خدا را نخوانده است. اگر در علم او در حال آسایش نبود که حل مشکلات تنها به دست خداست (و این همان توحید است)، آن اعتقاد در هنگام سختی‌ها آشکار نمی‌شد. پس مشرک به شهادت خدا در حال آسایش و سختی همواره موحد بوده است، جز اینکه در حال آسایش، نشانه‌ای از نشانه‌های توحید که اعتقاد اوست، بر او ظاهر نمی‌شود. اما هنگامی که مضطر می‌شود، به علم خود به توحید خالقش باز می‌گردد و هیچ نشانه‌ای از نشانه‌های شرک بر او ظاهر نمی‌شود. و همه اینها در دار تکلیف (دنیای وظیفه) است، و بیشتر علمای رسوم (ظاهرگرا) از این فضل الهی و کرم غافل‌اند. پس این ذکر، از علم به کرم خدا چیزی را می‌بخشد که نزد هیچ‌کس از خلق خدا که این ذکر و مداومت بر آن را ندارد، نیست. و من در زمان خود نشنیدم که کسی به آن متحقق شده باشد، مگر شیخ ابومدین در بجایه (رحمه الله).\n\nو هنگامی که در دار تکلیف، در یک شخص، ظهور توحید در یک زمان و ظهور شرک در زمانی دیگر جمع شود، در حالی که توحید در باطن همراه اوست و در اصل فطرت او وجود دارد و در نهایت (في المال) در حال احتضار پیش از خروج از دنیا به آن باز می‌گردد، پس زمان توحید او بیشتر از زمان شرک او بوده است. اگر این امر را با زمان بین آن دو مقایسه کنیم، زمان توحید به واسطه فطرت و همراهی دائمی در باطن (از نظر علم و اعتقاد) غالب خواهد بود، و ظهور آن در وقت سختی‌ها نیز از نظر زمان بیشتر از زمان شرک بوده است. پس حکم این دنیا (دار التکلیف) تو را از این نکته‌ای که در این هجیر (ذکر دائمی) به آن اشاره کردیم، محجوب نسازد، زیرا برای تو سودمند است. و اگر فرض کنی که از تو جدا نمی‌شود، به تو ضرری نمی‌رساند. پس در هر حال به آن سخن بگو و بر آن اعتماد کن. و از کسانی مباش که شهادت خدا را رد می‌کنند، هنگامی که او نزد تو به آن شهادت داده است. و او نزد تو شهادت نداد مگر آنکه تو را حاکم قرار داد، پس تو را در حکم به منزلت خود نشاند و خود را در شهادت به منزلت تو نشاند. اگر به آنچه مقرر کردیم حکم نکنی، شهادت عادل را رد کرده‌ای. «پس بعد از حق جز گمراهی چیست؟ پس چگونه بازگردانده می‌شوید؟» (فَما ذا بَعْدَ الْحَقِّ إِلَّا الضَّلالُ فَأَنَّى تُصْرَفُونَ). [و همچنین آیه] «من تو را اندرز می‌دهم که از جاهلان نباشی» (إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ). سپس قول او [خداوند]: «اگر راستگویید» (إِنْ كُنْتُمْ صادِقِينَ)، یعنی اگر راست بگویید و آنچه را که در نفوس خود می‌یابید، از قول من که شما در سختی‌ها جز خدا را نمی‌خوانید، کتمان نکنید. همان خدایی که قلب‌های شما پیوسته بر او منطوی است. پس آنها بدون شک به علم خود تصدیق‌کننده‌اند. حال آیا اگر از آنها سؤال شود، تصدیق می‌کنند یا خیر؟\n\nپس گاهی راست می‌گویند و گاهی دروغ،\nو گاهی می‌دانند و گاهی جاهل‌اند.\n\nپس به سخن آنها گوش مده،\nزیرا من به آنچه قصد می‌کنند، دانا هستم.\n\nپس یگانه عصر باش و به آنچه می‌گویند،\nهنگامی که یاوه‌گویی می‌کنند، توجه مکن.\n\nزیرا من به اقوال آنها آگاه هستم،\nو علم من به آنها این است که آنها حدس می‌زنند (دروغ می‌بافند).\n\nو اگر می‌دانستم که آنها،\nهنگامی که سخنی می‌گویند، راست می‌گویند،\n\nهر آینه به سخن آنها گوش می‌دادم،\nاما آنها هنگامی که سخن می‌گویند، شعور ندارند (درک نمی‌کنند).\n\nآنها هنگامی که می‌گویند در عماء (فضای ابهام)\nو در عرش جز آنچه افترا می‌بندند، نیست.\n\nپس سخن را تحریف کردند، و از آنها (مخالفان)\nبر خودشان یاری خواستند، به گمان اینکه یاری می‌شوند.\n\nو هرگاه دروغگو نداند که دروغ می‌گوید، به خاطر دروغش مؤاخذه نمی‌شود. و اگر مؤاخذه شود، تنها به خاطر کوتاهی‌اش در کسب علمی است که باید کسب می‌کرد و عملی که نجات و سعادت او در آن است، نه از جهت دروغش. پس دروغگو مؤاخذه نمی‌شود مگر زمانی که به دروغ خود در مواطنی که مکلف به راستگویی در آنهاست، عالم باشد. و او همان منکر (جاحد) است، هنگامی که کسی از او اقرار در آن امر مطلوب را بخواهد. مانند قول خداوند متعال در حق کسی که دارای این صفت بود: «و آن را از روی ستم و برتری‌جویی انکار کردند، در حالی که خودشان به آن یقین داشتند» (وجَحَدُوا بِها واسْتَيْقَنَتْها أَنْفُسُهُمْ ظُلْماً وعُلُوًّا). و ما مقرر کردیم که اگر کسی که نمی‌داند دروغگو است، مؤاخذه شود، تنها از آن جهت مؤاخذه می‌شود که در کسب علمی که او را بر این امری که در آن دروغ گفته است، آگاه سازد، کوتاهی کرده است، بدون آنکه بداند آن حق نیست. پس فرق است بین مؤاخذه دروغگو (و زمانی که او دروغگو است) و بین مؤاخذه کسی که در کسب علمی که صدق را از کذب و صادق را از کاذب می‌شناساند، کوتاهی کرده است. پس هر چیزی را به صفتش در جایگاه خود قرار می‌دهد. و این در میان مردم نادر و کم‌یاب است. «و خداوند حق را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ). خداوند ما و شما را در هر حال از عالمان عامل قرار دهد و بین ما و مقام صادقان و صدیقان حائل نشود. همانا او شایسته و توانا بر آن است. آمین به عزت او."
  },
  "page_count": 2
}