{
  "id": 296,
  "title": {
    "ar": "الباب السادس والتسعون ومائتان في معرفة منزل انتقال صفات أهل السعادة إلى أهل الشقاء في الدار الآخرة من الحضرة الموسوية",
    "en": "Chapter Two Hundred and Ninety-Six: Regarding the understanding of the station (منزل) of the transfer of the attributes (صفات) of the people of felicity (أهل السعادة) to the people of wretchedness (أهل الشقاء) in the Hereafter (الدار الآخرة), derived from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب دو سو چھیانوے، حضرتِ موسویہ سے دارِ آخرت میں اہلِ سعادت کی صفات کے اہلِ شقاوت کی طرف منتقل ہونے کی منزل (منزل انتقال) کی معرفت کے بیان میں۔",
    "fa": "باب دویست و نود و ششم در معرفت منزل انتقال صفات اهل سعادت به اهل شقاوت در سرای آخرت از حضرت موسوی."
  },
  "content": {
    "ar": "## «الباب السادس والتسعون ومائتان في معرفة منزل انتقال صفات أهل السعادة إلى أهل الشقاء في الدار الآخرة من الحضرة الموسوية»\n\n\n> غشيت منازلا لمقام صدق *** لها في قلب نازلها خشوع‏\n\n\n> ونار الاصطلام لها وقود *** إذا ما ابتز خلعتها الضجيع‏\n\n\n> وأغذية العلوم تزيد حرصا *** ولا يذهب لها عطش وجوع‏\n\n\n> ولو طعم الوجود لمات جوعا *** ويحييه الخريف أو الربيع‏\n\n\n> بخلق ثم صلب في سطوح *** يجليها لرفعتها الرفيع‏\n\n\n> فعلم من تشاء بغير قهر *** عسى وقتا يكون له رجوع‏\n\n\nيريد في البيت الخامس قوله تعالى أَ فَلا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ وإِلَى السَّماءِ كَيْفَ رُفِعَتْ وإِلَى الْجِبالِ كَيْفَ نُصِبَتْ وإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ يريد الاعتبار في ذلك‏\n\n\n### [أن درجات الجنة على عدد دركات النار]\n\n\nاعلم وفقنا الله وإياك أن درجات الجنة على عدد دركات النار فما من درج إلا ويقابله درك من النار وذلك أن الأمر والنهي لا يخلو الإنسان إما أن يعمل بالأمر أو لا يعمل فإن همل به كانت له درجة في الجنة معينة لذلك العمل خاصة وفي موازنة هذه الدرجة المخصوصة لهذا العمل الخاص إذا تركه الإنسان درك في النار لو سقطت حصاة من تلك الدرجة في الجنة لوقعت على خط استواء في ذلك الدرك من النار فإذا سقط الإنسان من العمل بما أمر فلم يعمل كان ذلك الترك لذلك العمل عين سقوطه إلى ذلك الدرك قال تعالى فَاطَّلَعَ فَرَآهُ في سَواءِ الْجَحِيمِ فالاطلاع على الشي‏ء من أعلى إلى أسفل والسواء حد الموازنة على الاعتدال فما رآه إلا في ذلك الدرك الذي في موازنة درجته فإن العمل الذي نال به هذا الشخص تلك الدرجة تركه هذا الشخص الآخر الذي كان قرينه في الدنيا بعينه فانظر إلى هذا العدل الإلهي ما أحسنه وهما الرجلان اللذان ذكرهما الله في سورة الكهف المضروب بهما المثل وهو قوله تعالى واضْرِبْ لَهُمْ مَثَلًا رَجُلَيْنِ إلى آخر الآيات في قصتهما في الدنيا وذكر في الصافات حديثهما في الآخرة في قوله تعالى قالَ قائِلٌ مِنْهُمْ إِنِّي كانَ لِي قَرِينٌ يَقُولُ أَ إِنَّكَ لَمِنَ الْمُصَدِّقِينَ وفيها ذكر المعاتبة وفي قوله تَاللَّهِ إِنْ كِدْتَ لَتُرْدِينِ لما اطلع عليه فَرَآهُ في سَواءِ الْجَحِيمِ وهو قوله ما أَظُنُّ السَّاعَةَ قائِمَةً وورد في الأخبار الإلهية الصحاح عن رسول الله صلى الله عليه وسلم عن ربه عز وجل فيما يقوله لعبده يوم القيامة أ فظننت إنك ملاقي‏\n\n\nفلنمثل لك منها الأمهات التي بنى الإسلام عليها وهي خمسة لا إله إلا الله وإقام الصلاة وإيتاء الزكاة وصيام رمضان وحِجُّ الْبَيْتِ من اسْتَطاعَ إِلَيْهِ سَبِيلًا فمن الناس من آمن بها كلها فسعد ومنهم من كفر بها كلها فشقي ومنهم من آمن ببعضها وكفر ببعضها فهو ملحق بالكافر إلحاق حق وهكذا جميع الأوامر والنواهي التي تقتضيها فروع الشريعة في جميع حركات الإنسان وسكونه في الايمان بالحكم المشروع فيها والكفر والعمل المشروع فيها بظاهر الإنسان المكلف وباطنه وترك العمل ويحصر ذلك عقد وقول وعمل وفي مقابلته حل وصمت وترك عمل هذه مقابلة من وجه في حق قوم ومقابلة أخرى في حق قوم أو هذا الشخص بعينه وهو عقد مخالف لعقد وقول يخالف قولا وعمل مخالف لعمل إذ كان لا يلزم من صاحب الحل أن يكون قد عقد أمرا آخر فإن الحل إنما متعلقة ذلك العقد الإيماني بذلك المعقود عليه فأسقطه المعطل فلم يرتبط بعقد آخر وشخص آخر عقد على وجود الشريك لله فحل من عنقه عقد حبل التوحيد وعقد حبل التشريك فلهذا فصلنا الأمر على ما يكون عليه في الدار الآخرة موازنا لحالة الدنيا وهذا صورة الشكل في الأمهات وعليها نأخذ جميع المأمور بها والمنهي عنها من العمل بالمأمور والقول به والايمان به وترك ذلك حلا وعقدا\nفي الكل أو في البعض وكذلك المنهي عنها من العمل به والقول به والعقد عليه وترك ذلك حلا وعقدا للكل والبعض صورة درج الجنة ودرك النار والأعراف وهو السور الذي باطِنُهُ فِيهِ الرَّحْمَةُ وظاهِرُهُ من قِبَلِهِ الْعَذابُ والرقائق النازلة والصاعدة وضعناها لك لتتصورها في ذهنك إن كنت بعيد الفهم والله المعين لا رب غيره وهكذا درج العمل بالأمر والنهي ودرك ترك العمل بهما ودرج القول بالأمر والنهي ودرك تركهما عقدا وحلا\nكلا وبعضا وهكذا مناسبات الجزاء كلها لا تختل قال الله عز وجل ومَكَرُوا ومَكَرَ الله وقال قالُوا (إِنَّا مَعَكُمْ) إِنَّما نَحْنُ مُسْتَهْزِؤُنَ الله يَسْتَهْزِئُ بِهِمْ وقال إِنْ تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ وقال تعالى إِنَّ الَّذِينَ أَجْرَمُوا كانُوا من الَّذِينَ آمَنُوا يَضْحَكُونَ وقال في الجزاء فَالْيَوْمَ الَّذِينَ آمَنُوا من الْكُفَّارِ يَضْحَكُونَ ثم بين فقال هَلْ ثُوِّبَ الْكُفَّارُ ما كانُوا يَفْعَلُونَ فعم بالألف واللام ورد الفعل عليهم وقال تعالى نَسُوا الله فَنَسِيَهُمْ ولهذا سمي جَزاءً وِفاقاً ولو لم يكن الأمر كذلك لما كان جزاء وقد ورد في المتكبرين أنهم يحشرون كأمثال الذر يطئوهم الناس بأقدامهم‏\n\n\nصغارا لهم وذلة ولتكبرهم على أوامر الله فالجنة خير لا شر فيها والنار شر لا خير فيها فجميع علم المشرك وعمله وقوله الذي لو كان موحدا جوزي عليه في الجنة بحسبه يعطي ذلك الجزاء للموحد الجاهل بذلك الأمر والعلم المفرط في ذلك العمل التارك لذلك القول والجزاء عليه الذي لو كان مشركا لحصل له في النار يعطي لذلك المشرك الذي لا حظ له في الجنة فإذا رأى المشرك ما كان يستحقه لو كان سعيدا يقول يا رب هذا لي فأين جزاء عملي الذي هذا جزاؤه فإن الأعمال بمكارم الأخلاق والتحريض عليها الذي هو القول يقتضي جزاء حسنا وقع ممن وقع فيقول الله له لما عملت كذا ويذكر له ما عمل من مكارم الأخلاق والقول بها والعمل بمواقعها قد جازيتك على ذلك بما أنعمت به عليك من كذا وكذا فيقرر عليه جميع ما أنعمه عليه جزاء لا نعمة في خلقه المبتدأة التي ليست بجزاء فيزنها المشرك هنالك بما قد كشف الله من علم الموازنة فيقول صدقت فيقول الله له فما نقصتك من جزائك شيئا والشرك قطع بك عن دخول دار الكرامة فتنزل فيها على موازنة هذه الأعمال ولكن أنزل على درجات تلك الأعمال فإن صاحبها منعه التوحيد أن يكون من أهل هذه الدار فهذا هو من الميراث الذي بين أهل الجنة وأهل النار ونذكر الكلام في هذا الفصل في باب الجنة والنار من هذا الكتاب فهذا هو الانتقال الذي بين أهل السعادة وأهل الشقاء فإن المؤمن هنا في عبادة والعبادة تعطيه الخشوع والذلة والكافر في عزة وفرحة فإذا كان في هذا اليوم يخلع عز الكافر وسروره وفرحه على المؤمن ويخلع ذل المؤمن وخشوعه الذي كان لباسه في عبادته في الدنيا على الكافر يوم القيامة قال تعالى خاشِعِينَ من الذُّلِّ يَنْظُرُونَ من طَرْفٍ خَفِيٍّ فإن هذا النظر هو حال الذليل لا يقدر يرفع رأسه من القهر وذلك الخشوع من الكافر يوم القيامة والذلة والنظر المنكسر الذي لا يرفع بسببه رأسه إنما هو لله تعالى خوفا منه وهذا كان حال المؤمن في الدنيا لخوفه من الله ف ذلِكَ يَوْمُ التَّغابُنِ حيث يرى الإنسان صفة عزه وسروره وفرحه على غيره ويرى ذل غيره وغمه وحزنه على نفسه فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ ويتضمن هذا المنزل من العلوم علم سؤال الحق عباده السعداء عن مراتب الأشقياء بأي اسم يسأل وعلم المناسبات وعلم ما تعطيه الأفكار وعلم الكيفيات وهو على ضربين ضرب منه لا يعرف إلا بالذوق وضرب منه يدرك بالفكر وهو من باب التوسع في الخطاب لا من باب التحقق فإن التحقق بعلم الكيفيات إنما هو ذوق ولقد نبهني الولد العزيز العارف شمس الدين إسماعيل بن سودكين التوري على أمر كان عندي محققا من غير الوجه الذي نبهنا عليه هذا الولد ذكرناه في باب الحروف من هذا الكتاب وهو التجلي في الفعل هل يصح أو لا يصح فوقتا كنت أنفيه بوجه ووقتا كنت أثبته بوجه يقتضيه ويطلبه التكليف إذ كان التكليف بالعمل لا يمكن أن يكون من حكيم عليم يقول اعمل وافعل لمن يعلم أنه لا يعمل ولا يفعل إذ لا قدرة له عليه وقد ثبت الأمر الإلهي بالعمل للعبد مثل أَقِيمُوا الصَّلاةَ وآتُوا الزَّكاةَ واصْبِرُوا وصابِرُوا ورابِطُوا وجاهِدُوا فلا بد أن يكون له في المنفعل عنه تعلق من حيث الفعل فيه يسمى به فاعلا وعاملا وإذا كان هذا فبهذا القدر من النسبة يقع التجلي فيه فبهذا الطريق كنت أثبته وهو طريق مرضي في غاية الوضوح يدل أن القدرة الحادثة لها نسبة تعلق بما كلفت عمله لا بد من ذلك ورأيت حجة المخالف واهية في غاية من الضعف والاختلال فلما كان يوما فاوضني في هذه المسألة هذا الولد إسماعيل أبو سودكين المذكور فقال لي وأي دليل أقوى على نسبة الفعل إلى العبد وإضافته إليه والتجلي فيه إذ كان من صفته من كون الحق خلق الإنسان على صورته فلو جرد عنه الفعل لما صح أن يكون على صورته ولما قبل التخلق بالأسماء وقد صح عندكم وعند أهل الطريق بلا خلاف إن الإنسان مخلوق على السورة وقد صح التخلق بالأسماء فلم يقدر أحد أن يعرف ما دخل علي من السرور بهذا التنبيه فقد\nيستفيد الأستاذ من التلميذ أشياء من مواهب الحق تعالى لم يقض الله للاستاذ أن ينالها إلا من هذا التلميذ كما نعلم قطعا أنه قد يفتح للإنسان الكبير في أمر يسأله عنه بعض العامة مما لا قدر له في العلم ولا قدم ويكون صادق التوجه في هذا العلم المسئول عنه فيرزق العالم في ذلك الوقت لصدق السائل علم تلك المسألة ولم تكن عنده قبل ذلك عناية من الله بالسائل وتضمنت عناية الله بالسائل إن حصل للمسئول علما لم يكن عنده ومن راقب قلبه يجد ما ذكرناه فالحمد لله الذي استفدنا من أولادنا مثل ما استفاده شيوخنا منا أمورا كانت أشكلت عليهم ويتضمن هذا المنزل علم التبليغ عن الله إلى خلقه من رسول ونبي ووارث ويتضمن علم السياسة في التعليم بباب اللطف من حيث لا يشعر المطلوب بذلك ويتضمن علم الجزاء المطلق والمقيد فالمطلق مجازاة العبد ربه مثل الشكر على المنعم ومجازاة الله العبد مثل المزيد فيما وقع عليه الشكر من العبد والمجازاة المقيدة هي جزاء الله العبد في الدار الآخرة فإنها ليست بدار تكليف قال تعالى وأَوْفُوا بِعَهْدِي في موطن التكليف وهو الدنيا أُوفِ بِعَهْدِكُمْ في الدارين معا دنيا وآخرة وهذا القدر كاف في هذا الباب إن شاء الله تعالى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Ninety-Six: Concerning the Station of the Transfer of the Attributes of the People of Felicity to the People of Wretchedness in the Hereafter, from the Mosaic Presence (الحضرة الموسوية)\n\nI covered stations belonging to a station of truth (مقام صدق),\nFor which there is reverence (خشوع) in the heart of the one who descends into it.\n\nAnd the fire of absorption (الاصطلام) is its fuel,\nWhen the companion (الضجيع) strips off its robe.\n\nAnd the nourishment of the sciences increases avidity,\nAnd its thirst and hunger do not depart.\n\nAnd if it tasted Existence (الوجود), it would die of hunger,\nAnd the autumn or the spring revives it.\n\nBy creation (خلق), then setting firm (صلب) upon surfaces (سطوح),\nWhich the Exalted One (الرفيع) manifests due to their elevation.\n\nSo teach whomever You wish without compulsion,\nPerhaps there will be a time for his return (رجوع).\n\nThe author intends, in the fifth verse, the saying of the Exalted: <<أَ فَلا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ وإِلَى السَّماءِ كَيْفَ رُفِعَتْ وإِلَى الْجِبالِ كَيْفَ نُصِبَتْ وإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ>> (Do they not look at the camels, how they were created? And at the heaven, how it was raised? And at the mountains, how they were set up? And at the earth, how it was spread out?)—He intends contemplation (الاعتبار) in that.\n\n### [That the Degrees of Paradise are equal to the Levels of the Fire]\n\nKnow—may Allah grant us and you success—that the degrees (درجات) of Paradise are equal to the number of the levels (دركات) of the Fire. There is no degree except that it is countered by a level of the Fire. This is because the human being, regarding command and prohibition, either acts upon the command or does not act. If he acts upon it, he has a specific degree in Paradise designated solely for that action. Corresponding to this specific degree for this particular action, if the human being abandons it, there is a level in the Fire. If a pebble were to fall from that degree in Paradise, it would land on the line of equilibrium (خط استواء) in that level of the Fire. Thus, when a person falls away from performing what was commanded and does not act, that abandonment of the action is the very essence of his descent (سقوطه) into that level.\n\nThe Exalted said: <<فَاطَّلَعَ فَرَآهُ في سَواءِ الْجَحِيمِ>> (So he looked down and saw him in the midst of the Hellfire). Looking down (الاطلاع) upon something is from above to below, and the 'midst' (السواء) is the limit of equilibrium (الموازنة) upon moderation (الاعتدال). He only saw him in that level (درك) which was in equilibrium with his own degree (درجته). For the action by which this person attained that degree was abandoned by that other person, who was his companion (قرينه) in the world, in its very essence. Look at how beautiful this Divine Justice (العدل الإلهي) is! These are the two men whom Allah mentioned in the Chapter of the Cave (Surat al-Kahf), for whom the parable was struck, which is His saying, the Exalted: <<واضْرِبْ لَهُمْ مَثَلًا رَجُلَيْنِ>> (And present to them a parable of two men...) until the end of the verses concerning their story in the world. And in the Chapter of the Ranks (Surat as-Saffat), He mentioned their conversation in the Hereafter in His saying, the Exalted: <<قالَ قائِلٌ مِنْهُمْ إِنِّي كانَ لِي قَرِينٌ يَقُولُ أَ إِنَّكَ لَمِنَ الْمُصَدِّقِينَ>> (A speaker among them will say, 'Indeed, I had a companion who used to say, \"Are you indeed of those who believe...?\"'). And therein is mentioned the reproach, and in His saying: <<تَاللَّهِ إِنْ كِدْتَ لَتُرْدِينِ>> (By Allah, you almost ruined me!) when he looked down upon him and saw him <<فَرَآهُ في سَواءِ الْجَحِيمِ>> (and saw him in the midst of the Hellfire), which is his saying: <<ما أَظُنُّ السَّاعَةَ قائِمَةً>> (I do not think the Hour will ever occur). And it is reported in the sound Divine Narrations (الأخبار الإلهية الصحاح) from the Messenger of Allah (peace and blessings be upon him), from his Lord, the Mighty and Majestic, concerning what He will say to His servant on the Day of Resurrection: 'Did you think that you would meet Me?'\n\nLet us present to you the fundamental matters (الأمهات) upon which Islam is built, which are five: *La ilaha illa Allah* (There is no god but Allah), establishing the prayer, giving the *Zakat*, fasting Ramadan, and the pilgrimage (حِجُّ الْبَيْتِ) for whoever is able to find a way there. Among people, there are those who believed in all of them and were felicitous (سعد), and those who disbelieved in all of them and were wretched (شقي). And among them are those who believed in some and disbelieved in others, and he is rightly attached (إلحاق حق) to the disbeliever. Thus is the case with all the commands and prohibitions required by the branches of the Sacred Law (فروع الشريعة) in all the movements and stillness of the human being: in believing in the prescribed ruling (الحكم المشروع) therein, and disbelief; and in the prescribed action therein, by the outward and inward of the responsible person (المكلف), and the abandonment of the action.\n\nThis is encompassed by: affirmation (عقد), speech (قول), and action (عمل). And corresponding to it is: dissolution (حل), silence (صمت), and abandonment of action (ترك عمل). This is a correspondence from one perspective concerning one group of people, and another correspondence concerning another group, or concerning this very person. This involves an affirmation contrary to an affirmation, a speech contrary to a speech, and an action contrary to an action. Since the one who dissolves (صاحب الحل) is not necessarily bound by another affirmation (عقد), for the dissolution (حل) is only related to that affirmation of faith (العقد الإيماني) concerning that which was affirmed, and the denier (المعطل) dropped it and was not bound by another affirmation. Whereas another person affirmed the existence of a partner to Allah, thus dissolving the bond of the rope of Unity (حبل التوحيد) from his neck and affirming the bond of the rope of Association (حبل التشريك). For this reason, we have detailed the matter according to what it will be in the Hereafter, in equilibrium with the state of the world. This is the image of the structure in the fundamental matters (الأمهات), and upon this, we take all that is commanded and prohibited: acting upon the commanded, speaking it, and believing in it; and abandoning that, whether by dissolution or affirmation, in whole or in part. Likewise, concerning what is prohibited: acting upon it, speaking it, and affirming it; and abandoning that, whether by dissolution or affirmation, in whole or in part.\n\nThis is the image of the degrees (درج) of Paradise, the levels (درك) of the Fire, and the Heights (الأعراف), which is the wall whose <<باطِنُهُ فِيهِ الرَّحْمَةُ وظاهِرُهُ من قِبَلِهِ الْعَذابُ>> (inside is mercy, and outside is facing the torment). We have set forth the descending and ascending subtleties (الرقائق) for you so that you may visualize them in your mind, should your understanding be distant. And Allah is the Helper, there is no Lord but Him. Thus are the degrees of acting upon command and prohibition, and the levels of abandoning action upon them; and the degrees of speaking the command and prohibition, and the levels of abandoning them, whether by affirmation or dissolution, in whole or in part. Thus, all correspondences of recompense (مناسبات الجزاء) are flawless.\n\nAllah, the Mighty and Majestic, said: <<ومَكَرُوا ومَكَرَ الله>> (And they planned, and Allah planned). And He said: <<قالُوا (إِنَّا مَعَكُمْ) إِنَّما نَحْنُ مُسْتَهْزِؤُنَ الله يَسْتَهْزِئُ بِهِمْ>> (They said, 'Indeed, we are with you; we are only mockers.' Allah mocks them). And He said: <<إِنْ تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ>> (If you ridicule us, then we will ridicule you just as you ridicule). And the Exalted said: <<إِنَّ الَّذِينَ أَجْرَمُوا كانُوا من الَّذِينَ آمَنُوا يَضْحَكُونَ>> (Indeed, those who committed crimes used to laugh at those who believed). And concerning the recompense, He said: <<فَالْيَوْمَ الَّذِينَ آمَنُوا من الْكُفَّارِ يَضْحَكُونَ>> (So today those who believed are laughing at the disbelievers). Then He clarified, saying: <<هَلْ ثُوِّبَ الْكُفَّارُ ما كانُوا يَفْعَلُونَ>> (Have the disbelievers been recompensed for what they used to do?). He generalized with the definite article and returned the action upon them. And the Exalted said: <<نَسُوا الله فَنَسِيَهُمْ>> (They forgot Allah, so He forgot them). For this reason, it is called a 'fitting recompense' (جَزاءً وِفاقاً). If the matter were not thus, it would not be recompense. It has been reported concerning the arrogant (المتكبرين) that they will be gathered like tiny ants (الذر), whom people will tread upon with their feet.\n\nThis is a humiliation and abasement for them, due to their arrogance against the commands of Allah. Paradise is goodness with no evil in it, and the Fire is evil with no goodness in it. All the knowledge, action, and speech of the polytheist (المشرك)—for which, had he been a monotheist (موحد), he would have been rewarded in Paradise accordingly—that recompense is given to the monotheist who was ignorant of that matter and knowledge, or who was negligent in that action, or who abandoned that speech. And the recompense for it—which, had he been a polytheist, he would have received in the Fire—is given to that polytheist who has no share in Paradise. When the polytheist sees what he would have deserved had he been felicitous, he says, 'O Lord, this is mine! Where is the recompense for my action, for which this is the reward?' For actions based on noble character (مكارم الأخلاق) and the encouragement of them (which is speech) necessitate a good reward, regardless of who performed them. Allah will say to him, 'When you performed such-and-such,' and He mentions the noble character he displayed, the speech concerning it, and the performance of its requirements, 'I have recompensed you for that by what I bestowed upon you of such-and-such,' and He confirms upon him all the blessings He bestowed upon him as a recompense, not as an initial creation (خلقه المبتدأة) that is not recompense. The polytheist will weigh these things there, according to the science of equilibrium (علم الموازنة) that Allah has unveiled, and he will say, 'You have spoken the truth.' Allah will say to him, 'I have not diminished your recompense at all, but polytheism (الشرك) cut you off from entering the Abode of Generosity (دار الكرامة). So you will descend therein [the Fire] in equilibrium with these actions, but you will descend upon the levels of those actions, for their owner [the monotheist] was prevented by Unity (التوحيد) from being among the people of this Abode [the Fire].'\n\nThis, then, is part of the inheritance (الميراث) between the people of Paradise and the people of the Fire. We shall discuss this matter in the chapter on Paradise and the Fire in this book. This is the transfer (الانتقال) that occurs between the people of felicity (أهل السعادة) and the people of wretchedness (أهل الشقاء). For the believer here [in the world] is in worship, and worship grants him reverence (الخشوع) and abasement (الذلة). And the disbeliever is in honor (عزة) and joy (فرحة). When that Day comes, the honor, delight, and joy of the disbeliever are stripped off and bestowed upon the believer, and the abasement and reverence of the believer, which was his garment in his worship in the world, are stripped off and bestowed upon the disbeliever on the Day of Resurrection. The Exalted said: <<خاشِعِينَ من الذُّلِّ يَنْظُرُونَ من طَرْفٍ خَفِيٍّ>> (Humbled by humiliation, their eyes lowered). This gaze is the state of the abased, unable to raise his head due to subjugation (القهر). That reverence (الخشوع) and abasement (الذلة) from the disbeliever on the Day of Resurrection, and the broken gaze (النظر المنكسر) by which he cannot raise his head, is only for Allah, out of fear of Him. This was the state of the believer in the world due to his fear of Allah. That is the Day of Mutual Loss (يَوْمُ التَّغابُن), where a person sees the attribute of his honor, delight, and joy upon another, and sees the abasement, grief, and sorrow of another upon himself. So <<فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ>> (The judgment belongs to Allah, the Exalted, the Grand).\n\nThis station (المنزل) contains the science of the questioning of the Real (الحق) to His felicitous servants concerning the ranks of the wretched—by what Name He questions; the science of correspondences (علم المناسبات); the science of what thoughts yield (علم ما تعطيه الأفكار); and the science of modalities (علم الكيفيات), which is of two types: one type is known only through direct tasting (الذوق), and the other type is grasped through reflection (الفكر), which belongs to the category of expansive discourse, not the category of verification (التحقق). For verification concerning the science of modalities is only through tasting (ذوق).\n\nMy dear son, the Gnostic (العارف) Shams al-Din Isma'il ibn Sawdakin al-Turi, alerted me to a matter that was verified with me, but not through the aspect he alerted me to. We mentioned it in the Chapter on Letters (باب الحروف) in this book. This is the question of whether the Self-disclosure (التجلي) in the Act (الفعل) is valid or not. At one time, I used to negate it from one perspective, and at another time, I used to affirm it from a perspective necessitated and required by the religious obligation (التكليف). Since the obligation to act cannot come from a Wise, All-Knowing One who says, 'Work and do,' to someone He knows will not work or do, as he has no power over it. Yet the Divine Command to the servant to act is established, such as <<أَقِيمُوا الصَّلاةَ>> (Establish the prayer), <<وآتُوا الزَّكاةَ>> (Give the *Zakat*), <<واصْبِرُوا وصابِرُوا ورابِطُوا وجاهِدُوا>> (Be patient, persevere, maintain vigilance, and strive). Therefore, there must be a connection for the passive recipient (المنفعل عنه) in relation to the Act, by which he is named an agent (فاعلا) and a worker (عاملا). If this is the case, then the Self-disclosure (التجلي) occurs in him by this measure of relation (النسبة). It was through this path that I used to affirm it, and it is a satisfactory path of utmost clarity, indicating that the originated power (القدرة الحادثة) must necessarily have a relation of connection to what it is obligated to perform. I considered the argument of the opponent to be flimsy, extremely weak, and flawed.\n\nThen one day, this son, Isma'il Abu Sawdakin, discussed this issue with me. He said to me, 'What stronger proof is there for the attribution of the Act to the servant, its addition to him, and the Self-disclosure (التجلي) within him, than the fact that it is one of his attributes, derived from the fact that the Real (الحق) created the human being upon His form (صورته)? If the Act were stripped away from him, it would not be correct for him to be upon His form, nor would he accept the assumption of the character of the Names (التخلق بالأسماء). It is verified with you and with the People of the Path (أهل الطريق), without dispute, that the human being is created upon the Form, and the assumption of the character of the Names is verified.' No one can know the joy that entered me due to this reminder. Indeed, the master (الأستاذ) may benefit from the student things from the Divine bestowals (مواهب الحق تعالى) that Allah did not decree for the master to attain except through that student. Just as we know with certainty that a great person may receive an opening (فتح) concerning a matter about which he is questioned by some common person who has no standing in knowledge or precedence, yet who is sincere in his focus on the knowledge being asked about. The scholar is then provided, at that moment, with the knowledge of that issue due to the sincerity of the questioner—knowledge he did not possess before—a Divine solicitude (عناية) for the questioner. And the Divine solicitude for the questioner included the acquisition of knowledge by the one questioned, which he did not previously have. Whoever monitors his heart will find what we have mentioned. Praise be to Allah, who allowed us to benefit from our children just as our Shaykhs benefited from us concerning matters that were obscure to them.\n\nThis station contains the science of conveying from Allah to His creation—from the Messenger, the Prophet, and the Inheritor (وارث). It contains the science of governance (علم السياسة) in teaching through the door of gentleness (اللطف), such that the seeker does not perceive it. It contains the science of absolute and restricted recompense (الجزاء المطلق والمقيد). The absolute recompense is the servant recompensing his Lord, such as gratitude (الشكر) to the Benefactor. And the recompense of Allah to the servant is the increase (المزيد) in that upon which the servant offered gratitude. The restricted recompense is Allah's reward to the servant in the Hereafter, for it is not an abode of obligation (دار تكليف). The Exalted said: <<وأَوْفُوا بِعَهْدِي>> (And fulfill My covenant) in the place of obligation, which is the world, <<أُوفِ بِعَهْدِكُمْ>> (I will fulfill your covenant) in both abodes, the world and the Hereafter. This much is sufficient for this chapter, if Allah wills. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو چھیانوے: دار آخرت میں اہل سعادت (أهل السعادة) کی صفات کے اہل شقاوت (أهل الشقاء) کی طرف منتقل ہونے کے مقام کی معرفت میں، حضرت موسیٰ (الحضرة الموسوية) کے حضور سے۔\n\nمیں نے سچائی کے مقام کی ایسی منزلوں کو ڈھانپ لیا، جن کے مکین کے دل میں خشوع (خشوع) ہے۔\nاور فنا (الاصطلام) کی آگ اس کا ایندھن ہے، جب سونے والا اس کی چادر چھین لیتا ہے۔\nاور علوم کی غذائیں حرص کو بڑھاتی ہیں، اور ان کی پیاس اور بھوک نہیں جاتی۔\nاور اگر وہ ہستی (الوجود) کو چکھ لے تو بھوک سے مر جائے، اور اسے خزاں یا بہار زندہ کرتی ہے۔\nپیدائش کے ساتھ، پھر سطحوں میں نصب کیا گیا، جسے بلند کرنے والا اس کی رفعت کے لیے ظاہر کرتا ہے۔\nپس جسے تو چاہے بغیر جبر کے علم دے، شاید کسی وقت اس کی واپسی (رجوع) ہو۔\n\nپانچویں شعر میں اللہ تعالیٰ کے اس قول کی طرف اشارہ ہے:\n**أَ فَلا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ وإِلَى السَّماءِ كَيْفَ رُفِعَتْ وإِلَى الْجِبالِ كَيْفَ نُصِبَتْ وإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ**\n(تو کیا وہ اونٹوں کو نہیں دیکھتے کہ وہ کیسے بنائے گئے؟ اور آسمان کو کہ وہ کیسے بلند کیا گیا؟ اور پہاڑوں کو کہ وہ کیسے گاڑے گئے؟ اور زمین کو کہ وہ کیسے بچھائی گئی؟)\nاس سے مراد ان چیزوں میں غور و فکر (الاعتبار) کرنا ہے۔\n\n### [کہ جنت کے درجات دوزخ کے درکات کی تعداد کے مطابق ہیں]\n\nجان لو، اللہ ہمیں اور تمہیں توفیق دے، کہ جنت کے درجات دوزخ کے درکات کی تعداد کے مطابق ہیں۔ کوئی درجہ ایسا نہیں جس کے مقابل دوزخ کا کوئی درک نہ ہو۔ یہ اس لیے ہے کہ امر (حکم) اور نہی (ممانعت) کے معاملے میں انسان یا تو حکم پر عمل کرتا ہے یا عمل نہیں کرتا۔ اگر وہ عمل کرتا ہے تو اس کے لیے جنت میں ایک مخصوص درجہ ہوتا ہے جو خاص اسی عمل کے لیے مقرر ہوتا ہے۔ اور اس خاص عمل کے لیے مخصوص اس درجے کے مقابلے میں، جب انسان اسے چھوڑ دیتا ہے، تو دوزخ میں ایک درک ہوتا ہے۔ اگر اس درجے سے جنت میں کوئی کنکری گرے تو وہ دوزخ کے اس درک میں خط استوا (سواء) پر گرے گی۔ پس جب انسان مامور بہ (جس کا حکم دیا گیا) عمل کو چھوڑ دیتا ہے اور عمل نہیں کرتا تو اس عمل کا ترک کرنا ہی بعینہٖ اس کا اس درک میں گرنا ہے۔ اللہ تعالیٰ فرماتا ہے:\n**فَاطَّلَعَ فَرَآهُ في سَواءِ الْجَحِيمِ**\n(پھر وہ جھانکے گا تو اسے دوزخ کے عین وسط میں دیکھے گا)۔\nاطلاع (جھانکنا) اوپر سے نیچے کی طرف کسی چیز کو دیکھنا ہے، اور سواء (سواء) اعتدال پر موازنے کی حد ہے۔ پس اس نے اسے صرف اسی درک میں دیکھا جو اس کے درجے کے موازنے میں تھا۔ کیونکہ جس عمل کے ذریعے اس شخص نے وہ درجہ حاصل کیا تھا، دوسرے شخص نے، جو دنیا میں اس کا ساتھی تھا، بعینہٖ وہی عمل چھوڑ دیا تھا۔ پس دیکھو یہ عدلِ الٰہی کتنا حسین ہے! یہ وہی دو آدمی ہیں جن کا ذکر اللہ نے سورۃ الکہف میں مثال کے طور پر بیان کیا ہے، اور وہ اللہ کا یہ قول ہے:\n**واضْرِبْ لَهُمْ مَثَلًا رَجُلَيْنِ**\n(اور ان کے لیے دو آدمیوں کی مثال بیان کرو)۔\n...آیات کے آخر تک ان کے دنیا کے قصے میں۔ اور سورۃ الصافات میں آخرت میں ان کی گفتگو کا ذکر کیا ہے، اللہ کے اس قول میں:\n**قالَ قائِلٌ مِنْهُمْ إِنِّي كانَ لِي قَرِينٌ يَقُولُ أَ إِنَّكَ لَمِنَ الْمُصَدِّقِينَ**\n(ان میں سے ایک کہنے والا کہے گا: میرا ایک ساتھی تھا جو کہتا تھا: کیا تم واقعی تصدیق کرنے والوں میں سے ہو؟)\nاور اس میں ملامت کا ذکر ہے، اور اس کے اس قول میں:\n**تَاللَّهِ إِنْ كِدْتَ لَتُرْدِينِ**\n(اللہ کی قسم! قریب تھا کہ تو مجھے ہلاک کر دیتا)۔\nجب اس نے جھانکا تو اسے دوزخ کے عین وسط میں دیکھا، اور یہ اس کا قول تھا:\n**ما أَظُنُّ السَّاعَةَ قائِمَةً**\n(میں نہیں سمجھتا کہ قیامت قائم ہونے والی ہے)۔\nاور صحیح الٰہی اخبار میں رسول اللہ صلی اللہ علیہ وسلم سے ان کے رب عزوجل کے بارے میں وارد ہوا ہے کہ وہ قیامت کے دن اپنے بندے سے فرمائیں گے: کیا تو نے گمان کیا تھا کہ تو مجھ سے ملنے والا ہے؟\n\nتو ہم تمہارے لیے ان بنیادی امور کی مثال دیتے ہیں جن پر اسلام کی بنیاد رکھی گئی ہے، اور وہ پانچ ہیں: لا إله إلا الله، نماز قائم کرنا، زکوٰۃ دینا، رمضان کے روزے رکھنا، اور\n**حِجُّ الْبَيْتِ من اسْتَطاعَ إِلَيْهِ سَبِيلًا**\n(بیت اللہ کا حج کرنا، جو اس تک پہنچنے کی استطاعت رکھتا ہو)۔\nپس لوگوں میں سے کچھ وہ ہیں جو ان سب پر ایمان لائے اور سعادت مند ہوئے، اور کچھ وہ ہیں جنہوں نے ان سب کا انکار کیا اور شقی (بدبخت) ہوئے، اور کچھ وہ ہیں جو بعض پر ایمان لائے اور بعض کا انکار کیا، تو وہ حق کے طور پر کافر کے ساتھ ملحق ہیں۔ اور اسی طرح تمام اوامر (احکام) اور نواہی (ممنوعات) جو شریعت کی فروع (ذیلی احکام) تقاضا کرتی ہیں، انسان کی تمام حرکات و سکنات میں، ان میں مشروع حکم پر ایمان لانے اور کفر کرنے میں، اور مکلف انسان کے ظاہر اور باطن کے ساتھ مشروع عمل کرنے اور عمل کو ترک کرنے میں۔ اور یہ سب عقد (دل میں باندھنا)، قول (زبان سے کہنا) اور عمل (کرنا) میں محدود ہوتا ہے، اور اس کے مقابلے میں حل (عقد کو کھولنا)، صمت (خاموشی) اور عمل کو ترک کرنا ہے۔ یہ ایک قوم کے حق میں ایک پہلو سے مقابلہ ہے، اور دوسری قوم کے حق میں دوسرا مقابلہ ہے، یا بعینہٖ اسی شخص کے حق میں، اور وہ ایک عقد کا دوسرے عقد کے مخالف ہونا، ایک قول کا دوسرے قول کے مخالف ہونا، اور ایک عمل کا دوسرے عمل کے مخالف ہونا ہے۔ کیونکہ حل (عقد کو کھولنے) والے کے لیے یہ لازم نہیں کہ اس نے کوئی دوسرا امر باندھا (عقد کیا) ہو۔ حل کا تعلق تو صرف اس ایمانی عقد سے ہوتا ہے جو اس معقود علیہ (جس پر عقد کیا گیا) سے متعلق تھا، پس معطل (ترک کرنے والے) نے اسے ساقط کر دیا اور کسی دوسرے عقد سے منسلک نہیں ہوا۔ اور دوسرا شخص وہ ہے جس نے اللہ کے لیے شریک کے وجود پر عقد کیا، تو اس نے توحید کی رسی کا عقد اپنی گردن سے کھول دیا اور شرک کی رسی کا عقد باندھ لیا۔ اسی لیے ہم نے اس امر کو اس طرح تفصیل سے بیان کیا ہے جیسا کہ دار آخرت میں ہو گا، جو دنیا کی حالت کے موازنے میں ہے۔ اور یہ بنیادی امور میں شکل کی صورت ہے، اور اسی پر ہم تمام مامور بہ (حکم کردہ) اور منہی عنہ (منع کردہ) کو لیتے ہیں، خواہ وہ مامور بہ پر عمل کرنا ہو، یا اس کا قول کرنا ہو، یا اس پر ایمان لانا ہو، اور اس کا ترک کرنا ہو، خواہ وہ کلی طور پر ہو یا جزوی طور پر، حل (کھولنے) اور عقد (باندھنے) کے ذریعے ہو۔ اور اسی طرح منہی عنہ (منع کردہ) کے ساتھ عمل کرنا، اس کا قول کرنا، اور اس پر عقد کرنا، اور اس کا ترک کرنا، خواہ وہ کلی طور پر ہو یا جزوی طور پر، حل اور عقد کے ذریعے ہو۔ یہ جنت کے درجات اور دوزخ کے درکات کی صورت ہے، اور اعراف (الأعراف) کی بھی، جو وہ دیوار ہے جس کا\n**باطِنُهُ فِيهِ الرَّحْمَةُ وظاهِرُهُ من قِبَلِهِ الْعَذابُ**\n(جس کے اندر کی طرف رحمت ہے اور باہر کی طرف عذاب ہے)۔\nاور نازل ہونے والے اور صعود کرنے والے رقائق (لطیف حقائق) ہم نے تمہارے لیے رکھ دیے ہیں تاکہ تم انہیں اپنے ذہن میں تصور کر سکو، اگر تمہاری فہم کمزور ہو۔ اور اللہ ہی مددگار ہے، اس کے سوا کوئی رب نہیں۔ اور اسی طرح امر (حکم) اور نہی (ممانعت) پر عمل کرنے کے درجات، اور ان پر عمل کو ترک کرنے کے درکات، اور امر و نہی کا قول کرنے کے درجات، اور ان دونوں کو عقد اور حل کے ذریعے ترک کرنے کے درکات، خواہ کلی طور پر ہو یا جزوی طور پر۔ اور اسی طرح جزا کی تمام مناسبتیں کبھی بھی بگڑتی نہیں ہیں۔ اللہ عزوجل نے فرمایا:\n**ومَكَرُوا ومَكَرَ الله**\n(اور انہوں نے مکر کیا اور اللہ نے بھی مکر کیا)۔\nاور فرمایا:\n**قالُوا (إِنَّا مَعَكُمْ) إِنَّما نَحْنُ مُسْتَهْزِؤُنَ الله يَسْتَهْزِئُ بِهِمْ**\n(انہوں نے کہا: ہم تمہارے ساتھ ہیں، ہم تو صرف مذاق کر رہے ہیں۔ اللہ ان سے مذاق کرتا ہے)۔\nاور فرمایا:\n**إِنْ تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ**\n(اگر تم ہم سے مذاق کرتے ہو تو ہم بھی تم سے مذاق کرتے ہیں جیسا کہ تم مذاق کرتے ہو)۔\nاور اللہ تعالیٰ نے فرمایا:\n**إِنَّ الَّذِينَ أَجْرَمُوا كانُوا من الَّذِينَ آمَنُوا يَضْحَكُونَ**\n(بے شک جو لوگ مجرم تھے وہ ایمان والوں پر ہنسا کرتے تھے)۔\nاور جزا میں فرمایا:\n**فَالْيَوْمَ الَّذِينَ آمَنُوا من الْكُفَّارِ يَضْحَكُونَ**\n(پس آج ایمان والے کافروں پر ہنسیں گے)۔\nپھر وضاحت کرتے ہوئے فرمایا:\n**هَلْ ثُوِّبَ الْكُفَّارُ ما كانُوا يَفْعَلُونَ**\n(کیا کافروں کو ان کے کیے کا بدلہ مل گیا؟)\nپس الف لام کے ذریعے عمومیت پیدا کی اور فعل کو ان کی طرف لوٹا دیا۔ اور اللہ تعالیٰ نے فرمایا:\n**نَسُوا الله فَنَسِيَهُمْ**\n(انہوں نے اللہ کو بھلا دیا تو اللہ نے انہیں بھلا دیا)۔\nاور اسی لیے اسے جَزاءً وِفاقاً (مطابق بدلہ) کہا گیا ہے۔ اگر معاملہ ایسا نہ ہوتا تو یہ جزا نہ ہوتی۔ اور متکبرین کے بارے میں وارد ہوا ہے کہ وہ چیونٹیوں کی مانند حشر کیے جائیں گے، جنہیں لوگ اپنے قدموں تلے روندیں گے۔\n\nیہ ان کے لیے ذلت اور حقارت ہے، اور اللہ کے احکام پر ان کے تکبر کی وجہ سے ہے۔ پس جنت خیر ہے جس میں کوئی شر نہیں، اور دوزخ شر ہے جس میں کوئی خیر نہیں۔ لہٰذا مشرک کا تمام علم، عمل اور قول، جس پر اگر وہ موحد ہوتا تو جنت میں اس کے مطابق جزا دی جاتی، وہ جزا اس موحد کو دی جاتی ہے جو اس امر اور علم سے جاہل ہو، اس عمل میں کوتاہی کرنے والا ہو، اور اس قول کو ترک کرنے والا ہو۔ اور وہ جزا جو اس پر ہوتی، جو اگر وہ مشرک ہوتا تو اسے دوزخ میں حاصل ہوتی، وہ اس مشرک کو دی جاتی ہے جس کا جنت میں کوئی حصہ نہیں۔ پس جب مشرک وہ چیز دیکھے گا جس کا وہ مستحق ہوتا اگر وہ سعید ہوتا، تو وہ کہے گا: اے رب! یہ میرا ہے، تو میرے اس عمل کی جزا کہاں ہے جس کی یہ جزا ہے؟ کیونکہ مکارم اخلاق کے اعمال اور ان پر ابھارنا، جو کہ قول ہے، ایک اچھی جزا کا تقاضا کرتا ہے، خواہ وہ کسی سے بھی سرزد ہو۔ تو اللہ اس سے فرمائے گا: جب تو نے ایسا کیا (اور اس کے مکارم اخلاق کے اعمال، ان کا قول اور ان کے مواقع پر عمل کا ذکر کرے گا) تو میں نے تجھے اس پر بدلہ دے دیا جو میں نے تجھ پر فلاں فلاں نعمتیں نازل کیں۔ پس اللہ اس پر وہ تمام نعمتیں مقرر کر دے گا جو اس نے اسے بطور جزا کے دی تھیں، نہ کہ اس کی ابتدائی تخلیق کی نعمتیں جو جزا نہیں ہیں۔ اور مشرک وہاں اس کا وزن کرے گا جو اللہ نے علمِ موازنہ سے ظاہر کیا ہے، تو وہ کہے گا: تو نے سچ فرمایا۔ تو اللہ اس سے فرمائے گا: میں نے تیری جزا میں کوئی کمی نہیں کی، لیکن شرک نے تجھے دارِ کرامت (جنت) میں داخل ہونے سے روک دیا۔ پس تو اس میں ان اعمال کے موازنے پر نازل ہو، لیکن ان اعمال کے درجات پر نازل ہو، کیونکہ اس کا مالک (موحد) توحید کی وجہ سے اس گھر (جنت) کے اہل ہونے سے نہیں روکا گیا۔ پس یہ وہ وراثت ہے جو اہل جنت اور اہل دوزخ کے درمیان ہے۔ اور ہم اس کتاب کے باب الجنة والنار میں اس فصل میں کلام کا ذکر کریں گے۔ پس یہی وہ انتقال (انتقال) ہے جو اہل سعادت (أهل السعادة) اور اہل شقاوت (أهل الشقاء) کے درمیان ہے۔ کیونکہ مومن یہاں (دنیا میں) عبادت میں ہے، اور عبادت اسے خشوع (خشوع) اور ذلت دیتی ہے، اور کافر عزت اور خوشی میں ہے۔ پس جب قیامت کا دن ہو گا تو کافر کی عزت، سرور اور خوشی مومن پر منتقل کر دی جائے گی، اور مومن کی ذلت اور خشوع (خشوع)، جو دنیا میں اس کی عبادت کا لباس تھا، قیامت کے دن کافر پر منتقل کر دیا جائے گا۔ اللہ تعالیٰ فرماتا ہے:\n**خاشِعِينَ من الذُّلِّ يَنْظُرُونَ من طَرْفٍ خَفِيٍّ**\n(ذلت کی وجہ سے جھکے ہوئے ہوں گے، چھپی ہوئی نگاہ سے دیکھیں گے)۔\nیہ نظر ذلیل شخص کی حالت ہے جو قہر کی وجہ سے اپنا سر نہیں اٹھا سکتا، اور یہ خشوع (خشوع) قیامت کے دن کافر کی طرف سے ہو گا، اور ذلت اور شکستہ نظر جس کی وجہ سے وہ اپنا سر نہیں اٹھا سکتا، وہ صرف اللہ تعالیٰ کے خوف سے ہو گا۔ اور یہ دنیا میں مومن کی حالت تھی، اللہ کے خوف کی وجہ سے۔ پس\n**ذلِكَ يَوْمُ التَّغابُنِ**\n(یہ ہار جیت کا دن ہے)۔\nجہاں انسان اپنی عزت، سرور اور خوشی کی صفت کو دوسرے پر دیکھتا ہے، اور دوسرے کی ذلت، غم اور حزن کو اپنے اوپر دیکھتا ہے۔ پس\n**فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ**\n(پس حکم اللہ ہی کا ہے جو بلند اور بڑا ہے)۔\nاور یہ منزل علوم میں سے حق (الحق) کے اپنے سعید بندوں سے اشقیاء (بدبختوں) کے مراتب کے بارے میں سوال کرنے کے علم کو شامل ہے کہ وہ کس نام سے سوال کرے گا، اور علم المناسبات (مناسبتوں کا علم)، اور وہ علم جو افکار دیتے ہیں، اور علم الکیفیات (کیفیات کا علم)، اور یہ دو قسم کا ہے: ایک قسم وہ ہے جو صرف ذوق (ذوق) سے پہچانی جاتی ہے، اور دوسری قسم وہ ہے جو فکر سے ادراک کی جاتی ہے، اور یہ خطاب میں وسعت کے باب سے ہے نہ کہ تحقق (تحقق) کے باب سے، کیونکہ علم الکیفیات (علم الكيفيات) کا تحقق تو صرف ذوق (ذوق) ہے۔ اور مجھے میرے عزیز بیٹے، عارف شمس الدین اسماعیل بن سودکین التوری نے ایک ایسے امر پر متنبہ کیا جو میرے نزدیک اس پہلو کے علاوہ محقق تھا جس پر اس بیٹے نے ہمیں متنبہ کیا۔ ہم نے اس کا ذکر اس کتاب کے باب الحروف میں کیا ہے، اور وہ یہ ہے کہ کیا فعل میں التجلی (ظہور الٰہی) صحیح ہے یا صحیح نہیں؟ ایک وقت میں میں ایک پہلو سے اس کی نفی کرتا تھا اور ایک وقت میں ایک ایسے پہلو سے اس کا اثبات کرتا تھا جس کا تقاضا تکلیف (شرعی ذمہ داری) کرتی ہے اور اسے طلب کرتی ہے، کیونکہ عمل کی تکلیف کسی حکیم و علیم کی طرف سے نہیں ہو سکتی جو اسے کہے کہ عمل کر اور فعل کر، جس کے بارے میں وہ جانتا ہو کہ وہ نہ عمل کرے گا اور نہ فعل کرے گا، کیونکہ اسے اس پر قدرت نہیں ہے۔ اور بندے کے لیے عمل کا الٰہی حکم ثابت ہے، جیسے:\n**أَقِيمُوا الصَّلاةَ وآتُوا الزَّكاةَ واصْبِرُوا وصابِرُوا ورابِطُوا وجاهِدُوا**\n(نماز قائم کرو، زکوٰۃ دو، صبر کرو، صبر میں ثابت قدم رہو، سرحدوں کی حفاظت کرو، اور جہاد کرو)۔\nپس ضروری ہے کہ منفعل عنہ (جس پر فعل واقع ہو) میں فعل کے لحاظ سے اس کا کوئی تعلق ہو جس کی وجہ سے اسے فاعل اور عامل کہا جائے۔ اور جب یہ بات ہے تو نسبت کے اسی قدر سے اس میں التجلی (التجلی) واقع ہوتا ہے۔ پس میں اسی طریقے سے اس کا اثبات کرتا تھا، اور یہ ایک پسندیدہ اور نہایت واضح طریقہ ہے جو اس بات پر دلالت کرتا ہے کہ حادث قدرت کا اس چیز سے تعلق کی نسبت ہے جس کے عمل کی اسے تکلیف دی گئی ہے، یہ ضروری ہے۔ اور میں نے مخالف کی دلیل کو نہایت کمزور اور بے ربط پایا۔ پھر ایک دن جب مذکورہ بالا بیٹے اسماعیل ابو سودکین نے مجھ سے اس مسئلے پر گفتگو کی تو اس نے مجھ سے کہا: فعل کی بندے کی طرف نسبت، اس کی طرف اضافت اور اس میں التجلی (التجلی) پر اس سے زیادہ قوی دلیل کیا ہو سکتی ہے، جب کہ یہ اس کی صفت میں سے ہے کہ حق (الحق) نے انسان کو اپنی صورت پر پیدا کیا ہے؟ اگر اس سے فعل کو الگ کر دیا جائے تو اس کا اپنی صورت پر ہونا صحیح نہیں ہو گا، اور نہ ہی وہ اسماء (الٰہی ناموں) کے ساتھ تخلق (اخلاق اپنانا) قبول کر سکے گا۔ اور آپ کے نزدیک اور اہل طریق (صوفیاء) کے نزدیک بلا اختلاف یہ صحیح ہے کہ انسان صورت پر مخلوق ہے، اور اسماء کے ساتھ تخلق صحیح ہے۔ پس کوئی نہیں جان سکتا کہ اس تنبیہ سے مجھے کتنی خوشی ہوئی۔\nاستاد بھی شاگرد سے حق تعالیٰ کی عطا کردہ ایسی چیزیں حاصل کر سکتا ہے جو اللہ نے استاد کے لیے مقرر نہیں کی تھیں کہ وہ انہیں اس شاگرد کے علاوہ کسی اور سے حاصل کرے۔ جیسا کہ ہم یقینی طور پر جانتے ہیں کہ کسی بڑے عالم پر کسی ایسے عام آدمی کے سوال سے کوئی امر منکشف ہو جاتا ہے جس کی علم میں کوئی قدر و منزلت نہیں ہوتی، لیکن وہ اس مطلوبہ علم میں سچا متوجہ ہوتا ہے، تو سائل کی سچائی کی وجہ سے عالم کو اس وقت اس مسئلے کا علم عطا کر دیا جاتا ہے، جو اس کے پاس پہلے نہیں تھا۔ یہ اللہ کی طرف سے سائل پر عنایت ہوتی ہے، اور اللہ کی سائل پر عنایت میں یہ بات شامل ہوتی ہے کہ مسئول (جس سے سوال کیا گیا) کو ایسا علم حاصل ہو جائے جو اس کے پاس نہیں تھا۔ اور جو شخص اپنے دل کی نگرانی کرتا ہے وہ ہماری بیان کردہ بات کو پائے گا۔ پس تمام تعریفیں اس اللہ کے لیے ہیں جس نے ہمیں اپنے بیٹوں سے وہی فائدہ پہنچایا جو ہمارے شیوخ نے ہم سے حاصل کیا تھا، ایسے امور میں جو ان کے لیے مشکل تھے۔\nاور یہ منزل اللہ کی طرف سے اس کی مخلوق تک رسول، نبی اور وارث کے ذریعے تبلیغ کے علم کو شامل ہے، اور یہ تعلیم میں لطف کے باب سے سیاست کے علم کو شامل ہے، اس طرح کہ مطلوب کو اس کا شعور بھی نہ ہو۔ اور یہ جزا مطلق اور جزا مقید کے علم کو شامل ہے۔ جزا مطلق بندے کا اپنے رب کو بدلہ دینا ہے، جیسے منعم (نعمت دینے والے) کا شکر ادا کرنا، اور اللہ کا بندے کو بدلہ دینا ہے، جیسے بندے کی طرف سے شکر واقع ہونے پر مزید عطا کرنا۔ اور جزا مقید اللہ کا بندے کو دار آخرت میں بدلہ دینا ہے، کیونکہ وہ دارِ تکلیف (شرعی ذمہ داری) نہیں ہے۔ اللہ تعالیٰ نے فرمایا:\n**وأَوْفُوا بِعَهْدِي**\n(اور میرے عہد کو پورا کرو)۔\nیہ تکلیف کی جگہ (دنیا) میں ہے،\n**أُوفِ بِعَهْدِكُمْ**\n(میں تمہارے عہد کو پورا کروں گا)۔\nیہ دونوں جہانوں میں ہے، دنیا اور آخرت میں۔ اور یہ مقدار اس باب میں کافی ہے، ان شاء اللہ تعالیٰ۔\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏**\n(اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "باب دویست و نود و ششم: در معرفت منزل انتقال صفات اهل سعادت به اهل شقاوت در سرای آخرت، از حضرت موسوی.\n\nمنازلی را درنوردیدم که جایگاه صدق‌اند، و در قلب کسی که در آن فرود می‌آید، خشوعی است.\nو آتش استیصال (اصطلام) سوخت آن است، آنگاه که هم‌بستر، جامه‌اش را برباید.\nو خوراک‌های علوم، حرص را می‌افزایند، و تشنگی و گرسنگی آن از بین نمی‌رود.\nو اگر هستی (الوجود) را بچشد، از گرسنگی می‌میرد، و پاییز یا بهار او را زنده می‌کند.\nبه آفرینشی و سپس استوار شدن بر سطوحی، که بلندمرتبه آن را به خاطر رفعتشان تجلی می‌دهد.\nپس هر که را خواهی بدون قهر آگاه کن، شاید زمانی برای او بازگشتی باشد.\n\nدر بیت پنجم، مرادش این سخن خداوند متعال است: «آیا به شتر نمی‌نگرند که چگونه آفریده شده است؟ و به آسمان که چگونه برافراشته شده است؟ و به کوه‌ها که چگونه استوار گشته‌اند؟ و به زمین که چگونه گسترده شده است؟» (أَ فَلا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ وإِلَى السَّماءِ كَيْفَ رُفِعَتْ وإِلَى الْجِبالِ كَيْفَ نُصِبَتْ وإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ). او در این امر، عبرت گرفتن را اراده کرده است.\n\n### [اینکه درجات بهشت به تعداد درکات دوزخ است]\n\nبدان – خداوند ما و شما را توفیق دهد – که درجات بهشت به تعداد درکات دوزخ است؛ هیچ درجه‌ای نیست مگر اینکه درکی از آتش در مقابل آن قرار دارد. این بدان سبب است که انسان در مورد امر و نهی، یا به امر عمل می‌کند یا عمل نمی‌کند. اگر به آن عمل کند، درجه‌ای معین در بهشت به طور خاص برای آن عمل خواهد داشت. و در موازات این درجه مخصوص برای این عمل خاص، اگر انسان آن را ترک کند، درکی در آتش وجود دارد؛ به طوری که اگر سنگی از آن درجه در بهشت سقوط کند، دقیقاً بر خط استوای آن درک از آتش فرود می‌آید. پس اگر انسان از عمل به آنچه امر شده است سقوط کند و عمل نکند، آن ترک عمل، عین سقوط او به آن درک است. خداوند متعال می‌فرماید: «پس نگاهی انداخت و او را در میان دوزخ دید» (فَاطَّلَعَ فَرَآهُ في سَواءِ الْجَحِيمِ). «اطلاع» (نگاه انداختن) به چیزی از بالا به پایین است، و «سواء» (میان) حد موازنه بر اعتدال است. پس او را ندید مگر در همان درکی که در موازات درجه‌اش قرار داشت؛ زیرا عملی که آن شخص به واسطه آن به آن درجه رسیده بود، عیناً توسط این شخص دیگر که قرین او در دنیا بود، ترک شده است. پس بنگر به این عدل الهی ما أحسنه (چه نیکوست). این دو همان مردانی هستند که خداوند در سوره کهف از آن‌ها یاد کرده و مثَل آن‌ها را زده است، و آن سخن خداوند متعال است: «و برایشان مثَل دو مرد را بزن» (واضْرِبْ لَهُمْ مَثَلًا رَجُلَيْنِ) تا آخر آیات در داستان آن‌ها در دنیا. و در سوره صافات، سخن آن‌ها را در آخرت ذکر کرده است در این سخن خداوند متعال: «گوینده‌ای از میان آن‌ها می‌گوید: من قرینی داشتم که می‌گفت: آیا تو واقعاً از تصدیق‌کنندگان هستی؟» (قالَ قائِلٌ مِنْهُمْ إِنِّي كانَ لِي قَرِينٌ يَقُولُ أَ إِنَّكَ لَمِنَ الْمُصَدِّقِينَ). و در آن، ذکر سرزنش آمده است در این سخن: «به خدا سوگند، نزدیک بود مرا به هلاکت اندازی» (تَاللَّهِ إِنْ كِدْتَ لَتُرْدِينِ) هنگامی که بر او نگاه انداخت و او را در میان دوزخ دید (فَرَآهُ في سَواءِ الْجَحِيمِ)، و آن همان سخن اوست: «گمان نمی‌کنم که قیامت برپا شود» (ما أَظُنُّ السَّاعَةَ قائِمَةً). و در اخبار صحیح الهی از رسول خدا (صلی الله علیه و سلم) از پروردگار عزوجلش وارد شده است در آنچه روز قیامت به بنده‌اش می‌گوید: «آیا گمان کردی که مرا ملاقات خواهی کرد؟» (أ فظننت إنك ملاقي).\n\nپس برای تو از میان آن‌ها، امهات (اصول) پنج‌گانه‌ای را که اسلام بر آن‌ها بنا شده است، مثال می‌زنیم: «لا إله إلا الله» (هیچ معبودی جز خدا نیست)، برپاداشتن نماز، دادن زکات، روزه رمضان، و «حج خانه خدا برای کسی که توانایی رفتن به آن را دارد» (حِجُّ الْبَيْتِ من اسْتَطاعَ إِلَيْهِ سَبِيلًا). برخی از مردم به همه آن‌ها ایمان آوردند و سعادتمند شدند، و برخی به همه آن‌ها کفر ورزیدند و شقاوتمند شدند، و برخی به بعضی از آن‌ها ایمان آوردند و به بعضی کفر ورزیدند، که او به حق به کافر ملحق می‌شود. و همین‌طور است همه اوامر و نواهی که فروع شریعت در تمام حرکات و سکنات انسان مکلّف اقتضا می‌کنند، چه در ایمان به حکم مشروع در آن‌ها و چه در کفر، و چه در عمل مشروع در آن‌ها با ظاهر و باطن انسان مکلّف، و چه در ترک عمل. و این امر در «عقد» (اعتقاد قلبی)، «قول» (گفتار) و «عمل» خلاصه می‌شود. و در مقابل آن، «حل» (گسستن اعتقاد)، «صمت» (سکوت/ترک قول) و «ترک عمل» قرار دارد. این مقابله‌ای است از یک جهت در حق قومی، و مقابله‌ای دیگر در حق قومی دیگر، یا در حق همین شخص به عینه‌؛ و آن عبارت است از عقدی مخالف عقد، و قولی مخالف قول، و عملی مخالف عمل. زیرا لازم نیست کسی که «حل» (گسستن) کرده است، امر دیگری را «عقد» (اعتقاد) کرده باشد؛ چرا که «حل» تنها به آن عقد ایمانی که به آن معقودٌعلیه تعلق دارد، مربوط است. پس معطّل (کسی که تعطیل کرده) آن را ساقط کرده و به عقد دیگری مرتبط نشده است. و شخص دیگری بر وجود شریک برای خدا عقد بسته است، پس عقد ریسمان توحید را از گردن خود گشوده و ریسمان شرک را بسته است. به همین دلیل، ما امر را بر آنچه در سرای آخرت خواهد بود، به گونه‌ای که موازن حالت دنیا باشد، تفصیل دادیم. و این صورت شکل در امهات (اصول) است، و بر اساس آن، همه مأمورٌبها و منهیٌ‌عنها را در نظر می‌گیریم: از عمل به مأمورٌبه، و قول به آن، و ایمان به آن، و ترک آن به صورت «حل» و «عقد» در کل یا در بعض. و همچنین منهیٌ‌عنها را از عمل به آن، و قول به آن، و عقد بر آن، و ترک آن به صورت «حل» و «عقد» برای کل و بعض. این صورت درجات بهشت و درکات دوزخ و اعراف است، که آن دیواری است که «باطن آن رحمت است و ظاهرش از سوی آن عذاب است» (باطِنُهُ فِيهِ الرَّحْمَةُ وظاهِرُهُ من قِبَلِهِ الْعَذابُ). و ما این لطایف (رقائق) نازل و صاعد را برای تو قرار دادیم تا اگر کندفهم هستی، آن را در ذهن خود تصور کنی. و خداوند یاری‌دهنده است و پروردگاری جز او نیست. و همچنین است درجات عمل به امر و نهی، و درک ترک عمل به آن دو، و درجات قول به امر و نهی، و درک ترک آن دو به صورت عقد و حل، چه به طور کلی و چه جزئی. و همچنین مناسبات جزا همگی مختل نمی‌شوند. خداوند عزوجل می‌فرماید: «و مکر کردند و خدا نیز مکر کرد» (ومَكَرُوا ومَكَرَ الله). و فرمود: «گفتند: ما با شماییم، ما فقط مسخره‌کنندگانیم. خدا آن‌ها را مسخره می‌کند» (قالُوا إِنَّا مَعَكُمْ إِنَّما نَحْنُ مُسْتَهْزِؤُنَ الله يَسْتَهْزِئُ بِهِمْ). و فرمود: «اگر ما را مسخره می‌کنید، ما نیز شما را مسخره خواهیم کرد، همان‌گونه که شما مسخره می‌کنید» (إِنْ تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ). و خداوند متعال می‌فرماید: «همانا کسانی که مرتکب جرم شدند، بر کسانی که ایمان آورده بودند می‌خندیدند» (إِنَّ الَّذِينَ أَجْرَمُوا كانُوا من الَّذِينَ آمَنُوا يَضْحَكُونَ). و در مورد جزا فرمود: «پس امروز کسانی که ایمان آورده‌اند، بر کافران می‌خندند» (فَالْيَوْمَ الَّذِينَ آمَنُوا من الْكُفَّارِ يَضْحَكُونَ). سپس توضیح داد و فرمود: «آیا کافران به سزای آنچه می‌کردند رسیدند؟» (هَلْ ثُوِّبَ الْكُفَّارُ ما كانُوا يَفْعَلُونَ). پس با الف و لام عمومیت داد و فعل را به خودشان بازگرداند. و خداوند متعال می‌فرماید: «خدا را فراموش کردند، پس خدا نیز آن‌ها را فراموش کرد» (نَسُوا الله فَنَسِيَهُمْ). و به همین دلیل، این جزا «جزای موافق» (جَزاءً وِفاقاً) نامیده شده است؛ و اگر امر چنین نبود، جزا محسوب نمی‌شد. و در مورد متکبران وارد شده است که آن‌ها مانند مورچگان ریز محشور می‌شوند و مردم با پاهای خود آن‌ها را لگدمال می‌کنند.\n\nاین [لگدمال شدن] برای خردی و خواری آن‌هاست و به دلیل تکبرشان بر اوامر الهی. پس بهشت خیر است و شری در آن نیست، و دوزخ شر است و خیری در آن نیست. تمام علم و عمل و قول مشرک که اگر موحد بود، به تناسب آن در بهشت پاداش داده می‌شد، به موحدی داده می‌شود که نسبت به آن امر و علم جاهل بوده، در آن عمل کوتاهی کرده و آن قول را ترک نموده است. و جزای آن [عمل] که اگر موحد بود در آتش به او می‌رسید، به آن مشرکی داده می‌شود که بهره‌ای در بهشت ندارد. پس هنگامی که مشرک آنچه را که اگر سعادتمند بود مستحقش می‌شد، می‌بیند، می‌گوید: پروردگارا، این برای من است، پس جزای عمل من که این پاداش آن است کجاست؟ زیرا اعمال مبتنی بر مکارم اخلاق و تشویق به آن‌ها که همان قول است، مستلزم جزای نیکویی است که از هر کس سر زده باشد. پس خداوند به او می‌گوید: هنگامی که فلان کار را انجام دادی – و آنچه از مکارم اخلاق و گفتار به آن و عمل به مواضع آن انجام داده است را برایش ذکر می‌کند – تو را بر آن پاداش دادم به آنچه از فلان و فلان نعمت بر تو ارزانی داشتم. پس تمام آنچه را که به عنوان جزا بر او انعام کرده است، نه به عنوان نعمتی که در آفرینش ابتدایی‌اش بوده و جزا نیست، بر او مقرر می‌دارد. و مشرک در آنجا آن را با آنچه خداوند از علم موازنه برایش کشف کرده است، می‌سنجد و می‌گوید: راست گفتی. پس خداوند به او می‌گوید: من چیزی از جزای تو نکاستم، و شرک تو را از ورود به سرای کرامت بازداشت. پس [تو ای موحد] در آن [بهشت] بر موازنه این اعمال فرود می‌آیی، اما بر درجات آن اعمال فرود می‌آیی؛ زیرا توحید، صاحب آن [درجات] را از اهل این سرا بودن بازداشته است. پس این از میراثی است که میان اهل بهشت و اهل دوزخ وجود دارد، و ما سخن در این فصل را در باب بهشت و دوزخ همین کتاب ذکر خواهیم کرد. پس این همان انتقال (انتقال صفات) است که میان اهل سعادت و اهل شقاوت رخ می‌دهد. زیرا مؤمن در دنیا در حال عبادت است و عبادت به او خشوع و خواری می‌بخشد، و کافر در عزت و شادی است. پس در آن روز، عزت و سرور و شادی کافر بر مؤمن خلع می‌شود، و خواری و خشوع مؤمن که لباس او در عبادتش در دنیا بود، در روز قیامت بر کافر خلع می‌شود. خداوند متعال می‌فرماید: «در حالی که از خواری، خاشع‌اند و از گوشه چشم پنهانی می‌نگرند» (خاشِعِينَ من الذُّلِّ يَنْظُرُونَ من طَرْفٍ خَفِيٍّ). این نگاه، حال شخص ذلیل است که از شدت قهر نمی‌تواند سرش را بالا ببرد. و آن خشوع و خواری کافر در روز قیامت و نگاه شکسته که به سبب آن سرش را بالا نمی‌برد، تنها از ترس خداوند متعال است، و این حال مؤمن در دنیا به دلیل ترسش از خدا بود. پس «آن روز، روز تغابن (زیانکاری متقابل) است» (ذلِكَ يَوْمُ التَّغابُنِ)، آنجا که انسان صفت عزت و سرور و شادی خود را بر دیگری می‌بیند، و خواری و غم و اندوه دیگری را بر خود می‌بیند. پس «حکم از آن خداوند بلندمرتبه بزرگ است» (فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ). این منزل از علوم، شامل علم سؤال حق (الحق) از بندگان سعادتمندش درباره مراتب اشقیا، با چه نامی سؤال می‌کند، و علم مناسبات، و علم آنچه افکار می‌بخشند، و علم کیفیات است. و این [علم کیفیات] بر دو نوع است: نوعی از آن جز با ذوق (تجربه عرفانی) شناخته نمی‌شود، و نوعی دیگر با فکر درک می‌شود، که این از باب توسعه در خطاب است نه از باب تحقق (تحقق عرفانی)؛ زیرا تحقق به علم کیفیات تنها ذوق است. و فرزند عزیز و عارفم، شمس‌الدین اسماعیل بن سودکین التوری، مرا بر امری آگاه ساخت که نزد من محقق بود، اما نه از آن وجهی که این فرزند ما را بر آن آگاه ساخت. ما آن را در باب حروف همین کتاب ذکر کرده‌ایم، و آن این است که آیا تجلی (التجلی) در فعل صحیح است یا خیر؟ گاهی آن را به وجهی نفی می‌کردم و گاهی به وجهی اثبات می‌کردم که تکلیف آن را اقتضا و طلب می‌کرد؛ زیرا تکلیف به عمل نمی‌تواند از حکیم دانایی باشد که به کسی که می‌داند عمل نمی‌کند و انجام نمی‌دهد، بگوید: «عمل کن و انجام بده»، چرا که او قدرتی بر آن ندارد. و امر الهی به عمل برای بنده ثابت شده است، مانند: «نماز را برپا دارید» (أَقِيمُوا الصَّلاةَ)، «زکات بدهید» (وآتُوا الزَّكاةَ)، «صبر کنید» (واصْبِرُوا)، «پایداری کنید» (وصابِرُوا)، «مرزبانی کنید» (ورابِطُوا)، و «جهاد کنید» (وجاهِدُوا). پس ناگزیر باید برای او در مورد آنچه فعل از آن صادر می‌شود، تعلقی از حیث فعل در آن وجود داشته باشد که به واسطه آن فاعل و عامل نامیده شود. و اگر چنین باشد، پس به همین مقدار از نسبت، تجلی (التجلی) در آن واقع می‌شود. من از این طریق آن را اثبات می‌کردم، و این راهی پسندیده و در نهایت وضوح است که دلالت می‌کند قدرت حادثه (مخلوق) ناگزیر نسبتی از تعلق به آنچه مکلف به انجام آن شده است، دارد. و من دلیل مخالف را بسیار سست و ضعیف و مختل می‌دیدم. تا اینکه روزی این فرزندم، اسماعیل ابوسودکین مذکور، با من در این مسئله به گفتگو پرداخت و به من گفت: «چه دلیلی قوی‌تر از این بر نسبت فعل به بنده و اضافه آن به او و تجلی (التجلی) در آن وجود دارد، در حالی که از صفات اوست که حق (الحق) انسان را بر صورت خود آفریده است؟ اگر فعل از او سلب می‌شد، صحیح نبود که بر صورت او باشد و تخلق به اسماء را نمی‌پذیرفت.» و نزد شما و نزد اهل طریقت بلاخلاف صحیح است که انسان مخلوق بر صورت است و تخلق به اسماء صحیح است. هیچ کس نمی‌تواند شادی‌ای را که از این تذکر به من دست داد، درک کند. چه بسا استاد از تلمیذ (شاگرد) چیزهایی را از مواهب حق تعالی (الحق تعالی) بیاموزد که خداوند مقدر نکرده بود استاد آن‌ها را جز از طریق این تلمیذ به دست آورد؛ همان‌طور که قطعاً می‌دانیم گاهی برای انسان بزرگ در امری گشایشی حاصل می‌شود که برخی از عوام که نه قدر و منزلتی در علم دارند و نه سابقه، از او می‌پرسند، و آن عامی در توجه به آن علم مورد سؤال صادق باشد، پس به دلیل صدق سائل، در آن هنگام علم آن مسئله به عالم روزی می‌شود، در حالی که پیش از آن نزد او نبوده است. این از عنایت خداوند به سائل است، و عنایت خداوند به سائل شامل این می‌شود که برای مسئول (عالم) علمی حاصل شود که نزد او نبوده است. و هر کس مراقب قلب خود باشد، آنچه را گفتیم می‌یابد. پس سپاس خدای را که از فرزندانمان بهره بردیم، همان‌طور که شیوخ ما از ما در اموری که برایشان مشکل شده بود، بهره بردند. این منزل شامل علم تبلیغ از جانب خدا به خلقش، از رسول و نبی و وارث، است. و شامل علم سیاست در تعلیم از باب لطف است، به گونه‌ای که مطلوب متوجه آن نشود. و شامل علم جزای مطلق و مقید است. جزای مطلق، پاداش دادن بنده به پروردگارش است، مانند شکر بر نعمت‌دهنده؛ و پاداش دادن خدا به بنده، مانند افزودن بر آنچه بنده شکر کرده است. و جزای مقید، پاداش دادن خدا به بنده در سرای آخرت است، زیرا آنجا سرای تکلیف نیست. خداوند متعال می‌فرماید: «و به عهد من وفا کنید» (وأَوْفُوا بِعَهْدِي) در موطن تکلیف که دنیاست، «تا به عهد شما وفا کنم» (أُوفِ بِعَهْدِكُمْ) در هر دو سرا، دنیا و آخرت. و این مقدار در این باب کافی است، ان‌شاءالله تعالی. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}