{
  "id": 448,
  "title": {
    "ar": "الباب الثامن والأربعون وأربعمائة في معرفة منازلة من كشفت له شيئا مما عندي بهت فكيف يطلب أن يراني هيهات",
    "en": "Chapter Four Hundred and Forty-Eight: Concerning the knowledge of the station of him to whom I unveiled something of what is with Me, and he was bewildered; so how can he seek to see Me? Impossible!",
    "ur": "باب چار سو اڑتالیس، اس شخص کے روحانی منزل کی معرفت (المعرفۃ) میں جس پر میرے پاس موجود (حقائق) میں سے کوئی شے منکشف ہو جائے تو وہ مبہوت ہو جاتا ہے، تو وہ مجھے دیکھنے کا طلبگار کیسے ہو سکتا ہے؟ محال ہے!",
    "fa": "باب چهارصد و چهل و هشتم: در معرفت منزلت کسی که چون چیزی از آنچه نزد من است بر او کشف (کشف) شد، مبهوت گشت؛ پس چگونه طلب می‌کند که مرا ببیند؟ هیهات."
  },
  "content": {
    "ar": "## «الباب الثامن والأربعون وأربعمائة في معرفة منازلة من كشفت له شيئا مما عندي بهت فكيف يطلب أن يراني هيهات»\n\n\n> إذا كان ما عنده حاكم *** علي فكيف بنا إذ نراه‏\n\n\n> فليس يراه سوى عينه *** وهل ثم عين تراه سواه‏\n\n\n> يغالطنا بوجود السوي *** وعين السوي هو عين الإله‏\n\n\n> فإمكاننا لم يزل قائما *** وجودا وفقدا بنا في حماه‏\n\n\n> فلسنا سواه ولا نحن هو *** فعين ضلالتنا من هداه‏\n\n\n### [شمس حق شرقت من المشرق‏]\n\n\nقال الله عز وجل فَبُهِتَ الَّذِي كَفَرَ ولهذا كفر وما كان إلا الشروق والغروب وهو الوجدان والفقد هذه شمس حق شرقت من المشرق ولو لا شروقها ما كان مشرقا ذلك الجناب فَأْتِ بِها من الْمَغْرِبِ وهذا في الحقيقة لو أتى بها أي لو شرقت من المغرب لكان مشرقا فما شرقت إلا من المشرق فبهت الكافر وهو موضع البهت لأنه علم أنه حيث كان الشروق لها اتبعه اسم المشرق فليس للمغرب سبيل في نفس الأمر فما بهت الكافر إلا من عجزه كيف يوصل إلى أفهام الحاضرين مع قصورهم موضع العلم فيما جاء به إبراهيم الخليل عليه السلام فأظلم عليه الأمر وتخبط في نفسه فظهرت حجة إبراهيم الخليل عليه السلام عليه إمام الحاضرين وإنما نسب الكفر إليه بالمسألة الأولى فإنه علم ما أراده الخليل بقوله رَبِّيَ الَّذِي يُحْيِي ويُمِيتُ فستره فسمي كافرا ف قالَ أَنَا أُحْيِي وأُمِيتُ ويقال فيمن أبقى حياة الشخص عليه إذا استحق قتله أن يقال أحياه ولم يكن مراد الخليل إلا ما فهمه نمروذ فعدل إبراهيم إلى ما هو أخفى في نفس الأمر وأبعد وهو أوضح عند الحاضرين فجاء بالمسألة الثانية فَبُهِتَ الَّذِي كَفَرَ في أمر إبراهيم كيف عدل إلى ما هو أخفى في نفس الأمر وأبعد لإقامة الحجة وقامت له الحجة عليه عند قومه فكان بهته في هذا الأمر المعجز الذي أعمى بصائر الحاضرين عن معرفة عدوله من الأوضح إلى الأخفى فحصل من تعجبه وبهته في نفوس الحاضرين عجزه وهو كان المراد ولم يقدر نمروذ على إزالة ما حصل في قلوب العارفين الحاضرين من ذلك فعلم صدقه ولكن الله ما هداه أي ما وفقه للإيمان‏\n\n\nلقوله صَلَّى اللهُ عَليهِ وسَلَّم فإنه عالم بأنه على الحق‏\n\n\nولا يصح بهت إلا في تجلى ما عند الحق وما عند الحق إلا ما أنت عليه فإنه ما يظهر إليك إلا بك فتقر به فيك وتنكر ما أنت به مقر فيه وذلك لجهلك بك وبربك لأنك لو عرفت نفسك عرفت ربك فما ثم إلا خلق وهو ما تراه وتشهده ولو فتشت على دقائق تغيراتك في كل نفس لعلمت أن الحق عين حالك وأنه من حيث هو وراء ذلك كله كما هو عين ذلك كله فالحق خلق وما الخلق حق وإن اختلفت عليه الأسماء أ ليس مما عند الله دك جبل موسى فصعق وهو أعظم من البهت وما أصعقه إلا ما عنده وهو ممن طلب أن يرى ربه فلما علم موسى عليه السلام عند ذلك ما لم يكن يعلم من صورة الحق مع العالم قال تُبْتُ إِلَيْكَ أي لا أطلب رؤيتك على الوجه الذي كنت طلبتها به أولا فإني قد عرفت ما لم أكن أعلمه منك وأَنَا أَوَّلُ الْمُؤْمِنِينَ بقولك لَنْ تَرانِي فإنك ما قلت ذلك إلا لي وهو خبر فلذلك ألحقه بالإيمان لا بالعلم ولو لا ما أراد الايمان بقوله لَنْ تَرانِي ما صحت الأولية فإن المؤمنين كانوا قبله ولكن بهذه الكلمة لم يكن فكل من آمن بعد البهت أو الصعق فقد آمن على بصيرة فهو صاحب علم في إيمان وهذا عزيز الوجود في عباد الله وقليل في أهل الله من يبقى معه الايمان مع العلم فإنه لما انتقل إلى الأوضح وهو العلم فقد انتقل عن إيمانه والكامل هو المؤمن في حال علمه بما هو به مؤمن لا بما كان به مؤمنا فيقال فيه مؤمن عالم بعين واحدة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 448: Concerning the Gnosis of the Station of one to whom something of what is with Me is unveiled, and he is confounded, so how can he seek to see Me? Far be it!\n\nIf what is with him is ruling over me,\nThen how can we be when we see Him?\n\nNone sees Him except His own Eye,\nAnd is there any eye that sees Him other than Him?\n\nHe deceives us with the existence of the other (السوي),\nYet the essence of the other is the very Essence of God (الإله).\n\nOur contingency (إمكاننا) remains perpetually established,\nIn existence and non-existence, through us, within His protection.\n\nWe are not other than Him, nor are we Him,\nThus, the very essence of our straying (ضلالتنا) comes from His guidance (هداه).\n\n[A Sun of Reality Risen from the East]\n\nAllah Almighty said: <<Then the one who disbelieved was confounded>> (Q. 2:258). And for this reason, he disbelieved. Yet, it was nothing but the rising and the setting, which is the finding (الوجدان) and the losing (الفقد). This is a Sun of Reality (شمس حق) that rose from the East (المشرق). Were it not for its rising, that side would not have been the East. <<Then bring it from the West>> (Q. 2:258). In reality, if he had brought it—that is, if it had risen from the West—it would have been the East. But it only rose from the East, so the disbeliever was confounded (بهت).\n\nHe was the locus of confounding because he knew that wherever the rising occurred, the name 'East' followed it. Thus, the West (المغرب) has no path in the matter itself (في نفس الأمر). The disbeliever was confounded only by his inability to convey to the understanding of those present, despite their limitations, the locus of Knowledge (موضع العلم) in what Abraham the Intimate (إبراهيم الخليل) brought. The matter became dark for him, and he became confused within himself. Thus, the argument of Abraham the Intimate became manifest against him before those present.\n\nDisbelief (الكفر) was attributed to him only because of the first question, for he knew what the Intimate intended by his saying: <<My Lord is the One Who gives life and causes death>> (Q. 2:258). But he concealed it, so he was called a disbeliever. So he said: <<I give life and cause death>>. It is said of one who spares the life of a person who deserved execution that he 'gave him life.' The Intimate's intention was nothing other than what Nimrod understood. So, Abraham shifted to what was more hidden in the matter itself and more remote, yet clearer to those present. He came with the second question, and <<the one who disbelieved was confounded>> regarding Abraham's action—how he shifted to what was more hidden and remote in the matter itself in order to establish the proof. And the proof was established against him before his people.\n\nHis confounding (بهته) was in this miraculous matter, which blinded the insights (بصائر) of those present from recognizing his shift from the clearer to the more hidden. Thus, from his astonishment and confounding, his incapacity became manifest in the souls of those present, and this was the intended goal. Nimrod was unable to remove what had settled in the hearts of the gnostics (العارفين) present concerning this, so they knew Abraham's truthfulness. But Allah did not guide him—that is, He did not grant him success (وفقه) for faith (الإيمان)—because of the Prophet’s saying (peace and blessings be upon him): \"For he knows that he is upon the Truth.\"\n\nConfounding (بهت) is only valid in the context of the Theophany (تجلى) of what is with the Real (الحق). And what is with the Real is nothing other than what you are upon, for He does not manifest to you except through you. Thus, you affirm Him within yourself, yet you deny what you affirm Him with therein. This is due to your ignorance of yourself and your Lord, because if you knew yourself, you would know your Lord.\n\nThere is nothing there except Creation (خلق), which is what you see and witness (تشهده). If you were to investigate the subtle details of your changes in every breath, you would know that the Real is the very essence of your state, and that He, from the perspective of His Essence (من حيث هو), is beyond all of that, just as He is the very essence of all of that.\n\nThus, the Real is Creation, and Creation is not the Real, even though the Names (الأسماء) differ upon Him. Was it not from what is with Allah that the mountain of Moses was leveled (دك جبل موسى)? And Moses was struck unconscious (صعق), which is greater than confounding. And nothing struck him unconscious except what was with Him, for he was one of those who sought to see his Lord.\n\nWhen Moses (عليه السلام) then knew what he had not known concerning the form of the Real (صورة الحق) in relation to the Cosmos (العالم), he said: <<I turn in repentance to You>> (Q. 7:143)—meaning, I will not seek Your vision in the manner I first sought it, for I have now known about You what I did not know before—<<and I am the first of the believers>> (Q. 7:143) in Your saying: <<You shall not see Me>> (Q. 7:143). For You only said that to me, and it is a piece of information (خبر). Therefore, he attached it to faith (الإيمان), not to Knowledge (العلم). Were it not for what he intended by faith in His saying, <<You shall not see Me>>, the claim of being 'the first' would not be valid, for believers existed before him, but not with respect to this specific word.\n\nThus, everyone who believes after confounding or being struck unconscious has believed upon insight (بصيرة). He is therefore a possessor of Knowledge within his faith. This is rare in existence (عزيز الوجود) among the servants of Allah, and few among the People of Allah (أهل الله) are those whose faith remains alongside Knowledge. For when one moves to the clearer state, which is Knowledge, he has moved away from his faith. The Perfect One (الكامل) is the believer in the state of his Knowledge of that in which he believes, not of that in which he *was* believing. It is said of him that he is a believer who is knowing (عالم) with a single eye. And Allah <<speaks the Truth, and He guides to the Way>> (Q. 33:4).",
    "ur": "باب نمبر ۴۴۸: اس شخص کے مقام کی معرفت میں جس پر میرے پاس کی کسی چیز کا کشف (الکشف) ہوا تو وہ مبہوت ہو گیا، تو وہ کیسے مجھ سے ملنے کا مطالبہ کر سکتا ہے؟ ناممکن! (ہيهات)\n\nاگر جو کچھ اس کے پاس ہے وہ مجھ پر حاکم ہے،\nتو جب ہم اسے دیکھیں گے تو ہمارا کیا حال ہو گا؟\n\nاسے اس کی اپنی آنکھ کے سوا کوئی نہیں دیکھتا،\nاور کیا وہاں کوئی آنکھ ہے جو اسے اس کے سوا دیکھتی ہو؟\n\nوہ ہمیں غیر (السوی) کے وجود (الوجود) سے مغالطہ دیتا ہے،\nحالانکہ غیر (السوی) کی حقیقت (عین) ہی ذات حق (الإله) کی حقیقت (عین) ہے۔\n\nپس ہمارا امکان ہمیشہ سے قائم ہے،\nوجود (الوجود) اور فقدان (عدم) کی صورت میں، اس کی پناہ میں۔\n\nپس نہ ہم اس کے غیر ہیں اور نہ ہم وہ ہیں،\nتو ہماری گمراہی کی حقیقت (عین) ہی اس کی ہدایت سے ہے۔\n\n[حق کا وہ سورج جو مشرق سے طلوع ہوا]\n\nاللہ عز و جل نے فرمایا: \"پس وہ کافر مبہوت ہو گیا (فَبُهِتَ الَّذِي كَفَرَ)\" (البقرۃ: ۲۵۸)۔ اور اسی وجہ سے اس نے کفر کیا، حالانکہ یہ صرف طلوع اور غروب تھا، جو کہ وجدان اور فقدان ہے۔ یہ حق (الحق) کا وہ سورج ہے جو مشرق سے طلوع ہوا۔ اگر اس کا طلوع نہ ہوتا تو وہ جناب مشرق نہ ہوتا۔ \"تو اسے مغرب سے لے آ (فَأْتِ بِها من الْمَغْرِبِ)\" (البقرۃ: ۲۵۸)۔ اور یہ حقیقت میں، اگر وہ اسے لے آتا، یعنی اگر وہ مغرب سے طلوع ہوتا، تو وہ مشرق ہوتا۔ پس وہ صرف مشرق سے ہی طلوع ہوا، تو کافر مبہوت ہو گیا، اور یہی مقامِ بہوت ہے۔ کیونکہ اسے معلوم تھا کہ جہاں بھی اس کا طلوع ہو گا، اس کے ساتھ مشرق کا نام جڑ جائے گا، لہٰذا نفسِ امر میں مغرب کے لیے کوئی راستہ نہیں۔ پس کافر مبہوت نہیں ہوا مگر اپنی عاجزی کی وجہ سے کہ وہ حاضرین کی کم فہمی کے باوجود، اس علم کے مقام کو کیسے ان کی سمجھ تک پہنچائے جو ابراہیم خلیل اللہ علیہ السلام لائے تھے۔ تو معاملہ اس پر تاریک ہو گیا اور وہ اپنے اندر گھبراہٹ کا شکار ہو گیا، پس حاضرین کے سامنے ابراہیم خلیل اللہ علیہ السلام کی حجت اس پر غالب آ گئی۔ اور کفر کی نسبت اس کی طرف پہلے مسئلے کی وجہ سے کی گئی، کیونکہ وہ جانتا تھا کہ خلیل اللہ کا قول \"میرا رب وہ ہے جو زندگی دیتا ہے اور موت دیتا ہے (رَبِّيَ الَّذِي يُحْيِي ويُمِيتُ)\" (البقرۃ: ۲۵۸) سے کیا مراد تھی، مگر اس نے اسے چھپایا، لہٰذا اسے کافر کہا گیا، پس اس نے کہا: \"میں زندگی دیتا ہوں اور موت دیتا ہوں (أَنَا أُحْيِي وأُمِيتُ)\" (البقرۃ: ۲۵۸)۔ اور اس شخص کے بارے میں کہا جاتا ہے کہ اس نے اسے زندہ کیا، جس کی زندگی کو اس پر باقی رکھا جائے جبکہ وہ قتل کا مستحق ہو، اور خلیل اللہ کی مراد وہی تھی جو نمرود نے سمجھی تھی۔ پس ابراہیم علیہ السلام نے اس چیز کی طرف رخ کیا جو نفسِ امر میں زیادہ پوشیدہ اور دور تھی، مگر حاضرین کے نزدیک زیادہ واضح تھی، چنانچہ وہ دوسرا مسئلہ لائے، تو \"وہ کافر مبہوت ہو گیا (فَبُهِتَ الَّذِي كَفَرَ)\"، ابراہیم کے اس معاملے میں کہ انہوں نے حجت قائم کرنے کے لیے اس چیز کی طرف کیسے رخ کیا جو نفسِ امر میں زیادہ پوشیدہ اور دور تھی۔ اور ان کی قوم کے سامنے اس پر حجت قائم ہو گئی، پس اس کا مبہوت ہونا اس معجزاتی امر میں تھا جس نے حاضرین کی بصیرتوں کو اس بات کی معرفت سے اندھا کر دیا کہ ابراہیم نے واضح سے پوشیدہ کی طرف کیوں رخ کیا۔ پس اس کے تعجب اور مبہوت ہونے سے حاضرین کے نفوس میں اس کی عاجزی ظاہر ہوئی، اور یہی مقصود تھا، اور نمرود اس چیز کو زائل نہ کر سکا جو حاضر عارفین (العارفین) کے دلوں میں اس سے پیدا ہوئی تھی، چنانچہ اس نے ابراہیم کی سچائی کو جان لیا، لیکن اللہ نے اسے ہدایت نہیں دی، یعنی اسے ایمان (الایمان) کی توفیق نہیں دی۔\n\nآپ صلی اللہ علیہ وسلم کے اس قول کی وجہ سے، کیونکہ وہ جانتا تھا کہ وہ حق (الحق) پر ہے۔\n\nاور بہوت (مبہوت ہونا) درست نہیں ہوتا مگر اس چیز کے ظہور الٰہی (التجلی) میں جو ذات حق (الحق) کے پاس ہے، اور ذات حق (الحق) کے پاس وہی ہے جس پر تم ہو، کیونکہ وہ تمہاری طرف تمہارے ذریعے ہی ظاہر ہوتا ہے۔ پس تم اپنے اندر اس کا اقرار کرتے ہو اور اس چیز کا انکار کرتے ہو جس کا تم اس میں اقرار کر رہے ہو، اور یہ تمہاری اپنے آپ سے اور اپنے رب سے جہالت کی وجہ سے ہے، کیونکہ اگر تم اپنے نفس کو پہچانتے تو اپنے رب کو پہچان لیتے۔ پس وہاں خلق (الخلق) کے سوا کچھ نہیں، اور یہی وہ ہے جسے تم دیکھتے اور مشاہدہ (الشہود) کرتے ہو۔ اور اگر تم ہر سانس میں اپنی تبدیلیوں کی باریکیوں کی تفتیش کرتے تو جان لیتے کہ حق (الحق) تمہارے حال کی عین حقیقت (عین) ہے، اور یہ کہ وہ اپنی حیثیت کے اعتبار سے ان سب سے ماورا ہے، جیسا کہ وہ ان سب کی عین حقیقت (عین) بھی ہے۔ پس حق (الحق) خلق (الخلق) ہے، اور خلق (الخلق) حق (الحق) نہیں ہے، اگرچہ اس پر نام مختلف ہوں۔ کیا یہ اللہ کے پاس کی چیزوں میں سے نہیں تھا کہ موسیٰ کا پہاڑ ریزہ ریزہ ہو گیا، تو وہ بے ہوش ہو گئے (صعق)، اور یہ بہوت (بہت) سے زیادہ بڑا ہے۔ اور انہیں بے ہوش نہیں کیا مگر اس چیز نے جو ان کے پاس تھی، اور وہ ان لوگوں میں سے تھے جنہوں نے اپنے رب کو دیکھنے کا مطالبہ کیا تھا۔ پس جب موسیٰ علیہ السلام نے اس وقت ذات حق (الحق) کی عالم کے ساتھ اس صورت کو جان لیا جو وہ پہلے نہیں جانتے تھے، تو انہوں نے کہا: \"میں تیری طرف توبہ کرتا ہوں (تُبْتُ إِلَيْكَ)\" (الأعراف: ۱۴۳)۔ یعنی میں اس طریقے پر تیری رؤیت کا مطالبہ نہیں کروں گا جس پر میں نے پہلے کیا تھا، کیونکہ میں نے وہ جان لیا ہے جو میں تیرے بارے میں نہیں جانتا تھا، اور \"میں سب سے پہلا ایمان لانے والا ہوں (أَنَا أَوَّلُ الْمُؤْمِنِينَ)\" (الأعراف: ۱۴۳) تیرے اس قول پر کہ \"تو مجھے ہرگز نہیں دیکھ سکے گا (لَنْ تَرانِي)\" (الأعراف: ۱۴۳)۔ کیونکہ تو نے یہ بات صرف مجھ سے کہی، اور یہ ایک خبر ہے، لہٰذا انہوں نے اسے ایمان (الایمان) کے ساتھ ملایا نہ کہ علم (العلم) کے ساتھ۔ اور اگر وہ اپنے قول \"تو مجھے ہرگز نہیں دیکھ سکے گا (لَنْ تَرانِي)\" سے ایمان (الایمان) مراد نہ لیتے تو اولیت (سب سے پہلے ہونے) کا دعویٰ درست نہ ہوتا۔ کیونکہ ان سے پہلے بھی مومن تھے، لیکن اس کلمے کے ساتھ کوئی نہیں تھا۔ پس ہر وہ شخص جو بہوت (بہت) یا بے ہوشی (صعق) کے بعد ایمان لایا، تو وہ بصیرت پر ایمان لایا، لہٰذا وہ ایمان میں علم (العلم) کا مالک ہے۔ اور یہ اللہ کے بندوں میں بہت کم پایا جاتا ہے، اور اہل اللہ میں بھی کم ہیں وہ لوگ جن کے ساتھ علم (العلم) کے باوجود ایمان (الایمان) باقی رہتا ہے، کیونکہ جب وہ زیادہ واضح چیز یعنی علم (العلم) کی طرف منتقل ہو جاتا ہے، تو وہ اپنے ایمان (الایمان) سے منتقل ہو جاتا ہے۔ اور کامل (الإنسان الکامل) وہ ہے جو اپنے علم (العلم) کی حالت میں اس چیز پر مومن ہو جس پر وہ ایمان لایا ہے، نہ کہ اس پر جس پر وہ پہلے مومن تھا۔ پس اس کے بارے میں کہا جاتا ہے کہ وہ ایک ہی حقیقت (عین) کے ساتھ مومن اور عالم ہے۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ) (الأحزاب: ۴)۔",
    "fa": "باب چهارصد و چهل و هشتم: در معرفت مقام کسی که چیزی از آنچه نزد من است بر او کشف (الکشف) شود و مبهوت گردد؛ پس چگونه طلب کند که مرا ببیند؟ هیهات!\n\nاگر آنچه نزد اوست بر من حاکم باشد، پس حال ما چگونه خواهد بود آنگاه که او را ببینیم؟\nپس او را جز چشم خودش نمی‌بیند، و آیا چشمی هست که او را جز او ببیند؟\nما را با وجود غیر (السوی) مغالطه می‌کند، در حالی که عین غیر، عین اله است.\nپس امکان ما پیوسته برقرار است، در هستی (الوجود) و نیستی (الفقد)، به واسطه ما، در پناه او.\nپس ما نه غیر او هستیم و نه خود او؛ در نتیجه، عین گمراهی ما از هدایت اوست.\n\n### [خورشید حقی که از مشرق طلوع کرد]\n\nخداوند عز و جل فرمود: «پس آن کس که کفر ورزیده بود مبهوت شد» (فَبُهِتَ الَّذِي كَفَرَ). و به همین دلیل کفر ورزید، و این جز طلوع و غروب نبود، که همان یافتن (الوجدان) و از دست دادن (الفقد) است. این خورشید حقی (الحق) است که از مشرق طلوع کرد، و اگر طلوع آن نبود، آن جانب مشرق نمی‌شد. «پس آن را از مغرب بیاور» (فَأْتِ بِها من الْمَغْرِبِ). و این در حقیقت اگر او آن را می‌آورد، یعنی اگر از مغرب طلوع می‌کرد، باز هم مشرق می‌شد. پس جز از مشرق طلوع نکرد، و کافر مبهوت شد، و این جایگاه بهت است؛ زیرا او دانست که هر جا طلوع برای آن باشد، نام مشرق به دنبال آن می‌آید، پس مغرب در نفس‌الامر راهی ندارد. کافر مبهوت نشد مگر از ناتوانی‌اش در اینکه چگونه جایگاه علم را در آنچه ابراهیم خلیل (علیه السلام) آورده بود، با وجود قصور فهم حاضران، به ادراک آنان برساند. پس کار بر او تاریک شد و در درون خود سردرگم گشت، و حجت ابراهیم خلیل (علیه السلام) بر او در برابر حاضران آشکار شد.\n\nو کفر تنها به دلیل مسئله اول به او نسبت داده شد، زیرا او دانست که خلیل با گفتار خود «پروردگار من کسی است که زنده می‌کند و می‌میراند» (رَبِّيَ الَّذِي يُحْيِي ويُمِيتُ) چه چیزی را اراده کرده است، اما آن را پوشاند و کافر نامیده شد، پس گفت: «من زنده می‌کنم و می‌میرانم» (أَنَا أُحْيِي وأُمِيتُ). و درباره کسی که زندگی فردی را که مستحق قتل است، باقی بگذارد، گفته می‌شود که او را زنده کرد. و مراد خلیل جز همان چیزی نبود که نمرود فهمید. پس ابراهیم به چیزی روی آورد که در نفس‌الامر پنهان‌تر و دورتر بود، اما نزد حاضران واضح‌تر بود، و با مسئله دوم آمد: «پس آن کس که کفر ورزیده بود مبهوت شد» (فَبُهِتَ الَّذِي كَفَرَ) در مورد ابراهیم که چگونه برای اقامه حجت به چیزی روی آورد که در نفس‌الامر پنهان‌تر و دورتر بود. و حجت ابراهیم بر او نزد قومش اقامه شد. پس بهت او در این امر معجزه‌آسا بود که بصیرت حاضران را از درک روی آوردن ابراهیم از واضح‌ترین به پنهان‌ترین کور کرد. و از تعجب و بهت او، ناتوانی‌اش در جان‌های حاضران حاصل شد، و این همان مقصود بود. و نمرود نتوانست آنچه را که در دل‌های عارفان حاضر از آن حاصل شده بود، از بین ببرد، پس صدق ابراهیم را دانست، اما خداوند او را هدایت نکرد، یعنی او را برای ایمان موفق نساخت.\n\nبه دلیل سخن پیامبر (صلی الله علیه و سلم) که او (نمرود) می‌دانست که ابراهیم بر حق (الحق) است.\n\nو بهت صحیح نیست مگر در تجلی (التجلی) آنچه نزد حق (الحق) است. و آنچه نزد حق است، جز همان چیزی نیست که تو بر آن هستی، زیرا جز به واسطه تو بر تو ظاهر نمی‌شود. پس به آن در وجود خود اقرار می‌کنی و آنچه را که به آن اقرار داری، انکار می‌کنی. و این به دلیل جهل تو به خودت و پروردگارت است، زیرا اگر خودت را می‌شناختی، پروردگارت را می‌شناختی. پس در آنجا جز خلق (آفرینش) نیست، و آن همان چیزی است که می‌بینی و شهود (الشهود) می‌کنی. و اگر در ظرایف تغییرات خود در هر نفس (لحظه) جستجو می‌کردی، می‌دانستی که حق (الحق) عین حال توست، و او از حیث ذات خود ورای همه آن است، همان‌گونه که عین همه آن است. پس حق (الحق) خلق است و خلق حق نیست، اگرچه نام‌ها بر او مختلف شود.\n\nآیا از آنچه نزد خداوند است، متلاشی شدن کوه موسی نبود که او مدهوش شد (صعق)، و این بزرگتر از بهت است؟ و او را مدهوش نکرد مگر آنچه نزد او بود، و او از کسانی بود که طلب کرد پروردگارش را ببیند. پس هنگامی که موسی (علیه السلام) در آن هنگام آنچه را که از صورت حق (الحق) با عالم نمی‌دانست، دانست، گفت: «به سوی تو بازگشتم» (تُبْتُ إِلَيْكَ)، یعنی رؤیت تو را به آن وجهی که اول طلب کرده بودم، نمی‌خواهم. زیرا من آنچه را که از تو نمی‌دانستم، شناختم، و «من اولین مؤمنان هستم» (وَأَنَا أَوَّلُ الْمُؤْمِنِينَ) به سخن تو که «هرگز مرا نخواهی دید» (لَنْ تَرانِي)، زیرا تو این را جز برای من نگفتی و آن یک خبر است. به همین دلیل آن را به ایمان ملحق کرد نه به علم. و اگر مراد او ایمان به قول «هرگز مرا نخواهی دید» (لَنْ تَرانِي) نبود، اولویت او صحیح نمی‌شد، زیرا مؤمنان پیش از او بودند، اما با این کلمه (ایمان به این خبر) کسی پیش از او نبود.\n\nپس هر کس بعد از بهت یا صعق (مدهوشی) ایمان آورد، بر بصیرت ایمان آورده است، پس او صاحب علم در ایمان است. و این در میان بندگان خدا کمیاب (عزیز الوجود) است، و در میان اهل الله اندک است کسی که ایمان با علم همراه او باقی بماند. زیرا هنگامی که به واضح‌تر، یعنی علم، منتقل شد، از ایمان خود منتقل شده است. و انسان کامل (الإنسان الکامل) کسی است که در حال علمش به آنچه بدان مؤمن است، مؤمن باشد، نه به آنچه قبلاً بدان مؤمن بود. پس درباره او گفته می‌شود: مؤمنِ عالم با یک چشم. و خداوند حق (الحق) را می‌گوید و اوست که راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 1
}