{
  "id": 417,
  "title": {
    "ar": "الباب السابع عشر وأربعمائة في معرفة منازلة من أَجْرُهُ عَلَى الله",
    "en": "Chapter Four Hundred and Seventeen: Concerning the Knowledge of the Spiritual Stations (منازلة) of him whose Reward is upon Allah.",
    "ur": "باب چار سو سترہواں، اس شخص کے مرتبے کی معرفت میں جس کا اجر اللہ پر ہے",
    "fa": "باب چهارصد و هفدهم در معرفت منزلتی که پاداش آن بر عهده خداوند است"
  },
  "content": {
    "ar": "## «الباب السابع عشر وأربعمائة في معرفة منازلة من أَجْرُهُ عَلَى الله»\n\n\n> أن الرسالة أجرها متحقق *** لكن على الله الذي يستخدمه‏\n\n\n> هذا هو العدل الذي قامت به *** أعيان كون لم يزل يستلزمه‏\n\n\n> العفو والصلح الجميل يزيل ما *** قد كان من حق على من يحكمه‏\n\n\n> العفو إن خصصته نزر وعفو *** الله كنز عند من يستفهمه‏\n\n\n### [إن لله على عباده المنة بهدايتهم على الإيمان‏]\n\n\nقال الله تعالى فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله وقال عز وجل ومن يَخْرُجْ من بَيْتِهِ مُهاجِراً إِلَى الله ورَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى الله وأخبر الله في كتابه عن كل رسول من رسله عليه السلام أنه قال لأمته وما أَسْئَلُكُمْ عَلَيْهِ من أَجْرٍ فيما بلغه عن الله إليهم إِنْ أَجْرِيَ إِلَّا عَلَى الله فإنه تعالى هو الذي استخدمه في التبليغ فاعلم إن الله تعالى له المنة على عباده بأن هداهم للإيمان برسله فوجب عليهم شكر الله وحلاوة الرسول فيضمنها الله عنهم بأن جعل أجر رسوله صَلَّى اللهُ عَليهِ وسَلَّم وضم في ذلك الأجر ما يجب على المؤمنين من الحلاوة له لما هداهم الله به فأنزله صَلَّى اللهُ عَليهِ وسَلَّم منزلة من له تضاعف الأجر أجر التبليغ وأجر ما قام فيه الحق خليفة عن المؤمنين إذ هو الوكيل تعالى عن أمره إيانا بقوله فَاتَّخِذْهُ وَكِيلًا من غير أن ينقص مما هو للمؤمنين شيئا من نعيمهم‏\n\n\n### [أجر التبليغ على قدر ما ناله في البلاغ من المشقة]\n\n\nفاعلم أن أجر التبليغ على قدر ما ناله في البلاغ من المشقة من المخالفين له من أمته التي بعث إليها ولما قاساه ولا يعلم قدر ذلك من كل رسول إلا الله ولا يتعين وأما الذي يعطيه مما كان ينبغي أن يقابله به المؤمنون فهو على نوعين‏\n\n\nالنوع الواحد على قدر معرفتهم بمنزلته ممن أرسله إليهم وهو الله‏\n\n\nفإن الله تعالى فضل بعضهم على بعض والنوع الثاني على قدر ما جاء به في رسالته مما هو بشرى لصاحب تلك الصفة التي من قامت به كان سعيدا عند الله فما كان ينبغي أن يقابله به ذلك الرجل هو الذي يعطيه الحق فإن ساوى حال المؤمن قدر الرسالة كان وإن قصر حاله عما تقتضيه تلك الرسالة من التعظيم فإن الله بكرمه لا ينظر إلى جهل الجاهل بعظيم قدرها فيوفيه الحق تعالى على قدر علمه فيها ولا نشك أن الله قد جعل المفاضلة في كل شي‏ء والعالي والأعلى وإن كان الايمان بالله وبرسوله وبما جاء به عاليا فإنه يتفاضل بتفاضل شعبه وأبوا به فإن الايمان بضع وسبعون شعبة وأدناها إماطة الأذى عن الطريق وأرفعها قول لا إله إلا الله وما بينهما فمن جمع شعب الايمان كلها فجزاء الرسول من الله عن هذا الشخص الجامع على قدر منازلها عند الله العالم بالعالي منها وبالأعلى فانظر ما للرسول عليه السلام من الأجور فاجر التبليغ أجر استحقاق‏\n\n\nفإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول إن أحق ما أخذتم عليه أجرا كتاب الله‏\n\n\nوأما من سأل من الصحابة عن أمر ما من الأمور مما لم ينزل فيه قرآن فنزل فيه قرآن من أجل سؤاله فإن للرسول على ذلك السائل أجر استحقاق ينوب الله عنه فيه زائدا على الأجر الذي له من الله وأما من رد رسالته من أمته التي بعث إليها فإن له عند الله أيضا أجر المصيبة وللمصاب فيما يحب أجر فأجره على الله أيضا على عدد من رد ذلك من أمته بلغوا ما بلغوا وله من أجر المصاب أجر مصائب العصاة فإنه نوع من أنواع الرزايا في حقه فإنه ما جاء بأمر يطلب العمل به إلا والذي يترك العمل به قد عصى فللرسول أجر المصيبة والرزية وهذا كله على الله الوفاء به لكل رسول‏\n\n\n### «النوع الثاني» ممن أجره على الله وهو المهاجر يموت قبل وصوله إلى المنزل الذي هاجر إليه‏\n\n\nفإن أجره على الله على قدر الباعث الذي بعثه على الهجرة والناس في ذلك متفاضلون ثم إن الله ينوب عن رسوله فيما يعطيه من الأجر فإنه خرج مهاجرا إلى الله ورسوله ثم إن له أجر الفوت بالموت الذي أدركه وذلك من الله فإنه الذي رزأه وحال بينه وبين الوصول إلى مهاجره فالدية عليه فإن كان هذا الذي يموت عالما عاقلا فأعظم من لقاء الله ورؤيته فما يكون وقد حصل له ذلك بالموت فهو أفضل في حقه من أنه يعيش حتى يصل فإنه لا يدري ما دام في الحياة الدنيا ما يتقلب عليه من الأحوال فإنه في محل خطر سريع التبديل وصح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في هذا الباب ما خرجه البخاري عن عمر بن الخطاب رضي الله عنه عن رسول الله ص‏\nأنه قال إنما الأعمال بالنيات وإنما لامرئ ما نوى‏\n\n\nفمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه ثم يضاف إلى هذه الأجور قدر كرم المعطي وغناه وهذا يدخل تحت‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إن في الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\nيعني من المجزيين وتحت قوله وزيادة من قوله لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ وهذه الزيادة ما عينها الحق لاحد وأكد هذا الأجر على غيره ممن له أجر على الله بالوقوع وهو الوجوب فإن الأجر قد يقتضيه الكرم من غير وجوب وقد يقتضيه الوجوب والذي يقتضيه الوجوب أعلى كما إن الفرائض أعلى وأحب إلى الله من النوافل‏\n\n\nصح في الخبر أن الله تعالى يقول ما نقرب إلى أحد بأحب إلي مما افترضته عليه فجعله أحب إليه ثم قال ولا يزال العبد يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت سمعه وبصره‏\n\n\nفهذا نتيجة النوافل فما ظنك بنتيجة الفرائض وهي أن يكون العبد سمع الحق وبصره وقد بينا صورة ذلك فيما تقدم فيريد الحق بإرادة العبد وهذا المقام ذكرته العرب في حق محمد صَلَّى اللهُ عَليهِ وسَلَّم وفي النوافل يريد العبد بإرادة الحق ويظهر معنى ما ذهبنا إليه في اتصاف الحق بنعوت المخلوق وفي الوجه الآخر اتصاف العبد بصفات الحق وهذا في الشرع موجود\n\n\n### «النوع الثالث» ممن أجره على الله وهو من عفا عمن أساء إليه وأصلح‏\n\n\nيعني حال من أساء إليه بالإحسان فأصلح منه ما كان أوجب الإساءة إليه منه فما أراد هنا بأصلح إلا هذا ولا يحصل في هذا المقام إلا من له همة عالية فإن الله قد أباح له أن يجازي المسي‏ء بإساءته على وزنها فأنف على نفسه أن يكون محلا للاتصاف بما سماه الحق سيئة\n\n\n> نفس الكريم كريمة في كل ما *** تجري به الأهواء والأقدار\n\n\n> والله يحكم في النفوس بقدرها *** وهو الذي من حكمه يختار\n\n\n> فيجي‏ء ذو اللب المجوز عقله *** غير الذي حكمت به فيحار\n\n\nيقول الله تعالى في هذا المقام ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ يعني قوله وأصلح السَّيِّئَةَ ... فَإِذَا الَّذِي بَيْنَكَ وبَيْنَهُ عَداوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ وما يُلَقَّاها يعني هذه الصفة إِلَّا الَّذِينَ صَبَرُوا حبسوا أنفسهم عن أن يجاز والمسي‏ء بإساءته إساءة ولو علم الناس قدر ما نبهنا عليه في هذه المسألة ما جازى أحد من أساء إليه بإساءة فما كنت ترى في العالم إلا عفوا مصلحا لكن الحجب على أعين البصائر كثيفة وليست سوى الأغراض واستعجال التشفي والمؤاخذة ولو نظر هذا الناظر لما أساء هو على الله في رد ما كلفه به وركوبه الخطر في ذلك وإمهال الحق له وتجاوزه عنه في هذه الدار حتى يكون هو الذي يكشف نفسه حتى تقام عليه الحدود ويرمي نفسه في المهالك كما قال الصاحب لقد ستر الله عليه لو ستر على نفسه في المعترف بالزنى وإن الملائكة الكتاب لا يكتبون على العبد من أفعاله السيئة إلا ما تكلم بها وهو قوله ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ وهو الكاتب وإن كانوا يَعْلَمُونَ ما تَفْعَلُونَ ما قال يكتبون ثم إنه من كرم الله إن الكشف أعطى وقد ورد به خبر أن العبد إذا عمل السيئة قال الملك لصاحبه الذي أمره الحق أن يستأذنه في كتاب السيئة أ أكتب فيقول له لا تكتب وأنظره إلى ست ساعات من وقت عمله السيئة فإن تاب أو استغفر فلا تكتبها وإن مرت عليه ست ساعات ولم يستغفر فاكتبها سيئة واحدة\n\n\nولا نكتبها إلا إذا تلفظ بها بأن يقول فعلت كذا أو تكون السيئة في القول فتكتب بعد مضى هذا القدر من الزمان وأي مؤمن تمضي عليه ست ساعات لا يستغفر الله فيها فلهذا النوع أجر على الله من وجهين أجر العفو وأجر العفو من الله كثير فإنه من الأضداد وأجر الإصلاح وهو الإحسان إليه المزيل لما قام به من الموجب للاساءة إليه والله يحب المحسنين ولو لم يكن في إحسانه المعبر عنه بالإصلاح إلا حصول حب الله إياه الذي لا يعدله شي‏ء لكان عظيما فيكون أجر من هذا صفته على الله أجر محب لمحبوب وكفى بما تعطيه منزلة الحب فما يقدر أحد أن يقدر أجر ما يعطيه المحب لمحبوبه فهذا قد أومأنا إلى من له أجر على الله بأوجز عبارة طلبا للاختصار فإن المقام عظيم والمنازلة كبيرة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Seventeen: Concerning the Knowledge of the Station of Those Whose Reward is Incumbent Upon Allah\n\nThe reward of the Messengership is realized,\nBut it is incumbent upon Allah, Who employs the Messenger.\n\nThis is the Justice (العدل) upon which\nThe Fixed Entities (أعيان كون) were established, which He perpetually necessitates.\n\nPardon (العفو) and beautiful reconciliation (الصلح الجميل) remove\nWhatever right was due from the one who judges it.\n\nPardon, if you specify it, is meager, but the Pardon of Allah\nIs a treasure for the one who seeks to understand it.\n\n### [Indeed, Allah has a Favor upon His Servants by Guiding Them to Faith]\n\nAllah the Exalted said: <<فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله>> (But whoever pardons and reconciles—his reward is incumbent upon Allah). And He, the Mighty and Majestic, said: <<ومن يَخْرُجْ من بَيْتِهِ مُهاجِراً إِلَى الله ورَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى الله>> (And whoever leaves his home, emigrating to Allah and His Messenger, and then death overtakes him—his reward has become incumbent upon Allah).\n\nAllah informed us in His Book concerning every Messenger (رسول) of His, peace be upon him, that he said to his community: <<وما أَسْئَلُكُمْ عَلَيْهِ من أَجْرٍ>> (I ask you no reward for it) concerning what he conveyed from Allah to them, <<إِنْ أَجْرِيَ إِلَّا عَلَى الله>> (My reward is only incumbent upon Allah). For He, the Exalted, is the One Who employed him in the conveyance (التبليغ).\n\nKnow that Allah the Exalted has a favor (المنة) upon His servants by guiding them to faith (الإيمان) through His Messengers. Thus, it is incumbent upon them to thank Allah and to reward the Messenger. Allah guarantees this reward on their behalf by making the reward of His Messenger (may Allah bless him and grant him peace) incumbent upon Himself, including within that reward what is due to the Messenger from the believers as recompense for the guidance Allah bestowed upon them through him. Thus, He elevated him (may Allah bless him and grant him peace) to the station of one who receives a doubled reward: the reward for conveyance (أجر التبليغ) and the reward for what the Real (الحق) fulfilled on his behalf as a deputy for the believers, since He is the Trustee (الوكيل), exalted be He, concerning His command to us: <<فَاتَّخِذْهُ وَكِيلًا>> (So take Him as a Trustee), without diminishing anything of the bliss (نعيم) that belongs to the believers.\n\n### [The Reward for Conveyance is Commensurate with the Hardship Encountered in the Delivery]\n\nKnow that the reward for conveyance is commensurate with the hardship (المشقة) the Messenger endured in the delivery from the dissenters among the community (الأمة) to whom he was sent, and for what he suffered. The measure of this reward for each Messenger is known only to Allah and is not fixed.\n\nAs for what He grants him that the believers ought to have offered in return, it is of two types. The first type is commensurate with their gnosis (معرفة) of his station relative to the One Who sent him to them, Who is Allah. For Allah the Exalted has favored some of them over others. The second type is commensurate with what he brought in his message (رسالة) that constitutes glad tidings for the possessor of that quality, such that whoever possesses it will be felicitous (سعيد) in the sight of Allah. Thus, what that person ought to have offered in return is what the Real (الحق) grants him. If the state of the believer equals the measure of the Messengership, then it is so. But if his state falls short of the veneration (التعظيم) required by that Messengership, then Allah, out of His generosity, does not look at the ignorance of the ignorant concerning its great worth, but the Real the Exalted fulfills the reward commensurate with His own Knowledge (علم) of it.\n\nWe do not doubt that Allah has established degrees of preference (المفاضلة) in everything, the high and the highest. Although faith (الإيمان) in Allah, His Messenger, and what he brought is high, it varies in degree according to the variation of its branches (شعب) and gates. For faith has seventy-odd branches, the lowest of which is removing harm from the road, and the highest of which is the saying: *Lā ilāha illā Allāh* (There is no god but Allah). And [the reward is based on] what lies between them. Whoever gathers all the branches of faith, the recompense of the Messenger from Allah on behalf of this comprehensive person is commensurate with the stations of those branches in the sight of Allah, Who knows the high among them and the highest.\n\nLook then at the rewards (الأجور) due to the Messenger, peace be upon him. The reward for conveyance is a reward of entitlement (أجر استحقاق). For the Messenger of Allah (may Allah bless him and grant him peace) said: \"Indeed, the most deserving thing for which you take a reward is the Book of Allah.\"\n\nAs for the Companion (الصحابة) who asked about a matter concerning which no Quran had been revealed, and then Quran was revealed because of his question, the Messenger has a reward of entitlement from that questioner, which Allah fulfills on his behalf, in addition to the reward he receives from Allah.\n\nAs for those among his community to whom he was sent who rejected his message, he also has the reward for the affliction (أجر المصيبة) with Allah. The afflicted person receives a reward for what he loves [but loses], so his reward is also incumbent upon Allah, corresponding to the number of those in his community who rejected it, however many they may be. He receives, from the reward of the afflicted, the reward for the afflictions caused by the disobedient (العصاة), for this is a type of calamity (الرزايا) in his regard. He only came with a command requiring action, and whoever abandons that action has disobeyed. Thus, the Messenger receives the reward for the affliction and the calamity. The fulfillment of all this for every Messenger is incumbent upon Allah.\n\n### The Second Type of those whose reward is incumbent upon Allah: The Emigrant who dies before reaching the destination to which he emigrated.\n\nHis reward is incumbent upon Allah, commensurate with the motive (الباعث) that drove him to emigrate, and people vary in degree regarding this. Furthermore, Allah acts as a deputy for His Messenger concerning the reward He grants him, for the emigrant departed, emigrating to Allah and His Messenger. He then receives the reward for being prevented [from reaching his goal] by the death that overtook him. This is from Allah, for He is the One Who afflicted him and stood between him and reaching his destination of emigration, so the compensation (الدية) is incumbent upon Him.\n\nIf this person who dies is knowledgeable and intelligent, then what could be greater than meeting Allah and seeing Him? Since this was achieved through death, it is better for him than if he had lived until he arrived, for he does not know what states he might have undergone while in the life of this world (الحياة الدنيا), as it is a place of danger and rapid change.\n\nWhat al-Bukhari transmitted from Umar ibn al-Khattab (may Allah be pleased with him) concerning the Messenger of Allah (may Allah bless him and grant him peace) is sound regarding this chapter, that he said: \"Actions are only by intentions (النيات), and every person will have only what he intended. So whoever’s emigration was for Allah and His Messenger, his emigration is for Allah and His Messenger. And whoever’s emigration was for worldly gain (دنيا) he might acquire or a woman he might marry, his emigration is for that to which he emigrated.\"\n\nThen, to these rewards is added the measure of the generosity and richness of the Giver. This falls under his saying (may Allah bless him and grant him peace): \"Indeed, in Paradise (الجنة) there is what no eye has seen, no ear has heard, and what has not occurred to the heart of a human being\"—meaning, concerning those who are rewarded—and under His saying, \"and an increase,\" from His statement: <<لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ>> (For those who have done good is the best [reward] and an increase). This increase (الزيادة) has not been specified by the Real (الحق) for anyone. He confirmed this reward upon others whose reward is incumbent upon Allah by its occurrence, which is its necessity (الوجوب). For the reward may be necessitated by generosity (الكرم) without being obligatory, or it may be necessitated by obligation. That which is necessitated by obligation is higher, just as the obligatory duties (الفرائض) are higher and more beloved to Allah than the supererogatory acts (النوافل).\n\nIt is soundly reported in the Hadith that Allah the Exalted says: \"My servant does not draw near to Me with anything more beloved to Me than what I have made obligatory upon him.\" Thus, He made it more beloved to Him. Then He said: \"And My servant continues to draw near to Me through supererogatory acts until I love him. When I love him, I am his hearing and his sight.\" This is the result of the supererogatory acts. What then do you think of the result of the obligatory duties, which is that the servant becomes the hearing and sight of the Real? We have previously explained the form of this, where the Real wills by the will of the servant. This station was mentioned by the Arabs concerning Muhammad (may Allah bless him and grant him peace). In the supererogatory acts, the servant wills by the will of the Real. The meaning we have adopted becomes manifest in the Real being characterized by the attributes of the created (نعوت المخلوق), and in the other aspect, the servant being characterized by the attributes of the Real (صفات الحق). This is established in the Sacred Law (الشرع).\n\n### The Third Type of those whose reward is incumbent upon Allah: He who pardons one who wronged him and reconciles.\n\nMeaning, he treats the one who wronged him with excellence (الإحسان), thereby rectifying in him that which necessitated the wrongdoing against him. By \"reconciles\" (أصلح) here, nothing other than this is intended. This station is only attained by one who possesses a high spiritual aspiration (همة عالية). For Allah has permitted him to retaliate against the wrongdoer with an equivalent wrongdoing, yet he disdains for himself to be a locus for being characterized by what the Real has named a transgression (سيئة).\n\nThe soul of the noble one is generous in everything\nThat passions and decrees bring forth.\n\nAnd Allah judges souls according to their measure,\nAnd He is the One Who chooses from His judgment.\n\nThen the possessor of intellect, whose reason permits [retaliation],\nComes with something other than what [the noble soul] judged, and he is bewildered.\n\nAllah the Exalted says concerning this station: <<ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ>> (Repel [evil] with that which is better)—meaning His saying, \"and reconciles\"—<<السَّيِّئَةَ ... فَإِذَا الَّذِي بَيْنَكَ وبَيْنَهُ عَداوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ>> (the evil... and suddenly he between whom and you was enmity is as if he were a devoted friend). <<وما يُلَقَّاها>> (And none is granted it)—meaning this quality—<<إِلَّا الَّذِينَ صَبَرُوا>> (except those who are patient), who restrain themselves from retaliating against the wrongdoer with a corresponding wrongdoing.\n\nIf people knew the worth of what we have pointed out in this matter, no one would retaliate against one who wronged him with a wrongdoing. You would see nothing in the world (العالم) but pardoning reconcilers. However, the veils (الحجب) over the eyes of insight (البصائر) are thick, consisting only of selfish motives, the haste for vengeance, and the desire for retribution.\n\nIf this observer were to consider how he himself has wronged Allah by rejecting what He obligated upon him and by undertaking danger in that, and how the Real grants him respite and overlooks his faults in this abode until he is the one who exposes himself, leading to the establishment of legal penalties (الحدود) against him, and casting himself into destruction—as the Companion said concerning the one who confessed to adultery: \"Allah had concealed him, if only he had concealed himself.\"\n\nIndeed, the recording angels (الملائكة الكتاب) do not write down the evil deeds (الأفعال السيئة) of the servant except what he speaks, which is His saying: <<ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ>> (Not a word does he utter except that there is a watcher by him, ready [to record]), and that is the scribe. Although He said <<يَعْلَمُونَ ما تَفْعَلُونَ>> (They know what you do), He did not say they write [everything].\n\nFurthermore, it is part of Allah’s generosity (كرم) that Unveiling (الكشف) has granted, and a report has been transmitted concerning it, that when a servant commits a transgression, the angel says to his companion—whom the Real commanded him to ask permission from regarding the writing of the transgression—\"Shall I write?\" He replies, \"Do not write. Wait for him for six hours from the time he committed the transgression. If he repents or seeks forgiveness, do not write it. If six hours pass and he has not sought forgiveness, then write it as a single transgression.\" And we only write it if he utters it by saying, \"I did such-and-such,\" or if the transgression is in speech, in which case it is written after the passage of this period of time.\n\nAnd what believer is there upon whom six hours pass without seeking Allah’s forgiveness? Therefore, this type [of person who pardons and reconciles] has a reward incumbent upon Allah from two aspects: the reward for pardon (أجر العفو)—and the reward for pardon from Allah is abundant, for it pertains to the opposites—and the reward for reconciliation (أجر الإصلاح), which is the excellence (الإحسان) shown to the wrongdoer that removes the cause which necessitated the wrongdoing against him. And Allah loves the excellent doers (المحسنين). Even if the only result of his excellence, expressed as reconciliation, were the attainment of Allah’s love for him—which nothing equals—it would be immense. Thus, the reward of one possessing this quality is incumbent upon Allah, the reward of a lover for the beloved. The station of love (منزلة الحب) is sufficient in what it grants, for no one can estimate the reward that the lover grants to his beloved.\n\nWe have thus alluded to those whose reward is incumbent upon Allah in the most concise expression, seeking brevity, for the station (المقام) is great and the degrees (المنازلة) are vast. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو سترہ: ان لوگوں کے مراتب کی معرفت میں جن کا اجر اللہ پر ہے۔\n\nرسالت کا اجر تو متحقق ہے، لیکن اس اللہ پر ہے جو اسے استعمال کرتا ہے۔\n\nیہی وہ عدل ہے جس پر کائنات کے اعیان (أعيان) قائم ہوئے، جسے وہ ہمیشہ لازم کرتا ہے۔\n\nعفو اور صلح جمیل اس حق کو زائل کر دیتے ہیں جو اس شخص پر تھا جو اس پر حکم چلاتا ہے۔\n\nاگر عفو کو خاص کیا جائے تو وہ کم ہے، اور اللہ کا عفو اس شخص کے لیے خزانہ ہے جو اسے سمجھتا ہے۔\n\n### [بے شک اللہ کا اپنے بندوں پر احسان (المنة) ہے کہ اس نے انہیں ایمان کی طرف ہدایت دی۔]\n\nاللہ تعالیٰ نے فرمایا: فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله (پھر جس نے معاف کر دیا اور صلح کر لی تو اس کا اجر اللہ پر ہے۔) (الشوریٰ: ۴۰) اور اللہ عزوجل نے فرمایا: ومن يَخْرُجْ من بَيْتِهِ مُهاجِراً إِلَى الله ورَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى الله (اور جو کوئی اپنے گھر سے اللہ اور اس کے رسول کی طرف ہجرت کرتے ہوئے نکلے، پھر اسے موت آ پکڑے تو یقیناً اس کا اجر اللہ پر واجب ہو گیا۔) (النساء: ۱۰۰)\n\nاور اللہ نے اپنی کتاب میں اپنے ہر رسول علیہ السلام کے بارے میں خبر دی کہ اس نے اپنی امت سے کہا: وَما أَسْئَلُكُمْ عَلَيْهِ من أَجْرٍ (میں تم سے اس پر کوئی اجر نہیں مانگتا) اس تبلیغ کے عوض جو اس نے اللہ کی طرف سے ان تک پہنچائی، إِنْ أَجْرِيَ إِلَّا عَلَى الله (میرا اجر تو صرف اللہ پر ہے)۔ کیونکہ وہی (اللہ تعالیٰ) ہے جس نے اسے تبلیغ (التبليغ) کے لیے استعمال کیا۔ پس جان لو کہ اللہ تعالیٰ کا اپنے بندوں پر احسان (المنة) ہے کہ اس نے انہیں اپنے رسولوں پر ایمان لانے کی ہدایت دی۔ لہٰذا ان پر اللہ کا شکر اور رسول کی تعظیم (حلاوة) واجب ہوئی، تو اللہ نے ان کی طرف سے اس کی ضمانت دی کہ اس نے اپنے رسول صلی اللہ علیہ وسلم کا اجر مقرر کیا اور اس اجر میں وہ تعظیم بھی شامل کر دی جو مؤمنین پر واجب تھی، اس ہدایت کے بدلے جو اللہ نے انہیں عطا کی۔ پس اس نے رسول صلی اللہ علیہ وسلم کو اس شخص کے مرتبے پر فائز کیا جس کے لیے اجر دوگنا ہو گیا: ایک تبلیغ کا اجر، اور دوسرا وہ اجر جو مؤمنین کی طرف سے خلیفہ بن کر حق (الحق) نے ادا کیا، کیونکہ وہ (اللہ تعالیٰ) ہمارے اس حکم میں وکیل ہے: فَاتَّخِذْهُ وَكِيلًا (پس اسے اپنا وکیل بنا لو)، اس کے بغیر کہ مؤمنین کی نعمتوں میں سے کوئی چیز کم ہو۔\n\n### [تبلیغ کا اجر اس مشقت کے مطابق ہے جو اسے تبلیغ میں پہنچی۔]\n\nپس جان لو کہ تبلیغ کا اجر اس مشقت کے مطابق ہے جو اسے اپنی امت کے مخالفین کی طرف سے تبلیغ میں پہنچی جس کی طرف وہ مبعوث کیا گیا تھا، اور جو کچھ اس نے برداشت کیا۔ ہر رسول کے لیے اس کی مقدار صرف اللہ ہی جانتا ہے اور یہ متعین نہیں ہے۔ اور جو کچھ اللہ اسے عطا کرتا ہے جو مؤمنین کو اس کے بدلے میں دینا چاہیے تھا، وہ دو قسموں پر ہے۔\n\nپہلی قسم: ان کی معرفت (المعرفۃ) کی مقدار کے مطابق کہ اس کی منزلت کیا ہے جس نے اسے ان کی طرف بھیجا، اور وہ اللہ ہے۔ کیونکہ اللہ تعالیٰ نے ان میں سے بعض کو بعض پر فضیلت دی ہے۔\n\nدوسری قسم: اس رسالت میں جو کچھ وہ لایا، اس کی مقدار کے مطابق، جو اس صفت کے حامل شخص کے لیے خوشخبری ہے، جس کے ساتھ وہ صفت قائم ہو جائے تو وہ اللہ کے نزدیک سعید (خوش بخت) ہو جاتا ہے۔ پس جو کچھ اس شخص کو اس کے بدلے میں دینا چاہیے تھا، وہی حق (الحق) اسے عطا کرتا ہے۔ اگر مؤمن کا حال رسالت کے مطابق ہو تو وہ اجر ملتا ہے، اور اگر اس کا حال اس تعظیم سے قاصر ہو جو اس رسالت کا تقاضا ہے، تو اللہ اپنے کرم سے اس جاہل کی جہالت کی طرف نہیں دیکھتا جو اس کی عظیم قدر سے ناواقف ہے، بلکہ حق تعالیٰ اسے اس کی معرفت (علم) کی مقدار کے مطابق پورا پورا اجر دیتا ہے۔\n\nاور ہمیں کوئی شک نہیں کہ اللہ نے ہر چیز میں فضیلت رکھی ہے، اور بلند اور بلند تر مراتب رکھے ہیں۔ اگرچہ اللہ پر، اس کے رسول پر، اور جو کچھ وہ لائے اس پر ایمان لانا بلند ہے، لیکن یہ اپنے شعبوں اور ابواب کے تفاوت سے بھی متفاضل ہوتا ہے۔ بے شک ایمان کے ستر سے کچھ اوپر شعبے ہیں، اور ان میں سب سے ادنیٰ راستے سے تکلیف دہ چیز کو ہٹا دینا ہے، اور سب سے بلند لا الہ الا اللہ کہنا ہے، اور جو کچھ ان کے درمیان ہے۔ پس جس نے ایمان کے تمام شعبوں کو جمع کر لیا، تو اس جامع شخص کی طرف سے رسول کا اجر اللہ کی طرف سے ان مراتب کی مقدار کے مطابق ہوگا جو اللہ کے نزدیک ہیں، جو بلند اور بلند تر کو جانتا ہے۔\n\nپس دیکھو کہ رسول علیہ السلام کے لیے کیا کیا اجر ہیں! تبلیغ کا اجر استحقاق کا اجر ہے۔ کیونکہ رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: إِنَّ أَحَقَّ مَا أَخَذْتُمْ عَلَيْهِ أَجْرًا كِتَابُ اللَّهِ (بے شک سب سے زیادہ حقدار جس پر تم نے اجر لیا، وہ اللہ کی کتاب ہے۔) (حدیث)\n\nاور جس نے صحابہ میں سے کسی ایسے معاملے کے بارے میں سوال کیا جس کے بارے میں قرآن نازل نہیں ہوا تھا، پھر اس کے سوال کی وجہ سے قرآن نازل ہوا، تو اس سائل پر رسول کے لیے استحقاق کا اجر ہے، جس میں اللہ اس کی طرف سے اضافہ کرتا ہے، اس اجر کے علاوہ جو اسے اللہ کی طرف سے ملتا ہے۔ اور جس نے اپنی امت میں سے اس کی رسالت کو رد کر دیا جس کی طرف وہ مبعوث کیا گیا تھا، تو اس کے لیے اللہ کے ہاں مصیبت کا اجر بھی ہے۔ اور مصیبت زدہ کے لیے اس چیز میں اجر ہے جسے وہ محبوب رکھتا ہے، تو اس کا اجر بھی اللہ پر ہے۔ یہ اجر اس کی امت میں سے رد کرنے والوں کی تعداد کے مطابق ہوگا، خواہ وہ کتنی ہی تعداد میں ہوں۔ اور اسے مصیبت زدہ کے اجر میں گنہگاروں کی مصیبتوں کا اجر بھی ملتا ہے، کیونکہ یہ اس کے حق میں مصیبتوں کی ایک قسم ہے۔ کیونکہ وہ کوئی ایسا حکم لے کر نہیں آئے جس پر عمل مطلوب نہ ہو، اور جو اس پر عمل ترک کرتا ہے وہ یقیناً نافرمانی کرتا ہے۔ پس رسول کے لیے مصیبت اور نقصان کا اجر ہے، اور یہ سب کچھ ہر رسول کے لیے اللہ پر پورا کرنا واجب ہے۔\n\n### «دوسری قسم» ان لوگوں کی جن کا اجر اللہ پر ہے، اور وہ مہاجر ہے جو اس منزل پر پہنچنے سے پہلے مر جاتا ہے جس کی طرف اس نے ہجرت کی تھی۔\n\nپس اس کا اجر اللہ پر اس محرک کی مقدار کے مطابق ہے جس نے اسے ہجرت پر ابھارا، اور لوگ اس میں ایک دوسرے سے افضل ہیں۔ پھر اللہ اپنے رسول کی طرف سے اس اجر میں اضافہ کرتا ہے جو وہ اسے عطا کرتا ہے، کیونکہ وہ اللہ اور اس کے رسول کی طرف ہجرت کرتے ہوئے نکلا تھا۔ پھر اسے موت کے فوت ہونے کا اجر ملتا ہے جو اسے آ پکڑی، اور یہ اللہ کی طرف سے ہے، کیونکہ اسی نے اسے نقصان پہنچایا اور اس کے اور اس کی ہجرت گاہ تک پہنچنے کے درمیان حائل ہو گیا۔ پس دیت (بدلہ) اسی پر ہے۔\n\nاگر یہ مرنے والا عالم اور عاقل تھا، تو اللہ سے ملاقات اور اس کا دیدار (رؤیت) سب سے عظیم ہے، تو کیا ہوگا جب اسے موت کے ذریعے یہ حاصل ہو گیا؟ پس یہ اس کے حق میں اس سے افضل ہے کہ وہ زندہ رہتا یہاں تک کہ پہنچ جاتا، کیونکہ جب تک وہ دنیا کی زندگی میں ہے، وہ نہیں جانتا کہ وہ کن حالات میں پلٹتا رہے گا، کیونکہ وہ ایک خطرناک جگہ پر ہے جو تیزی سے بدلتی ہے۔\n\nاور اس باب میں رسول اللہ صلی اللہ علیہ وسلم سے وہ حدیث صحیح ثابت ہے جسے بخاری نے عمر بن خطاب رضی اللہ عنہ سے روایت کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ وَإِنَّمَا لِامْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ (بے شک اعمال کا دار و مدار نیتوں پر ہے، اور ہر شخص کے لیے وہی ہے جو اس نے نیت کی۔ پس جس کی ہجرت اللہ اور اس کے رسول کی طرف ہو، تو اس کی ہجرت اللہ اور اس کے رسول کی طرف ہے، اور جس کی ہجرت دنیا حاصل کرنے یا کسی عورت سے شادی کرنے کے لیے ہو، تو اس کی ہجرت اسی کی طرف ہے جس کی طرف اس نے ہجرت کی۔) (حدیث)\n\nپھر ان اجروں میں عطا کرنے والے کے کرم اور اس کی غنا (بے نیازی) کی مقدار کا اضافہ ہوتا ہے۔ اور یہ اس کے قول صلی اللہ علیہ وسلم کے تحت آتا ہے: إِنَّ فِي الْجَنَّةِ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ (بے شک جنت میں وہ کچھ ہے جو نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی بشر کے دل پر اس کا خیال گزرا۔) (حدیث) یعنی بدلہ پانے والوں کے لیے۔ اور یہ اس کے قول وزِيادَةٌ (اور اضافہ) کے تحت بھی آتا ہے، جو اس کے قول لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ (جن لوگوں نے نیکی کی ان کے لیے بھلائی ہے اور اضافہ بھی) (یونس: ۲۶) میں ہے۔ اور اس اضافے کو حق (الحق) نے کسی کے لیے متعین نہیں کیا۔\n\nاور اس اجر کو ان دوسرے لوگوں پر بھی مؤکد کیا گیا ہے جن کا اجر اللہ پر ہے، وجوب (الوقوع) کے ذریعے، کیونکہ اجر کبھی کرم کے تقاضے سے بغیر وجوب کے بھی مل جاتا ہے، اور کبھی وجوب کے تقاضے سے۔ اور جو وجوب کے تقاضے سے ہو وہ اعلیٰ ہے، جیسا کہ فرائض (الفرائض) نوافل (النوافل) سے زیادہ اعلیٰ اور اللہ کو زیادہ محبوب ہیں۔\n\nخبر میں صحیح ثابت ہے کہ اللہ تعالیٰ فرماتا ہے: \"کوئی چیز ایسی نہیں جس کے ذریعے بندہ میرا قرب حاصل کرے جو مجھے اس سے زیادہ محبوب ہو جو میں نے اس پر فرض کی ہے۔\" پس اس نے اسے زیادہ محبوب بنا دیا۔ پھر فرمایا: \"اور میرا بندہ نوافل کے ذریعے میرا قرب حاصل کرتا رہتا ہے یہاں تک کہ میں اس سے محبت کرنے لگتا ہوں۔ جب میں اس سے محبت کرتا ہوں تو میں اس کا کان بن جاتا ہوں، اس کی آنکھ بن جاتا ہوں۔\" (حدیث)\n\nیہ نوافل کا نتیجہ ہے۔ تو فرائض کے نتیجے کے بارے میں تمہارا کیا خیال ہے؟ اور وہ یہ ہے کہ بندہ حق (الحق) کا کان اور اس کی آنکھ بن جائے۔ ہم نے اس کی صورت پہلے بیان کر دی ہے۔ پس حق (الحق) بندے کے ارادے سے ارادہ کرتا ہے۔ اور اس مقام کا ذکر عرب نے محمد صلی اللہ علیہ وسلم کے حق میں کیا ہے۔ اور نوافل میں بندہ حق کے ارادے سے ارادہ کرتا ہے۔ اور جو کچھ ہم نے بیان کیا ہے اس کا مفہوم حق کے مخلوق کی صفات سے متصف ہونے میں ظاہر ہوتا ہے، اور دوسرے پہلو میں بندے کا حق کی صفات سے متصف ہونا۔ اور یہ شریعت میں موجود ہے۔\n\n### «تیسری قسم» ان لوگوں کی جن کا اجر اللہ پر ہے، اور وہ وہ ہے جس نے اس شخص کو معاف کر دیا جس نے اس کے ساتھ برا کیا اور صلح کر لی۔\n\nیعنی جس نے اس کے ساتھ برائی کی، اس کے حال کو احسان کے ذریعے درست کر دیا، پس اس نے اس برائی کو درست کر دیا جس نے اس کے ساتھ برائی کو واجب کیا تھا۔ یہاں \"أصلح\" (صلح کر لی) سے مراد صرف یہی ہے۔ اور یہ مقام صرف وہی شخص حاصل کر سکتا ہے جس میں ہمت عالیہ (همة عالية) ہو۔ کیونکہ اللہ نے اسے اجازت دی ہے کہ وہ برائی کرنے والے کو اس کی برائی کے وزن کے مطابق بدلہ دے، لیکن اس نے اپنے آپ کو اس صفت سے متصف ہونے سے بچایا جسے حق نے برائی (سیئۃ) کا نام دیا ہے۔\n\nنفس کریمہ ہر اس چیز میں کریم ہوتی ہے جس کے ذریعے خواہشات اور تقدیریں جاری ہوتی ہیں۔\n\nاور اللہ نفوس کے بارے میں ان کی قدر کے مطابق حکم کرتا ہے، اور وہی ہے جو اپنے حکم سے انتخاب کرتا ہے۔\n\nپس عقل مند شخص آتا ہے جس کی عقل اس کے لیے جائز قرار دیتی ہے، اس کے علاوہ جو اس نے حکم دیا، تو وہ حیران رہ جاتا ہے۔\n\nاللہ تعالیٰ اس مقام پر فرماتا ہے: ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ (برائی کو اس چیز سے دور کرو جو بہترین ہو) (فصلت: ۳۴)۔ یعنی اس کا قول \"وأصلح\" (اور صلح کر لی) السَّيِّئَةَ (برائی کو) ... فَإِذَا الَّذِي بَيْنَكَ وبَيْنَهُ عَداوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ (تو اچانک وہ شخص جس کے اور تمہارے درمیان دشمنی تھی، گویا وہ ایک گہرا دوست ہے) (فصلت: ۳۴)۔ وَما يُلَقَّاها (اور یہ صفت نہیں دی جاتی) إِلَّا الَّذِينَ صَبَرُوا (مگر ان لوگوں کو جو صبر کرتے ہیں) (فصلت: ۳۵)۔ یعنی جنہوں نے اپنے آپ کو اس بات سے روکا کہ وہ برائی کرنے والے کو برائی کا بدلہ برائی سے دیں۔\n\nاگر لوگ اس قدر کو جان لیتے جس پر ہم نے اس مسئلے میں تنبیہ کی ہے، تو کوئی بھی شخص اس شخص کو برائی کا بدلہ برائی سے نہ دیتا جس نے اس کے ساتھ برا کیا ہو۔ پس تم دنیا میں صرف عفو کرنے والے اور اصلاح کرنے والے کو ہی دیکھتے، لیکن بصیرت کی آنکھوں پر پردے گہرے ہیں، اور وہ صرف اغراض اور جلد بدلہ لینے اور مواخذہ کرنے کی خواہشات ہیں۔\n\nاگر یہ دیکھنے والا اس برائی پر غور کرتا جو اس نے اللہ کے ساتھ کی ہے، اس کے احکام کو رد کرنے میں اور اس میں خطرہ مول لینے میں، اور حق کا اسے مہلت دینا اور اس دنیا میں اس سے درگزر کرنا، یہاں تک کہ وہ خود ہی اپنے آپ کو بے نقاب کر دے تاکہ اس پر حدود قائم کی جائیں، اور وہ خود کو ہلاکتوں میں ڈال دے، جیسا کہ ایک صحابی نے زنا کا اعتراف کرنے والے کے حق میں کہا تھا: \"اللہ نے اس پر پردہ ڈالا تھا، کاش وہ خود پر پردہ ڈالتا۔\"\n\nاور بے شک لکھنے والے فرشتے بندے کے برے افعال میں سے صرف وہی لکھتے ہیں جو وہ زبان سے کہتا ہے، اور وہ اس کا قول ہے: ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ (وہ کوئی بات نہیں کہتا مگر اس کے پاس ایک نگہبان تیار ہوتا ہے) (ق: ۱۸)، اور وہ لکھنے والا ہے۔ اگرچہ وہ يَعْلَمُونَ ما تَفْعَلُونَ (جانتے ہیں جو تم کرتے ہو)، لیکن یہ نہیں کہا کہ وہ لکھتے ہیں۔\n\nپھر یہ اللہ کے کرم میں سے ہے کہ کشف (الکشف) عطا کیا گیا ہے، اور اس بارے میں خبر وارد ہوئی ہے کہ جب بندہ کوئی برائی کرتا ہے تو فرشتہ اپنے ساتھی سے کہتا ہے جسے حق نے برائی لکھنے کے لیے اس سے اجازت لینے کا حکم دیا ہے: \"کیا میں لکھوں؟\" تو وہ کہتا ہے: \"نہ لکھو، اور اسے چھ گھڑی تک دیکھو، اس کے برائی کرنے کے وقت سے۔ اگر اس نے توبہ کر لی یا استغفار کر لیا تو اسے نہ لکھو، اور اگر اس پر چھ گھڑیاں گزر گئیں اور اس نے استغفار نہیں کیا تو اسے ایک برائی لکھ دو۔\"\n\nاور ہم اسے نہیں لکھتے مگر جب وہ اسے زبان سے ادا کرے، کہے کہ میں نے ایسا کیا، یا برائی قول میں ہو، تو اس وقت کے گزرنے کے بعد لکھی جاتی ہے۔ اور کون سا مؤمن ہے جس پر چھ گھڑیاں گزر جائیں اور وہ اس میں اللہ سے استغفار نہ کرے؟\n\nپس اس قسم کے شخص کے لیے اللہ پر دو پہلوؤں سے اجر ہے: عفو کا اجر، اور اللہ کی طرف سے عفو کا اجر بہت زیادہ ہے، کیونکہ یہ اضداد میں سے ہے۔ اور اصلاح کا اجر، اور وہ اس کے ساتھ احسان کرنا ہے جو اس برائی کے موجب کو زائل کر دے جو اس کے ساتھ برائی کرنے کا سبب بنی تھی۔ اور اللہ احسان کرنے والوں سے محبت کرتا ہے۔ اگر اس احسان میں، جسے اصلاح سے تعبیر کیا گیا ہے، صرف اللہ کی محبت کا حصول نہ ہوتا، جس کے برابر کوئی چیز نہیں، تو بھی یہ عظیم ہوتا۔\n\nپس اس صفت والے شخص کا اجر اللہ پر ایک محب کا اپنے محبوب کو دیا جانے والا اجر ہوگا، اور محبت کے مرتبے سے جو کچھ ملتا ہے وہ کافی ہے۔ کوئی بھی شخص اس اجر کا اندازہ نہیں لگا سکتا جو محب اپنے محبوب کو عطا کرتا ہے۔\n\nپس ہم نے ان لوگوں کی طرف اشارہ کیا جن کا اجر اللہ پر ہے، انتہائی مختصر عبارت میں، اختصار کی طلب میں۔ کیونکہ یہ مقام عظیم ہے اور مراتب (المنازلة) بڑے ہیں۔ وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے) (الاحزاب: ۴)۔",
    "fa": "«باب چهارصد و هفدهم در معرفت مقام کسی که پاداشش بر عهده خداوند است»\n\n> پاداش رسالت محقق است *** اما بر عهده خداوندی است که او را به کار می‌گیرد\n\n> این همان عدلی است که بر آن *** اعیان هستی (أعيان كون) برپا شده و همواره آن را لازم می‌دارد\n\n> عفو و صلح نیکو، حقی را که *** بر عهده کسی است که بر آن حکم می‌راند، از میان برمی‌دارد\n\n> اگر عفو را محدود کنی، اندک است؛ و عفو *** خداوند گنجی است نزد کسی که آن را می‌فهمد\n\n### [همانا خداوند بر بندگانش به سبب هدایتشان به ایمان، منت (لطف) دارد]\n\nخداوند متعال می‌فرماید: «فَمَنْ عَفا وأَصْلَحَ فَأَجْرُهُ عَلَى الله» (پس هر کس درگذرد و صلح کند، پاداش او بر عهده خداوند است). و عز و جل می‌فرماید: «ومن يَخْرُجْ من بَيْتِهِ مُهاجِراً إِلَى الله ورَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى الله» (و هر کس از خانه‌اش به قصد هجرت به سوی خدا و رسولش خارج شود، سپس مرگ او را دریابد، قطعاً پاداش او بر عهده خداوند است). و خداوند در کتاب خود از هر رسولی از رسولانش (علیهم السلام) خبر داده است که به امتش گفت: «وما أَسْئَلُكُمْ عَلَيْهِ من أَجْرٍ» (و من در برابر آن [رسالت] از شما پاداشی نمی‌خواهم) در آنچه از جانب خداوند به ایشان رسانده است، «إِنْ أَجْرِيَ إِلَّا عَلَى الله» (پاداش من جز بر عهده خداوند نیست). زیرا او تعالی کسی است که او را در امر تبلیغ به کار گرفته است. پس بدان که خداوند متعال بر بندگانش منت (المنة) دارد که آنان را به ایمان به رسولانش هدایت کرده است. از این رو، شکر خداوند و حق رسول بر آنان واجب است. خداوند این حق را از جانب مؤمنان تضمین می‌کند؛ به این صورت که پاداش رسولش (صلی الله علیه و سلم) را بر عهده خود قرار داده و در آن پاداش، آنچه را که بر مؤمنان از حق‌شناسی نسبت به رسول واجب است، به دلیل هدایتی که خداوند به واسطه او به ایشان رسانده، گنجانده است. پس او (صلی الله علیه و سلم) را در جایگاه کسی قرار داده که پاداش مضاعف دارد: پاداش تبلیغ و پاداش آنچه حق (الحق) به نیابت از مؤمنان در آن قیام کرده است، زیرا او وکیل (الوکيل) است، تعالی از امر ما به او به این قول: «فَاتَّخِذْهُ وَكِيلًا» (پس او را وکیل خود بگیر)، بدون اینکه چیزی از نعمت‌های مؤمنان کاسته شود.\n\n### [پاداش تبلیغ به اندازه مشقتی است که در رساندن پیام متحمل شده است]\n\nپس بدان که پاداش تبلیغ به اندازه مشقتی است که رسول در رساندن پیام از سوی مخالفان امتش که به سوی آنان مبعوث شده، متحمل شده است. و هیچ کس جز خداوند قدر آن مشقت را برای هر رسولی نمی‌داند و تعیین نمی‌شود. اما آنچه خداوند به او می‌دهد از آنچه مؤمنان باید در مقابل او انجام می‌دادند، بر دو نوع است:\n\nنوع اول: به اندازه معرفت (المعرفة) مؤمنان به منزلت رسول نزد کسی است که او را به سوی ایشان فرستاده، یعنی خداوند. زیرا خداوند متعال برخی از آنان را بر برخی دیگر برتری داده است.\n\nنوع دوم: به اندازه آنچه رسول در رسالت خود آورده است، از بشارتی که برای صاحب آن صفتی است که هر کس آن را داشته باشد، نزد خداوند سعادتمند خواهد بود. پس آنچه آن شخص باید در مقابل رسول انجام می‌داد، همان چیزی است که حق (الحق) به او می‌دهد. اگر حال مؤمن با قدر رسالت برابر باشد، پاداش کامل است؛ و اگر حال او از تعظیمی که آن رسالت اقتضا می‌کند، کوتاهی کند، خداوند به کرم خود به جهل جاهل نسبت به قدر عظیم آن رسالت نمی‌نگرد، بلکه حق تعالی پاداش او را به اندازه علمش در آن رسالت به او می‌دهد. و ما شک نداریم که خداوند در هر چیزی برتری (المفاضلة) قرار داده است، و عالی و اعلی وجود دارد. اگرچه ایمان به خدا و رسولش و آنچه آورده است، مقامی عالی دارد، اما به تفاوت شاخه‌ها و ابوابش، درجات متفاوتی پیدا می‌کند. زیرا ایمان هفتاد و چند شعبه است؛ پایین‌ترین آن دور کردن آزار از راه است و بالاترین آن گفتن «لا إله إلا الله» است، و آنچه بین این دو است. پس کسی که همه شاخه‌های ایمان را جمع کند، جزای رسول از جانب خداوند در مورد این شخص جامع، به اندازه منازل آن شاخه‌ها نزد خداوند است که به عالی و اعلی آگاه است. پس بنگر که رسول (علیه السلام) چه پاداش‌هایی دارد. پاداش تبلیغ، پاداش استحقاق است.\n\nزیرا رسول خدا (صلی الله علیه و سلم) می‌فرماید: «إن أحق ما أخذتم عليه أجرا كتاب الله» (سزاوارترین چیزی که در برابر آن پاداش می‌گیرید، کتاب خداست).\n\nو اما کسی از صحابه که درباره امری سؤال کرد که در مورد آن قرآنی نازل نشده بود، و به خاطر سؤال او قرآن نازل شد، رسول بر آن سؤال‌کننده پاداش استحقاقی دارد که خداوند آن را به نیابت از او، علاوه بر پاداشی که از جانب خدا دارد، به رسول می‌دهد. و اما کسی از امتش که رسالت او را رد کرد، رسول نزد خداوند پاداش مصیبت نیز دارد. و برای مصیبت‌دیده در آنچه دوست دارد، پاداشی است، پس پاداش او نیز بر عهده خداوند است، به تعداد کسانی از امتش که آن را رد کردند، هر چقدر که بودند. و او از پاداش مصیبت‌دیده، پاداش مصیبت‌های گناهکاران را دارد، زیرا این نوعی از انواع بلاها (الرزایا) در حق اوست. زیرا او امری را نیاورده است که عمل به آن را طلب کند، مگر اینکه کسی که عمل به آن را ترک کند، گناه کرده است. پس رسول پاداش مصیبت و بلا را دارد. و وفای به همه اینها برای هر رسولی بر عهده خداوند است.\n\n### «نوع دوم» از کسانی که پاداششان بر عهده خداوند است، و او مهاجری است که پیش از رسیدن به منزلی که به سوی آن هجرت کرده، می‌میرد.\n\nپاداش او بر عهده خداوند است، به اندازه انگیزه‌ای که او را به هجرت واداشته است، و مردم در این امر با هم متفاوتند. سپس خداوند به نیابت از رسولش، آنچه را که باید از پاداش به او بدهد، به مهاجر می‌دهد، زیرا او به سوی خدا و رسولش مهاجرت کرده است. سپس او پاداش از دست دادن (الفوت) به واسطه مرگی که او را دریافته، دارد، و این از جانب خداوند است، زیرا اوست که او را دچار بلا کرده و بین او و رسیدن به مقصد هجرتش حائل شده است، پس دیه (جبران) بر عهده اوست. اگر این کسی که می‌میرد، عالم و عاقل باشد، پس چه چیزی بزرگتر از لقاء الله و رؤیت اوست؟ و چون این امر با مرگ برای او حاصل شده است، در حق او بهتر از آن است که زنده بماند تا برسد، زیرا تا زمانی که در زندگی دنیاست، نمی‌داند که چه احوالی بر او می‌گذرد، چرا که او در محل خطر و تغییر سریع است. در این باب از رسول خدا (صلی الله علیه و سلم) آنچه بخاری از عمر بن خطاب (رضی الله عنه) روایت کرده، صحیح است که رسول خدا (صلی الله علیه و سلم) فرمود: «إنما الأعمال بالنيات وإنما لامرئ ما نوى» (همانا اعمال به نیت‌هاست و برای هر کس همان است که نیت کرده است).\n\n«فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها فهجرته إلى ما هاجر إليه» (پس هر کس هجرتش به سوی خدا و رسولش باشد، هجرتش به سوی خدا و رسولش است؛ و هر کس هجرتش برای دنیایی باشد که به دست آورد یا زنی که با او ازدواج کند، هجرتش به سوی همان چیزی است که به سویش هجرت کرده است).\n\nسپس به این پاداش‌ها، قدر کرم و غنای بخشنده اضافه می‌شود. و این تحت این قول رسول (صلی الله علیه و سلم) قرار می‌گیرد: «إن في الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر» (همانا در بهشت چیزی است که نه چشمی دیده و نه گوشی شنیده و نه بر قلب بشری خطور کرده است)، یعنی از پاداش‌گیرندگان. و تحت این قول خداوند: «وزيادة» (و افزونی) از قول او: «لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ» (برای کسانی که نیکی کردند، نیکی و افزونی است). و این افزونی (زیادة) را حق (الحق) برای هیچ کس تعیین نکرده است. و این پاداش را بر پاداش دیگرانی که پاداششان بر عهده خداوند است، با «وقوع» (وجوب) تأکید کرده است. زیرا پاداش گاهی به اقتضای کرم است بدون وجوب، و گاهی به اقتضای وجوب است. و آنچه به اقتضای وجوب است، بالاتر است، همان‌طور که فرایض نزد خداوند بالاتر و محبوب‌تر از نوافل هستند.\n\nدر خبر صحیح آمده است که خداوند متعال می‌فرماید: «ما نقرب إلى أحد بأحب إلي مما افترضته عليه» (هیچ کس با چیزی محبوب‌تر از آنچه بر او واجب کرده‌ام، به من نزدیک نمی‌شود)، پس آن را نزد خود محبوب‌تر قرار داد. سپس فرمود: «ولا يزال العبد يتقرب إلي بالنوافل حتى أحبه فإذا أحببته كنت سمعه وبصره» (و بنده پیوسته با نوافل به من نزدیک می‌شود تا اینکه او را دوست بدارم. پس چون او را دوست بدارم، گوش و چشم او خواهم بود).\n\nاین نتیجه نوافل است. پس گمانت به نتیجه فرایض چیست؟ و آن این است که بنده گوش و چشم حق (الحق) باشد. و ما صورت آن را در گذشته بیان کرده‌ایم. پس حق (الحق) با اراده بنده اراده می‌کند. و این مقام را عرب در حق محمد (صلی الله علیه و سلم) ذکر کرده است. و در نوافل، بنده با اراده حق اراده می‌کند. و معنای آنچه ما به آن رسیده‌ایم، در متصف شدن حق به صفات مخلوق و در وجه دیگر، متصف شدن بنده به صفات حق (الحق) آشکار می‌شود، و این در شریعت موجود است.\n\n### «نوع سوم» از کسانی که پاداششان بر عهده خداوند است، و او کسی است که از کسی که به او بدی کرده، درگذرد و اصلاح کند.\n\nیعنی حال کسی که به او بدی کرده را با احسان اصلاح کند، پس آنچه را که موجب بدی کردن به او شده بود، از او اصلاح نماید. منظور از «أصلح» (اصلاح کرد) در اینجا جز این نیست. و این مقام جز برای کسی که همت عالی دارد، حاصل نمی‌شود. زیرا خداوند به او اجازه داده است که بدی‌کننده را به اندازه بدی‌اش مجازات کند، اما او بر خود روا نمی‌دارد که محل اتصاف به آنچه حق (الحق) آن را «سیئه» (بدی) نامیده، باشد.\n\n> جان کریم در هر آنچه *** خواهش‌ها و تقدیرها بر آن جاری می‌شود، کریم است\n\n> و خداوند در مورد جان‌ها به اندازه قدرشان حکم می‌کند *** و اوست که از حکم خود برمی‌گزیند\n\n> پس صاحب خردی که عقلش اجازه می‌دهد، می‌آید *** چیزی غیر از آنچه حکم کرده‌ای، پس حیران می‌شود\n\nخداوند متعال در این مقام می‌فرماید: «ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ» (بدی را با بهترین شیوه دفع کن)، یعنی قول او: «وأصلح السَّيِّئَةَ ... فَإِذَا الَّذِي بَيْنَكَ وبَيْنَهُ عَداوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ» (و بدی را اصلاح کن... پس ناگهان کسی که میان تو و او دشمنی است، گویی دوست صمیمی است). «وما يُلَقَّاها» (و به این صفت دست نمی‌یابند) «إِلَّا الَّذِينَ صَبَرُوا» (مگر کسانی که صبر کردند)، یعنی خود را از مجازات بدی‌کننده به بدی، باز داشتند. اگر مردم قدر آنچه را که در این مسئله به آن اشاره کردیم، می‌دانستند، هیچ کس بدی‌کننده به خود را با بدی مجازات نمی‌کرد. در این صورت در جهان جز عفوکننده و اصلاح‌گر نمی‌دیدی. اما حجاب‌ها بر دیدگان بصیرت‌ها ضخیم است و این حجاب‌ها چیزی جز اغراض و شتاب در انتقام‌جویی و مؤاخذه نیست. اگر این ناظر به بدی‌هایی که خود در رد آنچه خداوند او را مکلف کرده و در خطر افتادن در آن، بر خداوند روا داشته است، و مهلت دادن حق (الحق) به او و گذشت از او در این دنیا، نگاه می‌کرد، تا جایی که خود او پرده از کار خود برمی‌دارد تا حدود بر او جاری شود و خود را به هلاکت می‌اندازد، همان‌طور که صحابی گفت: «خداوند بر او پرده پوشیده بود، اگر او نیز بر خود پرده می‌پوشید» در مورد کسی که به زنا اعتراف کرد.\n\nو همانا فرشتگان نویسنده، از اعمال بد بنده، جز آنچه را که به زبان آورده، نمی‌نویسند، و آن قول خداوند است: «ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ» (هیچ سخنی بر زبان نمی‌آورد مگر اینکه نزد او نگهبان آماده‌ای است)، و او همان نویسنده است، اگرچه «يَعْلَمُونَ ما تَفْعَلُونَ» (آنچه را انجام می‌دهید می‌دانند)، اما نفرموده است که می‌نویسند. سپس از کرم خداوند است که کشف (الکشف) عطا شده است و در این باره خبری وارد شده است که بنده چون کار بدی انجام دهد، فرشته به صاحبش که حق (الحق) به او امر کرده است تا برای نوشتن بدی از او اجازه بگیرد، می‌گوید: آیا بنویسم؟ او می‌گوید: ننویس و او را شش ساعت از زمان انجام بدی مهلت بده. اگر توبه کرد یا استغفار نمود، آن را ننویس. و اگر شش ساعت بر او گذشت و استغفار نکرد، آن را یک بدی بنویس.\n\nو ما آن را نمی‌نویسیم مگر زمانی که بنده آن را به زبان آورد، مثلاً بگوید: فلان کار را کردم، یا بدی در گفتار باشد، که پس از گذشت این مدت زمان نوشته می‌شود. و کدام مؤمنی است که شش ساعت بر او بگذرد و در آن استغفار نکند؟ پس برای این نوع (عفوکننده و اصلاح‌گر) پاداشی بر عهده خداوند است از دو جهت: پاداش عفو، و پاداش عفو از جانب خداوند بسیار است، زیرا از اضداد است؛ و پاداش اصلاح، که همان احسان به بدی‌کننده است که موجب بدی کردن او را از بین می‌برد. و خداوند نیکوکاران (المحسنین) را دوست دارد. و اگر در احسان او که به «اصلاح» تعبیر شده است، جز حصول محبت خداوند نسبت به او که هیچ چیز با آن برابری نمی‌کند، نبود، باز هم عظیم بود. پس پاداش کسی که صفتش این است، بر عهده خداوند، پاداش محب برای محبوب است. و آنچه منزلت محبت (الحب) می‌بخشد، کافی است. هیچ کس نمی‌تواند پاداشی را که محب به محبوبش می‌دهد، اندازه‌گیری کند. ما به کسی که پاداشش بر عهده خداوند است، با موجزترین عبارت اشاره کردیم، به دلیل طلب اختصار، زیرا مقام عظیم و منازل بزرگ است. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}