{
  "id": 302,
  "title": {
    "ar": "الباب الثاني وثلاثمائة في معرفة منزل ذهاب العالم الأعلى ووجود العالم الأسفل من الحضرة المحمدية والموسوية والعيسوية",
    "en": "Chapter Three Hundred and Two: Concerning the Gnosis (المعرفة) of the station (منزل) of the passing away of the Higher World (العالم الأعلى) and the existence (وجود) of the Lower World (العالم الأسفل), derived from the Muhammadan Presence (الحضرة المحمدية), the Mosaic Presence (الحضرة الموسوية), and the Isaian Presence (الحضرة العيسوية).",
    "ur": "باب تین سو دو: عالم بالا کے زوال اور عالم اسفل کے وجود کے مقام کی معرفت میں، جو حضرت محمدیہ، حضرت موسویہ اور حضرت عیسویہ سے ہے۔",
    "fa": "باب سیصد و دوم در معرفت منزلگاه زوال عالم بالا و وجود عالم پایین از حضرت محمدیه (الحضرة المحمدية)، موسویه (الموسوية) و عیسویه (العيسوية)."
  },
  "content": {
    "ar": "## «الباب الثاني وثلاثمائة في معرفة منزل ذهاب العالم الأعلى ووجود العالم الأسفل من الحضرة المحمدية والموسوية والعيسوية»\n\n\n> منزل تلقين الحجج *** منزل من كان درج‏\n\n\n> فلا تكن كمثل من *** إن فتح الباب خرج‏\n\n\n> والزم وكن كمثل من *** إن فتح الباب ولج‏\n\n\n> من لاذ بالله احتمى *** ومن ألح يندرج‏\n\n\n> في كل ما تسأله *** من كل ضيق وفرج‏\n\n\n> قد قيل ذا في مثل *** بأن من أدلج حج‏\n\n\n> في مثل هذا يا أخي *** تفني النفوس والمهج‏\n\n\n> كم من لبيب هالك *** في بحره وسط اللجج‏\n\n\n> وما على نفس ترى *** فيه الهلاك من حرج‏\n\n\n### [إن عالم الشهادة عبارة عن كل موجود سوى الله تعالى‏]\n\n\nاعلم أن الغيب ظرف لعالم الشهادة وعالم الشهادة هنا كل موجود سوى الله تعالى مما وجد ولم يوجد أو وجد ثم رد إلى الغيب كالصور والأعراض وهو مشهود لله تعالى ولهذا قلنا إنه عالم الشهادة ولا يزال الحق سبحانه يخرج العالم من الغيب شيئا بعد شي‏ء إلى ما لا يتناهى عددا من أشخاص الأجناس والأنواع ومنها ما يرده إلى غيبة ومنها ما لا يرده أبدا فالذي لا يرده أبدا إلى الغيب كل ذات قائمة بنفسها وليس إلا الجواهر خاصة وكل ما عدا الجواهر من الأجسام والأعراض الكونية واللونية فإنها ترد إلى الغيب ويبرز أمثالها والله يخرجها من الغيب إلى شهادتها\nأنفسها فهو عالِمُ الْغَيْبِ والشَّهادَةِ والأشياء في الغيب لا كمية لها إذ الكمية تقتضي الحصر فيقال كم كذا وكذا وهذا لا ينطلق عليها في الغيب فإنها غير متناهية فكم وكيف والأين والزمان والوضع والإضافة والعرض وأن يفعل وأن ينفعل كل ذلك نسب لا أعيان لها فيظهر حكمها بظهور الجوهر لنفسه إذا أبرزه الحق من غيبه فإذا ظهرت أعين الجواهر تبعتها هذه النسب فقيل كم عين ظهرت فقيل عشرة أو أكثر أو أقل فقيل كيف هي فقيل مؤلفة فعرض لها الجسمية فصحت الكيفية بالجسمية وحلول الكون واللون فقيل أين فقيل في الحيز أو المكان فقيل متى فقيل حين كان كذا في صورة كذا فقيل ما لسانه فقيل أعجمي أو عربي فقيل ما دينه فقيل شريعة كذا فقيل هل ظهر منه ما يكون من ظهور آباء كما ظهر هو من غيره فقيل هو ابن فلان قيل ما فعل قيل أكل قيل ما انفعل عن أكله قيل شبع فهذه جملة النسب التي تعرض للجواهر إذا أخرجها الله من غيبه فليس في الوجود المحدث إلا أعيان الجوهر والنسب التي تتبعه فكان الغيب بما فيه كأنه يحوي على صورة مطابقة لعالمه إذ كان علمه بنفسه علمه بالعالم فبرز العالم على صورة العالم من كونه عالما به فصورته من الجوهر ذاته ومن الكم عدد أسمائه ومن الكيف قوله كُلَّ يَوْمٍ هُوَ في\n\n\nشَأْنٍ وسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ والرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ وأمثال هذا فيما أخبر به عن نفسه كثير والأين كان الله في عماء وهو الله في السماء والزمان كان الله في الأزل والوضع وكَلَّمَ الله مُوسى‏ تَكْلِيماً فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله فجميع الشرائع وضعه والإضافة خالق الخلق مالِكَ الْمُلْكِ وأن يفعل بيده الميزان يخفض القسط ويرفعه وأن ينفعل يدعى فيجيب ويسأل فيعطي ويستغفر فيغفر وهذه كلها صورة العالم وكل ما سوى الله قد ظهر على صورة موجدة فما أظهر إلا نفسه فالعالم مظهر الحق على الكمال فليس في الإمكان أبدع من هذا العالم إذ ليس أكمل من الحق تعالى فلو كان في الإمكان أكمل من هذا العالم لكان ثم من هو أكمل من موجدة وما ثم إلا الله فليس في الإمكان إلا مثل ما ظهر لا أكمل منه فتدبر ما قلته فهو لباب المعرفة بالله ثم إن الله اختصر من هذا العالم مختصرا مجموعا يحوي على معانيه كلها من أكمل الوجوه سماه آدم وقال إنه خلقه على صورته فالإنسان مجموع العالم وهو الإنسان الصغير والعالم الإنسان الكبير أو سم الإنسان العالم الصغير كيفما شئت إذا عرفت الأمر كما هو عليه في نفسه وعينه فانسب إليه واصطلح كما تريد فلا فضل للإنسان على العالم بجملته والعالم أفضل من الإنسان لأنه يزيد عليه درجة وهي أن الإنسان وجد عن العالم الكبير فله عليه درجة السببية لأنه عنه تولد قال تعالى ولِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ لأن حواء صدرت من آدم فلم تزل الدرجة تصحبه عليها في الذكورة على الأنوثة وإن كانت الأم سببا في وجود الابن فابنها يزيد عليها بدرجة الذكورة لأنه أشبه أباه من جميع الوجوه فوجب على الإنسان تعظيم أبويه فأمه العالم بأسره وأبوه معروف غير منكور والنكاح التوجه فخرج الولد على صورة أبويه ولما كان الولد لا يدعى إلا لأبيه لا ينسب إلى أمه لأن الأب له الدرجة وله العلو فينسب إلى الأشرف ولما لم يتمكن لعيسى عليه السلام إن ينسب إلى من وهبه لها بشرا سويا أعطيت أمه الكمال وهو المقام الأشرف فنسب عيسى إليها فقيل عيسى ابن مريم فكان لها هذا الشرف بالكمال مقام الدرجة التي شرف بها الرجال على النساء فنسب الابن إلى أبيه لأجلها وكمال مريم شهد لها بذلك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ولآسية امرأة فرعون فأما كمال آسية فلشرف المقام الذي ادعاه فرعون فلم يكن ينبغي لذلك المقام أن يكون العرش الذي يستوي عليه إلا موصوفا بالكمال فحصل لآسية الكمال بشرف المقام الذي شقي به فرعون ولحق بالخسران المبين وفازت امرأته بالسعادة ولشرف المقام الذي حصل لها به الكمال قالَتْ رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً في الْجَنَّةِ فما أنطقها إلا قوة المقام بعندك ولم تطلب مجاورة موسى ولاحد من المخلوقين ولم يكن ينبغي لها ذلك فإن الحال يغلب عليها فإن الكامل لا يكون تحت الكامل فإن التحتية نزول درجة ولما كان كمال مريم بعيسى‏\n\n\nفي نسبته إليها لم تقل ما قالت آسية آسية تقول نَجِّنِي من فِرْعَوْنَ وعَمَلِهِ ونَجِّنِي من الْقَوْمِ الظَّالِمِينَ حتى لا تنتهك حرمة النسبة ومريم تقول يا لَيْتَنِي مِتُّ قَبْلَ هذا وكُنْتُ نَسْياً مَنْسِيًّا وهي بريئة في نفس الأمر عند الله فما قالت ذلك من أجل الله كما قالت آسية عِنْدَكَ فقدمته وطلبت جواره والعصمة من أيدي عداته ولكن‏\nقالت ذلك مريم حياء من الناس لما علمته من طهارة بيتها وآبائها فخافت من إلحاق العار بهم من أجلها ولما ذكرنا أن العالم كان مستورا في غيب الله وكان ذلك الغيب بمنزلة الظل للشخص فلو سلخ من الظل جميعه أمر ما لخرج على صورة الظل والظل على صورة ما هو ظل له فالخارج من الظل المسلوخ منه على صورة الشخص أ لا ترى النهار لما سلخ من الليل ظهر نورا فظهرت الأشياء التي كانت مستورة بالليل ظهرت بنور النهار فلم يشبه النهار الليل وأشبه النور في ظهور الأشياء به فالليل كان ظل النور والنهار خرج لما سلخ من الليل على صورة النور كذلك العالم في خروجه من الغيب خرج على صورة العالم بالغيب كما قررناه فقد تبين لك من العلم بالله من هذا المقام ما فيه كفاية إن عرفت قدره فَلا تَكُونَنَّ من الْجاهِلِينَ وأما مسألة روح صورة هذا العالم وأرواح صور العالم العلوي والسفلي فها أنا أبسطها لك في هذه المسألة من هذا المنزل في الدرجة الثامنة منه فإن هذا المنزل يحوي على سبعة عشر صنفا من العلم هذا أحدها فنقول إن روح العالم الكبير هو الغيب الذي خرج عنه فافهم ويكفيك أنه المظهر الأكبر الأعلى إن عقلت وعرفت قوله أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وبعد أن بان لك روح العالم الكبير فبقي لك أن تعلم أرواح صور العالم هل هي موجودة عن صورة أو قبلها أو معها ومنزلة الأرواح من صور العالم كمنزلة أرواح صور أعضاء الإنسان الصغير كالقدرة روح اليد والسمع روح الأذن والبصر روح العين‏\n\n\n### [إن الأرواح المدبرة للصور كانت موجودة في حضرة الجمال‏]\n\n\nفاعلم إن الناس اختلفوا في هذه المسألة على ما ذكرنا تفصيله والتحقيق في ذلك عندنا إن الأرواح المدبرة للصور كانت موجودة في حضرة الجمال غير مفصلة لأعيانها مفصلة عند الله في علمه فكانت في حضرة الإجمال كالحروف الموجودة بالقوة في المداد فلم تتميز لأنفسها وإن كانت متميزة عند الله مفصلة في حال إجمالها فإذا كتب القلم في اللوح ظهر صور الحروف مفصلة بعد ما كانت مجملة في المداد فقيل هذا ألف وباء وجيم ودال في البسائط وهي أرواح البسائط وقيل هذا قام وهذا زيد وهذا خرج وهذا عمرو وهي أرواح الأجسام المركبة ولما سوى الله صور العالم أي عالم شاء كان الروح الكل كالقلم واليمين الكاتبة والأرواح كالمداد في القلم والصور كمنازل الحروف في اللوح فنفخ الروح في صور العالم فظهرت الأرواح متميزة بصورها فقيل هذا زيد وهذا عمرو وهذا فرس وهذا فيل وهذه حية وكل ذي روح وما ثم إلا ذو روح لكنه مدرك وغير مدرك فمن الناس من قال إن الأرواح في أصل وجودها متولدة من مزاج الصورة ومن الناس من منع من ذلك ولكل واحد وجه يستند إليه في ذلك والطريقة الوسطى ما ذهبنا إليه وهو قوله ثُمَّ أَنْشَأْناهُ خَلْقاً آخَرَ وإذا سوى الله الصور الجسمية ففي أية صورة شاء من الصور الروحية ركبها إن شاء في صورة خنزير أو كلب أو إنسان أو فرس على ما قدره العزيز العليم فثم شخص الغالب عليه البلادة والبهيمية فروحه روح حمار وبه يدعى إذا ظهر حكم ذلك الروح فيقال فلان حمار وكذلك كل صفة تُدْعى‏ إِلى‏ كِتابِهَا فيقال فلان كلب وفلان أسد وفلان إنسان وهو أكمل الصفات وأكمل الأرواح قال تعالى الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ وتمت النشأة الظاهرة للبصر في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ من صور الأرواح فتنسب إليها كما ذكرنا وهي معينة عند الله فامتازت الأرواح بصورها ثم إنه إذا فارقت هذه المواد فطائفة من أصحابنا تقول إن الأرواح تتجرد عن المواد تجردا كليا وتعود إلى أصلها كما تعود شعاعات الشمس المتولدة عن الجسم الصيقل إذا صدأ إلى الشمس واختلفوا هنا على طريقين فطائفة قالت لا تمتاز بعد المفارقة لأنفسها كما لا يمتاز ماء الأوعية التي على شاطئ النهر إذا تكسرت فرجع ماؤها إلى النهر فالأجسام تلك الأوعية والماء الذي ملئت به من ذلك النهر كالأرواح من الروح الكل وقالت طائفة بل تكتسب بمجاورتها الجسم هيئات رديئة وحسنة فتمتاز بتلك إلهيات إذا فارقت الأجسام كما إن ذلك الماء إذا كان في الأوعية أمور تغيره عن حالته إما في لونه أو رائحته أو طعمه فإذا فارق الأوعية صحبه في ذاته ما اكتسبه من الرائحة أو الطعم أو اللون وحفظ الله عليها تلك الهيئات المكتسبة ووافقوا في ذلك بعض الحكماء وطائفة قالت الأرواح المدبرة لا تزال مدبرة في عالم الدنيا فإذا انتقلت إلى البرزخ دبرت أجسادا برزخية وهي الصورة التي يرى الإنسان نفسه فيها في النوم وكذلك هو الموت وهو المعبر عنه بالصور ثم تبعث يوم القيامة في الأجسام الطبيعية كما كانت في الدنيا وإلى هنا انتهى خلاف أصحابنا في الأرواح بعد المفارقة وأما اختلاف غير أصحابنا في ذلك فكثير وليس مقصودنا إيراد كلام من ليس من‏\n### [إن الجنة التي يصل إليها من هو من أهلها في الآخرة هي مشهودة اليوم‏]\n\n\nواعلم يا أخي تولاك الله برحمته إن الجنة التي يصل إليها من هو من أهلها في الآخرة هي مشهودة اليوم لك من حيث محلها لا من حيث صورتها فأنت فيها تتقلب على الحال التي أنت عليها ولا تعلم أنك فيها فإن الصورة تحجبك التي تجلت لك فيها فأهل الكشف الذين أدركوا ما غاب عنه الناس يرون ذلك المحل إن كان جنة روضة خضراء وإن كان جهنما يرونها بحسب ما يكون فيه من نعوت زمهريرها وحرورها وما أعد الله فيها وأكثر أهل الكشف في ابتداء الطريق يرون هذا وقد نبه الشرع على ذلك‏\n\n\nبقوله بين قبري ومنبري روضة من رياض الجنة\n\n\nفأهل الكشف يرونها روضة كما قال‏\n\n\nويرون نهر النيل والفرات وسيحان وجيحان نهر عسل وماء وخمر ولبن كما هو في الجنة فإن النبي صَلَّى اللهُ عَليهِ وسَلَّم أخبر أن هذه الأنهار من الجنة\n\n\nومن لم يكشف الله عن بصره وبقي في عمى حجابه لا يدرك ذلك مثل الأعمى يكون في بستان فما هو غائب عنه بذاته ولا يراه فلم يلزم من كونه لا يراه أنه لا يكون فيه بل هو فيه وكذلك تلك الأماكن التي ذكر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنها من النار كبطن محسر بمنى وغيره ولهذا شرع الإسراع في الخروج عنه لأمته فإنه صَلَّى اللهُ عَليهِ وسَلَّم يرى ما لا يرون ويشهد ما لا يشهدون ومن الناس من يستصحبه هذا الكشف ومنهم من لا يستصحبه على ما قد أراده الله من ذلك لحكمة أخفاها في خلقه أ لا ترى أهل الورع إذا حماهم الله عن أكل الحرام من بعض علاماته عندهم إن يتغير في نظره ذلك المطعوم إلى صورة محرمة عليه فيراه دما أو خنزيرا مثلا فيمتنع من أكله فإذا بحث عن كسب ذلك الطعام وجده مكتسبا على غير الطريقة المشروعة في اكتسابه فلأهل الله تعالى أَعْيُنٌ يُبْصِرُونَ بِها وآذانٌ يَسْمَعُونَ بِها وقُلُوبٌ يَعْقِلُونَ بِها وألسنة يتكلمون بها غير ما هي هذه الأعين والآذان والقلوب والألسنة عليه من الصورة فبتلك الأعين يشهدون وبتلك الآذان يسمعون وبتلك القلوب يعقلون وبتلك الألسنة يتكلمون فكلامهم مصيب فَإِنَّها لا تَعْمَى الْأَبْصارُ ولكِنْ تَعْمَى الْقُلُوبُ الَّتِي في الصُّدُورِ عن الحق والأخذ به صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَعْقِلُونَ عن الله فَهُمْ لا يَرْجِعُونَ إلى الله وو الله إن عيونهم لفي وجوههم وإن سمعهم لفي آذانهم وإن ألسنتهم لفي أفواههم ولكن العناية ما سبقت لهم ولا الحسنى فالحمد لله شكرا حيث حيانا بتلك القلوب والألسن والآذان والأعين ولقد ورد في حديث نبوي عند أهل الكشف صحيح وإن لم يثبت طريقه عند أهل النقل لضعف الراوي ولو صدق فيه قال‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لو لا تزييد في حديثكم وتمريج في قلوبكم لرأيتم ما أرى ولسمعتم ما أسمع‏\n\n\nقال الله تعالى لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ وأكثر من هذا البيان الصريح ما يكون لكن أين من يفرغ محله لآثار ربه أين من ينقل ما يسمع من غير زيادة فيه هذا قليل جدا والله ولي التوفيق‏\n\n\n### [علم التحليل‏]\n\n\nواعلم أن هذا المنزل يتضمن علم التحليل وعلم ما يحصل لأهل النار في النار من العلوم إذا دخلوها وعلم ما يعطيه عالم الطبيعة من الأسرار الإلهية التي لا تعلم من غيره وعلم السابقة واللاحقة وهي العاقبة وعلم تركيب البراهين الوجودية وعلم الإيجاد الروحاني والصوري وعلم السبب المؤدي إلى الشقاء وعلم ما يبقى به نظام العالم وحفظ صورته عليه وعلم التجلي في الحجاب وعلم الأحكام الإلهية على غير طريق الشارع وعلم توحيد الأفعال وعلم إلحاق الأعالي بالأسافل والأسافل بالأعالي وهو أو قريب منه علم التحام الأباعد بالأداني والأداني بالأباعد والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 302: Concerning the Knowledge of the Station of the Passing of the Higher World and the Existence of the Lower World, derived from the Muhammadan, Mosaic, and Isaian Presences\n\n> The station of instructing proofs,\n> The station of one who has ascended.\n> So do not be like one\n> Who, when the door is opened, departs.\n> But adhere, and be like one\n> Who, when the door is opened, enters.\n> Whoever seeks refuge in Allah is protected,\n> And whoever persists is enrolled\n> In everything he asks of Him,\n> Concerning every distress and relief.\n> This has been said in a proverb:\n> That whoever travels by night reaches the goal.\n> In such a matter, O my brother,\n> Souls and vital spirits are annihilated.\n> How many an intelligent one perishes\n> In its sea, amidst the deep waters.\n> And there is no blame upon a soul that sees\n> Annihilation therein.\n\n### [The World of Witnessing (عالم الشهادة) is everything existent besides Allah the Exalted]\n\nKnow that the Unseen (الغيب) is the container (ظرف) for the World of Witnessing (عالم الشهادة). The World of Witnessing here is every existent thing besides Allah the Exalted, whether it has come into existence and not yet existed, or has existed and then been returned to the Unseen, such as forms (الصور) and accidents (الأعراض). It is witnessed by Allah the Exalted, and for this reason, we call it the World of Witnessing.\n\nThe Real (الحق), glory be to Him, continuously brings the World out of the Unseen, thing after thing, to an infinite number of individuals of genera and species. Among these are things He returns to their state of Unseenness, and among them are things He never returns. That which He never returns to the Unseen is every essence (ذات) subsisting by itself, and this is exclusively the substances (الجواهر). Everything besides the substances, such as bodies (الأجسام) and the existential and colorific accidents (الأعراض الكونية واللونية), are returned to the Unseen, and their likes are brought forth. Allah brings them out of the Unseen into their own witnessing. Thus, He is the Knower of the Unseen and the Witnessed (عالِمُ الْغَيْبِ والشَّهادَةِ).\n\nThings in the Unseen have no quantity (كمية), since quantity necessitates limitation, so one asks, \"How many of such-and-such?\" This question does not apply to them in the Unseen, for they are infinite. Thus, Quantity (كم), Quality (كيف), Where (أين), Time (الزمان), Position (الوضع), Relation (الإضافة), Accident (العرض), Action (أن يفعل), and Passion (أن ينفعل)—all of these are relations (نسب) that have no fixed entities (أعيان لها). Their ruling appears when the substance (الجوهر) manifests itself, once the Real brings it forth from His Unseen.\n\nWhen the essences (أعين) of the substances appear, these relations follow them. So it is asked, \"How many essences appeared?\" And it is answered, \"Ten, or more, or less.\" Then it is asked, \"What is their quality?\" And it is answered, \"They are compounded,\" so corporeality (الجسمية) occurs to them, and the quality is validated by corporeality and the indwelling of existence and color. Then it is asked, \"Where?\" And it is answered, \"In space or place.\" Then it is asked, \"When?\" And it is answered, \"When such-and-such was in such-and-such a form.\" Then it is asked, \"What is its language?\" And it is answered, \"Foreign or Arabic.\" Then it is asked, \"What is its religion?\" And it is answered, \"The Law (شريعة) of such-and-such.\" Then it is asked, \"Has there appeared from it what appears from the manifestation of fathers, just as it appeared from another?\" And it is answered, \"He is the son of so-and-so.\" It is asked, \"What did he do?\" It is answered, \"He ate.\" It is asked, \"What was the result of his eating?\" It is answered, \"He was satiated.\"\n\nThese are the totality of the relations that occur to the substances when Allah brings them out of His Unseen. Thus, in the originated existence (الوجود المحدث), there are only the essences of the substance and the relations that follow it.\n\nThe Unseen, with all that it contains, is as if it holds a form corresponding to its Knower, since His Knowledge of Himself is His Knowledge of the World. So the World emerged upon the form of the Knower by virtue of His being Knower of it. Its form, in terms of substance, is His Essence (ذاته); and in terms of quantity, it is the number of His Names (أسمائه). And in terms of quality, it is His saying: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is engaged in some affair). And: <<وَسَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> (We shall attend to you, O you two heavy ones [jinn and mankind]). And: <<وَالرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى>> (The Most Merciful is established on the Throne). And there are many similar things He has reported about Himself.\n\nAnd the Where: \"Allah was in a cloud (عماء),\" and \"He is Allah in the heaven.\" And the Time: \"Allah was in pre-eternity (الأزل).\" And the Position: <<وَكَلَّمَ اللَّهُ مُوسَى تَكْلِيمًا>> (And Allah spoke to Moses directly). And: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ>> (Grant him protection until he hears the Word of Allah). Thus, all the Divine Laws (الشرائع) are His Position. And the Relation: \"Creator of creation,\" \"Owner of the Sovereignty (مالِكَ الْمُلْكِ).\" And Action: \"In His Hand is the Balance; He lowers the scale and raises it.\" And Passion: He is called upon, so He answers; He is asked, so He gives; He is sought forgiveness from, so He forgives.\n\nAll of this is the form of the World. Everything besides Allah has appeared upon the form of its Originator, so He has manifested nothing but Himself. Thus, the World is the perfect manifestation (مظهر) of the Real (الحق). There is nothing more wondrous in possibility (الإمكان) than this World, since there is nothing more perfect than the Real, the Exalted. If there were something more perfect in possibility than this World, then there would be someone more perfect than its Originator, and there is none but Allah. Therefore, in possibility, there is only the like of what has appeared, not anything more perfect than it. Reflect upon what I have said, for it is the core (لباب) of Gnosis (المعرفة) of Allah.\n\nThen Allah summarized this World into a comprehensive summary that contains all its meanings in the most perfect manner, and He named it Adam. And He said that He created him upon His form (صورته). Thus, the Human is the totality of the World, and he is the Minor Human (الإنسان الصغير), while the World is the Major Human (الإنسان الكبير). Or call the Human the Minor World (العالم الصغير), however you wish, once you know the matter as it is in its essence and reality (عينه). Then relate to it and use terminology as you desire.\n\nThe Human has no superiority over the World in its entirety. Rather, the World is superior to the Human because it exceeds him by one degree: the Human came into existence from the Major World, so the World has the degree of causality (السببية) over him, because he was generated from it. The Exalted said: <<وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ>> (But men have a degree over them). Because Eve originated from Adam, the degree of superiority has always accompanied him over her, in masculinity over femininity. Even if the mother is a cause for the existence of the son, her son exceeds her by the degree of masculinity because he resembles his father in all respects. Therefore, it is incumbent upon the Human to venerate his two parents: his mother is the World in its entirety, and his father is known, not denied. And the marriage (النكاح) is the turning (التوجه), so the child emerges upon the form of his two parents.\n\nSince the child is only called by his father and not attributed to his mother, because the father has the degree and the elevation (العلو), the child is attributed to the nobler one. Since Jesus (peace be upon him) could not be attributed to the one who bestowed him upon her as a sound human being, his mother was granted perfection (الكمال), which is the noblest station (المقام الأشرف), so Jesus was attributed to her, and he was called Jesus son of Mary. She attained this honor through perfection, which is the station of the degree by which men were honored over women. The son is attributed to his father because of this degree. The perfection of Mary was witnessed by the Messenger of Allah (peace and blessings be upon him), as was the perfection of Asiya, the wife of Pharaoh.\n\nAs for the perfection of Asiya, it was due to the nobility of the station that Pharaoh claimed. It was not fitting for that station that the throne upon which he established himself should be described by anything other than perfection. Thus, Asiya attained perfection through the nobility of the station by which Pharaoh became wretched and incurred manifest loss, while his wife achieved felicity. Due to the nobility of the station through which she attained perfection, she said: <<رَبِّ ابْنِ لِي عِنْدَكَ بَيْتًا فِي الْجَنَّةِ>> (My Lord, build for me near You a house in Paradise). Nothing made her speak but the power of the station of \"near You\" (عِنْدَكَ). She did not ask for proximity to Moses or any other creature. This was not appropriate for her, as the spiritual state (الحال) dominated her. The perfect one (الكامل) cannot be beneath another perfect one, for being \"beneath\" is a descent in degree.\n\nSince Mary's perfection was through Jesus, in his attribution to her, she did not say what Asiya said. Asiya said: <<نَجِّنِي مِنْ فِرْعَوْنَ وَعَمَلِهِ وَنَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ>> (Save me from Pharaoh and his deeds, and save me from the wrongdoing people), so that the sanctity of the relation would not be violated. And Mary said: <<يَا لَيْتَنِي مِتُّ قَبْلَ هَذَا وَكُنْتُ نَسْيًا مَنْسِيًّا>> (Oh, would that I had died before this and been a thing forgotten, utterly forgotten), though she was innocent in reality (في نفس الأمر) before Allah. She did not say that for the sake of Allah, as Asiya said \"near You,\" prioritizing Him and seeking His proximity and protection from the hands of His enemies. But Mary said that out of modesty (حياء) before people, knowing the purity of her house and her ancestors, and fearing that shame would be attached to them because of her.\n\nSince we mentioned that the World was veiled in the Unseen of Allah, and that Unseen was in the position of the shadow (الظل) to the person. If something were stripped entirely from the shadow, it would emerge upon the form of the shadow, and the shadow is upon the form of that whose shadow it is. Do you not see that when the Day is stripped away from the Night, it appears as light, and the things that were veiled by the Night appear by the light of the Day? So the Day did not resemble the Night, but resembled the Light in the manifestation of things through it. Thus, the Night was the shadow of the Light, and the Day emerged, when stripped from the Night, upon the form of the Light. Likewise, the World, in its emergence from the Unseen, emerged upon the form of the Knower of the Unseen, as we have established.\n\nSufficient knowledge of Allah has been made clear to you from this station, if you recognize its value. So, <<فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ>> (Be not among the ignorant).\n\nAs for the issue of the spirit (روح) of the form of this World, and the spirits of the forms of the Higher and Lower Worlds (العالم العلوي والسفلي), I shall now elaborate on it for you in this discussion, which is the eighth degree of this station. For this station contains seventeen categories of knowledge, and this is one of them. We say that the spirit of the Major World (العالم الكبير) is the Unseen (الغيب) from which it emerged, so understand this. It is sufficient for you that it is the Greatest and Highest Manifestation (المظهر الأكبر الأعلى), if you comprehend and know His saying: <<أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ>> (Have you not considered how your Lord extended the shadow?). After the spirit of the Major World has become clear to you, it remains for you to know whether the spirits of the forms of the World exist from a form, before it, or simultaneously with it. The position of the spirits (الأرواح) relative to the forms of the World is like the position of the spirits of the forms of the limbs of the Minor Human (الإنسان الصغير), such as power (القدرة) being the spirit of the hand, hearing (السمع) the spirit of the ear, and sight (البصر) the spirit of the eye.\n\n### [The spirits governing the forms existed in the Presence of Beauty (حضرة الجمال)]\n\nKnow that people have differed concerning this issue, as we have detailed. The verification (التحقيق) of this, according to us, is that the spirits governing the forms (الأرواح المدبرة للصور) existed in the Presence of Beauty (حضرة الجمال), not detailed in their essences (أعيانها), but detailed with Allah in His Knowledge (علمه). Thus, they were in the Presence of Totality (حضرة الإجمال) like letters existing potentially (بالقوة) in ink, not distinguished in themselves, even though they were distinguished by Allah and detailed in their state of totality. When the Pen (القلم) writes upon the Tablet (اللوح), the forms of the letters appear detailed, after they were totalized in the ink. So it is said, \"This is *alif*, *ba*, *jim*, and *dal*\" in the simple elements (البسائط), and these are the spirits of the simple elements. And it is said, \"This one stood,\" \"This is Zayd,\" \"This one departed,\" \"This is Amr,\" and these are the spirits of the compounded bodies (الأجسام المركبة).\n\nWhen Allah fashioned the forms of the World—whichever world He willed—the Universal Spirit (الروح الكل) was like the Pen and the writing right hand, and the spirits were like the ink in the Pen, and the forms were like the positions of the letters on the Tablet. Then He breathed the Spirit (الروح) into the forms of the World, and the spirits appeared distinguished by their forms. So it was said, \"This is Zayd,\" \"This is Amr,\" \"This is a horse,\" \"This is an elephant,\" \"This is a snake,\" and every possessor of spirit. There is nothing there except a possessor of spirit, but some are perceiving and some are non-perceiving.\n\nSome people said that the spirits, in their original existence, are generated from the temperament (مزاج) of the form. Others denied this, and each has a perspective upon which he relies. The middle way is that which we have adopted, which is His saying: <<ثُمَّ أَنشَأْنَاهُ خَلْقًا آخَرَ>> (Then We brought him forth as another creation).\n\nWhen Allah fashions the corporeal forms (الصور الجسمية), He installs in them whichever form He wills from the spiritual forms (الصور الروحية)—whether He wills the form of a pig, a dog, a human, or a horse—according to what the Almighty, the All-Knowing, has decreed. Thus, there is a person dominated by dullness and bestiality, whose spirit is the spirit of a donkey, and by this he is called when the ruling of that spirit appears, so it is said, \"So-and-so is a donkey.\" Likewise, every attribute is called to its record (كِتابِهَا), so it is said, \"So-and-so is a dog,\" \"So-and-so is a lion,\" and \"So-and-so is a human,\" which is the most perfect of attributes and the most perfect of spirits. The Exalted said: <<الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ>> (Who created you, fashioned you, and perfected your balance). And the apparent creation (النشأة الظاهرة) was completed for the sight: <<فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ>> (In whatever form He willed, He assembled you) from the forms of the spirits, so you are attributed to them, as we mentioned, and they are specified with Allah. Thus, the spirits were distinguished by their forms.\n\nThen, when they depart from these materials, a group of our companions says that the spirits are completely stripped (تتجرد) of the materials and return to their origin, just as the rays of the sun generated by a polished body return to the sun when that body rusts. And they differed here into two paths. One group said that they are not distinguished in themselves after separation, just as the water in vessels on the bank of a river is not distinguished when the vessels break and the water returns to the river. The bodies are those vessels, and the water with which they were filled from that river is like the spirits from the Universal Spirit (الروح الكل).\n\nAnother group said that rather, by their proximity to the body, they acquire bad and good dispositions (هيئات), and they are distinguished by those dispositions when they separate from the bodies. Just as that water, when it is in the vessels, may have things that change its state, either in its color, its smell, or its taste. When it leaves the vessels, what it acquired of smell, taste, or color accompanies its essence, and Allah preserves those acquired dispositions upon it. In this, they agreed with some philosophers (الحكماء).\n\nA third group said that the governing spirits (الأرواح المدبرة) continue to govern in the world of this life (عالم الدنيا). When they transition to the Isthmus (البرزخ), they govern barzakhi bodies (أجسادا برزخية). This is the form in which a person sees himself in sleep, and likewise, it is death, which is expressed by the term \"forms.\" Then they will be resurrected on the Day of Resurrection in the natural bodies (الأجسام الطبيعية), just as they were in this world. The disagreement among our companions concerning the spirits after separation ends here. As for the disagreement of those who are not our companions, it is extensive, but our purpose is not to cite the words of those who are not among [us].\n\n### [The Paradise which its people will reach in the Hereafter is witnessed today]\n\nKnow, O my brother—may Allah take care of you with His Mercy—that the Paradise (الجنة) which its people will reach in the Hereafter (الآخرة) is witnessed today by you in terms of its location (محلها), but not in terms of its form (صورتها). You are turning about within it, upon the state you are in, yet you do not know that you are in it, for the form in which it has manifested (تجلت) to you veils you.\n\nThe People of Unveiling (أهل الكشف), who perceive what is hidden from others, see that location: if it is Paradise, they see a green garden (روضة خضراء); and if it is Hell (جهنم), they see it according to the descriptions of its intense cold (زمهريرها) and its heat (حرورها) and what Allah has prepared within it. Most of the People of Unveiling see this at the beginning of the Path. The Divine Law (الشرع) has drawn attention to this by His saying: \"Between my grave and my pulpit is a garden (روضة) from the gardens of Paradise.\" The People of Unveiling see it as a garden, just as he said.\n\nAnd they see the rivers Nile, Euphrates, Sayhan, and Jayhan as rivers of honey, water, wine, and milk, just as they are in Paradise. For the Prophet (peace and blessings be upon him) informed us that these rivers are from Paradise.\n\nWhoever Allah does not unveil the sight of, and remains in the blindness of his veil (حجابه), does not perceive this. This is like a blind person who is in a garden; the garden is not absent from him in its essence, yet he does not see it. It is not necessary that because he does not see it, he is not in it; rather, he is in it. Likewise are those places that the Messenger of Allah (peace and blessings be upon him) mentioned are from the Fire, such as the valley of Muhassir in Mina and others. For this reason, he legislated for his community the hastening of departure from it, for he (peace and blessings be upon him) sees what they do not see and witnesses what they do not witness.\n\nAmong people, some maintain this unveiling (الكشف), and some do not, according to what Allah has willed of that, due to a wisdom He has hidden in His creation. Do you not see that the People of Piety (أهل الورع), when Allah protects them from consuming the unlawful (الحرام), one of the signs they possess is that the forbidden food changes in their sight into a prohibited form—for example, they see it as blood or pork—so they refrain from eating it? If they investigate the earning of that food, they find it was acquired in a manner not sanctioned by the Divine Law.\n\nThe People of Allah (أهل الله) have eyes with which they see, ears with which they hear, hearts with which they understand, and tongues with which they speak, which are different from the form of these physical eyes, ears, hearts, and tongues. With those eyes they witness (يشهدون), with those ears they hear, with those hearts they understand, and with those tongues they speak, so their speech is correct. <<فَإِنَّهَا لَا تَعْمَى الْأَبْصَارُ وَلَكِن تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ>> (Indeed, it is not the eyes that are blinded, but blinded are the hearts which are within the breasts) from the Real (الحق) and from adhering to Him. They are <<صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَعْقِلُونَ>> (Deaf, dumb, and blind, so they do not understand) concerning Allah, and <<فَهُمْ لَا يَرْجِعُونَ>> (They will not return) to Allah. By Allah, their eyes are indeed in their faces, their hearing is in their ears, and their tongues are in their mouths, but Divine Care (العناية) did not precede for them, nor did the good reward (الحسنى). So praise be to Allah, in gratitude, for having given us life through those hearts, tongues, ears, and eyes.\n\nA prophetic hadith has been transmitted among the People of Unveiling (أهل الكشف) as sound, even if its chain of transmission is not established among the People of Narration (أهل النقل) due to the weakness of the narrator, even if he spoke the truth in it. The Messenger of Allah (peace and blessings be upon him) said: \"Were it not for the embellishment in your speech and the agitation in your hearts, you would see what I see and hear what I hear.\"\n\nAllah the Exalted said: <<لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ>> (That you may make clear to the people what was sent down to them). There is no clearer explanation than this. But where is the one who empties his vessel for the traces of his Lord? Where is the one who transmits what he hears without adding to it? This is very rare. And Allah is the Guardian of success.\n\n### [The Science of Analysis (علم التحليل)]\n\nKnow that this station (منزل) encompasses the Science of Analysis (علم التحليل); and the knowledge of the sciences attained by the people of the Fire when they enter it; and the knowledge of the Divine secrets (الأسرار الإلهية) granted by the world of Nature (عالم الطبيعة) which cannot be known from anything else; and the knowledge of the Preceding and the Succeeding (السابقة واللاحقة), which is the ultimate outcome (العاقبة); and the knowledge of the composition of existential proofs (البراهين الوجودية); and the knowledge of spiritual and formal origination (الإيجاد الروحاني والصوري); and the knowledge of the cause leading to wretchedness (الشقاء); and the knowledge of that by which the order of the World (نظام العالم) remains and its form is preserved upon it; and the knowledge of Theophany (التجلي) in the Veil (الحجاب); and the knowledge of Divine rulings (الأحكام الإلهية) outside the path of the Lawgiver (الشارع); and the knowledge of the Unity of Acts (توحيد الأفعال); and the knowledge of joining the higher things to the lower things and the lower things to the higher things—which is, or is close to, the knowledge of the fusion of the distant with the near and the near with the distant. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (Says the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو دو: عالم بالا کے زوال اور عالم اسفل کے وجود کی معرفت میں، جو حضرت محمدیہ، حضرت موسویہ اور حضرت عیسویہ سے متعلق ہے۔\n\nیہ حجتوں کی تلقین کی منزل ہے، یہ اس کی منزل ہے جو بلند ہوا۔\n(شعر)\nپس تم اس شخص کی مانند نہ بنو جو دروازہ کھلنے پر باہر نکل جائے۔\nاور لازم پکڑو اور اس کی مانند بنو جو دروازہ کھلنے پر اندر داخل ہو جائے۔\nجس نے ذات حق (الحق) کی پناہ لی، وہ محفوظ ہو گیا، اور جو اصرار کرتا ہے وہ شامل ہو جاتا ہے۔\nہر اس چیز میں جو تم مانگتے ہو، ہر تنگی اور کشادگی میں۔\nیہ ایک مثال میں کہا گیا ہے کہ جس نے رات کو سفر کیا، وہ حج کو پہنچ گیا۔\nاے میرے بھائی! ایسی ہی چیزوں میں جانیں اور روحیں فنا ہو جاتی ہیں۔\nکتنے ہی دانا ہیں جو اس کے سمندر میں گہرائیوں کے بیچ ہلاک ہو گئے۔\nاور اس جان پر کوئی حرج نہیں جو اس میں ہلاکت دیکھتی ہے۔\n\n### [عالم شہادت (عالم الشهادة) ذات حق کے سوا ہر موجود کا نام ہے]\n\nجان لو کہ عالم غیب (عالم الغیب) عالم شہادت (عالم الشهادة) کا ظرف ہے۔ اور یہاں عالم شہادت (عالم الشهادة) سے مراد ذات حق (الحق) کے سوا ہر وہ موجود ہے جو پایا گیا یا نہیں پایا گیا، یا پایا گیا پھر اعراض (الأعراض) اور صورتوں کی طرح غیب کی طرف لوٹا دیا گیا۔ اور یہ ذات حق (الحق) کے لیے مشہود ہے، اسی لیے ہم نے اسے عالم شہادت (عالم الشهادة) کہا۔ ذات حق (الحق) ہمیشہ عالم کو غیب سے ایک کے بعد ایک چیز کی صورت میں نکالتا رہتا ہے، اجناس اور انواع کے اشخاص کی ایسی تعداد میں جو لامتناہی ہے۔ ان میں سے کچھ کو وہ غیب کی طرف لوٹا دیتا ہے اور کچھ کو کبھی نہیں لوٹاتا۔ جو چیزیں کبھی غیب کی طرف نہیں لوٹائی جاتیں وہ ہر وہ ذات ہے جو بذات خود قائم ہے، اور وہ صرف جواہر (الجواهر) ہیں۔ اور جواہر (الجواهر) کے علاوہ ہر چیز، جیسے اجسام اور کونی و لونی اعراض (الأعراض)، وہ غیب کی طرف لوٹا دی جاتی ہیں اور ان کی مثالیں ظاہر ہوتی رہتی ہیں۔ اور ذات حق (الحق) ہی انہیں غیب سے ان کے اپنے عالم شہادت (عالم الشهادة) کی طرف نکالتا ہے۔ پس وہ عالِمُ الْغَيْبِ والشَّهادَةِ (غیب اور شہادت کا جاننے والا) ہے۔\n\nغیب میں اشیاء کی کوئی کمیت (مقدار) نہیں ہوتی، کیونکہ کمیت حصر کا تقاضا کرتی ہے، چنانچہ کہا جاتا ہے کہ یہ کتنا ہے؟ اور یہ بات غیب میں ان پر لاگو نہیں ہوتی، کیونکہ وہ غیر متناہی ہیں۔ پس کم (کتنا)، کیف (کیسا)، این (کہاں)، زمان (وقت)، وضع (حالت)، اضافہ (نسبت)، عرض (صفت)، اور یہ کہ وہ فعل کرے (أن يفعل) اور یہ کہ وہ مفعول بنے (أن ينفعل)، یہ سب نسبتیں (النسب) ہیں جن کی کوئی اعیان (حقیقی وجود) نہیں ہیں۔ ان کا حکم تب ظاہر ہوتا ہے جب جوہر (الجوهر) خود ظاہر ہوتا ہے، جب ذات حق (الحق) اسے اپنے غیب سے ظاہر کرتا ہے۔ جب جواہر (الجواهر) کے اعیان ظاہر ہوتے ہیں تو یہ نسبتیں (النسب) ان کے پیچھے آتی ہیں۔ چنانچہ کہا جاتا ہے کہ کتنے عین ظاہر ہوئے؟ تو کہا جاتا ہے دس یا زیادہ یا کم۔ پھر کہا جاتا ہے کہ وہ کیسے ہیں؟ تو کہا جاتا ہے کہ وہ مرکب ہیں، چنانچہ ان کے لیے جسمیت (جسم ہونا) عارض ہوئی، اور جسمیت کے ساتھ کیفیت درست ہو گئی، اور کون (ہونا) اور لون (رنگ) کا حلول ہوا۔ پھر کہا جاتا ہے کہاں؟ تو کہا جاتا ہے حیز (جگہ) یا مکان میں۔ پھر کہا جاتا ہے کب؟ تو کہا جاتا ہے جب وہ فلاں صورت میں تھا۔ پھر کہا جاتا ہے اس کی زبان کیا ہے؟ تو کہا جاتا ہے عجمی یا عربی۔ پھر کہا جاتا ہے اس کا دین کیا ہے؟ تو کہا جاتا ہے فلاں شریعت۔ پھر کہا جاتا ہے کیا اس سے بھی کوئی چیز ظاہر ہوئی ہے جو آباء کے ظہور کی طرح ہو، جیسا کہ وہ خود کسی اور سے ظاہر ہوا؟ تو کہا جاتا ہے وہ فلاں کا بیٹا ہے۔ کہا جاتا ہے اس نے کیا فعل کیا؟ کہا جاتا ہے اس نے کھایا۔ کہا جاتا ہے اس کے کھانے سے کیا انفعال ہوا؟ کہا جاتا ہے وہ سیر ہو گیا۔\n\nیہ ان نسبتوں (النسب) کا مجموعہ ہے جو جواہر (الجواهر) کو عارض ہوتی ہیں جب ذات حق (الحق) انہیں اپنے غیب سے نکالتا ہے۔ پس وجودِ محدث میں جوہر (الجوهر) کے اعیان اور اس کے پیچھے آنے والی نسبتوں (النسب) کے سوا کچھ نہیں ہے۔ پس غیب اپنے اندر موجود تمام چیزوں کے ساتھ گویا اپنے عالم کے مطابق ایک صورت کو محیط ہے، کیونکہ ذات حق (الحق) کا اپنے آپ کو جاننا ہی عالم کو جاننا تھا۔ پس عالم، ذات حق (الحق) کے عالم ہونے کی صورت پر ظاہر ہوا۔ پس اس کی صورت جوہر (الجوهر) سے اس کی ذات ہے، اور کمیت (مقدار) سے اس کے اسماء کی تعداد ہے، اور کیفیت (کیف) سے اس کا یہ قول ہے: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (وہ ہر دن ایک نئی شان میں ہے) [الرحمن: 29] اور سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (اے جن و انس! ہم عنقریب تمہاری طرف متوجہ ہوتے ہیں) [الرحمن: 31] اور الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ (رحمن عرش پر مستوی ہوا) [طٰہٰ: 5] اور اس طرح کی بہت سی مثالیں ہیں جو اس نے اپنے بارے میں خبر دی ہیں۔ اور این (کہاں) کے لیے: كان الله في عماء (اللہ بادل میں تھا) اور وہ اللہ آسمان میں ہے۔ اور زمان (وقت) کے لیے: اللہ ازل میں تھا۔ اور وضع (حالت) کے لیے: وَكَلَّمَ الله مُوسى‏ تَكْلِيماً (اور اللہ نے موسیٰ سے کلام کیا، خاص کلام کرنا) [النساء: 164] اور فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله (پس اسے پناہ دو تاکہ وہ اللہ کا کلام سن لے) [التوبہ: 6]۔ پس تمام شرائع اس کا وضع (قائم کرنا) ہیں۔ اور اضافہ (نسبت) کے لیے: خالق الخلق (مخلوق کا خالق)، مالِكَ الْمُلْكِ (بادشاہی کا مالک) [آل عمران: 26]۔ اور فعل کرنے (أن يفعل) کے لیے: اس کے ہاتھ میں میزان ہے، وہ قسط کو جھکاتا اور اٹھاتا ہے۔ اور مفعول بننے (أن ينفعل) کے لیے: اسے پکارا جاتا ہے تو وہ جواب دیتا ہے، اس سے سوال کیا جاتا ہے تو وہ عطا کرتا ہے، اور استغفار کیا جاتا ہے تو وہ بخش دیتا ہے۔\n\nیہ سب عالم کی صورت ہے۔ اور ذات حق (الحق) کے سوا ہر چیز اپنے موجد کی صورت پر ظاہر ہوئی ہے۔ پس اس نے اپنے سوا کسی کو ظاہر نہیں کیا۔ چنانچہ عالم ذات حق (الحق) کا کامل مظہر ہے۔ اس عالم سے زیادہ حسین اور کامل ممکنات میں نہیں ہے، کیونکہ ذات حق (الحق) سے زیادہ کامل کوئی نہیں ہے۔ اگر ممکنات میں اس عالم سے زیادہ کامل کوئی ہوتا تو اس کے موجد سے زیادہ کامل کوئی اور ہوتا، حالانکہ وہاں صرف اللہ ہی ہے۔ پس ممکنات میں صرف وہی ہے جو ظاہر ہوا، اس سے زیادہ کامل کوئی نہیں۔ پس جو کچھ میں نے کہا ہے اس پر غور کرو، کیونکہ یہ معرفت باللہ (المعرفۃ باللہ) کا مغز ہے۔\n\nپھر ذات حق (الحق) نے اس عالم میں سے ایک مختصر مجموعہ منتخب کیا جو اس کے تمام معانی کو کامل ترین وجوہ سے محیط تھا، اسے آدم کا نام دیا اور فرمایا کہ اس نے اسے اپنی صورت پر پیدا کیا۔ پس انسان عالم کا مجموعہ ہے، اور وہ انسان صغیر (چھوٹا انسان) ہے، اور عالم انسان کبیر (بڑا انسان) ہے۔ یا تم انسان کو عالم صغیر کہہ لو، جیسا چاہو، جب تم اس امر کو جان لو جیسا کہ وہ اپنی ذات اور عین میں ہے۔ پس تم اس کی طرف نسبت کرو اور جو اصطلاح چاہو استعمال کرو۔\n\nانسان کو پورے عالم پر کوئی فضیلت نہیں ہے، بلکہ عالم انسان سے افضل ہے، کیونکہ وہ اس پر ایک درجہ زیادہ رکھتا ہے، اور وہ یہ ہے کہ انسان عالم کبیر سے وجود میں آیا۔ پس عالم کو انسان پر سببیّت کا درجہ حاصل ہے، کیونکہ انسان اس سے پیدا ہوا۔ اللہ تعالیٰ نے فرمایا: وَلِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ (اور مردوں کو عورتوں پر ایک درجہ فضیلت ہے) [البقرہ: 228]، کیونکہ حوا آدم سے صادر ہوئیں۔ پس یہ درجہ مرد کو عورت پر مذکر ہونے کی وجہ سے ہمیشہ حاصل رہا۔ اگرچہ ماں بیٹے کے وجود کا سبب ہوتی ہے، لیکن اس کا بیٹا مذکر ہونے کے ایک درجہ کی وجہ سے اس پر بڑھ جاتا ہے، کیونکہ وہ تمام وجوہ سے اپنے باپ سے زیادہ مشابہت رکھتا ہے۔ پس انسان پر اپنے والدین کی تعظیم واجب ہے۔ اس کی ماں پورا عالم ہے اور اس کا باپ معروف ہے، غیر منکور نہیں۔ اور نکاح (شادی) توجہ کا نام ہے، پس بچہ اپنے والدین کی صورت پر ظاہر ہوا۔\n\nاور چونکہ بچے کو صرف اس کے باپ کی طرف منسوب کیا جاتا ہے، ماں کی طرف منسوب نہیں کیا جاتا، کیونکہ باپ کو درجہ اور بلندی حاصل ہے، لہٰذا اسے اشرف کی طرف منسوب کیا جاتا ہے۔ اور جب عیسیٰ علیہ السلام کے لیے یہ ممکن نہ ہوا کہ انہیں اس کی طرف منسوب کیا جائے جس نے انہیں مریم کو ایک صحیح سالم بشر کی صورت میں عطا کیا تھا، تو ان کی والدہ کو کمال عطا کیا گیا، اور وہ اشرف مقام ہے۔ پس عیسیٰ کو ان کی طرف منسوب کیا گیا، چنانچہ کہا گیا عیسیٰ ابن مریم۔ پس انہیں یہ شرف اس کمال کی وجہ سے حاصل ہوا جو اس درجہ کا مقام ہے جس سے مردوں کو عورتوں پر فضیلت دی گئی تھی۔ اسی وجہ سے بیٹے کو باپ کی طرف منسوب کیا جاتا ہے۔\n\nاور مریم کے کمال کی گواہی رسول اللہ صلی اللہ علیہ وسلم نے دی، اور فرعون کی بیوی آسیہ کے کمال کی بھی۔ آسیہ کا کمال اس مقام کے شرف کی وجہ سے تھا جس کا دعویٰ فرعون نے کیا تھا۔ اس مقام کے لیے یہ مناسب نہیں تھا کہ اس کا عرش جس پر وہ مستوی ہو، کمال سے موصوف نہ ہو۔ پس آسیہ کو اس مقام کے شرف کی وجہ سے کمال حاصل ہوا جس کی وجہ سے فرعون بدبخت ہوا اور کھلے خسارے میں جا پڑا، اور اس کی بیوی سعادت سے کامیاب ہوئی۔ اور اس مقام کے شرف کی وجہ سے جو انہیں کمال کے ساتھ حاصل ہوا، انہوں نے کہا: رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً في الْجَنَّةِ (اے میرے رب! میرے لیے اپنے پاس جنت میں ایک گھر بنا دے) [التحریم: 11]۔ انہیں صرف \"عِنْدَكَ\" (اپنے پاس) کے مقام کی قوت نے ہی یہ بات کہلوائی۔ انہوں نے موسیٰ کی یا کسی اور مخلوق کی ہمسائیگی نہیں مانگی۔ اور ان کے لیے یہ مناسب بھی نہیں تھا، کیونکہ حال ان پر غالب تھا۔ کامل شخص کامل کے ماتحت نہیں ہوتا، کیونکہ ماتحتی درجے کا نزول ہے۔\n\nاور چونکہ مریم کا کمال عیسیٰ کی ان کی طرف نسبت میں تھا، اس لیے انہوں نے وہ بات نہیں کہی جو آسیہ نے کہی۔ آسیہ کہتی ہیں: نَجِّنِي من فِرْعَوْنَ وعَمَلِهِ ونَجِّنِي من الْقَوْمِ الظَّالِمِينَ (مجھے فرعون اور اس کے عمل سے نجات دے اور مجھے ظالم قوم سے نجات دے) [التحریم: 11]، تاکہ نسبت کی حرمت پامال نہ ہو۔ اور مریم کہتی ہیں: يا لَيْتَنِي مِتُّ قَبْلَ هذا وكُنْتُ نَسْياً مَنْسِيًّا (کاش میں اس سے پہلے مر چکی ہوتی اور بھولی بسری ہو جاتی) [مریم: 23]۔ حالانکہ وہ درحقیقت اللہ کے نزدیک بری تھیں۔ انہوں نے یہ بات اللہ کی خاطر نہیں کہی، جیسا کہ آسیہ نے \"عِنْدَكَ\" (اپنے پاس) کہہ کر اسے مقدم کیا اور اس کی ہمسائیگی اور اس کے دشمنوں کے ہاتھوں سے حفاظت طلب کی۔ بلکہ مریم نے یہ بات لوگوں سے حیا کی وجہ سے کہی، کیونکہ وہ اپنے گھرانے اور اپنے آباء کی پاکیزگی کو جانتی تھیں، چنانچہ انہیں خوف ہوا کہ ان کی وجہ سے ان پر عار نہ لگ جائے۔\n\nاور جب ہم نے ذکر کیا کہ عالم اللہ کے غیب میں مستور تھا، اور وہ غیب شخص کے لیے سائے کی مانند تھا۔ اگر اس سائے سے کوئی چیز مکمل طور پر نکال لی جائے تو وہ سائے کی صورت پر ظاہر ہو گی، اور سایہ اس چیز کی صورت پر ہوتا ہے جس کا وہ سایہ ہے۔ پس سائے سے نکلی ہوئی چیز شخص کی صورت پر ہوتی ہے۔ کیا تم نہیں دیکھتے کہ جب دن کو رات سے نکالا گیا تو وہ نور کی صورت میں ظاہر ہوا؟ پس وہ چیزیں جو رات میں مستور تھیں، دن کے نور سے ظاہر ہو گئیں۔ چنانچہ دن رات سے مشابہ نہیں ہوا، بلکہ نور سے مشابہ ہوا جس سے چیزیں ظاہر ہوتی ہیں۔ پس رات نور کا سایہ تھی، اور دن جب رات سے نکالا گیا تو نور کی صورت پر ظاہر ہوا۔ اسی طرح عالم بھی جب غیب سے نکلا تو عالم بالغیب (غیب کو جاننے والے) کی صورت پر ظاہر ہوا، جیسا کہ ہم نے بیان کیا۔\n\nپس اس مقام سے تمہیں علم باللہ (اللہ کی معرفت) کے بارے میں جو کچھ معلوم ہوا ہے، اگر تم اس کی قدر جانو تو تمہارے لیے کافی ہے۔ پس تم جاہلوں میں سے نہ ہو جانا (فَلا تَكُونَنَّ من الْجاهِلِينَ) [یوسف: 33]۔\n\nاور جہاں تک اس عالم کی صورت کی روح اور عالم علوی و سفلی کی صورتوں کی ارواح کا مسئلہ ہے، تو میں اس منزل کے آٹھویں درجے میں اس مسئلے کو تمہارے لیے واضح کرتا ہوں۔ کیونکہ یہ منزل سترہ قسم کے علوم پر مشتمل ہے، اور یہ ان میں سے ایک ہے۔\n\nپس ہم کہتے ہیں کہ عالم کبیر کی روح وہ غیب ہے جس سے وہ نکلا ہے۔ پس سمجھو۔ اور تمہارے لیے یہ جاننا کافی ہے کہ وہ سب سے بڑا اور اعلیٰ مظہر ہے، اگر تم عقل کرو اور اس کے قول کو جانو: أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ (کیا تم نے اپنے رب کی طرف نہیں دیکھا کہ اس نے سائے کو کیسے پھیلایا؟) [الفرقان: 45]۔\n\nاور جب تمہیں عالم کبیر کی روح معلوم ہو گئی، تو اب تمہارے لیے یہ جاننا باقی ہے کہ کیا عالم کی صورتوں کی ارواح صورت سے پیدا ہوئی ہیں، یا اس سے پہلے، یا اس کے ساتھ؟ اور عالم کی صورتوں سے ارواح کا مقام وہی ہے جو انسان صغیر (چھوٹے انسان) کے اعضاء کی صورتوں کی ارواح کا مقام ہے، جیسے قدرت ہاتھ کی روح ہے، سننا کان کی روح ہے، اور دیکھنا آنکھ کی روح ہے۔\n\n### [صور کی تدبیر کرنے والی ارواح جمال کی حضرۃ (حضرة الجمال) میں موجود تھیں]\n\nجان لو کہ لوگوں نے اس مسئلے میں اختلاف کیا ہے، جیسا کہ ہم نے اس کی تفصیل بیان کی ہے۔ اور ہمارے نزدیک اس کی تحقیق یہ ہے کہ صور (صورتوں) کی تدبیر کرنے والی ارواح (الأرواح) حضرۃ الجمال (حضرة الجمال) میں موجود تھیں، لیکن ان کے اعیان (حقیقی وجود) مفصل نہیں تھے، البتہ اللہ کے علم میں مفصل تھے۔ پس وہ حضرۃ الاجمال (حضرة الإجمال) میں تھیں، جیسے سیاہی میں بالقوۃ موجود حروف۔ وہ خود اپنے لیے ممتاز نہیں تھیں، اگرچہ اللہ کے نزدیک وہ اپنے اجمال کی حالت میں بھی مفصل اور ممتاز تھیں۔\n\nجب قلم لوح پر لکھتا ہے تو حروف کی صورتیں مفصل ہو کر ظاہر ہوتی ہیں، جبکہ وہ سیاہی میں مجمل تھیں۔ پس کہا جاتا ہے کہ یہ الف ہے، باء ہے، جیم ہے، اور دال ہے، یہ بسیط چیزوں میں ہیں اور یہ بسیط چیزوں کی ارواح ہیں۔ اور کہا جاتا ہے کہ یہ \"قام\" (کھڑا ہوا) ہے، یہ \"زید\" ہے، یہ \"خرج\" (نکلا) ہے، اور یہ \"عمرو\" ہے، اور یہ مرکب اجسام کی ارواح ہیں۔\n\nاور جب ذات حق (الحق) نے عالم کی صورتوں کو برابر کیا، جس عالم کو بھی چاہا، تو روحِ کل (الروح الکل) قلم کی طرح تھی، اور لکھنے والا دایاں ہاتھ، اور ارواح (الأرواح) قلم میں سیاہی کی طرح تھیں، اور صورتیں لوح میں حروف کے مقامات کی طرح تھیں۔ پس ذات حق (الحق) نے عالم کی صورتوں میں روح پھونکی، تو ارواح اپنی صورتوں کے ساتھ ممتاز ہو کر ظاہر ہوئیں۔ پس کہا گیا یہ زید ہے، یہ عمرو ہے، یہ گھوڑا ہے، یہ ہاتھی ہے، اور یہ سانپ ہے۔ اور ہر چیز روح والی ہے، اور وہاں روح والی کے سوا کچھ نہیں ہے، لیکن کچھ مدرک ہیں اور کچھ غیر مدرک۔\n\nبعض لوگوں نے کہا کہ ارواح اپنے اصل وجود میں صورت کے مزاج سے پیدا ہوتی ہیں۔ اور بعض لوگوں نے اس سے منع کیا۔ اور ہر ایک کے پاس ایک وجہ ہے جس پر وہ بھروسہ کرتا ہے۔ اور درمیانی طریقہ وہی ہے جس کی طرف ہم گئے ہیں، اور وہ اس کا قول ہے: ثُمَّ أَنْشَأْناهُ خَلْقاً آخَرَ (پھر ہم نے اسے ایک دوسری مخلوق بنا کر اٹھایا) [المؤمنون: 14]۔\n\nاور جب ذات حق (الحق) جسمانی صورتوں کو برابر کرتا ہے، تو وہ روحانی صورتوں میں سے جس صورت میں چاہتا ہے اسے مرکب کر دیتا ہے، اگر چاہے تو خنزیر کی صورت میں، یا کتے کی، یا انسان کی، یا گھوڑے کی، جیسا کہ عزیز و علیم (العزيز العليم) نے مقدر کیا ہے۔ پس وہاں ایک شخص ایسا ہوتا ہے جس پر بلادت اور بہیمیت غالب ہوتی ہے، تو اس کی روح گدھے کی روح ہوتی ہے، اور اسی کی وجہ سے اسے پکارا جاتا ہے جب اس روح کا حکم ظاہر ہوتا ہے، چنانچہ کہا جاتا ہے کہ فلاں گدھا ہے۔ اور اسی طرح ہر صفت تُدْعى‏ إِلى‏ كِتابِهَا (اپنے نامہ اعمال کی طرف بلائی جاتی ہے) [الجاثیہ: 28]، چنانچہ کہا جاتا ہے فلاں کتا ہے، فلاں شیر ہے، اور فلاں انسان ہے، اور یہ سب سے کامل صفات اور سب سے کامل ارواح ہیں۔ اللہ تعالیٰ نے فرمایا: الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ (جس نے تجھے پیدا کیا، پھر تجھے برابر کیا، پھر تجھے معتدل کیا) [الانفطار: 7]۔ اور ظاہری نشوونما مکمل ہوئی: فِي أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ (جس صورت میں چاہا تجھے جوڑ دیا) [الانفطار: 8]، یعنی ارواح کی صورتوں میں سے، پس ان کی طرف نسبت کی جاتی ہے جیسا کہ ہم نے ذکر کیا، اور وہ اللہ کے نزدیک معین ہیں۔ پس ارواح اپنی صورتوں کے ساتھ ممتاز ہو گئیں۔\n\nپھر جب یہ ارواح ان مواد سے جدا ہوتی ہیں، تو ہمارے اصحاب میں سے ایک گروہ کہتا ہے کہ ارواح مواد سے مکمل طور پر تجرد (جدا) ہو جاتی ہیں اور اپنی اصل کی طرف لوٹ جاتی ہیں، جیسے سورج کی شعاعیں جو چمکدار جسم سے پیدا ہوتی ہیں، جب وہ جسم زنگ آلود ہو جاتا ہے تو شعاعیں سورج کی طرف لوٹ جاتی ہیں۔\n\nاور یہاں ان میں دو طریقے پر اختلاف ہوا: ایک گروہ نے کہا کہ مفارقت کے بعد وہ خود اپنے لیے ممتاز نہیں رہتیں، جیسے دریا کے کنارے رکھے ہوئے برتنوں کا پانی جب برتن ٹوٹ جاتے ہیں اور پانی دریا میں واپس چلا جاتا ہے، تو اجسام وہ برتن ہیں اور وہ پانی جو ان میں بھرا گیا تھا، اس دریا سے ہے، جیسے ارواح روحِ کل (الروح الکل) سے ہیں۔\n\nاور ایک گروہ نے کہا: بلکہ وہ جسم کے ساتھ رہنے سے اچھی اور بری ہیئات (کیفیات) حاصل کر لیتی ہیں، پس جب وہ اجسام سے جدا ہوتی ہیں تو ان ہیئات کی وجہ سے ممتاز رہتی ہیں، جیسے وہ پانی جب برتنوں میں ہوتا ہے تو کچھ چیزیں اس کی حالت کو بدل دیتی ہیں، یا تو اس کے رنگ میں، یا اس کی بو میں، یا اس کے ذائقے میں۔ پس جب وہ برتنوں سے جدا ہوتا ہے تو جو کچھ اس نے بو، ذائقے یا رنگ میں حاصل کیا تھا، وہ اس کی ذات کے ساتھ رہتا ہے، اور اللہ ان حاصل شدہ ہیئات کو ان پر محفوظ رکھتا ہے۔ اور اس معاملے میں انہوں نے بعض حکماء سے اتفاق کیا۔\n\nاور ایک گروہ نے کہا: تدبیر کرنے والی ارواح (الأرواح المدبرة) عالم دنیا میں ہمیشہ تدبیر کرتی رہتی ہیں۔ جب وہ برزخ کی طرف منتقل ہوتی ہیں تو برزخی اجسام کی تدبیر کرتی ہیں، اور وہ وہی صورت ہے جسے انسان نیند میں دیکھتا ہے، اور یہی موت بھی ہے، جسے صور (صورتوں) سے تعبیر کیا جاتا ہے۔ پھر قیامت کے دن وہ طبعی اجسام میں دوبارہ اٹھائی جائیں گی، جیسا کہ وہ دنیا میں تھیں۔ یہاں پر ارواح کی مفارقت کے بعد ہمارے اصحاب کا اختلاف ختم ہوتا ہے۔ اور ہمارے اصحاب کے علاوہ دوسروں کا اس بارے میں اختلاف بہت زیادہ ہے، لیکن ہمارا مقصد ان لوگوں کی بات لانا نہیں ہے جو ہمارے طریق سے نہیں ہیں۔\n\n### [جو جنت آخرت میں اہل جنت کو ملے گی، وہ آج بھی مشہود ہے]\n\nاور جان لو، اے میرے بھائی! اللہ تمہیں اپنی رحمت میں لے لے، کہ وہ جنت جس میں آخرت میں اس کے اہل پہنچیں گے، وہ آج بھی تمہارے لیے اپنے محل کے اعتبار سے مشہود ہے نہ کہ اپنی صورت کے اعتبار سے۔ پس تم اس حال میں اس میں گھوم پھر رہے ہو جس پر تم ہو، اور تمہیں معلوم نہیں کہ تم اس میں ہو۔ کیونکہ وہ صورت جس میں اس کا ظہور الٰہی (التجلی) ہوا ہے، تمہیں حجاب میں رکھے ہوئے ہے۔\n\nپس اہل کشف (أهل الكشف) جنہوں نے وہ چیزیں پا لیں جو لوگوں سے غائب ہیں، وہ اس محل کو دیکھتے ہیں۔ اگر وہ جنت ہے تو اسے ایک سبز باغ (روضہ) کی صورت میں دیکھتے ہیں، اور اگر وہ جہنم ہے تو اسے اس کی زمہریر (شدید ٹھنڈک) اور حرارت کی صفات کے مطابق دیکھتے ہیں، اور جو کچھ اللہ نے اس میں تیار کر رکھا ہے۔ اور اکثر اہل کشف (أهل الكشف) ابتدائے طریق میں یہ دیکھتے ہیں۔\n\nاور شریعت نے اس پر اپنے اس قول سے تنبیہ کی ہے: \"میری قبر اور میرے منبر کے درمیان جنت کے باغوں میں سے ایک باغ ہے۔\"\n(حدیث)\nپس اہل کشف (أهل الكشف) اسے باغ کی صورت میں دیکھتے ہیں جیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا۔\n\nاور وہ دریائے نیل، فرات، سیحان اور جیحان کو شہد، پانی، شراب اور دودھ کی نہریں دیکھتے ہیں، جیسا کہ وہ جنت میں ہیں۔ کیونکہ نبی صلی اللہ علیہ وسلم نے خبر دی کہ یہ نہریں جنت سے ہیں۔\n\nاور جس کی بصارت سے اللہ نے پردہ نہیں ہٹایا اور وہ اپنے حجاب کی اندھیرے میں رہا، وہ اسے نہیں پا سکتا۔ یہ اس اندھے کی طرح ہے جو باغ میں ہو، تو وہ اپنی ذات سے غائب نہیں ہے اور نہ ہی وہ اسے دیکھتا ہے۔ پس اس کا نہ دیکھنا اس بات کو لازم نہیں کرتا کہ وہ اس میں نہیں ہے، بلکہ وہ اس میں ہے۔\n\nاور اسی طرح وہ جگہیں جن کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے ذکر کیا کہ وہ آگ سے ہیں، جیسے منیٰ میں بطن محسر اور دیگر مقامات۔ اسی لیے آپ صلی اللہ علیہ وسلم نے اپنی امت کے لیے وہاں سے تیزی سے نکل جانے کو مشروع قرار دیا۔ کیونکہ آپ صلی اللہ علیہ وسلم وہ دیکھتے تھے جو وہ نہیں دیکھتے تھے، اور وہ شہود (الشہود) کرتے تھے جو وہ شہود نہیں کرتے تھے۔\n\nاور لوگوں میں سے کچھ ایسے ہیں جن کے ساتھ یہ کشف (الکشف) ہمیشہ رہتا ہے، اور کچھ ایسے ہیں جن کے ساتھ یہ نہیں رہتا، اس حکمت کے مطابق جو اللہ نے اپنی مخلوق میں چھپا رکھی ہے۔ کیا تم نہیں دیکھتے کہ اہل ورع (پرہیزگار) کو جب اللہ حرام کھانے سے بچاتا ہے، تو ان کے نزدیک اس کی بعض علامتوں میں سے یہ ہے کہ وہ کھانے کی چیز ان کی نظر میں حرام صورت میں بدل جاتی ہے، مثلاً وہ اسے خون یا خنزیر دیکھتے ہیں، تو وہ اسے کھانے سے رک جاتے ہیں۔ پھر جب وہ اس کھانے کی کمائی کی تحقیق کرتے ہیں تو اسے غیر شرعی طریقے سے کمایا ہوا پاتے ہیں۔\n\nپس اہل اللہ کے لیے ایسی آنکھیں ہیں جن سے وہ دیکھتے ہیں، اور ایسے کان ہیں جن سے وہ سنتے ہیں، اور ایسے دل ہیں جن سے وہ عقل کرتے ہیں، اور ایسی زبانیں ہیں جن سے وہ کلام کرتے ہیں، جو ان آنکھوں، کانوں، دلوں اور زبانوں کی صورت سے مختلف ہیں جو عام ہیں۔ پس ان آنکھوں سے وہ شہود (الشہود) کرتے ہیں، ان کانوں سے وہ سنتے ہیں، ان دلوں سے وہ عقل کرتے ہیں، اور ان زبانوں سے وہ کلام کرتے ہیں، پس ان کا کلام درست ہوتا ہے۔\n\nفَإِنَّها لا تَعْمَى الْأَبْصارُ ولكِنْ تَعْمَى الْقُلُوبُ الَّتِي في الصُّدُورِ (پس یہ آنکھیں اندھی نہیں ہوتیں، بلکہ وہ دل اندھے ہو جاتے ہیں جو سینوں میں ہیں) [الحج: 46] حق سے اور اسے قبول کرنے سے۔ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَعْقِلُونَ (وہ بہرے ہیں، گونگے ہیں، اندھے ہیں، پس وہ عقل نہیں کرتے) [البقرہ: 171] اللہ کی طرف سے، فَهُمْ لا يَرْجِعُونَ (پس وہ رجوع نہیں کرتے) [البقرہ: 18] اللہ کی طرف۔\n\nاور اللہ کی قسم! ان کی آنکھیں ان کے چہروں میں ہیں، اور ان کے کان ان کے کانوں میں ہیں، اور ان کی زبانیں ان کے منہ میں ہیں، لیکن ان کے لیے عنایت اور بھلائی سبقت نہیں لے گئی۔ پس اللہ کا شکر ہے کہ اس نے ہمیں ان دلوں، زبانوں، کانوں اور آنکھوں کے ساتھ زندہ رکھا۔\n\nاور اہل کشف (أهل الكشف) کے نزدیک ایک نبوی حدیث صحیح وارد ہوئی ہے، اگرچہ اہل نقل کے نزدیک راوی کے ضعف کی وجہ سے اس کی سند ثابت نہیں، لیکن اگر وہ اس میں سچا ہو تو اس نے کہا:\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اگر تمہاری باتوں میں اضافہ اور تمہارے دلوں میں فساد نہ ہوتا تو تم وہ دیکھتے جو میں دیکھتا ہوں اور وہ سنتے جو میں سنتا ہوں۔\"\n(حدیث)\n\nاللہ تعالیٰ نے فرمایا: لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ (تاکہ تم لوگوں کے لیے وہ بیان کر دو جو ان کی طرف نازل کیا گیا ہے) [النحل: 44]۔ اور اس صریح بیان سے زیادہ کیا ہو سکتا ہے؟ لیکن کہاں ہے وہ جو اپنے محل کو اپنے رب کے آثار کے لیے خالی کرے؟ کہاں ہے وہ جو سنی ہوئی بات کو بغیر کسی اضافے کے نقل کرے؟ یہ بہت کم ہے۔ اور اللہ ہی توفیق دینے والا ہے۔\n\n### [علم التحلیل (تجزیہ کا علم)]\n\nاور جان لو کہ یہ منزل علم التحلیل (تجزیہ کا علم) پر مشتمل ہے، اور اس علم پر جو اہل نار کو جہنم میں داخل ہونے پر حاصل ہو گا، اور اس علم پر جو عالم طبیعت الٰہی اسرار میں سے عطا کرتا ہے جو کسی اور سے معلوم نہیں ہوتے، اور علم سابقہ و لاحقہ پر، جو کہ انجام (عاقبت) کا علم ہے، اور براہینِ وجودیہ (الوجودية) کی ترکیب کے علم پر، اور ایجادی روحانی و صوری کے علم پر، اور شقاوت (بدبختی) کی طرف لے جانے والے سبب کے علم پر، اور اس علم پر جس سے عالم کا نظام باقی رہتا ہے اور اس کی صورت محفوظ رہتی ہے، اور حجاب میں ظہور الٰہی (التجلی) کے علم پر، اور شارع کے طریقے کے علاوہ الٰہی احکام کے علم پر، اور توحید الافعال (افعال کی توحید) کے علم پر، اور اعالی (بلند چیزوں) کو اسافل (پست چیزوں) سے ملانے اور اسافل کو اعالی سے ملانے کے علم پر، اور یہ یا اس کے قریب قریب بعید کو قریب سے اور قریب کو بعید سے جوڑنے کا علم ہے۔ اور اللہ یَقُولُ الْحَقَّ وهُوَ یَهْدِی السَّبِیلَ (اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے) [الاحزاب: 4]۔",
    "fa": "باب سیصد و دوم در معرفت منزل زوال عالم بالا و وجود عالم پایین از حضرت محمدیه، موسویه و عیسویه.\n\nمنزل تلقین حجت‌ها، منزل کسی است که بالا رفته است.\nپس مانند کسی مباش که چون در گشوده شد، بیرون رفت.\nو ملازمت کن و مانند کسی باش که چون در گشوده شد، داخل شد.\nهر که به خدا پناه برد، در امان ماند؛ و هر که اصرار ورزد، درآید.\nدر هر آنچه از او می‌خواهی، از هر تنگی و گشایشی.\nاین در مثلی گفته شده است که هر کس شبانه حرکت کند، به حج می‌رسد.\nای برادر، در چنین مقامی جان‌ها و دل‌ها فانی می‌شوند.\nچه بسیار خردمندی که در میان امواج دریا هلاک شد.\nو بر جانی که هلاکت را در آن می‌بیند، هیچ باکی نیست.\n\n[عالم شهود (عالم الشهادة) عبارت است از هر موجودی غیر از خداوند متعال]\n\nبدان که غیب (الغیب) ظرف عالم شهود (عالم الشهادة) است، و عالم شهود در اینجا هر موجودی غیر از خداوند متعال است، از آنچه موجود شده و موجود نشده، یا موجود شده و سپس به غیب بازگردانده شده است، مانند صورت‌ها و اعراض (الأعراض). و این عالم برای خداوند متعال مشهود است، و به همین دلیل آن را عالم شهود نامیدیم. حق سبحانه (الحق سبحانه) پیوسته عالم را از غیب، شیء به شیء، خارج می‌سازد تا به عددی نامتناهی از اشخاص اجناس و انواع برسد. برخی از آن‌ها را به غیب بازمی‌گرداند و برخی را هرگز بازنمی‌گرداند. آنچه را که هرگز به غیب بازنمی‌گرداند، هر ذات قائم به خود است، و این فقط شامل جواهر (الجواهر) می‌شود. و هر آنچه غیر از جواهر است، از اجسام و اعراض (الأعراض) کونی و لونی، به غیب بازگردانده می‌شوند و امثال آن‌ها آشکار می‌گردند. و خداوند آن‌ها را از غیب به شهود خودشان خارج می‌سازد، پس اوست: عالِمُ الْغَيْبِ والشَّهادَةِ (دانای غیب و شهود).\nاشیاء در غیب کمیت (الکمیة) ندارند، زیرا کمیت مستلزم حصر است و گفته می‌شود: «چند تا از این و چند تا از آن؟» و این در غیب بر آن‌ها صدق نمی‌کند، زیرا نامتناهی هستند. پس کم، و کیف، و أین، و زمان، و وضع، و اضافه، و عرض، و اینکه فعل کند، و اینکه منفعل شود؛ همه این‌ها نسبت‌ها (النسب) هستند که در غیب عینیت ندارند. حکم آن‌ها با ظهور جوهر برای خودش آشکار می‌شود، هنگامی که حق (الحق) آن را از غیب خود آشکار می‌سازد.\nپس هنگامی که اعیان جواهر (أعیان الجواهر) ظاهر شدند، این نسبت‌ها آن‌ها را دنبال کردند. گفته شد: چند عین ظاهر شد؟ گفته شد: ده یا بیشتر یا کمتر. گفته شد: چگونه است؟ گفته شد: تألیف یافته است، پس جسمیت (الجسمیة) بر آن عارض شد، و کیفیت (الکیفیة) با جسمیت و حلول کون و رنگ صحیح شد. گفته شد: کجا؟ گفته شد: در حیز یا مکان. گفته شد: کِی؟ گفته شد: هنگامی که فلان چیز در فلان صورت بود. گفته شد: زبانش چیست؟ گفته شد: عجمی یا عربی. گفته شد: دینش چیست؟ گفته شد: شریعت فلان. گفته شد: آیا از او چیزی ظاهر شده که مانند ظهور پدران باشد، چنانکه او از غیر خود ظاهر شد؟ گفته شد: او پسر فلان است. گفته شد: چه کرد؟ گفته شد: خورد. گفته شد: چه انفعالی از خوردن او حاصل شد؟ گفته شد: سیر شد.\nاین‌ها مجموع نسبت‌هایی هستند که بر جواهر عارض می‌شوند هنگامی که خداوند آن‌ها را از غیب خود خارج می‌سازد. پس در هستی (الوجود) حادث، جز اعیان جوهر و نسبت‌هایی که آن را دنبال می‌کنند، نیست.\nپس غیب با آنچه در آن است، گویی حاوی صورتی مطابق با عالم خود است، زیرا علم او به خودش، علم او به عالم بود. پس عالم بر صورت عالم، از جهت عالم بودن حق به آن، آشکار شد.\nصورت عالم از جهت جوهر، ذات اوست؛ و از جهت کم (الکم)، عدد اسمای اوست؛ و از جهت کیف (الکیف)، قول اوست: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (هر روز او در کاری است) و سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (به زودی به حساب شما می‌پردازیم ای جن و انس) و الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ (رحمان بر عرش استیلا یافت). و امثال این‌ها در آنچه درباره خود خبر داده، بسیار است.\nو أین (کجا) این بود که: «کان الله فی عماء» (خداوند در ابری بود) و اوست: الله فی السماء (خداوند در آسمان). و زمان (الزمان) این بود که: خداوند در ازل بود. و وضع (الوضع) این بود که: وكَلَّمَ الله مُوسى‏ تَكْلِيماً (و خداوند با موسی سخن گفت، سخن گفتنی) و فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله (پس او را پناه ده تا کلام خدا را بشنود)؛ پس همه شرایع، وضع اوست. و اضافه (الإضافة) این است: خالق الخلق (آفریننده خلق)، مالِكَ الْمُلْكِ (صاحب مُلک). و اینکه فعل کند (أن یفعل) این است که: «بیده المیزان یخفض القسط ویرفعه» (ترازو در دست اوست، قسط را پایین می‌آورد و بالا می‌برد). و اینکه منفعل شود (أن ینفعل) این است که: خوانده می‌شود و اجابت می‌کند، و سؤال می‌شود و عطا می‌کند، و استغفار می‌شود و می‌آمرزد.\nاین‌ها همه صورت عالم هستند. و هر آنچه غیر از خداست، بر صورت موجِد خود ظاهر شده است، پس او جز خود را آشکار نکرده است. عالم مظهر حق (الحق) بر کمال است. پس در امکان، بدیع‌تر از این عالم نیست، زیرا کامل‌تر از حق تعالی نیست. اگر در امکان، کامل‌تر از این عالم بود، پس کسی کامل‌تر از موجِد آن وجود داشت، و جز خدا کسی نیست. پس در امکان جز مثل آنچه ظاهر شده، نیست و کامل‌تر از آن وجود ندارد. پس در آنچه گفتم تدبر کن، که آن مغز معرفت (المعرفة) به خداست.\nسپس خداوند از این عالم، مختصری جامع که حاوی همه معانی آن از کامل‌ترین وجوه باشد، برگزید و آن را آدم نامید و فرمود که او را بر صورت خود آفریده است. پس انسان مجموع عالم است و او انسان صغیر است، و عالم، انسان کبیر است. یا انسان را عالم صغیر بنام، هر طور که می‌خواهی، اگر امر را آن‌گونه که در نفس و عین خود هست، شناختی، پس به آن نسبت بده و اصطلاح کن، هر طور که می‌خواهی.\nانسان بر کل عالم فضیلتی ندارد، و عالم از انسان افضل است، زیرا یک درجه بر او افزون است، و آن این است که انسان از عالم کبیر به وجود آمده است، پس عالم بر او درجه سببیت دارد، زیرا انسان از او متولد شده است. خداوند متعال می‌فرماید: ولِلرِّجالِ عَلَيْهِنَّ دَرَجَةٌ (و مردان بر زنان درجه‌ای دارند)، زیرا حوا از آدم صادر شد، پس این درجه در ذکورت بر انوثت همواره همراه اوست. و اگرچه مادر سبب وجود فرزند است، اما فرزندش به واسطه درجه ذکورت بر او افزون است، زیرا از همه وجوه شبیه‌تر به پدرش است.\nپس بر انسان واجب است که والدین خود را تعظیم کند. مادر او تمام عالم است و پدر او شناخته شده و انکارناپذیر است. و نکاح (ازدواج) همان توجه است، پس فرزند بر صورت والدین خود خارج شد.\nو چون فرزند جز به پدرش خوانده نمی‌شود و به مادرش نسبت داده نمی‌شود، زیرا پدر دارای درجه و علو است، پس به اشرف نسبت داده می‌شود. و چون برای عیسی علیه السلام ممکن نبود که به کسی که او را به صورت بشری کامل به مریم بخشید، نسبت داده شود، کمال به مادرش داده شد، که همان مقام اشرف است، پس عیسی به او نسبت داده شد و گفته شد: عیسی ابن مریم. این شرف به واسطه کمال، همان مقام درجه‌ای بود که مردان به واسطه آن بر زنان شرافت یافتند و فرزند به خاطر آن به پدرش نسبت داده شد.\nرسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) به کمال مریم و آسیه، همسر فرعون، شهادت داد. اما کمال آسیه به خاطر شرافت مقامی بود که فرعون ادعا می‌کرد. شایسته نبود که عرشی که او بر آن استیلا می‌یابد، جز موصوف به کمال باشد. پس کمال به آسیه رسید به واسطه شرافت مقامی که فرعون به واسطه آن شقی شد و به خسران آشکار پیوست، و همسرش به سعادت دست یافت. و به خاطر شرافت مقامی که کمال به واسطه آن برای او حاصل شد، گفت: رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً في الْجَنَّةِ (پروردگارا، برای من نزد خودت خانه‌ای در بهشت بنا کن). او را جز نیروی مقام (عِنْدَكَ) به سخن نیاورد، و او همجواری موسی یا هیچ یک از مخلوقات را نخواست، و شایسته او نیز نبود، زیرا حال بر او غلبه دارد. کامل زیر دست کامل قرار نمی‌گیرد، زیرا زیردستی به معنای نزول درجه است.\nو چون کمال مریم به واسطه عیسی در نسبت او به وی بود، آنچه را که آسیه گفت، نگفت. آسیه می‌گوید: نَجِّنِي من فِرْعَوْنَ وعَمَلِهِ ونَجِّنِي من الْقَوْمِ الظَّالِمِينَ (مرا از فرعون و عملش نجات ده و مرا از قوم ستمکار نجات ده) تا حرمت نسبت شکسته نشود. و مریم می‌گوید: يا لَيْتَنِي مِتُّ قَبْلَ هذا وكُنْتُ نَسْياً مَنْسِيًّا (ای کاش پیش از این مرده بودم و فراموش شده‌ای از یاد رفته بودم)، در حالی که او در واقع امر نزد خدا مبرا بود. او این را به خاطر خدا نگفت، چنانکه آسیه (عِنْدَكَ) را مقدم داشت و جوار او و عصمت از دست دشمنانش را طلبید، بلکه مریم این را از روی حیا از مردم گفت، به خاطر آنچه از پاکی خاندان و پدرانش می‌دانست، پس ترسید که از جانب او ننگی به آن‌ها وارد شود.\nو چون ذکر کردیم که عالم در غیب خدا مستور بود، و آن غیب به منزله سایه برای شخص بود، اگر چیزی از تمام سایه جدا شود، بر صورت سایه خارج می‌شود، و سایه بر صورت چیزی است که سایه آن است. پس آنچه از سایه جدا شده خارج می‌شود، بر صورت شخص است. آیا نمی‌بینی که چون روز از شب جدا شد، نور آشکار گشت؟ پس اشیایی که در شب مستور بودند، با نور روز ظاهر شدند. روز شبیه شب نشد، بلکه شبیه نور شد در آشکار ساختن اشیاء به واسطه آن. پس شب سایه نور بود، و روز هنگامی که از شب جدا شد، بر صورت نور خارج گشت. همچنین عالم در خروجش از غیب، بر صورت عالم به غیب خارج شد، همان‌گونه که مقرر کردیم.\nپس از این مقام، علمی از خدا برای تو آشکار شد که اگر قدر آن را بدانی، کفایت می‌کند. فَلا تَكُونَنَّ من الْجاهِلِينَ (پس از جاهلان مباش).\nاما مسئله روح صورت این عالم و ارواح صور عالم بالا و پایین، اکنون آن را در این مسئله از این منزل، در درجه هشتم آن، برای تو شرح می‌دهم. زیرا این منزل حاوی هفده صنف از علم است و این یکی از آن‌هاست.\nپس می‌گوییم: روح عالم کبیر، همان غیبی است که عالم از آن خارج شده است. پس بفهم. و اگر قول او را تعقل کنی و بشناسی، تو را کفایت می‌کند که او مظهر اکبر اعلی است: أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ (آیا ندیدی که پروردگارت چگونه سایه را گسترانید؟).\nو پس از آنکه روح عالم کبیر برای تو آشکار شد، باقی می‌ماند که بدانی آیا ارواح صور عالم، موجود شده از صورت هستند، یا قبل از آن، یا همراه آن؟ و منزلت ارواح نسبت به صور عالم، مانند منزلت ارواح صور اعضای انسان صغیر است، مانند قدرت که روح دست است، و شنوایی که روح گوش است، و بینایی که روح چشم است.\n\n[ارواح مدبر صور در حضرت جمال موجود بودند]\n\nبدان که مردم در این مسئله اختلاف کرده‌اند، همان‌گونه که تفصیل آن را ذکر کردیم. تحقیق در این باره نزد ما این است که ارواح مدبر صور، در حضرت جمال (حضرة الجمال) موجود بودند، در حالی که اعیان آن‌ها تفصیل نیافته بود، اما نزد خدا در علم او مفصل بودند. پس در حضرت اجمال (حضرة الإجمال) مانند حروفی بودند که بالقوه در مرکب وجود دارند و برای خودشان متمایز نشده بودند، اگرچه نزد خدا در حال اجمالشان متمایز و مفصل بودند.\nهنگامی که قلم در لوح نوشت، صور حروف مفصل ظاهر شدند، پس از آنکه در مرکب مجمل بودند. پس گفته شد: این الف است و باء و جیم و دال، در بسیط‌ها (البسائط)، و این‌ها ارواح بسیط‌ها هستند. و گفته شد: این «قام» است و این «زید» و این «خرج» و این «عمرو»، و این‌ها ارواح اجسام مرکب هستند.\nو هنگامی که خداوند صور عالم را، هر عالمی که خواست، تسویه کرد، روح کل (الروح الکل) مانند قلم و دست راست نویسنده بود، و ارواح مانند مرکب در قلم، و صور مانند منازل حروف در لوح. پس روح را در صور عالم دمید، و ارواح به واسطه صورشان متمایز شدند. پس گفته شد: این زید است و این عمرو، و این اسب است و این فیل، و این مار است. و هر موجودی دارای روح است، و در آنجا جز صاحب روح نیست، اما برخی مدرِک هستند و برخی غیر مدرِک.\nبرخی از مردم گفته‌اند که ارواح در اصل وجودشان متولده از مزاج صورت می‌شوند، و برخی دیگر این را منع کرده‌اند. و هر یک وجهی دارد که به آن استناد می‌کند.\nطریقه میانه، همان است که ما به آن معتقدیم، و آن قول خداوند است: ثُمَّ أَنْشَأْناهُ خَلْقاً آخَرَ (سپس او را آفرینشی دیگر پدید آوردیم).\nو هنگامی که خداوند صور جسمانی را تسویه کرد، در هر صورتی از صور روحانی که خواست، آن را مرکب ساخت؛ اگر خواست در صورت خوک یا سگ یا انسان یا اسب، بر اساس آنچه عزیز و علیم مقدر کرده است. پس شخصی هست که بلادت و بهیمیت بر او غالب است، پس روح او روح حمار است، و به آن خوانده می‌شود، هنگامی که حکم آن روح ظاهر شود، گفته می‌شود: فلان حمار است. و همچنین هر صفتی که تُدْعى‏ إِلى‏ كِتابِهَا (به کتاب خود خوانده می‌شود)، گفته می‌شود: فلان سگ است، و فلان شیر است، و فلان انسان است، که کامل‌ترین صفات و کامل‌ترین ارواح است.\nخداوند متعال می‌فرماید: الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ (آن که تو را آفرید و سامان داد و معتدل ساخت). و نشأت ظاهری برای چشم کامل شد: في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ (در هر صورتی که خواست تو را ترکیب کرد) از صور ارواح. پس به آن نسبت داده می‌شود، همان‌گونه که ذکر کردیم، و این‌ها نزد خدا معین هستند. پس ارواح به واسطه صورشان متمایز شدند.\nسپس هنگامی که این مواد را ترک می‌کنند، گروهی از اصحاب ما می‌گویند که ارواح تجردی کلی از مواد پیدا می‌کنند و به اصل خود بازمی‌گردند، همان‌گونه که شعاع‌های خورشید که از جسم صیقلی متولد شده‌اند، هنگامی که زنگار می‌گیرد، به خورشید بازمی‌گردند.\nو در اینجا بر دو طریق اختلاف کرده‌اند: گروهی گفتند که پس از مفارقت، برای خودشان متمایز نمی‌شوند، همان‌گونه که آب ظرف‌هایی که در کنار رودخانه هستند، هنگامی که می‌شکنند و آبشان به رودخانه بازمی‌گردد، متمایز نمی‌شود. پس اجسام همان ظرف‌ها هستند و آبی که از آن رودخانه پر شده، مانند ارواح از روح کل (الروح الکل) است.\nو گروهی گفتند: بلکه ارواح به واسطه مجاورت با جسم، هیئت‌های بد و خوب کسب می‌کنند، و هنگامی که از اجسام جدا می‌شوند، به واسطه آن هیئت‌ها متمایز می‌شوند. همان‌گونه که آن آب اگر در ظرف‌ها باشد، اموری حالت آن را تغییر می‌دهد، یا در رنگ یا بو یا طعم آن. پس هنگامی که از ظرف‌ها جدا می‌شود، آنچه را که از بو یا طعم یا رنگ کسب کرده، در ذات خود همراه دارد. و خداوند آن هیئت‌های اکتسابی را بر آن‌ها حفظ می‌کند. و در این باره با برخی از حکما موافق بودند.\nو گروهی گفتند: ارواح مدبر پیوسته در عالم دنیا مدبر هستند. هنگامی که به برزخ منتقل می‌شوند، اجساد برزخی را تدبیر می‌کنند، و آن همان صورتی است که انسان خود را در خواب در آن می‌بیند، و همچنین در مرگ، که به آن صور تعبیر می‌شود. سپس روز قیامت در اجسام طبیعی برانگیخته می‌شوند، همان‌گونه که در دنیا بودند.\nو اختلاف اصحاب ما در مورد ارواح پس از مفارقت تا اینجا پایان می‌یابد. اما اختلاف غیر اصحاب ما در این باره بسیار است و قصد ما آوردن کلام کسی که از ما نیست، نمی‌باشد.\n\n[بهشتی که اهل آن در آخرت به آن می‌رسند، امروز مشهود است]\n\nو بدان ای برادر، خداوند تو را به رحمت خود سرپرستی کند، بهشتی که اهل آن در آخرت به آن می‌رسند، امروز برای تو مشهود است، از جهت محل آن، نه از جهت صورت آن. تو در آن هستی و بر همان حالی که داری، در آن می‌گردی، اما نمی‌دانی که در آن هستی، زیرا صورتی که تجلی (التجلی) در آن برای تو رخ داده، تو را محجوب کرده است.\nاهل کشف (أهل الکشف) که آنچه از مردم پنهان است را درک کرده‌اند، آن محل را می‌بینند؛ اگر بهشت باشد، آن را باغی سبز می‌بینند، و اگر جهنم باشد، آن را بر حسب اوصاف سرمای شدید و گرمای سوزانش و آنچه خداوند در آن آماده کرده است، می‌بینند. و بیشتر اهل کشف در ابتدای راه این را می‌بینند.\nو شریعت بر این امر تنبیه کرده است، به واسطه قول پیامبر:\n«بین قبر من و منبر من، باغی از باغ‌های بهشت است.»\nپس اهل کشف آن را باغی می‌بینند، همان‌گونه که فرمود.\nو رودهای نیل و فرات و سیحان و جیحان را رود عسل و آب و شراب و شیر می‌بینند، همان‌گونه که در بهشت است، زیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داد که این رودها از بهشت هستند.\nو کسی که خداوند پرده از دیده‌اش برنداشته و در کوری حجابش باقی مانده است، آن را درک نمی‌کند، مانند نابینایی که در باغی است، اما آن باغ از ذات او غایب نیست، ولی او آن را نمی‌بیند. پس لازم نیست که چون او آن را نمی‌بیند، در آن نباشد، بلکه او در آن است.\nو همچنین آن مکان‌هایی که رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) ذکر کرد که از آتش هستند، مانند بطن مُحَسِّر در مِنی و غیر آن. و به همین دلیل، شتاب در خروج از آن برای امتش تشریع شد. زیرا او (صَلَّى اللهُ عَليهِ وسَلَّم) چیزی را می‌بیند که آن‌ها نمی‌بینند و چیزی را شهود (الشهود) می‌کند که آن‌ها شهود نمی‌کنند.\nو برخی از مردم این کشف (الکشف) را همراه خود دارند و برخی ندارند، بر اساس آنچه خداوند از روی حکمتی که در خلق خود پنهان کرده، اراده نموده است.\nآیا نمی‌بینی که اهل ورع، هنگامی که خداوند آن‌ها را از خوردن حرام حفظ می‌کند، یکی از نشانه‌های آن نزد ایشان این است که آن خوردنی در نظرشان به صورتی که بر آن‌ها حرام است، تغییر می‌کند، مثلاً آن را خون یا خوک می‌بینند، پس از خوردن آن امتناع می‌کنند. و هنگامی که درباره کسب آن غذا تحقیق می‌شود، می‌یابند که به روش غیر مشروع کسب شده است.\nپس اهل الله تعالی دارای أَعْيُنٌ يُبْصِرُونَ بِها (چشم‌هایی که با آن‌ها می‌بینند) و آذانٌ يَسْمَعُونَ بِها (گوش‌هایی که با آن‌ها می‌شنوند) و قُلُوبٌ يَعْقِلُونَ بِها (دل‌هایی که با آن‌ها تعقل می‌کنند) و زبان‌هایی که با آن‌ها سخن می‌گویند، غیر از این چشم‌ها و گوش‌ها و دل‌ها و زبان‌هایی که بر این صورت هستند، می‌باشند. پس با آن چشم‌ها شهود می‌کنند، و با آن گوش‌ها می‌شنوند، و با آن دل‌ها تعقل می‌کنند، و با آن زبان‌ها سخن می‌گویند. پس کلامشان درست است.\nفَإِنَّها لا تَعْمَى الْأَبْصارُ ولكِنْ تَعْمَى الْقُلُوبُ الَّتِي في الصُّدُورِ (همانا چشم‌ها کور نمی‌شوند، بلکه دل‌هایی که در سینه‌ها هستند، کور می‌شوند) از حق (الحق) و پذیرش آن. صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَعْقِلُونَ (کر و لال و کورند، پس تعقل نمی‌کنند) از خدا، فَهُمْ لا يَرْجِعُونَ (پس بازنمی‌گردند) به سوی خدا.\nو به خدا سوگند که چشمانشان در صورت‌هایشان است و گوش‌هایشان در گوش‌هایشان است و زبان‌هایشان در دهان‌هایشان است، اما عنایت و حسنی (نیکی) برایشان سبقت نگرفته است. پس سپاس و شکر خدای را که ما را با آن دل‌ها و زبان‌ها و گوش‌ها و چشم‌ها زنده کرد.\nو در حدیث نبوی نزد اهل کشف (أهل الکشف) وارد شده است که صحیح است، اگرچه طریق آن نزد اهل نقل به دلیل ضعف راوی ثابت نشده است، و اگر در آن صادق بود، می‌گفت:\nرسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «اگر زیاده‌گویی در سخن شما و تزلزل در دل‌های شما نبود، آنچه را که من می‌بینم، می‌دیدید و آنچه را که من می‌شنوم، می‌شنیدید.»\nخداوند متعال می‌فرماید: لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ (تا برای مردم آنچه را که بر ایشان نازل شده است، بیان کنی). و بیشتر از این بیان صریح وجود ندارد، اما کجاست کسی که محل خود را برای آثار پروردگارش فارغ سازد؟ کجاست کسی که آنچه را می‌شنود بدون افزودن چیزی نقل کند؟ این بسیار کم است. و خداوند ولی توفیق است.\n\n[علم تحلیل]\n\nو بدان که این منزل شامل علم تحلیل (علم التحلیل)، و علم آنچه برای اهل آتش در آتش از علوم حاصل می‌شود هنگامی که وارد آن می‌شوند، و علم آنچه عالم طبیعت از اسرار الهی که از غیر آن دانسته نمی‌شود، عطا می‌کند، و علم سابقه و لاحقه که همان عاقبت است، و علم ترکیب براهین وجودی، و علم ایجاد روحانی و صوری، و علم سبب مؤدی به شقاوت، و علم آنچه نظام عالم به واسطه آن باقی می‌ماند و صورتش بر آن حفظ می‌شود، و علم تجلی (التجلی) در حجاب، و علم احکام الهی بر غیر طریق شارع، و علم توحید افعال، و علم پیوند دادن عوالم بالا به پایین و پایین به بالا، یا نزدیک به آن، علم پیوستن دورها به نزدیک‌ها و نزدیک‌ها به دورها است. و خداوند يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}