{
  "id": 342,
  "title": {
    "ar": "الباب الثاني والأربعون وثلاثمائة في معرفة منزل سرين منفصلين عن ثلاثة أسرار يجمعها حضرة واحدة من حضرات الوحي وهو من الحضرة الموسوية",
    "en": "Chapter Three Hundred and Forty-Two: Concerning the Gnosis of the Station of Two Secrets, which are distinct from Three Secrets, all united by a Single Presence (حضرة واحدة) from the Presences of Revelation (حضرات الوحي), and which belongs to the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب تین سو بیالیس: دو جداگانہ رازوں (سرین) کے منزل کی معرفت (المعرفۃ) میں، جو تین رازوں (أسرار) سے منفصل ہیں، جنہیں وحی (الوحي) کے حضوروں (حضرات) میں سے ایک حضور (حضرة واحدة) جمع کرتا ہے، اور یہ موسوی حضور (الحضرة الموسوية) سے ہے۔",
    "fa": "باب سیصد و چهل و دوم در معرفت دو سرّ جدا از سه سرّ که یک حضرت از حضرات وحی آن‌ها را جمع می‌کند و آن از حضرت موسوی است"
  },
  "content": {
    "ar": "## «الباب الثاني والأربعون وثلاثمائة في معرفة منزل سرين منفصلين عن ثلاثة أسرار يجمعها حضرة واحدة من حضرات الوحي وهو من الحضرة الموسوية»\n\n\n> ثلاثة أسرار وسران بعدها *** مريد وعلام وقدرة قادر\n\n\n> وسران قول شرطه في حياة من *** يقول لشي‏ء كن بحكمة فاطر\n\n\n> فسبحان من لا شي‏ء يدرك كنهه *** هو الأول المنعوت أيضا بآخر\n\n\n### [الوكالة هي الخلافة]\n\n\nقال تعالى لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فنفى ثم قال وهُوَ السَّمِيعُ الْبَصِيرُ فأثبت والآية تقتضي عموم الإثبات في عين النفي وفيما بعده إذا جعلت الكاف للصفة ويؤيد هذا النظر الخبر وهوقوله عليه السلام إن الله خلق آدم على صورته‏\n\n\nونفى مماثلته في حال اتصافه بهذا الوصف فورد الشرع بأنه إذا بويع لخليفتين سواء كان في خلافته عام الخلافة أو مقصورا\nعلى طائفة مخصوصة يقتل الآخر منهما فلا تماثل في تلك الطائفة أو في العموم بحسب ما يعطيه الوقت فلو لا حكم الإرادة وجودا وتقديرا لما أمر بقتل الآخر والقتل زوال من صفة الحكم فزل أنت يبقى هو فإنك الآخر فإن قال بعض العارفين فالأول هنا ليس بخليفة قلنا هو خليفة حقا عن أمر إلهي ونهي عن المشاركة فيما أمر به من خلافته عنك فقال رَبُّ الْمَشْرِقِ والْمَغْرِبِ لا إِلهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا والوكيل بلا شك خليفة الموكل فيما وكله فيه وقال أَلَّا تَتَّخِذُوا من دُونِي وَكِيلًا فنهي أن نتخذ وكيلا غيره فكونه إلها ما هو كونه وكيلا ونحن إنما تكلمنا في الوكالة وهي الخلافة وفي الوكيل وهو الخليفة كما ينظر باعتبار آخر قوله لنا وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ فلنا الإنفاق بحكم الخلافة والإنفاق ملك لنا والإنفاق تصرف فجعلناه عن أمره وكيلا عنا في الإنفاق أي خليفة لعلمنا بأنه يعلم من مواضع التصرف ما لا نعلمه فهو المالك وهو الخليفة فما ميز الله المراتب وأبانها لنا وظهر بأسمائه في أعيانها وتجلى لنا فيها إلا لننزله في كل مرتبة رأيناه نزل فيها فنحكم عليه بما حكم به على نفسه وهذا هو أتم العلم بالله أن نعلمه به لا بنظرنا ولا بإنزالنا تعالى الله الخالق أن نحكم عليه بما خلق دون أن يظهر له فيما حكم به عليه فيكون هو الحاكم على نفسه لا أنا وهذا معنى قول العلماء إن الحق لا يسمى إلا بما سمي به نفسه إما في كتابه أو على لسان رسوله من كونه مترجما عنه فمن أقامه الله في مقام الترجمة عنه بارتفاع الوسائط أو بواسطة الأرواح النورية وجاء باسم سماه به فلنا أن نسميه بذلك الاسم وسواء كان المترجم مشرعا لنا أو غير مشرع لا يشترط في ذلك إلا الترجمة عنه حتى لا نحكم عليه إلا به فإنه القائل تعالى إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً تميزون به وتفرقون بين ما ينبغي له وما ينبغي لكم فيعطي كل ذي حق حقه فله المقاليد وله الفتح بها ودونها ولنا الفتح بها وما هي لنا بل هي بيده وما كان بيده فليس يخرج عنه لأنه ما ثم إلى أين فهو المعطي والآخذ لأن الصدقة تقع بيد الرحمن‏\n\n\n### [أن الوحي الإلهي إنما ينزل من مقام العزة الأحمى‏]\n\n\nواعلم أن الوحي الإلهي إنما ينزل من مقام العزة الأحمى ولهذا لا يكون بالاكتساب لأنه لا يوصل إلى ذلك المقام بالتعمل ولو وصل إليه بالتعمل لم يتصف بالعزة فينزل الوحي لترتيب الأمور التي تقتضيها حكمة الوجود ولَوْ كانَ من عِنْدِ غَيْرِ الله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً يخالف ترتيب حكمة الوجود وليس إلا من الله فهو في غاية الأحكام والإتقان الذي لا يمكن غيره فليس في الإمكان أبدع من هذا العالم لأنه أعطاه خلقه وأنزله في منزلته التي يستحقها فانظر هذه القوة الإلهية التي أعطاها الله لمن أنزل عليه الوحي الذي لو أنزل عَلى‏ جَبَلٍ لَرَأَيْتَهُ خاشِعاً مُتَصَدِّعاً من خَشْيَةِ الله فإنهم علموا قدر من أنزله فرزقهم الله من القوة ما يطيقون به حمل ذلك الجلال فإذا سمعوا في الله ما يخالف ما تجلى لهم فيه تَكادُ السَّماواتُ يَتَفَطَّرْنَ مِنْهُ وتَنْشَقُّ الْأَرْضُ وتَخِرُّ الْجِبالُ هَدًّا أَنْ دَعَوْا لِلرَّحْمنِ وَلَداً وقد سمع ذلك أهل الله ورسله وما جرى عليهم شي‏ء من ذلك لما أعطاهم من قوة العلم إذ لا أقوى من العلم فتجلى لهم في قوله لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً ولَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا فعلم أهل الله من رسول ونبي وولي ما لم تعلمه السموات والأرض والجبال من الله فانتج لهم هذا العلم بالله قوة في نفوسهم حملوا بها ما سمعوه من قول من قال إن المسيح ابن الله وإن عزيرا ابن الله ولم يتزلزلوا ولو نزل ذلك على من ليست له هذه القوة لذاب في عينه لعظيم ما جاءه فانظر ما أكثف حجاب من اعتقد أن لله ولدا وما أشد عماه عن الحقائق وما مر علي في التجلي الإلهي أمر حيرني وأضعف قوتي أشد من قول الملائكة رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً فَاغْفِرْ لِلَّذِينَ تابُوا واتَّبَعُوا سَبِيلَكَ وقِهِمْ عَذابَ الْجَحِيمِ والله يقول ما عَلَى الْمُحْسِنِينَ من سَبِيلٍ وأي إحسان أعظم ممن ثاب واتبع سبيله وقول نوح وهو من الكمل من أهل الله ولِمَنْ دَخَلَ بَيْتِيَ مُؤْمِناً فهذا كأنه أبقى شيئا فإنه ما طلب المغفرة إلا للمؤمن ولم يذكر اتباع سبيل الله لأن المؤمن قد يكون مخالف أمر الله ونهيه والله يقول للمسرفين على أنفسهم إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً فهذا الصنف من الملائكة قاموا في مقام الأدب فحكم عليهم بهذا القول إيثارا للجناب الإلهي على الخلق ولهذا قدموا وأخروا وما أخبر الله عنهم في قوله قبل هذا الدعاء وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً ففيه روائح طلب المغفرة للمسيئين وأخروا أيضا قولهم وقِهِمُ السَّيِّئاتِ أن تقوم بهم فإنه أتم في العناية ومن تَقِ السَّيِّئاتِ يَوْمَئِذٍ أي يوم تقيه فَقَدْ رَحِمْتَهُ وهو قولهم وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً فجاء ما ذكروه في الوسط بين هذين كأنه إيثار للجناب الإلهي كما\n\n\nيقول النبي صَلَّى اللهُ عَليهِ وسَلَّم في القيامة سحقا سحقا\n\n\nوما علق الله‏\nالمغفرة إلا بالذنب حيث علقها وقال عن صنف آخر من الملائكة إنهم يَسْتَغْفِرُونَ لِمَنْ في الْأَرْضِ فأنزل هؤلاء المغفرة موضعها ما قالوا مثل ما قال ذلك الصنف الآخر الذي حكى الله عنهم إنهم يَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا فتنوعت مشاربهم كما قالوا وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ والولي الكامل يدعو الله بكل مقام ولسان والرسل تقف عند ما أوحى به إليها وهم كثيرون وقد يوحى إلى بعضهم ما لا يوحى إلى غيره والمحمدي يجمع بمرتبته جميع ما تفرق في الرسل من الدعاء به فهو مطلق الدعاء بكل لسان لأنه مأمور بالإيمان بالرسل وبما أنزل إليهم فما وقف الولي المحمدي مع وحي خاص إلا في الحكم بالحلال والحرمة وأما في الدعاء وما سكت عنه ولم ينزل فيه شي‏ء في شرع محمد صَلَّى اللهُ عَليهِ وسَلَّم يؤذن بتركه فلا يتركه إذا نزل به وحي على نبي من الأنبياء عليه السلام رسولا كان أو غير رسول‏\n\n\n### [اختلاف أمتي رحمة]\n\n\nثم اعلم أنه من رحمة الله بعباده أن جعل حكم ما اختلفوا فيه إلى الله فنأخذ هذا من جهة علم الرسوم أن ننظر ما اختلفوا فيه وتنازعوا فإن كان لله ولرسوله حكم فيه يعضد قول أحد المخالفين جعلنا الحق بيده فإنا أمرنا أن تنازعنا في شي‏ء أن نرده إلى الله ورسوله إن كنا مؤمنين فإن كنا عالمين ممن يدعو على بصيرة وعلى بينة من ربنا فنحكم في المسألة بالعلم وهو رد إلى الله تعالى من غير طريق الايمان وليس لنا العدول عنه البتة هذا حد علم الرسم وأما علم الحقيقة فإن المختلفين حكمهم إلى الله أي حكم ظهور الاختلاف فيهم إلى الله من حيث إن الأسماء الإلهية هي سبب الاختلاف ولا سيما أسماء التقابل يؤيد ذلك قوله في مثل هذا ذلِكُمُ الله رَبِّي لأنه ليس غير أسمائه فإنه القائل قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ ولم يقل بالله ولا بالرحمن فجعل الاسم عين المسمى هنا كما جعله في موضع آخر غير المسمى فلما قال ذلِكُمُ الله رَبِّي والإشارة بذا إلى الله المذكور في قوله فَحُكْمُهُ إِلَى الله فلو لم يكن هنا الاسم عين المسمى في قوله الله لم يصح قوله ربي والخلاف ظهر في الأسماء الإلهية فظهر حكم الله في العالم به فيحكم على الخلاف الواقع في العالم بأنه عين حكم الله ظهر في صورة المخالفين‏\n\n\n### «وصل» في الأجور\n\n\nوهي الحقوق التي تطلبها الأعمال مخصوصة وهي حكم سار في القديم والمحدث فكل من عمل عملا لغيره استحق عليه أجرا والأجور على قسمين معنوية وحسية فإذا استأجر أحد أحدا على عمل ما من الأعمال فعمله فقد استوجب به العامل حقا على المعمول له وهو المسمى أجرا ووجب على المعمول له أداء ذلك الحق وإيصاله إليه والمؤجر مخير في استعمال الأجير في الظاهر مضطر في الباطن والأجير مخير في قبول الاستعمال في بعض الأعمال مقهور في بعض الأعمال وحكم الخيار ما زال عنه لأن له أن لا يقبل إن شاء وأن يقبل إن شاء فهو مخير في الظاهر مضطر في الباطن كالمؤجر له سواء فأول أجير ظهر في الوجود عن افتقار الممكن إلى الإيجاد وهو عمل الوجود في الممكن حتى يظهر عينه من واجب الوجود هو واجب الوجود فقال الممكن للواجب في حال عدمه أريد أن أستعملك في ظهور عيني فالإيجاد هو العمل والوجود هو المعمول والموجود هو الذي ظهر فيه صورة العمل فكل معمول معدوم قبل عمله فقال له الحق فلي عليك حق إن أنا فعلت لك ذلك وأظهرتك وهذا الحق هو المسمى أجرا والذي طلب المؤجر من المؤجر يسمى إجارة والمؤجر مخير في نفسه ابتداء في تعيين الأجر فإن شاء عين له ما يعطيه على ذلك العمل وإن شاء جعل التعيين للمؤجر والمؤجر مخير في قبول ما عينه المؤجر إن كان عين له شيئا أورده وإن تبرع المؤجر بالعمل من نفسه وقال لا آخذ على ذلك أجرا فله ذلك ولكن لا يزول حكم القيمة من ذلك العمل لأن العمل بذاته هو الذي يعين الأجر بقيمته فإن شاء العامل أخذه وإن شاء تركه ولا يسقط حكم العمل إن أجره كذا وهذه مسألة عجيبة تدور بين اختيار واضطرار في المؤجر والمؤجر وكل واحد مجبور في اختياره غير إن الحق لا يوصف بالجبر والممكن يوصف بالجبر مع علمنا أنه ما يبدل القول لديه ولا يخرج عن عمل ما سبق في علمه إن يعمله وعن ترك ما سبق في علمه إن يتركه وليس الجبر سوى هذا غير أن هنا عين الذي يجبره هو عين المجبور إذ ما جبره إلا علمه وعلمه صفته وصفته ذاته والجبر في الممكن أن يجبره غيره لا عينه ولو رام خلاف ما جبر عليه لم يستطع فهو مجبور عن قهر مخير بالنظر إلى ذاته وفي الأول جبر بالنظر إلى ذاته مخير بالنظر إلى العمل من حيث المعمول له فاتفق الممكن مع الواجب الوجود أنه إن عمل فيه الإيجاد وظهرت عينه إنه يستحق عليه أي على الممكن في ذلك أن يعبده ولا يشرك به شيئا وأن يشكره على ما فعل معه من إعطائه الوجود بالثناء عليه بالتسبيح بحمده فقيل الممكن ذلك فأوجده الحق سبحانه فلما\nأوجده طلب منه ما استحق عليه من الأجر في ذلك ولم يجعل نفسه في إيجاده متبرعا فقال له اعبدني وسبح بحمدي فسبحه وعبده جميع ما أوجده من الممكنات ووفاه أجره ما عدا بعض الناس فلم يوفه أجر ما أوجده له فتعينت عليه مطالبة العامل وتعين على الحكم العدل أن يحكم على المعمول له بأداء الأجر الذي وقع الاتفاق عليه وسرى حكم هذه الإجارة في جميع الممكنات لأن الأعمال تطلبها بذاتها ولهذا إذا تبرع العامل وترك الأجر لا يزيل ذلك قيمة ذلك العمل فيقال قيمة هذا العمل كذا وكذا سواء أخذ العامل أجره أو لم يأخذه وسواء قدره ابتداء أو لم يقدره فإن صورة العمل تحفظ قيمة الأجر وقد أخبر الله عن نفسه أنه داخل تحت حكم هذه الحقوق وكيف لا يكون ذلك وهو الحكيم مرتب الأشياء مراتبها فمنها ما لم نعرفه حتى عرفنا به مثل قوله وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ فالنصر أجر الايمان لذاته ولكن يقتضيه المؤمن وهو الذي صفته الايمان وهو سبحانه وفى فلا بد من نصر الايمان ولا يظهر ذلك إلا في المؤمن والمؤمن لا يتبعض فيه الايمان فاعلم ذلك وكل من تبعض فيه الايمان لأجل تعداد الأمور التي يؤمن بها فآمن المؤمن ببعضها وكفر ببعضها فليس بمؤمن فما خذل إلا من ليس بمؤمن فإن الايمان حكمه أن يعم ولا يخص فلما لم يكن له وجود عين في الشخص لم يجب نصره على الله فإذا ظهر الكافر على المؤمن في صورة الحكم الظاهر فليس ذلك بنصر للكافر عليه وإنما الذي يقابله لما ولى وأخلي له موضعه ظهر فيه الكافر وهذا ليس بنصر إلا مع وقوف الخصم فيغلبه بالحجة ومما أوجب الحق من ذلك على نفسه أيضا أعني من الأجر الرحمة فجعلها أجرا على نفسه واجبا لمن تاب من بعد ما عمل من السوء وأصلح عمله وقد يتبرع متبرع بأجر يتحمله لعامل عمل لغيره عملا لم يعمله لهذا المتبرع مثل قوله في المظلوم إذا عفا عمن ظلمه ولم يؤاخذه بما استحق عليه وأَصْلَحَ فَأَجْرُهُ عَلَى الله وكان ينبغي أن يكون أجره على من تركت مطالبته بجنايته فتحمل الله ذلك الأجر عنه إبقاء على المسي‏ء ورحمة به فلا يبقى للمظلوم عليه حق يطالبه به ولما كان العمل يطلب الأجر بذاته ويعود ذلك على العامل وأداء الرسائل عمل من المؤدي لأن المرسل استعمله في أداء رسالته لمن أرسله إليه فوجب أجره عليه لأن المرسل إليه ما استعمله حتى يجب عليه أجره ولهذا قالت الرسل لأممها عن أمر الله تعريفا للأمم بما هو الأمر عليه قُلْ ما أَسْئَلُكُمْ عَلَيْهِ من أَجْرٍ ... إِنْ أَجْرِيَ إِلَّا عَلَى الله فذكروا استحقاق الأجر على من يستعملهم ولم يقولوا ذلك إلا عن أمره فإنه قال لكل رسول قُلْ ما أَسْئَلُكُمْ عَلَيْهِ من أَجْرٍ واختص محمد صَلَّى اللهُ عَليهِ وسَلَّم بفضيلة لم ينلها غيره عاد فضلها على أمته ورجع حكمه صَلَّى اللهُ عَليهِ وسَلَّم إلى حكم الرسل قبله في إبقاء أجره على الله فأمره الحق أن يأخذ أجره الذي له على رسالته من أمته وهو أن يودوا قرابته فقال له قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً أي على تبليغ ما جئت به إليكم إِلَّا الْمَوَدَّةَ في الْقُرْبى‏ فتعين على أمته أداء ما أوجب الله عليهم من أجر التبليغ فوجب عليهم حب قرابته صَلَّى اللهُ عَليهِ وسَلَّم وأهل بيته وجعله باسم المودة وهي الثبوت في المحبة فلما جعل له ذلك ولم يقل إنه ليس له أجر على الله ولا أنه بقي له أجر على الله وذلك ليجدد له النعم بتعريفه ما يسر به فقيل له بعد هذا قل لأمتك آمرا ما قاله رسول لأمته قُلْ ما سَأَلْتُكُمْ من أَجْرٍ فَهُوَ لَكُمْ إِنْ أَجْرِيَ إِلَّا عَلَى الله فما أسقط الأجر عن أمته في مودتهم للقربى وإنما رد ذلك الأجر بعد تعينه عليهم فعاد ذلك الأجر عليهم الذي كان يستحقه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيعود فضل المودة على أهل المودة فما يدري أحد ما لأهل المودة في قرابة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من الأجر إلا الله ولكن أهل القربى منهم ولهذا جاء بالقربى ولم يجي‏ء بالقرابة فإنه لا فرق بين عقيل في القرابة النسبية وبين علي فإنهما ابنا عم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في النسب فعلى جمع بين القربى والقرابة فوددنا من قرابته صَلَّى اللهُ عَليهِ وسَلَّم القربى منهم وهم المؤمنون ولذلك فرق عمر رضي الله عنه بين من هو أقرب قرابة\n\n\nوأقرب قربى وهو عربي نزل القرآن بلسانه فلو لا ما في ذلك فرقان في لسانهم واصطلاحهم ما فرق عمر بين القربى والقرابة وانظر ذلك في القرآن في المغانم في قوله تعالى فَأَنَّ لِلَّهِ خُمُسَهُ ولِلرَّسُولِ ولِذِي الْقُرْبى‏ وليسوا إلا المؤمنين من القرابة فجاء بلفظ القربى دون لفظ القرابة فإن القرابة إذا لم يكن لهم قربى الايمان لا حظ لهم في ذلك ولا في الميراث وهو قول النبي صَلَّى اللهُ عَليهِ وسَلَّم يوم دخل مكة ما ترك لنا عقيل من دار\n\n\nلأنه الذي ورث أباه دون علي لإيمان علي وكفر عقيل وقال تعالى لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ‏\nفلو كان المودة في القربى التي سألها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم منا يريد به القرابة ما نفاها الحق عنها في قوله يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولو كانوا قرابتهم فعلمنا إن الْمَوَدَّةَ في الْقُرْبى‏ أنها في أهل الايمان منهم وهم الأقربون إلى الله فتميز صَلَّى اللهُ عَليهِ وسَلَّم عن سائر الرسل عليه السلام بما أعطى الله لأمته في مودتهم في القربى وتميزت أمته على سائر الأمم بما لها من الفضل في ذلك لأن الفضل الزيادة وبالزيادة كانت خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم وإن كانت كل أمة تأمر بالمعروف وتنهى عن المنكر ويؤمنون بالله فخصت هذه الأمة بأمور لم يخص بها أمة من الأمم ولها أجور على ما خصصت به من الأعمال مما لم يستعمل فيها غيرهم من الأمم فتميزوا بذلك يوم القيامة وظهر فضلهم فالأجور مترددة بين الحق والخلق للحق أجر على خلقه لأعمال عملها لهم وللخلق أجر على الله لأعمال عملوها له ولأعمال عملوها للخلق رعاية للحق كالعفو من العافين عن الناس وللخلق أجر على الخلق بتشريع الحق وحكمه في ذلك والذي يؤول إليه الأمر في هذه المسألة أن الأجور تتردد ما بين الحق والحق ليس للخلق في ذلك دخول إلا أنهم طريق لظهور هذه الأجور لو لا وجد الخلق في ذلك لم يظهر للاجارة حكم ولا للأجر عين ولذلك كان الأجر جَزاءً وِفاقاً لأن المؤجر حق والمؤجر حق إذ لا عامل إلا خالق العمل وهو الحق والخلق عمل وفيه ظهور العمل فلذلك زاحم وأدخل نفسه في ذلك وأقره الحق على هذه المزاحمة وقبلها فمن الخلق من علم ذلك ومنهم من جهله وهذا المنزل يتسع المجال فيه ولا سيما لو أخذنا في تعيين الأجور وأصحابها فلنذكر ما يتضمن هذا المنزل من العلوم فمن ذلك علم أجور الخلق دون الحق وفيه علم الاتصال بمن والانفصال عمن والانفصال والاتصال فيمن وهو علم غريب يتضمن الوجود كله وغير الوجود فإن الوجود المقيد قد انفصل عن حال العدم واتصل بحال الوجود انفصال ترجيح واتصال ترجيح وأما الوجود المطلق فانفصاله عن العدم انفصال ذاتي غير مرجح فمن علم هذا العلم علم أين كان وممن انفصل وبمن اتصل وفيه علم التشبيه في المعاني بالمناسبات وفيه علم الترتيب في التوقيت وبه يتعلق علم القضاء والقدر وفيه علم الملك والتمليك وهل حكم التمليك إذا وقع حكم الملك الأصلي أو يختلف حكمهما وفيه علم ما تميز به عالم الأركان من عالم الأفلاك الأخرى ولما ذا قبل الاستحالة عالم الأركان فذهبت أعيان صوره كما تذهب صور أركانه باستحالة بعضها إلى بعض بالسخافة والكثافة وعالم الأفلاك ليس كذلك وإنما استحالتهم ظهورهم في الصور التي يظهرون فيها لعالم الأركان ولما كانت هذه الاستحالة في الصور الطبيعية التي ظهرت من دون الطبيعة ولم تظهر في العالم الذي فوق الطبيعة وظهرت في التجلي الإلهي وظهر حكمه بالاستحالة العنصرية في أعيان صوره وفي صوره بل لا في صوره وهل يرجع هذا كله لتغير الأمر في نفسه أو يكون ذلك في نظر الناظر وفيه علم المتقابلات هل يفتقر العلم به إلى العلم بمقابله أو ينفرد كل واحد في العلم بنفسه دون العلم بالمقابل من غير توقف عليه وهذا لا يكون إلا عند من لا يرى أن العين واحدة وفيه علم أثر الطبيعة في الملإ الأعلى ومكانه وفيه علم أحوال الملإ الأعلى وفيه علم اجتماع الموحدين والمشركين في الحفظ الإلهي وهل ذلك من باب الاعتناء بالخلق وإن جهلوا أو هو من باب إعطاء الحقائق في أن لا يكون الأمر إلا هكذا إلا أنه من باب العناية وهو عندنا من باب العناية بالإعلام الإلهي بذلك بطريق الإيماء لا بالتصريح لأن هذا من علم الأسرار التي لا تفشي في العموم ولكن لها أهل ينبغي للعالم بذلك أن يبديه لأهله فإنه إذا لم يعطيه لأهله فقد ظلم الجانبين العلم ومن هو أهل له وفيه علم مراتب الأدوات العاملة والظاهرة أحكامها في العبارات وهو علم الحروف التي جاءت لمعنى فمنها مركب وغير مركب وفيه علم تقسيم الظالمين من ينصر منهم ممن لا ينصر ولما ذا يرجع الظلم في وجوده هل وجوده من الظلمة أو من النور وفيه علم كون الحق عين الأشياء ولا يعرف‏\n\n\nوفيه علم الفرق بين الحياة والأحياء وإذا وقع الأحياء بما ذا يقع هل بالحياة القديمة أو ثم حياة حادثة تظهر بالإحياء في الأحياء وفيه علم الرجوع ممن والى من والاعتماد فيما ذا وعلى من وفيه علم فيما ذا خلق الله الخلق هل خلقه في شي‏ء أو خلقه لا في شي‏ء فيكون عين المخلوقات عين شيئياتها وفيه علم اشتراك الحق والخلق في الوجود وجميع ما اشتركوا فيه هل هو اشتراك معقول أو مقول لا غير وفيه علم النواميس الموضوعة في العالم هل تضمها حضرة واحدة جامعة أو لكل ناموس حضرة أو يجمعها حضرتان لا غير فينسب الناموس الواحد إلى الحكمة والناموس الآخر إلى الحكم‏\nالإلهي النبوي وإن كثرت أنواعها وفيه علم الاختصاص الإلهي لبعض المخلوقات بما ذا وقع هل بالعناية أو بالاستحقاق وهو علم منع أهل الله عن كشفه في العموم والخصوص لأنه علم ذوق لا ينال بالقياس ولا بضرب المثل وفيه علم كلمة الوصل والفصل هل هي كلمة واحدة أو كلمتان وفيه علم تفاضل أهل الكتب هل هو راجع لفضل الكتب أم لا وهل للكتب المنزلة فضل بعضها على بعض أم لا فضل فيها فإن الله جعل في نفس القرآن التفاضل بين السور والآيات فجعل سورة تعدل القرآن كله عشر مرات وأخرى تقوم مقام نصفه في الحكم وأخرى على الثلث وأخرى على الربع وآية لها السيادة على الآيات وأخرى لها من آي القرآن ما للقلب من نشأة الإنسان وللقرآن تميز بالإعجاز على غيره من الكتب وفيه علم المواخاة بين سور القرآن ولهذا\n\n\nقال عليه السلام شيبتني هود وأخواتها\n\n\nفجعل بينهن أخوة وفيه علم تقرير كل ملة على ما هي عليه وكل ذي نحلة على نحلته وما يلزمه من توفية حقها وفيه علم من فارق الجماعة ما حكمه وفيه علم المواخاة بين الكتب المنزلة من عند الله والموازين الإلهية الموضوعة في العالم على اختلاف صورها المعنوية والمحسوسة فالمعنوية كالبراهين الوجودية والجدلية والخطابية والموازين المحسوسة مشهود بالحس اختلافها وفيه علم مواطن العجلة من مواطن التثبط وفيه علم قوة اللطيف وضعف الكثيف وأن القوة للمتصرف والضعف للمتصرف فيه وفيه علم ما يقتضي الزيادة مما يقتضي النقص وما بينهما من الفضل وفيه علم تأخير حكم الحاكم عن إيقاعه في المحكوم عليه لشبهة تمنعه من ذلك حتى يستيقن أو يغلب على ظنه فيما لا يوصل إلى اليقين فيه فإن الكافر في الدنيا يمكن أن يرجع مؤمنا عند الموت فإن عجل فيه الحكم قبل الموت بالكفر فما أعطى الحاكم حكم الشبهة حقها في موطنها وفيه علم ما يقبل الزيادة من الأعمال مما لا يقبلها ولا يقبل النقص وهي في الشرائع من جاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْها وهو عَشْرُ أَمْثالِها ومن جاءَ بِالسَّيِّئَةِ فَلا يُجْزى‏ إِلَّا مِثْلَها وفيه علم نفوذ الكلمة هل هو لذاتها أم لا وإنها من الكلم وهو الجرح وهو أثر من الجارح في المجروح وكذلك كل كلمة لها أثر في السامع أدناه سماعه صورة ما نطق به وتكلم إلى ما فوق ذلك مما يحمله ذلك الكلام من المعاني وفيه علم أصل البغي في العالم وهل هو مشتق من بغي يبغي إذا طلب فيكون البغي لما ذمه الله طلبا مقيدا إذ كان الطلب منه ما هو مذموم ومنه ما هو محمود وما دواء ذلك البغي وفيه علم الطي والنشر لحكم الوقت وفيه علم الدلالات والآيات هل ذلك أي كونها دلالات وآيات لأنفسها أو هي بالوضع وفيه علم حدوث المشيئة لما ذا يرجع والحق لا تقوم به الحوادث وفيه علم النوازل هل تنزل ابتداء أو تنزل جزاء وفيه علم السكون والحركة وعلم المواطن التي ينبغي أن يظهر فيها حكم السكون وحكم الحركة وفيه علم ما يعطي الله عباده في الدنيا من علوم ومراتب وغير ذلك هل هو من الدنيا أو هو من الآخرة وفيه علم الاستجابة لأوامر الله إذا قامت صورتها ظاهرة هل تنفع بصورتها وأين تنفع أو هل لا تنفع إلا حتى ينفخ في تلك الصورة روح تحيا به وهو صورة الباطن ويتعلق بهذا العلم علم الصور مطلقا هل لها ظاهر وباطن أو منها ما هي ظاهرة لا باطن لها وفيه علم ما الباعث للحيوان كله على طلب الانتصار لنفسه هل هو دفع للاذى أو هو جزاء أو طلب انتقام أو بعضه لهذا وبعضه لهذا وفيه علم التحسين والتقبيح هل ذلك راجع لذات الحسن والقبح أو لأمر عارض وفيه علم ما يحب ويكره من النعوت وفيه علم ما يرفع الحرج ممن ظهر منه ما يكرهه الطبع وفيه علم الأسباب التي تمنع ما يطلب الطبع ظهوره وفيه علم ما لا يدرك إلا بالنظر الدقيق الخفي وفيه علم الإقامة والانتقال في الأحوال هل الأحوال تنتقل والعبد ثابت أو العبد منتقل في الأحوال والأحوال ثابتة وهو من العلوم الغريبة الموقوفة على الكشف وفيه علم ما ينكر من الحق مما لا ينكر وعلم ما يقره الحق من الباطل مما لا يقره وما الباطل الذي يقبل الزوال من الباطل الذي لا يقبله وفيه علم الإنتاج وغير الإنتاج مع وجود المقدمات ومتى تنتج المقدمات وفيه علم حجاب ظاهر النشأة وما مسمى البشر منها وهل لباطنها مباشرة كما لظاهرها أم لا وفيه علم ما الحجاب الذي بين الله وبين عبده وفيه علم الكلام المحدث والقديم لما ذا يرجع هل يختلف أو حكم ذلك واحد وفيه علم الأنوار ومراتبها وسبحات الوجه ولما ذا تعددت والوجه واحد والسبحات كثيرة وفيه علم التمييز بين السبل الإلهية وفيه علم المبدأ والمعاد والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "Chapter Three Hundred and Forty-Two: Concerning the Knowledge of the Station of Two Secrets Separated from Three Secrets, which are Gathered by a Single Presence (حضرة) from the Presences of Revelation (حضرات الوحي), and this is from the Mosaic Presence (الحضرة الموسوية).\n\nThree secrets, and two secrets follow them:\nThe Willer, the Knower, and the Power of the Powerful.\n\nAnd the two secrets are a saying whose condition lies in the life of Him\nWho says to a thing, \"Be!\" (كن) by the wisdom of the Originator.\n\nGlory be to Him whose essence (كنهه) nothing comprehends,\nHe is the First (الأول), also described as the Last (آخر).\n\n### [Vicegerency (الوكالة) is Caliphate (الخلافة)]\n\nThe Exalted said: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), thereby negating; then He said: <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (And He is the All-Hearing, the All-Seeing), thereby affirming. This verse necessitates the universality of affirmation within the very essence (عين) of negation, and in what follows, if the *kāf* (in *ka-mithlihi*) is taken to denote the attribute (صفة). This perspective is supported by the Hadith, which is his (peace and blessings be upon him) saying: \"Indeed, Allah created Adam upon His form.\"\n\nHe negated His likeness while being described by this attribute. Thus, the Sacred Law (الشرع) stipulated that if allegiance (بيعة) is sworn to two caliphs—whether in a general caliphate or restricted to a specific group—the latter of the two must be killed. This ensures there is no likeness (تماثل) in that group or in the general populace, according to what the time dictates. Were it not for the rule of Will (الإرادة), both in existence (وجودا) and predetermination (تقديرا), He would not have commanded the killing of the other. Killing is the removal of the attribute of rule (صفة الحكم). So, you vanish, and He remains, for you are the last. If some Gnostics (العارفين) say that the First here is not a Caliph (خليفة), we say: He is truly a Caliph by Divine command (أمر إلهي) and a prohibition against partnership in what He commanded concerning His caliphate over you. He said: <<رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَا إِلَهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا>> (The Lord of the East and the West; there is no god but Him, so take Him as a Trustee/Vicegerent (وَكِيلًا)). The Trustee (الوكيل) is undoubtedly the Caliph (خليفة) of the One who appointed him (الموكل) in the matter entrusted to him. And He said: <<أَلَّا تَتَّخِذُوا مِنْ دُونِي وَكِيلًا>> (Do not take any Trustee besides Me). Thus, He forbade us from taking any trustee other than Him. His being God is not the same as His being a Trustee. We are only discussing Vicegerency (الوكالة), which is Caliphate (الخلافة), and the Trustee (الوكيل), who is the Caliph (الخليفة).\n\nConsidering another aspect, look at His saying to us: <<وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ>> (And spend from that over which He has made you successors/caliphs (مُسْتَخْلَفِينَ)). We have the right to spend by virtue of the rule of Caliphate, and spending is our possession. Spending is an act of disposal (تصرف). So, by His command, we made Him a Trustee for us in spending—meaning, a Caliph—because we know that He knows the places of disposal that we do not know. Thus, He is the Owner (المالك) and He is the Caliph.\n\nAllah did not distinguish the Levels (المراتب) for us, nor make them clear, nor manifest Himself through His Names (أسمائه) in their essences (أعيانها), nor disclose Himself (تجلى) to us within them, except so that we may place Him in every Level where we see Him descend, and thus judge Him by what He judged Himself. This is the most perfect Knowledge (العلم) of Allah: that we know Him through Him, not through our own perspective or our own attribution. Exalted is Allah the Creator (الخالق) above our judging Him by what He created, unless He manifests Himself in what we judge Him by, so that He is the Judge of Himself, not us. This is the meaning of the scholars' saying: The Real (الحق) is only named by what He named Himself, either in His Book or upon the tongue of His Messenger, who acts as His interpreter (مترجما عنه). Therefore, whoever Allah establishes in the station of interpreting Him—whether by the removal of intermediaries or through the mediation of luminous spirits (الأرواح النورية)—and comes with a Name by which He named Himself, we are permitted to call Him by that Name. It makes no difference whether the interpreter establishes a law (مشرعا) for us or not; the only condition is that he interprets Him, so that we judge Him only by Him. For He, the Exalted, is the One who said: <<إِنْ تَتَّقُوا اللهَ يَجْعَلْ لَكُمْ فُرْقَانًا>> (If you fear Allah, He will grant you a Criterion (فرقانا)), by which you distinguish and differentiate between what is proper for Him and what is proper for you. Thus, He gives every possessor of a right his due. To Him belong the keys (المقاليد), and to Him belongs the opening (الفتح) with them and without them. We have the opening with them, but they are not ours; rather, they are in His Hand. And what is in His Hand does not depart from Him, because there is nowhere else to go. Thus, He is the Giver and the Taker, because \"charity falls into the Hand of the All-Merciful (الرحمن).\"\n\n### [That Divine Revelation (الوحي الإلهي) only descends from the Station of Most Guarded Might (مقام العزة الأحمى)]\n\nKnow that Divine Revelation only descends from the Station of Most Guarded Might. For this reason, it is not attained through acquisition (الاكتساب), because that station cannot be reached through striving (التعمل). If it were reached through striving, it would not be characterized by Might (العزة). Revelation descends to arrange the affairs necessitated by the wisdom of Existence (حكمة الوجود). <<وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا>> (And had it been from [any] other than Allah, they would have found within it much contradiction), contradicting the arrangement of the wisdom of Existence. Since it is only from Allah, it is in the utmost state of perfection (الإحكام) and mastery (الإتقان), which is impossible for any other. There is nothing more wondrous in possibility than this World (العالم), because He gave it its creation and placed it in the station (منزلته) it deserves.\n\nLook at this Divine Power (القوة الإلهية) that Allah granted to the one upon whom Revelation descended, which, <<لَوْ أُنْزِلَ عَلَى جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللهِ>> (had it been sent down upon a mountain, you would have seen it humbled, split apart from the fear of Allah). For they knew the worth of the One who sent it down, so Allah provided them with the strength to bear that Majesty (الجلال). When they hear concerning Allah what contradicts the way He disclosed Himself (تجلى) to them, <<تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الْأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا أَنْ دَعَوْا لِلرَّحْمَنِ وَلَدًا>> (The heavens almost rupture therefrom, and the earth splits open, and the mountains collapse in devastation, because they attribute to the Most Merciful a son).\n\nThe People of Allah (أهل الله) and His Messengers heard this, yet nothing of that happened to them, due to the strength of Knowledge (العلم) He granted them, for nothing is stronger than Knowledge. He disclosed Himself to them in His saying: <<لَوْ أَرَادَ اللهُ أَنْ يَتَّخِذَ وَلَدًا>> (If Allah had intended to take a son), and <<وَلَوْ أَرَدْنَا أَنْ نَتَّخِذَ لَهْوًا لَاتَّخَذْنَاهُ مِنْ لَدُنَّا>> (And if We had intended to take a diversion, We could have taken it from Ourselves). Thus, the People of Allah—including the Messenger, the Prophet, and the Saint (ولي)—knew concerning Allah what the heavens, the earth, and the mountains did not know. This Knowledge of Allah produced strength in their souls, by which they bore what they heard from those who said that the Messiah is the son of God or that Ezra is the son of God, and they were not shaken. Had that descended upon one who lacked this strength, he would have dissolved in his very essence (عينه) due to the magnitude of what came to him. Look, then, at how dense is the veil (حجاب) of one who believes that Allah has a son, and how severe is his blindness to the Realities (الحقائق).\n\nNothing has passed over me in the Divine Theophany (التجلي الإلهي) that perplexed me and weakened my strength more severely than the saying of the angels: <<رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ>> (Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of the Hellfire). Yet Allah says: <<مَا عَلَى الْمُحْسِنِينَ مِنْ سَبِيلٍ>> (There is no cause [for blame] against the doers of good (المحسنين)). And what greater doing of good (إحسان) is there than one who repents and follows His way? And the saying of Noah, who is among the Perfected Ones (الكمل) of the People of Allah: <<وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا>> (And for whoever enters my house as a believer). This seems to leave something out, for he only sought forgiveness for the believer (المؤمن) and did not mention following Allah's way, because a believer might disobey Allah's command and prohibition. Yet Allah says to those who transgress against themselves: <<إِنَّ اللهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا>> (Indeed, Allah forgives all sins).\n\nThis group of angels stood in the Station of Propriety (مقام الأدب), and this saying was decreed upon them out of preference for the Divine Presence (الجناب الإلهي) over creation (الخلق). This is why they put things forward and backward. What Allah informed about them in their saying before this supplication: \"You have encompassed all things in mercy and knowledge\"—in this, there are hints of seeking forgiveness for the wrongdoers (المسيئين). They also delayed their saying: \"And protect them from the evil deeds (السيئات) from arising in them,\" for this is more complete in providence (العناية). And whom <<وَمَنْ تَقِ السَّيِّئَاتِ يَوْمَئِذٍ>> (You protect from evil deeds that Day)—meaning, the Day You protect him—<<فَقَدْ رَحِمْتَهُ>> (You have certainly had mercy upon him). This relates to their saying: \"You have encompassed all things in mercy.\" Thus, what they mentioned came in the middle between these two, as if it were a preference for the Divine Presence, just as the Prophet (peace and blessings be upon him) will say on the Day of Resurrection: \"Away! Away!\"\n\nAllah only linked forgiveness to sin where He linked it. And He said concerning another group of angels that <<يَسْتَغْفِرُونَ لِمَنْ فِي الْأَرْضِ>> (they seek forgiveness for those on earth). These angels placed forgiveness in its proper place. They did not say what that other group said, about whom Allah related that <<يَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا>> (they seek forgiveness for those who have believed). Thus, their sources (مشاربهم) varied, just as they said: <<وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ>> (And there is none of us except that he has a known station (مقام)).\n\nThe Perfect Saint (الولي الكامل) supplicates to Allah from every station and with every tongue. The Messengers (الرسل) stop at what was revealed to them, and they are many; sometimes, something is revealed to one of them that is not revealed to another. The Muhammadan (المحمدي), by virtue of his Level (مرتبته), gathers all that was dispersed among the Messengers concerning supplication. Thus, he is absolute in supplication with every tongue, because he is commanded to believe in the Messengers and in what was revealed to them. The Muhammadan Saint does not stop at a specific revelation except concerning the ruling on what is lawful (الحلال) and what is forbidden (الحرمة). As for supplication, and matters concerning which the Law of Muhammad (peace and blessings be upon him) was silent and nothing was revealed that permitted its abandonment, he does not abandon it if a revelation concerning it descended upon any Prophet (peace be upon him), whether a Messenger or not.\n\n### [The difference of opinion (اختلاف) in my community is a mercy (رحمة)]\n\nThen know that it is from Allah's mercy upon His servants that He made the judgment concerning what they differ upon belong to Allah. We derive this from the perspective of the science of outward forms (علم الرسوم): we look at what they differed and disputed over. If Allah and His Messenger have a ruling concerning it that supports the saying of one of the disputants, we place the Truth (الحق) in his hand, for we were commanded, if we dispute over anything, to refer it back to Allah and His Messenger, if we are believers. If we are knowledgeable, among those who call upon insight (بصيرة) and clear evidence (بينة) from our Lord, then we judge the matter by Knowledge (العلم), which is a referral back to Allah the Exalted, but not through the path of faith (الايمان). We must never deviate from this. This is the limit of the science of outward forms (علم الرسم).\n\nAs for the science of Reality (علم الحقيقة), the judgment of those who differ belongs to Allah—meaning, the judgment of the manifestation of difference among them belongs to Allah, in that the Divine Names (الأسماء الإلهية) are the cause of the difference, especially the Names of Opposition (أسماء التقابل). This is supported by His saying in such a context: <<ذَلِكُمُ اللهُ رَبِّي>> (That is Allah, my Lord), because He is nothing other than His Names. For He is the One who said: <<قُلِ ادْعُوا اللهَ أَوِ ادْعُوا الرَّحْمَنَ>> (Say, \"Call upon Allah or call upon the Most Merciful\"), and He did not say \"by Allah\" or \"by the Most Merciful.\" Thus, He made the Name (الاسم) the very essence (عين) of the Named here, just as He made it other than the Named in another place. When He said: <<ذَلِكُمُ اللهُ رَبِّي>>, and the reference *dhā* (That) points to Allah mentioned in His saying: <<فَحُكْمُهُ إِلَى اللهِ>> (So His judgment is to Allah)—if the Name here, in His saying \"Allah,\" were not the very essence of the Named, His saying \"my Lord\" would not be sound. The difference appeared in the Divine Names, and thus Allah's ruling appeared in the World (العالم) through it. Therefore, the difference occurring in the World is judged to be the very essence of Allah's ruling, manifested in the form of the disputants.\n\n### «Supplement (وصل)» Concerning Wages/Rewards (الأجور)\n\nThese are the specific rights (الحقوق) demanded by actions (الأعمال). This is a ruling that permeates the Eternal (القديم) and the originated (المحدث). Everyone who performs an action for another deserves a wage (أجرا) from him. Wages are of two types: spiritual (معنوية) and sensory (حسية). If someone hires another for a certain action, and the worker performs it, the worker has established a right (حقا) upon the one for whom the work was done (المعمول له), which is called the wage. It becomes obligatory upon the one for whom the work was done to render that right and deliver it to him. The hirer (المؤجر) is outwardly free to choose (مخير) in employing the worker (الأجير), but inwardly compelled (مضطر). The worker is free to choose in accepting employment for some actions, but subjugated (مقهور) in others. The ruling of choice (الخيار) has not left him, because he may choose not to accept if he wishes, or accept if he wishes. Thus, he is outwardly free to choose, but inwardly compelled, just like the hirer.\n\nThe first worker who appeared in Existence (الوجود) due to the contingent (الممكن) needing to be brought into existence (الإيجاد)—which is the action of Existence in the contingent until its essence (عينه) appears from the Necessary Existent (واجب الوجود)—is the Necessary Existent Himself. The contingent said to the Necessary Existent, while in its state of non-existence (عدمه): \"I wish to employ You in the manifestation of my essence.\" The bringing into existence (الإيجاد) is the action (العمل), Existence (الوجود) is the object of the action (المعمول), and the existent (الموجود) is that in which the form of the action appeared. The Real (الحق) said to it: \"I have a right (حق) upon you if I do that for you and manifest you.\" This right is called the wage (أجرا). What the hirer requested from the worker is called the hiring (إجارة). The hirer is initially free to choose in determining the wage. If he wishes, he specifies what he will give him for that action, and if he wishes, he leaves the specification to the worker. The worker is free to choose whether to accept what the hirer specified; if something was specified for him, he receives it. If the worker volunteers the action himself and says, \"I will not take a wage for this,\" he may do so. However, the ruling of value (القيمة) is not removed from that action, because the action itself determines the wage by its value. If the worker wishes, he takes it; if he wishes, he leaves it. The ruling that the wage for the action is such-and-such is not dropped.\n\nThis is a wondrous issue revolving between choice (اختيار) and compulsion (اضطرار) for both the hirer and the worker. Each is compelled (مجبور) in his choice, except that the Real is not described by compulsion (الجبر), while the contingent is described by compulsion, even though we know that the Word does not change with Him, and He does not depart from performing what preceded in His Knowledge (علمه) that He would perform, nor from abandoning what preceded in His Knowledge that He would abandon. Compulsion is nothing other than this, except that here, the very essence (عين) of the one who compels Him is the very essence of the compelled, since nothing compels Him but His Knowledge, and His Knowledge is His Attribute (صفته), and His Attribute is His Essence (ذاته). Compulsion in the contingent is that it is compelled by another, not by its own essence. If it sought to contradict what it was compelled upon, it would be unable. Thus, it is compelled by subjugation (قهر), yet free to choose when viewed in relation to its own essence. In the case of the First (the Real), there is compulsion when viewed in relation to His Essence, yet freedom of choice when viewed in relation to the action from the perspective of the object of the action.\n\nThe contingent agreed with the Necessary Existent that if He performed the act of bringing into existence in it and its essence appeared, He would deserve from it—meaning, from the contingent—that it worship Him, not associate anything with Him, and thank Him for what He did for it by granting it Existence (الوجود), by praising Him with glorification (التسبيح بحمده). The contingent accepted this, and the Real, the Glorified, brought it into existence. When He brought it into existence, He demanded from it what He deserved as a wage for that, and He did not make Himself a volunteer in His act of bringing into existence. He said to it: \"Worship Me and glorify Me with My praise.\" All the contingents (الممكنات) He brought into existence glorified and worshipped Him and fulfilled His wage, except for some people who did not fulfill the wage for bringing them into existence. Thus, the demand of the Worker (العامل) became incumbent upon them. It became incumbent upon the Just Judge (الحكم العدل) to rule upon the object of the action (المعمول له) to pay the wage upon which the agreement was made.\n\nThe ruling of this hiring (الإجارة) permeated all contingents, because actions demand it by their very essence (بذاتها). For this reason, if the worker volunteers and abandons the wage, this does not remove the value (قيمة) of that action. It is said: \"The value of this action is such-and-such,\" whether the worker took his wage or not, and whether he estimated it initially or not. The form of the action preserves the value of the wage.\n\nAllah has informed about Himself that He falls under the ruling of these rights (الحقوق). How could this not be, when He is the Wise (الحكيم) One who arranges things according to their Levels (مراتبها)? Among these are things we did not know until He informed us of them, such as His saying: <<وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ>> (And it was incumbent upon Us to support the believers). Support (النصر) is the wage for faith (الايمان) in itself, but the believer (المؤمن) demands it, and he is the one whose attribute is faith. He, the Glorified, fulfilled it, so the support of faith is inevitable, and this only manifests in the believer. Faith does not admit of division (لا يتبعض) in the believer, so know that. Anyone in whom faith is divided due to the enumeration of things to be believed in—so the believer believes in some and disbelieves in others—is not a believer. Only he who is not a believer is abandoned (خذل). For the ruling of faith is that it must be universal, not specific. Since it did not have an essential existence (وجود عين) in the person, his support was not obligatory upon Allah. Therefore, if the disbeliever (الكافر) prevails over the believer in the form of the apparent ruling, that is not a victory (نصر) for the disbeliever over him. Rather, when the one who opposes him turns away and leaves his place empty, the disbeliever appears in it. This is not a victory unless the opponent stands firm and is overcome by argument (الحجة).\n\nAmong what the Real also made obligatory upon Himself—meaning, concerning the wage—is Mercy (الرحمة). He made it a wage obligatory upon Himself for whoever repents after having done evil and amends his action. Sometimes a volunteer takes upon himself a wage for a worker who performed an action for someone else, an action not performed for this volunteer. An example is His saying concerning the wronged person (المظلوم) who forgives the one who wronged him and does not hold him accountable for what he deserved: <<وَأَصْلَحَ فَأَجْرُهُ عَلَى اللهِ>> (and makes reconciliation, his reward (أجره) is due from Allah). It should have been that his wage was due from the one whose offense he ceased demanding accountability for. But Allah bore that wage on his behalf, out of preservation for the wrongdoer (المسيء) and mercy for him, so that the wronged person no longer has a right against him to demand.\n\nSince the action demands the wage by its essence and this returns to the worker, and the delivery of messages is an action of the deliverer because the sender employed him to deliver his message to the one he was sent to, his wage was obligatory upon the sender. The recipient was not the one who employed him, so the wage is not obligatory upon the recipient. For this reason, the Messengers (الرسل) said to their communities, by Allah's command, informing the communities of the situation: <<قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ... إِنْ أَجْرِيَ إِلَّا عَلَى اللهِ>> (Say, \"I ask you for no wage for it... My wage is only upon Allah\"). They mentioned the deserving of the wage from the One who employed them, and they only said this by His command, for He said to every Messenger: <<قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ>> (Say, \"I ask you for no wage for it\").\n\nMuhammad (peace and blessings be upon him) was distinguished by a virtue (فضيلة) that no one else attained, the merit of which returned to his community, even though his ruling (peace and blessings be upon him) reverted to the ruling of the Messengers before him in keeping his wage upon Allah. The Real commanded him to take the wage due to him for his message from his community, which is that they should love his relatives. So He said to him: <<قُلْ لَا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا>> (Say, \"I ask you for no wage for it\")—meaning, for conveying what I brought to you—<<إِلَّا الْمَوَدَّةَ فِي الْقُرْبَى>> (except affection for the near of kin (القربى)). Thus, it became incumbent upon his community to pay what Allah made obligatory upon them as the wage for the conveyance, and thus the love of his relatives (قرابته) and his household (أهل بيته) became obligatory upon them. He named it *al-mawadda* (affection), which is steadfastness in love (المحبة).\n\nWhen this was established for him, He did not say that he had no wage upon Allah, nor that he still had a wage upon Allah. This was to renew the blessings (النعم) for him by informing him of what would please him. After this, it was said to him: \"Say to your community, commanding what a Messenger said to his community: <<قُلْ مَا سَأَلْتُكُمْ مِنْ أَجْرٍ فَهُوَ لَكُمْ إِنْ أَجْرِيَ إِلَّا عَلَى اللهِ>> (Say, \"Whatever wage I might have asked of you is for yourselves. My wage is only upon Allah\").\" He did not drop the wage from his community concerning their affection for the near of kin. Rather, He returned that wage after it had become incumbent upon them. Thus, that wage, which the Messenger of Allah (peace and blessings be upon him) deserved, returned to them. The merit (فضل) of affection thus returns to the people of affection. No one knows the wage that the people of affection have concerning the relatives of the Messenger of Allah (peace and blessings be upon him) except Allah, but they are the people of *al-qurbā* (nearness/kinship) among them. For this reason, He used *al-qurbā* and did not use *al-qarāba* (blood relation), because there is no difference between Aqil and Ali in terms of blood relation (القرابة النسبية), as both are paternal cousins of the Messenger of Allah (peace and blessings be upon him) by lineage. Ali combined both *al-qurbā* and *al-qarāba*. Thus, we love those of his relatives who are the *qurbā* (near ones) among them, and they are the believers (المؤمنون).\n\nFor this reason, Umar (may Allah be pleased with him) differentiated between one who was closer in blood relation and one who was closer in *qurbā*. He was an Arab, and the Quran was revealed in his tongue. Were it not that there is a distinction (*furqān*) in their language and usage, Umar would not have differentiated between *al-qurbā* and *al-qarāba*. Look at this in the Quran concerning the spoils of war (المغانم), in His saying, the Exalted: <<فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى>> (that one-fifth is for Allah and for the Messenger and for the near of kin (لِذِي الْقُرْبَى)). These are none other than the believers among the relatives. Thus, He used the term *al-qurbā* instead of the term *al-qarāba*. For if the relatives do not possess the *qurbā* of faith, they have no share in that, nor in the inheritance. This is the saying of the Prophet (peace and blessings be upon him) on the day he entered Mecca: \"Aqil left us no house.\" This is because Aqil inherited his father, not Ali, due to Ali's faith and Aqil's disbelief.\n\nAnd the Exalted said: <<لَا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللهِ وَالْيَوْمِ الْآخِرِ يُوَادُّونَ مَنْ حَادَّ اللهَ وَرَسُولَهُ وَلَوْ كَانُوا آبَاءَهُمْ أَوْ أَبْنَاءَهُمْ أَوْ إِخْوَانَهُمْ أَوْ عَشِيرَتَهُمْ>> (You will not find a people who believe in Allah and the Last Day loving those who oppose Allah and His Messenger, even if they were their fathers or their sons or their brothers or their kindred). If the affection for the near of kin (المودة في القربى) that the Messenger of Allah (peace and blessings be upon him) requested from us meant blood relation, the Real would not have negated it in His saying: \"loving those who oppose Allah and His Messenger, even if they were their relatives.\" Thus, we know that the affection for the near of kin is for the People of Faith (أهل الايمان) among them, and they are the ones closest to Allah.\n\nThe Prophet (peace and blessings be upon him) was distinguished from the rest of the Messengers (peace be upon them) by what Allah granted his community concerning their affection for the near of kin. And his community was distinguished over the rest of the communities by the merit (فضل) they possess in this, because merit is increase, and by this increase, the community of Muhammad (peace and blessings be upon him) became <<خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ>> (the best community brought forth for mankind). Although every community commands the right (المعروف), forbids the wrong (المنكر), and believes in Allah, this community was singled out with matters that no other community was singled out with. They have wages (أجور) for the actions they were specialized in, which no other communities were employed in. Thus, they will be distinguished by this on the Day of Resurrection, and their merit will become manifest.\n\nWages fluctuate between the Real and creation (الخلق). The Real has a wage upon His creation for actions He performed for them. And creation has a wage upon Allah for actions they performed for Him, and for actions they performed for creation out of regard for the Real, such as the forgiveness granted by those who pardon people. And creation has a wage upon creation through the legislation of the Real and His ruling concerning it. The conclusion of the matter in this issue is that wages fluctuate between the Real and the Real. Creation has no involvement in this, except that they are the path for the manifestation of these wages. Were it not for the existence of creation in this, the ruling of hiring (الاجارة) would not appear, nor would the essence (عين) of the wage. For this reason, the wage is <<جَزَاءً وِفَاقًا>> (a commensurate recompense). This is because the hirer is the Real, and the worker is the Real, since there is no worker except the Creator of the action, who is the Real. Creation is the action, and in it is the manifestation of the action. Therefore, it pressed in and inserted itself into this, and the Real confirmed it in this pressing and accepted it. Among creation, there are those who know this, and those who are ignorant of it.\n\nThis station (منزل) is vast in scope, especially if we were to delve into specifying the wages and their recipients. Let us mention the sciences contained within this station. Among them is the science of the wages of creation, exclusive of the Real. In it is the science of connection (الاتصال) with whom, and separation (الانفصال) from whom, and separation and connection in whom. This is a strange science that encompasses all Existence (الوجود) and non-Existence. For restricted Existence (الوجود المقيد) has separated from the state of non-existence (العدم) and connected to the state of Existence—a separation of preference and a connection of preference. As for Absolute Existence (الوجود المطلق), its separation from non-existence is an essential separation (انفصال ذاتي) that is not based on preference. Whoever knows this science knows where he was, from whom he separated, and to whom he connected.\n\nIn it is the science of analogy (التشبيه) in meanings through correspondences (المناسبات).\nIn it is the science of arrangement in timing, and related to it is the science of Divine Decree (القضاء) and Destiny (القدر).\nIn it is the science of ownership (الملك) and granting ownership (التمليك), and whether the ruling of granted ownership, when it occurs, is the same as the ruling of original ownership, or if their rulings differ.\nIn it is the science of what distinguishes the world of elements (عالم الأركان) from the world of other celestial spheres (عالم الأفلاك الأخرى), and why the world of elements accepted transformation (الاستحالة), so that the essences of its forms vanish, just as the forms of its elements vanish by the transformation of some into others through subtlety and density. The world of celestial spheres is not like that. Rather, their transformation is their manifestation in the forms in which they appear to the world of elements. Since this transformation occurred in the natural forms that appeared from below nature, and did not appear in the world above nature, yet it appeared in the Divine Theophany (التجلي الإلهي), and His ruling appeared through elemental transformation in the essences of its forms, and in its forms, or rather, not in its forms. Does all this revert to a change in the matter itself, or is it only in the eye of the beholder?\nIn it is the science of opposites (المتقابلات): Does the knowledge of one require the knowledge of its opposite, or is each one known individually without knowing the opposite, and without dependence upon it? This only occurs with those who do not see that the Essence (العين) is one.\nIn it is the science of the effect of Nature (الطبيعة) in the Highest Assembly (الملإ الأعلى) and its place.\nIn it is the science of the states (أحوال) of the Highest Assembly.\nIn it is the science of the gathering of the monotheists (الموحدين) and the polytheists (المشركين) in Divine Preservation (الحفظ الإلهي). Is this due to Divine solicitude (الاعتناء) for creation, even if they are ignorant, or is it due to granting the Realities (الحقائق) such that the matter must be this way? It is, however, from the category of solicitude. And in our view, it is from the category of solicitude through Divine notification of this by way of allusion (الإيماء), not explicit declaration (التصريح), because this is from the science of secrets (علم الأسرار) that are not divulged generally. But it has people who are worthy of it, and the one who knows it should reveal it to its people, for if he does not give it to its people, he has wronged both sides: the knowledge and the one who is worthy of it.\nIn it is the science of the Levels (مراتب) of the working tools whose rulings appear in expressions. This is the science of the letters (الحروف) that came to denote a meaning, some of which are compound and some non-compound.\nIn it is the science of classifying the wrongdoers (الظالمين): who among them is supported and who is not, and why wrongdoing (الظلم) reverts in its existence. Is its existence from darkness (الظلمة) or from light (النور)?\nIn it is the science of the Real (الحق) being the very essence (عين) of things, yet remaining unknown.\nIn it is the science of the difference between Life (الحياة) and the giving of life (الأحياء). When the giving of life occurs, by what does it occur? Is it by the Eternal Life (الحياة القديمة), or is there an originated life that appears through the giving of life in the living beings?\nIn it is the science of returning from whom, befriending whom, and reliance upon what and upon whom.\nIn it is the science of the medium in which Allah created creation (الخلق): Did He create it in something, or did He create it not in something, such that the very essence of the created things is the very essence of their thingness?\nIn it is the science of the Real and creation sharing in Existence (الوجود), and whether all that they share in is a conceptual sharing (اشتراك معقول) or merely a verbal sharing.\nIn it is the science of the laws (النواميس) established in the World (العالم): Are they encompassed by a single comprehensive Presence (حضرة), or does each law have its own Presence, or are they gathered by only two Presences, such that one law is attributed to Wisdom (الحكمة) and the other law is attributed to the Divine Prophetic Ruling (الحكم الإلهي النبوي), even if their types are numerous?\nIn it is the science of Divine specialization (الاختصاص الإلهي) for some created beings: By what did it occur? Was it by providence (العناية) or by desert (الاستحقاق)? This is a science that the People of Allah (أهل الله) are forbidden from unveiling, either generally or specifically, because it is a science of taste (علم ذوق) that is not attained by analogy (القياس) or by setting examples.\nIn it is the science of the word of connection (الوصل) and separation (الفصل): Is it one word or two words?\nIn it is the science of the superiority (تفاضل) of the People of the Books: Does it revert to the merit of the Books, or not? And do the revealed Books have merit over one another, or is there no merit in them? Indeed, Allah established superiority within the Quran itself between the chapters (السور) and the verses (الآيات). He made one chapter equal to the entire Quran ten times, another standing in the place of half of it in ruling, another a third, and another a quarter. And one verse has sovereignty over the verses, and another has the same relation to the verses of the Quran as the heart has to the human constitution (نشأة الإنسان). The Quran is distinguished by its miraculous nature (الإعجاز) over other Books.\nIn it is the science of brotherhood (المواخاة) between the chapters of the Quran. For this reason, he (peace and blessings be upon him) said: \"Hud and its sisters have made me gray.\" Thus, he established brotherhood between them.\nIn it is the science of confirming every religious community (ملة) upon what it is, and every possessor of a creed (نحلة) upon his creed, and what is incumbent upon him to fulfill its right.\nIn it is the science of the ruling concerning one who separates from the community (الجماعة).\nIn it is the science of brotherhood between the Books revealed from Allah and the Divine Balances (الموازين الإلهية) established in the World, despite the difference in their spiritual (المعنوية) and sensory (المحسوسة) forms. The spiritual forms are like existential (الوجودية), dialectical (الجدلية), and rhetorical proofs (الخطابية). The sensory balances are witnessed by the senses in their difference.\nIn it is the science of the places of haste (العجلة) versus the places of restraint (التثبط).\nIn it is the science of the strength of the subtle (اللطيف) and the weakness of the dense (الكثيف), and that strength belongs to the disposer (المتصرف) and weakness to the object of disposal.\nIn it is the science of what necessitates increase, what necessitates decrease, and the merit (فضل) between them.\nIn it is the science of delaying the judge's ruling from being executed upon the judged, due to a doubt (شبهة) that prevents him from doing so until he is certain, or until his dominant assumption is reached in matters where certainty cannot be attained. For the disbeliever (الكافر) in this world may return as a believer at the time of death. If the ruling of disbelief is hastened upon him before death, the judge has not given the ruling of doubt its due right in its proper place.\nIn it is the science of which actions accept increase and which do not accept it, nor accept decrease. In the Sacred Laws (الشرائع), this is: <<مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْهَا وَهُوَ عَشْرُ أَمْثَالِهَا>> (Whoever comes with a good deed (الحسنة) will have better than it, which is ten times its like), and <<وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَى إِلَّا مِثْلَهَا>> (But whoever comes with an evil deed (السيئة) will not be recompensed except with its equivalent).\nIn it is the science of the penetration of the word (الكلمة): Is it due to its essence or not? And that it is from *al-kalm* (wounding), which is the mark of the wounder in the wounded. Likewise, every word has an effect on the listener, the least of which is hearing the form of what was uttered and spoken, up to what is beyond that, which the speech carries in terms of meanings.\nIn it is the science of the origin of transgression (البغي) in the World. Is it derived from *baghā yabghī* (to seek/desire), such that the transgression which Allah condemned is a restricted seeking, since some seeking is condemned and some is praised? And what is the remedy for that transgression?\nIn it is the science of the folding (الطي) and unfolding (النشر) of the ruling of the moment.\nIn it is the science of signs (الدلالات) and verses (الآيات): Is their being signs and verses due to their own nature, or is it by convention (الوضع)?\nIn it is the science of the origination of the Will (المشيئة): To what does it revert, given that originated things (الحوادث) do not subsist in the Real (الحق)?\nIn it is the science of calamities (النوازل): Do they descend initially, or do they descend as recompense?\nIn it is the science of stillness (السكون) and movement (الحركة), and the science of the places where the ruling of stillness and the ruling of movement ought to manifest.\nIn it is the science of what Allah grants His servants in this world—such as knowledge (علوم), levels (مراتب), and other things: Is it from this world or from the Hereafter?\nIn it is the science of responding to Allah's commands: If its outward form (صورتها ظاهرة) is established, does it benefit by its form, and where does it benefit? Or does it only benefit when a spirit is breathed into that form, by which it lives, and that is the form of the inner reality (صورة الباطن)? Related to this science is the science of forms (الصور) generally: Do they have an outward and an inward, or are some of them outward with no inward?\nIn it is the science of what motivates all animals to seek victory for themselves: Is it the repulsion of harm, or is it recompense, or the seeking of revenge, or is it partly this and partly that?\nIn it is the science of beautification (التحسين) and deeming ugly (التقبيح): Does this revert to the essence (ذات) of beauty and ugliness, or to an accidental matter?\nIn it is the science of which descriptions (النعوت) are loved and which are disliked.\nIn it is the science of what removes constraint (الحرج) from one who manifests what nature dislikes.\nIn it is the science of the causes that prevent the manifestation of what nature seeks.\nIn it is the science of what is only comprehended through subtle and hidden contemplation.\nIn it is the science of abiding (الإقامة) and moving (الانتقال) in the spiritual states (الأحوال): Do the states move while the servant is fixed, or does the servant move within the states while the states are fixed? This is one of the strange sciences dependent upon Unveiling (الكشف).\nIn it is the science of what is denied of the Real and what is not denied; and the science of what the Real confirms of falsehood (الباطل) and what He does not confirm; and which falsehood accepts removal and which falsehood does not accept it.\nIn it is the science of production (الإنتاج) and non-production despite the existence of premises, and when the premises produce results.\nIn it is the science of the veil (حجاب) of the outward constitution (ظاهر النشأة), and what the human (البشر) is named from it. Does its inward have direct contact (مباشرة) just as its outward does, or not?\nIn it is the science of what the veil (الحجاب) is that lies between Allah and His servant.\nIn it is the science of originated speech (الكلام المحدث) and Eternal speech (القديم): To what does it revert? Does it differ, or is its ruling one?\nIn it is the science of lights (الأنوار) and their Levels (مراتبها), and the splendors (سبحات) of the Face: Why did they multiply when the Face is one and the splendors are many?\nIn it is the science of distinguishing between the Divine paths (السبل الإلهية).\nIn it is the science of the Beginning (المبدأ) and the Return (المعاد). <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو بیالیس (342): دو رازوں کی منزل کی معرفت میں جو تین رازوں سے جدا ہیں، جنہیں وحی کی ایک ہی حضرہ (حضور) جمع کرتی ہے، اور یہ (منزل) حضرت موسیٰ علیہ السلام کی حضرہ (حضور) سے ہے۔\n\nتین راز اور ان کے بعد دو راز ہیں،\n(وہ ہیں) ارادہ کرنے والا، جاننے والا، اور قادر کی قدرت۔\n\nاور دو راز وہ قول ہیں جس کی شرط اس کی حیات میں ہے،\nجو کسی شے کو خالق کی حکمت سے \"کُن\" (ہو جا) کہتا ہے۔\n\nپس پاک ہے وہ ذات جس کی حقیقت (کُنہ) کو کوئی شے نہیں پا سکتی،\nوہ اول (الأول) ہے جسے آخر (الآخر) بھی کہا جاتا ہے۔\n\n### [نیابت ہی خلافت ہے]\n\nاللہ تعالیٰ نے فرمایا: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (کوئی چیز اس کے مانند نہیں ہے) پس نفی کی، پھر فرمایا: **وهُوَ السَّمِيعُ الْبَصِيرُ** (اور وہ سننے والا، دیکھنے والا ہے) پس اثبات کیا۔ اور یہ آیت نفی کے عین میں عمومِ اثبات کا تقاضا کرتی ہے، اور اس کے بعد بھی، جب کاف کو صفت کے لیے مانا جائے۔ اور اس نظر کی تائید حدیث سے ہوتی ہے، اور وہ آپ صلی اللہ علیہ وسلم کا یہ فرمان ہے: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا۔\"\n\nاور اس وصف کے ساتھ متصف ہونے کی حالت میں اس کی مماثلت کی نفی کی گئی ہے۔ چنانچہ شریعت میں یہ حکم آیا کہ جب دو خلفاء کی بیعت کی جائے، خواہ وہ خلافتِ عامہ میں ہو یا کسی مخصوص گروہ تک محدود ہو، تو ان میں سے دوسرے کو قتل کر دیا جائے گا، تاکہ اس گروہ میں یا عموم میں، وقت کے تقاضے کے مطابق، کوئی مماثلت نہ رہے۔ اگر وجود اور تقدیر میں ارادہ (الإرادة) کا حکم نہ ہوتا تو دوسرے کو قتل کرنے کا حکم نہ دیا جاتا۔ اور قتل حکم کی صفت سے زوال ہے، پس تو زائل ہو جا تاکہ وہ باقی رہے، کیونکہ تو آخر ہے۔ اگر بعض عارفین (العارفين) یہ کہیں کہ یہاں اول خلیفہ نہیں ہے، تو ہم کہیں گے کہ وہ یقیناً خلیفہ ہے، ایک الٰہی حکم کے تحت، اور اس نے تیری خلافت میں شرکت سے منع کیا جس کا اسے حکم دیا گیا تھا۔ پس اللہ نے فرمایا: **رَبُّ الْمَشْرِقِ والْمَغْرِبِ لا إِلهَ إِلَّا هُوَ فَاتَّخِذْهُ وَكِيلًا** (وہ مشرق اور مغرب کا رب ہے، اس کے سوا کوئی معبود نہیں، پس تم اسی کو کارساز (وکیل) بناؤ)۔ اور وکیل بلاشبہ موکل کا خلیفہ ہوتا ہے اس کام میں جس کا اسے وکیل بنایا گیا ہو۔ اور اللہ نے فرمایا: **أَلَّا تَتَّخِذُوا من دُونِي وَكِيلًا** (میرے سوا کسی کو کارساز نہ بنانا)۔ پس اس نے منع کیا کہ ہم اس کے سوا کسی کو وکیل بنائیں۔ پس اس کا معبود (إلٰہ) ہونا اس کے وکیل ہونے جیسا نہیں ہے۔ اور ہم نے تو صرف وکالت (الوکالة) کے بارے میں بات کی ہے جو کہ خلافت (الخلافة) ہے، اور وکیل (الوکيل) کے بارے میں جو کہ خلیفہ (الخليفة) ہے۔ جیسا کہ ایک دوسرے اعتبار سے اس کا ہمارے لیے یہ فرمان دیکھا جاتا ہے: **وَأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ** (اور اس میں سے خرچ کرو جس میں اس نے تمہیں نائب بنایا ہے)۔ پس خلافت کے حکم سے ہمیں خرچ کرنے کا حق ہے، اور خرچ کرنا ہماری ملکیت ہے، اور خرچ کرنا ایک تصرف ہے۔ پس ہم نے اسے اس کے حکم سے، خرچ کرنے میں اپنا وکیل یعنی خلیفہ بنا دیا، کیونکہ ہم جانتے ہیں کہ وہ تصرف کے ان مقامات کو جانتا ہے جنہیں ہم نہیں جانتے۔ پس وہی مالک ہے اور وہی خلیفہ ہے۔ اللہ نے مراتب کو ممتاز نہیں کیا، اور انہیں ہمارے لیے واضح نہیں کیا، اور اپنے اسماء کے ساتھ ان کے اعیان (حقیقتوں) میں ظاہر نہیں ہوا، اور ان میں ہمارے لیے تجلی (التجلی) نہیں کی، مگر اس لیے کہ ہم اسے ہر اس مرتبے میں رکھیں جس میں ہم نے اسے نازل ہوتے دیکھا، پس ہم اس پر وہی حکم لگائیں جو اس نے خود پر لگایا ہے۔ اور یہی اللہ کی کامل ترین معرفت (المعرفۃ) ہے کہ ہم اسے اس کے ذریعے جانیں، نہ کہ اپنی نظر یا اپنے نازل کرنے سے۔ اللہ خالق (الخالق) اس سے بلند ہے کہ ہم اس پر اس چیز کے ذریعے حکم لگائیں جسے اس نے پیدا کیا، اس کے بغیر کہ وہ خود اس میں ظاہر ہو جس پر ہم نے حکم لگایا، پس وہ خود پر حکم لگانے والا ہو، نہ کہ ہم۔ اور یہی علماء کے اس قول کا معنی ہے کہ الحق (ذات حق) کو صرف اسی نام سے پکارا جائے گا جس سے اس نے خود کو پکارا ہے، یا تو اپنی کتاب میں، یا اپنے رسول کی زبان پر، اس حیثیت سے کہ وہ اس کی ترجمانی کرنے والا ہے۔ پس جسے اللہ نے اس کی ترجمانی کے مقام پر کھڑا کیا، خواہ واسطوں کے اٹھ جانے سے ہو یا نوری ارواح کے واسطے سے، اور وہ ایسا نام لائے جو اس نے خود کو دیا ہے، تو ہمیں حق ہے کہ ہم اسے اس نام سے پکاریں۔ اور خواہ وہ ترجمان ہمارے لیے شریعت لانے والا ہو یا نہ ہو، اس میں صرف اس کی ترجمانی شرط ہے، تاکہ ہم اس پر صرف اسی کے ذریعے حکم لگائیں۔ کیونکہ وہ ہی فرمانے والا ہے: **إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً** (اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (امتیاز) پیدا کر دے گا)۔ جس کے ذریعے تم تمیز کرو گے اور فرق کرو گے کہ اس کے لیے کیا مناسب ہے اور تمہارے لیے کیا مناسب ہے، پس وہ ہر حقدار کو اس کا حق دے گا۔ پس اسی کے لیے کنجیاں ہیں، اور اسی کے لیے ان کے ساتھ اور ان کے بغیر فتح ہے، اور ہمارے لیے ان کے ساتھ فتح ہے، لیکن وہ ہماری نہیں ہیں بلکہ اس کے ہاتھ میں ہیں۔ اور جو اس کے ہاتھ میں ہے وہ اس سے باہر نہیں نکلتا، کیونکہ وہاں کوئی اور جگہ نہیں ہے۔ پس وہی دینے والا اور لینے والا ہے، کیونکہ صدقہ رحمن کے ہاتھ میں پڑتا ہے۔\n\n### [بے شک وحی الٰہی مقامِ عزتِ احمیٰ سے نازل ہوتی ہے]\n\nاور جان لو کہ وحی الٰہی (الوحي الإلهي) صرف مقامِ عزتِ احمیٰ (انتہائی محفوظ عزت) سے نازل ہوتی ہے، اور اسی لیے یہ اکتساب (کوشش) سے حاصل نہیں ہوتی، کیونکہ اس مقام تک بناوٹ یا تکلف سے نہیں پہنچا جا سکتا۔ اور اگر یہ تکلف سے حاصل ہو جاتی تو وہ عزت کے وصف سے متصف نہ ہوتی۔ پس وحی ان امور کی ترتیب کے لیے نازل ہوتی ہے جن کا تقاضا حکمتِ وجود کرتی ہے۔ **وَلَوْ كانَ مِنْ عِنْدِ غَيْرِ الله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً** (اور اگر یہ اللہ کے سوا کسی اور کی طرف سے ہوتا تو وہ اس میں بہت زیادہ اختلاف پاتے)۔ جو حکمتِ وجود کی ترتیب کے خلاف ہوتا۔ اور یہ صرف اللہ کی طرف سے ہے، پس یہ کمالِ احکام اور اتقان (پختگی) میں ہے جو کسی اور کے لیے ممکن نہیں۔ پس امکان میں اس عالم سے زیادہ حسین کوئی چیز نہیں، کیونکہ اللہ نے اسے اس کی تخلیق عطا کی اور اسے اس منزل میں اتارا جس کا وہ مستحق تھا۔ پس اس الٰہی قوت کو دیکھو جو اللہ نے اس شخص کو عطا کی جس پر وحی نازل کی، جو اگر **عَلى‏ جَبَلٍ لَرَأَيْتَهُ خاشِعاً مُتَصَدِّعاً من خَشْيَةِ الله** (پہاڑ پر نازل کی جاتی تو تم اسے اللہ کے خوف سے جھکتا اور پھٹتا ہوا دیکھتے)۔ کیونکہ انہوں نے اس ذات کی قدر جانی جس نے اسے نازل کیا، پس اللہ نے انہیں اتنی قوت عطا کی جس سے وہ اس جلال کو اٹھا سکیں۔ پس جب وہ اللہ کے بارے میں کوئی ایسی بات سنتے ہیں جو اس تجلی (التجلی) کے خلاف ہو جو ان پر ہوئی تھی، تو **تَكادُ السَّماواتُ يَتَفَطَّرْنَ مِنْهُ وتَنْشَقُّ الْأَرْضُ وتَخِرُّ الْجِبالُ هَدًّا أَنْ دَعَوْا لِلرَّحْمنِ وَلَداً** (قریب ہے کہ آسمان اس سے پھٹ پڑیں، اور زمین شق ہو جائے، اور پہاڑ گر کر ریزہ ریزہ ہو جائیں، اس لیے کہ انہوں نے رحمن کے لیے اولاد کا دعویٰ کیا)۔ اور اہل اللہ اور اس کے رسولوں نے یہ سنا، لیکن ان پر اس میں سے کچھ بھی نہیں گزرا، کیونکہ اللہ نے انہیں علم کی قوت عطا کی تھی، اور علم سے زیادہ قوی کوئی چیز نہیں۔ پس ان پر اس کے فرمان میں تجلی ہوئی: **لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً** (اگر اللہ اولاد بنانا چاہتا) اور **وَلَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا** (اور اگر ہم کوئی کھیل بنانا چاہتے تو اپنے پاس سے بنا لیتے)۔ پس اہل اللہ، خواہ وہ رسول ہوں، نبی ہوں یا ولی، نے اللہ کے بارے میں وہ جانا جو آسمانوں، زمین اور پہاڑوں نے نہیں جانا، پس اس علم باللہ نے ان کے نفوس میں قوت پیدا کی جس سے انہوں نے وہ بات برداشت کر لی جو انہوں نے سنی کہ مسیح اللہ کا بیٹا ہے اور عزیر اللہ کا بیٹا ہے۔ اور وہ متزلزل نہیں ہوئے۔ اور اگر یہ (بات) اس شخص پر نازل ہوتی جس میں یہ قوت نہ ہوتی تو وہ اس عظیم چیز کی وجہ سے جو اس پر آئی، اپنی آنکھوں کے سامنے پگھل جاتا۔ پس دیکھو اس شخص کا حجاب کتنا گھنا ہے جو یہ عقیدہ رکھتا ہے کہ اللہ کی اولاد ہے، اور وہ حقائق (الحقائق) سے کتنا شدید اندھا ہے۔ اور تجلی الٰہی (التجلی الإلهي) میں مجھ پر کوئی ایسا معاملہ نہیں گزرا جس نے مجھے اس قدر حیران کیا ہو اور میری قوت کو کمزور کیا ہو جتنا کہ فرشتوں کا یہ قول: **رَبَّنا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وعِلْماً فَاغْفِرْ لِلَّذِينَ تابُوا واتَّبَعُوا سَبِيلَكَ وقِهِمْ عَذابَ الْجَحِيمِ** (اے ہمارے رب! تو نے ہر چیز کو رحمت اور علم سے گھیر رکھا ہے، پس ان لوگوں کو بخش دے جنہوں نے توبہ کی اور تیرے راستے کی پیروی کی، اور انہیں جہنم کے عذاب سے بچا)۔ حالانکہ اللہ فرماتا ہے: **ما عَلَى الْمُحْسِنِينَ من سَبِيلٍ** (نیکوکاروں پر کوئی الزام نہیں)۔ اور اس شخص سے بڑا احسان کیا ہو گا جس نے توبہ کی اور اس کے راستے کی پیروی کی۔ اور نوح علیہ السلام کا قول، جو اہل اللہ میں سے کاملین میں سے ہیں: **وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِناً** (اور جو میرے گھر میں ایمان کی حالت میں داخل ہوا)۔ یہ ایسا ہے جیسے انہوں نے کچھ باقی رکھا، کیونکہ انہوں نے صرف مومن کے لیے مغفرت طلب کی اور اللہ کے راستے کی پیروی کا ذکر نہیں کیا، کیونکہ مومن اللہ کے امر و نہی کی مخالفت کرنے والا بھی ہو سکتا ہے۔ حالانکہ اللہ ان لوگوں سے جو اپنی جانوں پر زیادتی کرتے ہیں، فرماتا ہے: **إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً** (بے شک اللہ تمام گناہوں کو بخش دیتا ہے)۔ پس فرشتوں کے اس گروہ نے مقامِ ادب میں قیام کیا، چنانچہ ان پر یہ قول اس لیے حکم ہوا کہ انہوں نے مخلوق پر جنابِ الٰہی کو ترجیح دی۔ اسی لیے انہوں نے تقدیم و تاخیر کی، اور اللہ نے ان کے بارے میں اس دعا سے پہلے جو خبر دی: **وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وعِلْماً** (تو نے ہر چیز کو رحمت اور علم سے گھیر رکھا ہے)، اس میں برے کام کرنے والوں کے لیے بھی مغفرت طلب کرنے کی خوشبو ہے۔ اور انہوں نے اپنے اس قول کو بھی مؤخر کیا: **وَقِهِمُ السَّيِّئاتِ** (اور انہیں برائیوں سے بچا)، کہ وہ ان کے ساتھ قائم ہو جائیں، کیونکہ یہ عنایت میں زیادہ کامل ہے۔ اور **وَمَنْ تَقِ السَّيِّئاتِ يَوْمَئِذٍ** (اور جسے تو اس دن برائیوں سے بچا لے گا)، یعنی جس دن تو اسے بچائے گا، **فَقَدْ رَحِمْتَهُ** (تو تو نے اس پر رحم کیا)۔ اور یہی ان کا قول ہے: **وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً**۔ پس جو کچھ انہوں نے ذکر کیا وہ ان دونوں کے درمیان آیا، گویا یہ جنابِ الٰہی کو ترجیح دینا تھا، جیسا کہ نبی صلی اللہ علیہ وسلم قیامت کے دن فرمائیں گے: \"دوری ہو، دوری ہو (سُحقاً سُحقاً)۔\" اور اللہ نے مغفرت کو صرف گناہ کے ساتھ ہی معلق کیا جہاں اس نے اسے معلق کیا۔ اور فرشتوں کے ایک دوسرے گروہ کے بارے میں فرمایا کہ وہ **يَسْتَغْفِرُونَ لِمَنْ فِي الْأَرْضِ** (زمین والوں کے لیے مغفرت طلب کرتے ہیں)۔ پس ان فرشتوں نے مغفرت کو اس کے مقام پر نازل کیا۔ انہوں نے وہ بات نہیں کہی جو دوسرے گروہ نے کہی تھی جس کے بارے میں اللہ نے بیان کیا کہ وہ **يَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا** (ان لوگوں کے لیے مغفرت طلب کرتے ہیں جو ایمان لائے)۔ پس ان کے مشرب (طریقے) مختلف ہو گئے، جیسا کہ انہوں نے کہا: **وَمَا مِنَّا إِلَّا لَهُ مَقَامٌ مَعْلُومٌ** (اور ہم میں سے کوئی نہیں مگر اس کا ایک معلوم مقام ہے)۔ اور ولی کامل (الولی الکامل) ہر مقام اور ہر زبان سے اللہ کو پکارتا ہے۔ اور رسول اس پر ٹھہر جاتے ہیں جو ان کی طرف وحی کیا گیا، اور وہ بہت سے ہیں۔ اور بعض کی طرف وہ وحی کی جاتی ہے جو دوسروں کی طرف نہیں کی جاتی۔ اور محمدی (صلی اللہ علیہ وسلم) اپنی مرتبت کے ذریعے وہ سب کچھ جمع کر لیتے ہیں جو رسولوں میں دعا کے حوالے سے متفرق تھا۔ پس وہ ہر زبان سے دعا کرنے میں مطلق ہیں، کیونکہ انہیں رسولوں پر اور جو کچھ ان پر نازل کیا گیا اس پر ایمان لانے کا حکم دیا گیا ہے۔ پس ولی محمدی (صلی اللہ علیہ وسلم) کسی خاص وحی پر نہیں ٹھہرتا، سوائے حلال اور حرام کے حکم میں۔ لیکن دعا کے معاملے میں، اور جس چیز کے بارے میں شریعتِ محمدی صلی اللہ علیہ وسلم میں خاموشی اختیار کی گئی اور اس کے ترک کی اجازت دینے والی کوئی چیز نازل نہیں ہوئی، تو وہ اسے ترک نہیں کرتا اگر وہ کسی نبی پر وحی کے ذریعے نازل ہوئی ہو، خواہ وہ رسول ہو یا غیر رسول۔\n\n### [میری امت کا اختلاف رحمت ہے]\n\nپھر جان لو کہ اللہ کی اپنے بندوں پر رحمت میں سے یہ ہے کہ اس نے اس چیز کا حکم جس میں انہوں نے اختلاف کیا، اللہ کے سپرد کر دیا۔ پس ہم اسے علمِ رسوم (ظاہری احکام کا علم) کی جہت سے لیتے ہیں کہ ہم دیکھیں کہ انہوں نے کس چیز میں اختلاف اور تنازع کیا ہے۔ پس اگر اللہ اور اس کے رسول کا اس میں کوئی حکم ہو جو مخالفین میں سے کسی ایک کے قول کی تائید کرتا ہو، تو ہم حق کو اس کے ہاتھ میں قرار دیں گے۔ کیونکہ ہمیں حکم دیا گیا ہے کہ اگر ہم کسی چیز میں جھگڑیں تو اسے اللہ اور اس کے رسول کی طرف لوٹا دیں، اگر ہم مومن ہیں۔ اور اگر ہم ان عالموں میں سے ہوں جو بصیرت اور اپنے رب کی طرف سے دلیل پر دعوت دیتے ہیں، تو ہم اس مسئلے میں علم کے ذریعے حکم لگائیں گے، اور یہ ایمان کے راستے کے بغیر اللہ تعالیٰ کی طرف لوٹانا ہے۔ اور ہمیں اس سے ہرگز انحراف کی اجازت نہیں۔ یہ علمِ رسم (ظاہری علم) کی حد ہے۔ اور جہاں تک علمِ حقیقت (الحقیقۃ) کا تعلق ہے، تو اختلاف کرنے والوں کا حکم اللہ کے سپرد ہے، یعنی ان میں اختلاف کے ظہور کا حکم اللہ کے سپرد ہے، اس لحاظ سے کہ اسماء الٰہیہ (الأسماء الإلهية) ہی اختلاف کا سبب ہیں، خاص طور پر اسماء التقابل (متضاد اسماء)۔ اس کی تائید اس کے اس فرمان سے ہوتی ہے: **ذَلِكُمُ الله رَبِّي** (یہ ہے اللہ میرا رب)، کیونکہ وہ اس کے اسماء کے سوا کچھ نہیں۔ وہ ہی فرمانے والا ہے: **قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ** (کہو: اللہ کو پکارو یا رحمن کو پکارو)۔ اور یہ نہیں کہا کہ \"باللہ\" یا \"بالرحمن\" (اللہ کے ذریعے یا رحمن کے ذریعے)۔ پس اس نے یہاں اسم کو عین مسمیٰ قرار دیا، جیسا کہ اس نے کسی اور مقام پر اسے غیر مسمیٰ قرار دیا۔ پس جب اس نے فرمایا: **ذَلِكُمُ الله رَبِّي**، اور \"ذَا\" (یہ) کا اشارہ اس اللہ کی طرف ہے جس کا ذکر اس کے قول **فَحُكْمُهُ إِلَى الله** (پس اس کا حکم اللہ کے سپرد ہے) میں ہے۔ پس اگر یہاں \"اللہ\" کے قول میں اسم عین مسمیٰ نہ ہوتا تو اس کا قول \"ربی\" (میرا رب) صحیح نہ ہوتا۔ اور اختلاف اسماء الٰہیہ میں ظاہر ہوا، پس اس کے ذریعے عالم میں اللہ کا حکم ظاہر ہوا۔ چنانچہ عالم میں واقع ہونے والے اختلاف پر یہ حکم لگایا جائے گا کہ وہ عین اللہ کا حکم ہے جو مخالفین کی صورت میں ظاہر ہوا۔\n\n### «ضمیمہ» اجرتوں کے بیان میں\n\nیہ وہ حقوق ہیں جن کا تقاضا اعمال خاص طور پر کرتے ہیں، اور یہ ایک ایسا حکم ہے جو قدیم اور محدث (پیدا شدہ) دونوں میں جاری ہے۔ پس جو بھی کسی دوسرے کے لیے کوئی عمل کرتا ہے، وہ اس پر اجرت کا حقدار ہو جاتا ہے۔ اور اجرتیں دو قسم کی ہیں: معنوی اور حسی۔ پس جب کوئی شخص کسی دوسرے کو کسی کام کے لیے اجرت پر رکھتا ہے اور وہ اسے کر دیتا ہے، تو عامل نے اس پر حق واجب کر لیا جس کے لیے کام کیا گیا، اور اسی کو اجرت (أجر) کہا جاتا ہے۔ اور جس کے لیے کام کیا گیا اس پر واجب ہے کہ وہ اس حق کو ادا کرے اور اسے پہنچائے۔ اور اجرت پر رکھنے والا (مؤجر) بظاہر اجیر کو استعمال کرنے میں بااختیار ہے، لیکن باطن میں مجبور ہے۔ اور اجیر بعض کاموں میں استعمال قبول کرنے میں بااختیار ہے، اور بعض میں مقہور (مجبور) ہے۔ اور اختیار کا حکم اس سے زائل نہیں ہوا، کیونکہ اگر وہ چاہے تو قبول نہ کرے اور اگر چاہے تو قبول کر لے، پس وہ بظاہر بااختیار ہے اور باطن میں مجبور، بالکل اسی طرح جیسے اجرت پر رکھنے والا۔\n\nپس وجود میں سب سے پہلا اجیر جو ممکن (الممکن) کے ایجاد (الإيجاد) کے محتاج ہونے سے ظاہر ہوا، اور وہ واجب الوجود (واجب الوجود) کی طرف سے ممکن میں وجود کا عمل ہے تاکہ اس کا عین ظاہر ہو، وہ واجب الوجود ہے۔ پس ممکن نے واجب سے اپنی عدم کی حالت میں کہا: میں چاہتا ہوں کہ میں تمہیں اپنے عین کے ظہور میں استعمال کروں۔ پس ایجاد (الإيجاد) عمل ہے، اور وجود (الوجود) وہ ہے جس پر عمل کیا گیا، اور موجود وہ ہے جس میں عمل کی صورت ظاہر ہوئی۔ پس ہر وہ چیز جس پر عمل کیا گیا وہ اپنے عمل سے پہلے معدوم تھی۔ پس الحق (ذات حق) نے اس سے کہا: اگر میں تمہارے لیے یہ کروں اور تمہیں ظاہر کروں تو مجھ پر تمہارا حق ہے۔ اور اسی حق کو اجرت (أجر) کہا جاتا ہے۔ اور جو کچھ اجرت پر رکھنے والے نے اجیر سے طلب کیا اسے اجارہ (اجرت پر رکھنا) کہا جاتا ہے۔ اور اجرت پر رکھنے والا ابتداءً اجرت کے تعین میں خود بااختیار ہے۔ اگر وہ چاہے تو اس کے لیے وہ چیز متعین کر دے جو وہ اس عمل پر دے گا، اور اگر چاہے تو تعین اجیر کے لیے چھوڑ دے۔ اور اجیر اس چیز کو قبول کرنے میں بااختیار ہے جو اجرت پر رکھنے والے نے متعین کی، اگر اس نے اس کے لیے کوئی چیز متعین کی ہو۔ اور اگر اجیر نے خود سے کام کرنے کی پیشکش کی اور کہا کہ میں اس پر کوئی اجرت نہیں لوں گا، تو اسے یہ حق ہے۔ لیکن اس عمل سے قیمت کا حکم زائل نہیں ہوتا، کیونکہ عمل اپنی ذات سے ہی اجرت کو اس کی قیمت کے ساتھ متعین کرتا ہے۔ پس اگر عامل چاہے تو اسے لے لے اور اگر چاہے تو چھوڑ دے، اور عمل کا حکم ساقط نہیں ہوتا اگر اس کی اجرت اتنی ہو۔\n\nاور یہ ایک عجیب مسئلہ ہے جو اجرت پر رکھنے والے اور اجیر کے اختیار اور اضطرار کے درمیان گھومتا ہے۔ اور ہر ایک اپنے اختیار میں مجبور ہے، سوائے اس کے کہ الحق (ذات حق) کو جبر سے متصف نہیں کیا جاتا، جبکہ ممکن (الممکن) کو جبر سے متصف کیا جاتا ہے، اس علم کے باوجود کہ اس کے ہاں بات بدلی نہیں جاتی، اور وہ اس عمل سے باہر نہیں نکلتا جو اس کے علم میں پہلے سے ہے کہ وہ اسے کرے گا، اور نہ اس ترک سے جو اس کے علم میں پہلے سے ہے کہ وہ اسے چھوڑ دے گا۔ اور جبر اس کے سوا کچھ نہیں۔ مگر یہاں وہ ذات جو اسے مجبور کرتی ہے، وہی عین مجبور ہے، کیونکہ اسے اس کے علم نے ہی مجبور کیا ہے، اور اس کا علم اس کی صفت ہے، اور اس کی صفت اس کی ذات ہے۔ اور ممکن میں جبر یہ ہے کہ اسے کوئی دوسرا مجبور کرے، نہ کہ اس کا اپنا عین۔ اور اگر وہ اس کے خلاف ارادہ کرے جس پر اسے مجبور کیا گیا ہے تو وہ نہیں کر سکتا۔ پس وہ قہر کی وجہ سے مجبور ہے، اپنی ذات کے اعتبار سے بااختیار ہے۔ اور اول (واجب الوجود) میں، اپنی ذات کے اعتبار سے جبر ہے، اور جس کے لیے عمل کیا گیا اس لحاظ سے عمل کے اعتبار سے بااختیار ہے۔\n\nپس ممکن نے واجب الوجود سے اتفاق کیا کہ اگر وہ اس میں ایجاد کا عمل کرے اور اس کا عین ظاہر ہو جائے، تو وہ اس پر، یعنی ممکن پر، اس بات کا حقدار ہو گا کہ وہ اس کی عبادت کرے اور کسی چیز کو اس کا شریک نہ ٹھہرائے، اور اس کے ساتھ وجود عطا کرنے کے عمل پر اس کی حمد کے ساتھ تسبیح کر کے اس کا شکر ادا کرے۔ پس ممکن نے یہ قبول کیا، تو الحق سبحانہ نے اسے ایجاد کیا۔ اور جب اسے ایجاد کیا تو اس سے وہ اجرت طلب کی جس کا وہ اس میں حقدار تھا، اور اس نے اپنے آپ کو ایجاد میں احسان کرنے والا (تبرع کرنے والا) نہیں بنایا۔ پس اس نے اس سے کہا: میری عبادت کر اور میری حمد کے ساتھ تسبیح کر۔ پس تمام ممکنات جنہیں اس نے ایجاد کیا، اس کی تسبیح کی اور اس کی عبادت کی، اور اس کی اجرت پوری کر دی، سوائے بعض لوگوں کے جنہوں نے اس اجرت کو پورا نہیں کیا جو اس نے ان کے لیے ایجاد کرنے پر واجب کی تھی۔ پس ان پر عامل (اللہ) کا مطالبہ متعین ہو گیا۔ اور حکمِ عدل پر یہ متعین ہوا کہ وہ جس کے لیے عمل کیا گیا اس پر اس اجرت کی ادائیگی کا حکم لگائے جس پر اتفاق ہوا تھا۔ اور اس اجارے کا حکم تمام ممکنات میں جاری ہوا، کیونکہ اعمال اپنی ذات سے اس کا تقاضا کرتے ہیں۔ اسی لیے جب عامل احسان کرتے ہوئے اجرت چھوڑ دیتا ہے، تو یہ اس عمل کی قیمت کو زائل نہیں کرتا۔ چنانچہ کہا جاتا ہے کہ اس عمل کی قیمت اتنی اتنی ہے، خواہ عامل نے اپنی اجرت لی ہو یا نہ لی ہو، اور خواہ اس نے ابتداء میں اس کا اندازہ لگایا ہو یا نہ لگایا ہو۔ کیونکہ عمل کی صورت اجرت کی قیمت کو محفوظ رکھتی ہے۔\n\nاور اللہ نے خود اپنے بارے میں خبر دی ہے کہ وہ ان حقوق کے حکم کے تحت داخل ہے، اور ایسا کیوں نہ ہو جبکہ وہ حکیم ہے جو چیزوں کو ان کے مراتب پر رکھتا ہے۔ پس ان میں سے کچھ ایسے ہیں جنہیں ہم نے نہیں جانا یہاں تک کہ اس نے ہمیں ان سے آگاہ کیا، جیسے اس کا فرمان: **وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ** (اور مومنوں کی مدد کرنا ہم پر حق ہے)۔ پس نصرت (مدد) ایمان کی اپنی ذات کی اجرت ہے، لیکن اس کا تقاضا مومن کرتا ہے، اور وہ وہ ہے جس کی صفت ایمان ہے۔ اور وہ سبحانہ نے وفا کیا، پس ایمان کی نصرت ضروری ہے، اور یہ صرف مومن میں ہی ظاہر ہوتی ہے۔ اور مومن میں ایمان تقسیم نہیں ہوتا، یہ جان لو۔ اور جس میں ایمان تقسیم ہو جائے، ان امور کی کثرت کی وجہ سے جن پر ایمان لایا جاتا ہے، پس مومن ان میں سے بعض پر ایمان لائے اور بعض کا کفر کرے، تو وہ مومن نہیں ہے۔ پس صرف وہی رسوا ہوا جو مومن نہیں تھا۔ کیونکہ ایمان کا حکم یہ ہے کہ وہ عام ہو، خاص نہ ہو۔ پس جب اس شخص میں اس کا وجودِ عین نہیں تھا، تو اللہ پر اس کی مدد واجب نہیں ہوئی۔ پس جب کافر ظاہری حکم کی صورت میں مومن پر غالب آتا ہے، تو یہ کافر کے لیے اس پر نصرت نہیں ہے، بلکہ اس کے مقابلے میں جو تھا، جب وہ ہٹا اور اس کی جگہ خالی ہوئی، تو کافر اس میں ظاہر ہو گیا۔ اور یہ نصرت نہیں ہے، سوائے اس کے کہ جب فریقِ مخالف کھڑا ہو اور وہ اسے دلیل سے مغلوب کرے۔\n\nاور ان اجرتوں میں سے جو الحق نے خود پر واجب کی ہیں، ان میں رحمت بھی ہے، پس اس نے اسے اپنے اوپر واجب اجرت قرار دیا اس شخص کے لیے جس نے برے عمل کے بعد توبہ کی اور اپنے عمل کو درست کیا۔ اور کبھی کوئی احسان کرنے والا ایسی اجرت کا بوجھ اٹھا لیتا ہے جو کسی عامل نے کسی دوسرے کے لیے کیا ہو، وہ عمل جو اس احسان کرنے والے کے لیے نہیں کیا گیا، جیسے اس کا فرمان مظلوم کے بارے میں جب وہ ظالم کو معاف کر دے اور اس پر واجب حق کا مطالبہ نہ کرے اور **أَصْلَحَ فَأَجْرُهُ عَلَى الله** (اور اصلاح کرے تو اس کا اجر اللہ پر ہے)۔ حالانکہ اس کی اجرت اس شخص پر ہونی چاہیے تھی جس کے جرم کے مطالبے کو اس نے چھوڑ دیا، لیکن اللہ نے اس اجرت کا بوجھ اس کی طرف سے اٹھا لیا، تاکہ برائی کرنے والے پر شفقت ہو اور اس پر رحمت ہو، پس مظلوم کا اس پر کوئی حق باقی نہ رہے جس کا وہ مطالبہ کرے۔\n\nاور چونکہ عمل اپنی ذات سے اجرت کا تقاضا کرتا ہے اور یہ عامل کی طرف لوٹتا ہے، اور پیغام رسانی ادا کرنے والے کا عمل ہے، کیونکہ بھیجنے والے نے اسے اس شخص تک پیغام پہنچانے میں استعمال کیا جس کی طرف اسے بھیجا گیا تھا، پس اس کی اجرت بھیجنے والے پر واجب ہوئی، کیونکہ جس کی طرف بھیجا گیا اس نے اسے استعمال نہیں کیا کہ اس پر اجرت واجب ہو۔ اسی لیے رسولوں نے اپنی امتوں سے اللہ کے حکم سے کہا، امتوں کو اس امر سے آگاہ کرتے ہوئے کہ معاملہ کیا ہے: **قُلْ ما أَسْئَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ ... إِنْ أَجْرِيَ إِلَّا عَلَى الله** (کہو: میں تم سے اس پر کوئی اجرت نہیں مانگتا ... میری اجرت تو صرف اللہ کے ذمے ہے)۔ پس انہوں نے اس شخص پر اجرت کے استحقاق کا ذکر کیا جو انہیں استعمال کرتا ہے، اور انہوں نے یہ بات اس کے حکم کے بغیر نہیں کہی، کیونکہ اس نے ہر رسول سے کہا: **قُلْ ما أَسْئَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ**۔\n\nاور محمد صلی اللہ علیہ وسلم کو ایک ایسی فضیلت کے ساتھ خاص کیا گیا جو کسی اور کو نہیں ملی، جس کا فضل ان کی امت پر لوٹا، اور ان کا حکم صلی اللہ علیہ وسلم ان سے پہلے کے رسولوں کے حکم کی طرف لوٹ گیا کہ ان کی اجرت اللہ پر باقی رہے۔ پس الحق نے انہیں حکم دیا کہ وہ اپنی رسالت کی اجرت جو ان کے لیے ہے، اپنی امت سے لیں، اور وہ یہ ہے کہ وہ ان کے قرابت داروں سے محبت کریں۔ پس اس نے ان سے فرمایا: **قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً** (کہو: میں تم سے اس پر کوئی اجرت نہیں مانگتا)، یعنی جو کچھ میں تمہارے پاس لایا ہوں اس کی تبلیغ پر، **إِلَّا الْمَوَدَّةَ فِي الْقُرْبى‏** (سوائے قرابت داروں سے محبت کے)۔ پس ان کی امت پر وہ ادائیگی متعین ہو گئی جو اللہ نے ان پر تبلیغ کی اجرت کے طور پر واجب کی تھی، چنانچہ ان پر آپ صلی اللہ علیہ وسلم کے قرابت داروں اور اہل بیت سے محبت کرنا واجب ہو گیا۔ اور اسے مودت (المودۃ) کے نام سے موسوم کیا، اور مودت محبت میں ثابت قدمی کا نام ہے۔ پس جب یہ ان کے لیے مقرر کر دیا گیا، اور یہ نہیں کہا گیا کہ ان کے لیے اللہ پر کوئی اجرت نہیں ہے، اور نہ یہ کہ ان کے لیے اللہ پر کوئی اجرت باقی ہے، اور یہ اس لیے تھا کہ وہ انہیں ان چیزوں سے آگاہ کر کے نعمتوں کی تجدید کرے جو انہیں خوش کرتی ہیں۔ پس اس کے بعد ان سے کہا گیا کہ اپنی امت سے حکم دیتے ہوئے وہی کہو جو کسی رسول نے اپنی امت سے کہا تھا: **قُلْ ما سَأَلْتُكُمْ مِنْ أَجْرٍ فَهُوَ لَكُمْ إِنْ أَجْرِيَ إِلَّا عَلَى الله** (کہو: جو اجرت میں نے تم سے مانگی ہے وہ تمہارے ہی لیے ہے، میری اجرت تو صرف اللہ کے ذمے ہے)۔ پس انہوں نے قرابت داروں سے محبت کے معاملے میں اپنی امت سے اجرت ساقط نہیں کی، بلکہ اس اجرت کو ان پر متعین ہونے کے بعد واپس کر دیا، پس وہ اجرت جو رسول اللہ صلی اللہ علیہ وسلم کے مستحق تھی، ان پر لوٹ آئی۔ چنانچہ مودت کا فضل اہل مودت پر لوٹتا ہے۔ پس کوئی نہیں جانتا کہ رسول اللہ صلی اللہ علیہ وسلم کے قرابت داروں سے مودت رکھنے والوں کے لیے کیا اجرت ہے، سوائے اللہ کے۔ لیکن ان میں سے اہل القربیٰ (قرب والے)۔ اور اسی لیے قربیٰ (القربى) کا لفظ آیا، قرابت (القرابۃ) کا لفظ نہیں۔ کیونکہ نسبی قرابت میں عقیل اور علی کے درمیان کوئی فرق نہیں، کیونکہ وہ دونوں نسب میں رسول اللہ صلی اللہ علیہ وسلم کے چچا زاد بھائی ہیں۔ پس علی نے قربیٰ اور قرابت دونوں کو جمع کیا۔ پس ہم نے آپ صلی اللہ علیہ وسلم کے قرابت داروں میں سے ان سے محبت کی جو ان میں سے قربیٰ والے ہیں، اور وہ مومن ہیں۔ اور اسی لیے عمر رضی اللہ عنہ نے اس شخص کے درمیان فرق کیا جو قرابت میں زیادہ قریب تھا اور جو قربیٰ میں زیادہ قریب تھا، اور وہ عربی تھے جن کی زبان میں قرآن نازل ہوا۔ پس اگر ان کی زبان اور اصطلاح میں اس میں کوئی فرقان (فرق) نہ ہوتا تو عمر رضی اللہ عنہ قربیٰ اور قرابت میں فرق نہ کرتے۔ اور اس کو قرآن میں مالِ غنیمت کے بارے میں اللہ تعالیٰ کے اس فرمان میں دیکھو: **فَأَنَّ لِلَّهِ خُمُسَهُ ولِلرَّسُولِ ولِذِي الْقُرْبى‏** (پس جان لو کہ اس کا پانچواں حصہ اللہ کے لیے ہے اور رسول کے لیے اور ذی القربیٰ (قرابت داروں) کے لیے ہے)۔ اور وہ قرابت داروں میں سے صرف مومن ہی ہیں، پس قربیٰ کا لفظ آیا، قرابت کا لفظ نہیں۔ کیونکہ اگر قرابت داروں کے لیے ایمان کی قربیٰ نہ ہو تو ان کا اس میں اور نہ ہی وراثت میں کوئی حصہ ہے۔ اور یہی نبی صلی اللہ علیہ وسلم کا قول ہے جب آپ مکہ میں داخل ہوئے: \"عقیل نے ہمارے لیے کوئی گھر نہیں چھوڑا\"۔ کیونکہ اس نے اپنے باپ کی وراثت پائی تھی، علی نے نہیں، علی کے ایمان اور عقیل کے کفر کی وجہ سے۔ اور اللہ تعالیٰ نے فرمایا: **لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ‏** (تم کسی ایسی قوم کو نہیں پاؤ گے جو اللہ اور یوم آخرت پر ایمان رکھتی ہو کہ وہ ان لوگوں سے محبت کرے جو اللہ اور اس کے رسول کے مخالف ہیں، خواہ وہ ان کے باپ ہوں یا ان کے بیٹے یا ان کے بھائی یا ان کا قبیلہ)۔ پس اگر مودت فی القربیٰ (الْمَوَدَّةَ فِي الْقُرْبى‏) جو رسول اللہ صلی اللہ علیہ وسلم نے ہم سے مانگی تھی، اس سے مراد قرابت (نسبی رشتہ) ہوتی، تو الحق (ذات حق) اسے اس سے نفی نہ کرتا جب اس نے فرمایا: **يُوادُّونَ من حَادَّ الله ورَسُولَهُ** (وہ ان سے محبت کریں جو اللہ اور اس کے رسول کے مخالف ہیں)، خواہ وہ ان کے قرابت دار ہی کیوں نہ ہوں۔ پس ہم نے جانا کہ مودت فی القربیٰ (الْمَوَدَّةَ فِي الْقُرْبى‏) ان میں سے اہل ایمان کے لیے ہے، اور وہ اللہ کے زیادہ قریب ہیں۔ پس آپ صلی اللہ علیہ وسلم کو دیگر رسولوں علیہم السلام سے اس فضیلت کے ذریعے ممتاز کیا گیا جو اللہ نے ان کی امت کو قربیٰ سے مودت رکھنے میں عطا کی۔ اور آپ کی امت کو دیگر امتوں پر اس فضیلت کی وجہ سے امتیاز حاصل ہوا جو انہیں اس میں حاصل ہے، کیونکہ فضل زیادتی کا نام ہے، اور اسی زیادتی کی وجہ سے امت محمد صلی اللہ علیہ وسلم **خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ** (بہترین امت جو لوگوں کے لیے نکالی گئی) ہے۔ اگرچہ ہر امت نیکی کا حکم دیتی ہے، برائی سے روکتی ہے اور اللہ پر ایمان رکھتی ہے، لیکن اس امت کو ان امور کے ساتھ خاص کیا گیا جو کسی اور امت کو خاص نہیں کیے گئے۔ اور ان کے لیے ان اعمال پر اجرتیں ہیں جن کے ساتھ انہیں خاص کیا گیا، جن میں دوسری امتوں کو استعمال نہیں کیا گیا۔ پس وہ قیامت کے دن اس سے ممتاز ہوں گے اور ان کی فضیلت ظاہر ہو گی۔\n\nپس اجرتیں الحق (ذات حق) اور خلق کے درمیان گردش کرتی ہیں۔ الحق کے لیے اس کی مخلوق پر اجرت ہے ان اعمال کی وجہ سے جو اس نے ان کے لیے کیے، اور مخلوق کے لیے اللہ پر اجرت ہے ان اعمال کی وجہ سے جو انہوں نے اس کے لیے کیے، اور ان اعمال کی وجہ سے جو انہوں نے مخلوق کے لیے الحق کی رعایت کرتے ہوئے کیے، جیسے لوگوں کو معاف کرنے والوں کا معاف کرنا۔ اور مخلوق کے لیے مخلوق پر اجرت ہے، الحق کی شریعت اور اس کے حکم کے ذریعے اس معاملے میں۔ اور اس مسئلے میں جس طرف معاملہ لوٹتا ہے وہ یہ ہے کہ اجرتیں الحق اور الحق کے درمیان گردش کرتی ہیں، مخلوق کا اس میں کوئی دخل نہیں، سوائے اس کے کہ وہ ان اجرتوں کے ظہور کا راستہ ہیں۔ اگر اس میں مخلوق کا وجود نہ ہوتا تو اجارے کا کوئی حکم ظاہر نہ ہوتا اور نہ ہی اجرت کا کوئی عین۔ اور اسی لیے اجرت **جَزاءً وِفاقاً** (مطابق بدلہ) تھی۔ کیونکہ اجرت پر رکھنے والا الحق ہے اور اجیر بھی الحق ہے۔ کیونکہ عمل کرنے والا صرف عمل کا خالق ہے، اور وہ الحق ہے۔ اور مخلوق عمل ہے، اور اس میں عمل کا ظہور ہے۔ اسی لیے اس نے مزاحمت کی اور خود کو اس میں داخل کیا، اور الحق نے اس مزاحمت پر اسے برقرار رکھا اور اسے قبول کیا۔ پس مخلوق میں سے کچھ نے یہ جانا اور کچھ نے اسے نہ جانا۔ اور یہ منزل اس میں میدان کو وسیع کرتی ہے، خاص طور پر اگر ہم اجرتوں اور ان کے حقداروں کے تعین میں لگ جائیں۔\n\nپس ہم ان علوم کا ذکر کرتے ہیں جو یہ منزل اپنے اندر رکھتی ہے۔ ان میں سے ایک علمِ اجورِ خلق دون الحق (مخلوق کی اجرتوں کا علم، الحق کی اجرتوں کے بغیر) ہے۔ اور اس میں یہ علم ہے کہ کس سے اتصال (ملنا) ہے اور کس سے انفصال (جدا ہونا) ہے، اور کس میں انفصال اور اتصال ہے۔ اور یہ ایک عجیب علم ہے جو پورے وجود (الوجود) اور غیر وجود کو شامل ہے۔ کیونکہ وجود مقید (الوجود المقید) عدم کی حالت سے جدا ہوا اور وجود کی حالت سے ملا، ترجیح کے انفصال اور ترجیح کے اتصال کے ساتھ۔ اور جہاں تک وجود مطلق (الوجود المطلق) کا تعلق ہے، تو اس کا عدم سے انفصال ذاتی انفصال ہے جو غیر مرجح ہے۔ پس جس نے یہ علم جانا، اس نے جانا کہ وہ کہاں تھا، کس سے جدا ہوا اور کس سے ملا۔ اور اس میں مناسبتوں کے ذریعے معانی میں تشبیہ کا علم ہے۔ اور اس میں توقیت (وقت مقرر کرنے) میں ترتیب کا علم ہے، اور اسی سے علمِ قضا و قدر (القضاء والقدر) متعلق ہے۔ اور اس میں ملک (بادشاہت) اور تملیک (مالک بنانا) کا علم ہے، اور کیا تملیک کا حکم جب واقع ہو تو وہ اصلی ملک کے حکم جیسا ہوتا ہے یا ان دونوں کا حکم مختلف ہوتا ہے۔ اور اس میں اس چیز کا علم ہے جس سے عالمِ ارکان (عناصر کا عالم) دوسرے عالمِ افلاک سے ممتاز ہوا، اور عالمِ ارکان نے کیوں استحالت (تبدیلی) کو قبول کیا، پس اس کی صورتوں کے اعیان زائل ہو گئے، جیسا کہ اس کے ارکان کی صورتیں ایک دوسرے میں لطافت اور کثافت کے ذریعے تبدیل ہونے سے زائل ہو جاتی ہیں۔ اور عالمِ افلاک ایسا نہیں ہے۔ بلکہ ان کی تبدیلی ان صورتوں میں ان کا ظہور ہے جن میں وہ عالمِ ارکان کے لیے ظاہر ہوتے ہیں۔ اور چونکہ یہ تبدیلی ان طبعی صورتوں میں تھی جو طبیعت کے بغیر ظاہر ہوئیں، اور اس عالم میں ظاہر نہیں ہوئیں جو طبیعت سے اوپر ہے۔ اور یہ تجلی الٰہی (التجلی الإلهي) میں ظاہر ہوئی، اور اس کا حکم عنصری تبدیلی کے ساتھ اس کی صورتوں کے اعیان میں اور اس کی صورتوں میں ظاہر ہوا، بلکہ اس کی صورتوں میں نہیں۔ اور کیا یہ سب کچھ امر کے اپنی ذات میں بدل جانے کی وجہ سے ہے یا یہ دیکھنے والے کی نظر میں ہوتا ہے۔ اور اس میں متقابلات (متضاد چیزوں) کا علم ہے، کیا ان کا علم ان کے مقابل کے علم کا محتاج ہے، یا ہر ایک اپنے علم میں دوسرے کے علم کے بغیر منفرد ہے، اس پر موقوف ہوئے بغیر۔ اور یہ صرف اس شخص کے نزدیک ہو سکتا ہے جو یہ نہیں دیکھتا کہ عین (حقیقت) ایک ہے۔ اور اس میں ملأ اعلیٰ (بلند آسمانی جماعت) میں طبیعت کے اثر اور اس کے مقام کا علم ہے۔ اور اس میں ملأ اعلیٰ کے احوال کا علم ہے۔ اور اس میں موحدین اور مشرکین کا حفظ الٰہی (الإلهي) میں جمع ہونے کا علم ہے، اور کیا یہ مخلوق پر توجہ دینے کے باب سے ہے، اگرچہ وہ جاہل ہوں، یا یہ حقائق (الحقائق) کو یہ عطا کرنے کے باب سے ہے کہ معاملہ اس کے سوا ہو ہی نہیں سکتا۔ مگر یہ عنایت کے باب سے ہے، اور ہمارے نزدیک یہ الٰہی اعلام کے ذریعے اشارے سے عنایت کے باب سے ہے نہ کہ صراحت سے، کیونکہ یہ علمِ اسرار میں سے ہے جو عام لوگوں میں ظاہر نہیں کیا جاتا، لیکن اس کے اہل ہوتے ہیں، اور جاننے والے کو چاہیے کہ وہ اسے اس کے اہل کے سامنے ظاہر کرے، کیونکہ اگر وہ اسے اس کے اہل کو نہ دے تو اس نے دونوں جانبوں پر ظلم کیا: علم پر اور اس کے اہل پر۔ اور اس میں عامل آلات کے مراتب کا علم ہے اور ان کے احکام کا جو عبارات میں ظاہر ہوتے ہیں، اور یہ علمِ حروف ہے جو معنی کے لیے آئے ہیں، پس ان میں سے مرکب ہیں اور غیر مرکب۔ اور اس میں ظالموں کی تقسیم کا علم ہے کہ ان میں سے کس کی مدد کی جائے گی اور کس کی نہیں، اور ظلم اپنے وجود میں کیوں لوٹتا ہے، کیا اس کا وجود ظلمت (تاریکی) سے ہے یا نور سے۔ اور اس میں الحق (ذات حق) کا عینِ اشیاء ہونا اور اس کا نہ پہچانا جانا کا علم ہے۔ اور اس میں حیات (زندگی) اور احیاء (زندہ کرنے) کے درمیان فرق کا علم ہے، اور جب احیاء واقع ہو تو وہ کس چیز سے واقع ہوتا ہے، کیا حیاتِ قدیمہ سے یا پھر کوئی حادث حیات ہے جو احیاء کے ذریعے زندہ ہونے والوں میں ظاہر ہوتی ہے۔ اور اس میں اس بات کا علم ہے کہ کس سے رجوع کیا جائے، کس سے دوستی کی جائے، اور کس چیز میں اور کس پر اعتماد کیا جائے۔ اور اس میں اس بات کا علم ہے کہ اللہ نے مخلوق کو کس چیز میں پیدا کیا، کیا اسے کسی چیز میں پیدا کیا یا اسے کسی چیز میں پیدا نہیں کیا، پس مخلوقات کا عین ہی ان کی شیئیت (شے ہونا) کا عین ہو۔ اور اس میں الحق اور خلق کا وجود (الوجود) میں اشتراک کا علم ہے، اور وہ سب کچھ جس میں انہوں نے اشتراک کیا، کیا وہ اشتراک معقول (عقلی) ہے یا صرف مقول (کہا جانے والا)۔ اور اس میں عالم میں رکھے گئے نوامیس (قوانین) کا علم ہے، کیا انہیں ایک ہی جامع حضرہ (حضور) شامل کرتی ہے، یا ہر ناموس کے لیے ایک حضرہ ہے، یا انہیں صرف دو حضرات جمع کرتی ہیں، پس ایک ناموس کو حکمت کی طرف منسوب کیا جائے اور دوسرے ناموس کو حکمِ الٰہی نبوی کی طرف، اگرچہ ان کی اقسام بہت ہوں۔ اور اس میں بعض مخلوقات کے لیے اختصاص الٰہی (الإلهي) کا علم ہے کہ وہ کس چیز سے واقع ہوا، کیا عنایت سے یا استحقاق سے۔ اور یہ وہ علم ہے جسے اہل اللہ کو عام اور خاص دونوں میں ظاہر کرنے سے منع کیا گیا ہے، کیونکہ یہ علمِ ذوق ہے جو قیاس یا مثال دینے سے حاصل نہیں ہوتا۔ اور اس میں کلمہ وصل اور فصل کا علم ہے، کیا وہ ایک کلمہ ہے یا دو کلمے ہیں۔ اور اس میں اہل کتاب کی فضیلت کا علم ہے، کیا یہ کتابوں کی فضیلت کی وجہ سے ہے یا نہیں؟ اور کیا نازل شدہ کتابوں میں سے بعض کو بعض پر فضیلت حاصل ہے یا ان میں کوئی فضیلت نہیں؟ کیونکہ اللہ نے خود قرآن میں سورتوں اور آیات کے درمیان فضیلت رکھی ہے۔ پس ایک سورت کو پورے قرآن کے دس گنا کے برابر قرار دیا، اور دوسری کو حکم میں اس کے نصف کے مقام پر، اور ایک کو تہائی پر، اور ایک کو چوتھائی پر، اور ایک آیت کو آیات پر سیادت حاصل ہے، اور ایک دوسری آیت کو قرآن کی آیات میں وہی مقام حاصل ہے جو انسانی نشأت میں دل کو حاصل ہے۔ اور قرآن کو دیگر کتابوں پر اعجاز کے ذریعے امتیاز حاصل ہے۔ اور اس میں قرآن کی سورتوں کے درمیان مواخات (بھائی چارے) کا علم ہے، اور اسی لیے آپ صلی اللہ علیہ وسلم نے فرمایا: \"مجھے سورۃ ہود اور اس کی بہنوں نے بوڑھا کر دیا۔\" پس آپ نے ان کے درمیان اخوت قائم کی۔ اور اس میں ہر ملت کو اس کے حال پر برقرار رکھنے کا علم ہے، اور ہر نحلہ (عقیدہ) والے کو اس کے نحلہ پر اور اس کے حق کو پورا کرنے کی ذمہ داری کا علم ہے۔ اور اس میں اس شخص کے حکم کا علم ہے جو جماعت سے جدا ہوا، اور اس میں اللہ کی طرف سے نازل کردہ کتابوں اور عالم میں رکھے گئے الٰہی میزانوں (ترازوؤں) کے درمیان مواخات کا علم ہے، ان کی معنوی اور محسوس صورتوں کے اختلاف کے باوجود۔ پس معنوی میزانیں وجودی، جدلی اور خطابی دلائل کی طرح ہیں، اور محسوس میزانوں کا اختلاف حس کے ذریعے مشاہدہ کیا جاتا ہے۔ اور اس میں جلد بازی کے مقامات اور سستی کے مقامات کا علم ہے۔ اور اس میں لطیف کی قوت اور کثیف کی کمزوری کا علم ہے، اور یہ کہ قوت متصرف (تصرف کرنے والے) کے لیے ہے اور کمزوری اس کے لیے ہے جس میں تصرف کیا جائے۔ اور اس میں اس چیز کا علم ہے جو زیادتی کا تقاضا کرتی ہے اور اس چیز کا جو کمی کا تقاضا کرتی ہے، اور ان دونوں کے درمیان فضیلت کا علم ہے۔ اور اس میں حاکم کے حکم کو محکوم پر نافذ کرنے میں تاخیر کا علم ہے، کسی شبہ کی وجہ سے جو اسے اس سے روکتا ہے، یہاں تک کہ وہ یقین کر لے یا اس کا گمان غالب ہو جائے اس معاملے میں جس میں یقین تک نہیں پہنچا جا سکتا۔ کیونکہ دنیا میں کافر ممکن ہے کہ موت کے وقت مومن ہو جائے، پس اگر موت سے پہلے اس پر کفر کا حکم لگانے میں جلدی کی گئی، تو حاکم نے شبہ کے حکم کو اس کے مقام پر اس کا حق نہیں دیا۔ اور اس میں اعمال میں سے اس چیز کا علم ہے جو زیادتی قبول کرتی ہے اور اس چیز کا جو کمی کو قبول نہیں کرتی۔ اور شرائع میں وہ یہ ہے: **مَنْ جاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْها** (جو نیکی لائے گا تو اس کے لیے اس سے بہتر ہے)، اور وہ **عَشْرُ أَمْثالِها** (اس کے دس گنا) ہے۔ اور **وَمَنْ جاءَ بِالسَّيِّئَةِ فَلا يُجْزى‏ إِلَّا مِثْلَها** (اور جو برائی لائے گا تو اسے صرف اسی کے برابر بدلہ دیا جائے گا)۔ اور اس میں کلمہ (بات) کے نفوذ کا علم ہے، کیا وہ اپنی ذات کی وجہ سے ہے یا نہیں؟ اور یہ کہ وہ کَلْم (زخم) سے ہے، اور وہ زخم لگانے والے کا زخم کھانے والے میں اثر ہے۔ اور اسی طرح ہر کلمہ سننے والے میں اثر رکھتا ہے، اس کا ادنیٰ اثر یہ ہے کہ وہ اس کی صورت سنتا ہے جو کہا گیا اور بولا گیا، اور اس سے اوپر وہ معانی ہیں جو وہ کلام اپنے اندر رکھتا ہے۔ اور اس میں عالم میں بغاوت (البغي) کی اصل کا علم ہے، اور کیا یہ \"بَغٰی یَبْغِی\" (طلب کرنا) سے مشتق ہے، پس وہ بغاوت جس کی اللہ نے مذمت کی، وہ ایک مقید طلب ہو گی، کیونکہ طلب میں سے کچھ مذموم ہے اور کچھ محمود۔ اور اس بغاوت کا علاج کیا ہے۔ اور اس میں وقت کے حکم کے لیے لپیٹنے (طی) اور کھولنے (نشر) کا علم ہے۔ اور اس میں دلالات (اشارات) اور آیات (نشانیاں) کا علم ہے، کیا وہ اپنی ذات کے لیے دلالات اور آیات ہیں یا وہ وضع (مقرر کرنے) سے ہیں۔ اور اس میں مشیئت (ارادہ) کے حادث ہونے کا علم ہے کہ وہ کس طرف لوٹتا ہے، حالانکہ الحق (ذات حق) کے ساتھ حوادث قائم نہیں ہوتے۔ اور اس میں نازل ہونے والی آفات (نوازل) کا علم ہے، کیا وہ ابتداءً نازل ہوتی ہیں یا بدلے کے طور پر۔ اور اس میں سکون اور حرکت کا علم ہے، اور ان مقامات کا علم ہے جہاں سکون کا حکم اور حرکت کا حکم ظاہر ہونا چاہیے۔ اور اس میں اس چیز کا علم ہے جو اللہ اپنے بندوں کو دنیا میں علوم، مراتب اور دیگر چیزوں کی صورت میں عطا کرتا ہے، کیا وہ دنیا سے ہے یا آخرت سے۔ اور اس میں اللہ کے احکام کی تعمیل کا علم ہے، جب ان کی صورت ظاہری طور پر قائم ہو جائے، تو کیا وہ اپنی صورت سے فائدہ دیتی ہے اور کہاں فائدہ دیتی ہے، یا کیا وہ فائدہ نہیں دیتی جب تک کہ اس صورت میں روح نہ پھونکی جائے جس سے وہ زندہ ہو جائے، اور وہ باطن کی صورت ہے۔ اور اس علم سے مطلقاً صورتوں کا علم متعلق ہے، کیا ان کا ظاہر اور باطن ہوتا ہے یا ان میں سے کچھ ایسی ہیں جو ظاہری ہیں اور ان کا کوئی باطن نہیں۔ اور اس میں اس چیز کا علم ہے جو تمام حیوانات کو اپنے لیے انتقام طلب کرنے پر ابھارتی ہے، کیا وہ اذیت کو دور کرنا ہے یا بدلہ ہے یا انتقام کی طلب ہے، یا کچھ اس کے لیے اور کچھ اس کے لیے۔ اور اس میں تحسین (اچھا قرار دینا) اور تقبیح (برا قرار دینا) کا علم ہے، کیا یہ حسن اور قبح کی ذات کی طرف لوٹتا ہے یا کسی عارضی امر کی طرف۔ اور اس میں ان اوصاف کا علم ہے جنہیں پسند کیا جاتا ہے اور جنہیں ناپسند کیا جاتا ہے۔ اور اس میں اس چیز کا علم ہے جو اس شخص سے حرج (تنگی) کو دور کرتی ہے جس سے وہ چیز ظاہر ہو جو طبیعت کو ناپسند ہو۔ اور اس میں ان اسباب کا علم ہے جو اس چیز کو روکتے ہیں جس کے ظہور کا تقاضا طبیعت کرتی ہے۔ اور اس میں اس چیز کا علم ہے جو صرف دقیق اور پوشیدہ نظر سے ہی ادراک کی جا سکتی ہے۔ اور اس میں احوال میں قیام اور انتقال کا علم ہے، کیا احوال منتقل ہوتے ہیں اور بندہ ثابت رہتا ہے، یا بندہ احوال میں منتقل ہوتا ہے اور احوال ثابت رہتے ہیں؟ اور یہ ان عجیب علوم میں سے ہے جو کشف (الکشف) پر موقوف ہیں۔ اور اس میں الحق (ذات حق) میں سے اس چیز کا علم ہے جس کا انکار کیا جاتا ہے اور جس کا انکار نہیں کیا جاتا۔ اور اس باطل کا علم ہے جسے الحق برقرار رکھتا ہے اور جسے برقرار نہیں رکھتا۔ اور وہ باطل کون سا ہے جو زوال قبول کرتا ہے اور وہ کون سا ہے جو قبول نہیں کرتا۔ اور اس میں مقدمات کے موجود ہونے کے باوجود نتیجہ خیز ہونے اور نتیجہ خیز نہ ہونے کا علم ہے، اور مقدمات کب نتیجہ خیز ہوتے ہیں۔ اور اس میں ظاہری نشأت کے حجاب کا علم ہے، اور ان میں سے بشر (انسان) کا مسمیٰ کیا ہے، اور کیا اس کے باطن کے لیے بھی براہ راست تعلق ہے جیسا کہ اس کے ظاہر کے لیے ہے یا نہیں؟ اور اس میں اس حجاب کا علم ہے جو اللہ اور اس کے بندے کے درمیان ہے۔ اور اس میں کلامِ محدث (حادث کلام) اور کلامِ قدیم کا علم ہے کہ وہ کس طرف لوٹتا ہے، کیا وہ مختلف ہے یا اس کا حکم ایک ہے۔ اور اس میں انوار (روشنیوں) اور ان کے مراتب کا علم ہے، اور سبحاتِ وجہ (ذات کے انوار) کا علم ہے، اور وہ کیوں متعدد ہوئیں جبکہ وجہ (ذات) ایک ہے اور سبحات بہت ہیں۔ اور اس میں سبلِ الٰہیہ (الٰہی راستوں) کے درمیان تمیز کا علم ہے۔ اور اس میں مبدأ (آغاز) اور معاد (انجام) کا علم ہے۔ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و چهل و دوم: در معرفت منزل دو سرّ که از سه سرّ جدا شده‌اند و این سه سرّ را یک حضرت از حضرات وحی در بر می‌گیرد، و این منزل از حضرت موسوی است.»\n\nسه سرّ و دو سرّ پس از آن:\nمرید و علّام و قدرتِ قادر.\n\nو آن دو سرّ، سخن (قول) است که شرطش در حیات کسی است\nکه به چیزی می‌گوید «باش» به حکمت آفریننده.\n\nپس منزه است کسی که هیچ چیز کُنه او را درک نمی‌کند؛\nاو اول است که به آخر نیز وصف شده است.\n\n### [وکالت همان خلافت است]\n\nخداوند متعال فرمود: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)؛ پس نفی کرد. سپس فرمود: «و او شنوای بیناست» (وهُوَ السَّمِيعُ الْبَصِيرُ)؛ پس اثبات کرد. و این آیه، عموم اثبات را در عین نفی و در آنچه پس از آن است، اقتضا می‌کند، اگر حرف «کاف» را برای صفت قرار دهی. و این نظر را حدیث تأیید می‌کند، و آن فرموده پیامبر (ص) است: «همانا خداوند آدم را بر صورت خود آفرید.»\n\nو نفی مماثلت (همانندی) او در حال متصف شدن به این وصف است. پس شرع وارد شد که اگر با دو خلیفه بیعت شود، چه در خلافت عمومی باشد یا محدود به گروهی خاص، دومی از آن دو کشته می‌شود. پس در آن گروه یا در عموم، بسته به اقتضای زمان، مماثلتی وجود ندارد. اگر حکم اراده (وجوداً و تقدیراً) نبود، به کشتن دومی امر نمی‌شد. و قتل، زوال از صفت حکم است. پس تو زائل شو تا او باقی بماند، زیرا تو آخری. اگر برخی از عارفان (عارفین) بگویند: «پس اول در اینجا خلیفه نیست»، می‌گوییم: او به راستی خلیفه است، به امر الهی و نهی از مشارکت در آنچه به خلافتش از جانب تو امر شده است. پس فرمود: «پروردگار مشرق و مغرب، هیچ معبودی جز او نیست، پس او را وکیل (فَاتَّخِذْهُ وَكِيلًا) بگیر.» و وکیل بدون شک خلیفه موکّل در آن چیزی است که او را در آن وکیل کرده است. و فرمود: «جز من وکیلی نگیرید» (أَلَّا تَتَّخِذُوا من دُونِي وَكِيلًا). پس نهی کرد از اینکه وکیلی غیر از او بگیریم. پس الوهیت او، عین وکالت او نیست. و ما تنها درباره وکالت (الوکالة) که همان خلافت (الخلافة) است و درباره وکیل که همان خلیفه است، سخن گفتیم. همان‌طور که از منظری دیگر به فرموده او به ما نگریسته می‌شود: «و از آنچه شما را در آن جانشین (مُسْتَخْلَفِينَ) قرار داده، انفاق کنید» (وأَنْفِقُوا مِمَّا جَعَلَكُمْ مُسْتَخْلَفِينَ فِيهِ). پس ما به حکم خلافت حق انفاق داریم، و انفاق، ملک ماست، و انفاق، تصرف است. پس ما او را به امر خودش، وکیل خود در انفاق قرار دادیم، یعنی خلیفه، زیرا می‌دانیم که او از مواضع تصرف چیزهایی می‌داند که ما نمی‌دانیم. پس او مالک است و او خلیفه است. خداوند مراتب را برای ما متمایز نساخت و آشکار ننمود و با اسم‌هایش در اعیان (ذوات) آن‌ها ظاهر نشد و در آن‌ها بر ما تجلی (التجلی) نکرد، مگر برای اینکه او را در هر مرتبه‌ای که دیدیم در آن نازل شده است، جای دهیم. پس بر او حکم کنیم به آنچه او بر خود حکم کرده است. و این کامل‌ترین علم به خداوند است که او را به واسطه خودش بشناسیم، نه به واسطه نظر خودمان و نه به واسطه جایگاهی که ما برای او قائل می‌شویم. منزه است خداوند خالق از اینکه بر او حکم کنیم به آنچه آفریده است، بدون اینکه او در آنچه بر او حکم شده، ظاهر شود. پس او خود حاکم بر خویش باشد، نه من. و این معنای سخن علماست که حق (الحق) نامیده نمی‌شود مگر به آنچه خود را نامیده است، یا در کتابش یا بر زبان رسولش که مترجم از جانب اوست. پس هر کس را خداوند در مقام ترجمه از جانب خود، با رفع واسطه‌ها یا به واسطه ارواح نوریه، قرار دهد و او با اسمی بیاید که حق خود را به آن نامیده است، ما حق داریم او را به آن اسم بنامیم. و فرقی نمی‌کند که مترجم برای ما شریعت‌گذار باشد یا غیر شریعت‌گذار. در این امر تنها ترجمه از جانب او شرط است تا بر او حکم نکنیم مگر به واسطه خودش. زیرا اوست که فرمود: «اگر از خدا پروا کنید، برای شما فرقان (ابزار تمییز) قرار می‌دهد» (إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً). که به وسیله آن تمییز می‌دهید و فرق می‌گذارید بین آنچه شایسته اوست و آنچه شایسته شماست. پس حق هر صاحب حقی را به او می‌دهد. پس کلیدها (المقالید) از آن اوست و گشودن با آن‌ها و بدون آن‌ها از آن اوست. و گشودن با آن‌ها از آن ماست، اما آن‌ها از آن ما نیستند، بلکه در دست اویند. و آنچه در دست اوست، از او خارج نمی‌شود، زیرا دیگر جایی نیست که به آنجا برود. پس او دهنده و گیرنده است، زیرا صدقه در دست رحمان قرار می‌گیرد.\n\n### [همانا وحی الهی تنها از مقام عزّتِ مصون نازل می‌شود]\n\nو بدان که وحی الهی تنها از مقام عزّتِ مصون (العزة الأحمى) نازل می‌شود. به همین دلیل اکتسابی نیست، زیرا با تکلّف نمی‌توان به آن مقام رسید. و اگر با تکلّف به آن می‌رسید، متصف به عزّت نمی‌شد. وحی نازل می‌شود تا اموری را که حکمت هستی (الوجود) اقتضا می‌کند، ترتیب دهد. «و اگر از جانب غیر خدا بود، قطعاً در آن اختلاف بسیاری می‌یافتند» (ولَوْ كانَ من عِنْدِ غَيْرِ الله لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً) که با ترتیب حکمت هستی مخالفت کند. و چون جز از جانب خدا نیست، پس در نهایتِ استحکام و اتقان است که غیر آن ممکن نیست. پس در امکان، بدیع‌تر از این عالم وجود ندارد، زیرا خداوند خلقتش را به آن عطا کرده و آن را در منزلتی که شایسته آن است، نازل نموده است. پس بنگر به این نیروی الهی که خداوند به کسی که وحی بر او نازل شده، عطا کرده است؛ وحیی که اگر بر کوهی نازل می‌شد، «آن را از ترس خدا، خاشع و متلاشی می‌دیدی» (لَرَأَيْتَهُ خاشِعاً مُتَصَدِّعاً من خَشْيَةِ الله). زیرا آنان قدر کسی را که آن را نازل کرده است، دانستند. پس خداوند از نیرویی به آن‌ها روزی داد که توان حمل آن جلال را داشته باشند. پس هرگاه درباره خداوند چیزی بشنوند که مخالف تجلی (التجلی) او بر آن‌هاست، «نزدیک است که آسمان‌ها از آن متلاشی شوند و زمین شکافته گردد و کوه‌ها به شدت فرو ریزند، به خاطر اینکه برای رحمان فرزندی قائل شدند» (تَكادُ السَّماواتُ يَتَفَطَّرْنَ مِنْهُ وتَنْشَقُّ الْأَرْضُ وتَخِرُّ الْجِبالُ هَدًّا أَنْ دَعَوْا لِلرَّحْمنِ وَلَداً). و اهل الله و رسولان او این را شنیدند و هیچ یک از این امور بر آن‌ها جاری نشد، به دلیل نیروی علمی که خداوند به آن‌ها عطا کرده بود، زیرا هیچ چیز قوی‌تر از علم نیست. پس خداوند در این فرموده‌اش بر آن‌ها تجلی کرد: «اگر خدا می‌خواست فرزندی بگیرد» (لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً) و «اگر می‌خواستیم سرگرمی بگیریم، قطعاً آن را از نزد خود می‌گرفتیم» (ولَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا). پس اهل الله، از رسول و نبی و ولی، چیزی را درباره خداوند دانستند که آسمان‌ها و زمین و کوه‌ها ندانستند. این علم به خداوند، نیرویی در نفوس آن‌ها ایجاد کرد که به واسطه آن، آنچه را از قول کسانی که گفتند مسیح پسر خداست و عزیر پسر خداست، شنیدند، تحمل کردند و متزلزل نشدند. و اگر این (سخن) بر کسی نازل می‌شد که این نیرو را نداشت، از عظمت آنچه بر او آمده بود، در جای خود ذوب می‌شد. پس بنگر که حجاب کسی که معتقد است خداوند فرزندی دارد، چقدر غلیظ است و کوری او از حقایق چقدر شدید است. و هیچ امری در تجلی الهی بر من نگذشت که مرا متحیر سازد و قوتم را تضعیف کند، شدیدتر از سخن فرشتگان: «پروردگارا، رحمت و علم تو همه چیز را فرا گرفته است، پس کسانی را که توبه کرده‌اند و راه تو را پیروی نموده‌اند، بیامرز و آنان را از عذاب دوزخ حفظ کن» (رَبَّنا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وعِلْماً فَاغْفِرْ لِلَّذِينَ تابُوا واتَّبَعُوا سَبِيلَكَ وقِهِمْ عَذابَ الْجَحِيمِ). و خداوند می‌فرماید: «بر نیکوکاران هیچ راهی (برای مؤاخذه) نیست» (ما عَلَى الْمُحْسِنِينَ من سَبِيلٍ). و چه احسانی بزرگتر از کسی که توبه کرده و راه او را پیروی نموده است؟ و سخن نوح که از کاملان اهل الله است: «و برای کسی که مؤمنانه وارد خانه من شود» (ولِمَنْ دَخَلَ بَيْتِيَ مُؤْمِناً). این (سخن نوح) گویی چیزی را باقی گذاشته است، زیرا او طلب مغفرت نکرد مگر برای مؤمن، و پیروی از راه خدا را ذکر نکرد، چرا که مؤمن ممکن است مخالف امر و نهی خدا باشد. و خداوند به کسانی که بر خود اسراف کرده‌اند، می‌فرماید: «همانا خداوند همه گناهان را می‌آمرزد» (إِنَّ الله يَغْفِرُ الذُّنُوبَ جَمِيعاً). پس این گروه از فرشتگان در مقام ادب ایستادند و به این سخن حکم کردند، به دلیل ترجیح دادن ساحت الهی بر خلق. به همین دلیل تقدیم و تأخیر کردند. و خداوند در فرموده خود قبل از این دعا، از آن‌ها خبر نداد: «رحمت و علم تو همه چیز را فرا گرفته است» (وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وعِلْماً). پس در آن بوی طلب مغفرت برای بدکاران است. و همچنین سخن خود را که «و آنان را از بدی‌ها حفظ کن» (وقِهِمُ السَّيِّئاتِ) تا به آن‌ها نرسد، به تأخیر انداختند، زیرا این در عنایت کامل‌تر است. «و هر کس را در آن روز (روزی که او را حفظ کنی) از بدی‌ها حفظ کنی، قطعاً به او رحم کرده‌ای» (ومن تَقِ السَّيِّئاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ). و این همان سخن آن‌هاست: «رحمت تو همه چیز را فرا گرفته است» (وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً). پس آنچه ذکر کردند، در میان این دو آمد، گویی ترجیح دادن ساحت الهی است، همان‌طور که پیامبر (ص) در قیامت می‌فرماید: «دور باد، دور باد.» و خداوند مغفرت را جز به گناه معلق نساخت، آنجا که آن را معلق کرد. و درباره گروه دیگری از فرشتگان فرمود: «آنان برای کسانی که در زمین هستند، طلب آمرزش می‌کنند» (يَسْتَغْفِرُونَ لِمَنْ في الْأَرْضِ). پس اینان مغفرت را در جایگاه خود نازل کردند و نگفتند آنچه را که آن گروه دیگر گفتند، که خداوند از آن‌ها حکایت کرد که: «آنان برای کسانی که ایمان آورده‌اند، طلب آمرزش می‌کنند» (يَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا). پس مشرب‌های آن‌ها متنوع شد، همان‌طور که گفتند: «و هیچ یک از ما نیست مگر اینکه برای او مقامی معلوم است» (وما مِنَّا إِلَّا لَهُ مَقامٌ مَعْلُومٌ). و ولیّ کامل (الولي الكامل) خداوند را با هر مقام و زبانی می‌خواند. و رسولان در آنچه به آن‌ها وحی شده است، توقف می‌کنند، و آن‌ها بسیارند. و گاهی به برخی از آن‌ها وحی می‌شود که به دیگری وحی نمی‌شود. و محمدی (المحمدي) به واسطه مرتبه‌اش، تمام آنچه را که در رسولان از دعا متفرق شده است، جمع می‌کند. پس او در دعا با هر زبانی مطلق است، زیرا مأمور به ایمان به رسولان و آنچه بر آن‌ها نازل شده است، می‌باشد. پس ولیّ محمدی (الولي المحمدي) با وحی خاص توقف نکرد، مگر در حکم به حلال و حرام. اما در دعا و آنچه درباره آن سکوت شده و در شریعت محمد (ص) چیزی نازل نشده که اجازه ترک آن را بدهد، آن را ترک نمی‌کند، اگر وحی بر پیامبری از پیامبران (ع)، چه رسول باشد و چه غیر رسول، نازل شده باشد.\n\n### [اختلاف امت من رحمت است]\n\nسپس بدان که از رحمت خداوند بر بندگانش این است که حکم آنچه را در آن اختلاف کرده‌اند، به خدا واگذار کرده است. ما این را از جهت علم رسوم می‌گیریم که به آنچه اختلاف و نزاع کرده‌اند، بنگریم. اگر خداوند و رسولش در آن حکمی داشته باشند که قول یکی از مخالفان را تأیید کند، حق را در دست او قرار می‌دهیم، زیرا به ما امر شده است که اگر در چیزی نزاع کردیم، آن را به خدا و رسولش بازگردانیم، اگر مؤمن باشیم. و اگر از عالمان باشیم، از کسانی که بر بصیرت و بینه از پروردگارمان دعوت می‌کنند، در آن مسئله به علم حکم می‌کنیم، و این بازگشت به خداوند متعال است از غیر طریق ایمان. و ما به هیچ وجه حق عدول از آن را نداریم. این حدّ علم رسم است. اما علم حقیقت (علم الحقيقة): حکم مختلفین به خدا باز می‌گردد، یعنی حکم ظهور اختلاف در آن‌ها به خدا باز می‌گردد، از این جهت که اسم‌های الهی (الأسماء الإلهية) سبب اختلاف هستند، به ویژه اسم‌های تقابل. این را فرموده او در چنین موردی تأیید می‌کند: «این است خدا، پروردگار من» (ذلِكُمُ الله رَبِّي). زیرا او چیزی جز اسم‌هایش نیست. اوست که می‌فرماید: «بگو: خدا را بخوانید یا رحمان را بخوانید» (قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ). و نگفت: «به خدا» یا «به رحمان». پس در اینجا اسم را عین مسمّا قرار داد، همان‌طور که در جای دیگر آن را غیر مسمّا قرار داد. پس وقتی فرمود: «این است خدا، پروردگار من» (ذلِكُمُ الله رَبِّي)، و اشاره با «ذا» به همان خدایی است که در فرموده «پس حکم او به سوی خداست» (فَحُكْمُهُ إِلَى الله) ذکر شده است. اگر در فرموده «الله» اسم عین مسمّا نبود، فرموده «پروردگار من» (رَبِّي) صحیح نبود. و اختلاف در اسم‌های الهی (الأسماء الإلهية) ظاهر شد. پس حکم خدا در عالم به واسطه آن ظاهر شد. پس بر اختلافی که در عالم واقع شده است، حکم می‌شود که عین حکم خداست که در صورت مخالفان ظاهر شده است.\n\n### «فصل» در پاداش‌ها\n\nپاداش‌ها (الأجور) همان حقوقی هستند که اعمال خاصی آن‌ها را طلب می‌کنند. و این حکمی است که در قدیم و حادث جاری است. پس هر کس برای دیگری کاری انجام دهد، مستحق مزدی (أجر) بر او می‌شود. و پاداش‌ها بر دو قسم‌اند: معنوی و حسی. اگر کسی دیگری را برای انجام کاری اجیر کند و او آن کار را انجام دهد، عامل به واسطه آن حقی بر کسی که کار برای او انجام شده، واجب کرده است که آن را «أجر» می‌نامند. و بر کسی که کار برای او انجام شده، واجب است که آن حق را ادا کند و به او برساند. اجاره‌دهنده (المؤجر) در به کارگیری اجیر در ظاهر مختار است، اما در باطن مضطر. و اجیر (الأجير) در پذیرش به کارگیری در برخی کارها مختار است و در برخی کارها مقهور. و حکم اختیار از او زائل نشده است، زیرا می‌تواند نپذیرد اگر بخواهد، و می‌تواند بپذیرد اگر بخواهد. پس او در ظاهر مختار و در باطن مضطر است، مانند اجاره‌دهنده. اولین اجیری که در هستی (الوجود) ظاهر شد، از نیاز ممکن (الممكن) به ایجاد (الإيجاد) بود. و آن، کار هستی (الوجود) در ممکن است تا عین آن از واجب الوجود (واجب الوجود) ظاهر شود. آن واجب الوجود است. پس ممکن در حال عدمش به واجب گفت: می‌خواهم تو را در ظهور عینم به کار گیرم. پس ایجاد، عمل است؛ و هستی (الوجود)، معمول (کار انجام شده) است؛ و موجود، کسی است که صورت عمل در او ظاهر شده است. هر معمول (کار انجام شده) قبل از عملش معدوم است. پس حق (الحق) به او گفت: اگر من این کار را برای تو انجام دهم و تو را ظاهر سازم، حقی بر من داری. و این حق همان است که «أجر» نامیده می‌شود. و آنچه اجاره‌دهنده (المؤجر) از اجیر (المؤجر) طلب می‌کند، «اجاره» نامیده می‌شود. و اجاره‌دهنده در ابتدا در تعیین مزد (الأجر) مختار است. اگر بخواهد، آنچه را که در مقابل آن کار به او می‌دهد، تعیین می‌کند؛ و اگر بخواهد، تعیین را به اجیر واگذار می‌کند. و اجیر در پذیرش آنچه اجاره‌دهنده تعیین کرده، مختار است، اگر چیزی برای او تعیین کرده باشد یا آن را رد کند. و اگر اجاره‌دهنده خود داوطلبانه کار را انجام دهد و بگوید: «در مقابل آن مزدی نمی‌گیرم»، این برای او جایز است. اما حکم ارزش (القيمة) از آن عمل زائل نمی‌شود، زیرا عمل به ذات خود، مزد را به واسطه ارزشش تعیین می‌کند. اگر عامل بخواهد، آن را می‌گیرد و اگر بخواهد، ترک می‌کند. و حکم عمل ساقط نمی‌شود، اگر مزد آن چنین باشد. و این مسئله‌ای عجیب است که بین اختیار و اضطرار در اجاره‌دهنده و اجیر در گردش است. و هر دو در اختیار خود مجبورند. با این تفاوت که حق (الحق) به جبر وصف نمی‌شود، و ممکن (الممكن) به جبر وصف می‌شود، با علم ما به اینکه قول نزد او تبدیل نمی‌شود و از انجام آنچه در علم او سبقت گرفته که انجام دهد، و از ترک آنچه در علم او سبقت گرفته که ترک کند، خارج نمی‌شود. و جبر چیزی جز این نیست. با این تفاوت که در اینجا، عین کسی که او را مجبور می‌کند، عین مجبور است، زیرا او را مجبور نکرده مگر علمش، و علمش صفت اوست، و صفتش ذات اوست. و جبر در ممکن (الممكن) این است که غیر او، نه عین او، او را مجبور کند. و اگر بخواهد خلاف آنچه بر آن مجبور شده است، انجام دهد، نمی‌تواند. پس او از روی قهر مجبور است، و با نظر به ذاتش مختار. و در اولی (حق)، جبر با نظر به ذاتش است، و اختیار با نظر به عمل از جهت کسی که کار برای او انجام شده است. پس ممکن با واجب الوجود (واجب الوجود) توافق کرد که اگر ایجاد (الإيجاد) در او عمل کند و عین او ظاهر شود، مستحق حقی بر او (ممکن) در آن می‌شود که او را عبادت کند و چیزی را شریک او نسازد، و او را بر آنچه با او انجام داده از عطا کردن هستی (الوجود)، با ثنا گفتن بر او به تسبیح و حمد، شکر کند. ممکن این را پذیرفت. پس حق سبحانه او را ایجاد کرد. هنگامی که او را ایجاد کرد، آنچه را که به واسطه آن مستحق مزد (الأجر) شده بود، از او طلب کرد و خود را در ایجادش داوطلبانه قرار نداد. پس به او گفت: «مرا عبادت کن و به حمد من تسبیح گوی.» پس تمام ممکناتی که او ایجاد کرد، او را تسبیح گفتند و عبادت کردند و مزد او را به طور کامل ادا کردند، به جز برخی از مردم. پس او مزد آنچه را که برایشان ایجاد کرده بود، به طور کامل ادا نکردند. پس مطالبه عامل (حق) واجب شد، و بر حاکم عادل واجب شد که بر کسی که کار برای او انجام شده است، حکم کند که مزدی را که بر آن توافق شده است، ادا کند. و حکم این اجاره در تمام ممکنات جاری شد، زیرا اعمال به ذات خود آن را طلب می‌کنند. به همین دلیل، اگر عامل داوطلبانه عمل کند و مزد را ترک کند، این امر ارزش آن عمل را از بین نمی‌برد. پس گفته می‌شود: «ارزش این عمل فلان قدر است»، چه عامل مزد خود را بگیرد یا نگیرد، و چه آن را از ابتدا تعیین کرده باشد یا نکرده باشد. زیرا صورت عمل، ارزش مزد را حفظ می‌کند. و خداوند از خود خبر داده است که تحت حکم این حقوق قرار می‌گیرد. و چگونه چنین نباشد، در حالی که او حکیم است و اشیا را در مراتب خود مرتب کرده است؟ از جمله اموری که ما آن را نشناختیم تا اینکه او ما را به آن شناساند، مانند فرموده او: «و یاری مؤمنان بر ما حق (واجب) بود» (وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ). پس نصرت (یاری)، مزد ایمان به ذات خود است، اما مؤمن آن را اقتضا می‌کند، و او کسی است که صفتش ایمان است. و او سبحانه وفا کرد. پس نصرت ایمان ضروری است و این جز در مؤمن ظاهر نمی‌شود. و ایمان در مؤمن تجزیه نمی‌شود. این را بدان. و هر کس که ایمان در او تجزیه شود، به دلیل تعدد اموری که به آن‌ها ایمان آورده می‌شود، و مؤمن به برخی از آن‌ها ایمان آورد و به برخی کفر ورزد، مؤمن نیست. پس تنها کسی که خوار می‌شود، کسی است که مؤمن نیست. زیرا حکم ایمان این است که فراگیر باشد و تخصیص نپذیرد. پس چون وجود عینی در شخص نداشت، نصرت او بر خدا واجب نشد. پس اگر کافر در صورت حکم ظاهری بر مؤمن غلبه کند، این نصرت برای کافر بر او نیست، بلکه آنچه در مقابل اوست، چون روی برگرداند و جای خود را خالی کرد، کافر در آن ظاهر شد. و این نصرت نیست، مگر با ایستادگی خصم و غلبه بر او با دلیل. و از جمله اموری که حق (الحق) آن را بر خود واجب کرده است، یعنی از مزد، رحمت است. پس آن را مزدی واجب بر خود قرار داد برای کسی که پس از انجام بدی توبه کند و عمل خود را اصلاح نماید. و گاهی داوطلبی، مزدی را بر عهده می‌گیرد برای عاملی که کاری را برای دیگری انجام داده است، نه برای این داوطلب. مانند فرموده او درباره مظلوم، هنگامی که از کسی که به او ظلم کرده، درگذرد و او را به آنچه مستحق آن بوده، مؤاخذه نکند و «اصلاح کند، پس پاداش او بر خداست» (وَأَصْلَحَ فَأَجْرُهُ عَلَى الله). و شایسته بود که مزد او بر کسی باشد که مطالبه جنایتش ترک شده است. پس خداوند آن مزد را از جانب او بر عهده گرفت، برای حفظ مسیء (بدکار) و رحمت بر او. پس حقی برای مظلوم بر او باقی نمی‌ماند که او را به آن مطالبه کند. و چون عمل به ذات خود مزد را طلب می‌کند و این به عامل باز می‌گردد، و رساندن پیام‌ها، عملِ رساننده است، زیرا فرستنده او را در رساندن پیامش به کسی که برای او فرستاده، به کار گرفته است، پس مزد او بر فرستنده واجب است، زیرا گیرنده پیام او را به کار نگرفته است تا مزدش بر او واجب شود. به همین دلیل، رسولان به امت‌های خود، به امر خدا، برای آگاه ساختن امت‌ها از آنچه امر بر آن است، گفتند: «بگو: من بر این (رسالت) از شما مزدی نمی‌خواهم... مزد من جز بر خدا نیست» (قُلْ ما أَسْئَلُكُمْ عَلَيْهِ من أَجْرٍ ... إِنْ أَجْرِيَ إِلَّا عَلَى الله). پس آن‌ها استحقاق مزد را بر کسی که آن‌ها را به کار گرفته است، ذکر کردند و این را نگفتند مگر به امر او. زیرا او به هر رسولی فرمود: «بگو: من بر این (رسالت) از شما مزدی نمی‌خواهم.» و محمد (ص) به فضیلتی اختصاص یافت که غیر او به آن نرسید، که فضل آن به امتش بازگشت و حکم آن حضرت (ص) به حکم رسولان پیش از او در باقی ماندن مزدش بر خدا بازگشت. پس حق (الحق) به او امر کرد که مزد خود را که بر رسالتش دارد، از امتش بگیرد، و آن این است که با خویشاوندان او دوستی کنند. پس به او فرمود: «بگو: من بر این (تبلیغ آنچه برای شما آورده‌ام) مزدی از شما نمی‌خواهم، مگر دوستی در مورد خویشاوندان نزدیک (إِلَّا الْمَوَدَّةَ في الْقُرْبى‏).» پس بر امتش واجب شد که آنچه را خداوند بر آن‌ها از مزد تبلیغ واجب کرده است، ادا کنند. پس محبت خویشاوندان (قرابته) و اهل بیت او (ص) بر آن‌ها واجب شد. و آن را به نام «مودت» (المودة) قرار داد که همان ثبات در محبت است. هنگامی که این را برای او قرار داد و نگفت که او مزدی بر خدا ندارد و نه اینکه مزدی بر خدا برای او باقی مانده است، و این برای آن بود که نعمت‌ها را با شناساندن آنچه او را شاد می‌کند، برای او تجدید کند. پس بعد از این به او گفته شد: به امت خود بگو، در حالی که امر کننده است، آنچه را که رسولی به امتش گفت: «بگو: هر مزدی که از شما خواستم، آن برای شماست. مزد من جز بر خدا نیست» (قُلْ ما سَأَلْتُكُمْ من أَجْرٍ فَهُوَ لَكُمْ إِنْ أَجْرِيَ إِلَّا عَلَى الله). پس مزد را از امت خود در مودتشان نسبت به قربا (خویشاوندان نزدیک) ساقط نکرد، بلکه آن مزد را پس از واجب شدن بر آن‌ها، بازگرداند. پس آن مزدی که رسول خدا (ص) مستحق آن بود، به خود آن‌ها بازگشت. پس فضل مودت به اهل مودت باز می‌گردد. و هیچ کس نمی‌داند که اهل مودت در مورد خویشاوندان رسول خدا (ص) چه مزدی دارند، مگر خدا. اما اهل قربا (القربى) از آن‌ها هستند. به همین دلیل، لفظ «قربا» (القربى) آمد و لفظ «قرابت» (القرابة) نیامد. زیرا بین عقیل در خویشاوندی نسبی و علی (ع) تفاوتی نیست، چرا که هر دو پسر عموی رسول خدا (ص) در نسب هستند. پس علی (ع) بین قربا و قرابت جمع کرد. پس ما با خویشاوندان (قرابته) او (ص) که از اهل قربا (القربى) هستند، یعنی مؤمنان، دوستی کردیم. به همین دلیل عمر (رضی الله عنه) بین کسی که خویشاوندی نزدیک‌تر و قربای نزدیک‌تر دارد، فرق گذاشت. و او عربی است که قرآن به زبان او نازل شده است. اگر در زبان و اصطلاح آن‌ها در این مورد فرقانی نبود، عمر بین قربا و قرابت فرق نمی‌گذاشت. و این را در قرآن در مورد غنائم ببینید، در فرموده خداوند متعال: «پس یک پنجم آن برای خدا و برای رسول و برای خویشاوندان نزدیک (ولِذِي الْقُرْبى‏) است» (فَأَنَّ لِلَّهِ خُمُسَهُ ولِلرَّسُولِ ولِذِي الْقُرْبى‏). و آن‌ها جز مؤمنان از خویشاوندان نیستند. پس لفظ «قربا» آمد نه لفظ «قرابت». زیرا اگر خویشاوندان، قربای ایمان نداشته باشند، سهمی در آن ندارند و در میراث نیز ندارند. و این فرموده پیامبر (ص) در روز ورود به مکه است: «عقیل برای ما خانه‌ای باقی نگذاشت.» زیرا او (عقیل) وارث پدرش شد نه علی (ع)، به دلیل ایمان علی و کفر عقیل. و خداوند متعال فرمود: «قومی را که به خدا و روز آخرت ایمان دارند، نمی‌یابی که با کسانی که با خدا و رسولش دشمنی کرده‌اند، دوستی کنند، هر چند پدرانشان یا پسرانشان یا برادرانشان یا قبیله‌شان باشند» (لا تَجِدُ قَوْماً يُؤْمِنُونَ بِاللَّهِ والْيَوْمِ الْآخِرِ يُوادُّونَ من حَادَّ الله ورَسُولَهُ ولَوْ كانُوا آباءَهُمْ أَوْ أَبْناءَهُمْ أَوْ إِخْوانَهُمْ أَوْ عَشِيرَتَهُمْ‏). اگر مودت در قربا (الْمَوَدَّةَ في الْقُرْبى‏) که رسول خدا (ص) از ما خواست، منظور خویشاوندان (القرابة) بود، حق (الحق) آن را از آن‌ها نفی نمی‌کرد در فرموده خود: «با کسانی که با خدا و رسولش دشمنی کرده‌اند، دوستی کنند، هر چند خویشاوندانشان باشند.» پس دانستیم که «مودت در قربا» (الْمَوَدَّةَ في الْقُرْبى‏) در اهل ایمان از آن‌هاست، و آن‌ها نزدیک‌ترین افراد به خدا هستند. پس پیامبر (ص) از سایر رسولان (ع) به واسطه آنچه خداوند به امتش در مودتشان نسبت به قربا عطا کرد، متمایز شد. و امت او بر سایر امت‌ها به واسطه فضلی که در این امر دارند، متمایز شدند، زیرا فضل همان زیادی است. و به واسطه این زیادی بود که «بهترین امتی بودید که برای مردم پدیدار شدید» (خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ)، امت محمد (ص). و اگرچه هر امتی امر به معروف و نهی از منکر می‌کند و به خدا ایمان می‌آورد، اما این امت به اموری اختصاص یافت که هیچ امتی به آن‌ها اختصاص نیافت. و بر اعمالی که به آن‌ها اختصاص یافته‌اند و غیر آن‌ها از امت‌ها در آن به کار گرفته نشده‌اند، پاداش‌هایی دارند. پس به واسطه آن در روز قیامت متمایز می‌شوند و فضلشان آشکار می‌گردد. پس پاداش‌ها (الأجور) بین حق (الحق) و خلق در تردد است. حق بر خلق خود به دلیل اعمالی که برای آن‌ها انجام داده، مزد دارد. و خلق بر خدا به دلیل اعمالی که برای او انجام داده‌اند، و اعمالی که برای خلق انجام داده‌اند به رعایت حق، مانند عفو عفوکنندگان از مردم، مزد دارند. و خلق بر خلق به واسطه تشریع حق و حکم او در آن، مزد دارند. و آنچه در این مسئله به آن باز می‌گردد، این است که پاداش‌ها بین حق و حق در تردد هستند و خلق در آن دخالتی ندارند، مگر اینکه راهی برای ظهور این پاداش‌ها باشند. اگر وجود خلق در آن نبود، حکم اجاره و عین مزد ظاهر نمی‌شد. و به همین دلیل مزد «جزایی موافق» (جَزاءً وِفاقاً) بود. زیرا اجاره‌دهنده حق است و اجیر حق است، چرا که هیچ عاملی نیست مگر خالق عمل که او حق است. و خلق، عمل است و ظهور عمل در آن است. به همین دلیل مزاحمت کرد و خود را در آن وارد نمود و حق این مزاحمت را پذیرفت و تأیید کرد. پس برخی از خلق این را دانستند و برخی آن را نادیده گرفتند. و این منزل، مجال گسترده‌ای دارد، به ویژه اگر به تعیین پاداش‌ها و صاحبان آن‌ها بپردازیم. پس آنچه را که این منزل از علوم در بر می‌گیرد، ذکر می‌کنیم. از جمله آن، علم پاداش‌های خلق بدون حق است. و در آن، علم اتصال به چه کسی و انفصال از چه کسی، و انفصال و اتصال در چه کسی است. و این علم غریبی است که تمام هستی (الوجود) و غیر هستی را در بر می‌گیرد. زیرا هستی مقید (الوجود المقید) از حال عدم جدا شد و به حال هستی متصل گشت؛ انفصال ترجیحی و اتصال ترجیحی. اما هستی مطلق (الوجود المطلق)، انفصالش از عدم، انفصال ذاتی غیر ترجیحی است. پس هر کس این علم را بداند، می‌داند کجا بوده و از چه کسی جدا شده و به چه کسی متصل گشته است. و در آن، علم تشبیه در معانی به واسطه مناسبات است. و در آن، علم ترتیب در توقیت است، و علم قضا و قدر به آن تعلق دارد. و در آن، علم ملک و تملیک است. و آیا حکم تملیک، هنگامی که واقع شود، حکم ملک اصلی است یا حکم آن‌ها متفاوت است؟ و در آن، علم تمایز عالم ارکان از سایر افلاک است. و چرا عالم ارکان استحاله (دگرگونی) را پذیرفت، به طوری که اعیان صور آن از بین رفت، همان‌طور که صور ارکان آن با استحاله برخی به برخی دیگر به واسطه سبکی و سنگینی از بین می‌رود، در حالی که عالم افلاک چنین نیست؟ و استحاله آن‌ها تنها ظهورشان در صورتی است که در آن برای عالم ارکان ظاهر می‌شوند. و چون این استحاله در صور طبیعی بود که از غیر طبیعت ظاهر شدند و در عالمی که فوق طبیعت است ظاهر نشدند، و در تجلی الهی (التجلی الإلهي) ظاهر شد و حکم او به استحاله عنصری در اعیان صور آن‌ها و در صور آن‌ها، بلکه نه در صور آن‌ها، ظاهر شد. و آیا همه این‌ها به تغییر امر در نفس خود باز می‌گردد یا در نظر بیننده است؟ و در آن، علم متقابلات است. آیا علم به آن‌ها نیازمند علم به مقابلشان است یا هر یک در علم به خود، بدون علم به مقابل، منفرد است و توقفی بر آن ندارد؟ و این جز نزد کسی که عین را واحد نمی‌بیند، ممکن نیست. و در آن، علم اثر طبیعت در ملأ اعلی و مکان آن است. و در آن، علم احوال ملأ اعلی است. و در آن، علم اجتماع موحدین و مشرکین در حفظ الهی است. و آیا این از باب عنایت به خلق است، هرچند نادان باشند، یا از باب اعطای حقایق است که امر جز این نباشد؟ اما نزد ما، این از باب عنایت است، با اعلام الهی به آن از طریق اشاره، نه تصریح. زیرا این از علم اسراری است که در عموم فاش نمی‌شود، اما اهل خاص خود را دارد که شایسته است عالم به آن، آن را برای اهلش آشکار کند. زیرا اگر آن را به اهلش ندهد، به دو جانب ظلم کرده است: به علم و به کسی که اهل آن است. و در آن، علم مراتب ابزارهای عامل و احکام ظاهر آن‌ها در عبارات است. و آن، علم حروف است که برای معنایی آمده‌اند. پس برخی از آن‌ها مرکب و برخی غیر مرکب هستند. و در آن، علم تقسیم ظالمان است: چه کسی از آن‌ها یاری می‌شود و چه کسی یاری نمی‌شود. و چرا ظلم در وجود خود باز می‌گردد؟ آیا وجود آن از ظلمت است یا از نور؟ و در آن، علم بودن حق (الحق) عین اشیاست، در حالی که شناخته نمی‌شود. و در آن، علم فرق بین حیات و احیا (زنده کردن) است. و اگر احیا واقع شود، به واسطه چه چیزی واقع می‌شود؟ آیا به حیات قدیم است یا حیات حادثی است که با احیا در زندگان ظاهر می‌شود؟ و در آن، علم بازگشت از چه کسی و دوستی با چه کسی و اعتماد در چه چیزی و بر چه کسی است. و در آن، علم این است که خداوند خلق را در چه چیزی آفرید؟ آیا او را در چیزی آفرید یا او را نه در چیزی آفرید؟ پس عین مخلوقات، عین شیئیت آن‌ها باشد. و در آن، علم اشتراک حق (الحق) و خلق در هستی (الوجود) است. و آیا تمام آنچه در آن مشترک هستند، اشتراکی معقول است یا صرفاً گفتاری؟ و در آن، علم نوامیس (قوانین) وضع شده در عالم است. آیا یک حضرت (حضرة) جامع آن‌ها را در بر می‌گیرد یا هر ناموسی حضرتی دارد، یا تنها دو حضرت آن‌ها را جمع می‌کند؟ به طوری که یک ناموس به حکمت و ناموس دیگر به حکم الهی نبوی نسبت داده شود، هرچند انواع آن‌ها زیاد باشد. و در آن، علم اختصاص الهی به برخی از مخلوقات است. به واسطه چه چیزی واقع شده است؟ آیا به عنایت است یا به استحقاق؟ و این علمی است که اهل الله از کشف (الکشف) آن در عموم و خصوص منع شده‌اند، زیرا علم ذوقی است که با قیاس و مَثَل زدن به دست نمی‌آید. و در آن، علم کلمه وصل و فصل است. آیا یک کلمه است یا دو کلمه؟ و در آن، علم برتری اهل کتاب‌هاست. آیا به فضل کتاب‌ها باز می‌گردد یا خیر؟ و آیا کتاب‌های نازل شده بر یکدیگر فضیلت دارند یا در آن‌ها فضلی نیست؟ زیرا خداوند در نفس قرآن، تفاضل بین سوره‌ها و آیات را قرار داده است. پس سوره‌ای را قرار داده که ده بار معادل کل قرآن است، و دیگری را که در حکم، مقام نصف آن را دارد، و دیگری را بر ثلث، و دیگری را بر ربع. و آیه‌ای که سیادت بر آیات دارد، و آیه‌ای که برای آن از آیات قرآن همان چیزی است که قلب برای نشأت انسان دارد. و قرآن به اعجاز بر غیر خود از کتاب‌ها متمایز شده است. و در آن، علم برادری (المواخاة) بین سوره‌های قرآن است. و به همین دلیل پیامبر (ص) فرمود: «سوره‌های هود و خواهرانش مرا پیر کردند.» پس بین آن‌ها برادری قرار داد. و در آن، علم تأیید هر ملت بر آنچه بر آن است و هر صاحب نحلتی بر نحله خود و آنچه از وفای حق آن بر او لازم است، می‌باشد. و در آن، علم حکم کسی است که از جماعت جدا شود. و در آن، علم برادری بین کتاب‌های نازل شده از نزد خدا و میزان‌های الهی وضع شده در عالم، با اختلاف صور معنوی و محسوس آن‌هاست. پس معنوی مانند براهین وجودی، جدلی و خطابی است. و میزان‌های محسوس، اختلاف آن‌ها با حس مشاهده می‌شود. و در آن، علم مواطن عجله از مواطن درنگ است. و در آن، علم قوت لطیف و ضعف کثیف است. و اینکه قوت از آن متصرف و ضعف از آن متصرف‌فیه است. و در آن، علم آنچه اقتضای زیادی دارد از آنچه اقتضای نقص دارد و فضل بین آن دو است. و در آن، علم تأخیر حکم حاکم از اجرای آن بر محکوم‌علیه به دلیل شبهه‌ای است که او را از آن باز می‌دارد، تا اینکه یقین کند یا گمانش غالب شود در آنچه نمی‌توان به یقین رسید. زیرا کافر در دنیا ممکن است هنگام مرگ مؤمن بازگردد. اگر حکم در مورد او قبل از مرگ به کفر عجله شود، حاکم حق حکم شبهه را در جایگاه خود نداده است. و در آن، علم آنچه از اعمال زیادی می‌پذیرد و آنچه نمی‌پذیرد و نقص نمی‌پذیرد، می‌باشد. و این در شرایع است: «هر کس کار نیکی بیاورد، پاداشی بهتر از آن دارد، و آن ده برابر آن است. و هر کس کار بدی بیاورد، جز به مانند آن جزا داده نمی‌شود» (من جاءَ بِالْحَسَنَةِ فَلَهُ خَيْرٌ مِنْها وهو عَشْرُ أَمْثالِها ومن جاءَ بِالسَّيِّئَةِ فَلا يُجْزى‏ إِلَّا مِثْلَها). و در آن، علم نفوذ کلمه است. آیا به ذات خود کلمه است یا خیر؟ و اینکه آن از کَلْم (زخم) است، و آن اثری از جراح در مجروح است. و همچنین هر کلمه‌ای اثری در شنونده دارد، کمترین آن شنیدن صورت آنچه به آن نطق شده و سخن گفته شده است، تا بالاتر از آن، از معانی که آن کلام حمل می‌کند. و در آن، علم اصل بغی (تجاوز/ستم) در عالم است. و آیا از «بَغی یَبغی» مشتق شده است، هنگامی که طلب کند؟ پس بغی که خداوند آن را مذمت کرده، طلب مقید است، زیرا از طلب، آنچه مذموم است و آنچه محمود است، وجود دارد. و درمان آن بغی چیست؟ و در آن، علم درهم پیچیدن و گشودن (الطي والنشر) حکم وقت است. و در آن، علم دلالات و آیات است. آیا این (دلالت و آیت بودن) برای خودشان است یا به واسطه وضع (قرار دادن) است؟ و در آن، علم حدوث مشیّت (اراده) است. به چه چیزی باز می‌گردد، در حالی که حوادث به حق (الحق) قائم نمی‌شوند؟ و در آن، علم نوازل (بلاها) است. آیا ابتدا نازل می‌شوند یا به عنوان جزا نازل می‌شوند؟ و در آن، علم سکون و حرکت است. و علم مواطنی که شایسته است حکم سکون و حکم حرکت در آن‌ها ظاهر شود. و در آن، علم آنچه خداوند به بندگانش در دنیا از علوم و مراتب و غیره عطا می‌کند، است. آیا آن از دنیاست یا از آخرت؟ و در آن، علم استجابت به اوامر خداست. اگر صورت آن آشکارا قائم شود، آیا به صورت خود سود می‌رساند و کجا سود می‌رساند؟ یا سود نمی‌رساند مگر اینکه روحی در آن صورت دمیده شود که به واسطه آن زنده شود، و آن صورت باطن است؟ و علم صور به طور مطلق به این علم تعلق دارد. آیا آن‌ها ظاهر و باطن دارند یا برخی از آن‌ها ظاهرند و باطنی ندارند؟ و در آن، علم این است که چه چیزی باعث می‌شود تمام حیوانات به دنبال انتقام برای خود باشند؟ آیا دفع آزار است یا جزا یا طلب انتقام، یا برخی از آن برای این و برخی برای آن است؟ و در آن، علم تحسین و تقبیح است. آیا این به ذات حسن و قبح باز می‌گردد یا به امری عارضی؟ و در آن، علم آنچه از صفات دوست داشته می‌شود و آنچه مکروه است. و در آن، علم آنچه حرج را از کسی که از او آنچه طبع مکروه می‌دارد، ظاهر شده است، برمی‌دارد. و در آن، علم اسبابی است که مانع ظهور آنچه طبع طلب می‌کند، می‌شود. و در آن، علم آنچه جز با نظر دقیق و پنهان درک نمی‌شود. و در آن، علم اقامت و انتقال در احوال است. آیا احوال منتقل می‌شوند و بنده ثابت است، یا بنده در احوال منتقل می‌شود و احوال ثابت هستند؟ و این از علوم غریبی است که موقوف بر کشف (الکشف) است. و در آن، علم آنچه از حق (الحق) انکار می‌شود و آنچه انکار نمی‌شود. و علم آنچه حق از باطل تأیید می‌کند و آنچه تأیید نمی‌کند. و باطلی که زوال می‌پذیرد از باطلی که نمی‌پذیرد، چیست؟ و در آن، علم تولید (الإنتاج) و غیر تولید، با وجود مقدمات است. و چه زمانی مقدمات تولید می‌کنند؟ و در آن، علم حجاب نشأت ظاهر است. و مسمای بشر از آن چیست؟ و آیا باطن آن مباشرت دارد، همان‌طور که ظاهرش دارد یا خیر؟ و در آن، علم حجابی است که بین خدا و بنده اوست. و در آن، علم کلام حادث و قدیم است. به چه چیزی باز می‌گردد؟ آیا متفاوت است یا حکم آن یکی است؟ و در آن، علم انوار و مراتب آن‌ها و سبحات وجه (جلال‌های وجه الهی) است. و چرا متعدد شده‌اند، در حالی که وجه واحد است و سبحات زیاد؟ و در آن، علم تمییز بین راه‌های الهی (السبل الإلهية) است. و در آن، علم مبدأ و معاد است. «و خداوند حق را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)."
  },
  "page_count": 6
}