{
  "id": 26,
  "title": {
    "ar": "الباب السادس والعشرون في معرفة أقطاب الرموز وتلويحات من أسرارهم وعلومهم في الطريق",
    "en": "Chapter Twenty-Six: Concerning the Understanding of the Poles (أقطاب) of Symbols (الرموز), and Indications from their Mysteries and their Sciences on the Path (الطريق).",
    "ur": "چھبیسواں باب: رموز (الرموز) کے اقطاب (أقطاب) کی معرفت (المعرفۃ) کے بیان میں، اور طریق (الطریق) میں ان کے اسرار (أسرار) اور علوم (علوم) سے متعلق تلویحات۔",
    "fa": "باب بیست و ششم در معرفت اقطاب رموز و اشاراتی از اسرار و علوم ایشان در طریق (سلوک)"
  },
  "content": {
    "ar": "## «الباب السادس والعشرون في معرفة أقطاب الرموز وتلويحات من أسرارهم وعلومهم في الطريق»\n\n\n> ألا إن الرموز دليل صدق *** على المعنى المغيب في الفؤاد\n\n\n> وإن العالمين له رموز *** والغاز ليدعى بالعباد\n\n\n> ولو لا اللغز كان القول كفرا *** وأدى العالمين إلى العناد\n\n\n> فهم بالرمز قد حسبوا فقالوا *** بإهراق الدماء وبالفساد\n> فكيف بنا لو أن الأمر يبدو *** بلا ستر يكون له استنادي‏\n\n\n> لقام بنا الشقاء هنا يقينا *** وعند البعث في يوم التنادي‏\n\n\n> ولكن الغفور أقام سترا *** ليسعدنا على رغم الأعادي‏\n\n\n### [الرمز والألغاز]\n\n\nاعلم أيها الولي الحميم أيدك الله بروح القدس وفهمك إن الرموز والألغاز ليست مرادة لأنفسها وإنما هي مرادة لما رمزت له ولما ألغز فيها ومواضعها من القرآن آيات الاعتبار كلها والتنبيه على ذلك قوله تعالى وتِلْكَ الْأَمْثالُ نَضْرِبُها لِلنَّاسِ فالأمثال ما جاءت مطلوبة لأنفسها وإنما جاءت ليعلم منها ما ضربت له وما نصبت من أجله مثلا مثل قوله تعالى أَنْزَلَ من السَّماءِ ماءً فَسالَتْ أَوْدِيَةٌ بِقَدَرِها فَاحْتَمَلَ السَّيْلُ زَبَداً رابِياً ومِمَّا يُوقِدُونَ عَلَيْهِ في النَّارِ ابْتِغاءَ حِلْيَةٍ أَوْ مَتاعٍ زَبَدٌ مِثْلُهُ كَذلِكَ يَضْرِبُ الله الْحَقَّ والْباطِلَ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفاءً فجعله كالباطل كما قال وزَهَقَ الْباطِلُ ثم قال وأَمَّا ما يَنْفَعُ النَّاسَ فَيَمْكُثُ في الْأَرْضِ ضربه مثلا للحق كَذلِكَ يَضْرِبُ الله الْأَمْثالَ وقال فَاعْتَبِرُوا يا أُولِي الْأَبْصارِ أي تعجبوا وجوزوا واعبروا إلى ما أردته بهذا التعريف وإِنَّ في ذلِكَ لَعِبْرَةً لِأُولِي الْأَبْصارِ من عبرت الوادي إذا جزته وكذلك الإشارة والإيماء قال تعالى لنبيه زكريا أَلَّا تُكَلِّمَ النَّاسَ ثَلاثَةَ أَيَّامٍ إِلَّا رَمْزاً أي بالإشارة وكذلك فَأَشارَتْ إِلَيْهِ في قصة مريم لما نذرت للرحمن أن تمسك عن الكلام ولهذا العلم رجال كبير قدرهم من أسرارهم سر الأزل والأبد والحال والخيال والرؤيا والبرازخ وأمثال هذه من النسب الإلهية ومن علومهم خواص العلم بالحروف والأسماء والخواص المركبة والمفردة من كل شي‏ء من العالم الطبيعي وهي الطبيعة المجهولة\n\n\n### [الأزل، أو أولية الحق وأولية العالم‏]\n\n\nفأما علم سر الأزل فاعلم إن الأزل عبارة عن نفي الأولية لمن يوصف به وهو وصف لله تعالى من كونه إلها وإذا انتفت الأولية عنه تعالى من كونه إلها فهو المسمى بكل اسم سمي به نفسه أزلا من كونه متكلما فهو العالم الحي المريد القادر السميع البصير المتكلم الخالق البارئ المصور الملك لم يزل مسمى بهذه الأسماء وانتفت عنه أولية التقييد فسمع المسموع وأبصر المبصر إلى غير ذلك وأعيان المسموعات منا والمبصرات معدومة غير موجودة وهو يراها أزلا كما يعلمها أزلا ويميزها ويفصلها أزلا ولا عين لها في الوجود النفسي العيني بل هي أعيان ثابتة في رتبة الإمكان فالإمكانية لها أزلا كما هي لها حالا وأبدا لم تكن قط واجبة لنفسها ثم عادت ممكنة ولا محالا ثم عادت ممكنة بل كان الوجوب الوجودي الذاتي لله تعالى أزلا كذلك وجوب الإمكان للعالم أزلا فالله في مرتبته بأسمائه الحسنى يسمى منعوتا موصوفاتها فعين نسبة الأول له نسبة الآخر والظاهر والباطن لا يقال هو أول بنسبة كذا ولا آخر بنسبة كذا فإن الممكن مرتبط بواجب الوجود في وجوده وعدمه ارتباط افتقار إليه في وجوده فإن أوجده لم يزل في إمكانه وإن عدم لم يزل عن إمكانه فكما لم يدخل على الممكن في وجود عينه بعد أن كان معدوما صفة تزيله عن إمكانه كذلك لم يدخل على الخالق الواجب الوجود في إيجاده العالم وصف يزيله عن وجوب وجوده لنفسه فلا يعقل الحق إلا هكذا ولا يعقل الممكن لا هكذا فإن فهمت علمت معنى الحدوث ومعنى القدم فقل بعد ذلك ما شئت فأولية العالم وآخريته أمر إضافي إن كان له آخر أما في الوجود فله آخر في كل زمان فرد وانتهاء عند أرباب الكشف ووافقتهم الحسبانية على ذلك كما وافقتهم الأشاعرة على إن العرض لا يبقى زمانين فالأول من العالم بالنسبة إلى ما يخلق بعده والآخر من العالم بالنسبة إلى ما خلق قبلة وليس كذلك معقولية الاسم الله بالأول والآخر والظاهر والباطن فإن العالم يتعدد والحق واحد لا يتعدد ولا يصح أن يكون أولا لنا فإن رتبته لا تناسب رتبتنا ولا تقبل رتبتنا أوليته ولو قبلت رتبتنا أوليته لاستحال علينا اسم الأولية بل كان ينطلق علينا اسم الثاني لأوليته ولسنا بثان له تعالى عن ذلك فليس هو بأول لنا فلهذا كان عين أوليته عين آخريته وهذا المدرك عزيز المنال يتعذر تصوره على من لا أنسة له بالعلوم الإلهية التي يعطيها التجلي والنظر الصحيح وإليه كان يشير أبو سعيد الخراز بقوله عرفت الله بجمعه بين الضدين ثم يتلو هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ فقد أبنت لك عن سر الأزل وإنه نعت سلبي‏\n\n\nوأما سر الأبد فهو نفي الآخرية فكما إن الممكن انتفت عنه الآخرية شرعا من حيث الجملة إذ الجنة والإقامة فيها إلى غير نهاية كذلك الأولية بالنسبة إلى ترتيب الموجودات الزمانية معقولة موجودة فالعالم بذلك الاعتبار الإلهي لا يقال فيه أول ولا آخر وبالاعتبار الثاني هو\nأول وآخر بنسبتين مختلفتين بخلاف ذلك في إطلاقها على الحق عند العلماء بالله‏\n\n\nوأما سر الحال فهو الديمومة وما لها أول ولا آخر وهو عين وجود كل موجود فقد عرفتك ببعض ما يعلمه رجال الرموز من الأسرار وسكت عن كثير فإن بابه واسع وعلم الرؤيا والبرزخ والنسب الإلهية من هذا القبيل والكلام فيها يطول‏\n\n\n### [في علم الحروف: خواصها]\n\n\nوأما علومهم في الحروف والأسماء فاعلم إن الحروف لها خواص وهي على ثلاثة أضرب منها حروف رقمية ولفظية ومستحضرة وأعني بالمستحضرة الحروف التي يستحضرها الإنسان في وهمه وخياله ويصورها فأما إن يستحضر الحروف الرقمية أو الحروف اللفظية وما ثم للحروف رتبة أخرى فيفعل بالاستحضار كما يفعل بالكتاب أو التلفظ فأما حروف التلفظ فلا تكون إلا أسماء فذلك خواص الأسماء وأما المرقومة فقد لا تكون أسماء واختلف أصحاب هذا العلم في الحرف الواحد هل يفعل أم لا فرأيت منهم من منع من ذلك جماعة ولا شك أني لما خضت معهم في مثل هذا أوقفتهم على غلطهم في ذلك الذي ذهبوا إليه وإصابتهم وما نقصهم من العبارة عن ذلك ومنهم من أثبت الفعل للحرف الواحد وهؤلاء أيضا مثل الذين منعوا مخطئون ومصيبون ورأيت منهم جماعة وأعلمتهم بموضع الغلط والإصابة فاعترفوا كما اعترف الآخرون وقلت للطائفتين جربوا ما عرفتم من ذلك على ما بيناه لكم فجربوه فوجدوا الأمر كما ذكرناه ففرحوا بذلك ولو لا أني آليت عقدا أن لا يظهر مني أثر عن حرف لأريتهم من ذلك عجبا\n\n\n### [الحروف الرقمية واللفظية والمستحضرة]\n\n\nفاعلم إن الحرف الواحد سواء كان مرقوما أو متلفظا به إذا عرى القاصد للعمل به عن استحضاره في الرقم أو في اللفظ خيالا لم يعمل وإذا كان معه الاستحضار عمل فإنه مركب من استحضار ونطق أو رقم وغاب عن الطائفتين صورة الاستحضار مع الحرف الواحد فمن اتفق له الاستحضار مع الحرف الواحد ورأى العمل غفل عن الاستحضار ونسب العمل للحرف الواحد ومن اتفق له التلفظ أو الرقم بالحرف الواحد دون استحضار فلم يعمل الحرف شيئا قال بمنع ذلك وما واحد منهم تفطن لمعنى الاستحضار وهذه حروف الأمثال المركبة كالواوين وغيرهما فلما نبهناهم على مثل هذا جربوا ذلك فوجدوه صحيحا وهو علم ممقوت عقلا وشرعا فأما الحروف اللفظية فإن لها مراتب في العمل وبعض الحروف أعم عملا من بعض وأكثر فالواو أعم الحروف عملا لأن فيها قوة الحروف كلها والهاء أقل الحروف عملا وما بين هذين الحرفين من الحروف تعمل بحسب مراتبها على ما قررناه في كتاب المبادي والغايات فيما تتضمنه حروف المعجم من العجائب والآيات‏\n\n\n### [علم الحروف هو علم الأولياء]\n\n\nوهذا العلم يسمى علم الأولياء وبه تظهر أعيان الكائنات أ لا ترى تنبيه الحق على ذلك بقوله كُنْ فَيَكُونُ فظهر الكون عن الحروف ومن هنا جعله الترمذي علم الأولياء ومن هنا منع من منع أن يعمل الحرف الواحد فإنه رأى مع الاقتدار الإلهي لم يأت في الإيجاد حرف واحد وإنما أتى بثلاثة أحرف حرف غيبي وحرفين ظاهرين إذا كان الكائن واحدا فإن زاد على واحد ظهرت ثلاثة أحرف فهذه علوم هؤلاء الرجال المذكورين في هذا الباب وعمل أكثر رجال هذا العلم لذلك جدولا وأخطئوا فيه وما صح فلا أدري أ بالقصد عملوا ذلك حتى يتركوا الناس في عماية من هذا العلم أم جهلوا ذلك وجرى فيه المتأخر على سنن المتقدم وبه قال تلميذ جعفر الصادق وغيره وهذا هو الجدول في طبائع الحروف حار بارد يابس رطب فكل حرف منها وقع في جدول الحرارة فهو حار وما وقع منها في جدول البرودة فهو بارد وكذلك اليبوسة والرطوبة ولم نر هذا الترتيب يصيب في كل عمل بل يعمل بالاتفاق كأعداد الوفق‏\n\n\n### [الحروف: خاصيتها في أشكالها لا في حروفها]\n\n\nواعلم أن هذه الحروف لم تكن لها هذه الخاصية من كونها حروفا وإنما كان لها من كونها أشكالا فلما كانت ذوات أشكال كانت الخاصية للشكل ولهذا يختلف عملها باختلاف الأقلام لأن الأشكال تختلف فأما الرقمية فأشكالها محسوسة بالبصر فإذا وجدت أعيانها وصحبتها أرواحها وحياتها الذاتية كانت الخاصية لذلك الحرف لشكله وتركيبه مع روحه وكذلك إن كان الشكل مركبا من حرفين أو ثلاثة أو أكثر كان للشكل روح آخر ليس الروح الذي كان للحرف على انفراده فإن ذلك الروح‏\nيذهب وتبقي حياة الحرف معه فإن الشكل لا يدبره سوى روح واحد وينتقل روح ذلك الحرف الواحد إلى البرزخ مع الأرواح فإن موت الشكل زواله بالمحو وهذا الشكل الآخر المركب من حرفين أو ثلاثة أو ما كان ليس هو عين الحرف الأول الذي لم يكن مركبا إن عمرا ليس هو عين زيد وإن كان مثله وأما الحروف اللفظية فإنها تتشكل في الهواء ولهذا تتصل بالسمع على صورة ما نطق بها المتكلم فإذا تشكلت في الهواء قامت بها أرواحها وهذه الحروف لا يزال الهواء يمسك عليها شكلها وإن انقضى عملها فإن عملها إنما يكون في أول ما تتشكل في الهواء ثم بعد ذلك تلتحق بسائر الأمم فيكون شغلها تسبيح ربها وتصعد علوا إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وهو عين شكل الكلمة من حيث ما هي شكل مسبح لله تعالى ولو كانت كلمة كفر فإن ذلك يعود وباله على المتكلم بها لا عليها ولهذا قال الشارع إن الرجل ليتكلم بالكلمة من سخط الله ما لا يظن أن تبلغ ما بلغت فيهوي بها في النار سبعين خريفا فجعل العقوبة للمتلفظ بها بسببها وما تعرض إليها فهذا كلام الله سبحانه يعظم ويمجد ويقدس المكتوب في المصاحف ويقرأ على جهة القربة إلى الله وفيه جميع ما قالت اليهود والنصارى في حق الله من الكفر والسب وهي كلمات كفر عاد وبالها على قائلها وبقيت الكلمات على بابها تتولى يوم القيامة عذاب أصحابها أو نعيمهم‏\n\n\n### [الحروف اللفظية والمستحضرة خالدة]\n\n\nوهذه الحروف الهوائية اللفظية لا يدركها موت بعد وجودها بخلاف الحروف الرقمية وذلك لأن شكل الحرف الرقمي والكلمة الرقمية تقبل التغيير والزوال لأنه في محل يقبل ذلك والأشكال اللفظية في محل لا يقبل ذلك ولهذا كان لها البقاء فالجو كله مملوء من كلام العالم يراه صاحب الكشف صورا قائمة وأما الحروف المستحضرة فإنها باقية إذ كان وجود أشكالها في البرزخ لا في الحس وفعلها أقوى من فعل سائر الحروف ولكن إذا استحكم سلطان استحضارها واتحد المستحضر لها ولم يبق فيه متسع لغيرها ويعلم ما هي خاصيتها حتى يستحضرها من أجل ذلك فيرى أثرها فهذا شبيه الفعل بالهمة وإن لم يعلم ما تعطيه فإنه يقع الفعل في الوجود ولا علم له به وكذلك سائر أشكال الحروف في كل مرتبة وهذا الفعل بالحرف المستحضر يعبر عنه بعض من لا علم له بالهمة وبالصدق وليس كذلك وإن كانت الهمة روحا للحرف المستحضر لا عين الشكل المستحضر وهذه الحضرة تعم الحروف كلها لفظيها ورقميها\n\n\n### [خواص أشكال الحروف‏]\n\n\nفإذا علمت خواص الأشكال وقع الفعل بها علما لكاتبها أو المتلفظ بها وإن لم يعين ما هي مرتبطة به من الانفعالات لا يعلم ذلك وقد أينا من قرأ آية من القرآن وما عنده خبر فرأى أثرا غريبا حدث وكان ذا فطنة فرجع في تلاوته من قريب لينظر ذلك الأثر بأية آية يختص فجعل يقرأ وينظر فمر بالآية التي لها ذلك الأثر فرأى الفعل فتعداها فلم ير ذلك الأثر فعاود ذلك مرارا حتى تحققه فاتخذها لذلك الانفعال ورجع كلما أراد أن يرى ذلك الانفعال تلا تلك الآية فظهر له ذلك الأثر وهو علم شريف في نفسه إلا أن السلامة منه عزيزة فالأولى ترك طلبه فإنه من العلم الذي اختص الله به أولياءه على الجملة وإن كان عند بعض الناس منه قليل ولكن من غير الطريق الذي يناله الصالحون ولهذا يشقى به من هو عنده ولا يسعد فالله يجعلنا من العلماء بالله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## The Twenty-Sixth Chapter: On the Gnosis of the Poles of Symbolism (أقطاب الرموز) and Allusions to their Secrets and Sciences on the Path\n\nA symbol is a true guide\nTo the hidden meaning in the heart.\n\nIndeed, the worlds are symbols for Him,\nAnd riddles to be called by the servants.\n\nWere it not for the enigma, the saying would be disbelief,\nAnd would lead the worlds to obstinacy.\n\nThey calculated by the symbol, and thus they spoke\nOf the shedding of blood and corruption.\nSo how would it be for us if the matter appeared\nWithout a veil upon which it could rely?\n\nMisery would surely arise among us here,\nAnd at the Resurrection on the Day of Calling.\n\nBut the Forgiving One established a veil\nTo grant us felicity despite the enemies.\n\n### [Symbolism and Riddles]\n\nKnow, O intimate friend (الولي الحميم), may Allah support you with the Holy Spirit and grant you understanding, that symbols (الرموز) and riddles (الألغاز) are not desired for themselves. Rather, they are desired for that which they symbolize and for that which is enigmatically contained within them. Their places in the Qur’an are all the verses of consideration (آيات الاعتبار). The notification of this is His saying, the Exalted: <<وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ>> (And these are the parables We set forth for mankind). Parables are not sought for their own sake; they are brought forth so that what they are struck for and what they are established for as an example may be known from them.\n\nAn example of this is His saying, the Exalted: <<أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَابِيًا وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِثْلُهُ كَذَلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً>> (He sends down water from the sky, and valleys flow according to their measure, and the torrent carries a swelling foam. And from that which they heat in the fire, desiring ornament or utility, there is a foam like it. Thus Allah strikes the Truth and the Falsehood. As for the foam, it vanishes as scum). He made the foam like falsehood, just as He said: <<وَزَهَقَ الْبَاطِلُ>> (And falsehood vanished). Then He said: <<وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ>> (But as for that which benefits mankind, it remains on the earth), striking it as a parable for the Truth. <<كَذَلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ>> (Thus Allah strikes the parables).\n\nAnd He said: <<فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ>> (So take heed, O possessors of insight)—meaning, wonder, pass over, and cross (اعبروا) to what I intended by this definition. <<إِنَّ فِي ذَلِكَ لَعِبْرَةً لِأُولِي الْأَبْصَارِ>> (Indeed, in that is a lesson for those who possess insight), derived from crossing (عبرت) the valley when you traverse it.\n\nThe same applies to indication (الإشارة) and gesture (الإيماء). The Exalted said to His Prophet Zachariah: <<أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا>> (that you shall not speak to people for three days except by symbol/gesture). Likewise, <<فَأَشَارَتْ إِلَيْهِ>> (so she pointed to him) in the story of Mary when she vowed to the All-Merciful to abstain from speech.\n\nFor this science, there are men of great stature. Among their secrets are the secret of Pre-eternity (الأزل) and Post-eternity (الأبد), the State (الحال), Imagination (الخيال), Vision (الرؤيا), and the Isthmuses (البرازخ), and similar Divine relations (النسب الإلهية). Among their sciences are the specific properties (خواص) of the knowledge of Letters (الحروف) and Names (الأسماء), and the compounded and singular properties of everything in the natural world (العالم الطبيعي), which is the Unknown Nature (الطبيعة المجهولة).\n\n### [Pre-eternity (الأزل), or the Priority of The Real and the Priority of the World]\n\nAs for the science of the secret of Pre-eternity (الأزل), know that *al-Azal* is an expression for the negation of priority (نفي الأولية) for that which is described by it. It is an Attribute of Allah, the Exalted, by virtue of His being God (إلها). If priority is negated for Him, the Exalted, by virtue of His being God, then He is eternally named by every Name with which He named Himself. By virtue of His being the Speaker, He is the Knowing, the Living, the Willing, the Powerful, the Hearing, the Seeing, the Speaking, the Creator, the Maker, the Fashioner, the King. He has been eternally named by these Names, and the priority of restriction (أولية التقييد) has been negated from Him. Thus, He heard the audible and saw the visible, and so on.\n\nThe Fixed Entities (الأعيان الثابتة) of the audible and visible things, from our perspective, are non-existent (معدومة) and not present in external, concrete Being (الوجود النفسي العيني). Yet, He sees them eternally (أزلا), just as He knows them eternally, and distinguishes and separates them eternally. They have no concrete existence in external Being; rather, they are Fixed Entities in the rank of Possibility (رتبة الإمكان). Possibility is theirs eternally, just as it is theirs presently and eternally. They were never necessarily existent in themselves and then became possible, nor were they impossible and then became possible. Rather, just as the Necessary Being (الوجوب الوجودي الذاتي) belongs to Allah eternally, so too does the necessity of Possibility (وجوب الإمكان) belong to the world eternally.\n\nAllah, in His rank, is named and described by His Beautiful Names (الأسماء الحسنى). The very relation of the First (الأول) to Him is the relation of the Last (الآخر), the Manifest (الظاهر), and the Hidden (الباطن). It cannot be said that He is the First by one relation and the Last by another. For the possible thing is linked to the Necessary Being (واجب الوجود) in its existence and non-existence—a link of dependence upon Him for its existence. If He brings it into existence, it remains in its possibility; and if it is non-existent, it does not cease from its possibility. Just as no attribute entered the possible thing, after it was non-existent, upon its coming into concrete existence that would remove it from its possibility, likewise, no attribute entered the Creator, the Necessary Being, upon His bringing the world into existence, that would remove Him from the necessity of His Being for Himself.\n\nThe Real (الحق) cannot be conceived except in this way, and the possible cannot be conceived except in this way. If you understand this, you will know the meaning of temporal origination (الحدوث) and the meaning of Pre-eternity (القدم). Then say what you wish.\n\nThe priority (أولية) and posteriority (آخريته) of the world are relative matters, if indeed it has a posteriority. As for existence, it has a posteriority in every single moment, and an end according to the people of Unveiling (الكشف). The people of calculation (الحسبانية) agreed with them on this, just as the Ash'arites agreed with them that the accident (العرض) does not remain for two moments.\n\nThe First of the world is relative to what is created after it, and the Last of the world is relative to what was created before it. This is not the case with the conceptual meaning of the Name Allah as the First, the Last, the Manifest, and the Hidden. For the world multiplies, while The Real (الحق) is One and does not multiply. It is not correct for Him to be the First *for us*, for His rank does not correspond to our rank, nor does our rank accept His priority. If our rank accepted His priority, the name of priority would be impossible for us; rather, the name of the Second would apply to us due to His priority. But we are not a second to Him—He is exalted above that. Thus, He is not the First *for us*. For this reason, the very Essence of His priority is the very Essence of His posteriority.\n\nThis realization is difficult to attain (عزيز المنال); its conception is impossible for one who has no familiarity with the Divine Sciences granted by Theophany (التجلي) and sound contemplation. It is to this that Abu Sa'id al-Kharraz was alluding when he said, \"I knew Allah by His combining of the two opposites,\" and then recited: <<هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ>> (He is the First and the Last, the Manifest and the Hidden). I have thus clarified for you the secret of Pre-eternity, and that it is a negative attribute (نعت سلبي).\n\nAs for the secret of Post-eternity (الأبد), it is the negation of posteriority (نفي الآخرية). Just as posteriority is negated from the possible thing legally (شرعا) in terms of the whole—since Paradise and residence therein are without end—likewise, priority is conceptually present and existent with respect to the arrangement of temporal existents. By that Divine consideration, the world is not called First or Last. By the second consideration, it is First and Last by two different relations, contrary to the application of these terms to The Real (الحق) among the Gnostics of Allah.\n\nAs for the secret of the State (الحال), it is perpetuity (الديمومة), which has neither beginning nor end. It is the very Essence of the existence of every existent thing. I have thus informed you of some of the secrets known by the men of symbolism, and have remained silent about much, for its door is vast. The science of Vision (الرؤيا), the Isthmus (البرزخ), and the Divine relations are of this category, and speaking about them would be lengthy.\n\n### [On the Science of Letters: Their Properties]\n\nAs for their sciences concerning Letters (الحروف) and Names (الأسماء), know that Letters have specific properties (خواص). They are of three types: numerical (حروف رقمية), verbal (لفظية), and mentally present (مستحضرة). By \"mentally present,\" I mean the letters that a person brings into his imagination (وهم) and fantasy (خيال) and forms their image. Whether he brings forth the numerical letters or the verbal letters, there is no other rank for letters. Thus, the action performed by mental presence is the same as that performed by writing or utterance.\n\nAs for uttered letters, they are only Names, and thus their properties are the properties of the Names. As for the numerical letters, they may not be Names. The practitioners of this science differed as to whether a single letter (الحرف الواحد) has efficacy or not. I saw a group among them who denied this. There is no doubt that when I engaged with them on such matters, I pointed out their error in what they maintained, as well as their correctness, and what they lacked in expressing it.\n\nAmong them were those who affirmed the efficacy of the single letter. These, too, like those who denied it, were both mistaken and correct. I saw a group of them and informed them of the point of error and correctness, and they confessed, just as the others confessed. I told both groups, \"Test what you have learned about this according to what we have explained to you.\" They tested it and found the matter to be as we mentioned, and they rejoiced in that. Were it not that I have taken a solemn vow not to reveal any effect concerning a letter, I would show them wonders concerning this.\n\n### [Numerical, Verbal, and Mentally Present Letters]\n\nKnow that a single letter, whether written or uttered, will not act if the practitioner intending to work with it is devoid of mentally presenting it (استحضاره) in imagination, whether in its written or verbal form. If the mental presence accompanies it, it acts. This is because the action is compounded of mental presence and utterance, or mental presence and writing. The image of mental presence accompanying the single letter escaped both groups.\n\nWhoever happened to have mental presence with the single letter and saw the action occur, neglected the mental presence and attributed the action to the single letter alone. And whoever happened to utter or write the single letter without mental presence, and the letter did nothing, spoke of its prohibition. Not one of them realized the meaning of mental presence (الاستحضار). This applies to the letters of compounded parables, such as the two *Wāw*s and others. When we alerted them to this, they tested it and found it to be correct.\n\nThis is a science detested rationally and legally.\n\nAs for the verbal letters, they have ranks in efficacy, and some letters are more general and extensive in action than others. The *Wāw* (و) is the most general of letters in action because it contains the power of all the letters. The *Hā’* (ه) is the least in action. The letters between these two act according to their ranks, as we established in the book *Al-Mabādī wa-l-Ghāyāt fīmā Tataḍammanuhu Ḥurūf al-Mu‘jam min al-‘Ajā’ib wa-l-Āyāt* (The Book of Beginnings and Ends concerning the Wonders and Signs contained in the Letters of the Alphabet).\n\n### [The Science of Letters is the Science of the Saints]\n\nThis science is called the Science of the Saints (علم الأولياء). Through it, the essences of created things (أعيان الكائنات) appear. Do you not see the notification of The Real (الحق) concerning this in His saying: <<كُنْ فَيَكُونُ>> (Be! and it is)? Thus, existence (الكون) appeared from the letters. From this, Al-Tirmidhi made it the science of the saints.\n\nFrom this perspective, those who prohibited the action of a single letter did so because they saw that, with Divine Power, creation did not occur through a single letter, but rather through three letters—one hidden and two manifest—if the existent thing is singular. If it is more than one, three letters appear.\n\nThese are the sciences of the men mentioned in this chapter. Most practitioners of this science created a table (جدول) for this and erred in it, and it was not corrected. I do not know whether they did this intentionally to leave people in blindness concerning this science, or whether they were ignorant of it, and the later practitioners followed the path of the earlier ones. This was the view of the student of Ja‘far al-Sadiq and others.\n\nThis table concerns the natures of the letters: hot, cold, dry, wet. Every letter that falls into the table of heat is hot, and what falls into the table of cold is cold, and likewise for dryness and wetness. We have not seen this arrangement succeed in every operation; rather, it works by coincidence (بالاتفاق), like the numbers in a magic square (أعداد الوفق).\n\n### [Letters: Their Property is in their Shapes, not their Letters]\n\nKnow that these letters do not possess this property by virtue of being letters; rather, they possess it by virtue of being shapes (أشكال). Since they are entities possessing shapes, the property belongs to the shape. This is why their efficacy differs according to the difference in scripts (الأقلام), because the shapes differ.\n\nAs for the numerical letters (الرقمية), their shapes are perceptible to the eye. When their essences (أعيانها) are found, accompanied by their spirits (أرواحها) and intrinsic life, the property belongs to that letter due to its shape and its composition with its spirit. Likewise, if the shape is compounded of two, three, or more letters, it has another spirit, which is not the spirit that the letter had individually. For that spirit departs, but the life of the letter remains with it. The shape is governed by only one spirit. The spirit of that single letter transfers to the Isthmus (البرزخ) with the other spirits, for the death of the shape is its disappearance through erasure. This other shape, compounded of two or three letters or more, is not the essence of the first, uncompounded letter. For example, ‘Amr is not the essence of Zayd, even if he is like him.\n\nAs for the verbal letters (اللفظية), they take shape in the air. This is why they reach the hearing in the form in which the speaker uttered them. When they take shape in the air, their spirits arise in them. The air continues to hold their shape even after their action ceases. Their action occurs only at the moment they first take shape in the air. After that, they join the rest of the communities, and their occupation becomes the glorification of their Lord, ascending high: <<إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ>> (To Him ascends the good word). This is the very shape of the word, insofar as it is a shape glorifying Allah, even if it were a word of disbelief (كفر). The harm of that returns to the speaker, not to the word itself. For this reason, the Lawgiver said that a man may speak a word of Allah’s wrath, not thinking it would reach what it reached, and he falls into the Fire for seventy years because of it. Thus, the punishment is for the one who uttered it, due to it, and the word itself is not exposed to harm. This is why the Word of Allah, the Exalted, written in the Qur’anic manuscripts, is magnified, glorified, and sanctified, and is recited as an act of proximity to Allah, even though it contains all the disbelief and abuse that the Jews and Christians spoke concerning Allah. These are words of disbelief whose harm returned to their speaker, while the words themselves remained in their place, taking charge of the punishment or bliss of their companions on the Day of Resurrection.\n\n### [Verbal and Mentally Present Letters are Eternal]\n\nThese airborne verbal letters do not undergo death after their existence, unlike the numerical letters. This is because the shape of the numerical letter and the numerical word accepts change and disappearance, as it is in a medium that accepts that. The verbal shapes are in a medium that does not accept that, and this is why they have permanence. The entire atmosphere (الجو) is full of the speech of the world, which the possessor of Unveiling (صاحب الكشف) sees as standing forms.\n\nAs for the mentally present letters (المستحضرة), they are permanent because the existence of their shapes is in the Isthmus (البرزخ), not in the sensory realm. Their action is stronger than the action of all other letters, but only if the dominion of their mental presence is firmly established and the one who presents them is unified, leaving no room for anything else within him. He must know what their specific property is, so that he mentally presents them for that purpose, and thus sees their effect. This action is similar to the action performed by Spiritual Resolve (الهمة), even if he does not know what it grants, for the action occurs in existence without his knowledge of it. The same applies to all shapes of letters in every rank.\n\nThis action performed by the mentally present letter is described by some who lack knowledge as Spiritual Resolve (الهمة) or Truthfulness (الصدق). This is not the case, even though Spiritual Resolve is the spirit of the mentally present letter, not the essence of the mentally present shape itself. This Presence (الحضرة) encompasses all letters, both verbal and numerical.\n\n### [Properties of the Shapes of Letters]\n\nIf you know the properties of the shapes, the action occurs through them, whether the practitioner is writing or uttering them. If he does not specify the particular reactions (الانفعالات) to which they are linked, he will not know it. We have seen someone who recited a verse from the Qur’an without having any prior knowledge, and he saw a strange effect occur. Being a man of insight, he returned to his recitation shortly after to see which verse that effect was specific to. He began to read and observe, and when he passed the verse that had that effect, he saw the action. He passed beyond it and did not see that effect. He repeated this several times until he verified it, and he adopted it for that reaction. Whenever he wished to see that reaction, he recited that verse, and the effect appeared to him.\n\nThis is a noble science in itself, but safety from it is rare. It is better to abandon seeking it, for it is part of the knowledge that Allah has reserved for His saints (أولياءه) generally, even if some people possess a little of it, but not through the path by which the righteous attain it. For this reason, whoever possesses it is miserable and not felicitous. May Allah make us among those who have Gnosis of Allah. And Allah speaks the Truth, and He guides to the Way. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>>",
    "ur": "باب چھبیسواں: رموز کے اقطاب کی معرفت، اور ان کے اسرار و علومِ طریق کی طرف اشارات کے بیان میں۔\n\nخبردار! بے شک رموز (الرموز) دل میں پوشیدہ معنی کی سچائی کی دلیل ہیں۔\nاور بے شک تمام جہان اس کے لیے رموز ہیں، اور معمے (الألغاز) بندوں کے ذریعے پکارے جاتے ہیں۔\nاگر معمہ (اللغز) نہ ہوتا تو یہ بات کفر بن جاتی، اور تمام جہانوں کو سرکشی کی طرف لے جاتی۔\nپس انہوں نے رمز (الرمز) کے ذریعے ہی حساب لگایا اور خون بہانے اور فساد کی بات کی۔\nتو ہمارا کیا ہوتا اگر معاملہ بغیر کسی پردے کے ظاہر ہو جاتا جس پر اس کا انحصار ہوتا؟\nیقیناً یہاں ہم پر بدبختی غالب آ جاتی، اور قیامت کے دن (یوم التنادی) بھی۔\nلیکن غفور (بخشنے والے) نے ایک پردہ قائم کر دیا تاکہ دشمنوں کی مرضی کے خلاف ہمیں سعادت بخشے۔\n\n### [الغاز اور معمے]\n\nاے قریبی ولی (الولي الحميم)! اللہ تعالیٰ روح القدس (روح القدس) کے ذریعے تمہاری تائید فرمائے اور تمہیں سمجھ عطا کرے، جان لو کہ رموز (الرموز) اور معمے (الألغاز) بذاتِ خود مطلوب نہیں ہیں، بلکہ وہ اس چیز کے لیے مطلوب ہیں جس کی طرف انہوں نے رمز کیا ہے اور جس کے لیے وہ معمہ بنے ہیں۔ اور ان کے مقامات قرآن میں تمام آیاتِ اعتبار (غور و فکر کی آیات) ہیں۔ اور اس پر تنبیہ اللہ تعالیٰ کا یہ فرمان ہے: \"اور یہ مثالیں ہیں جنہیں ہم لوگوں کے لیے بیان کرتے ہیں\" (وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ)۔ پس مثالیں بذاتِ خود مطلوب ہو کر نہیں آئیں، بلکہ وہ اس لیے آئیں تاکہ ان سے وہ چیز معلوم ہو جائے جس کے لیے وہ بیان کی گئیں اور جس کے لیے وہ مثال کے طور پر قائم کی گئیں۔\n\nجیسے اللہ تعالیٰ کا یہ فرمان: \"اس نے آسمان سے پانی نازل کیا، تو وادیاں اپنی گنجائش کے مطابق بہہ نکلیں، پھر سیلاب نے اوپر اٹھا ہوا جھاگ اٹھا لیا۔ اور جس چیز کو وہ زیور یا سامان بنانے کے لیے آگ پر تپاتے ہیں، اس میں بھی اسی طرح کا جھاگ ہوتا ہے۔ اسی طرح اللہ حق اور باطل کی مثال بیان کرتا ہے۔ پس جو جھاگ ہے وہ تو سوکھ کر زائل ہو جاتا ہے\" (أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَابِيًا وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِثْلُهُ كَذَلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً)۔ پس اس (جھاگ) کو باطل کی مانند قرار دیا، جیسا کہ فرمایا: \"اور باطل مٹ گیا\" (وَزَهَقَ الْبَاطِلُ)۔ پھر فرمایا: \"اور جو چیز لوگوں کو نفع دیتی ہے وہ زمین میں ٹھہر جاتی ہے\" (وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ)۔ اسے حق کی مثال کے طور پر بیان کیا، \"اسی طرح اللہ مثالیں بیان کرتا ہے\" (كَذَلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ)۔\n\nاور فرمایا: \"پس اے آنکھوں والو! عبرت حاصل کرو\" (فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ)۔ یعنی تعجب کرو، اجازت دو، اور اس تعریف کے ذریعے میری مراد تک عبور کر جاؤ۔ \"بے شک اس میں آنکھوں والوں کے لیے عبرت ہے\" (وَإِنَّ فِي ذَلِكَ لَعِبْرَةً لِأُولِي الْأَبْصَارِ)۔ یہ 'عبور کرنے' سے ہے، جیسے تم نے وادی کو پار کر لیا۔\n\nاور اسی طرح اشارہ (الإشارة) اور ایما (الإيماء) بھی ہے۔ اللہ تعالیٰ نے اپنے نبی زکریا علیہ السلام سے فرمایا: \"کہ تم تین دن تک لوگوں سے بات نہ کرو مگر اشارے سے\" (أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا)۔ یعنی اشارے کے ذریعے۔ اور اسی طرح مریم علیہا السلام کے قصے میں ہے جب انہوں نے رحمن کے لیے خاموشی کا روزہ رکھا تھا: \"تو انہوں نے اس کی طرف اشارہ کیا\" (فَأَشَارَتْ إِلَيْهِ)۔\n\nاور اس علم کے ایسے مردانِ کار ہیں جن کا مرتبہ بہت بلند ہے۔ ان کے اسرار میں سے ازل (الأزل) اور ابد (الأبد)، حال (الحال)، خیال (الخيال)، رؤیا (الرؤیا) اور برازخ (البرزخ) کا راز ہے، اور اسی طرح کے دیگر نسبِ الٰہیہ (النسب الإلهية) ہیں۔ اور ان کے علوم میں سے علم الحروف (علم الحروف) اور اسماء کی خواص، اور عالمِ طبیعی (العالم الطبيعي) کی ہر چیز کی مرکب اور مفرد خواص کا علم ہے، جو کہ نامعلوم طبیعت (الطبيعة المجهولة) ہے۔\n\n### [ازل، یا ذات حق کی اولیت اور عالم کی اولیت]\n\nجہاں تک ازل (الأزل) کے راز کے علم کا تعلق ہے، تو جان لو کہ ازل اس ہستی کے لیے اولیت کی نفی کا نام ہے جس کے ساتھ اس کی صفت بیان کی جاتی ہے۔ اور یہ اللہ تعالیٰ کی صفت ہے اس حیثیت سے کہ وہ الٰہ ہے۔ اور جب اس سے الٰہ ہونے کی حیثیت سے اولیت کی نفی ہو جاتی ہے، تو وہ ہر اس نام سے موسوم ہوتا ہے جو اس نے ازل میں اپنے لیے رکھا۔ متکلم ہونے کی حیثیت سے وہ عالم، حی، مرید، قادر، سمیع، بصیر، متکلم، خالق، بارئ، مصور، ملک ہے۔ وہ ہمیشہ سے ان اسماء سے موسوم ہے اور اس سے تقیید (حد بندی) کی اولیت کی نفی ہو چکی ہے۔\n\nپس اس نے مسموع (سنی جانے والی چیزوں) کو سنا اور مبصر (دیکھی جانے والی چیزوں) کو دیکھا، وغیرہ۔ اور ہماری طرف سے مسموعات اور مبصرات کے اعیان (حقیقتیں) معدوم اور غیر موجود ہیں، لیکن وہ انہیں ازل سے دیکھتا ہے، جیسا کہ وہ انہیں ازل سے جانتا ہے، اور ازل سے ان میں تمیز کرتا ہے اور انہیں تفصیل سے بیان کرتا ہے۔ ان کا وجودِ نفسیِ عینی (ذاتی خارجی وجود) نہیں ہے، بلکہ وہ امکان (الإمكان) کے مرتبے میں ثابت اعیان (أعيان ثابتة) ہیں۔\n\nپس ان کے لیے امکانیت (الإمكانية) ازل سے ہے، جیسا کہ وہ حال اور ابد میں ان کے لیے ہے۔ وہ کبھی بھی بذاتِ خود واجب (ضروری الوجود) نہیں تھیں کہ پھر ممکن ہو گئیں، اور نہ ہی محال تھیں کہ پھر ممکن ہو گئیں۔ بلکہ اللہ تعالیٰ کے لیے وجوبِ وجودیِ ذاتی (الوجوب الوجودي الذاتي) ازل سے تھا، اسی طرح عالم کے لیے وجوبِ امکان (وجوب الإمكان) ازل سے ہے۔\n\nپس اللہ اپنے مرتبے میں اپنے اسماء الحسنیٰ کے ساتھ موسوم ہے، جن کی صفات بیان کی جاتی ہیں۔ لہٰذا اس کے لیے اول (الأول) کی نسبت عین وہی ہے جو آخر (الآخر)، ظاہر (الظاہر) اور باطن (الباطن) کی نسبت ہے۔ یہ نہیں کہا جا سکتا کہ وہ فلاں نسبت سے اول ہے اور فلاں نسبت سے آخر ہے۔\n\nکیونکہ ممکن (الممكن) اپنے وجود اور عدم میں واجب الوجود (واجب الوجود) سے وابستہ ہے، یہ وابستگی وجود میں اس کی محتاجی کی ہے۔ اگر وہ اسے وجود بخشتا ہے تو وہ اپنے امکان میں رہتا ہے، اور اگر وہ معدوم ہو جاتا ہے تب بھی وہ اپنے امکان سے زائل نہیں ہوتا۔\n\nپس جس طرح ممکن پر اس کے عین کے وجود میں آنے کے بعد، جب کہ وہ معدوم تھا، کوئی ایسی صفت داخل نہیں ہوئی جو اسے اس کے امکان سے ہٹا دے، اسی طرح خالق واجب الوجود پر عالم کو وجود بخشنے میں کوئی ایسی صفت داخل نہیں ہوئی جو اسے اس کے ذاتی وجوبِ وجود سے ہٹا دے۔ ذات حق (الحق) کا تصور اسی طرح کیا جا سکتا ہے، اور ممکن کا تصور بھی اسی طرح کیا جا سکتا ہے۔ اگر تم یہ سمجھ گئے تو تم حدوث (پیدا ہونے) اور قدم (قدیم ہونے) کا معنی جان لو گے، پھر اس کے بعد جو چاہو کہو۔\n\nپس عالم کی اولیت اور آخریت ایک اضافی (نسبتی) معاملہ ہے، اگر اس کا کوئی آخر ہو۔ جہاں تک وجود کا تعلق ہے، تو ہر فردِ زمانہ میں اس کا ایک آخر ہے، اور اربابِ کشف (أرباب الکشف) کے نزدیک اس کا اختتام ہے۔ حسبانیہ (الحسبانية) نے اس پر ان کی موافقت کی ہے، جیسا کہ اشاعرہ (الأشاعرة) نے اس بات پر موافقت کی ہے کہ عرض (عارضی صفت) دو زمانوں تک باقی نہیں رہتی۔\n\nپس عالم کا اول وہ ہے جو اس کے بعد پیدا ہونے والی چیز کے مقابلے میں ہے، اور عالم کا آخر وہ ہے جو اس سے پہلے پیدا ہوا تھا۔ لیکن اللہ کے نام (الأول، الآخر، الظاہر، الباطن) کی معقولیت ایسی نہیں ہے، کیونکہ عالم متعدد ہے اور ذات حق (الحق) واحد ہے، جو متعدد نہیں ہوتی۔\n\nاور یہ درست نہیں کہ وہ ہمارے لیے اول ہو، کیونکہ اس کا مرتبہ ہمارے مرتبے کے مناسب نہیں ہے، اور نہ ہی ہمارا مرتبہ اس کی اولیت کو قبول کرتا ہے۔ اگر ہمارا مرتبہ اس کی اولیت کو قبول کر لیتا تو ہم پر اولیت کا نام محال ہو جاتا، بلکہ اس کی اولیت کی وجہ سے ہم پر ثانی (دوسرے) کا نام لاگو ہوتا، اور ہم اس کے ثانی نہیں ہیں، وہ اس سے بہت بلند ہے۔ لہٰذا وہ ہمارے لیے اول نہیں ہے۔ اسی لیے اس کی اولیت کا عین اس کی آخریت کا عین ہے۔\n\nاور یہ ادراک (مدرک) بہت مشکل سے حاصل ہوتا ہے، اس کا تصور اس شخص کے لیے دشوار ہے جسے علومِ الٰہیہ (العلوم الإلهية) سے کوئی انسیت نہ ہو جو التجلی (ظہور الٰہی) اور صحیح نظر سے حاصل ہوتے ہیں۔ اسی کی طرف ابو سعید الخراز اشارہ کرتے تھے جب انہوں نے کہا: \"میں نے اللہ کو دو متضاد چیزوں کو جمع کرنے سے پہچانا۔\" پھر وہ یہ آیت پڑھتے: \"وہی اول ہے اور آخر ہے اور ظاہر ہے اور باطن ہے\" (هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ)۔ پس میں نے تمہارے سامنے ازل (الأزل) کے راز کو واضح کر دیا ہے، اور یہ ایک سلبی صفت (نعت سلبی) ہے۔\n\nاور جہاں تک ابد (الأبد) کے راز کا تعلق ہے، تو وہ آخریت (آخر ہونے) کی نفی ہے۔ جس طرح ممکن (الممكن) سے مجموعی طور پر شرعاً آخریت کی نفی کر دی گئی ہے، کیونکہ جنت اور اس میں قیام لامتناہی ہے، اسی طرح زمانی موجودات کی ترتیب کے لحاظ سے اولیت معقول اور موجود ہے۔ پس اس الٰہی اعتبار سے عالم کے بارے میں نہ اول کہا جاتا ہے اور نہ آخر۔ اور دوسرے اعتبار سے وہ دو مختلف نسبتوں سے اول اور آخر ہے، بخلاف اس کے جو اللہ کے عالموں کے نزدیک ذات حق (الحق) پر ان (صفات) کا اطلاق ہے۔\n\nاور جہاں تک حال (الحال) کے راز کا تعلق ہے، تو وہ دوام (دائمی ہونا) ہے جس کی نہ کوئی ابتدا ہے اور نہ کوئی انتہا، اور یہ ہر موجود کے وجود کا عین ہے۔ پس میں نے تمہیں ان اسرار میں سے کچھ سے آگاہ کر دیا ہے جو رجالِ رموز (رموز کے مردانِ کار) جانتے ہیں، اور میں نے بہت سے اسرار سے خاموشی اختیار کی ہے، کیونکہ اس کا دروازہ وسیع ہے۔ اور علمِ رؤیا، برزخ (البرزخ) اور نسبِ الٰہیہ (النسب الإلهية) اسی قبیل سے ہیں، اور ان پر کلام طویل ہو جائے گا۔\n\n### [علم الحروف میں: ان کی خواص]\n\nاور جہاں تک ان کے علوم کا حروف (الحروف) اور اسماء (الأسماء) میں تعلق ہے، تو جان لو کہ حروف کی خواص ہیں، اور وہ تین قسم کے ہیں: ان میں رقمی حروف (حروف رقمية)، لفظی حروف (حروف لفظية)، اور مستحضر حروف (حروف مستحضرة) ہیں۔ مستحضر حروف سے میری مراد وہ حروف ہیں جنہیں انسان اپنے وہم (وہم) اور خیال (خیال) میں حاضر کرتا ہے اور ان کی صورت بناتا ہے۔\n\nخواہ وہ رقمی حروف کو حاضر کرے یا لفظی حروف کو، حروف کے لیے کوئی دوسرا مرتبہ نہیں ہے۔ پس وہ استحضار (استحضار) کے ذریعے عمل کرتا ہے جیسا کہ لکھنے یا تلفظ کرنے سے عمل ہوتا ہے۔ جہاں تک تلفظ کے حروف کا تعلق ہے، وہ صرف اسماء ہی ہوتے ہیں، لہٰذا یہ اسماء کی خواص ہیں۔ اور جو حروف لکھے جاتے ہیں، وہ بعض اوقات اسماء نہیں ہوتے۔\n\nاور اس علم کے ماہرین میں اس بات پر اختلاف ہے کہ کیا ایک حرف عمل کرتا ہے یا نہیں؟ میں نے ان میں سے ایک گروہ کو دیکھا جو اس سے منع کرتے تھے۔ اور بلاشبہ جب میں نے ان کے ساتھ اس طرح کے معاملے میں بحث کی تو میں نے انہیں ان کی غلطی اور ان کی درستگی پر آگاہ کیا، اور اس بارے میں ان کی عبارت میں جو کمی تھی وہ بھی بتائی۔ اور ان میں سے کچھ ایسے بھی تھے جنہوں نے ایک حرف کے عمل کو ثابت کیا، اور یہ لوگ بھی منع کرنے والوں کی طرح غلطی پر بھی تھے اور درست بھی۔ میں نے ان میں سے بھی ایک گروہ کو دیکھا اور انہیں غلطی اور درستگی کی جگہ سے آگاہ کیا، تو انہوں نے بھی اعتراف کیا جیسا کہ دوسروں نے کیا تھا۔\n\nاور میں نے دونوں گروہوں سے کہا کہ جو کچھ تم نے جانا ہے اسے اس طریقے پر آزماؤ جو ہم نے تمہارے لیے بیان کیا ہے۔ پس انہوں نے آزمایا اور معاملہ کو ویسا ہی پایا جیسا کہ ہم نے ذکر کیا تھا، تو وہ اس پر خوش ہوئے۔ اور اگر میں نے یہ عہد نہ کیا ہوتا کہ میری طرف سے کسی حرف کا کوئی اثر ظاہر نہ ہو، تو میں انہیں اس میں عجیب چیزیں دکھاتا۔\n\n### [رقمی، لفظی اور مستحضر حروف]\n\nپس جان لو کہ ایک حرف، خواہ وہ لکھا ہوا ہو یا تلفظ کیا گیا ہو، اگر اس سے عمل کرنے کا ارادہ رکھنے والا شخص اسے لکھنے یا تلفظ کرنے میں خیالی طور پر حاضر (استحضار) کرنے سے خالی ہو، تو وہ عمل نہیں کرتا۔ اور اگر اس کے ساتھ استحضار ہو تو وہ عمل کرتا ہے، کیونکہ یہ استحضار اور نطق (بولنے) یا رقم (لکھنے) سے مرکب ہے۔ اور دونوں گروہوں سے ایک حرف کے ساتھ استحضار کی صورت غائب رہی۔\n\nپس جس شخص کو ایک حرف کے ساتھ استحضار نصیب ہوا اور اس نے عمل دیکھا، تو وہ استحضار سے غافل ہو گیا اور عمل کو صرف ایک حرف سے منسوب کر دیا۔ اور جسے ایک حرف کا تلفظ یا رقم بغیر استحضار کے نصیب ہوا، اور حرف نے کوئی عمل نہ کیا، تو اس نے اس سے منع کر دیا۔ اور ان میں سے کسی ایک نے بھی استحضار (استحضار) کے معنی پر غور نہیں کیا۔ اور یہ مرکب مثالوں کے حروف ہیں، جیسے دو واؤ وغیرہ۔\n\nپس جب ہم نے انہیں اس طرح کی چیزوں پر متنبہ کیا تو انہوں نے اسے آزمایا اور اسے صحیح پایا۔ اور یہ ایک ایسا علم ہے جو عقلی اور شرعی طور پر ناپسندیدہ ہے۔\n\nجہاں تک لفظی حروف کا تعلق ہے، تو ان کے عمل میں مراتب ہیں، اور بعض حروف کا عمل بعض سے زیادہ عام اور وسیع ہوتا ہے۔ پس واؤ (و) حروف میں سب سے زیادہ عام عمل والا ہے، کیونکہ اس میں تمام حروف کی قوت موجود ہے۔ اور ہاء (ہ) حروف میں سب سے کم عمل والا ہے۔ اور ان دونوں حروف کے درمیان جو حروف ہیں، وہ اپنے مراتب کے مطابق عمل کرتے ہیں، جیسا کہ ہم نے کتاب *المبادی والغایات فیما تتضمنه حروف المعجم من العجائب والآیات* میں بیان کیا ہے۔\n\n### [علم الحروف اولیاء کا علم ہے]\n\nاور اس علم کو علم الاولیاء (علم الأولياء) کہا جاتا ہے۔ اور اسی کے ذریعے کائنات کے اعیان (حقیقتیں) ظاہر ہوتے ہیں۔ کیا تم نہیں دیکھتے کہ ذات حق (الحق) نے اپنے فرمان \"ہو جا، پس وہ ہو جاتا ہے\" (كُنْ فَيَكُونُ) کے ذریعے اس پر تنبیہ فرمائی؟ پس کون (ہونا) حروف سے ظاہر ہوا۔ اور اسی وجہ سے ترمذی نے اسے اولیاء (الأولياء) کا علم قرار دیا۔\n\nاور اسی وجہ سے جس نے ایک حرف کے عمل سے منع کیا، اس نے یہ دیکھا کہ اقتدارِ الٰہی (الاقتدار الإلهي) کے باوجود ایجاد میں ایک حرف نہیں آیا، بلکہ تین حروف آئے: ایک غیبی حرف اور دو ظاہری حروف، جب کہ کائن (موجود) ایک ہو۔ اگر وہ ایک سے زیادہ ہو جائے تو تین حروف ظاہر ہوتے ہیں۔\n\nپس یہ ان مردانِ کار کے علوم ہیں جن کا ذکر اس باب میں کیا گیا ہے۔ اور اس علم کے اکثر مردوں نے اس کے لیے ایک جدول بنایا اور اس میں غلطی کی، اور وہ صحیح نہیں ہے۔ میں نہیں جانتا کہ کیا انہوں نے جان بوجھ کر ایسا کیا تاکہ لوگوں کو اس علم کی تاریکی میں چھوڑ دیں، یا وہ اس سے ناواقف تھے اور بعد میں آنے والے نے پہلے والے کے طریقے پر عمل کیا۔ اور اسی بات کو جعفر صادق کے شاگرد اور دیگر نے بھی کہا ہے۔ اور یہ حروف کی طبائع (طبیعتوں) کا جدول ہے: گرم، سرد، خشک، تر۔ پس ان میں سے جو حرف حرارت کے جدول میں آیا وہ گرم ہے، اور جو برودت (سردی) کے جدول میں آیا وہ سرد ہے، اور اسی طرح خشکی اور تری۔ لیکن ہم نے نہیں دیکھا کہ یہ ترتیب ہر عمل میں درست ثابت ہو، بلکہ یہ اتفاق سے عمل کرتا ہے، جیسے وفق (جادوئی مربع) کے اعداد۔\n\n### [حروف: ان کی خاصیت ان کی شکلوں میں ہے نہ کہ ان کے حروف ہونے میں]\n\nاور جان لو کہ ان حروف میں یہ خاصیت ان کے حروف ہونے کی وجہ سے نہیں ہے، بلکہ یہ ان کے اشکال (شکلیں) ہونے کی وجہ سے ہے۔ پس جب وہ اشکال والی تھیں تو خاصیت شکل کے لیے تھی۔ اور اسی وجہ سے مختلف قلموں کے اختلاف سے ان کا عمل بھی مختلف ہو جاتا ہے، کیونکہ اشکال مختلف ہوتے ہیں۔\n\nجہاں تک رقمی حروف کا تعلق ہے، تو ان کی شکلیں بصارت سے محسوس ہوتی ہیں۔ پس جب ان کے اعیان (حقیقتیں) پائے جاتے ہیں اور ان کے ساتھ ان کی ارواح اور ان کی ذاتی حیات ہوتی ہے، تو اس حرف کی خاصیت اس کی شکل اور اس کی روح کے ساتھ اس کی ترکیب کی وجہ سے ہوتی ہے۔ اور اسی طرح اگر شکل دو یا تین یا اس سے زیادہ حروف سے مرکب ہو، تو اس شکل کے لیے ایک اور روح ہوتی ہے، جو وہ روح نہیں ہوتی جو اکیلے حرف کے لیے تھی۔ کیونکہ وہ روح چلی جاتی ہے اور حرف کی حیات اس کے ساتھ باقی رہتی ہے۔ کیونکہ شکل کو صرف ایک ہی روح تدبیر کرتی ہے۔ اور اس ایک حرف کی روح دیگر ارواح کے ساتھ برزخ (البرزخ) میں منتقل ہو جاتی ہے، کیونکہ شکل کی موت مٹ جانے سے اس کا زوال ہے۔\n\nاور یہ دوسری شکل جو دو یا تین یا جتنے بھی حروف سے مرکب ہے، وہ پہلے حرف کا عین نہیں ہے جو مرکب نہیں تھا۔ بے شک عمر، زید کا عین نہیں ہے، اگرچہ وہ اس جیسا ہی ہو۔\n\nاور جہاں تک لفظی حروف کا تعلق ہے، تو وہ ہوا میں شکل اختیار کرتے ہیں، اور اسی وجہ سے وہ سننے والے تک اسی صورت میں پہنچتے ہیں جس میں متکلم نے انہیں بولا تھا۔ پس جب وہ ہوا میں شکل اختیار کرتے ہیں تو ان کی ارواح ان کے ساتھ قائم ہو جاتی ہیں۔ اور یہ حروف ایسے ہیں کہ ہوا ان کی شکل کو تھامے رکھتی ہے، اگرچہ ان کا عمل ختم ہو جائے۔ کیونکہ ان کا عمل صرف اس وقت ہوتا ہے جب وہ پہلی بار ہوا میں شکل اختیار کرتے ہیں۔ پھر اس کے بعد وہ دوسری امتوں سے جا ملتے ہیں، اور ان کا کام اپنے رب کی تسبیح کرنا ہوتا ہے، اور وہ بلندی کی طرف چڑھتے ہیں: \"اسی کی طرف پاکیزہ کلمات چڑھتے ہیں\" (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ)۔ اور یہ کلمہ کی شکل کا عین ہے، اس حیثیت سے کہ وہ اللہ تعالیٰ کی تسبیح کرنے والی شکل ہے۔\n\nاور اگر وہ کفر کا کلمہ بھی ہو، تو اس کا وبال اس کے بولنے والے پر پڑتا ہے نہ کہ اس (کلمے) پر۔ اسی لیے شارع (نبی اکرم ﷺ) نے فرمایا: \"بے شک آدمی اللہ کی ناراضگی کا ایک ایسا کلمہ بولتا ہے جس کے بارے میں وہ گمان بھی نہیں کرتا کہ وہ کہاں تک پہنچے گا، اور وہ اس کی وجہ سے ستر سال تک جہنم میں گرتا چلا جاتا ہے۔\" پس اس نے سزا اس کلمے کی وجہ سے بولنے والے کے لیے مقرر کی، نہ کہ کلمے کے لیے۔ پس یہ اللہ سبحانہ کا کلام ہے جو مصاحف میں لکھا جاتا ہے، اس کی تعظیم کی جاتی ہے، اس کی بزرگی بیان کی جاتی ہے اور اسے اللہ کا قرب حاصل کرنے کی نیت سے پڑھا جاتا ہے، حالانکہ اس میں وہ سب کچھ موجود ہے جو یہود و نصاریٰ نے اللہ کے حق میں کفر اور گالی کے طور پر کہا ہے۔ اور وہ کلماتِ کفر ہیں جن کا وبال ان کے کہنے والے پر پڑا، اور وہ کلمات اپنی جگہ پر باقی رہے، جو قیامت کے دن اپنے بولنے والوں کے عذاب یا ان کی نعمت کی ذمہ داری لیں گے۔\n\n### [لفظی اور مستحضر حروف ہمیشہ باقی رہنے والے ہیں]\n\nاور یہ ہوائی لفظی حروف (الحروف اللفظية) وجود میں آنے کے بعد فنا نہیں ہوتے، برخلاف رقمی حروف (الحروف الرقمية) کے۔ اس کی وجہ یہ ہے کہ رقمی حرف اور رقمی کلمے کی شکل تبدیلی اور زوال کو قبول کرتی ہے، کیونکہ وہ ایسی جگہ پر ہے جو اسے قبول کرتی ہے۔ جبکہ لفظی اشکال ایسی جگہ پر ہیں جو اسے قبول نہیں کرتیں، اور اسی وجہ سے ان کے لیے بقا (البقاء) ہے۔ پس پوری فضا عالم کے کلام سے بھری ہوئی ہے، جسے صاحبِ کشف (صاحب الکشف) قائم صورتوں کی شکل میں دیکھتا ہے۔\n\nاور جہاں تک مستحضر حروف (الحروف المستحضرة) کا تعلق ہے، تو وہ باقی رہتے ہیں، کیونکہ ان کی شکلوں کا وجود برزخ (البرزخ) میں ہوتا ہے نہ کہ حس (حواس) میں۔ اور ان کا عمل دیگر حروف کے عمل سے زیادہ قوی ہوتا ہے۔ لیکن یہ تب ہوتا ہے جب ان کے استحضار (استحضار) کا غلبہ مضبوط ہو جائے، اور انہیں حاضر کرنے والا یکسو ہو جائے اور اس میں کسی اور چیز کے لیے گنجائش باقی نہ رہے، اور وہ یہ جانتا ہو کہ ان کی خاصیت کیا ہے تاکہ وہ اسی مقصد کے لیے انہیں حاضر کرے اور ان کا اثر دیکھے۔\n\nپس یہ عمل ہمت (الهمة) کے ذریعے عمل کرنے کے مشابہ ہے، اگرچہ وہ یہ نہ جانتا ہو کہ وہ کیا عطا کرتی ہے۔ کیونکہ عمل وجود میں واقع ہو جاتا ہے اور اسے اس کا علم نہیں ہوتا۔ اور اسی طرح ہر مرتبے میں حروف کی دیگر اشکال کا معاملہ ہے۔ اور مستحضر حرف کے ذریعے اس عمل کو بعض وہ لوگ جو ہمت (الهمة) اور سچائی کا علم نہیں رکھتے، ہمت سے تعبیر کرتے ہیں، حالانکہ ایسا نہیں ہے۔ اگرچہ ہمت مستحضر حرف کی روح ہے، نہ کہ مستحضر شکل کا عین۔ اور یہ حضوری (الحضرة) تمام حروف کو شامل ہے، خواہ وہ لفظی ہوں یا رقمی۔\n\n### [حروف کی شکلوں کی خواص]\n\nپس جب تم اشکال کی خواص جان لو گے، تو ان کے ذریعے عمل واقع ہو گا، جو ان کے لکھنے والے یا تلفظ کرنے والے کے لیے علم ہو گا۔ اور اگر وہ انفعالات (تاثرات) کو متعین نہ کرے جن سے وہ وابستہ ہیں، تو وہ اسے نہیں جان پائے گا۔\n\nاور ہم نے ایسے شخص کو دیکھا جس نے قرآن کی ایک آیت پڑھی، اور اسے خبر نہ تھی، تو اس نے ایک عجیب اثر دیکھا جو ظاہر ہوا۔ اور وہ ذہین تھا، تو وہ اپنی تلاوت میں پیچھے پلٹا تاکہ دیکھے کہ وہ اثر کس آیت سے مخصوص ہے۔ پس وہ پڑھتا گیا اور دیکھتا گیا، یہاں تک کہ وہ اس آیت سے گزرا جس کا وہ اثر تھا، تو اس نے عمل کو دیکھا۔ پھر وہ اس سے آگے بڑھا تو وہ اثر نظر نہ آیا۔ اس نے بار بار ایسا کیا یہاں تک کہ اسے اس کا یقین ہو گیا، اور اس نے اسے اس انفعال کے لیے اختیار کر لیا۔ اور جب بھی وہ وہ انفعال دیکھنا چاہتا، وہ اس آیت کی تلاوت کرتا تو وہ اثر اس کے لیے ظاہر ہو جاتا۔\n\nاور یہ علم بذاتِ خود ایک شریف علم ہے، مگر اس سے سلامتی مشکل سے حاصل ہوتی ہے۔ لہٰذا بہتر یہ ہے کہ اسے طلب کرنا چھوڑ دیا جائے، کیونکہ یہ ان علوم میں سے ہے جنہیں اللہ تعالیٰ نے مجموعی طور پر اپنے اولیاء (الأولياء) کے لیے خاص کر دیا ہے۔ اگرچہ بعض لوگوں کے پاس اس میں سے تھوڑا سا حصہ ہوتا ہے، لیکن اس طریقے سے نہیں جو صالحین کو حاصل ہوتا ہے۔ اور اسی وجہ سے جس کے پاس یہ ہوتا ہے وہ اس سے بدبخت ہوتا ہے، خوش بخت نہیں۔ اللہ ہمیں اللہ کے عالموں میں شامل فرمائے۔ \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "«باب بیست و ششم در شناخت اقطاب رموز و اشاراتی از اسرار و علوم آنان در راه (طریقت)»\n\nبدانید که رموز، دلیل صدقی است *** بر معنای پنهان شده در دل\n\nو همانا عالمیان برای او (حق) رموزند *** و معماها به بندگان خوانده می‌شوند\n\nو اگر معما نبود، گفتار کفر می‌شد *** و عالمیان را به عناد می‌کشاند\n\nپس آنان با رمز گمان بردند و گفتند *** به ریختن خون‌ها و به فساد\n\nپس حال ما چگونه می‌بود اگر امر آشکار می‌شد *** بدون پرده‌ای که به آن تکیه کند؟\n\nیقیناً شقاوت در اینجا بر ما برپا می‌شد *** و هنگام برانگیختن در روز ندا\n\nاما آمرزنده پرده‌ای برپا کرد *** تا ما را به رغم دشمنان سعادتمند سازد\n\n### [رمز و معماها]\n\nای ولیّ صمیمی، خداوند تو را با روح القدس تأیید کند و به تو فهم دهد، بدان که رموز و معماها (الألغاز) به خاطر خودشان مورد نظر نیستند، بلکه به خاطر آنچه به آن رمز شده و آنچه در آن معما گنجانده شده، مورد نظرند. و جایگاه‌های آن‌ها در قرآن، تمام آیات عبرت (اعتبار) است. و تنبیه بر این مطلب، سخن خداوند متعال است: **«و این مَثَل‌ها را برای مردم می‌زنیم»** (وَتِلْكَ الْأَمْثالُ نَضْرِبُها لِلنَّاسِ). پس مَثَل‌ها به خاطر خودشان نیامده‌اند، بلکه آمده‌اند تا آنچه به خاطر آن زده شده و آنچه به خاطر آن برپا گشته، از آن‌ها دانسته شود. مثلاً مانند سخن خداوند متعال: **«از آسمان آبی فرو فرستاد، پس رودخانه‌ها به اندازه خود جاری شدند و سیل، کفی بالا آمده را با خود حمل کرد. و از آنچه برای به دست آوردن زیور یا کالا در آتش بر آن می‌افروزند، کفی مانند آن است. این‌گونه خداوند حق و باطل را مَثَل می‌زند. اما کف، به صورت بی‌ارزش از بین می‌رود»** (أَنْزَلَ من السَّماءِ ماءً فَسالَتْ أَوْدِيَةٌ بِقَدَرِها فَاحْتَمَلَ السَّيْلُ زَبَداً رابِياً ومِمَّا يُوقِدُونَ عَلَيْهِ في النَّارِ ابْتِغاءَ حِلْيَةٍ أَوْ مَتاعٍ زَبَدٌ مِثْلُهُ كَذلِكَ يَضْرِبُ الله الْحَقَّ والْباطِلَ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفاءً). پس آن را مانند باطل قرار داد، چنانکه فرمود: **«و باطل نابود شد»** (وزَهَقَ الْباطِلُ). سپس فرمود: **«و اما آنچه به مردم سود می‌رساند، در زمین باقی می‌ماند»** (وأَمَّا ما يَنْفَعُ النَّاسَ فَيَمْكُثُ في الْأَرْضِ). آن را مَثَل حق زد. **«این‌گونه خداوند مَثَل‌ها را می‌زند»** (كَذلِكَ يَضْرِبُ الله الْأَمْثالَ). و فرمود: **«پس عبرت بگیرید ای صاحبان بینش‌ها»** (فَاعْتَبِرُوا يا أُولِي الْأَبْصارِ)، یعنی شگفت‌زده شوید، اجازه دهید و عبور کنید به سوی آنچه با این تعریف قصد کرده‌ام. **«و همانا در آن عبرتی است برای صاحبان بینش‌ها»** (إِنَّ في ذلِكَ لَعِبْرَةً لِأُولِي الْأَبْصارِ)، از ریشه «عبرت» (عبور) که به معنای گذشتن از وادی است. و همچنین است اشاره و ایما. خداوند متعال به پیامبرش زکریا فرمود: **«که سه روز با مردم سخن نگویی مگر با رمز»** (أَلَّا تُكَلِّمَ النَّاسَ ثَلاثَةَ أَيَّامٍ إِلَّا رَمْزاً)، یعنی با اشاره. و همچنین **«پس به او اشاره کرد»** (فَأَشارَتْ إِلَيْهِ) در داستان مریم، هنگامی که نذر کرد برای رحمان که از سخن گفتن خودداری کند. و برای این علم، مردانی هستند که قدرشان بزرگ است. از اسرار آنان، سرّ ازل و ابد، حال، خیال، رؤیا، برزخ‌ها (البرازخ) و امثال این‌ها از نسبت‌های الهی است. و از علوم آنان، خواص علم به حروف و اسماء و خواص مرکب و مفرد از هر چیزی در عالم طبیعی است، که همان طبیعت مجهول است.\n\n### [ازل، یا اولیت حق و اولیت عالم]\n\nاما علم سرّ ازل، بدان که ازل عبارت است از نفی اولیت برای کسی که به آن وصف می‌شود، و آن وصفی است برای خداوند متعال از جهت الوهیتش. و هنگامی که اولیت از او تعالی از جهت الوهیتش نفی شود، اوست که از ازل به هر اسمی که خود را نامیده، نامیده شده است. از جهت متکلم بودنش، اوست عالم، حی، مرید، قادر، سمیع، بصیر، متکلم، خالق، بارئ، مصور، ملک. او پیوسته به این اسماء نامیده شده و اولیت تقیید از او نفی شده است. پس شنیدنی را شنید و دیدنی را دید و غیره. و اعیان شنیدنی‌ها و دیدنی‌ها از جانب ما معدوم و غیر موجودند، در حالی که او آن‌ها را از ازل می‌بیند، همان‌طور که از ازل آن‌ها را می‌داند و از ازل آن‌ها را تمییز می‌دهد و تفصیل می‌بخشد، و در هستی (الوجود) نفسانی عینی، وجودی ندارند، بلکه اعیان ثابته (أعیان ثابتة) در مرتبه امکان هستند. پس امکان (الإمكانیة) از ازل برای آن‌هاست، همان‌طور که اکنون و ابداً برای آن‌هاست. هرگز واجب بالذات نبوده‌اند که سپس ممکن شوند، و نه محال بوده‌اند که سپس ممکن شوند، بلکه همان‌طور که وجوب وجودی ذاتی برای خداوند متعال از ازل بوده است، وجوب امکان برای عالم نیز از ازل بوده است. پس خداوند در مرتبه خود با اسماء حسنایش نامیده می‌شود و موصوف به اوصاف آن‌هاست. نسبت اول (الأول) بودن به او، عین نسبت آخر (الآخر) و ظاهر (الظاهر) و باطن (الباطن) بودن است. گفته نمی‌شود که او اول است به نسبت فلان، یا آخر است به نسبت فلان. زیرا ممکن (الممکن) در وجود و عدم خود به واجب الوجود (واجب الوجود) مرتبط است، ارتباطی از سر نیاز به او در وجودش. اگر او را ایجاد کند، پیوسته در امکان خود باقی است، و اگر معدوم شود، از امکان خود زایل نمی‌شود. همان‌طور که در وجود عین ممکن، پس از آنکه معدوم بود، صفتی وارد نشد که آن را از امکانش خارج سازد، همچنین در ایجاد عالم توسط خالق واجب الوجود، وصفی وارد نشد که او را از وجوب وجودش برای ذاتش خارج سازد. پس حق (الحق) جز این‌گونه تعقل نمی‌شود و ممکن جز این‌گونه تعقل نمی‌شود. اگر فهمیدی، معنای حدوث و معنای قدم را دانستی، پس بعد از آن هر چه می‌خواهی بگو. پس اولیت و آخریت عالم امری اضافی است، اگرچه آخری داشته باشد. اما در هستی (الوجود)، در هر زمان فردی، آخری دارد و نزد صاحبان کشف (الکشف) به انتها می‌رسد. و حِسبانیان (اهل حساب) در این مورد با آنان موافق‌اند، همان‌طور که اشاعره با آنان موافق‌اند که عَرَض دو زمان باقی نمی‌ماند. پس اولِ عالم نسبت به چیزی است که بعد از آن خلق می‌شود، و آخرِ عالم نسبت به چیزی است که قبل از آن خلق شده است. و معقولیت اسم «الله» به اول و آخر و ظاهر و باطن این‌گونه نیست، زیرا عالم متعدد است و حق (الحق) واحد است و متعدد نمی‌شود. و صحیح نیست که او اول برای ما باشد، زیرا مرتبه او با مرتبه ما تناسب ندارد و مرتبه ما اولیت او را نمی‌پذیرد. و اگر مرتبه ما اولیت او را می‌پذیرفت، نام اولیت بر ما محال می‌شد، بلکه نام «دومی» به خاطر اولیت او بر ما اطلاق می‌شد، در حالی که ما دومی برای او نیستیم، او از این‌ها برتر است. پس او اول برای ما نیست. به همین دلیل، عین اولیت او، عین آخریت اوست. و این ادراک، دست‌نیافتنی است و تصور آن برای کسی که با علوم الهی که تجلی (التجلی) و نظر صحیح عطا می‌کند، مأنوس نیست، دشوار است. و ابوسعید خرّاز به همین نکته اشاره می‌کرد که می‌گفت: «خداوند را با جمع کردن میان دو ضد شناختم.» سپس تلاوت می‌کرد: **«اوست اول و آخر و ظاهر و باطن»** (هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ). پس من سرّ ازل را برای تو آشکار ساختم و اینکه آن یک نعت سلبی است.\n\n### [سرّ ابد]\n\nو اما سرّ ابد، نفی آخریت است. همان‌طور که آخریت از ممکن (الممکن) از نظر شرعی به طور کلی نفی شده است، زیرا بهشت و اقامت در آن تا بی‌نهایت است، همچنین اولیت نسبت به ترتیب موجودات زمانی، معقول و موجود است. پس عالم با آن اعتبار الهی، نه اول نامیده می‌شود و نه آخر. و با اعتبار دوم، او اول و آخر است با دو نسبت متفاوت، برخلاف اطلاق این اوصاف بر حق (الحق) نزد عالمان به خدا.\n\n### [سرّ حال]\n\nو اما سرّ حال، همان دیمومت (پیوستگی) است که نه اولی دارد و نه آخری، و آن عین هستی (الوجود) هر موجودی است. پس تو را به برخی از اسراری که مردان رموز می‌دانند، آگاه ساختم و از بسیاری سکوت کردم، زیرا باب آن گسترده است. و علم رؤیا، برزخ (البرزخ) و نسبت‌های الهی از این قبیل‌اند و سخن در آن‌ها به درازا می‌کشد.\n\n### [در علم حروف: خواص آن‌ها]\n\nو اما علوم آنان در حروف و اسماء، بدان که حروف خواصی دارند و بر سه دسته‌اند: حروف رقمی (نوشتاری)، لفظی (گفتاری) و مستحضره (حاضر شده در ذهن). و منظورم از مستحضره، حروفی است که انسان در وهم و خیال خود حاضر می‌سازد و تصویر می‌کند. یا اینکه حروف رقمی یا حروف لفظی را حاضر سازد، و مرتبه دیگری برای حروف وجود ندارد. پس با استحضار همان کاری را می‌کند که با نوشتن یا تلفظ انجام می‌دهد. اما حروف تلفظی، جز اسم نیستند، پس آن خواص اسماء است. و اما حروف مرقوم (نوشته شده) ممکن است اسم نباشند. و صاحبان این علم در مورد اینکه آیا یک حرف واحد تأثیر می‌گذارد یا خیر، اختلاف نظر دارند. من دیدم که گروهی از آنان این کار را منع کردند. شکی نیست که وقتی با آن‌ها در چنین موضوعی وارد بحث شدم، آن‌ها را بر اشتباهشان در آنچه بدان رفته بودند و بر درستی نظرشان و کمبود عبارت‌پردازی‌شان در آن مورد، آگاه ساختم. و گروهی دیگر تأثیر را برای حرف واحد اثبات کردند. اینان نیز مانند گروه اول، هم خطا کرده‌اند و هم درست گفته‌اند. من گروهی از آنان را دیدم و جایگاه خطا و درستی را به آن‌ها اعلام کردم، پس اعتراف کردند، همان‌طور که گروه دیگر اعتراف کردند. و به هر دو گروه گفتم: آنچه را که از این موضوع دانسته‌اید، بر اساس آنچه برای شما بیان کردیم، بیازمایید. پس آزمودند و امر را همان‌طور که ذکر کردیم یافتند و از این بابت شاد شدند. و اگر نبود که من پیمانی بستم که هیچ اثری از حروف از من ظاهر نشود، عجایبی از آن به آن‌ها نشان می‌دادم.\n\n### [حروف رقمی، لفظی و مستحضره]\n\nپس بدان که حرف واحد، چه نوشته شده باشد و چه تلفظ شده، اگر قصدکننده برای عمل به آن، از حاضر ساختن آن در خیال خود، چه در نوشتار و چه در لفظ، خالی باشد، تأثیر نمی‌کند. و اگر استحضار (حضور ذهنی) همراه آن باشد، تأثیر می‌کند، زیرا آن مرکب از استحضار و نطق یا رقم است. و صورت استحضار همراه حرف واحد از هر دو گروه پنهان ماند. پس کسی که استحضار همراه حرف واحد برایش اتفاق افتاد و تأثیر را دید، از استحضار غافل شد و تأثیر را به حرف واحد نسبت داد. و کسی که تلفظ یا نوشتن حرف واحد بدون استحضار برایش اتفاق افتاد و حرف هیچ تأثیری نکرد، قائل به منع آن شد. و هیچ‌یک از آنان به معنای استحضار پی نبرد. و این‌ها حروف امثال مرکب مانند دو «واو» و غیره هستند. هنگامی که آن‌ها را به چنین چیزی آگاه ساختیم، آن را آزمودند و صحیح یافتند. و این علمی است که عقلاً و شرعاً مورد نفرت است. اما حروف لفظی، در تأثیر مراتب دارند و برخی حروف تأثیرشان از برخی دیگر عام‌تر و بیشتر است. پس «واو» عام‌ترین حروف در تأثیر است، زیرا نیروی همه حروف در آن است، و «هاء» کم‌تأثیرترین حروف است. و حروفی که بین این دو حرف قرار دارند، بر اساس مراتب خود عمل می‌کنند، چنانکه در کتاب *المبادی و الغایات فیما تتضمنه حروف المعجم من العجائب و الآیات* (مبادی و غایات در عجایب و آیاتی که حروف الفبا در بر دارند) مقرر داشته‌ایم.\n\n### [علم حروف، علم اولیاء است]\n\nو این علم، علم اولیاء (الأولیاء) نامیده می‌شود و به واسطه آن، اعیان کائنات ظاهر می‌شوند. آیا نمی‌بینی که حق (الحق) با سخن خود بر آن تنبیه می‌کند: **«باش، پس می‌شود»** (كُنْ فَيَكُونُ). پس هستی (الکون) از حروف ظاهر شد. و از اینجاست که ترمذی آن را علم اولیاء نامید. و از اینجاست که کسی که منع کرد، از تأثیر حرف واحد منع کرد، زیرا دید که با وجود اقتدار الهی، در ایجاد، یک حرف واحد نیامده است، بلکه سه حرف آمده است: یک حرف غیبی و دو حرف ظاهری، اگرچه کائن (موجود) واحد باشد. اگر از واحد بیشتر شود، سه حرف ظاهر می‌شود. پس این‌ها علوم این مردانی است که در این باب ذکر شدند. و بیشتر مردان این علم برای آن جدولی ساختند و در آن خطا کردند و صحیح نبود. نمی‌دانم آیا عمداً این کار را کردند تا مردم را در جهل نسبت به این علم رها کنند، یا اینکه خودشان جاهل بودند و متأخر بر روش متقدم عمل کرده است. و شاگرد جعفر صادق و دیگران به این قائل شدند. و این جدول در طبایع حروف است: گرم، سرد، خشک، مرطوب. پس هر حرفی که در جدول حرارت قرار گرفت، گرم است، و هر حرفی که در جدول برودت قرار گرفت، سرد است، و همچنین یبوست و رطوبت. ما ندیدیم که این ترتیب در هر عملی درست باشد، بلکه به صورت اتفاقی عمل می‌کند، مانند اعداد وفق (اعداد وفقی).\n\n### [حروف: خاصیت آن‌ها در شکل‌هایشان است نه در حرف بودنشان]\n\nو بدان که این حروف، این خاصیت را از جهت حرف بودنشان ندارند، بلکه از جهت شکل بودنشان دارند. پس چون دارای شکل بودند، خاصیت از آنِ شکل بود. به همین دلیل، تأثیر آن‌ها با اختلاف قلم‌ها متفاوت می‌شود، زیرا شکل‌ها مختلف می‌شوند. اما حروف رقمی (نوشتاری)، شکل‌هایشان با چشم محسوس است. پس هنگامی که اعیان آن‌ها یافت شود و ارواح و حیات ذاتی‌شان همراه آن باشد، خاصیت برای آن حرف به خاطر شکل و ترکیبش با روح آن است. و همچنین اگر شکل مرکب از دو یا سه حرف یا بیشتر باشد، شکل دارای روح دیگری است که آن روحی نیست که برای حرف به تنهایی بود. زیرا آن روح می‌رود و حیات حرف با آن باقی می‌ماند، چرا که شکل را جز یک روح تدبیر نمی‌کند. و روح آن حرف واحد به همراه ارواح دیگر به برزخ (البرزخ) منتقل می‌شود، زیرا مرگ شکل، زوال آن با محو شدن است. و این شکل دیگر که مرکب از دو یا سه حرف یا هر تعداد دیگر است، عین همان حرف اولی که مرکب نبود، نیست. همان‌طور که عمرو عین زید نیست، اگرچه مانند او باشد. و اما حروف لفظی، آن‌ها در هوا شکل می‌گیرند و به همین دلیل به صورتی که متکلم آن‌ها را تلفظ کرده است، به گوش می‌رسند. هنگامی که در هوا شکل گرفتند، ارواحشان در آن‌ها برپا می‌شود. و این حروف، هوا پیوسته شکل آن‌ها را حفظ می‌کند، اگرچه تأثیرشان منقضی شود. زیرا تأثیر آن‌ها تنها در اولین لحظه‌ای است که در هوا شکل می‌گیرند. سپس به سایر امت‌ها ملحق می‌شوند و کارشان تسبیح پروردگارشان می‌شود و به بالا صعود می‌کنند: **«سخنان پاکیزه به سوی او بالا می‌رود»** (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ). و آن عین شکل کلمه است از آن جهت که شکلی است که خداوند متعال را تسبیح می‌گوید، حتی اگر کلمه کفر باشد. زیرا وبال آن به متکلم آن باز می‌گردد، نه به خود کلمه. و به همین دلیل، شارع (پیامبر) فرمود: «همانا مرد سخنی از خشم خدا می‌گوید که گمان نمی‌کند به آنجا که رسیده، برسد، پس به واسطه آن هفتاد سال در آتش سقوط می‌کند.» پس عقوبت را برای تلفظ‌کننده به سبب آن قرار داد و به خود کلمه تعرض نکرد. پس این کلام خداوند سبحان است که در مصحف‌ها نوشته شده، تعظیم و تمجید و تقدیس می‌شود و به قصد تقرب به خدا خوانده می‌شود، در حالی که شامل تمام آنچه یهود و نصاری در حق خدا از کفر و ناسزا گفته‌اند، هست. و آن‌ها کلمات کفری هستند که وبالشان به گوینده‌شان بازگشته است و کلمات بر جای خود باقی مانده‌اند و در روز قیامت عذاب یا نعمت صاحبان خود را بر عهده می‌گیرند.\n\n### [حروف لفظی و مستحضره جاودانه‌اند]\n\nو این حروف هوایی لفظی، پس از وجودشان، مرگ آن‌ها را در نمی‌یابد، برخلاف حروف رقمی. زیرا شکل حرف رقمی و کلمه رقمی تغییر و زوال را می‌پذیرد، چون در محلی است که آن را می‌پذیرد، اما شکل‌های لفظی در محلی هستند که آن را نمی‌پذیرند و به همین دلیل بقا (البقاء) دارند. پس تمام جوّ مملو از کلام عالم است که صاحب کشف (الکشف) آن را به صورت‌هایی قائم می‌بیند. و اما حروف مستحضره، آن‌ها باقی هستند، زیرا وجود شکل‌هایشان در برزخ (البرزخ) است نه در حس. و تأثیر آن‌ها قوی‌تر از تأثیر سایر حروف است، اما به شرطی که سلطه استحضار آن‌ها محکم شود و کسی که آن‌ها را حاضر می‌سازد، متحد شود و دیگر جایی برای غیر آن‌ها در او باقی نماند. و بداند که خاصیت آن چیست تا به خاطر آن، آن را حاضر سازد و اثرش را ببیند. پس این شبیه تأثیر با همّت است. و اگر نداند که چه چیزی می‌بخشد، تأثیر در هستی (الوجود) واقع می‌شود، در حالی که او به آن علم ندارد. و همچنین است سایر شکل‌های حروف در هر مرتبه‌ای. و این تأثیر با حرف مستحضره را برخی که به همّت و صدق علم ندارند، به همّت و صدق تعبیر می‌کنند، در حالی که چنین نیست، اگرچه همّت، روح حرف مستحضره است، نه عین شکل مستحضره. و این حضور (الحضرة) شامل تمام حروف، چه لفظی و چه رقمی، می‌شود.\n\n### [خواص شکل‌های حروف]\n\nپس هنگامی که خواص شکل‌ها را دانستی، تأثیر به واسطه آن‌ها برای نویسنده یا تلفظ‌کننده آن، به صورت علم واقع می‌شود. و اگر مشخص نکند که آن شکل به چه انفعالاتی مرتبط است، آن را نمی‌داند. و ما کسی را دیدیم که آیه‌ای از قرآن را خواند و خبری نداشت، اما اثر غریبی را مشاهده کرد که رخ داد. و چون صاحب فطنت بود، در تلاوت خود بازگشت تا ببیند آن اثر به کدام آیه اختصاص دارد. پس شروع به خواندن و نگاه کردن کرد. از آیه‌ای که آن اثر را داشت، گذشت و تأثیر را دید، سپس از آن گذشت و آن اثر را ندید. پس این کار را بارها تکرار کرد تا آن را محقق ساخت و آن آیه را برای آن انفعال برگزید. و هرگاه می‌خواست آن انفعال را ببیند، آن آیه را تلاوت می‌کرد و آن اثر برایش ظاهر می‌شد. و این علمی است شریف در ذات خود، اما سلامت از آن دشوار است. پس بهتر است که طلب آن ترک شود، زیرا این از علومی است که خداوند به طور کلی اولیاء (الأولیاء) خود را به آن اختصاص داده است. اگرچه نزد برخی مردم اندکی از آن هست، اما از غیر راهی است که صالحان به آن می‌رسند. و به همین دلیل، کسی که آن را دارد، با آن شقی می‌شود و سعادتمند نمی‌گردد. پس خداوند ما را از عالمان به خدا قرار دهد. **«و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند»** (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}