{
  "id": 66,
  "title": {
    "ar": "الباب السادس والستون في معرفة سر الشريعة ظاهرا وباطنا وأي اسم إلهي أوجدها",
    "en": "Chapter Sixty-Six: On the Gnosis (معرفة) of the Mystery (سر) of the Divine Law (الشريعة), Outwardly (ظاهرا) and Inwardly (باطنا), and the Divine Name (اسم إلهي) that Caused its Existence.",
    "ur": "باب چھیاسٹھ: شریعت کے راز کی معرفت میں، ظاہری اور باطنی طور پر، اور یہ کہ کس اسم الٰہی نے اسے وجود بخشا۔",
    "fa": "باب شصت و ششم در معرفت سرّ شریعت از ظاهر و باطن و اینکه کدام اسم الهی آن را ایجاد کرد"
  },
  "content": {
    "ar": "## (الباب السادس والستون في معرفة سر الشريعة ظاهرا وباطنا وأي اسم إلهي أوجدها)\n\n\n> طلب الجليل من الجليل جلالا *** فأبى الجليل يشاهد الإجلالا\n\n\n> لما رأى عز الإله وجوده *** عبد الإله يصاحب الإدلالا\n\n\n> وقد اطمأن بنفسه متعززا *** متجبرا متكبرا مختالا\n\n\n> أنهى إليه شريعة معصومة *** فأذله سلطانها إذلالا\n\n\n> نادى العبيد بفاقة وبذلة *** يا من تبارك جده وتعالى‏\n\n\n### [الأسماء الإلهية لسان حال تعطيها الحقائق‏]\n\n\nقال الله عز وجل قُلْ لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا وقال تعالى وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا فاعلم إن الأسماء الإلهية لسان حال تعطيها الحقائق فاجعل بالك لما تسمع ولا تتوهم الكثرة ولا الاجتماع الوجودي وإنما أورد في هذا الباب ترتيب حقائق معقولة كثيرة من جهة النسب لا من جهة وجود عيني فإن ذات الحق واحدة من حيث ما هي ذات ثم إنه لما علمنا من وجودنا وافتقارنا وإمكاننا أنه لا بد لنا من‏\nمرجح نستند إليه وأن ذلك المستند لا بد أن يطلب وجودنا منه نسبا مختلفة كنى الشارع عنها بالأسماء الحسنى فسمى بها من كونه متكلما في مرتبة وجوبية وجوده الإلهي الذي لا يصح أن يشارك فيه فإنه إله واحد لا إله غيره‏\n\n\n### [اجتماع الأسماء في حضرة المسمى وظهور أحكامها]\n\n\nفأقول بعد هذا التقرير في ابتداء هذا الأمر والتأثير والترجيح في العالم الممكن إن الأسماء اجتمعت بحضرة المسمى ونظرت في حقائقها ومعانيها فطلبت ظهور أحكامها حتى تتميز أعيانها بآثارها فإن الخالق الذي هو المقدر والعالم والمدبر والمفصل والباري والمصور والرزاق والمحيي والمميت والوارث والشكور وجميع الأسماء الإلهية نظروا في ذواتهم ولم يروا مخلوقا ولا مدبرا ولا مفصلا ولا مصورا ولا مرزوقا فقالوا كيف العمل حتى تظهر هذه الأعيان التي تظهر أحكامنا فيها فيظهر سلطاننا فلجأت الأسماء الإلهية التي تطلبها بعض حقائق العالم بعد ظهور عينه إلى الاسم الباري فقالوا له عسى توجد هذه الأعيان لتظهر أحكامنا ويثبت سلطاننا إذ الحضرة التي نحن فيها لا تقبل تأثيرنا فقال الباري ذلك راجع إلى الاسم القادر فإني تحت حيطته‏\n\n\n### [الممكنات في حال عدمها وكيفية ظهور أعيانها]\n\n\nوكان أصل هذا أن الممكنات في حال عدمها سألت الأسماء الإلهية سؤال حال ذلة وافتقار وقالت لها إن العدم قد أعمانا عن إدراك بعضنا بعضا وعن معرفة ما يجب لكم من الحق علينا فلو أنكم أظهرتم أعياننا وكسوتمونا حلة الوجود أنعمتم علينا بذلك وقمنا بما ينبغي لكم من الإجلال والتعظيم وأنتم أيضا كانت السلطنة تصح لكم في ظهورنا بالفعل واليوم أنتم علينا سلاطين بالقوة والصلاحية فهذا الذي نطلبه منكم هو في حقكم أكثر منه في حقنا فقالت الأسماء إن هذا الذي ذكرته الممكنات صحيح فتحركوا في طلب ذلك فلما لجئوا إلى الاسم القادر قال القادر أنا تحت حيطة المريد فلا أوجد عينا منكم إلا باختصاصه ولا يمكنني الممكن من نفسه إلا أن يأتيه أمر الآمر من ربه فإذا أمره بالتكوين وقال له كن مكنني من نفسه وتعلقت بإيجاده فكونته من حينه فالجئوا إلى الاسم المريد عسى أنه يرجح ويخصص جانب الوجود على جانب العدم فحينئذ نجتمع أنا والآمر والمتكلم ونوجدكم فلجئوا إلى الاسم المريد فقالوا له إن الاسم القادر سألناه في إيجاد أعياننا فأوقف أمر ذلك عليك فما ترسم فقال المريد صدق القادر ولكن ما عندي خبر ما حكم الاسم العالم فيكم هل سبق علمه بإيجادكم فنخصص أو لم يسبق فإنا تحت حيطة الاسم العالم فسيروا إليه واذكروا له قضيتكم فساروا إلى الاسم العالم وذكروا ما قاله الاسم المريد فقال العالم صدق المريد وقد سبق علمي بإيجادكم ولكن الأدب أولى فإن لنا حضرة مهيمنة علينا وهي الاسم الله فلا بد من حضورنا عنده فإنها حضرة الجمع فاجتمعت الأسماء كلها في حضرة الله فقال ما بالكم فذكروا له الخبر فقال أنا اسم جامع لحقائقكم وإني دليل على مسمى وهو ذات مقدسة له نعوت الكمال والتنزيه فقفوا حتى أدخل على مدلولي فدخل على مدلوله فقال له ما قالته الممكنات وما تحاورت فيه الأسماء فقال اخرج وقل لكل واحد من الأسماء يتعلق بما تقتضيه حقيقته في الممكنات فإني الواحد لنفسي من حيث نفسي والممكنات إنما تطلب مرتبتي وتطلبها مرتبتي والأسماء إلهية كلها للمرتبة لا لي إلا الواحد خاصة فهو اسم خصيص بي لا يشاركني في حقيقته من كل وجه أحد لا من والأسماء ولا من المراتب ولا من الممكنات‏\n\n\n### [الميزان المعلوم والحد المرسوم والإمام المعصوم‏]\n\n\nفخرج الاسم الله ومعه الاسم المتكلم يترجم عنه للممكنات والأسماء فذكر لهم ما ذكره المسمى فتعلق العالم والمريد والقائل والقادر فظهر الممكن الأول من الممكنات بتخصيص المريد وحكم العالم فلما ظهرت الأعيان والآثار في الأكوان وتسلط بعضها على بعض وقهر بعضها بعضا بحسب ما تستند إليه من الأسماء فادى إلى منازعة وخصام فقالوا إنا نخاف علينا أن يفسد نظامنا ونلحق بالعدم الذي كنا فيه فنبهت الممكنات الأسماء بما ألقى إليها الاسم العليم والمدبر وقالوا أنتم أيها الأسماء لو كان حكمكم على ميزان معلوم وحد مرسوم بإمام ترجعون إليه يحفظ علينا وجودنا ونحفظ عليكم تأثيراتكم فينا لكان أصلح لنا ولكم فالجئوا إلى الله عسى يقدم من يحد لكم حدا تقفون عنده وإلا هلكنا وتعطلتم فقالوا هذا عين المصلحة وعين الرأي ففعلوا ذلك فقالوا إن الاسم المدبر هو ينهي أمركم فانهوا إلى المدبر الأمر فقال أنا لها فدخل وخرج بأمر الحق إلى الاسم الرب وقال له افعل ما تقتضيه المصلحة في بقاء أعيان هذه الممكنات فاتخذ وزيرين يعينانه على ما أمر به الوزير الواحد الاسم المدبر والوزير الآخر المفصل قال تعالى يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ لَعَلَّكُمْ بِلِقاءِ رَبِّكُمْ تُوقِنُونَ الذي هو الإمام فانظر ما أحكم كلام الله تعالى حيث جاء بلفظ مطابق للحال الذي ينبغي أن يكون الأمر عليه‏\n\n\n### [السياسة الحكمية والنواميس الوضعية]\n\n\nفحد الاسم الرب‏\nلهم الحدود ووضع لهم المراسم لإصلاح المملكة وليبلوهم أَيُّهُمْ أَحْسَنُ عَمَلًا وجعل الله ذلك على قسمين قسم يسمى سياسة حكمية ألقاها في فطر نفوس الأكابر من الناس فحدوا حدودا ووضعوا نواميس بقوة وجدوها في نفوسهم كل مدينة وجهة وإقليم بحسب ما يقتضيه مزاج تلك الناحية وطباعهم لعلمهم بما تعطيه الحكمة فانحفظت بذلك أموال الناس ودماؤهم وأهلوهم وأرحامهم وأنسابهم وسموها نواميس ومعناها أسباب خير لأن الناموس في العرف الاصطلاحي هو الذي يأتي بالخير والجاسوس يستعمل في الشر فهذه هي النواميس الحكمية التي وضعها العقلاء عن إلهام من الله من حيث لا يشعرون لمصالح العالم ونظمه وارتباطه في مواضع لم يكن عندهم شرع إلهي منزل ولا علم لواضع هذه النواميس بأن هذه الأمور مقربة إلى الله ولا تورث جنة ولا نارا ولا شيئا من أسباب الآخرة ولا علموا أن ثم آخرة وبعثا محسوسا بعد الموت في أجسام طبيعية ودارا فيها أكل وشرب ولباس ونكاح وفرح ودارا فيها عذاب وآلام فإن وجود ذلك ممكن وعدمه ممكن ولا دليل لهم في ترجيح أحد الممكنين بل رَهْبانِيَّةً ابْتَدَعُوها فلهذا كان مبني نواميسهم ومصالحهم على إبقاء الصلاح في هذه الدار ثم انفردوا في نفوسهم بالعلوم الإلهية من توحيد الله وما ينبغي لجلاله من التعظيم والتقديس وصفات التنزيه وعدم المثل والتشبيه ونبه من يدري ومن علم ذلك من لا يدري وحرضوا الناس على النظر الصحيح وأعلموهم أن للعقول من حيث أفكارها حدا تقف عنده لا تتجاوزه وأن لله على قلوب بعض عباده فيضا إلهيا يعلمهم فيه من لدنه علما ولم يبعد ذلك عندهم وإن الله قد أودع في العالم العلوي أمورا استدلوا عليها بوجود آثارها في العالم العنصري وهو قوله تعالى وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها فبحثوا عن حقائق نفوسهم لما رأوا أن الصورة الجسدية إذا ماتت ما نقص من أعضائها شي‏ء فعلموا أن المدرك والمحرك لهذا الجسد إنما هو أمر آخر زائد عليه فبحثوا عن ذلك الأمر الزائد فعرفوا نفوسهم ثم رأوا أنه يعلم بعد ما كان يجهل فعلموا أنها وإن كانت أشرف من أجسادها فإن الفقر والفاقة يصحبها فاعتلوا بالنظر من شي‏ء إلى شي‏ء وكلما وصلوا إلى شي‏ء رأوه مفتقرا إلى شي‏ء آخر حتى انتهى بهم النظر إلى شي‏ء لا يفتقر إلى شي‏ء ولا مثله شي‏ء ولا يشبه شيئا ولا يشبهه شي‏ء فوقفوا عنده وقالوا هذا هو الأول وينبغي أن يكون واحدا لذاته من حيث ذاته وأن أوليته لا تقبل الثاني ولا أحديته لأنه لا شبه له ولا مناسب فوحدوه توحيد وجود ثم لما رأوا أن الممكنات لأنفسها لا تترجح لذاتها علموا أن هذا الواحد أفادها الوجود فافتقرت إليه وعظمته بأن سلبت عنه جميع ما تصف ذواتها به فهذا حد العقل‏\n\n\n### [السياسة الشرعية والنواميس الإلهية]\n\n\nفبينا هم كذلك إذ قام شخص من جنسهم لم يكن عندهم من المكانة في العلم بحيث أن يعتقدوا فيه أنه ذو فكر صحيح ونظر صائب فقال لهم أنا رسول الله إليكم فقالوا الإنصاف أولى انظروا في نفس دعواه هل ادعى ما هو ممكن أو ادعى ما هو محال فقالوا إنه قد ثبت عندنا بالدليل أن لله فيضا إلهيا يجوز أن يمنحه من يشاء كما أفاض ذلك على أرواح هذه الأفلاك وهذه العقول والكل قد اشتركوا في الإمكان وليس بعض الممكنات بأولى من بعض فيما هو ممكن فما بقي لنا نظر إلا في صدق هذا المدعي أو كذبه ولا نقدم على شي‏ء من هذين الحكمين بغير دليل فإنه سوء أدب مع علمنا فقالوا هل لك دليل على صدق ما تدعيه فجاءهم بالدلائل فنظروا في دلالته وفي أدلته ونظروا أن هذا الشخص ما عنده خبر مما تنتجه الأفكار ولا عرف منه فعلموا إن الذي أوحى في كل سماء أمرها كان مما أوحاه في كل سماء وجود هذا الشخص وما جاء به فأسرعوا إليه بالإيمان به وصدقوه وعلموا أن الله قد أطلعه على ما أودعه في العالم العلوي من المعارف ما لم تصل إليه أفكارهم ثم أعطاه من المعرفة بالله ما لم يكن عندهم ورأوا نزوله في المعارف بالله إلى العامي الضعيف الرأي بما يصلح لعقله من ذلك وإلى الكبير العقل الصحيح النظر بما يصلح لعقله من ذلك فعلموا أن الرجل عنده من الفيض الإلهي ما هو وراء طور العقل وأن الله قد أعطاه من العلم به والقدرة عليه ما لم يعطه إياهم فقالوا بفضله وتقدمه عليهم وآمنوا به وصدقوه واتبعوه فعين لهم الأفعال المقربة إلى الله تعالى وأعلمهم بما خلق الله من الممكنات فيما غاب عنهم وما يكون منه سبحانه فيهم في المستقبل وجاءهم بالبعث والنشور والحشر والجنة والنار\n\n\n### [أصل وضع الشريعة الإلهية في العالم‏]\n\n\nثم إنه تتابعت الرسل على اختلاف الأزمان واختلاف الأحوال وكل واحد منهم يصدق صاحبه ما اختلفوا قط في الأصول التي استندوا إليها وعبروا عنها وإن اختلفت الأحكام فتنزلت الشرائع ونزلت الأحكام وكان الحكم بحسب الزمان والحال كما قال تعالى‏\nلِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً فاتفقت أصولهم من غير خلاف في شي‏ء من ذلك وفرقوا في هذه السياسات النبوية المشروعة من عند الله بينها وبين ما وضعت الحكماء من السياسات الحكمية التي اقتضاها نظرهم وعلموا أن هذا الأمر أتم وأنه من عند الله بلا شك فقبلوا ما أعلمهم به من الغيوب وآمنوا بالرسل وما عابد أحد منهم إلا من لم ينصح نفسه في علمه واتبع هواه وطلب الرئاسة على أبناء جنسه وجهل نفسه وقدره وجهل ربه فكان أصل وضع الشريعة في العالم وسببها طلب صلاح العالم ومعرفة ما جهل من الله مما لا يقبله العقل أي لا يستقل به العقل من حيث نظره فنزلت بهذه المعرفة الكتب المنزلة ونطقت بها ألسنة الرسل والأنبياء عليهم السلام فعلمت العقلاء عند ذلك أنها نقصها من العلم بالله أمور تممتها لهم الرسل‏\n\n\n### [العقلاء الحقيقيون وأصحاب القلقة والجدل والكلام‏]\n\n\nولا أعني بالعقلاء المتكلمين اليوم في الحكمة وإنما أعني بالعقلاء من كان على طريقتهم من الشغل بنفسه والرياضات والمجاهدات والخلوات والتهيؤ لواردات ما يأتيهم في قلوبهم عند صفائها من العالم العلوي الموحى في السموات العلى فهؤلائك أعني بالعقلاء فإن أصحاب اللقلقة والكلام والجدل الذين استعملوا أفكارهم في مواد الألفاظ التي صدرت عن الأوائل وغابوا عن الأمر الذي أخذها عنه أولئك الرجال وأما أمثال هؤلاء الذين عندنا اليوم لا قدر لهم عند كل عاقل فإنهم يستهزئون بالدين ويستخفون بعباد الله ولا يعظم عندهم إلا من هو معهم على مدرجتهم قد استولى على قلوبهم حب الدنيا وطلب الجاه والرئاسة فأذلهم الله كما أذلوا العلم وحقرهم وصغرهم وألجأهم إلى أبواب الملوك والولاة من الجهال فاذلتهم الملوك والولاة فأمثال هؤلاء لا يعتبر قولهم فإن قلوبهم قد ختم الله عليها وفَأَصَمَّهُمْ وأَعْمى‏ أَبْصارَهُمْ مع الدعوى العريضة أنهم أفضل العالم عند نفوسهم فالفقيه المفتي في دين الله مع قلة ورعه بكل وجه أحسن حالا من هؤلاء فإن صاحب الايمان مع كونه أخذه تقليدا هو أحسن حالا من هؤلاء العقلاء على زعمهم وحاشى العاقل أن يكون بمثل هذه الصفة وقد أدركنا ممن كان على حالهم قليلا وكانوا أعرف الناس بمقدار الرسل ومن أعظمهم تبعا لسنن الرسول صلى الله عليه وسلم وأشدهم محافظة على سننه عارفين بما ينبغي لجلال الحق من التعظيم عالمين بما خص الله عباده من النبيين وأتباعهم من الأولياء من العلم بالله من جهة الفيض الإلهي الاختصاصي الخارج عن التعلم المعتاد من الدرس والاجتهاد ما لا يقدر العقل من حيث فكره أن يصل إليه ولقد سمعت واحدا من أكابرهم وقد رأى مما فتح الله به علي من العلم به سبحانه من غير نظر ولا قراءة بل من خلوة خلوت بها مع الله ولم أكن من أهل الطلب فقال الحمد لله الذي أنا في زمان رأيت فيه من آتاه الله رحمة من عنده وعلمه من لدنه علما فالله يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Sixty-Six: Concerning the Knowledge of the Secret of the Divine Law (الشريعة), Outwardly and Inwardly, and Which Divine Name Brought It into Existence\n\nThe Majestic sought Majesty from the Majestic,\nBut the Majestic refused to witness the Glorification.\n\nWhen the servant saw the might of the God in his existence,\nThe servant of God accompanied the self-assurance.\n\nAnd he was reassured in his soul, feeling mighty,\nArrogant, proud, and boastful.\n\nHe conveyed to him an infallible Divine Law,\nSo its sovereignty humbled him utterly.\n\nThe servant called out in need and lowliness,\nO He whose Grandeur is blessed and exalted!\n\n### The Divine Names (الأسماء الإلهية) are the Tongue of the State that the Realities (الحقائق) Grant\n\nAllah, Mighty and Majestic, said: <<قُلْ لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا>> (Say: If there were in the earth angels walking securely, We would have sent down upon them from heaven an angel as a messenger.) And He, Exalted is He, said: <<وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا>> (And We would never punish until We had sent a messenger.)\n\nKnow that the Divine Names (الأسماء الإلهية) are the tongue of the state (لسان حال) that the Realities (الحقائق) grant. Therefore, pay attention to what you hear, and do not imagine multiplicity (الكثرة) or existential combination (الاجتماع الوجودي). Rather, what is presented in this chapter is the arrangement of numerous intelligible realities (حقائق معقولة) from the perspective of relations (النسب), not from the perspective of concrete existence (وجود عيني).\n\nThe Essence (الذات) of the Real (الحق) is one, insofar as it is the Essence. Then, because we know from our existence, our need, and our possibility (إمكاننا) that we must have a preponderator (مرجح) upon whom we rely, and that this source must demand our existence through various relations, the Lawgiver (الشارع) symbolized these relations as the Most Beautiful Names (الأسماء الحسنى). He is named by them because He is the Speaker (متكلما) in the necessary level (مرتبة وجوبية) of His Divine Existence (وجوده الإلهي), in which no one can share, for He is one God, there is no god but Him.\n\n### The Gathering of the Names in the Presence of the Named (المسمى) and the Manifestation of Their Rulings\n\nI say, following this affirmation, regarding the initiation of this matter, the influence, and the preponderance in the contingent world (العالم الممكن), that the Names gathered in the Presence (حضرة) of the Named. They examined their realities and meanings and sought the manifestation of their rulings (أحكامها) so that their essences (أعيانها) might be distinguished by their effects (آثارها).\n\nThe Creator (الخالق), who is the Determiner (المقدر), the Knower (العالم), the Director (المدبر), the Separator (المفصل), the Originator (الباري), the Fashioner (المصور), the Provider (الرزاق), the Giver of Life (المحيي), the Giver of Death (المميت), the Inheritor (الوارث), the Appreciative (الشكور), and all the Divine Names looked into their essences (ذواتهم) but saw no creature, no director, no separator, no fashioner, and no provided one. They asked: \"How shall we act so that these essences may appear, in which our rulings manifest, and our sovereignty (سلطاننا) becomes evident?\"\n\nThe Divine Names, which required certain realities of the world after the appearance of its essence, turned to the Name the Originator (الباري). They said to Him: \"Perhaps you can bring these essences into existence so that our rulings may appear and our sovereignty be established, since the Presence we are in does not accept our influence.\" The Originator replied: \"That is referred back to the Name the Powerful (القادر), for I am under His encompassing authority (حيطته).\"\n\n### The Contingent Entities (الممكنات) in Their State of Non-Existence and How Their Essences Appear\n\nThe origin of this was that the contingent entities, in their state of non-existence (عدمها), asked the Divine Names—a request made by the state of lowliness and need (ذلة وافتقار)—saying to them: \"Non-existence has blinded us from perceiving one another and from knowing the right (الحق) that is due to you from us. If you were to manifest our essences (أعياننا) and clothe us in the garment of Existence (حلة الوجود), you would bestow a favor upon us, and we would fulfill the glorification and veneration due to you. Furthermore, sovereignty would be established for you through our actual manifestation. Today, you are sovereigns over us potentially and by qualification. Thus, what we seek from you is more beneficial to your right than to ours.\"\n\nThe Names replied: \"What the contingent entities have mentioned is true.\" So they moved to seek this manifestation.\n\nWhen they turned to the Name the Powerful, the Powerful said: \"I am under the encompassing authority of the Willer (المريد). I do not bring any essence of yours into existence except by His specification (اختصاصه). The contingent entity cannot enable me to act upon itself unless the command of the Commander (الآمر) comes to it from its Lord. If He commands it to be formed (بالتكوين) and says to it, 'Be!' (كن), it enables me to act upon itself, and I become attached to its creation, and I form it instantly. Therefore, turn to the Name the Willer. Perhaps He will preponderate and specify the side of Existence (جانب الوجود) over the side of Non-existence (جانب العدم). Then, I, the Commander, and the Speaker (المتكلم) will gather and bring you into existence.\"\n\nThey turned to the Name the Willer and said: \"We asked the Name the Powerful to bring our essences into existence, and He referred the matter to you. What do you decree?\"\n\nThe Willer said: \"The Powerful spoke truly. But I have no knowledge of the ruling of the Name the Knower (العالم) concerning you. Did His Knowledge precede your creation, so that we may specify, or did it not? For we are under the encompassing authority of the Name the Knower. Go to Him and present your case.\"\n\nThey went to the Name the Knower and mentioned what the Name the Willer had said. The Knower said: \"The Willer spoke truly. My Knowledge has indeed preceded your creation. However, propriety (الأدب) is paramount. We have a Presence that dominates us, which is the Name Allah. We must all attend before Him, for it is the Presence of Gathering (حضرة الجمع).\"\n\nAll the Names gathered in the Presence of Allah. He asked: \"What is your concern?\" They informed Him of the matter. He said: \"I am a Name that gathers your realities. I am the indicator (دليل) of the Named (مسمى), which is a Sanctified Essence (ذات مقدسة) possessing the attributes of perfection and transcendence (التنزيه). Wait until I enter upon My Indicated One (مدلولي).\"\n\nHe entered upon His Indicated One and conveyed what the contingent entities had said and what the Names had discussed. He said: \"Go out and tell each one of the Names to attach itself to what its reality necessitates in the contingent entities. For I am the One (الواحد) for Myself, from the perspective of Myself. The contingent entities only seek My Level (مرتبتي), and My Level seeks them. All the Names are Divine for the Level, not for Me, except for the One specifically. That is a Name particular to Me, in whose reality no one shares in every respect—neither from the Names, nor the Levels (المراتب), nor the contingent entities.\"\n\n### The Known Balance (الميزان المعلوم), the Prescribed Limit (الحد المرسوم), and the Infallible Leader (الإمام المعصوم)\n\nThe Name Allah came out, accompanied by the Name the Speaker (المتكلم), translating for the contingent entities and the Names. He conveyed what the Named had said. The Knower, the Willer, the Speaker, and the Powerful attached themselves [to the task]. The first contingent entity appeared through the specification of the Willer and the ruling of the Knower.\n\nWhen the essences and effects (الآثار) appeared in the cosmos (الأكوان), and some dominated others, and some conquered others, according to the Names they were based upon, this led to conflict and dispute. They said: \"We fear that our order will be corrupted and that we will revert to the non-existence we were in.\"\n\nThe contingent entities alerted the Names, based on what the Name the All-Knowing (العليم) and the Director (المدبر) had inspired in them. They said: \"O Names, if your ruling were based on a known balance (ميزان معلوم) and a prescribed limit (حد مرسوم), with a leader (إمام) to whom you refer, who preserves our existence for us and upon whom we preserve your influences upon us, it would be better for us and for you. Turn to Allah, perhaps He will appoint someone to set a limit for you to stop at, otherwise, we will perish and you will become ineffective.\"\n\nThe Names said: \"This is the essence of benefit and sound judgment.\" They did so. They said: \"The Name the Director is the one who concludes your affair. Refer the matter to the Director.\"\n\nThe Director said: \"I am responsible for it.\" He entered and came out with the command of the Real (الحق) to the Name the Lord (الرب), saying to Him: \"Do what is required by the benefit (المصلحة) for the subsistence (بقاء) of the essences of these contingent entities.\"\n\nHe took two ministers to assist Him in what He was commanded: the first minister, the Name the Director, and the other minister, the Separator (المفصل). He, Exalted is He, said: <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ لَعَلَّكُمْ بِلِقاءِ رَبِّكُمْ تُوقِنُونَ>> (He directs the affair and details the signs, that you may be certain of the meeting with your Lord.)—who is the Leader (الإمام). Observe how precise the word of Allah is, as it came with a phrase corresponding exactly to the state upon which the matter ought to be.\n\n### The Governance of Wisdom (السياسة الحكمية) and the Conventional Laws (النواميس الوضعية)\n\nThe Name the Lord set limits (الحدود) for them and established ordinances (المراسم) for the rectification of the kingdom, and to test them: <<أَيُّهُمْ أَحْسَنُ عَمَلًا>> (which of them is best in deed).\n\nAllah made this into two divisions:\n\n1.  A division called the Governance of Wisdom (سياسة حكمية), which He cast into the innate dispositions (فطر) of the souls of the great ones among men. They set limits and established laws (نواميس) by a power they found within themselves, specific to each city, region, and territory, according to the temperament and nature of that area, based on their knowledge of what wisdom (الحكمة) dictates. Through this, people's wealth, blood, families, kinship, and lineages were preserved. They called these *Nawamis* (نواميس), meaning causes of good, because *namus* in conventional usage refers to that which brings good, while *jassus* (spy) is used for evil.\n\nThese are the laws of wisdom (النواميس الحكمية) established by the rational ones (العقلاء) through inspiration (إلهام) from Allah, without their realizing it, for the benefit, order, and coherence of the world (العالم). This occurred in places where there was no revealed Divine Law (شرع إلهي منزل). The framers of these laws did not know that these matters brought one closer to Allah, nor that they resulted in Paradise or Hell, or any cause of the Hereafter (الآخرة). They did not know that there was a Hereafter, or a sensible resurrection (بعثا محسوسا) after death in natural bodies, or a dwelling place with eating, drinking, clothing, marriage, and joy, or a dwelling place with torment and pain. The existence of such things was possible, and their non-existence was possible. They had no proof to preponderate one possibility over the other. Rather, <<رَهْبانِيَّةً ابْتَدَعُوها>> (monasticism which they innovated).\n\nTherefore, the foundation of their laws and benefits was based on maintaining righteousness in this temporal abode (هذه الدار). Then, they isolated themselves in their souls with Divine Sciences (العلوم الإلهية), such as the Oneness of God (توحيد الله), the veneration and sanctification due to His Majesty, the attributes of transcendence (التنزيه), and the absence of likeness or comparison (التشبيه). Those who knew this informed those who did not, urging people toward sound contemplation (النظر الصحيح). They taught them that intellects (العقول), by virtue of their thoughts, have a limit (حدا) they cannot surpass. They also taught that Allah grants a Divine Influx (فيضا إلهيا) upon the hearts of some of His servants, teaching them knowledge from His Presence (علما من لدنه). They did not deem this impossible.\n\nThey deduced that Allah had deposited matters in the higher world (العالم العلوي) by observing their effects in the elemental world (العالم العنصري), which is His saying: <<وَأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها>> (And He revealed in every heaven its command). They investigated the realities of their souls (حقائق نفوسهم) when they saw that nothing was missing from the physical form when it died. They knew that the perceiver and mover of this body must be another, additional matter. They investigated this additional matter and came to know their souls. Then they saw that the soul gains knowledge after being ignorant, so they knew that even though the soul is nobler than the body, poverty and need (الفقر والفاقة) accompany it. They proceeded by contemplation from one thing to another, and every time they reached something, they saw it was in need of something else, until their contemplation ended at something that needed nothing, nothing was like it, it resembled nothing, and nothing resembled it. They stopped there and said: \"This is the First (الأول). It must be One (واحدا) by virtue of its Essence (لذاته من حيث ذاته), and its Primordiality (أوليتها) does not accept a second, nor does its Oneness (أحديتها), because it has no likeness or suitability.\" Thus, they affirmed its existential Unity (توحيد وجود). Then, seeing that the contingent entities could not preponderate themselves by their own essence, they knew that this One bestowed Existence upon them, so they became dependent on Him. They magnified Him by stripping Him of all attributes by which they described their own essences. This is the limit of the intellect (حد العقل).\n\n### The Governance of the Divine Law (السياسة الشرعية) and the Divine Laws (النواميس الإلهية)\n\nWhile they were in this state, a person of their own kind arose, who did not possess a status among them in knowledge such that they would believe him to have sound thought and correct contemplation. He said to them: \"I am the Messenger of Allah to you.\"\n\nThey said: \"Fairness is paramount. Look into the claim itself: Did he claim what is possible or what is impossible?\" They replied: \"It has been established for us by proof that Allah has a Divine Influx (فيضا إلهيا) that He may grant to whomever He wills, just as He bestowed it upon the spirits of these spheres (الأفلاك) and these intellects (العقول). All have shared in possibility (الإمكان), and no contingent entity is more worthy than another in what is possible. Our only remaining consideration is the truthfulness or falsehood of this claimant. We shall not proceed to either judgment without proof, for that would be ill-manners toward our knowledge.\"\n\nThey asked: \"Do you have proof of the truth of what you claim?\" He brought them proofs. They examined his indication and his proofs. They observed that this person had no knowledge of what thoughts produce, nor was he known for it. They knew that the One who <<أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها>> (revealed in every heaven its command) included in that revelation the existence of this person and what he brought. They hastened to believe in him, affirmed his truthfulness, and knew that Allah had informed him of the knowledge deposited in the higher world (العالم العلوي) that their thoughts could not reach.\n\nThen He gave him Gnosis (المعرفة بالله) that they did not possess. They saw him descend in his Gnosis of Allah to the common person of weak intellect with what suited his mind, and to the person of great intellect and sound contemplation with what suited his mind. They knew that the man possessed a Divine Influx that was beyond the scope of the intellect (طور العقل), and that Allah had given him knowledge of Himself and power over Him that He had not given them. They acknowledged his superiority and precedence over them, believed in him, affirmed his truthfulness, and followed him. He specified for them the acts that bring one closer to Allah (الأفعال المقربة), informed them of the contingent entities Allah created in the unseen realm (فيما غاب عنهم), and what He, Exalted is He, would do to them in the future. He brought them the Resurrection (البعث), the Gathering (النشور والحشر), Paradise (الجنة), and Hellfire (النار).\n\n### The Origin of the Establishment of the Divine Law (الشريعة) in the World\n\nThen the Messengers (الرسل) followed one another, despite the differences in times and circumstances. Each one affirmed the truth of the other. They never differed concerning the fundamental principles (الأصول) they relied upon and expressed, even if the rulings (الأحكام) differed. The Divine Laws (الشرائع) were revealed, and the rulings descended. The ruling was according to the time and the state, as He, Exalted is He, said: <<لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً>> (For each of you We have appointed a Divine Law (شرعة) and a Way (منهاج)).\n\nTheir fundamentals agreed without any disagreement. They distinguished between these Prophetic, Divinely sanctioned policies (السياسات النبوية المشروعة) and the policies of wisdom (السياسات الحكمية) established by the wise (الحكماء) based on their contemplation. They knew that this matter was more complete and undoubtedly came from Allah. They accepted the unseen matters (الغيوب) He informed them of and believed in the Messengers.\n\nNo one refused to worship except those who were insincere in their knowledge, followed their caprice (هواه), sought leadership over their peers, were ignorant of themselves and their worth, and ignorant of their Lord.\n\nThus, the origin of the establishment of the Divine Law (الشريعة) in the world and its cause was the seeking of the world's rectification (صلاح العالم) and the knowledge of what was unknown concerning Allah, which the intellect does not accept—meaning, which the intellect cannot independently grasp through its contemplation. The revealed Books (الكتب المنزلة) descended with this knowledge, and the tongues of the Messengers and Prophets (عليهم السلام) spoke it. The rational ones (العقلاء) then knew that their knowledge of Allah was deficient in matters that the Messengers completed for them.\n\n### The True Rational Ones (العقلاء الحقيقيون) and the People of Frivolity, Dialectics, and Theology\n\nBy the rational ones (العقلاء), I do not mean those who engage in philosophy (الحكمة) today. Rather, I mean those who follow the path of the former ones: preoccupation with the self, spiritual disciplines (الرياضات), striving (المجاهدات), retreats (الخلوات), and preparation for the Divine Influx (واردات) that comes to their hearts when purified, from the higher world (العالم العلوي) revealed in the highest heavens. These are the ones I mean by the rational ones.\n\nAs for the people of frivolity (اللقلقة), speech (الكلام), and dialectics (الجدل), who employed their thoughts on the material of the words (مواد الألفاظ) issued by the ancients, but were absent from the source (الأمر) from which those men derived them—such people today have no standing with any rational person. They mock religion, belittle the servants of Allah, and only venerate those who follow their path. The love of the world and the pursuit of status and leadership have dominated their hearts. So Allah humbled them, just as they humbled knowledge. He scorned and diminished them, forcing them to the doors of ignorant kings and rulers, who then humiliated them.\n\nThe words of such people are not to be considered, for Allah has sealed their hearts, <<فَأَصَمَّهُمْ وَأَعْمى‏ أَبْصارَهُمْ>> (and made them deaf and blinded their sight), despite their vast claim that they are the best people in the world, in their own estimation.\n\nThe jurist (الفقيه) who issues legal rulings (المفتي) in the religion of Allah, despite his lack of piety, is in every way better off than these people. Indeed, the person of faith (صاحب الايمان), even if he acquired it through imitation (تقليدا), is better off than these self-proclaimed rational ones.\n\nI have met a few who were on the path of the true rational ones. They were the most knowledgeable of the status of the Messengers, the most devoted followers of the Sunnah of the Messenger (peace and blessings be upon him), and the most careful preservers of his traditions. They knew the veneration due to the Majesty of the Real (جلال الحق). They knew the knowledge of Allah that He specifically granted to His servants—the Prophets and their followers among the Saints (الأولياء)—knowledge derived from the specific Divine Influx (الفيض الإلهي الاختصاصي), which is outside of customary learning, study, and exertion, and which the intellect, through its thought, cannot reach.\n\nI heard one of their great figures, upon seeing the knowledge of the Exalted One that Allah had opened up to me—not through contemplation or reading, but through a spiritual retreat (خلوة) I undertook with Allah, though I was not one of those who sought it—say: \"Praise be to Allah, who allowed me to live in a time when I saw one to whom Allah granted mercy from His Presence and taught him knowledge from His Own Presence (علماً من لدنه).\"\n\n<<فَاللهُ يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ وَاللهُ ذُو الْفَضْلِ الْعَظِيمِ>> (And Allah selects for His mercy whom He wills, and Allah is the possessor of great bounty.)\n<<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way.)",
    "ur": "## (باب چھیاسٹھواں: شریعت کے ظاہر و باطن کے راز کی معرفت میں اور یہ کہ کس اسمِ الٰہی نے اسے وجود بخشا)\n\n> جلیل (ذات) نے جلال (عظمت) کا طلب جلیل (بندے) سے کیا،\n>\n> مگر جلیل (ذات) نے اس جلال کا مشاہدہ کرنے سے انکار کر دیا۔\n>\n> جب بندے نے الٰہ کی عزت کو اپنے وجود میں دیکھا،\n>\n> تو اس نے الٰہ کی عبادت ناز و انداز (ادلال) کے ساتھ کی۔\n>\n> اور وہ اپنے نفس میں عزت، جبر، تکبر اور فخر کے ساتھ مطمئن ہو گیا۔\n>\n> (اللہ نے) اس کی طرف ایک معصوم شریعت بھیجی،\n>\n> تو اس کے سلطان نے اسے ذلیل کر دیا۔\n>\n> اس نے بندوں کو فقر اور عاجزی کے ساتھ پکارا،\n>\n> اے وہ ذات جس کی عظمت بابرکت اور بلند ہے۔\n\n### [حقائق کی طرف سے عطا کردہ اسماءِ الٰہیہ کی زبانِ حال]\n\nاللہ عزوجل نے فرمایا: **\"کہہ دیجیے کہ اگر زمین میں فرشتے ہوتے جو اطمینان سے چلتے پھرتے، تو ہم ان پر آسمان سے کسی فرشتے کو رسول بنا کر نازل کرتے\"** (قُلْ لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا)۔ اور اللہ تعالیٰ نے فرمایا: **\"اور ہم عذاب دینے والے نہیں ہیں جب تک کہ ہم کوئی رسول نہ بھیج دیں\"** (وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا)۔\n\nپس جان لو کہ اسماءِ الٰہیہ حقائق کی طرف سے عطا کردہ زبانِ حال ہیں۔ لہٰذا جو کچھ تم سنو اس پر اپنا دھیان مرکوز رکھو اور کثرت یا وجودی اجتماع کا وہم نہ کرو۔ اس باب میں صرف نسبتوں کے اعتبار سے بہت سے معقول حقائق کی ترتیب بیان کی گئی ہے، نہ کہ وجودِ عینی کے اعتبار سے۔ کیونکہ ذاتِ حق اپنی ذات کے اعتبار سے واحد ہے، پھر جب ہم نے اپنے وجود، اپنی محتاجی اور اپنے امکان سے یہ جانا کہ ہمارے لیے کسی مرجح (ترجیح دینے والے) کا ہونا ضروری ہے جس پر ہم بھروسہ کریں، اور یہ کہ وہ مستند (بھروسے کی جگہ) ہمارے وجود کو مختلف نسبتوں سے طلب کرے گا، تو شارع (شریعت لانے والے) نے ان نسبتوں کو اسماءِ حسنیٰ (اچھے ناموں) سے تعبیر کیا۔ پس اللہ نے ان ناموں سے اس لیے نامزد کیا کہ وہ اپنے الٰہی وجود کے وجوبی مرتبے میں متکلم ہے، جس میں کوئی شریک نہیں ہو سکتا، کیونکہ وہ ایک الٰہ ہے اور اس کے سوا کوئی الٰہ نہیں۔\n\n### [مسمیٰ کی بارگاہ میں اسماء کا اجتماع اور ان کے احکام کا ظہور]\n\nمیں اس تمہید کے بعد عالمِ ممکن میں اس امر، تاثیر اور ترجیح کے آغاز کے بارے میں کہتا ہوں کہ اسماء (الٰہیہ) مسمیٰ (ذاتِ حق) کی بارگاہ میں جمع ہوئے اور اپنے حقائق اور معانی پر غور کیا، تو انہوں نے اپنے احکام کے ظہور کا مطالبہ کیا تاکہ ان کے آثار کے ذریعے ان کی حقیقتیں ممتاز ہو جائیں۔ کیونکہ الخالق (پیدا کرنے والا)، جو کہ المقدر (اندازہ لگانے والا)، العالم (جاننے والا)، المدبر (تدبیر کرنے والا)، المفصل (تفصیل دینے والا)، الباری (وجود بخشنے والا)، المصور (صورت بنانے والا)، الرزاق (روزی دینے والا)، المحیی (زندہ کرنے والا)، الممیت (موت دینے والا)، الوارث (وارث)، اور الشکور (قدردان) ہے، اور تمام اسماءِ الٰہیہ نے اپنی ذاتوں میں دیکھا اور انہیں کوئی مخلوق، کوئی مدبر، کوئی مفصل، کوئی مصور، یا کوئی مرزوق (روزی دیا گیا) نظر نہیں آیا۔\n\nتو انہوں نے کہا: کیا کیا جائے تاکہ یہ حقیقتیں ظاہر ہوں جن میں ہمارے احکام ظاہر ہوں اور ہمارا سلطان (اقتدار) ظاہر ہو؟ پس وہ اسماءِ الٰہیہ جنہیں عالم کے بعض حقائق اپنے وجود کے ظہور کے بعد طلب کرتے ہیں، وہ الاسم الباری (وجود بخشنے والے نام) کی طرف متوجہ ہوئے اور اس سے کہا: شاید آپ ان حقیقتوں کو وجود بخش دیں تاکہ ہمارے احکام ظاہر ہوں اور ہمارا اقتدار ثابت ہو، کیونکہ جس بارگاہ میں ہم ہیں وہ ہماری تاثیر کو قبول نہیں کرتی۔ الباری نے کہا: یہ امر الاسم القادر (قادر نام) کی طرف راجع ہے، کیونکہ میں اس کی حفاظت میں ہوں۔\n\n### [ممکنات اپنی عدم کی حالت میں اور ان کی حقیقتوں کے ظہور کا طریقہ]\n\nاس کی اصل یہ تھی کہ ممکنات نے اپنی عدم کی حالت میں اسماءِ الٰہیہ سے ذلت اور فقر کی زبانِ حال سے سوال کیا اور ان سے کہا: عدم نے ہمیں ایک دوسرے کو جاننے سے اور اس حق کو جاننے سے اندھا کر دیا ہے جو آپ کا ہم پر واجب ہے۔ اگر آپ ہماری حقیقتوں کو ظاہر کر دیں اور ہمیں وجود کا لباس پہنا دیں، تو آپ ہم پر یہ انعام کریں گے اور ہم آپ کے لیے تعظیم و جلال کے جو تقاضے ہیں انہیں پورا کریں گے۔ اور آپ کا اقتدار بھی ہمارے ظہور کے ذریعے بالفعل صحیح ہو جائے گا، جبکہ آج آپ ہم پر بالقوۃ اور صلاحیت کے اعتبار سے سلطان ہیں۔ پس جو کچھ ہم آپ سے طلب کر رہے ہیں وہ آپ کے حق میں ہمارے حق سے زیادہ ہے۔\n\nاسماء نے کہا: جو کچھ ممکنات نے کہا ہے وہ صحیح ہے، پس وہ اس کی طلب میں متحرک ہوئے۔ جب وہ الاسم القادر کی طرف متوجہ ہوئے، تو القادر نے کہا: میں المريد (ارادہ کرنے والے) کی حفاظت میں ہوں، میں تم میں سے کسی حقیقت کو اس کے اختصاص کے بغیر وجود نہیں دے سکتا، اور ممکن مجھے اپنے آپ پر قدرت نہیں دے سکتا جب تک کہ اس کے رب کی طرف سے الآمر (حکم دینے والے) کا حکم نہ آئے۔ پس جب وہ اسے تکوین (وجود بخشنے) کا حکم دے گا اور کہے گا: \"کُن\" (ہو جا)، تو وہ مجھے اپنے آپ پر قدرت دے گا اور میں اس کے ایجاد سے متعلق ہو جاؤں گا، پس میں اسے فوراً وجود بخش دوں گا۔ لہٰذا تم الاسم المريد کی طرف رجوع کرو، شاید وہ وجود کے پہلو کو عدم کے پہلو پر ترجیح دے اور مخصوص کر دے۔ تب میں، الآمر اور المتکلم (کلام کرنے والا) جمع ہوں گے اور تمہیں وجود بخشیں گے۔\n\nپس وہ الاسم المريد کی طرف متوجہ ہوئے اور اس سے کہا: ہم نے الاسم القادر سے اپنی حقیقتوں کو وجود بخشنے کے بارے میں سوال کیا، تو اس نے اس کا معاملہ آپ پر موقوف کر دیا، آپ کیا حکم دیتے ہیں؟ المريد نے کہا: القادر نے سچ کہا، لیکن میرے پاس اس کی خبر نہیں کہ الاسم العالم (جاننے والے نام) کا تم پر کیا حکم ہے؟ کیا اس کا علم تمہارے ایجاد کے ساتھ سبقت لے چکا ہے تاکہ ہم تخصیص کریں یا نہیں؟ کیونکہ ہم الاسم العالم کی حفاظت میں ہیں۔ پس تم اس کی طرف جاؤ اور اپنا معاملہ اس کے سامنے بیان کرو۔\n\nپس وہ الاسم العالم کی طرف گئے اور جو کچھ المريد نے کہا تھا وہ بیان کیا۔ العالم نے کہا: المريد نے سچ کہا، اور میرے علم میں تمہارا ایجاد سبقت لے چکا ہے، لیکن ادب اولیٰ ہے، کیونکہ ہمارے اوپر ایک بارگاہ مہیمنہ (غالب) ہے، اور وہ الاسم اللہ ہے۔ لہٰذا ہمارا اس کے پاس حاضر ہونا ضروری ہے، کیونکہ وہ جمع کی بارگاہ ہے۔\n\nپس تمام اسماء اللہ کی بارگاہ میں جمع ہوئے، تو اللہ نے پوچھا: تمہارا کیا حال ہے؟ انہوں نے اسے خبر سنائی۔ اللہ نے کہا: میں تمہارے حقائق کے لیے ایک جامع اسم ہوں، اور میں ایک مسمیٰ (نام رکھے گئے) پر دلیل ہوں، جو ایک مقدس ذات ہے جس کے لیے کمال اور تنزیہ کی صفات ہیں۔ پس تم ٹھہرو یہاں تک کہ میں اپنے مدلول (جس پر دلالت کرتا ہوں) کے پاس جاؤں۔\n\nپس وہ اپنے مدلول کے پاس گیا اور اسے وہ سب بتایا جو ممکنات نے کہا تھا اور جو اسماء کے درمیان گفتگو ہوئی تھی۔ اس نے کہا: باہر جاؤ اور ہر اسم سے کہو کہ وہ اس چیز سے متعلق ہو جائے جس کا اس کا حقیقت ممکنات میں تقاضا کرتی ہے۔ کیونکہ میں اپنی ذات کے اعتبار سے واحد ہوں، اور ممکنات صرف میرے مرتبے کو طلب کرتے ہیں، اور میرا مرتبہ انہیں طلب کرتا ہے۔ اور تمام اسماء الٰہیہ مرتبے کے لیے ہیں، میرے لیے نہیں، سوائے الواحد (واحد) کے، کیونکہ وہ ایک خاص اسم ہے جو ہر لحاظ سے میری حقیقت میں شریک نہیں ہوتا، نہ اسماء میں سے، نہ مراتب میں سے، اور نہ ممکنات میں سے۔\n\n### [معلوم میزان، مرسوم حد اور معصوم امام]\n\nپس الاسم اللہ باہر نکلا اور اس کے ساتھ الاسم المتکلم تھا جو ممکنات اور اسماء کے لیے اس کی ترجمانی کر رہا تھا۔ اس نے انہیں وہ سب بتایا جو مسمیٰ نے کہا تھا۔ پس العالم، المريد، القائل (کہنے والا) اور القادر متعلق ہو گئے۔ پس ممکنات میں سے پہلا ممکن المريد کی تخصیص اور العالم کے حکم سے ظاہر ہوا۔\n\nجب کائنات میں حقیقتیں اور آثار ظاہر ہوئے اور بعض نے بعض پر تسلط حاصل کیا اور بعض نے بعض کو ان اسماء کے مطابق مغلوب کیا جن پر وہ بھروسہ کرتے تھے، تو یہ تنازع اور جھگڑے کا باعث بنا۔ انہوں نے کہا: ہمیں ڈر ہے کہ ہمارا نظام بگڑ جائے گا اور ہم اس عدم سے جا ملیں گے جس میں ہم تھے۔\n\nپس ممکنات نے اسماء کو اس چیز سے آگاہ کیا جو الاسم العلیم (جاننے والا) اور المدبر (تدبیر کرنے والا) نے ان پر القا کیا تھا، اور کہا: اے اسماء! اگر آپ کا حکم ایک معلوم میزان (ترازو) اور ایک مرسوم حد (مقررہ حد) پر ہوتا، جس میں ایک امام (رہنما) ہوتا جس کی طرف آپ رجوع کرتے جو ہمارے وجود کی حفاظت کرتا اور ہم آپ کی تاثیرات کی ہم میں حفاظت کرتے، تو یہ ہمارے اور آپ کے لیے زیادہ بہتر ہوتا۔ پس آپ اللہ کی طرف رجوع کریں، شاید وہ کسی ایسے شخص کو آگے بڑھائے جو آپ کے لیے ایک حد مقرر کر دے جس پر آپ ٹھہر جائیں، ورنہ ہم ہلاک ہو جائیں گے اور آپ معطل ہو جائیں گے۔\n\nاسماء نے کہا: یہ عین مصلحت اور عین رائے ہے۔ پس انہوں نے ایسا ہی کیا۔ انہوں نے کہا: الاسم المدبر ہی تمہارے معاملے کو انجام دے گا، پس تم المدبر کو معاملہ سونپ دو۔ اس نے کہا: میں اس کے لیے تیار ہوں۔ پس وہ داخل ہوا اور حق کے حکم سے الاسم الرب (رب نام) کے پاس نکلا اور اس سے کہا: جو کچھ ان ممکنات کی حقیقتوں کے بقا کے لیے مصلحت کا تقاضا ہو وہ کرو۔\n\nپس اس نے دو وزیر بنائے جو اس کام میں اس کی مدد کریں جس کا اسے حکم دیا گیا تھا: ایک وزیر الاسم المدبر (تدبیر کرنے والا) اور دوسرا وزیر المفصل (تفصیل دینے والا)۔ اللہ تعالیٰ نے فرمایا: **\"وہ امر کی تدبیر کرتا ہے، وہ آیات کو تفصیل سے بیان کرتا ہے تاکہ تم اپنے رب کی ملاقات پر یقین کر لو\"** (يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ لَعَلَّكُمْ بِلِقاءِ رَبِّكُمْ تُوقِنُونَ) جو کہ امام ہے۔ پس دیکھو اللہ تعالیٰ کا کلام کتنا حکیمانہ ہے، جہاں وہ اس حال کے مطابق لفظ لایا جو امر کو ہونا چاہیے۔\n\n### [حکمی سیاست اور وضعی نوامیس]\n\nپس الاسم الرب نے ان کے لیے حدود مقرر کیں اور سلطنت کی اصلاح کے لیے ان کے لیے مراسم (قوانین) وضع کیے تاکہ وہ انہیں آزمائے کہ **\"ان میں سے کون عمل میں سب سے بہتر ہے\"** (أَيُّهُمْ أَحْسَنُ عَمَلًا)۔ اور اللہ نے اسے دو حصوں میں تقسیم کیا: ایک حصہ جسے حکمی سیاست (السياسة الحكمية) کہا جاتا ہے، جسے اللہ نے لوگوں کے اکابر کے نفوس کی فطرتوں میں القا کیا، تو انہوں نے حدود مقرر کیں اور نوامیس (قوانین) وضع کیے، اس قوت کے ساتھ جو انہوں نے اپنے نفوس میں پائی، ہر شہر، علاقے اور اقلیم کے مزاج اور طبائع کے مطابق، اس علم کی بنا پر جو حکمت کا تقاضا کرتا ہے۔ پس اس سے لوگوں کے اموال، ان کے خون، ان کے اہل و عیال، ان کے رشتوں اور ان کے نسب کی حفاظت ہوئی۔ اور انہوں نے انہیں نوامیس (نواميس) کا نام دیا، جس کا مطلب ہے خیر کے اسباب، کیونکہ ناموس اصطلاحی عرف میں وہ ہے جو خیر لائے، اور جاسوس شر میں استعمال ہوتا ہے۔\n\nپس یہ وہ حکمی نوامیس ہیں جنہیں عقلمندوں نے اللہ کے الہام سے وضع کیا، اس حال میں کہ وہ خود نہیں جانتے تھے، عالم کی مصلحتوں، اس کے نظم اور اس کے باہمی ربط کے لیے، ان جگہوں پر جہاں ان کے پاس کوئی نازل شدہ الٰہی شریعت نہیں تھی۔ اور ان نوامیس کو وضع کرنے والوں کو یہ علم نہیں تھا کہ یہ امور اللہ کے قریب کرنے والے ہیں، اور نہ ہی یہ جنت یا جہنم یا آخرت کے کسی سبب کا باعث بنیں گے۔ اور نہ ہی وہ جانتے تھے کہ موت کے بعد طبعی اجسام میں کوئی آخرت اور محسوس بعث (دوبارہ اٹھنا) ہے، اور کوئی ایسا گھر ہے جہاں کھانا، پینا، لباس، نکاح اور خوشی ہے، اور کوئی ایسا گھر ہے جہاں عذاب اور درد ہے۔ کیونکہ ان کا وجود ممکن ہے اور ان کا عدم بھی ممکن ہے، اور ان کے پاس دونوں ممکنات میں سے کسی ایک کو ترجیح دینے کی کوئی دلیل نہیں تھی۔ بلکہ **\"یہ رہبانیت انہوں نے خود ایجاد کر لی تھی\"** (رَهْبانِيَّةً ابْتَدَعُوها)۔\n\nاسی لیے ان کے نوامیس اور مصلحتوں کی بنیاد اس دنیا میں صلاح (بھلائی) کو باقی رکھنے پر تھی۔ پھر وہ اپنے نفوس میں الٰہی علوم میں منفرد ہو گئے، جیسے اللہ کی توحید، اور جو کچھ اس کے جلال کے لیے تعظیم، تقدیس، تنزیہ کی صفات، اور مثل و تشبیہ کے عدم کے لحاظ سے مناسب ہے۔ اور جس نے یہ جانا اس نے اسے سکھایا جو نہیں جانتا تھا، اور لوگوں کو صحیح غور و فکر کی ترغیب دی، اور انہیں بتایا کہ عقول کے لیے ان کے افکار کے لحاظ سے ایک حد ہے جہاں وہ رک جاتے ہیں اور اس سے تجاوز نہیں کر سکتے۔ اور یہ کہ اللہ کی طرف سے اس کے بعض بندوں کے دلوں پر ایک الٰہی فیض ہوتا ہے جس میں وہ انہیں اپنے پاس سے علم سکھاتا ہے، اور انہوں نے اسے بعید نہیں سمجھا۔ اور یہ کہ اللہ نے عالمِ علوی میں کچھ امور ودیعت رکھے ہیں جن پر انہوں نے عالمِ عنصری میں ان کے آثار کے وجود سے استدلال کیا، اور یہ اللہ تعالیٰ کا قول ہے: **\"اور اس نے ہر آسمان میں اس کا امر وحی کر دیا\"** (وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها)۔\n\nپس انہوں نے اپنے نفوس کی حقیقتوں کی تحقیق کی، جب انہوں نے دیکھا کہ جب جسمانی صورت مر جاتی ہے تو اس کے اعضاء میں کوئی کمی نہیں آتی، تو انہوں نے جانا کہ اس جسم کو ادراک کرنے والا اور حرکت دینے والا کوئی دوسرا امر ہے جو اس پر زائد ہے۔ پس انہوں نے اس زائد امر کی تحقیق کی اور اپنے نفوس کو پہچانا۔ پھر انہوں نے دیکھا کہ وہ جانتا ہے جب کہ وہ پہلے جاہل تھا، تو انہوں نے جانا کہ اگرچہ وہ اپنے اجسام سے زیادہ اشرف ہیں، لیکن فقر اور محتاجی ان کے ساتھ ہے۔ پس انہوں نے ایک چیز سے دوسری چیز کی طرف نظر کے ذریعے استدلال کیا، اور جب بھی وہ کسی چیز تک پہنچے تو اسے کسی دوسری چیز کا محتاج پایا، یہاں تک کہ ان کی نظر ایک ایسی چیز پر ختم ہوئی جو کسی چیز کی محتاج نہیں، اور نہ اس کی مثل کوئی چیز ہے، اور نہ وہ کسی چیز سے مشابہت رکھتی ہے اور نہ کوئی چیز اس سے مشابہت رکھتی ہے۔ پس وہ اس پر ٹھہر گئے اور کہا: یہ الاول (پہلا) ہے، اور اسے اپنی ذات کے اعتبار سے واحد ہونا چاہیے، اور اس کی اولیت نہ ثانی کو قبول کرتی ہے اور نہ اس کی احدیت کو، کیونکہ اس کی کوئی شبیہ نہیں اور نہ کوئی مناسبت۔ پس انہوں نے اس کی توحیدِ وجود (توحيد وجود) کی۔ پھر جب انہوں نے دیکھا کہ ممکنات اپنی ذات کے لیے ترجیح نہیں پاتیں، تو انہوں نے جانا کہ اس واحد نے انہیں وجود عطا کیا ہے، پس وہ اس کے محتاج ہوئے اور اس کی تعظیم کی اس طرح کہ انہوں نے اس سے وہ تمام صفات سلب کر لیں جن سے وہ اپنی ذاتوں کو متصف کرتے ہیں۔ پس یہ عقل کی حد ہے۔\n\n### [شرعی سیاست اور الٰہی نوامیس]\n\nجب وہ اسی حال میں تھے، تو ان کی جنس کا ایک شخص کھڑا ہوا، جس کی ان کے نزدیک علم میں ایسی کوئی حیثیت نہیں تھی کہ وہ اس کے بارے میں یہ اعتقاد رکھیں کہ وہ صحیح فکر اور درست نظر کا مالک ہے، تو اس نے ان سے کہا: میں تمہاری طرف اللہ کا رسول ہوں۔ انہوں نے کہا: انصاف اولیٰ ہے، اس کے دعوے پر غور کرو، کیا اس نے کسی ممکن چیز کا دعویٰ کیا ہے یا کسی محال چیز کا؟\n\nانہوں نے کہا: ہمارے نزدیک دلیل سے یہ ثابت ہو چکا ہے کہ اللہ کی طرف سے ایک الٰہی فیض ہوتا ہے جسے وہ جسے چاہتا ہے عطا کر سکتا ہے، جیسا کہ اس نے یہ فیض ان افلاک کی روحوں اور ان عقول پر نازل کیا ہے۔ اور سب امکان میں شریک ہیں، اور ممکنات میں سے بعض بعض سے زیادہ اولیٰ نہیں ہیں اس چیز میں جو ممکن ہے۔ پس اب ہمارے لیے صرف اس مدعی کے سچ یا جھوٹ پر غور کرنا باقی ہے، اور ہم ان دونوں حکموں میں سے کسی پر بھی دلیل کے بغیر اقدام نہیں کریں گے، کیونکہ یہ ہمارے علم کے ساتھ سوءِ ادب ہے۔\n\nانہوں نے کہا: کیا تمہارے پاس اپنے دعوے کی سچائی پر کوئی دلیل ہے؟ پس وہ ان کے پاس دلائل لے کر آیا۔ انہوں نے اس کی دلالت اور اس کے دلائل پر غور کیا، اور انہوں نے دیکھا کہ اس شخص کے پاس ان چیزوں کی کوئی خبر نہیں جو افکار پیدا کرتی ہیں، اور نہ ہی اس سے یہ معلوم ہوا تھا۔ پس انہوں نے جانا کہ جس نے **\"ہر آسمان میں اس کا امر وحی کیا\"** (أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها)، وہ ان چیزوں میں سے تھا جو اس نے اس شخص کے وجود اور اس کی لائی ہوئی چیز میں وحی کی تھیں۔ پس وہ تیزی سے اس پر ایمان لائے اور اس کی تصدیق کی، اور جان لیا کہ اللہ نے اسے ان معارف پر مطلع کیا ہے جو اس نے عالمِ علوی میں ودیعت رکھے ہیں، جہاں تک ان کی افکار نہیں پہنچ سکی تھیں۔ پھر اس نے انہیں اللہ کی معرفت کا وہ حصہ عطا کیا جو ان کے پاس نہیں تھا۔ اور انہوں نے دیکھا کہ وہ اللہ کی معرفت میں کمزور رائے والے عامی کے لیے اس کے عقل کے لیے مناسب حد تک نازل ہوتا ہے، اور صحیح نظر والے بڑے عقل والے کے لیے اس کے عقل کے لیے مناسب حد تک نازل ہوتا ہے۔\n\nپس انہوں نے جانا کہ اس شخص کے پاس الٰہی فیض کا وہ حصہ ہے جو عقل کی حد سے ماورا ہے، اور یہ کہ اللہ نے اسے اپنے بارے میں اور اپنی قدرت کے بارے میں وہ علم عطا کیا ہے جو انہیں نہیں دیا تھا۔ پس انہوں نے اس کی فضیلت اور ان پر اس کی برتری کو تسلیم کیا، اس پر ایمان لائے، اس کی تصدیق کی اور اس کی پیروی کی۔ پس اس نے ان کے لیے اللہ کے قریب کرنے والے افعال مقرر کیے، اور انہیں ان ممکنات کے بارے میں بتایا جو اللہ نے پیدا کیے اور جو ان سے غائب تھے، اور جو کچھ مستقبل میں اللہ ان کے ساتھ کرے گا۔ اور وہ ان کے پاس بعث (دوبارہ اٹھنا)، نشور (پھیلنا)، حشر، جنت اور جہنم کی خبر لایا۔\n\n### [عالم میں الٰہی شریعت کے وضع کی اصل]\n\nپھر مختلف زمانوں اور مختلف حالات میں رسولوں کا سلسلہ جاری رہا، اور ان میں سے ہر ایک نے اپنے ساتھی کی تصدیق کی، وہ ان اصولوں میں کبھی اختلاف نہیں کرتے تھے جن پر انہوں نے بھروسہ کیا اور جن کی انہوں نے تعبیر کی، اگرچہ احکام مختلف تھے۔ پس شرائع نازل ہوئیں اور احکام نازل ہوئے، اور حکم زمانے اور حال کے مطابق تھا، جیسا کہ اللہ تعالیٰ نے فرمایا: **\"تم میں سے ہر ایک کے لیے ہم نے ایک شریعت اور ایک طریقہ مقرر کیا\"** (لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً)۔\n\nپس ان کے اصولوں میں اتفاق تھا اور کسی چیز میں کوئی اختلاف نہیں تھا۔ اور انہوں نے ان نبوی شرعی سیاستوں میں جو اللہ کی طرف سے مشروع کی گئی تھیں، اور ان حکمی سیاستوں میں جو حکماء نے اپنے غور و فکر سے وضع کی تھیں، فرق کیا، اور جانا کہ یہ امر زیادہ مکمل ہے اور بلا شبہ اللہ کی طرف سے ہے۔ پس انہوں نے ان غیبی امور کو قبول کیا جن کی خبر انہیں دی گئی تھی، اور رسولوں پر ایمان لائے۔ اور ان میں سے کسی نے بھی عبادت نہیں کی سوائے اس کے جس نے اپنے علم میں اپنے نفس کی خیر خواہی نہیں کی اور اپنی خواہش کی پیروی کی، اور اپنی جنس کے بیٹوں پر سرداری طلب کی، اور اپنے نفس اور اپنی قدر کو نہ جانا اور اپنے رب کو نہ جانا۔\n\nپس عالم میں شریعت کے وضع کی اصل اور اس کا سبب عالم کی اصلاح کی طلب اور اللہ کے بارے میں اس چیز کی معرفت تھی جسے عقل نہیں جانتی تھی، یعنی عقل اپنے غور و فکر کے لحاظ سے اس میں خود مختار نہیں تھی۔ پس نازل شدہ کتابیں اس معرفت کے ساتھ نازل ہوئیں اور رسولوں اور انبیاء علیہم السلام کی زبانوں نے اس کا اعلان کیا۔ پس عقلمندوں نے اس وقت جانا کہ اللہ کے علم میں ان کی کمی تھی جسے رسولوں نے ان کے لیے مکمل کر دیا۔\n\n### [حقیقی عقلمند اور قلقلہ، جدل اور کلام والے]\n\nاور میں عقلمندوں سے مراد آج کے حکمت میں کلام کرنے والے نہیں لیتا، بلکہ میں عقلمندوں سے مراد وہ لیتا ہوں جو ان کے طریقے پر تھے، یعنی اپنے نفس کے ساتھ مشغول رہنا، ریاضتیں، مجاہدات، خلوتیں، اور ان واردات کے لیے تیار رہنا جو ان کے دلوں میں ان کی صفائی کے وقت عالمِ علوی سے آتے ہیں جو بلند آسمانوں میں وحی کیا گیا ہے۔ پس میں ان لوگوں کو عقلمند کہتا ہوں۔\n\nکیونکہ قلقلہ (زبان ہلانے)، کلام اور جدل والے، جنہوں نے اپنی افکار کو ان الفاظ کے مواد میں استعمال کیا جو اوائل سے صادر ہوئے تھے، اور وہ اس امر سے غافل رہے جہاں سے ان لوگوں نے وہ الفاظ لیے تھے۔ اور آج ہمارے پاس جو ان جیسے لوگ ہیں، ان کی کسی بھی عقلمند کے نزدیک کوئی قدر نہیں ہے، کیونکہ وہ دین کا مذاق اڑاتے ہیں اور اللہ کے بندوں کو حقیر سمجھتے ہیں، اور ان کے نزدیک صرف وہی شخص عظیم ہوتا ہے جو ان کے راستے پر ہو۔ دنیا کی محبت اور جاہ و سرداری کی طلب ان کے دلوں پر غالب آ چکی ہے، پس اللہ نے انہیں ذلیل کر دیا جیسا کہ انہوں نے علم کو ذلیل کیا، اور انہیں حقیر اور چھوٹا کر دیا، اور انہیں بادشاہوں اور جاہل حکمرانوں کے دروازوں پر جانے پر مجبور کر دیا، پس بادشاہوں اور حکمرانوں نے انہیں ذلیل کیا۔\n\nپس ایسے لوگوں کی بات قابلِ اعتبار نہیں، کیونکہ اللہ نے ان کے دلوں پر مہر لگا دی ہے، اور **\"انہیں بہرا کر دیا ہے اور ان کی آنکھوں کو اندھا کر دیا ہے\"** (فَأَصَمَّهُمْ وأَعْمى‏ أَبْصارَهُمْ)، اس بڑے دعوے کے باوجود کہ وہ اپنے نفوس کے نزدیک دنیا میں سب سے افضل ہیں۔ پس اللہ کے دین میں فتویٰ دینے والا فقیہ، اپنے کم ورع کے باوجود، ہر لحاظ سے ان سے بہتر حال میں ہے۔ کیونکہ ایمان والا شخص، اگرچہ اس نے اسے تقلیداً لیا ہو، وہ ان عقلمندوں سے، ان کے زعم کے مطابق، بہتر حال میں ہے۔ اور عقلمند اس صفت کا حامل ہونے سے پاک ہے۔\n\nاور ہم نے ان لوگوں میں سے تھوڑے سے لوگوں کو پایا جو ان کے حال پر تھے، اور وہ رسولوں کی قدر و منزلت کو سب سے زیادہ جاننے والے تھے، اور رسول اللہ صلی اللہ علیہ وسلم کی سنتوں کی سب سے زیادہ پیروی کرنے والے تھے، اور ان کی سنتوں کی حفاظت کرنے میں سب سے زیادہ سخت تھے۔ وہ حق کے جلال کے لیے تعظیم کے تقاضوں کو جاننے والے تھے، اور اس علم کو جاننے والے تھے جو اللہ نے اپنے بندوں میں سے نبیوں اور ان کے پیروکاروں میں سے اولیاء کو عطا کیا ہے، جو اللہ کی طرف سے خصوصی الٰہی فیض کے ذریعے حاصل ہوتا ہے، جو درس اور اجتہاد کے معمول کے سیکھنے سے باہر ہے۔ یہ وہ علم ہے جہاں تک عقل اپنی فکر کے لحاظ سے نہیں پہنچ سکتی۔\n\nاور میں نے ان کے ایک بڑے شخص کو سنا، جب اس نے وہ دیکھا جو اللہ نے مجھ پر اپنی معرفت کے علم سے کھولا تھا، بغیر غور و فکر یا پڑھنے کے، بلکہ ایک خلوت سے جو میں نے اللہ کے ساتھ کی تھی، اور میں طالب علموں میں سے نہیں تھا، تو اس نے کہا: \"الحمد للہ، میں ایسے زمانے میں ہوں جہاں میں نے اسے دیکھا جسے اللہ نے اپنی طرف سے رحمت عطا کی اور اسے اپنے پاس سے علم سکھایا۔\" پس **\"اللہ اپنی رحمت کے لیے جسے چاہتا ہے خاص کر لیتا ہے، اور اللہ بڑے فضل والا ہے\"** (يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ)۔ اور **\"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\"** (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب شصت و ششم در معرفت سر شریعت از ظاهر و باطن و اینکه کدام اسم الهی آن را ایجاد کرده است.\n\nجلیل (خداوند) از جلیل (بنده) جلال طلبید، *** اما جلیل (بنده) از مشاهده جلال (الهی) سر باز زد.\nچون بنده خدا عزت وجود الهی را دید، *** با ناز و دلال (بر خدا) همراه شد.\nو با نفس خود مطمئن شد، در حالی که عزیز، جبار، متکبر و خودپسند بود.\n(خداوند) شریعتی معصوم را به او رساند، *** پس سلطنت آن شریعت او را خوار و ذلیل ساخت.\nبندگان با فقر و خواری ندا دادند: *** ای کسی که بزرگی‌اش مبارک و متعالی است.\n\n### [اسماء الهی، زبان حال حقایقی هستند که آنها را عطا می‌کنند]\n\nخداوند عز و جل فرمود: «بگو اگر در زمین فرشتگانی بودند که با اطمینان راه می‌رفتند، قطعاً از آسمان فرشته‌ای را به عنوان رسول بر آنان نازل می‌کردیم.» (قُلْ لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا) و فرمود: «و ما عذاب‌کننده نبودیم مگر آنکه رسولی بفرستیم.» (وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا)\n\nپس بدان که اسماء الهی (الأسماء الإلهية) زبان حال حقایقی هستند که آنها را عطا می‌کنند. پس به آنچه می‌شنوی توجه کن و کثرت یا اجتماع وجودی را توهم مکن. بلکه در این باب، ترتیب حقایق معقول بسیاری را از جهت نسبت‌ها (نسب) آورده‌ایم، نه از جهت وجود عینی. زیرا ذات حق (ذات الحق) از آن حیث که ذات است، واحد است. سپس چون از وجود، فقر و امکان خود دانستیم که ناگزیر باید مرجّحی داشته باشیم که به او تکیه کنیم، و آن مستند ناگزیر باید وجود ما را از نسبت‌های مختلفی طلب کند که شارع از آنها به اسماء حسنی تعبیر کرده است. پس خداوند به واسطه متکلم بودن در مرتبه وجوبی وجود الهی‌اش که مشارکت در آن صحیح نیست، به این اسماء نامیده شده است، زیرا او خدایی یگانه است و خدایی جز او نیست.\n\n### [اجتماع اسماء در حضرت مسمّی و ظهور احکام آنها]\n\nپس از این تقریر، در ابتدای این امر و تأثیر و ترجیح در عالم ممکن، می‌گویم که اسماء در حضرت مسمّی (حضور مسمّی) گرد آمدند و در حقایق و معانی خود نگریستند و ظهور احکام خود را طلب کردند تا اعیان آنها به واسطه آثارشان متمایز شوند. زیرا خالق که همان مقدّر، عالم، مدبّر، مفصّل، باری، مصوّر، رزّاق، محیی، ممیت، وارث و شکور است و تمامی اسماء الهی (الأسماء الإلهية)، در ذوات خود نگریستند و مخلوق، مدبَّر، مفصَّل، مصوَّر و مرزوقی ندیدند. پس گفتند: چه باید کرد تا این اعیان که احکام ما در آنها ظاهر می‌شود، پدید آیند و سلطنت ما آشکار گردد؟ پس اسماء الهی که برخی از حقایق عالم پس از ظهور عینشان آنها را می‌طلبند، به اسم باری پناه بردند و به او گفتند: شاید این اعیان را ایجاد کنی تا احکام ما ظاهر شود و سلطنت ما تثبیت گردد، زیرا حضرتی که ما در آن هستیم، تأثیر ما را نمی‌پذیرد. باری گفت: این امر به اسم قادر باز می‌گردد، زیرا من تحت احاطه او هستم.\n\n### [ممکنات در حال عدمشان و چگونگی ظهور اعیان آنها]\n\nو اصل این امر آن بود که ممکنات در حال عدمشان، با زبان حال ذلت و فقر، از اسماء الهی (الأسماء الإلهية) درخواست کردند و به آنها گفتند: عدم ما را از درک یکدیگر و از معرفت حقی که شما بر ما دارید، کور کرده است. پس اگر اعیان ما را ظاهر سازید و جامه هستی (الوجود) بر ما بپوشانید، بر ما منت نهاده‌اید و ما نیز به آنچه از اجلال و تعظیم برای شما شایسته است، قیام می‌کنیم. و سلطنت شما نیز با ظهور ما بالفعل صحیح می‌گردد، در حالی که امروز شما بر ما سلاطین بالقوه و صلاحیت هستید. پس این چیزی که از شما می‌خواهیم، در حق شما بیشتر است تا در حق ما. اسماء گفتند: آنچه ممکنات گفتند صحیح است. پس برای طلب آن به حرکت درآمدند. چون به اسم قادر پناه بردند، قادر گفت: من تحت احاطه مريد هستم، پس هیچ عینی از شما را ایجاد نمی‌کنم مگر به اختصاص او. و ممکن، خود را در اختیار من قرار نمی‌دهد مگر آنکه امر آمر از جانب پروردگارش به او برسد. پس هرگاه او را به تکوین امر کند و بگوید «کُن» (باش)، ممکن خود را در اختیار من قرار می‌دهد و من به ایجاد او تعلق می‌گیرم و در همان لحظه او را ایجاد می‌کنم. پس به اسم مريد پناه ببرید، شاید او جانب هستی (الوجود) را بر جانب عدم ترجیح دهد و اختصاص بخشد. در آن صورت، من و آمر و متکلم گرد هم می‌آییم و شما را ایجاد می‌کنیم. پس به اسم مريد پناه بردند و به او گفتند: ما از اسم قادر خواستیم که اعیان ما را ایجاد کند، اما او امر را به تو واگذار کرد. چه دستوری می‌دهی؟ مريد گفت: قادر راست گفته است، اما من خبری ندارم که حکم اسم عالم در مورد شما چیست؟ آیا علم او به ایجاد شما سبقت گرفته است تا اختصاص دهم یا سبقت نگرفته است؟ زیرا ما تحت احاطه اسم عالم هستیم. پس به سوی او بروید و قضیه خود را با او در میان بگذارید. پس به سوی اسم عالم رفتند و آنچه را اسم مريد گفته بود، بیان کردند. عالم گفت: مريد راست گفته است و علم من به ایجاد شما سبقت گرفته است، اما ادب سزاوارتر است، زیرا ما حضرتی (حضرة) داریم که بر ما مهیمن است و آن اسم «الله» است. پس ناگزیر باید نزد او حاضر شویم، زیرا آن حضرتِ جمع است. پس همه اسماء در حضرت الله گرد آمدند. الله فرمود: شما را چه شده است؟ آنها خبر را بازگو کردند. الله فرمود: من اسم جامعی برای حقایق شما هستم و دلیلی بر مسمّایی هستم که ذاتی مقدس است و دارای صفات کمال و تنزیه است. پس بایستید تا من بر مدلول خود وارد شوم. پس بر مدلول خود وارد شد و آنچه را ممکنات گفته بودند و آنچه اسماء در آن گفتگو کرده بودند، به او گفت. (ذات) فرمود: خارج شو و به هر یک از اسماء بگو که به آنچه حقیقتش در ممکنات اقتضا می‌کند، تعلق گیرد. زیرا من از حیث خودم، واحد برای خودم هستم، و ممکنات تنها مرتبه مرا می‌طلبند و مرتبه من نیز آنها را می‌طلبد. و اسماء الهی (الأسماء الإلهية) همگی برای مرتبه هستند، نه برای من، مگر اسم «الواحد» (واحد) که اسمی مخصوص به من است و هیچ کس، نه از اسماء، نه از مراتب و نه از ممکنات، در حقیقت آن از هر جهت با من شریک نیست.\n\n### [ترازوی معلوم، حدّ ترسیم شده و امام معصوم]\n\nپس اسم الله خارج شد و اسم متکلم همراه او بود تا از جانب او برای ممکنات و اسماء ترجمه کند. پس آنچه را مسمّی فرموده بود، برایشان بازگو کرد. در نتیجه، عالم و مريد و قائل و قادر به کار خود تعلق گرفتند و اولین ممکن از ممکنات با اختصاص مريد و حکم عالم ظاهر شد. چون اعیان و آثار در کائنات ظاهر شدند و برخی بر برخی دیگر تسلط یافتند و برخی، برخی دیگر را بر اساس اسمایی که به آنها استناد می‌کردند، مقهور ساختند، این امر به نزاع و خصومت انجامید. پس گفتند: ما می‌ترسیم که نظام ما فاسد شود و به عدمی که در آن بودیم، بازگردیم. پس ممکنات، اسماء را به آنچه اسم علیم و مدبر به آنها القا کرده بود، آگاه ساختند و گفتند: ای اسماء، اگر حکم شما بر اساس ترازوی معلوم و حدّ ترسیم شده‌ای باشد که به امامی (الإمام) رجوع کنید که وجود ما را حفظ کند و ما نیز تأثیرات شما را در خود حفظ کنیم، برای ما و شما بهتر خواهد بود. پس به الله پناه ببرید، شاید کسی را مقدم بدارد که برای شما حدی تعیین کند تا در آن توقف کنید، وگرنه ما هلاک می‌شویم و شما نیز معطل می‌مانید. اسماء گفتند: این عین مصلحت و عین رأی است. پس چنین کردند. گفتند: اسم مدبر است که امر شما را به پایان می‌رساند، پس امر را به مدبر ارجاع دهید. مدبر گفت: من برای این کار هستم. پس وارد شد و با امر حق (الحق) نزد اسم رب (الرب) خارج شد و به او گفت: آنچه را مصلحت در بقای اعیان این ممکنات اقتضا می‌کند، انجام ده. پس (رب) دو وزیر برگزید تا او را در آنچه بدان امر شده بود، یاری کنند: وزیر اول اسم مدبر و وزیر دیگر مفصّل. خداوند متعال فرمود: «امر را تدبیر می‌کند و آیات را تفصیل می‌دهد، باشد که شما به لقای پروردگارتان یقین کنید.» (يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ لَعَلَّكُمْ بِلِقاءِ رَبِّكُمْ تُوقِنُونَ) که او همان امام است. پس بنگر که کلام خداوند متعال چقدر محکم است که با لفظی مطابق با حالی که امر باید بر آن باشد، آمده است.\n\n### [سیاست حکمیه و نوامیس وضعی]\n\nپس اسم رب (الرب) برای آنها حدود را تعیین کرد و مراسم را برای اصلاح مملکت وضع نمود تا آنان را بیازماید که «کدامشان نیکوکارترند.» (أَيُّهُمْ أَحْسَنُ عَمَلًا) و خداوند این امر را بر دو بخش قرار داد: بخشی که سیاست حکمیه نامیده می‌شود و آن را در فطرت نفوس بزرگان مردم القا کرد. پس آنان حدودی را تعیین کردند و نوامیسی را با قدرتی که در نفوس خود یافتند، وضع نمودند؛ هر شهر، ناحیه و اقلیمی بر حسب آنچه مزاج و طبایع آن ناحیه اقتضا می‌کرد، به دلیل علمشان به آنچه حکمت عطا می‌کند. در نتیجه، اموال مردم، خون‌هایشان، خانواده‌هایشان، ارحامشان و انسابشان حفظ شد و آنها را نوامیس نامیدند که معنای آن اسباب خیر است، زیرا ناموس در عرف اصطلاحی کسی است که خیر می‌آورد و جاسوس در شر به کار می‌رود. پس اینها نوامیس حکمیه‌ای هستند که عقلا از الهام خداوند، در حالی که خود نمی‌دانستند، برای مصالح عالم و نظم و ارتباط آن در مواضعی وضع کردند که در آنجا شریعت الهی نازل شده‌ای وجود نداشت. و واضعان این نوامیس نمی‌دانستند که این امور، مقرب به سوی خدا هستند یا موجب بهشت و دوزخ یا چیزی از اسباب آخرت می‌شوند، و نمی‌دانستند که آخرت و بعث محسوس پس از مرگ در اجسام طبیعی و سرایی که در آن خوردن و نوشیدن و پوشیدن و نکاح و شادی است و سرایی که در آن عذاب و دردهاست، وجود دارد. زیرا وجود آن ممکن است و عدم آن نیز ممکن، و دلیلی برای ترجیح یکی از این دو ممکن نداشتند، بلکه «رهبانیتی را از پیش خود ابداع کردند.» (رَهْبانِيَّةً ابْتَدَعُوها) به همین دلیل، بنای نوامیس و مصالح آنها بر حفظ صلاح در این دنیا بود. سپس در نفوس خود به علوم الهی از توحید خداوند و آنچه برای جلال او از تعظیم و تقدیس و صفات تنزیه و عدم مثل و تشبیه شایسته است، پرداختند. و کسی که می‌دانست، آن را به کسی که نمی‌دانست، آگاه ساخت و مردم را به نظر صحیح ترغیب کردند و به آنها اعلام نمودند که عقول از حیث افکارشان، حدی دارند که باید در آن توقف کنند و از آن تجاوز نکنند، و اینکه خداوند بر قلوب برخی از بندگانش فیض الهی (فیضاً إلهیاً) دارد که در آن از نزد خود به آنها علم می‌آموزد، و این امر نزد آنها بعید نبود. و اینکه خداوند در عالم علوی اموری را به ودیعه نهاده است که با وجود آثارشان در عالم عنصری بر آنها استدلال کردند، و این همان قول خداوند متعال است که: «و در هر آسمانی امر آن را وحی کرد.» (وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها) پس به جستجوی حقایق نفوس خود پرداختند، زیرا دیدند که وقتی صورت جسمانی می‌میرد، چیزی از اعضای آن کم نمی‌شود. پس دانستند که درک‌کننده و محرک این جسد، امری دیگر و زائد بر آن است. پس به جستجوی آن امر زائد پرداختند و نفوس خود را شناختند. سپس دیدند که پس از جهل، علم پیدا می‌کند، پس دانستند که اگرچه نفوس از اجسادشان شریف‌ترند، اما فقر و فاقه با آنها همراه است. پس با نظر از چیزی به چیز دیگر استدلال کردند و هرگاه به چیزی می‌رسیدند، آن را نیازمند به چیز دیگری می‌دیدند تا اینکه نظرشان به چیزی منتهی شد که به هیچ چیز نیازمند نیست و هیچ چیز مانند او نیست و به چیزی شباهت ندارد و چیزی به او شباهت ندارد. پس نزد او توقف کردند و گفتند: این همان اول است و شایسته است که از حیث ذاتش، واحد برای ذاتش باشد و اولیت او، دومی را نمی‌پذیرد و احدیت او نیز، زیرا او شبیه و مناسبی ندارد. پس او را توحید وجودی (توحید وجود) کردند. سپس چون دیدند که ممکنات به خودی خود ترجیح نمی‌یابند، دانستند که این واحد، هستی (الوجود) را به آنها افاضه کرده است. پس به او نیازمند شدند و او را با سلب کردن تمام آنچه ذوات خود را بدان وصف می‌کنند، تعظیم نمودند. این حدّ عقل است.\n\n### [سیاست شرعیه و نوامیس الهی]\n\nدر حالی که آنها چنین بودند، شخصی از جنس خودشان برخاست که نزد آنها از نظر علمی چنان جایگاهی نداشت که معتقد باشند او صاحب فکر صحیح و نظر درست است. پس به آنها گفت: من فرستاده خدا به سوی شما هستم. گفتند: انصاف سزاوارتر است. در اصل ادعای او بنگرید، آیا چیزی ممکن را ادعا کرده یا چیزی محال را؟ گفتند: نزد ما با دلیل ثابت شده است که خداوند فیض الهی (فیضاً إلهیاً) دارد که جایز است آن را به هر که بخواهد ببخشد، همان‌گونه که آن را بر ارواح این افلاک و این عقول افاضه کرده است. و همه در امکان مشترک هستند و برخی از ممکنات در آنچه ممکن است، بر برخی دیگر اولویت ندارند. پس نظر ما تنها در صدق یا کذب این مدعی باقی می‌ماند و بدون دلیل بر هیچ یک از این دو حکم پیشی نمی‌گیریم، زیرا این سوء ادب نسبت به علم ماست. پس گفتند: آیا دلیلی بر صدق ادعای خود داری؟ او دلایل را برایشان آورد. پس در دلالت و ادله او نگریستند و دیدند که این شخص خبری از آنچه افکار تولید می‌کنند، ندارد و از او شناخته نشده است. پس دانستند که آنکه «در هر آسمانی امر آن را وحی کرد» (أَوْحى‏ في كُلِّ سَماءٍ أَمْرَها)، وجود این شخص و آنچه آورده است، نیز از جمله اموری بود که در هر آسمانی وحی کرده است. پس به سرعت به او ایمان آوردند و او را تصدیق کردند و دانستند که خداوند او را بر آنچه از معارف در عالم علوی به ودیعه نهاده است و افکارشان به آن نرسیده بود، مطلع ساخته است. سپس از معرفت (المعرفة) به خداوند چیزی به او عطا کرد که نزد آنها نبود. و دیدند که او در معارف الهی، برای عامی ضعیف‌الرأی به اندازه‌ای که برای عقلش مناسب است، و برای صاحب عقل بزرگ و نظر صحیح به اندازه‌ای که برای عقلش مناسب است، تنزل می‌کند. پس دانستند که این مرد از فیض الهی (الفیض الإلهي) چیزی دارد که فراتر از طور عقل است و خداوند از علم به خود و قدرت بر خود، چیزی به او عطا کرده است که به آنها نداده است. پس به فضل و تقدم او بر خود اقرار کردند و به او ایمان آوردند و تصدیقش کردند و از او پیروی نمودند. پس او اعمالی را که مقرب به سوی خداوند متعال است، برایشان تعیین کرد و آنها را از آنچه خداوند از ممکنات در غیاب آنها خلق کرده است و آنچه در آینده از جانب او در مورد آنها خواهد بود، آگاه ساخت و بعث و نشور و حشر و بهشت و دوزخ را برایشان آورد.\n\n### [اصل وضع شریعت الهی در عالم]\n\nسپس رسولان پی در پی آمدند، با اختلاف زمان‌ها و اختلاف احوال، و هر یک دیگری را تصدیق می‌کرد. آنها هرگز در اصول (الأصول) که به آنها استناد کرده و از آنها تعبیر نموده‌اند، اختلاف نکردند، اگرچه احکام متفاوت بود. پس شرایع نازل شدند و احکام فرود آمدند، و حکم بر حسب زمان و حال بود، چنانکه خداوند متعال فرمود: «برای هر یک از شما شریعت و راهی قرار دادیم.» (لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً) پس اصول آنها بدون هیچ اختلافی در چیزی از آن، متفق بود. و در این سیاست‌های نبوی که از جانب خداوند مشروع شده بود، بین آنها و سیاست‌های حکمیه‌ای که حکما وضع کرده بودند و نظرشان آن را اقتضا کرده بود، تفاوت قائل شدند و دانستند که این امر کامل‌تر است و بدون شک از جانب خداوند است. پس آنچه را که (رسولان) از غیوب به آنها خبر دادند، پذیرفتند و به رسولان ایمان آوردند. و هیچ کس از آنها (عقلا) انکار نکرد، مگر کسی که در علم خود خیرخواه نفس خویش نبود و از هوای نفس خود پیروی کرد و ریاست بر هم‌نوعان خود را طلبید و نفس و قدر خود و پروردگارش را نشناخت. پس اصل وضع شریعت در عالم و سبب آن، طلب صلاح عالم و معرفت (المعرفة) به آنچه از خداوند مجهول بود و عقل آن را نمی‌پذیرفت (یعنی عقل از حیث نظر خود به تنهایی قادر به درک آن نبود)، بود. پس کتب نازل شده با این معرفت (المعرفة) فرود آمدند و زبان‌های رسولان و انبیا علیهم السلام به آن نطق کردند. پس عقلا در آن هنگام دانستند که نقص آنها در علم به خداوند، اموری بوده است که رسولان آن را برایشان تکمیل کردند.\n\n### [عقلای حقیقی و اصحاب لقلقه، جدل و کلام]\n\nو منظور من از عقلا، متکلمانی که امروز در حکمت سخن می‌گویند، نیست؛ بلکه منظورم از عقلا کسانی هستند که بر طریقه (طریقت) آنان (حکمای پیشین) بودند، از قبیل اشتغال به نفس، ریاضت‌ها، مجاهدات، خلوت‌ها و آمادگی برای وارداتی که هنگام صفای قلبشان از عالم علوی که در آسمان‌های بالا وحی شده است، به آنها می‌رسد. منظور من از عقلا این افراد هستند. زیرا اصحاب لقلقه (پرگویی)، کلام و جدل که افکار خود را در مواد الفاظی به کار بردند که از اوائل صادر شده بود و از امری که آن مردان (اوائل) آن الفاظ را از آن گرفته بودند، غافل ماندند. اما امثال این افراد که امروز نزد ما هستند، نزد هیچ عاقلی قدر و منزلتی ندارند، زیرا به دین استهزا می‌کنند و بندگان خدا را سبک می‌شمارند و نزد آنها جز کسی که با ایشان بر همان روش است، بزرگ شمرده نمی‌شود. حب دنیا و طلب جاه و ریاست بر قلوبشان مستولی شده است، پس خداوند آنها را خوار ساخت، همان‌گونه که علم را خوار شمردند، و آنها را حقیر و کوچک کرد و به درگاه پادشاهان و حاکمان جاهل محتاج ساخت، پس پادشاهان و حاکمان نیز آنها را خوار کردند. پس قول امثال این افراد اعتباری ندارد، زیرا خداوند بر دل‌هایشان مهر نهاده و «آنان را کر و دیدگانشان را کور کرده است.» (فَأَصَمَّهُمْ وأَعْمى‏ أَبْصارَهُمْ) با وجود ادعای بزرگی که در نفس خود دارند که بهترین مردم جهان هستند. پس فقیه و مفتی در دین خدا، با وجود کم بودن ورعش، از هر جهت حالش بهتر از اینهاست. زیرا صاحب ایمان با اینکه ایمانش را تقلیدی گرفته است، حالش بهتر از این عقلای به زعم خودشان است. و حاشا بر عاقل که دارای چنین صفتی باشد. ما اندکی از کسانی را که بر حال (عقلای حقیقی) بودند، درک کردیم و آنان آگاه‌ترین مردم به قدر و منزلت رسولان بودند و بیشترین پیروی را از سنت‌های رسول (صلی الله علیه و سلم) داشتند و شدیدترین محافظت‌کنندگان بر سنت‌های او بودند. آنان به آنچه برای جلال حق (الحق) از تعظیم شایسته است، عارف بودند و به آنچه خداوند بندگانش از پیامبران و پیروانشان از اولیا را به آن اختصاص داده است، از علم به خداوند از جهت فیض الهی اختصاصی (الفیض الإلهي الاختصاصي) که خارج از یادگیری معمول از درس و اجتهاد است، عالم بودند؛ علمی که عقل از حیث فکر خود قادر به رسیدن به آن نیست. و من از یکی از بزرگان آنها شنیدم، در حالی که آنچه را خداوند از علم به خود بر من گشوده بود، بدون نظر و قرائت، بلکه از خلوتی که با خدا داشتم و من از اهل طلب (علم رسمی) نبودم، دیده بود، گفت: سپاس خدایی را که من در زمانی هستم که کسی را دیدم که خداوند از نزد خود به او رحمتی عطا کرده و از علم لدنی به او آموخته است. پس «خداوند رحمت خود را به هر که بخواهد اختصاص می‌دهد و خداوند صاحب فضل عظیم است.» (الله يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ) و «خداوند حق را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}