{
  "id": 312,
  "title": {
    "ar": "الباب الثاني عشر وثلاثمائة في معرفة منزل كيفية نزول الوحي على قلوب الأولياء وحفظهم في ذلك من الشياطين من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Twelve: On the Knowledge of the Station (منزل) of the Modality of the Descent of Revelation (الوحي) upon the Hearts of the Friends of God (الأولياء), and their Protection therein from the Devils (الشياطين), derived from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو بارہ: اولیاء کے قلوب پر وحی کے نزول کی کیفیت کے مقام کی معرفت، اور الحضرة المحمدية (الحضرة المحمدية) کی جانب سے اس نزول میں شیاطین سے ان کی حفاظت کے بیان میں۔",
    "fa": "باب سیصد و دوازدهم در معرفت مقام کیفیت نزول وحی بر قلوب اولیاء و حفظ ایشان در آن از شیاطین، از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الثاني عشر وثلاثمائة في معرفة منزل كيفية نزول الوحي على قلوب الأولياء وحفظهم في ذلك من الشياطين من الحضرة المحمدية»\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** لقد ربطت به مواثت العلق‏\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** لقد أتيت به جمعا على نسق‏\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** الحق أبلج بين النص والعنق‏\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** جعلت عهدك بالتوحيد في عنقي‏\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** كيف التخلق بالأسماء والخلق‏\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** لا تحجبني فهذا آخر الرمق‏\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** العلم عند التجام الناس بالعرق‏\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** أعلمتني أن عين الأمر في النفق‏\n\n\n> لأن لي بصرا لا جفن يحصره *** وإن لي بصرا قد حف بالحدق‏\n\n\n> قل للذي خَلَقَ الْإِنْسانَ من عَلَقٍ *** لقد جعلت وجود الكون في طبق‏\n\n\n> لكنني إذ رأيت الأمر من جهتي *** كان الوجود الذي شاهدت عن طبق‏\n\n\n> فالكل في ظلم الأطباق منحصر *** لذا تراه كثير الشوق والقلق‏\n\n\n> فصاحب الفلق المشهود ظاهره *** يرى الحقائق في الأسحار والغسق‏\n\n\n> وصاحب الغسق المشهود باطنه *** يرى الحقائق في الأنوار والفلق‏\n\n\n> فالكل في حضرة التقييد ما برحوا *** فإن أتاه سراج منه لم يطق‏\n\n\n> فلا يزال على بلوى تقلبه *** فيها وتزعجه لو أعج الحرق‏\n\n\n> وزاده عشقه فيه مكابدة *** والعشق لفظة اشتقت من العشق‏\n\n\n> أعلاه في جنسه فيه كأسفله *** فالقيد في قدم والغل في عنق‏\n\n\n> فالروح يمسكه جسم يدبره *** والجسم يمسكه توافق الفرق‏\n\n\nأريد بتوافق الفرق اجتماع الطبائع التي وجد عنها الجسم‏\n\n\n### [إن المعلومات ثلاثة]\n\n\nاعلم أن المعلومات ثلاثة لا رابع لها وهي الوجود المطلق الذي لا يتقيد وهو وجود الله تعالى الواجب الوجود لنفسه والمعلوم الآخر العدم المطلق الذي هو عدم لنفسه وهو الذي لا يتقيد أصلا وهو المحال وهو في مقابلة الوجود المطلق فكانا على السواء حتى لو اتصفا لحكم الوزن عليهما وما من نقيضين متقابلين إلا وبينهما فاصل به يتميز كل واحد من الآخر وهو المانع أن يتصف الواحد بصفة الآخر وهذا الفاصل الذي بين الوجود المطلق والعدم لو حكم الميزان عليه لكان على السواء في المقدار من غير زيادة ولا نقصان وهذا هو البرزخ الأعلى وهو برزخ البرازخ له وجه إلى الوجود ووجه إلى العدم فهو يقابل كل واحد من المعلومين بذاته وهو المعلوم الثالث وفيه جميع الممكنات وهي لا تتناهى كما أنه كل واحد من المعلومين لا يتناهى ولها في هذا البرزخ أعيان ثابتة من الوجه الذي ينظر إليها الوجود المطلق ومن هذا الوجه ينطلق عليها اسم الشي‏ء الذي إذا أراد الحق إيجاده قال له كُنْ فَيَكُونُ وليس له أعيان موجودة من الوجه الذي ينظر إليه منه العدم المطلق ولهذا يقال له كن وكن حرف وجودي فإنه لو أنه كائن‏\nما قيل له كن وهذه الممكنات في هذا البرزخ بما هي عليه وما تكون إذا كانت مما تتصف به من الأحوال والأعراض والصفات والأكوان وهذا هو العالم الذي لا يتناهى وما له طرف ينتهي إليه وهو العامر الذي عمر الأرض التي خلقت من بقية خميرة طينة آدم عليه السلام عمارة الصور الظاهرة للرائي في الجسم الصقيل عمارة إفاضة ومن هذا البرزخ هو وجود الممكنات وبها يتعلق رؤية الحق للأشياء قبل كونها وكل إنسان ذي خيال وتخيل إذا تخيل أمرا ما فإن نظره يمتد إلى هذا البرزخ وهو لا يدري أنه ناظر ذلك الشي‏ء في هذه الحضرة وهذه الموجودات الممكنات التي أوجدها الحق تعالى هي للاعيان التي يتضمنها هذا البرزخ بمنزلة الظلالات للأجسام بل هي الظلالات الحقيقية وهي التي وصفها الحق سبحانه بالسجود له مع سجود أعيانها فما زالت تلك الأعيان ساجدة له قبل وجودها فلما وجدت ظلالاتها وجدت ساجدة لله تعالى لسجود أعيانها التي وجدت عنها من سماء وأرض وشمس وقمر ونجم وجبال وشجر ودواب وكل موجود ثم لهذه الظلالات التي ظهرت عن تلك الأعيان الثابتة من حيث ما تكونت أجساما ظلالات أوجدها الحق لها دلالات على معرفة نفسها من أين صدرت ثم إنها تمتد مع ميل النور أكثر من حد الجسم الذي تظهر عنه إلى ما لا يدركه طولا ومع هذا ينسب إليه وهو تنبيه إن العين التي في البرزخ التي وجدت عنها لا نهاية لها كما قررناه في تلك الحضرة البرزخية الفاصلة بين الوجود المطلق والعدم المطلق وأنت بين هذين الظلالين ذو مقدار فأنت موجود عن حضرة لا مقدار لها ويظهر عنك ظل لا مقدار له فامتداده يطلب تلك الحضرة البرزخية وتلك الحضرة البرزخية هي ظل الوجود المطلق من الاسم النور الذي ينطلق على وجوده فلهذا نسميها ظلا ووجود الأعيان ظل لذلك الظل والظلالات المحسوسة ظلالات هذه الموجودات في الحس ولما كان الظل في حكم الزوال لا في حكم الثبات وكانت الممكنات وإن وجدت في حكم العدم سميت ظلالات ليفصل بينها وبين من له الثبات المطلق في الوجود وهو واجب الوجود وبين من له الثبات المطلق في العدم وهو المحال لتتميز المراتب فالأعيان الموجودات إذا ظهرت ففي هذا البرزخ هي فإنه ما ثم حضرة تخرج إليه ففيها تكتسب حالة الوجود والوجود فيها متناه ما حصل منه والإيجاد فيها لا ينتهي فما من صورة موجودة إلا والعين الثابتة عينها والوجود كالثوب عليها فإذا أراد الحق أن يوحي إلى ولي من أوليائه بأمر ما تجلى الحق في صورة ذلك الأمر لهذه العين التي هي حقيقة ذلك الولي الخاص فيفهم من ذلك التجلي بمجرد المشاهدة ما يريد الحق أن يعلمه به فيجد الولي في نفسه علم ما لم يكن يعلم كما وجد النبي عليه السلام العلم في الضربة وفي شربه اللبن ومن الأولياء من يشعر بذلك ومنهم من لا يشعر به فمن لا يشعر يقول وجدت في خاطري أمر كذا وكذا ويكون ما يقول على حد ما يقول فيعرف من يعرف هذا المقام من أي مقام نطق هذا الولي وهو أتم ممن لا يعرف وتلك حضرة العصمة من الشياطين فهو وحي خالص لا يشوبه ما يفسده وإن اشتبه عليك أمر هذا البرزخ وأنت من أهل الله فانظر في قوله تعالى مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ أي لو لا ذلك البرزخ لم يتميز أحدهما عن الآخر ولأشكل الأمر وأدى إلى قلب الحقائق فما من متقابلين إلا وبينهما برزخ لا يبغيان أي لا يوصف أحدهما بوصف الآخر الذي به يقع التميز وهو محل دخول الجنة التي لا تنال إلا برحمة الله ولهذا لا يصح أن يكون له عمل وهو حال الدخول إليها فلا تتصف بأنك قد دخلت ولا بأنك خارج وهو خط متوهم يفصل بين خارج الجنة وداخلها فهو كالحال الفاصل بين الوجود والعدم فهو لا موجود ولا معدوم فإن نسبته إلى الوجود وجدت فيه منه رائحة لكونه ثابتا وإن نسبته إلى العدم صدقت لأنه لا وجود له والعجب من الأشاعرة كيف تنكر على من يقول إن المعدوم شي‏ء في حال عدمه وله عين ثابتة ثم يطرأ على تلك العين الوجود وهي تثبت الأحوال اللهم منكر الأحوال لا يتمكن له هذا ثم إن هذا البرزخ الذي هوالممكن بين الوجود والعدم سبب نسبة الثبوت إليه مع نسبة العدم هو مقابلته للأمرين بذاته وذلك أن العدم المطلق قام للوجود المطلق كالمرآة فرأى الوجود فيه صورته فكانت تلك الصورة عين الممكن فلهذا كان للممكن عين ثابتة وشيئية في حال عدمه ولهذا خرج على صورة الوجود المطلق ولهذا أيضا اتصف بعدم التناهي فقيل فيه إنه لا يتناهى وكان أيضا الوجود المطلق كالمرآة للعدم المطلق فرأى‏\nالعدم المطلق في مرآة الحق نفسه فكانت صورته التي رأى في هذه المرآة هو عين العدم الذي اتصف به هذا الممكن وهو موصوف بأنه لا يتناهى كما إن العدم المطلق لا يتناهى فاتصف الممكن بأنه معدوم فهو كالصورة الظاهرة بين الرائي والمرآة لا هي عين الرائي ولا غيره فالممكن ما هو من حيث ثبوته عين الحق ولا غيره ولا هو من حيث عدمه عين المحال ولا غيره فكأنه أمر إضافي ولهذا نزعت طائفة إلى نفي الممكن وقالت ما ثم إلا واجب أو محال ولم يتعقل لها الإمكان فالممكنات على ما قررناه أعيان ثابتة من تجلى الحق معدومة من تجلى العدم ومن هذه الحضرة علم الحق نفسه فعلم العالم وعلمه له بنفسه أزلا فإن التجلي أزلا وتعلق علمه بالعالم أزلا على ما يكون العالم عليه أبدا مما ليس حاله الوجود لا يزيد الحق به علما ولا يستفيد ولا رؤية تعالى الله عن الزيادة في نفسه والاستفادة فإن قلت فإن أحوال الممكنات مختلفة وإذا كان الممكن في حالة له مقابل لم يكن في الأخرى وبظهور إحداهما تنعدم الأخرى فمن أين كان العلم له بهذه المرتبة قلنا له إن كنت مؤمنا فالجواب هين وهو أنه علم ذلك من نفسه أيضا واكتسى الممكن هذا الوصف من خالقه وقد ثبت لك النسخ الإلهي في كلام الحق بما شرع وقد ثبت عندك تجلى الحق في الدار الآخرة في صور مختلفة فأين الصورة التي تحول إليها من الصورة التي تحول عنها فهذا أصل تقلب الممكنات من حال إلى حال يتنوع لتنوع الصور الإلهية فإن\n\n\nقلت فهذا التنوع ما متعلقة هل متعلقة الإرادة قلنا لا فإنه ليس للإرادة اختيار ولا نطق بها كتاب ولا سنة ولا دل عليها عقل وإنما ذلك للمشيئة فإن شاء كان وإن شاء لم يكن‏\n\n\nقال عليه السلام ما شاء الله كان وما لم يشأ لم يكن‏\n\n\nفعلق النفي والإثبات بالمشيئة وما ورد ما لم يرد لم يكن بل ورد لو أردنا أن يكون كذا لكان كذا فخرج من المفهوم الاختيار فالإرادة تعلق المشيئة بالمراد وهو قوله إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ هذا تعلق المشيئة وقد ذهب بعض الناس من أهل الطريق أن المشيئة هي عرش الذات وهو أبو طالب أي ملكها أي بالمشيئة ظهر كون الذات ملكا لتعلق الاختيار بها فالاختيار للذات من كونها إلها فإن شاء فعل وإن شاء لم يفعل وهو التردد الإلهي‏\n\n\nفي الخبر الصحيح ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة المؤمن يكره الموت‏\n\n\nوالعلم للذات من كونه ذاتا ولهذا تظهر رائحة الجبر مع العلم ويظهر الاختيار مع المشيئة فما حكم وسبق به العلم لا يتبدل عقلا ولا شرعا ما يُبَدَّلُ الْقَوْلُ لَدَيَّ ولرائحة الجبر فيه أعقبه وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ لئلا يتوهم متوهم ذلك إذ كان الحكم للعلم فيه فلم أخذ بما هو عليه مجبور غير مختار ومن علم ما ذكرناه من تجلى الحق في مرآة العدم لظهور صور أعيان الممكنات على صورة الوجوب هان عليه هذا كله وعرف أصله واستراح راحة الأبد وعلم إن الممكن ما خرج عن حضرة إمكانه لا في حال وجوده ولا في حال عدمه والتجلي له مستصحب والأحوال عليه تتحول وتطرأ فهو بين حال عدمي وحال وجودي والعين هي تلك العين وهذا من العلم المكنون الذي قيل فيه إن من العلم كهيئة المكنون لا يعلمه إلا العالمون بالله فإذا نطقوا به لم ينكره إلا أهل الغرة بالله ولهذا كان الجن والأرواح لو بعث إليهم أحسن ردا على النبي صَلَّى اللهُ عَليهِ وسَلَّم حين كان يقرأ عليهم القرآن من الإنس وكذا قال لأصحابه وذلك لأنهم إلى هذه الحضرة أقرب نسبة وإلى عالم الغيب فإن لهم التحول في الصور ظاهرا وباطنا فكان استماعهم لكلام الله أوثق وأحسن للمشاركة في سرعة التنوع والتقلب من حال إلى حال وهو من صفات الكلام فهم بالصفة إليه أقرب مناسبة وأعلم بكلام الله منا\n\n\nأ لا تراهم لما منعوا السمع وحيل بينهم وبين السماء بالرجوم قالوا ما هذا إلا لأمر حدث فأمر زوبعة أصحابه وغيره أن يجولوا مشارق الأرض ومغاربها لينظروا ما هذا الأمر الذي حدث وأحدث منعهم من الوصول إلى السماء فلما وصل أصحاب زوبعة إلى تهامة مروا بنخلة فوجدوا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يصلي صلاة الفجر وهو يقرأ فلما سمعوا القرآن أصغوا إليه وقالوا هذا الذي حال بيننا وبين خبر السماء\n\n\nفلو لا معرفتهم برتبة القرآن وعظم قدره ما تفطنوا لذلك ف وَلَّوْا إِلى‏ قَوْمِهِمْ مُنْذِرِينَ ف قالُوا يا قَوْمَنا إِنَّا سَمِعْنا كِتاباً أُنْزِلَ من بَعْدِ مُوسى‏ مُصَدِّقاً لِما بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ يا قَوْمَنا أَجِيبُوا داعِيَ الله وآمِنُوا به يَغْفِرْ لَكُمْ من ذُنُوبِكُمْ ويُجِرْكُمْ من عَذابٍ أَلِيمٍ وقالوا إِنَّا سَمِعْنا قُرْآناً عَجَباً يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا به ولَنْ نُشْرِكَ بِرَبِّنا أَحَداً وأَنَّهُ تَعالى‏ جَدُّ رَبِّنا ما اتَّخَذَ صاحِبَةً ولا وَلَداً وكذلك‏\n\n\nلما قرأ عليهم سورة الرحمن ليلة الجن ما مر بآية يقول فيها فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ إلا قالوا ولا بشي‏ء من آلائك‏\nربنا نكذب ولما تلاها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بعد ذلك على أصحابه من الإنس لم يقولوا شيئا مما قالته الجن فقال لهم رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إني تلوتها على إخوانكم من الجن فكانوا أحسن استماعا لها منكم ما قيل لهم فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ إلا وقالوا ولا بشي‏ء من آلائك ربنا نكذب‏\n\n\nولقد روينا حديثا غريبا عن واحد من هذه الجماعة من الجن حدثني به الضرير إبراهيم بن سليمان بمنزلي بحلب وهو من دير الرمان من أعمال الخابور عن رجل حطاب ثقة كان قد قتل حية فاختطفته الجن فأحضرته بين يدي شيخ كبير منهم هو زعيم القوم فقالوا له هذا قتل ابن عمنا قال الحطاب ما أدري ما تقولون وإنما أنا رجل حطاب تعرضت لي حية فقتلتها فقالت الجماعة هو كان ابن عمنا فقال الشيخ رضي الله عنه خلوا سبيل الرجل وردوه إلى مكانه فلا سبيل لكم عليه‏\n\n\nفإني سمعت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو يقول لنا من تصور في غير صورته فقتل فلا عقل فيه ولا قود\n\n\nوابن عمكم تصور في صورة حية وهي من أعداء الإنس قال الحطاب فقلت له يا هذا أراك تقول سمعت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم هل أدركته قال نعم أنا واحد من جن نصيبين الذين قدموا على رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فسمعنا منه وما بقي من تلك الجماعة غيري فأنا أحكم في أصحابي بما سمعته من رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ولم يذكر لنا اسم ذلك الرجل من الجن ولا سألت عن اسمه وقد حدث بهذا الحديث الشيخ الذي حدثنا به صاحبي شمس الدين محمد بن برتقش المعظمي وبرهان الدين إسماعيل بن محمد الأيدني بحلب أيضا فإني كنت أحدثهما بهذا الحديث فلما جئنا مدينة حلب بعثتهما إليه ليحدثهما كما حدثني فحدثهما كما حدثني فكل عالم برزخي هو أعلم بحضرة الإمكان من غيره من المخلوقين لقرب المناسبة ويكفي هذا القدر من هذا المنزل فلنذكر ما يحوي عليه هذا المنزل من العلوم وذلك أنه يحوي على علم الأمر الإلهي هل له صفة أم لا وهل من شرطه أو من حقيقته الإرادة أم لا وعلم الوحي وضروبه وعلم السماع وعلم العالم البرزخى وعلم الجبروت وعلم الهدى وعلم العظمة الإلهية لما ذا ترجع وأين تظهر ومن هو الموصوف بها ولمن هي نسبة ولمن هي صفة وعلم التنزيه وعلى من يعود وعلم الحضرة التي أطلق الله منها ألسنة عباده على نفسه بما لا يليق به في الدليل العقلي وهل لذلك وجه إلهي يستند إليه في ذلك أم لا وهو قولهم إِنَّ الله فَقِيرٌ وإن عيسى ابن الله وكذلك عزير ويَدُ الله مَغْلُولَةٌ كما حكى الله عنهم وأمثال هذا وعلم الظن وحكمه والمحمود منه والمذموم وما متعلقة وعلم الايمان وعلم ما ينبغي أن يستند إليه ممن لا يستند وما صفته وما يجوز من ذلك مما لا يجوز وعلم مراتب الكواكب وعلم منازل الروحانيين من السماء وعلم أحوال الخلق وعلم الصديقين وعلم المسابقة بين الله وبين عبده وعلم المكر والفتن وعلم القيام بأوامر الله وعلم مراتب الغيب وما انفرد به الحق من علم الغيب دون خلقه وما يمكن أن يعلم من الغيب وهل العلم به يزيل عنه اسم الغيب في حق العالم أم لا وقوله تعالى عالِمُ الْغَيْبِ لما ذا يرجع إطلاق الغيب هل لكونه غيبا عنا أو غيبا في نفسه من حيث لم يصفه بتعلق الرؤية فيكون شهادة وعلم العصمة وعلم تعلق العلم بما لا يتناهى هل يتعلق به على جهة الإحاطة أم لا وعلم‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم في الأسماء الحسنى من أحصاها دخل الجنة\n\n\nوما معنى الإحصاء ولما ذا يرجع وهل يدخل تحته ما لا يتناهى كما يدخل تحت الإحاطة أو لا يدخل وما الفرق بين الإحاطة والإحصاء فإن الواحد يحاط به ولا يحصى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Twelve: Concerning the Station of Knowing the Manner of the Descent of Revelation (الوحي) upon the Hearts of the Saints (الأولياء), and their Protection therein from the Devils, derived from the Muhammadan Presence (الحضرة المحمدية)\n\nSay to Him Who created man from a clinging substance (علق): I have bound to Him the covenants of the clinging substance.\nSay to Him Who created man from a clinging substance: I have brought it forth as a collection in sequence.\nSay to Him Who created man from a clinging substance: The Real (الحق) is manifest between the text and the neck.\nSay to Him Who created man from a clinging substance: I have placed Your covenant of Unity (التوحيد) upon my neck.\nSay to Him Who created man from a clinging substance: How is the assumption of the character of the Names (الأسماء) and the creation (الخلق)?\nSay to Him Who created man from a clinging substance: Do not veil me, for this is the last breath.\nSay to Him Who created man from a clinging substance: Knowledge (العلم) is present when people are bridled by sweat.\nSay to Him Who created man from a clinging substance: You informed me that the very essence of the matter (عين الأمر) is in the tunnel.\nBecause I possess a sight that no eyelid confines, and I possess a sight surrounded by the pupils.\nSay to Him Who created man from a clinging substance: You have placed the existence (وجود) of the cosmos within a layer (طبق).\nBut when I saw the matter from my own perspective, the Existence I witnessed was layered.\nThus, everything is confined within the darkness of the layers, which is why you see it filled with longing and anxiety.\nThe possessor of the witnessed dawn (الفلق), whose outward aspect is manifest, sees the Realities (الحقائق) in the pre-dawns and the twilight (الغسق).\nAnd the possessor of the witnessed twilight, whose inward aspect is manifest, sees the Realities in the Lights (الأنوار) and the dawn.\nFor all remain within the Presence of Restriction (حضرة التقييد); if a lamp comes to them from Him, they cannot bear it.\nHe remains constantly upon the trial of his transformation within it, and it disturbs him, even if the burning is pleasing.\nAnd his passionate love (*‘ishq*) for Him increases his struggle, and *‘ishq* is a word derived from the root *‘ashq* (clinging/twining).\nIts highest part is like its lowest part in its genus: the fetter is on the foot and the collar is on the neck.\nThe Spirit (الروح) is held by a body that governs it, and the body is held by the agreement of the differences (توافق الفرق).\n\nBy \"the agreement of the differences,\" I mean the convergence of the natures from which the body originated.\n\n### [Indeed, the Knowns are Three]\n\nKnow that the Knowns (المعلومات) are three, and there is no fourth. They are: Absolute Existence (الوجود المطلق), which is not restricted. This is the Existence of Allah the Exalted, the Necessary Existent (الواجب الوجود) by His Essence (لذاته). The second Known is Absolute Non-Existence (العدم المطلق), which is non-existence by its essence. This is that which is not restricted at all, and it is the Impossible (المحال). It stands in opposition to Absolute Existence. They are equal (على السواء) such that if they were to be described, the rule of the Balance (الوزن) would apply to them.\n\nBetween any two opposing contradictories, there must be a separator (فاصل) by which each is distinguished from the other. This separator prevents one from being described by the attribute of the other. This separator between Absolute Existence and Non-Existence, if the Balance were to rule upon it, would be equal in measure, without increase or decrease. This is the Highest Isthmus (البرزخ الأعلى), the Isthmus of Isthmuses (برزخ البرازخ). It has one face toward Existence and one face toward Non-Existence. It confronts each of the two Knowns with its very essence. This is the Third Known.\n\nWithin it are all the Possibles (الممكنات), which are without end (لا تتناهى), just as each of the other two Knowns is without end. In this Isthmus, the Possibles possess Fixed Entities (أعيان ثابتة) from the perspective through which Absolute Existence looks upon them. From this perspective, the name \"Thing\" (الشيء) is applied to them—the Thing to which the Real (الحق), when He wills its creation, says: *Be!* (كُنْ), <<فَيَكُونُ>> (and it is). They do not possess existent entities from the perspective through which Absolute Non-Existence looks upon them. This is why it is said to it, *Be!* (كن). *Be!* is a word of existence, for if it were already existent, it would not be told, *Be!*\n\nThese Possibles, in this Isthmus, are as they are and as they will be when they come into being, including the states, accidents, attributes, and occurrences (الأكوان) that describe them. This is the World (العالم) that is without end, having no limit to which it terminates. It is the inhabited realm that populates the earth—which was created from the remainder of the leaven of Adam’s clay (عليه السلام)—with the manifestation of forms visible to the observer in a polished body, a manifestation of emanation (إفاضة).\n\nFrom this Isthmus comes the existence of the Possibles. It is through them that the Real’s vision of things before their existence is related. Every human possessing imagination (خيال) and conceptualization (تخيل), when he imagines something, his gaze extends to this Isthmus, though he does not realize that he is observing that thing in this Presence (الحضرة).\n\nThese existent Possibles that the Real brought into existence are, relative to the Entities (الأعيان) contained within this Isthmus, like shadows (الظلالات) to bodies. Indeed, they are the true shadows. These are the shadows that the Real (سبحانه) described as prostrating to Him, along with the prostration of their Entities. Those Entities never ceased prostrating to Him before their existence. When their shadows came into existence, they were found prostrating to Allah due to the prostration of their Entities from which they originated—such as the heaven, the earth, the sun, the moon, the stars, the mountains, the trees, the beasts, and every existent thing.\n\nFurthermore, these shadows that appeared from those Fixed Entities (الأعيان الثابتة), insofar as they became bodies, have shadows that the Real created for them as indications (دلالات) of the knowledge of their own origin. These shadows extend with the inclination of the light further than the limit of the body from which they appear, to an extent that cannot be grasped in length. Yet, they are attributed to it. This is an indication that the Entity (العين) in the Isthmus from which it originated has no end, as we established concerning that Isthmus Presence (الحضرة البرزخية) separating Absolute Existence and Absolute Non-Existence.\n\nYou, standing between these two shadows, possess a measure (مقدار). You exist from a Presence that has no measure, and a shadow appears from you that has no measure. The extension of this shadow seeks that Isthmus Presence. That Isthmus Presence is the shadow of Absolute Existence (الوجود المطلق) derived from the Name *Light* (النور) applied to His Existence. This is why we call it a shadow. The existence of the Entities is a shadow of that shadow, and the sensible shadows are the shadows of these existents in the sensory realm.\n\nSince the shadow is subject to disappearance (الزوال) and not permanence (الثبات), and since the Possibles, even when existent, are subject to the rule of non-existence, they are called shadows (ظلالات). This distinction is made to differentiate them from that which possesses Absolute Permanence in Existence (الثبات المطلق في الوجود)—which is the Necessary Existent (واجب الوجود)—and from that which possesses Absolute Permanence in Non-Existence—which is the Impossible (المحال)—so that the Levels (المراتب) may be distinguished.\n\nWhen the existent Entities appear, they are in this Isthmus, for there is no Presence outside of it to which they might emerge. It is within the Isthmus that they acquire the state of existence. The existence that has been realized within it is finite, but the act of bringing into existence (الإيجاد) within it is endless. There is no existent form except that the Fixed Entity is its essence, and Existence is like a garment upon it.\n\nIf the Real wills to reveal (يوحي) something to one of His saints (ولي), the Real discloses Himself (تجلى الحق) in the form of that matter to this Entity (العين), which is the reality (حقيقة) of that specific saint. The saint understands from that Theophany (التجلي), merely by witnessing (بمجرد المشاهدة), what the Real intends to teach him. The saint finds within himself the knowledge of what he did not know, just as the Prophet (عليه السلام) found knowledge in the strike and in drinking the milk.\n\nSome saints are aware of this process, and some are not. Those who are unaware say, \"I found such-and-such a matter in my inner thought (خاطري).\" What he says is precisely what he says, and thus, those who know this station (المقام) recognize from which station this saint spoke. This one is more complete than the one who does not know. That is the Presence of Infallibility (حضرة العصمة) from the devils. It is pure revelation (وحي خالص) that is not tainted by anything that corrupts it.\n\nIf the matter of this Isthmus is confusing to you, and you are among the People of Allah (أهل الله), look at His saying: <<مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ>> (He released the two seas, meeting [side by side]; between them is an Isthmus [Barzakh], neither of them transgresses). Meaning, were it not for that Isthmus, neither would be distinguished from the other, the matter would be confused, and it would lead to the inversion of realities (قلب الحقائق). There are no two opposites except that between them is an Isthmus that does not transgress—meaning, neither is described by the attribute of the other, by which distinction occurs.\n\nIt is the place of entry into Paradise, which is attained only by the Mercy of Allah. Therefore, it is not valid for one to have an action (عمل) while entering it. It is a state where you are not described as having entered, nor as being outside. It is an imaginary line (خط متوهم) separating the one outside Paradise from the one inside. It is like the state separating Existence and Non-Existence: it is neither existent nor non-existent. If you relate it to Existence, you find a scent of it therein, due to its being fixed (ثابتا). If you relate it to Non-Existence, you speak truly, because it has no existence.\n\nIt is astonishing how the Ash'aris deny those who say that the non-existent is a thing (شيء) in its state of non-existence and has a Fixed Entity (عين ثابتة), and then existence occurs to that Entity, while they themselves affirm the states (الأحوال). However, the denier of the states cannot accept this.\n\nThe reason this Isthmus, which is the Possible (الممكن) between Existence and Non-Existence, is attributed with fixity (الثبوت) along with non-existence is its confrontation of both matters with its essence. This is because Absolute Non-Existence stood before Absolute Existence like a mirror (كالمرآة). Absolute Existence saw its form (صورته) within it. That form was the very Entity of the Possible (عين الممكن). Therefore, the Possible had a Fixed Entity and a thing-ness (شيئية) in its state of non-existence. This is why it emerged in the form of Absolute Existence, and why it was also described as being without end (لا يتناهى).\n\nAbsolute Existence was also like a mirror for Absolute Non-Existence. Absolute Non-Existence saw itself in the mirror of the Real (مرآة الحق). The form it saw in this mirror was the very non-existence (عين العدم) with which this Possible was described. It is described as being without end, just as Absolute Non-Existence is without end. Thus, the Possible is described as non-existent. It is like the image appearing between the viewer and the mirror: it is neither the viewer itself nor other than him. The Possible, in terms of its fixity, is neither the essence of the Real (عين الحق) nor other than Him. And in terms of its non-existence, it is neither the essence of the Impossible (عين المحال) nor other than it. It is, as it were, a relational matter (أمر إضافي). For this reason, one group inclined toward negating the Possible, saying there is nothing but the Necessary (واجب) or the Impossible (محال), and they did not conceive of possibility (الإمكان).\n\nThe Possibles, as we established, are Fixed Entities derived from the Theophany of the Real (تجلى الحق), and non-existent derived from the Theophany of Non-Existence. From this Presence (الحضرة), the Real knew Himself, and thus knew the World (العالم). His knowledge of the World by Himself is eternal (أزلا), for the Theophany is eternal, and His knowledge relates to the World eternally, according to what the World will be forever. This knowledge, which is not a state of existence, does not increase the Real in knowledge, nor does He benefit from it, nor does He gain vision. Exalted is Allah above increase in His Essence and gaining benefit.\n\nIf you say: \"The states of the Possibles are different. If a Possible is in one state, it has an opposite that it is not in during the other state. When one appears, the other ceases to exist. How then did [Allah's] Knowledge encompass this level?\" We say to him: If you are a believer, the answer is easy. He knew that from Himself as well, and the Possible acquired this description from its Creator. The divine abrogation (النسخ الإلهي) is established for you in the word of the Real concerning what He legislated. It is established for you that the Real discloses Himself (تجلى الحق) in the Hereafter in different forms. Where is the form He transformed into, relative to the form He transformed from? This is the origin of the transformation of the Possibles from state to state; it varies due to the variation of the Divine Forms.\n\nIf you say: \"What is the relation of this variation? Is it related to Will (الإرادة)?\" We say: No, for Will has no choice (اختيار). No Book or Sunnah speaks of it, nor does reason indicate it. That belongs only to Volition (المشيئة). If He wills (شاء), it is; and if He wills not, it is not.\n\nThe Prophet (عليه السلام) said: \"What Allah willed (ما شاء الله) was, and what He willed not (ما لم يشأ) was not.\"\n\nHe related negation and affirmation to Volition. It was not reported, \"What He did not will (لم يرد) was not.\" Rather, it was reported, \"Had We willed that such-and-such be, it would have been so.\" This excludes the concept of choice from the meaning. Will (الإرادة) is the relation of Volition to the object willed (المراد). This is His saying: <<إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ>> (Indeed, Our word to a thing, when We intend it...). This is the relation of Volition.\n\nSome people of the Path (أهل الطريق) have held that Volition is the Throne of the Essence (عرش الذات), meaning its dominion (ملكها). By Volition, the Essence’s being a Sovereign (ملكا) became manifest, due to the relation of Choice (الاختيار) to it. Choice belongs to the Essence by virtue of its being a God (إلها). If He wills, He acts; and if He wills not, He does not act. This is the Divine Hesitation (التردد الإلهي).\n\nIn the sound *hadith*: \"I have not hesitated concerning anything I am about to do as I hesitate concerning the seizing of the soul of the believer, who dislikes death.\"\n\nKnowledge (العلم) belongs to the Essence by virtue of its being an Essence (ذاتا). This is why the scent of compulsion (رائحة الجبر) appears with Knowledge, and Choice appears with Volition. What has been decreed and preceded by Knowledge cannot be altered, neither rationally nor legally: <<ما يُبَدَّلُ الْقَوْلُ لَدَيَّ>> (The word is not changed with Me). The scent of compulsion therein is followed by: <<وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ>> (And I am not unjust to the servants), lest anyone imagine that since the decree belongs to Knowledge, why is he held accountable for what he is compelled to do and not chosen?\n\nWhoever knows what we have mentioned—the Real’s Theophany in the mirror of Non-Existence for the appearance of the forms of the Possibles’ Entities in the form of Necessity (الوجوب)—all this becomes easy for him. He knows its origin and finds eternal rest. He knows that the Possible has not departed from the Presence of its possibility (حضرة إمكانه), neither in its state of existence nor in its state of non-existence. The Theophany is continuous for it, and states transform and occur upon it. It is between a state of non-existence and a state of existence, and the Entity (العين) remains the same Entity.\n\nThis is part of the Hidden Knowledge (العلم المكنون) about which it was said: \"Indeed, some knowledge is like the hidden treasure; none knows it except those who know Allah.\" When they speak of it, none denies it except the people of heedlessness concerning Allah.\n\nThis is why the Jinn and the spirits, had they been sent to, would have responded better to the Prophet (صلى الله عليه وسلم) when he recited the Quran to them than the humans did. He said this to his Companions. This is because they are closer in relation to this Presence and to the World of the Unseen (عالم الغيب). They possess transformation in forms, outwardly and inwardly. Therefore, their listening to the Word of Allah was more reliable and better, due to their participation in the swiftness of variation and transformation from state to state, which is one of the attributes of Speech (الكلام). They are closer in suitability to the Attribute and know the Word of Allah better than we do.\n\nDo you not see that when they were prevented from hearing and barriers were placed between them and the heaven by means of shooting stars (الرجوم), they said, \"This is only due to an event that has occurred\"? Zub'a commanded his companions and others to traverse the Easts and Wests of the earth to see what event had occurred that prevented them from reaching the heaven. When Zub'a’s companions reached Tihamah, they passed by a palm grove and found the Messenger of Allah (صلى الله عليه وسلم) praying the Dawn Prayer (صلاة الفجر) and reciting. When they heard the Quran, they listened attentively and said, \"This is what has come between us and the news of the heaven.\" Had they not known the rank of the Quran and its great value, they would not have realized this. <<فَوَلَّوْا إِلى‏ قَوْمِهِمْ مُنْذِرِينَ>> (So they returned to their people as warners). They said: <<يا قَوْمَنا إِنَّا سَمِعْنا كِتاباً أُنْزِلَ من بَعْدِ مُوسى‏ مُصَدِّقاً لِما بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ يا قَوْمَنا أَجِيبُوا داعِيَ الله وآمِنُوا به يَغْفِرْ لَكُمْ من ذُنُوبِكُمْ ويُجِرْكُمْ من عَذابٍ أَلِيمٍ>> (O our people, indeed we have heard a Book revealed after Moses, confirming what was before it, guiding to the truth and to a straight path. O our people, respond to the caller of Allah and believe in Him; He will forgive you your sins and protect you from a painful punishment.) And they said: <<إِنَّا سَمِعْنا قُرْآناً عَجَباً يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا به ولَنْ نُشْرِكَ بِرَبِّنا أَحَداً وأَنَّهُ تَعالى‏ جَدُّ رَبِّنا ما اتَّخَذَ صاحِبَةً ولا وَلَداً>> (Indeed, we have heard a wondrous Quran, guiding to the right course, so we have believed in it, and we will never associate with our Lord anyone. And [we believe] that exalted is the majesty of our Lord; He has not taken a wife nor a son.)\n\nLikewise, when he recited *Surah Ar-Rahman* to them on the Night of the Jinn, whenever he passed a verse in which He says: <<فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ>> (Then which of the favors of your Lord will you deny?), they would say, \"Nor by anything of Your favors, our Lord, do we deny.\" When the Messenger of Allah (صلى الله عليه وسلم) recited it afterward to his human Companions, they did not say anything of what the Jinn had said. The Messenger of Allah (صلى الله عليه وسلم) said to them: \"I recited it to your brothers among the Jinn, and they were better listeners to it than you. Whenever it was said to them, 'Then which of the favors of your Lord will you deny?' they said, 'Nor by anything of Your favors, our Lord, do we deny.'\"\n\nI have narrated a strange *hadith* from one of this group of Jinn. The blind man Ibrahim ibn Sulayman narrated it to me in my house in Aleppo—he was from Dayr al-Rumman in the district of al-Khabur—from a trustworthy woodcutter who had killed a snake. The Jinn snatched him and brought him before a great elder (شيخ كبير) who was their leader. They said to the elder, \"This man killed our cousin.\" The woodcutter said, \"I do not know what you are saying. I am just a woodcutter, and a snake attacked me, so I killed it.\" The group insisted, \"He was our cousin.\" The elder (رضي الله عنه) said, \"Release the man and return him to his place. You have no claim against him. For I heard the Messenger of Allah (صلى الله عليه وسلم) say to us: 'Whoever takes a form other than his own and is killed, there is no blood-money (*‘aql*) for him, nor retaliation (*qawd*). Your cousin took the form of a snake, and snakes are enemies of mankind.'\" The woodcutter said, \"I asked him, 'O man, I see you saying, \"I heard the Messenger of Allah (صلى الله عليه وسلم).\" Did you meet him?'\" He replied, \"Yes, I am one of the Jinn of Nisibin who came to the Messenger of Allah (صلى الله عليه وسلم). We heard from him, and none of that group remains but me. I judge among my companions according to what I heard from the Messenger of Allah (صلى الله عليه وسلم).\" He did not mention the name of that man among the Jinn, nor did I ask for his name. The Shaykh who narrated this *hadith* to my companion, Shams al-Din Muhammad ibn Burtuqish al-Mu'azzami, and Burhan al-Din Isma'il ibn Muhammad al-Aydani, also narrated it in Aleppo. I used to narrate this *hadith* to them, but when we came to the city of Aleppo, I sent them to him so he could narrate it to them as he had narrated it to me, and he did so.\n\nEvery scholar of the Isthmus (عالم برزخي) is more knowledgeable of the Presence of Possibility (حضرة الإمكان) than other creatures, due to the closeness of the relation. This much suffices for this Station. Let us now mention the sciences contained within this Station.\n\nIt contains the science of the Divine Command (الأمر الإلهي)—whether it has an attribute or not, and whether Will (الإرادة) is a condition or part of its reality. The science of Revelation (الوحي) and its types. The science of Audition (السماع). The science of the Isthmus World (العالم البرزخى). The science of the Realm of Power (الجبروت). The science of Guidance (الهدى). The science of Divine Grandeur (العظمة الإلهية)—to what it returns, where it manifests, who is described by it, to whom it is a relation, and to whom it is an attribute. The science of Transcendence (التنزيه) and upon whom it devolves. The science of the Presence from which Allah loosened the tongues of His servants concerning Himself with what is rationally inappropriate (في الدليل العقلي)—and whether there is a divine aspect (وجه إلهي) supporting this, such as their saying: <<إِنَّ الله فَقِيرٌ>> (Indeed, Allah is poor), and that Jesus is the son of Allah, and likewise Uzayr, and <<يَدُ الله مَغْلُولَةٌ>> (The Hand of Allah is chained), as Allah recounted from them, and similar examples. The science of Conjecture (الظن), its ruling, what is praiseworthy and blameworthy of it, and its relation. The science of Faith (الإيمان). The science of what should be relied upon by those who do not rely, its description, and what is permissible and impermissible of it. The science of the Levels of the Stars (مراتب الكواكب). The science of the Stations of the Spiritual Beings (منازل الروحانيين) in the heaven. The science of the States of Creation (أحوال الخلق). The science of the Truthful (الصديقين). The science of the Race (المسابقة) between Allah and His servant. The science of Cunning (المكر) and Trials (الفتن). The science of Upholding the Commands of Allah. The science of the Levels of the Unseen (مراتب الغيب), and what the Real has reserved of the knowledge of the Unseen exclusively from His creation, and what can be known of the Unseen. And whether knowledge of it removes the name \"Unseen\" (الغيب) in relation to the knower or not. And His saying: <<عالِمُ الْغَيْبِ>> (Knower of the Unseen)—to what does the application of \"Unseen\" return? Is it because it is unseen by us, or unseen in itself, in that He did not describe it with the relation of vision, so that it would become witnessing (شهادة)? The science of Infallibility (العصمة). The science of the relation of Knowledge to that which is without end (لا يتناهى)—whether it relates to it by way of encompassing (الإحاطة) or not.\n\nThe science of the Prophet’s saying (صلى الله عليه وسلم) concerning the Most Beautiful Names: <<من أحصاها دخل الجنة>> (Whoever enumerates them shall enter Paradise).\n\nAnd what is the meaning of enumeration (الإحصاء), to what does it return, and does it include that which is without end, just as encompassing (الإحاطة) includes it, or does it not? And what is the difference between encompassing and enumeration? For a single thing can be encompassed but not enumerated. <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو بارہ: اولیاء کے قلوب پر وحی کے نزول کی کیفیت کے مقام کی معرفت اور اس میں شیاطین سے ان کی حفاظت، جو کہ حقیقت محمدیہ (الحقیقۃ المحمدیۃ) سے ہوتی ہے۔\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nیقیناً اس کے ساتھ تعلق کے عہد و پیمان باندھے گئے ہیں۔\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nیقیناً میں اسے ایک ترتیب کے ساتھ مجموعی طور پر لایا ہوں۔\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nذات حق (الحق) نص اور گردن کے درمیان واضح ہے۔\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nمیں نے توحید کا تیرا عہد اپنی گردن میں ڈال لیا ہے۔\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nاسماء اور خلق کے ذریعے اخلاق کیسے اپنائے جاتے ہیں؟\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nمجھے حجاب میں نہ رکھ، کیونکہ یہ آخری سانس ہے۔\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nعلم لوگوں کے پسینے میں ڈوب جانے کے وقت حاصل ہوتا ہے۔\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nتو نے مجھے بتا دیا کہ امر کی اصل سرنگ میں ہے۔\n\nکیونکہ میری ایک ایسی بصیرت ہے جسے پلکیں محدود نہیں کرتیں،\nاور میری ایک ایسی بصارت ہے جو آنکھوں کے حلقوں سے گھری ہوئی ہے۔\n\nکہو اس سے جس نے انسان کو جمے ہوئے خون سے پیدا کیا (خَلَقَ الْإِنْسانَ من عَلَقٍ)\nیقیناً تو نے کائنات کی ہستی (الوجود) کو ایک طبق (سطح) میں رکھ دیا ہے۔\n\nلیکن جب میں نے امر کو اپنی جہت سے دیکھا،\nتو جو ہستی (الوجود) میں نے مشاہدہ کی وہ طبق کے مطابق تھی۔\n\nپس سب کچھ طبقات کی تاریکیوں میں محصور ہے،\nاسی لیے تو اسے شدید شوق اور بے چینی میں دیکھتا ہے۔\n\nپس وہ جو فلق (صبح کا پھٹنا) کا مشہود ہے، اس کا ظاہر،\nحقائق کو سحری اور شام کی تاریکی میں دیکھتا ہے۔\n\nاور وہ جو غسق (شام کی تاریکی) کا مشہود ہے، اس کا باطن،\nحقائق کو انوار اور فلق (صبح) میں دیکھتا ہے۔\n\nپس سب کے سب قید (التقييد) کے حضور سے کبھی نہیں نکلے،\nاگر ان کے پاس اس میں سے کوئی چراغ آئے تو وہ اسے برداشت نہیں کر سکتے۔\n\nوہ ہمیشہ اس آزمائش میں پلٹتا رہتا ہے،\nاور اگر جلن اسے تکلیف دے تو وہ اسے پریشان کرتی ہے۔\n\nاور اس میں اس کے عشق نے اس کی مشقت کو بڑھا دیا،\nاور عشق (العشق) وہ لفظ ہے جو عشق (العشق - بیل بوٹے) سے مشتق ہے۔\n\nاس کی جنس میں اس کا اوپر والا حصہ اس کے نیچے والے حصے کی طرح ہے،\nپس قید پاؤں میں ہے اور طوق گردن میں ہے۔\n\nپس روح کو ایک جسم تھامے ہوئے ہے جو اس کی تدبیر کرتا ہے،\nاور جسم کو فرق (اختلافات) کا توافق تھامے ہوئے ہے۔\n\nفرق (الفرق) کے توافق سے میری مراد ان طبائع کا اجتماع ہے جن سے جسم وجود میں آیا ہے۔\n\n### [معلومات تین ہیں]\n\nجان لو کہ معلومات تین ہیں، چوتھی کوئی نہیں: پہلی ہستی مطلقہ (الوجود المطلق) ہے جو مقید نہیں ہوتی، اور وہ اللہ تعالیٰ کی ہستی ہے جو بذات خود واجب الوجود ہے۔ دوسری معلوم چیز عدم مطلق (العدم المطلق) ہے جو بذات خود عدم ہے، اور وہ بالکل مقید نہیں ہوتا، اور وہ محال ہے۔ یہ ہستی مطلقہ (الوجود المطلق) کے بالمقابل ہے، لہٰذا یہ دونوں برابر ہیں، یہاں تک کہ اگر ان کی صفت بیان کی جائے تو وزن کا حکم ان پر لاگو ہوگا۔\n\nاور کوئی بھی دو متقابل نقیضیں ایسی نہیں ہیں مگر ان کے درمیان ایک فاصل (برزخ) ہوتا ہے جس کے ذریعے ہر ایک دوسرے سے ممتاز ہوتا ہے، اور یہی وہ چیز ہے جو ایک کو دوسرے کی صفت سے متصف ہونے سے روکتی ہے۔ اور یہ فاصل (البرزخ) جو ہستی مطلقہ (الوجود المطلق) اور عدم کے درمیان ہے، اگر میزان کا حکم اس پر لاگو کیا جائے تو وہ مقدار میں برابر ہوگا، بغیر کسی کمی یا زیادتی کے۔ اور یہی برزخ اعلیٰ (البرزخ الأعلى) ہے، اور یہ برزخوں کا برزخ ہے۔ اس کا ایک رُخ ہستی (الوجود) کی طرف ہے اور ایک رُخ عدم کی طرف، پس یہ دونوں معلوم چیزوں کا اپنی ذات سے مقابلہ کرتا ہے، اور یہی تیسری معلوم چیز ہے۔\n\nاور اسی میں تمام ممکنات (الممکنات) موجود ہیں، اور وہ لامتناہی ہیں، جیسا کہ ہر ایک معلوم چیز لامتناہی ہے۔ اور اس برزخ (البرزخ) میں ان کے اعیان ثابتہ (الأعيان الثابتة) ہیں، اس رُخ سے جہاں سے ہستی مطلقہ (الوجود المطلق) ان کی طرف دیکھتی ہے۔ اور اسی رُخ سے ان پر \"شیء\" کا نام لاگو ہوتا ہے، جسے جب ذات حق (الحق) وجود میں لانا چاہتا ہے تو اسے کہتا ہے: \"ہو جا\" (كُنْ) تو وہ ہو جاتا ہے (فَيَكُونُ)۔ اور اس کے اعیان موجودہ اس رُخ سے نہیں ہیں جہاں سے عدم مطلق (العدم المطلق) اس کی طرف دیکھتا ہے۔ اور اسی لیے اسے \"کن\" (ہو جا) کہا جاتا ہے، اور \"کن\" وجودی حرف ہے، کیونکہ اگر وہ پہلے سے موجود ہوتا تو اسے \"کن\" نہ کہا جاتا۔\n\nاور یہ ممکنات (الممکنات) اس برزخ (البرزخ) میں اس حالت میں ہیں جس پر وہ ہیں، اور اس حالت میں ہوں گی جب وہ ان احوال، اعراض، صفات اور اکوان (کائناتوں) سے متصف ہوں گی جن سے وہ متصف ہوتی ہیں۔ اور یہی وہ عالم ہے جو لامتناہی ہے اور جس کی کوئی انتہا نہیں ہے۔ اور یہی وہ آباد کرنے والا ہے جس نے اس زمین کو آباد کیا جو آدم علیہ السلام کی مٹی کے خمیر کے باقی ماندہ حصے سے پیدا کی گئی تھی، اس طرح کہ دیکھنے والے کے لیے چمکدار جسم میں ظاہر ہونے والی صورتوں کی آباد کاری، ایک افاضہ (فیضان) کی آباد کاری ہے۔\n\nاور اسی برزخ (البرزخ) سے ممکنات (الممکنات) کا وجود ہے، اور اسی سے ذات حق (الحق) کا اشیاء کو ان کے وجود میں آنے سے پہلے دیکھنا متعلق ہے۔ اور ہر وہ انسان جو خیال اور تخیل رکھتا ہے، جب کسی چیز کا تخیل کرتا ہے تو اس کی نظر اسی برزخ (البرزخ) تک پھیل جاتی ہے، حالانکہ وہ نہیں جانتا کہ وہ اس چیز کو اسی حضور (الحضرة) میں دیکھ رہا ہے۔\n\nاور یہ موجودات ممکنات (الموجودات الممكنات) جنہیں ذات حق تعالیٰ نے وجود بخشا ہے، وہ ان اعیان (الأعيان) کے لیے جو اس برزخ (البرزخ) میں شامل ہیں، اجسام کے لیے سائے (الظلالات) کی مانند ہیں، بلکہ یہ حقیقی سائے ہیں۔ اور یہی وہ ہیں جنہیں ذات حق سبحانہ نے ان کے اعیان کے سجدے کے ساتھ اپنے لیے سجدہ کرنے سے موصوف کیا ہے۔ پس وہ اعیان اپنے وجود سے پہلے بھی ہمیشہ سجدہ ریز تھیں، پھر جب ان کے سائے وجود میں آئے تو وہ اللہ تعالیٰ کے لیے سجدہ کرتے ہوئے پائے گئے، ان اعیان کے سجدے کی وجہ سے جن سے وہ وجود میں آئے، خواہ وہ آسمان، زمین، سورج، چاند، ستارے، پہاڑ، درخت، چوپائے اور ہر موجود چیز ہو۔\n\nپھر ان سایوں (الظلالات) کے لیے جو ان اعیان ثابتہ (الأعيان الثابتة) سے ظاہر ہوئے، اس حیثیت سے کہ وہ اجسام بن گئے، ذات حق (الحق) نے مزید سائے پیدا کیے جو ان کے لیے اس بات پر دلالت کرتے ہیں کہ وہ کہاں سے صادر ہوئے ہیں۔ پھر یہ سائے نور کے جھکاؤ کے ساتھ اس جسم کی حد سے زیادہ پھیلتے ہیں جس سے وہ ظاہر ہوتے ہیں، اس حد تک کہ ان کی لمبائی کا ادراک نہیں کیا جا سکتا۔ اس کے باوجود ان کی نسبت اسی جسم کی طرف کی جاتی ہے۔ اور یہ اس بات پر تنبیہ ہے کہ وہ عین جو برزخ (البرزخ) میں ہے اور جس سے یہ وجود میں آئے ہیں، اس کی کوئی انتہا نہیں ہے، جیسا کہ ہم نے ہستی مطلقہ (الوجود المطلق) اور عدم مطلق (العدم المطلق) کے درمیان فاصلہ کرنے والے اس برزخی حضور (الحضرة البرزخية) میں اسے مقرر کیا ہے۔\n\nاور تو ان دونوں سایوں کے درمیان ایک مقدار والا ہے، پس تو ایک ایسے حضور (الحضرة) سے موجود ہوا ہے جس کی کوئی مقدار نہیں، اور تجھ سے ایک ایسا سایہ ظاہر ہوتا ہے جس کی کوئی مقدار نہیں۔ پس اس کا پھیلاؤ اس برزخی حضور (الحضرة البرزخية) کو طلب کرتا ہے۔ اور وہ برزخی حضور (الحضرة البرزخية) ہستی مطلقہ (الوجود المطلق) کا سایہ ہے، اس اسم \"النور\" کی وجہ سے جو اس کی ہستی (الوجود) پر لاگو ہوتا ہے۔ اسی لیے ہم اسے سایہ کہتے ہیں۔ اور اعیان (الأعيان) کا وجود اس سائے کا سایہ ہے، اور محسوس سائے (الظلالات المحسوسة) حس میں ان موجودات کے سائے ہیں۔\n\nاور چونکہ سایہ زوال کے حکم میں ہوتا ہے نہ کہ ثبات کے حکم میں، اور ممکنات (الممکنات) اگرچہ موجود ہوں، عدم کے حکم میں ہوتی ہیں، اس لیے انہیں سائے (ظلالات) کہا گیا تاکہ ان کے درمیان اور اس کے درمیان فرق کیا جا سکے جسے ہستی (الوجود) میں ثبات مطلق حاصل ہے، اور وہ واجب الوجود ہے، اور اس کے درمیان جسے عدم میں ثبات مطلق حاصل ہے، اور وہ محال ہے، تاکہ مراتب ممتاز ہو جائیں۔\n\nپس موجود اعیان (الأعيان الموجودات) جب ظاہر ہوتی ہیں تو وہ اسی برزخ (البرزخ) میں ہوتی ہیں، کیونکہ وہاں کوئی ایسا حضور (الحضرة) نہیں ہے جس کی طرف وہ نکلیں۔ پس اسی میں وہ وجود کی حالت حاصل کرتی ہیں، اور اس میں جو وجود حاصل ہوتا ہے وہ متناہی ہوتا ہے، جبکہ اس میں ایجاد (پیدا کرنا) ختم نہیں ہوتا۔\n\nپس کوئی بھی موجود صورت ایسی نہیں ہے مگر عین ثابتہ (العين الثابتة) ہی اس کی عین ہے، اور وجود اس پر لباس کی مانند ہے۔ پس جب ذات حق (الحق) اپنے اولیاء (أوليائه) میں سے کسی ولی کی طرف کسی امر کی وحی کرنا چاہتا ہے تو ذات حق (الحق) اس امر کی صورت میں اس عین کے لیے ظہور الٰہی (التجلی) فرماتا ہے جو اس خاص ولی کی حقیقت ہے۔ پس وہ اس ظہور الٰہی (التجلی) سے محض مشاہدہ (المشاهدة) کے ذریعے وہ سب سمجھ لیتا ہے جو ذات حق اسے سکھانا چاہتا ہے۔ چنانچہ ولی اپنے اندر اس علم کو پاتا ہے جو وہ پہلے نہیں جانتا تھا، جیسا کہ نبی علیہ السلام نے ضرب (مار) میں اور دودھ پینے میں علم پایا تھا۔\n\nاور اولیاء (الأولياء) میں سے کچھ ایسے ہیں جو اس کا شعور رکھتے ہیں اور کچھ ایسے ہیں جو اس کا شعور نہیں رکھتے۔ پس جو شعور نہیں رکھتا وہ کہتا ہے کہ میرے دل میں فلاں فلاں بات آئی، اور جو وہ کہتا ہے وہ اسی حد پر ہوتا ہے جو وہ کہتا ہے۔ پس جو شخص اس مقام کو جانتا ہے وہ پہچان لیتا ہے کہ اس ولی نے کس مقام سے کلام کیا ہے، اور وہ اس شخص سے زیادہ کامل ہے جو نہیں جانتا۔ اور یہی شیاطین سے عصمت (العصمة) کا حضور (الحضرة) ہے، پس یہ خالص وحی ہے جس میں کوئی فساد پیدا کرنے والی چیز شامل نہیں ہوتی۔\n\nاور اگر تجھ پر اس برزخ (البرزخ) کا معاملہ مشتبہ ہو جائے، جبکہ تو اہل اللہ میں سے ہے، تو اللہ تعالیٰ کے اس فرمان پر غور کر: \"اس نے دو سمندروں کو ملا دیا جو آپس میں ملتے ہیں، ان دونوں کے درمیان ایک برزخ (بَرْزَخٌ) ہے کہ وہ تجاوز نہیں کرتے (لا يَبْغِيانِ)\"۔ (مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ) یعنی اگر وہ برزخ نہ ہوتا تو ان میں سے کوئی ایک دوسرے سے ممتاز نہ ہوتا، اور معاملہ مشتبہ ہو جاتا اور حقائق کے الٹ جانے کا سبب بنتا۔\n\nپس کوئی بھی دو متقابل چیزیں ایسی نہیں ہیں مگر ان کے درمیان ایک برزخ (برزخ) ہوتا ہے جو تجاوز نہیں کرتا (لا يَبْغِيانِ)، یعنی ان میں سے کوئی ایک دوسرے کی اس صفت سے موصوف نہیں ہوتا جس سے امتیاز واقع ہوتا ہے۔ اور یہی جنت میں داخل ہونے کا مقام ہے جو صرف اللہ کی رحمت سے حاصل ہوتی ہے۔ اسی لیے اس کے لیے کوئی عمل درست نہیں ہوتا جب وہ اس میں داخل ہو رہا ہوتا ہے۔ پس تو اس صفت سے متصف نہیں ہوتا کہ تو داخل ہو چکا ہے اور نہ ہی اس سے کہ تو باہر ہے۔ اور یہ ایک وہمی خط ہے جو جنت سے باہر والے اور اس میں داخل ہونے والے کے درمیان فرق کرتا ہے۔\n\nپس یہ اس حال کی طرح ہے جو ہستی (الوجود) اور عدم کے درمیان فاصلہ کرتا ہے، پس یہ نہ موجود ہے اور نہ معدوم۔ اگر تو اس کی نسبت ہستی (الوجود) کی طرف کرے تو تو اس میں اس کی بو پائے گا کیونکہ یہ ثابت ہے، اور اگر تو اس کی نسبت عدم کی طرف کرے تو تو سچ کہے گا کیونکہ اس کا کوئی وجود نہیں ہے۔ اور اشاعرہ پر تعجب ہے کہ وہ اس شخص پر کیسے انکار کرتے ہیں جو کہتا ہے کہ معدوم اپنی عدم کی حالت میں ایک شے ہے اور اس کی ایک عین ثابتہ (عين ثابتة) ہے، پھر اس عین پر وجود طاری ہوتا ہے، اور وہ احوال کو ثابت کرتے ہیں۔ اے اللہ! احوال کا انکار کرنے والا اس بات پر قادر نہیں ہو سکتا۔\n\nپھر یہ برزخ (البرزخ) جو کہ ہستی (الوجود) اور عدم کے درمیان ممکن (الممكن) ہے، اس کی طرف ثبوت کی نسبت کے ساتھ عدم کی نسبت کا سبب یہ ہے کہ وہ اپنی ذات سے دونوں امور کا مقابلہ کرتا ہے۔ اور وہ اس طرح کہ عدم مطلق (العدم المطلق) ہستی مطلقہ (الوجود المطلق) کے لیے آئینے کی طرح کھڑا ہوا، پس ہستی (الوجود) نے اس میں اپنی صورت دیکھی، تو وہ صورت عین ممکن (عين الممكن) بن گئی۔ اسی لیے ممکن (الممكن) کے لیے اس کی عدم کی حالت میں ایک عین ثابتہ (عين ثابتة) اور شیئیت تھی۔ اور اسی لیے وہ ہستی مطلقہ (الوجود المطلق) کی صورت پر ظاہر ہوا، اور اسی لیے وہ لامتناہیت کی صفت سے بھی متصف ہوا، پس اس کے بارے میں کہا گیا کہ وہ لامتناہی ہے۔\n\nاور ہستی مطلقہ (الوجود المطلق) بھی عدم مطلق (العدم المطلق) کے لیے آئینے کی طرح تھی، پس عدم مطلق (العدم المطلق) نے ذات حق (الحق) کے آئینے میں خود کو دیکھا، تو وہ صورت جو اس نے اس آئینے میں دیکھی، وہ عین عدم تھی جس سے یہ ممکن (الممكن) متصف ہوا، اور وہ اس صفت سے موصوف ہے کہ وہ لامتناہی ہے، جیسا کہ عدم مطلق (العدم المطلق) لامتناہی ہے۔ پس ممکن (الممكن) اس صفت سے متصف ہوا کہ وہ معدوم ہے۔\n\nپس وہ دیکھنے والے اور آئینے کے درمیان ظاہر ہونے والی صورت کی طرح ہے، نہ وہ عین دیکھنے والا ہے اور نہ اس کے علاوہ کوئی اور۔ پس ممکن (الممكن) اپنے ثبوت کی حیثیت سے نہ عین ذات حق (الحق) ہے اور نہ اس کے علاوہ کوئی اور، اور نہ ہی وہ اپنے عدم کی حیثیت سے عین محال ہے اور نہ اس کے علاوہ کوئی اور۔ پس گویا یہ ایک اضافی امر ہے۔ اور اسی لیے ایک گروہ نے ممکن (الممكن) کی نفی کی طرف رجوع کیا اور کہا کہ واجب یا محال کے سوا کچھ نہیں ہے، اور انہوں نے امکان (الإمكان) کو نہیں سمجھا۔\n\nپس ممکنات (الممكنات)، جیسا کہ ہم نے مقرر کیا، ذات حق (الحق) کے ظہور الٰہی (تجلی) سے اعیان ثابتہ (أعيان ثابتة) ہیں، اور عدم کے ظہور الٰہی (تجلی) سے معدوم ہیں۔ اور اسی حضور (الحضرة) سے ذات حق (الحق) نے خود کو جانا، پس اس نے عالم کو جانا، اور اس کا علم عالم کے ساتھ ازل سے اپنی ذات کے ذریعے متعلق ہے، اس حالت پر جو عالم ہمیشہ رہے گا، جس کی حالت وجود نہیں ہے۔ ذات حق (الحق) کو اس سے نہ علم میں اضافہ ہوتا ہے، نہ وہ فائدہ اٹھاتا ہے، اور نہ ہی رؤیت۔ اللہ تعالیٰ اپنی ذات میں زیادتی اور فائدہ اٹھانے سے پاک ہے۔\n\nاگر تو کہے کہ ممکنات (الممكنات) کے احوال مختلف ہیں، اور جب ممکن ایک حالت میں ہوتا ہے تو اس کا مقابل دوسری حالت میں نہیں ہوتا، اور ایک کے ظاہر ہونے سے دوسرا معدوم ہو جاتا ہے، تو ذات حق کو اس مرتبے کا علم کہاں سے ہوا؟ ہم تجھے جواب دیں گے کہ اگر تو مومن ہے تو جواب آسان ہے، اور وہ یہ کہ اس نے یہ بھی اپنی ذات سے جانا، اور ممکن (الممكن) نے یہ صفت اپنے خالق سے حاصل کی۔\n\nاور تیرے لیے ذات حق (الحق) کے کلام میں الٰہی نسخ (منسوخ کرنا) ثابت ہو چکا ہے جو اس نے شریعت میں مقرر کیا، اور تیرے نزدیک آخرت میں ذات حق (الحق) کا مختلف صورتوں میں ظہور الٰہی (تجلی) ثابت ہو چکا ہے۔ پس وہ صورت جس میں وہ تبدیل ہوا، اس صورت سے کہاں ہے جس سے وہ تبدیل ہوا؟ پس یہی ممکنات (الممكنات) کے ایک حال سے دوسرے حال میں پلٹنے کی اصل ہے، جو الٰہی صورتوں کے تنوع کی وجہ سے متنوع ہوتا ہے۔\n\nاگر تو کہے کہ اس تنوع کا تعلق کس سے ہے؟ کیا اس کا تعلق ارادہ (الإرادة) سے ہے؟ ہم کہیں گے: نہیں۔ کیونکہ ارادہ (الإرادة) کے لیے اختیار نہیں ہے، اور نہ ہی کتاب و سنت نے اس کا ذکر کیا ہے، اور نہ ہی عقل نے اس پر دلالت کی ہے۔ بلکہ یہ مشیئت (المشيئة) کے لیے ہے، پس اگر وہ چاہے تو ہو جاتا ہے، اور اگر نہ چاہے تو نہیں ہوتا۔\n\nآپ صلی اللہ علیہ وسلم نے فرمایا: \"جو اللہ چاہے وہ ہوتا ہے اور جو نہ چاہے وہ نہیں ہوتا۔\" (ما شاء الله كان وما لم يشأ لم يكن)\n\nپس نفی اور اثبات کو مشیئت (المشيئة) سے متعلق کیا گیا، اور یہ نہیں آیا کہ \"جو نہ چاہے وہ نہیں ہوتا\" بلکہ یہ آیا ہے کہ \"اگر ہم چاہتے کہ ایسا ہو تو ایسا ہو جاتا\"۔ پس اختیار (الاختيار) مفہوم سے خارج ہو گیا۔ پس ارادہ (الإرادة) مشیئت (المشيئة) کا مراد سے تعلق ہے، اور یہی اس کا فرمان ہے: \"ہم جب کسی چیز کا ارادہ کرتے ہیں (إِذا أَرَدْناهُ) تو ہمارا قول صرف یہ ہوتا ہے\" (إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ)۔ یہ مشیئت (المشيئة) کا تعلق ہے۔ اور اہل طریق میں سے بعض لوگوں کا خیال ہے کہ مشیئت (المشيئة) ذات کا عرش ہے، اور وہ \"ابو طالب\" ہے، یعنی اس کی بادشاہت۔ یعنی مشیئت (المشيئة) کے ذریعے ذات کا بادشاہ ہونا ظاہر ہوا، کیونکہ اختیار (الاختيار) اس سے متعلق ہے۔\n\nپس اختیار (الاختيار) ذات کے لیے اس حیثیت سے ہے کہ وہ الٰہ ہے، پس اگر وہ چاہے تو کرتا ہے اور اگر نہ چاہے تو نہیں کرتا۔ اور یہی الٰہی تردد ہے۔\n\nصحیح حدیث میں ہے: \"میں نے کسی ایسے کام میں تردد نہیں کیا جسے میں کرنے والا ہوں، جتنا کہ میں نے مومن کی روح قبض کرنے میں تردد کیا، جو موت کو ناپسند کرتا ہے۔\" (ما ترددت في شيْء أنا فاعله ترددي في قبض نسمة المؤمن يكره الموت)\n\nاور علم ذات کے لیے اس حیثیت سے ہے کہ وہ ذات ہے۔ اور اسی لیے علم کے ساتھ جبر کی بو ظاہر ہوتی ہے، اور مشیئت (المشيئة) کے ساتھ اختیار (الاختيار) ظاہر ہوتا ہے۔ پس جس چیز کا حکم ہو چکا اور علم میں سبقت لے چکا، وہ نہ عقلاً بدلتا ہے اور نہ شرعاً: \"میرے ہاں بات بدلی نہیں جاتی (ما يُبَدَّلُ الْقَوْلُ لَدَيَّ)\"۔ اور اس میں جبر کی بو کی وجہ سے اس کے بعد یہ فرمایا: \"اور میں بندوں پر ظلم کرنے والا نہیں ہوں (وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ)\"، تاکہ کوئی گمان کرنے والا یہ گمان نہ کرے، کیونکہ اس میں حکم علم کا تھا، تو اسے کیوں پکڑا گیا جبکہ وہ مجبور ہے اور مختار نہیں؟\n\nاور جس نے وہ جان لیا جو ہم نے ذات حق (الحق) کے عدم کے آئینے میں ظہور الٰہی (تجلی) کے بارے میں ذکر کیا، تاکہ ممکنات (الممكنات) کے اعیان کی صورتیں وجوب کی صورت پر ظاہر ہوں، تو اس پر یہ سب آسان ہو گیا، اور اس نے اپنی اصل کو پہچان لیا اور ہمیشہ کی راحت پائی، اور جان لیا کہ ممکن (الممكن) اپنے امکان (إمكانه) کے حضور (الحضرة) سے نہ اپنی وجود کی حالت میں نکلا ہے اور نہ اپنی عدم کی حالت میں۔ اور ظہور الٰہی (التجلی) اس کے ساتھ رہتا ہے، اور احوال اس پر بدلتے اور طاری ہوتے رہتے ہیں۔ پس وہ ایک عدمی حال اور ایک وجودی حال کے درمیان ہے، اور عین وہی عین ہے۔\n\nاور یہ علم مکنون (پوشیدہ علم) میں سے ہے، جس کے بارے میں کہا گیا ہے کہ علم میں سے کچھ ایسا ہے جو پوشیدہ خزانے کی طرح ہے، اسے اللہ کو جاننے والوں (العالمون بالله) کے سوا کوئی نہیں جانتا۔ پس جب وہ اس کے ساتھ کلام کرتے ہیں تو اس کا انکار صرف وہی کرتے ہیں جو اللہ کے بارے میں غفلت میں ہیں۔\n\nاور اسی لیے جنات اور ارواح، اگر ان کی طرف نبی صلی اللہ علیہ وسلم کو بھیجا جاتا، تو وہ انسانوں کی نسبت زیادہ بہتر جواب دیتے جب آپ ان پر قرآن پڑھتے تھے، اور آپ نے اپنے صحابہ سے بھی یہی فرمایا۔ اور یہ اس لیے ہے کہ وہ اس حضور (الحضرة) سے زیادہ قریب نسبت رکھتے ہیں اور عالم غیب (عالم الغيب) سے بھی۔ کیونکہ ان کے لیے ظاہری اور باطنی طور پر صورتوں میں تبدیل ہونا ممکن ہے۔ پس ان کا کلام اللہ کو سننا زیادہ قابل اعتماد اور بہتر تھا، کیونکہ وہ حال سے حال میں تیزی سے متنوع ہونے اور پلٹنے میں شریک ہیں، اور یہ کلام کی صفات میں سے ہے۔ پس وہ اس صفت کے ساتھ زیادہ قریب مناسبت رکھتے ہیں اور ہم سے زیادہ اللہ کے کلام کو جانتے ہیں۔\n\nکیا تو نہیں دیکھتا کہ جب انہیں سننے سے روک دیا گیا اور آسمان اور ان کے درمیان شہاب ثاقب کے ذریعے رکاوٹ ڈال دی گئی، تو انہوں نے کہا: \"یہ کسی ایسے امر کی وجہ سے ہی ہوا ہے جو نیا پیش آیا ہے\"۔ پس زوبعہ نے اپنے ساتھیوں اور دوسروں کو حکم دیا کہ وہ زمین کے مشرق و مغرب میں گھومیں تاکہ دیکھیں کہ یہ کون سا امر ہے جو پیش آیا ہے اور جس نے انہیں آسمان تک پہنچنے سے روک دیا ہے۔ پس جب زوبعہ کے ساتھی تہامہ پہنچے تو وہ ایک کھجور کے درخت کے پاس سے گزرے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فجر کی نماز پڑھتے ہوئے پایا، اور آپ قراءت کر رہے تھے۔ جب انہوں نے قرآن سنا تو اس کی طرف کان لگائے اور کہا: \"یہی وہ چیز ہے جس نے ہمارے اور آسمان کی خبر کے درمیان رکاوٹ ڈال دی ہے۔\"\n\nپس اگر انہیں قرآن کے مرتبے اور اس کی عظمت کا علم نہ ہوتا تو وہ اس بات کو نہ سمجھ پاتے۔ پس وہ اپنی قوم کی طرف ڈرانے والے بن کر لوٹے (وَلَّوْا إِلى‏ قَوْمِهِمْ مُنْذِرِينَ)۔ پھر انہوں نے کہا: \"اے ہماری قوم! ہم نے ایک ایسی کتاب سنی ہے جو موسیٰ کے بعد نازل کی گئی ہے، جو اپنے سے پہلے کی تصدیق کرتی ہے، حق کی طرف اور سیدھے راستے کی طرف رہنمائی کرتی ہے۔ اے ہماری قوم! اللہ کے داعی کی بات مانو اور اس پر ایمان لاؤ، وہ تمہارے گناہوں کو بخش دے گا اور تمہیں دردناک عذاب سے پناہ دے گا۔\" (قالُوا يا قَوْمَنا إِنَّا سَمِعْنا كِتاباً أُنْزِلَ من بَعْدِ مُوسى‏ مُصَدِّقاً لِما بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ يا قَوْمَنا أَجِيبُوا داعِيَ الله وآمِنُوا به يَغْفِرْ لَكُمْ من ذُنُوبِكُمْ ويُجِرْكُمْ من عَذابٍ أَلِيمٍ) اور انہوں نے کہا: \"ہم نے ایک عجیب قرآن سنا ہے (إِنَّا سَمِعْنا قُرْآناً عَجَباً) جو ہدایت کی طرف رہنمائی کرتا ہے، پس ہم اس پر ایمان لائے، اور ہم اپنے رب کے ساتھ کسی کو شریک نہیں کریں گے (ولَنْ نُشْرِكَ بِرَبِّنا أَحَداً)، اور یہ کہ ہمارے رب کی شان بہت بلند ہے (أَنَّهُ تَعالى‏ جَدُّ رَبِّنا)، اس نے نہ کوئی بیوی بنائی ہے اور نہ کوئی بیٹا (ما اتَّخَذَ صاحِبَةً ولا وَلَداً)۔\"\n\nاور اسی طرح جب آپ نے جنات کی رات ان پر سورۃ الرحمن کی تلاوت کی، تو آپ جس آیت سے گزرتے جس میں یہ فرمایا گیا تھا: \"پس تم دونوں اپنے رب کی کون کون سی نعمتوں کو جھٹلاؤ گے؟ (فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ)\"، تو وہ کہتے: \"اے ہمارے رب! ہم تیری کسی بھی نعمت کو نہیں جھٹلاتے۔\"\n\nاور جب رسول اللہ صلی اللہ علیہ وسلم نے اس کے بعد اپنے انسانی صحابہ پر اس کی تلاوت کی تو انہوں نے وہ کچھ نہیں کہا جو جنات نے کہا تھا۔ تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: \"میں نے اس کی تلاوت تمہارے بھائیوں جنات پر کی تھی، تو وہ تم سے زیادہ بہتر سننے والے تھے، ان سے جب بھی پوچھا گیا: 'پس تم دونوں اپنے رب کی کون کون سی نعمتوں کو جھٹلاؤ گے؟ (فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ)' تو انہوں نے کہا: 'اے ہمارے رب! ہم تیری کسی بھی نعمت کو نہیں جھٹلاتے۔'\"\n\nاور ہم نے جنات کے اس گروہ میں سے ایک شخص سے ایک غریب حدیث روایت کی ہے، جسے مجھے حلب میں میرے گھر پر نابینا ابراہیم بن سلیمان نے بیان کیا، جو خابور کے علاقوں میں سے دیر الرمان سے تعلق رکھتے تھے، انہوں نے ایک ثقہ لکڑہارے سے روایت کی، جس نے ایک سانپ کو مار ڈالا تھا۔ جنات نے اسے اچک لیا اور اپنے ایک بڑے شیخ کے سامنے پیش کیا جو ان کا سردار تھا۔ انہوں نے اس سے کہا: \"اس نے ہمارے چچا زاد بھائی کو مار ڈالا ہے۔\" لکڑہارے نے کہا: \"میں نہیں جانتا تم کیا کہہ رہے ہو، میں تو صرف ایک لکڑہارا ہوں، ایک سانپ میرے سامنے آیا تو میں نے اسے مار ڈالا۔\" جماعت نے کہا: \"وہ ہمارا چچا زاد بھائی تھا۔\" تو شیخ رضی اللہ عنہ نے فرمایا: \"اس آدمی کو چھوڑ دو اور اسے اس کی جگہ واپس پہنچا دو، تمہارا اس پر کوئی حق نہیں ہے۔\"\n\n\"کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا ہے، آپ ہم سے فرما رہے تھے: 'جو شخص اپنی صورت کے علاوہ کسی اور صورت میں ظاہر ہو اور مارا جائے، تو اس میں نہ دیت ہے اور نہ قصاص۔' (من تصور في غير صورته فقتل فلا عقل فيه ولا قود)\"\n\n\"اور تمہارے چچا زاد بھائی نے ایک سانپ کی صورت اختیار کی تھی، اور وہ انسانوں کے دشمنوں میں سے ہے۔\" لکڑہارے نے کہا: \"میں نے اس سے کہا: اے شخص! میں دیکھتا ہوں کہ تو کہتا ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا ہے، کیا تو نے انہیں پایا تھا؟\" اس نے کہا: \"ہاں، میں نصیبین کے ان جنات میں سے ایک ہوں جو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے تھے اور ہم نے آپ سے سنا تھا۔ اور اس جماعت میں سے میرے سوا کوئی باقی نہیں رہا۔ پس میں اپنے ساتھیوں میں اسی کے مطابق فیصلہ کرتا ہوں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے۔\" اور اس جن نے ہمیں اپنا نام نہیں بتایا اور نہ ہی میں نے اس کا نام پوچھا۔ اور یہ حدیث اس شیخ نے بھی بیان کی جس نے ہمیں یہ حدیث سنائی تھی، میرے ساتھی شمس الدین محمد بن برتقش المعظمی اور برہان الدین اسماعیل بن محمد الایدنی نے بھی حلب میں۔ کیونکہ میں انہیں یہ حدیث سنا رہا تھا، پھر جب ہم حلب شہر آئے تو میں نے ان دونوں کو اس کے پاس بھیجا تاکہ وہ انہیں اسی طرح سنائے جس طرح اس نے مجھے سنایا تھا، تو اس نے ان دونوں کو اسی طرح سنایا جس طرح مجھے سنایا تھا۔\n\nپس ہر برزخی عالم (عالم برزخي) مناسبت کی قربت کی وجہ سے دیگر مخلوقات کی نسبت حضور امکان (حضرة الإمكان) کو زیادہ جانتا ہے۔ اور اس مقام کے لیے یہ مقدار کافی ہے۔ اب ہم ان علوم کا ذکر کرتے ہیں جو یہ مقام اپنے اندر رکھتا ہے:\n\nیہ مقام علم امر الٰہی (الإلهي) پر مشتمل ہے کہ آیا اس کی کوئی صفت ہے یا نہیں، اور کیا ارادہ (الإرادة) اس کی شرط ہے یا اس کی حقیقت؟ اور علم وحی اور اس کی اقسام۔ اور علم سماع۔ اور علم عالم برزخی (العالم البرزخى)۔ اور علم جبروت۔ اور علم ہدایت (الهدى)۔ اور علم عظمت الٰہیہ (العظمة الإلهية) کہ وہ کس چیز کی طرف لوٹتی ہے، کہاں ظاہر ہوتی ہے، کون اس سے موصوف ہے، کس کے لیے وہ نسبت ہے اور کس کے لیے وہ صفت ہے؟ اور علم تنزیہ (التنزيه) اور وہ کس پر لوٹتا ہے۔ اور علم اس حضور (الحضرة) کا جہاں سے اللہ نے اپنے بندوں کی زبانوں کو اپنی ذات کے بارے میں ایسی باتیں کہنے کی اجازت دی جو عقلی دلیل کے مطابق اس کے لائق نہیں ہیں، اور کیا اس کے لیے کوئی الٰہی رُخ ہے جس پر اس سلسلے میں بھروسہ کیا جا سکے یا نہیں؟ اور وہ ان کا یہ قول ہے: \"بیشک اللہ فقیر ہے (إِنَّ الله فَقِيرٌ)\"، اور یہ کہ عیسیٰ اللہ کا بیٹا ہے، اور اسی طرح عزیر، اور \"اللہ کا ہاتھ بندھا ہوا ہے (يَدُ الله مَغْلُولَةٌ)\"، جیسا کہ اللہ نے ان سے حکایت کی ہے، اور اس طرح کی مثالیں۔ اور علم ظن (گمان) اور اس کا حکم، اور اس میں سے محمود (قابل تعریف) اور مذموم (قابل مذمت) کیا ہے، اور اس کا تعلق کس سے ہے۔ اور علم ایمان۔ اور علم اس چیز کا جس پر بھروسہ کرنا چاہیے ان لوگوں میں سے جو بھروسہ نہیں کرتے، اور اس کی صفت کیا ہے، اور اس میں سے کیا جائز ہے اور کیا ناجائز ہے۔ اور علم کواکب کے مراتب۔ اور علم آسمان سے روحانیوں (الروحانيين) کے منازل۔ اور علم خلق کے احوال۔ اور علم صدیقین۔ اور علم اللہ اور اس کے بندے کے درمیان سبقت (المسابقة) کا۔ اور علم مکر اور فتنوں کا۔ اور علم اللہ کے احکام کی تعمیل کا۔ اور علم غیب (الغيب) کے مراتب، اور وہ علم غیب جس میں ذات حق (الحق) اپنے خلق کے بغیر منفرد ہے۔ اور وہ علم غیب جو جانا جا سکتا ہے، اور کیا اس کا علم عالم کے حق میں اس سے غیب کا نام ہٹا دیتا ہے یا نہیں؟ اور اللہ تعالیٰ کا یہ فرمان: \"غیب کا جاننے والا (عالِمُ الْغَيْبِ)\"، اس میں غیب کا اطلاق کس چیز کی طرف لوٹتا ہے؟ کیا اس وجہ سے کہ وہ ہم سے غیب ہے یا اپنی ذات میں غیب ہے، اس حیثیت سے کہ اس نے اسے رؤیت کے تعلق سے موصوف نہیں کیا تاکہ وہ شہادت (مشاہدہ) بن جائے؟ اور علم عصمت (العصمة)۔ اور علم کا لامتناہی چیز سے تعلق، کیا وہ احاطہ (الإحاطة) کے طریقے پر متعلق ہوتا ہے یا نہیں؟\n\nاور نبی صلی اللہ علیہ وسلم کا اسماء حسنیٰ کے بارے میں یہ فرمان: \"جس نے انہیں شمار کیا (أحصاها) وہ جنت میں داخل ہوا۔\" (من أحصاها دخل الجنة)\n\nاور احصاء (الإحصاء) کا کیا معنی ہے اور وہ کس چیز کی طرف لوٹتا ہے؟ اور کیا اس کے تحت وہ چیزیں آتی ہیں جو لامتناہی ہیں، جیسا کہ احاطہ (الإحاطة) کے تحت آتی ہیں یا نہیں آتیں؟ اور احاطہ (الإحاطة) اور احصاء (الإحصاء) میں کیا فرق ہے؟ کیونکہ ایک چیز کا احاطہ کیا جا سکتا ہے لیکن اسے شمار (احصاء) نہیں کیا جا سکتا۔ اور اللہ حق کہتا ہے (يَقُولُ الْحَقَّ) اور وہی راستہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب سیصد و دوازدهم: در معرفت منزل کیفیت نزول وحی بر دل‌های اولیاء و حفظ ایشان از شیاطین در آن، از منظر حضرت محمدیه (الحضرة المحمدية).\n\nبگو به آنکه انسان را از علق آفرید\nبه راستی که پیمان‌های علق را به او بستم.\n\nبگو به آنکه انسان را از علق آفرید\nبه راستی که او را به صورت جمعی و منظم آوردم.\n\nبگو به آنکه انسان را از علق آفرید\nحق آشکار است، میان نص و گردن.\n\nبگو به آنکه انسان را از علق آفرید\nعهد توحیدت را بر گردنم نهادم.\n\nبگو به آنکه انسان را از علق آفرید\nچگونه است تخلق به اسماء و خلق؟\n\nبگو به آنکه انسان را از علق آفرید\nمرا محجوب مکن، که این آخرین رمق است.\n\nبگو به آنکه انسان را از علق آفرید\nعلم هنگام درهم آمیختن مردم با عرق است.\n\nبگو به آنکه انسان را از علق آفرید\nبه من آموختی که عین امر در نقب (گذرگاه) است.\n\nزیرا مرا بصیرتی است که پلکی آن را در بر نمی‌گیرد؛\nو مرا بصری است که با حدقه احاطه شده است.\n\nبگو به آنکه انسان را از علق آفرید\nبه راستی که وجود هستی را در یک طبقه قرار دادی.\n\nاما چون امر را از جانب خود دیدم،\nوجودی که مشاهده کردم مطابق با آن طبقه بود.\n\nپس همه در تاریکی طبقات محصورند؛\nاز این رو او را بسیار مشتاق و مضطرب می‌بینی.\n\nپس صاحب فلق (سپیده‌دم) که ظاهرش مشهود است،\nحقایق را در سحرها و تاریکی شب (غسق) می‌بیند.\n\nو صاحب غسق که باطنش مشهود است،\nحقایق را در انوار و فلق می‌بیند.\n\nپس همه در حضرت تقیید (محدودیت) باقی مانده‌اند؛\nاگر چراغی از آن به او برسد، تاب نمی‌آورد.\n\nپس پیوسته بر بلای دگرگونی‌اش باقی است؛\nو اگر سوختن او را به شگفتی اندازد، او را مضطرب می‌سازد.\n\nو عشقش در آن، بر رنج و سختی او افزود؛\nو عشق (عِشق) واژه‌ای است که از عَشَق (پیچک) مشتق شده است.\n\nبالای آن در جنس خود، مانند پایین آن است؛\nپس قید در پا و غل در گردن است.\n\nپس روح را جسمی نگه می‌دارد که آن را تدبیر می‌کند؛\nو جسم را توافق فرق (اجزاء) نگه می‌دارد.\n\nمنظورم از توافق فرق، اجتماع طبایعی است که جسم از آن‌ها به وجود آمده است.\n\n### [به راستی که معلومات سه گونه‌اند]\n\nبدان که معلومات سه گونه‌اند و چهارمی ندارند: اول، هستی مطلق (الوجود المطلق) که مقید نمی‌شود و آن هستی خداوند متعال است که واجب الوجود بالذات است. معلوم دیگر، عدم مطلق (العدم المطلق) است که عدم بالذات است و اصلاً مقید نمی‌شود و آن محال است. این عدم مطلق در مقابل هستی مطلق قرار دارد و هر دو برابرند، به طوری که اگر وصف شوند، حکم وزن بر آن‌ها جاری می‌شود. هیچ دو نقیض متقابلی نیستند مگر اینکه میان آن‌ها فاصله‌ای وجود دارد که هر یک را از دیگری متمایز می‌سازد و این فاصله مانع از آن است که یکی به صفت دیگری متصف شود. این فاصله‌ای که میان هستی مطلق و عدم است، اگر میزان بر آن حکم کند، از نظر مقدار بدون هیچ کم و کاستی برابر خواهد بود. این همان برزخ اعلی (البرزخ الأعلى) است و آن برزخ برزخ‌هاست. این برزخ یک وجه به سوی هستی (الوجود) و یک وجه به سوی عدم دارد، پس با ذات خود با هر یک از دو معلوم مقابله می‌کند و آن معلوم سوم است. در این برزخ، تمامی ممکنات قرار دارند و آن‌ها نامتناهی هستند، همان‌طور که هر یک از دو معلوم دیگر نامتناهی است. ممکنات در این برزخ، از وجهی که هستی مطلق به آن‌ها می‌نگرد، دارای اعیان ثابت (أعيان ثابتة) هستند و از این وجه است که نام «شیء» بر آن‌ها اطلاق می‌شود؛ شیئی که اگر حق (الحق) اراده کند آن را ایجاد کند، به آن می‌گوید: «كُنْ فَيَكُونُ» (باش، پس می‌شود). و از وجهی که عدم مطلق به آن می‌نگرد، اعیان موجودی ندارد و به همین دلیل به آن «کُن» (باش) گفته می‌شود. و «کُن» حرف وجودی است، زیرا اگر شیء خود کائن (موجود) بود، به آن گفته نمی‌شد «کُن».\n\nو این ممکنات در این برزخ، با آنچه که هستند و آنچه که خواهند بود، از احوال، اعراض، صفات و اکوان (هستی‌ها) متصف می‌شوند. و این همان عالمی است که نامتناهی است و پایانی ندارد. و این همان عالم آبادانی است که زمین را که از باقیمانده خمیر گِل آدم (علیه السلام) خلق شده، آباد کرده است؛ آبادانی‌ای به صورت تصاویر ظاهری برای بیننده در جسم صیقلی، آبادانی‌ای از طریق افاضه. و وجود ممکنات از همین برزخ است و رؤیت حق (الحق) به اشیاء پیش از وجودشان به واسطه همین ممکنات تعلق می‌گیرد. و هر انسانی که دارای خیال و تخیل است، هنگامی که امری را تخیل می‌کند، نگاهش به این برزخ کشیده می‌شود، در حالی که نمی‌داند که آن شیء را در این حضرت (حضور) مشاهده می‌کند. و این موجودات ممکنه‌ای که حق تعالی آن‌ها را ایجاد کرده است، نسبت به اعیانی که این برزخ در بر دارد، به منزله سایه‌ها (الظلالات) برای اجسام هستند؛ بلکه آن‌ها سایه‌های حقیقی‌اند. و این‌ها همان‌هایی هستند که حق سبحانه آن‌ها را به سجده برای خود وصف کرده است، همراه با سجده اعیانشان. پس آن اعیان پیش از وجودشان پیوسته در حال سجده برای او بوده‌اند. هنگامی که سایه‌هایشان به وجود آمد، به واسطه سجده اعیانشان که از آن‌ها به وجود آمده بودند (از آسمان، زمین، خورشید، ماه، ستاره، کوه‌ها، درختان، جنبندگان و هر موجودی)، در حال سجده برای خداوند متعال یافت شدند. سپس برای این سایه‌ها که از آن اعیان ثابت پدیدار شدند، از آن حیث که به صورت اجسام درآمده‌اند، سایه‌هایی وجود دارد که حق آن‌ها را برایشان ایجاد کرده است تا دلالتی باشند بر معرفت خودشان که از کجا صادر شده‌اند. سپس این سایه‌ها با تمایل نور، بیشتر از حد جسمی که از آن ظاهر می‌شوند، به درازا کشیده می‌شوند تا جایی که طول آن درک نمی‌شود، با این حال به آن جسم نسبت داده می‌شود. و این تنبیهی است بر اینکه آن عین (حقیقت) که در برزخ است و این سایه‌ها از آن به وجود آمده‌اند، بی‌نهایت است، همان‌طور که در آن حضرت برزخی که میان هستی مطلق و عدم مطلق فاصله است، مقرر کردیم. و تو میان این دو سایه دارای مقدار هستی، پس تو از حضرتی به وجود آمده‌ای که مقدار ندارد و از تو سایه‌ای پدیدار می‌شود که مقدار ندارد، پس امتداد آن، آن حضرت برزخی را می‌طلبد. و آن حضرت برزخی، سایه هستی مطلق (الوجود المطلق) است که از اسم «نور» بر وجود او اطلاق می‌شود. به همین دلیل ما آن را سایه می‌نامیم، و وجود اعیان، سایه آن سایه است، و سایه‌های محسوس، سایه‌های این موجودات در عالم حس هستند.\n\nو چون سایه در حکم زوال است نه در حکم ثبات، و ممکنات اگرچه موجودند اما در حکم عدم هستند، لذا سایه‌ها (ظلالات) نامیده شدند تا میان آن‌ها و کسی که ثبات مطلق در هستی دارد (واجب الوجود) و کسی که ثبات مطلق در عدم دارد (محال)، تمایز ایجاد شود و مراتب مشخص گردند. پس اعیان موجودات هنگامی که ظاهر می‌شوند، در همین برزخ هستند، زیرا حضرت (حضور) دیگری نیست که به آن خارج شوند. در این برزخ است که حالت هستی را کسب می‌کنند، و هستی در آن، به میزانی که حاصل شده، متناهی است، اما ایجاد در آن پایان نمی‌پذیرد. هیچ صورت موجودی نیست مگر اینکه عین ثابت (العين الثابتة) همان عین آن است و هستی مانند جامه‌ای بر آن است. پس هنگامی که حق (الحق) اراده کند که امری را به ولیّی از اولیای خود وحی کند، حق در صورت آن امر بر این عین (حقیقت) که حقیقت آن ولیّ خاص است، تجلی (التجلی) می‌کند. پس ولیّ از آن تجلی، صرفاً با مشاهده (الشهود)، آنچه را که حق می‌خواهد به او بیاموزد، می‌فهمد و در نفس خود علمی را می‌یابد که پیش از آن نمی‌دانسته است، همان‌طور که پیامبر (صلی الله علیه و سلم) علم را در ضربه و در نوشیدن شیر یافت. و برخی از اولیاء این را احساس می‌کنند و برخی احساس نمی‌کنند. کسی که احساس نمی‌کند می‌گوید: «در خاطرم چنین و چنان یافتم.» و آنچه می‌گوید مطابق با همان حدی است که می‌گوید. پس کسی که این مقام را می‌شناسد، می‌داند که این ولیّ از کدام مقام سخن گفته است، و او کامل‌تر از کسی است که نمی‌داند. و آن، حضرت عصمت از شیاطین است، پس آن وحی خالص است و چیزی که آن را فاسد کند، در آن راه ندارد. و اگر امر این برزخ بر تو مشتبه شد، در حالی که تو از اهل الله هستی، به این فرموده خداوند متعال بنگر: «مَرَجَ الْبَحْرَيْنِ يَلْتَقِيانِ بَيْنَهُما بَرْزَخٌ لا يَبْغِيانِ» (دو دریا را به هم آمیخت در حالی که به هم می‌رسند، میان آن دو برزخی است که تجاوز نمی‌کنند). یعنی اگر آن برزخ نبود، یکی از دیگری متمایز نمی‌شد و امر مشتبه می‌گشت و به قلب حقایق می‌انجامید. پس هیچ دو متقابلی نیستند مگر اینکه میان آن‌ها برزخی است که تجاوز نمی‌کنند، یعنی هیچ یک به وصف دیگری که تمایز به واسطه آن رخ می‌دهد، متصف نمی‌شود. و این برزخ، محل ورود به بهشتی است که جز به رحمت خداوند به دست نمی‌آید. به همین دلیل، در حال ورود به آن، داشتن عمل برای شخص صحیح نیست. پس نه به این وصف متصف می‌شوی که وارد شده‌ای و نه به این وصف که خارج هستی. و آن خطی موهوم است که میان خارج بهشت و داخل آن فاصله می‌اندازد. پس مانند حالتی است که میان هستی (الوجود) و عدم فاصله می‌اندازد؛ نه موجود است و نه معدوم. اگر آن را به هستی نسبت دهی، بویی از آن در آن می‌یابی، به دلیل ثباتش؛ و اگر آن را به عدم نسبت دهی، راست گفته‌ای، زیرا وجودی ندارد.\n\nو شگفتا از اشاعره که چگونه بر کسی که می‌گوید معدوم در حال عدمش شیء است و عین ثابت دارد، سپس هستی بر آن عین عارض می‌شود، خرده می‌گیرند، در حالی که خودشان احوال را ثابت می‌دانند. البته کسی که منکر احوال است، این امر برایش ممکن نیست. سپس، سبب نسبت ثبوت به این برزخ که ممکن میان هستی و عدم است، همراه با نسبت عدم، مقابله آن با هر دو امر به ذات خود است. و آن این است که عدم مطلق (العدم المطلق) مانند آینه‌ای در برابر هستی مطلق (الوجود المطلق) ایستاد، پس هستی صورت خود را در آن دید. و آن صورت، عین ممکن بود. به همین دلیل، ممکن در حال عدمش دارای عین ثابت (عين ثابتة) و شیئیت بود. و به همین دلیل بر صورت هستی مطلق خارج شد و به همین دلیل نیز به عدم تناهی متصف گشت و گفته شد که نامتناهی است. و همچنین هستی مطلق نیز مانند آینه‌ای برای عدم مطلق بود. پس عدم مطلق در آینه حق (الحق) نفس خود را دید. و صورتی که در این آینه دید، عین عدمی بود که این ممکن به آن متصف شد و موصوف به نامتناهی بودن است، همان‌طور که عدم مطلق نامتناهی است. پس ممکن به معدوم بودن متصف شد. پس ممکن مانند صورتی است که میان بیننده و آینه ظاهر می‌شود؛ نه عین بیننده است و نه غیر آن. پس ممکن از حیث ثبوتش نه عین حق است و نه غیر آن، و از حیث عدمش نه عین محال است و نه غیر آن. پس گویی امری اضافی است. به همین دلیل، گروهی به نفی ممکن گرایش یافتند و گفتند: جز واجب یا محال چیزی نیست و امکان برایشان قابل تعقل نبود. ممکنات، همان‌طور که مقرر کردیم، اعیان ثابتی هستند که از تجلی حق (التجلی) حاصل شده‌اند و از تجلی عدم، معدوم هستند. و حق (الحق) از این حضرت (حضور) نفس خود را شناخت، پس عالم را شناخت. و علم او به عالم ازلی است، زیرا تجلی ازلی است و تعلق علم او به عالم ازلی است، بر آنچه که عالم همیشه بر آن خواهد بود، از اموری که حالشان وجود نیست. حق به واسطه آن نه علمش زیاد می‌شود و نه سودی می‌برد و نه رؤیتی حاصل می‌کند. خداوند متعال از افزایش در ذات خود و سود بردن منزه است. اگر بگویی: «احوال ممکنات متفاوت است و اگر ممکن در حالتی باشد که مقابل دارد، در حالت دیگر نیست و با ظهور یکی، دیگری معدوم می‌شود، پس علم حق به این مرتبه از کجا حاصل شده است؟» به او می‌گوییم: اگر مؤمن باشی، پاسخ آسان است و آن این است که او این را نیز از نفس خود دانسته است و ممکن این وصف را از خالق خود کسب کرده است. و نسخ الهی در کلام حق به واسطه آنچه تشریع کرده، برای تو ثابت شده است. و تجلی حق (الحق) در سرای آخرت در صور مختلف نزد تو ثابت شده است. پس صورتی که به آن متحول می‌شود، کجاست نسبت به صورتی که از آن متحول شده است؟ این، اصل دگرگونی ممکنات از حالی به حال دیگر است که به دلیل تنوع صور الهی، متنوع می‌شود. اگر بگویی: «این تنوع به چه چیزی تعلق دارد؟ آیا به اراده (الإرادة) تعلق دارد؟» می‌گوییم: خیر. زیرا اراده اختیار ندارد و هیچ کتاب و سنتی به آن نطق نکرده و عقلی بر آن دلالت ننموده است، بلکه این امر به مشیئت (المشيئة) تعلق دارد. اگر بخواهد، می‌شود و اگر نخواهد، نمی‌شود.\n\nپیامبر (صلی الله علیه و سلم) فرمود: «ما شاء الله كان وما لم يشأ لم يكن» (آنچه خدا بخواهد می‌شود و آنچه نخواهد نمی‌شود).\n\nپس نفی و اثبات را به مشیئت (المشيئة) معلق کرد. و وارد نشده است که «آنچه اراده نکند، نمی‌شود»، بلکه وارد شده است: «اگر اراده می‌کردیم که چنین باشد، چنین می‌شد.» پس اختیار از مفهوم خارج شد. اراده (الإرادة) تعلق مشیئت به مراد است، و این همان فرموده اوست: «إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ» (سخن ما برای چیزی هنگامی که آن را اراده کنیم). این تعلق مشیئت است. و برخی از اهل طریقت بر این باورند که مشیئت، عرش ذات است و آن «ابو طالب» است، یعنی مُلک آن. یعنی به واسطه مشیئت، مُلک بودن ذات آشکار شد، به دلیل تعلق اختیار به آن. پس اختیار برای ذات از آن جهت است که او إله است؛ اگر بخواهد انجام می‌دهد و اگر نخواهد انجام نمی‌دهد. و این همان تردید الهی است.\n\nدر خبر صحیح آمده است: «ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة المؤمن يكره الموت» (در هیچ کاری که انجام‌دهنده آن هستم، تردید نکردم، مانند تردیدم در گرفتن جان مؤمنی که مرگ را ناخوش می‌دارد).\n\nو علم برای ذات از آن جهت است که او ذات است. به همین دلیل، بوی جبر با علم ظاهر می‌شود و اختیار با مشیئت (المشيئة) ظاهر می‌گردد. پس آنچه علم بر آن حکم کرده و سبقت گرفته است، نه عقلاً و نه شرعاً تغییر نمی‌کند: «ما يُبَدَّلُ الْقَوْلُ لَدَيَّ» (سخن نزد من دگرگون نمی‌شود). و به دلیل بوی جبر در آن، به دنبالش فرمود: «وما أَنَا بِظَلَّامٍ لِلْعَبِيدِ» (و من هرگز به بندگان ستمکار نیستم)، تا کسی توهم نکند که چون حکم در آن برای علم بوده است، پس چرا به آنچه مجبور و غیرمختار است، مؤاخذه می‌شود؟ و کسی که آنچه را ذکر کردیم، یعنی تجلی حق (الحق) در آینه عدم برای ظهور صور اعیان ممکنات بر صورت وجوب، بداند، همه این‌ها بر او آسان می‌شود و اصل خود را می‌شناسد و آسایش ابدی می‌یابد و می‌داند که ممکن نه در حال وجودش و نه در حال عدمش از حضرت امکان خود خارج نشده است. و تجلی (التجلی) پیوسته همراه اوست و احوال بر او متحول و عارض می‌شوند. پس او میان حال عدمی و حال وجودی است و عین (حقیقت) همان عین است. و این از علم مکنون (پنهان) است که درباره‌اش گفته شده: «به راستی که برخی از علم‌ها مانند گنج پنهان است که جز عالمان به خدا آن را نمی‌دانند.» پس هنگامی که به آن سخن می‌گویند، جز کسانی که به خدا مغرورند، آن را انکار نمی‌کنند. و به همین دلیل، اگر جن و ارواح مبعوث می‌شدند، پاسخشان به پیامبر (صلی الله علیه و سلم) هنگامی که قرآن بر آن‌ها می‌خواند، بهتر از انسان‌ها بود. و پیامبر (صلی الله علیه و سلم) نیز به اصحابش چنین فرمود. و این بدان سبب است که آن‌ها به این حضرت (حضور) و به عالم غیب نزدیک‌ترند، زیرا آن‌ها توانایی تحول در صور، ظاهراً و باطناً، را دارند. پس گوش دادن آن‌ها به کلام خدا موثق‌تر و بهتر بود، به دلیل مشارکت در سرعت تنوع و دگرگونی از حالی به حال دیگر، که این از صفات کلام است. پس آن‌ها از نظر صفت، مناسبت نزدیک‌تری به آن دارند و نسبت به ما به کلام خدا داناترند.\n\nآیا نمی‌بینی که وقتی از شنیدن منع شدند و با شهاب‌ها میان آن‌ها و آسمان حائل شد، گفتند: «این نیست مگر به خاطر امری که رخ داده است.» پس زوبعه به یاران خود و دیگران دستور داد که شرق و غرب زمین را بگردند تا ببینند این امر جدیدی که مانع رسیدن آن‌ها به آسمان شده، چیست. هنگامی که یاران زوبعه به تهامه رسیدند، از کنار نخلستان گذشتند و رسول خدا (صلی الله علیه و سلم) را یافتند که نماز صبح می‌خواند و قرائت می‌کرد. وقتی قرآن را شنیدند، گوش فرا دادند و گفتند: «این همان چیزی است که میان ما و خبر آسمان حائل شده است.»\n\nو اگر معرفت آن‌ها به مرتبه قرآن و عظمت قدر آن نبود، متوجه این امر نمی‌شدند. پس «وَلَّوْا إِلى‏ قَوْمِهِمْ مُنْذِرِينَ» (به سوی قوم خود بازگشتند در حالی که بیم‌دهنده بودند). پس «قالُوا يا قَوْمَنا إِنَّا سَمِعْنا كِتاباً أُنْزِلَ من بَعْدِ مُوسى‏ مُصَدِّقاً لِما بَيْنَ يَدَيْهِ يَهْدِي إِلَى الْحَقِّ وإِلى‏ طَرِيقٍ مُسْتَقِيمٍ يا قَوْمَنا أَجِيبُوا داعِيَ الله وآمِنُوا به يَغْفِرْ لَكُمْ من ذُنُوبِكُمْ ويُجِرْكُمْ من عَذابٍ أَلِيمٍ» (گفتند: ای قوم ما، ما کتابی شنیدیم که پس از موسی نازل شده، تصدیق‌کننده آنچه پیش روی اوست، به سوی حق و به سوی راهی مستقیم هدایت می‌کند. ای قوم ما، دعوت‌کننده خدا را اجابت کنید و به او ایمان آورید تا گناهانتان را بیامرزد و شما را از عذابی دردناک پناه دهد). و گفتند: «إِنَّا سَمِعْنا قُرْآناً عَجَباً يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا به ولَنْ نُشْرِكَ بِرَبِّنا أَحَداً وأَنَّهُ تَعالى‏ جَدُّ رَبِّنا ما اتَّخَذَ صاحِبَةً ولا وَلَداً» (ما قرآنی شگفت‌انگیز شنیدیم که به سوی رشد هدایت می‌کند، پس به آن ایمان آوردیم و هرگز کسی را شریک پروردگارمان قرار نخواهیم داد. و اینکه شأن پروردگار ما بسیار والاست و او نه همسری گرفته و نه فرزندی).\n\nو همچنین هنگامی که سوره الرحمن را در شب جن بر آن‌ها خواند، از هیچ آیه‌ای که در آن می‌گوید: «فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ» (پس کدام یک از نعمت‌های پروردگارتان را انکار می‌کنید؟) نگذشت، مگر اینکه گفتند: «و ما هیچ یک از نعمت‌های تو را، ای پروردگار ما، انکار نمی‌کنیم.» و هنگامی که رسول خدا (صلی الله علیه و سلم) پس از آن، این سوره را بر اصحابش از انسان‌ها تلاوت کرد، چیزی از آنچه جن گفتند، نگفتند. پس رسول خدا (صلی الله علیه و سلم) به آن‌ها فرمود: «من این سوره را بر برادران شما از جن تلاوت کردم، و آن‌ها بهتر از شما به آن گوش دادند. هیچ‌گاه به آن‌ها گفته نشد: «فَبِأَيِّ آلاءِ رَبِّكُما تُكَذِّبانِ» مگر اینکه گفتند: «و ما هیچ یک از نعمت‌های تو را، ای پروردگار ما، انکار نمی‌کنیم.»\n\nو ما حدیث غریبی را از یکی از این جماعت جن روایت کرده‌ایم که ابراهیم بن سلیمان نابینا در منزل من در حلب (که او از دیر الرمان از توابع خابور بود) برایم نقل کرد، از مردی هیزم‌شکن مورد اعتماد که ماری را کشته بود. جن او را ربودند و نزد شیخ بزرگی از خودشان که رئیس قوم بود، حاضر کردند. به او گفتند: «این شخص پسرعموی ما را کشته است.» هیزم‌شکن گفت: «نمی‌دانم چه می‌گویید، من مردی هیزم‌شکن هستم که ماری سر راهم آمد و من آن را کشتم.» جماعت گفتند: «او پسرعموی ما بود.» شیخ (رضی الله عنه) فرمود: «راه مرد را باز کنید و او را به جایگاهش بازگردانید، شما بر او راهی ندارید. زیرا من از رسول خدا (صلی الله علیه و سلم) شنیدم که به ما می‌فرمود: «من تصور في غير صورته فقتل فلا عقل فيه ولا قود» (هر کس در غیر صورت خود مجسم شود و کشته شود، دیه و قصاصی ندارد). و پسرعموی شما در صورت مار مجسم شده بود و مار از دشمنان انسان است.» هیزم‌شکن گفت: «به او گفتم: ای مرد، می‌بینم که می‌گویی از رسول خدا (صلی الله علیه و سلم) شنیدی، آیا او را درک کرده‌ای؟» گفت: «بله، من یکی از جن‌های نصیبین هستم که بر رسول خدا (صلی الله علیه و سلم) وارد شدیم و از او شنیدیم، و از آن جماعت جز من کسی باقی نمانده است. پس من در میان یارانم به آنچه از رسول خدا (صلی الله علیه و سلم) شنیده‌ام، حکم می‌کنم.» و او نام آن مرد از جن را برای ما ذکر نکرد و من نیز از نامش نپرسیدم. و این حدیث را شیخی که برای ما نقل کرد، دوست من شمس‌الدین محمد بن برتقش المعظمی و برهان‌الدین اسماعیل بن محمد الأیدنی نیز در حلب برایم نقل کردند. من این حدیث را برای آن دو نقل می‌کردم، پس هنگامی که به شهر حلب آمدیم، آن دو را نزد او فرستادم تا همان‌طور که برای من نقل کرده بود، برای آن‌ها نیز نقل کند، و او همان‌طور که برای من نقل کرده بود، برای آن‌ها نیز نقل کرد. پس هر عالم برزخی به دلیل نزدیکی مناسبت، نسبت به سایر مخلوقات، به حضرت امکان (حضور امکان) داناتر است. و این مقدار از این منزل کافی است. پس اکنون علومی را که این منزل در بر دارد، ذکر می‌کنیم. و آن این است که این منزل شامل علم امر الهی است که آیا صفتی دارد یا خیر، و آیا اراده (الإرادة) شرط آن است یا از حقیقت آن، و علم وحی و انواع آن، و علم سماع، و علم عالم برزخی، و علم جبروت، و علم هدایت، و علم عظمت الهی که به چه چیزی باز می‌گردد و کجا ظاهر می‌شود و چه کسی به آن وصف شده و برای چه کسی نسبت است و برای چه کسی صفت، و علم تنزیه و به چه کسی باز می‌گردد، و علم حضرتی که خداوند از آن زبان بندگانش را بر خود به آنچه در دلیل عقلی شایسته او نیست، گشوده است، و آیا برای این امر وجه الهی وجود دارد که بتوان به آن استناد کرد یا خیر، و آن همان قول آن‌هاست که: «إِنَّ الله فَقِيرٌ» (به راستی که خدا فقیر است) و اینکه عیسی پسر خداست و همچنین عزیر، و «يَدُ الله مَغْلُولَةٌ» (دست خدا بسته است)، همان‌طور که خداوند از آن‌ها حکایت کرده است و امثال این‌ها. و علم ظن و حکم آن، و آنچه از آن ستوده و آنچه نکوهیده است و متعلق آن، و علم ایمان، و علم آنچه شایسته است که به آن استناد شود از کسی که استناد نمی‌کند و صفت آن چیست و چه چیزی از آن جایز است و چه چیزی جایز نیست، و علم مراتب کواکب، و علم منازل روحانیون از آسمان، و علم احوال خلق، و علم صدیقین، و علم مسابقه میان خدا و بنده او، و علم مکر و فتنه‌ها، و علم قیام به اوامر خدا، و علم مراتب غیب، و آنچه حق (الحق) در علم غیب به تنهایی و بدون خلقش به آن اختصاص یافته است، و آنچه از غیب که ممکن است دانسته شود، و آیا علم به آن، نام غیب را در حق عالم از بین می‌برد یا خیر، و قول خداوند متعال «عالِمُ الْغَيْبِ» (دانای غیب) به چه چیزی باز می‌گردد؟ آیا اطلاق غیب به دلیل غیب بودن آن از ماست یا غیب بودن آن در ذات خود، از آن حیث که آن را به تعلق رؤیت وصف نکرده تا شهود باشد؟ و علم عصمت، و علم تعلق علم به آنچه نامتناهی است، آیا به نحو احاطه به آن تعلق می‌گیرد یا خیر؟ و علم قول پیامبر (صلی الله علیه و سلم) درباره اسماء الحسنی: «من أحصاها دخل الجنة» (هر کس آن‌ها را احصاء کند، وارد بهشت می‌شود). و معنای احصاء چیست و به چه چیزی باز می‌گردد؟ و آیا آنچه نامتناهی است، تحت آن داخل می‌شود، همان‌طور که تحت احاطه داخل می‌شود یا خیر؟ و فرق میان احاطه و احصاء چیست؟ زیرا یک چیز احاطه می‌شود اما احصاء نمی‌شود. «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}