{
  "id": 335,
  "title": {
    "ar": "الباب الخامس والثلاثون وثلاثمائة في معرفة منزل الأخوة وهو من الحضرة المحمدية والموسوية",
    "en": "Chapter Three Hundred and Thirty-Five: Concerning the Gnosis (معرفة) of the Station (منزل) of Brotherhood (الأخوة), which is derived from the Muhammadan Presence (الحضرة المحمدية) and the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب تین سو پینتیس: اخوت کی منزل کی معرفت (معرفة منزل الأخوة) کے بیان میں، اور یہ الحضرت المحمدیہ (الحضرة المحمدية) اور الموسویہ سے ہے۔",
    "fa": "باب سیصد و سی و پنجم در معرفت منزل اخوت (برادری) و آن از حضرت محمدیه (الحضرة المحمدية) و موسویه (الموسوية) است."
  },
  "content": {
    "ar": "## «الباب الخامس والثلاثون وثلاثمائة في معرفة منزل الأخوة وهو من الحضرة المحمدية والموسوية»\n\n\n> بين العماء والاستوا *** حارت عقول أولي النهى‏\n\n\n> وكذاك عند نزوله *** من مستواه إلى السما\n\n\n> ووجوده في أرضه *** وبقلبنا وبأينما\n\n\n> هذي المعالم كلها *** تعطي التحير والعما\n\n\n> هي ستة مثل الجهات *** لنا فصور تناسوا\n\n\n> فالله جل بذاته *** عن نعت عل وعن عسى‏\n\n\n### [المقام الجامع للأسماء الإلهية]\n\n\nقال الله تعالى وتَعاوَنُوا عَلَى الْبِرِّ والتَّقْوى‏ وجاء في الخبر أن المؤمن مرآة أخيه والمؤمن اسم من أسماء الله وقد خلق آدم‏\nعلى صورته وله التخلق بالمؤمن‏\n\n\nوآخى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بين أصحابه بدار الخيزران وأخذ بيد علي وقال هذا أخي‏\n\n\nوقال الله تعالى إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فجعل أباهم الايمان فهم إخوة لأب واحد وقال موسى لربه حين بعثه إلى فرعون رَبِّ اشْرَحْ لِي صَدْرِي ويَسِّرْ لِي أَمْرِي واحْلُلْ عُقْدَةً من لِسانِي يَفْقَهُوا قَوْلِي واجْعَلْ لِي وَزِيراً من أَهْلِي هارُونَ أَخِي اشْدُدْ به أَزْرِي وأَشْرِكْهُ في أَمْرِي فأتاه الله سؤله فاعلم يا ولي أن المقام الجامع للأسماء الإلهية التي لها التأثير في الممكنات أخ صحيح الأخوة شقيق للمقام الجامع لاستعدادات القوابل الممكنات وهما إخوان لأب واحد يشد كل واحد منهما آزر صاحبه ولكن الأسماء هي الطالبة للاستعدادات أن يشد الله بها أزرها فافهم فإن هذا من علم الأسرار التي مقامها بين الستر والكشف وهو من أصعب العلوم في التصور حيث لا يصح نفوذ الاقتدار إلا باتفاق في الأخوين لا بأحدهما وبهما ظهرت أعيان الممكنات وحصلت في الوجود معرفة الكائنات بالله ووصل بوجود هذه المعرفة المحدثة الحق سبحانه إلى عين مطلوبه فإنه ما أوجد العالم إلا ليعرفه العالم والعالم محدث ولا يقوم به إلا محدث فقامت به المعرفة بالله إما بتعريف الله وإما بالقوة التي خلق فيه التي بها يصل إلى معرفة الله من وجه خاص لا غير فمن نزهة بهذه القوة فقد عرفه وكفر من شبهه ومن شبهه بهذه القوة فقد عرفه وجهل من نزهة بل كفره ومن عرفه بالتعريف الإلهي جمع بين التنزيه والتشبيه فنزهه في موطن التنزيه وشبهه في موطن التشبيه وكل صنف من هذه الأصناف صاحب معرفة بالله فما جهله أحد من خلق الله لأنه ما خلقهم إلا ليعرفوه فإذا لم يتعرف إليهم بهذه القوة الموصلة التي هي الفكر أو بالتعريف الإنبائي لم يعرفوه فلم يقع منه في العالم ما خلق العالم له ولنا في هذا المقام الذي عم المعتقدات نظم وهو هذا\n\n\n> عقد الخلائق في الإله عقائدا *** وأنا شهدت جميع ما اعتقدوه‏\n\n\n> لما بدا صور الهم متحولا *** قالوا بما شهدوا وما جحدوه‏\n\n\n> ذاك الذي أجنى عليهم خلفهم *** بجميع ما قالوه واعتقدوه‏\n\n\n> إن أفردوه عن الشريك فقد نحوا *** في ملكه ربا كما شهدوه‏\n\n\n> قد أعذر الشرع الموحد وحده *** والمشركون شقوا وإن عبدوه‏\n\n\n> وكذاك أهل الشك أخسر منهم *** والجاحدون وجود من وجدوه‏\n\n\n> والقائلون بنفيه أيضا شقوا *** مثل الثلاثة حين لم يجدوه‏\n\n\n> أجنى عليهم من تأله حين ما *** أهل السعادة بالهدى عبدوه‏\n\n\n> لو وافق الأقوام إذ أغواهم *** وتنزهوا عن غيه طردوه‏\n\n\nفالعارف الكامل يعرفه في كل صورة يتجلى بها وفي كل صورة ينزل فيها وغير العارف لا يعرفه إلا في صورة معتقده وينكره إذا تجلى له في غيرها كما لم يزل يربط نفسه على اعتقاده فيه وينكر اعتقاد غيره وهذا من أشكل الأمور في العلم الإلهي اختلاف الصور لما ذا يرجع هل إليه في نفسه وهو الذي وقع به الإنباء الإلهي وأحاله الدليل العقلي الذي أعطته القوة المفكرة فإذا كان الأمر على ما أعطاه الإنباء الإلهي فما رأى أحد إلا الله فهو المرئي عينه في الصور المختلفة وهو عين كل صورة وإن رجع اختلاف الصور لاختلاف المعتقدات وكانت تلك الصور مثل المعتقدات لا عين المطلوب فما رأى أحد إلا اعتقاده سواء عرفه في كل صورة فإنه اعتقد فيه قبول التجلي والظهور للمتجلي له في كل صورة أو عرفه في صورة مقيدة ليس غيرها فمثل هذا العلم لا يعلم إلا بأخبار إلهي وقرينة حال فأما الإخبار الإلهي‏\n\n\nفقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إنه الذي يتحول في الصور\n\n\nفي الحديث الصحيح وقرينة الحال كونه ما خلق الخلق إلا ليعرفوه فلا بد أن يعرفوه إما كشفا أو عقلا أو تقليدا لصاحب كشف أو عقل والرؤية تابعة للمعرفة فكما تعلقت به المعرفة فكان معروفا تعلقت به الرؤية فكان مرئيا فإن قال منكر الأمرين الذي لا يقول بالوصول إلى معرفته ولا إلى رؤيته وإنما العلم به معرفة الناظر في ذلك بأنه يعجز عن معرفته فيعلم عند ذلك أن من هو بهذه المثابة هو الله فقد حصل العلم به إجمالا في عين الجهل به والعجز وهو قول بعضهم العجز عن درك الإدراك إدراك فهذا القدر هو المسمى معرفة بالله وصاحب‏\nهذا القول إن جوزي بقوله فإنه لا يرى الله أبدا كما لا يعلمه أبدا وإن لم يجازه الله بقوله وبدا له من الله ما لم يكن يحتسب وعلم منه في ثاني حال خلاف ما كان يعلمه فإنه يراه ويعلم أنه هو والصحيح أنه يعلم ويرى فإن الله تعالى خلق المعرفة المحدثة به لكمال مرتبة العرفان ومرتبة الوجود ولا يكمل ذلك إلا بتعلق العلم المحدث بالله على صورة ما تعلق به العلم القديم وما تعلق القديم بالعجز عن العلم به كذلك العلم المحدث به ما تعلق إلا بما هو المعلوم عليه في نفسه والذي هو عليه في نفسه إنه عين كل صورة فهو كل صورة فما وقع العجز من هذا العبد إلا في كونه قصره على صورة واحدة وهي صورة معتقده وهو عين صورة معتقده فما عجز إلا عن الحكم عليه بما ينبغي له ولا يتصف بالعجز عن العلم به إلا من أخذ العلم من دليل عقله وأما من أخذ العلم به من الله لا من دليله ونظره فهذا لا يعجز عن حصول العلم بالله فإنه ما حاول أمرا يعجز عنه فيعترف بالعجز عنه وليس هذا الذي يطلبه بنظره في دليل عقله وعلمه من طريق التعريف والتجلي الذي هو علم موهوب من حكيم حميد فالقائل سبحان من لا يعرف إلا بالعجز عن المعرفة به صاحب علم نظر لا صاحب تعريف إلهي وأما العجز عن إحصاء الثناء عليه فهذا قول كامل محقق فإنه لا يكون العجز عن إحصاء الثناء عليه إلا بعد العلم بالمثنى عليه ما هو فيعلم أنه أعظم من أن يحيط به ثناء ويبلغ فيه وصف منتهاه كما قيل في بعض المخلوقات‏\n\n\n> إذا نحن أثنينا عليك بصالح *** فأنت الذي نثني وفوق الذي نثني‏\n\n\nهذا قول في مخلوق وهو قول محقق فكيف الثناء على الله سبحانه وإنما حققنا قول هذا الشاعر في هذا المخلوق مع ما يتخيل العقل بنظره إن الإحاطة بالثناء على المخلوق ممكنة وليس الأمر في نفسه كذلك وإنما هذا الشاعر قال حقا إما مصادفة إما عن تحقق له وذلك\n\n\nفي قوله فأنت الذي نثني وهو ما هو عليه ذلك الممدوح في الوقت وفوق الذي نثني فإنه محل قابل لما يخلق الله فيه من النعوت التي يخلق فيه فيثني عليه بها وهذا النعوت فيه لا نهاية لها أي لما يكون عنها مما يوجب الثناء بها على الممدوح وإذا كان هذا الثناء على الحق تعالى فلها البقاء في الوجود لذاتها لا تقبل العدم والثناء منا عليه دائم بتجدد لأنه في كل نفس فينا يتجدد علينا علم بالله فنثني عليه به أو علم بأمر ما لم يكن عندنا فنثني عليه به ونحن ما ننشد هذا البيت كما قاله صاحبه وإنما ننشده على ما قلناه وأعطانا ذلك العلم به فنقول‏\n\n\n> إذا نحن أثنينا عليك بصالح *** فأنت الذي تثني ولسنا الذي نثني‏\n\n\nوهذا فوق ما قاله الشاعر من وجه ومساو له من وجه سواء قال ذلك عن علم محقق أو مصادفة وهو لا يعلم فنطقه الله تعالى بالحق من حيث لا يشعر كما أنه يستدرج العبد من حيث لا يعلم ويمكر به من حيث لا يشعر والحق معلوم معروف في نفسه والعالم به عاجز عن إحصاء الثناء عليه كما ينبغي له فإنه ليس في الوسع حصول ذلك ولا يعطيه استعداد ممكن أصلا فهذا ما أعطاه مؤاخاة الاستعدادات والأسماء الإلهية وهذه أعلى أخوة يوصل إليها ثم ينزل إلى أخوة دونها وهي قوله إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ‏\n\n\n### [إن المؤمن من أسمائه الحسنى‏]\n\n\nومن أسمائه المؤمن وقد وقع النزاع بينهم بما أخبر به عن نفسه أنه كذا فنازعه المؤمن من المخلوقين الذي اجتمع معه في الايمان فكانت له إخوة معه بهذا الايمان بنظره في دليله العقلي أنه على خلاف ما أخبر به عن نفسه مع كونه مصدقا له لكنه تأول عليه فلما ظهرت هذه المنازعة بين المؤمن الحق والمؤمن الخلق قال الله لعلماء الكشف أصلحوا بين أخويكم فدخل المؤمنون العالمون المكاشفون بينهما بالصلح وذلك أن يكون المؤمن الحق مع هذا المؤمن أخيه حتى يبلغه قوته لأنه مخلوق على كل حال وما أعطيته الكشف الكامل ولا ظهرت إليه به فليكن معه بحيث يعطيه منزلته فيقول المؤمن الحق للمبلغ عنه قل لهذا المنازع إني أنا الله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ولا تُدْرِكُهُ الْأَبْصارُ وإني منزه عن وصف الواصفين فجاء الرسول بالتوقيع الإلهي إلى هذا المؤمن المنازع بقوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وبقوله سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ وأشباه هذا النوع من التنزيه الذي يعطيه دليل العقل النظري فإذا سمع هذا منه طاب قلبه وجنح إليه وزال نزاعه وجاء العلماء إلى المؤمن الخلق في المصالحة من هذا الجانب وقالوا له أنت تعلم أن المؤمن الحق اعلم بنفسه منك به لا بل اعلم بك من علمك بنفسك وإنك إنما تحكم عليه بما هو خلق له مثلك وهو عقلك وفكرك ودليلك فلا فرق بينك وبين كل مخلوق في العجز عما لا يعجز عنه المؤمن الحق فقف معه في موضع التسليم فإنه وإن كان مؤمنا وأنت مؤمن فأنت على مرتبتك التي تليق بك وهو على مرتبته التي تليق به وأنت تعلم أنك لست مثله وإن جمعكما الايمان فليس نسبته إليه مثل‏\nنسبته إليك فإنك لست مثله فلا تغرنك هذه المماثلة واعرف قدرك فإذا سمع مثل هذا طلب الصلح والإقالة مما وقع منه من النزاع وامتن المؤمن الحق عليه بما وقع له في المنشور من التنزيه الذي وقع النزاع من أجله فأصلح المؤمنون العالمون بين المؤمن الحق وبين هذا المؤمن الخلق فهكذا فليكن الفهم عن الله فيما أوحى به إلى عباده على ألسنة رسله وأنزله في كتبه ثم في أخوة الايمان درجة أخرى من درجات الكشف وهي قوله بعد أن تسمى لنا بالمؤمن وإنما المؤمنون إخوة لأبوة الايمان‏\n\n\nقال المؤمن مرآة أخيه‏\n\n\nوما يَنْطِقُ عَنِ الْهَوى‏ هذا القائل فأثبت الأخوة بين المؤمنين وجعل كل واحد من المؤمنين مرآة لأخيه فيراه ويرى فيه نفسه من كونه على أي صورة كان كل مؤمن منهما بهذه المثابة فيكون المؤمن الحق مرآة للمؤمن الخلق فيراه ويعلم أنه يراه كما يعلم صاحب المرآة أن له مرآة ثم ينظر فيها فلا يرى إلا صورته وصورة ما أثرت المرآة فيه ولهذا جعل له عينين ليرى بالعين الواحدة صورته وبالعين الأخرى ما حكمت به المرآة في صورته إذ لم يكن في نفسه على ما حكمت به المرآة عليه في الصورة المحسوسة من الكبر والصغر والطول والعرض والاستقامة والانتكاس على حسب شكل المرآة ولا يرى هذا الأثر كله هذا الناظر إلا في صورته فيعلم إن له فيه حكما ذاتيا لا يمكن أن يرى نفسه في هذه المرآة إلا بحسب ذلك فإذا كان المؤمن الخلق هو عين المرآة للمؤمن الحق فيراه الحق وهو في نفسه على استعداد خاص فلا يبدو من الحق له إلا على قدر استعداده فلا يرى الحق من نفسه في هذه المرآة الخاصة إلا قدر ذلك فآثرت هذه المرآة في إدراك الرائي القصور على ما رأى بحكم الاستعداد فأشبهه من هذا الوجه فعبر عن هذا المقام بالإخوة إذ لو لا المناسبة بين الأمرين لم يكن كل واحد من الأمرين مرآة لأخيه وما نصب الله هذا المثال وخلق لنا هذه المرائي إلا ليعطينا النظر فيها إصلاح ما وقع في صورتنا من خلل وما يتعلق بها من أذى لتزيله على بصيرة فهي تجل لإزالة العيوب فيدلك هذا أن الرائي في المرآة يحصل له علم لم يكن يراه قبل ذلك ففي المؤمن المخلوق يقرب ذلك ويصح وفي المؤمن الحق يعسر مثل هذا فهو قوله تعالى في المؤمن الحق ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ كذلك إذا رأى الحق نفسه في مرآة المؤمن المخلوق رأى أنه بحكم استعدادها لا يرى غير ذلك فيها فيزيل عنه هذا الحكم بنظره في مراء متعددة فيختلف الحكم في الصورة الواحدة باختلاف الاستعدادات وهو عينه لا غيره فيعلم عند ذلك أن حكم الاستعداد أعطى ما أعطى وأنه على ما هو عليه في نفسه فزال ما تعلق به من أذى التقيد كما أزال الابتلاء أذى التردد وطلب إقامة الحجة ليكون هو الغالب فقال حتى نعلم فجعل الابتلاء سبب حصول هذا العلم وما هو سبب حصول العلم وإنما هو سبب إقامة الحجة حتى لا يكون للمحجوج حجة يدفع بها وأما مماثلة الصورة في الخلق فهي للنيابة والخلافة ما هي للاخوة فإنه من حيث صورة العالم من العالم كما هو الروح من الجسد من صورة الإنسان وهو من حيث صورة الحق ما يظهر به في العالم من أحكام الأسماء الإلهية التي لها التعلق بالعالم فليست الصورة بإخوة كما يراه بعضهم ولهذا لم نذكر الأخوة إلا في أمر خاص وهو المؤمن إلا إن الصورة تشد آزر إخوة الايمان بالسببية فإن الأسباب لو لا ما لها أثر في المسبب ما أوجدها الله ولو لم يكن حكمها في المسببات ذاتيا لم تكن أسبابا ولم يصدق كونها أسبابا ويعلم ذلك فيمن لا يقبل الوجود إلا في محل وما ثم محل ويريد الموجد إيجاده فلا بد أن يوجد المحل لوجود هذا المراد وجوده فيكون وجود المحل سببا في وجود هذا المراد الذي تعلقت الإرادة به وبإيجاده فعلمت إن للأسباب أحكاما في المسببات فهي كالآلة للصانع فتضاف الصنعة والمصنوع للصانع لا للآلة وسببه أنه لا علم للآلة بما في نفس الصانع أن يصنع بها على التعيين بل لها العلم بأنها آلة لا صنع الذي تعطيه حقيقتها ولا عمل للصانع إلا بها فصنع الآلة ذاتي وما لجانب الصانع بها إرادي وهو قوله إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ وكن آلة للإيجاد فما أوجد إلا بها وكون تلك الكلمة ذاته أو أمرا زائدا علم آخر إنما المراد هو فهم هذا المعنى وإنه ما حصل الإيجاد بمجرد الإرادة دون القول ودون المريد والقائل فظهر حكم الأسباب في المسببات فلا يزيل حكمها إلا جاهل بوضعها وما تعطيه أعيانها أَلا لَهُ الْخَلْقُ والْأَمْرُ تَبارَكَ الله رَبُّ الْعالَمِينَ ولهذا قال موسى وأَشْرِكْهُ في أَمْرِي وقال اشْدُدْ به أَزْرِي وهُوَ أَفْصَحُ مِنِّي لِساناً فعلم ما قال وعلمنا نحن من هذا القول ما أشار إليه به ليفهم عنه صاحب عين الفهم فهذا معنى التعاون وهو في قوله اسْتَعِينُوا بِاللَّهِ وإِيَّاكَ نَسْتَعِينُ والله في عون العبد ما دام العبد في عون‏\nأخيه فلو لا المشاركة في المطلوب بالوجود من المستعان به ما صدق المستعين في استعانته والمستعين قد يستعين شرفا للمستعان به مع غناه عنه على التعيين وإن كان لا بد من سبب أو يكون ممن يستقل به دون السبب فيقصد جعله سببا لشرفه بذلك على غيره ليعلم منزلته عنده فإن الله قد جعل المفاضلة في العالم وأما المؤاخاة بين الأسماء الإلهية فلا تكون إلا بين الأسماء التي لا منافرة بينها لذاتها فإن الله ما واخى إلا بين المؤمنين ما واخى بين المؤمن والكافر بل لم يجعل لإخوة النسب حظا في الميراث مع فقد أخوة الايمان فليس المدعي إلا أخوة الايمان أ لا تراه إذا مات عن أخ له من النسب وهو على غير دينه لم يرثه أخو النسب وورثه أخو دينه والصورة بيننا وبين الحق نسب ودين فلهذا ما يرث الأرض عز وجل إلا بعد موت الإنسان الكامل حتى لا يقع الميراث إلا في مستحق له كما يرث السماء لما فيها من حكم أرواح الأنبياء عليه السلام لا من كونها محلا للملائكة فإذا صعقوا بالنفخة ورث الله السماء فأنزل الاسم الوارث الملائكة من السماء وبدل الأرض غير الأرض والسموات كما ذكرناه فيما قبل من هذا الكتاب فالمؤمن للمؤمن كالبنيان يشد بعضه بعضا فالمؤمن لا يبغض المؤمن والمؤمن لا يقتل المؤمن لإيمانه والمؤمن يقتل أخا النسب إذا كان غير مؤمن فهذا القدر كاف في هذا الباب فلنذكر ما يحوي عليه من العلوم فمن ذلك علم صورة نداء الحق عباده من أين يناديهم هل يناديهم من حكم مشيئته أو يناديهم من حيث ما هم عليه ومن ينادي هل ينادي المعرض أو المقبل أو هما وفيه علم الآداب الإلهية ومنازل المخلوقات وما ينبغي أن يعامل به كل مخلوق بل كل موجود وعلم مصالح الموجودات فلا يتصرف صاحب هذا العلم إلا فيما هو مصلحة لنفسه أو لغيره على حسب ما يصرفه المطلوب فهو خارج في تصرفاته عن هوى نفسه إنما هو مع المصالح فهو لكل شي‏ء لا عليه وفيه علم الفهم بما يأتي به كل قائل فيعلم من أين تكلم فيقيم له عذرا فيما ينسب إليه عند من لا يعرف ذلك من الخطاء في قوله وهو علم عزيز يقل الإنصاف فيه من أهله فكيف ممن لا يعرفه وما يؤثر تارك العمل بمثل هذا العلم في صاحبه من الحسرة والندامة على عدم استعماله وفيه علم الحكمة في التغافل والتناسي وهو الحلم والإمهال الإلهي أو من ذي القدرة ليرجع المغفول عنه عما هو عليه مما كان لا ينبغي أن يظهر به ولا عليه وفيه علم كون الأشياء بيد الله ليس بيد المخلوقين منها شي‏ء وإن ظهرت الصور بأيديهم فهي بحكم الاستعارة لا بحكم الملك وفيه علم المنن الإلهية التي أسبغها على العباد في الظاهر والباطن وتعيين ما يمكن أن يعين منها وعلم برزخ المتشاجرين ليقف فيه من يريد رفع التشاجر بينهم وفيه علم الأسماء وشرفها والفرق بينها وبين ما زاد على الإعلام منها مما وضع لمدح أو ذم وفيه علم العدول عن الطريق التي تحول بين العبد وبين حصول العلم فإنه أعلى ما يطلب وأفضل ما يكتسب وأعظم ما به يفتخر وأسد آلة تعد وتدخر وبه مدح الله نفسه بأن له الحجة البالغة وليس إلا العلم وفيه علم مراتب الخلق الإنساني في الخلق فإنهم على طبقات فيه وما يسمى به الإنسان الذي خلقه الإنسان هل هو إنسان أو حيوان في صورة إنسان من حيث نشأة جسده وما الأمر الذي عجز عنه في ظهور النفس الناطقة في هذا المخلوق هل لعدم الاستعداد فيقضي للمنشئ لهذه الصورة ما يقع به قبول نفس ناطقة من النفس الكل أو هل هو تعجيز إرادي إلهي لأنه أمر عظيم وقد ذكر أنه وقع مثل هذا وذكر في الفلاحة النبطية أن بعض العلماء بعلم الطبيعة كون من المني الإنساني بتعفين خاص على وزن مخصوص من الزمان والمكان إنسانا بالصورة وأقام سنة يفتح عينيه ويغلقها ولا يتكلم ولا يزيد على ما يغذى به شيئا فعاش سنة ومات فما يدري أ كان إنسانا حكمه حكم الأخرس أو كان حيوانا في صورة إنسان وفيه علم الأنساب والأحساب وفيه علم ما يعتبر الله من المكلف هل يعتبر ظاهره أو باطنه أو المجموع في قبول ما يكون منه بعد\n\n\nالتكليف وأما قبله فلا يقيد بل يجري بطبعه من غير مؤاخذة أصلا وهو قوله تعالى وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا وإذا كان هذا فمن أين وقع الألم للصغير حتى بكى مما يجده وفيه علم كيفية رد الجاهل إلى العلم وفيه علم صورة رد الأمور إلى الله سبحانه وتعالى في قدسه على أي طريق يكون هل بحكم أنه موجدها أو أنه غايتها أو ما هو ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 335: Concerning the Gnosis of the Station of Brotherhood, which belongs to the Muhammadan and Mosaic Presences\n\n> Between the Divine Mist (العماء) and the Establishment (الاستوا),\n> The minds of those possessed of understanding are bewildered.\n> And likewise, at His descent\n> From His station (مستواه) to the heaven,\n> And His Existence (وجوده) in His earth,\n> And in our hearts, and wherever He may be.\n> All these landmarks (المعالم)\n> Yield bewilderment and obscurity.\n> They are six, like the directions (الجهات) for us,\n> So they are images that have been forgotten.\n> For Allah is exalted in His Essence (الذات)\n> Beyond the description of contingency or possibility.\n\n### [The Comprehensive Station of the Divine Names]\n\nAllah the Exalted said: <<تَعاوَنُوا عَلَى الْبِرِّ والتَّقْوى>> (Cooperate upon righteousness and piety). It came in the report that the believer (المؤمن) is the mirror of his brother. The Believer (المؤمن) is one of the Names of Allah, and Adam was created upon His image (صورته), and thus he possesses the capacity for adorning himself with the Attribute of the Believer (التخلق بالمؤمن).\n\nThe Messenger of Allah (peace and blessings be upon him) established brotherhood (آخى) among his Companions in the House of Khayzurān, and he took the hand of Ali and said, \"This is my brother.\" Allah the Exalted said: <<إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ>> (Indeed, the believers are brothers). Thus, He made their father Faith (الإيمان), so they are brothers from one father. Moses said to his Lord when He sent him to Pharaoh: <<رَبِّ اشْرَحْ لِي صَدْرِي ويَسِّرْ لِي أَمْرِي واحْلُلْ عُقْدَةً من لِسانِي يَفْقَهُوا قَوْلِي واجْعَلْ لِي وَزِيراً من أَهْلِي هارُونَ أَخِي اشْدُدْ به أَزْرِي وأَشْرِكْهُ في أَمْرِي>> (My Lord, expand for me my breast, and ease for me my affair, and untie the knot from my tongue that they may understand my speech, and appoint for me a minister from my family, Aaron, my brother, strengthen my back with him, and make him a partner in my affair). Allah granted him his request.\n\nKnow, O my friend, that the Comprehensive Station of the Divine Names (المقام الجامع للأسماء الإلهية) which have influence upon the contingent beings (الممكنات) is a true brother in brotherhood, a full sibling to the Comprehensive Station of the capacities (استعدادات) of the contingent receptacles (القوابل). They are two brothers from one father, each strengthening the back (آزر) of the other. However, it is the Names that seek the capacities (الاستعدادات) so that Allah may strengthen their back through them. Understand this, for it is from the science of secrets (علم الأسرار) whose station lies between veiling (الستر) and unveiling (الكشف). It is one of the most difficult sciences to conceive, as the penetration of power (نفوذ الاقتدار) is only valid through agreement between the two brothers, not by one of them alone. Through both of them, the Essences of the Contingent Beings (أعيان الممكنات) appeared, and the Gnosis (المعرفة) of the created beings (الكائنات) concerning Allah was realized in Existence (الوجود). By the existence of this originated Gnosis (المعرفة المحدثة), the Real (الحق), the Exalted, reached the very object of His desire, for He did not bring the world into existence except that the world might know Him. The world is originated (محدث), and only an originated thing can sustain this Gnosis. Thus, the Gnosis of Allah is sustained by it, either through Allah’s own definition (تعريف الله) or through the power He created within it, by which it reaches the Gnosis of Allah from a specific aspect and no other.\n\nSo, whoever declares Him incomparable (نزهه) by means of this power has known Him, and whoever likens Him (شبهه) has committed disbelief (كفر). And whoever likens Him by means of this power has known Him, and whoever declares Him incomparable has been ignorant, or rather, has committed disbelief. But whoever knows Him through the Divine definition (التعريف الإلهي) combines both transcendence (التنزيه) and likeness (التشبيه). He declares Him incomparable in the locus of transcendence and likens Him in the locus of likeness. Every group among these groups possesses Gnosis (معرفة) of Allah, for none of Allah’s creation is ignorant of Him, because He only created them to know Him. If He had not introduced Himself to them through this connecting power, which is reflection (الفكر), or through the prophetic definition (التعريف الإنبائي), they would not have known Him. Thus, that for which He created the world would not have occurred in the world.\n\nWe have a poem concerning this station, which encompasses all beliefs:\n\n> The creatures established beliefs (عقائدا) concerning the God,\n> And I witnessed all that they believed.\n> When the images of concern appeared, transforming,\n> They spoke based on what they witnessed and what they denied.\n> That is what their disagreement brought upon them,\n> In all that they said and believed.\n> If they declare Him unique, free from partner, they have established\n> A Lord in His dominion, just as they witnessed Him.\n> The Law excuses the one who declares Him unique alone,\n> But the polytheists (المشركون) are wretched, even if they worship Him.\n> Likewise, the people of doubt are more lost than them,\n> And those who deny the existence of the One they found.\n> And those who affirm His negation are also wretched,\n> Like the three [groups] when they did not find Him.\n> What brought this upon them is the one who deifies, when\n> The people of felicity worship Him with guidance.\n> If he had agreed with the people when they led them astray,\n> And they had transcended his error, they would have driven him away.\n\nThe Perfect Gnostic (العارف الكامل) knows Him in every form in which He discloses Himself (يتجلى), and in every form in which He descends. The non-Gnostic does not know Him except in the form of his creed (معتقده), and he denies Him if He discloses Himself to him in any other form, just as he constantly restricts himself to his belief concerning Him and denies the belief of others. This is one of the most difficult matters in Divine Knowledge (العلم الإلهي): the difference in forms. To what does it return? Does it return to Him in Himself—which is what the Divine prophetic report (الإنباء الإلهي) affirmed, but which the rational proof (الدليل العقلي) derived from the reflective power (القوة المفكرة) rejected? If the matter is as the Divine prophetic report affirmed, then no one has seen anything but Allah; He is the very object seen (المرئي عينه) in the different forms, and He is the essence (عين) of every form. Or does the difference in forms return to the difference in beliefs, such that those forms are like the beliefs, not the essence of the desired object? In that case, no one has seen anything but his own belief (اعتقاده). This is true whether he knows Him in every form—for he believes that He accepts the Theophany (التجلي) and appearance to the one to whom He discloses Himself in every form—or whether he knows Him in a restricted form and no other.\n\nSuch knowledge cannot be known except through a Divine report (إخبار إلهي) and a circumstantial indication (قرينة حال). As for the Divine report, it is the saying of the Messenger of Allah (peace and blessings be upon him) in the sound Hadith that He is the One Who transforms in the forms. As for the circumstantial indication, it is that He did not create creation except that they might know Him. Therefore, they must know Him, either through unveiling (كشفا), or through intellect (عقلا), or through imitation (تقليدا) of one who possesses unveiling or intellect. Vision (الرؤية) follows Gnosis (المعرفة). Just as Gnosis relates to Him, so that He is known, so too does vision relate to Him, so that He is seen. If the denier of both matters—who does not affirm reaching His Gnosis (معرفته) nor His vision (رؤيته)—says that knowledge of Him is merely the knower’s recognition of his inability to know Him, and thus he knows that the One Who is of this status is Allah, then he has achieved knowledge of Him summarily (إجمالا) in the very essence of ignorance and incapacity. This is the saying of some: \"Incapacity to grasp the grasp is itself a grasp (العجز عن درك الإدراك إدراك).\" This much is called Gnosis of Allah (معرفة بالله).\n\nIf the proponent of this saying is rewarded according to his statement, he will never see Allah, just as he never knows Him. But if Allah does not reward him according to his statement, and there appears to him from Allah what he did not anticipate, and he learns from Him in a second state contrary to what he used to know, then he will see Him and know that He is He. The correct view is that He is known and seen, for Allah the Exalted created the originated Gnosis (المعرفة المحدثة) of Him for the perfection of the degree of Gnosis (العرفان) and the degree of Existence (الوجود). This is not perfected except by the originated knowledge of Allah relating to Him in the same form as the eternal knowledge related to Him. The Eternal Knowledge did not relate to incapacity to know Him. Likewise, the originated knowledge of Him relates only to what He is known to be in Himself. And what He is in Himself is the essence (عين) of every form; thus, He is every form. The incapacity of this servant occurred only because he restricted Him to a single form, which is the form of his creed (معتقده). He is the very essence of the form of his creed. Thus, he was only incapable of judging Him as He ought to be judged. Only he who derives knowledge from the proof of his intellect (دليل عقله) attributes incapacity to himself regarding the knowledge of Him. But he who derives knowledge of Him from Allah, not from his own proof or reflection, is not incapable of attaining Gnosis of Allah. He has not attempted an affair that he is incapable of, so as to confess his incapacity. This is not what he seeks through reflection upon the proof of his intellect; rather, his knowledge comes through definition (التعريف) and Theophany (التجلي), which is a gifted knowledge (علم موهوب) from a Wise, Praiseworthy One (حكيم حميد).\n\nTherefore, the one who says, \"Glory be to Him Who is only known through incapacity to know Him,\" is a man of speculative knowledge (علم نظر), not a man of Divine definition (تعريف إلهي). As for the incapacity to enumerate praise upon Him (إحصاء الثناء عليه), this is the saying of a perfect, realized person (كامل محقق). Incapacity to enumerate praise upon Him only occurs after knowing what the Praised One is. He knows that He is too magnificent to be encompassed by praise or for description to reach its limit concerning Him, just as it was said concerning some created beings:\n\n> If we praise you with goodness,\n> You are the one we praise, and above the one we praise.\n\nThis is a saying concerning a created being, and it is a realized saying. How then is the praise of Allah, the Exalted? We only affirmed the saying of this poet concerning this created being, despite what the intellect imagines through its reflection—that encompassing the praise of a created being is possible. But the matter is not so in itself. This poet spoke the truth, either by coincidence or by realization. That is in his saying, \"You are the one we praise,\" which is what the praised one is at that moment, \"and above the one we praise,\" for he is a locus receptive to the attributes that Allah creates within him, by which he is praised. These attributes within him have no end—that is, what results from them that necessitates praise upon the praised one.\n\nIf this praise is directed toward the Real (الحق) the Exalted, then it has subsistence (البقاء) in Existence (الوجود) by its Essence (ذاتها); it does not accept non-existence. Our praise of Him is continuous through renewal, because in every breath within us, knowledge of Allah is renewed for us, so we praise Him by it, or knowledge of an affair that was not with us is renewed, so we praise Him by it. We do not recite this verse as its author said it; rather, we recite it according to what we have said and what the knowledge of Him has granted us. So we say:\n\n> If we praise you with goodness,\n> You are the one who praises, and we are not the one who praises.\n\nThis is superior to what the poet said from one aspect, and equal to it from another, whether he said it out of realized knowledge or by coincidence without knowing. Allah caused him to speak the truth without him realizing it, just as He leads the servant astray without him knowing and plots against him without him realizing. The Real (الحق) is known and recognized in Himself, and the one who knows Him is incapable of enumerating praise upon Him as is befitting Him, for it is not within the capacity of the possible being (ممكن) to achieve that, nor does the capacity of a contingent being grant it at all.\n\nThis is what the brotherhood (مؤاخاة) of the capacities (الاستعدادات) and the Divine Names (الأسماء الإلهية) granted. This is the highest brotherhood that can be reached. Then it descends to a lesser brotherhood, which is His saying: <<إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ>> (Indeed, the believers are brothers, so make peace between your two brothers).\n\n### [Indeed, The Believer (المؤمن) is one of His Beautiful Names]\n\nThe Believer (المؤمن) is one of His Names. A dispute arose among them concerning what He reported about Himself—that He is such-and-such. The created believer (المؤمن) who shares faith (الإيمان) with Him disputed Him. Thus, he had brotherhood with Him through this faith. He disputed Him based on his reflection upon his rational proof (دليله العقلي) that He is contrary to what He reported about Himself, even though he affirmed Him, but he interpreted it allegorically against Him (تأول عليه). When this dispute arose between the Real Believer (المؤمن الحق) and the created believer (المؤمن الخلق), Allah said to the scholars of unveiling (علماء الكشف): \"Make peace between your two brothers.\" So, the knowing believers who possess unveiling (المكاشفون) intervened between them for reconciliation. This is achieved by the Real Believer being with this brother believer until He conveys His power to him, because he is created in any case, and He has not granted him the complete unveiling (الكشف الكامل) nor appeared to him through it. So, He should be with him in a way that grants him his station. The Real Believer says to the one conveying the message: \"Say to this disputant: 'I am Allah, <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), and <<لا تُدْرِكُهُ الْأَبْصارُ>> (Vision does not perceive Him), and I am transcendent (منزه) beyond the description of the describers.'\"\n\nThe messenger came with the Divine Decree (التوقيع الإلهي) to this disputing believer with His saying: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), and His saying: <<سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ>> (Glory be to your Lord, the Lord of Might, above what they describe), and similar types of transcendence (تنزيه) that the proof of the speculative intellect (دليل العقل النظري) grants. When he heard this from him, his heart was pleased, he inclined toward it, and his dispute vanished. The scholars then approached the created believer (المؤمن الخلق) for reconciliation from this side and said to him: \"You know that the Real Believer knows Himself better than you know Him—no, rather, He knows you better than you know yourself. You only judge Him by what is created for Him, like yourself, which is your intellect, your reflection, and your proof. Thus, there is no difference between you and any created being in the incapacity concerning what the Real Believer is not incapable of. So, stand with Him in the position of submission (التسليم). Even though He is a believer (مؤمن) and you are a believer, you are at your rank that befits you, and He is at His rank that befits Him. You know that you are not like Him. Even if faith (الإيمان) unites you, your relation to Him is not like His relation to you, for you are not like Him. Do not let this similarity deceive you, and know your worth.\"\n\nWhen he heard something like this, he sought reconciliation and annulment (الإقالة) for the dispute that occurred from him. The Real Believer conferred a favor upon him by what occurred in the Edict (المنشور) concerning the transcendence (التنزيه) that was the cause of the dispute. Thus, the knowing believers reconciled between the Real Believer and this created believer. This is how the understanding of Allah should be regarding what He revealed to His servants through the tongues of His messengers and sent down in His books.\n\nThen, in the brotherhood of faith, there is another degree of the degrees of unveiling (الكشف), which is His saying, after He named Himself The Believer (المؤمن): <<إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ>> (Indeed, the believers are brothers) due to the fatherhood of faith (أبوة الايمان). The Prophet said: \"The believer is the mirror of his brother.\" This speaker <<وَمَا يَنْطِقُ عَنِ الْهَوَى>> (does not speak from [his own] desire). Thus, he established brotherhood between the believers and made each believer a mirror for his brother, so that he sees him and sees himself in him—in terms of what state each believer is in.\n\nThe Real Believer (المؤمن الحق) is thus a mirror for the created believer (المؤمن الخلق). The Real sees him and knows that he sees him, just as the owner of a mirror knows that he has a mirror, and then looks into it and sees nothing but his own image and the image of what the mirror has affected in him. For this reason, He gave him two eyes: to see his own image with one eye, and with the other eye, to see what the mirror has judged concerning his image, since he was not in himself as the mirror judged him to be in the sensible image—in terms of size, smallness, length, width, straightness, or inversion, according to the shape of the mirror. The viewer does not see all this effect except in his own image, so he knows that the mirror has an essential judgment (حكما ذاتيا) concerning him, and he cannot see himself in this mirror except according to that. Since the created believer (المؤمن الخلق) is the very mirror (عين المرآة) for the Real Believer (المؤمن الحق), the Real sees him while he is in himself upon a specific capacity (استعداد خاص). Nothing appears from the Real to him except according to the measure of his capacity. Thus, the Real sees nothing of Himself in this specific mirror except that measure. This mirror affected the perception of the viewer with limitation (القصور) based on what he saw, according to the judgment of the capacity (الاستعداد). Thus, He resembled him from this aspect, and this station was expressed by brotherhood (الإخوة). If there were no suitability (المناسبة) between the two matters, neither of the two would be a mirror for his brother.\n\nAllah only established this example and created these mirrors for us so that He might grant us reflection upon them to rectify any defect (خلل) that has occurred in our image and any harm (أذى) related to it, so that we may remove it with insight. Thus, the mirror is a manifestation (تجلي) for removing defects. This indicates to you that the viewer in the mirror gains knowledge that he did not see before. This is close and valid in the created believer (المؤمن المخلوق). In the Real Believer (المؤمن الحق), such a thing is difficult. This is His saying concerning the Real Believer: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know). Likewise, when the Real sees Himself in the mirror of the created believer, He sees that, by the judgment of its capacity (استعدادها), He sees nothing else in it. He then removes this judgment from Himself by looking into multiple mirrors, so the judgment concerning the single image varies according to the difference in capacities, while He is the very essence of that image and no other. He knows then that the judgment of the capacity granted what it granted, and that He is upon what He is in Himself. Thus, the harm of restriction (أذى التقيد) that clung to Him vanished, just as the testing (الابتلاء) removed the harm of hesitation and the seeking of establishing proof, so that He might be the Victorious One. Thus, He said, \"until We know,\" making the testing the cause of attaining this knowledge. Yet, it is not the cause of attaining knowledge; rather, it is the cause of establishing the proof (إقامة الحجة) so that the one against whom the proof is established has no argument by which to defend himself.\n\nAs for the similarity of the image (مماثلة الصورة) in creation, it is for the sake of representation (النيابة) and vicegerency (الخلافة); it is not for brotherhood. For, from the aspect of the image of the world, He is from the world, just as the spirit is from the body of the human image. And from the aspect of the image of the Real (الحق), He is what appears in the world from the rulings of the Divine Names (الأسماء الإلهية) that relate to the world. Thus, the image is not brotherhood, as some see it. For this reason, we only mentioned brotherhood in a specific matter, which is the believer. However, the image strengthens the back (تشد آزر) of the brotherhood of faith through causality (السببية). If the causes (الأسباب) did not have an effect on the effect (المسبب), Allah would not have brought them into existence. If their ruling in the effects were not essential (ذاتيا), they would not be causes, and their being causes would not be affirmed. This is known in the case of one who does not accept existence except in a locus (محل), yet there is no locus, and the Originator (الموجد) desires to bring him into existence. It is necessary that the locus be brought into existence for the existence of this desired being. Thus, the existence of the locus becomes a cause (سببا) for the existence of this desired being to whose existence the Will (الإرادة) related.\n\nYou have known that the causes have rulings upon the effects (المسببات). They are like the tool (الآلة) for the maker (الصانع). The craft and the crafted object are attributed to the maker, not to the tool. The reason for this is that the tool has no knowledge of what the maker intends to craft with it specifically. Rather, it has knowledge that it is a tool, but the craft that its reality grants is not its own, and the maker has no work except through it. Thus, the making of the tool is essential (ذاتي), while the aspect of the maker concerning it is volitional (إرادي). This is His saying: <<إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ>> (When We intend a thing, Our saying to it is only \"Be!\"). And \"Be!\" (كن) is the tool for bringing into existence. He only brought things into existence through it. Whether that word is His Essence (ذاته) or an added command is another knowledge. The intention here is only to understand this meaning: that existence was not achieved merely by the Will (الإرادة) without the saying, and without the One Willing and the Speaker. Thus, the ruling of the causes appeared in the effects. Only one ignorant of their placement and what their essences (أعيانها) grant removes their ruling. <<أَلا لَهُ الْخَلْقُ والْأَمْرُ تَبارَكَ الله رَبُّ الْعالَمِينَ>> (Unquestionably, to Him belongs the creation and the command. Blessed is Allah, Lord of the worlds). For this reason, Moses said: <<وأَشْرِكْهُ في أَمْرِي>> (And make him a partner in my affair), and he said: <<اشْدُدْ به أَزْرِي وهُوَ أَفْصَحُ مِنِّي لِساناً>> (Strengthen my back with him, and he is more eloquent than me in speech). So, he knew what he said, and we know from this saying what he alluded to, so that the possessor of true understanding (عين الفهم) may grasp it from him. This is the meaning of cooperation (التعاون), and it is in His saying: <<اسْتَعِينُوا بِاللَّهِ>> (Seek help through Allah) and <<إِيَّاكَ نَسْتَعِينُ>> (You alone we ask for help).\n\nAllah is in the aid of the servant as long as the servant is in the aid of his brother. If there were no partnership in the desired existence (المطلوب بالوجود) from the One whose help is sought (المستعان به), the one seeking help (المستعين) would not be truthful in his seeking of help. The one seeking help may seek help to honor the one whose help is sought, even while being specifically independent of him, although a cause is necessary. Or he may be one who is independent of the cause, but intends to make him a cause to honor him above others, so that his rank with him may be known. Allah has established differentiation (المفاضلة) in the world.\n\nAs for the brotherhood between the Divine Names (الأسماء الإلهية), it only occurs between Names that have no inherent antagonism (منافرة) in their essences (لذاتها). Allah only established brotherhood among the believers; He did not establish brotherhood between the believer and the disbeliever. Moreover, He did not grant the brotherhood of lineage (أخوة النسب) a share in inheritance when the brotherhood of faith (أخوة الايمان) was absent. The only claim is the brotherhood of faith. Do you not see that if a person dies leaving a brother by lineage who is not of his religion, the brother by lineage does not inherit him, but the brother of his religion inherits him? The image between us and the Real (الحق) is both lineage and religion. For this reason, the Exalted does not inherit the earth except after the death of the Perfect Human (الإنسان الكامل), so that the inheritance only falls to one who deserves it. Likewise, He inherits the heaven due to the ruling of the spirits of the Prophets (peace be upon them) within it, not because it is a locus for the angels. When they are struck unconscious by the blast (النفخة), Allah inherits the heaven, and the Name The Inheritor (الوارث) brings the angels down from the heaven, and the earth is changed to other than the earth, and the heavens, as we mentioned previously in this book. The believer is to the believer like a structure, strengthening one another. The believer does not hate the believer, and the believer does not kill the believer because of his faith. The believer kills the brother of lineage if he is not a believer. This much is sufficient for this chapter.\n\nLet us mention the sciences contained within it. Among them is the science of the form of the Real’s call to His servants: from where does He call them? Does He call them from the ruling of His Will (مشيئته), or does He call them from the state they are upon? And whom does He call? Does He call the turning-away or the turning-toward, or both?\n\nIt contains the science of Divine manners (الآداب الإلهية) and the stations of created beings (منازل المخلوقات), and how every created being—indeed, every existent thing—should be treated.\n\nIt contains the science of the welfare of existent things (مصالح الموجودات). The possessor of this knowledge acts only in what is beneficial (مصلحة) for himself or for others, according to what the desired object directs him. Thus, in his actions, he is outside of his own desire (هوى نفسه); he is only concerned with welfare. He is for everything, not against it.\n\nIt contains the science of understanding what every speaker brings forth, so that he knows from where he spoke, and thus finds an excuse for him in what is attributed to him by those who do not know that he erred in his speech. This is a precious science (علم عزيز) in which fairness is rare among its practitioners, so how about those who do not know it?\n\nIt contains the effect that abandoning the practice of such knowledge has on its possessor, in terms of regret and remorse (الحسرة والندامة) for not utilizing it.\n\nIt contains the science of wisdom in overlooking (التغافل) and feigning forgetfulness (التناسي), which is Divine forbearance (الحلم) and respite (الإمهال), or from one who possesses power, so that the one overlooked may return from the state he is upon, which ought not to have appeared from him or upon him.\n\nIt contains the science that things are in the Hand of Allah, and created beings possess nothing of them, even if the forms appear in their hands; this is by way of borrowing (الاستعارة), not by way of ownership (الملك).\n\nIt contains the science of Divine favors (المنن الإلهية) that He bestowed upon the servants, outwardly and inwardly, and the designation of what can be designated among them.\n\nIt contains the science of the Isthmus (برزخ) of the disputants, so that one who wishes to resolve the dispute between them may stand therein.\n\nIt contains the science of the Names (الأسماء) and their nobility, and the difference between them and what is added to the mere designation (الإعلام) of them, such as what is placed for praise or blame.\n\nIt contains the science of turning away from the path that intervenes between the servant and the attainment of knowledge (العلم), for it is the highest thing sought, the best thing acquired, the greatest thing by which one boasts, and the most sound tool prepared and stored. By it, Allah praised Himself by saying that He has the conclusive argument (الحجة البالغة), and that is nothing but Knowledge.\n\nIt contains the science of the degrees of human creation (الخلق الإنساني) in creation, for they are layers within it.\n\nIt contains the science of what the human created by a human is called: Is he a human (إنسان) or an animal (حيوان) in the form of a human, in terms of the genesis of his body?\n\nIt contains the matter concerning which he was incapable in the appearance of the speaking soul (النفس الناطقة) in this created being: Is it due to the lack of capacity (عدم الاستعداد), so that the originator of this form is judged by what results in the acceptance of a speaking soul from the Universal Soul (النفس الكل)? Or is it an intentional Divine incapacitation (تعجيز إرادي إلهي), because it is a great matter? It is mentioned that such a thing occurred, and it is mentioned in the Nabataean Agriculture that some scholars of natural science formed a human from human semen through a specific putrefaction, at a specific measure of time and place, in image, and he lived for a year, opening and closing his eyes, but not speaking, and not increasing beyond what he was fed. He lived for a year and died. It is not known whether he was a human whose ruling was that of a mute, or an animal in the form of a human.\n\nIt contains the science of lineages (الأنساب) and honors (الأحساب).\n\nIt contains the science of what Allah considers from the accountable person (المكلف): Does He consider his outward (ظاهره) or his inward (باطنه), or the totality, in accepting what proceeds from him after accountability (التكليف)? As for before it, he is not bound, but proceeds according to his nature without any accountability whatsoever. This is His saying: <<وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا>> (And We would never punish until We had sent a messenger). If this is the case, then from where does the pain occur to the child, causing him to cry from what he finds?\n\nIt contains the science of how to return the ignorant person to knowledge.\n\nIt contains the science of the form of returning matters to Allah the Exalted in His Holiness: by what path is this done? Is it by the ruling that He is their Originator, or that He is their Goal, or what is that? <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).",
    "ur": "## باب نمبر تین سو پینتیس: اخوت کے مقام کی معرفت میں، اور یہ مقام حضرت محمدیہ اور حضرت موسویہ سے تعلق رکھتا ہے۔\n\n> عماء (غیب مطلق) اور استواء (قرار) کے درمیان،\n> عقل مندوں کی عقلیں حیران رہ گئیں۔\n> اور اسی طرح جب وہ اپنے مستویٰ (قرار گاہ) سے\n> آسمان کی طرف نزول فرماتا ہے۔\n> اور اس کا وجود اپنی زمین میں،\n> اور ہمارے دل میں، اور ہر جگہ ہے۔\n> یہ تمام نشانیاں\n> حیرت اور اندھا پن عطا کرتی ہیں۔\n> یہ چھ ہیں، جیسے ہمارے لیے جہات (سمتیں)\n> پس ایسی صورتیں ہیں جنہیں وہ بھول گئے۔\n> پس اللہ اپنی ذات کے ساتھ بلند ہے\n> ہر صفت سے جو 'عل' (بلندی) اور 'عسیٰ' (شاید) کی ہو۔\n\n### [اسماء الٰہیہ کا جامع مقام]\n\nاللہ تعالیٰ نے فرمایا: \"اور نیکی اور تقویٰ پر ایک دوسرے کی مدد کرو۔\" (المائدہ: ۲) اور حدیث میں آیا ہے کہ \"مومن اپنے بھائی کا آئینہ ہے۔\" اور المؤمن (ایمان والا) اللہ کے اسماء الٰہیہ (الأسماء الإلهية) میں سے ایک اسم ہے، اور آدم کو اس کی صورت پر پیدا کیا گیا، اور اس کے لیے المؤمن کے ساتھ متخلق ہونا ہے۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم نے دار الخیزران میں اپنے صحابہ کے درمیان اخوت قائم کی اور علی کا ہاتھ پکڑ کر فرمایا: \"یہ میرا بھائی ہے۔\"\n\nاور اللہ تعالیٰ نے فرمایا: \"بیشک مومن آپس میں بھائی بھائی ہیں۔\" (الحجرات: ۱۰) پس اس نے ایمان کو ان کا باپ بنایا، لہٰذا وہ ایک ہی باپ کے بھائی ہیں۔ اور موسیٰ علیہ السلام نے اپنے رب سے کہا جب اسے فرعون کی طرف بھیجا گیا: \"اے میرے رب! میرا سینہ میرے لیے کھول دے، اور میرے کام کو میرے لیے آسان کر دے، اور میری زبان کی گرہ کھول دے، تاکہ وہ میری بات سمجھ سکیں، اور میرے اہل میں سے میرے لیے ایک وزیر (مددگار) مقرر کر دے، ہارون کو جو میرا بھائی ہے، اس کے ذریعے میری کمر مضبوط کر دے، اور اسے میرے کام میں شریک کر دے۔\" (طٰہٰ: ۲۵-۳۲) پس اللہ نے اسے اس کا سوال عطا فرمایا۔\n\nپس اے ولی! جان لو کہ اسماء الٰہیہ (الأسماء الإلهية) کا جامع مقام، جن کا ممکنات (الممكنات) میں اثر ہے، وہ صحیح اخوت کے ساتھ بھائی ہے، جو ممکنات کے قابل استعدادات (الاستعدادات) کے جامع مقام کا سگا بھائی ہے۔ اور یہ دونوں ایک ہی باپ کے بیٹے ہیں، ان میں سے ہر ایک دوسرے کی کمر مضبوط کرتا ہے۔ لیکن اسماء الٰہیہ ہی استعدادات کی طالب ہیں کہ اللہ ان کے ذریعے ان کی کمر مضبوط کرے۔ پس سمجھ لو، کیونکہ یہ علم الاسرار (علم الأسرار) میں سے ہے جس کا مقام ستر (پردہ) اور کشف (الکشف) کے درمیان ہے، اور یہ تصور میں سب سے مشکل علوم میں سے ہے، جہاں اقتدار کا نفاذ صرف دونوں بھائیوں کے اتفاق سے ہی درست ہوتا ہے، نہ کہ ان میں سے کسی ایک کے ذریعے۔ اور ان دونوں کے ذریعے ہی ممکنات کی اعیان (حقیقتیں) ظاہر ہوئیں اور ہستی (الوجود) میں کائنات کی اللہ کے ساتھ معرفت (المعرفۃ) حاصل ہوئی۔\n\nاور اس محدث معرفت کے وجود کے ذریعے ذات حق (الحق) سبحانہ اپنے عین مطلوب تک پہنچا، کیونکہ اس نے عالم کو پیدا ہی اس لیے کیا تاکہ عالم اسے پہچانے۔ اور عالم محدث ہے، اور اس کے ساتھ صرف محدث ہی قائم ہو سکتا ہے۔ پس اللہ کی معرفت اس کے ساتھ قائم ہوئی، یا تو اللہ کے تعارف کرانے سے، یا اس قوت کے ذریعے جو اس میں پیدا کی گئی جس کے ذریعے وہ ایک خاص پہلو سے اللہ کی معرفت تک پہنچتا ہے، اور بس۔ پس جس نے اس قوت کے ذریعے اسے منزہ جانا تو اس نے اسے پہچانا، اور جس نے اسے تشبیہ دی اس نے کفر کیا۔ اور جس نے اس قوت کے ذریعے اسے تشبیہ دی تو اس نے اسے پہچانا، اور جس نے اسے منزہ جانا اس نے جہالت کی، بلکہ کفر کیا۔ اور جس نے اسے تعریف الٰہی (التعریف الإلهی) کے ذریعے پہچانا، اس نے تنزیہ اور تشبیہ دونوں کو جمع کیا، پس اس نے تنزیہ کے مقام پر اسے منزہ جانا اور تشبیہ کے مقام پر اسے تشبیہ دی۔ اور ان اصناف میں سے ہر صنف اللہ کی معرفت کا حامل ہے، پس اللہ کی مخلوق میں سے کسی نے بھی اسے نہیں جانا، کیونکہ اس نے انہیں پیدا ہی اس لیے کیا تاکہ وہ اسے پہچانیں۔\n\nپس اگر وہ ان سے اس موصل قوت کے ذریعے جو کہ فکر ہے، یا تعارف انبائی (خبر کے ذریعے تعارف) کے ذریعے متعارف نہ ہوتا، تو وہ اسے نہ پہچانتے، اور اس طرح عالم میں وہ مقصد پورا نہ ہوتا جس کے لیے عالم کو پیدا کیا گیا۔ اور اس مقام کے بارے میں جو تمام عقائد پر محیط ہے، ہمارے پاس یہ اشعار ہیں:\n\n> مخلوقات نے معبود کے بارے میں عقائد قائم کیے،\n> اور میں نے ان سب کا شہود (الشہود) کیا جس کا انہوں نے اعتقاد کیا۔\n> جب غم کی صورتیں بدلتی ہوئی ظاہر ہوئیں،\n> تو انہوں نے وہی کہا جس کا انہوں نے شہود کیا اور جس کا انکار کیا۔\n> یہی وہ ہے جس نے ان کے پیچھے والوں پر\n> ان تمام باتوں کے ذریعے ظلم کیا جو انہوں نے کہیں اور جن کا اعتقاد کیا۔\n> اگر انہوں نے اسے شریک سے الگ کیا، تو انہوں نے\n> اس کی بادشاہت میں ایک رب کو تراشا جیسا کہ انہوں نے شہود کیا۔\n> شریعت نے صرف موحد کو معذور قرار دیا،\n> اور مشرک بدبخت ہوئے اگرچہ انہوں نے اس کی عبادت کی۔\n> اور اسی طرح شک کرنے والے ان سے زیادہ خسارے میں ہیں،\n> اور وہ جو اس کے وجود (الوجود) کا انکار کرتے ہیں جسے انہوں نے پایا۔\n> اور اس کی نفی کرنے والے بھی بدبخت ہوئے،\n> ان تینوں کی طرح جب انہوں نے اسے نہ پایا۔\n> اس نے ان پر ظلم کیا جب وہ معبود بنا،\n> جبکہ اہل سعادت نے ہدایت کے ساتھ اس کی عبادت کی۔\n> اگر وہ ان قوموں سے اتفاق کرتا جب اس نے انہیں گمراہ کیا،\n> اور وہ اس کی گمراہی سے پاک ہوتے تو وہ اسے نکال دیتے۔\n\nپس عارف کامل (الکامل) اسے ہر اس صورت میں پہچانتا ہے جس میں وہ تجلی (التجلی) فرماتا ہے، اور ہر اس صورت میں جس میں وہ نزول فرماتا ہے۔ اور غیر عارف اسے صرف اپنے معتقد کی صورت میں پہچانتا ہے، اور جب وہ کسی دوسری صورت میں تجلی فرماتا ہے تو وہ اس کا انکار کر دیتا ہے، جیسا کہ وہ ہمیشہ اپنے آپ کو اس کے بارے میں اپنے اعتقاد پر باندھے رکھتا ہے اور دوسروں کے اعتقاد کا انکار کرتا ہے۔ اور یہ علم الٰہی (العلم الإلهی) میں سب سے مشکل امور میں سے ہے کہ صورتوں کا اختلاف کس چیز کی طرف لوٹتا ہے؟ کیا یہ خود اس کی ذات کی طرف لوٹتا ہے؟ اور یہی وہ ہے جس کے ذریعے خبر الٰہی واقع ہوئی، اور جسے قوت مفکرہ سے حاصل ہونے والی عقلی دلیل نے محال قرار دیا۔ پس اگر معاملہ وہی ہے جو خبر الٰہی نے دیا، تو کسی نے اللہ کے سوا کسی کو نہیں دیکھا، پس وہ مختلف صورتوں میں عین مرئی ہے، اور وہ ہر صورت کا عین ہے۔ اور اگر صورتوں کا اختلاف عقائد کے اختلاف کی طرف لوٹتا ہے، اور وہ صورتیں عقائد کی مانند ہیں نہ کہ عین مطلوب، تو کسی نے اپنے اعتقاد کے سوا کچھ نہیں دیکھا، خواہ اس نے اسے ہر صورت میں پہچانا ہو، کیونکہ اس نے اس میں ہر صورت میں تجلی اور ظہور (الظہور) کو قبول کرنے کا اعتقاد رکھا، یا اس نے اسے صرف ایک مقید صورت میں پہچانا جس کے سوا کوئی نہیں۔ پس ایسا علم صرف خبر الٰہی اور قرینہ حال سے ہی معلوم ہو سکتا ہے۔\n\nپس خبر الٰہی یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا صحیح حدیث میں یہ فرمان ہے کہ \"وہ (اللہ) ہی ہے جو صورتوں میں بدلتا ہے۔\" اور قرینہ حال یہ ہے کہ اس نے مخلوق کو پیدا ہی اس لیے کیا تاکہ وہ اسے پہچانیں، لہٰذا انہیں اسے پہچاننا ضروری ہے، خواہ کشف (الکشف) کے ذریعے، یا عقل کے ذریعے، یا صاحب کشف یا عقل کی تقلید کے ذریعے۔ اور رؤیت معرفت (المعرفۃ) کے تابع ہے، پس جس طرح معرفت اس سے متعلق ہوئی اور وہ معروف ہوا، اسی طرح رؤیت اس سے متعلق ہوئی اور وہ مرئی ہوا۔\n\nپس اگر دونوں امور کا انکار کرنے والا یہ کہے کہ وہ نہ تو اس کی معرفت تک پہنچنے کا قائل ہے اور نہ ہی اس کی رؤیت کا، بلکہ اس کے بارے میں علم یہ ہے کہ ناظر یہ جان لے کہ وہ اس کی معرفت سے عاجز ہے، اور تب وہ جان لے کہ جو اس مرتبے پر ہے وہ اللہ ہے، تو اس طرح اسے جہالت اور عجز کے عین میں اجمالی علم حاصل ہو گیا، اور یہ بعض کا قول ہے کہ \"ادراک کے ادراک سے عاجز ہونا ہی ادراک ہے۔\" پس یہ مقدار اللہ کی معرفت کہلاتی ہے۔ اور اس قول کا قائل اگر اپنے قول کے مطابق بدلہ دیا گیا تو وہ اللہ کو کبھی نہیں دیکھے گا، جیسا کہ وہ اسے کبھی نہیں جانتا۔ اور اگر اللہ نے اسے اس کے قول کے مطابق بدلہ نہ دیا اور اس پر اللہ کی طرف سے وہ ظاہر ہوا جس کا اسے گمان بھی نہ تھا، اور اس نے دوسری حالت میں اس کے خلاف جانا جو وہ جانتا تھا، تو وہ اسے دیکھے گا اور جان لے گا کہ وہ وہی ہے۔ اور صحیح یہ ہے کہ وہ جانتا اور دیکھتا ہے، کیونکہ اللہ تعالیٰ نے اپنی محدث معرفت کو عرفان کے مرتبے اور ہستی (الوجود) کے مرتبے کی تکمیل کے لیے پیدا کیا، اور یہ تکمیل اس وقت تک نہیں ہوتی جب تک کہ اللہ کے ساتھ محدث علم اسی صورت میں متعلق نہ ہو جس صورت میں قدیم علم متعلق ہوا تھا۔ اور قدیم علم عجز عن العلم سے متعلق نہیں ہوا، اسی طرح محدث علم بھی صرف اسی چیز سے متعلق ہوا جو وہ اپنی ذات میں معلوم ہے۔ اور وہ اپنی ذات میں یہ ہے کہ وہ ہر صورت کا عین ہے، پس وہ ہر صورت ہے۔ پس اس بندے کی طرف سے عجز صرف اس وجہ سے واقع ہوا کہ اس نے اسے ایک ہی صورت پر محدود کر دیا، اور وہ اس کے معتقد کی صورت ہے، اور وہ اس کے معتقد کی صورت کا عین ہے۔ پس وہ صرف اس پر اس طرح حکم لگانے سے عاجز ہوا جو اس کے شایان شان ہے۔ اور عجز عن العلم کی صفت صرف وہی شخص اختیار کرتا ہے جس نے علم اپنی عقلی دلیل سے حاصل کیا ہو۔ لیکن جس نے علم اللہ سے حاصل کیا، نہ کہ اپنی دلیل اور نظر سے، تو یہ شخص اللہ کے علم کے حصول سے عاجز نہیں ہوتا، کیونکہ اس نے کسی ایسے امر کی کوشش ہی نہیں کی جس سے وہ عاجز ہو، کہ وہ عجز کا اعتراف کرے۔ اور یہ وہ نہیں ہے جسے وہ اپنی عقلی دلیل کی نظر سے طلب کرتا ہے، بلکہ اس کا علم تعریف اور تجلی (التجلی) کے راستے سے ہے، جو حکیم حمید کی طرف سے عطا کردہ علم ہے۔\n\nپس جو یہ کہتا ہے کہ \"پاک ہے وہ ذات جسے صرف معرفت سے عاجز ہونے کے ذریعے ہی پہچانا جا سکتا ہے،\" وہ علم نظر کا حامل ہے، نہ کہ تعریف الٰہی کا۔ اور جہاں تک اس کی ثناء کے احصاء (شمار) سے عاجز ہونے کا تعلق ہے، تو یہ ایک کامل محقق کا قول ہے، کیونکہ اس کی ثناء کے احصاء سے عاجز ہونا صرف اس کے بعد ہوتا ہے جب ثناء کیے جانے والے کے بارے میں علم ہو کہ وہ کیا ہے، تب وہ جانتا ہے کہ وہ اس سے کہیں زیادہ عظیم ہے کہ ثناء اس کا احاطہ کر سکے اور وصف اپنی انتہا کو پہنچ سکے۔ جیسا کہ بعض مخلوقات کے بارے میں کہا گیا ہے:\n\n> جب ہم آپ کی اچھی صفات کے ساتھ ثناء کرتے ہیں،\n> تو آپ وہی ہیں جس کی ہم ثناء کرتے ہیں، اور اس سے بھی بڑھ کر ہیں جس کی ہم ثناء کرتے ہیں۔\n\nیہ ایک مخلوق کے بارے میں قول ہے، اور یہ ایک محقق قول ہے، تو اللہ سبحانہ کی ثناء کا کیا عالم ہو گا! ہم نے اس شاعر کے اس مخلوق کے بارے میں قول کی تحقیق اس کے باوجود کی کہ عقل اپنی نظر سے یہ خیال کرتی ہے کہ مخلوق کی ثناء کا احاطہ ممکن ہے، حالانکہ حقیقت میں ایسا نہیں ہے۔ بلکہ اس شاعر نے حق بات کہی، خواہ اتفاقاً یا کسی تحقق کی بنا پر۔ اور وہ اس کے اس قول میں ہے: \"آپ وہی ہیں جس کی ہم ثناء کرتے ہیں،\" اور وہ وہی ہے جس پر وہ ممدوح اس وقت ہے، \"اور اس سے بھی بڑھ کر ہیں جس کی ہم ثناء کرتے ہیں،\" کیونکہ وہ اس کے لیے قابل محل ہے جو اللہ اس میں صفات پیدا کرتا ہے، جن کے ذریعے اس کی ثناء کی جاتی ہے۔ اور اس میں ان صفات کی کوئی انتہا نہیں ہے، یعنی ان چیزوں کی جو ان سے پیدا ہوتی ہیں اور جو ممدوح کی ثناء کو واجب کرتی ہیں۔ اور جب یہ ثناء ذات حق (الحق) تعالیٰ پر ہو، تو اسے اپنی ذات کے لیے ہستی (الوجود) میں بقا حاصل ہے، وہ عدم کو قبول نہیں کرتی۔ اور ہماری طرف سے اس کی ثناء تجدد کے ساتھ دائمی ہے، کیونکہ ہمارے اندر ہر سانس میں اللہ کے بارے میں ایک نیا علم ہم پر ظاہر ہوتا ہے، پس ہم اس کے ذریعے اس کی ثناء کرتے ہیں، یا کسی ایسے امر کا علم جو ہمارے پاس نہیں تھا، تو ہم اس کے ذریعے اس کی ثناء کرتے ہیں۔ اور ہم یہ شعر اس طرح نہیں پڑھتے جیسا کہ اس کے کہنے والے نے کہا، بلکہ ہم اسے اس طرح پڑھتے ہیں جیسا کہ ہم نے کہا اور اس علم نے ہمیں عطا کیا، پس ہم کہتے ہیں:\n\n> جب ہم آپ کی اچھی صفات کے ساتھ ثناء کرتے ہیں،\n> تو آپ ہی ہیں جو ثناء کرتے ہیں اور ہم نہیں ہیں جو ثناء کرتے ہیں۔\n\nاور یہ اس سے بڑھ کر ہے جو شاعر نے ایک پہلو سے کہا، اور ایک پہلو سے اس کے برابر ہے، خواہ اس نے یہ کسی محقق علم سے کہا ہو یا اتفاقاً کہا ہو اور وہ نہ جانتا ہو۔ پس اللہ تعالیٰ نے اسے حق بات کہلوائی جہاں سے اسے شعور بھی نہ تھا، جیسا کہ وہ بندے کو استدراج کرتا ہے جہاں سے وہ نہیں جانتا اور اس کے ساتھ مکر کرتا ہے جہاں سے اسے شعور نہیں ہوتا۔ اور ذات حق (الحق) اپنی ذات میں معلوم و معروف ہے، اور اس کا عالم اس کی ثناء کا احصاء کرنے سے عاجز ہے جیسا کہ اس کے شایان شان ہے، کیونکہ یہ وسعت میں نہیں ہے اور نہ ہی کوئی ممکن استعداد اسے عطا کر سکتی ہے۔ پس یہ وہ ہے جو استعدادات (الاستعدادات) اور اسماء الٰہیہ (الأسماء الإلهية) کی مؤاخات نے عطا کیا، اور یہ اخوت کی اعلیٰ ترین قسم ہے جس تک پہنچا جا سکتا ہے۔ پھر اس سے نیچے کی اخوت کی طرف نزول ہوتا ہے، اور وہ اللہ کا یہ فرمان ہے: \"بیشک مومن آپس میں بھائی بھائی ہیں، پس اپنے دو بھائیوں کے درمیان صلح کراؤ۔\" (الحجرات: ۱۰)\n\n### [بیشک المؤمن اس کے اسماء حسنیٰ میں سے ہے]\n\nاور اس کے اسماء (الأسماء) میں سے ایک المؤمن ہے۔ اور ان کے درمیان اس بات پر تنازع واقع ہوا جو اس نے اپنے بارے میں خبر دی کہ وہ ایسا ہے، تو مخلوق میں سے اس مؤمن نے اس سے تنازع کیا جو ایمان میں اس کے ساتھ شریک تھا، پس اس ایمان کی وجہ سے اس کے ساتھ اس کی اخوت قائم ہوئی، اس نے اپنی عقلی دلیل کی نظر سے یہ سمجھا کہ وہ اس کے خلاف ہے جو اس نے اپنے بارے میں خبر دی، باوجود اس کے کہ وہ اس کی تصدیق کرنے والا تھا، لیکن اس نے اس پر تاویل کی۔ پس جب مؤمن الحق (ذات حق) اور مؤمن الخلق (مخلوق مؤمن) کے درمیان یہ تنازع ظاہر ہوا، تو اللہ نے علماء کشف (الکشف) سے فرمایا: \"اپنے دو بھائیوں کے درمیان صلح کراؤ۔\" پس مؤمن عالم مکاشفین (الکاشفین) صلح کے لیے ان دونوں کے درمیان داخل ہوئے، اور وہ اس طرح کہ مؤمن الحق اپنے اس مؤمن بھائی کے ساتھ ہو، یہاں تک کہ وہ اسے اپنی قوت پہنچا دے، کیونکہ وہ بہرحال مخلوق ہے اور اسے کامل کشف عطا نہیں کیا گیا اور نہ ہی اس پر اس کے ذریعے ظہور ہوا ہے۔ پس وہ اس کے ساتھ ہو، اس طرح کہ اسے اس کا مرتبہ عطا کرے، پس مؤمن الحق اس مبلغ سے کہے کہ اس تنازع کرنے والے سے کہو: \"میں ہی اللہ ہوں، کوئی چیز اس کی مانند نہیں ہے،\" (الشوریٰ: ۱۱) \"اور نگاہیں اسے نہیں پا سکتیں،\" (الانعام: ۱۰۳) اور میں وصف کرنے والوں کے وصف سے منزہ ہوں۔ پس رسول اس مؤمن تنازع کرنے والے کے پاس توقیع الٰہی (الٰہی فرمان) لے کر آیا، اس کے اس قول کے ساتھ: \"کوئی چیز اس کی مانند نہیں ہے،\" اور اس کے اس قول کے ساتھ: \"پاک ہے تیرا رب، عزت کا رب، ان چیزوں سے جو وہ بیان کرتے ہیں،\" (الصافات: ۱۸۰) اور اس قسم کی تنزیہ کی مثالیں جو عقلی نظری دلیل عطا کرتی ہے۔ پس جب اس نے یہ سنا تو اس کا دل مطمئن ہو گیا اور وہ اس کی طرف مائل ہو گیا اور اس کا تنازع ختم ہو گیا۔\n\nاور علماء اس پہلو سے صلح کے لیے مؤمن الخلق کے پاس آئے اور اس سے کہا: \"تم جانتے ہو کہ مؤمن الحق اپنے آپ کو تم سے زیادہ جانتا ہے، بلکہ وہ تمہیں تمہارے اپنے علم سے بھی زیادہ جانتا ہے۔ اور تم اس پر صرف اسی چیز کے ذریعے حکم لگاتے ہو جو تمہارے لیے بھی پیدا کی گئی ہے، اور وہ تمہاری عقل، تمہاری فکر اور تمہاری دلیل ہے۔ پس تم میں اور ہر مخلوق میں اس عجز کے معاملے میں کوئی فرق نہیں ہے جس سے مؤمن الحق عاجز نہیں ہوتا۔ پس تم اس کے ساتھ مقام تسلیم میں کھڑے ہو جاؤ، کیونکہ اگرچہ وہ مؤمن ہے اور تم بھی مؤمن ہو، لیکن تم اپنے لائق مرتبے پر ہو اور وہ اپنے لائق مرتبے پر ہے۔ اور تم جانتے ہو کہ تم اس کی مانند نہیں ہو، اگرچہ ایمان تم دونوں کو جمع کرتا ہے، لیکن اس کی نسبت تمہاری طرف ویسی نہیں ہے جیسی تمہاری نسبت اس کی طرف ہے۔ پس تم اس کی مانند نہیں ہو، لہٰذا یہ مماثلت تمہیں دھوکے میں نہ ڈالے اور اپنی قدر پہچانو۔\" پس جب اس نے یہ سنا تو اس نے صلح اور اس تنازع سے معافی طلب کی جو اس سے واقع ہوا تھا، اور مؤمن الحق نے اس تنزیہ کے ذریعے اس پر احسان کیا جو اس کے لیے منشور میں واقع ہوا تھا جس کی وجہ سے تنازع ہوا تھا۔ پس مؤمن عالموں نے مؤمن الحق اور اس مؤمن الخلق کے درمیان صلح کرا دی۔ پس اللہ کی طرف سے اس وحی کو اسی طرح سمجھنا چاہیے جو اس نے اپنے بندوں پر اپنے رسولوں کی زبانوں سے نازل کی اور اپنی کتابوں میں اتاری۔ پھر اخوت ایمان میں کشف (الکشف) کے درجات میں سے ایک اور درجہ ہے، اور وہ اس کا یہ فرمان ہے جب اس نے ہمیں المؤمن کے نام سے پکارا: \"بیشک مؤمن ایمان کی ابوت کی وجہ سے بھائی بھائی ہیں۔\"\n\nاس کہنے والے نے فرمایا: \"مومن اپنے بھائی کا آئینہ ہے۔\" اور \"وہ اپنی خواہش سے نہیں بولتا۔\" (النجم: ۳) پس اس نے مؤمنوں کے درمیان اخوت ثابت کی اور ہر مؤمن کو اپنے بھائی کے لیے آئینہ قرار دیا، پس وہ اسے دیکھتا ہے اور اس میں اپنے آپ کو دیکھتا ہے کہ وہ کس صورت پر ہے۔ ان میں سے ہر مؤمن اس مرتبے پر ہے، پس مؤمن الحق مؤمن الخلق کے لیے آئینہ ہوتا ہے، پس وہ اسے دیکھتا ہے اور جانتا ہے کہ وہ اسے دیکھ رہا ہے، جیسا کہ آئینہ دیکھنے والا جانتا ہے کہ اس کے پاس ایک آئینہ ہے، پھر وہ اس میں دیکھتا ہے تو اپنی صورت کے سوا کچھ نہیں دیکھتا اور اس صورت کو دیکھتا ہے جو آئینے نے اس میں اثر ڈالا ہے۔ اور اسی لیے اس کے لیے دو آنکھیں بنائی گئیں تاکہ وہ ایک آنکھ سے اپنی صورت دیکھے اور دوسری آنکھ سے وہ دیکھے جس کا حکم آئینے نے اس کی صورت میں لگایا، کیونکہ وہ اپنی ذات میں اس طرح نہیں تھا جیسا کہ آئینے نے محسوس صورت میں اس پر حکم لگایا، جیسے بڑا ہونا، چھوٹا ہونا، لمبا ہونا، چوڑا ہونا، سیدھا ہونا یا الٹا ہونا، آئینے کی شکل کے مطابق۔ اور یہ دیکھنے والا اس تمام اثر کو صرف اپنی صورت میں دیکھتا ہے، پس وہ جانتا ہے کہ اس میں اس کا ایک ذاتی حکم ہے، اور وہ اس آئینے میں اپنے آپ کو صرف اسی کے مطابق دیکھ سکتا ہے۔\n\nپس جب مؤمن الخلق مؤمن الحق کے لیے عین آئینہ ہے، تو ذات حق (الحق) اسے دیکھتا ہے، اور وہ اپنی ذات میں ایک خاص استعداد (الاستعداد) پر ہے، پس ذات حق کی طرف سے اس کے لیے صرف اس کی استعداد کے مطابق ہی ظاہر ہوتا ہے۔ پس ذات حق اپنے آپ کو اس خاص آئینے میں صرف اسی قدر دیکھتا ہے۔ پس اس آئینے نے دیکھنے والے کے ادراک میں اس چیز پر کمی کا اثر ڈالا جو اس نے استعداد کے حکم سے دیکھا، پس اس پہلو سے وہ اس کے مشابہ ہوا۔ پس اس مقام کو اخوت سے تعبیر کیا گیا، کیونکہ اگر دونوں امور کے درمیان مناسبت نہ ہوتی تو ان میں سے ہر ایک دوسرے کا آئینہ نہ ہوتا۔ اور اللہ نے یہ مثال قائم نہیں کی اور ہمارے لیے یہ آئینے پیدا نہیں کیے مگر اس لیے کہ ہمیں ان میں دیکھنے کی توفیق دے تاکہ ہم اپنی صورت میں واقع ہونے والی خرابی اور اس سے متعلقہ تکلیف کو دور کر سکیں، بصیرت کے ساتھ اسے ہٹا سکیں۔ پس یہ عیوب کو دور کرنے کے لیے ایک تجلی (التجلی) ہے۔ اور یہ تمہیں اس بات پر دلالت کرتا ہے کہ آئینے میں دیکھنے والے کو ایسا علم حاصل ہوتا ہے جو اس نے پہلے نہیں دیکھا تھا۔ پس مؤمن مخلوق میں یہ قریب اور درست ہے، اور مؤمن الحق میں یہ مشکل ہے۔ اور یہی مؤمن الحق کے بارے میں اللہ تعالیٰ کا فرمان ہے: \"اور ہم تمہیں ضرور آزمائیں گے تاکہ ہم جان لیں۔\" (محمد: ۳۱) اسی طرح جب ذات حق اپنے آپ کو مؤمن مخلوق کے آئینے میں دیکھتا ہے، تو وہ دیکھتا ہے کہ اس کی استعداد کے حکم سے وہ اس میں اس کے سوا کچھ نہیں دیکھتا، پس وہ متعدد آئینوں میں دیکھنے سے اس حکم کو اپنے سے دور کرتا ہے، پس ایک ہی صورت میں حکم استعدادات کے اختلاف سے مختلف ہوتا ہے، حالانکہ وہ عین وہی ہے، کوئی اور نہیں۔ پس وہ اس وقت جانتا ہے کہ استعداد کے حکم نے جو کچھ دیا وہ دیا، اور وہ اپنی ذات میں اسی پر ہے جس پر وہ ہے، پس اس سے تقیید کی تکلیف دور ہو گئی، جیسا کہ ابتلاء نے تردد کی تکلیف اور حجت قائم کرنے کے مطالبے کو دور کر دیا تاکہ وہ غالب ہو، پس اس نے فرمایا: \"تاکہ ہم جان لیں۔\" پس اس نے ابتلاء کو اس علم کے حصول کا سبب بنایا، حالانکہ وہ علم کے حصول کا سبب نہیں ہے، بلکہ وہ حجت قائم کرنے کا سبب ہے تاکہ محجوج (جس پر حجت قائم کی گئی) کے پاس کوئی حجت نہ ہو جس سے وہ دفاع کر سکے۔\n\nاور جہاں تک خلق میں صورت کی مماثلت کا تعلق ہے، تو وہ نیابت اور خلافت کے لیے ہے، اخوت کے لیے نہیں۔ کیونکہ وہ عالم کی صورت کے لحاظ سے عالم سے ہے، جیسا کہ روح انسان کی صورت میں جسم سے ہے۔ اور وہ ذات حق (الحق) کی صورت کے لحاظ سے وہ ہے جو اسماء الٰہیہ (الأسماء الإلهية) کے احکام کے ذریعے عالم میں ظاہر ہوتا ہے جن کا تعلق عالم سے ہے۔ پس صورت اخوت نہیں ہے جیسا کہ بعض لوگ اسے دیکھتے ہیں۔ اور اسی لیے ہم نے اخوت کا ذکر صرف ایک خاص معاملے میں کیا ہے، اور وہ مؤمن ہے۔ مگر یہ کہ صورت سببیّت کے ذریعے اخوت ایمان کی کمر مضبوط کرتی ہے، کیونکہ اگر اسباب کا مسبب میں کوئی اثر نہ ہوتا تو اللہ انہیں پیدا نہ کرتا۔ اور اگر مسببات میں ان کا حکم ذاتی نہ ہوتا تو وہ اسباب نہ ہوتے اور ان کا سبب ہونا درست نہ ہوتا۔ اور یہ اس شخص میں معلوم ہوتا ہے جو وجود (الوجود) کو صرف محل میں قبول کرتا ہے، اور وہاں کوئی محل نہیں ہے، اور موجد اس کا وجود چاہتا ہے۔ پس اس مراد کے وجود کے لیے محل کا موجود ہونا ضروری ہے جس کا وجود مطلوب ہے، پس محل کا وجود اس مراد کے وجود کا سبب بنتا ہے جس سے ارادہ متعلق ہوا اور اس کے ایجاد سے۔ پس تم نے جان لیا کہ اسباب کے مسببات میں احکام ہوتے ہیں، پس وہ صانع کے لیے آلے کی مانند ہیں، تو صنعت اور مصنوع کی نسبت صانع کی طرف کی جاتی ہے نہ کہ آلے کی طرف۔ اور اس کی وجہ یہ ہے کہ آلے کو اس بات کا علم نہیں ہوتا کہ صانع کے دل میں کیا ہے کہ وہ اس کے ذریعے خاص طور پر کیا بنائے گا، بلکہ اسے صرف یہ علم ہوتا ہے کہ وہ ایک آلہ ہے، نہ کہ وہ صنعت جو اس کی حقیقت عطا کرتی ہے۔ اور صانع کا کام اس کے بغیر نہیں ہوتا۔ پس آلے کی صنعت ذاتی ہے، اور صانع کی طرف سے اس کے ساتھ جو ہے وہ ارادی ہے، اور وہ اس کا یہ فرمان ہے: \"جب ہم کسی چیز کا ارادہ کرتے ہیں تو ہم اسے کہتے ہیں 'ہو جا' (کن)\" (یٰس: ۸۲) اور 'کن' ایجاد کے لیے آلہ ہے۔ پس اس نے اس کے بغیر کسی چیز کو پیدا نہیں کیا۔ اور اس کلمے کا اس کی ذات ہونا یا کوئی زائد امر ہونا ایک اور علم ہے۔ مقصود صرف اس معنی کو سمجھنا ہے، اور یہ کہ ایجاد صرف ارادے سے، قول کے بغیر، اور مرید اور قائل کے بغیر حاصل نہیں ہوا۔ پس اسباب کا حکم مسببات میں ظاہر ہوا، پس اس کے حکم کو صرف وہی جاہل دور کرتا ہے جو اس کے مقام اور اس کی اعیان (حقیقتوں) کے عطا کردہ سے ناواقف ہو۔ \"خبردار! اسی کے لیے خلق اور امر ہے، بابرکت ہے اللہ جو تمام جہانوں کا رب ہے۔\" (الاعراف: ۵۴)\n\nاور اسی لیے موسیٰ علیہ السلام نے کہا: \"اور اسے میرے کام میں شریک کر دے،\" اور فرمایا: \"اس کے ذریعے میری کمر مضبوط کر دے، اور وہ مجھ سے زیادہ فصیح زبان والا ہے۔\" (طٰہٰ: ۳۲-۳۴) پس اس نے جانا جو اس نے کہا، اور ہم نے اس قول سے وہ جانا جس کی طرف اس نے اشارہ کیا تاکہ صاحب عین الفہم (بصیرت والا) اس سے سمجھ لے۔ پس یہ تعاون کا معنی ہے، اور یہ اس کے اس فرمان میں ہے: \"اللہ سے مدد طلب کرو،\" (البقرہ: ۱۵۳) اور \"ہم صرف تیری ہی مدد چاہتے ہیں۔\" (الفاتحہ: ۵) اور اللہ بندے کی مدد میں رہتا ہے جب تک بندہ اپنے بھائی کی مدد میں رہتا ہے۔\n\nپس اگر مستعان بہ (جس سے مدد طلب کی گئی) کی طرف سے وجود (الوجود) میں مطلوب کی شرکت نہ ہوتی تو مدد طلب کرنے والا اپنی استعانت میں سچا نہ ہوتا۔ اور مدد طلب کرنے والا کبھی کبھی مستعان بہ کی تعظیم کے لیے مدد طلب کرتا ہے، باوجود اس کے کہ وہ خاص طور پر اس سے بے نیاز ہوتا ہے، اگرچہ سبب کا ہونا ضروری ہے، یا وہ ان لوگوں میں سے ہو جو سبب کے بغیر خود کفیل ہوتے ہیں، تو وہ اسے سبب بنانا چاہتا ہے تاکہ اس کے ذریعے دوسروں پر اس کی شرافت ظاہر ہو، تاکہ اس کا مرتبہ اس کے نزدیک معلوم ہو جائے۔ کیونکہ اللہ نے عالم میں فضیلت رکھی ہے۔ اور جہاں تک اسماء الٰہیہ (الأسماء الإلهية) کے درمیان مؤاخات کا تعلق ہے، تو وہ صرف ان اسماء کے درمیان ہوتی ہے جن میں اپنی ذات کے لیے کوئی منافرت نہ ہو۔ کیونکہ اللہ نے صرف مؤمنوں کے درمیان اخوت قائم کی، مؤمن اور کافر کے درمیان اخوت قائم نہیں کی۔ بلکہ اس نے اخوت ایمان کے فقدان کے ساتھ نسب کی اخوت کے لیے وراثت میں کوئی حصہ نہیں رکھا۔ پس مدعی صرف اخوت ایمان ہے۔ کیا تم نہیں دیکھتے کہ جب کوئی شخص اپنے نسبی بھائی کو چھوڑ کر مر جاتا ہے اور وہ دوسرے دین پر ہو تو نسبی بھائی اس کا وارث نہیں ہوتا، اور اس کے دین کا بھائی اس کا وارث ہوتا ہے۔ اور ہمارے اور ذات حق (الحق) کے درمیان صورت نسب اور دین دونوں ہے۔ اسی لیے عزت و جلال والا زمین کا وارث انسان کامل (الإنسان الکامل) کی موت کے بعد ہی ہوتا ہے، تاکہ وراثت صرف اس کے مستحق کو ہی ملے۔ جیسا کہ وہ آسمان کا وارث ہوتا ہے اس میں موجود انبیاء علیہم السلام کی ارواح کے حکم کی وجہ سے، نہ کہ اس وجہ سے کہ وہ فرشتوں کا محل ہے۔ پس جب وہ نفخہ (صور) سے بے ہوش ہو جائیں گے، تو اللہ آسمان کا وارث ہو گا، پس اسم الوارث فرشتوں کو آسمان سے نیچے اتارے گا، اور زمین کو دوسری زمین اور آسمانوں سے بدل دے گا، جیسا کہ ہم نے اس کتاب میں پہلے ذکر کیا ہے۔ پس مؤمن مؤمن کے لیے عمارت کی مانند ہے جو ایک دوسرے کو مضبوط کرتی ہے۔ پس مؤمن مؤمن سے بغض نہیں رکھتا، اور مؤمن اپنے ایمان کی وجہ سے مؤمن کو قتل نہیں کرتا، اور مؤمن اپنے نسبی بھائی کو قتل کر سکتا ہے اگر وہ مؤمن نہ ہو۔ پس یہ مقدار اس باب کے لیے کافی ہے۔ اب ہم ان علوم کا ذکر کرتے ہیں جو اس میں شامل ہیں:\n\nان میں سے ایک علم یہ ہے کہ ذات حق (الحق) اپنے بندوں کو کس صورت میں پکارتا ہے؟ کیا وہ انہیں اپنی مشیئت کے حکم سے پکارتا ہے یا اس حیثیت سے پکارتا ہے جس پر وہ ہیں؟ اور وہ کسے پکارتا ہے؟ کیا وہ منہ موڑنے والے کو پکارتا ہے یا متوجہ ہونے والے کو یا دونوں کو؟ اور اس میں آداب الٰہیہ کا علم، مخلوقات کے مراتب کا علم، اور ہر مخلوق بلکہ ہر موجود کے ساتھ کیسا سلوک کرنا چاہیے، اس کا علم ہے۔ اور موجودات کی مصلحتوں کا علم ہے، پس اس علم کا حامل صرف اسی چیز میں تصرف کرتا ہے جو اس کے اپنے لیے یا دوسروں کے لیے مصلحت ہو، اس مطلوب کے مطابق جو اسے تصرف کراتا ہے۔ پس وہ اپنے تصرفات میں اپنی نفسانی خواہش سے باہر ہوتا ہے، وہ صرف مصلحتوں کے ساتھ ہوتا ہے، پس وہ ہر چیز کے لیے ہے نہ کہ اس کے خلاف۔ اور اس میں ہر بات کہنے والے کی بات کو سمجھنے کا علم ہے، پس وہ جانتا ہے کہ اس نے کہاں سے بات کی، تو وہ اس کے لیے عذر پیش کرتا ہے ان لوگوں کے سامنے جو اس کی بات میں غلطی کو نہیں جانتے۔ اور یہ ایک عزیز علم ہے جس میں اس کے اہل کی طرف سے انصاف کم ہوتا ہے، تو اس شخص کا کیا حال جو اسے نہیں جانتا؟ اور اس علم پر عمل نہ کرنے والے پر جو حسرت اور ندامت ہوتی ہے اس کے استعمال نہ کرنے پر۔ اور اس میں تغافل اور بھول جانے میں حکمت کا علم ہے، اور وہ حلم اور مہلت الٰہی ہے، یا صاحب قدرت کی طرف سے، تاکہ وہ جس سے تغافل کیا گیا ہے وہ اس حالت سے باز آ جائے جس پر وہ تھا اور جو اس کے لیے یا اس پر ظاہر ہونا مناسب نہیں تھا۔ اور اس میں اس بات کا علم ہے کہ چیزیں اللہ کے ہاتھ میں ہیں، مخلوق کے ہاتھ میں ان میں سے کچھ نہیں ہے، اگرچہ صورتیں ان کے ہاتھوں میں ظاہر ہوتی ہیں، لیکن وہ عاریت کے حکم سے ہیں نہ کہ ملکیت کے حکم سے۔ اور اس میں ان الٰہی نعمتوں کا علم ہے جو اس نے بندوں پر ظاہر اور باطن میں مکمل کیں، اور ان میں سے جو متعین کی جا سکتی ہیں ان کا تعین ہے۔ اور جھگڑا کرنے والوں کے برزخ کا علم ہے تاکہ جو ان کے درمیان جھگڑا ختم کرنا چاہتا ہے وہ اس میں کھڑا ہو سکے۔ اور اس میں اسماء (الأسماء) کا علم اور ان کی شرافت، اور ان کے درمیان اور ان چیزوں کے درمیان فرق کا علم ہے جو ان کے اعلام (ناموں) سے زیادہ ہیں جو تعریف یا مذمت کے لیے رکھے گئے ہیں۔ اور اس میں اس راستے سے ہٹنے کا علم ہے جو بندے اور علم کے حصول کے درمیان حائل ہوتا ہے، کیونکہ یہ سب سے اعلیٰ مطلوب ہے، سب سے افضل کمائی ہے، سب سے بڑی چیز ہے جس پر فخر کیا جاتا ہے، اور سب سے مضبوط آلہ ہے جسے تیار اور ذخیرہ کیا جاتا ہے، اور اسی کے ذریعے اللہ نے اپنی تعریف کی کہ اس کے لیے حجت بالغہ ہے، اور وہ صرف علم ہے۔ اور اس میں انسانی خلق میں مخلوق کے مراتب کا علم ہے، کیونکہ وہ اس میں طبقات پر ہیں۔ اور وہ انسان جسے انسان نے پیدا کیا، کیا وہ انسان کہلاتا ہے یا انسان کی صورت میں حیوان، اس کے جسم کی نشوونما کے لحاظ سے؟ اور وہ کون سا امر ہے جس سے وہ اس مخلوق میں نفس ناطقہ کے ظہور میں عاجز رہا؟ کیا یہ استعداد کی کمی کی وجہ سے ہے، تو کیا اس صورت کو پیدا کرنے والے کے لیے وہ فیصلہ کیا جائے گا جس سے نفس کل (النفس الکل) سے نفس ناطقہ کا قبول واقع ہو؟ یا کیا یہ ارادی تعجیز الٰہی ہے کیونکہ یہ ایک عظیم امر ہے؟ اور ذکر کیا گیا ہے کہ ایسا واقع ہوا ہے، اور فلاحت نبطیہ میں ذکر کیا گیا ہے کہ بعض علماء نے علم طبیعت کے ذریعے انسانی منی سے ایک خاص تعفن کے ساتھ، ایک مخصوص وزن اور زمان و مکان پر، صورت میں ایک انسان بنایا، اور وہ ایک سال تک آنکھیں کھولتا اور بند کرتا رہا، اور نہ بولتا تھا اور نہ ہی اس غذا سے زیادہ کچھ لیتا تھا جو اسے دی جاتی تھی۔ پس وہ ایک سال زندہ رہا اور مر گیا۔ پس معلوم نہیں کہ کیا وہ انسان تھا جس کا حکم گونگے کا تھا یا انسان کی صورت میں حیوان تھا۔ اور اس میں انساب اور احساب کا علم ہے۔ اور اس میں اس بات کا علم ہے کہ اللہ مکلف سے کس چیز کا اعتبار کرتا ہے؟ کیا وہ اس کے ظاہر کا اعتبار کرتا ہے یا اس کے باطن کا یا مجموعے کا، اس چیز کے قبول میں جو اس سے تکلیف کے بعد واقع ہوتی ہے؟ اور جہاں تک تکلیف سے پہلے کا تعلق ہے، تو وہ مقید نہیں ہوتا بلکہ اپنی طبیعت کے مطابق چلتا ہے بغیر کسی مؤاخذے کے، اور یہ اللہ تعالیٰ کا فرمان ہے: \"اور ہم عذاب دینے والے نہیں تھے جب تک کہ ہم رسول نہ بھیجیں۔\" (الاسراء: ۱۵) اور اگر یہ ہے، تو چھوٹے بچے کو درد کہاں سے ہوا یہاں تک کہ وہ اس چیز سے رویا جو اسے محسوس ہوئی۔ اور اس میں جاہل کو علم کی طرف لوٹانے کی کیفیت کا علم ہے۔ اور اس میں تمام امور کو اللہ سبحانہ و تعالیٰ کی طرف اس کے قدس میں لوٹانے کی صورت کا علم ہے کہ وہ کس طریقے پر ہوتا ہے؟ کیا اس حکم سے کہ وہ ان کا موجد ہے، یا وہ ان کی غایت ہے، یا وہ کیا ہے؟ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\" (الاحزاب: ۴)",
    "fa": "«باب سیصد و سی و پنجم: در معرفت منزل اخوت (برادری)، و این منزل از حضرت محمدیه و موسویه است.»\n\nمیان غیب مطلق (العماء) و استوا (استقرار) *** عقل‌های صاحبان خرد حیران ماند.\nو همچنین هنگام نزولش *** از مقام استوایش به سوی آسمان.\nو هستی او در زمینش *** و در قلب ما و در هر کجا.\nاین نشانه‌ها همگی *** حیرت و کوری (معنوی) می‌بخشند.\nآن‌ها شش جهت برای ما هستند *** پس صورت‌هایی را فراموش کردند.\nپس خداوند به ذات خود جلیل است *** از وصف «علّ» (بالا بودن) و از «عسی» (شاید).\n\n[مقام جامع اسماء الهی]\n\nخداوند متعال فرمود: **«و در راه نیکی و پرهیزگاری (تقوی) با یکدیگر همکاری کنید»** (وتَعاوَنُوا عَلَى الْبِرِّ والتَّقْوى). و در خبر آمده است که: **«مؤمن آینه برادرش است»**. و «مؤمن» نامی از اسماء الهی است، و آدم بر صورت او آفریده شده است، و برای انسان تخلق به اسم مؤمن وجود دارد.\n\nو رسول خدا (صلی الله علیه و سلم) در دار الخیزران میان اصحابش پیمان اخوت بست و دست علی را گرفت و فرمود: «این برادر من است.»\n\nو خداوند متعال فرمود: **«همانا مؤمنان برادر یکدیگرند»** (إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ). پس ایمان را پدر آن‌ها قرار داد و آنان برادرانی از یک پدر هستند. و موسی (علیه السلام) هنگامی که خداوند او را به سوی فرعون فرستاد، به پروردگارش گفت: **«پروردگارا، سینه‌ام را برایم بگشا، و کارم را برایم آسان گردان، و گره از زبانم بگشا تا سخنم را بفهمند، و وزیری از خاندانم برایم قرار ده، هارون برادرم را، پشتم را به او محکم کن و او را در کارم شریک گردان»** (رَبِّ اشْرَحْ لِي صَدْرِي ويَسِّرْ لِي أَمْرِي واحْلُلْ عُقْدَةً من لِسانِي يَفْقَهُوا قَوْلِي واجْعَلْ لِي وَزِيراً من أَهْلِي هارُونَ أَخِي اشْدُدْ به أَزْرِي وأَشْرِكْهُ في أَمْرِي). پس خداوند خواسته‌اش را به او عطا کرد.\n\nپس ای ولیّ، بدان که مقام جامع اسماء الهی (الأسماء الإلهية) که در ممکنات تأثیر دارند، برادری حقیقی و شفیق برای مقام جامع استعدادهای قابل‌های ممکنات است. و این دو برادرانی از یک پدر هستند که هر یک پشت دیگری را محکم می‌کند. اما اسماء الهی طالب استعدادها هستند تا خداوند پشت آن‌ها را به واسطه استعدادها محکم کند. پس بفهم، زیرا این از علم اسراری است که مقامش میان ستر (پوشیدگی) و کشف (الکشف) است، و از دشوارترین علوم در تصور است، چرا که نفوذ اقتدار صحیح نمی‌شود مگر با توافق این دو برادر، نه با یکی از آن‌ها. و به واسطه این دو، اعیان ممکنات (أعيان الممكنات) ظاهر شدند و معرفت (المعرفة) کائنات به خداوند در هستی (الوجود) حاصل شد. و حق سبحانه (الحق سبحانه) با وجود این معرفت حادث، به عین مطلوب خود رسید؛ زیرا او عالم را نیافرید مگر برای اینکه عالم او را بشناسد. و عالم حادث است و جز حادث نمی‌تواند به او قیام کند. پس معرفت به خداوند به واسطه عالم قیام کرد، یا از طریق تعریف الهی، یا از طریق قوه‌ای که در او آفریده شده و به واسطه آن به معرفت خداوند از وجهی خاص و نه غیر آن می‌رسد.\n\nپس هر کس او را با این قوه تنزیه کند، او را شناخته و هر کس او را تشبیه کند، کافر شده است. و هر کس او را با این قوه تشبیه کند، او را شناخته و هر کس او را تنزیه کند، جاهل است، بلکه کافر شده است. و هر کس او را با تعریف الهی بشناسد، تنزیه و تشبیه را جمع کرده است؛ پس او را در موطن تنزیه، منزه دانسته و در موطن تشبیه، مشبه دانسته است. و هر یک از این اصناف، صاحب معرفت به خداوند است. پس هیچ کس از خلق خدا او را نشناخته نیست، زیرا او آن‌ها را نیافرید مگر برای اینکه او را بشناسند. پس اگر خداوند خود را به واسطه این قوه رساننده که همان فکر است، یا به واسطه تعریف انبیایی به آن‌ها معرفی نمی‌کرد، او را نمی‌شناختند، و آنچه عالم برای آن آفریده شده بود، در عالم واقع نمی‌شد. و ما در این مقام که معتقدات را در بر می‌گیرد، شعری داریم که این است:\n\nمخلوقات در مورد خدا عقایدی بستند *** و من شاهد تمام آنچه معتقد بودند، بودم.\nهنگامی که صورت‌های همّ (قصد) دگرگون‌شونده آشکار شد *** گفتند به آنچه شهود کردند و آنچه انکار نمودند.\nاین همان چیزی است که گذشتگانشان بر آن‌ها روا داشتند *** با تمام آنچه گفتند و معتقد شدند.\nاگر او را از شریک جدا کردند، پس در مُلک او *** پروردگاری را چنان که شهود کردند، قصد نمودند.\nشریعت، موحدِ تنها را معذور داشت *** و مشرکان شقی شدند، اگرچه او را پرستیدند.\nو همچنین اهل شک از آن‌ها زیانکارترند *** و منکران وجود کسی که او را یافتند.\nو کسانی که به نفی او قائل شدند نیز شقی شدند *** مانند آن سه (گروه) هنگامی که او را نیافتند.\nاین از تأله (پرستش) بر آن‌ها روا شد، هنگامی که *** اهل سعادت او را با هدایت پرستیدند.\nاگر با اقوامی که گمراهشان کرد، موافقت می‌کرد *** و از گمراهی او تنزیه می‌جستند، او را طرد می‌کردند.\n\nپس عارف کامل (العارف الکامل) او را در هر صورتی که تجلی (التجلی) می‌کند و در هر صورتی که نزول می‌یابد، می‌شناسد. و غیر عارف او را نمی‌شناسد مگر در صورت معتقد خود، و اگر در غیر آن صورت بر او تجلی کند، او را انکار می‌کند، چنانکه پیوسته خود را بر اعتقادش نسبت به او مقید می‌سازد و اعتقاد دیگران را انکار می‌کند.\nو این از دشوارترین امور در علم الهی است: اینکه اختلاف صور به چه چیزی باز می‌گردد؟ آیا به خود او باز می‌گردد؟ و این همان چیزی است که خبر الهی (الإنباء الإلهي) به آن واقع شده، اما دلیل عقلی که قوه متفکره آن را داده، آن را محال دانسته است.\nپس اگر امر بر همان باشد که خبر الهی داده است، هیچ کس جز خدا را ندیده است؛ پس او عین مرئی در صورت‌های مختلف است و عین هر صورت است.\nو اگر اختلاف صور به اختلاف معتقدات بازگردد و آن صور مانند معتقدات باشند نه عین مطلوب، پس هیچ کس جز اعتقاد خود را ندیده است، چه او را در هر صورتی شناخته باشد (زیرا معتقد است که او قبول تجلی و ظهور برای متجلی‌شونده در هر صورت را دارد) یا او را فقط در صورتی مقید شناخته باشد.\nپس چنین علمی دانسته نمی‌شود مگر با اخبار الهی و قرینه حال. اما اخبار الهی:\n\nپس سخن رسول خدا (صلی الله علیه و سلم) در حدیث صحیح است که: **«او کسی است که در صورت‌ها متحول می‌شود»**. و قرینه حال این است که او خلق را نیافرید مگر برای اینکه او را بشناسند. پس ناگزیر باید او را بشناسند، یا از طریق کشف (الکشف)، یا عقل، یا تقلید از صاحب کشف یا عقل. و رؤیت تابع معرفت است؛ همانطور که معرفت به او تعلق گرفت و او معروف شد، رؤیت نیز به او تعلق گرفت و او مرئی شد.\nاگر منکر این دو امر (معرفت و رؤیت) که قائل به وصول به معرفت و رؤیت او نیست، بگوید: علم به او همان معرفت ناظر در این امر است که او از معرفت او عاجز است، و در آن هنگام می‌داند که کسی که در این مرتبه است، خداست؛ پس علم به او به صورت اجمالی در عین جهل و عجز به دست آمده است. و این سخن برخی است که: **«عجز از درکِ ادراک، خود ادراک است»**. پس این مقدار، معرفت به خداوند نامیده می‌شود. و صاحب این قول، اگر به واسطه سخنش جزا داده شود، هرگز خدا را نمی‌بیند، همانطور که هرگز او را نمی‌شناسد. و اگر خداوند او را به واسطه سخنش جزا ندهد و از جانب خدا چیزی بر او آشکار شود که انتظارش را نداشت و در حال دوم خلاف آنچه می‌دانست، از او بداند، در این صورت او را می‌بیند و می‌داند که او همان است.\n\nو صحیح آن است که او می‌داند و می‌بیند؛ زیرا خداوند متعال معرفت حادث به خود را برای کمال مرتبه عرفان (العرفان) و مرتبه هستی (الوجود) آفرید. و این کمال حاصل نمی‌شود مگر با تعلق علم حادث به خداوند بر صورتی که علم قدیم به او تعلق گرفته است. و علم قدیم به عجز از علم به او تعلق نگرفته است. همچنین علم حادث به او نیز تعلق نگرفته مگر به آنچه او در نفس خود معلوم است. و آنچه او در نفس خود بر آن است، این است که او عین هر صورت است، پس او هر صورت است.\nپس عجز از این بنده واقع نشد مگر به این دلیل که او را به یک صورت محدود کرد، و آن صورت معتقد اوست، در حالی که او عین صورت معتقد اوست. پس او عاجز نشد مگر از حکم کردن بر او به آنچه شایسته اوست. و به عجز از علم به او متصف نمی‌شود مگر کسی که علم را از دلیل عقل خود گرفته باشد. اما کسی که علم به او را از خدا گرفته باشد، نه از دلیل و نظر خود، این شخص از حصول علم به خداوند عاجز نمی‌شود؛ زیرا او در پی امری که از آن عاجز شود، نبوده تا به عجز خود اعتراف کند. و این همان چیزی نیست که او با نظر در دلیل عقل خود می‌طلبد، بلکه علم او از طریق تعریف و تجلی (التجلی) است که علمی موهوبی از حکیم حمید است.\nپس کسی که می‌گوید: «منزه است کسی که شناخته نمی‌شود مگر با عجز از معرفت او»، صاحب علم نظری است، نه صاحب تعریف الهی.\nاما عجز از احصاء ثنا بر او، این سخن یک کامل محقق است؛ زیرا عجز از احصاء ثنا بر او حاصل نمی‌شود مگر پس از علم به اینکه مثنی‌علیه (ستایش‌شده) چیست. پس می‌داند که او بزرگ‌تر از آن است که ثنایی او را احاطه کند و وصفی به نهایت آن برسد، چنانکه در مورد برخی مخلوقات گفته شده است:\n\nاگر ما تو را به نیکی ستایش کنیم *** پس تو همان کسی هستی که ستایش می‌کنیم و فراتر از آنی که ستایش می‌کنیم.\n\nاین سخنی در مورد یک مخلوق است و سخنی محققانه است، پس ثنا بر خداوند سبحان چگونه خواهد بود؟ ما سخن این شاعر را در مورد این مخلوق محقق دانستیم، با وجود اینکه عقل با نظر خود تصور می‌کند که احاطه بر ثنای مخلوق ممکن است، در حالی که امر در نفس خود چنین نیست. بلکه این شاعر حقیقتی را گفته است، یا از روی تصادف یا از روی تحقق برای او. و آن در سخن اوست که: «پس تو همان کسی هستی که ستایش می‌کنیم»، و این همان چیزی است که آن ممدوح در آن زمان بر آن است، و «فراتر از آنی که ستایش می‌کنیم»، زیرا او محلی است که صفاتی را که خداوند در او می‌آفریند، می‌پذیرد و به واسطه آن‌ها ستایش می‌شود. و این صفات در او بی‌نهایت است، یعنی آنچه از آن‌ها حاصل می‌شود و موجب ثنا بر ممدوح می‌گردد.\nو چون این ثنا بر حق تعالی است، پس برای ذات خود در هستی (الوجود) بقا دارد و عدم را نمی‌پذیرد. و ثنای ما بر او با تجدد، دائمی است، زیرا در هر نفسی که در ماست، علمی به خداوند بر ما تجدید می‌شود و ما او را به واسطه آن ستایش می‌کنیم، یا علمی به امری که نزد ما نبوده، حاصل می‌شود و او را به واسطه آن ستایش می‌کنیم. و ما این بیت را آنگونه که صاحبش گفته، نمی‌خوانیم، بلکه آن را بر اساس آنچه گفتیم و آن علم به ما عطا کرد، می‌خوانیم و می‌گوییم:\n\nاگر ما تو را به نیکی ستایش کنیم *** پس تو همان کسی هستی که ستایش می‌کنی و ما نیستیم که ستایش می‌کنیم.\n\nو این از جهتی فراتر از سخن شاعر است و از جهتی مساوی آن، چه آن را از روی علم محقق گفته باشد یا از روی تصادف و ناآگاهی. پس خداوند متعال او را به حق به سخن آورد، در حالی که او نمی‌دانست، همانطور که بنده را از جایی که نمی‌داند، به تدریج می‌گیرد و از جایی که نمی‌داند، با او مکر می‌کند.\nو حق در نفس خود معلوم و معروف است، و عالم به او از احصاء ثنا بر او آنگونه که شایسته اوست، عاجز است؛ زیرا حصول آن در توان نیست و هیچ استعداد ممکنی آن را اصلاً عطا نمی‌کند.\nپس این همان چیزی است که مؤاخات (برادری) استعدادها و اسماء الهی (الأسماء الإلهية) آن را بخشیده است. و این بالاترین اخوتی است که به آن می‌توان رسید. سپس به اخوتی پایین‌تر از آن نزول می‌یابد، و آن سخن خداوند است: **«همانا مؤمنان برادر یکدیگرند، پس میان دو برادرتان صلح برقرار سازید»** (إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ).\n\n[همانا مؤمن از اسماء حسنای اوست]\n\nو «مؤمن» از اسماء اوست. و نزاع میان آن‌ها در مورد آنچه خداوند از خود خبر داده که چنین است، واقع شد. پس مؤمنِ مخلوق که در ایمان با او مشترک است، با او نزاع کرد. پس به واسطه این ایمان، اخوتی با او داشت، اما با نظر در دلیل عقلی خود، حکم کرد که او بر خلاف آنچه از خود خبر داده است، می‌باشد، با وجود اینکه او را تصدیق می‌کرد، اما بر او تأویل می‌برد.\nهنگامی که این نزاع میان مؤمن حق (خداوند) و مؤمن خلق (بنده) آشکار شد، خداوند به علمای کشف (الکشف) فرمود: **«میان دو برادرتان صلح برقرار سازید»**. پس مؤمنانِ عالمِ مکاشف برای صلح میان آن دو وارد شدند. و این صلح به این صورت است که مؤمن حق با این مؤمنِ برادرش همراه باشد تا قوت خود را به او برساند، زیرا او در هر حال مخلوق است و کشف کامل به او داده نشده و حق با آن بر او ظاهر نشده است. پس باید با او باشد به گونه‌ای که منزلتش را به او عطا کند.\nپس مؤمن حق به ابلاغ‌کننده می‌گوید: به این نزاع‌کننده بگو: من همان خدایی هستم که **«چیزی مانند او نیست»** (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ) و **«چشم‌ها او را در نمی‌یابند»** (ولا تُدْرِكُهُ الْأَبْصارُ) و من از وصف واصفان منزه هستم. پس رسول با توقیع الهی به سوی این مؤمن نزاع‌کننده آمد، با سخن او که: **«چیزی مانند او نیست»** (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ) و سخن او که: **«منزه است پروردگار تو، پروردگار عزت، از آنچه وصف می‌کنند»** (سُبْحانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَ) و امثال این نوع تنزیه که دلیل عقل نظری آن را می‌دهد. پس هنگامی که این را از او شنید، قلبش آرام گرفت و به سوی او متمایل شد و نزاعش برطرف گشت.\nو علما از این جانب برای مصالحه نزد مؤمن خلق آمدند و به او گفتند: تو می‌دانی که مؤمن حق به نفس خود داناتر از تو به اوست، بلکه به تو داناتر از علم تو به خودت است. و تو تنها بر او حکم می‌کنی به آنچه برای تو آفریده شده، مانند خودت، و آن عقل و فکر و دلیل توست. پس میان تو و هر مخلوقی در عجز از آنچه مؤمن حق از آن عاجز نیست، فرقی نیست. پس در موضع تسلیم با او بایست. زیرا اگرچه او مؤمن است و تو مؤمن، اما تو در مرتبه شایسته خود هستی و او در مرتبه شایسته خود. و تو می‌دانی که مانند او نیستی، و اگرچه ایمان شما را جمع کرده است، اما نسبت تو به او مانند نسبت او به تو نیست، زیرا تو مانند او نیستی. پس این مماثلت تو را فریب ندهد و قدر خود را بشناس.\nپس هنگامی که چنین سخنی را شنید، صلح و اقاله (بخشش) از نزاعی که از او سر زده بود، طلب کرد. و مؤمن حق بر او منت نهاد به واسطه تنزیهی که در منشور آمده بود و نزاع به خاطر آن واقع شده بود. پس مؤمنانِ عالم میان مؤمن حق و این مؤمن خلق صلح برقرار کردند.\nپس فهم از خداوند در آنچه بر بندگانش به زبان رسولانش وحی کرده و در کتاب‌هایش نازل نموده، باید اینگونه باشد.\nسپس در اخوت ایمان، درجه دیگری از درجات کشف (الکشف) وجود دارد، و آن سخن اوست پس از آنکه خود را برای ما مؤمن نامید، که: «همانا مؤمنان برادر یکدیگرند» به واسطه پدریِ ایمان.\n\nگوینده‌ای که **«از روی هوی و هوس سخن نمی‌گوید»** (وما يَنْطِقُ عَنِ الْهَوى‏)، پس اخوت را میان مؤمنان ثابت کرد و هر یک از مؤمنان را آینه‌ای برای برادرش قرار داد تا او را ببیند و خود را در او ببیند، از این جهت که هر یک از آن دو مؤمن بر چه صورتی بوده است.\nپس مؤمن حق (خداوند) آینه‌ای برای مؤمن خلق (بنده) می‌شود و حق او را می‌بیند و می‌داند که او را می‌بیند، همانطور که صاحب آینه می‌داند که آینه‌ای دارد و سپس در آن نگاه می‌کند و جز صورت خود و صورتی که آینه در او تأثیر گذاشته، نمی‌بیند. و به همین دلیل برای او دو چشم قرار داده شده تا با یک چشم صورت خود را ببیند و با چشم دیگر آنچه را که آینه در صورت او حکم کرده است، ببیند؛ زیرا او در نفس خود بر آن صورتی که آینه بر او حکم کرده (از بزرگی و کوچکی و درازی و پهنا و استقامت و واژگونی بر حسب شکل آینه) نبوده است. و این ناظر تمام این تأثیر را جز در صورت خود نمی‌بیند، پس می‌داند که آینه در او حکمی ذاتی دارد که نمی‌تواند خود را در این آینه ببیند مگر بر حسب آن.\nپس هنگامی که مؤمن خلق عین آینه برای مؤمن حق باشد، حق او را می‌بیند در حالی که او در نفس خود بر استعداد خاصی است. پس از حق برای او جز به اندازه استعدادش آشکار نمی‌شود. پس حق از نفس خود در این آینه خاص جز به همان اندازه نمی‌بیند. پس این آینه در ادراک بیننده، قصور را بر آنچه دیده است، به حکم استعداد تأثیر گذاشته است. پس از این وجه به او شبیه شده است.\nپس این مقام را به «اخوت» تعبیر کرد، زیرا اگر مناسبتی میان این دو امر نبود، هر یک از آن دو آینه برادرش نمی‌شد. و خداوند این مثال را قرار نداد و این آینه‌ها را برای ما نیافرید، مگر برای اینکه به ما عطا کند که با نظر در آن‌ها، خللی را که در صورت ما واقع شده و آسیبی که به آن تعلق گرفته، اصلاح کنیم تا آن را با بصیرت برطرف سازیم. پس این تجلی (التجلی) برای از بین بردن عیوب است. و این به تو نشان می‌دهد که بیننده در آینه، علمی را به دست می‌آورد که پیش از آن نمی‌دید.\nپس در مؤمن مخلوق، این امر نزدیک و صحیح است، اما در مؤمن حق، چنین چیزی دشوار است. و این همان سخن خداوند متعال در مورد مؤمن حق است که: **«و قطعاً شما را می‌آزماییم تا بدانیم»** (وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ). همچنین هنگامی که حق خود را در آینه مؤمن مخلوق می‌بیند، می‌بیند که به حکم استعداد آن، جز آن را در آن نمی‌بیند. پس این حکم را با نظر در آینه‌های متعدد از خود برطرف می‌کند. پس حکم در یک صورت با اختلاف استعدادها متفاوت می‌شود، در حالی که او عین همان است و غیر آن نیست. پس در آن هنگام می‌داند که حکم استعداد، آنچه را که داده، داده است، و او بر همان چیزی است که در نفس خود بر آن است. پس آسیبی که از قید به او تعلق گرفته بود، زائل شد، همانطور که ابتلا، آسیب تردید و طلب اقامه حجت را از بین برد تا او غالب باشد، پس فرمود: **«تا بدانیم»**. پس ابتلا را سبب حصول این علم قرار داد، در حالی که ابتلا سبب حصول علم نیست، بلکه سبب اقامه حجت است تا برای محجوج (کسی که بر او حجت اقامه شده) حجتی برای دفع نباشد.\nاما مماثلت صورت در خلق، برای نیابت و خلافت است، نه برای اخوت. زیرا او از حیث صورت عالم، از عالم است، همانطور که روح از جسد از صورت انسان است. و او از حیث صورت حق، همان چیزی است که احکام اسماء الهی (الأسماء الإلهية) که به عالم تعلق دارند، به واسطه آن در عالم ظاهر می‌شود. پس صورت، اخوت نیست، چنانکه برخی می‌پندارند. و به همین دلیل ما اخوت را ذکر نکردیم مگر در امری خاص که همان مؤمن است.\nمگر اینکه صورت، پشت اخوت ایمان را به واسطه سببیت محکم می‌کند. زیرا اگر اسباب اثری در مسبب نداشتند، خداوند آن‌ها را ایجاد نمی‌کرد. و اگر حکم آن‌ها در مسببات ذاتی نبود، اسباب نمی‌بودند و سبب بودن آن‌ها تصدیق نمی‌شد. و این در مورد کسی دانسته می‌شود که هستی (الوجود) را جز در محلی نمی‌پذیرد، در حالی که محلی وجود ندارد و ایجادکننده می‌خواهد او را ایجاد کند. پس ناگزیر باید محل ایجاد شود تا این مرادِ وجود یافته، وجود یابد. پس وجود محل، سببی در وجود این مراد می‌شود که اراده به او و ایجادش تعلق گرفته است.\nپس دانستی که اسباب احکامی در مسببات دارند، و آن‌ها مانند ابزار برای صنعتگر هستند. پس صنعت و مصنوع به صنعتگر نسبت داده می‌شود، نه به ابزار. و دلیل آن این است که ابزار علمی به آنچه در نفس صنعتگر است که با آن به طور معین بسازد، ندارد، بلکه علم دارد که ابزار است، نه صنع که حقیقتش آن را عطا می‌کند. و صنعتگر کاری جز با آن ندارد. پس صنع ابزار ذاتی است و آنچه از جانب صنعتگر با آن است، ارادی است. و این همان سخن اوست: **«هرگاه اراده کنیم، به او می‌گوییم: باش»** (إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ). و «باش» (کن) ابزاری برای ایجاد است، پس جز با آن ایجاد نکرد. و اینکه آن کلمه ذات اوست یا امری زائد، علم دیگری است. مقصود تنها فهم این معناست و اینکه ایجاد تنها با اراده، بدون قول و بدون مرید و گوینده حاصل نشده است.\nپس حکم اسباب در مسببات ظاهر شد. پس حکم آن‌ها را جز جاهل به وضع آن‌ها و آنچه اعیانشان عطا می‌کند، از بین نمی‌برد. **«آگاه باشید که خلق و امر از آن اوست، پربرکت است خداوند، پروردگار جهانیان»** (أَلا لَهُ الْخَلْقُ والْأَمْرُ تَبارَكَ الله رَبُّ الْعالَمِينَ). و به همین دلیل موسی گفت: **«و او را در کارم شریک گردان»** (وأَشْرِكْهُ في أَمْرِي) و گفت: **«پشتم را به او محکم کن، و او از من زبان‌آورتر است»** (اشْدُدْ به أَزْرِي وهُوَ أَفْصَحُ مِنِّي لِساناً). پس آنچه گفت را دانست و ما نیز از این سخن، آنچه را که او به آن اشاره کرده، دانستیم تا صاحب عین فهم از او بفهمد.\nپس این معنای تعاون (همکاری) است، و آن در سخن اوست: **«از خدا یاری جویید»** (اسْتَعِينُوا بِاللَّهِ) و **«تنها از تو یاری می‌جوییم»** (وإِيَّاكَ نَسْتَعِينُ). و خداوند در یاری بنده است تا زمانی که بنده در یاری برادرش باشد.\nپس اگر مشارکت در مطلوبِ وجود از مستعان‌به (کسی که از او یاری خواسته می‌شود) نبود، مستعین (یاری‌خواه) در یاری خواستن خود صادق نبود. و مستعین ممکن است برای شرافت مستعان‌به از او یاری بخواهد، با وجود بی‌نیازی معین از او، اگرچه ناگزیر از سبب است، یا ممکن است کسی باشد که بدون سبب مستقل است، اما قصد می‌کند که او را سبب قرار دهد تا به واسطه آن بر دیگران شرافت یابد و منزلتش نزد او دانسته شود. زیرا خداوند در عالم، برتری را قرار داده است.\nاما مؤاخات (برادری) میان اسماء الهی (الأسماء الإلهية) جز میان اسمایی که ذاتاً منافاتی با یکدیگر ندارند، واقع نمی‌شود. زیرا خداوند جز میان مؤمنان پیمان اخوت نبست، و میان مؤمن و کافر پیمان اخوت نبست. بلکه برای اخوت نسبی، با فقدان اخوت ایمانی، سهمی در میراث قرار نداد. پس مدعی، جز اخوت ایمان نیست. آیا نمی‌بینی که اگر کسی بمیرد و برادری نسبی داشته باشد که بر دین او نیست، برادر نسبی از او ارث نمی‌برد و برادر دینی او ارث می‌برد؟ و صورت میان ما و حق، نسب و دین است. به همین دلیل، عز و جل زمین را ارث نمی‌برد مگر پس از مرگ انسان کامل (الإنسان الکامل)، تا میراث جز در مستحق آن واقع نشود، همانطور که آسمان را به دلیل حکم ارواح انبیا (علیهم السلام) در آن ارث می‌برد، نه به دلیل اینکه محل فرشتگان است. پس هنگامی که فرشتگان با نفخه (صور) بیهوش شوند، خداوند آسمان را ارث می‌برد. پس اسم وارث، فرشتگان را از آسمان پایین می‌آورد و زمین به غیر زمین و آسمان‌ها تبدیل می‌شود، چنانکه پیش از این در این کتاب ذکر کردیم.\nپس مؤمن برای مؤمن مانند بنایی است که اجزای آن یکدیگر را محکم می‌کنند. پس مؤمن از مؤمن کینه نمی‌ورزد و مؤمن به خاطر ایمانش، مؤمن را نمی‌کشد. و مؤمن، برادر نسبی خود را اگر مؤمن نباشد، می‌کشد.\nاین مقدار در این باب کافی است. پس آنچه را که این باب در بر دارد، از علوم ذکر می‌کنیم:\n\nاز جمله آن علوم، علم صورت ندای حق به بندگانش است که از کجا آن‌ها را ندا می‌دهد؟ آیا از حکم مشیئت خود ندا می‌دهد یا از حیث آنچه آن‌ها بر آن هستند؟ و چه کسی را ندا می‌دهد؟ آیا روی‌گردان را ندا می‌دهد یا روی‌آورنده را یا هر دو را؟\nو در آن، علم آداب الهی و منازل مخلوقات و آنچه شایسته است که هر مخلوقی، بلکه هر موجودی، با آن معامله شود، وجود دارد. و علم مصالح موجودات، پس صاحب این علم تصرف نمی‌کند مگر در آنچه مصلحت برای خود یا برای دیگری است، بر حسب آنچه مطلوب او را به آن می‌گرداند. پس او در تصرفات خود از هوای نفس خارج است و تنها با مصالح همراه است. پس او برای هر چیزی است، نه بر علیه آن.\nو در آن، علم فهم آنچه هر گوینده‌ای می‌آورد، وجود دارد. پس می‌داند که او از کجا سخن گفته است و برای او در آنچه به او نسبت داده می‌شود، نزد کسی که آن خطا در گفتارش را نمی‌شناسد، عذری می‌آورد. و این علمی عزیز است که انصاف در آن از سوی اهلش کم است، چه رسد به کسی که آن را نمی‌شناسد. و اینکه ترک عمل به چنین علمی چه تأثیری از حسرت و ندامت بر صاحبش به دلیل عدم استفاده از آن می‌گذارد.\nو در آن، علم حکمت در تغافل و فراموشی است، که همان حلم و مهلت دادن الهی یا از سوی صاحب قدرت است تا کسی که از او غفلت شده، از آنچه بر آن است و شایسته نبود که به آن ظاهر شود یا بر او باشد، بازگردد.\nو در آن، علم اینکه اشیاء در دست خداست و هیچ چیز از آن‌ها در دست مخلوقات نیست، وجود دارد. و اگرچه صورت‌ها در دست آن‌ها ظاهر می‌شوند، اما به حکم عاریه است، نه به حکم مالکیت.\nو در آن، علم منت‌های الهی که در ظاهر و باطن بر بندگان گسترده است و تعیین آنچه ممکن است از آن‌ها تعیین شود، وجود دارد.\nو علم برزخ نزاع‌کنندگان تا کسی که می‌خواهد نزاع میان آن‌ها را برطرف کند، در آن بایستد.\nو در آن، علم اسماء و شرافت آن‌ها و فرق میان آن‌ها و آنچه بر اعلام آن‌ها افزوده شده و برای مدح یا ذم وضع شده است، وجود دارد.\nو در آن، علم عدول از راهی که میان بنده و حصول علم حائل می‌شود، وجود دارد؛ زیرا علم بالاترین چیزی است که طلب می‌شود و بهترین چیزی است که کسب می‌شود و بزرگترین چیزی است که به آن افتخار می‌شود و محکم‌ترین ابزاری است که آماده و ذخیره می‌شود. و خداوند خود را به واسطه آن ستوده که حجت بالغه از آن اوست، و آن جز علم نیست.\nو در آن، علم مراتب خلق انسانی در آفرینش است، زیرا آن‌ها در آن بر طبقاتی هستند. و اینکه انسانی که انسان او را خلق کرده، چه نامیده می‌شود؟ آیا انسان است یا حیوانی در صورت انسان، از حیث نشأت گرفتن جسدش؟ و امری که در ظهور نفس ناطقه در این مخلوق از آن عاجز شده، چیست؟ آیا به دلیل عدم استعداد است؟ پس برای ایجادکننده این صورت، آنچه را که قبول نفس ناطقه از نفس کل به واسطه آن واقع می‌شود، حکم می‌کند؟ یا تعجیز ارادی الهی است، زیرا امری عظیم است؟\nو ذکر شده که چنین چیزی واقع شده است. و در *فلاحت نبطیه* ذکر شده که برخی از علمای علم طبیعت، از منی انسان با تعفنی خاص و بر وزن مخصوصی از زمان و مکان، انسانی را به صورت ایجاد کردند که یک سال ماند، چشمانش را باز و بسته می‌کرد و سخن نمی‌گفت و بر آنچه به او تغذیه می‌شد، چیزی نمی‌افزود. پس یک سال زندگی کرد و مرد. پس دانسته نمی‌شود که آیا او انسانی بود که حکمش حکم لال بود یا حیوانی در صورت انسان.\nو در آن، علم انساب و احساب وجود دارد.\nو در آن، علم آنچه خداوند از مکلف در قبول آنچه پس از تکلیف از او سر می‌زند، در نظر می‌گیرد، وجود دارد؛ آیا ظاهر او را در نظر می‌گیرد یا باطن او را یا مجموع را؟ اما پیش از تکلیف، مقید نمی‌شود، بلکه بر اساس طبع خود جاری می‌شود و اصلاً مؤاخذه‌ای ندارد. و این همان سخن خداوند متعال است: **«و ما عذاب‌کننده نبودیم تا رسولی بفرستیم»** (وما كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا). و اگر چنین است، پس درد از کجا برای کودک واقع شد تا از آنچه می‌یابد، گریه کند؟\nو در آن، علم چگونگی بازگرداندن جاهل به علم وجود دارد.\nو در آن، علم صورت بازگرداندن امور به خداوند سبحان و متعال در قدس او وجود دارد؛ که به چه طریقی است؟ آیا به حکم اینکه او ایجادکننده آن‌هاست یا اینکه او غایت آن‌هاست یا چیز دیگری؟ و **«خداوند حق را می‌گوید و او راه را هدایت می‌کند»** (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 5
}