{
  "id": 437,
  "title": {
    "ar": "الباب السابع والثلاثون وأربعمائة في معرفة منازلة من عرف حظه من شريعتي عرف حظه مني فإنك عندي كما أنا عندك مرتبة واحدة",
    "en": "Chapter Four Hundred and Thirty-Seven: Concerning the knowledge of the station of him who knows his portion of My Divine Law, [and thereby] knows his portion of Me, for you are with Me as I am with you, [which constitutes] a single level (مرتبة واحدة).",
    "ur": "باب چار سو سینتیس (۴۳۷)\n\nاس شخص کے مقام (منزلة) کی معرفت (المعرفۃ) کے بیان میں جس نے میری شریعت میں اپنا حصہ جانا، اس نے مجھ سے اپنا حصہ جانا۔ کیونکہ تو میرے نزدیک ویسا ہی ہے جیسا میں تیرے نزدیک ہوں، (یہ) ایک ہی مرتبہ (مرتبة واحدة) ہے۔",
    "fa": "باب چهارصد و سی و هفتم در معرفت منزلتی که هر کس بهره خود را از شریعت من بشناسد، بهره خود را از من شناخته است، زیرا تو نزد من همان‌گونه هستی که من نزد تو هستم، یک مرتبه واحد."
  },
  "content": {
    "ar": "## «الباب السابع والثلاثون وأربعمائة في معرفة منازلة من عرف حظه من شريعتي عرف حظه مني فإنك عندي كما أنا عندك مرتبة واحدة»\n\n\n> من كان لي كنت له *** كمثل ما هو لا أزيد\n\n\n> فالشرع غيب ظاهر *** له مقامات العبيد\n\n\n> يستخدم الكون كما *** يخدمه بلا مزيد\n\n\n> فمن يفي بعهده *** فهو وفى بالعهود\n\n\n> له النزول نحونا *** كما لنا عين الصعود\n\n\n> إليه في أعمالنا *** وهو الحفيظ والشهيد\n\n\n> فحصنا بلذة الكشف *** ولذات الشهود\n\n\n### [إن الله غيور]\n\n\nقال الله تعالى فَاذْكُرُونِي أَذْكُرْكُمْ رأيت سائلا يسأل شخصا بوجه الله أو بحرمة الله عندك أعطني شيئا ومعي عبد صالح يقال له مدور من أهل أسبجة ففتح الرجل صرة فيها قطع فضة صغار وكبار فأخذ يطلب على أصغر ما فيها من القطع فقال لي العبد الصالح أ تدري على ما يطلب قلت له قل قال على قيمته عند الله وقدره فكلما أخرج قطعة كبيرة يقول بلسان الحال ما تساوي مثل هذه عند الله فأخرج أصغر ما وجد فأعطاه إياها إلا أن الله وصف نفسه بالغيرة وعلم من أكثر عباده أنهم يهبون جزيل المال وأنفسه في هوى نفوسهم وأغراضهم فإذا أعطى أكثرهم لله أعطى كسرة باردة وفلسا وثوبا خلقا وأمثال هذا هذا هو الكثير والأغلب فإذا كان يوم القيامة وأحضر الله ما أعطى العبد من أجله بينه وبين عبده حيث لا يراه أحد فأحضر ما أعطى لغير الله فيقول له يا عبدي أ ليست هذه نعمتي التي أنعمت بها عليك أين ما أعطيت لمن سألك بوجهي فيعين ذلك الشي‏ء التافه الحقير ويقول له فأين ما أعطيت لهوى نفسك فيعين جزيل المال من ماله فيقول أ ما استحييت مني أن تقابلني بمثل هذا وأنت تعلم أنك ستقف بين يدي وسأقررك على ما كان منك فما أعظمها من خجلة ثم يقول له قد غفرت لك بدعوة ذلك السائل لفرحه بما أعطيته لكني قدر بيتها لك وقد محقت ما أعطيته لهوى نفسك فإن صدقتك أخذتها وربيتها لك فيحضرها أمام الأشهاد وقد رجع الفلس أعظم من جبل أحد وما أعطى لغير الله قد عاد هَباءً مَنْثُوراً قال الله تعالى يَمْحَقُ الله الرِّبا ويُرْبِي الصَّدَقاتِ فالعارفون بالله صغيرهم كبير وكبيرهم لا أعظم منه فإنهم لا يعطون لله إلا أنفس ما عندهم وأحقر ما عندهم فكلهم لله وكل ما عندهم لله العبد وما يملكه لسيده فيعطون بيد الله ويشاهدون يد الله هي الآخذة وهم مبرءون في العطاء والأخذ مع غاية الاستقامة والمشي على سنن الهدى والأدب المشروع فيكونون عند الحق بمنزلة ما هو الحق في قلوبهم يعظمون شعائر الله وحرمات الله فيعظمهم الله يَوْمَ يَقُومُ الْأَشْهادُ بمرأى منهم ويقيم الآخرين على مراتبهم ف ذلِكَ يَوْمُ التَّغابُنِ فيقول فاعل الشر يا ليتني فعلت خيرا ويقول فاعل الخير ليتني زدت والعارف لا يقول شيئا فإنه ما تغير عليه حال كما كان في الدنيا كذلك هو في الآخرة أعني من شهوده ربه وتبريه من الملك والتصرف فيه فلم يقم له عمل مضاف إليه يتحسر على ترك الزيادة منه وبذل الوسع فيه وما كان منهم من زلل مقدر وقع منهم بحكم التقدير فإن الله يتوب عليهم فيه بتبديله على قدر الزلة سواء لا يزيد ولا ينقص فإن العارف في كل نفس تائب إلى الله في جميع أفعاله الصادرة منه توبة شرعية وتوبة حقيقية فالتوبة المشروعة هي التوبة من المخالفات والتوبة الحقيقية هي التبري من الحول والقوة بحول الله وقوته فلم يزل العارف واقفا بين التوبتين في الحياة الدنيا في دار التكليف فإن كان له اطلاع إلهي على أنه قد قيل له افعل ما شئت فقد غفرت لك فإن ذلك لا يخرجه عن تبريه ولم تبق له بعد هذا التعريف توبة مشروعة لأنه بين مباح وندب وفرض لا حظ له في مكروه ولا محظور لأن الشرع قد أزال عنه هذا الحكم في الدار الدنيا ورد ذلك في الخبر الصحيح عن الله في العموم وفي أهل بدر في الخصوص لكنه في أهل بدر على الترجي وفي وقوعه في العموم واقع بلا شك فمن أطلعه الله عليه من نفسه بأنه من تلك الطائفة فذلك بشرى من الله في الحياة الدنيا قال الله تعالى الَّذِينَ آمَنُوا وكانُوا يَتَّقُونَ لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ لا تَبْدِيلَ لِكَلِماتِ الله هذا حال‏\nالمؤمن المتقي فكيف بحال العارف النقي الذي ما لبس ثوب زور وما زال نورا في نور فمن حافظ على آداب الشريعة وأعطى الطبيعة ما أوجب الله عليه من حقها وما تعدى بها منزلتها كان من العارفين الأدباء وأصحاب السر الأمناء والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Thirty-Seven: Concerning the knowledge of the station of him who knows his portion of My Law (شريعتي) knows his portion of Me, for you are with Me in the same single degree (مرتبة واحدة) as I am with you.\n\nWhoever is for Me, I am for him,\nJust as he is, I do not increase.\n\nSo the Law (الشرع) is a manifest Unseen (غيب ظاهر),\nFor it are the stations (مقامات) of the servants.\n\nHe uses the cosmos (الكون) just as\nIt serves him, without addition.\n\nSo whoever fulfills his covenant (عهده),\nHe has fulfilled the covenants.\n\nFor him is the descent toward us,\nJust as for us is the very ascent (عين الصعود)\n\nTo Him in our deeds,\nAnd He is the Preserver (الحفيظ) and the Witness (الشهيد).\n\nSo we attained the pleasure of Unveiling (الكشف),\nAnd the delights of Witnessing (الشهود).\n\n[Indeed, Allah is Jealous (إن الله غيور)]\n\nAllah the Exalted said: <<فَاذْكُرُونِي أَذْكُرْكُمْ>> (So remember Me; I will remember you). I saw a beggar asking a person, \"For the sake of Allah's Face (بوجه الله) or by the sanctity of Allah (بحرمة الله) upon you, give me something.\" With me was a righteous servant called Mudawwar, from the people of Usbaja. The man opened a purse containing small and large silver pieces. The beggar began asking for the smallest piece within it. The righteous servant said to me, \"Do you know why he asks for that?\" I said to him, \"Tell me.\" He said, \"He asks for it based on its value and worth with Allah.\" Every time the man brought out a large piece, the beggar would say, by the tongue of his state (بلسان الحال), 'This is not worth as much as that small piece with Allah.' So the man brought out the smallest piece he could find and gave it to him.\n\nHowever, Allah described Himself with Jealousy (الغيرة). He knows that most of His servants bestow great and precious wealth for the sake of their own desires (هوى نفوسهم) and aims. But when most of them give for Allah, they give a cold crust, a worthless coin (فلسا), a worn-out garment, and things like this. This is the common and prevalent practice.\n\nWhen the Day of Resurrection comes, Allah will present what the servant gave for His sake between Him and His servant, where no one else sees it. Then He will present what the servant gave for the sake of others. He will say to him, \"O My servant, is this not My blessing which I bestowed upon you? Where is what you gave to him who asked you by My Face?\" The servant will point to that insignificant, contemptible thing. Then He will say to him, \"And where is what you gave for the sake of your own desire?\" The servant will point to the great wealth from his possessions. Allah will say, \"Did you not feel shame before Me, that you should meet Me with such a thing, knowing that you would stand before Me and I would question you about what you did?\" How great is that shame!\n\nThen He will say to him, \"I have forgiven you because of the prayer of that beggar, due to his joy in what you gave him. But I have nurtured it for you, and I have obliterated what you gave for the sake of your own desire. If I give you your charity (صدقتك), I have taken it and nurtured it for you.\" He will then present it before the witnesses (الأشهاد). The worthless coin will have returned, greater than Mount Uhud, while what was given for the sake of others has returned as <<هَبَاءً مَنْثُوراً>> (scattered dust). Allah the Exalted said: <<يَمْحَقُ الله الرِّبا ويُرْبِي الصَّدَقاتِ>> (Allah destroys usury and increases the charitable deeds).\n\nThe Gnostics (العارفون بالله) are such that their small deeds are great, and their great deeds have nothing greater than them. This is because they do not give for Allah except the most precious things they possess, and the most contemptible things they possess—for all of it is for Allah, and everything they possess is for Allah. The servant and what he owns belong to his Master. They give with the Hand of Allah and witness that the Hand of Allah is the Taker. They are absolved in both giving and taking, along with the utmost rectitude and walking upon the path of guidance (سنن الهدى) and the prescribed etiquette (الأدب المشروع).\n\nThus, they are with the Real (الحق) in the same station that the Real is in their hearts. They magnify the rituals of Allah (شعائر الله) and the sacred things of Allah (حرمات الله), so Allah magnifies them <<يَوْمَ يَقُومُ الْأَشْهادُ>> (on the Day when the witnesses will stand forth) in their sight. He establishes others according to their degrees (مراتبهم). That is <<ذلِكَ يَوْمُ التَّغابُنِ>> (the Day of Mutual Loss). The doer of evil will say, \"I wish I had done good,\" and the doer of good will say, \"I wish I had increased.\"\n\nBut the Gnostic (العارف) says nothing, for his state has not changed. As he was in the world, so he is in the Hereafter—meaning, in his witnessing (شهوده) his Lord and his disavowal (تبريه) of ownership and disposal therein. No deed attributed to him remains for which he might regret having failed to increase or exert his utmost effort.\n\nAny slip (زلل) that occurred from them, being decreed by the judgment of destiny, Allah turns to them in repentance (يتوب عليهم) by exchanging it exactly according to the measure of the slip, neither increasing nor decreasing. For the Gnostic is, in every breath, repentant (تائب) to Allah concerning all his actions that proceed from him, with a legal repentance (توبة شرعية) and a real repentance (توبة حقيقية). The prescribed repentance is repentance from transgressions. The real repentance is the disavowal of power and strength (الحول والقوة) by the power and strength of Allah.\n\nThe Gnostic remains standing between the two repentances in the life of this world, the abode of obligation (دار التكليف). If he has a divine disclosure (اطلاع إلهي) that it has been said to him, \"Do what you wish, for I have forgiven you,\" this does not remove him from his disavowal. After this recognition, no prescribed repentance remains for him, because he is only between the permissible, the recommended, and the obligatory. He has no portion in the disliked or the forbidden, because the Law (الشرع) has removed this ruling from him in the worldly abode.\n\nThis is mentioned in the sound report from Allah concerning the generality, and specifically concerning the people of Badr. However, regarding the people of Badr, it is based on hope, while its occurrence in the generality is certain without doubt. Whoever Allah informs of this concerning himself, that he is from that group, that is good tidings (بشرى) from Allah in the life of this world. Allah the Exalted said: <<الَّذِينَ آمَنُوا وكانُوا يَتَّقُونَ لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ لا تَبْدِيلَ لِكَلِماتِ الله>> (Those who believed and were constantly conscious of Allah—for them are good tidings in the life of this world and in the Hereafter. There is no change in the words of Allah).\n\nThis is the state of the believing, God-conscious person. What then is the state of the pure Gnostic (العارف النقي) who has never worn the garment of falsehood and has remained Light upon Light (نورا في نور)?\n\nWhoever maintains the etiquette of the Law (آداب الشريعة) and gives to nature what Allah has obligated as its right, and does not exceed its station, is among the Gnostics of high etiquette (العارفين الأدباء) and the trustworthy keepers of the Secret (أصحاب السر الأمناء). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو سینتیس: اس شخص کے مقام کی معرفت میں جس نے شریعت میں اپنا حصہ پہچانا تو اس نے مجھ میں اپنا حصہ پہچانا، کیونکہ تم میرے نزدیک اسی مرتبے پر ہو جس پر میں تمہارے نزدیک ہوں۔\n\nجو میرے لیے ہوا، میں اس کے لیے ہوا\nبالکل اسی طرح جیسے وہ ہے، میں زیادہ نہیں کرتا۔\n\nپس شریعت ایک ظاہر غیب ہے\nاس کے لیے بندوں کے مقامات ہیں۔\n\nوہ کائنات کو اسی طرح استعمال کرتا ہے\nجیسے کائنات اس کی خدمت کرتی ہے، بغیر کسی زیادتی کے۔\n\nپس جو اپنے عہد کو پورا کرتا ہے\nوہی درحقیقت تمام عہدوں کو پورا کرنے والا ہے۔\n\nاس کے لیے ہماری طرف نزول ہے\nجیسا کہ ہمارے لیے عین صعود (بلندی) ہے۔\n\nاپنے اعمال میں اس کی طرف (رجوع کرتے ہیں)\nاور وہی الحفیظ (نگہبان) اور الشہید (گواہ) ہے۔\n\nپس ہم کشف (الکشف) کی لذت\nاور شہود (الشہود) کی لذتوں سے مخصوص کیے گئے۔\n\n### [اللہ تعالیٰ غیرت مند ہے]\n\nاللہ تعالیٰ نے فرمایا: \"تم مجھے یاد کرو، میں تمہیں یاد کروں گا\" (فَاذْكُرُونِي أَذْكُرْكُمْ)۔\n\nمیں نے ایک سائل کو دیکھا جو کسی شخص سے اللہ کے واسطے یا اللہ کی حرمت کا واسطہ دے کر کچھ مانگ رہا تھا کہ مجھے کچھ دے دو۔ میرے ساتھ ایک نیک بندہ تھا جسے مدور کہا جاتا تھا اور وہ اسبجہ کے رہنے والوں میں سے تھا۔ اس شخص نے ایک تھیلی کھولی جس میں چاندی کے چھوٹے اور بڑے ٹکڑے تھے۔ وہ ان میں سے سب سے چھوٹے ٹکڑے کا مطالبہ کرنے لگا۔ اس نیک بندے نے مجھ سے کہا: کیا تم جانتے ہو کہ وہ کس چیز کا مطالبہ کر رہا ہے؟ میں نے کہا: بتاؤ۔ اس نے کہا: وہ اللہ کے نزدیک اس کی قیمت اور قدر کا مطالبہ کر رہا ہے۔ جب بھی وہ کوئی بڑا ٹکڑا نکالتا تو زبانِ حال سے کہتا کہ اللہ کے نزدیک اس کی اتنی قیمت نہیں ہے۔ چنانچہ اس نے سب سے چھوٹا ٹکڑا نکالا اور اسے دے دیا۔\n\nمگر اللہ نے خود کو غیرت (الغیرۃ) سے متصف کیا ہے اور وہ جانتا ہے کہ اس کے اکثر بندے اپنی نفسانی خواہشات اور اغراض کی خاطر بڑا اور قیمتی مال دیتے ہیں۔ جب ان میں سے اکثر لوگ اللہ کے لیے دیتے ہیں تو ایک ٹھنڈا ٹکڑا، ایک پیسہ، یا ایک بوسیدہ کپڑا اور اس جیسی چیزیں دیتے ہیں۔ یہ عام اور غالب رجحان ہے۔\n\nجب قیامت کا دن ہوگا اور اللہ تعالیٰ وہ چیزیں حاضر کرے گا جو بندے نے اس کی خاطر دی تھیں، بندے اور اس کے درمیان جہاں کوئی دوسرا نہیں دیکھ رہا ہوگا، اور وہ چیزیں بھی حاضر کرے گا جو غیر اللہ کے لیے دی گئی تھیں۔ اللہ تعالیٰ اس سے فرمائے گا: \"اے میرے بندے! کیا یہ میری وہ نعمت نہیں تھی جو میں نے تجھ پر انعام کی تھی؟ تو نے اسے کیا دیا جس نے تجھ سے میرے چہرے کے واسطے سے سوال کیا تھا؟\" پس وہ اس حقیر اور معمولی چیز کی نشاندہی کرے گا۔ پھر اللہ فرمائے گا: \"تو نے اپنی نفسانی خواہش کے لیے کیا دیا تھا؟\" پس وہ اپنے مال میں سے قیمتی اور بڑا مال دکھائے گا۔ اللہ فرمائے گا: \"کیا تجھے مجھ سے شرم نہ آئی کہ تو میرے سامنے ایسی چیز پیش کر رہا ہے، حالانکہ تو جانتا تھا کہ تو میرے سامنے کھڑا ہوگا اور میں تجھ سے تیرے اعمال کے بارے میں پوچھوں گا؟\" یہ کتنی بڑی شرمندگی ہوگی!\n\nپھر اللہ تعالیٰ فرمائے گا: \"میں نے تجھے اس سائل کی دعا کی وجہ سے معاف کر دیا، کیونکہ وہ اس چیز سے خوش ہوا جو تو نے اسے دی تھی، لیکن میں نے اسے تیرے لیے پال پوس کر بڑا کیا ہے۔ اور جو کچھ تو نے اپنی نفسانی خواہش کے لیے دیا تھا، میں نے اسے مٹا دیا ہے۔ اگر تو نے سچ کہا تھا تو میں نے اسے لے لیا اور تیرے لیے اس کی پرورش کی ہے۔\" پھر اللہ اسے گواہوں کے سامنے حاضر کرے گا، اور وہ پیسہ (فلس) کوہ احد سے بھی بڑا ہو چکا ہوگا، اور جو کچھ غیر اللہ کے لیے دیا گیا تھا وہ بکھری ہوئی خاک (هَبَاءً مَنْثُوراً) بن چکا ہوگا۔\n\nاللہ تعالیٰ نے فرمایا: \"اللہ سود کو مٹاتا ہے اور صدقات کو بڑھاتا ہے\" (يَمْحَقُ الله الرِّبا ويُرْبِي الصَّدَقاتِ)۔\n\nپس اللہ کے عارفین (العارفون باللہ) کے نزدیک ان کی چھوٹی چیز بھی بڑی ہوتی ہے اور ان کی بڑی چیز سے کوئی چیز عظیم تر نہیں ہوتی۔ کیونکہ وہ اللہ کے لیے صرف اپنی سب سے قیمتی چیزیں اور اپنی سب سے حقیر چیزیں ہی دیتے ہیں۔ پس وہ سب اللہ کے لیے ہیں اور جو کچھ ان کے پاس ہے وہ سب اللہ کے لیے ہے۔ بندہ اور جو کچھ وہ ملکیت رکھتا ہے، سب اپنے آقا کا ہے۔ پس وہ اللہ کے ہاتھ سے دیتے ہیں اور اللہ کے ہاتھ کو ہی لینے والا دیکھتے ہیں، اور وہ دینے اور لینے میں بری الذمہ ہوتے ہیں، اس کے باوجود کہ وہ انتہائی استقامت اور ہدایت کے طریقوں اور مشروع ادب پر چلتے ہیں۔\n\nپس وہ ذات حق (الحق) کے نزدیک اسی مرتبے پر ہوتے ہیں جس مرتبے پر ذات حق ان کے دلوں میں ہے۔ وہ اللہ کی نشانیوں (شعائر اللہ) اور اللہ کی حرمتوں کا احترام کرتے ہیں، پس اللہ بھی ان کی تعظیم کرتا ہے \"جس دن گواہ کھڑے ہوں گے\" (يَوْمَ يَقُومُ الْأَشْهادُ)، ان کے سامنے، اور دوسروں کو ان کے مراتب پر کھڑا کرے گا۔ پس \"یہ ہار جیت کا دن ہے\" (ذلِكَ يَوْمُ التَّغابُنِ)۔ برائی کرنے والا کہے گا: کاش میں نے نیکی کی ہوتی۔ اور نیکی کرنے والا کہے گا: کاش میں نے اور زیادہ کیا ہوتا۔ لیکن عارف (العارف) کچھ نہیں کہتا، کیونکہ اس پر کوئی حال تبدیل نہیں ہوا ہوتا۔ جیسا وہ دنیا میں تھا، ویسا ہی آخرت میں ہے۔ میرا مطلب ہے اپنے رب کے شہود (الشہود) سے اور ملکیت اور اس میں تصرف سے اپنی براءت سے۔ اس کا کوئی عمل ایسا نہیں ہوتا جو اس کی طرف منسوب ہو جس پر وہ حسرت کرے کہ اس نے اس میں اضافہ کیوں نہ کیا یا اپنی پوری کوشش کیوں نہ کی۔ اور ان سے جو بھی مقدر شدہ لغزش (زلل) سرزد ہوتی ہے، وہ تقدیر کے حکم سے واقع ہوتی ہے، تو اللہ اس پر ان کی توبہ قبول کرتا ہے، اسے لغزش کے برابر بدل دیتا ہے، نہ کم نہ زیادہ۔\n\nکیونکہ عارف ہر سانس میں اللہ کی طرف توبہ کرنے والا ہوتا ہے، اپنے تمام صادر ہونے والے افعال میں شرعی توبہ اور حقیقی توبہ کرتا ہے۔ پس مشروع توبہ (التوبة المشروعة) مخالفتوں سے توبہ کرنا ہے، اور حقیقی توبہ (التوبة الحقيقية) اللہ کی قوت اور طاقت کے ذریعے اپنی قوت اور طاقت سے براءت کا اظہار کرنا ہے۔ پس عارف دنیا کی زندگی میں، جو کہ دارِ تکلیف ہے، ہمیشہ ان دو توباؤں کے درمیان کھڑا رہتا ہے۔ اگر اسے کوئی الٰہی اطلاع مل جائے کہ اسے کہا گیا ہے: \"جو چاہو کرو، میں نے تمہیں بخش دیا ہے،\" تو یہ بات اسے اپنی براءت سے خارج نہیں کرتی۔ اور اس تعریف کے بعد اس کے لیے کوئی مشروع توبہ باقی نہیں رہتی، کیونکہ وہ مباح، مستحب اور فرض کے درمیان ہوتا ہے، مکروہ یا ممنوع میں اس کا کوئی حصہ نہیں ہوتا۔ کیونکہ شریعت نے دنیا کے گھر میں اس حکم کو اس سے ہٹا دیا ہے۔ یہ بات صحیح حدیث میں اللہ کی طرف سے عمومی طور پر اور اہل بدر کے بارے میں خصوصی طور پر وارد ہوئی ہے۔ لیکن اہل بدر کے بارے میں یہ امید پر مبنی ہے، جبکہ عمومی طور پر اس کا وقوع بلا شک و شبہ ہے۔ پس جسے اللہ نے خود سے یہ اطلاع دی ہو کہ وہ اس گروہ میں سے ہے، تو یہ دنیا کی زندگی میں اللہ کی طرف سے بشارت ہے۔\n\nاللہ تعالیٰ نے فرمایا: \"وہ لوگ جو ایمان لائے اور پرہیزگار تھے، ان کے لیے دنیا کی زندگی میں اور آخرت میں بشارت ہے، اللہ کی باتوں میں کوئی تبدیلی نہیں\" (الَّذِينَ آمَنُوا وكانُوا يَتَّقُونَ لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ لا تَبْدِيلَ لِكَلِماتِ الله)۔ یہ حال تو متقی مومن کا ہے، تو اس پاکیزہ عارف کا کیا حال ہوگا جس نے کبھی جھوٹ کا لباس نہیں پہنا اور ہمیشہ نور میں نور رہا؟\n\nپس جس نے شریعت کے آداب کی حفاظت کی اور طبیعت کو اس کا حق دیا جو اللہ نے اس پر واجب کیا تھا، اور اس کے مرتبے سے تجاوز نہیں کیا، وہ باادب عارفین (العارفين الأدباء) اور امانت دار راز والوں (أصحاب السر الأمناء) میں سے ہوگا۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و سی و هفتم در معرفت منزلت کسی که بهره خود را از شریعت من شناخت، بهره خود را از من شناخته است؛ زیرا تو نزد من همان‌گونه هستی که من نزد تو هستم، یک مرتبه واحد.\n\nهر که از آنِ من باشد، من از آنِ اویم\nهمانند آنچه او هست، و من چیزی نمی‌افزایم.\n\nپس شریعت، غیبی آشکار است\nکه برای آن مقامات بندگان وجود دارد.\n\nجهان را به کار می‌گیرد، همان‌گونه که\nجهان او را خدمت می‌کند، بدون هیچ افزایشی.\n\nپس هر که به عهد خود وفا کند\nاو به پیمان‌ها وفا کرده است.\n\nبرای او نزول به سوی ماست\nهمان‌گونه که برای ما عین صعود است.\n\nبه سوی او در اعمال ما\nو اوست نگهبان و گواه (الشهید).\n\nپس ما را با لذت کشف (الکشف)\nو لذت‌های شهود (الشهود) دربرگرفت.\n\n### [همانا خداوند غیور است]\n\nخداوند متعال فرمود: «مرا یاد کنید تا شما را یاد کنم» (فَاذْكُرُونِي أَذْكُرْكُمْ). دیدم سائلی از شخصی درخواست می‌کرد که «به وجه خدا یا به حرمت خدا نزد تو، چیزی به من بده.» و با من بنده‌ای صالح بود که به او مُدوَّر می‌گفتند و از اهالی اَسبَجه بود. آن مرد کیسه‌ای را گشود که در آن قطعات نقره کوچک و بزرگ بود. سائل شروع کرد به درخواست کوچک‌ترین قطعه‌ای که در آن بود. آن بنده صالح به من گفت: «آیا می‌دانی او چه چیزی را طلب می‌کند؟» گفتم: «بگو.» گفت: «بر اساس ارزش و قدر آن نزد خداوند.» هرگاه قطعه بزرگی بیرون می‌آورد، سائل به زبان حال می‌گفت: «این نزد خدا ارزشی ندارد.» پس کوچک‌ترین چیزی را که یافت، بیرون آورد و به او داد.\n\nجز این نیست که خداوند خود را به غیرت (الغيرة) وصف کرده است و می‌داند که بیشتر بندگانش مال فراوان و نفیس‌ترین دارایی‌هایشان را در هوای نفس و اغراض خود می‌بخشند. اما وقتی بیشترشان برای خدا چیزی می‌دهند، یک تکه نان سرد، یک پول خُرد (فلس) و یک لباس کهنه و امثال این‌ها را می‌دهند. این است که زیاد و غالب است.\n\nپس چون روز قیامت شود و خداوند آنچه را بنده به خاطر او داده است، میان خود و بنده‌اش حاضر کند، آنجا که هیچ‌کس او را نمی‌بیند، و نیز آنچه را برای غیر خدا داده است، حاضر سازد. به او می‌گوید: «ای بنده من، آیا این نعمت من نبود که بر تو ارزانی داشتم؟ آنچه را به کسی که به وجه من از تو درخواست کرد، دادی کجاست؟» پس آن شیء بی‌ارزش و حقیر را مشخص می‌کند. و به او می‌گوید: «پس آنچه را به هوای نفس خود دادی کجاست؟» پس مال فراوان از دارایی‌اش را مشخص می‌کند. آنگاه می‌گوید: «آیا از من شرم نکردی که با چنین چیزی با من روبرو شوی، در حالی که می‌دانستی در برابر من خواهی ایستاد و تو را بر آنچه انجام دادی بازخواست خواهم کرد؟» چه شرمساری بزرگی!\n\nسپس به او می‌گوید: «تو را به خاطر دعای آن سائل بخشیدم، به سبب شادی او از آنچه به او دادی. اما من آن را برای تو در خانه (آخرت) پروراندم و آنچه را به هوای نفس خود دادی، محو کردم. اگر صدقه تو را پذیرفتم، آن را گرفتم و برای تو پروراندم.» پس آن را در برابر گواهان (الأشهاد) حاضر می‌کند، در حالی که آن پول خُرد (فلس) بزرگ‌تر از کوه اُحد بازگشته است، و آنچه برای غیر خدا داده شده بود، به صورت «غبار پراکنده» (هَباءً مَنْثُوراً) درآمده است.\n\nخداوند متعال فرمود: «خداوند ربا را نابود می‌کند و صدقات را افزایش می‌دهد» (يَمْحَقُ الله الرِّبا ويُرْبِي الصَّدَقاتِ). پس عارفان بالله (العارفون بالله)، کوچکشان بزرگ است و بزرگشان چیزی بزرگ‌تر از آن نیست؛ زیرا آنان برای خدا نمی‌دهند مگر نفیس‌ترین چیزی که دارند و حقیرترین چیزی که دارند. پس همه آن‌ها برای خداست و هر آنچه دارند برای خداست. بنده و آنچه مالک است، از آنِ مولای اوست.\n\nپس با دست خدا می‌بخشند و شهود (الشهود) می‌کنند که دست خداست که می‌گیرد، و آنان در بخشش و گرفتن مبرا هستند، همراه با نهایت استقامت و حرکت بر روش‌های هدایت و ادب مشروع.\n\nپس نزد حق (الحق) به منزلتی هستند که حق (الحق) در قلب‌هایشان دارد. شعائر خدا و حرمت‌های خدا را بزرگ می‌شمارند، پس خداوند نیز آنان را بزرگ می‌شمارد «روزی که گواهان (الأشهاد) به پا می‌خیزند» (يَوْمَ يَقُومُ الْأَشْهادُ)، در منظر آنان، و دیگران را بر مراتبشان اقامه می‌کند.\n\nپس «آن روز، روز مغبون شدن است» (ذلِكَ يَوْمُ التَّغابُنِ). پس بدکار می‌گوید: «ای کاش کار نیکی انجام داده بودم» و نیکوکار می‌گوید: «ای کاش بیشتر انجام داده بودم.» اما عارف (العارف) چیزی نمی‌گوید، زیرا حال او تغییری نکرده است؛ همان‌گونه که در دنیا بود، در آخرت نیز همان‌گونه است؛ منظورم از جهت شهود (الشهود) پروردگارش و مبرا بودن او از مالکیت و تصرف در آن است.\n\nپس عملی که به او نسبت داده شود و بر ترک افزایش آن و بذل توان در آن حسرت بخورد، برای او برپا نمی‌شود. و هر لغزش مقدری که به حکم تقدیر از آنان سر زده باشد، خداوند در آن توبه (التوبة) آنان را می‌پذیرد، با تبدیل آن به اندازه همان لغزش، نه کم و نه زیاد. زیرا عارف (العارف) در هر نَفَس، در تمام افعال صادر شده از او، به سوی خدا توبه (التوبة) می‌کند؛ توبه‌ای شرعی و توبه‌ای حقیقی. توبه مشروع، توبه از مخالفت‌هاست، و توبه حقیقی، مبرا شدن از حول و قوه (قدرت و توان) به حول و قوه خداوند است.\n\nپس عارف (العارف) پیوسته در زندگی دنیا، در دار تکلیف، میان این دو توبه ایستاده است. اگر او را آگاهی الهی حاصل شود که به او گفته شده است: «هر چه می‌خواهی انجام بده، که تو را بخشیدم»، این امر او را از مبرا بودن (تبرّی) خارج نمی‌سازد، و پس از این تعریف، دیگر توبه مشروعی برای او باقی نمی‌ماند؛ زیرا او میان مباح، مستحب و فرض قرار دارد و بهره‌ای در مکروه و محظور (حرام) ندارد، چرا که شریعت این حکم را در سرای دنیا از او برداشته است.\n\nاین مطلب در خبر صحیح از جانب خداوند به صورت عمومی و در مورد اهل بدر به صورت خاص وارد شده است؛ اما در مورد اهل بدر بر اساس امیدواری است و در وقوع عمومی آن شکی نیست. پس هر کس که خداوند او را از درون خود آگاه سازد که از آن طایفه است، این بشارتی از جانب خدا در زندگی دنیاست.\n\nخداوند متعال فرمود: «کسانی که ایمان آوردند و پرهیزگاری می‌کردند، برای آنان در زندگی دنیا و در آخرت بشارت است. سخنان خدا را تبدیلی نیست» (الَّذِينَ آمَنُوا وكانُوا يَتَّقُونَ لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ لا تَبْدِيلَ لِكَلِماتِ الله). این حال مؤمن پرهیزکار است، پس حال عارف (العارف) پاکی که جامه دروغ نپوشیده و پیوسته نوری در نور بوده است، چگونه خواهد بود؟ پس هر کس آداب شریعت را حفظ کند و حق طبیعت را که خداوند بر او واجب کرده است، به آن بدهد و از منزلتش تجاوز نکند، از عارفان (العارفين) باادب و صاحبان سرّ امین خواهد بود. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}