{
  "id": 168,
  "title": {
    "ar": "الباب الثامن والستون ومائة في معرفة مقام الأدب وأسراره",
    "en": "Chapter One Hundred and Sixty-Eight, Concerning the Gnosis (المعرفة) of the Station (المقام) of Spiritual Discipline (الأدب) and its Secrets.",
    "ur": "باب ایک سو اڑسٹھ: مقامِ ادب اور اس کے اسرار کی معرفت میں",
    "fa": "باب صد و شصت و هشتم در معرفت مقام ادب و اسرار آن"
  },
  "content": {
    "ar": "## «الباب الثامن والستون ومائة في معرفة مقام الأدب وأسراره»\n\n\n> إن الأديب هو الحكيم لأنه *** مجموع خير والمساب مجمع‏\n\n\n> فإذا رأيت نعوته في خلقه *** كنها ففيك لكل نعت موضع‏\n\n\n> لا ترعوي عنها فأنت من أهلها *** والحق يعطي ما يشاء ويمنع‏\n\n\n> أدباء أهل الله خير كلهم *** فلذاك تبصرها تضر وتنفع‏\n\n\n> مثل الإساءة يرى العليل صنيعهم *** حسنا وتكره نفسه ما يصنع‏\n\n\nاعلم أيدك الله أن الله يقول وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فالأديب إمعة لما عنده من السعة فهو مع كل مقام بحسب ذلك المقام ومع كل حال بحسب ذلك الحال ومع كل خلق ومع كل غرض فالأديب هو الجامع لمكارم الأخلاق والعليم بسفسافها لا يتصف بها بل هو جامع لمراتب العلوم محمودها ومذمومها لأنه ما من شي‏ء إلا والعلم به أولى من الجهل به عند كل عاقل‏\n\n\n### [الأدب ينقسم إلى أربعة أقسام‏]\n\n\nفالأدب جماع الخير وهو ينقسم إلى أربعة أقسام في اصطلاح أهل الله‏\n\n\n### «القسم الأول» أدب الشريعة\n\n\nوهو الأدب الإلهي الذي يتولى الله تعليمه بالوحي والإلهام به أدب نبيه صَلَّى اللهُ عَليهِ وسَلَّم وبه أدبنا نبيه صَلَّى اللهُ عَليهِ وسَلَّم فهم المؤدبون المؤدبون‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن الله أدبني فأحسن أدبي‏\n\n\n### «و القسم الثاني» أدب الخدمة\n\n\nوهو ما اصطلحت عليه الملوك في خدمة خدمها وملك أهل الله هو الله فقد شرع لنا كيفية الأدب في خدمته وهو معاملتنا إياه فيما يختص به دون معاملة خلقه فهو خصوص في أدب الشريعة لأن حكم الشريعة يتعلق بما هو حق لله وبما هو حق للخلق‏\n\n\n### «و القسم الثالث» أدب الحق‏\n\n\nوهو الأدب مع الحق في اتباعه عند من يظهر عنده ويحكم به‏\nفترجع إليه وتقبله ولا ترده ولا تحملك الأنفة إن كنت ذا كبر في السن أو المرتبة وظهر الحق عند من هو أصغر منك سنا أو قدرا أو ظهر الحق عند معتوه تأدبت معه وأخذته عنه واعترفت بفضله عليك فيه هذا هو الاتصاف وما رأيت من تحقق بهذا خلقا في عمري إلا سيد واحد يقال له أبو عبد الله ابن جبير لقيته بمدينة سبتة وقصر كتامة وهو جزء من آداب الشريعة فإن أدب الشريعة هو الأم لباقي الأقسام‏\n\n\n### «و القسم الرابع» أدب الحقيقة\n\n\nوهو ترك الأدب بفنائك وردك ذلك كله إلى الله وسيأتي في الباب الذي يلي هذا الباب وهو في المقامات كالوهب في أصناف العطاء وهو أن يعطي لينعم لا لسبب آخر وكذا المأدبة الاجتماع على طعام ماله سبب إلا الدعوة إليه خاصة من غير تقييد من صفة وليمة أو ختان أو ضيافة أو عقيقة وغير ذلك وكذا جامع الخير لا لسبب بل لكون جامع ذلك له نفس فاضلة خيرة بالذات فذلك هو الأديب وللأدب حال ومقام وهذا باب معرفة مقامه فمقامه هو ما يثبت له دائما وليس ذلك إلا الأدب مع الحق فإنه له الدوام في الدنيا والآخرة وما فاز به إلا أهل الفتوة من الملامية لا غير سلكوا فيه كل مسلك واستخرجوا كنوزه وحصلوا فوائده كما قال الله تعالى إنه ما خلق السموات وهو كل عالم علوي والأرض وهو كل عالم سفلي السماء من عالم الصلاح والأرض من عالم الفساد ومنه اشتقت اسم الأرضة لما تفسده في الثياب والورق والخشب ويسمى أيضا السوس والعث وما بينهما إلا بالحق من العالم فهذا الحق المخلوق به هذا العالم هو الذي نتأدب معه فإنه سبب وجود أعيان العالم وبه يحكم الله يوم القيامة بين عباده وفي عباده وبه أنزل الشرائع فقال لرسوله داود يا داوُدُ إِنَّا جَعَلْناكَ خَلِيفَةً في الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ ولا تَتَّبِعِ الْهَوى‏ وإن كان مخلوقا بالحق فإنه مما بين السماء والأرض أو هو عين الأرض فمقام الأدب العمل بالحق والوقوف عند الحق وإياك أن تتوهم من هذا القول إن الصدق هو الحق من حيث إنك تقول قال حقا إذا صدق في قوله وقال صدقا بل الحق حاكم على الصدق وعلى الكذب بالحسن والقبح فالحق في موطن يحمد الصدق وفي موطن يذمه وينهى عنه ويثني على الكذب الذي هو ضده ويحرض عليه ويوجب العمل به وفي موطن آخر يذم الكذب وينهى عنه ويحمد الصدق ويأمر به وهذا مقام الأدب الذي ينفع صاحبه في كل موطن فألزمه وتتبع مواضعه ودلائله في الشرائع وفي أفعال الرسول المتأسي بها لا غير لا ما اختص به فإنه ليس بأدب مع الحق‏\n\n\n### «و أما مقام» أدب الخدمة\n\n\nفهو أن يعطي ذات المخدوم كان ما كان ما تستحقه من حيث عينها خاصة وهو أن تقف مع ما تطلبه بذاتها فتبادر إليه من قبل أن تأمرك به أو تساءلك فيه حتى لا يظهر عليها ذلة المسألة ولو كان أكبر منك وسالك في أمر فهو من حيث سؤاله إياك في ذلك الأمر أن تفعله إظهار حاجة إليك ولو عادت عليك منفعته ولكن مقام السؤال يقتضي ذلك فمقام أدب الخدمة الحضور دائما مع كل ذات مشهودة لك تنظر فيما تستحقه بما يعطيه الزمان أو المكان أو الحال فتقوم لها بذلك من غير سؤال ولا تنبه من أحد سوى حضورك فهذا مقام أدب الخدمة\n\n\n### «و أما مقام» أدب الشريعة\n\n\nفهو أن تقوم بأمرها خاصة لا بما تعطيك ذاتها إلا إن أمرتك بذلك فيكون قيامك بما تعطيك ذاتها من حيث أمرها لا غير قال تعالى وما آتاكُمُ الرَّسُولُ فَخُذُوهُ وما نَهاكُمْ عَنْهُ فَانْتَهُوا وقال تعالى يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ وكل خدمة عن أمر فمن أدب الشريعة لا من أدب الخدمة\n\n\n### «و أما مقام» أدب الحقيقة\n\n\nفإنا نذكره إن شاء الله‏\n\n\nومن أدب الشريعة أخذك لأحكامها المشروعة والوقوف عند رسومها وحدودها واتصافك بها لمجرد الخدمة والاشتغال لا لتحلية النفس بالعلم بها دون العمل ومن آداب الخدمة أن لا يشغلك ولا يبعثك عليها ما تنتجه لك من المخدوم من القبول وملاحظات التأميل فإن شغلك ذلك فما خدمت سوى غرضك ونفسك ومن آداب الحق أن لا يتعدى علمك في الأشياء علمه فيها وهو الموافقة وإن أعطاك علمك خلاف ذلك ولا سيما فيما أضافه الحق إلى الخلق من الأعمال فأضفها أنت إلى من أضافها الله واترك علمك لعلمه فإنه العليم وأنت العالم وهو الصادق فيما يخبر فما أضاف أمرا إلى من أضافه إلا وينبغي لذلك المضاف إليه تلك الإضافة فلا ترجح علمك على علمه من حيث قيام الدليل لك على أنه لا فاعل إلا الله فليس هذا من الأدب فصاحب الموافقة له كل تجل وشهود فاعلم ذلك‏",
    "en": "## The One Hundred and Sixty-Eighth Chapter: Concerning the Knowledge of the Station of Spiritual Discipline (الأدب) and its Secrets\n\nIndeed, the one possessing Spiritual Discipline (الأديب) is the Wise One (الحكيم), for he is\nThe sum of all goodness, and the path is the gathering place.\n\nIf you see His descriptions (نعوته) in His creation\nAs they truly are, then in you is a place for every description.\n\nDo not shrink from them, for you are among their people,\nAnd The Real (الحق) gives what He wills and withholds what He wills.\n\nThe disciplined ones (أدباء) among the People of God are all goodness,\nTherefore, you see them both harm and benefit.\n\nLike a perceived offense, the sick person sees their action\nAs good, yet his soul dislikes what they do.\n\nKnow, may God support you, that God says: <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are). The one possessing Spiritual Discipline (الأديب) is a follower (إمعة) due to the vastness (السعة) he possesses. Thus, he is with every station (مقام) according to that station, and with every state (حال) according to that state, and with every character trait, and with every purpose. The one possessing Spiritual Discipline is the collector of noble character traits and the knower of their trivial aspects, though he does not adopt the latter. Rather, he is the collector of the levels (مراتب) of knowledge, both praiseworthy and blameworthy, because there is nothing of which knowledge is not preferable to ignorance in the view of every rational person.\n\n### [Spiritual Discipline (الأدب) is Divided into Four Categories]\n\nSpiritual Discipline (الأدب), therefore, is the sum of goodness, and it is divided into four categories according to the terminology of the People of God.\n\n### The First Category: The Discipline of Sharia (أدب الشريعة)\n\nThis is the Divine Discipline (الأدب الإلهي) which God undertakes to teach through revelation (الوحي) and inspiration (الإلهام). By it, He disciplined His Prophet (peace and blessings be upon him), and through it, His Prophet (peace and blessings be upon him) disciplined us. Thus, they are the disciplined ones who discipline others.\n\nThe Messenger of God (peace and blessings be upon him) said: \"Indeed, God disciplined me and perfected my discipline.\"\n\n### The Second Category: The Discipline of Service (أدب الخدمة)\n\nThis is what kings have established as convention in the service of their servants. The King of the People of God is God Himself. He has legislated for us the manner of discipline in His service, which is our interaction with Him concerning what pertains exclusively to Him, distinct from our interaction with His creation. This is a specialization within the Discipline of Sharia (أدب الشريعة), because the ruling of the Sharia relates both to what is due to God (حق لله) and what is due to creation (حق للخلق).\n\n### The Third Category: The Discipline of The Real (أدب الحق)\n\nThis is the discipline shown toward The Real (الحق) in following it when it appears through someone and rules by it. You must return to it and accept it, and not reject it. Let not arrogance carry you away, even if you are advanced in age or rank, and The Real appears through someone younger than you in age or status, or even if The Real appears through an imbecile. You must show discipline toward him, take the truth from him, and acknowledge his favor upon you in that matter. This is the true embodiment (الاتصاف). I have not seen anyone who truly realized this character trait in my lifetime except for one master named Abu Abd Allah ibn Jubayr, whom I met in the city of Ceuta (سبتة) and the Qasr Kutama. This is a part of the disciplines of the Sharia, for the Discipline of Sharia (أدب الشريعة) is the mother of the remaining categories.\n\n### The Fourth Category: The Discipline of Reality (أدب الحقيقة)\n\nThis is the abandonment of discipline through your annihilation (فنائك) and the referral of all that back to God. This will be discussed in the chapter immediately following this one. In terms of spiritual stations (المقامات), it is like the gift (الوهب) among the types of giving: it is to give for the sake of bestowing grace, not for any other reason. Similarly, the feast (المأدبة) is a gathering for a meal whose only cause is the specific invitation to it, without being restricted by the description of a wedding feast, circumcision, hospitality, or birth celebration, and so forth. Likewise, the collector of goodness (جامع الخير) does so without cause, but because the one who collects it possesses an inherently virtuous and good soul. That is the one possessing Spiritual Discipline (الأديب).\n\nSpiritual Discipline has a state (حال) and a station (مقام). This chapter is about knowing its station. Its station is that which is permanently established for him, and that is none other than the discipline shown toward The Real (الحق), for permanence belongs to it in this world and the Hereafter. None have attained it except the People of Spiritual Chivalry (أهل الفتوة) from the Malamiyya (الملامية) and no others. They traversed every path within it, extracted its treasures, and acquired its benefits. As God Almighty said, He did not create the heavens—which is every celestial world—and the earth—which is every lower world (the heaven being the world of righteousness and the earth the world of corruption, from which the name *al-aradha* [woodworm] is derived for what it corrupts in clothes, paper, and wood, also called *al-sus* [weevil] and *al-athth* [moth])—nor what is between them, except by The Real (الحق) of the cosmos. This Real (الحق) by which this cosmos was created is that toward which we show discipline, for it is the cause of the existence of the Fixed Entities (أعيان العالم). By it, God judges between His servants and concerning His servants on the Day of Resurrection. By it, He sent down the Divine Laws (الشرائع), saying to His Messenger David: <<يَا دَاوُدُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَى>> (O David, indeed We have made you a vicegerent upon the earth, so judge between the people with The Real, and do not follow [vain] desire). Even though it is created by The Real, it is among what is between the heaven and the earth, or it is the very essence of the earth.\n\nThe station of Spiritual Discipline (مقام الأدب) is acting by The Real and standing firm by The Real. Beware of imagining from this statement that truthfulness (الصدق) is The Real (الحق) merely because you say, \"He spoke truly,\" when he was truthful in his speech, or \"He spoke truth.\" Rather, The Real is the judge over truthfulness and falsehood, determining what is good and what is ugly. In one instance, The Real praises truthfulness, and in another, it condemns and forbids it, while praising falsehood, which is its opposite, urging it, and making action upon it obligatory. In yet another instance, it condemns falsehood and forbids it, while praising truthfulness and commanding it. This is the station of Spiritual Discipline (مقام الأدب) that benefits its possessor in every situation. Therefore, adhere to it and trace its instances and proofs in the Divine Laws (الشرائع) and in the imitable actions of the Messenger, and nothing else—not those actions exclusive to him, for that is not discipline toward The Real.\n\n### As for the Station of the Discipline of Service (أدب الخدمة)\n\nThis is that you give the essence (ذات) of the one being served, whatever it may be, what it deserves specifically from the perspective of its essence. This means standing by what it demands by its very nature, and rushing to fulfill it before it commands you or asks you for it, so that the humiliation of asking does not appear upon it. Even if the one being served is greater than you and asks you for something, his asking you to perform that action is an expression of need for you, even if the benefit returns to you. However, the station of asking necessitates this. Thus, the station of the Discipline of Service (مقام أدب الخدمة) is constant presence with every essence (ذات) witnessed by you, observing what it deserves based on what time, place, or state (حال) grants it, and fulfilling that for it without being asked or prompted by anyone, solely based on your presence. This is the station of the Discipline of Service.\n\n### As for the Station of the Discipline of Sharia (أدب الشريعة)\n\nThis is that you fulfill its command specifically, and not what its essence (ذاتها) grants you, unless it commands you to do so. In that case, your fulfillment of what its essence grants you is solely by virtue of its command. The Almighty said: <<وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا>> (And whatever the Messenger gives you, take it; and whatever he forbids you from, abstain). And the Almighty said: <<يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ>> (O you who have believed, obey Allah and obey the Messenger and those in authority among you). Every service performed by command belongs to the Discipline of Sharia (أدب الشريعة), not the Discipline of Service (أدب الخدمة).\n\n### As for the Station of the Discipline of Reality (أدب الحقيقة)\n\nWe shall mention it, God willing.\n\nAmong the disciplines of the Sharia (أدب الشريعة) is your acceptance of its legislated rulings, standing firm by its customs and limits, and embodying them purely for the sake of service and engagement, not merely to adorn the soul with knowledge of them without action. Among the disciplines of Service (آداب الخدمة) is that you are not distracted or motivated by the acceptance or the anticipated expectations that the one being served may grant you. If that distracts you, then you have served nothing but your own purpose and soul. Among the disciplines of The Real (آداب الحق) is that your knowledge concerning things does not exceed His knowledge concerning them—this is conformity (الموافقة)—even if your own knowledge suggests otherwise. This is especially true regarding the actions that The Real attributes to creation (الخلق). You must attribute them to the one to whom God attributed them, and abandon your knowledge for His knowledge, for He is the All-Knowing (العليم) and you are the knower, and He is truthful in what He reports. He only attributes a matter to the one to whom He attributes it because that attribution is appropriate for the one attributed. Therefore, do not prefer your knowledge over His knowledge based on the establishment of the proof for you that there is no doer (فاعل) but God, for this is not discipline (الأدب). The possessor of conformity (الموافقة) is granted every theophany (تجلي) and witnessing (شهود). Know this.",
    "ur": "باب ایک سو اڑسٹھ: مقامِ ادب اور اس کے اسرار کی معرفت میں\n\nبے شک ادیب ہی حکیم ہے، کیونکہ\nوہ تمام بھلائیوں کا مجموعہ ہے اور اس کا راستہ جمع کرنے والا ہے۔\n\nپس جب تم اس کی صفات کو اس کی مخلوق میں دیکھو\nتو ان کی حقیقت کو جانو، کیونکہ تم میں ہر صفت کے لیے جگہ ہے۔\n\nان سے منہ نہ موڑو، کیونکہ تم ان کے اہل میں سے ہو\nاور ذات حق (الحق) جو چاہتا ہے عطا کرتا ہے اور روکتا ہے۔\n\nاہلِ اللہ کے ادیب سب کے سب خیر ہیں\nاسی لیے تم انہیں نقصان پہنچاتے اور فائدہ دیتے ہوئے دیکھتے ہو۔\n\nجیسے کہ برائی، بیمار شخص ان کا عمل اچھا دیکھتا ہے\nاور اس کا نفس اس عمل کو ناپسند کرتا ہے جو وہ کرتے ہیں۔\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ اللہ تعالیٰ فرماتا ہے: \"اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو\" (وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ)۔ پس ادیب اپنے اندر موجود وسعت (السعة) کی وجہ سے ہر چیز کا پیروکار ہوتا ہے۔ وہ ہر مقام کے ساتھ اس مقام کے مطابق ہوتا ہے، اور ہر حال کے ساتھ اس حال کے مطابق ہوتا ہے، اور ہر خلق اور ہر غرض کے ساتھ ہوتا ہے۔ پس ادیب ہی مکارمِ اخلاق کا جامع ہے اور ان کی ادنیٰ باتوں کا بھی عالم ہے، لیکن وہ ان سے متصف نہیں ہوتا۔ بلکہ وہ علوم کے تمام مراتب، خواہ وہ محمود ہوں یا مذموم، کا جامع ہوتا ہے، کیونکہ ہر عاقل کے نزدیک کسی بھی شے کا علم، اس کے جہل سے بہتر ہے۔\n\n### [ادب چار اقسام میں منقسم ہے]\n\nپس ادب تمام بھلائیوں کا مجموعہ ہے اور اہلِ اللہ کی اصطلاح میں یہ چار اقسام میں منقسم ہے۔\n\n### \"پہلی قسم\" ادبِ شریعت (أدب الشريعة)\n\nیہ وہ ادبِ الٰہی (الأدب الإلهي) ہے جس کی تعلیم اللہ تعالیٰ وحی اور الہام کے ذریعے خود دیتا ہے۔ اسی کے ذریعے اس نے اپنے نبی صلی اللہ علیہ وسلم کو ادب سکھایا، اور اسی کے ذریعے آپ صلی اللہ علیہ وسلم نے ہمیں ادب سکھایا۔ پس وہ (انبیاء) مؤدب بھی ہیں اور مؤدب کیے گئے بھی۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک اللہ نے مجھے ادب سکھایا اور میرے ادب کو بہترین بنا دیا\" (إِنَّ اللَّهَ أَدَّبَنِي فَأَحْسَنَ أَدَبِي)۔\n\n### \"اور دوسری قسم\" ادبِ خدمت (أدب الخدمة)\n\nیہ وہ ادب ہے جس پر بادشاہوں نے اپنے خادموں کی خدمت کے لیے اتفاق کیا ہے۔ اور اہلِ اللہ کا بادشاہ ذات حق (الحق) ہے، پس اس نے ہمیں اپنی خدمت میں ادب کا طریقہ مشروع کیا ہے۔ یہ اس کے ساتھ ہمارا معاملہ ہے جو صرف اس سے خاص ہے، نہ کہ اس کی مخلوق کے ساتھ معاملہ۔ یہ ادبِ شریعت (أدب الشريعة) میں ایک خصوصیت ہے، کیونکہ شریعت کا حکم ان چیزوں سے متعلق ہے جو اللہ کا حق ہیں اور ان چیزوں سے بھی جو مخلوق کا حق ہیں۔\n\n### \"اور تیسری قسم\" ادبِ حق (أدب الحق)\n\nیہ ذات حق (الحق) کے ساتھ ادب ہے، اس کی پیروی میں جب وہ کسی کے ذریعے ظاہر ہو اور اس کے ذریعے حکم دے۔\n\nپس تم اس کی طرف رجوع کرو اور اسے قبول کرو اور اسے رد نہ کرو۔ اگر تم عمر یا مرتبے میں بڑے ہو اور حق کسی ایسے شخص کے ذریعے ظاہر ہو جو تم سے عمر یا قدر میں چھوٹا ہو، یا حق کسی معتوہ (کم عقل) کے ذریعے ظاہر ہو، تو تمہاری انفت (تکبر) تمہیں اس سے باز نہ رکھے۔ تم اس کے ساتھ ادب سے پیش آؤ، اسے اس سے حاصل کرو، اور اس میں اس کی فضیلت کا اعتراف کرو۔ یہ ہی اتصاف (صفات کا اختیار کرنا) ہے۔ میں نے اپنی عمر میں کسی ایسے شخص کو نہیں دیکھا جو اس خلق سے متحقق ہوا ہو، سوائے ایک سید کے جنہیں ابو عبد اللہ ابن جبیر کہا جاتا تھا۔ میں ان سے سبتہ شہر اور قتامہ کے قلعے میں ملا تھا۔ یہ ادبِ شریعت (أدب الشريعة) کا ایک جزو ہے، کیونکہ ادبِ شریعت باقی تمام اقسام کے لیے ماں کی حیثیت رکھتا ہے۔\n\n### \"اور چوتھی قسم\" ادبِ حقیقت (أدب الحقيقة)\n\nیہ فنا (الفناء) کے ذریعے ادب کو ترک کر دینا اور اس سب کو اللہ کی طرف لوٹا دینا ہے۔ اس کا ذکر اس باب کے بعد والے باب میں آئے گا۔ یہ مقامات میں ایسا ہے جیسے عطیات کی اقسام میں \"وہب\" (خالص عطیہ)۔ یہ کہ عطا کرنا صرف انعام دینے کے لیے ہو، نہ کہ کسی اور سبب سے۔ اسی طرح مأدبہ (دعوت) بھی ہے، جو کھانے پر جمع ہونا ہے جس کا سبب صرف دعوت دینا ہو، بغیر کسی قید کے، جیسے ولیمہ، ختنہ، ضیافت، یا عقیقہ وغیرہ۔ اسی طرح جامعِ خیر (بھلائیوں کو جمع کرنے والا) بھی کسی سبب سے نہیں ہوتا، بلکہ اس لیے کہ اس کو جمع کرنے والے کی ذات میں فطرتاً ایک فاضل اور خیر نفس موجود ہے۔ پس وہی ادیب ہے۔ اور ادب کے لیے حال (الحال) اور مقام (المقام) ہوتا ہے۔ یہ باب اس کے مقام کی معرفت میں ہے۔ پس اس کا مقام وہ ہے جو اس کے لیے ہمیشہ ثابت رہے، اور وہ صرف ذات حق (الحق) کے ساتھ ادب ہے، کیونکہ دنیا اور آخرت میں اسی کو دوام حاصل ہے۔ اور اس مقام کو صرف ملامیہ (الملامية) میں سے اہلِ فتوۃ (اہل الفتوة) نے ہی حاصل کیا ہے۔ انہوں نے اس میں ہر راستہ اختیار کیا، اس کے خزانوں کو نکالا، اور اس کے فوائد حاصل کیے۔ جیسا کہ اللہ تعالیٰ نے فرمایا کہ اس نے آسمانوں (جو کہ تمام عالمِ علوی ہے) اور زمین (جو کہ تمام عالمِ سفلی ہے) کو، اور جو کچھ ان کے درمیان ہے، صرف حق (الحق) کے ساتھ ہی پیدا کیا ہے۔ آسمان عالمِ صلاح (درستگی) سے ہے اور زمین عالمِ فساد سے ہے، اور اسی سے \"ارضہ\" (دیمک) کا نام مشتق ہوا ہے، کیونکہ وہ کپڑوں، کاغذ اور لکڑی میں فساد پیدا کرتی ہے، اسے سوس یا عث بھی کہتے ہیں۔ پس یہ حق (الحق) جس کے ذریعے یہ عالم تخلیق کیا گیا ہے، وہی ہے جس کے ساتھ ہم ادب اختیار کرتے ہیں، کیونکہ یہ عالم کی اعیان (حقیقتوں) کے وجود کا سبب ہے۔ اور اسی کے ذریعے اللہ تعالیٰ قیامت کے دن اپنے بندوں کے درمیان اور اپنے بندوں میں حکم فرمائے گا۔ اور اسی کے ذریعے اس نے شرائع نازل کیں۔ چنانچہ اس نے اپنے رسول داؤد علیہ السلام سے فرمایا: \"اے داؤد! بے شک ہم نے تجھے زمین میں خلیفہ بنایا ہے، پس لوگوں کے درمیان حق (الحق) کے ساتھ فیصلہ کر اور خواہش کی پیروی نہ کر\" (يَا دَاوُدُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَىٰ)۔ اگرچہ وہ (حق) حق کے ساتھ مخلوق ہے، لیکن وہ آسمان اور زمین کے درمیان کی چیزوں میں سے ہے یا وہ عین زمین ہے۔ پس مقامِ ادب (مقام الأدب) حق پر عمل کرنا اور حق پر قائم رہنا ہے۔ اور خبردار! تم اس قول سے یہ وہم نہ کرنا کہ صدق (سچائی) ہی حق ہے، اس لحاظ سے کہ تم کہتے ہو کہ جب کسی نے اپنے قول میں سچ کہا تو اس نے حق کہا، بلکہ حق (الحق) صدق اور کذب (جھوٹ) دونوں پر حسن اور قبح (اچھائی اور برائی) کے لحاظ سے حاکم ہے۔ پس حق ایک جگہ صدق کی تعریف کرتا ہے اور دوسری جگہ اس کی مذمت کرتا ہے اور اس سے منع کرتا ہے، اور اس کے برعکس کذب کی تعریف کرتا ہے، اس پر ابھارتا ہے اور اس پر عمل کو واجب قرار دیتا ہے۔ اور ایک دوسرے مقام پر کذب کی مذمت کرتا ہے، اس سے منع کرتا ہے، اور صدق کی تعریف کرتا ہے اور اس کا حکم دیتا ہے۔ اور یہ ہی مقامِ ادب (مقام الأدب) ہے جو اپنے صاحب کو ہر جگہ فائدہ دیتا ہے۔ پس اسے لازم پکڑو اور شرائع میں اور رسول کے افعال میں، جن کی پیروی کی جاتی ہے، اس کے مقامات اور دلائل کو تلاش کرو، نہ کہ ان افعال کو جو آپ کے ساتھ خاص تھے، کیونکہ وہ ذات حق (الحق) کے ساتھ ادب نہیں ہیں۔\n\n### \"اور جہاں تک مقام\" ادبِ خدمت (أدب الخدمة) کا تعلق ہے\n\nتو وہ یہ ہے کہ مخدوم کی ذات کو، خواہ وہ کوئی بھی ہو، وہ چیز دی جائے جس کا وہ اپنی عین ذات کے لحاظ سے مستحق ہے۔ اور وہ یہ ہے کہ تم اس چیز پر قائم رہو جو وہ اپنی ذات سے طلب کرتا ہے، پس تم اس کے حکم دینے یا سوال کرنے سے پہلے ہی اس کی طرف سبقت کرو، تاکہ اس پر سوال کی ذلت ظاہر نہ ہو۔ اگرچہ وہ تم سے بڑا ہو اور کسی معاملے میں تم سے سوال کرے، تو اس کا تم سے سوال کرنا اس بات کا اظہار ہے کہ اسے تم سے اس کام کے کرنے کی حاجت ہے، اگرچہ اس کا فائدہ تمہیں ہی لوٹے۔ لیکن سوال کا مقام اس کا متقاضی ہے۔ پس مقامِ ادبِ خدمت (مقام أدب الخدمة) یہ ہے کہ تم ہمیشہ ہر مشہود ذات کے ساتھ حاضر رہو، اور اس بات پر غور کرو کہ وہ زمان، مکان یا حال کے لحاظ سے کس چیز کی مستحق ہے، اور تم بغیر کسی سوال یا کسی کی تنبیہ کے، صرف اپنی حاضری کی وجہ سے، اس کے لیے وہ کام انجام دو۔ یہ ہے مقامِ ادبِ خدمت۔\n\n### \"اور جہاں تک مقام\" ادبِ شریعت (أدب الشريعة) کا تعلق ہے\n\nتو وہ یہ ہے کہ تم خاص طور پر اس کے حکم پر قائم رہو، نہ کہ اس چیز پر جو اس کی ذات تمہیں عطا کرتی ہے، سوائے اس کے کہ وہ تمہیں اس کا حکم دے۔ تب تمہارا اس چیز پر قائم رہنا جو اس کی ذات تمہیں عطا کرتی ہے، اس کے حکم کی وجہ سے ہوگا، نہ کہ کسی اور وجہ سے۔ اللہ تعالیٰ فرماتا ہے: \"اور رسول تمہیں جو کچھ دے وہ لے لو اور جس سے منع کرے اس سے باز رہو\" (وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا)۔ اور اللہ تعالیٰ فرماتا ہے: \"اے ایمان والو! اللہ کی اطاعت کرو اور رسول کی اطاعت کرو اور اپنے میں سے اولی الامر کی\" (يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ)۔ اور ہر خدمت جو حکم کے تحت ہو، وہ ادبِ شریعت میں سے ہے، نہ کہ ادبِ خدمت میں سے۔\n\n### \"اور جہاں تک مقام\" ادبِ حقیقت (أدب الحقيقة) کا تعلق ہے\n\nتو ہم اسے ان شاء اللہ ذکر کریں گے۔\n\nادبِ شریعت (أدب الشريعة) میں سے یہ ہے کہ تم اس کے مشروع احکام کو اختیار کرو، اس کے رسموں اور حدود پر قائم رہو، اور ان سے متصف ہو جاؤ، محض خدمت اور مشغولیت کے لیے، نہ کہ عمل کے بغیر صرف علم کے ذریعے نفس کو آراستہ کرنے کے لیے۔ اور آدابِ خدمت (أدب الخدمة) میں سے یہ ہے کہ مخدوم کی طرف سے جو قبولیت اور امید کی نگاہیں تمہیں حاصل ہوں، وہ تمہیں مشغول نہ کریں اور نہ ہی تمہیں اس پر ابھاریں۔ اگر یہ چیز تمہیں مشغول کر دے تو تم نے صرف اپنی غرض اور اپنے نفس کی خدمت کی ہے۔ اور آدابِ حق (آداب الحق) میں سے یہ ہے کہ اشیاء کے بارے میں تمہارا علم، ذات حق (الحق) کے علم سے تجاوز نہ کرے، اور یہ ہی موافقت (الموافقۃ) ہے۔ اگرچہ تمہارا علم اس کے خلاف کچھ اور ہی عطا کرے۔ خاص طور پر ان اعمال کے بارے میں جنہیں ذات حق (الحق) نے مخلوق کی طرف منسوب کیا ہے، تو تم بھی انہیں اسی کی طرف منسوب کرو جس کی طرف اللہ نے منسوب کیا ہے، اور اپنے علم کو اس کے علم کے لیے چھوڑ دو، کیونکہ وہ علیم ہے اور تم عالم ہو، اور وہ اپنی خبر دینے میں سچا ہے۔ پس اس نے جس امر کو جس کی طرف منسوب کیا ہے، تو اس منسوب الیہ کے لیے وہ نسبت مناسب ہے۔ پس تم اپنے علم کو اس کے علم پر ترجیح نہ دو، اس دلیل کی بنیاد پر کہ تمہارے نزدیک \"لا فاعل إلا الله\" (اللہ کے سوا کوئی فاعل نہیں) ہے۔ یہ ادب میں سے نہیں ہے۔ پس موافقت (الموافقۃ) اختیار کرنے والے کے لیے ہر ظہور الٰہی (التجلی) اور شہود (الشہود) حاصل ہوتا ہے۔ پس یہ جان لو۔",
    "fa": "«باب صد و شصت و هشتم در معرفت مقام ادب و اسرار آن»\n\n> همانا ادیب همان حکیم است، زیرا *** او مجموع خیر است و محل گرد آمدن (خیرات).\n> پس اگر صفات او را در آفرینش *** آن‌گونه که هست ببینی، در تو برای هر صفتی جایگاهی است.\n> از آن صفات روی مگردان، که تو از اهل آنی *** و حق (الحق) هر چه بخواهد می‌دهد و باز می‌دارد.\n> ادیبان اهل الله همگی خیرند *** از این رو می‌بینی که هم زیان می‌رسانند و هم سود می‌بخشند.\n> مانند بدرفتاری که بیمار کارشان را *** نیکو می‌بیند، اما نفسش آنچه را انجام می‌دهند ناخوش می‌دارد.\n\nبدان، خداوند تو را تأیید کند، که خداوند می‌فرماید: «و او با شماست هر کجا که باشید» (وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ). پس ادیب، تابع (إمعة) چیزی است که نزد او از سعه (گستردگی) وجود دارد. از این رو، او با هر مقام به حسب آن مقام، و با هر حال به حسب آن حال، و با هر خلق و با هر غرضی همراه است. پس ادیب، جامع مکارم اخلاق و آگاه به پست‌ترین آنهاست، اما به آنها متصف نمی‌شود. بلکه او جامع مراتب علوم، چه ستوده و چه نکوهیده، است؛ زیرا نزد هر عاقلی، علم به هر چیزی اولی‌تر از جهل به آن است.\n\n### [ادب به چهار بخش تقسیم می‌شود]\n\nپس ادب، جامع خیر است و در اصطلاح اهل الله به چهار بخش تقسیم می‌شود.\n\n### «بخش اول» ادب شریعت (أدب الشريعة)\n\nو آن ادب الهی است که خداوند تعلیم آن را با وحی و الهام بر عهده گرفته است. به واسطه آن، پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) را مؤدب ساخت و پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) نیز ما را مؤدب نمود. پس ایشان هم مؤدب‌کنندگان هستند و هم مؤدب‌شدگان.\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا خداوند مرا ادب کرد و ادب مرا نیکو ساخت» (إن الله أدبني فأحسن أدبي).\n\n### «و بخش دوم» ادب خدمت (أدب الخدمة)\n\nو آن چیزی است که پادشاهان در خدمت به خادمان خود بر آن توافق کرده‌اند. و پادشاه اهل الله، حق (الحق) است. پس او برای ما چگونگی ادب در خدمتش را تشریع کرده است، و آن عبارت است از تعامل ما با او در آنچه مختص به اوست، نه تعامل با خلق او. این ادب، خصوصی در ادب شریعت است، زیرا حکم شریعت هم به آنچه حق خداوند است و هم به آنچه حق خلق است، تعلق می‌گیرد.\n\n### «و بخش سوم» ادب حق (أدب الحق)\n\nو آن ادب ورزیدن با حق (الحق) در پیروی از آن است، هنگامی که نزد کسی ظاهر می‌شود و به آن حکم می‌کند.\nپس به آن بازگرد و آن را بپذیر و رد مکن. و اگر از نظر سن یا مرتبه بزرگ‌تر هستی، تکبر تو را وادار به رد آن نکند، اگر حق نزد کسی ظاهر شد که از تو کوچک‌تر است یا قدر کمتری دارد، یا حق نزد فردی دیوانه (معتوه) ظاهر شد، با او ادب ورزیده و آن را از او بگیری و به فضل او بر خود در آن اعتراف کنی. این همان اتصاف است. من در عمر خود کسی را ندیدم که به این خلق متحقق شده باشد، مگر یک سید که به او ابوعبدالله ابن جبیر می‌گفتند. او را در شهر سبته و قصر کتامه ملاقات کردم. این بخش، جزئی از آداب شریعت است، زیرا ادب شریعت، مادر سایر بخش‌هاست.\n\n### «و بخش چهارم» ادب حقیقت (أدب الحقيقة)\n\nو آن ترک ادب با فنای (الفناء) تو و بازگرداندن تمام آن به سوی خداوند است. و این در بابی که پس از این باب می‌آید، خواهد آمد. این بخش در میان مقامات، مانند بخشش (الوهب) در انواع عطاهاست؛ و آن این است که عطا کند تا نعمت بخشد، نه به سبب دیگری. همچنین، مأدبه (سفره مهمانی) اجتماع بر طعامی است که سببی جز دعوت خاص به آن ندارد، بدون قید و شرطی مانند ولیمه یا ختنه یا ضیافت یا عقیقه و غیره. همچنین، جامع خیر بودن بدون سبب است، بلکه به دلیل آن است که جامع آن دارای نفسی فاضل و خیر بالذات است. پس او همان ادیب است. و ادب دارای حال و مقام است. و این باب، باب معرفت مقام آن است. پس مقام آن چیزی است که همواره برای او ثابت می‌ماند، و آن چیزی نیست جز ادب ورزیدن با حق (الحق)، زیرا دوام آن در دنیا و آخرت برای اوست. و جز اهل فتوت از ملامتیه (الملامية) به آن دست نیافته‌اند. آنان در این راه هر مسیری را پیمودند و گنج‌های آن را استخراج کردند و فوایدش را به دست آوردند، چنانکه خداوند متعال می‌فرماید: همانا آسمان‌ها (که هر عالم علوی است) و زمین (که هر عالم سفلی است، آسمان از عالم صلاح و زمین از عالم فساد است، و نام «ارضه» [موریانه] که فساد در لباس و کاغذ و چوب ایجاد می‌کند، از آن مشتق شده و سوس و عث نیز نامیده می‌شود) و آنچه میان آن دو است، جز به حق (بالحق) از عالم خلق نشده است. پس این حق (الحق) که عالم به واسطه آن خلق شده، همان است که ما با آن ادب می‌ورزیم، زیرا آن سبب وجود اعیان عالم است و خداوند به واسطه آن در روز قیامت میان بندگانش و در مورد بندگانش حکم می‌کند. و به واسطه آن شرایع را نازل کرد و به رسولش داود فرمود: «ای داود، ما تو را در زمین خلیفه قرار دادیم، پس میان مردم به حق (بالْحَقِّ) حکم کن و از هوی و هوس پیروی مکن» (يا داوُدُ إِنَّا جَعَلْناكَ خَلِيفَةً في الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ ولا تَتَّبِعِ الْهَوى‏). و اگرچه به حق (بالحق) خلق شده، اما از جمله آنچه میان آسمان و زمین است یا عین زمین است. پس مقام ادب، عمل به حق و توقف در مرز حق است. و مبادا از این سخن توهم کنی که صدق (راستی) همان حق است، از آن جهت که می‌گویی: «حق گفت» هنگامی که در گفتارش راست بود و «صدق گفت». بلکه حق (الحق) بر صدق و کذب، با نیکویی و زشتی حکم می‌کند. پس حق در موطنی صدق را می‌ستاید و در موطنی آن را نکوهش کرده و از آن نهی می‌کند و کذب را که ضد آن است، می‌ستاید و به آن ترغیب می‌کند و عمل به آن را واجب می‌سازد. و در موطنی دیگر کذب را نکوهش کرده و از آن نهی می‌کند و صدق را می‌ستاید و به آن امر می‌کند. و این مقام ادبی است که صاحبش در هر موطنی از آن بهره می‌برد. پس آن را لازم بدار و مواضع و دلایل آن را در شرایع و در افعال رسول که به او اقتدا می‌شود، پیگیری کن، نه آنچه مختص به اوست، زیرا آن از ادب با حق نیست.\n\n### «و اما مقام» ادب خدمت (أدب الخدمة)\n\nآن است که به ذات مخدوم، هر که باشد، آنچه را که از حیث عین خود استحقاق دارد، عطا کنی. و آن این است که با آنچه ذات او می‌طلبد، بایستی و پیش از آنکه به تو امر کند یا از تو درخواست نماید، به آن مبادرت ورزی، تا ذلت درخواست بر او ظاهر نشود، حتی اگر از تو بزرگ‌تر باشد و در امری از تو سؤال کند. از حیث سؤال او از تو در آن امر که انجام دهی، اظهار نیازی به توست، اگرچه منفعت آن به خودت بازگردد، اما مقام سؤال این را اقتضا می‌کند. پس مقام ادب خدمت، حضور دائمی با هر ذاتی است که برای تو مشهود است، و در آنچه به واسطه زمان یا مکان یا حال استحقاق دارد، نظر کنی و بدون درخواست و بدون تنبه از سوی کسی، جز حضور خودت، برای او به آن قیام کنی. پس این مقام ادب خدمت است.\n\n### «و اما مقام» ادب شریعت (أدب الشريعة)\n\nآن است که به امر آن قیام کنی، نه به آنچه ذاتش به تو می‌دهد، مگر اینکه شریعت تو را به آن امر کند. در این صورت، قیام تو به آنچه ذاتش به تو می‌دهد، از حیث امر شریعت است و نه چیز دیگر. خداوند متعال می‌فرماید: «و آنچه را رسول به شما داد، بگیرید و از آنچه شما را نهی کرد، باز ایستید» (وما آتاكُمُ الرَّسُولُ فَخُذُوهُ وما نَهاكُمْ عَنْهُ فَانْتَهُوا). و خداوند متعال می‌فرماید: «ای کسانی که ایمان آورده‌اید، از خدا اطاعت کنید و از رسول و صاحبان امر خود اطاعت کنید» (يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وأَطِيعُوا الرَّسُولَ وأُولِي الْأَمْرِ مِنْكُمْ). و هر خدمتی که از روی امر باشد، از ادب شریعت است، نه از ادب خدمت.\n\n### «و اما مقام» ادب حقیقت (أدب الحقيقة)\n\nپس ما آن را ان‌شاءالله ذکر خواهیم کرد.\n\nو از ادب شریعت، پذیرش احکام مشروع آن و توقف در مرزها و حدود آن و متصف شدن به آنها صرفاً برای خدمت و اشتغال است، نه برای آراستن نفس به علم آن بدون عمل. و از آداب خدمت این است که آنچه از مخدوم به تو می‌رسد، از قبیل پذیرش و ملاحظات امیدبخش، تو را مشغول نسازد و برانگیخته نکند. اگر این تو را مشغول سازد، جز به غرض و نفس خود خدمت نکرده‌ای. و از آداب حق (الحق) این است که علم تو در اشیاء از علم او در آنها فراتر نرود، و آن همان موافقت است، حتی اگر علم تو خلاف آن را به تو بدهد. به ویژه در آنچه حق (الحق) از اعمال به خلق نسبت داده است، تو نیز آن را به کسی نسبت ده که خداوند نسبت داده است و علم خود را برای علم او رها کن، زیرا او علیم است و تو عالم، و او در آنچه خبر می‌دهد صادق است. پس او امری را به کسی نسبت نداده است، مگر اینکه آن نسبت برای آن منسوب‌الیه شایسته باشد. پس علم خود را بر علم او ترجیح مده، از آن جهت که دلیلی برای تو بر این است که فاعلی جز خداوند نیست. این از ادب نیست. پس صاحب موافقت، هر تجلی (التجلی) و شهودی (الشهود) را داراست. پس این را بدان."
  },
  "page_count": 2
}