{
  "id": 110,
  "title": {
    "ar": "الباب العاشر ومائة في مقام الخشوع",
    "en": "Chapter One Hundred and Ten: Concerning the Station of Reverence (مقام الخشوع)",
    "ur": "خاموشی سے سوچ رہا ہوں:\n۱.  **اصل عربی عنوان:** الباب العاشر ومائة في مقام الخشوع\n۲.  **اجزاء کا تجزیہ:**\n    *   الباب: باب (Chapter)\n    *   العاشر ومائة: ایک سو دسواں (۱۰۰ + ۱۰ = ۱۱۰)\n    *   في: میں، کے بارے میں\n    *   مقام: مقام (Spiritual Station)\n    *   الخشوع: خشوع (Humility, Reverence, Awe)\n۳.  **ترجمہ کی تشکیل:** باب ایک سو دسواں، مقام خشوع کے بارے میں۔\n۴.  **حتمی اردو ترجمہ (صرف ترجمہ):** باب ایک سو دسواں: مقام خشوع کے بارے میں۔ (یا: باب ایک سو دسواں: مقام خشوع میں)\n\n**نتیجہ:** باب ایک سو دسواں: مقام خشوع کے بارے میں۔",
    "fa": "باب صد و دهم در مقام خشوع"
  },
  "content": {
    "ar": "## (الباب العاشر ومائة في مقام الخشوع)\n\n\n> لا يكون الخشوع إلا إذا ما *** يبصر القلب من تدلى إليه‏\n\n\n> وتجلى له بصورة مثل *** غير هذا فلا يكون لديه‏\n\n\n> فإن اعتز في مقام التجلي *** فله الحكم لا يكون عليه‏\n\n\n### [النعت المحمود في الدنيا على قوم محمودين المحمود في الآخرة على قوم مذمومين‏]\n\n\nالخشوع مقام الذلة والصغار وهو من صفات المخلوقين ليس له في الألوهية مدخل وهو نعت محمود في الدنيا على قوم محمودين وهو نعت محمود في الآخرة في قوم مذمومين شرعا بلسان حق وهو حال ينتقل من المؤمنين في الآخرة إلى أهل العزة المتكبرين الجبارين الذين يريدون علوا في الأرض من المفسدين في الأرض فالمؤمنون في صَلاتِهِمْ خاشِعُونَ وهم الخاشعون من الرجال والخاشعات من النساء الذين أَعَدَّ الله لَهُمْ مَغْفِرَةً وأَجْراً عَظِيماً ونعت أصحابه في الآخرة فقال خاشِعِينَ من الذُّلِّ يَنْظُرُونَ من طَرْفٍ خَفِيٍّ وقال وُجُوهٌ يَوْمَئِذٍ خاشِعَةٌ عامِلَةٌ ناصِبَةٌ تَصْلى‏ ناراً حامِيَةً تُسْقى‏ من عَيْنٍ آنِيَةٍ لَيْسَ لَهُمْ طَعامٌ إِلَّا من ضَرِيعٍ‏\n\n\n### [الخشوع لا يكون إلا عن تجل على القلوب‏]\n\n\nولا يكون الخشوع حيث كان إلا عن تجل إلهي على القلوب في المؤمن عن تعظيم وإجلال وفي الكافر عن قهر وخوف وبطش‏\n\n\nقال عليه السلام حين سئل عن كسوف الشمس إن الله إذا تجلى لشي‏ء خشع له خرجه البزار\n\n\nوإذا وقع التجلي حصل الخشوع وأورث التجلي العلم والعلم يورث الخشية إِنَّما يَخْشَى الله من عِبادِهِ الْعُلَماءُ\n\n\n### [الغت والغط في نزول الوحى‏]\n\n\nوالخشية تعطي الخشوع والخشوع يعطي التصدع وهو انفعال الطبع للخشوع والتصدع تقصف وتكسر في الأعضاء والغطيط الذي يسمع فيها كل ذلك من أثر الطبع القابل لأثر الوارد في التجلي الإلهي وهو الذي‏\nكنى عنه الشرع بالغت والغط في نزول الوحي عليه كصلصلة الجرس وهو أشده عليه فإن نزوله شديد على هذا الهيكل البشري ولا سيما إن كان النزول بالقرآن كما قال ولَوْ أَنَّ قُرْآناً سُيِّرَتْ به الْجِبالُ أَوْ قُطِّعَتْ به الْأَرْضُ وقد يكون من الجبال القوة الماسكة الطبع الذي من شأنه الميل نظير الميد في الأرض ويكون من الأرض أرض الأجسام الطبيعية أَوْ كُلِّمَ به الْمَوْتى‏ ومن أصناف الموت الجهل يقول تعالى أَ ومن كانَ مَيْتاً فَأَحْيَيْناهُ لكان هذا القرآن يحيا بما فيه من العلم ويقطع به الأرض وتسير الجبال بما فيه من الزجر والوعيد\n\n\n### [كل كلام إلهى له أثر في المحل المنزل عليه‏]\n\n\nوقوله قُرْآناً بالتنكير دليل على أحد أمرين إما على آيات منه مخصوصة كما ضرط الجبار عند ما سمع صاعِقَةً مِثْلَ صاعِقَةِ عادٍ وثَمُودَ وإما أن يكون ثم أمر آخر ينطلق عليه اسم قرآن غير هذا لغة ولو حرف امتناع لامتناع فهل هو داخل تحت الإمكان فيوجد أو ما هو ثم إلا بحكم الفرض والتقدير فأما عندنا فكل كلام إلهي من كلمة مركبة من حرفين إلى ما فوق ذلك من تركيبات الحروف والكلمات المنسوبة إلى الله بحكم الكلام فإنه قرآن لغة وله أثر في النزول في المحل المنزل عليه إذا كان في استعداده التأثر بنزوله فإن لم يكن فلا يشترط والاستعداد من المحل أن يكون حاله العبودة والعبودية وأثره في حال العبودية أتم منه في حال العبودة فإن سمع المحل أو نزل عليه في حال كون الحق سمعه حصل له النزول ولم يظهر له أثر عليه لأنه حق في تلك الحالة فينتفي عنه الخشوع وهذا أصل يطرد في كل وصف لا يكون له في الألوهة مدخل كالذلة والافتقار والخشوع والخوف والخشية فإنه يتأثر صاحب هذا الحال وكل كون يكون حالة نعت إلهي كالكرم والجود والرحمة والكبرياء فإنه لا يؤثر في صاحبه أصلا فإنه نعت حق فله العزة والمنع هذا مطرد وقد نزل علينا من القرآن ذوقا عرفنا من ذلك صورة نزوله على نبيه صَلَّى اللهُ عَليهِ وسَلَّم فوجدنا له ما لم نجد لحفظ حروفه ولا لتدبر معانيه ونزل علينا في الحالين فأثر في الحال الواحد الكوني ولم يؤثر في الحال الإلهي إلا لذة خاصة فإنه لا بد منها وأما خشوعا فلا ولهذا ينسب إلى الجناب الإلهي الأقدس ما ينسب من الفرح وهو التذاذ\n\n\n### [من استظهر القرآن أدرجت النبوة بين جنبيه‏]\n\n\nثم إن الله جعل مثل هذا أمثالا مضروبة للناس يُضِلُّ به كَثِيراً ويَهْدِي به كَثِيراً وما يُضِلُّ به إِلَّا الْفاسِقِينَ الخارج عن الحالين والعاري عن التلبس بالحكمين وهي حالة الغافلين عما خلقوا له وعما فضلوا به لم يمت أبو يزيد حتى استظهر القرآن وهو تنزيله عليه ذوقا ومن استظهر القرآن فقد أدرجت النبوة بين جنبيه كذا قال ص‏\n\n\nوهذا الفرق بين تنزله على النبي صَلَّى اللهُ عَليهِ وسَلَّم وبين تنزله علينا فإنه منزل في النبي صَلَّى اللهُ عَليهِ وسَلَّم على قلبه وفي صدره فنبوته له مشهودة وينزل علينا بين جنبينا من وراء حجابنا فهو لنا في الظهر لا في الظهور فنبوتنا مستورة عنا مع كوننا محلا لها فمن خشع تصدع ومن علم يخشى‏\n\n",
    "en": "## Chapter 110: Concerning the Station of Reverence [Khushūʿ]\n\nReverence [Khushūʿ] does not exist unless / The heart perceives the One Who descends to it,\nAnd discloses Himself to it in a similitude. / Other than this, reverence will not be found in it.\nIf the heart gains strength in the station of Theophany [al-Tajallī], / Then the ruling belongs to it, and is not imposed upon it.\n\n### [The Praiseworthy Attribute in this World for Praiseworthy People, and the Praiseworthy Attribute in the Hereafter for Blameworthy People]\n\nReverence [Khushūʿ] is the station of humiliation and lowliness [al-dhilla wa al-sighār]. It is among the attributes of created beings and has no entry point into Divinity [al-Ulūhiyya]. It is a praiseworthy attribute in this world for praiseworthy people, and it is a praiseworthy attribute in the Hereafter for people who are legally blameworthy, according to the tongue of the Real [al-Ḥaqq]. It is a spiritual state [ḥāl] that transfers in the Hereafter from the believers to the people of arrogance, the haughty tyrants who desire high status on earth—those who cause corruption on the earth.\n\nThe believers are those who, <<فِي صَلاتِهِمْ خاشِعُونَ>> (in their prayers are reverent), and they are the reverent men and reverent women <<الَّذِينَ أَعَدَّ اللهُ لَهُمْ مَغْفِرَةً وَأَجْراً عَظِيماً>> (for whom Allah has prepared forgiveness and a great reward). He described its possessors in the Hereafter, saying: <<خاشِعِينَ مِنَ الذُّلِّ يَنْظُرُونَ مِنْ طَرْفٍ خَفِيٍّ>> (Humbled by abasement, they look with a hidden glance). And He said: <<وُجُوهٌ يَوْمَئِذٍ خاشِعَةٌ * عامِلَةٌ ناصِبَةٌ * تَصْلى نَاراً حَامِيَةً * تُسْقَى مِنْ عَيْنٍ آنِيَةٍ * لَيْسَ لَهُمْ طَعَامٌ إِلَّا مِنْ ضَرِيعٍ>> (Faces on that Day will be humbled, laboring, weary, entering a scorching fire, given drink from a boiling spring. They will have no food except from *ḍarīʿ* [a thorny, bitter plant]).\n\n### [Reverence [Khushūʿ] Only Occurs Through a Theophany upon the Hearts]\n\nReverence [Khushūʿ], wherever it occurs, is only the result of a Divine Theophany [tajallī ilāhī] upon the hearts: in the believer, it arises from veneration and majesty; and in the disbeliever, it arises from subjugation, fear, and overwhelming power.\n\nThe Prophet, peace be upon him, said when asked about the solar eclipse: \"Indeed, when Allah discloses Himself to a thing, that thing becomes reverent [khashaʿa] before Him.\" (Reported by Al-Bazzar).\n\nWhen the Theophany occurs, reverence is attained. The Theophany bequeaths Knowledge [al-ʿilm], and Knowledge bequeaths Awe [al-khashya]: <<إِنَّمَا يَخْشَى اللهَ مِنْ عِبَادِهِ الْعُلَمَاءُ>> (Indeed, only those of His servants who have knowledge fear Allah).\n\n### [The Snorting and Rattling [al-ghatt wa al-ghaṭ] during the Descent of Revelation]\n\nAwe [al-khashya] gives rise to reverence [al-khushūʿ], and reverence gives rise to shattering/cracking [al-taṣadduʿ]. This shattering is the reaction of the natural disposition [al-ṭabʿ] to reverence. The shattering involves the breaking and fracturing of the limbs, and the rattling sound [al-ghaṭīṭ] heard within them—all of this is the effect of the natural disposition that is receptive to the impact of the incoming Divine Theophany. This is what the Law [al-Sharʿ] referred to as the snorting and rattling [al-ghatt wa al-ghaṭ] during the descent of the Revelation upon him, like the ringing of a bell, which was the most intense form for him. Its descent is severe upon this human structure, especially if the descent is with the Qur’an, as He said: <<وَلَوْ أَنَّ قُرْآناً سُيِّرَتْ بِهِ الْجِبَالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ>> (And if there were a Qur’an by which the mountains could be moved, or the earth could be cut into pieces).\n\nThe mountains may represent the restraining power of the natural disposition [al-ṭabʿ] whose nature is inclination, similar to the swaying motion of the earth. The earth refers to the earth of natural bodies. Or, <<أَوْ كُلِّمَ بِهِ الْمَوْتَى>> (or the dead could be spoken to by it). One type of death is ignorance. The Almighty says: <<أَوَمَنْ كَانَ مَيْتاً فَأَحْيَيْنَاهُ>> (Is he who was dead and We gave him life?). This Qur’an would bring life through the Knowledge [al-ʿilm] contained within it, and the earth would be cut into pieces by it, and the mountains would be moved by the admonition and warning contained within it.\n\n### [Every Divine Speech Has an Effect on the Recipient Location]\n\nHis use of the indefinite noun *Qur’ānan* (a Qur’an) indicates one of two things: either it refers to specific verses from it, just as the tyrant passed wind when he heard <<صَاعِقَةً مِثْلَ صَاعِقَةِ عَادٍ وَثَمُودَ>> (a thunderbolt like the thunderbolt of ʿĀd and Thamūd); or, there is another matter to which the name *Qur’an* applies linguistically, other than this one. *Law* (if) is a particle of refusal for refusal (i.e., impossibility). Is this matter within the realm of possibility so that it might exist, or is it only there by way of hypothesis and estimation?\n\nAs for us, every Divine Speech [kalām ilāhī], from a word composed of two letters up to greater combinations of letters and words attributed to Allah by virtue of being Speech, is linguistically a Qur’an. It has an effect upon the recipient location [al-maḥall] during its descent, provided that the location is prepared to be affected by its descent. If it is not prepared, then this effect is not required. The preparation of the location is that its state be one of servitude [al-ʿubūda] and perfect servitude [al-ʿubūdiyya]. Its effect in the state of perfect servitude is more complete than its effect in the state of general servitude.\n\nIf the location hears or receives the descent while the Real [al-Ḥaqq] is its hearing, the descent occurs, but no effect appears upon it, because in that state, it is the Real, and thus reverence [al-khushūʿ] is negated from it. This is a principle that applies to every attribute that has no entry point into Divinity [al-Ulūha], such as lowliness [al-dhilla], need [al-iftiqār], reverence [al-khushūʿ], fear [al-khawf], and awe [al-khashya]. The possessor of such a state is affected. Conversely, every being whose state is a Divine Attribute, such as generosity [al-karam], munificence [al-jūd], mercy [al-raḥma], and majesty [al-kibriyā’], is not affected by it at all, because it is an attribute of the Real, and thus possesses might and immunity. This principle is consistent.\n\nIndeed, some of the Qur’an has descended upon us by way of direct tasting [dhawqan], through which we understood the manner of its descent upon the Prophet, peace and blessings be upon him. We found in it an effect that we did not find merely through memorizing its letters or contemplating its meanings. It descended upon us in both states (the created and the Divine). It affected the single created state [al-ḥāl al-kawnī] but did not affect the Divine state [al-ḥāl al-ilāhī], except for a specific delight, which is necessary. As for reverence [khushūʿ], no. This is why joy, which is a form of delight, is attributed to the Most Holy Divine Presence.\n\n### [Whoever Memorizes the Qur’an Has Prophethood Enfolded Between His Sides]\n\nFurthermore, Allah has made such matters parables set forth for mankind, <<يُضِلُّ بِهِ كَثِيراً وَيَهْدِي بِهِ كَثِيراً>> (misleading many thereby and guiding many thereby). And He misleads thereby <<وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ>> (only the defiantly disobedient)—those who are outside of the two states and stripped of adherence to the two rulings. This is the state of the heedless concerning that for which they were created and that by which they were favored. Abū Yazīd did not die until he had memorized the Qur’an, which means its descent upon him by way of direct tasting [dhawqan]. Whoever memorizes the Qur’an has prophethood enfolded between his sides, as the Prophet, peace be upon him, said.\n\nThis is the difference between its descent upon the Prophet, peace and blessings be upon him, and its descent upon us. For in the case of the Prophet, peace and blessings be upon him, it was sent down upon his heart and in his breast, so his prophethood is witnessed by him. But it descends upon us between our sides, from behind our veil [ḥijāb]. Thus, for us, it is in the inner reality [al-ẓahr] but not in the outward manifestation [al-ẓuhūr]. Our prophethood is concealed from us, despite our being the location for it. Therefore, whoever is reverent [khashaʿa] shatters [taṣaddaʿa], and whoever knows [ʿalima] is filled with awe [yakhshā].",
    "ur": "(باب ایک سو دس: مقام خشوع کے بیان میں)\n\nخشوع (الخشوع) تب تک نہیں ہوتا جب تک *** قلب اس ذات کو نہ دیکھے جو اس کی طرف نازل ہوئی\nاور اس کے لیے ایک خاص صورت میں ظہور الٰہی (التجلی) نہ ہو *** اس کے علاوہ خشوع (الخشوع) اس کے پاس نہیں ہوتا\nپس اگر وہ مقام ظہور الٰہی (التجلی) میں عزت حاصل کر لے *** تو حکم اسی کا ہوتا ہے، اس پر نہیں ہوتا۔\n\n### [دنیا میں قابل تعریف لوگوں کے لیے قابل تعریف صفت، اور آخرت میں قابل مذمت لوگوں کے لیے قابل تعریف صفت]\n\nخشوع (الخشوع) ذلت (الذلة) اور پستی (الصغار) کا مقام ہے، اور یہ مخلوق کی صفات میں سے ہے؛ الوہیت میں اس کا کوئی دخل نہیں۔ یہ دنیا میں قابل تعریف لوگوں کے لیے ایک قابل تعریف صفت (النعت المحمود) ہے۔ اور یہ آخرت میں ان لوگوں کے لیے ایک قابل تعریف صفت ہے جن کی شرعاً زبان حق سے مذمت کی گئی ہے۔ یہ ایک ایسا حال ہے جو آخرت میں مومنین سے منتقل ہو کر ان متکبر، جبار اور عزت والے لوگوں کی طرف چلا جائے گا جو زمین میں فساد پھیلانے والوں میں سے ہیں اور زمین میں برتری چاہتے ہیں۔\n\nپس مومن اپنی نمازوں میں خاشع (خشوع کرنے والے) ہوتے ہیں:\n**خاشِعُونَ** (خشوع کرنے والے ہیں) (سورۃ المؤمنون: 2)\nاور وہ مردوں میں سے خشوع کرنے والے اور عورتوں میں سے خشوع کرنے والیاں ہیں جن کے لیے اللہ نے مغفرت اور عظیم اجر تیار کر رکھا ہے۔\n\nاور آخرت میں ان کے ساتھیوں کی صفت بیان کرتے ہوئے فرمایا:\n**خاشِعِينَ مِنَ الذُّلِّ يَنْظُرُونَ مِنْ طَرْفٍ خَفِيٍّ** (ذلت کے سبب ان کی نگاہیں جھکی ہوئی ہوں گی، وہ چھپی ہوئی نظر سے دیکھیں گے) (سورۃ القلم: 43)\n\nاور فرمایا:\n**وُجُوهٌ يَوْمَئِذٍ خاشِعَةٌ * عامِلَةٌ ناصِبَةٌ * تَصْلى‏ ناراً حامِيَةً * تُسْقى‏ مِنْ عَيْنٍ آنِيَةٍ * لَيْسَ لَهُمْ طَعامٌ إِلَّا مِنْ ضَرِيعٍ** (بہت سے چہرے اس دن خاشع (جھکے ہوئے) ہوں گے * محنت کرنے والے، تھکے ہوئے * وہ دہکتی ہوئی آگ میں داخل ہوں گے * انہیں کھولتے ہوئے چشمے سے پلایا جائے گا * ان کے لیے خاردار جھاڑی کے سوا کوئی کھانا نہ ہوگا) (سورۃ الغاشیۃ: 2-6)\n\n### [خشوع صرف قلوب پر ظہور الٰہی (التجلی) کے ذریعے ہی ہوتا ہے]\n\nاور خشوع (الخشوع) جہاں بھی ہو، وہ صرف قلوب پر ظہور الٰہی (التجلی) کے ذریعے ہی ہوتا ہے۔ مومن میں یہ تعظیم اور جلال کے سبب ہوتا ہے، اور کافر میں یہ قہر، خوف اور گرفت کے سبب ہوتا ہے۔\n\nجب آپ صلی اللہ علیہ وسلم سے سورج گرہن کے بارے میں پوچھا گیا تو آپ نے فرمایا:\n**إن الله إذا تجلى لشي‏ء خشع له** (بے شک اللہ جب کسی چیز پر ظہور الٰہی (التجلی) فرماتا ہے تو وہ اس کے لیے خشوع اختیار کر لیتی ہے)۔ (اسے بزار نے روایت کیا)\n\nاور جب ظہور الٰہی (التجلی) واقع ہوتا ہے تو خشوع (الخشوع) حاصل ہوتا ہے، اور ظہور الٰہی (التجلی) علم کو وراثت میں دیتا ہے، اور علم خشیت کو وراثت میں دیتا ہے۔\n**إِنَّما يَخْشَى اللهَ مِنْ عِبادِهِ الْعُلَماءُ** (بے شک اللہ سے اس کے بندوں میں سے صرف علماء ہی ڈرتے ہیں) (سورۃ فاطر: 28)\n\n### [نزول وحی کے وقت غت اور غط کی آواز]\n\nاور خشیت (الخشية) خشوع (الخشوع) عطا کرتی ہے، اور خشوع (الخشوع) تصدع (شکستگی) عطا کرتا ہے، اور یہ خشوع کے لیے طبع کا انفعال ہے۔ اور تصدع (الـتصدع) اعضاء میں ٹوٹ پھوٹ اور شکستگی ہے، اور وہ غطیط (گھراہٹ) جو ان میں سنائی دیتی ہے، یہ سب طبع کے اس اثر کا نتیجہ ہے جو ظہور الٰہی (التجلی) میں وارد ہونے والے اثر کو قبول کرنے والی ہے۔\n\nاور اسی کو شریعت نے نزول وحی کے وقت آپ صلی اللہ علیہ وسلم پر \"غت\" اور \"غط\" سے تعبیر کیا ہے، جیسے کہ گھنٹی کی آواز کا بجنا، اور یہ آپ پر سب سے زیادہ شدید ہوتا تھا۔ کیونکہ اس بشری ہیکل پر اس کا نزول شدید ہوتا ہے، خاص طور پر اگر نزول قرآن کے ساتھ ہو، جیسا کہ فرمایا:\n**وَلَوْ أَنَّ قُرْآناً سُيِّرَتْ بِهِ الْجِبالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ** (اور اگر کوئی ایسا قرآن ہوتا جس کے ذریعے پہاڑ چلائے جاتے یا زمین ٹکڑے ٹکڑے کر دی جاتی) (سورۃ الرعد: 31)\n\nاور پہاڑوں سے مراد وہ قوت ہو سکتی ہے جو طبع کو تھامے رکھتی ہے جس کا خاصہ زمین میں مائل ہونے (مید) کی طرح ہے۔ اور زمین سے مراد طبعی اجسام کی زمین ہو سکتی ہے۔\n**أَوْ كُلِّمَ بِهِ الْمَوْتى‏** (یا اس کے ذریعے مردوں سے بات کی جاتی) (سورۃ الرعد: 31)\n\nاور موت کی اقسام میں سے ایک جہالت ہے۔ ذات حق (الحق) فرماتا ہے:\n**أَ وَمَنْ كانَ مَيْتاً فَأَحْيَيْناهُ** (بھلا جو شخص مردہ تھا پھر ہم نے اسے زندہ کر دیا) (سورۃ الانعام: 122)\n\nتو یہ قرآن اپنے اندر موجود علم کے ذریعے زندہ کرتا، اور اس کے ذریعے زمین ٹکڑے ٹکڑے ہو جاتی، اور اس میں موجود ڈانٹ اور وعید کے ذریعے پہاڑ چلائے جاتے۔\n\n### [ہر کلام الٰہی کا اس محل پر اثر ہوتا ہے جس پر وہ نازل ہوتا ہے]\n\nاور اس کا قول **قُرْآناً** (قرآن) کو نکرہ (غیر معین) لانا دو باتوں میں سے ایک کی دلیل ہے: یا تو اس سے مراد اس کی مخصوص آیات ہیں، جیسا کہ اس جبار نے جب سنا تو گوز مارا:\n**صاعِقَةً مِثْلَ صاعِقَةِ عادٍ وَثَمُودَ** (عاد اور ثمود کی کڑک جیسی کڑک) (سورۃ فصلت: 13)\n\nاور یا یہ کہ وہاں کوئی اور امر ہے جس پر لغت کے اعتبار سے اس قرآن کے علاوہ بھی قرآن کا نام بولا جاتا ہے۔ اور \"لو\" (اگر) حرف امتناع لامتناع (ایک چیز کے نہ ہونے کی وجہ سے دوسری چیز کا نہ ہونا) ہے۔ تو کیا یہ امکان کے دائرے میں داخل ہے کہ وہ پایا جائے، یا وہ صرف فرض اور اندازے کے حکم سے ہی موجود ہے؟\n\nلیکن ہمارے نزدیک، ہر کلام الٰہی جو دو حروف سے مرکب کلمے سے لے کر اس سے اوپر تک حروف اور کلمات کی ترکیبوں پر مشتمل ہو، اور جسے کلام کے حکم سے اللہ کی طرف منسوب کیا جائے، وہ لغت کے اعتبار سے قرآن ہے۔ اور نزول کے وقت اس محل پر اس کا اثر ہوتا ہے جس پر وہ نازل کیا گیا ہے، بشرطیکہ اس کی استعداد میں اس کے نزول سے متاثر ہونا شامل ہو۔ اگر ایسا نہ ہو تو شرط نہیں ہے۔\n\nاور محل کی استعداد یہ ہے کہ اس کا حال عبودہ (بندگی) اور عبودیت (غلامی) کا ہو۔ اور عبودیت کے حال میں اس کا اثر عبودہ کے حال سے زیادہ مکمل ہوتا ہے۔\n\nپس اگر محل نے سنا یا اس پر نزول ہوا اس حال میں کہ ذات حق (الحق) نے اسے سنا، تو اسے نزول حاصل ہو گیا، لیکن اس پر کوئی اثر ظاہر نہیں ہوا، کیونکہ وہ اس حالت میں حق ہوتا ہے، لہٰذا اس سے خشوع (الخشوع) ختم ہو جاتا ہے۔\n\nاور یہ ایک ایسا اصول ہے جو ہر اس صفت میں جاری ہوتا ہے جس کا الوہیت میں کوئی دخل نہیں، جیسے ذلت (الذلة)، محتاجی (الافتقار)، خشوع (الخشوع)، خوف (الخوف)، اور خشیت (الخشية)۔ پس اس حال کا مالک متاثر ہوتا ہے۔\n\nاور ہر وہ وجود جس کا حال کوئی الٰہی صفت ہو، جیسے کرم، جود، رحمت، اور کبریائی، تو وہ اپنے مالک پر بالکل اثر انداز نہیں ہوتا، کیونکہ وہ صفت حق (الحق) کی ہے، لہٰذا اس کے لیے عزت اور ممانعت ہے۔ یہ اصول جاری ہے۔\n\nاور ہم پر قرآن کا نزول ذوقاً ہوا ہے، جس سے ہم نے اس کے نزول کی صورت کو اپنے نبی صلی اللہ علیہ وسلم پر جانا۔ تو ہم نے اس کے لیے وہ پایا جو ہمیں اس کے حروف کو حفظ کرنے یا اس کے معانی میں تدبر کرنے سے نہیں ملا۔ اور ہم پر دونوں حالتوں میں نزول ہوا: تو اس نے ایک کونی حال میں اثر کیا، اور الٰہی حال میں صرف ایک خاص لذت کے سوا کوئی اثر نہیں کیا، کیونکہ وہ لذت ضروری ہے، لیکن خشوع (الخشوع) کے طور پر نہیں۔ اسی لیے جناب الٰہی اقدس کی طرف وہ چیز منسوب کی جاتی ہے جو فرح (خوشی) سے منسوب کی جاتی ہے، اور وہ التذاذ (لذت حاصل کرنا) ہے۔\n\n### [جس نے قرآن کو استظہار کیا، نبوت اس کے پہلوؤں کے درمیان داخل کر دی گئی]\n\nپھر اللہ نے اس جیسی چیزوں کو لوگوں کے لیے مثالیں بنایا ہے:\n**يُضِلُّ بِهِ كَثِيراً وَيَهْدِي بِهِ كَثِيراً وَما يُضِلُّ بِهِ إِلَّا الْفاسِقِينَ** (اس کے ذریعے بہت سے لوگوں کو گمراہ کرتا ہے اور بہت سے لوگوں کو ہدایت دیتا ہے، اور اس کے ذریعے صرف فاسقوں کو ہی گمراہ کرتا ہے) (سورۃ البقرۃ: 26)\n\nجو دونوں حالتوں سے خارج ہو اور دونوں احکام سے بے تعلق ہو، اور یہ ان غافلوں کا حال ہے جو اس چیز سے غافل ہیں جس کے لیے وہ پیدا کیے گئے اور جس کے ذریعے انہیں فضیلت دی گئی۔\n\nابو یزید (بسطامی) کا انتقال نہیں ہوا جب تک کہ انہوں نے قرآن کو استظہار (ذوقاً حفظ) نہیں کر لیا، اور یہ ان پر اس کا ذوقاً نزول تھا۔ اور جس نے قرآن کو استظہار کیا، تو نبوت اس کے پہلوؤں کے درمیان داخل کر دی گئی، جیسا کہ آپ صلی اللہ علیہ وسلم نے فرمایا۔\n\nاور یہی فرق ہے آپ صلی اللہ علیہ وسلم پر اس کے نزول اور ہم پر اس کے نزول کے درمیان۔ کیونکہ نبی صلی اللہ علیہ وسلم پر یہ آپ کے قلب اور سینے پر نازل ہوا، لہٰذا آپ کی نبوت آپ کے لیے مشہود ہے۔ اور ہم پر یہ ہمارے حجاب کے پیچھے ہمارے پہلوؤں کے درمیان نازل ہوتا ہے، لہٰذا یہ ہمارے لیے ظہور میں نہیں بلکہ پشت میں ہوتا ہے۔ پس ہماری نبوت ہم سے پوشیدہ ہے، باوجود اس کے کہ ہم اس کے محل ہیں۔\n\nپس جس نے خشوع (الخشوع) کیا وہ ٹوٹ پھوٹ گیا (تصدع)، اور جس نے علم حاصل کیا وہ خشیت (الخشية) اختیار کرتا ہے۔",
    "fa": "(باب صد و دهم در مقام خشوع)\n\nخشوع (الخشوع) حاصل نگردد مگر آنگاه *** که قلب ببیند آنچه به سویش فرود آمده است\nو حق (الحق) بر او به صورتی متمثل تجلی (التجلی) کند *** جز این باشد، خشوعی نزد او نیست\nپس اگر در مقام تجلی (التجلی) عزت یابد *** حکم از آنِ اوست و بر او حکمی نیست\n\n[صفت ستوده در دنیا برای قومی ستوده، و ستوده در آخرت برای قومی نکوهیده]\n\nخشوع (الخشوع) مقام خواری (الذلة) و حقارت (الصغار) است و از صفات مخلوقین است؛ در الوهیت راهی ندارد. این صفتی ستوده در دنیا برای قومی ستوده است، و صفتی ستوده در آخرت برای قومی است که شرعاً به زبان حق (الحق) نکوهیده شده‌اند. این حالی است که در آخرت از مؤمنان به سوی اهل عزت، متکبران و جبارانی که در زمین خواهان برتری هستند و از مفسدان در زمین می‌باشند، منتقل می‌شود. پس مؤمنان «الَّذِينَ هُمْ فِي صَلَاتِهِمْ خَاشِعُونَ» (آنان که در نمازشان خشوع دارند) هستند. و ایشان مردان خاشع و زنان خاشعه‌ای هستند که «أَعَدَّ اللَّهُ لَهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا» (خداوند برایشان آمرزش و پاداشی بزرگ آماده کرده است). و در توصیف یارانش در آخرت فرمود: «خَاشِعِينَ مِنَ الذُّلِّ يَنظُرُونَ مِن طَرْفٍ خَفِيٍّ» (از خواری، دیدگانشان پنهان می‌نگرد). و فرمود: «وُجُوهٌ يَوْمَئِذٍ خَاشِعَةٌ * عَامِلَةٌ نَّاصِبَةٌ * تَصْلَى نَارًا حَامِيَةً * تُسْقَى مِنْ عَيْنٍ آنِيَةٍ * لَّيْسَ لَهُمْ طَعَامٌ إِلَّا مِن ضَرِيعٍ» (در آن روز چهره‌هایی خاشع‌اند * که عمل‌کننده و رنج‌برنده‌اند * به آتشی سوزان درآیند * از چشمه‌ای جوشان نوشانده شوند * خوراکی جز ضریع (خار خشک) ندارند).\n\n[خشوع (الخشوع) جز از طریق تجلی (التجلی) بر قلب‌ها حاصل نمی‌شود]\n\nو خشوع (الخشوع) در هر کجا که باشد، جز از تجلی (التجلی) الهی بر قلب‌ها حاصل نمی‌شود؛ در مؤمن از روی تعظیم و اجلال، و در کافر از روی قهر و ترس و سطوت.\n\nپیامبر (صلی الله علیه و سلم) هنگامی که از کسوف خورشید سؤال شد، فرمود: «إن الله إذا تجلى لشيء خشع له» (هرگاه خداوند بر چیزی تجلی (التجلی) کند، آن چیز در برابرش خشوع (الخشوع) می‌کند). (این حدیث را بزار روایت کرده است).\n\nو چون تجلی (التجلی) واقع شود، خشوع (الخشوع) حاصل می‌گردد. تجلی (التجلی) علم را به ارث می‌گذارد و علم نیز خشیت را به ارث می‌گذارد: «إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ» (همانا از میان بندگان خدا، فقط دانایان از او می‌ترسند).\n\n[صدای غت و غط در نزول وحی]\n\nو خشیت، خشوع (الخشوع) می‌بخشد و خشوع (الخشوع) تصدع (شکافته شدن) می‌بخشد. تصدع (التصدع) همان انفعال طبع در برابر خشوع (الخشوع) است. و تصدع (التصدع) به معنای شکستگی و خرد شدن در اعضا و صدای غطیطی است که در آن‌ها شنیده می‌شود. همه این‌ها از اثر طبعی است که پذیرای اثر وارد شده در تجلی (التجلی) الهی است. و این همان چیزی است که شرع از آن با «غت» و «غط» در نزول وحی تعبیر کرده است، مانند صدای زنگ (صلصلة الجرس) که شدیدترین نوع وحی بر پیامبر (صلی الله علیه و سلم) بود. زیرا نزول وحی بر این پیکر بشری سخت است، به ویژه اگر نزول قرآن باشد، چنانکه فرمود: «وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ» (و اگر قرآنی بود که کوه‌ها به وسیله آن به حرکت درمی‌آمدند یا زمین به وسیله آن قطعه قطعه می‌شد). و ممکن است منظور از کوه‌ها، نیروی نگهدارنده طبع باشد که شأن آن تمایل است، نظیر لرزش در زمین. و منظور از زمین، زمین اجسام طبیعی باشد. «أَوْ كُلِّمَ بِهِ الْمَوْتَى» (یا مردگان به وسیله آن به سخن می‌آمدند). و یکی از انواع مرگ، جهل است. خداوند متعال می‌فرماید: «أَوَمَن كَانَ مَيْتًا فَأَحْيَيْنَاهُ» (آیا کسی که مرده بود و ما او را زنده کردیم). پس این قرآن به واسطه علمی که در آن است، حیات می‌بخشد و زمین به واسطه آن قطعه قطعه می‌شود و کوه‌ها به واسطه زجر و وعیدی که در آن است، به حرکت درمی‌آیند.\n\n[هر کلام الهی در محلی که بر آن نازل می‌شود، اثری دارد]\n\nو تنکیر (نکره آمدن) کلمه «قُرْآنًا» دلیل بر یکی از دو امر است: یا اشاره به آیات مخصوصی از آن دارد، چنانکه جبار (متکبر) هنگامی که «صَاعِقَةً مِّثْلَ صَاعِقَةِ عَادٍ وَثَمُودَ» (صاعقه‌ای مانند صاعقه عاد و ثمود) را شنید، صدایی از او خارج شد؛ و یا اینکه امر دیگری وجود دارد که لغتاً نام قرآن بر آن اطلاق می‌شود، غیر از این قرآن. و «لو» حرف امتناع برای امتناع است. پس آیا این امر تحت امکان قرار می‌گیرد تا موجود شود، یا جز به حکم فرض و تقدیر وجود ندارد؟ اما نزد ما، هر کلام الهی، از کلمه‌ای مرکب از دو حرف تا بالاتر از آن از ترکیبات حروف و کلمات که به حکم کلام به خداوند نسبت داده می‌شود، لغتاً قرآن است. و این کلام در نزول بر محلی که بر آن نازل می‌شود، اثر دارد، به شرطی که آن محل استعداد تأثر از نزول آن را داشته باشد؛ و اگر نداشته باشد، شرط نیست. و استعداد محل این است که حال او عبودت (العبودة) و عبودیت (العبودية) باشد. و اثر آن در حال عبودیت (العبودية) کامل‌تر از حال عبودت (العبودة) است. پس اگر محل در حالی که حق (الحق) شنونده اوست، بشنود یا بر او نازل شود، نزول برایش حاصل می‌شود، اما اثری بر او ظاهر نمی‌شود، زیرا در آن حال، او حق (الحق) است و خشوع (الخشوع) از او منتفی می‌گردد. این اصلی است که در هر وصفی که در الوهیت راهی ندارد، مانند خواری (الذلة)، فقر (الافتقار)، خشوع (الخشوع)، خوف و خشیت، جاری است؛ زیرا صاحب این حال متأثر می‌شود. و هر کونی که حالش وصفی الهی باشد، مانند کرم، جود، رحمت و کبریا، اصلاً در صاحبش تأثیر نمی‌گذارد، زیرا آن وصف حق (الحق) است و برای او عزت و منع است. این اصل جاری است. و بر ما نیز از قرآن، ذوقاً نازل شده است و از آن، صورت نزول آن بر پیامبرش (صلی الله علیه و سلم) را شناختیم. پس برای آن چیزی یافتیم که برای حفظ حروف یا تدبر معانی آن نیافتیم. و بر ما در هر دو حال (کونی و الهی) نازل شد؛ پس در حال واحد کونی اثر گذاشت، اما در حال الهی جز لذتی خاص تأثیر نکرد، زیرا آن لذت ضروری است، اما خشوع (الخشوع) نه. و به همین دلیل است که آنچه از فرح (شادی) به جناب الهی اقدس نسبت داده می‌شود، همان التذاذ است.\n\n[هر کس قرآن را استظهار کند، نبوت میان دو پهلویش گنجانده شده است]\n\nسپس خداوند این‌گونه امور را برای مردم مَثَل‌هایی قرار داد: «يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ» (بسیاری را با آن گمراه می‌کند و بسیاری را هدایت می‌نماید، و جز فاسقان را با آن گمراه نمی‌کند). فاسق کسی است که از هر دو حال خارج و از متلبس شدن به هر دو حکم عاری است، و این حال غافلان از آن چیزی است که برایش خلق شده‌اند و از فضیلتی که به آن برتری یافته‌اند. ابویزید (بسطامی) نمرد تا اینکه قرآن را استظهار کرد، و استظهار او همان نزول ذوقی قرآن بر او بود. و هر کس قرآن را استظهار کند، «فقد أدرجت النبوة بين جنبيه» (نبوت میان دو پهلویش گنجانده شده است)، چنانکه پیامبر (صلی الله علیه و سلم) فرمود.\n\nو این تفاوت میان نزول قرآن بر پیامبر (صلی الله علیه و سلم) و نزول آن بر ماست؛ زیرا قرآن بر قلب و سینه پیامبر (صلی الله علیه و سلم) نازل شد، پس نبوتش برای او مشهود است. اما بر ما از پشت حجابمان، میان دو پهلویمان نازل می‌شود؛ پس برای ما در «ظهر» (باطن) است نه در «ظهور» (آشکار)، و نبوت ما از ما پوشیده است، با وجود اینکه محل آن هستیم. پس هر کس خشوع (الخشوع) کند، متصدع (شکافته) می‌شود، و هر کس علم یابد، خشیت می‌ورزد."
  },
  "page_count": 2
}