{
  "id": 354,
  "title": {
    "ar": "الباب الرابع والخمسون وثلاثمائة في معرفة المنزل الأقصى السرياني وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Fifty-Four: Concerning the Gnosis of the Most Remote Syriac Station (المنزل الأقصى السرياني), which is from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو چون (۳۵۴) منزل اقصی سریانی (المنزل الأقصى السرياني) کی معرفت (المعرفۃ) کے بیان میں، اور یہ حضرۃ محمدیہ (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و پنجاه و چهارم در معرفت منزل اقصای سریانی، و آن از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الرابع والخمسون وثلاثمائة في معرفة المنزل الأقصى السرياني وهو من الحضرة المحمدية»\n\n\n> معدن الآيات في العجم *** وجماع الخير في الكلم‏\n\n\n> فطرة الرحمن تطلبني *** بصنوف الحكم والحكم‏\n\n\n> فلتكن في رأس مرقبة *** كشهاب لاح في علم‏\n\n\n> فهو المزجي سحائبه *** في غمام النور والظلم‏\n\n\n> واتبع ما أنت طالبه *** وارتفع عن موضع التهم‏\n\n\n> هذي وصية صدرت *** من حديد الطرف غير عم‏\n\n\n### [أن التنزيه في العبد نظير التنزيه في الحق سواء]\n\n\nاعلم أيدك الله بروح منه أن التنزيه في العبد نظير التنزيه في الحق سواء فمن نزه الحق عند أداء ما أوجب الله عليه من العبادات في العهد الذي أخذه عليه عقلا وشرعا أشرك الله نفسه مع عبده في هذا الحكم بما أوجبه على نفسه له بما كتبه على نفسه من الرحمة به والوفاء بعهده وبرأه عن أداء ما أوجب عليه بأن كشف له عن قيام الحق عنه فيما كلفه من العمل الذي كان أهل الحجاب ينسبونه إليه ويقولون إن فلانا من الَّذِينَ يُوفُونَ بِعَهْدِ الله ولا يَنْقُضُونَ الْمِيثاقَ فبرأه الله مما قالوا وكان عند الله لهذه البراءة وجيها فقالوا عند هذا الشهود بنور الايمان لا فاعل إلا الله فقالوا قَوْلًا سَدِيداً وبمثل هذا القول أمر الله عباده المؤمنين أن يقولوه فإذا قالوه أصلح لهم أعمالهم وغفر لهم ذنوبهم ومن يُطِعِ الله ورَسُولَهُ فَقَدْ فازَ فَوْزاً عَظِيماً\nفالسعيد من حال الله بينه وبين ربوبيته وأقامه عبدا في جميع أحيانه يخاف ويرجو إيمانا ولا يخاف ولا يرجى عيانا\n\n\n> إنما العبد من يخاف ويرجو *** ليس بالعبد من يخاف ويرجى‏\n\n\n> ولهذا من كل سوء يوقى *** ولهذا عن كل فعل يزجي‏\n\n\n> فتراه بكل وجه سعيدا *** وإذا زل بالقضاء ينجى‏\n\n\n> يحشر العبد في الوفود إليه *** وإذا لم يكن بعبد فيرجى‏\n\n\n> فإذا ما نجا الذي يتقيه *** فالذي قام في المعارف أنجى‏\n\n\n> كل من تدرك الحقائق منه *** ما لديه مما لها فمنجى‏\n\n\n### [أن العالم عند الله من علم علم الظاهر والباطن‏]\n\n\nاعلم أيدك الله أن العالم عند الله من علم علم الظاهر والباطن ومن لم يجمع بينهما فليس بعالم خصوصي ولا مصطفى وسبب ذلك أن حقيقة العلم تمنع صاحبها أن يقوم في أحواله بما يخالف علمه فكل من ادعى علما وعمل بخلافه في الحال الذي يجب عليه عقلا وشرعا العمل به فليس بعالم ولا ظاهر بصورة عالم ولا تغالط نفسك فإن وبال ذلك ما يعود على أحد إلا عليك فإن قلت قد نجد من يعلم ولا يرزق التوفيق للعمل بعلمه فقد يكون العلم ولا عمل قلنا هذا غلط من القائل به لتعلم إن مسمى العلم ينطلق اسمه على ما هو علم وما ليس بعلم فإن الله تعالى يقول فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ فأعلمنا أنهم عملوا بما علموا ولكن لا أريد بالعلم إلا ما حصل عن مشاهدة المعلوم فإن حصل عن دليل فكري فليس بعلم حقيقي وإن كان في نفس الأمر علما كما\n\n\nقال النبي صَلَّى اللهُ عَليهِ وسَلَّم حين ذكر سورة في القرآن ولم يسمها ليختبر أصحابه فوقع في نفس بعض أصحابه أنها ربما تكون الفاتحة فأخبر النبي صَلَّى اللهُ عَليهِ وسَلَّم أنها الفاتحة ولم تقع للصاحب على جهة القطع فقال له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين أخبره بما وقع له ليهنك العلم‏\n\n\nفهو علم في نفس الأمر لا عند هذا الصاحب الذي وقع له ذلك فلما كان هذا كذلك ذهب من ذهب إلى القول بالعمل بخلاف العلم مع وجود العلم والصحيح إذا اختبرته وبحثت عليه وجدت الحق فيما ذهبنا إليه ولهذا\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لمن فهم عنه إن الله إذا أراد مضاء قضائه وقدره سلب ذوي العقول عقولهم حتى إذا أمضى فيهم قضاءه وقدره ردها عليهم ليعتبروا\n\n\nوليس سوى ذهاب العلم عنهم والاعتبار عمل أوجبه العلم فهذا عين ما ذهبنا إليه قال تعالى في حق قوم يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا فعملوا بما علموا وهُمْ عَنِ الْآخِرَةِ هُمْ غافِلُونَ فلم يعملوا لها فإنه أغفلهم عنها فنسوا آخرتهم فتركوا العمل لها إِنَّ في ذلِكَ\n\n\nلَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ قال تعالى آمرا وذكر يعني بالعلم من غفل عنه أو نسيه فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ وهم الذين علموا ما ثم بنور الايمان كشفا ثم إنهم غفلوا فحيل بينهم وبين ما علموه من ذلك وكان المشهود لهم ما كانوا به عالمين في وقت نسيانهم فإذا ذكروا تذكروا وقام لهم شهود ما قد كانوا علموه فنفعتهم الذكرى فعملوا بما علموا فشهد الله فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ فإذا رأيت من يدعي الايمان ويذكر فلا يقع له نفع بما ذكر به علمت أنه في الحال ليس بعالم بما آمن به فليس بمؤمن أصلا فإن شهادة الله حق وهو صادق وقد أعلمنا أن المؤمن ينتفع بالذكرى وشهدنا أن هذا لم ينتفع بالذكرى فلا بد أن نزيل عنه الايمان تصديقا لله ولا معنى للنفع إلا وجود العمل منه بما علم وما نرى أحدا يتوقف بالعمل فيما يزعم أنه عالم به إلا وفي نفسه احتمال ومن قام له في شي‏ء احتمال فليس بعالم به ولا بمؤمن بمن أخبره بذلك إيمانا يوجب له العلم مع أنك لو سألته لقال لك ما نشك في إن ما جاء به هذا الشخص حق يعني الرسول عليه السلام وأنا به مؤمن فهذا قول ليس بصحيح إلا في وقت دعواه عند بعض الناس ثم إذا خلى بفكره قام معه الاحتمال فكان ذلك الذي تخيل أنه علم أمر عرض له وبعضهم لا يزول عنه الاحتمال في وقت شهادته إن هذا حق صريح مع وجود الاحتمال وسبب هذه الشهادة بذلك أن الأمر إذا كان يحتمل أن يكون صدقا ويحتمل أن يكون كذبا فتجلى له في الوقت صدق ورده وتصديقه لذلك الذي هو به مؤمن أحد محتملات ذلك الخبر وهو كونه صدقا هذا هو المشهود له في ذلك الحال فيقطع في ذلك الوقت بصدقه‏\nوبأنه لا يشك فيه وما علم إن ذلك من تجلى أحد محتملاته فإذا غاب عنه ذلك الوارد قامت معه المحتملات على السواء فلم يترجح عنده ذلك إلا بطريق الظن لا بالعلم فانظر يا أخي ما أخفى غوائل النفس وما أعظم حجاب الجهل مع كونه عدما فكيف بنا لو كان وجود فلله الحمد والمنة وإنما نبهناك على هذا لتعلم حظك من الايمان ومنزلتك‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم يقول في الحديث الصحيح عنه لا يزني الزاني حين يزني وهو مؤمن‏\n\n\nأي مصدق بالعقاب عليه فإنه تعالى قد يغفر وإن الايمان إذا لم يعط الكشف الذي يعطيه العلم فليس بإيمان‏\n\n\n### [أن العلم يعطي العمل من خلف حجاب رقيق‏]\n\n\nفاعلم أن العلم يعطي العمل من خلف حجاب رقيق وفي حديث آخر عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في الزاني إذا زنى خرج عنه الايمان حتى صار عليه كالظلة\n\n\nولنا فيه تأويل حسن وهو أن الزاني قد تعرض لبلاء من الله ينزل عليه فيخرج الايمان حتى يصير عليه كالظلة يمنع نزول ذلك البلاء عليه إن نزل فلا تغفل يا ولي عن هذا القدر الذي نبهتك عليه أ لا ترى الله تعالى ما نصب الآيات وكثرها إلا ليحصل بها العلم لعلمه أن العلم إذا حصل لزم العمل أ لا ترى إلى شارب الدواء وهو عمل ما شربه وتجرع مرارته إلا لعلمه أن ثم دواء مزيلا لهذه العلة التي يشكو منها فيقول عسى يكون ذلك الدواء عين هذا الذي شربته فيشربه بالإمكان والترجي فكيف به لو علم أنه عين الدواء بلا شك لسارع إليه فهذا حاله مع الترجي والإمكان فإن قلت فقوله تعالى وأَضَلَّهُ الله عَلى‏ عِلْمٍ في حق من اتَّخَذَ إِلهَهُ هَواهُ قلنا إن الإله له القوة في المألوه وإله هذا هو هواه فحكم عليه وأضله عن سبيل الله وأما قوله عَلى‏ عِلْمٍ يعني من أنه أضله الله على علم لا إن الضال على علم فإن الضال هو الحائر الذي لا يعرف في أي جهة هو مطلوبه فمتعلق على علم أضله وهو العامل فيه وهو فعل الله تعالى والذي على الله إنما هو البيان خاصة قال تعالى وما كانَ الله لِيُضِلَّ قَوْماً بَعْدَ إِذْ هَداهُمْ حَتَّى يُبَيِّنَ لَهُمْ ما يَتَّقُونَ أي ليحير قوما بعد أن هداهم في أخذ الميثاق والفطرة التي ولدوا عليها حتى يبين لهم ما يتقون فإذا أبان لهم حيرهم فمنهم من حيره بالواسطة فشك في النبوة وحار فيها وما تحقق إن هذا نبي فتوقف في الأخذ عنه ومنهم من حيره في أصل النبوة هل لها وجود أم لا ومنهم من حيره فيما جاء به هذا النبي مما تحيله الأدلة النظرية فأورثهم البيان الإلهي هذه الحيرة وذلك لعدم الايمان فلم يكن لهم نور إيمان يكشف لهم عن حقيقة ما قاله الله وأبان عنه ومن لَمْ يَجْعَلِ الله لَهُ نُوراً هنا من إيمانه فَما لَهُ من نُورٍ في القيامة أَنَّ الله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ فيعمل بما علم أنه يكون كونه وما علم أنه لا يكون لم يكونه فكان عمله بعلمه قل أَنْزَلَهُ بِعِلْمِهِ والإنزال عمل أوجده العلم فلما أبان الحق ما أبانه لعباده فمنهم من رزقه الله العلم فعمل به ومنهم من حرمه الله العلم فضل وحار وشك وارتاب وتوقف وأما قوله تعالى الَّذِينَ آتَيْناهُمُ الْكِتابَ يَعْرِفُونَهُ كَما يَعْرِفُونَ أَبْناءَهُمْ فإنهم مصدقون بكتابهم وهذا النعت فيه وقد أبصروه فيعلمون أنه عين هذا النعت ولا يعرفون الشخص الذي قام به هذا النعت لجواز أنه يقوم ذلك النعت بأشخاص كثيرين فدخلهم الاحتمال في الشخص لا في النعت وأما قوله تعالى وإِنَّ فَرِيقاً مِنْهُمْ لَيَكْتُمُونَ الْحَقَّ وهُمْ يَعْلَمُونَ أنه الحق فيكتمونه عن مقلديهم وعن النبي عليه السلام أنهم عرفوه أنه صاحب هذا النعت ولا يلزم من العالم بالحق الإقرار به في الظاهر وإنما يستلزمه التصديق به في الباطن فهو مصدق به وإن كذبه باللسان فقد عمل بما علم وهو التصديق وقوله تعالى في مثل هذا واسْتَيْقَنَتْها أَنْفُسُهُمْ أنها آيات فعلموا وعملوا بما علموا وهو التيقن الذي هو استقرار العلم في النفس فلو لا ما علموا ما تيقنوا وما كل عمل يعطي عموم النجاة بل يعطي من النجاة قدرا مخصوصا من عموم أو خصوص فإن قلت فإن أهل النار قد علموا صدق الله في إنفاذ الوعيد وقالوا رَبَّنا أَخْرِجْنا نَعْمَلْ صالِحاً غَيْرَ الَّذِي كُنَّا نَعْمَلُ فلا نشك أنهم في هذه الحال حصل لهم العلم والله يقول ولَوْ رُدُّوا لَعادُوا لِما نُهُوا عَنْهُ مع هذا العلم الذوقي الذي حصل لهم قلنا لما علم الله أن هذه الدار الدنيا جعلها الله على طبيعة مخصوصة وجعل نشأة الإنسان على مزاج يقبل النسيان والغفلة وحب العاجلة ويقبل ضد هذا على حسب ما يقام فيه فعلم سبحانه أن نشأة هؤلاء الذين عينهم أنهم لو ردوا إلى الدنيا في نشأتهم التي كانوا عليها في الدنيا لعادوا إلى نسيان ما كانوا قد علموا وجعل على أعينهم غطاء على ما لو شهدوه لعلموا الأمر فعملوا له فهذا معنى لعادوا لما نهوا عنه لأن النشأة ليست إلا تلك فلو بقي لهم هذا العلم لما عادوا\n\n\nأ لا ترى النبي صَلَّى اللهُ عَليهِ وسَلَّم يقول في الصحيح عنه إنه يؤتى في القيامة بأنعم‏\nأهل الدنيا فيغمس في النار غمسة فيقال له هل رأيت نعيما قط فيقول لا والله ومعلوم أنه رأى نعيما ولكن حجبه شاهد الحال عن ذلك النعيم فنسيه وكذلك صاحب البؤس إذا غمس في الجنة غمسة يقال له هل رأيت بؤسا قط فيقول لا والله ما رأيت بؤسا قط\n\n\nفكذلك لو ردوا لكانوا بحسب النشأة والحال التي يردون فيها وأما عصاة المؤمنين فإنهم عالمون بإنفاذ الوعيد ولكن لا يعلمون فيمن فلو تعين لواحد منهم أنه هو الذي ينفذ فيه الوعيد لما قدم على سببه الذي علم أنه يحصل له إنفاذ الوعيد به وإذا جبر في اختياره فذلك لا يعلمه لأنه لا يجد ذلك من نفسه فإن الأمر في ذلك مشترك وقد تقدم قبل هذا الكلام عليه في بعض المنازل فمن شهد الجبر في اختياره علما من طريق الكشف والشهود أتى المخالفة بحكم التقدير لا بحكم الانتهاك فكان عاملا بما علم فلم يضره ذلك العمل بل هو مغفور له‏\n\n\n### [أن من العلم كهيئة المكنون لا يعلمه إلا العالمون بالله‏]\n\n\nواعلم أن هذا القدر الذي ذكرناه في هذه المسألة هو من العلم الذي ورد فيه الخبر الذي لفظه أن من العلم كهيئة المكنون لا يعلمه إلا العالمون بالله فإذا نطقوا به لم ينكره عليهم إلا أهل الغرة بالله وهذا من طريق الكشف عند أهله حديث صحيح مجمع عليه عندهم خاصة عرفوه وتحققوه فجعله كهيئة المكنون ما جعله مكنونا إذ لو كان مكنونا لانفرد به تعالى فلما لم يعلمه إلا العلماء بالله علمنا إن العلم بالله يورث العلم بما يعلمه الله فهو مستور عن العموم معلوم للخصوص ومعنى العلم بالله أنه لا يعلم فقد علمنا إن ثم ما لا يعلم على التعيين وما عداه فيمكن العلم به فأكنة هذا العلم قلوب العلماء بالله فإذا نطقوا به فيما بينهم إذ لا يصح النطق به إلا على هذا الحد واتفق أن يكون في المجلس من ليس من أهله ولا من أهل الله فإن أهل الله هم أهل الذكر وهم العلماء بالله أنكره عليهم أهل الغرة بالله فأضاف أهليتهم إلى الغرة وهم الذين يزعمون أنهم عرفوا الله فمن العلم الذي هو كهيئة المكنون وما هو بمكنون هذا العلم فإن العلم المكنون يعلم شهودا ولا ينقال بخلاف علوم الفكر فإنها كلها تنقال فإذا حصلت أيضا لصاحب الكشف من غير فكر ولا روية فإنها تنقال من غير دليل فيقبلها منه العالم بالدليل فهذا العلم هو الذي كهيئة المكنون لأن العالم به غير عالم بالدليل فاعلم إن الديار داران دار تسكنها الأرواح الناطقة وهو البدن الطبيعي المسوي المعدل الذي خلقه الله بيديه ووجه عليه صفتيه فلما أنشأه أسكنه دار أخرى هي دار الدار وقسم سبحانه دار الدار قسمين قسما سماه الدنيا وقسما سماه الآخرة ثم علم ما يصلح لسكنى كل دار من الساكنين الذين هم ديار النفوس الناطقة فخلق للدار الدنيا لفنائها وذهاب عينها وتبدل صورتها ووضعها وشكلها وخفاء حياتها ساكنا هو هذه الدار التي أسكنها النفس الناطقة فجعل هذه النشأة مثل دار سكناها خفية الحياة فانية ذاهبة العين متبدلة الصورة والوضع والشكل فاتصف ساكنها وهو النفس الناطقة بالجهل والحجاب والشك والظن والكفر والايمان وذلك لكثافة هذه الدار التي هي نشأته البدنية وحال بينه وبين شهود الله وجعله في حجر أمه ترضعه وتقوم به فما شهد من حين أسكن هذه النشأة سوى عين أمه حتى أنه جهل أباه بعض الساكنين ولو لا إن الله من عليه بالنوم وجعل له في ذلك أمرا يسمى الرؤيا في قوة تسمى الخيال فإذا نام كأنه خرج عن هذه النشأة فنظر إليه أبوه وسر به وألقى إليه روحا وآنسه وبادرت إليه الأرواح وتراءى له الحق من تنزيهه وبدا له ذلك كله في أجساد ألف شهودها من جنس دار نشأته التي فارقها بالنوم فيظن في النوم أنه في دار نشأته التي ألفها ويعرفها ويظن في كل ما يراه في تلك المواد أنها على حسب ما شهدها فهذا القدر هو الذي له في هذه النشأة الدنيا من الأنس بأبيه وإخوانه من الأرواح ومن الأنس بربه ومنهم من يتقوى في ذلك بحيث إنه يرى ذلك في يقظته وأعطاه علما سماه علم التعبير عبر به في مشاهدة تلك الصور إلى معانيها فإذا أراد الله أن يخلي هذه الدار الدنيا من هذه النشأة التي هي دار النفس الناطقة أرحل عن هذه النشأة روحها المدبر لها وأسكنه صورة برزخية من الصور\n\n\nالتي كان يلبسها في حال النوم فإذا كان يوم القيامة وأراد الله أن ينقله إلى الدار الأخرى دار الحيوان وهي دار ناطقة ظاهرة الحياة ثابتة العين غير زائلة أنشأ لهذه النفس الناطقة دارا من جنس هذه الدار الأخرى مجانسة لها في صفتها لأنها لا تقبل ساكنا لا يناسبها فخلق نشأة بدنية طبيعية للسعداء عنصرية للأشقياء فسواها فعدلها ثم أسكنها هذه النفس الناطقة فأزال عنها حجب العمي والجهل والشك والظن وجعلها صاحبة علم ونعيم دائم وأراها أباها ففرحت به وأراها خالقها ورازقها وعرف بينها وبين إخوتها وانتظم الشمل بالأحباب‏\nوأشهدها كل شي‏ء كان في الدار الأولى غائبا وأسكن هذه النشأة الدار الأخرى المسماة جنة منها فإنه قسم الدار الأخرى إلى منزلين هذا هو المنزل الواحد والمنزل الآخر المسمى جهنم جعل نشأة بدن أنفسها الناطقة عنصرية تقبل التغيير وأصحبها الجهل وسلب عنها العلم فأعطى جهل المؤمنين من أهل التقليد من كان من أهل هذه الدار دار الشقاء عالما بدقائق الأمور فدخل بذلك الجهل النار إذ كان من أهلها وهي لا تقبل العلماء وأعطى هذا العالم الذي كان في الدنيا عالما بدقائق الأمور ولم يكن من أهل الجنة جهل المؤمن المقلد فإن الجنة ليست بدار جهل فيرى المؤمن الأبله المقلد ما كان عليه من الجهل على ذلك العالم فيستعيذ بالله من تلك الصفة ويرى قبحها ويشكر الله على نعمته التي أعطاه إياها بما كساه وخلع عليه من علم ذلك العالم الذي هو من أهل النار وينظر إليه ذلك العالم فيزيد حسرة إلى حسرته ويعلم أن الدار أعطت هذه الحقائق لنفسها فيقول يا لَيْتَنا نُرَدُّ ولا نُكَذِّبَ بِآياتِ رَبِّنا ونَكُونَ من الْمُؤْمِنِينَ لعلمهم إذ كانوا مؤمنين وإن كانوا جاهلين أنهم إذا انتقلوا إلى دار السعادة خلعت عنهم ثياب الجهالة وخلع عليهم خلع العلم فلا يبالون بما كانوا عليه من الجهل في الدنيا لحسن العاقبة وما علموا أنهم لو ردوا إلى الدنيا في النشأة التي كانوا عليها لعادوا إلى حكمها فإن الفعل بالخاصية لا يتبدل فما تكلموا بما تكلموا به من هذا التمني إلا بلسان النشأة التي هم فيها وتخيلوا أن ذلك العلم يبقى عليهم وما جعل الله في هذه النشأة الدنيا النسيان للعلماء بالشي‏ء فيما قد علموه ويعلمون أنهم قد كانوا علموا أمرا فيطلبون استحضاره فلا يجدونه بعد ما كانوا عالمين به إلا أعلاما وتنبيها أَنَّهُ عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ بأن يسلب عنهم العلم بما كانوا به عالمين إذا دخلوا النار يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ وهو قوله تعالى قُلِ اللَّهُمَّ مالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ من تَشاءُ وأي ملك أعظم من العلم وهو ما أعطاه من العلم للمؤمن المقلد الجاهل السعيد في الدار الآخرة وتَنْزِعُ الْمُلْكَ مِمَّنْ تَشاءُ وأي ملك أفضل من العلم فينزعه من العالم غير المؤمن الذي هو من أهل النار وتُعِزُّ من تَشاءُ بذلك العلم وتُذِلُّ من تَشاءُ بانتزاع ذلك العلم منه‏\n\n\n> لما علمت بأن الله كلفني *** علمت أني مسئول ومقصود\n\n\n> وإنني لا أزال الدهر أعبده *** دنيا وآخرة والحق معبود\n\n\n> وما تجلى لشي‏ء من خليقته *** إلا ويشهد أن الحق مشهود\n\n\n> من عين صورته لا من حقيقته *** فالأمر والشأن موجود ومفقود\n\n\n> لأننا بعيون الوجه نبصره *** وكلنا وجهه والوجه محدود\n\n\n> هو الوجود ومن في الكون صورته *** فليس ثم سوى الرحمن موجود\n\n\n> الدار داران دار الدار يعمرها *** دار اللطيف فما في الكون تجريد\n\n\nولو لا أن الحقائق تعطي أن المال إلى الرحمة في الدار الأخرى فيرحمه معنى وحسا فثم من تكون الرحمة به عين العافية لا غير وارتفاع الآلام وهذا مخصوص بأهل النار الذين هم أهلها فهم لا يموتون فيها لما حصل لهم فيها من العافية بزوال الآلام فاستعذبوا ذلك فهم أصحاب عذاب لا أصحاب ألم ولا يحيون أي ما لهم نعيم كنعيم أهل الجنان الذي هو أمر زائد على كونهم عافاهم من دار الشقاء\n\n\n> في القلب منك لهيب ليس يطفيه *** إلا الذي بشهود الحس ينشيه‏\n\n\n> إني أخاف على الأشراف من شرف *** فمن يمر على قلبي فينبيه‏\n\n\n> إذا أتى صاحب العاهات يطلبه *** فإنه بشهود الحال يبريه‏\n\n\n> وما يعيد على قلبي تنعمه *** إلا الذي كان قبل اليوم يبديه‏\n\n\n### [أن العلم هو السعادة]\n\n\nواعلم أنه من زعم اليوم أن العلم هو السعادة فإنه صادق بأن العلم هو السعادة وبه أقول ولكن فاته ما أدركه أهل الكشف وهو أنه إذا أراد الله شقاوة العبد أزال عنه العلم فإنه لم يكن العلم له ذاتيا بل اكتسبه وما كان مكتسبا فجائز زواله ويكسوه حلة الجهل فإن عين انتزاع العلم جهل ولا يبقى عليه من العلم إلا العلم بأنه قد انتزع عنه العلم فلو لم يبق الله تعالى عليه هذا العلم‏\nبانتزاع العلم لما تعذب فإن الجاهل الذي لا يعلم أنه جاهل فارح مسرور لكونه لا يدري ما فاته فلو علم أنه قد فاته خير كثير ما فرح بحاله ولتالم من حينه فما تألم إلا بعلمه ما فاته أو مما كان عليه فسلبه ولقد أصابني ألم في ذراعي فرجعت إلى الله بالشكوى رجوع أيوب عليه السلام أدبا مع الله حتى لا أقاوم القهر الإلهي كما يفعله أهل الجهل بالله ويدعون في ذلك أنهم أهل تسليم وتفويض وعدم اعتراض فجمعوا بين جهالتين ولما تحققت ما حققني الله به في ذلك الوجع قلت‏\n\n\n> شكوت منه ومن ذراعي *** وذاك مني لضيق باعي‏\n\n\n> فقلت للنفس تدعيه *** فأين دعواك في اتساعي‏\n\n\n> قالت أنا أشتكيك منه *** له فضري عين انتفاعي‏\n\n\n> لو لا التشكي مما أقاسي *** خرجت عنه وعن طباعي‏\n\n\n> وذاك جهل يدريه قلب *** صاحب حال بالاتباع‏\n\n\n> لو لا شر ودي عنه بجهلي *** لما دعاني إليه داع‏\n\n\n> فقلت لبيك من دعاني *** فقال أبغي عين المتاع‏\n\n\n> قد نفق الشوق فاغتنمه *** فعين وصلى عين انقطاعي‏\n\n\n> فخف عني ما كنت أجده *** وغاب عني ما كنت أشهده‏\n\n\n> فلو لا وجود العقل ما كنت أدريه *** ولو لا وجود اللوح ما كنت أمليه‏\n\n\n> ولو لا شهود الكون ما كنت أوفيه *** ولو لا حصول العلم ما كنت أجريه‏\n\n\n> فمن قال إن الخلق يعرف كونه *** فما عنده علم بما حقه فيه‏\n\n\n> ويكفيه هذا القدر من جهله بما *** هو الأمر في عين الحقيقة يكفيه‏\n\n\nإذا انكشفت الحقائق فلا ريب ولا مين وبان صبحها لذي عينين كان الاطلاع وارتفع النزاع وحصل الاستماع ولكن بينك وبين هذه الحال مفاوز مهلكة وبيداء معطشة وطرق دارسة وآثار طامسة يحار فيها الخريت فلا يقطعها إلا من يحيي ويميت لا من يحيا ويموت فكيف حال من يقاسي هذه الشدائد ويسلك هذه المضايق ولكن على قدر آلام المشقات يكون النعيم بالراحات وما ثم بيداء ولا مفازة سواك فأنت حجابك عنك فزل أنت وقد سهل الأمر فمن علم الخلق علم الحق ومن جهل البعض من هذا الشأن جهل الكل فإن البعض من الكل فيه عين الكل من حيث لا يدري فلو علم البعض من جميع وجوهه علم الكل فإن من وجوه كونه بعضا علم الكل وهذا المنزل من المنازل التي كثرت آياتها واتضحت دلالاتها ولكن الأبصار في حكم أغطيتها والقلوب في أكنتها والعقول مشغولة بمحاربة الأهواء فلا تتفرغ للنظر المطلوب منها وفي هذا المنزل من العلوم علم مقاومة الأعداء وتقابل الأهواء بالأهواء فإن العقول إن لم تدفع الهوى بالهوى لم تحصل على المقصود فإن النفوس ما اعتادت إلا الأخذ عن هواها فإذا كان العقل عالما بالسياسة حاذقا في إنشاء الصور أنشأ للنفس صورة مطلوبه في عين هواها فقبلته قبول عشق فظفر بها وفيه علم خواص الأعداد والحروف وفيه علم بسائط الأعداد وما حكمها فيما تركب منها وهل يبقى فيها مع التركيب خواصها التي لها من كونها بسائط أم لا وفيه علم الظروف الزمانية وبيد من هي وفيه علم الزمان المستقبل إذا كان حالا ما حكمه وفيه علم أحدية العلم وما ينسب إليه من الكثرة ليس لعينه وإنما ذلك لمتعلقاته وفيه علم ما ينتجه النظر الفكري في الظروف المكانية وفيه علم آجال الأكوان في الدنيا والآخرة مع كون الآخرة لا نهاية لها وعموم قوله كُلٌّ يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى فلا بد لكل شي‏ء من غاية والأشياء لا يتناهى وجودها فلا تنتهي غاياتها فالله يجدد في كل حين أشياء وكل شي‏ء له غاية تلك الغاية هي أجله المسمى فليس الأجل إلا لأحوال الأعيان والأعيان غايتها عين لا غاية وفيه علم الحقيقة والمجاز والاعتبار ومم يعبر وإلى ما ذا يعبر وما فائدة ذلك وفيه علم عمارة الدارين وهو الذي ذكرنا منه طرفا في هذا الباب وما استوفيناه وفيه علم اختلاف أحكام أحوال الساعة وفيه علم اختلاف المكلفين في أحوالهم وأن الله يخاطب كل صنف من حيث ما هو ذلك الصنف عليه لا يزيده‏\nعلى ذلك وفيه علم يقضي بأن الأمر بدء كله لا إعادة فيه وفيه علم كون الحق ينزل في الخطاب إلى فهم المخاطب وكله حق وإن تناقض وظهر فيه تقابل فثم عين واحدة تجمعه كالسواد والبياض ضدان متقابلان يجمعهما اللون وكالألوان حقائق مختلفة يجمعهن العرض وفيه علم التوحيد بعين التشبيه وفيه علم التفضيل وفيه علم حكم كلمات الله حكم خلق الله وفيه علم تكوين الأعمال الكونية وإقامتها صورا وفيه علم الجمع والوجود وفيه علم ما تقتضيه النشأة الطبيعية من الأحكام وفيه علم العلل والأسباب والجزاء وفيه علم الفرق بين أسباب الدنيا وأسباب الآخرة وفضل أسباب الدنيا عليها وفيه علم ما يعود على الإنسان من عمله وما يضيف إلى الله من ذلك يضيفه إلى نفسه وفيه علم التكوين الإلهي من الأسباب الكونية وهي الآثار العلوية البرزخية لا غير وفيه علم تغير الأحوال لتغير الحركات الفلكية وفيه علم حال الحيوان من حين نشأته إلى حين موته وفيه علم القياس الإلهي وفيه علم تأثير الكون في الكون وعلم ما يتقي به ذلك التأثير وفيه علم القيامة وأحوالها ومراتبها وفيه علم أمر العالم بجملته وفيه علم فضل أهل النواميس الإلهية على أهل النواميس العقلية الحكمية فهذا ذكر أكثر ما يحوي عليه هذا المنزل من العلوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 354: Concerning the Knowledge of the Syriac Utmost Station, which is from the Muhammadan Presence (الحضرة المحمدية).\n\nThe mine of signs (آيات) among the non-Arabs,\nAnd the sum of goodness in the words.\n\nThe primordial nature (فطرة) of the All-Merciful seeks me,\nWith various kinds of wisdom and rulings.\n\nSo be at the peak of a watchtower,\nLike a meteor flashing over a mountain peak.\n\nFor He is the one who drives His clouds,\nIn the mist of light and darkness.\n\nAnd follow what you seek,\nAnd rise above the place of suspicion.\n\nThis is an injunction issued,\nBy one sharp of sight, not blind.\n\n### That the declaration of Divine Transcendence (التنزيه) in the servant is exactly like the declaration of Divine Transcendence in The Real (الحق).\n\nKnow, may Allah support you with a spirit from Him, that the declaration of Divine Transcendence (التنزيه) in the servant is exactly like the declaration of Divine Transcendence in The Real (الحق). Whoever declares The Real (الحق) transcendent when performing the acts of worship (العبادات) Allah has obligated upon him, in the covenant taken from him rationally and legally, Allah associates Himself with His servant in this ruling by what He has obligated upon Himself for the servant—namely, the mercy He has inscribed upon Himself for him and the fulfillment of His covenant. He absolves the servant from performing what was obligated upon him by unveiling (كشف) to him that The Real (الحق) acts on his behalf in the duty assigned to him, which the people of the veil (أهل الحجاب) used to attribute to the servant. They say that so-and-so is among <<those who fulfill the covenant of Allah and do not break the compact>>. Thus, Allah absolves him from what they said, and by virtue of this absolution, he becomes honored (وجيها) in the sight of Allah. At this witnessing (الشهود), illuminated by the light of faith, they say: 'There is no doer but Allah.' They have thus spoken <<a sound word (قولاً سديداً)>>. Allah commanded His believing servants to speak a similar word. If they say it, He will amend their deeds and forgive their sins. <<And whoever obeys Allah and His Messenger has certainly achieved a great triumph.>>\n\nThe felicitous one is he between whom and his own lordship Allah intervenes, establishing him as a servant (عبدا) in all his moments, fearing and hoping by faith (إيمانا), and neither fearing nor hoping by direct vision (عيانا).\n\nThe servant (العبد) is only he who fears and hopes;\nHe is not the servant who is feared and hoped for.\n\nThe former is protected from all evil,\nAnd the latter is driven away from every act.\n\nYou see him happy in every aspect,\nAnd if he slips, he is saved by the Divine Decree (القضاء).\n\nThe servant is gathered among the delegations to Him,\nBut if he is not a servant, he is hoped for.\n\nIf the one who fears Him is saved,\nThen the one established in gnosis (المعارف) is more saved.\n\nEveryone from whom the Realities (الحقائق) are realized—\nWhat he possesses of them is a means of salvation.\n\n### That the truly knowledgeable person (العالم) in the sight of Allah is he who knows the knowledge of the Outer (الظاهر) and the Inner (الباطن).\n\nKnow, may Allah support you, that the truly knowledgeable person (العالم) in the sight of Allah is he who knows the knowledge of the Outer (الظاهر) and the Inner (الباطن). Whoever does not combine the two is neither a specialized gnostic nor one of the chosen. The reason for this is that the Reality of Knowledge (حقيقة العلم) prevents its possessor from acting in a way that contradicts his knowledge in circumstances where action is required of him rationally and legally. Therefore, anyone who claims knowledge (علما) yet acts contrary to it in the state where he is obligated to act, is not truly knowledgeable, nor does he appear in the form of a knowledgeable person. Do not deceive yourself, for the consequence of that will return only upon you. If you say, \"We find those who possess knowledge but are not granted the divine enabling grace (التوفيق) to act upon it, so knowledge may exist without action,\" we say this is an error on the part of the speaker. You must know that the term *knowledge* (العلم) is applied both to what is truly knowledge and to what is not. For Allah the Exalted says: <<So turn away from him who turns away from Our remembrance and desires not except the worldly life. That is the extent of their knowledge (مَبْلَغُهُمْ من الْعِلْمِ)>>. He informed us that they acted upon what they knew, but I only mean by knowledge that which results from the witnessing (مشاهدة) of the known object. If it results from intellectual deduction (دليل فكري), it is not true knowledge (علم حقيقي), even if it is knowledge in reality (في نفس الأمر), just as the Prophet, peace and blessings be upon him, said when he mentioned a Surah in the Quran without naming it, in order to test his Companions. It occurred to the mind of one of the Companions that it might be Al-Fatiha, and the Prophet, peace and blessings be upon him, informed him that it was Al-Fatiha, though the Companion had not reached certainty (القطع). When the Messenger of Allah, peace and blessings be upon him, informed him of what had occurred to him, he said: \"May the knowledge be pleasing to you (ليهنك العلم).\"\n\nThus, it was knowledge in reality, but not in the possession of that Companion who had merely thought of it. Since this is the case, those who hold the view that action can contradict knowledge while knowledge exists have gone astray. The correct view, if you test it and investigate it, is what we have adopted. For this reason, the Messenger of Allah, peace and blessings be upon him, said to one who understood him: \"When Allah wills the execution of His decree (قضائه) and destiny (قدره), He strips the minds of the intelligent of their intellects, until, when He has executed His decree and destiny upon them, He restores their intellects so they may reflect.\"\n\nThis is nothing other than the departure of knowledge from them, and reflection (الاعتبار) is an action necessitated by knowledge. This is exactly what we have adopted. Allah the Exalted says concerning a people: <<They know the apparent (ظاهراً) of the worldly life>>—so they acted upon what they knew—<<but they are heedless of the Hereafter>>—so they did not act for it, because He made them heedless of it, and they forgot their Hereafter, thus abandoning action for it. <<Indeed, in that is a reminder (لَذِكْرَى) for whoever has a heart or lends an ear while he is a witness (شَهِيدٌ)>>. Allah the Exalted commands and mentions, meaning by knowledge that which one has forgotten or been heedless of: <<For indeed, the reminder benefits the believers (الْمُؤْمِنِينَ)>>. These are those who knew what was there by the light of faith (نور الايمان) through unveiling (كشفا), but then they became heedless, and an obstruction was placed between them and what they knew. What was witnessed for them was what they had known at the time of their forgetfulness. When they are reminded, they remember, and the witnessing of what they had known is established for them, so the reminder benefits them, and they act upon what they knew. Thus, Allah testified: <<For indeed, the reminder benefits the believers.>> If you see someone who claims faith (الايمان) and is reminded, yet receives no benefit from the reminder, you know that in that state he is not knowledgeable of what he believes in, and thus is not a believer (مؤمن) in principle. For the testimony of Allah is true, and He is truthful, and He informed us that the believer benefits from the reminder. We witness that this person did not benefit from the reminder, so we must remove the attribute of faith from him, in confirmation of Allah. The meaning of benefit is nothing other than the existence of action from him based on what he knows. We do not see anyone hesitate in acting upon what he claims to know except that there is a possibility (احتمال) in his soul. And whoever has a possibility established in his soul concerning something is neither knowledgeable of it nor a believer in the one who informed him of it, with a faith that necessitates knowledge. Yet, if you were to ask him, he would say, \"We do not doubt that what this person brought is true\"—meaning the Messenger, peace be upon him—\"and I am a believer in it.\" This statement is not correct except at the time of his claim before some people. Then, when he is alone with his thought, the possibility arises with him, and that which he imagined to be knowledge was merely a passing state (أمر عرض له). Some people do not lose the possibility even when they testify that this is manifest truth, despite the existence of the possibility. The reason for this testimony is that when a matter can possibly be true and possibly be false, and the truth of it manifests to him at that moment, his affirmation and confirmation of that which he believes is one of the possibilities of that report—namely, its being true. This is what is witnessed for him in that state, and he decides at that moment that it is true and that he has no doubt about it. He does not know that this is merely the manifestation (تجلي) of one of its possibilities. When that incoming state (الوارد) departs from him, the possibilities stand equally, and that matter is not preponderant for him except by way of conjecture (الظن), not by knowledge (العلم). Look, my brother, at how hidden are the pitfalls of the soul, and how great is the veil of ignorance (الجهل), despite its being a non-existence (عدما). How would it be if it were an existence? Praise and gratitude belong to Allah. We have only alerted you to this so that you may know your share of faith and your station.\n\nFor the Prophet, peace and blessings be upon him, says in the authentic Hadith: \"The adulterer does not commit adultery while he is a believer.\"\n\nThat is, a believer who affirms the punishment for it, for Allah may forgive. If faith does not grant the unveiling (الكشف) that knowledge grants, then it is not faith.\n\n### That Knowledge (العلم) yields action (العمل) from behind a thin veil.\n\nKnow that knowledge yields action from behind a thin veil. In another Hadith from the Messenger of Allah, peace and blessings be upon him, concerning the adulterer: \"When he commits adultery, faith departs from him until it becomes like a cloud (كالظلة) over him.\"\n\nWe have a good interpretation (تأويل حسن) of this, which is that the adulterer exposes himself to a trial (بلاء) from Allah that may descend upon him, so faith departs until it becomes like a cloud over him, preventing the descent of that trial upon him if it were to descend. Do not be heedless, O friend, of this point to which I have alerted you. Do you not see that Allah the Exalted only established the signs (الآيات) and multiplied them so that knowledge might be attained, knowing that when knowledge is attained, action becomes necessary? Do you not see the one who drinks medicine? He only drinks it and swallows its bitterness because of his knowledge that there is a medicine that removes the ailment he complains of. He says, \"Perhaps that medicine is exactly this one I have drunk,\" so he drinks it based on possibility (الإمكان) and hope (الترجي). How would it be if he knew, without a doubt, that it was the exact medicine? He would rush to it. This is his state with hope and possibility. If you say, then what about His saying, the Exalted, <<And Allah misguided him upon knowledge (وَأَضَلَّهُ اللهُ عَلَى عِلْمٍ)>> concerning the one who <<took his own desire as his god>>? We say that the god (الإله) has power over the object of worship (المألوه). The god of this person is his desire (هواه), so it ruled him and misguided him from the path of Allah. As for His saying <<upon knowledge (عَلَى عِلْمٍ)>>, it means that Allah misguided him *knowing* that He was doing so, not that the misguided person is upon knowledge. For the misguided person (الضال) is the confused one (الحائر) who does not know in which direction his goal lies. The phrase \"upon knowledge\" relates to the misguiding agent, which is the Act of Allah the Exalted. What is incumbent upon Allah is only the clarification (البيان). Allah the Exalted says: <<And Allah would not let a people stray after He had guided them until He had made clear to them what they should avoid.>> That is, He would not confuse a people after He had guided them through the taking of the covenant and the primordial nature (الفطرة) upon which they were born, until He clarifies to them what they should avoid. When He clarifies it to them, He confuses them. Some are confused by the intermediary, so they doubt the prophethood and are perplexed by it, and do not ascertain that this is a prophet, so they hesitate to take from him. Some are confused about the very principle of prophethood—whether it exists or not. Others are confused about what this prophet brought that intellectual proofs deem impossible. Thus, the Divine clarification (البيان الإلهي) bequeathed this confusion to them, due to the absence of faith. They lacked the light of faith (نور إيمان) that would unveil to them the reality of what Allah said and clarified. And whoever <<Allah has not made for him light>> here, from his faith, <<for him there is no light>> in the Resurrection. <<Indeed, Allah is Knower of all things (عَلِيمٌ)>>. So He acts upon what He knows will exist, and what He knows will not exist, He does not bring into existence. Thus, His action is based on His knowledge. Say: <<He sent it down with His knowledge (أَنْزَلَهُ بِعِلْمِهِ)>>, and the sending down is an act necessitated by knowledge. When The Real (الحق) clarified what He clarified to His servants, some were granted knowledge by Allah, so they acted upon it, and some were deprived of knowledge by Allah, so they went astray, were confused, doubted, were suspicious, and hesitated. As for His saying, the Exalted: <<Those to whom We gave the Scripture know him as they know their own sons>>, they affirm their Scripture, and this description is in it. They perceive it and know that it is the very description, but they do not know the specific person (الشخص) to whom this description applies, because that description might apply to many people. Thus, doubt entered them concerning the person, not the description. As for His saying, the Exalted: <<And indeed, a party of them conceal the truth while they know (يَعْلَمُونَ)>> that it is the truth, so they conceal it from their followers and from the Prophet, peace be upon him, that they recognized him as the possessor of this description. The one who knows the truth is not necessarily required to affirm it outwardly; rather, it necessitates affirming it inwardly. So he affirms it, even if he denies it with his tongue, for he has acted upon what he knew, which is affirmation. And His saying, the Exalted, in a similar context: <<And their souls were convinced thereof (وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ)>> that they were signs. So they knew and acted upon what they knew, which is certainty (التيقن), the settling of knowledge in the soul. Had they not known, they would not have been certain. Not every action grants universal salvation, but it grants a specific measure of salvation, whether general or specific. If you say, \"The people of the Fire (أهل النار) knew the truth of Allah in executing the threat, and they said: <<Our Lord, remove us; we will do righteousness other than what we were doing>>. We do not doubt that in this state they attained knowledge. Yet Allah says: <<But if they were returned, they would return to that which they were forbidden>> despite this experiential knowledge (العلم الذوقي) they attained,\" we say: Since Allah knew that this worldly abode (الدار الدنيا) was created upon a specific nature, and the human constitution (نشأة الإنسان) was created upon a temperament that accepts forgetfulness, heedlessness, and love of the immediate, and accepts the opposite of this according to what is established within it, He knew, glory be to Him, that the constitution of those whom He designated was such that if they were returned to the world in the constitution they had, they would return to forgetting what they had known. He placed a covering over their eyes, which, if they witnessed, they would know the matter and act for it. This is the meaning of <<they would return to that which they were forbidden>>, because the constitution is none other than that. If this knowledge had remained with them, they would not have returned.\n\nDo you not see that the Prophet, peace and blessings be upon him, says in the authentic Hadith concerning the Day of Resurrection, that the most affluent person in the world will be brought and dipped once into the Fire, and then it will be said to him: \"Did you ever see any bliss?\" He will say: \"No, by Allah.\" It is known that he did see bliss, but the witnessing of the present state (شاهد الحال) veiled him from that bliss, so he forgot it. Likewise, the person of utmost misery, when dipped once into Paradise, will be asked: \"Did you ever see any misery?\" He will say: \"No, by Allah, I never saw any misery.\"\n\nSimilarly, if they were returned, they would be according to the constitution and state into which they were returned. As for the sinful believers (عصاة المؤمنين), they know that the threat will be executed, but they do not know upon whom. If it were determined for one of them that he was the one upon whom the threat would be executed, he would not proceed to the cause which he knows will result in the execution of the threat upon him. If he is compelled (جبر) in his choice (اختياره), he does not know that, because he does not find that from himself, for the matter in that is shared. We have already discussed this in some of the Stations (المنازل). Whoever witnesses compulsion in his choice through knowledge derived from unveiling (الكشف) and witnessing (الشهود) commits the transgression by the ruling of predestination (التقدير), not by the ruling of violation (الانتهاك). Thus, he is acting upon what he knows, and that action does not harm him; rather, it is forgiven for him.\n\n### That some knowledge is like a hidden treasure (مكنون), known only to those who know Allah (العالمون بالله).\n\nKnow that this measure we have mentioned in this issue is part of the knowledge concerning which the report came, the wording of which is: \"Some knowledge is like a hidden treasure (كهيئة المكنون), known only to those who know Allah (العالمون بالله). When they speak of it, no one denies it except the people of delusion concerning Allah (أهل الغرة بالله).\" This is an authentic Hadith, agreed upon among its people through the path of unveiling (الكشف), who have known and verified it specifically. He made it *like* a hidden treasure, but did not make it *hidden* (مكنونا), for if it were hidden, Allah alone would possess it. Since only those who know Allah know it, we know that knowledge of Allah bequeaths knowledge of what Allah knows. Thus, it is veiled from the general public (العموم) but known to the elite (الخصوص). The meaning of knowledge of Allah is that He is not known [in His Essence]. Thus, we know that there is something that is not known specifically, and everything else can be known. The hearts of those who know Allah are the repositories (أكنة) of this knowledge. When they speak of it among themselves—since it is only proper to speak of it within this limit—and it happens that there is someone in the assembly who is not one of its people, nor one of the People of Allah (أهل الله)—for the People of Allah are the People of Remembrance (أهل الذكر) and those who know Allah—the people of delusion concerning Allah deny it. Thus, He attributes their belonging to delusion (الغرة), and they are those who claim to have known Allah. This knowledge is that which is *like* a hidden treasure, but it is not the hidden treasure itself. For the truly hidden knowledge (العلم المكنون) is known by witnessing (شهودا) but cannot be articulated, unlike the sciences of intellectual thought (علوم الفكر), all of which can be articulated. If this knowledge is also attained by the possessor of unveiling without thought or reflection, it can be articulated without proof, and the one who knows the proof accepts it from him. This knowledge is that which is *like* a hidden treasure, because the one who knows it does not know the proof.\n\nKnow that the Abodes (الديار) are two: an abode inhabited by the rational spirits (الأرواح الناطقة), which is the natural, balanced, and perfected body (البدن الطبيعي) that Allah created with His two hands and upon which He directed His two Attributes. When He originated it, He settled it in another abode, which is the Abode of the Abode (دار الدار). The Exalted divided the Abode of the Abode into two sections: one He called the World (الدنيا) and one He called the Hereafter (الآخرة). Then He knew what was suitable for the dwelling of each abode among the inhabitants, who are the abodes of the rational souls (النفوس الناطقة). For the worldly abode, due to its transience (فنائها), the departure of its essence, the change of its form, position, and shape, and the hiddenness of its life, He created an inhabitant, which is this abode that the rational soul inhabits. He made this constitution (النشأة) like its dwelling abode: hidden in life, transient, departing in essence, changing in form, position, and shape. Thus, its inhabitant, the rational soul, was characterized by ignorance (الجهل), the veil (الحجاب), doubt (الشك), conjecture (الظن), disbelief, and faith. This is due to the density (كثافة) of this abode, which is its bodily constitution. He placed a barrier between it and the witnessing of Allah, and placed it in the lap of its mother, nursing it and caring for it. Since it inhabited this constitution, it witnessed nothing but the essence of its mother, to the extent that some inhabitants are ignorant of their father. Were it not that Allah bestowed upon him sleep (النوم) and placed within it a matter called the vision (الرؤيا) in a faculty called Imagination (الخيال), when he sleeps, it is as if he departs from this constitution. His Father looks upon him and is pleased with him, casting a spirit upon him and comforting him. The spirits rush to him, and The Real (الحق) appears to him from His Transcendence (تنزيهه). All of this appears to him in bodies whose witnessing he is familiar with, being of the same kind as the abode of his constitution which he left by sleeping. Thus, in sleep, he imagines he is in the abode of his constitution which he is familiar with and knows, and he imagines that everything he sees in those materials is according to what he witnessed. This measure is what he has in this worldly constitution of intimacy (الأنس) with his Father and his brothers among the spirits, and intimacy with his Lord. Some are strengthened in this so that they see it in their waking state. He granted him a science called the science of interpretation (علم التعبير), by which he interprets the witnessing of those forms into their meanings.\n\nWhen Allah wills to empty this worldly abode of this constitution, which is the abode of the rational soul, He causes its governing spirit (روحها المدبر) to depart from this constitution and settles it in a Barzakhian (برزخية) form, one of the forms it used to wear during sleep. When the Day of Resurrection comes, and Allah wills to transfer it to the Other Abode (الدار الأخرى)—the Abode of Life (دار الحيوان), which is a rational abode, manifest in life, permanent in essence, and non-perishing—He creates for this rational soul an abode of the same kind as this Other Abode, homogeneous with it in its attribute, because it does not accept an inhabitant that is unsuitable for it. He creates a natural bodily constitution for the felicitous (السعداء) and an elemental constitution for the wretched (الأشقياء). He perfected and balanced it, then settled this rational soul in it. He removed from it the veils of blindness, ignorance, doubt, and conjecture, and made it possessor of knowledge (علم) and perpetual bliss (نعيم دائم). He showed it its Father, and it rejoiced in Him. He showed it its Creator and Sustainer, and introduced it to its brothers, and the gathering was completed with the beloved ones. He made it witness everything that was absent in the First Abode, and settled this constitution in the Other Abode, which is Paradise (جنة), for He divided the Other Abode into two stations. This is the first station. The other station, called Hell (جهنم), He made the bodily constitution of its rational souls elemental, accepting change. He accompanied it with ignorance and stripped it of knowledge. Thus, the ignorance of the believing imitators (المؤمنين من أهل التقليد) who were of this abode—the abode of wretchedness—is given to the one who was knowledgeable of subtle matters. That knowledgeable person enters the Fire due to that ignorance, since he belongs to it, and it does not accept the knowledgeable. And this knowledgeable person, who was knowledgeable of subtle matters in the world but was not of the people of Paradise, is given the ignorance of the simple, believing imitator. For Paradise is not an abode of ignorance. The simple, believing imitator sees the ignorance he was upon in the world upon that knowledgeable person, and he seeks refuge in Allah from that attribute, sees its ugliness, and thanks Allah for the favor He bestowed upon him by clothing him with the knowledge of that knowledgeable person who is of the people of the Fire. That knowledgeable person looks at him, and his regret is increased by his regret. He knows that the Abode granted these realities to itself, and he says: <<Oh, would that we were returned [to the world] and would not deny the signs of our Lord and would be among the believers!>> This is because they knew, even though they were ignorant believers, that when they transferred to the Abode of Felicity, the garments of ignorance would be stripped from them and the robes of knowledge would be bestowed upon them. Thus, they do not care about the ignorance they were upon in the world, due to the good outcome. They did not know that if they were returned to the world in the constitution they were upon, they would revert to its ruling, for action by inherent property (الخاصية) does not change. They only spoke what they spoke of this wish with the tongue of the constitution they are in, and they imagined that this knowledge would remain with them. Allah only placed forgetfulness (النسيان) in this worldly constitution for those who know something they had known, and they know that they had known a matter, but they seek to recall it and do not find it, after having been knowledgeable of it, except through signs and alerts. <<Indeed, He is over all things competent (قَدِيرٌ)>>—by stripping them of the knowledge they possessed when they enter the Fire. <<He selects for His mercy whom He wills (يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ)>>. This is His saying, the Exalted: <<Say, 'O Allah, Owner of Sovereignty (مالِكَ الْمُلْكِ), You give sovereignty to whom You will.'>> And what sovereignty is greater than knowledge? This is the knowledge He grants to the ignorant, felicitous, believing imitator in the Hereafter. <<And You take sovereignty from whom You will (تَنْزِعُ الْمُلْكَ مِمَّنْ تَشاءُ)>>. And what sovereignty is better than knowledge? He takes it from the knowledgeable non-believer who is of the people of the Fire. <<And You honor whom You will (تُعِزُّ من تَشاءُ)>> with that knowledge, <<and You humble whom You will (تُذِلُّ من تَشاءُ)>> by stripping that knowledge from him.\n\nWhen I knew that Allah had charged me with duties,\nI knew that I am responsible and intended.\n\nAnd that I shall never cease to worship Him throughout time,\nIn this world and the Hereafter, and The Real (الحق) is worshipped.\n\nHe does not manifest (تجلى) to anything of His creation,\nExcept that it witnesses that The Real (الحق) is witnessed.\n\nFrom the very essence of its form, not from its Reality (حقيقته);\nThus, the matter and the affair are existent and non-existent.\n\nBecause we perceive Him with the eyes of the Face,\nAnd all of us are His Face, yet the Face is limited.\n\nHe is Existence (الوجود), and whoever is in the cosmos is His form;\nThus, there is nothing existent there but the All-Merciful (الرحمن).\n\nThe Abode is two abodes, the Abode of the Abode is inhabited,\nBy the Abode of the Subtle One (اللطيف); thus, there is no abstraction (تجريد) in the cosmos.\n\nWere it not that the Realities (الحقائق) dictate that the ultimate end is to Mercy (الرحمة) in the Other Abode, so He shows mercy to him spiritually and physically, then there is one whose mercy is the very essence of well-being (العافية) and the removal of pains, nothing else. This is specific to the people of the Fire who belong to it. They do not die in it because of the well-being they attain there through the removal of pains, so they find that sweet. They are people of torment (عذاب), not people of pain (ألم), and they do not live—meaning they have no bliss like the bliss of the people of the Gardens, which is something added to the fact that He has granted them well-being from the abode of wretchedness.\n\nIn the heart, there is a flame from you that nothing extinguishes,\nExcept He who creates it through the witnessing of sensation.\n\nI fear for the noble ones because of nobility,\nSo who passes over my heart and alerts it?\n\nIf the one afflicted with defects comes seeking Him,\nHe heals him through the witnessing of the state (الحال).\n\nAnd nothing restores its bliss to my heart,\nExcept He who manifested it before this day.\n\n### That Knowledge (العلم) is Felicity (السعادة).\n\nKnow that whoever claims today that knowledge is felicity (السعادة) is truthful, and I agree that knowledge is felicity. However, he missed what the people of unveiling (أهل الكشف) attained, which is that when Allah wills wretchedness (شقاوة) for the servant, He removes knowledge from him, for knowledge was not intrinsic (ذاتيا) to him but acquired (اكتسبه). What is acquired is subject to removal. He clothes him in the garment of ignorance (الجهل), for the very essence of the removal of knowledge is ignorance. The only knowledge that remains with him is the knowledge that knowledge has been removed from him. If Allah did not leave him this knowledge of the removal of knowledge, he would not suffer torment (تعذب). For the ignorant person who does not know that he is ignorant is joyful and happy, because he does not know what he has missed. If he knew that he had missed much good, he would not rejoice in his state and would suffer pain immediately. He only suffers pain by his knowledge of what he missed or what he possessed and was stripped of. I was afflicted by pain in my arm, and I returned to Allah with a complaint, the return of Job (Ayyub), peace be upon him, out of proper etiquette (أدبا مع الله), so as not to resist the Divine Compulsion (القهر الإلهي), as those ignorant of Allah do, claiming in that that they are people of submission, delegation, and non-objection, thus combining two ignorances. When I realized what Allah had made me realize concerning that pain, I said:\n\nI complained of Him and of my arm,\nAnd that was from me due to the narrowness of my scope.\n\nI said to the soul: You claim it,\nSo where is your claim of expansion?\n\nShe said: I complain to you of Him,\nFor my harm is the very essence of my benefit.\n\nWere it not for the complaint about what I endure,\nI would depart from Him and from my nature.\n\nThat is an ignorance known by the heart,\nOf one who follows the state (صاحب حال بالاتباع).\n\nWere it not for the evil of my turning away from Him through my ignorance,\nNo caller would have called me to Him.\n\nSo I said: At your service, O caller!\nHe said: I seek the very essence of enjoyment.\n\nThe longing has been marketed, so seize it,\nFor the essence of my union is the essence of my separation.\n\nThen what I was finding departed from me,\nAnd what I was witnessing became absent from me.\n\nWere it not for the existence of the intellect, I would not know Him,\nWere it not for the existence of the Tablet, I would not dictate it.\n\nWere it not for the witnessing of the cosmos, I would not fulfill it,\nWere it not for the attainment of knowledge, I would not execute it.\n\nWhoever says that creation knows its existence,\nHas no knowledge of what is due to Him in it.\n\nAnd this measure of ignorance concerning what the matter is,\nIn the very essence of Reality (الحقيقة), suffices him.\n\nWhen the Realities (الحقائق) are unveiled, there is no doubt or suspicion, and its morning becomes clear to the one with two eyes. Insight is attained, contention ceases, and listening is achieved. However, between you and this state are deadly deserts (مفاوز مهلكة), a thirst-inducing wilderness, obliterated paths, and effaced traces, in which the expert guide is bewildered. None crosses it except He who gives life and causes death, not he who lives and dies. So what is the state of one who endures these hardships and traverses these straits? But according to the pain of the difficulties is the bliss of the comforts. There is no wilderness or desert other than yourself; you are your own veil from yourself. So remove yourself, and the matter is made easy. Whoever knows the creation knows The Real (الحق), and whoever is ignorant of a part of this affair is ignorant of the whole. For the part of the whole contains the very essence of the whole, without him knowing it. If he knew the part from all its aspects, he would know the whole, for from the aspects of its being a part is the knowledge of the whole.\n\nThis Station (المنزل) is one of the stations whose signs have multiplied and whose indications have become clear. However, the eyes are under the ruling of their coverings, the hearts are in their sheaths, and the intellects are preoccupied with fighting desires (الأهواء), so they are not free for the required contemplation. In this Station are sciences, including the science of resisting enemies and countering desires with desires. For if the intellects do not repel desire with desire, they will not achieve the goal, because souls are accustomed only to taking from their desire. If the intellect is knowledgeable in governance and skillful in creating forms, it creates for the soul a desired form in the very essence of its desire, and the soul accepts it with the acceptance of love, so the intellect triumphs over it.\n\nIn it is the science of the properties of numbers and letters. In it is the science of simple numbers and their ruling in what is compounded from them, and whether their properties as simple numbers remain in them with compounding or not. In it is the science of temporal containers (الظروف الزمانية) and in whose hand they are. In it is the science of the future time, if it is present, what its ruling is. In it is the science of the Oneness of Knowledge (أحدية العلم), and that the multiplicity attributed to it is not due to its essence but to its correlates (متعلقاته). In it is the science of what intellectual contemplation produces in spatial containers. In it is the science of the appointed terms (آجال) of existents in this world and the Hereafter, despite the Hereafter having no end, and the generality of His saying: <<All run to a specified term (أَجَلٍ مُسَمًّى)>>. Everything must have a limit, and things do not cease to exist, so their limits do not end. Allah renews things at every moment, and everything has a limit; that limit is its specified term. The term is only for the states of the entities (الأعيان), and the limit of the entities is the essence, not a limit. In it is the science of Reality (الحقيقة), metaphor (المجاز), and consideration (الاعتبار): from what one expresses, to what one expresses, and what the benefit of that is. In it is the science of the cultivation of the two abodes, of which we mentioned a part in this chapter, but did not exhaust. In it is the science of the difference in the rulings of the states of the Hour. In it is the science of the difference among the obligated ones (المكلفين) in their states, and that Allah addresses each category from the perspective of what that category is upon, without adding to it. In it is a science that dictates that the matter is entirely a beginning, with no repetition in it. In it is the science that The Real (الحق) descends in discourse to the understanding of the addressed, and all of it is truth, even if it contradicts and opposition appears in it. For there is a single essence that gathers it, like black and white, which are opposing contraries gathered by color, and like colors, which are different realities gathered by accident (العرض). In it is the science of Unity (التوحيد) through the very essence of analogy (التشبيه). In it is the science of preference (التفضيل). In it is the science of the ruling of the Words of Allah (كلمات الله) and the ruling of the creation of Allah. In it is the science of the formation of cosmic acts (الأعمال الكونية) and their establishment as forms. In it is the science of Gathering (الجمع) and Existence (الوجود). In it is the science of what the natural constitution (النشأة الطبيعية) necessitates in rulings. In it is the science of causes (العلل), reasons (الأسباب), and recompense (الجزاء). In it is the science of the difference between the causes of this world and the causes of the Hereafter, and the superiority of the causes of this world over them. In it is the science of what returns to the human being from his action, and what he attributes to Allah from that, he attributes to himself. In it is the science of Divine formation (التكوين الإلهي) from cosmic causes, which are the supernal Barzakhian effects (الآثار العلوية البرزخية) and nothing else. In it is the science of the change of states due to the change of celestial movements. In it is the science of the state of the animal from the time of its origination until its death. In it is the science of Divine analogy (القياس الإلهي). In it is the science of the influence of the existent upon the existent, and the science of what protects against that influence. In it is the science of the Resurrection (القيامة), its states, and its levels. In it is the science of the affair of the cosmos in its entirety. In it is the science of the superiority of the people of Divine Laws (النواميس الإلهية) over the people of intellectual, philosophical laws (النواميس العقلية الحكمية). This is a mention of most of the sciences contained in this Station. <<And Allah speaks the truth, and He guides to the way.>>",
    "ur": "باب تین سو چون (۳۵۴) سریانی منزل اقصیٰ کی معرفت میں، اور یہ حضرت محمدیہ (الحضرة المحمدیۃ) سے ہے۔\n\nعجمیوں میں آیات کا معدن ہے،\nاور کلمات میں خیر کا مجموعہ ہے۔\n\nرحمن کی فطرت مجھے طلب کرتی ہے،\nحکمتوں اور احکام کی اقسام کے ساتھ۔\n\nپس تو ایک بلند چوٹی پر ہو،\nاس شہاب کی مانند جو کسی نشان پر چمکا ہو۔\n\nپس وہی ہے جو اپنے بادلوں کو چلاتا ہے،\nنور اور ظلمت کے بادلوں میں۔\n\nاور اس کی پیروی کر جس کا تو طالب ہے،\nاور تہمت کی جگہ سے بلند ہو جا۔\n\nیہ وہ وصیت ہے جو صادر ہوئی ہے،\nتیز نگاہ والے کی طرف سے، جو اندھا نہیں ہے۔\n\n### [بندے میں تنزیہ (التنزيه) بالکل اسی طرح ہے جیسے ذات حق (الحق) میں تنزیہ (التنزيه)]\n\nاللہ تعالیٰ اپنی روح سے تمہاری تائید کرے، جان لو کہ بندے میں تنزیہ (التنزيه) بالکل اسی طرح ہے جیسے ذات حق (الحق) میں تنزیہ (التنزيه) ہے۔ پس جس نے ذات حق (الحق) کو اس عہد میں عبادات کی ادائیگی کے وقت تنزیہ دی جو اللہ نے عقلی اور شرعی طور پر اس پر واجب کیا تھا، تو اللہ نے اپنے آپ کو اس حکم میں اپنے بندے کے ساتھ شریک کر لیا، اس چیز کے ذریعے جو اس نے اپنے اوپر اس بندے کے لیے واجب کی تھی، یعنی اس رحمت کے ذریعے جو اس نے اپنے اوپر لکھی تھی اور اپنے عہد کو پورا کرنے کے ذریعے، اور اس بندے کو اس چیز کی ادائیگی سے بری کر دیا جو اس پر واجب تھی، اس طرح کہ اس پر کشف (الکشف) کر دیا کہ جو عمل اس پر فرض کیا گیا تھا، اس میں ذات حق (الحق) ہی اس کی طرف سے قائم ہے۔ یہ وہ عمل تھا جسے اہل حجاب اسی بندے کی طرف منسوب کرتے تھے اور کہتے تھے کہ فلاں ان لوگوں میں سے ہے جو \"يُوفُونَ بِعَهْدِ الله ولا يَنْقُضُونَ الْمِيثاقَ\" (اللہ کے عہد کو پورا کرتے ہیں اور میثاق کو نہیں توڑتے)۔ پس اللہ نے اسے ان باتوں سے بری کر دیا جو انہوں نے کہیں۔ اور اس براءت کی وجہ سے وہ اللہ کے نزدیک وجیہ (باعزت) تھا۔ تو انہوں نے اس شہود (الشہود) کے وقت نورِ ایمان کے ساتھ کہا: اللہ کے سوا کوئی فاعل نہیں۔ انہوں نے \"قَوْلًا سَدِيداً\" (سچی بات) کہی۔ اور اسی قول کی مانند اللہ نے اپنے مومن بندوں کو حکم دیا کہ وہ کہیں، پس جب وہ یہ کہتے ہیں تو اللہ ان کے اعمال کو درست کر دیتا ہے اور ان کے گناہوں کو بخش دیتا ہے۔ \"ومن يُطِعِ الله ورَسُولَهُ فَقَدْ فازَ فَوْزاً عَظِيماً\" (اور جو اللہ اور اس کے رسول کی اطاعت کرتا ہے، اس نے یقیناً بہت بڑی کامیابی حاصل کی۔)\n\nپس خوش نصیب وہ ہے جس کے اور اس کی ربوبیت کے درمیان اللہ حائل ہو گیا، اور اسے اس کی تمام زندگی میں بندہ بنا کر قائم رکھا، جو ایمان کی بنا پر خوف اور امید رکھتا ہے، نہ کہ عیان (مشاہدہ) کی بنا پر خوف اور امید رکھتا ہے۔\n\nبندہ تو وہی ہے جو خوف اور امید رکھتا ہے،\nوہ بندہ نہیں جو خوف اور امید رکھا جاتا ہے۔\n\nاور اسی لیے وہ ہر برائی سے بچایا جاتا ہے،\nاور اسی لیے وہ ہر فعل سے دور کیا جاتا ہے۔\n\nپس تو اسے ہر لحاظ سے خوش بخت دیکھے گا،\nاور جب وہ پھسلتا ہے تو قضا کے ذریعے نجات پاتا ہے۔\n\nبندہ اس کی طرف آنے والے وفود میں حشر کیا جاتا ہے،\nاور اگر وہ بندہ نہ ہو تو اس سے امید کی جاتی ہے۔\n\nپس جب وہ نجات پا گیا جو اس سے ڈرتا ہے،\nتو وہ جو معارف (المعارف) میں قائم ہوا، زیادہ نجات پانے والا ہے۔\n\nہر وہ شخص جس سے حقائق (الحقائق) حاصل ہوتے ہیں،\nجو کچھ اس کے پاس ان حقائق سے متعلق ہے، وہ نجات دہندہ ہے۔\n\n### [اللہ کے نزدیک عالم وہ ہے جو علم ظاہر اور علم باطن دونوں کو جانتا ہو]\n\nاللہ تمہاری تائید کرے، جان لو کہ اللہ کے نزدیک عالم وہ ہے جو علم ظاہر اور علم باطن دونوں کو جانتا ہو۔ اور جس نے ان دونوں کو جمع نہ کیا وہ نہ تو عالمِ خصوصی ہے اور نہ ہی مصطفیٰ (چنا ہوا)۔ اس کی وجہ یہ ہے کہ علم کی حقیقت اپنے حامل کو اس بات سے روکتی ہے کہ وہ اپنی حالتوں میں اس کے خلاف عمل کرے جو اس کے علم کے خلاف ہو۔ پس ہر وہ شخص جس نے علم کا دعویٰ کیا اور اس حال میں اس کے خلاف عمل کیا جس میں عقلی اور شرعی طور پر اس پر عمل کرنا واجب تھا، تو وہ عالم نہیں ہے اور نہ ہی عالم کی صورت میں ظاہر ہوا ہے۔ اور اپنے آپ کو دھوکہ نہ دو، کیونکہ اس کا وبال کسی اور پر نہیں بلکہ صرف تم پر ہی لوٹے گا۔ اگر تم کہو کہ ہم ایسے لوگ پاتے ہیں جو جانتے ہیں لیکن انہیں اپنے علم پر عمل کرنے کی توفیق نہیں دی جاتی، تو ہو سکتا ہے کہ علم ہو لیکن عمل نہ ہو، تو ہم کہیں گے کہ یہ کہنے والے کی غلطی ہے، تاکہ تم جان لو کہ علم کا نام اس چیز پر بھی بولا جاتا ہے جو علم ہے اور اس پر بھی جو علم نہیں ہے۔ کیونکہ اللہ تعالیٰ فرماتا ہے: \"فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ\" (پس اس شخص سے منہ پھیر لو جس نے ہمارے ذکر سے منہ موڑا اور دنیا کی زندگی کے سوا کچھ نہ چاہا، ان کے علم کی رسائی بس یہیں تک ہے۔) پس اللہ نے ہمیں بتایا کہ انہوں نے اس پر عمل کیا جو وہ جانتے تھے، لیکن میں علم سے مراد صرف وہ علم لیتا ہوں جو معلوم کے مشاہدے سے حاصل ہو۔ اگر وہ فکری دلیل سے حاصل ہو تو وہ حقیقی علم نہیں ہے، اگرچہ نفس الامر میں وہ علم ہی ہو، جیسا کہ:\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا، جب آپ نے قرآن کی ایک سورت کا ذکر کیا اور اس کا نام نہیں لیا تاکہ اپنے صحابہ کا امتحان لیں، تو بعض صحابہ کے دل میں یہ بات آئی کہ شاید وہ سورۃ الفاتحہ ہے۔ پھر نبی صلی اللہ علیہ وسلم نے خبر دی کہ وہ الفاتحہ ہے۔ لیکن صحابی کو یہ بات یقین کے ساتھ حاصل نہیں ہوئی تھی۔ جب رسول اللہ صلی اللہ علیہ وسلم نے انہیں اس بات کی خبر دی جو ان کے دل میں آئی تھی، تو آپ نے فرمایا: \"ليهنك العلم\" (یہ علم تمہیں مبارک ہو۔)\n\nپس وہ علم نفس الامر میں تو علم تھا، لیکن اس صحابی کے نزدیک نہیں تھا جس کے دل میں یہ بات آئی تھی۔ جب یہ معاملہ ایسا تھا، تو کچھ لوگ اس قول کی طرف گئے کہ علم کے باوجود اس کے خلاف عمل کرنا ممکن ہے۔ لیکن صحیح بات یہ ہے کہ جب تم اس کا امتحان لو گے اور اس پر تحقیق کرو گے تو حق وہی پاؤ گے جس کی طرف ہم گئے ہیں۔ اور اسی لیے:\n\nرسول اللہ صلی اللہ علیہ وسلم نے اس شخص سے فرمایا جس نے آپ کی بات سمجھی کہ: \"إن الله إذا أراد مضاء قضائه وقدره سلب ذوي العقول عقولهم حتى إذا أمضى فيهم قضاءه وقدره ردها عليهم ليعتبروا\" (جب اللہ اپنے قضا و قدر کو نافذ کرنا چاہتا ہے تو عقل والوں کی عقلیں سلب کر لیتا ہے، یہاں تک کہ جب ان میں اپنا قضا و قدر نافذ کر دیتا ہے تو انہیں واپس کر دیتا ہے تاکہ وہ عبرت حاصل کریں۔)\n\nاور یہ ان سے علم کے چلے جانے کے سوا کچھ نہیں ہے، اور عبرت حاصل کرنا وہ عمل ہے جسے علم نے واجب کیا ہے۔ پس یہ وہی بات ہے جس کی طرف ہم گئے ہیں۔ اللہ تعالیٰ ایک قوم کے حق میں فرماتا ہے: \"يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا\" (وہ دنیا کی زندگی کا صرف ظاہری علم رکھتے ہیں) پس انہوں نے اس پر عمل کیا جو وہ جانتے تھے، \"وهُمْ عَنِ الْآخِرَةِ هُمْ غافِلُونَ\" (اور وہ آخرت سے غافل ہیں) پس انہوں نے آخرت کے لیے عمل نہیں کیا، کیونکہ اللہ نے انہیں اس سے غافل کر دیا، پس وہ اپنی آخرت کو بھول گئے اور اس کے لیے عمل کرنا چھوڑ دیا۔ \"إِنَّ في ذلِكَ لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ\" (یقیناً اس میں اس شخص کے لیے نصیحت ہے جس کے پاس دل ہو یا جو کان لگائے اور وہ حاضر ہو۔) اللہ تعالیٰ حکم دیتے ہوئے فرماتا ہے اور ذکر کرتا ہے، یعنی علم سے مراد وہ ہے جس سے وہ غافل ہو گیا یا بھول گیا: \"فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ\" (پس یقیناً نصیحت مومنوں کو فائدہ دیتی ہے) اور وہ وہ لوگ ہیں جنہوں نے نورِ ایمان کے ذریعے کشف (الکشف) سے اس چیز کو جانا جو وہاں ہے۔ پھر وہ غافل ہو گئے، پس ان کے اور اس علم کے درمیان رکاوٹ ڈال دی گئی جو وہ جانتے تھے۔ اور ان کے لیے مشہود (الشہود) وہی تھا جو وہ اپنے بھولنے کے وقت جانتے تھے۔ پس جب انہیں یاد دلایا جاتا ہے تو وہ یاد کرتے ہیں اور ان کے لیے اس چیز کا شہود (الشہود) قائم ہو جاتا ہے جسے وہ پہلے جان چکے تھے، پس نصیحت انہیں فائدہ دیتی ہے اور وہ اس پر عمل کرتے ہیں جو وہ جانتے ہیں۔ پس اللہ نے گواہی دی: \"فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ\" (پس یقیناً نصیحت مومنوں کو فائدہ دیتی ہے)۔ پس جب تم کسی ایسے شخص کو دیکھو جو ایمان کا دعویٰ کرتا ہے اور اسے نصیحت کی جاتی ہے لیکن اسے اس نصیحت سے کوئی فائدہ نہیں ہوتا، تو تم جان لو کہ وہ اس حال میں اس چیز کا عالم نہیں ہے جس پر وہ ایمان لایا ہے، پس وہ اصلاً مومن نہیں ہے۔ کیونکہ اللہ کی گواہی حق ہے اور وہ سچا ہے، اور اس نے ہمیں بتایا ہے کہ مومن نصیحت سے فائدہ اٹھاتا ہے، اور ہم نے مشاہدہ کیا کہ اس شخص نے نصیحت سے فائدہ نہیں اٹھایا، لہٰذا اللہ کی تصدیق کرتے ہوئے ہمیں اس سے ایمان کو زائل کرنا ضروری ہے۔ اور نفع کا کوئی معنی نہیں مگر یہ کہ اس سے اس علم کے مطابق عمل کا وجود ہو۔ اور ہم کسی کو نہیں دیکھتے جو اس چیز پر عمل کرنے میں توقف کرے جس کے بارے میں وہ دعویٰ کرتا ہے کہ وہ اس کا عالم ہے، مگر یہ کہ اس کے دل میں کوئی احتمال (شک) ہو۔ اور جس کے دل میں کسی چیز کے بارے میں احتمال قائم ہو جائے تو وہ نہ تو اس کا عالم ہے اور نہ ہی اس شخص پر ایمان لانے والا ہے جس نے اسے اس کی خبر دی ہے، ایسا ایمان جو اس کے لیے علم کو واجب کرے۔ حالانکہ اگر تم اس سے پوچھو تو وہ تمہیں کہے گا کہ ہمیں اس میں کوئی شک نہیں کہ جو کچھ اس شخص (یعنی رسول علیہ السلام) نے لایا ہے وہ حق ہے اور میں اس پر ایمان لانے والا ہوں۔ پس یہ قول صحیح نہیں ہے، مگر اس وقت جب وہ بعض لوگوں کے سامنے دعویٰ کرتا ہے۔ پھر جب وہ اپنے فکر کے ساتھ تنہا ہوتا ہے تو اس کے ساتھ احتمال قائم ہو جاتا ہے، پس وہ چیز جسے اس نے علم سمجھا تھا، وہ ایک عارضی امر تھا جو اسے پیش آیا تھا۔ اور بعض لوگ ایسے ہیں جن سے احتمال اس وقت بھی زائل نہیں ہوتا جب وہ گواہی دیتے ہیں کہ یہ حق صریح ہے، باوجود اس کے کہ احتمال موجود ہوتا ہے۔ اور اس گواہی کی وجہ یہ ہے کہ جب کوئی امر صدق ہونے کا احتمال رکھتا ہو اور کذب ہونے کا بھی احتمال رکھتا ہو، تو اس وقت اس پر صدق کا ظہور (التجلی) ہوتا ہے، اور اس کی تصدیق جو وہ اس چیز کی کرتا ہے جس پر وہ ایمان لانے والا ہے، وہ اس خبر کے محتملات میں سے ایک ہے، یعنی اس کا سچا ہونا۔ یہی اس حال میں اس کے لیے مشہود (الشہود) ہوتا ہے، پس وہ اس وقت اس کے سچا ہونے کا یقین کر لیتا ہے۔\n\nاور وہ نہیں جانتا کہ یہ اس کے محتملات میں سے ایک کے ظہور (التجلی) کی وجہ سے ہے۔ پس جب وہ وارد (تجلی) اس سے غائب ہو جاتا ہے تو اس کے ساتھ محتملات برابر ہو کر قائم ہو جاتے ہیں، پس اس کے نزدیک وہ صرف ظن کے ذریعے ہی راجح ہوتا ہے، نہ کہ علم کے ذریعے۔ پس اے میرے بھائی! دیکھو کہ نفس کی خرابیاں کتنی پوشیدہ ہیں، اور جہالت کا حجاب کتنا عظیم ہے، باوجود اس کے کہ وہ عدم (نہ ہونا) ہے۔ تو ہمارا کیا حال ہوتا اگر وہ وجود ہوتا؟ پس تمام تعریفیں اور احسان اللہ کے لیے ہیں۔ ہم نے تمہیں اس پر صرف اس لیے متنبہ کیا ہے تاکہ تم ایمان میں اپنا حصہ اور اپنا مقام جان لو۔\n\nکیونکہ نبی صلی اللہ علیہ وسلم صحیح حدیث میں فرماتے ہیں: \"لا يزني الزاني حين يزني وهو مؤمن\" (زانی جب زنا کرتا ہے تو وہ مومن نہیں ہوتا۔)\n\nیعنی وہ اس پر ملنے والی سزا کی تصدیق کرنے والا نہیں ہوتا، کیونکہ اللہ تعالیٰ معاف بھی کر سکتا ہے۔ اور اگر ایمان وہ کشف (الکشف) نہ دے جو علم دیتا ہے، تو وہ ایمان نہیں ہے۔\n\n### [علم ایک باریک حجاب کے پیچھے سے عمل عطا کرتا ہے]\n\nپس جان لو کہ علم ایک باریک حجاب کے پیچھے سے عمل عطا کرتا ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم کی ایک اور حدیث میں زانی کے بارے میں ہے کہ جب وہ زنا کرتا ہے تو ایمان اس سے نکل جاتا ہے یہاں تک کہ وہ اس پر سائے کی طرح ہو جاتا ہے۔\n\nاور ہمارے نزدیک اس کی ایک اچھی تاویل یہ ہے کہ زانی اللہ کی طرف سے نازل ہونے والی کسی بلا میں مبتلا ہو سکتا ہے، پس ایمان نکل جاتا ہے یہاں تک کہ وہ اس پر سائے کی طرح ہو جاتا ہے جو اس بلا کو نازل ہونے سے روکتا ہے اگر وہ نازل ہو۔ پس اے ولی! اس قدر سے غافل نہ ہو جس پر میں نے تمہیں متنبہ کیا ہے۔ کیا تم نہیں دیکھتے کہ اللہ تعالیٰ نے آیات کو کیوں نصب کیا اور انہیں کثرت دی؟ صرف اس لیے تاکہ ان کے ذریعے علم حاصل ہو، کیونکہ وہ جانتا ہے کہ جب علم حاصل ہو جاتا ہے تو عمل لازم ہو جاتا ہے۔ کیا تم دوا پینے والے کو نہیں دیکھتے؟ اس نے اسے نہیں پیا اور اس کی کڑواہٹ کو نہیں گھونٹا، مگر اس علم کی وجہ سے کہ وہاں کوئی دوا ہے جو اس بیماری کو دور کر دے گی جس کی وہ شکایت کر رہا ہے۔ پس وہ کہتا ہے کہ شاید یہ دوا وہی ہو جو میں نے پی ہے، پس وہ اسے امکان اور امید کے ساتھ پیتا ہے۔ تو اس کا کیا حال ہوتا اگر وہ بلا شک جانتا کہ یہ وہی دوا ہے؟ وہ یقیناً اس کی طرف تیزی سے لپکتا۔ اگر تم کہو کہ اللہ تعالیٰ کا یہ فرمان: \"وأَضَلَّهُ الله عَلى‏ عِلْمٍ\" (اور اللہ نے اسے علم کے باوجود گمراہ کر دیا) اس شخص کے حق میں جس نے \"اتَّخَذَ إِلهَهُ هَواهُ\" (اپنی خواہش کو اپنا معبود بنا لیا)؟ تو ہم کہیں گے کہ معبود میں قوت ہوتی ہے جو اس کی عبادت کی جاتی ہے، اور اس شخص کا معبود اس کی خواہش ہے، پس اس نے اس پر حکم لگایا اور اسے اللہ کے راستے سے گمراہ کر دیا۔ اور جہاں تک اس کے قول \"عَلى‏ عِلْمٍ\" کا تعلق ہے، تو اس کا مطلب یہ ہے کہ اللہ نے اسے علم کے ساتھ گمراہ کیا، نہ کہ گمراہ ہونے والا علم پر تھا۔ کیونکہ گمراہ وہ حیران شخص ہے جو نہیں جانتا کہ اس کا مطلوب کس سمت میں ہے۔ پس \"عَلى‏ عِلْمٍ\" کا تعلق \"أَضَلَّهُ\" (اسے گمراہ کیا) سے ہے، اور یہ اس میں عمل کرنے والا ہے، اور یہ اللہ کا فعل ہے۔ اور اللہ پر صرف بیان کرنا ہی لازم ہے۔ اللہ تعالیٰ فرماتا ہے: \"وما كانَ الله لِيُضِلَّ قَوْماً بَعْدَ إِذْ هَداهُمْ حَتَّى يُبَيِّنَ لَهُمْ ما يَتَّقُونَ\" (اور اللہ کسی قوم کو ہدایت دینے کے بعد گمراہ نہیں کرتا جب تک کہ وہ ان کے لیے واضح نہ کر دے جن چیزوں سے انہیں بچنا ہے۔) یعنی وہ کسی قوم کو حیران نہیں کرتا جب کہ اس نے انہیں میثاق اور اس فطرت کے ذریعے ہدایت دی جس پر وہ پیدا ہوئے تھے، جب تک کہ وہ ان کے لیے واضح نہ کر دے جن چیزوں سے انہیں بچنا ہے۔ پس جب وہ ان کے لیے واضح کر دیتا ہے تو انہیں حیران کر دیتا ہے۔ پس ان میں سے کچھ کو واسطے کے ذریعے حیران کیا، پس انہوں نے نبوت میں شک کیا اور اس میں حیران ہوئے اور انہیں یقین نہ ہوا کہ یہ نبی ہے، پس انہوں نے اس سے لینے میں توقف کیا۔ اور ان میں سے کچھ کو نبوت کی اصل میں حیران کیا کہ آیا اس کا وجود ہے یا نہیں؟ اور ان میں سے کچھ کو اس چیز میں حیران کیا جو اس نبی نے لائی تھی اور جسے نظری دلائل محال سمجھتے تھے، پس الٰہی بیان نے انہیں یہ حیرانی وراثت میں دی، اور یہ ایمان کی کمی کی وجہ سے تھا، پس ان کے پاس ایمان کا نور نہیں تھا جو ان کے لیے اس حقیقت کو کشف (الکشف) کر دیتا جو اللہ نے کہی اور واضح کی۔ اور جسے اللہ نے یہاں اس کے ایمان سے نور نہیں دیا، \"فَما لَهُ من نُورٍ\" (تو قیامت میں اس کے لیے کوئی نور نہیں ہوگا)۔ \"أَنَّ الله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ\" (یقیناً اللہ ہر چیز کا جاننے والا ہے) پس وہ اس پر عمل کرتا ہے جو وہ جانتا ہے کہ وہ ہو گا، اور جسے وہ جانتا ہے کہ وہ نہیں ہو گا، اسے وہ وجود نہیں دیتا۔ پس اس کا عمل اس کے علم کے مطابق تھا۔ کہہ دو: \"أَنْزَلَهُ بِعِلْمِهِ\" (اسے اللہ نے اپنے علم سے نازل کیا) اور انزال ایک عمل ہے جسے علم نے وجود بخشا۔ پس جب ذات حق (الحق) نے وہ واضح کر دیا جو اس نے اپنے بندوں کے لیے واضح کیا، تو ان میں سے کچھ کو اللہ نے علم عطا کیا، پس انہوں نے اس پر عمل کیا، اور ان میں سے کچھ کو اللہ نے علم سے محروم کر دیا، پس وہ گمراہ ہوئے، حیران ہوئے، شک کیا، تردد کیا اور توقف کیا۔ اور جہاں تک اللہ تعالیٰ کے اس فرمان کا تعلق ہے: \"الَّذِينَ آتَيْناهُمُ الْكِتابَ يَعْرِفُونَهُ كَما يَعْرِفُونَ أَبْناءَهُمْ\" (جنہیں ہم نے کتاب دی ہے وہ اسے ایسے پہچانتے ہیں جیسے اپنے بیٹوں کو پہچانتے ہیں) تو وہ اپنی کتاب کی تصدیق کرنے والے ہیں اور یہ صفت اس میں موجود ہے۔ اور انہوں نے اسے دیکھا ہے، پس وہ جانتے ہیں کہ یہ وہی صفت ہے، لیکن وہ اس شخص کو نہیں پہچانتے جس میں یہ صفت قائم ہوئی ہے، کیونکہ یہ صفت بہت سے لوگوں میں قائم ہو سکتی ہے۔ پس ان میں شخص کے بارے میں احتمال داخل ہوا، صفت کے بارے میں نہیں۔ اور جہاں تک اللہ تعالیٰ کے اس فرمان کا تعلق ہے: \"وإِنَّ فَرِيقاً مِنْهُمْ لَيَكْتُمُونَ الْحَقَّ وهُمْ يَعْلَمُونَ\" (اور یقیناً ان میں سے ایک گروہ حق کو چھپاتا ہے حالانکہ وہ جانتے ہیں) کہ وہ حق ہے، پس وہ اسے اپنے مقلدین سے اور نبی علیہ السلام سے چھپاتے ہیں کہ انہوں نے اسے اس صفت کا حامل پہچان لیا ہے۔ اور حق کو جاننے والے کے لیے یہ لازم نہیں کہ وہ ظاہر میں اس کا اقرار کرے، بلکہ اس کے لیے باطن میں اس کی تصدیق لازم ہے۔ پس وہ اس کی تصدیق کرنے والا ہے، اگرچہ وہ زبان سے اس کی تکذیب کرے۔ پس اس نے اس پر عمل کیا جو وہ جانتا تھا، اور وہ تصدیق ہے۔ اور اللہ تعالیٰ کا اس جیسی صورت میں فرمان ہے: \"واسْتَيْقَنَتْها أَنْفُسُهُمْ\" (اور ان کے دلوں نے یقین کر لیا) کہ وہ آیات ہیں، پس انہوں نے جانا اور اس پر عمل کیا جو وہ جانتے تھے، اور وہ تیقن (یقین) ہے جو علم کا نفس میں مستحکم ہو جانا ہے۔ اگر وہ نہ جانتے تو یقین نہ کرتے۔ اور ہر عمل عمومی نجات نہیں دیتا، بلکہ نجات کا ایک مخصوص حصہ دیتا ہے، خواہ وہ عمومی ہو یا خصوصی۔ اگر تم کہو کہ اہل جہنم نے وعید کے نفاذ میں اللہ کی سچائی کو جان لیا اور کہا: \"رَبَّنا أَخْرِجْنا نَعْمَلْ صالِحاً غَيْرَ الَّذِي كُنَّا نَعْمَلُ\" (اے ہمارے رب! ہمیں نکال دے تاکہ ہم نیک عمل کریں، اس کے علاوہ جو ہم کرتے تھے) تو ہمیں شک نہیں کہ اس حال میں انہیں علم حاصل ہو گیا، اور اللہ فرماتا ہے: \"ولَوْ رُدُّوا لَعادُوا لِما نُهُوا عَنْهُ\" (اور اگر انہیں واپس بھیج دیا جائے تو وہ وہی کریں گے جس سے انہیں منع کیا گیا تھا) اس ذوقی علم کے باوجود جو انہیں حاصل ہوا؟ تو ہم کہیں گے کہ جب اللہ نے جان لیا کہ اس دنیا کو ایک مخصوص فطرت پر بنایا گیا ہے، اور انسان کی نشأت کو ایسے مزاج پر بنایا گیا ہے جو نسیان (بھول) اور غفلت اور عاجل (فوری) چیزوں کی محبت کو قبول کرتا ہے، اور اس کے برعکس کو بھی قبول کرتا ہے، اس کے مطابق جو اس میں قائم کیا جاتا ہے۔ پس اللہ سبحانہ نے جان لیا کہ ان لوگوں کی نشأت جنہیں اس نے متعین کیا ہے، اگر انہیں دنیا میں ان کی اسی نشأت میں واپس بھیج دیا جائے جس پر وہ تھے، تو وہ اس چیز کو بھول جائیں گے جو وہ جان چکے تھے۔ اور ان کی آنکھوں پر پردہ ڈال دیا گیا تھا، جس کی وجہ سے اگر وہ مشاہدہ کرتے تو امر کو جان لیتے اور اس کے لیے عمل کرتے۔ پس یہ اس قول کا معنی ہے کہ \"لعادوا لما نهوا عنه\" (وہ وہی کریں گے جس سے انہیں منع کیا گیا تھا) کیونکہ نشأت وہی ہے۔ اگر یہ علم ان کے لیے باقی رہتا تو وہ واپس نہ جاتے۔\n\nکیا تم نہیں دیکھتے کہ نبی صلی اللہ علیہ وسلم صحیح حدیث میں فرماتے ہیں: \"إنه يؤتى في القيامة بأنعم أهل الدنيا فيغمس في النار غمسة فيقال له هل رأيت نعيما قط فيقول لا والله\" (قیامت کے دن دنیا کے سب سے زیادہ نعمتوں والے شخص کو لایا جائے گا، اور اسے جہنم میں ایک غوطہ دیا جائے گا، پھر اس سے پوچھا جائے گا: کیا تم نے کبھی کوئی نعمت دیکھی ہے؟ تو وہ کہے گا: نہیں، اللہ کی قسم!) حالانکہ معلوم ہے کہ اس نے نعمت دیکھی تھی، لیکن حال کے مشاہدے نے اسے اس نعمت سے حجاب میں ڈال دیا، پس وہ اسے بھول گیا۔ اور اسی طرح بدحال شخص کو جب جنت میں ایک غوطہ دیا جاتا ہے تو اس سے پوچھا جاتا ہے: کیا تم نے کبھی کوئی بدحالی دیکھی ہے؟ تو وہ کہتا ہے: نہیں، اللہ کی قسم، میں نے کبھی کوئی بدحالی نہیں دیکھی۔\n\nپس اسی طرح اگر انہیں واپس بھیجا جاتا تو وہ اس نشأت اور حال کے مطابق ہوتے جس میں انہیں واپس بھیجا جاتا۔ اور جہاں تک مومن گناہگاروں کا تعلق ہے، تو وہ وعید کے نفاذ کو جاننے والے ہیں، لیکن وہ یہ نہیں جانتے کہ کس پر نافذ ہو گا۔ پس اگر ان میں سے کسی ایک کے لیے یہ متعین ہو جاتا کہ وہی ہے جس پر وعید نافذ ہو گی، تو وہ اس سبب کی طرف قدم نہ بڑھاتا جس کے بارے میں وہ جانتا ہے کہ اس سے وعید کا نفاذ ہو گا۔ اور جب اسے اس کے اختیار میں مجبور کیا جاتا ہے، تو وہ اسے نہیں جانتا، کیونکہ وہ اسے اپنے نفس سے نہیں پاتا۔ کیونکہ اس معاملے میں امر مشترک ہے، اور اس سے پہلے بعض منازل میں اس پر کلام ہو چکا ہے۔ پس جس نے اپنے اختیار میں جبر کو علم کے ذریعے کشف (الکشف) اور شہود (الشہود) سے جانا، تو وہ مخالفت تقدیر کے حکم سے کرتا ہے، نہ کہ بے حرمتی کے حکم سے۔ پس وہ اس پر عمل کرنے والا تھا جو وہ جانتا تھا، پس وہ عمل اسے نقصان نہیں پہنچاتا، بلکہ وہ اس کے لیے بخشا ہوا ہے۔\n\n### [علم کی بعض اقسام ایسی ہیں جو پوشیدہ کی مانند ہیں، جنہیں صرف اللہ کے عالم ہی جانتے ہیں]\n\nاور جان لو کہ یہ مقدار جو ہم نے اس مسئلے میں ذکر کی ہے، یہ اس علم میں سے ہے جس کے بارے میں یہ خبر وارد ہوئی ہے جس کے الفاظ یہ ہیں کہ: \"إن من العلم كهيئة المكنون لا يعلمه إلا العالمون بالله فإذا نطقوا به لم ينكره عليهم إلا أهل الغرة بالله\" (علم کی بعض اقسام ایسی ہیں جو پوشیدہ کی مانند ہیں، جنہیں صرف اللہ کے عالم ہی جانتے ہیں، پس جب وہ اسے بیان کرتے ہیں تو ان پر صرف وہی لوگ انکار کرتے ہیں جو اللہ کے بارے میں غفلت میں ہیں۔) اور یہ اہل کشف (الکشف) کے نزدیک صحیح حدیث ہے، جس پر ان کے خاص لوگ متفق ہیں، جنہوں نے اسے پہچانا اور اس کا یقین کیا۔ اللہ نے اسے پوشیدہ کی ہیئت پر رکھا، اسے مکمل طور پر پوشیدہ نہیں کیا، کیونکہ اگر وہ مکمل طور پر پوشیدہ ہوتا تو وہ صرف اللہ تعالیٰ کے لیے مخصوص ہوتا۔ پس جب اسے صرف اللہ کے عالم ہی جانتے ہیں، تو ہم نے جان لیا کہ اللہ کا علم اس علم کو وراثت میں دیتا ہے جسے اللہ جانتا ہے۔ پس یہ عوام سے پوشیدہ ہے اور خواص کے لیے معلوم ہے۔ اور اللہ کے علم کا معنی یہ ہے کہ وہ نہیں جانتا، پس ہم نے جان لیا کہ وہاں کچھ چیزیں ہیں جنہیں تعین کے ساتھ نہیں جانا جا سکتا، اور اس کے علاوہ کو جانا جا سکتا ہے۔ پس اس علم کے پردے اللہ کے عالموں کے دل ہیں۔ پس جب وہ اسے آپس میں بیان کرتے ہیں، کیونکہ اس حد پر ہی اس کا بیان صحیح ہے، اور اتفاق سے مجلس میں کوئی ایسا شخص ہو جو اس کا اہل نہ ہو اور نہ ہی اہل اللہ میں سے ہو (کیونکہ اہل اللہ ہی اہل ذکر اور اللہ کے عالم ہیں)، تو اہل غرہ باللہ (اللہ کے بارے میں غفلت میں رہنے والے) اس پر انکار کرتے ہیں۔ پس اس نے ان کی اہلیت کو غرہ (غفلت) کی طرف منسوب کیا، اور وہ وہ لوگ ہیں جو یہ سمجھتے ہیں کہ انہوں نے اللہ کو پہچان لیا ہے۔ اور اس علم میں سے جو پوشیدہ کی ہیئت پر ہے، لیکن پوشیدہ نہیں ہے، یہ علم ہے۔ کیونکہ علم مکنون (پوشیدہ) شہود (الشہود) کے ذریعے جانا جاتا ہے اور اسے بیان نہیں کیا جا سکتا، بخلاف فکری علوم کے، کیونکہ وہ سب بیان کیے جا سکتے ہیں۔ اور اگر وہ صاحب کشف (الکشف) کو بھی بغیر فکر اور غور و خوض کے حاصل ہو جائیں، تو وہ بغیر دلیل کے بیان کیے جا سکتے ہیں، پس دلیل والا عالم اسے قبول کر لیتا ہے۔ پس یہ علم وہی ہے جو پوشیدہ کی ہیئت پر ہے، کیونکہ اس کا عالم دلیل کا عالم نہیں ہے۔ پس جان لو کہ دیار دو ہیں: ایک وہ دیار جس میں ناطق ارواح رہتی ہیں، اور وہ طبیعی، متوازن، معتدل بدن ہے جسے اللہ نے اپنے ہاتھوں سے پیدا کیا اور اس پر اپنی دو صفات کا رخ کیا۔ پس جب اسے پیدا کیا تو اسے ایک اور دار میں بسایا جو دارِ الدار (گھر کا گھر) ہے۔ اور اللہ سبحانہ نے دارِ الدار کو دو حصوں میں تقسیم کیا: ایک کو دنیا کا نام دیا اور دوسرے کو آخرت کا۔ پھر اس نے جان لیا کہ ہر دار کی سکونت کے لیے کون سے ساکن مناسب ہیں، جو ناطق نفوس کے دیار ہیں۔ پس اس نے دار دنیا کے لیے، اس کی فنا، اس کے وجود کے زائل ہونے، اس کی صورت، وضع، شکل کے بدل جانے اور اس کی حیات کے پوشیدہ ہونے کی وجہ سے، ایک ایسا ساکن پیدا کیا جو یہی دار ہے جس میں ناطق نفس کو بسایا۔ پس اس نشأت کو اس کے رہنے کی جگہ کی طرح بنا دیا، جس کی حیات پوشیدہ ہے، فانی ہے، وجود زائل ہونے والا ہے، صورت، وضع اور شکل بدلنے والی ہے۔ پس اس کا ساکن، جو ناطق نفس ہے، جہالت، حجاب، شک، ظن، کفر اور ایمان سے متصف ہوا۔ اور یہ اس دار کی کثافت کی وجہ سے ہے جو اس کی بدنی نشأت ہے۔ اور اللہ نے اس کے اور اللہ کے شہود (الشہود) کے درمیان رکاوٹ ڈال دی، اور اسے اس کی ماں کی گود میں رکھا جو اسے دودھ پلاتی ہے اور اس کی دیکھ بھال کرتی ہے۔ پس جب سے اسے اس نشأت میں بسایا گیا، اس نے اپنی ماں کے وجود کے سوا کچھ نہیں دیکھا، یہاں تک کہ بعض ساکنوں نے اپنے باپ کو بھی نہیں جانا۔ اور اگر اللہ اس پر نیند کے ذریعے احسان نہ کرتا اور اس میں ایک امر نہ بناتا جسے رؤیا (خواب) کہا جاتا، ایک قوت میں جسے خیال کہا جاتا ہے، تو جب وہ سوتا ہے تو گویا وہ اس نشأت سے باہر نکل جاتا ہے، پس اس کا باپ اسے دیکھتا ہے اور اس سے خوش ہوتا ہے اور اس پر روح ڈالتا ہے اور اسے انس دیتا ہے، اور ارواح اس کی طرف تیزی سے آتی ہیں، اور ذات حق (الحق) اس کے لیے اپنے تنزیہ (التنزيه) سے ظاہر ہوتی ہے، اور یہ سب اسے ایسے اجسام میں دکھائی دیتا ہے جن کے شہود (الشہود) کو اس نے اس نشأت کی جنس سے مانوس کیا تھا جسے اس نے نیند کے ذریعے چھوڑا تھا۔ پس وہ نیند میں یہ گمان کرتا ہے کہ وہ اپنی اسی نشأت میں ہے جس سے وہ مانوس ہے اور جسے وہ جانتا ہے، اور وہ ہر اس چیز کے بارے میں جو وہ ان مواد میں دیکھتا ہے، یہ گمان کرتا ہے کہ وہ اسی کے مطابق ہے جیسا کہ اس نے مشاہدہ کیا ہے۔ پس یہ وہ مقدار ہے جو اسے اس دنیاوی نشأت میں اپنے باپ اور ارواح میں سے اپنے بھائیوں کے ساتھ انس حاصل ہوتا ہے، اور اپنے رب کے ساتھ انس حاصل ہوتا ہے۔ اور ان میں سے کچھ ایسے ہیں جو اس میں اتنے قوی ہو جاتے ہیں کہ وہ اسے اپنی بیداری میں بھی دیکھتے ہیں۔ اور اللہ نے اسے ایک علم عطا کیا جسے علم تعبیر کہا جاتا ہے، جس کے ذریعے وہ ان صورتوں کے مشاہدے سے ان کے معانی کی طرف تعبیر کرتا ہے۔ پس جب اللہ ارادہ کرتا ہے کہ اس دار دنیا کو اس نشأت سے خالی کر دے جو ناطق نفس کا گھر ہے، تو وہ اس نشأت سے اس کی مدبر روح کو کوچ کرا دیتا ہے اور اسے برزخی صورتوں میں سے ایک صورت میں بسا دیتا ہے،\n\nجو وہ نیند کی حالت میں پہنتا تھا۔ پس جب قیامت کا دن ہو گا اور اللہ ارادہ کرے گا کہ اسے دوسری دار کی طرف منتقل کرے، جو دار الحیوان (حیات کا گھر) ہے، اور وہ ایک ناطق، ظاہری حیات والی، ثابت الوجود، نہ زائل ہونے والی دار ہے، تو وہ اس ناطق نفس کے لیے اس دوسری دار کی جنس سے ایک دار پیدا کرے گا جو اپنی صفت میں اس سے ہم جنس ہو، کیونکہ وہ ایسے ساکن کو قبول نہیں کرتی جو اس کے مناسب نہ ہو۔ پس اس نے سعادت مندوں کے لیے ایک بدنی طبیعی نشأت پیدا کی اور بدبختوں کے لیے عنصری نشأت، پس اسے برابر کیا اور معتدل کیا، پھر اس میں اس ناطق نفس کو بسایا، پس اس سے اندھے پن، جہالت، شک اور ظن کے حجابات کو دور کر دیا، اور اسے علم اور دائمی نعمت کا مالک بنا دیا، اور اسے اس کا باپ دکھایا، پس وہ اس سے خوش ہوئی، اور اسے اس کا خالق اور رازق دکھایا، اور اس کے اور اس کے بھائیوں کے درمیان پہچان کرائی، اور احباب کے ساتھ تعلق قائم ہو گیا۔\n\nاور اسے ہر وہ چیز دکھائی جو پہلی دار میں غائب تھی، اور اس نشأت کو دوسری دار میں بسایا جسے جنت کہا جاتا ہے، کیونکہ اس نے دوسری دار کو دو منزلوں میں تقسیم کیا: یہ ایک منزل ہے، اور دوسری منزل جسے جہنم کہا جاتا ہے، اس نے اس کے ناطق نفوس کے بدن کی نشأت کو عنصری بنایا جو تبدیلی کو قبول کرتی ہے، اور اسے جہالت کے ساتھ رکھا اور اس سے علم سلب کر لیا۔ پس اس نے اس دارِ شقاوت کے اہل میں سے مقلد مومنوں کی جہالت کو اس عالم کو عطا کیا جو امور کی باریکیوں کو جانتا تھا، پس وہ اس جہالت کی وجہ سے آگ میں داخل ہوا، کیونکہ وہ اس کا اہل تھا، اور وہ عالموں کو قبول نہیں کرتی۔ اور اس عالم کو جو دنیا میں امور کی باریکیوں کو جانتا تھا اور اہل جنت میں سے نہیں تھا، مقلد مومن کی جہالت عطا کی، کیونکہ جنت جہالت کا گھر نہیں ہے۔ پس احمق مقلد مومن اس عالم پر اپنی جہالت کو دیکھے گا، پس وہ اس صفت سے اللہ کی پناہ مانگے گا اور اس کی قباحت کو دیکھے گا، اور اللہ کا شکر ادا کرے گا اس نعمت پر جو اس نے اسے عطا کی، اس علم کے لباس کے ذریعے جو اس نے اس عالم سے لیا جو اہل جہنم میں سے ہے۔ اور وہ عالم اسے دیکھے گا، پس اس کی حسرت میں اضافہ ہو گا، اور وہ جان لے گا کہ دار نے یہ حقائق اپنے لیے عطا کیے ہیں۔ پس وہ کہے گا: \"يا لَيْتَنا نُرَدُّ ولا نُكَذِّبَ بِآياتِ رَبِّنا ونَكُونَ من الْمُؤْمِنِينَ\" (اے کاش! ہمیں واپس بھیج دیا جائے اور ہم اپنے رب کی آیات کو نہ جھٹلائیں اور مومنوں میں سے ہو جائیں) کیونکہ وہ جانتے تھے کہ جب وہ مومن تھے، اگرچہ جاہل تھے، تو جب وہ دارِ سعادت کی طرف منتقل ہوں گے تو ان سے جہالت کے لباس اتار لیے جائیں گے اور انہیں علم کے خلعت پہنائے جائیں گے۔ پس وہ اس کی پرواہ نہیں کریں گے کہ وہ دنیا میں کس جہالت پر تھے، انجام کی خوبی کی وجہ سے۔ اور وہ نہیں جانتے تھے کہ اگر انہیں دنیا میں اسی نشأت میں واپس بھیجا جاتا جس پر وہ تھے، تو وہ اس کے حکم کی طرف لوٹ جاتے۔ کیونکہ خاصیت کے ساتھ فعل تبدیل نہیں ہوتا۔ پس انہوں نے جو کچھ اس تمنا کے ساتھ کہا، وہ صرف اس نشأت کی زبان سے کہا جس میں وہ ہیں، اور انہوں نے یہ گمان کیا کہ وہ علم ان پر باقی رہے گا۔ اور اللہ نے اس دنیاوی نشأت میں علم والوں کے لیے نسیان (بھول) کو اس چیز کے بارے میں نہیں رکھا جسے وہ جان چکے تھے، اور وہ جانتے ہیں کہ وہ کسی امر کو جان چکے تھے، پس وہ اسے حاضر کرنے کی کوشش کرتے ہیں لیکن اسے نہیں پاتے، باوجود اس کے کہ وہ اس کے عالم تھے، مگر یہ کہ یہ علامات اور تنبیہات ہیں کہ \"أَنَّهُ عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ\" (یقیناً وہ ہر چیز پر قادر ہے) اس طرح کہ جب وہ آگ میں داخل ہوں گے تو ان سے وہ علم سلب کر لے گا جس کے وہ عالم تھے۔ \"يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ\" (وہ جسے چاہتا ہے اپنی رحمت کے لیے خاص کر لیتا ہے) اور یہ اللہ تعالیٰ کا فرمان ہے: \"قُلِ اللَّهُمَّ مالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ من تَشاءُ\" (کہو: اے اللہ! بادشاہی کے مالک! تو جسے چاہتا ہے بادشاہی دیتا ہے) اور علم سے بڑھ کر کون سی بادشاہی ہے؟ اور یہ وہ علم ہے جو اس نے آخرت میں مقلد، جاہل، خوش بخت مومن کو عطا کیا، \"وتَنْزِعُ الْمُلْكَ مِمَّنْ تَشاءُ\" (اور جس سے چاہتا ہے بادشاہی چھین لیتا ہے) اور علم سے افضل کون سی بادشاہی ہے؟ پس وہ اسے غیر مومن عالم سے چھین لیتا ہے جو اہل جہنم میں سے ہے، \"وتُعِزُّ من تَشاءُ\" (اور جسے چاہتا ہے عزت دیتا ہے) اس علم کے ذریعے، \"وتُذِلُّ من تَشاءُ\" (اور جسے چاہتا ہے ذلیل کرتا ہے) اس سے وہ علم چھین لینے کے ذریعے۔\n\nجب میں نے جانا کہ اللہ نے مجھے مکلف کیا ہے،\nتو میں نے جانا کہ میں مسئول (جواب دہ) اور مقصود ہوں۔\n\nاور میں ہمیشہ اس کی عبادت کرتا رہوں گا،\nدنیا میں بھی اور آخرت میں بھی، اور ذات حق (الحق) ہی معبود ہے۔\n\nاور وہ اپنی مخلوق میں سے کسی چیز پر ظہور (التجلی) نہیں کرتا،\nمگر یہ کہ وہ گواہی دیتا ہے کہ ذات حق (الحق) مشہود (دیکھا گیا) ہے۔\n\nاس کی صورت کے عین سے، نہ کہ اس کی حقیقت سے،\nپس امر اور شان موجود بھی ہے اور مفقود بھی۔\n\nکیونکہ ہم اسے چہرے کی آنکھوں سے دیکھتے ہیں،\nاور ہم سب اس کا چہرہ ہیں، اور چہرہ محدود ہے۔\n\nوہ ہستی (الوجود) ہے اور جو کچھ کائنات میں ہے وہ اس کی صورت ہے،\nپس رحمن کے سوا وہاں کوئی موجود نہیں۔\n\nدار دو ہیں، دارِ الدار کو لطیف کا گھر آباد کرتا ہے،\nپس کائنات میں کوئی تجرید (خالص تجرید) نہیں۔\n\nاور اگر حقائق (الحقائق) یہ نہ بتاتے کہ انجام آخرت میں رحمت کی طرف ہے، پس وہ اسے معنی اور حس کے لحاظ سے رحم کرے گا، تو وہاں کچھ لوگ ایسے ہوں گے جن کے لیے رحمت صرف عافیت ہی ہو گی، اور بس، اور آلام کا ختم ہو جانا۔ اور یہ ان اہل جہنم کے لیے مخصوص ہے جو اس کے اہل ہیں، پس وہ اس میں نہیں مریں گے، کیونکہ انہیں آلام کے زائل ہونے سے جو عافیت حاصل ہوئی ہے، وہ اسے شیریں سمجھتے ہیں۔ پس وہ عذاب والے ہیں، نہ کہ درد والے، اور وہ زندہ نہیں ہوں گے، یعنی انہیں اہل جنت کی نعمت جیسی کوئی نعمت نہیں ملے گی، جو اس بات سے زائد ہے کہ اللہ نے انہیں دارِ شقاوت سے عافیت دی۔\n\nتمہارے دل میں ایک ایسی آگ ہے جسے وہ بجھا نہیں سکتا،\nمگر وہ جو حسی شہود (الشہود) کے ذریعے اسے پیدا کرتا ہے۔\n\nمیں شرف والوں پر شرف کی وجہ سے خوف کھاتا ہوں،\nپس کون ہے جو میرے دل پر گزرے اور اسے بیدار کرے۔\n\nجب عیبوں والا اسے طلب کرنے آتا ہے،\nتو وہ حال کے شہود (الشہود) کے ذریعے اسے شفا دیتا ہے۔\n\nاور میرے دل پر اس کی نعمت کو کوئی واپس نہیں لاتا،\nمگر وہ جو آج سے پہلے اسے ظاہر کرتا تھا۔\n\n### [علم ہی سعادت ہے]\n\nاور جان لو کہ جس نے آج یہ گمان کیا کہ علم ہی سعادت ہے، تو وہ سچا ہے کہ علم ہی سعادت ہے، اور میں بھی یہی کہتا ہوں۔ لیکن وہ اس چیز سے محروم رہا جسے اہل کشف (الکشف) نے پایا، اور وہ یہ ہے کہ جب اللہ بندے کی شقاوت (بدبختی) کا ارادہ کرتا ہے تو اس سے علم کو زائل کر دیتا ہے، کیونکہ علم اس کے لیے ذاتی نہیں تھا بلکہ اس نے اسے حاصل کیا تھا، اور جو چیز حاصل کی گئی ہو اس کا زائل ہونا جائز ہے۔ اور وہ اسے جہالت کا لباس پہنا دیتا ہے، کیونکہ علم کے چھین لیے جانے کا عین جہالت ہے۔ اور اس پر علم میں سے صرف یہ علم باقی رہتا ہے کہ اس سے علم چھین لیا گیا ہے۔ اگر اللہ تعالیٰ اس پر علم کے چھین لیے جانے کا یہ علم باقی نہ رکھتا تو اسے عذاب نہ ہوتا۔ کیونکہ جاہل جو یہ نہیں جانتا کہ وہ جاہل ہے، وہ خوش اور مسرور ہوتا ہے، کیونکہ اسے یہ معلوم نہیں ہوتا کہ اس نے کیا کھو دیا۔ اگر وہ جانتا کہ اس نے بہت زیادہ خیر کھو دی ہے تو وہ اپنے حال پر خوش نہ ہوتا اور اسی وقت سے تکلیف محسوس کرتا۔ پس اسے تکلیف صرف اس علم کی وجہ سے ہوتی ہے کہ اس نے کیا کھو دیا یا وہ کس حال پر تھا اور اس سے سلب کر لیا گیا۔ اور مجھے اپنے بازو میں درد ہوا، تو میں نے اللہ کی طرف ایوب علیہ السلام کی طرح شکایت کے ساتھ رجوع کیا، اللہ کے ساتھ ادب کی وجہ سے، تاکہ میں الٰہی قہر کا مقابلہ نہ کروں، جیسا کہ اللہ سے ناواقف لوگ کرتے ہیں اور اس میں دعویٰ کرتے ہیں کہ وہ اہل تسلیم و تفویض ہیں اور اعتراض نہ کرنے والے ہیں، پس انہوں نے دو جہالتوں کو جمع کر لیا۔ اور جب مجھے اس چیز کا یقین ہو گیا جو اللہ نے مجھے اس درد میں یقین دلایا، تو میں نے کہا:\n\nمیں نے اس سے اور اپنے بازو سے شکایت کی،\nاور یہ میری طرف سے میری تنگی کی وجہ سے تھا۔\n\nپس میں نے نفس سے کہا: تو اس کا دعویٰ کرتی ہے،\nتو میری وسعت میں تیرا دعویٰ کہاں ہے؟\n\nاس نے کہا: میں اس کی شکایت تجھ سے کرتی ہوں،\nپس میرا نقصان ہی عین میرا فائدہ ہے۔\n\nاگر میں اس چیز کی شکایت نہ کرتی جو میں سہتی ہوں،\nتو میں اس سے اور اپنی طبیعت سے باہر نکل جاتی۔\n\nاور یہ وہ جہالت ہے جسے حال والا دل،\nپیروی کے ذریعے جانتا ہے۔\n\nاگر میری جہالت کی وجہ سے اس سے میری دوستی کی برائی نہ ہوتی،\nتو کوئی مجھے اس کی طرف نہ بلاتا۔\n\nپس میں نے کہا: لبیک، اے مجھے بلانے والے!\nتو اس نے کہا: میں عین متاع (سامان) چاہتا ہوں۔\n\nشوق رائج ہو چکا ہے، پس اسے غنیمت جان،\nکیونکہ میرا عین وصل ہی عین میرا انقطاع (جدائی) ہے۔\n\nپس جو کچھ میں محسوس کر رہا تھا وہ مجھ سے ہلکا ہو گیا،\nاور جو کچھ میں مشاہدہ کر رہا تھا وہ مجھ سے غائب ہو گیا۔\n\nاور اگر عقل کا وجود نہ ہوتا تو میں اسے نہ جانتا،\nاور اگر لوح کا وجود نہ ہوتا تو میں اسے نہ لکھتا۔\n\nاور اگر کائنات کا شہود (الشہود) نہ ہوتا تو میں اسے پورا نہ کرتا،\nاور اگر علم حاصل نہ ہوتا تو میں اسے جاری نہ کرتا۔\n\nپس جس نے کہا کہ مخلوق اپنے وجود کو جانتی ہے،\nتو اس کے پاس اس چیز کا علم نہیں جو اس میں حق ہے۔\n\nاور اس کے لیے اس کی جہالت کی یہ مقدار کافی ہے کہ\nجو امر عین حقیقت میں ہے، وہ اسے کافی ہے۔\n\nجب حقائق (الحقائق) کشف (الکشف) ہو جاتے ہیں تو کوئی شک و شبہ نہیں رہتا، اور دو آنکھوں والے کے لیے اس کی صبح واضح ہو جاتی ہے، تو اطلاع حاصل ہو جاتی ہے اور نزاع ختم ہو جاتا ہے اور سننا حاصل ہو جاتا ہے۔ لیکن تمہارے اور اس حال کے درمیان ہلاکت خیز بیابان ہیں، اور پیاس بجھانے والے صحرا ہیں، اور راستے مٹے ہوئے ہیں، اور نشانات غائب ہیں، جن میں ماہر بھی حیران ہو جاتا ہے۔ اسے صرف وہی عبور کر سکتا ہے جو زندہ کرتا اور مارتا ہے، نہ کہ وہ جو زندہ رہتا اور مرتا ہے۔ پس اس شخص کا کیا حال ہو گا جو ان سختیوں کو برداشت کرتا ہے اور ان تنگ راستوں پر چلتا ہے؟ لیکن مشقتوں کے درد کی مقدار کے مطابق ہی راحتوں کی نعمت ہوتی ہے۔ اور تمہارے سوا وہاں کوئی بیابان یا ہلاکت خیز جگہ نہیں ہے، پس تم ہی اپنے لیے حجاب ہو۔ پس تم خود زائل ہو جاؤ اور معاملہ آسان ہو جائے گا۔ پس جس نے مخلوق کو جانا اس نے ذات حق (الحق) کو جانا، اور جس نے اس معاملے میں سے کسی جز کو نہ جانا اس نے کل کو نہ جانا۔ کیونکہ کل کا جز اس میں عین کل ہے، اس لحاظ سے کہ وہ نہیں جانتا۔ پس اگر وہ جز کو اس کے تمام پہلوؤں سے جان لیتا تو کل کو جان لیتا، کیونکہ اس کے جز ہونے کے پہلوؤں میں سے کل کا علم ہے۔ اور یہ منزل ان منازل میں سے ہے جس کی آیات کثیر ہیں اور اس کی دلالتیں واضح ہیں، لیکن آنکھیں اپنے پردوں کے حکم میں ہیں، اور دل اپنے غلافوں میں ہیں، اور عقلیں خواہشات سے لڑنے میں مشغول ہیں، پس وہ مطلوبہ نظر کے لیے فارغ نہیں ہوتیں۔ اور اس منزل کے علوم میں سے دشمنوں کا مقابلہ کرنے کا علم ہے، اور خواہشات کا خواہشات سے مقابلہ کرنے کا علم ہے۔ کیونکہ اگر عقلیں خواہش کو خواہش سے دفع نہ کریں تو وہ مقصود کو حاصل نہیں کر سکتیں۔ کیونکہ نفوس نے صرف اپنی خواہش سے لینا ہی عادت بنا لیا ہے۔ پس جب عقل سیاست دان ہو اور صورتیں بنانے میں ماہر ہو، تو وہ نفس کے لیے اس کی خواہش کے عین مطابق ایک مطلوبہ صورت بنا دیتی ہے، پس وہ اسے عشق کے ساتھ قبول کرتا ہے، پس وہ اس پر غالب آ جاتی ہے۔ اور اس میں اعداد اور حروف کی خواص کا علم ہے، اور اس میں سادہ اعداد کا علم ہے اور ان کا حکم کیا ہے جب وہ مرکب ہو جائیں، اور کیا ترکیب کے باوجود ان میں وہ خواص باقی رہتے ہیں جو انہیں سادہ ہونے کی وجہ سے حاصل تھے یا نہیں؟ اور اس میں زمانی ظروف کا علم ہے اور وہ کس کے ہاتھ میں ہیں؟ اور اس میں مستقبل کے زمانے کا علم ہے کہ جب وہ حال ہو گا تو اس کا کیا حکم ہو گا؟ اور اس میں علم کی احدیت (وحدت) کا علم ہے، اور اس کی طرف جو کثرت منسوب کی جاتی ہے وہ اس کے عین کی وجہ سے نہیں ہے، بلکہ اس کے متعلقات کی وجہ سے ہے۔ اور اس میں مکانی ظروف میں فکری نظر کے نتائج کا علم ہے، اور اس میں دنیا اور آخرت میں اکوان (موجودات) کی مدتوں کا علم ہے، باوجود اس کے کہ آخرت کی کوئی انتہا نہیں ہے۔ اور اللہ کے اس عمومی فرمان کا علم ہے: \"كُلٌّ يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى\" (ہر ایک ایک مقررہ مدت تک چل رہا ہے) پس ہر چیز کی ایک انتہا ہونا ضروری ہے، اور اشیاء کا وجود ختم نہیں ہوتا، پس ان کی انتہائیں ختم نہیں ہوتیں۔ پس اللہ ہر وقت نئی چیزیں پیدا کرتا ہے، اور ہر چیز کی ایک انتہا ہے، وہی انتہا اس کی مقررہ مدت ہے۔ پس مدت صرف اعیان (موجودات) کے احوال کے لیے ہے، اور اعیان کی انتہا عین ہے، نہ کہ کوئی غایت۔ اور اس میں حقیقت اور مجاز کا علم ہے، اور اعتبار کا علم ہے، اور کس چیز سے تعبیر کیا جاتا ہے اور کس چیز کی طرف تعبیر کیا جاتا ہے، اور اس کا کیا فائدہ ہے؟ اور اس میں دونوں داروں کی آبادی کا علم ہے، جس کا ایک حصہ ہم نے اس باب میں ذکر کیا ہے اور اسے مکمل نہیں کیا۔ اور اس میں ساعت (وقت) کے احکام کے اختلاف کا علم ہے، اور اس میں مکلفین کے احوال کے اختلاف کا علم ہے، اور یہ کہ اللہ ہر صنف کو اس حیثیت سے مخاطب کرتا ہے جس پر وہ صنف ہے، اس سے زیادہ نہیں کرتا۔\n\nاور اس میں وہ علم ہے جو یہ فیصلہ کرتا ہے کہ امر سارا کا سارا ابتداء ہے، اس میں کوئی اعادہ (دہرانا) نہیں ہے۔ اور اس میں اس بات کا علم ہے کہ ذات حق (الحق) خطاب میں مخاطب کی سمجھ کے مطابق اترتا ہے، اور وہ سب حق ہے، اگرچہ اس میں تضاد ہو اور تقابل ظاہر ہو۔ پس وہاں ایک ہی عین ہے جو اسے جمع کرتی ہے، جیسے سیاہی اور سفیدی دو متضاد ہیں جنہیں رنگ جمع کرتا ہے، اور جیسے رنگ مختلف حقائق ہیں جنہیں عرض (صفت) جمع کرتا ہے۔ اور اس میں تشبیہ کے عین کے ساتھ توحید کا علم ہے، اور اس میں فضیلت کا علم ہے، اور اس میں اللہ کے کلمات کا حکم اللہ کی مخلوق کے حکم جیسا ہونے کا علم ہے۔ اور اس میں کونی اعمال کی تشکیل اور انہیں صورتوں میں قائم کرنے کا علم ہے، اور اس میں جمع اور وجود کا علم ہے، اور اس میں اس چیز کا علم ہے جو طبیعی نشأت احکام میں سے تقاضا کرتی ہے، اور اس میں علتوں، اسباب اور جزا کا علم ہے، اور اس میں دنیا کے اسباب اور آخرت کے اسباب کے درمیان فرق کا علم ہے، اور دنیا کے اسباب کی آخرت کے اسباب پر فضیلت کا علم ہے۔ اور اس میں اس چیز کا علم ہے جو انسان کو اس کے عمل سے لوٹتا ہے، اور جو کچھ وہ اللہ کی طرف منسوب کرتا ہے، اسے اپنے نفس کی طرف منسوب کرتا ہے۔ اور اس میں کونی اسباب سے الٰہی تکوین کا علم ہے، اور وہ صرف علوی برزخی آثار ہیں۔ اور اس میں فلکی حرکات کی تبدیلی سے احوال کی تبدیلی کا علم ہے، اور اس میں حیوان کے حال کا علم ہے اس کی نشأت سے لے کر اس کی موت تک۔ اور اس میں الٰہی قیاس کا علم ہے، اور اس میں کائنات کا کائنات میں اثر ڈالنے کا علم ہے، اور اس علم کا علم ہے جس سے اس اثر سے بچا جاتا ہے۔ اور اس میں قیامت اور اس کے احوال اور مراتب کا علم ہے، اور اس میں پورے عالم کے امر کا علم ہے، اور اس میں الٰہی نوامیس (قوانین) والوں کی عقلی حکمی نوامیس والوں پر فضیلت کا علم ہے۔ پس یہ ان علوم کا ذکر ہے جو یہ منزل زیادہ تر اپنے اندر رکھتی ہے، اور \"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب سیصد و پنجاه و چهارم در معرفت منزل اقصای سریانی، که از حضرت محمدیه (الحضرة المحمدية) است.\n\nمعدن آیات در عجم (غیر عرب) است *** و جامع خیر در کلمات است\nفطرت رحمان مرا می‌طلبد *** با انواع حکمت‌ها و احکام\nپس باید در بلندای دیده‌بانی باشی *** همچون شهابی که بر کوهی نمایان شود\nاوست که ابرهایش را می‌راند *** در ابری از نور و ظلمت\nو آنچه را که طالب آنی، پیروی کن *** و از جایگاه تهمت‌ها برتر شو\nاین وصیتی است که صادر شده *** از دیده‌ای تیزبین و غیر کور.\n\n### [اینکه تنزیه (التنزيه) در بنده، نظیر تنزیه در حق (الحق) است]\n\nبدان، خداوند تو را با روحی از جانب خود تأیید کند، که تنزیه (التنزيه) در بنده دقیقاً نظیر تنزیه در حق (الحق) است. پس هر کس حق (الحق) را هنگام انجام عباداتی که خداوند عقلاً و شرعاً بر او واجب کرده است، در عهدی که از او گرفته، تنزیه کند؛ خداوند خود را در این حکم با بنده‌اش شریک می‌سازد، به واسطه‌ی آنچه بر خود واجب کرده است، از رحمتی که بر خود نوشته و وفای به عهدش. و بنده را از انجام آنچه بر او واجب شده تبرئه می‌کند، به این صورت که برای او کشف (الکشف) می‌کند که حق (الحق) به جای او در آنچه مکلف به انجامش شده، قیام کرده است. عملی که اهل حجاب آن را به بنده نسبت می‌دادند و می‌گفتند: «فلانی از کسانی است که به عهد خدا وفا می‌کنند و پیمان را نمی‌شکنند.» (الَّذِينَ يُوفُونَ بِعَهْدِ الله ولا يَنْقُضُونَ الْمِيثاقَ). پس خداوند او را از آنچه می‌گفتند تبرئه کرد و او نزد خدا به سبب این تبرئه آبرومند (وجیه) بود. پس آنان هنگام این شهود (الشهود) به نور ایمان گفتند: «هیچ فاعلی جز خدا نیست.» و سخنی استوار (قَوْلًا سَدِيداً) گفتند. و خداوند بندگان مؤمن خود را امر کرده است که چنین بگویند. پس اگر چنین گفتند، اعمالشان را اصلاح می‌کند و گناهانشان را می‌آمرزد. و هر کس از خدا و رسولش اطاعت کند، قطعاً به رستگاری بزرگی (فازَ فَوْزاً عَظِيماً) دست یافته است.\nپس سعادتمند کسی است که خداوند میان او و ربوبیتش (الربوبية) حائل شود و او را در تمام احوالش به عنوان بنده برپا دارد؛ بنده از روی ایمان می‌ترسد و امید می‌ورزد، نه از روی مشاهده (عیان).\n\nبنده کسی است که می‌ترسد و امید می‌ورزد *** نه آنکه از او می‌ترسند و به او امید می‌ورزند\nو به همین دلیل از هر بدی در امان است *** و به همین دلیل از هر فعلی رانده می‌شود\nپس او را در هر رویی سعادتمند می‌بینی *** و اگر بلغزد، به واسطه‌ی قضا نجات می‌یابد\nبنده در میان وفود (گروه‌ها) به سوی او محشور می‌شود *** و اگر بنده نباشد، امید به او می‌رود\nپس اگر آنکه تقوا پیشه کرد نجات یافت *** آنکه در معارف (المعارف) قیام کرد، نجات‌یافته‌تر است\nهر کس حقایق را از او درک کند *** آنچه نزد اوست، از آن حقایق، نجات‌بخش است.\n\n### [اینکه عالم نزد خدا کسی است که علم ظاهر و باطن را بداند]\n\nبدان، خداوند تو را تأیید کند، که عالم (دانشمند) نزد خدا کسی است که علم ظاهر و باطن را بداند. و هر کس میان این دو جمع نکند، نه عالم خاص است و نه برگزیده. و سبب آن این است که حقیقت علم، صاحبش را باز می‌دارد از اینکه در احوالش به گونه‌ای عمل کند که مخالف علمش باشد. پس هر کس ادعای علم کند و در حالی که عقلاً و شرعاً عمل به آن بر او واجب است، خلاف آن عمل کند، نه عالم است و نه در صورت عالم ظاهر شده است. و خود را فریب مده، زیرا عواقب آن جز به خودت باز نمی‌گردد. اگر بگویی: «ما کسانی را می‌یابیم که می‌دانند، اما توفیق عمل به علمشان نصیبشان نمی‌شود، پس ممکن است علم باشد و عمل نباشد.» می‌گوییم: این از جانب گوینده‌اش اشتباه است، زیرا باید بدانی که نام علم بر آنچه علم است و آنچه علم نیست اطلاق می‌شود. خداوند متعال می‌فرماید: «پس از کسی که از یاد ما روی گردانده و جز زندگی دنیا را نخواسته است، اعراض کن. این نهایت دانش (ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ) آنهاست.» (فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا). پس به ما خبر داد که آنان به آنچه می‌دانستند عمل کردند، اما من از علم جز آنچه از مشاهده‌ی معلوم حاصل شود، اراده نمی‌کنم. اگر از دلیل فکری حاصل شود، علم حقیقی نیست، هرچند در نفس‌الامر علم باشد.\nچنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که سوره‌ای از قرآن را ذکر کرد و نامش را نبرد تا اصحابش را بیازماید، در ذهن برخی از اصحابش افتاد که شاید فاتحه باشد. پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داد که آن فاتحه است، اما برای آن صحابی به صورت قطعی حاصل نشده بود. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که او را از آنچه در ذهنش افتاده بود آگاه ساخت، به او فرمود: «علم بر تو گوارا باد.» (ليهنك العلم).\nپس آن علم در نفس‌الامر علم بود، نه نزد آن صحابی که آن امر برایش رخ داده بود. چون این چنین بود، کسانی که به عمل برخلاف علم با وجود علم قائل شدند، به این سمت رفتند. اما صحیح آن است که اگر آن را بیازمایی و در آن تحقیق کنی، حق را در آنچه ما به آن معتقدیم خواهی یافت. و به همین دلیل،\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به کسی که از او فهمید، فرمود: «خداوند هرگاه بخواهد قضا و قدرش را جاری سازد، عقل‌ها را از صاحبان عقول سلب می‌کند، تا زمانی که قضا و قدرش را در مورد آنان جاری ساخت، آن را به ایشان باز می‌گرداند تا عبرت گیرند.»\nو این جز رفتن علم از آنان نیست، و عبرت گرفتن عملی است که علم آن را واجب کرده است. پس این عین همان چیزی است که ما به آن معتقدیم. خداوند متعال در حق قومی می‌فرماید: «ظاهری از زندگی دنیا را می‌دانند» (يَعْلَمُونَ ظاهِراً من الْحَياةِ الدُّنْيا) پس به آنچه دانستند عمل کردند، «و آنان از آخرت غافلند» (وَهُمْ عَنِ الْآخِرَةِ هُمْ غافِلُونَ) پس برای آن عمل نکردند، زیرا خداوند آنان را از آن غافل ساخت، پس آخرتشان را فراموش کردند و عمل برای آن را ترک نمودند. «همانا در این [امر] تذکری است» (إِنَّ في ذلِكَ لَذِكْرى‏) «برای کسی که قلب دارد یا گوش فرا دهد در حالی که شاهد است» (لِمَنْ كانَ لَهُ قَلْبٌ أَوْ أَلْقَى السَّمْعَ وهُوَ شَهِيدٌ). خداوند متعال امرکننده می‌فرماید و تذکر می‌دهد، یعنی علم را به کسی که از آن غافل شده یا آن را فراموش کرده است، یادآوری می‌کند: «پس تذکر (الذِّكْرى‏) مؤمنان را سود می‌بخشد» (فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ). و مؤمنان کسانی هستند که آنچه در آنجاست را به نور ایمان (الایمان) از طریق کشف (الکشف) دانسته‌اند، سپس غافل شده‌اند، پس میان آنان و آنچه می‌دانستند حائل شده است. و آنچه برایشان مشهود بود، همان چیزی بود که در وقت فراموشی‌شان به آن عالم بودند. پس هرگاه تذکر یابند، به یاد می‌آورند و شهود (الشهود) آنچه را که قبلاً می‌دانستند برایشان برپا می‌شود، پس تذکر به آنان سود می‌رساند و به آنچه دانستند عمل می‌کنند. پس خداوند شهادت داد: «پس تذکر مؤمنان را سود می‌بخشد» (فَإِنَّ الذِّكْرى‏ تَنْفَعُ الْمُؤْمِنِينَ). پس اگر کسی را دیدی که ادعای ایمان می‌کند و تذکر می‌یابد، اما سودی از آنچه به آن تذکر داده شده نمی‌برد، بدان که او در حال حاضر به آنچه ایمان آورده عالم نیست، پس اصلاً مؤمن نیست. زیرا شهادت خدا حق است و او راستگوست، و به ما خبر داده که مؤمن از تذکر سود می‌برد، و ما شاهدیم که این شخص از تذکر سودی نبرده است، پس ناگزیر باید ایمان را از او سلب کنیم تا خدا را تصدیق کرده باشیم. و معنای سود بردن جز وجود عمل از جانب او به آنچه دانسته نیست. و ما کسی را نمی‌بینیم که در آنچه گمان می‌کند به آن عالم است، در عمل توقف کند، مگر اینکه در نفس او احتمالی وجود داشته باشد. و کسی که در مورد چیزی برایش احتمال وجود داشته باشد، نه عالم به آن است و نه به کسی که آن را به او خبر داده، ایمانی آورده که علم را برایش واجب کند. با این حال، اگر از او بپرسی، به تو خواهد گفت: «ما شک نداریم که آنچه این شخص (یعنی رسول علیه السلام) آورده حق است و من به آن مؤمن هستم.» این سخن صحیح نیست، مگر در وقت ادعای او نزد برخی مردم. سپس وقتی با فکر خود خلوت می‌کند، احتمال با او برپا می‌شود. پس آن چیزی که تصور می‌کرد علم است، امری عارضی بوده که برایش پیش آمده است. و برخی از آنان، احتمال در وقت شهادتشان به اینکه این حق صریح است، از بین نمی‌رود، با وجود احتمال. و سبب این شهادت آن است که وقتی امری احتمال صدق و احتمال کذب دارد، در آن وقت صدق آن بر او تجلی (التجلی) می‌کند و تصدیق او به آنچه به آن مؤمن است، یکی از محتملات آن خبر است و آن صدق بودن آن است. این همان چیزی است که در آن حال برای او مشهود می‌شود، پس در آن وقت به صدق آن قطع پیدا می‌کند.\nو نمی‌داند که این از تجلی (التجلی) یکی از محتملات آن است. پس وقتی آن وارد از او غایب شود، محتملات به طور مساوی برایش برپا می‌شوند، پس آن امر نزد او جز از طریق گمان، نه از طریق علم، ترجیح نمی‌یابد. پس ای برادر من، بنگر که آفات نفس چقدر پنهان است و حجاب جهل چقدر بزرگ است، با اینکه جهل عدم است. پس حال ما چگونه خواهد بود اگر وجود می‌داشت؟ حمد و منت از آن خداست. ما تو را به این امر آگاه ساختیم تا بهره‌ی خود را از ایمان و منزلتت بدانی.\nزیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در حدیث صحیح از او می‌فرماید: «زناکار در حین زنا، مؤمن نیست.»\nیعنی تصدیق‌کننده به عقوبت آن نیست، زیرا خداوند ممکن است ببخشد. و اگر ایمان، کشفی (الکشف) را که علم می‌دهد، ندهد، پس ایمان نیست.\n\n### [اینکه علم، عمل را از پشت حجابی رقیق می‌دهد]\n\nپس بدان که علم، عمل را از پشت حجابی رقیق می‌دهد. و در حدیث دیگری از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) درباره‌ی زناکار آمده است که وقتی زنا می‌کند، ایمان از او خارج می‌شود تا اینکه مانند سایه‌ای بر او قرار می‌گیرد.\nو ما در این باره تأویل نیکویی داریم و آن این است که زناکار در معرض بلایی از جانب خدا قرار می‌گیرد که بر او نازل می‌شود، پس ایمان خارج می‌شود تا مانند سایه‌ای بر او قرار گیرد و مانع نزول آن بلا بر او شود، اگر نازل شود. پس ای ولیّ، از این نکته‌ای که تو را به آن آگاه ساختم غافل مشو. آیا نمی‌بینی که خداوند آیات را برپا نساخت و زیاد نکرد، مگر برای اینکه علم به واسطه‌ی آنها حاصل شود، زیرا می‌دانست که اگر علم حاصل شود، عمل لازم می‌آید؟ آیا به کسی که دارو می‌نوشد نگاه نمی‌کنی؟ او آن را ننوشیده و تلخی‌اش را تحمل نکرده، مگر به این دلیل که می‌داند دارویی وجود دارد که این بیماری‌ای را که از آن شکایت دارد، برطرف می‌کند. پس می‌گوید: «شاید آن دارو عین همین باشد که نوشیدم.» پس آن را با احتمال و امید می‌نوشد. حالش چگونه بود اگر بدون شک می‌دانست که عین آن دارو است؟ قطعاً به سوی آن می‌شتافت. این حال او با امید و احتمال است. اگر بگویی: «پس سخن خداوند متعال: «و او را با وجود علم گمراه ساخت» (وَأَضَلَّهُ الله عَلى‏ عِلْمٍ) در حق کسی که «هوای نفس خود را معبود خویش قرار داد» (اتَّخَذَ إِلهَهُ هَواهُ) چیست؟» می‌گوییم: معبود (الإله) در معبودشده (المألوه) قدرت دارد، و معبود این شخص هوای نفس اوست، پس بر او حکم راند و او را از راه خدا گمراه ساخت. اما سخن او: «با وجود علم» (عَلى‏ عِلْمٍ) یعنی از این جهت که خداوند او را گمراه ساخت، با علم بود، نه اینکه گمراه با علم باشد. زیرا گمراه (الضال) همان سرگشته‌ای است که نمی‌داند مطلوبش در کدام جهت است. پس «با وجود علم» متعلق به «گمراه ساخت» است و عامل در آن است و آن فعل خداوند متعال است. و آنچه بر عهده‌ی خداست، فقط بیان است. خداوند متعال می‌فرماید: «و خدا بر آن نیست که قومی را پس از آنکه هدایتشان کرد، گمراه سازد، مگر اینکه آنچه را باید از آن بپرهیزند برایشان بیان کند» (وما كانَ الله لِيُضِلَّ قَوْماً بَعْدَ إِذْ هَداهُمْ حَتَّى يُبَيِّنَ لَهُمْ ما يَتَّقُونَ). یعنی قومی را پس از آنکه در گرفتن میثاق و فطرت (الفطرة) که بر آن متولد شدند، هدایتشان کرد، سرگشته سازد، مگر اینکه آنچه را باید از آن بپرهیزند برایشان بیان کند. پس وقتی برایشان بیان کرد، آنان را سرگشته ساخت. پس برخی از آنان را با واسطه سرگشته ساخت، پس در نبوت شک کردند و در آن سرگشته شدند و به اینکه این شخص پیامبر است یقین نیافتند، پس در گرفتن [تعالیم] از او توقف کردند. و برخی را در اصل نبوت سرگشته ساخت که آیا وجود دارد یا خیر. و برخی را در آنچه این پیامبر آورده و ادله‌ی نظری آن را محال می‌دانند، سرگشته ساخت. پس بیان الهی این سرگشتگی را برایشان به ارث گذاشت و این به دلیل نبود ایمان است. پس آنان نور ایمانی نداشتند که حقیقت آنچه خدا گفته و بیان کرده است را برایشان کشف (الکشف) کند. و کسی که خداوند برای او نوری از ایمانش قرار نداده است، «پس برای او نوری در قیامت نیست» (فَما لَهُ من نُورٍ). «همانا خداوند به هر چیزی داناست» (أَنَّ الله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ)، پس به آنچه می‌داند که خواهد بود، عمل می‌کند و آنچه را که می‌داند نخواهد بود، ایجاد نمی‌کند. پس عمل او به علمش است. بگو: «آن را با علم خود نازل کرده است» (قُلْ أَنْزَلَهُ بِعِلْمِهِ). و انزال عملی است که علم آن را واجب کرده است. پس هنگامی که حق (الحق) آنچه را بیان کرد، برای بندگانش بیان نمود، برخی از آنان را خداوند علم روزی داد، پس به آن عمل کردند، و برخی را خداوند از علم محروم ساخت، پس گمراه شدند و سرگشته گشتند و شک کردند و تردید نمودند و توقف کردند. اما سخن خداوند متعال: «کسانی که کتاب را به آنان دادیم، او را می‌شناسند، همان‌گونه که فرزندان خود را می‌شناسند» (الَّذِينَ آتَيْناهُمُ الْكِتابَ يَعْرِفُونَهُ كَما يَعْرِفُونَ أَبْناءَهُمْ)، آنان کتاب خود را تصدیق می‌کنند و این صفت در آن است. و آن را دیده‌اند، پس می‌دانند که عین این صفت است، اما شخصی را که این صفت در اوست نمی‌شناسند، زیرا ممکن است آن صفت در افراد بسیاری وجود داشته باشد. پس احتمال در شخص وارد شد، نه در صفت. و اما سخن خداوند متعال: «و همانا گروهی از آنان حق را کتمان می‌کنند، در حالی که می‌دانند» (وَإِنَّ فَرِيقاً مِنْهُمْ لَيَكْتُمُونَ الْحَقَّ وهُمْ يَعْلَمُونَ) که آن حق است، پس آن را از مقلدان خود و از پیامبر (علیه السلام) کتمان می‌کنند که او را به عنوان صاحب این صفت شناخته‌اند. و عالم به حق، ملزم به اقرار ظاهری به آن نیست، بلکه ملزم به تصدیق باطنی آن است. پس او آن را تصدیق می‌کند، هرچند با زبان تکذیب کند. پس به آنچه دانسته عمل کرده است و آن تصدیق است. و سخن خداوند متعال در این باره: «و نفس‌هایشان به آن یقین داشت» (واسْتَيْقَنَتْها أَنْفُسُهُمْ) که آنها آیات هستند، پس دانستند و به آنچه دانستند عمل کردند و آن یقین است که استقرار علم در نفس است. اگر نمی‌دانستند، یقین نمی‌کردند. و هر عملی نجات عمومی نمی‌دهد، بلکه به اندازه‌ی خاصی از نجات، از عموم یا خصوص، می‌دهد. اگر بگویی: «اهل آتش صدق خدا را در اجرای وعید دانسته‌اند و گفتند: «پروردگارا، ما را خارج کن تا عمل صالحی غیر از آنچه انجام می‌دادیم، انجام دهیم» (رَبَّنا أَخْرِجْنا نَعْمَلْ صالِحاً غَيْرَ الَّذِي كُنَّا نَعْمَلُ). پس شک نداریم که در این حال علم برایشان حاصل شده است. و خداوند می‌فرماید: «و اگر بازگردانده شوند، قطعاً به آنچه از آن نهی شده بودند باز می‌گردند» (ولَوْ رُدُّوا لَعادُوا لِما نُهُوا عَنْهُ)، با وجود این علم ذوقی که برایشان حاصل شده است.» می‌گوییم: چون خداوند دانست که این سرای دنیا را بر طبیعت خاصی قرار داده است و نشأت انسان را بر مزاجی قرار داده که نسیان و غفلت و دوست داشتن امور زودگذر را می‌پذیرد و ضد این را نیز می‌پذیرد، بسته به آنچه در آن برپا می‌شود. پس سبحانه دانست که نشأت این کسانی که معین کرده است، اگر به دنیا بازگردانده شوند، در همان نشأتی که در دنیا داشتند، به فراموشی آنچه دانسته بودند باز می‌گردند. و بر چشمانشان پرده‌ای قرار داد که اگر آن را مشاهده می‌کردند، امر را می‌دانستند و برای آن عمل می‌کردند. پس این معنای «قطعاً به آنچه از آن نهی شده بودند باز می‌گردند» است، زیرا نشأت جز آن نیست. اگر این علم برایشان باقی می‌ماند، باز نمی‌گشتند.\nآیا نمی‌بینی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در حدیث صحیح از او می‌فرماید: «در قیامت، خوش‌نعمت‌ترین اهل دنیا آورده می‌شود و یک بار در آتش فرو برده می‌شود. سپس به او گفته می‌شود: آیا هرگز نعمتی دیده‌ای؟ می‌گوید: نه به خدا.» و معلوم است که او نعمت دیده است، اما شاهد حال، او را از آن نعمت محجوب ساخته، پس آن را فراموش کرده است. و همچنین صاحب بدبختی، وقتی یک بار در بهشت فرو برده می‌شود، به او گفته می‌شود: آیا هرگز بدبختی دیده‌ای؟ می‌گوید: نه به خدا، هرگز بدبختی ندیده‌ام.\nپس همچنین اگر بازگردانده شوند، بر حسب نشأت و حالی خواهند بود که در آن بازگردانده می‌شوند. اما گناهکاران مؤمن، آنان به اجرای وعید عالمند، اما نمی‌دانند در حق چه کسی اجرا می‌شود. پس اگر برای یکی از آنان معین می‌شد که او کسی است که وعید در حقش اجرا می‌شود، هرگز بر سبب آن اقدام نمی‌کرد، زیرا می‌دانست که اجرای وعید به واسطه‌ی آن برایش حاصل می‌شود. و اگر در اختیارش مجبور باشد، این را نمی‌داند، زیرا آن را از نفس خود نمی‌یابد. زیرا امر در این باره مشترک است و پیش از این در برخی منازل در مورد آن سخن گفته شده است. پس کسی که جبر را در اختیار خود، از طریق کشف (الکشف) و شهود (الشهود) بداند، مخالفت را به حکم تقدیر انجام می‌دهد، نه به حکم هتک حرمت. پس او به آنچه دانسته عمل کرده است و آن عمل به او ضرر نمی‌رساند، بلکه برای او آمرزیده شده است.\n\n### [اینکه برخی از علم‌ها به هیئت مکنون (پنهان) است و جز عالمان به خدا آن را نمی‌دانند]\n\nو بدان که این مقداری که در این مسئله ذکر کردیم، از علمی است که در مورد آن خبری وارد شده که لفظش این است: «همانا برخی از علم‌ها به هیئت مکنون (پنهان) است و جز عالمان به خدا (العالمون بالله) آن را نمی‌دانند. پس هرگاه به آن سخن گویند، جز اهل غرّه (فریب‌خوردگان) به خدا، آن را انکار نمی‌کنند.» و این از طریق کشف (الکشف) نزد اهلش، حدیثی صحیح و مورد اجماع نزد خاصه‌ی آنان است که آن را شناخته و به آن یقین یافته‌اند. آن را «به هیئت مکنون» قرار داد، نه اینکه آن را مکنون (پنهان) قرار داده باشد، زیرا اگر مکنون بود، فقط مخصوص به او تعالی می‌شد. پس چون جز عالمان به خدا آن را نمی‌دانند، دانستیم که علم به خدا، علم به آنچه خدا می‌داند را به ارث می‌گذارد. پس این علم از عموم پوشیده و برای خواص معلوم است. و معنای علم به خدا این است که او دانسته نمی‌شود. پس دانستیم که امری هست که به طور معین دانسته نمی‌شود و غیر از آن را می‌توان دانست. پس پوشش‌های این علم، قلب‌های عالمان به خداست. پس هرگاه در میان خود به آن سخن گویند، زیرا سخن گفتن به آن جز در این حد صحیح نیست، و اتفاقاً در مجلس کسی باشد که از اهل آن و از اهل خدا نباشد، زیرا اهل خدا همان اهل ذکر و عالمان به خدا هستند، اهل غرّه (فریب‌خوردگان) به خدا آن را انکار می‌کنند. پس اهلیت آنان را به غرّه (فریب) نسبت داد و آنان کسانی هستند که گمان می‌کنند خدا را شناخته‌اند. و از علمی که به هیئت مکنون است و مکنون نیست، همین علم است. زیرا علم مکنون به شهود (الشهود) دانسته می‌شود و قابل بیان نیست، برخلاف علوم فکری که همگی قابل بیان هستند. و اگر این علم برای صاحب کشف (الکشف) نیز بدون فکر و تأمل حاصل شود، بدون دلیل قابل بیان است، پس عالم به دلیل آن را از او می‌پذیرد. پس این علم همان است که به هیئت مکنون است، زیرا عالم به آن، عالم به دلیل نیست. پس بدان که دیار دو دیار است: دیاری که ارواح ناطقه در آن ساکن می‌شوند و آن بدن طبیعی، موزون و معتدل است که خداوند آن را با دستان خود آفرید و دو صفت خود را بر آن متوجه ساخت. پس هنگامی که آن را ایجاد کرد، آن را در دیار دیگری ساکن ساخت که آن «دار الدار» (سرای سرا) است. و سبحانه دار الدار را به دو بخش تقسیم کرد: بخشی را دنیا نامید و بخشی را آخرت. سپس دانست که چه چیزی برای سکونت هر دیار از ساکنانی که دیار نفوس ناطقه هستند، مناسب است. پس برای سرای دنیا، به دلیل فنا و زوال عین آن و تغییر صورت و وضع و شکل آن و پنهان بودن حیاتش، ساکنی آفرید که همین سرایی است که نفس ناطقه را در آن ساکن ساخت. پس این نشأت (النشأة) را مانند سرای سکونتش قرار داد: حیاتش پنهان، فانی، زائل‌العین، متغیرالصوره و وضع و شکل. پس ساکن آن، یعنی نفس ناطقه، به جهل، حجاب، شک، گمان، کفر و ایمان متصف شد. و این به دلیل کثافت این سرای نشأت بدنی اوست. و میان او و شهود (الشهود) خدا حائل شد و او را در دامن مادرش قرار داد تا به او شیر دهد و از او مراقبت کند. پس از زمانی که در این نشأت ساکن شد، جز عین مادرش را مشاهده نکرد، تا جایی که برخی از ساکنان پدرش را نمی‌شناسند. و اگر خداوند بر او منت نمی‌گذاشت و خواب را برای او قرار نمی‌داد و در آن امری به نام رؤیا در قوه‌ای به نام خیال قرار نمی‌داد، هنگامی که می‌خوابید، گویی از این نشأت خارج می‌شد، پس پدرش به او نگاه می‌کرد و از او شاد می‌شد و روحی به او القا می‌کرد و با او انس می‌گرفت و ارواح به سوی او می‌شتافتند و حق (الحق) از تنزیه (التنزيه) خود برای او نمایان می‌شد و همه‌ی اینها در اجسادی برای او آشکار می‌شد که شهود آنها را از جنس سرای نشأت خود که با خواب از آن جدا شده بود، الفت گرفته بود. پس در خواب گمان می‌کند که در سرای نشأت خود است که به آن الفت گرفته و آن را می‌شناسد و گمان می‌کند که هر آنچه در آن مواد می‌بیند، بر حسب آنچه مشاهده کرده است، می‌باشد. پس این مقدار، همان چیزی است که او در این نشأت دنیا از انس با پدر و برادرانش از ارواح و انس با پروردگارش دارد. و برخی از آنان در این امر چنان قوی می‌شوند که آن را در بیداری خود می‌بینند. و خداوند به او علمی داد که آن را علم تعبیر نامید، که با آن در مشاهده‌ی آن صور به معانی آنها تعبیر می‌کند. پس هرگاه خداوند بخواهد این سرای دنیا را از این نشأت که سرای نفس ناطقه است، خالی کند، روح مدبر آن را از این نشأت کوچ می‌دهد و او را در صورتی برزخی از صور\nکه در حال خواب می‌پوشید، ساکن می‌سازد. پس هنگامی که روز قیامت فرا رسد و خداوند بخواهد او را به سرای دیگر، یعنی دارالحیوان (سرای حیات)، منتقل کند، که سرایی ناطق، آشکارالحیات، ثابت‌العین و غیرزائل است، برای این نفس ناطقه سرایی از جنس این سرای دیگر ایجاد می‌کند که در صفت با آن همجنس باشد، زیرا ساکنی را که با آن مناسب نباشد، نمی‌پذیرد. پس نشأتی بدنی و طبیعی برای سعادتمندان و عنصری برای شقاوتمندان می‌آفریند، پس آن را موزون و معتدل می‌سازد، سپس این نفس ناطقه را در آن ساکن می‌کند. پس حجاب‌های کوری، جهل، شک و گمان را از او برمی‌دارد و او را صاحب علم و نعمت دائمی می‌سازد و پدرش را به او نشان می‌دهد، پس از او شاد می‌شود و خالق و روزی‌دهنده‌اش را به او نشان می‌دهد و میان او و برادرانش آشنایی برقرار می‌کند و جمع با عزیزان منتظم می‌شود.\nو هر چیزی را که در سرای اول غایب بود، به او شهود (الشهود) می‌دهد و این نشأت را در سرای دیگر که بهشت نامیده می‌شود، ساکن می‌سازد، زیرا سرای دیگر را به دو منزل تقسیم کرده است: این یک منزل است و منزل دیگر که جهنم نامیده می‌شود. نشأت بدن نفوس ناطقه‌ی آن را عنصری قرار داد که تغییر را می‌پذیرد و جهل را همراه آن ساخت و علم را از آن سلب کرد. پس جهل مؤمنان مقلد را که از اهل این سرای شقاوت بودند، به عالمی که به دقایق امور عالم بود، داد. پس آن عالم به واسطه‌ی آن جهل وارد آتش شد، زیرا از اهل آن بود و آتش عالمان را نمی‌پذیرد. و این عالم که در دنیا به دقایق امور عالم بود و از اهل بهشت نبود، جهل مؤمن مقلد را به او داد. زیرا بهشت سرای جهل نیست. پس مؤمن ساده‌لوح مقلد، جهلی را که بر آن عالم بود، بر او می‌بیند، پس از آن صفت به خدا پناه می‌برد و زشتی آن را می‌بیند و خدا را بر نعمتی که به او داده است، شکر می‌کند، به واسطه‌ی خلعت علمی که از آن عالم که از اهل آتش است، بر او پوشانده است. و آن عالم به او نگاه می‌کند، پس حسرتش بر حسرتش افزوده می‌شود و می‌داند که سرای، این حقایق را به نفس خود داده است. پس می‌گوید: «ای کاش بازگردانده می‌شدیم و آیات پروردگارمان را تکذیب نمی‌کردیم و از مؤمنان می‌شدیم» (يا لَيْتَنا نُرَدُّ ولا نُكَذِّبَ بِآياتِ رَبِّنا ونَكُونَ من الْمُؤْمِنِينَ). زیرا آنان می‌دانستند که اگر مؤمن باشند، هرچند جاهل، وقتی به سرای سعادت منتقل شوند، جامه‌های جهالت از آنان کنده می‌شود و خلعت علم بر آنان پوشانده می‌شود. پس به آنچه در دنیا بر آن بودند از جهل، به دلیل حسن عاقبت، اهمیت نمی‌دهند. و نمی‌دانستند که اگر به دنیا بازگردانده می‌شدند، در همان نشأتی که بودند، به حکم آن باز می‌گشتند، زیرا فعل به خاصیت تغییر نمی‌کند. پس آنان آنچه را که گفتند، از این آرزو، جز به زبان نشأتی که در آن هستند، نگفتند و تصور کردند که آن علم بر آنان باقی می‌ماند. و خداوند در این نشأت دنیا، نسیان را برای عالمان به چیزی که قبلاً می‌دانستند، قرار نداد. و می‌دانند که امری را می‌دانستند و در پی حاضر کردن آن هستند، اما آن را نمی‌یابند، پس از آنکه به آن عالم بودند، مگر به نشانه‌ها و تذکر. «همانا او بر هر چیزی تواناست» (أَنَّهُ عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ)، به این صورت که علم را از آنان سلب کند، در حالی که به آن عالم بودند، اگر وارد آتش شوند. «به رحمت خود هر که را بخواهد اختصاص می‌دهد» (يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ). و این همان سخن خداوند متعال است: «بگو: بار خدایا، ای مالک مُلک، مُلک را به هر که خواهی می‌دهی» (قُلِ اللَّهُمَّ مالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ من تَشاءُ). و چه مُلکی بزرگتر از علم است؟ و آن همان علمی است که به مؤمن مقلد جاهل سعادتمند در سرای آخرت داده است. «و مُلک را از هر که خواهی می‌گیری» (وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشاءُ). و چه مُلکی برتر از علم است؟ پس آن را از عالم غیرمؤمن که از اهل آتش است، می‌گیرد. «و هر که را خواهی عزت می‌دهی» (وَتُعِزُّ من تَشاءُ) به واسطه‌ی آن علم، «و هر که را خواهی ذلیل می‌کنی» (وَتُذِلُّ من تَشاءُ) به واسطه‌ی سلب آن علم از او.\n\nهنگامی که دانستم خداوند مرا مکلف ساخته *** دانستم که مسئول و مقصود هستم\nو همانا من همیشه او را عبادت می‌کنم *** دنیا و آخرت، و حق (الحق) معبود است\nو بر هیچ چیز از خلقش تجلی (التجلی) نکرد *** مگر اینکه شهادت می‌دهد که حق (الحق) مشهود است\nاز عین صورت او، نه از حقیقت او *** پس امر و شأن موجود و مفقود است\nزیرا ما او را با چشمان وجه می‌بینیم *** و همه‌ی ما وجه او هستیم و وجه محدود است\nاو هستی (الوجود) است و هر که در کائنات است صورت اوست *** پس جز رحمان، موجودی در آنجا نیست\nسرای دو سرای است، سرای سرا را آباد می‌کند *** سرای لطیف، پس در کائنات تجریدی نیست.\n\nو اگر حقایق این را نمی‌دادند که سرانجام به سوی رحمت است، پس او را معناً و حساً در سرای دیگر مورد رحمت قرار می‌دهد. پس کسانی هستند که رحمت برایشان عین عافیت است و بس، و برطرف شدن دردها. و این مخصوص اهل آتشی است که اهل آن هستند. پس آنان در آن نمی‌میرند، به دلیل عافیتی که در آن برایشان حاصل شده است، با زوال دردها. پس آن را شیرین می‌یابند. پس آنان صاحبان عذابند، نه صاحبان درد. و زنده نمی‌شوند، یعنی نعمتی مانند نعمت اهل بهشت ندارند که امری زائد بر عافیت دادن آنان از سرای شقاوت است.\n\nدر قلب تو شعله‌ای است که خاموشش نمی‌کند *** مگر آنکه با شهود (الشهود) حس آن را ایجاد کند\nمن بر اشراف از شرافت می‌ترسم *** پس کیست که بر قلب من بگذرد و آن را آگاه سازد؟\nاگر صاحب عیب‌ها به طلب او آید *** او با شهود (الشهود) حال، او را شفا می‌دهد\nو نعمتش را بر قلب من باز نمی‌گرداند *** مگر آنکه پیش از امروز آن را آشکار کرده بود.\n\n### [اینکه علم همان سعادت است]\n\nو بدان که هر کس امروز گمان کند که علم همان سعادت است، راست می‌گوید که علم سعادت است و من نیز به آن قائلم. اما آنچه اهل کشف (الکشف) درک کرده‌اند، از او فوت شده است و آن این است که هرگاه خداوند شقاوت بنده را بخواهد، علم را از او زائل می‌کند. زیرا علم برای او ذاتی نبوده، بلکه اکتسابی بوده است. و آنچه اکتسابی است، زوالش جایز است. و جامه‌ی جهل را بر او می‌پوشاند. زیرا عین انتزاع علم، جهل است. و از علم برای او باقی نمی‌ماند، مگر علم به اینکه علم از او گرفته شده است. و اگر خداوند این علم را بر او باقی نمی‌گذاشت\nبه انتزاع علم، عذاب نمی‌کشید. زیرا جاهلی که نمی‌داند جاهل است، شاد و مسرور است، چون نمی‌داند چه چیزی را از دست داده است. فلو علم أنه قد فاته خير كثير ما فرح بحاله ولتالم من حينه فما تألم إلا بعلمه ما فاته أو مما كان عليه فسلبه ولقد أصابني ألم في ذراعي فرجعت إلى الله بالشكوى رجوع أيوب عليه السلام أدبا مع الله حتى لا أقاوم القهر الإلهي كما يفعله أهل الجهل بالله ويدعون في ذلك أنهم أهل تسليم وتفويض وعدم اعتراض فجمعوا بين جهالتين ولما تحققت ما حققني الله به في ذلك الوجع قلت\nاگر می‌دانست که خیر بسیاری را از دست داده است، به حال خود شاد نمی‌شد و از همان لحظه درد می‌کشید. پس او درد نمی‌کشد، مگر به علمش به آنچه از دست داده یا آنچه بر آن بوده و از او سلب شده است. و در بازویم دردی به من رسید، پس به خدا شکایت بردم، شکایتی مانند شکایت ایوب (علیه السلام)، از روی ادب با خدا، تا با قهر الهی مقابله نکنم، چنانکه اهل جهل به خدا انجام می‌دهند و در این باره ادعا می‌کنند که اهل تسلیم و تفویض و عدم اعتراض هستند، پس دو جهالت را با هم جمع کرده‌اند. و هنگامی که به آنچه خداوند مرا در آن درد به آن محقق ساخت، یقین یافتم، گفتم:\n\nاز او و از بازویم شکایت کردم *** و این از تنگی میدان عمل من بود\nبه نفس گفتم: ادعایش می‌کنی *** پس ادعای تو در گشایش کجاست؟\nگفت: من از تو به او شکایت می‌کنم *** پس ضرر من عین نفع من است\nاگر شکایت از آنچه می‌کشم نبود *** از او و از طبیعت خود خارج می‌شدم\nو این جهلی است که قلب صاحب حال *** با پیروی آن را درک می‌کند\nاگر شرّ دوری من از او به جهلم نبود *** هیچ دعوت‌کننده‌ای مرا به سوی او نمی‌خواند\nپس گفتم: لبیک ای کسی که مرا خواندی *** گفت: عین بهره را می‌خواهم\nشوق رواج یافته، پس آن را غنیمت شمار *** زیرا عین وصال من، عین انقطاع من است.\n\nپس آنچه می‌یافتم از من سبک شد *** و آنچه شهود (الشهود) می‌کردم از من غایب گشت\nو اگر وجود عقل نبود، آن را درک نمی‌کردم *** و اگر وجود لوح نبود، آن را املا نمی‌کردم\nو اگر شهود (الشهود) کائنات نبود، به آن وفا نمی‌کردم *** و اگر حصول علم نبود، آن را جاری نمی‌ساختم\nپس هر کس بگوید که خلق، هستی (الکون) خود را می‌شناسد *** علمی به آنچه حقش در آن است، ندارد\nو همین مقدار از جهلش به آنچه *** امر در عین حقیقت است، برای او کافی است.\n\nهنگامی که حقایق کشف (الکشف) شوند، دیگر شک و تردیدی نیست و صبح آن برای صاحب دو چشم آشکار می‌شود، اطلاع حاصل می‌شود و نزاع برطرف می‌گردد و استماع به دست می‌آید. اما میان تو و این حال، بیابان‌های هلاک‌کننده و صحرای تشنه‌کننده و راه‌های کهنه و آثار محوشده‌ای است که رهنمای ماهر در آن سرگشته می‌شود. پس آن را قطع نمی‌کند، مگر کسی که زنده می‌کند و می‌میراند، نه کسی که زنده می‌شود و می‌میرد. پس حال کسی که این سختی‌ها را تحمل می‌کند و این تنگناها را می‌پیماید، چگونه است؟ اما به اندازه‌ی دردهای مشقت‌ها، نعمت راحتی‌ها خواهد بود. و در آنجا نه بیابانی است و نه صحرایی جز خودت. پس تو حجاب خودت از خودت هستی. پس تو زائل شو و امر آسان شده است. پس هر کس خلق را بشناسد، حق (الحق) را می‌شناسد. و هر کس بخشی از این شأن را نداند، کل را ندانسته است. زیرا بخشی از کل، عین کل را در خود دارد، از آن جهت که نمی‌داند. پس اگر بخشی را از تمام وجوهش بداند، کل را دانسته است. زیرا از وجوه هستی (الکون) آن بخش، علم به کل است. و این منزل از منازلی است که آیاتش زیاد و دلالت‌هایش روشن شده است، اما دیده‌ها در حکم پوشش‌های خود هستند و قلب‌ها در پوشش‌های خود و عقل‌ها مشغول مباربه با هواها هستند، پس برای نظر مطلوب از آنها فارغ نمی‌شوند. و در این منزل از علوم، علم مقابله با دشمنان و تقابل هواها با هواها وجود دارد. زیرا اگر عقل‌ها هوی را با هوی دفع نکنند، به مقصود دست نمی‌یابند. زیرا نفوس جز به گرفتن از هوای خود عادت نکرده‌اند. پس اگر عقل عالم به سیاست و ماهر در ایجاد صور باشد، صورتی مطلوب برای نفس در عین هوای آن ایجاد می‌کند، پس نفس آن را با عشق می‌پذیرد و عقل بر آن پیروز می‌شود. و در آن علم خواص اعداد و حروف وجود دارد. و در آن علم بسیط‌های اعداد و حکم آنها در آنچه از آنها ترکیب شده است، وجود دارد. و اینکه آیا خواص آنها که از بسیط بودن دارند، با ترکیب در آنها باقی می‌ماند یا خیر. و در آن علم ظروف زمانی و اینکه در دست کیست، وجود دارد. و در آن علم زمان آینده، اگر حال باشد، چه حکمی دارد، وجود دارد. و در آن علم احدیت علم و اینکه کثرتی که به آن نسبت داده می‌شود، به خاطر عین آن نیست، بلکه به متعلقات آن است، وجود دارد. و در آن علم آنچه نظر فکری در ظروف مکانی نتیجه می‌دهد، وجود دارد. و در آن علم آجال (سرآمدها) کائنات در دنیا و آخرت، با وجود اینکه آخرت بی‌نهایت است، وجود دارد. و عموم سخن او: «همه تا سرآمدی معین در حرکتند» (كُلٌّ يَجْرِي إِلى‏ أَجَلٍ مُسَمًّى). پس هر چیزی ناگزیر از غایتی است و وجود اشیاء پایان نمی‌پذیرد، پس غایات آنها نیز پایان نمی‌یابد. پس خداوند در هر لحظه اشیایی را تجدید می‌کند و هر چیزی غایتی دارد که آن غایت، سرآمد معین آن است. پس سرآمد جز برای احوال اعیان نیست و غایت اعیان، عین است، نه غایت. و در آن علم حقیقت و مجاز و اعتبار و اینکه از چه چیزی تعبیر می‌شود و به سوی چه چیزی تعبیر می‌شود و فایده‌ی آن چیست، وجود دارد. و در آن علم آبادانی دو سرا وجود دارد که بخشی از آن را در این باب ذکر کردیم و آن را به طور کامل بیان نکردیم. و در آن علم اختلاف احکام احوال ساعت وجود دارد. و در آن علم اختلاف مکلفین در احوالشان و اینکه خداوند هر صنفی را از آن جهت که آن صنف بر آن است، مورد خطاب قرار می‌دهد و بر آن نمی‌افزاید، وجود دارد. و در آن علمی وجود دارد که حکم می‌کند امر، تماماً آغاز است و اعاده‌ای در آن نیست. و در آن علم این است که حق (الحق) در خطاب تا فهم مخاطب پایین می‌آید و همه‌ی آن حق است، هرچند متناقض باشد و تقابل در آن ظاهر شود. پس در آنجا عین واحدی است که آن را جمع می‌کند، مانند سیاهی و سفیدی که دو ضد متقابلند و رنگ آنها را جمع می‌کند، و مانند رنگ‌ها که حقایق مختلفی هستند و عرض آنها را جمع می‌کند. و در آن علم توحید (التوحيد) به عین تشبیه وجود دارد. و در آن علم تفضیل وجود دارد. و در آن علم حکم کلمات خدا، حکم خلق خداست، وجود دارد. و در آن علم تکوین اعمال کونی و برپا داشتن آنها به صورت‌ها وجود دارد. و در آن علم جمع و وجود (الوجود) وجود دارد. و در آن علم آنچه نشأت طبیعی از احکام اقتضا می‌کند، وجود دارد. و در آن علم علل و اسباب و جزا وجود دارد. و در آن علم فرق میان اسباب دنیا و اسباب آخرت و برتری اسباب دنیا بر آن وجود دارد. و در آن علم آنچه از عمل انسان به او باز می‌گردد و آنچه از آن به خدا نسبت می‌دهد، به خود نسبت می‌دهد، وجود دارد. و در آن علم تکوین الهی از اسباب کونی که همان آثار علوی برزخی هستند و نه غیر آن، وجود دارد. و در آن علم تغییر احوال به دلیل تغییر حرکات فلکی وجود دارد. و در آن علم حال حیوان از زمان نشأت تا زمان مرگش وجود دارد. و در آن علم قیاس الهی وجود دارد. و در آن علم تأثیر کائنات در کائنات و علم آنچه با آن از آن تأثیر پرهیز می‌شود، وجود دارد. و در آن علم قیامت و احوال و مراتب آن وجود دارد. و در آن علم امر عالم به طور کلی وجود دارد. و در آن علم برتری اهل نوامیس الهی بر اهل نوامیس عقلی حکمی وجود دارد. این ذکر بیشتر علومی است که این منزل در بر دارد. و خداوند حق (الحق) را می‌گوید و راه را هدایت می‌کند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 7
}