{
  "id": 308,
  "title": {
    "ar": "الباب الثامن وثلاثمائة في معرفة منزل اختلاط العالم الكلي من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Eight: Concerning the knowledge of the station of the admixture of the Universal World (العالم الكلي) originating from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو آٹھ: عالم کلی (العالم الكلي) کے اختلاط کی منزل کی معرفت (المعرفۃ) میں، جو حضرت محمدیہ (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و هشتم در معرفت منزل اختلاط عالم کلی از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الثامن وثلاثمائة في معرفة منزل اختلاط العالم الكلي من الحضرة المحمدية»\n\n\n> عجبي من قائل كن لعدم *** والذي قيل له لم يك ثم‏\n\n\n> نم إن كان فلم قيل له *** لتكن والكون ما لا ينقسم‏\n\n\n> فلقد أبطل كن قدرة من *** دل بالعقل عليها وحكم‏\n\n\n> كيف للعقل دليل والذي *** قد بناه العقل بالكشف هدم‏\n\n\n> فنجاة النفس في الشرع فلا *** تك إنسانا رأى ثم حرم‏\n\n\n> واعتصم بالشرع في الكشف فقد *** فاز بالخير عبيد قد عصم‏\n\n\n> أهمل الفكر ولا تحفل به *** واتركنه مثل لحم في وضم‏\n\n\n> إن للفكر مقاما فاعتضد *** به فيه تك شخصا قد رحم‏\n\n\n> كل علم يشهد الشرع له *** هو علم فبه فلتعتصم‏\n\n\n> وإذا خالفه العقل فقل *** طورك ألزم ما لكم فيه قدم‏\n\n\n> إن لله علوما جمة *** نالها من لم يقل ما ثم لم‏\n\n\n> جهل التكييف فيها وانتفى *** عن حماها رفعة سلطان كم‏\n\n\n> مثل ما قد جهل اللوح الذي *** خط فيه الحق من علم القلم‏\n\n\n### [أن الناس اختلفوا في مسمى الإنسان‏]\n\n\nاعلم أن الناس اختلفوا في مسمى الإنسان ما هو فقالت طائفة هو اللطيفة وطائفة قالت هو الجسم وطائفة قالت هو\nالمجموع وهو الأولى وقد وردت لفظة الإنسان على ما ذهبت إليه كل طائفة ثم اختلفنا في شرفه هل هو ذاتي له أو هو بمرتبة نالها بعد ظهوره في عينه وتسويته كاملا في إنسانية إما بالعلم وإما بالخلافة والإمامة فمن قال إنه شريف لذاته نظر إلى خلق الله إياه بيديه ولم يجمع ذلك لغيره من المخلوقين وقال إنه خلقه على صورته فهذا حجة من قال شرفه شرف ذاتي ومن خالف هذا القول قال لو أنه شريف لذاته لكنا إذا رأينا ذاته علمنا شرفه والأمر ليس كذلك ولم يكن يتميز الإنسان الكبير الشريف بما يكون عليه من العلم والخلق على غيره من الأناسي ويجمعهما الحد الذاتي فدل إن شرف الإنسان بأمر عارض يسمى المنزلة أو المرتبة فالمنزلة هي الشريفة والشخص الموصوف بها نال الشرف بحكم التبعية كمرتبة الرسالة والنبوة والخلافة والسلطنة والله يقول أ ولم ير (أَ ولا يَذْكُرُ) الْإِنْسانُ أَنَّا خَلَقْناهُ من قَبْلُ ولَمْ يَكُ شَيْئاً وقال هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ من الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً أي قد أتى على الإنسان وقد قالت الملائكة فيه من حيث ذاته ما قالت وصدقت فما علم شرفه إلا بما أعطاه الله من العلم والخلافة فليس لمخلوق شرف من ذاته على غيره إلا بتشريف الله إياه وأرفع المنازل عند الله أن يحفظ الله على عبده مشاهدة عبوديته دائما سواء خلع عليه من الخلع الربانية شيئا أو لم يخلع فهذه أشرف منزلة تعطي لعبد وهو قوله تعالى واصْطَنَعْتُكَ لِنَفْسِي وقوله سبحانه سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ فقرن معه تنزيهه قال بعض المحبين في هذا المقام‏\n\n\n> لا تدعني إلا بيا عبدها *** فإنه أشرف أسمائي‏\n\n\nفليس لصنعة شرف أعلى من إضافتها إلى صانعها ولهذا لم يكن لمخلوق شرف إلا بالوجه الخاص الذي له من الحق لا من جهة سببه المخلوق مثله وفي هذا الشرف يستوي أول موجود وهو القلم أو العقل أو ما سميته وأدنى الموجودات مرتبة فإن النسبة واحدة في الإيجاد والحقيقة واحدة في الجميع من الإمكان فأخر صورة ظهر فيها الإنسان الصورة الآدمية وليس وراءها صورة أنزل منها وبها يكون في النار من شقي لأنها نشأة وتركيب تقبل الآلام والعلل وأما أهل السعادة فينشئون نشأة وتركيبا لا يقبل ألما ولا مرضا ولا خبثا ولهذا لا يهرم أهل الجنة ولا يتمخطون ولا يبولون ولا يتغوطون ولا يسقمون ولا يجوعون ولا يعطشون وأهل النار على النقيض منهم وهي نشأة الدنيا وتركيبها فهي أدنى صورة قبلها الإنسان وقد أتت عليه أزمنة ودهور قبل إن يظهر في هذه الصورة الآدمية وهو في الصورة التي له في كل مقام وحضرة من فلك وسماء وغير ذلك مما تمر عليه الأزمان والدهور ولم يكن قط في صورة من تلك الصور مذكورا بهذه الصورة الآدمية العنصرية ولهذا ما ابتلاه قط في صورة من صوره في جميع العالم إلا في هذه الصورة الآدمية ولا عصى الإنسان قط خالقه إلا فيها ولا ادعى رتبة خالقه إلا فيها ولا مات إلا فيها ولهذا يقبل الموت أهل الكبائر في النار ثم يخرجون فيغمسون في نهر الحياة فيتركبون تركيبا لا يقبل الألم ولا الأسقام فيدخلون بتلك الصورة الجنة\n\n\n### [أن الصراط هو صراط الهدى‏]\n\n\nواعلم أن الصراط الذي إذا سلكت عليه وثبت الله عليه أقدامك حتى أوصلك إلى الجنة هو صراط الهدى الذي أنشأته لنفسك في دار الدنيا من الأعمال الصالحة الظاهرة والباطنة فهو في هذه الدار بحكم المعنى لا يشاهد له صورة حسية فيمد لك يوم القيامة جسرا محسوسا على متن جهنم أوله في الموقف وآخره على باب الجنة تعرف عند ما تشاهده أنه صنعتك وبناؤك وتعلم أنه قد كان في الدنيا ممدودا جسرا على متن جهنم طبيعتك في طولك وعرضك وعمقك وثلاث شعب إذ كان جسمك ظل حقيقتك وهو ظل غير ظليل لا يغنيها من اللهب بل هو الذي يقودها إلى لهب الجهالة ويضرم فيها نارها فالإنسان الكامل يعجل بقيامته في الموطن الذي تنفعه قيامته فيه وتقبل فيه توبته وهو موطن الدنيا فإن قيامة الدار الأخرى لا ينفع فيها عمل لأنه لم يكلف فيها بعمل فإنه موطن جزاء لما سلف في الدار الدنيا وهو قوله تعالى ثُمَّ هَدى‏ أي بين ما يقتضيه المواطن ليكون الإنسان المخاطب في كل موطن بما قرن به من العمل بالذي يرضيه وهو ممزوج بما ينافيه مثل خلق الأجسام الطبيعية سواء فإن الحرارة تنافر البرودة وإن الرطوبة تنافر اليبوسة وأراد الحق أن يجمع الكل على ما هم عليه من التضاد في جسم واحد فضم الحرارة إلى اليبوسة فخلق منهما المرة الصفراء ثم زوج بين الحرارة والرطوبة فكان لهذا المزاج الدم وجعله مجاورا لهما جعل الرطوبة التي في الدم مما يلي اليبوسة التي في الصفراء بحكم المجاورة حتى تقاومها في الفعل فلا تترك‏\nكل واحدة منهما يظهر سلطانها في المزاج الإنساني الحيواني فلو جعل الحرارة الدموية تليها فلا بد إن كان يليها من الصفراء إما الحرارة أو اليبوسة فإن وليتها اليبوسة وهي المنفعلة عن الحرارة فكان اليبس يتقوى سلطانه في الجسم فيؤدي إلى دخول المرض عليه فيحول المرض بينه وبين ما كلفه رب الجسم أن يشتغل به من العلوم واقتنائها والأعمال الموصلة إلى السعادة وكذلك لو جاورتها حرارة الصفراء لزادت في كمية الصفراء فيعتل فلهذا كانت الرطوبة مما يلي الصفراء ثم إنه تعالى زوج بين البرودة والرطوبة فكان من هذا الاختلاط البلغم فجعل الرطوبة البلغمية مما يلي الحرارة الدموية ولو لم يكن كذلك لكان كما ذكرناه أولا من دخول العلة والسقم للزيادة في الكمية في ذلك الخلط ثم زوج بين البرودة واليبوسة فكان من ذلك المزج المرة السوداء فجعل اليبوسة من السوداء مما يلي الرطوبة من البلغم ولم يجعل البرودة من السوداء تليها لئلا تزيد في كمية رطوبة البلغم فإن الرطوبة منفعلة عن البرودة فإذا حصلت بين برودة البلغم وبرودة السوداء تضاعفت وزادت كمية البلغم فدخلت العلة والمرض على الجسم فإنها قابلة للانفعال فانظر لحكمة الله في هذه النشأة وهذا لبقاء الصحة على هذا الجسم الذي هو مركب هذه اللطيفة ليوصلها إلى ما دعاها إليه ربها عز وجل فهذا المركب الجسمي يستولي عليه الروح الإلهي فإذا تغشاه حمل فينتج أعمالا إما صالحة وهي المخلقة وإما فاسدة وهي غير المخلقة وظهرت هذه الأعمال في صور مراكب فإن كانت صالحة صعدت به إلى عليين قال تعالى إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ أي الأرواح الطيبة فإنها كلمات الله مطهرة قال تعالى وكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ وقال والْعَمَلُ الصَّالِحُ يَرْفَعُهُ كذلك إذا كان العمل فاسدا يهوى به إلى أسفل سافلين قال تعالى ثُمَّ رَدَدْناهُ أَسْفَلَ سافِلِينَ أي هوى به مركبه وقد كان في أحسن تقويم إِلَّا الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ فإن عمله يصعد به إلى عليين فيكون له أَجْرٌ غَيْرُ مَمْنُونٍ وهو الأجر المكتسب ولا يكون الأجر إلا مكتسبا فإن أعطى ما هو خارج عن الكسب لا يقال فيه أجر بل هو نور وهبات ولهذا قال في حق قوم لَهُمْ أَجْرُهُمْ ونُورُهُمْ فأجرهم ما اكتسبوه ونورهم ما وهبهم الحق تعالى من ذلك حتى لا ينفرد الأجر من غير أن يختلط به الوهب حتى يشغل ذلك الوهب العبد عن معاينة سلطان الاستحقاق الذي يعطيه الأجر إذ كان معاوضة عن عمل متقدم مضاف إلى العبد فلا أجر إلا ويخالطه نور لما ذكرناه فإن النشأة على هذا الأصل قامت وذلك أن الجسم الطبيعي لما تركب وظهر بروحه الحساس لو ترك مستقلا لأهلكته الدعوى ولكن جعل الله له روحا ربانيا من نفس الرحمن الذي هو الروح الإلهي فظهرت لطيفة الإنسان نورا فوكلت بالجسم الحيواني فلهذا قرن الأنوار بالأجور حتى تكون المنة الإلهية تصحب هذا العبد حيث كان والله عَلِيمٌ حَكِيمٌ ولهذا قلنا إن هذا منزل الاختلاط وإن كان يتضمن علوما جمة منها علم حروف المعاني لا حروف الهجاء وهل إذا دخل بعضها على بعض هل ينقلها عن مقام الحرفية إلى مقام الاسمية إذ الحرف لا يعمل في مثله وبما ذا يعمل حرف في حرف وليس كل حرف واحد بأقوى من صاحبه مثل دخول من على حرف عن فقد كان حرف عن يعطي معنى التجاوز فصيره حرف من يدل على الجهة والناحية كما يدل الاسم قال الشاعر\n\n\nمن عن يمين الحبيا نظرة قبل‏\n\n\nفالعامل في يمين عن بلا شك ولكن هل عمل فيه عمل الحرفية لبقاء صورته أو عمل فيه عمل الإضافة وهو عمل الأسماء فيكون عمله من طريق المعنى الذي كساه من بدخوله عليه ويكون عن معمولا لمن أو يبقى على أصله فنقول بجواز دخول الحروف بعضها على بعض ونترك عمل الواحد منهما ونجعله زائدا كما نعمله في ما إذا جعلناها زائدة في قوله‏\n\n\nإذا ما راية رفعت لمجد\n\n\nفما هنا زائدة لأن الكلام يستقل دونها فتقول إذا راية فلا عمل هنا لها وكذلك حرف إن في قول امرئ القيس‏\n\n\nفما إن من حديث ولا صال‏\n\n\nفإن هنا زائدة لا عمل لها فيكون ذلك كذلك ولا مانع إذ لو حذفنا عن من قوله من عن يمين لم يختل المعنى ولا يخرج الحرف عن بابه إلى باب الاسمية من غير ضرورة وإذا أبدل الحرف من الحرف هل يعطي معنى ما أبدل منه‏\n\n\nأو هل يعطي خلافه ومما يتضمن هذا المنزل علم المراكب والركبان وعلم الزمان وعلم شرف الكلام وعلم شرف الذكر على الفكر وكون الحق وصف نفسه بالذكر وما وصف نفسه بالفكر مع أنه أثبت لنفسه التدبير وهو الفكر أو يقوم مقام اللازم له ويتضمن علم الخلق والصفات وعلم البيان وعلم الأحوال وعلم الاستعداد\nوعلم الإحسان وعلم التجلي الوسط الأوسط الذي بين الذوق والري في مذهب من يقول بالري وعلم ثلج برد اليقين من أين حصل وعلم العبودية لله دون غيره من الأشياء وما لهذه العبودية من الآثار في العلوم وعلم ما يعطيه أداء الواجبات وعلم الآخرة وعلم الهبات من العطايا واختلاف أحوال العطاء وعلم التقوى وأصناف الوقايات وعلم نعيم الأرواح وعلم العرش والرفارف والمنابر والأسرة والكراسي والمراتب وأين حظ كل واحد منها وعلم النقيضين وعلم التداني الأعلى من التداني الأنزل وعلم الظلالات وعلم الانقياد بطريق الذلة وعلم الطواف بالبيت والطائفين ولما ذا يطاف به وبما ذا يطاف وعلم الاصطلام وعلم اللآلي والسلوك وعلم الرتبة الإلهية والدنياوية وتنوعاتها وما المحمود منها وعلم التحجيل وعلم تقديس التجلي وعلم الجزاء الإلهي وعلم تنزيل الغيوب وعلم التكليف وعلم الإرادة وعلم التبديل والإبدال وعلم الاختصاص وفي كل صنف مما ذكرناه من العلوم علوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Eight: Concerning the Knowledge of the Station of the Mixing of the Universal World (العالم الكلي) Derived from the Muhammadan Presence (الحضرة المحمدية)\n\nMy wonder is at him who says \"Be!\" (كن) to a non-existent thing (عدم),\nWhen that to which it was said was not yet there.\n\nSay, if it was, then why was it told,\n\"Be!\" (لتكن)? And Being (الكون) is that which cannot be divided.\n\nFor \"Be!\" (كن) has surely nullified the power of him\nWho used intellect (العقل) to prove and judge upon it.\n\nHow can the intellect (العقل) be a guide, when that\nWhich the intellect built, Unveiling (الكشف) has demolished?\n\nThe salvation of the soul lies in the Law (الشرع), so do not\nBe a human who saw, and then was deprived.\n\nHold fast to the Law (الشرع) in Unveiling (الكشف), for\nThe servants who were protected have triumphed through goodness.\n\nNeglect reflection (الفكر) and pay it no heed,\nAnd leave it like meat upon a chopping block.\n\nIndeed, reflection (الفكر) has a station (مقام), so rely\nUpon it within that station, and you will be a person shown mercy.\n\nEvery knowledge (علم) to which the Law (الشرع) bears witness\nIs true knowledge (علم), so hold fast to it.\n\nAnd if the intellect (العقل) contradicts it, say:\n\"Keep to your own sphere; you have no footing here.\"\n\nIndeed, Allah possesses abundant knowledges (علوم),\nAttained by him who did not say, \"What?\" or \"Why not?\"\n\nHe was ignorant of the modality (التكييف) within them, and was removed\nFrom their sanctuary by the elevation of the sovereignty of \"How much?\"\n\nJust as he was ignorant of the Tablet (اللوح) upon which\nThe Real (الحق) inscribed the knowledge of the Pen (القلم).\n\n### That people have differed concerning the designation of the Human\n\nKnow that people have differed concerning the designation of the Human (الإنسان)—what it is. One group said it is the subtle essence (اللطيفة), another group said it is the body (الجسم), and a third group said it is the composite (المجموع), which is the most appropriate view. The term *al-insan* (Human) has been used in accordance with the view adopted by each group.\n\nThen we differed regarding its nobility (شرفه): Is it inherent (ذاتي) to it, or is it due to a level (مرتبة) it attained after its manifestation in its specific entity and its perfect formation in humanity, either through Knowledge (العلم) or through Vicegerency (الخلافة) and Imamate (الإمامة)?\n\nThose who say its nobility is inherent point to Allah's creation of it with His two Hands, a distinction not granted to any other creature, and they cite His saying that He created it upon His form (صورته). This is the proof for those who claim its nobility is inherent nobility.\n\nThose who oppose this view say that if its nobility were inherent, we would know its nobility simply by seeing its essence (ذاته), but the matter is not so. Nor would the great and noble human be distinguished from other humans by the knowledge (العلم) and character (الخلق) he possesses, while the inherent definition (الحد الذاتي) encompasses them both. This indicates that the nobility of the Human is due to an accidental matter (أمر عارض) called the Station (المنزلة) or the Level (المرتبة). Thus, the Station itself is noble, and the person described by it attains nobility by way of consequence (التبعية), such as the level of Messengership (الرسالة), Prophethood (النبوة), Vicegerency (الخلافة), and Sovereignty (السلطنة).\n\nAllah says: <<أَوَلا يَذْكُرُ الْإِنْسانُ أَنَّا خَلَقْناهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْئاً>> (Does not the human recall that We created him before, when he was nothing?) and He said: <<هَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا>> (Has there not come upon the human a period of time when he was not a thing mentioned?). Meaning, a time came upon the Human, and the angels spoke concerning him, regarding his essence, what they spoke, and they spoke truly. Thus, his nobility was not known except through what Allah granted him of Knowledge (العلم) and Vicegerency (الخلافة). Therefore, no creature possesses inherent nobility over another, except by Allah’s granting of nobility to him.\n\nThe highest of stations (المنازل) before Allah is that Allah preserves for His servant the constant witnessing (مشاهدة) of his servitude (عبوديته), whether He bestows upon him any of the Divine Robes of Honor (الخلع الربانية) or not. This is the most noble station granted to a servant, and it is His saying, the Exalted: <<وَاصْطَنَعْتُكَ لِنَفْسِي>> (And I have chosen you for Myself), and His saying, the Glorified: <<سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ>> (Glory be to Him Who carried His servant by night), where He coupled His glorification (تنزيهه) with the servant.\n\nOne of the lovers (المحبين) said concerning this station:\n\n> Call me by nothing but 'O her servant,'\n> For indeed, it is the noblest of my names.\n\nThere is no nobility for a creation higher than its attribution to its Creator. For this reason, no creature possesses nobility except through the specific aspect (الوجه الخاص) it holds from The Real (الحق), not from the direction of its created cause, which is like it. In this nobility, the first existent (أول موجود)—whether it is the Pen (القلم) or the Intellect (العقل) or whatever you name it—is equal to the lowest of existents in rank (مرتبة). For the relationship is one in the act of bringing into existence (الإيجاد), and the reality (الحقيقة) is one in all of them, derived from possibility (الإمكان).\n\nThe last form in which the Human appeared is the Adamic form (الصورة الآدمية), and there is no form lower than it. And it is in this form that the wretched will be in the Fire, because it is a constitution (نشأة) and composition (تركيب) that accepts pains and ailments. As for the People of Felicity (أهل السعادة), they are constituted with a constitution and composition that accepts neither pain, nor sickness, nor impurity. For this reason, the people of Paradise do not age, nor blow their noses, nor urinate, nor defecate, nor fall sick, nor hunger, nor thirst. The people of the Fire are the opposite of them; their constitution is that of the world (الدنيا) and its composition, which is the lowest form the Human accepted.\n\nAges and epochs passed over him before he appeared in this Adamic form. He was in the form belonging to him in every station (مقام) and Presence (حضرة)—of the celestial sphere (فلك), the heaven (سماء), and other things upon which ages and epochs pass. He was never mentioned in any of those forms by this elemental Adamic form (الصورة الآدمية العنصرية). For this reason, Allah never tested him in any of his forms throughout the entire cosmos (العالم) except in this Adamic form. Nor did the Human ever disobey his Creator except in it, nor claim the rank of his Creator except in it, nor die except in it. For this reason, the perpetrators of major sins in the Fire accept death, then they are brought out and immersed in the River of Life, where they are composed into a structure that accepts neither pain nor ailments, and they enter Paradise in that form.\n\n### That the Path (الصراط) is the Path of Guidance (صراط الهدى)\n\nKnow that the Path (الصراط) upon which, if you traverse it, Allah will make your feet firm until He delivers you to Paradise, is the Path of Guidance (صراط الهدى) that you established for yourself in the abode of this world (دار الدنيا) through righteous deeds, both manifest and hidden. In this abode, it exists by virtue of meaning (المعنى) and has no perceptible sensory form (صورة حسية). On the Day of Resurrection, it will be stretched out for you as a tangible bridge (جسرا محسوسا) over the surface of Hell (جهنم). Its beginning is at the Gathering Place (الموقف) and its end is at the gate of Paradise. When you witness it, you will recognize that it is your own making and construction. And you will know that in the world, it was stretched out as a bridge over the surface of your nature (جهنم طبيعتك) in your length, width, depth, and three branches. Since your body (جسمك) is the shadow of your reality (حقيقتك), and it is a shadow that offers no shade (ظل غير ظليل) and does not protect it from the flame. Rather, it is what leads it to the flame of ignorance (الجهالة) and kindles its fire within it.\n\nThe Perfect Human (الإنسان الكامل) hastens his resurrection in the place where his resurrection benefits him and where his repentance is accepted, which is the abode of the world (الدنيا). For the resurrection of the Next Abode (الدار الأخرى) is not benefited by deeds, because one is not obligated to perform deeds there; it is an abode of recompense for what has passed in the abode of the world. This is His saying, the Exalted: <<ثُمَّ هَدَى>> (Then He guided), meaning He clarified what the stations (المواطن) require, so that the human addressed in every station is coupled with the deed that pleases Him.\n\nAnd this is mixed with what contradicts it, just like the creation of natural bodies (الأجسام الطبيعية). For heat repels cold, and moisture repels dryness, yet The Real (الحق) willed to gather all of them, despite their opposition (التضاد), into a single body. So He joined heat with dryness and created from them the yellow bile (المرة الصفراء). Then He paired heat with moisture, and from this mixture came blood (الدم), and He made it adjacent to them. He made the moisture in the blood adjacent to the dryness in the yellow bile by virtue of proximity, so that it resists it in action, preventing either of them from manifesting its dominance in the human animal temperament (المزاج الإنساني الحيواني).\n\nIf He had made the heat of the blood adjacent to it, then necessarily, what followed it from the yellow bile would be either heat or dryness. If dryness followed it—which is passive to heat—then the dominance of dryness would be strengthened in the body, leading to the onset of illness. And illness would intervene between him and what the Lord of the body obligated him to pursue: the acquisition of knowledges (العلوم) and the deeds leading to felicity (السعادة). Likewise, if the heat of the yellow bile were adjacent to it, the quantity of the yellow bile would increase, and he would become ill. For this reason, moisture was made adjacent to the yellow bile.\n\nThen, the Exalted paired coldness with moisture, and from this mixing (الاختلاط) came phlegm (البلغم). He made the phlegmatic moisture adjacent to the heat of the blood. If it were not so, the result would be the onset of ailment and sickness, as mentioned earlier, due to the increase in the quantity of that humor (الخلط).\n\nThen He paired coldness with dryness, and from that mixture came the black bile (المرة السوداء). He made the dryness of the black bile adjacent to the moisture of the phlegm, and did not make the coldness of the black bile adjacent to it. Lest the quantity of the phlegm's moisture increase, for moisture is passive to coldness. If the coldness of the phlegm and the coldness of the black bile were adjacent, the phlegm would multiply and its quantity would increase, and ailment and sickness would enter the body, for it is receptive to passivity.\n\nTherefore, observe the wisdom of Allah in this constitution (النشأة). This arrangement is for the preservation of health in this body, which is the vehicle (مركب) of this subtle essence (اللطيفة), so that it may convey it to what its Lord, the Mighty and Majestic, has called it to.\n\nThis bodily vehicle (المركب الجسمي) is dominated by the Divine Spirit (الروح الإلهي). When it covers it, it conceives and produces deeds: either righteous deeds (صالحة), which are created (المخلقة), or corrupt deeds (فاسدة), which are uncreated (غير المخلقة). These deeds appear in the forms of vehicles (مراكب). If they are righteous, they ascend with him to the highest heavens (عليين). The Exalted says: <<إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ>> (To Him ascends the good word), meaning the pure spirits (الأرواح الطيبة), for they are the purified Words of Allah. The Exalted says: <<وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ>> (And His Word which He cast unto Mary), and He said: <<وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ>> (And the righteous deed elevates it). Likewise, if the deed is corrupt, it plunges him to the lowest of the low (أسفل سافلين). The Exalted says: <<ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ>> (Then We returned him to the lowest of the low), meaning his vehicle plunged him, though he had been in the best of forms (أحسن تقويم). <<إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ>> (Except those who believe and perform righteous deeds), for their deed ascends with them to the highest heavens (عليين), and they shall have <<أَجْرٌ غَيْرُ مَمْنُونٍ>> (an unfailing reward), which is the earned reward (الأجر المكتسب).\n\nThe reward (الأجر) is only that which is earned. If something is given that is outside of earning, it is not called a reward, but rather a light (نور) and a gift (هبات). For this reason, He said concerning a group: <<لَهُمْ أَجْرُهُمْ وَنُورُهُمْ>> (They shall have their reward and their light). Their reward is what they earned, and their light is what The Real (الحق) the Exalted gifted them from that. This is so that the reward does not stand alone without the gift being mixed with it, lest that gift distract the servant from witnessing the sovereignty of deservingness (سلطان الاستحقاق) that grants the reward. Since the reward is a compensation for a preceding deed attributed to the servant, there is no reward that is not mixed with light, for the reason we mentioned.\n\nFor the constitution (النشأة) was established upon this principle. When the natural body (الجسم الطبيعي) was composed and appeared with its sentient spirit (روحه الحساس), had it been left independent, the claim (الدعوى) would have destroyed it. But Allah appointed for it a Lordly Spirit (روحا ربانيا) from the Breath of the All-Merciful (نفس الرحمن), which is the Divine Spirit (الروح الإلهي). Thus, the subtle essence (لطيفة) of the Human appeared as a light and was entrusted with the animal body (الجسم الحيواني). For this reason, the lights (الأنوار) were coupled with the rewards (الأجور), so that the Divine Favor (المنة الإلهية) accompanies this servant wherever he may be. And Allah is <<عَلِيمٌ حَكِيمٌ>> (All-Knowing, All-Wise).\n\nFor this reason, we said that this is the Station of Mixing (منزل الاختلاط), even though it contains abundant knowledges (علوم جمة), including the science of the letters of meaning (حروف المعاني), not the letters of the alphabet (حروف الهجاء). And whether, when some of them enter upon others, this transfers them from the station of the letter (مقام الحرفية) to the station of the Name (مقام الاسمية), since a letter does not operate upon its like. And by what means does one letter operate upon another, when not every single letter is stronger than its companion? For example, the entry of the letter *min* (من) upon the letter *‘an* (عن). The letter *‘an* used to convey the meaning of passing beyond (التجاوز), but the letter *min* made it signify direction and side (الجهة والناحية), just as a Name (الاسم) signifies.\n\nThe poet said:\n> From the right side of the beloved, a glance before.\n\nThe operator (العامل) upon *yamin* (right side) is undoubtedly *‘an*. But did it operate upon it with the operation of a letter (عمل الحرفية) due to the persistence of its form, or did it operate upon it with the operation of attribution (عمل الإضافة), which is the operation of Names (الأسماء)? In which case, its operation would be through the meaning that *min* clothed it with upon its entry, and *‘an* would be governed by *min*, or does it remain upon its original principle?\n\nWe say that the entry of letters upon one another is permissible, and we disregard the operation of one of them and deem it superfluous (زائدا), just as we do with *ma* (ما) when we deem it superfluous in the saying:\n\n> If *ma* a banner is raised for glory.\n\nHere, *ma* is superfluous because the sentence is complete without it; you would say, \"If a banner...\" Thus, it has no operation here. Likewise, the letter *in* (إن) in the saying of Imru’ al-Qays:\n\n> So there is *in* no talk nor a companion.\n\nHere, *in* is superfluous and has no operation. The matter is thus, and there is no impediment, for if we removed *‘an* from the phrase \"from *‘an* the right side,\" the meaning would not be impaired. Nor does the letter depart from its domain to the domain of the Name (الاسمية) without necessity. And if a letter is substituted for another letter, does it convey the meaning of that which it replaced, or does it convey the opposite?\n\nAmong what this station (منزل) encompasses is the science of vehicles (المراكب) and riders (الركبان), the science of time (الزمان), the science of the nobility of speech (الكلام), and the science of the nobility of Remembrance (الذكر) over Reflection (الفكر). And the fact that The Real (الحق) described Himself with Remembrance but did not describe Himself with Reflection, even though He affirmed for Himself planning/ordering (التدبير), which is Reflection, or stands in the place of what is necessary for it.\n\nIt encompasses the science of Creation (الخلق) and Attributes (الصفات), the science of Elucidation (البيان), the science of Spiritual States (الأحوال), the science of Preparedness (الاستعداد), and the science of Spiritual Excellence (الإحسان). And the science of the Middle Central Theophany (التجلي الوسط الأوسط) which lies between Tasting (الذوق) and Satiation (الري), according to the school that affirms Satiation. And the science of the snow-coldness of Certainty (اليقين)—whence it is obtained—and the science of servitude (العبودية) to Allah alone, exclusive of other things, and the effects this servitude has upon knowledges. And the science of what the performance of obligations (الواجبات) grants, the science of the Hereafter (الآخرة), the science of gifts (الهبات) from bestowals, and the variations in the states of bestowal. And the science of God-consciousness (التقوى) and the types of protections, the science of the bliss of spirits (نعيم الأرواح), and the science of the Throne (العرش), the cushions (الرفارف), the pulpits (المنابر), the couches (الأسرة), the chairs (الكراسي), and the ranks (المراتب), and where the portion of each one of them lies. And the science of the two opposites (النقيضين), the science of the higher proximity (التداني الأعلى) compared to the lower proximity (التداني الأنزل), the science of shadows (الظلالات), and the science of submission through the path of humility (الذلة). And the science of circumambulation (الطواف) around the House (البيت) and the circumambulators, why it is circumambulated, and by what means it is circumambulated; the science of rapture (الاصطلام), the science of pearls (اللآلي), and the spiritual path (السلوك). And the science of the Divine and worldly ranks (الرتبة الإلهية والدنياوية) and their variations, and which of them is praiseworthy. And the science of the white blaze (التحجيل), the science of the sanctification of Theophany (تقديس التجلي), the science of Divine Recompense (الجزاء الإلهي), the science of the descent of the Unseen (تنزيل الغيوب), the science of obligation (التكليف), the science of Will (الإرادة), the science of change (التبديل) and substitution (الإبدال), and the science of specialization (الاختصاص). And within every category of the knowledges we have mentioned are further knowledges. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر تین سو آٹھ: حقیقت محمدیہ (الحقیقۃ المحمدیۃ) سے عالم کلی کے اختلاط کی منزل کی معرفت میں۔\n\nمجھے اس شخص پر تعجب ہے جو عدم (نہ ہونے) کو 'کن' (ہو جا) کہتا ہے،\nحالانکہ جسے کہا گیا وہ وہاں موجود ہی نہیں تھا۔\n\nاگر وہ موجود تھا، تو اسے 'ہو جا' کیوں کہا گیا؟\nجبکہ وجود (الکون) وہ ہے جو تقسیم نہیں ہوتا۔\n\nپس 'کن' (ہو جا) نے تو اس ذات کی قدرت کو باطل کر دیا\nجس پر عقل نے دلیل دی اور حکم لگایا۔\n\nعقل کے لیے کیسی دلیل؟ جبکہ جسے عقل نے تعمیر کیا،\nکشف (الکشف) نے اسے منہدم کر دیا۔\n\nپس نفس کی نجات شریعت (الشرع) میں ہے،\nلہٰذا ایسا انسان نہ بن جو دیکھے اور پھر محروم ہو جائے۔\n\nاور کشف (الکشف) میں شریعت (الشرع) کو مضبوطی سے تھام لے،\nکیونکہ وہ بندے فلاح پا گئے جنہیں خیر کے ذریعے بچا لیا گیا۔\n\nفکر کو نظر انداز کر دے اور اس کی پرواہ نہ کر،\nاسے ایسے چھوڑ دے جیسے لکڑی کے تختے پر پڑا گوشت۔\n\nبے شک فکر کا ایک مقام ہے، پس اس میں اس سے مدد لے،\nتاکہ تو وہ شخص بن جائے جس پر رحم کیا گیا۔\n\nہر وہ علم جس کی شریعت (الشرع) گواہی دے، وہی حقیقی علم ہے،\nپس اسی کو مضبوطی سے تھام لے۔\n\nاور اگر عقل اس کی مخالفت کرے تو کہہ دے:\n\"اپنے مقام پر قائم رہ، تمہارا اس میں کوئی دخل نہیں۔\"\n\nبے شک اللہ کے بہت سے علوم ہیں،\nجنہیں اس نے پایا جس نے یہ نہیں کہا کہ \"وہاں کیا ہے اور پھر نہیں ہے۔\"\n\nاس میں کیفیت (تکییف) سے ناواقف رہا اور\nکتنے ہی بادشاہوں کی رفعت اس کی پناہ گاہ سے دور رہی۔\n\nجیسے اس لوح سے ناواقف رہا\nجس میں ذات حق (الحق) نے قلم کے علم سے لکھا۔\n\n### [اس بارے میں کہ لوگوں نے انسان کے نام (مسمیٰ) میں اختلاف کیا ہے]\n\nجان لو کہ لوگوں نے اس بارے میں اختلاف کیا ہے کہ انسان کا مسمیٰ (نام) کیا ہے۔ ایک گروہ نے کہا کہ وہ لطیفہ ہے، دوسرے گروہ نے کہا کہ وہ جسم ہے، اور ایک گروہ نے کہا کہ وہ مجموعہ ہے، اور یہی قول اولیٰ (بہتر) ہے۔ لفظ انسان ہر اس معنی میں وارد ہوا ہے جس کی طرف ہر گروہ گیا ہے۔\n\nپھر ہم نے اس کے شرف کے بارے میں اختلاف کیا کہ آیا یہ اس کے لیے ذاتی ہے یا یہ اس مرتبے کی وجہ سے ہے جو اس نے اپنی ذات میں ظاہر ہونے اور اپنی انسانیت میں کامل طور پر درست کیے جانے کے بعد حاصل کیا، خواہ علم کے ذریعے یا خلافت اور امامت کے ذریعے۔ جس نے کہا کہ وہ اپنی ذات کی وجہ سے شرف والا ہے، اس نے اللہ کے اسے اپنے دونوں ہاتھوں سے پیدا کرنے پر نظر ڈالی، اور یہ خصوصیت کسی دوسرے مخلوق کے لیے جمع نہیں کی گئی، اور اس نے کہا کہ اللہ نے اسے اپنی صورت پر پیدا کیا۔ یہ اس شخص کی دلیل ہے جو کہتا ہے کہ اس کا شرف ذاتی شرف ہے۔ اور جس نے اس قول کی مخالفت کی، اس نے کہا کہ اگر وہ اپنی ذات کی وجہ سے شرف والا ہوتا، تو جب ہم اس کی ذات کو دیکھتے تو اس کے شرف کو جان لیتے، حالانکہ معاملہ ایسا نہیں ہے۔ اور بڑے شرف والے انسان کو علم اور خلق کی بنا پر دوسرے انسانوں سے ممتاز نہ کیا جاتا، جبکہ ذاتی حد ان دونوں کو جمع کرتی ہے۔ پس یہ اس بات کی دلیل ہے کہ انسان کا شرف کسی عارضی امر کی وجہ سے ہے جسے منزلہ (المنزلۃ) یا مرتبہ (المرتبۃ) کہا جاتا ہے۔ پس منزلہ (المنزلۃ) ہی شرف والی ہے، اور وہ شخص جو اس سے موصوف ہوتا ہے، وہ تبعیت کے حکم سے شرف حاصل کرتا ہے، جیسے رسالت، نبوت، خلافت اور سلطنت کا مرتبہ۔\n\nاور ذات حق (الحق) فرماتا ہے: \"کیا انسان یاد نہیں کرتا کہ ہم نے اسے اس سے پہلے پیدا کیا تھا جبکہ وہ کچھ بھی نہ تھا؟\" (مریم: ۶۷) اور فرمایا: \"بے شک انسان پر زمانے میں ایک ایسا وقت بھی آیا ہے جب وہ کوئی قابل ذکر چیز نہ تھا؟\" (الدھر: ۱) یعنی انسان پر ایک وقت آیا ہے، اور فرشتوں نے اس کی ذات کے بارے میں جو کہا وہ سچ کہا۔ پس اس کا شرف صرف اس علم اور خلافت کی وجہ سے معلوم ہوا جو اللہ نے اسے عطا کیا۔ لہٰذا کسی مخلوق کو اپنی ذات کی وجہ سے دوسرے پر شرف حاصل نہیں، مگر صرف اللہ کے اسے شرف دینے سے۔ اور اللہ کے نزدیک سب سے بلند منزلہ (المنزلۃ) یہ ہے کہ اللہ اپنے بندے پر ہمیشہ اس کی عبودیت (العبودیۃ) کا مشاہدہ (الشہود) محفوظ رکھے، خواہ اس پر ربانی خلعتوں میں سے کچھ پہنایا جائے یا نہ پہنایا جائے۔ یہ وہ سب سے اشرف منزلہ (المنزلۃ) ہے جو کسی بندے کو دی جاتی ہے، اور یہ اللہ تعالیٰ کا یہ فرمان ہے: \"اور میں نے تجھے اپنے لیے چن لیا۔\" (طٰہٰ: ۴۱) اور اس کا یہ فرمان: \"پاک ہے وہ ذات جس نے اپنے بندے کو رات کے وقت سیر کرائی۔\" (الاسراء: ۱) پس اس نے اپنی تنزیہ کو اس کے بندے ہونے کے ساتھ ملا دیا۔\n\nاس مقام پر بعض محبین نے کہا ہے:\n\nمجھے صرف \"اے اس کا بندہ\" کہہ کر پکارو\nکیونکہ یہ میرا سب سے اشرف نام ہے۔\n\nکسی صنعت کے لیے اپنے صانع کی طرف منسوب ہونے سے بڑھ کر کوئی شرف نہیں ہوتا۔ اسی لیے کسی مخلوق کے لیے کوئی شرف نہیں مگر اس خاص وجہ سے جو اسے ذات حق (الحق) کی طرف سے حاصل ہے، نہ کہ اس کے اپنے جیسے مخلوق سبب کی جہت سے۔ اور اس شرف میں پہلا موجود، خواہ وہ قلم ہو یا عقل یا جو بھی تو اسے نام دے، اور سب سے کم مرتبے والا موجود برابر ہیں۔ کیونکہ ایجاد میں نسبت ایک ہے اور امکان کی حقیقت سب میں ایک ہے۔ پس آخری صورت جس میں انسان ظاہر ہوا وہ آدم کی صورت ہے، اور اس سے نیچے کوئی صورت نہیں ہے۔ اور اسی صورت کی وجہ سے بدبخت شخص جہنم میں ہوگا، کیونکہ یہ ایک ایسی نشأت اور ترکیب ہے جو دکھوں اور بیماریوں کو قبول کرتی ہے۔ لیکن اہل سعادت ایسی نشأت اور ترکیب میں پیدا ہوں گے جو نہ درد قبول کرے گی، نہ بیماری، نہ خباثت۔ اسی لیے اہل جنت نہ بوڑھے ہوں گے، نہ ناک صاف کریں گے، نہ پیشاب کریں گے، نہ پاخانہ کریں گے، نہ بیمار ہوں گے، نہ بھوکے ہوں گے اور نہ پیاسے ہوں گے۔ اور اہل نار اس کے برعکس ہوں گے، اور وہ دنیا کی نشأت اور ترکیب ہے، پس یہ سب سے ادنیٰ صورت ہے جسے انسان نے قبول کیا۔ اور اس پر زمانے اور دور گزرے ہیں اس سے پہلے کہ وہ اس آدم کی صورت میں ظاہر ہو، اور وہ ہر مقام اور ہر حضرہ میں اس صورت میں تھا جو اس کے لیے تھی، خواہ وہ فلک ہو یا آسمان یا کوئی اور چیز جس پر زمانے اور دور گزرتے ہیں۔ اور وہ ان صورتوں میں سے کسی میں بھی اس عنصری آدم کی صورت میں کبھی مذکور نہیں ہوا۔ اسی لیے اللہ نے اسے تمام عالم میں اس کی کسی بھی صورت میں آزمائش میں نہیں ڈالا مگر صرف اس آدم کی صورت میں۔ اور انسان نے اپنے خالق کی نافرمانی کبھی نہیں کی مگر اسی صورت میں، اور نہ ہی اپنے خالق کے مرتبے کا دعویٰ کیا مگر اسی صورت میں، اور نہ ہی اس میں موت آئی مگر اسی صورت میں۔ اسی لیے اہل کبائر جہنم میں موت قبول کریں گے، پھر انہیں نکالا جائے گا اور نہر حیات میں غوطہ دیا جائے گا، تو وہ ایسی ترکیب میں ڈھل جائیں گے جو درد اور بیماریوں کو قبول نہیں کرے گی، اور وہ اسی صورت کے ساتھ جنت میں داخل ہوں گے۔\n\n### [اس بارے میں کہ صراط، صراط الہدیٰ ہے]\n\nاور جان لو کہ وہ صراط جس پر جب تو چلے گا تو اللہ تیرے قدموں کو ثابت رکھے گا یہاں تک کہ وہ تجھے جنت تک پہنچا دے گا، وہ صراط الہدیٰ ہے جسے تو نے دنیا میں اپنے لیے ظاہری اور باطنی نیک اعمال سے بنایا تھا۔ پس اس دنیا میں وہ معنی کے حکم میں ہے، اس کی کوئی حسی صورت نظر نہیں آتی۔ پھر قیامت کے دن وہ تیرے لیے جہنم کی پشت پر ایک محسوس پل کی صورت میں پھیلا دیا جائے گا، جس کا آغاز میدان حشر میں ہوگا اور اختتام جنت کے دروازے پر۔ جب تو اسے دیکھے گا تو پہچان لے گا کہ یہ تیری صنعت اور تیری تعمیر ہے۔ اور تو جان لے گا کہ یہ دنیا میں تیری طبیعت کی جہنم کی پشت پر تیری لمبائی، چوڑائی اور گہرائی میں تین شاخوں والا پل بنا ہوا تھا، کیونکہ تیرا جسم تیری حقیقت کا سایہ ہے، اور یہ ایسا سایہ ہے جو سایہ دار نہیں، جو اسے آگ کے شعلوں سے بے نیاز نہیں کرتا، بلکہ یہی وہ ہے جو اسے جہالت کے شعلوں کی طرف لے جاتا ہے اور اس میں اس کی آگ بھڑکاتا ہے۔\n\nپس انسان کامل (الإنسان الکامل) اپنی قیامت کو اس مقام پر جلد لے آتا ہے جہاں اس کی قیامت اسے فائدہ دے اور جہاں اس کی توبہ قبول ہو، اور وہ دنیا کا مقام ہے۔ کیونکہ آخرت کی قیامت میں کوئی عمل فائدہ نہیں دیتا، اس لیے کہ وہاں کسی عمل کا مکلف نہیں بنایا گیا، بلکہ وہ دنیا میں گزرے ہوئے اعمال کا بدلہ پانے کا مقام ہے۔ اور یہ اللہ تعالیٰ کا فرمان ہے: \"پھر ہدایت دی\" (الاعلیٰ: ۳) یعنی اس نے بیان کیا کہ مقامات کا تقاضا کیا ہے، تاکہ مخاطب انسان ہر مقام پر اس عمل کے ساتھ ہو جو اسے راضی کرتا ہے، اور وہ اس چیز کے ساتھ ملا ہوا ہو جو اس کے منافی ہے، بالکل اسی طرح جیسے طبعی اجسام کی تخلیق ہے۔ بے شک حرارت، برودت (ٹھنڈک) سے نفرت کرتی ہے، اور رطوبت (نمی)، یبوست (خشکی) سے نفرت کرتی ہے۔ اور ذات حق (الحق) نے ارادہ کیا کہ ان سب کو ایک ہی جسم میں ان کی ضدوں کے باوجود جمع کر دے۔ پس اس نے حرارت کو یبوست کے ساتھ ملایا، تو ان دونوں سے صفراوی مادہ (المرۃ الصفراء) پیدا کیا۔ پھر حرارت اور رطوبت کو جوڑا، تو اس مزاج سے خون بنا، اور اسے ان دونوں کے پڑوس میں رکھا۔ اس نے خون میں موجود رطوبت کو صفرا میں موجود یبوست کے قریب رکھا، پڑوس کے حکم سے، تاکہ وہ فعل میں اس کا مقابلہ کرے اور ان دونوں میں سے کسی کو بھی انسانی حیوانی مزاج میں اپنا تسلط ظاہر نہ کرنے دے۔\n\nاگر خونی حرارت کو اس کے قریب رکھا جاتا، تو صفرا میں سے لازماً یا تو حرارت یا یبوست اس کے قریب ہوتی۔ اگر یبوست اس کے قریب ہوتی، جو حرارت سے متاثر ہوتی ہے، تو خشکی کا تسلط جسم میں مضبوط ہو جاتا، جس سے بیماری داخل ہو جاتی، اور بیماری جسم کے رب کے اس حکم کے درمیان رکاوٹ بن جاتی کہ وہ علوم کے حصول اور سعادت تک پہنچانے والے اعمال میں مشغول ہو۔ اسی طرح اگر صفرا کی حرارت اس کے پڑوس میں ہوتی تو صفرا کی مقدار میں اضافہ ہو جاتا اور وہ بیمار ہو جاتا۔ اسی لیے رطوبت کو صفرا کے قریب رکھا گیا۔ پھر اللہ تعالیٰ نے برودت اور رطوبت کو جوڑا، تو اس اختلاط سے بلغم بنا۔ پس اس نے بلغمی رطوبت کو خونی حرارت کے قریب رکھا۔ اگر ایسا نہ ہوتا تو وہی ہوتا جو ہم نے پہلے ذکر کیا کہ اس خلط کی مقدار میں اضافے کی وجہ سے بیماری اور سقم داخل ہو جاتا۔ پھر اس نے برودت اور یبوست کو جوڑا، تو اس آمیزش سے سوداوی مادہ (المرۃ السوداء) بنا۔ پس اس نے سودا کی یبوست کو بلغم کی رطوبت کے قریب رکھا، اور سودا کی برودت کو اس کے قریب نہیں رکھا، تاکہ بلغم کی رطوبت کی مقدار میں اضافہ نہ ہو، کیونکہ رطوبت برودت سے متاثر ہوتی ہے۔ پس اگر بلغم کی برودت اور سودا کی برودت کے درمیان واقع ہو جاتی تو بلغم کی مقدار دوگنی ہو جاتی اور جسم میں بیماری اور علت داخل ہو جاتی، کیونکہ یہ انفعال قبول کرنے والی ہے۔ پس اللہ کی حکمت کو اس نشأت میں دیکھو، اور یہ اس جسم پر صحت کے باقی رہنے کے لیے ہے جو اس لطیفہ کی سواری ہے، تاکہ اسے اس منزل تک پہنچائے جس کی طرف اس کے رب نے اسے بلایا ہے۔\n\nپس اس جسمانی مرکب پر روح الٰہی غالب آتی ہے۔ جب وہ اسے ڈھانپ لیتی ہے تو وہ حاملہ ہو جاتا ہے اور اعمال پیدا کرتا ہے، یا تو نیک اعمال جو تخلیق شدہ ہیں، یا فاسد اعمال جو تخلیق شدہ نہیں ہیں۔ اور یہ اعمال سواریوں کی صورتوں میں ظاہر ہوتے ہیں۔ اگر وہ نیک ہوں تو اسے علیین کی طرف چڑھاتے ہیں۔ اللہ تعالیٰ فرماتا ہے: \"اسی کی طرف پاکیزہ کلمات چڑھتے ہیں\" (فاطر: ۱۰) یعنی پاکیزہ ارواح، کیونکہ وہ اللہ کے پاکیزہ کلمات ہیں۔ اللہ تعالیٰ نے فرمایا: \"اور اس کا کلمہ جسے اس نے مریم کی طرف ڈالا\" (النساء: ۱۷۱) اور فرمایا: \"اور نیک عمل اسے بلند کرتا ہے\" (فاطر: ۱۰)۔ اسی طرح جب عمل فاسد ہوتا ہے تو وہ اسے اسفل سافلین کی طرف گرا دیتا ہے۔ اللہ تعالیٰ فرماتا ہے: \"پھر ہم نے اسے سب سے نیچے گرا دیا\" (التین: ۵) یعنی اس کی سواری نے اسے گرا دیا، حالانکہ وہ بہترین ساخت پر تھا۔ \"سوائے ان لوگوں کے جو ایمان لائے اور نیک عمل کیے\" (التین: ۶) تو ان کا عمل انہیں علیین کی طرف چڑھاتا ہے، اور ان کے لیے \"نہ ختم ہونے والا اجر\" (التین: ۶) ہوتا ہے، اور وہ اجر مکتسب (حاصل کیا ہوا) ہے۔ اور اجر صرف مکتسب ہی ہوتا ہے، کیونکہ جو چیز کسب سے باہر دی جائے اسے اجر نہیں کہا جاتا، بلکہ وہ نور اور ہبات (عطیات) ہوتی ہیں۔ اسی لیے اللہ نے ایک قوم کے حق میں فرمایا: \"ان کے لیے ان کا اجر اور ان کا نور ہے\" (الحدید: ۱۹)۔ پس ان کا اجر وہ ہے جو انہوں نے کمایا، اور ان کا نور وہ ہے جو ذات حق (الحق) نے انہیں عطا کیا، تاکہ اجر اکیلا نہ رہے بغیر اس کے کہ اس میں وہب (عطا) شامل ہو، تاکہ وہ وہب بندے کو استحقاق کے اس تسلط کے مشاہدے (المشاھدۃ) سے مشغول کر دے جو اسے اجر دیتا ہے، کیونکہ یہ بندے کی طرف منسوب سابقہ عمل کا معاوضہ ہے۔ پس کوئی اجر نہیں مگر اس میں نور شامل ہوتا ہے، جیسا کہ ہم نے ذکر کیا، کیونکہ نشأت اسی اصل پر قائم ہوئی ہے۔ اور وہ یہ ہے کہ جب طبعی جسم ترکیب پا گیا اور اپنی حسی روح کے ساتھ ظاہر ہوا، اگر اسے آزاد چھوڑ دیا جاتا تو دعویٰ اسے ہلاک کر دیتا، لیکن اللہ نے اس کے لیے روح رحمانی سے ایک ربانی روح بنا دی جو کہ روح الٰہی ہے۔ پس انسان کا لطیفہ نور بن کر ظاہر ہوا اور اسے حیوانی جسم پر مقرر کر دیا گیا۔ اسی لیے انوار کو اجور کے ساتھ ملا دیا گیا، تاکہ الٰہی احسان اس بندے کے ساتھ رہے جہاں بھی وہ ہو۔ اور اللہ علیم (جاننے والا) اور حکیم (حکمت والا) ہے۔\n\nاور اسی لیے ہم نے کہا کہ یہ اختلاط کی منزل ہے، اگرچہ یہ بہت سے علوم پر مشتمل ہے، جن میں حروف معانی کا علم شامل ہے نہ کہ حروف ہجا کا۔ اور کیا جب بعض حروف بعض پر داخل ہوتے ہیں تو کیا وہ انہیں حرفیت کے مقام سے اسمیت کے مقام پر منتقل کر دیتے ہیں؟ کیونکہ حرف اپنے جیسے میں عمل نہیں کرتا، اور ایک حرف دوسرے حرف میں کس چیز سے عمل کرے گا، جبکہ ہر ایک حرف اپنے ساتھی سے زیادہ قوی نہیں ہوتا؟ جیسے حرف 'مِنْ' کا حرف 'عَنْ' پر داخل ہونا۔ حرف 'عَنْ' تجاوز کا معنی دیتا تھا، تو حرف 'مِنْ' نے اسے جہت اور ناحیہ پر دلالت کرنے والا بنا دیا، جیسا کہ اسم دلالت کرتا ہے۔ شاعر نے کہا:\n\nمن عن يمين الحبيا نظرة قبل‏\nترجمہ: حبیہ کے دائیں طرف سے ایک نظر پہلے۔\n\nپس 'یَمِین' میں 'عَنْ' کا عمل بلا شک ہے، لیکن کیا اس نے اس میں حرفیت کا عمل کیا کیونکہ اس کی صورت باقی ہے، یا اس نے اس میں اضافت کا عمل کیا جو کہ اسماء کا عمل ہے؟ تو اس کا عمل اس معنی کے ذریعے ہوگا جو 'مِنْ' نے اس پر داخل ہو کر اسے پہنایا، اور 'عَنْ' 'مِنْ' کا معمول بن جائے گا، یا وہ اپنی اصل پر باقی رہے گا؟ پس ہم حروف کے ایک دوسرے پر داخل ہونے کو جائز قرار دیتے ہیں، اور ان میں سے کسی ایک کا عمل چھوڑ دیتے ہیں اور اسے زائد بنا دیتے ہیں، جیسا کہ ہم 'مَا' کے ساتھ کرتے ہیں جب ہم اسے زائد قرار دیتے ہیں، جیسا کہ شاعر کے قول میں:\n\nإذا ما راية رفعت لمجد\nترجمہ: جب کوئی پرچم بزرگی کے لیے بلند کیا جائے۔\n\nیہاں 'مَا' زائدہ ہے، کیونکہ اس کے بغیر بھی کلام مکمل ہو جاتا ہے، تو آپ کہیں گے: \"إذا راية\" (جب پرچم)، پس یہاں اس کا کوئی عمل نہیں ہے۔ اسی طرح امرؤ القیس کے قول میں حرف 'إِنْ':\n\nفما إن من حديث ولا صال‏\nترجمہ: پس نہ کوئی بات ہے اور نہ کوئی باقی رہنے والا۔\n\nیہاں 'إِنْ' زائدہ ہے، اس کا کوئی عمل نہیں ہے۔ پس یہ بھی اسی طرح ہوگا، اور کوئی رکاوٹ نہیں ہے، کیونکہ اگر ہم اس کے قول \"من عن يمين\" سے 'عَنْ' کو حذف کر دیں تو معنی میں کوئی خلل نہیں آئے گا، اور حرف بغیر ضرورت کے اپنے باب سے اسمیت کے باب کی طرف نہیں نکلتا۔ اور جب ایک حرف کو دوسرے حرف سے بدل دیا جائے تو کیا وہ اس کا معنی دیتا ہے جس سے اسے بدلا گیا ہے؟\n\nیا کیا وہ اس کے برعکس معنی دیتا ہے؟ اور جو علوم اس منزل میں شامل ہیں ان میں علم مراکب (سواریوں) اور رکبان (سواروں) کا علم، علم زمان، علم شرف کلام، علم ذکر کا فکر پر شرف، اور یہ کہ ذات حق (الحق) نے اپنی صفت ذکر سے کی ہے اور اپنی صفت فکر سے نہیں کی، حالانکہ اس نے اپنے لیے تدبیر کو ثابت کیا ہے جو کہ فکر ہے یا اس کے لازم مقام پر قائم ہے۔ اور اس میں علم خلق اور صفات، علم بیان، علم احوال، علم استعداد، علم احسان، اور تجلی وسط اوسط (التجلی الوسط الأوسط) کا علم جو ذوق اور ری (سیرابی) کے درمیان ہے، اس مذہب میں جو ری کا قائل ہے۔ اور علم یقین کی ٹھنڈک کی برف کہاں سے حاصل ہوئی، اور اللہ کے لیے عبودیت (العبودیۃ) کا علم نہ کہ دوسری چیزوں کے لیے، اور اس عبودیت کے علوم میں کیا اثرات ہیں، اور واجبات کی ادائیگی سے کیا حاصل ہوتا ہے اس کا علم، اور علم آخرت، اور عطیات کی ہبات (عطاؤں) کا علم اور عطا کے احوال کا اختلاف، اور علم تقویٰ اور وقایوں کی اقسام، اور ارواح کی نعمتوں کا علم، اور عرش، رفارف، منبروں، تختوں، کرسیوں اور مراتب کا علم اور ان میں سے ہر ایک کا حصہ کہاں ہے، اور علم نقیضین (دو متضاد چیزوں)، اور تدانی اعلیٰ (بلند قربت) کا علم تدانی انزل (پست قربت) سے، اور علم ظلالات (سایوں)، اور ذلت کے طریقے سے انقیاد کا علم، اور بیت اللہ کے طواف اور طواف کرنے والوں کا علم، اور اس کا طواف کیوں کیا جاتا ہے اور کس چیز سے کیا جاتا ہے، اور علم اصطلام (مغلوبیت)، اور علم لآلی (موتیوں) اور سلوک، اور رتبہ الٰہیہ اور دنیاویہ کا علم اور ان کی اقسام، اور ان میں سے کون سی محمود ہے، اور علم تحجیل (سفیدی)، اور تقدیس تجلی (التجلی) کا علم، اور جزاء الٰہی کا علم، اور غیوب کے نازل ہونے کا علم، اور علم تکلیف، اور علم ارادہ، اور علم تبدیل اور ابدال، اور علم اختصاص۔ اور جو کچھ ہم نے علوم میں ذکر کیا ہے، ان میں سے ہر صنف میں مزید علوم ہیں۔ اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔",
    "fa": "باب سیصد و هشتم در معرفت منزل اختلاط (آمیزش) عالم کلی از حضرت محمدیه (الحضرة المحمدية).\n\nشگفتا از آن کس که به عدم گفت «باش» *** و آنچه به او گفته شد، در آنجا نبود\n\nبگو اگر بود، پس چرا به او گفته شد *** «تا باشی»، در حالی که هستی (الکون) چیزی است که تقسیم نمی‌پذیرد\n\nپس «باش» (کن) قدرت کسی را باطل کرد *** که عقل بر آن دلالت کرد و حکم نمود\n\nچگونه عقل دلیلی باشد، در حالی که *** آنچه عقل بنا نهاد، کشف (الکشف) آن را ویران کرد\n\nپس نجات نفس در شریعت است، مبادا *** انسانی باشی که دید و سپس محروم شد\n\nو در کشف (الکشف) به شریعت چنگ زن، زیرا *** بندگانی که حفظ شدند، به خیر دست یافتند\n\nفکر را رها کن و به آن اهمیت مده *** و آن را مانند گوشتی بر تخته قصابی واگذار\n\nهمانا فکر را مقامی است، پس در آن *** به آن تکیه کن تا شخصی باشی که مورد رحمت قرار گرفته است\n\nهر دانشی که شریعت بر آن گواهی دهد *** همان علم است، پس به آن چنگ زن\n\nو اگر عقل با آن مخالفت کرد، بگو *** حد خود را رعایت کن، شما را در آن قدمی نیست\n\nهمانا خداوند علومی بسیار دارد *** که کسی به آن‌ها رسید که نگفت «چه» و «چگونه»\n\nجهل به چگونگی (التکییف) در آن علوم، و دوری *** از حریم آن، به سبب رفعت سلطان (حق) است\n\nمانند جهل به لوحی که *** حق (الحق) در آن از علم قلم (القلم) خط کشید.\n\n### [اختلاف مردم در نام‌گذاری انسان]\n\nبدان که مردم در نام‌گذاری انسان (الإنسان) که چیست، اختلاف کرده‌اند. گروهی گفتند: او لطیفه (اللطيفة) است. گروهی گفتند: او جسم است. و گروهی گفتند: او مجموع (المجموع) است، و این قول اولی‌تر است. لفظ انسان بر آنچه هر گروهی بدان رفته است، وارد شده است. سپس در شرف او اختلاف کردیم که آیا شرف او ذاتی است یا به مرتبه‌ای است که پس از ظهورش در عین خود و تسویه کاملش در انسانیت، آن را به دست آورده است؛ خواه به واسطه علم باشد یا به واسطه خلافت (الخلافة) و امامت (الإمامة).\n\nکسی که گفت شرف او ذاتی است، به خلقت خداوند او را با دو دست خود نگریست و این را برای هیچ مخلوق دیگری جمع نکرد، و گفت که او را بر صورت خود آفرید. این دلیل کسی است که می‌گوید شرف او شرف ذاتی است.\n\nو کسی که با این قول مخالفت کرد، گفت: اگر شرف او ذاتی بود، هرگاه ذات او را می‌دیدیم، شرف او را می‌دانستیم، در حالی که امر چنین نیست. و انسان بزرگوار و شریف به واسطه علم و خُلقی که بر دیگر انسان‌ها دارد، متمایز نمی‌شد، در حالی که حد ذاتی هر دوی آن‌ها را در بر می‌گیرد. پس این دلالت می‌کند که شرف انسان به امری عارضی است که منزلت (المنزلة) یا مرتبه (المرتبة) نامیده می‌شود. پس منزلت است که شریف است و شخصی که به آن توصیف شده، شرف را به حکم تبعیت به دست آورده است، مانند مرتبه رسالت، نبوت، خلافت و سلطنت.\n\nو خداوند می‌فرماید: «أَ وَ لا يَذْكُرُ الْإِنْسانُ أَنَّا خَلَقْناهُ مِنْ قَبْلُ وَ لَمْ يَكُ شَيْئاً» (آیا انسان به یاد نمی‌آورد که ما او را پیش از این آفریدیم در حالی که چیزی نبود؟) و فرمود: «هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً» (آیا زمانی بر انسان گذشت که چیزی قابل ذکر نبود؟) یعنی زمانی بر انسان گذشته است و فرشتگان درباره او از حیث ذاتش آنچه گفتند، گفتند و راست گفتند. پس شرف او شناخته نشد مگر به آنچه خداوند از علم و خلافت به او عطا کرد.\n\nپس هیچ مخلوقی را بر دیگری شرف ذاتی نیست مگر به تشریف خداوند او را. و والاترین منازل نزد خداوند این است که خداوند مشاهده عبودیت (عبودية) بنده خود را همیشه حفظ کند، خواه خلعت‌های ربانی بر او بپوشاند یا نپوشاند. این شریف‌ترین منزلتی است که به بنده داده می‌شود و آن قول خداوند متعال است: «وَ اصْطَنَعْتُكَ لِنَفْسِي» (و تو را برای خود ساختم) و قول سبحانه: «سُبْحانَ الَّذِي أَسْرى‏ بِعَبْدِهِ» (پاک است آن کس که بنده خود را شبانه سیر داد)، که تنزیه خود را با بنده (عبد) بودن او قرین ساخت.\n\nبرخی از محبان در این مقام گفته‌اند:\n\n> لا تدعني إلا بيا عبدها *** فإنه أشرف أسمائي‏\nمرا جز به «ای بنده او» مخوان *** زیرا این شریف‌ترین نام‌های من است.\n\nپس برای هیچ ساخته‌ای شرفی بالاتر از انتساب آن به سازنده‌اش نیست. به همین دلیل، هیچ مخلوقی شرفی ندارد مگر به وجه خاصی که از حق (الحق) دارد، نه از جهت سبب مخلوقِ مانند خود. و در این شرف، اولین موجود که قلم (القلم) یا عقل (العقل) یا هر آنچه نامش نهادی، با پایین‌ترین موجودات از نظر مرتبه برابر است، زیرا نسبت در ایجاد یکی است و حقیقت در همه از جهت امکان (الإمكان) یکی است.\n\nپس آخرین صورتی که انسان در آن ظاهر شد، صورت آدمیه است و پس از آن صورتی پست‌تر نیست. و به واسطه همین صورت است که شقی در آتش خواهد بود، زیرا این نشئه و ترکیبی است که دردها و علت‌ها را می‌پذیرد. اما اهل سعادت، در نشئه و ترکیبی ایجاد می‌شوند که درد، بیماری و پلیدی را نمی‌پذیرد. به همین دلیل، اهل بهشت پیر نمی‌شوند، آب دهان نمی‌اندازند، ادرار و مدفوع نمی‌کنند، بیمار نمی‌شوند، گرسنه و تشنه نمی‌شوند. و اهل آتش برعکس آن‌ها هستند، و آن نشئه و ترکیب دنیاست. این پست‌ترین صورتی است که انسان پذیرفته است.\n\nو زمان‌ها و دهرها بر او گذشته است پیش از آنکه در این صورت آدمیه ظاهر شود، در حالی که او در هر مقام و حضرتی، از فلک و آسمان و غیره، صورتی داشته است که زمان‌ها و دهرها بر آن می‌گذشتند، اما هرگز در هیچ یک از آن صورت‌ها به این صورت آدمیه عنصری مذکور نبوده است. به همین دلیل، خداوند او را در هیچ یک از صورت‌هایش در تمام عالم مبتلا نساخت مگر در همین صورت آدمیه، و انسان هرگز خالق خود را عصیان نکرد مگر در آن، و ادعای مرتبه خالق خود را نکرد مگر در آن، و نمرد مگر در آن. به همین دلیل، اهل کبائر در آتش مرگ را می‌پذیرند، سپس خارج می‌شوند و در نهر حیات غوطه‌ور می‌گردند و ترکیبی می‌یابند که درد و بیماری را نمی‌پذیرد و با آن صورت وارد بهشت می‌شوند.\n\n### [صراط، صراط هدایت است]\n\nو بدان که صراطی (الصراط) که اگر بر آن گام نهی، خداوند پاهایت را بر آن ثابت می‌دارد تا تو را به بهشت برساند، همان صراط هدایت (الهدى) است که در سرای دنیا برای خود از اعمال صالحه (الأعمال الصالحة) ظاهری و باطنی ایجاد کرده‌ای. پس در این سرا، به حکم معناست و صورت حسی برای آن مشاهده نمی‌شود، اما روز قیامت برای تو پلی محسوس بر روی جهنم کشیده می‌شود که ابتدایش در موقف (محشر) و انتهایش بر در بهشت است. هنگامی که آن را مشاهده کنی، خواهی دانست که آن ساخته و بنای توست، و خواهی دانست که در دنیا پلی بر روی جهنمِ طبیعت تو، در طول و عرض و عمق و سه شعبه‌ات، کشیده شده بود، زیرا جسم تو سایه حقیقت توست، و آن سایه‌ای است که سایه‌دار نیست و تو را از شعله آتش بی‌نیاز نمی‌کند، بلکه همان است که تو را به شعله جهالت می‌کشاند و آتش آن را در تو شعله‌ور می‌سازد.\n\nپس انسان کامل (الإنسان الکامل) در موطنی که قیامتش در آن سودمند است و توبه‌اش در آن پذیرفته می‌شود، یعنی موطن دنیا، در قیامتش تعجیل می‌کند. زیرا قیامتی که در سرای آخرت است، عمل در آن سودی ندارد، چون در آنجا به عملی مکلف نشده است، بلکه آن موطن جزای اعمالی است که در سرای دنیا گذشته است.\n\nو این همان قول خداوند متعال است: «ثُمَّ هَدى‏» (سپس هدایت کرد)، یعنی بیان کرد که موطن‌ها چه اقتضایی دارند تا انسان مخاطب در هر موطنی، با عملی که به آن قرین شده است، به آنچه او را راضی می‌کند، مشغول شود. و این با آنچه منافی آن است آمیخته شده است، مانند خلقت اجسام طبیعی. زیرا حرارت با برودت منافرت دارد و رطوبت با یبوست. و حق (الحق) اراده کرد که همه را با وجود تضادشان در یک جسم جمع کند. پس حرارت را با یبوست ضمیمه کرد و از آن دو، مره صفرا (صفرا) را آفرید. سپس حرارت و رطوبت را با هم جفت کرد و از این مزاج، خون (الدم) حاصل شد و آن را در مجاورت آن دو قرار داد. رطوبتی که در خون است را به واسطه مجاورت، در کنار یبوستی که در صفرا است قرار داد تا در فعل با آن مقابله کند و نگذارد که هر یک از آن‌ها سلطه خود را در مزاج انسانی حیوانی آشکار سازد.\n\nاگر حرارت دموی را در کنار آن قرار می‌داد، ناگزیر باید از صفرا یا حرارت یا یبوست در کنار آن قرار می‌گرفت. اگر یبوست در کنار آن قرار می‌گرفت، که منفعل از حرارت است، سلطه خشکی در بدن تقویت می‌شد و منجر به ورود بیماری می‌گشت. و بیماری مانع او می‌شد از علومی که پروردگار جسم او را مکلف به اشتغال به آن‌ها کرده است و از کسب اعمالی که او را به سعادت می‌رساند. همچنین اگر حرارت صفرا در مجاورت آن قرار می‌گرفت، بر کمیت صفرا می‌افزود و بیمار می‌شد. به همین دلیل، رطوبت در کنار صفرا قرار گرفت.\n\nسپس خداوند متعال برودت و رطوبت را با هم جفت کرد و از این اختلاط، بلغم (البلغم) حاصل شد. پس رطوبت بلغمی را در کنار حرارت دموی قرار داد. اگر چنین نبود، همان‌طور که در ابتدا ذکر کردیم، به دلیل افزایش کمیت در آن خلط، علت و بیماری وارد می‌شد.\n\nسپس برودت و یبوست را با هم جفت کرد و از آن مزج، مره سودا (سودا) حاصل شد. پس یبوست سودا را در کنار رطوبت بلغم قرار داد و برودت سودا را در کنار آن قرار نداد تا بر کمیت رطوبت بلغم افزوده نشود، زیرا رطوبت منفعل از برودت است. اگر بین برودت بلغم و برودت سودا قرار می‌گرفت، مضاعف می‌شد و کمیت بلغم افزایش می‌یافت و علت و بیماری بر جسم وارد می‌شد، زیرا این‌ها قابلیت انفعال دارند. پس به حکمت خداوند در این نشئه بنگر. این برای بقای سلامتی بر این جسم است که مرکب این لطیفه است تا او را به آنچه پروردگارش عز و جل او را به آن فراخوانده است، برساند.\n\nاین مرکب جسمی، روح الهی (الروح الإلهي) بر آن مستولی می‌شود. هنگامی که آن را در بر می‌گیرد، حمل می‌کند و اعمالی را نتیجه می‌دهد؛ یا صالحه (شایسته) که همان اعمال مخلقه (آفریده شده) هستند، یا فاسده (ناشایست) که غیر مخلقه هستند. و این اعمال در صورت مرکب‌ها ظاهر می‌شوند. اگر صالحه باشند، او را به سوی علیین بالا می‌برند. خداوند متعال می‌فرماید: «إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ» (سخنان پاکیزه به سوی او بالا می‌رود)، یعنی ارواح پاکیزه، زیرا آن‌ها کلمات مطهر خداوند هستند. خداوند می‌فرماید: «وَ كَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ» (و کلمه‌اش را به مریم القا کرد) و فرمود: «وَ الْعَمَلُ الصَّالِحُ يَرْفَعُهُ» (و عمل صالح آن را بالا می‌برد).\n\nهمچنین اگر عمل فاسد باشد، او را به اسفل سافلین فرو می‌اندازد. خداوند متعال می‌فرماید: «ثُمَّ رَدَدْناهُ أَسْفَلَ سافِلِينَ» (سپس او را به پایین‌ترینِ پایین‌ها بازگرداندیم)، یعنی مرکبش او را فرو انداخت، در حالی که در «أَحْسَنِ تَقْوِيمٍ» (بهترین ساختار) بود. «إِلَّا الَّذِينَ آمَنُوا وَ عَمِلُوا الصَّالِحاتِ» (مگر کسانی که ایمان آوردند و کارهای شایسته انجام دادند)، زیرا عملشان آن‌ها را به علیین بالا می‌برد و برایشان «أَجْرٌ غَيْرُ مَمْنُونٍ» (پاداشی بی‌منت) خواهد بود. و اجر (پاداش) جز اکتسابی نیست. اگر چیزی خارج از کسب داده شود، به آن اجر گفته نمی‌شود، بلکه نور و هبات (عطاها) است. به همین دلیل در حق قومی فرمود: «لَهُمْ أَجْرُهُمْ وَ نُورُهُمْ» (برای آن‌ها پاداش و نورشان است). پاداش آن‌ها چیزی است که کسب کرده‌اند و نورشان چیزی است که حق تعالی به آن‌ها بخشیده است، تا اجر از وهب (بخشایش) جدا نماند و آن وهب، بنده را از معاینه سلطنت استحقاق که اجر را به او می‌دهد، باز دارد، زیرا اجر در مقابل عملی است که پیش از این انجام شده و به بنده نسبت داده شده است. پس هیچ اجری نیست مگر اینکه نور با آن آمیخته باشد به دلیل آنچه ذکر کردیم.\n\nزیرا نشئه بر این اصل بنا شده است. و آن این است که چون جسم طبیعی ترکیب شد و با روح حساس خود ظاهر گشت، اگر مستقل رها می‌شد، ادعا او را هلاک می‌کرد. اما خداوند برای او روح ربانی از نَفَس رحمان که همان روح الهی است، قرار داد. پس لطیفه انسان به صورت نور ظاهر شد و موکل بر جسم حیوانی گشت. به همین دلیل، انوار با اجور قرین شدند تا منت الهی در هر کجا که بنده باشد، همراه او باشد. و خداوند «عَلِيمٌ حَكِيمٌ» (دانا و حکیم) است.\n\nبه همین دلیل گفتیم که این منزل اختلاط (آمیزش) است، اگرچه علوم بسیاری را در بر می‌گیرد، از جمله علم حروف معانی، نه حروف هجا. و اینکه آیا اگر برخی از آن‌ها بر برخی دیگر وارد شوند، آن‌ها را از مقام حرفیت به مقام اسمیت منتقل می‌کنند؟ زیرا حرف در مانند خود عمل نمی‌کند و حرف چگونه در حرف عمل می‌کند، در حالی که هیچ حرفی از دیگری قوی‌تر نیست؟ مانند ورود «مِن» بر حرف «عَن». حرف «عَن» معنای تجاوز (گذشتن) می‌داد، اما حرف «مِن» آن را به معنای جهت و ناحیه تبدیل کرد، همان‌طور که اسم دلالت می‌کند. شاعر می‌گوید:\n\nمن عن يمين الحبيا نظرة قبل‏\nاز سوی راست حبیّا، نگاهی پیش از آن.\n\nعامل در «یمین» بدون شک «عَن» است، اما آیا «عَن» در آن عمل حرفیت انجام داده است به دلیل بقای صورتش، یا عمل اضافه انجام داده است که عمل اسم‌هاست؟ در این صورت، عمل آن از طریق معنایی است که «مِن» با ورود بر آن به آن پوشانده است و «عَن» معمولِ «مِن» است، یا بر اصل خود باقی می‌ماند؟\n\nما به جواز ورود حروف بر یکدیگر قائل هستیم و عمل یکی از آن‌ها را ترک می‌کنیم و آن را زائد قرار می‌دهیم، همان‌طور که در مورد «ما» عمل می‌کنیم، وقتی آن را زائد قرار می‌دهیم، در این قول:\n\nإذا ما راية رفعت لمجد\nهنگامی که پرچمی برای مجد برافراشته شد.\n\nدر اینجا «ما» زائد است، زیرا کلام بدون آن کامل است. می‌گویی: «إذا راية» (هنگامی که پرچمی). پس در اینجا عملی برای آن نیست. و همچنین حرف «إِن» در قول امرؤ القیس:\n\nفما إن من حديث ولا صال‏\nپس نه از حدیثی و نه از صالی.\n\nدر اینجا «إِن» زائد است و عملی ندارد. پس این نیز چنین است و مانعی ندارد، زیرا اگر «عَن» را از قول «مِن عَن یمین» حذف کنیم، معنا مختل نمی‌شود و حرف از باب خود به باب اسمیت منتقل نمی‌شود مگر در صورت ضرورت. و اگر حرفی به جای حرف دیگری تبدیل شود، آیا معنای آنچه به جای آن تبدیل شده است را می‌دهد یا خلاف آن را؟\n\nو این منزل شامل علم مرکب‌ها و سواران، علم زمان، علم شرف کلام، علم شرف ذکر بر فکر، و اینکه حق (الحق) خود را به ذکر وصف کرده و به فکر وصف نکرده است، با وجود اینکه تدبیر را برای خود اثبات کرده که همان فکر است یا در مقام لازم آن قرار می‌گیرد، و شامل علم خلق و صفات، علم بیان، علم احوال، علم استعداد، علم احسان، علم تجلی (التجلی) وسط اوسط که بین ذوق و ری (سیراب شدن) است در مذهب کسانی که به ری قائلند، و علم برف سرد یقین (ثلج برد الیقین) که از کجا حاصل شده است، و علم عبودیت (العبودية) برای خدا و نه برای غیر او از اشیاء، و آثاری که این عبودیت در علوم دارد، و علم آنچه ادای واجبات عطا می‌کند، و علم آخرت، و علم هبات (عطاها) از بخشش‌ها و اختلاف احوال عطا، و علم تقوا و انواع وقایات، و علم نعیم ارواح، و علم عرش و رفارف و منابر و تخت‌ها و کرسی‌ها و مراتب و بهره هر یک از آن‌ها کجاست، و علم نقیضین، و علم نزدیکی بالاتر از نزدیکی پایین‌تر، و علم ظلالات (سایه‌ها)، و علم انقیاد از طریق ذلت، و علم طواف به بیت و طواف‌کنندگان و اینکه چرا به دور آن طواف می‌شود و با چه چیزی طواف می‌شود، و علم اصطلام (محو شدن)، و علم لآلی (گوهرها) و سلوک، و علم رتبه الهی و دنیوی و تنوعات آن‌ها و آنچه از آن‌ها ستوده است، و علم تحجیل (سفیدی اعضا)، و علم تقدیس تجلی (التجلی)، و علم جزای الهی، و علم تنزیل غیوب، و علم تکلیف، و علم اراده، و علم تبدیل و ابدال، و علم اختصاص. و در هر صنفی از این علوم که ذکر کردیم، علومی دیگر وجود دارد. و خداوند «يَقُولُ الْحَقَّ وَ هُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}