{
  "id": 285,
  "title": {
    "ar": "الباب الخامس والثمانون ومائتان في معرفة منزل مناجاة الجماد ومن حصل فيه حصل من الحضرة المحمدية والموسوية نصفها",
    "en": "Chapter Two Hundred and Eighty-Five: Concerning the Gnosis (معرفة) of the Station (منزل) of Intimate Converse (مناجاة) with the Inanimate (الجماد), and that whoever attains this station achieves half of the Muhammadan Presence (الحضرة المحمدية) and the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب دو سو پچاسی: جماد (جماد) سے مناجات (مناجاة) کے منزل کی معرفت (معرفة) کے بیان میں، اور جو شخص اس منزل کو حاصل کرتا ہے وہ الحضرة المحمدية (الحضرة المحمدية) اور الحضرة الموسوية (الحضرة الموسوية) کا نصف حصہ حاصل کر لیتا ہے۔",
    "fa": "باب دویست و هشتاد و پنجم در معرفت منزل مناجات با جمادات، و کسی که در آن وارد شود، نصف [کمال] از حضرت محمدیه (الحضرة المحمدية) و موسویه (الموسوية) را به دست می‌آورد."
  },
  "content": {
    "ar": "## «الباب الخامس والثمانون ومائتان في معرفة منزل مناجاة الجماد ومن حصل فيه حصل من الحضرة المحمدية والموسوية نصفها»\n\n\n> تناجيني العناصر مفصحات *** بما فيها من العلم الغريب‏\n\n\n> فاعلم عند ذاك شفوف جسمي *** على نفسي وعقلي من قريب‏\n\n\n> فيا قومي علوم الكشف تعلو *** بما تعطي على علم القلوب‏\n\n\n> فإن العقل ليس له مجال *** بميدان المشاهد والغيوب‏\n\n\n> فكم للفكر من خطأ وعجز *** وكم للعين من نظر مصيب‏\n\n\n> ولو لا العين لم يظهر لعقل *** دليل واضح عند اللبيب‏\n\n\nأما قولنا وكم للعين من نظر مصيب فإنما جئنا به صنعة شعرية لما قلنا قبل في صدر البيت وإنما المذهب الصحيح إن العين لا تخطئ أبدا لا هي ولا جميع الحواس فإن إدراك الحواس الأشياء إدراك ذاتي ولا تؤثر العلل الظاهرة العارضة في الذاتيات‏\n\n\n### [إدراك العقل على قسمين إدراك ذاتي وإدراك غير ذاتي‏]\n\n\nوإدراك العقل على قسمين إدراك ذاتي هو فيه كالحواس لا يخطئ وإدراك غير ذاتي وهو ما يدركه بالآلة التي هي الفكر وبالآلة التي هي الحس فالخيال يقلد الحس فيما يعطيه والفكر ينظر في الخيال فيجد الأمور مفردات فيحب أن ينشئ منها صورة يحفظها العقل فينسب بعض المفردات إلى بعض فقد يخطئ في النسبة الأمر على ما هو عليه وقد يصيب فيحكم العقل على ذلك الحد فيخطئ ويصيب فالعقل مقلد ولهذا اتصف بالخطإ ولما رأت الصوفية خطأ النظار عدلوا إلى الطريقة التي لا لبس فيها ليأخذوا الأشياء عن عين اليقين ليتصفوا بالعلم اليقيني فإن الجاهل قد يتصف بالعلم فيما جهله ولا يتصف باليقين ولهذا جاز أن يضاف العلم إلى اليقين وليس من إضافة الشي‏ء إلى نفسه لا لفظا ولا معنى فأما اللفظ فإن لفظة اليقين ما هي لفظة العلم فجازت الإضافة ومن طريق المعنى‏\nإن اليقين عبارة عن استقرار العلم في النفس والاستقرار ما هو عين المستقر بل الاستقرار صفة للمستقر وهي حقيقة معنوية لا نفسية فليست عين نفس العلم فجازت الإضافة وإنما قلنا إن الجاهل قد يتصف بالعلم فيما هو جاهل به فهو قوله تعالى فَأَعْرِضْ\n\n\nعَنْ من تَوَلَّى عَنْ ذِكْرِنا ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وهُوَ أَعْلَمُ بِمَنِ اهْتَدى‏ فذكر اعلم في الصنفين إنما شرحنا بهذا الكلام ما قلناه في شعرنا فهو يتضمن شرح ما في هذا المنزل فلهذا أوردناه فلنرجع لي ما يعطيه هذا المنزل فنقول والله المؤيد\n\n\n### [من منزل مناجاة الجماد تسبيح الحصى في كف النبي ص‏]\n\n\nاعلم أن من هذا المنزل تسبيح الحصى في كف النبي صلى الله عليه وسلم ومن هذا المنزل أكله كتف الشاة ومن هذا المنزل حبه جبل أحد ومن هذا المنزل سلم عليه الحجر ومنه يشهد للمؤذن مدى صوته من رطب ويابس ومنه هرب الحجر بثوب موسى عليه السلام حتى أبصرت بنو إسرائيل عورته بريئة مما نسبوا إليه فقال فَبَرَّأَهُ الله مِمَّا قالُوا وكانَ عِنْدَ الله وَجِيهاً ومنه قالت السموات والأرض لما تعلق بهما الأمر الإلهي أَتَيْنا طائِعِينَ ولما كان طلب حمل الأمانة عرضا لا أمرا لهذا أبت القبول لعلمها أنها تقع في الخطر فلا تدري ما يؤول إليه أمرها في ذلك وحكم هذا المنزل في الشرع واسع فلنذكر بتأييد الله بعض ما يتضمنه هذا المنزل إن شاء الله تعالى‏\n\n\n### [علم الحركات المعقولة والمحسوسة]\n\n\nفأول علم يتضمنه هذا المنزل علم الحركات المعقولة والمحسوسة فاعلم إن الحركات وهي المعاني التي تكون عنها الانتقالات واختلف أصحابنا فيها هل هي ذوات موجودة في عينها أم هي نسب وهي عندنا نسب وهذه النسب تعطي من الأحكام بحسب ما تنسب إليه فلها نسبة في المتحيزات تخالف نسبتها في غير المتحيزات ونسبة في الأجسام تخالف نسبتها في الجواهر وما من موجود إلا ولها فيه نسبة خاصة وإن كانت نسبة\n\n\nقال رسول الله صلى الله عليه وسلم ينزل ربنا إلى السماء الدنيا في الثلث الباقي من الليل‏\n\n\nوهو موصوف سبحانه بأنه على عرشه مستو بالمعنى الذي أراده وهُوَ سبحانه مَعَكُمْ أَيْنَ ما كُنْتُمْ كما يليق به وهو أقرب من حَبْلِ الْوَرِيدِ إلينا وهو تعالى في العماء ما فوقه هواء وما تحته هواء فهذا كله يدلك على ما يراد بالانتقالات فقد يكون ظهور حكم صفة على صفة وقد يكون الانتقال من حال إلى حال وقد يكون من حيز إلى حيز وقد يكون من مكان إلى مكان وقد يكون من منزلة إلى منزلة فقد أعلمتك أن الانتقال سار في جميع الموجودات على ما تستحقه ذواتها فتختلف كيفيات النسب وكله راجع إلى حكم الحركة ومن هذا الباب قوله تعالى سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وقوله كُلَّ يَوْمٍ هُوَ في شَأْنٍ ثم لتعلم بعد أن قررنا هذا أن الحركة في المتحركات على قسمين طبيعية وهي كالنمو في الناميات وعرضية والعرضية اختيارية وغير اختيارية فالاختيارية لا توجد إلا في الحيوان وغير الاختيارية تكون في الحيوان وغيره وقسرية وهي التي تقع من غير المتحرك سواء اقتضاها طبعه أو لم يقتضها طبعه فالجماد والنبات الحركة القسرية فيه لا يقتضيها طبعه وغير الجماد تكون فيه على خلاف ما يقتضيه اختياره وقد يكون المحرك من جنس المحرك وقد لا يكون وقد تكون الحركة قسرية عن حركة قسرية وقد تكون لا عن حركة قسرية فالأولى كتحريك الرياح الأغصان والثانية رمى الإنسان الحجر علوا في الهواء ويدق الكلام في هذه المسألة ويخفى فإنها مسألة عظيمة القدر وما هي من العقول ببال ولها تعلق بباب التولد مثل حركة الخاتم لحركة الإصبع وحركة الكم لحركة اليد وللحركة سلطان عظيم حكمها مشهود في الأجسام ولوازمها ومعقول في المعاني وما لا يعرف حده فلها السريان الأتم في الموجودات وأول حكم لها في كل ما سوى الله خروج الأعيان وانتقالها من حالة العدم إلى حالة الوجود ولا يصح استقرار من موجود أصلا فإن الاستقرار سكون والسكون عدم الحركة فافهم وبعد أن تقرر هذا فإن الحركة التي في هذا المنزل التبس على الناس أمرها فما عرفوا هل هي طبيعية أو قسرية أو طبيعية قسرية أو طبيعية لا قسرية أو قسرية لا طبيعية وإنما تصور الخلاف ممن لم يشهد هذا المنزل ولا دخل فيه وهي عندنا حركة طبيعية اختيارية لإظهار أسرار عن أمر إلهي واختلفوا في السبب الموجب لهذه الحركة هل السبب سبب الحميات أو سببها عالم الأنفاس أو لا سبب لها إلا الأمر الإلهي‏\n\n\n### [تحريك الهواء الأشجار]\n\n\nفاعلم إن الأمر في ذلك وجود الأمر الإلهي في عالم الأنفاس فتوجه على هذا الكون فحركه فقبل الحركة بطبعه كتوجه الهواء على الأشجار ليحركها بهبوبه فالمشاهد يرى حركة الأغصان لهبوب الرياح والعلم يرى أنه‏\nلو لا ما أخلت الأغصان أحيازها لم تجد الرياح حيث تهب فلها الحكم فيها بوجه وليس لها الحكم فيها بوجه وكان المقصود من تحريك الهواء الأشجار إزالة الأبخرة الفاسدة عنها لئلا تودع فيها ما يوجب العلل والأمراض في العالم إذا تغذت به تلك الأشجار فيأكلها الحيوان أو تفسد هي في نفسها بتغذيها بذلك فكان هبوب الرياح لمصالح العالم حيث يطرد الوخم عنه ويصفي الجو فتكون الحياة طيبة فالريح سبب مقصود غير مؤثر في مسببه وإنما الأثر في ذلك لناصب الأسباب وجاعلها حجابا عنه ليتبين الفضل بين الخلائق في المعرفة بالله ويتميز من أشرك ممن وحد فالمشرك جاهل على الإطلاق فإن الشركة في مثل هذا الأمر لا تصح بوجه من الوجوه فإن إيجاد الفعل لا يكون بالشركة ولهذا لم تلتحق المعتزلة بالمشركين فإنهم وحدوا أفعال العباد للعباد فما جعلوهم شركاء وإنما أضافوا الفعل إليهم عقلا وصدقهم الشرع في ذلك والأشاعرة وحدوا فعل الممكنات كلها من غير تقسيم لله عقلا وساعدهم الشرع على ذلك لكن ببعض محتملات وجوه ذلك الخطاب فكانت حجج المعتزلة فيه أقوى في الظاهر وما ذهبت إليه الأشاعرة في ذلك أقوى عند أهل الكشف من أهل الله وكلا الطائفتين صاحب توحيد والمشرك إنما جهلناه لكون الموجود لا يتصف إلا بإيجاد واحد والقدرة ليس لها في الأعيان إلا الإيجاد فلا يكون الموجود موجودا بوجودين فلا يصح أن يكون الوجود عن تعلق قدرتين فإن كل واحدة منهما إنما تعطي الوجود للموجود فإذا أعطته الواحدة منهما وجوده فما للأخرى فيه من أثر فبطل إذا حققت الشركة في الفعل ولهذا هو غير مؤثر في العقائد فالمشرك الخاسر المشروع مقته هو من أضاف ما يستحقه الإله إلى غير الله فعبده على أنه إله فكأنه جعله شريكا في المرتبة كاشتراك السلطانين في معنى السلطنة وإن كان هذا لا يحكم في ملك هذا ولكن كل واحد منهما سلطان حقيقة وبعد أن عرفت ما يتعلق من العلم بالحركة على قدر ما أعطاه الوقت من التعريف بذلك فلنبين من هذا المنزل لم وجدت هذه الحركة الخاصة فاعلم أنها وجدت لإظهار ما خفي في الغيب من الأخبار التي يثقل كونها على الخلق كما قال تعالى إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا وقال في شأن الساعة ثَقُلَتْ في السَّماواتِ والْأَرْضِ وذلك أن الغيب إذا ثقل عليه الأمر وضاق عنه ولم يتسع له استراح على عالم الشهادة فتنفس الغيب تنفس الحامل المثقل فأبرز في عالم الشهادة ما كان ثقل عليه حمله وهو في المعنى كما يثقل على الإنسان كتم سره وحمل همه إذا لم يجد من يستريح عليه من إخوانه فإذا وجد أخا يبث إليه من همه الذي هو فيه وثقل عليه ما يجد في بثه له راحة بما أخذه منه صاحبه فكأنه قاسمه فيه فخف عليه فإن كان ما وقع له به الهم تحت قدرة من يبثه إليه من إخوانه فقضى حاجته أزال ذلك الثقل عنه بالكلية فمثل هذا هو الثقل الذي يكون في الغيب فيستريح على الشهادة وسبب ذلك كونه ليس له إنما هو أمانة عنده للشهادة وإذا كان المطلوب من ذلك الأمر الشهادة فإنما هو عند الغيب أمانة فيكون الغيب مكلفا بحفظها وأدائها في وقتها إلى الشهادة فبالضرورة يثقل عليه أ لا ترى إلى قول الله تعالى إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً يعني لنفسه جَهُولًا يعني بقدرها فهي ثقيلة في المعنى وإن كانت خفيفة في التحمل فكانت السموات والأرض والجبال في هذه المسألة\n\n\n### [إن الله خلق آدم على صورته‏]\n\n\nاعلم من الإنسان ولم تكن في الحقيقة اعلم وإنما الإنسان لما كان مخلوقا على الصورة الإلهية وكان مجموع العالم اغتر بنفسه وبما أعطاه الله من القوة بما ذكرناه فهان عليه حملها ثم إنه رأى الحق قد أهله للخلافة من غير عرض عليه مقامها فتحقق إن الأهلية فيه موجودة ولم تقو السموات على الانفراد ولا الأرض على الانفراد ولا الجبال على الانفراد قوة جمعية الإنسان فلهذا فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها وما علم الإنسان ما يطرأ عليه من العوارض في حملها فسمى بذلك العارض خائنا فإنه مجبول على الطمع والكسل وما قبلها إلا من كونه عجولا فلو فسح الحق له في الزمان حتى يفكر في نفسه وينظر في ذاته وفي عوارضه لبان له قدر ما عرض عليه فكان يأبى ذلك كما أبته السماء وغيرها ممن عرضت عليه ولقد روينا فيما رويناه عن الحسن البصري أن رجلا قدم من سفر فقصد دار الحسن فلما خرج إليه الحسن قال له إني قدمت من مدينة كذا وحملني فلان صديقك السلام عليك فهو يسلم عليك فقال له الحسن متى قدمت قال الساعة قال هل مشيت إلى بيتك قبل إن تأتيني قال لا هذا دخولي على حالتي إليك لأؤدي أمانتك قال يا هذا أما إنك‏\nلو مشيت إلى بيتك قبل أن تأتيني ومت مت خائنا فالعاقل من لا يعد ولا يحمل أمانة وحكم الأمانة إنما هي لمن توصل إليه لا لمن يحملك إياها قال تعالى إِنَّ الله يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى‏ أَهْلِها ولا شك ولا خفاء أنه في طبع كل شي‏ء القلق مما يثقل عليه حتى يخرجه عنه لكونه ليس له ما ثقل عليه وإنما هو أمر زائد فإذا كان ذلك الأمر له زال ذلك الثقل وفرح به حيث صار ملكه وظهرت له سيادته عليه أ لا ترى أن الإنسان إذا أودعت عنده مالا كيف يجد ثقله عليه ويتكلف حفظه وصيانته فإذا قال له رب المال قد وهبته لك وأخرجته عن ملكي وخرجت عنه كيف يرجع حمل ذلك المال عنده خفيفا ويسر به سرورا عظيما ويعظم قدر ذلك الواهب في نفسه كذلك العبد أوصاف الحق عنده أمانة لا يزال العارف بكونها أمانة عنده تثقل عليه بمراقبته كيف يتصرف بها وأين يصرفها ويخاف أن يتصرف فيها تصرف الملاك فإذا ثقل عليه ذلك ردها إلى صاحبها وبقي ملتذا خفيفا\n\n\nبعبوديته التي هي ملك له بل هي حقيقته إذ الزائد عليه قد زال عنه وحصل له الثناء الإلهي بأداء أمانته سالمة فقد أفلح من لم يتعد قدره كما يقال في المثل ما هلك امرؤ عرف قدره ومن هذا المنزل يعلم متعلق الاستفهام حيث كان وذلك أن الاستفهام لا يكون إلا مع عدم العلم في نفس الأمر أو مع إظهار عدم العلم لتقرير المستفهم من استفهمه على ما استفهمه مع علم المستفهم بذلك فيقول المستفهم أي شي‏ء عندك ومالك ضربت فلانا فعلة الاستفهام عن الأمور عدم العلم والباعث على الاستفهام يختلف باختلاف المستفهم فإن كان عالما بما استفهم عنه فالمقصود به إعلام الغير حيث ظنوا وقالوا خلاف ما هو الأمر عليه مثل قوله تعالى لعيسى عليه السلام أَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وأُمِّي إِلهَيْنِ من دُونِ الله بحضور من نسب إليه ذلك من العابدين له من النصارى فتبرأ عيسى بحضورهم من هذه النسبة فيقول سُبْحانَكَ ما يَكُونُ لِي أَنْ أَقُولَ ما لَيْسَ لِي بِحَقٍّ فكان المقصود توبيخ من عبده من أمته وجعله إلها فقد وقع في الصورة صورة الاستفهام وهو في الحقيقة توبيخ ومثل هذا في صناعة العربية إذا أعربوه في الاصطلاح يعربونه همزة تقرير وإنكار لا استفهام وإن قالوا فيه همزة استفهام والمراد به الإنكار فلهم في إعراب مثل هذا طريقتان فينبغي للعبد أن لا يظهر بصفة تؤديه إلى أن يستفهم عنه فيها ربه لما تعطيه رائحة الاستفهام في المستفهم من نفي العلم وذلك الجناب مقدس منزه عن هذا فاحذر من هذا المقام ولا تعصم من مثل هذا إلا بأن تكون عبوديتك حاكمة عليك ظاهرة فيك على كل حال فإن استفهمك الحق عن شي‏ء فيكون ذلك ابتداء منه لا سبب لك فيه وهو سبحانه لا يحكم عليه شي‏ء فإنه إن شاء استفهم وإن شاء لم يستفهم مع نسبة العلم إليه تعالى فيما يستفهم عنه لا بد من ذلك وللاستفهام أدوات مثل ما وأي والهمزة فيخص هذا المنزل من الأدوات بما خاصة دون من وغيرها من الأدوات ليس لغيرها من أدوات الاستفهام في هذا المنزل دخول وما وقفت إلى الآن على سبب اختصاص هذا المنزل بها دون غيرها وهي في الحكم فيمن تدخل عليه حكم من والهمزة فإنها تدخل على الأسماء والأفعال والحروف وما ثم إلا هذه الثلاث مراتب فعمت فكان لهذا المنزل عموم الاستفهام ولا يصح أن يظهر في هذا المنزل على هذه الحالة إلا أداة ما لأن معانيه تطلبها وقد يستفهم بالإشارة ومن هذا المنزل إفشاء الأسرار وخفي الغيوب لطلب المواطن لها فيعلم الإنسان من هذا المنزل المواطن التي ينبغي أن يبدي فيها مما عنده من الغيوب ويعرف أن موطن الدنيا لا يقتضي ذلك ولهذا لم يظهر من ذلك على الملامية شي‏ء وأعني بالغيوب هنا كل غيب لا يطلبه الموطن وأما الغيوب التي يطلبها كل موطن فلا بد أن يخرج غيب كل موطن في موطنه إلى الشهادة وهذا حال الملامية إلا أن يقترن بإبراز ذلك أمر إلهي ولا يقترن به أمر قط إلا أن يطلبه حال ما من الأحوال وأما من غير حال تطلبه فلا ولهذا جهل الناس مقادير أهل الله تعالى عند الله وبهذا سموا أمناء فإذا اقتضى الموطن‏\n\n\nإبراز غيبه فالعارف أول من يبادر إلى ذلك ويسارع فيه وإن لم يفعل كان غاشا خائنا لا يصلح لشي‏ء فإن سبق بإظهاره غيره تعين عليه ذلك الوقت إخفاؤه وأن لا يطلع أحد من الخلق على ما عنده فيه إذ قد ناب غيره فيه منابه فلم يبق لهذا العارف في إظهار ذلك منه إلا حظ نفس لا غير وهذا ليس من شأن خصائص الحق وأهله فإن جاءه وحي من الله بذلك مع أنه قد ظهر على يد غيره فليبادر لأمر الله فيه وليظهره ويكون فيه كالمؤيد للأول واعلم أنه ما من جنس من أجناس المخلوقين إلا وقد أوحي‏\nإليه من ملك وجن وإنسان وحيوان ونبات وجماد فذكر من الحيوان النحل ومن الجماد السماء والأرض وإن كان الكل عندنا أحياء ولكن نجري على المعهود المتعارف في الحس الغالب وقال تعالى وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وقال وإِنْ من أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ وقال ولَوْ جَعَلْناهُ مَلَكاً لَجَعَلْناهُ رَجُلًا وقال لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا وقال وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ أي بلحنهم‏\n\n\n### [الوحى على أقسام مختلفة]\n\n\nوالوحي على ضروب شتى ويتضمنه هذا المنزل فمنه ما يكون متلقى بالخيال كالمبشرات في عالم الخيال وهو الوحي في النوم فالمتلقى خيال والنازل كذلك والوحي كذلك ومنه ما يكون خيالا في حس على ذي حس ومنه ما يكون معنى يجده الموحى إليه في نفسه من غير تعلق حس ولا خيال بمن نزل به وقد يكون كتابة ويقع كثيرا للأولياء وبه كان يوحى لأبي عبد الله قضيب البان ولأبي زكريا البجائي بالمعرة بدير النقرة ولتقى بن مخلد تلميذ أحمد بن حنبل صاحب المسند ولكن كان أضعف الجماعة في ذلك فكان لا يجده إلا بعد القيام من النوم مكتوبا في ورقة ومما يتضمن هذا المنزل خلق الأعراض صورا ذوات قائمة متحيزة في رأى العين‏\n\n\n### [إن الله إذا أقبل على انسان جمعه الله جمعية لا تفرق فيه‏]\n\n\nفاعلم أن الإنسان إذا جاء الله به إليه جمعه عليه جمعية لا تفرقة فيها حتى يهبه الله تعالى في ذلك ما يريد أن يهبه مما سبق في علمه فإذا خرج عن ذلك المشهد وعن تلك الحالة حرج بما حصل له وكان قد حصل له أمرا كليا مجملا غير مفصل فيبدو له عند الخروج مفصل الأعيان لكل جزء منه صورة تخصه فيخرج عن حال جمعيته إلى حال تفرقته فتبادر صور الأعمال إليه دفعة واحدة وتتعلق كل صورة منها بمن كان أصلا في وجودها فأما له وإما عليه فتتعلق بعينه صور نظره وبإذنه صور تعلق سمعه وكذلك سائر حواسه في ظاهره ويتعلق بباطنه صور أعمال باطنه من أعمال فكره وخياله وسائر قواه الباطنة فيه فإن كانت الصور العملية توجب فرحا فرح بذلك وبضده وإن كانت صور الأعمال توجب حزنا وغما كان الإنسان بحسب ما توجبه الصورة فإن كان من صورة ما يوجب هذا ويوجب هذا كان فرح الجزء الذي له صورة العمل المفرح فرحا من حيثيته لا من حيث النفس المكلفة فيتنعم ذلك الجزء الإنساني بقدر ذلك ويحزن الجزء الآخر بصورة عمله أيضا والنفس في هذه الحالة تفرح بحكم التبعية لفرح هذا وتحزن بحكم التبعية لحزن هذا في حال واحدة بإقبالين مختلفين كما كانت تسمع في حال النظر في حال البطش في حال السعي في حال اللمس في حال الشم في حال الطعم ولا يشغلها واحد عن الباقي مع أحدية المدرك كذلك ينعم من طريق ويحزن من طريق فهو الفرح المحزون وهو الرابح المغبون إلى أن يدخل الجنة وهذا من أعجب المشاهد وقليل واجده في هذه الدار من أهل الطريق لعدم كشفهم وتحققهم وقلة علمهم بذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Eighty-Five: Concerning the Knowledge of the Station (منزل) of Conversing with Inanimate Objects (مناجاة الجماد), and how he who attains it receives half of the Muhammadan Presence (الحضرة المحمدية) and half of the Mosaic Presence (الموسوية).\n\nThe elements converse with me, articulating clearly,\nThe wondrous Knowledge (العلم الغريب) contained within them.\n\nKnow then that my body becomes transparent,\nRevealing my soul (نفسي) and my intellect (عقلي) immediately.\n\nO my people, the sciences of Unveiling (الكشف) surpass,\nThe knowledge of the hearts (علم القلوب) by virtue of what they bestow.\n\nFor the intellect (العقل) has no domain,\nIn the field of Witnessing (المشاهد) and the Unseen (الغيوب).\n\nHow often does thought (الفكر) err and fail,\nAnd how often does the eye possess accurate sight.\n\nWere it not for the eye, no clear proof,\nWould manifest to the intellect (العقل) for the discerning person.\n\nAs for our saying, \"and how often does the eye possess accurate sight,\" we only introduced it as a poetic device due to what we stated earlier in the first line of the verse. The correct doctrine (المذهب الصحيح) is that the eye never errs, nor do any of the senses, because the perception of things by the senses is an essential perception (إدراك ذاتي), and apparent, accidental defects do not affect essential realities.\n\n### [The Intellect's Perception is of Two Kinds: Essential Perception and Non-Essential Perception]\n\nThe intellect's perception (إدراك العقل) is of two kinds: essential perception (إدراك ذاتي), in which it is like the senses and does not err; and non-essential perception (إدراك غير ذاتي), which is what it perceives through the instrument of thought (الفكر) and the instrument of sense. Imagination (الخيال) imitates what the sense provides, and thought examines the imagination, finding matters as isolated particulars. It then seeks to construct a form from these particulars, which the intellect preserves, relating some particulars to others. It may err in relating the matter as it truly is, or it may be correct. The intellect then judges based on that definition, thus erring and being correct. The intellect is an imitator, and for this reason, it is characterized by error. When the Sufis (الصوفية) observed the errors of the speculative thinkers (النظار), they turned to the path that contains no ambiguity, so that they might receive things directly from the eye of Certainty (عين اليقين) and thus be characterized by Certain Knowledge (العلم اليقيني). For the ignorant person may be characterized by knowledge regarding what he is ignorant of, but he is not characterized by Certainty (اليقين). For this reason, it is permissible to attribute Knowledge (العلم) to Certainty (اليقين), and this is not the attribution of a thing to itself, neither verbally nor semantically. As for the verbal aspect, the word Certainty is not the word Knowledge, so the attribution is permissible. From the semantic perspective, Certainty is an expression for the stability of Knowledge (العلم) within the soul (النفس), and stability is not the essence of the stable thing; rather, stability is an attribute of the stable thing, and it is a conceptual reality (حقيقة معنوية), not the soul itself. Thus, it is not the essence of Knowledge itself, so the attribution is permissible. We said that the ignorant person may be characterized by knowledge regarding what he is ignorant of, and this is in reference to His saying, the Exalted: <<فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وهُوَ أَعْلَمُ بِمَنِ اهْتَدى‏>> (So turn away from whoever turns away from Our remembrance and desires nothing but the worldly life. That is their extent of knowledge. Indeed, your Lord is most knowing of who has strayed from His path, and He is most knowing of who has been guided). He mentioned \"most knowing\" (أعلم) regarding both categories. We have only explained through this discourse what we stated in our poetry, as it contains an explanation of what is in this station (منزل). For this reason, we included it. Let us now return to what this station bestows, and we say, with Allah's support:\n\n### [From the Station of Conversing with Inanimate Objects (مناجاة الجماد): The Glorification of the Pebbles in the Hand of the Prophet]\n\nKnow that among the manifestations of this station (منزل) is the glorification (تسبيح) of the pebbles in the hand of the Prophet (peace and blessings be upon him). Among the manifestations of this station is the shoulder of the sheep speaking to him. Among the manifestations of this station is Mount Uhud loving him. Among the manifestations of this station is the stone greeting him. Among the manifestations of this station is the dry and the wet bearing witness for the caller to prayer (المؤذن) as far as his voice reaches. Among the manifestations of this station is the stone running away with the garment of Moses (peace be upon him) until the Children of Israel saw his nakedness, proving him innocent of what they had accused him of. Thus, He said: <<فَبَرَّأَهُ الله مِمَّا قالُوا وكانَ عِنْدَ الله وَجِيهاً>> (So Allah cleared him of what they said, and he was honorable in the sight of Allah). Among the manifestations of this station is the saying of the heavens and the earth when the Divine Command (الأمر الإلهي) was directed at them: <<أَتَيْنا طائِعِينَ>> (We have come willingly). Since the request to bear the Trust (الأمانة) was an offer, not a command, they refused acceptance, knowing that they would fall into danger and not knowing what their outcome would be in that matter. The ruling of this station in the Sacred Law (الشرع) is vast. We shall mention, with Allah's support, some of what this station encompasses, if Allah wills, the Exalted.\n\n### [The Knowledge of Intelligible and Sensible Movements]\n\nThe first knowledge contained within this station is the knowledge of intelligible and sensible movements (الحركات المعقولة والمحسوسة). Know that movements (الحركات) are the meanings from which transitions (الانتقالات) arise. Our companions differed regarding them: are they existing essences (ذوات موجودة) in themselves, or are they relations (نسب)? In our view, they are relations. These relations yield rulings according to what they are related to. Thus, their relation in spatial things (المتحيزات) differs from their relation in non-spatial things, and their relation in bodies (الأجسام) differs from their relation in substances (الجواهر). There is no existing thing (موجود) except that it has a specific relation within it, even if it is a relation.\n\nThe Messenger of Allah (peace and blessings be upon him) said: \"Our Lord descends to the lowest heaven in the last third of the night.\"\n\nHe, the Glorified, is described as being established (مستو) upon His Throne (عرشه) in the manner He intended, and He, the Glorified, is <<مَعَكُمْ أَيْنَ ما كُنْتُمْ>> (with you wherever you are) in a manner befitting Him. He is closer to us than the <<حَبْلِ الْوَرِيدِ>> (jugular vein), and He, the Exalted, is in the Cloud ('Amā'), with no air above Him and no air below Him. All of this indicates what is meant by transitions (الانتقالات). It may be the manifestation of the ruling of one Attribute (صفة) over another Attribute. It may be the transition from one state (حال) to another state. It may be from one spatial location (حيز) to another spatial location. It may be from one place (مكان) to another place. It may be from one rank (منزلة) to another rank. I have informed you that transition is inherent in all existing things (الموجودات) according to what their essences (ذواتها) deserve, so the modalities of the relations differ, and all of it returns to the ruling of movement (الحركة).\n\nFrom this category is His saying, the Exalted: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> (We will attend to you, O you two heavy ones [jinn and mankind]), and His saying: <<كُلَّ يَوْمٍ هُوَ في شَأْنٍ>> (Every day He is in [some] affair).\n\nFurthermore, know, after we have established this, that movement in moving things (المتحركات) is of two kinds: natural (طبيعية), such as growth in growing things; and accidental (عرضية). Accidental movement is either voluntary (اختيارية) or involuntary (غير اختيارية). Voluntary movement is found only in the animal, while involuntary movement occurs in the animal and others. There is also compulsory movement (قسرية), which occurs from something other than the moving thing, whether its nature necessitates it or not. Compulsory movement in inanimate objects (الجماد) and plants is not necessitated by their nature. In non-inanimate objects, it occurs contrary to what their choice necessitates. The mover may be of the same genus as the moved, or it may not. Compulsory movement may result from another compulsory movement, or it may not. The first case is like the wind moving the branches, and the second is a person throwing a stone high into the air.\n\nThe discussion of this issue is subtle and hidden, for it is a matter of great importance, and the intellects cannot grasp it. It is related to the chapter on generation (التولد), such as the movement of the ring due to the movement of the finger, or the movement of the sleeve due to the movement of the hand. Movement (الحركة) has a great dominion; its ruling is witnessed in bodies (الأجسام) and their concomitants, and it is intelligible in meanings (المعاني) whose limits are unknown. It has the most complete permeation (السريان الأتم) in existing things. Its first ruling in everything other than Allah is the emergence of the essences (الأعيان) and their transition from the state of non-existence (العدم) to the state of existence (الوجود). Stability (استقرار) is never valid for any existing thing, for stability is rest (سكون), and rest is the absence of movement. Understand this.\n\nAfter this is established, the movement (الحركة) found in this station (منزل) has confused people, who have not known whether it is natural, compulsory, natural-compulsory, natural-non-compulsory, or compulsory-non-natural. This difference of opinion arose only among those who have not witnessed this station or entered it. In our view, it is a natural, voluntary movement (حركة طبيعية اختيارية) intended to manifest secrets (أسرار) from a Divine Command (أمر إلهي). They differed regarding the compelling cause (السبب الموجب) of this movement: Is the cause due to fevers (الحميات), or is its cause the world of breaths (عالم الأنفاس), or is there no cause for it except the Divine Command?\n\n### [The Movement of Trees by the Air]\n\nKnow that the matter concerning this is the existence of the Divine Command (الأمر الإلهي) in the world of breaths (عالم الأنفاس), which directed itself toward this cosmos (الكون) and moved it. The cosmos accepted the movement by its nature, just as the air directs itself toward the trees to move them with its blowing. The observer witnesses the movement of the branches due to the blowing of the winds, but Knowledge (العلم) sees that were it not for the branches vacating their spatial locations (أحيازها), the winds would not find a place to blow. Thus, the wind has a ruling over them in one respect, and no ruling over them in another respect.\n\nThe purpose of the air moving the trees was to remove the corrupt vapors (الأبخرة الفاسدة) from them, lest these vapors deposit in the trees what causes defects and diseases in the world when those trees feed upon them, or lest the trees themselves become corrupted by feeding on that. Thus, the blowing of the winds was for the benefit of the world, driving away miasma (الوخم) and purifying the atmosphere, so that life might be pleasant.\n\nThe wind is an intended cause (سبب مقصود) but is not effective in its effect. Rather, the effect belongs to the Establisher of the causes (ناصب الأسباب) and the One Who makes them a veil (حجاب) from Himself, so that the distinction in the Gnosis (المعرفة) of Allah may become clear among creation (الخلائق), and so that the polytheist (المشرك) may be distinguished from the monotheist (الموحد).\n\nThe polytheist is absolutely ignorant, for partnership in such a matter is not valid in any way, since the creation of an act (إيجاد الفعل) cannot occur through partnership. For this reason, the Mu'tazila (المعتزلة) were not classified as polytheists, for they affirmed the unity of the acts of the servants (أفعال العباد) for the servants themselves; they did not make them partners. Rather, they attributed the act to them rationally, and the Sacred Law confirmed them in this. The Ash'arites (الأشاعرة) affirmed the unity of the acts of all contingent beings (الممكنات) without any rational division for Allah, and the Sacred Law supported them in this, but through some possible interpretations of the aspects of that discourse. Thus, the arguments of the Mu'tazila were outwardly stronger, but what the Ash'arites adopted is stronger in the view of the People of Unveiling (أهل الكشف) among the People of Allah. Both groups are people of Unity (توحيد).\n\nWe only deemed the polytheist ignorant because the existing thing (الموجود) is characterized only by a single act of creation (إيجاد واحد), and Power (القدرة) has only creation in the Fixed Entities (الأعيان). Thus, an existing thing cannot exist through two existences (وجودين). It is therefore invalid for existence (الوجود) to result from the attachment of two powers, for each of them grants existence to the existing thing. If one of them grants it existence, the other has no effect in it. Thus, partnership in action is nullified when you verify it. For this reason, it is ineffective in matters of creed.\n\nThe polytheist whose hatred is sanctioned and who is the loser is the one who attributes what is due to the Deity (الإله) to other than Allah, and worships it as a deity. It is as if he made it a partner in rank, like the partnership of two sultans in the meaning of sovereignty, even if one does not rule in the kingdom of the other, yet each of them is truly a sultan.\n\nNow that you have known what knowledge pertains to movement (الحركة) according to what the time allowed for its definition, let us explain why this specific movement exists in this station. Know that it exists to manifest what was hidden in the Unseen (الغيب) of news that is heavy for creation (الخلق) to bear, as the Exalted said: <<إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا>> (Indeed, We will cast upon you a heavy word), and He said concerning the Hour: <<ثَقُلَتْ في السَّماواتِ والْأَرْضِ>> (It is heavy in the heavens and the earth).\n\nThis is because when the matter becomes heavy for the Unseen (الغيب) and it is constrained and cannot contain it, it finds relief in the world of Witnessing (عالم الشهادة). The Unseen breathes out, like a heavily burdened carrier, and manifests in the world of Witnessing what was heavy for it to carry.\n\nIn meaning, this is like the difficulty a person faces in concealing his secret and bearing his worry if he finds no one among his brethren to relieve himself upon. If he finds a brother to whom he can confide his worry, which was heavy upon him, he finds comfort in confiding it, because his companion has taken a share of it, making it lighter for him. If the cause of his worry was within the power of the brother to whom he confided, and the brother fulfilled his need, that burden would be entirely removed from him.\n\nThis is the nature of the heaviness that occurs in the Unseen, which finds relief in the Witnessing. The reason for this is that the matter does not belong to the Unseen; rather, it is a trust (أمانة) held for the Witnessing. Since the desired outcome of that matter is the Witnessing, it is merely a trust held by the Unseen. Thus, the Unseen is charged with preserving it and delivering it to the Witnessing at its appointed time, and necessarily, it becomes heavy upon it.\n\nDo you not see the saying of Allah, the Exalted: <<إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً>> (Indeed, We offered the Trust [الأمانة] to the heavens and the earth and the mountains, but they refused to bear it and were afraid of it; but man carried it. Indeed, he was unjust [ظلوماً])—meaning to himself—<<جَهُولًا>> (ignorant)—meaning of its true worth?\n\nThus, it is heavy in meaning, even if it is light in the act of carrying. The heavens, the earth, and the mountains were in this matter...\n\n### [Indeed, Allah Created Adam in His Image]\n\nKnow that Man (الإنسان) was more knowledgeable, though in reality, he was not more knowledgeable. Rather, because Man was created in the Divine Image (الصورة الإلهية) and was the summation of the cosmos (مجموع العالم), he was deceived by himself and by the strength Allah granted him, as we mentioned, so carrying the Trust became easy for him. Then he saw that the Real (الحق) had qualified him for the Vicegerency (الخلافة) without offering him its station, so he realized that the qualification existed within him. The heavens were not strong enough individually, nor the earth individually, nor the mountains individually, with the comprehensive strength of Man. For this reason, <<فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها>> (they refused to bear it and were afraid of it).\n\nMan did not know the accidents (العوارض) that would befall him in carrying it, and thus he was called a traitor (خائنا) by that accident, for he is naturally inclined toward greed and laziness. He only accepted it because he was hasty (عجولاً). Had the Real granted him time to reflect upon himself, examine his essence (ذاته), and his accidents, the true worth of what was offered to him would have become clear, and he would have refused it, just as the heaven and others upon whom it was offered refused it.\n\nWe have narrated, among what we narrated from Al-Hasan al-Basri, that a man arrived from a journey and sought the house of Al-Hasan. When Al-Hasan came out to him, the man said: \"I have arrived from such-and-such a city, and so-and-so, your friend, entrusted me with greetings for you; he sends his peace upon you.\" Al-Hasan asked him: \"When did you arrive?\" He said: \"Just now.\" Al-Hasan asked: \"Did you walk to your house before coming to me?\" He said: \"No, this is my entry to you in my current state, to deliver your trust (أمانتك).\" Al-Hasan said: \"O man, had you walked to your house before coming to me and died, you would have died a traitor (خائنا).\"\n\nThe wise person is one who neither promises nor carries a trust. The ruling of the Trust (الأمانة) is that it belongs to the one to whom it is delivered, not the one who carries it for you. The Exalted said: <<إِنَّ الله يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى‏ أَهْلِها>> (Indeed, Allah commands you to render trusts [الأمانات] to their rightful owners).\n\nThere is no doubt or obscurity that it is in the nature of everything to be restless (القلق) about what weighs heavily upon it until it is rid of it, because what weighs heavily upon it does not belong to it; rather, it is an added matter. If that matter belongs to it, the heaviness vanishes, and it rejoices in it, as it has become its possession and its dominion over it has appeared.\n\nDo you not see how a person feels the burden when money is deposited with him, and he takes pains to guard and protect it? But if the owner of the money says to him, \"I have gifted it to you, and it is no longer my property,\" how the burden of carrying that money becomes light for him, and he rejoices greatly, and the worth of the donor is magnified in his soul?\n\nSimilarly, the Attributes (أوصاف) of the Real (الحق) are a trust with the servant. The Gnostic (العارف), knowing them to be a trust with him, finds them constantly heavy due to his vigilance over how he uses them and where he directs them, fearing that he might use them as an owner would. When this becomes heavy upon him, he returns them to their Owner and remains light and delighted in his servitude (عبوديته), which is his possession—indeed, it is his reality—since the excess has departed from him. He has attained the Divine Praise (الثناء الإلهي) for delivering his trust safely. Successful is he who does not exceed his measure, as the proverb says: \"No man who knew his measure perished.\"\n\nFrom this station (منزل) is understood the connection of the interrogative (الاستفهام) and where it occurs. Interrogation only occurs when there is an absence of knowledge regarding the matter itself, or when the absence of knowledge is displayed in order to confirm the one being questioned regarding the subject of the interrogation, even though the questioner knows the answer. For example, the questioner says, \"What do you have?\" or \"Why did you strike so-and-so?\" The function of interrogation concerning matters is the absence of knowledge.\n\nThe motive for interrogation differs according to the questioner. If the questioner is knowledgeable about what he is asking, the purpose is to inform others, since they thought or said something contrary to the reality of the matter. An example is the saying of the Exalted to Jesus (peace be upon him): <<أَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وأُمِّي إِلهَيْنِ من دُونِ الله>> (Did you say to the people, 'Take me and my mother as two gods besides Allah'?) in the presence of those who attributed this to him among the Christians who worshipped him. Jesus disavowed this attribution in their presence, saying: <<سُبْحانَكَ ما يَكُونُ لِي أَنْ أَقُولَ ما لَيْسَ لِي بِحَقٍّ>> (Exalted are You! It was not for me to say that to which I had no right). The purpose was to rebuke those of his community who worshipped him and made him a god. Thus, the form is that of interrogation, but the reality is rebuke.\n\nIn the science of Arabic grammar (صناعة العربية), when they parse such a phrase in technical terms, they parse the hamza as one of confirmation and denial (همزة تقرير وإنكار), not interrogation, even if they call it the hamza of interrogation but intend denial. They have two methods for parsing such a phrase.\n\nThe servant should not manifest an attribute that leads his Lord to question him about it, because the scent of interrogation implies the negation of knowledge in the questioner, and that Divine Presence (الجناب) is sanctified and transcendent above this. Beware of this station! You are only protected from such a thing by ensuring that your servitude (عبوديتك) is dominant over you and manifest in you at all times. If the Real questions you about something, let that be an initiation from Him, with no cause originating from you. He, the Glorified, is not ruled by anything, for He questions if He wills and does not question if He wills, while the attribution of Knowledge (العلم) to Him, the Exalted, regarding what He questions about, is necessary.\n\nInterrogation has tools, such as *mā* (ما), *ay* (أي), and the hamza (أ). This station (منزل) is specifically associated with the tool *mā* (ما) alone, excluding *man* (من) and other tools of interrogation. Other interrogative tools have no entry into this station. In its ruling over what it enters, *mā* is like *man* and the hamza, for it enters upon nouns, verbs, and particles. Since there are only these three levels (مراتب), it encompasses general interrogation. Only the tool *mā* (ما) is valid to appear in this station in this state, because its meanings demand it. Interrogation may also occur through gesture.\n\nFrom this station is the disclosure of secrets (إفشاء الأسرار) and hidden mysteries (خفي الغيوب) due to the demand of the contexts (المواطن) for them. From this station, a person learns the contexts in which he should reveal the mysteries he possesses. He knows that the context of the world (الدنيا) does not necessitate this, and for this reason, nothing of that is manifested by the People of Blame (الملامية). By \"mysteries\" (الغيوب) here, I mean every mystery that the context does not demand. As for the mysteries that every context demands, the mystery of every context must necessarily emerge into the Witnessing (الشهادة) in its context. This is the state of the People of Blame, unless the manifestation is accompanied by a Divine Command (أمر إلهي). It is never accompanied by a command unless a state (حال) demands it. If no state demands it, then no. For this reason, people are ignorant of the ranks of the People of Allah (أهل الله) with Allah, the Exalted. By this, they are called Trustees (أمناء).\n\nIf the context demands the manifestation of its mystery, the Gnostic (العارف) is the first to hasten and rush to do so. If he does not, he is deceitful and a traitor (غاشا خائنا), unfit for anything. If someone else precedes him in manifesting it, then it becomes incumbent upon the Gnostic at that moment to conceal it and not let any creature know what he possesses concerning it, since someone else has taken his place in manifesting it. Nothing remains for this Gnostic in manifesting it except a share for the ego (حظ نفس), and this is not the characteristic of the special people of the Real (خصائص الحق) and His folk.\n\nHowever, if a revelation (وحي) comes to him from Allah concerning it, even though it has already appeared through someone else, he must hasten to obey Allah's command and manifest it, acting as a confirmer of the first person.\n\nKnow that there is no genus among the genera of created beings (المخلوقين) except that revelation (وحي) has been sent to it: from angels, jinn, humans, animals, plants, and inanimate objects (جماد). He mentioned the bee from the animals, and the heaven and earth from the inanimate objects, even though all are living in our view, but we follow the common and generally accepted sensory understanding.\n\nThe Exalted said: <<وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (And there is not a thing except that it glorifies [Allah] with His praise). And He said: <<وإِنْ من أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ>> (And there was no nation but that there had passed within it a warner). And He said: <<ولَوْ جَعَلْناهُ مَلَكاً لَجَعَلْناهُ رَجُلًا>> (And if We had made him an angel, We would have made him [appear as] a man). And He said: <<لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا>> (If there had been upon the earth angels walking securely, We would have sent down to them from the heaven an angel as a messenger). And He said: <<وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ>> (And We did not send any messenger except with the language of his people)—meaning, with their dialect.\n\n### [Revelation (الوحي) is of Different Kinds]\n\nRevelation (الوحي) is of various kinds, and this station encompasses them. Some of it is received through the Imagination (الخيال), such as glad tidings in the world of Imagination (عالم الخيال), which is revelation in sleep. The recipient is the imagination, the descender is likewise, and the revelation is likewise. Some of it is imagination in the sense perception of the one possessing sense perception. Some of it is a meaning (معنى) that the recipient of the revelation finds within himself, without any connection of sense or imagination to the one who brought it down. It may also be in writing, and this often occurs for the Friends of Allah (الأولياء). It was by this means that revelation came to Abu Abd Allah Qadib al-Ban, and to Abu Zakariyya al-Baja'i in Ma'arra at Dayr al-Nuqra, and to Taqi ibn Makhlad, the student of Ahmad ibn Hanbal, the author of the *Musnad*, though he was the weakest of the group in this, as he only found it written on a sheet of paper after waking up from sleep.\n\nAmong what this station encompasses is the creation of accidents (الأعراض) as standing, spatial forms (صورا ذوات قائمة متحيزة) visible to the eye.\n\n### [Indeed, when Allah Turns toward a Person, He Gathers Him with a Comprehensive Unity (جمعية) in which there is no Dispersion]\n\nKnow that when Allah brings a person to Himself, He gathers him upon Himself with a comprehensive Unity (جمعية) in which there is no dispersion (تفرقة), until Allah, the Exalted, bestows upon him in that state whatever He willed to bestow upon him from what preceded in His Knowledge (علمه). When he departs from that scene and that state, he emerges with what he has attained, which was a universal, summarized matter, not detailed. Upon emerging, the detailed Fixed Entities (الأعيان) appear to him, each part having a specific form. He thus moves from his state of Unity (جمعية) to a state of dispersion (تفرقة).\n\nThe forms of actions rush toward him simultaneously, and each form attaches itself to the part that was the origin of its existence, whether for him or against him. The forms of his gaze attach to his eye, and the forms related to his hearing attach to his ear, and likewise for all his external senses. The forms of his inner actions—the actions of his thought (فكره), his imagination (خياله), and all his inner faculties—attach to his inner being.\n\nIf the operational forms necessitate joy, he rejoices in that, and the opposite is true. If the forms of actions necessitate sadness and grief, the person is affected according to what the form necessitates. If a form necessitates both this and that, the joy of the part that has the form of the joyful action is joy from its own perspective, not from the perspective of the responsible soul (النفس المكلفة). That human part is thus blessed to that extent, and the other part grieves due to the form of its action as well.\n\nThe soul (النفس) in this state rejoices by way of consequence (حكم التبعية) for the joy of the one, and grieves by way of consequence for the grief of the other, in one single state but with two different orientations (إقبالين مختلفين). This is just as it heard while looking, while striking, while striving, while touching, while tasting, and one sense does not distract it from the rest, despite the oneness of the perceiver. Similarly, he is blessed from one path and grieves from another. He is the joyful-grieving, the profitable-cheated, until he enters Paradise.\n\nThis is one of the most wondrous Witnessings (المشاهد), and few are those who find it in this abode among the People of the Path (أهل الطريق) due to their lack of Unveiling (كشف), their lack of realization, and their limited knowledge of it. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو پچاسی: جمادات (الجماد) کی مناجات کے مقام کی معرفت میں، اور جو شخص اس مقام کو حاصل کرتا ہے، وہ حضرت محمدیہ (الحضرة المحمدیۃ) اور حضرت موسویہ کا نصف حصہ حاصل کر لیتا ہے۔\n\nعناصر مجھ سے سرگوشی کرتے ہیں،\nان عجیب علوم (العلم الغریب) کو واضح کرتے ہوئے جو ان کے اندر ہیں۔\n\nپس اس وقت جان لو کہ میرے جسم کا\nمیری نفس اور میری عقل پر قریب سے غلبہ (شفوف) ہے۔\n\nاے میری قوم! علوم کشف (الکشف) برتری رکھتے ہیں\nاس علم پر جو وہ علوم قلوب پر عطا کرتے ہیں۔\n\nکیونکہ عقل کے لیے کوئی گنجائش نہیں\nمشاہدات (المشاهد) اور غیوب (الغيوب) کے میدان میں۔\n\nپس فکر (الفکر) میں کتنی غلطی اور عجز ہے،\nاور آنکھ (حس) میں کتنی درست نظر ہے۔\n\nاور اگر آنکھ نہ ہوتی تو عقل کے لیے\nدانا کے نزدیک کوئی واضح دلیل ظاہر نہ ہوتی۔\n\nہمارا یہ قول کہ \"آنکھ میں کتنی درست نظر ہے\" ہم نے اسے صرف شعری صنعت کے طور پر لائے ہیں، اس بات کی وجہ سے جو ہم نے اس شعر کے آغاز میں کہا۔ درحقیقت صحیح مسلک یہ ہے کہ آنکھ کبھی غلطی نہیں کرتی، نہ وہ اور نہ ہی تمام حواس (الحواس)، کیونکہ حواس کا اشیاء کا ادراک کرنا ذاتی (ذاتي) ادراک ہے، اور ظاہری عارضی علتیں ذاتیات پر اثر انداز نہیں ہوتیں۔\n\n### [عقل کا ادراک دو قسموں پر ہے: ذاتی ادراک اور غیر ذاتی ادراک]\n\nاور عقل کا ادراک دو قسموں پر ہے: ایک ذاتی ادراک (إدراك ذاتي) ہے جس میں وہ حواس کی طرح ہے اور غلطی نہیں کرتا، اور دوسرا غیر ذاتی ادراک (إدراك غير ذاتي) ہے، جو وہ اس آلے کے ذریعے حاصل کرتا ہے جو فکر (الفکر) ہے، اور اس آلے کے ذریعے جو حس (الحس) ہے۔ پس خیال (الخیال) حس کی دی ہوئی چیزوں کی تقلید کرتا ہے، اور فکر خیال میں غور کرتی ہے، تو چیزوں کو مفردات کی صورت میں پاتی ہے، پھر وہ چاہتی ہے کہ ان سے ایک ایسی صورت بنائے جسے عقل محفوظ کر لے، تو وہ بعض مفردات کو بعض سے منسوب کرتی ہے۔ پس وہ نسبت دینے میں اس امر پر غلطی بھی کر سکتی ہے جیسا کہ وہ حقیقت میں ہے، اور درست بھی ہو سکتی ہے۔ پھر عقل اس حد پر حکم لگاتی ہے، تو غلطی بھی کرتی ہے اور درست بھی ہوتی ہے۔ پس عقل مقلد ہے، اور اسی لیے وہ غلطی سے متصف ہوئی۔ جب صوفیاء نے نظری (نظار) لوگوں کی غلطی دیکھی تو انہوں نے اس طریقے کی طرف رجوع کیا جس میں کوئی ابہام نہیں، تاکہ وہ اشیاء کو عین الیقین (عين اليقين) سے حاصل کریں، تاکہ وہ علم یقینی (العلم الیقینی) سے متصف ہوں۔ کیونکہ جاہل شخص اس چیز میں علم سے متصف ہو سکتا ہے جس سے وہ جاہل ہے، لیکن وہ یقین سے متصف نہیں ہو سکتا۔ اسی لیے علم کو یقین کی طرف مضاف کرنا جائز ہوا، اور یہ نہ لفظاً اور نہ معنیً کسی شے کو خود اپنی طرف مضاف کرنے کے مترادف ہے۔ جہاں تک لفظ کا تعلق ہے، تو لفظ یقین، لفظ علم نہیں ہے، لہٰذا اضافت جائز ہوئی۔ اور معنی کے لحاظ سے، یقین سے مراد نفس میں علم کا مستحکم ہو جانا ہے، اور استقرار (استقرار) خود مستقر (مستقر) نہیں ہے، بلکہ استقرار مستقر کی صفت ہے، اور یہ ایک معنوی حقیقت ہے نہ کہ نفسی، لہٰذا یہ خود علم کی عین نہیں ہے، پس اضافت جائز ہوئی۔ ہم نے جو کہا کہ جاہل شخص اس چیز میں علم سے متصف ہو سکتا ہے جس سے وہ جاہل ہے، تو یہ اللہ تعالیٰ کا فرمان ہے:\nفَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وهُوَ أَعْلَمُ بِمَنِ اهْتَدى‏\n(پس آپ اس شخص سے منہ پھیر لیں جس نے ہمارے ذکر سے منہ موڑا اور دنیا کی زندگی کے سوا کچھ نہ چاہا۔ یہی ان کے علم کی انتہا ہے۔ بے شک آپ کا رب ہی بہتر جانتا ہے کہ کون اس کے راستے سے بھٹکا اور وہی بہتر جانتا ہے کہ کون ہدایت یافتہ ہوا۔)\nپس دونوں گروہوں میں \"اعلم\" (زیادہ جاننے والا) کا ذکر کیا۔ ہم نے اس کلام کے ذریعے اپنے شعر میں کہی گئی بات کی وضاحت کی ہے، لہٰذا یہ اس مقام (منزل) میں موجود چیزوں کی وضاحت پر مشتمل ہے، اسی لیے ہم نے اسے یہاں درج کیا۔ اب ہم اس طرف لوٹتے ہیں جو یہ مقام عطا کرتا ہے، اور ہم کہتے ہیں، اور اللہ ہی مددگار ہے۔\n\n### [جمادات (الجماد) کی مناجات کے مقام سے: نبی ﷺ کی ہتھیلی میں کنکریوں کی تسبیح]\n\nجان لیجیے کہ اس مقام میں سے نبی اکرم صلی اللہ علیہ وسلم کی ہتھیلی میں کنکریوں کی تسبیح ہے۔ اور اسی مقام میں سے بکری کے شانے کا آپ سے کلام کرنا ہے۔ اور اسی مقام میں سے جبل احد کا آپ سے محبت کرنا ہے۔ اور اسی مقام میں سے پتھر کا آپ کو سلام کرنا ہے۔ اور اسی میں سے یہ ہے کہ مؤذن کی آواز کی حد تک ہر تر اور خشک چیز اس کے لیے گواہی دیتی ہے۔ اور اسی میں سے حضرت موسیٰ علیہ السلام کے کپڑے کے ساتھ پتھر کا بھاگ جانا ہے، یہاں تک کہ بنی اسرائیل نے ان کی شرمگاہ کو دیکھ لیا، اور وہ اس الزام سے بری ہو گئے جو انہوں نے ان پر لگایا تھا، پس اللہ تعالیٰ نے فرمایا: فَبَرَّأَهُ الله مِمَّا قالُوا وكانَ عِنْدَ الله وَجِيهاً (پس اللہ نے انہیں اس سے بری کر دیا جو انہوں نے کہا، اور وہ اللہ کے نزدیک وجیہ تھے)۔ اور اسی میں سے آسمانوں اور زمین کا یہ کہنا ہے جب ان سے امر الٰہی متعلق ہوا: أَتَيْنا طائِعِينَ (ہم فرمانبردار ہو کر حاضر ہوئے)۔ اور چونکہ امانت اٹھانے کا مطالبہ ایک عرض (پیشکش) تھا نہ کہ امر (حکم)، اسی لیے انہوں نے قبول کرنے سے انکار کر دیا، کیونکہ وہ جانتی تھیں کہ وہ خطرے میں پڑ جائیں گی اور انہیں معلوم نہیں تھا کہ اس کا انجام کیا ہو گا۔ اور شریعت میں اس مقام کا حکم وسیع ہے۔ پس ہم اللہ کی تائید سے ان شاء اللہ اس مقام میں شامل بعض چیزوں کا ذکر کرتے ہیں۔\n\n### [معقول اور محسوس حرکات کا علم]\n\nپس پہلا علم جو اس مقام میں شامل ہے، وہ معقول (معقولۃ) اور محسوس (محسوسۃ) حرکات کا علم ہے۔ جان لیجیے کہ حرکات (الحركات)، جو کہ وہ معانی ہیں جن سے نقل و حرکت (الانتقالات) ہوتی ہے، ہمارے اصحاب نے اس بارے میں اختلاف کیا ہے کہ آیا وہ اپنی ذات میں موجود ذوات ہیں یا وہ نسب (نسب) ہیں۔ اور ہمارے نزدیک وہ نسب ہیں۔ اور یہ نسب ان احکام کو عطا کرتی ہیں جن کے مطابق ان کی نسبت کی جاتی ہے۔ پس ان کی نسبت متحیزات (محدود جگہوں والی اشیاء) میں ان کی نسبت سے مختلف ہوتی ہے جو غیر متحیزات میں ہوتی ہے، اور اجسام میں ان کی نسبت اس نسبت سے مختلف ہوتی ہے جو جواہر (جوہر) میں ہوتی ہے۔ اور کوئی موجود ایسا نہیں مگر اس میں اس کی ایک خاص نسبت ہوتی ہے، اگرچہ وہ نسبت ہو۔\nقال رسول الله صلى الله عليه وسلم ينزل ربنا إلى السماء الدنيا في الثلث الباقي من الليل‏\n(رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"ہمارا رب رات کے آخری تہائی حصے میں آسمان دنیا کی طرف نزول فرماتا ہے۔\")\nاور وہ سبحانہ اپنے عرش پر اس معنی کے ساتھ مستوی (مستو) ہے جو اس نے ارادہ فرمایا، اور وہ سبحانہ مَعَكُمْ أَيْنَ ما كُنْتُمْ (تمہارے ساتھ ہے جہاں کہیں بھی تم ہو) جیسا کہ اس کی شان کے لائق ہے، اور وہ ہماری شَہْرَگ (حَبْلِ الْوَرِيدِ) سے بھی زیادہ قریب ہے، اور وہ تعالیٰ عماء (بادل) میں ہے، نہ اس کے اوپر ہوا ہے اور نہ اس کے نیچے ہوا ہے۔ یہ سب کچھ آپ کو اس بات کی طرف رہنمائی کرتا ہے کہ نقل و حرکت (الانتقالات) سے کیا مراد ہے۔ پس یہ کسی صفت کے حکم کا دوسری صفت پر ظہور ہو سکتا ہے، اور یہ ایک حال سے دوسرے حال کی طرف منتقل ہونا ہو سکتا ہے، اور یہ ایک حیز (جگہ) سے دوسرے حیز کی طرف ہو سکتا ہے، اور یہ ایک مکان سے دوسرے مکان کی طرف ہو سکتا ہے، اور یہ ایک منزل سے دوسری منزل کی طرف ہو سکتا ہے۔ پس میں نے آپ کو بتا دیا کہ انتقال تمام موجودات میں جاری و ساری ہے، ان کی ذوات کے استحقاق کے مطابق، پس نسب کی کیفیات مختلف ہوتی ہیں، اور یہ سب حرکت کے حکم کی طرف لوٹتا ہے۔ اور اسی باب سے اللہ تعالیٰ کا یہ فرمان ہے: سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ (عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھ والو [جن و انس])، اور اس کا فرمان: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (وہ ہر دن ایک نئی شان میں ہوتا ہے)۔\nپھر اس بات کو طے کرنے کے بعد آپ کو معلوم ہونا چاہیے کہ متحرک اشیاء میں حرکت دو قسم کی ہوتی ہے: ایک طبعی (طبیعیۃ) ہے، جیسے نامیات (بڑھنے والی اشیاء) میں نمو، اور دوسری عرضی (عرضیۃ) ہے۔ اور عرضی حرکت اختیاری (اختیاریۃ) اور غیر اختیاری ہوتی ہے۔ اختیاری حرکت صرف حیوان میں پائی جاتی ہے، اور غیر اختیاری حیوان اور غیر حیوان دونوں میں ہوتی ہے۔ اور ایک قسری (قسریۃ) حرکت ہے، جو غیر متحرک کی طرف سے واقع ہوتی ہے، خواہ اس کی طبیعت اس کا تقاضا کرے یا نہ کرے۔ پس جمادات (الجماد) اور نباتات میں قسری حرکت ان کی طبیعت کا تقاضا نہیں ہوتی۔ اور غیر جمادات میں یہ ان کے اختیار کے خلاف ہوتی ہے۔ اور محرک (حرکت دینے والا) متحرک کی جنس سے ہو بھی سکتا ہے اور نہیں بھی ہو سکتا۔ اور قسری حرکت کسی قسری حرکت سے بھی ہو سکتی ہے اور قسری حرکت کے بغیر بھی ہو سکتی ہے۔ پہلی کی مثال ہواؤں کا شاخوں کو حرکت دینا ہے، اور دوسری کی مثال انسان کا پتھر کو ہوا میں اوپر پھینکنا ہے۔ اور اس مسئلے میں کلام دقیق اور پوشیدہ ہے، کیونکہ یہ ایک عظیم قدر کا مسئلہ ہے اور عقول کی رسائی سے باہر ہے۔ اور اس کا تعلق باب تولد (پیدائش) سے ہے، جیسے انگلی کی حرکت سے انگوٹھی کی حرکت اور ہاتھ کی حرکت سے آستین کی حرکت۔ اور حرکت کو ایک عظیم غلبہ (سلطان) حاصل ہے، اس کا حکم اجسام اور ان کے لوازم میں مشہود ہے، اور معانی میں معقول ہے، اور جس کی حد معلوم نہیں ہے۔ پس اس کا موجودات میں مکمل طور پر سرایت (السریان الأتم) ہے۔ اور اللہ کے سوا ہر چیز میں اس کا پہلا حکم اعیان (حقائق) کا ظاہر ہونا اور ان کا حالت عدم سے حالت وجود کی طرف منتقل ہونا ہے۔ اور کسی موجود کے لیے اصلاً استقرار (ٹھہراؤ) صحیح نہیں ہے، کیونکہ استقرار سکون ہے، اور سکون حرکت کا عدم ہے۔ پس سمجھو۔ اور اس بات کے طے ہو جانے کے بعد، اس مقام میں جو حرکت ہے، اس کا معاملہ لوگوں پر مشتبہ ہو گیا ہے، پس وہ نہیں جان پائے کہ آیا یہ طبعی ہے یا قسری، یا طبعی قسری، یا طبعی غیر قسری، یا قسری غیر طبعی۔ اور یہ اختلاف صرف ان لوگوں نے تصور کیا جنہوں نے اس مقام کا مشاہدہ نہیں کیا اور نہ اس میں داخل ہوئے۔ اور ہمارے نزدیک یہ ایک طبعی اختیاری حرکت ہے، جو ایک امر الٰہی کے ذریعے اسرار کو ظاہر کرنے کے لیے ہے۔ اور انہوں نے اس حرکت کے موجب سبب میں اختلاف کیا ہے کہ آیا اس کا سبب حمّیات (بخارات) ہیں، یا اس کا سبب عالم انفاس (عالم الأنفاس) ہے، یا اس کا کوئی سبب نہیں سوائے امر الٰہی کے۔\n\n### [ہوا کا درختوں کو حرکت دینا]\n\nجان لیجیے کہ اس معاملے میں حقیقت یہ ہے کہ امر الٰہی (الأمر الإلهي) عالم انفاس (عالم الأنفاس) میں موجود ہوتا ہے، پھر وہ اس کائنات کی طرف متوجہ ہوتا ہے اور اسے حرکت دیتا ہے، اور وہ کائنات اپنی طبیعت کے مطابق حرکت کو قبول کرتی ہے، جیسے ہوا کا درختوں کی طرف متوجہ ہونا تاکہ وہ اپنے جھونکے سے انہیں حرکت دے۔ پس مشاہدہ کرنے والا شاخوں کی حرکت کو ہوا کے چلنے کی وجہ سے دیکھتا ہے، اور علم یہ دیکھتا ہے کہ اگر شاخوں نے اپنی جگہوں کو خالی نہ کیا ہوتا تو ہوا کو چلنے کی جگہ نہ ملتی۔ پس ایک لحاظ سے ہوا کا ان پر حکم ہے اور ایک لحاظ سے ان پر حکم نہیں ہے۔ اور ہوا کا درختوں کو حرکت دینے کا مقصد ان سے فاسد بخارات کو دور کرنا تھا، تاکہ وہ ان میں ایسی چیزیں جمع نہ کر دیں جو دنیا میں بیماریوں اور امراض کا سبب بنیں، جب وہ درخت ان سے غذا حاصل کریں، پھر حیوان انہیں کھائے، یا وہ خود اس غذا سے خراب ہو جائیں۔ پس ہواؤں کا چلنا دنیا کی مصلحتوں کے لیے تھا، جہاں وہ وبائی اثرات کو دور کرتی ہیں اور ماحول کو صاف کرتی ہیں، تاکہ زندگی خوشگوار ہو۔ پس ہوا ایک مقصود سبب ہے جو اپنے مسبب (نتیجے) میں مؤثر نہیں ہے، بلکہ اس میں اثر ڈالنے والا اسباب کو قائم کرنے والا اور انہیں اپنے اور مخلوق کے درمیان حجاب بنانے والا ہے، تاکہ اللہ کی معرفت میں مخلوقات کے درمیان فضیلت واضح ہو جائے، اور شرک کرنے والا توحید پرست سے ممتاز ہو جائے۔ پس مشرک مطلقاً جاہل ہے، کیونکہ اس طرح کے معاملے میں شرکت کسی بھی صورت میں صحیح نہیں ہے۔ کیونکہ فعل کا ایجاد شرکت سے نہیں ہو سکتا۔ اسی لیے معتزلہ مشرکین میں شامل نہیں ہوئے، کیونکہ انہوں نے بندوں کے افعال کو بندوں کے لیے موحد (ایک) قرار دیا، پس انہوں نے انہیں شریک نہیں بنایا، بلکہ انہوں نے عقلی طور پر فعل کو ان کی طرف منسوب کیا، اور شریعت نے اس میں ان کی تصدیق کی۔ اور اشاعرہ نے تمام ممکنات کے فعل کو بغیر کسی عقلی تقسیم کے اللہ کے لیے موحد قرار دیا، اور شریعت نے بھی اس پر ان کی مدد کی، لیکن اس خطاب کے بعض محتمل پہلوؤں کے ساتھ۔ پس اس میں معتزلہ کی دلیلیں ظاہری طور پر زیادہ قوی تھیں، اور جو کچھ اشاعرہ نے اختیار کیا وہ اہل کشف (الکشف) میں سے اہل اللہ کے نزدیک زیادہ قوی ہے۔ اور دونوں گروہ توحید والے ہیں۔ اور ہم نے مشرک کو جاہل اس لیے قرار دیا کہ موجود صرف ایک ایجاد سے ہی متصف ہو سکتا ہے، اور قدرت کا اعیان میں صرف ایجاد ہی اثر ہے، لہٰذا موجود دو وجودوں سے موجود نہیں ہو سکتا۔ پس یہ صحیح نہیں کہ وجود دو قدرتوں کے تعلق سے ہو۔ کیونکہ ان میں سے ہر ایک موجود کو وجود عطا کرتی ہے، پس جب ان میں سے ایک نے اسے وجود عطا کر دیا، تو دوسری کا اس میں کوئی اثر نہیں رہا۔ لہٰذا اگر آپ تحقیق کریں تو فعل میں شرکت باطل ہو جاتی ہے۔ اسی لیے یہ عقائد میں غیر مؤثر ہے۔ اور وہ مشرک جو خسارے میں ہے اور جس کی مذمت مشروع ہے، وہ ہے جس نے وہ چیز جو الٰہ کا حق ہے، غیر اللہ کی طرف منسوب کی، پس اس کی عبادت کی یہ سمجھتے ہوئے کہ وہ الٰہ ہے، گویا اس نے اسے مرتبے میں شریک بنا دیا، جیسے دو بادشاہوں کا سلطنت کے معنی میں شریک ہونا، اگرچہ ان میں سے ایک دوسرے کی بادشاہت میں حکم نہیں چلاتا، لیکن ان میں سے ہر ایک حقیقت میں سلطان ہے۔\nاور جب آپ نے حرکت سے متعلق علم کو اس حد تک جان لیا جس کی تعریف کا وقت نے موقع دیا، تو اب ہم اس مقام سے یہ واضح کرتے ہیں کہ یہ خاص حرکت کیوں پائی گئی؟ جان لیجیے کہ یہ اس لیے پائی گئی تاکہ ان خبروں کو ظاہر کیا جائے جو غیب (الغیب) میں پوشیدہ تھیں اور جن کا وجود مخلوق پر بھاری تھا، جیسا کہ اللہ تعالیٰ نے فرمایا: إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا (بے شک ہم عنقریب آپ پر ایک بھاری کلام نازل کریں گے)۔ اور قیامت کے بارے میں فرمایا: ثَقُلَتْ في السَّماواتِ والْأَرْضِ (وہ آسمانوں اور زمین پر بھاری ہو گئی)۔ اور یہ اس لیے ہوتا ہے کہ جب غیب پر کوئی امر بھاری ہو جاتا ہے اور وہ اس کے لیے تنگ پڑ جاتا ہے اور اس میں سما نہیں پاتا، تو وہ عالم شہادت (عالم الشہادۃ) پر آرام کرتا ہے، پس غیب اس حاملہ کی طرح سانس لیتا ہے جس پر بوجھ ہو، اور عالم شہادت میں وہ چیز ظاہر کر دیتا ہے جس کا بوجھ اس پر بھاری تھا، اور یہ معنی میں ایسا ہی ہے جیسے انسان پر اپنے راز کو چھپانا اور اپنے غم کا بوجھ اٹھانا بھاری ہو جائے، جب اسے اپنے بھائیوں میں کوئی ایسا نہ ملے جس پر وہ آرام کر سکے۔ پھر جب اسے کوئی ایسا بھائی مل جاتا ہے جس پر وہ اپنا غم ظاہر کرتا ہے جو اس پر بھاری تھا، تو اسے اس کے اظہار میں راحت ملتی ہے، کیونکہ اس کے ساتھی نے اس میں اس کا حصہ لے لیا، پس وہ اس پر ہلکا ہو جاتا ہے۔ اور اگر وہ غم اس بھائی کی قدرت میں ہو جس پر وہ اسے ظاہر کر رہا ہے، اور وہ اس کی حاجت پوری کر دے، تو وہ اس بوجھ کو مکمل طور پر ختم کر دیتا ہے۔ پس یہ وہی بوجھ ہے جو غیب میں ہوتا ہے اور وہ شہادت پر آرام کرتا ہے۔ اور اس کا سبب یہ ہے کہ وہ چیز اس کی ملکیت نہیں ہوتی، بلکہ وہ شہادت کے لیے اس کے پاس امانت (الأمانۃ) ہوتی ہے۔ اور جب اس امر کا مطلوب شہادت ہو، تو وہ غیب کے پاس امانت ہوتی ہے، پس غیب اس کی حفاظت اور وقت پر شہادت کو ادا کرنے کا مکلف ہوتا ہے، لہٰذا بالضرورۃ وہ اس پر بھاری ہو جاتی ہے۔ کیا آپ اللہ تعالیٰ کا یہ فرمان نہیں دیکھتے: إِنَّا عَرَضْنَا الْأَمانَةَ عَلَى السَّماواتِ والْأَرْضِ والْجِبالِ فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها وحَمَلَهَا الْإِنْسانُ إِنَّهُ كانَ ظَلُوماً (بے شک ہم نے امانت کو آسمانوں، زمین اور پہاڑوں پر پیش کیا، تو انہوں نے اسے اٹھانے سے انکار کر دیا اور اس سے ڈر گئے، اور انسان نے اسے اٹھا لیا، بے شک وہ اپنی جان پر ظلم کرنے والا)۔ یعنی اپنی جان پر ظلم کرنے والا، جَهُولًا (نادان) یعنی اس کی قدر سے نادان۔ پس وہ معنی میں بھاری تھی، اگرچہ اٹھانے میں ہلکی تھی۔\n\n### [بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا]\n\nجان لیجیے کہ انسان آسمانوں، زمین اور پہاڑوں سے زیادہ علم رکھتا تھا، اور حقیقت میں وہ زیادہ علم والا نہیں تھا، بلکہ چونکہ انسان صورت الٰہیہ (الصورة الإلهیۃ) پر پیدا کیا گیا تھا اور اسے وہ جامعیت عطا کی گئی تھی جو ہم نے ذکر کی، اس لیے اس نے اپنی ذات اور اللہ کی عطا کردہ قوت پر فخر کیا، پس اس کے لیے اسے اٹھانا آسان ہو گیا۔ پھر اس نے دیکھا کہ ذات حق (الحق) نے اسے خلافت کے لیے اہل قرار دیا ہے بغیر اس کے کہ اس مقام کو اس پر پیش کیا جائے، پس اسے یقین ہو گیا کہ اہلیت اس میں موجود ہے۔ اور آسمان تنہا، نہ زمین تنہا، اور نہ پہاڑ تنہا انسان کی جامع قوت پر قادر نہ ہو سکے، اسی لیے فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها (انہوں نے اسے اٹھانے سے انکار کر دیا اور اس سے ڈر گئے)۔ اور انسان کو معلوم نہ تھا کہ اسے اٹھانے میں اس پر کیا عوارض (عارض) لاحق ہوں گے، پس اسی عارض کی وجہ سے اسے خائن (خائن) کہا گیا، کیونکہ وہ لالچ اور سستی پر جبلت کیا گیا ہے، اور اس نے اسے صرف اس لیے قبول کیا کہ وہ جلد باز ہے۔ اگر ذات حق (الحق) اسے وقت دیتا تاکہ وہ اپنے نفس میں غور کرتا اور اپنی ذات اور اپنے عوارض کو دیکھتا، تو اس پر وہ قدر واضح ہو جاتی جو اس پر پیش کی گئی تھی، تو وہ بھی اس سے انکار کر دیتا جیسا کہ آسمان اور دیگر نے انکار کیا جن پر وہ پیش کی گئی تھی۔ اور ہم نے حسن بصری سے روایت کیا ہے کہ ایک شخص سفر سے آیا اور حسن بصری کے گھر کا قصد کیا۔ جب حسن ان کے پاس باہر آئے تو اس نے کہا: میں فلاں شہر سے آیا ہوں اور آپ کے دوست فلاں نے مجھے آپ کا سلام پہنچانے کا کہا ہے۔ حسن نے پوچھا: تم کب آئے؟ اس نے کہا: ابھی۔ پوچھا: کیا تم میرے پاس آنے سے پہلے اپنے گھر گئے تھے؟ اس نے کہا: نہیں۔ میں اسی حالت میں آپ کے پاس آیا ہوں تاکہ آپ کی امانت ادا کروں۔ حسن نے کہا: اے شخص! اگر تم میرے پاس آنے سے پہلے اپنے گھر چلے جاتے اور مر جاتے تو خائن مرتے۔ پس عاقل وہ ہے جو وعدہ نہ کرے اور نہ امانت اٹھائے۔ اور امانت کا حکم صرف اس کے لیے ہے جس تک وہ پہنچائی جائے، نہ کہ اس کے لیے جو آپ کو وہ اٹھوائے۔ اللہ تعالیٰ فرماتا ہے: إِنَّ الله يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى‏ أَهْلِها (بے شک اللہ تمہیں حکم دیتا ہے کہ تم امانتیں ان کے اہل کو ادا کرو)۔ اور اس میں کوئی شک نہیں کہ ہر چیز کی طبیعت میں بے چینی ہوتی ہے اس چیز سے جو اس پر بھاری ہو، یہاں تک کہ وہ اسے اپنے سے نکال دے، کیونکہ جو چیز اس پر بھاری ہے وہ اس کی نہیں ہے۔ اور جب وہ امر اس کا ہو جاتا ہے تو وہ بوجھ ختم ہو جاتا ہے اور وہ اس پر خوش ہوتا ہے، کیونکہ وہ اس کی ملکیت بن گیا اور اس پر اس کی سیادت (سرداری) ظاہر ہو گئی۔ کیا آپ نہیں دیکھتے کہ جب کسی انسان کے پاس مال امانت رکھا جاتا ہے تو وہ اس کا بوجھ کیسے محسوس کرتا ہے اور اس کی حفاظت اور دیکھ بھال کی تکلیف اٹھاتا ہے؟ پھر جب مال کا مالک اسے کہتا ہے کہ میں نے یہ تمہیں ہبہ کر دیا ہے اور اسے اپنی ملکیت سے نکال دیا ہے، تو وہ مال کا بوجھ اس کے نزدیک کیسے ہلکا ہو جاتا ہے اور وہ اس پر بہت زیادہ خوش ہوتا ہے، اور اس ہبہ کرنے والے کی قدر اس کے دل میں بڑھ جاتی ہے۔ اسی طرح بندے کے نزدیک ذات حق (الحق) کی صفات امانت ہیں، اور عارف کے نزدیک ان کا امانت ہونا اس پر ہمیشہ بھاری رہتا ہے، اس نگرانی کی وجہ سے کہ وہ ان میں کیسے تصرف کرے اور کہاں صرف کرے، اور وہ ڈرتا ہے کہ کہیں وہ مالکان کی طرح تصرف نہ کر بیٹھے۔ پس جب یہ اس پر بھاری ہوتا ہے تو وہ اسے اس کے مالک کو لوٹا دیتا ہے اور اپنی بندگی (عبودیۃ) کے ساتھ لذت پاتا ہوا ہلکا پھلکا رہتا ہے۔\nجو اس کی ملکیت ہے، بلکہ وہ اس کی حقیقت ہے، کیونکہ اس پر زائد چیز اس سے زائل ہو چکی ہے، اور اسے اپنی امانت کو صحیح سلامت ادا کرنے پر ثنائے الٰہی حاصل ہو گئی ہے۔ پس وہ کامیاب ہوا جس نے اپنی حد سے تجاوز نہیں کیا، جیسا کہ کہاوت ہے: \"وہ شخص ہلاک نہیں ہوا جس نے اپنی قدر پہچانی۔\" اور اسی مقام سے استفہام (الاستفہام) کا تعلق معلوم ہوتا ہے کہ وہ کہاں تھا۔ اور وہ یہ ہے کہ استفہام یا تو نفس الامر میں علم کے نہ ہونے کے ساتھ ہوتا ہے، یا علم کے نہ ہونے کے اظہار کے ساتھ ہوتا ہے تاکہ مستفہم (سوال کرنے والا) اس شخص کو جس سے وہ سوال کر رہا ہے، اس بات پر برقرار رکھے جس کے بارے میں وہ سوال کر رہا ہے، جبکہ سوال کرنے والے کو اس کا علم ہو۔ پس سوال کرنے والا کہتا ہے: تمہارے پاس کیا ہے؟ اور تم نے فلاں کو کیوں مارا؟ پس امور کے بارے میں استفہام کا سبب علم کا نہ ہونا ہے۔ اور استفہام کا محرک سوال کرنے والے کے اختلاف سے مختلف ہوتا ہے۔ پس اگر وہ اس چیز کا عالم ہو جس کے بارے میں وہ سوال کر رہا ہے، تو اس کا مقصد دوسرے کو آگاہ کرنا ہوتا ہے، جہاں انہوں نے گمان کیا اور کہا جو حقیقت کے خلاف ہے۔ جیسے اللہ تعالیٰ کا حضرت عیسیٰ علیہ السلام سے یہ فرمان: أَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وأُمِّي إِلهَيْنِ من دُونِ الله (کیا تم نے لوگوں سے کہا تھا کہ مجھے اور میری ماں کو اللہ کے سوا دو معبود بنا لو؟)، ان لوگوں کی موجودگی میں جنہوں نے ان کی عبادت کی تھی یعنی نصاریٰ میں سے۔ پس عیسیٰ علیہ السلام نے ان کی موجودگی میں اس نسبت سے براءت کا اظہار کیا، اور کہا: سُبْحانَكَ ما يَكُونُ لِي أَنْ أَقُولَ ما لَيْسَ لِي بِحَقٍّ (تو پاک ہے، میرے لیے یہ مناسب نہیں کہ میں وہ بات کہوں جو میرا حق نہیں)۔ پس مقصود ان لوگوں کی سرزنش کرنا تھا جنہوں نے ان کی امت میں سے ان کی عبادت کی اور انہیں الٰہ بنا لیا۔ پس یہ صورت استفہام کی صورت میں واقع ہوئی، حالانکہ حقیقت میں یہ سرزنش ہے۔ اور عربی گرامر کی صنعت میں جب اس طرح کے جملے کا اعراب کیا جاتا ہے تو وہ اسے ہمزہ تقریر (تصدیق) اور انکار کا اعراب دیتے ہیں، نہ کہ استفہام کا، اگرچہ وہ اسے ہمزہ استفہام کہیں اور مراد انکار ہو۔ پس اس طرح کے اعراب میں ان کے دو طریقے ہیں۔ لہٰذا بندے کو ایسی صفت کے ساتھ ظاہر نہیں ہونا چاہیے جو اسے اس بات کی طرف لے جائے کہ اس کا رب اس کے بارے میں سوال کرے، کیونکہ استفہام کی بو سوال کرنے والے میں نفی علم کا تاثر دیتی ہے، اور وہ جناب (ذات حق) اس سے پاک اور منزہ ہے۔ پس اس مقام سے بچو، اور اس طرح کی چیز سے صرف اسی صورت میں بچا جا سکتا ہے جب تمہاری عبودیت (عبودیۃ) ہر حال میں تم پر حاکم ہو اور تم میں ظاہر ہو۔ پس اگر ذات حق (الحق) تم سے کسی چیز کے بارے میں سوال کرے، تو یہ اس کی طرف سے ابتداء ہو گی، جس میں تمہارا کوئی سبب نہیں ہو گا، اور وہ سبحانہ پر کوئی چیز حکم نہیں چلاتی۔ کیونکہ اگر وہ چاہے تو سوال کرے اور اگر چاہے تو سوال نہ کرے، اس کے ساتھ یہ ضروری ہے کہ جس چیز کے بارے میں سوال کیا جا رہا ہے اس میں علم کی نسبت اللہ تعالیٰ کی طرف ہو۔ اور استفہام کے لیے ادوات (آلات) ہیں جیسے *ما*، *أي*، اور ہمزہ۔ اور اس مقام کو ادوات میں سے صرف *ما* کی خصوصیت حاصل ہے، *من* اور دیگر ادوات کے بغیر۔ اور استفہام کے دیگر ادوات کا اس مقام میں داخلہ نہیں ہے۔ اور میں نے اب تک اس مقام کے لیے *ما* کے اختصاص کی وجہ نہیں پائی، جبکہ حکم میں یہ ان پر داخل ہونے میں *من* اور ہمزہ کے حکم میں ہے، کیونکہ یہ اسماء، افعال اور حروف پر داخل ہوتی ہے، اور مراتب صرف یہی تین ہیں۔ پس یہ عام ہو گئی، لہٰذا اس مقام کو استفہام کی عمومیت حاصل ہوئی۔ اور اس حالت میں اس مقام میں صرف *ما* کا آلہ ہی ظاہر ہونا صحیح ہے، کیونکہ اس کے معانی اس کا تقاضا کرتے ہیں۔ اور اشارے سے بھی استفہام کیا جاتا ہے۔\nاور اسی مقام میں سے اسرار (الأسرار) اور پوشیدہ غیوب (خفي الغيوب) کا افشاء (ظاہر کرنا) ہے، جب مواطن (المواطن) ان کا تقاضا کریں۔ پس انسان اس مقام سے ان مواطن کو جانتا ہے جن میں اسے اپنے پاس موجود غیوب میں سے ظاہر کرنا چاہیے، اور وہ جانتا ہے کہ دنیا کا موطن اس کا تقاضا نہیں کرتا۔ اسی لیے ملامتیہ (الملامیۃ) سے اس میں سے کچھ ظاہر نہیں ہوا۔ اور یہاں غیوب سے میری مراد ہر وہ غیب ہے جس کا موطن تقاضا نہ کرے۔ اور وہ غیوب جن کا ہر موطن تقاضا کرتا ہے، تو ہر موطن کے غیب کا اپنے موطن میں شہادت کی طرف نکلنا ضروری ہے۔ اور ملامتیہ کا یہی حال ہے، مگر یہ کہ اس کے ظاہر کرنے کے ساتھ کوئی امر الٰہی شامل ہو جائے۔ اور اس کے ساتھ کوئی امر شامل نہیں ہوتا مگر یہ کہ کوئی حال اس کا تقاضا کرے۔ اور بغیر کسی حال کے تقاضے کے ایسا نہیں ہوتا۔ اسی لیے لوگ اللہ تعالیٰ کے نزدیک اہل اللہ کے مراتب سے جاہل رہے۔ اور اسی وجہ سے انہیں امین (امناء) کہا گیا۔ پس جب موطن اپنے غیب کو ظاہر کرنے کا تقاضا کرے، تو عارف سب سے پہلے اس کی طرف لپکتا ہے اور اس میں جلدی کرتا ہے، اور اگر وہ ایسا نہ کرے تو وہ دھوکہ باز (غاش) اور خائن ہو گا، جو کسی چیز کے لائق نہیں۔ پھر اگر اس کے ظاہر کرنے میں کوئی دوسرا اس سے سبقت لے جائے، تو اس وقت اس پر اسے چھپانا متعین ہو جاتا ہے، اور یہ کہ وہ اس میں موجود چیز پر کسی مخلوق کو مطلع نہ کرے، کیونکہ اس میں دوسرے نے اس کی جگہ لے لی ہے۔ پس اس عارف کے لیے اسے ظاہر کرنے میں نفس کا حصہ باقی رہ جاتا ہے، اور یہ خصائص حق اور اہل حق کی شان نہیں ہے۔ ہاں، اگر اس کے پاس اللہ کی طرف سے اس بارے میں وحی آئے، باوجود اس کے کہ وہ کسی دوسرے کے ہاتھ پر ظاہر ہو چکا ہو، تو اسے چاہیے کہ وہ اللہ کے حکم کی تعمیل میں جلدی کرے اور اسے ظاہر کرے، اور وہ اس میں پہلے والے کے لیے مؤید (تائید کرنے والا) ہو گا۔\nاور جان لیجیے کہ مخلوقات کی کوئی جنس ایسی نہیں مگر اس کی طرف وحی (الوحي) کی گئی ہے، خواہ وہ فرشتہ ہو، جن ہو، انسان ہو، حیوان ہو، نباتات ہو، یا جمادات (الجماد)۔ پس حیوان میں سے شہد کی مکھی کا ذکر کیا، اور جمادات میں سے آسمان اور زمین کا، اگرچہ ہمارے نزدیک سب زندہ ہیں، لیکن ہم غالب حس میں معروف اور متعارف چیز پر چلتے ہیں۔ اور اللہ تعالیٰ نے فرمایا: وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ (اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ اور فرمایا: وإِنْ من أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ (اور کوئی امت ایسی نہیں مگر اس میں کوئی ڈرانے والا گزر چکا)۔ اور فرمایا: ولَوْ جَعَلْناهُ مَلَكاً لَجَعَلْناهُ رَجُلًا (اور اگر ہم اسے فرشتہ بناتے تو ہم اسے مرد کی صورت میں بناتے)۔ اور فرمایا: لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا (اگر زمین میں فرشتے ہوتے جو اطمینان سے چلتے پھرتے، تو ہم ان پر آسمان سے کسی فرشتے کو رسول بنا کر نازل کرتے)۔ اور فرمایا: وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ (اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان میں)۔ یعنی ان کے لہجے میں۔\n\n### [وحی مختلف اقسام پر ہے]\n\nاور وحی کئی طرح کی ہوتی ہے اور یہ مقام اس پر مشتمل ہے۔ پس اس میں سے وہ ہے جو خیال (الخیال) کے ذریعے حاصل ہوتی ہے، جیسے عالم خیال میں مبشرات (خوشخبریاں)، اور یہ نیند میں وحی ہے۔ پس حاصل کرنے والا خیال ہے اور نازل ہونے والا بھی وہی ہے اور وحی بھی وہی ہے۔ اور اس میں سے وہ ہے جو صاحب حس کے لیے حس میں خیال کی صورت میں ہوتی ہے۔ اور اس میں سے وہ ہے جو ایک معنی ہوتا ہے جسے موحیٰ الیہ (جس کی طرف وحی کی گئی) اپنے نفس میں پاتا ہے، بغیر کسی حس یا خیال کے اس سے متعلق ہونے کے جس کے ذریعے وہ نازل ہوئی۔ اور یہ کتابت کی صورت میں بھی ہو سکتی ہے، اور یہ اولیاء کے لیے کثرت سے واقع ہوتی ہے۔ اور اسی طرح ابو عبد اللہ قضیب البان اور ابو زکریا البجائی کو معرہ میں دیر النقرة میں وحی ہوتی تھی، اور احمد بن حنبل کے شاگرد صاحب المسند تقی بن مخلد کو بھی، لیکن وہ ان سب میں کمزور تھے، چنانچہ وہ اسے صرف نیند سے بیدار ہونے کے بعد ایک کاغذ پر لکھا ہوا پاتے تھے۔ اور اس مقام میں شامل چیزوں میں سے اعراض (عارضی صفات) کو قائم، متحیز (جگہ گھیرنے والی) صورتوں میں آنکھوں کے سامنے پیدا کرنا ہے۔\n\n### [بے شک اللہ جب کسی انسان کی طرف متوجہ ہوتا ہے تو اسے ایسی جامعیت (جمعیۃ) عطا کرتا ہے جس میں کوئی تفرقہ (تفرقۃ) نہیں ہوتا]\n\nجان لیجیے کہ جب انسان اللہ کے پاس آتا ہے، تو اللہ اسے ایسی جامعیت (جمعیۃ) کے ساتھ جمع کر دیتا ہے جس میں کوئی تفرقہ (تفرقۃ) نہیں ہوتا، یہاں تک کہ اللہ تعالیٰ اسے وہ سب کچھ عطا کر دیتا ہے جو وہ اپنے علم میں پہلے سے طے کر چکا ہے۔ پھر جب وہ اس مشہد اور اس حالت سے باہر نکلتا ہے، تو وہ اس چیز کے ساتھ نکلتا ہے جو اسے حاصل ہوئی تھی، اور اسے ایک کلی اور مجمل امر حاصل ہوا تھا جو مفصل نہیں تھا۔ پس باہر نکلنے پر اسے ہر جزو کے لیے اعیان (حقائق) کی مفصل صورتیں ظاہر ہوتی ہیں جن کی اپنی خاص صورت ہوتی ہے۔ پس وہ اپنی جامعیت کی حالت سے اپنی تفرقہ (تفرقۃ) کی حالت کی طرف نکلتا ہے۔ پس اعمال کی صورتیں یکبارگی اس کی طرف لپکتی ہیں، اور ان میں سے ہر صورت اس سے متعلق ہو جاتی ہے جو اس کے وجود میں اصل تھا، خواہ وہ اس کے حق میں ہو یا اس کے خلاف۔ پس اس کی آنکھ سے اس کے دیکھنے کی صورتیں متعلق ہوتی ہیں، اور اس کے کان سے اس کے سننے کی صورتیں متعلق ہوتی ہیں، اور اسی طرح اس کے ظاہر کے باقی حواس بھی۔ اور اس کے باطن سے اس کے باطنی اعمال کی صورتیں متعلق ہوتی ہیں، جیسے اس کی فکر (فکر) اور خیال (خیال) کے اعمال اور اس کی تمام باطنی قوتیں۔ پس اگر عملی صورتیں خوشی کا تقاضا کریں تو وہ اس سے خوش ہوتا ہے، اور اس کے برعکس۔ اور اگر اعمال کی صورتیں غم اور دکھ کا تقاضا کریں، تو انسان اس صورت کے تقاضے کے مطابق ہوتا ہے۔ پس اگر کسی صورت میں یہ بھی ہو اور وہ بھی ہو، تو اس جزو کی خوشی جس کے لیے خوشی کا عمل ہے، اس کی حیثیت سے خوشی ہو گی، نہ کہ مکلف نفس کی حیثیت سے۔ پس وہ انسانی جزو اس قدر نعمت حاصل کرتا ہے، اور دوسرا جزو اپنے عمل کی صورت کی وجہ سے غمگین ہوتا ہے۔ اور نفس اس حالت میں اس کی خوشی کی وجہ سے تبعاً خوش ہوتا ہے اور اس کے غم کی وجہ سے تبعاً غمگین ہوتا ہے، ایک ہی حالت میں دو مختلف رخوں سے، جیسا کہ وہ دیکھنے کی حالت میں، پکڑنے کی حالت میں، چلنے کی حالت میں، چھونے کی حالت میں، سونگھنے کی حالت میں، چکھنے کی حالت میں سنتا تھا، اور مدرک (ادراک کرنے والے) کی احدیت کے باوجود ایک چیز اسے باقی چیزوں سے مشغول نہیں کرتی۔ اسی طرح وہ ایک راستے سے نعمت پاتا ہے اور دوسرے راستے سے غمگین ہوتا ہے۔ پس وہ خوش ہونے والا غمگین ہے، اور وہ نفع پانے والا خسارہ اٹھانے والا ہے، یہاں تک کہ وہ جنت میں داخل ہو جائے۔ اور یہ عجیب ترین مشاہدات میں سے ہے، اور اس دنیا میں اہل طریق میں سے اسے پانے والے کم ہیں، ان کے کشف (الکشف) اور تحقق کی کمی اور اس بارے میں ان کے علم کی قلت کی وجہ سے۔ اور وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و هشتاد و پنجم در معرفت منزل مناجات جماد (مناجاة الجماد) و کسی که در آن وارد شود، نیمی از حضرت محمدیه (الحضرة المحمدية) و موسویه (الحضرة الموسوية) را کسب می‌کند.\n\nعناصر با من مناجات می‌کنند و آشکار می‌سازند *** آنچه را که در خود از علم غریب دارند.\nپس در آن هنگام، سبقت گرفتن جسمم را *** بر نفسم و عقلم به زودی بدان.\nای قوم من، علوم کشف (الکشف) برتری می‌یابند *** به آنچه می‌دهند، بر علم قلوب.\nزیرا عقل را مجالی نیست *** در میدان مشاهدات و غیوب.\nچه بسیار است خطای فکر و ناتوانی‌اش *** و چه بسیار است نظر صواب چشم.\nو اگر چشم نبود، برای عقل *** دلیلی واضح نزد خردمند آشکار نمی‌شد.\n\nاما سخن ما که «چه بسیار است نظر صواب چشم»، آن را تنها به جهت صنعت شعری آوردیم، به دلیل آنچه پیش از آن در صدر بیت گفتیم. در واقع، مذهب صحیح این است که چشم هرگز خطا نمی‌کند، نه چشم و نه هیچ یک از حواس، زیرا ادراک حواس نسبت به اشیاء، ادراکی ذاتی است و علل ظاهری عارضی در ذاتیات تأثیر نمی‌گذارند.\n\n[ادراک عقل بر دو قسم است: ادراک ذاتی و ادراک غیر ذاتی]\n\nو ادراک عقل بر دو قسم است: ادراک ذاتی که در آن مانند حواس است و خطا نمی‌کند، و ادراک غیر ذاتی که آن را به واسطه ابزاری که همان فکر است و ابزاری که همان حس است، درک می‌کند. خیال، حس را در آنچه به او می‌دهد تقلید می‌کند و فکر در خیال می‌نگرد و امور را به صورت مفردات می‌یابد، سپس دوست دارد از آن‌ها صورتی بسازد که عقل آن را حفظ کند و برخی از مفردات را به برخی دیگر نسبت دهد. در این نسبت دادن ممکن است در مورد امر آن‌گونه که هست خطا کند یا صواب گوید. پس عقل بر اساس آن حد حکم می‌کند و خطا و صواب می‌کند. بنابراین عقل مقلّد است و به همین دلیل به خطا متصف شده است. هنگامی که صوفیه (الصوفية) خطای اهل نظر را دیدند، به روشی روی آوردند که در آن ابهامی نیست تا اشیاء را از عین یقین (عين اليقين) دریافت کنند و به علم یقینی (العلم اليقيني) متصف شوند. زیرا جاهل ممکن است در آنچه جاهل است به علم متصف شود، اما به یقین متصف نمی‌شود. به همین دلیل جایز است که علم به یقین اضافه شود، و این از باب اضافه شیء به خودش نیست، نه از نظر لفظ و نه از نظر معنا. اما از نظر لفظ، کلمه یقین عین کلمه علم نیست، پس اضافه جایز است. و از طریق معنا، یقین عبارت است از استقرار علم در نفس، و استقرار عین مستقر نیست، بلکه استقرار صفتی برای مستقر است و حقیقتی معنوی است نه نفسی، پس عین خود علم نیست، لذا اضافه جایز است. و اینکه گفتیم جاهل ممکن است در آنچه جاهل است به علم متصف شود، اشاره به این فرموده خداوند متعال است: **«پس روی بگردان از کسی که از یاد ما روی برتافته و جز زندگی دنیا را نخواسته است. این نهایت دانش آن‌هاست. همانا پروردگار تو به کسی که از راه او گمراه شده داناتر است و به کسی که هدایت یافته نیز داناتر است.» (فَأَعْرِضْ عَنْ من تَوَلَّى عَنْ ذِكْرِنا ولَمْ يُرِدْ إِلَّا الْحَياةَ الدُّنْيا ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وهُوَ أَعْلَمُ بِمَنِ اهْتَدى)**. پس در هر دو گروه، «داناتر» را ذکر کرد. ما با این کلام، آنچه را در شعر خود گفتیم شرح دادیم، زیرا این کلام متضمن شرح آنچه در این منزل است می‌باشد، لذا آن را آوردیم. اکنون به آنچه این منزل به ما می‌دهد باز می‌گردیم و می‌گوییم: و خداوند یاری‌دهنده است.\n\n[از منزل مناجات جماد (مناجاة الجماد): تسبیح سنگریزه‌ها در کف پیامبر (ص)]\n\nبدان که از جمله امور این منزل، تسبیح سنگریزه‌ها در کف پیامبر (صلی الله علیه و سلم) است. و از این منزل است، خوردن کتف گوسفند توسط ایشان. و از این منزل است، دوست داشتن کوه اُحد توسط ایشان. و از این منزل است، سلام کردن سنگ بر ایشان. و از این منزل است، شهادت دادن هر تر و خشکی برای مؤذن به اندازه برد صدایش. و از این منزل است، فرار سنگ با لباس موسی (علیه السلام) تا بنی اسرائیل عورت او را دیدند و او از آنچه به او نسبت داده بودند مبرا شد. پس خداوند فرمود: **«پس خداوند او را از آنچه می‌گفتند مبرا ساخت و او نزد خداوند آبرومند بود.» (فَبَرَّأَهُ الله مِمَّا قالُوا وكانَ عِنْدَ الله وَجِيهاً)**. و از این منزل است، سخن آسمان‌ها و زمین هنگامی که امر الهی به آن‌ها تعلق گرفت: **«با اطاعت آمدیم.» (أَتَيْنا طائِعِينَ)**. و چون درخواست حمل امانت (الأمانة) یک پیشنهاد (عرض) بود نه یک فرمان (أمر)، به همین دلیل از پذیرش امتناع کردند، زیرا می‌دانستند که در معرض خطر قرار می‌گیرند و نمی‌دانستند سرانجام کارشان به کجا می‌انجامد. حکم این منزل در شریعت گسترده است. پس به یاری خداوند، برخی از آنچه این منزل در بر دارد را ذکر می‌کنیم، ان‌شاءالله تعالی.\n\n[علم حرکات معقول و محسوس]\n\nاولین علمی که این منزل در بر دارد، علم حرکات معقول و محسوس است. پس بدان که حرکات، که همان معانی‌ای هستند که انتقال‌ها از آن‌ها حاصل می‌شوند، اصحاب ما در مورد آن‌ها اختلاف نظر دارند که آیا آن‌ها ذواتی هستند که فی‌نفسه موجودند یا نسبت‌هایی هستند؟ نزد ما آن‌ها نسبت‌هایی هستند. و این نسبت‌ها احکامی را بر حسب آنچه به آن نسبت داده می‌شوند، می‌دهند. پس نسبت آن‌ها در متحیّزات (مکان‌مندها) با نسبتشان در غیر متحیّزات متفاوت است، و نسبتشان در اجسام با نسبتشان در جواهر متفاوت است. و هیچ موجودی نیست مگر اینکه نسبتی خاص در آن دارد، هرچند که یک نسبت باشد.\nرسول خدا (صلی الله علیه و سلم) فرمود: **«پروردگار ما در ثلث باقی‌مانده از شب به آسمان دنیا فرود می‌آید.»**\nو او سبحانه موصوف است به اینکه بر عرش خود مستوی است به معنایی که اراده کرده است، و او سبحانه **«هر کجا باشید با شماست» (هُوَ سبحانه مَعَكُمْ أَيْنَ ما كُنْتُمْ)**، آن‌گونه که شایسته اوست، و او به ما از **«رگ گردن» (حَبْلِ الْوَرِيدِ)** نزدیک‌تر است، و او تعالی در عماء (فضای ابری) است که نه بالای آن هواست و نه زیر آن هوا. همه این‌ها تو را به آنچه از انتقال‌ها اراده می‌شود، رهنمون می‌سازد. پس ممکن است انتقال، ظهور حکم صفتی بر صفتی دیگر باشد، یا انتقال از حالی به حال دیگر، یا از حیز (محدوده) به حیز دیگر، یا از مکانی به مکان دیگر، یا از منزلتی به منزلت دیگر باشد. من تو را آگاه ساختم که انتقال در تمام موجودات بر اساس آنچه ذواتشان استحقاق دارند، جاری است، پس کیفیت‌های نسبت‌ها متفاوت می‌شود و همه به حکم حرکت باز می‌گردد. و از این باب است فرموده خداوند متعال: **«ای جن و انس، به زودی به حساب شما می‌پردازیم.» (سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ)** و فرموده: **«او هر روز در کاری است.» (كُلَّ يَوْمٍ هُوَ في شَأْنٍ)**. سپس پس از آنکه این را مقرر داشتیم، بدان که حرکت در متحرکات بر دو قسم است: طبیعی، که مانند رشد در موجودات نامی است؛ و عرضی. و حرکت عرضی یا اختیاری است یا غیر اختیاری. حرکت اختیاری فقط در حیوان یافت می‌شود، و غیر اختیاری در حیوان و غیر آن وجود دارد. و حرکت قسری (اجباری) که از غیر متحرک واقع می‌شود، چه طبع آن را اقتضا کند یا اقتضا نکند. در جماد (الجماد) و نبات، حرکت قسری طبع آن‌ها را اقتضا نمی‌کند، و در غیر جماد، بر خلاف آنچه اختیارش اقتضا می‌کند، واقع می‌شود. و ممکن است محرک از جنس متحرک باشد یا نباشد. و ممکن است حرکت قسری ناشی از حرکت قسری باشد، و ممکن است ناشی از حرکت قسری نباشد. اولی مانند به حرکت درآوردن شاخه‌ها توسط بادهاست، و دومی مانند پرتاب سنگ توسط انسان به سوی بالا در هوا. سخن در این مسئله دقیق و پنهان است، زیرا مسئله‌ای عظیم‌القدر است و به ذهن عقول نمی‌رسد. و به باب تولد (تولید) تعلق دارد، مانند حرکت انگشتر به واسطه حرکت انگشت، و حرکت آستین به واسطه حرکت دست. و حرکت سلطانی عظیم دارد که حکمش در اجسام و لوازم آن‌ها مشهود است و در معانی معقول است و حد آن شناخته نمی‌شود. پس حرکت، سریان کامل در موجودات دارد و اولین حکم آن در هر آنچه غیر خداست، خروج اعیان و انتقال آن‌ها از حالت عدم به حالت وجود است. و استقرار هیچ موجودی اصلاً صحیح نیست، زیرا استقرار سکون است و سکون عدم حرکت است، پس بفهم. و پس از آنکه این مقرر شد، بدان که امر حرکتی که در این منزل است بر مردم مشتبه شده است، پس ندانسته‌اند که آیا طبیعی است یا قسری، یا طبیعی قسری، یا طبیعی غیر قسری، یا قسری غیر طبیعی. و این اختلاف تنها از کسانی تصور شده که این منزل را شهود نکرده و وارد آن نشده‌اند. و نزد ما، این حرکت، حرکتی طبیعی اختیاری است برای آشکار ساختن اسراری از یک امر الهی. و در سبب موجب این حرکت اختلاف کرده‌اند که آیا سبب، سبب حمیت‌هاست یا سبب آن عالم انفاس است یا هیچ سببی جز امر الهی ندارد؟\n\n[به حرکت درآوردن درختان توسط هوا]\n\nپس بدان که امر در این مورد، وجود امر الهی در عالم انفاس است که بر این کَوْن (هستی) توجه کرد و آن را به حرکت درآورد، و کَوْن نیز حرکت را به طبع خود پذیرفت، مانند توجه هوا بر درختان تا آن‌ها را با وزش خود به حرکت درآورد. بیننده (المشاهد) حرکت شاخه‌ها را به دلیل وزش بادها می‌بیند، اما علم می‌بیند که اگر شاخه‌ها جایگاه خود را خالی نمی‌کردند، بادها جایی برای وزیدن نمی‌یافتند. پس بادها از جهتی در آن حکم دارند و از جهتی حکم ندارند. و مقصود از به حرکت درآوردن درختان توسط هوا، از بین بردن بخارهای فاسد از آن‌ها بود تا مبادا آنچه موجب علل و بیماری‌ها در عالم می‌شود را در خود جای دهند، در صورتی که آن درختان از آن تغذیه کنند و حیوان آن را بخورد، یا خود درختان با تغذیه از آن فاسد شوند. پس وزش بادها برای مصالح عالم بود، زیرا بیماری و آلودگی را از آن دور می‌کند و جو را تصفیه می‌نماید، در نتیجه زندگی پاکیزه می‌شود. پس باد سببی مقصود است که در مسبب خود تأثیرگذار نیست، بلکه تأثیر در این مورد از آنِ کسی است که اسباب را قرار داده و آن‌ها را حجابی برای خود ساخته است تا برتری میان خلایق در معرفت (المعرفة) به خداوند آشکار شود و کسی که شرک ورزیده از کسی که توحید (توحید) داشته متمایز گردد. مشرک مطلقاً جاهل است، زیرا شرکت در چنین امری به هیچ وجه صحیح نیست، چرا که ایجاد فعل با شرکت محقق نمی‌شود. به همین دلیل معتزله به مشرکین ملحق نشدند، زیرا آن‌ها افعال بندگان را برای خود بندگان توحید کردند و آن‌ها را شریک قرار ندادند، بلکه فعل را عقلاً به آن‌ها نسبت دادند و شرع نیز این را تصدیق کرد. و اشاعره فعل همه ممکنات را بدون تقسیم عقلی برای خداوند توحید کردند و شرع نیز آن‌ها را بر این امر یاری داد، اما با برخی احتمالات وجوه آن خطاب. پس حجج معتزله در ظاهر قوی‌تر بود، اما آنچه اشاعره به آن گرویدند نزد اهل کشف (أهل الکشف) از اهل الله قوی‌تر است. و هر دو طایفه صاحب توحید هستند. و ما مشرک را جاهل دانستیم به این دلیل که موجود جز به یک ایجاد متصف نمی‌شود و قدرت در اعیان جز ایجاد ندارد، پس موجود با دو وجود، موجود نمی‌شود. بنابراین صحیح نیست که وجود ناشی از تعلق دو قدرت باشد، زیرا هر یک از آن دو تنها وجود را به موجود می‌دهد. پس هنگامی که یکی از آن‌ها وجودش را به آن داد، دیگری در آن اثری ندارد. پس اگر در فعل تحقیق کنی، شرکت باطل است و به همین دلیل در عقاید تأثیرگذار نیست. مشرک زیانکار که دشمنی با او مشروع است، کسی است که آنچه شایسته الوهیت است را به غیر خدا نسبت دهد و او را به عنوان اله بپرستد. پس گویی او را در مرتبه شریک قرار داده است، مانند اشتراک دو سلطان در معنای سلطنت، هرچند که یکی بر ملک دیگری حکم نمی‌کند، اما هر یک حقیقتاً سلطان است. و پس از آنکه آنچه از علم به حرکت تعلق دارد را به اندازه‌ای که وقت اجازه داد شناختی، اکنون بیان می‌کنیم که چرا این حرکت خاص در این منزل یافت شد. پس بدان که این حرکت برای آشکار ساختن اخباری که در غیب پنهان بود و سنگینی آن بر خلق دشوار بود، یافت شد. چنانکه خداوند متعال فرمود: **«همانا ما به زودی سخنی سنگین بر تو القا خواهیم کرد.» (إِنَّا سَنُلْقِي عَلَيْكَ قَوْلًا ثَقِيلًا)** و در مورد قیامت فرمود: **«در آسمان‌ها و زمین سنگین است.» (ثَقُلَتْ في السَّماواتِ والْأَرْضِ)**. و این بدان سبب است که غیب هنگامی که امری بر او سنگین شود و بر او تنگ آید و گنجایش آن را نداشته باشد، بر عالم شهادت استراحت می‌کند. پس غیب مانند حامل سنگین‌بار، نفسی می‌کشد و آنچه حملش بر او سنگین بود را در عالم شهادت آشکار می‌سازد. و این از نظر معنا مانند آن است که کتمان سر و حمل اندوه بر انسان سنگین شود، هنگامی که کسی از برادرانش را نیابد که بر او تکیه کند. پس اگر برادری را بیابد که همّ خود را که در آن است و بر او سنگینی می‌کند، به او بگوید، با گرفتن آن هم توسط دوستش، در بیان آن راحتی می‌یابد. گویی دوستش در آن با او شریک شده و بار او سبک گشته است. و اگر آنچه موجب همّ او شده، تحت قدرت کسی باشد که همّ را به او می‌گوید، و او حاجتش را برآورده سازد، آن سنگینی را به کلی از او برطرف می‌کند. این همان سنگینی است که در غیب است و بر شهادت استراحت می‌کند. و سبب آن این است که آن امر از آنِ غیب نیست، بلکه امانتی است نزد او برای شهادت. و چون مطلوب آن امر، شهادت است، پس نزد غیب امانت است. در نتیجه غیب مکلف به حفظ و ادای آن در وقتش به شهادت می‌شود، پس بالضروره بر او سنگین می‌آید. آیا به فرموده خداوند متعال نمی‌نگری: **«ما امانت (الْأَمانَةَ) را بر آسمان‌ها و زمین و کوه‌ها عرضه کردیم، پس از حمل آن سر باز زدند و از آن ترسیدند، و انسان آن را حمل کرد. همانا او بسیار ستمکار (ظَلُوماً) بود»** یعنی بر نفس خود، **«و بسیار نادان (جَهُولًا) بود»** یعنی نسبت به قدر آن. پس امانت در معنا سنگین است، هرچند در تحمل سبک باشد. و آسمان‌ها و زمین و کوه‌ها در این مسئله...\n\n[همانا خداوند آدم را بر صورت خود آفرید]\n\nبدان که انسان [در این مسئله] داناتر از [آسمان‌ها و زمین] بود، هرچند در حقیقت داناتر نبود. بلکه انسان چون بر صورت الهی آفریده شده بود و مجموع عالم بود، به خود و به نیرویی که خداوند به او داده بود مغرور شد، به همین دلیل حمل امانت بر او آسان آمد. سپس دید که حق او را بدون عرضه مقام خلافت، شایسته آن دانسته است، پس یقین کرد که اهلیت در او موجود است. و آسمان‌ها به تنهایی و زمین به تنهایی و کوه‌ها به تنهایی، قدرت جامعیت انسان را نداشتند. به همین دلیل **«از حمل آن سر باز زدند و از آن ترسیدند» (فَأَبَيْنَ أَنْ يَحْمِلْنَها وأَشْفَقْنَ مِنْها)**. و انسان ندانست که چه عوارضی در حمل آن بر او عارض می‌شود، پس به دلیل آن عارض، خائن نامیده شد، زیرا او بر طمع و تنبلی سرشته شده است و آن را نپذیرفت مگر به دلیل عجول بودنش. اگر حق به او فرصت می‌داد تا در نفس خود بیندیشد و در ذات و عوارض خود بنگرد، قدر آنچه بر او عرضه شده بود برایش آشکار می‌شد و آن را رد می‌کرد، همان‌گونه که آسمان و دیگرانی که بر آن‌ها عرضه شد، آن را رد کردند. و ما در روایات خود از حسن بصری روایت کرده‌ایم که مردی از سفر آمد و قصد خانه حسن را کرد. هنگامی که حسن نزد او آمد، مرد گفت: من از فلان شهر آمده‌ام و فلان دوست شما سلامش را به من سپرد، پس او به شما سلام می‌رساند. حسن به او گفت: کی آمدی؟ گفت: همین الان. گفت: آیا قبل از آمدن نزد من به خانه‌ات رفتی؟ گفت: نه، همین‌گونه که هستم نزد شما آمدم تا امانت شما را ادا کنم. حسن گفت: ای مرد، اگر قبل از آمدن نزد من به خانه‌ات می‌رفتی و می‌مردی، خائن می‌مردی. پس عاقل کسی است که وعده ندهد و امانت را حمل نکند. و حکم امانت تنها برای کسی است که به او می‌رسانی، نه کسی که آن را به تو می‌سپارد. خداوند متعال می‌فرماید: **«همانا خداوند به شما فرمان می‌دهد که امانت‌ها را به اهلش بازگردانید.» (إِنَّ الله يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَماناتِ إِلى‏ أَهْلِها)**. شکی نیست و پنهان نیست که در طبع هر چیزی، اضطراب از آنچه بر او سنگینی می‌کند وجود دارد تا آن را از خود خارج سازد، زیرا آنچه بر او سنگین شده از آنِ او نیست، بلکه امری زائد است. پس هنگامی که آن امر از آنِ او شود، آن سنگینی از بین می‌رود و به آن شاد می‌شود، زیرا ملک او شده و سیادت او بر آن آشکار گشته است. آیا نمی‌بینی که انسان هنگامی که مالی نزد او به امانت گذاشته می‌شود، چگونه سنگینی آن را حس می‌کند و متحمل حفظ و نگهداری آن می‌شود؟ اما اگر صاحب مال به او بگوید: آن را به تو بخشیدم و از ملک خود خارج کردم و از آن دست کشیدم، چگونه حمل آن مال نزد او سبک می‌شود و به آن بسیار شاد می‌گردد و قدر آن بخشنده در نفس او بزرگ می‌شود؟ همچنین اوصاف حق نزد بنده امانت است. عارفی که می‌داند این اوصاف نزد او امانت است، همواره با مراقبت از اینکه چگونه و کجا آن‌ها را به کار برد، بر او سنگینی می‌کند و می‌ترسد که در آن‌ها تصرف مالکانه کند. پس هنگامی که این بر او سنگین شود، آن را به صاحبش باز می‌گرداند و با عبودیت (عبودية) خود که ملک اوست، بلکه حقیقت اوست، سبک و لذت‌برنده باقی می‌ماند، زیرا امر زائد بر او زائل شده است و ثنای الهی به دلیل ادای سالم امانتش برای او حاصل شده است. پس رستگار شد کسی که قدر خود را نشناخت، چنانکه در مَثَل گفته می‌شود: کسی که قدر خود را شناخت، هلاک نشد. و از این منزل، متعلق استفهام (پرسش) در هر کجا که باشد، دانسته می‌شود. و این بدان سبب است که استفهام یا با عدم علم در نفس امر است، یا با اظهار عدم علم برای اقرار گرفتن از مستفهم (پرسش‌شونده) بر آنچه از او پرسیده شده، در حالی که مستفهم (پرسش‌کننده) به آن علم دارد. پس مستفهم می‌گوید: چه چیزی نزد توست؟ و چرا فلانی را زدی؟ پس علت استفهام از امور، عدم علم است. و انگیزه استفهام با اختلاف مستفهم متفاوت است. اگر عالم به آنچه از آن استفهام می‌کند باشد، مقصود از آن آگاه ساختن دیگری است، زیرا گمان کرده‌اند و خلاف واقع گفته‌اند. مانند فرموده خداوند متعال به عیسی (علیه السلام): **«آیا تو به مردم گفتی که من و مادرم را دو معبود به جای خدا بگیرید؟» (أَنْتَ قُلْتَ لِلنَّاسِ اتَّخِذُونِي وأُمِّي إِلهَيْنِ من دُونِ الله)** در حضور کسانی از نصاری که او را می‌پرستیدند و این نسبت را به او می‌دادند. پس عیسی در حضور آن‌ها از این نسبت تبری جست و گفت: **«منزهی تو! مرا نسزد که چیزی را بگویم که حق من نیست.» (سُبْحانَكَ ما يَكُونُ لِي أَنْ أَقُولَ ما لَيْسَ لِي بِحَقٍّ)**. پس مقصود، توبیخ کسانی از امت او بود که او را پرستیدند و او را اله قرار دادند. پس این در ظاهر صورت استفهام واقع شد، در حالی که در حقیقت توبیخ است. و مانند این در صنعت عربی، هنگامی که آن را در اصطلاح اعراب می‌کنند، آن را همزه تقریر و انکار اعراب می‌کنند نه استفهام، هرچند بگویند همزه استفهام است و مراد از آن انکار باشد. پس در اعراب چنین مواردی دو روش دارند. بنابراین شایسته است که بنده به صفتی ظاهر نشود که او را به پرسش پروردگارش در مورد آن صفت بکشاند، زیرا بوی استفهام در پرسش‌شونده، نفی علم را می‌رساند، و آن جناب (حق) از این منزه و مقدس است. پس از این مقام برحذر باش. و از چنین چیزی مصون نمی‌مانی مگر به اینکه عبودیت (عبودية) تو در هر حال بر تو حاکم و در تو آشکار باشد. پس اگر حق از چیزی از تو پرسید، آن از جانب او و ابتدایی باشد و تو در آن سببی نداشته باشی. و او سبحانه چیزی بر او حکم نمی‌کند، زیرا اگر بخواهد می‌پرسد و اگر بخواهد نمی‌پرسد، با وجود نسبت علم به او تعالی در مورد آنچه از آن پرسیده می‌شود، که این ضروری است. و برای استفهام ادواتی مانند «ما»، «أی» و همزه وجود دارد. و این منزل از میان ادوات، به خصوص «ما» اختصاص دارد، نه «مَن» و دیگر ادوات. هیچ یک از ادوات استفهام دیگر در این منزل راه ندارند. و من تا کنون بر سبب اختصاص این منزل به «ما» دون غیر آن واقف نشده‌ام. و «ما» در حکم کسی که بر او وارد می‌شود، حکم «مَن» و همزه را دارد، زیرا بر اسم‌ها و فعل‌ها و حرف‌ها وارد می‌شود، و جز این سه مرتبه نیست، پس عمومیت یافت. بنابراین این منزل عمومیت استفهام را داراست. و در این منزل در این حالت، جز ادات «ما» صحیح نیست که ظاهر شود، زیرا معانی آن را می‌طلبند. و گاهی با اشاره استفهام می‌شود. و از این منزل است، فاش کردن اسرار و غیوب پنهان، به دلیل طلب مواطن برای آن‌ها. پس انسان از این منزل، مواطنی را می‌آموزد که شایسته است آنچه از غیوب نزد خود دارد را در آن‌ها آشکار سازد و می‌داند که موطن دنیا اقتضای آن را ندارد. به همین دلیل چیزی از آن بر ملامتیه (الملامية) ظاهر نشد. و منظورم از غیوب در اینجا هر غیبی است که موطن آن را طلب نکند. اما غیوبی که هر موطنی آن را می‌طلبد، ناگزیر است که غیب هر موطنی در موطن خود به شهادت (الشهادة) خارج شود. و این حال ملامتیه است، مگر اینکه آشکار ساختن آن با امر الهی همراه شود. و هرگز امری با آن همراه نمی‌شود مگر اینکه حالی از احوال آن را طلب کند. اما بدون طلب حال، چنین نیست. و به همین دلیل مردم قدر و منزلت اهل الله تعالی را نزد خداوند ندانستند. و به همین سبب آن‌ها امین نامیده شدند. پس هنگامی که موطن، آشکار ساختن غیب خود را اقتضا کند، عارف اولین کسی است که به آن مبادرت می‌ورزد و در آن می‌شتابد. و اگر چنین نکند، فریبکار و خائنی است که به هیچ دردی نمی‌خورد. اما اگر دیگری در آشکار ساختن آن بر او سبقت گرفت، در آن هنگام بر او واجب است که آن را پنهان کند و هیچ یک از خلق را بر آنچه نزد او در آن مورد است، مطلع نسازد، زیرا دیگری در آن به جای او ایستاده است. پس برای این عارف در آشکار ساختن آن جز بهره نفس باقی نمی‌ماند، و این از شأن خصائص حق و اهل او نیست. اما اگر وحی‌ای از جانب خداوند در این مورد به او رسید، با وجود اینکه توسط دیگری آشکار شده است، باید به امر خداوند در آن مبادرت ورزد و آن را آشکار سازد و در این کار مانند تأییدکننده اولی باشد. و بدان که هیچ جنسی از اجناس مخلوقات نیست مگر اینکه به او وحی شده است، از فرشته و جن و انسان و حیوان و نبات و جماد (جماد). پس از حیوان، زنبور عسل را ذکر کرد و از جماد، آسمان و زمین را، هرچند نزد ما همه زنده‌اند، اما ما بر اساس آنچه در حس غالب متعارف است، عمل می‌کنیم. و خداوند متعال فرمود: **«و هیچ چیز نیست مگر اینکه با ستایش او تسبیح می‌گوید.» (إِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)** و فرمود: **«و هیچ امتی نیست مگر اینکه در آن بیم‌دهنده‌ای گذشته است.» (إِنْ من أُمَّةٍ إِلَّا خَلا فِيها نَذِيرٌ)** و فرمود: **«و اگر او را فرشته قرار می‌دادیم، او را به صورت مردی قرار می‌دادیم.» (ولَوْ جَعَلْناهُ مَلَكاً لَجَعَلْناهُ رَجُلًا)** و فرمود: **«اگر در زمین فرشتگانی بودند که با اطمینان راه می‌رفتند، قطعاً فرشته‌ای را به عنوان رسول از آسمان بر آن‌ها نازل می‌کردیم.» (لَوْ كانَ في الْأَرْضِ مَلائِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنا عَلَيْهِمْ من السَّماءِ مَلَكاً رَسُولًا)** و فرمود: **«و ما هیچ رسولی را نفرستادیم مگر به زبان قومش.» (وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ)** یعنی با لهجه آن‌ها.\n\n[وحی بر اقسام مختلف]\n\nوحی بر انواع گوناگونی است و این منزل آن را در بر می‌گیرد. از جمله آن، وحی‌ای است که با خیال دریافت می‌شود، مانند مژده‌ها در عالم خیال، و آن وحی در خواب است. پس دریافت‌کننده خیال است و نازل‌شونده نیز همین‌طور و وحی نیز همین‌طور. و از جمله آن، وحی‌ای است که به صورت خیال در حس بر صاحب حس وارد می‌شود. و از جمله آن، معنایی است که موحی‌الیه (کسی که وحی بر او نازل می‌شود) آن را در نفس خود می‌یابد، بدون تعلق حس یا خیال به کسی که آن را نازل کرده است. و گاهی به صورت نوشته است و این برای اولیا زیاد اتفاق می‌افتد، و به همین صورت به ابوعبدالله قضیب البان و ابوزکریا البجائی در مَعَرّه در دیر النقره و به تقی بن مخلد، شاگرد احمد بن حنبل صاحب مسند، وحی می‌شد، اما او ضعیف‌ترین این گروه بود، زیرا آن را جز پس از بیدار شدن از خواب، نوشته شده بر روی کاغذی نمی‌یافت. و از جمله آنچه این منزل در بر دارد، خلق اعراض به صورت‌هایی است که ذواتی قائم و متحیّز در ظاهر چشم هستند.\n\n[همانا خداوند هنگامی که به انسانی روی آورد، او را به جمعیتی گرد می‌آورد که در آن تفرقه‌ای نیست]\n\nپس بدان که انسان هنگامی که خداوند او را به سوی خود آورد، او را به جمعیتی گرد می‌آورد که در آن تفرقه‌ای نیست، تا خداوند در آن حال آنچه را که در علم ازلی‌اش گذشته است، به او ببخشد. پس هنگامی که از آن مشهد و از آن حالت خارج می‌شود، با آنچه به دست آورده خارج می‌شود، در حالی که امری کلی و مجمل و غیر مفصل به دست آورده بود. پس هنگام خروج، تفصیل اعیان برای او آشکار می‌شود و برای هر جزء از آن، صورتی خاص به خود پدیدار می‌گردد. پس از حال جمعیت خود به حال تفرقه خارج می‌شود. در این هنگام، صور اعمال به یکباره به سوی او هجوم می‌آورند و هر یک از آن صور به کسی که اصل در وجود آن بوده است، تعلق می‌گیرد، یا به نفع او یا به ضرر او. پس به چشم او صور نگاهش، و به گوش او صور تعلق شنیدنش، و همچنین سایر حواس ظاهری‌اش تعلق می‌گیرد. و به باطن او صور اعمال باطنی‌اش از اعمال فکر و خیال و سایر قوای باطنی‌اش در آن تعلق می‌گیرد. پس اگر صور عملی موجب شادی باشد، به آن شاد می‌شود و اگر موجب غم و اندوه باشد، انسان بر حسب آنچه آن صورت ایجاب می‌کند، خواهد بود. و اگر صورتی باشد که هم این را و هم آن را ایجاب کند، شادی آن جزئی که صورت عمل شادی‌آور دارد، از حیث آن جزء است، نه از حیث نفس مکلف. پس آن جزء انسانی به اندازه آن متنعم می‌شود و جزء دیگر نیز به واسطه صورت عملش محزون می‌گردد. و نفس در این حالت، به حکم تبعیت از شادی این، شاد می‌شود و به حکم تبعیت از حزن آن، محزون می‌گردد، در یک حال واحد با دو روی‌آوری متفاوت. همان‌گونه که در حال نگاه کردن، در حال دست زدن، در حال راه رفتن، در حال لمس کردن، در حال بوییدن، در حال چشیدن، می‌شنید و هیچ یک او را از بقیه باز نمی‌داشت، با وجود احدیت مُدرِک (ادراک‌کننده). همچنین از یک راه متنعم می‌شود و از راه دیگر محزون می‌گردد. پس او شادِ محزون و برنده‌ی زیانکار است تا زمانی که وارد بهشت شود. و این از شگفت‌انگیزترین مشاهدات است و یابنده آن در این دنیا از اهل طریق، به دلیل عدم کشف (الکشف) و تحقق و کمی علمشان به آن، اندک است. و **«خداوند حق را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)**."
  },
  "page_count": 5
}