{
  "id": 223,
  "title": {
    "ar": "الباب الثالث والعشرون ومائتان في معرفة حال التفرقة",
    "en": "Chapter Two Hundred and Twenty-Third: On the Knowledge of the State of Differentiation (التفرقة)",
    "ur": "باب دو سو تئیسواں: حالِ تفرقہ (التفرقة) کی معرفت (المعرفۃ) کے بیان میں",
    "fa": "باب دویست و بیست و سوم در معرفت حال تفرقه (التفرقة)"
  },
  "content": {
    "ar": "## «الباب الثالث والعشرون ومائتان في معرفة حال التفرقة»\n\n\n> إذا اجتمعت فقد أثبت تفرقة *** كما تحققت قرآنا وفرقانا\n\n\n> والعين واحدة والحكم مختلف *** وقد أقمت على ما قلت برهانا\n\n\n> فالجمع والفرق حال ناقص أبدا *** فاعدل وكن واحدا إن كنت إنسانا\n\n\n> وألزم طريقة جبريل وصاحبه *** إذ قررا لك إسلاما وإيمانا\n\n\n> وتم جاء بما قد صح بعدهما *** فقررا لك إحسانا وإحسانا\n\n\n> فتلك أربعة لا خامس لها *** سوى المؤيد جل الحق سبحانا\n\n\n### [أن التفرقة عبارة عن خلق بلا حق‏]\n\n\nاعلم أن التفرقة عند بعض القوم إشارة من أشار إلى خلق بلا حق وعند أبي علي الدقاق الفرق ما ينسب إليك وعند بعضهم الفرق ما أشهدك الحق من أفعالك أدبا وعند بعضهم الفرق مشاهدة العبودية وقيل الفرق إثبات الخلق وقيل التفرقة شهود الأغيار لله وقيل التفرقة مشاهدة تنوع الخلق في أحوالهم ومستند مقام التفرقة من العلم الإلهي نعت الحق سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وهو انقضاء المدة التي سبق في علم الله مقدارها وهو زمان الحياة الدنيا في كل شخص شخص‏\n\n\n### [أن أصل الأشياء كلها التفرقة]\n\n\nواعلم أن أصل الأشياء كلها التفرقة وأول ما ظهرت في الأسماء الإلهية فتفرقت أحكامها بتفرق معانيها حتى لو نظر الإنسان فيها من حيث دلالتها كلها على العين مع الفرقان المعلوم بين معانيها التي يعقل فيها من أنه سميت هذه العين بكذا لكذا ولا سيما إذا كانت الأسماء تجري مجرى النعوت على طريق المدح والتفرقة أظهر وبالتفرقة تعرف إلينا سبحانه فقال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وقال أَ فَمَنْ يَخْلُقُ كَمَنْ لا يَخْلُقُ ففرق بين من يخلق ومن لا يخلق وحدود الأشياء أظهرته التفرقة بين الأشياء وبالتفرقة ظهرت المقامات والأحوال وكثرت مراتب الخلق وتميزت بها فلله ثمانون عبدا حققهم بحقائق الايمان ولله مائة عبد حققهم بحقائق النسب الإلهية والأسماء ولله ستة آلاف عبد ويزيدون حققهم بحقائق النبوة المحمدية ولله ثلاثمائة عبد حققهم بحقائق الأخلاق الإلهية ففرق عز وجل بين عباده بالمراتب وعين الجمع هو عين التفرقة إذ هو دليل على الكثرة وإنما سمي جمعا من أجل العين الواحدة التي تجمع هذه التفرقة فقول من قال في التفرقة إنها إشارة من أشار إلى خلق بلا حق فمشهوده ما أعطته الحدود والحدود لم يكن لها ظهور إلا في الخلق إذ كان الحق لا يعرف لأنه الغني عن العالمين أي هو المنزه عن إن تدل عليه علامة فهو المعروف بغير حد المجهول بالحد والحدود أظهرت التفرقة بين الخلق وكل إنسان من أهل الذوق لا يتعدى في أخباره منزلة شهوده وذوقه لأنهم أهل صدق لا يخبرون أبدا إلا عن شهود لا عن خبر وأما قول الدقاق الفرق ما نسبت إليك فهو ما ذكرناه فإنه ما نسب إليك إلا الحدود إذ الحق لا ينسب إليه حد وجميع ما ينسب إلى العبد فما له إلى الفناء والعدم وما ينسب إلى الحق فما له إلى البقاء والوجود فكن ممن ينسب إلى الحق ولا ينسب إلى الخلق وهو معنى قوله تعالى ما عِنْدَكُمْ يَنْفَدُ فوصف بالنفاد ما نسبه إلينا وما لفظة تدل على كل شي‏ء كذا قاله سيبويه وما عِنْدَ الله باقٍ فمن كان عند الله منا صح له البقاء ومن كان عند الخلق صح له النفاد أ لا ترى من هو عبد لغير الله من المماليك إذا جاء الموت ارتفع الملك إذا كان للسيد عليه فنفد فكل ما نسب إلى المخلوق فإنه ينفد بالموت أو بالشهادة وكل ما ينفد فقد فارق من كان عنده وهذا لا يوجد في الحق فإنه لا يفارقه شي‏ء لأنه معنا وإليه تصير الأمور فهذا معنى قوله الفرق ما ينسب إليك وأما قول من قال الفرق ما أشهدك الحق من أفعالك أدبا يشير إلى الأفعال التي لا يعطي الأدب أن تنسب إلى الله وإن كانت من الله لا إلى الأفعال التي تنسب إلى الله أدبا وحقيقة وأفعال العباد لا بقاء لها عند العبد سوى زمان وجودها خاصة وتزول عنه في الزمان الذي يلي زمان وجودها فهذا معنى قول الدقاق فاجتمعا في المعنى غير أن هذا القائل خصص بعض الأفعال بقوله أدبا فإذا نسبت أعيان هذه الأفعال إلى الله اتصفت بالبقاء لا لأعيانها بل لكونها مشهودة لله وما عِنْدَ الله باقٍ كما يبقى الفعل عندك ما دام مشهودا لك فإذا لم تشهده زال عينه عن شهودك ولهذا قال ما أشهدك الحق من أفعالك ولم يتعرض لما يشهدك كما أنه لم يتعرض إلى المحمود من أفعالك مع كونه ينسب إليك فقال أدبا وأما قول من قال الفرق مشاهدة العبودية فإنه نسب العبد إلى الصفة القائمة به ولا ينبغي‏\nأن تنسب إلا إلى الله والعبودية صفة للعبد فمن شاهد عبوديته كان لمن شاهد ولهذا ينسب عباد الله إلى العبودة لا إلى العبودية فهم عبيد الله من غير نسبة بخلاف نسبتهم إلى العبودية فإن الحق لا يقبل نسبة العبودية لأنه عين صفة العبد لا عين العبد فمن شاهد العبودية فلم يشاهد كونه عبدا لله ففرق بين ما ينسب إلى الصفة وبين ما يضاف إلى الله قال أهل اللسان رجل بين الخصوصية والخصوصة وبين العبودية والعبودة والعبودية نسبة إليها والعبودة نسبة إلى السيد وأما قول من قال الفرق إثبات الخلق فهو كما تقدم في معنى قولهم إشارة إلى خلق بلا حق غير أن بينهما فرقانا فإنه قال إثبات الخلق ولم يقل وجود الخلق لأن عين وجود الخلق عين وجود الحق والخلق من حيث عينه هو ثابت وثبوته لنفسه أزلا واتصافه بالوجود أمر حادث طرأ عليه قد عرفناك بما يعقل من هذه اللفظة فقوله إثبات الخلق أي في الأزل وقع الفرق بين الله والخلق فليس الحق هو عين الأعيان الثابتة بخلاف حال اتصافها بالوجود فهو تعالى عين الموصوف بالوجود لا هي فلهذا قال هذا القائل في الفرق إنه إثبات الخلق وأما قول من قال إن الفرق شهود الأغيار لله أراد من أجل الله فهذه لام العلة فيشاهد في عين وجود الحق أحكام الأعيان الثابتة فيه فلا يظهر إلا بحكمها ولهذا ظهرت الحدود وتميزت مراتب الأعيان في وجود الحق فقيل أملاك وأفلاك وعناصر ومولدات وأجناس وأنواع وأشخاص وعين الوجود واحد والأحكام مختلفة لاختلاف الأعيان الثابتة التي هي أغيار بلا شك في الثبوت لا في الوجود فافهم وأما قول من قال التفرقة شهود تنوعهم في أحوالهم يريد ظهور أحكامهم في وجود الحق فإنها متنوعة والحق لا يقبل التنوع فثبت إن ذلك حكم الأعيان والمشهود لهذا العبد التنوع فالمشهود له الأعيان ففرق بينها وبين الوجود وأما قول من قال في التفرقة\n\n\n> جمعت وفرقت عني به *** ففرط التواصل مثنى العدد\n\n\nفإنه أراد ظهور الواحد في مراتب الأعداد فظهرت أعيان الاثنين والثلاثة والأربعة إلى ما لا يتناهى بظهور الواحد وهذه غاية الوصلة أن يكون الشي‏ء عين ما ظهر ولا يعرف أنه هو كما رأيت النبي صلى الله عليه وسلم في المنام وقد عانق أبا محمد ابن حزم المحدث فغاب الواحد في الآخر فلم نر إلا واحدا وهو رسول الله صلى الله عليه وسلم فهذه غاية الوصلة وهو المعبر عنه بالاتحاد أي الاثنين عين للواحد ما في الوجود أمر زائد كما إن زيدا هو عين عمرو بل عين أشخاص هذا النوع الإنساني في الإنسانية فهو هو من حيث الإنسانية وليس هو هو من حيث الشخصية فانعطاف الواحد بنفسه على مرتبة الاثنين هو عين ظهور الاثنين وما ثم سوى عين الواحد وهكذا ما بقي من الأعداد التي لا تتناهى فتحقق معنى التفرقة إن كنت ذا لب سليم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Two Hundred and Twenty-Three: Concerning the Knowledge of the State of Differentiation\n\n> If you achieve Gathering, you have established Differentiation,\n> Just as you realize the Quran and the Criterion (Furqan).\n\n> The Essence is one, but the ruling is different,\n> And I have established proof for what I have said.\n\n> Gathering and Differentiation are always an incomplete state;\n> Therefore, be just and be one if you are truly human.\n\n> Adhere to the path of Gabriel and his companion,\n> For they established for you Submission (Islam) and Faith (Iman).\n\n> Then came what was confirmed after them,\n> So they established for you Perfection (Ihsan) and Perfection.\n\n> These are four, and there is no fifth besides the Supported One—\n> Glorified is The Real (الحق), the Exalted.\n\n### [That Differentiation is an expression of Creation without The Real]\n\nKnow that Differentiation (التفرقة), according to some of the folk, is an indication by those who point to Creation (الخلق) without The Real (الحق). According to Abu Ali al-Daqqaq, Separation (الفرق) is what is attributed to you. According to others, Separation is what The Real makes you witness of your acts, as a matter of spiritual courtesy (adab). According to others, Separation is the witnessing of Servitude (العبودية). It is also said that Separation is the affirmation of Creation (إثبات الخلق). It is also said that Differentiation is the witnessing of the 'others' (الأغيار) for the sake of Allah. And it is said that Differentiation is the witnessing of the variety of Creation in their states. The foundation of the station of Differentiation, derived from Divine Knowledge, is the description of The Real: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ>> (We shall attend to you, O you two heavy burdens [jinn and mankind]). This refers to the expiration of the duration whose measure was predetermined in Allah’s knowledge, which is the time of the life of this world for every single person.\n\n### [That the Origin of All Things is Differentiation]\n\nKnow that the origin of all things is Differentiation, and it first appeared in the Divine Names (الأسماء الإلهية). Their rulings differentiated due to the differentiation of their meanings. Even if a person views them based on their collective indication of the single Essence (العين), the known Criterion (الفرقان) remains between their meanings—the meanings understood when this Essence is named thus and so—especially when the Names function as attributes of praise, where Differentiation is most manifest. Through Differentiation, the Exalted made Himself known to us, saying: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like unto Him), and saying: <<أَ فَمَنْ يَخْلُقُ كَمَنْ لا يَخْلُقُ>> (Is He then Who creates like him who does not create?). Thus, He differentiated between the one who creates and the one who does not create. The limits of things were made manifest by the Differentiation between things. Through Differentiation, the spiritual stations (المقامات) and states (الأحوال) appeared, and the levels (مراتب) of Creation multiplied and were distinguished.\n\nFor Allah, there are eighty servants whom He realized through the realities of Faith (الإيمان); for Allah, there are one hundred servants whom He realized through the realities of the Divine Relations and Names; for Allah, there are six thousand servants and more whom He realized through the realities of the Muhammadan Prophethood; and for Allah, there are three hundred servants whom He realized through the realities of the Divine Ethics. Thus, the Mighty and Majestic differentiated between His servants by their levels.\n\nThe very Essence of Gathering (عين الجمع) is the Essence of Differentiation (عين التفرقة), as it is proof of Multiplicity (الكثرة). It is only called Gathering because of the single Essence (العين الواحدة) that collects this Differentiation.\n\nThe saying of the one who defined Differentiation as pointing to Creation without The Real means that what is witnessed by him is what the limits (الحدود) grant. Limits only appear in Creation, since The Real is not known (by limits) because He is the Independent One, free from the worlds—meaning He is exalted above being indicated by any sign. He is the Known without limit, the Unknown by limit. Limits brought forth the Differentiation between Creation. Every person of spiritual taste (أهل الذوق) does not exceed the station of his witnessing and taste in his reports, because they are people of truthfulness who never report except from witnessing, not from mere information.\n\nAs for the saying of al-Daqqaq that Separation is what is attributed to you, this is what we mentioned, for only limits are attributed to you, since no limit is attributed to The Real. Everything attributed to the servant tends toward annihilation (الفناء) and non-existence (العدم), while everything attributed to The Real tends toward Subsistence (البقاء) and Being (الوجود). Be among those who are attributed to The Real and not to Creation. This is the meaning of His saying, the Exalted: <<مَا عِنْدَكُمْ يَنْفَدُ>> (What is with you vanishes)—He described as vanishing what He attributed to us (and the word *mā* [what] denotes everything, as Sibawayh said)—and <<وَمَا عِنْدَ الله باقٍ>> (and what is with Allah remains). Thus, whoever is with Allah among us achieves Subsistence, and whoever is with Creation achieves vanishing. Do you not see that when death comes to a slave owned by someone other than Allah, the ownership ceases if it belonged to the master? It vanishes. Everything attributed to the created being vanishes through death or martyrdom. Everything that vanishes has departed from the one who possessed it. This is not found in The Real, for nothing departs from Him, because He is with us, and to Him all matters return. This is the meaning of his saying: Separation is what is attributed to you.\n\nAs for the saying of the one who defined Separation as what The Real makes you witness of your acts as a matter of spiritual courtesy (adab), this refers to the acts that courtesy dictates should not be attributed to Allah, even though they originate from Allah—not the acts that are attributed to Allah out of courtesy and reality. The acts of the servants have no subsistence with the servant beyond the specific time of their existence; they vanish from him in the time immediately following their existence. This aligns with the meaning of al-Daqqaq’s saying, except that this speaker specified certain acts by adding the phrase \"as a matter of courtesy.\" If the essences (أعيان) of these acts are attributed to Allah, they are characterized by Subsistence, not due to their essences, but due to their being witnessed by Allah, and <<وَمَا عِنْدَ الله باقٍ>> (and what is with Allah remains). Just as the act remains with you as long as it is witnessed by you, but if you do not witness it, its essence vanishes from your witnessing. This is why he said, \"what The Real makes you witness of your acts,\" and did not mention what He makes you witness, just as he did not mention the praiseworthy of your acts, despite them being attributed to you, by saying \"as a matter of courtesy.\"\n\nAs for the saying of the one who defined Separation as the witnessing of Servitude (العبودية), he attributed the servant to the quality subsisting in him, which should only be attributed to Allah. Servitude (العبودية) is a quality of the servant. Whoever witnesses his Servitude witnesses it for the sake of the One witnessed. This is why the servants of Allah are attributed to *al-ʿubūda* (the relationship of servitude to the Master), not to *al-ʿubūdiyya* (the state of being a servant). They are servants of Allah without needing attribution (to the state), unlike their attribution to *al-ʿubūdiyya*, for The Real does not accept the attribution of *al-ʿubūdiyya* because it is the essence of the servant’s quality, not the essence of the servant himself. Whoever witnesses *al-ʿubūdiyya* has not witnessed his being a servant of Allah. Thus, there is a differentiation between what is attributed to the quality and what is added to Allah. Linguists say there is a difference between *al-khuṣūṣiyya* (specificity) and *al-khuṣūṣa* (special quality), and between *al-ʿubūdiyya* (the state of servitude) and *al-ʿubūda* (the relationship of servitude). *Al-ʿubūdiyya* is an attribution to the state, and *al-ʿubūda* is an attribution to the Master.\n\nAs for the saying that Separation is the affirmation of Creation (إثبات الخلق), this is similar to the meaning of their saying, \"pointing to Creation without The Real,\" except that there is a differentiation between them. He said \"affirmation of Creation\" and did not say \"existence of Creation,\" because the very Essence of the existence of Creation is the very Essence of the existence of The Real. Creation, in terms of its Essence (عين), is fixed (ثابت), and its fixity (ثبوته) is for itself eternally (azalan). Its characterization by Being (الوجود) is an accidental matter that occurred to it—we have made known to you what is understood by this term. So, his saying \"affirmation of Creation\" means that the Separation between Allah and Creation occurred in the pre-eternal state (الأزل). The Real is not the very Essence of the Fixed Entities (الأعيان الثابتة), unlike the state when they are characterized by Being, for He, the Exalted, is the Essence of the One characterized by Being, not them. Therefore, this speaker defined Separation as the affirmation of Creation.\n\nAs for the saying that Separation is the witnessing of the 'others' (الأغيار) for the sake of Allah, he intended \"because of Allah.\" This is the *lām* of causality. Thus, one witnesses the rulings of the Fixed Entities (الأعيان الثابتة) within the very Essence of the Being (الوجود) of The Real, for He does not manifest except through their rulings. This is why limits appeared, and the levels of the Entities were distinguished within the Being of The Real, so they were called angels, celestial spheres, elements, generated things, genera, species, and individuals. The Essence of Being is one, but the rulings are different due to the difference of the Fixed Entities, which are undoubtedly 'others' in their fixity, not in their Being. Understand this.\n\nAs for the saying that Differentiation is the witnessing of their variety in their states, he means the manifestation of their rulings in the Being of The Real, for they are varied, and The Real does not accept variety. Thus, it is established that this is the ruling of the Entities, and what is witnessed by this servant is the variety. Therefore, what he witnesses are the Entities, so he differentiates between them and Being.\n\nAs for the saying of the one who defined Differentiation in the verse:\n\n> I gathered and differentiated from Him by Him,\n> So the excess of connection is the doubled number.\n\nHe intended the manifestation of the One in the levels of numbers. The essences of two, three, four, up to infinity, appeared through the manifestation of the One. This is the ultimate connection (Wusla): that the thing is the very essence of what appeared, yet it is not known that it is Him. Just as you saw the Prophet (peace and blessings be upon him) in a dream embracing Abu Muhammad Ibn Hazm the traditionist, and the One vanished into the Other, so we saw only one, who was the Messenger of Allah (peace and blessings be upon him). This is the ultimate connection, which is expressed as unification (الاتحاد)—meaning the two are the Essence of the One, and there is no surplus matter in Being, just as Zayd is the Essence of Amr, but rather, the essence of the individuals of this human species in humanity. He is He in terms of humanity, but He is not He in terms of individuality. The turning back of the One upon itself at the level of the Two is the very manifestation of the Two, and there is nothing there except the Essence of the One. And so on for the rest of the infinite numbers. Realize the meaning of Differentiation if you possess a sound intellect. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو تئیس: حالِ تفرقه (التفرقة) کی معرفت میں\n\n> جب تم جمع (الجمع) ہوتے ہو تو تم نے تفرقه (التفرقة) کو ثابت کیا،\n> جیسا کہ تم نے قرآن اور فرقان کو یقینی جانا۔\n\n> اور عین (ذات) ایک ہے، مگر حکم مختلف ہے،\n> اور میں نے اپنے کہے پر دلیل قائم کر دی۔\n\n> پس جمع (الجمع) اور فرق (الفرق) ہمیشہ ایک ناقص حال ہے،\n> لہٰذا انصاف کرو اور اگر تم انسان ہو تو ایک ہو جاؤ۔\n\n> اور جبرائیل اور ان کے ساتھی (محمد ﷺ) کے طریقے کو لازم پکڑو،\n> جب انہوں نے تمہارے لیے اسلام اور ایمان کا فیصلہ کیا۔\n\n> پھر وہ (احسان) آیا جو ان دونوں کے بعد صحیح ثابت ہوا،\n> پس انہوں نے تمہارے لیے احسان اور احسان کا فیصلہ کیا۔\n\n> پس یہ چار ہیں، ان کا کوئی پانچواں نہیں،\n> سوائے اس ذات حق (الحق) کے جو مؤید ہے، وہ پاک ہے۔\n\n### [کہ تفرقه (التفرقة) خلق (الخلق) بلا حق (الحق) کا نام ہے]\n\nجان لو کہ بعض قوم کے نزدیک تفرقه (التفرقة) اس شخص کا اشارہ ہے جس نے خلق (الخلق) بلا حق (الحق) کی طرف اشارہ کیا۔ اور ابو علی دقاق کے نزدیک فرق (الفرق) وہ ہے جو تمہاری طرف منسوب ہو۔ اور بعض کے نزدیک فرق (الفرق) وہ ہے جو ذات حق (الحق) نے تمہیں تمہارے افعال میں بطور ادب دکھایا۔ اور بعض کے نزدیک فرق (الفرق) عبودیت کا مشاہدہ ہے۔ اور کہا گیا ہے کہ فرق (الفرق) خلق (الخلق) کا اثبات ہے۔ اور کہا گیا ہے کہ تفرقه (التفرقة) اللہ کے لیے اغیار (غیروں) کا شہود (الشهود) ہے۔ اور کہا گیا ہے کہ تفرقه (التفرقة) مخلوق کے احوال میں تنوع کا مشاہدہ ہے۔ اور مقامِ تفرقه (التفرقة) کی بنیاد علم الٰہی سے ذات حق (الحق) کا یہ وصف ہے: \"سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ\" (عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھ والو - جن و انس)۔ اور یہ اس مدت کا اختتام ہے جس کی مقدار اللہ کے علم میں پہلے سے طے تھی، اور وہ ہر شخص میں حیاتِ دنیا کا زمانہ ہے۔\n\n### [کہ تمام اشیاء کی اصل تفرقه (التفرقة) ہے]\n\nاور جان لو کہ تمام اشیاء کی اصل تفرقه (التفرقة) ہے۔ اور سب سے پہلے یہ اسماء الٰہیہ (الأسماء الإلهية) میں ظاہر ہوئی، پس ان کے معانی کے تفرق (التفرقة) سے ان کے احکام میں تفرق پیدا ہوا۔ یہاں تک کہ اگر انسان ان (اسماء) میں اس حیثیت سے دیکھے کہ وہ سب ایک ہی عین (ذات) پر دلالت کرتے ہیں، باوجود اس فرقان (الفرقان) کے جو ان کے معانی کے درمیان معلوم ہے، جس میں یہ سمجھا جاتا ہے کہ اس عین (ذات) کو فلاں وجہ سے فلاں نام دیا گیا، خاص طور پر جب اسماء مدح کے طریقے پر نعوت (صفات) کے طور پر جاری ہوں، تو تفرقه (التفرقة) زیادہ ظاہر ہوتی ہے۔ اور تفرقه (التفرقة) کے ذریعے ہی اس (اللہ) نے ہمیں اپنا تعارف کرایا، پس فرمایا: \"لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\" (کوئی چیز اس کے مانند نہیں ہے)۔ اور فرمایا: \"أَ فَمَنْ يَخْلُقُ كَمَنْ لا يَخْلُقُ\" (تو کیا جو پیدا کرتا ہے وہ اس جیسا ہے جو پیدا نہیں کرتا؟)۔ پس اس نے پیدا کرنے والے اور پیدا نہ کرنے والے کے درمیان فرق (الفرق) کیا۔ اور اشیاء کی حدود (الحدود) کو تفرقه (التفرقة) نے اشیاء کے درمیان ظاہر کیا۔ اور تفرقه (التفرقة) کے ذریعے مقامات اور احوال ظاہر ہوئے، اور مخلوق کے مراتب زیادہ ہوئے اور ان کے ذریعے امتیاز حاصل کیا۔ پس اللہ کے اسی (80) بندے ہیں جنہیں اس نے حقائقِ ایمان کے ذریعے محقق کیا۔ اور اللہ کے سو (100) بندے ہیں جنہیں اس نے حقائقِ نسب الٰہیہ اور اسماء کے ذریعے محقق کیا۔ اور اللہ کے چھ ہزار (6000) سے زائد بندے ہیں جنہیں اس نے حقائقِ نبوت محمدیہ کے ذریعے محقق کیا۔ اور اللہ کے تین سو (300) بندے ہیں جنہیں اس نے حقائقِ اخلاق الٰہیہ کے ذریعے محقق کیا۔ پس اس (اللہ) نے اپنے بندوں کے درمیان مراتب کے لحاظ سے فرق (الفرق) کیا۔ اور عینِ جمع (الجمع) ہی عینِ تفرقه (التفرقة) ہے، کیونکہ یہ کثرت پر دلیل ہے۔ اور اسے جمع (الجمع) صرف اس ایک عین (ذات) کی وجہ سے کہا گیا جو اس تفرقه (التفرقة) کو جمع کرتی ہے۔\n\nپس جس نے تفرقه (التفرقة) کے بارے میں کہا کہ یہ خلق (الخلق) بلا حق (الحق) کی طرف اشارہ ہے، تو اس کا مشہود (شہود) وہ ہے جو حدود (الحدود) نے اسے عطا کیا۔ اور حدود (الحدود) کا ظہور صرف خلق (الخلق) میں ہوا، کیونکہ ذات حق (الحق) کو نہیں پہچانا جاتا، اس لیے کہ وہ عالمین سے بے نیاز ہے، یعنی وہ اس سے منزہ ہے کہ کوئی علامت اس پر دلالت کرے۔ پس وہ بغیر حد کے معروف ہے اور حد کے ساتھ مجہول ہے۔ اور حدود (الحدود) نے خلق (الخلق) کے درمیان تفرقه (التفرقة) کو ظاہر کیا۔ اور اہل ذوق (الذوق) میں سے ہر انسان اپنی خبروں میں اپنے شہود (الشهود) اور ذوق (الذوق) کی منزل سے تجاوز نہیں کرتا، کیونکہ وہ اہل صدق ہیں جو ہمیشہ شہود (الشهود) سے خبر دیتے ہیں، نہ کہ خبر سے۔\n\nاور دقاق کا یہ قول کہ فرق (الفرق) وہ ہے جو تمہاری طرف منسوب ہو، تو یہ وہی ہے جو ہم نے ذکر کیا، کیونکہ تمہاری طرف صرف حدود (الحدود) ہی منسوب کی گئی ہیں، جبکہ ذات حق (الحق) کی طرف کوئی حد منسوب نہیں کی جاتی۔ اور جو کچھ بھی بندے کی طرف منسوب ہوتا ہے، اس کا انجام فنا (الفناء) اور عدم کی طرف ہے، اور جو کچھ ذات حق (الحق) کی طرف منسوب ہوتا ہے، اس کا انجام بقا (البقاء) اور ہستی (الوجود) کی طرف ہے۔ پس ان لوگوں میں سے ہو جاؤ جو ذات حق (الحق) کی طرف منسوب ہوں، نہ کہ خلق (الخلق) کی طرف۔ اور یہی اللہ تعالیٰ کے اس فرمان کا مفہوم ہے: \"مَا عِنْدَكُمْ يَنْفَدُ\" (جو کچھ تمہارے پاس ہے وہ ختم ہو جائے گا)۔ پس اس نے اس چیز کو نفاد (ختم ہونے) سے موصوف کیا جو اس نے ہماری طرف منسوب کی، اور لفظ \"ما\" ہر چیز پر دلالت کرتا ہے، جیسا کہ سیبویہ نے کہا ہے۔ اور \"وَمَا عِنْدَ الله بَاقٍ\" (اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے)۔ پس ہم میں سے جو اللہ کے پاس ہے، اس کے لیے بقا (البقاء) صحیح ہے، اور جو خلق (الخلق) کے پاس ہے، اس کے لیے نفاد (ختم ہونا) صحیح ہے۔ کیا تم نہیں دیکھتے کہ جو شخص غیر اللہ کا غلام ہو، جب موت آتی ہے تو ملکیت ختم ہو جاتی ہے اگر وہ آقا کی ملکیت میں ہو، پس وہ ختم ہو گئی۔ پس جو کچھ بھی مخلوق کی طرف منسوب ہے، وہ موت یا شہادت سے ختم ہو جاتا ہے۔ اور جو کچھ ختم ہو جاتا ہے، وہ اس سے جدا ہو جاتا ہے جس کے پاس وہ تھا۔ اور یہ بات ذات حق (الحق) میں نہیں پائی جاتی، کیونکہ کوئی چیز اس سے جدا نہیں ہوتی، اس لیے کہ وہ ہمارے ساتھ ہے اور اسی کی طرف تمام امور لوٹتے ہیں۔ پس یہ اس قول کا مفہوم ہے کہ فرق (الفرق) وہ ہے جو تمہاری طرف منسوب ہو۔\n\nاور جس نے کہا کہ فرق (الفرق) وہ ہے جو ذات حق (الحق) نے تمہیں تمہارے افعال میں بطور ادب دکھایا، تو وہ ان افعال کی طرف اشارہ کرتا ہے جنہیں ادب یہ اجازت نہیں دیتا کہ وہ اللہ کی طرف منسوب کیے جائیں، اگرچہ وہ اللہ کی طرف سے ہی ہوں، نہ کہ ان افعال کی طرف جو ادب اور حقیقت کے طور پر اللہ کی طرف منسوب کیے جاتے ہیں۔ اور بندوں کے افعال ان کے پاس صرف ان کے وجود کے زمانے تک ہی باقی رہتے ہیں اور اس کے بعد کے زمانے میں وہ ان سے زائل ہو جاتے ہیں۔ پس یہ دقاق کے قول کا مفہوم ہے، لہٰذا وہ معنی میں جمع ہو گئے، مگر اس قائل نے بعض افعال کو \"بطور ادب\" کہہ کر خاص کر دیا۔ پس جب ان افعال کے اعیان (ذوات) کو اللہ کی طرف منسوب کیا جاتا ہے تو وہ بقا (البقاء) سے متصف ہو جاتے ہیں، نہ کہ اپنے اعیان کی وجہ سے، بلکہ اس وجہ سے کہ وہ اللہ کے لیے مشہود ہیں۔ اور \"وَمَا عِنْدَ الله بَاقٍ\" (اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے)، جیسا کہ فعل تمہارے پاس اس وقت تک باقی رہتا ہے جب تک وہ تمہارے لیے مشہود ہو۔ پس جب تم اس کا شہود (الشهود) نہیں کرتے تو اس کا عین تمہارے شہود سے زائل ہو جاتا ہے۔ اسی لیے اس نے کہا: \"جو کچھ ذات حق (الحق) نے تمہیں تمہارے افعال میں دکھایا\"، اور اس نے اس چیز کا ذکر نہیں کیا جو وہ تمہیں دکھاتا ہے، جیسا کہ اس نے تمہارے افعال میں سے محمود (قابل تعریف) کا ذکر نہیں کیا، باوجود اس کے کہ وہ تمہاری طرف منسوب ہیں، پس اس نے \"بطور ادب\" کہا۔\n\nاور جس نے کہا کہ فرق (الفرق) عبودیت کا مشاہدہ ہے، تو اس نے بندے کو اس صفت کی طرف منسوب کیا جو اس کے ساتھ قائم ہے، اور اسے صرف اللہ کی طرف منسوب نہیں کیا جانا چاہیے۔ اور عبودیت (العبودية) بندے کی صفت ہے۔ پس جس نے اپنی عبودیت کا مشاہدہ کیا، وہ اس کے لیے تھا جس کا اس نے مشاہدہ کیا۔ اسی لیے اللہ کے بندوں کو عبودہ (العبودة) کی طرف منسوب کیا جاتا ہے نہ کہ عبودیت (العبودية) کی طرف۔ پس وہ بغیر نسبت کے اللہ کے بندے ہیں، برخلاف ان کی عبودیت (العبودية) کی نسبت کے، کیونکہ ذات حق (الحق) عبودیت (العبودية) کی نسبت کو قبول نہیں کرتا، کیونکہ یہ بندے کی صفت کا عین ہے، نہ کہ بندے کا عین۔ پس جس نے عبودیت (العبودية) کا مشاہدہ کیا، اس نے اللہ کا بندہ ہونے کا مشاہدہ نہیں کیا۔ پس اس چیز میں فرق (الفرق) کرو جو صفت کی طرف منسوب ہو اور اس چیز میں جو اللہ کی طرف مضاف ہو۔ اہل لسان (لغت دانوں) نے کہا ہے: رجل بین الخصوصیۃ (الخصوصية) اور الخصوصۃ (الخصوصة) کے درمیان، اور العبودیہ (العبودية) اور العبودہ (العبودة) کے درمیان فرق ہے۔ اور عبودیت (العبودية) اس (بندے) کی طرف نسبت ہے، اور عبودہ (العبودة) آقا (سید) کی طرف نسبت ہے۔\n\nاور جس نے کہا کہ فرق (الفرق) خلق (الخلق) کا اثبات ہے، تو یہ وہی ہے جو ان کے قول \"خلق بلا حق\" کے معنی میں پہلے گزر چکا ہے، مگر ان دونوں کے درمیان فرقان (الفرقان) ہے۔ کیونکہ اس نے \"خلق کا اثبات\" کہا، اور \"خلق کا وجود\" نہیں کہا، کیونکہ خلق (الخلق) کا عینِ وجود، ذات حق (الحق) کا عینِ وجود ہے۔ اور خلق (الخلق) اپنے عین کے لحاظ سے ثابت ہے، اور اس کا ثبوت ازل سے اس کی اپنی ذات کے لیے ہے۔ اور اس کا وجود (الوجود) سے متصف ہونا ایک حادث امر ہے جو اس پر طاری ہوا۔ ہم نے تمہیں اس لفظ کے مفہوم سے آگاہ کر دیا ہے۔ پس اس کا قول \"خلق کا اثبات\" یعنی ازل میں اللہ اور خلق (الخلق) کے درمیان فرق (الفرق) واقع ہوا۔ پس ذات حق (الحق) اعیان ثابتہ (الأعيان الثابتة) کا عین نہیں ہے، برخلاف اس حال کے جب وہ وجود (الوجود) سے متصف ہوں۔ پس وہ (اللہ) وجود (الوجود) سے موصوف کا عین ہے، نہ کہ وہ (اعیان ثابتہ)۔ اسی لیے اس قائل نے فرق (الفرق) میں کہا کہ یہ خلق (الخلق) کا اثبات ہے۔\n\nاور جس نے کہا کہ فرق (الفرق) اللہ کے لیے اغیار (غیروں) کا شہود (الشهود) ہے، اس کی مراد \"اللہ کی خاطر\" ہے۔ پس یہ لامِ علت ہے۔ پس وہ ذات حق (الحق) کے عینِ وجود (الوجود) میں اعیان ثابتہ (الأعيان الثابتة) کے احکام کا مشاہدہ کرتا ہے، پس وہ صرف ان کے حکم کے ساتھ ہی ظاہر ہوتا ہے۔ اسی لیے حدود (الحدود) ظاہر ہوئیں اور اعیان کے مراتب ذات حق (الحق) کے وجود (الوجود) میں ممتاز ہوئے، پس کہا گیا: املاک، افلاک، عناصر، مولدات، اجناس، انواع اور اشخاص۔ اور عینِ وجود (الوجود) ایک ہے، اور احکام مختلف ہیں، اعیان ثابتہ (الأعيان الثابتة) کے اختلاف کی وجہ سے، جو کہ ثبوت میں بلا شک اغیار ہیں، نہ کہ وجود (الوجود) میں۔ پس سمجھو۔\n\nاور جس نے کہا کہ تفرقه (التفرقة) ان کے احوال میں ان کے تنوع کا شہود (الشهود) ہے، اس کی مراد ذات حق (الحق) کے وجود (الوجود) میں ان کے احکام کا ظہور ہے، کیونکہ وہ متنوع ہیں، اور ذات حق (الحق) تنوع کو قبول نہیں کرتا۔ پس یہ ثابت ہوا کہ یہ اعیان کا حکم ہے، اور اس بندے کے لیے مشہود (الشهود) تنوع ہے۔ پس اس کے لیے مشہود اعیان ہیں، لہٰذا اس نے ان کے اور وجود (الوجود) کے درمیان فرق (الفرق) کیا۔\n\nاور جس نے تفرقه (التفرقة) کے بارے میں کہا:\n\n> میں نے اس کے ذریعے جمع (الجمع) کیا اور تفرق (التفرقة) کیا،\n> پس وصل کی زیادتی عدد میں دوگنی ہے۔\n\nپس اس کی مراد اعداد کے مراتب میں واحد کا ظہور ہے۔ پس واحد کے ظہور سے دو، تین، اور چار کے اعیان ظاہر ہوئے، یہاں تک کہ لامتناہی تک۔ اور یہ وصلہ (الوصلة) کی انتہا ہے کہ کوئی چیز اس چیز کا عین ہو جو ظاہر ہوئی، اور یہ نہ جانا جائے کہ وہ وہی ہے۔ جیسا کہ تم نے نبی اکرم ﷺ کو خواب میں دیکھا کہ انہوں نے محدث ابو محمد ابن حزم کو گلے لگایا، پس ایک دوسرے میں غائب ہو گیا، اور ہم نے صرف ایک کو دیکھا، اور وہ رسول اللہ ﷺ تھے۔ پس یہ وصلہ (الوصلة) کی انتہا ہے، جسے اتحاد (الاتحاد) سے تعبیر کیا جاتا ہے، یعنی دو چیزیں ایک کا عین ہیں، وجود (الوجود) میں کوئی زائد امر نہیں، جیسا کہ زید عمرو کا عین نہیں ہے، بلکہ اس نوعِ انسانی کے اشخاص کا عین انسانیت میں ہے۔ پس وہ انسانیت کے لحاظ سے وہی ہے، اور شخصیت کے لحاظ سے وہ نہیں ہے۔ اور واحد کا اپنے آپ پر دو کے مرتبے پر جھکاؤ ہی دو کا عینِ ظہور ہے، اور وہاں عینِ واحد کے سوا کچھ نہیں۔ اور اسی طرح باقی اعداد جو لامتناہی ہیں۔ پس اگر تم سلیم عقل والے ہو تو تفرقه (التفرقة) کے معنی کو محقق کرو۔ اور \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "## باب دویست و بیست و سوم در معرفت حال تفرقه (التفرقة)\n\nچون جمع شدی، تفرقه را اثبات کردی *** چنان که قرآن و فرقان را محقق ساختی\n\nو عین (حقیقت) یکی است و حکم متفاوت *** و بر آنچه گفتم برهان اقامه نمودم\n\nپس جمع و فرق (التفرقة) همواره حالی ناقص است *** پس دادگر باش و اگر انسان کاملی (الإنسان الکامل) هستی، یکی باش\n\nو طریقۀ جبرئیل و صاحبش (پیامبر) را لازم گیر *** آنگاه که اسلام و ایمان را برای تو مقرر کردند\n\nو سپس تمام (کمال) آمد با آنچه پس از آن دو صحیح شد *** پس احسان و احسان را برای تو مقرر کردند\n\nپس اینها چهار چیزند که پنجمی ندارند *** جز مؤید (تأیید کننده) که حق (الحق) سبحان جلیل است\n\n### [اینکه تفرقه (التفرقة) عبارت است از خلق بدون حق (الحق)]\n\nبدان که تفرقه (التفرقة) نزد برخی از قوم (صوفیه) اشاره‌ای است از کسی که به خلق بدون حق (الحق) اشاره کرده است. و نزد ابوعلی دقاق، فرق (التفرقة) چیزی است که به تو نسبت داده می‌شود. و نزد برخی از ایشان، فرق چیزی است که حق (الحق) از افعال تو به جهت ادب به تو شهود (الشهود) می‌دهد. و نزد برخی دیگر، فرق مشاهده عبودیت است. و گفته شده: فرق، اثبات خلق است. و گفته شده: تفرقه (التفرقة)، شهود اغیار برای حق (الحق) است. و گفته شده: تفرقه (التفرقة)، مشاهده تنوع خلق در احوالشان است. و مستند مقام تفرقه (التفرقة) از علم الهی، صفت حق (الحق) است: «سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ» (به زودی برای رسیدگی به شما ای دو گروه جن و انس فارغ خواهیم شد). و آن، انقضای مدتی است که مقدار آن در علم خداوند سبقت یافته است، و آن زمان زندگی دنیا در هر شخص است.\n\n### [اینکه اصل همه چیزها تفرقه (التفرقة) است]\n\nو بدان که اصل همه چیزها تفرقه (التفرقة) است، و اولین چیزی که در اسماء الهی ظاهر شد، تفرقه (التفرقة) بود. پس احکام آنها به تفاوت معانی‌شان متفرق شد، تا جایی که اگر انسان به آنها از حیث دلالت همه آنها بر عین (حقیقت) بنگرد، با وجود فرقان (التفرقة) معلوم میان معانی آنها که در آن تعقل می‌شود، که این عین به فلان دلیل چنین نامیده شده است، به ویژه اگر اسماء به منزله نعت‌ها بر طریق مدح جاری شوند، تفرقه (التفرقة) آشکارتر است. و حق (الحق) سبحانه به واسطه تفرقه (التفرقة) خود را به ما شناساند و فرمود: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست) و فرمود: «أَ فَمَنْ يَخْلُقُ كَمَنْ لا يَخْلُقُ» (آیا کسی که می‌آفریند مانند کسی است که نمی‌آفریند). پس میان کسی که می‌آفریند و کسی که نمی‌آفریند فرق گذاشت. و حدود اشیاء، تفرقه (التفرقة) میان اشیاء را آشکار ساخت. و به واسطه تفرقه (التفرقة)، مقامات و احوال ظاهر شدند و مراتب خلق زیاد شد و به واسطه آن از هم متمایز گشتند. پس خداوند هشتاد بنده دارد که آنها را به حقایق ایمان محقق ساخته است، و صد بنده دارد که آنها را به حقایق نسبت‌های الهی و اسماء محقق ساخته است، و شش هزار بنده و بیشتر دارد که آنها را به حقایق نبوت محمدیه (الحقیقة المحمدیة) محقق ساخته است، و سیصد بنده دارد که آنها را به حقایق اخلاق الهی محقق ساخته است. پس حق (الحق) عز و جل میان بندگانش به واسطه مراتب فرق گذاشت. و عین جمع، همان عین تفرقه (التفرقة) است، زیرا که دلیل بر کثرت است. و جمع نامیده شد به خاطر عین واحدی که این تفرقه (التفرقة) را جمع می‌کند. پس سخن کسی که در مورد تفرقه (التفرقة) گفت: «آن اشاره‌ای است از کسی که به خلق بدون حق (الحق) اشاره کرده است»، مشهود او چیزی است که حدود به او داده است. و حدود ظهوری نداشتند مگر در خلق، زیرا حق (الحق) شناخته نمی‌شود، چرا که او غنی از عالمیان است؛ یعنی او منزه از آن است که علامتی بر او دلالت کند. پس او به غیر حد شناخته شده و به حد مجهول است. و حدود، تفرقه (التفرقة) میان خلق را آشکار ساخت. و هر انسانی از اهل ذوق (الذوق) در اخبار خود از منزلت شهود (الشهود) و ذوق (الذوق) خود فراتر نمی‌رود، زیرا آنان اهل صدق هستند و هرگز جز از شهود (الشهود) خبر نمی‌دهند نه از خبر (نقل). و اما سخن دقاق که گفت: «فرق (التفرقة) چیزی است که به تو نسبت داده شده است»، همان است که ذکر کردیم، زیرا جز حدود به تو نسبت داده نشده است، چرا که حدی به حق (الحق) نسبت داده نمی‌شود. و هر آنچه به بنده نسبت داده می‌شود، سرانجامش به فنا (الفناء) و نیستی است، و آنچه به حق (الحق) نسبت داده می‌شود، سرانجامش به بقا (البقاء) و وجود (الوجود) است. پس از کسانی باش که به حق (الحق) نسبت داده می‌شوند نه به خلق. و این معنای سخن خداوند متعال است: «ما عِنْدَكُمْ يَنْفَدُ» (آنچه نزد شماست از بین می‌رود). پس آنچه را که به ما نسبت داد، به زوال وصف کرد، و لفظ «ما» (آنچه) بر هر چیزی دلالت می‌کند، چنان که سیبویه گفته است. و «وَ ما عِنْدَ الله باقٍ» (و آنچه نزد خداست باقی می‌ماند). پس هر کس از ما که نزد خدا باشد، بقا (البقاء) برای او صحیح است، و هر کس که نزد خلق باشد، زوال برای او صحیح است. آیا نمی‌بینی کسی که بنده غیر خداست (از بردگان)، وقتی مرگ فرا رسد، اگر ملکیت از آنِ سَرور او باشد، آن ملکیت مرتفع می‌شود و زوال می‌یابد؟ پس هر آنچه به مخلوق نسبت داده شود، با مرگ یا شهادت زوال می‌یابد. و هر آنچه زوال یابد، از نزد کسی که نزد او بوده جدا شده است. و این در حق (الحق) یافت نمی‌شود، زیرا چیزی از او جدا نمی‌شود، چرا که او با ماست و امور به سوی او باز می‌گردد. پس این معنای سخن اوست که: «فرق (التفرقة) چیزی است که به تو نسبت داده می‌شود».\n\nو اما سخن کسی که گفت: «فرق (التفرقة) چیزی است که حق (الحق) از افعال تو به جهت ادب به تو شهود (الشهود) می‌دهد»، اشاره به افعالی دارد که ادب اقتضا نمی‌کند که به خداوند نسبت داده شوند، اگرچه از جانب خداوند باشند، نه به افعالی که به جهت ادب و حقیقت به خداوند نسبت داده می‌شوند. و افعال بندگان نزد بنده بقایی ندارند مگر در همان زمان وجودشان، و در زمانی که پس از زمان وجودشان می‌آید، از او زایل می‌شوند. پس این معنای سخن دقاق است، با این تفاوت که این گوینده برخی از افعال را با گفتن «ادباً» تخصیص داده است. پس اگر اعیان این افعال به خداوند نسبت داده شوند، به بقا (البقاء) متصف می‌شوند، نه به خاطر اعیانشان، بلکه به خاطر اینکه مشهود حق (الحق) هستند. و «وَ ما عِنْدَ الله باقٍ» (و آنچه نزد خداست باقی می‌ماند)، همان‌گونه که فعل نزد تو باقی می‌ماند تا زمانی که مشهود تو باشد. پس اگر آن را مشاهده نکنی، عین آن از شهود (الشهود) تو زایل می‌شود. و به همین دلیل گفت: «آنچه حق (الحق) از افعال تو به تو شهود (الشهود) می‌دهد» و متعرض آنچه که او به تو شهود می‌دهد نشد، همان‌گونه که متعرض افعال ستوده تو نشد، با وجود اینکه به تو نسبت داده می‌شوند، و گفت: «ادباً».\n\nو اما سخن کسی که گفت: «فرق (التفرقة) مشاهده عبودیت است»، او بنده را به صفتی که در او قائم است نسبت داده است، در حالی که شایسته نیست جز به خداوند نسبت داده شود. و عبودیت صفتی برای بنده است. پس کسی که عبودیت خود را مشاهده کند، برای کسی مشاهده کرده است که او را مشاهده کرده است. و به همین دلیل بندگان خدا به عبوده (بندگی) نسبت داده می‌شوند نه به عبودیت (صفت بندگی). پس آنان عبیدالله (بندگان خدا) هستند بدون نسبت (به صفت)، برخلاف نسبت دادنشان به عبودیت، زیرا حق (الحق) نسبت عبودیت را نمی‌پذیرد، چون عبودیت عین صفت بنده است نه عین بنده. پس کسی که عبودیت را مشاهده کند، مشاهده نکرده است که بنده خداست. پس فرق بگذار میان آنچه به صفت نسبت داده می‌شود و آنچه به خداوند اضافه می‌شود. اهل لغت گفته‌اند: مردی میان خصوصیت و خصوصه (ویژگی) و میان عبودیت و عبوده (بندگی). و عبودیت نسبت به آن (صفت) است و عبوده نسبت به سَرور (خداوند) است. و اما سخن کسی که گفت: «فرق (التفرقة) اثبات خلق است»، همان‌گونه است که در معنای سخنشان گذشت که: «اشاره به خلق بدون حق (الحق) است»، جز اینکه میان آن دو فرقانی (جدایی) وجود دارد. زیرا او گفت: «اثبات خلق» و نگفت: «وجود خلق»، چرا که عین وجود (الوجود) خلق، عین وجود (الوجود) حق (الحق) است. و خلق از حیث عین خود ثابت است، و ثبوت آن برای خودش ازلاً است، و متصف شدن آن به وجود (الوجود) امری حادث است که بر آن عارض شده است. ما تو را به آنچه از این لفظ تعقل می‌شود، شناساندیم. پس سخن او که «اثبات خلق» است، یعنی در ازل فرق میان خداوند و خلق واقع شد. پس حق (الحق) عین اعیان ثابته (الأعيان الثابتة) نیست، برخلاف حال اتصاف آنها به وجود (الوجود). پس او تعالی عین موصوف به وجود (الوجود) است نه آنها. به همین دلیل این گوینده در مورد فرق (التفرقة) گفت: «آن اثبات خلق است».\n\nو اما سخن کسی که گفت: «فرق (التفرقة) شهود اغیار برای حق (الحق) است»، منظورش «به خاطر حق (الحق)» بوده است. پس در عین وجود (الوجود) حق (الحق)، احکام اعیان ثابته (الأعيان الثابتة) در او مشاهده می‌شود. پس جز به حکم آنها ظاهر نمی‌شود. و به همین دلیل حدود ظاهر شد و مراتب اعیان در وجود (الوجود) حق (الحق) متمایز گشت. پس گفته شد: املاک، افلاک، عناصر، موالید، اجناس، انواع و اشخاص. و عین وجود (الوجود) یکی است و احکام متفاوت است به دلیل اختلاف اعیان ثابته (الأعيان الثابتة) که بدون شک در ثبوت (نه در وجود) اغیار هستند. پس بفهم. و اما سخن کسی که گفت: «تفرقه (التفرقة)، شهود تنوع آنها در احوالشان است»، منظورش ظهور احکام آنها در وجود (الوجود) حق (الحق) است، زیرا آنها متنوع هستند و حق (الحق) تنوع را نمی‌پذیرد. پس ثابت شد که آن حکم اعیان است. و مشهود این بنده، تنوع است. پس مشهود او اعیان است. پس میان آنها و وجود (الوجود) فرق گذاشت.\n\nو اما سخن کسی که در مورد تفرقه (التفرقة) گفت:\n\n> جمعت وفرقت عني به *** ففرط التواصل مثنى العدد\n> (جمع کردم و به واسطه او از خود تفرقه انداختم *** پس افراط در وصل، دوگانگی عدد است)\n\nاو ظهور واحد در مراتب اعداد را اراده کرده است. پس اعیان دو، سه، و چهار تا بی‌نهایت، با ظهور واحد ظاهر شدند. و این نهایت وصله (اتصال) است که شیء عین همان چیزی باشد که ظاهر شده است و شناخته نشود که او همان است. چنان که پیامبر (صلی الله علیه وسلم) را در خواب دیدم که ابومحمد ابن حزم محدث را در آغوش گرفته بود، پس واحد در دیگری غایب شد و ما جز یکی ندیدیم و آن رسول خدا (صلی الله علیه وسلم) بود. پس این نهایت وصله است، و همان است که به اتحاد (الاتحاد) تعبیر می‌شود؛ یعنی دوگانگی عین واحد است و در وجود (الوجود) امر زائدی نیست، چنان که زید عین عمرو نیست، بلکه عین اشخاص این نوع انسانی در انسانیت است. پس او از حیث انسانیت، اوست، و از حیث شخصیت، او نیست. و بازگشت واحد به خود بر مرتبه دوگانگی، عین ظهور دوگانگی است، و در آنجا جز عین واحد نیست. و همین‌گونه است در مورد بقیه اعداد که بی‌نهایت هستند. پس معنای تفرقه (التفرقة) را دریاب اگر صاحب خرد سلیم هستی. و «وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 2
}