{
  "id": 27,
  "title": {
    "ar": "الباب السابع والعشرون في معرفة أقطاب صل فقد نويت وصالك وهو من منزل العالم النوراني",
    "en": "Chapter Twenty-Seven: On the Gnosis of the Poles (أقطاب). Unite, for I have intended your union, and it is from the station of the Luminous World (العالم النوراني).",
    "ur": "باب ستائیسواں: اقطاب (أقطاب) کی معرفت کے بیان میں، (جس کا عنوان ہے:) \"وصل کر، کیونکہ میں نے تیرے وصال کی نیت کی ہے،\" اور یہ (معرفت) عالم نورانی (العالم النوراني) کے مقام سے ہے۔",
    "fa": "باب بیست و هفتم در معرفت اقطابی که [به مقام] وصل رسیده‌اند، و آن از منزل عالم نورانی است."
  },
  "content": {
    "ar": "## «الباب السابع والعشرون في معرفة أقطاب صل فقد نويت وصالك وهو من منزل العالم النوراني»\n\n\n> ولو لا النور ما اتصلت عيون *** بعين المبصرات ولا رأتها\n\n\n> ولو لا الحق ما اتصلت عقول *** بأعيان الأمور فأدركتها\n\n\n> إذا سألت عقول عن ذوات *** تعد مغايرات أنكرتها\n\n\n> شو قالت ما علمنا غير ذات *** تمد ذوات خلق أظهرتها\n\n\n> شهي المعنى ونحن لها حروف *** فمهما عينت أمرا عنتها\n\n\n### [الصلاة: منازلها ومناهلها]\n\n\n### [1- محبة الرب تسبق محبة العبد]\n\n\nاعلم أيها الولي الحميم تولاك الله بعنايته إن الله تعالى يقول في كتابه العزيز فَسَوْفَ يَأْتِي الله بِقَوْمٍ يُحِبُّهُمْ ويُحِبُّونَهُ فقدم محبته إياهم على محبتهم إياه وقال أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فَلْيَسْتَجِيبُوا لِي فقدم إجابته لنا إذا دعوناه على إجابتنا له إذا دعانا وجعل الاستجابة من العبيد لأنها أبلغ من الإجابة فإنه لا مانع له من الإجابة سبحانه فلا فائدة للتأكيد وللإنسان موانع من الإجابة لما دعاه الله إليه وهي الهوى والنفس والشيطان والدنيا فلذلك أمر بالاستجابة\nفإن الاستفعال أشد في المبالغة من الأفعال وأين الاستخراج من الإخراج ولهذا يطلب الكون من الله العون في أفعاله ويستحيل على الله أن يستعين بمخلوق قال تعالى تعليما لنا أن نقول وإِيَّاكَ نَسْتَعِينُ من هذا الباب فلهذا قال في هذا الباب صل فقد نويت وصالك فقد قدم الإرادة منه لذلك فقال صل فإذا تعملت في الوصلة فذلك عين وصلته بك فلذلك جعلها نية لا عملا\n\n\n### [2- القرب الإلهي الخاص والعام‏]\n\n\nقال رسول الله صلى الله عليه وسلم يقول الله تعالى من تقرب إلي شبرا تقربت منه ذراعا\n\n\nوهذا قرب مخصوص يرجع إلى ما تتقرب إليه سبحانه به من الأعمال والأحوال فإن القرب العام قوله تعالى ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ فضاعف القرب بالذراع فإن الذراع ضعف للبشر أي قوله صل هو قرب ثم تقريب إليه شبرا فتبدي لك إنك ما تقربت إليه إلا به لأنه لو لا ما دعاك وبين لك طريق القربة وأخذ بناصيتك فيها ما تمكن لك أن تعرف الطريق التي تقرب منه ما هي ولو عرفنها لم يكن لك حول ولا قوة إلا به ولما كان القرب بالسلوك والسفر إليه لذلك كان من صفته النور لنهتدي به في الطريق كما قال تعالى جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِها في ظُلُماتِ الْبَرِّ وهو السلوك الظاهر بالأعمال البدنية والْبَحْرِ وهو السلوك الباطن المعنوي بالأعمال النفسية فأصحاب هذا الباب معارفهم مكتسبة لا موهوبة وأكلهم من تحت أقدامهم أي من كسبهم لها واجتهادهم في تحصيلها ولو لا ما أرادهم الحق لذلك ما وفقهم ولا استعملهم حين طرد غيرهم بالمعنى ودعاهم بالأمر فحرمهم الوصول بحرمانه إياهم استعمال الأسباب التي جعلها طريقا إلى الوصول من حضرة القرب ولذلك بشرهم فقال صل فقد نويت وصالك فسبقت لهم العناية فسلكوا\n\n\n### [3- لباس النعلين في الصلاة]\n\n\nوهم الذين أمرهم الله بلباس النعلين في الصلاة إذ كان القاعد لا يلبس النعلين وإنما وضعت للماشي فيها فدل إن المصلي يمشي في صلاته ومناجاة ربه في الآيات التي يناجيه فيها منزلا منزلا كل آية منزل وحال فقال لهم يا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ قال الصاحب لما نزلت هذه الآية أمرنا فيها بالصلاة في النعلين فكان ذلك تنبيها من الله تعالى للمصلي أنه يمشي على منازل ما يتلوه في صلاته من سور القرآن إذ كانت السور هي المنازل لغة قال النابغة\n\n\n> أ لم تر أن الله أعطاك سورة *** ترى كل ملك دونها يتذبذب‏\n\n\nأراد منزلة وقيل لموسى عليه السلام فَاخْلَعْ نَعْلَيْكَ أي قد وصلت المنزل فإنه كلمة الله بغير واسطة بكلامه سبحانه بلا ترجمان ولذلك أكده في التعريف لنا بالمصدر فقال تعالى وكَلَّمَ الله مُوسى‏ تَكْلِيماً\n\n\n### [4- خلع النعلين لمن وصل ومنازل الصلاة]\n\n\nومن وصل إلى المنزل خلع نعليه فبانت رتبة المصلي بالنعلين وما معنى المناجاة في الصلاة وإنها ليست بمعنى الكلام الذي حصل لموسى عليه السلام فإنه قال في المصلي يناجي والمناجاة فعل فاعلين فلا بد من لباس النعلين إذ كان المصلي مترددا بين حقيقتين والتردد بين أمرين يعطي المشي بينهما بالمعنى دل عليه باللفظ لباس النعلين ودل عليه‏\n\n\nقول الله تعالى بترجمة النبي صلى الله عليه وسلم عنه قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ولعبدي ما سأل‏\n\n\nثم قال يقول العبد الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ فوصفه إن العبد مع نفسه في قوله الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ يسمع خالقه ومناجيه ثم يرحل العبد من منزل قوله إلى منزل سمعه ليسمع ما يجيبه الحق تعالى على قوله وهذا هو السفر فلهذا لبس نعليه ليسلك بهما الطريق الذي بين هذين المنزلين فإذا رحل إلى منزل سمعه سمع الحق يقول له حمدني عبدي فيرحل من منزل سمعه إلى منزل قوله فيقول الرَّحْمنِ الرَّحِيمِ فإذا فرغ رحل إلى منزل سمعه فإذا نزل سمع الحق تعالى يقول له أثنى على عبدي فلا يزال مترددا في مناجاته قولا ثم له رحلة أخرى من حال قيامه في الصلاة إلى حال ركوعه فيرحل من صفة القيومية إلى صفة العظمة فيقول سبحان ربي العظيم وبحمده ثم يرفع وهو رحلته من مقام التعظيم إلى مقام النيابة فيقول سمع الله لمن حمده‏\n\n\nقال النبي صلى الله عليه وسلم إن الله قال على لسان عبده سمع الله لمن حمده فقولوا ربنا لك الحمد\n\n\nفلهذا جعلنا الرفع من الركوع نيابة عن الحق ورجوعا إلى القيومية فإذا سجد اندرجت العظمة في الرفعة الإلهية فيقول الساجد سبحان ربي الأعلى وبحمده فإن السجود يناقض العلو فإذا خلص العلو لله ثم رفع رأسه من السجود واستوى جالسا وهو قوله الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ فيقول رب اغفر لي وارحمني واهدني وارزقني واجبرني وعافني واعف عني‏\n\n\n### [5- المصلي مسافر من حال إلى حال‏]\nمنازل ومناهل في الصلاة فعلا فهو مسافر من حال إلى حال فمن كان حاله السفر دائما كيف لا يقال له البس نعليك أي استعن في سيرك بالكتاب والسنة وهي زينة كل مسجد فإن أحوال الصلاة وما يطرأ فيها من كلام الله وما يتعرض في ذلك من الشبه في غوامض الآيات المتلوة وكون الإنسان في الصلاة يجعل الله في قبلته فيجده فهذه كلها بمنزلة لشوك والوعر الذي يكون بالطريق ولا سيما طريق التكليف فأمر بلباس النعلين ليتقي بهما ما ذكرناه من الأذى لقدمي السالك اللتين هما عبارة عن ظاهره وباطنه فلهذا جعلناهما الكتاب والسنة وأما نعلا موسى عليه السلام فليستا هذه فإنه قال له ربه فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوادِ الْمُقَدَّسِ فروينا أنهما كانتا من جلد حمار ميت فجمعت ثلاثة أشياء الشي‏ء الواحد الجلد وهو ظاهر الأمر أي لا تقف مع الظاهر في كل الأحوال والثاني البلادة فإنها منسوبة إلى الحمار والثالث كونه ميتا غير مذكى والموت الجهل وإذا كنت ميتا لا تعقل ما تقول ولا ما يقال لك والمناجي لا بد أن يكون بصفة من يعقل ما يقول ويقال له فيكون حي القلب فطنا بمواقع الكلام غواصا على المعاني التي يقصدها من يناجيه بها فإذا فرغ من صلاته سلم على من حضر سلام القادم من عند ربه إلى قومه بما أتحفه به‏\n\n\n### [6- سر لباس النعلين في الصلاة]\n\n\nفقد نبهتك على سر لباس النعلين في الصلاة في ظاهر الأمر وما المراد بهما عند أهل طريق الله تعالى من العارفين‏\n\n\nقال صلى الله عليه وسلم الصلاة نور والنور يهتدى به‏\n\n\nواسم الصلاة مأخوذة من المصلى وهو المتأخر الذي يلي السابق في الحلبة ولهذا ترجم هذا الباب بالوصلة وجعله من عالم النور ولأهل هذا المشهد نور خلع النعلين ونور لباس النعلين فهم المحمديون الموسويون المخاطبون من شجر الخلاف بلسان النور المشبه بالمصباح وهو نور ظاهر يمده نور باطن في زيت من شجرة زيتونة مباركة في خط الاعتدال منزهة عن تأثير الجهات كما كان الكلام لموسى عليه السلام من شجرة فهو نُورٌ عَلى‏ نُورٍ أي نور من نور فأبدل حرف من بعلي لما يفهم به من قرينة الحال وقد تكون على على بابها فإن نور السراج الظاهر يعلو حسا على نور الزيت الباطن وهو الممد للمصباح فلو لا رطوبة الدهن تمد المصباح لم يكن للمصباح ذلك الدوام وكذلك إمداد التقوى للعلم العرفاني الحاصل منها في قوله تعالى واتَّقُوا الله ويُعَلِّمُكُمُ الله وقوله تعالى إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً لا يقطع ذلك العلم الإلهي فنور الزيت باطن في الزيت محمول فيه يسرى منه معنى لطيف في رقيقة من رقائق الغيب لبقاء نور المصباح ولا لأقطاب هذا المقام أسرار منها سر الإمداد وسر النكاح وسر الجوارح وسر الغيرة وسر العنين وهو الذي لا يقوم بالنكاح وسر دائرة الزمهرير وسر وجود الحق في السراب وسر الحجب الإلهية وسر نطق الطير والحيوان وسر البلوغ وسر الصديقين والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Twenty-Seven: Concerning the Knowledge of the Poles (أقطاب) of \"Pray (صل), for I have intended your union (وصالك),\" and this belongs to the station (منزل) of the Luminous World (العالم النوراني).\n\nWere it not for the Light (النور), eyes would not connect\nWith the essence of visible things, nor would they see them.\n\nWere it not for The Real (الحق), intellects would not connect\nWith the essences (أعيان) of matters, and thus perceive them.\n\nIf intellects were asked about Essences (ذوات)\nThat are counted as distinct, they would deny them.\n\nThey would say: \"We know no Essence other than One\nThat sustains the essences of creation (ذوات خلق) which It manifested.\"\n\nIt is the desired Meaning, and we are but Its letters;\nWhatever thing It specifies, It intends it.\n\n### Prayer: Its Stations and Sources\n\n### 1. The Lord's Love Precedes the Servant's Love\n\nKnow, O intimate friend (الولي الحميم)—may Allah encompass you with His care—that Allah the Exalted says in His Glorious Book: <<فَسَوْفَ يَأْتِي الله بِقَوْمٍ يُحِبُّهُمْ ويُحِبُّونَهُ>> (Allah will bring forth a people whom He loves and who love Him). He placed His love for them before their love for Him. And He said: <<أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فَلْيَسْتَجِيبُوا لِي>> (I answer the call of the caller when he calls upon Me; so let them respond to Me). He placed His answering of us when we call upon Him before our responding to Him when He calls upon us. He made the response from the servants *Istijābah* (الاستجابة - emphatic response) because it is more forceful than *Ijābah* (الإجابة - simple response). For He, glory be to Him, has no impediment to *Ijābah*, so there is no benefit in emphasis (for Him). But the human being has impediments to *Ijābah* regarding what Allah has called him to, namely: caprice (الهوى), the lower self (النفس), Satan, and the world (الدنيا). Therefore, He commanded *Istijābah*.\n\nFor the *Istif'āl* form is stronger in emphasis than the *Af'āl* form. Where is *Istikhrāj* (seeking extraction) compared to *Ikhraj* (extraction)? For this reason, creation seeks aid from Allah in its actions, while it is impossible for Allah to seek aid from a creature. The Exalted said, teaching us to say: <<وإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help), which belongs to this category. Therefore, He said in this chapter: \"Pray (صل), for I have intended your union (وصالك).\" He thus placed the intention (الإرادة) for this union first, saying \"Pray.\" If you exert yourself in the union (الوصلة), that is the very essence of His union with you. That is why He made it an intention (نية), not an action (عملا).\n\n### 2. The Specific and General Divine Nearness\n\nThe Messenger of Allah (peace and blessings be upon him) said that Allah the Exalted says: \"Whoever draws near to Me by a span, I draw near to him by a cubit.\"\n\nThis is a specific nearness (قرب مخصوص) that relates to the deeds and spiritual states (الأحوال) by which one draws near to Him, glory be to Him. The general nearness (القرب العام) is His saying, the Exalted: <<ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ>> (And We are nearer to him than his jugular vein) and <<ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ>> (And We are nearer to him than you, but you do not perceive). He doubled the nearness by the cubit (ذراع), for the cubit is double the span (شبر) for the human. That is, His saying \"Pray (صل)\" is nearness, followed by drawing near to Him by a span. This reveals to you that you only drew near to Him *by* Him, because had He not called you, shown you the path of nearness (القربة), and taken you by your forelock in it, you would not have been able to know what the path that draws near to Him is. Even if you had known it, you would have had no might or power except through Him. Since nearness is achieved through spiritual journeying (السلوك) and traveling toward Him, His description was Light (النور), so that we might be guided by it on the path, just as the Exalted said: <<جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِها في ظُلُماتِ الْبَرِّ>> (He has made the stars for you, that you may be guided by them in the darkness of the land)—which is the apparent journeying (السلوك الظاهر) through physical deeds—<<وَالْبَحْرِ>> (and the sea)—which is the inward, spiritual journeying (السلوك الباطن المعنوي) through psychic deeds. Thus, the gnosis (معارف) of the people of this chapter is acquired (مكتسبة), not bestowed (موهوبة). Their sustenance is from beneath their feet, meaning from their earning it and their striving to attain it. Had The Real (الحق) not willed them for this, He would not have granted them success nor employed them, while He drove others away by the meaning and called them by the command. He deprived them of arrival (الوصول) by depriving them of employing the means (الأسباب) which He made the path to arrival from the Presence of Nearness (حضرة القرب). Therefore, He gave them glad tidings, saying: \"Pray (صل), for I have intended your union (وصالك).\" Thus, Divine Care (العناية) preceded them, and they journeyed.\n\n### 3. Wearing Sandals in Prayer\n\nThey are those whom Allah commanded to wear sandals (النعلين) during the Prayer (الصلاة), since the one who sits does not wear sandals; they were only made for the one who walks in them. This indicates that the one who prays is walking in his prayer and in his intimate conversation (مناجاة) with his Lord through the verses (الآيات) in which he converses with Him, station by station (منزلا منزلا), each verse being a station and a state (حال). He said to them: <<يا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ>> (O Children of Adam, take your adornment at every place of prostration). The Companion said: When this verse was revealed, we were commanded therein to pray in sandals. This was an admonition from Allah the Exalted to the worshipper that he is walking upon the stations (منازل) of what he recites in his prayer from the chapters (سور) of the Quran, since the chapters are linguistically called stations. Al-Nabigha said:\n\nHave you not seen that Allah gave you a *sūrah* (station)\nBeneath which every king trembles?\n\nHe meant a station (منزلة). And Moses (peace be upon him) was told: <<فَاخْلَعْ نَعْلَيْكَ>> (Remove your sandals), meaning: you have reached the station (المنزل). For he was the Word of Allah (كلمة الله) without an intermediary, by His speech, glory be to Him, without a translator. That is why He confirmed this for us by using the verbal noun (المصدر) in the definition, saying the Exalted: <<وكَلَّمَ الله مُوسى‏ تَكْلِيماً>> (And Allah spoke to Moses, speaking).\n\n### 4. Removing Sandals for the One Who Arrives, and the Stations of Prayer\n\nWhoever arrives at the station removes his sandals. Thus, the rank of the one who prays *with* sandals becomes clear, as does the meaning of the intimate conversation (مناجاة) in the Prayer, and that it is not the same as the speech (الكلام) that Moses (peace be upon him) received. For He said regarding the worshipper that he *yūnājī* (converses intimately), and *munājāh* is an action involving two agents. Therefore, the wearing of sandals is necessary, since the worshipper is oscillating (مترددا) between two realities (حقيقتين). Oscillation between two things implies walking between them in meaning, which is indicated literally by the wearing of sandals. It is also indicated by:\n\nThe saying of Allah the Exalted, translated by the Prophet (peace and blessings be upon him) on His behalf: \"I have divided the Prayer between Myself and My servant into two halves: half for Me and half for My servant, and My servant shall have what he asks for.\"\n\nThen He said: The servant says: <<الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (All praise is due to Allah, Lord of the Worlds). He described the servant as being with himself when he says <<الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>>, hearing his Creator and the One conversing with him. Then the servant journeys (يرحل) from the station of his saying (منزل قوله) to the station of his hearing (منزل سمعه) to hear what The Real (الحق) the Exalted answers to his saying. This is the journeying (السفر). Therefore, he wears his sandals to traverse the path between these two stations. When he journeys to the station of his hearing, he hears The Real saying to him: \"My servant has praised Me.\" Then he journeys from the station of his hearing to the station of his saying, and he says: <<الرَّحْمنِ الرَّحِيمِ>> (The Most Compassionate, the Most Merciful). When he finishes, he journeys to the station of his hearing, and when he descends, he hears The Real the Exalted saying to him: \"My servant has extolled Me.\" He continues to oscillate in his intimate conversation through speech. Then he has another journey from the state of standing (حال قيامه) in the Prayer to the state of bowing (حال ركوعه). He journeys from the Attribute of Self-Subsistence (القيومية) to the Attribute of Magnificence (العظمة), and says: \"Glory be to my Lord, the Magnificent, and praise be to Him.\" Then he rises, which is his journey from the station of magnification (مقام التعظيم) to the station of representation (مقام النيابة), and says: \"Allah hears the one who praises Him.\"\n\nThe Prophet (peace and blessings be upon him) said: \"Indeed, Allah said upon the tongue of His servant: 'Allah hears the one who praises Him,' so say: 'Our Lord, to You belongs the praise.'\"\n\nTherefore, we made the rising from bowing a representation (نيابة) on behalf of The Real and a return to Self-Subsistence (القيومية). When he prostrates, Magnificence is subsumed within the Divine Exaltation (الرفعة الإلهية), and the prostrator says: \"Glory be to my Lord, the Most High (الأعلى), and praise be to Him.\" For prostration contradicts highness (العلو). When highness is purified for Allah, he then raises his head from prostration and sits upright, which is His saying: <<الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏>> (The Most Compassionate established Himself upon the Throne). He says: \"O Lord, forgive me, have mercy on me, guide me, provide for me, mend me, grant me well-being, and pardon me.\"\n\n### 5. The Worshipper is a Traveler from State to State\n\nThese are stations (منازل) and sources (مناهل) in the Prayer through action. Thus, he is a traveler (مسافر) from state (حال) to state. How can one whose state is perpetual travel not be told: \"Wear your sandals,\" meaning: seek aid in your journeying through the Book (الكتاب) and the Sunnah (السنة), which are the adornment (زينة) of every place of prostration (مسجد)? For the states of the Prayer, the Divine speech that occurs within it, the ambiguities (الشبه) encountered in the profound meanings (غوامض الآيات) of the recited verses, and the worshipper placing Allah in his direction of prayer (قبلته) and finding Him—all these are like the thorns and rough ground (الوعر) that exist on the path, especially the path of obligation (طريق التكليف). He was commanded to wear sandals to protect himself with them from the harm we mentioned to the feet of the traveler (السالك), which are an expression of his outward (ظاهره) and inward (باطنه). Therefore, we made them the Book and the Sunnah. As for the sandals of Moses (peace be upon him), they are not these. For his Lord said to him: <<فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوادِ الْمُقَدَّسِ>> (Remove your sandals, for you are in the sacred valley). We have narrated that they were made of the skin of a dead donkey. This combined three things in one object: First, the skin (الجلد), which is the outward aspect of the matter—meaning, do not stop at the outward aspect in all states. Second, dullness (البلادة), which is attributed to the donkey. Third, its being dead (ميتا) and unslaughtered (غير مذكى). Death is ignorance (الجهل). If you are dead, you do not comprehend what you say or what is said to you. The one who converses intimately (المناجي) must possess the quality of one who comprehends what he says and what is said to him, so that he is alive of heart (حي القلب), perceptive of the implications of speech, and a diver for the meanings intended by the one conversing with him. When he finishes his prayer, he greets those present with the greeting of one arriving from his Lord to his people, bearing the gifts with which He honored him.\n\n### 6. The Secret of Wearing Sandals in Prayer\n\nI have alerted you to the secret of wearing sandals in the Prayer in its outward aspect, and what is intended by them according to the People of Allah's Path (أهل طريق الله تعالى) among the Gnostics (العارفين).\n\nThe Prophet (peace and blessings be upon him) said: \"Prayer is Light (نور), and Light is used for guidance.\"\n\nThe name *Salāh* (الصلاة - Prayer) is derived from *al-Musallā*, which is the one who comes in last, following the leader in the race track. This is why this chapter is titled with \"Union\" (الوصلة) and is placed in the Luminous World (عالم النور). The people of this witnessing (المشهد) possess the light of removing sandals and the light of wearing sandals. They are the Muhammadans (المحمديون) and the Musawians (الموسويون), addressed from the tree of difference (شجر الخلاف) by the tongue of Light (النور) likened to a lamp (المصباح)—which is an outward light sustained by an inward light in oil from a blessed olive tree (شجرة زيتونة مباركة) in the line of equilibrium (خط الاعتدال), purified from the influence of directions (الجهات), just as the speech to Moses (peace be upon him) was from a tree. Thus, it is <<نُورٌ عَلى‏ نُورٍ>> (Light upon Light), meaning light *from* light. The preposition *min* (from) was substituted by *‘alā* (upon) due to the contextual clue that makes it understood. And *‘alā* may also retain its original meaning, for the outward light of the lamp is physically *upon* the inward light of the oil, which sustains the lamp. Were it not for the moisture of the oil sustaining the lamp, the lamp would not have that permanence. Similarly, the sustenance of piety (التقوى) for the Gnostic Knowledge (العلم العرفاني) resulting from it, as in His saying, the Exalted: <<واتَّقُوا الله ويُعَلِّمُكُمُ الله>> (And fear Allah, and Allah teaches you) and His saying, the Exalted: <<إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً>> (If you fear Allah, He will grant you a criterion [Furqān])—this Divine Knowledge is not cut off. The light of the oil is inward within the oil, carried within it, from which a subtle meaning flows into a thin layer of the layers of the Unseen (الغيب) for the subsistence of the lamp's light. The Poles (أقطاب) of this station possess secrets, among them: the Secret of Sustenance (سر الإمداد), the Secret of Marriage (سر النكاح), the Secret of the Limbs (سر الجوارح), the Secret of Jealousy (سر الغيرة), the Secret of the Impotent (سر العنين)—who cannot perform intercourse—the Secret of the Circle of Extreme Cold (سر دائرة الزمهرير), the Secret of the existence of The Real in the Mirage (سر وجود الحق في السراب), the Secret of the Divine Veils (سر الحجب الإلهية), the Secret of the speech of birds and animals, the Secret of Attainment (سر البلوغ), and the Secret of the Truthful Ones (سر الصديقين). <<وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب ستائیسواں: ان اقطاب کی معرفت میں جن سے کہا گیا ہے کہ \"وصل کر، کیونکہ میں نے تیرے وصال کی نیت کر لی ہے\" (صل فقد نويت وصالك)، اور یہ (باب) عالم نورانی (العالم النوراني) کے منزل سے ہے۔\n\nاور اگر نور (النور) نہ ہوتا تو آنکھیں\nدیکھنے والی چیزوں (المبصرات) سے متصل نہ ہوتیں اور نہ انہیں دیکھ پاتیں۔\n\nاور اگر ذات حق (الحق) نہ ہوتی تو عقلیں\nامور کی حقیقتوں (أعيان الأمور) سے متصل نہ ہوتیں اور نہ انہیں ادراک کر پاتیں۔\n\nجب عقلوں سے ایسی ذاتوں کے بارے میں پوچھا جائے\nجو مختلف سمجھی جاتی ہیں، تو وہ ان کا انکار کر دیتی ہیں۔\n\nوہ کہتی ہیں: \"ہم نے اس ذات کے سوا کسی کو نہیں جانا\nجو مخلوق کی ان ذاتوں کو مدد (امدادی قوت) دیتی ہے جنہیں اس نے ظاہر کیا ہے۔\"\n\nوہ (ذات حق) معنی کی لذت ہے اور ہم اس کے لیے حروف کی مانند ہیں،\nپس جب بھی تو کسی امر کی تعیین کرے گا، وہ (ذات حق) اس کا قصد کرے گا۔\n\n### [الصلاة: منازلها ومناهلها]\n\n### [1- محبة الرب تسبق محبة العبد]\n\nاے قریبی ولی (الولي الحميم)! جان لے، اللہ تجھے اپنی عنایت میں لے لے، کہ اللہ تعالیٰ اپنی کتاب عزیز میں فرماتا ہے:\n**فَسَوْفَ يَأْتِي الله بِقَوْمٍ يُحِبُّهُمْ ويُحِبُّونَهُ**\n(تو عنقریب اللہ ایسی قوم کو لائے گا جن سے وہ محبت کرتا ہوگا اور وہ اس سے محبت کرتے ہوں گے)۔\nپس ذات حق نے اپنی محبت کو ان کی محبت پر مقدم رکھا۔ اور فرمایا:\n**أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فَلْيَسْتَجِيبُوا لِي**\n(میں دعا کرنے والے کی دعا قبول کرتا ہوں جب وہ مجھے پکارتا ہے، پس چاہیے کہ وہ میری استجابت کریں)۔\nپس ذات حق نے ہماری دعا پر اپنی اجابت (قبولیت) کو ہماری اس کی دعوت پر استجابت (مبالغہ والی قبولیت) پر مقدم رکھا۔ اور بندوں کی طرف سے استجابت (الاستجابة) کو مقرر کیا کیونکہ یہ اجابت (الإجابة) سے زیادہ بلیغ ہے۔ اس لیے کہ ذات حق سبحانہ کے لیے اجابت میں کوئی رکاوٹ نہیں ہے، لہٰذا تاکید کا کوئی فائدہ نہیں۔ جبکہ انسان کے لیے ان چیزوں میں رکاوٹیں ہیں جن کی طرف اللہ نے اسے بلایا ہے، اور وہ ہیں: خواہش نفس (الہویٰ)، نفس (النفس)، شیطان (الشیطان)، اور دنیا (الدنیا)۔ اسی لیے اسے استجابت کا حکم دیا گیا۔\n\nکیونکہ استفعال (الاستفعال) کا صیغہ افعال (الأفعال) کے صیغے سے مبالغے میں زیادہ شدید ہوتا ہے، اور استخراج (الاستخراج) کہاں اور اخراج (الإخراج) کہاں! اسی لیے مخلوق اپنے افعال میں اللہ سے مدد (العون) طلب کرتی ہے، اور اللہ کے لیے یہ محال ہے کہ وہ کسی مخلوق سے مدد طلب کرے۔ اللہ تعالیٰ نے ہمیں تعلیم دیتے ہوئے فرمایا کہ ہم کہیں: **وإِيَّاكَ نَسْتَعِينُ** (اور ہم تجھی سے مدد مانگتے ہیں)۔ یہ اسی باب سے ہے۔ اسی لیے اس باب میں فرمایا: \"وصل کر، کیونکہ میں نے تیرے وصال کی نیت کر لی ہے\" (صل فقد نويت وصالك)۔ پس ذات حق نے اس کے لیے ارادہ (الإرادة) کو مقدم رکھا، اسی لیے فرمایا: \"وصل کر\" (صل)۔ پس جب تو وصل (الوصلة) میں عمل کرتا ہے تو یہ تیرا عین وصل ہے جو اس کی طرف سے تجھ سے ہوا، اسی لیے اس نے اسے عمل کے بجائے نیت (النية) قرار دیا۔\n\n### [2- القرب الإلهي الخاص والعام‏]\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ فرماتا ہے: \"جو ایک بالشت میرے قریب ہوتا ہے، میں ایک ذراع (ہاتھ بھر) اس کے قریب ہوتا ہوں۔\"\n\nیہ قرب مخصوص (قرب مخصوص) ہے جو ان اعمال اور احوال کی طرف لوٹتا ہے جن کے ذریعے بندہ اس سبحانہ کا قرب حاصل کرتا ہے۔ جبکہ قرب عام (القرب العام) اللہ تعالیٰ کا یہ فرمان ہے: **ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ** (اور ہم اس کی شہ رگ سے بھی زیادہ اس کے قریب ہیں) اور **ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ** (اور ہم تم سے زیادہ اس کے قریب ہیں لیکن تم دیکھتے نہیں ہو)۔ پس ذات حق نے قرب کو ذراع کے ساتھ دوگنا کر دیا، کیونکہ ذراع بالشت کا دوگنا ہے۔ یعنی اس کا فرمان \"وصل کر\" (صل) قرب ہے، پھر اس کی طرف ایک بالشت کا تقرب، تو یہ تجھ پر ظاہر کرتا ہے کہ تو نے اس کا قرب صرف اسی کے ذریعے حاصل کیا، کیونکہ اگر وہ تجھے نہ بلاتا اور قربت کا راستہ نہ دکھاتا اور اس میں تیری پیشانی نہ پکڑتا، تو تیرے لیے یہ ممکن نہ ہوتا کہ تو اس راستے کو جان سکے جو اس کا قرب دلاتا ہے، اور اگر تو اسے جان بھی لیتا تو تیرے پاس اس کے بغیر کوئی طاقت اور قوت نہ ہوتی۔ اور چونکہ قرب سلوک (السلوك) اور اس کی طرف سفر سے حاصل ہوتا ہے، اس لیے اس کی صفت نور (النور) تھی تاکہ ہم اس کے ذریعے راستے میں ہدایت پائیں، جیسا کہ اللہ تعالیٰ نے فرمایا: **جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِها في ظُلُماتِ الْبَرِّ** (اور اس نے تمہارے لیے ستارے بنائے تاکہ تم ان کے ذریعے خشکی کی تاریکیوں میں ہدایت پاؤ)۔ اور خشکی (البر) سے مراد ظاہری سلوک ہے جو بدنی اعمال سے ہوتا ہے، اور **الْبَحْرِ** (سمندر) سے مراد باطنی معنوی سلوک ہے جو نفسانی اعمال سے ہوتا ہے۔ پس اس باب کے اصحاب کی معرفتیں (معارف) کسبی (مكتسبة) ہیں نہ کہ وہبی (موهوبة)، اور ان کا کھانا ان کے قدموں کے نیچے سے ہے، یعنی ان کے کسب اور اسے حاصل کرنے میں ان کی کوشش سے ہے۔ اور اگر ذات حق نے ان کے لیے اس کا ارادہ نہ کیا ہوتا تو وہ انہیں توفیق نہ دیتا اور نہ انہیں استعمال کرتا، جبکہ دوسروں کو معنی کے ذریعے دور کر دیا اور انہیں امر کے ذریعے بلایا۔ پس اس نے انہیں وصول سے محروم کر دیا، اس طرح کہ انہیں ان اسباب کے استعمال سے محروم رکھا جنہیں اس نے قرب کی جناب تک پہنچنے کا راستہ بنایا تھا۔ اسی لیے انہیں خوشخبری دی اور فرمایا: \"وصل کر، کیونکہ میں نے تیرے وصال کی نیت کر لی ہے\" (صل فقد نويت وصالك)۔ پس ان کے لیے عنایت سبقت لے گئی اور انہوں نے سلوک کیا۔\n\n### [3- لباس النعلين في الصلاة]\n\nیہ وہ لوگ ہیں جنہیں اللہ نے نماز میں نعلین (جوتے) پہننے کا حکم دیا، کیونکہ بیٹھنے والا نعلین نہیں پہنتا، بلکہ وہ چلنے والے کے لیے بنائے گئے ہیں۔ پس یہ اس بات کی دلیل ہے کہ نمازی اپنی نماز میں اور اپنے رب سے مناجات (المناجاة) میں چلتا ہے، ان آیات میں جن میں وہ اس سے مناجات کرتا ہے، منزل بہ منزل، ہر آیت ایک منزل اور ایک حال ہے۔ پس اللہ نے ان سے فرمایا: **يا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ** (اے آدم کی اولاد! ہر مسجد کے پاس اپنی زینت اختیار کرو)۔ ایک صحابی نے کہا: جب یہ آیت نازل ہوئی تو ہمیں اس میں نعلین پہن کر نماز پڑھنے کا حکم دیا گیا۔ پس یہ اللہ تعالیٰ کی طرف سے نمازی کے لیے تنبیہ تھی کہ وہ قرآن کی سورتوں میں جو کچھ تلاوت کرتا ہے، اس کی منازل پر چل رہا ہے، کیونکہ لغت میں سورتیں (السور) ہی منازل (المنازل) ہیں۔ نابغہ نے کہا:\n\n> کیا تو نے نہیں دیکھا کہ اللہ نے تجھے ایک سورت (منزلہ) عطا کی\n> جس کے نیچے ہر بادشاہ کو تو کانپتا ہوا دیکھتا ہے۔\n\nاس سے مراد منزلہ (رتبہ) ہے۔ اور موسیٰ علیہ السلام سے کہا گیا: **فَاخْلَعْ نَعْلَيْكَ** (اپنے جوتے اتار دو)، یعنی تم منزل پر پہنچ گئے ہو، کیونکہ وہ اللہ کا کلمہ تھے بغیر کسی واسطے کے، اس کے کلام سبحانہ کے ساتھ بغیر کسی ترجمان کے۔ اسی لیے اللہ تعالیٰ نے ہمیں تعریف میں مصدر کے ذریعے تاکید فرمائی: **وكَلَّمَ الله مُوسى‏ تَكْلِيماً** (اور اللہ نے موسیٰ سے کلام کیا، کلام کرنا)۔\n\n### [4- خلع النعلين لمن وصل ومنازل الصلاة]\n\nاور جو منزل پر پہنچ جاتا ہے وہ اپنے نعلین اتار دیتا ہے۔ پس نعلین کے ساتھ نماز پڑھنے والے کا رتبہ ظاہر ہو گیا، اور نماز میں مناجات کا کیا معنی ہے؟ اور یہ اس کلام کے معنی میں نہیں ہے جو موسیٰ علیہ السلام کو حاصل ہوا، کیونکہ اس نے نمازی کے بارے میں کہا کہ وہ مناجات کرتا ہے، اور مناجات (المناجاة) دو فاعلوں کا فعل ہے۔ لہٰذا نعلین پہننا ضروری ہے، کیونکہ نمازی دو حقیقتوں کے درمیان متردد (متردد) ہوتا ہے، اور دو چیزوں کے درمیان تردد (التردد) معنی کے اعتبار سے ان کے درمیان چلنے کو ظاہر کرتا ہے، جس پر نعلین پہننے کے لفظ سے دلالت کی گئی ہے۔ اور اس پر اللہ تعالیٰ کا یہ فرمان بھی دلالت کرتا ہے جو نبی صلی اللہ علیہ وسلم کی ترجمانی سے ہے:\n\n\"میں نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کر دیا ہے، پس آدھا میرا ہے اور آدھا میرے بندے کا ہے، اور میرے بندے کے لیے وہ ہے جو اس نے مانگا۔\"\n\nپھر فرمایا: بندہ کہتا ہے: **الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ** (تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔ پس اس نے بیان کیا کہ بندہ اپنے قول **الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ** میں اپنے نفس کے ساتھ ہے، وہ اپنے خالق اور مناجات کرنے والے کو سنتا ہے۔ پھر بندہ اپنے قول کی منزل سے اپنے سمع (سننے) کی منزل کی طرف کوچ کرتا ہے تاکہ وہ سنے جو ذات حق تعالیٰ اس کے قول پر جواب دیتا ہے، اور یہی سفر ہے۔ اسی لیے اس نے اپنے نعلین پہنے تاکہ وہ ان دونوں منزلوں کے درمیان کے راستے پر چل سکے۔ پس جب وہ اپنے سمع کی منزل کی طرف کوچ کرتا ہے تو سنتا ہے کہ ذات حق اس سے فرماتا ہے: \"میرے بندے نے میری حمد کی\"۔ پھر وہ اپنے سمع کی منزل سے اپنے قول کی منزل کی طرف کوچ کرتا ہے اور کہتا ہے: **الرَّحْمنِ الرَّحِيمِ** (بڑا مہربان، نہایت رحم والا)۔ پس جب وہ فارغ ہوتا ہے تو اپنے سمع کی منزل کی طرف کوچ کرتا ہے، اور جب وہ وہاں اترتا ہے تو سنتا ہے کہ ذات حق تعالیٰ اس سے فرماتا ہے: \"میرے بندے نے میری ثنا کی\"۔ پس وہ اپنی مناجات میں قول کے ذریعے مسلسل متردد رہتا ہے۔ پھر اس کے لیے ایک اور رحلت (کوچ) ہوتی ہے، نماز میں اپنے قیام کے حال سے اپنے رکوع کے حال کی طرف۔ پس وہ صفت قیومیت (القیومیۃ) سے صفت عظمت (العظمة) کی طرف کوچ کرتا ہے اور کہتا ہے: \"سبحان ربی العظیم وبحمده\" (میرا رب عظیم پاک ہے اور میں اس کی حمد کرتا ہوں)۔ پھر وہ سر اٹھاتا ہے، اور یہ اس کی تعظیم کے مقام سے نیابت (النیابۃ) کے مقام کی طرف رحلت ہے، پس وہ کہتا ہے: \"سمع الله لمن حمده\" (اللہ نے سن لیا جس نے اس کی حمد کی)۔\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: \"اللہ نے اپنے بندے کی زبان پر فرمایا: سمع الله لمن حمده، پس تم کہو: ربنا لك الحمد (اے ہمارے رب! تیرے ہی لیے حمد ہے)\"۔\n\nاسی لیے ہم نے رکوع سے اٹھنے کو ذات حق کی نیابت (نیابۃ عن الحق) اور قیومیت کی طرف رجوع قرار دیا۔ پس جب وہ سجدہ کرتا ہے تو عظمت (العظمة) الوہی رفعت (الرفعة الإلهية) میں شامل ہو جاتی ہے، پس سجدہ کرنے والا کہتا ہے: \"سبحان ربي الأعلى وبحمده\" (میرا رب اعلیٰ پاک ہے اور میں اس کی حمد کرتا ہوں)، کیونکہ سجدہ علو (العلو) کے متضاد ہے۔ پس جب علو اللہ کے لیے خالص ہو جاتا ہے، پھر وہ سجدے سے سر اٹھاتا ہے اور سیدھا بیٹھ جاتا ہے، اور یہ اللہ کا فرمان ہے: **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏** (رحمن عرش پر مستوی ہوا)۔ پس وہ کہتا ہے: \"رب اغفر لي وارحمني واهدني وارزقني واجبرني وعافني واعف عني\" (اے میرے رب! مجھے بخش دے، مجھ پر رحم فرما، مجھے ہدایت دے، مجھے رزق دے، میری کمی پوری کر، مجھے عافیت دے، اور مجھ سے درگزر فرما)۔\n\n### [5- المصلي مسافر من حال إلى حال‏]\n\nنماز میں افعال کے ذریعے منازل اور مناہل (گھاٹ) ہیں، پس وہ ایک حال سے دوسرے حال کی طرف مسافر ہے۔ تو جو شخص ہمیشہ سفر کے حال میں ہو، اسے کیوں نہ کہا جائے کہ \"اپنے نعلین پہن لے\"، یعنی اپنے سفر میں کتاب (الکتاب) اور سنت (السنة) سے مدد لے، اور یہی ہر مسجد کی زینت ہے۔ کیونکہ نماز کے احوال اور اس میں اللہ کے کلام کا جو ظہور ہوتا ہے، اور اس میں تلاوت کی جانے والی آیات کے اسرار میں جو شبہات پیش آتے ہیں، اور انسان کا نماز میں اللہ کو اپنے قبلے میں رکھنا اور اسے پانا—یہ سب راستے میں موجود کانٹوں اور دشوار گزار جگہوں کی مانند ہیں، خاص طور پر طریق تکلیف (طريق التكليف)۔ پس اسے نعلین پہننے کا حکم دیا گیا تاکہ وہ ان کے ذریعے سالک کے قدموں کو اس اذیت سے بچائے جس کا ہم نے ذکر کیا، اور قدمین سے مراد اس کا ظاہر اور باطن ہے۔ اسی لیے ہم نے انہیں کتاب اور سنت قرار دیا۔ لیکن موسیٰ علیہ السلام کے نعلین یہ نہیں تھے، کیونکہ ان کے رب نے ان سے فرمایا: **فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوادِ الْمُقَدَّسِ** (اپنے جوتے اتار دو، بے شک تم مقدس وادی میں ہو)۔ ہم نے روایت کیا ہے کہ وہ مردہ گدھے کی کھال کے تھے، پس ان میں تین چیزیں جمع تھیں: پہلی چیز کھال (الجلد) ہے، جو امر کا ظاہر ہے، یعنی ہر حال میں ظاہر پر نہ ٹھہر جا۔ دوسری چیز بلادت (البلادة) ہے، کیونکہ یہ گدھے سے منسوب ہے۔ اور تیسری چیز اس کا مردہ (ميت) ہونا، جو ذبح شدہ نہ ہو۔ اور موت (الموت) جہالت (الجهل) ہے۔ اور جب تو مردہ ہو تو تو نہ سمجھتا ہے جو تو کہتا ہے اور نہ وہ جو تجھ سے کہا جاتا ہے۔ اور مناجات کرنے والے کے لیے ضروری ہے کہ وہ اس صفت پر ہو جو سمجھتا ہو کہ وہ کیا کہہ رہا ہے اور اس سے کیا کہا جا رہا ہے، پس وہ زندہ دل (حي القلب) ہو، کلام کے مواقع کو سمجھنے والا ہو، اور ان معانی پر غوطہ زن ہو جن کا قصد اس سے مناجات کرنے والا کر رہا ہے۔ پس جب وہ اپنی نماز سے فارغ ہوتا ہے تو حاضرین کو اس سلام کے ساتھ سلام کرتا ہے جو اپنے رب کے پاس سے اپنی قوم کی طرف آنے والے کا سلام ہوتا ہے، اس تحفے کے ساتھ جو اسے عطا کیا گیا۔\n\n### [6- سر لباس النعلين في الصلاة]\n\nپس میں نے تجھے ظاہری امر میں نماز میں نعلین پہننے کے راز سے آگاہ کر دیا، اور یہ بھی بتا دیا کہ اہل طریق اللہ (أهل طريق الله) میں سے عارفین (العارفين) کے نزدیک ان سے کیا مراد ہے۔\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: \"نماز نور (النور) ہے، اور نور سے ہدایت پائی جاتی ہے۔\"\n\nاور صلاۃ (الصلاة) کا نام مصلی (المصلى) سے ماخوذ ہے، اور مصلی وہ ہے جو میدان میں سبقت لے جانے والے کے پیچھے ہوتا ہے۔ اسی لیے اس باب کا عنوان وصل (الوصلة) کے ساتھ باندھا گیا اور اسے عالم نورانی (عالم النور) سے قرار دیا۔ اور اس مشہد کے اہل کے لیے نعلین اتارنے کا نور بھی ہے اور نعلین پہننے کا نور بھی۔ پس وہ محمدی (المحمديون) اور موسوی (الموسويون) ہیں، جنہیں شجر خلاف (شجر الخلاف) سے نور کی زبان سے مخاطب کیا گیا ہے، جو چراغ (المصباح) سے مشابہ ہے، اور یہ ایک ظاہری نور ہے جسے ایک باطنی نور مدد دیتا ہے، جو زیتون کے مبارک درخت کے تیل میں ہے، جو خط اعتدال میں ہے اور جہات کے اثر سے پاک ہے۔ جیسا کہ موسیٰ علیہ السلام سے کلام ایک درخت سے ہوا تھا۔ پس یہ **نُورٌ عَلى‏ نُورٍ** (نور پر نور) ہے، یعنی نور سے نور۔ پس حرف \"من\" (سے) کو \"علی\" (پر) سے بدل دیا گیا، کیونکہ قرینہ حال سے یہی سمجھا جاتا ہے۔ اور \"علی\" اپنے اصلی معنی پر بھی ہو سکتا ہے، کیونکہ ظاہری چراغ کا نور حسی طور پر باطنی تیل کے نور سے بلند ہوتا ہے، اور وہی چراغ کو مدد دیتا ہے۔ پس اگر تیل کی رطوبت چراغ کو مدد نہ دیتی تو چراغ کو وہ دوام حاصل نہ ہوتا۔ اسی طرح تقویٰ (التقوى) کا عرفانی علم (العلم العرفاني) کو مدد دینا ہے جو اس سے حاصل ہوتا ہے، جیسا کہ اللہ تعالیٰ کے فرمان میں ہے: **واتَّقُوا الله ويُعَلِّمُكُمُ الله** (اور اللہ سے ڈرو، اور اللہ تمہیں سکھاتا ہے) اور اس کے فرمان میں ہے: **إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً** (اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) بنا دے گا)۔ یہ الٰہی علم منقطع نہیں ہوتا۔ پس تیل کا نور تیل میں باطن ہے، اس میں موجود ہے، اس سے ایک لطیف معنی غیب کی باریکیوں میں سرایت کرتا ہے تاکہ چراغ کا نور باقی رہے۔ اور اس مقام کے اقطاب کے لیے کئی اسرار ہیں، جن میں امداد کا راز (سر الإمداد)، نکاح کا راز (سر النكاح)، جوارح کا راز (سر الجوارح)، غیرت کا راز (سر الغيرة)، عنین کا راز (سر العنين) – جو نکاح کے قابل نہیں ہوتا – زمہریر کے دائرے کا راز (سر دائرة الزمهرير)، سراب میں ذات حق کے وجود کا راز (سر وجود الحق في السراب)، الٰہی پردوں کا راز (سر الحجب الإلهية)، پرندوں اور حیوانوں کے بولنے کا راز (سر نطق الطير والحيوان)، بلوغ کا راز (سر البلوغ)، اور صدیقین کا راز (سر الصديقين) شامل ہیں۔ اور **وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب بیست و هفتم در معرفت اقطاب \"صل فقد نويت وصالك\" (نماز بگزار که من وصال تو را نیت کرده‌ام) و این باب از منزل عالم نورانی است.»\n\nو اگر نور نبود، دیدگان به عین مبصرات (چیزهای دیدنی) متصل نمی‌شدند و آن‌ها را نمی‌دیدند.\n\nو اگر حق (الحق) نبود، عقل‌ها به اعیان امور متصل نمی‌شدند و آن‌ها را درک نمی‌کردند.\n\nاگر عقل‌ها از ذات‌هایی که مغایر (متفاوت) شمرده می‌شوند بپرسند، آن‌ها را انکار می‌کنند.\n\n(عقل‌ها) می‌گویند: ما جز ذاتی که ذوات خلق را که آشکار کرده، مدد می‌رساند، نمی‌شناسیم.\n\nاو (آن ذات) معنای دلخواه است و ما حروف آن هستیم؛ پس هرگاه امری را مشخص کنی، او مقصود آن است.\n\n### [نماز: منازل و سرچشمه‌های آن]\n\n### [۱- محبت پروردگار بر محبت بنده پیشی دارد]\n\nای ولیّ صمیمی، آگاه باش، خداوند تو را به عنایت خود سرپرستی کند، که خداوند متعال در کتاب عزیزش می‌فرماید: فَسَوْفَ يَأْتِي الله بِقَوْمٍ يُحِبُّهُمْ ويُحِبُّونَهُ (به زودی خداوند قومی را می‌آورد که آن‌ها را دوست دارد و آن‌ها نیز او را دوست دارند). پس محبت خود را نسبت به ایشان بر محبت ایشان نسبت به خود مقدم داشت. و فرمود: أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ فَلْيَسْتَجِيبُوا لِي (دعای دعا کننده را هنگامی که مرا بخواند اجابت می‌کنم، پس باید مرا اجابت کنند). پس اجابت (الإجابة) خود را نسبت به ما هنگامی که او را می‌خوانیم، بر اجابت ما نسبت به او هنگامی که ما را می‌خواند، مقدم داشت. و استجابت (الاستجابة) را از بندگان قرار داد، زیرا استجابت رساتر از اجابت است. چرا که برای او سبحانه مانعی از اجابت نیست، پس نیازی به تأکید نیست. اما انسان موانعی برای اجابت آنچه خداوند او را به آن فراخوانده دارد، و آن موانع عبارتند از: هوی، نفس، شیطان و دنیا. به همین دلیل به استجابت امر شده است.\n\nزیرا صیغه استفعال در مبالغه از صیغه افعال شدیدتر است؛ و استخراج کجا و اخراج کجا. به همین دلیل است که مخلوق از خداوند در افعالش یاری می‌طلبد، و محال است که خداوند از مخلوقی یاری بخواهد. خداوند متعال برای تعلیم ما فرمود که بگوییم: وإِيَّاكَ نَسْتَعِينُ (و تنها از تو یاری می‌جوییم) که از همین باب است. به همین دلیل در این باب فرمود: «صل فقد نويت وصالك» (نماز بگزار که من وصال تو را نیت کرده‌ام). پس اراده را از جانب خود مقدم داشت و فرمود: «صل» (نماز بگزار). پس اگر تو در وصله (الوصلة) تلاش کنی، آن عین وصل او به توست. به همین دلیل آن را نیت قرار داد نه عمل.\n\n### [۲- قرب الهی خاص و عام]\n\nرسول خدا (ص) فرمود: خداوند متعال می‌فرماید: من تقرب إلي شبرا تقربت منه ذراعا (هر کس یک وجب به من نزدیک شود، من یک ذراع به او نزدیک می‌شوم).\n\nاین قرب مخصوصی است که به اعمال و احوالی باز می‌گردد که بنده با آن‌ها به سوی او سبحانه تقرب می‌جوید. اما قرب عام، سخن خداوند متعال است که می‌فرماید: ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ (و ما از رگ گردن به او نزدیک‌تریم) و ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ (و ما از شما به او نزدیک‌تریم، ولی شما نمی‌بینید). پس قرب را با ذراع دو برابر کرد، زیرا ذراع دو برابر وجب است. یعنی سخن او که فرمود: «صل» (نماز بگزار) خود قرب است، سپس تقرب بنده به سوی او یک وجب است. پس برای تو آشکار می‌شود که تو جز به واسطه او به او تقرب نجسته‌ای، زیرا اگر او تو را دعوت نمی‌کرد و راه قرب را برایت بیان نمی‌نمود و زمام تو را در آن نمی‌گرفت، برایت ممکن نبود که راهی را که با آن به او نزدیک می‌شوی بشناسی. و اگر هم آن را می‌شناختی، جز به واسطه او هیچ حول و قوه‌ای نداشتی. و چون قرب با سلوک (السلوك) و سفر به سوی او حاصل می‌شود، از این رو صفت او نور (النور) است تا به واسطه آن در راه هدایت شویم، چنانکه خداوند متعال فرمود: جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا بِها في ظُلُماتِ الْبَرِّ (ستارگان را برای شما قرار داد تا در تاریکی‌های خشکی به وسیله آن‌ها هدایت شوید) که آن سلوک ظاهری با اعمال بدنی است، والْبَحْرِ (و دریا) که آن سلوک باطنی معنوی با اعمال نفسانی است. پس اصحاب این باب، معارفشان اکتسابی است نه موهبتی، و خوراکشان از زیر پاهایشان است، یعنی از کسب و تلاششان در تحصیل آن. و اگر حق (الحق) آن‌ها را برای این امر نمی‌خواست، توفیقشان نمی‌داد و به کارشان نمی‌گرفت، در حالی که دیگران را با معنا طرد کرد و با امر فراخواند، پس آن‌ها را از رسیدن محروم ساخت به سبب محروم کردنشان از به کارگیری اسبابی که آن‌ها را راهی برای رسیدن از حضرت قرب قرار داده است. به همین دلیل به آن‌ها مژده داد و فرمود: «صل فقد نويت وصالك» (نماز بگزار که من وصال تو را نیت کرده‌ام). پس عنایت (العناية) بر آن‌ها سبقت گرفت و سلوک کردند.\n\n### [۳- پوشیدن کفش در نماز]\n\nو ایشان کسانی هستند که خداوند به آن‌ها امر کرد که در نماز کفش بپوشند، زیرا کسی که نشسته است کفش نمی‌پوشد، بلکه کفش برای کسی قرار داده شده که در آن راه می‌رود. پس این دلالت می‌کند که نمازگزار در نماز خود و در مناجات با پروردگارش در آیاتی که با او مناجات می‌کند، منزل به منزل راه می‌رود، و هر آیه یک منزل و یک حال است. پس به آن‌ها فرمود: يا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ (ای فرزندان آدم، زینت خود را در هر مسجدی برگیرید). یکی از صحابه گفت: هنگامی که این آیه نازل شد، به ما امر شد که در کفش‌هایمان نماز بخوانیم. این تنبیهی از جانب خداوند متعال برای نمازگزار بود که او بر منازل آنچه در نماز از سوره‌های قرآن تلاوت می‌کند، راه می‌رود، زیرا سوره‌ها در لغت به معنای منازل هستند. نابغه می‌گوید:\n\n> أ لم تر أن الله أعطاك سورة *** ترى كل ملك دونها يتذبذب‏\n> (آیا ندیدی که خداوند به تو سوره‌ای (منزلتی) عطا کرد که هر پادشاهی در برابر آن متزلزل می‌شود؟)\n\nمنظور او منزلت بود. و به موسی (ع) گفته شد: فَاخْلَعْ نَعْلَيْكَ (کفش‌هایت را درآور)، یعنی به منزل رسیدی، زیرا او کلیم الله بود بدون واسطه و با کلام خود سبحانه بدون مترجم. به همین دلیل خداوند در تعریف ما با مصدر آن را تأکید کرد و فرمود: وكَلَّمَ الله مُوسى‏ تَكْلِيماً (و خداوند با موسی سخن گفت، سخن گفتنی).\n\n### [۴- درآوردن کفش برای کسی که رسیده و منازل نماز]\n\nو کسی که به منزل رسید، کفش‌هایش را درآورد. پس رتبه نمازگزار با کفش آشکار شد، و معنای مناجات در نماز چیست و اینکه آن به معنای کلامی نیست که برای موسی (ع) حاصل شد. زیرا در مورد نمازگزار فرمود: «یناجی» (مناجات می‌کند) و مناجات فعل دو فاعل است. پس پوشیدن کفش ضروری است، زیرا نمازگزار بین دو حقیقت متردد است، و تردد بین دو امر، راه رفتن بین آن دو را به معنا می‌رساند که با لفظ پوشیدن کفش بر آن دلالت شده است. و بر آن دلالت شده است:\n\nسخن خداوند متعال که پیامبر (ص) از او ترجمه می‌کند: قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ولعبدي ما سأل‏ (نماز را میان خود و بنده ام دو نیم کردم؛ نیمی از آن برای من و نیمی برای بنده ام است و برای بنده ام هر چه بخواهد).\n\nسپس فرمود: بنده می‌گوید: الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ (ستایش از آن خداوندی است که پروردگار جهانیان است). پس وصف کرد که بنده با خود در سخن خود الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ، خالق و مناجات‌کننده خود را می‌شنود. سپس بنده از منزل سخن خود به منزل شنیدن خود کوچ می‌کند تا بشنود که حق (الحق) تعالی در پاسخ سخن او چه می‌گوید. و این همان سفر است. به همین دلیل کفش‌هایش را پوشید تا با آن‌ها راهی را که بین این دو منزل است بپیماید. پس هنگامی که به منزل شنیدن خود کوچ کرد، می‌شنود که حق می‌فرماید: «حمدني عبدي» (بنده‌ام مرا ستایش کرد). پس از منزل شنیدن خود به منزل سخن خود کوچ می‌کند و می‌گوید: الرَّحْمنِ الرَّحِيمِ (بخشنده مهربان). هنگامی که فارغ شد، به منزل شنیدن خود کوچ می‌کند. هنگامی که در آن منزل فرود آمد، می‌شنود که حق تعالی به او می‌گوید: «أثنى على عبدي» (بنده‌ام مرا ثنا گفت). پس پیوسته در مناجات خود متردد است. سپس برای او کوچ دیگری است، از حال قیام در نماز به حال رکوع. پس از صفت قیومیت (القیومية) به صفت عظمت (العظمة) کوچ می‌کند و می‌گوید: «سبحان ربي العظيم وبحمده» (منزه است پروردگار بزرگ من و ستایش او). سپس سر بر می‌دارد، و این کوچ او از مقام تعظیم به مقام نیابت (النیابة) است و می‌گوید: «سمع الله لمن حمده» (خداوند سخن کسی را که او را ستایش کند شنید).\n\nپیامبر (ص) فرمود: إن الله قال على لسان عبده سمع الله لمن حمده فقولوا ربنا لك الحمد (خداوند بر زبان بنده خود فرمود: خداوند سخن کسی را که او را ستایش کند شنید، پس شما بگویید: پروردگارا، ستایش از آن توست).\n\nبه همین دلیل ما برخاستن از رکوع را نیابت از حق (الحق) و بازگشت به قیومیت قرار دادیم. هنگامی که سجده می‌کند، عظمت در رفعت الهی (الرفعة الإلهية) مندرج می‌شود و سجده‌کننده می‌گوید: سبحان ربي الأعلى وبحمده (منزه است پروردگار بلندمرتبه من و ستایش او). زیرا سجده با علو (العلو) در تناقض است. پس هنگامی که علو خالص برای خدا شد، سپس سر از سجده برمی‌دارد و راست می‌نشیند، و این همان سخن اوست: الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ (رحمان بر عرش استیلا یافت). و می‌گوید: «رب اغفر لي وارحمني واهدني وارزقني واجبرني وعافني واعف عني» (پروردگارا مرا بیامرز، و به من رحم کن، و هدایتم کن، و روزی‌ام ده، و جبران کن، و عافیت ده، و از من درگذر).\n\n### [۵- نمازگزار مسافر از حالی به حال دیگر]\n\nمنازل و سرچشمه‌هایی در نماز به صورت فعل وجود دارد. پس او مسافر از حالی به حال دیگر است. کسی که حالش همیشه سفر است، چگونه به او گفته نشود: «کفش‌هایت را بپوش»، یعنی در سیر خود از کتاب و سنت یاری بجوی، که این‌ها زینت هر مسجد هستند. زیرا احوال نماز و آنچه در آن از کلام خدا رخ می‌دهد و شبهاتی که در آیات غامض تلاوت شده در آن پیش می‌آید، و اینکه انسان در نماز خداوند را در قبله خود قرار می‌دهد و او را می‌یابد، همه این‌ها به منزله خار و ناهمواری‌هایی است که در راه وجود دارد، به ویژه راه تکلیف. پس به پوشیدن کفش امر شد تا با آن‌ها از آنچه ذکر کردیم از آزار برای دو پای سالک (السالك) که عبارت از ظاهر و باطن او هستند، پرهیز کند. به همین دلیل ما آن‌ها را کتاب و سنت قرار دادیم. اما کفش‌های موسی (ع) این‌ها نبودند، زیرا پروردگارش به او فرمود: فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوادِ الْمُقَدَّسِ (کفش‌هایت را درآور، زیرا تو در وادی مقدس هستی). و روایت کرده‌ایم که آن دو از پوست الاغ مرده بودند. پس سه چیز را در یک چیز جمع کرده بود: اول، پوست (الجلد) که ظاهر امر است، یعنی در همه احوال بر ظاهر توقف نکن. دوم، بلادت (البلادة) که به الاغ نسبت داده می‌شود. و سوم، مرده بودن آن که ذبح شرعی نشده است، و مرگ همان جهل است. و اگر مرده باشی، آنچه می‌گویی و آنچه به تو گفته می‌شود را درک نمی‌کنی. در حالی که مناجات‌کننده باید دارای صفتی باشد که آنچه می‌گوید و آنچه به او گفته می‌شود را درک کند، پس باید زنده قلب باشد، به موقعیت‌های کلام آگاه باشد و غواص معانی باشد که مناجات‌کننده قصد دارد با آن‌ها به او برسد. پس هنگامی که از نماز فارغ شد، بر حاضران سلام می‌کند، سلام کسی که از نزد پروردگارش به سوی قوم خود بازگشته است، با آنچه خداوند به او تحفه داده است.\n\n### [۶- راز پوشیدن کفش در نماز]\n\nپس تو را بر راز پوشیدن کفش در نماز در ظاهر امر و آنچه مراد اهل طریق الله (اهل طريق الله) از عارفان (العارفين) از آن است، آگاه ساختم.\n\nپیامبر (ص) فرمود: الصلاة نور والنور يهتدى به‏ (نماز نور است و با نور هدایت می‌شوند).\n\nو اسم نماز (الصلاة) از «المصلی» (المصلی) گرفته شده است، و آن کسی است که در میدان مسابقه پس از پیشتاز قرار می‌گیرد. به همین دلیل این باب را با وصله (الوصلة) ترجمه کرد و آن را از عالم نور (النور) قرار داد. و برای اهل این مشهد، نور درآوردن کفش و نور پوشیدن کفش وجود دارد. پس آن‌ها محمدیون موسویون (المحمديون الموسويون) هستند که از درخت خلاف با زبان نور مورد خطاب قرار می‌گیرند، نوری که به چراغ (المصباح) تشبیه شده است، و آن نوری ظاهری است که نوری باطنی آن را مدد می‌رساند، در روغنی از درخت زیتون مبارک در خط اعتدال، که از تأثیر جهات منزه است، همان‌گونه که کلام برای موسی (ع) از درخت بود. پس آن نُورٌ عَلى‏ نُورٍ (نوری بر فراز نور) است، یعنی نوری از نور. پس حرف «مِن» (از) به «عَلی» (بر) تبدیل شده است، به دلیل قرینه حالی که با آن فهمیده می‌شود. و ممکن است «عَلی» بر معنای اصلی خود باشد، زیرا نور ظاهری چراغ از نظر حسی بر نور باطنی روغن برتری دارد، و آن همان است که چراغ را مدد می‌رساند. و اگر رطوبت روغن چراغ را مدد نمی‌رساند، برای چراغ آن دوام وجود نداشت. و همچنین است مدد رساندن تقوا به علم عرفانی (العلم العرفاني) که از آن حاصل می‌شود، در سخن خداوند متعال: واتَّقُوا الله ويُعَلِّمُكُمُ الله (و از خدا پروا کنید و خداوند به شما می‌آموزد) و سخن او: إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً (اگر از خدا پروا کنید، برای شما فرقان (قدرت تشخیص) قرار می‌دهد) که آن علم الهی (العلم الإلهي) را قطع نمی‌کند. پس نور روغن، باطنی است در روغن که در آن حمل می‌شود، و معنایی لطیف از آن در رقیقه (لایه نازک)‌ای از رقائق غیب جریان می‌یابد تا نور چراغ باقی بماند. و برای اقطاب این مقام اسراری است، از جمله: سر امداد (سر الإمداد)، سر نکاح (سر النكاح)، سر جوارح (سر الجوارح)، سر غیرت (سر الغيرة)، سر عنین (سر العنين) که کسی است که توانایی نکاح ندارد، سر دایره زمهرير (سر دائرة الزمهرير)، سر وجود حق در سراب (سر وجود الحق في السراب)، سر حجاب‌های الهی (سر الحجب الإلهية)، سر سخن گفتن پرنده و حیوان، سر بلوغ، و سر صدیقین (سر الصديقين). والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}