{
  "id": 32,
  "title": {
    "ar": "الباب الثاني والثلاثون في معرفة الأقطاب المدبرين أصحاب الركاب من الطبقة الثانية",
    "en": "Chapter Thirty-Two: Concerning the Gnosis of the Administering Poles, the Masters of the Mounts, from the Second Level.",
    "ur": "باب بتیس: دوسری جماعت کے مدبر اقطاب جو اصحاب الرکاب ہیں، کی معرفت میں۔",
    "fa": "باب سی و دوم در معرفت اقطاب مدبّر (تدبیرکننده) که صاحبان رکاب از طبقه دوم هستند"
  },
  "content": {
    "ar": "## (الباب الثاني والثلاثون في معرفة الأقطاب المدبرين أصحاب الركاب من الطبقة الثانية)\n\n\n> إن التدبر معشوق لصاحبه *** به تعشقت الأسماء والدول‏\n\n\n> عليه عند الذي يقضي سوالفه *** في كل ما يقتضيه كونه العمل‏\n\n\n> به ترتب ما في الكون من عجب *** فكل كون له في علمه أجل‏\n\n\n### [الركبان المدبرون في إشبيلية]\n\n\nلقيت من هؤلاء الطبقة جماعة بإشبيلية من بلاد الأندلس منهم أبو يحيى الصنهاجى الضرير كان يسكن بمسجد الزبيدي صحبته إلى أن مات ودفن بجبل عال كثير الرياح بالشرق فكل الناس شق عليهم طلوع الجبل لطوله وكثرة رياحه فسكن الله الريح فلم تهب من الوقت الذي وضعناه في الجبل وأخذ الناس في حفر قبره وقطع حجره إلى أن فرغنا منه وواريناه في روضته وانصرفنا فعند انصرافنا هبت الريح على عادتها فتعجب الناس من ذلك ومنهم أيضا صالح البربري وأبو عبد الله الشرفي وأبو الحجاج يوسف الشبربلي فأما صالح فساح أربعين سنة ولزم بإشبيلية مسجد الرطند إلى أربعين سنة على التجريد بالحالة التي كان عليها في سياحته وأما أبو عبد الله الشرفي فكان صاحب خطوة بقي نحوا من خمسين سنة ما أسرج له سراجا في بيته رأيت له عجائب وأما أبو الحجاج الشبر بلي من قرية يقال لها شبربل بشرق إشبيلية كان ممن يمشي على الماء وتعاشره الأرواح وما من واحد من هؤلاء إلا وعاشرته معاشرة مودة وامتزاج ومحبة منهم فينا وقد ذكرناهم مع أشياخنا في الدرة الفاخرة عند ذكرنا من انتفعت به في طريق الآخرة\n\n\n### [الآيات المعتادة وغير المعتادة]\n\n\nفكان هؤلاء الأربعة من أهل هذا المقام وهم من أكابر الأولياء الملامية جعل بأيديهم علم التدبير والتفصيل فلهم الاسم المدبر المفصل وهجيرهم يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ هم العرائس أهل المنصات فلهم الآيات المعتادة وغير المعتادة فالعالم كله عندهم آيات بينات والعامة ليست الآيات عندهم إلا التي هي عندهم غير معتادة فتلك تنبههم إلى تعظيم الله والله قد جعل الآيات المعتادة لأصناف مختلفين من عباده فمنها للعقلاء مثل قوله تعالى إِنَّ في خَلْقِ السَّماواتِ والْأَرْضِ واخْتِلافِ اللَّيْلِ والنَّهارِ والْفُلْكِ الَّتِي تَجْرِي في الْبَحْرِ بِما يَنْفَعُ النَّاسَ وما أَنْزَلَ الله من السَّماءِ من ماءٍ فَأَحْيا به الْأَرْضَ بَعْدَ مَوْتِها وبَثَّ فِيها من كُلِّ دَابَّةٍ وتَصْرِيفِ الرِّياحِ والسَّحابِ الْمُسَخَّرِ بَيْنَ السَّماءِ والْأَرْضِ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ فثم آيات للعقلاء كلها معتادة وآياتٌ لِلْمُوقِنِينَ وآيات لِأُولِي الْأَلْبابِ وآيات لِأُولِي النُّهى‏ وآيات للسامعين وهم أهل الفهم عن الله وآيات للعالمين وآيات للعالمين وآيات للمؤمنين وآيات للمتفكرين وآيات لأهل التذكر فهؤلاء كلهم أصناف نعتهم الله بنعوت مختلفة وآيات مختلفات كلها ذكرها لنا في القرآن إذا بحثت عليها وتدبرتها علمت أنها آيات ودلالات على أمور مختلفة ترجع إلى عين واحدة غفل عن ذلك أكثر الناس ولهذا عدد الأصناف‏\n\n\n### [أصناف الخلق في إدراك الآيات المعتادة]\n\n\nفإن من الآيات المذكورة المعتادة ما يدرك الناس دلالتها من كونهم ناسا وجنا وملائكة وهي التي وصف بإدراكها العالم بفتح اللام ومن الآيات ما تغمض بحيث لا يدركها إلا من له التفكر السليم ومن الآيات ما هي دلالتها مشروطة بأولي الألباب وهم العقلاء الناظرون في لب الأمور لا في قشورها فهم الباحثون عن المعاني وإن كانت الألباب والنهي العقول فلم يكتف سبحانه بلفظة العقل حتى ذكر الآيات لأولي الألباب فما كل عاقل ينظر في لب الأمور وبواطنها فإن أهل الظاهر لهم عقول بلا شك وليسوا بأولي الألباب‏\nولا شك أن العصاة لهم عقول ولكن ليسوا بأولي نهى فاختلفت صفاتهم إذ كانت كل صفة تعطي صنفا من العلم لا يحصل إلا لمن حاله تلك الصفة فما ذكرها الله سدى وكثر الله ذكر الآيات في القرآن العزيز ففي مواضع أردفها وتلا بعضها بعضا وأردف صفة العارفين بها وفي مواضع أفردها فمثل إرداف بعضها على بعض مساقها في سورة الروم فلا يزال يقول تعالى ومن آياتِهِ ومن آياتِهِ ومن آياتِهِ فيتلوها جميع الناس ولا يتنبه لها إلا الأصناف الذين ذكرهم في كل آية خاصة فكان تلك الآيات في حق أولئك أنزلت آيات وفي حق غيرهم لمجرد التلاوة ليؤجروا عليها\n\n\n### [النوم واليقظة: من آيات الله‏]\n\n\nولما قرأت هذه السورة وأنا في مقام هذه الطبقة ووصلت إلى قوله ومن آياتِهِ مَنامُكُمْ بِاللَّيْلِ والنَّهارِ وابْتِغاؤُكُمْ من فَضْلِهِ تعجبت كل العجب من حسن نظم القرآن وجمعه ولما ذا قدم ما كان ينبغي في النظر العقلي في ظاهر الأمر أن يكون على غير هذا النظم فإن النهار لابتغاء الفضل والليل للمنام كما قال في القصص ومن رَحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ والنَّهارَ لِتَسْكُنُوا فِيهِ فأعاد الضمير على الليل ولِتَبْتَغُوا من فَضْلِهِ يريد في النهار فأضمر وإن كان الضميران يعودان على المعنى المقصود فقد يعمل الصانع بالليل ويبيع ويشتري بالليل كما أنه ينام أيضا ويسكن بالنهار ولكن الغالب في الأمور هو المعتبر فلاح لي من خلف ستارة هذه الآية وحسن العبارة عنها الرافعة سترها وهو قوله مَنامُكُمْ بِاللَّيْلِ والنَّهارِ أمر زائد على ما يفهم منه في العموم بقرائن الأحوال في ابتغاء الفضل للنهار والمنام لليل ما نذكره‏\n\n\n### [النشأتان: الدنيوية والأخروية]\n\n\nوهو أن الله نبه بهذه الآية على إن نشأة الآخرة الحسية لا تشبه هذه النشأة الدنياوية وإنها ليست بعينها بل تركيب آخر ومزاج آخر كما وردت به الشرائع والتعريفات النبوية في مزاج تلك الدار وإن كانت هذه الجواهر عينها بلا شك فإنها التي تبعثر في القبور وتنشر ولكن يختلف التركيب والمزاج بأعراض وصفات تليق بتلك الدار لا تليق بهذه الدار وإن كانت الصورة واحدة في العين والسمع والأنف والفم واليدين والرجلين بكمال النشأة ولكن الاختلاف بين فمنه ما يشعر به ويحس ومنه ما لا يشعر به ولما كانت صورة الإنشاء في الدار الآخرة على صورة هذه لنشأة لم يشعر بما أشرنا إليه ولما كان الحكم يختلف عرفنا إن المزاج اختلف فهذا الفرق بين حظ الحس والعقل‏\n\n\n### [الدنيا نوم والموت يقظة]\n\n\nفقال تعالى ومن آياتِهِ مَنامُكُمْ بِاللَّيْلِ والنَّهارِ ولم يذكر اليقظة وهي من جملة لآيات فذكر المنام دون اليقظة في حال الدنيا فدل على إن اليقظة لا تكون إلا عند الموت وأن الإنسان نائم أبدا ما لم يمت فذكر أنه في منام بالليل والنهار في يقظته ونومه وفي الخبر الناس نيام فإذا ماتوا انتبهوا\n\n\nأ لا ترى أنه لم يأت بالباء في قوله تعالى والنَّهارِ واكتفى بباء الليل ليحقق بهذه المشاركة أنه يريد المنام في حال اليقظة المعتادة فحذفها مما يقوي الوجه الذي أبرزناه في هذه الآية فالمنام هو ما يكون فيه النائم في حال نومه فإذا استيقظ يقول رأيت كذا وكذا فدل إن الإنسان في منام ما دام في هذه النشأة في الدنيا إلى أن يموت فلم يعتبر الحق اليقظة المعتادة عندنا في العموم بل جعل الإنسان في منام في نومه ويقظته كما أوردناه في الخبر النبوي من‏\n\n\nقوله صلى الله عليه وسلم الناس نيام فإذا ماتوا انتبهوا\n\n\nفوصفهم بالنوم في الحياة الدنيا و\n\n\n### [الدنيا حلم يجب تأويله وجسر يجب عبوره‏]\n\n\nالعامة لا تعرف النوم في المعتاد إلا ما جرت به العادة أن يسمى نوما فنبه النبي صلى الله عليه وسلم بل صرح أن الإنسان في منام ما دام في الحياة الدنيا حتى ينتبه في الآخرة والموت أول أحوال الآخرة فصدقه الله بما جاء به في قوله تعالى ومن آياتِهِ مَنامُكُمْ بِاللَّيْلِ وهو النوم العادي والنَّهارِ وهو هذا المنام الذي صرح به رسول الله صلى الله عليه وسلم ولهذا جعل الدنيا عبرة جسرا يعبر أي تعبر كما تعبر الرؤيا التي يراها الإنسان في نومه فكما إن الذي يراه الرائي في حال نومه ما هو مراد لنفسه إنما هو مراد لغيره فيعبر من تلك الصورة المرئية في حال النوم إلى معناها المراد بها في عالم اليقظة إذا استيقظ من نومه كذلك حال الإنسان في الدنيا ما هو مطلوب للدنيا فكل ما يراه من حال وقول وعمل في الدنيا إنما هو مطلوب للآخرة فهناك يعبر ويظهر له ما رآه في الدنيا كما يظهر له في الدنيا إذا استيقظ ما رآه في المنام فالدنيا جسر يعبر ولا يعمر كالإنسان في حال ما يراه في نومه يعبر ولا يعمر فإنه إذا استيقظ لا يجد شيئا مما رآه من خير يراه أو شر وديار وبناء وسفر وأحوال حسنة أو سيئة فلا بد أن يعبر له العارف بالعبارة ما رآه فيقول له تدل رؤياك لكذا على كذا فكذلك الحياة الدنيا منام إذا انتقل إلى الآخرة بالموت لم ينتقل معه شي‏ء مما كان في يده وفي حسه من دار وأهل ومال كما كان حين استيقظ من نومه لم ير شيئا في يده مما كان له حاصلا في رؤياه في حال نومه فلهذا قال تعالى إننا في منام بالليل والنهار وفي الآخرة تكون‏\nاليقظة وهناك تعبر الرؤيا فمن نور الله عين بصيرته وعبر رؤياه هنا قبل الموت أفلح ويكون فيها مثل من رأى رؤيا ثم رأى في رؤياه إنه استيقظ فيقص ما رآه وهو في النوم على حاله على بعض الناس الذين يراهم في نومه فيقول رأيت كذا وكذا فيفسره ويعبره له ذلك الشخص بما يراه في علمه بذلك فإذا استيقظ حينئذ يظهر له أنه لم يزل في منام في حال الرؤيا وفي حال التعبير لها وهو أصح التعبير وكذلك الفطن اللبيب في هذه الدار مع كونه في منامه يرى أنه استيقظ فيعبر رؤياه في منامه لينتبه ويزدجر ويسلك الطريق الأسد فإذا استيقظ بالموت حمد رؤياه وفرح بمنامه وأثمرت له رؤياه خيرا فلهذه الحقيقة ما ذكر الله في هذه الآية اليقظة وذكر المنام وأضافه إلينا بالليل والنهار وكان ابتغاء الفضل فيه في حق من رأى في نومه أنه استيقظ في نومه فيعبر رؤياه وهي حالة الدنيا والله يلهمنا رشد أنفسنا هذا من قوله تعالى يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ فهذا تفصيل آيات المنام بالليل والنهار والابتغاء من الفضل وجعله آيات لِقَوْمٍ يَسْمَعُونَ أي يفهمون كما قال ولا تَكُونُوا كَالَّذِينَ قالُوا سَمِعْنا وهُمْ لا يَسْمَعُونَ أراد الفهم عن الله وقال فيهم صُمٌّ مع كونهم يسمعون بُكْمٌ مع كونهم يتكلمون عُمْيٌ مع كونهم يبصرون فَهُمْ لا يَعْقِلُونَ فنبهتك على ما أراد بالسمع والكلام والبصر هنا\n\n\n### [الركبان أصحاب التدبير: شمائلهم وخصائصهم‏]\n\n\nفهذه الطبقة الركبانية الثانية مأخذهم للأشياء على هذا الحد الذي ذكرناه في هذه الآية وإنما ذكرنا هذا المأخذ لنعرفك بطريقتهم فتتبين لك منزلتهم من غيرهم فلطائفهم بالآيات المنصوبة المعتادة وغير المعتادة قائمة ناظرة إلى نفوس العالم ناظرة إلى الوجوه العرضية التي إليها يتوجهون بسبب أغراضهم ناظرة إلى الحدود الإلهية فيما إليه يتوجهون لا يغفلون عن النظر في ذلك طرفة عين فغفلتهم التي تقتضيها جبلتهم إنما متعلقها منهم عما ضمن لهم فهم متيقظون فيما طلب منهم غافلون عما ضمن لهم حتى لا يخرجون عن حكم الغفلة فإنها من جبلة الإنسان وغير هذه الطائفة صرفتها الغفلة عما يراد منها فإن كان الذي يقع إليه التوجه طاعة نظروا في دقائق تحصيلها ونظروا إلى الأمر الإلهي الذي يناسبها والاسم الإلهي الذي له السلطان عليها فيفصل لهم الأمر الإلهي الآية التي يطلبونها فإن كانت الآية معتادة مثل اختلاف الليل والنهار وتسخير السحاب وغير ذلك من الآيات المعتادة التي لا خبر لنفوس العامة بكونها حتى يفقدوها فإذا فقدوها حينئذ خرجوا للاستسقاء وعرفوا في ذلك الوقت موضع دلالتها وقدرها وإنهم كانوا في آية وهم لا يشعرون فإذا جاءتهم وأمطروا عادوا إلى غفلتهم هذا حال العامة كما قال الله فيهم معجلا في هذه الدار هُوَ الَّذِي يُسَيِّرُكُمْ في الْبَرِّ والْبَحْرِ حَتَّى إِذا كُنْتُمْ في الْفُلْكِ وجَرَيْنَ بِهِمْ بِرِيحٍ طَيِّبَةٍ وفَرِحُوا بِها جاءَتْها رِيحٌ عاصِفٌ وجاءَهُمُ الْمَوْجُ من كُلِّ مَكانٍ وظَنُّوا أَنَّهُمْ أُحِيطَ بِهِمْ دَعَوُا الله مُخْلِصِينَ لَهُ الدِّينَ ... فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذا هُمْ يُشْرِكُونَ وإِذا هُمْ يَبْغُونَ في الْأَرْضِ بِغَيْرِ الْحَقِّ يقول الله لهم يا أَيُّهَا النَّاسُ إِنَّما بَغْيُكُمْ عَلى‏ أَنْفُسِكُمْ مَتاعَ الْحَياةِ الدُّنْيا وهكذا يقولون في النار يا لَيْتَنا نُرَدُّ قال تعالى ولَوْ رُدُّوا لَعادُوا لِما نُهُوا عَنْهُ كما عاد أصحاب الفلك إلى شركهم وبغيهم بعد إخلاصهم لله فإذا نظرت هذه الطائفة إلى هذه الآيات أرسلوها مع أمرها الإلهي إلى حيث دعاها وإن كانت الآية غير معتادة نظروا أي اسم إلهي يطلبها فإن طلبها القهار وأخواته فهي آية رهبة وزجر ووعيد أرسلوها على النفوس وإن طلبها أعني تلك الآية الاسم اللطيف وأخواته فهي آية رغبة أرسلوها على الأرواح فأشرق لها نور شعشعاني على النفوس فجنحت بذلك النفوس إلى بارئها فرزقت التوفيق والهداية وأعطيت التلذذ بالأعمال فقامت فيها بنشاط وتعرت فيها من ملابس الكسل وتبغض إليها معاشرة البطالين وصحبة الغافلين اللاهين عن ذكر الله ويكرهون الملأ والجلوة ويؤثرون الانفراد والخلوة ولهذه الطبقة الثانية حقيقة ليلة القدر وكشفها وسرها ومعناها ولهم فيها حكم إلهي اختصوا به وهي حظهم من الزمان فانظر ما أشرف إذ حباهم الله من الزمان بأشرفه فإنها خير من ألف شهر فيه زمان رمضان ويوم الجمعة ويوم عاشوراء ويوم عرفة وليلة القدر فكأنه قال فتضاعف خيرها ثلاثا وثمانين ضعفا وثلث ضعف لأنها ثلاث وثمانون سنة وأربعة أشهر وقد تكون الأربعة الأشهر مما يكون فيها ليلة القدر فيكون التضعيف في كل ليلة قدر أربعة وثمانين ضعفا فانظر ما في هذا الزمان من الخير وبأي زمان خصت هذه الطائفة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء الثامن عشر والحمد لله‏",
    "en": "**Chapter Thirty-Two: Concerning the Knowledge of the Directing Poles, the Masters of the Mounts (أصحاب الركاب), from the Second Class**\n\n> Indeed, Direction (التدبر) is beloved to its possessor;\n> By it, the Divine Names (الأسماء) and the cosmic cycles (الدول) are enamored.\n\n> Upon him (the Director), when the One Who decrees His requests (Allah) acts,\n> Is the execution (العمل) in everything that its existence necessitates.\n\n> By it, the wonders within the Cosmos (الكون) are ordered,\n> For every existence has an appointed term (أجل) in His Knowledge (علم).\n\n### The Directing Riders in Seville\n\nI met a group of this class in Seville (إشبيلية) in the lands of al-Andalus. Among them was Abū Yaḥyā al-Ṣanhājī, the blind man, who resided in the Zubaidī Mosque. I accompanied him until he died and was buried on a high, windy mountain to the east. Climbing the mountain was difficult for everyone due to its height and strong winds. But Allah calmed the wind, and it did not blow from the moment we placed him on the mountain until we finished digging his grave and cutting the stone. We buried him in his resting place and departed. As soon as we left, the wind returned to its usual state, which astonished the people.\n\nAlso among them were Ṣāliḥ al-Barbarī, Abū ʿAbd Allāh al-Sharafī, and Abū al-Ḥajjāj Yūsuf al-Sharbīlī. As for Ṣāliḥ, he traveled for forty years and then remained in the al-Raṭand Mosque in Seville for forty years in a state of spiritual detachment (التجريد), maintaining the condition he had during his travels. As for Abū ʿAbd Allāh al-Sharafī, he was a Master of the Step (صاحب خطوة); for nearly fifty years, no lamp was lit in his house. I witnessed wonders from him. As for Abū al-Ḥajjāj al-Sharbīlī, from a village called Sharbula east of Seville, he was among those who walked on water and associated with spirits (الأرواح). I maintained a relationship of affection, blending, and love with every one of these men, and they reciprocated that love toward me. I have mentioned them along with my masters in *The Precious Pearl* (الدرة الفاخرة) when discussing those from whom I benefited on the path to the Hereafter.\n\n### The Customary and Non-Customary Signs\n\nThese four men belonged to this station (المقام); they were among the great ones of the Blameworthy (الملامية) saints. The science of Direction (التدبير) and Detailing (التفصيل) was placed in their hands. Thus, they possess the Name: The Directing, the Detailing. Their constant invocation is: <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ>> (He directs the affair, detailing the Signs). They are the Brides, the people of the platforms (أهل المنصات), for whom there are both customary and non-customary Signs (الآيات).\n\nThe entire cosmos (العالم) is, in their view, clear Signs (آيات بينات). The common people (العامة), however, only consider those Signs that are non-customary to be Signs. These non-customary Signs alert them to the magnification of Allah.\n\nAllah has established the customary Signs for various classes of His servants. Some are for those who reason (العقلاء), such as His saying, the Exalted: <<إِنَّ في خَلْقِ السَّماواتِ والْأَرْضِ واخْتِلافِ اللَّيْلِ والنَّهارِ والْفُلْكِ الَّتِي تَجْرِي في الْبَحْرِ بِما يَنْفَعُ النَّاسَ وما أَنْزَلَ الله من السَّماءِ من ماءٍ فَأَحْيا به الْأَرْضَ بَعْدَ مَوْتِها وبَثَّ فِيها من كُلِّ دَابَّةٍ وتَصْرِيفِ الرِّياحِ والسَّحابِ الْمُسَخَّرِ بَيْنَ السَّماءِ والْأَرْضِ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ>> (Indeed, in the creation of the heavens and the earth and the alternation of the night and the day and the [great] ships which sail through the sea with that which benefits humanity, and what Allah has sent down from the sky of rain and given life thereby to the earth after its lifelessness and dispersed therein every [kind of] moving creature, and [in] the directing of the winds and the clouds subjected between the heaven and earth—are Signs for a people who reason).\n\nThus, there are Signs for those who reason, all of which are customary. And there are Signs for those certain (لِلْمُوقِنِينَ), Signs for those with inner core (لِأُولِي الْأَلْبابِ), Signs for those with understanding (لِأُولِي النُّهى), Signs for those who hear (للسامعين)—who are the people of understanding from Allah—Signs for those who know (لِلْعَالِمِينَ), Signs for the believers (لِلْمُؤْمِنِينَ), Signs for those who reflect (لِلْمُتَفَكِّرِينَ), and Signs for the people of remembrance (لِأَهْلِ التَّذَكُّرِ).\n\nAll of these are classes whom Allah has described with different descriptions and different Signs, all of which He mentioned to us in the Quran. If you research and reflect upon them, you will know that they are Signs and indications of various matters that return to a single Essence (عين واحدة). Most people are heedless of this, which is why He enumerated the classes.\n\n### Classes of Creation in Perceiving Customary Signs\n\nAmong the customary Signs mentioned, some have indications that are perceived by people simply by virtue of their being humans, jinn, and angels. These are the Signs whose perception is attributed to the one who knows (العالم) [with an open *lām*].\n\nOther Signs are subtle, such that only those who possess sound reflection (التفكر السليم) can perceive them. And some Signs have indications conditioned by the possessors of the inner core (أولي الألباب), who are the rational ones looking into the core of matters, not their husks. They are the researchers of meanings. Although *al-albāb* and *al-nuhā* are both intellects (*al-ʿuqūl*), the Exalted did not suffice with the word \"intellect\" (*al-ʿaql*) but also mentioned Signs for the possessors of the inner core. Not every rational person looks into the core and inner dimensions of matters, for the people of the outward (أهل الظاهر) undoubtedly have intellects, but they are not possessors of the inner core.\n\nThere is no doubt that the disobedient have intellects, but they are not possessors of understanding (أولي نهى). Their descriptions differ because each description grants a class of knowledge that is only attained by the one whose state corresponds to that description. Allah did not mention them in vain.\n\nAllah has multiplied the mention of Signs in the Glorious Quran. In some places, He follows them up, one after the other, and follows them up with the description of those who know them. In other places, He mentions them individually. An example of following them up is the sequence in Sūrat al-Rūm, where the Exalted continuously says: <<وَمِنْ آيَاتِهِ>> (And among His Signs is...), and all people recite them, but only the specific classes mentioned in connection with each Sign are alerted to them. Thus, those Signs were revealed as Signs specifically for those people, while for others, they are merely for recitation, for which they are rewarded.\n\n### Sleep and Wakefulness: Among the Signs of Allah\n\nWhen I read this Sūrah while I was in the station of this class (الطبقة), and I reached His saying: <<وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ وَابْتِغَاؤُكُمْ مِنْ فَضْلِهِ>> (And among His Signs is your sleep by night and day, and your seeking of His bounty), I was utterly astonished by the excellent composition and compilation of the Quran, and why He presented what, according to outward rational consideration, ought to have been in a different order. For the day is for seeking bounty, and the night is for sleep, as He said in Sūrat al-Qaṣaṣ: <<وَمِنْ رَحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا فِيهِ>> (And out of His mercy He made for you the night and the day that you might rest therein)—the pronoun refers back to the night—<<وَلِتَبْتَغُوا مِنْ فَضْلِهِ>> (and that you might seek of His bounty)—meaning in the day, so He implied it.\n\nAlthough both pronouns refer to the intended meaning, the artisan may work at night, and one may buy and sell at night, just as one may also sleep and rest during the day. However, the prevailing state is what is considered.\n\nWhat became clear to me from behind the curtain of this Sign, and the excellence of its expression which lifts its veil, is that His saying: <<مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ>> (your sleep by night and day) implies something beyond what is generally understood by the contextual clues of seeking bounty during the day and sleep during the night, which we shall now mention.\n\n### The Two Existences: Worldly and Otherworldly\n\nThis is that Allah, by this Sign, alerts us that the sensory existence of the Hereafter (نشأة الآخرة الحسية) does not resemble this worldly existence (النشأة الدنياوية). It is not identical to it, but rather a different composition (تركيب آخر) and a different temperament (مزاج آخر), as conveyed by the Divine Laws and the prophetic definitions regarding the temperament of that abode.\n\nAlthough the essential substances (الجواهر) are undoubtedly the same—for they are what are scattered in the graves and resurrected—the composition and temperament differ due to accidents and qualities appropriate for that abode, which are not appropriate for this abode. Even if the form is the same in the eye, ear, nose, mouth, hands, and feet, with the completeness of the existence, the difference is clear. Some of this difference is perceived and felt, and some is not. Since the form of creation in the Hereafter is in the image of this existence, one does not perceive what we have alluded to. But since the ruling (الحكم) differs, we know that the temperament has changed. This is the difference between the portion of the senses and the portion of the intellect.\n\n### The World is Sleep and Death is Wakefulness\n\nThe Exalted said: <<وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ>> (And among His Signs is your sleep by night and day), and He did not mention wakefulness (اليقظة), even though it is one of the Signs. He mentioned sleep (المنام) without wakefulness in the context of the worldly state, indicating that wakefulness only occurs at the time of death, and that the human being is perpetually asleep until he dies. Thus, He mentioned that the human is in sleep by night and day, in his wakefulness and his sleep.\n\nIt is mentioned in the Hadith: \"Mankind is asleep, and when they die, they awaken.\"\n\nDo you not see that He did not use the preposition *bi* (باء) in His saying <<وَالنَّهَارِ>> (and the day), but sufficed with the *bāʾ* of the night, to confirm by this association that He intends sleep even in the customary state of wakefulness? The omission of the *bāʾ* strengthens the interpretation we have brought forth regarding this Sign.\n\nSleep (المنام) is the state in which the sleeper is during his slumber. When he wakes up, he says, \"I saw such and such.\" This indicates that the human being is in a state of sleep as long as he is in this worldly existence until he dies. Thus, the Real (الحق) did not consider the customary wakefulness we generally experience, but rather made the human being in a state of sleep during his slumber and his wakefulness, as we cited in the prophetic Hadith:\n\nHis saying, peace and blessings be upon him: \"Mankind is asleep, and when they die, they awaken.\"\n\nHe described them as being asleep during the life of this world.\n\n### The World is a Dream that Must be Interpreted and a Bridge that Must be Crossed\n\nThe common people only know sleep in the customary sense, which is habitually called sleep. But the Prophet, peace and blessings be upon him, alerted—indeed, he explicitly stated—that the human being is in a state of sleep as long as he is in the life of this world until he awakens in the Hereafter, and death is the first state of the Hereafter.\n\nAllah confirmed what he brought in His saying: <<وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ>> (And among His Signs is your sleep by night), which is ordinary sleep, <<وَالنَّهَارِ>> (and the day), which is this sleep that the Messenger of Allah, peace and blessings be upon him, explicitly stated.\n\nFor this reason, the world (الدنيا) is made an example (عبرة), a bridge (جسرا) to be crossed (*yuʿbar*), meaning it is interpreted, just as the vision (الرؤيا) a person sees in his sleep is interpreted. Just as what the dreamer sees in his sleep is not intended for itself, but is intended for something else, and is interpreted (crossed over) from that visible image in the state of sleep to its intended meaning in the world of wakefulness when he awakens from his sleep—likewise is the state of the human in the world. What is sought is not the world itself. Everything he sees of states, words, and actions in the world is only sought for the Hereafter. There, it is interpreted, and what he saw in the world becomes manifest to him, just as what he saw in the dream becomes manifest to him in the world when he wakes up.\n\nThe world is a bridge to be crossed, not to be built upon, just like the state of a person in what he sees in his sleep: it is interpreted, not built upon. For when he wakes up, he finds nothing of the good or evil, the homes, the buildings, the travel, or the good or bad states that he saw. The interpreter (العارف بالعبارة) must interpret for him what he saw, saying, \"Your vision indicates such and such.\"\n\nLikewise, the life of this world is sleep. When one transitions to the Hereafter through death, nothing of what was in his hand or his senses—no house, family, or wealth—transfers with him, just as when he woke up from his sleep, he found nothing in his hand of what he had acquired in his vision during his slumber.\n\nFor this reality, Allah did not mention wakefulness (اليقظة) in this Sign, but mentioned sleep (المنام) and attributed it to us by night and day. And the seeking of bounty (ابتغاء الفضل) therein is for the one who sees in his sleep that he has awakened in his sleep and interprets his vision—which is the state of the world. May Allah inspire us with the guidance of our souls.\n\nThis is derived from His saying, the Exalted: <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ>> (He directs the affair, detailing the Signs). This is the detailing of the Signs of sleep by night and day and the seeking of bounty, and He made them Signs <<لِقَوْمٍ يَسْمَعُونَ>> (for a people who hear), meaning they understand, as He said: <<وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ>> (And be not like those who say, \"We have heard,\" while they do not hear)—He meant understanding from Allah. And He described them as <<صُمٌّ>> (deaf) despite their hearing, <<بُكْمٌ>> (dumb) despite their speaking, <<عُمْيٌ>> (blind) despite their seeing, <<فَهُمْ لَا يَعْقِلُونَ>> (so they do not reason). Thus, I have alerted you to what He intended by hearing, speech, and sight here.\n\n### The Riders, Masters of Direction: Their Characteristics and Qualities\n\nThis Second Class of Riders (الركبانية الثانية) takes their approach to things according to the limit we have mentioned in this Sign. We only mentioned this approach to acquaint you with their method, so that their rank among others becomes clear to you.\n\nTheir subtleties regarding the established Signs, both customary and non-customary, are active, observing the souls of the world (نفوس العالم), observing the accidental aspects (الوجوه العرضية) toward which they turn due to their purposes, and observing the Divine Limits (الحدود الإلهية) in what they turn toward. They do not neglect this observation for the blink of an eye.\n\nTheir negligence (غفلتهم), which their nature necessitates, is only related to what has been guaranteed to them [by Allah]. They are vigilant concerning what is demanded of them, and negligent concerning what has been guaranteed to them, so that they do not depart from the rule of negligence, for it is part of human nature (جبلة الإنسان). Other groups, however, are diverted by negligence from what is required of them.\n\nIf the object of their attention is an act of obedience, they look into the subtleties of its realization, and they look at the Divine Command (الأمر الإلهي) that suits it, and the Divine Name (الاسم الإلهي) that has authority over it. The Divine Command then details for them the Sign they seek.\n\nIf the Sign is customary—such as the alternation of night and day, the subjugation of the clouds, and other customary Signs—the souls of the common people have no awareness of their significance until they lose them. When they lose them, they then go out for the prayer for rain (الاستسقاء) and recognize at that time the place of their indication and their value, realizing that they were in a Sign without perceiving it. When the Sign returns and they are given rain, they revert to their negligence.\n\nThis is the state of the common people, as Allah said concerning them, hastening their punishment in this world: <<هُوَ الَّذِي يُسَيِّرُكُمْ في الْبَرِّ والْبَحْرِ حَتَّى إِذا كُنْتُمْ في الْفُلْكِ وجَرَيْنَ بِهِمْ بِرِيحٍ طَيِّبَةٍ وفَرِحُوا بِها جاءَتْها رِيحٌ عاصِفٌ وجاءَهُمُ الْمَوْجُ من كُلِّ مَكانٍ وظَنُّوا أَنَّهُمْ أُحِيطَ بِهِمْ دَعَوُا الله مُخْلِصِينَ لَهُ الدِّينَ ... فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذا هُمْ يُشْرِكُونَ وَإِذَا هُمْ يَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ>> (It is He who enables you to travel on land and sea until, when you are in the ships and they sail with them by a good wind and they rejoice therein, there comes a violent wind, and the waves come upon them from every side, and they think that they are overwhelmed, they call upon Allah, sincere to Him in religion... But when He delivers them to the land, behold, they associate others with Him, and behold, they commit injustice on the earth without right). Allah says to them: <<يَا أَيُّهَا النَّاسُ إِنَّمَا بَغْيُكُمْ عَلَى أَنْفُسِكُمْ مَتَاعَ الْحَيَاةِ الدُّنْيَا>> (O mankind, your injustice is only against yourselves, [being merely] the enjoyment of worldly life).\n\nSimilarly, they will say in the Fire: <<يَا لَيْتَنَا نُرَدُّ>> (Oh, would that we could be returned!). The Exalted said: <<وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ>> (And even if they were returned, they would return to that which they were forbidden), just as the masters of the ship returned to their polytheism and injustice after their sincerity to Allah.\n\nWhen this class (the Riders) observes these Signs, they dispatch them, along with their Divine Command, to wherever they are called.\n\nIf the Sign is non-customary, they observe which Divine Name demands it. If the Name *al-Qahhār* (The Dominator) and its sisters demand it, it is a Sign of dread, rebuke, and threat, and they dispatch it upon the souls (النفوس). If the Name *al-Laṭīf* (The Subtle) and its sisters demand that Sign, it is a Sign of desire (رغبة), and they dispatch it upon the spirits (الأرواح). A radiant light then shines upon the souls, causing those souls to incline toward their Creator. They are granted success and guidance, and they are given delight in their actions. They perform them with vigor, shedding the garments of laziness. They despise the company of the idle and the heedless who are distracted from the remembrance of Allah. They dislike crowds and public display, preferring solitude and retreat (الخلوة).\n\nThis Second Class possesses the Reality (حقيقة), the Unveiling (كشف), the Secret (سر), and the Meaning (معنى) of the Night of Power (ليلة القدر). They have a Divine Ruling concerning it that is exclusive to them, and it is their portion of time. Consider how noble this is, for Allah has favored them with the noblest of times. It is <<خَيْرٌ مِنْ أَلْفِ شَهْرٍ>> (better than a thousand months), which includes the time of Ramadan, the Day of Jumuʿah, the Day of ʿĀshūrāʾ, the Day of ʿArafah, and the Night of Power. It is as if He said that its goodness is multiplied eighty-three and one-third times, because it is eighty-three years and four months. And sometimes the four months are those in which the Night of Power occurs, so the multiplication is eighty-four times for every Night of Power. Consider the goodness contained in this time and the time with which this class has been specially favored.\n\n<<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\nThe Eighteenth Part is concluded, and praise belongs to Allah.",
    "ur": "## (باب بتیسواں: مدبر اقطاب، یعنی طبقہ دوم کے اصحاب رکاب کی معرفت میں)\n\nتدبیر اپنے صاحب کا معشوق ہے،\nاسی سے اسماء اور سلطنتوں نے عشق کیا ہے۔\n\nاس پر، اس کے نزدیک جو اس کے معاملات کا فیصلہ کرتا ہے،\nہر اس چیز میں جو اس کا وجود تقاضا کرتا ہے، عمل لازم ہے۔\n\nاسی سے کائنات میں موجود ہر حیرت انگیز چیز منظم ہوئی،\nپس ہر وجود کے لیے اس کے علم میں ایک مقررہ وقت ہے۔\n\n### [اشبیلیہ کے مدبر سوار]\n\nمیں ان (دوسرے) طبقے کے لوگوں میں سے ایک جماعت سے اندلس کے شہر اشبیلیہ میں ملا۔ ان میں سے ایک ابو یحییٰ الصنہاجی الضریر تھے جو مسجد الزبیدی میں رہتے تھے۔ میں ان کی صحبت میں رہا یہاں تک کہ وہ وفات پا گئے اور ایک بلند، تیز ہواؤں والے پہاڑ پر مشرق کی جانب دفن ہوئے۔ ہر شخص کے لیے پہاڑ کی بلندی اور تیز ہواؤں کی وجہ سے اس پر چڑھنا مشکل تھا۔ لیکن جس وقت ہم نے انہیں پہاڑ پر رکھا، اللہ تعالیٰ نے ہوا کو ساکن کر دیا اور وہ نہیں چلی۔ لوگوں نے ان کی قبر کھودنا اور پتھر کاٹنا شروع کیا یہاں تک کہ ہم فارغ ہوئے اور انہیں ان کے باغ (قبر) میں دفن کر کے واپس لوٹے۔ جب ہم واپس لوٹے تو ہوا اپنی عادت کے مطابق چلنے لگی۔ لوگوں نے اس پر بہت تعجب کیا۔\n\nان میں صالح البربری، ابو عبداللہ الشرفی اور ابو الحجاج یوسف الشبربلی بھی شامل تھے۔ صالح نے چالیس سال سیاحت کی اور پھر اشبیلیہ میں مسجد الرطند میں چالیس سال تک اسی تجرید (دنیا سے بے تعلقی) کی حالت میں قیام کیا جس پر وہ اپنی سیاحت میں تھے۔ ابو عبداللہ الشرفی صاحبِ خطوہ (قدم کی طاقت رکھنے والے) تھے، وہ تقریباً پچاس سال تک رہے اور ان کے گھر میں کبھی چراغ نہیں جلایا گیا۔ میں نے ان کے بہت سے عجائبات دیکھے۔ ابو الحجاج الشبربلی، جو اشبیلیہ کے مشرق میں شبربل نامی گاؤں سے تھے، ان لوگوں میں سے تھے جو پانی پر چلتے تھے اور جن سے ارواح معاشرت کرتی تھیں۔ ان میں سے کوئی ایسا نہیں جس سے میں نے محبت، امتزاج اور مودت کی معاشرت نہ کی ہو، اور ان کی طرف سے بھی ہم سے محبت تھی۔ ہم نے ان کا ذکر اپنے مشائخ کے ساتھ \"الدرۃ الفاخرۃ\" میں کیا ہے جب ہم نے ان لوگوں کا ذکر کیا جن سے مجھے آخرت کے راستے میں فائدہ ہوا۔\n\n### [معتاد اور غیر معتاد نشانیاں (آیات)]\n\nیہ چاروں اس مقام کے اہل تھے اور اکابر اولیاء ملامیہ میں سے تھے۔ ان کے ہاتھوں میں تدبیر اور تفصیل کا علم رکھا گیا ہے۔ لہٰذا ان کا نام المدبر المفصل (تدبیر کرنے والا، تفصیل دینے والا) ہے۔ اور ان کا ورد یہ ہے: يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ (وہ امر کی تدبیر کرتا ہے، وہ آیات (نشانیاں) کو تفصیل سے بیان کرتا ہے)۔ یہ عرائس (دلہنیں) ہیں، اہل منصات (بلند مقامات والے) ہیں۔ ان کے لیے معتاد (عام) اور غیر معتاد (غیر معمولی) دونوں طرح کی نشانیاں ہیں۔\n\nان کے نزدیک پوری کائنات واضح نشانیاں (آیات بینات) ہے۔ جبکہ عام لوگوں کے نزدیک نشانیاں صرف وہی ہیں جو ان کے لیے غیر معتاد (غیر معمولی) ہوں۔ یہ غیر معتاد نشانیاں انہیں اللہ کی عظمت کی طرف متوجہ کرتی ہیں۔\n\nاللہ تعالیٰ نے معتاد نشانیاں اپنے مختلف اصناف کے بندوں کے لیے بنائی ہیں۔ ان میں سے کچھ عقل مندوں کے لیے ہیں، جیسا کہ اللہ تعالیٰ کا فرمان ہے: إِنَّ في خَلْقِ السَّماواتِ والْأَرْضِ واخْتِلافِ اللَّيْلِ والنَّهارِ والْفُلْكِ الَّتِي تَجْرِي في الْبَحْرِ بِما يَنْفَعُ النَّاسَ وما أَنْزَلَ الله من السَّماءِ من ماءٍ فَأَحْيا به الْأَرْضَ بَعْدَ مَوْتِها وبَثَّ فِيها من كُلِّ دَابَّةٍ وتَصْرِيفِ الرِّياحِ والسَّحابِ الْمُسَخَّرِ بَيْنَ السَّماءِ والْأَرْضِ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ (بیشک آسمانوں اور زمین کی تخلیق میں، اور رات اور دن کے بدلنے میں، اور ان کشتیوں میں جو سمندر میں لوگوں کو نفع پہنچانے والی چیزیں لے کر چلتی ہیں، اور اس پانی میں جو اللہ نے آسمان سے نازل کیا، پھر اس کے ذریعے زمین کو اس کی موت کے بعد زندہ کیا اور اس میں ہر طرح کے جاندار پھیلا دیے، اور ہواؤں کے رخ بدلنے میں، اور اس بادل میں جو آسمان اور زمین کے درمیان مسخر ہے، ان سب میں ان لوگوں کے لیے نشانیاں ہیں جو عقل رکھتے ہیں)۔\n\nپس وہاں عقل مندوں کے لیے نشانیاں ہیں جو سب کی سب معتاد ہیں۔ اور نشانیاں ہیں یقین رکھنے والوں (لِلْمُوقِنِينَ) کے لیے، اور نشانیاں ہیں عقل والوں (لِأُولِي الْأَلْبابِ) کے لیے، اور نشانیاں ہیں سمجھ والوں (لِأُولِي النُّهىٰ) کے لیے، اور نشانیاں ہیں سننے والوں (لِلسَّامِعِينَ) کے لیے جو اللہ کی طرف سے سمجھ رکھتے ہیں، اور نشانیاں ہیں جاننے والوں (لِلْعَالِمِينَ) کے لیے، اور نشانیاں ہیں ایمان والوں (لِلْمُؤْمِنِينَ) کے لیے، اور نشانیاں ہیں غور و فکر کرنے والوں (لِلْمُتَفَكِّرِينَ) کے لیے، اور نشانیاں ہیں نصیحت حاصل کرنے والوں (لِأَهْلِ التَّذَكُّرِ) کے لیے۔ یہ سب مختلف اصناف ہیں جنہیں اللہ نے مختلف صفات اور مختلف نشانیوں سے بیان کیا ہے۔ یہ سب اس نے ہمارے لیے قرآن میں ذکر کیا ہے۔ اگر تم ان کی تحقیق کرو اور ان پر تدبر کرو تو تمہیں معلوم ہو گا کہ یہ نشانیاں اور دلائل مختلف امور پر دلالت کرتے ہیں جو ایک ہی حقیقت کی طرف لوٹتے ہیں۔ اکثر لوگ اس سے غافل ہیں، اسی لیے اس نے اصناف کو شمار کیا ہے۔\n\n### [معتاد نشانیوں کے ادراک میں مخلوق کی اصناف]\n\nان مذکورہ معتاد نشانیوں میں سے کچھ ایسی ہیں جن کی دلالت کو لوگ بحیثیت انسان، جن اور فرشتے ہونے کے ناطے ادراک کر لیتے ہیں، اور یہی وہ ہیں جن کے ادراک کی صفت عالم (عین پر زبر کے ساتھ) کے لیے بیان کی گئی ہے۔ اور کچھ نشانیاں ایسی ہیں جو گہری ہوتی ہیں، جن کا ادراک صرف وہی کر سکتا ہے جو سلیم غور و فکر رکھتا ہو۔ اور کچھ نشانیاں ایسی ہیں جن کی دلالت اولی الالباب (عقل والوں) کے ساتھ مشروط ہے، اور وہ وہ عقل مند ہیں جو معاملات کے مغز (لب) میں دیکھتے ہیں نہ کہ ان کے چھلکوں میں۔ پس وہ معانی کی تحقیق کرنے والے ہیں۔ اگرچہ الالباب اور النہیٰ دونوں عقلیں ہیں، لیکن اللہ سبحانہ و تعالیٰ نے صرف لفظ عقل پر اکتفا نہیں کیا بلکہ اولی الالباب کے لیے بھی نشانیاں ذکر کیں۔ کیونکہ ہر عقل مند امور کے مغز اور باطن میں نظر نہیں کرتا۔ اہل ظاہر بلاشبہ عقل رکھتے ہیں لیکن وہ اولی الالباب نہیں ہیں۔\n\nاور بلاشبہ گناہ گار بھی عقل رکھتے ہیں لیکن وہ اولی النہیٰ (سمجھ والے) نہیں ہیں۔ پس ان کی صفات مختلف ہو گئیں، کیونکہ ہر صفت علم کی ایک صنف عطا کرتی ہے جو صرف اسی کو حاصل ہوتی ہے جس کی حالت وہ صفت ہو۔ پس اللہ نے ان کا ذکر بے فائدہ نہیں کیا۔ اللہ تعالیٰ نے قرآن عزیز میں نشانیوں کا ذکر کثرت سے کیا ہے۔ بعض مقامات پر اس نے انہیں ایک دوسرے کے ساتھ جوڑ دیا اور ان کے ساتھ ان کو جاننے والے عارفین کی صفت کو بھی جوڑ دیا۔ اور بعض مقامات پر انہیں الگ الگ بیان کیا۔\n\nجیسے سورۃ الروم میں ان کا ایک دوسرے کے ساتھ جوڑنا ہے، جہاں اللہ تعالیٰ مسلسل فرماتا ہے: وَمِنْ آيَاتِهِ (اور اس کی نشانیوں میں سے ہے)۔ پس تمام لوگ اس کی تلاوت کرتے ہیں، لیکن صرف وہی اصناف اس پر متنبہ ہوتے ہیں جن کا ذکر ہر خاص آیت میں کیا گیا ہے۔ پس وہ نشانیاں ان لوگوں کے حق میں نشانیاں بنا کر نازل کی گئیں، اور دوسروں کے حق میں صرف تلاوت کے لیے تاکہ انہیں اس پر اجر ملے۔\n\n### [نیند اور بیداری: اللہ کی نشانیوں میں سے]\n\nجب میں اس طبقے کے مقام پر تھا اور میں نے اس سورت کی تلاوت کی اور اللہ تعالیٰ کے اس فرمان پر پہنچا: وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ وَابْتِغَاؤُكُمْ مِنْ فَضْلِهِ (اور اس کی نشانیوں میں سے تمہارا رات اور دن میں سونا اور اس کے فضل کو تلاش کرنا ہے)، تو مجھے قرآن کے حسنِ نظم اور اس کے جمع کرنے پر کمال تعجب ہوا، اور اس بات پر بھی کہ اس نے اس چیز کو کیوں مقدم کیا جسے ظاہری عقلی نظر میں اس نظم پر نہیں ہونا چاہیے تھا۔ کیونکہ دن فضل کو تلاش کرنے کے لیے ہے اور رات سونے کے لیے ہے، جیسا کہ سورۃ القصص میں فرمایا: وَمِنْ رَحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا فِيهِ (اور اس کی رحمت سے اس نے تمہارے لیے رات اور دن بنائے تاکہ تم اس میں سکون حاصل کرو)۔ یہاں ضمیر رات کی طرف لوٹائی، وَلِتَبْتَغُوا مِنْ فَضْلِهِ (اور تاکہ تم اس کا فضل تلاش کرو)۔ یہاں دن مراد ہے، پس ضمیر کو مضمر رکھا، اگرچہ دونوں ضمیریں مقصود معنی کی طرف لوٹتی ہیں۔\n\nصنعت کار رات کو بھی کام کرتا ہے اور رات کو بھی خرید و فروخت کرتا ہے، جیسا کہ وہ دن کو بھی سوتا اور سکون حاصل کرتا ہے، لیکن امور میں غالب چیز ہی معتبر ہوتی ہے۔\n\nاس آیت کے پردے کے پیچھے سے اور اس کے حسنِ عبارت سے جو اس کا پردہ اٹھاتی ہے، میرے لیے یہ بات واضح ہوئی، اور وہ ہے اس کا فرمان: مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ (تمہارا رات اور دن میں سونا)۔ یہ اس سے زیادہ ایک امر ہے جو عام طور پر حالات کے قرائن سے سمجھا جاتا ہے کہ دن فضل کی تلاش کے لیے ہے اور رات سونے کے لیے ہے۔ وہ یہ ہے جو ہم ذکر کریں گے۔\n\n### [دو نشأتیں: دنیاوی اور اخروی]\n\nوہ یہ ہے کہ اللہ نے اس آیت کے ذریعے اس بات پر متنبہ کیا ہے کہ آخرت کی حسی نشأت اس دنیاوی نشأت سے مشابہت نہیں رکھتی، اور یہ کہ وہ بعینہٖ یہی نہیں ہے، بلکہ ایک اور ترکیب اور ایک اور مزاج ہے، جیسا کہ شرائع اور نبوی تعریفات میں اس دار کے مزاج کے بارے میں وارد ہوا ہے۔ اگرچہ یہ جواہر (اجزاء) بلاشبہ بعینہٖ وہی ہیں، کیونکہ یہی وہ ہیں جو قبروں میں بکھریں گے اور پھر نشر کیے جائیں گے، لیکن ترکیب اور مزاج میں فرق ہو گا، ان اعراض اور صفات کے ساتھ جو اس دار کے لائق ہیں، نہ کہ اس دار کے۔ اگرچہ صورت آنکھ، کان، ناک، منہ، ہاتھوں اور پیروں میں نشأت کی تکمیل کے ساتھ ایک ہی ہو گی، لیکن اختلاف واضح ہو گا۔ اس میں سے کچھ وہ ہے جس کا شعور اور احساس ہوتا ہے، اور کچھ وہ ہے جس کا شعور نہیں ہوتا۔\n\nچونکہ دار آخرت میں تخلیق کی صورت اس نشأت کی صورت پر ہو گی، اس لیے اس کا شعور نہیں ہو گا جس کی طرف ہم نے اشارہ کیا ہے۔ اور چونکہ حکم مختلف ہو گا، اس لیے ہم نے جان لیا کہ مزاج مختلف ہو گیا ہے۔ پس یہ حس اور عقل کے حصے کے درمیان فرق ہے۔\n\n### [دنیا نیند ہے اور موت بیداری]\n\nاللہ تعالیٰ نے فرمایا: وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ (اور اس کی نشانیوں میں سے تمہارا رات اور دن میں سونا ہے)۔ اور اس نے بیداری کا ذکر نہیں کیا، حالانکہ وہ بھی نشانیوں میں سے ہے۔ پس اس نے دنیا کی حالت میں بیداری کے بجائے نیند کا ذکر کیا۔ یہ اس بات پر دلالت کرتا ہے کہ بیداری صرف موت کے وقت ہو گی، اور انسان ہمیشہ سویا رہتا ہے جب تک کہ وہ مر نہ جائے۔ پس اس نے ذکر کیا کہ وہ رات اور دن میں، اپنی بیداری اور نیند میں، نیند کی حالت میں ہے۔ اور حدیث میں ہے: \"الناس نيام فإذا ماتوا انتبهوا\" (لوگ سوئے ہوئے ہیں، جب وہ مریں گے تو بیدار ہو جائیں گے)۔\n\nکیا تم نہیں دیکھتے کہ اللہ تعالیٰ نے اپنے فرمان \"وَالنَّهَارِ\" میں باء (بِ) کا استعمال نہیں کیا اور صرف رات کی باء پر اکتفا کیا، تاکہ اس شرکت کے ذریعے یہ ثابت کرے کہ وہ معتاد بیداری کی حالت میں بھی نیند مراد لے رہا ہے۔ پس اس کا حذف کرنا اس پہلو کو تقویت دیتا ہے جسے ہم نے اس آیت میں نمایاں کیا ہے۔\n\nنیند وہ ہے جس میں سونے والا اپنی نیند کی حالت میں ہوتا ہے۔ جب وہ بیدار ہوتا ہے تو کہتا ہے کہ میں نے ایسا ایسا دیکھا۔ پس یہ اس بات پر دلالت کرتا ہے کہ انسان جب تک دنیا میں اس نشأت میں ہے، نیند میں ہے، یہاں تک کہ وہ مر جائے۔ پس حق تعالیٰ نے ہمارے نزدیک عام طور پر معتاد بیداری کو معتبر نہیں سمجھا، بلکہ انسان کو اس کی نیند اور بیداری میں نیند کی حالت میں قرار دیا، جیسا کہ ہم نے نبوی حدیث میں بیان کیا ہے:\n\nآپ صلی اللہ علیہ وسلم کا فرمان ہے: \"الناس نيام فإذا ماتوا انتبهوا\" (لوگ سوئے ہوئے ہیں، جب وہ مریں گے تو بیدار ہو جائیں گے)۔\n\nپس آپ نے انہیں دنیا کی زندگی میں نیند سے متصف کیا۔\n\n### [دنیا ایک خواب ہے جس کی تعبیر ضروری ہے اور ایک پل ہے جسے عبور کرنا ہے]\n\nاور عام لوگ نیند کو صرف اسی سے جانتے ہیں جسے عادت کے مطابق نیند کہا جاتا ہے۔ پس نبی صلی اللہ علیہ وسلم نے متنبہ کیا، بلکہ صراحت کی کہ انسان جب تک دنیا کی زندگی میں ہے، نیند میں ہے، یہاں تک کہ وہ آخرت میں بیدار ہو جائے۔ اور موت آخرت کے احوال میں سے پہلا حال ہے۔ پس اللہ نے اس کی تصدیق اپنے اس فرمان سے کی: وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ (اور اس کی نشانیوں میں سے تمہارا رات میں سونا ہے) جو کہ عام نیند ہے، وَالنَّهَارِ (اور دن میں) جو کہ یہ نیند ہے جس کی صراحت رسول اللہ صلی اللہ علیہ وسلم نے کی ہے۔\n\nاسی لیے دنیا کو عبرت (پل) بنایا گیا ہے جسے عبور کیا جاتا ہے، یعنی اس کی تعبیر کی جاتی ہے، جیسے اس خواب کی تعبیر کی جاتی ہے جو انسان اپنی نیند میں دیکھتا ہے۔ پس جس طرح سونے والا اپنی نیند کی حالت میں جو کچھ دیکھتا ہے وہ اس کی ذات کے لیے مراد نہیں ہوتا، بلکہ کسی اور کے لیے مراد ہوتا ہے، پس اس دیکھی ہوئی صورت سے جو نیند کی حالت میں ہے، اس کے مراد معنی کی طرف تعبیر کیا جاتا ہے جو بیداری کی دنیا میں ہے جب وہ اپنی نیند سے بیدار ہوتا ہے۔ اسی طرح دنیا میں انسان کی حالت ہے، جو دنیا کے لیے مطلوب نہیں ہے۔ پس وہ دنیا میں جو کچھ بھی حالت، قول اور عمل دیکھتا ہے، وہ صرف آخرت کے لیے مطلوب ہے۔ وہاں اس کی تعبیر ہو گی اور اس کے لیے وہ ظاہر ہو گا جو اس نے دنیا میں دیکھا، جیسا کہ دنیا میں بیدار ہونے پر اسے وہ ظاہر ہوتا ہے جو اس نے خواب میں دیکھا تھا۔\n\nپس دنیا ایک پل ہے جسے عبور کیا جاتا ہے، اسے آباد نہیں کیا جاتا، جیسے انسان اپنی نیند میں جو کچھ دیکھتا ہے، اس کی تعبیر کی جاتی ہے، اسے آباد نہیں کیا جاتا۔ کیونکہ جب وہ بیدار ہوتا ہے تو اس میں سے کچھ نہیں پاتا جو اس نے دیکھا تھا، خواہ وہ خیر ہو یا شر، گھر ہوں یا عمارتیں، سفر ہو یا اچھی یا بری حالتیں۔ پس تعبیر جاننے والے کے لیے ضروری ہے کہ وہ اس کی تعبیر کرے جو اس نے دیکھا، اور وہ اسے کہتا ہے کہ تمہارا خواب فلاں چیز پر دلالت کرتا ہے۔ اسی طرح دنیا کی زندگی ایک نیند ہے، جب وہ موت کے ذریعے آخرت کی طرف منتقل ہوتا ہے تو اس کے ساتھ اس کے ہاتھ میں اور اس کے حس میں موجود کوئی چیز منتقل نہیں ہوتی، جیسے گھر، اہل اور مال۔ جیسا کہ جب وہ اپنی نیند سے بیدار ہوا تو اس نے اپنے ہاتھ میں کچھ نہیں پایا جو اسے نیند کی حالت میں خواب میں حاصل ہوا تھا۔\n\nاسی لیے اللہ تعالیٰ نے فرمایا کہ ہم رات اور دن میں نیند میں ہیں، اور آخرت میں بیداری ہو گی، اور وہاں خواب کی تعبیر ہو گی۔ پس جس کی بصیرت کی آنکھ کو اللہ نے منور کر دیا اور اس نے موت سے پہلے یہاں اپنے خواب کی تعبیر کر لی، وہ کامیاب ہو گیا۔ اور وہ اس میں اس شخص کی طرح ہو گا جس نے خواب دیکھا، پھر اپنے خواب میں دیکھا کہ وہ بیدار ہو گیا ہے، اور وہ نیند کی حالت میں ہی اپنے دیکھے ہوئے کو ان لوگوں میں سے بعض کو بیان کرتا ہے جنہیں وہ اپنے خواب میں دیکھتا ہے، اور کہتا ہے کہ میں نے ایسا ایسا دیکھا، تو وہ شخص اپنے علم کے مطابق اس کی تفسیر اور تعبیر کرتا ہے۔ جب وہ اس وقت بیدار ہوتا ہے تو اس پر ظاہر ہوتا ہے کہ وہ خواب کی حالت میں اور اس کی تعبیر کی حالت میں بھی نیند میں ہی تھا۔ اور یہ سب سے صحیح تعبیر ہے۔\n\nاسی طرح اس دنیا میں ذہین اور سمجھدار شخص، باوجود اس کے کہ وہ اپنی نیند میں ہے، دیکھتا ہے کہ وہ بیدار ہو گیا ہے، اور وہ اپنے خواب کی تعبیر اپنی نیند میں کرتا ہے تاکہ وہ متنبہ ہو، باز آ جائے اور سیدھا راستہ اختیار کرے۔ پس جب وہ موت کے ذریعے بیدار ہوتا ہے تو وہ اپنے خواب کی تعریف کرتا ہے اور اپنی نیند پر خوش ہوتا ہے، اور اس کا خواب اس کے لیے خیر کا پھل لاتا ہے۔\n\nاسی حقیقت کی وجہ سے اللہ نے اس آیت میں بیداری کا ذکر نہیں کیا اور نیند کا ذکر کیا اور اسے رات اور دن میں ہماری طرف منسوب کیا، اور اس میں فضل کا تلاش کرنا اس شخص کے حق میں ہے جس نے اپنی نیند میں دیکھا کہ وہ اپنی نیند میں بیدار ہو گیا ہے اور اپنے خواب کی تعبیر کر رہا ہے، اور یہی دنیا کی حالت ہے۔ اور اللہ ہمیں ہماری ذات کی رہنمائی کا الہام کرے۔\n\nیہ سب اللہ تعالیٰ کے فرمان: يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ (وہ امر کی تدبیر کرتا ہے، وہ آیات کو تفصیل سے بیان کرتا ہے) سے ہے۔ پس یہ رات اور دن میں نیند کی نشانیوں کی تفصیل ہے اور فضل کو تلاش کرنا، اور اسے لِقَوْمٍ يَسْمَعُونَ (ان لوگوں کے لیے نشانیاں جو سنتے ہیں) بنایا، یعنی جو سمجھتے ہیں، جیسا کہ فرمایا: وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ (اور ان لوگوں کی طرح نہ ہو جاؤ جنہوں نے کہا کہ ہم نے سنا، حالانکہ وہ نہیں سنتے)۔ اس سے مراد اللہ کی طرف سے سمجھنا ہے۔ اور ان کے بارے میں فرمایا: صُمٌّ (بہرے ہیں) باوجود اس کے کہ وہ سنتے ہیں، بُكْمٌ (گونگے ہیں) باوجود اس کے کہ وہ بولتے ہیں، عُمْيٌ (اندھے ہیں) باوجود اس کے کہ وہ دیکھتے ہیں، فَهُمْ لَا يَعْقِلُونَ (پس وہ عقل نہیں رکھتے)۔ پس میں نے تمہیں اس بات پر متنبہ کر دیا جو اس نے یہاں سننے، بولنے اور دیکھنے سے مراد لیا ہے۔\n\n### [اصحاب تدبیر سوار: ان کی خصوصیات اور اوصاف]\n\nیہ دوسرا سواروں کا طبقہ (الطبقة الرکبانیۃ الثانیۃ) چیزوں کو اسی حد پر لیتے ہیں جو ہم نے اس آیت میں ذکر کی ہے۔ اور ہم نے یہ ماخذ صرف اس لیے ذکر کیا تاکہ ہم تمہیں ان کے طریقے سے آگاہ کریں، اور تمہارے لیے ان کا مقام دوسروں سے واضح ہو جائے۔\n\nان کی لطافتیں نصب شدہ معتاد اور غیر معتاد نشانیوں کے ساتھ قائم ہیں، جو عالم کی جانوں پر نظر رکھے ہوئے ہیں، ان عرضی وجوہات پر نظر رکھے ہوئے ہیں جن کی طرف وہ اپنے اغراض کی وجہ سے متوجہ ہوتے ہیں، اور ان الٰہی حدود پر نظر رکھے ہوئے ہیں جن کی طرف وہ متوجہ ہوتے ہیں۔ وہ ایک پلک جھپکنے کے لیے بھی اس نظر سے غافل نہیں ہوتے۔ ان کی غفلت جو ان کی جبلت کا تقاضا ہے، وہ صرف اس چیز سے متعلق ہے جس کی انہیں ضمانت دی گئی ہے۔ پس وہ اس چیز میں بیدار ہیں جو ان سے مطلوب ہے، اور اس چیز سے غافل ہیں جس کی انہیں ضمانت دی گئی ہے، تاکہ وہ غفلت کے حکم سے باہر نہ نکلیں، کیونکہ یہ انسان کی جبلت میں سے ہے۔ اور اس گروہ کے علاوہ دوسروں کو غفلت اس چیز سے پھیر دیتی ہے جو ان سے مطلوب ہے۔\n\nاگر وہ چیز جس کی طرف توجہ کی جاتی ہے، طاعت ہے، تو وہ اس کے حصول کی باریکیوں میں نظر کرتے ہیں، اور اس الٰہی امر میں نظر کرتے ہیں جو اس کے مناسب ہے، اور اس الٰہی اسم میں نظر کرتے ہیں جس کا اس پر تسلط ہے۔ پس الٰہی امر ان کے لیے اس نشانی کی تفصیل کرتا ہے جو وہ طلب کرتے ہیں۔\n\nاگر نشانی معتاد ہے، جیسے رات اور دن کا بدلنا، بادلوں کا مسخر ہونا، اور دیگر معتاد نشانیاں جن کے بارے میں عام لوگوں کی جانوں کو ان کے ہونے کا علم نہیں ہوتا یہاں تک کہ وہ انہیں کھو دیتے ہیں۔ جب وہ انہیں کھو دیتے ہیں، تب وہ بارش طلب کرنے کے لیے نکلتے ہیں اور اس وقت ان کی دلالت اور قدر کو پہچانتے ہیں، اور یہ کہ وہ ایک نشانی میں تھے اور انہیں شعور نہیں تھا۔ پس جب وہ نشانی ان کے پاس آ جاتی ہے اور بارش ہوتی ہے، تو وہ اپنی غفلت کی طرف لوٹ جاتے ہیں۔ یہ عام لوگوں کا حال ہے، جیسا کہ اللہ نے ان کے بارے میں اسی دنیا میں جلدی کرتے ہوئے فرمایا: هُوَ الَّذِي يُسَيِّرُكُمْ فِي الْبَرِّ وَالْبَحْرِ حَتَّى إِذَا كُنْتُمْ فِي الْفُلْكِ وَجَرَيْنَ بِهِمْ بِرِيحٍ طَيِّبَةٍ وَفَرِحُوا بِهَا جَاءَتْهَا رِيحٌ عَاصِفٌ وَجَاءَهُمُ الْمَوْجُ مِنْ كُلِّ مَكَانٍ وَظَنُّوا أَنَّهُمْ أُحِيطَ بِهِمْ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ ... فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ وَإِذَا هُمْ يَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ (وہی ہے جو تمہیں خشکی اور سمندر میں چلاتا ہے، یہاں تک کہ جب تم کشتیوں میں ہوتے ہو اور وہ انہیں اچھی ہوا کے ساتھ لے کر چلتی ہیں اور وہ اس پر خوش ہوتے ہیں، تو ان پر ایک تیز آندھی آ جاتی ہے اور ہر طرف سے ان پر لہریں آتی ہیں اور وہ سمجھتے ہیں کہ وہ گھیر لیے گئے ہیں، تو وہ اللہ کو پکارتے ہیں، اس کے لیے دین کو خالص کرتے ہوئے... پھر جب وہ انہیں خشکی کی طرف نجات دیتا ہے، تو اچانک وہ شرک کرنے لگتے ہیں اور زمین میں ناحق سرکشی کرنے لگتے ہیں)۔ اللہ ان سے فرماتا ہے: يَا أَيُّهَا النَّاسُ إِنَّمَا بَغْيُكُمْ عَلَى أَنْفُسِكُمْ مَتَاعَ الْحَيَاةِ الدُّنْيَا (اے لوگو! تمہاری سرکشی تمہاری جانوں پر ہی ہے، یہ دنیا کی زندگی کا تھوڑا سا فائدہ ہے)۔ اور اسی طرح وہ جہنم میں کہیں گے: يَا لَيْتَنَا نُرَدُّ (کاش ہمیں واپس لوٹا دیا جائے)۔ اللہ تعالیٰ فرماتا ہے: وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ (اور اگر انہیں لوٹا دیا جائے تو وہ وہی کام کریں گے جس سے انہیں منع کیا گیا تھا)، جیسا کہ کشتی والے اللہ کے لیے اخلاص کے بعد اپنے شرک اور سرکشی کی طرف لوٹ گئے۔\n\nجب یہ طبقہ ان نشانیوں کو دیکھتا ہے، تو وہ انہیں ان کے الٰہی امر کے ساتھ وہاں بھیج دیتے ہیں جہاں انہیں بلایا گیا ہے۔ اور اگر نشانی غیر معتاد ہو، تو وہ دیکھتے ہیں کہ کون سا الٰہی اسم اسے طلب کرتا ہے۔ اگر اسے القہار (زبردست) اور اس کے ہم نام طلب کرتے ہیں، تو وہ خوف، ڈانٹ اور وعید کی نشانی ہے، جسے وہ جانوں پر بھیج دیتے ہیں۔ اور اگر اسے، یعنی اس نشانی کو، اسم اللطیف (مہربان) اور اس کے ہم نام طلب کرتے ہیں، تو وہ رغبت کی نشانی ہے، جسے وہ روحوں پر بھیج دیتے ہیں۔ پس اس کے لیے جانوں پر ایک چمکدار نور چمکتا ہے، تو جانیں اس کے ذریعے اپنے خالق کی طرف مائل ہو جاتی ہیں، پس انہیں توفیق اور ہدایت نصیب ہوتی ہے، اور انہیں اعمال میں لذت عطا کی جاتی ہے۔ پس وہ ان میں چستی کے ساتھ کھڑی ہوتی ہیں، اور سستی کے لباس سے پاک ہو جاتی ہیں، اور انہیں بیکار لوگوں کی صحبت اور اللہ کے ذکر سے غافل لہو و لعب کرنے والوں کی صحبت سے نفرت ہو جاتی ہے۔ وہ مجمع اور جلوت (ظاہری محفل) کو ناپسند کرتے ہیں اور تنہائی اور خلوت کو ترجیح دیتے ہیں۔\n\nاس دوسرے طبقے کے لیے لیلۃ القدر کی حقیقت، اس کا کشف، اس کا راز اور اس کا معنی حاصل ہے۔ اور ان کے لیے اس میں ایک الٰہی حکم ہے جس کے ساتھ وہ خاص کیے گئے ہیں، اور یہ زمانے میں ان کا حصہ ہے۔ پس دیکھو یہ کتنا شرف ہے کہ اللہ نے انہیں زمانے کے سب سے اشرف حصے سے نوازا ہے۔ کیونکہ یہ ہزار مہینوں سے بہتر ہے، جس میں رمضان کا زمانہ، جمعہ کا دن، عاشوراء کا دن، عرفہ کا دن اور لیلۃ القدر شامل ہے۔ گویا اس نے فرمایا کہ اس کی خیر تراسی گنا اور ایک تہائی گنا بڑھا دی جاتی ہے، کیونکہ یہ تراسی سال اور چار مہینے ہیں۔ اور ہو سکتا ہے کہ چار مہینے ان میں سے ہوں جن میں لیلۃ القدر ہوتی ہے، تو ہر لیلۃ القدر میں چوراسی گنا اضافہ ہو جاتا ہے۔ پس دیکھو اس زمانے میں کتنی خیر ہے اور اس طبقے کو کس زمانے سے خاص کیا گیا ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\n\nاٹھارہواں حصہ مکمل ہوا، اور تمام تعریفیں اللہ کے لیے ہیں۔",
    "fa": "(باب سی و دوم در معرفت اقطاب مدبر (الأقطاب المدبرين) صاحبان رکاب (أصحاب الركاب) از طبقه دوم)\n\nتدبیر (التدبر) معشوق صاحب خویش است،\nکه به واسطه‌ی آن، اسماء و دولت‌ها عاشق شدند.\nبر اوست، نزد کسی که خواسته‌هایش را برآورده می‌سازد،\nدر هر آنچه هستی‌اش اقتضا می‌کند، عمل کردن.\nبه واسطه‌ی آن، شگفتی‌های موجود در هستی (الکون) نظم یافته است،\nو هر هستی‌ای در علم او اجلی دارد.\n\n[رکاب‌داران مدبر (الركبان المدبرون) در اشبیلیه]\n\nمن گروهی از این طبقه را در اشبیلیه از سرزمین‌های اندلس ملاقات کردم. از جمله‌ی آنان ابویحیی صنهاجی نابینا بود که در مسجد زبیدی سکونت داشت. با او مصاحبت کردم تا اینکه درگذشت و در کوهی بلند و پرباد در شرق دفن شد. بالا رفتن از آن کوه به دلیل بلندی و کثرت بادهایش برای همه‌ی مردم دشوار بود. پس خداوند باد را آرام کرد و از لحظه‌ای که او را در کوه نهادیم، نوزید. مردم مشغول کندن قبر و بریدن سنگ‌های آن شدند تا اینکه کار را به پایان رساندیم و او را در باغچه‌اش به خاک سپردیم و بازگشتیم. هنگام بازگشت ما، باد طبق عادت خود وزیدن گرفت. مردم از این امر شگفت‌زده شدند. از جمله‌ی آنان همچنین صالح بربری، ابوعبدالله شرفی و ابوالحجاج یوسف شبربلی بودند. اما صالح، چهل سال سیاحت کرد و چهل سال در مسجد رطند در اشبیلیه اقامت گزید، در حالی که بر تجرید (التجريد) و همان حالتی که در سیاحت داشت، باقی ماند. و اما ابوعبدالله شرفی، صاحب \"قدم\" (صاحب خطوة) بود و نزدیک به پنجاه سال در خانه‌اش چراغی برایش روشن نشد. من از او شگفتی‌ها دیدم. و اما ابوالحجاج شبربلی، از روستایی به نام شبربل در شرق اشبیلیه، از کسانی بود که بر روی آب راه می‌رفت و ارواح با او معاشرت می‌کردند. هیچ یک از این افراد نبود مگر اینکه با او معاشرت مودت، آمیختگی و محبتی داشتم که از جانب آنان نسبت به ما بود. ما آنان را همراه با مشایخمان در کتاب \"الدرة الفاخرة\" هنگام ذکر کسانی که در راه آخرت از آن‌ها بهره بردم، یاد کرده‌ایم.\n\n[آیات (الآيات) عادی و غیرعادی]\n\nاین چهار نفر از اهل این مقام بودند و از بزرگان اولیای ملامیه (الملامية) به شمار می‌رفتند. علم تدبیر (التدبير) و تفصیل به دست آنان قرار داده شده است. پس نام \"مدبر مفصل\" از آنِ ایشان است و ورد (هجیر) آنان این آیه است: **يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ** (امر را تدبیر می‌کند و آیات را تفصیل می‌دهد). آنان عروسان اهل جایگاه‌ها (المنصات) هستند. پس آیات عادی و غیرعادی از آنِ ایشان است. تمام عالم نزد آنان آیات روشن و آشکار (آيات بينات) است، در حالی که نزد عوام، آیات فقط آن‌هایی هستند که غیرعادی شمرده می‌شوند. این آیات غیرعادی، آنان را به تعظیم خداوند بیدار می‌کند. خداوند آیات عادی را برای گروه‌های مختلفی از بندگانش قرار داده است. از جمله برای خردمندان، مانند این فرموده‌ی خداوند متعال: **إِنَّ في خَلْقِ السَّماواتِ والْأَرْضِ واخْتِلافِ اللَّيْلِ والنَّهارِ والْفُلْكِ الَّتِي تَجْرِي في الْبَحْرِ بِما يَنْفَعُ النَّاسَ وما أَنْزَلَ الله من السَّماءِ من ماءٍ فَأَحْيا به الْأَرْضَ بَعْدَ مَوْتِها وبَثَّ فِيها من كُلِّ دَابَّةٍ وتَصْرِيفِ الرِّياحِ والسَّحابِ الْمُسَخَّرِ بَيْنَ السَّماءِ والْأَرْضِ لَآياتٍ لِقَوْمٍ يَعْقِلُونَ** (همانا در آفرینش آسمان‌ها و زمین و آمد و شد شب و روز و کشتی‌هایی که در دریا به سود مردم در حرکت‌اند و آبی که خداوند از آسمان فرو فرستاده و زمین را پس از مرگش با آن زنده کرده و هر جنبنده‌ای را در آن پراکنده ساخته و در گردش بادها و ابری که میان آسمان و زمین مسخر شده است، قطعاً نشانه‌هایی است برای گروهی که تعقل می‌کنند). پس در آنجا آیاتی برای خردمندان است که همگی عادی هستند، و آیاتی برای یقین‌کنندگان (لِلْمُوقِنِينَ)، و آیاتی برای صاحبان خرد (لِأُولِي الْأَلْبابِ)، و آیاتی برای صاحبان عقل (لِأُولِي النُّهى)، و آیاتی برای شنوندگان که اهل فهم از جانب خداوند هستند، و آیاتی برای عالمان (لِلْعَالِمِينَ)، و آیاتی برای مؤمنان، و آیاتی برای متفکران، و آیاتی برای اهل تذکر. این‌ها همگی گروه‌هایی هستند که خداوند آنان را با اوصاف مختلف و آیات گوناگون توصیف کرده است که اگر در قرآن به دنبال آن‌ها بگردی و در آن‌ها تدبر (التدبر) کنی، خواهی دانست که آن‌ها آیات و دلالت‌هایی بر امور مختلفی هستند که به یک عین واحد بازمی‌گردند. بیشتر مردم از این امر غافلند و به همین دلیل اصناف (گروه‌ها) را متعدد ذکر کرده است.\n\n[گروه‌های خلق در درک آیات عادی]\n\nهمانا از آیات عادی ذکر شده، آن‌هایی هستند که مردم دلالت آن‌ها را به دلیل انسان، جن و فرشته بودنشان درک می‌کنند، و این‌ها همان‌هایی هستند که درکشان به \"عالم\" (با فتح لام) وصف شده است. و از آیات، آن‌هایی هستند که چنان پنهانند که جز کسی که تفکر (التفكر) سالم دارد، آن‌ها را درک نمی‌کند. و از آیات، آن‌هایی هستند که دلالتشان مشروط به \"اولی الألباب\" (صاحبان خرد) است، و آنان خردمندانی هستند که در مغز امور می‌نگرند، نه در پوسته‌ی آن‌ها. پس آنان کاوشگران معانی هستند. اگرچه \"ألباب\" و \"نهی\" هر دو به معنای عقل هستند، اما خداوند سبحان به لفظ \"عقل\" اکتفا نکرده تا آیات را برای \"اولی الألباب\" ذکر کند. زیرا هر عاقلی در مغز و بواطن امور نمی‌نگرد. همانا اهل ظاهر بی‌شک عقل دارند، اما از \"اولی الألباب\" نیستند.\nو شکی نیست که گناهکاران عقل دارند، اما از \"اولی النهی\" (صاحبان عقل) نیستند. پس صفاتشان متفاوت شد، زیرا هر صفتی علمی را می‌بخشد که جز برای کسی که حالش آن صفت است، حاصل نمی‌شود. پس خداوند آن‌ها را بیهوده ذکر نکرده است. خداوند ذکر آیات را در قرآن عزیز بسیار کرده است. در مواضعی آن‌ها را پشت سر هم آورده و صفات عارفان به آن‌ها را نیز به دنبالش ذکر کرده است، و در مواضعی آن‌ها را جداگانه آورده است. مثال پشت سر هم آوردن آن‌ها، سیاق سوره روم است که پیوسته می‌فرماید: **وَمِنْ آيَاتِهِ** (و از نشانه‌های اوست) و **وَمِنْ آيَاتِهِ** (و از نشانه‌های اوست). پس همه‌ی مردم آن را تلاوت می‌کنند، اما جز آن گروه‌هایی که در هر آیه‌ی خاص ذکر شده‌اند، به آن توجه نمی‌کنند. پس آن آیات در حق آنان به عنوان آیه نازل شده‌اند، و در حق دیگران صرفاً برای تلاوت است تا بر آن پاداش گیرند.\n\n[خواب و بیداری: از آیات (الآيات) خداوند]\n\nهنگامی که این سوره را می‌خواندم و در مقام این طبقه بودم و به این فرموده‌ی خداوند رسیدم: **وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ وَابْتِغَاؤُكُمْ مِنْ فَضْلِهِ** (و از نشانه‌های اوست خواب شما در شب و روز و طلب کردن شما از فضل او)، از حُسن نظم قرآن و جمع‌آوری آن بسیار شگفت‌زده شدم، و اینکه چرا چیزی را مقدم داشته که در نظر عقلی در ظاهر امر می‌بایست بر نظمی غیر از این باشد. زیرا روز برای طلب فضل و شب برای خواب است، چنانکه در سوره قصص فرمود: **وَمِنْ رَحْمَتِهِ جَعَلَ لَكُمُ اللَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا فِيهِ** (و از رحمت اوست که شب و روز را برای شما قرار داد تا در آن آرام گیرید)، و ضمیر را به شب بازگرداند، و **وَلِتَبْتَغُوا مِنْ فَضْلِهِ** (و تا از فضل او بجویید) که منظور در روز است، پس آن را مضمر ساخت. اگرچه هر دو ضمیر به معنای مقصود بازمی‌گردند، اما صنعتگر ممکن است شب کار کند و شب خرید و فروش کند، همانطور که ممکن است روز نیز بخوابد و آرام گیرد. اما آنچه غالب در امور است، مورد اعتبار است. از پشت پرده‌ی این آیه و حُسن عبارت آن که پرده‌اش را برمی‌دارد، برای من آشکار شد، و آن فرموده‌ی اوست: **مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ**، امری است افزون بر آنچه به طور عمومی از قرائن احوال در طلب فضل برای روز و خواب برای شب فهمیده می‌شود، و آن چیزی است که ذکر می‌کنیم.\n\n[دو نشئه: دنیوی و اخروی]\n\nو آن این است که خداوند با این آیه هشدار داده است که نشئه‌ی حسی آخرت شبیه این نشئه‌ی دنیوی نیست و عین آن نیست، بلکه ترکیبی دیگر و مزاجی دیگر است، چنانکه شرایع و تعریفات نبوی در مورد مزاج آن سرا (دار) وارد شده است. اگرچه این جواهر (ذرات) عین همان‌ها هستند، بی‌شک، زیرا این‌ها همان‌هایی هستند که در قبرها پراکنده می‌شوند و دوباره برانگیخته می‌شوند، اما ترکیب و مزاج به واسطه‌ی اعراض و صفاتی که شایسته‌ی آن سرا هستند و شایسته‌ی این سرا نیستند، متفاوت می‌شود. اگرچه صورت در چشم، گوش، بینی، دهان، دست‌ها و پاها با کمال نشئه یکی است، اما اختلاف آشکار است. بخشی از آن محسوس و درک می‌شود و بخشی درک نمی‌شود. از آنجا که صورت آفرینش (الإنشاء) در سرای آخرت بر صورت این نشئه است، آنچه را که به آن اشاره کردیم، درک نمی‌کند. و از آنجا که حکم متفاوت است، دانستیم که مزاج تغییر کرده است. این تفاوت میان بهره‌ی حس و عقل است.\n\n[دنیا خواب است و مرگ بیداری]\n\nپس خداوند متعال فرمود: **وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ وَالنَّهَارِ** و بیداری (الیقظة) را ذکر نکرد، در حالی که بیداری نیز از جمله‌ی آیات است. پس خواب را بدون بیداری در حالت دنیا ذکر کرد. این دلالت دارد بر اینکه بیداری جز هنگام مرگ نخواهد بود و انسان همیشه در خواب است تا زمانی که بمیرد. پس ذکر کرد که او در شب و روز، در بیداری و خوابش، در منام (خواب) است. و در خبر (حدیث) آمده است: **الناس نيام فإذا ماتوا انتبهوا** (مردم در خوابند، پس چون بمیرند، بیدار می‌شوند).\n\nآیا نمی‌بینی که در فرموده‌ی خداوند متعال **وَالنَّهَارِ** حرف \"باء\" را نیاورده و به \"باء\" شب اکتفا کرده است تا با این مشارکت، محقق سازد که منظور او خواب در حالت بیداری عادی است؟ پس حذف آن (حرف باء) وجهی را که ما در این آیه آشکار ساختیم، تقویت می‌کند. خواب (المنام) همان حالتی است که شخص خوابیده در آن قرار دارد. وقتی بیدار می‌شود، می‌گوید: فلان چیز را دیدم. پس دلالت دارد بر اینکه انسان تا زمانی که در این نشئه‌ی دنیاست، در خواب است تا بمیرد. پس حق (الحق) بیداری عادی نزد ما را به طور عمومی معتبر ندانسته، بلکه انسان را در خواب و بیداری‌اش در منام قرار داده است، چنانکه در خبر نبوی (الخبر النبوي) از فرموده‌ی پیامبر (صلی الله علیه و سلم) آوردیم: **الناس نيام فإذا ماتوا انتبهوا** (مردم در خوابند، پس چون بمیرند، بیدار می‌شوند).\n\nپس آنان را به خواب در زندگی دنیا وصف کرده است و\n\n[دنیا رؤیایی است که باید تعبیر شود و پلی است که باید از آن عبور کرد]\n\nعوام، خواب را در حالت عادی جز آنچه عادت بر آن جاری شده که خواب نامیده شود، نمی‌شناسند. پس پیامبر (صلی الله علیه و سلم) هشدار داد، بلکه تصریح کرد که انسان تا زمانی که در زندگی دنیاست، در خواب است تا در آخرت بیدار شود. و مرگ اولین احوال آخرت است. پس خداوند او را با آنچه آورده بود، در این فرموده‌اش تصدیق کرد: **وَمِنْ آيَاتِهِ مَنَامُكُمْ بِاللَّيْلِ** که همان خواب عادی است، **وَالنَّهَارِ** که همان خوابی است که رسول خدا (صلی الله علیه و سلم) به آن تصریح کرده است. به همین دلیل، دنیا را \"عبرت\" (گذرگاه) قرار داده است، پلی که از آن عبور می‌شود، یعنی تعبیر می‌شود، همانطور که رؤیایی که انسان در خواب می‌بیند، تعبیر می‌شود. همانطور که آنچه بیننده در حال خواب می‌بیند، مراد برای خودش نیست، بلکه مراد برای غیر اوست، پس از آن صورت مرئی در حال خواب به معنای مراد آن در عالم بیداری، هنگامی که از خواب بیدار می‌شود، تعبیر می‌شود. همچنین حال انسان در دنیا، مطلوب دنیا نیست. پس هر حال، گفتار و عملی که در دنیا می‌بیند، مطلوب آخرت است. پس در آنجا تعبیر می‌شود و آنچه در دنیا دیده است، برایش آشکار می‌گردد، همانطور که در دنیا وقتی بیدار می‌شود، آنچه در خواب دیده بود، برایش آشکار می‌شود. پس دنیا پلی است که از آن عبور می‌شود و آباد نمی‌گردد، مانند حال انسان در آنچه در خواب می‌بیند که تعبیر می‌شود و آباد نمی‌گردد. زیرا وقتی بیدار می‌شود، چیزی از آنچه دیده بود، از خیر یا شر، خانه‌ها و ساختمان‌ها، سفر و احوال نیک یا بد، نمی‌یابد. پس ناگزیر است که عارف به تعبیر، آنچه را دیده برایش تعبیر کند و بگوید: رؤیای تو دلالت بر فلان چیز دارد. همچنین زندگی دنیا خواب است. هنگامی که با مرگ به آخرت منتقل می‌شود، چیزی از آنچه در دست و حس او بود، از خانه و خانواده و مال، همراه او منتقل نمی‌شود، همانطور که وقتی از خواب بیدار شد، چیزی از آنچه در رؤیای خود در حال خواب داشت، در دستش ندید. به همین دلیل خداوند متعال فرمود که ما در شب و روز در منام (خواب) هستیم و در آخرت بیداری خواهد بود.\nو در آنجا رؤیا تعبیر می‌شود. پس کسی که خداوند چشم بصیرتش را نورانی کند و رؤیایش را اینجا قبل از مرگ تعبیر کند، رستگار می‌شود و در آنجا مانند کسی است که رؤیایی دیده و سپس در رؤیای خود دیده که بیدار شده است. پس آنچه را دیده، در حالی که هنوز در خواب است، برای برخی از کسانی که در خواب می‌بیند، تعریف می‌کند و می‌گوید: فلان چیز را دیدم. و آن شخص آن را برایش تفسیر و تعبیر می‌کند، بر اساس آنچه در علم خود به آن می‌بیند. پس هنگامی که بیدار می‌شود، برایش آشکار می‌شود که در تمام مدت در حال رؤیا و در حال تعبیر آن در خواب بوده است، و این صحیح‌ترین تعبیر است. همچنین شخص زیرک و باهوش در این سرا، با وجود اینکه در خواب است، می‌بیند که بیدار شده است، پس رؤیای خود را در خواب تعبیر می‌کند تا بیدار شود و بازداشته شود و راه درست را بپیماید. پس هنگامی که با مرگ بیدار می‌شود، رؤیای خود را می‌ستاید و از خواب خود شادمان می‌شود و رؤیایش برای او خیر به بار می‌آورد. فلهذه الحقیقة (به خاطر این حقیقت) است که خداوند در این آیه بیداری را ذکر نکرد و خواب (المنام) را ذکر کرد و آن را در شب و روز به ما نسبت داد. و طلب فضل در آن، در حق کسی است که در خواب خود ببیند که در خوابش بیدار شده است و رؤیای خود را تعبیر کند، و این همان حالت دنیاست. و خداوند رشد نفوسمان را به ما الهام کند. این از فرموده‌ی خداوند متعال است: **يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ** (امر را تدبیر می‌کند و آیات را تفصیل می‌دهد). پس این تفصیل آیات خواب در شب و روز و طلب کردن از فضل است. و آن را آیاتی قرار داد **لِقَوْمٍ يَسْمَعُونَ** (برای گروهی که می‌شنوند)، یعنی می‌فهمند، چنانکه فرمود: **وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ** (و مانند کسانی نباشید که گفتند شنیدیم در حالی که نمی‌شنوند). منظور فهم از جانب خداوند است. و در مورد آنان فرمود: **صُمٌّ** (کرند) با وجود اینکه می‌شنوند، **بُكْمٌ** (لالند) با وجود اینکه سخن می‌گویند، **عُمْيٌ** (کورند) با وجود اینکه می‌بینند، **فَهُمْ لَا يَعْقِلُونَ** (پس تعقل نمی‌کنند). پس تو را به آنچه منظور او از شنیدن، سخن گفتن و دیدن در اینجا بود، آگاه ساختم.\n\n[رکاب‌داران صاحبان تدبیر (التدبير): ویژگی‌ها و خصوصیات آنان]\n\nاین طبقه دوم رکاب‌داران (الركبانية) دریافتشان از امور بر همین حدی است که در این آیه ذکر کردیم. ما این نحوه‌ی دریافت را ذکر کردیم تا تو را به روش آنان بشناسانیم و منزلتشان از دیگران برایت روشن شود. لطایف آنان به واسطه‌ی آیات نصب شده‌ی عادی و غیرعادی، برپا و ناظر به نفوس عالم است، ناظر به وجوه عرضی که به سبب اغراضشان به سوی آن‌ها روی می‌آورند، ناظر به حدود الهی در آنچه به سوی آن توجه می‌کنند. آنان حتی یک چشم بر هم زدن از نظر در این امور غافل نمی‌شوند. غفلت آنان که طبیعتشان اقتضا می‌کند، تنها مربوط به چیزی است که برایشان تضمین شده است. پس آنان در آنچه از ایشان خواسته شده، بیدارند و از آنچه برایشان تضمین شده، غافلند تا از حکم غفلت خارج نشوند، زیرا غفلت از سرشت انسان است. در حالی که این غفلت، گروه دیگر را از آنچه از آنان خواسته شده، منصرف کرده است. اگر آنچه توجه به آن واقع می‌شود، طاعت باشد، در ظرایف تحصیل آن می‌نگرند و به امر الهی که مناسب آن است و اسم الهی که بر آن سلطه دارد، نظر می‌کنند. پس امر الهی، آیه‌ای را که می‌طلبند، برایشان تفصیل می‌دهد. اگر آیه عادی باشد، مانند آمد و شد شب و روز و تسخیر ابر و غیر آن از آیات عادی که نفوس عوام از وجود آن‌ها خبر ندارند تا زمانی که آن‌ها را از دست بدهند. پس هنگامی که آن‌ها را از دست دادند، برای طلب باران (الاستسقاء) خارج می‌شوند و در آن زمان جایگاه دلالت و قدر آن را می‌شناسند و می‌فهمند که در آیه بوده‌اند و نمی‌دانستند. پس هنگامی که آن آیه به سراغشان می‌آید و باران می‌بارد، به غفلت خود بازمی‌گردند. این حال عوام است، چنانکه خداوند در مورد آنان در این دنیا با شتاب فرمود: **هُوَ الَّذِي يُسَيِّرُكُمْ فِي الْبَرِّ وَالْبَحْرِ حَتَّى إِذَا كُنْتُمْ فِي الْفُلْكِ وَجَرَيْنَ بِهِمْ بِرِيحٍ طَيِّبَةٍ وَفَرِحُوا بِهَا جَاءَتْهَا رِيحٌ عَاصِفٌ وَجَاءَهُمُ الْمَوْجُ مِنْ كُلِّ مَكَانٍ وَظَنُّوا أَنَّهُمْ أُحِيطَ بِهِمْ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ ... فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ إِذَا هُمْ يُشْرِكُونَ وَإِذَا هُمْ يَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ** (او کسی است که شما را در خشکی و دریا به حرکت درمی‌آورد، تا زمانی که در کشتی‌ها باشید و کشتی‌ها با بادی خوش آنان را حرکت دهند و شادمان شوند، ناگهان بادی سخت به سوی آن‌ها آید و موج از هر سو به آنان روی آورد و گمان کنند که در محاصره قرار گرفته‌اند، در آن حال خدا را با اخلاص در دین می‌خوانند... پس هنگامی که آنان را به خشکی نجات داد، ناگهان شرک می‌ورزند و در زمین به ناحق سرکشی می‌کنند). خداوند به آنان می‌گوید: **يَا أَيُّهَا النَّاسُ إِنَّمَا بَغْيُكُمْ عَلَى أَنْفُسِكُمْ مَتَاعُ الْحَيَاةِ الدُّنْيَا** (ای مردم، همانا سرکشی شما تنها بر ضرر خودتان است، بهره‌ای از زندگی دنیاست). و همچنین در آتش می‌گویند: **يَا لَيْتَنَا نُرَدُّ** (ای کاش بازگردانده می‌شدیم). خداوند متعال می‌فرماید: **وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ** (و اگر بازگردانده شوند، قطعاً به آنچه از آن نهی شده بودند، بازمی‌گشتند)، همانطور که صاحبان کشتی پس از اخلاصشان برای خدا، به شرک و سرکشی خود بازگشتند. پس هنگامی که این طایفه به این آیات می‌نگرند، آن‌ها را همراه با امر الهی‌شان به جایی که فراخوانده شده‌اند، می‌فرستند. و اگر آیه غیرعادی باشد، می‌نگرند که کدام اسم الهی آن را می‌طلبد. اگر قهار (القهار) و خواهرانش آن را بطلبند، آن آیه، آیه رهبت (ترس)، زجر و وعید است که آن را بر نفوس می‌فرستند. و اگر اسم لطیف (اللطيف) و خواهرانش آن آیه را بطلبند، آن آیه، آیه رغبت (میل) است که آن را بر ارواح می‌فرستند. پس نوری شعشعانی بر نفوس می‌تابد و نفوس به واسطه‌ی آن به سوی آفریدگار خود متمایل می‌شوند و توفیق و هدایت روزی‌شان می‌گردد و لذت بردن از اعمال به آنان عطا می‌شود. پس با نشاط در آن اعمال قیام می‌کنند و از لباس‌های کسالت عریان می‌شوند و معاشرت با بطالین (بیکارگان) و مصاحبت با غافلانِ لاهی از ذکر خدا برایشان ناخوشایند می‌شود. آنان از جمع و جلوه بیزارند و انفراد و خلوت را ترجیح می‌دهند. و حقیقت لیلة القدر (شب قدر)، کشف (الکشف) آن، سرّ آن و معنای آن، از آنِ این طبقه دوم است. و آنان در آن حکم الهی‌ای دارند که به آن اختصاص یافته‌اند، و آن بهره‌ی آنان از زمان است. پس بنگر که چه شریف است که خداوند آنان را به شریف‌ترین زمان‌ها اختصاص داده است. زیرا آن (شب قدر) بهتر از هزار ماه است که شامل زمان رمضان، روز جمعه، روز عاشورا و روز عرفه و شب قدر است. گویی فرموده است: خیر آن سه برابر و هشتاد و سه برابر و یک سوم برابر مضاعف می‌شود، زیرا هشتاد و سه سال و چهار ماه است. و ممکن است چهار ماه نیز شامل شب قدر باشد، پس تضعیف در هر شب قدر هشتاد و چهار برابر باشد. پس بنگر که در این زمان چه خیری است و این طایفه به چه زمانی اختصاص یافته‌اند. و خداوند **يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و او راه را هدایت می‌کند). جزء هجدهم به پایان رسید و حمد از آنِ خداوند است."
  },
  "page_count": 3
}