{
  "id": 104,
  "title": {
    "ar": "الباب الرابع ومائة في مقام الحزن",
    "en": "Chapter 104: Concerning the Station of Sorrow (مقام الحزن)",
    "ur": "باب ایک سو چار: مقام حزن میں",
    "fa": "باب صد و چهارم در مقام حزن"
  },
  "content": {
    "ar": "## (الباب الرابع ومائة في مقام الحزن)\n\n\n> الحزن مركبه صعب وغايته *** ذهابه فولى الله من حزنا\n\n\n> قلب الحزين هنا تقوى قواعده *** هناك والغرض المقصود منك هنا\n\n\n> دار التكاليف دار ما بها فرح *** فالله ليس يحب الفارح اللسنا\n\n\n### [الحزن مشتق من الحزن وهو الوعر الصعب ولا يكون إلا على فائت‏]\n\n\nالحزن مشتق من الحزن وهو الوعر الصعب والحزونة في الرجل صعوبة أخلاقه والحزن لا يكون إلا على فائت والفائت الماضي لا يرجع لكن يرجع المثل فإذا رجع ذكر بذاته من قام به مثله الذي فات ومضى فأعقب هذا التذكر حزنا في قلب العبد ولا سيما فيمن يطلب مراعاة الأنفاس وهي صعبة المنال لا تحصل إلا لأهل الشهود من الرجال وليس في الوسع الإمكانى تحصيل جملة الأمر فلا بد من فوت فلا بد من حزن‏\n\n\n### [نشأة الإنسان هي نشأة غفلة ما هي نشأة حضور إلا بتعمل واستحضار]\n\n\nوهذه الدار وهذه النشأة نشأة غفلة ما هي نشأة حضور إلا بتعمل واستحضار بخلاف نشأة الآخرة فطلب منا أن ننشئ نفوسنا في هذه الدار نشأة أخرى يكون لها الحضور لا الاستحضار فهل ما طلب منا نعجز عنه أو لا نعجز ومحال أن يطلب منا ما لم يجعل فينا قوة الإتيان به ويمكننا من ذلك فإنه حكيم وقد أعطانا في نفس هذا الطلب علمنا بأن فينا قوة ربانية ولكن من حيث أنا مظهر لها أكسبناها قصورا عما تستحقه من المضاء في كل ممكن فطلبنا المعونة منه فشرع لنا أن نقول وإِيَّاكَ نَسْتَعِينُ ولا حول ولا قوة إلا بالله فمن كان هذا\nمشهده فلا يزال حزنه دائما أبدا\n\n\n### [مقام الحزن مستصحب للعبد ما دام مكلفا وفي الآخرة ما لم يدخل الجنة]\n\n\nوهو مقام مستصحب للعبد ما دام مكلفا وفي الآخرة ما لم يدخل الجنة فإن في الآخرة لهم حزن التغابن لا حزن الفزع الأكبر والخوف يرتفع عنهم مطلقا إلا أن يكونوا متبوعين فإن الخوف يبقى عليهم على الاتباع كالرسل فالحزن إذا فقد من القلب في الدنيا خرب لحصول ضده إذ لا يخلو والدار لا تعطي الفرح لما فيه من نفي المحبة الإلهية عمن قام به وما يزيل الحزن إلا العلم خاصة وهو قوله فَبِذلِكَ فَلْيَفْرَحُوا فالحزن مثل العلم سواء يرتفع بارتفاع المحزون عليه ويتضع كذلك كالعلم يشرف بشرف المعلوم والحزن مقام صعب المرتقى قليل من الخلق عليه هو للكمل من الناس‏\n\n",
    "en": "## Chapter 104: Concerning the Station of Sorrow (مقام الحزن)\n\n> Sorrow’s vehicle is difficult, and its goal\n> Is its departure; so may Allah protect whoever grieves.\n> The heart of the sorrowful here has its foundations strengthened\n> There, yet the intended purpose from you is here.\n> The abode of obligations (دار التكاليف) is an abode devoid of joy,\n> For Allah does not love the excessively joyful or the eloquent.\n\n### [Sorrow is derived from *al-huzn*, which is rugged and difficult ground, and it only occurs over something lost]\n\nSorrow (الحزن) is derived from *al-huzn*, which means rugged and difficult ground (الوعر الصعب). The ruggedness (*al-huzūnah*) in a man signifies the difficulty of his character. Sorrow only occurs over something lost (فائت). The past thing that is lost does not return, but its likeness (المثل) returns. When this likeness returns, it reminds the one who possesses it of the very essence (بذاته) of what was lost and passed away. This remembrance then causes sorrow in the heart of the servant (قلب العبد).\n\nThis is especially true for those who seek the observance of the breaths (مراعاة الأنفاس), which is difficult to attain and is only achieved by the People of Witnessing (أهل الشهود) among men. It is not within the scope of possibility (الوسع الإمكانى) to achieve the entirety of the matter; therefore, loss is inevitable, and thus sorrow is inevitable.\n\n### [The mode of human existence is a mode of heedlessness, not a mode of Presence except through effort and conscious evocation]\n\nThis abode (الدار) and this mode of existence (النشأة) is a mode of heedlessness (نشأة غفلة). It is not a mode of Presence (نشأة حضور) except through effort and conscious evocation (استحضار). This is contrary to the mode of existence in the Hereafter (نشأة الآخرة).\n\nWe are therefore asked to establish our souls in this abode in another mode of existence, one in which they possess Presence (الحضور) itself, not merely the evocation of Presence. Do we fail to achieve what is asked of us, or do we not fail? It is impossible (محال) that we should be asked for something for which He has not placed within us the power to accomplish it and enabled us to do so, for He is Wise (حكيم).\n\nHe has given us, within the very nature of this demand, the knowledge (علمنا) that there is a Divine power (قوة ربانية) within us. However, insofar as we are the manifestation (مظهر) of this power, we have caused it to fall short (قصورا) of the effectiveness it deserves in every possibility. Therefore, we seek aid (المعونة) from Him. He legislated for us to say: <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help) and \"There is no power nor strength save in Allah.\" Whoever has this as his witnessing (مشهده), his sorrow remains perpetual forever.\n\n### [The Station of Sorrow accompanies the servant as long as he is obligated, and in the Hereafter until he enters Paradise]\n\nIt [Sorrow] is a station (مقام) that accompanies the servant (العبد) as long as he is obligated (مكلفا), and in the Hereafter as long as he has not entered Paradise (الجنة). For in the Hereafter, they have the sorrow of mutual loss (حزن التغابن)—not the sorrow of the Greatest Terror (حزن الفزع الأكبر).\n\nFear (الخوف) is lifted from them absolutely, unless they are those who are followed (متبوعين)—in which case fear remains upon them due to their followers, such as the Messengers (الرسل).\n\nIf sorrow is lost from the heart in this world, the heart is ruined due to the presence of its opposite, for the heart is never empty. And this abode does not grant joy (الفرح), because joy implies the negation of Divine Love (المحبة الإلهية) for the one who possesses it.\n\nNothing removes sorrow except Knowledge (العلم) specifically, which is His saying: <<فَبِذلِكَ فَلْيَفْرَحُوا>> (In that let them rejoice). Sorrow is exactly like Knowledge: it rises with the elevation of the object of sorrow (المحزون عليه) and likewise diminishes, just as Knowledge is ennobled by the nobility of the Known (المعلوم). Sorrow is a station difficult to ascend (صعب المرتقى); few among creation are upon it. It belongs to the Perfected Ones (الكمل من الناس).",
    "ur": "(باب ایک سو چار: مقام حزن (الحزن) کے بیان میں)\n\nغم (الحزن) کی سواری دشوار ہے اور اس کا مقصد\nاس کا زائل ہو جانا ہے۔ پس اللہ نے اس شخص کو سنبھال لیا جو غمگین ہوا۔\n\nغمگین کا دل یہاں اپنی بنیادوں کو مضبوط کرتا ہے،\nوہاں (آخرت میں)، جبکہ تجھ سے مطلوبہ مقصد یہیں (دنیا میں) ہے۔\n\nدارِ تکالیف (ذمہ داریوں کا گھر) ایسا گھر ہے جس میں کوئی خوشی نہیں،\nکیونکہ اللہ تعالیٰ خوش ہونے والے، لغو باتیں کرنے والے کو پسند نہیں کرتا۔\n\n***\n\n[حزن (الحزن) حزن سے مشتق ہے جو کہ دشوار گزار اور مشکل ہے، اور یہ صرف فوت شدہ چیز پر ہی ہوتا ہے]\n\nحزن (الحزن) حزن سے مشتق ہے، اور یہ دشوار گزار (الوعر الصعب) اور مشکل ہے۔ اور آدمی میں حزونت (سختی) اس کے اخلاق کی دشواری ہے۔ اور حزن (الحزن) صرف فوت شدہ (الفائت) چیز پر ہی ہوتا ہے، اور جو فوت ہو چکا وہ واپس نہیں آتا، لیکن اس کی مثال واپس آتی ہے۔ پس جب وہ (مثال) واپس آتی ہے، تو وہ اس ذات کو یاد دلاتی ہے جس کے ساتھ اس کی وہ مثال قائم تھی جو فوت ہو کر گزر چکی، اور یہ یاد دہانی بندے کے دل میں حزن (الحزن) پیدا کرتی ہے۔ اور خاص طور پر ان لوگوں میں جو سانسوں کی نگرانی (مراعاة الأنفاس) کے طالب ہیں، اور یہ مشکل الحصول ہے، جو صرف اہل شہود (أهل الشهود) کو ہی حاصل ہوتی ہے۔ اور امکانی وسعت میں پورے امر کا حصول ممکن نہیں، لہٰذا فوت ہونا لازمی ہے، اور اس لیے حزن (الحزن) بھی لازمی ہے۔\n\n***\n\n[انسان کی نشو و نما غفلت کی نشو و نما ہے، یہ حضور (الحضور) کی نشو و نما نہیں مگر کوشش اور استحضار (الاستحضار) کے ذریعے]\n\nاور یہ گھر اور یہ نشو و نما غفلت (الغفلة) کی نشو و نما ہے، یہ حضور (الحضور) کی نشو و نما نہیں مگر کوشش اور استحضار (الاستحضار) کے ذریعے۔ بخلاف آخرت کی نشو و نما کے۔ پس ہم سے یہ مطالبہ کیا گیا ہے کہ ہم اس دنیا میں اپنی جانوں کو ایک دوسری نشو و نما پر قائم کریں جس میں ان کے لیے حضور (الحضور) ہو، نہ کہ استحضار (الاستحضار)۔ تو کیا جو ہم سے طلب کیا گیا ہے ہم اس سے عاجز ہیں یا عاجز نہیں؟ اور یہ محال ہے کہ ہم سے وہ چیز طلب کی جائے جس کے بجا لانے کی قوت ہم میں نہ رکھی گئی ہو اور ہمیں اس کی قدرت نہ دی گئی ہو، کیونکہ وہ (ذات حق) حکیم ہے۔ اور اس نے اسی طلب میں ہمیں یہ علم دیا ہے کہ ہم میں ربانی قوت (قوة ربانية) موجود ہے، لیکن چونکہ ہم اس کے مظہر ہیں، ہم نے اسے ہر ممکن میں اس تیزی سے جو اس کا حق ہے، کوتاہی کا شکار کر دیا ہے۔ پس ہم نے اس سے مدد طلب کی، تو اس نے ہمارے لیے یہ کہنا مشروع کیا: (إِيَّاكَ نَسْتَعِينُ) \"اور ہم تجھی سے مدد مانگتے ہیں\" (الفاتحہ: ۵) اور \"لا حول ولا قوة إلا بالله\" (اللہ کی مدد کے بغیر نہ کوئی طاقت ہے اور نہ کوئی قوت)۔ پس جس کا یہ مشاہدہ (مشهد) ہو، اس کا حزن (الحزن) ہمیشہ ہمیشہ کے لیے دائمی رہتا ہے۔\n\n***\n\n[مقام حزن (الحزن) بندے کے ساتھ رہتا ہے جب تک وہ مکلف ہے، اور آخرت میں جب تک وہ جنت میں داخل نہیں ہو جاتا]\n\nاور یہ وہ مقام ہے جو بندے کے ساتھ رہتا ہے جب تک وہ مکلف ہے، اور آخرت میں جب تک وہ جنت میں داخل نہیں ہو جاتا۔ کیونکہ آخرت میں ان کے لیے تغابن (التغابن) کا حزن (نقصان کا احساس) ہوگا، نہ کہ فزع اکبر (الفزع الأكبر) کا حزن۔ اور خوف ان سے مطلقاً اٹھا لیا جائے گا، سوائے اس کے کہ وہ متبوع (جن کی پیروی کی جاتی ہے) ہوں، تو ان پر خوف اتباع کی وجہ سے باقی رہتا ہے، جیسے کہ رسول۔ پس اگر دنیا میں دل سے حزن (الحزن) ختم ہو جائے تو وہ (دل) ویران ہو جاتا ہے، کیونکہ اس کی ضد حاصل ہو جاتی ہے، اور دل خالی نہیں رہتا۔ اور یہ دنیا خوشی نہیں دیتی، کیونکہ خوشی میں اس شخص سے محبت الٰہیہ (المحبة الإلهية) کی نفی ہے جو اس پر قائم ہو۔ اور حزن (الحزن) کو صرف علم ہی زائل کرتا ہے، اور یہی اس کا قول ہے: (فَبِذلِكَ فَلْيَفْرَحُوا) \"پس انہیں چاہیے کہ وہ اسی پر خوش ہوں\" (یونس: ۵۸)۔ پس حزن (الحزن) علم کی طرح ہے، یہ اس چیز کے بلند ہونے سے بلند ہوتا ہے جس پر غم کیا گیا ہو، اور اسی طرح پست ہوتا ہے، جیسے علم معلوم کی شرافت سے شرف حاصل کرتا ہے۔ اور حزن (الحزن) ایک مشکل چڑھائی (صعب المرتقى) کا مقام ہے، مخلوق میں سے کم ہی لوگ اس پر قائم ہوتے ہیں، یہ کامل لوگوں (الكمل من الناس) کے لیے ہے۔",
    "fa": "باب صد و چهارم در مقام حزن (مقام الحزن)\n\nحزن (غم) مرکبی دشوار است و نهایت آن، رفتن آن است؛ پس خداوند سرپرست کسی است که محزون باشد.\n\nقلب محزون، قواعدش در اینجا (دنیا) و آنجا (آخرت) تقویت می‌شود؛ و غرض مقصود از تو در همین‌جاست.\n\nسرای تکالیف، سرایی است که در آن شادی نیست؛ زیرا خداوند شادمان پرحرف را دوست نمی‌دارد.\n\n[حزن (غم) از حزن (زمین ناهموار) مشتق شده و آن دشوار و سخت است و جز بر امر از دست رفته واقع نمی‌شود]\n\nحزن (غم) از حزن (زمین ناهموار) مشتق شده و آن دشوار و سخت است. حزونت (ناهمواری) در مرد، به معنای دشواری اخلاق اوست. حزن جز بر امر از دست رفته (فائت) واقع نمی‌شود. امر از دست رفته‌ای که گذشته است، باز نمی‌گردد، اما مَثَل (مانند) آن باز می‌گردد. هنگامی که مَثَل آن بازگشت، کسی که مَثَلِ امر از دست رفته و گذشته در او محقق شده است، به ذات آن امر یادآوری می‌شود. این یادآوری، حزنی را در قلب بنده به دنبال دارد، به ویژه در کسی که مراعات انفاس (لحظات) را می‌طلبد؛ که این امر دشوار و دست‌نیافتنی است و جز برای اهل شهود (الشهود) از مردان حاصل نمی‌شود. در توان امکان (الوسع الإمكانی) نیست که تمام امر حاصل شود، پس ناگزیر از دست رفتنی (فوت) وجود دارد و ناگزیر حزنی وجود خواهد داشت.\n\n[نشأت انسان، نشأت غفلت است، نه نشأت حضور، مگر با تکلف و استحضار]\n\nاین سرا و این نشأت (نشأة)، نشأت غفلت است، نه نشأت حضور، مگر با تکلف و استحضار (حضور باطنی)، برخلاف نشأت آخرت. از ما خواسته شده است که نفوس خود را در این سرا، به نشأتی دیگر برآوریم که برای آن حضور باشد نه استحضار. آیا از آنچه از ما خواسته شده عاجزیم یا عاجز نیستیم؟ محال است که از ما چیزی خواسته شود که نیروی انجام آن در ما قرار داده نشده و ما را بر آن توانا نساخته باشد، زیرا او حکیم است. او در نفس همین طلب، به ما علم داد که در ما نیرویی ربانی وجود دارد، اما از آن جهت که ما مظهر آن هستیم، آن را دچار قصور کرده‌ایم از آنچه شایسته آن است که در هر امر ممکنی به کمال برسد. پس از او یاری خواستیم و برای ما مشروع ساخت که بگوییم: **وَإِيَّاكَ نَسْتَعِينُ** (و تنها از تو یاری می‌جوییم) و «لا حول ولا قوة إلا بالله» (هیچ نیرو و توانی جز به واسطه خداوند نیست). پس کسی که این مشهد (الشهود) او باشد، حزن او پیوسته و ابدی خواهد بود.\n\n[مقام حزن (مقام الحزن) تا زمانی که بنده مکلف است و در آخرت تا زمانی که وارد بهشت نشده، همراه اوست]\n\nو آن (حزن) مقامی است که تا زمانی که بنده مکلف است و در آخرت تا زمانی که وارد بهشت نشده، همراه اوست. زیرا در آخرت برای آنان حزن تغابن (پشیمانی از کمبود عمل) وجود دارد، نه حزن فزع اکبر (ترس بزرگ). و ترس به طور مطلق از آنان برداشته می‌شود، مگر اینکه متبوع (پیشوا) باشند؛ در این صورت ترس به دلیل اتباع (پیروی) بر آنان باقی می‌ماند، مانند رسولان. پس اگر حزن در دنیا از قلب زائل شود، قلب خراب می‌شود، زیرا ضد آن حاصل شده است و قلب خالی نمی‌ماند. و این سرا (دنیا) شادی نمی‌دهد، زیرا شادی مستلزم نفی محبت الهی (المحبة الإلهية) از کسی است که به آن متصف شود. و حزن را جز علم (المعرفة) به طور خاص زائل نمی‌کند، و آن قول خداوند است: **فَبِذلِكَ فَلْيَفْرَحُوا** (پس به آن باید شادمان شوند). حزن مانند علم است؛ با ارتفاع (اهمیت) محزون‌علیه (آنچه بر آن حزن است) بالا می‌رود و همچنین پایین می‌آید، همان‌گونه که علم با شرافت معلوم، شرافت می‌یابد. و حزن مقامی است که صعود به آن دشوار است و اندکی از خلق بر آن قرار دارند؛ این مقام برای کاملان از مردم است."
  },
  "page_count": 2
}