{
  "id": 197,
  "title": {
    "ar": "الباب السابع والتسعون ومائة في معرفة الذهاب",
    "en": "Chapter One Hundred and Ninety-Seven: Concerning the Gnosis (المعرفة) of the Departure (الذهاب)",
    "ur": "باب ایک سو ستانوے: معرفتِ ذہاب (واپس جانے) کے بیان میں",
    "fa": "باب صد و نود و هفتم در معرفت (شناخت) ذهاب (رفتن/سیر)"
  },
  "content": {
    "ar": "## (الباب السابع والتسعون ومائة في معرفة الذهاب)\n\n\n> قلوب العاشقين لها ذهاب *** إذا هي شاهدت من لا تراه‏\n\n\n> وذا من أعجب الأشياء فينا *** نراه وما نراه إذا نراه‏\n\n\n> دليلي إذ يقول رميت عبدي *** فلا تعجب فما الرامي سواه‏\n\n\n> كذا قد جاء في القرآن نصا *** لأمر في حنين قد دهاه‏\n\n\n### [الذهاب عند الطائفة غيبة القلب عن حس كل محسوس بمشاهدة المحبوب‏]\n\n\nمعنى الذهاب وهي غيبة القلب عن حس كل محسوس بمشاهدة المحبوب وذلك يا ولي أن القلب والباطن‏\nلا يتمكن للعارف فكيف للمحب أن يمر عليه نفس ولا حال لا يكون المحبوب فيه مشهودا له بعين قلبه ووجوده وما بقي حجاب إلا في الحس بإدراكه المحسوسات حيث يراها ليست عين محبوبه فيحجبه فيطلب اللقاء لأجل هذا الحجاب فإذا ذهب المحسوس عن حسه في ظاهر الصورة كما يذهب في حق النائم انصرف الحس إلى الخيال فرأى مثال محبوبه في خياله وقرب من قلبه فرآه من غير مثال لأن الخيال ما بينه وبين المعنى واسطة ولا درجة كما أنه ليس بينه وبين المحسوس واسطة ولا درجة فهو واسطة العقد إليه ينزل المعنى وإليه يرتفع المحسوس فهو يلقي الطرفين بذاته فإذا انتقل العارف أو المحب من المحسوس إلى الخيال قرب من معنى المحبوب فشاهده في الخيال ممثلا ذا صورة وشاهده وهو في الخيال لما عدل بنظره إلى حضرة المعاني المجاورة لحضرة الخيال عاين المعنى مجردا عن المثال والصورة ثم نظر إلى المثال وإلى المحسوس فعلم أنه لو تصور هذا المعنى في المحسوس لكان جميع صور المحسوسات صورته فغاب هذا المشاهد عن شهود كل محسوس إنه غير صورة محبوبه بل كل محسوس صورة محبوبه ولا بد فذهب عنه صورة المحسوس إنها غير صورة محبوبه فصار يشاهده في كل شي‏ء فهذا هو الذهاب ومنه المذهب الذي هو الطريق سمي مذهبا للذهاب فيه فهذا المحب ذاهب في صور المحسوسات كلها إنها صورة عين محبوبه فلا يزال في اتصال دائم في عالم الحس وفي حضرة الخيال وفي حضرة المعاني فله الذهاب في هذه الحضرات كلها وصارت مذهبا له حتى نفسه في جملة الصور ولهذا يقول‏\n\n\n> أنا من أهوى *** ومن أهوى أنا\n\n\nومثل هذا قلنا في قصيدة\n\n\n> أنا محبي أنا حبيبي *** أنا فتاي أنا فتاتي‏\n\n\nوقد قلنا في هذا الباب أيضا من قصيدة\n\n\n> فإنني ما عشقت غيري *** فعين فصلى هو اتصالي‏\n\n",
    "en": "## Chapter One Hundred and Ninety-Seven: Concerning the Knowledge of Absorption (الذهاب)\n\nThe hearts of the lovers have an absorption (ذهاب)\nWhen they witness Him Whom they do not see.\n\nAnd this is one of the most wondrous things within us:\nWe see Him, yet we do not see Him when we see Him.\n\nMy proof is when He says, \"I cast [the arrow], My servant,\"\nSo do not wonder, for the Caster is none other than He.\n\nThus it came explicitly in the Qur'an\nConcerning the matter that befell [the Prophet] at Hunayn.\n\n### [Absorption (الذهاب) according to the Sufi community is the heart's absence from the sensation of every sensible object through the witnessing of the Beloved.]\n\nThe meaning of Absorption (الذهاب) is the heart's absence from the sensation of every sensible object through the witnessing (مشاهدة) of the Beloved. This, O my friend, is because it is not possible for the Gnostic (*al-ārif*), let alone the Lover (*al-muḥibb*), that a single breath or state should pass over the heart and the inner being (*al-bāṭin*) without the Beloved being witnessed by the eye of his heart and his very existence.\n\nNo veil remains except in the sense faculty (*al-ḥiss*) through its perception of sensible objects (*al-maḥsūsāt*), where it sees them as not being the very Essence of his Beloved, thus veiling him. He therefore seeks the encounter because of this veil.\n\nWhen the sensible object departs from his sensation in its outward form, just as it departs for the sleeper, the sense faculty turns toward the Imagination (الخيال). He then sees the likeness (مثال) of his Beloved in his Imagination, and he draws near to his heart, seeing Him without a likeness.\n\nThis is because the Imagination (الخيال) has no intermediary or degree between itself and the Meaning (*al-ma'nā*), just as it has no intermediary or degree between itself and the sensible object (*al-maḥsūs*). Thus, it is the central bead of the necklace; to it the Meaning descends, and to it the sensible object ascends. It meets both ends by its very Essence (بذاته).\n\nTherefore, when the Gnostic or the Lover moves from the sensible plane to the Imagination, he draws near to the Meaning of the Beloved. He witnesses Him in the Imagination as represented, possessing a form. And while still in the Imagination, when he shifts his gaze toward the Presence of Meanings (*Ḥaḍrat al-Ma'ānī*) adjacent to the Presence of Imagination (*Ḥaḍrat al-Khayāl*), he beholds the Meaning stripped of likeness and form.\n\nHe then looks at the likeness and at the sensible object and knows that if this Meaning were to be conceived in the sensible realm, all the forms of sensible objects would be His form.\n\nThis witnesser is then absorbed (غاب) from witnessing any sensible object as being other than the form of his Beloved. Rather, every sensible object is necessarily the form of his Beloved. Thus, the image of the sensible object being other than the form of his Beloved departs from him.\n\nHe thus begins to witness Him in everything. This is Absorption (الذهاب). From this comes the term *Madhhab* (مذهب), which means the Way or Path, named *Madhhab* because of the Absorption (الذهاب) that occurs within it.\n\nThis Lover is absorbed (ذاهب) into all the forms of sensible objects, recognizing them as the form of the very Essence of his Beloved. He remains in perpetual connection in the World of Sense, in the Presence of Imagination, and in the Presence of Meanings.\n\nThus, he experiences Absorption (الذهاب) in all these Presences, and they become his Path (*Madhhab*), even his own self being among the totality of forms. For this reason, he says:\n\nI am the One I love,\nAnd the One I love is I.\n\nAnd similarly, we said in a poem:\nI am my lover, I am my Beloved,\nI am my youth, I am my maiden.\n\nAnd we also said in this chapter, from a poem:\nFor I have not loved other than myself,\nSo the very Essence of my separation is my union.",
    "ur": "(باب ایک سو ستانوے: معرفتِ غیبت (الذہاب) کے بیان میں)\n\nعاشقوں کے قلوب غیبت (الذہاب) میں چلے جاتے ہیں،\nجب وہ اس ذات کا مشاہدہ کرتے ہیں جسے وہ نہیں دیکھتے۔\nاور یہ ہم میں سب سے عجیب چیز ہے،\nہم اسے دیکھتے ہیں اور جب دیکھتے ہیں تو نہیں دیکھتے۔\nمیری دلیل یہ ہے کہ جب وہ (الحق) فرماتا ہے: \"میں نے اپنے بندے کو تیر مارا،\"\nتو تعجب نہ کر، کیونکہ تیر مارنے والا اس کے سوا کوئی نہیں۔\nاسی طرح قرآن میں صریحاً آیا ہے،\nاس معاملے کے لیے جو حنین میں پیش آیا تھا۔\n\n[صوفیاء کے نزدیک غیبت (الذہاب) محبوب کے مشاہدے کے ذریعے ہر محسوس چیز کے حس سے قلب کی غیبت (غائب ہو جانا) کا نام ہے]\n\nغیبت (الذہاب) کا معنی یہ ہے کہ محبوب کے مشاہدے کے ذریعے قلب کا ہر محسوس چیز کے حس سے غائب ہو جانا۔ اے ولی! یہ اس طرح ہے کہ عارف کے لیے، اور محب کے لیے تو بدرجہ اولیٰ، یہ ممکن نہیں کہ اس پر کوئی لمحہ یا کوئی حال ایسا گزرے جس میں محبوب اس کے قلب کی آنکھ اور اس کے وجود کے ذریعے مشہود نہ ہو۔ اور کوئی حجاب باقی نہیں رہتا سوائے حس میں، محسوسات کے ادراک کے ذریعے، جہاں وہ محسوسات کو دیکھتا ہے کہ وہ اس کے محبوب کی عین ذات نہیں ہیں، تو یہ اسے حجاب میں ڈال دیتا ہے۔ اسی حجاب کی وجہ سے وہ ملاقات کا طالب ہوتا ہے۔ پس جب محسوس چیز ظاہری صورت میں اس کے حس سے غائب ہو جاتی ہے، جیسا کہ سونے والے کے حق میں غائب ہوتی ہے، تو حس خیال (الخيال) کی طرف متوجہ ہو جاتا ہے۔ پھر وہ اپنے خیال (الخيال) میں اپنے محبوب کی مثال دیکھتا ہے اور اپنے قلب کے قریب ہو جاتا ہے، تو اسے بغیر کسی مثال کے دیکھتا ہے، کیونکہ خیال (الخيال) اور معنی (المعنی) کے درمیان کوئی واسطہ یا درجہ نہیں ہے، جیسا کہ اس کے اور محسوس (المحسوس) کے درمیان بھی کوئی واسطہ یا درجہ نہیں ہے۔ پس وہ (خیال) عقد کا واسطہ ہے، اسی کی طرف معنی (المعنی) نازل ہوتا ہے اور اسی کی طرف محسوس (المحسوس) بلند ہوتا ہے، لہٰذا وہ اپنی ذات سے دونوں اطراف کو ملاتا ہے۔\n\nپس جب عارف یا محب محسوس (المحسوس) سے خیال (الخيال) کی طرف منتقل ہوتا ہے، تو وہ محبوب کے معنی (المعنی) کے قریب ہو جاتا ہے، اور اسے خیال (الخيال) میں صورت کے ساتھ ممثل دیکھتا ہے۔ اور جب وہ خیال (الخيال) میں ہوتا ہے اور اپنی نظر کو خیال (الخيال) کی حضرت سے متصل حضرتِ معانی (حضرة المعاني) کی طرف موڑتا ہے، تو وہ معنی (المعنی) کو مثال اور صورت سے مجرد دیکھتا ہے۔ پھر وہ مثال اور محسوس (المحسوس) کی طرف دیکھتا ہے، تو جانتا ہے کہ اگر یہ معنی (المعنی) محسوس میں متصور ہو جائے تو تمام محسوسات کی صورتیں اس کی صورت بن جائیں گی۔ پس یہ مشاہدہ کرنے والا ہر محسوس کے شہود (الشہود) سے غائب ہو جاتا ہے کہ وہ اس کے محبوب کی صورت کے علاوہ کچھ اور ہے، بلکہ ہر محسوس لازماً اس کے محبوب کی صورت ہے۔ پس اس سے محسوس کی وہ صورت غائب ہو جاتی ہے جو اس کے محبوب کی صورت کے علاوہ ہو۔ چنانچہ وہ اسے ہر چیز میں دیکھنے لگتا ہے۔ یہی غیبت (الذہاب) ہے۔ اور اسی سے مذہب (المذہب) نکلا ہے جو کہ راستہ ہے، اسے مذہب اس لیے کہا گیا کہ اس میں غیبت (الذہاب) ہوتی ہے۔ پس یہ محب تمام محسوسات کی صورتوں میں غائب (ذاہب) ہے کہ وہ اس کے محبوب کی عین صورت ہیں۔ چنانچہ وہ عالمِ حس میں، اور حضرتِ خیال (حضرة الخيال) میں، اور حضرتِ معانی (حضرة المعاني) میں ہمیشہ دائمی اتصال میں رہتا ہے۔ پس اسے ان تمام حضرات میں غیبت (الذہاب) حاصل ہے، اور یہ سب اس کے لیے مذہب (راستہ) بن گئے ہیں، یہاں تک کہ اس کی اپنی ذات بھی ان صورتوں کے مجموعے میں شامل ہے۔ اسی لیے وہ کہتا ہے:\n\nأنا من أهوى *** ومن أهوى أنا\nمیں وہ ہوں جس سے میں محبت کرتا ہوں، اور جس سے میں محبت کرتا ہوں وہ میں ہوں۔\n\nاور اسی طرح ہم نے ایک قصیدے میں کہا:\nأنا محبي أنا حبيبي *** أنا فتاي أنا فتاتي‏\nمیں ہی میرا محب ہوں، میں ہی میرا حبیب ہوں، میں ہی میرا جوان ہوں، میں ہی میری جوان عورت ہوں۔\n\nاور ہم نے اسی باب میں ایک قصیدے سے یہ بھی کہا ہے:\nفإنني ما عشقت غيري *** فعين فصلى هو اتصالي‏\nپس میں نے اپنے غیر سے کبھی عشق نہیں کیا، کیونکہ میری جدائی (فصل) کی عین حقیقت ہی میرا اتصال ہے۔",
    "fa": "باب صد و نود و هفتم در معرفت ذهاب (Al-Dhahāb)\n\nدل‌های عاشقان را ذهاب (Dhahāb) است\nآنگاه که کسی را که نمی‌بینند، شهود کنند\n\nو این از شگفت‌ترین چیزها در ماست\nاو را می‌بینیم و نمی‌بینیم، آنگاه که او را می‌بینیم\n\nدلیل من آنگاه که می‌گوید: «من بنده خود را تیر زدم»\nپس تعجب مکن، زیرا تیرانداز جز او نیست\n\nهمچنین در قرآن به صراحت آمده است\nبرای امری که در حنین بر او (پیامبر) عارض شد\n\n### [ذهاب (Al-Dhahāb) نزد طایفه (صوفیه) عبارت است از غیبت قلب از حس هر محسوس به واسطه مشاهده محبوب]\n\nمعنای ذهاب (Al-Dhahāb) عبارت است از غیبت قلب از حس هر محسوس به واسطه مشاهده محبوب. و ای ولیّ من، این بدان سبب است که برای عارف، و چگونه برای محب، ممکن نیست که نفسی یا حالی بر او بگذرد که محبوب در آن با چشم قلب و وجودش برای او مشهود نباشد. و هیچ حجابی باقی نمانده است مگر در حس، به واسطه ادراک محسوسات؛ آنجا که آن‌ها را عین محبوب خود نمی‌بیند، پس او را محجوب می‌سازد. از این رو، به خاطر این حجاب، طلب لقاء می‌کند.\n\nپس هنگامی که محسوس از حس او در ظاهر صورت زائل شود، همان‌گونه که در حق شخص خوابیده زائل می‌شود، حس به سوی خیال منصرف می‌گردد و مثال محبوب خود را در خیالش می‌بیند. و به قلبش نزدیک می‌شود، پس او را بدون مثال می‌بیند؛ زیرا خیال میان خود و معنا واسطه‌ای یا درجه‌ای ندارد، همان‌گونه که میان خود و محسوس نیز واسطه‌ای یا درجه‌ای ندارد. پس خیال واسطه عقد است؛ معنا به سوی آن نازل می‌شود و محسوس به سوی آن بالا می‌رود. بنابراین، خیال دو طرف را به ذات خود به هم می‌رساند.\n\nپس هنگامی که عارف یا محب از محسوس به خیال منتقل شود، به معنای محبوب نزدیک می‌شود و او را در خیال به صورت متمثل و دارای شکل مشاهده می‌کند. و هنگامی که در خیال است، چون نظر خود را به سوی حضرت معانی که مجاور حضرت خیال است معطوف سازد، معنا را مجرد از مثال و صورت مشاهده می‌کند. سپس به مثال و به محسوس نظر می‌کند و می‌داند که اگر این معنا در محسوس تصور می‌شد، تمام صور محسوسات صورت او می‌بود.\n\nپس این مشاهده‌گر از شهود هر محسوس که غیر از صورت محبوبش باشد، غایب می‌شود؛ بلکه هر محسوس، ناگزیر، صورت محبوب اوست. پس صورت محسوس که غیر از صورت محبوبش باشد، از او زائل می‌شود و در نتیجه او را در هر چیزی مشاهده می‌کند. این همان ذهاب (Al-Dhahāb) است. و از همین روست که مذهب (Mazhab) که همان راه است، مذهب نامیده شده، زیرا در آن ذهاب (Dhahāb) صورت می‌گیرد.\n\nپس این محب در تمام صور محسوسات ذاهب (Dhahib) است، زیرا آن‌ها را صورت عین محبوب خود می‌داند. بنابراین، او پیوسته در اتصال دائمی در عالم حس، در حضرت خیال و در حضرت معانی است. پس او در تمام این حضرات ذهاب (Al-Dhahāb) دارد و این‌ها برای او مذهب (Mazhab) شده‌اند، حتی نفس او در زمره صور است. و به همین دلیل می‌گوید:\n\nمن کسی هستم که دوستش دارم\nو کسی که دوستش دارم، من هستم\n\nو مانند این را در قصیده‌ای گفته‌ایم:\n\nمن محب خود هستم، من حبیب خود هستم\nمن جوانمرد خود هستم، من دوشیزه خود هستم\n\nو در این باب نیز از قصیده‌ای گفته‌ایم:\n\nزیرا من جز خود را عشق نورزیدم\nپس عین جدایی من، همان اتصال من است"
  },
  "page_count": 2
}