{
  "id": 250,
  "title": {
    "ar": "الباب الخمسون ومائتان في الري",
    "en": "Chapter Two Hundred and Fifty: Concerning Saturation (الري)",
    "ur": "پچیسواں باب: سیرابی (الری) کے بیان میں",
    "fa": "باب دویست و پنجاهم در باب سیراب شدن (الري)"
  },
  "content": {
    "ar": "## «الباب الخمسون ومائتان في الري»\n\n\n> الري قال به قوم وليس لهم *** علم بأن وجود الري معدوم‏\n\n\n> لو كان رى تناهي الأمر وانقطعت *** أمداده وزيادات وتعليم‏\n\n\n> فالأمر ليس له حد يحيط به *** لكنه الرزق في الأشخاص مقسوم‏\n\n\n### [الري عبارة عن الاكتفاء به ويضيق المحل عن الزيادة منه‏]\n\n\nالري ما يحصل به الاكتفاء ويضيق المحل عن الزيادة منه اعلم أنه لا يقول بالري إلا من يقول بأن ثم نهاية وغاية وهم المكشوف لهم عالم الحياة الدنيا ونهاية مدتها وهم أهل الكشف في اللوح المحفوظ المعتكفون على النظر فيه أو من كان كشفه في نظرته ما هو الوجود عليه ثم يسدل الحجاب دونه ويرى التناهي إذ كل ما دخل في الوجود متناه وليس لصاحب هذا الكشف من الكشف الأخروي شي‏ء فمن رأى الغاية قال بالري وعلق همته بالغاية وهؤلاء هم الذين قال فيهم شيخنا أبو مدين إنه من رجال الله من يحن في نهايته إلى البداية وذلك لأن الله ما كشف لهم عن حقيقة الأمر على ما هو عليه كالقائلين برجوع الشمس في طول النهار وما هو رجوع في نفس الأمر والقائلون بالري هم القائلون بالدور لما يرونه من تكرار أيام الجمعة والشهور والذين لا يقولون بالري هم الذين يسمون النهار والليل الجديدين وليس عندهم تكرار جملة واحدة فالأمر له بدء وليس له غاية لكن فيه غايات بحسب ما تتعلق به همم بعض العارفين فيوصلهم الله إلى غاياتهم ومن هناك يقع لهم التجديد فيه لا عليه فيفوتهم خير كثير من الحكم وعلم كبير في الإلهيات بل يفوتهم من علم الطبيعة خير كثير فإن تركيبها لا نهاية له في الدنيا والآخرة ويحجبهم عن عدم الري قوله تعالى وإِلَيْهِ تُرْجَعُونَ فسماه رجوعا وذلك لكونه‏\nشغلهم عنه بالنظر في ذواتهم وذوات العالم عند صدورهم من الله فإذا وفوا النظر فيما وجد من العالم تعلقوا بالله فتخيلوا أنهم رجعوا إليه من حيث صدورهم عنه وما علموا أن الحقيقة الإلهية التي صدروا عنها ما هي التي رجعوا إليها بل هم في سلوك دائما إلى غير نهاية وإنما نظروا لكونهم رجعوا إلى النظر في الإله بعد ما كانوا ناظرين في نفوسهم لما لم يصح أن يكون وراء الله مرمى وسبب الري الحقيقي أنه لما لم يتمكن أن يقبل من الحق إلا ما يعطيه استعداده وليس هناك منع فحصل الاكتفاء بما قبله استعداد القابل وضاق المحل عن الزيادة من ذلك فقال صاحب هذا الذوق ارتويت فما يقول بالري إلا من هو واقف مع وقته وناظر إلى استعداده والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Satiation (الري) is affirmed by some people, but they do not have\nKnowledge that the existence of Satiation is non-existent.\n\nIf there were Satiation, the matter would reach its end and be cut off,\nIts supplies, increases, and teaching.\n\nThus, the matter has no limit that encompasses it,\nBut rather, the provision (الرزق) is distributed among individuals.\n\n### [Satiation (الري) is an expression for being content with it, and the receptacle becoming too narrow for any increase from it]\n\nSatiation is that by which sufficiency (الاكتفاء) is attained, and the receptacle (المحل) becomes too narrow for any increase from it. Know that no one affirms Satiation except those who affirm that there is an end (نهاية) and a goal (غاية). These are those to whom the world of the life of this world (عالم الحياة الدنيا) and the end of its duration have been unveiled. They are the people of Unveiling (أهل الكشف) in the Preserved Tablet (اللوح المحفوظ), who devote themselves to contemplating it, or those whose unveiling in their contemplation is limited to what Existence (الوجود) is upon, and then the veil (الحجاب) is drawn down before it, and they see the finitude, since everything that enters into Existence is finite.\n\nThe possessor of this Unveiling has nothing of the Unveiling of the Hereafter (الكشف الأخروي). Thus, whoever sees the goal affirms Satiation and attaches his spiritual aspiration (همته) to that goal. These are the ones concerning whom our Shaykh Abu Madyan said that among the men of Allah are those who yearn in their end for the beginning. That is because Allah did not unveil to them the Reality of the Matter (حقيقة الأمر) as it truly is, like those who affirm the return of the sun during the length of the day, when in reality it is not a return.\n\nThose who affirm Satiation are those who affirm the Cycle (الدور), due to what they see of the repetition of Fridays and months. Those who do not affirm Satiation are those who call the day and night \"the two new ones,\" and they do not hold that a single totality is repeated.\n\nThus, the Matter has a beginning but no ultimate goal, though it contains goals according to what the spiritual aspirations of some Gnostics (العارفين) attach themselves to. So Allah brings them to their goals. And from that point, renewal (التجديد) occurs *within* it for them, not *upon* it. Consequently, they miss much good from wisdom (الحكم) and great knowledge in Divine Matters (الإلهيات). Moreover, they miss much good from the science of Nature (علم الطبيعة), for its composition has no end in this world or the Hereafter.\n\nWhat veils them from the absence of Satiation is His saying, the Exalted: <<وَإِلَيْهِ تُرْجَعُونَ>> (And to Him you shall be returned). So He called it a return. That is because He occupied them away from Him by contemplating their own essences (ذواتهم) and the essences of the World (ذوات العالم) when they issued forth (صدورهم) from Allah. When they fulfilled their contemplation of what came into existence from the World, they attached themselves to Allah, and thus imagined that they had returned to Him from the point where they issued forth from Him. Yet they did not know that the Divine Reality (الحقيقة الإلهية) from which they issued forth is not the one to which they returned. Rather, they are in perpetual spiritual journeying (سلوك) without end. They only considered it a return because they returned to contemplating the Divine after they had been contemplating their own souls, given that it is not possible for there to be a goal beyond Allah.\n\nThe true reason for Satiation is that since the recipient cannot accept from The Real (الحق) anything except what his preparedness (استعداده) grants him, and there is no prevention [from The Real], sufficiency is attained by what the preparedness of the recipient accepted, and the receptacle became too narrow for any increase beyond that. So the possessor of this spiritual taste (الذوق) said, \"I am satiated.\" Thus, no one affirms Satiation except he who stands still with his time and looks only to his preparedness. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو پچاس: سیری (الری) کے بیان میں\n\nسیری (الری) کا دعویٰ ایک قوم نے کیا، حالانکہ انہیں یہ علم نہیں کہ سیری کا وجود ہی معدوم ہے۔\n\nاگر سیری (ری) ہوتی تو معاملہ ختم ہو جاتا، اور اس کی امدادیں، اضافے اور تعلیم منقطع ہو جاتیں۔\n\nپس امر (معاملہ) کی کوئی حد نہیں جو اس کا احاطہ کر سکے، لیکن رزق اشخاص میں تقسیم شدہ ہے۔\n\n### [سیری (الری) سے مراد اس پر اکتفا کرنا ہے اور محل کا اس میں مزید اضافے سے تنگ ہو جانا ہے]\n\nسیری (الری) وہ ہے جس سے اکتفا حاصل ہو جائے اور محل اس میں مزید اضافے سے تنگ ہو جائے۔ جان لو کہ سیری (الری) کا قائل صرف وہی ہوتا ہے جو یہ کہتا ہے کہ کوئی انتہا اور غایت ہے۔ یہ وہ لوگ ہیں جن پر دنیاوی زندگی کا عالم اور اس کی مدت کی انتہا منکشف ہوئی ہے۔ یہ وہ لوگ ہیں جو لوح محفوظ (اللوح المحفوظ) میں کشف (الکشف) کے حامل ہیں اور اس کے مطالعے پر معتکف ہیں۔ یا وہ شخص جس کا کشف (الکشف) اس کے مشاہدے میں صرف اس چیز پر ہو جو وجود (الوجود) پر ہے، پھر اس کے سامنے پردہ ڈال دیا جاتا ہے اور وہ انتہا دیکھتا ہے، کیونکہ ہر وہ چیز جو وجود (الوجود) میں داخل ہوئی ہے وہ متناہی (محدود) ہے۔ اور اس کشف (الکشف) کے حامل شخص کے لیے آخرت کے کشف (الکشف الأخروي) میں سے کچھ حصہ نہیں ہوتا۔ پس جس نے غایت (انتہا) کو دیکھا، اس نے سیری (الری) کا دعویٰ کیا اور اپنی ہمت (الہمۃ) کو غایت سے وابستہ کر دیا۔\n\nیہ وہی لوگ ہیں جن کے بارے میں ہمارے شیخ ابو مدین نے فرمایا کہ اللہ کے بندوں میں سے کچھ ایسے ہیں جو اپنی انتہا میں ابتدا کی طرف لوٹنے کی آرزو کرتے ہیں۔ یہ اس لیے ہے کہ اللہ نے ان پر حقیقتِ امر کو اس کی اصل حالت پر منکشف نہیں کیا۔ یہ ان لوگوں کی طرح ہیں جو دن کی طوالت میں سورج کے لوٹنے کا دعویٰ کرتے ہیں، حالانکہ حقیقت میں وہ لوٹنا نہیں ہے۔ سیری (الری) کے قائل وہی ہیں جو دور (تکرار) کے قائل ہیں، کیونکہ وہ جمعہ کے دنوں اور مہینوں کا تکرار دیکھتے ہیں۔ اور جو لوگ سیری (الری) کے قائل نہیں ہیں، وہ دن اور رات کو نئے (الجدیدین) کا نام دیتے ہیں، اور ان کے نزدیک کسی ایک جملے کا تکرار نہیں ہوتا۔ پس امر (معاملہ) کی ابتدا ہے لیکن اس کی کوئی غایت (انتہا) نہیں، البتہ اس میں غایات (انتہائیں) ہیں جو بعض عارفین کی ہمتوں (الہمم) سے متعلق ہوتی ہیں۔ پس اللہ انہیں ان کی غایات تک پہنچا دیتا ہے۔ اور وہاں سے ان کے لیے اس میں تجدید واقع ہوتی ہے، نہ کہ اس پر۔ اس طرح وہ حکمتوں کے بہت سے خیر اور الٰہیات (الإلهيات) کے بڑے علم سے محروم رہ جاتے ہیں۔ بلکہ وہ علمِ طبیعت کے بہت سے خیر سے بھی محروم رہ جاتے ہیں، کیونکہ اس کی ترکیب دنیا اور آخرت میں لامتناہی ہے۔\n\nاور انہیں سیری (الری) کے نہ ہونے سے اللہ تعالیٰ کا یہ قول حجاب میں رکھتا ہے:\nوَإِلَيْهِ تُرْجَعُونَ (اور تم اسی کی طرف لوٹائے جاؤ گے)\nپس اللہ نے اسے رجوع (لوٹنا) کا نام دیا۔ یہ اس لیے ہے کہ جب وہ اللہ سے صادر ہوئے تو اللہ نے انہیں اپنی ذاتوں اور عالم کی ذاتوں کے مشاہدے میں مشغول کر دیا۔ جب انہوں نے عالم کے موجودات کے مشاہدے کو پورا کر لیا تو وہ اللہ سے متعلق ہو گئے، پس انہوں نے یہ گمان کیا کہ وہ اسی کی طرف لوٹ آئے ہیں جہاں سے وہ صادر ہوئے تھے۔ حالانکہ انہیں یہ علم نہیں کہ وہ الٰہی حقیقت (الحقيقة الإلهية) جس سے وہ صادر ہوئے تھے، وہ نہیں ہے جس کی طرف وہ لوٹے ہیں۔ بلکہ وہ ہمیشہ ایک ایسے سلوک (روحانی سفر) میں ہیں جس کی کوئی انتہا نہیں۔ انہوں نے صرف اس لیے رجوع (لوٹنا) سمجھا کہ وہ اپنی جانوں کے مشاہدے کے بعد معبود (الإله) کے مشاہدے کی طرف لوٹ آئے، کیونکہ اللہ کے ماوراء کوئی منزل (مرمیٰ) ہونا درست نہیں۔ اور حقیقی سیری (الری) کا سبب یہ ہے کہ جب سالک کے لیے یہ ممکن نہ ہوا کہ وہ الحق (ذات حق) سے صرف وہی قبول کرے جو اس کا استعداد (صلاحیت) اسے عطا کرتا ہے، اور وہاں کوئی ممانعت نہیں تھی، تو جو کچھ قابل کے استعداد نے قبول کیا اس پر اکتفا حاصل ہو گیا اور محل اس سے زیادہ کے لیے تنگ ہو گیا۔ پس اس ذوق کے حامل شخص نے کہا: \"میں سیراب ہو گیا (ارتویت)\"۔ لہٰذا سیری (الری) کا قائل صرف وہی ہوتا ہے جو اپنے وقت کے ساتھ کھڑا ہو اور اپنے استعداد (صلاحیت) کو دیکھ رہا ہو۔\nوَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب دویست و پنجاهم در باب سیرابی (الري)\n\nسیرابی (الري) را قومی پذیرفتند که *** علمی به معدوم بودن وجود سیرابی ندارند.\nاگر سیرابی وجود داشت، کار به نهایت می‌رسید و *** امدادها، افزایش‌ها و تعلیم قطع می‌شد.\nپس امر (الهی) حدی ندارد که آن را احاطه کند، *** بلکه آن (سیرابی) رزقی است که در اشخاص تقسیم شده است.\n\n### [سیرابی (الري) عبارت است از اکتفا به آن و تنگی محل برای افزایش بیشتر از آن]\n\nسیرابی (الري) آن چیزی است که با آن اکتفا حاصل می‌شود و محل (ظرفیت) برای افزایش بیشتر از آن تنگ می‌گردد. بدان که کسی قائل به سیرابی (الري) نمی‌شود مگر کسی که قائل به وجود نهایت و غایتی باشد. و آنان کسانی هستند که عالم حیات دنیا و پایان مدت آن بر ایشان مکشوف شده است. و ایشان اهل کشف (الکشف) در لوح محفوظ هستند که بر نظر در آن معتکف شده‌اند، یا کسانی که کشف (الکشف) ایشان در نظرشان همان چیزی است که هستی (الوجود) بر آن است، سپس حجاب در برابر آن کشیده می‌شود و او تناهی (پایان‌پذیری) را می‌بیند، زیرا هر آنچه وارد هستی (الوجود) شده، متناهی است. و صاحب این کشف (الکشف) بهره‌ای از کشف اخروی ندارد. پس هر کس غایت را ببیند، قائل به سیرابی (الري) می‌شود و همت خود را به آن غایت می‌آویزد. و اینان همان کسانی هستند که شیخ ما ابومدین درباره‌شان فرمود: از رجال الله (مردان خدا) کسانی هستند که در نهایت خود، به سوی آغاز اشتیاق می‌ورزند. و این بدان سبب است که خداوند حقیقت امر را آن‌گونه که هست، بر ایشان آشکار نساخته است؛ مانند کسانی که قائل به بازگشت خورشید در طول روز هستند، در حالی که در نفس امر (حقیقت)، بازگشتی در کار نیست. و قائلان به سیرابی (الري) همان قائلان به دور (تکرار) هستند، به دلیل تکرار روزهای جمعه و ماه‌ها که مشاهده می‌کنند. و کسانی که قائل به سیرابی (الري) نیستند، کسانی هستند که شب و روز را جدید می‌نامند و نزد ایشان تکرار یک جمله واحد وجود ندارد.\n\nپس امر (الهی) آغازی دارد اما غایتی ندارد، لکن در آن غایاتی وجود دارد بر حسب آنچه همت برخی از عارفان (العارفين) به آن تعلق می‌گیرد. پس خداوند آنان را به غایاتشان می‌رساند و از آنجا تجدید (نو شدن) برایشان در آن (امر) واقع می‌شود نه بر آن (غایت). در نتیجه خیر بسیاری از حکمت‌ها و علم بزرگی در الهیات از دستشان می‌رود، بلکه خیر بسیاری از علم طبیعت نیز از دستشان می‌رود، زیرا ترکیب آن در دنیا و آخرت پایانی ندارد. و آنچه آنان را از عدم سیرابی (الري) محجوب می‌سازد، این فرموده خداوند متعال است: **«و به سوی او بازگردانده می‌شوید» (وَإِلَيْهِ تُرْجَعُونَ)**. پس آن را بازگشت نامید، و این بدان سبب است که خداوند آنان را به سبب نظر در ذات‌های خود و ذات‌های عالم، هنگام صدورشان از خدا، از آن (حقیقت) مشغول ساخت. پس چون نظر در آنچه از عالم موجود شده را به پایان رساندند، به خداوند تعلق یافتند و گمان کردند که از همان جایی که از او صادر شده بودند، به سوی او بازگشته‌اند. و ندانستند که حقیقت الهی که از آن صادر شدند، همان حقیقتی نیست که به سوی آن بازگشتند، بلکه آنان همواره در سلوک (سلوک) به سوی بی‌نهایت هستند. و تنها به این دلیل نظر کردند که پس از نظر در نفوس خود، به نظر در اله بازگشتند، زیرا صحیح نیست که ورای خداوند مقصدی باشد. و سبب سیرابی (الري) حقیقی این است که چون ممکن نبود که از حق (الحق) جز آنچه استعدادش به او می‌دهد، بپذیرد و منعی در کار نبود، اکتفا به آنچه استعداد پذیرنده قبول کرده بود، حاصل شد و محل (ظرفیت) برای افزایش بیشتر از آن تنگ گردید. پس صاحب این ذوق گفت: سیراب شدم. بنابراین، کسی قائل به سیرابی (الري) نمی‌شود مگر کسی که با وقت خود ایستاده و به استعداد خویش می‌نگرد. و خداوند **«حق را می‌گوید و او راه را هدایت می‌کند» (يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)**."
  },
  "page_count": 2
}