{
  "id": 233,
  "title": {
    "ar": "الباب الثالث والثلاثون ومائتان في الرغبة",
    "en": "Chapter Two Hundred and Thirty-Third, Concerning Aspiration (الرغبة)",
    "ur": "۲۳۳ واں باب رغبت کے بیان میں",
    "fa": "باب دویست و سی و سوم در بیان رغبت (میل/اشتیاق)"
  },
  "content": {
    "ar": "## «الباب الثالث والثلاثون ومائتان في الرغبة»\n\n\n> رغبت عنه وفيه *** من أجل ما يقتضيه‏\n\n\n> مقام من هو مثلي *** في كل ما يرتضيه‏\n\n\n> لله سيف حسام *** للكل إذ ينتضيه‏\n\n\n### [الرغبة على ثلاثة أنحاء]\n\n\nالرغبة في اصطلاح القوم على ثلاثة أنحاء رغبة محلها النفس متعلقها الثواب ورغبة محلها القلب متعلقها الحقيقة ورغبة محلها السر متعلقها الحق فأما الرغبة النفسية فلا تكون إلا في العامة وفي الكمل من رجال الله لعلمهم بأن الإنسان مجموع أمور أنشأه الله عليها طبيعية وروحانية وإلهية فعلم إن فيه من يطلب ثواب ما وعد الله به فرغب فيه له إثباتا للحكم الإلهي وأما العامة فلا علم لها بذلك فيشترك الكامل والعامي في صورة الرغبة ويتميز في الباعث كل واحد عن صاحبه كالخوف يوم الفزع الأكبر يشترك فيه الرسل عليهم السلام وهم أعلى الطوائف والعوام وهم المذنبون والعصاة فالرسل عليهم السلام خوفا على أممها لا على أنفسها فإنهم الآمنون في ذلك الموطن والعامة تخاف على نفوسها فيشتركان في الخوف ويفترقان في السبب الموجب له كان بعض الكمل قد برد ماء في الكوز ليشربه فنام فرأى في الواقعة المبشرة حوراء من أحسن ما يكون من الحور العين قد أقبلت فقال لها لمن أنت فقالت لمن لا يشرب الماء المبرد في الكيزان ثم تناولت الكوز وهو ينظر إليها فكسرته فكانت له فلما استيقظ وجد الكوز مكسورا فترك خزفه في موضعه لم يرفعه حتى عفي عليه التراب تذكرة له فعلم إن فيه من يطلب ربه وفيه من يطلب تلك الجارية ولذلك استفهمها فأعطى كل ذي حق حقه فلم يكن ظلوما لنفسه فإن من المصطفين من عباد الله من يكون ظالما لنفسه أي من أجل نفسه يظلم نفسه بأنه لا يوفيها حقها لنزوله في العلم عن رتبة من يعلم أن حقائقه التي هو عليها لا تتداخل ولا تتعدى كل حقيقة مرتبتها ولا تقبل إلا ما يليق بها فلا تقبل العين إلا السهر والنوم وما يختص بها ولا تقبل من الثواب إلا المشاهدة والرؤية والأذن لا تقبل في الثواب إلا الخطاب إذ ليس الشهود للسمع والكامل يسعى لقواه على قدر ما تطلبه وهو إمام ناصح لرعيته ليس بغاش لها فإن ظلمها فإنما يظلمها لها في زعمه وذلك لجهله بما علم غيره من ذلك‏\n\n\nكسلمان الفارسي وأخيه في الله أبي الدرداء في حالهما فرجح رسول الله صلى الله عليه وسلم سلمان فإنه كان يعطي كل ذي حق حقه فيصوم ويفطر ويقوم وينام وكان أبو الدرداء مع كونه مصطفى ظالما لنفسه يصوم فلا يفطر ويقوم فلا ينام‏\n\n\nوأما الرغبة القلبية في الحقيقة فإن الحقيقة في الوجود التلوين والمتمكن في التلوين هو صاحب التمكين ما هو المقابل للتلوين لأن الحقيقة تعطي أن يكون الأمر هكذا لأن الله كل يوم في شأن فهو في التلوين فهذا القلب يرغب في شهود هذه الحقيقة وجعل الله محلها القلب ليقرب على الإنسان تحصيلها لما في القلب من التقليب ولم يجعلها في العقل لما في العقل من التقييد فربما يرى أنه يثبت على حالة واحدة لو كانت هذه الرغبة في العقل بخلاف كونها في القلب فإنه يسرع إليه التقليب فإنه بين أصابع الرحمن فلا يبقى على حالة واحدة في نفس الأمر فيثبت على تقليبه في أحواله بحسب شهوده وما يقلبه الأصابع فيه وأما الرغبة السرية التي‏\nمتعلقها الحق فنعني بالحق هنا ما يظهر للخلق في الأعمال المشروعة فيرغب السر في هذا الحق لما يندرج في ذلك أو يظهر به من المعارف الإلهية التي تتضمنها الأحكام المشروعة ولا تكشف إلا بالعمل بها فإن الظاهر أقوى من الباطن حكما أي هو أعم لأن الظاهر له مقام الخلق والحق والباطن له مقام الحق بلا خلق إذ الحق لا يبطن عن نفسه وهو ظاهر لنفسه فمن علم ذلك رغب سره في الحق فإن الله ربط العالم به وأخبر عن نفسه أن له نسبتين نسبة إلى العالم بالأسماء الإلهية المثبتة أعيان العالم ونسبة غناه عنه فمن نسبة غناه عنه يعلم نفسه ولا نعلمه فلم يبطن عن نفسه ومن نسبة ارتباط العالم به للدلالة عليه علم أيضا نفسه وعلمناه فعم الظاهر النسبتين فكان أقوى في الحكم من الباطن فرغب السر في الحق لعلمه بأن مدرك نسبة الغني لا يدركها إلا هو فقطع يأسه وأراح نفسه وطلب ما ينبغي له أن يطلب فنفخ في ضرم ولم يكن لحما علي وضم جعلنا الله ممن رأى الحق حقا فاتبعه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Thirty-Three: On Aspiration (الرغبة)\n\n> I longed for it and turned away from it\n>\n> Because of what it demands\n>\n> The station of one who is like me\n>\n> In all that he approves.\n>\n> For God is a sharp, decisive sword\n>\n> For all when He draws it forth.\n\n### Aspiration (الرغبة) is of Three Kinds\n\nAspiration (الرغبة), in the technical terminology of the People [the Sufis], is of three kinds: an aspiration whose locus is the soul (النفس) and whose object is reward (الثواب); an aspiration whose locus is the heart (القلب) and whose object is Reality (الحقيقة); and an aspiration whose locus is the innermost core (السر) and whose object is The Real (الحق).\n\nAs for psychic aspiration, it occurs only among the common people and among the perfect ones (الكمل) among the men of God. This is due to their knowledge that the human being is a composite of matters upon which God created him: natural, spiritual, and divine. Thus, the perfect one knows that within him is one who seeks the reward promised by God, so he desires it for the sake of affirming the Divine Decree (الحكم الإلهي). As for the common people, they have no knowledge of this. Therefore, the perfect one (الكامل) and the common person (العامي) share the form of the desire, but they differ in the motive (الباعث) of each one.\n\nThis is like fear on the Day of the Greatest Terror (يوم الفزع الأكبر): the Messengers (peace be upon them), who are the highest of groups, and the common people, who are the sinners and disobedient, share in it. The Messengers fear for their communities, not for themselves, for they are the secure ones in that station. The common people fear for their own souls. Thus, they share in the fear but differ in the cause necessitating it.\n\nOne of the perfect ones had cooled water in a jar (الكوز) to drink. He slept and saw in a true vision (الواقعة المبشرة) a houri (حوراء), one of the most beautiful of the wide-eyed houris (الحور العين), approaching. He asked her, \"Whose are you?\" She replied, \"I belong to him who does not drink cooled water from jars.\" Then she took the jar while he watched and broke it. She then belonged to him. When he awoke, he found the jar broken. He left its shards in their place, not removing them until the dust covered them, as a reminder to himself. Thus, he knew that within him was one who sought his Lord, and one who sought that maiden. That is why he questioned her. So he gave every possessor of a right its due, and he was not unjust to his soul.\n\nIndeed, among the chosen servants of God (المصطفين) are those who are unjust to their souls—meaning, for the sake of his soul, he wrongs it by not giving it its due right. This is due to his descent in knowledge below the rank of one who knows that the realities (حقائقه) upon which he stands do not intermingle, nor does any reality transgress its own level (مرتبتها), nor does it accept anything except what is appropriate for it. The eye, for instance, accepts only wakefulness and sleep and what pertains specifically to it, and it accepts of the reward only witnessing (المشاهدة) and vision (الرؤية). The ear accepts of the reward only address/speech (الخطاب), since witnessing is not for hearing. The perfect one (الكامل) strives for his faculties according to what they demand, and he is a sincere leader (إمام ناصح) to his flock, not deceiving them. If he wrongs them, he only wrongs them for their own sake, in his estimation, and that is due to his ignorance of what others have known concerning this matter.\n\nAn example is the condition of Salman al-Farsi and his brother in God, Abu al-Darda. The Messenger of God (peace and blessings be upon him) favored Salman, for Salman used to give every possessor of a right its due: he would fast and break his fast, and he would pray at night and sleep. Whereas Abu al-Darda, despite being chosen, was unjust to his soul: he would fast and never break his fast, and he would pray at night and never sleep.\n\nAs for heart-based desire (الرغبة القلبية) for Reality (الحقيقة), Reality in Existence (الوجود) is fluctuation/coloring (التلوين). The one established (المتمكن) in fluctuation is the possessor of spiritual stability (التمكين), not the one who opposes fluctuation. This is because Reality dictates that the matter be thus, for God is \"every day in [a new] affair,\" so He is in fluctuation. This heart desires the witnessing (شهود) of this Reality. God made its locus the heart (القلب) to make its attainment easier for the human being, due to the heart's inherent changeability (التقليب). He did not place it in the intellect (العقل) due to the intellect's inherent restriction (التقييد). For the intellect might believe that it remains fixed upon a single state if this desire were located there, unlike the heart, which quickly undergoes change. For it is \"between the Fingers of the All-Merciful,\" so it does not remain in a single state in reality, but rather remains stable (يثبت) in its fluctuation through its states, according to its witnessing and what the Fingers turn it toward.\n\nAs for the desire of the innermost core (الرغبة السرية) whose object is The Real (الحق), by The Real here we mean what appears to Creation (الخلق) in the prescribed actions (الأعمال المشروعة). The innermost core desires this Real because of the Divine Gnosis (المعارف الإلهية) that is contained within or manifested by the prescribed rulings (الأحكام المشروعة), which are not unveiled (تكشف) except by acting upon them. For the Manifest (الظاهر) is stronger than the Hidden (الباطن) in decree—that is, it is more comprehensive. This is because the Manifest has the station of Creation and The Real, while the Hidden has the station of The Real without Creation, since The Real is not hidden from Himself, and He is Manifest to Himself.\n\nWhoever knows this, his innermost core desires The Real. For God linked the World (العالم) to Himself and informed us that He has two relations: a relation to the World through the Divine Names (الأسماء الإلهية) that establish the Fixed Entities (الأعيان الثابتة), and a relation of His independence (غناه) from it. From the relation of His independence from it, He knows Himself, and we do not know Him; thus, He is not hidden from Himself. And from the relation of the World's connection to Him, indicating Him, He also knows Himself, and we know Him. Thus, the Manifest encompasses both relations, making it stronger in decree than the Hidden.\n\nTherefore, the innermost core desires The Real, knowing that the perception of the relation of Independence (الغني) is attained only by Him. So, it cut off its despair, gave rest to its soul, and sought what it ought to seek. Thus, it blew upon the kindling, and it was not flesh upon me, nor did I embrace it. May God make us among those who see The Real as Real and follow it. And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah says the truth, and He guides to the way).",
    "ur": "باب نمبر دو سو تینتیس: رغبت (آرزو) کے بیان میں\n\nمیں نے اس سے اور اس میں رغبت کی\nاس تقاضے کی بنا پر جو یہ کرتا ہے\nاس مقام کا جو میرے جیسا ہے\nہر اس چیز میں جسے وہ پسند کرتا ہے\nاللہ کے لیے ایک تیز تلوار ہے\nسب کے لیے جب وہ اسے نیام سے نکالتا ہے\n\n### [رغبت (آرزو) کی تین اقسام]\n\nقوم (صوفیاء) کی اصطلاح میں رغبت (آرزو) کی تین اقسام ہیں: ایک رغبت جس کا محل نفس ہے اور اس کا تعلق ثواب سے ہے، اور ایک رغبت جس کا محل قلب ہے اور اس کا تعلق الحقیقۃ (حقیقت) سے ہے، اور ایک رغبت جس کا محل السر (باطن) ہے اور اس کا تعلق الحق (ذات حق) سے ہے۔\n\nجہاں تک النفس (نفس) کی رغبت کا تعلق ہے، وہ صرف عام لوگوں میں اور اللہ کے کامل بندوں میں پائی جاتی ہے، کیونکہ وہ جانتے ہیں کہ انسان ان امور کا مجموعہ ہے جن پر اللہ نے اسے پیدا کیا ہے: طبعی، روحانی، اور الٰہی۔ پس وہ جانتا ہے کہ اس میں کوئی ایسا ہے جو اس ثواب کا طالب ہے جس کا اللہ نے وعدہ کیا ہے، لہٰذا وہ اس میں رغبت کرتا ہے تاکہ حکم الٰہی کو ثابت کرے۔ جبکہ عام لوگوں کو اس کا علم نہیں ہوتا۔ پس کامل اور عامی رغبت کی صورت میں شریک ہوتے ہیں، لیکن محرک (باعث) میں ہر ایک دوسرے سے ممتاز ہوتا ہے۔ جیسے خوف، یوم فزع اکبر کے دن، جس میں رسول (علیہم السلام) جو اعلیٰ ترین گروہ ہیں، اور عوام جو گنہگار اور نافرمان ہیں، شریک ہوتے ہیں۔ پس رسول (علیہم السلام) اپنی امتوں کے لیے خوفزدہ ہوتے ہیں نہ کہ اپنی جانوں کے لیے، کیونکہ وہ اس مقام پر محفوظ ہوں گے، اور عام لوگ اپنی جانوں کے لیے خوفزدہ ہوتے ہیں۔ پس وہ خوف میں شریک ہوتے ہیں اور اس کے موجب سبب میں جدا ہو جاتے ہیں۔\n\nبعض کاملین نے ایک کوزے میں پانی ٹھنڈا کیا تاکہ اسے پیئیں، پھر وہ سو گئے اور انہوں نے ایک بشارت دینے والے خواب میں ایک حور کو دیکھا جو حور عین میں سب سے زیادہ حسین تھی۔ وہ ان کی طرف آئی۔ انہوں نے اس سے پوچھا: تم کس کے لیے ہو؟ اس نے کہا: اس کے لیے جو کوزوں میں ٹھنڈا پانی نہیں پیتا۔ پھر اس نے کوزہ لیا اور وہ اسے دیکھتے رہے، اور اس نے اسے توڑ دیا، پس وہ حور ان کی ہو گئی۔ جب وہ بیدار ہوئے تو کوزہ ٹوٹا ہوا پایا۔ انہوں نے اس کے ٹکڑوں کو اسی جگہ چھوڑ دیا اور انہیں نہیں اٹھایا یہاں تک کہ ان پر مٹی پڑ گئی، تاکہ یہ ان کے لیے ایک یاد دہانی رہے۔ پس انہوں نے جانا کہ ان کے اندر کوئی ایسا ہے جو اپنے رب کا طالب ہے اور کوئی ایسا ہے جو اس حور کا طالب ہے۔ اسی لیے انہوں نے اس سے سوال کیا، اور ہر حقدار کو اس کا حق دیا، پس وہ اپنی جان پر ظلم کرنے والے نہ بنے۔\n\nکیونکہ اللہ کے چنے ہوئے بندوں میں سے کچھ ایسے بھی ہیں جو اپنی جان پر ظلم کرنے والے ہوتے ہیں، یعنی اپنی جان کی خاطر وہ اپنی جان پر ظلم کرتے ہیں کہ اسے اس کا حق پورا نہیں دیتے، کیونکہ وہ علم میں اس مرتبے سے نیچے ہوتے ہیں جو یہ جانتا ہے کہ اس کی حقائق جن پر وہ قائم ہے، وہ آپس میں خلط نہیں ہوتیں اور نہ ہی ہر حقیقت اپنے مرتبے سے تجاوز کرتی ہے، اور نہ ہی وہ قبول کرتی ہے مگر وہی جو اس کے لائق ہو۔ پس آنکھ صرف بیداری اور نیند اور جو کچھ اس کے ساتھ خاص ہے، اسے قبول کرتی ہے، اور ثواب میں صرف المشاہدۃ (مشاہدہ) اور الرؤیۃ (رؤیت) کو قبول کرتی ہے۔ اور کان ثواب میں صرف الخطاب (کلام) کو قبول کرتا ہے، کیونکہ الشہود (شہود) سماعت کے لیے نہیں ہے۔ اور الکامل (کامل) اپنی قوتوں کے لیے اس قدر کوشش کرتا ہے جتنا وہ مطالبہ کرتی ہیں، اور وہ اپنی رعایا (قوتوں) کے لیے ایک خیر خواہ امام ہے، نہ کہ دھوکہ دینے والا۔ اگر وہ ان پر ظلم کرتا ہے تو وہ اپنے گمان میں ان کے لیے ہی ظلم کرتا ہے، اور یہ اس کی جہالت کی وجہ سے ہے جو دوسروں نے اس بارے میں جانا۔\n\nجیسے سلمان فارسی اور ان کے دینی بھائی ابو الدرداء کا معاملہ تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے سلمان کو ترجیح دی، کیونکہ وہ ہر حقدار کو اس کا حق دیتے تھے، پس وہ روزہ بھی رکھتے تھے اور افطار بھی کرتے تھے، اور قیام بھی کرتے تھے اور سوتے بھی تھے۔ جبکہ ابو الدرداء، چنے ہوئے ہونے کے باوجود، اپنی جان پر ظلم کرنے والے تھے، وہ روزہ رکھتے تھے تو افطار نہیں کرتے تھے، اور قیام کرتے تھے تو سوتے نہیں تھے۔\n\nاور جہاں تک الحقیقۃ (حقیقت) میں القلبیۃ (قلبی) رغبت کا تعلق ہے، تو وجود میں الحقیقۃ (حقیقت) التلوین (حالت بدلنا) ہے، اور التلوین میں متمکن (مضبوط) وہی ہے جو التمکین (استحکام) کا مالک ہے، نہ کہ وہ جو تلوین کے مخالف ہو۔ کیونکہ الحقیقۃ (حقیقت) کا تقاضا ہے کہ معاملہ ایسا ہی ہو، اس لیے کہ اللہ تعالیٰ کُلَّ يَوْمٍ فِي شَأْنٍ (ہر دن ایک نئی شان میں ہے)۔ پس وہ التلوین (حالت بدلنے) میں ہے۔ یہ القلب (قلب) اس الحقیقۃ (حقیقت) کے الشہود (شہود) میں رغبت کرتا ہے۔ اور اللہ نے اس کا محل القلب (قلب) کو بنایا تاکہ انسان کے لیے اس کا حصول آسان ہو جائے، کیونکہ القلب (قلب) میں التقلیب (الٹ پلٹ) ہے، اور اسے العقل (عقل) میں نہیں بنایا کیونکہ العقل (عقل) میں التقیید (پابندی) ہے۔ پس اگر یہ رغبت العقل (عقل) میں ہوتی تو شاید وہ یہ دیکھتا کہ وہ ایک ہی حالت پر قائم ہے، برخلاف اس کے کہ یہ القلب (قلب) میں ہے، کیونکہ اس پر التقلیب (الٹ پلٹ) تیزی سے آتی ہے، اس لیے کہ وہ رحمن کی انگلیوں کے درمیان ہے، پس وہ نفس الامر میں ایک حالت پر باقی نہیں رہتا، بلکہ اپنے الشہود (شہود) اور ان حالات کے مطابق جن میں انگلیاں اسے پلٹتی ہیں، اپنی تقلیب پر ثابت رہتا ہے۔\n\nاور جہاں تک السریۃ (سری) رغبت کا تعلق ہے جس کا متعلق الحق (ذات حق) ہے، تو یہاں الحق (ذات حق) سے ہماری مراد وہ ہے جو مخلوق کے لیے مشروع اعمال میں ظاہر ہوتا ہے۔ پس السر (باطن) اس الحق (ذات حق) میں رغبت کرتا ہے ان المعارف الإلهية (الٰہی معرفتوں) کی وجہ سے جو اس میں شامل ہوتے ہیں یا اس کے ذریعے ظاہر ہوتے ہیں، جو مشروع احکام میں مضمر ہیں اور صرف ان پر عمل کرنے سے ہی الکشف (کشف) ہوتے ہیں۔ کیونکہ الظاہر (ظاہر) حکم کے لحاظ سے الباطن (باطن) سے زیادہ قوی ہے، یعنی وہ زیادہ عام ہے، کیونکہ الظاہر (ظاہر) کے لیے خلق اور الحق (ذات حق) کا مقام ہے، جبکہ الباطن (باطن) کے لیے خلق کے بغیر صرف الحق (ذات حق) کا مقام ہے۔ کیونکہ الحق (ذات حق) اپنے آپ سے پوشیدہ نہیں ہوتا اور وہ اپنے لیے ظاہر ہے۔ پس جس نے یہ جان لیا، اس کا السر (باطن) الحق (ذات حق) میں رغبت کرتا ہے، کیونکہ اللہ نے عالم کو اس کے ساتھ جوڑ دیا ہے اور اپنے بارے میں خبر دی ہے کہ اس کی دو نسبتیں ہیں: ایک نسبت عالم کی طرف الٰہی اسماء کے ذریعے جو عالم کے اعیان کو ثابت کرتے ہیں، اور دوسری نسبت اس سے بے نیازی کی ہے۔ پس اپنی بے نیازی کی نسبت سے وہ خود کو جانتا ہے اور ہم اسے نہیں جانتے، لہٰذا وہ اپنے آپ سے پوشیدہ نہیں ہوا، اور عالم کے ساتھ اپنے تعلق کی نسبت سے، جو اس پر دلالت کرتا ہے، اس نے خود کو بھی جانا اور ہم نے بھی اسے جانا۔ پس الظاہر (ظاہر) نے دونوں نسبتوں کو شامل کر لیا، لہٰذا وہ حکم میں الباطن (باطن) سے زیادہ قوی ہوا۔ پس السر (باطن) نے الحق (ذات حق) میں رغبت کی، کیونکہ وہ جانتا ہے کہ بے نیازی کی نسبت کا ادراک صرف وہی کر سکتا ہے، لہٰذا اس نے اپنی مایوسی کو ختم کیا اور اپنے نفس کو راحت دی اور وہ طلب کیا جو اسے طلب کرنا چاہیے تھا، پس اس نے آگ کے شعلے میں پھونک ماری اور وہ گوشت اور ہڈی نہیں تھا۔\n\nاللہ ہمیں ان لوگوں میں شامل کرے جنہوں نے الحق (ذات حق) کو حق دیکھا اور اس کی پیروی کی، اور وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے)۔",
    "fa": "باب دویست و سی و سوم در رغبت (اشتیاق)\n\nاز آن روی گرداندم و به سوی آن مشتاق شدم،\nبه خاطر آنچه مقام کسی چون من اقتضا می‌کند،\nدر هر آنچه او (حق) می‌پسندد.\nبرای خدا شمشیری برّان است،\nبرای همگان، آنگاه که آن را از نیام برکشد.\n\n### [رغبت بر سه گونه است]\n\nرغبت (الرغبة) در اصطلاح اهل طریقت (القوم) بر سه گونه است: رغبتی که جایگاهش نفس (النفس) است و متعلق آن ثواب است؛ و رغبتی که جایگاهش قلب (القلب) است و متعلق آن حقیقت (الحقيقة) است؛ و رغبتی که جایگاهش سرّ (السر) است و متعلق آن حق (الحق) است.\n\nاما رغبت نفسانی (الرغبة النفسية) تنها در میان عوام و در میان کاملان (الكمل) از مردان خدا وجود دارد؛ زیرا کاملان می‌دانند که انسان مجموعه‌ای از اموری است که خداوند او را بر اساس آنها آفریده است: طبیعی، روحانی و الهی. پس می‌داند که در وجود او کسی هست که ثوابی را که خداوند وعده داده است می‌طلبد، و به خاطر اثبات حکم الهی به آن رغبت می‌ورزد. اما عوام از این امر آگاهی ندارند. بنابراین، کامل و عامی در صورت رغبت مشترک‌اند، اما در انگیزه (الباعث) هر یک از دیگری متمایز می‌شود.\n\nمانند ترس در روز فزع اکبر (وحشت بزرگ) که رسولان (علیهم السلام) که بالاترین طوایف هستند، و عوام که گناهکاران و عاصیان‌اند، در آن مشترک‌اند. رسولان (علیهم السلام) از ترس بر امت‌های خود می‌ترسند، نه بر خودشان، زیرا آنان در آن موطن در امان هستند؛ و عوام بر نفس‌های خود می‌ترسند. پس در ترس مشترک‌اند و در سبب موجِب آن از هم جدا می‌شوند.\n\nیکی از کاملان (الكمل) آبی را در کوزه سرد کرده بود تا بنوشد. به خواب رفت و در واقعه‌ای بشارت‌دهنده، حوریه‌ای از زیباترین حوریانِ عین (الحور العين) را دید که به سویش آمد. به او گفت: تو از آنِ چه کسی هستی؟ گفت: از آنِ کسی که آب سرد شده در کوزه‌ها را نمی‌نوشد. سپس در حالی که او نگاه می‌کرد، کوزه را برداشت و شکست. پس آن حوریه از آنِ او شد. هنگامی که بیدار شد، کوزه را شکسته یافت. سفال‌های آن را در جای خود رها کرد و آن را برنداشت تا اینکه خاک بر آن نشست، تا یادآوری برای او باشد. پس دانست که در وجود او کسی هست که پروردگارش را می‌طلبد و کسی هست که آن دوشیزه را می‌طلبد. به همین دلیل از او پرسید. پس حق هر صاحب حقی را ادا کرد و بر نفس خود ستم نکرد.\n\nزیرا برخی از برگزیدگان (المصطفين) از بندگان خدا هستند که بر نفس خود ستمکارند؛ یعنی به خاطر نفس خود، بر نفس خویش ستم می‌کنند، به این صورت که حق آن را به جا نمی‌آورند، زیرا در علم از مرتبه کسی که می‌داند حقایق او که بر آنهاست با یکدیگر تداخل نمی‌کنند و هر حقیقتی از مرتبه خود تجاوز نمی‌کند و جز آنچه شایسته آن است نمی‌پذیرد، پایین‌تر است.\n\nپس چشم جز بیداری و خواب و آنچه مختص به آن است نمی‌پذیرد، و از ثواب جز مشاهده و رؤیت نمی‌پذیرد. و گوش در ثواب جز خطاب (سخن گفتن) نمی‌پذیرد، زیرا شهود (الشهود) برای شنیدن نیست. و کامل برای قوای خود به اندازه‌ای که طلب می‌کنند تلاش می‌کند، و او پیشوایی خیرخواه برای رعیت خود است و به آنها خیانت نمی‌کند. اگر به آنها ستم کند، در گمان خود به خاطر خودشان ستم می‌کند، و این به دلیل جهل او به چیزی است که دیگران از آن آگاه شده‌اند.\n\nمانند سلمان فارسی و برادر دینی‌اش ابوالدرداء در حالشان. رسول خدا (صلی الله علیه و سلم) سلمان را برتر دانست، زیرا او حق هر صاحب حقی را ادا می‌کرد؛ روزه می‌گرفت و افطار می‌کرد، شب‌زنده‌داری می‌کرد و می‌خوابید. در حالی که ابوالدرداء، با وجود برگزیده بودن، بر نفس خود ستمکار بود؛ روزه می‌گرفت و افطار نمی‌کرد، و شب‌زنده‌داری می‌کرد و نمی‌خوابید.\n\nو اما رغبت قلبی (الرغبة القلبية) در حقیقت (الحقيقة): حقیقت در هستی (الوجود) همان تلوّن (التلوين) (تغییر حالات) است، و کسی که در تلوّن متمکن است، صاحب تمکین (التمكين) (استقرار معنوی) است، نه کسی که مقابل تلوّن قرار می‌گیرد. زیرا حقیقت اقتضا می‌کند که امر چنین باشد، چرا که خداوند «هر روز در کاری است» (كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ). پس او در تلوّن است.\n\nپس این قلب مشتاق شهود (الشهود) این حقیقت است. و خداوند جایگاه آن را قلب قرار داد تا دستیابی به آن را برای انسان آسان سازد، به دلیل خاصیت تقلیب (دگرگونی و زیر و رو شدن) که در قلب وجود دارد. و آن را در عقل قرار نداد، به دلیل خاصیت تقیید (محدودیت) که در عقل است. اگر این رغبت در عقل بود، شاید می‌دید که بر یک حالت ثابت می‌ماند، برخلاف اینکه در قلب است؛ زیرا تقلیب به سرعت به سوی آن می‌آید، چرا که قلب «بین دو انگشت رحمان است». پس در نفس‌الامر بر یک حالت باقی نمی‌ماند، بلکه بر دگرگونی خود در احوالش، بر اساس شهودش و آنچه انگشتان آن را زیر و رو می‌کنند، ثابت می‌ماند.\n\nو اما رغبت سرّی (الرغبة السرية) که متعلق آن حق (الحق) است: منظور ما از حق در اینجا چیزی است که برای خلق در اعمال مشروع (شرعی) ظاهر می‌شود. پس سرّ (السر) به این حق رغبت می‌ورزد، به خاطر معارف الهی که در آن مندرج است یا به واسطه آن آشکار می‌شود؛ معارفی که احکام مشروع دربردارند و جز با عمل به آنها کشف نمی‌شوند.\n\nزیرا ظاهر (الظاهر) از نظر حکم قوی‌تر از باطن (الباطن) است، یعنی عام‌تر است. چرا که ظاهر مقام خلق و حق را دارد، در حالی که باطن مقام حق را بدون خلق دارد. زیرا حق از خود پنهان نمی‌شود و برای خود آشکار است.\n\nپس کسی که این را بداند، سرّ او به حق رغبت می‌ورزد. زیرا خداوند عالم را به خود پیوند داده و از خود خبر داده است که دو نسبت دارد: نسبتی به عالم از طریق اسماء الهی که اعیان عالم را ثابت می‌کنند، و نسبتی که غنای او از عالم است. از نسبت غنای او از عالم، خود را می‌شناسد و ما او را نمی‌شناسیم، پس از خود پنهان نمانده است. و از نسبت پیوند عالم به او برای دلالت بر او، نیز خود را شناخت و ما او را شناختیم. پس ظاهر هر دو نسبت را دربر گرفت و از این رو در حکم از باطن قوی‌تر بود.\n\nپس سرّ (السر) به حق رغبت ورزید، زیرا می‌دانست که درک‌کننده نسبت غنا (بی‌نیازی) جز او نیست. پس یأس خود را قطع کرد و نفس خود را آسوده ساخت و آنچه را که شایسته طلب بود، طلب کرد. پس در آتش دمید و گوشت و استخوان نبود. خداوند ما را از کسانی قرار دهد که حق را حق دیدند و از آن پیروی کردند. و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}