{
  "id": 20,
  "title": {
    "ar": "الباب العشرون في العلم العيسوى ومن أين جاء وإلى أين ينتهي وكيفيته وهل تعلق بطول العالم أو بعرضه أو بهما",
    "en": "Chapter Twenty: Concerning the Isaian Knowledge (العلم العيسوى), its origin, its terminus, its modality, and whether it relates to the length of the Cosmos (العالم), or to its breadth, or to both.",
    "ur": "بیسواں باب: عیسوی علم کے متعلق، اور یہ کہاں سے ظاہر ہوا، اور کہاں اس کی انتہا ہے، اور اس کی کیفیت کیا ہے، اور آیا اس کا تعلق عالم کی طول (لمبائی) سے ہے یا اس کے عرض (چوڑائی) سے یا دونوں سے۔",
    "fa": "باب بیستم دربارۀ علم عیسوی (العلم العيسوى)، و اینکه از کجا آمده و به کجا پایان می‌یابد، و چگونگی آن، و اینکه آیا به طول عالم تعلق دارد یا به عرض آن یا به هر دوی آنها."
  },
  "content": {
    "ar": "## «الباب العشرون في العلم العيسوى ومن أين جاء وإلى أين ينتهي وكيفيته وهل تعلق بطول العالم أو بعرضه أو بهما»\n\n\n> علم عيسى هو الذي *** جهل الخلق قدره‏\n\n\n> كان يحيى به الذي *** كانت الأرض قبره‏\n\n\n> قاوم النفخ إذن من *** غاب فيه وأمره شأن لاهوته الذي‏\n\n\n> كان في الغيب صهره *** هو روح ممثل‏\n\n\nأظهر الله سره‏\n> جاء من غيب حضرة *** قد محا الله بدره‏\n\n\n> صار خلقا من بعد ما *** كان روحا فغره‏\n\n\n> وانتهى فيه أمره *** فحباه وسره‏\n\n\n> من يكن مثله فقد *** عظم الله أجره‏\n\n\n### [في علم الحروف‏]\n\n\nاعلم أيدك الله أن العلم العيسوى هو علم الحروف ولهذا أعطى النفخ وهو الهواء الخارج من تجويف القلب الذي هو روح الحياة فإذا انقطع الهواء في طريق خروجه إلى فم الجسد سمي مواضع انقطاعه حروفا فظهرت أعيان الحروف فلما تألفت ظهرت الحياة الحسية في المعاني وهو أول ما ظهر من الحضرة الإلهية للعالم ولم يكن للاعيان في حال عدمها شي‏ء من النسب إلا السمع فكانت الأعيان مستعدة في ذواتها في حال عدمها لقبول الأمر الإلهي إذا ورد عليها بالوجود فلما أراد بها الوجود قال لها كن فتكونت وظهرت في أعيانها فكان الكلام الإلهي أول شي‏ء أدركته من الله تعالى بالكلام الذي يليق به سبحانه فأول كلمة تركبت كلمة كن وهي مركبة من ثلاثة أحرف كاف وواو ونون وكل حرف من ثلاثة فظهرت التسعة التي جذرها الثلاثة وهي أول الأفراد وانتهت بسائط العدد بوجود التسعة من كن فظهر بكن عين المعدود والعدد ومن هنا كان أصل تركيب المقدمات من ثلاثة وإن كانت في الظاهر أربعة فإن الواجد يتكرر في المقدمتين فهي ثلاثة وعن الفرد وجد الكون لا عن الواحد\n\n\n### [في نفس الرحمن‏]\n\n\nوقد عرفنا الحق أن سبب الحياة في صور المولدات إنما هو النفخ الإلهي في قوله فَإِذا سَوَّيْتُهُ ونَفَخْتُ فِيهِ من رُوحِي وهو النفس الذي أحيا الله به الايمان فأظهره‏\n\n\nقال صلى الله عليه وسلم إن نفس الرحمن يأتيني من قبل اليمن‏\n\n\nفحييت بذلك النفس الرحماني صورة الايمان في قلوب المؤمنين وصورة الأحكام المشروعة فأعطى عيسى علم هذا النفخ الإلهي ونسبته فكان ينفخ في الصورة الكائنة في القبر أو في صورة الطائر الذي أنشأه من الطين فيقوم حيا بالإذن الإلهي الساري في تلك النفخة وفي ذلك الهواء ولو لا سريان الأذن الإلهي فيه لما حصلت حياة في صورة أصلا فمن نفس الرحمن جاء العلم العيسوى إلى عيسى فكان يحيي الموتى بنفخه عليه السلام وكان انتهاؤه إلى الصور المنفوخ فيها وذلك هو الحظ الذي لكل موجود من الله وبه يصل إليه إذا صارت إليه الأمور كلها\n\n\n### [السر الإلهي الذي في الإنسان‏]\n\n\nوإذا تحلل الإنسان في معراجه إلى ربه وأخذ كل كون منه في طريقه ما يناسبه لم يبق منه إلا هذا السر الذي عنده من الله فلا يراه إلا به ولا يسمع كلامه إلا به فإنه يتعالى ويتقدس أن يدرك إلا به وإذا رجع الشخص من هذا المشهد وتركبت صورته التي كانت تحللت في عروجه ورد العالم إليه جميع ما كان أخذه منه مما يناسبه فإن كل عالم لا يتعدى جنسه فاجتمع الكل على هذا السر الإلهي واشتمل عليه وبه سبحت الصورة بحمده وحمدت ربها إذ لا يحمده سواه ولو حمدته الصورة من حيث هي لا من حيث هذا السر لم يظهر الفضل الإلهي ولا الامتنان على هذه الصورة وقد ثبت الامتنان له على جميع الخلائق فثبت إن الذي كان من المخلوق لله من التعظيم والثناء إنما كان من ذلك السر الإلهي ففي كل شي‏ء من روحه وليس شي‏ء فيه فالحق هو الذي حمد نفسه وسبح نفسه وما كان من خير إلهي لهذه الصورة عند ذلك التحميد والتسبيح فمن باب المنة لا من باب الاستحقاق الكوني فإن جعل الحق له استحقاقا فمن حيث إنه أوجب ذلك على نفسه فالكلمات عن الحروف والحروف عن الهواء والهواء عن النفس الرحماني وبالأسماء تظهر الآثار في الأكوان وإليها ينتهي العلم العيسوى ثم إن الإنسان بهذه الكلمات يجعل الحضرة الرحمانية تعطيه من نفسها ما تقوم به حياة ما يسأل فيه بتلك الكلمات فيصير الأمر دوريا دائما\n\n\n### [عيسى روح الله: والروح لها الحياة بالذات‏]\n\n\nواعلم أن حياة الأرواح حياة ذاتية ولهذا يكون كل ذي روح حي بروحه ولما علم بذلك السامري حين أبصر جبريل وعلم أن روحه عين ذاته وأن حياته ذاتية فلا يطأ موضعا إلا حيي ذلك الموضع بمباشرة تلك الصورة الممثلة إياه فأخذ من أثره قبضة وذلك قوله تعالى فيما أخبر به عنه أنه قال ذلك فَقَبَضْتُ قَبْضَةً من أَثَرِ الرَّسُولِ فلما صاغ العجل وصورة نبذ فيه تلك القبضة فخارا العجل ولما كان عيسى عليه السلام روحا كما سماه الله وكما أنشأه روحا في صورة إنسان ثابتة أنشأ جبريل في صورة أعرابي غير ثابتة كان يحيي الموتى بمجرد النفخ ثم إنه أيده بروح القدس فهو روح مؤيد بروح طاهرة من دنس الأكوان والأصل في هذا كله الحي‏\nالأزلي عين الحياة الأبدية وإنما ميز الطرفين أعني الأزل والأبد وجود العالم وحدوثه الحي وهذا العلم هو المتعلق بطول العالم أعني العالم الروحاني وهو عالم المعاني والأمر ويتعلق بعرض العالم وهو عالم الخلق والطبيعة والأجسام والكل لله أَلا لَهُ الْخَلْقُ والْأَمْرُ قُلِ الرُّوحُ من أَمْرِ رَبِّي تَبارَكَ الله رَبُّ الْعالَمِينَ وهذا كان علم الحسين بن منصور رحمه الله فإذا سمعت أحدا من أهل طريقنا يتكلم في الحروف فيقول إن الحرف الفلاني طوله كذا ذراعا أو شبر أو عرضه كذا كالحلاج وغيره فإنه يريد بالطول فعله في عالم الأرواح وبالعرض فعله في عالم الأجسام ذلك المقدار المذكور الذي يميزه به وهذا الاصطلاح من وضع الحلاج‏\n\n\n### [كن- علم عيسى- الرحمة الشاملة]\n\n\nفمن علم من المحققين حقيقة كن فقد علم العلم العلوي ومن أوجد بهمته شيئا من الكائنات فما هو من هذا العلم ولما كانت التسعة ظهرت في حقيقة هذه الثلاثة الأحرف ظهر عنها من المعدودات التسعة الأفلاك وبحركات مجموع التسعة الأفلاك وتسيير كواكبها وجدت الدنيا وما فيها كما أنها أيضا تخرب بحركاتها وبحركة الأعلى من هذه التسعة وجدت الجنة بما فيها وعند حركة ذلك الأعلى يتكون جميع ما في الجنة وبحركة الثاني الذي يلي الأعلى وجدت النار بما فيها والقيامة والبعث والحشر والنشر وبما ذكرناه كانت الدنيا ممتزجة نعيم ممزوج بعذاب وبما ذكرناه أيضا كانت الجنة نعيما كلها والنار عذابا كلها وزال ذلك المزج في أهلها فنشأة الآخرة لا تقبل مزاج نشأة الدنيا وهذا هو الفرقان بين نشأة الدنيا والآخرة ألا أن نشأة النار أعني أهلها إذا انتهى فيهم الغضب الإلهي وأمده ولحق بالرحمة التي سبقته في المدى يرجع الحكم لها فيهم وصورتها لا تتبدل ولو تبدلت تعذبوا فيحكم عليهم أولا بإذن الله وتوليته حركة الفلك الثاني من الأعلى بما يظهر فيهم من العذاب في كل محل قابل للعذاب وإنما قلنا في كل محل قابل للعذاب لأجل من فيها ممن لا يقبل العذاب فإذا انقضت مدتها وهي خمس وأربعون ألف سنة تكون في هذه المدة عذابا على أهلها يتعذبون فيها عذابا متصلا لا يفتر ثلاثة وعشرين ألف سنة ثم يرسل الرحمن عليهم نومة يغيبون فيها عن الإحساس وهو قوله تعالى لا يَمُوتُ فِيها ولا يَحْيى‏ وقوله عليه السلام في أهل النار الذين هم أهلها لا يموتون فيها ولا يحيون‏\n\n\nيريد حالهم في هذه الأوقات التي يغيبون فيها عن إحساسهم مثل الذي يغشى عليه من أهل العذاب في الدنيا من شدة الجزع وقوة الآلام المفرطة فيمكثون كذلك تسع عشرة ألف سنة ثم يفيقون من غشيتهم وقد بدل الله جلودهم جلودا غيرها فيعذبون فيها خمسة عشر ألف سنة ثم يغشى عليهم فيمكثون في غشيتهم إحدى عشرة ألف سنة ثم يفيقون وقد بدل الله جلودهم جُلُوداً غَيْرَها لِيَذُوقُوا الْعَذابَ فيجدون العذاب الأليم سبعة آلاف سنة ثم يغشى عليهم ثلاثة آلاف سنة ثم يفيقون فيرزقهم الله لذة وراحة مثل الذي ينام على تعب ويستيقظ وهذا من رحمته التي سبقت غضبه ووَسِعَتْ كُلَّ شَيْ‏ءٍ فيكون لها حكم عند ذلك حكم التأبيد من الاسم الواسع الذي به وسع كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً فلا يجدون ألما ويدوم لهم ذلك ويستغنمونه ويقولون نسينا فلا نسأل حذرا أن نذكر بنفوسنا وقد قال الله لنا اخْسَؤُا فِيها ولا تُكَلِّمُونِ فيسكتون وهُمْ فِيهِ مُبْلِسُونَ ولا يبقى عليهم من العذاب إلا الخوف من رجوع العذاب عليهم فهذا القدر من العذاب هو الذي يسرمد عليهم وهو الخوف وهو عذاب نفسي لا حسي وقد يذهلون عنه في أوقات فنعيمهم الراحة من العذاب الحسي بما يجعل الله في قلوبهم من أنه ذو رحمة واسعة يقول الله تعالى الْيَوْمَ نَنْساكُمْ كَما نَسِيتُمْ ومن هذه الحقيقة يقولون نسينا إذا لم يحسوا بالآلام وكذلك قوله نَسُوا الله فَنَسِيَهُمْ وكَذلِكَ الْيَوْمَ تُنْسى‏ أي تترك في جهنم إذ كان النسيان الترك وبالهمز التأخر\n\n\n### [أهل النار]\n\n\nفأهل النار حظهم من النعيم عدم وقوع العذاب وحظهم من العذاب توقعه فإنه لا أمان لهم بطريق الأخبار عن الله ويحجبون عن خوف التوقع في أوقات فوقتا يحجبون عنه عشرة آلاف سنة ووقتا ألفي سنة ووقتا ستة آلاف سنة ولا يخرجون عن هذا المقدار المذكور متى ما كان لا بد أن يكون هذا القدر لهم من الزمان وإذا أراد الله أن ينعمهم من اسمه الرحمن ينظرون في حالهم التي هم عليها في الوقت وخروجهم مما كانوا فيه من العذاب فينعمون بذلك القدر من النظر فوقتا يدوم لهم هذا النظر ألف سنة ووقتا تسعة آلاف سنة ووقتا خمسة آلاف سنة فيزيد وينقص فلا تزال حالهم هذه دائما في جهنم إذ هم أهلها وهذا الذي ذكرناه كله من العلم العيسوى الموروث من المقام المحمدي والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "The Twentieth Chapter: Concerning the Isa-ean Knowledge, its Origin, its Culmination, its Modality, and whether it relates to the Length of the Cosmos, its Breadth, or Both.\n\nThe Knowledge of Jesus is that\nWhose measure Creation ignored.\nBy it, he revived that one\nWhose grave was the earth.\nThe breath resisted then, from\nThe one who was absent within it, and his affair is the concern of his Divinity (لاهوته) which\nWas his affinity in the Unseen (الغيب).\nHe is a Spirit (روح) represented\nWhose secret Allah manifested.\nHe came from the Unseen of a Presence\nWhose full moon Allah effaced.\nHe became a creature after what\nHe was a Spirit, so it deceived him.\nAnd his affair culminated in it,\nSo He endowed him and made him a secret.\nWhoever is like him, then\nAllah has magnified his reward.\n\n### [Concerning the Science of Letters]\n\nKnow, may Allah strengthen you, that the Isa-ean Knowledge (العلم العيسوى) is the Science of Letters (علم الحروف). For this reason, he was given the Breath (النفخ), which is the air exiting the cavity of the heart, which is the Spirit of Life (روح الحياة). When the air is interrupted on its way out to the mouth of the body, the places of its interruption are called letters (حروف), and thus the Fixed Entities (أعيان) of the letters appeared. When they were composed, sensory life appeared in the meanings (المعاني). This was the first thing that manifested from the Divine Presence (الحضرة الإلهية) to the Cosmos (العالم).\n\nThe Fixed Entities (الأعيان) in their state of non-existence (عدم) had no relationship (نسب) except hearing (السمع). Thus, the Fixed Entities were prepared in their essences (ذواتها) in their state of non-existence to accept the Divine Command (الأمر الإلهي) when it came upon them with Existence (الوجود). When He willed Existence for them, He said to them, \"Be!\" (*Kun*), and they came into being and appeared in their entities. The Divine Speech (الكلام الإلهي) was the first thing they perceived from Allah, the Exalted, through the speech befitting Him, Glory be to Him.\n\nThe first word composed was the word *Kun*, which is composed of three letters: *Kaf*, *Waw*, and *Nun*. And each letter is composed of three, so the Nine appeared, whose root is the Three, and which is the first of the odd numbers (الأفراد). The simple numbers culminated with the existence of the Nine from *Kun*. Thus, through *Kun*, the entity of the counted (المعدود) and the number (العدد) appeared. From this, the origin of the composition of premises (المقدمات) was three, even if they appear outwardly as four, because the existent (الواجد) is repeated in the two premises, making them three. And from the Odd (الفرد) did the Cosmos (الكون) come into existence, not from the One (الواحد).\n\n### [Concerning the Breath of the All-Merciful]\n\nThe Real (الحق) has informed us that the cause of life in the forms of generated beings (المولدات) is none other than the Divine Blowing (النفخ الإلهي), as stated in His saying: <<فَإِذا سَوَّيْتُهُ ونَفَخْتُ فِيهِ من رُوحِي>> (So when I have proportioned him and breathed into him of My Spirit). This is the Breath (النفس) by which Allah revived and manifested faith (الايمان).\n\nThe Prophet, peace and blessings be upon him, said: \"Indeed, the Breath of the All-Merciful (نفس الرحمن) comes to me from the direction of Yemen.\"\n\nBy that Merciful Breath (النفس الرحماني), the form of faith in the hearts of the believers and the form of the prescribed rulings (الأحكام المشروعة) were revived. Thus, Jesus was given the knowledge of this Divine Blowing and its relationship. He would blow into the form existing in the grave, or into the form of the bird he created from clay, and it would stand up alive by the Divine Permission (الإذن الإلهي) flowing through that blowing and that air. Were it not for the flow of the Divine Permission within it, life would not occur in any form whatsoever.\n\nTherefore, the Isa-ean Knowledge (العلم العيسوى) came to Jesus from the Breath of the All-Merciful. He would revive the dead by his blowing, peace be upon him. Its culmination was in the forms into which the breath was blown. That is the portion (الحظ) that every existent being has from Allah, and by it, one reaches Him when all affairs return to Him.\n\n### [The Divine Secret within the Human Being]\n\nWhen the human being dissolves (تحلل) in his spiritual ascent (معراجه) to his Lord, and every realm (كون) takes from him on his path what is appropriate to it, nothing remains of him except this Secret (السر) that he possesses from Allah. He does not see Him except through it, nor does he hear His speech except through it, for He is too Exalted and Holy to be perceived except through it.\n\nWhen the person returns from this station of witnessing (المشهد) and his form, which had dissolved during his ascent, is recomposed, the Cosmos returns to him everything it had taken from him that was appropriate to it, for every realm does not transgress its own kind. Thus, everything gathers upon this Divine Secret and encompasses it. By means of it, the form glorifies (سبحت) Him with His praise and praises its Lord, since none praises Him but Him. If the form were to praise Him merely as a form, and not by virtue of this Secret, the Divine Grace (الفضل الإلهي) and the favor (الامتنان) upon this form would not be manifest. Since the favor upon all creatures is established, it is proven that the magnification (التعظيم) and praise (الثناء) offered by the creature to Allah originated only from that Divine Secret.\n\nThus, in everything there is something of His Spirit (روحه), but nothing is *in* Him. The Real (الحق) is the one who praised Himself and glorified Himself. Whatever Divine good (خير إلهي) accrued to this form during that praise and glorification is by way of favor (المنة), not by way of cosmic entitlement (الاستحقاق الكوني). If the Real grants it entitlement, it is only because He made that incumbent upon Himself.\n\nThe words originate from the letters, the letters from the air, and the air from the Merciful Breath (النفس الرحماني). Through the Names (الأسماء), the effects (الآثار) appear in the existent things (الأكوان), and to them, the Isa-ean Knowledge culminates. Furthermore, by means of these words, the human being causes the Merciful Presence (الحضرة الرحمانية) to grant him from itself that by which the life of whatever he asks for through those words is sustained, thus making the affair perpetually cyclical.\n\n### [Jesus is the Spirit of Allah: And the Spirit possesses Life by Essence]\n\nKnow that the life of the Spirits (الأرواح) is essential life (حياة ذاتية). For this reason, every possessor of a spirit is alive by his spirit. When the Samiri knew this, upon seeing Gabriel, and knew that his spirit was the very essence (عين ذاته) of his being and that his life was essential, he knew that Gabriel would not step on any place without that place becoming alive through the direct contact of the form representing him. So he took a handful from his trace (أثره). This is what Allah, the Exalted, reported concerning him, that he said: <<فَقَبَضْتُ قَبْضَةً من أَثَرِ الرَّسُولِ>> (So I took a handful from the trace of the Messenger). When he fashioned the calf and its form, he cast that handful into it, and the calf lowed.\n\nSince Jesus, peace be upon him, was a Spirit (روح), as Allah named him, and since He created him as a Spirit in a fixed human form—just as He created Gabriel in a non-fixed form of a Bedouin—Jesus would revive the dead merely by blowing. Furthermore, He supported him with the Holy Spirit (روح القدس). Thus, he is a Spirit supported by a pure Spirit, free from the defilement of existent things (الأكوان). The origin of all this is the Everlasting Living One (الحي الأزلي), the very Essence of Eternal Life (عين الحياة الأبدية). What distinguishes the two extremes—meaning Eternity without beginning (الأزل) and Eternity without end (الأبد)—is the existence of the Cosmos (العالم) and its living origination (حدوثه الحي).\n\nThis Knowledge relates to the length of the Cosmos (طول العالم), meaning the Spiritual World (العالم الروحاني), which is the world of Meanings (المعاني) and Command (الأمر). And it relates to the breadth of the Cosmos (عرض العالم), which is the world of Creation (الخلق), Nature (الطبيعة), and Bodies (الأجسام). And everything belongs to Allah: <<أَلا لَهُ الْخَلْقُ والْأَمْرُ>> (Unquestionably, to Him belongs the Creation and the Command). <<قُلِ الرُّوحُ من أَمْرِ رَبِّي>> (Say: The Spirit is from the Command of my Lord). <<تَبارَكَ الله رَبُّ الْعالَمِينَ>> (Blessed is Allah, the Lord of the Worlds).\n\nThis was the knowledge of Al-Husayn ibn Mansur (Al-Hallaj), may Allah have mercy on him. If you hear anyone among the people of our path speaking about the letters (الحروف) and saying that a certain letter has a length of so many cubits or spans, or a breadth of so much—like Al-Hallaj and others—he means by the length (الطول) its action in the world of Spirits (عالم الأرواح), and by the breadth (العرض) its action in the world of Bodies (عالم الأجسام), using that specified measure to distinguish it. This terminology (الاصطلاح) was established by Al-Hallaj.\n\n### [Kun - The Knowledge of Jesus - The All-Encompassing Mercy]\n\nWhoever among the Verifiers (المحققين) knows the Reality of *Kun* has known the Supreme Knowledge (العلم العلوي). And whoever brings something into existence among the created things (الكائنات) merely by his spiritual aspiration (همته) does not possess this Knowledge.\n\nSince the Nine appeared in the reality of these three letters, the nine celestial spheres (الأفلاك) appeared from them among the counted things. Through the movements of the totality of the nine spheres and the courses of their stars, the world (الدنيا) and what is in it came into existence, just as it will also be destroyed by their movements. Through the movement of the highest of these nine, Paradise (الجنة) and what is in it came into existence. Upon the movement of that highest sphere, everything in Paradise is formed. Through the movement of the second sphere immediately below the highest, the Fire (النار) and what is in it, the Resurrection (القيامة), the Raising (البعث), the Gathering (الحشر), and the Spreading (النشر) came into existence.\n\nDue to what we mentioned, the world is mixed: bliss mixed with torment. And due to what we mentioned, Paradise is entirely bliss, and the Fire is entirely torment, and that mixture is removed from their inhabitants. The state of the Hereafter (نشأة الآخرة) does not accept the mixture of the state of the world (نشأة الدنيا). This is the Criterion (الفرقان) between the state of the world and the Hereafter.\n\nHowever, the state of the Fire—meaning its inhabitants—when the Divine Wrath (الغضب الإلهي) and its duration ends in them, and it joins the Mercy (الرحمة) that preceded it in scope, the ruling returns to Mercy concerning them. Their form does not change, for if it changed, they would be tormented. They are ruled initially by the permission of Allah and His governance of the movement of the second sphere from the highest, by what manifests in them of torment in every place capable of receiving torment. We only said \"in every place capable of receiving torment\" because of those within it who do not accept torment.\n\nWhen its duration ends—which is forty-five thousand years—during this period, it is a torment upon its inhabitants. They are tormented continuously without abatement for twenty-three thousand years. Then the All-Merciful sends upon them a sleep (نومة) during which they are absent from sensation. This is His saying, the Exalted: <<لا يَمُوتُ فِيها ولا يَحْيى‏>> (He neither dies therein nor lives), and the Prophet's saying concerning the inhabitants of the Fire who are its true inhabitants: \"They neither die therein nor live.\" He means that their state during these times when they are absent from their sensation is like one of the tormented in the world who faints due to extreme anxiety and excessive pain.\n\nThey remain like that for nineteen thousand years, then they awaken from their fainting, and Allah has replaced their skins with other skins. They are tormented in them for fifteen thousand years. Then they faint again, remaining in their fainting for eleven thousand years. Then they awaken, and Allah has replaced their skins with other skins <<لِيَذُوقُوا الْعَذابَ>> (so that they may taste the torment). They find the painful torment for seven thousand years. Then they faint for three thousand years. Then they awaken, and Allah provides them with pleasure and rest, like one who sleeps after exhaustion and wakes up.\n\nThis is from His Mercy (رحمته) which preceded His Wrath and <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompassed all things). At that point, Mercy holds the ruling of perpetuity (التأبيد) derived from the Name The All-Encompassing (الواسع), by which He encompassed <<كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً>> (all things in Mercy and Knowledge). They find no pain, and this state endures for them. They consider it a gain and say, \"We have forgotten, so we will not ask, fearing that we might remind ourselves.\" Allah has already said to them: <<اخْسَؤُا فِيها ولا تُكَلِّمُونِ>> (Be driven away into it, and do not speak to Me). So they fall silent, <<وَهُمْ فِيهِ مُبْلِسُونَ>> (and they are therein in despair).\n\nNothing remains of the torment upon them except the fear of the torment returning to them. This measure of torment is what is made eternal for them, and it is fear (الخوف), which is a psychological torment (عذاب نفسي), not a sensory one (حسي). They may forget this fear at times. Their bliss is the relief from sensory torment, due to what Allah places in their hearts: that He is the Possessor of Vast Mercy. Allah, the Exalted, says: <<الْيَوْمَ نَنْساكُمْ كَما نَسِيتُمْ>> (Today We forget you, just as you forgot). Based on this Reality (الحقيقة), they say, \"We have forgotten,\" when they do not feel the pains. Likewise, His saying: <<نَسُوا الله فَنَسِيَهُمْ>> (They forgot Allah, so He forgot them), and <<وَكَذلِكَ الْيَوْمَ تُنْسى‏>> (And thus today you are forgotten)—meaning you are left in Hell—since *nisyan* (forgetting) means abandonment (الترك), and with the glottal stop (الهمز), it means delay (التأخر).\n\n### [The People of the Fire]\n\nThe portion of bliss (النعيم) for the people of the Fire is the non-occurrence of torment, and their portion of torment is the expectation of its occurrence. For they have no security, according to the reports from Allah. They are veiled from the fear of expectation at certain times: sometimes they are veiled from it for ten thousand years, sometimes for two thousand years, and sometimes for six thousand years. They do not depart from this mentioned measure whenever this duration of time is necessarily appointed for them.\n\nWhen Allah wills to grant them bliss through His Name The All-Merciful (الرحمن), they look at the state they are currently in and their emergence from the torment they were experiencing, and they are granted bliss by that measure of contemplation. Sometimes this contemplation lasts for a thousand years, sometimes for nine thousand years, and sometimes for five thousand years, increasing and decreasing. Their state remains perpetually thus in Hell, since they are its inhabitants.\n\nAll that we have mentioned is part of the Isa-ean Knowledge (العلم العيسوى), inherited from the Muhammadan Station (المقام المحمدي). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب بیسواں: علم عیسوی (العلم العيسوى) کے بارے میں، کہ وہ کہاں سے آیا، کہاں ختم ہوتا ہے، اس کی کیفیت کیا ہے، اور کیا اس کا تعلق عالم کی لمبائی (طول)، یا اس کی چوڑائی (عرض)، یا دونوں سے ہے؟\n\nعیسیٰ کا علم وہ ہے جس کی\nقدر کو مخلوق نے نہ جانا۔\nوہ اس کے ذریعے اسے زندہ کرتے تھے\nجس کی قبر زمین تھی۔\nپس اس نے نفخ (نفخ) کی مزاحمت کی جو\nاس میں غائب تھا، اور اس کا معاملہ\nاس کے لاہوت (لاهوت) کا شأن تھا، جو\nغیب میں اس کا صہر (رشتہ) تھا۔\nوہ ایک روحِ ممثل (روح ممثل) ہے،\nجس کا راز اللہ نے ظاہر کیا۔\nوہ ایک ایسی غیبی حضرۃ (حضرة) سے آیا\nجس کے بدر (چاند) کو اللہ نے مٹا دیا۔\nوہ روح ہونے کے بعد خلق (مخلوق) بن گیا،\nپس اس نے اسے دھوکہ دیا۔\nاور اس میں اس کا معاملہ ختم ہو گیا،\nپس اللہ نے اسے نوازا اور اسے راز بخشا۔\nجو کوئی اس جیسا ہو،\nاللہ اس کے اجر کو عظیم کر دیتا ہے۔\n\n### [علم الحروف (علم الحروف) کے بارے میں]\n\nجان لو، اللہ تمہاری تائید کرے، کہ علم عیسوی (العلم العيسوى) علم الحروف (علم الحروف) ہے۔ اسی لیے انہیں نفخ (نفخ) عطا کیا گیا، جو کہ دل کے جوف سے نکلنے والی ہوا ہے، جو روحِ حیات ہے۔ جب یہ ہوا جسم کے منہ کی طرف نکلنے کے راستے میں منقطع ہوتی ہے، تو اس کے انقطاع کی جگہوں کو حروف (حروف) کہا جاتا ہے۔ پس حروف کے اعیان (أعيان) ظاہر ہوئے۔ جب وہ باہم ملے تو معانی میں حسی زندگی (الحياة الحسية) ظاہر ہوئی۔ یہ پہلی چیز ہے جو عالم کے لیے حضرۃ الٰہیہ (الحضرة الإلهية) سے ظاہر ہوئی۔ اعیان (أعيان) کے لیے ان کی عدم (عدم) کی حالت میں نسبتوں میں سے صرف سمع (سننا) ہی تھا۔ پس اعیان اپنی ذات میں عدم کی حالت میں الٰہی امر (الأمر الإلهي) کو قبول کرنے کے لیے تیار تھے جب وہ وجود (الوجود) کے ساتھ ان پر وارد ہوا۔ جب اللہ نے ان کا وجود چاہا تو ان سے کہا: \"کُن\" (ہو جا)، پس وہ ہو گئے اور اپنے اعیان میں ظاہر ہوئے۔ پس کلامِ الٰہی (الكلام الإلهي) پہلی چیز تھی جسے انہوں نے اللہ تعالیٰ سے اس کلام کے ذریعے پایا جو اس کی شان کے لائق ہے۔ پس پہلا کلمہ جو مرکب ہوا وہ کلمہ \"کُن\" ہے، اور یہ تین حروف: کاف، واؤ، اور نون سے مرکب ہے۔ اور ہر حرف تین سے ہے، پس نو (تسعہ) ظاہر ہوئے جن کی جڑ تین ہے، اور یہ پہلا فرد ہے۔ اور عدد کی بسیطیں (بسیط) \"کُن\" کے نو کے وجود کے ساتھ ختم ہوئیں۔ پس \"کُن\" کے ذریعے معدود (جسے گنا جائے) اور عدد کا عین (حقیقت) ظاہر ہوا۔ اور یہیں سے مقدمات (premises) کی ترکیب کی اصل تین سے ہوئی، اگرچہ وہ ظاہر میں چار ہیں، کیونکہ واجد (پانے والا) دونوں مقدموں میں دہرایا جاتا ہے، پس وہ تین ہیں۔ اور کون (وجود) فرد (الفرد) سے وجود میں آیا، نہ کہ واحد (الواحد) سے۔\n\n### [نفس الرحمن (نفس الرحمن) کے بارے میں]\n\nاور ہمیں الحق (الحق) نے یہ معرفت دی ہے کہ مولدات (پیدا ہونے والی چیزوں) کی صورتوں میں زندگی کا سبب درحقیقت نفخِ الٰہی (النفخ الإلهي) ہے، جیسا کہ اس کے قول میں ہے:\n> فَإِذا سَوَّيْتُهُ ونَفَخْتُ فِيهِ من رُوحِي\n> \"پھر جب میں اسے مکمل کر دوں اور اس میں اپنی روح میں سے پھونک دوں۔\"\nاور یہی وہ نفس (نفس) ہے جس کے ذریعے اللہ نے ایمان کو زندہ کیا اور اسے ظاہر کیا۔\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا:\n> إن نفس الرحمن يأتيني من قبل اليمن‏\n> \"بے شک نفس الرحمن (نفس الرحمن) میرے پاس یمن کی طرف سے آتا ہے۔\"\nپس اسی نفسِ رحمانی (النفس الرحماني) کے ذریعے مؤمنین کے دلوں میں ایمان کی صورت اور مشروع احکام کی صورت زندہ ہوئی۔ پس عیسیٰ (علیہ السلام) کو اس نفخِ الٰہی (النفخ الإلهي) کا علم اور اس کی نسبت عطا کی گئی۔ چنانچہ وہ قبر میں موجود صورت میں یا اس پرندے کی صورت میں جسے انہوں نے مٹی سے بنایا تھا، پھونک مارتے تھے، تو وہ اس نفخہ (نفخہ) میں جاری الٰہی اذن (الإذن الإلهي) کے ذریعے زندہ ہو کر کھڑا ہو جاتا تھا۔ اگر اس میں الٰہی اذن کا جریان نہ ہوتا تو کسی بھی صورت میں زندگی ہرگز حاصل نہ ہوتی۔ پس نفس الرحمن (نفس الرحمن) سے ہی علم عیسوی (العلم العيسوى) عیسیٰ (علیہ السلام) تک پہنچا۔ وہ اپنے نفخ (نفخ) کے ذریعے مردوں کو زندہ کرتے تھے، اور اس کا اختتام ان صورتوں پر ہوتا تھا جن میں پھونکا جاتا تھا۔ اور یہی وہ حصہ ہے جو ہر موجود کو اللہ کی طرف سے حاصل ہے، اور اسی کے ذریعے وہ اللہ تک پہنچتا ہے جب تمام امور اسی کی طرف لوٹ جاتے ہیں۔\n\n### [انسان میں موجود رازِ الٰہی (السر الإلهي) کے بارے میں]\n\nاور جب انسان اپنے رب کی طرف اپنے معراج (معراج) میں تحلیل ہوتا ہے اور ہر کون (وجود) اس سے راستے میں وہ لے لیتا ہے جو اس کے مناسب ہے، تو اس میں صرف یہی راز (السر) باقی رہتا ہے جو اس کے پاس اللہ کی طرف سے ہے۔ پس وہ اسے صرف اسی کے ذریعے دیکھتا ہے اور اس کا کلام صرف اسی کے ذریعے سنتا ہے، کیونکہ وہ اس سے پاک اور بلند ہے کہ اسے اس کے بغیر پایا جا سکے۔ اور جب شخص اس مشہد (مشهد) سے واپس لوٹتا ہے اور اس کی صورت جو اس کے عروج میں تحلیل ہو گئی تھی، دوبارہ مرکب ہوتی ہے، تو عالم اسے وہ سب کچھ واپس کر دیتا ہے جو اس نے اس سے لیا تھا اور جو اس کے مناسب تھا۔ کیونکہ ہر عالم اپنی جنس سے تجاوز نہیں کرتا۔ پس سب اس رازِ الٰہی (السر الإلهي) پر جمع ہو جاتے ہیں اور اسے گھیر لیتے ہیں۔ اور اسی کے ذریعے صورت اللہ کی حمد کے ساتھ تسبیح کرتی ہے اور اپنے رب کی حمد کرتی ہے، کیونکہ اس کے سوا کوئی اس کی حمد نہیں کرتا۔ اور اگر صورت اپنی حیثیت سے حمد کرتی، نہ کہ اس راز کے ذریعے، تو فضلِ الٰہی (الفضل الإلهي) اور اس صورت پر احسان (الامتنان) ظاہر نہ ہوتا۔ اور اللہ کا احسان تمام مخلوقات پر ثابت ہے۔ پس یہ ثابت ہوا کہ مخلوق کی طرف سے اللہ کے لیے جو تعظیم اور ثناء تھی، وہ اسی رازِ الٰہی (السر الإلهي) کی طرف سے تھی۔ پس ہر شے میں اس کی روح میں سے ہے، لیکن کوئی شے اس میں نہیں ہے۔ پس الحق (الحق) ہی ہے جس نے اپنی حمد کی اور اپنی تسبیح کی۔ اور اس تحمید اور تسبیح کے وقت اس صورت کے لیے جو بھی خیرِ الٰہی (خیر إلهي) تھا، وہ احسان (منّت) کے باب سے تھا، نہ کہ کونی استحقاق (الاستحقاق الكوني) کے باب سے۔ اگر الحق نے اس کے لیے استحقاق مقرر کیا ہے، تو اس حیثیت سے کہ اس نے اسے اپنے اوپر واجب کیا ہے۔ پس کلمات حروف سے ہیں، اور حروف ہوا سے ہیں، اور ہوا نفسِ رحمانی (النفس الرحماني) سے ہے۔ اور اسماء (الأسماء) کے ذریعے اکوان (الأكوان) میں آثار ظاہر ہوتے ہیں، اور علم عیسوی (العلم العيسوى) کا اختتام انہی پر ہوتا ہے۔ پھر انسان ان کلمات کے ذریعے حضرۃ رحمانیہ (الحضرة الرحمانية) کو مجبور کرتا ہے کہ وہ اسے اپنے نفس سے وہ چیز عطا کرے جس سے ان کلمات کے ذریعے پوچھی گئی چیز کی زندگی قائم ہو، پس یہ معاملہ ہمیشہ کے لیے دوری (دوری) بن جاتا ہے۔\n\n### [عیسیٰ روح اللہ: اور روح کے لیے زندگی بالذات ہے]\n\nاور جان لو کہ ارواح (الأرواح) کی زندگی ذاتی زندگی (حياة ذاتية) ہے۔ اسی لیے ہر ذی روح اپنی روح کے ذریعے زندہ ہے۔ اور جب سامری (السامري) نے یہ بات جان لی جب اس نے جبرائیل کو دیکھا اور اسے معلوم ہوا کہ اس کی روح اس کی ذات کا عین ہے اور اس کی زندگی ذاتی ہے، پس وہ جس جگہ پر قدم رکھتا ہے، وہ جگہ اس ممثل صورت (الصورة الممثلة) کے براہِ راست تعلق سے زندہ ہو جاتی ہے۔ پس اس نے اس کے اثر سے ایک مٹھی بھر لی۔ اور یہی وہ بات ہے جو اللہ تعالیٰ نے اس کے بارے میں خبر دیتے ہوئے فرمایا کہ اس نے کہا:\n> فَقَبَضْتُ قَبْضَةً من أَثَرِ الرَّسُولِ\n> \"پس میں نے رسول کے اثر سے ایک مٹھی بھر لی۔\"\nپھر جب اس نے بچھڑا بنایا اور اس کی صورت گری کی، تو اس میں وہ مٹھی ڈال دی، پس بچھڑا آواز نکالنے لگا۔ اور چونکہ عیسیٰ علیہ السلام روح (روح) تھے، جیسا کہ اللہ نے انہیں نام دیا اور جیسا کہ جبرائیل نے انہیں ایک ثابت شدہ انسانی صورت میں روح کے طور پر پیدا کیا، جبکہ جبرائیل کو ایک غیر ثابت شدہ اعرابی کی صورت میں پیدا کیا گیا تھا، وہ محض نفخ (پھونک) کے ذریعے مردوں کو زندہ کرتے تھے۔ پھر اللہ نے روح القدس (روح القدس) کے ذریعے ان کی تائید فرمائی۔ پس وہ ایک ایسی روح ہیں جن کی تائید ایک ایسی پاک روح سے کی گئی ہے جو اکوان (الأكوان) کی آلودگی سے پاک ہے۔ اور اس سب کی اصل حیّ ازلی (الحي الأزلي) ہے جو عین حیاتِ ابدیہ (عين الحياة الأبدية) ہے۔ اور دونوں کناروں، یعنی ازل اور ابد، کو صرف عالم کے وجود اور اس کے حدوث (پیدا ہونے) نے ممتاز کیا ہے۔ اور یہ علم عالم کے طول (طول) سے متعلق ہے، یعنی عالمِ روحانی (العالم الروحاني) جو عالمِ معانی (عالم المعاني) اور امر (الأمر) ہے۔ اور یہ عالم کے عرض (عرض) سے متعلق ہے، جو عالمِ خلق (عالم الخلق)، طبیعت اور اجسام ہے۔ اور سب اللہ کے لیے ہیں۔\n> أَلا لَهُ الْخَلْقُ والْأَمْرُ قُلِ الرُّوحُ من أَمْرِ رَبِّي تَبارَكَ الله رَبُّ الْعالَمِينَ\n> \"خبردار! اسی کے لیے خلق (پیدا کرنا) اور امر (حکم دینا) ہے۔ کہہ دیجیے: روح میرے رب کے امر (حکم) سے ہے۔ اللہ، تمام جہانوں کا رب، بابرکت ہے۔\"\nاور یہی حسین بن منصور (رحمہ اللہ) کا علم تھا۔ پس جب تم ہمارے طریق کے کسی شخص کو حروف کے بارے میں بات کرتے ہوئے سنو اور وہ کہے کہ فلاں حرف کی لمبائی اتنے ذراع یا بالشت ہے، یا اس کی چوڑائی اتنی ہے، جیسے کہ حلاج اور دیگر، تو وہ طول (لمبائی) سے عالمِ ارواح (عالم الأرواح) میں اس کے فعل کو مراد لیتا ہے، اور عرض (چوڑائی) سے عالمِ اجسام (عالم الأجسام) میں اس کے فعل کو مراد لیتا ہے، وہ مذکورہ مقدار جس سے وہ اسے ممتاز کرتا ہے۔ اور یہ اصطلاح حلاج کی وضع کردہ ہے۔\n\n### [کُن - علم عیسیٰ - رحمت شاملہ (الرحمة الشاملة)]\n\nپس محققین (المحققين) میں سے جس نے \"کُن\" کی حقیقت کو جان لیا، اس نے علم علوی (العلم العلوي) کو جان لیا۔ اور جس نے اپنی ہمت سے کسی بھی کائنات کو وجود بخشا، وہ اس علم میں سے نہیں ہے۔ اور چونکہ نو (تسعہ) ان تین حروف کی حقیقت میں ظاہر ہوئے، اس لیے ان سے معدودات (گنی جانے والی چیزوں) میں نو افلاک (الأفلاك) ظاہر ہوئے۔ اور ان نو افلاک کی مجموعی حرکات اور ان کے سیاروں کی گردش سے دنیا اور جو کچھ اس میں ہے، وجود میں آیا، جیسا کہ ان کی حرکات سے وہ تباہ بھی ہو جاتی ہے۔ اور ان نو میں سے سب سے اوپر والے کی حرکت سے جنت اور جو کچھ اس میں ہے، وجود میں آیا۔ اور اس اعلیٰ کی حرکت کے وقت جنت میں موجود ہر چیز تشکیل پاتی ہے۔ اور اس اعلیٰ کے بعد دوسرے کی حرکت سے دوزخ اور جو کچھ اس میں ہے، اور قیامت، بعث (دوبارہ اٹھانا)، حشر (جمع کرنا)، اور نشر (پھیلانا) وجود میں آئے۔ اور جو کچھ ہم نے ذکر کیا، اس کی وجہ سے دنیا مخلوط ہے، یعنی نعمت عذاب کے ساتھ ملی ہوئی ہے۔ اور جو کچھ ہم نے ذکر کیا، اس کی وجہ سے جنت پوری کی پوری نعمت ہے اور دوزخ پوری کی پوری عذاب ہے، اور ان کے مکینوں میں یہ آمیزش ختم ہو جاتی ہے۔ پس آخرت کی نشأۃ (پیدائش) دنیا کی نشأۃ کی آمیزش کو قبول نہیں کرتی۔ اور یہی دنیا اور آخرت کی نشأۃ کے درمیان فرقان (امتیاز) ہے۔ مگر یہ کہ دوزخ کی نشأۃ، یعنی اس کے مکین، جب ان میں غضبِ الٰہی (الغضب الإلهي) اور اس کی مدت ختم ہو جاتی ہے اور وہ اس رحمت سے جا ملتا ہے جو مدت میں اس سے سبقت لے گئی تھی، تو ان میں حکم رحمت کا لوٹ آتا ہے۔ اور ان کی صورت نہیں بدلتی، اگر وہ بدل جائے تو انہیں عذاب ہو گا۔ پس ان پر پہلے اللہ کے اذن اور اس کی تولیت سے اعلیٰ سے دوسرے فلک کی حرکت کے ذریعے حکم ہوتا ہے، اس عذاب کے ذریعے جو ان میں عذاب کے ہر قابل قبول مقام پر ظاہر ہوتا ہے۔ اور ہم نے \"عذاب کے ہر قابل قبول مقام\" اس لیے کہا تاکہ ان لوگوں کی خاطر جو اس میں ہیں اور عذاب قبول نہیں کرتے۔ پس جب اس کی مدت ختم ہو جاتی ہے، جو پینتالیس ہزار سال ہے، تو اس مدت میں وہ اپنے مکینوں پر عذاب ہو گا، جس میں وہ مسلسل عذاب پائیں گے جو تیئیس ہزار سال تک کم نہیں ہو گا۔ پھر رحمن (الرحمن) ان پر ایک نیند بھیجے گا جس میں وہ احساس سے غائب ہو جائیں گے، اور یہی اللہ تعالیٰ کا قول ہے:\n> لا يَمُوتُ فِيها ولا يَحْيى‏\n> \"نہ وہ اس میں مریں گے اور نہ زندہ رہیں گے۔\"\nاور نبی اکرم صلی اللہ علیہ وسلم کا اہل دوزخ کے بارے میں قول جو اس کے اہل ہیں:\n> لا يموتون فيها ولا يحيون‏\n> \"وہ اس میں نہ مریں گے اور نہ زندہ رہیں گے۔\"\nآپ کا مطلب ان اوقات میں ان کی حالت ہے جب وہ اپنے احساس سے غائب ہوتے ہیں، جیسے دنیا میں عذاب کے اہل میں سے وہ شخص جسے شدید گھبراہٹ اور حد سے زیادہ درد کی شدت سے غشی آ جاتی ہے۔ پس وہ اسی طرح انیس ہزار سال تک رہیں گے۔ پھر وہ اپنی غشی سے ہوش میں آئیں گے، اور اللہ ان کی کھالوں کو دوسری کھالوں سے بدل چکا ہو گا۔ پس وہ اس میں پندرہ ہزار سال تک عذاب پائیں گے۔ پھر ان پر غشی طاری ہو گی اور وہ گیارہ ہزار سال تک اپنی غشی میں رہیں گے۔ پھر وہ ہوش میں آئیں گے، اور اللہ ان کی کھالوں کو دوسری کھالوں سے بدل چکا ہو گا:\n> جُلُوداً غَيْرَها لِيَذُوقُوا الْعَذابَ\n> \"دوسری کھالوں سے تاکہ وہ عذاب کا مزہ چکھیں۔\"\nپس وہ سات ہزار سال تک دردناک عذاب پائیں گے۔ پھر ان پر تین ہزار سال تک غشی طاری ہو گی۔ پھر وہ ہوش میں آئیں گے، تو اللہ انہیں لذت اور راحت عطا فرمائے گا، جیسے کوئی تھکاوٹ پر سوتا ہے اور بیدار ہوتا ہے۔ اور یہ اس کی رحمت میں سے ہے جو اس کے غضب پر سبقت لے گئی، اور\n> وَسِعَتْ كُلَّ شَيْ‏ءٍ\n> \"ہر چیز کو گھیر لیا ہے۔\"\nپس اس وقت اس (رحمت) کا حکم دائمی (تأبید) ہو گا، اس اسم الواسع (الواسع) کی طرف سے جس کے ذریعے اس نے\n> وَسِعَ كُلَّ شَيْ‏ءٍ رَحْمَةً وعِلْماً\n> \"ہر چیز کو رحمت اور علم سے گھیر لیا ہے۔\"\nپس وہ کوئی درد محسوس نہیں کریں گے اور یہ ان کے لیے ہمیشہ رہے گا، اور وہ اسے غنیمت جانیں گے اور کہیں گے: \"ہم بھول گئے، پس ہم سوال نہیں کرتے، اس ڈر سے کہ ہم اپنے نفسوں کے ذریعے یاد دلائے جائیں۔\" اور اللہ نے ہم سے فرمایا ہے:\n> اخْسَؤُا فِيها ولا تُكَلِّمُونِ\n> \"اسی میں ذلیل ہو کر پڑے رہو اور مجھ سے بات نہ کرو۔\"\nپس وہ خاموش ہو جائیں گے، اور\n> وهُمْ فِيهِ مُبْلِسُونَ\n> \"اور وہ اس میں مایوس ہوں گے۔\"\nاور ان پر عذاب میں سے صرف عذاب کے لوٹ آنے کا خوف باقی رہے گا۔ پس عذاب کی یہ مقدار ان پر دائمی رہے گی، اور وہ خوف ہے، جو نفسیاتی عذاب ہے نہ کہ حسی۔ اور وہ اوقات میں اس سے غافل بھی ہو جاتے ہیں۔ پس ان کی نعمت حسی عذاب سے راحت ہے، اس چیز کے ذریعے جو اللہ ان کے دلوں میں ڈال دے گا کہ وہ وسیع رحمت والا ہے۔ اللہ تعالیٰ فرماتا ہے:\n> الْيَوْمَ نَنْساكُمْ كَما نَسِيتُمْ\n> \"آج ہم تمہیں بھلا دیں گے جیسا کہ تم نے (ہمیں) بھلا دیا تھا۔\"\nاور اسی حقیقت سے وہ کہتے ہیں: \"ہم بھول گئے،\" جب وہ درد محسوس نہیں کرتے۔ اور اسی طرح اس کا قول:\n> نَسُوا الله فَنَسِيَهُمْ\n> \"انہوں نے اللہ کو بھلا دیا تو اللہ نے انہیں بھلا دیا۔\"\nاور اسی طرح اس کا قول:\n> وكَذلِكَ الْيَوْمَ تُنْسى‏\n> \"اور اسی طرح آج تم بھلا دیے جاؤ گے۔\"\nیعنی تمہیں جہنم میں چھوڑ دیا جائے گا، کیونکہ نسیان (النسيان) ترک (چھوڑ دینا) ہے، اور ہمزہ کے ساتھ (نَسَأَ) تاخیر (پیچھے کرنا) ہے۔\n\n### [اہل دوزخ (أهل النار)]\n\nپس اہل دوزخ کا نعمت میں حصہ عذاب کا واقع نہ ہونا ہے، اور عذاب میں ان کا حصہ اس کے واقع ہونے کا توقع کرنا ہے۔ کیونکہ انہیں اللہ کی طرف سے خبروں کے ذریعے کوئی امان نہیں ہے۔ اور وہ توقع کے خوف سے اوقات میں محجوب (پردہ میں) ہو جاتے ہیں۔ پس ایک وقت وہ دس ہزار سال تک اس سے محجوب رہتے ہیں، اور ایک وقت دو ہزار سال، اور ایک وقت چھ ہزار سال۔ اور وہ اس مذکورہ مقدار سے باہر نہیں نکلیں گے جب بھی یہ مقدار ان کے لیے ضروری ہو گی۔ اور جب اللہ اپنے اسم الرحمن (الرحمن) سے انہیں نعمت دینا چاہے گا، تو وہ اس وقت اپنی حالت پر اور اس عذاب سے نکلنے پر نظر کریں گے جس میں وہ تھے، پس وہ اس نظر کی مقدار سے نعمت پائیں گے۔ پس ایک وقت یہ نظر ان کے لیے ایک ہزار سال تک رہے گی، اور ایک وقت نو ہزار سال، اور ایک وقت پانچ ہزار سال۔ پس یہ بڑھتا اور گھٹتا رہے گا۔ اور ان کی یہ حالت جہنم میں ہمیشہ رہے گی، کیونکہ وہ اس کے اہل ہیں۔ اور یہ سب کچھ جو ہم نے ذکر کیا، علم عیسوی (العلم العيسوى) میں سے ہے جو مقام محمدی (المقام المحمدي) سے وراثت میں ملا ہے۔\n> والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n> \"اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔\"",
    "fa": "باب بیستم در علم عیسوی، و اینکه از کجا آمده و به کجا ختم می‌شود، و چگونگی آن، و آیا به طول عالم تعلق دارد یا به عرض آن یا به هر دو.\n\nعلم عیسی آن است که\nخلق قدرش را ندانستند\nآنکه زمین قبرش بود،\nبا آن زنده می‌شد\nپس نفخ را مقاومت کرد، آنکه\nدر آن غایب شد و امرش شأن لاهوتش بود\nکه در غیب، صهر (آمیخته) او بود\nاو روحی است که تمثل یافته\nخداوند سرّش را آشکار کرد\nاز غیبِ حضرتی آمد\nکه خداوند ماهش را محو کرده بود\nپس از آنکه روح بود، خلق شد و او را فریب داد\nو امرش در او به پایان رسید\nپس او را بخشید و سرّش را داد\nهر که مانند او باشد،\nخداوند اجرش را بزرگ گردانیده است.\n\n### [در علم حروف]\n\nبدان، خداوند تو را یاری کند، که علم عیسوی همان علم حروف است. به همین دلیل به او نفخ (دمیدن) داده شد، که همان هوای خارج شده از حفره قلب است که روح حیات است. هنگامی که هوا در مسیر خروجش به دهان بدن قطع می‌شود، محل‌های قطع شدن آن حروف نامیده می‌شوند. پس اعیان (ذوات) حروف آشکار شدند. هنگامی که حروف با هم ترکیب شدند، حیات حسی در معانی ظاهر شد. این اولین چیزی بود که از حضرة الهی برای عالم آشکار شد. اعیان در حالت عدم خود هیچ نسبتی جز شنیدن (السمع) نداشتند. پس اعیان در ذات خود در حالت عدم، مستعد پذیرش امر الهی بودند، هنگامی که امر به وجود بر آن‌ها وارد می‌شد. پس هنگامی که خداوند اراده وجود آن‌ها را کرد، به آن‌ها گفت: «کن» (باش)، پس تکوّن یافتند و در اعیان خود ظاهر شدند. بنابراین، کلام الهی اولین چیزی بود که اعیان از حق (الله) تعالی با کلامی که شایسته اوست، درک کردند. اولین کلمه‌ای که ترکیب شد، کلمه «کن» (باش) است، که از سه حرف کاف، واو و نون ترکیب شده است. و هر حرفی از سه حرف تشکیل شده است، پس نُه (۹) ظاهر شد که ریشه آن سه است، و این اولین اعداد فرد است. بسائط عدد با وجود نُه از «کن» به پایان رسید. پس با «کن»، عین معدود و عدد ظاهر شد. از اینجاست که اصل ترکیب مقدمات از سه است، اگرچه در ظاهر چهار باشد؛ زیرا واجد (یافت‌کننده) در دو مقدمه تکرار می‌شود، پس سه است. و کون (هستی) از فرد یافت شد، نه از واحد.\n\n### [در نفس رحمانی]\n\nحق (الحق) به ما شناساند که سبب حیات در صور مولدات، همان نفخ الهی است، در قول او: فَإِذا سَوَّيْتُهُ ونَفَخْتُ فِيهِ مِنْ رُوحِي (پس چون او را سامان دادم و از روح خود در او دمیدم). و این همان نفسی است که خداوند ایمان را با آن زنده کرد و آشکار ساخت.\n\nپیامبر (صلی الله علیه و سلم) فرمود: إِنَّ نَفْسَ الرَّحْمَنِ يَأْتِينِي مِنْ قِبَلِ الْيَمَنِ (نفس رحمان از سوی یمن به من می‌رسد).\n\nپس با آن نفس رحمانی، صورت ایمان در قلوب مؤمنان و صورت احکام مشروع زنده شد. به عیسی (علیه السلام) علم این نفخ الهی و نسبت آن داده شد. پس او در صورتی که در قبر بود یا در صورت پرنده‌ای که از گِل ساخته بود، می‌دمید، و آن صورت به اذن الهی که در آن نفخه و در آن هوا جاری بود، زنده برمی‌خاست. اگر سریان اذن الهی در آن نبود، هرگز در هیچ صورتی حیاتی حاصل نمی‌شد. پس علم عیسوی از نفس رحمان به عیسی آمد. او مردگان را با نفخ خود زنده می‌کرد (علیه السلام). و انتهای آن به صور دمیده شده می‌رسید، و آن همان بهره‌ای است که هر موجودی از حق (الله) دارد و با آن به او می‌رسد، هنگامی که همه امور به سوی او بازگردند.\n\n### [سرّ الهی که در انسان است]\n\nو هنگامی که انسان در معراج خود به سوی پروردگارش تحلیل رود و هر کونی در مسیرش آنچه را که مناسب اوست از او بگیرد، جز این سرّ که از جانب حق (الله) نزد اوست، باقی نمی‌ماند. پس او را جز به واسطه آن نمی‌بیند و کلام او را جز به واسطه آن نمی‌شنود؛ زیرا او متعالی و مقدس است از اینکه جز به واسطه آن درک شود. و هنگامی که شخص از این مشهد بازگردد و صورتش که در عروجش تحلیل رفته بود، دوباره ترکیب شود، عالم هر آنچه را که از او گرفته بود و مناسبش بود، به او باز می‌گرداند؛ زیرا هر عالمی از جنس خود تجاوز نمی‌کند. پس همه بر این سرّ الهی جمع می‌شوند و آن را در بر می‌گیرند. و به واسطه آن، صورت، خداوند را به حمد او تسبیح می‌گوید و پروردگارش را حمد می‌کند، زیرا جز او کسی او را حمد نمی‌کند. و اگر صورت، او را از حیث خود حمد می‌کرد نه از حیث این سرّ، فضل الهی و امتنان بر این صورت آشکار نمی‌شد. و حال آنکه امتنان او بر همه خلایق ثابت شده است. پس ثابت می‌شود که آنچه از مخلوق برای حق (الله) از تعظیم و ثنا بوده، تنها از آن سرّ الهی بوده است. پس در هر چیزی از روح اوست، و هیچ چیزی در او نیست. پس حق (الحق) همان است که خود را حمد کرده و خود را تسبیح گفته است. و هر خیر الهی که برای این صورت در هنگام آن تحمید و تسبیح حاصل شده، از باب منّت است، نه از باب استحقاق کونی. اگر حق (الحق) برای او استحقاقی قرار داده، از آن جهت است که آن را بر خود واجب کرده است. پس کلمات از حروف هستند و حروف از هوا و هوا از نفس رحمانی. و به واسطه اسماء، آثار در اکوان (هستی‌ها) ظاهر می‌شوند و علم عیسوی به آن‌ها ختم می‌شود. سپس انسان با این کلمات، حضرة رحمانی را وادار می‌کند که از نفس خود به او چیزی عطا کند که حیات آنچه را که در آن با آن کلمات سؤال می‌کند، برپا دارد. پس امر به صورت دوری و دائمی در می‌آید.\n\n### [عیسی روح الله: و روح ذاتاً حیات دارد]\n\nو بدان که حیات ارواح، حیات ذاتی است. به همین دلیل هر صاحب روحی به واسطه روح خود زنده است. و سامری هنگامی که جبرئیل را دید و دانست که روح او عین ذات اوست و حیاتش ذاتی است، و اینکه بر هیچ مکانی قدم نمی‌گذارد مگر اینکه آن مکان به مباشرت آن صورت که او را تمثل می‌بخشد، زنده می‌شود، این را دانست. پس یک مشت از اثر او گرفت، و این همان قول خداوند است که از او خبر داده که گفت: فَقَبَضْتُ قَبْضَةً مِنْ أَثَرِ الرَّسُولِ (پس مشتی از اثر رسول گرفتم). هنگامی که گوساله را ساخت و صورت آن را پرداخت، آن مشت را در آن انداخت، پس گوساله به صدا درآمد. و چون عیسی (علیه السلام) روح بود، همان‌طور که خداوند او را نامید و همان‌طور که جبرئیل او را به صورت انسانی ثابت آفرید (در حالی که جبرئیل در صورت اعرابی غیر ثابت آفریده شد)، مردگان را تنها با نفخ زنده می‌کرد. سپس خداوند او را با روح القدس تأیید کرد. پس او روحی است که با روحی پاک از آلودگی‌های اکوان (هستی‌ها) تأیید شده است. و اصل در همه این‌ها، حیّ ازلی (الحی الأزلی) است که عین حیات ابدی است. و تنها چیزی که دو طرف، یعنی ازل و ابد را متمایز می‌کند، وجود عالم و حدوث آن است. و این علم همان است که به طول عالم تعلق دارد، یعنی عالم روحانی که عالم معانی و امر است، و به عرض عالم تعلق دارد، که عالم خلق و طبیعت و اجسام است. و همه از آنِ حق (الله) است: أَلا لَهُ الْخَلْقُ وَالْأَمْرُ (آگاه باشید که خلق و امر از آن اوست). قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي (بگو: روح از امر پروردگار من است). تَبارَكَ اللَّهُ رَبُّ الْعالَمِينَ (بزرگ است خدا، پروردگار جهانیان). و این همان علم حسین بن منصور (رحمه الله) بود. پس اگر شنیدی که یکی از اهل طریقت ما در مورد حروف سخن می‌گوید و می‌گوید: «طول حرف فلان این مقدار ذراع یا وجب است، یا عرض آن این مقدار است»، مانند حلاج و دیگران، او از «طول» فعل آن حرف را در عالم ارواح اراده می‌کند و از «عرض» فعل آن را در عالم اجسام، با آن مقدار ذکر شده که آن را با آن متمایز می‌کند. و این اصطلاح از وضع حلاج است.\n\n### [کن - علم عیسی - رحمت فراگیر]\n\nپس هر محققی که حقیقت «کن» (باش) را بداند، علم علوی را دانسته است. و هر کس با همت خود چیزی از کائنات را ایجاد کند، از این علم نیست. و چون نُه (۹) در حقیقت این سه حرف ظاهر شد، نُه فلک از معدودات از آن ظاهر شد. و با حرکات مجموع این نُه فلک و سیر کواکب آن‌ها، دنیا و آنچه در آن است، به وجود آمد، همان‌طور که با حرکات آن‌ها نیز خراب می‌شود. و با حرکت بالاترینِ این نُه فلک، بهشت با آنچه در آن است، به وجود آمد. و هنگام حرکت آن بالاترین، تمام آنچه در بهشت است، تکوّن می‌یابد. و با حرکت دومی که پس از بالاترین است، آتش (جهنم) با آنچه در آن است، و قیامت و بعث و حشر و نشر به وجود آمد. و به واسطه آنچه ذکر کردیم، دنیا آمیخته‌ای بود از نعمت آمیخته با عذاب. و به واسطه آنچه ذکر کردیم، بهشت تماماً نعمت است و آتش تماماً عذاب، و آن آمیختگی در اهل آن‌ها از بین رفت. پس نشأه آخرت، آمیختگی نشأه دنیا را نمی‌پذیرد. و این همان فرقان (جدایی) بین نشأه دنیا و آخرت است. مگر اینکه نشأه آتش، یعنی اهل آن، هنگامی که غضب الهی و مدت آن در آن‌ها به پایان رسد و به رحمتی که بر آن سبقت گرفته بود، بپیوندد، حکم رحمت در آن‌ها جاری می‌شود. و صورت آن‌ها تغییر نمی‌کند، و اگر تغییر کند، عذاب می‌بینند. پس ابتدا به اذن حق (الله) و تولیت او، حرکت فلک دوم از بالا بر آن‌ها حکم می‌کند، به واسطه عذابی که در هر محل قابل عذاب در آن‌ها ظاهر می‌شود. و تنها گفتیم «در هر محل قابل عذاب» به خاطر کسانی که در آن هستند و عذاب را نمی‌پذیرند. پس هنگامی که مدت آن به پایان رسد، که چهل و پنج هزار سال است، در این مدت عذابی بر اهل آن خواهد بود که در آن عذابی پیوسته و بدون سستی می‌بینند، به مدت بیست و سه هزار سال. سپس رحمان بر آن‌ها خوابی می‌فرستد که در آن از احساس غایب می‌شوند، و این همان قول خداوند است: لا يَمُوتُ فِيها وَلا يَحْيى‏ (در آن نمی‌میرد و زنده نمی‌شود). و قول پیامبر (علیه السلام) در مورد اهل آتش که اهل آن هستند: لا يَمُوتُونَ فِيها وَلا يَحْيَوْنَ (در آن نمی‌میرند و زنده نمی‌شوند).\n\nمنظور او حال آن‌ها در این اوقات است که از احساس خود غایب می‌شوند، مانند کسی که در دنیا از شدت جزع و نیروی آلام مفرط، غش می‌کند. پس نوزده هزار سال به همین حال می‌مانند. سپس از غشوه خود به هوش می‌آیند، در حالی که خداوند پوست‌هایشان را به پوست‌های دیگری تبدیل کرده است. پس پانزده هزار سال در آن عذاب می‌بینند. سپس غش می‌کنند و یازده هزار سال در غشوه خود می‌مانند. سپس به هوش می‌آیند، در حالی که خداوند پوست‌هایشان را جُلُوداً غَيْرَها (پوست‌های دیگری) تبدیل کرده است لِيَذُوقُوا الْعَذابَ (تا عذاب را بچشند). پس عذاب دردناک را هفت هزار سال می‌یابند. سپس سه هزار سال غش می‌کنند. سپس به هوش می‌آیند، و خداوند به آن‌ها لذت و راحتی روزی می‌دهد، مانند کسی که بر اثر خستگی می‌خوابد و بیدار می‌شود. و این از رحمت اوست که بر غضبش سبقت گرفته و وَسِعَتْ كُلَّ شَيْ‏ءٍ (همه چیز را فرا گرفته است). پس در آن هنگام، حکم تأبید (جاودانگی) از اسم واسع (الواسع) که با آن همه چیز را رَحْمَةً وَعِلْماً (از روی رحمت و علم) فرا گرفته است، بر آن‌ها جاری می‌شود. پس دردی نمی‌یابند و این برایشان دوام می‌یابد و آن را غنیمت می‌شمارند و می‌گویند: «فراموش کردیم، پس سؤال نمی‌کنیم، از ترس اینکه با نفوس خود یادآوری کنیم.» و خداوند به ما گفته است: اخْسَؤُا فِيها وَلا تُكَلِّمُونِ (دور شوید در آن و با من سخن نگویید). پس ساکت می‌شوند و هُمْ فِيهِ مُبْلِسُونَ (و آن‌ها در آن ناامیدند). و از عذاب بر آن‌ها باقی نمی‌ماند مگر ترس از بازگشت عذاب بر آن‌ها. پس این مقدار از عذاب است که بر آن‌ها جاودانه می‌شود، و آن ترس است، که عذابی نفسی است نه حسی. و ممکن است در اوقاتی از آن غافل شوند. پس نعمت آن‌ها، آسایش از عذاب حسی است، به واسطه آنچه خداوند در قلوبشان قرار می‌دهد که او صاحب رحمت واسعه است. خداوند متعال می‌فرماید: الْيَوْمَ نَنْساكُمْ كَما نَسِيتُمْ (امروز شما را فراموش می‌کنیم، همان‌طور که شما [ما را] فراموش کردید). و از این حقیقت است که می‌گویند: «فراموش کردیم»، هنگامی که آلام را احساس نمی‌کنند. و همچنین قول او: نَسُوا اللَّهَ فَنَسِيَهُمْ (خدا را فراموش کردند، پس او نیز آن‌ها را فراموش کرد). و كَذلِكَ الْيَوْمَ تُنْسى‏ (و همچنین امروز فراموش می‌شوی)، یعنی در جهنم رها می‌شوی، زیرا نسیان (فراموشی) به معنای ترک کردن است و با همزه (نَأْس) به معنای تأخیر است.\n\n### [اهل آتش]\n\nپس بهره اهل آتش از نعمت، عدم وقوع عذاب است، و بهره آن‌ها از عذاب، توقع وقوع آن است؛ زیرا از طریق اخبار الهی برای آن‌ها امانی نیست. و در اوقاتی از ترس توقع (بازگشت عذاب) محجوب می‌شوند. پس زمانی ده هزار سال از آن محجوب می‌شوند، و زمانی دو هزار سال، و زمانی شش هزار سال. و از این مقدار ذکر شده خارج نمی‌شوند، هرگاه که لازم باشد این مقدار زمان برای آن‌ها باشد. و هنگامی که خداوند بخواهد آن‌ها را از اسم رحمان خود متنعم سازد، به حال خود که در آن وقت هستند و خروجشان از عذابی که در آن بودند، نظر می‌کنند. پس به واسطه آن مقدار نظر متنعم می‌شوند. پس زمانی این نظر برای آن‌ها هزار سال دوام می‌یابد، و زمانی نُه هزار سال، و زمانی پنج هزار سال. پس زیاد و کم می‌شود. و حال آن‌ها همیشه در جهنم این‌گونه است، زیرا آن‌ها اهل آن هستند. و تمام آنچه ذکر کردیم، از علم عیسوی است که از مقام محمدی به ارث رسیده است. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}