{
  "id": 38,
  "title": {
    "ar": "الباب الثامن والثلاثون في معرفة من اطلع على المقام المحمدي ولم ينله من الأقطاب",
    "en": "Chapter Thirty-Eight: On knowing those among the Poles (الأقطاب) who viewed the Muhammadan Station (المقام المحمدي) but did not attain it.",
    "ur": "اٹھتیسواں باب: اس معرفت کے بیان میں کہ وہ کون ہے جو مقام محمدی (المقام المحمدي) پر مطلع ہوا اور اقطاب (الأقطاب) میں سے ہونے کے باوجود اسے حاصل نہ کر سکا",
    "fa": "باب سی و هشتم در معرفت کسی که بر مقام محمدی اطلاع یافت، ولی از اقطاب به آن نرسید"
  },
  "content": {
    "ar": "## (الباب الثامن والثلاثون في معرفة من اطلع على المقام المحمدي ولم ينله من الأقطاب)\n\n\n> بين النبوة والولاية فارق *** لكن لها الشرف الأتم الأعظم‏\n\n\n> يعنو لها الفلك المحيط بسره *** وكذلك القلم العلي الأفخم‏\n\n\n> إن النبوة والرسالة كانتا *** وقد انتهت ولها السبيل الأقوم‏\n\n\n> وأقام بيتا للولاية محكما *** في ذاته فله البقاء الأدوم‏\n\n\n> لا تطلبنه نهاية يسعى لها *** فيكون عند بلوغه يتهدم‏\n\n\n> صفة الدوام لذاته نفسية *** فهو الولي فقهره متحكم‏\n\n\n> يأوي إليه نبيه ورسوله *** والعالم الأعلى ومن هو أقدم‏\n\n\n### [الرسالة والنبوة والولاية]\n\n\nثبت أن رسول الله صلى الله عليه وسلم قال إن الرسالة والنبوة قد انقطعت فلا رسول بعدي ولا نبي‏\n\n\nالحديث بكماله فهذا الحديث من أشد ما جرعت الأولياء مرارته فإنه قاطع للوصلة بين الإنسان وبين عبوديته وإذا انقطعت الوصلة بين الإنسان وبين عبوديته من أكمل الوجوه انقطعت الوصلة بين الإنسان وبين الله فإن العبد على قدر ما يخرج به عن عبوديته ينقصه من تقريبه من سيده لأنه يزاحمه في أسمائه وأقل المزاحمة الاسمية فأبقى علينا اسم الولي وهو من أسمائه سبحانه وكان هذا الاسم قد نزعه من رسوله وخلع عليه وسماه بالعبد والرسول ولا يليق بالله أن يسمى بالرسول فهذا الاسم من خصائص العبودية التي لا تصح أن تكون للرب وسبب إطلاق هذا الاسم وجود الرسالة والرسالة قد انقطعت فارتفع حكم هذا الاسم بارتفاعها من حيث نسبتها بها من الله‏\n\n\n### [رسالة التبليغ والنقل‏]\n\n\nولما علم رسول الله صلى الله عليه وسلم أن في أمته من يجرع مثل هذا الكأس وعلم ما يطرأ عليهم في نفوسهم من الألم لذلك رحمهم فجعل لهم نصيبا ليكونوا بذلك عبيد العبيد فقال للصحابة ليبلغ الشاهد الغائب فأمرهم بالتبليغ كما أمره الله بالتبليغ لينطلق عليهم أسماء الرسل التي هي مخصوصة بالعبيد وقال صلى الله عليه وسلم رحم الله امرأ سمع مقالتي فوعاها فأداها كما سمعها\n\n\nيعني حرفا حرفا وهذا لا يكون إلا لمن بلغ الوحي من قرآن أو سنة بلفظه الذي جاء به وهذا لا يكون إلا لنقلة الوحي من المقرءين والمحدثين ليس للفقهاء ولا لمن نقل الحديث على المعنى كما يراه سفيان الثوري وغيره نصيب ولا حظ فيه فإن الناقل على المعنى إنما نقل إلينا فهمه في ذلك الحديث النبوي ومن نقل إلينا فهمه فإنما هو رسول نفسه ولا يحشر يوم القيامة فيمن بلغ الوحي كما سمعه وأدى الرسالة كما يحشر المقرئ والمحدث الناقل لفظ الرسول عينه في صف الرسل عليهم السلام فالصحابة إذا نقلوا الوحي على لفظه فهم رسل رسول الله صلى الله عليه وسلم والتابعون رسل الصحابة وهكذا الأمر جيلا بعد جيل إلى يوم القيامة فإن شئنا قلنا في المبلغ إلينا أنه رسول الله وإن شئنا أضفناه لمن بلغ عنه وإنما جوزنا حذف الوسائط لأن رسول الله كان يخبره جبريل عليه السلام وملك من الملائكة ولا نقول فيه رسول جبريل وإنما نقول فيه رسول الله كما قال الله تعالى مُحَمَّدٌ رَسُولُ الله والَّذِينَ مَعَهُ وقال عز وجل ما كانَ مُحَمَّدٌ أَبا أَحَدٍ من رِجالِكُمْ ولكِنْ رَسُولَ الله مع قوله نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ ومع هذا فما أضافه الله إلا إلى نفسه‏\n\n\n### [الولاية والعبودية]\n\n\nفهذا القدر بقي لهم من العبودية وهو خير عظيم امتن به عليهم ومهما لم ينقله الشخص بسنده متصلا غير منقطع فليس له هذا المقام ولا شم له رائحة وكان من الأولياء المزاحمين الحق في الاسم الولي فنقصه من عبوديته بقدر هذا الاسم فلهذا اسم المحدث بفتح الدال أولى به من اسم الولي فإن مقام الرسالة لا يناله أحد بعد رسول الله صلى الله عليه وسلم إلا بقدر ما بيناه فهو الذي أبقاه الحق تعالى علينا ومن هنا تعرف مقام شرف العبودية وشرف المحدثين نقلة الوحي بالرواية ولهذا اشتد علينا غلق هذا الباب وعلمنا إن الله قد طردنا من حال العبودية الاختصاصية التي كان ينبغي لنا أن نكون عليها وأما النبوة فقد بينا هالك فيما تقدم في باب معرفة الأفراد وهم أصحاب الركاب‏\n\n\n### [الصلاة المقسومة بين العبد والرب‏]\n\n\nثم إنه تعالى من باب طردنا من العبودة ومقامها\n\n\nقال تعالى قسمت الصلاة بيني وبين عبدي نصفين‏\n\n\nومن نحن حتى‏\nتقع القسمة بيننا وبينه وهو السيد الفاعل المحرك الذي يقولنا في قولنا إِيَّاكَ نَعْبُدُ وأمثال ذلك مما أضافه إلينا وقد علمنا أن نواصينا بيده في قيامنا وركوعنا وسجودنا وجلوسنا وفي نطقنا يقول العبد الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ يقول الله حمدني عبدي تفضلا منه فإنه من قوله بهذه اللفظة وما قدره حتى بقول السيد قال عبدي وقلت له هذا حجاب مسدل فينبغي للعبد أن يعرف أن لله مكرا خفيا في عباده وكل أحد يمكر به على قدر علمه بربه فيأخذ هذا التكريم الإلهي ابتداء من الله مدرجا في نعمة فإذا صلى وتلا قال الحمد لله يقولها حكاية من حيث ما هو مأمور بها لتصح عبوديته في صلاته ولا ينتظر الجواب ولا يقول ليجاب بل يشتغل بما كلفه سيده به من العمل حتى يكون ذلك الجواب والإنعام من السيد لا من كونه قال فإن القائل على الحقيقة خالق القول فيه فنسلم من هذا المكر وإن كان منزلة رفيعة ولكن بالنظر إلى من هو في غير هذه المنزلة ممن نزل عنها\n\n\n### [الإرث المحمدي الموصول‏]\n\n\nفما ورثنا من رسول الله صلى الله عليه وسلم من هذا المقام الذي أغلق بابه دوننا إلا ما ذكرناه من عناية الحق بمن كشف له عن ذلك ورزقه علم نقل الوحي بالرواية من كتاب وسنة فما أشرف مقام أهل الرواية من المقرءين والمحدثين جعلنا الله ممن اختص بنقله من قرآن وسنة فإن أهل القرآن هم أهل الله وخاصته والحديث مثل القرآن بالنص فإنه صلى الله عليه وسلم ما يَنْطِقُ عَنِ الْهَوى‏ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏ وممن تحقق بهذا المقام معنا أبو يزيد البسطامي كشف له منه بعد السؤال والتضرع قدر خرق الإبرة فأراد أن بضع قدمه فيه فاحترق فعلم أنه لا ينال ذوقا وهو كمال العبودة وقد حصل لنا منه صلى الله عليه وسلم شعرة وهذا كثير لمن عرف فما عند الخلق منه إلا ظله ولما أطلعني الله عليه لم يكن عن سؤال وإنما كان عن عناية من الله ثم إنه أيدني فيه بالأدب رزقا من لدنه وعناية من الله بي فلم يصدر مني هناك ما صدر من أبي يزيد بل اطلعت عليه وجاء الأمر بالرقي في سلمة فعلمت إن ذلك خطاب ابتلاء وأمر ابتلاء لا خطاب تشريف على أنه قد يكون بعض الابتلاء تشريفا فتوقفت وسألت الحجاب فعلم ما أردت فوضع الحجاب بيني وبين المقام وشكر لي ذلك فمنحني منه الشعرة التي ذكرناها اختصاصا إلهيا فشكرت الله على الاختصاص بتلك الشعرة غير طالب بالشكر الزيادة وكيف أطلب الزيادة من ذلك وأنا أسأل الحجاب الذي هو من كمال العبودية فسرت في العبودة وظهر سلطانها وحيل بيني وبين مرتبة السيادة لله الحمد على ذلك وكم طلبت إليها وما أجبت وهكذا إن شاء الله أكون في الآخرة عبدا محضا خالصا ولو ملكني جميع العالم ما ملكت منه إلا عبوديته خاصة حتى يقوم بذاتي جميع عبودية العالم‏\n\n\n### [ولي الله‏]\n\n\nوللناس في هذا مراتب فالذي ينبغي للعبد أن لا يزيد على هذا الاسم غيره فإن أطلق الله ألسنة الخلق عليه بأنه ولي الله ورأى أن الله قد أطلق عليه اسما أطلقه تعالى على نفسه فلا يسمعه ممن يسميه به إلا على أنه بمعنى المفعول لا بمعنى الفاعل حتى يشم فيه رائحة العبودية فإن بنية فعيل قد تكون بمعنى الفاعل وإنما قلنا هذا من أجل ما أمرنا أن نتخذه سبحانه وكيلا فيما هو له مما نحن مستخلفون فيه فإن في مثل هذا مكرا خفيا فتحفظ منه ويكفي من التنبيه الإلهي العاصم من المكر كونك مأمورا بذلك فامتثل أمره واتخذه وكيلا لا تدعى الملك فإن الله تولاك فإنه قال وهُوَ يَتَوَلَّى الصَّالِحِينَ واسم الصالح من خصائص العبودية ولهذا وصف محمد صلى الله عليه وسلم نفسه بالصلاح فإنه ادعى حالة لا تكون إلا للعبيد الكمل فمنهم من شهد له بها الحق عز وجل بشرى من الله فقال في عبده يحيى عليه السلام نَبِيًّا من الصَّالِحِينَ وقال في نبيه عيسى عليه السلام وكَهْلًا ومن الصَّالِحِينَ وقال في إبراهيم عليه السلام وإِنَّهُ في الْآخِرَةِ لَمِنَ الصَّالِحِينَ من أجل الثلاثة الأمور التي صدرت منه في الدنيا وهي قوله عن زوجته سارة إنها أخته بتأويل وقوله إِنِّي سَقِيمٌ اعتذارا وقوله بَلْ فَعَلَهُ كَبِيرُهُمْ إقامة حجة فبهذه الثلاثة يعتذر يوم القيامة للناس إذا سألوه أن يسأل ربه فتح باب الشفاعة فلهذا ذكر صلاحه في الآخرة إذ لم يؤاخذه بذلك كما قال الله تعالى لمحمد صلى الله عليه وسلم لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ وقال عَفَا الله عَنْكَ لِمَ أَذِنْتَ لَهُمْ فقدم البشرى قبل العتاب وهذه الآية عندنا بشرى خاصة ما فيها عتاب بل هو استفهام لمن أنصف وأعطى أهل العلم حقهم وأما سليمان وأمثاله عليهم السلام فأخبرنا الحق أنه قال وأَدْخِلْنِي بِرَحْمَتِكَ في عِبادِكَ الصَّالِحِينَ وإن كانوا صالحين في نفس الأمر عند الله فهم بين سائل في الصلاح ومشهود له به مع كونه نعتا عبوديا لا يليق بالله فما ظنك بالاسم الولي الذي قد تسمى الله به بمعنى الفاعل فينبغي أن لا ينطلق ذلك‏\nالاسم على العبد وإن أطلقه الحق عليه فذلك إليه تعالى ويلزم الإنسان عبوديته وما يختص به من الأسماء التي لم تنطلق قط على الحق لفظا فيما أنزله على نبيه صلى الله عليه وسلم فلما أنزل الله تعالى على عبده محمد صلى الله عليه وسلم هذه الآية ليعرف الناس بها فكان الله حكى عن نبيه صلى الله عليه وسلم ما لا بد له أن يقوله ويتلفظ به فجعله تعالى قرآنا يتلى إذ كان ذلك من خصائص العبيد في نفس الأمر فقال تعالى إِنَّ وَلِيِّيَ الله الَّذِي نَزَّلَ الْكِتابَ وهُوَ يَتَوَلَّى الصَّالِحِينَ فشهد له بالصلاح إذا كان الحق حاكيا في هذه الآية وإن كان آمرا فيكون من المشهودين لهم بالصلاح فعرفنا إن الله تولاه وأخبرنا أن الله يتولى الصالحين فشهد لنفسه بالصلاح بالوجه الذي ذكرناه ولم ينقل ذلك عن غيره بل نقل ما يقاربه من قول عيسى عليه السلام إِنِّي عَبْدُ الله آتانِيَ الْكِتابَ وجَعَلَنِي نَبِيًّا وجَعَلَنِي مُبارَكاً أَيْنَ ما كُنْتُ وأَوْصانِي بِالصَّلاةِ والزَّكاةِ ما دُمْتُ حَيًّا وبَرًّا بِوالِدَتِي ولَمْ يَجْعَلْنِي جَبَّاراً شَقِيًّا والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ ويَوْمَ أَمُوتُ ويَوْمَ أُبْعَثُ حَيًّا يقول الله تعالى تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ أي فكذلك أنت فكان من فضله نيل مثل هذا المقام فاحفظ يا ولي نفسك في التخلق بأسماء الله الحسنى فإن العلماء لم يختلفوا في التخلق بها فإذا وفقت للتخلق بها فلا تغب في ذلك عن شهود آثارها فيك ولتكن فيها ومعها بحكم النيابة عنها فتكون مثل اسم الرسول لا تشارك الحق في إطلاق اسم عليك من أسمائه بذلك المعنى وألزم الأدب وقُلْ رَبِّ زِدْنِي عِلْماً والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "**Chapter Thirty-Eight: Concerning the Knowledge of Those Among the Poles [Aqtāb] Who Were Shown the Muhammadan Station but Did Not Attain It**\n\nBetween Prophethood and Sainthood [Wilāya] is a distinction,\nYet [Sainthood] possesses the most complete and greatest honor.\n\nThe encompassing Sphere [al-Falak al-Muhīt] bows to its secret,\nAs does the Exalted and Glorious Pen [al-Qalam al-‘Alī].\n\nIndeed, Prophethood [Nubuwwa] and Messengership [Risāla] existed,\nAnd they have ended, though the straightest path is theirs.\n\nAnd He established a firm house for Sainthood\nIn His Essence [Dhāt], so for it is the most enduring Subsistence [Baqā’].\n\nDo not seek for it an end toward which it strives,\nLest it be destroyed upon reaching its goal.\n\nThe attribute of permanence is essential to its Essence [Dhāt],\nSo He is the Protector (al-Walī), and His overpowering dominance is absolute.\n\nHis Prophet and His Messenger take refuge in it,\nAs do the Highest World [al-‘Ālam al-A‘lā] and whoever is more ancient.\n\n### [Messengership, Prophethood, and Sainthood]\n\nIt is established that the Messenger of Allah (peace and blessings be upon him) said: \"Indeed, Messengership [Risāla] and Prophethood [Nubuwwa] have ceased, so there is no Messenger after me and no Prophet.\" (The complete Hadith). This Hadith is among the bitterest draughts that the saints [Awliyā’] have swallowed, for it severs the connection between the human being and his servitude [‘Ubūdiyya]. If the connection between the human being and his servitude is severed in its most complete aspects, the connection between the human being and Allah is severed. For the servant, to the degree that he departs from his servitude, he is diminished in his proximity to his Lord, because he competes with Him in His Names [Asmā’], even if it is the least nominal competition. Thus, He preserved for us the Name *al-Walī* (the Protector/Saint), which is one of His Names (glory be to Him). This Name He had stripped from His Messenger, clothing him instead and naming him the Servant (*al-‘Abd*) and the Messenger (*al-Rasūl*). It is not fitting for Allah to be named *al-Rasūl* (the Messenger); this Name is among the specific characteristics of servitude that cannot be attributed to the Lord. The reason for applying this Name [Messenger] is the existence of Messengership [Risāla], and Messengership has ceased. Therefore, the ruling of this Name is lifted by its cessation, in terms of its relation to Allah through him.\n\n### [The Messengership of Conveyance and Transmission]\n\nWhen the Messenger of Allah (peace and blessings be upon him) knew that there would be those in his Community who would swallow such a cup [of bitterness], and he knew the pain that would afflict their souls because of it, he showed them mercy. He established a share for them so that they might thereby be servants of the servants. He said to the Companions: \"Let the present convey [the message] to the absent.\" Thus, he commanded them to convey [the message] (al-Tablīgh), just as Allah commanded him to convey it, so that the names of the Messengers, which are specific to the servants, might be applied to them. He (peace and blessings be upon him) also said: \"May Allah have mercy upon a man who hears my saying, comprehends it, and conveys it exactly as he heard it.\"\n\nMeaning, word for word. This applies only to those who convey the Revelation [al-Wahy], whether Quran or Sunna, with the exact wording in which it came. This applies only to the transmitters of the Revelation—the reciters [al-Muqri’īn] and the traditionists [al-Muhaddithīn]—not to the jurists [al-Fuqahā’] or those who transmit the Hadith according to its meaning, as Sufyan al-Thawri and others saw fit. For the one who transmits according to the meaning only conveys to us his own understanding of that Prophetic Hadith. And whoever conveys his own understanding is merely a messenger of himself. He will not be gathered on the Day of Resurrection among those who conveyed the Revelation exactly as they heard it and delivered the message, as the reciter and the traditionist who transmit the exact wording of the Messenger will be gathered in the rank of the Messengers (peace be upon them). Therefore, if the Companions transmit the Revelation with its exact wording, they are the messengers of the Messenger of Allah (peace and blessings be upon him). The Successors are the messengers of the Companions, and so the matter continues generation after generation until the Day of Resurrection. If we wish, we may say of the one who conveys it to us that he is a Messenger of Allah; and if we wish, we may attribute him to the one who conveyed it from him. We permit the omission of the intermediaries because the Messenger of Allah was informed by Gabriel (peace be upon him), who is an angel, yet we do not say he is the messenger of Gabriel. Rather, we say he is the Messenger of Allah, as Allah Almighty said: <<مُحَمَّدٌ رَسُولُ الله والَّذِينَ مَعَهُ>> (Muhammad is the Messenger of Allah, and those who are with him), and He Almighty said: <<ما كانَ مُحَمَّدٌ أَبا أَحَدٍ من رِجالِكُمْ ولكِنْ رَسُولَ الله>> (Muhammad is not the father of any man among you, but he is the Messenger of Allah), despite His saying: <<نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ>> (The Trustworthy Spirit [Gabriel] brought it down upon your heart). Despite this, Allah attributed him only to Himself.\n\n### [Sainthood and Servitude]\n\nThis much remains for them of servitude [‘Ubūdiyya], and it is a great good that He bestowed upon them. However, if a person does not transmit it with an unbroken chain of transmission [Sanad], he does not possess this station, nor does he smell its fragrance. He would be among the saints [Awliyā’] who compete with the Real [al-Haqq] in the Name *al-Walī*, and thus his servitude is diminished by the measure of this Name. For this reason, the name *al-Muhaddath* (the Inspired) is more appropriate for him than the name *al-Walī*. For the station of Messengership is not attained by anyone after the Messenger of Allah (peace and blessings be upon him) except to the extent we have explained, which is what the Real (Exalted is He) preserved for us. From this, you recognize the honor of the station of servitude and the honor of the traditionists [al-Muhaddithīn], the transmitters of the Revelation through narration [Riwāya]. This is why the closing of this door was so severe for us, and we knew that Allah had expelled us from the state of specialized servitude [al-‘Ubūdiyya al-Ikhtisāsiyya] that we ought to have been in. As for Prophethood [Nubuwwa], we have already explained its destruction in the preceding chapter concerning the knowledge of the Individuals [al-Afrād], who are the Companions of the Mounts.\n\n### [The Prayer Divided Between the Servant and the Lord]\n\nFurthermore, it is from the perspective of expelling us from servitude and its station that He Almighty said: \"I have divided the Prayer between Myself and My servant into two halves.\"\n\nWho are we that a division should occur between us and Him, when He is the Lord, the Doer, the Mover, who makes us speak when we say <<إِيَّاكَ نَعْبُدُ>> (You alone we worship) and similar phrases that He attributes to us? We know that our forelocks are in His Hand in our standing, bowing, prostrating, and sitting, and in our speech. The servant says: <<الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ>> (Praise be to Allah, Lord of the Worlds). Allah says: \"My servant has praised Me.\" This is a favor from Him, for it is from His saying [that the servant speaks] with this phrase. What is the servant's worth that the Lord should say: \"My servant said,\" and I said to him? This is a drawn curtain [Hījāb]. The servant must know that Allah has a subtle deception [Makr Khafī] concerning His servants, and everyone is deceived by Him according to his knowledge of his Lord. So, he takes this Divine honoring as a beginning from Allah, gradually bestowed as a grace. When he prays and recites, he says *Al-Hamdu Lillāh* (Praise be to Allah), saying it as a narration, in the sense that he is commanded to do so, so that his servitude in his prayer may be valid. He does not wait for the answer, nor does he say it in order to be answered. Rather, he occupies himself with the task assigned to him by his Lord, so that the answer and the favor come from the Lord, not because the servant spoke. For the Speaker in reality is the Creator of the speech within him. Thus, we are safe from this deception [Makr], even though it is a lofty station, but only when viewed in relation to those who are not in this station, those who have fallen below it.\n\n### [The Connected Muhammadan Inheritance]\n\nTherefore, what we inherited from the Messenger of Allah (peace and blessings be upon him) concerning this station, whose door was closed before us, is only what we mentioned: the care of the Real [al-Haqq] for those to whom He unveiled it and granted them the knowledge of transmitting the Revelation through narration [Riwāya], from the Book and the Sunna. How noble is the station of the People of Narration [Ahl al-Riwāya], the reciters and the traditionists! May Allah make us among those specialized in transmitting it from the Quran and the Sunna. For the People of the Quran are the People of Allah and His elect. And the Hadith is like the Quran by explicit text, for he (peace and blessings be upon him) <<ما يَنْطِقُ عَنِ الْهَوى‏ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏>> (does not speak out of [personal] desire. It is nothing but a Revelation [Wahy] revealed). Among those who realized this station with us is Abu Yazid al-Bistami. After asking and supplicating, a measure the size of a needle's eye was unveiled to him from it. He wished to place his foot in it, but he was burned. He realized that he could not attain the taste [Dhāwq] of it, which is the perfection of servitude. We, however, received a single hair from him (peace and blessings be upon him), and this is much for one who knows. For what the creatures possess of it is only its shadow. When Allah informed me of it, it was not through asking, but through Divine care [‘Ināya] from Allah. Then, He supported me in it with proper conduct [Adab], a provision from His Presence and a care from Allah toward me. Thus, what issued from me there was not what issued from Abu Yazid. Rather, I was informed of it, and the command came to ascend its ladder. I knew that this was a discourse of trial [Khitāb Ibtilā’] and an order of trial, not a discourse of honoring, even though some trials may be an honoring. So I paused and requested the veil [Hījāb]. He knew what I intended, so He placed the veil between me and the station, and He thanked me for that. He then granted me the hair we mentioned, as a Divine specialization [Ikhtisās]. I thanked Allah for the specialization with that hair, without seeking an increase through the thanks. How could I seek an increase from that when I was requesting the veil, which is the perfection of servitude? So I proceeded in servitude, and its sovereignty appeared, and I was prevented from the rank of Lordship [Siyāda]. Praise be to Allah for that. How often I sought it, and I was not answered. Thus, God willing, I shall be in the Hereafter a pure, unadulterated servant. Even if I were given dominion over the entire world, I would possess nothing of it except my servitude alone, until the entire servitude of the world stands within my Essence [Dhāt].\n\n### [The Protector of God]\n\nPeople have ranks in this matter. What is proper for the servant is not to add any other name to this name [Servant]. If Allah allows the tongues of creation to call him *Walī Allāh* (the Protector/Saint of Allah), and he sees that Allah has applied to him a Name that He (Exalted is He) applied to Himself, he should not hear it from those who call him by it except in the sense of the passive participle (the protected/governed) and not in the sense of the active participle (the protector/governor), so that he may perceive the fragrance of servitude in it. For the pattern *fa‘īl* may sometimes be in the sense of the active participle. We say this because we are commanded to take Him (glory be to Him) as a Trustee [Wakīl] in what belongs to Him, over which we are appointed as vicegerents. For in such a matter there is a subtle deception [Makr Khafī], so guard yourself against it. The Divine warning that protects against deception is sufficient in the fact that you are commanded to do so. Therefore, obey His command and take Him as a Trustee; do not claim ownership, for Allah takes charge of you, as He said: <<وَهُوَ يَتَوَلَّى الصَّالِحِينَ>> (And He takes charge of the righteous [al-Sālihīn]). The name *al-Sālih* (the righteous) is one of the specific characteristics of servitude. For this reason, Muhammad (peace and blessings be upon him) described himself with righteousness [Salāh], for he claimed a state that belongs only to the perfect servants [al-‘Abīd al-Kummal]. Among them are those for whom the Real (Exalted and Mighty is He) bore witness to this state as glad tidings from Allah. He said concerning His servant John (peace be upon him): <<نَبِيًّا من الصَّالِحِينَ>> (A Prophet, among the righteous). And He said concerning His Prophet Jesus (peace be upon him): <<وكَهْلًا ومن الصَّالِحِينَ>> (And mature, and among the righteous). And He said concerning Abraham (peace be upon him): <<وإِنَّهُ في الْآخِرَةِ لَمِنَ الصَّالِحِينَ>> (And indeed, in the Hereafter he will be among the righteous), because of the three matters that issued from him in this world: his saying concerning his wife Sarah that she was his sister (by interpretation), his saying <<إِنِّي سَقِيمٌ>> (Indeed, I am sick) as an excuse, and his saying <<بَلْ فَعَلَهُ كَبِيرُهُمْ>> (Rather, their chief did it) as an establishment of proof. Because of these three, he will apologize to the people on the Day of Resurrection when they ask him to request his Lord to open the door of intercession. For this reason, his righteousness in the Hereafter was mentioned, since He did not hold him accountable for those matters, just as Allah Almighty said to Muhammad (peace and blessings be upon him): <<لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ>> (That Allah may forgive you what preceded of your sin and what will follow). And He said: <<عَفَا الله عَنْكَ لِمَ أَذِنْتَ لَهُمْ>> (May Allah pardon you, why did you give them permission?). He presented the glad tidings before the reproach. This verse, in our view, is a specific glad tiding; there is no reproach in it, but rather an inquiry for the one who is fair and gives the people of knowledge their due. As for Solomon and others (peace be upon them), the Real informed us that he said: <<وأَدْخِلْنِي بِرَحْمَتِكَ في عِبادِكَ الصَّالِحِينَ>> (And admit me by Your mercy among Your righteous servants). Even though they were righteous in reality in the sight of Allah, they are between one who asks for righteousness and one for whom it is witnessed, despite it being an attribute of servitude that is unfitting for Allah. What then do you think of the Name *al-Walī* (the Protector/Saint), which Allah has named Himself with in the sense of the active participle? Therefore, that Name should not be applied to the servant. If the Real applies it to him, that is up to Him (Exalted is He). The human being is bound by his servitude and the names specific to him that were never applied to the Real in wording in what He revealed to His Prophet (peace and blessings be upon him). When Allah Almighty revealed this verse to His servant Muhammad (peace and blessings be upon him) so that people might know by it, Allah was relating what His Prophet (peace and blessings be upon him) necessarily had to say and utter, so He (Exalted is He) made it a recited Quran, since that was among the specific characteristics of the servants in reality. Thus, He Almighty said: <<إِنَّ وَلِيِّيَ الله الَّذِي نَزَّلَ الْكِتابَ وهُوَ يَتَوَلَّى الصَّالِحِينَ>> (Indeed, my Protector [Walī] is Allah, who sent down the Book, and He takes charge of the righteous [al-Sālihīn]). He bore witness to his righteousness if the Real is relating in this verse. And if He is commanding, then he is among those for whom righteousness is witnessed. Thus, we knew that Allah took charge of him, and He informed us that Allah takes charge of the righteous. So, he bore witness to his own righteousness in the manner we mentioned, and this was not transmitted from anyone else. Rather, what was transmitted was similar to it, such as the saying of Jesus (peace be upon him): <<إِنِّي عَبْدُ الله آتانِيَ الْكِتابَ وجَعَلَنِي نَبِيًّا وجَعَلَنِي مُبارَكاً أَيْنَ ما كُنْتُ وأَوْصانِي بِالصَّلاةِ والزَّكاةِ ما دُمْتُ حَيًّا وبَرًّا بِوالِدَتِي ولَمْ يَجْعَلْنِي جَبَّاراً شَقِيًّا والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ ويَوْمَ أَمُوتُ ويَوْمَ أُبْعَثُ حَيًّا>> (Indeed, I am the servant of Allah. He has given me the Scripture and made me a Prophet. And He has made me blessed wherever I am and enjoined upon me prayer and zakat as long as I remain alive, and [made me] dutiful to my mother, and did not make me a wretched tyrant. And peace is upon me the day I was born and the day I die and the day I am raised alive). Allah Almighty says: <<تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ>> (Those Messengers—We favored some of them over others). Meaning, likewise are you. Thus, part of his favor was attaining a station such as this. So guard yourself, O saint [Walī], in adopting the character of the Beautiful Names of Allah [al-Asmā’ al-Husnā]. For the scholars have not differed concerning adopting their character. If you are granted success in adopting their character, do not be absent from witnessing their effects within you. And be in them and with them by the ruling of deputyship [Niyāba] for them. Thus, you will be like the name *al-Rasūl* (the Messenger); you do not share with the Real [al-Haqq] the application of a Name upon you with that meaning. Adhere to proper conduct [Adab] and say: <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge). And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (says the Truth, and He guides to the way).",
    "ur": "## (اڑتیسواں باب: ان لوگوں کی معرفت کے بارے میں جنہیں مقام محمدی پر اطلاع ملی لیکن اقطاب میں سے کوئی اسے حاصل نہ کر سکا)\n\nنبوت اور ولایت کے درمیان فرق ہے، لیکن ولایت کے لیے سب سے کامل اور عظیم شرف ہے۔\nاس کے راز کے سامنے فلک محیط بھی جھکتا ہے، اور اسی طرح قلم اعلیٰ اور عظیم بھی۔\nبے شک نبوت اور رسالت موجود تھیں، اور وہ ختم ہو چکی ہیں، اور ان کے لیے سیدھا راستہ ہے۔\nاور اس (ولایت) نے اپنی ذات میں ولایت کے لیے ایک مضبوط گھر قائم کیا ہے، لہٰذا اس کے لیے دائمی (البقاء الأدوم) بقا ہے۔\nاس کے لیے ایسی انتہا مت تلاش کرو جس کی طرف سعی کی جائے، کیونکہ جب وہ اسے پا لے گا تو وہ منہدم ہو جائے گا۔\nدوام کی صفت اس کی ذات کے لیے نفسی ہے، پس وہ الولی (الولي) ہے اور اس کا قہر غالب ہے۔\nاس کی طرف اس کا نبی اور رسول پناہ لیتے ہیں، اور عالم بالا اور وہ جو سب سے قدیم ہے۔\n\n### [رسالت، نبوت اور ولایت]\n\nیہ ثابت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک رسالت اور نبوت منقطع ہو چکی ہے، پس میرے بعد نہ کوئی رسول ہے اور نہ کوئی نبی۔\"\n\nیہ حدیث اپنی تمام تر تفصیل کے ساتھ اولیاء (الأولياء) کے لیے سب سے زیادہ تلخ گھونٹ ہے، کیونکہ یہ انسان اور اس کی عبودیت کے درمیان تعلق کو کاٹ دیتی ہے۔ اور جب انسان اور اس کی عبودیت کے درمیان تعلق مکمل ترین وجوہ سے منقطع ہو جاتا ہے، تو انسان اور اللہ کے درمیان تعلق منقطع ہو جاتا ہے۔ کیونکہ بندہ جس قدر اپنی عبودیت سے باہر نکلتا ہے، اسی قدر اپنے آقا کے قرب سے محروم ہو جاتا ہے، کیونکہ وہ اس کے اسماء (اسمائے الٰہی) میں مزاحمت کرتا ہے، اور یہ کم سے کم اسمی مزاحمت ہے۔ پس اللہ نے ہم پر الولی (الولي) کا نام باقی رکھا، اور یہ اس کے سبحانہ و تعالیٰ کے اسماء میں سے ہے۔ اور یہ نام اللہ نے اپنے رسول سے نزع کر لیا تھا اور انہیں عبد (بندہ) اور رسول کا نام عطا کیا تھا۔ اور اللہ کے لیے یہ لائق نہیں کہ اسے رسول کہا جائے، کیونکہ یہ نام عبودیت کی خصوصیات میں سے ہے جو رب کے لیے صحیح نہیں ہو سکتی۔ اور اس نام کے اطلاق کا سبب رسالت کا وجود تھا، اور رسالت منقطع ہو چکی ہے، لہٰذا اس نام کا حکم اس کے انقطاع کے سبب سے مرتفع ہو گیا، اس نسبت کے لحاظ سے جو اس کی اللہ کے ساتھ تھی۔\n\n### [تبلیغ اور نقل کی رسالت]\n\nاور جب رسول اللہ صلی اللہ علیہ وسلم کو معلوم ہوا کہ ان کی امت میں ایسے لوگ ہوں گے جو اس قسم کا جام پیئیں گے، اور انہیں اس سے جو روحانی تکلیف پہنچے گی، آپ نے ان پر رحم فرمایا۔ پس آپ نے ان کے لیے ایک حصہ مقرر کیا تاکہ وہ اس کے ذریعے عبید العبید (بندوں کے بندے) بن سکیں۔ چنانچہ آپ نے صحابہ سے فرمایا: \"حاضر غائب کو پہنچا دے۔\" پس آپ نے انہیں تبلیغ کا حکم دیا، جیسا کہ اللہ نے آپ کو تبلیغ کا حکم دیا تھا، تاکہ ان پر رسولوں کے اسماء کا اطلاق ہو سکے جو بندوں کے ساتھ مخصوص ہیں۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا: \"اللہ اس شخص پر رحم کرے جس نے میری بات سنی، اسے یاد رکھا، اور پھر اسے اسی طرح پہنچا دیا جیسے اس نے سنا تھا۔\"\n\nیعنی حرف بہ حرف۔ اور یہ صرف اسی شخص کے لیے ہو سکتا ہے جس نے وحی کو، خواہ وہ قرآن ہو یا سنت، اسی لفظ کے ساتھ پہنچایا ہو جس کے ساتھ وہ آئی تھی۔ اور یہ صرف وحی کے ناقلین (مقرئین اور محدثین) کے لیے ہی ہو سکتا ہے۔ فقہاء کے لیے، یا ان لوگوں کے لیے جنہوں نے حدیث کو معنی کے ساتھ نقل کیا، جیسا کہ سفیان ثوری اور دیگر کا خیال ہے، کوئی حصہ یا نصیب نہیں ہے۔ کیونکہ معنی کے ساتھ نقل کرنے والا تو درحقیقت اس نبوی حدیث میں اپنی سمجھ کو ہم تک پہنچاتا ہے۔ اور جو شخص ہم تک اپنی سمجھ کو پہنچاتا ہے، وہ صرف اپنی ذات کا رسول ہے، اور قیامت کے دن ان لوگوں میں حشر نہیں کیا جائے گا جنہوں نے وحی کو سنا اور رسالت کو ادا کیا، جیسا کہ قاری اور محدث، جو رسول کے عین لفظ کو نقل کرتے ہیں، رسولوں علیہم السلام کی صف میں حشر کیے جائیں گے۔ پس صحابہ اگر وحی کو اس کے لفظ پر نقل کرتے ہیں، تو وہ رسول اللہ صلی اللہ علیہ وسلم کے رسول ہیں، اور تابعین صحابہ کے رسول ہیں، اور اسی طرح یہ سلسلہ نسل در نسل قیامت تک جاری رہے گا۔ اگر ہم چاہیں تو ہم اس شخص کو جو ہم تک پہنچاتا ہے، رسول اللہ کہہ سکتے ہیں، اور اگر ہم چاہیں تو اسے اس کی طرف منسوب کر سکتے ہیں جس سے اس نے تبلیغ کی۔ اور ہم نے واسطوں کو حذف کرنے کی اجازت اس لیے دی کہ رسول اللہ صلی اللہ علیہ وسلم کو جبرائیل علیہ السلام اور ایک فرشتہ خبر دیتے تھے، اور ہم یہ نہیں کہتے کہ وہ جبرائیل کے رسول ہیں، بلکہ ہم کہتے ہیں کہ وہ رسول اللہ ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا: **مُحَمَّدٌ رَسُولُ الله والَّذِينَ مَعَهُ** (محمد اللہ کے رسول ہیں اور وہ لوگ جو ان کے ساتھ ہیں)۔ اور اللہ عزوجل نے فرمایا: **ما كانَ مُحَمَّدٌ أَبا أَحَدٍ من رِجالِكُمْ ولكِنْ رَسُولَ الله** (محمد تمہارے مردوں میں سے کسی کے باپ نہیں ہیں، لیکن وہ اللہ کے رسول ہیں)۔ اس کے باوجود کہ اللہ نے فرمایا: **نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ** (اسے روح الامین نے آپ کے دل پر نازل کیا)، اس کے باوجود اللہ نے اسے صرف اپنی ذات کی طرف منسوب کیا۔\n\n### [ولایت اور عبودیت]\n\nپس عبودیت کا یہ حصہ ان کے لیے باقی رہا، اور یہ ایک عظیم خیر ہے جس کا اللہ نے ان پر احسان کیا۔ اور جو شخص اسے اپنی متصل اور غیر منقطع سند کے ساتھ نقل نہیں کرتا، اسے یہ مقام حاصل نہیں ہوتا اور نہ ہی وہ اس کی بو سونگھ سکتا ہے۔ اور وہ ان اولیاء (الأولياء) میں سے تھا جو اسم الولی (الولي) میں الحق (ذات حق) کے ساتھ مزاحمت کرتے تھے، پس اس اسم کے بقدر اس کی عبودیت میں کمی واقع ہوئی۔ اسی لیے محدث (محدث) کا نام، دال کے فتحہ کے ساتھ، اس کے لیے اسم الولی (الولي) سے زیادہ موزوں ہے۔ کیونکہ رسالت کا مقام رسول اللہ صلی اللہ علیہ وسلم کے بعد کوئی حاصل نہیں کر سکتا، سوائے اس مقدار کے جو ہم نے بیان کی ہے۔ پس یہی وہ چیز ہے جسے الحق (ذات حق) تعالیٰ نے ہم پر باقی رکھا ہے۔ اور اسی سے تم عبودیت کے شرف اور وحی کو روایت کے ذریعے نقل کرنے والے محدثین کے شرف کو پہچانتے ہو۔ اسی لیے ہم پر اس باب کا بند ہونا سخت محسوس ہوا، اور ہمیں معلوم ہوا کہ اللہ نے ہمیں اس مخصوص عبودیت کی حالت سے دور کر دیا ہے جس پر ہمیں ہونا چاہیے تھا۔ اور جہاں تک نبوت کا تعلق ہے، ہم اس کی ہلاکت کو پہلے باب معرفۃ الأفراد (افراد کی معرفت) میں بیان کر چکے ہیں، اور وہ اصحاب الرکاب (رکاب والے) ہیں۔\n\n### [بندے اور رب کے درمیان تقسیم شدہ نماز]\n\nپھر اللہ تعالیٰ نے ہمیں عبودیت اور اس کے مقام سے دور کرنے کے باب میں فرمایا:\nاللہ تعالیٰ نے فرمایا: \"میں نے نماز کو اپنے اور اپنے بندے کے درمیان نصف نصف تقسیم کر دیا ہے۔\"\nاور ہم کون ہیں کہ ہمارے اور اس کے درمیان تقسیم واقع ہو، حالانکہ وہ سید (آقا)، فاعل، اور محرک ہے جو ہمیں ہمارے قول **إِيَّاكَ نَعْبُدُ** (ہم تیری ہی عبادت کرتے ہیں) اور اس جیسی دیگر باتوں میں کہلواتا ہے جنہیں اس نے ہماری طرف منسوب کیا۔ حالانکہ ہم جانتے ہیں کہ ہمارے قیام، رکوع، سجدہ، اور جلوس میں اور ہماری گفتگو میں ہماری پیشانیاں اس کے ہاتھ میں ہیں۔ بندہ کہتا ہے: **الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ** (تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔ اللہ فرماتا ہے: \"میرے بندے نے میری حمد کی\" – یہ اس کی طرف سے ایک فضل ہے۔ کیونکہ یہ اس کے اس لفظ کے کہنے سے ہے، اور اس کی کیا حیثیت ہے کہ وہ سید (آقا) کے قول کو کہے؟ اللہ فرماتا ہے: \"میرے بندے نے کہا\" اور میں نے اسے کہا۔ یہ ایک پردہ ہے جو لٹکا ہوا ہے۔ پس بندے کو یہ جاننا چاہیے کہ اللہ کی اپنے بندوں میں ایک پوشیدہ تدبیر (مکر خفی) ہے۔ اور ہر شخص کے ساتھ اس کے رب کی معرفت (المعرفۃ) کے مطابق تدبیر کی جاتی ہے۔ پس وہ اس الٰہی تکریم کو اللہ کی طرف سے ایک نعمت میں تدریجاً داخل ہوتے ہوئے لیتا ہے۔ جب وہ نماز پڑھتا ہے اور تلاوت کرتا ہے، تو وہ کہتا ہے: الحمد للہ۔ وہ اسے حکایتاً کہتا ہے، اس لحاظ سے کہ اسے اس کا حکم دیا گیا ہے تاکہ اس کی نماز میں اس کی عبودیت صحیح ہو جائے۔ اور وہ جواب کا انتظار نہیں کرتا اور نہ یہ کہتا ہے کہ مجھے جواب دیا جائے، بلکہ وہ اس کام میں مشغول رہتا ہے جس کا اس کے آقا نے اسے مکلف کیا ہے، تاکہ وہ جواب اور انعام آقا کی طرف سے ہو، نہ کہ اس کے کہنے کی وجہ سے۔ کیونکہ حقیقت میں کہنے والا تو اس میں قول کو پیدا کرنے والا ہے۔ پس ہم اس مکر سے محفوظ رہتے ہیں، اگرچہ یہ ایک بلند مرتبہ ہے، لیکن اس شخص کے مقابلے میں جو اس مرتبے سے نیچے ہے اور اس میں نہیں ہے۔\n\n### [متصل محمدی وراثت]\n\nپس رسول اللہ صلی اللہ علیہ وسلم سے ہمیں اس مقام کی جو وراثت ملی ہے جس کا دروازہ ہم پر بند کر دیا گیا ہے، وہ صرف وہی ہے جو ہم نے ذکر کیا، یعنی الحق (ذات حق) کی اس شخص پر عنایت جسے اس مقام کا کشف (الکشف) ہوا اور جسے کتاب و سنت کی وحی کو روایت کے ذریعے نقل کرنے کا علم عطا ہوا۔ پس اہل روایت، یعنی قاریوں اور محدثین کا مقام کتنا شرف والا ہے! اللہ ہمیں ان لوگوں میں شامل کرے جنہیں قرآن اور سنت سے اس کی نقل کے لیے خاص کیا گیا ہے۔ کیونکہ اہل قرآن ہی اللہ والے اور اس کے خاص لوگ ہیں، اور حدیث قرآن کی طرح نص (قطعی حکم) ہے۔ کیونکہ آپ صلی اللہ علیہ وسلم **ما يَنْطِقُ عَنِ الْهَوى‏ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏** (اپنی خواہش سے نہیں بولتے، یہ تو صرف وحی ہے جو نازل کی جاتی ہے)۔ اور ان لوگوں میں سے جنہوں نے ہمارے ساتھ اس مقام کو حاصل کیا، ابو یزید بسطامی بھی ہیں، جن پر سوال اور تضرع کے بعد سوئی کے سوراخ کے برابر کشف (الکشف) ہوا، تو انہوں نے چاہا کہ اپنا قدم اس میں رکھیں، تو وہ جل گئے، پس انہیں معلوم ہوا کہ وہ ذوقاً اسے حاصل نہیں کر سکتے، حالانکہ یہ عبودیت کا کمال ہے۔ اور ہمیں آپ صلی اللہ علیہ وسلم سے ایک بال (شعرة) حاصل ہوا ہے، اور یہ اس شخص کے لیے بہت ہے جو جانتا ہے۔ پس مخلوق کے پاس اس میں سے صرف اس کا سایہ ہے۔ اور جب اللہ نے مجھے اس پر مطلع کیا تو یہ سوال کے ذریعے نہیں تھا، بلکہ اللہ کی طرف سے عنایت کے ذریعے تھا۔ پھر اللہ نے اس میں مجھے ادب کے ساتھ تائید بخشی، جو اس کی طرف سے رزق اور مجھ پر اس کی عنایت تھی۔ چنانچہ مجھ سے وہ بات سرزد نہیں ہوئی جو ابو یزید سے سرزد ہوئی تھی، بلکہ میں نے اس پر اطلاع پائی اور اس کی سیڑھی پر چڑھنے کا حکم آیا۔ پس میں نے جان لیا کہ یہ ابتلاء (آزمائش) کا خطاب ہے اور ابتلاء کا حکم ہے، نہ کہ تشریف (عزت افزائی) کا خطاب، اگرچہ بعض ابتلاء تشریف بھی ہو سکتے ہیں۔ پس میں رک گیا اور میں نے حجاب (پردہ) کا سوال کیا۔ پس اللہ نے جان لیا جو میں چاہتا تھا، تو اس نے میرے اور اس مقام کے درمیان پردہ ڈال دیا اور میرے اس عمل کو سراہا۔ پس اس نے مجھے اس بال (شعرة) سے نوازا جس کا ہم نے ذکر کیا، یہ ایک الٰہی اختصاص تھا۔ پس میں نے اس اختصاص پر اللہ کا شکر ادا کیا، اور شکر کے ساتھ زیادتی کا طالب نہیں ہوا، اور میں اس میں زیادتی کا طلبگار کیسے ہو سکتا ہوں جبکہ میں حجاب کا سوال کر رہا ہوں جو کمال عبودیت میں سے ہے۔ پس میں عبودیت میں چلا، اور اس کا غلبہ ظاہر ہوا، اور میرے اور سیادت کے مرتبے کے درمیان رکاوٹ ڈال دی گئی، اس پر اللہ کا شکر ہے۔ اور میں نے کتنی بار اس کی طرف طلب کی اور مجھے جواب نہیں دیا گیا، اور ان شاء اللہ آخرت میں بھی میں ایک خالص اور محض بندہ رہوں گا، اور اگر مجھے تمام عالم کی ملکیت بھی مل جائے، تو میں اس میں سے صرف اس کی عبودیت ہی کا مالک ہوں گا، یہاں تک کہ تمام عالم کی عبودیت میری ذات میں قائم ہو جائے۔\n\n### [ولی اللہ]\n\nاور لوگوں کے اس میں مختلف مراتب ہیں۔ پس بندے کے لیے مناسب ہے کہ وہ اس نام کے علاوہ کوئی اور نام نہ بڑھائے۔ اگر اللہ مخلوق کی زبانوں پر اس کے لیے \"ولی اللہ\" کا نام جاری کر دے، اور وہ دیکھے کہ اللہ نے اس پر ایک ایسا نام جاری کیا ہے جو اس نے خود اپنی ذات پر جاری کیا ہے، تو وہ اسے اس شخص سے نہ سنے جو اسے اس نام سے پکارتا ہے، مگر اس معنی میں کہ وہ مفعول کے معنی میں ہے نہ کہ فاعل کے معنی میں، تاکہ اس میں عبودیت کی بو آئے۔ کیونکہ \"فعیل\" کا وزن کبھی فاعل کے معنی میں بھی ہو سکتا ہے۔ اور ہم نے یہ بات اس لیے کہی کہ ہمیں حکم دیا گیا ہے کہ ہم اسے وکیل (الوکيل) بنائیں ان چیزوں میں جو اس کی ہیں اور جن میں ہم خلیفہ بنائے گئے ہیں۔ کیونکہ اس طرح کے معاملے میں ایک پوشیدہ تدبیر (مکر خفی) ہے، پس اس سے بچو۔ اور مکر سے بچانے والی الٰہی تنبیہ کے لیے یہ کافی ہے کہ تمہیں اس کا حکم دیا گیا ہے، پس اس کے حکم کی تعمیل کرو اور اسے وکیل بناؤ، ملکیت کا دعویٰ نہ کرو، کیونکہ اللہ نے تمہیں اپنا ولی بنایا ہے، جیسا کہ اس نے فرمایا: **وهُوَ يَتَوَلَّى الصَّالِحِينَ** (اور وہ نیک لوگوں کا ولی ہوتا ہے)۔ اور الصالح (نیک) کا نام عبودیت کی خصوصیات میں سے ہے۔ اسی لیے محمد صلی اللہ علیہ وسلم نے اپنی ذات کو صلاح (نیکی) سے متصف کیا، کیونکہ آپ نے ایک ایسی حالت کا دعویٰ کیا جو صرف کامل بندوں کے لیے ہوتی ہے۔ پس ان میں سے بعض کے لیے الحق (ذات حق) عزوجل نے اللہ کی طرف سے بشارت کے طور پر گواہی دی، چنانچہ اس نے اپنے بندے یحییٰ علیہ السلام کے بارے میں فرمایا: **نَبِيًّا من الصَّالِحِينَ** (نیک لوگوں میں سے ایک نبی)۔ اور اپنے نبی عیسیٰ علیہ السلام کے بارے میں فرمایا: **وكَهْلًا ومن الصَّالِحِينَ** (اور ادھیڑ عمر میں اور نیک لوگوں میں سے)۔ اور ابراہیم علیہ السلام کے بارے میں فرمایا: **وإِنَّهُ في الْآخِرَةِ لَمِنَ الصَّالِحِينَ** (اور بے شک وہ آخرت میں نیک لوگوں میں سے ہوں گے)۔ یہ ان تین امور کی وجہ سے ہے جو دنیا میں ان سے سرزد ہوئے تھے، یعنی ان کا اپنی زوجہ سارہ کے بارے میں تاویل کے ساتھ یہ کہنا کہ وہ ان کی بہن ہیں، اور ان کا عذر کے طور پر **إِنِّي سَقِيمٌ** (میں بیمار ہوں) کہنا، اور ان کا حجت قائم کرنے کے لیے **بَلْ فَعَلَهُ كَبِيرُهُمْ** (بلکہ یہ ان کے بڑے نے کیا ہے) کہنا۔ انہی تینوں کی وجہ سے وہ قیامت کے دن لوگوں سے عذر کریں گے جب وہ ان سے شفاعت کا دروازہ کھولنے کے لیے اپنے رب سے سوال کرنے کو کہیں گے۔ اسی لیے ان کی نیکی کا ذکر آخرت میں کیا گیا، کیونکہ اللہ نے ان پر اس کی وجہ سے مواخذہ نہیں کیا، جیسا کہ اللہ تعالیٰ نے محمد صلی اللہ علیہ وسلم سے فرمایا: **لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ** (تاکہ اللہ آپ کے اگلے اور پچھلے گناہ معاف فرما دے)۔ اور فرمایا: **عَفَا الله عَنْكَ لِمَ أَذِنْتَ لَهُمْ** (اللہ نے آپ کو معاف کر دیا، آپ نے انہیں کیوں اجازت دی؟)۔ اور اس میں عتاب سے پہلے بشارت کو مقدم کیا۔ اور یہ آیت ہمارے نزدیک ایک خاص بشارت ہے، اس میں کوئی عتاب نہیں، بلکہ یہ اس شخص کے لیے ایک استفہام ہے جو انصاف کرے اور اہل علم کو ان کا حق دے۔ اور جہاں تک سلیمان اور ان جیسے دیگر انبیاء علیہم السلام کا تعلق ہے، تو الحق (ذات حق) نے ہمیں خبر دی کہ انہوں نے کہا: **وأَدْخِلْنِي بِرَحْمَتِكَ في عِبادِكَ الصَّالِحِينَ** (اور مجھے اپنی رحمت سے اپنے نیک بندوں میں داخل فرما)۔ اگرچہ وہ فی نفسہ اللہ کے نزدیک نیک تھے، لیکن وہ صلاح (نیکی) کے طالب اور اس کی گواہی دیے جانے والوں کے درمیان ہیں، باوجود اس کے کہ یہ ایک عبودی وصف ہے جو اللہ کے لیے لائق نہیں۔ تو پھر اسم الولی (الولي) کے بارے میں تمہارا کیا خیال ہے، جسے اللہ نے فاعل کے معنی میں خود اپنا نام رکھا ہے؟ پس مناسب ہے کہ وہ نام بندے پر جاری نہ ہو، اور اگر الحق (ذات حق) اسے اس پر جاری کر دے، تو یہ اس کی طرف ہے۔ اور انسان پر اپنی عبودیت اور ان اسماء کی پابندی لازم ہے جو کبھی بھی الحق (ذات حق) پر لفظاً جاری نہیں ہوئے، ان چیزوں میں جو اس نے اپنے نبی صلی اللہ علیہ وسلم پر نازل کیں۔ پس جب اللہ تعالیٰ نے اپنے بندے محمد صلی اللہ علیہ وسلم پر یہ آیت نازل کی تاکہ لوگ اسے پہچانیں، تو اللہ نے اپنے نبی صلی اللہ علیہ وسلم کی اس بات کو حکایتاً بیان کیا جو انہیں لازماً کہنی اور تلفظ کرنی تھی، پس اللہ نے اسے قرآن بنا دیا جو تلاوت کیا جاتا ہے، کیونکہ یہ فی نفسہ بندوں کی خصوصیات میں سے تھا۔ پس اللہ تعالیٰ نے فرمایا: **إِنَّ وَلِيِّيَ الله الَّذِي نَزَّلَ الْكِتابَ وهُوَ يَتَوَلَّى الصَّالِحِينَ** (بے شک میرا ولی اللہ ہے جس نے کتاب نازل کی، اور وہ نیک لوگوں کا ولی ہوتا ہے)۔ پس اس نے آپ کے لیے نیکی کی گواہی دی، اگرچہ الحق (ذات حق) اس آیت میں حکایت کر رہا ہے، اور اگر وہ حکم دے رہا ہو، تو وہ ان لوگوں میں سے ہوں گے جن کے لیے نیکی کی گواہی دی گئی ہے۔ پس ہمیں معلوم ہوا کہ اللہ نے آپ کو اپنا ولی بنایا اور ہمیں خبر دی کہ اللہ نیک لوگوں کا ولی ہوتا ہے۔ پس آپ نے اس طریقے سے اپنی ذات کے لیے نیکی کی گواہی دی جو ہم نے ذکر کیا، اور یہ کسی اور سے نقل نہیں کیا گیا، بلکہ اس کے قریب کی بات نقل کی گئی، جیسا کہ عیسیٰ علیہ السلام کا قول: **إِنِّي عَبْدُ الله آتانِيَ الْكِتابَ وجَعَلَنِي نَبِيًّا وجَعَلَنِي مُبارَكاً أَيْنَ ما كُنْتُ وأَوْصَانِي بِالصَّلاةِ والزَّكَاةِ ما دُمْتُ حَيًّا وبَرًّا بِوالِدَتِي ولَمْ يَجْعَلْنِي جَبَّاراً شَقِيًّا والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ ويَوْمَ أَمُوتُ ويَوْمَ أُبْعَثُ حَيًّا** (بے شک میں اللہ کا بندہ ہوں، اس نے مجھے کتاب دی اور مجھے نبی بنایا، اور مجھے بابرکت بنایا جہاں کہیں بھی میں رہوں، اور مجھے نماز اور زکوٰۃ کی وصیت کی جب تک میں زندہ رہوں، اور اپنی والدہ کے ساتھ نیک سلوک کرنے والا بنایا، اور مجھے سرکش اور بدبخت نہیں بنایا۔ اور مجھ پر سلامتی ہو جس دن میں پیدا ہوا، اور جس دن میں مروں گا، اور جس دن میں زندہ اٹھایا جاؤں گا)۔ اللہ تعالیٰ فرماتا ہے: **تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ** (یہ وہ رسول ہیں جن میں سے ہم نے بعض کو بعض پر فضیلت دی)۔ یعنی اسی طرح آپ بھی ہیں۔ پس آپ کی فضیلت میں سے یہ بھی تھا کہ آپ نے اس مقام کو حاصل کیا۔ پس اے اپنی ذات کے ولی! اللہ کے اسماء الحسنیٰ کے ساتھ اخلاق اختیار کرنے میں اپنی حفاظت کرو، کیونکہ علماء نے ان کے ساتھ اخلاق اختیار کرنے میں اختلاف نہیں کیا۔ پس جب تمہیں ان کے ساتھ اخلاق اختیار کرنے کی توفیق ملے، تو اس میں ان کے آثار کو اپنے اندر دیکھنے سے غافل نہ ہو، اور ان میں اور ان کے ساتھ ان کی نیابت کے حکم سے رہو۔ پس تم اسم الرسول (رسول) کی طرح ہو جاؤ، اور الحق (ذات حق) کے ساتھ اس معنی میں اپنے اوپر اس کے اسماء میں سے کسی نام کے اطلاق میں شریک نہ ہو۔ اور ادب کو لازم پکڑو اور کہو: **قُلْ رَبِّ زِدْنِي عِلْماً** (کہو: اے میرے رب! میرے علم میں اضافہ فرما)۔ اور اللہ حق کہتا ہے اور وہی سیدھا راستہ دکھاتا ہے۔",
    "fa": "(باب سی و هشتم در معرفت کسانی که بر مقام محمدی (المقام المحمدي) مطلع شدند اما از اقطاب به آن نرسیدند)\n\nمیان نبوت و ولایت تفاوتی است،\nاما ولایت شرف کامل‌تر و عظیم‌تری دارد.\nفلک محیط با سرّ خود در برابر آن سر فرود می‌آورد،\nو همچنین قلم بلندمرتبه و باشکوه‌تر.\nنبوت و رسالت وجود داشتند،\nو اکنون پایان یافته‌اند، اما راه راستین از آنِ ولایت است.\nو خانه‌ای محکم برای ولایت برپا کرد،\nدر ذات خود، پس بقای (البقاء) آن همیشگی‌تر است.\nبرای آن پایانی مجوی که به سویش تلاش شود،\nزیرا در هنگام رسیدن به آن، فرو می‌ریزد.\nصفت دوام برای ذات او ذاتی است،\nپس او ولی (الولي) است و قهرش حاکم.\nپیامبر و رسولش به او پناه می‌برند،\nو عالم اعلی و هر آنکه قدیمی‌تر است.\n\n### [رسالت، نبوت و ولایت]\n\nثابت شده است که رسول خدا (صلی الله علیه و آله و سلم) فرمود: «**إن الرسالة والنبوة قد انقطعت فلا رسول بعدي ولا نبي**» (رسالت و نبوت قطع شده است، پس نه رسولی بعد از من خواهد بود و نه پیامبری).\n\nاین حدیث با تمامیتش، از سخت‌ترین چیزهایی است که اولیا (الأولياء) تلخی آن را چشیده‌اند، زیرا پیوند میان انسان و عبودیتش را قطع می‌کند. و هنگامی که پیوند میان انسان و عبودیتش از کامل‌ترین وجوه قطع شود، پیوند میان انسان و حق (الحق) نیز قطع می‌گردد. زیرا بنده به همان اندازه که از عبودیت خود خارج می‌شود، از تقرب به مولای خود کاسته می‌شود، چرا که در اسماء او با حق (الحق) مزاحمت می‌کند، و کمترین مزاحمت، مزاحمت اسمی است. پس حق (الحق) اسم ولی (الولي) را برای ما باقی گذاشت، که آن از اسماء سبحان اوست. و این اسم را از رسول خود سلب کرد و بر او خلع نمود و او را عبد و رسول نامید. و شایسته حق (الحق) نیست که رسول نامیده شود، زیرا این اسم از ویژگی‌های عبودیت (العبودية) است که برای ربّ صحیح نیست. و سبب اطلاق این اسم، وجود رسالت است، و رسالت قطع شده است، پس حکم این اسم با قطع شدن آن، از جهت نسبتش با حق (الحق)، مرتفع گردید.\n\n### [رسالت تبلیغ و نقل]\n\nو چون رسول خدا (صلی الله علیه و آله و سلم) دانست که در امت او کسانی هستند که چنین جامی را خواهند نوشید و از دردی که در جانشان به سبب آن عارض می‌شود آگاه بود، بر آنان رحمت آورد و نصیبی برایشان قرار داد تا به واسطه آن بندگانِ بندگان باشند. پس به صحابه فرمود: «حاضر به غایب برساند.» پس آنان را به تبلیغ امر کرد، همان‌گونه که حق (الحق) او را به تبلیغ امر کرده بود، تا نام‌های رسولان که مخصوص بندگان است، بر آنان اطلاق شود. و فرمود (صلی الله علیه و آله و سلم): «**رحم الله امرأ سمع مقالتي فوعاها فأداها كما سمعها**» (خداوند رحمت کند کسی را که سخن مرا شنید و آن را حفظ کرد و همان‌گونه که شنید، ادا نمود).\n\nیعنی کلمه به کلمه. و این جز برای کسی که وحی را از قرآن یا سنت، با همان لفظی که آمده است، ابلاغ کند، محقق نمی‌شود. و این جز برای ناقلان وحی از قاریان (المقرئين) و محدثان نیست. فقها و کسانی که حدیث را بر اساس معنا نقل می‌کنند، مانند سفیان ثوری و دیگران، نصیب و بهره‌ای در این ندارند. زیرا ناقل بر اساس معنا، تنها فهم خود را از آن حدیث نبوی به ما منتقل کرده است، و کسی که فهم خود را به ما منتقل کند، رسولِ نفس خویش است و در روز قیامت در زمره کسانی که وحی را همان‌گونه که شنیدند ابلاغ کردند و رسالت را ادا نمودند، محشور نمی‌شود؛ آن‌گونه که قاری و محدثی که عین لفظ رسول را نقل می‌کند، در صف رسولان (علیهم السلام) محشور می‌شود. پس صحابه اگر وحی را بر لفظش نقل کنند، رسولانِ رسول خدا (صلی الله علیه و آله و سلم) هستند، و تابعین رسولانِ صحابه، و همین‌گونه نسل به نسل تا روز قیامت. اگر بخواهیم، می‌توانیم به کسی که به ما ابلاغ می‌کند، بگوییم رسول خدا، و اگر بخواهیم، آن را به کسی که از او ابلاغ کرده است، نسبت دهیم. و ما حذف واسطه‌ها را مجاز دانستیم، زیرا جبرئیل (علیه السلام) و فرشته‌ای از فرشتگان به رسول خدا خبر می‌دادند، و ما نمی‌گوییم رسول جبرئیل، بلکه می‌گوییم رسول خدا، چنانکه حق تعالی فرمود: **مُحَمَّدٌ رَسُولُ الله والَّذِينَ مَعَهُ** (محمد رسول خدا و کسانی که با او هستند) و فرمود (عز وجل): **ما كانَ مُحَمَّدٌ أَبا أَحَدٍ من رِجالِكُمْ ولكِنْ رَسُولَ الله** (محمد پدر هیچ یک از مردان شما نبوده است، بلکه رسول خداست) با وجود این قول که: **نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ** (روح‌الامین آن را بر قلب تو نازل کرد)، و با این حال، حق (الحق) آن را جز به خود نسبت نداد.\n\n### [ولایت و عبودیت]\n\nپس این مقدار از عبودیت (العبودية) برای آنان باقی ماند و این خیری عظیم است که حق (الحق) بر آنان منت نهاد. و هر کس آن را با سند متصل و غیر منقطع نقل نکند، این مقام را ندارد و بویی از آن نبرده است. و او از اولیایی (الأولياء) بود که در اسم ولی (الولي) با حق (الحق) مزاحمت می‌کرد، پس به اندازه این اسم از عبودیتش کاسته شد. به همین دلیل، اسم مُحَدَّث (با فتح دال) برای او سزاوارتر از اسم ولی (الولي) است. زیرا مقام رسالت را هیچ کس پس از رسول خدا (صلی الله علیه و آله و سلم) جز به مقداری که بیان کردیم، در نمی‌یابد. این همان چیزی است که حق تعالی برای ما باقی گذاشت. و از اینجا مقام شرف عبودیت و شرف محدثان، یعنی ناقلان وحی از طریق روایت، را می‌شناسی. و به همین دلیل، بسته شدن این باب بر ما سخت آمد و دانستیم که حق (الحق) ما را از حال عبودیت اختصاصی که شایسته بود بر آن باشیم، دور کرده است. و اما نبوت، ما هلاکت آن را پیش‌تر در باب معرفت افراد (الأفراد) که همان اصحاب رکاب هستند، بیان کردیم.\n\n### [نماز تقسیم شده میان بنده و رب]\n\nسپس حق تعالی از باب دور کردن ما از عبودیت و مقام آن،\nفرمود: «**قسمت الصلاة بيني وبين عبدي نصفين**» (نماز را میان خود و بنده ام به دو نیم تقسیم کردم).\nو ما کیستیم که تقسیم میان ما و او واقع شود، در حالی که او سید، فاعل و محرک است که ما را در گفتارمان **إِيَّاكَ نَعْبُدُ** (تنها تو را می‌پرستیم) و امثال آن که به ما نسبت داده است، به سخن می‌آورد؟ و ما می‌دانیم که اختیار ما در قیام، رکوع، سجود، نشستن و در سخن گفتنمان به دست اوست. بنده می‌گوید: **الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ** (ستایش از آنِ خدا، پروردگار جهانیان است). حق (الحق) می‌فرماید: «بنده‌ام مرا ستود.» این از باب تفضل اوست، زیرا این گفتار از جانب بنده است و او چه قدرتی دارد تا سید بگوید: «بنده‌ام گفت» و من به او گفتم؟ این حجابی آویخته است. پس شایسته است که بنده بداند که حق (الحق) در بندگانش مکر پنهانی دارد، و هر کس به اندازه علمش به پروردگارش، با او مکر می‌شود. پس این تکریم الهی را به عنوان آغاز از جانب حق (الحق) و به تدریج در نعمت می‌پذیرد. هنگامی که نماز می‌خواند و تلاوت می‌کند، می‌گوید: الحمد لله. این را از آن جهت می‌گوید که مأمور به آن است تا عبودیتش در نمازش صحیح باشد و منتظر پاسخ نمی‌ماند و نمی‌گوید تا به او پاسخ داده شود، بلکه مشغول کاری می‌شود که مولایش او را به آن مکلف کرده است، تا آن پاسخ و انعام از جانب مولا باشد، نه به دلیل اینکه او گفته است. زیرا گوینده حقیقی، خالق آن گفتار در اوست. پس از این مکر در امان می‌مانیم، هرچند که منزلتی رفیع است، اما با توجه به کسی که در غیر این منزلت است و از آن پایین‌تر آمده است.\n\n### [میراث محمدی (المحمدي) متصل]\n\nپس از این مقام که درِ آن بر ما بسته شده است، از رسول خدا (صلی الله علیه و آله و سلم) جز آنچه ذکر کردیم، یعنی عنایت حق (الحق) به کسی که کشف (الکشف) آن برایش حاصل شده و علم نقل وحی از طریق روایت کتاب و سنت به او روزی شده است، به ارث نبردیم. پس چه شریف است مقام اهل روایت از قاریان و محدثان. خداوند ما را از کسانی قرار دهد که به نقل آن از قرآن و سنت اختصاص یافته‌اند، زیرا اهل قرآن، اهل حق (الحق) و خاصان او هستند. و حدیث نیز به نص، مانند قرآن است، زیرا او (صلی الله علیه و آله و سلم) **ما يَنْطِقُ عَنِ الْهَوى‏ إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏** (از روی هوی و هوس سخن نمی‌گوید، بلکه آن جز وحی‌ای که به او نازل می‌شود، نیست). و از کسانی که همراه ما به این مقام تحقق یافت، ابویزید بسطامی است. برای او پس از سؤال و تضرع، به اندازه سوراخ سوزنی از آن کشف (الکشف) شد. پس خواست که قدم خود را در آن بگذارد، اما سوخت. پس دانست که ذوقی از آن را در نمی‌یابد، و آن کمال عبودیت است. و برای ما از آن حضرت (صلی الله علیه و آله و سلم) یک تار مو حاصل شد، و این برای کسی که می‌داند، بسیار است. زیرا نزد خلق از آن جز سایه‌اش نیست. و هنگامی که حق (الحق) مرا بر آن مطلع ساخت، از روی سؤال نبود، بلکه از روی عنایت حق (الحق) بود. سپس حق (الحق) مرا در آن با ادب تأیید کرد، که روزی‌ای از جانب او و عنایتی از حق (الحق) به من بود. پس از من آنچه از ابویزید سر زد، صادر نشد، بلکه بر آن مطلع شدم و امر به بالا رفتن از نردبان آن آمد. پس دانستم که آن خطاب، خطاب ابتلا و امر ابتلا است، نه خطاب تشریف؛ هرچند که ممکن است برخی از ابتلاها تشریف باشند. پس توقف کردم و حجاب را درخواست نمودم. حق (الحق) آنچه را می‌خواستم دانست، پس حجاب را میان من و مقام قرار داد و از این کار من سپاسگزاری کرد. پس آن تار مویی را که ذکر کردیم، به عنوان اختصاصی الهی به من بخشید. پس حق (الحق) را بر اختصاص به آن تار مو شکر کردم، بدون اینکه با شکر، طلب زیادت کنم. و چگونه طلب زیادت از آن کنم، در حالی که من درخواست حجاب می‌کنم که از کمال عبودیت است؟ پس در عبودیت سیر کردم و سلطنت آن آشکار شد و میان من و مرتبه سیادت حائل شد. حمد از آنِ حق (الحق) است بر این امر. و چقدر آن را طلب کردم و اجابت نشدم. و همین‌گونه ان‌شاءالله در آخرت بنده‌ای محض و خالص خواهم بود، و اگر تمام عالم را به من مالک گردانند، جز عبودیت خاص آن را مالک نخواهم شد، تا آنکه تمام عبودیت عالم در ذات من محقق شود.\n\n### [ولی الله]\n\nو مردم در این باره مراتبی دارند. آنچه شایسته بنده است این است که بر این اسم (ولی) چیز دیگری نیفزاید. پس اگر حق (الحق) زبان‌های خلق را بر او گشود که او ولی الله است و دید که حق (الحق) اسمی را بر او اطلاق کرده که خود بر خویشتن اطلاق نموده است، نباید آن را از کسی که او را به این نام می‌خواند، بشنود مگر به معنای مفعول، نه به معنای فاعل، تا بوی عبودیت (العبودية) را در آن استشمام کند. زیرا صیغه «فعیل» ممکن است به معنای فاعل باشد. و ما این را به خاطر آن گفتیم که به ما امر شده است که حق سبحانه را در آنچه از آنِ اوست و ما در آن جانشین هستیم، وکیل بگیریم. زیرا در چنین امری مکر پنهانی وجود دارد، پس از آن برحذر باش. و همین تنبیه الهی که از مکر حفظ می‌کند، کافی است که تو به آن امر شده‌ای. پس امر او را اطاعت کن و او را وکیل بگیر و ادعای مالکیت مکن، زیرا حق (الحق) تو را سرپرستی کرده است، چنانکه فرمود: **وهُوَ يَتَوَلَّى الصَّالِحِينَ** (و او سرپرستی صالحان را بر عهده دارد). و اسم صالح از ویژگی‌های عبودیت است. به همین دلیل، محمد (صلی الله علیه و آله و سلم) خود را به صلاح توصیف کرد، زیرا او ادعای حالتی را نمود که جز برای بندگان کامل نیست. و حق (عز وجل) برای برخی از آنان به عنوان بشارتی از جانب حق (الحق) شهادت داده است. پس درباره بنده خود یحیی (علیه السلام) فرمود: **نَبِيًّا من الصَّالِحِينَ** (پیامبری از صالحان). و درباره پیامبرش عیسی (علیه السلام) فرمود: **وكَهْلًا ومن الصَّالِحِينَ** (و در میانسالی از صالحان). و درباره ابراهیم (علیه السلام) فرمود: **وإِنَّهُ في الْآخِرَةِ لَمِنَ الصَّالِحِينَ** (و او در آخرت قطعاً از صالحان است) به خاطر سه امری که در دنیا از او سر زد: یکی گفتارش درباره همسرش ساره که او خواهرش است (با تأویل)، و دیگری گفتارش: **إِنِّي سَقِيمٌ** (من بیمارم) به عنوان عذرخواهی، و سومی گفتارش: **بَلْ فَعَلَهُ كَبِيرُهُمْ** (بلکه بزرگشان این کار را کرده است) برای اقامه حجت. به واسطه این سه امر، او در روز قیامت از مردم عذرخواهی می‌کند، هنگامی که از او می‌خواهند که از پروردگارش بخواهد تا باب شفاعت را بگشاید. به همین دلیل، صلاح او در آخرت ذکر شد، زیرا حق (الحق) او را به خاطر آن مؤاخذه نکرد، چنانکه حق تعالی به محمد (صلی الله علیه و آله و سلم) فرمود: **لِيَغْفِرَ لَكَ الله ما تَقَدَّمَ من ذَنْبِكَ وما تَأَخَّرَ** (تا خداوند گناهان گذشته و آینده تو را بیامرزد) و فرمود: **عَفَا الله عَنْكَ لِمَ أَذِنْتَ لَهُمْ** (خداوند تو را بخشید، چرا به آنان اجازه دادی؟) پس بشارت را قبل از عتاب آورد. و این آیه نزد ما بشارتی خاص است که در آن عتابی نیست، بلکه استفهامی است برای کسی که انصاف دهد و حق اهل علم را ادا کند. و اما سلیمان و امثال او (علیهم السلام)، حق (الحق) به ما خبر داد که او گفت: **وأَدْخِلْنِي بِرَحْمَتِكَ في عِبادِكَ الصَّالِحِينَ** (و مرا به رحمت خود در میان بندگان صالحت وارد کن). و اگرچه آنان در نفس الامر نزد حق (الحق) صالح بودند، اما میان کسی که طالب صلاح است و کسی که به آن شهادت داده شده است، تفاوت است، با وجود اینکه این صفتی عبودی است که شایسته حق (الحق) نیست. پس گمان تو درباره اسم ولی (الولي) که حق (الحق) خود را به معنای فاعل به آن نامیده است، چیست؟ پس شایسته است که آن اسم بر بنده اطلاق نشود، و اگر حق (الحق) آن را بر او اطلاق کند، این به اختیار حق تعالی است. و انسان ملزم به عبودیت خود و اسم‌هایی است که مختص اوست و هرگز به لفظ بر حق (الحق) در آنچه بر پیامبرش (صلی الله علیه و آله و سلم) نازل کرده، اطلاق نشده است. پس هنگامی که حق تعالی این آیه را بر بنده خود محمد (صلی الله علیه و آله و سلم) نازل کرد تا مردم به واسطه آن معرفت یابند، حق (الحق) سخنی را از پیامبرش (صلی الله علیه و آله و سلم) حکایت کرد که چاره‌ای جز گفتن و بر زبان آوردن آن نداشت، پس حق تعالی آن را قرآنی قرار داد که تلاوت می‌شود، زیرا آن در نفس الامر از ویژگی‌های بندگان بود. پس حق تعالی فرمود: **إِنَّ وَلِيِّيَ الله الَّذِي نَزَّلَ الْكِتابَ وهُوَ يَتَوَلَّى الصَّالِحِينَ** (همانا ولی من خداوندی است که کتاب را نازل کرده و او سرپرستی صالحان را بر عهده دارد). پس اگر حق (الحق) در این آیه حکایت‌کننده باشد، به صلاح او شهادت داده است، و اگر امرکننده باشد، او از کسانی است که به صلاحشان شهادت داده شده است. پس دانستیم که حق (الحق) او را سرپرستی کرده و به ما خبر داده است که حق (الحق) سرپرستی صالحان را بر عهده دارد. پس او به همان وجهی که ذکر کردیم، به صلاح خود شهادت داد و این از غیر او نقل نشده است، بلکه آنچه نزدیک به آن است، از قول عیسی (علیه السلام) نقل شده است: **إِنِّي عَبْدُ الله آتانِيَ الْكِتابَ وجَعَلَنِي نَبِيًّا وجَعَلَنِي مُبارَكاً أَيْنَ ما كُنْتُ وأَوْصانِي بِالصَّلاةِ والزَّكاةِ ما دُمْتُ حَيًّا وبَرًّا بِوالِدَتِي ولَمْ يَجْعَلْنِي جَبَّاراً شَقِيًّا والسَّلامُ عَلَيَّ يَوْمَ وُلِدْتُ ويَوْمَ أَمُوتُ ويَوْمَ أُبْعَثُ حَيًّا** (من بنده خدا هستم، به من کتاب داده و مرا پیامبر قرار داده است، و مرا هر جا که باشم مبارک گردانیده و تا زنده‌ام به نماز و زکات سفارش کرده است، و مرا نسبت به مادرم نیکوکار قرار داده و مرا زورگو و بدبخت قرار نداده است. و سلام بر من، روزی که متولد شدم و روزی که می‌میرم و روزی که زنده برانگیخته می‌شوم). حق تعالی می‌فرماید: **تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ** (آن رسولان، برخی از آنان را بر برخی دیگر برتری دادیم). یعنی تو نیز چنین هستی. پس از فضل او، نیل به چنین مقامی بود. پس ای ولی (الولي)، نفس خود را در تخلق به اسماء حسنای حق (الحق) حفظ کن، زیرا علما در تخلق به آن‌ها اختلافی ندارند. پس اگر موفق به تخلق به آن‌ها شدی، در این امر از شهود (الشهود) آثار آن‌ها در خود غافل مشو، و در آن‌ها و با آن‌ها به حکم نیابت از آن‌ها باش. پس مانند اسم رسول (الرسول) باش، و در اطلاق اسمی از اسماء حق (الحق) بر خود به آن معنا، با حق (الحق) شریک مشو. و ادب را رعایت کن و بگو: **رَبِّ زِدْنِي عِلْماً** (پروردگارا، علم مرا زیاد کن). و **الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}