{
  "id": 495,
  "title": {
    "ar": "الباب الخامس والتسعون وأربعمائة في معرفة حال قطب كان منزله ومن يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وهُوَ كافِرٌ",
    "en": "Chapter Four Hundred and Ninety-Five: Concerning the Gnosis of the State of a Pole (قطب) Whose Station Was: <<وَمَن يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وهُوَ كافِرٌ>> (And whoever among you reverts from his religion and dies while he is a disbeliever).",
    "ur": "باب چار سو پچانوے: ایک قطب (قطب) کے حال کی معرفت میں جس کا مقام (منزل) یہ تھا: \"اور تم میں سے جو کوئی اپنے دین سے پھر جائے، پھر وہ کافر ہی کی حالت میں مر جائے...\" (وَمَن يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وهُوَ كافِرٌ)",
    "fa": "باب چهارصد و نود و پنجم در معرفت حال قطبی که منزل او این آیه بود: «و هر کس از شما از دین خود برگردد و در حال کفر بمیرد» (وَمَنْ يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وَهُوَ كَافِرٌ)"
  },
  "content": {
    "ar": "## «الباب الخامس والتسعون وأربعمائة في معرفة حال قطب كان منزله ومن يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وهُوَ كافِرٌ»\n\n\n> من يرتدد منكم عن دينه ويموت *** فإنه كافر بالدين أجمعه‏\n\n\n> لأنه أحدي العين ليس له *** مخالف جاءه من غير موضعه‏\n\n\n> وإن إتيانه بالكل شرعته *** بذا أتى الحكم فيه من مشرعه‏\n\n\n### [في الارتداد]\n\n\nالضمير في أنه يعود على الذين قال الله تعالى لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً فالمراد هنا بضمير منكم ليس إلا الأنبياء عليه السلام لا الأمم لأنه لو كان للأمم لم يبعث رسول في أمة قد بعث فيها رسول إلا أن يكون مؤبدا لا يزيد ولا ينقص وما وقع الأمر كذلك فإن جعلنا الضمير في قوله منكم للأمم والرسل جميعا تكلفنا في التأويل شططا لا نحتاج إليه فكون الضمير كناية عن الرسل أقرب إلى الفهم وأوصل إلى العلم ويدخل في ذلك عموم الرسالة وخصوصها وقال صَلَّى اللهُ عَليهِ وسَلَّم من بدل دينه فاقتلوه‏\n\n\nفاختلف الناس في اليهودي إن تنصر والنصراني إن تهود هل يقتل أم لا ولم يختلفوا فيه إن أسلم فإنه صَلَّى اللهُ عَليهِ وسَلَّم ما جاء يدعو الناس إلا إلى الإسلام وجعل علماء الرسوم أن هذا تبديل مأمور به وما هو عندنا كذلك فإن النصراني وأهل الكتاب كلهم إذا أسلموا ما بدلوا دينهم فإنه من دينهم الايمان بمحمد صَلَّى اللهُ عَليهِ وسَلَّم والدخول في شرعه إذا أرسل وأن رسالته عامة فما بدل أحد من أهل الدين دينه إذ أسلم فافهم وما بقي إلا المشرك فإن ذلك ليس بدين مشروع وإنما هو أمر موضوع من عند غير الله والله ما قال إلا من يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ ورسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول من بدل دينه‏\n\n\nوإنما لم يسم الشرك دينا لأن الدين الجزاء ولا جزاء في الخير للمشرك على الشرك أصلا لا فيما سلف ولا فيما بقي وإذا آل المشرك إلى ما يؤول إليه في النار التي هي موطنه الذي لا يخرج منه أبدا فإن ذلك ليس بجزاء وإنما ذلك اختصاص سبق الرحمة التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فيظهر حكمها فيه في وقت ما عند إزالة حكم الغضب الإلهي فما أراد بالدين إلا الذي له جزاء في الخير والشر ولو أراد الدين الذي هو العادة مثل قول إمرئ القيس‏\n\n\n> كدينك من أم الحويرث قبلها *** وجارتها أم الرباب بمأسل‏\n\n\nأراد بالدين هنا العادة ونحن إنما تكلمنا في الدين المشروع الذي العادة جزء منه فيكشف للذاكر بهذا الذكر علم الارتداد وهو الرجوع الذي في قوله وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فمن الناس من عجل له هنا الرجوع إلى الله وليس ذلك إلا للعارفين بالله فإنهم يرجعون في أمورهم كلها إلى الله ولا يزالون يستصحبهم ذلك إلى الموت فيموتون عليه وإنما وصفوا بالكفر لأنهم تستروا بالأسباب ولم يقولوا بإبطالها فهم في نفوسهم وحالهم مع الله وبظاهرهم في الأسباب فإنهم يرون الأسباب راجعة إلى الله فرجعوا لرجوعها ورجعوا بها إلى الله فلما لم يفقدهم أصحاب الأسباب في الأسباب تخيلوا فيهم أنهم أمثالهم فيما هم فيه فجاءت هذه الآية ذما في العموم وحمدا ومدحا في الخصوص ولهذا تممها فقال فيهم إن أعمالهم حبطت لأنه أضافها إليهم وأعطاهم الرجوع إلى الله العلم بأن أعمالهم إلى الله لا إليهم فحبطت أعمالهم من الإضافة إليهم وصارت مضافة إلى الله كما هي في نفس الأمر وقوله في الدنيا يريد من عجل له الكشف عن ذلك هنا وقوله في الآخرة يريد من أخر له ذلك وهو الجميع إذا انكشف الغطاء وأما إضافة الدين إليه في قوله عَنْ دِينِهِ وإنما الدين لله فإن الراجع إذا رآه في رجوعه لله لا إليه زالت هذه الإضافة عنه لشهوده وإنما قلنا بإضافة الدين إليهم في هذه الآية لأنه أظهر في الحكم من أجل قوله حَتَّى يَرُدُّوكُمْ يعني في الفتنة عَنْ دِينِكُمْ إِنِ اسْتَطاعُوا فأضاف الدين إليهم فكان الأوجه أن يكون في ضمير الهاء على ما هو عليه في ضمير الخطاب سواء وإن جاز أن يكون ضمير الهاء يعود على الله لكن الأصل في الضمائر\nكلها عودها على أقرب مذكور إذا عريت عن قرائن الأحوال وقوله في تمام الهجير وأُولئِكَ هُمُ الْخاسِرُونَ لهذا الكشف لأنهم رأوا ما كانوا يتخيلون فيه أنه إليهم ليس إليهم فخسروا رأس المال ولا أعظم خسرانا منه فما كان من الله إليهم بعد هذا من الإنعام فإنما هو من الاسم الوهاب المعطي لينعم فما لهم في نظرهم عطاء جزاء لعامل فهذا وأمثاله هو الذي يعطي هذا الذكر لمن كثر دؤوبه عليه‏\n\n",
    "en": "Chapter 495: On the Gnosis of the State of a Pole (قطب) whose Station (منزله) was [the verse] \"And whoever among you reverts from his religion and dies while he is a disbeliever (كافر)...\"\n\nWhoever among you reverts from his religion and dies,\nHe is indeed a disbeliever (كافر) in the religion in its entirety.\n\nBecause he is of the Singular Essence (أحدي العين); he has no\nOpponent who came to him from a place other than his own.\n\nAnd indeed, his coming with the totality is his Law (شرعته);\nBy this, the ruling concerning him came from his Lawgiver (مشرعه).\n\n### [Concerning Reversion/Apostasy (الارتداد)]\n\nThe pronoun in [the verse] refers back to those concerning whom Allah the Exalted said: <<لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً>> (For each of you We have appointed a law [شِرْعَةً] and a way [مِنْهاجاً]). Therefore, the intent here of the pronoun \"among you\" (منكم) is none other than the Prophets (عليه السلام), not the communities (الأمم). If it referred to the communities, a messenger would not have been sent to a community where a messenger had already been sent, unless that [first message] was eternal, neither increasing nor decreasing. But the matter did not occur thus. If we make the pronoun in His saying \"among you\" refer to both the communities and the messengers, we impose an unnecessary strain (شططا) upon the interpretation. Thus, the pronoun being an allusion (كناية) to the Messengers is closer to understanding and more conducive to Gnosis (العلم). This includes both the generality and the specificity of the Message (الرسالة).\n\nThe Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) said: \"Whoever changes his religion, kill him.\" People differed regarding whether a Jew who becomes a Christian, or a Christian who becomes a Jew, should be killed or not. However, they did not differ concerning the one who embraces Islam. For the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) only came to invite people to Islam. The scholars of external forms (علماء الرسوم) considered this [conversion between Judaism and Christianity] to be a commanded change. But in our view, it is not so. When the Christian and all the People of the Book (أهل الكتاب) embrace Islam, they have not changed their religion, because belief in Muhammad (صَلَّى اللهُ عَليهِ وسَلَّم) and entering his Law (شرعه) when he is sent, is part of their religion, and his message is universal. Therefore, no one among the People of Religion (أهل الدين) has changed his religion when he embraced Islam, so understand this. The only one remaining is the polytheist (المشرك), for that [polytheism] is not a divinely sanctioned religion (دين مشروع); rather, it is a matter established (موضوع) from other than God. Yet, God only said: <<مَنْ يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ>> (Whoever among you reverts from his religion), and the Messenger of God (صَلَّى اللهُ عَليهِ وسَلَّم) says: \"Whoever changes his religion.\"\n\nPolytheism (الشرك) was only not called a religion (دين) because *din* means recompense (الجزاء). There is fundamentally no recompense in goodness for the polytheist based on polytheism, neither for what has passed nor for what remains. And when the polytheist ultimately reaches what he is destined for in the Fire, which is his permanent abode from which he will never exit, that is not recompense. Rather, that is a specific manifestation (اختصاص) of the precedence of Mercy (الرحمة) which <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompasses all things), such that its ruling appears in him at some point when the ruling of Divine Wrath (الغضب الإلهي) is removed. Thus, by *din* (religion), He only intended that which has recompense in good and evil. Had He intended *din* to mean custom (العادة), it would be like the saying of Imru' al-Qays:\n\nLike your custom (دينك) with Umm al-Huwayrith before her,\nAnd her neighbor Umm al-Rabab at Ma'sal.\n\nHere, he intended *din* (religion) to mean custom. We, however, are speaking of the divinely sanctioned religion (الدين المشروع) of which custom is a part. Through this remembrance (الذكر), the Gnosis (علم) of reversion (الارتداد) is unveiled to the one who remembers (الذاكر). This reversion is the return (الرجوع) mentioned in His saying: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him the whole affair is returned). Among people, there are those for whom this return to God is hastened here [in this life]. This is only for the Gnostics (العارفين بالله), for they return all their affairs to God, and this state accompanies them until death, and they die upon it. They were only described as disbelievers (كفر) because they veiled themselves (تستروا) with secondary causes (الأسباب) and did not declare their invalidation. Thus, in their inner selves (نفوسهم) and their state (حالهم) they are with God, but outwardly (بظاهرهم) they are engaged in the causes, for they see the causes returning to God. So they returned because of the causes' return, and they returned *by means of* them to God. Since the people of causes did not miss them within the causes, they imagined that the Gnostics were like them in their state. Thus, this verse came as a condemnation in general, but as praise and commendation in particular. For this reason, He completed it by saying concerning them that their deeds were rendered void (حبطت), because He attributed them to them [the Gnostics], while the return to God granted them the knowledge that their deeds belong to God, not to themselves. Thus, their deeds were rendered void from the attribution to themselves, and became attributed to God, as they are in reality (في نفس الأمر). His saying \"in this world\" (في الدنيا) refers to the one for whom the unveiling (الكشف) of this is hastened here. And His saying \"in the Hereafter\" (في الآخرة) refers to the one for whom this is delayed, which is everyone when the veil (الغطاء) is lifted.\n\nAs for the attribution of religion (الدين) to him in His saying \"from his religion\" (عَنْ دِينِهِ), while religion belongs only to God, this attribution ceases for the one who returns when he witnesses (شهوده) that his return is to God, not to himself. We only maintained the attribution of religion to them in this verse because it is more manifest in the legal ruling (الحكم), due to His saying: <<حَتَّى يَرُدُّوكُمْ>> (until they turn you back)—meaning in the trial (الفتنة)—<<عَنْ دِينِكُمْ إِنِ اسْتَطاعُوا>> (from your religion, if they are able). Thus, He attributed the religion to them. Therefore, it was more appropriate that the pronoun *hu* (هاء) be the same as the pronoun of address (*kum*), even though it is permissible for the pronoun *hu* to refer back to God. However, the fundamental rule for all pronouns is that they refer back to the nearest mentioned noun, provided they are free from contextual indicators (قرائن الأحوال). And His saying at the conclusion of the verse, <<وَأُولئِكَ هُمُ الْخاسِرُونَ>> (And those are the losers), refers to this unveiling (الكشف), because they saw that what they had imagined belonged to them did not belong to them. Thus, they lost the principal capital (رأس المال), and there is no greater loss than that. Whatever bounty (الإنعام) comes to them from God after this is only from the Name, the Bestower (الوهاب), the Giver (المعطي), so that He may confer bliss. Therefore, in their view, they have no gift that is a recompense for an action performed. This, and similar matters, is what this remembrance (الذكر) grants to the one who persists diligently in it.",
    "ur": "باب نمبر چار سو پچانوے، اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور تم میں سے جو کوئی اپنے دین سے پھر جائے اور کافر ہو کر مرے\" (وَمَنْ يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وَهُوَ كَافِرٌ)\n\nتم میں سے جو کوئی اپنے دین سے پھر جائے اور مر جائے\nتو وہ پورے دین کا کافر ہے۔\n\nکیونکہ وہ احدی العین (أحدي العين) ہے، اس کے لیے کوئی مخالف نہیں\nجو اس کے غیر مقام سے آیا ہو۔\n\nاور اس کا تمام چیزوں کو لانا ہی اس کی شریعت ہے،\nاسی کے ذریعے اس کے شارع کی طرف سے اس میں حکم آیا ہے۔\n\n### [ارتداد (الارتداد) کے بیان میں]\n\n\"اِنَّہُ\" (اُس نے) میں ضمیر ان لوگوں کی طرف لوٹتی ہے جن کے بارے میں اللہ تعالیٰ نے فرمایا: \"ہم نے تم میں سے ہر ایک کے لیے ایک شریعت اور ایک منہاج (لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا) مقرر کیا ہے۔\" لہٰذا یہاں \"مِنْکُمْ\" (تم میں سے) کی ضمیر سے مراد صرف انبیاء علیہم السلام ہیں، نہ کہ اُمتیں۔ کیونکہ اگر یہ اُمتوں کے لیے ہوتی تو کسی ایسی اُمت میں کوئی رسول مبعوث نہ ہوتا جس میں پہلے ہی کوئی رسول مبعوث ہو چکا ہو، الا یہ کہ وہ شریعت دائمی ہو، نہ بڑھنے والی نہ گھٹنے والی، اور معاملہ ایسا نہیں ہے۔ اگر ہم \"مِنْکُمْ\" میں ضمیر کو اُمتوں اور رسولوں سب کے لیے قرار دیں تو ہم تاویل میں ایک ایسا غیر ضروری بوجھ ڈالیں گے جس کی ہمیں ضرورت نہیں۔ لہٰذا ضمیر کا رسولوں سے کنایہ ہونا فہم کے زیادہ قریب اور علم تک پہنچانے والا ہے، اور اس میں رسالت کی عمومیت اور خصوصیت دونوں شامل ہیں۔\n\nاور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"جس نے اپنا دین بدل دیا، اسے قتل کر دو۔\" (مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ)\n\nچنانچہ لوگوں نے اس بارے میں اختلاف کیا کہ اگر کوئی یہودی نصرانی ہو جائے یا نصرانی یہودی ہو جائے تو کیا اسے قتل کیا جائے گا یا نہیں؟ لیکن اس بارے میں اختلاف نہیں کیا کہ اگر وہ اسلام قبول کر لے (تو اسے قتل نہیں کیا جائے گا)، کیونکہ آپ صلی اللہ علیہ وسلم لوگوں کو صرف اسلام کی طرف بلانے کے لیے ہی تشریف لائے تھے۔ رسمی علماء (علماء الرسوم) نے یہ قرار دیا ہے کہ یہ (اسلام قبول کرنا) ایک مامور بہ تبدیلی ہے، لیکن ہمارے نزدیک ایسا نہیں ہے۔ کیونکہ نصرانی اور تمام اہل کتاب جب اسلام قبول کرتے ہیں تو وہ اپنا دین نہیں بدلتے، اس لیے کہ محمد صلی اللہ علیہ وسلم پر ایمان لانا اور جب آپ مبعوث ہوئے تو آپ کی شریعت میں داخل ہونا ان کے دین کا حصہ ہے۔ اور آپ کی رسالت عام ہے۔ لہٰذا جب کوئی اہل دین اسلام قبول کرتا ہے تو وہ اپنا دین نہیں بدلتا، پس سمجھو۔ اور صرف مشرک باقی رہ جاتا ہے، کیونکہ وہ کوئی مشروع دین (دين مشروع) نہیں ہے، بلکہ وہ غیر اللہ کی طرف سے وضع کردہ (أمر موضوع) امر ہے۔ اور اللہ تعالیٰ نے صرف یہ فرمایا: \"اور تم میں سے جو کوئی اپنے دین سے پھر جائے\" (وَمَنْ يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ)، اور رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: \"جس نے اپنا دین بدل دیا۔\"\n\nاور شرک کو دین اس لیے نہیں کہا گیا کہ دین جزا (الجزاء) کا نام ہے۔ اور مشرک کے لیے شرک پر خیر میں کوئی جزا نہیں ہے، نہ ماضی میں اور نہ مستقبل میں۔ اور جب مشرک اس انجام کو پہنچے گا جو اسے جہنم میں پہنچنا ہے، جو اس کا وہ ٹھکانہ ہے جہاں سے وہ کبھی نہیں نکلے گا، تو یہ جزا نہیں ہے۔ بلکہ یہ رحمت کی سبقت کا ایک اختصاص ہے جو \"ہر چیز پر محیط ہے\" (وَسِعَتْ كُلَّ شَيْءٍ)، چنانچہ غضب الٰہی (الغضب الإلهي) کے حکم کے زائل ہونے پر کسی وقت اس میں اس رحمت کا حکم ظاہر ہو گا۔ پس اللہ نے دین سے مراد صرف وہی لیا ہے جس میں خیر اور شر کی جزا ہو۔ اور اگر دین سے مراد وہ عادت ہوتی، جیسا کہ امرؤ القیس کا قول ہے:\n\nام الحویرث سے پہلے تمہاری عادت کی طرح،\nاور اس کی پڑوسن ام الرباب سے مأسل میں۔\n\nیہاں دین سے مراد عادت ہے۔ اور ہم تو صرف مشروع دین (الدين المشروع) کے بارے میں بات کر رہے ہیں جس کا ایک جزو عادت ہے۔ چنانچہ اس ذکر کے ذریعے ذاکر کے لیے ارتداد (الارتداد) کا علم منکشف ہوتا ہے، اور وہ رجوع (الرجوع) ہے جو اللہ کے اس قول میں ہے: \"اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں\" (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)۔ پس لوگوں میں سے بعض ایسے ہیں جن کے لیے یہاں اللہ کی طرف رجوع جلدی کر دیا گیا، اور یہ صرف عارفین باللہ (العارفين بالله) کے لیے ہے، کیونکہ وہ اپنے تمام معاملات میں اللہ کی طرف رجوع کرتے ہیں اور یہ کیفیت موت تک ان کے ساتھ رہتی ہے، اور وہ اسی پر فوت ہوتے ہیں۔\n\nاور انہیں کفر سے اس لیے متصف کیا گیا کہ انہوں نے اسباب میں پردہ پوشی (تستروا بالأسباب) کی اور ان کے باطل ہونے کا قول نہیں کیا۔ پس وہ اپنے باطن میں اور اپنے حال میں اللہ کے ساتھ ہیں، اور اپنے ظاہر میں اسباب میں ہیں۔ کیونکہ وہ اسباب کو اللہ کی طرف لوٹتے ہوئے دیکھتے ہیں، چنانچہ وہ اسباب کے رجوع کی وجہ سے رجوع کرتے ہیں اور ان اسباب کے ذریعے اللہ کی طرف رجوع کرتے ہیں۔ جب اسباب والے لوگوں نے انہیں اسباب میں مشغول پایا تو انہوں نے ان کے بارے میں یہ گمان کیا کہ وہ بھی ان کی طرح ہیں جس میں وہ خود ہیں۔ چنانچہ یہ آیت عموم میں مذمت اور خصوص میں تعریف اور مدح کے طور پر آئی ہے۔ اور اسی لیے اللہ نے اسے مکمل کرتے ہوئے ان کے بارے میں فرمایا کہ ان کے اعمال ضائع (حبطت) ہو گئے، کیونکہ اللہ نے ان اعمال کی نسبت ان کی طرف کی تھی۔ اور اللہ نے انہیں اللہ کی طرف رجوع عطا کیا، یہ علم دیتے ہوئے کہ ان کے اعمال اللہ کی طرف ہیں نہ کہ ان کی طرف۔ چنانچہ ان کے اعمال کی نسبت ان کی طرف ہونے سے وہ ضائع ہو گئے اور اللہ کی طرف منسوب ہو گئے، جیسا کہ وہ حقیقت امر (نفس الأمر) میں ہیں۔\n\nاور اللہ کا قول \"دنیا میں\" سے مراد وہ شخص ہے جس کے لیے یہاں اس کا کشف (الکشف) جلدی کر دیا گیا، اور اس کا قول \"آخرت میں\" سے مراد وہ شخص ہے جس کے لیے اسے مؤخر کر دیا گیا، اور وہ سب ہیں جب پردہ ہٹ جائے (انكشف الغطاء)۔ اور جہاں تک دین کی نسبت ان کی طرف کرنے کا تعلق ہے، جیسا کہ اس کے قول \"اپنے دین سے\" (عَنْ دِينِهِ) میں ہے، حالانکہ دین تو اللہ کے لیے ہے، تو جب رجوع کرنے والا اپنے رجوع میں اسے اللہ کے لیے دیکھتا ہے نہ کہ اپنے لیے، تو اس کے شہود (الشہود) کی وجہ سے یہ نسبت اس سے زائل ہو جاتی ہے۔ اور ہم نے اس آیت میں دین کی نسبت ان کی طرف اس لیے کی ہے کہ یہ حکم میں زیادہ ظاہر ہے، اس قول کی وجہ سے: \"یہاں تک کہ وہ تمہیں تمہارے دین سے پھیر دیں، اگر وہ کر سکیں\" (حَتَّى يَرُدُّوكُمْ عَنْ دِينِكُمْ إِنِ اسْتَطَاعُوا)۔ چنانچہ اللہ نے دین کی نسبت ان کی طرف کی۔ لہٰذا زیادہ مناسب یہ تھا کہ ضمیرِ ہاء بھی ضمیرِ خطاب کی طرح ہو، اگرچہ ضمیرِ ہاء کا اللہ کی طرف لوٹنا جائز ہے، لیکن تمام ضمائر میں اصل یہ ہے کہ جب وہ قرائنِ احوال سے خالی ہوں تو وہ قریب ترین مذکور کی طرف لوٹتی ہیں۔ اور اس آیت کے اختتام پر اللہ کا قول: \"اور وہی لوگ خسارہ پانے والے ہیں\" (وَأُولَئِكَ هُمُ الْخَاسِرُونَ) اس کشف (الکشف) کی وجہ سے ہے، کیونکہ انہوں نے دیکھا کہ جس چیز کے بارے میں وہ گمان کرتے تھے کہ وہ ان کی طرف ہے، وہ ان کی طرف نہیں ہے، چنانچہ انہوں نے اصل سرمایہ کھو دیا، اور اس سے بڑا کوئی خسارہ نہیں۔ پس اس کے بعد اللہ کی طرف سے جو بھی انعام ان کی طرف آتا ہے، وہ صرف اسم الوہاب (الاسم الوهاب) کی طرف سے ہے جو انعام دینے والا ہے۔ لہٰذا ان کی نظر میں یہ کسی عامل کے لیے جزا کے طور پر کوئی عطاء نہیں ہے۔ یہ اور اس کی مثالیں ہی وہ علم ہے جو یہ ذکر اس شخص کو عطا کرتا ہے جو اس پر کثرت سے مستقل کوشش (دؤوبه) کرتا ہے۔",
    "fa": "باب چهارصد و نود و پنجم در معرفت حال قطبی که منزل او این آیه بود: «و هر کس از شما از دین خود برگردد و در حال کفر بمیرد.» (وَمَنْ يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ فَيَمُتْ وَهُوَ كَافِرٌ)\n\nهر کس از شما از دین خود برگردد و بمیرد، پس او به تمام دین کافر است.\nزیرا او یگانه‌چشم (أحدي العين) است و هیچ مخالفی ندارد که از غیر جایگاهش به او آمده باشد.\nو همانا آمدن او با کل (همه چیز) شریعت اوست؛ حکم در مورد او از سوی شارعش (مشرعه) بدین‌گونه آمده است.\n\n### [درباره ارتداد]\n\nضمیر در «أنه» به کسانی بازمی‌گردد که خداوند متعال درباره‌شان فرمود: «برای هر یک از شما شریعت و راهی قرار دادیم.» (لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا) پس مراد از ضمیر «منکم» (از شما) در اینجا فقط پیامبران (علیهم السلام) هستند، نه امت‌ها. زیرا اگر مراد امت‌ها بودند، رسولی در امتی که قبلاً رسولی در آن مبعوث شده، فرستاده نمی‌شد، مگر اینکه آن [شریعت] ابدی باشد و نه کم شود و نه زیاد، در حالی که امر چنین واقع نشده است. اگر ضمیر در قول «منکم» را شامل امت‌ها و رسولان بدانیم، در تأویل به زحمتی افراطی می‌افتیم که نیازی به آن نداریم. بنابراین، اینکه ضمیر کنایه از رسولان باشد، به فهم نزدیک‌تر و به علم رساننده‌تر است و عموم و خصوص رسالت را در بر می‌گیرد. و پیامبر (صَلَّى اللهُ عَليهِ وَسَلَّم) فرمود: «هر کس دین خود را تغییر داد، او را بکشید.» (مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ)\n\nپس مردم در مورد یهودی که نصرانی شود و نصرانی که یهودی شود، اختلاف کردند که آیا کشته می‌شود یا خیر. اما در مورد کسی که اسلام آورد، اختلافی نکردند، زیرا پیامبر (صَلَّى اللهُ عَليهِ وَسَلَّم) نیامد مگر برای دعوت مردم به اسلام. علمای رسوم (فقها) این [اسلام آوردن] را تبدیل مأمور به دانسته‌اند، در حالی که نزد ما چنین نیست. زیرا نصرانی و همه اهل کتاب، هنگامی که اسلام می‌آورند، دین خود را تغییر نداده‌اند؛ چرا که ایمان به محمد (صَلَّى اللهُ عَليهِ وَسَلَّم) و ورود به شریعت او، در صورتی که مبعوث شود و رسالتش عام باشد، جزئی از دین آنهاست. پس هیچ یک از اهل دین، هنگامی که اسلام آورد، دین خود را تغییر نداد؛ این را بفهم. و تنها مشرک باقی می‌ماند، زیرا شرک دین مشروع نیست، بلکه امری است که از جانب غیر خدا وضع شده است. و خداوند نفرموده مگر: «هر کس از شما از دین خود برگردد.» (وَمَنْ يَرْتَدِدْ مِنْكُمْ عَنْ دِينِهِ) و رسول خدا (صَلَّى اللهُ عَليهِ وَسَلَّم) می‌فرماید: «هر کس دین خود را تغییر داد.»\n\nو شرک را دین ننامید، زیرا دین به معنای جزا (پاداش) است، و برای مشرک بر شرک، اصلاً جزایی در خیر نیست، نه در گذشته و نه در آینده. و هنگامی که مشرک به آنچه در آتش منتهی می‌شود، که جایگاه اوست و هرگز از آن خارج نمی‌شود، می‌رسد، این جزا نیست، بلکه اختصاصی است که رحمت «که همه چیز را فرا گرفته است» (وَسِعَتْ كُلَّ شَيْءٍ) بر آن سبقت گرفته است، و حکم آن [رحمت] در زمانی خاص، هنگام برداشته شدن حکم غضب الهی، در او ظاهر می‌شود. پس خداوند از «دین» اراده نکرده مگر آنچه را که برای آن جزای خیر و شر وجود دارد. و اگر مرادش دینی بود که به معنای عادت است، مانند قول امرؤ القیس:\n\nمانند عادت تو با ام‌الحویرث پیش از او، و همسایه‌اش ام‌الرباب در مأسل.\n\nدر اینجا مراد از دین، عادت است. و ما تنها درباره دین مشروعی سخن گفتیم که عادت جزئی از آن است. پس برای ذاکر، با این ذکر، علم ارتداد (الارتداد) که همان رجوع (الرجوع) است، آشکار می‌شود؛ همان رجوعی که در این قول است: «و بازگشت همه امور به سوی اوست.» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ) پس برخی از مردم، رجوع به سوی خدا در همین دنیا برایشان تعجیل شده است، و این جز برای عارفان بالله نیست. زیرا آنان در همه امور خود به سوی خدا بازمی‌گردند و این حالت همواره تا مرگ همراهشان است و بر آن می‌میرند. و اگر به کفر توصیف شده‌اند، به این دلیل است که خود را پشت اسباب (الأسباب) پنهان کرده‌اند و قائل به ابطال اسباب نشده‌اند. پس آنان در باطن خود و حالشان با خدا هستند، و در ظاهرشان در اسباب. زیرا اسباب را بازگشت‌کننده به سوی خدا می‌بینند، پس به خاطر بازگشت اسباب، بازگشتند و با اسباب به سوی خدا بازگشتند. هنگامی که اصحاب اسباب، آنان را در اسباب گم نکردند، گمان بردند که اینان نیز مانند خودشان در آنچه هستند، می‌باشند. پس این آیه به طور عام نکوهش و به طور خاص ستایش و مدح را در بر دارد. و به همین دلیل آن را کامل کرد و درباره آنان فرمود که اعمالشان حبط (حبطت) شده است، زیرا اعمال را به خودشان نسبت داد. و رجوع به سوی خدا، این علم را به آنان داد که اعمالشان به سوی خداست نه به سوی خودشان. پس اعمالشان از جهت انتساب به خودشان حبط شد و همان‌گونه که در نفس‌الامر است، به خدا نسبت داده شد. و قول او «در دنیا» اشاره به کسی دارد که کشف (الکشف) این امر در همین‌جا برایش تعجیل شده است، و قول او «در آخرت» اشاره به کسی دارد که این امر برایش به تأخیر افتاده است، و او شامل همه است هنگامی که پرده برداشته شود. و اما نسبت دادن دین به او در قول «عَنْ دِينِهِ» (از دین خود)، در حالی که دین تنها از آن خداست، این نسبت از کسی که بازگشت می‌کند، هنگامی که رجوع خود را برای خدا ببیند نه برای خودش، به دلیل شهود (الشهود) از او زائل می‌شود. و ما به نسبت دادن دین به آنان در این آیه قائل شدیم، زیرا این امر در حکم آشکارتر است به دلیل قول خداوند: «تا شما را از دینتان برگردانند، اگر بتوانند.» (حَتَّى يَرُدُّوكُمْ عَنْ دِينِكُمْ إِنِ اسْتَطَاعُوا) پس دین را به آنان نسبت داد. بنابراین، شایسته‌تر آن بود که ضمیر «هاء» (در دینه) مانند ضمیر خطاب (در دینکم) باشد، اگرچه جایز است که ضمیر «هاء» به خدا بازگردد، اما اصل در همه ضمایر، بازگشت به نزدیک‌ترین مذکور است، در صورتی که از قرائن احوال خالی باشد. و قول او در پایان آیه: «و آنان همان زیانکارانند.» (وَأُولَئِكَ هُمُ الْخَاسِرُونَ) به خاطر همین کشف (الکشف) است، زیرا دیدند آنچه را که گمان می‌کردند به سوی خودشان است، به سوی آنان نیست. پس سرمایه اصلی را از دست دادند و زیانی بزرگ‌تر از آن نیست. پس آنچه از انعام (الإنعام) بعد از این از جانب خدا به سوی آنان می‌رسد، تنها از اسم «الوهاب» (بخشنده) است که عطا می‌کند تا نعمت دهد. پس در نظر آنان، هیچ عطایی پاداش عمل‌کننده نیست. این و امثال آن است که این ذکر به کسی که بر آن مداومت بسیار کند، عطا می‌کند."
  },
  "page_count": 2
}