{
  "id": 370,
  "title": {
    "ar": "الباب السبعون وثلاثمائة في معرفة منزل المزيد وسر وسرين من أسرار الوجود والتبدل وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Seventy: Concerning the Gnosis of the Station of Augmentation (منزل المزيد), and the Secret and the Double Secret from the mysteries of Being (الوجود) and Transformation, which belongs to the Muhammadan Presence (الحضرة المحمدية)",
    "ur": "باب تین سو ستر: منزل مزید (Manzil al-Mazīd) کی معرفت (المعرفۃ) میں، اور ہستی (الوجود) کے اسرار میں سے ایک راز اور دو رازوں کے بارے میں، اور تبدل (التبدل) کے بارے میں۔ اور یہ حضرت محمدیہ (الحضرۃ المحمدیۃ) سے ہے۔",
    "fa": "باب سیصد و هفتادم در معرفت منزل مزید (افزونی) و راز و دو راز از اسرار هستی (الوجود) و تبدل، و آن از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب السبعون وثلاثمائة في معرفة منزل المزيد وسر وسرين من أسرار الوجود والتبدل وهو من الحضرة المحمدية»\n\n\n> إن الزيادة في الأعمال صورتها *** مثل الزيادة في الإنعام يا رجل‏\n\n\n> وليس يعرفها إلا رجال حجى *** وليس يحصرها عد ولا أجل‏\n\n\n> لله في طيها مكر لذي نظر *** محقق ولنا في مكره أمل‏\n\n\n> فإنه صادر من سر حضرته *** وليس يعصم إلا العلم والعمل‏\n\n\n> إن الفروع لها أصل يبينها *** للناظرين به قد جاءنا المثل‏\n\n\n### [أن الحكمة في الأشياء كلها]\n\n\nاعلم أن الحكمة في الأشياء كلها والأمور أجمعها إنما هو للمراتب لا للاعيان وأعظم المراتب الألوهية وأنزل المراتب العبودية فما ثم إلا مرتبتان فما ثم إلا رب وعبد لكن للالوهة أحكام كل حكم منها يقتضي رتبة فأما يقوم ذلك الحكم بالإله فيكون هو الذي حكم\n\n\nعلى نفسه وهو حكم المرتبة في المعنى ولا يحكم بذلك الحكم إلا صاحب المرتبة لأن المرتبة ليست وجود عين وإنما هي أمر معقول ونسبة معلومة محكوم بها ولها الأحكام وهذا من أعجب الأمور تأثير المعدوم وأما أن يقوم ذلك الحكم بغيره في الموجود إما أمرا وجوديا وإما نسبة فلا تؤثر إلا المراتب وكذلك للعبودة أحكام كل حكم منها رتبة فأما يقوم ذلك الحكم بنفس العبد فما حكم عليه سوى نفسه فكأنه نائب عن المرتبة التي أوجبت له هذا الحكم أو يحكم على مثله أو على غيره وما ثم إلا مثل أو غير في حق العبد وأما في الإله فما ثم إلا غير لا مثل فإنه لا مثل له فأما الأحكام التي تعود عليه من أحكام الرتبة وجوب وجوده لذاته والحكم بغنائه عن العالم وإيجابه على نفسه بنصر المؤمنين بالرحمة ونعوت الجلال كلها التي تقتضي التنزيه ونفي المماثلة وأما الأحكام التي تقتضي بذاتها طلب الغير فمثل نعوت الخلق كلها وهي نعوت الكرم والإفضال والجود والإيجاد فلا بد فيمن وعلى من فلا بد من الغير وليس إلا العبد وما منها أثر يطلب العبد إلا ولا بد أن يكون له أصل في الإله أوجبته المرتبة لا بد من ذلك ويختص تعالى بأحكام من هذه المرتبة لا تطلب الخلق كما قررنا ومرتبة العبد تطلب من كونه عبدا أحكاما لا تقوم إلا بالعبد من كونه عبدا خاصا فهي عامة في كل عبد لذاته ثم لها أحكام تطلب تلك الأحكام وجود الأمثال ووجود الحق فمنها إذا كان العبد نائبا وخليفة عن الحق أو خليفة عن عبد مثله فلا بد أن يخلع عليه من استخلفه من صفاته ما تطلبه مرتبة الخلافة لأنه إن لم يظهر بصورة من استخلفه وإلا فلا يتمشى له حكم في أمثاله وليس ظهوره بصورة من استخلفه سوى ما تعطيه مرتبة السيادة فأعطته رتبة العبودة ورتبة الخلافة أحكاما لا يمكن أن يصرفها إلا في سيده والذي استخلفه كما أن له أحكاما لا يصرفها إلا فيمن استخلف عليه والخلافة صغرى وكبرى فأكبرها التي لا أكبر منها الإمامة الكبرى على العالم وأصغرها خلافته على نفسه وما بينهما ينطلق عليها صغرى بالنسبة إلى ما فوقها وهي بعينها كبرى بالنظر إلى ما تحتها فأما تأثير رتبة العبد في سيده فهو قيام السيد بمصالح عبده ليبقى عليه حكم السيادة ومن لم يقم بمصالح عبده فقد عزلته المرتبة فإن المراتب لها حكم التولية والعزل بالذات لا بالجعل كانت لمن كانت وأما التأثير الذي يكون للعبد من كونه خليفة فيمن استخلفه كان المستخلف ما كان إن يبقى له عين من استخلفه عليه لينفذ حكمه فيه وإن لم يكن كذلك فليس بخليفة ولا يصدق إذا لم يكن ثم على من ولا فيمن لأن الخليفة لا بد له من مكان يكون فيه حتى يقصد بالحاجات أ لا ترى من لا يقبل المكان كيف اقتضت المرتبة له أن يخلق سماء جعله عرشا ثم ذكر أنه استوى عليه حتى يقصد بالدعاء وطلب الحوائج ولا يبقى العبد حائرا لا يدري أين يتوجه لأن العبد خلقه الله ذا جهة فنسب الحق الفوقية لنفسه من سماء وعرش وإحاطة بالجهات كلها بقوله فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله وبقوله ينزل ربنا إلى السماء الدنيا فيقول هل من تائب هل من داع هل من مستغفر\n\n\nويقول عنه رسوله‏\nإن الله في قبلة المصلي‏\n\n\nهذا كله حكم المراتب إن عقلت فلو زالت المراتب من العالم لم يكن للاعيان وجود أصلا فافهم فإذا أراد الأعلى أن يعرفه الأدنى لأن الأدنى لا قدم له في العلو والأعلى له الإحاطة بالأدنى فلا بد أن يتعرف الأعلى إلى الأدنى ولا يمكن ذلك إلا بأن يتنزل إليه الأعلى لأن الأدنى لا يمكن أن يترقى إليه لأنه تنعدم عينه إذ لا قدم له في العلو فالأدنى أبدا لا يزال في رتبته ثابتا والأعلى له النزول وله الثبوت في رتبته ومن ثبوته في رتبته حكم على نفسه بالنزول فهو ثابت في مرتبته العالية في عين نزوله لأن النزول من أحكامها وكذلك فعل الله تعالى في سفرائه الذين هم رسله إلى خلقه من خلقه فما أرسل رسولا إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ فإذا أرسله عامة كانت العامة قومه فأعطاه جوامع الكلم وهو فصل الخطاب وما كمل إلا آدم بالأسماء وكمال محمد صَلَّى اللهُ عَليهِ وسَلَّم بجوامع الكلم فنزل إليهم برسالة ربهم بلسانهم ولحنهم فما دعاهم إلا بهم ثم إنه ما شرع لهم من الأحكام إلا ما كانوا عليه فما زادهم في ذلك إلا كونها من عند الله فيحكمون بها على طريق القربة إلى الله لتورثهم السعادة عند الله وإنما قلنا ما شرع لهم من الأحكام إلا ما كانوا عليه لأنه لم تخل أمة من الأمم على ناموس تكون عليه لمصالح أحوالها وليست إلا خمسة فلا بد من واجب أوجبه إمامهم وواضع ناموسهم عليهم وهو الواجب والفرض عندنا وكذلك المندوب والمحظور والمكروه والمباح لأنه لا بد لهم من حدود في الأحكام يقفون عندها عليها وما جاءهم الشرع من عند الله إلا بهذا الذي كانوا عليه من حكم نظرهم فيما يزعمون وهو في نفس الأمر من جعل الله ذلك في نفوسهم من حيث لا يشعرون ولذلك كان لهم بذلك أجر من الله من حيث لا يعلمون لكن إذا انقلبوا إليه وجدوا ذلك عنده فلما رأينا أنه ما أرسل رسولا إِلَّا بِلِسانِ قَوْمِهِ علمنا أنه ما تعرف إلينا حين أراد منا أن نعرفه إلا بما نحن عليه لا بما تقتضيه ذاته وإن كان تعرفه إلينا بنا مما تقتضيه ذاته ولكن يختلف اقتضاء ذاته بين ما يتميز به عنا وبين ما يتعرف به إلينا ولما كان الخلق على مراتب كثيرة وكان أكمل مرتبة فيه الإنسان كان كل صنف من العالم جزءا بالنظر إلى كمال الإنسان حتى الإنسان الحيوان جزء من الإنسان الكامل فكل معرفة لجزء من العالم بالله معرفة جزئية إلا الإنسان فإن معرفته بالله معرفة العالم كله بالله فعلمه بالله علم كلي لا علم كل إذ لو كان علما كلا لم يؤمر أن يقول رَبِّ زِدْنِي عِلْماً أ ترى ذلك علما بغير الله لا والله بل بالله فخلق الإنسان الكامل على صورته ومكنه بالصورة من إطلاق جميع أسمائه عليه فردا فردا وبعضا بعضا لا ينطلق عليه مجموع الأسماء معا في الكلمة الواحدة ليتميز الرب من العبد الكامل فما من اسم من الأسماء الحسنى وكل أسماء الله حسني إلا وللعبد الكامل أن يدعي بها كما له أن يدعو سيده بها ومن هذه الأسماء الإلهية ما يدعوه الحق تعالى بها على طريق الثناء على العبد بها وهي أسماء الرحمة واللطف والحنان ومنها ما يدعوه بها على طريق المذمة مثل قوله تعالى ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ وكذلك كان في قومه يدعى بهذا الاسم ودعاه الحق به هنا سخرية به على جهة الذم قال تعالى فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ فَسَوْفَ تَعْلَمُونَ فلما أوجد الكامل منا على الصورة عرفه الكامل من نفسه بما أعطاه من الكمال وكان العبد الكامل حقا كله وفنى عن عينه في نفسه لأنه قابلة بذاته وقد جعل الله له مثالا في باب المحبة فعشق إليه ما عشق من العالم من أي شي‏ء كان من فرس أو دار أو دينار أو درهم فما قابلة به إلا بالجزء المناسب ففني منه ذلك الجزء المناسب لعشقه في ذلك وبقي سائره صاحيا لا حكم له فيه إلا إذا عشق شخصا مثله من جارية أو غلام فإنه يقابله بذاته كلها وبجميع أجزائه فإذا شاهده فنى فيه بكله لا بجزء منه فيغشى عليه وذلك لكونه قابلة بكله كذلك العبد إذا رأى الحق أو تخيله فنى فيه عند مشاهدته لأنه على صورته فيقابله بذاته فما بقي فيه جزء يصحو حتى يعقل به ما فنى منه فيه وهكذا كل‏\n\n\nجزء من العالم مع الحق إذا تجلى له خشع له وفنى فيه لأن كل ما هو عليه شي‏ء من العالم هو صورة الحق لما أعطاه منه إذ لا يصح أن يكون شي‏ء من العالم له وجود ليس هو صورة الحق فلا بد أن يفنى العالم في الحق إذا تجلى له ولا يفنى الحق في الخلق لأن الخلق من الحق ما هو الحق من الخلق فنسبة الحق إلى الخلق نسبة الإنسان إلى كل صنف من العالم ما عدا نوع الإنسان فتفطن لما ذكرته لك من فناء كل شي‏ء من العالم عن نفسه عند تجليه سبحانه له ولا يفنى الحق بمشاهدة الخلق وقد جاء الشرع بتدكدك الجبل وصعق موسى عليه السلام عند التجلي الرباني فما عرفنا من‏\nالحق إلا ما نحن عليه وفينا الكامل والأكمل فإن الله أعطى كل شي‏ء خلقه فلما قرر الله هذه النعم على عبده وهداه السبيل إليها قال إِمَّا شاكِراً فيزيده منها لأنا قلنا إنه ما أعطاه إلا منه ما أعطاه مطلقا وإِمَّا كَفُوراً بنعمه فيسلبها عنه ويعذبه على ذلك فليحترز الإنسان لنفسه في أي طريق يمشي فما بعد بيان الله بيان وقال موسى عليه السلام لبني إسرائيل إِنْ تَكْفُرُوا أَنْتُمْ ومن في الْأَرْضِ جَمِيعاً فَإِنَّ الله لَغَنِيٌّ حَمِيدٌ ينبه أن الله تعالى ما أوجد العالم إلا للعالم وما تعبده بما تعبده به إلا ليعرفه بنفسه فإنه إذا عرف نفسه عرف ربه فيكون جزاؤه على علمه بربه أعظم الجزاء ولذلك قال إِلَّا لِيَعْبُدُونِ ولا يعبدونه حتى يعرفوه فإذا عرفوه عبدوه عبادة ذاتية فإذا أمرهم عبدوه عبادة خاصة مع بقاء العبادة العامة الذاتية فجازاهم على ذلك فما خلقهم إلا لهم ولهذا قال تعالى عن نفسه إنه غَنِيٌّ عَنِ الْعالَمِينَ وما ذكر موسى الأرض إلا لكمالها بوجود كل شي‏ء فيها وهو الإنسان الجامع حقائق العالم فقوله في الأرض لأنها الذلول فهي الحافظة مقام العبودة فكأنه قال إن تكفروا أنتم وكل عبد لله فإن الله غني عن العالمين ولذلك جعل الله الأرض محل الخلافة ومنزلها فكأنه كنى أي إني جاعل في الأرض خليفة منهم لا يزول عن مقام عبوديته في نفسه أي لا يحجبه مرتبة الخلافة بالصفات التي أمره بها عن رتبته ولهذا جعلناه خليفة ولم نذكره بالإمامة لأن الخليفة يطلب بحكم هذا الاسم عليه من استخلفه فيعلم أنه مقهور محكوم عليه فما سماه إلا بما له فيه تذكرة لأنه مفطور على النسيان والسهو والغفلة فيذكره اسم الخليفة لمن استخلفه فلو جعله إماما من غير أن يسميه خليفة مع الإمامة ربما اشتغل بإمامته عمن جعله إماما بخلاف خلافته لأن الإمامة ليست لها قوة التذكير في الخلافة فقال في الجماعة الكمل جَعَلَكُمْ خَلائِفَ في الْأَرْضِ فوقع هذا في مسموعهم فتصرفوا في العالم بحكم الخلافة وقال لإبراهيم عليه السلام بعد أن أسمعه خلافة آدم ومن شاء الله من عباده إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً لما علم إن الخلافة قد أشربها فلا يبالي بعد ذلك أن يسميه بأي اسم شاء كما سمي يحيى بسيد ولما عرفه العارفون به تميزوا عمن عرفه بنظره فكان لهم الإطلاق ولغيرهم التقييد فيشهده العارفون به في كل شي‏ء أو عين كل شي‏ء ويشهده من عرفه بنظره منعزلا عنه ببعد اقتضاه له تنزيهه فجعل نفسه في جانب والحق في جانب فيناديه من مكان بعيد ولما كانت الخلافة تطلب الظهور بصورة من استخلفه والذي جعله خليفة عنه ذكر عن نفسه أنه عَلى‏ صِراطٍ مُسْتَقِيمٍ فلا بد أن يكون هذا الخليفة على صراط فنظر في الطرق فوجدها كثيرة منها صِراطِ الله ومنها صِراطِ الْعَزِيزِ ومنها صراط الرب ومنها صراط محمد صَلَّى اللهُ عَليهِ وسَلَّم ومنها صراط النعم وهو صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ وهو قوله لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً فاختار هذا الإمام المحمدي سبيل محمد صَلَّى اللهُ عَليهِ وسَلَّم وترك سائر السبل مع تقريرها وإيمانه بها ولكن ما تعبد نفسه إلا بصراط محمد صَلَّى اللهُ عَليهِ وسَلَّم ولا تعبد رعاياه إلا به ورد جميع الأوصاف التي لكل صراط إليه لأن شريعته عامة فانتقل حكم الشرائع كلها إلى شرعه فشرعه يتضمنها ولا تتضمنه فمنها صِراطِ الله وهو الصراط العام الذي عليه تمشي جميع الأمور فيوصلها إلى الله فيدخل فيه كل شرع إلهي وموضوع عقلي فهو يوصل إلى الله فيعم الشقي والسعيد ثم إنه لا يخلو الماشي عليه إما أن يكون صاحب شهود إلهي أو محجوبا فإن كان صاحب شهود إلهي فإنه يشهد أنه مسلوك به فهو سالك بحكم الجبر ويرى أن السالك به هو ربه تعالى وربه عَلى‏ صِراطٍ مُسْتَقِيمٍ كذا تلاه علينا سبحانه وتعالى إن هودا عليه السلام قاله وهو رسول من رسل الله فلهذا كان مآله إلى الرحمة وإذا أدركه في الطريق النصب فتلك أعراض عرضت له من الشئون التي الحق فيها كل يوم وذلك قوله تعالى كُلَّ يَوْمٍ هُوَ في شَأْنٍ ولا يمكن أن يكون الأمر إلا هكذا وما أحد أكشف للأمور وأشهد للحقائق وأعلم بالطرق إلى الله من الرسل عليهم الصلاة والسلام ومع هذا فما سلموا من الشئون الإلهية فعرضت لهم الأمور المؤلمة النفسية من رد الدعوة في وجهه وما يسمعه في الحق تعالى مما نزه جلاله عنه وفي‏\n\n\nالحق الذي جاء به من عند الله وكذلك الأمور المؤلمة المحسوسة من الأمراض والجراحات والضرب في هذه الدار وهذا أمر عام له ولغيره وقد تساوى في هذه الآلام السعيد والشقي وكُلٌّ يَجْرِي فيه إِلى‏ أَجَلٍ مُسَمًّى عند الله فمنهم من يمتد أجله إلى حين موته ويحصل في الراحة الدائمة والرحمة العامة الشاملة وهم الذين لا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ ولا يخافون على أنفسهم ولا على أممهم لأنهم كانوا مجهولين في الدنيا والآخرة\nوهم الذين تغبطهم الرسل في ذلك لما هم فيه من الراحة لأن الرسل عليه السلام يخافون يوم الفزع الأكبر على أممهم وأتباعهم لا على أنفسهم ومنهم من يمتد أجله إلى دخول الجنة من العرض ومنهم من يمتد أجله في الآلام إلى أن يشفع فيه بالخروج من النار إلى الجنة ومنهم من يمتد أجله في الآلام إلى أن يخرجه الله بنفسه لا بشفاعة شافع وهم الموحدون بطريق النظر الذين ما آمنوا ولا كفروا ولا عملوا خير القول الشارع قط فإنهم لم يكونوا مؤمنين ولكنهم وحدوا الله جل جلاله وماتوا على ذلك ومن كان له علم بالله منهم ومات عليه جنى ثمرة علمه فإن قدحت له فيه شبهة حيرته أو صرفته عن اعتقاد ما كان يظن أنه علم وهو علم في نفس الأمر ثم بدا له ما حيره فيه أو صرفه عنه فعلم يوم القيامة أن ذلك حق في نفس الأمر وهو ممن أخرجه الله إلى الجنة من النار عاد عليه ثمرة ذلك العلم ونال درجته ومنهم من يمتد أجله في الآلام ممن ليس بخارج من النار وهو من أهلها القاطنين فيها ومدته معلومة عندنا ثم تعمه رحمة الله وهو في جهنم فيجعل الله له فيها نعيما بحيث إنه يتألم بنظره إلى الجنة كما يتألم أهل الجنة بنظرهم إلى النار فهؤلاء إن كان لهم علم بوجود الله وقد دخلهم شبهة في توحيد الله أو في علم مما يتعلق بجناب الله حيرته أو صرفته إلى نقيض ما كان يعتقده فإنه يوم القيامة إذا تبين له أن ذلك كان علما في نفس الأمر لا ينفعه ذلك التبين كما لم ينفع الايمان في الدنيا عند رؤية البأس فذلك العلم هو الذي يخلع على المؤمن الذي لم يكن له علم بإله له من الموحدين المؤمنين ويؤخذ جهل ذلك المؤمن الموحد ويلقي على هذا الذي هو من أهل النار فيتنعم في النار بذلك الجهل كما كان يتنعم به المؤمن الجاهل في الدنيا ويتنعم المؤمن بذلك العلم الذي خلع عليه الذي كان لهذا العالم بوجود الله لا بتوحيده وإنه لما وحده قدحت له شبهة في توحيده وعلمه بالله حيرته وصرفته وهذا آخر المدد لأصحاب الآلام في النار وبعد انقضاء هذا الأجل فنعيم بكل وجه أينما تولى ولا فرق بينه وبين عمار جهنم من الخزنة والحيوانات فهي تلدغه لما للحية والعقرب في ذلك اللدغ من النعيم والراحة والملدوغ يجد لذلك اللدغ لذة واسترقادا في الأعضاء وخدرا في الجوارح يلتذ بذلك التذاذا هكذا دائما أبدا فإن الرحمة سبقت الغضب فما دام الحق منعوتا بالغضب فالآلام باقية على أهل جهنم الذين هم أهلها فإذا زال الغضب الإلهي كما قدمنا وامتلأ به النار ارتفعت الآلام وانتشر ذلك الغضب فيما في النار من الحيوانات المضرة فهي تقصد راحتها بما يكون منها في حق أهل النار ويجد أهل النار من اللذة ما تجده تلك الحية من الانتقام لله لأجل ذلك الغضب الإلهي الذي في النار وكذلك النار ولا تعلم النار ولا من فيها إن أهلها يجدون لذة لذلك لأنهم لا يعلمون متى أعقبتهم الراحة وحكمت فيهم الرحمة وهذا الصراط الذي تكلمنا فيه هو الذي يقول فيه أهل الله إن الطرق إلى الله على عدد أنفاس الخلائق وكل نفس إنما يخرج من القلب بما هو عليه القلب من الاعتقاد في الله فالاعتقاد العام وجوده فمن جعله الدهر فوصوله إلى الله من اسمه الدهر فإن الله هو الجامع للأسماء المتقابلة وغير المتقابلة وقد قدمنا إنه سبحانه تسمى بكل اسم يفتقر إليه في قوله عز وجل في الكتاب العزيز يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ وإن أنكر ذلك فما أنكره الله ولا الحال وكذلك من اعتقد أنه الطبيعة فإنه يتجلى له في الطبيعة ومن اعتقد أنه كذا كان ما كان فإنه يتجلى له في صورة اعتقاده وتجري الأحكام كما ذكرنا من غير مزيد فافهم‏\n\n\n### [صراط العزة]\n\n\nوأما صراط العزة وهو قوله تعالى إِلى‏ صِراطِ الْعَزِيزِ الْحَمِيدِ فاعلم أن هذا صراط التنزيه فلا يناله ذوقا إلا من نزه نفسه أن يكون ربا أو سيدا من وجه ما أو من كل وجه وهذا عزيز فإن الإنسان يغفل ويسهو وينسى ويقول أنا ويرى لنفسه مرتبة سيادة في وقت غفلته على غيره من العباد فإذ ولا بد من هذا فليجتهد أن يكون عند الموت عبدا محضا ليس فيه شي‏ء من السيادة على أحد من المخلوقين ويرى نفسه فقيرة إلى كل شي‏ء من العالم من حيث إنه عين الحق من خلف حجاب الاسم الذي قال الله فيه لمن لا علم له بالأمر قُلْ سَمُّوهُمْ ولما كان الإنسان فقيرا بالذات احتجب الله له بالأسباب وجعل نظر هذا العبد إليها وهو من ورائها فأثبتها عينا ونفاها حكما مثل قوله تعالى لمحمد صَلَّى اللهُ عَليهِ وسَلَّم وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ ثم أعقب هذه الآية بقوله ولِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلاءً حَسَناً فجعل ذلك بلاء أي اختبارا وهذا الصراط العزيز الذي ليس لمخلوق قدم في العلم به فإنه صراط الله الذي عليه ينزل إلى خلقنا وعليه يكون معنا أينما كنا وعليه نزل من العرش إلى السماء الدنيا وإلى الأرض وهو قوله‏\nوهُوَ الله في السَّماواتِ وفي الْأَرْضِ وعليه يقرب من عبده أضعاف ما يتقرب إليه عبده إذا سعى إليه بالطريق التي شرع له فهو يهرول إليه إذا رآه مقبلا ليستقبله تهمما بعبده وإكراما له ولكن على صراط العزة وهو صراط نزول لا عروج لمخلوق فيه ولو كان لمخلوق فيه سلوك ما كان عزيزا وما نزل إلينا إلا بنا فالصفة لنا لا له فنحن عين ذلك الصراط ولذلك نعته بالحميد أي بالحامد المحمود لأن فعيل إذا ورد يطلب اسم الفاعل والمفعول فأما إن يعطي الأمرين معا مثل هذا وإما أن يعطي الأمر الواحد لقرينة حال وقد أثنى على نفسه فهو الحامد المحمود وأعظم ثناء أثنى به على نفسه عندنا كونه خلق آدم على صورته وسماه بأمهات الأسماء التي يدخل كل اسم تحت إحاطتها ولذلك‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم أنت كما أثنيت على نفسك‏\n\n\nفأضاف النفس الكاملة إليه إضافة ملك وتشريف لما\n\n\nقال من عرف نفسه عرف ربه‏\n\n\nفكل ثناء أثنى الله به على الإنسان الكامل الذي هو نفسه لكونه أوجده على صورته كان ذلك الثناء عين الثناء على الله بشهادة رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وتعريفه إيانا في‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم أنت كما أثنيت على نفسك‏\n\n\nأي كل ما أثنيت به على من خلقته على صورتك هو ثناؤك عليك ولما كان الإنسان الكامل صراط العزيز الحميد لم يكن للصراط أن يسلك فيه ولا يتصف الصراط بالسلوك فلهذا سماه بالعزيز أي ذلك ممنوع لنفسه فالحق سبحانه يختص بالنزول فيه كما أخبر عن نفسه من النزول والهرولة والعبد العارف على الحقيقة ما يسلك إلا في الله فالله صراطه وذلك شرعه‏\n\n\n> به رباطي وبنا رباطه *** فهو صراطي وأنا صراطه‏\n\n\n> فانظر مقالي فهو قول صادق *** محكم محقق مناطه‏\n\n\n> فهو حبيبي وأنا به فقد *** حواه قلبي فإنا فسطاطه‏\n\n\n> عز فما تدركه أبصارنا *** لقربه فقد طوى بساطه‏\n\n\n> فبعده لقربه ليس سوى *** هذا وما قد قلته استنباطه‏\n\n\nفهو على صراط عزيز لأنه الخالق فلا قدم لمخلوق فيه أروني ما ذا خلق الذين من دونه لا يجدونه أصلا لا علما ولا عينا بَلِ الظَّالِمُونَ في ضَلالٍ مُبِينٍ لأنه كل ما علم فقد بان والله تعالى أخرجنا من ظلمة العدم إلى نور الوجود فكنا نورا بإذن ربنا إِلى‏ صِراطِ الْعَزِيزِ الْحَمِيدِ فنقلنا من النور إلى ظلمة الحيرة ولهذا إذا سمعناه يثني على نفسه فنرى ذلك في نفوسنا وإذا أثنى علينا فنرى ما أثنى به علينا هو ثناؤه على نفسه ثم ميزنا عنه وميز نفسه عنا ب لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وبما علم وجهلناه وبما نحن عليه من الذلة ويتعالى عن هذا الوصف في نفسه فنقول نحن هو ما نحن هو بعد ما قلنا إذ أخرجنا من الظلمات إلى النور هو هو ونحن نحن فتميزنا فلما جاء بالثناء بعد وجودنا ثناء منه على نفسه وعلينا وكلفنا بالثناء عليه أوقفنا في الحيرة فإن أثنينا عليه بنا فقد قيدناه وإن أطلقناه كما\n\n\nقال لا أحصي ثناء عليك‏\n\n\nفقد قيدناه بالإطلاق فميزناه ومن تقيد فلا يوصف بالغنى فإن التقييد يربطه إذ قد أدرك المحدث إطلاقه تعالى وقد قال عن نفسه إنه غَنِيٌّ عَنِ الْعالَمِينَ فحيرنا فلا ندري ما هو ولا ما نحن فما أظن والله أعلم أنه أمرنا بمعرفته وأحالنا على نفوسنا في تحصيلها إلا لعلمه أنا لا ندرك ولا نعلم حقيقة نفوسنا ونعجز عن معرفتنا بنا فنعلم أنا به أعجز فيكون ذلك معرفة به لا معرفة\n\n\n> وغير هذا فلا يكون *** فإنه ظاهر مبين‏\n\n\n> فاصغ إلى قولنا تجده *** علما وقد جاءك اليقين‏\n\n\nفالجهل صفة ذاتية للعبد والعالم كله عبد والعلم صفة ذاتية لله فخذ مجموع ما أشرت إليه في هذا تجده الصراط العزيز\n\n\n### [صراط الرب‏]\n\n\nوأما صراط ربك فقد أشار إليه تعالى بقوله فَمَنْ يُرِدِ الله أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ ومن يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّما يَصَّعَّدُ في السَّماءِ يقول\n\n\nكأنما يخرج عن طبعه والشي‏ء لا يخرج عن حقيقته كَذلِكَ يَجْعَلُ الله الرِّجْسَ عَلَى الَّذِينَ لا يُؤْمِنُونَ وهذا فأشار إلى ما تقدم ذكره صِراطُ رَبِّكَ مُسْتَقِيماً وما ذكر إلا إرادته للشرح والضيق فلا بد منهما في العالم لأنه ما يكون إلا ما يريد وقد وجد ثم وصف نفسه يعني بالغضب والرضاء والتردد والكراهة ثم أوجب فقال ومع الكراهة فلا بد له من لقائي فهذا عين قوله كَأَنَّما يَصَّعَّدُ في السَّماءِ فهو كالجبر في الاختيار فمن ارتفع عنه أحد الوصفين من عباد الله فليس بكامل أصلا ولذا قال في حق الكامل ولَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ فَاصْبِرْ\nوهو الصبور على أذى خلقه وسمي هذا الصراط صراط الرب لاستدعائه المربوب وجعله مستقيما فمن خرج عنه فقد انحرف وخرج عن الاستقامة ولهذا شرع لنا الود في الله والبغض في الله وجعل ذلك من العمل المختص له ليس للعبد فيه حظ إلا ما يعطيه الله من الجزاء عليه وهو أن يعادي الله من عادى أولياءه ويوالي من والاهم فالسالك على صراط الرب هو القائم بالصفتين ولكن بالحق المشروع له لله لا لنفسه فإن الله لا يقوم لأحد من عباده إلا لمن قام له ولهذا قال ولا يَخافُونَ لَوْمَةَ لائِمٍ وحق الله أحق بالقضاء من حق المخلوق إذا اجتمعا فإنه ليس لمخلوق حق إلا بجعل الله فإذا تعين الحقان في وقت ما بدأ العبد الموفق بقضاء حق الله الذي هو له ثم أخذ في أداء حق المخلوق الذي أوجبه الله وهذا خلاف ما عليه اليوم الفقهاء في الوصية والدين فإن الله تعالى قدم الوصية على الدين والوصية حق الله وقال صَلَّى اللهُ عَليهِ وسَلَّم حق الله أحق أن يقضى‏\n\n\nفمن سامح في حق الله عاد عليه عمله فيسامح في حقه فإن تكلم قيل له كذلك فعلت فأجن ثمرة غرسك وصراط الرب لا يكون إلا مع التكليف فإذا ارتفع التكليف لم يبق لهذا الصراط عين وجودية ولهذا يكون المال إلى الرحمة وأزاله حكم الغضب الإلهي في العاصين وقول هود عليه السلام إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ يعني فيما شرع مع كونه تعالى آخذا بنواصي عباده إلى ما أراد وقوعه منهم وعقوبته إياهم مع هذا الجبر فاجعل بالك وتأدب واسلك سواء السبيل‏\n\n\n### [صراط المنعم‏]\n\n\nوأما صراط المنعم وهو صراط الذين أنعم الله عليهم وهو قوله تعالى شَرَعَ لَكُمْ من الدِّينِ ما وَصَّى به نُوحاً والَّذِي أَوْحَيْنا إِلَيْكَ وما وَصَّيْنا به إِبْراهِيمَ ومُوسى‏ وعِيسى‏ وذكر الأنبياء والرسل ثم قال أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ وهذا هو الصراط الجامع لكل نبي ورسول وهو إقامة الدين وأن لا يتفرق فيه وأن يجتمع عليه وهو الذي بوب عليه البخاري باب ما جاء أن الأنبياء دينهم واحد وجاء بالألف واللام في الدين للتعريف لأنه كله من عند الله وإن اختلفت بعض أحكامه فالكل مأمور بإقامته والاجتماع عليه وهو المنهاج الذي اتفقوا عليه وما اختلفوا فيه من الأحكام فهو الشرعة التي جعل الله لكل واحد من الرسل قال تعالى لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً ولَوْ شاءَ الله لَجَعَلَكُمْ أُمَّةً واحِدَةً فلم تختلف شرائعكم كما لم يختلف منها ما أمرتم بالاجتماع فيه وإقامته فلما كان الاختلاف منه وهو أهل العدل والإحسان وكان في الناس الدعوى في نسبة أفعالهم إليهم واختيارهم فيما اختاروه ولم يسندوا الأمر إلى أهله وإلى من يستحقه نزل الحكم الإلهي على الرسل بكون هذا سيئا وهذا حسنا وهذا طاعة وهذا معصية ونزل الحكم الإلهي على العقول بأن هذا في حق من لا يلائم طبعه ومزاجه أو يوافق غرضه حسن وهذا الذي لا يوافق غرضه ولا يلائم طبعه ومزاجه ليس بحسن ولم يسندوا الأمر إلى عين واحدة فجوزوا بما جوزوا لهذا الأمر فعدل فيما حكم به من الجزاء بالسوء وأحسن بعد الحكم ونفوذه بما آل إليه عباده من الرحمة ورفع الأمور الشاقة عليهم وهي الآلام فعمت رحمته كل شي‏ء\n\n\n### [الصراط الخاص وهو صراط النبي ص‏]\n\n\nوأما الصراط الخاص وهو صراط النبي صَلَّى اللهُ عَليهِ وسَلَّم الذي اختص به دون الجماعة وهو القرآن حبل الله المتين وشرعه الجامع وهو قوله وأَنَّ هذا صِراطِي مُسْتَقِيماً فَاتَّبِعُوهُ ولا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ يعني هذا الصراط المضاف إليه وذلك أن محمدا صَلَّى اللهُ عَليهِ وسَلَّم كان نبيا وآدم بين الماء والطين وهو سيد الناس يوم القيامة بإخباره إيانا بالوحي الذي أوحى به إليه وبعثته العامة إشعارا بأن جميع ما تقدمه من الشرائع بالزمان إنما هو من شرعه فنسخ ببعثته منها ما نسخ وأبقى منها ما أبقى كما نسخ ما قد كان أثبته حكما ومن ذلك كونه أوتي جوامع الكلم والعالم كلمات الله فقد آتاه الله الحكم في كلماته وعم وختم به الرسالة والنبوة كما بدأ به باطنا ختم به ظاهرا فله الأمر النبوي من قبل ومن بعد فورثته الذين لهم الاجتهاد في نصب الأحكام بمنزلة الرسل الذين كانوا قبله بالزمان فمن ورث محمدا صَلَّى اللهُ عَليهِ وسَلَّم في جمعيته فكان له من الله تعريف بالحكم وهو مقام أعلى من الاجتهاد وهو أن يعطيه الله بالتعريف الإلهي أن حكم الله الذي جاء به رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في هذه المسألة هو كذا فيكون في ذلك الحكم بمنزلة من سمعه من رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وإذا جاءه الحديث عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم رجع إلى الله فيه فيعرف صحة الحديث من سقمه سواء كان الحديث عند أهل النقل من الصحيح أو مما تكلم فيه فإذا عرف فقد أخذ حكمه من الأصل وقد أخبر أبو يزيد بهذا المقام أعني الأخذ عن الله عن نفسه أنه ناله فقال فيما روينا عنه يخاطب علماء زمانه أخذتم علمكم ميتا\nعن ميت وأخذنا علمنا عن الحي الذي لا يموت ولنا بحمد الله في هذا المقام ذوق شريف فيما تعبدنا به الشرع من الأحكام وهذا مما بقي لهذه الأمة من الوحي وهو التعريف لا التشريع وأما أهل الاجتهاد فأحكامهم تشريع الشرع إذا أخطئوا فإن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم هو المقرر لذلك الحكم فما هو تشريع لهم وإنما هو تشريع رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وإذا أصاب المجتهد فهو صاحب نقل شرع كل ذلك في نفس الأمر فإن المخطئ من المجتهدين والمصيب واحد لا بعينه لكن المصيب في نفس الأمر ناقل والمخطئ في نفس الأمر مقرر حكم مجهول لم يعلم إلا عند نظر هذا المجتهد فهو معلوم عند الله قبل كونه فما قرر الشارع وهو الرسول إلا الحكم المعين المعلوم عند الله وما هو عنده بمعلوم على التفصيل والتعيين فكان حكم المجتهد المخطئ تشريعا للتشريع وأهل الله ما لهم حكم في الشرع إلا ما هو المحكوم به على التعيين عند رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهم الورثة على الحقيقة فإن الوارث لا يرث إلا ما كان ملكا للموروث عنه إذا مات عنه وحكم المجتهد المخطئ ما هو ملك له عينه حتى يورث عنه فليس بوارث لأن ما عنده سوى تقرير ما أداه إليه نظره ذلك أباحه له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فهو كالعصبة لا نصيب لهم في الميراث على التعيين إنما لهم ما بقي بعد إلحاق الفرائض بأهلها وكتوريث أولي الأرحام والمسلمين بعد أخذ الفرائض فإن مات عن غير صاحب فريضة كرسول ونبي مات وما اتبعه واحد فيحشر مفردا فقد يرثه في خلقه أو في حاله لا في حكمه من هذه الأمة من صادف ذلك الحال أو الحكم وأما الايمان به وقد آمن به كل من آمن بمحمد صَلَّى اللهُ عَليهِ وسَلَّم فأمة محمد صَلَّى اللهُ عَليهِ وسَلَّم المؤمنون به أتباع كل نبي وكل كتاب وكل صحيفة جاء أو نزل من عند الله في الايمان به لا بالعمل بالحكم فما بقي نبي إلا وقد أومن به فالنبي محمد صَلَّى اللهُ عَليهِ وسَلَّم له الإمامة والتقدم وجميع الرسل والأنبياء خلفه في صف ونحن خلف الرسل وخلف محمد ومن الرسل من يكون له صورتان في الحشر صورة معنا وصورة مع الرسل كعيسى وجميع الأمم خلفنا غير إن لنا صورتين صورة في صف الرسل عليه السلام وليست إلا لعلماء هذه الأمة وصورة خلف الرسل من حيث الايمان بهم وكذلك سائر الأمم لهم صورتان صورة يكونون بها خلفنا وصورة يكونون بها خلف رسلهم فوقتا يقع نظر الناظر على صورهم خلفنا ووقتا خلف رسلهم ووقتا على المجموع فهذه أحوال العلماء في الآخرة في حشرهم وأما ورثة الأفعال فهم الذين اتبعوا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في كل فعل كان عليه وهيأة مما أبيح لنا اتباعه حتى في عدد نكاحه وفي أكله وشربه وجميع ما ينسب إليه من الأفعال التي أقامه الله فيها من أوراد وتسبيح وصلاة لا ينقص من ذلك فإن زاد عليها بعد تحصيلها فما زاد عليها إلا من حكم قوله صَلَّى اللهُ عَليهِ وسَلَّم فهذه وراثة أفعاله وأما وراثة أحواله فهو ذوق ما كان يجده في نفسه في مثل الوحي بالملك فيجد الوارث ذلك في اللمة الملكية ومن الملك الذي يسدده ومن الوجه الخاص الإلهي بارتفاع الوسائط وأن يكون الحق عين قوله وأن يقرأ القرآن منزلا عليه يجد لذة الإنزال ذوقا على قلبه عند قراءته فإن للقرآن عند قراءة كل قارئ في نفسه أو بلسانه تنزلا إلهيا لا بد منه فهو محدث التنزل والإتيان عند قراءة كل قارئ أي قارئ كان غير إن الوارث بالحال يحس بالإنزال ويلتذ به التذاذا خاصا لا يجده إلا أمثاله فذلك صاحب ميراث الحال وقد ذقناه حالا بحمد الله وهو الذي قال فيه أبو يزيد لم أمت حتى استظهرت القرآن وهو وجود لذة الإنزال من الغيب على القلوب وما عدا هؤلاء فإنما يقرءون القرآن من خيالهم فهم يتخيلون صور حروفه المرقومة إن كان حفظ القرآن من المصاحف والألواح أو يتخيلون صور حروف ما تلقونه من معلمهم هذا إذا كانوا عاملين به وأما إذا قرءوه من غير إخلاص فيه فلا يتجاوز حناجرهم أي لا يقبل الله منه شيئا فيبقى في محل تلاوته وهو مخرج الصوت فلا يقرأ القرآن من قلبه إلا صاحب التنزل وهو الذوق الميراثي فمن وجد ذلك فهو صاحبه يعرف ذلك عند وجوده إياه فلا يحتاج فيه إلى معرف فإنه‏\n\n\nيفرق عند ذلك بين قراءته من خياله وبين قراءته عن تنزيل ربه مشاهدة وما ثم أمر آخر لنبي أو رسول يقع فيه ميراث إنما هو قول أو فعل أو حال فالوارث الكامل من جمع والوارث الناقص من اقتصر على بعض هذه المراتب واعلم أن هذا المنزل هو منزل من اتصف بالخلة من الأنبياء عليه السلام فمن حصل له حصر له نصيب من الخلة الإلهية وضرب له فيها بسهم\n\n\nوالكلام فيها طويل لا يفي الوقت بتفصيله‏\nفلنذكر ما فيه من العلوم كسائر المنازل فنقول فيه علم رحمة الخلان والفرق بينها وبين رحمة المحبوبين والأبناء والآباء والمستلذات كلها وفيه علم حلاوة التنزل وأين يحس بها من نفسه من ينزل عليه القرآن جديدا عند تلاوته وفيه علم الأغيار والأسرار والأنوار والهداية وأنواع المحامد والمراتب الخاصة بكل نفس مما لا يقع لأحد معه فيها اشتراك وذلك إنا نعلم أنه لكل نفس صفة أو حقيقة تختص بها وتتميز بها عن كل شي‏ء في العالم لا بد من ذلك فإذا جاءها الأمر الإلهي من طريق تلك الحقيقة الخاصة فإن ذوقه ذلك مقصور عليها وهذا أدنى حظ النفس من مقام العزة الإلهية فإنه لكل نفس وإن لم تشعر به وهو كفعل الأمور الطبيعية بالخاصية كالمغناطيس وأشباهه غير أن الخاصية في الأمور الطبيعية على نوعين بالإفراد وبالمجموع وفي المزاج الخاص فإن الخواص الطبيعية ما تسري في كل مزاج ولا في كل صورة وخاصية أهل الله إذا وقفوا عليها ذوقا من أنفسهم سرى حكمها في كل ما في العالم وفيه علم الملكوت والمشاهدة ورؤية المعدوم في حال عدمه من غير تخيل ولا تمثل ولا بإدراك خيال بل بالبصر الحسي وفيه علم أسباب التحير والحيرة وفيه علم ما يعلم الإنسان إلا ما يعطيه استعداده إذا استعمله أو فجأه لا يقبل فوق ذلك فإنه ليست له قوة القبول وفيه علم الرسل والرسالة وفيه علم إن الإنسان عالم بالذات إلا أنه ينسى فكل علم يحصل له إنما هو تذكر ولا يشعر به أنه تذكر إلا أهل الله وفيه علم البلايا والنعم وفيه علم الفرقان في التعريف بين التقرير والتوبيخ وما يكون على طريق المنة أو المطالبة وفيه علم صفات التنزيه في الأفعال وأن كل طلب في العالم أو من كل طالب إنما هو طلب ذاتي ما ثم طلب عارض لا يكون بالذات هذا لا يكون وإنما يعرض للشخص أمر ما لم يكن عنده فهذا الأمر الذي حصل عنده هو الذي يكون له الطلب الذاتي للمطلوب وانحجب الناس بمن قام به ذلك الأمر العارض وهو الذي يسمونه طالبا وليس الطالب إلا ذلك الأمر فالطلب له ذاتي والشخص الذي قام به هذا الأمر مستخدم له إذ قد كان موجودا وهو فاقد لهذا الطلب فعلمنا أنه طلب مستخدم في أمر ما أوجب عليه هذا الأمر الذي حل به فالطلب ذاتي لذلك الأمر وقد استخدم في تحصيله هذا الشخص الذي نزل به ولا شعور للناس بذلك وفيه علم النظر والتفكر والاعتبار وأن العالم بعضه لبعض عبرة وفيه علم ما يختص به الله من العلوم المتفرقة في العالم وذلك جمعيتها لا يعلم ذلك إلا الله هذا فيما دخل في الوجود منه مع علمه بما لم يدخل في الوجود ولا اتصف بالعلم به مخلوق فله من علم الدنيا علم الجمعية بما أضيف إليه من علم الأخرى ولا بد من ذلك وفيه علم الاستدلال بالمحدث على القديم وما يحصل في النفس من ذلك فإن القديم لا يحصل في النفس وإن حصل المحدث فما هو المطلوب وكل ما حصل محدث وفيه علم ما يكون التوكل فيه شكر الله تعالى وفيه علم من قام به معنى أوجب له اسما يستحقه ومن هنا تعرف أسماء الله الحسنى من أسمائه فإن أسماء الله في الكون عن آثار هذه النفوس وأسماء الكون عن المعاني القائمة به فالحق منزه في أسمائه واحد العين والكون متكثر بأسمائه لقيام المعاني به التي أوجبت له الأسماء وفيه علم أسباب الميراث وفيه علم من ظفر ومن خاب والكل طالب وفيه علم مشاهدة الموت مع كونه نسبة عدمية وفيمن يحكم وأنه لا حكم للموت فيمن لا تركيب فيه وكل مركب بالوضع فإنه يقبل الموت فإن لم يمت فذلك لأمر آخر اقتضته المشيئة الإلهية وقد يجعل له سببا ظاهرا أو معلوما وقد لا يكون إلا حكم عين المشيئة خاصة وفيه علم الحكم على الله بما يقتضيه من حيث ما هو ممكن لا بما هو الله عليه وقد ورد في القرآن من ذلك كثير ولكن لا يعلم معنى ذلك إلا العلماء بما تعطيه حقائق الموجودات والعالمون بماهية الأشياء وفيه علم يوم القيامة والحشر والنشر وما يختص به ذلك اليوم من الحكم ومن هو الحاكم فيه ومراتب المتصرفين فيه وفيه علم الأمر المقتضي في ذلك اليوم ما هو وفيه علم تشبيه الإنسان بالنبات من حيث ما هو شجر لا من حيث ما هو نجم ومن هنا نهى أن يقرب الشجرة آدم فهو تنبيه على نهيه أن يقرب أغراض نفسه وهواها وهو قوله ونَهَى النَّفْسَ عَنِ الْهَوى‏ وهو إرادة النفس ما لم يشرع لها العمل به أو تركه وفيه علم التمكين والثبات على علم ما تعطيه الحقائق في القول والفعل وفيه علم ما يحمد من التبديل والتلوين وما يذم وفيه علم الإمهال والإهمال المقصود وفيه علم حكمة التسخير الكوني والإلهي وفيه علم أفراد ذات الحق بالألوهة وفيه علم الاقتداء وبمن ينبغي أن يقتدي وفيه علم تقييد الثناء بالحال‏\nوإطلاقه بالقول وفيه علم ما يظهر في الوجود إنه معلوم وظاهر عن علم متعلق به أوجب له ذلك الظهور وفيه علم كون الإنسان مع علمه أن الله لا يتقيد بالجهات وهو أقرب من حَبْلِ الْوَرِيدِ وهو مع هذا كله يتوهم فيه جهة الفوق والتحديد لا تعطيه نشأته أن يخلو عن حكم الوهم على عقله فيعقل حقيقة الأمر مع حكم وهمه من غير تأخر فيجمع في الآن بين حكم العقل والوهم كما جمع بين الأمور التي كان بها إنسانا كذلك يجمع بين أحكامها وفيه علم مراتب القرآن في الناس فيكون في حكم طائفة على غير حكمه في طائفة أخرى فهذا بعض ما يحوي عليه هذا المنزل من العلوم مجملا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Seventy: Concerning the Knowledge of the Station of Increase (Manzil al-Mazīd), the Secret and Two Secrets of Existence (al-Wujūd) and Transformation (al-Tabaddul), which is from the Muhammadan Presence (al-Haḍra al-Muḥammadiyya).\n\nThe form of increase in deeds, O man,\nIs like the increase in bestowal.\n\nNone knows it save men of intellect,\nNor can number or limit encompass it.\n\nIn its folding, Allah has a subtle plan (makr) for the discerning observer,\nAnd in His subtle plan, we find hope.\n\nFor it issues from the secret of His Presence,\nAnd nothing protects save Knowledge (al-ʿIlm) and Action (al-ʿAmal).\n\nIndeed, the branches have a root that clarifies them\nFor those who observe; by which the example has come to us.\n\n### That Wisdom is in All Things\n\nKnow that the wisdom (al-ḥikma) in all things and all affairs belongs only to the Levels (al-Marātib), not to the Entities (al-Aʿyān). The greatest of the Levels is Divinity (al-Ulūhiyya), and the lowest is Servitude (al-ʿUbūdiyya). Thus, there are only two Levels: Lord and servant. However, Divinity has rulings (aḥkām), each of which necessitates a rank (rutba).\n\nEither that ruling subsists in the God (al-Ilāh), in which case He is the one who rules upon Himself—and this is the ruling of the Level in meaning—and only the possessor of the Level rules by that ruling, because the Level is not the existence of an entity (wujūd ʿayn); rather, it is an intelligible matter (amr maʿqūl) and a known, decreed relationship (nisba maʿlūma maḥkūm bihā). The rulings belong to it. This is one of the most astonishing matters: the effect of the non-existent (taʾthīr al-maʿdūm). Or, that ruling subsists in something other than Him in existence (al-mawjūd), either as an existential matter or as a relationship, and only the Levels affect.\n\nSimilarly, Servitude has rulings, each of which is a rank. Either that ruling subsists in the servant himself, so none rules over him but himself—as if he is a deputy for the Level that necessitated this ruling for him—or he rules over his like, or over another. In the case of the servant, there is only a like or an other. But in the case of the God, there is only an other, not a like, for He has no like.\n\nAs for the rulings that revert to Him from the rulings of the Rank: the necessity of His existence by His Essence (wujūb wujūdihi li-dhātihi), the decree of His independence (ghināʾ) from the world (al-ʿālam), and His self-imposition of supporting the believers with Mercy (al-Raḥma) and all the attributes of Majesty (nuʿūt al-Jalāl) that necessitate Transcendence (al-Tanzīh) and the negation of likeness (nafy al-mumāthala). As for the rulings that inherently seek the other (ṭalab al-ghayr), such as all the attributes of Creation (nuʿūt al-Khalq)—which are the attributes of Generosity (al-Karam), Favor (al-Ifḍāl), Bounty (al-Jūd), and Bringing into Existence (al-Ījād)—there must be someone *in* whom and *upon* whom [the act occurs]. Thus, the Other is necessary, and the Other is none other than the servant. There is no effect among these that seeks the servant unless it necessarily has an origin in the God, necessitated by the Level. This is inevitable. And He, Exalted is He, is distinguished by rulings from this Level that do not seek Creation, as we have established.\n\nThe Level of the servant (marṭabat al-ʿabd) seeks, by virtue of his being a servant, rulings that subsist only in the servant by virtue of his being a specific servant. These are general in every servant by virtue of his essence. Then, these rulings have further rulings that seek the existence of likes (al-amthāl) and the existence of the Real (al-Ḥaqq). For instance, if the servant is a deputy (nāʾib) and vicegerent (khalīfa) for the Real, or a vicegerent for a servant like himself, the one who appointed him must bestow upon him some of his own attributes, as required by the rank of vicegerency (marṭabat al-khilāfa). For if he does not appear in the form of the one who appointed him, his ruling will not be effective among his likes. His appearance in the form of the one who appointed him is nothing other than what the rank of Lordship (marṭabat al-siyāda) grants. Thus, the rank of Servitude and the rank of Vicegerency grant him rulings that he can only exercise upon his Lord and the one who appointed him, just as he has rulings that he only exercises upon those over whom he was appointed vicegerent.\n\nVicegerency is minor (ṣughrā) and major (kubrā). The greatest, than which there is none greater, is the Supreme Imamate (al-Imāma al-Kubrā) over the world. The smallest is his vicegerency over himself. What lies between them is called minor in relation to what is above it, and major in relation to what is below it.\n\nAs for the effect of the servant's rank upon his Lord, it is the Lord's attending to the interests of His servant so that the ruling of Lordship remains upon Him. Whoever fails to attend to the interests of his servant has been deposed by the Level, for the Levels inherently possess the power of appointment and deposition (al-tawliya wa-al-ʿazl) by Essence (bi-al-dhāt), not by designation, regardless of who holds them.\n\nAs for the effect the servant has, by virtue of being a vicegerent, upon those over whom he is appointed—whoever the appointer may be—it is that the entity of the one over whom he is appointed remains, so that his ruling may be executed upon him. If this were not the case, he would not be a vicegerent, and the claim would not be true if there were no one *upon* whom or *in* whom [the ruling applies]. For the vicegerent must have a place where he resides so that he may be sought for needs. Do you not see that for the One who does not accept place, the Level necessitated that He create a heaven, which He made His Throne (ʿArsh), and then mentioned that He established Himself upon it (istawā ʿalayhi), so that He may be sought through supplication and the asking of needs? The servant should not remain bewildered, not knowing where to turn, because Allah created the servant as possessing direction (dhā jiha). Thus, the Real attributed the quality of above-ness (al-fawqiyya) to Himself, through the heaven and the Throne, and also the encompassing of all directions, by His saying: <<فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله>> (So wherever you turn, there is the Face of Allah), and by His saying: \"Our Lord descends to the lowest heaven,\" saying, \"Is there any repentant? Is there any supplicant? Is there any seeker of forgiveness?\"\n\nAnd His Messenger said about Him:\nIndeed, Allah is in the direction of the worshipper's prayer.\n\nAll this is the ruling of the Levels, if you understand. If the Levels were removed from the world (al-ʿālam), the Entities (al-Aʿyān) would have no existence whatsoever. Understand this.\n\nIf the Higher wishes to be known by the Lower—since the Lower has no footing in the High, but the Higher encompasses the Lower—the Higher must introduce Himself to the Lower. This is only possible if the Higher descends to the Lower, because the Lower cannot ascend to Him, for its entity would cease to exist, as it has no footing in the High. The Lower always remains fixed in its rank, while the Higher has the capacity for descent and for remaining fixed in its rank. And from His remaining fixed in His rank, He decrees descent upon Himself. Thus, He is fixed in His high rank even in the act of descending.\n\nThis is what Allah did with His ambassadors (sufarāʾ), who are His Messengers (rusul) to His creation from His creation. He did not send a Messenger <<إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ>> (except with the tongue of his people, that he might make [the message] clear to them). If He sent him generally, the general populace was his people. He granted him the comprehensive words (jawāmiʿ al-kalim), which is the decisive speech (faṣl al-khiṭāb). Only Adam was perfected by the Names (al-Asmāʾ), and Muhammad (peace and blessings be upon him) was perfected by the comprehensive words. He descended to them with the message of their Lord, in their language and their manner. He only called them by means of themselves. Furthermore, the rulings (al-aḥkām) He legislated for them were only those they were already upon. He only added to this the fact that these rulings came from Allah, so that they might rule by them as a means of drawing near (qurba) to Allah, thereby inheriting happiness (al-saʿāda) with Allah.\n\nWe said that the rulings He legislated for them were only those they were already upon because no nation was ever devoid of a law (nāmūs) upon which they operated for the benefit of their affairs. These are only five: the obligatory (wājib) imposed upon them by their leader and law-setter—which is the obligatory and the prescribed (farḍ) according to us—as well as the recommended (mandūb), the forbidden (maḥẓūr), the disliked (makrūh), and the permissible (mubāḥ). They must have boundaries in rulings at which they stop. The Divine Law (al-Sharʿ) only came to them from Allah with what they were already upon, based on their own judgment—which, in reality, was placed in their souls by Allah without their awareness. For this reason, they received a reward from Allah for it, without knowing it. But when they returned to Him, they found that reward with Him.\n\nSince we saw that He did not send a Messenger <<إِلَّا بِلِسانِ قَوْمِهِ>> (except with the tongue of his people), we knew that when He wished us to know Him, He only introduced Himself to us through what we are upon, not through what His Essence (Dhāt) necessitates. Although His introduction of Himself to us through us is something necessitated by His Essence, the necessity of His Essence differs between that by which He is distinguished from us and that by which He introduces Himself to us.\n\nSince Creation (al-Khalq) is composed of many Levels, and the most perfect Level within it is the Human (al-Insān), every class of the world is a part (juzʾ) when viewed in relation to the perfection of the Human; even the animal human is a part of the Perfect Human (al-Insān al-Kāmil). Therefore, all knowledge of Allah held by a part of the world is partial knowledge, except for the Human, whose knowledge of Allah is the knowledge of the entire world concerning Allah. His knowledge of Allah is universal knowledge (ʿilm kullī), not the knowledge of the whole (ʿilm kull), for if it were the knowledge of the whole, he would not have been commanded to say: <<رَبِّ زِدْنِي عِلْماً>> (My Lord, increase me in knowledge). Do you think that knowledge is of something other than Allah? No, by Allah, but of Allah.\n\nThe Perfect Human was created upon His Image (ṣūratihi), and by this Image, he was enabled to apply all His Names (Asmāʾ) to himself, individually and partially. The totality of the Names cannot be applied to him simultaneously in a single word, so that the Lord may be distinguished from the Perfect Servant. There is no Name among the Beautiful Names (al-Asmāʾ al-Ḥusnā)—and all of Allah’s Names are beautiful—that the Perfect Servant cannot claim for himself, just as he can call upon his Lord by it.\n\nAmong these Divine Names are those by which the Real (al-Ḥaqq) calls upon the servant as a way of praising him, such as the Names of Mercy (al-Raḥma), Gentleness (al-Luṭf), and Compassion (al-Ḥanān). And among them are those by which He calls upon him by way of censure, such as His saying, Exalted is He: <<ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ>> (Taste! Indeed, you are the mighty, the noble). This person was called by this name among his people, and the Real called him by it here in mockery, by way of blame. He said, Exalted is He: <<فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ فَسَوْفَ تَعْلَمُونَ>> (Indeed, we mock you just as you mock [us], and soon you will know).\n\nWhen the Perfect One among us was brought into existence upon the Image (al-Ṣūra), the Perfect One knew him from Himself by the perfection He granted him. The Perfect Servant was entirely the Real (Ḥaqq) and was annihilated (fanā) from his own entity within himself, because he is receptive (qābila) by his Essence (bi-dhātihi). Allah has set an example for him in the matter of love (al-maḥabba). When he loves something from the world—be it a horse, a house, a dinar, or a dirham—he only receives it with the corresponding part (al-juzʾ al-munāsib). That corresponding part of him is annihilated (fanā) due to his love for that thing, while the rest of him remains sober (ṣāḥiyan), having no ruling over it, unless he loves a person like himself, such as a slave girl or a boy. In that case, he receives him with his entire Essence (bi-dhātihi kullihā) and all his parts. When he witnesses him, he is annihilated in him completely, not just partially, and he faints (yaghshā ʿalayhi). This is because he received him with his totality.\n\nSimilarly, when the servant sees the Real (al-Ḥaqq) or imagines Him, he is annihilated in Him upon witnessing Him, because he is upon His Image (ṣūratihi), so he receives Him with his Essence (bi-dhātihi). No part of him remains sober by which he might comprehend what was annihilated in Him.\n\nLikewise, every part of the world, when the Real discloses Himself (tajallā) to it, submits to Him and is annihilated in Him, because everything that the world is, is the Image (ṣūra) of the Real, based on what He granted it. It is not valid for anything in the world to have an existence that is not the Image of the Real. Therefore, the world must be annihilated in the Real when He discloses Himself to it.\n\nThe Real is not annihilated in Creation (al-Khalq), because Creation is from the Real, but the Real is not from Creation. The relationship of the Real to Creation is like the relationship of the Human to every class of the world, excluding the human species. Reflect upon what I have mentioned to you concerning the annihilation of everything in the world from itself upon His disclosure (tajallī) to it, and that the Real is not annihilated by the witnessing of Creation. The Divine Law (al-Sharʿ) confirms the mountain crumbling (tadakduk al-jabal) and Moses (peace be upon him) fainting (ṣaʿq Mūsā) upon the Divine Theophany (al-Tajallī al-Rabbānī).\n\nWe only know of the Real (al-Ḥaqq) what we are upon. The perfect and the most perfect are within us. Allah gave everything its creation. When Allah established these blessings (niʿam) upon His servant and guided him to the path, He said: <<إِمَّا شاكِراً>> (Either grateful), in which case He increases him from them—because we said He only gave him from Himself, not absolutely—<<وَإِمَّا كَفُوراً>> (or ungrateful) for His blessings, in which case He strips them away and punishes him for that. Let man guard himself as to which path he walks, for there is no clarification after Allah’s clarification.\n\nMoses (peace be upon him) said to the Children of Israel: <<إِنْ تَكْفُرُوا أَنْتُمْ وَمَنْ فِي الْأَرْضِ جَمِيعاً فَإِنَّ اللهَ لَغَنِيٌّ حَمِيدٌ>> (If you are ungrateful, you and all those on earth, indeed Allah is Self-Sufficient, Praiseworthy). This alerts us that Allah, Exalted is He, only brought the world into existence for the world, and He only commanded them to worship Him so that they might know Him through themselves. For when one knows oneself, one knows one's Lord. Thus, the reward for knowing one's Lord is the greatest reward. That is why He said: <<إِلَّا لِيَعْبُدُونِ>> (Except that they may worship Me). They do not worship Him until they know Him. When they know Him, they worship Him with essential worship (ʿibāda dhātiyya). When He commands them, they worship Him with specific worship, while the general essential worship remains. He rewards them for this. He only created them for their own sake.\n\nFor this reason, He said of Himself that He is <<غَنِيٌّ عَنِ الْعالَمِينَ>> (Self-Sufficient above the worlds). Moses only mentioned the earth because of its perfection through the existence of everything in it, which is the Human who encompasses the realities of the world. His saying \"in the earth\" is because it is the submissive (al-dhalūl), the preserver of the station of Servitude (maqām al-ʿubūda). It is as if he said: If you are ungrateful, you and every servant of Allah, then Allah is Self-Sufficient above the worlds. For this reason, Allah made the earth the locus and station of Vicegerency (al-Khilāfa). It is as if He alluded: \"Indeed, I am placing a vicegerent in the earth\" from among them, who does not depart from his station of Servitude within himself—meaning, the rank of Vicegerency, with the attributes He commanded him to possess, does not veil him from his rank [of Servitude]. That is why We made him a vicegerent and did not mention him by the Imamate (al-Imāma), because the vicegerent, by the ruling of this Name upon him, seeks the one who appointed him, knowing that he is subjugated and ruled over. He only named him with what contains a reminder for him, because he is naturally disposed to forgetfulness (nisyān), error (sahw), and heedlessness (ghafla). The name 'vicegerent' reminds him of the one who appointed him. If He had made him an Imam without naming him a vicegerent alongside the Imamate, he might have become preoccupied with his Imamate, forgetting the one who made him Imam, unlike his vicegerency, because the Imamate does not have the power of reminder inherent in Vicegerency.\n\nHe said concerning the perfect community: <<جَعَلَكُمْ خَلائِفَ فِي الْأَرْضِ>> (He made you vicegerents in the earth). This fell upon their hearing, and they acted in the world according to the ruling of Vicegerency. He said to Abraham (peace be upon him), after letting him hear of the vicegerency of Adam and whomever Allah willed of His servants: <<إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً>> (Indeed, I am making you an Imam for mankind), knowing that he had already absorbed Vicegerency, so He did not mind naming him by any name He wished thereafter, just as John (Yaḥyā) was named 'Sayyid' (Master).\n\nWhen the Gnostics (al-ʿĀrifūn) knew Him through Him, they were distinguished from those who knew Him through speculation (naẓar). For the Gnostics, there is absolute freedom (al-Iṭlāq), and for others, restriction (al-Taqyīd). The Gnostics witness Him in everything, or as the essence of everything. Those who know Him through speculation witness Him as isolated from them by a distance necessitated by their transcendence (tanzīh) of Him. They place themselves on one side and the Real on the other, calling upon Him from a distant place.\n\nSince Vicegerency requires appearing in the form of the one who appointed him, and the One who made him vicegerent mentioned of Himself that He is <<عَلَى صِرَاطٍ مُسْتَقِيمٍ>> (upon a straight path), this vicegerent must also be upon a path. He looked at the paths and found them numerous: the Path of Allah (ṣirāṭ Allāh), the Path of the Mighty (ṣirāṭ al-ʿAzīz), the Path of the Lord (ṣirāṭ al-Rabb), the Path of Muhammad (peace and blessings be upon him), and the Path of the Favored (ṣirāṭ al-Niʿam), which is <<صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ>> (the path of those upon whom You have bestowed favor), and which is His saying: <<لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجاً>> (For each of you We have appointed a law [shirʿa] and a way [minhāj]). This Muhammadan Imam chose the way of Muhammad (peace and blessings be upon him) and abandoned the other ways, while affirming them and believing in them. However, he only commanded himself and his subjects to worship by the path of Muhammad (peace and blessings be upon him). He referred all the descriptions belonging to every path back to it, because his Law (sharīʿa) is general. Thus, the ruling of all laws transferred to his Law; his Law encompasses them, but they do not encompass his Law.\n\nAmong these is the Path of Allah (ṣirāṭ Allāh), which is the general path upon which all affairs proceed, leading them to Allah. Every divine law and every rational principle enters into it. It leads to Allah, encompassing the wretched (shaqī) and the felicitous (saʿīd). The traveler upon it is either a possessor of Divine Witnessing (shuhūd ilāhī) or veiled. If he is a possessor of Divine Witnessing, he witnesses that he is being traveled *by* (maslūk bihi), so he is a traveler by the ruling of compulsion (jabr). He sees that the one traveling him is his Lord, Exalted is He, and his Lord is <<عَلَى صِرَاطٍ مُسْتَقِيمٍ>> (upon a straight path)—thus did He, Exalted is He, recite it to us, that Hud (peace be upon him) said it, and he is a Messenger of Allah. Therefore, his ultimate destination is Mercy (al-Raḥma). If fatigue (naṣab) overtakes him on the path, those are incidental occurrences arising from the affairs (shuʾūn) in which the Real is engaged every day. That is His saying, Exalted is He: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [some] affair).\n\nIt cannot be otherwise. No one has greater unveiling (kashf), witnessing (shuhūd), or knowledge of the paths to Allah than the Messengers (peace and blessings be upon them). Yet, even they were not safe from the Divine Affairs (al-Shuʾūn al-Ilāhiyya). Painful psychological matters afflicted them, such as having their call rejected, and hearing things said about the Real, Exalted is His Majesty, which He is transcendent of, and about the Truth (al-Ḥaqq) that came from Allah. Likewise, painful sensory matters afflicted them, such as illnesses, wounds, and beatings in this world. This is a general matter for them and others. The felicitous and the wretched are equal in these pains. <<وَكُلٌّ يَجْرِي إِلَى أَجَلٍ مُسَمًّى>> (And all run [their course] to an appointed term) with Allah.\n\nFor some, their term extends until their death, and they attain permanent rest and general, comprehensive Mercy. These are those whom <<لَا يَحْزُنُهُمُ الْفَزَعُ الْأَكْبَرُ>> (the greatest terror will not grieve), and they fear neither for themselves nor for their communities, because they were unknown (majhūlīn) in this world and the Hereafter. They are those whom the Messengers envy (yaghbiṭuhum) for the comfort they are in, because the Messengers (peace be upon them) fear the greatest terror for their communities and followers, not for themselves. For some, their term extends until they enter Paradise after the Reckoning (al-ʿArḍ). For some, their term in pains extends until they are interceded for, leading to their exit from the Fire into Paradise. For some, their term in pains extends until Allah Himself removes them, not by the intercession of an intercessor. These are the Unitarians (al-Muwaḥḥidūn) by way of speculation (ṭarīq al-naẓar) who neither believed nor disbelieved, and never performed the good deeds of the Divine Law (al-Sharʿ). They were not believers, but they affirmed the Oneness of Allah, Glorious is His Majesty, and died upon that.\n\nWhoever among them possessed knowledge (ʿilm) of Allah and died upon it reaps the fruit of his knowledge. If a doubt (shubha) arose that confused him or turned him away from believing what he thought was knowledge—though it was knowledge in reality—and then on the Day of Resurrection it became clear to him that it was the truth in reality, he is among those whom Allah removes from the Fire to Paradise, and the fruit of that knowledge returns to him, and he attains its degree.\n\nFor some, their term in pains extends among those who do not leave the Fire, who are its permanent inhabitants (al-Qāṭinīn fīhā). Their duration is known to us. Then, Allah’s Mercy encompasses him while he is in Hell (Jahannam), and Allah makes a delight (naʿīm) for him therein, such that he suffers pain by looking at Paradise, just as the people of Paradise suffer pain by looking at the Fire.\n\nIf these people had knowledge of the existence of Allah, but doubt entered them concerning the Oneness of Allah (tawḥīd) or concerning a knowledge related to the Divine Presence (janāb Allāh), confusing them or turning them to the opposite of what they believed, then on the Day of Resurrection, when it becomes clear to them that it was knowledge in reality, that clarification will not benefit them, just as faith did not benefit [others] in this world upon seeing the severity [of punishment]. That knowledge is bestowed upon the believer who had no knowledge of a God, from among the believing Unitarians. The ignorance of that believing Unitarian is taken and cast upon this person who is among the people of the Fire. He enjoys delight in the Fire through that ignorance, just as the ignorant believer enjoyed delight in it in this world. And the believer enjoys delight through that knowledge which was bestowed upon him, which belonged to that knower of Allah's existence (lā bi-tawḥīdihi)—but when he affirmed His Oneness, a doubt arose concerning His Oneness, and his knowledge of Allah confused him and turned him away.\n\nThis is the last of the terms for the people of pains in the Fire. After the expiration of this term, there is delight in every aspect, wherever one turns. There is no difference between him and the permanent residents of Hell, such as the keepers (khazana) and the animals. The snake and the scorpion sting him because they find delight and comfort in that stinging, and the stung person finds pleasure (ladhdha) in that sting, a relaxation in the limbs and a numbness in the joints, enjoying it perpetually.\n\nFor Mercy (al-Raḥma) preceded Wrath (al-Ghaḍab). As long as the Real is described by Wrath, the pains remain upon the people of Hell who belong there. When the Divine Wrath ceases, as we established, and the Fire is filled by it, the pains cease. That Wrath spreads among the harmful animals in the Fire, and they seek their comfort through what they do to the people of the Fire. The people of the Fire find pleasure in that, just as the snake finds pleasure in taking vengeance for Allah due to that Divine Wrath in the Fire. The Fire and those in it do not know that its inhabitants find pleasure in that, because they do not know when comfort succeeded [the pain] and Mercy ruled over them.\n\nThis path (ṣirāṭ) we have discussed is the one concerning which the People of Allah (Ahl Allāh) say that the paths to Allah are as numerous as the breaths of creation. Every breath issues from the heart based on the heart's belief (iʿtiqād) concerning Allah. The general belief is His existence. Whoever makes Him Time (al-Dahr), his arrival to Allah is through His Name, Time, for Allah is the Gatherer of the corresponding and non-corresponding Names. We established that He, Exalted is He, named Himself with every name that is needed, in His saying, Mighty and Glorious is He, in the Noble Book: <<يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللهِ وَاللهُ هُوَ الْغَنِيُّ الْحَمِيدُ>> (O mankind, you are the poor [in need] of Allah, and Allah is the Self-Sufficient, the Praiseworthy). Even if one denies this, Allah does not deny it, nor does the state (al-ḥāl). Likewise, whoever believes He is Nature (al-Ṭabīʿa), He discloses Himself to him in Nature. Whoever believes He is such-and-such, He manifests to him in the form of his belief, and the rulings proceed as we mentioned, without increase. Understand this.\n\n### The Path of Might (Ṣirāṭ al-ʿIzza)\n\nAs for the Path of Might (ṣirāṭ al-ʿIzza), which is His saying, Exalted is He: <<إِلَى صِرَاطِ الْعَزِيزِ الْحَمِيدِ>> (To the Path of the Mighty, the Praiseworthy), know that this is the Path of Transcendence (al-Tanzīh). No one attains it by taste (dhawqan) except he who transcends himself from being a Lord or a Master (sayyid) in any aspect or in every aspect. This is rare (ʿazīz), for man is heedless, errs, forgets, and says \"I,\" seeing a rank of lordship for himself over others among the servants during his heedlessness. Since this is inevitable, let him strive to be a pure servant (ʿabdan maḥḍan) at the moment of death, possessing nothing of lordship over any creature. Let him see himself as poor (faqīra) toward everything in the world, in the sense that it is the entity of the Real (ʿayn al-Ḥaqq) behind the veil of the Name concerning which Allah said to those who have no knowledge of the matter: <<قُلْ سَمُّوهُمْ>> (Say, 'Name them').\n\nSince the Human is essentially poor (faqīran bi-al-dhāt), Allah veiled Him with means (al-asbāb) and made the gaze of this servant directed toward them, while He is behind them. Thus, He affirmed them as entities (ʿaynan) but negated them as rulings (ḥukman), like His saying to Muhammad (peace and blessings be upon him): <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللهَ رَمَى>> (And you did not throw when you threw, but Allah threw). Then He followed this verse with His saying: <<وَلِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلَاءً حَسَناً>> (And that He might test the believers with a good trial [balāʾan ḥasanan]). Thus, He made that a trial (balāʾ), meaning a test.\n\nThis Mighty Path (al-Ṣirāṭ al-ʿAzīz) is one in which no creature has a footing in knowledge, for it is the Path of Allah upon which He descends to His creation, and upon which He is with us wherever we are. Upon it, He descended from the Throne (al-ʿArsh) to the lowest heaven and to the earth. This is His saying: <<وَهُوَ اللهُ فِي السَّمَاوَاتِ وَفِي الْأَرْضِ>> (And He is Allah in the heavens and in the earth). Upon it, He draws near to His servant manifold more than His servant draws near to Him when he strives toward Him by the prescribed path. He hastens (yuharwilu) toward him when He sees him approaching, out of concern for His servant and honoring him.\n\nBut this is upon the Path of Might (ṣirāṭ al-ʿIzza), which is a path of descent, not of ascent for any creature. If a creature had passage (sulūk) in it, it would not be Mighty (ʿazīzan). He only descended to us through us. Thus, the attribute belongs to us, not to Him. We are the essence of that Path. That is why He described it as the Praiseworthy (al-Ḥamīd), meaning the Praiser (al-Ḥāmid) and the Praised (al-Maḥmūd), because the form *faʿīl* can denote both the active and passive participle. Either it gives both meanings simultaneously, as in this case, or it gives one meaning based on contextual evidence. He has praised Himself, so He is the Praiser and the Praised.\n\nThe greatest praise He bestowed upon Himself, in our view, is His creation of Adam upon His Image (ṣūratihi) and His naming him with the Mother Names (ummahāt al-Asmāʾ) under whose encompassment every Name enters. For this reason, the Prophet (peace and blessings be upon him) said:\nYou are as You have praised Yourself.\n\nHe attributed the Perfect Soul (al-Nafs al-Kāmila) to Himself as an attribution of ownership and honor, based on His saying:\nWhoever knows himself knows his Lord.\n\nEvery praise Allah bestowed upon the Perfect Human (al-Insān al-Kāmil), who is His Self (nafs) because He brought him into existence upon His Image, that praise is the essence of the praise of Allah, by the testimony of the Messenger of Allah (peace and blessings be upon him) and his clarification to us in his saying (peace and blessings be upon him):\nYou are as You have praised Yourself.\n\nMeaning: Everything by which You praised the one You created upon Your Image is Your praise of Yourself.\n\nSince the Perfect Human is the Path of the Mighty, the Praiseworthy (ṣirāṭ al-ʿAzīz al-Ḥamīd), the Path cannot be traveled *in* (lā yasluk fīhi), nor is the Path described by traveling. Therefore, He named it the Mighty (al-ʿAzīz), meaning that is forbidden to the self. The Real, Exalted is He, is exclusively characterized by descending in it, as He informed about Himself concerning descent and hastening. The truly Gnostic servant (al-ʿabd al-ʿārif ʿalā al-ḥaqīqa) only travels *in* Allah. Allah is his path, and that is His Law.\n\nBy Him is my bond, and by us is His bond;\nHe is my path, and I am His path.\n\nLook at my saying, for it is a truthful word,\nFirmly established, its locus verified.\n\nHe is my Beloved, and I am by Him, for\nMy heart encompasses Him, so I am His pavilion.\n\nHe is Mighty, so our eyes do not perceive Him\nDue to His nearness, for He has folded His carpet.\n\nHis distance due to His nearness is nothing other\nThan this, and what I have said is its deduction.\n\nHe is upon a Mighty Path (ṣirāṭ ʿazīz) because He is the Creator (al-Khāliq). No creature has a footing in it. <<أَرُونِي مَاذَا خَلَقَ الَّذِينَ مِنْ دُونِهِ>> (Show me what those besides Him have created). They find nothing whatsoever, neither in knowledge nor in entity. <<بَلِ الظَّالِمُونَ فِي ضَلَالٍ مُبِينٍ>> (Rather, the wrongdoers are in manifest error), because everything known has become manifest.\n\nAllah, Exalted is He, brought us out of the darkness of non-existence (ẓulmat al-ʿadam) into the light of Existence (nūr al-Wujūd). We became light by the permission of our Lord, <<إِلَى صِرَاطِ الْعَزِيزِ الْحَمِيدِ>> (to the Path of the Mighty, the Praiseworthy). Then He transferred us from the light to the darkness of confusion (ẓulmat al-ḥayra). For this reason, when we hear Him praise Himself, we see that in ourselves. And when He praises us, we see that what He praised us with is His praise of Himself. Then He distinguished us from Him and distinguished Himself from us by <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), and by what He knows and we are ignorant of, and by the lowliness (dhilla) we are upon—a description He transcends in Himself.\n\nWe say, \"We are He,\" but we are not He, after we said, when He brought us out of the darkness into the light, \"He is He, and we are we.\" Thus, we were distinguished. When praise came after our existence—praise from Him upon Himself and upon us—and He charged us with praising Him, He left us in confusion (ḥayra). If we praise Him through ourselves, we have restricted Him. If we leave Him absolute, as the Prophet said:\nI cannot enumerate praise upon You,\nwe have restricted Him by the absolute, thus distinguishing Him. Whoever is restricted cannot be described as Self-Sufficient (al-Ghanī), for restriction binds him, since the created (al-muḥdath) has grasped His absoluteness. Yet, He said of Himself that He is <<غَنِيٌّ عَنِ الْعالَمِينَ>> (Self-Sufficient above the worlds). So He confused us, and we do not know what He is, nor what we are.\n\nI do not think, and Allah knows best, that He commanded us to know Him and referred us to our own souls for achieving that knowledge, except because He knew that we would not grasp or know the reality of our own souls and would be incapable of knowing ourselves through ourselves. Thus, we know that we are even more incapable of knowing Him, and that becomes knowledge of Him, not knowledge [of ourselves].\n\nAnd other than this cannot be,\nFor He is manifest and clear.\n\nSo listen to our saying, and you will find it\nKnowledge, and certainty has come to you.\n\nIgnorance (al-Jahl) is an essential attribute of the servant, and the entire world is a servant. Knowledge (al-ʿIlm) is an essential attribute of Allah. Take the totality of what I have alluded to in this section, and you will find the Mighty Path (al-Ṣirāṭ al-ʿAzīz).\n\n### The Path of the Lord (Ṣirāṭ al-Rabb)\n\nAs for the Path of your Lord (ṣirāṭ Rabbika), He alluded to it by His saying: <<فَمَنْ يُرِدِ اللهُ أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلَامِ وَمَنْ يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ>> (So whoever Allah wills to guide, He expands his breast to Islam; and whoever He wills to misguide, He makes his breast tight and constricted, as if he were ascending into the sky). He says: \"As if he were departing from his nature,\" yet a thing does not depart from its reality. <<كَذَلِكَ يَجْعَلُ اللهُ الرِّجْسَ عَلَى الَّذِينَ لَا يُؤْمِنُونَ>> (Thus does Allah place defilement upon those who do not believe). This refers to what was mentioned previously: <<صِرَاطُ رَبِّكَ مُسْتَقِيماً>> (The Path of your Lord is straight). He only mentioned His Will (Irāda) for expansion and constriction. Both are necessary in the world, because nothing occurs except what He wills, and it has occurred.\n\nThen He described Himself—meaning with Wrath (al-Ghaḍab), Pleasure (al-Riḍā), hesitation (al-Taraddud), and dislike (al-Karāha)—then He made it obligatory, saying: \"Despite the dislike, they must meet Me.\" This is the essence of His saying: <<كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ>> (as if he were ascending into the sky). It is like compulsion (jabr) within choice (ikhtiyār). Whoever among Allah's servants is relieved of one of these two descriptions [expansion or constriction] is not perfect (kāmil) at all. That is why He said concerning the Perfect One: <<وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ فَاصْبِرْ>> (And We certainly know that your breast is constrained by what they say, so be patient). He is the Patient One (al-Ṣabūr) regarding the harm of His creation.\n\nThis Path is called the Path of the Lord (ṣirāṭ al-Rabb) because it calls for the one being nurtured (al-marbūb), and He made it straight (mustaqīman). Whoever deviates from it has swerved and departed from straightness. For this reason, He legislated for us love for Allah and hatred for Allah, and made this an action exclusive to Him, in which the servant has no share except the reward Allah grants him for it: that Allah antagonizes those who antagonize His friends (awliyāʾ) and befriends those who befriend them. The traveler upon the Path of the Lord is the one who maintains both attributes [love and hate], but for the sake of the Real (al-Ḥaqq) legislated for Him, not for his own self. For Allah only supports those of His servants who support Him. That is why He said: <<وَلَا يَخَافُونَ لَوْمَةَ لَائِمٍ>> (And they do not fear the blame of any blamer).\n\nThe right of Allah is more deserving of fulfillment than the right of the creature when they coincide. For no creature has a right except by Allah's designation. If the two rights are determined at a certain time, the successful servant begins by fulfilling the right of Allah, which belongs to Him, and then proceeds to fulfill the right of the creature, which Allah made obligatory. This contradicts the current practice of jurists (fuqahāʾ) regarding bequests (waṣiyya) and debt (dayn), for Allah gave precedence to the bequest over the debt, and the bequest is the right of Allah. The Prophet (peace and blessings be upon him) said:\nThe right of Allah is more deserving of being fulfilled.\n\nWhoever is lenient regarding the right of Allah, his action returns upon him, and leniency is shown regarding his own right. If he complains, he is told: \"You did likewise, so reap the fruit of your planting.\" The Path of the Lord only exists with obligation (al-taklīf). If obligation is lifted, this Path ceases to have an existential entity. For this reason, the ultimate destination is Mercy, and the ruling of Divine Wrath is removed from the disobedient. The saying of Hud (peace be upon him): <<إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ>> (Indeed, my Lord is upon a straight path), means in what He legislated, despite His taking hold of the forelocks of His servants toward what He willed to occur from them, and His punishing them despite this compulsion (jabr). So pay attention, behave properly, and follow the straight way.\n\n### The Path of the Favored (Ṣirāṭ al-Munʿim)\n\nAs for the Path of the Favored (ṣirāṭ al-Munʿim), which is the path of those upon whom Allah bestowed favor, it is His saying, Exalted is He: <<شَرَعَ لَكُمْ مِنَ الدِّينِ مَا وَصَّى بِهِ نُوحاً وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَى وَعِيسَى>> (He has ordained for you of religion what He enjoined upon Noah and that which We have revealed to you, and what We enjoined upon Abraham and Moses and Jesus). He mentioned the Prophets and Messengers, then said: <<أُولَئِكَ الَّذِينَ هَدَى اللهُ فَبِهُدَاهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided; so follow their guidance).\n\nThis is the Path that encompasses every Prophet and Messenger: the establishment of the Religion (al-Dīn) and not being divided therein, but uniting upon it. This is what Al-Bukhari titled a chapter: \"What has come concerning the Prophets having one Religion.\" The definite article is used for *al-Dīn* to denote definition, because it all comes from Allah. Even if some of its rulings differ, all are commanded to establish it and unite upon it. This is the Way (al-Minhāj) upon which they agreed. What they differed upon in rulings is the Law (al-Shirʿa) that Allah appointed for each of the Messengers. He said, Exalted is He: <<لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجاً وَلَوْ شَاءَ اللهُ لَجَعَلَكُمْ أُمَّةً وَاحِدَةً>> (For each of you We have appointed a law [shirʿa] and a way [minhāj]. And if Allah had willed, He could have made you one nation). Their laws would not have differed, just as what they were commanded to unite upon and establish did not differ.\n\nSince the difference originated from Him—and He is the possessor of Justice (al-ʿAdl) and Goodness (al-Iḥsān)—and since people claimed their actions belonged to them and claimed choice in what they chose, failing to attribute the matter to its rightful owner, the Divine Ruling descended upon the Messengers that this is bad and this is good, this is obedience and this is disobedience. The Divine Ruling descended upon the intellects (al-ʿuqūl) that this is good in the case of one whose nature and temperament it suits or whose purpose it aligns with, and that which does not align with his purpose or suit his nature and temperament is not good. They did not attribute the matter to a single Entity. They were rewarded as they were rewarded for this matter. Thus, He was just in what He decreed as a reward for evil, and He was good after the decree and its execution by the ultimate destination of His servants to Mercy (al-Raḥma) and the removal of difficult matters from them, which are the pains. Thus, His Mercy encompassed everything.\n\n### The Specific Path, which is the Path of the Prophet (Ṣirāṭ al-Nabī)\n\nAs for the Specific Path (al-Ṣirāṭ al-Khāṣṣ), which is the Path of the Prophet (peace and blessings be upon him) that is exclusive to him, distinct from the general community, it is the Qur'an, the strong rope of Allah, and his comprehensive Law (sharʿ). This is His saying: <<وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيماً فَاتَّبِعُوهُ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ>> (And that this is My path, straight, so follow it, and do not follow [other] ways, lest they separate you from His way). This means the Path attributed to Him.\n\nThis is because Muhammad (peace and blessings be upon him) was a Prophet while Adam was between water and clay. He is the Master of mankind on the Day of Resurrection, by his informing us of the Revelation (al-Waḥy) revealed to him and by his general mission (al-baʿtha al-ʿāmma), indicating that all previous laws in time are derived from his Law. By his mission, he abrogated what he abrogated from them and retained what he retained, just as he abrogated what he had previously established as a ruling. This includes his being granted the comprehensive words (jawāmiʿ al-kalim). Since the world (al-ʿālam) consists of the Words of Allah (kalimāt Allāh), Allah granted him authority over His Words, and his mission was general. He sealed the Messengership and Prophethood with him, just as He began with him inwardly, He sealed with him outwardly. Thus, the prophetic command belongs to him, before and after.\n\nHis inheritors (waratha) who possess the capacity for independent legal reasoning (ijtihād) in establishing rulings are in the position of the Messengers who preceded him in time. Whoever inherits Muhammad (peace and blessings be upon him) in his comprehensiveness (jamʿiyyatihi) receives a Divine clarification (taʿrīf) of the ruling. This is a station higher than *ijtihād*. It means Allah grants him, through Divine clarification, that the ruling of Allah brought by the Messenger of Allah (peace and blessings be upon him) concerning this issue is such-and-such. In that ruling, he is in the position of one who heard it directly from the Messenger of Allah (peace and blessings be upon him). If a Hadith comes to him from the Messenger of Allah (peace and blessings be upon him), he refers it back to Allah and knows the soundness of the Hadith from its defectiveness, whether the Hadith is considered sound by the scholars of transmission or if it has been criticized. When he knows this, he has taken his ruling from the Origin (al-Aṣl). Abu Yazid (al-Bisṭāmī) informed about this station—meaning taking knowledge directly from Allah—saying, as we have narrated from him, addressing the scholars of his time: \"You took your knowledge from a dead person about a dead person, and we took our knowledge from the Living who never dies.\" By the grace of Allah, we have a noble taste (dhawq sharīf) in this station concerning the rulings by which the Law has charged us. This is what remains of Revelation (al-Waḥy) for this community: clarification (al-taʿrīf), not legislation (al-tashrīʿ).\n\nAs for the people of *Ijtihād* (independent reasoning), their rulings are legislation *of* the Law if they err. If they err, the Messenger of Allah (peace and blessings be upon him) is the one who established that ruling, so it is not legislation *by* them; rather, it is the legislation of the Messenger of Allah (peace and blessings be upon him). If the *Mujtahid* is correct, he is a transmitter of the Law. In reality, the erring *Mujtahid* and the correct one are one, though not specifically identified. However, the one who is correct in reality is a transmitter, and the one who errs in reality establishes a ruling that was unknown until the *Mujtahid*'s speculation brought it forth. It was known to Allah before its existence. The Lawgiver (al-Shāriʿ), who is the Messenger, only established the specific ruling known to Allah, but it is not known to Him [the Mujtahid] in detail and specification. Thus, the ruling of the erring *Mujtahid* is legislation *for* the legislation.\n\nThe People of Allah (Ahl Allāh) have no ruling in the Law except what is the specifically decreed ruling known to the Messenger of Allah (peace and blessings be upon him). They are the true inheritors (al-waratha ʿalā al-ḥaqīqa), for the inheritor only inherits what was owned by the deceased. The ruling of the erring *Mujtahid* is not a specifically owned thing that can be inherited from him, so he is not an inheritor. What he possesses is merely the establishment of what his speculation led him to, which the Messenger of Allah (peace and blessings be upon him) permitted him. He is like the residuary heir (al-ʿaṣaba), who has no specifically designated share in the inheritance; rather, they receive what remains after the fixed shares are given to their recipients, like the inheritance of uterine kin and Muslims after the fixed shares are taken.\n\nIf a Prophet or Messenger dies without a fixed heir—meaning no one followed him—he will be resurrected alone. He may be inherited in his character (khuluq) or his state (ḥāl), but not in his ruling, by someone from this community who attains that state or ruling. As for belief in him, everyone who believes in Muhammad (peace and blessings be upon him) has believed in him. The community of Muhammad (peace and blessings be upon him) who believe in him are followers of every Prophet, every Book, and every Scroll that came or descended from Allah, in terms of belief, not in terms of acting upon the ruling. No Prophet remains except that he has been believed in.\n\nThe Prophet Muhammad (peace and blessings be upon him) has the Imamate and precedence, and all Messengers and Prophets are behind him in a row. We are behind the Messengers and behind Muhammad. Some Messengers will have two forms in the Gathering (al-Ḥashr): one form with us and one form with the Messengers, like Jesus. All nations are behind us, except that we have two forms: one form in the row of the Messengers (peace be upon them), which belongs only to the scholars of this community, and one form behind the Messengers, by virtue of believing in them. Likewise, the other nations have two forms: one form in which they are behind us, and one form in which they are behind their Messengers. At times, the observer's gaze falls upon their forms behind us, and at times behind their Messengers, and at times upon the totality. These are the states of the scholars in the Hereafter in their gathering.\n\nAs for the inheritors of actions (warathat al-afʿāl), they are those who followed the Messenger of Allah (peace and blessings be upon him) in every action and posture that was permissible for us to follow, even in the number of his marriages, his eating, his drinking, and all the actions attributed to him that Allah established him in, such as litanies (awrād), glorification (tasbīḥ), and prayer, without diminishing anything. If they add to these after achieving them, they only add based on the ruling of his saying (peace and blessings be upon him). This is the inheritance of his actions.\n\nAs for the inheritance of his states (warāthat aḥwālihi), it is the tasting (dhawq) of what he found within himself, such as the Revelation through the Angel (al-Malak). The inheritor finds that in the angelic intuition (al-lumma al-malakiyya), and from the Angel who supports him, and from the specific Divine Face (al-Wajh al-Khāṣṣ al-Ilāhī) by the removal of intermediaries (al-wasāʾiṭ), such that the Real is the essence of his saying, and he reads the Qur'an as if it is being revealed to him, finding the pleasure of the descent (ladhdhat al-inzāl) by taste (dhawqan) upon his heart when reciting. For the Qur'an, when recited by any reciter, either inwardly or aloud, there must be a Divine Descent (tanazzul ilāhī). It is renewed in descent and arrival upon the recitation of every reciter, whoever that reciter may be. However, the inheritor by state (al-wārith bi-al-ḥāl) senses the descent (al-inzāl) and enjoys a specific pleasure (iltidhādh khāṣṣan) that only his likes find. That is the possessor of the inheritance of the state. We have tasted this state, by the grace of Allah. It is what Abu Yazid referred to when he said: \"I did not die until I memorized the Qur'an by heart (istaẓhartu al-Qurʾān),\" meaning the finding of the pleasure of the descent from the Unseen (al-Ghayb) upon the hearts.\n\nThose other than these only recite the Qur'an from their imagination (khayālihim). They imagine the forms of its written letters, if they memorized the Qur'an from manuscripts or tablets, or they imagine the forms of the letters they received from their teacher. This is if they are acting upon it. If they recite it without sincerity (ikhlāṣ), it does not pass beyond their throats—meaning Allah accepts nothing from it, and it remains in the place of its recitation, which is the vocal outlet. Only the possessor of the Descent (al-Tanazzul), who has the inherited taste (al-dhawq al-mīrāthī), recites the Qur'an from his heart. Whoever finds that is its possessor. He knows it when he finds it and does not need a definer. He distinguishes at that moment between his recitation from his imagination and his recitation from the descent of his Lord, by witnessing (mushāhada).\n\nThere is no other matter for a Prophet or Messenger in which inheritance occurs; it is only saying (qawl), action (fiʿl), or state (ḥāl). The Perfect Inheritor is the one who combines them, and the deficient inheritor is the one who limits himself to some of these Levels.\n\nKnow that this Station (manzil) is the station of those among the Prophets (peace be upon them) who were characterized by Intimacy (al-Khulla). Whoever attains it has a share of the Divine Intimacy and is given a portion therein. The discussion of this is long, and time does not permit its detail. So let us mention the sciences it contains, like the other Stations. We say:\n\nIt contains the science of the mercy of intimate friends (raḥmat al-khullān) and the difference between it and the mercy of beloved ones, children, parents, and all pleasures. It contains the science of the sweetness of the Descent (ḥalāwat al-Tanazzul) and where the one upon whom the Qur'an descends anew upon his recitation senses it within himself. It contains the science of others (al-aghyār), secrets (al-asrār), lights (al-anwār), guidance (al-hidāya), types of praises (al-maḥāmid), and the specific Levels (al-Marātib al-khāṣṣa) for every soul, in which no one shares with it. This is because we know that every soul has an attribute or reality exclusive to it, by which it is distinguished from everything else in the world—this is necessary. When the Divine Command comes to it through that specific reality, its taste (dhawq) of it is restricted to itself. This is the lowest share of the soul in the station of Divine Might (maqām al-ʿIzza al-Ilāhiyya), for it belongs to every soul, even if it is unaware of it. It is like the action of natural matters by property (al-khāṣṣiyya), such as the magnet and its likes. However, the property in natural matters is of two types: by singularity and by totality, and in the specific temperament (al-mizāj al-khāṣṣ). Natural properties do not flow into every temperament or every form. But the property of the People of Allah (Ahl Allāh), when they attain it by taste from their souls, its ruling flows into everything in the world.\n\nIt contains the science of the Kingdom (al-Malakūt), Witnessing (al-Mushāhada), and seeing the non-existent (al-maʿdūm) in its state of non-existence, without imagination (takhayyul) or representation (tamaththul), and not by the perception of imagination, but by physical sight (al-baṣar al-ḥissī). It contains the science of the causes of confusion (al-ḥayra) and bewilderment. It contains the science that man only knows what his preparedness (istiʿdād) grants him, whether he employs it or it comes upon him suddenly; he cannot accept beyond that, for he lacks the power of acceptance. It contains the science of the Messengers (al-Rusul) and Messengership (al-Risāla). It contains the science that man is essentially knowing (ʿālim bi-al-dhāt), but he forgets. Every knowledge he acquires is merely remembrance (tadhakkur), and only the People of Allah are aware that it is remembrance. It contains the science of afflictions (al-balāyā) and blessings (al-niʿam). It contains the science of the Criterion (al-Furqān) in distinguishing between clarification (al-taqrīr) and reprimand (al-tawbīkh), and what is by way of favor (al-minna) or demand (al-muṭālaba).\n\nIt contains the science of the attributes of Transcendence (al-Tanzīh) in actions, and that every seeking (ṭalab) in the world, or from every seeker, is essential seeking (ṭalab dhātī). There is no accidental seeking (ṭalab ʿāriḍ) that is not essential—this cannot be. Rather, something accidental occurs to a person that he did not possess before. This matter that occurred to him is what possesses the essential seeking for the sought object. People are veiled by the person in whom that accidental matter subsists, and they call him the seeker. But the seeker is only that matter. The seeking is essential to that matter, and the person in whom this matter subsists is merely used by it in achieving it, since he existed while lacking this seeking. Thus, we know that the seeking is essential to that matter, and it has used this person whom it descended upon for its attainment. People are unaware of this.\n\nIt contains the science of speculation (al-naẓar), contemplation (al-tafakkar), and consideration (al-iʿtibār), and that parts of the world are lessons (ʿibra) for other parts. It contains the science of what Allah reserves for Himself from the scattered sciences in the world, which is their totality (jamʿiyyatuhā). Only Allah knows this—this is concerning what has entered existence, along with His knowledge of what has not entered existence, knowledge of which no creature is characterized. Thus, He has the knowledge of totality concerning this world, combined with the knowledge of the Hereafter—this is necessary.\n\nIt contains the science of inferring the Eternal (al-Qadīm) from the created (al-muḥdath) and what results in the soul from that. For the Eternal does not subsist in the soul, even if the created subsists. But the created is not the sought object, and everything that subsists is created. It contains the science of when reliance (al-tawakkul) becomes gratitude (shukr) to Allah, Exalted is He. It contains the science of the one in whom a meaning subsists that necessitates a name he deserves. From this, you know the Beautiful Names of Allah (al-Asmāʾ al-Ḥusnā) from His Names, for the Names of Allah in the cosmos arise from the effects of these souls, and the names of the cosmos arise from the meanings subsisting in it that necessitated the names for it. The Real is transcendent in His Names, one in Entity (wāḥid al-ʿayn), while the cosmos is multiplied by its Names due to the subsistence of the meanings in it that necessitated the Names for it.\n\nIt contains the science of the causes of inheritance (al-mīrāth). It contains the science of who succeeded and who failed, and all are seekers. It contains the science of witnessing death (al-mawt) despite its being a non-existential relationship (nisba ʿadamiyya), and in whom it rules. Death has no ruling over that which has no composition (tarkīb). Every composite thing by designation accepts death. If it does not die, that is due to another matter necessitated by the Divine Will (al-Mashīʾa al-Ilāhiyya). He may appoint a manifest or known cause for it, or it may be solely the ruling of the essence of the Will.\n\nIt contains the science of judging Allah by what is possible (mumkin) concerning Him, not by what Allah is upon. Much of this has been mentioned in the Qur'an, but only those who know what the realities of existing things grant, and those who know the quiddity (māhiyya) of things, understand its meaning. It contains the science of the Day of Resurrection (Yawm al-Qiyāma), the Gathering (al-Ḥashr), the Resurrection (al-Nashr), and the rulings specific to that Day, who the Ruler is therein, and the Levels of those who exercise authority therein. It contains the science of the necessitating command (al-amr al-muqtaḍī) on that Day.\n\nIt contains the science of likening man to vegetation, in the sense that he is a tree, not a star. From this, the prohibition against Adam approaching the tree is understood as a warning against approaching the desires and whims of his soul. This is His saying: <<وَنَهَى النَّفْسَ عَنِ الْهَوَى>> (And restrained the soul from [unlawful] desire), which is the soul desiring what was not legislated for it to do or leave. It contains the science of establishment (al-tamkīn) and steadfastness (al-thabāt) upon the knowledge granted by realities in speech and action. It contains the science of what is praiseworthy in transformation (al-tabdīl) and coloring (al-talwīn) and what is blameworthy. It contains the science of intentional respite (al-imhā) and neglect (al-ihmāl). It contains the science of the wisdom of cosmic (kawnī) and divine (ilāhī) subjugation (al-taskhīr). It contains the science of singling out the Essence of the Real (Dhāt al-Ḥaqq) with Divinity (al-Ulūha). It contains the science of emulation (al-iqtidāʾ) and whom one ought to emulate. It contains the science of restricting praise by the state (al-ḥāl) and making it absolute by speech (al-qawl). It contains the science of what appears in existence as known and manifest from a related knowledge that necessitated that manifestation.\n\nIt contains the science that man, despite his knowledge that Allah is not restricted by directions (al-jihāt) and is closer than the jugular vein (ḥabl al-warīd), still imagines Him to have the direction of above-ness and limitation. His constitution (nashʾa) does not allow him to be free from the ruling of imagination (al-wahm) over his intellect. Thus, he comprehends the reality of the matter alongside the ruling of his imagination without delay, combining in the instant the ruling of the intellect and the imagination, just as he combined the matters by which he became human, so too he combines their rulings. It contains the science of the Levels of the Qur'an among people, such that its ruling upon one group is different from its ruling upon another group.\n\nThis is some of what this Station contains of sciences, summarized. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "## باب تین سو ستر: منزل مزید کی معرفت، ہستی (الوجود) کے اسرار میں سے ایک راز اور دو رازوں کی معرفت، اور تبدل (تبدیلی) کا بیان، اور یہ مقام حضرت محمدیہ (الحضرة المحمدية) سے ہے۔\n\n> **إن الزيادة في الأعمال صورتها *** مثل الزيادة في الإنعام يا رجل‏**\n> اعمال میں زیادتی کی صورت ایسی ہے، اے شخص! جیسے انعامات میں زیادتی۔\n> **وليس يعرفها إلا رجال حجى *** وليس يحصرها عد ولا أجل‏**\n> اسے صرف عقل و فہم والے لوگ ہی جانتے ہیں، اور نہ کوئی گنتی اسے محدود کر سکتی ہے اور نہ کوئی مدت۔\n> **لله في طيها مكر لذي نظر *** محقق ولنا في مكره أمل‏**\n> اس کے اندر اہل بصیرت کے لیے اللہ کی ایک تدبیر (مکر) ہے، اور ہمیں اس کی تدبیر میں امید ہے۔\n> **فإنه صادر من سر حضرته *** وليس يعصم إلا العلم والعمل‏**\n> کیونکہ یہ اس کی بارگاہ کے راز سے صادر ہوتا ہے، اور علم اور عمل کے سوا کوئی چیز بچا نہیں سکتی۔\n\n### [کہ حکمت تمام اشیاء میں ہے]\n\nجان لو کہ تمام اشیاء اور تمام امور میں حکمت صرف مراتب (المراتب) کے لیے ہے نہ کہ اعیان (الاعيان) کے لیے۔ اور سب سے بڑا مرتبہ الوہیت (الألوهية) کا ہے اور سب سے نچلا مرتبہ عبودیت (العبودية) کا ہے۔ پس وہاں صرف دو ہی مراتب ہیں: رب اور عبد۔ لیکن الوہیت (الألوهية) کے احکام ہیں، جن میں سے ہر حکم ایک مرتبہ کا تقاضا کرتا ہے۔ یا تو وہ حکم الٰہ (الإله) کے ساتھ قائم ہوتا ہے، تو وہ خود ہی حکم کرنے والا ہوتا ہے، اور یہ معنی میں مرتبہ کا حکم ہے۔ اور اس حکم کو صرف صاحب مرتبہ ہی نافذ کرتا ہے، کیونکہ مرتبہ کسی عین (وجود) کا وجود نہیں ہے، بلکہ یہ ایک معقول امر اور ایک معلوم نسبت ہے جس پر حکم لگایا جاتا ہے اور جس کے لیے احکام ہیں۔ اور یہ عجیب ترین امور میں سے ہے: معدوم کا اثر۔ اور یا تو وہ حکم کسی دوسرے موجود میں قائم ہوتا ہے، خواہ وہ وجودی امر ہو یا کوئی نسبت، تو صرف مراتب ہی اثر انداز ہوتے ہیں۔ اسی طرح عبودیت (العبودية) کے بھی احکام ہیں، جن میں سے ہر حکم ایک مرتبہ ہے۔ یا تو وہ حکم خود عبد کے ساتھ قائم ہوتا ہے، تو اس پر اس کے سوا کسی نے حکم نہیں لگایا، گویا وہ اس مرتبہ کا نائب ہے جس نے اس کے لیے یہ حکم واجب کیا، یا وہ اپنے جیسے پر یا کسی دوسرے پر حکم لگاتا ہے۔ اور عبد کے حق میں مثل (جیسا) یا غیر (دوسرا) کے سوا کچھ نہیں ہے۔ اور الٰہ (الإله) کے حق میں غیر کے سوا کچھ نہیں ہے، کوئی مثل نہیں، کیونکہ اس کی کوئی مثال نہیں ہے۔\n\nوہ احکام جو مرتبہ (المرتبة) کے احکام سے اس (الٰہ) کی طرف لوٹتے ہیں، وہ اس کی ذات کے لیے وجود کا واجب ہونا، عالم سے اس کی بے نیازی (غنائه) کا حکم، اور مومنوں کی رحمت کے ساتھ مدد کرنے کا خود پر واجب کرنا، اور جلال کی تمام صفات جو تنزیہ اور مماثلت کی نفی کا تقاضا کرتی ہیں۔ اور وہ احکام جو اپنی ذات سے غیر (الغير) کے طلبگار ہوتے ہیں، جیسے خلق کی تمام صفات، اور وہ کرم (الكرم)، افضال (الإفضال)، جود (الجود)، اور ایجاد (الإيجاد) کی صفات ہیں۔ پس اس میں اور اس پر کوئی نہ کوئی ہونا ضروری ہے، لہٰذا غیر کا ہونا ضروری ہے، اور وہ صرف عبد ہے۔ اور کوئی بھی ایسا اثر نہیں جو عبد کو طلب کرے مگر اس کی اصل الٰہ (الإله) میں ہونی چاہیے جسے مرتبہ نے واجب کیا ہو، یہ ضروری ہے۔ اور وہ (اللہ تعالیٰ) اس مرتبہ کے بعض احکام کے ساتھ خاص ہے جو مخلوق کو طلب نہیں کرتے، جیسا کہ ہم نے بیان کیا۔ اور عبد کا مرتبہ، اس کے عبد ہونے کی حیثیت سے، ایسے احکام کا تقاضا کرتا ہے جو صرف خاص عبد کے ساتھ ہی قائم ہو سکتے ہیں، لہٰذا وہ اپنی ذات کے اعتبار سے ہر عبد میں عام ہیں۔ پھر اس کے ایسے احکام ہیں جو ان احکام کے لیے امثال (مثالوں) کے وجود اور ذات حق (الحق) کے وجود کا تقاضا کرتے ہیں۔ ان میں سے یہ ہے کہ جب عبد ذات حق (الحق) کا نائب اور خلیفہ ہو، یا اپنے جیسے کسی عبد کا خلیفہ ہو، تو ضروری ہے کہ جسے اس نے خلیفہ بنایا ہے وہ اسے اپنی صفات میں سے وہ چیزیں عطا کرے جن کا خلافت کا مرتبہ تقاضا کرتا ہے، کیونکہ اگر وہ اس کی صورت میں ظاہر نہ ہو جس نے اسے خلیفہ بنایا ہے، تو اس کا حکم اس کے امثال میں نافذ نہیں ہو سکتا۔ اور اس کا اس کی صورت میں ظاہر ہونا جس نے اسے خلیفہ بنایا ہے، اس کے سوا کچھ نہیں جو سیادت (السيادة) کا مرتبہ اسے عطا کرتا ہے۔ پس عبودیت (العبودية) کے مرتبہ اور خلافت (الخلافة) کے مرتبہ نے اسے ایسے احکام عطا کیے ہیں جنہیں وہ صرف اپنے آقا اور اس شخص پر ہی صرف کر سکتا ہے جس نے اسے خلیفہ بنایا ہے، جیسا کہ اس کے لیے ایسے احکام ہیں جنہیں وہ صرف ان لوگوں پر صرف کرتا ہے جن پر اسے خلیفہ بنایا گیا ہے۔ اور خلافت صغریٰ اور کبریٰ ہوتی ہے۔ ان میں سب سے بڑی، جس سے بڑی کوئی نہیں، عالم پر امامت کبریٰ ہے۔ اور سب سے چھوٹی، اس کا اپنے نفس پر خلیفہ ہونا ہے۔ اور جو ان کے درمیان ہے، وہ اپنے سے اوپر کے مقابلے میں صغریٰ کہلاتی ہے، اور وہی بعینہٖ اپنے سے نیچے کے مقابلے میں کبریٰ ہے۔\n\nجہاں تک عبد کے مرتبہ کا اس کے آقا پر اثر ہے، تو وہ آقا کا اپنے عبد کے مفادات کو پورا کرنا ہے تاکہ اس پر سیادت (السيادة) کا حکم باقی رہے۔ اور جس نے اپنے عبد کے مفادات کو پورا نہیں کیا، تو مرتبہ نے اسے معزول کر دیا۔ کیونکہ مراتب کو بالذات (بالذات) تولیت (عہدہ دینا) اور معزولی کا حکم حاصل ہے، نہ کہ بالواسطہ، خواہ وہ کسی کے لیے بھی ہوں۔ اور جہاں تک اس اثر کا تعلق ہے جو عبد کو خلیفہ ہونے کی حیثیت سے اس شخص میں ہوتا ہے جس پر اسے خلیفہ بنایا گیا ہے، خواہ وہ خلیفہ کوئی بھی ہو، تو یہ ہے کہ اس پر خلیفہ بنائے گئے شخص کا عین (وجود) باقی رہے تاکہ اس کا حکم اس میں نافذ ہو سکے۔ اور اگر ایسا نہ ہو تو وہ خلیفہ نہیں ہے، اور وہ سچا نہیں ہو سکتا اگر وہاں کوئی نہ ہو جس پر یا جس میں حکم نافذ ہو۔ کیونکہ خلیفہ کے لیے ضروری ہے کہ اس کے لیے کوئی جگہ ہو جہاں وہ موجود ہو تاکہ حاجات کے لیے اس کی طرف رجوع کیا جائے۔ کیا تم نہیں دیکھتے کہ جو جگہ کو قبول نہیں کرتا، مرتبہ نے اس کے لیے یہ تقاضا کیا کہ وہ ایک آسمان پیدا کرے جسے اس نے عرش بنایا، پھر ذکر کیا کہ وہ اس پر مستوی ہوا، تاکہ دعا اور حاجات کی طلب کے لیے اس کی طرف رجوع کیا جائے، اور عبد حیران نہ رہے کہ وہ کہاں متوجہ ہو۔ کیونکہ اللہ نے عبد کو جہت والا پیدا کیا، تو ذات حق (الحق) نے اپنے لیے فوقیت کو آسمان اور عرش سے منسوب کیا، اور تمام جہات کا احاطہ اپنے اس قول سے کیا: **فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله** (البقرہ: ۱۱۵) \"پس تم جدھر بھی رخ کرو گے، وہیں اللہ کا چہرہ ہے\" اور اپنے اس قول سے: \"ہمارا رب آسمان دنیا پر نازل ہوتا ہے اور فرماتا ہے: کیا کوئی توبہ کرنے والا ہے؟ کیا کوئی دعا کرنے والا ہے؟ کیا کوئی مغفرت طلب کرنے والا ہے؟\" اور اس کے رسول نے اس کے بارے میں فرمایا:\n\n> **إن الله في قبلة المصلي‏**\n> \"بے شک اللہ نماز پڑھنے والے کے قبلہ میں ہے۔\"\n\nاگر تم سمجھو تو یہ سب مراتب (المراتب) کا حکم ہے۔ اگر مراتب عالم سے زائل ہو جائیں تو اعیان (الاعيان) کا وجود بالکل باقی نہ رہے۔ پس سمجھو۔\n\nپس جب اعلیٰ (الأعلى) یہ چاہے کہ ادنیٰ (الأدنى) اسے پہچانے، کیونکہ ادنیٰ کو علو (بلندی) میں کوئی قدم حاصل نہیں، اور اعلیٰ کو ادنیٰ کا احاطہ حاصل ہے، تو ضروری ہے کہ اعلیٰ ادنیٰ سے اپنا تعارف کرائے۔ اور یہ ممکن نہیں مگر یہ کہ اعلیٰ اس کی طرف نازل ہو۔ کیونکہ ادنیٰ اس کی طرف ترقی نہیں کر سکتا، اس لیے کہ اس کا عین (وجود) معدوم ہو جائے گا، کیونکہ اسے علو میں کوئی قدم حاصل نہیں۔ پس ادنیٰ ہمیشہ اپنے مرتبہ میں ثابت رہتا ہے، اور اعلیٰ کے لیے نزول بھی ہے اور اپنے مرتبہ میں ثبوت بھی۔ اور اپنے مرتبہ میں اس کے ثبوت میں سے ہی اس نے اپنے اوپر نزول کا حکم لگایا۔ پس وہ اپنے نزول کے عین میں اپنے عالی مرتبہ میں ثابت ہے۔\n\nاور اللہ تعالیٰ نے اپنے سفیروں کے ساتھ بھی ایسا ہی کیا جو اس کی مخلوق میں سے اس کی طرف رسول تھے، پس اس نے کوئی رسول نہیں بھیجا **إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ** (ابراہیم: ۴) \"مگر اس کی قوم کی زبان میں تاکہ وہ ان کے لیے واضح کرے۔\" پس اگر اس نے اسے عام بھیجا تو وہ عام لوگ اس کی قوم تھے۔ پس اس نے اسے جوامع الکلم (جامع کلمات) عطا کیے، اور وہ فصل الخطاب ہے۔ اور آدم (علیہ السلام) ہی اسماء کے ساتھ کامل ہوئے، اور محمد صلی اللہ علیہ وسلم جوامع الکلم کے ساتھ کامل ہوئے۔ پس وہ ان کی طرف ان کے رب کا پیغام ان کی زبان اور ان کے لہجے میں لے کر نازل ہوئے۔ پس اس نے انہیں صرف ان کے ذریعے ہی دعوت دی۔ پھر اس نے ان کے لیے احکام میں سے صرف وہی شریعت مقرر کی جس پر وہ پہلے سے تھے۔ پس اس نے اس میں صرف یہ اضافہ کیا کہ وہ احکام اللہ کی طرف سے ہیں، تاکہ وہ ان کے ذریعے اللہ سے قربت کے طریقے پر حکم کریں، تاکہ وہ انہیں اللہ کے ہاں سعادت عطا کرے۔ اور ہم نے یہ اس لیے کہا کہ اس نے ان کے لیے احکام میں سے صرف وہی شریعت مقرر کی جس پر وہ پہلے سے تھے، کیونکہ کوئی امت اپنے حالات کی مصلحتوں کے لیے کسی ناموس (قانون) پر ہونے سے خالی نہیں رہی، اور وہ صرف پانچ ہیں۔ پس ضروری ہے کہ کوئی واجب ہو جسے ان کے امام اور ان کے ناموس کے واضع نے ان پر واجب کیا ہو، اور وہ ہمارے نزدیک واجب اور فرض ہے۔ اور اسی طرح مندوب (مستحب)، محظور (حرام)، مکروہ، اور مباح۔ کیونکہ ان کے لیے احکام میں حدود کا ہونا ضروری ہے جن پر وہ ٹھہریں۔ اور اللہ کی طرف سے شریعت ان کے پاس صرف اسی چیز کے ساتھ آئی جس پر وہ اپنے گمان میں اپنے غور و فکر کے حکم سے تھے، اور وہ درحقیقت اللہ کی طرف سے ان کے نفوس میں ڈالا گیا تھا جہاں سے وہ شعور نہیں رکھتے تھے۔ اور اسی لیے انہیں اس پر اللہ کی طرف سے اجر ملا جہاں سے وہ نہیں جانتے تھے، لیکن جب وہ اس کی طرف پلٹیں گے تو اسے اس کے پاس پائیں گے۔\n\nپس جب ہم نے دیکھا کہ اس نے کوئی رسول نہیں بھیجا **إِلَّا بِلِسانِ قَوْمِهِ** (ابراہیم: ۴) \"مگر اس کی قوم کی زبان میں\"، تو ہم نے جان لیا کہ جب اس نے چاہا کہ ہم اسے پہچانیں تو اس نے ہمارا تعارف صرف اس چیز سے کرایا جس پر ہم ہیں، نہ کہ اس چیز سے جس کا اس کی ذات تقاضا کرتی ہے۔ اگرچہ اس کا ہمارا تعارف ہمارے ذریعے کرانا اس کی ذات کے تقاضوں میں سے ہے، لیکن اس کی ذات کے تقاضے اس چیز کے درمیان مختلف ہوتے ہیں جس سے وہ ہم سے ممتاز ہوتا ہے اور جس سے وہ ہمارا تعارف کراتا ہے۔ اور چونکہ مخلوق بہت سے مراتب پر ہے، اور ان میں سب سے کامل مرتبہ انسان کا ہے، اس لیے عالم کی ہر صنف انسان کامل (الإنسان الکامل) کے کمال کے مقابلے میں ایک جزو ہے، یہاں تک کہ حیوانی انسان بھی انسان کامل (الإنسان الکامل) کا ایک جزو ہے۔ پس عالم کے کسی جزو کی اللہ کے بارے میں ہر معرفت جزوی معرفت ہے، سوائے انسان کے، کیونکہ اس کی اللہ کے بارے میں معرفت پورے عالم کی اللہ کے بارے میں معرفت ہے۔ پس اس کا اللہ کے بارے میں علم کلی (کلی علم) ہے، نہ کہ کل (مکمل) علم۔ کیونکہ اگر وہ کل علم ہوتا تو اسے یہ حکم نہ دیا جاتا کہ وہ کہے: **رَبِّ زِدْنِي عِلْماً** (طٰہٰ: ۱۱۴) \"اے میرے رب! میرے علم میں اضافہ فرما۔\" کیا تم سمجھتے ہو کہ یہ علم غیر اللہ کے بارے میں ہے؟ نہیں، اللہ کی قسم! بلکہ اللہ کے بارے میں ہے۔ پس اس نے انسان کامل (الإنسان الکامل) کو اپنی صورت پر پیدا کیا اور اسے اس صورت کے ذریعے یہ اختیار دیا کہ وہ اپنے تمام اسماء کو اس پر ایک ایک کر کے اور بعض بعض کر کے لاگو کرے، لیکن ایک ہی کلمہ میں تمام اسماء کا مجموعہ اس پر لاگو نہیں ہوتا، تاکہ رب کامل عبد سے ممتاز ہو جائے۔ پس اسماء حسنیٰ میں سے کوئی ایسا اسم نہیں، اور اللہ کے تمام اسماء حسنیٰ ہیں، مگر یہ کہ کامل عبد کو یہ حق حاصل ہے کہ وہ ان کا دعویٰ کرے، جیسا کہ اسے یہ حق حاصل ہے کہ وہ ان کے ذریعے اپنے آقا کو پکارے۔ اور ان الٰہی اسماء میں سے بعض ایسے ہیں جن کے ذریعے ذات حق (الحق) عبد کی تعریف کے طور پر اسے پکارتا ہے، اور وہ رحمت، لطف، اور حنان کے اسماء ہیں۔ اور ان میں سے بعض ایسے ہیں جن کے ذریعے وہ اسے مذمت کے طور پر پکارتا ہے، جیسے اللہ تعالیٰ کا قول: **ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ** (الدخان: ۴۹) \"چکھ لے، بے شک تو ہی بڑا عزت والا، بڑا کرم والا ہے۔\" اور وہ اپنی قوم میں اسی نام سے پکارا جاتا تھا، اور ذات حق (الحق) نے یہاں اسے ذم کے طور پر مذاق اڑاتے ہوئے اس نام سے پکارا۔ اللہ تعالیٰ فرماتا ہے: **فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ فَسَوْفَ تَعْلَمُونَ** (ہود: ۳۸) \"پس ہم بھی تم سے مذاق کرتے ہیں جیسا کہ تم مذاق کرتے ہو، پس عنقریب تم جان لو گے۔\"\n\nپس جب اس نے ہم میں سے کامل کو صورت پر موجود کیا، تو کامل نے اپنے آپ کو اس کمال کے ذریعے پہچانا جو اس نے اسے عطا کیا۔ اور کامل عبد اپنی ذات میں مکمل طور پر حق تھا اور اپنے عین (وجود) سے فنا (الفناء) ہو گیا، کیونکہ وہ اپنی ذات کے ساتھ قبول کرنے والا ہے۔ اور اللہ نے اس کے لیے محبت کے باب میں ایک مثال قائم کی ہے۔ پس اس نے عالم میں سے جس چیز سے بھی عشق کیا، خواہ وہ گھوڑا ہو، گھر ہو، دینار ہو یا درہم، تو اس نے اسے صرف مناسب جزو کے ساتھ ہی قبول کیا، پس اس عشق کی وجہ سے وہ مناسب جزو اس سے فنا ہو گیا، اور باقی حصہ ہوش میں رہا، اس میں اس کا کوئی حکم نہیں تھا، سوائے اس کے کہ جب وہ اپنے جیسے کسی شخص سے عشق کرے، جیسے کوئی باندی یا غلام، تو وہ اسے اپنی پوری ذات اور اپنے تمام اجزاء کے ساتھ قبول کرتا ہے۔ پس جب وہ اسے دیکھتا ہے تو وہ اس میں مکمل طور پر فنا ہو جاتا ہے، نہ کہ کسی جزو کے ساتھ، تو وہ بے ہوش ہو جاتا ہے۔ اور یہ اس لیے ہے کہ اس نے اسے مکمل طور پر قبول کیا۔ اسی طرح جب عبد ذات حق (الحق) کو دیکھتا ہے یا اس کا تصور کرتا ہے، تو وہ اس کے مشاہدہ کے وقت اس میں فنا (الفناء) ہو جاتا ہے، کیونکہ وہ اس کی صورت پر ہے، پس وہ اسے اپنی ذات کے ساتھ قبول کرتا ہے۔ پس اس میں کوئی جزو باقی نہیں رہتا جو ہوش میں رہے تاکہ وہ اس چیز کو سمجھ سکے جو اس سے اس میں فنا ہو گئی ہے۔ اور اسی طرح عالم کا ہر جزو ذات حق (الحق) کے ساتھ، جب وہ اس پر ظہور الٰہی (التجلی) کرتا ہے، تو وہ اس کے لیے جھک جاتا ہے اور اس میں فنا ہو جاتا ہے، کیونکہ عالم میں سے جو کچھ بھی اس پر ہے، وہ ذات حق (الحق) کی صورت ہے اس چیز کے لحاظ سے جو اس نے اسے عطا کی، کیونکہ یہ درست نہیں کہ عالم میں سے کسی چیز کا وجود ہو جو ذات حق (الحق) کی صورت نہ ہو۔ پس ضروری ہے کہ جب ذات حق (الحق) اس پر ظہور الٰہی (التجلی) کرے تو عالم ذات حق (الحق) میں فنا ہو جائے، اور ذات حق (الحق) مخلوق میں فنا نہیں ہوتا، کیونکہ مخلوق ذات حق (الحق) سے ہے، جبکہ ذات حق (الحق) مخلوق سے نہیں ہے۔ پس ذات حق (الحق) کی مخلوق سے نسبت وہی ہے جو انسان کی عالم کی ہر صنف سے نسبت ہے، سوائے نوع انسان کے۔ پس جو کچھ میں نے تمہیں عالم کی ہر چیز کے اس کے (اللہ سبحانہ و تعالیٰ) کے لیے ظہور الٰہی (التجلی) کے وقت اپنے آپ سے فنا ہونے کے بارے میں بتایا ہے، اس پر غور کرو، اور ذات حق (الحق) مخلوق کے مشاہدہ سے فنا نہیں ہوتا۔ اور شریعت میں پہاڑ کے ریزہ ریزہ ہونے اور موسیٰ علیہ السلام کے ربانی ظہور الٰہی (التجلی) کے وقت بے ہوش ہونے کا ذکر آیا ہے۔\n\nاور ہم نے ذات حق (الحق) کے بارے میں صرف وہی جانا جو ہم پر ہے۔ اور ہم میں کامل اور اکمل موجود ہے۔ بے شک اللہ نے ہر چیز کو اس کی تخلیق عطا کی۔ پس جب اللہ نے اپنے بندے پر ان نعمتوں کو مقرر کیا اور اسے ان کی طرف راستہ دکھایا، تو فرمایا: **إِمَّا شاكِراً** (الإنسان: ۳) \"یا تو شکر گزار ہو کر\" تو وہ اس میں اضافہ کرے گا، کیونکہ ہم نے کہا کہ اس نے اسے صرف اپنے میں سے عطا کیا، مطلقاً عطا نہیں کیا۔ اور **وَإِمَّا كَفُوراً** (الإنسان: ۳) \"اور یا ناشکرا ہو کر\" تو وہ اسے اس سے چھین لے گا اور اس پر اسے عذاب دے گا۔ پس انسان کو چاہیے کہ وہ اپنے لیے احتیاط کرے کہ وہ کس راستے پر چلتا ہے۔ اور اللہ کے بیان کے بعد کوئی بیان نہیں۔ اور موسیٰ علیہ السلام نے بنی اسرائیل سے فرمایا: **إِنْ تَكْفُرُوا أَنْتُمْ وَمَنْ فِي الْأَرْضِ جَمِيعاً فَإِنَّ الله لَغَنِيٌّ حَمِيدٌ** (ابراہیم: ۸) \"اگر تم اور زمین میں رہنے والے سب کے سب کفر کرو، تو بے شک اللہ بے نیاز (غنی) اور تعریف کے لائق (حمید) ہے۔\" وہ تنبیہ کرتے ہیں کہ اللہ تعالیٰ نے عالم کو صرف عالم کے لیے پیدا کیا، اور اس نے انہیں جس چیز کی عبادت کا حکم دیا، وہ صرف اس لیے کہ وہ اسے اپنے نفس کے ذریعے پہچانیں۔ کیونکہ جب وہ اپنے نفس کو پہچانے گا تو اپنے رب کو پہچانے گا، پس اس کے رب کے بارے میں علم کا بدلہ سب سے بڑا بدلہ ہو گا۔ اور اسی لیے فرمایا: **إِلَّا لِيَعْبُدُونِ** (الذاریات: ۵۶) \"مگر اس لیے کہ وہ میری عبادت کریں۔\" اور وہ اس کی عبادت نہیں کریں گے جب تک کہ اسے پہچان نہ لیں۔ پس جب وہ اسے پہچان لیں گے تو اس کی ذاتی عبادت (عبادة ذاتية) کریں گے۔ پس جب وہ انہیں حکم دے گا تو وہ خاص عبادت (عبادة خاصة) کریں گے، جبکہ عام ذاتی عبادت باقی رہے گی۔ پس اس نے انہیں اس پر بدلہ دیا۔ پس اس نے انہیں صرف ان کے لیے پیدا کیا۔ اور اسی لیے اللہ تعالیٰ نے اپنے بارے میں فرمایا کہ وہ **غَنِيٌّ عَنِ الْعالَمِينَ** (آل عمران: ۹۷) \"عالمین سے بے نیاز (غنی) ہے۔\" اور موسیٰ نے زمین کا ذکر صرف اس لیے کیا کہ وہ اس میں ہر چیز کے وجود سے کامل ہے، اور وہ انسان ہے جو عالم کی حقائق کو جمع کرنے والا ہے۔ اور اس کا قول \"زمین میں\" اس لیے ہے کہ وہ فرمانبردار ہے، پس وہ عبودیت (العبودية) کے مقام کو محفوظ رکھنے والی ہے۔ گویا اس نے کہا: اگر تم اور اللہ کا ہر عبد کفر کرو، تو بے شک اللہ عالمین سے بے نیاز ہے۔ اور اسی لیے اللہ نے زمین کو خلافت (الخلافة) کا مقام اور اس کی منزل بنایا۔ گویا اس نے کنایہ کیا کہ میں زمین میں ایک خلیفہ بنانے والا ہوں جو اپنے نفس میں اپنے عبودیت (العبودية) کے مقام سے زائل نہیں ہو گا، یعنی وہ صفات جن کا اس نے اسے حکم دیا ہے، خلافت (الخلافة) کا مرتبہ اسے اس کے مرتبہ سے حجاب میں نہیں ڈالے گا۔ اور اسی لیے ہم نے اسے خلیفہ بنایا اور اسے امامت کے ساتھ ذکر نہیں کیا، کیونکہ خلیفہ اس نام کے حکم سے اس شخص کو طلب کرتا ہے جس نے اسے خلیفہ بنایا ہے، پس وہ جانتا ہے کہ وہ مغلوب ہے اور اس پر حکم لگایا گیا ہے۔ پس اس نے اسے صرف اسی چیز سے موسوم کیا جس میں اس کے لیے تذکرہ ہے، کیونکہ وہ نسیان، سہو اور غفلت پر فطرت کیا گیا ہے، پس خلیفہ کا نام اسے یاد دلاتا ہے کہ اسے کس نے خلیفہ بنایا ہے۔ اگر وہ اسے امامت کے ساتھ خلیفہ کہے بغیر امام بنا دیتا، تو شاید وہ اپنی امامت میں اس شخص سے مشغول ہو جاتا جس نے اسے امام بنایا، برخلاف اس کی خلافت کے، کیونکہ امامت میں خلافت کی طرح تذکیر کی قوت نہیں ہے۔ پس اس نے کامل جماعت کے حق میں فرمایا: **جَعَلَكُمْ خَلائِفَ فِي الْأَرْضِ** (فاطر: ۳۹) \"اس نے تمہیں زمین میں خلیفہ بنایا۔\" پس یہ ان کے کانوں میں پڑا، تو انہوں نے خلافت کے حکم سے عالم میں تصرف کیا۔ اور ابراہیم علیہ السلام سے فرمایا، جب اس نے انہیں آدم کی خلافت اور اللہ کے بندوں میں سے جسے وہ چاہے، سنایا: **إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً** (البقرہ: ۱۲۴) \"بے شک میں تمہیں لوگوں کے لیے امام بنانے والا ہوں۔\" جب اس نے جان لیا کہ وہ خلافت سے سیراب ہو چکے ہیں، تو اس کے بعد اسے کوئی پرواہ نہیں کہ وہ اسے کسی بھی نام سے موسوم کرے، جیسا کہ یحییٰ کو سید (سردار) کہا گیا۔\n\nاور جب عارفین (العارفون) نے اسے پہچانا، تو وہ ان لوگوں سے ممتاز ہو گئے جنہوں نے اسے اپنے غور و فکر سے پہچانا۔ پس ان کے لیے اطلاق (آزادی) تھی اور دوسروں کے لیے تقیید (پابندی)۔ پس عارفین (العارفون) اسے ہر چیز میں یا ہر چیز کے عین میں دیکھتے ہیں، اور جس نے اسے اپنے غور و فکر سے پہچانا، وہ اسے اس سے الگ تھلگ دیکھتا ہے، جو کہ اس کی تنزیہ نے اس کے لیے تقاضا کیا، پس اس نے اپنے آپ کو ایک طرف اور ذات حق (الحق) کو ایک طرف کر دیا، پس وہ اسے دور کی جگہ سے پکارتا ہے۔ اور چونکہ خلافت (الخلافة) اس شخص کی صورت میں ظاہر ہونے کا تقاضا کرتی ہے جس نے اسے خلیفہ بنایا ہے، اور جس نے اسے اپنا خلیفہ بنایا ہے، اس نے اپنے بارے میں ذکر کیا کہ وہ **عَلى‏ صِراطٍ مُسْتَقِيمٍ** (ہود: ۵۶) \"سیدھے راستے پر ہے۔\" پس ضروری ہے کہ یہ خلیفہ بھی ایک صراط (راستہ) پر ہو۔ پس اس نے راستوں پر غور کیا تو انہیں بہت سے پایا، ان میں سے **صِراطِ الله** (اللہ کا راستہ)، اور ان میں سے **صِراطِ الْعَزِيزِ** (عزیز کا راستہ)، اور ان میں سے رب کا راستہ، اور ان میں سے محمد صلی اللہ علیہ وسلم کا راستہ، اور ان میں سے نعمتوں کا راستہ، اور وہ **صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ** (الفاتحہ: ۷) \"ان لوگوں کا راستہ جن پر تو نے انعام کیا\" ہے، اور وہ اس کا قول ہے: **لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً وَمِنْهاجاً** (المائدہ: ۴۸) \"تم میں سے ہر ایک کے لیے ہم نے ایک شریعت اور ایک طریقہ مقرر کیا۔\" پس اس محمدی امام نے محمد صلی اللہ علیہ وسلم کے راستے کو اختیار کیا اور باقی تمام راستوں کو چھوڑ دیا، باوجود اس کے کہ وہ انہیں مقرر کرتا ہے اور ان پر ایمان رکھتا ہے، لیکن اس نے اپنے نفس کو صرف محمد صلی اللہ علیہ وسلم کے صراط (راستہ) کے ساتھ ہی عبادت میں لگایا، اور اپنی رعایا کو بھی صرف اسی کے ساتھ عبادت میں لگایا۔ اور اس نے ہر صراط (راستہ) کی تمام صفات کو اس کی طرف لوٹا دیا، کیونکہ اس کی شریعت عام ہے۔ پس تمام شرائع کا حکم اس کی شریعت کی طرف منتقل ہو گیا، پس اس کی شریعت ان سب کو شامل ہے اور وہ اسے شامل نہیں کرتیں۔\n\nان میں سے **صِراطِ الله** (اللہ کا راستہ) ہے، اور وہ عام صراط (راستہ) ہے جس پر تمام امور چلتے ہیں اور انہیں اللہ تک پہنچاتے ہیں، پس اس میں ہر الٰہی شریعت اور عقلی موضوع داخل ہے۔ پس یہ اللہ تک پہنچاتا ہے، پس یہ بدبخت اور نیک بخت سب کو شامل ہے۔ پھر اس پر چلنے والا یا تو صاحب شہود الٰہی (شہود إلهي) ہو گا یا محجوب۔ اگر وہ صاحب شہود الٰہی (شہود إلهي) ہے، تو وہ شہود کرتا ہے کہ اسے چلایا جا رہا ہے، پس وہ جبر کے حکم سے سالک ہے، اور وہ دیکھتا ہے کہ اسے چلانے والا اس کا رب تعالیٰ ہے، اور اس کا رب **عَلى‏ صِراطٍ مُسْتَقِيمٍ** (ہود: ۵۶) \"سیدھے راستے پر ہے۔\" اسی طرح اس نے ہم پر تلاوت کی، سبحانہ و تعالیٰ، کہ ہود علیہ السلام نے یہ کہا، اور وہ اللہ کے رسولوں میں سے ایک رسول ہیں۔ پس اسی لیے اس کا انجام رحمت کی طرف ہو گا۔ اور اگر اسے راستے میں تھکاوٹ محسوس ہو، تو یہ وہ عوارض ہیں جو اسے ان شؤون (معاملات) کی وجہ سے پیش آئے جن میں ذات حق (الحق) ہر روز ہوتا ہے۔ اور یہ اس کا قول ہے: **كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ** (الرحمن: ۲۹) \"وہ ہر دن ایک نئے معاملے میں ہے۔\" اور یہ ممکن نہیں کہ معاملہ اس کے سوا کچھ اور ہو۔ اور رسولوں علیہم الصلاۃ والسلام سے بڑھ کر کوئی بھی امور کا کشف (الکشف) کرنے والا، حقائق کا شہود (الشهود) کرنے والا، اور اللہ تک کے راستوں کا جاننے والا نہیں ہے، اس کے باوجود وہ الٰہی شؤون سے محفوظ نہیں رہے، پس انہیں نفسانی تکلیف دہ امور پیش آئے، جیسے ان کی دعوت کا رد کیا جانا، اور جو کچھ وہ ذات حق (الحق) کے بارے میں سنتے ہیں جس سے اس کا جلال پاک ہے، اور اس حق کے بارے میں جو وہ اللہ کی طرف سے لائے ہیں۔ اور اسی طرح محسوس تکلیف دہ امور، جیسے بیماریاں، زخم، اور اس دنیا میں مار پیٹ۔ اور یہ ایک عام امر ہے جو ان کے اور دوسروں کے لیے ہے۔ اور ان تکالیف میں نیک بخت اور بدبخت برابر ہیں۔ اور **كُلٌّ يَجْرِي** (الرعد: ۲) \"ہر ایک چل رہا ہے\" اس میں اللہ کے ہاں **إِلى‏ أَجَلٍ مُسَمًّى** (الرعد: ۲) \"ایک مقررہ مدت تک۔\"\n\nپس ان میں سے بعض کی مدت ان کی موت تک دراز ہوتی ہے اور وہ دائمی راحت اور عام شامل رحمت میں داخل ہو جاتے ہیں، اور وہ وہ لوگ ہیں جنہیں **الْفَزَعُ الْأَكْبَرُ** (الانبیاء: ۱۰۳) \"بڑی گھبراہٹ\" غمگین نہیں کرے گی، اور وہ نہ اپنے آپ پر اور نہ اپنی امتوں پر خوف کھائیں گے۔ کیونکہ وہ دنیا اور آخرت میں مجہول تھے۔ اور وہ وہ لوگ ہیں جن پر رسول رشک کرتے ہیں اس راحت کی وجہ سے جس میں وہ ہیں، کیونکہ رسول علیہم السلام بڑی گھبراہٹ کے دن اپنی امتوں اور پیروکاروں پر خوف کھاتے ہیں، نہ کہ اپنے آپ پر۔ اور ان میں سے بعض کی مدت (اجل) عرض (حساب) سے جنت میں داخل ہونے تک دراز ہوتی ہے۔ اور ان میں سے بعض کی مدت تکالیف میں دراز ہوتی ہے یہاں تک کہ ان کے لیے شفاعت کی جاتی ہے کہ وہ آگ سے نکل کر جنت میں جائیں۔ اور ان میں سے بعض کی مدت تکالیف میں دراز ہوتی ہے یہاں تک کہ اللہ انہیں خود ہی نکالتا ہے، کسی شفاعت کرنے والے کی شفاعت سے نہیں، اور وہ نظری توحید (توحید بطریق النظر) والے ہیں جنہوں نے کبھی بھی شارع کے بہترین قول پر ایمان نہیں لایا اور نہ کفر کیا اور نہ عمل کیا۔ کیونکہ وہ مومن نہیں تھے، لیکن انہوں نے اللہ جل جلالہ کی توحید بیان کی اور اسی پر مرے۔ اور ان میں سے جس کو اللہ کے بارے میں علم تھا اور وہ اسی پر مرا، تو اس نے اپنے علم کا پھل کاٹا۔ اگر اس میں کوئی شبہ پیدا ہوا جس نے اسے حیران کر دیا یا اسے اس عقیدہ سے پھیر دیا جسے وہ علم سمجھتا تھا، اور وہ درحقیقت علم تھا، پھر اس کے لیے وہ چیز ظاہر ہوئی جس نے اسے حیران کر دیا یا اس سے پھیر دیا، تو وہ قیامت کے دن جان لے گا کہ وہ درحقیقت حق تھا، اور وہ ان لوگوں میں سے ہے جنہیں اللہ آگ سے نکال کر جنت میں داخل کرے گا، تو اس علم کا پھل اس پر لوٹ آئے گا اور وہ اپنا درجہ حاصل کرے گا۔ اور ان میں سے بعض کی مدت تکالیف میں دراز ہوتی ہے جو آگ سے نکلنے والے نہیں ہیں، اور وہ اس کے مستقل باشندے ہیں، اور ان کی مدت ہمارے نزدیک معلوم ہے۔ پھر وہ جہنم میں ہوتے ہوئے بھی اللہ کی رحمت سے عام ہو جاتے ہیں، پس اللہ ان کے لیے وہاں ایک نعمت بنا دیتا ہے، اس طرح کہ وہ جنت کو دیکھ کر اسی طرح تکلیف محسوس کرتے ہیں جیسے اہل جنت آگ کو دیکھ کر تکلیف محسوس کرتے ہیں۔ پس یہ لوگ اگر انہیں اللہ کے وجود کا علم تھا اور ان میں اللہ کی توحید کے بارے میں یا اللہ کی جناب سے متعلق کسی علم کے بارے میں شبہ داخل ہو گیا جس نے انہیں حیران کر دیا یا انہیں اس کے برعکس کی طرف پھیر دیا جس کا وہ اعتقاد رکھتے تھے، تو قیامت کے دن جب ان پر یہ واضح ہو جائے گا کہ وہ درحقیقت علم تھا، تو یہ وضاحت انہیں فائدہ نہیں دے گی، جیسا کہ دنیا میں عذاب کو دیکھ کر ایمان لانا فائدہ نہیں دیتا۔ پس وہ علم اس مومن کو عطا کیا جائے گا جسے موحد مومنوں میں سے الٰہ (الإله) کا علم نہیں تھا، اور اس موحد مومن کی جہالت لے لی جائے گی اور اس شخص پر ڈال دی جائے گی جو اہل نار میں سے ہے، پس وہ اس جہالت کے ساتھ آگ میں نعمت حاصل کرے گا، جیسا کہ جاہل مومن دنیا میں اس سے نعمت حاصل کرتا تھا۔ اور مومن کو وہ علم عطا کیا جائے گا جو اس شخص کے لیے تھا جسے اللہ کے وجود کا علم تھا، نہ کہ اس کی توحید کا، اور جب اس نے توحید بیان کی تو اس کی توحید میں شبہ پیدا ہوا اور اللہ کے بارے میں اس کے علم نے اسے حیران کر دیا اور پھیر دیا۔ اور یہ اہل نار کے لیے تکالیف کی آخری مدت ہے۔ اور اس مدت کے ختم ہونے کے بعد، ہر طرف سے نعمت ہی نعمت ہو گی، اور اس میں اور جہنم کے آباد کاروں، جیسے خازنوں اور حیوانات، کے درمیان کوئی فرق نہیں ہو گا۔ پس وہ انہیں ڈستے ہیں، کیونکہ سانپ اور بچھو کو اس ڈسنے میں نعمت اور راحت ملتی ہے، اور ڈسا جانے والا اس ڈسنے میں لذت اور اعضاء میں سکون اور جوارح میں بے حسی پاتا ہے، وہ ہمیشہ ہمیشہ اس سے لذت حاصل کرتا ہے۔ کیونکہ رحمت غضب پر سبقت لے گئی ہے۔ پس جب تک ذات حق (الحق) غضب کے ساتھ موصوف ہے، اہل جہنم پر تکالیف باقی رہیں گی جو اس کے مستقل باشندے ہیں۔ پس جب الٰہی غضب زائل ہو جائے گا، جیسا کہ ہم نے پہلے بیان کیا، اور آگ اس سے بھر جائے گی، تو تکالیف ختم ہو جائیں گی، اور وہ غضب آگ میں موجود نقصان دہ حیوانات میں پھیل جائے گا، پس وہ اہل نار کے حق میں جو کچھ ان سے ہوتا ہے، اس سے اپنی راحت کا ارادہ کرتے ہیں، اور اہل نار اس لذت کو پاتے ہیں جو وہ سانپ الٰہی غضب کی وجہ سے اللہ کے لیے انتقام لینے میں پاتا ہے۔ اور اسی طرح آگ بھی۔ اور آگ اور جو اس میں ہیں، وہ نہیں جانتے کہ اس کے باشندے اس کی لذت پاتے ہیں، کیونکہ وہ نہیں جانتے کہ کب راحت نے ان کی جگہ لے لی اور رحمت نے ان میں حکم کیا۔\n\nاور یہ وہ صراط (راستہ) ہے جس کے بارے میں اہل اللہ کہتے ہیں کہ اللہ تک کے راستے مخلوقات کے سانسوں کی تعداد کے برابر ہیں۔ اور ہر سانس دل سے صرف اس اعتقاد کے ساتھ نکلتا ہے جو دل میں اللہ کے بارے میں ہے۔ پس عام اعتقاد اس کا وجود ہے۔ پس جس نے اسے دہر (زمانہ) قرار دیا، تو اس کا اللہ تک پہنچنا اس کے اسم دہر (الدهر) سے ہو گا، کیونکہ اللہ متقابل اور غیر متقابل اسماء کو جمع کرنے والا ہے۔ اور ہم پہلے بیان کر چکے ہیں کہ وہ سبحانہ و تعالیٰ ہر اس نام سے موسوم ہوا جس کی ضرورت اس کے قول میں ہے: **يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ** (فاطر: ۱۵) \"اے لوگو! تم اللہ کے محتاج ہو، اور اللہ ہی بے نیاز (الغني) اور تعریف کے لائق (الحميد) ہے۔\" اور اگرچہ وہ اس کا انکار کرے، تو اللہ نے اس کا انکار نہیں کیا اور نہ ہی حال نے۔ اور اسی طرح جس نے یہ اعتقاد رکھا کہ وہ طبیعت ہے، تو وہ اس پر طبیعت میں ظہور الٰہی (التجلی) کرے گا۔ اور جس نے یہ اعتقاد رکھا کہ وہ ایسا ہے، تو وہ اس کے اعتقاد کی صورت میں اس پر ظہور الٰہی (التجلی) کرے گا، اور احکام اسی طرح جاری ہوں گے جیسا کہ ہم نے بغیر کسی زیادتی کے ذکر کیا۔ پس سمجھو۔\n\n### [صراط العزت]\n\nاور جہاں تک صراط العزت (صراط العزة) کا تعلق ہے، اور وہ اللہ تعالیٰ کا قول ہے: **إِلى‏ صِراطِ الْعَزِيزِ الْحَمِيدِ** (سبا: ۶) \"عزیز (غالب) اور حمید (تعریف کے لائق) کے راستے کی طرف۔\" تو جان لو کہ یہ تنزیہ (التنزيه) کا صراط (راستہ) ہے۔ پس اسے ذوقاً صرف وہی حاصل کرتا ہے جو اپنے آپ کو کسی بھی پہلو سے یا ہر پہلو سے رب یا سید ہونے سے پاک کرے۔ اور یہ عزیز (نایاب) ہے، کیونکہ انسان غفلت کرتا ہے، سہو کرتا ہے، بھول جاتا ہے، اور کہتا ہے \"میں\"، اور اپنی غفلت کے وقت دوسرے بندوں پر اپنے لیے سیادت (سرداری) کا مرتبہ دیکھتا ہے۔ پس جب یہ ناگزیر ہے، تو اسے کوشش کرنی چاہیے کہ موت کے وقت وہ خالص عبد ہو، جس میں کسی بھی مخلوق پر سیادت (سرداری) کا کوئی شائبہ نہ ہو، اور وہ اپنے آپ کو عالم کی ہر چیز کا محتاج دیکھے، اس حیثیت سے کہ وہ ذات حق (الحق) کا عین ہے، اس اسم کے پردے کے پیچھے جس کے بارے میں اللہ نے اس شخص کے لیے فرمایا جسے اس امر کا علم نہیں: **قُلْ سَمُّوهُمْ** (الرعد: ۳۳) \"کہو کہ ان کے نام لو۔\" اور چونکہ انسان بالذات فقیر ہے، اللہ نے اس کے لیے اسباب کے ذریعے پردہ کر دیا، اور اس عبد کی نظر کو ان کی طرف کر دیا، جبکہ وہ ان کے پیچھے ہے۔ پس اس نے انہیں عین (وجود) کے طور پر ثابت کیا اور حکم کے طور پر ان کی نفی کر دی، جیسے اللہ تعالیٰ کا محمد صلی اللہ علیہ وسلم سے قول: **وَما رَمَيْتَ إِذْ رَمَيْتَ وَلكِنَّ الله رَمى‏** (الانفال: ۱۷) \"اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا۔\" پھر اس آیت کے بعد فرمایا: **وَلِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلاءً حَسَناً** (الانفال: ۱۷) \"اور تاکہ وہ مومنوں کو اپنی طرف سے اچھی آزمائش میں ڈالے۔\" پس اس نے اسے بلاء (آزمائش) قرار دیا، یعنی امتحان۔\n\nاور یہ صراط عزیز (صراط العزيز) ہے جس میں کسی مخلوق کو علم میں قدم حاصل نہیں، کیونکہ یہ اللہ کا صراط (راستہ) ہے جس پر وہ ہماری مخلوق کی طرف نازل ہوتا ہے، اور اسی پر وہ ہمارے ساتھ ہوتا ہے جہاں بھی ہم ہوں۔ اور اسی پر وہ عرش سے آسمان دنیا اور زمین کی طرف نازل ہوا۔ اور یہ اس کا قول ہے: **وَهُوَ الله فِي السَّماواتِ وَفِي الْأَرْضِ** (الانعام: ۳) \"اور وہی اللہ آسمانوں میں اور زمین میں ہے۔\" اور اسی پر وہ اپنے بندے کے قریب ہوتا ہے، اس سے کئی گنا زیادہ جتنا اس کا بندہ اس کی طرف اس راستے سے کوشش کرتا ہے جو اس نے اس کے لیے مقرر کیا ہے۔ پس وہ اس کی طرف دوڑتا ہے جب وہ اسے آتے ہوئے دیکھتا ہے، اپنے بندے کی فکر اور اس کے اکرام کے لیے۔ لیکن یہ صراط العزت (صراط العزة) پر ہوتا ہے، اور یہ نزول (نزول) کا صراط ہے، اس میں مخلوق کے لیے کوئی عروج نہیں۔ اور اگر کسی مخلوق کے لیے اس میں سلوک ہوتا تو یہ عزیز (غالب) نہ ہوتا۔ اور وہ ہماری طرف صرف ہمارے ذریعے نازل ہوا، پس صفت ہمارے لیے ہے نہ کہ اس کے لیے۔ پس ہم ہی اس صراط (راستہ) کا عین ہیں۔ اور اسی لیے اس نے اسے حمید (الحميد) سے موسوم کیا، یعنی حامد (تعریف کرنے والا) اور محمود (جس کی تعریف کی جائے)، کیونکہ فعیل جب آتا ہے تو وہ اسم فاعل اور اسم مفعول دونوں کا تقاضا کرتا ہے۔ یا تو وہ دونوں امور کو ایک ساتھ عطا کرتا ہے، جیسے یہ، یا وہ قرینہ حال کی وجہ سے ایک امر کو عطا کرتا ہے۔ اور اس نے اپنی تعریف خود کی، پس وہ حامد (الحامد) اور محمود (المحمود) ہے۔ اور ہمارے نزدیک سب سے بڑی تعریف جو اس نے اپنی کی، وہ یہ ہے کہ اس نے آدم کو اپنی صورت پر پیدا کیا اور اسے امہات الاسماء (بنیادی اسماء) سے موسوم کیا جن کے احاطہ میں ہر اسم داخل ہوتا ہے۔ اور اسی لیے نبی صلی اللہ علیہ وسلم نے فرمایا:\n\n> **أنت كما أثنيت على نفسك‏**\n> \"تو ویسا ہی ہے جیسا تو نے اپنی تعریف کی۔\"\n\nپس اس نے کامل نفس کو اپنی طرف ملکیت اور تشریف کی اضافت سے منسوب کیا جب فرمایا:\n\n> **من عرف نفسه عرف ربه‏**\n> \"جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا۔\"\n\nپس ہر وہ تعریف جو اللہ نے انسان کامل (الإنسان الکامل) کی کی جو کہ اس کا نفس ہے، اس لیے کہ اس نے اسے اپنی صورت پر موجود کیا، وہ تعریف بعینہٖ اللہ کی تعریف تھی، رسول اللہ صلی اللہ علیہ وسلم کی شہادت اور ہمارے لیے اس کے تعارف کے ذریعے:\n\n> **قوله صَلَّى اللهُ عَليهِ وسَلَّم أنت كما أثنيت على نفسك‏**\n> \"آپ صلی اللہ علیہ وسلم کا قول: تو ویسا ہی ہے جیسا تو نے اپنی تعریف کی۔\"\n\nیعنی جو کچھ بھی تو نے اس کی تعریف کی جسے تو نے اپنی صورت پر پیدا کیا، وہ تیری ہی تعریف ہے۔\n\nاور چونکہ انسان کامل (الإنسان الکامل) صراط العزیز الحمید (صراط العزيز الحميد) ہے، اس لیے صراط (راستہ) کے لیے یہ ممکن نہیں کہ اس میں سلوک کیا جائے، اور صراط سلوک کے ساتھ متصف نہیں ہوتا۔ اسی لیے اس نے اسے عزیز (العزيز) سے موسوم کیا، یعنی یہ اس کے نفس کے لیے ممنوع ہے۔ پس ذات حق (الحق) سبحانہ و تعالیٰ اس میں نزول کے ساتھ خاص ہے، جیسا کہ اس نے اپنے بارے میں نزول اور دوڑنے کی خبر دی۔ اور حقیقی عارف عبد صرف اللہ میں ہی سلوک کرتا ہے، پس اللہ ہی اس کا صراط (راستہ) ہے، اور وہی اس کی شریعت ہے۔\n\n> **به رباطي وبنا رباطه *** فهو صراطي وأنا صراطه‏**\n> اس کے ساتھ میرا رباط (لگاؤ) ہے اور ہمارے ساتھ اس کا رباط، پس وہ میرا صراط ہے اور میں اس کا صراط ہوں۔\n> **فانظر مقالي فهو قول صادق *** محكم محقق مناطه‏**\n> پس میرے قول پر غور کرو، یہ سچا قول ہے، محکم ہے، جس کا تعلق ثابت ہے۔\n> **فهو حبيبي وأنا به فقد *** حواه قلبي فإنا فسطاطه‏**\n> پس وہ میرا محبوب ہے اور میں اس کے ساتھ ہوں، میرے دل نے اسے گھیر لیا ہے، پس ہم اس کا خیمہ ہیں۔\n> **عز فما تدركه أبصارنا *** لقربه فقد طوى بساطه‏**\n> وہ عزیز ہے، ہماری آنکھیں اسے اس کے قرب کی وجہ سے نہیں پا سکتیں، اس نے اپنا بستر لپیٹ لیا ہے۔\n> **فبعده لقربه ليس سوى *** هذا وما قد قلته استنباطه‏**\n> پس اس کا قرب کی وجہ سے دور ہونا اس کے سوا کچھ نہیں، اور جو کچھ میں نے کہا ہے وہ اس کا استنباط ہے۔\n\nپس وہ صراط عزیز (صراط عزيز) پر ہے، کیونکہ وہ خالق ہے، پس مخلوق کے لیے اس میں کوئی قدم نہیں۔ مجھے دکھاؤ کہ اس کے سوا دوسروں نے کیا پیدا کیا؟ وہ اسے بالکل نہیں پائیں گے، نہ علم میں اور نہ عین میں۔ **بَلِ الظَّالِمُونَ فِي ضَلالٍ مُبِينٍ** (لقمان: ۱۱) \"بلکہ ظالم کھلی گمراہی میں ہیں۔\" کیونکہ جو کچھ بھی معلوم ہوا، وہ ظاہر ہو گیا۔ اور اللہ تعالیٰ نے ہمیں عدم کی تاریکی سے وجود کے نور کی طرف نکالا، پس ہم اپنے رب کے اذن سے نور بن گئے، **إِلى‏ صِراطِ الْعَزِيزِ الْحَمِيدِ** (سبا: ۶) \"عزیز (غالب) اور حمید (تعریف کے لائق) کے راستے کی طرف۔\" پس اس نے ہمیں نور سے حیرت (الحيرة) کی تاریکی کی طرف منتقل کر دیا۔ اور اسی لیے جب ہم اسے اپنی تعریف کرتے ہوئے سنتے ہیں، تو ہم اسے اپنے نفوس میں دیکھتے ہیں، اور جب وہ ہماری تعریف کرتا ہے، تو ہم دیکھتے ہیں کہ جو تعریف اس نے ہماری کی، وہ اس کی اپنی تعریف ہے۔ پھر اس نے ہمیں اپنے سے ممتاز کیا اور اپنے آپ کو ہم سے ممتاز کیا **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (الشوریٰ: ۱۱) \"اس کی مثال کوئی چیز نہیں\" کے ذریعے، اور اس چیز کے ذریعے جو اس نے جانا اور ہم نے نہیں جانا، اور اس ذلت کے ذریعے جس پر ہم ہیں، اور وہ اپنے نفس میں اس صفت سے بلند ہے۔ پس ہم کہتے ہیں کہ ہم وہ ہیں، لیکن ہم وہ نہیں ہیں، جب ہم نے کہا کہ اس نے ہمیں تاریکیوں سے نور کی طرف نکالا، وہ وہ ہے اور ہم ہم ہیں۔ پس ہم ممتاز ہو گئے۔ پس جب ہماری موجودگی کے بعد تعریف آئی، تو وہ اس کی طرف سے اپنی اور ہماری تعریف تھی، اور اس نے ہمیں اپنی تعریف کا مکلف کیا، تو اس نے ہمیں حیرت (الحيرة) میں کھڑا کر دیا۔ پس اگر ہم نے اپنی طرف سے اس کی تعریف کی، تو ہم نے اسے مقید کر دیا، اور اگر ہم نے اسے مطلق چھوڑ دیا، جیسا کہ اس نے فرمایا:\n\n> **لا أحصي ثناء عليك‏**\n> \"میں تیری تعریف کا احاطہ نہیں کر سکتا۔\"\n\nتو ہم نے اسے اطلاق کے ساتھ مقید کر دیا، پس ہم نے اسے ممتاز کر دیا۔ اور جو مقید ہو جائے، اسے غنی (بے نیاز) سے موصوف نہیں کیا جاتا، کیونکہ تقیید اسے باندھ دیتی ہے، جب کہ محدث نے اس کے اطلاق کو پا لیا ہے۔ اور اس نے اپنے بارے میں فرمایا کہ وہ **غَنِيٌّ عَنِ الْعالَمِينَ** (آل عمران: ۹۷) \"عالمین سے بے نیاز (غنی) ہے۔\" پس اس نے ہمیں حیران کر دیا، پس ہم نہیں جانتے کہ وہ کیا ہے اور ہم کیا ہیں۔ پس میں نہیں سمجھتا، اور اللہ بہتر جانتا ہے، کہ اس نے ہمیں اپنی معرفت کا حکم دیا اور اسے حاصل کرنے میں ہمیں ہمارے نفوس پر حوالہ کیا، مگر اس لیے کہ وہ جانتا تھا کہ ہم اپنے نفوس کی حقیقت کو نہیں پا سکتے اور نہ جان سکتے، اور ہم اپنے ذریعے اپنی معرفت سے عاجز ہیں، تو یہ اس کی معرفت ہو گی نہ کہ معرفت۔\n\n> **وغير هذا فلا يكون *** فإنه ظاهر مبين‏**\n> اور اس کے سوا کچھ نہیں ہو سکتا، کیونکہ وہ ظاہر اور واضح ہے۔\n> **فاصغ إلى قولنا تجده *** علما وقد جاءك اليقين‏**\n> پس ہمارے قول پر کان دھرو، تم اسے علم پاؤ گے، اور تمہارے پاس یقین آ چکا ہے۔\n\nپس جہالت (الجهل) عبد کی ذاتی صفت ہے، اور پورا عالم عبد ہے، اور علم (العلم) اللہ کی ذاتی صفت ہے۔ پس جو کچھ میں نے اس میں اشارہ کیا ہے، اس کے مجموعہ کو لے لو، تم اسے صراط عزیز (الصراط العزيز) پاؤ گے۔\n\n### [صراط الرب‏]\n\nاور جہاں تک تمہارے رب کے صراط (صراط ربك) کا تعلق ہے، تو اللہ تعالیٰ نے اپنے اس قول سے اس کی طرف اشارہ کیا: **فَمَنْ يُرِدِ الله أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ وَمَنْ يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّما يَصَّعَّدُ فِي السَّماءِ** (الانعام: ۱۲۵) \"پس جسے اللہ ہدایت دینا چاہے، وہ اس کا سینہ اسلام کے لیے کھول دیتا ہے، اور جسے وہ گمراہ کرنا چاہے، وہ اس کا سینہ تنگ اور گھٹا ہوا کر دیتا ہے، گویا وہ آسمان میں چڑھ رہا ہے۔\" وہ کہتا ہے:\n\n\"گویا وہ اپنی فطرت سے باہر نکل رہا ہے، حالانکہ کوئی چیز اپنی حقیقت سے باہر نہیں نکلتی۔\" **كَذلِكَ يَجْعَلُ الله الرِّجْسَ عَلَى الَّذِينَ لا يُؤْمِنُونَ** (الانعام: ۱۲۵) \"اسی طرح اللہ رجس (ناپاکی) ان لوگوں پر ڈالتا ہے جو ایمان نہیں لاتے۔\"\n\nاور یہ اس نے اس چیز کی طرف اشارہ کیا جو پہلے ذکر ہو چکا ہے: **صِراطُ رَبِّكَ مُسْتَقِيماً** (الانعام: ۱۲۶) \"تمہارے رب کا راستہ سیدھا ہے۔\" اور اس نے شرح (کشادہ کرنا) اور ضیق (تنگی) کے اپنے ارادے کے سوا کچھ ذکر نہیں کیا، پس عالم میں ان دونوں کا ہونا ضروری ہے، کیونکہ وہی ہوتا ہے جو وہ چاہتا ہے۔ اور وہ موجود ہے۔ پھر اس نے اپنے آپ کو غضب، رضا، تردد، اور کراہت (ناپسندیدگی) سے موصوف کیا، پھر واجب کیا اور فرمایا: اور کراہت کے باوجود اسے مجھ سے ملنا ضروری ہے۔ پس یہ بعینہٖ اس کا قول ہے: **كَأَنَّما يَصَّعَّدُ فِي السَّماءِ** (الانعام: ۱۲۵) \"گویا وہ آسمان میں چڑھ رہا ہے۔\" پس یہ اختیار میں جبر کی طرح ہے۔ پس اللہ کے بندوں میں سے جس سے بھی ان دو صفات میں سے کوئی ایک اٹھا لی جائے، وہ بالکل کامل نہیں ہے۔ اور اسی لیے کامل کے حق میں فرمایا: **وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ فَاصْبِرْ** (الحجر: ۹۷) \"اور ہم یقیناً جانتے ہیں کہ جو کچھ وہ کہتے ہیں اس سے تمہارا سینہ تنگ ہوتا ہے، پس صبر کرو۔\"\n\nاور وہ اپنی مخلوق کی اذیت پر صبر کرنے والا ہے۔\n\nاور اس صراط (راستہ) کو صراط الرب (صراط الرب) کہا گیا کیونکہ یہ مربوب (جس کی پرورش کی جائے) کا تقاضا کرتا ہے، اور اسے سیدھا قرار دیا۔ پس جو اس سے باہر نکلا، وہ منحرف ہو گیا اور استقامت سے باہر ہو گیا۔ اور اسی لیے ہمارے لیے اللہ کے لیے محبت اور اللہ کے لیے بغض کو مشروع کیا، اور اسے اس کے لیے خاص عمل قرار دیا، جس میں عبد کا کوئی حصہ نہیں سوائے اس کے جو اللہ اسے اس پر بدلے میں عطا کرتا ہے، اور وہ یہ ہے کہ اللہ اس سے دشمنی رکھے جو اس کے اولیاء سے دشمنی رکھے اور اس سے دوستی رکھے جو ان سے دوستی رکھے۔ پس صراط الرب (صراط الرب) پر چلنے والا وہ ہے جو ان دونوں صفات کے ساتھ قائم ہو، لیکن اس حق کے ساتھ جو اس کے لیے اللہ کے لیے مشروع کیا گیا ہے، نہ کہ اپنے نفس کے لیے۔ کیونکہ اللہ اپنے بندوں میں سے کسی کے لیے کھڑا نہیں ہوتا مگر اس کے لیے جو اس کے لیے کھڑا ہو۔ اور اسی لیے فرمایا: **وَلا يَخافُونَ لَوْمَةَ لائِمٍ** (المائدہ: ۵۴) \"اور وہ کسی ملامت کرنے والے کی ملامت سے نہیں ڈرتے۔\" اور جب اللہ کا حق اور مخلوق کا حق جمع ہو جائیں، تو اللہ کا حق مخلوق کے حق سے زیادہ حقدار ہے کہ اسے پورا کیا جائے۔ کیونکہ مخلوق کا کوئی حق نہیں مگر اللہ کے بنانے سے۔ پس جب دونوں حق کسی وقت متعین ہو جائیں، تو کامیاب عبد پہلے اللہ کے حق کو پورا کرنے سے شروع کرتا ہے جو اس کے لیے ہے، پھر مخلوق کے حق کو ادا کرنے میں لگ جاتا ہے جسے اللہ نے واجب کیا ہے۔ اور یہ اس کے خلاف ہے جس پر آج فقہاء وصیت اور قرض کے بارے میں ہیں۔ کیونکہ اللہ تعالیٰ نے وصیت کو قرض پر مقدم کیا، اور وصیت اللہ کا حق ہے۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا:\n\n> **حق الله أحق أن يقضى‏**\n> \"اللہ کا حق زیادہ حقدار ہے کہ اسے پورا کیا جائے۔\"\n\nپس جس نے اللہ کے حق میں نرمی کی، اس کا عمل اس پر لوٹ آئے گا، تو اس کے حق میں بھی نرمی کی جائے گی۔ اگر وہ بات کرے گا تو اسے کہا جائے گا: تم نے بھی ایسا ہی کیا تھا، پس اپنی لگائی ہوئی فصل کا پھل کاٹو۔ اور صراط الرب (صراط الرب) صرف تکلیف (تکلیف) کے ساتھ ہی ہوتا ہے۔ پس جب تکلیف اٹھا لی جائے گی، تو اس صراط کا کوئی وجودی عین باقی نہیں رہے گا۔ اور اسی لیے انجام رحمت کی طرف ہو گا، اور اس نے نافرمانوں میں الٰہی غضب کے حکم کو زائل کر دیا۔ اور ہود علیہ السلام کا قول: **إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ** (ہود: ۵۶) \"بے شک میرا رب سیدھے راستے پر ہے\" یعنی اس چیز میں جو اس نے مشروع کی، اس کے باوجود کہ وہ اپنے بندوں کی پیشانیوں کو اس طرف لے جا رہا ہے جو وہ ان سے واقع کرانا چاہتا ہے، اور اس جبر کے باوجود انہیں سزا دیتا ہے۔ پس اپنے دل کو لگاؤ اور ادب اختیار کرو اور سیدھے راستے پر چلو۔\n\n### [صراط المنعم‏]\n\nاور جہاں تک صراط المنعم (صراط المنعم) کا تعلق ہے، اور وہ ان لوگوں کا صراط (راستہ) ہے جن پر اللہ نے انعام کیا، اور وہ اللہ تعالیٰ کا قول ہے: **شَرَعَ لَكُمْ مِنَ الدِّينِ ما وَصَّى بِهِ نُوحاً وَالَّذِي أَوْحَيْنا إِلَيْكَ وَما وَصَّيْنا بِهِ إِبْراهِيمَ وَمُوسى‏ وَعِيسى‏** (الشوریٰ: ۱۳) \"اس نے تمہارے لیے دین میں سے وہی مقرر کیا جس کی وصیت اس نے نوح کو کی، اور جو ہم نے تمہاری طرف وحی کی، اور جس کی وصیت ہم نے ابراہیم، موسیٰ اور عیسیٰ کو کی۔\" اور اس نے انبیاء اور رسولوں کا ذکر کیا، پھر فرمایا: **أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ** (الانعام: ۹۰) \"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس تم ان کی ہدایت کی پیروی کرو۔\" اور یہ وہ صراط (راستہ) ہے جو ہر نبی اور رسول کو جامع ہے، اور وہ دین کو قائم کرنا ہے اور اس میں تفرقہ نہ ڈالنا اور اس پر جمع ہونا ہے۔ اور یہ وہی ہے جس پر بخاری نے باب باندھا: \"باب ما جاء أن الأنبياء دينهم واحد\" (باب اس بارے میں جو آیا ہے کہ انبیاء کا دین ایک ہے)۔ اور دین میں الف لام تعریف کے لیے لایا گیا ہے، کیونکہ وہ سب اللہ کی طرف سے ہے، اگرچہ اس کے بعض احکام مختلف ہیں، تو سب کو اسے قائم کرنے اور اس پر جمع ہونے کا حکم دیا گیا ہے۔ اور یہ وہ منہاج (طریقہ) ہے جس پر وہ متفق ہوئے، اور جس میں وہ احکام میں مختلف ہوئے، وہ شرعۃ (شریعت) ہے جسے اللہ نے ہر رسول کے لیے مقرر کیا۔ اللہ تعالیٰ فرماتا ہے: **لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً وَمِنْهاجاً** (المائدہ: ۴۸) \"تم میں سے ہر ایک کے لیے ہم نے ایک شریعت اور ایک طریقہ مقرر کیا۔\" **وَلَوْ شاءَ الله لَجَعَلَكُمْ أُمَّةً واحِدَةً** (المائدہ: ۴۸) \"اور اگر اللہ چاہتا تو تمہیں ایک ہی امت بنا دیتا۔\" تو تمہاری شرائع مختلف نہ ہوتیں، جیسا کہ وہ چیز مختلف نہیں ہوئی جس میں تمہیں جمع ہونے اور اسے قائم کرنے کا حکم دیا گیا۔ پس جب اختلاف اس کی طرف سے تھا، اور وہ عدل اور احسان والا ہے، اور لوگوں میں اپنے افعال کو اپنی طرف منسوب کرنے اور اپنے اختیار کردہ چیزوں میں اپنے اختیار کا دعویٰ تھا، اور انہوں نے امر کو اس کے اہل اور اس کے مستحق کی طرف منسوب نہیں کیا، تو رسولوں پر الٰہی حکم نازل ہوا کہ یہ برا ہے اور یہ اچھا ہے، اور یہ اطاعت ہے اور یہ نافرمانی ہے۔ اور عقلوں پر الٰہی حکم نازل ہوا کہ یہ اس شخص کے حق میں اچھا ہے جو اس کی طبیعت اور مزاج کے موافق ہو یا اس کے مقصد کے مطابق ہو، اور یہ جو اس کے مقصد کے مطابق نہ ہو اور اس کی طبیعت اور مزاج کے موافق نہ ہو، وہ اچھا نہیں ہے۔ اور انہوں نے امر کو ایک عین (ذات) کی طرف منسوب نہیں کیا، پس انہیں اس امر کی وجہ سے بدلہ دیا گیا جس کا انہیں بدلہ دیا گیا، پس اس نے برائی کے بدلے میں جو حکم دیا اس میں عدل کیا، اور حکم کے نفاذ کے بعد اس رحمت کے ذریعے احسان کیا جس کی طرف اس کے بندے لوٹے، اور ان پر سے مشکل امور، یعنی تکالیف، کو اٹھا لیا۔ پس اس کی رحمت ہر چیز پر عام ہو گئی۔\n\n### [خاص صراط، اور وہ نبی صلی اللہ علیہ وسلم کا صراط ہے]\n\nاور جہاں تک خاص صراط (الصراط الخاص) کا تعلق ہے، اور وہ نبی صلی اللہ علیہ وسلم کا صراط (راستہ) ہے جو آپ کے لیے جماعت کے بغیر خاص ہے، اور وہ قرآن ہے، اللہ کی مضبوط رسی، اور آپ کی جامع شریعت، اور وہ اللہ کا قول ہے: **وَأَنَّ هذا صِراطِي مُسْتَقِيماً فَاتَّبِعُوهُ وَلا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ** (الانعام: ۱۵۳) \"اور یہ میرا سیدھا راستہ ہے، پس اس کی پیروی کرو، اور دوسرے راستوں کی پیروی نہ کرو، ورنہ وہ تمہیں اس کے راستے سے بھٹکا دیں گے۔\" یعنی یہ وہ صراط (راستہ) ہے جو آپ کی طرف منسوب ہے۔ اور یہ اس لیے کہ محمد صلی اللہ علیہ وسلم نبی تھے جبکہ آدم پانی اور مٹی کے درمیان تھے، اور آپ قیامت کے دن لوگوں کے سردار ہیں، اس وحی کی خبر دینے کی وجہ سے جو آپ کی طرف وحی کی گئی، اور آپ کی عام بعثت اس بات کا اشارہ ہے کہ زمانے کے لحاظ سے آپ سے پہلے کی تمام شرائع آپ کی شریعت میں سے ہیں، پس آپ کی بعثت سے ان میں سے جو منسوخ ہونا تھا وہ منسوخ ہو گیا اور جو باقی رہنا تھا وہ باقی رہا، جیسا کہ آپ نے اس چیز کو منسوخ کیا جسے آپ نے حکم کے طور پر ثابت کیا تھا۔ اور ان میں سے یہ ہے کہ آپ کو جوامع الکلم (جامع کلمات) عطا کیے گئے، اور عالم اللہ کے کلمات ہیں۔ پس اللہ نے آپ کو اپنے کلمات میں حکم عطا کیا اور آپ نے عمومیت اختیار کی، اور آپ پر رسالت اور نبوت کو ختم کیا، جیسا کہ آپ نے باطناً آغاز کیا، ظاہراً ختم کیا۔ پس آپ کے لیے نبوی امر پہلے بھی تھا اور بعد میں بھی۔\n\nپس آپ کے ورثاء (الورثة) جنہیں احکام کے نفاذ میں اجتہاد کا حق حاصل ہے، وہ زمانے کے لحاظ سے آپ سے پہلے کے رسولوں کے مقام پر ہیں۔ پس جس نے محمد صلی اللہ علیہ وسلم کی جامعیت میں وراثت حاصل کی، تو اسے اللہ کی طرف سے حکم کی تعریف (تعریف) حاصل ہوئی، اور یہ اجتہاد سے اعلیٰ مقام ہے، اور وہ یہ ہے کہ اللہ اسے الٰہی تعریف کے ذریعے عطا کرے کہ اس مسئلہ میں رسول اللہ صلی اللہ علیہ وسلم کا لایا ہوا اللہ کا حکم یہ ہے۔ پس وہ اس حکم میں اس شخص کے مقام پر ہوتا ہے جس نے اسے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہو۔ اور جب اس کے پاس رسول اللہ صلی اللہ علیہ وسلم سے کوئی حدیث آتی ہے، تو وہ اس میں اللہ کی طرف رجوع کرتا ہے، پس وہ حدیث کی صحت یا سقم کو جان لیتا ہے، خواہ وہ حدیث اہل نقل کے نزدیک صحیح ہو یا اس کے بارے میں کلام کیا گیا ہو۔ پس جب وہ جان لیتا ہے، تو اس نے اپنا حکم اصل سے لیا ہے۔ اور ابو یزید نے اس مقام کی خبر دی، یعنی اللہ سے لینا، اپنے بارے میں کہا، جیسا کہ ہم نے ان سے روایت کیا ہے، وہ اپنے زمانے کے علماء سے مخاطب ہو کر کہتے تھے: \"تم نے اپنا علم مردہ سے مردہ کے ذریعے لیا، اور ہم نے اپنا علم اس زندہ سے لیا جو کبھی نہیں مرتا۔\" اور ہمیں الحمد للہ اس مقام میں ایک شریف ذوق حاصل ہے اس چیز میں جس کی شریعت نے ہمیں احکام میں عبادت کا حکم دیا ہے۔ اور یہ وہ چیز ہے جو اس امت کے لیے وحی میں سے باقی ہے، اور وہ تعریف (تعریف) ہے نہ کہ تشریع (قانون سازی)۔\n\nاور جہاں تک اہل اجتہاد (أهل الاجتهاد) کا تعلق ہے، تو ان کے احکام شریعت کی تشریع (قانون سازی) ہیں اگر وہ غلطی کرتے ہیں، کیونکہ رسول اللہ صلی اللہ علیہ وسلم ہی اس حکم کو مقرر کرنے والے ہیں۔ پس وہ ان کے لیے تشریع نہیں ہے، بلکہ وہ رسول اللہ صلی اللہ علیہ وسلم کی تشریع ہے۔ اور جب مجتہد درست ہوتا ہے، تو وہ ناقل شرع ہوتا ہے، یہ سب درحقیقت ہے۔ کیونکہ مجتہدین میں سے غلطی کرنے والا اور درست ہونے والا ایک ہی نہیں ہے، لیکن درحقیقت درست ہونے والا ناقل ہے، اور درحقیقت غلطی کرنے والا ایک نامعلوم حکم کو مقرر کرنے والا ہے جو صرف اس مجتہد کے غور و فکر کے وقت ہی معلوم ہوا ہے۔ پس وہ اللہ کے ہاں اس کے ہونے سے پہلے معلوم تھا۔ اور شارع، یعنی رسول، نے صرف اسی متعین حکم کو مقرر کیا جو اللہ کے ہاں معلوم تھا۔ اور وہ اس کے ہاں تفصیل اور تعین کے ساتھ معلوم نہیں تھا۔ پس غلطی کرنے والے مجتہد کا حکم تشریع کی تشریع تھا۔ اور اہل اللہ کے لیے شریعت میں کوئی حکم نہیں مگر وہی جو رسول اللہ صلی اللہ علیہ وسلم کے ہاں تعین کے ساتھ حکم کیا گیا ہے۔ اور وہ حقیقی ورثاء (الورثة) ہیں۔ کیونکہ وارث صرف اسی چیز کا وارث ہوتا ہے جو مورث کی ملکیت تھی جب وہ اس سے مر گیا۔ اور غلطی کرنے والے مجتہد کا حکم اس کی متعین ملکیت نہیں ہے کہ وہ اس سے وراثت میں ملے، پس وہ وارث نہیں ہے، کیونکہ اس کے پاس صرف وہی ہے جو اس کے غور و فکر نے اسے پہنچایا، جسے رسول اللہ صلی اللہ علیہ وسلم نے اس کے لیے مباح قرار دیا۔ پس وہ عصبہ (باقی ماندہ وارث) کی طرح ہے، جن کا میراث میں متعین حصہ نہیں ہوتا، بلکہ ان کے لیے وہی ہوتا ہے جو فرائض کو ان کے اہل کو دینے کے بعد باقی بچے۔ اور جیسے ذوی الارحام (رحمی رشتہ داروں) اور مسلمانوں کی وراثت فرائض لینے کے بعد۔ پس اگر وہ کسی صاحب فریضہ کے بغیر مر جائے، جیسے کوئی رسول یا نبی مر جائے اور کسی نے اس کی پیروی نہ کی ہو، تو وہ اکیلا حشر کیا جائے گا۔ تو اس امت میں سے جو اس حال یا حکم کو پائے، وہ اس کی خلق یا اس کے حال میں اس کا وارث ہو سکتا ہے، نہ کہ اس کے حکم میں۔\n\nاور جہاں تک اس پر ایمان لانے کا تعلق ہے، تو ہر وہ شخص جو محمد صلی اللہ علیہ وسلم پر ایمان لایا، اس نے ہر نبی، ہر کتاب، اور ہر صحیفہ پر ایمان لایا جو اللہ کی طرف سے آیا یا نازل ہوا، اس پر ایمان لانے کے لحاظ سے، نہ کہ حکم پر عمل کرنے کے لحاظ سے۔ پس کوئی نبی باقی نہیں رہا مگر اس پر ایمان لایا گیا۔ پس نبی محمد صلی اللہ علیہ وسلم کے لیے امامت اور تقدم ہے، اور تمام رسول اور انبیاء ایک صف میں آپ کے پیچھے ہیں، اور ہم رسولوں اور محمد کے پیچھے ہیں۔ اور رسولوں میں سے بعض ایسے ہیں جن کی حشر میں دو صورتیں ہوں گی، ایک صورت ہمارے ساتھ اور ایک صورت رسولوں کے ساتھ، جیسے عیسیٰ۔ اور تمام امتیں ہمارے پیچھے ہیں، سوائے اس کے کہ ہماری دو صورتیں ہیں: ایک صورت رسولوں علیہم السلام کی صف میں، اور یہ صرف اس امت کے علماء کے لیے ہے، اور ایک صورت رسولوں کے پیچھے ان پر ایمان لانے کے لحاظ سے۔ اور اسی طرح باقی امتوں کی بھی دو صورتیں ہیں: ایک صورت جس کے ذریعے وہ ہمارے پیچھے ہوں گی، اور ایک صورت جس کے ذریعے وہ اپنے رسولوں کے پیچھے ہوں گی۔ پس کبھی دیکھنے والے کی نظر ان کی صورتوں پر ہمارے پیچھے پڑتی ہے، اور کبھی ان کے رسولوں کے پیچھے، اور کبھی مجموعہ پر۔ پس یہ آخرت میں علماء کے حشر کے احوال ہیں۔\n\nاور جہاں تک افعال (الأفعال) کے ورثاء کا تعلق ہے، تو وہ وہ لوگ ہیں جنہوں نے رسول اللہ صلی اللہ علیہ وسلم کی ہر فعل اور ہیئت میں پیروی کی جو آپ پر تھی، ان چیزوں میں جن کی پیروی ہمارے لیے مباح ہے، یہاں تک کہ آپ کے نکاح کی تعداد میں، اور آپ کے کھانے پینے میں، اور تمام افعال جو آپ کی طرف منسوب ہیں جن میں اللہ نے آپ کو قائم کیا، جیسے اوراد، تسبیح، اور نماز، اس میں کوئی کمی نہیں کرتے۔ اگر وہ اسے حاصل کرنے کے بعد اس میں اضافہ کرتے ہیں، تو وہ اس میں صرف آپ صلی اللہ علیہ وسلم کے قول کے حکم سے اضافہ کرتے ہیں۔ پس یہ آپ کے افعال کی وراثت ہے۔ اور جہاں تک آپ کے احوال (الأحوال) کی وراثت کا تعلق ہے، تو وہ اس ذوق (ذوق) کا پانا ہے جو آپ اپنے نفس میں پاتے تھے، جیسے ملک کے ذریعے وحی میں، تو وارث اس ذوق کو ملکی لمہ (ملکی جھکاؤ) میں اور اس ملک سے پاتا ہے جو اسے سدھارتا ہے، اور خاص الٰہی وجہ سے واسطوں کے اٹھ جانے کے ساتھ، اور یہ کہ ذات حق (الحق) اس کا قول ہو، اور یہ کہ وہ قرآن کو اپنے اوپر نازل ہوتے ہوئے پڑھے، وہ اپنی تلاوت کے وقت اپنے دل پر نزول کی لذت کو ذوقاً پاتا ہے۔ کیونکہ ہر قاری کی تلاوت کے وقت، خواہ وہ اپنے نفس میں ہو یا اپنی زبان سے، قرآن کے لیے ایک الٰہی نزول ضروری ہے، پس وہ ہر قاری کے پڑھنے کے وقت نزول اور آنے والا ہوتا ہے۔ سوائے اس کے کہ حال کا وارث نزول کو محسوس کرتا ہے اور اس سے خاص لذت حاصل کرتا ہے جو اس کے سوا کوئی نہیں پاتا۔ پس وہ حال کی میراث کا مالک ہے۔ اور ہم نے الحمد للہ اسے حالاً چکھا ہے۔ اور یہ وہی ہے جس کے بارے میں ابو یزید نے کہا: \"میں اس وقت تک نہیں مرا جب تک کہ میں نے قرآن کو حفظ نہ کر لیا،\" اور وہ دلوں پر غیب سے نزول کی لذت کا وجود ہے۔ اور ان کے علاوہ، وہ صرف اپنے خیال سے قرآن پڑھتے ہیں، پس وہ اس کے مرقوم حروف کی صورتوں کا تصور کرتے ہیں اگر انہوں نے قرآن کو مصاحف اور تختیوں سے حفظ کیا ہو، یا وہ ان حروف کی صورتوں کا تصور کرتے ہیں جو انہوں نے اپنے معلم سے حاصل کیے، یہ تب ہے جب وہ اس پر عمل کرنے والے ہوں۔ اور اگر وہ اسے بغیر اخلاص کے پڑھیں، تو وہ ان کے حلق سے نیچے نہیں اترتا، یعنی اللہ ان سے کچھ بھی قبول نہیں کرتا، پس وہ اپنی تلاوت کی جگہ، یعنی مخرج صوت میں باقی رہتا ہے۔ پس قرآن کو اپنے دل سے صرف صاحب التنزل (نزول کا مالک) ہی پڑھتا ہے، اور وہ میراثی ذوق (الذوق الميراثي) ہے۔ پس جس نے اسے پایا، وہ اس کا مالک ہے، وہ اسے پاتے وقت جانتا ہے، پس اسے کسی جاننے والے کی ضرورت نہیں، کیونکہ وہ اس وقت اپنے خیال سے پڑھنے اور اپنے رب کے نزول سے مشاہدہ کے ذریعے پڑھنے میں فرق کرتا ہے۔\n\nاور نبی یا رسول کے لیے کوئی دوسرا امر نہیں جس میں میراث واقع ہو، وہ صرف قول، فعل یا حال ہے۔ پس کامل وارث وہ ہے جو ان سب کو جمع کرے، اور ناقص وارث وہ ہے جو ان مراتب میں سے بعض پر اکتفا کرے۔ اور جان لو کہ یہ منزل انبیاء علیہم السلام میں سے خلت (الخلة) کی صفت سے متصف ہونے والوں کی منزل ہے۔ پس جسے یہ حاصل ہو، اسے الٰہی خلت (الخلة الإلهية) میں حصہ ملا اور اس میں اس کے لیے ایک سہم مارا گیا۔\n\nاور اس میں کلام طویل ہے، وقت اس کی تفصیل کے لیے کافی نہیں۔ پس ہم اس میں موجود علوم کو دیگر منازل کی طرح ذکر کرتے ہیں، پس ہم کہتے ہیں: اس میں دوستوں کی رحمت (رحمة الخلان) کا علم ہے اور اس میں اور محبوبوں، بیٹوں، باپوں، اور تمام لذتوں کی رحمت کے درمیان فرق کا علم ہے۔ اور اس میں نزول کی مٹھاس کا علم ہے، اور وہ شخص جسے قرآن اس کی تلاوت کے وقت نیا نازل ہوتا ہے، وہ اسے اپنے نفس میں کہاں محسوس کرتا ہے۔ اور اس میں اغیار (غیروں)، اسرار (رازوں)، انوار (نوروں)، اور ہدایت کا علم ہے، اور ہر نفس کے ساتھ خاص محامد اور مراتب کی اقسام کا علم ہے جس میں کوئی دوسرا اس کے ساتھ شریک نہیں ہوتا۔ اور یہ اس لیے کہ ہم جانتے ہیں کہ ہر نفس کے لیے ایک صفت یا حقیقت ہے جو اس کے ساتھ خاص ہے اور وہ عالم کی ہر چیز سے ممتاز ہوتی ہے، یہ ضروری ہے۔ پس جب الٰہی امر اس خاص حقیقت کے راستے سے اس کے پاس آتا ہے، تو اس کا ذوق صرف اسی پر محدود ہوتا ہے۔ اور یہ الٰہی عزت (العزة الإلهية) کے مقام سے نفس کا ادنیٰ حصہ ہے، کیونکہ یہ ہر نفس کے لیے ہے، اگرچہ وہ اسے محسوس نہ کرے۔ اور یہ خاصیت کے ساتھ طبعی امور کے فعل کی طرح ہے، جیسے مقناطیس اور اس جیسے دیگر۔ سوائے اس کے کہ طبعی خواص دو قسم کے ہوتے ہیں: انفرادیت کے ساتھ اور مجموعہ کے ساتھ، اور خاص مزاج میں۔ کیونکہ طبعی خواص ہر مزاج میں اور ہر صورت میں سرایت نہیں کرتے۔ اور اہل اللہ کی خاصیت، جب وہ اسے اپنے نفوس سے ذوقاً پاتے ہیں، تو اس کا حکم عالم کی ہر چیز میں سرایت کر جاتا ہے۔ اور اس میں ملکوت (الملکوت) کا علم ہے، اور مشاہدہ (المشاهدة) کا، اور معدوم کو اس کے عدم کی حالت میں دیکھنے کا علم ہے، بغیر کسی تخیل یا تمثل کے، اور نہ ہی خیال کے ادراک سے، بلکہ حسی بصارت سے۔ اور اس میں حیرت (التحير) اور حیرانی (الحيرة) کے اسباب کا علم ہے۔ اور اس میں اس علم کا علم ہے کہ انسان صرف وہی جانتا ہے جو اس کی استعداد اسے دیتی ہے جب وہ اسے استعمال کرتا ہے یا وہ اچانک اس پر آ جاتا ہے، وہ اس سے زیادہ قبول نہیں کرتا، کیونکہ اس میں قبول کرنے کی قوت نہیں ہے۔ اور اس میں رسولوں اور رسالت کا علم ہے۔ اور اس میں اس علم کا علم ہے کہ انسان بالذات عالم ہے، مگر وہ بھول جاتا ہے، پس اسے جو بھی علم حاصل ہوتا ہے، وہ صرف تذکر (یاد دہانی) ہے، اور اہل اللہ کے سوا کوئی نہیں جانتا کہ یہ تذکر ہے۔ اور اس میں بلاؤں اور نعمتوں کا علم ہے۔ اور اس میں تعریف میں فرقان (تمیز) کا علم ہے، تقرر اور توبیخ کے درمیان، اور جو احسان یا مطالبہ کے طریقے پر ہوتا ہے۔ اور اس میں افعال میں تنزیہ (التنزيه) کی صفات کا علم ہے، اور یہ کہ عالم میں یا ہر طالب کی طرف سے ہر طلب صرف ذاتی طلب ہے، وہاں کوئی عارضی طلب نہیں جو بالذات نہ ہو۔ یہ نہیں ہو سکتا۔ بلکہ شخص کو کوئی ایسا امر پیش آتا ہے جو اس کے پاس نہیں تھا، پس یہ امر جو اسے حاصل ہوا، یہی وہ ہے جس کے لیے مطلوب کی ذاتی طلب ہوتی ہے، اور لوگ اس شخص سے محجوب ہو گئے جس کے ساتھ وہ عارضی امر قائم ہوا، اور جسے وہ طالب کہتے ہیں۔ اور طالب صرف وہ امر ہے، پس طلب اس کے لیے ذاتی ہے، اور اس شخص کو جو اس پر نازل ہوا ہے، اسے اس کے حصول میں استعمال کیا گیا ہے۔ اور لوگوں کو اس کا شعور نہیں۔ اور اس میں نظر، تفکر، اور اعتبار (غور و فکر) کا علم ہے، اور یہ کہ عالم کا بعض حصہ بعض کے لیے عبرت ہے۔ اور اس میں ان علوم کا علم ہے جن کے ساتھ اللہ خاص ہے جو عالم میں بکھرے ہوئے ہیں، اور وہ ان کی جامعیت ہے، اسے صرف اللہ ہی جانتا ہے۔ یہ اس چیز کے بارے میں ہے جو وجود میں داخل ہوا، اس کے ساتھ اس علم کے جو وجود میں داخل نہیں ہوا اور نہ ہی کوئی مخلوق اس کے علم سے متصف ہوئی۔ پس اس کے لیے دنیا کے علم میں جامعیت کا علم ہے، اس کے ساتھ آخرت کے علم کا جو اس کی طرف منسوب کیا گیا ہے، اور یہ ضروری ہے۔ اور اس میں محدث (حادث) کے ذریعے قدیم پر استدلال کا علم ہے، اور جو اس سے نفس میں حاصل ہوتا ہے۔ کیونکہ قدیم نفس میں حاصل نہیں ہوتا، اگرچہ محدث حاصل ہو، تو وہ مطلوب نہیں ہے۔ اور جو کچھ بھی حاصل ہوا، وہ محدث ہے۔ اور اس میں اس علم کا علم ہے کہ توکل کس میں اللہ کا شکر ہوتا ہے۔ اور اس میں اس شخص کا علم ہے جس کے ساتھ کوئی معنی قائم ہوا جس نے اس کے لیے ایک نام واجب کیا جس کا وہ مستحق ہے۔ اور یہیں سے تم اللہ کے اسماء حسنیٰ کو اس کے اسماء سے پہچانتے ہو۔ کیونکہ اللہ کے اسماء کائنات میں ان نفوس کے آثار سے ہیں، اور کائنات کے اسماء ان معانی سے ہیں جو اس کے ساتھ قائم ہیں جنہوں نے اس کے لیے اسماء واجب کیے۔ پس ذات حق (الحق) اپنے اسماء میں منزہ ہے، ایک عین ہے، اور کائنات اپنے اسماء کی وجہ سے کثیر ہے، ان معانی کے قائم ہونے کی وجہ سے جنہوں نے اس کے لیے اسماء واجب کیے۔ اور اس میں میراث کے اسباب کا علم ہے۔ اور اس میں اس شخص کا علم ہے جو کامیاب ہوا اور جو ناکام ہوا، اور سب طالب ہیں۔ اور اس میں موت کے مشاہدہ کا علم ہے، باوجود اس کے کہ وہ ایک عدمی نسبت ہے، اور کس پر حکم لگایا جاتا ہے، اور یہ کہ موت کا حکم اس پر نہیں ہوتا جس میں ترکیب نہ ہو۔ اور ہر وہ چیز جو وضع کے ساتھ مرکب ہے، وہ موت کو قبول کرتی ہے۔ پس اگر وہ نہ مرے، تو یہ کسی دوسرے امر کی وجہ سے ہے جس کا الٰہی مشیئت نے تقاضا کیا، اور اس کے لیے ایک ظاہری یا معلوم سبب بنایا جا سکتا ہے، اور یا وہ صرف خاص مشیئت کا حکم ہو گا۔ اور اس میں اللہ پر اس چیز کے ساتھ حکم لگانے کا علم ہے جس کا وہ تقاضا کرتا ہے، اس حیثیت سے کہ وہ ممکن ہے، نہ کہ اس حیثیت سے کہ وہ اللہ ہے۔ اور قرآن میں اس کا بہت ذکر آیا ہے، لیکن اس کا معنی صرف وہی علماء جانتے ہیں جو موجودات کی حقائق کو جانتے ہیں اور اشیاء کی ماہیت کو جاننے والے ہیں۔ اور اس میں قیامت کے دن، حشر، اور نشر کا علم ہے، اور جو احکام اس دن کے ساتھ خاص ہیں، اور اس میں حاکم کون ہو گا، اور اس میں تصرف کرنے والوں کے مراتب۔ اور اس میں اس امر کا علم ہے جو اس دن تقاضا کرتا ہے۔ اور اس میں انسان کو نباتات سے تشبیہ دینے کا علم ہے، اس حیثیت سے کہ وہ درخت ہے نہ کہ ستارہ۔ اور یہیں سے آدم کو درخت کے قریب جانے سے منع کیا گیا، پس یہ اس بات پر تنبیہ ہے کہ وہ اپنے نفس کے اغراض اور خواہش کے قریب نہ جائے، اور وہ اس کا قول ہے: **وَنَهَى النَّفْسَ عَنِ الْهَوى‏** (النازعات: ۴۰) \"اور نفس کو خواہش سے روکا۔\" اور وہ نفس کا اس چیز کا ارادہ کرنا ہے جس پر عمل کرنے یا اسے چھوڑنے کی شریعت نے اجازت نہیں دی۔ اور اس میں تمکین (استحکام) اور حقائق کے قول اور فعل میں جو کچھ وہ دیتی ہیں، اس کے علم پر ثابت قدمی کا علم ہے۔ اور اس میں اس تبدل (تبدیلی) اور تلوین (رنگ بدلنے) کا علم ہے جس کی تعریف کی جاتی ہے اور جس کی مذمت کی جاتی ہے۔ اور اس میں مہلت دینے اور جان بوجھ کر نظر انداز کرنے کی حکمت کا علم ہے۔ اور اس میں کونی اور الٰہی تسخیر کی حکمت کا علم ہے۔ اور اس میں ذات حق (الحق) کو الوہیت (الألوهة) کے ساتھ منفرد کرنے کا علم ہے۔ اور اس میں اقتداء (پیروی) کا علم ہے اور کس کی پیروی کرنی چاہیے۔ اور اس میں حال کے ساتھ تعریف کو مقید کرنے اور قول کے ساتھ اسے مطلق کرنے کا علم ہے۔ اور اس میں اس علم کا علم ہے جو وجود میں ظاہر ہوتا ہے کہ وہ معلوم ہے اور ایک متعلقہ علم سے ظاہر ہے جس نے اس کے لیے وہ ظہور واجب کیا۔ اور اس میں انسان کا اس علم کے ساتھ ہونا کہ اللہ جہات کے ساتھ مقید نہیں ہے اور وہ **أَقْرَبُ مِنْ حَبْلِ الْوَرِيدِ** (ق: ۱۶) \"شہ رگ سے بھی زیادہ قریب\" ہے، اور اس سب کے باوجود وہ اس میں فوقیت اور تحدید کی جہت کا وہم کرتا ہے، اس کی نشأت اسے اس بات کی اجازت نہیں دیتی کہ وہ اپنے عقل پر اپنے وہم کے حکم سے خالی ہو، پس وہ عقل اور وہم کے حکم کو ایک ہی وقت میں جمع کرتا ہے، جیسا کہ اس نے ان امور کو جمع کیا جن سے وہ انسان بنا، اسی طرح وہ ان کے احکام کو جمع کرتا ہے۔ اور اس میں لوگوں میں قرآن کے مراتب کا علم ہے، پس وہ ایک گروہ کے حکم میں دوسرے گروہ کے حکم پر ہوتا ہے۔ پس یہ ان علوم میں سے بعض ہیں جو یہ منزل اجمالی طور پر اپنے اندر رکھتی ہے، اور **وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (الاحزاب: ۴) \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\"",
    "fa": "«باب سیصد و هفتادم در معرفت منزل مزید (افزونی) و راز و دو راز از اسرار هستی (الوجود) و تبدل، و این باب از حضرت محمدیه (الحضرة المحمدية) است.»\n\nهمانا افزونی در اعمال، صورتش *** مانند افزونی در نعمت است ای مرد.\n\nو آن را نمی‌شناسند مگر مردان خردمند *** و آن را شمار و مدتی در بر نمی‌گیرد.\n\nخداوند در نهان آن، مکر (تدبیر)ی برای صاحب نظر *** محقق دارد، و ما را در مکر او امید است.\n\nزیرا که آن از راز حضرت او صادر شده *** و جز علم و عمل، چیزی نگه نمی‌دارد.\n\nهمانا فروع را اصلی است که آن‌ها را آشکار می‌سازد *** و مَثَل آن برای بینندگان به ما رسیده است.\n\n### [درباره اینکه حکمت در همه چیز است]\n\nبدان که حکمت در همه اشیاء و تمامی امور، تنها برای مراتب است نه برای اعیان (ذوات). و بزرگترین مراتب، مرتبه الوهیت (الألوهية) و پایین‌ترین مراتب، مرتبه عبودیت (العبودية) است. پس جز این دو مرتبه نیست: رب و عبد. اما الوهیت احکامی دارد که هر حکمی از آن مقتضی مرتبه‌ای است. یا آن حکم به واسطه اله (حق) قائم می‌شود، پس اوست که بر خود حکم کرده است، و این در معنا حکم مرتبه است. و جز صاحب مرتبه به آن حکم نمی‌کند، زیرا مرتبه وجود عین (ذات) نیست، بلکه امری معقول و نسبتی معلوم است که بر آن حکم رانده می‌شود و احکام از آنِ اوست. و این از شگفت‌انگیزترین امور است: تأثیر معدوم. و یا آن حکم به واسطه غیر او در موجود قائم می‌شود، خواه امری وجودی باشد یا نسبتی؛ و جز مراتب تأثیر نمی‌کنند. همچنین عبودیت احکامی دارد که هر حکمی از آن مرتبه‌ای است. یا آن حکم به واسطه خود بنده قائم می‌شود، پس جز خودش بر او حکم نکرده است، گویی او نایب از مرتبه‌ای است که این حکم را برایش واجب کرده است، یا بر مثل خود یا بر غیر خود حکم می‌کند. و در حق بنده جز مثل یا غیر نیست. اما در حق اله (حق)، جز غیر نیست و مثلی وجود ندارد، زیرا او مثلی ندارد. اما احکامی که از احکام مرتبه بر او باز می‌گردد، وجوب وجود او به ذاتش، و حکم به بی‌نیازی او از عالم، و واجب کردن بر خود به یاری مؤمنان با رحمت و تمامی صفات جلال است که مقتضی تنزیه و نفی مماثلت است. و اما احکامی که ذاتاً مقتضی طلب غیر است، مانند تمامی صفات خلق، که همان صفات کرم، افضال، جود و ایجاد است، پس ناگزیر باید کسی باشد که این احکام بر او جاری شود، و آن غیر است، و آن غیر جز بنده نیست. و هیچ اثری که بنده را طلب کند نیست، مگر اینکه باید اصلی در اله (حق) داشته باشد که مرتبه آن را واجب کرده است؛ این ضروری است. و خداوند متعال به احکامی از این مرتبه اختصاص دارد که خلق را طلب نمی‌کند، چنانکه مقرر کردیم. و مرتبه بنده، احکامی را از جهت بنده بودنش طلب می‌کند که جز به بنده از جهت بنده خاص بودن قائم نمی‌شود. پس این احکام در هر بنده به ذاتش عام است. سپس احکامی دارد که وجود امثال و وجود حق را طلب می‌کنند. از جمله این احکام این است که اگر بنده نایب و خلیفه از حق باشد، یا خلیفه از بنده‌ای مثل خود، ناگزیر باید کسی که او را خلیفه کرده است، از صفات خود بر او خلعت بپوشاند، به اندازه‌ای که مرتبه خلافت طلب می‌کند. زیرا اگر به صورت کسی که او را خلیفه کرده است ظاهر نشود، حکم او در امثال خود جاری نمی‌شود. و ظهور او به صورت کسی که او را خلیفه کرده است، چیزی جز آن نیست که مرتبه سیادت (سروری) به او عطا می‌کند. پس مرتبه عبودیت و مرتبه خلافت احکامی به او داده‌اند که نمی‌تواند آن‌ها را جز در حق سید خود و کسی که او را خلیفه کرده است صرف کند، همان‌طور که احکامی دارد که آن‌ها را جز در حق کسانی که بر آن‌ها خلیفه شده است صرف نمی‌کند. و خلافت صغری و کبری دارد. بزرگترین آن که بزرگتر از آن نیست، امامت کبری بر عالم است، و کوچکترین آن، خلافت او بر نفس خود است. و آنچه بین این دو است، نسبت به مافوق خود صغری نامیده می‌شود و عیناً نسبت به مادون خود کبری است. اما تأثیر مرتبه بنده در سید خود، قیام سید به مصالح بنده خود است تا حکم سیادت بر او باقی بماند. و کسی که به مصالح بنده خود قیام نکند، مرتبه او را عزل کرده است، زیرا مراتب ذاتاً حکم تولیت و عزل دارند، نه به جعل (وضع)، برای هر کس که باشند. و اما تأثیری که بنده از جهت خلیفه بودن در کسی که او را خلیفه کرده است دارد، هر که مستخلف باشد، این است که عین کسی که بر او خلیفه شده است باقی بماند تا حکم او در آن نافذ شود. و اگر چنین نباشد، او خلیفه نیست و صادق دانسته نمی‌شود، زیرا اگر «بر چه کسی» و «در چه کسی» نباشد، خلافت معنا ندارد. زیرا خلیفه ناگزیر باید مکانی داشته باشد تا با حاجات به سوی او قصد شود. آیا نمی‌بینی کسی که مکان را نمی‌پذیرد، چگونه مرتبه برای او اقتضا کرد که آسمانی بیافریند و آن را عرش قرار دهد، سپس ذکر کرد که بر آن استوا کرد، تا با دعا و طلب حوائج به سوی او قصد شود و بنده سرگردان نماند و نداند به کجا روی آورد؟ زیرا خداوند بنده را صاحب جهت آفرید، پس حق، فوقیت را برای خود از آسمان و عرش و احاطه به تمامی جهات، با قول خود: فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله (پس به هر سو رو کنید، آنجا وجه خداست) و با قول خود: «پروردگار ما به آسمان دنیا فرود می‌آید و می‌گوید: آیا توبه‌کننده‌ای هست؟ آیا دعاکننده‌ای هست؟ آیا آمرزش‌خواهی هست؟» به خود نسبت داد.\n\nو می‌گوید رسول او: إن الله في قبلة المصلي (همانا خداوند در قبله نمازگزار است).\n\nاین همه حکم مراتب است، اگر تعقل کنی. پس اگر مراتب از عالم زائل شوند، اعیان (ذوات) اصلاً وجودی نخواهند داشت. پس بفهم. اگر عالی (برتر) بخواهد که دانی (پایین‌تر) او را بشناسد، چون دانی در علو قدمی ندارد و عالی احاطه به دانی دارد، ناگزیر باید عالی خود را به دانی بشناساند. و این ممکن نیست مگر اینکه عالی به سوی او تنزل کند، زیرا دانی نمی‌تواند به سوی او ترقی کند، چون عین او معدوم می‌شود، زیرا در علو قدمی ندارد. پس دانی همیشه در مرتبه خود ثابت است، و عالی حق نزول و حق ثبوت در مرتبه خود را دارد. و از ثبوت او در مرتبه‌اش، حکم بر خود به نزول کرده است. پس او در عین نزولش در مرتبه عالی خود ثابت است. و خداوند متعال در مورد سفرای خود که رسولان او به سوی خلقش از میان خلقش هستند، چنین کرده است. و هیچ رسولی را نفرستاد إِلَّا بِلِسانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ (مگر به زبان قومش تا برایشان بیان کند). پس اگر او را عامه فرستاد، عامه قوم او بودند، و به او جوامع الکلم (سخنان جامع) عطا کرد، که همان فصل الخطاب است. و جز آدم با اسماء و کمال محمد (صَلَّى اللهُ عَليهِ وسَلَّم) با جوامع الکلم کامل نشد. پس به سوی آنان با رسالت پروردگارشان به زبان و لحن خودشان فرود آمد. و آنان را جز به واسطه خودشان دعوت نکرد. سپس، هیچ حکمی را برایشان تشریع نکرد مگر آنچه خود بر آن بودند. پس در این مورد، چیزی جز اینکه آن احکام از جانب خداست، بر آنان نیفزود، تا به طریق قربت به خدا به آن‌ها حکم کنند و این احکام سعادت را نزد خدا برایشان به ارث بگذارد. و اینکه گفتیم هیچ حکمی را برایشان تشریع نکرد مگر آنچه خود بر آن بودند، به این دلیل است که هیچ امتی خالی از ناموسی نبوده که بر آن باشند برای مصالح احوالشان. و این ناموس جز پنج چیز نیست: پس ناگزیر باید واجبی باشد که امام و واضع ناموسشان بر آنان واجب کرده است، و آن نزد ما واجب و فرض است. و همچنین مندوب (مستحب)، محظور (حرام)، مکروه و مباح. زیرا ناگزیر باید حدودی در احکام داشته باشند که بر آن توقف کنند. و شریعت از جانب خدا به سوی آنان نیامد مگر با همین چیزی که از حکم نظر خودشان بر آن بودند، که گمان می‌کردند، و در واقع امر، این از جعل خدا در نفوس آنان است، از جایی که نمی‌دانند. و به همین دلیل، از جایی که نمی‌دانند، برایشان به واسطه آن پاداشی از جانب خدا بود. اما وقتی به سوی او بازگردند، آن را نزد او می‌یابند. پس چون دیدیم که هیچ رسولی را نفرستاد إِلَّا بِلِسانِ قَوْمِهِ (مگر به زبان قومش)، دانستیم که وقتی خواست ما او را بشناسیم، خود را جز به آنچه ما بر آن هستیم، به ما نشناساند، نه به آنچه ذاتش اقتضا می‌کند. اگرچه شناساندن او به ما، از آنچه ذاتش اقتضا می‌کند، می‌باشد، اما اقتضای ذات او بین آنچه که او را از ما متمایز می‌کند و آنچه که خود را به واسطه آن به ما می‌شناساند، متفاوت است. و چون خلق بر مراتب بسیاری بودند و کامل‌ترین مرتبه در آن، انسان بود، هر صنفی از عالم، نسبت به کمال انسان، جزئی است، حتی انسان حیوانی، جزئی از انسان کامل (الإنسان الکامل) است. پس هر معرفتی برای جزئی از عالم به خدا، معرفتی جزئی است، مگر انسان، که معرفت او به خدا، معرفت تمام عالم به خداست. پس علم او به خدا، علم کلی است نه علم کل (تمامیت)، زیرا اگر علم کل بود، به او امر نمی‌شد که بگوید: رَبِّ زِدْنِي عِلْماً (پروردگارا، علم مرا زیاد کن). آیا گمان می‌کنی آن علم به غیر خداست؟ نه، به خدا سوگند، بلکه به خداست. پس انسان کامل (الإنسان الکامل) را بر صورت خود آفرید و او را با این صورت قادر ساخت که تمامی اسماء خود را بر او اطلاق کند، یکی یکی و بعضی بعضی، اما مجموع اسماء با هم در یک کلمه بر او اطلاق نمی‌شود، تا رب از عبد کامل متمایز شود. پس هیچ اسمی از اسماء الحسنی نیست، و تمامی اسماء خدا حسنی هستند، مگر اینکه عبد کامل حق دارد که با آن ادعا کند، همان‌طور که حق دارد سید خود را با آن بخواند. و از این اسماء الهی، آن‌هایی است که حق تعالی با آن‌ها بر طریق ثنا بر بنده، او را می‌خواند، و آن‌ها اسماء رحمت، لطف و حنان هستند. و از آن‌ها آن‌هایی است که او را بر طریق مذمت می‌خواند، مانند قول تعالی: ذُقْ إِنَّكَ أَنْتَ الْعَزِيزُ الْكَرِيمُ (بچش، همانا تو همان عزیز و کریمی). و او در قوم خود به این اسم خوانده می‌شد، و حق او را در اینجا به تمسخر و از جهت مذمت با آن خواند. قال تعالى: فَإِنَّا نَسْخَرُ مِنْكُمْ كَما تَسْخَرُونَ فَسَوْفَ تَعْلَمُونَ (پس ما نیز شما را مسخره می‌کنیم، همان‌طور که شما مسخره می‌کنید، پس به زودی خواهید دانست). پس چون کامل را از ما بر صورت (حق) ایجاد کرد، کامل، خود را به واسطه کمالی که به او عطا کرده بود، به او شناساند. و عبد کامل، تماماً حق بود و از عین خود در نفس خود فانی شد (فناء)، زیرا او ذاتاً پذیرنده (قابله) است. و خداوند برای او مثالی در باب محبت قرار داده است. پس هر آنچه را که از عالم دوست دارد، خواه اسب باشد یا خانه یا دینار یا درهم، به سوی آن عاشق می‌شود. و او را جز با جزء مناسب مقابله نمی‌کند. پس آن جزء مناسب به واسطه عشقش در آن فانی می‌شود و بقیه او هشیار می‌ماند و حکمی در آن ندارد، مگر زمانی که شخصی مثل خود را دوست بدارد، خواه کنیز باشد یا غلام، که در این صورت او را با تمام ذات خود و با تمامی اجزای خود مقابله می‌کند. پس وقتی او را مشاهده می‌کند، با تمام وجود در او فانی می‌شود، نه با جزئی از آن، و بیهوش می‌شود. و این به دلیل آن است که او را با تمام وجود مقابله کرده است. همچنین بنده وقتی حق را می‌بیند یا تخیل می‌کند، هنگام مشاهده در او فانی می‌شود (فناء)، زیرا او بر صورت حق است، پس او را با ذات خود مقابله می‌کند. پس جزئی در او باقی نمی‌ماند که با آن هشیار شود تا آنچه را که از او در حق فانی شده است، تعقل کند. و همچنین هر جزئی از عالم با حق، وقتی حق بر او تجلی (التجلی) کند، برای او خضوع می‌کند و در او فانی می‌شود، زیرا هر آنچه که از عالم بر آن است، صورت حق است، به واسطه آنچه حق از خود به او عطا کرده است. زیرا صحیح نیست که چیزی از عالم وجودی داشته باشد که صورت حق نباشد. پس ناگزیر عالم باید در حق فانی شود، وقتی حق بر او تجلی کند، و حق در خلق فانی نمی‌شود، زیرا خلق از حق است، اما حق از خلق نیست. پس نسبت حق به خلق، نسبت انسان به هر صنفی از عالم است، به جز نوع انسان. پس به آنچه برایت ذکر کردم، از فنای (الفناء) هر چیزی از عالم از خود، هنگام تجلی (التجلی) سبحانه بر او، و اینکه حق با مشاهده خلق فانی نمی‌شود، توجه کن. و شریعت با متلاشی شدن کوه و صاعقه خوردن موسی (علیه السلام) هنگام تجلی ربانی (التجلی الرباني) آمده است. و ما از حق جز آنچه خود بر آن هستیم، نشناختیم. و در میان ما کامل و اکمل وجود دارد. زیرا خداوند به هر چیزی خلقش را عطا کرد. پس وقتی خداوند این نعمت‌ها را بر بنده خود مقرر کرد و او را به راه آن‌ها هدایت نمود، گفت: إِمَّا شاكِراً (یا شکرگزار است)، پس از آن نعمت‌ها بر او می‌افزاید، زیرا گفتیم که او جز از خود به او عطا نکرده است، نه به طور مطلق. و إِمَّا كَفُوراً (و یا ناسپاس است) به نعمت‌هایش، پس آن‌ها را از او سلب می‌کند و او را بر آن عذاب می‌دهد. پس انسان باید برای خود احتیاط کند که در کدام راه گام برمی‌دارد. و بعد از بیان خدا، بیانی نیست. و موسی (علیه السلام) به بنی اسرائیل گفت: إِنْ تَكْفُرُوا أَنْتُمْ ومن في الْأَرْضِ جَمِيعاً فَإِنَّ الله لَغَنِيٌّ حَمِيدٌ (اگر شما و هر که در زمین است، همگی کفر ورزید، همانا خداوند بی‌نیاز و ستوده است). او هشدار می‌دهد که خداوند متعال عالم را جز برای عالم نیافرید، و او را به آنچه به آن تعبد کرده است، تعبد نداد، مگر برای اینکه خود را به او بشناساند. زیرا وقتی خود را شناخت، پروردگارش را می‌شناسد. پس پاداش او بر علمش به پروردگارش، بزرگترین پاداش خواهد بود. و به همین دلیل گفت: إِلَّا لِيَعْبُدُونِ (مگر برای اینکه مرا بپرستند). و او را نمی‌پرستند مگر اینکه او را بشناسند. پس وقتی او را شناختند، او را عبادتی ذاتی می‌کنند. و وقتی به آن‌ها امر کرد، او را عبادتی خاص می‌کنند، با بقای عبادت عام ذاتی. پس آن‌ها را بر آن پاداش داد. پس آن‌ها را جز برای خودشان نیافرید. و به همین دلیل، تعالی درباره خود گفت که او غَنِيٌّ عَنِ الْعالَمِينَ (از جهانیان بی‌نیاز است). و موسی زمین را ذکر نکرد مگر به دلیل کمال آن با وجود هر چیزی در آن، که همان انسان جامع حقایق عالم است. و قول او «در زمین» به این دلیل است که زمین رام است، پس حافظ مقام عبودیت است. گویی گفت: اگر شما و هر بنده خدا کفر ورزید، همانا خداوند از جهانیان بی‌نیاز است. و به همین دلیل، خداوند زمین را محل خلافت و منزل آن قرار داد. گویی کنایه زد که: من در زمین خلیفه‌ای از آنان قرار می‌دهم که از مقام عبودیت خود در نفس خود زائل نمی‌شود، یعنی مرتبه خلافت با صفاتی که به آن امر شده است، او را از مرتبه‌اش محجوب نمی‌سازد. و به همین دلیل او را خلیفه قرار دادیم و او را به امامت ذکر نکردیم، زیرا خلیفه به حکم این اسم بر او، کسی را که او را خلیفه کرده است، طلب می‌کند، و می‌داند که مقهور و محکوم است. پس او را جز به آنچه در آن تذکری برای اوست، نام نبرد، زیرا او بر نسیان، سهو و غفلت سرشته شده است. پس اسم خلیفه، او را به یاد کسی که او را خلیفه کرده است، می‌اندازد. اگر او را امام قرار می‌داد بدون اینکه او را با امامت، خلیفه بنامد، شاید به واسطه امامتش از کسی که او را امام کرده است، مشغول می‌شد، بر خلاف خلافتش، زیرا امامت قدرت تذکر خلافت را ندارد. پس در مورد گروه کاملان گفت: جَعَلَكُمْ خَلائِفَ فِي الْأَرْضِ (شما را در زمین خلیفه‌ها قرار داد). و این در گوش آنان افتاد، پس در عالم به حکم خلافت تصرف کردند. و به ابراهیم (علیه السلام) بعد از اینکه خلافت آدم و هر که را خدا از بندگانش بخواهد، به او شناند، گفت: إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً (من تو را برای مردم پیشوا قرار می‌دهم)، زیرا می‌دانست که خلافت در او آمیخته شده است، پس بعد از آن با هر اسمی که بخواهد او را بنامد، باکی نیست، همان‌طور که یحیی را «سید» نامید. و وقتی عارفان او را شناختند، از کسانی که او را با نظر خود شناختند، متمایز شدند. پس برای آنان اطلاق بود و برای دیگران تقیید. پس عارفان او را در هر چیزی یا عین هر چیزی مشاهده (الشهود) می‌کنند، و کسی که او را با نظر خود شناخت، او را جدا از خود مشاهده می‌کند، به واسطه بُعدی که تنزیه او برایش اقتضا کرده است. پس خود را در یک طرف و حق را در طرف دیگر قرار داد، و او را از مکانی دور ندا می‌دهد. و چون خلافت، ظهور به صورت کسی که او را خلیفه کرده است و کسی که او را خلیفه قرار داده است، را طلب می‌کند، درباره خود ذکر کرد که او عَلى‏ صِراطٍ مُسْتَقِيمٍ (بر راهی راست است). پس ناگزیر این خلیفه باید بر صراطی باشد. پس در راه‌ها نظر کرد و آن‌ها را بسیار یافت: از جمله صِراطِ الله (راه خدا)، و صِراطِ الْعَزِيزِ (راه عزیز)، و صراط الرب (راه پروردگار)، و صراط محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، و صراط النعم (راه نعمت‌ها) که همان صِراطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ (راه کسانی که به آن‌ها نعمت دادی) است، و این همان قول اوست: لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً (برای هر یک از شما شریعت و راهی قرار دادیم). پس این امام محمدی، راه محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را برگزید و سایر راه‌ها را رها کرد، با وجود اقرار و ایمان به آن‌ها، اما خود را و رعایای خود را جز به صراط محمد (صَلَّى اللهُ عَليهِ وسَلَّم) تعبد نداد. و تمامی اوصافی را که برای هر صراطی است، به سوی او بازگرداند، زیرا شریعت او عام است. پس حکم تمامی شرایع به شرع او منتقل شد. پس شرع او آن‌ها را در بر می‌گیرد و آن‌ها او را در بر نمی‌گیرند. از جمله آن‌ها صِراطِ الله (راه خدا) است، که همان صراط عام است که تمامی امور بر آن حرکت می‌کنند و آن‌ها را به خدا می‌رساند. پس هر شرع الهی و موضوع عقلی در آن داخل می‌شود. پس شقی و سعید را شامل می‌شود و به خدا می‌رساند. سپس، کسی که بر آن راه می‌رود، یا صاحب شهود الهی (الشهود الإلهي) است یا محجوب. اگر صاحب شهود الهی باشد، مشاهده می‌کند که او را به راه می‌برند، پس او به حکم جبر سالک است، و می‌بیند که سالک او، پروردگار متعال اوست، و پروردگارش عَلى‏ صِراطٍ مُسْتَقِيمٍ (بر راهی راست است)، چنانکه سبحانه و تعالی آن را بر ما تلاوت کرد که هود (علیه السلام) آن را گفت، و او رسولی از رسولان خداست. به همین دلیل، سرانجام او به رحمت است. و اگر در راه، سختی به او برسد، آن عوارضی است که از شؤوناتی که حق هر روز در آن است، برای او عارض شده است، و این همان قول تعالی است: كُلَّ يَوْمٍ هُوَ في شَأْنٍ (او هر روز در کاری است). و ممکن نیست که امر جز این باشد. و هیچ کس آگاه‌تر به امور و شاهدتر به حقایق و داناتر به راه‌های خدا از رسولان (علیهم الصلاة والسلام) نیست. با این حال، از شؤونات الهی در امان نماندند. پس امور دردناک نفسانی برایشان عارض شد، از جمله رد دعوت در روی او، و آنچه درباره حق تعالی می‌شنود که جلال او از آن منزه است، و در حقّی که از جانب خدا آورده است. و همچنین امور دردناک محسوس، از بیماری‌ها، جراحات و ضرب و شتم در این دنیا. و این امری عام برای او و غیر اوست. و سعید و شقی در این آلام برابرند. و كُلٌّ يَجْرِي فيهِ إِلى‏ أَجَلٍ مُسَمًّى (و هر یک در آن تا مدتی معین جریان دارد) نزد خدا. پس برخی از آنان مدتشان تا هنگام مرگشان امتداد می‌یابد و در آسایش دائمی و رحمت عام فراگیر قرار می‌گیرند، و آنان کسانی هستند که الْفَزَعُ الْأَكْبَرُ (وحشت بزرگ) آنان را اندوهگین نمی‌سازد و بر خود و امت‌هایشان نمی‌ترسند، زیرا در دنیا و آخرت ناشناخته بودند.\n\nو آنان کسانی هستند که رسولان به حالشان غبطه می‌خورند، به دلیل آسایشی که در آن هستند، زیرا رسولان (علیهم السلام) در روز وحشت بزرگ بر امت‌ها و پیروان خود می‌ترسند، نه بر خودشان. و برخی از آنان مدتشان تا ورود به بهشت از طریق عرضه (حساب) امتداد می‌یابد. و برخی از آنان مدتشان در آلام امتداد می‌یابد تا اینکه با شفاعت برای خروج از آتش به بهشت شفاعت شوند. و برخی از آنان مدتشان در آلام امتداد می‌یابد تا اینکه خداوند خودشان آن‌ها را خارج کند، نه با شفاعت شفاعت‌کننده‌ای، و آنان موحدان از طریق نظر هستند که هرگز به قول شارع ایمان نیاوردند و کفر نورزیدند و عمل خیری انجام ندادند. زیرا آنان مؤمن نبودند، اما خداوند جل جلاله را توحید کردند و بر آن مردند. و هر کس از آنان علمی به خدا داشت و بر آن مرد، ثمره علم خود را چید. اگر شبهه‌ای در آن برایش قدح کرد که او را متحیر ساخت یا او را از اعتقاد به آنچه گمان می‌کرد علم است، منصرف کرد، در حالی که در واقع امر علم بود، سپس چیزی برایش آشکار شد که او را در آن متحیر ساخت یا از آن منصرف کرد، روز قیامت دانست که آن در واقع امر حق بوده است، و او از کسانی است که خداوند او را از آتش به بهشت خارج می‌کند، ثمره آن علم به او باز می‌گردد و به درجه آن می‌رسد. و برخی از آنان مدتشان در آلام امتداد می‌یابد، از کسانی که از آتش خارج نمی‌شوند و از اهل آن هستند که در آن ساکنند، و مدتشان نزد ما معلوم است. سپس رحمت خدا او را فرا می‌گیرد، در حالی که در جهنم است. پس خداوند در آن برای او نعمتی قرار می‌دهد، به طوری که با نگاه به بهشت رنج می‌برد، همان‌طور که اهل بهشت با نگاه به آتش رنج می‌برند. پس اینان اگر علمی به وجود خدا داشتند و شبهه‌ای در توحید خدا یا در علمی که به جناب خدا مربوط است، در آن‌ها وارد شده بود که او را متحیر ساخته یا به نقیض آنچه اعتقاد داشت، منصرف کرده بود، روز قیامت وقتی برایش روشن شود که آن در واقع امر علم بوده است، آن روشن شدن به او سودی نمی‌رساند، همان‌طور که ایمان در دنیا هنگام دیدن عذاب سودی نرساند. پس آن علم، همان علمی است که بر مؤمنی که علمی به اله خود از موحدان مؤمن نداشت، خلعت می‌شود، و جهل آن مؤمن موحد گرفته می‌شود و بر این کسی که از اهل آتش است، افکنده می‌شود. پس او در آتش با آن جهل متنعم می‌شود، همان‌طور که مؤمن جاهل در دنیا با آن متنعم می‌شد. و مؤمن با آن علمی که بر او خلعت شده است، که برای این عالم به وجود خدا بود نه به توحید او، متنعم می‌شود. و چون او را توحید کرد، شبهه‌ای در توحیدش برایش قدح کرد و علمش به خدا او را متحیر ساخت و منصرف کرد. و این آخرین مدت برای صاحبان آلام در آتش است. و پس از انقضای این مدت، نعمت از هر جهت است، به هر سو که روی آورد. و فرقی بین او و ساکنان جهنم از خازنان و حیوانات نیست. پس آن‌ها او را نیش می‌زنند، زیرا مار و عقرب در آن نیش زدن، نعمت و آسایش دارند، و نیش خورده برای آن نیش لذت و استرخاء در اعضا و بی‌حسی در جوارح می‌یابد و از آن لذت می‌برد، این‌گونه همیشه و ابداً. زیرا رحمت بر غضب پیشی گرفته است. پس تا زمانی که حق به غضب موصوف است، آلام بر اهل جهنم که اهل آن هستند، باقی است. پس وقتی غضب الهی زائل شود، چنانکه پیشتر گفتیم، و آتش از آن پر شود، آلام برطرف می‌شود و آن غضب در حیوانات مضر در آتش منتشر می‌شود. پس آن‌ها آسایش خود را با آنچه در حق اهل آتش از آن‌ها صادر می‌شود، قصد می‌کنند. و اهل آتش از لذت، همان چیزی را می‌یابند که آن مار از انتقام برای خدا به خاطر آن غضب الهی که در آتش است، می‌یابد. و همچنین آتش. و آتش و کسانی که در آن هستند، نمی‌دانند که اهل آن برای آن لذت می‌یابند، زیرا نمی‌دانند چه زمانی آسایش به دنبال آن‌ها آمده و رحمت در آن‌ها حکم کرده است. و این صراطی که درباره آن سخن گفتیم، همان صراطی است که اهل الله درباره آن می‌گویند که راه‌های به سوی خدا به تعداد انفاس خلایق است. و هر نفس جز از قلب خارج نمی‌شود، به واسطه آنچه قلب بر آن از اعتقاد در خداست. پس اعتقاد عام، وجود اوست. پس کسی که او را دهر (زمان) قرار داد، وصول او به خدا از اسم دهر اوست. زیرا خداوند جامع اسماء متقابل و غیر متقابل است. و پیشتر گفتیم که او سبحانه به هر اسمی که در قول عز و جل در کتاب عزیز به آن نیازمند است، نامیده شده است: يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ (ای مردم، شما نیازمندان به خدا هستید و خدا بی‌نیاز و ستوده است). و اگر کسی آن را انکار کند، خدا و حال آن را انکار نکرده است. و همچنین کسی که اعتقاد دارد او طبیعت است، او در طبیعت بر او تجلی می‌کند. و کسی که اعتقاد دارد او چنین است، هر چه باشد، او در صورت اعتقادش بر او تجلی می‌کند و احکام همان‌طور که ذکر کردیم، بدون افزونی، جاری می‌شود. پس بفهم.\n\n### [صراط عزت]\n\nو اما صراط عزت (صِراطِ الْعِزَّة)، که همان قول تعالی است: إِلى‏ صِراطِ الْعَزِيزِ الْحَمِيدِ (به سوی راه عزیز ستوده)، بدان که این صراط تنزیه است. پس جز کسی که خود را از اینکه رب یا سید باشد، از جهتی یا از هر جهت، منزه بدارد، با ذوق به آن نمی‌رسد. و این عزیز است، زیرا انسان غفلت می‌کند، سهو می‌کند و فراموش می‌کند و می‌گوید: «من»، و در وقت غفلت خود، مرتبه سیادت (سروری) را برای خود بر غیر خود از بندگان می‌بیند. پس چون این ناگزیر است، باید بکوشد که هنگام مرگ، بنده محض باشد و هیچ چیزی از سیادت بر هیچ یک از مخلوقات در او نباشد، و خود را نیازمند به هر چیزی از عالم ببیند، از آن جهت که آن عین حق است از پشت حجاب اسمی که خداوند در مورد کسی که به امر آگاهی ندارد، گفت: قُلْ سَمُّوهُمْ (بگو آن‌ها را نام ببرید). و چون انسان ذاتاً فقیر بود، خداوند او را با اسباب محجوب ساخت و نظر این بنده را به سوی آن‌ها قرار داد، در حالی که او از پشت آن‌هاست. پس آن‌ها را عیناً اثبات کرد و حکماً نفی نمود، مانند قول تعالی به محمد (صَلَّى اللهُ عَليهِ وسَلَّم): وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏ (و تو پرتاب نکردی آنگاه که پرتاب کردی، بلکه خدا پرتاب کرد). سپس این آیه را با قول خود دنبال کرد: ولِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلاءً حَسَناً (و تا مؤمنان را از جانب خود به آزمایشی نیکو بیازماید). پس آن را بلاء (آزمایش) قرار داد. و این صراط عزیز که هیچ مخلوقی در علم به آن قدمی ندارد، همان صراط خداست که بر آن به سوی خلق ما فرود می‌آید و بر آن با ماست هر کجا که باشیم، و بر آن از عرش به آسمان دنیا و به زمین فرود آمد، و این همان قول اوست: وهُوَ الله فِي السَّماواتِ وفي الْأَرْضِ (و او خدا در آسمان‌ها و در زمین است). و بر آن به بنده خود نزدیک می‌شود، چندین برابر آنچه بنده او به سوی او تقرب می‌جوید، وقتی با راهی که برایش تشریع کرده است، به سوی او می‌شتابد. پس او به سوی بنده می‌شتابد (یهرول) وقتی او را روی آورنده می‌بیند، از روی اهتمام به بنده و اکرام او، اما بر صراط عزت (صِراطِ الْعِزَّة)، که صراط نزول است و عروجی برای مخلوق در آن نیست. و اگر برای مخلوق در آن سلوکی بود، عزیز (دست‌نیافتنی) نبود. و او جز به واسطه ما به سوی ما فرود نیامد. پس صفت برای ماست نه برای او. پس ما عین آن صراط هستیم. و به همین دلیل آن را به «حمید» (ستوده) وصف کرد، یعنی حامد (ستاینده) و محمود (ستوده)، زیرا «فعیل» وقتی وارد می‌شود، اسم فاعل و مفعول را طلب می‌کند. یا هر دو امر را با هم می‌دهد، مانند این مورد، یا یک امر را به دلیل قرینه حال می‌دهد. و او بر خود ثنا گفته است، پس او حامد و محمود است. و بزرگترین ثنایی که بر خود گفته است، نزد ما، این است که آدم را بر صورت خود آفرید و او را به امهات اسماء (اسماء مادر) نامید که هر اسمی تحت احاطه آن‌ها داخل می‌شود. و به همین دلیل:\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم: أنت كما أثنيت على نفسك (تو چنان هستی که خود بر خود ثنا گفتی).\n\nپس نفس کامل (النفس الکاملة) را به خود اضافه کرد، اضافه ملک و تشریف، به واسطه آنچه:\n\nقال: من عرف نفسه عرف ربه (هر کس خود را شناخت، پروردگارش را شناخت).\n\nپس هر ثنایی که خداوند بر انسان کامل (الإنسان الکامل) که نفس اوست، گفته است، به دلیل اینکه او را بر صورت خود ایجاد کرده است، آن ثنا عین ثنا بر خداست، به شهادت رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) و شناساندن او به ما در:\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم: أنت كما أثنيت على نفسك (قول او (صَلَّى اللهُ عَليهِ وسَلَّم): تو چنان هستی که خود بر خود ثنا گفتی).\n\nیعنی هر آنچه با آن بر کسی که بر صورت خود آفریدی، ثنا گفتی، ثنای تو بر خودت است. و چون انسان کامل (الإنسان الکامل) صراط عزیز حمید بود، صراط حق سلوک در آن را نداشت و صراط به سلوک وصف نمی‌شود. به همین دلیل آن را به «عزیز» نامید، یعنی آن برای خود ممنوع است. پس حق سبحانه به نزول در آن اختصاص دارد، همان‌طور که از نزول و شتافتن (هروله) خود خبر داد. و بنده عارف بر حقیقت، جز در خدا سلوک نمی‌کند. پس خدا صراط اوست و آن شریعت اوست.\n\nرباط من به اوست و رباط او به ماست *** پس او صراط من است و من صراط اویم.\n\nپس به گفتار من بنگر که سخنی صادق است *** محکم و محقق است جایگاه آن.\n\nپس او حبیب من است و من به واسطه او هستم *** قلب من او را در بر گرفته، پس ما خیمه او هستیم.\n\nعزیز است، پس چشمان ما او را درک نمی‌کند *** به دلیل قربش، بساط خود را درنوردیده است.\n\nپس دوری او به دلیل قربش، جز *** این نیست، و آنچه گفتم استنباط آن است.\n\nپس او بر صراط عزیز است، زیرا او خالق است، و مخلوق را در آن قدمی نیست. أَرُونِي مَاذَا خَلَقَ الَّذِينَ مِنْ دُونِهِ (به من نشان دهید کسانی که غیر از او هستند، چه آفریده‌اند؟) اصلاً آن را نمی‌یابند، نه از نظر علم و نه از نظر عین. بَلِ الظَّالِمُونَ فِي ضَلَالٍ مُبِينٍ (بلکه ستمکاران در گمراهی آشکار هستند)، زیرا هر آنچه دانسته شود، آشکار شده است. و خداوند متعال ما را از ظلمت عدم به نور هستی (الوجود) خارج کرد. پس ما به اذن پروردگارمان نوری بودیم إِلى‏ صِراطِ الْعَزِيزِ الْحَمِيدِ (به سوی راه عزیز ستوده). پس ما را از نور به ظلمت حیرت منتقل کرد. و به همین دلیل، وقتی می‌شنویم که بر خود ثنا می‌گوید، آن را در نفوس خود می‌بینیم. و وقتی بر ما ثنا می‌گوید، می‌بینیم آنچه بر ما ثنا گفته است، ثنای او بر خود اوست. سپس ما را از خود متمایز کرد و خود را از ما متمایز کرد با لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (چیزی مانند او نیست)، و با آنچه می‌داند و ما نمی‌دانیم، و با آنچه ما بر آن هستیم از ذلت، و او از این وصف در نفس خود متعالی است. پس می‌گوییم: ما او هستیم، در حالی که بعد از آنچه گفتیم، ما او نیستیم، زیرا او ما را از ظلمات به نور خارج کرد. او اوست و ما ماییم، پس متمایز شدیم. پس وقتی ثنا بعد از وجود ما آمد، ثنایی از او بر خود و بر ما بود. و ما را به ثنا گفتن بر خود مکلف کرد، و ما را در حیرت متوقف ساخت. پس اگر بر او به واسطه خود ثنا گوییم، او را مقید کرده‌ایم. و اگر او را مطلق بگذاریم، چنانکه:\n\nقال: لا أحصي ثناء عليك (من نمی‌توانم ثنای تو را شمارم).\n\nپس او را با اطلاق مقید کرده‌ایم، و او را متمایز ساخته‌ایم. و کسی که مقید شود، به غنا وصف نمی‌شود، زیرا تقیید او را می‌بندد، چون محدث، اطلاق او تعالی را درک کرده است. و او درباره خود گفته است که غَنِيٌّ عَنِ الْعالَمِينَ (از جهانیان بی‌نیاز است). پس ما را متحیر ساخت. پس نمی‌دانیم او چیست و ما چیستیم. و به گمان من، و خدا داناتر است، او ما را به معرفت خود امر نکرد و ما را در تحصیل آن به نفوس خود ارجاع نداد، مگر به دلیل علم او به اینکه ما حقیقت نفوس خود را درک نمی‌کنیم و نمی‌دانیم و از معرفت خود به واسطه خود عاجزیم. پس می‌دانیم که به واسطه او عاجزتریم. پس این معرفت به اوست نه معرفت (به خود).\n\nو غیر از این نخواهد بود *** زیرا او آشکار و مبین است.\n\nپس به گفتار ما گوش فرا ده، آن را *** علم خواهی یافت و یقین به تو رسیده است.\n\nپس جهل، صفتی ذاتی برای بنده است و تمام عالم بنده است. و علم، صفتی ذاتی برای خداست. پس مجموع آنچه را که در این مورد به آن اشاره کردم، بگیر، آن را صراط عزیز خواهی یافت.\n\n### [صراط رب]\n\nو اما صراط رب تو، خداوند متعال با قول خود به آن اشاره کرده است: فَمَنْ يُرِدِ الله أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلامِ ومن يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقاً حَرَجاً كَأَنَّما يَصَّعَّدُ فِي السَّماءِ (پس هر که را خدا بخواهد هدایت کند، سینه‌اش را برای اسلام می‌گشاید، و هر که را بخواهد گمراه کند، سینه‌اش را تنگ و سخت می‌گرداند، گویی به آسمان بالا می‌رود). می‌گوید:\n\nگویی از طبع خود خارج می‌شود، در حالی که شیء از حقیقت خود خارج نمی‌شود. كَذلِكَ يَجْعَلُ الله الرِّجْسَ عَلَى الَّذِينَ لا يُؤْمِنُونَ (این‌گونه خداوند پلیدی را بر کسانی که ایمان نمی‌آورند، قرار می‌دهد). و این به آنچه پیشتر ذکر شد اشاره دارد: صِراطُ رَبِّكَ مُسْتَقِيماً (راه پروردگار تو راست است). و جز اراده خود برای شرح و ضیق (تنگی) را ذکر نکرد. پس این دو در عالم ضروری هستند، زیرا جز آنچه او می‌خواهد، واقع نمی‌شود، و آن واقع شده است. سپس خود را وصف کرد، یعنی به غضب، رضا، تردد و کراهت. سپس واجب کرد و گفت: و با وجود کراهت، ناگزیر باید مرا ملاقات کند. پس این عین قول اوست: كَأَنَّما يَصَّعَّدُ فِي السَّماءِ (گویی به آسمان بالا می‌رود). پس این مانند جبر در اختیار است. پس هر کس از بندگان خدا که یکی از این دو وصف از او برداشته شود، اصلاً کامل نیست. و لذا در حق کامل گفت: ولَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِما يَقُولُونَ فَاصْبِرْ (و به یقین می‌دانیم که سینه تو به خاطر آنچه می‌گویند، تنگ می‌شود، پس صبر کن). و او صبور بر آزار خلق خود است. و این صراط، صراط رب نامیده شد، زیرا مربوب (پرورده) را می‌طلبد و آن را مستقیم قرار داده است. پس هر کس از آن خارج شود، منحرف شده و از استقامت خارج گشته است. و به همین دلیل، دوستی در راه خدا و بغض در راه خدا را برای ما تشریع کرد و آن را از عمل مختص به او قرار داد، و بنده در آن بهره‌ای ندارد، مگر آنچه خداوند از پاداش آن به او عطا می‌کند، و آن این است که خداوند با کسی که با اولیای او دشمنی کند، دشمنی می‌کند و با کسی که با آنان دوستی کند، دوستی می‌کند. پس سالک بر صراط رب، کسی است که به هر دو صفت قیام می‌کند، اما به حق مشروع برای خدا، نه برای نفس خود. زیرا خداوند برای هیچ یک از بندگانش قیام نمی‌کند، مگر برای کسی که برای او قیام کند. و به همین دلیل گفت: ولا يَخافُونَ لَوْمَةَ لائِمٍ (و از سرزنش هیچ سرزنش‌کننده‌ای نمی‌ترسند). و حق خدا برای قضا (ادا شدن) سزاوارتر از حق مخلوق است، وقتی با هم جمع شوند. زیرا هیچ مخلوقی حقی ندارد مگر به جعل خدا. پس اگر دو حق در زمانی معین شدند، بنده موفق با ادای حق خدا که از آنِ اوست، آغاز می‌کند، سپس به ادای حق مخلوق که خدا آن را واجب کرده است، می‌پردازد. و این خلاف چیزی است که امروز فقها در وصیت و دین بر آن هستند، زیرا خداوند تعالی وصیت را بر دین مقدم داشته است، و وصیت حق خداست. و:\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم: حق الله أحق أن يقضى (حق خدا سزاوارتر است که ادا شود).\n\nپس هر کس در حق خدا مسامحه کند، عملش به خودش باز می‌گردد و در حق او مسامحه می‌شود. اگر سخن بگوید، به او گفته می‌شود: تو نیز چنین کردی، پس ثمره کشت خود را بچین. و صراط رب جز با تکلیف نیست. پس وقتی تکلیف برداشته شود، این صراط عین وجودی نخواهد داشت. و به همین دلیل، سرانجام به رحمت است و حکم غضب الهی در عاصیان زائل می‌شود. و قول هود (علیه السلام): إِنَّ رَبِّي عَلى‏ صِراطٍ مُسْتَقِيمٍ (همانا پروردگار من بر راهی راست است)، یعنی در آنچه تشریع کرده است، با وجود اینکه تعالی زمام بندگانش را به سوی آنچه وقوع آن را از آنان خواسته است، گرفته است، و با وجود این جبر، آنان را عقوبت می‌کند. پس به خود توجه کن و ادب نگه دار و راه میانه را بپیما.\n\n### [صراط نعمت‌یافتگان]\n\nو اما صراط نعمت‌یافتگان (صِراطِ الْمُنْعَم)، که همان صراط کسانی است که خداوند به آن‌ها نعمت داده است، و این همان قول تعالی است: شَرَعَ لَكُمْ مِنَ الدِّينِ ما وَصَّى بِهِ نُوحاً والَّذِي أَوْحَيْنا إِلَيْكَ وما وَصَّيْنا بِهِ إِبْراهِيمَ ومُوسى‏ وعِيسى‏ (برای شما از دین آنچه را که به نوح وصیت کرد، و آنچه را که به تو وحی کردیم، و آنچه را که به ابراهیم و موسی و عیسی وصیت کردیم، تشریع نمود). و انبیاء و رسولان را ذکر کرد، سپس گفت: أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ (آنان کسانی هستند که خدا هدایتشان کرده است، پس به هدایت آنان اقتدا کن). و این همان صراط جامعی است که هر نبی و رسولی را در بر می‌گیرد، و آن اقامه دین و تفرقه نینداختن در آن و اجتماع بر آن است. و این همان چیزی است که بخاری بر آن باب بسته است: «باب ما جاء أن الأنبياء دينهم واحد» (باب آنچه آمده است که دین انبیاء یکی است). و «الدین» را با الف و لام تعریف آورد، زیرا تمام آن از جانب خداست. و اگرچه برخی از احکام آن متفاوت است، اما همه مأمور به اقامه آن و اجتماع بر آن هستند. و آن همان منهاج (راه روشن) است که بر آن اتفاق کردند. و آنچه در احکام با هم اختلاف کردند، همان شریعت (الشرعة) است که خداوند برای هر یک از رسولان قرار داد. قال تعالى: لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً (برای هر یک از شما شریعت و راهی قرار دادیم). ولَوْ شاءَ الله لَجَعَلَكُمْ أُمَّةً واحِدَةً (و اگر خدا می‌خواست، شما را امتی واحد قرار می‌داد)، پس شرایع شما متفاوت نمی‌شد، همان‌طور که آنچه به اجتماع و اقامه آن امر شدید، متفاوت نشد. پس چون اختلاف از او بود، و او اهل عدل و احسان است، و در میان مردم ادعایی در نسبت دادن افعالشان به خودشان و اختیارشان در آنچه اختیار کردند، وجود داشت و امر را به اهلش و کسی که سزاوار آن است، اسناد ندادند، حکم الهی بر رسولان نازل شد که این بد است و این خوب، و این طاعت است و این معصیت. و حکم الهی بر عقول نازل شد که این در حق کسی که با طبع و مزاجش سازگار نیست یا با غرضش موافق نیست، خوب است، و این که با غرضش موافق نیست و با طبع و مزاجش سازگار نیست، خوب نیست. و امر را به عین واحد اسناد ندادند. پس به آنچه به خاطر این امر پاداش داده شدند، پاداش داده شدند. پس در آنچه از جزا به بدی حکم کرد، عدالت ورزید، و پس از حکم و نفوذ آن، به آنچه بندگانش از رحمت به آن بازگشتند و امور دشوار را از آنان برداشت، که همان آلام است، احسان کرد. پس رحمت او همه چیز را فرا گرفت.\n\n### [صراط خاص، که همان صراط پیامبر (ص) است]\n\nو اما صراط خاص، که همان صراط پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است که به آن اختصاص یافت، نه جماعت، و آن قرآن، ریسمان محکم خدا، و شریعت جامع اوست، و این همان قول اوست: وأَنَّ هذا صِراطِي مُسْتَقِيماً فَاتَّبِعُوهُ ولا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ (و این راه من است که مستقیم است، پس از آن پیروی کنید و از راه‌های دیگر پیروی نکنید که شما را از راه او پراکنده می‌سازد). یعنی این صراطی که به او اضافه شده است. و این بدان دلیل است که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) پیامبر بود در حالی که آدم بین آب و گل بود، و او سید مردم در روز قیامت است، به واسطه خبر دادن او به ما از وحیی که به او وحی شد و بعثت عام او، که نشان می‌دهد تمامی شرایعی که از نظر زمانی پیش از او بودند، از شرع او هستند. پس با بعثت او، آنچه نسخ شد، نسخ شد و آنچه باقی ماند، باقی ماند، همان‌طور که آنچه را که حکماً ثابت کرده بود، نسخ کرد. و از جمله آن، این است که به او جوامع الکلم (سخنان جامع) داده شد، و عالم کلمات خداست. پس خداوند به او حکم در کلمات خود را عطا کرد و عمومیت داد و رسالت و نبوت را با او ختم کرد، همان‌طور که باطناً با او آغاز کرد، ظاهراً با او ختم کرد. پس امر نبوی از قبل و بعد از آن برای اوست. پس ورثه او که حق اجتهاد در نصب احکام را دارند، به منزله رسولانی هستند که از نظر زمانی پیش از او بودند. پس کسی که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را در جامعیت او به ارث برد، از جانب خدا تعریفی از حکم به او داده شد، و این مقامی بالاتر از اجتهاد است، و آن این است که خداوند با تعریف الهی به او عطا کند که حکم خدا که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در این مسئله آورده است، چنین است. پس او در آن حکم به منزله کسی است که آن را از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) شنیده است. و اگر حدیثی از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به او برسد، در مورد آن به خدا رجوع می‌کند، پس صحت حدیث را از سقم آن می‌شناسد، خواه آن حدیث نزد اهل نقل از صحیح باشد یا از آنچه در آن سخن گفته شده است. پس وقتی شناخت، حکم خود را از اصل گرفته است. و ابویزید از این مقام، یعنی گرفتن از خدا، از خود خبر داد که به آن رسیده است، و در آنچه از او روایت کرده‌ایم، خطاب به علمای زمان خود گفت:\n\nشما علم خود را از مرده‌ای از مرده گرفتید و ما علم خود را از زنده‌ای که نمی‌میرد گرفتیم.\n\nو ما به حمد خدا در این مقام، ذوق شریفی در آنچه شریعت ما را به آن تعبد کرده است، داریم. و این از وحی است که برای این امت باقی مانده است، و آن تعریف است نه تشریع. و اما اهل اجتهاد، احکام آنان تشریع شرع است اگر خطا کنند، زیرا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) مقررکننده آن حکم است. پس آن تشریع برای آنان نیست، بلکه تشریع رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است. و اگر مجتهد به صواب رسد، او صاحب نقل شرع است، که همه این‌ها در واقع امر است. زیرا خطاکننده از مجتهدان و صواب‌رسنده یکی است، نه به عین مشخص. اما صواب‌رسنده در واقع امر، ناقل است، و خطاکننده در واقع امر، مقررکننده حکمی مجهول است که جز با نظر این مجتهد دانسته نشده است. پس آن نزد خدا قبل از وجودش معلوم بوده است. و شارع، که رسول است، جز حکم معین معلوم نزد خدا را مقرر نکرده است. و آن نزد او به تفصیل و تعیین معلوم نیست. پس حکم مجتهد خطاکننده، تشریع برای تشریع بود. و اهل الله در شرع حکمی ندارند، مگر آنچه که به تعیین نزد رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) محکوم به آن است. و آنان وارثان بر حقیقت هستند، زیرا وارث جز آنچه ملک مورث او بوده است، وقتی از او بمیرد، به ارث نمی‌برد. و حکم مجتهد خطاکننده، ملک معین او نیست تا از او به ارث برده شود. پس او وارث نیست، زیرا آنچه نزد اوست، چیزی جز مقرر کردن آنچه نظرش به آن رسیده است، نیست. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را برای او مباح کرده است. پس او مانند عَصَبه (خویشاوندان پدری) است که در میراث سهم معینی ندارند، بلکه سهم آنان چیزی است که پس از الحاق فرایض به اهلش باقی می‌ماند، و مانند به ارث بردن اولی الارحام و مسلمانان پس از گرفتن فرایض. پس اگر از غیر صاحب فریضه‌ای بمیرد، مانند رسول یا پیامبری که بمیرد و کسی از او پیروی نکرده باشد، و تنها محشور شود، ممکن است کسی از این امت او را در خلق یا در حالش به ارث ببرد، نه در حکمش، کسی که به آن حال یا حکم دست یابد. و اما ایمان به او، هر کس به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) ایمان آورده است، به او ایمان آورده است. پس امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) که به او مؤمن هستند، پیروان هر پیامبر و هر کتاب و هر صحیفه‌ای هستند که از جانب خدا آمده یا نازل شده است، در ایمان به آن، نه در عمل به حکم. پس هیچ پیامبری باقی نمانده است مگر اینکه به او ایمان آورده شده است. پس پیامبر محمد (صَلَّى اللهُ عَليهِ وسَلَّم) امامت و تقدم دارد و تمامی رسولان و انبیاء در یک صف پشت سر او هستند، و ما پشت سر رسولان و پشت سر محمد هستیم. و از رسولان کسانی هستند که در حشر دو صورت دارند: صورتی با ما و صورتی با رسولان، مانند عیسی. و تمامی امت‌ها پشت سر ما هستند، جز اینکه ما دو صورت داریم: صورتی در صف رسولان (علیهم السلام) که تنها برای علمای این امت است، و صورتی پشت سر رسولان از جهت ایمان به آن‌ها. و همچنین سایر امت‌ها دو صورت دارند: صورتی که با آن پشت سر ما هستند و صورتی که با آن پشت سر رسولان خود هستند. پس گاهی نظر بیننده بر صورت‌های آنان پشت سر ما می‌افتد و گاهی پشت سر رسولانشان و گاهی بر مجموع. پس این‌ها احوال علما در آخرت در حشرشان است. و اما ورثه افعال، آنان کسانی هستند که از رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) در هر فعلی که بر آن بود و هیئتی که برای ما پیروی از آن مباح بود، پیروی کردند، حتی در تعداد ازدواج او و در خوردن و نوشیدن او و تمامی افعالی که به او نسبت داده می‌شود و خداوند او را در آن‌ها قرار داده است، از اوراد، تسبیح و نماز، و از آن کم نمی‌کنند. اگر بر آن بیفزایند، پس از تحصیل آن‌ها، جز از حکم قول او (صَلَّى اللهُ عَليهِ وسَلَّم) بر آن نیفزوده‌اند. پس این وراثت افعال اوست. و اما وراثت احوال او، ذوق آنچه بود که در نفس خود می‌یافت، مانند وحی به واسطه ملک، که وارث آن را در لَمّه مَلَکیه (جایگاه فرشته در قلب) و از ملکی که او را تأیید می‌کند و از وجه خاص الهی با برداشته شدن واسطه‌ها می‌یابد، و اینکه حق عین قول او باشد، و قرآن را نازل شده بر خود بخواند و لذت انزال را با ذوق بر قلب خود هنگام قرائت بیابد. زیرا قرآن هنگام قرائت هر قاری، در نفس خود یا با زبان خود، ناگزیر تنزلی الهی دارد. پس تنزل و آمدن آن هنگام قرائت هر قاری، حادث است. اما وارث به حال، انزال را حس می‌کند و از آن لذت خاصی می‌برد که جز امثال او آن را نمی‌یابند. پس او صاحب میراث حال است. و ما به حمد خدا آن را حالاً چشیده‌ایم. و این همان چیزی است که ابویزید درباره آن گفت: «نمردم تا اینکه قرآن را استظهار کردم»، و آن وجود لذت انزال از غیب بر قلوب است. و غیر از اینان، قرآن را تنها از خیال خود می‌خوانند. پس اگر قرآن را از مصحف‌ها و لوح‌ها حفظ کرده باشند، صور حروف نوشته شده آن را تخیل می‌کنند، یا اگر آن را از معلم خود گرفته باشند، صور حروف آنچه را که از معلم خود گرفته‌اند، تخیل می‌کنند. این در صورتی است که به آن عمل کنند. و اما اگر آن را بدون اخلاص بخوانند، از گلوهایشان فراتر نمی‌رود، یعنی خداوند چیزی از آن را نمی‌پذیرد، پس در محل تلاوت آن، که مخرج صوت است، باقی می‌ماند. پس قرآن را جز صاحب تنزل، که همان ذوق میراثی است، از قلب خود نمی‌خواند. پس هر کس آن را بیابد، صاحب آن است و آن را هنگام یافتن می‌شناسد و نیازی به شناساننده ندارد. زیرا:\n\nدر آن هنگام بین قرائت خود از خیالش و قرائت خود از تنزیل پروردگارش به مشاهده فرق می‌گذارد. و امر دیگری برای نبی یا رسول نیست که در آن میراثی واقع شود، جز قول یا فعل یا حال. پس وارث کامل کسی است که جمع کند، و وارث ناقص کسی است که به برخی از این مراتب اکتفا کند. و بدان که این منزل، منزل کسی است که به صفت خُلّت (دوستی خاص) از انبیاء (علیهم السلام) متصف شده است. پس هر کس به آن دست یابد، نصیبی از خُلّت الهی دارد و سهمی در آن برای او زده شده است.\n\nو سخن در این باره طولانی است و وقت برای تفصیل آن کافی نیست.\n\nپس آنچه را که از علوم در آن است، مانند سایر منازل، ذکر می‌کنیم. پس می‌گوییم: در آن علم رحمت خلیلان (دوستان خاص) و فرق بین آن و رحمت محبوبان، فرزندان، پدران و تمامی لذت‌هاست. و در آن علم حلاوت تنزل و اینکه کسی که قرآن بر او جدیداً هنگام تلاوت نازل می‌شود، آن را در کجای نفس خود حس می‌کند، وجود دارد. و در آن علم اغیار، اسرار، انوار، هدایت و انواع محامد و مراتب خاص به هر نفس است که هیچ کس با او در آن اشتراکی ندارد. و این بدان دلیل است که ما می‌دانیم که برای هر نفسی صفتی یا حقیقتی است که به آن اختصاص دارد و با آن از هر چیزی در عالم متمایز می‌شود، و این ضروری است. پس وقتی امر الهی از طریق آن حقیقت خاص به او می‌رسد، ذوق او از آن، تنها به او محدود است. و این کمترین بهره نفس از مقام عزت الهی است، زیرا برای هر نفسی است، اگرچه آن را حس نکند. و این مانند فعل امور طبیعی به واسطه خاصیت است، مانند مغناطیس و امثال آن. جز اینکه خاصیت در امور طبیعی بر دو نوع است: به صورت انفرادی و به صورت مجموع، و در مزاج خاص. زیرا خواص طبیعی در هر مزاجی و در هر صورتی جاری نمی‌شود. و خاصیت اهل الله اگر با ذوق از نفوس خود بر آن وقوف یابند، حکم آن در هر چیزی در عالم جاری می‌شود. و در آن علم ملکوت، مشاهده (الشهود) و دیدن معدوم در حال عدمش، بدون تخیل و تمثل و بدون ادراک خیال، بلکه با بصر حسی است. و در آن علم اسباب تحیر و حیرت است. و در آن علم این است که انسان جز آنچه استعدادش به او می‌دهد، وقتی آن را به کار می‌گیرد یا ناگهان به او می‌رسد، نمی‌داند، و بیش از آن را نمی‌پذیرد، زیرا قدرت پذیرش آن را ندارد. و در آن علم رسولان و رسالت است. و در آن علم این است که انسان ذاتاً عالم است، جز اینکه فراموش می‌کند. پس هر علمی که برای او حاصل می‌شود، تنها تذکر است، و جز اهل الله به آن آگاه نیستند که تذکر است. و در آن علم بلاها و نعمت‌هاست. و در آن علم فرقان در تعریف بین تقریر و توبیخ و آنچه بر طریق منت یا مطالبه است، وجود دارد. و در آن علم صفات تنزیه در افعال است، و اینکه هر طلبی در عالم یا از هر طالب، تنها طلب ذاتی است. طلب عارضی وجود ندارد که ذاتی نباشد؛ این ممکن نیست. بلکه امری برای شخص عارض می‌شود که نزد او نبوده است. پس این امری که نزد او حاصل شده است، همان است که برای مطلوب، طلب ذاتی دارد. و مردم به کسی که آن امر عارضی به او قائم شده است، محجوب شده‌اند، و او را طالب می‌نامند. در حالی که طالب جز آن امر نیست. پس طلب برای آن ذاتی است و شخصی که این امر به او قائم شده است، مورد استفاده آن است، زیرا او موجود بوده و فاقد این طلب بوده است. پس دانستیم که آن طلب، مورد استفاده در امری است که این امر حلول کرده در او را بر او واجب کرده است. پس طلب برای آن امر ذاتی است و این شخص که آن امر بر او نازل شده است، برای تحصیل آن مورد استفاده قرار گرفته است. و مردم به این آگاهی ندارند. و در آن علم نظر، تفکر و اعتبار است، و اینکه عالم بعضی برای بعضی عبرت است. و در آن علم آنچه خداوند به آن اختصاص دارد از علوم متفرقه در عالم است، و آن جامعیت آن‌هاست که جز خدا آن را نمی‌داند. این در مورد آنچه از آن وارد وجود شده است، به همراه علم او به آنچه وارد وجود نشده است و هیچ مخلوقی به علم آن متصف نشده است. پس او از علم دنیا، علم جامعیت را دارد، به همراه آنچه از علم آخرت به آن اضافه شده است، و این ضروری است. و در آن علم استدلال به محدث (حادث) بر قدیم و آنچه در نفس از آن حاصل می‌شود، وجود دارد. زیرا قدیم در نفس حاصل نمی‌شود، و اگر محدث حاصل شود، آن مطلوب نیست. و هر آنچه حاصل شود، محدث است. و در آن علم آنچه توکل در آن شکر خداست، وجود دارد. و در آن علم کسی که معنایی به او قائم شده است که اسمی را برای او واجب کرده است که سزاوار آن است، وجود دارد. و از اینجا اسماء الحسنی خدا را از اسماء او می‌شناسی. زیرا اسماء خدا در کون، از آثار این نفوس است، و اسماء کون، از معانی قائم به آن است. پس حق در اسماء خود منزه و واحد العین است، و کون به واسطه اسماء خود متکثر است، به دلیل قیام معانی به آن که اسماء را برایش واجب کرده است. و در آن علم اسباب میراث است. و در آن علم کسی که پیروز شد و کسی که ناامید شد، وجود دارد، در حالی که همه طالب هستند. و در آن علم مشاهده مرگ، با وجود اینکه نسبتی عدمی است، و اینکه در چه کسی حکم می‌کند، و اینکه مرگ در کسی که ترکیب ندارد، حکمی ندارد. و هر مرکبی که به وضع است، مرگ را می‌پذیرد. و اگر نمیرد، به دلیل امر دیگری است که مشیت الهی آن را اقتضا کرده است. و ممکن است برای آن سببی ظاهری یا معلوم قرار دهد، و ممکن است جز حکم عین مشیت خاص نباشد. و در آن علم حکم بر خدا به آنچه اقتضا می‌کند، از جهت آنچه ممکن است، نه به آنچه خدا بر آن است، وجود دارد. و در قرآن از این بسیار وارد شده است، اما معنای آن را جز علمای به آنچه حقایق موجودات عطا می‌کند و دانایان به ماهیت اشیاء، نمی‌دانند. و در آن علم روز قیامت، حشر و نشر و آنچه آن روز به آن اختصاص دارد از حکم، و اینکه حاکم در آن کیست و مراتب متصرفان در آن، وجود دارد. و در آن علم امر مقتضی در آن روز چیست، وجود دارد. و در آن علم تشبیه انسان به گیاه، از جهت اینکه درخت است نه از جهت اینکه ستاره است، وجود دارد. و از اینجا نهی شد که آدم به درخت نزدیک شود. پس این تنبیهی است بر نهی او از نزدیک شدن به اغراض نفس خود و هوای آن، و این همان قول اوست: ونَهَى النَّفْسَ عَنِ الْهَوى‏ (و نفس را از هوا نهی کرد)، و آن اراده نفس به چیزی است که عمل به آن یا ترک آن برایش تشریع نشده است. و در آن علم تمکین و ثبات بر علم آنچه حقایق در قول و فعل عطا می‌کند، وجود دارد. و در آن علم آنچه از تبدیل و تلوین ستوده می‌شود و آنچه مذموم است، وجود دارد. و در آن علم مهلت دادن و اهمال مقصود است. و در آن علم حکمت تسخیر کونی و الهی است. و در آن علم افراد ذات حق به الوهیت است. و در آن علم اقتدا و اینکه به چه کسی باید اقتدا کرد، وجود دارد. و در آن علم تقیید ثنا به حال و اطلاق آن به قول است. و در آن علم آنچه در هستی (الوجود) ظاهر می‌شود که معلوم و آشکار از علمی است که به آن تعلق دارد و آن ظهور را برایش واجب کرده است، وجود دارد. و در آن علم این است که انسان با وجود علمش به اینکه خداوند به جهات مقید نیست و از حَبْلِ الْوَرِيدِ (رگ گردن) به او نزدیک‌تر است، با این همه، در او جهت فوق و تحدید را توهم می‌کند. نشأت او به او اجازه نمی‌دهد که از حکم وهم بر عقل خود خالی باشد. پس حقیقت امر را با حکم وهم خود تعقل می‌کند، بدون تأخیر. پس در یک آن، بین حکم عقل و وهم جمع می‌کند، همان‌طور که بین اموری که با آن‌ها انسان شد، جمع کرد. و در آن علم مراتب قرآن در مردم است، به طوری که در حکم یک طایفه بر خلاف حکم آن در طایفه دیگر است. پس این برخی از علومی است که این منزل به طور اجمالی در بر دارد. و والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (و خدا حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 9
}