{
  "id": 373,
  "title": {
    "ar": "الباب الثالث والسبعون وثلاثمائة في معرفة منزل ثلاثة أسرار ظهرت في الماء الحكمي المفضل‏",
    "en": "Chapter Three Hundred and Seventy-Three: Concerning the Knowledge of the Station of Three Mysteries that Manifested in the Distinguished Water of Wisdom.",
    "ur": "باب تین سو تہتر: فضیلت والے حکمی پانی میں ظاہر ہونے والے تین اسرار کے منزل کی معرفت کے بیان میں",
    "fa": "باب سیصد و هفتاد و سوم در معرفت منزل سه سری که در آب حکمی برتر (مفضل) آشکار شدند"
  },
  "content": {
    "ar": "## «الباب الثالث والسبعون وثلاثمائة» في معرفة منزل ثلاثة أسرار ظهرت في الماء الحكمي المفضل‏\n\n\nمرتبته على العالم بالعناية وبقاء العالم أبد الآبدين وإن انتقلت صورته وهو من الحضرة المحمدية\n\n\n> مقامات تنص على اتساق *** لأرواح منباة كرام‏\n\n\n> أفوه بها ولا يدري جليسي *** لأن النور في عين الظلام‏\n\n\n> فلو لا ظلمة ما كان نور *** فعين النقص يظهر بالتمام‏\n\n\n> إذا علم الإضافة من يراها *** تقيد بالعقود وبالقيام‏\n\n\n> يرى أن الوجود له انتهاء *** وأن البدء يظهر بالختام‏\n\n\n> فحال بين بدء وانقضاء *** وجود لا يزال مع الدوام‏\n\n\n### [العالم كله كتاب مسطور]\n\n\nاعلم أيدك الله أن العالم كله كتاب مسطور في رَقٍّ مَنْشُورٍ وهو الوجود فهو ظاهر مبسوط غير مطوي ليعلم ببسطه أنه مخلوق للرحمة وبظهوره يعقل ويعلم ما فيه وما يدل عليه وجعله كتابا لضم حروفه بعضها إلى بعض وهو ترتيب العالم على الوجوه التي ذكرناها وضم معانيه إلى حروفه مأخوذ من كتيبة الجيش وإنما قلنا في بسطة إنه للرحمة لأنه منها نزل كما قال تعالى تَنْزِيلٌ من الرَّحْمنِ الرَّحِيمِ كِتابٌ فُصِّلَتْ آياتُهُ قُرْآناً عَرَبِيًّا لِقَوْمٍ يَعْلَمُونَ وقال تعالى في ذلك كِتابٌ أُحْكِمَتْ آياتُهُ ثُمَّ فُصِّلَتْ من لَدُنْ حَكِيمٍ خَبِيرٍ فأحكام الآيات فيه وتفصيلها لا يعرفه إلا من آتاه الله الحكمة وفصل الخطاب وصورة الحكمة التي أعطاها الحكيم الخبير لأهل العناية علم مراتب الأمور وما تستحقه الموجودات والمعلومات من الحق الذي هو لها وهو إعطاء كل شي‏ء خلقه إعطاء إلهيا ليعطي كل خلق حقه إعطاء كونيا بما آتانا الله فنعلم بالقوة ما يستحقه كل موجود في الحدود ونفصله بعد ذلك آيات بالفعل لمن يعقل كما أعطانيه الخبير الحكيم فننزل الأمور منازلها ونعطيها حقها ولا نتعدى بها مرتبتها فتفصيل الآيات والدلالات من المفصل إذا جعلها في أماكنها بهذا الشرط لأنه ما كل مفصل حكيم دليل على أنه قد أوتي الحكمة وعلم أحكام الآيات ورحمته بالآيات والموجودات التي هي الكتاب الإلهي وليس إلا العالم دليل على علمه بمن أنزله وليس إلا الرحمن الرحيم وخاتمة الأمر ليست سوى عين سوابقها وسوابقها الرحمن الرحيم فمن هنا تعلم مراتب العالم ومآله إنه إلى الرحمة المطلقة وإن تعب في الطريق وأدركه العناء والمشقة فمن الناس من ينال الرحمة والراحة بنفس ما يدخل المنزل الذي وصل إليه وهم أهل الجنة ومنهم من يبقى معه تعب الطريق ومشقته ونصب بحسب مزاجه وربما مرض واعتل زمانا ثم انتقل من دائه واستراح وهم أهل النار الذين هم أهلها ما هم الذين‏\nخرجوا منها إلى الجنة فمستهم النار بقدر خطاياهم مع كونهم أماتهم الله فيها إماتة فإن أولئك ليست النار منزلا لهم يعمرونه ويقيمون فيه مع أهليهم وإنما النار لهؤلاء منهل من المناهل التي ينزلها المسافر في طريقه حتى يصل إلى منزله الذي فيه أهله فهذا معنى الحكمة والتفصيل فإن الأمور أعني الممكنات متميزة في ذاتها في حال عدمها ويعلمها الله سبحانه وعلى ما هي عليه في نفسها ويراها ويأمرها بالتكوين وهو الوجود فتتكون عن أمره فما عند الله إجمال كما أنه ليس في أعيان الممكنات إجمال بل الأمر كله في نفسه وفي علم الله مفصل وإنما وقع الإجمال عندنا وفي حقنا وفينا ظهر فمن كشف التفصيل في عين الإجمال علما أو عينا أو حقا فذلك الذي أعطاه الله الحكمة وفصل الخطاب وليس إلا الرسل والورثة خاصة وأما الحكماء أعني الفلاسفة فإن الحكمة عندهم عارية فإنهم لا يعلمون التفصيل في الإجمال وصورة ذلك كما يراه صاحب هذا المقام الذي أعطاه الله الحكمة التي عنده عناية إلهية وهي عند الحق تعيين الأرواح الجزئية المنفوخة في الأجسام المسواة المعدلة من الطبيعة العنصرية من الروح الكل المضاف إليه ولذلك ذكر أنه خلقها قبل الأجسام أي قدرها وعينها الكل جسم وصورة روحها المدبر لها الموجود بالقوة في هذا الروح الكل المضاف إليه فيظهر ذلك في التفصيل بالفعل عند النفخ وذلك هو النفس الرحماني لصاحب الكشف فيرى في المداد الذي في الدواة جميع ما فيه من الحروف والكلمات وما يتضمنه من صور ما يصورها الكاتب أو الرسام وكل ذلك كتاب فيقول في هذا المداد من الصور كذا وكذا صورة فإذا جاء الكاتب والرسام أو الرسام دون الكاتب أو الكاتب دون الرسام بحسب ما يذكره صاحب الكشف فيكتب بذلك المداد ويرسم جميع ما ذكره هذا المكاشف بحيث لا يزيد على ذلك ولا ينقص ولا يدرك ذلك هذا المسمى في عرف العقلاء حكما فهذا حظ أهل الكشف فهم الذين أعطاهم الله الحكمة وفصل الخطاب وقد أمرنا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن نعطي كل ذي حق حقه ولا نفعل ذلك حتى نعلم ما يستحقه كل ذي حق من الحق وليس إلا بتبيين الحق لنا ذلك ولذلك أضافه إليه تعالى فقال وآتَيْناهُ الْحِكْمَةَ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً فما يعلمها إلا من أوتيها فهي هبة من الله تعالى كما وهبنا وجود أعياننا ولم نكن شيئا وجوديا فالعلم الإلهي هو الذي كان الله سبحانه معلمه بالإلهام والإلقاء وبإنزال الروح الأمين على قلبه وهذا الكتاب من ذلك النمط عندنا فو الله ما كتبت منه حرفا إلا عن إملاء إلهي وإلقاء رباني أو نفث روحاني في روع كياني هذا جملة الأمر مع كوننا لسنا برسل مشرعين ولا أنبياء مكلفين بكسر اللام اسم فاعل فإن رسالة التشريع ونبوة التكليف قد انقطعت عند رسول الله محمد صَلَّى اللهُ عَليهِ وسَلَّم فلا رسول بعده صَلَّى اللهُ عَليهِ وسَلَّم ولا نبي يشرع ولا يكلف وإنما هو علم وحكمة وفهم عن الله فيما شرعه على السنة رسله وأنبيائه عليهم سلام الله وما خطه وكتبه في لوح الوجود من حروف العالم وكلمات الحق فالتنزيل لا ينتهي بل هو دائم دنيا وآخرة\n\n\n> الله أنشأ من طي وخولان *** جسمي فعدلني خلقا وسواني‏\n\n\n> وأنشأ الحق لي روحا مطهرة *** فليس بنيان غيري مثل بنياني‏\n\n\n> إني لا عرف روحا كان ينزل بي *** من فوق سبع سماوات بفرقان‏\n\n\nنريد قوله تعالى إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً وما أنا مدع في ذاك من نبأ من الإله ولكن جود إحسان‏\n\n\n> إن النبوة بيت بيننا غلق *** وبينه موثق بقفل إيمان‏\n\n\nوإنما قلنا ذلك لئلا يتوهم متوهم إني وأمثالي وادعى نبوة لا والله ما بقي إلا ميراث وسلوك على مدرجة محمد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم خاصة وإن كان للناس عامة ولنا ولأمثالنا خاصة من النبوة ما أبقى الله علينا منها مثل المبشرات ومكارم الأخلاق ومثل حفظ القرآن إذا استظهره الإنسان فإن هذا وأمثاله من أجزاء النبوة المورثة ولذلك كان أول إنسان أنشأه الله وهو آدم نبيا من مشى على مدرجته بعد ذلك فهو وارث لا بد من ذلك بهذه النشأة الترابية وأما في المقام فآدم ومن دونه إنما هو وارث محمد صَلَّى اللهُ عَليهِ وسَلَّم لأنه كان نبيا وآدم بين الماء والطين لم يكن بعد موجودا فالنبوة\nلمحمد صَلَّى اللهُ عَليهِ وسَلَّم ولا آدم والصورة الآدمية الطبيعية الإنسانية لآدم ولا صورة لمحمد صَلَّى اللهُ عَليهِ وسَلَّم وعلى آدم وعلى جميع النبيين فآدم أبو الأجسام الإنسانية ومحمد صَلَّى اللهُ عَليهِ وسَلَّم أبو الورثة من آدم إلى خاتم الأمر من الورثة فكل شرع ظهر وكل علم أنما هو ميراث محمدي في كل زمان ورسول ونبي من آدم إلى يوم القيامة ولهذا أوتي جوامع الكلم ومنها علم الله آدم الأسماء كلها فظهر حكم الكل في الصورة الآدمية والصورة المحمدية فهي في آدم أسماء وفي محمد صَلَّى اللهُ عَليهِ وسَلَّم كلم وكلمات الله سبحانه لا تنفد وموجوداته من حيث جوهرها لا تبعد وإن ذهبت صورها وتبدلت أحكامها فالعين لا تذهب ولا تتبدل بل وقع التبديل في العالم لما هو الحق عليه من التحول في الصور فلو لم يظهر التبدل في العالم لم يكمل العالم فلم تبق حقيقة إلهية إلا وللعالم استناد إليها على أن تحقيق الأمر عند أهل الكشف إن عين تبدل العالم هو عين التحول الإلهي في الصور فعين كونه فيما شاء تجلى عين كونه فيما شاء ركبك ف ما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله فتلك على الحقيقة مشيئة الله لا مشيئتك وأنت تشاء بها فالحياة لعين الجوهر والموت لتبدل الصور كل ذلك لِيَبْلُوَكُمْ بالتكليف أَيُّكُمْ أَحْسَنُ عَمَلًا وإنما يبلوكم لتصح نسبة الاسم الخبير فهو علم عن خبرة يعلم ولا خبرة لإقامة حجة على من خلق فيه النزاع والإنكار وهذا كله من تفصيل الآيات في الخطاب وفي الأعيان ف هُوَ الْحَكِيمُ الْخَبِيرُ وهُوَ الْعَزِيزُ الْغَفُورُ فلو كشف لكل أحد ما كشفه لبعض العالم لم يكن غفورا ولا كان فضل لأحد على أحد إذ لا فضل إلا بمزيد العلم كان بما كان فالعالم كله فاضل مفضول فاشترك أعلى العلماء مع أنزلهم في علم الصنعة فالعالم صنعة الله والعلم بصنعة الحياكة علم الحائك وهو صنعته وذلك في العموم أنزل العلوم وفي الخصوص علم الصنعة أرفع العلوم لأنه بالصنعة ظهر الحق في الوجود فهي أعظم دليل وأوضح سبيل وأقوم قيل ومن هنا ظهر خواص الله الأكابر في الحكم بصورة العامة فجهلت مرتبتهم فلا يعرفهم سواهم وما لهم مزية في العالم بخلاف أصحاب الأحوال فإنهم متميزون في العموم مشار إليهم بالأصابع لما ظهر عليهم بالحال من خرق العوائد وأهل الله اتقوا من ذلك لاشتراك غير الجنس معهم في ذلك فأهل الله معلومون بالمقام مجهولون بالشهود لا يعرفون كما أن الله الذي هو لأهله معلوم بالفطرة عند كل أحد مجهول عنده بالعقل والشهود فلو تجلى له ما عرفه بل لم يزل متجليا على الدوام لكنه غير معلوم إلا عند أهله وخاصته وهم أهل القرآن أهل الذكر الذين أمرنا الله أن نسألهم لأنهم ما يخبرون إلا عنه قال تعالى فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ لأن أهل الذكر هم جلساء الحق فما يخبر الذاكر الذي يشهد الله فيه أنه ذاكر له إلا عن جليسه فيخبر بالأمر على ما هو عليه وذلك هو العلم فإنه عَلى‏ بَيِّنَةٍ من رَبِّهِ ويَتْلُوهُ شاهِدٌ مِنْهُ وهو ظهوره بصورته أي الذي أتى به من العلم عن الله فهو صفته التي بها تجلى هذا الشخص الذاكر فعلى قدر ذكره يكون الحق دائم الجلوس معه ولذلك‏\n\n\nقالت عائشة رضي الله عنها في رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إنه كان يذكر الله على كل أحيانه‏\n\n\nفأثبتت له المجالسة مع الله تعالى على الدوام فأما علمت بذلك كشفا وإما أخبرها بذلك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وكان ذلك في جلوسه معه أنه يقص عليه من أنباء الرسل ما يثبت به فؤاده لما يرى من منازعة أمته إياه فيما جاء به عن الله ولو لم يكن عنده بهذه المثابة وأمثالها لم يكن بينه وبين غيره من البشر فرقان فإنه تعالى معهم حيثما كانوا وأَيْنَ ما كانُوا فلا بد أن يكون مع الذاكرين له بمعية اختصاص وما ثم إلا مزيد علم به يظهر الفضل فكل ذاكر لا يزيد علما في ذكره بمذكوره فليس بذاكر وإن ذكر بلسانه لأن الذاكر هو الذي يعمه الذكر كله فذلك هو جليس الحق فلا بد من حصول الفائدة لأن العالم الكريم الذي لا يتصور فيه بخل لا بد أن يهب جليسه أمرا لم يكن عنده إذ ليس هنالك بخل ينافي الجود فلم يبق إلا المحل القابل ولا يجالس إلا ذو محل قابل فذلك هو جليس الحق والعالم جليسهم الحق من حيث لا يشعرون وغاية العامة إذا كانت مؤمنة أن تعلم أن الله معها والفائدة إنما هي أن تكون أنت مع الله لا في أنه معك فكذلك هو الأمر في نفسه فمن كان مع الحق فلا بد أن يشهد الحق ومن شهده فليس إلا وجود العلم عنده فهذه هي المنح الإلهية\n\n\n> فالعلم أشرف ما يؤتيه من منح *** والكشف أعظم منهاج وأوضحه‏\n\n\n> فإن سألت إله الحق في طلب *** فسله كشفا فإن الله يمنحه‏\n> وأد من القرع إن الباب أغلقه *** دعوى الكيان وجود الله يفتحه‏\n\n\nفكل علم لا يكون حصوله عن كشف بعد فتح الباب يعطيه الجود الإلهي ويبديه ويوضحه فهو شعور لا علم لأنه حصل من خلف الباب والباب مغلق وليس الباب سواك فأنت بحكم معناك ومغناك وذلك هو غلق الباب فإنك تشعر أن خلف هذا الجسم والصورة الظاهرة معنى آخر لا تعلمه وإن شعرت به فالصورة الظاهرة المصراع الواحد والنفس المصراع الآخر فإذا فتحت الباب تميز المصراع من المصراع وبدا لك ما وراء الباب فذلك هو العلم فما رأيته إلا بالتفصيل لأنك فصلت ما بين المصراعين حتى تميز هذا فيك فإن كان الباب عبارة عن حق وخلق وهو أنت وربك فالتبس عليك الأمر فلم يتميز عينك من ربك فلا تميزه ما لم يفتح الباب فعين الفتح يعطيك المعرفة بالباب والفرق بين المصراعين فتعلم ذاتك وتعلم ربك وهو قوله صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه فالشعور مع غلق الباب والعلم مع فتح الباب فإذا رأيت العالم متهما لما يزعم أنه به عالم فليس بعالم وذلك هو الشهور وإن ارتفعت التهمة فيما علم فذلك هو العلم ويعلم أنه قد فتح الباب له وأن الجود قد أبرز له ما وراء الباب وكثير من الناس من يتخيل أن الشعور علم وليس كذلك وإنما حظ الشعور من العلم إن تعلم أن خلف الباب أمرا ما على الجملة لا يعلم ما هو ولذلك قال تعالى وما عَلَّمْناهُ الشِّعْرَ لقولهم هو شاعر ثم قال وما يَنْبَغِي لَهُ إِنْ هُوَ يعني هذا الذي بعثناه به إِلَّا ذِكْرٌ أي أخذه عن مجالسة من الحق وقُرْآنٌ مُبِينٌ أي ظاهر مفصل في عين الجمع ما أخذه عن شعور فإنه كل ما عينه صاحب الشعور في المشعور به فإنه حدس ولو وافق الأمر ويكون علما فما هو فيه على بصيرة في ذلك وليس ينبغي لعاقل أن يدعو إلى أمر حتى يكون من ذلك الأمر على بصيرة وهو أن يعلمه رؤية وكشفا بحيث لا يشك فيه وما اختصت بهذا المقام رسل الله بل هو لهم ولأتباعهم الورثة ولا وارث إلا من كمل له الاتباع في القول والعمل والحال الباطن خاصة فإن الوارث يجب عليه ستر الحال الظاهر فإن إظهاره موقوف على الأمر الإلهي الواجب فإنه في الدنيا فرع والأصل البطون ولهذا احتجب الله في العموم في الدنيا عن عباده وفي الآخرة يتجلى عامة لعباده فإذا تجلى لمن تجلى له على خصوصه كتجليه للجبل كذلك ما ظهر من الحال على الرسل من جهة الدلالة على صدقه ليشرع لهم والوارث داع لما قرره هذا الرسول وليس بمشرع فلا يحتاج إلى ظهور الحال كما احتاج إليه المشرع فالوارث يحفظ بقاء الدعوة في الأمة عليها وما حظه إلا ذلك حتى إن الوارث لو أتى بشرع ولا يأتي به ولكن لو فرضناه ما قبلته منه الأمة فلا فائدة لظهور الحال إذا لم يكن القبول كما كان للرسول فاعلم ذلك فما أظهر الله عليهم من الأحوال فذلك إلى الله لا عن تعمل ولا قصد من العبد وهو المسمى كرامة في الأمة فالذي يجهد فيه ولي الله وطالبه إنما هو فتح ذلك الباب ليكون من الله في أحواله عند نفسه على بصيرة لا أنه يظهر بذلك عند خلقه فهو عَلى‏ نُورٍ من رَبِّهِ وثابت في مقامه لا يزلزله إلا هو فكرامة مثل هذا النوع علمه بالله وما يتعلق به من التفصيل في أسمائه الحسنى وكلماته العليا فيعلم ما يلج في أرض طبيعته من بذر ما بذر الله فيها حين سواها وعدلها وما يخرج منها من العبارات عما فيها والأفعال العملية الصناعية على مراتبها لأن الذي يخرج عن الأرض مختلف الأنواع وذلك زينة الأرض فما يخرج عن أرض طبيعة الإنسان وجسده فهو زينة له من فصاحة في عبارة وأفعال صناعية محكمة كما يعلم ما ينزل من سماء عقله بما ينظر فيه من شرعه في معرفة ربه وذلك هو التنزيل الإلهي على قلبه وما يعرج فيها من كلمه الطيب على براق العمل الصالح الذي يرفعه إلى الله كما قال تعالى إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وهو ما خرج من الأرض والْعَمَلُ الصَّالِحُ يَرْفَعُهُ وهو ما أخرجته الأرض أيضا فالذي يَنْزِلُ من السَّماءِ هو الذي يَلِجُ في الْأَرْضِ والذي يخرج من‏\n\n\nالأرض وهو ما ظهر عن الذي ولج فيها هو الذي يعرج في السماء فعين النازل هو عين الوالج وعين الخارج هو عين العارج فالأمر ذكر وأنثى ونكاح وولادة فأعيان موجودة وأحكام مشهودة وآجال محدودة وأفعال مقصودة منها ما هي مذمومة بالعرض وهي بالذات محمودة\n\n\n### [التفصيل لا يظهر في الوجود إلا بالعمل‏]\n\n\nثم اعلم أن التفصيل لا يظهر في الوجود إلا بالعمل فإن فصله العامل على تفصيله في الإجمال الحكمة فهو العمل الصالح وإن فصله على غير ذلك بالنظر إلى تفصيل الإنسان فيه فذلك العمل غير الصالح وأكثر ما يكون العمل غير الصالح في‏\nالذين يفصلون الأمور بالنظر العقلي لا بالإعلام الإلهي فما فصل بالإعلام الإلهي فهو كله عمل صالح وما فصل بالنظر العقلي فمنه صالح وغير صالح بالنسبة إلى تفصيله لا غير والكل عمل صالح بالنسبة إلى الله تعالى كما يقول إن النقص في الوجود من كمال الوجود وإن شئت قلت من كمال العالم إذ لو نقص النقص من العالم لكان ناقصا فافهم‏\n\n\n### [الفساد تغيير الحكم الإلهي‏]\n\n\nواعلم أنه ما كنا نقول بالعمل غير الصالح ولا بالفساد أدبا مع العلم الإلهي وحقيقة ولكن لما رأينا في الوضع الإلهي قد حذر الله من الفساد وقال ولا تَبْغِ الْفَسادَ في الْأَرْضِ إِنَّ الله لا يُحِبُّ الْمُفْسِدِينَ وقال تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ ولا فَساداً ورأينا في العرف بين العقلاء بل الناس أجمعين ذكر الفساد لذلك أقدمنا على ذكره وإنما كنا نقول في ذلك بدل الفساد إظهار صورة وإزالة أخرى كما هو الأمر في نفسه من أجل تركيب خاص ونظام مزاج طبيعي فأما قوله إِنَّ الله لا يُحِبُّ الْمُفْسِدِينَ فالمراد به تغيير الحكم الإلهي لا تغيير العين ولا إبدال الصورة وأما قوله عُلُوًّا في الْأَرْضِ فهو أمر محقق لأن العلو لا تقبله الأرض ما دامت أرضا لمن هي له أرض وكل ما نراه عاليا شامخا فيها فهو جبل ووتد تقلها الله به ليسكن ميدها فالجبال ليست أرضا فخلق الله الأرض مثل الكرة أجزاء ترابية وحجرية ضم الله بعضها إلى بعض فلما خلق الله السماء بسط الأرض بعد ذلك ليستقر عليها من خلقت له مكانا ولذلك مادت ولو بقيت الكرة ما مادت وما خلق الجبال فخلق سبحانه الجبال فقال بها عليها دفعة واحدة وأدار بالماء المحيط بها جبلا جعله لها كالمنطقة قيل إن عليه أطراف قبة السماء وأن الزرقة التي نسبها إلى السماء ونصفها بها فتلك اللونية لجرم السماء لبعدها عنك في الإدراك البصري كما ترى الجبال إذا بعدت عنك رزقا وليست الزرقة لها إلا لبعدها عن نظر العين كما ترى الجبل البعيد عن نظرك أسود فإذا جئته قد لا يكون كما أبصرته وقد بينا لك أن الألوان على قسمين لون يقوم بجسم المتلون ولون يحدث للبصر عند نظره إلى الجسم لأمر عارض يقوم بين الرائي والمرئي مثل هذا ومثل الألوان التي تحدث في المتلون باللون الحقيقي لهيئات تطرأ فيراها الناظر على غير لونها القائم بها الذي يعرفه وذلك مثل الشبهات في الأدلة فهي ألوان لا ألوان وحظها من الحقائق الإلهية وما رَمَيْتَ إِذْ رَمَيْتَ وأنت لا أنت وكالعالم كله بالحقيقة هو خلق لا خلق أو حق لا حق وكالخيال هو حس لا حس ومحسوس لا محسوس أعني المتخيل والأرض منفعلة عن الماء المنفعل عن الهواء فإن الهواء هو الأصل عندنا ولذلك هو أقرب نسبة إلى العماء الذي هو نفس الرحمن فجمع بين الحرارة والرطوبة فمن حرارته ظهر ركن النار ومن رطوبته ظهر ركن الماء ومن جمود الماء كان الأرض فالهواء ابن للنفس وهو العماء والنار والماء ولدان للهواء والأرض ولد الولد وهو ما جمد من الماء وما لم يجمد بقي ماء على أصله والأرض على ذلك الماء وقد رأينا في نهر الفرات إذا جمد في الكوانين ببلاد الشمال يعود أرضا تمشي عليه القوافل والناس والدواب والماء من تحت ذلك الجليد جار وذلك الماء على الهواء وهو الذي يمده برطوبته فيحفظ عليه عينه واستقراره عليه فإن الهواء يجري الماء إذا تحرك وإذا احتقن وسكن سكن الماء عليه فلا ينفذ الماء فيه وقد رأينا ذلك في أنبوب القصب وأمثاله المنفوذ الثقب إذا ملأته ماء وسددت موضع الثقب الأعلى من الأنبوب لا يجري من أسفل الأنبوب شي‏ء من الماء فإذا أزالته جرى الماء فلم يعتمد ذلك الماء إلا على الهواء الساكن لسكونه وهو صورة تعم العالم كله وإذا تموج الهواء سمي ريحا والريح تنقل روائح ما تمر عليه من طيب وخبيث إلى المشام وكذلك تنقل برودة الأشياء وحرارتها ولذلك توصف الريح بأنها نمامة وتوصف بنقل الأخبار إلى السامعين ولا يتلقى منها هذه الأمور التي تتم بها وتخبر عنها إلا قوة السمع والشم إلى السامعين والشامين وحركات الأجرام تحرك الهواء فتحدث له اسم الريح والهواء يحرك الأجرام وفيه تتحرك الأجرام وأما الخرق فما هو إلا تفريغ أحياز عن أشياء واشتغالها بأشياء غير تلك الأشياء لأنه ما فيما عمره العالم خلاء وإنما هي استحالات صور فصور تحدث الأمور وصور تذهب الأمور والجوهر الذي ملأ الخلأ ثابت العين لا يستحيل إلى شي‏ء ولا يستحيل إليه شي‏ء وليس للأسماء الإلهية متعلق إلا إحداث هذه الصور واختلافها وأما ذهابها فلنفسها\n\n\nوأما ذهابها فلما تقتضيه‏\nذات موجدها وهو علم لطيف فإنه كلام حق من حق لكن الأفهام تختلف فيه فإنه يقول للصور إِنْ يَشَأْ يُذْهِبْكُمْ ويَأْتِ بِخَلْقٍ جَدِيدٍ فمعناه إن يشأ يشهدكم في كل زمان فرد الخلق الجديد الذي أخذ الله بأبصاركم عنه فإن الأمر هكذا هو في نفسه والناس منه في لبس إلا أهل الكشف والوجود فإن قلت فقد قلت ببقاء عين الجوهر قلنا ليس بقاؤه لعينه وإنما بقاؤه للصور التي تحدث فيه فلا يزال الافتقار منه إلى الله دائما فالجوهر فقره إلى الله للبقاء والصور فقرها إلى الله لوجودها فالكل في عين الفقر إلى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ بالغنى أي المثنى عليه بصفة الغني عن العالم وفي هذا المنزل من العلوم علم إضافة الأعمال إلى الخلق وهو مذهب بعض أهل النظر والخلاف في ذلك قد تقدم في هذا الكتاب وحكاية المذاهب فيه وأقوالهم وفيه علم تعليم الحق عباده كيف يعاملونه بما يعاملونه به إذ لا تخلو نفس عن معاملة تقوم بها وفيه علم التنبيه على حقيقة الإنسان وفيه علم اختلاف العالم لما ذا يرجع بالصورة وبالحكم وفيه علم العناية ببعض المخلوقين وهي العناية الخاصة وأما العناية العامة فهي الإيجاد له وفقر العالم كله إليه تعالى وفيه علم تأثير الأعمال الخيرية في الأعمال غير الخيرية وأعمال الشر في أعمال الخير وأن القوي من الأعمال يذهب بالأضعف وأن العدم في الممكن أقوى من الوجود لأن الممكن أقرب نسبة إلى العدم منه إلى الوجود ولذلك سبق بالترجيح على الوجود في الممكن فالعدم حضرته لأنه الأسبق والوجود عارض له ولهذا يكون الحق خلاقا على الدوام لأن العدم\n\n\nيحكم على صور الممكنات بالذهاب والرجوع إليه رجوع ذاتي فحكم العدم يتوجه على ما وجد من الصور وحكم الإيجاد من واجب الوجود يعطي الوجود دائما عين صورة بعد عين صورة فالممكنات بين إعدام للعدم وبين إيجاد لواجب الوجود وأما تعلق ذلك بالمشيئة الإلهية فإنه سر من أسرار الله نبه الله عليه في قوله إِنْ يَشَأْ يُذْهِبْكُمْ من باب الإشارة إلى غوامض الأسرار لأولي الأفهام إنه عين كل منعوت بكل حكم من وجود أو عدم ووجوب وإمكان ومحال فما ثم عين توصف بحكم إلا وهو ذلك العين وهذه مسألة تضمنها هذا المنزل ولو لا ذلك ما ذكرناها فإنه ما تقدم لها ذكر في هذا الكتاب ولن تراها في غيره إلا في الكتب المنزلة من عند الله كالقرآن وغيره ومنها أخذناها بما رزقنا الله من الفهم في كلامه وفيه علم ما يمحو عبادة الصلاة من الأعمال التي نهى الشرع أن يعمل بها المكلف وفيه علم تأثير المجاورة ولذلك أوصى الله تعالى بالجار وقد أجرى الله على ألسنة العامة في أمثالهم أن يقولوا الرفيق قبل الطريق وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم اللهم أنت الصاحب في السفر فهو رفيقه والخليفة في الأهل‏\n\n\nفهو وكيله ومن كمال امرأة فرعون قولها رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً في الْجَنَّةِ فقدمته على البيت وهو الذي جرى به المثل في قولهم الجار قبل الدار وقال الله في تأثير الجوار لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا إِذاً لَأَذَقْناكَ وقال ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ ومن جاور مواضع التهم لا يلومن من نسبه إليها وفيه علم الأمر الإلهي إذا لم ينفذ ما المانع لنفوذه وما هو الأمر الإلهي وهل له صيغة أم لا وفيه علم مجازاة كل عامل دنيا وآخرة جازاه بذلك من جازاه من حق وخلق والكل جزاء الله فما في الكون الأجزاء بالخير والشر وفيه علم الفرق بين الفرق وبذلك سموا فرقا وحكم الله الجامع والفارق وما يجتمع فيه العالم وما يفترق وفيه علم السعادة والشقاوة وما ينقطع من ذلك وما لا ينقطع وفيه علم الدار الآخرة ما هي ولما ذا اختصت باسم الحيوان والدنيا مثلها في هذه الصفة يدل على ذلك وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وفيه علم يعلم به إن الله لو لا ما جعل المؤاخذة على الجرائم دلالة ما آخذ الله بها أحدا من خلقه جملة واحدة وفيه علم امتياز الإمام والمأموم واختلاف مراتب الأئمة في الإمامة وكيف يكون السعيد إماما للأشقياء وحكمه بالإمامة في الدنيا وحكمه بذلك في الآخرة فأما في الآخرة فيعم الاتباع ولكن من الاتباع هناك ما لا يزول إلى مقر الحسنى ومنه ما يأتيه امتناع إمامه في الدنيا فيصرف عن اتباعه في الأخرى لأن الإمام يسعد وليس ذلك المتبع المصروف من أهل السعادة فلا بد أن يحال بينه وبين إمامه وفيه علم النصائح وممن تقبل وما حظ العقل من النصائح وما حظ الشرع منها وفيه علم عموم ود الله ومحبته في صنعته ومصنوعاته ولذلك عمهم بالرحمة والغفران لمن يعقل عن الله فإنه المؤمن ومن شأن المؤمن أنه لا تخلص له معصية أصلا لا يشوبها طاعة كذلك‏\nالحق من كونه مؤمنا لا يمكن أن يخلص مع هذا الاسم شقاوة ما فيها رحمة هذا مما لا يتصور فإن الرحمة بالعالم أصل ذاتي بالوجود والشقاء أمر عارض لأن سببه عارض وهو مخالفة التكليف والتكليف عارض ولا بد من رفعه فترتفع العوارض لرفعه ولو بعد حين وفيه علم تغيير الحكم المشروع بتغيير الأحوال في المكلف وفيه علم الموازين المعنوية التي توزن بها المعاني والمحسوسات وموازين الآخرة هل هي إقامة العدل بالحكم في العالم بحيث أن يعلم العالم كله أنه ما طرأ عليه جور في الحكم عليه بما حكم الله به عليه أو هل هي محسوسة كالموازين المحسوسة في الدنيا لوزن الأشياء وإذا كانت حاسة البصر تدرك الموازين في الآخرة المحسوسة عندها هل هي محسوسة كما يدركها الحس أو ممثلة كتمثل الأعمال فإن الأعمال أعراض وهي في الآخرة أشخاص فتعلم أنها ممثلة لأن الحقائق لا تنقلب وحقيقة من لا يقوم بنفسه مغايرة حقيقة من يقوم بنفسه فلا بد أن تكون ممثلة كما\n\n\nورد في الخبر النبوي أن الموت يؤتى به في صورة كبش أملح‏\n\n\nولم يقل يؤتى به كبشا أملح والموت عرض بل نسبة فلا بد أن تكون العبارة عنه كما وردت في الخبر النبوي وفيه علم ما هي الأولية في اليوم فإنه دائرة ولا بد للدائرة من ابتداء وانتهاء إلى ذلك الابتداء فإن اليوم دورة واحدة للفلك الأطلس وقد انفصل بالليل والنهار بطلوع الشمس وغروبها وأول اليوم الذي تعين بالأرض عند حركة الفلك كان بالحمل ثم ظهر أول اليوم بطلوع الشمس إلى غروبها ولم يكن لها وجود إلا في برج الحمل فإنه بيت شرفها فوجدت طالعة في برج الحمل فظهر أول اليوم والصبح آخر اليوم وما بينهما ليل ونهار وهما معلومان بالطلوع والغروب ولذلك ما أخذ الله من أخذه من الأمم إلا في آخر اليوم وذلك لاستيفاء الحركة كما يتربص بالعنين انقضاء فصول السنة وحينئذ يفرق بينه وبين المرأة أعني زوجته لأن أسباب التأثير الإلهي المعتاد في الطبيعة قد مرت على العنين وما أثرت فيه فدل إن العنة فيه لا تزول فعدمت فائدة النكاح من لذة وتناسل ففرق بينهما إذ كان النكاح للالتذاذ والتناسل معا أو في حق طائفة أخرى لكذا وفي أخرى لكذا وفي حق أخرى للمجموع وكذلك إذا انتهت دورة اليوم وقع الأخذ الإلهي في آخره وفيه علم تجسد الأرواح في صور الأجسام الطبيعية هل عين ذلك الروح هو عين الصورة التي ظهر فيها أو هل ذلك في عين الرائي كما ذكرناه في زرقه السماء أو هل الروح لتلك الصورة كالروح للجسم أعني النفس الناطقة وتلك الصورة صورة حقيقة لها وجود عيني لا في عين الناظر كسائر الصور الحقيقية وهذه مسألة أغفلها كثير من الناس بل الناس كلهم فإنهم قنعوا بما ظهر لهم من صور الأرواح المجسدة فلو تر وحنوا في نفوسهم وحكموا بالصور على أجسامهم وتبدلت أشكالهم وصورهم في عين من يراهم علموا عند ذلك تجسد الأرواح لما ذا يرجع فإنه علم ذوق لا علم نظر فكري وقد بينا أن كل صورة تجسدت في العالم فلا بد لها من روح مدبرة من الروح الكل المنفوخ منه في الصور ومن علم إن الصورة المتجسدة في الأرواح إذا قتلت إن كانت حيوانا أو قطعت إن كانت نباتا أنها تنتقل إلى البرزخ ولا بد كما تنتقل نحن بالموت وإنها إن أدركت بعد ذلك فإنما تدرك كما يدرك كل ميت من الحيوان إنسان وغير إنسان فمن هنا أيضا إذا وقفت على علم هذا علمت صور الأرواح المتجسدة لما ذا ترجع وفيه علم ما للضيف الوارد من الحق على من ورد عليه والأنفاس واردات الحق على العبد ولها حق وهي راجعة إلى من وردت منه فلينظر بما ذا يستقبلها إذا وردت وما يلزمه من الأدب معها في الأخذ لما ترد به وما يخلع عليها إذا انقلبت عنه راجعة إلى الحق وفيه علم العادات وخرقها ودفع الشبه التي يراها الطبيعيون أنها تفعل لذاتها وما هي الطبيعة في الحقيقة ولمن ترجع الآثار الظاهرة في الكون وفيه علم شرف الحيوان على الإنسان الحيواني وفيه علم الجبر في الاختيار وفيه علم إدخال الحق نفسه مع الأكوان في السلوك والأحوال هل دخل معهم للحفظ أو دخل معهم لكونه العامل لما هم فيه أو دخل معهم صحبة وعناية بهم أو تقتضي ذاته ذلك الدخول معهم وفيه علم العبيد والأحرار وما الأعمال التي تطلب الأجور وممن تطلب فإن العامل ما يعمل إلا لنفسه فبما ذا يستحق الأجرة من غيره وفيه علم أسباب التجارة التي هي مخصوصة بالحياة وفيه علم خواص الأسماء الإلهية من حيث تركيب حروف ذلك الاسم حتى إذا ترجم بلسان آخر لم يكن له تلك الخاصية فإنه لا فرق بين مزاج حروف الكلمة إذا تركبت ومزاج أجسام المعدن أو النبات أو جسم الحيوان فإن جسم الحيوان هو جسم نباتي أضيف إليه حس فقيل حيوان‏\nوفيه علم سبب إدخال الآلام واللذات على الحيوان الطبيعي وعين ما يتألم به حيوان يلتذ به حيوان آخر وفيه علم تأثير الأضعف في الأقوى وأصل ذلك من تأثير النسب في الموجودات وهي أمور عدمية بل لا مؤثر إلا هي وفيه علم من يعلم أنه لا يخبر إلا عن الله ويؤاخذ بما نسب ويهلك وآخر يخبر عن نفسه وينجو وآخر يخبر عن الله وينجو فالهالك من يخبر عن عقد والناجي من يخبر عن ذوق فأهل الأذواق أهل الله والخاصة من أوليائه وفيه علم الانقياد المنجي والانقياد المهلك وفيه علم أشكال العالم وتشكله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Seventy-Third: Concerning the knowledge of the station of three secrets that appeared in the favored, decreed Water (الماء الحكمي المفضل).\n\nIts level (مرتبته) is superior to the cosmos (العالم) by virtue of Divine Care (العناية) and the subsistence of the cosmos for all eternity (أبد الآبدين), even if its form is transformed. It belongs to the Muhammadan Presence (الحضرة المحمدية).\n\n> Stations that stipulate harmony\n> For noble, informed spirits.\n\n> I speak them aloud, yet my companion does not know,\n> Because the Light is in the very essence of the Darkness.\n\n> Were it not for darkness, there would be no light,\n> For the essence of deficiency is manifested by perfection.\n\n> If one knows the relation (الإضافة) who sees it,\n> He is bound by covenants and by establishment.\n\n> He sees that Existence (الوجود) has an end,\n> And that the beginning is manifested by the conclusion.\n\n> Thus, between a beginning and an ending, there is a state\n> Of Existence (وجود) that remains perpetually with permanence.\n\n### [The Entire Cosmos is an Inscribed Book]\n\nKnow, may Allah support you, that the entire cosmos (العالم) is an inscribed book (كتاب مسطور) upon an unrolled scroll (رَقٍّ مَنْشُورٍ), which is Existence (الوجود). It is manifest and spread out, not folded, so that through its expansion it may be known that it was created for Mercy (الرحمة). Through its manifestation, what it contains and what it signifies can be understood and known. It was made a book to join its letters (حروفه) one to another—which is the ordering of the cosmos according to the aspects we have mentioned—and the joining of its meanings to its letters is derived from the formation of an army (*katībat al-jaysh*). We said that its expansion is for Mercy because it descended from Mercy, as the Exalted said: <<تَنْزِيلٌ من الرَّحْمنِ الرَّحِيمِ كِتابٌ فُصِّلَتْ آياتُهُ قُرْآناً عَرَبِيًّا لِقَوْمٍ يَعْلَمُونَ>> (A revelation from the Most Compassionate, the Most Merciful: a Book whose verses have been detailed, an Arabic Qur’an, for a people who know) [Qur’an 41:2-3]. And the Exalted said concerning this: <<كِتابٌ أُحْكِمَتْ آياتُهُ ثُمَّ فُصِّلَتْ من لَدُنْ حَكِيمٍ خَبِيرٍ>> (A Book whose verses have been made firm, then detailed, from One Who is Wise, All-Aware) [Qur’an 11:1]. The firmness (إحكام) of the verses therein and their detailing (تفصيل) is known only by the one to whom Allah has given Wisdom (الحكمة) and the decisive discourse (فصل الخطاب). The form of the Wisdom that the Wise, All-Aware (الحكيم الخبير) grants to the people of Divine Care (أهل العناية) is the knowledge of the levels (مراتب) of things and what the existent things (الموجودات) and the known things (المعلومات) deserve of the Real (الحق) that belongs to them. This is the Divine bestowal (إعطاء إلهيا) of its creation (خلقه) to everything, so that every creation (خلق) may be given its due right (حقه) through a cosmic bestowal (إعطاء كونيا) by what Allah has granted us. Thus, we know potentially (بالقوة) what every existent thing deserves within the limits, and then we detail it actually (بالفعل) as signs (آيات) for those who understand, just as the All-Aware, Wise One granted it to me. Thus, we place things in their proper stations (منازلها) and give them their due right, and we do not exceed their level (مرتبتها). The detailing of the signs and indications comes from the One Who details (المفصل) when He places them in their proper locations, subject to this condition. For not every detailer is a wise indicator that he has been given Wisdom and the knowledge of the firmness of the verses. His Mercy (رحمته) through the signs and existent things—which constitute the Divine Book, and which is none other than the cosmos (العالم)—is proof of His Knowledge of the One Who revealed it, Who is none other than the Most Compassionate, the Most Merciful (الرحمن الرحيم). The conclusion of the matter is nothing but the essence of its antecedents, and its antecedents are the Most Compassionate, the Most Merciful. From this, you know the levels of the cosmos and its ultimate destination: that it is toward Absolute Mercy (الرحمة المطلقة), even if it suffers hardship on the path and is overtaken by weariness and difficulty. Among people, there are those who attain Mercy and rest immediately upon entering the station they reached—these are the people of Paradise (أهل الجنة). And among them are those with whom the weariness and difficulty of the path and the toil remain, according to their temperament. Perhaps they become sick and ill for a time, then they transition from their ailment and find rest—these are the people of the Fire (أهل النار) who are its true inhabitants, not those who will exit it into Paradise, having been touched by the Fire according to their sins, even though Allah caused them to die therein. For those latter ones, the Fire is not a station (منزلا) for them to inhabit and reside in with their families. Rather, the Fire is for them a watering place (منهل) that the traveler stops at on his way until he reaches his station where his family resides. This is the meaning of Wisdom (الحكمة) and Detailing (التفصيل). For things—I mean the contingent things (الممكنات)—are distinct in their essence (ذاتها) in their state of non-existence. Allah, the Glorified, knows them exactly as they are in themselves, sees them, and commands them to be formed (التكوين), which is Existence (الوجود). So they come into being by His command. There is no generality (إجمال) with Allah, just as there is no generality in the essences of the contingent things (أعيان الممكنات). Rather, the entire matter, in itself and in the Knowledge of Allah, is detailed (مفصل). Generality occurred only with us, concerning us, and it appeared within us. Whoever unveils the detail (التفصيل) within the essence of the generality (الإجمال)—whether through knowledge, vision, or reality—that is the one to whom Allah has granted Wisdom and the decisive discourse. These are none other than the Messengers (الرسل) and the inheritors (الورثة) specifically. As for the wise ones—I mean the philosophers (الفلاسفة)—Wisdom is merely borrowed by them, for they do not know the detail within the generality. The image of this, as seen by the possessor of this station to whom Allah has granted Wisdom, is that the Wisdom he possesses is Divine Care (عناية إلهية). With the Real (الحق), this Care is the determination (تعيين) of the partial spirits (الأرواح الجزئية) breathed into the balanced and proportioned bodies (الأجسام المسواة المعدلة) from the elemental nature (الطبيعة العنصرية), originating from the Universal Spirit (الروح الكل) attributed to Him. Therefore, He mentioned that He created them before the bodies—meaning He decreed and determined them. The whole is a body, and the form of its governing spirit is potentially existent (الموجود بالقوة) in this Universal Spirit attributed to Him. This manifests in detail actually (بالفعل) upon the breathing (النفخ), and that is the Breath of the Merciful (النفس الرحماني) for the person of Unveiling (صاحب الكشف). He sees in the ink (المداد) in the inkwell all the letters and words it contains, and all the forms that the writer or painter will depict. All of this is a book. He says: 'In this ink, there are such and such forms.' Then, when the writer and painter, or the painter without the writer, or the writer without the painter, comes—according to what the person of Unveiling mentions—he writes and draws with that ink everything that this unveiled person mentioned, neither adding nor subtracting. This is not grasped by the one called 'wise' in the common usage of the rationalists (العقلاء). This is the portion of the people of Unveiling (أهل الكشف). They are the ones to whom Allah has granted Wisdom and the decisive discourse. Our Messenger, peace and blessings be upon him, commanded us to give every possessor of a right his due right, and we cannot do that until we know what every possessor of a right deserves of the Real (الحق). This is only possible through the Real making that clear to us. Therefore, He attributed it to Himself, saying: <<وآتَيْناهُ الْحِكْمَةَ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً>> (And We gave him Wisdom. And whoever is given Wisdom has certainly been given much good) [Qur’an 2:269]. Only those who are given it know it; thus, it is a gift (هبة) from Allah the Exalted, just as He gifted us the existence of our essences (وجود أعياننا) when we were nothing existent. The Divine Knowledge (العلم الإلهي) is what Allah the Glorified taught him through inspiration (الإلهام), casting (الإلقاء), and the descent of the Trustworthy Spirit (الروح الأمين) upon his heart. This Book, in our view, is of that pattern. By Allah, I have not written a single letter of it except through Divine dictation (إملاء إلهي), Lordly casting (إلقاء رباني), or a spiritual insufflation (نفث روحاني) into the core of my being (روع كياني). This is the totality of the matter, even though we are neither legislating Messengers (رسل مشرعين) nor Prophets charged with obligation (أنبياء مكلفين). For the message of legislation (رسالة التشريع) and the prophecy of obligation (نبوة التكليف) ceased with the Messenger of Allah, Muhammad, peace and blessings be upon him. There is no Messenger after him, nor a Prophet who legislates or imposes obligations. Rather, it is Knowledge (علم), Wisdom (حكمة), and understanding from Allah concerning what He legislated through the tongues of His Messengers and Prophets, peace be upon them, and what He inscribed and wrote in the Tablet of Existence (لوح الوجود) concerning the letters of the cosmos and the words of the Real (كلمات الحق). Thus, Revelation (التنزيل) does not cease; rather, it is continuous in this world and the Hereafter.\n\n> Allah created my body from Tayy and Khawlan,\n> So He proportioned me in creation and perfected me.\n\n> And the Real (الحق) created for me a purified spirit,\n> So the structure of others is not like my structure.\n\n> Indeed, I know a spirit that used to descend upon me,\n> From above seven heavens, with discrimination (فرقان).\n\nWe mean His saying, the Exalted: <<إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً>> (If you fear Allah, He will grant you a criterion [Furqan]) [Qur’an 8:29]. I do not claim any prophecy (نبأ) from the Divine in that, but rather it is the bounty of benevolence.\n\n> Indeed, Prophecy (النبوة) is a house locked between us,\n> And it is secured by the lock of faith.\n\nWe only said that so that no one might imagine that I or those like me claim prophecy. No, by Allah! Nothing remains but inheritance (ميراث) and following the path (سلوك) of Muhammad, the Messenger of Allah, peace and blessings be upon him, specifically, even though there is a general aspect for all people. For us and those like us, there is a specific portion of prophecy that Allah has preserved for us, such as the glad tidings (المبشرات) and noble character (مكارم الأخلاق), and such as the memorization of the Qur’an when a person commits it to memory. This and similar things are parts of the inherited prophecy. Therefore, the first human Allah created, Adam, was a Prophet. Whoever follows his path thereafter is an inheritor (وارث)—this is necessary in this earthly existence. However, in terms of station (المقام), Adam and those below him are only inheritors of Muhammad, peace and blessings be upon him, because he was a Prophet while Adam was between water and clay, not yet existent. Thus, Prophecy (النبوة) belongs to Muhammad, peace and blessings be upon him, not to Adam. The natural human Adamic form (الصورة الآدمية الطبيعية الإنسانية) belongs to Adam, and no form belongs to Muhammad, peace and blessings be upon him, and upon Adam and all the Prophets. Adam is the father of human bodies, and Muhammad, peace and blessings be upon him, is the father of the inheritors (أبو الورثة) from Adam until the conclusion of the matter among the inheritors. Every Law (شرع) that appeared and every Knowledge (علم) is a Muhammadan inheritance (ميراث محمدي) in every time, for every Messenger and Prophet, from Adam until the Day of Resurrection. For this reason, he was given the comprehensive words (جوامع الكلم). Among these is Allah teaching Adam all the Names (الأسماء). Thus, the ruling of the whole appeared in the Adamic form (الصورة الآدمية) and the Muhammadan form (الصورة المحمدية). In Adam, they are Names, and in Muhammad, peace and blessings be upon him, they are Words (كلم). The Words of Allah, the Glorified, are inexhaustible, and His existent things (موجوداته), in terms of their essence (جوهرها), do not perish, even if their forms vanish and their rulings change. The essence (العين) does not vanish or change; rather, the transformation occurred in the cosmos due to the reality of the Real (الحق) being transformation in forms. If transformation did not appear in the cosmos, the cosmos would not be complete. Thus, no Divine Reality (حقيقة إلهية) remains without the cosmos having a reliance upon it. Furthermore, the verification of the matter, according to the people of Unveiling (أهل الكشف), is that the very transformation of the cosmos is the very Divine transformation (التحول الإلهي) in forms. The very fact that He manifests in whatever He wills is the very fact that He fashioned you in whatever form He willed: <<ف ما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله>> (But you do not will except that Allah wills) [Qur’an 76:30]. That, in reality, is the Will of Allah, not your will, and you will by means of it. Life belongs to the essence of the substance (عين الجوهر), and death belongs to the transformation of forms. All of this is <<لِيَبْلُوَكُمْ>> (that He may test you) through obligation (بالتكليف) <<أَيُّكُمْ أَحْسَنُ عَمَلًا>> (which of you is best in deed) [Qur’an 67:2]. He only tests you so that the attribution of the Name 'All-Aware' (الخبير) may be sound—it is Knowledge based on experience (خبرة). He knows, but there is no experience, except to establish proof against those in whom contention and denial were created. All of this is part of the detailing of the signs in the discourse and in the essences (الأعيان). <<هُوَ الْحَكِيمُ الْخَبِيرُ>> (He is the Wise, the All-Aware) [Qur’an 6:18] and <<هُوَ الْعَزِيزُ الْغَفُورُ>> (He is the Almighty, the Forgiving) [Qur’an 35:2]. If what was unveiled to some of the cosmos were unveiled to everyone, He would not be Forgiving, nor would anyone have superiority over another, since superiority exists only through increased knowledge of what was. Thus, the entire cosmos is superior and inferior (فاضل مفضول). The highest of the scholars shares with the lowest of them the knowledge of craftsmanship (علم الصنعة). The cosmos is the craftsmanship of Allah. The knowledge of the craft of weaving is the knowledge of the weaver, and that is his craft. Generally, this is the lowest of sciences, but specifically, the knowledge of craftsmanship is the highest of sciences, because through craftsmanship the Real (الحق) appeared in Existence (الوجود). Thus, it is the greatest proof, the clearest path, and the most upright saying. From this perspective, the greatest of Allah’s elect (خواص الله الأكابر) appear in the judgment (الحكم) in the form of the common people, so their station is unknown. No one knows them except themselves. They have no distinction in the cosmos, unlike the people of spiritual states (أصحاب الأحوال), who are generally distinguished and pointed to by fingers due to the breaking of customs (خرق العوائد) that appears through their state. The people of Allah (أهل الله) avoid that, because others who are not of their kind share in it. The people of Allah are known by their station (المقام) but unknown by their witnessing (الشهود). They are not known, just as Allah, Who is known to His people by innate disposition (الفطرة) by everyone, is unknown to them by intellect and witnessing. If He were to manifest (تجلى) to him, he would not recognize Him. Rather, He is continuously manifesting, but He is known only by His people and His elect (خاصته), who are the people of the Qur’an, the people of Remembrance (أهل الذكر), whom Allah commanded us to ask, because they only speak about Him. The Exalted said: <<فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ>> (So ask the people of Remembrance if you do not know) [Qur’an 16:43]. This is because the people of Remembrance are the companions of the Real (جلساء الحق). The one who remembers, who witnesses Allah in his remembrance, only speaks about his Companion. Thus, he reports the matter exactly as it is, and that is Knowledge (العلم). For he is <<عَلى‏ بَيِّنَةٍ من رَبِّهِ>> (upon clear evidence from his Lord) [Qur’an 11:17], and <<يَتْلُوهُ شاهِدٌ مِنْهُ>> (followed by a witness from Him) [Qur’an 11:17], which is His manifestation in his form—meaning, what he brought of knowledge from Allah is the attribute (صفته) by which this remembering person manifested. According to the measure of his remembrance, the Real is continuously sitting with him. For this reason,\n\nAisha, may Allah be pleased with her, said concerning the Messenger of Allah, peace and blessings be upon him, that he used to remember Allah at all times.\n\nThus, she affirmed for him continuous companionship (المجالسة) with Allah the Exalted. Either she knew this through Unveiling (كشفا), or the Messenger of Allah, peace and blessings be upon him, informed her of it, and that was during his companionship with Him—that He recounted to him the news of the Messengers, by which He made his heart firm, due to the contention he saw from his community regarding what he brought from Allah. If he were not of this rank and similar ranks, there would be no distinction (فرقان) between him and other humans. For the Exalted is with them wherever they are, <<أَيْنَ ما كانُوا>> (wherever they may be) [Qur’an 57:4]. Therefore, He must be with those who remember Him with a special companionship (معية اختصاص). There is nothing there except increased knowledge of Him, by which superiority (الفضل) appears. Every person who remembers (ذاكر) who does not increase in knowledge of the One remembered during his remembrance is not truly a rememberer, even if he remembers with his tongue. For the true rememberer is the one whom the entire remembrance encompasses. That is the companion of the Real (جليس الحق). Benefit must necessarily be attained, because the Generous Knower (العالم الكريم), in whom stinginess is inconceivable, must bestow upon His companion something he did not possess, since there is no stinginess there to contradict generosity. Thus, only the receptive vessel (المحل القابل) remains, and only one with a receptive vessel keeps company. That is the companion of the Real. The cosmos is their companion—the Real—without them realizing it. The utmost achievement of the common people, if they are believers, is to know that Allah is with them. The benefit, however, is for *you* to be with Allah, not merely that He is with you. This is the matter in itself. Whoever is with the Real must witness the Real (يشهد الحق), and whoever witnesses Him possesses nothing but the existence of Knowledge (العلم). These are the Divine gifts (المنح الإلهية).\n\n> Knowledge is the noblest of gifts He bestows,\n> And Unveiling (الكشف) is the greatest and clearest methodology.\n\n> If you ask the God of Truth for a request,\n> Ask Him for Unveiling, for Allah grants it.\n\n> And persist in knocking if the door is locked;\n> The claim of the self (الكيان) locks it, and the Existence of Allah opens it.\n\nEvery knowledge whose attainment is not through Unveiling (كشف) after the door has been opened—which Divine Generosity (الجود الإلهي) grants, reveals, and clarifies—is mere perception (شعور), not Knowledge (علم). This is because it was attained from behind the door while the door was locked. The door is none other than you. You, by virtue of your meaning and your dwelling place, are the locking of the door. You perceive that behind this apparent body and form there is another meaning that you do not know, even if you perceive it. The apparent form is one leaf of the door, and the soul (النفس) is the other leaf. When the door is opened, the two leaves are distinguished from each other, and what is behind the door becomes manifest to you. That is Knowledge. You only see it through detailing (التفصيل) because you separated what was between the two leaves until this distinction occurred within you. If the door represents the Real and the creation (حق وخلق)—which is you and your Lord—and the matter is confused for you, so your essence (عينك) is not distinguished from your Lord, you will not distinguish Him unless the door is opened. The very opening grants you the Gnosis (المعرفة) of the door and the difference between the two leaves. Thus, you know your self and you know your Lord. This is the meaning of his saying, peace and blessings be upon him: \"Whoever knows his self knows his Lord.\" Perception (الشعور) occurs when the door is locked, and Knowledge (العلم) occurs when the door is opened. If you see the scholar accused regarding what he claims to know, he is not a scholar; that is perception. If the accusation is lifted concerning what he knows, that is Knowledge, and he knows that the door has been opened for him and that Generosity has revealed to him what is behind the door. Many people imagine that perception is Knowledge, but it is not so. The portion of perception from Knowledge is only that you know, generally, that there is something behind the door, but you do not know what it is. For this reason, the Exalted said: <<وما عَلَّمْناهُ الشِّعْرَ>> (And We did not teach him poetry) [Qur’an 36:69], in response to their saying that he was a poet. Then He said: <<وما يَنْبَغِي لَهُ إِنْ هُوَ>> (Nor would it be appropriate for him. It is not)—meaning, this thing with which We sent him—<<إِلَّا ذِكْرٌ>> (except a Remembrance), meaning he took it from companionship with the Real, <<وقُرْآنٌ مُبِينٌ>> (and a clear Qur’an), meaning manifest and detailed within the essence of collection (عين الجمع). He did not take it from perception, for everything that the person of perception determines regarding the perceived object is mere conjecture (حدس), even if it corresponds to the reality. He is not upon insight (بصيرة) concerning it. It is not appropriate for a rational person to call others to a matter until he is upon insight regarding that matter—which means knowing it through vision and Unveiling (كشفا), such that he has no doubt about it. This station is not exclusive to the Messengers of Allah; rather, it belongs to them and to their inheriting followers (أتباعهم الورثة). No one is an inheritor unless his following is complete in word, deed, and especially the inner state (الحال الباطن). The inheritor must conceal the apparent state (الحال الظاهر), for its manifestation is dependent upon the obligatory Divine command. In this world, it is a branch, and the root is concealment (البطون). For this reason, Allah veiled Himself generally from His servants in this world, while in the Hereafter He will manifest generally to His servants. If He manifests to someone specifically, like His manifestation to the mountain, similarly, the state (الحال) that appeared upon the Messengers was for the purpose of indicating their truthfulness so that they could legislate for people. The inheritor is a caller to what that Messenger established, and he is not a legislator, so he does not need the manifestation of the state as the legislator needed it. The inheritor preserves the continuity of the call within the community. That is his only portion. Even if the inheritor were to bring a law—and he does not—but if we hypothetically assumed it, the community would not accept it from him. Thus, there is no benefit in the manifestation of the state if there is no acceptance, as there was for the Messenger. Know this. The states that Allah manifests through them are up to Allah, not due to any effort or intention on the part of the servant. This is called a miracle (*karāma*) in the community. What the friend of Allah (ولي الله) strives for and seeks is the opening of that door, so that he may be upon insight (بصيرة) concerning his states with Allah, for himself, not that he should manifest that to His creation. He is <<عَلى‏ نُورٍ من رَبِّهِ>> (upon a light from his Lord) [Qur’an 39:22] and firm in his station; nothing shakes him but Him. The miracle of this type is his knowledge of Allah and what relates to Him concerning the detailing in His Beautiful Names (أسمائه الحسنى) and His Sublime Words (كلماته العليا). Thus, he knows what enters the earth of his nature (أرض طبيعته) from the seed that Allah sowed therein when He proportioned and balanced it, and what emerges from it in terms of expressions (العبارات) about what is within it, and practical, crafted actions (الأفعال العملية الصناعية) according to their levels. This is because what emerges from the earth is of different types, and that is the adornment of the earth. What emerges from the earth of the human nature and his body is an adornment for him, such as eloquence in expression and well-crafted industrial actions. Likewise, he knows what descends from the heaven of his intellect (سماء عقله) concerning what he contemplates of His Law (شرعه) in the Gnosis of his Lord. That is the Divine Revelation (التنزيل الإلهي) upon his heart. And what ascends therein of his good words (كلمه الطيب) upon the Buraq of righteous deeds (العمل الصالح) that raises him to Allah, as the Exalted said: <<إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ>> (To Him ascends the good word) [Qur’an 35:10]—which is what emerged from the earth—<<والْعَمَلُ الصَّالِحُ يَرْفَعُهُ>> (and the righteous deed raises it) [Qur’an 35:10]—which is also what the earth brought forth. Thus, what descends from the heaven is what enters the earth, and what emerges from the earth—which is what appeared from what entered it—is what ascends into the heaven. The very descending thing is the very entering thing, and the very emerging thing is the very ascending thing. The matter is male and female, marriage and birth. There are existent essences (أعيان موجودة), witnessed rulings (أحكام مشهودة), limited terms (آجال محدودة), and intended acts (أفعال مقصودة), some of which are blameworthy accidentally (بالعرض) but praiseworthy essentially (بالذات).\n\n### [Detailing Only Appears in Existence Through Action]\n\nThen know that detailing (التفصيل) does not appear in Existence (الوجود) except through action (العمل). If the actor details it according to its detailing in the generality of Wisdom (الحكمة), then it is a righteous deed (العمل الصالح). If he details it otherwise, based on human detailing, then that is an unrighteous deed (العمل غير الصالح). Unrighteous deeds occur most often among those who detail matters based on rational consideration (النظر العقلي), not based on Divine information (الإعلام الإلهي). What is detailed by Divine information is entirely a righteous deed. What is detailed by rational consideration includes both righteous and unrighteous deeds, relative only to its detailing. However, all of it is a righteous deed relative to Allah the Exalted, just as it is said that deficiency (النقص) in Existence is part of the perfection of Existence (كمال الوجود), or if you wish, part of the perfection of the cosmos. For if deficiency were lacking from the cosmos, the cosmos would be deficient. Understand this.\n\n### [Corruption is the Alteration of the Divine Decree]\n\nKnow that we would not speak of unrighteous deeds or corruption (الفساد), out of reverence for Divine Knowledge (العلم الإلهي) and reality. However, since we saw that in the Divine disposition Allah warned against corruption, saying: <<ولا تَبْغِ الْفَسادَ في الْأَرْضِ إِنَّ الله لا يُحِبُّ الْمُفْسِدِينَ>> (And do not seek corruption in the earth. Indeed, Allah does not like corrupters) [Qur’an 28:77], and He said: <<تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ ولا فَساداً>> (That is the Home of the Hereafter, We assign it to those who do not desire exaltation [عُلُوًّا] in the land nor corruption [فَساداً]) [Qur’an 28:83], and we saw the mention of corruption in the common usage among rational people—indeed, all people—we proceeded to mention it. Instead of corruption, we would only say: 'the manifestation of one form and the removal of another,' as is the matter in itself, due to a specific composition and a natural temperament system. As for His saying, <<إِنَّ الله لا يُحِبُّ الْمُفْسِدِينَ>> (Indeed, Allah does not like corrupters), what is meant is the alteration of the Divine decree (تغيير الحكم الإلهي), not the alteration of the essence (العين) or the replacement of the form. As for His saying, <<عُلُوًّا في الْأَرْضِ>> (exaltation in the land), this is a verified matter, because the earth does not accept exaltation as long as it is earth for the one to whom it is earth. Everything we see high and towering upon it is a mountain (جبل) and a peg (وتد) by which Allah stabilized it so that its shaking would cease. Mountains are not earth. Allah created the earth like a sphere of earthy and stony parts, which Allah joined together. When Allah created the heaven, He spread the earth thereafter so that it might be a place of settlement for those for whom it was created. For this reason, it shook. If it had remained a sphere, it would not have shaken. He then created the mountains, placing them upon it all at once, and He encircled the surrounding water with a mountain, making it like a belt for the earth. It is said that upon this mountain are the edges of the dome of the heaven, and the blueness (الزرقة) that is attributed to the heaven and described by it is the color of the body of the heaven due to its distance from you in visual perception, just as you see mountains when they are far from you as blue, even though blueness is not their color, except due to their distance from the eye's view, just as you see a distant mountain as black. When you approach it, it may not be as you perceived it. We have explained to you that colors are of two types: a color that subsists in the colored body, and a color that occurs to the sight when looking at the body due to an incidental matter that stands between the viewer and the viewed. This is like the blueness of the sky, and like the colors that occur in a body that has a true color, due to transient states, so the viewer sees them as other than their subsisting color which he knows. This is like ambiguities (الشبهات) in proofs: they are colors that are not colors. Their portion of the Divine Realities is <<وما رَمَيْتَ إِذْ رَمَيْتَ>> (And you did not throw when you threw) [Qur’an 8:17], and you are not you. It is like the entire cosmos, which is in reality creation that is not creation, or Real that is not Real. And like Imagination (الخيال), which is sensation that is not sensation, and sensible that is not sensible—I mean the imagined thing. The earth is acted upon by the water, which is acted upon by the air. Air (الهواء) is the origin according to us. Therefore, it is the closest in relation to the Cloud (العماء), which is the Breath of the Merciful (نفس الرحمن). It combines heat and moisture. From its heat appeared the pillar of Fire, and from its moisture appeared the pillar of Water. From the freezing of the water came the Earth. Thus, Air is the son of the Breath (النفس), which is the Cloud. Fire and Water are the two children of Air, and Earth is the grandchild, which is what froze from the water. What did not freeze remained water according to its origin. The Earth rests upon that water. We have seen in the Euphrates River, when it freezes in the winter months in the northern lands, it becomes earth upon which caravans, people, and animals walk, while the water flows beneath that ice. That water rests upon the air, which supplies it with its moisture, preserving its essence and its stability upon it. For air causes water to flow when it moves, and when it is contained and still, the water rests upon it and does not penetrate it. We have seen this in a bamboo tube or similar object with a hole: if you fill it with water and seal the upper hole of the tube, no water flows from the bottom of the tube. If you remove the seal, the water flows. That water relied only on the still air due to its stillness, and this is a form that encompasses the entire cosmos. When the air undulates, it is called wind (ريح). The wind carries the scents of what it passes over, whether pleasant or foul, to the nostrils. Likewise, it carries the coldness and heat of things. Therefore, the wind is described as a talebearer (نمامة) and is described as conveying news to the listeners. Only the faculty of hearing and smell receives these matters that are completed by it and reported by it, reaching the listeners and smellers. The movements of the celestial bodies move the air, giving it the name 'wind.' The air moves the bodies, and the bodies move within it. As for tearing (الخرق), it is nothing but the emptying of spaces (أحياز) of certain things and their occupation by other things, because there is no vacuum (خلاء) in what the cosmos inhabits. Rather, they are transformations of forms. Forms bring things into existence, and forms cause things to vanish. The substance (الجوهر) that fills the void is fixed in essence (ثابت العين); it does not transform into anything, nor does anything transform into it. The Divine Names (الأسماء الإلهية) relate only to the creation of these forms and their variation. As for their vanishing, it is due to themselves.\n\nAs for their vanishing, it is due to what the Essence of their Creator (ذات موجدها) necessitates, and that is a subtle knowledge, for it is the speech of the Real (كلام حق) from the Real, but understandings differ concerning it. For He says to the forms: <<إِنْ يَشَأْ يُذْهِبْكُمْ ويَأْتِ بِخَلْقٍ جَدِيدٍ>> (If He wills, He can do away with you and bring forth a new creation) [Qur’an 14:19]. Its meaning is: If He wills, He makes you witness at every moment the singular new creation (الخلق الجديد) from which Allah has veiled your sight. For the matter is thus in itself, and people are in confusion about it, except the people of Unveiling and Existence (أهل الكشف والوجود). If you say, \"You have affirmed the subsistence of the essence of the substance (عين الجوهر),\" we say: Its subsistence is not for its own sake, but rather for the forms that occur within it. Thus, the need (الافتقار) for Allah remains constant. The substance's need for Allah is for subsistence (للبقاء), and the forms' need for Allah is for their existence (لوجودها). All are in the essence of need for Allah, and Allah <<هُوَ الْغَنِيُّ الْحَمِيدُ>> (He is the Rich, the Praiseworthy) [Qur’an 35:15]—Rich, meaning praised with the attribute of being independent of the cosmos. In this station are sciences, including the science of attributing actions to creation (الخلق), which is the doctrine of some people of rational consideration. The disagreement regarding this has been discussed previously in this book, along with the recounting of the doctrines and their sayings. It includes the science of the Real teaching His servants how to deal with Him through the way they deal with Him, since no soul is devoid of a transaction (معاملة) by which it subsists. It includes the science of drawing attention to the reality of the human being. It includes the science of the variation of the cosmos, to what does it return in form and in ruling. It includes the science of the Care (العناية) for some created beings, which is the specific Care (العناية الخاصة). As for the general Care (العناية العامة), it is the bringing of existence (الإيجاد) and the need of the entire cosmos for Him, the Exalted. It includes the science of the effect of good deeds on unrighteous deeds, and the effect of evil deeds on good deeds, and that the stronger of the deeds removes the weaker. It includes the science that non-existence (العدم) in the contingent (الممكن) is stronger than existence (الوجود), because the contingent is closer in relation to non-existence than to existence. Therefore, non-existence preceded existence in the contingent by preference. Non-existence is its Presence (حضرة) because it is the prior, and existence is incidental to it. For this reason, the Real is continuously a Creator (خلاق), because non-existence decrees the vanishing of the forms of the contingent things and their return to it—a return of essence. Thus, the decree of non-existence is directed toward the forms that came into existence, and the decree of bringing into existence (الإيجاد) from the Necessary Existent (واجب الوجود) continuously grants existence to one essence of form after another. The contingent things are between annihilation (إعدام) by non-existence and creation (إيجاد) by the Necessary Existent. As for the relation of this to the Divine Will (المشيئة الإلهية), it is a secret among the secrets of Allah, to which Allah drew attention in His saying: <<إِنْ يَشَأْ يُذْهِبْكُمْ>> (If He wills, He can do away with you) [Qur’an 14:19], as an allusion to the profound secrets for those with understanding: that the essence of every described thing is the essence of every ruling, whether existence, non-existence, necessity, contingency, or impossibility. There is no essence (عين) described by a ruling except that it is that essence. This is an issue contained within this station; otherwise, we would not have mentioned it, for it has not been mentioned previously in this book, and you will not see it elsewhere except in the Books revealed from Allah, such as the Qur’an and others. We took it from them through the understanding that Allah granted us in His speech. It includes the science of what the worship of prayer (الصلاة) erases of the deeds that the Law forbade the obligated person from performing. It includes the science of the effect of proximity (المجاورة). For this reason, Allah the Exalted commanded concerning the neighbor (الجار). Allah has caused the common people to say in their proverbs: \"The companion before the road.\" And the Messenger of Allah, peace and blessings be upon him, said: \"O Allah, You are the Companion in travel and the Successor (الخليفة) over the family.\"\n\nThus, He is his companion and his agent. Part of the perfection of Pharaoh's wife was her saying: <<رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً في الْجَنَّةِ>> (My Lord, build for me near You a house in Paradise) [Qur’an 66:11]. She prioritized the proximity (عِنْدَكَ) over the house, which is the meaning of the proverb: \"The neighbor before the house.\" Allah spoke of the effect of proximity in His saying: <<لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا إِذاً لَأَذَقْناكَ>> (You were almost inclined toward them a little. If you had, We would have made you taste double) [Qur’an 17:74-75]. And He said: <<ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ>> (And do not incline toward those who do wrong, lest the Fire touch you) [Qur’an 11:113]. Whoever neighbors places of suspicion should not blame those who attribute suspicion to him. It includes the science of the Divine command: if it is not executed, what prevents its execution, what the Divine command is, and whether it has a specific form or not. It includes the science of the recompense of every actor in this world and the Hereafter, and who recompenses him—whether the Real or the creation—and all is the recompense of Allah. There is nothing in the cosmos but recompense for good and evil. It includes the science of the difference between differences (الفرق بين الفرق), by which they were named 'sects' (فرقا), and the comprehensive and distinguishing decree of Allah, and what the cosmos unites upon and what it separates upon. It includes the science of felicity (السعادة) and wretchedness (الشقاوة), and what ceases of that and what does not cease. It includes the science of what the Home of the Hereafter (الدار الآخرة) is, and why it was specifically named 'the Animal' (الحيوان), and that this world is similar to it in this attribute, indicated by <<إِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (There is nothing except that it glorifies Him with praise) [Qur’an 17:44]. It includes the science by which it is known that if Allah had not made accountability for crimes a sign, He would not have held any of His creation accountable for them at all. It includes the science of the distinction between the Imam (leader) and the follower (M'amum), and the difference in the ranks of the Imams in leadership, and how the felicitous person can be an Imam for the wretched, and his ruling by leadership in this world and his ruling by it in the Hereafter. As for the Hereafter, the following is general, but among the followers there are those who will not transition to the abode of goodness, and among them are those whom the refusal of their Imam in this world will reach, so they are diverted from following him in the Hereafter, because the Imam is felicitous, and that diverted follower is not among the people of felicity. Thus, a barrier must be placed between him and his Imam. It includes the science of advice (النصائح), from whom it is accepted, what the intellect's portion of advice is, and what the Law's portion of it is. It includes the science of the generality of Allah's affection (ود) and love (محبته) for His craftsmanship and His created things. For this reason, He encompassed them with Mercy and forgiveness for those who understand from Allah, for He is the Believer (المؤمن). It is characteristic of the believer that no sin is purely unmixed with obedience. Likewise, the Real, by virtue of being the Believer, cannot have wretchedness that is unmixed with Mercy. This is inconceivable, for Mercy toward the cosmos is an essential origin (أصل ذاتي) of Existence, and wretchedness is an incidental matter (أمر عارض) because its cause is incidental—which is the violation of obligation (التكليف), and obligation is incidental and must be lifted. Thus, the incidental matters are lifted when it is lifted, even if after a time. It includes the science of the alteration of the legislated ruling (الحكم المشروع) by the alteration of the states of the obligated person. It includes the science of the spiritual scales (الموازين المعنوية) by which meanings and sensible things are weighed, and whether the scales of the Hereafter are the establishment of justice through judgment in the cosmos, such that the entire cosmos knows that no injustice has occurred to it in the judgment that Allah decreed upon it, or whether they are sensible, like the sensible scales in this world for weighing things. And if the sense of sight perceives the sensible scales in the Hereafter, are they sensible as the sense perceives them, or are they represented (ممثلة), like the representation of deeds? For deeds are accidents (أعراض), and in the Hereafter they are persons (أشخاص). Thus, you know that they are represented, because realities do not transform, and the reality of that which does not subsist by itself is different from the reality of that which subsists by itself. Therefore, they must be represented, as\n\nIt was mentioned in the prophetic report that Death will be brought in the form of a speckled ram.\n\nHe did not say \"brought as a speckled ram,\" and Death is an accident (عرض), rather a relation. Thus, the expression concerning it must be as it was stated in the prophetic report. It includes the science of what the priority (الأولية) is in the day, for it is a circle, and the circle must have a beginning and an end returning to that beginning. The day is a single revolution of the Atlas Sphere (الفلك الأطلس). It was separated into night and day by the rising and setting of the sun. The beginning of the day, which was determined by the earth upon the movement of the sphere, was in Aries (الحمل). Then the beginning of the day appeared with the rising of the sun until its setting, and it had no existence except in the sign of Aries, for it is the house of its exaltation. So it was found rising in Aries, and the beginning of the day appeared. Dawn (الصبح) is the end of the day, and what is between them is night and day, which are known by rising and setting. For this reason, Allah only seized those He seized from the nations at the end of the day, which is for the completion of the movement, just as the impotent man (العنين) is made to wait for the passing of the seasons of the year. At that point, separation occurs between him and the woman—I mean his wife—because the customary Divine causes of influence in nature have passed over the impotent man and had no effect on him. This indicates that the impotence in him will not cease, so the benefit of marriage, consisting of pleasure and procreation, is lost. Thus, they are separated, since marriage is for both pleasure and procreation, or for one group for one reason, and for another group for another reason, and for a third group for the combination. Likewise, when the cycle of the day ends, the Divine seizure occurs at its end. It includes the science of the embodiment of spirits (تجسد الأرواح) in the forms of natural bodies: Is the essence of that spirit the very essence of the form in which it appeared, or is that only in the eye of the viewer, as we mentioned regarding the blueness of the sky? Or is the spirit to that form like the spirit is to the body—I mean the rational soul (النفس الناطقة)—and that form is a true form with an essential existence, not merely in the eye of the viewer, like all other true forms? This is an issue that many people, indeed all people, have neglected, for they were satisfied with the forms of the embodied spirits that appeared to them. If they were to spiritualize themselves (تر وحنوا) in their souls and impose the forms upon their bodies, and their shapes and forms were to change in the eye of the one who sees them, they would then know to what the embodiment of spirits returns. We have explained that every form embodied in the cosmos must have a governing spirit (روح مدبرة) from the Universal Spirit (الروح الكل) breathed into the forms. Whoever knows that the embodied form in the spirits, if it is killed (if it is an animal) or cut (if it is a plant), transitions to the Isthmus (البرزخ) necessarily, just as we transition through death, and that if it is perceived thereafter, it is perceived just as every dead animal, human or otherwise, is perceived—from this, too, if you grasp the knowledge of this, you will know to what the forms of the embodied spirits return. It includes the science of the right of the guest (الضيف) who arrives from the Real upon the one he visits. The breaths (الأنفاس) are arrivals of the Real upon the servant, and they have a right, and they return to the One from Whom they arrived. Let the servant consider how he receives them when they arrive, what etiquette is incumbent upon him in taking what they bring, and what he bestows upon them when they depart from him, returning to the Real. It includes the science of customs (العادات) and their breaking, and the refutation of the ambiguities that naturalists see as acting by themselves, what nature (الطبيعة) truly is, and to whom the apparent effects in the cosmos return. It includes the science of the nobility of the animal over the animalistic human. It includes the science of compulsion (الجبر) within choice (الاختيار). It includes the science of the Real entering Himself with the existents (الأكوان) in the spiritual path (السلوك) and the states (الأحوال): Did He enter with them for preservation, or did He enter with them because He is the Agent of what they are in, or did He enter with them out of companionship and care for them, or does His Essence necessitate that entry with them? It includes the science of slaves and free people, and what actions seek wages, and from whom they seek them. For the actor only acts for himself, so by what right does he deserve wages from another? It includes the science of the causes of trade (التجارة) that are specific to life. It includes the science of the properties (خواص) of the Divine Names (الأسماء الإلهية) from the perspective of the composition of the letters of that Name, such that if it is translated into another language, it does not possess that property. There is no difference between the temperament (مزاج) of the letters of a word when they are composed and the temperament of the bodies of mineral, plant, or animal. The animal body is a plant body to which sensation (حس) has been added, so it is called animal. It includes the science of the reason for introducing pains and pleasures to the natural animal, and the very thing by which one animal suffers pain is enjoyed by another animal. It includes the science of the effect of the weaker upon the stronger, and the origin of this is the effect of relations (النسب) in existent things, which are non-existent matters; rather, they are the only effective agents. It includes the science of the one who knows that he only speaks about Allah and is held accountable for what he attributes and perishes, and another who speaks about himself and is saved, and another who speaks about Allah and is saved. The perishing one is he who speaks from a covenant (عقد), and the saved one is he who speaks from taste (ذوق). The people of tastes (أهل الأذواق) are the people of Allah and His special friends (الخاصة من أوليائه). It includes the science of the obedience that saves and the obedience that destroys. It includes the science of the forms of the cosmos and its formation. <<والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way) [Qur’an 33:4].",
    "ur": "باب تین سو تہتر: تین اسرار کے مقام کی معرفت میں جو فضیلت والے حکمی پانی میں ظاہر ہوئے ہیں۔\n\nاس کا مرتبہ عالم پر عنایت (العنایۃ) کے ذریعے ہے، اور عالم کا ہمیشہ ہمیشہ باقی رہنا، اگرچہ اس کی صورت منتقل ہو جائے، اور یہ (مرتبہ) الحضرة المحمدیۃ (حضور محمدی) سے ہے۔\n\nمقامات ہیں جو ہم آہنگی پر دلالت کرتے ہیں،\nان پاکیزہ، معزز ارواح کے لیے۔\n\nمیں انہیں زبان پر لاتا ہوں مگر میرا ہم نشین نہیں جانتا،\nکیونکہ نور عین ظلمت میں ہے۔\n\nپس اگر ظلمت نہ ہوتی تو نور نہ ہوتا،\nلہٰذا نقص کی حقیقت کمال کے ذریعے ظاہر ہوتی ہے۔\n\nجب وہ شخص جو اضافت کو دیکھتا ہے، جان لے،\nتو وہ (اضافت) عہد و پیمان اور قیام سے مقید ہو جاتی ہے۔\n\nوہ دیکھتا ہے کہ الوجود (ہستی) کا ایک اختتام ہے،\nاور یہ کہ آغاز اختتام کے ساتھ ظاہر ہوتا ہے۔\n\nپس آغاز اور اختتام کے درمیان ایک ایسی ہستی (الوجود) حائل ہے\nجو ہمیشہ دوام کے ساتھ رہتی ہے۔\n\n### [پورا عالم ایک لکھی ہوئی کتاب ہے]\n\nجان لو، اللہ تمہاری تائید کرے، کہ پورا عالم (العالم) ایک لکھی ہوئی کتاب ہے جو کھلے ہوئے کاغذ (رَقٍّ مَنْشُورٍ) پر ہے، اور وہ الوجود (ہستی) ہے۔ پس وہ ظاہر، پھیلا ہوا ہے، لپٹا ہوا نہیں، تاکہ اس کے پھیلاؤ سے یہ معلوم ہو کہ وہ رحمت کے لیے مخلوق ہے، اور اس کے ظہور سے یہ سمجھا جائے اور جانا جائے کہ اس میں کیا ہے اور وہ کس چیز پر دلالت کرتا ہے۔ اور اسے کتاب اس لیے بنایا گیا تاکہ اس کے حروف کو ایک دوسرے سے ملایا جائے، اور یہی عالم کی اس ترتیب پر تنظیم ہے جس کا ہم نے ذکر کیا، اور اس کے معانی کو اس کے حروف سے ملانا لشکر کی صف بندی سے ماخوذ ہے۔ ہم نے اس کے پھیلاؤ کے بارے میں یہ اس لیے کہا کہ یہ رحمت کے لیے ہے، کیونکہ یہ اسی سے نازل ہوا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: تَنْزِيلٌ من الرَّحْمنِ الرَّحِيمِ كِتابٌ فُصِّلَتْ آياتُهُ قُرْآناً عَرَبِيًّا لِقَوْمٍ يَعْلَمُونَ (یہ رحمن و رحیم کی طرف سے نازل کی گئی کتاب ہے، جس کی آیات کو کھول کر بیان کیا گیا ہے، عربی قرآن کی صورت میں، ان لوگوں کے لیے جو علم رکھتے ہیں)۔ اور اللہ تعالیٰ نے اس بارے میں فرمایا: كِتابٌ أُحْكِمَتْ آياتُهُ ثُمَّ فُصِّلَتْ من لَدُنْ حَكِيمٍ خَبِيرٍ (یہ ایک ایسی کتاب ہے جس کی آیات محکم کی گئی ہیں، پھر ایک باخبر، حکمت والے کی طرف سے تفصیل سے بیان کی گئی ہیں)۔ پس اس میں آیات کا محکم ہونا اور ان کی تفصیل کو صرف وہی جانتا ہے جسے اللہ نے حکمت (الحکمة) اور فیصلہ کن بات عطا کی ہو۔ اور حکمت (الحکمة) کی وہ صورت جو باخبر، حکمت والے نے اہل عنایت (أهل العنایۃ) کو عطا کی ہے، وہ امور کے مراتب کا علم ہے، اور یہ علم کہ موجودات اور معلومات ذات حق (الحق) سے کیا حق رکھتی ہیں جو ان کے لیے ہے، اور یہ ہر شے کو اس کی خلقت عطا کرنا ہے، ایک الٰہی عطا، تاکہ ہر مخلوق کو اس کا حق ایک کونی عطا کے ذریعے دیا جائے، اس علم کے ذریعے جو اللہ نے ہمیں عطا کیا ہے۔ پس ہم بالقوۃ جانتے ہیں کہ ہر موجود حدود میں کیا حق رکھتا ہے، اور اس کے بعد ہم اسے بالفعل آیات کی صورت میں اس شخص کے لیے تفصیل (التفصیل) سے بیان کرتے ہیں جو عقل رکھتا ہے، جیسا کہ باخبر، حکمت والے نے مجھے عطا کیا ہے۔ پس ہم امور کو ان کے مقامات پر نازل کرتے ہیں اور انہیں ان کا حق دیتے ہیں، اور ان کے مرتبے سے تجاوز نہیں کرتے۔ پس آیات اور دلالات کی تفصیل (التفصیل)، مفصل (تفصیل کرنے والے) کی طرف سے اسی شرط پر ہے جب وہ انہیں ان کی جگہوں پر رکھے، کیونکہ ہر تفصیل کرنے والا حکمت والا نہیں ہوتا۔ یہ اس بات کی دلیل ہے کہ اسے حکمت (الحکمة) اور آیات کے احکام کا علم نہیں دیا گیا ہے۔ اور آیات اور موجودات پر اس کی رحمت، جو کہ الٰہی کتاب ہے اور جو عالم کے سوا کچھ نہیں، اس بات کی دلیل ہے کہ وہ اسے جانتا ہے جس نے اسے نازل کیا، اور وہ رحمن و رحیم کے سوا کوئی نہیں۔ اور انجام کار عین اس کے سابقہ امور کے سوا کچھ نہیں، اور اس کے سابقہ امور رحمن و رحیم ہیں۔ پس یہاں سے تم عالم کے مراتب اور اس کے انجام کو جانتے ہو کہ وہ مطلق رحمت کی طرف ہے، اگرچہ اسے راستے میں مشقت اور تکلیف پہنچی ہو۔ پس لوگوں میں سے کچھ وہ ہیں جو اسی لمحے رحمت اور راحت پاتے ہیں جب وہ اس منزل میں داخل ہوتے ہیں جہاں وہ پہنچے ہیں، اور وہ اہل جنت ہیں۔ اور ان میں سے کچھ وہ ہیں جن کے ساتھ راستے کی تھکاوٹ، مشقت اور نصب ان کے مزاج کے مطابق باقی رہتی ہے، اور بسا اوقات وہ ایک زمانے تک بیمار اور علیل رہتے ہیں، پھر اپنی بیماری سے منتقل ہو کر راحت پاتے ہیں، اور وہ اہل نار ہیں جو اس کے اہل ہیں، نہ کہ وہ جو اس سے نکل کر جنت میں جائیں گے۔ پس آگ انہیں ان کی خطاؤں کے بقدر چھوئے گی، اس کے باوجود کہ اللہ نے انہیں اس میں موت دے دی ہے۔ کیونکہ ان لوگوں کے لیے آگ کوئی ایسی منزل نہیں ہے جہاں وہ آباد ہوں اور اپنے اہل و عیال کے ساتھ قیام کریں، بلکہ آگ ان لوگوں کے لیے ان منازل میں سے ایک ہے جہاں مسافر اپنے راستے میں ٹھہرتا ہے، یہاں تک کہ وہ اپنی منزل پر پہنچ جائے جہاں اس کے اہل ہیں۔ پس یہ حکمت (الحکمة) اور تفصیل (التفصیل) کا معنی ہے۔ کیونکہ امور، یعنی ممکنات، اپنی ذات میں ان کے عدم کی حالت میں بھی ممتاز ہیں، اور اللہ سبحانہ انہیں جانتا ہے، اور وہ ان پر اسی طرح مطلع ہے جیسے وہ اپنی ذات میں ہیں، اور وہ انہیں دیکھتا ہے اور انہیں تکوین (ہستی) کا حکم دیتا ہے، اور وہ الوجود (ہستی) ہے۔ پس وہ اس کے حکم سے وجود میں آتی ہیں۔ پس جو کچھ اللہ کے پاس ہے وہ اجمال (الإجمال) نہیں ہے، جیسا کہ ممکنات کی حقیقتوں میں بھی اجمال (الإجمال) نہیں ہے، بلکہ امر اپنی ذات میں اور اللہ کے علم میں مکمل طور پر مفصل ہے۔ اجمال (الإجمال) صرف ہمارے پاس واقع ہوا ہے، اور ہمارے حق میں اور ہم میں ظاہر ہوا ہے۔ پس جس نے اجمال (الإجمال) کی حقیقت میں تفصیل (التفصیل) کو کشف (الکشف) کیا، خواہ علم کے ذریعے، یا عین کے ذریعے، یا ذات حق (الحق) کے ذریعے، تو وہی ہے جسے اللہ نے حکمت (الحکمة) اور فیصلہ کن بات عطا کی ہے، اور وہ صرف رسول اور خاص وارثین ہیں۔ جہاں تک حکماء، یعنی فلاسفہ کا تعلق ہے، تو ان کے نزدیک حکمت (الحکمة) عاریت ہے، کیونکہ وہ اجمال (الإجمال) میں تفصیل (التفصیل) کو نہیں جانتے۔ اور اس کی صورت ایسی ہے جیسا کہ اس مقام کا مالک دیکھتا ہے جسے اللہ نے وہ حکمت (الحکمة) عطا کی ہے جو اس کے پاس الٰہی عنایت (عنایۃ إلہیۃ) ہے۔ اور ذات حق (الحق) کے نزدیک یہ جزوی ارواح کی تعیین ہے جو اجسام میں پھونکی گئی ہیں، جو عنصری طبیعت سے مساوی اور معتدل بنائی گئی ہیں، اور یہ روح کل سے مضاف ہیں۔ اسی لیے ذکر کیا گیا کہ اس نے انہیں اجسام سے پہلے پیدا کیا، یعنی ان کی تقدیر کی اور انہیں متعین کیا، اور روح کل میں بالقوۃ موجود ان کے مدبر روح کی صورت کو متعین کیا، جو اس سے مضاف ہے۔ پس یہ تفصیل (التفصیل) بالفعل نفخ کے وقت ظاہر ہوتی ہے، اور اہل کشف (أهل الکشف) کے لیے یہی نفس رحمانی ہے۔ پس وہ دوات میں موجود سیاہی میں وہ تمام حروف اور کلمات دیکھتا ہے جو اس میں ہیں، اور ان تمام صورتوں کو جو لکھنے والا یا مصور بنائے گا، اور یہ سب ایک کتاب ہے۔ پس وہ کہتا ہے کہ اس سیاہی میں اتنی اتنی صورتیں ہیں۔ پھر جب لکھنے والا اور مصور، یا مصور بغیر لکھنے والے کے، یا لکھنے والا بغیر مصور کے، اس کے مطابق آتا ہے جو صاحب کشف (صاحب الکشف) نے ذکر کیا، تو وہ اس سیاہی سے لکھتا اور مصوری کرتا ہے، وہ سب کچھ جو اس مکاشف نے ذکر کیا، اس طرح کہ نہ اس میں اضافہ ہوتا ہے اور نہ کمی۔ اور اس بات کو وہ شخص نہیں سمجھتا جسے عقلمندوں کے عرف میں حکیم کہا جاتا ہے۔ پس یہ اہل کشف (أهل الکشف) کا حصہ ہے، اور وہی ہیں جنہیں اللہ نے حکمت (الحکمة) اور فیصلہ کن بات عطا کی ہے۔ اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے ہمیں حکم دیا ہے کہ ہم ہر حقدار کو اس کا حق دیں، اور ہم ایسا نہیں کر سکتے جب تک کہ ہم یہ نہ جان لیں کہ ہر حقدار ذات حق (الحق) سے کیا حق رکھتا ہے۔ اور یہ صرف اس صورت میں ممکن ہے جب ذات حق (الحق) ہمارے لیے اس کی وضاحت کرے۔ اسی لیے اللہ تعالیٰ نے اسے اپنی طرف منسوب کیا اور فرمایا: وآتَيْناهُ الْحِكْمَةَ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً (اور ہم نے اسے حکمت عطا کی، اور جسے حکمت دی گئی اسے بہت زیادہ بھلائی دی گئی)۔ پس اسے صرف وہی جانتا ہے جسے یہ عطا کی گئی ہو، لہٰذا یہ اللہ تعالیٰ کی طرف سے ایک ہبہ ہے، جیسا کہ اس نے ہمیں ہماری حقیقتوں کا وجود بخشا جبکہ ہم کوئی وجودی شے نہیں تھے۔ پس الٰہی علم (العلم الإلہی) وہی ہے جو اللہ سبحانہ نے الہام اور القاء کے ذریعے اور روح الامین کو اس کے دل پر نازل کر کے سکھایا۔ اور یہ کتاب ہمارے نزدیک اسی طرز پر ہے۔ پس اللہ کی قسم! میں نے اس میں ایک حرف بھی نہیں لکھا مگر الٰہی املاء، ربانی القاء، یا میرے وجود کے دل پر روحانی پھونک کے ذریعے (نفث روحانی فی روع کیانی)۔ یہ امر کی مجموعی صورت ہے، اس کے باوجود کہ ہم نہ تو شریعت لانے والے رسول ہیں اور نہ ہی مکلف کرنے والے نبی۔ کیونکہ شریعت کی رسالت اور تکلیف کی نبوت رسول اللہ محمد صَلَّى اللهُ عَليهِ وسَلَّم پر منقطع ہو چکی ہے۔ پس آپ صَلَّى اللهُ عَليهِ وسَلَّم کے بعد نہ کوئی رسول ہے اور نہ کوئی نبی جو شریعت لائے یا مکلف کرے۔ بلکہ یہ صرف علم، حکمت (الحکمة) اور اللہ کی طرف سے اس چیز کی سمجھ ہے جو اس نے اپنے رسولوں اور نبیوں پر ان کی سنتوں کے مطابق مشروع کی، اور جو کچھ اس نے عالم کے حروف اور ذات حق (الحق) کے کلمات کی صورت میں لوح الوجود (لوح الوجود) میں کھینچا اور لکھا۔ پس تنزیل (نزول) ختم نہیں ہوتا، بلکہ وہ دنیا اور آخرت میں دائمی ہے۔\n\nاللہ نے طَیّ اور خولان سے\nمیرا جسم بنایا، پس میری خلقت کو معتدل کیا اور مجھے سنوارا۔\n\nاور ذات حق (الحق) نے میرے لیے ایک پاکیزہ روح پیدا کی،\nپس کسی اور کی بناوٹ میری بناوٹ جیسی نہیں۔\n\nمیں یقیناً اس روح کو جانتا ہوں جو مجھ پر نازل ہوتی تھی،\nسات آسمانوں کے اوپر سے فرقان (حق و باطل میں تمیز) کے ساتھ۔\n\nہم اللہ تعالیٰ کے اس قول کا ارادہ رکھتے ہیں: إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً (اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان پیدا کر دے گا)۔ اور میں اس میں اللہ کی طرف سے نبوت کا دعویٰ کرنے والا نہیں ہوں، بلکہ یہ محض جود و احسان ہے۔\n\nبے شک نبوت ایک گھر ہے جو ہمارے درمیان بند ہے،\nاور وہ ایمان کے قفل سے مضبوطی سے بند ہے۔\n\nاور ہم نے یہ بات اس لیے کہی تاکہ کوئی وہم کرنے والا یہ گمان نہ کرے کہ میں اور میرے جیسے لوگ نبوت کا دعویٰ کرتے ہیں۔ اللہ کی قسم! اب صرف وراثت اور محمد رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے راستے پر چلنا ہی باقی ہے، خاص طور پر۔ اگرچہ نبوت کا وہ حصہ جو اللہ نے ہم پر باقی رکھا ہے، جیسے مبشرات (اچھے خواب) اور مکارم اخلاق، اور جیسے قرآن کا حفظ جب انسان اسے یاد کر لے، وہ لوگوں کے لیے عام ہے اور ہمارے اور ہمارے جیسے لوگوں کے لیے خاص ہے۔ کیونکہ یہ اور اس کی مثالیں نبوت کے موروثی اجزاء میں سے ہیں۔ اسی لیے سب سے پہلا انسان جسے اللہ نے پیدا کیا، یعنی آدم، نبی تھے، اور جو بھی اس کے بعد ان کے راستے پر چلا وہ وارث ہے، اس خاکی نشأت میں یہ ضروری ہے۔ لیکن مقام کے اعتبار سے، آدم اور ان سے نیچے والے صرف محمد صَلَّى اللهُ عَليهِ وسَلَّم کے وارث ہیں، کیونکہ آپ نبی تھے جبکہ آدم پانی اور مٹی کے درمیان تھے اور ابھی موجود نہیں ہوئے تھے۔ پس نبوت محمد صَلَّى اللهُ عَليهِ وسَلَّم کے لیے ہے، نہ کہ آدم کے لیے، اور آدم کے لیے آدم کی طبعی انسانی صورت ہے، اور محمد صَلَّى اللهُ عَليهِ وسَلَّم کے لیے کوئی صورت نہیں، اور آدم اور تمام نبیوں پر سلام ہو۔ پس آدم انسانی اجسام کے باپ ہیں، اور محمد صَلَّى اللهُ عَليهِ وسَلَّم آدم سے لے کر وارثوں کے خاتمے تک کے وارثوں کے باپ ہیں۔ پس ہر شریعت جو ظاہر ہوئی اور ہر علم جو ظاہر ہوا، وہ ہر زمانے، رسول اور نبی میں، آدم سے لے کر قیامت تک، محمدی وراثت ہے۔ اور اسی لیے آپ کو جوامع الکلم (جامع کلمات) عطا کیے گئے، اور ان میں سے ایک یہ ہے کہ اللہ نے آدم کو تمام اسماء سکھائے۔ پس کل کا حکم آدم کی صورت میں ظاہر ہوا، اور محمدی صورت میں۔ پس وہ آدم میں اسماء ہیں اور محمد صَلَّى اللهُ عَليهِ وسَلَّم میں کلمات ہیں۔ اور اللہ سبحانہ کے کلمات ختم نہیں ہوتے، اور اس کی موجودات اپنے جوہر کے لحاظ سے دور نہیں ہوتیں، اگرچہ ان کی صورتیں چلی جائیں اور ان کے احکام بدل جائیں۔ پس عین (حقیقت) نہ جاتی ہے اور نہ بدلتی ہے، بلکہ عالم میں تبدیلی واقع ہوئی ہے اس حق کے لیے جو صورتوں میں تحول (بدلاؤ) پر ہے۔ پس اگر عالم میں تبدیلی ظاہر نہ ہوتی تو عالم مکمل نہ ہوتا۔ پس کوئی الٰہی حقیقت باقی نہیں رہتی مگر یہ کہ عالم کا اس پر استناد ہو۔ اس کے باوجود، اہل کشف (أهل الکشف) کے نزدیک امر کی تحقیق یہ ہے کہ عالم کی تبدیلی کی حقیقت عین صورتوں میں الٰہی تحول (التحول الإلہی) کی حقیقت ہے۔ پس عین اس کا ہونا جس میں اس نے ظہور الٰہی (التجلی) کیا، عین اس کا ہونا ہے جس میں اس نے تمہیں ترکیب دی۔ ف ما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله (اور تم نہیں چاہتے مگر یہ کہ اللہ چاہے)۔ پس یہ حقیقت میں اللہ کی مشیت ہے، نہ کہ تمہاری مشیت، اور تم اس کے ذریعے چاہتے ہو۔ پس زندگی عین جوہر کے لیے ہے اور موت صورتوں کی تبدیلی کے لیے ہے۔ یہ سب لِيَبْلُوَكُمْ (تاکہ وہ تمہیں آزمائے) تکلیف کے ذریعے أَيُّكُمْ أَحْسَنُ عَمَلًا (کہ تم میں سے کون عمل میں سب سے بہتر ہے)۔ اور وہ تمہیں صرف اس لیے آزماتا ہے تاکہ اسم الخبیر (باخبر) کی نسبت درست ہو، پس یہ خبر پر مبنی علم ہے، وہ جانتا ہے اور کوئی خبر نہیں، تاکہ اس پر حجت قائم کی جائے جس میں اس نے نزاع اور انکار پیدا کیا۔ اور یہ سب خطاب میں اور حقیقتوں میں آیات کی تفصیل (التفصیل) میں سے ہے۔ پس هُوَ الْحَكِيمُ الْخَبِيرُ (وہ حکمت والا، باخبر ہے) اور هُوَ الْعَزِيزُ الْغَفُورُ (اور وہ غالب، بخشنے والا ہے)۔ پس اگر ہر ایک کے لیے وہ کشف (الکشف) ہو جاتا جو عالم کے بعض لوگوں کے لیے ہوا، تو وہ غفور (بخشنے والا) نہ ہوتا، اور نہ ہی کسی کو کسی پر فضیلت حاصل ہوتی، کیونکہ فضیلت صرف علم کی زیادتی سے ہے جو پہلے سے موجود تھا۔ پس پورا عالم فاضل (فضیلت والا) اور مفضول (کم فضیلت والا) ہے۔ پس اعلیٰ ترین علماء سب سے نچلے درجے کے علماء کے ساتھ صنعت کے علم میں شریک ہیں۔ پس عالم اللہ کی صنعت ہے، اور بنائی کے فن کا علم بننے والے کا علم ہے، اور وہ اس کی صنعت ہے۔ اور یہ عموم میں سب سے نچلا علم ہے، اور خصوص میں صنعت کا علم سب سے بلند علم ہے، کیونکہ صنعت کے ذریعے ذات حق (الحق) الوجود (ہستی) میں ظاہر ہوئی ہے۔ پس یہ سب سے بڑی دلیل، سب سے واضح راستہ اور سب سے سیدھی بات ہے۔ اور یہاں سے اللہ کے بڑے خاص لوگ (خواص اللہ الأکابر) عام لوگوں کی صورت میں حکم میں ظاہر ہوئے، پس ان کا مرتبہ مجہول رہا۔ پس انہیں ان کے سوا کوئی نہیں جانتا، اور انہیں عالم میں کوئی امتیاز حاصل نہیں، برخلاف اصحاب احوال کے، کیونکہ وہ عموم میں ممتاز ہوتے ہیں، اور ان کی طرف انگلیوں سے اشارہ کیا جاتا ہے، اس خرق عادات کی وجہ سے جو ان پر حال کے ذریعے ظاہر ہوتا ہے۔ اور اہل اللہ نے اس سے پرہیز کیا کیونکہ اس میں غیر جنس بھی ان کے ساتھ شریک ہو جاتا ہے۔ پس اہل اللہ مقام کے ذریعے معلوم ہوتے ہیں، شہود (الشہود) کے ذریعے مجہول ہوتے ہیں، انہیں پہچانا نہیں جاتا، جیسا کہ اللہ، جو اپنے اہل کے لیے معلوم ہے، ہر ایک کے نزدیک فطرت سے معلوم ہے، لیکن عقل اور شہود (الشہود) سے اس کے نزدیک مجہول ہے۔ پس اگر وہ اس پر ظہور الٰہی (التجلی) کرے تو وہ اسے نہیں پہچانے گا، بلکہ وہ ہمیشہ مسلسل ظہور الٰہی (التجلی) میں ہے، لیکن وہ صرف اپنے اہل اور خاص لوگوں کے نزدیک معلوم ہے، اور وہ اہل قرآن، اہل ذکر ہیں، جن سے اللہ نے ہمیں سوال کرنے کا حکم دیا ہے، کیونکہ وہ صرف اسی کے بارے میں خبر دیتے ہیں۔ اللہ تعالیٰ نے فرمایا: فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ (پس اگر تم نہیں جانتے تو اہل ذکر سے پوچھو)۔ کیونکہ اہل ذکر ذات حق (الحق) کے ہم نشین ہیں۔ پس وہ ذاکر جو اللہ کا شہود (الشہود) کرتا ہے کہ وہ اس کا ذکر کرنے والا ہے، وہ صرف اپنے ہم نشین کے بارے میں خبر دیتا ہے، پس وہ امر کے بارے میں اسی طرح خبر دیتا ہے جیسا کہ وہ ہے، اور یہی علم ہے۔ کیونکہ وہ عَلى‏ بَيِّنَةٍ من رَبِّهِ (اپنے رب کی طرف سے واضح دلیل پر ہے) اور يَتْلُوهُ شاهِدٌ مِنْهُ (اور اس کے پیچھے اس کی طرف سے ایک گواہ ہے)، اور وہ اس کا اپنی صورت میں ظاہر ہونا ہے، یعنی جو علم وہ اللہ کی طرف سے لایا ہے، وہ اس کی صفت ہے جس کے ذریعے یہ ذاکر شخص ظہور الٰہی (التجلی) کرتا ہے۔ پس اس کے ذکر کے بقدر ذات حق (الحق) ہمیشہ اس کے ساتھ ہم نشین رہتی ہے۔ اسی لیے\n\nعائشہ رضی اللہ عنہا نے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے بارے میں فرمایا کہ آپ ہر حال میں اللہ کا ذکر کرتے تھے۔\n\nپس انہوں نے آپ کے لیے اللہ تعالیٰ کے ساتھ دائمی ہم نشینی ثابت کی۔ پس یا تو انہوں نے یہ کشف (الکشف) کے ذریعے جانا، یا رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے انہیں اس کی خبر دی، اور یہ ان کی ہم نشینی میں تھا کہ آپ انہیں رسولوں کی خبریں سناتے تھے جس سے ان کا دل مضبوط ہوتا تھا، اس نزاع کو دیکھ کر جو ان کی امت نے اس چیز میں کی جو وہ اللہ کی طرف سے لائے تھے۔ اور اگر آپ کے پاس یہ اور اس جیسی چیزیں نہ ہوتیں تو آپ اور دوسرے انسانوں کے درمیان کوئی فرقان (تمیز) نہ ہوتا۔ کیونکہ اللہ تعالیٰ ان کے ساتھ ہے جہاں کہیں بھی وہ ہوں (أَيْنَ ما كانُوا)۔ پس ضروری ہے کہ وہ اپنے ذکر کرنے والوں کے ساتھ خصوصی معیت کے ساتھ ہو۔ اور وہاں صرف علم کی زیادتی ہے جس سے فضیلت ظاہر ہوتی ہے۔ پس ہر ذاکر جو اپنے ذکر میں اپنے مذکور کے بارے میں علم میں اضافہ نہیں کرتا، وہ ذاکر نہیں ہے، اگرچہ وہ اپنی زبان سے ذکر کرے۔ کیونکہ ذاکر وہ ہے جسے پورا ذکر اپنی لپیٹ میں لے لے۔ پس وہی ذات حق (الحق) کا ہم نشین ہے۔ پس فائدہ کا حصول ضروری ہے، کیونکہ وہ کریم عالم جس میں بخل کا تصور نہیں کیا جا سکتا، ضروری ہے کہ وہ اپنے ہم نشین کو کوئی ایسی چیز عطا کرے جو اس کے پاس نہ ہو، کیونکہ وہاں کوئی بخل نہیں جو جود کے منافی ہو۔ پس صرف قابل محل باقی رہتا ہے، اور وہ صرف قابل محل کے ساتھ ہی ہم نشینی کرتا ہے۔ پس وہی ذات حق (الحق) کا ہم نشین ہے۔ اور عالم ان کا ہم نشین ہے، ذات حق (الحق) کے لحاظ سے، جہاں سے وہ شعور نہیں رکھتے۔ اور عام لوگوں کی انتہا، اگر وہ مومن ہوں، یہ ہے کہ وہ جانیں کہ اللہ ان کے ساتھ ہے، اور فائدہ یہ ہے کہ تم اللہ کے ساتھ ہو، نہ کہ اس میں کہ وہ تمہارے ساتھ ہے۔ پس امر اپنی ذات میں ایسا ہی ہے۔ پس جو ذات حق (الحق) کے ساتھ ہو، ضروری ہے کہ وہ ذات حق (الحق) کا شہود (الشہود) کرے، اور جس نے اس کا شہود کیا، تو اس کے پاس صرف علم کا وجود ہے۔ پس یہ الٰہی عطیات ہیں۔\n\nپس علم سب سے اشرف عطیہ ہے جو وہ دیتا ہے،\nاور کشف (الکشف) سب سے عظیم اور واضح راستہ ہے۔\n\nپس اگر تم ذات حق (الحق) کے معبود سے کوئی طلب کرو،\nتو اس سے کشف (الکشف) مانگو، کیونکہ اللہ اسے عطا کرتا ہے۔\n\nاور دروازہ کھٹکھٹاتے رہو، اگرچہ اسے بند کر دیا ہو،\nوجود اللہ (وجود اللہ) کی دعویٰ کی ہستی اسے کھول دے گی۔\n\nپس ہر وہ علم جس کا حصول دروازہ کھلنے کے بعد کشف (الکشف) کے ذریعے نہ ہو، جسے الٰہی جود ظاہر اور واضح کرتا ہے، وہ شعور ہے نہ کہ علم، کیونکہ وہ بند دروازے کے پیچھے سے حاصل ہوا ہے۔ اور دروازہ تمہارے سوا کچھ نہیں ہے۔ پس تم اپنے معنی اور اپنی جگہ کے حکم سے ہو، اور وہی دروازے کا بند ہونا ہے۔ کیونکہ تم شعور رکھتے ہو کہ اس جسم اور ظاہری صورت کے پیچھے کوئی اور معنی ہے جسے تم نہیں جانتے، اگرچہ تم اس کا شعور رکھتے ہو۔ پس ظاہری صورت ایک پٹ ہے اور نفس دوسرا پٹ ہے۔ پس جب تم دروازہ کھولتے ہو تو ایک پٹ دوسرے پٹ سے ممتاز ہو جاتا ہے اور تمہیں دروازے کے پیچھے کا منظر دکھائی دیتا ہے۔ پس یہی علم ہے۔ پس تم نے اسے صرف تفصیل (التفصیل) کے ساتھ دیکھا، کیونکہ تم نے دونوں پٹوں کے درمیان تفصیل کی یہاں تک کہ یہ تم میں ممتاز ہو گیا۔ پس اگر دروازہ حق اور خلق (مخلوق) سے عبارت ہو، اور وہ تم اور تمہارا رب ہو، تو امر تم پر مشتبہ ہو گیا، پس تمہاری حقیقت تمہارے رب سے ممتاز نہ ہوئی، پس تم اسے ممتاز نہیں کر سکتے جب تک کہ دروازہ نہ کھل جائے۔ پس عین کھلنا تمہیں دروازے کی معرفت (المعرفۃ) اور دونوں پٹوں کے درمیان فرق عطا کرتا ہے۔ پس تم اپنی ذات کو جانتے ہو اور اپنے رب کو جانتے ہو، اور یہی رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کا قول ہے: من عرف نفسه عرف ربه (جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا)۔ پس شعور دروازے کے بند ہونے کے ساتھ ہے اور علم دروازے کے کھلنے کے ساتھ ہے۔ پس اگر تم عالم کو اس چیز میں متہم دیکھو جس کا وہ دعویٰ کرتا ہے کہ وہ اس کا عالم ہے، تو وہ عالم نہیں ہے، اور یہی شہور (شعور) ہے۔ اور اگر اس علم میں تہمت ختم ہو جائے تو وہی علم ہے، اور وہ جانتا ہے کہ اس کے لیے دروازہ کھول دیا گیا ہے اور جود نے اس کے لیے دروازے کے پیچھے کی چیز ظاہر کر دی ہے۔ اور بہت سے لوگ یہ گمان کرتے ہیں کہ شعور علم ہے، حالانکہ ایسا نہیں ہے۔ شعور کا علم سے صرف اتنا حصہ ہے کہ تم یہ جانو کہ دروازے کے پیچھے کوئی امر ہے، اجمالی طور پر، لیکن تم نہیں جانتے کہ وہ کیا ہے۔ اسی لیے اللہ تعالیٰ نے فرمایا: وما عَلَّمْناهُ الشِّعْرَ (اور ہم نے اسے شعر نہیں سکھایا) ان کے اس قول کی وجہ سے کہ وہ شاعر ہے۔ پھر فرمایا: وما يَنْبَغِي لَهُ إِنْ هُوَ یعنی یہ جسے ہم نے بھیجا ہے إِلَّا ذِكْرٌ (مگر ایک نصیحت) یعنی جو اس نے ذات حق (الحق) کی ہم نشینی سے حاصل کی، وقُرْآنٌ مُبِينٌ (اور ایک واضح قرآن) یعنی جو اجمال (الجمع) کی حقیقت میں ظاہر اور مفصل ہے، جو اس نے شعور سے حاصل نہیں کیا۔ کیونکہ جو کچھ بھی صاحب شعور مشعور بہ میں متعین کرتا ہے، وہ گمان ہے، اگرچہ وہ امر کے موافق ہو، اور وہ علم ہو، لیکن وہ اس میں بصیرت پر نہیں ہے۔ اور کسی عاقل کے لیے یہ مناسب نہیں کہ وہ کسی امر کی طرف دعوت دے جب تک کہ وہ اس امر میں بصیرت پر نہ ہو، اور وہ یہ ہے کہ وہ اسے رؤیت اور کشف (الکشف) کے ذریعے جانے، اس طرح کہ اسے اس میں کوئی شک نہ ہو۔ اور یہ مقام صرف اللہ کے رسولوں کے لیے خاص نہیں ہے، بلکہ یہ ان کے لیے اور ان کے وارث پیروکاروں کے لیے بھی ہے۔ اور کوئی وارث نہیں مگر وہ جس کے لیے قول، عمل اور خاص طور پر باطنی حال میں اتباع مکمل ہو جائے۔ کیونکہ وارث پر ظاہری حال کو چھپانا واجب ہے، کیونکہ اس کا ظاہر کرنا واجب الٰہی امر پر موقوف ہے۔ کیونکہ دنیا میں وہ فرع ہے اور اصل بطون (چھپا ہونا) ہے۔ اسی لیے اللہ نے دنیا میں اپنے بندوں سے عموماً پردہ رکھا، اور آخرت میں وہ اپنے بندوں پر عموماً ظہور الٰہی (التجلی) کرے گا۔ پس جب وہ کسی پر خاص طور پر ظہور الٰہی (التجلی) کرتا ہے، جیسا کہ اس نے پہاڑ پر ظہور الٰہی (التجلی) کیا، اسی طرح رسولوں پر حال کا جو ظہور ہوا، وہ ان کی سچائی پر دلالت کے لیے تھا تاکہ وہ ان کے لیے شریعت لائیں، اور وارث اس چیز کی دعوت دینے والا ہے جسے اس رسول نے مقرر کیا ہے، اور وہ شریعت لانے والا نہیں ہے، لہٰذا اسے حال کے ظہور کی ضرورت نہیں ہے جیسا کہ شریعت لانے والے کو ضرورت تھی۔ پس وارث امت میں دعوت کے بقا کو برقرار رکھتا ہے، اور اس کا حصہ صرف یہی ہے۔ یہاں تک کہ اگر وارث کوئی شریعت لاتا (حالانکہ وہ نہیں لاتا) لیکن اگر ہم فرض کریں کہ وہ لاتا، تو امت اسے قبول نہ کرتی۔ پس حال کے ظہور کا کوئی فائدہ نہیں اگر قبولیت نہ ہو جیسا کہ رسول کے لیے تھی۔ پس یہ جان لو۔ اور جو احوال اللہ نے ان پر ظاہر کیے، وہ اللہ کی طرف سے ہیں، نہ کہ بندے کے کسی تکلف یا ارادے سے، اور امت میں اسے کرامت کہا جاتا ہے۔ پس جو کچھ ولی اللہ اور اس کا طالب کوشش کرتا ہے، وہ صرف اس دروازے کا کھولنا ہے تاکہ وہ اپنے احوال میں اپنے نفس کے نزدیک اللہ کی طرف سے بصیرت پر ہو، نہ کہ وہ اپنی مخلوق کے سامنے اس کے ذریعے ظاہر ہو۔ پس وہ عَلى‏ نُورٍ من رَبِّهِ (اپنے رب کی طرف سے نور پر ہے) اور اپنے مقام میں ثابت ہے، اسے صرف وہی متزلزل کر سکتا ہے۔ پس اس قسم کی کرامت اس کا اللہ کا علم ہے اور اس سے متعلق تفصیل (التفصیل) اس کے اسماء حسنیٰ اور کلمات علیا میں، پس وہ جانتا ہے کہ اس کی طبیعت کی زمین میں کون سا بیج داخل ہوتا ہے جو اللہ نے اسے سنوارنے اور معتدل کرنے کے وقت اس میں بویا تھا، اور اس سے کیا عبارات نکلتی ہیں جو اس میں موجود چیزوں کے بارے میں ہیں، اور عملی، صنعتی افعال اپنے مراتب کے مطابق، کیونکہ جو زمین سے نکلتا ہے وہ مختلف انواع کا ہوتا ہے، اور وہی زمین کی زینت ہے۔ پس جو انسان کی طبیعت کی زمین اور اس کے جسم سے نکلتا ہے، وہ اس کے لیے زینت ہے، جیسے عبارت میں فصاحت اور محکم صنعتی افعال۔ جیسا کہ وہ جانتا ہے کہ اس کی عقل کے آسمان سے کیا نازل ہوتا ہے، اس شریعت میں جو وہ اپنے رب کی معرفت (المعرفۃ) میں دیکھتا ہے، اور یہی اس کے دل پر الٰہی تنزیل ہے۔ اور اس میں اس کے طیب کلمات کا کیا عروج ہوتا ہے، عمل صالح کے براق پر جو اسے اللہ کی طرف بلند کرتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ (اسی کی طرف پاکیزہ کلمات چڑھتے ہیں) اور یہ وہ ہے جو زمین سے نکلا، والْعَمَلُ الصَّالِحُ يَرْفَعُهُ (اور عمل صالح اسے بلند کرتا ہے) اور یہ بھی وہ ہے جو زمین نے نکالا۔ پس جو آسمان سے نازل ہوتا ہے، وہی ہے جو زمین میں داخل ہوتا ہے، اور جو زمین سے نکلتا ہے، اور وہ اس چیز سے ظاہر ہوتا ہے جو اس میں داخل ہوئی تھی، وہی ہے جو آسمان میں عروج کرتا ہے۔ پس عین نازل ہونے والا ہی عین داخل ہونے والا ہے، اور عین خارج ہونے والا ہی عین عروج کرنے والا ہے۔ پس امر ذکر اور انثیٰ، اور نکاح اور ولادت ہے۔ پس حقیقتیں موجود ہیں، اور احکام مشہود ہیں، اور اجلیں محدود ہیں، اور افعال مقصود ہیں، جن میں سے کچھ بالعرض مذموم ہیں، اور بالذات محمود ہیں۔\n\n### [تفصیل (التفصیل) الوجود (ہستی) میں عمل کے بغیر ظاہر نہیں ہوتی]\n\nپھر جان لو کہ تفصیل (التفصیل) الوجود (ہستی) میں عمل کے بغیر ظاہر نہیں ہوتی۔ پس اگر عمل کرنے والا اسے اجمال (الإجمال) میں اس کی تفصیل (التفصیل) کے مطابق حکمت (الحکمة) کے ساتھ تفصیل سے بیان کرے، تو وہ عمل صالح ہے۔ اور اگر وہ اسے اس کے علاوہ کسی اور طریقے سے تفصیل سے بیان کرے، اس میں انسان کی تفصیل کو دیکھتے ہوئے، تو وہ عمل غیر صالح ہے۔ اور عمل غیر صالح زیادہ تر ان لوگوں میں ہوتا ہے جو امور کو عقلی نظر سے تفصیل سے بیان کرتے ہیں نہ کہ الٰہی اعلام سے۔ پس جو الٰہی اعلام سے تفصیل سے بیان کیا گیا، وہ سب عمل صالح ہے۔ اور جو عقلی نظر سے تفصیل سے بیان کیا گیا، اس میں سے کچھ صالح ہے اور کچھ غیر صالح، صرف اس کی تفصیل کے لحاظ سے۔ اور اللہ تعالیٰ کے لحاظ سے سب عمل صالح ہے، جیسا کہ وہ کہتا ہے کہ الوجود (ہستی) میں نقص کمال الوجود (کمال ہستی) میں سے ہے، اور اگر تم چاہو تو کہو کہ کمال عالم میں سے ہے، کیونکہ اگر نقص عالم سے کم ہو جاتا تو عالم ناقص ہوتا۔ پس سمجھو۔\n\n### [فساد الٰہی حکم کی تبدیلی ہے]\n\nاور جان لو کہ ہم الٰہی علم (العلم الإلہی) اور حقیقت کے ساتھ ادب کی وجہ سے عمل غیر صالح اور فساد (الفساد) کا ذکر نہیں کرتے تھے، لیکن جب ہم نے دیکھا کہ الٰہی وضع میں اللہ نے فساد سے خبردار کیا ہے اور فرمایا: ولا تَبْغِ الْفَسادَ في الْأَرْضِ إِنَّ الله لا يُحِبُّ الْمُفْسِدِينَ (اور زمین میں فساد مت پھیلاؤ، بے شک اللہ فساد کرنے والوں کو پسند نہیں کرتا)۔ اور فرمایا: تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ ولا فَساداً (وہ آخرت کا گھر ہم ان لوگوں کے لیے بناتے ہیں جو زمین میں نہ تو برتری چاہتے ہیں اور نہ فساد)۔ اور ہم نے دیکھا کہ عقلمندوں کے عرف میں، بلکہ تمام لوگوں میں، فساد کا ذکر ہوتا ہے، اس لیے ہم نے اس کا ذکر کرنے کی جسارت کی۔ اور ہم اس کی جگہ فساد کے بجائے یہ کہتے تھے کہ ایک صورت کا ظاہر کرنا اور دوسری کو زائل کرنا، جیسا کہ امر اپنی ذات میں ہے، ایک خاص ترکیب اور طبعی مزاج کے نظام کی وجہ سے۔ جہاں تک اس کے قول إِنَّ الله لا يُحِبُّ الْمُفْسِدِينَ کا تعلق ہے، تو اس سے مراد الٰہی حکم کو تبدیل کرنا ہے، نہ کہ حقیقت کو تبدیل کرنا اور نہ ہی صورت کو بدلنا۔ اور جہاں تک اس کے قول عُلُوًّا في الْأَرْضِ کا تعلق ہے، تو یہ ایک محقق امر ہے، کیونکہ زمین علو (بلندی) کو قبول نہیں کرتی جب تک کہ وہ اس کے لیے زمین رہے۔ اور جو کچھ ہم اس میں بلند اور اونچا دیکھتے ہیں، وہ پہاڑ اور میخ ہے جسے اللہ نے اس کے ذریعے اسے ٹھہرایا تاکہ اس کا ڈولنا ختم ہو جائے۔ پس پہاڑ زمین نہیں ہیں۔ پس اللہ نے زمین کو گیند کی طرح پیدا کیا، مٹی اور پتھر کے اجزاء، جنہیں اللہ نے ایک دوسرے سے ملایا۔ پھر جب اللہ نے آسمان کو پیدا کیا، تو اس کے بعد زمین کو پھیلایا تاکہ وہ اس پر ٹھہر جائے جس کے لیے اسے جگہ بنایا گیا تھا، اور اسی لیے وہ ڈولتی تھی۔ اور اگر وہ گیند باقی رہتی تو نہ ڈولتی، اور اس نے پہاڑوں کو پیدا نہیں کیا تھا۔ پس اللہ سبحانہ نے پہاڑوں کو پیدا کیا اور انہیں ایک ہی دفعہ اس پر رکھ دیا، اور اس کے گرد محیط پانی کے گرد ایک پہاڑ کو گھیر دیا جسے اس نے اس کے لیے کمر بند کی طرح بنا دیا، کہا جاتا ہے کہ اس پر آسمان کے گنبد کے کنارے ہیں، اور وہ نیلاہٹ جسے تم آسمان سے منسوب کرتے ہو اور اس کے ذریعے اسے وصف کرتے ہو، وہ آسمان کے جرم کا رنگ ہے، تمہاری بصری ادراک سے اس کی دوری کی وجہ سے، جیسا کہ تم پہاڑوں کو دیکھتے ہو جب وہ تم سے دور ہوتے ہیں تو وہ نیلے دکھائی دیتے ہیں، حالانکہ نیلاہٹ ان کے لیے نہیں ہے، بلکہ آنکھ کی نظر سے دوری کی وجہ سے ہے، جیسا کہ تم دور کے پہاڑ کو کالا دیکھتے ہو، اور جب تم اس کے پاس جاؤ تو وہ ایسا نہیں ہوتا جیسا تم نے دیکھا تھا۔ اور ہم نے تمہیں بیان کیا ہے کہ رنگ دو قسم کے ہوتے ہیں: ایک وہ رنگ جو رنگین جسم کے ساتھ قائم ہوتا ہے، اور ایک وہ رنگ جو دیکھنے والے کے لیے جسم کو دیکھنے پر ایک عارضی امر کی وجہ سے پیدا ہوتا ہے جو دیکھنے والے اور دیکھی جانے والی چیز کے درمیان ہوتا ہے، جیسے یہ، اور جیسے وہ رنگ جو حقیقی رنگ والے جسم میں عارضی ہیئتوں کی وجہ سے پیدا ہوتے ہیں، تو دیکھنے والا انہیں ان کے قائم رنگ کے علاوہ کسی اور رنگ پر دیکھتا ہے جسے وہ جانتا ہے۔ اور یہ دلائل میں شبہات کی طرح ہیں، وہ رنگ ہیں نہ کہ رنگ، اور ان کا الٰہی حقائق سے حصہ یہ ہے: وما رَمَيْتَ إِذْ رَمَيْتَ (اور جب تم نے پھینکا تو تم نے نہیں پھینکا) اور تم تم نہیں ہو، اور جیسے پورا عالم حقیقت میں خلق ہے نہ کہ خلق، یا حق ہے نہ کہ حق، اور جیسے خیال حس ہے نہ کہ حس، اور محسوس ہے نہ کہ محسوس، یعنی متخیل۔ اور زمین پانی سے منفعل ہے، جو ہوا سے منفعل ہے۔ کیونکہ ہوا ہمارے نزدیک اصل ہے، اور اسی لیے وہ عماء (نفس رحمان) سے سب سے زیادہ قریب نسبت رکھتی ہے۔ پس اس نے حرارت اور رطوبت کو جمع کیا، پس اس کی حرارت سے آگ کا رکن ظاہر ہوا، اور اس کی رطوبت سے پانی کا رکن ظاہر ہوا، اور پانی کے جمود سے زمین بنی۔ پس ہوا نفس کا بیٹا ہے، اور وہ عماء ہے، اور آگ اور پانی ہوا کے دو بیٹے ہیں، اور زمین بیٹے کا بیٹا ہے، اور وہ وہ ہے جو پانی سے جم گیا، اور جو نہیں جما وہ اپنی اصل پر پانی رہا۔ اور زمین اس پانی پر ہے۔ اور ہم نے دریائے فرات میں دیکھا ہے کہ جب وہ شمالی علاقوں میں سردیوں میں جم جاتا ہے تو وہ زمین بن جاتا ہے جس پر قافلے، لوگ اور چوپائے چلتے ہیں، اور اس برف کے نیچے پانی بہتا رہتا ہے۔ اور وہ پانی ہوا پر ہے، اور وہی اسے اپنی رطوبت سے مدد دیتا ہے، پس وہ اس کی حقیقت اور اس پر اس کے ٹھہراؤ کو محفوظ رکھتا ہے۔ کیونکہ ہوا پانی کو بہاتی ہے جب وہ حرکت کرتی ہے، اور جب وہ رک جاتی ہے اور ساکن ہو جاتی ہے تو پانی اس پر ساکن ہو جاتا ہے، اور پانی اس میں سے نہیں گزرتا۔ اور ہم نے یہ بانس کی نلکی اور اس جیسی سوراخ والی چیزوں میں دیکھا ہے کہ جب تم اسے پانی سے بھرتے ہو اور نلکی کے اوپر کے سوراخ کو بند کر دیتے ہو تو نلکی کے نیچے سے پانی کا کوئی حصہ نہیں بہتا۔ اور جب تم اسے ہٹا دیتے ہو تو پانی بہنے لگتا ہے۔ پس وہ پانی صرف ساکن ہوا پر بھروسہ کرتا ہے، اس کے سکون کی وجہ سے، اور یہ ایک صورت ہے جو پورے عالم کو عام ہے۔ اور جب ہوا میں لہر پیدا ہوتی ہے تو اسے ریح (ہوا) کہا جاتا ہے، اور ریح اپنے گزرنے والی خوشبو اور بدبو کو سونگھنے کی جگہوں تک پہنچاتی ہے، اور اسی طرح چیزوں کی ٹھنڈک اور گرمی کو بھی پہنچاتی ہے۔ اسی لیے ریح کو چغل خور کہا جاتا ہے، اور اسے سننے والوں تک خبریں پہنچانے سے بھی وصف کیا جاتا ہے۔ اور سننے والے اور سونگھنے والے اس سے ان امور کو حاصل نہیں کرتے جن کے ذریعے وہ مکمل ہوتی ہے اور جن کے بارے میں وہ خبر دیتی ہے، مگر قوت سماعت اور قوت شامہ۔ اور اجرام کی حرکتیں ہوا کو حرکت دیتی ہیں، پس اس کے لیے ریح کا نام پیدا ہوتا ہے، اور ہوا اجرام کو حرکت دیتی ہے، اور اجرام اس میں حرکت کرتے ہیں۔ جہاں تک خرق (پھاڑنا) کا تعلق ہے، تو وہ صرف جگہوں کو چیزوں سے خالی کرنا اور انہیں ان چیزوں کے علاوہ دوسری چیزوں سے مشغول کرنا ہے، کیونکہ عالم میں کوئی خلا نہیں ہے، بلکہ یہ صورتوں کی استحالات (تبدیلیاں) ہیں۔ پس صورتیں امور کو پیدا کرتی ہیں اور صورتیں امور کو لے جاتی ہیں۔ اور وہ جوہر جس نے خلا کو بھرا ہے، وہ حقیقت میں ثابت ہے، نہ وہ کسی چیز میں تبدیل ہوتا ہے اور نہ کوئی چیز اس میں تبدیل ہوتی ہے۔ اور الٰہی اسماء کا تعلق صرف ان صورتوں کے پیدا کرنے اور ان کے اختلاف سے ہے، اور جہاں تک ان کے جانے کا تعلق ہے، تو وہ اس چیز کی وجہ سے ہے جس کا تقاضا ان کے موجد کی ذات کرتی ہے، اور وہ ایک لطیف علم ہے۔ کیونکہ یہ ذات حق (الحق) کی طرف سے حق بات ہے، لیکن سمجھیں اس میں مختلف ہوتی ہیں۔ کیونکہ وہ صورتوں سے کہتا ہے: إِنْ يَشَأْ يُذْهِبْكُمْ ويَأْتِ بِخَلْقٍ جَدِيدٍ (اگر وہ چاہے تو تمہیں لے جائے اور ایک نئی مخلوق لے آئے)۔ پس اس کا معنی یہ ہے کہ اگر وہ چاہے تو تمہیں ہر زمانے میں نئی مخلوق کے فرد کا شہود (الشہود) کرائے جس سے اللہ نے تمہاری نگاہوں کو ہٹا رکھا ہے۔ کیونکہ امر اپنی ذات میں ایسا ہی ہے، اور لوگ اس میں الجھن میں ہیں، سوائے اہل کشف (أهل الکشف) اور الوجود (ہستی) کے۔ پس اگر تم کہو کہ تم نے عین جوہر کے بقا کا قول کیا ہے، تو ہم کہیں گے کہ اس کا بقا اس کی عین کی وجہ سے نہیں ہے، بلکہ ان صورتوں کی وجہ سے ہے جو اس میں پیدا ہوتی ہیں۔ پس اس کی اللہ کی طرف احتیاج ہمیشہ باقی رہتی ہے۔ پس جوہر کا فقر اللہ کی طرف بقا کے لیے ہے، اور صورتوں کا فقر اللہ کی طرف ان کے وجود کے لیے ہے۔ پس سب عین فقر میں اللہ کی طرف محتاج ہیں، اور اللہ هُوَ الْغَنِيُّ الْحَمِيدُ (وہ غنی، تعریف کے لائق ہے) غنی ہونے کی وجہ سے، یعنی عالم سے بے نیاز ہونے کی صفت کے ساتھ جس کی تعریف کی جاتی ہے۔ اور اس منزل کے علوم میں سے ایک علم اعمال کو مخلوق کی طرف منسوب کرنا ہے، اور یہ بعض اہل نظر کا مذہب ہے، اور اس میں اختلاف اس کتاب میں پہلے گزر چکا ہے اور اس میں مذاہب اور ان کے اقوال کا بیان بھی۔ اور اس میں یہ علم ہے کہ ذات حق (الحق) اپنے بندوں کو سکھاتا ہے کہ وہ اس کے ساتھ کیسا معاملہ کریں جس طرح وہ اس کے ساتھ معاملہ کرتے ہیں، کیونکہ کوئی نفس کسی ایسے معاملے سے خالی نہیں جو اس کے ساتھ قائم ہو۔ اور اس میں انسان کی حقیقت پر تنبیہ کا علم ہے۔ اور اس میں عالم کے اختلاف کا علم ہے کہ وہ صورت اور حکم کے لحاظ سے کس چیز کی طرف لوٹتا ہے۔ اور اس میں بعض مخلوقات کی عنایت (العنایۃ) کا علم ہے، اور وہ عنایت خاصہ ہے۔ اور جہاں تک عنایت عامہ کا تعلق ہے، تو وہ اس کا ایجاد کرنا اور پورے عالم کا اس کی طرف محتاج ہونا ہے۔ اور اس میں خیر کے اعمال کا غیر خیر کے اعمال میں اور شر کے اعمال کا خیر کے اعمال میں تاثیر کا علم ہے۔ اور یہ کہ اعمال میں قوی، ضعیف کو ختم کر دیتا ہے۔ اور یہ کہ ممکن میں عدم، وجود سے زیادہ قوی ہے، کیونکہ ممکن کی نسبت عدم سے زیادہ قریب ہے بہ نسبت وجود کے۔ اور اسی لیے ممکن میں وجود پر عدم کو ترجیح حاصل ہوئی۔ پس عدم اس کی حضور ہے کیونکہ وہ سب سے پہلے ہے، اور وجود اس کے لیے عارضی ہے۔ اور اسی لیے ذات حق (الحق) ہمیشہ خالق رہتا ہے، کیونکہ عدم ممکنات کی صورتوں پر جانے اور اپنی طرف ذاتی رجوع کا حکم لگاتا ہے۔ پس عدم کا حکم ان صورتوں پر متوجہ ہوتا ہے جو موجود ہوئیں، اور واجب الوجود (واجب الوجود) کی طرف سے ایجاد کا حکم ہمیشہ ایک صورت کے بعد دوسری صورت کو وجود عطا کرتا ہے۔ پس ممکنات عدم کے لیے اعدام (معدوم کرنا) اور واجب الوجود کے لیے ایجاد کے درمیان ہیں۔ جہاں تک اس کا تعلق مشیت الٰہیہ سے ہے، تو یہ اللہ کے اسرار میں سے ایک راز ہے، جس پر اللہ نے اپنے قول إِنْ يَشَأْ يُذْهِبْكُمْ (اگر وہ چاہے تو تمہیں لے جائے) میں اہل فہم کے لیے گہرے اسرار کی طرف اشارہ کرتے ہوئے تنبیہ کی ہے کہ وہ ہر حکم سے موصوف ہر حقیقت کی عین ہے، خواہ وہ وجود ہو یا عدم، وجوب ہو یا امکان، یا محال ہو۔ پس وہاں کوئی حقیقت نہیں جو کسی حکم سے موصوف ہو مگر وہ وہی حقیقت ہے۔ اور یہ ایک مسئلہ ہے جو اس منزل میں شامل ہے، اور اگر یہ نہ ہوتا تو ہم اس کا ذکر نہ کرتے، کیونکہ اس کا ذکر اس کتاب میں پہلے نہیں آیا، اور تم اسے اس کے علاوہ کسی اور کتاب میں نہیں دیکھو گے، سوائے اللہ کی طرف سے نازل کردہ کتابوں جیسے قرآن وغیرہ کے، اور ہم نے اسے وہیں سے لیا ہے، اس فہم کے ذریعے جو اللہ نے ہمیں اپنے کلام میں عطا کیا ہے۔ اور اس میں یہ علم ہے کہ نماز کی عبادت کن اعمال کو مٹا دیتی ہے جنہیں شریعت نے مکلف کو کرنے سے منع کیا ہے۔ اور اس میں مجاورت (پڑوس) کی تاثیر کا علم ہے، اور اسی لیے اللہ تعالیٰ نے پڑوسی کے بارے میں وصیت کی ہے۔ اور اللہ نے عام لوگوں کی زبانوں پر ان کی مثالوں میں یہ بات جاری کی ہے کہ وہ کہتے ہیں: \"رفیق پہلے، راستہ بعد میں۔\" اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: اللهم أنت الصاحب في السفر (اے اللہ، تو ہی سفر میں ساتھی ہے) پس وہ اس کا رفیق ہے، والخليفة في الأهل (اور گھر والوں میں خلیفہ ہے) پس وہ اس کا وکیل ہے۔ اور فرعون کی بیوی کے کمال میں سے اس کا یہ قول ہے: رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً في الْجَنَّةِ (اے میرے رب، میرے لیے اپنے پاس جنت میں ایک گھر بنا دے)۔ پس اس نے گھر پر اپنے پاس ہونے کو مقدم کیا، اور یہی وہ بات ہے جس پر یہ مثل جاری ہوئی کہ وہ کہتے ہیں: \"پڑوسی پہلے، گھر بعد میں۔\" اور اللہ نے جوار (پڑوس) کی تاثیر کے بارے میں فرمایا: لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا إِذاً لَأَذَقْناكَ (یقیناً تم قریب تھے کہ ان کی طرف تھوڑا سا جھک جاؤ، تب ہم تمہیں چکھاتے)۔ اور فرمایا: ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ (اور ظالموں کی طرف مت جھکو، ورنہ تمہیں آگ چھو لے گی)۔ اور جو شخص تہمت کی جگہوں کے پڑوس میں رہتا ہے، وہ اسے ملامت نہ کرے جو اسے اس کی طرف منسوب کرے۔ اور اس میں الٰہی امر کا علم ہے کہ جب وہ نافذ نہ ہو تو اس کے نفاذ میں کیا رکاوٹ ہے، اور الٰہی امر کیا ہے، اور کیا اس کی کوئی صیغہ ہے یا نہیں؟ اور اس میں ہر عمل کرنے والے کو دنیا اور آخرت میں بدلہ ملنے کا علم ہے، جسے بھی ذات حق (الحق) یا خلق (مخلوق) میں سے بدلہ دیا، اور سب اللہ کا بدلہ ہے۔ پس کون میں خیر اور شر کا بدلہ ہی ہے۔ اور اس میں فرقوں کے درمیان فرق کا علم ہے، اور اسی لیے انہیں فرقے کہا گیا، اور اللہ کا جامع اور فرق کرنے والا حکم، اور وہ چیز جس میں عالم جمع ہوتا ہے اور جس میں وہ جدا ہوتا ہے۔ اور اس میں سعادت اور شقاوت کا علم ہے، اور اس میں سے کیا منقطع ہوتا ہے اور کیا منقطع نہیں ہوتا۔ اور اس میں دار آخرت کا علم ہے کہ وہ کیا ہے، اور اسے حیوان (زندگی) کے نام سے کیوں خاص کیا گیا، اور دنیا بھی اس صفت میں اس کی طرح ہے، اس پر یہ دلالت کرتا ہے: وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ (اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے)۔ اور اس میں یہ علم ہے کہ اگر اللہ جرائم پر مؤاخذہ کو دلالت نہ بناتا تو وہ اپنی مخلوق میں سے کسی کا بھی مؤاخذہ نہ کرتا۔ اور اس میں امام اور مقتدی کے امتیاز کا علم ہے، اور امامت میں ائمہ کے مراتب کا اختلاف، اور کس طرح سعید (خوش بخت) اشقیاء (بد بختوں) کا امام ہو سکتا ہے، اور دنیا میں امامت کے ذریعے اس کا حکم، اور آخرت میں اس کا حکم۔ جہاں تک آخرت کا تعلق ہے، تو اتباع عام ہو گا، لیکن وہاں اتباع میں سے کچھ وہ ہے جو حسنیٰ (اچھی جگہ) کے ٹھکانے کی طرف نہیں جائے گا، اور اس میں سے کچھ وہ ہے جسے دنیا میں اس کے امام کی ممانعت پہنچے گی، پس اسے آخرت میں اس کی اتباع سے پھیر دیا جائے گا، کیونکہ امام سعید ہے اور وہ پھیر دیا جانے والا متبع اہل سعادت میں سے نہیں ہے، پس ضروری ہے کہ اس کے اور اس کے امام کے درمیان رکاوٹ ڈال دی جائے۔ اور اس میں نصیحتوں کا علم ہے، اور وہ کس سے قبول کی جاتی ہیں، اور نصیحتوں میں عقل کا کیا حصہ ہے اور شریعت کا کیا حصہ ہے۔ اور اس میں اللہ کی اپنے صنعت اور مصنوعات میں عمومی محبت اور دوستی کا علم ہے، اور اسی لیے اس نے انہیں رحمت اور مغفرت کے ساتھ عام کیا اس کے لیے جو اللہ کی طرف سے عقل رکھتا ہے، کیونکہ وہ مومن ہے۔ اور مومن کی شان یہ ہے کہ اس کی کوئی معصیت ایسی نہیں ہوتی جس میں طاعت کی آمیزش نہ ہو، اسی طرح ذات حق (الحق) کا مومن ہونے کی حیثیت سے یہ ممکن نہیں کہ شقاوت (بد بختی) اس سے خالص ہو جائے جس میں رحمت نہ ہو۔ یہ تصور نہیں کیا جا سکتا، کیونکہ عالم پر رحمت وجود کے لحاظ سے ایک ذاتی اصل ہے، اور شقاوت ایک عارضی امر ہے، کیونکہ اس کا سبب عارضی ہے، اور وہ تکلیف کی مخالفت ہے، اور تکلیف عارضی ہے، اور اسے ختم ہونا ضروری ہے، پس اس کے ختم ہونے سے عوارض بھی ختم ہو جائیں گے، اگرچہ کچھ دیر بعد۔ اور اس میں مکلف میں احوال کی تبدیلی سے مشروع حکم کی تبدیلی کا علم ہے۔ اور اس میں معنوی میزانوں کا علم ہے جن سے معانی اور محسوسات کو تولا جاتا ہے، اور آخرت کے میزان کیا ہیں؟ کیا وہ عالم میں حکم کے ذریعے عدل قائم کرنا ہے، اس طرح کہ پورا عالم جان لے کہ اس پر اللہ کے حکم کے مطابق کوئی ظلم نہیں ہوا، یا کیا وہ دنیا میں چیزوں کو تولنے کے لیے محسوس میزانوں کی طرح محسوس ہیں؟ اور اگر بصارت کی حس آخرت میں محسوس میزانوں کو ادراک کرتی ہے، تو کیا وہ اسی طرح محسوس ہیں جیسا کہ حس انہیں ادراک کرتی ہے، یا وہ تمثیل ہیں جیسا کہ اعمال کی تمثیل ہوتی ہے؟ کیونکہ اعمال اعراض (عارضی صفات) ہیں اور وہ آخرت میں اشخاص (جسم) ہوں گے۔ پس تم جان لو کہ وہ تمثیل ہیں، کیونکہ حقائق تبدیل نہیں ہوتیں، اور جو اپنی ذات سے قائم نہ ہو اس کی حقیقت اس کی حقیقت سے مختلف ہے جو اپنی ذات سے قائم ہو۔ پس ضروری ہے کہ وہ تمثیل ہوں، جیسا کہ\n\nنبوی خبر میں آیا ہے کہ الموت (موت) کو ایک چتکبرے مینڈھے کی صورت میں لایا جائے گا۔\n\nاور یہ نہیں کہا کہ اسے چتکبرا مینڈھا بنا کر لایا جائے گا۔ اور موت ایک عرض (عارضی صفت) ہے، بلکہ ایک نسبت ہے۔ پس ضروری ہے کہ اس کے بارے میں عبارت اسی طرح ہو جیسا کہ نبوی خبر میں آئی ہے۔ اور اس میں دن میں اولیت کا علم ہے، کیونکہ وہ ایک دائرہ ہے، اور دائرے کے لیے ضروری ہے کہ وہ ایک آغاز سے شروع ہو اور اسی آغاز پر ختم ہو۔ کیونکہ دن فلک اطلس (غیر متحرک فلک) کا ایک چکر ہے، اور وہ رات اور دن سے الگ ہوا ہے سورج کے طلوع اور غروب سے۔ اور دن کا آغاز جو زمین کے ذریعے متعین ہوا فلک کی حرکت کے وقت، وہ برج حمل میں تھا۔ پھر دن کا آغاز سورج کے طلوع سے غروب تک ظاہر ہوا، اور اس کا وجود صرف برج حمل میں تھا، کیونکہ وہ اس کے شرف کا گھر ہے۔ پس وہ برج حمل میں طلوع ہوتا ہوا پایا گیا، پس دن کا آغاز ظاہر ہوا، اور صبح دن کا آخر ہے، اور ان کے درمیان رات اور دن ہیں، اور وہ طلوع اور غروب سے معلوم ہوتے ہیں۔ اور اسی لیے اللہ نے جن امتوں کو پکڑا، انہیں صرف دن کے آخر میں پکڑا، اور یہ حرکت کو پورا کرنے کے لیے تھا، جیسا کہ عنین (نامرد) کے ساتھ سال کے موسموں کے گزرنے کا انتظار کیا جاتا ہے، اور اس وقت اس کے اور اس کی بیوی کے درمیان تفریق کر دی جاتی ہے، کیونکہ طبیعت میں الٰہی تاثیر کے معتاد اسباب عنین پر گزر چکے ہیں اور اس پر اثر نہیں کیا، پس یہ دلالت کرتا ہے کہ اس میں نامردی ختم نہیں ہو گی، پس نکاح کا فائدہ، یعنی لذت اور نسل، ختم ہو گیا، پس ان کے درمیان تفریق کر دی گئی، کیونکہ نکاح لذت اور نسل دونوں کے لیے تھا، یا ایک گروہ کے حق میں کسی اور چیز کے لیے، اور دوسرے کے حق میں کسی اور چیز کے لیے، اور ایک اور گروہ کے حق میں مجموعی طور پر۔ اسی طرح جب دن کا چکر ختم ہوتا ہے تو الٰہی پکڑ اس کے آخر میں واقع ہوتی ہے۔ اور اس میں اجسام کی صورتوں میں ارواح کے مجسم ہونے کا علم ہے، کیا اس روح کی حقیقت وہی صورت ہے جس میں وہ ظاہر ہوئی، یا کیا یہ دیکھنے والے کی آنکھ میں ہے جیسا کہ ہم نے آسمان کی نیلاہٹ میں ذکر کیا، یا کیا وہ روح اس صورت کے لیے ایسی ہے جیسے ناطق نفس جسم کے لیے ہے، اور وہ صورت ایک حقیقی صورت ہے جس کا عینی وجود ہے، نہ کہ دیکھنے والے کی آنکھ میں، جیسے دیگر حقیقی صورتیں؟ اور یہ ایک ایسا مسئلہ ہے جسے بہت سے لوگوں نے، بلکہ تمام لوگوں نے نظر انداز کر دیا ہے، کیونکہ وہ ان مجسم ارواح کی صورتوں پر قناعت کر گئے جو ان کے لیے ظاہر ہوئیں۔ پس اگر وہ اپنے نفوس میں روحانیت اختیار کرتے اور اپنے اجسام پر صورتوں کا حکم لگاتے اور ان کی شکلیں اور صورتیں دیکھنے والے کی آنکھ میں بدل جاتیں، تو وہ اس وقت جان لیتے کہ ارواح کا مجسم ہونا کس چیز کی طرف لوٹتا ہے۔ کیونکہ یہ ذوق کا علم ہے، نہ کہ فکری نظر کا علم۔ اور ہم نے بیان کیا ہے کہ ہر وہ صورت جو عالم میں مجسم ہوئی، اس کے لیے ضروری ہے کہ ایک مدبر روح ہو، جو روح کل سے پھونکی گئی ہو، جو صورتوں میں ہے۔ اور جس نے یہ جان لیا کہ ارواح میں مجسم ہونے والی صورت، اگر وہ حیوان ہو تو اسے قتل کیا جائے، یا اگر وہ نبات ہو تو اسے کاٹا جائے، تو وہ برزخ کی طرف منتقل ہو جاتی ہے، اور یہ ضروری ہے، جیسا کہ ہم موت کے ذریعے منتقل ہوتے ہیں، اور اگر اس کے بعد اسے ادراک کیا جائے، تو اسے اسی طرح ادراک کیا جائے گا جیسے ہر مردہ حیوان، انسان اور غیر انسان کو ادراک کیا جاتا ہے۔ پس یہاں سے بھی، جب تم اس علم پر واقف ہو جاؤ گے، تو تم جان لو گے کہ مجسم ارواح کی صورتیں کس چیز کی طرف لوٹتی ہیں۔ اور اس میں اس حق کا علم ہے جو وارد ہونے والے مہمان کا اس پر حق ہے جس پر وہ وارد ہوا، اور سانسیں بندے پر ذات حق (الحق) کے واردات ہیں، اور ان کا حق ہے، اور وہ اس کی طرف لوٹ رہی ہیں جس کی طرف سے وہ وارد ہوئیں، پس اسے دیکھنا چاہیے کہ جب وہ وارد ہوں تو وہ ان کا کس چیز سے استقبال کرتا ہے، اور ان کے ساتھ کیا ادب لازم ہے، اس چیز کو لینے میں جو وہ لاتی ہیں، اور جب وہ اس سے پلٹ کر ذات حق (الحق) کی طرف واپس جائیں تو وہ انہیں کیا خلعت دیتا ہے۔ اور اس میں عادات اور ان کے خرق کا علم ہے، اور ان شبہات کو دور کرنا جو طبعی لوگ دیکھتے ہیں کہ وہ اپنی ذات سے فعل کرتی ہیں، اور حقیقت میں طبیعت کیا ہے، اور کون میں ظاہر ہونے والے آثار کس کی طرف لوٹتے ہیں۔ اور اس میں حیوانی انسان پر حیوان کی شرافت کا علم ہے۔ اور اس میں اختیار میں جبر کا علم ہے۔ اور اس میں ذات حق (الحق) کا اپنے آپ کو اکوان (مخلوقات) کے ساتھ سلوک اور احوال میں داخل کرنے کا علم ہے، کیا وہ ان کے ساتھ حفاظت کے لیے داخل ہوا، یا اس لیے کہ وہ اس چیز کا عامل ہے جس میں وہ ہیں، یا ان کے ساتھ صحبت اور عنایت (العنایۃ) کے لیے داخل ہوا، یا اس کی ذات اس دخول کا تقاضا کرتی ہے۔ اور اس میں غلاموں اور آزادوں کا علم ہے، اور وہ اعمال جو اجرت طلب کرتے ہیں، اور وہ کس سے طلب کرتے ہیں، کیونکہ عمل کرنے والا صرف اپنے لیے عمل کرتا ہے، پس وہ دوسرے سے اجرت کا حقدار کیسے ہوتا ہے۔ اور اس میں تجارت کے اسباب کا علم ہے جو زندگی کے ساتھ مخصوص ہیں۔ اور اس میں الٰہی اسماء کی خصوصیات کا علم ہے، اس نام کے حروف کی ترکیب کے لحاظ سے، یہاں تک کہ جب اسے کسی دوسری زبان میں ترجمہ کیا جائے تو اس میں وہ خاصیت نہیں رہتی۔ کیونکہ کلمے کے حروف کی ترکیب کا مزاج اور معدن، نبات یا حیوان کے جسم کا مزاج میں کوئی فرق نہیں ہے، کیونکہ حیوان کا جسم ایک نباتی جسم ہے جس میں حس کا اضافہ کیا گیا، پس اسے حیوان کہا گیا۔ اور اس میں طبعی حیوان پر آلام اور لذات کے داخل کرنے کا سبب کا علم ہے، اور عین وہ چیز جس سے ایک حیوان تکلیف محسوس کرتا ہے، دوسرا حیوان اس سے لذت محسوس کرتا ہے۔ اور اس میں ضعیف کا قوی میں تاثیر کا علم ہے، اور اس کی اصل موجودات میں نسبتوں کی تاثیر سے ہے، اور وہ عدمی امور ہیں، بلکہ ان کے سوا کوئی مؤثر نہیں ہے۔ اور اس میں اس شخص کا علم ہے جو جانتا ہے کہ وہ صرف اللہ کی طرف سے خبر دیتا ہے اور اسے اس چیز پر مؤاخذہ کیا جاتا ہے جو اس نے منسوب کی اور وہ ہلاک ہو جاتا ہے، اور دوسرا اپنے نفس کی طرف سے خبر دیتا ہے اور نجات پا جاتا ہے، اور تیسرا اللہ کی طرف سے خبر دیتا ہے اور نجات پا جاتا ہے۔ پس ہلاک ہونے والا وہ ہے جو عقد (عقیدہ) کی طرف سے خبر دیتا ہے، اور نجات پانے والا وہ ہے جو ذوق کی طرف سے خبر دیتا ہے۔ پس اہل اذواق اہل اللہ اور اس کے خاص اولیاء ہیں۔ اور اس میں نجات دلانے والی فرمانبرداری اور ہلاک کرنے والی فرمانبرداری کا علم ہے۔ اور اس میں عالم کی شکلوں اور اس کی تشکیل کا علم ہے، اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب سیصد و هفتاد و سوم» در معرفت منزل سه سری که در آب حکمی برتر (المفضل) ظاهر شدند‏\n\nمرتبه آن بر عالم (العالم) به واسطه عنایت (الهی) و بقای عالم تا ابدالآبدین است، هرچند صورت آن منتقل شود، و این از حضرت محمدیه (الحقیقة المحمدیة) است.\n\n> مقاماتی که بر هماهنگی (اتساق) *** برای ارواح شریف و والامقام دلالت دارند\n> من آنها را بر زبان می‌آورم، اما همنشینم نمی‌داند *** زیرا نور در عین تاریکی است\n> اگر تاریکی نبود، نوری وجود نداشت *** پس عین نقص با تمام (کمال) ظاهر می‌شود\n> هرگاه کسی که اضافه (نسبت) را می‌بیند، آن را بداند *** به عهدها و قیام‌ها مقید می‌شود\n> می‌بیند که هستی (الوجود) را انتهایی است *** و آغاز با پایان (الختام) ظاهر می‌شود\n> پس میان آغاز و پایان حائل شده است *** هستی (وجود) که با دوام، زوال نمی‌پذیرد.\n\n### [عالم (العالم) تماماً کتابی نوشته شده است]\n\nبدان، خداوند تو را یاری کند، که عالم (العالم) تماماً کتابی است نوشته شده بر پوستی گشوده (رَقٍّ مَنْشُورٍ) و آن هستی (الوجود) است. پس آن آشکار و گسترده است، نه درهم پیچیده، تا با گستردگی‌اش دانسته شود که برای رحمت آفریده شده است، و با ظهورش آنچه در آن است و آنچه بر آن دلالت می‌کند، تعقل و دانسته شود. و آن را کتاب قرار داد تا حروفش را به یکدیگر ضمیمه کند، و آن همان ترتیب عالم بر وجوهی است که ذکر کردیم، و ضمیمه کردن معانی آن به حروفش از «کتیبه» (لشکر) گرفته شده است. و اینکه گفتیم گستردگی‌اش برای رحمت است، از آن روست که از رحمت نازل شده است، چنانکه حق (تعالی) می‌فرماید: «تَنْزِيلٌ من الرَّحْمنِ الرَّحِيمِ كِتابٌ فُصِّلَتْ آياتُهُ قُرْآناً عَرَبِيًّا لِقَوْمٍ يَعْلَمُونَ» (این تنزیلی است از جانب [خدای] رحمان و رحیم، کتابی است که آیاتش به صورت قرآنی عربی برای قومی که می‌دانند، تفصیل داده شده است). و حق (تعالی) در این باره می‌فرماید: «كِتابٌ أُحْكِمَتْ آياتُهُ ثُمَّ فُصِّلَتْ من لَدُنْ حَكِيمٍ خَبِيرٍ» (کتابی است که آیاتش محکم شده، سپس از نزد حکیم آگاه تفصیل یافته است). پس احکام آیات در آن و تفصیل آنها را نمی‌شناسد مگر کسی که خداوند به او حکمت (الحکمة) و فصل الخطاب (قدرت داوری قاطع) عطا کرده باشد. و صورت حکمتی که حکیم آگاه (الحکیم الخبیر) به اهل عنایت (العنایة) عطا کرده است، علم به مراتب امور و آنچه موجودات و معلومات از حق (الحق) که برای آنهاست، استحقاق دارند؛ و آن، عطای الهیِ خلقت هر شیء به آن شیء است تا هر خلقی حق خود را به عطای کونی (جهانی) دریافت کند، به واسطه آنچه خداوند به ما داده است. پس ما به قوه می‌دانیم که هر موجودی در حدود خود مستحق چیست، و پس از آن، آن را به صورت آیات بالفعل برای کسی که تعقل می‌کند، تفصیل می‌دهیم، چنانکه خبیر حکیم (الخبیر الحکیم) آن را به من عطا کرده است. پس امور را در منازل خود فرود می‌آوریم و حقشان را به آنها می‌دهیم و از مرتبه‌شان تجاوز نمی‌کنیم. پس تفصیل آیات و دلالات از جانب مفصّل (تفصیل‌دهنده) زمانی است که آنها را با این شرط در جایگاه‌های خود قرار دهد؛ زیرا هر مفصّلی حکیم نیست، و این دلیلی است بر اینکه به او حکمت (الحکمة) و علم احکام آیات عطا نشده است. و رحمت او به آیات و موجوداتی که کتاب الهی هستند و جز عالم (العالم) نیستند، دلیلی است بر علم او به کسی که آن را نازل کرده است، و او جز رحمان رحیم نیست. و خاتمه امر چیزی جز عین سوابق آن نیست، و سوابق آن رحمان رحیم است. از اینجاست که مراتب عالم و سرانجام آن را می‌دانی که به سوی رحمت مطلقه است، هرچند در راه رنج کشیده و مشقت و سختی به او رسیده باشد. پس برخی از مردم به محض ورود به منزلی که به آن رسیده‌اند، به رحمت و آسایش دست می‌یابند، و آنان اهل بهشت هستند. و برخی دیگر رنج و مشقت و سختی راه با آنها باقی می‌ماند، بسته به مزاجشان، و چه بسا مدتی بیمار و رنجور شوند، سپس از درد خود منتقل شده و آسوده گردند، و آنان اهل آتشی هستند که اهل آنند، نه کسانی که از آن خارج شده و به بهشت می‌روند. پس آتش به اندازه خطاهایشان به آنها رسیده است، با وجود اینکه خداوند آنها را در آن میرانده است. زیرا آتش برای آن گروه منزلگاهی نیست که در آن سکونت کنند و با خانواده‌هایشان اقامت گزینند، بلکه آتش برای اینان منزلی از منازلی است که مسافر در راه خود در آن فرود می‌آید تا به منزل خود که خانواده‌اش در آن هستند، برسد. این معنای حکمت (الحکمة) و تفصیل (التفصیل) است. زیرا امور، یعنی ممکنات، در ذات خود در حال عدم متمایز هستند و خداوند سبحان آنها را می‌داند و بر همان صورتی که در نفس خود هستند، می‌بیند و به آنها امر به تکوین (هستی) می‌دهد، پس به امر او تکوّن می‌یابند. پس نزد خداوند اجمالی (الإجمال) وجود ندارد، همانطور که در اعیان ممکنات نیز اجمالی نیست، بلکه امر تماماً در نفس خود و در علم خداوند مفصل (مفصّل) است. و اجمال تنها نزد ما و در حق ما واقع شده و در ما ظاهر گشته است. پس کسی که تفصیل (التفصیل) را در عین اجمال (الإجمال) به صورت علم یا عین یا حق کشف کند، او کسی است که خداوند به او حکمت (الحکمة) و فصل الخطاب عطا کرده است، و آنان جز رسولان و ورثه (الورثة) نیستند. اما حکما، یعنی فلاسفه، حکمت نزد آنها عاریه است، زیرا آنها تفصیل را در اجمال نمی‌دانند. و صورت این امر، چنانکه صاحب این مقام که خداوند به او حکمت (الحکمة) عطا کرده است، می‌بیند، عنایت الهی است، و آن نزد حق (الحق) تعیین ارواح جزئی است که در اجسام مساوی و معتدل شده از طبیعت عنصری، از روح کلّی که به او اضافه شده، دمیده شده‌اند. و به همین دلیل ذکر شده است که خداوند آنها را پیش از اجسام آفرید، یعنی آنها را مقدر و معین کرد. کلّ، جسم است و صورت روح مدبّر آن، که بالقوه در این روح کلّیِ مضاف به او موجود است، و این در تفصیل بالفعل هنگام دمیدن ظاهر می‌شود، و آن همان نفس رحمانی برای صاحب کشف (الکشف) است. پس او در مرکبی که در دوات است، تمام آنچه در آن از حروف و کلمات و آنچه در بر دارد از صورتی که کاتب یا نقاش تصویر می‌کند، می‌بیند. و همه اینها کتاب است. پس می‌گوید در این مرکب از صور، فلان و فلان صورت وجود دارد. پس هنگامی که کاتب و نقاش یا نقاش بدون کاتب یا کاتب بدون نقاش، بر حسب آنچه صاحب کشف ذکر می‌کند، می‌آید، با آن مرکب می‌نویسد و تمام آنچه را که این مکاشف ذکر کرده است، ترسیم می‌کند، به طوری که نه چیزی اضافه می‌شود و نه کم می‌گردد. و این امر را کسی که در عرف عقلا «حکم» نامیده می‌شود، درک نمی‌کند. این بهره اهل کشف (الکشف) است، آنان کسانی هستند که خداوند به آنها حکمت (الحکمة) و فصل الخطاب عطا کرده است. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به ما امر کرده است که حق هر صاحب حقی را به او بدهیم، و این کار را نمی‌کنیم مگر اینکه بدانیم هر صاحب حقی چه حقی را مستحق است، و این جز با تبیین حق (الحق) برای ما ممکن نیست. و به همین دلیل خداوند آن را به خود نسبت داده و فرموده است: «وآتَيْناهُ الْحِكْمَةَ ومن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً» (و به او حکمت دادیم، و هر کس به او حکمت داده شود، خیر بسیاری به او داده شده است). پس آن را نمی‌داند مگر کسی که به او داده شده باشد، و آن هدیه‌ای از جانب خداوند (تعالی) است، همانطور که هستی (الوجود) اعیان ما را به ما بخشید در حالی که ما شیء وجودی نبودیم. پس علم الهی همان است که خداوند سبحان آن را با الهام و القاء و با نازل کردن روح الامین بر قلب او به او آموخت. و این کتاب نزد ما از همان نوع است. به خدا سوگند، من حتی یک حرف از آن را ننوشتم مگر به املای الهی و القای ربانی یا نفث روحانی در نهاد کیانی‌ام. این خلاصه امر است، با وجود اینکه ما رسولان تشریع‌کننده و پیامبران مکلف (به کسر لام، اسم فاعل) نیستیم، زیرا رسالت تشریع و نبوت تکلیف با رسول خدا محمد (صَلَّى اللهُ عَليهِ وسَلَّم) قطع شده است. پس از او رسولی نیست و پیامبری که تشریع کند یا تکلیف نماید، وجود ندارد. بلکه این علم و حکمت (الحکمة) و فهم از خداوند است در آنچه بر زبان رسولان و پیامبرانش (علیهم سلام الله) تشریع کرده است، و آنچه را که در لوح هستی (الوجود) از حروف عالم و کلمات حق (الحق) ترسیم و نوشته است. پس تنزیل (نزول وحی) پایان نمی‌پذیرد، بلکه در دنیا و آخرت دائمی است.\n\n> خداوند جسم مرا از طَیّ و خولان *** ایجاد کرد و خلقتم را معتدل ساخت و سامان داد\n> و حق (الحق) برای من روحی مطهر آفرید *** پس بنای دیگری مانند بنای من نیست\n> من روحی را می‌شناسم که بر من نازل می‌شد *** از بالای هفت آسمان با فرقان (تمییز)\n\nمنظور ما قول حق (تعالی) است: «إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً» (اگر از خدا پروا کنید، برای شما فرقان [قدرت تشخیص حق از باطل] قرار می‌دهد). و من در این باره ادعای نبوت از جانب خداوند نمی‌کنم، بلکه این جود و احسان است.\n\n> نبوت خانه‌ای است که میان ما بسته شده *** و با قفل ایمان محکم گشته است\n\nو این را گفتیم تا کسی توهم نکند که من و امثال من ادعای نبوت داریم. نه، به خدا سوگند، جز میراث و سلوک بر راه محمد رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) باقی نمانده است. به طور خاص، هرچند برای عموم مردم است، اما برای ما و امثال ما به طور خاص، از نبوت آنچه خداوند بر ما باقی گذاشته است، مانند مبشرات (بشارت‌های صادقه) و مکارم اخلاق و مانند حفظ قرآن هنگامی که انسان آن را از بر می‌کند. زیرا این و امثال آن از اجزای نبوت موروثی است. و به همین دلیل اولین انسانی که خداوند آفرید، یعنی آدم، پیامبر بود. هر کس پس از آن بر راه او گام نهد، وارث است، و این در این نشئه خاکی (النشأة الترابیة) ضروری است. اما در مقام (المقام)، آدم و مادون او تنها وارث محمد (صَلَّى اللهُ عَليهِ وسَلَّم) هستند، زیرا او پیامبر بود در حالی که آدم میان آب و گِل بود و هنوز موجود نشده بود. پس نبوت (النبوة) از آنِ محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است، نه آدم. و صورت طبیعی انسانی آدم از آنِ آدم است، و محمد (صَلَّى اللهُ عَليهِ وسَلَّم) صورتی ندارد. و بر آدم و بر همه پیامبران درود باد. پس آدم پدر اجسام انسانی است و محمد (صَلَّى اللهُ عَليهِ وسَلَّم) پدر ورثه از آدم تا خاتم امر از ورثه است. پس هر شریعتی که ظاهر شده و هر علمی، میراث محمدی است در هر زمان و برای هر رسول و پیامبری از آدم تا روز قیامت. و به همین دلیل جوامع الکلم (جامعیت کلمات) به او داده شد، و از جمله آن، تعلیم همه اسماء به آدم توسط خداوند بود. پس حکم کل در صورت آدمیه و صورت محمدیه ظاهر شد. در آدم، اسماء هستند و در محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، کلم (کلمات) هستند. و کلمات خداوند سبحان پایان نمی‌پذیرند و موجودات او از حیث جوهرشان دور نمی‌شوند، هرچند صورشان از بین برود و احکامشان دگرگون شود. پس عین (ذات) از بین نمی‌رود و دگرگون نمی‌شود، بلکه دگرگونی در عالم (العالم) به خاطر تحول حق (الحق) در صور (اشکال) رخ داده است. اگر دگرگونی در عالم ظاهر نمی‌شد، عالم کامل نمی‌گشت. پس هیچ حقیقت الهی باقی نمی‌ماند مگر آنکه عالم به آن استناد داشته باشد. علاوه بر این، تحقیق امر نزد اهل کشف (الکشف) این است که عین دگرگونی عالم، عین تحول الهی در صور است. پس عین اینکه در آنچه خواست تجلی کرد، عین این است که در آنچه خواست تو را ترکیب کرد: «ف ما تَشاؤُنَ إِلَّا أَنْ يَشاءَ الله» (و شما نمی‌خواهید مگر آنکه خدا بخواهد). پس آن در حقیقت مشیت خداوند است نه مشیت تو، و تو به واسطه آن می‌خواهی. پس حیات برای عین جوهر است و مرگ برای دگرگونی صور. همه اینها برای «لِيَبْلُوَكُمْ» (تا شما را بیازماید) به واسطه تکلیف «أَيُّكُمْ أَحْسَنُ عَمَلًا» (کدام یک از شما نیکوکارتر است) است. و شما را می‌آزماید تا نسبت اسم خبیر (آگاه) صحیح باشد. پس آن علم از روی خبرگی است. او می‌داند و خبرگی برای اقامه حجت بر کسی که نزاع و انکار در او آفریده شده، نیست. و این همه از تفصیل آیات در خطاب و در اعیان است. پس «هُوَ الْحَكِيمُ الْخَبِيرُ» (او حکیم آگاه است) و «هُوَ الْعَزِيزُ الْغَفُورُ» (او عزیز و آمرزنده است). اگر برای هر کس آنچه برای برخی از عالم کشف شده، کشف می‌شد، او غفور (آمرزنده) نبود و فضیلتی برای کسی بر دیگری نبود، زیرا فضیلت جز به فزونی علم به آنچه بوده است، نیست. پس عالم (العالم) تماماً فاضل و مفضول (برتر و فروتر) است. پس بالاترین علما با پایین‌ترین آنها در علم صنعت شریک هستند. عالم، صنعت خداوند است و علم به صنعت بافندگی، علم بافنده و صنعت اوست. و این در عموم، پایین‌ترین علوم است، اما در خصوص، علم صنعت بالاترین علوم است، زیرا حق (الحق) به واسطه صنعت در هستی (الوجود) ظاهر شده است. پس آن بزرگترین دلیل و واضح‌ترین راه و استوارترین گفتار است. و از اینجاست که خواص بزرگ خداوند در حکم به صورت عامه ظاهر شدند، پس مرتبه‌شان ناشناخته ماند و جز خودشان کسی آنها را نمی‌شناسد. و آنها در عالم مزیتی ندارند، برخلاف اصحاب احوال که در عموم متمایز هستند و با انگشت به آنها اشاره می‌شود، به دلیل خرق عاداتی که به واسطه حال بر آنها ظاهر شده است. و اهل الله از این امر پرهیز کردند، زیرا غیر همجنس نیز در آن با آنها شریک است. پس اهل الله به مقام (المقام) شناخته می‌شوند و به شهود (الشهود) ناشناخته می‌مانند. آنها شناخته نمی‌شوند، همانطور که خداوند که برای اهلش معلوم بالفطره نزد هر کسی است، نزد او به واسطه عقل و شهود (الشهود) ناشناخته است. اگر بر او تجلی کند، او را نمی‌شناسد، بلکه او پیوسته در حال تجلی است، اما جز نزد اهل و خواص خود معلوم نیست، و آنان اهل قرآن و اهل ذکر هستند که خداوند به ما امر کرده است از آنها بپرسیم، زیرا آنها جز از او خبر نمی‌دهند. حق (تعالی) می‌فرماید: «فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ» (پس از اهل ذکر بپرسید اگر نمی‌دانید). زیرا اهل ذکر همنشینان حق (الحق) هستند. پس ذاکری که خداوند را در خود شاهد است که او ذاکر اوست، جز از همنشین خود خبر نمی‌دهد، و امر را بر همان صورتی که هست، خبر می‌دهد، و آن همان علم است. زیرا او «عَلى‏ بَيِّنَةٍ من رَبِّهِ» (بر دلیل روشنی از پروردگارش است) و «يَتْلُوهُ شاهِدٌ مِنْهُ» (و شاهدی از او به دنبالش می‌آید)، و آن ظهور او به صورتش است، یعنی آنچه از علم از جانب خداوند آورده است، صفتی است که این شخص ذاکر به واسطه آن تجلی کرده است. پس به اندازه ذکر او، حق (الحق) پیوسته با او همنشین است. و به همین دلیل\n\nعایشه (رضی الله عنها) درباره رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «او در همه احوالش خدا را ذکر می‌کرد».\n\nپس او همنشینی دائمی با خداوند (تعالی) را برای او اثبات کرد. یا این را به کشف (الکشف) دانسته بود، یا رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در همنشینی با او این را به او خبر داده بود که از اخبار رسولان بر او قصه می‌گوید تا قلبش ثابت بماند، به دلیل نزاع امتش با او در آنچه از جانب خداوند آورده بود. و اگر او در این مرتبه و امثال آن نبود، فرقی میان او و دیگر بشر نبود، زیرا خداوند با آنهاست هر کجا که باشند: «أَيْنَ ما كانُوا» (هر کجا که باشند). پس ناگزیر باید با ذاکرین خود به معیت اختصاصی باشد، و در آنجا جز فزونی علم به او نیست که فضیلت را آشکار می‌سازد. پس هر ذاکری که در ذکر خود به مذکورش علمش فزونی نیابد، ذاکر نیست، هرچند با زبانش ذکر کند، زیرا ذاکر کسی است که ذکر تماماً او را فرا گیرد. پس او همنشین حق (الحق) است. پس حصول فایده ضروری است، زیرا عالم کریم که بخل در او تصور نمی‌شود، ناگزیر باید چیزی را به همنشین خود ببخشد که نزد او نبوده است، زیرا در آنجا بخل منافی جود نیست. پس تنها محل قابل باقی می‌ماند، و جز صاحب محل قابل، همنشینی نمی‌کند. پس او همنشین حق (الحق) است، و عالم (العالم) همنشین حق آنهاست از جایی که نمی‌دانند. و نهایت کار عامه اگر مؤمن باشند، این است که بدانند خداوند با آنهاست، و فایده این است که تو با خداوند باشی، نه اینکه او با تو باشد. و امر در نفس خود چنین است. پس هر کس با حق (الحق) باشد، ناگزیر حق را شهود (الشهود) می‌کند، و هر کس او را شهود کند، جز وجود علم نزد او نیست. پس اینها عطایای الهی هستند.\n\n> پس علم شریف‌ترین چیزی است که از عطایا داده می‌شود *** و کشف (الکشف) بزرگترین و واضح‌ترین راه است\n> اگر از خدای حق (الحق) درخواستی داری *** پس کشف (الکشف) را بخواه، زیرا خداوند آن را می‌بخشد\n> و بر در کوبیدن مداومت کن، اگرچه در بسته باشد *** ادعای کیان (هویت) و هستی (الوجود) خداوند آن را می‌گشاید\n\nپس هر علمی که حصولش از کشف (الکشف) پس از گشودن دری که جود الهی آن را عطا می‌کند و آشکار و واضح می‌سازد، نباشد، آن شعور (ادراک) است نه علم؛ زیرا از پشت در و درِ بسته حاصل شده است. و در، جز تو نیست. تو به حکم معنا و جایگاهت، آن درِ بسته‌ای. زیرا تو شعور داری که پشت این جسم و صورت ظاهری، معنای دیگری است که آن را نمی‌دانی، هرچند به آن شعور داشته باشی. پس صورت ظاهری یک لنگه در است و نفس لنگه دیگر. پس هنگامی که در را گشودی، لنگه‌ها از هم متمایز می‌شوند و آنچه پشت در است بر تو آشکار می‌گردد، و آن همان علم است. و تو آن را جز به تفصیل (التفصیل) ندیدی، زیرا میان دو لنگه در را جدا کردی تا این در تو متمایز شود. اگر در عبارت از حق (الحق) و خلق باشد، و آن تو و پروردگارت باشی، پس امر بر تو مشتبه شده و عین تو از پروردگارت متمایز نشده است. پس تا زمانی که در گشوده نشود، آن را تمییز نمی‌دهی. پس عین گشودن، معرفت (المعرفة) به در و فرق میان دو لنگه را به تو می‌دهد. پس ذات خود را می‌شناسی و پروردگارت را می‌شناسی، و آن همان قول رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) است: «من عرف نفسه عرف ربه» (هر کس خود را شناخت، پروردگارش را شناخت). پس شعور (ادراک) با بسته بودن در است و علم با گشوده شدن در. پس اگر دیدی که عالم (العالم) به آنچه گمان می‌کند عالم است، متهم است، پس او عالم نیست، و آن همان شعور است. و اگر تهمت در آنچه دانسته است برطرف شود، آن همان علم است، و می‌داند که در برای او گشوده شده و جود الهی آنچه پشت در است را برای او آشکار ساخته است. و بسیاری از مردم گمان می‌کنند که شعور، علم است، در حالی که چنین نیست. بهره شعور از علم تنها این است که بدانی پشت در امری به طور کلی وجود دارد، اما نمی‌دانی چیست. و به همین دلیل حق (تعالی) می‌فرماید: «وما عَلَّمْناهُ الشِّعْرَ» (و ما به او شعر نیاموختیم) به دلیل قول آنها که او شاعر است، سپس فرمود: «وما يَنْبَغِي لَهُ إِنْ هُوَ» (و شایسته او نیست، و او نیست) یعنی این کسی که او را فرستادیم، «إِلَّا ذِكْرٌ» (مگر ذکر)، یعنی آن را از همنشینی با حق (الحق) گرفته است، و «قُرْآنٌ مُبِينٌ» (و قرآنی آشکار)، یعنی آشکار و مفصل در عین جمع، و آن را از شعور نگرفته است. زیرا هر آنچه صاحب شعور در مشعور به (آنچه به آن شعور یافته) تعیین کند، حدس است، حتی اگر با امر موافق باشد، و علم باشد، اما او در آن بر بصیرت نیست. و شایسته نیست که عاقلی به امری دعوت کند مگر اینکه در آن امر بر بصیرت باشد، و آن این است که آن را به رؤیت و کشف (الکشف) بداند به طوری که در آن شک نکند. و این مقام مخصوص رسولان خداوند نیست، بلکه برای آنها و پیروان وارث آنهاست. و وارث نیست مگر کسی که تبعیت در قول و عمل و به ویژه حال باطن برای او کامل شده باشد. زیرا بر وارث واجب است که حال ظاهر را بپوشاند، چون آشکار کردن آن موقوف بر امر الهی واجب است. زیرا در دنیا فرع است و اصل، بطون (پنهانی) است. و به همین دلیل خداوند در دنیا به طور عمومی از بندگانش محجوب است، و در آخرت به طور عمومی بر بندگانش تجلی می‌کند. پس اگر بر کسی که بر او تجلی کرده است، به خصوص تجلی کند، مانند تجلی او بر کوه، همچنین آنچه از حال بر رسولان ظاهر شده است، از جهت دلالت بر صدق اوست تا برای مردم تشریع کند. و وارث دعوت‌کننده به چیزی است که این رسول مقرر کرده است و تشریع‌کننده نیست، پس نیازی به ظهور حال ندارد، چنانکه مشرّع به آن نیاز داشت. وارث بقای دعوت را در امت حفظ می‌کند و بهره او جز این نیست. حتی اگر وارث شریعتی بیاورد (که نمی‌آورد، اما اگر فرض کنیم)، امت آن را از او نمی‌پذیرد. پس اگر پذیرشی مانند آنچه برای رسول بود، نباشد، ظهور حال فایده‌ای ندارد. پس این را بدان. و آنچه خداوند از احوال بر آنها آشکار کرده است، به دست خداوند است، نه از روی تکلف و قصد بنده، و آن در امت «کرامت» نامیده می‌شود. پس آنچه ولیّ خدا و طالب او در آن تلاش می‌کند، تنها گشودن آن در است تا در احوال خود نزد خویش از جانب خداوند بر بصیرت باشد، نه اینکه با آن نزد خلقش ظاهر شود. پس او «عَلى‏ نُورٍ من رَبِّهِ» (بر نوری از پروردگارش است) و در مقام خود ثابت است و جز او چیزی او را متزلزل نمی‌کند. پس کرامت این نوع، علم او به خداوند و آنچه به او مربوط است از تفصیل (التفصیل) در اسماء حسنی و کلمات علیای اوست. پس می‌داند که چه بذری از آنچه خداوند در زمین طبیعت او کاشته است، هنگام تسویه و تعدیل آن، در آن وارد می‌شود، و چه عباراتی از آنچه در آن است و چه افعال عملی صنعتی بر مراتب خود از آن خارج می‌شود. زیرا آنچه از زمین خارج می‌شود، انواع مختلفی دارد و آن زینت زمین است. پس آنچه از زمین طبیعت انسان و جسم او خارج می‌شود، زینت اوست، از فصاحت در عبارت و افعال صنعتی محکم، همانطور که می‌داند چه چیزی از آسمان عقل او نازل می‌شود، به واسطه آنچه در شرع خود در معرفت (المعرفة) پروردگارش می‌نگرد، و آن همان تنزیل الهی بر قلب اوست. و آنچه از کلمات طیب او بر براق عمل صالح که او را به سوی خداوند بالا می‌برد، به آسمان عروج می‌کند، چنانکه حق (تعالی) می‌فرماید: «إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ» (کلمات طیب به سوی او بالا می‌رود) و آن چیزی است که از زمین خارج شده است، و «الْعَمَلُ الصَّالِحُ يَرْفَعُهُ» (و عمل صالح آن را بالا می‌برد) و آن نیز چیزی است که زمین آن را خارج کرده است. پس آنچه «يَنْزِلُ من السَّماءِ» (از آسمان نازل می‌شود) همان است که «يَلِجُ في الْأَرْضِ» (در زمین وارد می‌شود)، و آنچه از زمین خارج می‌شود، یعنی آنچه از آنچه در آن وارد شده، ظاهر گشته است، همان است که به آسمان عروج می‌کند. پس عین نازل شونده، عین وارد شونده است، و عین خارج شونده، عین عروج کننده است. پس امر، نر و ماده و نکاح و ولادت است. پس اعیان موجودند و احکام مشهودند و آجال محدودند و افعال مقصودند، که برخی از آنها بالعرض مذموم و بالذات محمود هستند.\n\n### [تفصیل (التفصیل) جز با عمل در هستی (الوجود) ظاهر نمی‌شود]\n\nسپس بدان که تفصیل (التفصیل) جز با عمل در هستی (الوجود) ظاهر نمی‌شود. اگر عامل آن را بر اساس تفصیل در اجمال (الإجمال) حکمت (الحکمة) تفصیل دهد، آن عمل صالح است. و اگر آن را بر غیر آن، با توجه به تفصیل انسان در آن، تفصیل دهد، آن عمل غیر صالح است. و بیشتر عمل غیر صالح در کسانی است که امور را با نظر عقلی تفصیل می‌دهند، نه با اعلام الهی. پس آنچه با اعلام الهی تفصیل داده شود، تماماً عمل صالح است. و آنچه با نظر عقلی تفصیل داده شود، برخی از آن صالح و برخی غیر صالح است، تنها نسبت به تفصیل آن، و همه آن نسبت به خداوند (تعالی) عمل صالح است، چنانکه می‌گوید نقص در هستی (الوجود) از کمال هستی است، و اگر بخواهی بگو از کمال عالم (العالم) است، زیرا اگر نقص از عالم کم می‌شد، عالم ناقص می‌بود. پس بفهم.\n\n### [فساد، تغییر حکم الهی است]\n\nو بدان که ما از روی ادب با علم الهی و حقیقت، به عمل غیر صالح و فساد قائل نبودیم، اما چون دیدیم در وضع الهی، خداوند از فساد برحذر داشته و فرموده است: «ولا تَبْغِ الْفَسادَ في الْأَرْضِ إِنَّ الله لا يُحِبُّ الْمُفْسِدِينَ» (و در زمین فساد مجویید، زیرا خداوند مفسدان را دوست ندارد)، و فرموده است: «تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ ولا فَساداً» (آن سرای آخرت را برای کسانی قرار می‌دهیم که در زمین برتری و فساد نمی‌خواهند)، و دیدیم که در عرف عقلا، بلکه همه مردم، ذکر فساد وجود دارد، به همین دلیل به ذکر آن اقدام کردیم. و ما به جای فساد می‌گفتیم: اظهار صورتی و ازاله صورتی دیگر، چنانکه امر در نفس خود به خاطر ترکیب خاص و نظام مزاج طبیعی چنین است. اما قول او: «إِنَّ الله لا يُحِبُّ الْمُفْسِدِينَ» (خداوند مفسدان را دوست ندارد)، منظور از آن تغییر حکم الهی است، نه تغییر عین و نه تبدیل صورت. و اما قول او: «عُلُوًّا في الْأَرْضِ» (برتری در زمین)، امری محقق است، زیرا زمین تا زمانی که زمین است، علو (برتری) را برای کسی که زمین از آن اوست، نمی‌پذیرد. و هر آنچه را که در آن بلند و سر به فلک کشیده می‌بینیم، کوه و میخ است که خداوند زمین را با آن سنگین کرده است تا از لرزش آن جلوگیری کند. پس کوه‌ها زمین نیستند. خداوند زمین را مانند کره، از اجزای خاکی و سنگی آفرید و خداوند برخی از آنها را به برخی دیگر ضمیمه کرد. پس هنگامی که خداوند آسمان را آفرید، زمین را پس از آن گستراند تا کسی که مکان برای او آفریده شده است، بر آن مستقر شود، و به همین دلیل لرزید. و اگر کره باقی می‌ماند، نمی‌لرزید. و کوه‌ها را نیافرید، پس خداوند سبحان کوه‌ها را آفرید و آنها را یکباره بر آن قرار داد و کوهی را به دور آب محیط بر آن قرار داد که برای آن مانند کمربند است. گفته شده است که اطراف گنبد آسمان بر آن است و آن کبودی که به آسمان نسبت می‌دهیم و آن را با آن توصیف می‌کنیم، آن رنگ برای جرم آسمان به دلیل دوری آن از تو در ادراک بصری است، همانطور که کوه‌ها را هنگامی که از تو دور می‌شوند، کبود می‌بینی، در حالی که کبودی برای آن نیست، مگر به دلیل دوری از دید چشم، همانطور که کوه دور از دید خود را سیاه می‌بینی، و هنگامی که به آن می‌رسی، ممکن است آنطور که دیدی نباشد. و ما برای تو بیان کردیم که رنگ‌ها بر دو قسم هستند: رنگی که به جسم رنگین قائم است، و رنگی که برای بصر هنگام نگاه به جسم به دلیل امری عارضی که میان بیننده و دیده شده قرار می‌گیرد، حادث می‌شود، مانند این و مانند رنگ‌هایی که در رنگین به رنگ حقیقی آن به دلیل هیئت‌هایی که عارض می‌شوند، حادث می‌شود و بیننده آن را بر غیر رنگ قائم به آن می‌بیند که آن را می‌شناسد. و آن مانند شبهات در ادله است، که آنها رنگ‌هایی هستند که رنگ نیستند. و بهره آنها از حقایق الهی این است: «وما رَمَيْتَ إِذْ رَمَيْتَ» (و تو پرتاب نکردی هنگامی که پرتاب کردی) و تو، تو نیستی. و مانند عالم (العالم) تماماً که در حقیقت خلق است نه خلق، یا حق است نه حق. و مانند خیال که حس است نه حس، و محسوس است نه محسوس، یعنی متخیَّل. و زمین منفعل از آب است که منفعل از هواست. زیرا هوا نزد ما اصل است، و به همین دلیل نزدیکترین نسبت را به عماء (ابر) دارد که همان نفس رحمان است. پس میان حرارت و رطوبت جمع شد. از حرارت آن رکن آتش ظاهر شد و از رطوبت آن رکن آب ظاهر شد. و از جمود آب، زمین بود. پس هوا فرزند نفس است که همان عماء است، و آتش و آب دو فرزند هوا هستند، و زمین فرزند فرزند است، و آن چیزی است که از آب منجمد شده است. و آنچه منجمد نشده، بر اصل خود آب باقی مانده است. و زمین بر روی آن آب است. و ما دیده‌ایم که رود فرات هنگامی که در زمستان در سرزمین‌های شمالی منجمد می‌شود، به زمین تبدیل می‌شود که کاروان‌ها و مردم و چهارپایان بر روی آن راه می‌روند، و آب از زیر آن یخ جاری است. و آن آب بر روی هواست، و هواست که رطوبت خود را به آن می‌رساند و عین و استقرار آن را حفظ می‌کند. زیرا هوا آب را هنگامی که حرکت می‌کند، جاری می‌سازد، و هنگامی که متراکم و ساکن می‌شود، آب بر روی آن ساکن می‌شود و آب در آن نفوذ نمی‌کند. و ما این را در لوله نی و امثال آن که سوراخ دارد، دیده‌ایم. اگر آن را پر از آب کنی و جای سوراخ بالایی لوله را ببندی، چیزی از آب از پایین لوله جاری نمی‌شود. و هنگامی که آن را برداری، آب جاری می‌شود. پس آن آب جز بر هوای ساکن به دلیل سکونش تکیه نکرده است، و آن صورتی است که تمام عالم (العالم) را فرا می‌گیرد. و هنگامی که هوا موج برمی‌دارد، باد نامیده می‌شود. و باد بوهای آنچه از خوش و ناخوش بر آن می‌گذرد را به مشام منتقل می‌کند، و همچنین سردی و گرمی اشیا را منتقل می‌کند. و به همین دلیل باد به سخن‌چینی توصیف می‌شود و به انتقال اخبار به شنوندگان توصیف می‌شود. و این امور که با آنها کامل می‌شود و از آنها خبر می‌دهد، جز به قوه شنوایی و بویایی به شنوندگان و بویایی‌کنندگان نمی‌رسد. و حرکات اجرام، هوا را به حرکت درمی‌آورد و نام باد را برای آن ایجاد می‌کند، و هوا اجرام را به حرکت درمی‌آورد و اجرام در آن حرکت می‌کنند. و اما خرق (شکاف)، چیزی جز خالی کردن فضاها از اشیا و مشغول کردن آنها به اشیایی غیر از آن اشیا نیست، زیرا در آنچه عالم (العالم) آن را آباد کرده است، خلأیی وجود ندارد، بلکه آنها استحالات صور هستند. پس صور، امور را ایجاد می‌کنند و صور، امور را از بین می‌برند. و جوهری که خلأ را پر کرده است، ثابت العین است و به چیزی استحاله نمی‌یابد و چیزی به آن استحاله نمی‌یابد. و اسماء الهی جز به ایجاد این صور و اختلاف آنها تعلق ندارند. و اما از بین رفتن آنها، به خاطر خودشان است.\n\nو اما از بین رفتن آنها، به خاطر چیزی است که ذات موجد آنها اقتضا می‌کند، و آن علم لطیفی است. زیرا آن کلام حق (الحق) از حق است، اما فهم‌ها در آن متفاوت است. زیرا به صور می‌گوید: «إِنْ يَشَأْ يُذْهِبْكُمْ ويَأْتِ بِخَلْقٍ جَدِيدٍ» (اگر بخواهد شما را از بین می‌برد و خلقی جدید می‌آورد). پس معنای آن این است که اگر بخواهد، در هر زمان، خلق جدیدی را که خداوند دیدگان شما را از آن گرفته است، به شما شهود (الشهود) می‌دهد. زیرا امر در نفس خود چنین است و مردم از آن در اشتباه هستند، مگر اهل کشف (الکشف) و هستی (الوجود). اگر بگویی: پس تو به بقای عین جوهر قائل شدی، می‌گوییم: بقای آن به خاطر عینش نیست، بلکه بقای آن به خاطر صورتی است که در آن حادث می‌شود. پس نیاز آن به خداوند پیوسته دائمی است. پس فقر جوهر به خداوند برای بقا است و فقر صور به خداوند برای وجودشان است. پس همه در عین فقر به خداوند هستند، و خداوند «هُوَ الْغَنِيُّ الْحَمِيدُ» (او بی‌نیاز ستوده است) به غنا، یعنی ستوده شده به صفت بی‌نیازی از عالم (العالم). و در این منزل از علوم، علم نسبت دادن اعمال به خلق است، و آن مذهب برخی از اهل نظر است، و اختلاف در آن پیش از این در این کتاب و حکایت مذاهب و اقوال آنها ذکر شده است. و در آن علم تعلیم حق (الحق) به بندگانش است که چگونه با او معامله کنند به آنچه با او معامله می‌کنند، زیرا هیچ نفسی از معامله‌ای که به واسطه آن قائم باشد، خالی نیست. و در آن علم تنبیه بر حقیقت انسان است. و در آن علم اختلاف عالم (العالم) است که به صورت و حکم به چه چیزی باز می‌گردد. و در آن علم عنایت (العنایة) به برخی از مخلوقات است، و آن عنایت خاصه است. و اما عنایت عامه، همان ایجاد آن و فقر تمام عالم به سوی خداوند (تعالی) است. و در آن علم تأثیر اعمال خیریه در اعمال غیر خیریه و اعمال شر در اعمال خیر است، و اینکه قوی از اعمال، ضعیف‌تر را از بین می‌برد. و اینکه عدم در ممکن قوی‌تر از وجود است، زیرا ممکن نزدیکترین نسبت را به عدم دارد تا به وجود. و به همین دلیل در ممکن بر وجود ترجیح یافته است. پس عدم، حضرت اوست، زیرا اسبق است و وجود برای او عارضی است. و به همین دلیل حق (الحق) پیوسته خلاق است، زیرا عدم بر صور ممکنات به از بین رفتن و بازگشت به سوی او حکم می‌کند، بازگشتی ذاتی. پس حکم عدم متوجه آنچه از صور موجود شده است، می‌شود، و حکم ایجاد از واجب الوجود پیوسته وجود عین صورتی پس از عین صورتی را می‌دهد. پس ممکنات میان اعدام برای عدم و ایجاد برای واجب الوجود هستند. و اما تعلق آن به مشیت الهی، سری از اسرار خداوند است که خداوند در قول خود: «إِنْ يَشَأْ يُذْهِبْكُمْ» (اگر بخواهد شما را از بین می‌برد) به آن تنبیه کرده است، از باب اشاره به اسرار غامض برای صاحبان فهم، که آن عین هر منعودی به هر حکمی از وجود یا عدم و وجوب و امکان و محال است. پس در آنجا عینی نیست که به حکمی توصیف شود مگر اینکه آن همان عین است. و این مسئله‌ای است که این منزل آن را در بر دارد، و اگر چنین نبود، آن را ذکر نمی‌کردیم، زیرا پیش از این در این کتاب ذکری از آن نشده است و آن را در غیر آن نخواهی دید، مگر در کتاب‌های نازل شده از نزد خداوند مانند قرآن و غیر آن. و ما آن را از آنها گرفته‌ایم، به واسطه فهمی که خداوند در کلامش به ما روزی کرده است. و در آن علم آنچه عبادت نماز از اعمالی که شرع از انجام آنها توسط مکلف نهی کرده است، محو می‌کند، وجود دارد. و در آن علم تأثیر مجاورت است، و به همین دلیل خداوند (تعالی) به همسایه سفارش کرده است. و خداوند بر زبان عامه در امثالشان جاری کرده است که می‌گویند: «رفیق قبل از راه». و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «اللهم أنت الصاحب في السفر» (خدایا تو همنشین در سفر هستی)، پس او رفیق اوست، «والخليفة في الأهل» (و جانشین در خانواده)، پس او وکیل اوست. و از کمال زن فرعون قول اوست: «رَبِّ ابْنِ لِي عِنْدَكَ بَيْتاً في الْجَنَّةِ» (پروردگارا، برای من نزد خود خانه‌ای در بهشت بنا کن)، پس او آن را بر خانه مقدم داشت، و آن همان چیزی است که مَثَل در قول آنها جاری شده است: «همسایه قبل از خانه». و خداوند در تأثیر همجواری می‌فرماید: «لَقَدْ كِدْتَ تَرْكَنُ إِلَيْهِمْ شَيْئاً قَلِيلًا إِذاً لَأَذَقْناكَ» (نزدیک بود اندکی به آنها تمایل پیدا کنی، در آن صورت به تو می‌چشاندیم). و فرمود: «ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ» (و به کسانی که ستم کرده‌اند تکیه نکنید که آتش شما را فرا می‌گیرد). و کسی که در جاهای تهمت‌آمیز همجواری کند، نباید کسی را که او را به آن نسبت می‌دهد، سرزنش کند. و در آن علم امر الهی است که اگر نافذ نشود، مانع نفوذ آن چیست؟ و امر الهی چیست؟ و آیا صورتی دارد یا خیر؟ و در آن علم مجازات هر عامل در دنیا و آخرت است، و اینکه چه کسی او را مجازات می‌کند، از حق (الحق) و خلق، و همه آنها جزای خداوند هستند. پس در هستی (الکون) جز جزا به خیر و شر نیست. و در آن علم فرق میان فرق است، و به همین دلیل فرق نامیده شدند. و حکم جامع و فارق خداوند چیست؟ و عالم (العالم) در چه چیزی جمع می‌شود و در چه چیزی متفرق می‌گردد؟ و در آن علم سعادت و شقاوت است، و آنچه از آن قطع می‌شود و آنچه قطع نمی‌شود. و در آن علم دار آخرت است که چیست و چرا به اسم حیوان (زندگی) اختصاص یافته است؟ و دنیا نیز مانند آن در این صفت است، و بر این دلالت می‌کند: «إِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ» (و هیچ چیزی نیست مگر اینکه با ستایش او تسبیح می‌گوید). و در آن علمی است که به واسطه آن دانسته می‌شود که اگر خداوند مؤاخذه بر جرائم را دلالت قرار نمی‌داد، خداوند هیچ یک از خلق خود را به طور کلی مؤاخذه نمی‌کرد. و در آن علم امتیاز امام و مأموم و اختلاف مراتب ائمه در امامت است. و چگونه سعید، امام اشقیا می‌شود؟ و حکم او به امامت در دنیا و حکم او به آن در آخرت. اما در آخرت، تبعیت عمومی است، اما از آن تبعیت، آنچه به قرارگاه حسنی (نیکی) زوال نمی‌یابد، و از آن، آنچه امتناع امام او در دنیا به او می‌رسد، پس در آخرت از تبعیت او منصرف می‌شود، زیرا امام سعادتمند است و آن متبع منصرف شده از اهل سعادت نیست. پس ناگزیر باید میان او و امامش حائل شود. و در آن علم نصایح است و اینکه از چه کسی پذیرفته می‌شود؟ و بهره عقل از نصایح چیست؟ و بهره شرع از آنها چیست؟ و در آن علم عموم ودّ (دوستی) و محبت خداوند در صنعت و مصنوعات اوست، و به همین دلیل آنها را به رحمت و غفران فرا گرفته است برای کسی که از خداوند تعقل کند، زیرا او مؤمن است. و از شأن مؤمن این است که هیچ معصیتی برای او خالص نمی‌شود که طاعتی با آن آمیخته نباشد. همچنین حق (الحق) از جهت مؤمن بودن، ممکن نیست که شقاوتی که در آن رحمتی نباشد، با این اسم خالص شود. این چیزی است که تصور نمی‌شود، زیرا رحمت به عالم (العالم) اصلی ذاتی به هستی (الوجود) است و شقاوت امری عارضی است، زیرا سبب آن عارضی است و آن مخالفت با تکلیف است، و تکلیف عارضی است و ناگزیر باید برداشته شود، پس عوارض با برداشته شدن آن برداشته می‌شوند، هرچند پس از مدتی باشد. و در آن علم تغییر حکم مشروع با تغییر احوال در مکلف است. و در آن علم موازین معنوی است که معانی و محسوسات با آن سنجیده می‌شوند. و موازین آخرت آیا اقامه عدل با حکم در عالم است، به طوری که تمام عالم بداند که هیچ ستمی در حکم بر او به آنچه خداوند بر او حکم کرده است، عارض نشده است؟ یا آیا محسوس است مانند موازین محسوس در دنیا برای سنجش اشیا؟ و اگر حس بینایی موازین محسوس در آخرت را نزد خود درک کند، آیا آن محسوس است همانطور که حس آن را درک می‌کند، یا ممثل است مانند تمثل اعمال؟ زیرا اعمال اعراض هستند و در آخرت اشخاص هستند. پس می‌دانی که ممثل هستند، زیرا حقایق دگرگون نمی‌شوند و حقیقت کسی که به خود قائم نیست، با حقیقت کسی که به خود قائم است، متفاوت است. پس ناگزیر باید ممثل باشد، چنانکه\n\nدر خبر نبوی آمده است: «مرگ به صورت قوچی ابلق آورده می‌شود».\n\nو نگفت: «قوچی ابلق آورده می‌شود». و مرگ عرض است، بلکه نسبت است. پس ناگزیر باید عبارت از آن همانطور باشد که در خبر نبوی آمده است. و در آن علم اولویت در روز است، زیرا آن دایره است و دایره ناگزیر باید آغاز و انتهایی به سوی آن آغاز داشته باشد. زیرا روز یک دور کامل برای فلک اطلس است و با طلوع و غروب خورشید به شب و روز جدا شده است. و اول روز که با زمین هنگام حرکت فلک معین شد، در برج حمل بود. سپس اول روز با طلوع خورشید تا غروب آن ظاهر شد، و وجودی برای آن نبود مگر در برج حمل، زیرا آن خانه شرف آن است. پس آن را در حال طلوع در برج حمل یافت، پس اول روز ظاهر شد و صبح آخر روز است، و آنچه میان آنهاست، شب و روز است و آنها با طلوع و غروب معلوم می‌شوند. و به همین دلیل خداوند هیچ امتی را نگرفت مگر در آخر روز، و آن برای استیفای حرکت است، همانطور که با عنّین (ناتوان جنسی) تا پایان فصول سال صبر می‌شود، و در آن هنگام میان او و زن، یعنی همسرش، جدایی می‌افتد، زیرا اسباب تأثیر الهی معتاد در طبیعت بر عنّین گذشته و در او تأثیر نکرده است. پس دلالت می‌کند که عنّه (ناتوانی) در او زوال نمی‌یابد. پس فایده نکاح از لذت و تناسل از بین رفته است. پس میان آنها جدایی می‌افتد، زیرا نکاح برای لذت و تناسل با هم بود، یا در حق گروهی دیگر برای فلان و در گروهی دیگر برای فلان، و در حق گروهی دیگر برای مجموع. و همچنین هنگامی که دوره روز به پایان می‌رسد، گرفتن الهی در آخر آن واقع می‌شود. و در آن علم تجسد ارواح در صور اجسام طبیعی است. آیا عین آن روح، عین صورتی است که در آن ظاهر شده است؟ یا آیا آن در عین بیننده است، همانطور که در کبودی آسمان ذکر کردیم؟ یا آیا روح برای آن صورت مانند روح برای جسم است، یعنی نفس ناطقه؟ و آن صورت، صورتی حقیقی است که وجود عینی دارد، نه در عین بیننده، مانند سایر صور حقیقی. و این مسئله‌ای است که بسیاری از مردم، بلکه همه مردم، از آن غفلت کرده‌اند، زیرا به آنچه از صور ارواح متجسد برای آنها ظاهر شده است، قناعت کرده‌اند. اگر در نفس خود روحانی می‌شدند و صور را بر اجسام خود حاکم می‌کردند و اشکال و صورشان در عین کسی که آنها را می‌بیند، دگرگون می‌شد، در آن هنگام می‌دانستند که تجسد ارواح به چه چیزی باز می‌گردد. زیرا آن علم ذوق است نه علم نظر فکری. و ما بیان کردیم که هر صورتی که در عالم (العالم) تجسد یابد، ناگزیر باید روحی مدبر از روح کلی که در صور دمیده شده است، داشته باشد. و کسی که بداند اگر صورت متجسد در ارواح کشته شود، اگر حیوان باشد، یا قطع شود، اگر گیاه باشد، ناگزیر به برزخ منتقل می‌شود، همانطور که ما با مرگ منتقل می‌شویم، و اینکه اگر پس از آن درک شود، تنها همانطور درک می‌شود که هر مرده‌ای از حیوان، انسان و غیر انسان، درک می‌شود. پس از اینجا نیز اگر بر علم این امر واقف شوی، می‌دانی که صور ارواح متجسد به چه چیزی باز می‌گردند. و در آن علم آنچه برای مهمان وارد شده از حق (الحق) بر کسی که بر او وارد شده است، وجود دارد. و انفاس، واردات حق بر بنده هستند و حقی دارند و به سوی کسی که از او وارد شده‌اند، باز می‌گردند. پس باید بنگرد که هنگام ورود آنها چگونه از آنها استقبال می‌کند و چه ادبی در گرفتن آنچه با خود می‌آورند، بر او لازم است و چه چیزی بر آنها می‌پوشاند هنگامی که از او برمی‌گردند و به سوی حق (الحق) باز می‌گردند. و در آن علم عادات و خرق آنها و دفع شبهاتی است که طبیعیون می‌بینند که آنها به ذات خود فعل می‌کنند. و طبیعت در حقیقت چیست؟ و آثار ظاهر در هستی (الکون) به چه کسی باز می‌گردد؟ و در آن علم شرافت حیوان بر انسان حیوانی است. و در آن علم جبر در اختیار است. و در آن علم داخل شدن حق (الحق) خود با اکوان در سلوک و احوال است. آیا برای حفظ با آنها داخل شده است؟ یا به دلیل اینکه او عامل آنچه آنها در آن هستند، با آنها داخل شده است؟ یا به دلیل مصاحبت و عنایت به آنها با آنها داخل شده است؟ یا ذات او آن داخل شدن با آنها را اقتضا می‌کند؟ و در آن علم بردگان و آزادگان است. و اعمالی که مزد می‌طلبند، کدامند؟ و از چه کسی طلب می‌شوند؟ زیرا عامل جز برای خود عمل نمی‌کند. پس به چه چیزی مستحق مزد از دیگری می‌شود؟ و در آن علم اسباب تجارت است که مخصوص به حیات است. و در آن علم خواص اسماء الهی از حیث ترکیب حروف آن اسم است، به طوری که اگر به زبان دیگری ترجمه شود، آن خاصیت را ندارد. زیرا فرقی میان مزاج حروف کلمه هنگامی که ترکیب می‌شوند و مزاج اجسام معدن یا گیاه یا جسم حیوان نیست. زیرا جسم حیوان، جسم نباتی است که حس به آن اضافه شده و حیوان نامیده شده است. و در آن علم سبب وارد کردن آلام و لذات بر حیوان طبیعی است. و عین آنچه یک حیوان با آن متألم می‌شود، حیوان دیگری با آن لذت می‌برد. و در آن علم تأثیر ضعیف‌تر در قوی‌تر است، و اصل آن از تأثیر نسبت‌ها در موجودات است، و آنها امور عدمی هستند، بلکه جز آنها مؤثری نیست. و در آن علم کسی است که می‌داند جز از خداوند خبر نمی‌دهد و به آنچه نسبت داده می‌شود، مؤاخذه می‌شود و هلاک می‌گردد، و دیگری از خود خبر می‌دهد و نجات می‌یابد، و دیگری از خداوند خبر می‌دهد و نجات می‌یابد. پس هلاک شونده کسی است که از عقد (اعتقاد) خبر می‌دهد و نجات یابنده کسی است که از ذوق خبر می‌دهد. پس اهل اذواق، اهل الله و خواص اولیای او هستند. و در آن علم انقیاد نجات‌بخش و انقیاد هلاک‌کننده است. و در آن علم اشکال عالم (العالم) و شکل‌گیری آن است. و «الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 8
}