{
  "id": 489,
  "title": {
    "ar": "الباب التاسع والثمانون وأربعمائة في معرفة حال قطب كان منزله أَنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ",
    "en": "Chapter Four Hundred and Eighty-Nine: Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was: <<أَنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ>> (that your wealth and your children are only a trial).",
    "ur": "باب چار سو نواسی (۴۸۹): اس قطب (القطب) کے حال کی معرفت کے بیان میں جس کا روحانی مقام یہ تھا: \"بے شک تمہارے اموال اور تمہاری اولاد ایک آزمائش (فِتْنَةٌ) ہیں۔\" (أَنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ)",
    "fa": "باب چهارصد و هشتاد و نهم در معرفت حال قطبی که منزل او این بود: «جز این نیست که اموال و فرزندان شما فتنه‌ای هستند» (أَنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ)."
  },
  "content": {
    "ar": "## «الباب التاسع والثمانون وأربعمائة في معرفة حال قطب كان منزله أَنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ»\n\n\n> الابتلاء بعين المال والولد *** هو البلاء الذي ما فيه تنفيس‏\n\n\n> فالمال كن فيكون الأمر أجمعه *** والابن صورته والمثل تقديس‏\n\n\n> به تعلق نفي المثل فأحظ به *** فأصله هو سبوح وقدوس‏\n\n\n> فانظر إلى خلقنا على التطابق في *** أسمائه فيه تمثيل وتجنيس‏\n\n\n### [من زينة الحياة الدنيا المال والبنون‏]\n\n\nقال الله تعالى الْمالُ والْبَنُونَ زِينَةُ الْحَياةِ الدُّنْيا والْباقِياتُ الصَّالِحاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَواباً وخَيْرٌ أَمَلًا وقال عليه الصلاة والسلام بموت ابن آدم وينقطع عمله إلا من ثلاث صدقة جارية أو علم يبثه في الناس أو ولد صالح يدعو له‏\n\n\nفقد جمع المال والبنون زينة الحياة الدنيا وما تعطيه الباقيات الصالحات من الخير عند ربه وهو الثواب ومن الخير المؤمل وهو\nالبنون لأنهما من الباقيات الصالحات أعني المال والبنين إذا كان المال الصالح والولد الصالح وأما العلم المذكور في هذا الخبر فهو ما سنه من سنة حسنة وجعل الله المال والولد فتنة يختبر بهما عباده لأن لهما بالقلب لصوقا وهما محبوبان طبعا ويتوصل بهما ولا سيما بالمال إلى ما لا يتوصل بغير المال من أمور الخير والشرفان غلب على العبد الطبع لم يقف في التصرف بماله عند حد بل ينال به جميع أغراضه وإن غلب على العبد الشرع وقف في التصرف في ما له عند ما حد له فيه ربه فلم ينل به جميع أغراضه وما سمي المال ما لا إلا لكون القلب مال إليه لما فيه من بلوغ العبد إذا كان صالحا إلى جميع الخيرات التي يجدها عند ربه في المنقلب وإذا لم يكن تام الصلاح فلما فيه من بلوغه أغراضه به وأما الولد فلما كان لأبويه عليه ولادة أحباه وما لا إليه ميل الفاعل إلى ما انفعل عنه وميل الصانع إلى مصنوعه فميله لحب الولد ميل ذاتي فإن كرهه فبأمر عارض لأخلاق ذميمة وصفات شريرة نقوم بالولد فبغضه عرضي فيطلع من هذا الهجير على سبب رحمة الله التي وسعت كل شي‏ء فإن العالم المكلف كله مصنوعه وهو من جملة من ظهرت فيه صنعته فلا بد أن يكون بالذات محبوبا لموجده حبا بالأصالة وإذا وقع عليه كره فمن بعض أفعاله وأفعاله عرضية ومع كونها عرضية ففيها ما يؤيد الأصالة وهو أن جميع الأفعال الظاهرة من العالم كلها لله والعالم محل لظهور تلك الأفعال أو هي للحق كالآلة للصانع فغلبت الرحمة والمحبة وتأخر حكم الغضب وليس تأخره إلا عبارة عن إزالة دوام حكمه وما فتن الله من فتن من عباده إلا بحكم ما ظهر عليهم من الدعاوي فيما يتصرفون فيه إن ذلك الفعل لهم حقيقة أو كسبا فلو أطلعهم الله على اليد الإلهية الخالقة ورأوا نفوسهم آلات صناعية لا يمكن وقوع غير ذلك لما اختبرهم الله فما اختبرهم إلا ليعثروا على مثل هذا العلم فيعصموا من الدعوى فيسعدوا ف فَمِنْهُمْ من هَدَى الله ومِنْهُمْ من حَقَّتْ عَلَيْهِ الضَّلالَةُ فحار ولم يدر وهم القائلون بالكسب ومنهم فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ وهم القائلون بخلق الأفعال وأما الذين هداهم الله فهم الذين أعطوا كل آية وردت في القرآن أو عن الله أو خبر نبوي حقها ولم يتعدوا بها موطنها ولا صرفوها إلى غير وجهتها فما يوجب الحيرة منها كان هداهم فيها الوقوف في الحيرة فلو تعدوها ما أعطوا الآية حقها مثل قوله تعالى والله خَلَقَكُمْ وما تَعْمَلُونَ وهي أعظم آية وردت في ثبوت الحيرة في العالم فمن وقف مع المقالة المشروعة وجعل لها الحكم على ما أعطاه النظر العقلي من نقيض ما دل عليه الشرع فذلك السالم الناجي ومن زاد على الوقوف العمل بالتقوى جعل الله له فرقانا يفرق به بين أصحاب النحل والملل وما تعطيه الأدلة العقلية التي تزيل حكم الشرع عند القائل بها فيتأولها ليردها إلى دليل عقله فهو على خطر وإن أصاب فعليك بفرقان التقوى فإنه عن شهود وصحة وجود والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ الهادي إلى طريق مستقيم‏\n\n",
    "en": "## Chapter 489: On the Gnosis of the State of a Pole whose Station was: \"Your wealth and your children are only a trial (فتنة)\"\n\nThe trial by the very essence of wealth and progeny / Is the affliction from which there is no respite.\nFor wealth is the *Kun* (Be!) by which the entire affair comes into being, / And the son is its form, and the likeness is sanctification.\nTo it relates the negation of likeness, so take your portion of it, / For its origin is the Glorified and the Holy.\nSo look at our creation, in conformity with His Names, / In which there is representation and homogeneity.\n\n### [From the Adornment of the Worldly Life: Wealth and Sons]\n\nAllah the Exalted said: <<Wealth and sons are the adornment of the worldly life, but the enduring good deeds (الباقيات الصالحات) are better with your Lord in reward and better in hope.>> And the Prophet, peace and blessings be upon him, said: \"When the son of Adam dies, his deeds cease except for three: an ongoing charity (صدقة جارية), knowledge that benefits people, or a righteous child (ولد صالح) who prays for him.\"\n\nThus, wealth and sons combine the adornment of the worldly life and what the enduring good deeds (الباقيات الصالحات) bestow of goodness with their Lord, which is the reward (الثواب), and of hoped-for goodness, which is the sons. This is because both wealth and sons are among the enduring good deeds—meaning wealth and sons—when the wealth is righteous (المال الصالح) and the child is righteous (الولد الصالح). As for the knowledge mentioned in this report, it is what one establishes as a good precedent (*sunnah hasanah*).\n\nAllah made wealth and progeny a trial (فتنة) by which He tests His servants, because they cling to the heart and are naturally beloved. Through them—especially wealth—one can attain matters of goodness and honor that cannot be attained otherwise. If the natural disposition (الطبع) overcomes the servant, he will not stop at any limit in disposing of his wealth, but will attain all his aims through it. But if the Divine Law (الشرع) overcomes the servant, he will stop in the disposal of his wealth at the limits set for him by his Lord, and thus will not attain all his aims through it.\n\nWealth (المال) was only named *mal* (that to which one inclines) because the heart inclines (*mala*) toward it, due to its capacity to enable the servant, if he is righteous, to reach all the good things he will find with his Lord in the return (المنقلب). If he is not perfectly righteous, it is because of its capacity to enable him to reach his aims.\n\nAs for the child (الولد), because the parents brought him into being, they love him. The inclination toward him is like the inclination of the active principle toward that which is acted upon, and the inclination of the Maker (الصانع) toward His artifact. Thus, the inclination to love the child is an essential inclination (ميل ذاتي). If one hates the child, it is due to an accidental matter (أمر عارض), such as blameworthy character traits or wicked qualities that arise in the child; thus, the hatred is accidental (عرضي).\n\nFrom this deep insight, one discovers the reason for Allah’s Mercy (رحمة الله) which encompasses everything. For the entire responsible world (العالم المكلف) is His artifact (مصنوعه), and it is among those things in which His making (صنعته) has appeared. Therefore, it must be essentially beloved to its Originator, a love rooted in originality (حبا بالأصالة). If hatred falls upon it, it is due to some of its acts, and its acts are accidental (عرضية). Despite their being accidental, there is that within them which supports the essential nature: namely, that all the manifest acts (الأفعال الظاهرة) originating from the world are entirely for Allah. The world is merely the locus for the manifestation of those acts, or they belong to the Real (الحق) like a tool belongs to the craftsman (الصانع). Thus, Mercy (الرحمة) and Love (المحبة) prevail, and the ruling of Wrath (الغضب) is deferred. And its deferral is nothing but an expression of the removal of the permanence of its ruling.\n\nAllah only tests (فتن) those of His servants whom He tests due to the claims (الدعاوي) that appear from them regarding their actions—that the act belongs to them, either in reality or by acquisition (كسب). If Allah had unveiled to them the Divine Creating Hand (اليد الإلهية الخالقة) and they had seen their souls as mere industrial tools (آلات صناعية) from which nothing else could possibly occur, Allah would not have tested them. He only tested them so that they might discover knowledge such as this, and thus be protected from the claim (الدعوى), and be blessed.\n\n<<So among them are those whom Allah guided, and among them are those upon whom error was justly decreed.>> (Q 16:36) These became confused and did not know—and they are those who affirm acquisition (الكسب). And among them are those <<upon whom the word of punishment was justly decreed>> (Q 39:19)—and they are those who affirm the creation of acts (خلق الأفعال).\n\nAs for those whom Allah guided, they are those who gave every verse (آية) that came in the Quran, or from Allah, or in a prophetic report, its due right. They did not transgress its station (موطنها) nor divert it from its proper direction. Thus, whatever caused perplexity (الحيرة) among these verses, their guidance lay in stopping at that perplexity. Had they transgressed it, they would not have given the verse its due right. An example is His saying, the Exalted: <<And Allah created you and what you do.>> (Q 37:96) This is the greatest verse that establishes perplexity (الحيرة) in the world (العالم).\n\nSo whoever stops at the prescribed doctrine (المقالة المشروعة) and allows it to rule over what rational consideration (النظر العقلي) provides—which is the opposite of what the Divine Law (الشرع) indicates—that person is the safe and saved one (السالم الناجي). And whoever adds to this stopping the practice of piety (التقوى), Allah grants him a criterion (فرقان) by which he distinguishes between the adherents of sects and religions.\n\nAnd as for what rational proofs (الأدلة العقلية) provide—which, according to those who affirm them, removes the ruling of the Divine Law—and he interprets the Law allegorically to return it to his rational proof, he is in danger, even if he happens to be correct. Therefore, adhere to the criterion of piety (فرقان التقوى), for it proceeds from witnessing (شهود) and soundness of existence (صحة وجود). <<And Allah speaks the Truth, and He guides to the way>> (Q 33:4), the Guide to a straight path.",
    "ur": "باب نمبر چار سو نواسی: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا کہ \"تمہارے اموال اور تمہاری اولاد محض ایک آزمائش ہیں\" (أَنَّما أَمْوالُكُمْ وأَوْلادُكُمْ فِتْنَةٌ)۔\n\nمال اور اولاد کی عین ذات سے آزمائش (الابتلاء بعين المال والولد) *** وہ بلا ہے جس میں کوئی راحت نہیں (هو البلاء الذي ما فيه تنفيس‏)\n\nپس مال تو \"کُن فیکون\" (ہو جا، پس وہ ہو جاتا ہے) کا مجموعی امر ہے (فالمال كن فيكون الأمر أجمعه) *** اور بیٹا اس کی صورت ہے، اور مثال پاکیزگی ہے (والمثل تقديس‏)\n\nاس سے تعلق نفی المثل (مثال کی نفی) کا ہے، پس اس سے حصہ حاصل کر (به تعلق نفي المثل فأحظ به) *** کیونکہ اس کی اصل سبوح (پاک) اور قدوس (مقدس) ہے (فأصله هو سبوح وقدوس‏)\n\nپس ہماری تخلیق کو دیکھو جو اس کے اسماء میں مطابقت پر ہے (فانظر إلى خلقنا على التطابق في) *** اس میں تمثیل اور تجنیس (ہم جنسی) موجود ہے (فيه تمثيل وتجنيس‏)\n\n### [مال اور بیٹے دنیاوی زندگی کی زینت میں سے ہیں]\n\nاللہ تعالیٰ نے فرمایا: \"مال اور بیٹے دنیاوی زندگی کی زینت ہیں (الْمالُ والْبَنُونَ زِينَةُ الْحَياةِ الدُّنْيا)، اور باقی رہنے والی نیکیاں (الْباقِياتُ الصَّالِحاتُ) تیرے رب کے نزدیک ثواب کے لحاظ سے بہتر ہیں اور امید کے لحاظ سے بھی بہتر ہیں (خَيْرٌ عِنْدَ رَبِّكَ ثَواباً وخَيْرٌ أَمَلًا)\"۔\n\nاور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"جب ابن آدم مر جاتا ہے تو اس کا عمل منقطع ہو جاتا ہے سوائے تین چیزوں کے: صدقہ جاریہ، یا وہ علم جو لوگوں میں پھیلائے، یا نیک بیٹا جو اس کے لیے دعا کرے\"۔\n\nپس مال اور بیٹوں نے دنیاوی زندگی کی زینت کو جمع کیا، اور وہ خیر بھی جو باقی رہنے والی نیکیاں (الباقيات الصالحات) اپنے رب کے ہاں دیتی ہیں، جو کہ ثواب ہے، اور وہ خیر جس کی امید کی جاتی ہے، جو کہ بیٹے ہیں، کیونکہ وہ باقی رہنے والی نیکیوں (الباقيات الصالحات) میں سے ہیں— میرا مطلب ہے مال اور بیٹے— جب مال صالح ہو اور بیٹا صالح ہو۔ اور اس حدیث میں مذکور علم وہ ہے جو اس نے کسی اچھی سنت (سنة حسنة) کی بنیاد رکھی۔\n\nاور اللہ نے مال اور اولاد کو فتنہ (آزمائش) بنایا ہے جس کے ذریعے وہ اپنے بندوں کو آزماتا ہے، کیونکہ ان دونوں کو دل سے گہرا لگاؤ ہوتا ہے اور وہ طبعاً محبوب ہوتے ہیں۔ اور ان کے ذریعے، خاص طور پر مال کے ذریعے، ان چیزوں تک رسائی حاصل کی جاتی ہے جو مال کے بغیر حاصل نہیں ہو سکتیں، جیسے کہ خیر کے امور اور شرف۔\n\nاگر بندے پر طبع (فطرت) غالب آ جائے تو وہ اپنے مال کے تصرف میں کسی حد پر نہیں رکتا، بلکہ اس سے اپنے تمام مقاصد حاصل کرتا ہے۔ اور اگر بندے پر شرع (شریعت) غالب آ جائے تو وہ اپنے مال کے تصرف میں اس حد پر رک جاتا ہے جو اس کے رب نے اس کے لیے مقرر کی ہے، پس وہ اس سے اپنے تمام مقاصد حاصل نہیں کرتا۔\n\nاور مال کو مال (Māl) اسی لیے کہا گیا ہے کہ دل اس کی طرف مائل ہوتا ہے (مال إليه)، کیونکہ اگر بندہ صالح ہو تو اس میں وہ تمام خیرات حاصل کرنے کی صلاحیت ہوتی ہے جو وہ بازگشت (المنقلب) میں اپنے رب کے پاس پائے گا۔ اور اگر وہ مکمل طور پر صالح نہ ہو، تو اس میں اپنے مقاصد کو اس کے ذریعے حاصل کرنے کی صلاحیت ہوتی ہے۔\n\nاور جہاں تک اولاد کا تعلق ہے، چونکہ والدین نے اسے جنم دیا ہے، اس لیے وہ اس سے محبت کرتے ہیں۔ اور یہ میلان فاعل (کرنے والے) کا اس چیز کی طرف میلان ہے جو اس کے فعل سے وجود میں آئی، اور صانع (بنانے والے) کا اپنی مصنوع (بنائی ہوئی چیز) کی طرف میلان ہے۔ پس اولاد کی محبت کا میلان ذاتی ہے۔ اگر وہ اس سے نفرت کرتا ہے تو یہ کسی عارضی امر کی وجہ سے ہوتا ہے، جیسے اولاد میں پائی جانے والی بری عادات اور شرارتی صفات۔ پس اس کی نفرت عرضی (عارضی) ہے۔\n\nپس اس مثال سے اللہ کی رحمت کا سبب ظاہر ہوتا ہے جس نے ہر چیز کو گھیر رکھا ہے (وسعت کل شیء)۔ کیونکہ تمام مکلف عالم اس کی مصنوع (بنائی ہوئی چیز) ہے، اور وہ ان میں سے ہے جن میں اس کی صنعت ظاہر ہوئی ہے۔ لہٰذا، یہ ضروری ہے کہ وہ اپنی ذات کے اعتبار سے اپنے موجد (وجود بخشنے والے) کا محبوب ہو، محبت بالاصالہ (بنیادی محبت) کے ساتھ۔ اور اگر اس پر کوئی ناپسندیدگی واقع ہوتی ہے تو وہ اس کے بعض افعال کی وجہ سے ہوتی ہے، اور اس کے افعال عرضی (عارضی) ہیں۔\n\nاور ان کے عرضی ہونے کے باوجود، ان میں وہ چیز ہے جو اصالت (بنیادی حیثیت) کی تائید کرتی ہے، اور وہ یہ ہے کہ عالم سے ظاہر ہونے والے تمام افعال اللہ کے لیے ہیں، اور عالم ان افعال کے ظہور کا محل ہے، یا وہ ذات حق (الحق) کے لیے ایسے ہیں جیسے صانع کے لیے آلہ۔ پس رحمت اور محبت غالب آ گئی، اور غضب کا حکم مؤخر ہو گیا۔ اور اس کا مؤخر ہونا صرف اس کے حکم کے دوام کو زائل کرنے کا اظہار ہے۔\n\nاور اللہ نے اپنے بندوں میں سے جس کو بھی آزمایا (فتن)، تو صرف ان دعووں کے حکم کی وجہ سے جو ان پر ظاہر ہوئے کہ جس چیز میں وہ تصرف کرتے ہیں وہ فعل حقیقت میں ان کا ہے یا کسب (کسب) کے ذریعے ہے۔ اگر اللہ انہیں خالق کی الٰہی قدرت (الید الإلهیة الخالقة) پر مطلع کر دیتا اور وہ اپنے آپ کو صنعتی آلات کے طور پر دیکھتے جن سے اس کے سوا کچھ واقع ہونا ممکن نہیں، تو اللہ انہیں آزماتا ہی نہیں۔\n\nپس اللہ نے انہیں صرف اس لیے آزمایا تاکہ وہ اس طرح کے علم پر ٹھوکر کھائیں، اور دعوے سے محفوظ ہو جائیں، اور سعادت مند ہوں۔ پس \"ان میں سے بعض وہ ہیں جنہیں اللہ نے ہدایت دی اور ان میں سے بعض وہ ہیں جن پر گمراہی ثابت ہو چکی (فَمِنْهُمْ من هَدَى الله ومِنْهُمْ من حَقَّتْ عَلَيْهِ الضَّلالَةُ)\"۔ پس وہ حیران ہوئے اور نہ جان سکے، اور یہ وہ ہیں جو کسب (کسب) کے قائل ہیں۔ اور ان میں سے وہ ہیں \"جن پر عذاب کا کلمہ ثابت ہو چکا (فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ)\"، اور یہ وہ ہیں جو افعال کی تخلیق کے قائل ہیں۔\n\nاور جنہیں اللہ نے ہدایت دی، وہ وہ ہیں جنہوں نے قرآن میں یا اللہ کی طرف سے یا نبوی خبر میں وارد ہونے والی ہر آیت کو اس کا حق دیا، اور اسے اس کے مقام سے تجاوز نہیں کرایا، اور نہ ہی اسے اس کی سمت سے پھیرا۔ پس جو چیز ان میں حیرت پیدا کرتی تھی، ان کی ہدایت اس میں یہ تھی کہ وہ حیرت میں رک جائیں۔ اگر وہ اس سے تجاوز کرتے تو وہ آیت کو اس کا حق نہ دیتے۔ جیسے اللہ تعالیٰ کا یہ قول: \"اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا (والله خَلَقَكُمْ وما تَعْمَلُونَ)\"۔ اور یہ سب سے بڑی آیت ہے جو عالم میں حیرت کے ثبوت میں وارد ہوئی ہے۔\n\nپس جو شخص مشروع مقالے کے ساتھ ٹھہرا رہا اور اس کے لیے وہ حکم رکھا جو عقلی نظر نے اس کے برعکس دیا جس پر شرع نے دلالت کی، تو وہ شخص سالم اور نجات پانے والا ہے۔ اور جس نے ٹھہرنے سے زیادہ تقویٰ (التقویٰ) پر عمل کیا، اللہ نے اس کے لیے فرقان (امتیاز) بنا دیا جس سے وہ مختلف فرقوں اور ملتوں کے درمیان فرق کرتا ہے۔ اور وہ عقلی دلائل جو قائل کے نزدیک شرع کے حکم کو زائل کر دیتے ہیں، وہ ان کی تاویل کرتا ہے تاکہ انہیں اپنے عقل کے دلیل کی طرف لوٹا دے، تو وہ خطرے میں ہے، اگرچہ وہ درست ہو جائے۔\n\nپس تم پر تقویٰ (التقویٰ) کا فرقان لازم ہے، کیونکہ یہ شہود (الشہود) اور وجود کی صحت سے حاصل ہوتا ہے۔ اور \"اللہ حق کہتا ہے (والله يَقُولُ الْحَقَّ) اور وہی سیدھے راستے کی طرف ہدایت دیتا ہے (وهُوَ يَهْدِي السَّبِيلَ) جو صراط مستقیم کی طرف رہنمائی کرتا ہے\"۔",
    "fa": "باب چهارصد و هشتاد و نهم در معرفت حال قطب (قطب) که منزل او این آیه بود: «جز این نیست که اموال و فرزندان شما مایه آزمایش (فتنه) هستند.»\n\nابتلا به عین مال و فرزند،\nبلایی است که در آن هیچ آسودگی نیست.\n\nپس مال، امر «کُن فیکون» (باش پس می‌شود) را در بر می‌گیرد،\nو فرزند صورت آن است و مَثَل، تقدیس است.\n\nبه واسطه آن، نفی مَثَل تعلق می‌گیرد، پس از آن بهره‌مند شو،\nزیرا اصل آن، سبوح (پاک) و قدوس (بسیار پاک) است.\n\nپس به آفرینش ما بنگر که بر تطابق در اسماء اوست؛\nدر آن تمثیل و تجنیس (هم‌جنس‌سازی) وجود دارد.\n\n### [از زینت‌های زندگی دنیا، مال و فرزندان]\n\nخداوند متعال می‌فرماید: «الْمالُ والْبَنُونَ زِينَةُ الْحَياةِ الدُّنْيا والْباقِياتُ الصَّالِحاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَواباً وخَيْرٌ أَمَلًا» (مال و فرزندان، زینت زندگی دنیا هستند، و باقیات صالحات (کارهای شایسته ماندگار) نزد پروردگارت از نظر پاداش بهتر و از نظر امید نیکوترند.) و پیامبر (صلی الله علیه و آله و سلم) فرمودند: «با مرگ فرزند آدم، عمل او قطع می‌شود مگر از سه چیز: صدقه جاریه، یا علمی که آن را در میان مردم منتشر سازد، یا فرزند صالحی که برای او دعا کند.»\n\nپس مال و فرزندان، زینت زندگی دنیا را در خود جمع کرده‌اند، و همچنین خیری را که باقیات صالحات نزد پروردگارش می‌دهند، که همان ثواب است، و نیز خیر مورد امید که همان فرزندان هستند؛ زیرا این دو (مال و فرزند) اگر صالح باشند، از باقیات صالحات به شمار می‌آیند، یعنی مال صالح و فرزند صالح. و اما علمی که در این حدیث ذکر شده، همان سنّت حسنه‌ای است که شخص بنیان می‌گذارد. و خداوند مال و فرزند را مایه آزمایش (فتنة) قرار داد تا بندگانش را با آن دو بیازماید، زیرا این دو به قلب پیوستگی دارند و طبعاً محبوب هستند و به واسطه آن‌ها، به ویژه مال، می‌توان به اموری از خیر و شرافت دست یافت که با غیر مال میسر نمی‌شود. پس اگر طبع بر بنده غالب شود، در تصرف مالش حدّی نمی‌شناسد، بلکه با آن به تمام خواسته‌هایش می‌رسد؛ و اگر شرع بر بنده غالب شود، در تصرف مالش در حدودی که پروردگارش برای او تعیین کرده، توقف می‌کند و به تمام خواسته‌هایش نمی‌رسد.\n\nو مال، مال نامیده نشد مگر به این دلیل که قلب به آن متمایل (مال) می‌شود، زیرا اگر بنده صالح باشد، در آن وسیله‌ای برای رسیدن به تمام خیراتی است که در بازگشت (منقلب) نزد پروردگارش می‌یابد؛ و اگر صلاح کامل نداشته باشد، به دلیل آن است که با آن به خواسته‌هایش می‌رسد. و اما فرزند، چون از والدینش ولادت یافته، او را دوست می‌دارند. و این تمایل، همانند میل فاعل به آنچه از او منفعل شده و میل صانع به مصنوع خود است. پس میل به دوست داشتن فرزند، میلی ذاتی است. اگر او را ناپسند بدارد، به سبب امری عارضی است که ناشی از اخلاق ناپسند و صفات شرورانه‌ای است که در فرزند پدید می‌آید؛ پس بغض او عَرَضی است.\n\nاز این طریق می‌توان به سبب رحمت خداوند که همه چیز را فرا گرفته است، آگاه شد. زیرا تمام عالم مکلّف، مصنوع اوست و او (انسان) از جمله کسانی است که صنعت الهی در او ظاهر شده است. پس ناگزیر باید ذاتاً محبوبِ ایجادکننده‌اش باشد، محبتی اصیل. و اگر کراهتی بر او واقع شود، از برخی افعال اوست و افعال او عَرَضی هستند. و با وجود عَرَضی بودن این افعال، در آن‌ها چیزی است که اصالت را تأیید می‌کند، و آن این است که تمام افعال ظاهری از عالم، همگی از آنِ خداوند است، و عالم محل ظهور آن افعال است، یا این افعال برای حق (الحق) مانند ابزار برای صنعتگر هستند. پس رحمت و محبت غلبه یافت و حکم غضب به تأخیر افتاد. و تأخیر آن (غضب) چیزی نیست جز تعبیری از از بین بردن دوام حکم آن.\n\nو خداوند هیچ یک از بندگانش را آزمایش (فتن) نکرد مگر به حکم ادعاهایی که در تصرفاتشان بر آن‌ها ظاهر شد، مبنی بر اینکه آن فعل حقیقتاً از آنِ آن‌هاست یا از طریق کسب (کسب) است. پس اگر خداوند آن‌ها را بر دست الهیِ خالق آگاه می‌ساخت و آن‌ها خود را ابزارهای صنعتی می‌دیدند که وقوع غیر از آن ممکن نیست، خداوند آن‌ها را نمی‌آزمود. پس آن‌ها را نیازمود مگر برای اینکه به چنین علمی دست یابند و از ادعا مصون بمانند و سعادتمند شوند. پس «فَمِنْهُمْ من هَدَى الله ومِنْهُمْ من حَقَّتْ عَلَيْهِ الضَّلالَةُ» (پس برخی از آنان کسانی هستند که خداوند هدایتشان کرده و برخی کسانی هستند که گمراهی بر آنان محقق شده است.) پس سرگردان شدند و ندانستند، و اینان همان قائلان به کسب (کسب) هستند. و برخی از آنان «فَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذابِ» (پس کسی که کلمه عذاب بر او محقق شده است.) و اینان همان قائلان به خلق افعال هستند. و اما کسانی که خداوند هدایتشان کرده، کسانی هستند که حق هر آیه‌ای را که در قرآن یا از جانب خداوند یا در خبر نبوی آمده، ادا کرده‌اند و آن را از جایگاهش فراتر نبرده و به غیر جهت اصلی‌اش منحرف نساخته‌اند. پس آنچه از آن آیات موجب حیرت می‌شود، هدایت آن‌ها در آن، توقف در همان حیرت بوده است؛ زیرا اگر از آن فراتر می‌رفتند، حق آیه را ادا نکرده بودند، مانند این فرموده خداوند متعال: «والله خَلَقَكُمْ وما تَعْمَلُونَ» (و خداوند شما و آنچه را انجام می‌دهید آفریده است.) و این بزرگترین آیه‌ای است که در اثبات حیرت در عالم وارد شده است.\n\nپس کسی که با گفتار مشروع توقف کند و حکم آن را بر آنچه نظر عقلی از نقیض دلالت شرع به او داده است، جاری سازد، او همان سالم و نجات‌یافته است. و کسی که بر این توقف، عمل به تقوا (تقوی) را بیفزاید، خداوند برای او فرقانی (فرقان) قرار می‌دهد که با آن میان پیروان نحل و ملل و آنچه ادله عقلی می‌دهند و حکم شرع را نزد قائل به آن از بین می‌برد، تمایز قائل شود. پس کسی که آن (آیات) را تأویل می‌کند تا به دلیل عقل خود بازگرداند، در خطر است، حتی اگر به حقیقت رسیده باشد. پس بر تو باد به فرقان (فرقان) تقوا (تقوی)، زیرا آن از شهود (شهود) و صحت وجود (الوجود) ناشی می‌شود. و «والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که به راه هدایت می‌کند.) راهنمای به سوی طریق مستقیم."
  },
  "page_count": 2
}