{
  "id": 355,
  "title": {
    "ar": "الباب الخامس والخمسون وثلاثمائة في معرفة منزل السبل المولدة وأرض العبادة واتساعها وقوله تعالى يا عِبادِيَ (الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ",
    "en": "Chapter Three Hundred and Fifty-Five: Regarding the Gnosis of the Station of the Generated Paths (السبل المولدة), and the Land of Worship (أرض العبادة) and its Vastness, and concerning His saying, the Exalted: <<يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ>> (O My servants who have believed, indeed My earth is vast, so worship only Me).",
    "ur": "باب تین سو پچپن: مولد راہیں (السبل المولدة) کی منزل کی معرفت میں، اور ارضِ عبادت (أرض العبادة) اور اس کی وسعت کے بیان میں، اور اللہ تعالیٰ کا یہ فرمان:\n\"يَا عِبَادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ\"\n(اے میرے بندو جو ایمان لائے ہو، بے شک میری زمین وسیع ہے، پس صرف میری ہی عبادت کرو۔)",
    "fa": "باب سیصد و پنجاه و پنجم در معرفت منزل راه‌های مولّد (السبل المولدة) و سرزمین عبادت و گستردگی آن، و سخن خداوند متعال: «ای بندگان من که ایمان آورده‌اید، همانا زمین من وسیع است، پس تنها مرا بپرستید» (يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ)."
  },
  "content": {
    "ar": "## «الباب الخامس والخمسون وثلاثمائة في معرفة منزل السبل المولدة وأرض العبادة واتساعها وقوله تعالى يا عِبادِيَ (الَّذِينَ آمَنُوا) إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ»\n\n\n> ما لأرض الله واسعة *** وسماء الله تنكحها\n\n\n> مجمع الأبواب مغلقة *** ويمين الجود تفتحها\n\n\n> وصدور ضاق مسكنها *** وبنور العلم يشرحها\n\n\n> مبهمات السر مظلمة *** وعلوم الكشف توضحها\n\n\n> كل ما أعطيت من نعم *** حضرة المحسان تمنحها\n\n\n> ثم إن قام الفساد بها *** فعسى الرحمن يصلحها\n\n\n> ثم إن شدت وإن عدلت *** فلجام الهدى يكبحها\n\n\n> كل دعوى غير صادقة *** فلسان العجز يفضحها\n\n\n> زند ذي البلوى بكل أذى *** من بلاء الكون يقدحها\n\n\n### [لا هجرة بعد الفتح‏]\n\n\nقال الله تعالى أَ لَمْ تَكُنْ أَرْضُ الله واسِعَةً فَتُهاجِرُوا فِيها ولم يقل منها ولا إليها فهي أرض الله سواء سكنها من يعبده أو من يستكبر عن عبادته وقال عز من قائل يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ فأضافها إليه أشد إضافة من قوله إِنَّ الْأَرْضَ لِلَّهِ وكذلك أضاف العباد إليه إضافة الأرض إضافة اختصاص وكذلك أضافهم في الأمر بالعبادة إليه فقال فَإِيَّايَ فَاعْبُدُونِ وقال في غير هذا الموطن اعْبُدُوا الله واعْبُدُوا رَبَّكُمُ فمن عرف قدر هذه الإضافة إلى المتكلم عرف قدر ما بين الإضافتين وإن كان المقصود بالعبادة واحدا فضيق في توسعه في إضافتهم إلى المتكلم ووسع في إضافتهم إلى الاسم وهنا أسرار لا يعلمها إلا من يعلم الأمر على ما هو عليه في نفسه وهوقوله عليه السلام لما فتح مكة لا هجرة بعد الفتح‏\n\n\nمع أن مكة أشرف البقاع وأنها بيت الله الذي يحج إليه من مشارق الأرض ومغاربها ولكن أمر وعظم الأجر لمن يهاجر منها من أجل ساكنيها فلما فتحها الله وأسكنها المؤمنين من عباده‏\n\n\nقال لا هجرة بعد الفتح‏\n\n\nفمن فتح الله عليه رآه في كل شي‏ء أو عين كل شي‏ء فلم يهاجر لأنه غير فاقد فإن هاجر فعن أمره فيهاجر به منه إليه عن أمره مثل خروجه إلى أداء الصلاة في مسجد الجماعة ومثل خروجه إلى مكة يريد الحج وكخروجه أيضا إلى الجهاد وإلى الزيارة وزيارة أخ في الله تعالى أو في السعي على العيال فهذا كله ليس بهجرة على الحقيقة وإنما هي سياحة عن أمر إلهي على شهود فإن لم يكن على شهود ولا كأنه شهود فما هو مطلوبنا في هذا الموضع فإن أدنى مرتبة الإحسان أن تعبد الله كأنك تراه ولما خلق الله الإنسان الكامل بالصورتين الموجود بالنشأتين الذي جمع الله له بين الاسمين الأول والآخر وأعطاه الحكمين في الظاهر والباطن ليكون بكل شي‏ء عليما خلقه من تراب الأرض أنزل موجود خلق ليس وراءها وراء كما أنه ليس وراء\nالله مرمى فجعل مسكنه في أشرف الأماكن وهو النقطة التي يستقر عليها عمد الخيمة وجعل العرش المحيط مكان الاستواء الرحماني كما يليق بجلاله أعلاما بالارتباط الإلهي الذي بين العرش والأرض وما بينهما من مراتب العالم المتحيز العام للمساحات من الأفلاك والأركان فجميع العالم في جوف العرش إلا الأرض فإنها مقر السرير فلما أراد الله أن يخلقنا لعبادته قرب الطريق علينا فخلقنا من تراب في تراب وهو الأرض التي جعلها الله ذلولا والعبادة الذلة فنحن الأذلاء بالأصل لا نشبه من خلق نورا من النور وأمر بالعبادة فبعدت عليهم الشقة لبعد الأصل مما دعاهم إليهم من عبادته فلو لا إن الله أشهدهم بأن خلقهم في مقاماتهم ابتداء لم ينزلوا منها فلم يكن لهم في عبادتهم ارتقاء كما لنا ما أطاقوا الوفاء بالعبادة فإن النور له العزة ما له الذلة فمن عناية الله بنا لما كان المطلوب من خلقنا عبادته إن قرب علينا الطريق بأن خلقنا من الأرض التي أمرنا أن نعبده فيها ولما عبد منا من عبد غير الله غار الله أن يعبد في أرضه غيره فقال وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ أي حكم فما عبد من عبد غير الله إلا لهذا الحكم فلم يعبد إلا الله وإن أخطئوا في النسبة إذ كان لله في كل شي‏ء وجه خاص به ثبت ذلك الشي‏ء فما خرج أحد عن عبادة الله ولما أراد الله أن يميز بين من عبده على الاختصاص وبين من عبده في الأشياء أمر بالهجرة من الأماكن الأرضية التي بعبد الله فيها في الأعيان لِيَمِيزَ الله الْخَبِيثَ من الطَّيِّبِ فالخبيث هو الذي عبد الله في الأغيار والطيب هو الذي عبد الله لا في الأغيار وجعل تعالى هذه الأرض محلا للخلافة فهي دار ملكه وموضع نائبه الظاهر بأحكام أسمائه فمنها خلقنا وفيها أسكننا أحياء وأمواتا ومنها يخرجنا بالبعث في النشأة الأخرى حتى لا تفارقنا العبادة حيث كنا دنيا وآخرة وإن كانت الآخرة ليست بدار تكليف ولكنها دار عبادة فمن لم يزل منا مشاهدا لما خلق له في الدنيا والآخرة فذلك هو العبد الكامل المقصود من العالم النائب عن العالم كله الذي لو غفل العالم كله أعلاه وأسفله زمنا فردا عن ذكر الله وذكره هذا العبد قام في ذلك الذكر عن العالم كله وحفظ به على العالم وجوده ولو غفل العبد الإنساني عن الذكر لم يقم العالم مقامه في ذلك وخرب منه من زال عنه الإنسان الذاكر\n\n\nقال النبي صَلَّى اللهُ عَليهِ وسَلَّم لا تقوم الساعة وفي الأرض من يقول الله الله‏\n\n\nولما خلق الله هذه النشأة الإنسانية وشرفها بما شرفها به من الجمعية ركب فيها الدعوى وذلك ليكمل بها صورتها فإن الدعوى صفة إلهية قال تعالى إِنَّنِي أَنَا الله لا إِلهَ إِلَّا أَنَا فَاعْبُدْنِي فادعى أنه لا إله إلا هو وهي دعوى صادقة فمن ادعى دعوى صادقة لم تتوجه عليه حجة وكان له السلطان على كل من رد عليه دعواه لأن له الشدة والغلبة والقهر لأنه صادق والصدق الشدة فلا يقاوم ولما كانت الدعوى خبرا والخبر نسبة الصدق إليه ونسبة الكذب على السواء بما هو خبر يقبل هذا وهذا علمنا عند ذلك أنه لا بد من الاختبار فادعى المؤمن الايمان وهو التصديق بوجود الله وأحديته وأنه لا إله إلا هو وأن كل شي‏ء هالِكٌ إِلَّا وَجْهَهُ وأن الأمر لله من قبل ومن بعد فلما ادعى بلسانه إن هذا مما انطوى عليه جنانه وربط عليه قلبه احتمل أن يكون صادقا فيما ادعاه إنه صفة له ويحتمل أن يكون كاذبا في إن ذلك صفة له فاختبره الله لإقامة الحجة له أو عليه بما كلفه من عبادته على الاختصاص لا العبادة السارية بسريان الألوهة ونصب له وبين عينيه الأسباب وأوقف ما تمس حاجة هذا المدعي على هذه الأسباب فلم يقض له بشي‏ء إلا منها وعلى يديها فإن رزقه الله نورا يكشف به ويخترق سدف هذه الأسباب فيرى الحق تعالى من ورائها مسببا اسم فاعل أو يراه فيها خالقا وموجدا لحوائجه التي أضطره إليها فذلك المؤمن الذي هو على نور من ربه وبينة من أمره الصادق في دعواه الموفي حق المقام الذي ادعاه بالعناية الإلهية التي أعطاه ومن لَمْ يَجْعَلِ الله لَهُ نُوراً فَما لَهُ من نُورٍ فقال بعد إقراره بربوبية خالقه لما أشهده على نفسه في أخذ الميثاق حين قال له ولأمثاله أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى‏ فلما أوجده في هذه الدنيا أوجده على تلك الفطرة فقال بألوهية الأسباب التي رزقه الله منها وجعلها حجبا بينه وبين الله ولم يكن له نور يهتدى به في ظلمات البر والبحر وليس إلا النجوم وهي هنا نجوم العلم الإلهي فأضاف الألوهة إلى غير مستحقها فكذب في دعواه لكثرة الأسباب وإقراره في شركه بأن ذلك قربة منه إلى الله خالق الأسباب وجعلها آلهة فلم يصدق قوله لا إله إلا هو ولهذا قال من قال أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ وليس العجب إلا ممن كثر الآلهة والذي لم يقل بنسبة الألوهة للأسباب لكنه لم ير إلا الأسباب وما حصل له‏\nمن الكشف ما يخرجه عنها مع توحيد الألوهة كان ذلك شركا خفيا لا يشعر به صاحبه أنه شرك يحجبه عن الأمر العالي الذي طلب به فلم يوجد صاحب هذه الدعوى في توحيد الله وتوحيده في أفعاله مع الاضطراب عند فقد السبب وسكونه عند وجوده صادقا فنقصه على قدر ما فاته من ذلك هذا ولم يجعل للأسباب آلهة فإن قلت فالمشرك الذي ادعى أنه مشرك فهو صادق في دعواه إنه مشرك فلما ذا لم ينفعه صدقه قلنا هو كاذب في دعواه في نسبة الألوهة إلى من ليس بالإله هذه دعواه التي كفر بها فهو صادق في أنه مشرك وليس بصادق في إن الشركة في الألوهة صحيحة لأنه بحث عن ذلك بأدلة العقلية والشرعية فلم يوجد لما ادعاه عين في الصدق فاختبر الله العباد بما شرع لهم بإرسال الرسل واختبر الله المؤمنين بالأسباب فكل صنف اختبره بحسب دعواه فمن صدق أورثه ذلك الصدق ما تعطيه دعواه ولهذا يسأل الصَّادِقِينَ عَنْ صِدْقِهِمْ فيما صدقوا فيه هل صدقوا فيما أمروا به وأبيح لهم أو هل صدقوا في إتيان ما حرم عليهم إتيانه مع كونهم صادقين فيقال لهم فيم صدقتم فإن النمامين صادقون والمغتابين صادقون وقد ذمهم الله وتوعد على ذلك مع كونه صدقا فلهذا يسأل الصادقين عن صدقهم فيما صدقوا فهذا من اختبار الله إياهم وأصل هذا كله ما ركب فيهم من الدعاوي ومما اختبرهم الله به في الخطاب إن جعل ما ابتلاهم به ليعلم الله الصادق في دعواه من الكاذب فأنزل نفسه في هذا الاختبار منزلة من يستفيد بذلك علما وهو سبحانه العالم بما يكون منهم في ذلك قبل كونه فمن المنزهة في زعمهم من يقول إن الله لا يستفيد من ذلك علما فإنه لا يعلم الأمر من حيث ما هو واقع من فلان على التعيين فرد كلام الله وتأوله إذ خاف من وقوع الأذى به لذلك ومن الظاهرية من التزم أنه يعلم بذلك الاختبار وقوفا عند هذا اللفظ ومن الناس من صرف ذلك إلى تعلق العلم به عند الوقوع فالعلم قديم والتعلق حادث ومن المؤمنين من سلم علم ذلك إلى الله وآمن به من غير تأويل معين وهذا هو أسلم ما يعتقد وهذا كله ابتلاء من الله لعباده الذين ادعوا الايمان به بألسنتهم فإنه قال حَتَّى نَعْلَمَ كما قال ولَنَبْلُوَنَّكُمْ وقال أَمْ حَسِبْتُمْ أَنْ تَدْخُلُوا الْجَنَّةَ ولَمَّا يَعْلَمِ الله الَّذِينَ جاهَدُوا مِنْكُمْ ويَعْلَمَ الصَّابِرِينَ فميز بينهما فيجازي المجاهد بجزاء معين ويجازي الصابر عليه بجزاء معين وقال فَلَيَعْلَمَنَّ الله الَّذِينَ صَدَقُوا ولَيَعْلَمَنَّ الْكاذِبِينَ لما ذكر الفتنة وهي الاختبار فإذا نظر الإنسان إلى نشأته البدنية قامت معه الأرض التي خلق منها وجعل منها غذاؤه وما به صلاح نشأته لم يرزقه الله في العادة من غيرها ومن خرق الله فيه العادة بأن لم يرزقه منها رزقه من أمر طبيعي خفي وهو السبب الذي أبقى عليه حياته به فوفر عليه حرارته ورطوبته التي هي مادة حياته بأمر لطيف لا يعلمه إلا الله ومن أطلعه عليه لأن الله لما وضع الأسباب لم يرفعها في حق أحد وإنما أعطى الله بعض عباده من النور ما اهتدى به في المشي في ظلمات الأسباب غير ذلك ما فعل به فعاينوا من ذلك على قدر أنوارهم فحجب الأسباب مسدلة لا ترفع أبدا فلا\n\n\nتطمع وإن نقلك الحق من سبب فإنما ينقلك بسبب آخر فلا يفقدك السبب جملة واحدة فإنه حبل الله الذي أمرك بالاغتصام به وهو الشرع المنزل وهو أقوى الأسباب وأصدقها وبيده النور الذي يهتدى به في ظلمات بر هذه الأسباب وبحرها فمن عمل كذا وهو السبب فجزاؤه كذا فلا تطمع فيما لا مطمع فيه ولكن سل الله تعالى رشة من ذلك النور على ذاتك وأظهر الأمور اللطيفة إن جعل بدنك ذا مسام وأحاط بك الهواء الذي هو مادة الحياة الطبيعية فإنه حار رطب بالذات وجعل فيك قوة جاذبة فقد تجذب في وقت فقدك الأسباب المعتادة الهواء من مسامك فتغذي به بدنك وأنت لا تشعر وقد علمنا إن من الحشرات من يكون عداؤه من مسام بدنه مما يجذبه من الرطوبات على ميزان خاص يكون له به البقاء من غير إفراط ولا تفريط ثم لتعلم أيها الأخ الولي أن أرض بدنك هي الأرض الحقيقية الواسعة التي أمرك الحق أن تعبده فيها وذلك لأنه ما أمرك أن تعبده في أرضه‏\n\n\nإلا ما دام روحك يسكن أرض بدنك فإذا فارقها أسقط عنك هذا التكليف مع وجود بدنك في الأرض مدفونا فيها فتعلم إن الأرض ليست سوى بدنك وجعلها واسعة لما وسعته من القوي والمعاني التي لا توجد إلا في هذه الأرض البدنية الإنسانية وأما قوله فَتُهاجِرُوا فِيها فإنها محل للهوى ومحل للعقل فتهاجروا من أرض الهوى منها إلى أرض العقل منها\nوأنت في هذا كله فيها ما خرجت عنها فإن استعملك الهوى أرداك وهلكت وإن استعملك العقل الذي بيده سراج الشرع نجوت وأنجاك الله به فإن العقل السليم المبرأ من صفات النقص والشبه هو الذي فتح الله عين بصيرته لإدراك الأمور على ما هي عليه فعاملها بطريق الاستحقاق فأعطى كل ذي حق حقه ومن لم يعبد الله في أرض بدنه الواسعة فما عبد الله في أرضه التي خلق منها فإن الله يقول وبَدَأَ خَلْقَ الْإِنْسانِ من طِينٍ ثُمَّ جَعَلَ نَسْلَهُ من سُلالَةٍ من ماءٍ مَهِينٍ وهو الماء الذي نبع من هذه الأرض البدنية واستقر في رحم المرأة ثم سواه فبعد تسوية أرض البدن وقبوله الاشتعال بما فيه من الرطوبة والحرارة نفخ الله فيه فاشتعل فكان ذلك الاشتعال روحا له فما خرج إلا منه فمنه خلق وجعل العقل في هذه النشأة نظير القمر في الأرض نورا يستضاء به ولكن ما له ذلك النفوذ بالحجب المانعة من البيوت والجدران والأكنة وجعل الشرع لهذا العقل في هذه الأرض البدنية سراجا فأضاءت زوايا هذه الأرض بنور السراج فأعطى من العلم بها مما فيها ما لم يعطه نور العقل الذي هو بمنزلة القمر ثم يعيدنا فيها يعني في النشأة الأخرى أيضا كما خلقنا فيها ويخرجنا إخراجا لمشاهدته كما أنشأنا منها وأخرجنا لعبادته فخلق أرواحنا من أرض أبداننا في الدنيا لعبادته وأسكننا أرض أبداننا في الآخرة لمشاهدته إن كنا سعداء كما آمنا به في النشأة الأولى لما اعتنى الله بنا والحال مثل الحال سواء في تقسيم الخلق في ذلك وكذلك يكونون غدا والموت بين النشأتين حالة برزخية تعمر الأرواح فيها أجسادا برزخية خيالية مثل ما أعمرتها في النوم وهي أجساد متولدة عن هذه الأجسام الترابية فإن الخيال قوة من قواها فما برحت أرواحها منها أو مما كان منها فاعلم ذلك فارض الله التي هي ركن موجودة وأنت فيها مدفون وما أمرت بعبادة ربك وما دمت في أرض بدنك الواسعة مع وجود عقلك وسراج شرعك فأنت مأمور بعبادة ربك فهذه الأرض البدنية لك على الحقيقة أرض الله الواسعة التي أمرك أن تعبده فيها إلى حين موتك ومن مات فقد قامت قيامته وهي القيامة الجزئية وهو قوله وفِيها نُعِيدُكُمْ فإذا فهمت القيامة الجزئية بموت هذا الشخص المعين علمت القيامة العامة لكل ميت كان عليها فإن مدة البرزخ هي للنشأة الآخرة بمنزلة حمل المرأة الجنين في بطنها ينشئه الله نشأ بعد نش‏ء فتختلف عليه أطوار النش‏ء إلى أن يولد يوم القيامة فلهذا قيل في الميت إنه إذا مات فقد قامت قيامته أي ابتدأ فيه ظهور نشأة الأخرى في البرزخ إلى يوم البعث من البرزخ كما يبعث من البطن إلى الأرض بالولادة فتدبير نشأة بدنه في الأرض زمان كونه في البرزخ ليسويه ويعدله على غير مثال سبق مما ينبغي للدار الآخرة فيعبده فيها أعني في أرض نشأته الأخراوية عبادة ذاتية لا عبادة تكليف فإن الكشف يمنعه إن يكون عبدا لغير من يستحق أن يكون له عبدا كما ينال هذا المقام رجال الله هنا ولما خلق الله أرض بدنك جعل فيها كعبة وهو قلبك وجعل هذا البيت القلبي أشرف البيوت في المؤمن فأخبر إن السموات وفيها البيت المعمور والأرض وفيها الكعبة ما وسعته وضاقت عنه ووسعه هذا القلب من هذه النشأة الإنسانية المؤمنة والمراد هنا بالسعة العلم بالله سبحانه فهذا يدلك على أنها الأرض الواسعة وأنها أرض عبادتك فتعبده كأنك تراه من حيث بصرك لأن قلبك محجوب أن يدركه بصرك فإنه في الباطن منك فتعبد الله كأنك تراه في ذاتك كما يليق بجلاله وعين بصيرتك تشهده فإنه ظاهر لها ظهور علم فتراه بعين بصيرتك وكأنك تراه من حيث بصرك فتجمع في عبادتك بين الصورتين بين ما يستحقه تعالى من العبادة في الخيال وبين ما يستحقه من العبادة في غير موطن الخيال فتعبده مطلقا ومقيدا وليس ذلك لغير هذه النشأة فلهذا جعل هذه النشأة المؤمنة حرمه المحرم وبيته المعظم المكرم وقد أشرت إلى هذا المعنى بقولي‏\n\n\n> من كان حقا كله *** قد زال عنه كله‏\n\n\n> أو أنت فيه ظله *** فالأمر حق كله‏\n\n\n> فالحق شخص قائم *** وأنت منه ظله‏\n\n\n> حرامه محترم *** فالحل لا يحله‏\n\n\n> عن كل ما لا ينبغي *** فإنه يجله‏\n\n\nفكل من في الوجود من المخلوقات يعبد الله على الغيب إلا الإنسان الكامل المؤمن فإنه يعبده على المشاهدة ولا يكمل‏\nالعبد إلا بالإيمان فله النور الساطع بل هو النور الساطع الذي يزيل كل ظلمة فإذا عبده على الشهادة رآه جميع قواه فما قام بعبادته غيره ولا ينبغي أن يقوم بها سواه فما ثم من حصل له هذا المقام إلا المؤمن الإنساني فإنه ما كان مؤمنا إلا بربه فإنه سبحانه المؤمن‏\n\n\n### [أن الله ما خلق الخلق على مزاج واحد]\n\n\nواعلم إنك إذا لم تكن بهذه المنزلة وما لك قدم في هذه الدرجة فأنا أدلك على ما يحصل لك به الدرجة العليا وهو أن تعلم أن الله ما خلق الخلق على مزاج واحد بل جعله متفاوت المزاج وهذا مشهود بالبديهة والضرورة لما بين الناس من التفاوت في النظر العقلي والايمان وقد حصل لك من طريق الحق أن الإنسان مرآة أخيه فيرى منه ما لا يراه الشخص من نفسه إلا بوساطة مثله فإن الإنسان محجوب بهواه متعشق به فإذا رأى تلك الصفة من غيره وهي صفته أبصر عيب نفسه في غيره فعلم قبحها إن كانت قبيحة أو حسنها إن كانت ذات حسن‏\n\n\n### [إن الرسل أعدل الناس مزاجا لقبولهم رسالات ربهم‏]\n\n\nواعلم أن المرائي مختلفة الأشكال وأنها تصير المرئي عند الرائي بحسب شكلها من طول وعرض واستواء وعوج واستدارة ونقص وزيادة وتعدد وكل شي‏ء يعطيه شكل تلك المرآة وقد علمت إن الرسل أعدل الناس مزاجا لقبولهم رسالات ربهم وكل شخص منهم قبل من الرسالة قدر ما أعطاه الله في مزاجه من التركيب فما من نبي إلا بعث خاصة إلى قوم معينين لأنه على مزاج خاص مقصور وإن محمدا صَلَّى اللهُ عَليهِ وسَلَّم ما بعثه الله إلا برسالة عامة إلى جميع الناس كافة ولا قبل هو مثل هذه الرسالة إلا لكونه على مزاج عام يحوي على مزاج كل نبي ورسول فهو أعدل الأمزجة وأكملها وأقوم النشآت فإذا علمت هذا وأردت أن ترى الحق على أكمل ما ينبغي أن يظهر به لهذه النشأة الإنسانية فاعلم إنك ليس لك ولا أنت على مثل هذا المزاج الذي لمحمد صَلَّى اللهُ عَليهِ وسَلَّم وأن الحق مهما تجلى لك في مرآة قلبك فإنما تظهره لك مرآتك على قدر مزاجها وصورة شكلها وقد علمت نزولك عن الدرجة التي صحت لمحمد صَلَّى اللهُ عَليهِ وسَلَّم في العلم بربه في نشأته فالزم الايمان والاتباع واجعله أمامك مثل المرآة التي تنظر فيها صورتك وصورة غيرك فإذا فعلت هذا علمت إن الله تعالى لا بد أن يتجلى لمحمد صَلَّى اللهُ عَليهِ وسَلَّم في مرآته وقد أعلمتك أن المرآة لها أثر في ناظر الرائي في المرئي فيكون ظهور الحق في مرآة محمد صَلَّى اللهُ عَليهِ وسَلَّم أكمل ظهور وأعدله وأحسنه لما هي مرآته عليه فإذا أدركته في مرآة محمد صَلَّى اللهُ عَليهِ وسَلَّم فقد أدركت منه كمالا لم تدركه من حيث نظرك في مرآتك أ لا ترى في باب الايمان وما جاء في الرسالة من الأمور التي نسب الحق لنفسه بلسان الشرع مما تحيله العقول ولو لا الشرع والايمان به لما قبلنا من ذلك من حيث نظرنا العقلي شيئا البتة بل نرده ابتداء ونجهل القائل به فكما أعطاه بالرسالة والايمان ما قصرت العقول التي لا إيمان لها عن إدراكها ذلك من جانب الحق كذلك قصرت أمزجتنا ومرائي عقولنا عند المشاهدة عن إدراك ما تجلى في مرآة محمد صَلَّى اللهُ عَليهِ وسَلَّم أن تدركه في مرآتها وكما آمنت به في الرسالة غيبا شهدته في هذا التجلي النبوي عينا\n\n\n> فلولاه ولولانا *** لما كان الذي كانا\n\n\n> ولا جاءت رسالات *** من الرحمن مولانا\n\n\n> بأخبار وأحكام *** وسمي ذاك تبيانا\n\n\n> وتوراة وإنجيلا *** وفرقانا وقرآنا\n\n\n> وسماه أولو الألباب *** بالأفكار برهانا\n\n\n> وثلث ذاك إسلاما *** وإيمانا وإحسانا\n\n\n> فسبحان الذي أسرى *** به ليراه محسانا\n\n\n> وخص بصورة الرحمن *** من سماه إنسانا\n\n\n> وجاءت رسله تترى *** زرافات ووحدانا\n\n\n> وأعطانا وحابانا *** هنا ما شاء كتمانا\n\n\n> وجنات وأنهارا *** وروحا ثم ريحانا\n\n\n> وكشفا ثم إشهادا *** وأسرارا وإعلانا\nفقد نصحتك وأبلغت لك في النصيحة فلا تطلب مشاهدة الحق إلا في مرآة نبيك صَلَّى اللهُ عَليهِ وسَلَّم واحذر أن تشهده في مرآتك أو تشهد النبي وما تجلى في مرآته من الحق في مرآتك فإنه ينزل بك ذلك عن الدرجة العالية فالزم الاقتداء والاتباع ولا تطأ مكانا لا ترى فيه قدم نبيك فضع قدمك على قدمه إن أردت أن تكون من أهل الدرجات العلى والشهود الكامل في المكانة الزلفى وقد أبلغت لك في النصيحة كما أمرت والله يَهْدِي من يَشاءُ إِلى‏\n\n\nصِراطٍ مُسْتَقِيمٍ وفي هذا المنزل من العلوم علم مرتبة الحسبان والظنون وعلم التقرير الإلهي وفيه علم الأسرار الخفية عن أكثر الناس وفيه علم الأفراد وفيه علم الملاحم وفيه علم المسابقة وأين حلبة المسابقة التي بين الله وبين عباده وهو علم شريف فيه من الرحمة الإلهية ما لا يصفه واصف وفيه علم الرد على من يقول بإنفاذ الوعيد وشمول الرحمة للجميع وذلك أن الإنسان إذا عصى فقد تعرض للانتقام والبلاء وأنه جار في شأو الانتقام بما وقع منه وإن الله يسابقه في هذه الحلبة من حيث ما هو غفار وعفو ومتجاوز ورحيم ورءوف فالعبد يسابق بالمعاصي والسيئات الحق تعالى إلى الانتقام والحق أسبق فيسبق إلى الانتقام قبل وصول العبد بالسيئات إليه فيجوزه بالغفار وأخواته من الأسماء فإذا وصل العبد إلى آخر الشأو في هذه الحلبة وجد الانتقام قد جازه الغفار وحال بينه وبين العصاة وهم كانوا يحكمون على أنهم يصلون إليه قبل هذا وهو قوله تعالى في العنكبوت أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئاتِ أَنْ يَسْبِقُونا أي يسبقون بسيئاتهم مغفرتي وشمول رحمتي ساءَ ما يَحْكُمُونَ بل السبق لله بالرحمة لهم هذا غاية الكرم وهذا لا يكون إلا في الطائفة التي تقول بإنفاذ الوعيد فيمن يموت على غير توبة فإذا مات العاصي تلقته رحمة الله في الموطن الذي يشاء الله أن تلقاه فيه وفيه علم‏\n\n\nقول النبي صَلَّى اللهُ عَليهِ وسَلَّم من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه‏\n\n\nولم يقل لم يلقه فما كره الله إلا لقاءه الذي كره وهو أن يلقاه آخذا له على جريمته ومنتقما فكره الله أن يلقاه بما كره هذا المسي‏ء فلقيه تعالى بالمغفرة والرضوان لأنه علم أنه ما كره لقاء الله مع كونه مؤمنا بلقائه إلا لما هو عليه من المخالفة فكره الله لقاءه بما تستحقه المخالفة من العقوبة فلقيه بالعفو والمغفرة وفيه علم ما تستحقه الذات لنفسها لا من حيث اتصافها بأنها إله وفيه علم إن رد الأمور كلها وإن كانت لله فإن الله بعد وقوفه عليها يردها بما شاء على عباده وفيه علم إرسال الستور بين النفوس المؤمنة وبين المخالفات ومن خالف منهم أرسلت الستور بينه وبين العقوبات وفيه علم معاملة الله عباده بما يوافق أغراضهم وفيه علم منزلة الأسباب الموضوعة في العالم التي لها الآثار فيه وفيه علم ما تدعوه إليه الأسباب وما ينبغي أن يجيب منها وما ينبغي أن لا يجيب وفيه علم إلحاق الأباعد بالأداني والأسافل بالأعالي في التحام ذلك وفيه علم جهل من يساوي بين الحق والخلق ومن جهل مراتب العالم عند الله وفيه علم التفسير والتمييز وفيه علم ما يعود على العامل من عمله وما لا يعود وفيه علم أعمار الأشياء وهو بقاء الشي‏ء إلى زمان فساد صورته التي بزوالها يزول عنه الاسم الذي كان يستحقه جمادا كان أو نباتا أو حيوانا وفيه علم الأخذ الإلهي بالأسباب الكونية وأن كل مأخوذ به جند من جنود الله وفيه علم كون العالم آيات بعضه لبعض وفيه علم النصائح من المؤمنين وغير المؤمنين وفيه علم بيان العلم بالأدلة وفيه علم ما تمس الحاجة إليه في كل وقت وفيه علم الاعتبار وفيه علم الإرادة والمشيئة وفيه علم من ينبغي أن يعتمد عليه في الأمور ومن لا يعتمد عليه فيها وفيه علم من أراد بأخيه المؤمن سوء عاد عليه وهو سار في كل جنس من الأمم وفيه علم من استعجل صفة ما يكون في يوم القيامة هنا وما حكمه عند الله وفيه علم الهجرة والمهاجر وفيه علم الوهب من غير الوهب وفيه علم ما أدى الجاهل مع علمه إن يقول إِنْ كانَ هذا هُوَ الْحَقَّ من عِنْدِكَ فَأَمْطِرْ عَلَيْنا حِجارَةً من السَّماءِ أَوِ ائْتِنا بِعَذابٍ أَلِيمٍ وأمثال هذا مثل قوله ائْتِنا بِعَذابِ الله إِنْ كُنْتَ من الصَّادِقِينَ فانظر في هذا الخبر الإلهي فإنه مبالغة منهم في التكذيب إذ لو احتمل عندهم صدق الرسول ما قالوا مثل هذا القول فإن النفوس قد جبلت على جلب المنافع لها ودفع المضار عنها وفيه علم الرفق بالأمم والدعاء عليهم من أنبيائهم وفيه علم العلم بالدار الآخرة والزمان الآخر ولما ذا يرجع وما ثم شمس تطلع ولا ليل يقبل وفيه علم تنوع الأسباب وفيه علم مراتب من اتخذ من الآلهة دون الله وفيه علم فصل العلماء والحكماء الإلهيين وفيه علم ما ينبغي للمؤمن أن يثابر عليه وفيه علم الصنعة والصانع وفيه علم التنازع في الحديث ومراتب المتنازعين وفيه علم المجمل من المحكم‏\nمن المعضل من المتشابه وفيه علم تعلق الايمان بما ليس بحق مثل قوله والَّذِينَ آمَنُوا بِالْباطِلِ وفيه علم الداعي الذي يوجب استعجال طلب الشقاء وفيه علم مواطن الايمان والزلف وفيه علم مراتب الصبر والتوكل وفيه علم من عرف الحق واجتنبه وما يحمد من ذلك وما يذم كالحق المأمور باجتنابه كالغيبة وفيه علم البسط المحمود والمذموم وفيه علم من علم أمرا فقيل له ما تعلمه وفيه علم الحياة السارية في الموجودات وبطونها في الدنيا وظهورها في الآخرة وبأي بصر كشفها في الدنيا من كشفها وفيه علم الاضطرار وكيف يذهب بذهابه وفيه علم الطرق إلى الله وإن اختلفت فكلها حق وما يحمد منها ويذم وما يوصل إلى السعادة منها وما يحيد بسالكه عن سعادته مع كونه يصل إلى الله وفيه علم المعية الإلهية ومراتب الموجودات فيها فهذا بعض ما يحوي عليه هذا المنزل من العلوم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "The Three Hundred and Fifty-Fifth Chapter: In the Knowledge of the Station (manzil) of the Generated Paths (al-Subul al-Muwalladah), the Earth of Worship (Ard al-Ibadah), its Vastness, and His saying, the Exalted: <<O My servants who have believed, indeed My earth is vast, so worship only Me>> (Q. 29:56).\n\nHow vast is the Earth of Allah,\nAnd the Heaven of Allah impregnates it.\nThe gathering place of doors is locked,\nBut the Right Hand of Generosity opens them.\nAnd breasts whose dwelling place has become narrow,\nAre expanded by the Light of Knowledge (al-Ilm).\nThe ambiguities of the Secret (al-Sirr) are dark,\nAnd the sciences of Unveiling (al-Kashf) clarify them.\nAll the graces you have been given,\nThe Presence of the Benefactor (Hadrat al-Muhsin) grants them.\nThen, if corruption arises within it,\nPerhaps the All-Merciful (al-Rahman) will rectify it.\nThen, if it becomes stubborn or deviates,\nThe bridle of Guidance (al-Huda) restrains it.\nEvery claim that is not truthful,\nThe tongue of incapacity exposes it.\nThe fire-stick of the afflicted one, with every harm,\nStrikes fire from the tribulation of the Cosmos (al-Kawn).\n\n[There is No Emigration After the Conquest]\n\nAllah the Exalted said: <<Was not the earth of Allah vast enough for you to emigrate therein?>> (Q. 4:97). He did not say \"from it\" or \"to it.\" Thus, it is the Earth of Allah (ard Allah), whether inhabited by those who worship Him or those who are arrogant regarding His worship. And He, the Mighty Speaker, said: <<O My servants who have believed, indeed My earth is vast, so worship only Me>> (Q. 29:56). He attributed it to Himself with a stronger attribution than His saying, <<Indeed, the earth belongs to Allah>> (Q. 7:128). Likewise, He attributed the servants to Himself—an attribution of exclusivity—and similarly attributed the command to worship to Himself when He said: <<so worship only Me.>> He said in another place: <<Worship Allah>> (Q. 4:36) and <<Worship your Lord>> (Q. 2:21). Whoever knows the value of this attribution to the Speaker (al-Mutakallim) knows the value of the difference between the two attributions, even though the object of worship is one. He restricted in His expansion when attributing them to the Speaker, and expanded in attributing them to the Name (al-Ism). Herein are secrets known only to him who knows the matter as it is in itself, which is His saying, peace be upon him, when Mecca was conquered: \"There is no emigration after the Conquest (al-Fath).\"\n\nEven though Mecca is the noblest of places and is the House of Allah (Bayt Allah) to which pilgrimage is made from the East and West of the Earth, the command and the great reward were for those who emigrated from it because of its inhabitants. When Allah conquered it and settled the believers among His servants therein, He said: \"There is no emigration after the Conquest.\"\n\nTherefore, whoever has been granted the Conquest (al-Fath) by Allah sees Him in everything, or in the essence (ayn) of everything, and thus does not emigrate because he is not lacking anything. If he does emigrate, it is by His command, so he emigrates by Him, from Him, to Him, by His command—such as his going out to perform the congregational prayer in the mosque, or his going out to Mecca intending the Hajj, or his going out for Jihad, or for visiting a brother in Allah the Exalted, or for seeking provision for his family. All of this is not emigration (hijra) in the true sense; rather, it is a journeying (siyaha) by Divine command (amr ilahi) based on Witnessing (shuhud). If it is not based on Witnessing, or as if it were Witnessing, then it is not what we seek in this context. For the lowest degree of spiritual excellence (al-Ihsan) is that you worship Allah as if you see Him.\n\nWhen Allah created the Perfect Human (al-Insan al-Kamil) with the two forms, existing in the two states of being (al-Nash'atayn), for whom Allah combined the two Names, the First (al-Awwal) and the Last (al-Akhir), and granted him the two rulings in the manifest and the hidden, so that he might be knowing of everything, He created him from the dust of the Earth (turab al-ard)—the lowest existing creation, beyond which there is no beyond, just as there is no goal beyond Allah. He made his dwelling place in the noblest of locations, which is the point upon which the tent poles rest. He made the encompassing Throne (al-Arsh al-Muhit) the place of the Merciful’s Establishment (al-Istiwā’ al-Rahmani), as befits His Majesty, signifying the Divine connection (al-Irtibat al-Ilahi) between the Throne and the Earth, and between them the Levels (al-Maratib) of the delimited Cosmos (al-Alam al-Mutahayyiz), which encompasses the spaces of the celestial spheres (al-Aflak) and the elements (al-Arkan). The entire Cosmos (al-Alam) is within the cavity of the Throne, except for the Earth, which is the seat of the couch.\n\nWhen Allah willed to create us for His worship, He shortened the path for us. He created us from dust, in dust, which is the Earth that Allah made subservient (dhalūl). And worship (al-Ibadah) is humility (al-Dhillah). Thus, we are the humble ones by origin. We are not like those created as light from Light and commanded to worship, for whom the distance was great due to the remoteness of their origin from that to which He called them—His worship. Had Allah not made them witness that He created them in their stations (Maqamat) from the beginning, they would not have descended from them, and thus they would have had no ascent in their worship, as we do. They would not have been able to fulfill the obligation of worship, for light possesses glory, not humility. It was out of Allah’s care for us, since the purpose of our creation was His worship, that He shortened the path for us by creating us from the Earth, in which He commanded us to worship Him.\n\nWhen some of us worshipped other than Allah, Allah became jealous that other than Him should be worshipped in His Earth, so He said: <<And your Lord has decreed (qada) that you worship none but Him>> (Q. 17:23). That is, He judged. Thus, no one who worshipped other than Allah worshipped anything except due to this decree. Therefore, only Allah was worshipped, even if they erred in the attribution, since Allah has a specific Face (Wajh Khass) in everything by which that thing is established. No one has ever departed from the worship of Allah.\n\nWhen Allah willed to distinguish between those who worshipped Him exclusively (ala al-Ikhtisas) and those who worshipped Him within things, He commanded emigration from the earthly places where Allah is worshipped in the essences (al-A'yan), <<so that Allah may distinguish the wicked from the good>> (Q. 8:37). The wicked is he who worshipped Allah in the others (al-Aghyar), and the good is he who worshipped Allah not in the others. The Exalted made this Earth the locus of the Vicegerency (al-Khilafah). It is the abode of His dominion and the place of His Deputy (Na'ib) who is manifest through the rulings of His Names (Asma'). From it He created us, and in it He settled us, alive and dead, and from it He will bring us forth by the Resurrection (al-Ba'th) in the Other State of Being (al-Nash'ah al-Ukhra), so that worship does not leave us wherever we are, in this world or the Hereafter. Although the Hereafter is not the abode of obligation (dar Taklif), it is the abode of worship (dar Ibadah).\n\nWhoever among us remains witnessing (mushahidan) that for which he was created, in this world and the Hereafter, that one is the Perfect Servant (al-Abd al-Kamil), the intended purpose of the Cosmos, the Deputy for the entire Cosmos. If the entire Cosmos, its high and low parts, were to neglect the remembrance of Allah (Dhikr Allah) for a single moment, and this servant were to stand in that remembrance, he would stand in the remembrance on behalf of the entire Cosmos, and by him, the Existence (al-Wujud) of the Cosmos would be preserved. If the human servant (al-Abd al-Insani) were to neglect the remembrance, the Cosmos would not stand in his place in that, and the part of it from which the remembering human departed would be ruined.\n\nThe Prophet, peace and blessings be upon him, said: \"The Hour will not commence while there is anyone on Earth who says, 'Allah, Allah.'\"\n\nWhen Allah created this human state of being and honored it with the comprehensiveness (al-Jam'iyyah) with which He honored it, He installed the Claim (al-Da'wa) within it, so that its form might be perfected thereby. For the Claim is a Divine Attribute (Sifah Ilahiyyah). The Exalted said: <<Indeed, I am Allah. There is no deity except Me, so worship Me>> (Q. 20:14). He claimed that there is no deity but Him, and this is a truthful claim. Whoever makes a truthful claim is not subject to argument and possesses authority (al-Sultan) over anyone who rejects his claim, because he possesses strength, dominance, and subjugation, for he is truthful, and truthfulness is strength, which cannot be resisted.\n\nSince the claim is a statement, and a statement equally admits the possibility of truthfulness and falsehood, we know that testing (al-Ikhtibar) is necessary. The believer claims faith (al-Iman), which is the affirmation of Allah's Existence, His Oneness (Ahadiyyah), that there is no deity but Him, that <<everything will perish except His Face>> (Q. 28:88), and that the command belongs to Allah before and after. When he claims with his tongue that this is what his heart contains and what his inner being is bound to, it is possible that he is truthful in claiming that this is his attribute, and it is possible that he is false in claiming that this is his attribute. So Allah tests him to establish the proof (al-Hujjah) for him or against him, by obligating him to worship Him exclusively, not the worship that permeates through the permeation of Divinity (al-Uluhiyyah).\n\nAllah set up the means (al-Asbab) before his eyes and made the fulfillment of the needs of this claimant dependent upon these means. Nothing is decreed for him except through them and by their hands. If Allah grants him a light (Nur) by which he unveils and penetrates the darkness of these means, so that he sees the Real (al-Haqq) the Exalted behind them as the Causer, or sees Him within them as the Creator and Originator of the needs that compel him—that is the believer who is upon a light from his Lord and a clear proof of his affair, truthful in his claim, fulfilling the right of the station (al-Maqam) he claimed through the Divine care (al-Inayah al-Ilahiyyah) granted to him. But for him <<whom Allah has not granted light, he has no light>> (Q. 24:40).\n\nAfter acknowledging the Lordship (Rububiyyah) of his Creator, when He made him witness himself during the taking of the Covenant (al-Mithaq), when He said to him and his like, <<Am I not your Lord? They said, 'Yes'>> (Q. 7:172)—when He brought him into existence in this world, He brought him forth upon that primordial nature (al-Fitrah). Yet, he affirmed the divinity of the means through which Allah provided for him, making them veils (Hujub) between him and Allah. He had no light to guide him in the darkness of the land and the sea, and there are only the stars, which here are the stars of Divine Knowledge (al-Ilm al-Ilahi). So he attributed divinity to what does not deserve it, and thus was false in his claim, due to the multiplicity of means and his affirmation in his polytheism (Shirk) that this was a means of drawing closer to Allah, the Creator of the means, making them deities (Alihah). Thus, his saying, \"There is no deity except Him,\" was not truthful. This is why some said: <<Has he made the deities into one God? Indeed, this is a surprising thing!>> (Q. 38:5). The only surprising thing is the one who multiplied the deities. As for the one who did not attribute divinity to the means but saw nothing but the means, and did not attain the Unveiling (al-Kashf) that would take him beyond them, despite affirming the Oneness of Divinity (Tawhid al-Uluhiyyah)—that was a subtle polytheism (Shirk Khafiyy) of which its possessor is unaware that it is polytheism, and it veils him from the High Command that he sought. The possessor of this claim regarding the Oneness of Allah and the Oneness of His Acts (Tawhid fi Af'alihi) was not found to be truthful when he was agitated upon the loss of the means and tranquil upon their existence. Thus, his deficiency is commensurate with what he missed of that, even though he did not make the means deities.\n\nIf you say: \"The polytheist (al-Mushrik) who claims that he is a polytheist is truthful in his claim that he is a polytheist, so why does his truthfulness not benefit him?\" We say: He is false in his claim regarding the attribution of divinity to what is not God—this is the claim by which he disbelieved. He is truthful in that he is a polytheist, but he is not truthful in that the partnership in Divinity (al-Shirkah fi al-Uluhiyyah) is correct, because he investigated that with rational and legal proofs and found no substance of truth in what he claimed.\n\nAllah tested the servants with what He legislated for them by sending Messengers, and He tested the believers with the means. Every category was tested according to its claim. Whoever was truthful, that truthfulness bequeathed to him what his claim entails. This is why the truthful ones (al-Sadiqin) are questioned about their truthfulness: whether they were truthful in what they were commanded and permitted, or whether they were truthful in committing what was forbidden to them, despite being truthful. They will be asked: \"In what were you truthful?\" For slanderers are truthful, and backbiters are truthful, yet Allah condemned them and threatened punishment for that, even though it is truthfulness. Therefore, the truthful ones are questioned about their truthfulness in what they were truthful about. This is part of Allah's testing of them.\n\nThe root of all this is the claims installed within them, and the way Allah tested them in the address is that He made what He afflicted them with a means <<so that Allah may know>> (Q. 3:142) the truthful in his claim from the liar. In this testing, He placed Himself in the position of one who gains knowledge thereby, even though He, glory be to Him, is the Knower of what will happen from them before it happens. Among those who claim transcendence (al-Munazzihah) is he who says that Allah does not gain knowledge from this, for he does not know the matter as it specifically occurs from a certain person—and thus he rejects the word of Allah and interprets it, fearing that harm might befall Him because of it. Among the literalists (al-Dhahiriyyah) is he who insists that He gains knowledge through this testing, adhering strictly to the literal wording. And among the people are those who divert that to the attachment of Knowledge (Ta'alluq al-Ilm) upon occurrence: Knowledge is eternal (Qadim), but the attachment is temporal (Hadith). Among the believers are those who submit the knowledge of this to Allah and believe in it without specific interpretation, and this is the safest belief. All of this is a trial (Ibtila') from Allah for His servants who claimed faith with their tongues, for He said: <<until We know>> (Q. 47:31), just as He said: <<And We will surely test you>> (Q. 2:155), and He said: <<Or did you think that you would enter Paradise while Allah has not yet known those who strove among you and known the patient?>> (Q. 3:142). Thus, He distinguished between them so that He may reward the striver with a specific reward and reward the patient one with a specific reward. And He said: <<Allah will surely know those who spoke the truth, and He will surely know the liars>> (Q. 29:3), when He mentioned the trial (al-Fitnah), which is the testing.\n\nIf a person looks at his physical state of being (Nash'ah al-Badaniyyah), the Earth from which he was created stands with him, and from which his sustenance and the soundness of his state of being are derived. Ordinarily, Allah does not provide for him from anything else. If Allah breaks the custom (Kharq al-Adah) for someone by not providing for him from it, He provides for him from a subtle natural matter, which is the means by which his life is sustained. He preserves his heat and moisture, which are the material of his life, by a subtle matter known only to Allah or to him whom Allah informs of it. This is because when Allah established the means, He never removed them for anyone. Rather, Allah granted some of His servants a Light by which they were guided in walking through the darkness of the means, but not otherwise. They witnessed this according to the measure of their lights. The veils of the means are drawn and never lifted.\n\nDo not covet, for even if the Real moves you from one means, He only moves you to another means. He never deprives you of means entirely, for it is the Rope of Allah (Habl Allah) which He commanded you to hold fast to—it is the revealed Law (al-Shar' al-Munazzal), the strongest and most truthful of means. In His Hand is the Light by which one is guided in the darkness of the land and sea of these means. \"Whoever does such-and-such (the means), his reward is such-and-such.\" So do not covet what cannot be coveted. Rather, ask Allah the Exalted for a sprinkling of that Light upon your Essence (Dhat). Among the subtle matters He manifested is that He made your body porous and surrounded you with the air which is the material of natural life, for it is inherently hot and moist. He placed within you an attractive force. You may attract air from your pores when you lack the customary means, and you nourish your body with it without realizing it. We know that some insects sustain themselves by drawing moisture through the pores of their bodies according to a specific measure, by which they maintain subsistence (al-Baqa') without excess or deficiency.\n\nThen know, O beloved brother (al-Akh al-Wali), that the earth of your body is the truly Vast Earth (al-Ard al-Haqiqiyyah al-Wasi'ah) in which the Real commanded you to worship Him. This is because He only commanded you to worship Him in His Earth as long as your spirit (Ruh) dwells in the earth of your body. If it departs from it, this obligation (al-Taklif) is dropped from you, even though your body remains buried in the Earth. Thus, know that the Earth is none other than your body. He made it vast because of the powers and meanings it contains, which are found only in this human physical earth (al-Ard al-Badaniyyah al-Insaniyyah).\n\nAs for His saying, <<for you to emigrate therein>>, it is the locus of passion (al-Hawa) and the locus of intellect (al-Aql). So you emigrate from the earth of passion within it to the earth of intellect within it. In all this, you remain in it; you have not departed from it. If passion employs you, it destroys you and you perish. If the intellect, which holds the lamp of the Law (Siraj al-Shar'), employs you, you are saved, and Allah saves you through it. For the sound intellect, free from the attributes of deficiency and doubt, is that whose eye of insight (Ayn Basiratihi) Allah has opened to perceive things as they are, so it deals with them according to their due right, giving every possessor of a right his right.\n\nWhoever does not worship Allah in the vast earth of his body has not worshipped Allah in the Earth from which he was created. For Allah says: <<And He began the creation of man from clay. Then He made his progeny from an extract of water despised>> (Q. 32:7-8), which is the water that sprang from this physical earth and settled in the woman's womb. Then He proportioned him. After the proportioning of the earth of the body and its readiness to ignite due to the moisture and heat within it, Allah breathed into it, and it ignited. That ignition was a spirit for him. It did not emerge except from it. The intellect in this state of being is made analogous to the moon on Earth—a light by which one is illuminated—but it lacks penetration due to the hindering veils of houses, walls, and coverings. Allah made the Law a lamp for this intellect in this physical earth. The corners of this earth were illuminated by the light of the lamp, granting knowledge of what is within it, which the light of the intellect, which is like the moon, did not grant.\n\nThen He returns us into it—meaning into the Other State of Being (al-Nash'ah al-Ukhra) as well, just as He created us in it—and brings us forth for His Witnessing (Mushahadatihi), just as He originated us from it and brought us forth for His worship. He created our spirits from the earth of our bodies in this world for His worship, and He settles us in the earth of our bodies in the Hereafter for His Witnessing, if we are among the fortunate, just as we believed in Him in the First State of Being (al-Nash'ah al-Ula), due to Allah's care for us. The situation is exactly the same in the division of creation in that regard, and thus they will be tomorrow. Death (al-Mawt) between the two states of being is an intermediary state (Halah Barzakhiyyah). In it, the spirits inhabit intermediary, imaginative bodies (Ajsad Barzakhiyyah Khiyaliyyah), just as they inhabit them in sleep. These are bodies generated from these earthy bodies, for Imagination (al-Khayal) is a power among its powers. Thus, their spirits have not departed from them or from what originated from them.\n\nKnow that the Earth of Allah, which is a fundamental pillar, is where you are buried. You are commanded to worship your Lord as long as you are in the vast earth of your body, along with the existence of your intellect and the lamp of your Law. You are commanded to worship your Lord until the time of your death. Whoever dies, his Resurrection (Qiyamah) has commenced—that is the partial Resurrection (al-Qiyamah al-Juz'iyyah). This is His saying: <<And in it We will return you>> (Q. 20:55). If you understand the partial Resurrection upon the death of this specific person, you will know the general Resurrection (al-Qiyamah al-Ammah) for every deceased person who was upon it. For the duration of the Isthmus (Barzakh) is to the Other State of Being like the woman carrying the fetus in her womb, whom Allah creates stage after stage. The stages of creation vary for it until it is born on the Day of Resurrection. This is why it is said of the deceased that when he dies, his Resurrection has commenced—meaning the manifestation of the Other State of Being begins for him in the Barzakh until the Day of Resurrection from the Barzakh, just as one is brought forth from the womb to the Earth by birth. The management of his body's state of being in the Earth during his time in the Barzakh is to proportion and rectify it according to an unprecedented model, suitable for the Abode of the Hereafter. He will worship Him therein—meaning in the earth of his Akhira state of being—a self-subsistent worship (Ibadah Dhatiyyah), not a worship of obligation, for Unveiling prevents him from being a servant to anyone other than Him who deserves to be served, just as the Men of Allah attain this station here.\n\nWhen Allah created the earth of your body, He placed within it a Ka'ba, which is your heart (Qalb). He made this cardiac House (al-Bayt al-Qalbi) the noblest of houses in the believer. He informed us that the heavens, which contain the Frequented House (al-Bayt al-Ma'mur), and the Earth, which contains the Ka'ba, did not contain Him and were too narrow for Him, but this heart of this believing human state of being contained Him. The vastness referred to here is the Knowledge of Allah (al-Ilm bi-Allah), glory be to Him. This indicates to you that it is the Vast Earth and that it is the earth of your worship.\n\nSo you worship Him as if you see Him (ka'annaka tarahu) from the perspective of your sight (Basar), because your heart is veiled from being perceived by your sight, for it is in your inner being (al-Batin). You worship Allah as if you see Him in your Essence (Dhatik) as befits His Majesty, and the eye of your insight witnesses Him, for He is manifest to it as the manifestation of Knowledge (Zuhur Ilm). Thus, you see Him with the eye of your insight, and as if you see Him from the perspective of your sight. In your worship, you combine the two forms: that which He deserves of worship in the Imagination (al-Khayal) and that which He deserves of worship outside the locus of Imagination. Thus, you worship Him absolutely (Mutlaqan) and restrictedly (Muqayyadan). This is not granted to any other state of being. For this reason, He made this believing state of being His Sacred Sanctuary (Haramuhu al-Muharram) and His magnified, honored House. I have alluded to this meaning in my saying:\n\nWhoever is entirely the Real (Haqq),\nAll of him has vanished.\nOr you are His shadow within it,\nThen the Command (al-Amr) is entirely the Real.\nThe Real is a standing Person,\nAnd you are His shadow from Him.\nHis sanctuary is revered,\nSo the permissible (al-Hill) does not violate it.\nFrom everything that is unfitting,\nFor He holds it in high esteem.\n\nEvery creature in Existence (al-Wujud) worships Allah based on the Unseen (ala al-Ghayb), except for the Perfect Human who is a believer, for he worships Him based on Witnessing (ala al-Mushahadah). The servant is not perfected except through faith. He possesses the radiant Light (al-Nur al-Sati'), rather, he is the radiant Light that removes all darkness. When he worships Him based on Witnessing, all his powers see Him. None other than him stands in His worship, nor should any other stand in it. No one has attained this station except the human believer, for he is only a believer by his Lord, for He, glory be to Him, is the Believer (al-Mu'min).\n\n[That Allah Did Not Create Creation Upon a Single Temperament]\n\nKnow that if you are not in this station and have no footing in this degree, I will guide you to what will grant you the highest degree. This is to know that Allah did not create creation upon a single temperament (Mizaj Wahid); rather, He made their temperaments varied. This is witnessed by intuition and necessity, due to the differences among people in rational consideration and faith. You have received through the path of the Real that the human is the mirror of his brother, seeing in him what the person does not see in himself except through the mediation of his like. For the human is veiled by his passion and enamored of it. When he sees that attribute in another, and it is his own attribute, he perceives the flaw of his own self in the other, knowing its ugliness if it is ugly, or its beauty if it possesses beauty.\n\n[That the Messengers Have the Most Balanced Temperaments for Accepting the Messages of Their Lord]\n\nKnow that mirrors vary in shape, and they render the reflected image to the viewer according to their shape—whether long, wide, straight, crooked, round, deficient, excessive, or multiple. Everything is given by the shape of that mirror. You know that the Messengers (al-Rusul) have the most balanced temperaments (A'dal al-Amzijah) for accepting the messages of their Lord. Each person among them accepted from the Message (al-Risalah) only the measure that Allah granted him in his temperament's composition. No Prophet was sent except specifically to a designated people, because he was upon a specific, restricted temperament. But Muhammad, peace and blessings be upon him, was only sent by Allah with a universal message (Risalah Ammah) to all people collectively. He only accepted such a message because he was upon a universal temperament (Mizaj Amm) that encompassed the temperament of every Prophet and Messenger. Thus, he has the most balanced, most complete, and most upright of all temperaments.\n\nIf you know this and wish to see the Real in the most complete way that He ought to appear to this human state of being, know that you do not possess, nor are you upon, a temperament like that of Muhammad, peace and blessings be upon him. Whatever the Real discloses Himself to you in the mirror of your heart, your mirror only shows it to you according to the measure of its temperament and the form of its shape. You already know your descent from the degree that was sound for Muhammad, peace and blessings be upon him, in the Knowledge of his Lord in his state of being.\n\nTherefore, adhere to faith and emulation (al-Ittiba'). Place him before you like the mirror in which you view your image and the image of others. If you do this, you will know that Allah the Exalted must disclose Himself to Muhammad, peace and blessings be upon him, in his mirror. I have informed you that the mirror has an effect on the viewer's perception of the reflected image. Thus, the manifestation of the Real (Zuhur al-Haqq) in the mirror of Muhammad, peace and blessings be upon him, is the most complete, most balanced, and most beautiful manifestation, due to the nature of his mirror. If you perceive Him in the mirror of Muhammad, peace and blessings be upon him, you have perceived a perfection of Him that you did not perceive through looking into your own mirror. Do you not see in the chapter of Faith and what came in the Message concerning matters that the Real attributed to Himself through the tongue of the Law, which the intellects deem impossible? Were it not for the Law and faith in it, we would not accept any of that from the perspective of our rational consideration; rather, we would reject it outright and deem the speaker ignorant. Just as He granted him through the Message and Faith what intellects lacking faith fell short of perceiving from the side of the Real, so too have our temperaments and the mirrors of our intellects fallen short, during Witnessing, of perceiving what manifested in the mirror of Muhammad, peace and blessings be upon him, in their own mirrors. Just as you believed in him regarding the Message as Unseen (Ghayban), you witness Him in this Prophetic Theophany (al-Tajalli al-Nabawi) as manifest reality (Aynan).\n\nWere it not for him, and were it not for us,\nThat which was, would not have been.\nNor would messages have come,\nFrom the All-Merciful, our Master.\nWith tidings and rulings,\nAnd that was named clarification.\nAnd Torah and Gospel,\nAnd Criterion (Furqan) and Quran.\nAnd those of understanding named it,\nWith thoughts, a proof (Burhan).\nAnd He made that threefold: Submission (Islam),\nAnd Faith (Iman), and Spiritual Excellence (Ihsan).\nSo glory be to Him who journeyed\nWith him so that he might see Him as the Benefactor.\nAnd He singled out with the Form of the Merciful (Surat al-Rahman)\nHim whom He named Human (Insan).\nAnd His Messengers came successively,\nIn groups and individually.\nAnd He gave us and favored us,\nHere, what He willed to keep hidden.\nAnd Gardens and rivers,\nAnd Spirit (Ruh) and sweet basil.\nAnd Unveiling (Kashf) and then Witnessing (Ishhad),\nAnd secrets and declarations.\n\nI have advised you and been thorough in my advice. Do not seek the Witnessing of the Real (Mushahadat al-Haqq) except in the mirror of your Prophet, peace and blessings be upon him. Beware of witnessing Him in your own mirror, or witnessing the Prophet and the Real who manifested in his mirror, in your mirror. For that will lower you from the high degree. Adhere to emulation and following. Do not tread upon a place where you do not see the footprint of your Prophet. Place your foot upon his footprint if you wish to be among the people of the highest degrees and complete Witnessing in the station of proximity (al-Makanah al-Zulfa). I have been thorough in my advice as commanded. <<And Allah guides whom He wills to a straight path>> (Q. 10:25).\n\nIn this station are the sciences of the level of estimation and conjecture, the science of Divine Confirmation (al-Taqrir al-Ilahi), the science of secrets hidden from most people, the science of the Solitaries (al-Afrad), the science of great battles, and the science of the Race (al-Musabaqah) and where the racetrack between Allah and His servants lies. This is a noble science containing Divine Mercy (al-Rahmah al-Ilahiyyah) that no describer can describe. It contains the science of refuting those who affirm the execution of the threat (Infadh al-Wa'id) and the universality of Mercy (Shumul al-Rahmah) for all. This is because when a person disobeys, he exposes himself to retribution and affliction, and he is running in the course of retribution due to what he committed. Allah races him in this track from the perspective of His being the Forgiving, the Pardoner, the Overlooker, the Merciful, and the Compassionate. The servant races the Real the Exalted toward retribution with sins and evil deeds, but the Real is swifter. He precedes the retribution before the servant reaches it with his evil deeds, and He overtakes it with the Forgiving and its sister Names. When the servant reaches the end of the course in this track, he finds that retribution has been overtaken by the Forgiving, who stands between him and the disobedient ones. They had judged that they would reach it before this. This is His saying in the chapter Al-Ankabut: <<Or do those who commit evil deeds think that they can outstrip Us?>> (Q. 29:4). That is, outstrip Us with their evil deeds before My forgiveness and the universality of My Mercy. <<Evil is what they judge.>> Rather, the precedence belongs to Allah with Mercy for them. This is the ultimate generosity. This only occurs in the group that affirms the execution of the threat for those who die without repentance. When the disobedient one dies, the Mercy of Allah receives him in the place where Allah wills to receive him.\n\nIt contains the science of the Prophet’s saying, peace and blessings be upon him: \"Whoever loves the meeting (Liqā') of Allah, Allah loves his meeting; and whoever dislikes the meeting of Allah, Allah dislikes his meeting.\" He did not say, \"He will not meet Him.\" Allah only disliked the meeting that the servant disliked, which is to meet Him while He is seizing him for his crime and taking vengeance. Allah disliked meeting him with what this wrongdoer disliked, so He met him with forgiveness and satisfaction (al-Ridwan), because He knew that the servant only disliked the meeting of Allah—despite being a believer in meeting Him—because of the disobedience he was upon. So Allah disliked meeting him with the punishment that disobedience deserves, and thus met him with pardon and forgiveness.\n\nIt contains the science of what the Essence (al-Dhat) deserves for itself, not from the perspective of its being qualified as God (Ilah). It contains the science that although all matters return to Allah, after observing them, Allah returns them to His servants as He wills. It contains the science of sending down veils (al-Sutur) between the believing souls and transgressions, and for those who transgress, veils are sent down between them and punishments. It contains the science of Allah’s dealing with His servants in a way that accords with their purposes. It contains the science of the station of the means established in the Cosmos that have effects therein. It contains the science of what the means call one to, and what should be answered from them and what should not. It contains the science of joining the distant to the near, and the low to the high, in their cohesion. It contains the science of the ignorance of him who equates the Real and Creation (al-Khalq), and of him who is ignorant of the levels of the Cosmos in the sight of Allah. It contains the science of Exegesis (al-Tafsir) and Distinction (al-Tamyiz). It contains the science of what returns to the worker from his deed and what does not return. It contains the science of the lifespans of things, which is the subsistence of a thing until the time of the corruption of its form, by the removal of which the name it deserved—whether mineral, plant, or animal—is removed from it. It contains the science of the Divine Seizing (al-Akhdh al-Ilahi) through cosmic means, and that everything seized by Him is a soldier among the soldiers of Allah. It contains the science of the Cosmos being signs (Ayat) for one another. It contains the science of advice from believers and non-believers. It contains the science of clarifying knowledge through proofs. It contains the science of what is needed at every time. It contains the science of Consideration (al-I'tibar). It contains the science of Will (al-Iradah) and Wishing (al-Mashi'ah). It contains the science of whom one should rely upon in matters and whom one should not. It contains the science that whoever intends evil for his believing brother, it returns upon him, and this runs through every species of nations. It contains the science of him who hastens an attribute of the Day of Resurrection here, and what his ruling is with Allah. It contains the science of Emigration and the Emigrant. It contains the science of the Gift (al-Wahb) from other than the Giver (al-Wahib). It contains the science of what led the ignorant person, despite his knowledge, to say: <<If this is the truth from You, then rain down upon us stones from the sky or bring us a painful punishment>> (Q. 8:32), and similar statements, such as his saying: <<Bring us the punishment of Allah, if you should be of the truthful>> (Q. 29:29). Look into this Divine report, for it is an exaggeration of their denial, since if they had considered the possibility of the Messenger being truthful, they would not have said such a thing, for souls are naturally disposed to attract benefits and repel harms. It contains the science of gentleness toward the nations and the supplication of their Prophets against them. It contains the science of the knowledge of the Hereafter and the Final Time, and why one returns when there is no sun rising and no night approaching. It contains the science of the variation of means. It contains the science of the levels of those who take deities besides Allah. It contains the science of the distinction of the scholars and the Divine sages (al-Hukama' al-Ilahiyyin). It contains the science of what the believer should persevere in. It contains the science of the Craft and the Craftsman. It contains the science of dispute in Hadith and the levels of the disputants. It contains the science of the summarized from the decisive, from the difficult, from the ambiguous (al-Mutashabih). It contains the science of the attachment of faith to what is not the Real, such as His saying: <<And those who believed in falsehood (al-Batil)>> (Q. 29:52). It contains the science of the motive that necessitates hastening the seeking of wretchedness. It contains the science of the stations of Faith and Proximity (al-Zulf). It contains the science of the levels of Patience (al-Sabr) and Reliance (al-Tawakkul). It contains the science of him who knew the Real but avoided it, and what is praised in that and what is blamed, such as the Real that is commanded to be avoided, like backbiting. It contains the science of praised and blamed Expansion (al-Bast). It contains the science of him who knew a matter and was told what he knew. It contains the science of the Life (al-Hayah) that permeates existing things, its hiddenness in this world and its manifestation in the Hereafter, and by which sight those who unveiled it in this world unveiled it. It contains the science of Compulsion (al-Idtirar) and how it vanishes with its vanishing. It contains the science that the paths to Allah, though they differ, are all true, and what is praised and blamed among them, and what leads to felicity (al-Sa'adah) and what deviates its traveler from his felicity, even though he reaches Allah. It contains the science of the Divine Concomitance (al-Ma'iyyah al-Ilahiyyah) and the levels of existing things within it. This is some of what this station encompasses of the sciences. <<And Allah speaks the truth, and He guides to the way>> (Q. 33:4).",
    "ur": "باب نمبر تین سو پچپن: سبلِ مولدہ (پیدا شدہ راستوں) کے مقام، زمینِ عبادت (أرض العبادة) کی معرفت، اس کی وسعت، اور اللہ تعالیٰ کے اس فرمان کے بیان میں: \"اے میرے بندو جو ایمان لائے ہو، بے شک میری زمین وسیع ہے، پس تم میری ہی عبادت کرو۔\" (يَا عِبَادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ)\n\nاللہ کی زمین کتنی وسیع ہے، اور اللہ کا آسمان اس سے نکاح کرتا ہے۔\nبند دروازوں کا مجموعہ، جسے جود و سخا کا دایاں ہاتھ کھولتا ہے۔\nوہ سینے جن میں ٹھکانہ تنگ ہو گیا، علم کے نور سے انہیں کشادہ کرتا ہے۔\nراز کی مبہم چیزیں تاریک ہیں، اور علومِ کشف (الکشف) انہیں واضح کرتے ہیں۔\nہر وہ نعمت جو تمہیں دی گئی، وہ احسان کی بارگاہ عطا کرتی ہے۔\nپھر اگر اس میں فساد برپا ہو جائے، تو امید ہے کہ رحمن اسے درست کر دے گا۔\nپھر اگر وہ سرکشی کرے یا عدل کرے، تو ہدایت کی لگام اسے قابو میں رکھتی ہے۔\nہر وہ دعویٰ جو سچا نہ ہو، عجز کی زبان اسے فاش کر دیتی ہے۔\nمصیبت زدہ کا بازو ہر تکلیف سے، کائنات کی آزمائش سے، اسے چمکاتا ہے۔\n\n### [فتح کے بعد کوئی ہجرت نہیں]\n\nاللہ تعالیٰ نے فرمایا: \"کیا اللہ کی زمین وسیع نہ تھی کہ تم اس میں ہجرت کرتے؟\" (أَلَمْ تَكُنْ أَرْضُ اللَّهِ وَاسِعَةً فَتُهَاجِرُوا فِيهَا) اور یہ نہیں فرمایا کہ \"اس سے\" یا \"اس کی طرف\"۔ پس یہ اللہ کی زمین (الأرض) ہے، خواہ اس میں وہ شخص رہے جو اس کی عبادت (العبادۃ) کرتا ہے یا وہ جو اس کی عبادت سے تکبر کرتا ہے۔ اور اللہ عزوجل نے فرمایا: \"اے میرے بندو جو ایمان لائے ہو، بے شک میری زمین وسیع ہے، پس تم میری ہی عبادت کرو۔\" (يَا عِبَادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ) پس اللہ نے اس زمین کو اپنی طرف ایسی شدید اضافت دی جو اس کے فرمان \"بے شک زمین اللہ ہی کی ہے\" (إِنَّ الْأَرْضَ لِلَّهِ) سے بھی زیادہ ہے۔ اسی طرح اس نے بندوں کو اپنی طرف اضافت دی، اور زمین کی اضافت اختصاص کی اضافت ہے۔ اسی طرح اس نے انہیں عبادت (العبادۃ) کے حکم میں اپنی طرف منسوب کیا، پس فرمایا: \"پس تم میری ہی عبادت کرو۔\" (فَإِيَّايَ فَاعْبُدُونِ) اور اس مقام کے علاوہ فرمایا: \"اللہ کی عبادت کرو\" (اعْبُدُوا اللَّهَ) اور \"اپنے رب کی عبادت کرو\" (وَاعْبُدُوا رَبَّكُمُ)۔ پس جس نے متکلم (اللہ) کی طرف اس اضافت کی قدر پہچانی، اس نے دونوں اضافتوں کے درمیان فرق کو پہچانا، اگرچہ عبادت کا مقصود ایک ہی ہے۔ پس اس نے متکلم کی طرف ان کی اضافت میں تنگی میں وسعت دی، اور اسم کی طرف ان کی اضافت میں وسعت دی۔ اور یہاں ایسے اسرار ہیں جنہیں صرف وہی جانتا ہے جو امر کو اس کی اصل حقیقت پر جانتا ہے۔ اور یہی وہ بات ہے جو آپ صلی اللہ علیہ وسلم نے مکہ کی فتح (الفتح) کے وقت فرمائی: \"فتح کے بعد کوئی ہجرت (الھجرۃ) نہیں۔\"\n\nحالانکہ مکہ تمام مقامات میں سب سے زیادہ شرف والا ہے اور وہ اللہ کا گھر ہے جس کی طرف زمین کے مشرق و مغرب سے حج کیا جاتا ہے، لیکن اس سے ہجرت کرنے والے کے لیے اجر کا حکم اور عظمت اس کے باشندوں کی وجہ سے تھی۔ پس جب اللہ نے اسے فتح کر دیا اور اپنے مومن بندوں کو اس میں بسایا، تو فرمایا: \"فتح کے بعد کوئی ہجرت نہیں۔\"\n\nپس جس پر اللہ نے فتح (الفتح) کر دی، وہ اسے ہر شے میں یا ہر شے کی عین میں دیکھتا ہے، لہٰذا وہ ہجرت نہیں کرتا کیونکہ وہ کسی چیز سے محروم نہیں ہے۔ اگر وہ ہجرت کرتا ہے تو اس کے حکم سے، پس وہ اس کے ذریعے اس سے اس کی طرف ہجرت کرتا ہے، اس کے حکم سے۔ جیسے جماعت کی نماز کے لیے مسجد کی طرف نکلنا، اور جیسے حج کے ارادے سے مکہ کی طرف نکلنا، اور اسی طرح جہاد کے لیے نکلنا، اور زیارت کے لیے، یا اللہ تعالیٰ میں کسی بھائی کی زیارت کے لیے، یا اہل و عیال کی کفالت کے لیے کوشش کرنا۔ یہ سب حقیقت میں ہجرت (الھجرۃ) نہیں ہے، بلکہ یہ ایک الٰہی حکم کے تحت شہود (الشہود) پر مبنی سیاحت ہے۔ اگر یہ شہود (الشہود) پر نہ ہو یا شہود جیسا نہ ہو، تو یہ اس مقام پر ہمارا مطلوب نہیں ہے۔ کیونکہ احسان کا ادنیٰ درجہ یہ ہے کہ تم اللہ کی عبادت (العبادۃ) اس طرح کرو گویا تم اسے دیکھ رہے ہو۔\n\nاور جب اللہ نے انسان کامل (الإنسان الکامل) کو دونوں صورتوں پر پیدا کیا، جو دونوں نشأتوں (النشأۃ) میں موجود ہے، جس کے لیے اللہ نے دو ناموں، اول اور آخر، کو جمع کیا، اور اسے ظاہر و باطن میں دو حکم عطا کیے تاکہ وہ ہر شے کا جاننے والا ہو، تو اسے زمین کی مٹی سے پیدا کیا، جو سب سے نچلی موجود (موجود) مخلوق ہے، جس کے بعد کوئی اور نہیں، جیسا کہ اللہ کے بعد کوئی ٹھکانہ نہیں۔ پس اس نے اس کا ٹھکانہ اشرف ترین جگہ میں بنایا، اور وہ وہ نقطہ ہے جس پر خیمے کے ستون قائم ہوتے ہیں۔ اور عرشِ محیط کو رحمانی استواء کا مقام بنایا، جیسا کہ اس کے جلال کے لائق ہے، تاکہ عرش اور زمین کے درمیان اور ان کے درمیان موجود عالمِ متحیز (متحرک عالم) کے مراتب، جو افلاک اور ارکان کے لیے عام ہیں، کے درمیان الٰہی ربط کا اعلان ہو۔ پس تمام عالم عرش کے جوف میں ہے، سوائے زمین کے، کیونکہ وہ تخت کا ٹھکانہ ہے۔\n\nپس جب اللہ نے ہمیں اپنی عبادت (العبادۃ) کے لیے پیدا کرنے کا ارادہ کیا، تو اس نے ہم پر راستہ قریب کر دیا، پس ہمیں مٹی میں مٹی سے پیدا کیا، اور وہ زمین ہے جسے اللہ نے ذلول (نرم) بنایا، اور عبادت (العبادۃ) ذلت ہے۔ پس ہم اصل میں ذلیل ہیں، ہم اس سے مشابہت نہیں رکھتے جسے نور سے پیدا کیا گیا اور عبادت کا حکم دیا گیا، تو ان پر مسافت دور ہو گئی کیونکہ اصل اس چیز سے دور تھا جس کی طرف انہیں بلایا گیا تھا، یعنی اس کی عبادت۔ اگر اللہ انہیں ان کے مقامات پر ابتداءً پیدا کر کے شہود (الشہود) نہ کراتا، تو وہ ان سے نیچے نہ اترتے، پس ان کی عبادت میں کوئی ارتقاء نہ ہوتا جیسا کہ ہمارے لیے ہے۔ وہ عبادت کا حق ادا کرنے کی طاقت نہ رکھتے، کیونکہ نور کے لیے عزت ہے، ذلت نہیں۔\n\nپس اللہ کی ہم پر عنایت میں سے یہ ہے کہ جب ہماری تخلیق کا مطلوب اس کی عبادت تھی، تو اس نے ہم پر راستہ قریب کر دیا کہ ہمیں اس زمین سے پیدا کیا جس میں ہمیں اس کی عبادت کا حکم دیا گیا۔ اور جب ہم میں سے کسی نے غیر اللہ کی عبادت کی، تو اللہ کو غیرت آئی کہ اس کی زمین میں اس کے سوا کسی اور کی عبادت کی جائے، پس فرمایا: \"اور تیرے رب نے فیصلہ کر دیا کہ تم اس کے سوا کسی کی عبادت نہ کرو۔\" (وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ) یعنی حکم دیا۔ پس جس نے بھی غیر اللہ کی عبادت کی، اس نے اسی حکم کی وجہ سے کی، پس اس نے اللہ کے سوا کسی کی عبادت نہیں کی، اگرچہ وہ نسبت میں غلطی کر گئے، کیونکہ اللہ کے لیے ہر شے میں ایک خاص وجہ ہے جس سے وہ شے ثابت ہوتی ہے۔ پس کوئی بھی اللہ کی عبادت سے باہر نہیں نکلا۔\n\nاور جب اللہ نے ان لوگوں کے درمیان امتیاز کرنا چاہا جنہوں نے اس کی عبادت اختصاص کے ساتھ کی اور جنہوں نے اشیاء میں اس کی عبادت کی، تو اس نے زمینی مقامات سے ہجرت (الھجرۃ) کا حکم دیا جہاں اللہ کی عبادت اعیان میں کی جاتی ہے، تاکہ \"اللہ خبیث کو طیب سے ممتاز کر دے۔\" (لِيَمِيزَ اللَّهُ الْخَبِيثَ مِنَ الطَّيِّبِ) پس خبیث وہ ہے جس نے اللہ کی عبادت اغیار میں کی، اور طیب وہ ہے جس نے اللہ کی عبادت اغیار میں نہیں کی۔ اور اللہ تعالیٰ نے اس زمین کو خلافت کا محل بنایا، پس یہ اس کی بادشاہت کا گھر ہے اور اس کے نائب کا مقام ہے جو اس کے اسماء کے احکام کے ساتھ ظاہر ہوتا ہے۔ پس اسی سے ہمیں پیدا کیا، اور اسی میں ہمیں زندہ اور مردہ حالت میں بسایا، اور اسی سے ہمیں دوسری نشأت (النشأۃ) میں بعث کے ذریعے نکالے گا، تاکہ عبادت (العبادۃ) ہم سے جدا نہ ہو، خواہ ہم دنیا میں ہوں یا آخرت میں۔ اگرچہ آخرت دارِ تکلیف نہیں ہے، لیکن وہ دارِ عبادت ہے۔\n\nپس ہم میں سے جو شخص دنیا اور آخرت میں اس چیز کا مشاہدہ کرتا رہا جس کے لیے اسے پیدا کیا گیا، وہی کامل بندہ ہے جو عالم سے مقصود ہے، اور جو پورے عالم کا نائب ہے۔ اگر سارا عالم، اس کا بالا اور اس کا زیریں، ایک لمحے کے لیے بھی اللہ کے ذکر سے غافل ہو جائے، اور یہ بندہ اس ذکر میں پورے عالم کی طرف سے کھڑا ہو جائے، تو اس کے ذریعے عالم کا وجود محفوظ رہے گا۔ اور اگر یہ انسانی بندہ ذکر سے غافل ہو جائے، تو عالم اس کی جگہ نہیں لے سکتا، اور جہاں سے ذاکر انسان زائل ہو جائے گا، وہ جگہ ویران ہو جائے گی۔\n\nنبی صلی اللہ علیہ وسلم نے فرمایا: \"قیامت اس وقت تک قائم نہیں ہو گی جب تک زمین میں کوئی 'اللہ، اللہ' کہنے والا موجود ہے۔\"\n\nاور جب اللہ نے اس انسانی نشأت (النشأۃ) کو پیدا کیا اور اسے جامعیت کے ساتھ شرف بخشا، تو اس میں دعویٰ کو مرکب کیا، تاکہ اس کی صورت مکمل ہو جائے۔ کیونکہ دعویٰ ایک الٰہی صفت ہے۔ اللہ تعالیٰ نے فرمایا: \"بے شک میں ہی اللہ ہوں، میرے سوا کوئی معبود نہیں، پس میری عبادت کرو۔\" (إِنَّنِي أَنَا اللَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاعْبُدْنِي) پس اس نے دعویٰ کیا کہ اس کے سوا کوئی معبود نہیں، اور یہ ایک سچا دعویٰ ہے۔ پس جس نے سچا دعویٰ کیا، اس پر کوئی حجت قائم نہیں ہوتی، اور اسے ہر اس شخص پر غلبہ حاصل ہوتا ہے جو اس کے دعوے کو رد کرے، کیونکہ اس کے لیے شدت، غلبہ اور قہر ہے، کیونکہ وہ سچا ہے، اور سچائی شدت ہے، پس اس کا مقابلہ نہیں کیا جا سکتا۔\n\nاور چونکہ دعویٰ ایک خبر ہے، اور خبر میں سچائی اور جھوٹ کی نسبت برابر ہوتی ہے، کیونکہ وہ خبر ہے جو دونوں کو قبول کرتی ہے، تو ہم نے اس وقت جانا کہ آزمائش (اختبار) ضروری ہے۔ پس مومن نے ایمان کا دعویٰ کیا، اور وہ اللہ کے وجود اور اس کی وحدانیت کی تصدیق ہے، اور یہ کہ اس کے سوا کوئی معبود نہیں، اور یہ کہ \"ہر شے ہلاک ہونے والی ہے سوائے اس کی ذات (وجہ) کے\" (كُلُّ شَيْءٍ هَالِكٌ إِلَّا وَجْهَهُ)، اور یہ کہ امر اللہ ہی کے لیے ہے، پہلے بھی اور بعد میں بھی۔ پس جب اس نے اپنی زبان سے دعویٰ کیا کہ یہ وہ چیز ہے جو اس کے دل میں پوشیدہ ہے اور جس پر اس کا قلب (القلب) مضبوط ہے، تو یہ احتمال تھا کہ وہ اپنے دعوے میں سچا ہو کہ یہ اس کی صفت ہے، اور یہ بھی احتمال تھا کہ وہ جھوٹا ہو کہ یہ اس کی صفت ہے۔ پس اللہ نے اسے آزمایا تاکہ اس کے لیے یا اس کے خلاف حجت قائم کرے، اس عبادت (العبادۃ) کے ذریعے جو اس نے اسے اختصاص کے ساتھ سونپی، نہ کہ وہ عبادت جو الوہیت کے سرایت کرنے سے جاری ہے۔ اور اس نے اس کی آنکھوں کے سامنے اسباب (الأسباب) کو نصب کیا، اور اس مدعی کی ضروریات کو ان اسباب پر موقوف کر دیا، پس اسے کوئی چیز عطا نہیں کی جاتی مگر ان اسباب سے اور ان کے ہاتھوں پر۔\n\nپس اگر اللہ اسے ایک نور (النور) عطا کرے جس سے وہ کشف (الکشف) کرے اور ان اسباب (الأسباب) کے پردوں کو چیر دے، تو وہ ذات حق (الحق) کو ان کے پیچھے مسبب (اسم فاعل) کے طور پر دیکھتا ہے، یا وہ اسے ان میں اپنی ضروریات کا خالق اور موجد دیکھتا ہے جن کی طرف اسے مجبور کیا گیا ہے۔ پس یہی وہ مومن ہے جو اپنے رب کی طرف سے نور (النور) پر ہے اور اپنے امر کی دلیل پر ہے، اپنے دعوے میں سچا ہے، اور اس مقام کا حق ادا کرنے والا ہے جس کا اس نے الٰہی عنایت سے دعویٰ کیا جو اسے عطا کی گئی۔ اور \"جس کے لیے اللہ نور (النور) نہ بنائے، تو اس کے لیے کوئی نور نہیں ہے۔\" (وَمَن لَّمْ يَجْعَلِ اللَّهُ لَهُ نُورًا فَمَا لَهُ مِن نُّورٍ)\n\nپس اپنے خالق کی ربوبیت کا اقرار کرنے کے بعد، جب اللہ نے اسے میثاق کے وقت اس کی ذات پر گواہ بنایا، جب اس نے اس سے اور اس جیسے لوگوں سے کہا: \"کیا میں تمہارا رب نہیں ہوں؟\" (أَلَسْتُ بِرَبِّكُمْ) تو انہوں نے کہا: \"کیوں نہیں!\" (قَالُوا بَلَىٰ)۔ پس جب اللہ نے اسے اس دنیا میں موجود کیا، تو اسے اسی فطرت پر موجود کیا، لیکن اس نے ان اسباب (الأسباب) کی الوہیت کا اقرار کیا جن سے اللہ نے اسے رزق دیا اور انہیں اپنے اور اللہ کے درمیان حجاب بنا لیا، اور اس کے پاس کوئی نور (النور) نہ تھا جس سے وہ خشکی اور سمندر کی تاریکیوں میں ہدایت پاتا۔ اور یہاں صرف ستارے ہیں، اور وہ یہاں علمِ الٰہی کے ستارے ہیں۔ پس اس نے الوہیت کو اس کے غیر مستحق کی طرف منسوب کیا، پس وہ اپنے دعوے میں جھوٹا ہوا، اسباب کی کثرت کی وجہ سے، اور اپنے شرک میں اس اقرار کی وجہ سے کہ یہ اللہ، خالقِ اسباب، کا قرب حاصل کرنے کا ذریعہ ہے۔ اور اس نے انہیں معبود بنا لیا، پس اس کا قول \"لا الٰہ الا ھو\" (اس کے سوا کوئی معبود نہیں) سچا نہ ہوا۔ اسی لیے بعض نے کہا: \"کیا اس نے اتنے معبودوں کی جگہ ایک ہی معبود بنا لیا؟ بے شک یہ تو بڑی عجیب بات ہے۔\" (أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا إِنَّ هَٰذَا لَشَيْءٌ عُجَابٌ) اور تعجب صرف اس شخص پر ہے جس نے معبودوں کو کثیر کیا۔\n\nاور وہ شخص جس نے اسباب (الأسباب) کے لیے الوہیت کی نسبت نہیں دی، لیکن اس نے صرف اسباب کو دیکھا، اور اسے ایسا کشف (الکشف) حاصل نہ ہوا جو اسے ان سے باہر نکالتا، الوہیت کی توحید کے باوجود، تو یہ ایک خفی شرک تھا، جس کا اس کے مالک کو شعور نہیں ہوتا کہ یہ شرک ہے جو اسے اس اعلیٰ امر سے روکتا ہے جس کا وہ طالب تھا۔ پس توحیدِ الٰہی اور اس کے افعال میں توحید کے دعوے والا شخص، سبب کے فقدان پر پریشان ہونے اور اس کے وجود پر مطمئن ہونے کی وجہ سے، سچا نہیں پایا گیا۔ پس اس کا نقص اس قدر ہے جس قدر اس سے یہ چیز فوت ہوئی۔ یہ اس صورت میں ہے جب اس نے اسباب کو معبود نہ بنایا ہو۔\n\nاگر تم کہو کہ مشرک جس نے دعویٰ کیا کہ وہ مشرک ہے، تو وہ اپنے دعوے میں سچا ہے کہ وہ مشرک ہے، تو اس کی سچائی اسے کیوں فائدہ نہیں دیتی؟ ہم کہتے ہیں: وہ اپنے دعوے میں جھوٹا ہے کہ اس نے الوہیت کو اس کی طرف منسوب کیا جو معبود نہیں ہے۔ یہ وہ دعویٰ ہے جس کی وجہ سے اس نے کفر کیا۔ پس وہ اس میں سچا ہے کہ وہ مشرک ہے، لیکن اس میں سچا نہیں کہ الوہیت میں شرکت صحیح ہے۔ کیونکہ اس نے عقلی اور شرعی دلائل سے اس کی تحقیق کی، تو اس نے اپنے دعوے کے لیے سچائی میں کوئی حقیقت نہیں پائی۔\n\nپس اللہ نے بندوں کو ان چیزوں سے آزمایا جو اس نے رسولوں کو بھیج کر ان کے لیے مشروع کیں، اور اللہ نے مومنوں کو اسباب (الأسباب) سے آزمایا۔ پس ہر گروہ کو اس کے دعوے کے مطابق آزمایا گیا۔ پس جس نے سچ کہا، اس سچائی نے اسے وہ چیز وراثت میں دی جو اس کا دعویٰ عطا کرتا ہے۔ اسی لیے صادقین (سچے لوگوں) سے ان کی سچائی کے بارے میں پوچھا جائے گا کہ کیا انہوں نے اس چیز میں سچ کہا جس کا انہیں حکم دیا گیا اور جو ان کے لیے مباح کی گئی، یا کیا انہوں نے اس چیز کے ارتکاب میں سچ کہا جو ان پر حرام کی گئی، باوجود اس کے کہ وہ سچے تھے۔ پس ان سے کہا جائے گا: تم نے کس چیز میں سچ کہا؟ کیونکہ چغل خور سچے ہوتے ہیں اور غیبت کرنے والے سچے ہوتے ہیں، حالانکہ اللہ نے ان کی مذمت کی ہے اور اس پر وعید سنائی ہے، باوجود اس کے کہ وہ سچائی ہے۔ اسی لیے صادقین سے ان کی سچائی کے بارے میں پوچھا جائے گا جس میں انہوں نے سچ کہا۔ یہ سب اللہ کی طرف سے ان کی آزمائش ہے۔\n\nاور اس سب کی اصل وہ دعوے ہیں جو ان میں مرکب کیے گئے، اور وہ چیز جس سے اللہ نے انہیں خطاب میں آزمایا، یہ ہے کہ اس نے اس آزمائش کو اس لیے بنایا تاکہ اللہ اپنے دعوے میں سچے کو جھوٹے سے جان لے۔ پس اس نے اپنے آپ کو اس آزمائش میں اس شخص کے مقام پر اتارا جو اس سے علم حاصل کرتا ہے، حالانکہ وہ سبحانہ و تعالیٰ ان کے ہونے سے پہلے ہی جانتا ہے کہ ان سے کیا صادر ہو گا۔ پس ان لوگوں میں سے جو اپنے زعم میں تنزیہ کرنے والے ہیں، وہ کہتے ہیں کہ اللہ اس سے علم حاصل نہیں کرتا، کیونکہ وہ امر کو اس طرح نہیں جانتا جس طرح وہ فلاں شخص سے واقع ہوتا ہے۔ پس انہوں نے اللہ کے کلام کو رد کیا اور اس کی تاویل کی، کیونکہ انہیں اس سے تکلیف پہنچنے کا خوف تھا۔ اور ظاہریوں میں سے بعض نے اس لفظ پر قائم رہتے ہوئے یہ لازم کیا کہ وہ اس آزمائش سے جانتا ہے۔ اور بعض لوگوں نے اس کو وقوع کے وقت علم کے تعلق کی طرف پھیر دیا، پس علم قدیم ہے اور تعلق حادث ہے۔ اور مومنوں میں سے بعض نے اس کا علم اللہ کے سپرد کر دیا اور بغیر کسی معین تاویل کے اس پر ایمان لائے، اور یہی سب سے زیادہ محفوظ عقیدہ ہے۔\n\nیہ سب اللہ کی طرف سے اپنے ان بندوں کی آزمائش ہے جنہوں نے اپنی زبانوں سے ایمان کا دعویٰ کیا، کیونکہ اس نے فرمایا: \"یہاں تک کہ ہم جان لیں\" (حَتَّىٰ نَعْلَمَ)، جیسا کہ فرمایا: \"اور ہم ضرور تمہیں آزمائیں گے\" (وَلَنَبْلُوَنَّكُمْ)، اور فرمایا: \"کیا تم نے یہ گمان کر لیا کہ تم جنت میں داخل ہو جاؤ گے، حالانکہ ابھی اللہ نے تم میں سے جہاد کرنے والوں کو نہیں جانا اور نہ ہی صبر کرنے والوں کو جانا؟\" (أَمْ حَسِبْتُمْ أَن تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُوا مِنكُمْ وَيَعْلَمَ الصَّابِرِينَ) پس اس نے دونوں کے درمیان امتیاز کیا تاکہ مجاہد کو ایک معین جزا دے اور صابر کو ایک معین جزا دے۔ اور فرمایا: \"پس اللہ ضرور جان لے گا جنہوں نے سچ کہا اور ضرور جان لے گا جھوٹوں کو۔\" (فَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ صَدَقُوا وَلَيَعْلَمَنَّ الْكَاذِبِينَ) جب اس نے فتنہ (آزمائش) کا ذکر کیا۔\n\nجب انسان اپنی جسمانی نشأت (النشأۃ) کو دیکھتا ہے، تو وہ زمین جس سے اسے پیدا کیا گیا اور جس سے اس کی غذا اور اس کی نشأت کی درستی کا سامان بنایا گیا، اس کے ساتھ قائم ہو جاتی ہے۔ اللہ اسے عادت کے مطابق اس کے بغیر رزق نہیں دیتا۔ اور جس کے حق میں اللہ عادت کو توڑ دے اور اسے اس سے رزق نہ دے، تو اسے ایک مخفی طبعی امر سے رزق دیتا ہے، اور وہ وہ سبب ہے جس سے اس کی زندگی باقی رہتی ہے۔ پس وہ اس کی حرارت اور رطوبت کو، جو اس کی زندگی کا مادہ ہیں، ایک لطیف امر سے محفوظ رکھتا ہے جسے اللہ کے سوا کوئی نہیں جانتا، یا وہ جسے اللہ اس پر مطلع کرے۔ کیونکہ جب اللہ نے اسباب (الأسباب) کو مقرر کیا، تو اس نے انہیں کسی کے حق میں کبھی نہیں اٹھایا، بلکہ اللہ نے اپنے بعض بندوں کو نور (النور) عطا کیا جس سے وہ اسباب کی تاریکیوں میں چلنے میں ہدایت پاتے ہیں، اس کے علاوہ جو اس نے ان کے ساتھ کیا۔ پس انہوں نے اپنے انوار کے مطابق اس کا مشاہدہ کیا۔ پس اسباب کے پردے ہمیشہ لٹکے رہتے ہیں، وہ کبھی نہیں اٹھتے۔\n\nپس تم طمع نہ کرو، اور اگر ذات حق (الحق) تمہیں ایک سبب سے منتقل کرے، تو وہ تمہیں دوسرے سبب سے ہی منتقل کرتا ہے۔ پس وہ تمہیں سبب سے بالکل محروم نہیں کرتا، کیونکہ وہ اللہ کی رسی ہے جس کو مضبوطی سے پکڑنے کا تمہیں حکم دیا گیا ہے، اور وہ نازل شدہ شریعت ہے، اور وہ سب سے قوی اور سچا سبب ہے۔ اور اس کے ہاتھ میں وہ نور (النور) ہے جس سے ان اسباب کی خشکی اور سمندر کی تاریکیوں میں ہدایت پائی جاتی ہے۔ پس جس نے ایسا کیا، جو کہ سبب ہے، تو اس کی جزا ایسی ہے۔ پس تم اس چیز کی طمع نہ کرو جس کی طمع نہیں کی جا سکتی، لیکن اللہ تعالیٰ سے اپنی ذات پر اس نور (النور) کی ایک چھینٹ مانگو۔\n\nاور لطیف امور میں سے یہ ظاہر کرو کہ اس نے تمہارے بدن کو مسام والا بنایا اور تمہیں ہوا سے گھیر لیا جو طبعی زندگی کا مادہ ہے، کیونکہ وہ بذات خود گرم اور مرطوب ہے۔ اور اس نے تم میں ایک جاذبہ قوت رکھی ہے۔ پس تم معمول کے اسباب کے فقدان کے وقت اپنے مسام سے ہوا کو جذب کر سکتے ہو، اور اس سے اپنے بدن کو غذا دے سکتے ہو، اور تمہیں شعور بھی نہیں ہوتا۔ اور ہم جانتے ہیں کہ بعض حشرات ایسے ہیں جن کی غذا ان کے بدن کے مسام سے ہوتی ہے، جو وہ رطوبات سے جذب کرتے ہیں، ایک خاص میزان پر جس سے ان کی بقا ہوتی ہے، نہ افراط ہوتا ہے اور نہ تفریط۔\n\nپھر اے ولی بھائی! تمہیں معلوم ہونا چاہیے کہ تمہارے بدن کی زمین ہی حقیقی وسیع زمین ہے جس میں ذات حق (الحق) نے تمہیں اس کی عبادت (العبادۃ) کا حکم دیا ہے۔ اور یہ اس لیے کہ اس نے تمہیں اپنی زمین میں عبادت کا حکم نہیں دیا مگر جب تک تمہاری روح تمہارے بدن کی زمین میں رہتی ہے۔ پس جب وہ اس سے جدا ہو جاتی ہے، تو یہ تکلیف تم سے ساقط ہو جاتی ہے، باوجود اس کے کہ تمہارا بدن زمین میں دفن ہوتا ہے۔ پس تم جان لو کہ زمین تمہارے بدن کے سوا کچھ نہیں ہے۔ اور اس نے اسے وسیع بنایا کیونکہ اس نے ان قوتوں اور معانی کو سمویا جو صرف اس انسانی جسمانی زمین میں پائے جاتے ہیں۔\n\nاور اس کا فرمان: \"کہ تم اس میں ہجرت کرتے\" (فَتُهَاجِرُوا فِيهَا)، تو یہ خواہش نفس (الھوی) کا محل ہے اور عقل (العقل) کا محل ہے۔ پس تم اس میں خواہش نفس (الھوی) کی زمین سے عقل (العقل) کی زمین کی طرف ہجرت کرو، اور تم اس سب میں اسی میں ہو، تم اس سے باہر نہیں نکلے۔ پس اگر خواہش نفس (الھوی) تمہیں استعمال کرے، تو وہ تمہیں ہلاک کر دے گی اور تم تباہ ہو جاؤ گے، اور اگر عقل (العقل) تمہیں استعمال کرے، جس کے ہاتھ میں شریعت کا چراغ ہے، تو تم نجات پاؤ گے اور اللہ تمہیں اس کے ذریعے نجات دے گا۔ کیونکہ سلیم عقل (العقل)، جو نقص اور شبہات کی صفات سے پاک ہو، وہی ہے جس کی بصیرت کی آنکھ کو اللہ نے کھول دیا ہے تاکہ وہ امور کو ان کی اصل حقیقت پر سمجھے، پس اس نے ان کے ساتھ استحقاق کے طریقے سے معاملہ کیا، اور ہر حقدار کو اس کا حق دیا۔\n\nاور جس نے اللہ کی عبادت (العبادۃ) اپنے بدن کی وسیع زمین میں نہیں کی، تو اس نے اللہ کی عبادت اس زمین میں نہیں کی جس سے اسے پیدا کیا گیا۔ کیونکہ اللہ فرماتا ہے: \"اور اس نے انسان کی تخلیق مٹی سے شروع کی، پھر اس کی نسل کو حقیر پانی کے نچوڑ سے بنایا۔\" (وَبَدَأَ خَلْقَ الْإِنْسَانِ مِنْ طِينٍ ثُمَّ جَعَلَ نَسْلَهُ مِنْ سُلَالَةٍ مِنْ مَاءٍ مَهِينٍ) اور وہ پانی ہے جو اس جسمانی زمین سے نکلا اور عورت کے رحم میں ٹھہرا، پھر اسے درست کیا۔ پس بدن کی زمین کی درستی اور اس میں موجود رطوبت اور حرارت کی وجہ سے جلنے کی قبولیت کے بعد، اللہ نے اس میں پھونکا، تو وہ جل اٹھا، اور وہ جلنا اس کے لیے روح بن گیا۔ پس وہ اس سے ہی نکلا، اسی سے اسے پیدا کیا گیا۔\n\nاور اس نے اس نشأت (النشأۃ) میں عقل (العقل) کو زمین میں چاند کی طرح بنایا، ایک نور (النور) جس سے روشنی حاصل کی جاتی ہے، لیکن گھروں، دیواروں اور پردوں کی رکاوٹوں کی وجہ سے اسے وہ نفوذ حاصل نہیں ہے۔ اور اس نے اس جسمانی زمین میں اس عقل (العقل) کے لیے شریعت کو چراغ بنایا۔ پس اس زمین کے کونے چراغ کے نور سے روشن ہو گئے، پس اسے اس کے بارے میں وہ علم عطا کیا جو اس میں ہے، جو عقل کے نور (جو چاند کی طرح ہے) کو عطا نہیں کیا گیا۔\n\nپھر وہ ہمیں اس میں لوٹائے گا، یعنی دوسری نشأت (النشأۃ) میں بھی، جیسا کہ اس نے ہمیں اس میں پیدا کیا، اور ہمیں اس کے مشاہدے کے لیے نکالے گا، جیسا کہ اس نے ہمیں اس سے پیدا کیا اور اپنی عبادت (العبادۃ) کے لیے نکالا۔ پس اس نے ہماری روحوں کو دنیا میں ہمارے بدن کی زمین سے اپنی عبادت کے لیے پیدا کیا، اور ہمیں آخرت میں ہمارے بدن کی زمین میں اپنے مشاہدے کے لیے بسائے گا، اگر ہم سعید ہوئے، جیسا کہ ہم نے پہلی نشأت میں اس پر ایمان لائے، جب اللہ نے ہم پر عنایت کی۔ اور دونوں نشأتوں کے درمیان موت ایک برزخی حالت ہے، جس میں روحیں برزخی، خیالی اجسام میں آباد ہوتی ہیں، جیسا کہ وہ نیند میں آباد ہوتی ہیں، اور وہ اجسام ان خاکی اجسام سے پیدا ہوتے ہیں۔ کیونکہ خیال ان کی قوتوں میں سے ایک قوت ہے۔ پس ان کی روحیں ان سے یا جو ان سے تھا، جدا نہیں ہوئیں۔\n\nپس تم جان لو کہ اللہ کی زمین جو ایک رکن ہے، موجود ہے، اور تم اس میں مدفون ہو۔ اور تمہیں اپنے رب کی عبادت کا حکم نہیں دیا گیا مگر جب تک تم اپنے بدن کی وسیع زمین میں ہو، اپنی عقل (العقل) اور شریعت کے چراغ کے ساتھ۔ پس یہ جسمانی زمین حقیقت میں تمہارے لیے اللہ کی وسیع زمین ہے جس میں اس نے تمہیں اپنی موت تک اس کی عبادت کا حکم دیا ہے۔ اور جو مر گیا، اس کی قیامت قائم ہو گئی، اور وہ جزوی قیامت ہے۔ اور یہی اس کا فرمان ہے: \"اور اسی میں ہم تمہیں لوٹائیں گے\" (وَفِيهَا نُعِيدُكُمْ)۔ پس جب تم اس معین شخص کی موت سے جزوی قیامت کو سمجھ لو گے، تو تم ہر مردہ کے لیے عام قیامت کو جان لو گے جو اس پر تھی۔ کیونکہ برزخ کی مدت دوسری نشأت (النشأۃ) کے لیے ایسی ہے جیسے عورت کا جنین کو اپنے پیٹ میں اٹھانا، اللہ اسے ایک نشأت کے بعد دوسری نشأت میں پیدا کرتا ہے، پس اس پر نشأت کے اطوار بدلتے رہتے ہیں یہاں تک کہ وہ قیامت کے دن پیدا ہوتا ہے۔ اسی لیے مردہ کے بارے میں کہا گیا کہ جب وہ مر گیا تو اس کی قیامت قائم ہو گئی، یعنی اس میں برزخ میں دوسری نشأت کا ظہور شروع ہو گیا، یہاں تک کہ وہ برزخ سے بعث کے دن نکلے گا، جیسا کہ وہ پیٹ سے زمین پر ولادت کے ذریعے نکلتا ہے۔ پس برزخ میں اس کے بدن کی نشأت کا انتظام اس لیے ہے تاکہ وہ اسے درست کرے اور اسے ایک ایسے بے مثال طریقے پر معتدل کرے جو دارِ آخرت کے لیے مناسب ہو، پس وہ اس میں اس کی عبادت کرے گا، یعنی اس کی اخروی نشأت کی زمین میں، ایک ذاتی عبادت، نہ کہ تکلیفی عبادت۔ کیونکہ کشف (الکشف) اسے اس بات سے روکتا ہے کہ وہ اس کے سوا کسی اور کا بندہ ہو جو اس کا بندہ ہونے کا مستحق ہے۔ جیسا کہ یہ مقام یہاں اللہ کے بندوں کو حاصل ہوتا ہے۔\n\nاور جب اللہ نے تمہارے بدن کی زمین کو پیدا کیا، تو اس میں ایک کعبہ بنایا، اور وہ تمہارا قلب (القلب) ہے۔ اور اس قلبی گھر کو مومن میں سب سے زیادہ شرف والا گھر بنایا۔ پس خبر دی کہ آسمان، جس میں بیت المعمور ہے، اور زمین، جس میں کعبہ ہے، اسے سمو نہیں سکے اور اس کے لیے تنگ پڑ گئے، اور اس انسانی مومن نشأت (النشأۃ) کے اس قلب (القلب) نے اسے سمو لیا۔ اور یہاں وسعت سے مراد اللہ سبحانہ و تعالیٰ کا علم ہے۔ پس یہ تمہیں اس بات پر دلالت کرتا ہے کہ یہ وسیع زمین ہے اور یہ تمہاری عبادت (العبادۃ) کی زمین ہے۔ پس تم اس کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو، اپنی آنکھ کے لحاظ سے، کیونکہ تمہارا قلب (القلب) تمہاری آنکھ سے ادراک کرنے سے محجوب ہے، کیونکہ وہ تمہارے باطن میں ہے۔ پس تم اللہ کی عبادت اس طرح کرو گویا تم اسے اپنی ذات میں دیکھ رہے ہو، جیسا کہ اس کے جلال کے لائق ہے، اور تمہاری بصیرت کی آنکھ اس کا شہود (الشہود) کرتی ہے، کیونکہ وہ اس کے لیے علم کے ظہور کے طور پر ظاہر ہوتا ہے۔ پس تم اسے اپنی بصیرت کی آنکھ سے دیکھتے ہو، اور گویا تم اسے اپنی آنکھ کے لحاظ سے دیکھتے ہو۔ پس تم اپنی عبادت میں دونوں صورتوں کو جمع کرتے ہو: اس عبادت کو جو وہ خیال کے مقام میں مستحق ہے، اور اس عبادت کو جو وہ غیرِ خیال کے مقام میں مستحق ہے۔ پس تم اس کی عبادت مطلقاً اور مقیداً کرتے ہو۔ اور یہ اس نشأت (النشأۃ) کے سوا کسی اور کے لیے نہیں ہے۔ اسی لیے اس نے اس مومن نشأت کو اپنا حرمِ محترم اور اپنا معظم و مکرم گھر بنایا ہے۔ اور میں نے اس معنی کی طرف اپنے اس قول سے اشارہ کیا ہے:\n\nجو شخص سراسر ذات حق (الحق) ہو، اس سے سب کچھ زائل ہو گیا۔\nیا تو تم اس میں اس کا سایہ ہو، پس سارا معاملہ ذات حق (الحق) ہی ہے۔\nپس ذات حق (الحق) ایک قائم شخص ہے، اور تم اس کا سایہ ہو۔\nاس کا حرم محترم ہے، پس حلال اسے حلال نہیں کرتا۔\nہر اس چیز سے جو لائق نہیں، بے شک وہ اسے بزرگ جانتا ہے۔\n\nپس وجود میں ہر مخلوق اللہ کی عبادت (العبادۃ) غیب پر کرتی ہے، سوائے انسان کامل (الإنسان الکامل) مومن کے، کیونکہ وہ اس کی عبادت مشاہدہ پر کرتا ہے۔ اور بندہ ایمان کے بغیر کامل نہیں ہوتا۔ پس اس کے لیے چمکتا ہوا نور (النور) ہے، بلکہ وہ خود چمکتا ہوا نور ہے جو ہر تاریکی کو دور کرتا ہے۔ پس جب وہ اس کی عبادت شہود (الشہود) پر کرتا ہے، تو اس کی تمام قوتیں اسے دیکھتی ہیں۔ پس اس کی عبادت میں اس کے سوا کوئی کھڑا نہیں ہوتا، اور نہ ہی اس کے سوا کسی کو اس میں کھڑا ہونا چاہیے۔ پس یہ مقام صرف انسانی مومن کو حاصل ہوا ہے، کیونکہ وہ اپنے رب کے ذریعے ہی مومن ہوا، کیونکہ وہ سبحانہ و تعالیٰ ہی المؤمن ہے۔\n\n### [کہ اللہ نے مخلوق کو ایک مزاج پر پیدا نہیں کیا]\n\nاور جان لو کہ اگر تم اس مرتبے پر نہیں ہو اور تمہارا اس درجے میں کوئی قدم نہیں ہے، تو میں تمہیں اس چیز کی طرف رہنمائی کرتا ہوں جس سے تمہیں اعلیٰ درجہ حاصل ہو گا، اور وہ یہ ہے کہ تم جان لو کہ اللہ نے مخلوق کو ایک مزاج پر پیدا نہیں کیا، بلکہ اسے متفاوت مزاج کا بنایا ہے۔ اور یہ بدیہی اور ضروری طور پر مشہود ہے، کیونکہ لوگوں کے درمیان عقلی نظر اور ایمان میں تفاوت ہے۔ اور تمہیں ذات حق (الحق) کے راستے سے یہ بات حاصل ہوئی ہے کہ انسان اپنے بھائی کا آئینہ ہے، پس وہ اس میں وہ چیز دیکھتا ہے جو وہ شخص خود اپنے آپ میں نہیں دیکھتا مگر اپنے جیسے کے واسطے سے۔ کیونکہ انسان اپنی خواہش نفس (الھوی) سے محجوب ہوتا ہے اور اس سے محبت کرتا ہے۔ پس جب وہ اس صفت کو کسی دوسرے میں دیکھتا ہے، اور وہ اس کی اپنی صفت ہوتی ہے، تو وہ اپنے عیب کو دوسرے میں دیکھ کر پہچانتا ہے، پس اگر وہ قبیح ہو تو اس کی قباحت کو جانتا ہے، یا اگر وہ حسن والی ہو تو اس کے حسن کو جانتا ہے۔\n\n### [کہ رسول اپنے رب کے پیغامات کو قبول کرنے کے لیے لوگوں میں سب سے زیادہ معتدل مزاج والے ہوتے ہیں]\n\nاور جان لو کہ آئینے مختلف شکلوں کے ہوتے ہیں، اور وہ دیکھنے والے کے لیے مرئی کو اپنی شکل کے مطابق ظاہر کرتے ہیں، خواہ وہ لمبائی، چوڑائی، استواء، ٹیڑھا پن، گولائی، کمی یا زیادتی، اور تعدد ہو۔ اور ہر شے وہ عطا کرتی ہے جو اس آئینے کی شکل اسے دیتی ہے۔ اور تم جان چکے ہو کہ رسول اپنے رب کے پیغامات کو قبول کرنے کے لیے لوگوں میں سب سے زیادہ معتدل مزاج والے ہوتے ہیں۔ اور ان میں سے ہر شخص نے رسالت میں سے اتنا ہی قبول کیا جتنا اللہ نے اسے اس کے مزاج میں ترکیب سے عطا کیا۔ پس کوئی نبی ایسا نہیں بھیجا گیا مگر خاص طور پر ایک معین قوم کی طرف، کیونکہ وہ ایک خاص، محدود مزاج پر تھا۔ اور محمد صلی اللہ علیہ وسلم کو اللہ نے صرف ایک عام رسالت کے ساتھ تمام لوگوں کی طرف بھیجا، اور انہوں نے ایسی رسالت کو صرف اس لیے قبول کیا کہ وہ ایک عام مزاج پر تھے جو ہر نبی اور رسول کے مزاج کو اپنے اندر سموئے ہوئے تھا۔ پس وہ سب سے زیادہ معتدل اور کامل مزاج والے اور سب سے زیادہ قائم نشأت (النشأۃ) والے ہیں۔\n\nپس جب تم یہ جان لو، اور تم ذات حق (الحق) کو اس کامل ترین صورت میں دیکھنا چاہو جس میں اسے اس انسانی نشأت (النشأۃ) کے لیے ظاہر ہونا چاہیے، تو جان لو کہ تمہارے پاس محمد صلی اللہ علیہ وسلم جیسا مزاج نہیں ہے اور نہ ہی تم اس پر ہو۔ اور ذات حق (الحق) جب بھی تمہارے قلب (القلب) کے آئینے میں تجلی (التجلی) کرے گا، تو تمہارا آئینہ اسے صرف اپنے مزاج اور اپنی شکل کی صورت کے مطابق ہی ظاہر کرے گا۔ اور تم اپنے رب کے علم میں اس درجے سے نیچے ہو جو محمد صلی اللہ علیہ وسلم کو ان کی نشأت (النشأۃ) میں حاصل تھا۔ پس ایمان اور اتباع کو لازم پکڑو، اور اسے اپنے سامنے اس آئینے کی طرح رکھو جس میں تم اپنی صورت اور دوسرے کی صورت دیکھتے ہو۔\n\nپس جب تم ایسا کرو گے، تو تم جان لو گے کہ اللہ تعالیٰ کو محمد صلی اللہ علیہ وسلم کے آئینے میں ضرور تجلی (التجلی) کرنی ہے۔ اور میں نے تمہیں بتا دیا ہے کہ آئینہ دیکھنے والے کے لیے مرئی میں اثر رکھتا ہے۔ پس ذات حق (الحق) کا ظہور محمد صلی اللہ علیہ وسلم کے آئینے میں سب سے کامل، سب سے معتدل اور سب سے خوبصورت ظہور ہو گا، اس چیز کی وجہ سے جو ان کا آئینہ ہے۔ پس جب تم اسے محمد صلی اللہ علیہ وسلم کے آئینے میں ادراک کرو گے، تو تم اس سے وہ کمال ادراک کرو گے جو تم اپنے آئینے میں دیکھنے سے ادراک نہیں کر سکتے۔ کیا تم ایمان کے باب میں اور رسالت میں آئی ہوئی ان چیزوں میں نہیں دیکھتے جنہیں ذات حق (الحق) نے شریعت کی زبان سے اپنی طرف منسوب کیا ہے، جنہیں عقلیں محال سمجھتی ہیں؟ اور اگر شریعت اور اس پر ایمان نہ ہوتا، تو ہم اپنی عقلی نظر سے ان میں سے کسی چیز کو بھی قبول نہ کرتے، بلکہ ہم اسے ابتداءً ہی رد کر دیتے اور اس کے قائل کو جاہل سمجھتے۔\n\nپس جس طرح اس نے رسالت اور ایمان کے ذریعے انہیں وہ چیز عطا کی جس کے ادراک سے وہ عقلیں قاصر رہیں جن میں ایمان نہیں تھا، اسی طرح ہمارے مزاج اور ہماری عقلوں کے آئینے مشاہدہ کے وقت اس چیز کے ادراک سے قاصر رہے جو محمد صلی اللہ علیہ وسلم کے آئینے میں تجلی (التجلی) ہوئی کہ وہ اسے اپنے آئینے میں ادراک کر سکیں۔ اور جس طرح تم نے رسالت میں اس پر غیب میں ایمان لائے، اسی طرح تم نے اس نبوی تجلی (التجلی) میں اسے عیناً مشاہدہ کیا۔\n\nاگر وہ نہ ہوتے اور اگر ہم نہ ہوتے، تو وہ نہ ہوتا جو ہوا۔\nاور نہ ہی رحمن، ہمارے آقا، کی طرف سے پیغامات آئے۔\nخبروں اور احکام کے ساتھ، اور اسے بیان (تبيان) کا نام دیا گیا۔\nاور تورات، انجیل، فرقان اور قرآن۔\nاور اہل عقل نے اسے افکار کے ذریعے برہان (دلیل) کا نام دیا۔\nاور اس کے تین حصے کیے: اسلام، ایمان اور احسان۔\nپس پاک ہے وہ ذات جس نے انہیں سیر کرائی تاکہ وہ اسے محسن (احسان کرنے والا) کے طور پر دیکھیں۔\nاور رحمن کی صورت کے ساتھ اسے خاص کیا جسے اس نے انسان کا نام دیا۔\nاور اس کے رسول پے در پے، گروہوں میں اور اکیلے آئے۔\nاور اس نے ہمیں عطا کیا اور ہم پر احسان کیا، یہاں جو چاہا اسے پوشیدہ رکھا۔\nاور جنتیں، اور نہریں، اور روح، پھر ریحان (خوشبو)۔\nاور کشف (الکشف)، پھر اشہاد (گواہی)، اور اسرار، اور اعلانات۔\n\nمیں نے تمہیں نصیحت کی اور نصیحت میں مبالغہ کیا، پس ذات حق (الحق) کا مشاہدہ صرف اپنے نبی صلی اللہ علیہ وسلم کے آئینے میں طلب کرو۔ اور خبردار! کہ تم اسے اپنے آئینے میں مشاہدہ کرو، یا نبی اور اس حق کو جو ان کے آئینے میں تجلی (التجلی) ہوا، اسے اپنے آئینے میں مشاہدہ کرو۔ کیونکہ یہ تمہیں اعلیٰ درجے سے نیچے گرا دے گا۔ پس اقتداء اور اتباع کو لازم پکڑو، اور کسی ایسی جگہ قدم نہ رکھو جہاں تم اپنے نبی کا قدم نہ دیکھو۔ پس اگر تم اعلیٰ درجات اور مقامِ زلفیٰ میں کامل شہود (الشہود) کے اہل بننا چاہتے ہو، تو اپنا قدم ان کے قدم پر رکھو۔ اور میں نے تمہیں نصیحت میں مبالغہ کیا جیسا کہ مجھے حکم دیا گیا، اور \"اللہ جسے چاہتا ہے سیدھے راستے کی طرف ہدایت دیتا ہے۔\" (وَاللَّهُ يَهْدِي مَن يَشَاءُ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ)\n\nاور اس منزل میں علوم میں سے علمِ حسبان (گمان) اور ظنون (خیالات) کا علم ہے، اور علمِ تقریرِ الٰہی کا علم ہے، اور اس میں اکثر لوگوں سے پوشیدہ اسرار کا علم ہے، اور اس میں افراد (الأفراد) کا علم ہے، اور اس میں ملاحم (بڑی جنگوں) کا علم ہے، اور اس میں مسابقہ (سبقت لے جانے) کا علم ہے، اور وہ مسابقہ کا میدان کہاں ہے جو اللہ اور اس کے بندوں کے درمیان ہے۔ اور یہ ایک شریف علم ہے جس میں ایسی الٰہی رحمت ہے جسے کوئی بیان کرنے والا بیان نہیں کر سکتا۔\n\nاور اس میں اس شخص پر رد کا علم ہے جو وعید کے نفاذ اور رحمت کے سب کو شامل ہونے کا قائل ہے۔ اور وہ یہ ہے کہ جب انسان نافرمانی کرتا ہے، تو وہ انتقام اور بلاء کا سامنا کرتا ہے، اور وہ اپنے فعل کی وجہ سے انتقام کے میدان میں دوڑ رہا ہوتا ہے، اور اللہ اس میدان میں اس سے سبقت لے جاتا ہے، اس لحاظ سے کہ وہ غفار، عفو کرنے والا، درگزر کرنے والا، رحیم اور رؤوف ہے۔ پس بندہ گناہوں اور برائیوں کے ساتھ ذات حق (الحق) سے انتقام کی طرف سبقت لے جاتا ہے، اور ذات حق (الحق) سبقت لے جانے والا ہے، پس وہ بندے کے برائیوں کے ساتھ اس تک پہنچنے سے پہلے انتقام کی طرف سبقت لے جاتا ہے، اور اسے غفار اور اس کے ہم معنی اسماء کے ذریعے تجاوز کر جاتا ہے۔ پس جب بندہ اس میدان میں آخری حد تک پہنچتا ہے، تو وہ دیکھتا ہے کہ غفار انتقام سے سبقت لے جا چکا ہے اور اس نے نافرمانوں کے درمیان اور انتقام کے درمیان حائل ہو گیا ہے، حالانکہ وہ یہ حکم لگا رہے تھے کہ وہ اس سے پہلے انتقام تک پہنچ جائیں گے۔ اور یہی اللہ تعالیٰ کا سورۃ العنکبوت میں فرمان ہے: \"کیا ان لوگوں نے جو برے کام کرتے ہیں یہ گمان کر لیا ہے کہ وہ ہم سے سبقت لے جائیں گے؟\" (أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَن يَسْبِقُونَا) یعنی کیا وہ اپنی برائیوں کے ساتھ میری مغفرت اور میری رحمت کے شمول سے سبقت لے جائیں گے؟ \"برا ہے جو وہ حکم لگاتے ہیں۔\" (سَاءَ مَا يَحْكُمُونَ) بلکہ سبقت اللہ کے لیے ہے ان کے لیے رحمت کے ساتھ۔ یہ کرم کی انتہا ہے۔ اور یہ صرف اس گروہ میں ہوتا ہے جو توبہ کے بغیر مرنے والوں کے حق میں وعید کے نفاذ کا قائل ہے۔ پس جب نافرمان مرتا ہے، تو اللہ کی رحمت اسے اس مقام پر ملتی ہے جہاں اللہ چاہتا ہے کہ وہ اسے ملے۔\n\nاور اس میں نبی صلی اللہ علیہ وسلم کے اس فرمان کا علم ہے: \"جو اللہ سے ملنا پسند کرتا ہے، اللہ اس سے ملنا پسند کرتا ہے، اور جو اللہ سے ملنا ناپسند کرتا ہے، اللہ اس سے ملنا ناپسند کرتا ہے۔\" (مَن أحبَّ لقاءَ اللهِ أحبَّ اللهُ لقاءَه، ومَن كرِهَ لقاءَ اللهِ كرِهَ اللهُ لقاءَه) اور یہ نہیں فرمایا کہ وہ اس سے نہیں ملے گا۔ پس اللہ نے صرف اس ملاقات کو ناپسند کیا جسے اس نے ناپسند کیا، اور وہ یہ ہے کہ وہ اسے اس کے جرم پر پکڑنے والا اور انتقام لینے والا ہو کر ملے۔ پس اللہ نے اس ملاقات کو ناپسند کیا جسے اس برائی کرنے والے نے ناپسند کیا، پس وہ اس سے مغفرت اور رضوان کے ساتھ ملا۔ کیونکہ اللہ جانتا تھا کہ اس نے اللہ سے ملنے کو ناپسند نہیں کیا، باوجود اس کے کہ وہ اس سے ملنے پر ایمان رکھتا تھا، مگر اس مخالفت کی وجہ سے جس پر وہ تھا۔ پس اللہ نے اس ملاقات کو ناپسند کیا جو مخالفت کی سزا کا تقاضا کرتی تھی، پس وہ اس سے عفو اور مغفرت کے ساتھ ملا۔\n\nاور اس میں اس چیز کا علم ہے جو ذات (الذات) اپنے لیے مستحق ہے، نہ کہ اس لحاظ سے کہ وہ معبود ہونے کی صفت سے متصف ہے۔ اور اس میں اس بات کا علم ہے کہ تمام امور اگرچہ اللہ کے لیے ہیں، لیکن اللہ ان پر مطلع ہونے کے بعد انہیں اپنی مشیئت کے مطابق اپنے بندوں پر لوٹاتا ہے۔ اور اس میں مومن نفوس اور مخالفتوں کے درمیان پردے ڈالنے کا علم ہے، اور ان میں سے جس نے مخالفت کی، اس کے اور سزاؤں کے درمیان پردے ڈالے گئے۔ اور اس میں اللہ کا اپنے بندوں کے ساتھ ان کے اغراض کے مطابق معاملہ کرنے کا علم ہے۔ اور اس میں عالم میں مقرر کردہ اسباب (الأسباب) کا علم ہے جن کے اثرات اس میں ہوتے ہیں۔ اور اس میں اس چیز کا علم ہے جس کی طرف اسباب اسے بلاتے ہیں، اور ان میں سے کس کا جواب دینا چاہیے اور کس کا جواب نہیں دینا چاہیے۔ اور اس میں دور والوں کو قریب والوں سے اور نچلے والوں کو اونچے والوں سے ملانے کا علم ہے، ان کے باہمی تعلق میں۔ اور اس میں اس شخص کی جہالت کا علم ہے جو ذات حق (الحق) اور خلق کو برابر سمجھتا ہے، اور جو اللہ کے نزدیک عالم کے مراتب سے جاہل ہے۔ اور اس میں تفسیر اور تمییز کا علم ہے۔ اور اس میں اس چیز کا علم ہے جو عامل کو اس کے عمل سے واپس ملتی ہے اور جو واپس نہیں ملتی۔ اور اس میں اشیاء کی عمروں کا علم ہے، اور وہ شے کا اس وقت تک باقی رہنا ہے جب تک اس کی صورت فاسد نہ ہو جائے، جس کے زائل ہونے سے وہ نام زائل ہو جاتا ہے جس کا وہ مستحق تھا، خواہ وہ جماد ہو یا نبات یا حیوان۔ اور اس میں کونی اسباب (الأسباب) کے ذریعے الٰہی گرفت کا علم ہے، اور یہ کہ ہر وہ چیز جس سے گرفت کی جاتی ہے، وہ اللہ کے لشکروں میں سے ایک لشکر ہے۔ اور اس میں عالم کا بعض کا بعض کے لیے آیات (نشانیاں) ہونے کا علم ہے۔ اور اس میں مومنوں اور غیر مومنوں کی نصیحتوں کا علم ہے۔ اور اس میں دلائل کے ذریعے علم کے بیان کا علم ہے۔ اور اس میں ہر وقت جس چیز کی ضرورت ہوتی ہے اس کا علم ہے۔ اور اس میں اعتبار (غور و فکر) کا علم ہے۔ اور اس میں ارادہ اور مشیئت کا علم ہے۔ اور اس میں اس شخص کا علم ہے جس پر امور میں بھروسہ کرنا چاہیے اور جس پر نہیں کرنا چاہیے۔ اور اس میں اس شخص کا علم ہے جس نے اپنے مومن بھائی کے ساتھ برائی کا ارادہ کیا تو وہ اس پر لوٹ آئی، اور یہ ہر قوم کی جنس میں جاری ہے۔ اور اس میں اس شخص کا علم ہے جس نے یہاں قیامت کے دن ہونے والی کسی صفت کو جلدی طلب کیا، اور اللہ کے نزدیک اس کا حکم کیا ہے۔ اور اس میں ہجرت (الھجرۃ) اور ہجرت کرنے والے کا علم ہے۔ اور اس میں بغیر وہب (عطا) کے وہب کا علم ہے۔ اور اس میں اس چیز کا علم ہے جس نے جاہل کو، اپنے علم کے باوجود، یہ کہنے پر مجبور کیا: \"اگر یہ حق (الحق) تیری طرف سے ہے، تو ہم پر آسمان سے پتھر برسا دے یا ہم پر دردناک عذاب لے آ۔\" (إِن كَانَ هَٰذَا هُوَ الْحَقَّ مِنْ عِندِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَاءِ أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ) اور اس جیسی مثالیں، جیسے ان کا قول: \"اگر تم سچے ہو تو ہم پر اللہ کا عذاب لے آؤ۔\" (ائْتِنَا بِعَذَابِ اللَّهِ إِن كُنتَ مِنَ الصَّادِقِينَ) پس تم اس الٰہی خبر میں غور کرو، کیونکہ یہ ان کی طرف سے تکذیب میں مبالغہ ہے، کیونکہ اگر ان کے نزدیک رسول کی سچائی کا احتمال ہوتا، تو وہ ایسی بات نہ کہتے۔ کیونکہ نفوس اپنی فطرت میں اپنے لیے منافع حاصل کرنے اور نقصانات کو دور کرنے پر جبلت کیے گئے ہیں۔ اور اس میں امتوں کے ساتھ نرمی اور ان کے نبیوں کی طرف سے ان کے خلاف دعا کا علم ہے۔ اور اس میں دارِ آخرت اور زمانِ آخر کا علم ہے، اور یہ کہ وہ کیوں لوٹتا ہے، حالانکہ وہاں کوئی سورج نہیں نکلتا اور نہ کوئی رات آتی ہے۔ اور اس میں اسباب (الأسباب) کے تنوع کا علم ہے۔ اور اس میں ان لوگوں کے مراتب کا علم ہے جنہوں نے اللہ کے سوا معبود بنائے ہیں۔ اور اس میں علماء اور الٰہی حکماء کے فصل کا علم ہے۔ اور اس میں اس چیز کا علم ہے جس پر مومن کو ثابت قدم رہنا چاہیے۔ اور اس میں صنعت اور صانع کا علم ہے۔ اور اس میں حدیث میں تنازع اور تنازع کرنے والوں کے مراتب کا علم ہے۔ اور اس میں محکم (واضح) میں سے مجمل (مختصر)، معضل (مشکل) میں سے متشابہ (ملتا جلتا) کا علم ہے۔ اور اس میں اس چیز سے ایمان کے تعلق کا علم ہے جو حق (الحق) نہیں ہے، جیسے اس کا فرمان: \"اور وہ لوگ جو باطل پر ایمان لائے۔\" (وَالَّذِينَ آمَنُوا بِالْبَاطِلِ) اور اس میں اس داعی کا علم ہے جو شقاوت (بدبختی) کے طلب کو جلدی کرنے کا موجب بنتا ہے۔ اور اس میں ایمان اور زلف (قرب) کے مقامات کا علم ہے۔ اور اس میں صبر اور توکل کے مراتب کا علم ہے۔ اور اس میں اس شخص کا علم ہے جس نے ذات حق (الحق) کو پہچانا اور اس سے اجتناب کیا، اور اس میں سے کیا قابل تعریف ہے اور کیا قابل مذمت، جیسے اس حق سے اجتناب جس کا حکم دیا گیا ہے، جیسے غیبت۔ اور اس میں محمود اور مذموم بسط (کشادہ دلی) کا علم ہے۔ اور اس میں اس شخص کا علم ہے جس نے کوئی امر جانا، تو اسے کہا گیا کہ تم اسے نہیں جانتے۔ اور اس میں موجودات میں سرایت کرنے والی زندگی کا علم ہے، اور دنیا میں اس کا باطن ہونا اور آخرت میں اس کا ظاہر ہونا، اور کس بصیرت سے اسے دنیا میں کشف (الکشف) کیا جس نے اسے کشف کیا۔ اور اس میں اضطرار (مجبوری) کا علم ہے اور یہ کہ وہ اس کے زائل ہونے سے کیسے زائل ہوتا ہے۔ اور اس میں اللہ تک پہنچنے کے راستوں کا علم ہے، اور اگرچہ وہ مختلف ہیں، تو سب حق (الحق) ہیں، اور ان میں سے کیا قابل تعریف ہے اور کیا قابل مذمت، اور ان میں سے کیا سعادت تک پہنچاتا ہے اور کیا اپنے سالک کو سعادت سے ہٹا دیتا ہے، باوجود اس کے کہ وہ اللہ تک پہنچتا ہے۔ اور اس میں معیتِ الٰہیہ (اللہ کی معیت) اور اس میں موجودات کے مراتب کا علم ہے۔ پس یہ ان علوم میں سے کچھ ہیں جو یہ منزل اپنے اندر سموئے ہوئے ہے، اور \"اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "باب سیصد و پنجاه و پنجم در معرفت منزل راه‌های مولّد (السبل المولدة)، و ارض عبادت و گستردگی آن، و سخن خداوند متعال: «ای بندگان من که ایمان آورده‌اید، همانا زمین من وسیع است، پس تنها مرا بپرستید.» (يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ)\n\nزمین خدا چه وسیع است *** و آسمان خدا با آن ازدواج می‌کند (تنکحها)\nمحل اجتماع درها بسته است *** و دست راست جود (الهی) آن را می‌گشاید\nو سینه‌هایی که جایگاهشان تنگ شده است *** با نور علم شرح و بسط می‌یابد\nرازهای مبهم تاریک‌اند *** و علوم کشف (الکشف) آن‌ها را روشن می‌سازد\nهر نعمتی که به تو داده شده است *** حضرت احسان (المحسان) آن را می‌بخشد\nسپس اگر فسادی در آن برخیزد *** امید است که رحمان آن را اصلاح کند\nسپس اگر سخت شود و اگر به عدل گراید *** لگام هدایت آن را مهار می‌کند\nهر ادعای غیر صادقی *** زبان عجز آن را رسوا می‌سازد\nآتش‌زنه (زند) صاحب بلا با هر آزاری *** از بلای هستی (الکون) آن را می‌افروزد\n\n### [پس از فتح، هجرتی نیست]\n\nخداوند متعال فرمود: «آیا زمین خدا وسیع نبود تا در آن هجرت کنید؟» (أَ لَمْ تَكُنْ أَرْضُ الله واسِعَةً فَتُهاجِرُوا فِيها) و نفرمود «از آن» یا «به سوی آن». پس آن زمین خداست، چه کسی که او را می‌پرستد در آن ساکن باشد و چه کسی که از عبادت او تکبر می‌ورزد. و خداوند عزّ من قائل فرمود: «ای بندگان من که ایمان آورده‌اید، همانا زمین من وسیع است، پس تنها مرا بپرستید.» (يا عِبادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي واسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ) پس آن را به خود نسبت داد، نسبتی شدیدتر از سخن او: «همانا زمین از آن خداست.» (إِنَّ الْأَرْضَ لِلَّهِ) و همچنین بندگان را به خود نسبت داد، نسبتی از نوع اختصاص، و همچنین در امر به عبادت، آن‌ها را به خود نسبت داد و فرمود: «پس تنها مرا بپرستید.» (فَإِيَّايَ فَاعْبُدُونِ) و در موضعی دیگر فرمود: «خدا را بپرستید و پروردگارتان را بپرستید.» (اعْبُدُوا الله واعْبُدُوا رَبَّكُمُ) پس هر کس قدر این نسبت دادن به متکلم (خداوند) را بشناسد، قدر آنچه میان این دو نسبت است را می‌شناسد، اگرچه مقصود از عبادت یکی است. پس در توسعه‌اش در نسبت دادن بندگان به متکلم تنگی ایجاد کرد و در نسبت دادن آن‌ها به اسم (الهی) توسعه داد. و در اینجا اسراری است که جز کسی که امر را بر همان صورتی که در نفس خود هست می‌داند، آن را نمی‌داند. و این همان سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است هنگامی که مکه فتح شد: «پس از فتح، هجرتی نیست.» (لا هجرة بعد الفتح‏)\n\nبا وجود اینکه مکه شریف‌ترین مکان‌ها و خانه خداست که از شرق و غرب زمین به سوی آن حج گزارده می‌شود، اما امر و پاداش بزرگ برای کسی بود که از آن هجرت می‌کرد به خاطر ساکنانش. پس هنگامی که خداوند آن را فتح کرد و مؤمنان از بندگانش را در آن ساکن ساخت، فرمود: «پس از فتح، هجرتی نیست.»\n\nپس کسی که خداوند بر او فتح کند، او را در هر چیزی یا عین هر چیزی می‌بیند، لذا هجرت نمی‌کند، زیرا او فاقد چیزی نیست. و اگر هجرت کند، به امر اوست، پس به واسطه او، از او به سوی او هجرت می‌کند، به امر او؛ مانند خروجش برای ادای نماز در مسجد جماعت، و مانند خروجش به سوی مکه برای حج، و مانند خروجش برای جهاد و زیارت، و زیارت برادری در راه خداوند متعال، یا برای تلاش در تأمین معاش خانواده. این همه در حقیقت هجرت نیست، بلکه سیاحتی است به امر الهی بر اساس شهود (الشهود). و اگر بر اساس شهود نباشد یا گویی شهود نیست، پس مطلوب ما در این موضع نیست. زیرا کمترین مرتبه احسان این است که خدا را چنان بپرستی که گویی او را می‌بینی.\n\nو هنگامی که خداوند انسان کامل (الإنسان الکامل) را با دو صورت آفرید، موجودی که در دو نشئه وجود دارد، کسی که خداوند دو اسم اول و آخر را برای او جمع کرد و دو حکم ظاهر و باطن را به او عطا نمود تا به هر چیزی دانا باشد، او را از خاک زمین آفرید؛ پایین‌ترین موجودی که خلق شد و ورای آن ورایی نیست، همان‌طور که ورای خداوند مقصدی نیست. پس جایگاه او را در شریف‌ترین مکان‌ها قرار داد و آن نقطه‌ای است که ستون‌های خیمه بر آن استوار می‌شود، و عرش محیط را مکان استوای رحمانی قرار داد، آن‌گونه که شایسته جلال اوست، تا نشانه‌ای باشد بر ارتباط الهی که میان عرش و زمین و مراتب عالم محصور در میان آن دو، که شامل فضاهای افلاک و ارکان است. پس تمام عالم در درون عرش است، جز زمین که مقر سریر است.\n\nپس هنگامی که خداوند خواست ما را برای عبادت خود بیافریند، راه را بر ما نزدیک کرد، پس ما را از خاک در خاک آفرید، و آن زمینی است که خداوند آن را رام (ذلول) قرار داد، و عبادت همان خواری و رام بودن (الذلة) است. پس ما ذاتاً خوار هستیم و شبیه کسی نیستیم که از نور آفریده شد و به عبادت امر گردید، پس راه بر آن‌ها دور شد به دلیل دوری اصلشان از آنچه به آن دعوت شدند (عبادت او). اگر خداوند آن‌ها را در مقاماتشان از ابتدا به شهود نمی‌رساند، از آن پایین نمی‌آمدند، پس در عبادتشان ارتقایی نداشتند، همان‌طور که ما داریم، و توان وفای به عبادت را نداشتند، زیرا نور دارای عزت است نه خواری.\n\nاز عنایت خداوند به ما این بود که چون مطلوب از آفرینش ما عبادت او بود، راه را بر ما نزدیک کرد به اینکه ما را از زمین آفرید، زمینی که به ما امر کرد او را در آن بپرستیم. و هنگامی که کسی از ما غیر خدا را پرستید، خداوند غیرت ورزید که در زمین او غیر او پرستیده شود، پس فرمود: «و پروردگارت حکم کرد که جز او را نپرستید.» (وقَضى‏ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ) یعنی حکم کرد. پس هر کس غیر خدا را پرستید، جز به خاطر همین حکم نپرستید. پس جز خدا پرستیده نشد، اگرچه در نسبت دادن خطا کردند، زیرا خداوند در هر چیزی وجه خاصی دارد که آن چیز به واسطه آن ثابت است. پس هیچ کس از عبادت خدا خارج نشد.\n\nو هنگامی که خداوند خواست میان کسی که او را به اختصاص می‌پرستد و کسی که او را در اشیاء می‌پرستد تمایز قنهد، به هجرت از مکان‌های زمینی که خدا در آن‌ها در اعیان پرستیده می‌شود، امر کرد تا «خداوند ناپاک را از پاک جدا سازد.» (لِيَمِيزَ الله الْخَبِيثَ من الطَّيِّبِ) پس ناپاک کسی است که خدا را در اغیار (غیرها) پرستید و پاک کسی است که خدا را نه در اغیار پرستید.\n\nو خداوند متعال این زمین را محل خلافت قرار داد، پس آن خانه مُلک او و جایگاه نایب اوست که با احکام اسمائش ظاهر می‌شود. پس ما را از آن آفرید و ما را زنده و مرده در آن ساکن ساخت و ما را در نشئه دیگر با بعث از آن خارج می‌سازد تا عبادت از ما جدا نشود، هر کجا که باشیم، دنیا و آخرت. اگرچه آخرت خانه تکلیف نیست، اما خانه عبادت است.\n\nپس کسی که پیوسته در دنیا و آخرت شاهد (الشهود) چیزی باشد که برای آن آفریده شده است، او همان بنده کامل (العبد الکامل) است که مقصود از عالم است، نایب تمام عالم. اگر تمام عالم، بالا و پایین آن، برای یک لحظه از ذکر خدا غافل شوند، این بنده در آن ذکر به جای تمام عالم می‌ایستد و وجود عالم به واسطه او حفظ می‌شود. و اگر بنده انسانی از ذکر غافل شود، عالم نمی‌تواند جای او را در آن بگیرد و آن بخش از عالم که انسان ذاکر از آن زایل شده، خراب می‌شود.\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «قیامت برپا نمی‌شود در حالی که در زمین کسی باشد که بگوید: الله، الله.» (لا تقوم الساعة وفي الأرض من يقول الله الله‏)\n\nو هنگامی که خداوند این نشئه انسانی را آفرید و آن را به واسطه جامعیتش شرافت بخشید، ادعا (الدعوى) را در آن تعبیه کرد تا صورتش کامل شود، زیرا ادعا صفتی الهی است. خداوند متعال فرمود: «همانا من الله هستم، معبودی جز من نیست، پس مرا بپرستید.» (إِنَّنِي أَنَا الله لا إِلهَ إِلَّا أَنَا فَاعْبُدْنِي) پس ادعا کرد که معبودی جز او نیست، و این ادعایی صادق است. پس کسی که ادعای صادق کند، حجتی بر او وارد نمی‌شود و بر هر کس که ادعای او را رد کند، سلطه دارد، زیرا او دارای شدت، غلبه و قهر است، چون صادق است و صدق همان شدت است، پس مقاومت نمی‌شود.\n\nو چون ادعا یک خبر است و خبر به طور مساوی نسبت صدق و کذب را می‌پذیرد، دانستیم که ناگزیر باید آزمایشی (الاختبار) در کار باشد. پس مؤمن ادعای ایمان کرد، و ایمان همان تصدیق به وجود خدا و یگانگی اوست و اینکه معبودی جز او نیست و اینکه «جز وجه او همه چیز نابود شونده است» (هالِكٌ إِلَّا وَجْهَهُ) و اینکه امر از قبل و بعد از آنِ خداست. پس هنگامی که با زبان ادعا کرد که این چیزی است که در درون او نهفته و قلبش بر آن بسته شده است، این احتمال وجود داشت که در ادعایش صادق باشد که این صفت اوست، و احتمال داشت که در اینکه این صفت اوست، کاذب باشد.\n\nپس خداوند او را آزمود تا حجت را به نفع یا علیه او اقامه کند، به واسطه تکلیفی که به او داد تا او را به اختصاص بپرستد، نه عبادتی که با سریان الوهیت جاری است. و اسباب را در برابر چشمان او قرار داد و نیاز این مدعی را به این اسباب متوقف ساخت. پس هیچ چیزی برای او قضا نشد مگر از طریق آن‌ها و به دست آن‌ها.\n\nاگر خداوند نوری به او روزی کند که با آن کشف (الکشف) کند و پرده‌های این اسباب را بشکافد، پس حق تعالی را از ورای آن‌ها به عنوان مسبِّب (اسم فاعل) ببیند، یا او را در آن‌ها به عنوان خالق و ایجادکننده نیازهایش که او را به آن‌ها مضطر کرده است، ببیند؛ پس او همان مؤمنی است که بر نور پروردگارش و بینه‌ای از امرش قرار دارد، صادق در ادعایش، که حق مقام ادعا شده را با عنایت الهی که به او داده شده، ادا می‌کند. و «کسی که خداوند برای او نوری قرار نداده باشد، پس او نوری ندارد.» (من لَمْ يَجْعَلِ الله لَهُ نُوراً فَما لَهُ من نُورٍ)\n\nپس او بعد از اقرار به ربوبیت خالقش، هنگامی که خداوند او را در گرفتن میثاق بر نفس خود شاهد ساخت و به او و امثال او فرمود: «آیا من پروردگار شما نیستم؟ گفتند: بله.» (أَ لَسْتُ بِرَبِّكُمْ قالُوا بَلى‏) هنگامی که او را در این دنیا به وجود آورد، او را بر آن فطرت به وجود آورد. پس او به الوهیت اسبابی که خداوند از آن‌ها به او روزی داد و آن‌ها را حجاب‌هایی میان او و خدا قرار داد، قائل شد، و نوری نداشت که با آن در تاریکی‌های خشکی و دریا هدایت شود، و جز ستارگان (که در اینجا ستارگان علم الهی هستند) چیزی نیست. پس الوهیت را به غیر مستحق آن نسبت داد، و در ادعایش دروغ گفت به دلیل کثرت اسباب و اقرارش در شرک به اینکه این (پرستش اسباب) او را به خدا، خالق اسباب، نزدیک می‌کند، و آن‌ها را آلهه قرار داد. پس سخن او: «معبودی جز او نیست» صادق نبود. و به همین دلیل است که کسی گفت: «آیا او خدایان متعدد را یک خدا قرار داده است؟ همانا این چیزی شگفت‌آور است.» (أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ) و شگفتی جز از کسی نیست که خدایان را متعدد قرار داده است.\n\nو کسی که به نسبت الوهیت به اسباب قائل نشد، اما جز اسباب را ندید و کشفی (الکشف) برای او حاصل نشد که او را از آن‌ها خارج سازد، با وجود توحید الوهیت، این شرک خفی (شرک خفّی) بود که صاحبش متوجه نمی‌شود که شرک است و او را از امر عالی که به واسطه آن طلب شده، محجوب می‌سازد. پس صاحب این ادعا در توحید خدا و توحید در افعال او، با وجود اضطراب هنگام فقدان سبب و آرامش هنگام وجود آن، صادق یافت نشد. پس نقص او به اندازه آن چیزی است که از او فوت شده است. این در حالی است که او اسباب را آلهه قرار نداده است.\n\nاگر بگویی: پس مشرکی که ادعا می‌کند مشرک است، در ادعایش صادق است که مشرک است، پس چرا صدقش به او نفعی نمی‌رساند؟ می‌گوییم: او در ادعایش در نسبت دادن الوهیت به کسی که اله نیست، کاذب است. این ادعای اوست که به واسطه آن کافر شد. او در اینکه مشرک است صادق است، اما در اینکه شرک در الوهیت صحیح است، صادق نیست، زیرا او با دلایل عقلی و شرعی در این باره بحث کرد و برای آنچه ادعا کرده بود، عین صدقی نیافت.\n\nپس خداوند بندگان را با آنچه برایشان تشریع کرد و با فرستادن رسولان آزمود، و مؤمنان را با اسباب آزمود. پس هر صنفی را به حسب ادعایش آزمود. کسی که صادق بود، آن صدق چیزی را به او ارث داد که ادعایش اقتضا می‌کرد. و به همین دلیل است که «از صادقان درباره صدقشان سؤال می‌شود» (الصَّادِقِينَ عَنْ صِدْقِهِمْ) در آنچه صادق بودند؛ آیا در آنچه به آن امر شدند و برایشان مباح شد، صادق بودند؟ یا آیا در انجام آنچه بر آن‌ها حرام شد، صادق بودند، با وجود اینکه صادق بودند؟ پس به آن‌ها گفته می‌شود: در چه چیزی صادق بودید؟ زیرا سخن‌چینان صادق‌اند و غیبت‌کنندگان صادق‌اند، در حالی که خداوند آن‌ها را مذمت کرده و بر آن وعده عذاب داده است، با وجود اینکه صدق است. به همین دلیل است که از صادقان درباره صدقشان در آنچه صادق بودند، سؤال می‌شود. این از آزمایش خداوند نسبت به آن‌هاست.\n\nو اصل این همه، همان ادعاهایی است که در آن‌ها تعبیه شده است، و از جمله چیزهایی که خداوند آن‌ها را با آن آزمود در خطاب، این است که آنچه آن‌ها را با آن مبتلا ساخت، برای این قرار داد که خداوند صادق در ادعایش را از کاذب بشناسد. پس خود را در این آزمایش در جایگاه کسی قرار داد که از آن علم کسب می‌کند، در حالی که او سبحانه عالم به آن چیزی است که از آن‌ها در آن رخ می‌دهد، پیش از وقوعش.\n\nپس از جمله منزّهان (در گمان خودشان) کسی است که می‌گوید: خداوند از آن علم کسب نمی‌کند، زیرا او امر را از حیث وقوع آن از فلان شخص معین نمی‌داند. پس کلام خدا را رد کرده و آن را تأویل می‌کند، زیرا از وقوع آزار به واسطه آن می‌ترسد. و از جمله ظاهریون کسی است که ملتزم می‌شود که خداوند با آن آزمایش می‌داند، به دلیل توقف بر این لفظ. و از مردم کسی است که آن را به تعلق علم به هنگام وقوع برمی‌گرداند، پس علم قدیم است و تعلق حادث. و از مؤمنان کسی است که علم آن را به خدا واگذار کرده و به آن ایمان آورده بدون تأویل معین، و این سالم‌ترین اعتقاد است.\n\nو این همه، ابتلایی است از جانب خداوند برای بندگانش که با زبان‌هایشان ادعای ایمان به او کردند، زیرا فرمود: «تا بدانیم» (حَتَّى نَعْلَمَ) همان‌طور که فرمود: «و قطعاً شما را می‌آزماییم» (ولَنَبْلُوَنَّكُمْ) و فرمود: «آیا گمان کردید که وارد بهشت می‌شوید در حالی که خداوند هنوز کسانی از شما را که جهاد کرده‌اند و صابران را نشناخته است؟» (أَمْ حَسِبْتُمْ أَنْ تَدْخُلُوا الْجَنَّةَ ولَمَّا يَعْلَمِ الله الَّذِينَ جاهَدُوا مِنْكُمْ ويَعْلَمَ الصَّابِرِينَ) پس میان آن دو تمایز قائل شد تا مجاهد را به جزای معین و صابر را به جزای معین پاداش دهد. و فرمود: «پس قطعاً خداوند کسانی را که راست گفته‌اند می‌شناسد و قطعاً دروغگویان را می‌شناسد.» (فَلَيَعْلَمَنَّ الله الَّذِينَ صَدَقُوا ولَيَعْلَمَنَّ الْكاذِبِينَ) هنگامی که فتنه (آزمایش) را ذکر کرد.\n\nهنگامی که انسان به نشئه بدنی خود نگاه کند، زمینی که از آن آفریده شده و غذای او و آنچه صلاح نشئه او به آن است، با او برپا می‌شود. خداوند در حالت عادی از غیر آن به او روزی نمی‌دهد. و کسی که خداوند در حق او عادت را بشکند و از آن به او روزی ندهد، از امری طبیعی و پنهان به او روزی می‌دهد، و آن سببی است که حیات او را به واسطه آن باقی نگه داشته است. پس حرارت و رطوبت او را که ماده حیات اوست، با امری لطیف که جز خدا و کسی که او را بر آن مطلع ساخته، نمی‌داند، حفظ کرده است.\n\nزیرا خداوند هنگامی که اسباب را وضع کرد، آن‌ها را در حق هیچ کس برنمی‌دارد، بلکه خداوند به برخی از بندگانش نوری عطا کرد که با آن در حرکت در تاریکی‌های اسباب هدایت شدند، نه اینکه آن اسباب را از آن‌ها بردارد. پس آن‌ها به اندازه انوارشان از آن مشاهده کردند. پس حجاب‌های اسباب همیشه آویخته‌اند و هرگز برداشته نمی‌شوند.\n\nپس طمع مکن، و اگر حق تو را از سببی منتقل کند، تنها به سبب دیگری منتقل می‌کند. پس هرگز تو را به طور کلی از سبب محروم نمی‌سازد، زیرا آن ریسمان خداست که تو را به چنگ زدن به آن امر کرده است، و آن همان شریعت نازل شده است که قوی‌ترین و صادق‌ترین اسباب است، و نور هدایت در تاریکی‌های خشکی و دریای این اسباب به دست اوست. پس کسی که چنین کند (که سبب است)، جزای او چنین است. پس در آنچه طمعی نیست، طمع مکن، بلکه از خداوند متعال قطره‌ای از آن نور را بر ذات خودت بخواه.\n\nو از امور لطیف این است که بدن تو را دارای منافذ قرار داد و هوا را که ماده حیات طبیعی است، تو را احاطه کرد، زیرا هوا ذاتاً گرم و مرطوب است. و در تو نیروی جاذبه قرار داد، پس ممکن است در هنگام فقدان اسباب معتاد، هوا را از منافذ خود جذب کنی و بدن خود را با آن تغذیه کنی در حالی که متوجه نیستی. و ما می‌دانیم که برخی از حشرات، غذایشان از منافذ بدنشان است، از رطوبت‌هایی که جذب می‌کنند، بر اساس میزانی خاص که بقای آن‌ها به واسطه آن است، بدون افراط و تفریط.\n\nسپس ای برادر ولیّ، بدان که زمین بدن تو، همان زمین حقیقی وسیع است که حق تو را امر کرده است که او را در آن بپرستی. و این بدان سبب است که او تو را امر نکرده است که او را در زمینش بپرستی، مگر تا زمانی که روحت در زمین بدنت ساکن است. پس هنگامی که از آن جدا شود، این تکلیف را از تو ساقط می‌کند، با وجود اینکه بدنت در زمین دفن شده است. پس بدان که زمین جز بدن تو نیست.\n\nو آن را وسیع قرار داد، به دلیل قوای و معانی‌ای که در خود جای داده است و جز در این زمین بدنی انسانی یافت نمی‌شود. و اما سخن او: «تا در آن هجرت کنید» (فَتُهاجِرُوا فِيها)، زیرا آن محل هوی (نفسانیت) و محل عقل است. پس از زمین هوی، از آن به سوی زمین عقل، از آن هجرت کنید، و تو در تمام این‌ها در آن هستی و از آن خارج نشده‌ای. اگر هوی تو را به کار گیرد، تو را هلاک می‌کند و نابود می‌شوی، و اگر عقل که چراغ شریعت به دست اوست، تو را به کار گیرد، نجات می‌یابی و خداوند تو را به واسطه آن نجات می‌دهد. زیرا عقل سلیم و مبرا از صفات نقص و شبهات، همان است که خداوند چشم بصیرتش را برای درک امور بر همان صورتی که هستند، گشوده است، پس با آن‌ها از طریق استحقاق رفتار می‌کند و حق هر صاحب حقی را به او می‌دهد.\n\nو کسی که خدا را در زمین وسیع بدنش نپرستد، خدا را در زمینی که از آن آفریده شده، نپرستیده است. زیرا خداوند می‌فرماید: «و آفرینش انسان را از گِل آغاز کرد، سپس نسل او را از چکیده‌ای از آب ناچیز قرار داد.» (وبَدَأَ خَلْقَ الْإِنْسانِ من طِينٍ ثُمَّ جَعَلَ نَسْلَهُ من سُلالَةٍ من ماءٍ مَهِينٍ) و آن آبی است که از این زمین بدنی جوشید و در رحم زن مستقر شد، سپس آن را سامان داد. پس از سامان یافتن زمین بدن و پذیرش اشتعال به واسطه رطوبت و حرارت موجود در آن، خداوند در آن دمید، پس مشتعل شد و آن اشتعال، روح او بود. پس جز از آن خارج نشد. از آن آفریده شد.\n\nو عقل را در این نشئه، نظیر ماه در زمین قرار داد، نوری که با آن روشنایی گرفته می‌شود، اما به دلیل حجاب‌های مانع از خانه‌ها و دیوارها و پناهگاه‌ها، آن نفوذ را ندارد. و شریعت را برای این عقل در این زمین بدنی، چراغی قرار داد. پس زوایای این زمین با نور چراغ روشن شد و از علم به آن، از آنچه در آن است، چیزی به او داد که نور عقل که به منزله ماه است، به او نداد.\n\nسپس ما را در آن (یعنی در نشئه دیگر) بازمی‌گرداند، همان‌طور که ما را در آن آفرید، و ما را برای مشاهده خود خارج می‌سازد، همان‌طور که ما را از آن ایجاد کرد و برای عبادت خود خارج ساخت. پس ارواح ما را از زمین بدن‌هایمان در دنیا برای عبادتش آفرید، و ما را در زمین بدن‌هایمان در آخرت برای مشاهده‌اش ساکن ساخت، اگر از سعادتمندان باشیم، همان‌طور که در نشئه اول به او ایمان آوردیم، هنگامی که خداوند به ما عنایت کرد. و حال در تقسیم خلق در آن، همانند حال است. و فردا نیز چنین خواهند بود.\n\nو مرگ میان دو نشئه، حالتی برزخی است که ارواح در آن، بدن‌های برزخی خیالی را آباد می‌کنند، همان‌طور که در خواب آن‌ها را آباد می‌کردند، و این‌ها بدن‌هایی هستند که از این اجسام خاکی متولد شده‌اند، زیرا خیال نیرویی از قوای آن است. پس ارواح آن‌ها از آن یا از آنچه از آن بوده، جدا نشده‌اند. پس این را بدان.\n\nپس زمین خدا که رکن موجود است، تو در آن مدفون هستی. و تو به عبادت پروردگارت امر نشده‌ای، مگر تا زمانی که در زمین وسیع بدنت هستی، با وجود عقلت و چراغ شریعتت. پس تو به عبادت پروردگارت امر شده‌ای. پس این زمین بدنی، در حقیقت برای تو همان زمین وسیع خداست که تو را امر کرده است که او را در آن بپرستی تا هنگام مرگت. و کسی که بمیرد، قیامت او برپا شده است، و آن قیامت جزئی است، و این همان سخن اوست: «و در آن شما را بازمی‌گردانیم.» (وفِيها نُعِيدُكُمْ)\n\nپس اگر قیامت جزئی را با مرگ این شخص معین فهمیدی، قیامت عام را برای هر مرده‌ای که بر آن بود، خواهی دانست. زیرا مدت برزخ برای نشئه آخرت، به منزله حمل جنین توسط زن در شکمش است که خداوند او را نشئه پس از نشئه ایجاد می‌کند، و اطوار نشئه بر او متفاوت می‌شود تا اینکه در روز قیامت متولد شود. به همین دلیل گفته شده است که مرده هنگامی که می‌میرد، قیامت او برپا شده است، یعنی ظهور نشئه دیگر در برزخ برای او آغاز شده است تا روز بعث از برزخ، همان‌طور که از شکم با ولادت به سوی زمین مبعوث می‌شود.\n\nپس تدبیر نشئه بدن او در زمین، در زمان بودن او در برزخ، برای سامان دادن و تعدیل آن بر غیر مثال سابق است، آن‌گونه که برای سرای آخرت شایسته است. پس او را در آن می‌پرستد، یعنی در زمین نشئه اخروی‌اش، عبادتی ذاتی، نه عبادت تکلیف، زیرا کشف (الکشف) مانع می‌شود که او بنده غیر کسی باشد که شایسته است بنده او باشد، همان‌طور که مردان خدا در اینجا به این مقام می‌رسند.\n\nو هنگامی که خداوند زمین بدن تو را آفرید، در آن کعبه‌ای قرار داد و آن قلب توست. و این خانه قلبی را شریف‌ترین خانه‌ها در مؤمن قرار داد. پس خبر داد که آسمان‌ها (که بیت المعمور در آن است) و زمین (که کعبه در آن است) او را در خود جای ندادند و برای او تنگ بودند، اما این قلب از این نشئه انسانی مؤمن او را در خود جای داد. و مراد در اینجا از وسعت، علم به خداوند سبحانه است. پس این تو را راهنمایی می‌کند که آن زمین وسیع است و زمین عبادت توست.\n\nپس او را چنان بپرست که گویی او را می‌بینی، از حیث بصرت، زیرا قلبت محجوب است که بصرت آن را درک کند، چون در باطن توست. پس خدا را چنان بپرست که گویی او را در ذات خود می‌بینی، آن‌گونه که شایسته جلال اوست، و چشم بصیرتت او را مشاهده می‌کند، زیرا او برای آن ظهور علمی دارد. پس او را با چشم بصیرتت می‌بینی و گویی او را از حیث بصرت می‌بینی. پس در عبادتت میان دو صورت جمع می‌کنی: میان آنچه او تعالی از عبادت در خیال مستحق است و میان آنچه از عبادت در غیر موطن خیال مستحق است. پس او را مطلق و مقید می‌پرستی. و این جز برای این نشئه نیست. به همین دلیل این نشئه مؤمنه را حرم محترم و خانه معظم و مکرم خود قرار داد. و من به این معنی با سخنم اشاره کرده‌ام:\n\nهر که حق (الحق) تمام او باشد *** همه چیز از او زایل شده است\nیا تو در او سایه‌اش هستی *** پس امر، تماماً حق است\nپس حق، شخص قائمی است *** و تو سایه او هستی\nحریم او محترم است *** پس حلال (حل) آن را حلال نمی‌کند\nاز هر آنچه شایسته نیست *** همانا او آن را بزرگ می‌دارد\n\nپس هر کس در هستی (الوجود) از مخلوقات است، خدا را بر غیب می‌پرستد، جز انسان کامل (الإنسان الکامل) مؤمن که او را بر مشاهده (الشهود) می‌پرستد. و بنده کامل نمی‌شود مگر با ایمان. پس نور ساطع از آن اوست، بلکه او همان نور ساطع است که هر ظلمتی را از بین می‌برد. پس هنگامی که او را بر شهادت بپرستد، تمام قوای او او را می‌بینند. پس جز او به عبادت او قیام نمی‌کند و شایسته نیست که جز او به آن قیام کند. پس کسی که این مقام برای او حاصل شده، جز انسان مؤمن نیست، زیرا او مؤمن نشد مگر به پروردگارش، زیرا او سبحانه همان مؤمن است.\n\n### [اینکه خداوند خلق را بر یک مزاج نیافرید]\n\nو بدان که اگر در این منزلت نباشی و در این درجه قدمی نداشته باشی، من تو را به چیزی راهنمایی می‌کنم که با آن به درجه عالی می‌رسی، و آن این است که بدانی خداوند خلق را بر یک مزاج (مزاج) نیافرید، بلکه آن را متفاوت المزاج قرار داد. و این با بداهت و ضرورت مشهود است، به دلیل تفاوتی که میان مردم در نظر عقلی و ایمان وجود دارد.\n\nو از طریق حق برای تو حاصل شده است که انسان آینه برادرش است، پس از او چیزی را می‌بیند که شخص از نفس خود نمی‌بیند، مگر به واسطه مانند خود. زیرا انسان با هوای نفس خود محجوب است و عاشق آن است. پس هنگامی که آن صفت را در دیگری ببیند، در حالی که آن صفت اوست، عیب نفس خود را در دیگری می‌بیند، پس زشتی آن را می‌داند اگر زشت باشد، یا حُسن آن را اگر دارای حُسن باشد.\n\n### [اینکه رسولان معتدل‌ترین مردم از نظر مزاج برای پذیرش رسالات پروردگارشان هستند]\n\nو بدان که آینه‌ها اشکال مختلفی دارند و مرئی را نزد بیننده به حسب شکل خود از طول و عرض و استواء و کجی و گردی و نقص و زیادی و تعدد نشان می‌دهند، و هر چیزی که شکل آن آینه به آن می‌دهد. و دانستی که رسولان معتدل‌ترین مردم از نظر مزاج برای پذیرش رسالات پروردگارشان هستند. و هر شخصی از آن‌ها به اندازه آنچه خداوند در ترکیب مزاجش به او عطا کرده بود، از رسالت پذیرفت. پس هیچ پیامبری نیست مگر اینکه به طور خاص به سوی قوم معینی مبعوث شد، زیرا او بر مزاج خاص و محدودی بود.\n\nو محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را خداوند مبعوث نکرد مگر با رسالتی عام به سوی تمام مردم، و او چنین رسالتی را نپذیرفت مگر به دلیل اینکه بر مزاجی عام بود که مزاج هر نبی و رسولی را در بر می‌گرفت. پس او معتدل‌ترین مزاج‌ها و کامل‌ترین و استوارترین نشئات است.\n\nپس هنگامی که این را دانستی و خواستی حق را بر کامل‌ترین صورتی که شایسته است برای این نشئه انسانی ظاهر شود، ببینی، بدان که تو دارای چنین مزاجی که برای محمد (صَلَّى اللهُ عَليهِ وسَلَّم) بود، نیستی و بر آن قرار نداری. و حق هرگاه در آینه قلب تو تجلی کند، آینه تو آن را تنها به اندازه مزاج و صورت شکل خودت به تو نشان می‌دهد. و تو نزول خود را از درجه‌ای که برای محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در علم به پروردگارش در نشئه‌اش صحیح بود، دانستی.\n\nپس به ایمان و پیروی پایبند باش و آن را پیش روی خود قرار ده، مانند آینه‌ای که صورت خود و صورت دیگری را در آن می‌بینی. اگر چنین کردی، دانستی که خداوند متعال ناگزیر باید در آینه محمد (صَلَّى اللهُ عَليهِ وسَلَّم) تجلی کند. و به تو خبر دادم که آینه در ناظر بیننده در مرئی اثر دارد. پس ظهور حق در آینه محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کامل‌ترین، معتدل‌ترین و نیکوترین ظهور است، به دلیل آنچه آینه او بر آن است. پس اگر او را در آینه محمد (صَلَّى اللهُ عَليهِ وسَلَّم) درک کردی، کمالی را از او درک کرده‌ای که از حیث نظر در آینه خودت درک نکرده‌ای.\n\nآیا نمی‌بینی در باب ایمان و آنچه در رسالت آمده است از اموری که حق با زبان شریعت به خود نسبت داده است و عقول آن را محال می‌دانند؟ اگر شریعت و ایمان به آن نبود، ما از حیث نظر عقلی خود هیچ چیز از آن را نمی‌پذیرفتیم، بلکه آن را از ابتدا رد می‌کردیم و گوینده آن را جاهل می‌شمردیم. همان‌طور که به واسطه رسالت و ایمان چیزی به او عطا شد که عقول فاقد ایمان از درک آن از جانب حق قاصر بودند، همچنین مزاج‌ها و آینه‌های عقول ما هنگام مشاهده از درک آنچه در آینه محمد (صَلَّى اللهُ عَليهِ وسَلَّم) تجلی کرد، در آینه خود قاصر ماندند. و همان‌طور که به او در رسالت غیباً ایمان آوردی، در این تجلی نبوی عیناً آن را مشاهده کردی.\n\nاگر او نبود و اگر ما نبودیم *** آنچه بود، نمی‌بود\nو رسالاتی از سوی رحمان، مولای ما *** با اخبار و احکام نمی‌آمد\nو خردمندان آن را *** با افکار، برهان نامیدند\nو آن را به سه بخش اسلام *** و ایمان و احسان تقسیم کردند\nپس منزه است آنکه او را به معراج برد *** تا او را نیکوکار (محساناً) ببیند\nو کسی را که انسان نامید *** به صورت رحمان اختصاص داد\nو رسولان او پی در پی آمدند *** گروه گروه و تنها\nو به ما عطا کرد و ما را گرامی داشت *** آنچه را که اینجا خواست پنهان بدارد\nو بهشت‌ها و رودها *** و روح و سپس ریحان\nو کشف (الکشف) و سپس شهود (الشهود) *** و اسرار و اعلان\n\nمن تو را نصیحت کردم و در نصیحت به تو رساندم. پس مشاهده حق را جز در آینه پیامبرت (صَلَّى اللهُ عَليهِ وسَلَّم) طلب مکن، و بر حذر باش که او را در آینه خودت مشاهده کنی، یا پیامبر و آنچه از حق در آینه او تجلی کرده است را در آینه خودت مشاهده کنی، زیرا این تو را از درجه عالی پایین می‌آورد. پس به اقتدا و پیروی پایبند باش و قدم در مکانی مگذار که جای پای پیامبرت را در آن نمی‌بینی. پس اگر می‌خواهی از اهل درجات عالی و شهود (الشهود) کامل در جایگاه قرب باشی، قدم خود را بر جای قدم او بگذار. و من در نصیحت به تو رساندم، همان‌طور که امر شدم. و «خداوند هر که را بخواهد به راه راست هدایت می‌کند.» (والله يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ)\n\nو در این منزل از علوم، علم مرتبه گمان و ظنون (الحسبان والظنون)، و علم تقریر الهی، و در آن علم اسرار پنهان از بیشتر مردم، و در آن علم افراد (الأفراد)، و در آن علم ملاحم، و در آن علم مسابقه و اینکه میدان مسابقه میان خدا و بندگانش کجاست، وجود دارد. و آن علمی شریف است که در آن از رحمت الهی چیزی است که هیچ وصف‌کننده‌ای آن را وصف نمی‌کند.\n\nو در آن علم رد بر کسانی است که به اجرای وعید (تهدید به عذاب) قائل‌اند و شمول رحمت برای همگان. و آن این است که انسان هنگامی که معصیت کند، در معرض انتقام و بلا قرار می‌گیرد و به واسطه آنچه از او سر زده است، در مسیر انتقام جاری است. و خداوند در این میدان با او مسابقه می‌دهد، از حیث اینکه او غفار و عفوکننده و درگذرنده و رحیم و رئوف است. پس بنده با معاصی و بدی‌ها با حق تعالی به سوی انتقام مسابقه می‌دهد، و حق پیشتازتر است، پس پیش از رسیدن بنده با بدی‌ها به انتقام، به سوی آن پیشی می‌گیرد و با غفار و اسماء خواهر آن از او درمی‌گذرد. پس هنگامی که بنده به آخر مسیر در این میدان می‌رسد، می‌بیند که غفار از انتقام پیشی گرفته و میان او و گناهکاران حائل شده است، در حالی که آن‌ها حکم می‌کردند که پیش از این به آن می‌رسند. و این همان سخن خداوند متعال در سوره عنکبوت است: «آیا کسانی که کارهای بد می‌کنند گمان کرده‌اند که بر ما پیشی می‌گیرند؟» (أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئاتِ أَنْ يَسْبِقُونا) یعنی با بدی‌هایشان بر مغفرت و شمول رحمت من پیشی می‌گیرند؟ «چه بد حکمی می‌کنند.» (ساءَ ما يَحْكُمُونَ) بلکه پیشی گرفتن از آنِ خداست به رحمت برای آن‌ها. این نهایت کرم است. و این جز در طایفه‌ای که به اجرای وعید در مورد کسی که بدون توبه می‌میرد، قائل‌اند، رخ نمی‌دهد. پس هنگامی که گناهکار بمیرد، رحمت خدا در موطنی که خدا بخواهد او را در آن ملاقات کند، به استقبال او می‌آید.\n\nو در آن علم سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است: «هر کس لقای خدا را دوست بدارد، خدا نیز لقای او را دوست می‌دارد؛ و هر کس لقای خدا را ناخوش دارد، خدا نیز لقای او را ناخوش می‌دارد.» (من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه‏) و نفرمود: او را ملاقات نمی‌کند. پس خداوند جز لقای او را که ناخوش داشته، ناخوش نداشته است، و آن این است که او را در حال مؤاخذه بر جرمش و انتقام گرفتن ملاقات کند. پس خداوند ناخوش داشت که او را با آنچه ناخوش داشته، ملاقات کند، پس او را با مغفرت و رضوان ملاقات کرد، زیرا دانست که او با وجود ایمان به لقای خدا، آن را ناخوش نداشته است مگر به دلیل مخالفتش. پس خداوند ناخوش داشت که او را با آنچه مخالفت مستحق آن است (عقوبت) ملاقات کند، پس او را با عفو و مغفرت ملاقات کرد.\n\nو در آن علم آنچه ذات برای نفس خود مستحق است، نه از حیث اتصاف به الوهیت، وجود دارد. و در آن علم این است که بازگرداندن همه امور، اگرچه از آنِ خداست، اما خداوند پس از آگاهی بر آن‌ها، آن‌ها را به آنچه می‌خواهد بر بندگانش بازمی‌گرداند. و در آن علم فرستادن پرده‌ها میان نفوس مؤمن و میان مخالفت‌ها، و کسی که از آن‌ها مخالفت کند، پرده‌ها میان او و عقوبت‌ها فرستاده می‌شود، وجود دارد. و در آن علم رفتار خداوند با بندگانش به آنچه موافق اغراض آن‌هاست، وجود دارد. و در آن علم منزلت اسباب وضع شده در عالم که دارای آثار در آن هستند، وجود دارد. و در آن علم آنچه اسباب او را به آن دعوت می‌کنند و آنچه شایسته است از آن اجابت کند و آنچه شایسته است اجابت نکند، وجود دارد. و در آن علم ملحق کردن دورها به نزدیک‌ها و پایین‌ها به بالاها در پیوستگی آن، وجود دارد. و در آن علم جهل کسی که میان حق و خلق مساوات قائل می‌شود و کسی که مراتب عالم را نزد خدا نمی‌داند، وجود دارد. و در آن علم تفسیر و تمییز وجود دارد. و در آن علم آنچه از عمل عامل به او بازمی‌گردد و آنچه بازنمی‌گردد، وجود دارد. و در آن علم اعمار اشیاء، و آن بقای شیء تا زمان فساد صورتش است که با زوال آن، اسمی که مستحق آن بود، از او زایل می‌شود، خواه جماد باشد یا نبات یا حیوان، وجود دارد. و در آن علم اخذ الهی به اسباب کونی و اینکه هر مأخوذی به آن، لشکری از لشکریان خداست، وجود دارد. و در آن علم اینکه عالم آیات برخی برای برخی دیگر است، وجود دارد. و در آن علم نصایح از مؤمنان و غیر مؤمنان وجود دارد. و در آن علم بیان علم با دلایل وجود دارد. و در آن علم آنچه در هر وقت نیاز به آن است، وجود دارد. و در آن علم اعتبار وجود دارد. و در آن علم اراده و مشیت وجود دارد. و در آن علم کسی که شایسته است در امور بر او اعتماد شود و کسی که نباید بر او اعتماد شود، وجود دارد. و در آن علم کسی که برای برادر مؤمنش بدی بخواهد، آن بدی به خودش بازمی‌گردد، و این در هر جنسی از امت‌ها جاری است، وجود دارد. و در آن علم کسی که صفت روز قیامت را در اینجا شتابان طلب کند و حکم او نزد خدا چیست، وجود دارد. و در آن علم هجرت و مهاجر وجود دارد. و در آن علم بخشش از غیر بخشنده وجود دارد. و در آن علم آنچه جاهل با علمش را وادار کرد که بگوید: «اگر این حق از جانب توست، پس بر ما از آسمان سنگ بباران یا عذابی دردناک بر ما بیاور.» (إِنْ كانَ هذا هُوَ الْحَقَّ من عِنْدِكَ فَأَمْطِرْ عَلَيْنا حِجارَةً من السَّماءِ أَوِ ائْتِنا بِعَذابٍ أَلِيمٍ) و امثال این، مانند سخن او: «عذاب خدا را بر ما بیاور اگر از راستگویانی.» (ائْتِنا بِعَذابِ الله إِنْ كُنْتَ من الصَّادِقِينَ) پس در این خبر الهی بنگر، زیرا آن مبالغه‌ای از آن‌ها در تکذیب است، چرا که اگر احتمال صدق رسول نزد آن‌ها وجود داشت، چنین سخنی نمی‌گفتند، زیرا نفوس بر جلب منافع برای خود و دفع ضرر از خود سرشته شده‌اند. و در آن علم مدارا با امت‌ها و دعا علیه آن‌ها از سوی پیامبرانشان وجود دارد. و در آن علم، علم به سرای آخرت و زمان آخرت و اینکه چرا بازمی‌گردد و در آنجا نه خورشیدی طلوع می‌کند و نه شبی فرا می‌رسد، وجود دارد. و در آن علم تنوع اسباب وجود دارد. و در آن علم مراتب کسانی که غیر خدا را به عنوان آلهه گرفتند، وجود دارد. و در آن علم فصل میان علما و حکما الهی وجود دارد. و در آن علم آنچه شایسته است مؤمن بر آن مداومت کند، وجود دارد. و در آن علم صنعت و صانع وجود دارد. و در آن علم تنازع در حدیث و مراتب متنازعین وجود دارد. و در آن علم مجمل از محکم از معضل از متشابه وجود دارد. و در آن علم تعلق ایمان به آنچه حق نیست، مانند سخن او: «و کسانی که به باطل ایمان آوردند.» (والَّذِينَ آمَنُوا بِالْباطِلِ) وجود دارد. و در آن علم داعیه‌ای که موجب شتاب در طلب شقاوت می‌شود، وجود دارد. و در آن علم مواطن ایمان و قرب (الزلف) وجود دارد. و در آن علم مراتب صبر و توکل وجود دارد. و در آن علم کسی که حق را شناخت و از آن اجتناب کرد و آنچه از آن ستوده و آنچه نکوهیده است، مانند حق مأمور به اجتناب، مثل غیبت، وجود دارد. و در آن علم بسط ستوده و نکوهیده وجود دارد. و در آن علم کسی که امری را دانست و به او گفته شد که آن را نمی‌دانی، وجود دارد. و در آن علم حیات جاری در موجودات و پنهان بودن آن در دنیا و ظهور آن در آخرت و اینکه با کدام بصر در دنیا کشف شد، وجود دارد. و در آن علم اضطرار و اینکه چگونه با زوال آن از بین می‌رود، وجود دارد. و در آن علم راه‌های به سوی خدا و اینکه اگرچه مختلف‌اند، همه حق‌اند و آنچه از آن‌ها ستوده و نکوهیده است و آنچه به سعادت می‌رساند و آنچه سالک خود را از سعادت منحرف می‌سازد، با وجود اینکه به خدا می‌رسد، وجود دارد. و در آن علم معیت الهی و مراتب موجودات در آن وجود دارد.\n\nاین‌ها بخشی از علومی است که این منزل در بر دارد. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)"
  },
  "page_count": 7
}