{
  "id": 51,
  "title": {
    "ar": "الباب الحادي والخمسون في معرفة رجال من أهل الورع قد تحققوا بمنزل نفس الرحمن",
    "en": "Chapter Fifty-One: Concerning the Knowledge of the Spiritual Adepts (Rijāl) among the People of Scrupulousness (Waraʿ) who have realized the Station of the Breath of the All-Merciful (Nafas al-Raḥmān)",
    "ur": "اکیاونواں باب: ان ورع (الورع) والے مردوں کی معرفت (المعرفة) کے بیان میں جنہوں نے نفس الرحمن (نفس الرحمن) کے مقام سے تحقق حاصل کیا۔",
    "fa": "باب پنجاه و یکم در معرفت مردانی از اهل ورع که به مقام نفس الرحمن (نفس الرحمن) تحقق یافته‌اند"
  },
  "content": {
    "ar": "## (الباب الحادي والخمسون في معرفة رجال من أهل الورع قد تحققوا بمنزل نفس الرحمن)\n\n\n> يا من تحقق بالنفس *** إن الكلام لفي القبس‏\n> وكذا الهبات من العلوم *** لدى المحقق في البلس‏\n\n\n> لله قوم ما لهم *** في نفس نفسهم نفس‏\n\n\n> وهم الذين هموهم *** أهل المشاهد في الغلس‏\n\n\n> شفهم الخلائف في الغيوب *** وفي الشهادة كالعسس‏\n\n\n> أعلى الإله مقامهم *** في سورة تتلى عبس‏\n\n\n> فيها لطائف سرهم *** فابحث ولا تك تختلس‏\n\n\n> من كان ذا علم بها *** في حاله لم يبتئس‏\n\n\n### [الورع في المكاسب على أشد ما يكون من عزائم الشريعة]\n\n\nاعلم أيدك الله بروح القدس أن رجال هذا الباب هم الزهاد الذين كان الورع سبب زهدهم وذلك أن القوم تورعوا في المكاسب على أشد ما يكون من عزائم الشريعة فكلما حاك له في نفوسهم شي‏ء تركوه عملا على‏\n\n\nقوله صلى الله عليه وسلم دع ما يريبك إلى ما لا يريبك‏\n\n\nوقوله استفت قلبك‏\n\n\nوقال بعضهم ما رأيت أسهل علي من الورع كل ما حاك له في نفسي شي‏ء تركته إلى أن جعل الله لهم علامات يعرفون بها الحلال من الحرام في المطاعم وغيرها إلى أن ارتقوا عن العلامات إلى خرق العوائد عندهم في الشي‏ء المتورع فيه فيستعملونه فيظن من لا علم له بذلك أنه أتى حراما وليس كذلك فاتسع عليهم ذلك الضيق والحرج وقد ذقنا هذا من نفوسنا وزال عنهم ما كانوا يجدونه في نفوسهم من البحث والتفتيش عن ذلك وهذه العلامة وهذا الحال التي ارتقوا إليها لا تكون أبدا إلا من نفس الرحمن رحمهم بذلك الرحمن لما رآهم فيه من التعب والضيق والحرج وتهمة الناس في مكاسبهم وما يؤديهم إليه هذا الفعل من سوء الظن بعباد الله فنفس الرحمن عنهم بما جعل لهم من العلامات في الشي‏ء وفي حق قوم بالمقام الذي ارتقوا إليه الذي ذكرناه فيأكلون طيبا ويستعملون طيبا فالطيبات للطيبين والطيبون للطيبات واستراحوا إذ كانوا على بينة من ربهم في مطاعمهم ومشاربهم وأداهم التحقق بالورع إلى الزهد في الكسب إذ كان مبني اكتسابهم الورع ليأكلوا مما يعلمون أن ذلك حلال لهم استعماله ثم عملوا على ذلك الورع في المنطق من أجل الغيبة والكلام فيما يخوض الإنسان فيه من الفضول فرأوا أن السبب الموجب لذلك مجالسة الناس ومعاشرتهم وربما قدروا على مسك نفوسهم عن الكلام بما لا ينبغي‏\n\n\n### [العزلة والانقطاع عن الناس‏]\n\n\nلكن بعضهم أو أكثرهم عجز أن يمنع الناس بحضوره عن الكلام بالفضول وما لا يعنيهم فأداهم أيضا هذا الحرج إلى الزهد في الناس فآثروا العزلة والانقطاع عن الناس باتخاذ الخلوات وغلق بابهم عن قصد الناس إليهم وآخرون بالسياحة في الجبال والشعاب والسواحل وبطون الأودية فنفس الله عنهم من اسمه الرحمن بوجوه مختلفة من الأنس به أعطاهم ذلك نفس الرحمن فأسمعهم أذكار الأحجار وخرير المياه وهبوب الرياح ومناطق الطير وتسبيح كل أمة من المخلوقات ومحادثتهم معه وسلامهم عليه فآنس بهم من وحشته وعاد في جماعة وخلق ما لهم كلام إلا في تسبيح أو تعظيم أو ذكر آلاء إلهية أو تعريف بما ينبغي وهو جليس لهم ويسمع جوارحه وكل جزء فيه يكلمه بما أنعم الله عليه به فتغمره النعم فيزيد في العبادة ومنهم من ينفس عنه بالأنس بالوحوش رأينا ذلك فتغدو عليه وتروح مستأنسة به وتكلمه بما يزيده حرصا على عبادة ربه‏\n\n\n### [الروحانيون من الجان ومخالطتهم أهل العزلة]\n\n\nومنهم من يجالسه الروحانيون من الجان ولكن هو دون الجماعة في الرتبة إذا لم يكن له حال سوى هذا لأنهم قريب من الأنس في الفضول والكيس من الناس من يهرب منهم كما يهرب من الناس فإن مجالستهم رديئة جدا قليل أن تنتج خيرا لأن أصلهم نار والنار كثيرة الحركة ومن كثرت حركته كان الفضول أسرع إليه في كل شي‏ء فهم أشد فتنة على جليسهم من الناس فإنهم قد اجتمعوا مع الناس في كشف عورات الناس التي ينبغي للعاقل أن لا يطلع عليها غير أن الإنس لا تؤثر مجالسة الإنسان إياهم تكبرا ومجالسة الجن ليست كذلك فإنهم بالطبع يؤثرون في جليسهم التكبر على الناس وعلى كل عبد لله وكل عبد لله رأى لنفسه شفوفا على غيره تكبرا فإنه يمقته الله في نفسه من حيث لا يشعر وهذا من المكر الخفي وعين مقت الله إياه هو ما يجده من التكبر على من ليس له مثل هذا ويتخيل أنه في الحاصل وهو في الفائت ثم اعلم أن الجان هم أجهل العالم الطبيعي بالله ويتخيل جليسهم بما يخبرونه به من حوادث الأكوان وما يجري في العالم مما\nيحصل لهم من استراق السمع من الملإ الأعلى فيظن جليسهم أن ذلك كرامة الله به وهيهات لما ظنوا ولهذا ما ترى أحدا قط جالسهم فحصل عنده منهم علم بالله جملة واحدة غاية الرجل الذي تعتني به أرواح الجن أن يمنحوه من علم خواص النبات والأحجار والأسماء والحروف وهو علم السيمياء فلم يكتسب منهم إلا العلم الذي ذمته ألسنة الشرائع ومن ادعى صحبتهم وهو صادق في دعواه فاسألوه عن مسألة في العلم الإلهي ما تجد عنده من ذلك ذوقا أصلا فرجال الله يفرون من صحبتهم أشد فرارا منهم من الناس فإنه لا بد أن تحصل صحبتهم في نفس من يصحبهم تكبرا على الغير بالطبع وازدراء بمن ليس له في صحبتهم قدم وقد رأينا جماعة ممن صحبوهم حقيقة وظهرت لهم براهين على صحة ما ادعوه من صحبتهم وكانوا أهل جد واجتهاد وعبادة ولكن لم يكن عندهم من جهتهم شمة من العلم بالله ورأينا فيهم عزة وتكبرا فما زلنا بهم حتى حلنا بينهم وبين صحبتهم لإنصافهم وطلبهم الأنفس كما أيضا رأينا ضد ذلك منهم فما أفلح ولا يفلح من هذه صفته إذا كان صادقا وأما الكاذب فلا نشتغل به‏\n\n\n### [الملائكة نعم الجلساء هم أنوار ومحض صفاء]\n\n\nومنهم من نفس الرحمن عنه بمجالسة الملائكة ونعم الجلساء هم هم أنوار خالصة لا فضول عندهم وعندهم العلم الإلهي الذي لا مرية فيه فيرى جليسهم في مزيد علم بالله دائما مع الأنفاس فمن ادعى مجالسة الملإ الأعلى ولم يستفد في نفسه علما بربه فليس بصحيح الدعوى وإنما هو صاحب خيال فاسد ومنهم من ينفس الرحمن عنه بأنس بالله في باطنه وتجليات دائمة معنويات فلا يزال في كل نفس صاحب علم بحال جديد بالله وأنس جديد ومنهم من ينفس الرحمن عنه ذلك الضيق بمشاهدته عالم الخيال يستصحبه ذلك دائما كما يستصحب الرؤيا النائم فيخاطب ويخاطب ولا يزال في صور دائما في لذة وفي نكاح إن جاءته شهوة جماع ولا تكليف عليه ما دام في تلك الحال لغيبته عن إحساسه في الشاهد فينكح ويلتذ ويولد له في عالم الخيال أولاد فمنهم من يبقى له ذلك في عالمه ومنهم من يخرج ولده إلى عالم لشهادة وهو خيال على أصله مشهود للحس وهذا من الأسرار الإلهية العجيبة ولا يحصل ذلك إلا للأكابر من الرجال‏\n\n\n### [لقاء ابن عربي لجماعة من رجال نفس الرحمن‏]\n\n\nوما من طبقة ذكرناها إلا وقد رأينا منهم جماعة من رجال ونساء بإشبيلية وتلمسان وبمكة وبمواضع كثيرة وكانت لهم براهين تشهد بصحة ما يقولونه وأما نحن فلا نحتاج مع أحد منهم لبرهان فيما يدعيه فإن الله قد جعل لكل صنف علامة يعرف بها فإذا رأينا تلك العلامة عرفنا صدق صاحبها من حيث لا يشعروكم رأينا ممن يدعي ذلك كاذبا أو صاحب خيال فاسد فإن علمنا منه أنه يرجع نصحناه وإن رأيناه عاشقا لحاله محجوبا بخياله الفاسد تركناه وأصدق من رأينا في هذا الباب من النساء فاطمة بنت ابن المثنى بإشبيلية خدمتها وهي بنت خمس وتسعين سنة وشمس أم الفقراء بمرشانة وأم الزهراء بإشبيلية أيضا وكلبهار بمكة تدعى ست غزالة ومن الرجال أبو العباس بن المنذر من أهل إشبيلية وأبو الحجاج الشبربلي من قربة بشرف إشبيلية تسمى شبربل ويوسف بن صخر بقرطبة\n\n\n### [الزهد في مستوى الحياة الظاهرية والباطنية]\n\n\nوهذا قد أعربنا لك عن أحوال رجال هذا الباب وما أنتج لهم الزهد في الناس وما وجدوه من نفس الرحمن لذلك وعلى هذا الحد تكون أعمال الجوارح كلها يجمعها ترك الفضول في كل عضو بما يستحقه ظاهرا وباطنا فأولها الجوارح وأعلاها في الباطن الفكر فلا يتفكر فيما لا يعينه فإن ذلك يؤديه إلى الهوس والأماني وعدم المسابقة بحضور النية في أداء العبادات فإن الإنسان لا يخلو فكره في أحد أمرين إما فيما عنده من الدنيا وإما فيما ليس عنده منها فإن فكر فيما عنده فليس له دواء عند الطائفة إلا الخروج عنه والزهد فيه صرح بذلك أبو حامد وغيره وإن فكر فيما ليس عنده فهو عند الطائفة عديم العقل أخرق لا دواء له إلا المداومة على الذكر ومجالسة أهل الله الذين الغالب على ظواهرهم المراقبة والحياء من الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "O you who have realized the Breath (النفس),\nIndeed, the speech is in the spark (القبس).\nAnd likewise, the gifts of knowledge,\nAre with the realized one in the testing (البلس).\n\nFor God are a people who have no breath (نفس)\nIn the breath (نفس) of their own soul (نفس).\n\nAnd they are those who are them,\nThe People of Witnessing (أهل المشاهد) in the darkness before dawn (الغلس).\n\nThe vicegerents (الخلائف) made them transparent in the Unseen (الغيوب),\nAnd in the Visible World (الشهادة) like night watchmen (العسس).\n\nGod elevated their station\nIn a Sura that is recited: 'He Frowned' (عبس).\n\nIn it are the subtleties of their secret,\nSo search, and do not be one who steals.\n\nWhoever possesses knowledge of it,\nIn his state will not despair.\n\n### [Scrupulousness in Earnings according to the Strictest Requirements of the Sacred Law]\n\nKnow, may God support you with the Holy Spirit (روح القدس), that the men of this chapter are the ascetics (الزهاد) whose asceticism was caused by their scrupulousness (الورع). This is because these people practiced scrupulousness in their earnings (المكاسب) according to the strictest requirements of the Sacred Law (عزائم الشريعة). Whenever something caused doubt (حاك له) in their souls, they abandoned it, acting upon his—may God bless him and grant him peace—saying:\n\n\"Leave that which causes you doubt for that which causes you no doubt.\"\n\nAnd his saying:\n\n\"Consult your heart.\"\n\nSome of them said: \"I have never seen anything easier for me than scrupulousness; whenever something caused doubt in my soul, I abandoned it.\" This continued until God granted them signs (علامات) by which they could distinguish the lawful (الحلال) from the unlawful (الحرام) in food and other matters. They then ascended beyond these signs to the point of breaking the customary norms (خرق العوائد) regarding the thing they were scrupulous about, so they would use it. Those who lack knowledge of this might assume they have committed something unlawful, but this is not the case. Thus, that narrowness and constraint (الضيق والحرج) were expanded for them. We have tasted this ourselves. The need for searching and investigating (البحث والتفتيش) that they used to find in their souls vanished. This sign and this state to which they ascended never come except from the Breath of the All-Merciful (نفس الرحمن). The All-Merciful showed them mercy (رحمهم) with this when He saw the toil, narrowness, and constraint they endured, and the suspicion (تهمة الناس) people cast upon their earnings, and the bad opinion (سوء الظن) of God’s servants that this action led to. So, the Breath of the All-Merciful relieved them by granting them signs concerning the thing itself, and for some people, by granting them the station we mentioned, to which they ascended. They eat what is pure (طيبا) and use what is pure. Thus, the pure things are for the pure people, and the pure people are for the pure things. They found rest, being upon clear evidence from their Lord concerning their food and drink. Realization through scrupulousness led them to asceticism in acquisition (الزهد في الكسب), since the foundation of their acquisition was scrupulousness, so that they might eat only what they knew was lawful for them to use. They then applied that scrupulousness to speech (المنطق) to avoid backbiting (الغيبة) and engaging in the superfluous matters (الفضول) that people delve into. They saw that the cause necessitating this was associating and mixing with people. They were perhaps able to restrain their own souls from speaking inappropriately,\n\n### [Seclusion and Separation from People]\n\nbut some of them, or most of them, were unable to prevent people in their presence from engaging in idle talk and matters that did not concern them. This constraint also led them to asceticism regarding people (الزهد في الناس). They preferred seclusion (العزلة) and separation from people, either by taking retreats (الخلوات) and closing their doors against people seeking them out, or by wandering (السياحة) in the mountains, ravines, coasts, and valleys. God relieved them through His Name, the All-Merciful (الرحمن), by various means of intimacy (الأنس) with Him. The Breath of the All-Merciful granted them this, making them hear the remembrance (أذكار) of stones, the murmur of water, the sound of the wind, the speech of birds, the glorification (تسبيح) of every community of creatures, and their conversation with Him and their salutations to Him. Thus, He relieved them of their loneliness (وحشته), and they returned to a community and creation whose speech is only glorification, magnification, remembrance of Divine bounties (آلاء إلهية), or instruction in what is proper. He is a companion to them, and He hears His limbs and every part of Him speaking to Him about the blessings God has bestowed upon it. Thus, blessings overwhelm him, and he increases in worship. Among them are those whom the All-Merciful relieves by intimacy with wild animals (الوحوش)—we have witnessed this—which come to him morning and evening, feeling intimate with him, and speaking to him in a way that increases his eagerness for the worship of his Lord.\n\n### [The Spiritual Beings among the Jinn and their Association with the People of Seclusion]\n\nAmong them are those whose companions are the spiritual beings among the Jinn (الروحانيون من الجان), but this person is lower in rank than the previous group if he has no state other than this, because the Jinn are close to humans in idle talk (الفضول). The wise person flees from them just as he flees from people, for their companionship is very poor and rarely yields good, because their origin is fire (نار), and fire is highly restless (كثيرة الحركة). Whoever is highly restless is quicker to engage in excess (الفضول) in everything. Thus, they are a greater temptation (فتنة) to their companion than humans. They share with humans the ability to uncover the faults of people, which the intelligent person should not reveal. However, humans do not affect their companion with arrogance (تكبرا) through their association, but the companionship of the Jinn is not like that. By nature, they instill in their companion arrogance toward people and toward every servant of God. Every servant of God who sees himself as superior to others out of arrogance is secretly despised by God (يمقته الله) without realizing it. This is a subtle deception (المكر الخفي). The very sign of God’s displeasure with him is the arrogance he finds toward those who do not share his state, imagining that he is in possession of the Real (الحاصل) when he is actually in the lost (الفائت).\n\nFurthermore, know that the Jinn are the most ignorant of the natural world concerning God. Their companion imagines, based on what they tell him about worldly events (حوادث الأكوان) and what happens in the cosmos—which they obtain by eavesdropping (استراق السمع) from the higher realm (الملإ الأعلى)—that this is a divine favor (كرامة) bestowed upon him. Far from it is what they imagine! This is why you never see anyone who associated with them gain comprehensive knowledge of God (علم بالله جملة واحدة). The most that the Jinn spirits grant the man they favor is knowledge of the properties (خواص) of plants, stones, Names, and letters—which is the science of Sympathy (علم السيمياء). Thus, he gains from them only the knowledge condemned by the tongues of the Sacred Laws (الشرائع). If someone claims their companionship and is truthful in his claim, ask him a question concerning Divine Science (العلم الإلهي); you will find no taste (ذوقا) of it with him whatsoever. Therefore, the men of God (رجال الله) flee from their companionship more intensely than they flee from people, for their companionship inevitably instills in the soul of their companion arrogance toward others and disdain for those who have no standing in their association. We have seen a group of those who truly associated with them, and proofs appeared confirming the truth of their claim of companionship. They were people of earnestness, striving, and worship, but they gained not a whiff of knowledge of God from the Jinn. We observed in them pride and arrogance, and we did not cease advising them until we separated them from that companionship, due to their fairness and their seeking of the souls (الأنفس). We have also seen the opposite among them, and such a person will not succeed, nor will he ever succeed, if this is his characteristic and he is truthful. As for the liar, we do not concern ourselves with him.\n\n### [The Angels are Excellent Companions: They are Lights and Pure Clarity]\n\nAmong them are those whom the Breath of the All-Merciful relieves by the companionship of the Angels (الملائكة). They are excellent companions (نعم الجلساء). They are pure lights (أنوار خالصة) and have no idle talk (فضول). They possess Divine Knowledge (العلم الإلهي) that is beyond doubt. Their companion is always found in increasing knowledge of God (علم بالله) with every breath. Therefore, whoever claims the companionship of the higher realm (الملإ الأعلى) and does not gain knowledge of his Lord in his soul, his claim is not sound; rather, he is merely the victim of a corrupt imagination (خيال فاسد).\n\nAmong them are those whom the All-Merciful relieves by intimacy with God (أنس بالله) in his inner being and continuous spiritual Theophanies (تجليات دائمة معنويات). With every breath, he is constantly possessed of new knowledge concerning God and new intimacy. Among them are those whom the All-Merciful relieves of that constraint by witnessing the World of Imagination (عالم الخيال). This accompanies him constantly, just as a dream accompanies the sleeper. He speaks and is spoken to, and he is always in forms, perpetually in pleasure. If the desire for intercourse (شهوة جماع) comes to him, he engages in marriage (نكاح). He is under no legal obligation (لا تكليف عليه) as long as he is in that state, due to his absence from his physical sensation in the visible world (الشاهد). He engages in intercourse, finds pleasure, and children are born to him in the World of Imagination. Some of these children remain in his world, and some of his children emerge into the visible world (عالم الشهادة) as an imaginal form (خيال على أصله مشهود للحس) witnessed by the senses. This is one of the strange Divine Secrets (الأسرار الإلهية العجيبة), and it is attained only by the greatest of men (الأكابر من الرجال).\n\n### [Ibn Arabi’s Meeting with a Group of the Men of the Breath of the All-Merciful]\n\nWe have seen groups of men and women from every category we have mentioned, in Seville, Tlemcen, Mecca, and many other places, and they possessed proofs (براهين) testifying to the truth of what they claimed. As for us, we do not require proof from any of them regarding what they claim, for God has established a sign (علامة) for every category by which it is known. When we see that sign, we know the truthfulness of its possessor, even if they are unaware. How many times have we seen those who falsely claim this or who are victims of a corrupt imagination! If we know that they will turn back, we advise them; but if we see them enamored of their state (عاشقا لحاله) and veiled by their corrupt imagination, we leave them.\n\nThe most truthful women we have seen in this chapter are Fatima bint Ibn al-Muthanna in Seville—I served her when she was ninety-five years old—and Shams Umm al-Fuqara in Marshana, and Umm al-Zahra in Seville also, and Kulbahar in Mecca, who was called Sitt Ghazala. Among the men are Abu al-Abbas ibn al-Mundhir from Seville, Abu al-Hajjaj al-Sharbuli from a village near Seville called Sharbula, and Yusuf ibn Sakhr in Cordoba.\n\n### [Asceticism on the Level of Outer and Inner Life]\n\nWe have thus informed you about the states of the men of this chapter and what their asceticism regarding people produced for them, and the relief (نفس الرحمن) they found as a result. All actions of the limbs (أعمال الجوارح) must follow this principle: abandoning excess (ترك الفضول) in every member, according to what is due to it, outwardly and inwardly. The first of these are the physical limbs, and the highest inwardly is thought (الفكر). One must not think about what does not concern him, for that leads to delusion (الهوس), vain hopes (الأماني), and the failure to maintain presence of intention (النية) in performing acts of worship.\n\nA person’s thought is confined to one of two things: either what he possesses of the world, or what he does not possess of it. If he thinks about what he possesses, the Sufi masters (الطائفة) hold that the only cure is to abandon it and practice asceticism (الزهد فيه). Abu Hamid and others explicitly stated this. If he thinks about what he does not possess, he is considered senseless and foolish (عديم العقل أخرق) by the Sufi masters. The only cure for him is persistence in remembrance (الذكر) and associating with the People of God (أهل الله) whose outward state is dominated by vigilance (المراقبة) and awe of God (الحياء من الله).\n\n<<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way.)",
    "ur": "باب اکیاون: ان اہلِ ورع (الورع) کی معرفت میں جو نفس الرحمن (نفس الرحمن) کے مقام سے متحقق ہوئے ہیں۔\n\nاے وہ جو نفس (النفس) سے متحقق ہوا ہے\nبیشک کلام تو قَبَس (چنگاری) میں ہے\nاور اسی طرح علوم کی بخششیں\nمحقق کے نزدیک بَلَس (آزمائش) میں ہیں\n\nاللہ کے لیے وہ قوم ہے جن کے لیے\nاپنے نفس (نفس) کے نفس (نفس) میں کوئی نفس (سانس/وجود) نہیں\n\nاور وہی ہیں جو وہ ہیں\nاہلِ مشاہدہ (المشاهد) اندھیرے میں\n\nغیوب (الغيوب) میں اور شہادت (الشهادة) میں\nخلیفے ان کے لیے عسس (نگہبان) کی طرح ہیں\n\nاللہ نے ان کا مقام بلند کیا ہے\nاس سورت میں جو تلاوت کی جاتی ہے: عبس\n\nاس میں ان کے راز کے لطائف ہیں\nپس تلاش کر اور چوری نہ کر\n\nجو شخص ان کا علم رکھتا ہو\nوہ اپنی حالت میں کبھی غمگین نہیں ہوتا\n\n### [کسبِ معاش میں ورع (الورع) شریعت کے انتہائی سخت احکام کے مطابق]\n\nجان لو، اللہ تمہیں روح القدس سے تائید دے، کہ اس باب کے رجال وہ زاہد ہیں جن کے زہد کا سبب ورع (الورع) تھا۔ اور یہ اس لیے کہ اس قوم نے کسبِ معاش میں شریعت کے انتہائی سخت احکام کے مطابق ورع اختیار کیا۔ پس جب بھی ان کے نفوس میں کوئی چیز کھٹکتی، وہ اسے چھوڑ دیتے، عمل کرتے ہوئے:\n\nآپ صلی اللہ علیہ وسلم کے اس فرمان پر:\n**دع ما يريبك إلى ما لا يريبك‏**\n(اس چیز کو چھوڑ دو جو تمہیں شک میں ڈالے، اس چیز کی طرف جو تمہیں شک میں نہ ڈالے)\n\nاور آپ کے اس فرمان پر:\n**استفت قلبك‏**\n(اپنے دل سے فتویٰ لو)\n\nاور بعض نے کہا: \"میں نے ورع (الورع) سے زیادہ آسان کوئی چیز نہیں دیکھی، جب بھی میرے نفس میں کوئی چیز کھٹکتی، میں اسے چھوڑ دیتا۔\" یہاں تک کہ اللہ نے ان کے لیے ایسی نشانیاں مقرر کر دیں جن سے وہ کھانے پینے اور دیگر معاملات میں حلال کو حرام سے پہچانتے ہیں۔ یہاں تک کہ وہ ان نشانیوں سے بلند ہو کر خرقِ عادات (عادات کو توڑنے) تک پہنچ گئے، اس چیز میں جس سے وہ ورع کرتے تھے۔ پس وہ اسے استعمال کرتے ہیں، اور جو شخص اس کا علم نہیں رکھتا وہ گمان کرتا ہے کہ انہوں نے حرام کا ارتکاب کیا، حالانکہ ایسا نہیں ہے۔ پس وہ تنگی اور حرج ان پر کشادہ ہو گیا، اور ہم نے اپنے نفوس سے اس کا ذوق چکھا ہے۔ اور ان سے وہ چیز زائل ہو گئی جو وہ اپنے نفوس میں اس کے بارے میں تحقیق اور تفتیش کی صورت میں پاتے تھے۔ اور یہ نشانی اور یہ حال جس تک وہ بلند ہوئے ہیں، یہ کبھی بھی نفس الرحمن (نفس الرحمن) کے بغیر نہیں ہو سکتا۔ اللہ نے ان پر رحم کیا جب اس نے انہیں اس مشقت، تنگی اور حرج میں دیکھا، اور لوگوں کی طرف سے ان کے کسبِ معاش پر لگائے جانے والے الزامات میں دیکھا، اور اس فعل کے نتیجے میں بندگانِ خدا کے بارے میں پیدا ہونے والے بدگمانی میں دیکھا۔ پس نفس الرحمن (نفس الرحمن) نے ان سے تنگی دور کی ان نشانیوں کے ذریعے جو اس نے ان کے لیے اس چیز میں مقرر کیں، اور بعض قوموں کے حق میں اس مقام کے ذریعے جس تک وہ بلند ہوئے، جس کا ہم نے ذکر کیا۔ پس وہ پاکیزہ کھاتے ہیں اور پاکیزہ استعمال کرتے ہیں، پس پاکیزہ چیزیں پاکیزہ لوگوں کے لیے ہیں اور پاکیزہ لوگ پاکیزہ چیزوں کے لیے ہیں۔ اور انہیں راحت ملی جب وہ اپنے رب کی طرف سے اپنے کھانے پینے کے معاملات میں بصیرت پر تھے۔ ورع (الورع) سے متحقق ہونے نے انہیں کسبِ معاش میں زہد کی طرف رہنمائی کی، کیونکہ ان کے کسب کی بنیاد ورع تھی تاکہ وہ صرف وہی کھائیں جس کے استعمال کو وہ اپنے لیے حلال جانتے ہیں۔ پھر انہوں نے اسی ورع پر گفتگو میں بھی عمل کیا، غیبت اور ان فضول باتوں سے بچنے کے لیے جن میں انسان پڑتا ہے۔ پس انہوں نے دیکھا کہ اس کا سبب لوگوں کے ساتھ بیٹھنا اور میل جول رکھنا ہے۔ اور بسا اوقات وہ اپنے نفوس کو ناپسندیدہ کلام سے روکنے پر قادر ہو جاتے تھے۔\n\n### [عزلت اور لوگوں سے کنارہ کشی]\n\nلیکن ان میں سے بعض یا اکثر اس بات سے عاجز رہے کہ اپنی موجودگی میں لوگوں کو فضول باتوں سے روک سکیں۔ پس اس تنگی نے بھی انہیں لوگوں میں زہد کی طرف رہنمائی کی، تو انہوں نے عزلت اور لوگوں سے کنارہ کشی کو ترجیح دی، خلوتیں اختیار کر کے اور لوگوں کے ان کی طرف آنے کے لیے اپنے دروازے بند کر کے۔ اور دوسرے وہ ہیں جنہوں نے پہاڑوں، گھاٹیوں، ساحلوں اور وادیوں کے اندر سیاحت اختیار کی۔ پس اللہ نے اپنے نام الرحمن (الرحمن) کے ذریعے ان سے تنگی دور کی، مختلف طریقوں سے ان کو اپنا انس عطا کیا۔ نفس الرحمن (نفس الرحمن) نے انہیں یہ عطا کیا، پس اس نے انہیں پتھروں کے اذکار، پانی کی سرسراہٹ، ہواؤں کے چلنے، پرندوں کی بولیوں اور مخلوقات کی ہر امت کی تسبیح سنائی، اور ان کی اپنے ساتھ گفتگو اور ان کا سلام سنایا۔ پس اس نے ان کی وحشت کو انس میں بدل دیا، اور وہ ایک ایسی جماعت اور مخلوق میں واپس آ گئے جن کی گفتگو صرف تسبیح، تعظیم، یا الٰہی نعمتوں کا ذکر، یا ضروری تعلیمات میں ہوتی ہے۔ اور وہ ان کا ہم نشین ہوتا ہے اور سنتا ہے کہ اس کے جوارح اور اس کا ہر حصہ اس سے اس نعمت کے بارے میں بات کرتا ہے جو اللہ نے اسے عطا کی ہے۔ پس نعمتیں اسے گھیر لیتی ہیں، تو وہ عبادت میں اضافہ کرتا ہے۔ اور ان میں سے بعض وہ ہیں جن سے نفس الرحمن (نفس الرحمن) وحشی جانوروں سے انس کے ذریعے تنگی دور کرتا ہے۔ ہم نے یہ دیکھا ہے، پس وہ صبح و شام اس کے پاس آتے ہیں، اس سے مانوس ہوتے ہیں اور اس سے ایسی باتیں کرتے ہیں جو اسے اپنے رب کی عبادت پر مزید حریص کرتی ہیں۔\n\n### [جنوں کے روحانی افراد اور ان کا اہلِ عزلت سے میل جول]\n\nاور ان میں سے بعض وہ ہیں جن کے ساتھ جنوں کے روحانی افراد بیٹھتے ہیں، لیکن وہ رتبے میں اس جماعت سے کم ہیں اگر ان کا حال صرف یہی ہو۔ کیونکہ وہ فضول باتوں میں انسانوں کے قریب ہیں۔ اور عقلمند شخص ان سے اسی طرح بھاگتا ہے جیسے لوگوں سے بھاگتا ہے، کیونکہ ان کی مجلس بہت بری ہے، شاذ و نادر ہی کوئی بھلائی پیدا ہوتی ہے، کیونکہ ان کی اصل آگ ہے، اور آگ بہت زیادہ حرکت کرتی ہے، اور جس کی حرکت زیادہ ہو، فضول باتیں ہر چیز میں اس کی طرف تیزی سے آتی ہیں۔ پس وہ اپنے ہم نشین کے لیے انسانوں سے زیادہ سخت فتنہ ہیں۔ کیونکہ وہ لوگوں کے عیوب کو جاننے میں انسانوں کے ساتھ شریک ہیں، جن پر عقلمند کو مطلع نہیں ہونا چاہیے۔ فرق صرف یہ ہے کہ انسان تکبر کی وجہ سے دوسرے انسانوں کی مجلس کو ترجیح نہیں دیتے، جبکہ جنوں کی مجلس ایسی نہیں ہے۔ کیونکہ وہ طبعاً اپنے ہم نشین میں لوگوں پر اور اللہ کے ہر بندے پر تکبر پیدا کرتے ہیں۔ اور اللہ کا ہر وہ بندہ جو اپنے نفس کے لیے دوسروں پر تکبر کی وجہ سے برتری دیکھتا ہے، تو اللہ اسے اس کے نفس میں ناپسند کرتا ہے جہاں سے اسے شعور بھی نہیں ہوتا، اور یہ خفیہ مکر میں سے ہے۔ اور اللہ کی طرف سے اس پر ناراضگی کی اصل وجہ وہ تکبر ہے جو وہ ان لوگوں پر محسوس کرتا ہے جن کے پاس یہ حال نہیں ہے، اور وہ خیال کرتا ہے کہ وہ حاصل میں ہے حالانکہ وہ فوت شدہ میں ہے۔ پھر جان لو کہ جن طبعی دنیا میں اللہ کے بارے میں سب سے زیادہ جاہل ہیں۔ اور ان کا ہم نشین ان باتوں کی وجہ سے جو وہ انہیں کائنات کے واقعات اور دنیا میں ہونے والے معاملات کے بارے میں بتاتے ہیں، جو انہیں ملاء اعلیٰ (الملإ الأعلى) سے چوری چھپے سننے سے حاصل ہوتی ہیں، یہ خیال کرتا ہے کہ یہ اللہ کی طرف سے اس پر کرامت ہے۔ لیکن ان کا گمان غلط ہے۔ اسی لیے تم کسی ایسے شخص کو نہیں دیکھو گے جو ان کے ساتھ بیٹھا ہو اور اس نے ان سے اللہ کے بارے میں کوئی جامع علم حاصل کیا ہو۔ زیادہ سے زیادہ جو شخص جنوں کی ارواح کی توجہ کا مرکز بنتا ہے، وہ یہ ہے کہ وہ اسے نباتات، پتھروں، اسماء اور حروف کی خواص کا علم عطا کرتے ہیں، جو کہ علمِ سیمیاء (طلسمات) ہے۔ پس اس نے ان سے صرف وہی علم حاصل کیا جس کی شریعتوں کی زبانوں نے مذمت کی ہے۔ اور جو شخص ان کی صحبت کا دعویٰ کرے اور اپنے دعوے میں سچا ہو، تو تم اس سے علمِ الٰہی (العلم الإلهي) کا کوئی مسئلہ پوچھو، تمہیں اس کے پاس اس کا ذوق (باطنی تجربہ) بالکل نہیں ملے گا۔ پس اللہ کے رجال ان کی صحبت سے اس سے بھی زیادہ بھاگتے ہیں جتنا لوگوں سے بھاگتے ہیں۔ کیونکہ ان کی صحبت اختیار کرنے والے کے نفس میں طبعاً دوسروں پر تکبر اور ان لوگوں کی تحقیر پیدا ہو جاتی ہے جنہیں ان کی صحبت میں قدم حاصل نہیں ہے۔ ہم نے ایک جماعت کو دیکھا ہے جنہوں نے حقیقت میں ان کی صحبت اختیار کی اور ان کے دعوے کی سچائی پر دلائل بھی ظاہر ہوئے، اور وہ کوشش، محنت اور عبادت والے تھے، لیکن ان کے پاس ان کی طرف سے اللہ کے علم کی کوئی جھلک بھی نہیں تھی۔ اور ہم نے ان میں عزت اور تکبر دیکھا۔ پس ہم ان کے ساتھ لگے رہے یہاں تک کہ ہم نے ان کے اور ان کی صحبت کے درمیان رکاوٹ ڈال دی، کیونکہ وہ انصاف پسند تھے اور اپنے نفوس کے طالب تھے۔ جیسا کہ ہم نے ان میں اس کے برعکس بھی دیکھا۔ پس جس کی یہ صفت ہو، اگر وہ سچا ہو تو وہ کامیاب نہیں ہوا اور نہ ہو گا، اور جھوٹے سے ہمیں کوئی سروکار نہیں۔\n\n### [فرشتے بہترین ہم نشین ہیں، وہ انوار اور خالص صفائی ہیں]\n\nاور ان میں سے بعض وہ ہیں جن سے نفس الرحمن (نفس الرحمن) فرشتوں کی مجلس کے ذریعے تنگی دور کرتا ہے۔ اور وہ بہترین ہم نشین ہیں۔ وہ خالص انوار ہیں، ان کے پاس کوئی فضول بات نہیں، اور ان کے پاس وہ علمِ الٰہی (العلم الإلهي) ہے جس میں کوئی شک نہیں۔ پس ان کا ہم نشین ہر سانس کے ساتھ ہمیشہ اللہ کے علم میں اضافہ دیکھتا ہے۔ پس جس نے ملاء اعلیٰ (الملإ الأعلى) کی مجلس کا دعویٰ کیا اور اپنے نفس میں اپنے رب کا علم حاصل نہ کیا، تو اس کا دعویٰ صحیح نہیں ہے، بلکہ وہ فاسد خیال کا مالک ہے۔ اور ان میں سے بعض وہ ہیں جن سے نفس الرحمن (نفس الرحمن) ان کے باطن میں اللہ کے انس اور دائمی معنوی تجلیات (التجلیات) کے ذریعے تنگی دور کرتا ہے۔ پس وہ ہر سانس میں اللہ کے ساتھ ایک نئے حال اور نئے انس کا علم رکھنے والا ہوتا ہے۔ اور ان میں سے بعض وہ ہیں جن سے نفس الرحمن (نفس الرحمن) اس تنگی کو عالمِ خیال (عالم الخيال) کے مشاہدے کے ذریعے دور کرتا ہے، جو ہمیشہ اس کے ساتھ رہتا ہے، جیسے سوئے ہوئے شخص کے ساتھ خواب رہتا ہے۔ پس وہ بات کرتا ہے اور اس سے بات کی جاتی ہے، اور وہ ہمیشہ صورتوں میں رہتا ہے، لذت میں، اور اگر اسے جماع کی خواہش ہو تو نکاح میں ہوتا ہے۔ اور جب تک وہ اس حال میں رہتا ہے، اس پر کوئی تکلیف نہیں ہوتی، کیونکہ وہ مشاہدے میں اپنے احساس سے غائب ہوتا ہے۔ پس وہ نکاح کرتا ہے، لذت پاتا ہے، اور عالمِ خیال (عالم الخيال) میں اس کے ہاں اولاد پیدا ہوتی ہے۔ پس ان میں سے بعض کی اولاد اسی عالم میں باقی رہتی ہے، اور بعض کی اولاد عالمِ شہادت (عالم الشهادة) میں نکل آتی ہے، جو اپنی اصل میں خیال ہے لیکن حس کے لیے مشہود ہے۔ اور یہ عجیب الٰہی رازوں میں سے ہے، اور یہ صرف اکابر رجال کو ہی حاصل ہوتا ہے۔\n\n### [ابن عربی کا نفس الرحمن (نفس الرحمن) کے رجال کی ایک جماعت سے ملاقات]\n\nاور ہم نے جن طبقات کا ذکر کیا ہے، ان میں سے مردوں اور عورتوں کی ایک جماعت کو اشبیلیہ، تلمسان، مکہ اور کئی دیگر مقامات پر دیکھا ہے۔ اور ان کے پاس ایسے دلائل تھے جو ان کے دعووں کی سچائی کی گواہی دیتے تھے۔ لیکن ہمیں ان میں سے کسی کے ساتھ اس کے دعوے کے بارے میں دلیل کی ضرورت نہیں، کیونکہ اللہ نے ہر صنف کے لیے ایک نشانی مقرر کر دی ہے جس سے وہ پہچانی جاتی ہے۔ پس جب ہم وہ نشانی دیکھتے ہیں تو اس کے حامل کی سچائی کو جان لیتے ہیں، حالانکہ وہ خود نہیں جانتا۔ اور ہم نے کتنے ہی ایسے لوگوں کو دیکھا ہے جو اس کا دعویٰ کرتے ہیں، حالانکہ وہ جھوٹے ہیں یا فاسد خیال کے مالک ہیں۔ پس اگر ہم نے جانا کہ وہ رجوع کر سکتا ہے تو ہم نے اسے نصیحت کی، اور اگر ہم نے دیکھا کہ وہ اپنے حال کا عاشق ہے اور اپنے فاسد خیال میں محجوب ہے تو ہم نے اسے چھوڑ دیا۔ اور اس باب میں ہم نے جن عورتوں کو سب سے زیادہ سچا پایا، ان میں اشبیلیہ کی فاطمہ بنت ابن المثنیٰ ہیں، میں نے ان کی خدمت کی جب وہ پچانوے سال کی تھیں۔ اور مرشانہ کی شمس ام الفقراء، اور اشبیلیہ کی ام الزہراء بھی، اور مکہ کی کُل بہار جسے ست غزالہ کہا جاتا ہے۔ اور مردوں میں اشبیلیہ کے ابو العباس بن المنذر، اور اشبیلیہ کے قریب ایک گاؤں شبربل کے ابو الحجاج الشبربلی، اور قرطبہ کے یوسف بن صخر شامل ہیں۔\n\n### [ظاہری اور باطنی زندگی کی سطح پر زہد]\n\nاور یہ ہم نے تمہیں اس باب کے رجال کے احوال سے آگاہ کر دیا، اور اس کے نتائج سے جو لوگوں میں زہد اختیار کرنے سے انہیں حاصل ہوئے، اور جو کچھ انہوں نے نفس الرحمن (نفس الرحمن) سے پایا۔ اور اسی حد پر تمام جوارح کے اعمال ہوتے ہیں، جس کا خلاصہ ہر عضو میں فضول چیزوں کو ترک کرنا ہے، جیسا کہ وہ ظاہراً اور باطناً مستحق ہے۔ پس ان میں سب سے پہلے جوارح ہیں، اور باطن میں سب سے اعلیٰ چیز فکر ہے۔ پس وہ اس چیز میں غور و فکر نہیں کرتا جو اس کے لیے ضروری نہیں، کیونکہ یہ اسے ہوس اور آرزوؤں کی طرف لے جاتا ہے، اور عبادات کی ادائیگی میں نیت کی حاضری کے ساتھ سبقت نہ کرنے کی طرف لے جاتا ہے۔ کیونکہ انسان کی فکر دو چیزوں میں سے کسی ایک سے خالی نہیں ہوتی: یا تو اس دنیا کے بارے میں جو اس کے پاس ہے، یا اس کے بارے میں جو اس کے پاس نہیں ہے۔ پس اگر وہ اس چیز کے بارے میں سوچتا ہے جو اس کے پاس ہے، تو اس گروہ کے نزدیک اس کا علاج صرف اس سے نکل جانا اور اس میں زہد اختیار کرنا ہے، جیسا کہ ابو حامد اور دیگر نے صراحت کی ہے۔ اور اگر وہ اس چیز کے بارے میں سوچتا ہے جو اس کے پاس نہیں ہے، تو وہ اس گروہ کے نزدیک عقل سے محروم اور احمق ہے، اس کا کوئی علاج نہیں سوائے ذکر کی مداومت اور اہلِ اللہ کی مجلس اختیار کرنے کے، جن کے ظاہر پر اللہ سے مراقبہ (المراقبۃ) اور حیاء غالب ہے۔\n\n**والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏**\n(اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)",
    "fa": "باب پنجاه و یکم در معرفت مردانی از اهل ورع که به منزل نفس الرحمن (نفس الرحمن) تحقق یافته‌اند\n\nای کسی که به نفس (نفس) تحقق یافته‌ای، همانا کلام در شعله (قبس) است.\nو همچنین عطایای علوم، نزد محقق در جوهر/پاکی (بلس) است.\n\nقومی از آنِ خدا هستند که در نفس (نفس) خودشان، نفسی (نفس) ندارند.\n\nو آنان کسانی هستند که اهل مشاهدات (المشاهد) در تاریکی سحرگاه (غلس) می‌باشند.\n\nخلفا (الخلائف) آنان را در غیوب (الغيوب) و در شهود (الشهادة) مانند نگهبانان شب می‌بینند.\n\nخداوند مقامشان را در سوره‌ای که تلاوت می‌شود، یعنی عبس، بالا برد.\n\nدر آن، لطایف سرّشان نهفته است؛ پس جستجو کن و دزدیده مگیر.\n\nهر کس که به آن علم داشته باشد، در حال (حال) خود اندوهگین نمی‌شود.\n\n### [ورع در کسب‌ها بر شدیدترین وجه از عزائم شریعت]\n\nای بنده خدا، بدان که خداوند تو را با روح القدس تأیید کند، مردان این باب همان زاهدانی هستند که ورع (الورع) سبب زهدشان (الزهد) شده است. این بدان سبب است که این قوم در کسب‌های خود بر شدیدترین وجه از عزائم شریعت پرهیزگاری ورزیدند. هرگاه چیزی در نفوسشان (النفوس) شک و شبهه ایجاد می‌کرد، آن را ترک می‌کردند، به عمل بر اساس این فرموده پیامبر (صلی الله علیه و سلم):\n«آنچه تو را به شک می‌اندازد رها کن و به آنچه تو را به شک نمی‌اندازد روی آور.» (حدیث: دع ما يريبك إلى ما لا يريبك)\nو فرموده ایشان:\n«از قلبت فتوا بخواه.» (حدیث: استفت قلبك)\nبرخی از آنان گفته‌اند: «چیزی را آسان‌تر از ورع ندیدم؛ هرگاه چیزی در نفسم شبهه ایجاد می‌کرد، آن را ترک می‌کردم.» تا جایی که خداوند برایشان نشانه‌هایی قرار داد که حلال را از حرام در خوردنی‌ها و غیره تشخیص دهند. تا اینکه از آن نشانه‌ها فراتر رفتند و به مرحله خرق عادات (خرق العوائد) در مورد آن شیء مورد ورع رسیدند، پس آن را به کار می‌برند و کسی که از این امر آگاهی ندارد، گمان می‌کند که مرتکب حرام شده است، در حالی که چنین نیست. بدین ترتیب، آن تنگی و حرج بر آنان گشاده شد و ما این را در نفوس خود چشیده‌ایم. و آنچه از جستجو و تفتیش در نفوس خود می‌یافتند، از آنان زائل شد. این نشانه و این حال (الحال) که به آن ارتقا یافتند، هرگز حاصل نمی‌شود مگر از نفس الرحمن (نفس الرحمن). خداوند رحمان به سبب تنگی، سختی و حرجی که در آن بودند و تهمت مردم در کسب‌هایشان و سوء ظنی که این عمل در مورد بندگان خدا برایشان ایجاد می‌کرد، به آنان رحم کرد و با قرار دادن این نشانه‌ها در آن شیء، و در حق قومی دیگر با مقامی که به آن ارتقا یافتند و ذکر کردیم، از آنان رفع تنگی نمود. پس پاک می‌خورند و پاک به کار می‌برند، زیرا پاکی‌ها برای پاکان است و پاکان برای پاکی‌ها. و آسوده شدند، زیرا در خوردنی‌ها و نوشیدنی‌هایشان بر بینه‌ای از پروردگار خود بودند. تحقق به ورع، آنان را به زهد در کسب سوق داد، زیرا بنای کسبشان بر ورع بود تا از آنچه می‌دانند حلال است، استفاده کنند. سپس آن ورع را در گفتار نیز به کار بستند، به خاطر غیبت (الغيبة) و سخن گفتن در فضولاتی (الفضول) که انسان در آن فرو می‌رود. پس دریافتند که سبب اصلی این امر، همنشینی و معاشرت با مردم است. و چه بسا می‌توانستند نفوس خود را از سخن گفتن به آنچه شایسته نیست باز دارند.\n\n### [عزلت و انقطاع از مردم]\n\nاما برخی از آنان یا بیشترشان، عاجز بودند که مردم را در حضور خود از سخنان بیهوده و آنچه به کارشان نمی‌آید باز دارند. پس این حرج نیز آنان را به زهد در مردم سوق داد. از این رو، عزلت (العزلة) و انقطاع از مردم را با اختیار خلوت‌ها (الخلوات) و بستن درهایشان بر روی مردم ترجیح دادند. و گروهی دیگر با سیاحت (السياحة) در کوه‌ها، دره‌ها، سواحل و بطن وادی‌ها. پس خداوند از اسم رحمان (الرحمن) خود، به وجوه مختلفی از انس (الأنس) با خویش، بر آنان گشایش ایجاد کرد. نفس الرحمن (نفس الرحمن) این انس را به آنان عطا کرد، پس اذکار (الأذكار) سنگ‌ها، صدای ریزش آب‌ها، وزش بادها، سخن گفتن پرندگان و تسبیح (التسبيح) هر امتی از مخلوقات را به آنان شنواند، و همچنین گفتگوی مخلوقات با او و سلامشان بر او. پس از وحشت خود با آنان مأنوس شد و به جمعی بازگشت و خلقی که سخنشان جز تسبیح یا تعظیم یا ذکر نعمت‌های الهی یا تعریف آنچه شایسته است، نبود. و او همنشین آنان است و اعضا و جوارحش و هر جزء از وجودش با او سخن می‌گوید، به آنچه خداوند بر او انعام کرده است. پس نعمت‌ها او را فرا می‌گیرد و بر عبادتش می‌افزاید. و از آنان کسانی هستند که خداوند با انس با وحوش بر آنان گشایش می‌دهد. ما این را دیده‌ایم که وحوش صبح و شام نزد او می‌آیند و با او مأنوس می‌شوند و با او سخن می‌گویند، به گونه‌ای که حرص او را بر عبادت پروردگارش می‌افزاید.\n\n### [روحانیون از جن و معاشرتشان با اهل عزلت]\n\nو از آنان کسانی هستند که روحانیون (الروحانيون) از جن با او همنشینی می‌کنند، اما اگر حال (حال) او منحصر به این باشد، رتبه او پایین‌تر از آن جماعت است؛ زیرا جن‌ها در فضول (الفضول) نزدیک به انسان‌ها هستند و زیرک‌ترین مردم کسی است که از آنان بگریزد، همان‌طور که از مردم می‌گریزد. زیرا همنشینی با آنان بسیار بد است و کمتر خیری از آن حاصل می‌شود، چون اصلشان آتش است. و آتش بسیار پرتحرک است و هر کس حرکتش زیاد باشد، فضول در هر چیزی سریع‌تر به او می‌رسد. پس آنان فتنه‌شان بر همنشین خود از انسان‌ها شدیدتر است. زیرا آنان با انسان‌ها در آشکار کردن عیوب مردم که شایسته است عاقل بر آن‌ها مطلع نشود، مشترک هستند. با این تفاوت که انسان‌ها از روی تکبر، همنشینی با انسان دیگر را تأثیر نمی‌بخشند، اما همنشینی با جن چنین نیست؛ زیرا آنان به طور طبیعی در همنشین خود تکبر (التكبر) بر مردم و بر هر بنده خدا را تأثیر می‌گذارند. و هر بنده خدا که برای خود برتری بر دیگری ببیند، از روی تکبر، خداوند او را در نفسش مورد نفرت قرار می‌دهد، در حالی که او متوجه نیست. و این از مکر خفی (المكر الخفي) و عین نفرت خداوند از اوست. و آن نفرت، همان تکبری است که نسبت به کسی که مانند او نیست، در خود می‌یابد و خیال می‌کند که در حال (الحاصل) است، در حالی که در فوت شده (الفائت) است. سپس بدان که جن‌ها جاهل‌ترین موجودات عالم طبیعی نسبت به خدا هستند. و همنشین آنان به سبب اخباری که از حوادث عالم و آنچه در جهان می‌گذرد به او می‌دهند، که از استراق سمع (استراق السمع) از ملأ اعلی (الملإ الأعلى) به دست می‌آورند، گمان می‌کند که این کرامت خداوند به اوست. هیهات از آنچه گمان می‌کنند! به همین دلیل، هرگز کسی را نمی‌بینی که با آنان همنشین شده باشد و علم بالله (علم بالله) کاملی نزد او حاصل شده باشد. نهایت چیزی که ارواح جن به مردی که به او توجه می‌کنند، می‌بخشند، علم خواص گیاهان، سنگ‌ها، اسماء و حروف است که همان علم سیمیا (علم السيمياء) است. پس او جز علمی که زبان‌های شرایع آن را مذمت کرده‌اند، کسب نمی‌کند. و هر کس ادعای مصاحبت با آنان کند و در ادعای خود صادق باشد، از او درباره مسئله‌ای در علم الهی بپرسید؛ هیچ ذوقی (الذوق) از آن نزد او نخواهید یافت. پس مردان خدا از مصاحبت با آنان شدیدتر از فرار از مردم، می‌گریزند. زیرا مصاحبت آنان ناگزیر در نفس کسی که با آنان مصاحبت می‌کند، تکبر بر غیر و تحقیر کسی که در مصاحبت آنان قدمی ندارد، ایجاد می‌کند. ما جماعتی را دیدیم که حقیقتاً با آنان مصاحبت داشتند و براهینی بر صحت ادعای مصاحبتشان ظاهر شد و اهل جد و کوشش و عبادت بودند، اما از جهت جن‌ها، ذره‌ای از علم بالله (علم بالله) نزدشان نبود و در آنان عزت و تکبر دیدیم. پس پیوسته با آنان بودیم تا به خاطر انصافشان و طلب نفسشان، میان آنان و مصاحبتشان جدایی انداختیم. همان‌طور که ضد این را نیز در میان آنان دیدیم. پس کسی که صفتش این باشد، اگر صادق باشد، رستگار نشده و رستگار نخواهد شد. اما به دروغگو نمی‌پردازیم.\n\n### [ملائکه چه همنشینان خوبی هستند؛ آنان انوار و محض صفایند]\n\nو از آنان کسانی هستند که نفس الرحمن (نفس الرحمن) با همنشینی ملائکه بر آنان گشایش می‌دهد. و چه همنشینان خوبی هستند! آنان انوار خالصی هستند که فضولی (فضول) نزدشان نیست و علم الهی (العلم الإلهي) که شکی در آن نیست، نزد آنان است. پس همنشین آنان پیوسته با هر نفس، در افزایش علم بالله (علم بالله) است. پس هر کس ادعای همنشینی با ملأ اعلی (الملإ الأعلى) کند و در نفس خود علمی به پروردگارش نیابد، ادعایش صحیح نیست، بلکه او صاحب خیال فاسد است. و از آنان کسانی هستند که نفس الرحمن (نفس الرحمن) با انس با خدا در باطن و تجلیات (التجلیات) دائمی معنوی بر آنان گشایش می‌دهد. پس پیوسته در هر نفس، صاحب علم به حال (حال) جدیدی با خدا و انس جدیدی است. و از آنان کسانی هستند که نفس الرحمن (نفس الرحمن) آن تنگی را با مشاهده عالم خیال (عالم الخيال) بر آنان گشایش می‌دهد. این حالت پیوسته با او همراه است، همان‌طور که رؤیا با شخص خوابیده همراه است. پس مورد خطاب قرار می‌گیرد و خطاب می‌کند و پیوسته در صور (صور) است، در لذت و در نکاح، اگر شهوت جماع به او دست دهد. و تا زمانی که در آن حال (الحال) است، تکلیفی (تكليف) بر او نیست، به دلیل غیبت او از احساسش در عالم شهود. پس نکاح می‌کند و لذت می‌برد و در عالم خیال برای او فرزندانی متولد می‌شود. برخی از این فرزندان در عالم خیال او باقی می‌مانند و برخی دیگر فرزندشان به عالم شهادت خارج می‌شود، در حالی که بر اصل خود خیالی است و برای حس مشهود. و این از اسرار الهی (الأسرار الإلهية) شگفت‌انگیز است و جز برای بزرگان مردان حاصل نمی‌شود.\n\n### [دیدار ابن عربی با جماعتی از مردان نفس الرحمن]\n\nو هیچ طبقه‌ای از طبقاتی که ذکر کردیم، نیست مگر اینکه ما جماعتی از مردان و زنان از آنان را در اشبیلیه، تلمسان، مکه و بسیاری از مکان‌ها دیده‌ایم. و آنان براهینی داشتند که بر صحت آنچه می‌گفتند، شهادت می‌داد. اما ما در مورد ادعای هیچ یک از آنان نیازی به برهان نداریم، زیرا خداوند برای هر صنفی علامتی قرار داده که با آن شناخته می‌شود. پس هرگاه آن علامت را ببینیم، صدق صاحبش را می‌شناسیم، در حالی که خودشان متوجه نیستند. و چه بسیار دیده‌ایم کسانی را که در این ادعا دروغگو یا صاحب خیال فاسد بودند. اگر می‌دانستیم که باز می‌گردد، او را نصیحت می‌کردیم و اگر می‌دیدیم که عاشق حال خود است و محجوب به خیال فاسدش، او را رها می‌کردیم. و صادق‌ترین کسانی که در این باب از زنان دیدم، فاطمه بنت ابن المثنی در اشبیلیه بود که در سن نود و پنج سالگی به او خدمت کردم، و شمس ام الفقراء در مرشانة، و ام الزهراء در اشبیلیه نیز، و کلب‌هار در مکه که ست غزاله نامیده می‌شد. و از مردان، ابوالعباس بن المنذر از اهل اشبیلیه، و ابوالحجاج الشبربلی از روستایی نزدیک اشبیلیه به نام شبربل، و یوسف بن صخر در قرطبه.\n\n### [زهد در سطح زندگی ظاهری و باطنی]\n\nو اینک ما احوال مردان این باب و آنچه زهد در مردم برایشان به ارمغان آورد و آنچه از نفس الرحمن (نفس الرحمن) یافتند، برای تو بیان کردیم. و اعمال تمامی جوارح نیز بر همین منوال است که مجموع آن‌ها ترک فضول (الفضول) در هر عضوی است، به آنچه شایسته آن است، ظاهراً و باطناً. و بالاترین آن‌ها در باطن، فکر (الفكر) است. پس نباید در آنچه به کارش نمی‌آید، تفکر کند؛ زیرا این امر او را به هوس (الهوس) و آرزوهای واهی و عدم سبقت با حضور نیت (النية) در انجام عبادات می‌کشاند. زیرا فکر انسان از دو حالت خارج نیست: یا در مورد آنچه از دنیا دارد، یا در مورد آنچه از دنیا ندارد. اگر در مورد آنچه دارد فکر کند، نزد این طایفه (صوفیه) دوایی جز خروج از آن و زهد (الزهد) در آن نیست. ابوحامد و دیگران به این امر تصریح کرده‌اند. و اگر در مورد آنچه ندارد فکر کند، نزد این طایفه، او بی‌عقل و احمق است و دوایی جز مداومت بر ذکر (الذكر) و همنشینی با اهل الله که مراقبه (المراقبة) و حیا از خدا بر ظاهرشان غالب است، ندارد.\nو خداوند حق را می‌گوید و او راه را هدایت می‌کند. (آیه قرآنی: وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)"
  },
  "page_count": 3
}