{
  "id": 218,
  "title": {
    "ar": "الباب الثامن عشر ومائتان في معرفة القبض وأسراره على الاختصار والإجمال",
    "en": "Chapter 218: On the Gnosis of Contraction [القبض] and its Mysteries, Presented in Brief and Summary Form.",
    "ur": "باب دو سو اٹھارہ: قبض (القبض) اور اس کے اسرار کی معرفت کے بیان میں، اختصار اور اجمال کے ساتھ",
    "fa": "باب دویست و هجدهم در معرفت قبض (القبض) و اسرار آن به اختصار و اجمال."
  },
  "content": {
    "ar": "## «الباب الثامن عشر ومائتان في معرفة القبض وأسراره على الاختصار والإجمال»\n\n\n> للقبض أسباب ولكنها *** تعلم أوقاتا وقد تجهل‏\n\n\n> فكل ما تعلم أسبابه *** فحكمه السبب الأول‏\n\n\n> وكل ما تجهل أسبابه *** فلا تقل أدنى ولا أفضل‏\n\n\n> فأفضل القبض إليه الذي *** يعرفه الأمثل فالأمثل‏\n\n\n> كقبضه الظل إليه وذا *** عليه أهل الله قد عولوا\n\n\n### [القبض إنه عبارة عن حال الخوف في الوقت‏]\n\n\nاعلم أن الطائفة قالت في القبض إنه عبارة عن حال الخوف في الوقت فإن الأسف في الماضي والخوف والحذر في المستقبل والقبض للمعنى الحاصل في الوقت وبعضهم نزع في القبض إلى نتائجه فقال القبض وارد يرد على القلب يوجب إشارة إلى عتاب أو زجر باستحقاق تأديب وقال بعضهم القبض حال ينتجه الخوف وقد يكون الخوف مشعورا به وقد لا يكون فاعلموا أيدكم الله أن القبض في الجناب الإلهي الذي عنه صدر القبض في الكون هو ما اتصف به الحق سبحانه من صفات المخلوقين ولا سيما في‏\n\n\nقوله ووسعني قلب عبدي‏\n\n\nثم تجليه لكل معتقد فيه في صورة اعتقاده فيه فصار الحق كأنه محصور مقبوض عليه بالاعتقادات وهي العلامة التي بين الله وبين عامة عباده ولو لم يكن كذلك لم يكن إلها وهو إله العالم بلا شك فلا بد من اتصافه بهذه السعة والعالم متباين الاستعداد ولا بد له من الاستناد فلا يزال يعبد كل جزء من العالم الله من حيث استعداده فلا بد أن يتجلى له الحق بحسب استعداده للقبول فما من شي‏ء إلا وهو يُسَبِّحُ بِحَمْدِهِ‏\nفقد قبض بكلتا يديه على ما اعتقده ولكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ فلو كان تسبيحهم راجعا إلى أمر واحد لم يجهل أحد تسبيح غيره وقد قال الله إن تسبيح الأشياء لا يفقه فدل على إن كل شي‏ء يسبح إلهه بما تقرر عنده منه مما ليس عند الآخر ولما كان في قضية العقل إن الله عز وجل لا يكون محصورا وفي قضية الوقوع وجود الحصر وصف نفسه في آخر الآية بأنه حليم فلم يؤاخذ مع القدرة من زعم أن الحق على وصف كذا خاصة وما هو على وصف كذا ووصف نفسه في آخر هذه الآية بأنه غفور لما ستر به قلوبهم عن العلم به إلا من شاء من عباده فإنه أعطاه العلم به على الإجمال وقال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ لأنه عين كل شي‏ء بدليل العلامة التي ثبتت عنه والشي‏ء لا يكون مثلا لعينه لأنه عين كل شي‏ء في كل ظل وكل في‏ء وكل طائفة سوى أهل الله قد نزهته أن يكون كذا ولهذا أخبر عنهم فقال وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ أي ينزه بِحَمْدِهِ أي بالثناء عليه والتنزيه البعد وما ذكر الله أنه أمرهم بتسبيحه بل أخبر أنهم يسبحون بحمده فاجعل بالك لقول الله في تلاوتك لما يقوله ربك عن نفسه وما يقوله العالم عنه وفرق ولا تحتج فيه إلا بما قاله عن نفسه لا بما يحكيه من قول العالم فيه تكن من أهل القرآن الذين هم أهل الله وخاصته وحقيقة حال القبض الإلهي‏\n\n\nفي إخباره تعالى عن نفسه ما ترددت في شي‏ء أنا فاعله ترددي في قبض عبدي المؤمن يكره الموت وأنا أكره مساءته ولا بد له من لقائي‏\n\n\nفوصف نفسه بالكراهة وكل كاره فحاله القبض فافهم ما نبهتك عليه تعثر على الحق وقد حصل في هذا الخبر أمران موجبان للقبض وهما التردد والكراهة والغضب المنسوب إليه والغضب حكم قبض بلا شك ولكن لما كان الجناب الإلهي في اعتقاد العامة يضيق المجال فيه الذي وسعه الشارع لم نقدر على إيضاح الأمر على ما هو عليه ذلك الجناب الإلهي إذ له الاتساع الذي لا ينبغي إلا له ومن أسمائه الواسع وهو من أعظم الأسماء إحاطة وهو الاسم الذي يتضمن الأسماء الإلهية التي تطلبها الأكوان كلها لاتساعه وهي أكثر من أن تحصى كثرة وأعيانها معلومة عند أهل الله تعالى في قوله عز وجل يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله فمن كحل عين بصيرته بكحل الكشف علم ما قلناه وكل أثر وخبر ورد فيه القهر الإلهي فإنه من باب القبض الإلهي ومن هناك ظهر القبض فينا فمن وفى مقام القبض حالا وذوقا كان قبضه إلهيا بلا شك وأما القبض الذي هو عن حال الخوف كما يراه بعضهم فذلك قبض خاص يتعلق بالنفس وسواء خاف صاحبه على نفسه أو على غيره فإن كان خوفه على غيره صحبه الإشفاق إذ كان آمنا على نفسه وكخوف الأنبياء على أممهم يوم القيامة فهم وأمثالهم ممن يحزنهم الفزع الأكبر من أجل أممهم وهم ممن لا يحزنهم الفزع الأكبر من أجل أنفسهم والقبض حال خوف أبدا إلا القبض المجهول سببه فإنه أيضا مجهول الخوف فإذا ورد القبض المجهول على قلب العارف سكن تحته ولم يتحرك رأسا حتى ينقدح له السبب فيعمل عند ذلك بحسب ما تقتضيه حقيقة ذلك السبب من الأثر فيه في أي جانب ظهر من حق وخلق وهو من المقامات المستصحبة إلى أول قدم يلقيه في الجنة فيرتفع عنه ولا يتصف به أبدا كما يرتفع بعض حكم الأسماء الإلهية الموجودة هنا وفي الآخرة بانقضاء مدة حكمها فلا تجد قابلا فترتفع بارتفاع حكمها إذ كانت عين حكمها ومن هنا تعلم أن أعيان الأسماء الإلهية هي أعيان أحكامها ولذلك تبقي أعيانها ما بقيت أحكامها وتفني بفناء أحكامها فلو كانت الأسماء الإلهية راجعة إلى ذات المسمى موجودة قائمة بها لم يصح فناؤها ولا فناء أحكامها ولو كانت أيضا راجعة إلى ذات المسمى لكان حكمها كذلك فلم يبق أن تكون إلا لنسب وإضافات لا وجود لها في عينها فلذلك قلنا إنها عين أحكامها فتزول بزوال الحكم وتثبت بثبوته‏\n\n",
    "en": "## Chapter 218: On the Knowledge of Contraction (al-Qabd) and its Secrets, in Brief and Summary\n\n> Contraction (al-Qabd) has causes, but they are\n> Known at times and may be unknown.\n> Everything whose causes are known,\n> Its ruling belongs to the First Cause.\n> Everything whose causes are unknown,\n> Do not say it is lesser or greater.\n> The best Contraction is that which\n> The most excellent knows, followed by the next most excellent.\n> Like His grasping (contraction) of the shadow unto Himself,\n> And upon this, the People of Allah (Ahl Allah) rely.\n\n### Contraction (al-Qabd): It is an expression of the state of Fear in the Present Moment (al-Waqt)\n\nKnow that the Sufi community (al-Ta'ifa) said concerning Contraction (al-Qabd) that it is an expression of the state of fear (al-Khawf) in the present moment (al-Waqt). For sorrow (al-Asaf) relates to the past, fear and caution (al-Hadhr) relate to the future, while Contraction relates to the meaning realized in the present moment. Some of them inclined towards the results of Contraction, saying: Contraction is an incoming spiritual state (Warid) that descends upon the heart, necessitating an indication of reproach (Itab) or a reprimand (Zajr) due to the deservingness of discipline (Ta'dib). Others said: Contraction is a state produced by fear, and this fear may be consciously perceived or it may not be.\n\nKnow, may Allah support you, that Contraction (al-Qabd) in the Divine Presence (al-Janab al-Ilahi), from which Contraction in the cosmos (al-Kawn) originates, is that by which the Real (al-Haqq), glory be to Him, is characterized from the attributes of creatures, especially in His saying: \"My servant's heart encompassed Me.\"\n\nThen, His Theophany (Tajalli) to every believer is in the form of their belief concerning Him. Thus, the Real (al-Haqq) becomes as if confined, grasped (maqbūd) by beliefs (al-I'tiqādāt). This is the sign established between Allah and the generality of His servants. If it were not so, He would not be a God (Ilah), and He is undoubtedly the God of the World (al-Alam). Therefore, He must be characterized by this vastness (al-Sa'a). The world possesses diverse preparedness (Istidad), and it must have a support (Istinad). Thus, every part of the world continuously worships Allah according to its preparedness. Therefore, the Real must manifest (Yatajalla) to it according to its preparedness for reception.\n\n<<وَمَا مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (There is not a thing except that it glorifies [Allah] with His praise). Thus, He has grasped (Qabada) with both His hands that which is believed. <<وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ>> (But you do not understand their glorification). If their glorification (Tasbih) referred back to a single matter, no one would be ignorant of the glorification of another. Allah has stated that the glorification of things is not understood, which indicates that everything glorifies its God (Ilah) according to what is established concerning Him in that thing, which is not present in the other.\n\nSince the dictate of the intellect (Qadiyyat al-Aql) is that Allah, the Mighty and Majestic, cannot be confined, yet the dictate of occurrence (Qadiyyat al-Wuqu') is the existence of confinement, He described Himself at the end of the verse as Forbearing (Halim). Thus, despite His power, He does not punish those who claim that the Real is only upon a certain description and not upon another. And He described Himself at the end of this verse as Forgiving (Ghafur) for what He veiled their hearts with, preventing them from knowing Him, except for those of His servants whom He willed, for He granted them the knowledge of Him in summary (al-Ijmāl).\n\nAnd He said: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), because He is the very Essence (Ayn) of everything, based on the sign established by Him, and a thing cannot be a likeness of its own essence. Because He is the Essence of everything in every shadow (dhill) and every shade (fay'). Every group other than the People of Allah (Ahl Allah) has declared Him transcendent (Nazzahathu) from being thus. Therefore, He informed concerning them, saying: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ>> (And there is not a thing except that it glorifies), meaning it declares Him transcendent (Yunazzihu), <<بِحَمْدِهِ>> (with His praise), meaning by praising Him (al-Thana' alayhi). And transcendence (al-Tanzih) is distance. Allah did not mention that He commanded them to glorify Him, but rather informed that they *do* glorify Him with His praise.\n\nTherefore, pay attention in your recitation to what your Lord says about Himself and what the world (al-Alam) says about Him, and differentiate. Do not argue concerning Him except with what He said about Himself, not with what He relates concerning the world's saying about Him. Then you will be among the People of the Quran, who are the People of Allah and His elect (Khassah).\n\nThe reality of the state of Divine Contraction (al-Qabd al-Ilahi) is in His, the Exalted, informing about Himself: \"I have not hesitated concerning anything I am about to do as I hesitate concerning the contraction (Qabd) of My believing servant. He dislikes death, and I dislike causing him distress, yet he must meet Me.\" Thus, He described Himself with dislike (Karahah), and the state of everyone who dislikes something is Contraction (al-Qabd). Understand what I have alerted you to, and you will stumble upon the Real (al-Haqq).\n\nIn this report, two matters necessitating Contraction have occurred: hesitation (al-Taraddud) and dislike (al-Karahah). And the Wrath (al-Ghadab) attributed to Him is undoubtedly a ruling of Contraction. However, since the Divine Presence (al-Janab al-Ilahi), in the belief of the common people, restricts the scope that the Lawgiver (al-Shari') has made vast, we cannot clarify the matter as it truly is concerning that Divine Presence. For He possesses the vastness (al-Ittisa') that belongs only to Him. And among His Names is The Vast (al-Wasi'), which is one of the Names most encompassing in scope. It is the Name that includes all the Divine Names sought by all the cosmoses (al-Akwan) due to its vastness. These Names are too numerous to count, yet their Fixed Entities (al-A'yan) are known to the People of Allah (Ahl Allah) in His saying, the Mighty and Majestic: <<يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ>> (O mankind, you are the poor [in need] of Allah). Whoever applies the kohl of Unveiling (al-Kashf) to the eye of his insight (Basirah) knows what we have said.\n\nEvery trace and report in which Divine Compulsion (al-Qahr al-Ilahi) is mentioned belongs to the category of Divine Contraction (al-Qabd al-Ilahi). And from there, Contraction appeared in us. Whoever fulfills the station (Maqam) of Contraction in state (Hal) and direct experience (Dhawq), his contraction is undoubtedly Divine.\n\nAs for the Contraction that arises from the state of fear, as some see it, that is a specific contraction related to the soul (al-Nafs). Whether its possessor fears for himself or for others, if his fear is for others, it is accompanied by compassion (al-Ishfaq), since he is secure concerning himself. This is like the fear of the Prophets for their communities on the Day of Resurrection. They and those like them are among those whom the Greatest Terror (al-Faza' al-Akbar) grieves on account of their communities, but they are among those whom the Greatest Terror does not grieve on account of themselves.\n\nContraction is always a state of fear, except for the Contraction whose cause is unknown, for then the fear is also unknown. When the unknown Contraction descends upon the heart of the Gnostic (al-Arif), he rests beneath it and does not move at all until the cause is revealed to him. He then acts according to what the reality of that cause necessitates in terms of effect upon him, whether it appears on the side of the Real (Haqq) or Creation (Khalq).\n\nIt is one of the stations (Maqamat) that accompanies one until the first step he casts into Paradise, where it is lifted from him, and he is never characterized by it again. Just as some rulings (Ahkam) of the Divine Names existing here and in the Hereafter are lifted when the duration of their ruling expires, so they find no recipient (Qabil) and are lifted by the lifting of their ruling, since they were the very essence (Ayn) of their ruling. From this, you know that the Fixed Entities (A'yan) of the Divine Names are the Fixed Entities of their rulings. Therefore, their Fixed Entities remain as long as their rulings remain, and they perish with the perishing of their rulings. If the Divine Names referred back to the Essence (Dhat) of the Named and existed subsisting by it, their perishing, nor the perishing of their rulings, would not be valid. And if they referred back to the Essence of the Named, their ruling would likewise be permanent. Thus, they can only be relations (Nisab) and attributions (Idafat) that have no existence in their own entity (Ayn). Therefore, we said that they are the very essence of their rulings, so they vanish when the ruling vanishes and are established when it is established.",
    "ur": "باب نمبر دو سو اٹھارہ: قبض (القبض) اور اس کے اسرار کی معرفت کے بیان میں، اختصار اور اجمال کے ساتھ\n\nقبض (القبض) کے اسباب ہیں، لیکن وہ\nکبھی معلوم ہوتے ہیں اور کبھی نامعلوم رہتے ہیں۔\n\nپس جس چیز کے اسباب معلوم ہوں،\nاس کا حکم پہلے سبب کے مطابق ہوتا ہے۔\n\nاور جس چیز کے اسباب نامعلوم ہوں،\nتو نہ کہو کہ یہ کم ہے اور نہ کہو کہ یہ افضل ہے۔\n\nپس اس کی طرف افضل قبض (القبض) وہ ہے\nجسے بہترین سے بہترین شخص جانتا ہے۔\n\nجیسے کہ اس کا سائے کو اپنی طرف قبض (القبض) کرنا،\nاور اسی پر اہلِ اللہ (اہل اللہ) نے بھروسہ کیا ہے۔\n\n### [قبض (القبض) یہ وقت میں خوف کی حالت کا اظہار ہے]\n\nجان لو کہ صوفیاء کی جماعت نے قبض (القبض) کے بارے میں کہا ہے کہ یہ وقت میں خوف کی حالت کا اظہار ہے۔ کیونکہ افسوس ماضی پر ہوتا ہے، خوف اور احتیاط مستقبل کے لیے ہوتی ہے، اور قبض (القبض) اس معنی کے لیے ہے جو وقت میں حاصل ہو۔ اور بعض نے قبض (القبض) کو اس کے نتائج کی طرف منسوب کیا اور کہا کہ قبض (القبض) ایک وارد (وارد) ہے جو قلب پر نازل ہوتا ہے، جو عتاب کی طرف اشارہ یا تادیب کے استحقاق کی وجہ سے ڈانٹ ڈپٹ کو واجب کرتا ہے۔ اور بعض نے کہا کہ قبض (القبض) ایک ایسی حالت ہے جو خوف پیدا کرتی ہے، اور یہ خوف کبھی محسوس ہوتا ہے اور کبھی نہیں۔\n\nپس جان لو، اللہ تمہاری مدد کرے، کہ جنابِ الٰہی (الجناب الإلهي) میں قبض (القبض)، جس سے کائنات میں قبض (القبض) صادر ہوا ہے، وہ مخلوقات کی صفات ہیں جن سے حق سبحانہ (الحق) نے خود کو متصف کیا ہے، خاص طور پر اس کے اس قول میں: \"اور میرے بندے کا دل مجھے سمو لیتا ہے۔\"\n\nپھر اس کا ہر معتقد کے لیے اس کے اعتقاد کی صورت میں تجلی (التجلی) کرنا، پس حق (الحق) گویا اعتقادات کے ذریعے محصور اور مقبوض (القبض) ہو گیا ہے۔ اور یہی وہ علامت ہے جو اللہ اور اس کے عام بندوں کے درمیان ہے۔ اگر ایسا نہ ہوتا تو وہ الٰہ نہ ہوتا، حالانکہ وہ بلاشبہ عالم کا الٰہ ہے۔ لہٰذا اس کے لیے اس وسعت سے متصف ہونا ضروری ہے۔ اور عالم مختلف استعدادوں کا حامل ہے اور اسے سہارے کی ضرورت ہے۔ پس عالم کا ہر جزو اپنی استعداد کے مطابق اللہ کی عبادت کرتا رہتا ہے۔ لہٰذا حق (الحق) کا اس کے قبول کرنے کی استعداد کے مطابق اس پر تجلی (التجلی) کرنا ضروری ہے۔ اور کوئی چیز ایسی نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے (يُسَبِّحُ بِحَمْدِهِ)۔ پس اس نے اپنے دونوں ہاتھوں سے اس چیز کو قبض (القبض) کر لیا جس کا اس نے اعتقاد کیا، لیکن تم ان کی تسبیح کو نہیں سمجھتے (وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ)۔\n\nاگر ان کی تسبیح ایک ہی امر کی طرف لوٹتی تو کوئی بھی دوسرے کی تسبیح سے ناواقف نہ رہتا۔ اور اللہ نے فرمایا ہے کہ اشیاء کی تسبیح کو سمجھا نہیں جاتا، پس یہ اس بات کی دلیل ہے کہ ہر چیز اپنے الٰہ کی تسبیح اس چیز کے ذریعے کرتی ہے جو اس کے نزدیک مقرر ہے اور جو دوسرے کے پاس نہیں ہے۔ اور چونکہ عقلی دلیل میں یہ ہے کہ اللہ عزوجل محصور نہیں ہو سکتا، اور وقوعی دلیل میں حصر کا وجود ہے، اس لیے اس نے آیت کے آخر میں خود کو حلیم (حلیم) کے طور پر بیان کیا، تاکہ وہ اس شخص کو قدرت کے باوجود مؤاخذہ نہ کرے جو یہ گمان کرتا ہے کہ حق (الحق) صرف فلاں صفت پر ہے اور فلاں صفت پر نہیں ہے۔ اور اس نے اسی آیت کے آخر میں خود کو غفور (غفور) کے طور پر بیان کیا، اس پردے کے سبب جو اس نے ان کے دلوں پر اپنے علم سے ڈال دیا، سوائے ان بندوں کے جنہیں اس نے چاہا، کیونکہ اس نے انہیں اجمالی طور پر اپنا علم عطا کیا۔ اور اس نے فرمایا: کوئی چیز اس کے مثل نہیں (لَيْسَ كَمِثْلِهِ شَيْءٌ)، کیونکہ وہ ہر چیز کی عین (حقیقت) ہے، اس علامت کی دلیل سے جو اس سے ثابت ہوئی ہے۔ اور کوئی چیز اپنی عین کی مثل نہیں ہو سکتی، کیونکہ وہ ہر سائے اور ہر پناہ گاہ میں ہر چیز کی عین ہے۔\n\nاور اہلِ اللہ (اہل اللہ) کے علاوہ ہر گروہ نے اس کی تنزیہہ کی ہے کہ وہ ایسا ہو۔ اسی لیے اس نے ان کے بارے میں خبر دی اور فرمایا: اور کوئی چیز نہیں مگر وہ تسبیح کرتی ہے (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ)، یعنی تنزیہہ کرتی ہے، اس کی حمد کے ساتھ (بِحَمْدِهِ)، یعنی اس کی ثناء کے ساتھ۔ اور تنزیہہ دوری ہے۔ اور اللہ نے یہ ذکر نہیں کیا کہ اس نے انہیں تسبیح کا حکم دیا، بلکہ یہ خبر دی کہ وہ اس کی حمد کے ساتھ تسبیح کرتے ہیں۔ پس جب تم تلاوت کرو تو اللہ کے اس قول پر دھیان دو جو تمہارا رب اپنے بارے میں کہتا ہے اور جو عالم اس کے بارے میں کہتا ہے، اور فرق کرو۔ اور اس میں صرف اسی چیز سے دلیل پکڑو جو اس نے اپنے بارے میں کہی ہے، نہ کہ اس سے جو وہ عالم کے قول کے طور پر نقل کرتا ہے۔ تب تم اہلِ قرآن میں سے ہو گے جو اہلِ اللہ (اہل اللہ) اور اس کے خاص بندے ہیں۔\n\nاور قبضِ الٰہی (القبض الإلهي) کی حالت کی حقیقت، اللہ تعالیٰ کے اپنے بارے میں خبر دینے میں ہے: \"میں نے کسی ایسے کام میں تردد نہیں کیا جسے میں کرنے والا ہوں، جتنا کہ میں نے اپنے مومن بندے کی روح قبض (القبض) کرنے میں تردد کیا، وہ موت کو ناپسند کرتا ہے اور میں اس کی ناگواری کو ناپسند کرتا ہوں، حالانکہ اسے مجھ سے ملنا ضروری ہے۔\"\n\nپس اس نے خود کو کراہت (ناپسندیدگی) سے متصف کیا، اور ہر ناپسند کرنے والے کی حالت قبض (القبض) ہوتی ہے۔ پس جو کچھ میں نے تمہیں تنبیہ کی ہے اسے سمجھو تاکہ تم حق (الحق) کو پا سکو۔ اور اس خبر میں دو چیزیں حاصل ہوئیں جو قبض (القبض) کو واجب کرتی ہیں، اور وہ ہیں تردد اور کراہت۔ اور وہ غضب جو اس کی طرف منسوب کیا جاتا ہے، غضب بلاشبہ قبض (القبض) کا حکم ہے۔ لیکن چونکہ جنابِ الٰہی (الجناب الإلهي) میں، عام لوگوں کے اعتقاد میں، وہ میدان تنگ ہو جاتا ہے جسے شارع نے وسیع کیا ہے، اس لیے ہم اس امر کی وضاحت نہیں کر سکتے کہ وہ جنابِ الٰہی کس حالت پر ہے۔ کیونکہ اس کے لیے وہ وسعت ہے جو صرف اسی کے لائق ہے۔ اور اس کے اسماء میں سے الواسع (الواسع) ہے، اور یہ احاطہ کے لحاظ سے سب سے عظیم اسماء میں سے ہے۔ اور یہ وہ اسم ہے جو ان الٰہی اسماء کو شامل کرتا ہے جن کا تقاضا تمام اکوان (کائناتیں) اپنی وسعت کی وجہ سے کرتی ہیں۔ اور وہ کثرت میں شمار ہونے سے زیادہ ہیں، اور ان کی حقیقتیں اہلِ اللہ (اہل اللہ) کے نزدیک معلوم ہیں۔ اللہ عزوجل کے اس قول میں: اے لوگو! تم اللہ کے محتاج ہو (يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ)۔\n\nپس جس نے اپنی بصیرت کی آنکھ کو کشف (الکشف) کے سُرمے سے سُرمگیں کیا، اس نے وہ جان لیا جو ہم نے کہا ہے۔ اور ہر وہ اثر اور خبر جس میں قہرِ الٰہی (القهر الإلهي) وارد ہوا ہے، وہ قبضِ الٰہی (القبض الإلهي) کے باب سے ہے۔ اور وہیں سے ہم میں قبض (القبض) ظاہر ہوا۔ پس جس نے مقامِ قبض (القبض) کو حال اور ذوق کے ساتھ پورا کیا، اس کا قبض (القبض) بلاشبہ الٰہی تھا۔\n\nاور رہا وہ قبض (القبض) جو خوف کی حالت سے پیدا ہوتا ہے جیسا کہ بعض اسے دیکھتے ہیں، تو وہ ایک خاص قبض (القبض) ہے جو نفس سے متعلق ہے۔ اور برابر ہے کہ اس کا صاحب اپنے نفس پر خوف کھائے یا کسی اور پر۔ اگر اس کا خوف کسی اور پر ہو تو اس کے ساتھ شفقت (الإشفاق) ہوتی ہے، کیونکہ وہ اپنے نفس کے بارے میں مطمئن ہوتا ہے۔ اور جیسے انبیاء کا قیامت کے دن اپنی امتوں پر خوف، پس وہ اور ان جیسے لوگ ان میں سے ہیں جنہیں اپنی امتوں کی خاطر فزعِ اکبر (بڑی گھبراہٹ) غمگین کرتی ہے، اور وہ ان میں سے ہیں جنہیں اپنے نفس کی خاطر فزعِ اکبر غمگین نہیں کرتی۔ اور قبض (القبض) ہمیشہ خوف کی حالت ہوتی ہے، سوائے اس قبض (القبض) کے جس کا سبب نامعلوم ہو، کیونکہ اس کا خوف بھی نامعلوم ہوتا ہے۔ پس جب نامعلوم قبض (القبض) عارف کے قلب پر وارد ہوتا ہے، تو وہ اس کے نیچے سکون اختیار کر لیتا ہے اور بالکل حرکت نہیں کرتا، یہاں تک کہ اس کے لیے سبب ظاہر ہو جائے، تب وہ اس سبب کی حقیقت کے تقاضے کے مطابق عمل کرتا ہے، خواہ وہ حق (الحق) کی جانب سے ظاہر ہو یا خلق (الخلق) کی جانب سے۔\n\nاور یہ ان مقامات میں سے ہے جو جنت میں پہلا قدم رکھنے تک ساتھ رہتے ہیں، پھر وہ اس سے بلند ہو جاتا ہے اور کبھی اس سے متصف نہیں ہوتا۔ جیسا کہ یہاں اور آخرت میں موجود بعض الٰہی اسماء کے احکام ان کی مدتِ حکم کے ختم ہونے پر بلند ہو جاتے ہیں، پس وہ کوئی قبول کرنے والا نہیں پاتے، اور اپنے حکم کے بلند ہونے سے بلند ہو جاتے ہیں، کیونکہ وہ اسماء اپنے حکم کی عین (حقیقت) تھے۔ اور اسی سے تم جانتے ہو کہ الٰہی اسماء کی حقیقتیں (أعيان) ان کے احکام کی حقیقتیں (أعيان) ہیں۔ اسی لیے ان کی حقیقتیں اس وقت تک باقی رہتی ہیں جب تک ان کے احکام باقی رہتے ہیں، اور ان کے احکام کے فنا ہونے سے وہ فنا ہو جاتی ہیں۔ پس اگر الٰہی اسماء مسمیٰ کی ذات کی طرف لوٹتے اور اس کے ساتھ موجود اور قائم ہوتے، تو ان کا فنا ہونا اور نہ ہی ان کے احکام کا فنا ہونا درست ہوتا۔ اور اگر وہ مسمیٰ کی ذات کی طرف لوٹتے، تو ان کا حکم بھی ایسا ہی ہوتا۔ پس یہ باقی نہیں رہتا کہ وہ نسبتوں اور اضافات کے سوا کچھ ہوں جن کا اپنی حقیقت میں کوئی وجود نہیں ہے۔ اسی لیے ہم نے کہا کہ وہ اپنے احکام کی عین (حقیقت) ہیں، پس حکم کے زائل ہونے سے زائل ہو جاتے ہیں اور اس کے ثابت ہونے سے ثابت رہتے ہیں۔",
    "fa": "«باب دویست و هجدهم در معرفت قبض (al-Qabḍ) و اسرار آن به اختصار و اجمال»\n\nقبض را اسبابی است، اما *** گاهی دانسته و گاهی نادانسته است.\n\nپس هر آنچه اسبابش دانسته شود *** حکم آن، همان سبب نخستین است.\n\nو هر آنچه اسبابش نادانسته بماند *** مگو که پست‌تر است یا برتر.\n\nپس بهترین قبض نزد او آن است *** که برترین‌ها و شایسته‌ترین‌ها آن را می‌شناسند.\n\nمانند قبض سایه به سوی او، و این همان است *** که اهل الله (أهل الله) بر آن تکیه کرده‌اند.\n\n### [قبض (al-Qabḍ) عبارت است از حال خوف در وقت]\n\nبدان که این طایفه (صوفیان) درباره قبض (al-Qabḍ) گفته‌اند که عبارت است از حال ترس (خوف) در وقت (al-Waqt). زیرا تأسف مربوط به گذشته است و ترس و احتیاط مربوط به آینده، و قبض (al-Qabḍ) مربوط به معنایی است که در حال (al-Waqt) حاصل می‌شود. برخی دیگر در تعریف قبض (al-Qabḍ) به نتایج آن توجه کرده و گفته‌اند: قبض (al-Qabḍ) وارداتی است که بر قلب نازل می‌شود و اشاره‌ای به سرزنش یا بازداشتن به دلیل استحقاق تأدیب را ایجاب می‌کند. و برخی گفته‌اند: قبض (al-Qabḍ) حالی است که از ترس (خوف) ناشی می‌شود، و گاهی این ترس محسوس است و گاهی نه.\n\nپس بدانید، خداوند شما را تأیید کند، که قبض (al-Qabḍ) در ساحت الهی (al-Janāb al-Ilāhī) که قبض در کَون (al-Kawn) از آن صادر شده است، همان چیزی است که حق سبحانه (al-Ḥaqq) به آن متصف شده است، یعنی صفات مخلوقات، به ویژه در این سخن: «و قلب بنده‌ام مرا وسعت داد.» (حدیث قدسی). سپس تجلی (al-Tajallī) او برای هر معتقدی در صورت اعتقاد اوست. پس حق (al-Ḥaqq) گویی محصور و مقبوض به اعتقادات شده است، و این همان نشانه‌ای است که خداوند میان خود و عموم بندگانش قرار داده است. اگر چنین نبود، او خدا نمی‌بود، در حالی که او بی‌شک خدای عالم است. پس ناگزیر باید به این وسعت متصف باشد. و عالم دارای استعدادهای متفاوتی است و ناگزیر باید تکیه‌گاهی داشته باشد. پس هر جزء از عالم، خداوند را از حیث استعداد خود عبادت می‌کند. بنابراین، حق (al-Ḥaqq) ناگزیر باید بر حسب استعداد آن جزء برای پذیرش، بر او تجلی (al-Tajallī) کند.\n\nپس هیچ چیزی نیست مگر اینکه: «او را به حمدش تسبیح می‌گوید» (يُسَبِّحُ بِحَمْدِهِ). پس او با هر دو دست خود بر آنچه اعتقاد شده قبض کرده است، «ولی شما تسبیح آنها را نمی‌فهمید» (وَلَكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ). اگر تسبیح آنها به یک امر واحد بازمی‌گشت، هیچ کس تسبیح دیگری را نمی‌فهمید. و خداوند فرموده است که تسبیح اشیاء فهمیده نمی‌شود. این دلالت دارد بر اینکه هر چیزی خدای خود را با آنچه نزد او از حق (al-Ḥaqq) مقرر شده و نزد دیگری نیست، تسبیح می‌گوید. و چون در حکم عقل این است که خداوند عز و جل محصور نمی‌شود، و در حکم وقوع، وجود حصر است، خداوند خود را در آخر آیه به صفت حلیم (بردبار) وصف کرد. پس با وجود قدرت، کسی را که گمان کرده حق (al-Ḥaqq) فقط بر وصفی خاص است و بر وصفی دیگر نیست، مؤاخذه نکرد. و خود را در آخر این آیه به صفت غفور (آمرزنده) وصف کرد، به خاطر آنچه که قلوبشان را از علم به او پوشانده است، مگر کسی از بندگانش که او بخواهد؛ زیرا به او علم به حق (al-Ḥaqq) را به اجمال عطا کرده است و فرموده است: «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ). زیرا او عین هر چیزی است، به دلیل نشانه‌ای که از او ثابت شده است، و شیء نمی‌تواند مَثَل عین خود باشد. زیرا او عین هر چیزی است در هر سایه و هر فیء (سایه بعد از زوال).\n\nو هر طایفه‌ای غیر از اهل الله (أهل الله)، او را از اینکه چنین باشد تنزیه کرده‌اند. و به همین دلیل درباره آنان خبر داده و فرموده است: «و هیچ چیزی نیست مگر اینکه تسبیح می‌گوید» (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ)، یعنی تنزیه می‌کند، «به حمد او» (بِحَمْدِهِ)، یعنی با ثنا و ستایش بر او. و تنزیه (al-Tanzīh) همان دوری است. و خداوند نفرموده است که به آنان امر کرده تا او را تسبیح گویند، بلکه خبر داده است که آنان به حمد او تسبیح می‌گویند. پس به سخن خداوند در تلاوتت، که پروردگارت درباره خود می‌گوید و آنچه عالم درباره او می‌گوید، توجه کن و فرق بگذار. و در این باره جز به آنچه او درباره خود گفته است، نه آنچه از قول عالم درباره او حکایت می‌کند، استدلال نکن تا از اهل قرآن باشی که همان اهل الله (أهل الله) و خاصان او هستند. و حقیقت حال قبض (al-Qabḍ) الهی در خبر دادن خداوند متعال از خود این است:\n\n«من در هیچ کاری که انجام‌دهنده‌اش هستم، به اندازه تردیدم در قبض روح بنده مؤمنم، تردید نکرده‌ام؛ او از مرگ کراهت دارد و من از ناخوشایندی او کراهت دارم، در حالی که چاره‌ای جز ملاقات من ندارد.» (حدیث قدسی).\n\nپس خود را به کراهت وصف کرده است، و حال هر کسی که کراهت دارد، قبض (al-Qabḍ) است. پس آنچه را به تو تذکر دادم بفهم تا بر حق (al-Ḥaqq) دست یابی. در این خبر دو امر موجب قبض (al-Qabḍ) حاصل شده است: یکی تردید و دیگری کراهت. و خشمی که به او نسبت داده می‌شود، بی‌شک حکم قبض (al-Qabḍ) است. اما چون ساحت الهی (al-Janāb al-Ilāhī) در اعتقاد عامه، مجالی را که شارع آن را وسعت داده است، تنگ می‌کند، نمی‌توانیم امر را آن‌گونه که در آن ساحت الهی است، توضیح دهیم. زیرا وسعتی که شایسته اوست، فقط از آن اوست. و یکی از اسماء او «الواسع» (واسع) است، و این از عظیم‌ترین اسماء از نظر احاطه است. و آن اسمی است که متضمن اسماء الهی است که تمام اکوان (al-Akwān) به دلیل وسعت آن، طالب آن هستند. و این اسماء بیش از آن است که به شمار آید، و اعیان آنها نزد اهل الله (أهل الله) معلوم است، در سخن عز و جل: «ای مردم، شما نیازمندان به سوی خدا هستید» (يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ). پس هر کس چشم بصیرت خود را با سرمه کشف (al-Kashf) سرمه کشد، آنچه را گفتیم می‌داند.\n\nو هر اثر و خبری که در آن قهر الهی (al-Qahr al-Ilāhī) وارد شده باشد، از باب قبض (al-Qabḍ) الهی است. و قبض (al-Qabḍ) در ما از آنجا ظاهر شد. پس هر کس مقام قبض (al-Qabḍ) را از نظر حال و ذوق (al-Dhūq) به کمال رساند، قبض او بی‌شک الهی خواهد بود. اما قبض (al-Qabḍ) که ناشی از حال ترس (خوف) است، آن‌گونه که برخی می‌بینند، قبض (al-Qabḍ) خاصی است که به نفس تعلق دارد. و فرقی نمی‌کند که صاحب آن بر خود بترسد یا بر دیگری. اگر ترس او بر دیگری باشد، شفقت (al-Ishfāq) همراه آن است، زیرا او بر خود ایمن است. مانند ترس انبیاء بر امت‌هایشان در روز قیامت؛ آنان و امثالشان کسانی هستند که فزع اکبر (ترس بزرگ) به خاطر امت‌هایشان آنان را اندوهگین می‌سازد، در حالی که فزع اکبر به خاطر خودشان آنان را اندوهگین نمی‌سازد. و قبض (al-Qabḍ) همواره حال ترس است، مگر قبض (al-Qabḍ) که سببش مجهول باشد، که ترس آن نیز مجهول است. پس هنگامی که قبض (al-Qabḍ) مجهول بر قلب عارف (al-Ārif) وارد شود، زیر آن آرام می‌گیرد و مطلقاً حرکتی نمی‌کند تا سبب آن برایش منقدح شود. آنگاه بر حسب آنچه حقیقت آن سبب از اثر در او اقتضا می‌کند، عمل می‌کند، در هر جانبی که ظاهر شود، چه حق (al-Ḥaqq) باشد و چه خلق. و این از مقامات همراه است تا اولین قدمی که در بهشت می‌گذارد، پس از او مرتفع می‌شود و هرگز به آن متصف نمی‌گردد. همان‌گونه که برخی از احکام اسماء الهی که در اینجا وجود دارند، در آخرت با انقضای مدت حکمشان مرتفع می‌شوند، و چون قابلی نمی‌یابند، با ارتفاع حکمشان مرتفع می‌شوند، زیرا آنها عین حکمشان بودند. و از اینجا می‌فهمی که اعیان اسماء الهی، عین احکام آنها هستند. و به همین دلیل، اعیان آنها تا زمانی که احکامشان باقی است، باقی می‌مانند و با فنای احکامشان فانی می‌شوند. اگر اسماء الهی به ذات مسمی بازمی‌گشتند و موجود و قائم به آن بودند، فنای آنها و فنای احکامشان صحیح نبود. و اگر نیز به ذات مسمی بازمی‌گشتند، حکم آنها نیز چنین بود. پس باقی نمی‌ماند جز اینکه آنها نسبت‌ها و اضافاتی باشند که در عین خود وجودی ندارند. به همین دلیل گفتیم که آنها عین احکام خود هستند، پس با زوال حکم زائل می‌شوند و با ثبوت آن ثابت می‌مانند."
  },
  "page_count": 2
}