{
  "id": 264,
  "title": {
    "ar": "الباب الرابع والستون ومائتان في معرفة الخواطر والخواطر ما يرد على القلب",
    "en": "Chapter Two Hundred and Sixty-Four: Concerning the Gnosis of the Passing Thoughts (*al-Khawāṭir*), and the *Khawāṭir* are that which descend upon the Heart.",
    "ur": "باب دو سو چونسٹھواں (۲۶۴) خواطر کی معرفت کے بیان میں، اور خواطر وہ ہیں جو قلب پر وارد ہوتے ہیں۔",
    "fa": "باب دویست و شصت و چهارم در معرفت خواطر، و خواطر آن چیزی است که بر قلب وارد می‌شود"
  },
  "content": {
    "ar": "## «الباب الرابع والستون ومائتان في معرفة الخواطر والخواطر ما يرد على القلب»\n\n\nوالضمير من الخطاب من غير إقامة وهو من الواردات التي لا تعمل لك فيها فإذا أقامت فهي حديث نفس ما هي خواطر\n\n\n> إذا كان واردنا خاطرا *** يمر بنا ثم لا يرجع‏\n> فما في الوجود سوى خاطر *** وما فيه رد ولا مدفع‏\n\n\n> تجدد أعياننا كلما *** تجدد أعراضنا فاسمعوا\n\n\n> فما ثم عين سوى واحد *** وآخر في أثره يتبع‏\n\n\n### [الخواطر لا إقامة لهم في قلب العبد إلا زمان مرورهم عليه‏]\n\n\nاعلم أن لله سفراء إلى قلب عبده يسمون الخواطر لا إقامة لهم في قلب العبد إلا زمان مرورهم عليه فيؤدون ما أرسلوا به إليه من غير إقامة لأن الله خلقهم على صورة رسالة ما أرسلوا به فكل خاطر عينه عين رسالته فعند ما يقع عليه عين القلب فهمه فأما يعمل\n\n\nبمقتضى ما أتاه به أو لا يعمل وجعل الله بينه وبين هذا القلب طرقا خمسة عليها تمشي هذه الخواطر إلى القلب وهذه الطرق أحدثها الله لما أحدث الشرائع فلو لا الشرائع ما أحدثها وجعلها كالهالة للقمر محيطة به فسمى الطريق الواحد وجوبا وفرضا وسمي الثاني ندبا والثالث حظرا والرابع كراهة والخامس إباحة وخلق الملك الموكل بالقلب يحفظه عن أمر الله بذلك وعين له من الطرق طريق الوجوب والندب وجعل في مقابلته شيطانا أقعده إلى جانبه عن غير أمر الله المشروع حسدا منه لما رأى من اعتناء الله بهذه النشأة الإنسانية دونه وشفوفه عليه وعلم ما يفضي إليه من السعادة إذا قام بحق ما شرع له من فعل وترك وجعل مثل ذلك على طريق الحظر والكراهة سواء وجعل على طريق الإباحة شيطانا لم يجعل هناك ملكا في مقابلته وجعل قوى النفس كلها وجبلتها مستفرغة لذلك الطريق وأمرها الله بحفظ ذاتها من ذلك الطريق من الشيطان وجعل الله في هذه النفس الإنسانية صفة القبول تقبل بها على كل من يقبل إليها وقبل إحداث الشرائع من آدم إلى زماننا إلى انقضاء الدنيا لم يكن ثم شي‏ء مما ذكرناه من ملك حافظ وشيطان منازع مناقض بل كان الأمر كما يؤول إليه عند ارتفاع الشرائع من الله إلى عبده ومن العبد إلى الله من غير تحجير ولا حكم من هذه الأحكام بل يتصرف بحسب ما تعطيه إرادته ومشيئته ثم خلق الله لهذه النفس الإنسانية صفة المراقبة لمن يرد من هذه الطرق عليها وأوحى إليها إلهاما أن بينه وبينها سفراء يأتون إليها من هذه الطرق ولا إقامة لهم عندها وقد أنشأنا ذواتهم من صورة رسالتهم حتى إذا رأيتهم علمت بالمشاهدة ما بعثهم الله به إليك فتيقظ ولا تغفل عنهم فإنهم يمرون بساحتك ولا يثبتون ويقول الحق قلت لهؤلاء السفرة إني أوجدت في هذا المرسل إليه صفتين صفة سميتها الغفلة وصفة سميتها اليقظة والانتباه فإن وجدتموه متصفا باليقظة فهو الغرض المقصود وإن وجدتموه متصفا بالغفلة فاقرعوا عليه بابه فإنه يتيقظ فإن لم يتيقظ فإنكم لا تفوتونه فإني جعلت له بصرا حديدا يدرك به صورتكم فيعلم ما بعثتكم به وإن لم يتيقظ لنقركم فاتركوه وتعالوا إلينا وقد ملك الله هذا الملك الموكل بالحفظ والقرين الملازم والنفس قوة التصور والتشكل لما يرون فيشكلون أمثاله حتى كأنه هو وليس هو وجعل هذه الأمثال في المرتبة الثانية فصاعدا في المراتب لا قدم لهم في المرتبة الأولى فالمرتبة الأولى لها الصدق ولا تخطئ فلا تعمل النفس بمقتضى ذلك الخاطر الأول فتخطئ ولا تكذب أبدا وأما التي على صورة الخواطر الأول فقد تصدق وتخطئ بحسب قوة التصوير وحفظ أجزاء الصورة وكذلك النظرة الأولى والحركة الأولى والسماع الأول وكل أول فهو إليه صادق فإذا أخطأ فليس بأول وإنما ذلك حكم الصورة التي وجدت في المرتبة الثانية وأكثر مراقبة الأمور الأول لا يكون إلا في أهل الزجر وقد رأيناه منهم وفي أهل الله خاصة فهو في أهل الله رتبة عاصمة وحافظة من الخطاء والكذب وهو في الزاجر قوة مراقبة وعلم وشهود واسم هذا الخاطر الأول عندهم الهاجس ونقر الخاطر والسبب الأول فما يمر من هؤلاء السفرة الكرام البررة على هذه الطرق المعينة لهذا القلب يلقي من هو عليه من ملك وشيطان ونفس فيأخذه من بادر إليه من هؤلاء بالتلقي فإن أخذه الملك وهو مما يقتضي وجود عمل سعادي أوحى إليه الملك في سره اعمل كذا وكذا فيقول له الشيطان لا تعمله وأخره إلى وقت كذا طمعا منه في إن لا يقع منه ما يؤدي إلى سعادته وهو ما يجده الإنسان من التردد في فعل الخير وتركه وفي فعل الشر وتركه وكذلك إذا جاءه على طريق الإباحة فذلك التردد في فعل المباح وتركه إنما هو بين النفس والشيطان لا بين الملك والشيطان فإن لمة الملك ولمة الشيطان المقابلة إنما تكون في الأربعة الطرق من الأحكام‏\nوأما في المباح فلمة الشيطان خاصة وما له منازع إلا النفس وإنما كان للنفس المباح دون غيره لأنها جبلت على جلب المنافع ودفع المضار والأمر أبدا يتقدم النهي في لمة الملك والشيطان فصاحب الأمر في الشر هو الشيطان فله التقدم وصاحب الأمر في الخير إنما هو الملك فله التقدم فلا يرد نهي إلا بعد أمر ولا عكس في مثل هذا في هذه الحضرة وأصله في الإنسان من آدم عليه السلام فإن الأمر تقدمه بسكنى الجنة والأكل منها حيث شاء ثم نهاه عن قرب شجرة مشار إليها إن تقربها فوقع التحجير والنهي في قوله حَيْثُ شِئْتُما لا في الأكل فما حجر عليه الأكل وإنما حجر عليه القرب منها الذي كان قد أطلقه في حيث شئتما فما أكلا منها حتى قربا فتنا ولا منها فأخذا بالقرب لا بالأكل وكان له بعد المؤاخذة الإلهية ما أعطته خاصية تلك الشجرة لمن أكل من ثمرها من الخلد والملك الذي لا يبلى وكان ذريته فيه لما وقع منه ما وقع ثم أهبط للخلافة وحواء للنسل لأنها محل التكوين فخرجت الذرية بعد أن تاب الله عليه بكله وذريته فيه وأسعد الله الكل فله النعيم في أي دار كان منهم ما كان بعد عقوبة وآلام تقوم بهم دنيا وآخرة فأما الدنيا فالكل لا بد من ألم أدناه استهلال المولود حين ولادته صارخا لما يجده عند المفارقة للرحم وسخانته فيضر به الهواء عند خروجه من الرحم فيحس بالألم فيبكي فإن مات فقد أخذ بحظه من البلاء ثم يعيش فلا بد له في الحياة الدنيا من الآلام فإن الحيوان مجبول على ذلك فإذا نقل إلى البرزخ فلا بد من ألم السؤال فإذا بعث فلا بد له من ألم الخوف على نفسه أو على غيره فإذا دخل الجنة ارتفع ذلك عنه أعني حكم الآلام وصحبه النعيم دائما وإذا دخل النار صحبه الألم ما شاء الله فإذا نفذت مشيئته فيه بما كان من الآلام أعقبه فيها نعيما بالعناية التي أدركته وهو في صلب أبيه آدم لما تاب عليه ليأخذ حظه من الألم واللذة كما أخذ أبوه فله نصيب من توبة أبيه وبقيت أسماء الانتقام في حق من شاء الله من سوى هذا المسمى إنسانا تحكم بحسب حقائقها فإن رحمته ما سبقت غضبه إلا في هذه النشأة الإنسانية وأما ما عداها فمن كون رحمته وسعت كل شي‏ء لا من السبق فللإنسان دون غيره الرحمة الواسعة والرحمة السابقة فتطلبه الرحمة من وجهين وليس لغير الإنسان هذا الحكم من الرحمة فهي أشد عناية بالإنسان منها بغيره ثم نرجع إلى ما كنا بصدده من معرفة الخواطر فنقول وبعد أن أعلمتك بحقائقها فتختلف آثارها في النفس باختلاف من يتعرض لها في طريقها فإن لم يتعرض لها أحد ممن ذكرنا فذلك خاطر العلم لا يكون خاطر عمل البتة وهو الخاطر الرباني وخواطر الأعمال والتروك تكون ملكية وشيطانية ونفسية لا غير ذلك وكُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً فأحرى قديما فألهمها فجورها عملا أو تركا لمجيئه على يد شيطان وتقواها عملا أو تركا لمجيئه على يد ملك فمن راقب خواطره من طرقها فقد أفلح فإنه يعلم من يأخذها ومن يتعرض إليها من القاعدين لها كل مرصد ومن غفل عن طرقها وما شعر بها حتى وجدها في المحل كما تجدها العامة عمل بمقتضاها وهو عمل الجاهل بالشي‏ء فإن كان خيرا فبحكم المصادفة وإن كان شرا فكذلك لأن الخاطر الأول الذي أتاه بالعلم بمن يأتي بعده من الخواطر وعلى يد من يأتيه لم يشعر به ولا علمه ولا شاهده ففاته حكمه فلما فجئته هذه الخواطر العملية على حين غفلة وعدم تيقظ ومراقبة لطرقها عمل بمقتضاها فكان خيره وشره مصادفة ورأيت ابن الحجازي المحتسب بمدينة فاس ولم يكن صاحب علم بالشريعة يوفقه الله لإصابة الحكم وأعرف من صلاحه أنه ما فاتته تكبيرة الإحرام خلف الإمام في الصلوات كلها بجامع القرويين إلى أن مات فكانت أحكامه في حسبته تجري على السداد إلها ما من الله فكان يقول إني لأعجب من أمري ما اشتغلت بعلم أحكام الشريعة وأو أفق حكم الشرع في جميع أحكامي ولم يقدر أحد من علماء الشريعة يأخذ عليه في حكم لم يقل به مجتهد هذا وحده رأيته من عامة الناس معتنى به ولم يكن من أهل الطريق بل كان حريصا\n\n\nعلى الدنيا مكبا عليها كسائر عامة الناس لكن كان منور الباطن ولا يشعر بذلك والخواطر كلها خطابات إلهية ما هي تجليات ولهذا ينشئها الله صورا تحدث في العماء الذي هو النفس الإلهي فمن شهدها ولا يرزقه الله علما بما ذكرناه يتخيل أن الخواطر تجل إلهي لما يرى من الصورة وهذا هو السبب في تسميتها خواطر وإنها لا تثبت كما لا تثبت صورة الحرف في الوجود بعد نطق اللسان به فما له سوى زمان النطق به ثم‏\nينعدم ويبقى في فهم السامع مثال صورته فيتخيل إن الخاطر باق كما تخيل ذو النون في قوله أَ لَسْتُ بِرَبِّكُمْ فقال كأنه الآن في أذني فما ذلك هو الكلام الذي سمع وإنما ذلك الباقي مما أخذ الفهم من صورة الكلام فثبت في النفس والقليل من أهل الله من يفرق بين الصورتين ولما كانت الخواطر من الخطاب الإلهي لذلك دعا من دعا من أهل الله الخلق إِلَى الله عَلى‏ بَصِيرَةٍ فإن الدعاء على بصيرة لا يكون إلا بالتعريف الإلهي والتعريف الإلهي لا يكون إلا كلاما لا غير ذلك ليرتفع الإشكال ولو كان التكوين عن غير كلمة كن لم يكن له ذلك الإسراع في قوله فيكون بفاء التعقيب وهي جواب الأمر لأن الذي يكون كان على بصيرة لأنه خطاب فلو كان غير خطاب لم يكن له هذا الحكم ولكن أين النفوس المراقبة العالمة المحسة التي تعرف الأمر على ما هو عليه وغاية الناظر في هذا الأمر أن يجعل ما هو خطاب حق في النفس إن ذلك المعبر عنه بالعلم الضروري خلقه الله في محل هذا الشخص لا غير وصاحب الكشف الصحيح يدري أن الله ما خلق له العلم الضروري بالأمر إلا بعد إسماعه إياه كلامه فيعلم عند ذلك ما أراد الحق بذلك الخطاب فذلك العلم هو العلم الضروري ولكن ما يشعر به إلا أهل الشعور من أصحاب الأسرار الإلهية من أهل الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 264: Concerning the Knowledge of the Khawāṭir, and the Khawāṭir are what descend upon the Heart\n\nAnd the essence [الضمير] of the address [الخطاب] without permanence [إقامة]. It is among the spiritual influxes [الواردات] in which you have no active role. If it becomes permanent, then it is self-talk [حديث نفس], not passing thoughts [خواطر].\n\n> If our influx is a passing thought [خاطر],\n> It passes by us and then does not return.\n> Then there is nothing in Existence [الوجود] but a passing thought,\n> And there is no repelling it nor pushing it away.\n\n> Our entities [أعياننا] are renewed whenever\n> Our accidents [أعراضنا] are renewed, so listen!\n\n> For there is no entity [عين] there save One,\n> And another follows in its trace.\n\n### [The Khawāṭir have no permanence in the servant's heart except during the time of their passing over it]\n\nKnow that Allah has ambassadors [سفراء] to the heart of His servant, called the passing thoughts [الخواطر]. They have no permanence in the servant's heart except during the time of their passing over it. They deliver the message with which they were sent without staying, because Allah created them in the form of the message they carry. Thus, the essence [عين] of every passing thought is the essence of its message. When the eye of the heart perceives it, it understands it, and then either acts upon the requirement of what it brought or does not act.\n\nAllah established five paths between Himself and this heart, along which these passing thoughts travel to the heart. Allah originated these paths when He originated the Divine Laws [الشرائع]; were it not for the Divine Laws, He would not have originated them. He made them like the halo surrounding the moon. He named the first path Obligation [وجوبا] and Duty [فرضا], the second Recommendation [ندبا], the third Prohibition [حظرا], the fourth Disapproval [كراهة], and the fifth Permissibility [إباحة].\n\nHe created the Angel [الملك] entrusted with the heart to guard it by Allah's command concerning this. He designated for the Angel the paths of Obligation [الوجوب] and Recommendation [الندب]. Opposite the Angel, He placed a devil [شيطانا] seated beside him—not by a divinely sanctioned command—out of envy, because the devil saw Allah's special care for this human constitution [النشأة الإنسانية] over himself, and its superiority, and knew the happiness [السعادة] it would lead to if the human fulfilled the rights of what was legislated for him in terms of action and omission. He established the same arrangement for the paths of Prohibition [الحظر] and Disapproval [الكراهة]. However, on the path of Permissibility [الإباحة], He placed a devil but did not place an opposing angel. He made all the powers and nature [جبلتها] of the Soul [النفس] dedicated to that path, and Allah commanded the Soul to guard its essence from the devil on that path.\n\nAllah placed within this human Soul [النفس الإنسانية] the quality of Acceptance [القبول], by which it accepts anyone who approaches it. Before the establishment of the Divine Laws [الشرائع], from Adam until our time and until the end of the world, there was none of what we mentioned—no guarding angel nor opposing, contradicting devil. Rather, the matter was as it will revert to when the Divine Laws are lifted: communication from Allah to His servant and from the servant to Allah, without restriction [تحجير] or judgment [حكم] from these legal categories. Instead, the servant acts according to what his will [إرادته] and desire [مشيئته] grant him.\n\nThen Allah created for this human Soul the quality of Vigilance [المراقبة] regarding whoever approaches it from these paths. He revealed to it, through inspiration [إلهاما], that there are ambassadors [سفراء] between Him and the Soul who come to it via these paths, and they do not remain with it. \"We have originated their essences [ذواتهم] from the form of their message, so that when you see them, you will know through witnessing [المشاهدة] what Allah has sent them to you with. So be vigilant [تيقظ] and do not be heedless [تغفل] of them, for they pass through your domain and do not stay.\"\n\nAnd The Real [الحق] says: \"I said to these ambassadors: 'I have created two qualities in this recipient: one quality I named Heedlessness [الغفلة], and a quality I named Vigilance and Awareness [اليقظة والانتباه]. If you find him characterized by Vigilance, then that is the intended purpose. If you find him characterized by Heedlessness, then knock upon his door, for he will become vigilant. If he does not become vigilant, you will not miss him, for I have given him sharp sight [بصرا حديدا] by which he perceives your form and knows what I have sent you with, even if he does not become vigilant due to your knocking. So leave him and return to Us.'\"\n\nAllah has granted this guarding Angel, the constant Companion (the devil), and the Soul the power of conceptualization [التصور] and formation [التشكل] of what they see. They form likenesses of the passing thoughts, so that it seems as if it is the original, but it is not. He placed these likenesses in the Second Level [المرتبة الثانية] and subsequent levels, but they have no footing in the First Level [المرتبة الأولى]. The First Level possesses truthfulness and never errs. Thus, the Soul does not act upon the requirement of that first passing thought and err or lie, ever. As for those (thoughts) that are in the form of the first passing thoughts, they may be truthful or err, depending on the strength of the conceptualization and the preservation of the parts of the form.\n\nLikewise, the first glance, the first movement, and the first hearing—every 'first' is truthful to Him. If it errs, it is not the 'first'; rather, that is the judgment of the form found in the Second Level. The greatest vigilance over these 'first' matters is found only among the people of spiritual discipline [أهل الزجر]—we have witnessed it in them—and especially among the People of Allah [أهل الله]. For the People of Allah, it is an infallible and protective degree [رتبة عاصمة] against error and falsehood. For the spiritually disciplined, it is a power of vigilance, knowledge, and witnessing [شهود]. The name of this first passing thought [الخاطر الأول] among them is the Impulse [الهاجس], the Knocking of the Thought [نقر الخاطر], and the First Cause [السبب الأول].\n\nWhen these noble, righteous ambassadors pass along the designated paths to the heart, they encounter the Angel, the Devil, and the Soul who are present there. Whoever rushes to receive the thought first takes it. If the Angel takes it—and it is something that necessitates a felicitous action [عمل سعادي]—the Angel inspires the heart secretly, saying: \"Do such-and-such.\" The Devil then says to him: \"Do not do it, postpone it until such-and-such a time,\" hoping that the action leading to his happiness will not occur. This is the hesitation [التردد] a person finds in doing good or abandoning it, and in doing evil or abandoning it. Likewise, if the thought comes via the path of Permissibility [الإباحة], that hesitation in doing or abandoning the permissible act is only between the Soul [النفس] and the Devil, not between the Angel and the Devil. This is because the Angel's suggestion (*lammah*) and the opposing Devil's suggestion only occur on the four paths of the legal categories.\n\nAs for the Permissible [المباح], it is exclusively the Devil's suggestion, and he has no contender there except the Soul. The Permissible was assigned to the Soul, rather than others, because the Soul is naturally inclined to seek benefits and repel harms. In the suggestions of the Angel and the Devil, the command [الأمر] always precedes the prohibition [النهي]. The originator of the command for evil is the Devil, so he has precedence. The originator of the command for good is the Angel, so he has precedence. Thus, no prohibition is received except after a command, and the reverse is not true in this Divine Presence [الحضرة].\n\nIts origin in humanity comes from Adam, peace be upon him. The command preceded the prohibition: he was commanded to dwell in Paradise and eat from it wherever he wished. Then He forbade him from approaching a specific tree. The restriction and prohibition occurred in the phrase \"wherever you wish\" [حَيْثُ شِئْتُما], not in the eating itself. Eating was not restricted; rather, the restriction was on approaching the tree, which had been permitted by \"wherever you wish.\" They did not eat from it until they approached it, were tempted by it, and then ate from it. Thus, they were taken to task for the approach, not the eating. After the Divine accountability, he received what the property of that tree grants to those who eat its fruit: immortality [الخلد] and an everlasting dominion [الملك الذي لا يبلى]. His progeny were included in this when what happened, happened. Then he was sent down for vicegerency [الخلافة], and Eve for procreation, as she is the locus of formation [محل التكوين]. The progeny emerged after Allah accepted his repentance, including all of him and his descendants. Allah made all of them happy, so they shall have bliss [النعيم] in whatever abode they are, after the punishment and pains that afflict them in this world and the Hereafter.\n\nAs for this world, everyone must experience pain. The least of this is the newborn's cry upon birth, screaming due to what it feels upon leaving the womb and its warmth. The air harms it upon exiting the womb, so it feels pain and cries. If it dies, it has taken its share of affliction. If it lives, it must experience pains in the worldly life, for the animal is naturally disposed to this. When transferred to the Isthmus [البرزخ], it must experience the pain of the questioning. When resurrected, it must experience the pain of fear for itself or for others. When it enters Paradise, the judgment of pains is lifted from it, and bliss [النعيم] accompanies it eternally. If it enters the Fire, pain accompanies it as long as Allah wills. When His will concerning the pains is fulfilled, He will grant him bliss therein, due to the Divine solicitude [العناية] that reached him while he was in the loins of his father Adam when He accepted his repentance, so that he might take his share of pain and pleasure, just as his father did.\n\nThus, he has a share in his father's repentance. The Names of Vengeance [أسماء الانتقام] remain in effect for whomever Allah wills among those other than this being called 'human,' ruling according to their realities. For His Mercy [رحمته] did not precede His Wrath [غضبه] except in this human constitution [النشأة الإنسانية]. As for everything else, His Mercy encompasses all things, but not by precedence. Therefore, humanity alone possesses the encompassing Mercy and the preceding Mercy. Mercy seeks him from two aspects, and no other being shares this judgment of Mercy. Thus, Allah's solicitude for humanity is greater than for others.\n\nWe now return to our subject concerning the knowledge of the passing thoughts [الخواطر]. Having informed you of their realities, we say that their effects upon the Soul [النفس] vary according to who intercepts them on their path. If none of those we mentioned intercepts them, then that is the thought of Knowledge [خاطر العلم], which is never a thought of action; this is the Lordly Thought [الخاطر الرباني]. The thoughts concerning actions and omissions are either angelic, satanic, or psychic [نفسية]—nothing else. <<وَكُلٌّ مِّنْ عِندِ اللَّهِ فَمَا لِهَٰؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا>> (And all is from Allah. What is wrong with these people that they hardly understand any statement?) [Q 4:78]—let alone an ancient one.\n\nSo He inspired the Soul with its wickedness [فجورها] (action or omission) because it came through the hand of a devil, and its piety [تقواها] (action or omission) because it came through the hand of an Angel. Whoever vigilantly observes his passing thoughts [خواطره] from their paths has succeeded, for he knows who intercepts them and who among those lying in wait at every ambush exposes himself to them. But whoever is heedless of their paths and does not perceive them until he finds them in the heart, just as the common people find them, acts upon their requirement. This is the action of one ignorant of the matter. If it is good, it is by coincidence; and if it is evil, it is likewise. This is because the first passing thought [الخاطر الأول] that brought him knowledge of who would come after it among the passing thoughts, and by whose hand it would come, he neither perceived, knew, nor witnessed it. Thus, its judgment escaped him. When these practical passing thoughts suddenly came upon him in a state of heedlessness, lack of vigilance, and lack of observation of their paths, he acted upon their requirement, so his good and evil were merely coincidental.\n\nI saw Ibn al-Hijazi, the market inspector [المحتسب] in the city of Fez. He was not a man of knowledge of the Divine Law [الشريعة], yet Allah granted him success in rendering correct judgments. I know of his righteousness that he never missed the opening *Takbīr* [تكبيرة الإحرام] behind the Imam in all the prayers at the Qarawiyyin Mosque until he died. His judgments in his inspectorate were always sound, a divine inspiration [إلها ما من الله]. He used to say: \"I am astonished by my situation. I have not occupied myself with the knowledge of the rulings of the Divine Law, yet I conform to the ruling of the Law in all my judgments, and none of the scholars of the Law could fault him for a ruling that was not held by a recognized jurist [مجتهد].\" This is the only person I have seen among the common people who was given such care. He was not one of the People of the Path [أهل الطريق]; rather, he was eager for the world and devoted to it, like the rest of the common people, but his inner being [الباطن] was illuminated, though he was unaware of it.\n\nAll passing thoughts [الخواطر] are Divine addresses [خطابات إلهية]; they are not Theophanies [تجليات]. This is why Allah originates them as forms that occur in the Cloud [العماء], which is the Divine Soul [النفس الإلهي]. Whoever witnesses them, but is not granted knowledge of what we have mentioned by Allah, imagines that the passing thoughts are a Divine Theophany [تجل إلهي] because of the form he sees. This is the reason they are called *Khawāṭir* (passing thoughts): they do not remain, just as the form of a letter does not remain in existence after the tongue pronounces it. It exists only for the duration of its utterance, then it vanishes, and only the likeness of its form remains in the listener's understanding. Thus, one imagines that the passing thought remains, just as Dhū al-Nūn imagined when recalling the verse <<أَلَسْتُ بِرَبِّكُمْ>> (Am I not your Lord?) [Q 7:172], saying: \"It is as if it is still in my ear.\" That is not the actual speech that was heard; rather, what remains is what the understanding grasped from the form of the speech, which became fixed in the Soul. Few among the People of Allah [أهل الله] distinguish between the two forms.\n\nSince the passing thoughts [الخواطر] are part of the Divine Address [الخطاب الإلهي], those among the People of Allah who call creation <<إِلَى اللَّهِ عَلَىٰ بَصِيرَةٍ>> (unto Allah upon clear insight) [Q 12:108] do so. Calling upon clear insight [بصيرة] occurs only through Divine definition [التعريف الإلهي], and Divine definition is only through speech [كلام] and nothing else, so that ambiguity may be removed. If creation [التكوين] were not through the word *Kun* (Be!), it would not have that swiftness in His saying, \"and it is\" (*fayakūn*), with the *fā’* of immediate sequence, which is the answer to the command. This is because what comes into being does so upon clear insight, since it is an address [خطاب]. If it were not an address, it would not have this ruling. But where are the vigilant, knowing, sensitive Souls [النفوس المراقبة] that recognize the matter as it truly is? The utmost achievement of the one who contemplates this matter is to assume that what is the address of The Real [خطاب حق] in the Soul—that which is expressed as necessary knowledge [العلم الضروري]—is created by Allah in the locus of that person and nowhere else. However, the possessor of sound Unveiling [الكشف الصحيح] knows that Allah only creates necessary knowledge of the command for him after making him hear His speech. He then knows what The Real intended by that address. That knowledge is the necessary knowledge, but only the People of Perception [أهل الشعور] among the possessors of the Divine Secrets [الأسرار الإلهية] from the People of Allah are aware of it. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way) [Q 33:4].",
    "ur": "باب نمبر دو سو چونسٹھ: خواطر کی معرفت میں، اور خواطر وہ ہیں جو قلب پر وارد ہوتے ہیں۔\n\nاور یہ خطاب (الخطاب) کا ضمیر ہے جو بغیر ٹھہراؤ کے ہوتا ہے، اور یہ ان واردات (الواردات) میں سے ہے جن میں آپ کا کوئی عمل دخل نہیں ہوتا۔ پس اگر وہ ٹھہر جائیں تو وہ حدیث نفس (حديث نفس) ہیں، خواطر (الخواطر) نہیں۔\n\n> اگر ہمارا وارد ہونے والا خاطر ہو *** جو ہم سے گزر جائے اور پھر واپس نہ آئے\n> تو ہستی (الوجود) میں خاطر کے سوا کچھ نہیں *** اور نہ اس میں کوئی رد ہے اور نہ کوئی دفاع\n\n> ہماری اعیان (ذاتیں) ہر بار نئی ہوتی ہیں *** جب ہمارے اعراض (صفات) نئے ہوتے ہیں، پس سنو!\n\n> وہاں ایک کے سوا کوئی عین (ذات) نہیں *** اور دوسرا اس کے نقش قدم پر چلتا ہے۔\n\n### [خواطر (الخواطر) کو بندے کے قلب میں ٹھہراؤ نہیں ہوتا مگر صرف ان کے گزرنے کے وقت تک]\n\nجان لو کہ اللہ تعالیٰ کے اپنے بندے کے قلب کی طرف سفیر ہیں جنہیں خواطر (الخواطر) کہا جاتا ہے۔ انہیں بندے کے قلب میں ٹھہراؤ نہیں ہوتا مگر صرف ان کے گزرنے کے وقت تک۔ پس وہ بغیر ٹھہراؤ کے وہ پیغام پہنچا دیتے ہیں جس کے ساتھ انہیں بھیجا گیا ہے، کیونکہ اللہ نے انہیں اس پیغام کی صورت پر پیدا کیا ہے جس کے ساتھ وہ بھیجے گئے ہیں۔ پس ہر خاطر (خاطر) کی عین (ذات) اس کی رسالت (رسالة) کی عین ہے۔ جب قلب کی نظر اس پر پڑتی ہے تو وہ اسے سمجھ لیتا ہے، پھر یا تو وہ اس کے تقاضے پر عمل کرتا ہے جو اس کے پاس آیا ہے یا عمل نہیں کرتا۔\n\nاور اللہ تعالیٰ نے اپنے اور اس قلب کے درمیان پانچ راستے بنائے جن پر یہ خواطر (الخواطر) قلب کی طرف چلتے ہیں۔ اور یہ راستے اللہ نے اس وقت بنائے جب اس نے شرعی احکام (الشرائع) کو پیدا کیا، اگر شرعی احکام نہ ہوتے تو وہ انہیں پیدا نہ کرتا۔ اور انہیں چاند کے گرد ہالے کی طرح بنا دیا جو اسے گھیرے ہوئے ہے۔ پس ایک راستے کو وجوب (وجوب) اور فرض (فرض) کا نام دیا، اور دوسرے کو ندب (ندب)، اور تیسرے کو حظر (حظر)، اور چوتھے کو کراہت (كراهة)، اور پانچویں کو اباحت (إباحة) کا نام دیا۔\n\nاور اللہ نے قلب پر مقرر فرشتہ (الملك الموكل بالقلب) کو پیدا کیا جو اللہ کے حکم سے اس کی حفاظت کرتا ہے، اور اس کے لیے وجوب (الوجوب) اور ندب (الندب) کے راستے مقرر کیے۔ اور اس کے مقابلے میں ایک شیطان (شيطان) کو بٹھا دیا جو اس کے پہلو میں ہے، یہ اللہ کے مشروع حکم سے نہیں بلکہ اس حسد کی وجہ سے ہے جو اس نے اس انسانی نشأت پر اللہ کی توجہ اور اس پر فضیلت کو دیکھ کر محسوس کیا، اور اس نے جان لیا کہ اگر یہ انسان اس فعل اور ترک کے حق کو پورا کرے گا جو اس کے لیے مشروع کیا گیا ہے تو یہ سعادت کی طرف لے جائے گا۔ اور اسی طرح حظر (الحظر) اور کراہت (الكراهة) کے راستے پر بھی اسی طرح کا معاملہ رکھا۔ اور اباحت (الإباحة) کے راستے پر ایک شیطان مقرر کیا، لیکن اس کے مقابلے میں کوئی فرشتہ مقرر نہیں کیا۔ اور نفس (النفس) کی تمام قوتوں اور اس کی جبلت کو اس راستے کے لیے وقف کر دیا، اور اللہ نے اسے حکم دیا کہ وہ اس راستے پر شیطان سے اپنی ذات کی حفاظت کرے۔\n\nاور اللہ نے اس نفس انسانی (النفس الإنسانية) میں قبولیت (صفة القبول) کی صفت رکھی ہے جس کے ذریعے وہ ہر اس شخص کی طرف متوجہ ہوتا ہے جو اس کی طرف متوجہ ہو۔ اور شرعی احکام کے پیدا ہونے سے پہلے، آدم علیہ السلام سے لے کر ہمارے زمانے تک اور دنیا کے ختم ہونے تک، وہاں وہ چیزیں نہیں تھیں جن کا ہم نے ذکر کیا، جیسے محافظ فرشتہ اور جھگڑنے والا مخالف شیطان، بلکہ معاملہ ویسا ہی تھا جیسا کہ شرعی احکام کے اٹھ جانے پر ہو جائے گا: اللہ کی طرف سے بندے کی طرف اور بندے کی طرف سے اللہ کی طرف، بغیر کسی رکاوٹ (تحجير) یا ان احکام میں سے کسی حکم کے۔ بلکہ وہ اپنی ارادے اور مشیئت کے مطابق تصرف کرتا ہے۔\n\nپھر اللہ نے اس نفس انسانی کے لیے ان راستوں سے آنے والے کی نگرانی (صفة المراقبة) کی صفت پیدا کی، اور الہام کے ذریعے اس کی طرف وحی کی کہ اس کے اور اس کے درمیان سفیر ہیں جو ان راستوں سے اس کے پاس آتے ہیں اور ان کے پاس ٹھہراؤ نہیں ہوتا۔ اور ہم نے ان کی ذاتوں کو ان کے پیغام کی صورت سے پیدا کیا ہے، یہاں تک کہ جب تم انہیں دیکھو تو مشاہدے سے جان لو کہ اللہ نے انہیں تمہاری طرف کس چیز کے ساتھ بھیجا ہے۔ پس بیدار رہو اور ان سے غافل نہ ہو، کیونکہ وہ تمہارے میدان سے گزر جاتے ہیں اور ٹھہرتے نہیں۔ اور ذات حق (الحق) فرماتے ہیں: میں نے ان سفیروں سے کہا کہ میں نے اس مرسل الیہ (جس کی طرف بھیجا گیا) میں دو صفات پیدا کی ہیں: ایک صفت جسے میں نے غفلت (الغفلة) کا نام دیا ہے، اور ایک صفت جسے میں نے بیداری اور انتباہ (اليقظة والانتباه) کا نام دیا ہے۔ اگر تم اسے بیداری سے متصف پاؤ تو یہی مقصود ہے، اور اگر تم اسے غفلت سے متصف پاؤ تو اس کا دروازہ کھٹکھٹاؤ، کیونکہ وہ بیدار ہو جائے گا۔ اور اگر وہ بیدار نہ ہو تو تم اسے کھو نہیں سکتے، کیونکہ میں نے اسے تیز نظر (بصرا حديدا) دی ہے جس سے وہ تمہاری صورت کو پہچان لے گا اور جان لے گا کہ میں نے تمہیں کس چیز کے ساتھ بھیجا ہے۔ اور اگر وہ تمہارے دستک دینے پر بیدار نہ ہو تو اسے چھوڑ دو اور ہمارے پاس آ جاؤ۔\n\nاور اللہ نے اس محافظ فرشتہ، اور لازم رہنے والے قرین (شیطان)، اور نفس (النفس) کو یہ طاقت دی ہے کہ وہ جو کچھ دیکھتے ہیں اس کا تصور اور تشکل (التصور والتشكل) کر سکیں، پس وہ اس کی مثالیں بناتے ہیں، گویا کہ وہ وہی ہے حالانکہ وہ نہیں ہے۔ اور اس نے ان مثالوں کو دوسرے مرتبے (المرتبة الثانية) اور اس سے اوپر کے مراتب میں رکھا، انہیں پہلے مرتبے (المرتبة الأولى) میں کوئی جگہ نہیں ہے۔ پس پہلا مرتبہ سچائی (الصدق) کا حامل ہے اور کبھی غلطی نہیں کرتا۔ لہٰذا نفس پہلے خاطر (الخاطر الأول) کے تقاضے پر عمل نہیں کرتا کہ وہ غلطی کرے یا کبھی جھوٹ بولے۔ لیکن وہ جو پہلے خواطر کی صورت پر ہیں، وہ تصویر کی قوت اور صورت کے اجزاء کی حفاظت کے مطابق سچ بھی ہو سکتے ہیں اور غلطی بھی کر سکتے ہیں۔\n\nاور اسی طرح پہلی نظر (النظرة الأولى)، اور پہلی حرکت (الحركة الأولى)، اور پہلا سماع (السماع الأول)۔ اور ہر اول (پہلا) اس کی طرف سچا ہوتا ہے۔ پس اگر وہ غلطی کرے تو وہ اول نہیں ہے، بلکہ یہ اس صورت کا حکم ہے جو دوسرے مرتبے میں پائی گئی۔ اور امورِ اول (پہلے معاملات) کی نگرانی زیادہ تر صرف اہل زجر (اہل الزجر) میں ہوتی ہے، اور ہم نے اسے ان میں اور خاص طور پر اہل اللہ (اہل الله) میں دیکھا ہے۔ پس اہل اللہ میں یہ ایک معصوم اور خطاء و کذب سے محفوظ رکھنے والا درجہ ہے۔ اور زاجر (روکنے والے) میں یہ نگرانی، علم اور شہود (شہود) کی قوت ہے۔ اور اس پہلے خاطر (الخاطر الأول) کا نام ان کے نزدیک ہاجس (الهاجس) اور خاطر کا دستک دینا اور سبب اول (السبب الأول) ہے۔\n\nپس ان نیک اور معزز سفیروں میں سے جو بھی ان مقررہ راستوں سے اس قلب پر گزرتا ہے، تو اس پر مقرر فرشتہ، شیطان، اور نفس اسے القاء کرتے ہیں۔ پس ان میں سے جو بھی اسے لینے میں پہل کرتا ہے، وہ اسے لے لیتا ہے۔ اگر فرشتے نے اسے لیا، اور وہ ایسا ہے جو سعادت بخش عمل کے وجود کا تقاضا کرتا ہے، تو فرشتہ اس کے دل میں القاء (أوحى) کرتا ہے کہ ایسا ایسا کرو۔ تو شیطان اس سے کہتا ہے کہ اسے نہ کرو اور اسے فلاں وقت تک مؤخر کر دو، اس لالچ میں کہ اس سے وہ عمل سرزد نہ ہو جو اس کی سعادت کا باعث بنے۔ اور یہی وہ تردد ہے جو انسان نیکی کے فعل اور ترک میں، اور برائی کے فعل اور ترک میں پاتا ہے۔ اور اسی طرح جب وہ اباحت (الإباحة) کے راستے پر آتا ہے، تو مباح فعل کے کرنے اور چھوڑنے میں یہ تردد صرف نفس (النفس) اور شیطان (الشيطان) کے درمیان ہوتا ہے، نہ کہ فرشتہ اور شیطان کے درمیان۔ کیونکہ فرشتہ کا القاء (لمة الملك) اور اس کے مقابلے میں شیطان کا القاء (لمة الشيطان) صرف احکام کے چار راستوں میں ہوتا ہے۔\n\nلیکن مباح (المباح) میں صرف شیطان کا القاء ہوتا ہے، اور اس کا کوئی جھگڑنے والا نہیں سوائے نفس کے۔ اور نفس کے لیے مباح کا راستہ اس لیے ہے کہ وہ منافع حاصل کرنے اور نقصانات کو دور کرنے پر جبلت میں پیدا کیا گیا ہے۔ اور فرشتہ اور شیطان کے القاء میں ہمیشہ امر (حکم) نہی (ممانعت) سے پہلے آتا ہے۔ پس شر میں امر کا مالک شیطان ہے، لہٰذا اسے تقدم حاصل ہے۔ اور خیر میں امر کا مالک فرشتہ ہے، لہٰذا اسے تقدم حاصل ہے۔ اس طرح کی حضوری میں نہی امر کے بعد ہی وارد ہوتی ہے، اس کا الٹ نہیں ہوتا۔ اور اس کی اصل انسان میں آدم علیہ السلام سے ہے، کیونکہ امر (حکم) نے جنت میں رہنے اور جہاں چاہو کھانے کے ساتھ تقدم حاصل کیا، پھر اسے ایک مخصوص درخت کے قریب جانے سے منع کیا کہ اس کے قریب نہ جانا۔ پس رکاوٹ اور نہی اس کے اس قول میں واقع ہوئی: حَيْثُ شِئْتُما (جہاں تم دونوں چاہو) کھانے میں نہیں، کیونکہ اس پر کھانے کی کوئی رکاوٹ نہیں تھی، بلکہ اس کے قریب جانے پر رکاوٹ تھی جسے اس نے \"جہاں تم دونوں چاہو\" میں مطلق کر دیا تھا۔ پس انہوں نے اس وقت تک نہیں کھایا جب تک وہ قریب نہیں گئے، اور انہیں قربت کی وجہ سے پکڑا گیا نہ کہ کھانے کی وجہ سے۔ اور الٰہی مؤاخذے کے بعد اسے وہ چیز ملی جو اس درخت کی خاصیت تھی جس نے اس کا پھل کھایا تھا، یعنی ہمیشگی (الخلد) اور ایسی بادشاہت جو کبھی پرانی نہ ہو۔ اور اس کی ذریت اس میں تھی جب اس سے وہ واقعہ پیش آیا جو پیش آیا۔ پھر اسے خلافت کے لیے اتارا گیا اور حوا کو نسل کے لیے، کیونکہ وہ تخلیق کا مقام ہے۔ پس ذریت اس کے بعد نکلی جب اللہ نے اس کی توبہ قبول کر لی، اور اس کی ذریت اس میں تھی۔ اور اللہ نے سب کو سعادت مند بنایا، پس اسے ہر اس گھر میں نعمت حاصل ہے جس میں وہ تھا، اس کے بعد جو کچھ ہوا وہ دنیا اور آخرت میں ان پر قائم ہونے والی سزا اور تکلیفوں کے بعد ہے۔ جہاں تک دنیا کا تعلق ہے، تو سب کو تکلیف کا سامنا کرنا پڑتا ہے، جس کی کم از کم تکلیف بچے کا پیدائش کے وقت چیخنا ہے، جب وہ رحم اور اس کی گرمی سے جدائی محسوس کرتا ہے، تو رحم سے باہر نکلتے وقت ہوا اسے نقصان پہنچاتی ہے، وہ درد محسوس کرتا ہے اور روتا ہے۔ اگر وہ مر جائے تو اس نے بلاء میں اپنا حصہ لے لیا۔ پھر وہ جیتا ہے تو اسے دنیاوی زندگی میں تکلیفیں ضرور پہنچتی ہیں، کیونکہ حیوان اس پر جبلت میں پیدا کیا گیا ہے۔ جب اسے برزخ میں منتقل کیا جاتا ہے تو سوال کی تکلیف ضرور ہوتی ہے۔ جب وہ اٹھایا جاتا ہے تو اسے اپنی ذات یا دوسروں کے خوف کی تکلیف ضرور ہوتی ہے۔ جب وہ جنت میں داخل ہوتا ہے تو اس سے یہ چیزیں اٹھا لی جاتی ہیں، یعنی تکلیفوں کا حکم، اور نعمت ہمیشہ اس کے ساتھ رہتی ہے۔ اور جب وہ جہنم میں داخل ہوتا ہے تو جب تک اللہ چاہے درد اس کے ساتھ رہتا ہے، پھر جب اس کی مشیئت تکلیفوں کے ساتھ پوری ہو جاتی ہے، تو اللہ اس میں اسے نعمت عطا فرماتا ہے، اس عنایت کی وجہ سے جو اسے اس وقت حاصل ہوئی جب وہ اپنے باپ آدم کی صلب میں تھا، جب اللہ نے اس کی توبہ قبول کی، تاکہ وہ بھی اپنے باپ کی طرح درد اور لذت کا حصہ لے۔ پس اسے اپنے باپ کی توبہ کا حصہ ملا۔ اور انتقام کے نام ان لوگوں کے حق میں باقی رہے جنہیں اللہ نے اس مسمیٰ انسان کے علاوہ چاہا، جو اپنی حقائق کے مطابق حکم کرتے ہیں۔ کیونکہ اس کی رحمت اس کے غضب پر صرف اسی انسانی نشأت (النشأة الإنسانية) میں سبقت لے گئی ہے، اور اس کے علاوہ دیگر مخلوقات میں اس لیے نہیں کہ اس کی رحمت ہر چیز پر محیط ہے، بلکہ سبقت کی وجہ سے۔ پس انسان کے لیے دوسروں کے مقابلے میں وسیع رحمت اور سبقت لے جانے والی رحمت ہے۔ پس رحمت اسے دو پہلوؤں سے طلب کرتی ہے، اور یہ حکم رحمت کا غیر انسان کے لیے نہیں ہے۔ پس وہ انسان پر دوسروں کے مقابلے میں زیادہ توجہ دینے والی ہے۔\n\nپھر ہم خواطر (الخواطر) کی معرفت کے موضوع کی طرف لوٹتے ہیں اور کہتے ہیں: اور جب میں نے تمہیں ان کی حقیقتوں سے آگاہ کر دیا ہے، تو ان کے اثرات نفس میں اس شخص کے اختلاف سے مختلف ہوتے ہیں جو ان کے راستے میں ان کا سامنا کرتا ہے۔ اگر ان میں سے کوئی بھی ان کا سامنا نہ کرے جن کا ہم نے ذکر کیا، تو وہ خاطر العلم (خاطر العلم) ہے، جو کبھی بھی خاطر عمل نہیں ہوتا، اور وہ خاطر ربانی (الخاطر الرباني) ہے۔ اور اعمال اور ترک کے خواطر صرف ملکی (ملكية)، شیطانی (شيطانية)، اور نفسی (نفسية) ہوتے ہیں، اس کے علاوہ نہیں۔ وَكُلٌّ مِّنْ عِندِ اللَّهِ فَمَا لِهَٰؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا (اور سب اللہ ہی کی طرف سے ہے، تو ان لوگوں کو کیا ہوا ہے کہ کوئی بات سمجھنے کے قریب بھی نہیں آتے؟) [النساء: ۷۸] پس قدیم کو زیادہ حق ہے، پس اللہ نے اسے اس کا فجور (عمل یا ترک) الہام کیا جو شیطان کے ہاتھ پر آنے کی وجہ سے ہے، اور اس کا تقویٰ (عمل یا ترک) جو فرشتہ کے ہاتھ پر آنے کی وجہ سے ہے۔ پس جس نے اپنے خواطر (الخواطر) کی ان کے راستوں سے نگرانی کی، وہ کامیاب ہو گیا، کیونکہ وہ جانتا ہے کہ کون انہیں لیتا ہے اور کون ان کے لیے ہر گھات میں بیٹھا ہوا ان کا سامنا کرتا ہے۔ اور جو ان کے راستوں سے غافل رہا اور اسے ان کا شعور نہ ہوا یہاں تک کہ اس نے انہیں اس جگہ پایا جیسا کہ عام لوگ انہیں پاتے ہیں، تو وہ اس کے تقاضے پر عمل کرتا ہے، اور یہ کسی چیز سے جاہل شخص کا عمل ہے۔ اگر وہ خیر ہو تو اتفاق (مصادفة) کے حکم سے، اور اگر شر ہو تو بھی اسی طرح، کیونکہ پہلا خاطر (الخاطر الأول) جو اس کے بعد آنے والے خواطر کے بارے میں اور کس کے ہاتھ پر آئیں گے، علم لے کر آیا تھا، اس نے اسے محسوس نہیں کیا، نہ جانا اور نہ دیکھا، پس اس کا حکم اس سے فوت ہو گیا۔ جب یہ عملی خواطر غفلت اور ان کے راستوں کی بیداری اور نگرانی نہ ہونے کی حالت میں اچانک اس پر آئے، تو اس نے ان کے تقاضے پر عمل کیا، پس اس کی نیکی اور بدی اتفاقی تھی۔ اور میں نے فاس شہر میں محتسب ابن الحجازی کو دیکھا، حالانکہ وہ شریعت کے علم کا حامل نہیں تھا، لیکن اللہ اسے حکم کی درستگی کی توفیق دیتا تھا۔ اور میں اس کی نیکی کو جانتا ہوں کہ اس نے جامع قرویین میں اپنی تمام نمازوں میں امام کے پیچھے تکبیر تحریمہ کبھی نہیں چھوڑی یہاں تک کہ وہ فوت ہو گیا۔ پس اس کے احتساب کے احکام اللہ کی طرف سے الہام کے ذریعے درستگی پر جاری ہوتے تھے۔ اور وہ کہتا تھا کہ مجھے اپنے معاملے پر تعجب ہوتا ہے کہ میں نے شریعت کے احکام کا علم حاصل نہیں کیا، پھر بھی میں اپنے تمام احکام میں شرعی حکم کے موافق ہوتا ہوں، اور شریعت کے علماء میں سے کوئی بھی اس پر کسی ایسے حکم میں گرفت نہیں کر سکا جسے کسی مجتہد نے نہ کہا ہو۔ یہ واحد شخص ہے جسے میں نے عام لوگوں میں دیکھا جس پر توجہ دی گئی، حالانکہ وہ اہل طریق (اہل الطريق) میں سے نہیں تھا، بلکہ وہ دنیا کا حریص تھا اور عام لوگوں کی طرح اس پر جھکا ہوا تھا، لیکن اس کا باطن منور تھا اور اسے اس کا شعور نہیں تھا۔\n\nاور تمام خواطر (الخواطر) خطابات الٰہیہ (خطابات إلهية) ہیں، وہ ظہور الٰہی (تجلیات) نہیں ہیں۔ اسی لیے اللہ انہیں صورتوں کی شکل میں پیدا کرتا ہے جو عماء (العماء) میں، جو کہ نفس الٰہی (النفس الإلهي) ہے، پیدا ہوتی ہیں۔ پس جو انہیں دیکھتا ہے اور اللہ اسے اس علم سے نوازتا نہیں جس کا ہم نے ذکر کیا، وہ یہ گمان کرتا ہے کہ خواطر ظہور الٰہی (تجلی إلهي) ہیں، جب وہ صورت کو دیکھتا ہے۔ اور یہی وجہ ہے کہ انہیں خواطر (الخواطر) کہا جاتا ہے، اور یہ اس طرح ثابت نہیں رہتے جس طرح زبان سے بولنے کے بعد حرف کی صورت ہستی (الوجود) میں ثابت نہیں رہتی۔ پس اس کے لیے صرف بولنے کا وقت ہوتا ہے، پھر وہ معدوم ہو جاتا ہے، اور سننے والے کی سمجھ میں اس کی صورت کی مثال باقی رہتی ہے۔ پس وہ خیال کرتا ہے کہ خاطر باقی ہے، جیسا کہ ذوالنون نے اللہ کے اس قول کے بارے میں خیال کیا: أَ لَسْتُ بِرَبِّكُمْ (کیا میں تمہارا رب نہیں ہوں؟) [الأعراف: ۱۷۲] تو اس نے کہا: گویا کہ وہ اب بھی میرے کان میں ہے۔ پس وہ وہ کلام نہیں ہے جو سنا گیا تھا، بلکہ وہ باقی رہنے والی چیز وہ ہے جو فہم نے کلام کی صورت سے لی اور نفس میں ثابت ہو گئی۔ اور اہل اللہ میں سے بہت کم لوگ ہیں جو ان دونوں صورتوں میں فرق کرتے ہیں۔ اور چونکہ خواطر (الخواطر) خطاب الٰہی (الخطاب الإلهي) میں سے ہیں، اس لیے اہل اللہ میں سے جس نے بھی مخلوق کو إِلَى الله عَلى‏ بَصِيرَةٍ (اللہ کی طرف بصیرت کے ساتھ) [یوسف: ۱۰۸] بلایا، تو بصیرت کے ساتھ دعوت صرف تعریف الٰہی (التعريف الإلهي) کے ذریعے ہی ہو سکتی ہے، اور تعریف الٰہی صرف کلام (کلام) ہی ہو سکتا ہے، اس کے علاوہ نہیں۔ تاکہ اشکال دور ہو جائے۔ اور اگر تخلیق \"کُن\" (ہو جا) کے کلمے کے بغیر ہوتی تو اس کے لیے اس قول میں وہ تیزی نہ ہوتی: \"فیکون\" (تو وہ ہو جاتا ہے)، جو کہ تعقیب کی فا (ف) کے ساتھ ہے، اور یہ امر کا جواب ہے۔ کیونکہ جو کچھ ہوتا ہے وہ بصیرت پر ہوتا ہے، کیونکہ یہ خطاب ہے۔ پس اگر یہ خطاب نہ ہوتا تو اس کا یہ حکم نہ ہوتا۔ لیکن وہ نفوس کہاں ہیں جو نگرانی کرنے والے، جاننے والے، محسوس کرنے والے ہیں جو معاملے کو اس کی اصل حالت پر جانتے ہیں؟ اور اس معاملے میں غور کرنے والے کی انتہا یہ ہے کہ وہ اس چیز کو جو نفس میں ذات حق کا خطاب ہے، یہ سمجھے کہ وہ جسے علم ضروری (العلم الضروري) سے تعبیر کیا جاتا ہے، اللہ نے اسے صرف اس شخص کے مقام میں پیدا کیا ہے۔ اور صاحب کشف صحیح (صاحب الكشف الصحيح) جانتا ہے کہ اللہ نے اسے امر کے بارے میں علم ضروری صرف اس کے بعد پیدا کیا جب اسے اپنا کلام سنایا، پس وہ اس وقت جانتا ہے کہ ذات حق (الحق) نے اس خطاب سے کیا ارادہ کیا تھا۔ پس وہ علم، علم ضروری ہے، لیکن اسے صرف اہل اللہ میں سے الٰہی اسرار کے حامل اہل شعور ہی محسوس کرتے ہیں۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے) [الاحزاب: ۴]۔",
    "fa": "باب دویست و شصت و چهارم در معرفت خواطر، و خواطر آن چیزی است که بر قلب وارد می‌شود\n\nو ضمیر (اشاره) از خطاب است بدون اقامت (ثبات)، و آن از وارداتی است که تو در آن نقشی نداری. پس اگر اقامت گزید، آن حدیث نفس (حديث نفس) است، نه خواطر.\n\n> اگر وارد ما خاطری باشد *** که بر ما بگذرد و بازنگردد\n> پس در هستی (الوجود) جز خاطر نیست *** و در آن نه دفعی است و نه منعی\n> ذوات ما تجدید می‌شود هرگاه *** اعراض ما تجدید شود، پس بشنوید\n> پس در آنجا ذاتی جز یکی نیست *** و دیگری در پی او می‌آید\n\n### [خواطر در قلب بنده اقامتی ندارند مگر در زمان عبورشان از آن]\n\nبدان که خداوند سفیرانی به سوی قلب بنده خود دارد که خواطر نامیده می‌شوند. آن‌ها در قلب بنده اقامتی ندارند مگر در زمان عبورشان از آن، پس آنچه را که برای آن فرستاده شده‌اند، بدون اقامت ادا می‌کنند؛ زیرا خداوند آن‌ها را بر صورت رسالتی که با آن فرستاده شده‌اند، خلق کرده است. پس هر خاطر، عین رسالت خویش است. هنگامی که چشم قلب بر آن می‌افتد، آن را درک می‌کند، پس یا به مقتضای آنچه آورده است عمل می‌کند یا عمل نمی‌کند.\n\nو خداوند میان خود و این قلب پنج راه قرار داده است که این خواطر از طریق آن‌ها به قلب می‌روند. این راه‌ها را خداوند هنگامی که شرایع را وضع کرد، ایجاد نمود؛ اگر شرایع نبودند، آن‌ها را ایجاد نمی‌کرد. و آن‌ها را مانند هاله‌ای که ماه را احاطه کرده، قرار داد. پس راه اول را وجوب و فرض نامید، و راه دوم را ندب (مستحب)، و سوم را حظر (حرام)، و چهارم را کراهت، و پنجم را اباحه (مباح). و فرشته موکل بر قلب را آفرید تا به امر خداوند آن را حفظ کند و از میان راه‌ها، راه وجوب و ندب را برای او تعیین کرد. و در مقابل او شیطانی را نشاند که به غیر از امر مشروع الهی، از روی حسد، در کنار او قرار گرفت؛ زیرا دید که خداوند به این نشئه انسانی بیش از او توجه کرده و او را برتر قرار داده است، و می‌دانست که اگر انسان حق آنچه برایش تشریع شده از فعل و ترک را به جا آورد، به سعادت می‌رسد. و همین را به طور مساوی بر راه حظر و کراهت نیز قرار داد. و بر راه اباحه (مباح) شیطانی قرار داد، اما در مقابل آن فرشته‌ای قرار نداد. و تمام قوای نفس و سرشت آن را برای آن راه (اباحه) مستفرغ ساخت. و خداوند به نفس امر کرد که ذات خود را از شیطان در آن راه حفظ کند.\n\nو خداوند در این نفس انسانی صفت قبول (پذیرش) را قرار داد که با آن به هر کس که به سویش روی آورد، روی می‌آورد. و پیش از وضع شرایع، از آدم تا زمان ما و تا پایان دنیا، هیچ یک از آنچه ذکر کردیم، یعنی فرشته حافظ و شیطان منازع و معارض، وجود نداشت؛ بلکه امر همان‌گونه بود که پس از برداشته شدن شرایع به آن باز می‌گردد: از خداوند به بنده و از بنده به خداوند، بدون هیچ محدودیتی و حکمی از این احکام، بلکه بر اساس آنچه اراده و مشیت او اقتضا می‌کند، تصرف می‌نماید.\n\nسپس خداوند برای این نفس انسانی صفت مراقبه (مراقبت) را برای کسی که از این راه‌ها بر او وارد می‌شود، آفرید و به او الهام کرد که میان او و نفس، سفیرانی هستند که از این راه‌ها به سویش می‌آیند و نزد او اقامتی ندارند. و ما ذوات آن‌ها را از صورت رسالتشان ایجاد کرده‌ایم تا وقتی آن‌ها را ببینی، با شهود (الشهود) بدانی که خداوند آن‌ها را برای چه چیزی به سوی تو فرستاده است. پس بیدار باش و از آن‌ها غافل مشو، زیرا آن‌ها از ساحت تو می‌گذرند و ثابت نمی‌مانند. و حق (الحق) می‌گوید: به این سفیران گفتم: من در این فرستاده‌شده دو صفت ایجاد کرده‌ام: صفتی که آن را غفلت نامیدم و صفتی که آن را بیداری و انتباه نامیدم. اگر او را متصف به بیداری یافتید، همان مقصود مطلوب است. و اگر او را متصف به غفلت یافتید، درِ او را بکوبید تا بیدار شود. و اگر بیدار نشد، شما او را از دست نمی‌دهید، زیرا من برای او بصری تیز قرار داده‌ام که با آن صورت شما را درک می‌کند و می‌داند که شما را برای چه فرستاده‌ام. و اگر برای کوبیدن شما بیدار نشد، او را رها کنید و نزد ما بازگردید.\n\nو خداوند به این فرشته موکل بر حفظ، و قرین ملازم (شیطان)، و نفس، قدرت تصور و شکل‌گیری آنچه را می‌بینند، بخشیده است. پس آن‌ها امثال آن را شکل می‌دهند، به گونه‌ای که گویی خود آن است، در حالی که آن نیست. و این امثال را در مرتبه دوم و مراتب بالاتر قرار داد و در مرتبه اول (المرتبة الأولى) جایگاهی ندارند. پس مرتبه اول دارای صدق است و خطا نمی‌کند. بنابراین، نفس به مقتضای آن خاطر اول عمل نمی‌کند که خطا کند و هرگز دروغ نمی‌گوید. اما آنچه بر صورت خواطر اول است، ممکن است صدق کند یا خطا، بسته به قدرت تصویرسازی و حفظ اجزای صورت. و همچنین است نظر اول، حرکت اول، و شنیدن اول. و هر اولی به سوی او صادق است. پس اگر خطا کرد، اول نیست، بلکه آن حکم صورتی است که در مرتبه دوم یافت شده است. و بیشتر مراقبت امور اول جز در اهل زجر (اهل ریاضت) نیست، و ما آن را از ایشان دیده‌ایم، و به ویژه در اهل الله (اهل الله). پس در اهل الله، مرتبه‌ای است که از خطا و دروغ مصون و حافظ است، و در زاجر (ریاضت‌کش) نیروی مراقبه و علم و شهود (الشهود) است. و نام این خاطر اول نزد ایشان، هاجس (الهاجس)، کوبش خاطر، و سبب اول است.\n\nپس آنچه از این سفیران گرامی و نیکوکار بر این راه‌های معین برای قلب می‌گذرد، کسی که بر آن راه است، از فرشته و شیطان و نفس، آن را دریافت می‌کند. پس هر کس از این‌ها که در دریافت آن پیشی گیرد، آن را می‌گیرد. اگر فرشته آن را گرفت، و آن از اموری باشد که مقتضی وجود عمل سعادت‌آور است، فرشته در سرّ او الهام می‌کند که فلان کار را انجام بده. شیطان به او می‌گوید: آن را انجام نده و به وقت دیگری موکول کن، به طمع اینکه عملی که منجر به سعادت او می‌شود، از او سر نزند. و این همان تردیدی است که انسان در انجام دادن یا ترک کردن کار خیر، و انجام دادن یا ترک کردن کار شر می‌یابد. و همچنین اگر خاطر بر راه اباحه (مباح) بیاید، آن تردید در انجام دادن یا ترک کردن مباح، تنها میان نفس و شیطان است، نه میان فرشته و شیطان؛ زیرا لمّه (اشاره) فرشته و لمّه (اشاره) شیطان مقابل، تنها در چهار راه از احکام رخ می‌دهد.\n\nاما در مباح، لمّه (اشاره) مخصوص شیطان است و منازعی جز نفس ندارد. و مباح از میان احکام، تنها از آنِ نفس است، زیرا نفس بر جلب منافع و دفع مضرات سرشته شده است. و در لمّه (اشاره) فرشته و شیطان، امر همیشه بر نهی مقدم است. پس صاحب امر در شر، شیطان است و او تقدم دارد، و صاحب امر در خیر، فرشته است و او تقدم دارد. بنابراین، در این حضرت (حضور)، نهی‌ای وارد نمی‌شود مگر پس از امر، و عکس آن در چنین موردی صادق نیست. و اصل آن در انسان از آدم (علیه السلام) است؛ زیرا امر به سکونت در بهشت و خوردن از آن هر جا که می‌خواست، بر نهی مقدم بود. سپس او را از نزدیک شدن به درختی مشخص نهی کرد. پس محدودیت و نهی در قول خداوند: **حَيْثُ شِئْتُما** (هر جا که خواستید) واقع شد، نه در خوردن. پس خوردن بر او محدود نشد، بلکه نزدیک شدن به آن محدود شد، که در «هر جا که خواستید» مطلق شده بود. پس آن‌ها از آن نخوردند مگر پس از آنکه نزدیک شدند و فریب خوردند، و به سبب نزدیک شدن مؤاخذه شدند، نه به سبب خوردن. و پس از مؤاخذه الهی، آنچه خاصیت آن درخت به خورنده میوه‌اش می‌داد، یعنی جاودانگی و مُلکی که کهنه نمی‌شود، برای او حاصل شد. و ذریه او نیز در آن بودند، هنگامی که آنچه واقع شد، رخ داد. سپس برای خلافت فرود آمد و حوا برای نسل، زیرا او محل تکوین است. پس ذریه خارج شدند، پس از آنکه خداوند توبه او و تمام ذریه‌اش را پذیرفت و همه را سعادتمند ساخت. پس برای او نعمت در هر سرایی که باشد، هست، پس از عقوبت و آلامی که در دنیا و آخرت بر آن‌ها وارد می‌شود. اما در دنیا، همه ناگزیر از درد هستند؛ کمترین آن، فریاد نوزاد هنگام تولد است، به دلیل آنچه هنگام جدایی از رحم و گرمای آن می‌یابد، و هوا هنگام خروج از رحم به او آسیب می‌رساند و احساس درد می‌کند و می‌گرید. اگر بمیرد، بهره خود را از بلا گرفته است. سپس اگر زندگی کند، ناگزیر در زندگی دنیا دچار آلام می‌شود، زیرا حیوان بر این سرشته شده است. و هنگامی که به برزخ منتقل شود، ناگزیر از درد سؤال است. و هنگامی که مبعوث شود، ناگزیر از درد ترس بر خود یا بر دیگری است. هنگامی که وارد بهشت شود، این حکم (یعنی حکم آلام) از او برداشته می‌شود و نعمت همیشه همراه اوست. و هنگامی که وارد آتش شود، درد تا زمانی که خداوند بخواهد، همراه اوست. پس هنگامی که مشیت خداوند در مورد او با آلام به پایان رسید، به دنبال آن در همان‌جا نعمتی به او عطا می‌کند، به واسطه عنایتی که در صلب پدرش آدم به او رسید، هنگامی که خداوند توبه او را پذیرفت، تا بهره خود را از درد و لذت ببرد، همان‌گونه که پدرش برد.\n\nو اسماء انتقام در حق هر کس که خداوند بخواهد، غیر از این موجودی که انسان نامیده می‌شود، باقی می‌ماند و بر اساس حقایق خود حکم می‌کند؛ زیرا رحمت او جز در این نشئه انسانی بر غضبش پیشی نگرفته است. اما در مورد غیر انسان، رحمت او همه چیز را فرا گرفته است، اما نه از باب سبقت. پس انسان، نه غیر او، دارای رحمت واسعه و رحمت سابقه است. پس رحمت او را از دو جهت می‌طلبد، و غیر انسان این حکم رحمت را ندارد. بنابراین، عنایت به انسان شدیدتر از عنایت به غیر اوست. سپس به آنچه در صدد آن بودیم، یعنی معرفت خواطر، باز می‌گردیم و می‌گوییم: پس از آنکه تو را به حقایق آن‌ها آگاه ساختم، آثار آن‌ها در نفس، به اختلاف کسی که در راهشان با آن‌ها مواجه می‌شود، متفاوت است. اگر هیچ یک از کسانی که ذکر کردیم با آن مواجه نشود، آن خاطرِ علم است و هرگز خاطرِ عمل نیست، و آن خاطر ربانی است. و خواطر اعمال و تروک (ترک‌ها) یا مَلَکی (فرشته‌ای) هستند یا شیطانی یا نفسی، و غیر از این نیست. و **كُلٌّ من عِنْدِ الله فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً** (همه از جانب خداست، پس این قوم را چه شده که نزدیک نیست سخنی را بفهمند؟) پس سزاوارتر است که قدیم باشد. پس فجور (فجور) آن را (نفس) در عمل یا ترک، به دلیل آمدنش به دست شیطان، و تقوای (تقوا) آن را در عمل یا ترک، به دلیل آمدنش به دست فرشته، به او الهام کرد.\n\nپس هر کس خواطر خود را از راه‌هایشان مراقبت کند، رستگار شده است، زیرا می‌داند چه کسی آن‌ها را می‌گیرد و چه کسی از کمین‌گاه‌ها در معرض آن‌ها قرار می‌گیرد. و هر کس از راه‌های آن‌ها غافل شود و متوجه آن‌ها نشود تا زمانی که آن‌ها را در محل (قلب) بیابد، همان‌گونه که عوام می‌یابند، به مقتضای آن عمل می‌کند، و این عمل جاهل به شیء است. اگر خیر باشد، به حکم تصادف است، و اگر شر باشد نیز چنین است؛ زیرا خاطر اولی که علم به کسانی که پس از او می‌آیند و به دست چه کسی می‌آیند را برای او آورد، او آن را درک نکرد و به آن علم نیافت و آن را مشاهده نکرد، پس حکم آن از دستش رفت. هنگامی که این خواطر عملی در حال غفلت و عدم بیداری و مراقبت از راه‌هایشان ناگهان به او رسیدند، به مقتضای آن‌ها عمل کرد، پس خیر و شر او تصادفی بود. و من ابن حجازی، محتسب شهر فاس را دیدم که صاحب علم شریعت نبود، اما خداوند او را موفق به درستی حکم می‌کرد. و از صلاح او می‌دانم که تکبیرة الاحرام را پشت سر امام در تمام نمازهای جامع قرویین تا زمان مرگش از دست نداد. پس احکام او در حسبه (اداره امور عمومی) بر درستی جاری بود، که الهامی از جانب خداوند بود. او می‌گفت: «من از کار خود در شگفتم؛ من به علم احکام شریعت مشغول نبوده‌ام، اما در تمام احکامم با حکم شرع موافق بوده‌ام و هیچ یک از علمای شریعت نتوانسته است بر حکمی که مجتهدی نگفته باشد، ایرادی بگیرد.» این تنها کسی از عوام بود که من دیدم مورد عنایت قرار گرفته است. او از اهل طریق (اهل سلوک) نبود، بلکه حریص بر دنیا و روی‌آورنده به آن بود، مانند سایر عوام، اما باطنی نورانی داشت و خود متوجه آن نبود.\n\nو خواطر همگی خطاب‌های الهی هستند، نه تجلیات (التجلی). به همین دلیل، خداوند آن‌ها را به صورت‌هایی ایجاد می‌کند که در عماء (العماء) که همان نفس الهی است، حادث می‌شوند. پس هر کس آن‌ها را مشاهده کند و خداوند به او علم به آنچه ذکر کردیم روزی ندهد، گمان می‌کند که خواطر، تجلی (التجلی) الهی هستند، به دلیل صورتی که می‌بیند. و این همان سبب نامگذاری آن‌ها به خواطر است، و اینکه آن‌ها ثابت نمی‌مانند، همان‌گونه که صورت حرف پس از تلفظ زبان در هستی (الوجود) ثابت نمی‌ماند. پس آن (خاطر) جز زمان تلفظ، وجودی ندارد و سپس معدوم می‌شود و مثال صورت آن در فهم شنونده باقی می‌ماند. پس گمان می‌کند که خاطر باقی است، همان‌گونه که ذوالنون در مورد قول خداوند: **أَ لَسْتُ بِرَبِّكُمْ** (آیا من پروردگار شما نیستم؟) گمان کرد و گفت: «گویی اکنون در گوش من است.» پس آن، کلامی که شنیده شد، نیست، بلکه آن باقی‌مانده، چیزی است که فهم از صورت کلام گرفته و در نفس ثابت شده است. و اندکی از اهل الله (اهل الله) هستند که میان این دو صورت تفاوت می‌گذارند. و چون خواطر از خطاب الهی هستند، از این رو کسانی از اهل الله که دعوت کردند، خلق را **إِلَى الله عَلى‏ بَصِيرَةٍ** (به سوی خدا با بصیرت) دعوت کردند؛ زیرا دعوت با بصیرت جز با تعریف الهی صورت نمی‌گیرد، و تعریف الهی جز کلام نیست و غیر از آن نیست تا اشکال برطرف شود. و اگر تکوین (آفرینش) از غیر کلمه «کُن» (باش) بود، آن سرعت در قول خداوند: **فَيَكُونُ** (پس می‌شود) را نداشت، که با فاء تعقیب (بلافاصله) آمده و جواب امر است؛ زیرا آنچه می‌شود، با بصیرت بوده، چون خطاب است. اگر غیر خطاب بود، این حکم را نداشت. اما کجایند نفوس مراقب، عالم و حس‌کننده که امر را آن‌گونه که هست بشناسند؟ و نهایت کار کسی که در این امر نظر می‌کند این است که آنچه خطاب حق (الحق) در نفس است، آن را که به علم ضروری تعبیر می‌شود، خداوند تنها در محل این شخص خلق کرده است. در حالی که صاحب کشف (الکشف) صحیح می‌داند که خداوند علم ضروری به امر را برای او خلق نکرده است مگر پس از آنکه کلام خود را به او شنوانده باشد. پس در آن هنگام می‌داند که حق (الحق) از آن خطاب چه اراده کرده است. پس آن علم، همان علم ضروری است، اما جز اهل شعور از صاحبان اسرار الهیه (اهل الله) آن را درک نمی‌کنند. و **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و اوست که راه را می‌نماید)."
  },
  "page_count": 4
}