{
  "id": 330,
  "title": {
    "ar": "الباب الثلاثون وثلاثمائة في معرفة منزل القمر من الهلال من البدر من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Thirty: Concerning the Gnosis (معرفة) of the Station (منزل) of the Moon (القمر) in relation to the Crescent (الهلال) and the Full Moon (البدر), derived from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو تیس: حضور محمدی (الحضرة المحمدية) سے چاند کے مقام کی معرفت، ہلال سے بدر تک۔",
    "fa": "باب سیصد و سی‌ام در معرفت منزل قمر از هلال تا بدر از حضرت محمدیه (الحضرة المحمدية)"
  },
  "content": {
    "ar": "## «الباب الثلاثون وثلاثمائة في معرفة منزل القمر من الهلال من البدر من الحضرة المحمدية»\n\n\n> انظر إلى نوح وعاد واعتبر *** في صالح وثم لوط وافتكر\n\n\n> وقل لهم قول شفيق ناصح *** ونادهم هل فيكم من مدكر\n\n\n> وليس في الكون وجود غيره *** وليس في ليس وجود مستقر\n\n\n> فهو له ليس لنا وهو لنا *** ليس له بوجه كون مستمر\n\n\n> أين الذي لاح لنا من صور *** قد ذهبت وأعقبتها من صور\n\n\n> لو ذهبت في الغيب زال عينه *** وكان مشهودا لعين وبصر\n\n\n> أو عدمت وما أرى من عدم *** يقوم بالكون الكون له ظهر\n\n\n> وما بدا من عدم لكنه *** من كون حق ظاهر لا يستسر\n\n\n### [أن القمر مقام برزخي بين مسمى الهلال ومسمى البدر]\n\n\nاعلم أيدك الله أن القمر مقام برزخي بين مسمى الهلال ومسمى البدر في حال زيادة النور ونقصه فسمي هلالا لارتفاع الأصوات عند رؤيته في الطرفين ويسمى بدرا في حال عموم النور لذاته في عين الرائي وما بقي للقمر منزل سوى ما بين هذين الحكمين غير أن بدريته في استتاره عن إدراك الأبصار تحت شعاع الشمس الحائل بين الأبصار وبينه يسمى محقا وهو من الوجه الذي يلي الشمس بدر كما هو في حال كونه عندنا بدرا هو من الوجه الذي لا\n\n\nيظهر فيه الشمس محق وما بين هذين المقامين على قدر ما يظهر فيه من النور ينقص من الوجه الآخر وعلى قدر ما يستتر به من أحد الوجهين يظهر بالنور من الوجه الآخر وذلك لتعويج القوس الفلكي فلا يزال بدرا دائما ومحقا دائما وذلك لسر أراد الله‏\nإعلامه للعارفين بالله فضرب لهم هذا المثل بالفعل ليعتبروا فيه بالعبور إلى ما نصب له من معرفة الإنسان الكامل ومعرفة الله لوجوده على الصورة وتغير أحواله فيها لتغير المراتب التي يظهر فيها قال تعالى والْقَمَرَ قَدَّرْناهُ مَنازِلَ ولم يسمه بدرا ولا هلالا فإنه في هاتين الحالتين ما له سوى منزلة واحدة بل اثنتين فلا يصدق قوله مَنازِلَ إلا في القمر فللقمر درج التداني والتدلي وله الأخذ بالزيادة والنقص في الدخول إلى حضرة الغيب والخروج إلى حضرة الشهادة ثم إن الله تعالى نعته بالانشقاق لظهور الإنسان الكامل بالصورة الإلهية فكان شقا لها فظهورها في أمرين ظهور انشقاق القمر على فلقتين‏\n\n\nورد في الخبر عن الصاحب أن القمر انشق على عهد رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عند سؤال طائفة من العرب أن يكون لهم آية على صدقه فانشق فقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للحاضرين اشهدوا وقال تعالى اقْتَرَبَتِ السَّاعَةُ وانْشَقَّ الْقَمَرُ\n\n\nفلا يدري هل أراد الانشقاق الذي وقع فيه السؤال وهو الظاهر من الآية فإنه أعقب الانشقاق بقوله وإِنْ يَرَوْا آيَةً يُعْرِضُوا ويَقُولُوا سِحْرٌ مُسْتَمِرٌّ وكذا وقع القول منهم لما رأوا ذلك ولهذا قال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للحاضرين اشهدوا لوقوع ما سألوا وقوعه وما لهم إلا ما ظهر وهل هو ذلك الواقع في نفس الأمر أو في نظر الناظر هذا لا يلزم فإنه لا يرتفع الاحتمال إلا بقول المخبر إذا أخبر أنه في نفس الأمر كما ظهر في العين وقول المخبر هو محل النزاع وما اشترطوا في سؤالهم أن لا يظهر منهم ما ظهر منهم من الاعتراض عند وقوع ما سألوا وقوعه فلم يلزم النبي صَلَّى اللهُ عَليهِ وسَلَّم أكثر مما وقع فيه من السؤال ثم جاء الناس من الآفاق يخبرون بانشقاق القمر في تلك الليلة ولهذا قال الله تعالى عنهم إنهم قالوا فيه سِحْرٌ مُسْتَمِرٌّ فقال الله كُلُّ أَمْرٍ مُسْتَقِرٌّ كان ذلك الأمر ما كان فالقمر لو لا ما هو برزخي المرتبة ما قبل الإهلال والإبدار والمحق والسرار فالسحر المستمر داخل تحت حكم كل ذي أمر مستقر فهذا انشقاق بالحق وجهل في عين العلم وهو قوله ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ فأثبته علما واعلم أن النظر والاعتبار من العلوم التي تظهر من الأسرار والأنوار فالنور للبصر والأبصار فقال الله لما ذكر هذا المقام فَاعْتَبِرُوا يا أُولِي الْأَبْصارِ أي جوزوا مما أعطاكم البصر بنوره مما أدركه من المبصرات وأحكامها إلى ما تدركونه بعين بصائركم شهودا وهو الأتم الأقوى أو عن فكرة وهو الشهود الأدنى عن المرتبة العليا وكلاهما عابر عما ظهر إلى ما استسر وبطن فهي آيات لِقَوْمٍ يَتَفَكَّرُونَ كما هي آيات لِقَوْمٍ يَتَّقُونَ فالمتقي يتولى الله تعليمه فلا يدخل علمه شك ولا شبهة والمتفكر ناظر إلى قوة مخلوقة فيصيب ويخطئ وإذا أصاب يقبل دخول الشبهة عليه بالقوة التي أفادته الإصابة لاختلاف الطرق فالمتقي صاحب بصيرة والمتفكر بين البصر والبصيرة لم يبق مع البصر ولا يخلص للبصيرة فلنذكر في هذا المنزل مسألة من مسائله كإخوانه من المنازل وهو منزل شريف عال يسمى منزل النور في الطريق لأن الله جعله نورا ولم يجعله سراجا لما في السراج من الافتقار إلى الإمداد بالدهن لبقاء الضوء ولهذا كان الرسول سِراجاً مُنِيراً للامداد الإلهي الذي هو الوحي وجعله منيرا أي ذا نور لما فيه من الاستعداد لقبول هذا الإمداد كالنار التي في رأس الفتيلة التي ينبعث منها الدخان الذي فيه ينزل النور على رأس الفتيلة من السراج فيظهر سراجا مثله والنور من الأسماء الإلهية وليس السراج من أسمائها لأنه لا يستمد نوره من شي‏ء فعرفت من هذا الاعتبار رتبة القمر من الشمس قال تعالى وجَعَلَ الْقَمَرَ فِيهِنَّ نُوراً وجَعَلَ الشَّمْسَ سِراجاً فنور السراج مقيد والنور القمري مطلق ولهذا نكره ليعم الأنوار فكل سراج نور وما كل نور سراج‏\n\n\n### [أن العلم المطلق ينقسم إلى قسمين‏]\n\n\nواعلم أنه من العلم بالتحقق بالصورة أن العلم المطلق من حيث ما هو متعلق بالمعلومات ينقسم إلى قسمين إلى علم يأخذه الكون من الله بطريق التقوى وهو قوله إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً وقوله في الخضر وعَلَّمْناهُ من لَدُنَّا عِلْماً وعلم يأخذه الله من الكون عند ابتلائه إياه بالتكليف مثل قوله ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ فلو لا الاشتراك في الصورة ما حكم على نفسه بما حكم لخلقه من حدوث تعلق العلم فإن ظهر الإنسان بصورة الحق كان له حكم الحق فكان الحق سمعه وبصره فسمع بالحق فلا يفوته مسموع ويبصر بالحق فلا يفوته مبصر عدما كان المبصر أو وجودا وإن ظهر الحق بصورة الإنسان في الحال الذي لا يكون الإنسان في صورة الحق كان الحكم على الله مثل الحكم على صورة الإنسان الذي ما له صورة الحق فينسب إليه ما ينسب إلى تلك الصورة من حركة وانتقال وشيخ وشاب وغضب ورضاء وفرح وابتهاج ومن أجل ما بيناه من شأن هذين العلمين جعل الله‏\nفي الوجود كتابين كتابا سماه أما فيه ما كان قبل إيجاده وما يكون كتبه بحكم الاسم المقيت فهو كتاب ذو قدر معلوم فيه بعض أعيان الممكنات وما يتكون عنها وكتابا آخر ليس فيه سوى ما يتكون عن المكلفين خاصة فلا تزال الكتابة فيه ما دام التكليف وبه تقوم الحجة لله على المكلفين وبه يطالبهم لا بالأم وهذا هو الإمام الحق المبين الذي يحكم به الحق تعالى الذي أخبرنا الله في كتابه أنه أمر نبيه أن يقول لربه احْكُمْ بِالْحَقِّ يريد هذا الكتاب وهو كتاب الإحصاء ف لا يُغادِرُ صَغِيرَةً ولا كَبِيرَةً إِلَّا أَحْصاها وكُلُّ صَغِيرٍ وكَبِيرٍ مُسْتَطَرٌ وهو منصوص عليه في الأم التي هي الزبر ومعناه الكتابة وإن كانت أصناف الكتب كثيرة ذكرناها في مواقع النجوم فإنها ترجع إلى هذين الكتابين وسبب إيجاد الكتابين كونه سبحانه خلق من كل شي‏ء زوجين فخلق كتابين أيضا فمن الكتاب الثاني يسمى الحق خبيرا ومن الأم يسمى عليما فهو العليم بالأول الخبير بالثاني إن عقلت فالقضاء الذي له المضي في الأمور هو الحكم الإلهي على الأشياء بكذا والقدر ما يقع بوجوده في موجود معين المصلحة المتعدية منه إلى غير ذلك الموجود مثل قوله ولَوْ بَسَطَ الله الرِّزْقَ لِعِبادِهِ لَبَغَوْا في الْأَرْضِ فلو وجد البغي عن البسط لم تقم الحجة عليهم ولكِنْ يُنَزِّلُ بِقَدَرٍ ما يَشاءُ فما أنزل شيئا إلا بقدر معلوم ولا خلق شيئا إلا بقدر فإذا وجد البغي مع القدر قامت الحجة على الخلق حيث منع الغير مما بيده مع حصول الاكتفاء فما زاد فيعلم أنه لمصلحة غيره ومن فضله جعله قرضا ولا يقع القرض فيما هو رزق له لقوام عينه وجعل هذا الفعل من جملة مصالح العباد فرفع بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضاً سُخْرِيًّا ولما أنزل الله سبحانه نفسه منزلة عباده أمضى عليه أحكامهم فما حكم فيهم إلا بهم وهذا من حجته البالغة له عليهم وهو قوله جَزاءً وِفاقاً جَزاءً بِما كانُوا يَعْمَلُونَ جَزاءً بِما كانُوا يَكْسِبُونَ فأعمالهم عذبتهم وأعمالهم نعمتهم فما حكم فيهم غيرهم فلا يلومون إلا أنفسهم كما قال الله فيما حكاه لنا من قول الشيطان لَمَّا قُضِيَ الْأَمْرُ إِنَّ الله وَعَدَكُمْ وَعْدَ الْحَقِّ ووَعَدْتُكُمْ فَأَخْلَفْتُكُمْ وما كانَ لِي عَلَيْكُمْ من سُلْطانٍ أي من قوة ولا حجة ولا برهان إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي وليس كل من دعا تلزم إجابته ولهذا كانت المعجزات تشهد بصدق الدعوة من الرسل أنها دعوة الله والشيطان ما أقام برهانا لهم لما دعاهم وهو قوله وما كانَ لِي عَلَيْكُمْ من سُلْطانٍ فيا عجبا إن الناس جحدوا دعوة الحق مع ظهور البرهان وكفروا بها وأجابوا دعوة الشيطان العرية عن البرهان فقال لهم فَلا تَلُومُونِي ولُومُوا أَنْفُسَكُمْ نظرا منه إلى حكم الكتاب الثاني الذي به تقوم الحجة عليهم فلو نظر إلى الأم والزبر الأول لم يقل لهم ولُومُوا أَنْفُسَكُمْ فالقضاء للكتاب الأول يطلبه حكم الكتاب الثاني والقدر بالكتاب الثاني وكلا الكتابين محصور لأنه موجود وعلم الله في الأشياء لا يحصره كتاب مرقوم ولا يسعه رق منشور ولا لوح محفوظ ولا يسطره قلم أعلى ف لَهُ الْحَمْدُ في الْأُولى‏ والْآخِرَةِ ولَهُ الْحُكْمُ وإِلَيْهِ تُرْجَعُونَ أي إلى الحكم وهو القضاء فالضمير في إليه يعود على الحكم فإنه أقرب مذكور فلا يعود على الأبعد ويتعدى الأقرب إلا بقرينة حال هذا هو المعلوم من اللسان الذي أنزل به القرآن فالقضاء يحكم على القدر والقدر لا حكم له في القضاء بل حكمه في المقدر لا غير بحكم القضاء فالقاضي حاكم والمقدر موقت فالقدر التوقيت في الأشياء من اسمه المقيت قال الله تعالى وكانَ الله عَلى‏ كُلِّ شَيْ‏ءٍ مُقِيتاً وهذا المنزل أشهدته بقونية في ليلة لم يمر على أشد منها لنفوذ الحكم وقوته وسلطانه فحمدت الله على قصوره على تلك الليلة ولم يكن حكم تأبيد وإنما كان حكم وقوع مقدر فلما رددت إلي وقد سقط في يدي وعلمت ما أنزل الله علي وما قدره الحق لدي وفرقت بين قضائه وقدره في الأشياء كتبت به إلى أخ في الله كان لي رحمه الله أعرفه بما جرى كما جرت العادة بين الإخوان إذ كان كتابه قد ورد علي يطلبني بشرح أحوالي فصادف ورود هذا الحال فكتبت إليه في الحال بسم الله الرحمن الرحيم ورد كتاب المولى يسأل وليه عن‏\n\n\nشرح ما رأى إنه به أولى ليكون في ذلك بحكم ما يرد عليه‏\n\n\n> شهاب الدين يا مولى الموالي *** سألت تهمما عن شرح حالي‏\n\n\n> أنا المطرود من بين الموالي *** ومثلي من يصد عن الوصال‏\n\n\n> عصيت زجاجة فجهلت قدري *** فها أنا طائع حد الغوالي‏\n\n\n> رميت بأسهم الهجران حتى *** تداخلت النبال على النبال‏\n> فيرميني بأسهمه فأتى *** إليه فعل ذكران الرجال‏\n\n\n> وقفت ببابه أشكو وأبكي *** بكاء فقيد واحدة الموالي‏\n\n\n> وقلت بعبرة وحنين شجو *** أنا المطرود من بين الموالي‏\n\n\n> أنا العبد المضيع حق ربي *** فكيف تضيعني يا ذا الجلال‏\n\n\n> وإن مكارم الأخلاق منكم *** وإن العفو من كرم الخلال‏\n\n\n> وهل نشرت لجالينوس كتب *** لغير إزالة الداء العضال‏\n\n\n> ويدخر المقوم من سهام *** حذار كريهة يوم النضال‏\n\n\n> إذا كان العبيد عبيد سوء *** فإن الفضل من شيم الموالي‏\n\n\n> وعهدي باقتحام عقاب نفسي *** فكيف وقفت دونك في ضلال‏\n\n\n> لو استنطقت عن عجزي وضعفي *** لقلت فرضتم عين المحال‏\n\n\n> وها أنا واقف في حال عجزي *** ضعيف مثل ربات الحجال‏\n\n\n> بعثت إليه حسن الظن مني *** وإلحافا عظيما في السؤال‏\n\n\n> وإن كان الطباع طباع سوء *** فحسن الظن من كرم الخصال‏\n\n\n> وجودك قد تحققه رجائي *** وبعد تحققي ما أن أبالي‏\n\n\n> علمت بأن ذنبي لو تعالى *** لكان بجنب عفوك في سفال‏\n\n\n> بلطفك قبل علمي كنت تاجا *** فبعد العلم الحق بالنعال‏\n\n\n> لقد أيدتني وشددت أزري *** بتوحيد يجل عن المقال‏\n\n\n> بواقية الوليد مننت ربي *** طردت بها القبيح من الفعال‏\n\n\n> أعاين ما أعاين من جمال *** تقدس عن مكاشفة الخيال‏\n\n\n> وعن صور مقيدة تعالى *** عن المثل المحقق في المثالي‏\n\n\n> فأشهده ويشهدني فأفنى *** كمال في كمال في كمال‏\n\n\n> ويأخذني لمشهده ارتياح *** كما نشط الأسير من العقال‏\n\n\n> فما يلتذ بالحسنى سوائي *** لحسن عناية وصلاح بال‏\n\n\n> رأيت أهلة طلعت شموسا *** وأين الشمس من نور الهلال‏\n\n\n> فنفرت الظلام فلا ظلام *** ولا ليل إلى يوم انفصال‏\n\n\n> سلخت عناية من ليل جسمي *** كما سلخ النهار من الليالي‏\n\n\n> فكان المحو إثبات انفصال *** وكان النور آيات اتصالي‏\n\n\n> وبعد الوصل فاستمعوا مقالي *** دعاني للسجود مع الظلال‏\n\n\nوإن وليك لما أراد النهوض في طريقه والنفوذ إلى ما كان عليه في تحقيقه اعترضت لوليك عقبة كئود حالت بينه وبين الشهود والبلوغ إلى المقصود والتحقق بحقائق الوجود فخفت إن تكون عقبة القضاء لما لسيفه من المضاء فرأيتها صعبة المرتقى حائلة بيني وبين ما أريده من اللقاء فوقفت دونها في ليلة لا طلوع لفجرها ولا أعرف ما في طيها من أمرها فطلبت حبل الاعتصام والتمسك بالعروة الوثقى عروة الإسلام فنوديت أن ألزم الطلب ما بقيت فعلمت أني بهذا الخطاب في صورة مثالية متجلية في حضرة خيالية وأن علاقة تدبير الهيكل ما انقطع وحكمه فيه ما ارتفع فاستبشرت بزوال إفلاسى عند رجعتي إلى إحساسي فنظمت ما شهدت وخاطبت وليي في‏\nنظمي ببعض ما وجدت فإذا نظر وليي إليها فليعول عليها وليحذر من الأمن من مكر الله فإنه فَلا يَأْمَنُ مَكْرَ الله إِلَّا الْقَوْمُ الْخاسِرُونَ فاسمع هديت ما به على لساني نوديت‏\n\n\n> اعترضت لي عقبة *** وسط الطريق في السفر\n\n\n> فأسفرت عن محن *** فيمن طغى أو من كفر\n\n\n> من دونها جهنم *** ذات زفير وسعر\n\n\n> ترمي من الغيظ وجو *** المجرمين بشرر\n\n\n> بحورها قد سجرت *** وسقفها قد انفطر\n\n\n> وشمسها قد كورت *** ونجمها قد انكدر\n\n\n> أتيتكم أخبركم *** لتعرفوا معنى الخبر\n\n\n> ولا تقولوا مثل من *** قال فَما تُغْنِ النُّذُرُ\n\n\n> فكان من أمرهم *** ما قد سمعتم وذكر\n\n\n> قالوا وقد دعاكم *** الدَّاعِ إِلى‏ شَيْ‏ءٍ نُكُرٍ\n\n\n> فيخرجون خشعا *** مثل الجراد المنتشر\n\n\n> شعثا حفاة حسرا *** في يَوْمِ نَحْسٍ مُسْتَمِرٍّ\n\n\n> إلى عذاب وتوى *** إلى خلود في سقر\n\n\n> فلو ترى نبيهم *** حين دعاهم ف ازْدُجِرَ\n\n\n> وقد دعا مرسله *** إني ضعيف فَانْتَصِرْ\n\n\n> فقال يا عين انكسب *** وأنت يا أرض انفجر\n\n\n> حتى التقى الماء على *** أمر حكيم قَدْ قُدِرَ\n\n\n> فاصطفقت أمواجه *** وذا كم البحر الزخر\n\n\n> فالحكم حكم فاصل *** والأمر أمر مستقر\n\n\n> وأمره واحدة *** كمثل لمح بالبصر\n\n\n> سفينة قامت من ألواح *** نجاة ودسر\n\n\n> تجري بعين حفظه *** وعدا لِمَنْ كانَ كُفِرَ\n\n\n> تسوقها الأرواح عن *** أمر مليك مقتدر\n\n\n> أنزلها الجود على *** الجودي فقالوا لا وزر\n\n\n> ناداهم الحق أخرجوا *** منها أنا عين الوزر\n\n\n> حطوا وقالوا ربنا *** لديك نعم المستقر\n\n\n> فيا سماء اقلعي *** من سح ماء منهمر\n\n\n> وأنت يا أرض ابلعي *** ماءك واخزن واحتكر\n\n\n> قد قضى الأمر فمن *** كان عدوا قد غبر\n\n\n> تركتها تذكرة *** لكم فَهَلْ من مُدَّكِرٍ\n\n\n> وكل ما كان وما *** يكون منكم مستطر\n\n\n> وإنما يفعله *** في الكون من خير وشر\n\n\n> مقدر مؤقت *** كذا أتانا في الزبر\n\n\n> الموت سم ناقع *** والحشر أَدْهى‏ وأَمَرُّ\n\n\n> سفينكم أجسامكم *** في بحر دنيا قد زخر\n\n\n> وأنتم ركابها *** وأنتم على خطر\n\n\n> وما لكم من ساحل *** غير القضاء والقدر\n\n\n> فابتهلوا واجتهدوا *** فما من الله مفر\n\n\n> هذا الذي أشهدته *** في ليلتي حتى السحر\n\n\n> فازدجروا واعتبروا *** واتعظوا بمن غبر\n\n\n> فالكل والله بلا *** شك على ظهر سفر\n\n\n> من قبل ذا أشهدني *** أمرا عجيبا فيه سر\n\n\n> فاستمعوا نطقي به *** واعتبروا لفظ السكر\n\n\n> فالحمد لله الذي *** بفضله أعطى البشر\n\n\n> ما عندكم منها خبر *** بل عندنا منها الخبر\n\n\n> قلت ترى أين مضت *** قال مضت تقضي الوطر\n\n\n> قلت تراها ترعوي *** قال نعم عند السحر\n\n\n> قلت وهل تعرفها *** قال نعم أخت القمر\n\n\n> قلت على من نزلت *** قال على أبي البشر\n\n\n> قلت وما ذا تبتغي *** قال ضرابا بالذكر\n\n\n> ما يعرف السر سوى *** والدتي أم البشر\n\n\n> تقول زدني يا فتى *** منه فنعم المختبر\n\n\n> قبلتها عانقتها *** حلت معاقد الأزر\n\n\n> طعنت في مستهدف *** أجرد ما فيه شعر\n\n\n> وعرفه كأنه *** ريح الخزامي والعطر\n\n\n> وجدته كمثل نار *** لمجوس تستعر\n\n\n> أردافها كأنها *** أعجاز نخل منقعر\n\n\n> يا نظرة قد أظهرت *** من الوجود ما ظهر\n\n\n> لو لا النتاج لم يكن *** للسر معنى في البشر\n\n\n> سر لنا وكن له *** وجود خلق مستمر\n\n\n> إذا التقى السر وكن *** بدت لعينيك العبر\n\n\n> وقائل ذا مثل *** قرره لمن نظر\n\n\n> على القنا إذا بدا *** لمن يشاء فاعتبر\n\n\n> قلت نعم وبعد ذا *** فهو لأشياء أخر\n\n\n> هنا وفي الأخرى وحيث *** ما نكون فادكر\n\n\n> قالوا وكيف الأمر قل *** فقلت سمعا ما ستر\n> إذا الولي أقبلت *** زوجته على سرر\n\n\n> يفضي إليها بالذي *** يحمله من الصور\n\n\n> فعند ما ينكحها *** تصورا على صور\n\n\n> من جنس ما لو ولدت *** كان على تلك الصور\n\n\n> من ذي إمام حاكم *** أو ذات غنج وحور\n\n\n> فإن يكن أنثى فهي *** وإن يكن هو فذكر\n\n\n> مثل تجليه سوا *** تحول بلا غير\n\n\nفليتدبر وليي ما سطرته وليفكر فيما ذكرته وليأخذه عبرة من البصر لبصيرته ومن سره لسريرته فقد آن إن يجي‏ء زمان المحن وقد علمت لما أوجدك ورتبة الكمال الذي أشهدك وما طلب منك إلا ما يقتضيه وجودك ويقضي به شهودك فإن أنصفت فقد عرفت وإن تعاميت بعد ما أراك ما قد رأيت فقد وهيت فاسد المقالة سؤال الإقالة والسلام فسر بورود كتابي عليه وأمعن بالنظر فيه وإليه فأورثه التفكر فيه علة كانت سبب رحلته وسرعة نقلته فما بقي إلا أياما ودرج وعلى أسنى معراج إلى مقصوده عرج وشهدت احتضاره بالدار البيضاء إلى أن قضى وسافرت من يومي لاستعجال قومي فهذا بعض ما يحوي عليه هذا المنزل من الأهوال الصعاب التي تعظم في الشهود صورها\n\n\n### [أن الله ذكر أخبار القرون الماضية لتكون على حذر من الأسباب التي أخذهم الله بها أخذته الرابية]\n\n\nواعلم أن الله ما ذكر أخبار القرون الماضية إلا لتكون على حذر من الأسباب التي أخذهم الله بها أخذته الرابية وبطش بهم البطش الشديد وأما الموت فأنفاس معدودة وآجال محدودة وليس الخوف إلا من أخذه وبطشه لا من لقائه فإن لقاءه يسر الولي والموت سبب اللقاء فهو أسنى تحفة يتحفها المؤمن فكيف به إذا كان عالما بخ على بخ ويتضمن هذا المنزل من العلوم علم الرحمتين وعلم قرب السعي من قرب الشبر والذراع وهو القرب المحدود وعلم الرتق والفتق وعلم المتشابه من المحكم وعلم الأبد وعلوم الأدلة وعلم الاتباع وما يسعد منه وما يشقى وعلم ثبوت الأمور ومرتبة الحكم والحكم وعلم الجزاء الوفاق وعلم الخبر بالإجابة إلى المكروه كإجابة أولاد أم عيسى وعلم التلبيس فيهبك متاعك من غير الوجهة التي تعرف منها أنه متاعك تلبيسا عليك فإذا انكشف الغطاء وكان البصر حديدا علمت أنه ما أعطاك إلا ما كان بيدك فما زادك من عنده ولا أفادك مما لديه إلا تغير الصور فمن وقف على هذا العلم قال بالري في مشروبه ومن حرمه لم يزل عاطشا والماء عنده الذي يرويه ولا يشعر به أنه عنده وهو من أسنى علم يوهبه العارفون بالله فهو كالمطر للأرض وليس عين ما تطلبه من الارتواء سوى بخارها صعد منها بخارا ثم نزل إليها مطرا فتغيرت صورته لاختلاف المحل فما شربت ولا ارتوت إلا من مائها ولو علمت ذلك ما حجبتها المعصرات فتحقق هذا النوع من العلم في العلم الإلهي فما أعطاك إلا منك وما هو عليه فلا يعلمه منه إلا هو فكل عالم فمن نفسه علمه فلذلك قال أهل الله لا يعرف الله إلا الله ولا النبي ولا الولي إلا الولي ويتضمن أيضا علم أسباب النجاة والسعادة وعلم الامتحانات بالعسر واليسر للصابر والشاكر وعلم المناسبة التي بها لم يمتثل أمر الله من عصى أمره ومن امتثله هل امتثله بأمر مناسب أو بعدم المناسب وعلم سبب تأثير الأدنى في الأعلى كتسليط الحيوانات على الإنسان كقرصة البرغوث إلى ما فوقها وقال تعالى أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ وعلم مشاركة الحيوانات الإنسان في العلوم عن التجلي وعلم من رد كل ما أتاه من الحق من أين رده ومن رد بعضه من أين رده وهل يتساوى الحكم الإلهي فيهم أم لا وعلم من أين انهزم الصحابة يوم حنين وعلم مؤاخذة الأعلى بالأدنى إذا نصب دلالة نصبه من نصبه وعلم السوابق واللواحق وعلم الوحدة في عين الجمع وعلم المراتب والدرجات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 330: Concerning the Knowledge of the Station of the Moon, from the Crescent, from the Full Moon, from the Muhammadan Presence\n\nLook at Noah and 'Ad, and take heed;\nIn Salih and then Lot, and reflect.\n\nAnd speak to them the word of a compassionate advisor,\nAnd call out to them: <<وَنَادِهِمْ هَلْ فِيكُم مِّن مُّدَّكِرٍ>> (Is there any who will remember?)\n\nThere is no existence (وجود) in the cosmos (الكون) other than Him,\nAnd there is no stable existence in non-existence (ليس).\n\nHe is for Him, not for us; and He is for us,\nNot for Him, by the aspect of continuous existence.\n\nWhere is that which appeared to us from forms\nWhich have departed and were followed by other forms?\n\nIf it departed into the Unseen (الغيب), its essence would vanish,\nAnd it would be witnessed by the eye and sight.\n\nOr if it ceased to be—and I see no non-existence\nThat sustains the cosmos (الكون); the cosmos appeared for Him.\n\nAnd it did not appear from non-existence, but rather\nFrom the Being (كون) of the manifest Real (حق) that cannot be concealed.\n\n### [That the Moon is an Isthmus Station between the designation of the Crescent and the designation of the Full Moon]\n\nKnow, may Allah strengthen you, that the Moon is an isthmus station (مقام برزخي) between the designation of the Crescent (الهلال) and the designation of the Full Moon (البدر), in the state of the increase and decrease of light. It is called a crescent because of the raising of voices upon its sighting at the two extremes [of the month], and it is called a full moon in the state of the generality of light inherent in its Essence (الذات) in the eye of the beholder.\n\nThe Moon has no station (منزل) remaining except what lies between these two rulings, except that its state of being a full moon when it is concealed from the perception of sight beneath the rays of the sun—which interposes between the sights and it—is called *maḥq* (occultation/waning). And from the face that is turned toward the sun, it is a full moon, just as in the state when it is a full moon to us, it is *maḥq* from the face where the sun does not appear.\n\nWhat lies between these two stations (المقامين) is that the amount of light that appears on one face decreases from the other face, and the amount by which it is concealed on one face appears as light on the other face. This is due to the curvature of the celestial arc. Thus, it remains perpetually a full moon and perpetually in occultation. This is due to a secret that Allah wished to make known to the Gnostics (العارفين بالله), so He set this example for them in action, so that they might take heed by crossing over (العبور) to that for which it was established: the knowledge of the Perfect Human (الإنسان الكامل) and the knowledge of Allah, due to His existence upon the Form (الصورة) and the change of His states within it, corresponding to the change of the Levels (المراتب) in which He manifests.\n\nAllah the Exalted said: <<وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ>> (And the moon, We have decreed for it stations). He did not call it a full moon or a crescent, for in these two states, it has only one station, or rather, two. Thus, His saying \"stations\" (مَنَازِلَ) is only truly applicable to the Moon. For the Moon has the degrees of drawing near and descending, and it takes on increase and decrease in entering the Presence of the Unseen (حضرة الغيب) and exiting into the Presence of Witnessing (حضرة الشهادة).\n\nFurthermore, Allah the Exalted described it by the splitting (الانشقاق) due to the manifestation of the Perfect Human in the Divine Form (الصورة الإلهية). Thus, the Perfect Human was a split for that Form. Its manifestation occurs in two matters: the manifestation of the splitting of the Moon into two halves.\n\nIt is reported in the tradition (الخبر) from the Companion that the Moon split during the time of the Messenger of Allah (may Allah bless him and grant him peace) when a group of Arabs requested a sign (آية) of his truthfulness. So it split. The Messenger of Allah (may Allah bless him and grant him peace) said to those present: \"Bear witness!\" And Allah the Exalted said: <<اقْتَرَبَتِ السَّاعَةُ وَانشَقَّ الْقَمَرُ>> (The Hour has drawn near, and the moon has split).\n\nIt is not known whether He intended the splitting that occurred upon the request—which is the apparent meaning of the verse—for He followed the splitting with His saying: <<وَإِن يَرَوْا آيَةً يُعْرِضُوا وَيَقُولُوا سِحْرٌ مُّسْتَمِرٌّ>> (And if they see a sign, they turn away and say, \"Continuous magic\"). And this is exactly what they said when they saw it. This is why the Messenger of Allah (may Allah bless him and grant him peace) told those present: \"Bear witness!\" to the occurrence of what they had requested. They have nothing but what appeared. Whether that occurrence was in reality (*fi nafs al-amr*) or merely in the eye of the beholder is not necessary, for the possibility is only removed by the statement of the one reporting, if he reports that it was in reality just as it appeared to the eye. And the statement of the reporter is the point of contention. They did not stipulate in their request that the objection they raised upon the occurrence of what they asked for should not appear from them. Thus, the Prophet (may Allah bless him and grant him peace) was not obligated to do more than what was requested.\n\nThen people came from the horizons reporting the splitting of the Moon on that night. This is why Allah the Exalted reported that they said of it: <<سِحْرٌ مُّسْتَمِرٌّ>> (Continuous magic). Then Allah said: <<وَكُلُّ أَمْرٍ مُّسْتَقِرٌّ>> (And every matter is established), whatever that matter may have been. If the Moon were not of the rank of the Isthmus (برزخي المرتبة), it would not accept the crescent state, the full moon state, the occultation, and the concealment. Thus, continuous magic falls under the ruling of every established matter. This splitting is by the Real (بالحق) and is ignorance in the very essence of Knowledge (العلم), which is His saying: <<ذَلِكَ مَبْلَغُهُم مِّنَ الْعِلْمِ>> (That is their limit of knowledge). Thus, He established it as knowledge.\n\nKnow that reflection (النظر) and taking heed (الاعتبار) are among the sciences that manifest from the Secrets (الأسرار) and the Lights (الأنوار). Light is for sight (البصر) and insights (الأبصار). When Allah mentioned this station (المقام), He said: <<فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ>> (So take heed, O possessors of insight). That is, cross over from what sight has given you through its light—from the visible things and their rulings—to what you perceive by the eye of your inner sight (بصائركم) through witnessing (شهودا), which is the most complete and strongest, or through contemplation (فكرة), which is the lesser witnessing (الشهود الأدنى) derived from the higher Level (المرتبة العليا). Both are crossing over from what is manifest to what is concealed and hidden. These are signs <<لِقَوْمٍ يَتَفَكَّرُونَ>> (for a people who reflect), just as they are signs <<لِقَوْمٍ يَتَّقُونَ>> (for a people who fear God/are pious).\n\nThe pious one (المتقي) has his teaching undertaken by Allah, so doubt or ambiguity does not enter his knowledge. The reflector (المتفكر) looks at a created power, so he may be right or wrong. Even if he is right, he is susceptible to the entry of ambiguity due to the very power that granted him correctness, because of the divergence of paths. Thus, the pious one is the possessor of inner sight (بصيرة), while the reflector is between outer sight (البصر) and inner sight (البصيرة); he neither remains with outer sight nor attains pure inner sight.\n\nLet us mention in this station (المنزل) one of its issues, like its brethren among the stations. It is a noble, high station called the Station of Light (منزل النور) on the Path, because Allah made it Light (نورا) and did not make it a Lamp (سراجا). This is because a lamp requires sustenance (الإمداد) by oil for the persistence of its illumination. This is why the Messenger was <<سِرَاجًا مُّنِيرًا>> (a luminous lamp), due to the Divine Sustenance (الإمداد الإلهي), which is Revelation (الوحي). And He made him luminous (منيرا), meaning possessing light, due to his readiness to accept this sustenance, like the fire at the tip of the wick from which smoke emanates, and upon which the light descends from the lamp onto the tip of the wick, appearing as a lamp itself. And Light (النور) is one of the Divine Names (الأسماء الإلهية), but the Lamp (السراج) is not among His Names, because He does not derive His Light from anything. From this reflection, you have understood the rank of the Moon relative to the Sun. Allah the Exalted said: <<وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا>> (And He made the moon therein a light, and He made the sun a lamp). The light of the lamp is restricted, while the lunar light is absolute. This is why He made it indefinite, so that it encompasses all lights. Every lamp is light, but not every light is a lamp.\n\n### [That Absolute Knowledge is divided into two sections]\n\nKnow that, from the knowledge of realization through the Form (التحقق بالصورة), Absolute Knowledge (العلم المطلق), insofar as it relates to the known things (المعلومات), is divided into two sections: Knowledge that the cosmos (الكون) receives from Allah through piety (التقوى), which is His saying: <<إِن تَتَّقُوا اللَّهَ يَجْعَل لَّكُمْ فُرْقَانًا>> (If you fear Allah, He will grant you a criterion), and His saying concerning Al-Khidr: <<وَعَلَّمْنَاهُ مِن لَّدُنَّا عِلْمًا>> (And We taught him knowledge from Our presence). And Knowledge that Allah receives from the cosmos when He tests it with obligation (التكليف), such as His saying: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know).\n\nWere it not for the sharing in the Form (الصورة), He would not have ruled upon Himself with what He ruled upon His creation concerning the contingency of the attachment of Knowledge. If the human manifests in the Form of the Real (صورة الحق), he possesses the ruling of the Real. Thus, the Real becomes his hearing and his sight. He hears by the Real, so no audible thing escapes him, and he sees by the Real, so no visible thing escapes him, whether the visible thing is non-existent or existent. And if the Real manifests in the form of the human in a state where the human is not in the Form of the Real, the ruling upon Allah is like the ruling upon the form of the human who does not possess the Form of the Real. Thus, there is attributed to Him what is attributed to that form: movement, transition, old age, youth, anger, pleasure, joy, and delight.\n\nBecause of what we have explained concerning the status of these two types of Knowledge, Allah established two Books (كتابين) in Existence (الوجود). One Book He called the Mother (أما), containing what was before His creation and what will be. He wrote it by the ruling of the Name *al-Muqīt* (The Maintainer). It is a Book of known measure (قدر معلوم), containing some of the Fixed Entities (الأعيان الثابتة) and what is generated from them. And another Book that contains nothing but what is generated specifically by those obligated [by Divine Law] (المكلفين). Writing continues in it as long as the obligation (التكليف) remains. By this Book, the proof (الحجة) of Allah is established against the obligated ones, and by it He holds them accountable, not by the Mother Book (الأم). This is the Clear, True Register (الإمام الحق المبين) by which the Real (الحق تعالى) judges, the one concerning which Allah informed us in His Book that He commanded His Prophet to say to his Lord: <<احْكُم بِالْحَقِّ>> (Judge by the truth). He means this Book, which is the Book of Enumeration (كتاب الإحصاء). Thus, <<لَا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّا أَحْصَاهَا>> (It leaves out no small thing or great thing but that it has enumerated it), and <<وَكُلُّ صَغِيرٍ وَكَبِيرٍ مُّسْتَطَرٌ>> (And every small and great thing is inscribed). This is explicitly mentioned in the Mother Book (الأم), which is the *Zubur* (Scriptures), meaning the writing. Although the types of Books are numerous, as we mentioned in *Mawāqi' al-Nujūm* (The Settings of the Stars), they ultimately return to these two Books.\n\nThe reason for the creation of the two Books is that He, glory be to Him, created pairs of everything, so He also created two Books. From the second Book, the Real is called *Khabīr* (All-Aware), and from the Mother Book (الأم), He is called *Alīm* (All-Knowing). Thus, He is the All-Knowing (العليم) of the first and the All-Aware (الخبير) of the second, if you understand.\n\nThe Divine Decree (*al-Qaḍā'*) which has precedence in matters is the Divine Ruling (الحكم الإلهي) upon things to be such-and-such. And the Measure (*al-Qadar*) is what occurs by its existence in a specific existent thing, the benefit of which extends from it to other than that existent thing. For example, His saying: <<وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ>> (And if Allah had extended the provision for His servants, they would have committed tyranny on the earth). If the tyranny resulted from the extension [of provision], the proof would not be established against them. But <<وَلَكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ>> (But He sends down in measure what He wills). He sends nothing down except by a known measure (بقدر معلوم), and He creates nothing except by a measure (بقدر). If tyranny occurs alongside the Measure (القدر), the proof is established against the creation, since they withhold from others what is in their hands despite having sufficiency. What is surplus is known to be for the benefit of others, and out of His grace, He made it a loan (قرض). A loan does not occur in what is provision necessary for the sustenance of one's own essence. He made this action part of the benefits of the servants, so He raised <<بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِّيَتَّخِذَ بَعْضُهُم بَعْضًا سُخْرِيًّا>> (some of them above others in degrees, that some of them may take others in subjection).\n\nWhen Allah, glory be to Him, lowered Himself to the level of His servants, He executed their rulings upon Himself. He only judged them by means of themselves. This is part of His conclusive proof (حجته البالغة) against them, which is His saying: <<جَزَاءً وِفَاقًا>> (A fitting recompense), <<جَزَاءً بِمَا كَانُوا يَعْمَلُونَ>> (A recompense for what they used to do), <<جَزَاءً بِمَا كَانُوا يَكْسِبُونَ>> (A recompense for what they used to earn). Their deeds punished them, and their deeds blessed them. No one other than themselves judged them, so they blame no one but themselves, just as Allah recounted to us the saying of Satan when the matter was concluded: <<إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدتُّكُمْ فَأَخْلَفْتُكُمْ ۖ وَمَا كَانَ لِيَ عَلَيْكُم مِّن سُلْطَانٍ>> (Indeed, Allah promised you the promise of truth, and I promised you, but I betrayed you. And I had no authority over you)—meaning no power, proof, or evidence—<<إِلَّا أَن دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي>> (except that I invited you, and you responded to me). Not everyone who invites must be answered. This is why miracles testify to the truthfulness of the invitation of the Messengers, proving it is the invitation of Allah. Satan established no proof for them when he invited them, which is his saying: <<وَمَا كَانَ لِيَ عَلَيْكُم مِّن سُلْطَانٍ>> (And I had no authority over you).\n\nHow astonishing that people denied the invitation of the Real (دعوة الحق) despite the manifestation of the proof, and disbelieved in it, yet they answered the invitation of Satan, which was devoid of proof! So he said to them: <<فَلَا تَلُومُونِي وَلُومُوا أَنفُسَكُمْ>> (So do not blame me, but blame yourselves), looking from his perspective at the ruling of the Second Book, by which the proof is established against them. If he had looked at the Mother Book (الأم) and the first *Zubur* (Scriptures), he would not have said to them: \"Blame yourselves.\" The Divine Decree (القضاء) belongs to the First Book, and the ruling of the Second Book demands it, while the Measure (القدر) belongs to the Second Book.\n\nBoth Books are contained because they are existent. But the Knowledge of Allah concerning things is not contained by an inscribed book, nor encompassed by an unrolled parchment, nor a Preserved Tablet (لوح محفوظ), nor inscribed by the Highest Pen (قلم أعلى). So <<فَلَهُ الْحَمْدُ فِي الْأُولَى وَالْآخِرَةِ وَلَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ>> (To Him belongs praise in the first [life] and the last, and to Him belongs the judgment, and to Him you will be returned). That is, to the Judgment (الحكم), which is the Divine Decree (القضاء). The pronoun in \"to Him\" (إليه) refers back to the Judgment, as it is the closest mentioned noun. It does not refer back to the more distant noun, nor does it bypass the closest one, except by contextual evidence. This is what is known from the language in which the Quran was revealed. Thus, the Divine Decree (القضاء) rules over the Measure (القدر), but the Measure has no ruling over the Decree. Rather, its ruling is only upon the measured thing (المقدر) by the ruling of the Decree. The Decreer (القاضي) is the ruler, and the Measurer (المقدر) is the timer. The Measure is the timing of things, derived from His Name *al-Muqīt* (The Maintainer). Allah the Exalted said: <<وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ مُّقِيتًا>> (And Allah is over all things a Maintainer).\n\nI witnessed this station (المنزل) in Konya on a night more intense than any I had experienced, due to the penetration, power, and sovereignty of the Ruling (الحكم). I praised Allah that it was confined to that night and was not a ruling of perpetuity, but rather a ruling of the occurrence of a measured thing (مقدر). When I was returned to myself, having fallen into my own hands, and I knew what Allah had revealed to me and what the Real (الحق) had measured out for me, and I distinguished between His Decree (قضائه) and His Measure (قدره) concerning things, I wrote about it to a brother in Allah (may Allah have mercy on him) to inform him of what had transpired, as is customary among brethren. His letter had reached me, asking for an explanation of my states, and it coincided with the arrival of this spiritual state (الحال). I immediately wrote to him: In the Name of Allah, the Most Gracious, the Most Merciful. The letter of the Master arrived, asking His friend for an explanation of what he saw, which he was most worthy of, so that he might be subject to the ruling of what comes upon him.\n\n> O Shihāb al-Dīn, Master of Masters,\n> You asked with concern for an explanation of my state.\n> I am the one driven out from among the Masters,\n> And one like me is barred from Union (الوصال).\n> I disobeyed a glass [vessel], so I ignored my worth,\n> And here I am obedient to the limit of the precious ones.\n> I was struck by the arrows of abandonment\n> Until the darts overlapped the darts.\n> So He strikes me with His arrows, and I come\n> To Him with the action of the males among men.\n> I stood at His door complaining and weeping,\n> The weeping of one who has lost the unique Master.\n> And I said with a tear and a mournful yearning:\n> I am the one driven out from among the Masters.\n> I am the servant who wasted the right of my Lord,\n> So how can You waste me, O Possessor of Majesty?\n> Indeed, noble character traits are from You,\n> And forgiveness is from the generosity of attributes.\n> Were the books of Galen published\n> For anything other than removing chronic disease?\n> And the archer saves his arrows\n> Fearing the horror of the day of struggle.\n> If the servants are bad servants,\n> Then grace is among the characteristics of the Masters.\n> My covenant was to brave the punishment of my soul,\n> So how did I stand before You in error?\n> If I were asked to speak of my helplessness and weakness,\n> I would say: You have imposed the essence of the impossible.\n> And here I stand in a state of helplessness,\n> Weak, like the mistresses of the chambers.\n> I sent to Him my good opinion,\n> And a great insistence in asking.\n> And though natures may be bad natures,\n> Good opinion is from the nobility of traits.\n> My hope has realized Your generosity,\n> And after my realization, I do not care.\n> I knew that if my sin were exalted,\n> It would be low beside Your pardon.\n> By Your kindness, before my knowledge, I was a crown,\n> But after the knowledge, the Real is with the sandals.\n> You have supported me and strengthened my back\n> With a Unity (توحيد) that is too sublime for speech.\n> By the protection of the newborn, You favored me, my Lord,\n> By which You drove away ugly deeds.\n> I behold what I behold of Beauty,\n> Sanctified beyond the unveiling of Imagination (الخيال).\n> And exalted beyond restricted forms,\n> Beyond the realized likeness in the exemplary.\n> So I witness Him, and He witnesses me, and I am annihilated (أفنى),\n> Perfection within Perfection within Perfection.\n> And a comfort takes hold of me toward His witnessing,\n> Just as the captive is released from his bonds.\n> No one but me delights in the good things,\n> Due to the beauty of providence and the soundness of mind.\n> I saw crescents that rose as suns,\n> And where is the sun compared to the light of the crescent?\n> So I scattered the darkness, and there is no darkness,\n> And no night until the Day of Separation.\n> Providence stripped away the night of my body,\n> Just as the day is stripped away from the nights.\n> So the effacement (المحو) was the affirmation of separation,\n> And the Light (النور) was the signs of my connection.\n> And after the Union (الوصل), listen to my saying:\n> He called me to prostration along with the shadows.\n\nWhen your friend (وليك) desired to rise up on his path and penetrate to what he was in his realization (تحقيقه), a difficult obstacle (عقبة كئود) blocked his way, interposing between him and the Witnessing (الشهود), the attainment of the goal, and the realization of the Realities of Existence (حقائق الوجود). I feared that it might be the obstacle of the Divine Decree (عقبة القضاء), due to the sharpness of its sword. I saw it as difficult to ascend, interposing between me and the meeting (اللقاء) I desired. So I stood before it on a night whose dawn would not break, and I did not know what matter lay within its folds. I sought the rope of adherence and holding fast to the firmest handhold (العروة الوثقى), the handhold of Islam. Then I was called: \"Adhere to the seeking as long as you remain.\" I knew by this address that I was in an exemplary form (صورة مثالية) manifesting in the Imaginative Presence (حضرة خيالية), and that the connection of the management of the physical structure (الهيكل) had not been severed, nor had its ruling over it been lifted. I rejoiced at the removal of my spiritual bankruptcy upon my return to my sensation. So I composed what I witnessed and addressed my friend (وليي) in my composition with some of what I found. If my friend looks at it, let him rely upon it, and let him beware of feeling safe from the cunning of Allah, for <<فَلَا يَأْمَنُ مَكْرَ اللَّهِ إِلَّا الْقَوْمُ الْخَاسِرُونَ>> (None feel secure from the plan of Allah except the losing people). So listen, may you be guided, to what I was called upon my tongue.\n\n> An obstacle blocked my way\n> In the middle of the journey on the Path.\n> It revealed trials\n> For those who transgressed or disbelieved.\n> Beyond it is Hell (Jahannam),\n> Possessing roaring and blazing fire.\n> Out of rage, it throws the faces\n> Of the criminals with sparks.\n> Its seas have been set ablaze,\n> And its roof has been split open.\n> And its sun has been wrapped up,\n> And its star has been dimmed.\n> I came to you to inform you,\n> So that you may know the meaning of the news.\n> And do not say like those who\n> Said: <<فَمَا تُغْنِ النُّذُرُ>> (What good are the warnings?).\n> And their affair was\n> What you have heard and been reminded of.\n> They said, when the Caller called you\n> <<الدَّاعِ إِلَى شَيْءٍ نُّكُرٍ>> (to something dreadful).\n> They will come forth humbled,\n> Like scattered locusts.\n> Disheveled, barefoot, and naked,\n> On <<يَوْمِ نَحْسٍ مُّسْتَمِرٍّ>> (a day of continuous misfortune).\n> To torment and ruin,\n> To eternity in Saqar (Hellfire).\n> If you could see their Prophet\n> When he called them, and he was rebuked.\n> And his Messenger called out:\n> \"I am weak, <<فَانتَصِرْ>> (so help me)!\"\n> So He said: \"O eye, pour forth,\n> And O earth, burst open!\"\n> Until the water met upon\n> A wise matter <<قَدْ قُدِرَ>> (that had been decreed).\n> Its waves clashed,\n> And that is the surging sea.\n> The Ruling is a decisive ruling,\n> And the matter is an established matter.\n> And His command is but one,\n> Like the twinkling of an eye.\n> A ship built of planks\n> Of salvation and nails.\n> It sails under the eye of His preservation,\n> A promise to <<لِمَن كَانَ كُفِرَ>> (him who was disbelieved).\n> The spirits drive it\n> By the command of a Sovereign, Omnipotent King.\n> Generosity brought it down upon\n> Al-Jūdī, and they said: \"No burden!\"\n> The Real called out to them: \"Come out\n> From it! I am the very essence of the burden!\"\n> They disembarked and said: \"Our Lord,\n> With You is the best resting place.\"\n> O sky, cease\n> From pouring down streaming water!\n> And O earth, swallow\n> Your water, store it, and hoard it!\n> The matter has been decreed, and whoever\n> Was an enemy has perished.\n> I left it as a reminder\n> For you: <<فَهَلْ مِن مُّدَّكِرٍ>> (Is there any who will remember?).\n> And all that was and all that\n> Will be from you is inscribed.\n> And what He does\n> In the cosmos, of good and evil,\n> Is measured and timed,\n> Thus it came to us in the Scriptures (الزبر).\n> Death is a deadly poison,\n> And the Gathering is <<أَدْهَى وَأَمَرُّ>> (more grievous and bitter).\n> Your ship is your body,\n> In the sea of a world that surges.\n> And you are its riders,\n> And you are in danger.\n> And you have no shore\n> Other than the Divine Decree (القضاء) and the Measure (القدر).\n> So supplicate and strive,\n> For there is no escape from Allah.\n> This is what I witnessed\n> In my night until dawn.\n> So be warned, take heed,\n> And be admonished by those who have passed away.\n> For all, by Allah, without\n> Doubt, are upon the back of a journey.\n> Before this, He made me witness\n> A wondrous matter containing a Secret (سر).\n> So listen to my utterance of it,\n> And take heed of the word of intoxication.\n> Praise be to Allah, who\n> By His grace gave to humanity.\n> You have no news of it,\n> But we have the news of it.\n> I said: \"Where do you see her going?\"\n> He said: \"She went to fulfill her desire.\"\n> I said: \"Do you see her repenting?\"\n> He said: \"Yes, at dawn.\"\n> I said: \"And do you know her?\"\n> He said: \"Yes, the sister of the Moon.\"\n> I said: \"Upon whom did she descend?\"\n> He said: \"Upon the Father of Humanity [Adam].\"\n> I said: \"And what does she seek?\"\n> He said: \"Striking with the male organ.\"\n> No one knows the Secret (السر) except\n> My mother, the Mother of Humanity [Eve].\n> She says: \"Give me more of it, O youth,\n> For it is an excellent trial.\"\n> I kissed her, I embraced her,\n> I untied the knots of the loincloth.\n> I thrust into a target\n> Smooth, with no hair upon it.\n> And its scent was as if it were\n> The fragrance of lavender and perfume.\n> I found it like a fire\n> For the Zoroastrians, blazing.\n> Her buttocks were as if they were\n> The uprooted trunks of date palms.\n> O gaze that has manifested\n> From Existence (الوجود) what has appeared!\n> Were it not for procreation,\n> The Secret (السر) would have no meaning in humanity.\n> Be a Secret for us, and be for Him\n> The existence of continuous creation.\n> When the Secret and the \"Be!\" (كن) meet,\n> The lessons (العبر) appear to your eyes.\n> And the one who says this is an example\n> Established for the one who looks.\n> Upon the spear, when it appears\n> To whomever He wills, so take heed.\n> I said: \"Yes, and after this,\n> It is for other things.\"\n> Here and in the Hereafter, and wherever\n> We may be, so remember.\n> They said: \"And how is the matter? Speak!\"\n> I said: \"Hearing what is concealed.\"\n> When the friend (الولي) approaches\n> His wife upon couches,\n> He conveys to her that which\n> He carries of the Forms (الصور).\n> When he unites with her,\n> They imagine forms,\n> Of the kind that, if she gave birth,\n> Would be upon those forms.\n> Whether it be a ruling Imam\n> Or a woman of coquetry and wide, dark eyes.\n> If it is female, it is she,\n> And if it is he, it is male.\n> Like His Theophany (تجليه) that transforms\n> Without alteration.\n\nLet my friend (وليي) reflect upon what I have inscribed, and let him contemplate what I have mentioned, and let him take it as a lesson (عبرة) from outer sight (البصر) to his inner sight (بصيرته), and from his secret (سره) to his innermost secret (سريرته). For the time of trials (المحن) is near. You have known why He brought you into existence and the rank of perfection (رتبة الكمال) He made you witness. He seeks nothing from you except what your existence necessitates and what your witnessing decrees. If you are just, you have known. But if you pretend to be blind after He has shown you what you have seen, then you have become weak. The saying is corrupt: \"A request for dismissal.\" And peace be upon you.\n\nHe rejoiced at the arrival of my letter and looked deeply into it and toward it. The contemplation it inspired caused him an illness that was the reason for his departure and the swiftness of his transition. He remained only a few days and then passed away, ascending upon the noblest ascension (معراج) to his goal. I witnessed his death throes in the White House until he passed away. I traveled that very day due to the urgency of my people. This is some of what this station (المنزل) contains of the difficult terrors whose forms are magnified in the Witnessing (الشهود).\n\n### [That Allah mentioned the accounts of past generations so that you may be wary of the causes by which Allah seized them with the overwhelming seizure]\n\nKnow that Allah only mentioned the accounts of past generations (القرون الماضية) so that you may be wary of the causes by which Allah seized them with the overwhelming seizure (أخذته الرابية) and struck them with the severe striking. As for death, it is counted breaths and limited terms. Fear is only of His seizure and His striking, not of meeting Him, for meeting Him delights the friend of God (الولي). Death is the cause of the meeting, so it is the noblest gift bestowed upon the believer. How much more so if he is a Gnostic, saying, \"Bravo! Bravo!\"\n\nThis station (المنزل) also includes the science of the Two Mercies (علم الرحمتين), the science of the proximity of striving (قرب السعي) from the proximity of the span and the cubit (الشبر والذراع), which is the limited proximity, the science of the Sewing and the Unsewing (الرتق والفتق), the science of the Ambiguous (المتشابه) from the Clear (المحكم), the science of Eternity (الأبد), the sciences of proofs (الأدلة), the science of following (الاتباع) and what leads to felicity and what leads to wretchedness, the science of the establishment of matters and the level of the Ruling (الحكم) and the Judge (الحاكم), the science of Fitting Recompense (الجزاء الوفاق), and the science of the news of answering the disliked thing, such as the answering of the children of the mother of Jesus.\n\nAnd the science of Delusion (التلبيس), wherein He grants you your enjoyment from a direction other than the one you know it to be your enjoyment, as a delusion (تلبيسا) upon you. When the veil is lifted and the sight is sharp, you know that He gave you nothing but what was already in your hand. He did not increase you from Himself, nor did He benefit you from what is with Him, except by the change of forms. Whoever attains this knowledge speaks of quenching thirst in his drink. Whoever is deprived of it remains thirsty, even though the water that quenches him is with him, and he does not perceive that it is with him. This is among the noblest knowledge granted to the Gnostics (العارفون بالله). It is like rain for the earth, yet the very essence of what it seeks for quenching is nothing but its own vapor that ascended from it as vapor, then descended to it as rain. Its form changed due to the difference in location. Thus, the earth drank and was quenched only from its own water. If it knew this, the rain clouds (المعصرات) would not veil it.\n\nRealize this type of knowledge in Divine Knowledge (العلم الإلهي): He gave you nothing but from yourself. And what He is upon, none knows of it but Him. Thus, every knower knows from his own self. Therefore, the People of Allah (أهل الله) said: \"None knows Allah but Allah, and none knows the Prophet or the friend of God (الولي) but the friend of God.\"\n\nIt also includes the science of the causes of salvation and felicity, the science of trials (الامتحانات) through hardship and ease for the patient and the grateful, the science of the suitability (المناسبة) by which the one who disobeyed Allah's command did not comply, and whether the one who complied did so by a suitable matter or by the absence of suitability, and the science of the cause of the influence of the lower upon the higher, such as the domination of animals over humans, like the bite of a flea and what is greater than it. And Allah the Exalted said: <<أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ>> (I answer the call of the caller when he calls upon Me). And the science of the sharing of knowledge between animals and humans through Theophany (التجلي), the science of where the one who rejected everything that came to him from the Real rejected it from, and where the one who rejected only part of it rejected it from, and whether the Divine Ruling (الحكم الإلهي) is equal for them or not, the science of why the Companions fled on the Day of Hunayn, the science of the accountability of the higher by the lower when a sign is established by the one who established it, the science of Precedences (السوابق) and Consequences (اللواحق), and the science of Unity (الوحدة) in the essence of Gathering (الجمع), and the science of the Levels (المراتب) and Degrees (الدرجات). And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the truth, and He guides to the way).",
    "ur": "باب نمبر تین سو تیس: ہلال، بدر، اور مقام قمر کی معرفت، جو کہ الحضرة المحمدیۃ (الحضرة المحمدیۃ) سے متعلق ہے۔\n\nنوح اور عاد کو دیکھ اور عبرت حاصل کر،\nصالح اور پھر لوط میں غور و فکر کر۔\n\nاور ان سے ایک شفیق ناصح کی بات کہہ،\nاور انہیں پکار: \"کیا تم میں کوئی نصیحت حاصل کرنے والا ہے؟\" (هَلْ فِيكُمْ مِنْ مُدَّكِرٍ)\n\nاور کائنات (الکون) میں اس کے سوا کوئی ہستی (الوجود) نہیں،\nاور \"نہیں\" میں کوئی مستقل ہستی (الوجود) نہیں۔\n\nپس وہ اس کے لیے ہے، ہمارے لیے نہیں، اور وہ ہمارے لیے ہے،\nاس کے لیے نہیں، کسی بھی مسلسل کونیاتی پہلو سے۔\n\nوہ صورتیں کہاں ہیں جو ہم پر ظاہر ہوئیں،\nجو چلی گئیں اور ان کے بعد دوسری صورتیں آئیں۔\n\nاگر وہ غیب میں چلی جاتیں تو ان کا وجود مٹ جاتا،\nحالانکہ وہ آنکھ اور بصارت کے لیے مشہود (شہود) تھیں۔\n\nیا وہ معدوم ہو جاتیں، اور میں کوئی عدم نہیں دیکھتا\nجو کائنات (الکون) کو قائم رکھے، کائنات (الکون) تو اس کے لیے ظاہر ہوئی۔\n\nاور عدم سے کچھ ظاہر نہیں ہوا، لیکن یہ\nذات حق (الحق) کی کائنات (الکون) سے ہے جو ظاہر ہے اور چھپ نہیں سکتی۔\n\n### [کہ چاند ہلال اور بدر کے مسمیٰ کے درمیان ایک برزخی مقام ہے]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ چاند (القمر) نور کی زیادتی اور کمی کی حالت میں ہلال (الہلال) کے مسمیٰ اور بدر (البدر) کے مسمیٰ کے درمیان ایک برزخی مقام (مقام برزخي) ہے۔ اسے ہلال (الہلال) اس لیے کہا جاتا ہے کہ دونوں اطراف میں اس کے نظر آنے پر آوازیں بلند ہوتی ہیں، اور اسے بدر (البدر) اس لیے کہا جاتا ہے کہ دیکھنے والے کی آنکھ میں اس کا نور اپنی ذات کے اعتبار سے عام ہوتا ہے۔ چاند کے لیے ان دو احکام کے درمیان کوئی اور منزل باقی نہیں رہتی، سوائے اس کے کہ جب وہ سورج کی شعاع کے نیچے آنکھوں کی ادراک سے چھپا ہوتا ہے، جو آنکھوں اور اس کے درمیان حائل ہوتی ہے، تو اسے محاق (محق) کہا جاتا ہے۔ اور جس رخ سے وہ سورج کی طرف ہوتا ہے، وہ بدر (البدر) ہوتا ہے، جیسا کہ جب وہ ہمارے پاس بدر (البدر) ہوتا ہے، تو جس رخ پر سورج ظاہر نہیں ہوتا، وہ محاق (محق) ہوتا ہے۔ اور ان دونوں مقامات کے درمیان، جتنا نور اس میں ظاہر ہوتا ہے، اتنا ہی دوسرے رخ سے کم ہوتا ہے، اور جتنا وہ ایک رخ سے چھپتا ہے، اتنا ہی دوسرے رخ سے نور کے ساتھ ظاہر ہوتا ہے۔ یہ فلکی قوس کے ٹیڑھا ہونے کی وجہ سے ہے۔ پس وہ ہمیشہ بدر (البدر) بھی رہتا ہے اور ہمیشہ محاق (محق) بھی رہتا ہے۔ یہ اس راز کی وجہ سے ہے جسے اللہ نے اللہ کے عارفین (العارفین باللہ) کو بتانا چاہا، چنانچہ اس نے ان کے لیے یہ مثال عمل کے ذریعے قائم کی تاکہ وہ اس میں عبور (عبرت) حاصل کریں اس معرفت کی طرف جس کے لیے یہ مثال نصب کی گئی ہے، یعنی انسان کامل (الإنسان الکامل) کی معرفت اور اللہ کی معرفت، کیونکہ وہ صورت (الصورة) پر موجود ہے اور اس میں اس کے احوال کا بدلنا ان مراتب کے بدلنے کی وجہ سے ہے جن میں وہ ظاہر ہوتا ہے۔\n\nاللہ تعالیٰ نے فرمایا: \"اور چاند کے لیے ہم نے منزلیں مقرر کر دی ہیں\" (والْقَمَرَ قَدَّرْناهُ مَنازِلَ)۔ اور اسے نہ بدر (البدر) کہا اور نہ ہلال (الہلال)، کیونکہ ان دونوں حالتوں میں اس کی صرف ایک ہی منزل ہے، بلکہ دو ہیں۔ پس اس کا قول \"مَنازِلَ\" (منزلیں) صرف چاند (القمر) پر ہی صادق آتا ہے۔ چاند کے لیے قربت اور نزول کے درجے ہیں، اور اس کے لیے غیب (الغیب) کی حضرة (حضور) میں داخل ہونے اور شہادت (الشہادة) کی حضرة (حضور) میں نکلنے میں زیادتی اور کمی کا اختیار ہے۔\n\nپھر اللہ تعالیٰ نے اس کی صفت انشقاق (پھٹنا) سے بیان کی، جو انسان کامل (الإنسان الکامل) کا صورت الٰہیہ (الصورة الإلهية) کے ساتھ ظاہر ہونا ہے، پس وہ اس کے لیے ایک شق (حصہ) تھا۔ چنانچہ اس کا دو چیزوں میں ظاہر ہونا چاند کا دو ٹکڑوں میں پھٹ جانا ہے۔\n\nصاحب (رسول اللہ ﷺ) سے روایت میں آیا ہے کہ چاند رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کے زمانے میں عرب کے ایک گروہ کے سوال پر پھٹ گیا کہ ان کے لیے آپ کی سچائی پر کوئی نشانی ہو۔ پس وہ پھٹ گیا، تو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے حاضرین سے فرمایا: \"گواہ رہو۔\"\n\nاور اللہ تعالیٰ نے فرمایا: \"قیامت قریب آ گئی اور چاند پھٹ گیا\" (اقْتَرَبَتِ السَّاعَةُ وانْشَقَّ الْقَمَرُ)۔\n\nپس یہ معلوم نہیں کہ کیا اس سے مراد وہ انشقاق ہے جس کے بارے میں سوال کیا گیا تھا، اور یہی آیت سے ظاہر ہوتا ہے، کیونکہ انشقاق کے بعد اللہ نے فرمایا: \"اور اگر وہ کوئی نشانی دیکھتے ہیں تو منہ پھیر لیتے ہیں اور کہتے ہیں کہ یہ تو ہمیشہ سے چلا آ رہا جادو ہے\" (وإِنْ يَرَوْا آيَةً يُعْرِضُوا ويَقُولُوا سِحْرٌ مُسْتَمِرٌّ)۔ اور جب انہوں نے یہ دیکھا تو ان کی طرف سے یہی بات واقع ہوئی۔ اسی لیے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے حاضرین سے فرمایا: \"گواہ رہو،\" کیونکہ جو انہوں نے مانگا تھا وہ واقع ہو گیا۔ اور ان کے لیے وہی ہے جو ظاہر ہوا، اور کیا یہ وہی ہے جو نفس الامر میں واقع ہوا یا دیکھنے والے کی نظر میں؟ یہ ضروری نہیں، کیونکہ احتمال اس وقت تک ختم نہیں ہوتا جب تک خبر دینے والا یہ نہ بتا دے کہ یہ نفس الامر میں ویسا ہی ہے جیسا آنکھ میں ظاہر ہوا۔ اور خبر دینے والے کا قول ہی محل نزاع ہے۔ اور انہوں نے اپنے سوال میں یہ شرط نہیں رکھی تھی کہ جب وہ چیز واقع ہو جائے جس کا انہوں نے سوال کیا ہے تو ان کی طرف سے وہ اعتراض ظاہر نہ ہو جو ظاہر ہوا۔ پس نبی صَلَّى اللهُ عَليهِ وسَلَّم پر اس سے زیادہ لازم نہیں تھا جو سوال میں واقع ہوا۔ پھر لوگ اطراف عالم سے آ کر خبر دینے لگے کہ اس رات چاند پھٹ گیا تھا۔ اسی لیے اللہ تعالیٰ نے ان کے بارے میں فرمایا کہ انہوں نے اسے \"ہمیشہ سے چلا آ رہا جادو\" (سِحْرٌ مُسْتَمِرٌّ) کہا۔\n\nتو اللہ نے فرمایا: \"ہر معاملہ ٹھہرا ہوا ہے\" (كُلُّ أَمْرٍ مُسْتَقِرٌّ)۔ وہ معاملہ جو بھی تھا۔ اگر چاند (القمر) برزخی مرتبے کا نہ ہوتا تو وہ ہلال (الإهلال)، بدر (الإبدار)، محاق (المحق) اور سرار (چھپنے) کو قبول نہ کرتا۔ پس سحر مستمر (سِحْرٌ مُسْتَمِرٌّ) ہر ٹھہرے ہوئے معاملے (كُلُّ أَمْرٍ مُسْتَقِرٌّ) کے حکم کے تحت داخل ہے۔ یہ حق (الحق) کے ساتھ انشقاق ہے اور علم (العلم) کی عین میں جہالت ہے، اور یہی اس کا قول ہے: \"یہ ان کے علم کی انتہا ہے\" (ذلِكَ مَبْلَغُهُمْ من الْعِلْمِ)۔ پس اس نے اسے علم ثابت کیا۔\n\nاور جان لیجیے کہ نظر اور اعتبار (عبرت حاصل کرنا) ان علوم میں سے ہیں جو اسرار (الأسرار) اور انوار (الأنوار) سے ظاہر ہوتے ہیں۔ پس نور بصارت (البصر) اور بصارتوں (الأبصار) کے لیے ہے۔ چنانچہ جب اللہ نے اس مقام کا ذکر کیا تو فرمایا: \"پس اے بصیرت والو! عبرت حاصل کرو\" (فَاعْتَبِرُوا يا أُولِي الْأَبْصارِ)۔ یعنی جو کچھ بصارت نے اپنے نور کے ذریعے مبصرات (دیکھی جانے والی چیزوں) اور ان کے احکام سے ادراک کیا ہے، اس سے عبور کر کے اپنی بصیرتوں (بصائركم) کی آنکھ سے ادراک کرو، جو کہ شہود (الشہود) ہے اور یہ اتم اور قویٰ ہے، یا فکر کے ذریعے، جو کہ اعلیٰ مرتبے سے ادنیٰ شہود (الشہود الأدنى) ہے۔ اور یہ دونوں اس چیز سے عبور کرنے والے ہیں جو ظاہر ہوا اس کی طرف جو پوشیدہ اور باطن ہے۔ پس یہ \"غور و فکر کرنے والی قوم کے لیے نشانیاں\" (آيات لِقَوْمٍ يَتَفَكَّرُونَ) ہیں، جیسا کہ یہ \"تقویٰ اختیار کرنے والی قوم کے لیے نشانیاں\" (آيات لِقَوْمٍ يَتَّقُونَ) ہیں۔ متقی (المتقي) کی تعلیم کا ذمہ اللہ خود لیتا ہے، لہٰذا اس کے علم میں کوئی شک یا شبہ داخل نہیں ہوتا۔ اور متفکر (غور و فکر کرنے والا) ایک مخلوق قوت پر نظر کرتا ہے، پس وہ درست بھی ہوتا ہے اور غلط بھی۔ اور جب وہ درست ہوتا ہے تو اس قوت کی وجہ سے اس پر شبہات داخل ہونے کا امکان رہتا ہے جس نے اسے درستی عطا کی، کیونکہ راستے مختلف ہیں۔ پس متقی (المتقي) صاحب بصیرت (بصيرة) ہے، اور متفکر (المتفكر) بصارت (البصر) اور بصیرت (البصيرة) کے درمیان ہے، نہ وہ بصارت کے ساتھ باقی رہا اور نہ ہی بصیرت کے لیے خالص ہوا۔\n\nپس ہم اس منزل میں اس کے دیگر منازل کی طرح ایک مسئلہ ذکر کرتے ہیں۔ یہ ایک شریف اور بلند منزل ہے جسے راہ سلوک میں منزل النور (منزل النور) کہا جاتا ہے، کیونکہ اللہ نے اسے نور (نور) بنایا اور اسے سراج (چراغ) نہیں بنایا، کیونکہ سراج (چراغ) کو روشنی باقی رکھنے کے لیے تیل کی مدد کی ضرورت ہوتی ہے۔ اسی لیے رسول (ﷺ) \"روشن چراغ\" (سِراجاً مُنِيراً) تھے، اس الٰہی امداد کی وجہ سے جو وحی ہے، اور اسے \"روشن\" (مُنِيراً) بنایا، یعنی نور والا، کیونکہ اس میں اس امداد کو قبول کرنے کی استعداد تھی، جیسے بتی کے سرے پر موجود آگ جس سے دھواں نکلتا ہے، جس میں نور سراج (چراغ) کی بتی کے سرے پر نازل ہوتا ہے، تو وہ بھی اسی طرح سراج (چراغ) کی طرح ظاہر ہوتا ہے۔ اور نور (النور) اسماء الٰہیہ (الأسماء الإلهية) میں سے ہے، جبکہ سراج (السراج) ان میں سے نہیں، کیونکہ وہ اپنا نور کسی چیز سے حاصل نہیں کرتا۔ پس آپ نے اس اعتبار سے چاند (القمر) کا سورج (الشمس) سے مرتبہ جان لیا۔ اللہ تعالیٰ نے فرمایا: \"اور ان میں چاند کو نور بنایا اور سورج کو چراغ بنایا\" (وجَعَلَ الْقَمَرَ فِيهِنَّ نُوراً وجَعَلَ الشَّمْسَ سِراجاً)۔ پس سراج (چراغ) کا نور مقید ہے، اور قمری نور مطلق ہے۔ اسی لیے اسے نکرہ (عام) لایا گیا تاکہ وہ تمام انوار کو شامل ہو جائے۔ پس ہر سراج (چراغ) نور ہے، لیکن ہر نور سراج (چراغ) نہیں۔\n\n### [کہ علم مطلق دو قسموں میں تقسیم ہوتا ہے]\n\nاور جان لیجیے کہ صورت (الصورة) کے ساتھ متحقق ہونے کے علم میں سے یہ ہے کہ علم مطلق (العلم المطلق)، معلومات (المعلومات) سے متعلق ہونے کے لحاظ سے، دو قسموں میں تقسیم ہوتا ہے: ایک وہ علم جو کائنات (الکون) اللہ سے تقویٰ (التقوى) کے ذریعے حاصل کرتی ہے، اور یہی اس کا قول ہے: \"اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) بنا دے گا\" (إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً)، اور خضر (علیہ السلام) کے بارے میں اس کا قول: \"اور ہم نے اسے اپنے پاس سے علم سکھایا تھا\" (وعَلَّمْناهُ من لَدُنَّا عِلْماً)۔ اور دوسرا وہ علم جو اللہ کائنات (الکون) سے حاصل کرتا ہے جب وہ اسے تکلیف (التکلیف) کے ذریعے آزماتا ہے، جیسے اس کا قول: \"اور ہم تمہیں ضرور آزمائیں گے یہاں تک کہ ہم جان لیں\" (ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ)۔\n\nاگر صورت (الصورة) میں اشتراک نہ ہوتا تو وہ اپنے اوپر وہ حکم نہ لگاتا جو اس نے اپنی مخلوق پر لگایا ہے، یعنی علم کے تعلق کا حادث ہونا۔ پس اگر انسان حق (الحق) کی صورت میں ظاہر ہو تو اس کے لیے حق (الحق) کا حکم ہوتا ہے، پس حق (الحق) اس کی سماعت اور بصارت بن جاتا ہے، تو وہ حق (الحق) کے ذریعے سنتا ہے، پس کوئی مسموع اس سے فوت نہیں ہوتا، اور حق (الحق) کے ذریعے دیکھتا ہے، پس کوئی مبصر اس سے فوت نہیں ہوتا، خواہ وہ مبصر عدم ہو یا وجود۔ اور اگر حق (الحق) انسان کی صورت میں ظاہر ہو، اس حال میں کہ انسان حق (الحق) کی صورت میں نہ ہو، تو اللہ پر وہی حکم ہوتا ہے جو اس انسان کی صورت پر ہوتا ہے جس میں حق (الحق) کی صورت نہیں ہوتی۔ پس اس کی طرف وہ چیزیں منسوب کی جاتی ہیں جو اس صورت کی طرف منسوب کی جاتی ہیں، جیسے حرکت، انتقال، بوڑھا ہونا، جوان ہونا، غصہ، رضا، خوشی اور مسرت۔\n\nاور ان دونوں علوم کے معاملے میں جو کچھ ہم نے بیان کیا، اسی کی وجہ سے اللہ نے ہستی (الوجود) میں دو کتابیں بنائیں: ایک کتاب جسے اس نے \"ام\" (الأم) نام دیا، جس میں وہ سب کچھ ہے جو اس کے ایجاد سے پہلے تھا اور جو کچھ ہو گا، جسے اس نے اسم المقیت (المقيت) کے حکم سے لکھا۔ یہ ایک معلوم قدر والی کتاب ہے جس میں ممکنات (الممکنات) کے بعض اعیان اور جو کچھ ان سے وجود میں آئے گا، وہ شامل ہے۔ اور دوسری کتاب جس میں صرف وہ چیزیں ہیں جو خاص طور پر مکلفین (التکلیف والے) سے وجود میں آتی ہیں۔ اس میں کتابت اس وقت تک جاری رہتی ہے جب تک تکلیف (التکلیف) باقی ہے۔ اور اسی کے ذریعے اللہ کی حجت مکلفین پر قائم ہوتی ہے، اور اسی کے ذریعے وہ ان سے مطالبہ کرتا ہے، نہ کہ \"ام\" (الأم) کے ذریعے۔\n\nاور یہی وہ امام الحق المبین (حق واضح پیشوا) ہے جس کے ذریعے حق تعالیٰ حکم فرماتا ہے، جس کے بارے میں اللہ نے ہمیں اپنی کتاب میں خبر دی کہ اس نے اپنے نبی کو حکم دیا کہ وہ اپنے رب سے کہیں: \"حق کے ساتھ فیصلہ فرما\" (احْكُمْ بِالْحَقِّ)۔ اس سے مراد یہی کتاب ہے، جو کتاب الاحصاء (شمار کرنے والی کتاب) ہے۔ پس \"وہ نہ چھوٹی چیز چھوڑتی ہے اور نہ بڑی مگر اسے شمار کر لیتی ہے\" (لا يُغادِرُ صَغِيرَةً ولا كَبِيرَةً إِلَّا أَحْصاها)، اور \"ہر چھوٹی اور بڑی چیز لکھی ہوئی ہے\" (وكُلُّ صَغِيرٍ وكَبِيرٍ مُسْتَطَرٌ)۔ اور یہ \"ام\" (الأم) میں منصوص ہے، جو کہ زبر (الزبر) ہے، اور اس کا معنی کتابت (لکھنا) ہے، اگرچہ کتابوں کی اقسام بہت ہیں جن کا ذکر ہم نے مواقع النجوم میں کیا ہے، لیکن وہ ان دو کتابوں کی طرف ہی لوٹتی ہیں۔\n\nاور ان دو کتابوں کے ایجاد کا سبب یہ ہے کہ اس نے ہر چیز کے جوڑے بنائے، پس اس نے دو کتابیں بھی بنائیں۔ دوسری کتاب کی وجہ سے حق (الحق) کو خبیر (الخبير) کہا جاتا ہے، اور \"ام\" (الأم) کی وجہ سے علیم (العليم) کہا جاتا ہے۔ پس وہ اول (پہلی کتاب) کے ساتھ علیم (العليم) ہے اور ثانی (دوسری کتاب) کے ساتھ خبیر (الخبير)، اگر تم عقل کرو۔\n\nپس قضا (القضاء) جو معاملات میں نافذ ہوتی ہے، وہ اشیاء پر اللہ کا حکم ہے کہ وہ ایسا ہو، اور قدر (القدر) وہ ہے جو کسی معین موجود میں اس کے وجود کے ساتھ واقع ہوتی ہے، جس کی مصلحت اس موجود کے علاوہ دوسروں تک بھی پہنچتی ہے، جیسے اس کا قول: \"اور اگر اللہ اپنے بندوں کے لیے رزق کشادہ کر دیتا تو وہ زمین میں سرکشی کرتے\" (ولَوْ بَسَطَ الله الرِّزْقَ لِعِبادِهِ لَبَغَوْا في الْأَرْضِ)۔ پس اگر کشادگی کی وجہ سے سرکشی (البغي) پائی جاتی تو ان پر حجت قائم نہ ہوتی، \"لیکن وہ ایک اندازے کے ساتھ نازل کرتا ہے جو وہ چاہتا ہے\" (ولكِنْ يُنَزِّلُ بِقَدَرٍ ما يَشاءُ)۔ پس اس نے کوئی چیز نازل نہیں کی مگر ایک معلوم اندازے (قدر) کے ساتھ، اور کوئی چیز پیدا نہیں کی مگر ایک اندازے (قدر) کے ساتھ۔ پس جب قدر (القدر) کے ساتھ سرکشی (البغي) پائی گئی تو مخلوق پر حجت قائم ہو گئی، کیونکہ انہوں نے اپنے پاس موجود چیز سے دوسروں کو روکا، حالانکہ انہیں خود کفایت حاصل تھی۔ پس جو کچھ زیادہ ہوا، وہ معلوم ہوا کہ وہ کسی دوسرے کی مصلحت کے لیے ہے، اور یہ اس کا فضل ہے کہ اس نے اسے قرض بنا دیا۔ اور قرض اس چیز میں واقع نہیں ہوتا جو اس کا اپنا رزق ہو، جو اس کے وجود کو قائم رکھنے کے لیے ہو۔ اور اس نے اس فعل کو بندوں کی مصلحتوں میں سے بنا دیا، پس اس نے \"ان میں سے بعض کو بعض پر درجات میں بلند کیا تاکہ ان میں سے بعض دوسروں کو خدمت میں لے آئیں\" (لِيَتَّخِذَ بَعْضُهُمْ بَعْضاً سُخْرِيًّا)۔\n\nاور جب اللہ سبحانہ و تعالیٰ نے اپنے آپ کو اپنے بندوں کے مقام پر اتارا تو ان پر ان کے احکام نافذ کیے، پس اس نے ان میں ان کے ذریعے ہی حکم فرمایا۔ اور یہ ان پر اس کی حجت بالغہ (کامل دلیل) میں سے ہے، اور یہی اس کا قول ہے: \"بدلہ موافق\" (جَزاءً وِفاقاً)، \"اس بدلے میں جو وہ کرتے تھے\" (جَزاءً بِما كانُوا يَعْمَلُونَ)، \"اس بدلے میں جو وہ کماتے تھے\" (جَزاءً بِما كانُوا يَكْسِبُونَ)۔ پس ان کے اعمال نے ہی انہیں عذاب دیا اور ان کے اعمال نے ہی انہیں نعمت دی۔ پس ان میں کسی اور نے حکم نہیں فرمایا۔ لہٰذا وہ اپنے آپ کو ہی ملامت کریں گے، جیسا کہ اللہ نے شیطان کے قول میں ہمیں بتایا جب \"معاملہ طے ہو چکا\" (لَمَّا قُضِيَ الْأَمْرُ): \"بے شک اللہ نے تم سے سچا وعدہ کیا تھا اور میں نے تم سے وعدہ کیا اور خلاف ورزی کی، اور میرا تم پر کوئی زور نہیں تھا\" (إِنَّ الله وَعَدَكُمْ وَعْدَ الْحَقِّ ووَعَدْتُكُمْ فَأَخْلَفْتُكُمْ وما كانَ لِي عَلَيْكُمْ من سُلْطانٍ)، یعنی نہ کوئی قوت، نہ حجت، نہ دلیل، \"سوائے اس کے کہ میں نے تمہیں بلایا تو تم نے میری بات مان لی\" (إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي)۔ اور یہ ضروری نہیں کہ ہر پکارنے والے کی بات مانی جائے۔ اسی لیے معجزات رسولوں کی دعوت کی سچائی کی گواہی دیتے تھے کہ وہ اللہ کی دعوت ہے۔ اور شیطان نے جب انہیں بلایا تو ان کے لیے کوئی دلیل قائم نہیں کی، اور یہی اس کا قول ہے: \"اور میرا تم پر کوئی زور نہیں تھا\" (وما كانَ لِي عَلَيْكُمْ من سُلْطانٍ)۔ پس تعجب ہے کہ لوگوں نے حق (الحق) کی دعوت کا انکار کیا، باوجود اس کے کہ دلیل ظاہر تھی، اور اس کا کفر کیا، اور شیطان کی دعوت کو قبول کیا جو دلیل سے خالی تھی۔ پس اس نے ان سے کہا: \"پس مجھے ملامت نہ کرو اور اپنے آپ کو ملامت کرو\" (فَلا تَلُومُونِي ولُومُوا أَنْفُسَكُمْ)۔ یہ اس کی نظر اس دوسری کتاب (کتاب الاحصاء) کے حکم کی طرف تھی جس کے ذریعے ان پر حجت قائم ہوتی ہے۔ اگر وہ پہلی \"ام\" (الأم) اور \"زبر\" (الزبر) کی طرف دیکھتا تو ان سے یہ نہ کہتا کہ \"اپنے آپ کو ملامت کرو\" (ولُومُوا أَنْفُسَكُمْ)۔\n\nپس قضا (القضاء) پہلی کتاب کے لیے ہے، اور دوسری کتاب کا حکم اسے طلب کرتا ہے، اور قدر (القدر) دوسری کتاب کے ساتھ ہے۔ اور دونوں کتابیں محدود ہیں کیونکہ وہ موجود ہیں۔ اور اشیاء میں اللہ کا علم نہ کسی لکھی ہوئی کتاب میں محدود ہوتا ہے، نہ کسی کھلے ہوئے صحیفے میں سما سکتا ہے، نہ لوح محفوظ (لوح محفوظ) میں، اور نہ ہی اسے قلم اعلیٰ (قلم أعلى) لکھ سکتا ہے۔ پس \"اسی کے لیے حمد ہے دنیا اور آخرت میں، اور اسی کا حکم ہے، اور اسی کی طرف تم لوٹائے جاؤ گے\" (لَهُ الْحَمْدُ في الْأُولى‏ والْآخِرَةِ ولَهُ الْحُكْمُ وإِلَيْهِ تُرْجَعُونَ)۔ یعنی حکم (الحکم) کی طرف، جو کہ قضا (القضاء) ہے۔ پس \"إِلَيْهِ\" (اس کی طرف) میں ضمیر حکم (الحکم) کی طرف لوٹتی ہے، کیونکہ وہ قریب ترین مذکور ہے، اور قریب ترین کو چھوڑ کر بعید کی طرف لوٹنا اور قریب کو نظر انداز کرنا قرینہ حال کے بغیر نہیں ہوتا۔ یہ اس زبان سے معلوم ہے جس میں قرآن نازل ہوا۔ پس قضا (القضاء) قدر (القدر) پر حکم کرتی ہے، اور قدر (القدر) کا قضا (القضاء) میں کوئی حکم نہیں، بلکہ اس کا حکم صرف مقدر (اندازہ کی گئی چیز) میں ہے، قضا (القضاء) کے حکم سے۔ پس قاضی (القاضي) حاکم ہے اور مقدر (المقدر) وقت مقرر کرنے والا ہے۔ پس قدر (القدر) اشیاء میں توقیت (وقت مقرر کرنا) ہے، جو اس کے اسم المقیت (المقيت) سے ہے۔ اللہ تعالیٰ نے فرمایا: \"اور اللہ ہر چیز پر نگہبان ہے\" (وكانَ الله عَلى‏ كُلِّ شَيْ‏ءٍ مُقِيتاً)۔\n\nاور میں نے اس منزل کا شہود (شہود) قونیہ میں ایک ایسی رات میں کیا جو مجھ پر اس سے زیادہ سخت نہیں گزری، حکم کے نفاذ، اس کی قوت اور اس کے تسلط کی وجہ سے۔ پس میں نے اللہ کا شکر ادا کیا کہ وہ صرف اسی رات تک محدود رہا اور یہ حکم دائمی نہیں تھا، بلکہ یہ ایک مقدر (اندازہ کی گئی چیز) کے وقوع کا حکم تھا۔ جب مجھے میری حالت پر واپس لایا گیا اور میں نے اپنے ہاتھ میں گراوٹ محسوس کی، اور میں نے جان لیا کہ اللہ نے مجھ پر کیا نازل کیا اور حق (الحق) نے میرے پاس کیا مقدر کیا، اور میں نے اس کی قضا (القضاء) اور قدر (القدر) میں فرق کیا، تو میں نے اس کے بارے میں اپنے ایک بھائی فی اللہ کو لکھا، اللہ ان پر رحم فرمائے، تاکہ میں انہیں اس واقعے سے آگاہ کروں، جیسا کہ بھائیوں کے درمیان رواج ہے۔ کیونکہ ان کا خط میرے پاس آیا تھا جس میں انہوں نے مجھ سے میرے احوال کی وضاحت طلب کی تھی، اور یہ حال اسی وقت واقع ہوا۔ پس میں نے فوراً انہیں لکھا:\n\nبسم اللہ الرحمن الرحیم۔ مولیٰ کا خط آیا ہے، جو اپنے ولی سے اس حال کی وضاحت پوچھتا ہے جس کا وہ زیادہ حقدار ہے، تاکہ وہ اس کے حکم کے مطابق ہو جو اس پر وارد ہوتا ہے۔\n\nشہاب الدین، اے مولیٰ کے مولیٰ!\nتو نے میرے حال کی وضاحت کے لیے توجہ سے پوچھا ہے۔\n\nمیں وہ ہوں جسے موالی (آقاؤں) کے درمیان سے دھتکارا گیا،\nاور مجھ جیسا ہی وصل (الوصال) سے روکا جاتا ہے۔\n\nمیں نے ایک شیشے کی نافرمانی کی اور اپنی قدر سے ناواقف رہا،\nپس اب میں قیمتی چیزوں کی حد تک فرمانبردار ہوں۔\n\nمیں ہجر کے تیروں سے مارا گیا یہاں تک کہ\nتیروں پر تیر پیوست ہو گئے۔\n\nپس وہ مجھے اپنے تیروں سے مارتا ہے، تو میں اس کے پاس\nمردوں کے فعل کی طرح آتا ہوں۔\n\nمیں اس کے دروازے پر کھڑا ہو کر شکایت کرتا اور روتا ہوں،\nجیسے کوئی اپنے واحد مولیٰ کو کھو کر روتا ہے۔\n\nاور میں نے آنسوؤں اور غمگین آہ کے ساتھ کہا:\nمیں وہ ہوں جسے موالی کے درمیان سے دھتکارا گیا۔\n\nمیں وہ بندہ ہوں جس نے اپنے رب کا حق ضائع کیا،\nپس اے ذوالجلال! تو مجھے کیسے ضائع کر سکتا ہے؟\n\nاور بے شک عمدہ اخلاق آپ ہی کی طرف سے ہیں،\nاور بے شک معافی کرم کی خصلتوں میں سے ہے۔\n\nاور کیا جالینوس کی کتابیں اس لیے شائع نہیں ہوئیں\nکہ وہ لاعلاج بیماری کو دور کر سکیں؟\n\nاور تیروں کو سیدھا کرنے والا انہیں ذخیرہ کرتا ہے\nجنگ کے دن کی ناپسندیدہ صورتحال کے خوف سے۔\n\nاگر غلام برے غلام ہوں،\nتو فضل آقاؤں کی خصلتوں میں سے ہے۔\n\nاور میرا عہد اپنی جان کی سزا کو قبول کرنے کا تھا،\nپس میں تیرے سامنے گمراہی میں کیوں کھڑا رہا؟\n\nاگر مجھ سے میری عاجزی اور کمزوری کے بارے میں پوچھا جاتا،\nتو میں کہتا کہ تم نے محال کو فرض کر دیا۔\n\nاور اب میں اپنی عاجزی کی حالت میں کھڑا ہوں،\nکمزور، جیسے پردہ نشین عورتیں۔\n\nمیں نے اس کی طرف اپنا حسن ظن بھیجا،\nاور سوال میں بہت زیادہ اصرار کیا۔\n\nاور اگرچہ طبائع بری ہوں،\nتو حسن ظن کرم کی خصلتوں میں سے ہے۔\n\nاور میری امید نے تیرے جود و کرم کو متحقق کر لیا،\nاور اس تحقق کے بعد میں کوئی پرواہ نہیں کرتا۔\n\nمیں نے جان لیا کہ اگر میرا گناہ بلند بھی ہو جائے،\nتو وہ تیرے عفو کے مقابلے میں پست ہے۔\n\nمیرے علم سے پہلے تیری مہربانی میرے لیے تاج تھی،\nتو حق کے علم کے بعد جوتوں کی طرح ہے۔\n\nتو نے میری تائید کی اور میری کمر مضبوط کی،\nاس توحید (التوحید) کے ساتھ جو بیان سے بلند ہے۔\n\nاے میرے رب! تو نے ولید کی حفاظت سے مجھ پر احسان کیا،\nجس سے میں نے برے افعال کو دور کر دیا۔\n\nمیں اس جمال (الجمال) کا مشاہدہ کرتا ہوں جس کا میں مشاہدہ کرتا ہوں،\nجو خیال (الخیال) کے مکاشفہ سے پاک ہے۔\n\nاور ان مقید صورتوں سے بلند ہے،\nجو مثالی (المثالي) میں متحقق مثال سے بلند ہے۔\n\nپس میں اس کا شہود (شہود) کرتا ہوں اور وہ میرا شہود کرتا ہے، تو میں فنا (الفناء) ہو جاتا ہوں،\nکمال میں کمال، کمال میں کمال۔\n\nاور اس کے مشاہدے کے لیے مجھے ایک راحت ملتی ہے،\nجیسے قیدی زنجیر سے آزاد ہو کر چست ہو جاتا ہے۔\n\nپس میرے سوا کوئی حسن سے لذت نہیں پاتا،\nحسن عنایت اور حال کی درستی کی وجہ سے۔\n\nمیں نے ہلالوں کو دیکھا جو سورج بن کر طلوع ہوئے،\nاور سورج کا نور ہلال کے نور کے مقابلے میں کیا ہے؟\n\nپس میں نے اندھیرے کو بھگا دیا، تو نہ کوئی اندھیرا رہا،\nاور نہ ہی جدائی کے دن تک کوئی رات۔\n\nعنایت نے میرے جسم کی رات کو اتار دیا،\nجیسے دن کو راتوں سے اتارا جاتا ہے۔\n\nپس محو (المحو) جدائی کا اثبات تھا،\nاور نور (النور) میرے اتصال (الاتصال) کی نشانیاں تھا۔\n\nاور وصل (الوصل) کے بعد، میری بات سنو،\nاس نے مجھے سجدہ کرنے کے لیے بلایا، سایوں کے ساتھ۔\n\nاور جب آپ کے ولی نے اپنے راستے میں اٹھنے کا ارادہ کیا اور اپنے تحقق (تحقیق) میں اس مقام تک پہنچنے کا ارادہ کیا جس پر وہ تھا، تو آپ کے ولی کے سامنے ایک سخت گھاٹی حائل ہو گئی، جو اس کے اور شہود (الشہود) کے درمیان اور مقصود تک پہنچنے اور حقائق الوجود (حقائق الوجود) کے ساتھ متحقق ہونے کے درمیان رکاوٹ بن گئی۔ پس مجھے خوف ہوا کہ کہیں یہ قضا (القضاء) کی گھاٹی نہ ہو، کیونکہ اس کی تلوار میں تیزی ہے۔ پس میں نے اسے ایک مشکل چڑھائی پایا جو میرے اور اس ملاقات کے درمیان حائل تھی جو میں چاہتا تھا۔ پس میں اس کے سامنے ایک ایسی رات میں کھڑا رہا جس کی صبح طلوع نہیں ہوئی تھی اور میں اس کے اندر کے معاملے کو نہیں جانتا تھا۔ پس میں نے اعتصام (پکڑنے) کی رسی اور اسلام کی مضبوط کڑی (العروة الوثقى) کو تھامنے کی کوشش کی۔ پس مجھے پکارا گیا کہ جب تک تم باقی ہو، طلب کو لازم پکڑو۔ پس میں نے جان لیا کہ میں اس خطاب کے ذریعے ایک مثالی صورت میں ہوں جو خیالی حضرة (حضرة خيالية) میں متجلی (ظاہر) ہوئی ہے، اور یہ کہ ہیکل (جسم) کے تدبیر کا تعلق منقطع نہیں ہوا اور اس میں اس کا حکم بلند نہیں ہوا۔ پس میں اپنے احساس کی طرف لوٹنے پر اپنی مفلسی کے زائل ہونے پر خوش ہوا۔ پس میں نے جو شہود کیا اسے نظم کیا اور اپنے ولی کو اپنے نظم میں کچھ ان چیزوں سے مخاطب کیا جو میں نے پائیں۔ پس جب میرا ولی اسے دیکھے تو اس پر بھروسہ کرے اور اللہ کی خفیہ تدبیر (مکر اللہ) سے بے خوف ہونے سے بچے، کیونکہ \"اللہ کی خفیہ تدبیر سے صرف نقصان اٹھانے والے لوگ ہی بے خوف ہوتے ہیں\" (فَلا يَأْمَنُ مَكْرَ الله إِلَّا الْقَوْمُ الْخاسِرُونَ)۔ پس سنو، اللہ تمہیں ہدایت دے، جو کچھ میری زبان پر پکارا گیا:\n\nمیرے راستے میں ایک گھاٹی حائل ہو گئی،\nسفر کے بیچ میں۔\n\nفاس نے ان لوگوں کے لیے آزمائشیں ظاہر کیں،\nجنہوں نے سرکشی کی یا کفر کیا۔\n\nاس کے نیچے جہنم ہے،\nجو چیخنے اور بھڑکنے والی ہے۔\n\nوہ غصے سے مجرموں کے چہروں پر،\nچنگاریاں پھینکتی ہے۔\n\nاس کے سمندر بھڑکا دیے گئے،\nاور اس کی چھت پھٹ گئی۔\n\nاور اس کا سورج لپیٹ دیا گیا،\nاور اس کے ستارے بے نور ہو گئے۔\n\nمیں تمہارے پاس آیا ہوں تمہیں خبر دینے،\nتاکہ تم خبر کا معنی جان لو۔\n\nاور ان لوگوں کی طرح نہ کہو جنہوں نے کہا:\n\"پس ڈرانے والے کیا فائدہ دیں گے؟\" (فَما تُغْنِ النُّذُرُ)۔\n\nپس ان کا معاملہ وہی ہوا،\nجو تم نے سنا اور یاد کیا۔\n\nانہوں نے کہا، حالانکہ تمہیں پکارنے والے نے بلایا تھا،\n\"ایک ناگوار چیز کی طرف\" (الدَّاعِ إِلى‏ شَيْ‏ءٍ نُكُرٍ)۔\n\nپس وہ نکلیں گے، جھکی ہوئی نگاہوں کے ساتھ،\nجیسے پھیلی ہوئی ٹڈیاں۔\n\nبکھرے بالوں والے، ننگے پاؤں، بے لباس،\nایک \"مسلسل نحوست کے دن\" (يَوْمِ نَحْسٍ مُسْتَمِرٍّ) میں۔\n\nعذاب اور ہلاکت کی طرف،\nسقر (جہنم) میں ہمیشہ رہنے کی طرف۔\n\nاگر تم ان کے نبی کو دیکھتے،\nجب اس نے انہیں بلایا تو وہ جھڑکا گیا۔\n\nاور اس کے رسول نے دعا کی:\n\"میں کمزور ہوں، پس میری مدد فرما\" (إِنِّي ضَعِيفٌ فَانْتَصِرْ)۔\n\nپس اس نے کہا: \"اے آنکھ! برس جا،\"\n\"اور اے زمین! پھٹ جا۔\"\n\nیہاں تک کہ پانی ایک حکیمانہ حکم پر،\n\"جو مقدر ہو چکا تھا\" (قَدْ قُدِرَ) مل گیا۔\n\nپس اس کی موجیں ٹکرائیں،\nاور وہ بھرا ہوا سمندر تھا۔\n\nپس حکم فیصلہ کن ہے،\nاور معاملہ ٹھہرا ہوا ہے۔\n\nاور اس کا حکم ایک ہی ہے،\nجیسے پلک جھپکنا۔\n\nایک کشتی جو نجات کی تختیوں،\nاور کیلوں سے بنی تھی۔\n\nوہ اس کی حفاظت کی آنکھ میں چلتی ہے،\nاور ان کے لیے جو \"کفر کرتے تھے\" (لِمَنْ كانَ كُفِرَ) کے خلاف۔\n\nاسے روحیں ایک قادر مطلق بادشاہ کے حکم سے،\nچلاتی ہیں۔\n\nجود و کرم نے اسے جودی پہاڑ پر اتارا،\nتو انہوں نے کہا: \"کوئی بوجھ نہیں\" (لا وزر)۔\n\nحق (الحق) نے انہیں پکارا: \"اس سے نکل آؤ،\"\n\"میں ہی بوجھ کی عین ہوں۔\"\n\nوہ اترے اور کہا: \"اے ہمارے رب!\nتیرے پاس بہترین ٹھکانہ ہے۔\"\n\n\"اور اے آسمان! رک جا،\"\n\"اس برسنے والے پانی سے۔\"\n\n\"اور اے زمین! اپنا پانی نگل لے،\"\n\"اور اسے ذخیرہ کر لے اور محفوظ کر لے\"۔\n\nمعاملہ طے ہو چکا، پس جو دشمن تھا وہ مٹ گیا۔\nمیں نے اسے تمہارے لیے ایک نصیحت کے طور پر چھوڑا،\n\"پس کیا کوئی نصیحت حاصل کرنے والا ہے؟\" (فَهَلْ من مُدَّكِرٍ)۔\n\nاور جو کچھ تم میں سے ہوا اور ہو گا،\nوہ سب لکھا ہوا ہے۔\n\nاور جو کچھ وہ کائنات (الکون) میں کرتا ہے،\nخیر اور شر میں سے۔\n\nوہ مقدر (اندازہ کیا گیا) اور موقت (وقت مقرر کیا گیا) ہے،\nاسی طرح ہمارے پاس زبر (الزبر) میں آیا ہے۔\n\nموت زہر قاتل ہے،\nاور حشر \"زیادہ سخت اور کڑوا\" (أَدْهى‏ وأَمَرُّ) ہے۔\n\nتمہاری کشتیاں تمہارے اجسام ہیں،\nایک بھرے ہوئے دنیا کے سمندر میں۔\n\nاور تم اس کے سوار ہو،\nاور تم خطرے میں ہو۔\n\nاور تمہارے لیے قضا (القضاء) اور قدر (القدر) کے سوا،\nکوئی ساحل نہیں۔\n\nپس گڑگڑاؤ اور کوشش کرو،\nکیونکہ اللہ سے کوئی مفر نہیں۔\n\nیہ وہ ہے جس کا میں نے شہود کیا،\nاپنی رات میں سحر تک۔\n\nپس جھڑکو، اور عبرت حاصل کرو،\nاور ان سے نصیحت لو جو گزر گئے۔\n\nپس اللہ کی قسم! ہر کوئی،\nبلا شک سفر پر ہے۔\n\nاس سے پہلے اس نے مجھے ایک عجیب امر کا شہود کرایا،\nجس میں ایک راز تھا۔\n\nپس میری بات سنو،\nاور سکر (مستی) کے لفظ سے عبرت حاصل کرو۔\n\nپس تمام تعریفیں اللہ کے لیے ہیں جس نے،\nاپنے فضل سے انسان کو عطا کیا۔\n\nتمہارے پاس اس کی کوئی خبر نہیں،\nبلکہ ہمارے پاس اس کی خبر ہے۔\n\nمیں نے کہا: \"تم دیکھتے ہو وہ کہاں گئی؟\"\nاس نے کہا: \"وہ اپنی خواہش پوری کرنے گئی ہے۔\"\n\nمیں نے کہا: \"کیا وہ باز آئے گی؟\"\nاس نے کہا: \"ہاں، سحر کے وقت۔\"\n\nمیں نے کہا: \"اور کیا تم اسے جانتے ہو؟\"\nاس نے کہا: \"ہاں، وہ چاند کی بہن ہے۔\"\n\nمیں نے کہا: \"وہ کس پر نازل ہوئی؟\"\nاس نے کہا: \"ابو البشر (آدم) پر۔\"\n\nمیں نے کہا: \"اور وہ کیا چاہتی ہے؟\"\nاس نے کہا: \"ذکر کے ساتھ جماع۔\"\n\nاس راز کو میری والدہ،\nام البشر (حوا) کے سوا کوئی نہیں جانتا۔\n\nوہ کہتی ہے: \"اے جوان! اس میں اضافہ کر،\"\n\"پس وہ بہترین تجربہ گاہ ہے۔\"\n\nمیں نے اسے چوما، اسے گلے لگایا،\nاس نے کمر بند کی گرہیں کھول دیں۔\n\nمیں نے ایک ایسے ہدف میں وار کیا،\nجو صاف تھا، جس پر کوئی بال نہیں تھا۔\n\nاور اس کی خوشبو ایسی تھی جیسے،\nخزامی (ایک خوشبودار پودا) اور عطر کی خوشبو۔\n\nمیں نے اسے آگ کی طرح پایا،\nجو مجوسیوں کے لیے بھڑک رہی ہو۔\n\nاس کے کولہے ایسے تھے جیسے،\nجڑ سے اکھڑے ہوئے کھجور کے تنے۔\n\nاے وہ نظر جس نے،\nہستی (الوجود) میں وہ ظاہر کیا جو ظاہر ہوا۔\n\nاگر پیدائش نہ ہوتی تو،\nانسان میں راز کا کوئی معنی نہ ہوتا۔\n\nہمارے لیے راز بن جا اور اس کے لیے،\nایک مسلسل مخلوق ہستی (الوجود) بن جا۔\n\nجب راز اور \"کن\" (ہو جا) ملتے ہیں،\nتو تیری آنکھوں کے سامنے عبرتیں ظاہر ہوتی ہیں۔\n\nاور کہنے والا یہ ایک مثال ہے،\nجو اس کے لیے مقرر کی گئی ہے جس نے دیکھا۔\n\nجب وہ نیزوں پر ظاہر ہو،\nتو جو چاہے عبرت حاصل کرے۔\n\nمیں نے کہا: \"ہاں، اور اس کے بعد،\"\n\"وہ دیگر چیزوں کے لیے ہے۔\"\n\nیہاں اور آخرت میں، اور جہاں بھی،\nہم ہوں، پس یاد رکھ۔\n\nانہوں نے کہا: \"معاملہ کیسا ہے، بتاؤ،\"\nتو میں نے کہا: \"سنو، جو چھپایا گیا ہے۔\"\n\nجب ولی (الولي) کی بیوی،\nتختوں پر اس کی طرف آتی ہے۔\n\nتو وہ اس پر وہ صورتیں ظاہر کرتا ہے،\nجو وہ اٹھائے ہوئے ہوتا ہے۔\n\nپس جب وہ اس سے جماع کرتا ہے،\nتو وہ صورتوں پر تصور کرتے ہیں۔\n\nاسی جنس کی، کہ اگر وہ جنم دے،\nتو وہ انہی صورتوں پر ہو گا۔\n\nخواہ وہ حاکم امام ہو،\nیا ناز و نخرے والی حور۔\n\nپس اگر وہ عورت ہو تو وہ ہے،\nاور اگر وہ مرد ہو تو وہ ہے۔\n\nیہ اس کے ظہور الٰہی (التجلی) کی طرح ہے،\nجو بغیر کسی تبدیلی کے بدلتا ہے۔\n\nپس میرا ولی اس پر غور کرے جو میں نے لکھا ہے اور اس پر فکر کرے جو میں نے ذکر کیا ہے، اور اسے اپنی بصارت (البصر) سے اپنی بصیرت (بصيرة) کے لیے اور اپنے راز (سر) سے اپنی سرّیت (باطن) کے لیے عبرت حاصل کرے۔ کیونکہ اب فتنوں کا زمانہ آنے والا ہے، اور میں جانتا ہوں کہ میں نے تمہیں کیوں پیدا کیا اور وہ کمال کا مرتبہ کیا ہے جس کا میں نے تمہیں شہود کرایا۔ اور تم سے صرف وہی طلب کیا گیا ہے جو تمہارا وجود (وجودك) تقاضا کرتا ہے اور تمہارا شہود (شهودك) جس کا فیصلہ کرتا ہے۔ پس اگر تم نے انصاف کیا تو تم نے پہچان لیا، اور اگر تم نے وہ سب کچھ دیکھنے کے بعد بھی آنکھیں بند کر لیں جو میں نے تمہیں دکھایا، تو تم کمزور ہو گئے، پس تمہارا قول فاسد ہے، معافی کا سوال کرو، والسلام۔\n\nپس وہ میرے خط کے پہنچنے پر خوش ہوا اور اس میں اور اس کی طرف گہری نظر ڈالی، تو اس میں غور و فکر نے اسے ایک ایسی بیماری میں مبتلا کر دیا جو اس کے سفر اور تیزی سے کوچ کا سبب بنی۔ پس چند ہی دن باقی رہے اور وہ رخصت ہو گیا، اور اپنے مقصود کی طرف بلند ترین معراج پر چڑھ گیا، اور میں نے اس کے احتضار کا مشاہدہ دار البیضاء میں کیا یہاں تک کہ اس نے قضا (القضاء) کر دی، اور میں اسی دن اپنے لوگوں کی جلدی کی وجہ سے سفر پر روانہ ہو گیا۔ پس یہ ان مشکل ہولناکیوں میں سے کچھ ہے جو یہ منزل اپنے اندر رکھتی ہے، جن کی صورتیں شہود (الشہود) میں عظیم ہوتی ہیں۔\n\n### [کہ اللہ نے گزشتہ قوموں کی خبریں اس لیے ذکر کیں تاکہ ان اسباب سے بچا جائے جن کی وجہ سے اللہ نے انہیں سخت گرفت میں لیا]\n\nاور جان لیجیے کہ اللہ نے گزشتہ قوموں کی خبریں صرف اس لیے ذکر کیں تاکہ تم ان اسباب سے بچو جن کی وجہ سے اللہ نے انہیں سخت گرفت میں لیا (أخذته الرابية) اور ان پر شدید بطش (پکڑ) کیا۔ اور موت تو گنی چنی سانسیں اور محدود مدتیں ہیں، اور خوف صرف اس کی گرفت اور بطش سے ہے، نہ کہ اس کی ملاقات سے، کیونکہ اس کی ملاقات ولی (الولي) کو خوش کرتی ہے، اور موت ملاقات کا سبب ہے، پس یہ وہ بہترین تحفہ ہے جو مومن کو دیا جاتا ہے۔ پس اس کا کیا حال ہو گا جب وہ عالم ہو، \"واہ! کیا خوب!\" (بخ على بخ)۔\n\nاور یہ منزل مندرجہ ذیل علوم کو شامل کرتی ہے: علم الرحمتین (دو رحمتوں کا علم)، علم قرب السعی (کوشش کی قربت) کا علم، جو قرب الشبر والذراع (بالشت اور ہاتھ کی قربت) سے ہے، اور یہ محدود قرب ہے۔ علم الرتق والفتق (بند کرنے اور کھولنے کا علم)، علم المتشابہ من المحکم (محکم سے متشابہ کا علم)، علم الأبد (ابد کا علم) اور دلائل کے علوم، علم الاتباع (پیروی کا علم) اور اس میں سے جو سعادت مند کرتا ہے اور جو بدبخت کرتا ہے، علم ثبوت الأمور (معاملات کے ثبوت کا علم) اور حکم (الحکم) اور حاکم (الحاکم) کا مرتبہ، علم الجزاء الوفاق (موافق بدلے کا علم)، علم الخبر بالإجابة إلى المكروه (ناپسندیدہ چیز کی قبولیت کی خبر کا علم)، جیسے ام عیسیٰ (مریم) کے بیٹوں کی قبولیت، علم التلبيس (الجھاؤ کا علم)، کہ وہ تمہیں تمہاری چیز اس رخ سے عطا کرتا ہے جس سے تم نہیں جانتے کہ وہ تمہاری چیز ہے، تاکہ تم پر التباس (التباس) ہو۔ پس جب پردہ ہٹ جائے اور بصارت تیز ہو جائے تو تم جان لو گے کہ اس نے تمہیں وہی دیا جو تمہارے ہاتھ میں تھا، پس اس نے اپنی طرف سے کوئی اضافہ نہیں کیا اور نہ ہی اپنے پاس سے کوئی فائدہ پہنچایا، سوائے صورتوں کی تبدیلی کے۔\n\nپس جو اس علم پر واقف ہوا، اس نے اپنے مشروب میں سیرابی (الری) کا اقرار کیا، اور جو اس سے محروم رہا، وہ ہمیشہ پیاسا رہا، حالانکہ پانی اس کے پاس ہے جو اسے سیراب کرتا ہے، اور اسے شعور نہیں ہوتا کہ وہ اس کے پاس ہے۔ اور یہ ان بہترین علوم میں سے ہے جو اللہ کے عارفین (العارفون باللہ) کو عطا کیے جاتے ہیں۔ یہ زمین کے لیے بارش کی طرح ہے، اور جس سیرابی کو تم طلب کرتے ہو، وہ تمہارے بخارات کے سوا کچھ نہیں جو زمین سے بخار بن کر اوپر چڑھے، پھر بارش بن کر اس پر نازل ہوئے، پس محل کے اختلاف کی وجہ سے اس کی صورت بدل گئی۔ پس زمین نے اپنے ہی پانی سے پیا اور سیراب ہوئی، اور اگر وہ یہ جان لیتی تو بادل اسے حجاب نہ بناتے۔ پس علم الٰہی (العلم الإلهي) میں اس قسم کا علم متحقق ہوا، کہ اس نے تمہیں صرف تم ہی سے عطا کیا، اور وہ جس پر ہے، اسے اس کی طرف سے صرف وہی جانتا ہے۔ پس ہر عالم کا علم اس کی اپنی ذات سے ہے۔ اسی لیے اہل اللہ نے کہا: اللہ کو اللہ کے سوا کوئی نہیں جانتا، اور نبی کو نبی کے سوا کوئی نہیں جانتا، اور ولی کو ولی کے سوا کوئی نہیں جانتا۔\n\nاور یہ منزل نجات اور سعادت کے اسباب کا علم بھی شامل کرتی ہے، اور صبر کرنے والے اور شکر کرنے والے کے لیے تنگی اور آسانی کے ذریعے امتحانات کا علم، اور مناسبت (المناسبة) کا علم جس کی وجہ سے جس نے اللہ کے حکم کی نافرمانی کی، اس نے اس کی تعمیل نہیں کی، اور جس نے تعمیل کی، کیا اس نے مناسب حکم سے تعمیل کی یا عدم مناسبت سے؟ اور ادنیٰ (نیچے والے) کا اعلیٰ (اوپر والے) میں اثر کرنے کے سبب کا علم، جیسے حیوانات کا انسان پر مسلط ہونا، مچھر کے کاٹنے سے لے کر اس سے اوپر تک۔ اور اللہ تعالیٰ نے فرمایا: \"میں پکارنے والے کی پکار کا جواب دیتا ہوں جب وہ مجھے پکارتا ہے\" (أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ)۔ اور ظہور الٰہی (التجلی) کے ذریعے حیوانات کا انسان کے ساتھ علوم میں شریک ہونے کا علم۔ اور اس شخص کا علم جس نے حق (الحق) کی طرف سے آنے والی ہر چیز کو رد کر دیا، اس نے کہاں سے رد کیا، اور جس نے اس کے بعض کو رد کیا، اس نے کہاں سے رد کیا، اور کیا ان میں حکم الٰہی (الحکم الإلهي) برابر ہو گا یا نہیں؟ اور اس کا علم کہ صحابہ حنین کے دن کہاں سے بھاگے تھے۔ اور اعلیٰ (اوپر والے) کی ادنیٰ (نیچے والے) کی وجہ سے گرفت کا علم، جب اس نے کوئی دلیل نصب کی تو اسے کس نے نصب کیا؟ اور سوابق (پہلے آنے والی چیزوں) اور لواحق (بعد میں آنے والی چیزوں) کا علم۔ اور عین جمع (عین الجمع) میں وحدت (الوحدة) کا علم۔ اور مراتب (المراتب) اور درجات (الدرجات) کا علم۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)۔",
    "fa": "## باب سیصد و سی‌ام در معرفت منزل قمر از هلال و بدر از حضرت محمدیه (الحضرة المحمدية)\n\nبه نوح و عاد بنگر و عبرت گیر / در صالح و سپس لوط تأمل کن\nو با آنان سخنی دلسوزانه و خیرخواهانه بگو / و ندا ده: آیا در میان شما پندگیرنده‌ای هست؟\nو در هستی (الوجود) جز او وجودی نیست / و در نیستی، وجودی پایدار نیست\nپس او از آنِ اوست، نه از آنِ ما؛ و او از آنِ ماست، نه از آنِ او، به وجه هستی (الکون) مستمر\nکجایند آن صورت‌هایی که بر ما آشکار شدند / که رفتند و صورت‌های دیگری جایگزینشان شدند؟\nاگر در غیب فرو می‌رفت، عینش زائل می‌شد / و برای چشم و بینایی مشهود می‌گشت\nیا معدوم می‌شد، و من عدمی نمی‌بینم / که به هستی (الکون) قائم باشد، بلکه هستی (الکون) برای او ظاهر شد\nو از عدم پدیدار نشد، بلکه / از هستی (الکون) حق (الحق) آشکار است که پنهان نمی‌شود\n\n### [اینکه قمر مقامی برزخی (برزخ) میان مسمای هلال و مسمای بدر است]\n\nبدان، خداوند تو را تأیید کند، که قمر مقامی برزخی (برزخ) است میان مسمای هلال و مسمای بدر، در حال افزایش و کاهش نور. پس هلال نامیده شد به دلیل بلند شدن صداها هنگام رؤیت آن در دو طرف (آغاز و پایان ماه)، و در حال عمومیت نور برای ذاتش در چشم بیننده، بدر نامیده می‌شود. و برای قمر منزلی جز آنچه میان این دو حکم است باقی نمانده است. جز اینکه بدریت آن در پنهان شدنش از ادراک دیدگان، زیر شعاع خورشید که میان دیدگان و آن حائل است، «مُحاق» نامیده می‌شود. و آن از وجهی که رو به خورشید است، بدر است، همان‌گونه که در حال بدر بودن نزد ما، از وجهی که خورشید در آن ظاهر نمی‌شود، مُحاق است. و آنچه میان این دو مقام است، به اندازه‌ای که از نور در آن ظاهر می‌شود، از وجه دیگر کاسته می‌شود، و به اندازه‌ای که از یکی از دو وجه پنهان می‌شود، از وجه دیگر با نور ظاهر می‌گردد. و این به دلیل کجی قوس فلکی است. پس پیوسته بدر دائمی و مُحاق دائمی است. و این به خاطر سِرّی است که خداوند خواسته آن را به عارفان بالله (المعرفة) اعلام کند. پس این مَثَل را عملاً برای آنان زد تا در آن با عبور به سوی آنچه برایش نصب شده است، عبرت گیرند: یعنی معرفت انسان کامل (الإنسان الکامل) و معرفت حق (الحق) به دلیل وجودش بر صورت (الهی) و تغییر احوالش در آن، به سبب تغییر مراتبی که در آن ظاهر می‌شود. خداوند متعال می‌فرماید: وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ (و برای ماه منزل‌هایی مقدر کردیم). و آن را نه بدر نامید و نه هلال؛ زیرا در این دو حالت، برای آن جز یک منزلت نیست، بلکه دو منزلت است. پس قول او «مَنَازِلَ» (منزل‌ها) صادق نیست مگر در قمر. پس برای قمر درجات نزدیکی و آویختگی است، و برای آن است که در ورود به حضرت غیب و خروج به حضرت شهود (الشهود)، افزایش و کاهش را در پیش گیرد. سپس خداوند متعال آن را به انشقاق وصف کرد، به دلیل ظهور انسان کامل (الإنسان الکامل) با صورت الهی. پس او شکافی برای آن بود. ظهور آن (صورت الهی) در دو امر، ظهور انشقاق قمر به دو نیمه است.\n\nدر خبر از صحابی (صاحب) آمده است که قمر در زمان رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) شکافته شد، هنگامی که گروهی از اعراب درخواست کردند تا نشانه‌ای بر صدق او داشته باشند. پس شکافته شد. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به حاضران فرمود: «شهادت دهید.» و خداوند متعال فرمود: اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ (قیامت نزدیک شد و ماه شکافته گشت).\n\nپس دانسته نیست که آیا انشقاقی را اراده کرده که در آن سؤال واقع شد، و این ظاهر آیه است؛ زیرا انشقاق را با قول خود دنبال کرد: وَإِنْ يَرَوْا آيَةً يُعْرِضُوا وَيَقُولُوا سِحْرٌ مُسْتَمِرٌّ (و اگر نشانه‌ای ببینند، روی برمی‌گردانند و می‌گویند: سحری است پایدار). و همین‌گونه سخن از آنان واقع شد هنگامی که آن را دیدند. و به همین دلیل رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به حاضران فرمود: «شهادت دهید»، برای وقوع آنچه درخواست وقوعش را کرده بودند. و برای آنان جز آنچه ظاهر شد، نبود. و آیا این همان واقعه در نفس‌الامر است یا در نظر بیننده؟ این لازم نیست. زیرا احتمال برطرف نمی‌شود مگر با سخن خبردهنده، هنگامی که خبر دهد که آن در نفس‌الامر همان‌گونه است که در چشم ظاهر شد. و سخن خبردهنده محل نزاع است. و آنان در سؤال خود شرط نکردند که آنچه از اعتراض هنگام وقوع آنچه درخواست وقوعش را کردند، از ایشان ظاهر نشود. پس بر پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) بیش از آنچه در آن سؤال واقع شد، لازم نبود. سپس مردم از آفاق آمدند و از انشقاق قمر در آن شب خبر دادند. و به همین دلیل خداوند متعال از قول آنان فرمود که در مورد آن گفتند: سِحْرٌ مُسْتَمِرٌّ (سحری است پایدار). پس خداوند فرمود: كُلُّ أَمْرٍ مُسْتَقِرٌّ (هر امری پایدار است). آن امر هر چه بود، قمر اگر مرتبه‌اش برزخی (برزخ) نبود، اهلال (هلال شدن)، ابدار (بدر شدن)، محاق و سرار (پنهان شدن) را نمی‌پذیرفت. پس سحر پایدار (سِحْرٌ مُسْتَمِرٌّ) تحت حکم هر صاحب امر پایداری (كُلُّ أَمْرٍ مُسْتَقِرٌّ) داخل است. پس این انشقاق به حق (الحق) است و جهل در عین علم، و این همان قول اوست: ذَلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ (این نهایت دانش آنهاست). پس آن را علم ثابت کرد. و بدان که نظر و اعتبار از علومی است که از اسرار و انوار ظاهر می‌شود. پس نور برای بصر (بینایی ظاهری) و دیدگان است. پس خداوند هنگامی که این مقام را ذکر کرد، فرمود: فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ (پس ای صاحبان بینش، عبرت گیرید). یعنی از آنچه بصر (چشم) با نورش به شما داده است، از دیدنی‌ها و احکام آن‌ها، عبور کنید، به سوی آنچه با چشم بصیرت‌هایتان به صورت شهود (الشهود) درک می‌کنید، که کامل‌تر و قوی‌تر است، یا از طریق فکر، که شهود (الشهود) پایین‌تر از مرتبه بالاست. و هر دو از آنچه ظاهر شده به سوی آنچه پنهان و باطن است، عبور می‌کنند. پس این‌ها آيات لِقَوْمٍ يَتَفَكَّرُونَ (برای قومی که می‌اندیشند) است، همان‌گونه که آيات لِقَوْمٍ يَتَّقُونَ (برای قومی که تقوا پیشه می‌کنند) است. پس متقی کسی است که خداوند تعلیم او را بر عهده می‌گیرد، لذا در علم او شک و شبهه‌ای وارد نمی‌شود. و متفکر ناظر به نیرویی مخلوق است، پس گاهی درست می‌گوید و گاهی خطا می‌کند. و اگر درست بگوید، به دلیل نیرویی که او را به درستی رسانده، پذیرای ورود شبهه بر خود است، به دلیل اختلاف راه‌ها. پس متقی صاحب بصیرت است و متفکر میان بصر و بصیرت قرار دارد؛ نه با بصر باقی مانده و نه به بصیرت خالص شده است. پس در این منزل، مسئله‌ای از مسائل آن را ذکر می‌کنیم، مانند برادرانش از منازل. و آن منزلی شریف و والاست که در طریق، «منزل نور» نامیده می‌شود، زیرا خداوند آن را نور قرار داد و سراج (چراغ) قرار نداد، به دلیل اینکه سراج نیازمند کمک گرفتن از روغن برای بقای روشنایی است. و به همین دلیل رسول (ص) سِرَاجاً مُنِيراً (چراغی نوربخش) بود، به خاطر امداد الهی که همان وحی است. و او را «منیر» (نوربخش) قرار داد، یعنی صاحب نور، به دلیل استعدادی که برای پذیرش این امداد داشت، مانند آتشی که در سر فتیله است و دود از آن برمی‌خیزد، که در آن نور بر سر فتیله از سراج نازل می‌شود و سراجی مانند آن ظاهر می‌گردد. و نور از اسماء الهی است، اما سراج از اسماء او نیست، زیرا نورش را از چیزی دریافت نمی‌کند. پس از این اعتبار، مرتبه قمر را نسبت به شمس شناختی. خداوند متعال می‌فرماید: وَجَعَلَ الْقَمَرَ فِيهِنَّ نُوراً وَجَعَلَ الشَّمْسَ سِرَاجاً (و ماه را در میان آن‌ها نوری و خورشید را چراغی قرار داد). پس نور سراج مقید است و نور قمری مطلق. و به همین دلیل آن را نکره آورد تا شامل همه انوار شود. پس هر سراجی نور است، اما هر نوری سراج نیست.\n\n### [اینکه علم مطلق به دو بخش تقسیم می‌شود]\n\nو بدان که از علم به تحقق به صورت (الهی) این است که علم مطلق، از حیث تعلقش به معلومات، به دو بخش تقسیم می‌شود: به علمی که هستی (الکون) از خداوند از طریق تقوا می‌گیرد، و این همان قول اوست: إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَاناً (اگر از خدا پروا کنید، برای شما فرقان قرار می‌دهد). و قول او در مورد خضر: وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْماً (و از نزد خود به او دانشی آموختیم). و علمی که خداوند از هستی (الکون) می‌گیرد، هنگام آزمودن آن با تکلیف، مانند قول او: وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ (و قطعاً شما را می‌آزماییم تا بدانیم). و اگر اشتراک در صورت (الهی) نبود، بر خود حکم نمی‌کرد به آنچه برای خلقش حکم کرد، یعنی حدوث تعلق علم. پس اگر انسان به صورت حق (الحق) ظاهر شود، حکم حق (الحق) برای اوست. پس حق (الحق) گوش و چشم او می‌شود. با حق می‌شنود، پس هیچ شنیدنی از او فوت نمی‌شود، و با حق می‌بیند، پس هیچ دیدنی از او فوت نمی‌شود، چه آن دیدنی عدم باشد و چه وجود. و اگر حق (الحق) به صورت انسان ظاهر شود، در حالی که انسان در صورت حق نباشد، حکم بر خداوند مانند حکم بر صورت انسانی است که صورت حق را ندارد. پس آنچه به آن صورت نسبت داده می‌شود، از حرکت و انتقال و پیری و جوانی و خشم و رضایت و شادی و سرور، به او نسبت داده می‌شود. و به خاطر آنچه از شأن این دو علم بیان کردیم، خداوند در هستی (الوجود) دو کتاب قرار داد: کتابی که آن را «اُمّ» (مادر) نامید. آنچه قبل از ایجادش بوده و آنچه خواهد بود، به حکم اسم «المقیت» در آن نوشته است. پس آن کتابی است دارای قدر (القدر) معلوم که برخی از اعیان ممکنات و آنچه از آن‌ها پدید می‌آید، در آن است. و کتابی دیگر که در آن جز آنچه به طور خاص از مکلفین پدید می‌آید، نیست. پس تا زمانی که تکلیف هست، نوشتن در آن ادامه دارد. و به وسیله آن، حجت خداوند بر مکلفین تمام می‌شود و با آن از ایشان مطالبه می‌کند، نه با «اُمّ». و این همان امام حق مبین است که حق تعالی (الحق) با آن حکم می‌کند. همان که خداوند در کتابش به ما خبر داد که به پیامبرش امر کرد که به پروردگارش بگوید: احْكُمْ بِالْحَقِّ (به حق حکم کن). مراد این کتاب است، و آن کتاب احصاء (شمارش) است. فَلا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّا أَحْصَاهَا (هیچ کوچک و بزرگی را فروگذار نکند مگر اینکه آن را برشمرده باشد). وَكُلُّ صَغِيرٍ وَكَبِيرٍ مُسْتَطَرٌ (و هر کوچک و بزرگی نوشته شده است). و این در «اُمّ» که همان «زُبُر» است، تصریح شده و معنای آن کتابت است. و اگرچه انواع کتاب‌ها بسیارند که آن‌ها را در «مواقع النجوم» ذکر کردیم، اما به این دو کتاب بازمی‌گردند. و سبب ایجاد دو کتاب این است که او سبحانه از هر چیزی دو زوج آفرید، پس دو کتاب نیز آفرید. پس به واسطه کتاب دوم، حق (الحق) «خبیر» نامیده می‌شود و به واسطه «اُمّ»، «علیم» نامیده می‌شود. پس او علیم به اول است و خبیر به دوم، اگر تعقل کنی. پس قضا (القضاء) که در امور جاری است، حکم الهی بر اشیاء به فلان چیز است. و قدر (القدر) آن چیزی است که وجودش در موجودی معین واقع می‌شود، و مصلحت آن از آن موجود به غیر آن موجود سرایت می‌کند. مانند قول او: وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ (و اگر خداوند روزی را بر بندگانش گشاده می‌ساخت، قطعاً در زمین سرکشی می‌کردند). پس اگر سرکشی از گشایش روزی حاصل می‌شد، حجت بر آنان تمام نمی‌شد. وَلَكِنْ يُنَزِّلُ بِقَدَرٍ مَا يَشَاءُ (بلکه به اندازه‌ای که بخواهد نازل می‌کند). پس چیزی را نازل نکرد مگر به قدر (القدر) معلوم، و چیزی را خلق نکرد مگر به قدر (القدر). پس هنگامی که سرکشی با قدر (القدر) یافت شد، حجت بر خلق تمام شد، زیرا دیگری را از آنچه در دست داشت، با وجود کفایت، منع کرد. پس آنچه اضافه آمد، دانسته می‌شود که برای مصلحت غیر اوست، و از فضل اوست که آن را قرض قرار داد. و قرض در آنچه روزی او برای قوام ذاتش است، واقع نمی‌شود. و این کار را از جمله مصالح بندگان قرار داد، پس بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِيَتَّخِذَ بَعْضُهُمْ بَعْضاً سُخْرِيّاً (برخی را بر برخی دیگر درجات داد تا بعضی، بعضی دیگر را به خدمت گیرند). و هنگامی که خداوند سبحانه خود را به منزله بندگانش نازل کرد، احکام آنان را بر خود جاری ساخت. پس جز با خودشان بر آنان حکم نکرد. و این از حجت بالغه او بر آنان است، و آن همان قول اوست: جَزَاءً وِفَاقاً (پاداشی موافق). جَزَاءً بِمَا كَانُوا يَعْمَلُونَ (پاداش آنچه انجام می‌دادند). جَزَاءً بِمَا كَانُوا يَكْسِبُونَ (پاداش آنچه کسب می‌کردند). پس اعمالشان آنان را عذاب داد و اعمالشان آنان را نعمت داد. پس غیر از خودشان بر آنان حکم نکرد. پس جز خودشان را سرزنش نمی‌کنند، همان‌گونه که خداوند در آنچه از قول شیطان برای ما حکایت کرد، فرمود: لَمَّا قُضِيَ الْأَمْرُ إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُكُمْ فَأَخْلَفْتُكُمْ (هنگامی که کار به پایان رسید، شیطان گفت: خداوند به شما وعده حق داد و من به شما وعده دادم و خلاف کردم). وَمَا كَانَ لِي عَلَيْكُمْ مِنْ سُلْطَانٍ (و مرا بر شما هیچ تسلطی نبود)، یعنی نه قدرتی، نه حجتی و نه برهانی، إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي (جز اینکه شما را دعوت کردم و شما مرا اجابت کردید). و هر کس که دعوت کند، اجابتش لازم نیست. و به همین دلیل معجزات گواهی می‌دادند بر صدق دعوت رسولان که آن دعوت خداست. و شیطان هنگامی که آنان را دعوت کرد، برهانی برایشان اقامه نکرد، و این همان قول اوست: وَمَا كَانَ لِي عَلَيْكُمْ مِنْ سُلْطَانٍ (و مرا بر شما هیچ تسلطی نبود). پس شگفتا! مردم دعوت حق (الحق) را با وجود ظهور برهان انکار کردند و به آن کفر ورزیدند، اما دعوت شیطان را که عاری از برهان بود، اجابت کردند. پس به آنان گفت: فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ (پس مرا سرزنش نکنید و خودتان را سرزنش کنید). این از روی نظر او به حکم کتاب دوم است که به وسیله آن حجت بر آنان تمام می‌شود. و اگر به «اُمّ» و «زُبُر» اول نظر می‌کرد، به آنان نمی‌گفت: وَلُومُوا أَنْفُسَكُمْ (خودتان را سرزنش کنید). پس قضا (القضاء) برای کتاب اول است، و حکم کتاب دوم آن را می‌طلبد، و قدر (القدر) به کتاب دوم است. و هر دو کتاب محدودند، زیرا موجودند. اما علم خداوند در اشیاء را نه کتابی نوشته شده محدود می‌کند، نه طوماری گشوده آن را در بر می‌گیرد، نه لوح محفوظی آن را می‌گنجاند و نه قلم اعلی آن را می‌نویسد. فَلَهُ الْحَمْدُ فِي الْأُولَى وَالْآخِرَةِ وَلَهُ الْحُكْمُ وَإِلَيْهِ تُرْجَعُونَ (پس ستایش در دنیا و آخرت از آن اوست و حکم از آن اوست و به سوی او بازگردانده می‌شوید). یعنی به سوی حکم، که همان قضا (القضاء) است. ضمیر در «إِلَيْهِ» به «حکم» بازمی‌گردد، زیرا نزدیک‌ترین مذکور است. و به دورتر بازنمی‌گردد و از نزدیک‌تر تجاوز نمی‌کند، مگر با قرینه حال. این همان چیزی است که از زبانی که قرآن به آن نازل شده، معلوم است. پس قضا (القضاء) بر قدر (القدر) حکم می‌کند، و قدر (القدر) در قضا حکمی ندارد، بلکه حکم آن فقط در مقدَّر است، به حکم قضا. پس قاضی حاکم است و مقدِّر، وقت‌گذار. پس قدر (القدر)، وقت‌گذاری در اشیاء است که از اسم «المقیت» اوست. خداوند متعال می‌فرماید: وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ مُقِيتاً (و خداوند بر هر چیزی نگهبان و تواناست). و این منزل را در قونیه در شبی شهود (الشهود) کردم که سخت‌تر از آن بر من نگذشته بود، به دلیل نفوذ حکم و قدرت و سلطنت آن. پس خدا را سپاس گفتم که به آن شب محدود شد و حکم تأبید نبود، بلکه حکم وقوع مقدَّر بود. پس هنگامی که به خود بازگشتم، در حالی که (آن حال) در دستم افتاده بود و آنچه خداوند بر من نازل کرده و حق (الحق) نزد من مقدر کرده بود را دانستم، و میان قضا (القضاء) و قدر (القدر) او در اشیاء فرق گذاشتم، آن را برای برادری در راه خدا که داشتم (رحمه الله) نوشتم، تا او را از آنچه گذشت آگاه سازم، همان‌گونه که عادت میان برادران است، زیرا نامه او به من رسیده بود و شرح احوالم را خواسته بود. پس ورود این حال مصادف شد و من در همان حال برایش نوشتم:\n\nبه نام خداوند بخشنده مهربان. نامه مولا رسید که از ولی خود شرح آنچه را که دیده و او به آن سزاوارتر است، می‌پرسد تا در آن بر اساس آنچه بر او وارد می‌شود، حکم کند.\n\nای شهاب‌الدین، ای مولای مولایان / با اهتمام از شرح حال من پرسیدی\nمن رانده شده از میان مولایان هستم / و کسی چون من از وصال بازداشته می‌شود\nاز شیشه‌ای سرپیچی کردم و قدر خود را ندانستم / پس اینک مطیع حد غالیان هستم\nبا تیرهای هجران هدف قرار گرفتم تا / تیرها بر روی تیرها در هم تنیدند\nپس او مرا با تیرهایش می‌زند و من / نزد او فعل مردان را به جا آوردم\nبر درگاهش ایستادم، شکایت و گریه می‌کنم / گریه کسی که یگانه مولای خود را از دست داده است\nو با اشک و اشتیاقی اندوهگین گفتم / من رانده شده از میان مولایان هستم\nمن بنده‌ای هستم که حق پروردگارم را ضایع کرده‌ام / پس ای صاحب جلال، چگونه مرا ضایع می‌کنی؟\nو همانا مکارم اخلاق از شماست / و همانا عفو از کرم خصلت‌هاست\nو آیا کتاب‌هایی برای جالینوس منتشر شد / جز برای از بین بردن بیماری سخت؟\nو تیرانداز، تیرها را ذخیره می‌کند / برای ترس از ناگواری روز نبرد\nاگر بندگان، بندگان بدی باشند / همانا فضل از خوی مولایان است\nو عهد من با درافتادن به عقاب نفسم بود / پس چگونه در گمراهی در برابر تو ایستادم؟\nاگر از عجز و ضعفم سخن می‌گفتی / می‌گفتم: عین محال را فرض کرده‌اید\nو اینک من در حال عجز ایستاده‌ام / ضعیف، مانند زنان پرده‌نشین\nحسن ظن خود را به سوی او فرستادم / و اصراری عظیم در سؤال\nو اگرچه طبیعت‌ها، طبیعت‌های بدی باشند / حسن ظن از کرم خصلت‌هاست\nامیدم وجود تو را محقق ساخته است / و پس از تحقق یافتنم، دیگر باکی ندارم\nدانستم که اگر گناهم بالا رود / در کنار عفو تو در پستی قرار می‌گیرد\nبه لطف تو قبل از علمم، تاج بودم / پس از علم، حق (الحق) با نعلین است\nبه راستی مرا تأیید کردی و پشتم را محکم ساختی / با توحیدی که از گفتار فراتر است\nای پروردگارم، با محافظت از ولید بر من منت نهادی / که با آن زشتی افعال را راندم\nآنچه را که می‌بینم، از جمالی است / که از مکاشفه خیال تقدس یافته است\nو از صورت‌های مقید فراتر است / از مَثَل محقق در عالم مثال\nپس او را شهود (الشهود) می‌کنم و او مرا شهود می‌کند و من فانی (الفناء) می‌شوم / کمالی در کمالی در کمال\nو برای مشهود او، آسودگی مرا فرا می‌گیرد / همان‌گونه که اسیر از بند رها می‌شود\nپس جز من کسی به نیکی‌ها لذت نمی‌برد / به خاطر حسن عنایت و صلاح حال\nهلال‌هایی را دیدم که خورشیدها طلوع کردند / و خورشید کجا و نور هلال کجا\nپس تاریکی را راندم، نه تاریکی هست / و نه شبی تا روز جدایی\nعنایت، از شب جسم من جدا شد / همان‌گونه که روز از شب‌ها جدا می‌شود\nپس محو، اثبات انفصال بود / و نور، آیات اتصال من بود\nو پس از وصل، سخن مرا بشنوید / مرا به سجده با سایه‌ها فرا خواند\n\nو همانا ولیّ تو هنگامی که خواست در راه خود برخیزد و به آنچه در تحققش بر آن بود، نفوذ کند، مانعی سخت (عقبة کئود) بر سر راه ولیّ تو قرار گرفت که میان او و شهود (الشهود) و رسیدن به مقصود و تحقق به حقایق هستی (الوجود) حائل شد. پس ترسیدم که مبادا مانع قضا (القضاء) باشد، به دلیل تیزی شمشیر آن. پس آن را دشوار بالا رفتن دیدم، که میان من و آنچه از لقاء می‌خواهم، حائل است. پس در شبی که طلوع فجر نداشت و نمی‌دانستم در باطن آن چه امری است، در برابر آن ایستادم. پس ریسمان اعتصام و چنگ زدن به دستگیره محکم، یعنی دستگیره اسلام را طلب کردم. پس ندا داده شدم که تا زمانی که باقی هستی، ملازم طلب باش. پس دانستم که من با این خطاب در صورتی مثالی هستم که در حضرت خیالی تجلی (التجلی) یافته است، و اینکه رابطه تدبیر هیکل (جسم) قطع نشده و حکم آن در آن برطرف نشده است. پس به زوال افلاسم هنگام بازگشت به احساسم، بشارت یافتم. پس آنچه را شهود (الشهود) کردم به نظم درآوردم و در نظم خود با ولیّ‌ام با برخی از آنچه یافتم، خطاب کردم. پس اگر ولیّ من به آن نظر کند، باید بر آن تکیه کند و از ایمنی از مکر خدا برحذر باشد. زیرا فَلَا يَأْمَنُ مَكْرَ اللَّهِ إِلَّا الْقَوْمُ الْخَاسِرُونَ (پس جز گروه زیانکاران، کسی از مکر خدا ایمن نمی‌شود). پس بشنو، هدایت شوی، آنچه با آن بر زبانم ندا داده شدم:\n\nمانعی بر سر راهم قرار گرفت / در میانه راه در سفر\nکه از محنت‌هایی پرده برداشت / در حق کسی که طغیان کرد یا کفر ورزید\nدر زیر آن جهنم است / صاحب زفیر و شعله\nاز شدت خشم، چهره / مجرمان را با شراره می‌اندازد\nدریاهایش شعله‌ور شده‌اند / و سقفش شکافته شده است\nو خورشیدش در هم پیچیده شده / و ستاره‌اش تیره گشته است\nنزد شما آمدم تا خبر دهم / تا معنای خبر را بشناسید\nو مانند کسی نگویید که گفت: فَمَا تُغْنِ النُّذُرُ (پس بیم‌دهندگان سودی نمی‌بخشند)\nپس از امر آنان بود / آنچه شنیدید و ذکر شد\nگفتند: و حال آنکه دعوت‌کننده شما را / به سوی چیزی ناپسند فرا خواند\nپس با فروتنی خارج می‌شوند / مانند ملخ‌های پراکنده\nپریشان، پابرهنه، برهنه / فِي يَوْمِ نَحْسٍ مُسْتَمِرٍّ (در روزی شوم و پایدار)\nبه سوی عذاب و هلاکت / به سوی جاودانگی در سقر\nپس اگر پیامبرشان را ببینی / هنگامی که آنان را فرا خواند و بازداشته شد\nو فرستاده‌اش دعا کرد / که من ضعیفم، فَانْتَصِرْ (پس یاری کن)\nپس گفت: ای چشمه، بجوش / و ای زمین، بشکاف\nتا آب بر أَمْرٍ حَكِيمٍ قَدْ قُدِرَ (امری حکیمانه که مقدر شده بود)، به هم رسید\nپس امواجش به هم خورد / و این همان دریای پرموج است\nپس حکم، حکم جداکننده است / و امر، امری پایدار است\nو امر او یکی است / كمثل لمح بالبصر (مانند یک چشم بر هم زدن)\nکشتی‌ای که از تخته‌ها / و میخ‌های نجات برپا شد\nتجري بعين حفظه / وَعْدًا لِمَنْ كَانَ كُفِرَ (به چشم حفظ او جاری است، وعده‌ای برای کسی که کفر ورزید)\nروح‌ها آن را می‌رانند / به امر پادشاهی مقتدر\nجود او آن را بر / کوه جودی فرود آورد، پس گفتند: لا وزر (گناهی نیست)\nحق (الحق) آنان را ندا داد: از آن خارج شوید / من عین گناه هستم\nفرود آمدند و گفتند: پروردگارا / نزد تو چه نیکو جایگاهی است\nپس ای آسمان، بازایست / از ریزش آب فرو ریزنده\nو تو ای زمین، مَاءَكِ وَاخْزِنْ وَاحْتَكِرْ (آب خود را فرو ببر و ذخیره کن و احتکار نما)\nامر قضا (القضاء) شد، پس هر که / دشمن بود، نابود گشت\nآن را برای شما تذکره‌ای گذاشتم / فَهَلْ مِنْ مُدَّكِرٍ (پس آیا پندگیرنده‌ای هست؟)\nو هر آنچه بود و هر آنچه / از شما خواهد بود، نوشته شده است\nو همانا آنچه را که انجام می‌دهد / در هستی (الکون) از خیر و شر\nمقدر (القدر) و وقت‌دار است / کذا أتانا في الزبر (این‌گونه در زُبُر به ما رسیده است)\nمرگ، زهر کشنده است / و حشر، أَدْهَى وَأَمَرُّ (سخت‌تر و تلخ‌تر است)\nکشتی شما، اجسام شماست / در دریای دنیایی که موج زده است\nو شما سرنشینان آن هستید / و شما در خطر هستید\nو برای شما ساحلی نیست / غیر القضاء والقدر (جز قضا و قدر)\nپس تضرع کنید و بکوشید / که از خدا گریزی نیست\nاین همان چیزی است که شهود (الشهود) کردم / در شبم تا سحر\nپس بازداشته شوید و عبرت گیرید / و از کسانی که گذشتند، پند پذیرید\nبه خدا سوگند، همه بدون / شک بر پشت سفر هستند\nپیش از این، امری عجیب را / که در آن سِرّی بود، به من شهود داد\nپس سخن گفتن مرا به آن بشنوید / و لفظ مستی را عبرت گیرید\nپس ستایش خدایی را که / به فضل خود به بشر عطا کرد\nشما از آن خبری ندارید / بلکه خبر آن نزد ماست\nگفتم: می‌بینی کجا رفت؟ / گفت: رفت تا حاجت برآورد\nگفتم: می‌بینی که بازمی‌گردد؟ / گفت: بله، عند السحر (هنگام سحر)\nگفتم: و آیا او را می‌شناسی؟ / گفت: بله، خواهر قمر است\nگفتم: بر چه کسی نازل شد؟ / گفت: بر پدر بشر\nگفتم: و چه می‌خواهد؟ / گفت: آمیزش با ذکر\nاین سِرّ را جز / مادرم، مادر بشر، نمی‌شناسد\nمی‌گوید: ای جوان، از آن بر من بیفزا / پس چه نیکو آزمایشی است\nاو را بوسیدم، در آغوش گرفتم / گره‌های ازار را گشودم\nدر هدفی که مویی در آن نبود / ضربه زدم\nو بوی آن، گویی / بوی اسطوخودوس و عطر بود\nآن را مانند آتشی یافتم / که برای مجوس شعله‌ور است\nسرین‌هایش گویی / تنه‌های نخل از ریشه کنده شده بود\nای نگاهی که آشکار ساختی / از هستی (الوجود) آنچه ظاهر شد\nاگر تولید مثل نبود / سِرّ در بشر معنایی نداشت\nسِرّی برای ما باش و برای او باش / وجود خلقی مستمر\nهنگامی که سِرّ و «کُن» به هم رسند / عبرت‌ها برای چشمانت آشکار می‌شود\nو گوینده این، مَثَلی است / که آن را برای کسی که نظر کند، مقرر کرده است\nبر نیزه، هنگامی که آشکار شود / برای هر که بخواهد، پس عبرت گیر\nگفتم: بله، و پس از این / آن برای چیزهای دیگری است\nاینجا و در آخرت و هر جا / که باشیم، پس پند گیر\nگفتند: و امر چگونه است؟ بگو / گفتم: آنچه پنهان شد را شنیدم\nهنگامی که ولیّ / همسرش را با سرور پذیرا شود\nآنچه را از صورت‌ها / حمل می‌کند، به او می‌سپارد\nپس هنگامی که با او آمیزش می‌کند / بر صورت‌هایی تصور می‌شوند\nاز جنسی که اگر فرزندی به دنیا آورد / بر آن صورت‌ها خواهد بود\nاز امام حاکمی / یا صاحب ناز و حور\nپس اگر مؤنث باشد، اوست / و اگر او باشد، مذکر است\nمانند تجلی (التجلی) او، جز / تحول بدون تغییر نیست\n\nپس ولیّ من باید در آنچه نگاشتم تدبر کند و در آنچه ذکر کردم بیندیشد، و آن را عبرتی از بصر (بینایی ظاهری) برای بصیرتش و از سِرّش برای سِرّ باطنش قرار دهد. زیرا زمان محنت‌ها نزدیک است. و تو دانستی که چرا تو را ایجاد کرد و مرتبه کمالی که به تو شهود (الشهود) داد. و از تو نخواست جز آنچه هستی (الوجود) تو اقتضا می‌کند و شهود (الشهود) تو به آن حکم می‌کند. پس اگر انصاف دهی، شناخته‌ای؛ و اگر پس از آنکه آنچه را دیدی به تو نشان داد، خود را به کوری زنی، سست شده‌ای. سخن فاسد، درخواست اقاله (بخشش) است. و السلام. پس او از رسیدن نامه‌ام شاد شد و در آن و به سوی آن با دقت نگریست. پس تفکر در آن، علتی را در او ایجاد کرد که سبب رحلت و سرعت انتقالش شد. پس جز چند روزی نماند و درگذشت و بر والاترین معراج به سوی مقصودش عروج کرد. و من احتضار او را در دارالبیضاء (قونیه) تا زمانی که قضا (القضاء) شد، شهود کردم. و در همان روز به دلیل عجله قومم سفر کردم. پس این بخشی از چیزهایی است که این منزل در بر دارد، از اهوال دشواری که صورت‌هایشان در شهود (الشهود) بزرگ می‌نماید.\n\n### [اینکه خداوند اخبار قرون گذشته را ذکر کرد تا از اسبابی که خداوند با آن، ایشان را به عذاب سخت گرفت، بر حذر باشید]\n\nو بدان که خداوند اخبار قرون گذشته را ذکر نکرد، مگر برای اینکه بر حذر باشید از اسبابی که خداوند با آن، ایشان را به عذاب سخت گرفت (أخذته الرابية) و با آنان به شدت برخورد کرد. اما مرگ، دم‌های شمرده و اجل‌های محدود است. و ترس جز از گرفتن و برخورد او نیست، نه از لقای او. زیرا لقای او ولیّ را شاد می‌کند و مرگ سبب لقاست، پس والاترین تحفه‌ای است که مؤمن با آن تحفه داده می‌شود. پس حال او چگونه است هنگامی که عالم باشد؟ «به به» بر «به به». و این منزل از علوم، علم دو رحمت و علم نزدیکی سعی از نزدیکی وجب و ذراع را در بر می‌گیرد، که همان قرب محدود است. و علم رتق و فتق، و علم متشابه از محکم، و علم ابد، و علوم ادله، و علم پیروی و آنچه از آن سعادتمند می‌کند و آنچه شقاوت می‌آورد. و علم ثبوت امور، و مرتبه حکم و حاکم، و علم جزای موافق (الوفاق). و علم خبر دادن به اجابت به سوی ناخوشایند، مانند اجابت فرزندان مادر عیسی. و علم تلبيس (اشتباه‌اندازی) که در آن متاع تو را از غیر جهتی که می‌دانی آن متاع توست، به تو می‌بخشد، برای تلبيس بر تو. پس هنگامی که پرده برداشته شود و بصر (بینایی) تیز باشد، می‌دانی که به تو نداده است مگر آنچه در دست تو بود. پس از نزد خود بر تو نیفزود و از آنچه نزد اوست به تو سودی نرساند، مگر تغییر صورت‌ها. پس هر کس بر این علم وقوف یابد، در نوشیدنی خود به سیرابی قائل می‌شود، و هر کس از آن محروم شود، پیوسته تشنه می‌ماند، در حالی که آبی که او را سیراب می‌کند، نزد اوست و او احساس نمی‌کند که نزد اوست. و این از والاترین علمی است که به عارفان بالله (المعرفة) بخشیده می‌شود. پس آن مانند باران برای زمین است. و عین آنچه از سیرابی می‌طلبی، جز بخار آن نیست که از آن بالا رفت و سپس به صورت باران بر آن نازل شد. پس صورتش به دلیل اختلاف محل تغییر کرد. پس ننوشید و سیراب نشد مگر از آب خودش. و اگر این را می‌دانست، ابرها او را محجوب نمی‌کردند. پس این نوع از علم در علم الهی محقق شد. پس به تو نداد مگر از خودت. و آنچه او بر آن است، جز خودش آن را نمی‌داند. پس علم هر عالمی از نفس خودش است. به همین دلیل اهل الله گفتند: خدا را جز خدا نمی‌شناسد، و پیامبر را جز ولیّ نمی‌شناسد، و ولیّ را جز ولیّ نمی‌شناسد. و همچنین علم اسباب نجات و سعادت، و علم امتحانات با سختی و آسانی برای صابر و شاکر را در بر می‌گیرد. و علم مناسبتی که به واسطه آن کسی که امر خدا را عصیان کرد، امر او را امتثال نکرد؛ و کسی که آن را امتثال کرد، آیا با امری مناسب امتثال کرد یا با عدم مناسب؟ و علم سبب تأثیر پایین‌تر در بالاتر، مانند مسلط شدن حیوانات بر انسان، از نیش کک تا بالاتر از آن. و خداوند متعال می‌فرماید: أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ (دعای دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم). و علم مشارکت حیوانات با انسان در علوم از طریق تجلی (التجلی). و علم اینکه هر کس تمام آنچه از حق (الحق) به او رسید را رد کرد، از کجا رد کرد؛ و هر کس بخشی از آن را رد کرد، از کجا رد کرد؛ و آیا حکم الهی در مورد آنان یکسان است یا خیر. و علم اینکه صحابه در روز حنین از کجا فرار کردند. و علم مؤاخذه بالاتر به وسیله پایین‌تر، هنگامی که دلالتی را نصب کند و کسی آن را نصب کند. و علم سوابق و لواحق، و علم وحدت در عین جمع، و علم مراتب و درجات. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}