{
  "id": 306,
  "title": {
    "ar": "الباب السادس وثلاثمائة في معرفة منزل اختصام الملإ الأعلى من الحضرة الموسوية",
    "en": "Chapter Three Hundred and Six: Concerning the Gnosis of the Station of the Contention of the Highest Assembly (الملإ الأعلى), derived from the Mosaic Presence (الحضرة الموسوية).",
    "ur": "باب تین سو چھ: حضورِ موسوی سے ملأ اعلیٰ کے اختصام (اختصام الملإ الأعلى) کے منزل کی معرفت میں",
    "fa": "باب سیصد و ششم در معرفت منزلگاه نزاع و خصومت ملأ اعلی از حضرت موسوی."
  },
  "content": {
    "ar": "## «الباب السادس وثلاثمائة في معرفة منزل اختصام الملإ الأعلى من الحضرة الموسوية»\n\n\n> تخاصم الملإ العلوي برهان *** مع اعتراض بدا منهم ونسيان‏\n\n\n> على تناسبنا في أصل خلقتنا *** في الطبع وهو كمال فيه نقصان‏\n\n\n> إن الطبيعة دون النفس موضعها *** فحكمها في الهباء الكل جثمان‏\n\n\n> وإن تولد عن روح وعن فلك *** عناصر هي في الأبيات أركان‏\n\n\n> فكل جسم له روح مدبرة *** من طبعه فهو نوام ويقظان‏\n\n\n> وكل جسم فإن الطبع يحكمه *** فالجسم والروح تنور وبركان‏\n\n\n> فانظر ترى عجبا إذ ليس يخرج عن *** حكم الطبيعة أملاك وإنسان‏\n\n\n> وما أنا قلت هذا بل أتتك به *** الأنبياء وتوراة وقرآن‏\n\n\n### [علم مقامات الملائكة من العالم‏]\n\n\nوأما ما يتضمنه هذا المنزل من العلوم علم المقامات مقامات الملائكة من العالم ومرتبتهم وهل يعلم ذلك هنا أو في الدار الآخرة وعلم المقام الذي ظهر منه في العالم علم الخلاف الواقع في العالم والجدلي وما له من أحوال الأسماء الإلهية المعارضة كالغفار والمنتقم إذا طلب كل واحد منهما حكمه في العاصي وعلم الأرض ولأي سبب وجدت وعلم الجبال وهل هي من الأرض أم لا وهل وجدت دفعة أو كما ذهبت إليه الحكماء وعلم النكاح الساري في العالم العقلي والمعنوي والحسي والحيواني وعلم النوم وهل هو في الجنة أم لا وهل له حكم في العالم الإلهي وعلم الليل والنهار واليوم والزمان وعلم السموات وعلم الشمس وعلم المولدات وعلم الغيوب وعلم الآخرة وما يتعلق به من تفاصيله وعلم الأسباب الأخروية وعلم كلام الرحمن وهل ينسب إليه الكلام كما ينسب إلى الاسم الله أم لا وعلم السكتة العامة وعلم ما جاءت به الرسل من التعريفات لا من الأحكام فهذه أمهات المسائل من العلوم التي يتضمنها هذا المنزل فلنذكر منها ما يسر الله على لساني والله المؤيد سبحانه والمعين وعليه أتوكل وبه أستعين يقول الله تعالى مخبرا عن نبيه صَلَّى اللهُ عَليهِ وسَلَّم ما كانَ لِي من عِلْمٍ بِالْمَلَإِ الْأَعْلى‏ إِذْ يَخْتَصِمُونَ ولما\n\n\nقال النبي صَلَّى اللهُ عَليهِ وسَلَّم في أن اختصام الملإ الأعلى في الكفارات ونقل الاقدام إلى الصلاة في الجماعات وإسباغ الوضوء في المكاره والتعقيب في المساجد أثر الصلوات‏\n\n\nفمعنى ذلك أي هذه الأعمال أفضل ومعنى أفضل على وجهين الواحد أي الأعمال أحب إلى الله من هذه الأعمال والوجه الآخر أي الأعمال أعظم درجة في الجنة للعامل بها وأما أسرار هذه الأعمال فهي التي يطلبها هذا المنزل فاعلم ابتداء أن الملائكة عليه السلام لو لم تكن الأنوار التي خلقت منها موجودة من الطبيعة مثل السموات التي عمرتها هؤلاء الملائكة فإنها كانت دخانا والدخان والبخار من عالم الطبيعة فالبخار غايته دون دائرة الزمهرير وذلك أن الأبخرة إنما تصعد بما فيها من الحرارة وتنزل عن الدخان بما فيها من الرطوبة فإن الأبخرة عن الحرارة التي في الأرض فإن هذه العناصر مركبة من الطبائع الأربع غير أنه ما هي في كل واحدة منها على الاعتدال فما غلب عليه برده ورطوبته سمي ماء وكذلك ما بقي فالبخار الخارج من الماء والأرض إنما هو بما فيهما من الحرارة وإنما علا الدخان فوق كرة الأثير لغلبة الحرارة واليبوسة عليه لأن كمية الحرارة واليبس فيه أكثر من الرطوبة ولذلك كانت السموات أجساما شفافة وخلق الله عمار كل فلك من طبيعة فلكه فلذلك كانت الملائكة من عالم الطبيعة ونعتوا بأنهم يختصمون والخصام لا يكون إلا فيمن ركب من الطبائع لما فيها من التضاد فلا بد فيمن يتكون عنها إن يكون على حكم الأصل فالنور الذي خلقت منه الملائكة نور طبيعي فكانت الملائكة فيها الموافقة من وجه والمخالفة من وجه فهذا سبب اختلاف الملإ الأعلى فيما يختصمون فيه فلو أن الله‏\nيعلمهم بما هو الأفضل عنده من هذه الأعمال والأحب إليه ما تنازعوا ولو أنهم يكشفون ارتباط درجات الجنان بهذه الأعمال لحكموا بالفضيلة للأعلى منها وإنما الله سبحانه غيب عنهم ذلك فهم في هذه المسألة بمنزلة علماء البشر إذا قعدوا في مجلس مناظرة فيما بينهم في مسألة من الحيض الذي لا نصيب لهم فيه بخلاف المسائل التي لهم فيها نصيب وإنما قلنا ذلك لأن الكفارات إنما هي لإحباط ما خالف فيه المكلف ربه من أوامره ونواهيه والملائكة قد شهد الله لهم بالعصمة أنهم لا يَعْصُونَ الله ما أَمَرَهُمْ ويَفْعَلُونَ ما يُؤْمَرُونَ به وما بلغنا إن عندهم نهي وإذا لم يعصوا وكانوا مطيعين فليس لهم في أعمال الكفارات قدم فهم يختصمون فيما لا قدم لهم فيه وكذلك ما بقي من الأعمال التي لا قدم لهم فيها فهم مطهرون فلا يتطهرون فلا يتصفون في طهارتهم بالإسباغ والإبلاغ في ذلك وغير الإسباغ وكذلك المشي إلى مساجد الجماعات لشهود الصلوات ليس لهم هذا العمل فإن قلت فإنهم يسعون إلى مجالس الذكر ويقول بعضهم لبعض هلموا إلى بغيتكم‏\n\n\n### [إن الذكر ما هو عين الصلاة]\n\n\nفاعلم إن الذكر ما هو عين الصلاة ونحن إنما نتكلم في عمل خاص في الجماعة ليس لهم فيه دخول مثل ما لبني آدم فإنهم ليسوا على صور بنى آدم بالذات وإنما لهم التشكل فيهم وقد علم جبريل عليه السلام رسول الله صَلَّى اللهُ عَليهِ وسَلَّم الصلوات بالفعل وتلك من جبريل حكاية يحكيها للتعليم والتعريف بالأوقات وأما التعقيب أثر الصلوات فإنما ذلك للمصلين على هذه الهيئة المخصوصة التي ليست للملائكة فما اختصموا في أمر هو صفتهم فلهذا ضربنا مسألة الحيض مثلا وسبب ذلك أن الملائكة تدعو بنى آدم في لماتها إلى العمل الصالح وترغبهم في الأفضل فلهذا اختصمت في الأفضل حتى تأمرهم به وبعد أن نبهناك على سبب الخصام فلنبين لك ما اختصموا فيه‏\n\n\n### [إن الكفارات إنما شرعت لتكون حجبا بين العبد وبين ما عرض إليه نفسه من حلول البلايا بالمخالفات‏]\n\n\nفاعلم إن الكفارات إنما شرعت لتكون حجبا بين العبد وبين ما عرض إليه نفسه من حلول البلايا بالمخالفات التي عملها مأمورا كان بذلك العمل أو منهيا عنه فإذا جاء المنتقم بالبلاء المنزل الذي تطلبه هذه المخالفة وجدت هذه الأعمال قد سترته في ظل جناحها واكتنفته وصارت عليه جنة ووقاية والاسم الغفار حاكم هذه الكفارات فلم يجد البلاء منفذا فلم ينفذ فيه الوعيد لغلبة سلطان هذا العمل المسمى كفارة والكفر الستر ومنه سمي الزراع كافرا لأنه يستر البذر في الأرض ويغطيه بالتراب وقد أشار إلى ذلك صَلَّى اللهُ عَليهِ وسَلَّم حيث قال في الزاني إن الايمان يخرج منه حتى يصير عليه كالظلة فإذا أقلع رجع إليه الايمان‏\n\n\nوذلك أن الزاني أو المخالف في حال الزنا يطلبه البلاء والعقوبة من الله إما في حال الزنا أو عقبه فإن كان في حال الزنا فله من البلاء على قدر ما مضى منه فإنه قد يطرأ عارض يمنعه من تمام الفعل وهو إنزال الماء أو خروج الذكر من الفرج فيجد الايمان على الزاني كالظلة وهو حجاب قوي فلا يستطيع النفوذ معه ولا الوصول إليه فإذا كان الزاني في حال الزنا محفوظا معصوما من البلاء لشرف الايمان في الدنيا فما ظنك به في الآخرة فإن صولته في الآخرة أتم من حكمه في الدنيا فالكفارات كلها جنن هذه مرتبتها لا تزيد عليها وما زاد على ذلك من درجة في الجنة أو منزلة فهو ما خرج في ذلك العمل من حد كونه كفارة والكفارة لا ترفع الدرجات وإنما هي عواصم من هذه القواصم وأما قوله كفارات جمع كفارة ببنية المبالغة أنباء بذلك على أنه لصورة العمل الواحد أنواع كثيرة من البلاء وذلك لأن العمل يتضمن حركات مختلفة ولكل حركة بلاء خاص من عند الله فيكون هذا العمل المكفر له في كل بلاء تطلبه المخالفة سترا يستره به من الوصول إليه والتأثير فيه فهو وإن كان مفردا للفظ فهو متكثر في المعنى وكذلك عمل الكفارة فهو واحد من حيث الاسم وهو كثير من حيث أجزاؤه فإن كان العمل لا يتجزأ كالتوبة التي هي مكفرة فالبلاء الخاص الذي تدفعه هذه التوبة هو بلاء واحد لا تعداد فيه ولا كثرة فإن الأمور الإلهية تجري على موازين إلهية قد وضعها الله في العالم ولا سيما في العقوبات فلا تطفيف فيها أصلا وإذا كان الشي‏ء الواحد وإن لم يكن معصية كفارات مختلفة مثل الحاج يحلق رأسه لأذى يجده أو المتمتع أو المظاهر أو من حلف على يمين فرأى خيرا منها فإن مثل هذا له كفارات مختلفة أي عمل مكفر فعل سقط عنه الآخر فقام هذا العمل الواحد مقام ما بقي مما سقط عنه فإن كانت اليمين غموسا فإن الكفارة فيه ككفارة سائر الخطايا فيتصور خطاب الملائكة أي كفارات التخيير أولى بأن يفعل أو لما ذا تكون كفارة وما عمل شيئا تجب أو تتوجه فيه العقوبة حتى تكون هذه الكفارة تدفعه فعن أي شي‏ء تستره فالملأ الأعلى يختصمون في مثل هذا أيضا فالعالم صاحب‏\nالميزان ينظر في الذي وقع عليه اليمين فيخرج من الكفارة المخير فيها ما يناسب ما حلف عليه ما لم يكن فيها فمن لم يجد وكذلك في الفداء وهذا كله مما يكون فيه النظر ويؤدي إلى التنازع فالظاهر من هذا الأمر أن الملائكة لهم نظر فكري يناسب خلقهم ولهذا من الحقائق الإلهية قوله تعالى يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآياتِ ثم ختم الآية لَعَلَّكُمْ بِلِقاءِ رَبِّكُمْ تُوقِنُونَ أي تثبتون على موازين الحكم ومما يؤيد هذه الحالة\n\n\nقوله تعالى في الأخبار الإلهية ما ترددت في شي‏ء أنا فاعله ترددي‏\n\n\nالحديث فوصف نفسه بالتردد الذي يوصف به المحدث من القوة المفكرة وهو في الملائكة اختصامهم فيما ذكرنا فإن كنت ذا فهم فانظر فيما دللنا به من الخبر الإلهي الصحيح وأما قوله في خصامهم في نقل الاقدام أو السعي إلى الجماعات له من الحقائق الإلهية\n\n\nمن تقرب إلي شبرا تقربت منه ذراعا ومن تقرب إلي ذراعا تقربت منه باعا ومن أتاني يسعى أتيته هرولة\n\n\nوقوله تعالى ومن ذكرني في ملأ ذكرته في ملأ خير منهم‏\n\n\nوقوله ينزل ربنا إلى سماء الدنيا\n\n\nفافهم مناسبة هذه الصفة العملية من بنى آدم من الحقائق الإلهية فكلامهم في مثل هذه أي الحقائق الإلهية أقرب مناسبة لهذا الفعل فاختلفوا وكذلك قوله إسباغ الوضوء على المكاره له من الحقائق الإلهية\n\n\nقوله تعالى في الأخبار الإلهية في قبضه نسمة عبده المؤمن يكره الموت وأنا أكره مساءته‏\n\n\nفوصف نفسه بأنه يكره وكذلك من هذه الحقيقة يسبغ المؤمن الوضوء على كره منه من أجل شدة البرد فله الأجر أجر الكراهة من هذه الحقيقة الإلهية وكذلك قوله فيما يختصمون فيه التعقيب وهو الجلوس في المسجد بعد الفراغ من الصلاة له من الحقائق\n\n\nالإلهية قوله تعالى سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلانِ وما تفرغ لنا إلا منا قال تعالى يَسْئَلُهُ من في السَّماواتِ والْأَرْضِ كُلَّ يَوْمٍ هُوَ في شَأْنٍ فالعبد إذا فرغ من الصلاة فقعد في المسجد يذكر ربه تعالى عقيب الصلاة فانتقل من مناجاته في حالة ما إلى مناجاته في حالة غيرها في بيت واحد فمن مقام سنفرغ لكم يكون له الميزان على هذا العمل فقد ارتبطت هذه الأعمال بالحقائق الإلهية التي وقعت فيها المناظرة بين الملإ الأعلى وفيها تفاصيل يطول ذكرها من المناسبات والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 306: On the Knowledge of the Station of the Dispute of the High Assembly (الملإ الأعلى) from the Mosaic Presence (الحضرة الموسوية)\n\nThe dispute of the Celestial Assembly (الملإ العلوي) is a proof,\nAlong with an objection that appeared from them, and forgetfulness.\n\nRegarding our proportionality in the origin of our creation,\nIn Nature (الطبع), which is a perfection containing deficiency.\n\nIndeed, Nature’s place is below the Soul (النفس),\nSo its ruling in the Dust (الهباء) is that everything is a body (جثمان).\n\nAnd though elements are generated from a spirit and a sphere,\nThey are the pillars in the verses (of existence).\n\nEvery body has a governing spirit\nFrom its nature, so it is sleeping and waking.\n\nAnd every body is ruled by Nature,\nSo the body and the spirit are an oven and a volcano.\n\nLook, and you will see a wonder, for neither\nAngels nor humans escape the rule of Nature.\n\nI did not say this, rather the Prophets,\nThe Torah, and the Quran brought it to you.\n\n### [The Science of the Stations of the Angels in the Cosmos]\n\nAs for the sciences contained within this station (منزل): the science of the stations (مقامات) of the angels in the Cosmos (العالم) and their rank, and whether this knowledge is attained here or in the Hereafter; the science of the station from which the dispute in the Cosmos arose; the science of the disagreement (الخلاف) that occurs in the Cosmos and the dialectical (الجدلي) aspect of it, and its relation to the conflicting Divine Names (الأسماء الإلهية) such as The Forgiving (الغفار) and The Avenger (المنتقم) when each demands its ruling concerning the disobedient one; the science of the Earth and the reason for its existence; the science of the Mountains, and whether they are part of the Earth or not, and whether they came into existence suddenly or as the philosophers (الحكماء) maintain; the science of marriage (النكاح) that permeates the intellectual, spiritual, sensory, and animal worlds; the science of sleep, and whether it exists in Paradise or not, and whether it has a ruling in the Divine World; the science of night, day, the day, and time (الزمان); the science of the Heavens; the science of the Sun; the science of the Generates (المولدات); the science of the Unseen (الغيوب); the science of the Hereafter and its detailed particulars; the science of the causes of the Hereafter; the science of the Speech of the All-Merciful (كلام الرحمن), and whether speech is attributed to Him as it is attributed to the Name Allah or not; the science of the General Silence (السكتة العامة); and the science of the definitions brought by the Messengers, not the rulings.\n\nThese are the fundamental issues of the sciences contained within this station. We shall mention what Allah facilitates upon my tongue. Allah, the Exalted, is the Supporter and the Helper; upon Him I rely, and from Him I seek aid.\n\nAllah the Exalted says, informing us about His Prophet (peace and blessings be upon him): <<مَا كَانَ لِي مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَىٰ إِذْ يَخْتَصِمُونَ>> (I had no knowledge of the High Assembly when they disputed).\n\nAnd when the Prophet (peace and blessings be upon him) said that the dispute of the High Assembly concerned expiations (الكفارات), the movement of feet toward congregational prayer, perfecting ablution (إسباغ الوضوء) despite hardships (المكاره), and sitting in the mosques after prayers (التعقيب)—\n\nThe meaning of this is: which of these deeds is superior? And the meaning of \"superior\" is twofold: First, which of these deeds is more beloved to Allah than the others? Second, which deed grants the worker the greatest degree in Paradise? As for the secrets of these deeds, they are what this station seeks.\n\nKnow, to begin with, that if the lights from which the angels (peace be upon them) were created were not derived from Nature (الطبيعة)—like the heavens they inhabit, which were smoke (دخان), and smoke and vapor are from the realm of Nature—[they would not dispute]. Vapor reaches its limit below the sphere of intense cold (الزمهرير). This is because vapors only ascend due to the heat they contain, and they descend below smoke due to the moisture they contain. Vapors arise from the heat in the earth, for these elements are composed of the four natures (الطبائع الأربع), though they are not in a state of equilibrium in each one. That which is dominated by coldness and moisture is called water, and likewise for the rest. The vapor that emerges from water and earth is due to the heat within them. Smoke rises above the sphere of the Aether due to the dominance of heat and dryness in it, because the quantity of heat and dryness is greater than the moisture. For this reason, the heavens are transparent bodies.\n\nAllah created the inhabitants of every sphere (فلك) from the nature of that sphere. Therefore, the angels are from the realm of Nature (الطبيعة), and they are described as disputing (يختصمون). Dispute only occurs among those composed of the natures (الطبائع) due to the opposition (التضاد) inherent in them. Thus, whoever is constituted by them must follow the rule of the origin.\n\nThe light from which the angels were created is a natural light (نور طبيعي). Therefore, the angels possess agreement from one perspective and disagreement from another. This is the reason for the difference of opinion among the High Assembly regarding what they dispute. If Allah had informed them of what is superior in His sight and more beloved to Him, they would not have disputed. And if they could unveil (يكشفون) the connection between the degrees of the Gardens (الجنان) and these deeds, they would have judged the superiority based on the highest degree. But Allah the Exalted concealed this from them. Thus, in this matter, they are like human scholars who sit in a council of debate concerning an issue like menstruation (الحيض), in which they have no personal share, unlike issues in which they do have a share.\n\nWe say this because expiations (الكفارات) are only for nullifying the disobedience of the accountable human (المكلف) toward his Lord regarding His commands and prohibitions. Allah has testified to the infallibility (العصمة) of the angels: <<لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ>> (They do not disobey Allah in what He commands them, but do what they are commanded). Since we have not been informed that they have prohibitions, and since they are obedient, they have no share (قدم) in the deeds of expiation. They dispute over something in which they have no share. Likewise for the remaining deeds in which they have no share: they are purified, so they do not purify themselves; thus, they are not characterized in their purification by perfecting (الإسباغ) and exaggerating in it, or by not perfecting it. Similarly, walking to the mosques for congregational prayers to witness the prayers is not an action they perform.\n\nIf you say: But they hasten to the gatherings of remembrance (الذكر) and say to one another, \"Come to your desire!\"\n\n### [That Remembrance is not the Essence of Prayer]\n\nKnow that remembrance (الذكر) is not the essence of the Prayer (الصلاة). We are speaking only about a specific act in congregation in which they have no participation, unlike the children of Adam. They are not in the physical forms of the children of Adam essentially (بالذات), though they can take on their forms (التشكل). Gabriel (peace be upon him) taught the Messenger of Allah (peace and blessings be upon him) the prayers by action, and that was a narration by Gabriel, relating it for the purpose of teaching and defining the times. As for sitting after prayers (التعقيب), that is only for those who pray in this specific manner, which is not the manner of the angels. They did not dispute over a matter that is their own characteristic. This is why we used the issue of menstruation as an example.\n\nThe reason for this is that the angels call the children of Adam in their inner thoughts (لماتهم) to righteous deeds and encourage them toward the superior ones. Therefore, they disputed over what is superior so that they might command humans to do it. Now that we have alerted you to the reason for the dispute, let us clarify what they disputed over.\n\n### [That Expiations were Legislated to be Veils between the Servant and the Afflictions Brought Upon Him by Transgressions]\n\nKnow that expiations (الكفارات) were legislated to be veils (حجبا) between the servant and the afflictions (البلايا) that he exposed himself to by committing transgressions, whether he was commanded to do that action or prohibited from it. When The Avenger (المنتقم) comes with the decreed affliction demanded by that transgression, He finds that these deeds have covered it in the shadow of their wing, surrounded it, and become a shield (جنة) and protection for it. The Name The Forgiving (الغفار) is the ruler of these expiations. Thus, the affliction finds no passage and the threat is not executed, due to the overwhelming authority of this deed called expiation (كفارة).\n\n*Kufr* (الكفر) means covering, which is why the farmer (الزراع) is called a *kafir* (كافر) because he covers the seed in the earth and conceals it with soil. The Prophet (peace and blessings be upon him) alluded to this when he said concerning the adulterer that faith leaves him until it becomes like a cloud (كالظلة) over him, and when he desists, faith returns to him.\n\nThis is because the adulterer or the transgressor, while committing adultery, is sought by affliction and punishment from Allah, either during the act or immediately after it. If it is during the act, he receives affliction commensurate with what has passed of the act. For an obstacle may suddenly arise that prevents him from completing the act, such as the emission of fluid or the withdrawal of the male organ from the female organ. He finds faith over the adulterer like a cloud (الظلة), which is a strong veil (حجاب قوي), preventing the affliction from penetrating or reaching him. If the adulterer is preserved and protected from affliction in this world due to the nobility of faith, what do you think of him in the Hereafter? For the authority of faith in the Hereafter is more complete than its ruling in this world.\n\nAll expiations are shields (جنن); this is their rank, and they do not exceed it. Any increase beyond that, whether in degree in Paradise or station, is due to the deed having exceeded its function as a mere expiation. Expiation does not raise degrees; rather, it is a protection (عواصم) against these destructive forces (القواصم).\n\nAs for His saying *Kaffarat* (كفارات), the plural of *Kaffara* (expiation) with the structure of exaggeration (بنية المبالغة), this indicates that a single form of action may correspond to many types of affliction. This is because the action involves different movements, and for every movement there is a specific affliction from Allah. Thus, this expiating deed acts as a cover (سترا) in every affliction demanded by the transgression, shielding the person from its reach and effect. Although the term is singular in wording, it is multiple in meaning.\n\nLikewise, the act of expiation is one in name but multiple in its parts. If the act is indivisible, like repentance (التوبة), which is an expiation, then the specific affliction that this repentance repels is a single affliction, without multiplicity or number. This is because Divine matters proceed according to Divine scales (موازين إلهية) that Allah has established in the Cosmos, especially concerning punishments, so there is absolutely no deficiency in them.\n\nWhen a single thing, even if it is not a sin, has different expiations—such as the pilgrim who shaves his head due to harm, or the one performing *Tamattu'* (Hajj type), or the one who commits *Zihar* (a form of divorce), or one who swears an oath and then sees something better—such a person has different expiations. Whichever expiating deed he performs, the others are dropped. This single deed takes the place of the remaining ones that were dropped. If the oath was a false oath (يمين غموس), the expiation for it is like the expiation for other sins.\n\nThus, the angels’ discourse can be imagined as: Which of the optional expiations (كفارات التخيير) is more worthy of being performed? Or why should there be an expiation when no action was committed that necessitates or warrants punishment, such that this expiation would repel it? What is it shielding against? The High Assembly disputes over such matters as well.\n\nThe scholar who possesses the scale (صاحب الميزان) examines the matter upon which the oath was sworn and selects from the optional expiations what is appropriate for what was sworn upon, if it is not already specified. Likewise in the case of ransom (الفداء). All of this is subject to intellectual consideration and leads to dispute.\n\nThe apparent conclusion from this matter is that the angels possess intellectual consideration (نظر فكري) appropriate to their creation. This is supported by the Divine Reality in His saying: <<يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ>> (He arranges [all] affairs, He details the signs), then concluding the verse: <<لَعَلَّكُمْ بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ>> (that you may be certain of the meeting with your Lord)—meaning, that you may be firm upon the scales of judgment.\n\nWhat supports this state is His saying in the Divine Narrations (الأخبار الإلهية): \"I have not hesitated (ما ترددت) about anything I am going to do as I hesitate...\" (The Hadith of hesitation).\n\nHe described Himself with hesitation (التردد), which is a quality ascribed to the created being (المحدث) possessing the faculty of thought. In the angels, this is manifested as their dispute over what we have mentioned. If you are a person of understanding, look into what we have indicated through this authentic Divine Narration.\n\nAs for their dispute concerning the movement of feet (نقل الاقدام) or hastening to the congregations, it is related to the Divine Realities (الحقائق الإلهية) in the Hadith: \"Whoever draws near to Me by a span, I draw near to him by a cubit; and whoever draws near to Me by a cubit, I draw near to him by an arm's length; and whoever comes to Me walking, I come to him running (هرولة).\"\n\nAnd His saying, the Exalted: \"And whoever remembers Me in an assembly, I remember him in an assembly better than theirs.\"\n\nAnd His saying: \"Our Lord descends to the lowest heaven.\"\n\nUnderstand the correspondence between this practical attribute of the children of Adam and the Divine Realities. Their discussion concerns which Divine Reality is most appropriate for this action, and thus they differed.\n\nLikewise, His saying regarding perfecting ablution (إسباغ الوضوء) despite hardships (المكاره) is related to the Divine Reality in His saying in the Divine Narrations: \"In My seizing the soul of My believing servant, he dislikes death, and I dislike distressing him (مساءته).\"\n\nHe described Himself as disliking (يكره). Similarly, from this Reality, the believer perfects ablution despite his aversion (كره منه) due to the severity of the cold. He receives the reward of aversion (أجر الكراهة) from this Divine Reality.\n\nLikewise, concerning what they dispute over: sitting after prayer (التعقيب), which is remaining in the mosque after finishing the prayer. This is related to the Divine Reality in His saying: <<سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ>> (We will attend to you, O you two heavy ones [jinn and mankind]). He only attends to us from us. He the Exalted said: <<يَسْأَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (All those in the heavens and the earth ask Him; every day He is in [some] affair).\n\nWhen the servant finishes the prayer and sits in the mosque remembering his Lord the Exalted after the prayer, he moves from intimate conversation (مناجاته) in one state to intimate conversation in another state, while remaining in the same house. It is from the station of <<سَنَفْرُغُ لَكُمْ>> that the scale (الميزان) for this action is established.\n\nThus, these deeds are linked to the Divine Realities (الحقائق الإلهية) over which the High Assembly disputed. There are details concerning these correspondences that would take too long to mention. And Allah speaks the Truth, and He guides to the Way.",
    "ur": "باب نمبر تین سو چھ: حضرت موسویہ (موسیٰ علیہ السلام کی حضوری) سے ملأ اعلیٰ کے جھگڑے کے مقام کی معرفت میں\n\nعلوی ملأ (الملإ العلوي) کا جھگڑا ایک دلیل ہے،\nاس اعتراض اور بھول کے ساتھ جو ان سے ظاہر ہوئی۔\n\nہماری خلقت کی اصل میں ہماری مناسبت پر،\nجو کہ طبیعت (الطبع) میں ہے، اور یہ ایسا کمال ہے جس میں نقصان بھی ہے۔\n\nبے شک طبیعت (الطبيعة) کا مقام نفس سے نیچے ہے،\nلہٰذا اس کا حکم ہباء (الهباء) میں ہے، اور سب کچھ جسمانی ہے۔\n\nاور اگرچہ روح اور فلک سے عناصر پیدا ہوئے ہیں،\nجو ان ابیات میں ارکان ہیں۔\n\nپس ہر جسم کے لیے ایک مدبر روح ہے،\nجو اس کی طبیعت (الطبع) سے ہے، لہٰذا وہ سوتا بھی ہے اور جاگتا بھی ہے۔\n\nاور ہر جسم پر طبیعت (الطبع) ہی حکم کرتی ہے،\nپس جسم اور روح تنور اور آتش فشاں کی مانند ہیں۔\n\nپس دیکھو، تم ایک عجیب چیز دیکھو گے، کیونکہ\nفرشتے اور انسان طبیعت (الطبيعة) کے حکم سے باہر نہیں نکلتے۔\n\nاور یہ میں نے نہیں کہا، بلکہ یہ بات تمہارے پاس\nانبیاء، تورات اور قرآن لے کر آئے ہیں۔\n\n### [عالم سے ملائکہ کے مقامات کا علم]\n\nاور جو علوم یہ مقام اپنے اندر سموئے ہوئے ہے، ان میں عالم سے ملائکہ کے مقامات کا علم اور ان کا مرتبہ شامل ہے، اور یہ کہ آیا اس کا علم یہاں (دنیا میں) ہوتا ہے یا دارِ آخرت میں۔ اور اس مقام کا علم جس سے وہ عالم میں ظاہر ہوا، عالم میں واقع ہونے والے اختلاف اور جدلی (الجدلي) کا علم، اور وہ احوال جو متضاد اسماء الٰہیہ جیسے الغفار (بخشنے والا) اور المنتقم (انتقام لینے والا) کے ہیں، جب ان میں سے ہر ایک گناہ گار میں اپنا حکم طلب کرتا ہے۔ اور زمین کا علم اور یہ کہ وہ کس سبب سے وجود میں آئی، اور پہاڑوں کا علم اور یہ کہ آیا وہ زمین کا حصہ ہیں یا نہیں، اور کیا وہ یکبارگی وجود میں آئے یا جیسا کہ حکماء کا نظریہ ہے؟ اور نکاح کا علم جو عالمِ عقلی، معنوی، حسی اور حیوانی میں جاری و ساری ہے۔ اور نیند کا علم اور یہ کہ آیا وہ جنت میں ہوگی یا نہیں، اور کیا اس کا عالمِ الٰہی میں کوئی حکم ہے؟ اور رات، دن، یوم اور زمان کا علم۔ اور آسمانوں کا علم، اور سورج کا علم، اور مولدات (پیدا ہونے والی چیزوں) کا علم، اور غیوب کا علم، اور آخرت کا علم اور اس سے متعلقہ تفصیلات۔ اور اخروی اسباب کا علم۔ اور کلامِ رحمن کا علم، اور یہ کہ آیا کلام کی نسبت اس کی طرف کی جاتی ہے جیسا کہ اسم اللہ کی طرف کی جاتی ہے یا نہیں؟ اور سکتہ عامہ (عمومی خاموشی) کا علم۔ اور وہ تعریفات جو رسول لائے ہیں، نہ کہ احکام۔ پس یہ ان علوم کے بنیادی مسائل ہیں جو یہ مقام اپنے اندر رکھتا ہے۔ لہٰذا ہم ان میں سے وہ ذکر کریں گے جو اللہ تعالیٰ میرے لیے میری زبان پر آسان کر دے، اور اللہ سبحانہ و تعالیٰ ہی مددگار اور معاون ہے، اور میں اسی پر توکل کرتا ہوں اور اسی سے مدد مانگتا ہوں۔\n\nاللہ تعالیٰ اپنے نبی صلی اللہ علیہ وسلم کے بارے میں خبر دیتے ہوئے فرماتا ہے:\n**مَا كَانَ لِيَ مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَىٰ إِذْ يَخْتَصِمُونَ**\n(مجھے ملأ اعلیٰ (الْمَلَإِ الْأَعْلَىٰ) کے جھگڑے کا کوئی علم نہ تھا جب وہ جھگڑ رہے تھے) (ص: 69)۔\n\nاور جب نبی صلی اللہ علیہ وسلم نے فرمایا کہ ملأ اعلیٰ (الملإ الأعلى) کا جھگڑا کفارات (الکفارات) میں، اور جماعت کی نماز کے لیے قدم اٹھا کر جانے میں، اور ناگواریوں میں وضو کو کامل کرنے (إسباغ الوضوء في المكاره) میں، اور نمازوں کے بعد مسجدوں میں ٹھہرنے (التعقيب في المساجد) میں ہے۔\n\nپس اس کا مطلب یہ ہے کہ ان اعمال میں سے کون سا افضل ہے؟ اور افضل ہونے کے دو پہلو ہیں: پہلا یہ کہ ان اعمال میں سے کون سا عمل اللہ کو زیادہ محبوب ہے؟ اور دوسرا پہلو یہ کہ ان اعمال میں سے کون سا عمل اس کے عامل کے لیے جنت میں سب سے بڑا درجہ رکھتا ہے؟ اور ان اعمال کے اسرار ہی وہ ہیں جن کی طلب یہ مقام کرتا ہے۔\n\nپس ابتداءً یہ جان لو کہ اگر ملائکہ علیہم السلام کے وہ انوار جن سے وہ پیدا کیے گئے، طبیعت (الطبيعة) سے موجود نہ ہوتے، جیسے کہ وہ آسمان جن کو ان فرشتوں نے آباد کیا، کیونکہ وہ دھواں تھے، اور دھواں اور بخار عالمِ طبیعت (الطبيعة) سے ہیں۔ اور بخار کی انتہا زمہریر کے دائرے سے نیچے ہے، کیونکہ بخارات اپنی حرارت کی وجہ سے اوپر چڑھتے ہیں اور دھوئیں سے نیچے اترتے ہیں کیونکہ ان میں رطوبت ہوتی ہے۔ بے شک بخارات زمین کی حرارت سے پیدا ہوتے ہیں۔ یہ عناصر چاروں طبائع سے مرکب ہیں، مگر یہ کہ وہ ان میں سے ہر ایک میں اعتدال پر نہیں ہیں۔ پس جس پر اس کی ٹھنڈک اور رطوبت غالب آ جائے اسے پانی کہا جاتا ہے، اور اسی طرح باقی بھی۔ اور پانی اور زمین سے نکلنے والا بخار صرف اس حرارت کی وجہ سے ہے جو ان میں موجود ہے۔ اور دھواں کرہ اثیر سے اوپر صرف اس لیے گیا کہ اس پر حرارت اور خشکی غالب تھی، کیونکہ اس میں حرارت اور خشکی کی مقدار رطوبت سے زیادہ ہے۔ اسی لیے آسمان شفاف اجسام ہیں۔ اور اللہ نے ہر فلک کے آباد کرنے والوں کو اس کے فلک کی طبیعت (الطبيعة) سے پیدا کیا ہے۔ اسی لیے ملائکہ عالمِ طبیعت (الطبيعة) سے تھے، اور ان کی صفت یہ بیان کی گئی کہ وہ جھگڑتے ہیں (يختصمون)، اور جھگڑا صرف اسی میں ہوتا ہے جو طبائع سے مرکب ہو، کیونکہ ان میں تضاد پایا جاتا ہے۔ لہٰذا جو بھی ان سے وجود میں آئے گا، اس کے لیے اصل کے حکم پر ہونا ضروری ہے۔ پس وہ نور جس سے ملائکہ پیدا کیے گئے، وہ ایک طبعی نور تھا، لہٰذا ملائکہ میں ایک پہلو سے موافقت اور ایک پہلو سے مخالفت پائی جاتی تھی۔ یہی وجہ ہے ملأ اعلیٰ (الملإ الأعلى) کے اس اختلاف کی جس میں وہ جھگڑتے ہیں۔\n\nاگر اللہ تعالیٰ انہیں بتا دیتا کہ ان اعمال میں سے کون سا اس کے نزدیک افضل اور زیادہ محبوب ہے، تو وہ جھگڑا نہ کرتے۔ اور اگر وہ جنت کے درجات کا ان اعمال سے تعلق کشف (الکشف) کر لیتے، تو وہ ان میں سے اعلیٰ کے لیے فضیلت کا حکم لگا دیتے۔ لیکن اللہ سبحانہ و تعالیٰ نے یہ بات ان سے پوشیدہ رکھی ہے، لہٰذا وہ اس مسئلے میں بشر کے علماء کی طرح ہیں جب وہ کسی ایسے حیض کے مسئلے پر مناظرے کی مجلس میں بیٹھیں جس میں ان کا کوئی حصہ نہیں، برخلاف ان مسائل کے جن میں ان کا حصہ ہے۔\n\nاور ہم نے یہ اس لیے کہا کہ کفارات (الکفارات) تو صرف اس لیے مشروع کی گئیں ہیں تاکہ مکلف نے اپنے رب کے اوامر و نواہی کی جو خلاف ورزی کی ہے، اسے مٹا دیا جائے۔ اور اللہ نے ملائکہ کو عصمت کی گواہی دی ہے کہ وہ:\n**لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ**\n(اللہ کے حکم کی نافرمانی نہیں کرتے اور وہی کرتے ہیں جس کا انہیں حکم دیا جاتا ہے) (التحریم: 6)۔\nاور ہمیں یہ نہیں پہنچا کہ ان کے پاس کوئی نہی (منع) ہے۔ اور جب وہ نافرمانی نہیں کرتے اور مطیع ہیں، تو کفارات (الکفارات) کے اعمال میں ان کا کوئی قدم نہیں ہے۔ پس وہ ایسی چیز میں جھگڑتے ہیں جس میں ان کا کوئی قدم نہیں ہے۔ اور اسی طرح باقی اعمال جن میں ان کا کوئی قدم نہیں ہے۔ وہ پاک ہیں، لہٰذا وہ طہارت حاصل نہیں کرتے، پس وہ اپنی طہارت میں اسباغ (کامل کرنے) اور اس میں مبالغہ کرنے یا غیر اسباغ کی صفت سے متصف نہیں ہوتے۔ اور اسی طرح جماعت کی نمازوں میں حاضر ہونے کے لیے مسجدوں کی طرف چل کر جانا، یہ عمل ان کے لیے نہیں ہے۔\n\nاگر تم کہو کہ وہ تو ذکر کی مجالس کی طرف دوڑتے ہیں اور ایک دوسرے سے کہتے ہیں کہ \"آؤ اپنی مطلوبہ چیز کی طرف\"۔\n\n### [بے شک ذکر نماز کی عین نہیں ہے]\n\nتو جان لو کہ ذکر نماز کی عین نہیں ہے، اور ہم تو ایک خاص عمل کے بارے میں بات کر رہے ہیں جو جماعت میں ہوتا ہے اور جس میں بنی آدم کی طرح ان کا کوئی دخل نہیں ہے۔ کیونکہ وہ ذاتاً بنی آدم کی صورت پر نہیں ہیں، بلکہ ان کے لیے ان کی صورت میں تشکل اختیار کرنا ممکن ہے۔ اور جبرائیل علیہ السلام نے رسول اللہ صلی اللہ علیہ وسلم کو نمازیں عملاً سکھائی تھیں، اور جبرائیل کی طرف سے یہ تعلیم اور اوقات کی تعریف کے لیے ایک حکایت تھی۔ اور جہاں تک نمازوں کے بعد ٹھہرنے (التعقيب) کا تعلق ہے، تو یہ صرف ان نمازیوں کے لیے ہے جو اس مخصوص ہیئت پر نماز پڑھتے ہیں جو ملائکہ کے لیے نہیں ہے۔ پس انہوں نے ایسے معاملے میں جھگڑا نہیں کیا جو ان کی صفت ہو۔ اسی لیے ہم نے حیض کے مسئلے کی مثال دی تھی۔ اور اس کا سبب یہ ہے کہ ملائکہ بنی آدم کو ان کے دلوں میں نیک عمل کی طرف بلاتے ہیں اور انہیں افضل کی ترغیب دیتے ہیں، اسی لیے انہوں نے افضل میں جھگڑا کیا تاکہ وہ انہیں اس کا حکم دے سکیں۔ اور جب ہم نے تمہیں جھگڑے کے سبب سے آگاہ کر دیا ہے، تو اب ہم تمہیں بتاتے ہیں کہ انہوں نے کس چیز میں جھگڑا کیا۔\n\n### [بے شک کفارات صرف اس لیے مشروع کی گئیں تاکہ بندے اور ان مصیبتوں کے درمیان پردہ بن جائیں جنہیں اس نے اپنی خلاف ورزیوں کے ذریعے اپنے اوپر وارد کیا]\n\nپس جان لو کہ کفارات (الکفارات) صرف اس لیے مشروع کی گئیں تاکہ بندے اور ان مصیبتوں کے درمیان پردہ بن جائیں جنہیں اس نے اپنی خلاف ورزیوں کے ذریعے اپنے اوپر وارد کیا، خواہ وہ عمل جس کی خلاف ورزی کی گئی، مامور بہ تھا یا ممنوع۔ پس جب المنتقم (انتقام لینے والا) اس نازل ہونے والی مصیبت کے ساتھ آتا ہے جسے یہ خلاف ورزی طلب کرتی ہے، تو وہ ان اعمال کو پاتا ہے کہ انہوں نے اسے اپنے پروں کے سائے میں چھپا لیا ہے اور اسے گھیر لیا ہے، اور وہ اس کے لیے ڈھال اور بچاؤ بن گئے ہیں۔ اور اسم الغفار (بخشنے والا) ان کفارات (الکفارات) کا حاکم ہے۔ پس مصیبت کو کوئی راستہ نہیں ملتا، اور اس میں وعید نافذ نہیں ہوتی، کیونکہ اس عمل کا غلبہ ہے جسے کفارہ (الکفارة) کہا جاتا ہے۔ اور کفر کا معنی ہے چھپانا، اور اسی سے کسان کو کافر کہا جاتا ہے کیونکہ وہ بیج کو زمین میں چھپاتا ہے اور اسے مٹی سے ڈھانپ دیتا ہے۔\n\nاور نبی صلی اللہ علیہ وسلم نے اس کی طرف اشارہ کیا جہاں آپ نے زانی کے بارے میں فرمایا کہ:\n**إن الايمان يخرج منه حتى يصير عليه كالظلة فإذا أقلع رجع إليه الايمان**\n(ایمان اس سے نکل جاتا ہے یہاں تک کہ وہ اس پر سائبان کی طرح ہو جاتا ہے، پس جب وہ باز آ جاتا ہے تو ایمان اس کی طرف لوٹ آتا ہے)۔\n\nاور یہ اس لیے ہے کہ زانی یا خلاف ورزی کرنے والا زنا کی حالت میں، یا اس کے بعد، اللہ کی طرف سے مصیبت اور سزا کا طالب ہوتا ہے۔ پس اگر وہ زنا کی حالت میں ہو، تو اسے اس مصیبت کا سامنا ہوتا ہے جو اس سے گزر چکی ہے۔ کیونکہ بعض اوقات کوئی عارض پیش آ جاتا ہے جو اسے فعل کی تکمیل سے روک دیتا ہے، جیسے پانی کا انزال نہ ہونا یا شرمگاہ سے ذکر کا باہر نکل جانا۔ پس وہ ایمان کو زانی پر سائبان کی طرح پاتا ہے، اور یہ ایک مضبوط پردہ ہے، لہٰذا وہ اس کے ساتھ نفوذ نہیں کر سکتا اور نہ ہی اس تک پہنچ سکتا ہے۔ پس جب زانی دنیا میں ایمان کے شرف کی وجہ سے مصیبت سے محفوظ اور معصوم ہے، تو آخرت میں اس کے بارے میں تمہارا کیا خیال ہے؟ کیونکہ آخرت میں اس کی قوت دنیا میں اس کے حکم سے زیادہ کامل ہے۔ تمام کفارات (الکفارات) ڈھالیں ہیں، ان کا یہی مرتبہ ہے، اس سے زیادہ نہیں بڑھتا۔ اور جو اس سے زیادہ ہو، جیسے جنت میں کوئی درجہ یا کوئی مقام، تو وہ اس عمل میں سے اس حد سے نکل جانا ہے کہ وہ کفارہ (الکفارة) ہو۔ اور کفارہ درجات کو بلند نہیں کرتا، بلکہ وہ ان ہلاک کرنے والی چیزوں سے بچانے والا ہے۔\n\nاور آپ کا قول \"کفارات\" (جمع کفارہ) مبالغے کے صیغے کے ساتھ، اس بات کی خبر دیتا ہے کہ ایک عمل کی صورت کے لیے مصیبت کی کئی قسمیں ہیں۔ اور یہ اس لیے ہے کہ عمل مختلف حرکات پر مشتمل ہوتا ہے، اور ہر حرکت کے لیے اللہ کی طرف سے ایک خاص مصیبت ہوتی ہے۔ پس یہ کفارہ دینے والا عمل ہر اس مصیبت میں جو خلاف ورزی طلب کرتی ہے، ایک پردہ ہوتا ہے جو اسے اس تک پہنچنے اور اس میں اثر انداز ہونے سے چھپاتا ہے۔ پس اگرچہ یہ لفظ کے لحاظ سے مفرد ہے، لیکن معنی کے لحاظ سے کثیر ہے۔ اور اسی طرح کفارہ (الکفارة) کا عمل بھی ہے، جو نام کے لحاظ سے ایک ہے، لیکن اپنے اجزاء کے لحاظ سے کثیر ہے۔ اگر عمل ایسا ہو جو تقسیم نہ ہو سکے، جیسے توبہ جو کفارہ ہے، تو وہ خاص مصیبت جسے یہ توبہ دفع کرتی ہے، وہ ایک ہی مصیبت ہے جس میں کوئی تعداد یا کثرت نہیں ہے۔ کیونکہ امورِ الٰہیہ ان الٰہی میزانوں پر جاری ہوتے ہیں جو اللہ نے عالم میں رکھے ہیں، خاص طور پر سزاؤں میں، لہٰذا ان میں قطعاً کوئی کمی نہیں ہوتی۔\n\nاور جب ایک ہی چیز، اگرچہ وہ معصیت نہ ہو، مختلف کفارات (الکفارات) رکھتی ہو، جیسے حاجی جو کسی تکلیف کی وجہ سے سر منڈواتا ہے، یا متمتع، یا مظاہر (ظہار کرنے والا)، یا وہ شخص جس نے کسی قسم کھائی اور اس سے بہتر چیز دیکھی، تو ایسے شخص کے لیے مختلف کفارات (الکفارات) ہیں۔ یعنی جو بھی کفارہ دینے والا عمل اس نے کیا، دوسرا اس سے ساقط ہو گیا۔ پس یہ ایک عمل اس باقی ماندہ کی جگہ کھڑا ہو گیا جو اس سے ساقط ہوا تھا۔ اور اگر قسم غموس (جھوٹی قسم) ہو، تو اس میں کفارہ باقی خطاؤں کے کفارے کی طرح ہے۔ پس ملائکہ کا یہ خطاب تصور کیا جا سکتا ہے کہ: \"تخییری کفارات (الکفارات) میں سے کون سا کرنا زیادہ اولیٰ ہے؟\" یا \"یہ کفارہ کیوں ہے، حالانکہ اس نے کوئی ایسا عمل نہیں کیا جس پر سزا واجب ہو یا متوجہ ہو، تاکہ یہ کفارہ اسے دفع کرے؟ پس یہ کس چیز سے پردہ ڈالتا ہے؟\" ملأ اعلیٰ (الملأ الأعلى) ایسے معاملے میں بھی جھگڑتے ہیں۔\n\nپس صاحبِ میزان (توازن رکھنے والا) عالم اس چیز کو دیکھتا ہے جس پر قسم واقع ہوئی، اور وہ تخییری کفارے میں سے وہ چیز نکالتا ہے جو اس قسم کے مناسب ہو، جب تک کہ اس میں وہ چیز نہ ہو جو نہ پائے جانے کی صورت میں ہو۔ اور اسی طرح فدیہ میں بھی۔ اور یہ سب وہ چیزیں ہیں جن میں غور و فکر ہوتا ہے اور جو تنازع کا باعث بنتی ہیں۔ پس اس معاملے کا ظاہر یہ ہے کہ ملائکہ کے پاس فکری نظر ہے جو ان کی خلقت کے مناسب ہے۔ اور اسی سے حقائقِ الٰہیہ میں اللہ تعالیٰ کا یہ قول ہے:\n**يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ**\n(وہ امر کی تدبیر کرتا ہے، وہ آیات کو کھول کر بیان کرتا ہے) (یونس: 3)،\nپھر آیت کو اس پر ختم کیا:\n**لَعَلَّكُمْ بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ**\n(تاکہ تم اپنے رب کی ملاقات پر یقین رکھو) (یونس: 3)،\nیعنی تم حکم کے میزانوں پر ثابت قدم رہو۔\n\nاور جو اس حالت کی تائید کرتا ہے، وہ اخبارِ الٰہیہ میں اللہ تعالیٰ کا یہ قول ہے:\n**ما ترددت في شي‏ء أنا فاعله ترددي**\n(میں نے کسی ایسی چیز میں تردد نہیں کیا جسے میں کرنے والا ہوں، جتنا کہ میں نے تردد کیا...) (حدیث)۔\nپس اس نے اپنے آپ کو تردد سے متصف کیا جس سے مفکر قوت رکھنے والے محدث کو متصف کیا جاتا ہے۔ اور ملائکہ میں یہ ان کا جھگڑا ہے جس کا ہم نے ذکر کیا۔ پس اگر تم سمجھ بوجھ رکھتے ہو تو اس صحیح خبرِ الٰہی میں غور کرو جس کی طرف ہم نے رہنمائی کی۔\n\nاور جہاں تک ان کے جھگڑے کا تعلق قدم اٹھا کر جانے یا جماعتوں کی طرف دوڑنے میں ہے، تو اس کے لیے حقائقِ الٰہیہ میں سے یہ ہے:\n**من تقرب إلي شبرا تقربت منه ذراعا ومن تقرب إلي ذراعا تقربت منه باعا ومن أتاني يسعى أتيته هرولة**\n(جو میری طرف ایک بالشت قریب ہوتا ہے، میں اس کی طرف ایک ہاتھ قریب ہوتا ہوں، اور جو میری طرف ایک ہاتھ قریب ہوتا ہے، میں اس کی طرف ایک باع (دونوں بازوؤں کی لمبائی) قریب ہوتا ہوں، اور جو میری طرف دوڑتا ہوا آتا ہے، میں اس کی طرف تیزی سے چلتا ہوا آتا ہوں) (حدیث قدسی)۔\nاور اللہ تعالیٰ کا قول:\n**ومن ذكرني في ملأ ذكرته في ملأ خير منهم‏**\n(اور جس نے مجھے کسی جماعت میں یاد کیا، میں اسے ان سے بہتر جماعت میں یاد کرتا ہوں) (حدیث قدسی)۔\nاور اس کا قول:\n**ينزل ربنا إلى سماء الدنيا**\n(ہمارا رب آسمانِ دنیا کی طرف نازل ہوتا ہے) (حدیث)۔\nپس بنی آدم کے اس عملی وصف کی حقائقِ الٰہیہ سے مناسبت کو سمجھو۔ پس ان کا کلام ایسے ہی معاملات میں ہے کہ کون سی حقیقتِ الٰہیہ اس فعل کے زیادہ مناسب ہے؟ پس وہ اختلاف کر گئے۔\n\nاور اسی طرح ان کا قول کہ ناگواریوں میں وضو کو کامل کرنا (إسباغ الوضوء على المكاره)، اس کے لیے حقائقِ الٰہیہ میں سے یہ ہے: اللہ تعالیٰ کا اخبارِ الٰہیہ میں اپنے مومن بندے کی روح قبض کرنے کے بارے میں یہ قول:\n**يكره الموت وأنا أكره مساءته‏**\n(وہ موت کو ناپسند کرتا ہے اور میں اس کی ناگواری کو ناپسند کرتا ہوں) (حدیث)۔\nپس اس نے اپنے آپ کو ناپسندیدگی سے متصف کیا۔ اور اسی حقیقت سے مومن سردی کی شدت کی وجہ سے ناگواری کے باوجود وضو کو کامل کرتا ہے، پس اسے اس کراہت کا اجر اس حقیقتِ الٰہیہ سے ملتا ہے۔\n\nاور اسی طرح ان کا قول جس میں وہ جھگڑتے ہیں، یعنی التعقیب (نماز سے فارغ ہونے کے بعد مسجد میں بیٹھنا)، اس کے لیے حقائقِ الٰہیہ میں سے یہ ہے: اللہ تعالیٰ کا قول:\n**سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ**\n(عنقریب ہم تمہاری طرف متوجہ ہوں گے، اے دونوں بوجھ والو (جن و انس)) (الرحمن: 31)۔\nاور وہ ہمارے لیے متوجہ نہیں ہوتا مگر ہم میں سے اس کے لیے جو متوجہ ہوتا ہے۔ اللہ تعالیٰ فرماتا ہے:\n**يَسْأَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ**\n(آسمانوں اور زمین میں جو بھی ہے، وہ اس سے سوال کرتا ہے، وہ ہر دن ایک نئی شان میں ہوتا ہے) (الرحمن: 29)۔\nپس جب بندہ نماز سے فارغ ہو کر مسجد میں بیٹھتا ہے اور نماز کے بعد اپنے رب کا ذکر کرتا ہے، تو وہ ایک حالت میں اپنی مناجات سے دوسری حالت میں اپنی مناجات کی طرف منتقل ہوتا ہے، ایک ہی گھر میں۔ پس \"سنفرغ لکم\" (عنقریب ہم تمہاری طرف متوجہ ہوں گے) کے مقام سے اس عمل کے لیے میزان قائم ہوتا ہے۔ پس یہ اعمال ان حقائقِ الٰہیہ سے جڑ گئے جن میں ملأ اعلیٰ (الملإ الأعلى) کے درمیان مناظرہ واقع ہوا۔ اور ان میں مناسبتوں کی تفصیلات ہیں جن کا ذکر طویل ہو جائے گا۔ اور اللہ حق کہتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے۔",
    "fa": "«باب سیصد و ششم در شناخت منزلگاه نزاع ملأ اعلی (فرشتگان برتر) از حضرت موسوی»\n\nنزاع ملأ علوی (فرشتگان برتر) خود برهانی است\nهمراه با اعتراضی که از ایشان و نسیانی که از آنان آشکار شد\n\nبر تناسب ما در اصل خلقتمان\nدر طبیعت، که کمالی است که در آن نقصانی وجود دارد\n\nجایگاه طبیعت پایین‌تر از نفس است\nپس حکم آن در هباء (غبار هستی) این است که همه چیز جسمانی است\n\nو اگر از روح و فلک متولد شود\nعناصری هستند که در ابیات (اجسام) ارکان (پایه‌ها) می‌باشند\n\nپس هر جسمی روحی مدبر دارد\nکه از طبیعت آن است، پس هم خواب است و هم بیدار\n\nو هر جسمی را طبیعتش حکم می‌راند\nپس جسم و روح، تنور و آتشفشان هستند\n\nپس بنگر تا شگفتی ببینی، زیرا نه فرشتگان و نه انسان\nاز حکم طبیعت خارج نمی‌شوند\n\nو این را من نگفته‌ام، بلکه پیامبران و تورات و قرآن آن را برای تو آورده‌اند\n\n### [علم مقامات فرشتگان از عالم]\n\nو اما آنچه این منزلگاه از علوم در بر دارد، علم مقامات فرشتگان از عالم و مرتبه ایشان است، و اینکه آیا این علم در اینجا یا در سرای آخرت حاصل می‌شود؛ و علم مقامی که از آن در عالم ظاهر شد؛ علم اختلافی که در عالم رخ داده و علم جدلی؛ و احوال آن از اسماء الهی معارض، مانند الغفار (بسیار آمرزنده) و المنتقم (انتقام‌گیرنده) هنگامی که هر یک حکم خود را در مورد عاصی طلب می‌کنند؛ و علم زمین و اینکه به چه دلیلی پدید آمد؛ و علم کوه‌ها و اینکه آیا جزئی از زمین هستند یا نه، و آیا یکباره پدید آمدند یا آن‌گونه که حکما گفته‌اند؛ و علم نکاح (پیوند) که در عالم عقلی، معنوی، حسی و حیوانی جاری است؛ و علم خواب و اینکه آیا در بهشت وجود دارد یا نه، و آیا در عالم الهی حکمی دارد؛ و علم شب و روز و یوم و زمان؛ و علم آسمان‌ها؛ و علم خورشید؛ و علم مولدات (موجودات متولد شده)؛ و علم غیوب؛ و علم آخرت و جزئیات مربوط به آن؛ و علم اسباب اخروی؛ و علم کلام الرحمن (سخن خداوند رحمان) و اینکه آیا کلام به او نسبت داده می‌شود، همان‌گونه که به اسم الله نسبت داده می‌شود یا نه؛ و علم سکته عامه (توقف عمومی)؛ و علم تعریفاتی که رسولان آورده‌اند، نه احکام. اینها مادر مسائل علمی هستند که این منزلگاه در بر دارد. پس آنچه را خداوند بر زبان من آسان گرداند، ذکر می‌کنیم، و خداوند سبحان تأییدکننده و یاری‌دهنده است و بر او توکل می‌کنم و از او یاری می‌جویم. خداوند متعال از پیامبرش (ص) خبر می‌دهد که می‌فرماید: «مَا كَانَ لِيَ مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَى إِذْ يَخْتَصِمُونَ» (من از ملأ اعلی (فرشتگان برتر) هنگامی که نزاع می‌کردند، هیچ علمی نداشتم).\n\nو چون پیامبر (ص) فرمود که نزاع ملأ اعلی (فرشتگان برتر) درباره کفارات، و گام برداشتن به سوی نماز جماعت، و کامل کردن وضو (إسباغ الوضوء) در سختی‌ها، و تعقیب (نشستن) در مساجد پس از نمازهاست.\n\nپس معنای آن این است که کدام یک از این اعمال افضل (برتر) است. و معنای افضل بر دو وجه است: اول اینکه کدام یک از این اعمال نزد خداوند محبوب‌تر است؛ و وجه دیگر اینکه کدام یک از این اعمال برای عامل آن، درجه‌ای عظیم‌تر در بهشت دارد. و اما اسرار این اعمال، همان‌هایی است که این منزلگاه در پی آن است. پس در ابتدا بدان که اگر انواری که فرشتگان (الملائكة) از آن خلق شده‌اند، از طبیعت (الطبيعة) موجود نبودند، مانند آسمان‌هایی که این فرشتگان آن را آباد کرده‌اند، که در ابتدا دود (دخان) بود، و دود و بخار از عالم طبیعت است. نهایت بخار پایین‌تر از دایره زمهرير (سرمای شدید) است، زیرا بخار تنها به واسطه حرارتی که در آن است بالا می‌رود و به واسطه رطوبتی که در آن است پایین‌تر از دود قرار می‌گیرد. بخار ناشی از حرارتی است که در زمین است، زیرا این عناصر از طبایع چهارگانه ترکیب شده‌اند، جز اینکه در هر یک از آنها بر اعتدال نیست. پس آنچه سردی و رطوبت بر آن غلبه کند، آب نامیده می‌شود، و همچنین بقیه. بخار خارج شده از آب و زمین تنها به واسطه حرارتی است که در آنهاست. و دود تنها به دلیل غلبه حرارت و خشکی بر آن، بالاتر از کره اثیر قرار گرفت، زیرا کمیت حرارت و خشکی در آن بیشتر از رطوبت است. به همین دلیل آسمان‌ها اجسامی شفاف بودند. و خداوند آبادکنندگان هر فلک را از طبیعت آن فلک آفرید. بنابراین، فرشتگان از عالم طبیعت بودند و به نزاع کردن (يختصمون) توصیف شدند. و نزاع تنها در کسی رخ می‌دهد که از طبایع ترکیب شده باشد، به دلیل تضادی که در آنهاست. پس کسی که از آنها تشکیل می‌شود، ناگزیر باید بر حکم اصل باشد. نوری که فرشتگان از آن خلق شدند، نوری طبیعی است. پس فرشتگان از یک جهت موافقت و از جهتی مخالفت داشتند. این است سبب اختلاف ملأ اعلی (فرشتگان برتر) در آنچه نزاع می‌کنند.\n\nو اگر خداوند به ایشان می‌آموخت که کدام عمل نزد او افضل و محبوب‌تر است، نزاع نمی‌کردند. و اگر ایشان ارتباط درجات بهشت را با این اعمال کشف می‌کردند، به برتری عمل بالاتر حکم می‌دادند. اما خداوند سبحان آن را از ایشان پنهان داشته است. پس ایشان در این مسئله به منزله علمای بشر هستند که در مجلس مناظره‌ای درباره مسئله حیض می‌نشینند که نصیبی در آن ندارند، برخلاف مسائلی که در آن نصیب دارند. و ما این را گفتیم، زیرا کفارات (کفاره‌ها) تنها برای از بین بردن (إحباط) مخالفت‌هایی است که مکلف در اوامر و نواهی پروردگارش انجام داده است. و خداوند برای فرشتگان به عصمت شهادت داده است که: «لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ» (از آنچه خدا به آنان فرمان داده سرپیچی نمی‌کنند و آنچه را فرمان داده می‌شوند انجام می‌دهند). و به ما نرسیده است که نزد ایشان نهی‌ای وجود داشته باشد. و چون عصیان نمی‌کنند و مطیع هستند، پس در اعمال کفارات قدمی ندارند. پس ایشان در چیزی نزاع می‌کنند که در آن قدمی ندارند. و همچنین در بقیه اعمالی که در آنها قدمی ندارند. ایشان مطهر هستند، پس تطهیر نمی‌کنند، بنابراین در طهارت خود به کامل کردن (الإسباغ) و به نهایت رساندن آن و غیر کامل کردن متصف نمی‌شوند. و همچنین راه رفتن به سوی مساجد جماعت برای شهود نمازها، این عمل را ندارند. اگر بگویی: «آنان به سوی مجالس ذکر می‌شتابند و برخی به برخی دیگر می‌گویند: به سوی مطلوب خود بشتابید.»\n\n### [ذکر، عین نماز نیست]\n\nپس بدان که ذکر، عین نماز نیست. و ما تنها درباره عمل خاصی در جماعت سخن می‌گوییم که فرشتگان در آن دخالتی ندارند، مانند آنچه برای بنی آدم است. زیرا ایشان ذاتاً بر صورت بنی آدم نیستند، بلکه می‌توانند به شکل آنان درآیند. و جبرئیل (ع) نمازها را عملاً به رسول خدا (ص) آموخت، و آن از جانب جبرئیل حکایتی است که برای تعلیم و تعریف اوقات بازگو می‌کند. و اما تعقیب (نشستن) پس از نمازها، تنها برای نمازگزارانی است که بر این هیئت مخصوص هستند که برای فرشتگان نیست. پس ایشان در امری که صفتشان باشد نزاع نکردند. به همین دلیل مسئله حیض را مثال زدیم. و سبب آن این است که فرشتگان بنی آدم را در خواطرشان به عمل صالح دعوت می‌کنند و آنان را به عمل افضل ترغیب می‌نمایند. به همین دلیل در افضل نزاع کردند تا آن را به بنی آدم امر کنند. و پس از آنکه تو را بر سبب نزاع آگاه ساختیم، آنچه را در آن نزاع کردند، برایت بیان می‌کنیم.\n\n### [کفارات تنها تشریع شدند تا حجاب‌هایی باشند میان بنده و آنچه خود را در معرض آن قرار داده است از نزول بلاها به سبب مخالفت‌ها]\n\nپس بدان که کفارات (کفاره‌ها) تنها تشریع شدند تا حجاب‌هایی باشند میان بنده و آنچه خود را در معرض آن قرار داده است از نزول بلاها به سبب مخالفت‌هایی که انجام داده، خواه به آن عمل امر شده باشد یا از آن نهی شده باشد. پس هنگامی که المنتقم (انتقام‌گیرنده) با بلای نازل شده‌ای که این مخالفت آن را می‌طلبد، می‌آید، این اعمال را می‌یابد که آن را در سایه بال خود پوشانده و احاطه کرده و برای او سپر و محافظ شده است. و اسم الغفار (بسیار آمرزنده) حاکم بر این کفارات است. پس بلا راه نفوذی نمی‌یابد و وعید (تهدید) به دلیل غلبه سلطان این عمل که کفاره نامیده می‌شود، در آن نفوذ نمی‌کند. و کفر به معنای پوشاندن است، و به همین دلیل کشاورز (زارع) کافر نامیده می‌شود، زیرا بذر را در زمین می‌پوشاند و با خاک آن را می‌پوشاند. و پیامبر (ص) به این امر اشاره کرده است، آنجا که درباره زناکار فرمود: «ایمان از او خارج می‌شود تا مانند سایه‌بانی بر او قرار گیرد، پس هنگامی که دست کشید، ایمان به او باز می‌گردد.»\n\nو این بدان سبب است که زناکار یا مخالفت‌کننده در حال زنا، بلا و عقوبت را از جانب خداوند می‌طلبد، یا در حال زنا یا پس از آن. اگر در حال زنا باشد، به اندازه آنچه از آن گذشته است، بلا دارد. زیرا ممکن است عارضه‌ای پیش آید که او را از اتمام فعل باز دارد، مانند انزال آب یا خروج آلت از فرج. پس ایمان را بر زناکار مانند سایه‌بان می‌یابد، که حجابی قوی است و نمی‌تواند با آن نفوذ کند و به او برسد. پس اگر زناکار در حال زنا به دلیل شرافت ایمان در دنیا محفوظ و معصوم از بلا باشد، گمان تو درباره او در آخرت چیست؟ زیرا قدرت ایمان در آخرت کامل‌تر از حکم آن در دنیاست. تمام کفارات سپرهایی هستند که مرتبه‌شان همین است و از آن فراتر نمی‌رود. و آنچه بر آن افزوده شود، از درجه در بهشت یا منزلتی، آن چیزی است که در آن عمل از حد کفاره بودن خارج شده است. و کفاره درجات را بالا نمی‌برد، بلکه محافظ‌هایی در برابر این هلاکت‌ها (قواصم) است. و اما قول او (پیامبر) «کفارات» که جمع کفاره با صیغه مبالغه است، به این امر اشاره دارد که برای صورت عمل واحد، انواع بسیاری از بلا وجود دارد. و این بدان سبب است که عمل شامل حرکات مختلفی است و برای هر حرکتی بلای خاصی از جانب خداوند وجود دارد. پس این عمل مکفّر (کفاره‌دهنده) در برابر هر بلایی که مخالفت آن را می‌طلبد، پوششی است که او را از رسیدن بلا و تأثیر آن حفظ می‌کند. پس اگرچه لفظ آن مفرد است، اما در معنا متکثر است. و همچنین عمل کفاره، از حیث اسم واحد است، اما از حیث اجزای آن کثیر است. اگر عمل تجزیه‌پذیر نباشد، مانند توبه‌ای که کفاره است، بلای خاصی که این توبه دفع می‌کند، بلایی واحد است که در آن تعدد و کثرتی نیست. زیرا امور الهی بر موازین الهی جاری می‌شوند که خداوند در عالم قرار داده است، به ویژه در عقوبت‌ها، پس در آنها هیچ کم‌فروشی (تطفيف) نیست.\n\nو اگر یک چیز واحد، هرچند معصیت نباشد، کفارات مختلفی داشته باشد، مانند حاجی که به دلیل آزاری که می‌یابد سر خود را می‌تراشد، یا متمتع، یا مظاهر (کسی که ظهار کرده)، یا کسی که سوگندی خورده و بهتر از آن را دیده است، چنین کسی کفارات مختلفی دارد، یعنی هر عمل کفاره‌ای که انجام دهد، دیگری از او ساقط می‌شود. پس این عمل واحد، جایگزین آنچه از او ساقط شده است، می‌شود. اگر سوگند، سوگند غموس (دروغ عمدی) باشد، کفاره آن مانند کفاره سایر خطاهاست. پس خطاب فرشتگان این‌گونه تصور می‌شود که: کدام یک از کفارات تخییری (اختیاری) سزاوارتر است که انجام شود؟ یا چرا باید کفاره‌ای باشد، در حالی که عملی انجام نداده که عقوبتی بر آن واجب یا متوجه شود تا این کفاره آن را دفع کند؟ پس از چه چیزی او را می‌پوشاند؟ ملأ اعلی (فرشتگان برتر) در چنین مواردی نیز نزاع می‌کنند. پس عالم صاحب میزان (ترازو) به آنچه سوگند بر آن واقع شده است می‌نگرد و از کفاره تخییری، آنچه را که مناسب سوگند خورده شده است، خارج می‌کند، مگر آنکه در آن نباشد. و همچنین در فدیه. و این همه از مواردی است که در آن نظر (فکری) وجود دارد و به نزاع می‌انجامد. ظاهر این امر آن است که فرشتگان نظری فکری دارند که مناسب خلقت آنهاست. و به همین دلیل از حقایق الهی است قول خداوند متعال: «يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ لَعَلَّكُمْ بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ» (کار را تدبیر می‌کند، آیات را تفصیل می‌دهد، باشد که شما به لقای پروردگارتان یقین پیدا کنید). یعنی بر موازین حکم ثابت می‌شوید. و آنچه این حالت را تأیید می‌کند، قول خداوند متعال در اخبار الهی است: «ما ترددت في شي‏ء أنا فاعله ترددي» (در هیچ کاری که فاعل آن هستم، به اندازه ترددم [در قبض روح بنده مؤمن] تردید نکرده‌ام). پس خداوند خود را به ترددی وصف کرده است که مخلوق دارای قوه متفکره به آن وصف می‌شود، و این در فرشتگان همان نزاع ایشان در آنچه ذکر کردیم، است. اگر صاحب فهم هستی، در آنچه ما از خبر صحیح الهی به آن دلالت کردیم، بنگر. و اما قول او (پیامبر) در نزاع ایشان درباره گام برداشتن (نقل الاقدام) یا شتافتن به سوی جماعت‌ها، از حقایق الهی این است:\n\n«من تقرب إلي شبرا تقربت منه ذراعا ومن تقرب إلي ذراعا تقربت منه باعا ومن أتاني يسعى أتيته هرولة» (هر کس یک وجب به من نزدیک شود، من یک ذراع به او نزدیک می‌شوم، و هر کس یک ذراع به من نزدیک شود، من یک باع (دو ذراع) به او نزدیک می‌شوم، و هر کس شتابان به سوی من آید، من دوان به سوی او می‌آیم).\n\nو قول خداوند متعال: «ومن ذكرني في ملأ ذكرته في ملأ خير منهم» (و هر کس مرا در جمعی یاد کند، من او را در جمعی بهتر از آنان یاد می‌کنم).\n\nو قول او: «ينزل ربنا إلى سماء الدنيا» (پروردگار ما به آسمان دنیا فرود می‌آید).\n\nپس مناسبت این صفت عملی بنی آدم را با حقایق الهی بفهم. پس سخن ایشان در مثل این است که کدام یک از حقایق الهی مناسبت بیشتری با این فعل دارد؟ پس اختلاف کردند. و همچنین قول او (پیامبر) درباره کامل کردن وضو (إسباغ الوضوء) در سختی‌ها، از حقایق الهی این است:\n\nقول خداوند متعال در اخبار الهی درباره قبض روح بنده مؤمنش: «يكره الموت وأنا أكره مساءته» (او مرگ را ناخوش می‌دارد و من ناخوش داشتن او را ناخوش می‌دارم).\n\nپس خداوند خود را به ناخوش داشتن (کراهت) وصف کرده است. و همچنین از این حقیقت است که مؤمن وضو را با کراهت (ناخوش داشتن) کامل می‌کند، به دلیل شدت سرما. پس او اجر کراهت را از این حقیقت الهی دارد. و همچنین قول او (پیامبر) در آنچه نزاع می‌کنند، یعنی تعقیب (التعقيب)، که نشستن در مسجد پس از فراغت از نماز است، از حقایق الهی این است:\n\nقول خداوند متعال: «سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ» (به زودی برای شما فارغ خواهیم شد، ای جن و انس).\n\nو خداوند تنها از ما برای ما فارغ می‌شود. خداوند متعال می‌فرماید: «يَسْأَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» (هر که در آسمان‌ها و زمین است، از او درخواست می‌کند؛ او هر روز در کاری است).\n\nپس بنده هنگامی که از نماز فارغ می‌شود و در مسجد می‌نشیند و پروردگار متعال خود را پس از نماز یاد می‌کند، از مناجات خود در یک حالت به مناجات در حالتی دیگر در یک خانه منتقل شده است. پس از مقام «سَنَفْرُغُ لَكُمْ» (به زودی برای شما فارغ خواهیم شد) برای این عمل، میزان (ترازو) خواهد داشت. پس این اعمال با حقایق الهی که مناظره ملأ اعلی (فرشتگان برتر) در آنها رخ داده است، مرتبط شده‌اند. و در این باره جزئیاتی از مناسبات وجود دارد که ذکر آنها به درازا می‌کشد. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 3
}