{
  "id": 542,
  "title": {
    "ar": "الباب الثاني والأربعون وخمسمائة في معرفة حال قطب كان منزله ومن كانَ في هذِهِ أَعْمى‏ فَهُوَ في الْآخِرَةِ أَعْمى‏ وأَضَلُّ سَبِيلًا",
    "en": "Chapter 542: Concerning the understanding of the state of a Pole (قطب) whose station was [defined by the verse]: <<وَمَن كَانَ فِي هَٰذِهِ أَعْمَىٰ فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا>> (And whoever is blind in this [life], he will be blind in the Hereafter and more astray in way).",
    "ur": "باب پانچ سو بیالیس (۵۴۲): ایک قطب (قطب) کے حال کی معرفت (معرفۃ) کے بیان میں جس کا مقام (منزل) یہ ہے:\n\"اور جو شخص اس دنیا میں اندھا رہا، وہ آخرت میں بھی اندھا رہے گا اور راستے سے زیادہ بھٹکا ہوا ہوگا۔\"\n(وَمَن كَانَ فِي هَٰذِهِ أَعْمَىٰ فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا)",
    "fa": "باب پانصد و چهل و دوم در معرفت حال قطبی که منزل او این بود: «و هر که در این [دنیا] کور باشد، در آخرت نیز کور و گمراه‌تر است» (وَمَن كَانَ فِي هَذِهِ أَعْمَىٰ فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا)"
  },
  "content": {
    "ar": "## «الباب الثاني والأربعون وخمسمائة في معرفة حال قطب كان منزله ومن كانَ في هذِهِ أَعْمى‏ فَهُوَ في الْآخِرَةِ أَعْمى‏ وأَضَلُّ سَبِيلًا»\n\n\n> إنما تعمي القلوب في الصدور *** التي تحوي عليهن الصدور\n\n\n> ثم هذا الحكم فيمن صدرت *** عن ورود كان منها الأمور\n\n\n> ليس يعمى صادر عنه به *** كيف يعمى من له عين الظهور\n\n\nقال الله تعالى ولكِنْ تَعْمَى الْقُلُوبُ الَّتِي في الصُّدُورِ على الوجهين الواحد من الوجهين للحصر والثاني للرجوع‏\n\n\n### [أن العماء حيرة وأعظمه الحيرة في العلم بالله‏]\n\n\nفاعلم أن العماء حيرة وأعظمه الحيرة في العلم بالله والعلم بالله على طريقين الطريق الواحدة النظر الفكري فلا يزال صاحب هذا الطريق إذا وفي النظر حقه في حيرة إلى الموت فإنه ما من دليل إلا وعليه عنده دخل وشبهة لاتساع عالم الخيال إذا لقوة المفكرة ما لها تصرف إلا في هذه الحضرة الخيالية إما بما فيها مما اكتسبته من القوي الحسية\nوإما مما تصوره القوة المصورة فإذا كان صاحب هذا النظر في الدنيا أعمى أي حائرا ويموت والإنسان إنما يموت على ما عاش عليه وهذا ما عاش إلا حائرا فيجي‏ء في الآخرة بتلك الحيرة فإذا وقع له الكشف هناك زاد حيرة لاختلاف الصور عليه فهو أضل من كونه في الدنيا فإنه كان يترجى في الدنيا لو كشف له أن تزول عنه الحيرة وأما الطريق الثانية في العلم بالله فهو العلم عن التجلي والحق لا يتجلى في صورة مرتين فيحار صاحب هذا العلم في الله لاختلاف صور التجلي عليه كحيرة الأول في الآخرة فما كان لذلك في الآخرة هو لهذا الآخر في الدنيا وأما البصيرة التي يكون عليها الداعي والبينة فإنما ذلك فيما يدعو إليه وليس إلا الطريق إلى السعادة لا إلى العلم فإنه إذا دعا إلى العلم أيضا إنما يدعو إلى الحيرة على بصيرة أنه ما ثم إلا الحيرة في الله لأن الأمر عظيم والمدعو إليه لا يقبل الحصر ولا ينضبط فليس في اليد منه شي‏ء فما هو إلا ما تراه في كل تجل فالكامل من يرى اختلاف الصور في العين الواحدة فهو كالحرباء فمن لم يعرف الله معرفته بالحرباء فإنه لا يستقر له قدم في إثبات العين فأصحاب التجلي عجلت لهم معرفة الآخرة فهم في الدنيا أعمى وأضل سبيلا من أصحاب النظر لأنه ليس وراء التجلي مطلب آخر للعلم بالله ولا يتضور وهذه الإشارة كافية لمن عقل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ فإن الكلام في هذا الذاكر واسع‏\n\n",
    "en": "Chapter 542: Concerning the Knowledge of the State of a Pole (قطب) whose Station was: <<And whoever is blind in this [life], he will be blind in the Hereafter, and most astray from the path>> (Quran 17:72).\n\nHearts are only blinded within the breasts\nWhich the breasts encompass and contain.\n\nFurthermore, this judgment applies to those whose actions proceed\nFrom an influx (ورود) whence all matters originate.\n\nOne who proceeds from Him is not blinded by Him;\nHow can he be blind who possesses the eye of Theophany (الظهور)?\n\nAllah the Exalted said: <<But the hearts which are in the breasts are blinded>> (Quran 22:46). This verse is understood in two ways: the first way is for restriction (الحصر), and the second is for return (الرجوع).\n\n### [That Blindness (العماء) is Bewilderment (حيرة), and the Greatest of it is Bewilderment in the Knowledge of Allah]\n\nKnow that blindness (العماء) is bewilderment (حيرة), and the greatest of it is bewilderment in the Knowledge (العلم) of Allah. The Knowledge of Allah is attained through two paths.\n\nThe first path is speculative thought (النظر الفكري). The follower of this path, if he gives thought its due, remains in bewilderment until death. This is because there is no proof (دليل) that does not contain, in his view, some flaw or ambiguity (شبهة), due to the vastness of the world of Imagination (عالم الخيال). The faculty of thought (القوة المفكرة) has no scope for action except within this Imaginal Presence (الحضرة الخيالية), whether through what it contains of things acquired from the sensory faculties (القوي الحسية) or through what the formative faculty (القوة المصورة) pictures.\n\nThus, if the follower of this speculative path is blind (أعمى)—meaning bewildered (حائرا)—in this world, he dies, and a human being only dies upon the state in which he lived. Since this person lived only in bewilderment, he will come to the Hereafter with that same bewilderment. If Unveiling (الكشف) occurs for him there, his bewilderment increases due to the multiplicity of forms presented to him. Therefore, he is more astray (أضل) than he was in the world, for in the world he hoped that if unveiling occurred, his bewilderment would cease.\n\nAs for the second path to the Knowledge of Allah, it is the Knowledge derived from Theophany (التجلي). The Real (الحق) does not disclose Himself in the same form twice. Thus, the follower of this knowledge is bewildered concerning Allah due to the variation in the forms of Theophany presented to him, similar to the bewilderment of the first type of person in the Hereafter. What was destined for the former in the Hereafter is destined for this latter person in the world.\n\nAs for the insight (البصيرة) and clear proof (البينة) upon which the caller (الداعي) stands, this pertains only to that which he calls toward, and that is merely the path to felicity (السعادة), not to Knowledge (العلم). For even if he calls toward Knowledge, he is only calling toward bewilderment, based on the insight that there is nothing but bewilderment concerning Allah. This is because the Matter (الأمر) is tremendous, and that which is called toward cannot be restricted (الحصر) or contained (ينضبط). Therefore, nothing of it is held in hand; it is only what you witness in every Theophany (تجلي).\n\nThe Perfect One (الكامل) is he who sees the variation of forms within the single Essence (العين الواحدة); he is like the chameleon (الحرباء). Whoever does not know Allah with the knowledge of the chameleon will not have a firm footing in the affirmation of the Essence. The people of Theophany (أصحاب التجلي) have had the knowledge of the Hereafter hastened for them, and thus they are, in this world, more blind (أعمى) and more astray from the path (أضل سبيلا) than the people of speculation (أصحاب النظر), because there is no further object of pursuit for the Knowledge of Allah beyond Theophany, nor does it change. This indication is sufficient for one who understands. <<And Allah speaks the Truth, and He guides to the path>> (Quran 33:4). For the discourse concerning this subject is vast.",
    "ur": "باب نمبر 542: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور جو شخص اس دنیا میں اندھا رہا، وہ آخرت میں بھی اندھا رہے گا اور راستے سے بھٹکا ہوا ہو گا\" (وَمَن كَانَ فِي هَذِهِ أَعْمَىٰ فَهُوَ فِي الْآخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا)\n\n> دل تو صرف ان سینوں میں اندھے ہوتے ہیں\n> جنہیں سینے اپنے اندر رکھتے ہیں\n>\n> پھر یہ حکم اس شخص کے لیے ہے جو (حق سے) صادر ہوا\n> ان واردات سے جن سے معاملات (وجود میں) آئے\n>\n> جو اس (حق) سے صادر ہوا، وہ اس کے ذریعے اندھا نہیں ہوتا\n> وہ کیسے اندھا ہو سکتا ہے جس کے پاس ظہور (الظہور) کی آنکھ ہو۔\n\nاللہ تعالیٰ نے فرمایا: \"بلکہ وہ دل اندھے ہو جاتے ہیں جو سینوں میں ہیں\" (وَلَكِن تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ)۔ یہ (آیت) دو پہلوؤں پر ہے، ان میں سے ایک پہلو حصر (محدودیت) کے لیے ہے اور دوسرا رجوع (واپسی) کے لیے۔\n\n### [یہ کہ اندھا پن (العماء) حیرت ہے، اور اس میں سب سے بڑی حیرت اللہ کے علم (العلم باللہ) میں ہے]\n\nپس جان لو کہ اندھا پن (العماء) حیرت ہے، اور اس میں سب سے بڑی حیرت اللہ کے علم (العلم باللہ) میں ہے۔ اور اللہ کا علم دو طریقوں پر ہے۔ پہلا طریقہ فکری نظر (النظر الفکری) کا ہے۔ اس طریقے کا سالک جب تک نظر (فکر) کا حق ادا کرتا ہے، وہ موت تک حیرت میں رہتا ہے، کیونکہ کوئی دلیل ایسی نہیں جس پر اس کے نزدیک کوئی اعتراض (دخل) یا شبہ نہ ہو، یہ اس لیے کہ عالمِ خیال (عالم الخیال) بہت وسیع ہے، جب کہ قوتِ مفکرہ (القوۃ المفکرۃ) کا تصرف صرف اسی خیالی حضور (الحضرۃ الخیالیۃ) میں ہوتا ہے، یا تو ان چیزوں کے ذریعے جو اس نے حسی قوتوں (القوی الحسیۃ) سے حاصل کی ہیں، یا ان چیزوں کے ذریعے جنہیں قوتِ مصورہ (القوۃ المصورۃ) نے تصور کیا ہے۔\n\nپس جب اس نظر کا حامل دنیا میں اندھا یعنی حیران رہا اور مر گیا، اور انسان اسی حالت پر مرتا ہے جس پر وہ جیتا ہے، اور یہ شخص حیرت کے سوا کسی اور حالت پر نہیں جیا، لہٰذا وہ آخرت میں بھی اسی حیرت کے ساتھ آئے گا۔ جب وہاں اسے کشف (الکشف) حاصل ہو گا تو اس پر صور کے اختلاف کی وجہ سے اس کی حیرت مزید بڑھ جائے گی۔ پس وہ دنیا میں ہونے کی نسبت زیادہ بھٹکا ہوا (أضل) ہو گا، کیونکہ وہ دنیا میں یہ امید رکھتا تھا کہ اگر اس کے لیے کشف ہو جائے تو اس کی حیرت دور ہو جائے گی۔\n\nاور جہاں تک اللہ کے علم کا دوسرا طریقہ ہے، تو وہ ظہور الٰہی (التجلی) کے ذریعے حاصل ہونے والا علم ہے۔ اور ذات حق (الحق) دو بار ایک ہی صورت میں ظہور (التجلی) نہیں فرماتی۔ لہٰذا اس علم کا حامل اللہ کے بارے میں حیران رہتا ہے کیونکہ ظہور (التجلی) کی صورتیں اس پر مختلف ہوتی رہتی ہیں، یہ حیرت ویسی ہی ہے جیسی پہلے شخص کو آخرت میں ہو گی۔ پس جو حال پہلے شخص کا آخرت میں ہو گا، وہی حال اس دوسرے شخص کا دنیا میں ہو گا۔\n\nاور جہاں تک اس بصیرت کا تعلق ہے جس پر داعی اور دلیل قائم ہوتی ہے، تو وہ صرف اس چیز کے بارے میں ہوتی ہے جس کی طرف وہ دعوت دیتا ہے، اور وہ صرف سعادت (خوش بختی) کا راستہ ہے، نہ کہ علم کا۔ کیونکہ اگر وہ علم کی طرف بھی دعوت دیتا ہے، تو وہ بصیرت کے ساتھ صرف حیرت کی طرف دعوت دیتا ہے کہ اللہ کے معاملے میں حیرت کے سوا کچھ نہیں۔ کیونکہ معاملہ بہت عظیم ہے اور جس کی طرف دعوت دی جا رہی ہے وہ نہ تو حصر (محدودیت) قبول کرتا ہے اور نہ ہی منضبط (قابو میں آنے والا) ہے۔ پس اس میں سے ہاتھ میں کچھ نہیں آتا، یہ صرف وہی ہے جو تم ہر ظہور (التجلی) میں دیکھتے ہو۔\n\nپس کامل (الکامل) وہ ہے جو ایک ہی آنکھ میں صورتوں کا اختلاف دیکھتا ہے، لہٰذا وہ گرگٹ (حرباء) کی مانند ہے۔ پس جس نے اللہ کی معرفت (المعرفۃ) گرگٹ کی طرح نہیں کی، اس کا قدم عین (ذات) کے اثبات میں مستحکم نہیں ہو سکتا۔ پس ظہور (التجلی) کے حاملین کے لیے آخرت کی معرفت (المعرفۃ) جلدی کر دی گئی ہے، لہٰذا وہ دنیا میں فکری نظر (النظر) کے حاملین سے زیادہ اندھے اور راستے سے بھٹکے ہوئے (أضل سبیلا) ہیں۔ کیونکہ ظہور (التجلی) کے بعد اللہ کے علم (العلم باللہ) کے لیے کوئی دوسرا مطالبہ نہیں ہے اور نہ ہی وہ بے چین ہوتا ہے۔ اور یہ اشارہ عقل مند کے لیے کافی ہے، اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔ کیونکہ اس ذکر میں کلام بہت وسیع ہے۔",
    "fa": "باب پانصد و چهل و دوم در معرفت حال قطبی که منزل او این آیه بود: «و هر کس در این [دنیا] کور باشد، در آخرت نیز کور و گمراه‌ترین راه است.» (وَمَنْ كَانَ فِي هَذِهِ أَعْمَى فَهُوَ فِي الْآخِرَةِ أَعْمَى وَأَضَلُّ سَبِيلًا)\n\nدل‌ها تنها در سینه‌هایی کور می‌شوند\nکه سینه‌ها آن‌ها را در بر گرفته‌اند\n\nسپس این حکم در مورد کسی است که [دلش] صادر شده\nاز ورودی که امور از آنجا بوده‌اند\n\nکسی که از او صادر شده، به واسطه او کور نمی‌شود\nچگونه کور شود کسی که چشم ظهور (عين الظهور) را دارد؟\n\nخداوند متعال می‌فرماید: «بلکه دل‌هایی که در سینه‌ها هستند کور می‌شوند.» (وَلَكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ) این آیه بر دو وجه است: یکی از آن دو وجه برای حصر (انحصار) و دیگری برای رجوع (بازگشت).\n\n### [اینکه کوری (العماء) حیرت است و بزرگترین آن، حیرت در علم به خداوند است]\n\nپس بدان که کوری (العماء) حیرت است و بزرگترین آن، حیرت در علم به حق (الحق) است. علم به حق بر دو طریق است. طریق اول، نظر فکری است. صاحب این طریق، اگر حق نظر را ادا کند، پیوسته تا زمان مرگ در حیرت است؛ زیرا هیچ دلیلی نیست مگر اینکه نزد او بر آن ایراد (دخل) و شبهه‌ای وارد است. این به دلیل وسعت عالم خیال است، چرا که قوه متفکره (قوة المفكرة) جز در این حضرت خیالی (حضرة الخيالية) تصرفی ندارد، خواه از طریق آنچه از قوای حسی کسب کرده باشد، و خواه از طریق آنچه قوه مصوره (قوة المصورة) تصویر می‌کند.\n\nپس اگر صاحب این نظر در دنیا کور باشد، یعنی حیران باشد، و بمیرد (و انسان تنها بر آنچه زیسته می‌میرد، و این شخص جز حیران نزیسته است)، در آخرت نیز با همان حیرت می‌آید. اگر در آنجا کشف (الکشف) برای او حاصل شود، حیرتش بیشتر می‌شود، به دلیل اختلاف صور [تجلی] بر او. پس او گمراه‌تر از آن است که در دنیا بود، زیرا در دنیا امید داشت که اگر کشفی برایش حاصل شود، حیرت از او زائل گردد.\n\nاما طریق دوم در علم به حق (الحق)، علم از طریق تجلی (التجلی) است. حق (الحق) دو بار در یک صورت تجلی نمی‌کند. از این رو، صاحب این علم در مورد خداوند دچار حیرت می‌شود، به دلیل اختلاف صور تجلی (التجلی) بر او، همانند حیرت شخص اول در آخرت. پس آنچه برای آن شخص در آخرت بود، برای این شخص دوم در دنیا است.\n\nاما بصیرتی (البصيرة) که داعی و بینه بر آن است، تنها در مورد چیزی است که به آن دعوت می‌کند، و آن چیزی جز راه سعادت نیست، نه راه علم. زیرا اگر به علم نیز دعوت کند، در واقع بر اساس بصیرت به حیرت دعوت می‌کند؛ بصیرتی که می‌داند در مورد خداوند چیزی جز حیرت نیست، زیرا امر عظیم است و مدعوٌّ الیه (آنچه به آن دعوت می‌شود) نه حصر را می‌پذیرد و نه منضبط می‌شود. پس چیزی از آن در دست نیست. آنچه هست، همان چیزی است که در هر تجلی (التجلی) می‌بینی.\n\nپس انسان کامل (الإنسان الکامل) کسی است که اختلاف صور را در یک عین (ذات) واحد می‌بیند، پس او مانند حرباء (آفتاب‌پرست) است. هر کس خداوند را با معرفت آفتاب‌پرست نشناسد، قدمی در اثبات عین (ذات) برایش استوار نمی‌شود. پس معرفت آخرت برای اصحاب تجلی (التجلی) تعجیل شده است، از این رو آنان در دنیا کورتر و گمراه‌ترین راه (أعمى وأضل سبيلا) از اصحاب نظر هستند، زیرا ورای تجلی (التجلی) مطلب دیگری برای علم به حق (الحق) وجود ندارد و [این شخص] بی‌تابی نمی‌کند. این اشاره برای کسی که تعقل کند کافی است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)، زیرا سخن در این باب بسیار گسترده است."
  },
  "page_count": 2
}