{
  "id": 388,
  "title": {
    "ar": "الباب الثامن والثمانون وثلاثمائة في معرفة منازلة مجهولة",
    "en": "Chapter Three Hundred and Eighty-Eight, Concerning the Knowledge of Unknown Stations.",
    "ur": "باب تین سو اٹھاسی (۳۸۸): نامعلوم منازل کی معرفت کے بیان میں",
    "fa": "باب سیصد و هشتاد و هشتم در معرفت منازل ناشناخته (مجهولة)"
  },
  "content": {
    "ar": "## «الباب الثامن والثمانون وثلاثمائة في معرفة منازلة مجهولة\n\n\nوذلك إذا ارتقى من غير تعيين قصد ما يقصده من الحق وكل شي‏ء عند الحق معين فقد قصده من الحق ما لا يناسب قصده من عدم التعيين»\n\n\n> نكون على النقيض إذا اجتمعنا *** وإن بنا تكون على السواء\n\n\n> وفي التحقيق ما في الكون عين *** بلا شك سواه ولا مراء\n\n\n> فقل للمنكرين صحيح قولي *** عميتم عن مطالعة العماء\n\n\n> وعن نفس تكون فيه خلق *** كثير شكله شكل المرائي‏\n\n\n> فيقلب صورة الرائي إليه *** بحكم ثابت في كل رائي‏\n\n\n### [الزيادة عبارة عن ما لم يخطر بالبال‏]\n\n\nقال الله تعالى لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ فعين لمعين وزاد غير غير معين سألت بعض شيوخنا عن الزيادة فقال ما لم يخطر بالبال وقال صَلَّى اللهُ عَليهِ وسَلَّم إن في الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\nفلا بد أن يكون غير معلوم للبشر ولا بد أن يكون في البشر صفة غير معلومة ولا معينة منها يحصل له هذا الذي ذكر أنه ما خطر على قلب بشر موازنة مجهول لمجهول وقال تعالى فَلا تَعْلَمُ نَفْسٌ فنكر ونفى العلم ما أُخْفِيَ لَهُمْ من قُرَّةِ أَعْيُنٍ فعلمنا على الإجمال أنه‏\nأمر مشاهد لكونه قرنه بالأعين لم يقرنه بالأذن ولا بشي‏ء من الإدراكات ولذلك علمنا أن‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم جعلت قرة عيني في الصلاة\n\n\nإنه ما أراد المناجاة وإنما أراد شهود من ناجاه فيها ولهذا\n\n\nأخبرنا أن الله في قبلة المصلي فقال اعبد الله كأنك تراه‏\n\n\nفإنه صَلَّى اللهُ عَليهِ وسَلَّم كان يراه في عبادته ما كان كأنه يراه ومن أهل الله من تكون له هذه الرتبة ولو لا حصولها ما قرنها بالعبادة دون العمل فما قال اعمل لله كأنك تراه فإن العبادة من غير شهود صريح أو تخيل شهود صحيح لا تصح وفي هذا الباب قوله تعالى وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله وفيه علم مفاتح الغيب لا يَعْلَمُها إِلَّا هُوَ وكل ما هو علمه موقوف على الله لا يعلم إلا بإعلام الله أو بإشهاده ومن هذا الباب قوله تعالى فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله ومن هذا الباب فَعِدَّةٌ من أَيَّامٍ أُخَرَ من غير تعيين أيام معينة أما صورة هذه المنازلة من العبد فهي كما قال أبو يزيد في الجلوس مع الله بلا حال ولا نعت وهو أن يكون العبد في قصده على ما يعلمه الله لا يعين على الله شيئا فإنه من عين في قصده على الله شيئا فلا فرق بينه في الصورة وبين من عبد الله على حرف فصاحب هذه المنازلة يعبد ربه بتعيين الأوقات لا بتعيينه فهو في حكم وقته والوقت من الله لا منه فلا يدري بما ذا يفجأه وقته فغايته أن يكون مهيا لوارد مجهول إلهي يقيمه في أي عبادة شاء فتنتج له تلك العبادة من الحق في منازلته ما لا يناسب ذلك العمل في علمه إلا أنه مناسب لعبادته في ذلك العمل فهو زيادة بالنظر إلى العمل نتيجة بالنظر إلى العبادة فيه وهذا مقام ما وجدنا له ذائقا في علمنا من أهل الله لأن أكثرهم لا يفرقون بين العبادة والعمل وكل عمل لا يظهر له الشارع تعليلا من جهته فهو تعبد فتكون العبادة في كل عمل غير معلل أظهر منها في العمل المعلل فإن العمل إذا علل ربما أقامت العبد إليه حكمة تلك العلة وإذا لم يعلل لا يقيمه إلى ذلك العمل إلا العبادة المحضة\n\n\n### [العبادة حال ذاتي للإنسان‏]\n\n\nواعلم أن العبادة حال ذاتي للإنسان لا يصح أن يكون لها أجر مخلوق لأنها ليست بمخلوقة أصلا فالأعيان من كل ما سوى الله مخلوقة موجودة حادثة والعبادة فيها ليست بمخلوقة فإنها لهذه الأعيان أعني أعيان العالم في حال عدمه وفي حال وجوده وبها صح له أن يقبل أمر الله بالتكوين من غير تثبط بل أخبر الله تعالى أنه يَقُولُ لَهُ كُنْ فَيَكُونُ فحكم العبادة للممكن في حال عدمه أمكن فيه منها في حال وجوده إذ لا بد له في حال وجوده واستحكام رأيه ونظره لنفسه واستقلاله من دعوى في سيادة بوجه ما ولو كان ما كان فينقص له من حكم عبادته بقدر ما ادعاه من السيادة فلذلك قلنا إن حكم العبادة للممكن أمكن منه في حال عدمه منها في حال وجوده فمن استصحبته فقد استصحبه الشهود دنيا وآخرة ونعته إذا كانت هذه حالته أنه لا يفرح بشي‏ء ولا يحزن لشي‏ء ولا يضحك ولا يبكي ولا يقيده وصف ولا يميزه نعت وجودي فلا رسم له ولا وصف قال أبو يزيد البسطامي رضي الله عنه في هذا المقام ضحكت زمانا وبكيت زمانا وأنا اليوم لا أضحك ولا أبكي وقال في هذا المقام لما قيل له كيف أصبحت فقال لا صباح لي ولا مساء إنما الصباح والمساء لمن تقيد بالصفة وأنا لا صفة لي فوصف نفسه بالإطلاق ولا يصح الإطلاق إلا في العبادة خاصة لأن العبد مقيد بإرادة السيد الذي يملكه فيه ومن كان له الإطلاق فلا يتقيد أجره ولا يتعين لأن العبد لا أجر له ما هو مثل الأجير وقد كان لشيخنا أبي العباس العريني من العليا من غرب الأندلس وهو أول شيخ خدمته وانتفعت به له قدم راسخة في هذا الباب باب العبودية وإنما صاحبها العبد في شأنه كما إن الحق في شأنه فجزاء الإطلاق الإطلاق‏\n\n\nسأل جبريل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عن الإحسان فقال إن تعبد الله كأنك تراه‏\n\n\nوما ذكر العمل وإنما ذكر العبادة وقال الله تعالى هَلْ جَزاءُ الْإِحْسانِ إِلَّا الْإِحْسانُ فهو قولنا ما جزاء الإطلاق إلا الإطلاق والأجور مقيدة من عشر إلى سبعمائة ضعف لأنها أجور أعمال معينة متناهية الزمان فلا بد أن يتقيد أجرها بالعدد ولو كان جزافا فإنه مقيد بالعدد عند الله كالصابر يوفى أجره بغير حساب معين علمه عندنا وعند الله مقيد بقدر معلوم لأن الصبر يعم جميع الأعمال لأنه حبس النفس على الأعمال المشروعة فلهذا لم يأخذه المقدار والأعمال تأخذها لمقادير فعلى قدر ما يقام فيه المكلف من الأعمال إلى حين موته فهو يحبس نفسه عليها حتى يصح له حال الصبر واسم الصابر فيكون أجره غير معلوم ولا مقدر عنده جملة واحدة وإن كان معلوما عند الله كالمجازفة في البيع من غير كيل في المكيل ولا وزن في الموزون وفارق الصبر العبادة بأن العبادة له في حال عدمه وعدم تكليفه والصبر لا يكون له في حال عدمه ولا في حال عدم تكليفه فالعبادة لا تبرح معه دنيا\nولا آخرة فإذا كان مشهده عبادته في حال ارتقاؤه ونزل الحق إليه كما وصف الحق نفسه بالنزول فوقع الاجتماع وهو المنازلة فمن حيث إن العبد ذو عمل من الأعمال لأنه لا بد أن يكون في عمل مشروع صالح وهو الذي يصعد به فإنه براقه لأنه محمول فيتلقاه من الله من حيث ذلك العمل بالبر الذي عينه الله لمن جاء به وهو مقدر معلوم ثم أن الحق ينظر في هذا المكلف فيراه مع كونه في عمله غير مشهود له ذلك العمل لعلمه أن الله هو العامل به لا هو وأنه محل لخلق العمل به وكالآلة لوجود ذلك العمل فيكون الحق يعطي استحقاق ذلك العمل من حيث ما وعد به فيه وينظر ما مشهد ذلك الشخص فيجده في عبادته التي لم يزل عليها في حال عدمه فما ثم جزاء في مقابلتها إلا أن لا يرزقها الغفلة عنها في زمان خلق الغفلات في المكلفين ما ثم إلا هذا وهو الذي قلنا في الممكن في حال وجوده أنه لا بد من حكم سيادة تظهر منه لأنه في زمان حكم الغفلات فالعناية بهذا العبد في هذه المنازلة رفع الغفلة عن العبادة في كل حال فهذه هي الزيادة في قوله لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ للذين أحسنوا بالأعمال الحسنى بما لهم من الأجور بل بما للأعمال من الأجور فإنها بعينها للعامل وزيادة هي ما ذكرناه في حق صاحب العبادة فإنه لا يرزقه الغفلة في وقت العمل عمن هو العامل فيرى أن العامل هو الله وليس يعود الأجر الذي يطلبه العمل إلا على العامل فالعامل عنده هو الله فأجرته لو كان ممن يقبل الأجور على قدره فيحصل للمكلف الذي هو الآلة القابلة للاجور أجر من لو قبل الله الأجير كيف يكون أجره هل يكون إلا على قدره وإن قيده العمل فأين أجر هذا المكلف بهذا الشهود من أجر من يرى في عمله إن المكلف هو العامل لا الحق فيكون أجره على قدر هذا المكلف فلا يحصل له سوى أجر العمل خاصة إلا على قدر أجر العامل لأن العامل عنده عينه ولا قدر له ولو لا ظهوره واتصافه بطاعة ربه في عمله لم يكن له قدر من نفسه ولهذا ترى مال المخالف إلى ما يكون فلو كان له قدر في نفس الأمر لسعد بحكم قدره وإنما يسعد برحمة الله ولم تتفاضل سعادتهم لو كان لهم قدر يستحقون به السعادة ولا نشك أنهم في السعادة متفاضلون كما أنهم في الأعمال متفاضلون من حال وزمان ومكان وعين عمل ودوام واجتماع وانفراد إلى غير ذلك فيما يقع به التفاضل فعلمنا أنه ما ثم جزاء القدر فعلمنا إن الإنسان من حيث عينه لا قدر له لا بطاعة ربه وقدر عمله ثم إن الحق بعد هذا النظر وتعيين الجزاء كما قررناه ينظر في شهود هذا المكلف فيراه ذا عبادة والعمل تابع لها فيه وهو لا يتصف بالإعراض عن الأعمال ولا بالإقبال عليه وأنه على الحال الذي كان عليه في حال عدمه لم يتغير فيبقيه على حاله ويحجب الغفلة عنه فلا يكون له أثر فيه بوجه من الوجوه وهذه هي العصمة العامة فإذا وقعت منه مخالفة فإنما تقع بحكم القضاء والقدر من تكوينهما فيه كما وقعت الطاعة فما ينقص له من حاله في عبادته لأن الغفلة محجوبة عنه والحضور له دائم فإذا وقع منه ما وقع فهو من الله عين تكوين لذلك الواقع في هذا المحل ظاهره صورة معصية لحكم خطاب الشرع وهي في نفس الأمر أعني تلك الواقعة موجود أوجده الله في هذا المحل من الموجودات المسبحة بحمده فلا أثر لهذه المخالفة فيه كما لا أثر للطاعة فيه فتسعد النفس الحيوانية بذلك العمل كان العمل ما كان في الظاهر مما يجري عليه لسان ذنب أو لسان خير فإنه في نفس الأمر ليس بذنب وإنما حركته الحيوانية كحركات غير المكلف لا تتصف بالطاعة ولا بالمعصية وإنما ذلك إنشاء صور في هذا المحل ينظر إليها علماء الرسوم قد ظهرت من مؤمن عاقل بالغ فيحكمون عليه بحسب ما هي عندهم في حكم الشرع من طاعة أو معصية ما يلزمهم غير هذا ما لم يدخل لهم الاحتمال فيه فإن دخل لهم الاحتمال في ذلك لم يجز لهم أن يرجحوا جانب لسان الذنب على غير ذلك كرجل أبصرته في بلدة صحيحا سويا في رمضان يأكل نهارا مع معرفتك به أنه مؤمن فيدخل الاحتمال فيه أن يكون به مرض لا\n\n\nتعرفه أو يكون في حال سفر ولا تعرف ذلك فليس لك أن تقدم على الإنكار عليه مع هذا الاحتمال ولا يلزمك سؤاله عن ذلك بل شغلك بنفسك أولى بك وأما\n\n\nقوله في هذا الباب صَلَّى اللهُ عَليهِ وسَلَّم إن في الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\n### [وجه تسمية الجنة]\n\n\nفاعلم أنه ما سميت الجنة جنة إلا لما نذكره وكذلك تسمية الملائكة جنة وكذلك الجن فكل ذلك راجع إلى الاستتار والاستتار ما هو على نمط واحد بل حكمه مختلف وذلك أن من هذا النوع كون الحق يتجلى في القيامة ويقول أنا ربكم ويرونه ومع هذا ينكرونه ولا يصدقون به أنه ربهم مع وجود الرؤية على رفع الحجاب فإذا\nتحول لهم في العلامة التي يعرفونه بها يقولون له أنت ربنا وهو كان الذي أنكروه وتعوذوا منه وهو الذي أقروا به واعترفوا فما هو هذا الحجاب الذي حصل لهم مع الشهود هل هو أمر وجودي أو حكم عدمي فهو مشهود محجوب ولا حجاب وجودي ولا حكم للعدم في الموجود فانظر ما أخفى هذا وليس في العالم في الدنيا واقع إلا هذا في جميع الأمور والناس في غفلة عنه كما أنا نؤمن أن الملك معنا والشيطان معنا والحجب المحسوسة ما هي موجودة عندنا وأعيننا ناظرة ومع هذا فلا ندرك الملك ولا الجان وهو يرانا وقبيله من حيث لا نراه فهو وقبيله يرانا شهودا عينيا ونحن نراه إيمانا لا عينا فما هو هذا الستر الذي بيننا إذ لو كان بيننا لحجبهم عنا كما يحجبنا عنهم فلا بد من تعيين حكمة في ذلك وكذلك الحجب التي ذكر الله عن نفسه التي بيننا وبينه من نور وظلمة فمن الظلمة وقع التنزيه فنفينا عنه صفات المحدثات فلم نره فنحن جعلنا الحجب على أعيننا بهذا النظر والنور كظهوره لنا حتى نشهده وننكر أنه هو كما قدمنا في التجلي في القيامة وهو عند العارفين اليوم في الدنيا على هذا الحكم فيشهده العارفون في صور الممكنات المحدثات الوجود وينكره المحجوبون من علماء الرسوم ولهذا يسمى بالظاهر في حق هؤلاء العارفين والباطن في حق هؤلاء المحجوبين وليس إلا هو سبحانه وتعالى فأهل الله الذين هم أهله لم يزالوا ولا يزالون دنيا وآخرة في مشاهدة عينية دائمة وإن اختلفت في الصور فلا يقدح ذلك عندهم فإن قال قائل فموسى أحق بهذا الصفة من الولي وقد سأل الرؤية قلنا له قد ثبت عندك إن كنت مؤمنا وإن لم تكن من أهل الكشف‏\n\n\nإن النبي صَلَّى اللهُ عَليهِ وسَلَّم قد أخبر أن الله يتجلى في صورة ويتحول إلى صورة وأنه يعرف وينكر\n\n\nإن كنت مؤمنا لا تشك في هذا وأنه قد بين أن التجلي في الصور بحسب قدر المتجلي له فإذا علمت هذا تعلم أن موسى قد رأى الحق بما هو متجل للأولياء إذ علم أنه يتجلى للأولياء في صور مختلفة لأن موسى ولي الله وقد علم ذلك ومثل هذا فلا يخفى وإنما سأل التجلي في الصورة التي لا يدركها إلا الأنبياء ومن الأنبياء من خصه الله بمقام لم ينله غيره كالكلام بارتفاع الوسائط لموسى عليه السلام فطلب موسى عليه السلام من ربه أن يراه في تلك الصورة التي يطلبها مقامه وأما رؤيته إياه في الصورة التي يراها الأولياء فذلك خبره وديدنه وما جعلك تقول مثل هذا على طريق الاعتراض إلا لكونك لست بولي عارف إذ لو كنت من العارفين لشهدته ولم يغب عنك علم ما انفصلنا به في جواب سؤالك فصح قوله إن في الجنة ما لا عين رأت أي في الستر اعتبارا لا تفسيرا إذ لو رأته عين ما كان مستورا ولو رأته لنطقت به وكان مسموعا ولو كان مسموعا لكان محدودا ولو كان محدودا لأخطرته فكان معلوما فهو أمر حجبنا عنه بحجاب لا يعرف فإنه في الستر المعبر عنه بالجنة فإذا كان عينه عين الستر فما حجبنا إلا جعلنا ما رأيناه سترا فتعلقت الهمة بما خلف الستر وهو المستور فأتى علينا منا وما جعلنا في ذلك إلا التنزيه ولهذا جاءت الأنبياء عليه السلام مع التنزيه بنعوت التشبيه لتقرب الأمر على الناس وتنبيه الأقربين إلى الله الذين هم في عين القرب مع الحجاب الذي هو الأمر عليه فيكون في ذلك التنبيه بالتشبيه رفع الأغطية عن البصر فيتصف البصر بأنه حديد كما يتصف بصر المحتضر قال تعالى فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ فيرى المحتضر ما لا يراه جلساؤه ويخبر جلساءه ما يراه ويدركه ويخبر عن صدق والحاضرون لا يرون شيئا كما لا يرون الملائكة ولا الروحانيين الذين هم معه في مجلس واحد وقد أخبرنا الله بأن الملائكة تحضر مجالس الذكر وهم السياحون في طلب هذه المجالس فإذا رأوا مجلس الذكر نادى بعضهم بعضا هلموا إلى بغيتكم وليس أحد من البشر من أهل ذلك المجلس يدركهم إلا من رفع الله الغطاء عن بصره فأدركهم وهم أهل الكشف أ لم تستمع‏\n\n\nلقول النبي صَلَّى اللهُ عَليهِ وسَلَّم اللذين يمشون خلف الجنائز ركابا أ لا تستحيون أن الملائكة تمشي على أقدامها في الجنازة وأنتم تركبون‏\n\n\nفالمؤمن ينبغي أن يعامل المواطن بما يعامله به صاحب العيان وإلا فليس بمؤمن حقا فإن لكل حق حقيقة وليست الحقيقة التي لكل حق إلا إنزاله منزلة المشهود المدرك للبصر وقد قال هذا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للرجل الذي سمعه يقول أنا مؤمن حقا فقال له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن لكل حق حقيقة فما حقيقة إيمانك فقال الرجل كأني أنظر إلى عرش ربي بارزا يعني يوم القيامة فقال له رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عرفت فالزم‏\n\n\nففسر الحقيقة بالنظر والرؤية وجعله بكان لأن يوم القيامة\nما وقع حسا ولكن وقع في حقه ممثلا فأدركه في التمثيل كالواقع في الحس كالعابد الذي قال له اعبد الله كأنك تراه فما هذا مثل العرش البارز فإن الله هنا موجود في نفس الأمر في قبلة المصلي أو العابد في أي عمل كان وبروز العرش ليس كذلك فمن الناس من يعبد الله كأنه يراه للحجاب الذي منعه من أن يراه ومن الناس من يعبده على رؤية ومشاهدة وليس بين الذي يراه والذي لا يراه إلا كون هذا الذي لا يراه لا يعرفه مع أنه مشهود له عز وجل والعارف يعرفه ولكن مثل هذه المعرفة لا ينبغي أن تقال فإنها لا تقبل فإذا شهدها الإنسان من نفسه لم يتمكن له أن يجهلها فيكون عند ذلك من الذين يرون الله في عبادتهم ويزول عنهم حكم كأنك تراه فاعلم ذلك وأما قوله تعالى فَلا تَعْلَمُ نَفْسٌ ما أُخْفِيَ لَهُمْ يعني للقوم الذين تقدم وصفهم جَزاءً بِما كانُوا يَعْمَلُونَ فما هو جزاؤهم هنا إلا إخفاؤهم ذلك عن هذه النفس التي لا تعلم فيكون إخفاء حال هؤلاء وما لهم عند الله عن هذه النفوس التي لا تعلم جزاء لهم أي جزاؤهم أن يجهل مقامهم عند الله فلا تقدر نفس قدرهم كما قال الحق عن نفسه وما قَدَرُوا الله حَقَّ قَدْرِهِ فأعطاهم نعته في خلقه فلم تعلم نفس ما أخفي لهؤلاء من قرة أعين مما تقر به أعينهم وكذلك‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم وجعلت قرة عيني في الصلاة\n\n\nوإنما ذكر الأعين دون جميع الإدراكات لأن كل كلام إلهي وغير إلهي لا بد أن يكون عينه عن عين موجودة وما ثم إلا كلام فما ثم إلا أعيان توجد ومتعلق الرؤية إدراك عين المرئي واستعداد المرئي للرؤية سواء كان معدوما أو موجودا فإذا رآه قرت عينه بما رآه إذ كان غيره لا يرى ذلك ولهذا سئل موسى الرؤية لتقر عينه بما يراه فكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في حال صلاته صاحب رؤية وشهود ولذلك كانت الصلاة محل قرة عينه لأنه مناج والأعيان كما قلنا تتكون بالكلام فهو والحق في أثناء صور ما دام مناجيا في صلاته فيرى ما يتكون عن تلاوته وما يتكون عن قول الله له في مقابلة ما تكلم به كما ورد في الخبر الذي فيه تقسيم الصلاة من قول العبد فيقول الله وأما قوله في هذا الباب وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله فإن مال الشي‏ء لا يصح أن يكون واقعا فيرى إلا إن مثل للرائي فهو كأنه يراه فإن المال يقابل الحال فالحال موجود والمال ليس بموجود ولهذا سمي مالا والتأويل هو ما يؤول إليه حكم هذا المتشابه فهو محكم غير متشابه عند من يعلم تأويله وليس إلا الله والراسخ في العلم يقول آمَنَّا به كُلٌّ من عِنْدِ رَبِّنا يعني متشابهه ومحكمه فإذا أشهده الله ما له فهو عنده محكم وزال عنه في حق هذا العالم التشابه فهو عنده كما هو عند الله من ذلك الوجه وهو عنده أيضا متشابه لصلاحيته إلى الطرفين من غير تخليص كما هو في نفس الأمر بحكم الوضع المصطلح عليه فهو وإن عرف تأويله فلم يزل عن حكمه متشابها فغاية علم العالم الذي أعلمه الله بما يؤول إليه علمه بالوجه الواحد لا بالوجهين فهو على الحقيقة ما زال عن كونه متشابها لأن الوجه الآخر يطلبه بما يدل عليه ويتضمنه كما طلبه الوجه الذي اعلم الله به هذا الشخص فعلم الله على الحقيقة به أن يعلم تأويله أي ما يؤول إليه من الجانبين في حق كل واحد أو الجوانب إن كانوا كثيرين فيعلمه متشابها لأنه كذا هو إذ كل جانب يطلبه بنصيبه ودلالته منه فالمحكم محكم لا يزول والمتشابه متشابه لا يزول وإنما قلنا ذلك لئلا يتخيل أن علم العالم بما يؤول إليه ذلك اللفظ في حق كل من له فيه حكم إنه يخرجه عن كونه متشابها ليس الأمر كذلك بل هو متشابه على أصله مع العلم بما يؤول إليه في حق كل من له نصيب فيه فهذه الإحاطة مجهولة ولا تعلم إلا في هذه المنازلة فيعطي من هذا المتشابه كل ذي حق حقه كما أعطى الله كُلَّ شَيْ‏ءٍ خَلْقَهُ من الشبه والاشتراك وأما مفاتح الغيب ف لا يَعْلَمُها إِلَّا هُوَ وهو من هذا الباب فلا تعلم إلا بإعلام الله وإن كانت تعلم فلا تعلم أنها مفاتح الغيب فتنبه لهذا\n\n\n### [الاستعدادات من القوابل هي مفاتح الغيب‏]\n\n\nواعلم أن الإعلام أظهر لنا أن الاستعدادات من القوابل هي مفاتح الغيب لأنه ما ثم إلا وهب مطلق عام وفيض جود ما ثم غيب في نفس الأمر ولا شهود بل معلومات لا نهاية لها ومنها ما لها وجود ومنها ما لا وجود لها ومنها ما لها سببية ومنها ما لا سببية لهما ومنها ما لها قبول الوجود ومنها ما لا قبول لها فثم مفتاح وفتح ومفتوح يظهر عند فتحه ما كان هذا المفتوح حجابا عنه فالمفتاح استعدادك للتعلم وقبول العلم والفتح التعليم والمفتوح الباب الذي كنت واقفا معه فإذا لم تقف وسرت رأيت في كل قدم ما لم تره فعلمت ما لم تكن تعلم وكان فضل الله عليك عظيما فالاستعداد غير مكتسب بل هو منحة إلهية فلهذا لا يعلمه إلا الله فيعلم إن ثم مفاتح غيب لكن لا يعلم ما هو مفتاح غيب خاص في مفرد مفرد من الغيوب فإذا حصل الاستعداد من الله تعالى حصل المفتاح وبقي الفتح حتى يقع‏\nالتعليم كما قال الرَّحْمنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ فالتعليم هو عين الفتح ومن هذا الباب فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله كالصلاة على الراحلة فالمستقبل لا يتقيد فهو بحسب ما تمشي به كذلك لا يعرف العارف أين يسلك به ربه في مناجاته فإنه بحسب ما يناجيه به من كلامه وكلامه سور القرآن فأي سورة أو أي آية شاء قرأ من غير تعيين لأن الشارع ما قيده بسورة بعينها فهو بحسب ما يلقى في خاطره وذلك إلى الله فكما لا علم له بما يلقيه في نفسه مما يناجيه به إلا حتى يلقيه كذلك لا يعلم ما يقول له الحق في مناجاته في منازلته ومن هذا الباب قوله فَعِدَّةٌ من أَيَّامٍ أُخَرَ وأيام الله التي بقطعها العبد بعمرة لا يعين قدرها ولهذا نكرها فالذي يجب على المكلف في سفره عدة من أيام أخر له الاختيار في تعيينها ولكن لا يدري ما يعين منها إلا بإلقاء الله في نفسه ذلك والصوم لا مثل له فلا يدري في أي صفة يقيمه مما لا مثل لها من جانب الحق وهي كل صفة إلهية لا يمكن للعبد الاتصاف بها وإن علمها كما يعلم أن الحق لا يماثله ولا يكون بهذا العلم إلها لأن الألوهة ليست صفته وهذا معنى‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم حين سأل ربه اللهم إني أسألك بكل اسم سميت به نفسك أو علمته أحدا من خلقك أو استأثرت به في علم غيبك‏\n\n\nفدخل في هذا كل اسم ممكن أن يتصف به وكل اسم لا يمكن أن يتصف به فما لا يتصف به من الأسماء لا مثل له فيكون معلوما لنا في صومنا غير قائم بنا بحيث أن نتصف به هذا فائدة عدم التعيين في الأيام التي نصومها إذا كنا مسافرين فأفطرنا فنقضي أيام رمضان أو نؤديه في أيام غير معينة فصاحب هذه المنازلة يقصد الله تعالى في عروجه فارغ القلب خالي النفس عريا عن قصد اسم معين إلهي بما أنت عبد وبما هو إله فعال لما يشاء لا يخطر لك أمر تطلبه منه إنما هو أن تكون معه في عروجك بحسب ما يكون منه مع حفظ أوقاتك فيما وقع عليك من التكليف لاقتضاء حق الوقت ومراعاة خطاب الشرع مع غيبتك عنك في ذلك بتوليه فيما أنت فيه وأنت محل لجريان مقاديره مع التحفظ ولزوم الأدب أن يجعلك محلا لما حجره عليك فإن أنت سلكت على هذا الأسلوب يبدو لك من الحق في منازلته ما لم يخطر لك بخاطر بل ما لا ينقال ولا تسعه العبارة\n\n",
    "en": "## Chapter Three Hundred and Eighty-Eight: Concerning the Knowledge of an Unknown Station (منازلة مجهولة)\n\nThis occurs when one ascends without specifically designating the object of their intention from The Real (الحق). Since everything with The Real is designated (معين), the intention directed toward The Real is something that does not correspond to the intention arising from the lack of designation (عدم التعيين).\n\n> We are opposites when we meet,\n> Yet through us, you are in equilibrium.\n\n> And in verification (التحقيق), there is nothing in the cosmos but an Essence (عين),\n> Without doubt, other than Him, and without contention.\n\n> So say to those who deny my true saying:\n> You are blind to the contemplation of the Cloud (العماء).\n\n> And blind to a soul (نفس) in which creation (خلق) exists,\n> Abundant, whose form is the form of mirrors.\n\n> It turns the image of the beholder back to him,\n> By a fixed decree in every beholder.\n\n### [The Increase (الزيادة) is that which has not occurred to the mind]\n\nAllah the Exalted said: <<لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ>> (For those who have done good is the best [reward] and [even] more [an increase]). Thus, He designated the designated (معين) and increased the non-designated (غير معين). I asked some of our Shaykhs about the Increase (الزيادة), and he said: \"That which has not occurred to the mind.\" And the Prophet, peace and blessings be upon him, said: \"Indeed, in Paradise there is what no eye has seen, no ear has heard, and what has not occurred to the heart of man.\"\n\nIt must necessarily be unknown to humanity, and there must necessarily be an unknown and undesignated quality (صفة) in humanity, from which this thing—which is mentioned as having not occurred to the heart of man—is attained. This is the balancing of the unknown with the unknown.\n\nAnd the Exalted said: <<فَلا تَعْلَمُ نَفْسٌ>> (No soul knows)—He made it indefinite and negated knowledge—<<ما أُخْفِيَ لَهُمْ من قُرَّةِ أَعْيُنٍ>> (what has been hidden for them of comfort for eyes). We know generally that it is a witnessed matter (أمر مشاهد) because He coupled it with eyes (الأعين) and did not couple it with the ear or with any other perception. Therefore, we know that:\n\nHis saying, peace and blessings be upon him, \"The comfort of my eye (قرة عيني) was made in the prayer (الصلاة),\" means that he did not intend the intimate conversation (المناجاة), but rather the witnessing (شهود) of the One with whom he was conversing therein. For this reason, he informed us that Allah is in the direction of the worshipper's prayer (قبلة المصلي) and said: \"Worship Allah as if you see Him.\"\n\nFor he, peace and blessings be upon him, *did* see Him in his worship; it was not merely *as if* he saw Him. Among the People of Allah (أهل الله), there are those who attain this rank (الرتبة). Were it not attainable, He would not have coupled it with worship (العبادة) rather than action (العمل). He did not say: \"Act for Allah as if you see Him.\" For worship is not valid without explicit witnessing (شهود صريح) or the imagination (تخيل) of correct witnessing.\n\nRelated to this chapter is His saying, the Exalted: <<وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله>> (And none knows its interpretation [تأويله] except Allah). And related to it is the knowledge of the keys of the Unseen (مفاتح الغيب): <<لا يَعْلَمُها إِلَّا هُوَ>> (None knows them except Him). Everything whose knowledge is dependent upon Allah is not known except by Allah's informing (إعلام) or by His granting of witnessing (إشهاده).\n\nAlso related to this chapter is His saying, the Exalted: <<فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله>> (So wherever you turn, there is the Face of Allah). And related to this chapter is <<فَعِدَّةٌ من أَيَّامٍ أُخَرَ>> (then [the prescribed period is] a number of other days), without designating specific days.\n\nAs for the form of this station (منازلة) for the servant, it is as Abu Yazid said concerning sitting with Allah without state (حال) or attribute (نعت). This means that the servant's intention (قصد) is based on what Allah knows, and he does not designate anything upon Allah. For whoever designates something upon Allah in his intention, there is no difference in form between him and one who worships Allah \"upon the edge\" (على حرف).\n\nThe possessor of this station worships his Lord by the designation of times (تعيين الأوقات), not by his own designation. He is subject to the ruling of his time (وقته), and the time is from Allah, not from him. Thus, he does not know what his time will suddenly bring him. His ultimate goal is to be prepared for an unknown Divine influx (وارد مجهول إلهي) that establishes him in whatever worship He wills. That worship then yields for him from The Real (الحق) in his station (منازلته) something that does not correspond to that action (العمل) in his knowledge, yet it is appropriate to his worship within that action. Therefore, it is an increase (زيادة) when viewed in relation to the action, and a result (نتيجة) when viewed in relation to the worship within it.\n\nThis is a station for which we have not found anyone among the People of Allah (أهل الله) who has tasted it in our knowledge, because most of them do not distinguish between worship (العبادة) and action (العمل). Every action for which the Lawgiver (الشارع) does not reveal a specific reason (تعليل) from His side is pure devotion (تعبد). Thus, worship is more manifest in every unreasoned action than in the reasoned action. For when an action is reasoned, the wisdom of that reason may motivate the servant toward it. But if it is unreasoned, nothing motivates him toward that action except pure worship (العبادة المحضة).\n\n### [Worship (العبادة) is an Essential State of Man]\n\nKnow that worship (العبادة) is an essential state (حال ذاتي) of man. It is not valid for it to have a created reward (أجر مخلوق) because it is not created in origin. The entities (الأعيان) of everything other than Allah are created, existent, and originated (حادثة), but the worship within them is not created. Rather, it belongs to these entities—meaning the entities of the World (العالم)—both in their state of non-existence (عدم) and in their state of existence (وجود). Through it, it was valid for him to accept Allah's command of 'Be!' (التكوين) without hesitation. Rather, Allah the Exalted informed us that He <<يَقُولُ لَهُ كُنْ فَيَكُونُ>> (says to it, 'Be,' and it is). Thus, the ruling of worship (حكم العبادة) for the contingent being (الممكن) in its state of non-existence is more effective in it than in its state of existence. This is because, in its state of existence, with its opinion solidified, its self-regard established, and its independence, it inevitably claims some form of lordship (سيادة), whatever that may be. Its ruling of worship is diminished by the extent of the lordship it claims. Therefore, we said that the ruling of worship for the contingent being is more effective in its state of non-existence than in its state of existence.\n\nWhoever maintains this state is accompanied by Witnessing (الشهود) in this world and the Hereafter. His attribute, if this is his state, is that he does not rejoice over anything, nor grieve over anything, nor laugh, nor weep. No description confines him, and no existent attribute distinguishes him. He has neither trace (رسم) nor description (وصف). Abu Yazid al-Bistami, may Allah be pleased with him, said concerning this station: \"I laughed for a time and wept for a time, and today I neither laugh nor weep.\" And he said concerning this station when he was asked, \"How are you this morning?\" He replied: \"I have neither morning nor evening. Morning and evening belong only to those who are confined by attributes (صفة), and I have no attribute.\"\n\nThus, he described himself with absolute freedom (الإطلاق). Absolute freedom is only valid specifically in worship, because the servant (العبد) is bound by the will of the Master who owns him therein. Whoever possesses absolute freedom, his reward (أجر) is neither restricted nor designated, because the servant does not have a reward like a hired worker (الأجير). Our Shaykh, Abu al-Abbas al-Urini, from Al-Ulya in Western Andalusia—who was the first Shaykh I served and benefited from—had a firm footing (قدم راسخة) in this chapter, the chapter of Servitude (العبودية). The servant maintains it in his affair just as The Real (الحق) maintains it in His affair. Thus, the recompense for absolute freedom is absolute freedom.\n\nGabriel asked the Messenger of Allah, peace and blessings be upon him, about spiritual excellence (الإحسان), and he replied: \"That you worship Allah as if you see Him.\" He did not mention action (العمل), but rather mentioned worship (العبادة). And Allah the Exalted said: <<هَلْ جَزاءُ الْإِحْسانِ إِلَّا الْإِحْسانُ>> (Is the reward for goodness [الإحسان] anything but goodness?). This confirms our statement: the recompense for absolute freedom is absolute freedom.\n\nRewards (الأجور) are restricted, ranging from ten to seven hundred times, because they are rewards for designated actions (أعمال معينة) that are finite in time. Therefore, their reward must be restricted by number. Even if it is given generously (جزافا), it is restricted by number with Allah. For example, the patient person (الصابر) is given his reward without specific reckoning (بغير حساب معين). The knowledge of this is with us, but with Allah, it is restricted by a known measure, because patience (الصبر) encompasses all actions, as it is the restraint of the soul upon prescribed actions. For this reason, measure does not encompass it. Actions, however, are subject to measures. According to the extent of the actions the legally responsible person (المكلف) performs until his death, he restrains his soul upon them until the state of patience (حال الصبر) and the name of the patient person (الصابر) are valid for him. Thus, his reward is unknown and unmeasured by him in its totality, even though it is known to Allah, like a bulk sale (المجازفة) without measuring what is measurable or weighing what is weighable. Patience differs from worship in that worship belongs to him in his state of non-existence (عدم) and his lack of legal responsibility (عدم تكليفه), whereas patience does not belong to him in his state of non-existence or his lack of legal responsibility. Thus, worship never leaves him, neither in this world nor the Hereafter.\n\nWhen his witnessing (مشهده) is his worship during his ascent (ارتقاؤه), and The Real (الحق) descends to him, as The Real described Himself with descent, then the meeting occurs, which is the Station (المنازلة). Insofar as the servant is engaged in an action—because he must be engaged in a prescribed, righteous action, which is what he ascends with, for it is his Buraq (براقه) because he is carried—Allah receives him, based on that action, with the goodness (البر) that Allah designated for whoever performs it, and this is a known, measured amount.\n\nThen The Real looks at this legally responsible person (المكلف) and sees him, despite being engaged in his action, not witnessing that action as his own, due to his knowledge that Allah is the Doer (العامل) of it, not him, and that he is merely the locus for the creation of the action and like the instrument (الآلة) for the existence of that action. Thus, The Real grants the entitlement for that action based on what He promised concerning it. Then He looks at the witnessing (مشهد) of that person and finds him in his worship (عبادته) which he has never ceased to possess, even in his state of non-existence. There is no recompense (جزاء) in exchange for it except that he is not afflicted by heedlessness (الغفلة) concerning it during the time when heedlessness is created in legally responsible persons. There is nothing but this. This is what we said concerning the contingent being (الممكن) in its state of existence: that the ruling of lordship (حكم سيادة) must manifest from it because it is in the time governed by heedlessness. The Divine care (العناية) for this servant in this station is the removal of heedlessness from worship in every state. This, then, is the Increase (الزيادة) in His saying: <<لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ>>.\n\nFor those who have done good (أحسنوا) through actions (الأعمال), the best (الحسنى) is what they receive as rewards (الأجور)—or rather, what the actions receive as rewards, which are precisely for the doer (العامل). And the Increase is what we mentioned regarding the possessor of worship: he is not afflicted by heedlessness during the time of action concerning who the Doer is. He sees that Allah is the Doer. The reward sought by the action returns only to the Doer. The Doer, in his view, is Allah. If Allah were one who accepted wages, His wage would be commensurate with His measure. Thus, the legally responsible person (المكلف), who is the instrument receptive to rewards, receives the reward that would be due to Allah if He accepted wages. How would His wage be? Would it not be commensurate with His measure, even if the action restricts it?\n\nWhere is the reward of this legally responsible person with this Witnessing (الشهود) compared to the reward of one who sees in his action that the legally responsible person is the Doer, not The Real (الحق)? His reward will be commensurate with the measure of this legally responsible person, and he will receive nothing but the specific reward for the action, commensurate with the measure of the doer, because the doer, in his view, is his own essence (عينه), and he has no measure. Were it not for his manifestation and his being characterized by obedience to his Lord in his action, he would have no measure in himself. For this reason, you see the outcome of the transgressor (المخالف) tending toward what it tends. If he had intrinsic measure (قدر في نفس الأمر), he would be happy by the ruling of his measure. Rather, he is made happy by the Mercy of Allah. Their happiness would not differ if they had a measure by which they deserved happiness. We do not doubt that they differ in happiness, just as they differ in actions—in state (حال), time (زمان), place (مكان), the essence of the action (عين عمل), continuity (دوام), gathering (اجتماع), and solitude (انفراد), and other factors that cause differentiation. Thus, we know that there is no recompense for measure (جزاء القدر).\n\nTherefore, we know that man, insofar as he is an entity (عينه), has no measure except through obedience to his Lord and the measure of his action. Then, The Real (الحق), after this consideration and the designation of the recompense as we established, looks at the witnessing (شهود) of this legally responsible person and sees him as possessing worship (عبادة), with the action being subsidiary to it. He is not characterized by turning away from actions nor by turning toward them, and he remains upon the state he was in during his non-existence (عدم), unchanged. So He keeps him in his state and veils heedlessness (الغفلة) from him, so that it has no effect on him in any way. This is the general infallibility (العصمة العامة). If a transgression (مخالفة) occurs from him, it only occurs by the ruling of Divine Decree and Destiny (القضاء والقدر) through their creation within him, just as obedience occurred. His state of worship is not diminished, because heedlessness is veiled from him and Presence (الحضور) is constant for him.\n\nWhen whatever occurs from him occurs, it is from Allah, the very creation (عين تكوين) of that occurrence in this locus. Its outward appearance is the form of a disobedience (معصية) according to the ruling of the Divine Law (خطاب الشرع), but in reality—meaning that occurrence—it is an existent thing (موجود) that Allah brought into existence in this locus, among the existent things that glorify Him with praise. This transgression has no effect on him, just as obedience has no effect on him. The animal soul (النفس الحيوانية) is made happy by that action, whatever the action may be outwardly, whether the tongue of sin (لسان ذنب) or the tongue of goodness applies to it. For in reality (نفس الأمر), it is not a sin. Rather, his animal movement is like the movements of one who is not legally responsible (غير المكلف); it is not characterized by obedience or disobedience. That is merely the creation of forms in this locus, which the scholars of outward forms (علماء الرسوم) observe, having manifested from a believing, sane, adult person. They judge him according to what they hold concerning the ruling of the Divine Law (حكم الشرع), whether it is obedience or disobedience. Nothing other than this is incumbent upon them, unless the possibility of excuse enters their consideration. If the possibility of excuse enters their consideration, it is not permissible for them to prefer the side of the tongue of sin over other possibilities. For example, if you see a man in a town, healthy and sound, eating during the day in Ramadan, while knowing him to be a believer, the possibility enters that he might have an illness you do not know of, or that he might be traveling, and you do not know that. You are not permitted to proceed with denouncing him while this possibility exists, nor are you obliged to question him about it. Rather, occupying yourself with your own soul is more appropriate for you.\n\nAs for his saying, peace and blessings be upon him, in this chapter: \"Indeed, in Paradise there is what no eye has seen, no ear has heard, and what has not occurred to the heart of man.\"\n\n### [The Reason for Naming Paradise (الجنة)]\n\nKnow that Paradise (الجنة) was only named *Janna* (Garden/Veil) for the reason we shall mention. Likewise, the naming of the angels *Jinna* (hidden beings) and the Jinn (الجن). All of this refers back to concealment (الاستتار). Concealment is not of a single type; rather, its ruling differs.\n\nAn example of this type is The Real (الحق) manifesting (يتجلى) on the Day of Resurrection and saying, \"I am your Lord.\" They see Him, yet despite this, they deny Him and do not believe that He is their Lord, even though the vision occurs with the veil (الحجاب) lifted. When He transforms for them into the sign by which they recognize Him, they say to Him, \"You are our Lord.\" He was the very one they denied and sought refuge from, and He is the one they affirmed and acknowledged. What, then, is this veil that occurred to them alongside the Witnessing (الشهود)? Is it an existent matter (أمر وجودي) or a non-existent ruling (حكم عدمي)? He is witnessed yet veiled (مشهود محجوب), and there is no existent veil, nor is there a ruling of non-existence in the existent. See how subtle this is!\n\nNothing occurs in the world (العالم) in this life except this, in all matters, and people are heedless of it. Just as we believe that the Angel (الملك) is with us and the Devil (الشيطان) is with us, and perceptible veils are not present with us, and our eyes are looking, yet we do not perceive the Angel or the Jinn. He and his tribe see us from where we do not see them. So he and his tribe see us with ocular witnessing (شهود عينيا), while we see him with faith (إيمانا), not ocularly. What, then, is this concealment (الستر) between us? For if it were between us, it would veil them from us just as it veils us from them. A wisdom (حكمة) must necessarily be designated for this.\n\nLikewise, the veils (الحجب) that Allah mentioned concerning Himself, which are between us and Him, consisting of light (نور) and darkness (ظلمة). From the darkness arises transcendence (التنزيه), so we negate from Him the attributes of originated things (صفات المحدثات), and thus we do not see Him. We have placed the veils upon our own eyes through this perspective. And the light is like His manifestation (ظهوره) to us, such that we witness Him and deny that it is Him, as we presented concerning the Theophany (التجلي) on the Day of Resurrection. This is the ruling for the Gnostics (العارفين) today in this world: the Gnostics witness Him in the forms of contingent, originated existents (صور الممكنات المحدثات الوجود), while the veiled ones (المحجوبون) among the scholars of outward forms (علماء الرسوم) deny Him. For this reason, He is called the Manifest (الظاهر) in relation to these Gnostics, and the Hidden (الباطن) in relation to these veiled ones. And there is none but Him, glory be to Him and Exalted is He.\n\nThe People of Allah (أهل الله), who are His own, have always been and will always be in continuous ocular witnessing (مشاهدة عينية دائمة), both in this world and the Hereafter. Even if the forms differ, this does not detract from their state.\n\nIf someone says: \"Moses was more entitled to this attribute than the saint (الولي), yet he asked for the Vision (الرؤية),\" we reply: It is established with you, if you are a believer—even if you are not among the People of Unveiling (أهل الكشف)—that the Prophet, peace and blessings be upon him, informed us that Allah manifests (يتجلى) in a form and transforms into a form, and that He is recognized and denied. If you are a believer, you do not doubt this, and He has clarified that the Theophany (التجلي) in forms is according to the measure of the one to whom the manifestation occurs. If you know this, you know that Moses had already seen The Real (الحق) in the way He manifests to the saints (الأولياء), since it is known that He manifests to the saints in various forms, and Moses was a saint of Allah (ولي الله) and knew this. Such a thing is not hidden. Rather, he asked for the Theophany in the form that only the Prophets perceive. And among the Prophets, there are those whom Allah singled out with a station (مقام) that no one else attained, such as the direct speech (الكلام) without intermediaries granted to Moses, peace be upon him. So Moses, peace be upon him, asked his Lord to see Him in that form which his station demanded. As for his seeing Him in the form that the saints see, that was his constant state and habit. What made you raise such an objection is only that you are not a Gnostic saint (ولي عارف). If you were among the Gnostics (العارفين), you would witness Him, and the knowledge by which we resolved your question would not be hidden from you.\n\nThus, his saying, \"Indeed, in Paradise there is what no eye has seen,\" is correct—meaning, in the concealment (الستر), by way of consideration, not interpretation. For if an eye had seen it, it would not have been concealed. If it had seen it, it would have spoken of it, and it would have been heard. If it had been heard, it would have been limited. If it had been limited, it would have occurred to the mind, and thus would have been known. It is a matter from which we are veiled by an unknown veil, for it is in the concealment expressed as Paradise (الجنة). If its very essence (عينه) is the essence of the concealment, then we were only veiled because we made what we saw a veil. Thus, the spiritual aspiration (الهمة) attached itself to what is behind the veil, which is the concealed. What came upon us came from ourselves. What caused us to do this was only transcendence (التنزيه).\n\nFor this reason, the Prophets, peace be upon them, came with attributes of similitude (نعوت التشبيه) alongside transcendence, in order to bring the matter closer to people and to alert those closest to Allah, who are in the very essence of proximity (عين القرب) despite the veil that governs the matter. In that alert through similitude, the coverings are lifted from the sight, and the sight becomes sharp, just as the sight of the dying person (المحتضر) becomes sharp. Allah the Exalted said: <<فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ>> (We have removed from you your covering, so your sight today is sharp). The dying person sees what his companions do not see, and he informs his companions of what he sees and perceives, speaking truthfully, while those present see nothing, just as they do not see the angels or the spiritual beings (الروحانيين) who are with him in the same gathering. Allah has informed us that the angels attend the gatherings of remembrance (مجالس الذكر); they are the travelers seeking these gatherings. When they see a gathering of remembrance, they call out to one another, \"Come to your desire!\" Yet none of the humans in that gathering perceives them except for those whose sight Allah has lifted the covering from, and these are the People of Unveiling (أهل الكشف). Did you not hear the saying of the Prophet, peace and blessings be upon him, concerning those who walk behind funerals while riding: \"Do you not feel shame that the angels walk on their feet at the funeral while you ride?\"\n\nThe believer ought to treat situations as the possessor of ocular vision (صاحب العيان) treats them. Otherwise, he is not a true believer. For every truth (حق) has a reality (حقيقة), and the reality of every truth is nothing but placing it in the rank of the witnessed, perceived by sight. The Messenger of Allah, peace and blessings be upon him, said this to a man whom he heard saying, \"I am a true believer.\" The Messenger of Allah, peace and blessings be upon him, said to him: \"Indeed, every truth has a reality. What is the reality of your faith?\" The man replied: \"It is as if I am looking at the Throne of my Lord, manifest (بارزا),\" meaning on the Day of Resurrection. The Messenger of Allah, peace and blessings be upon him, said to him: \"You have known, so adhere to it.\"\n\nThus, he interpreted reality (الحقيقة) as looking and seeing (النظر والرؤية) and expressed it using \"as if\" (كأن) because the Day of Resurrection has not occurred sensually, but it occurred for him in representation (ممثلا), so he perceived it in representation as if it were occurring sensually. This is like the worshipper to whom it was said, \"Worship Allah as if you see Him.\" This is not like the manifest Throne, for Allah is existent here, in reality (نفس الأمر), in the direction of the prayer (قبلة) of the worshipper, or the devotee in whatever action he is engaged in. The manifestation of the Throne is not like that. Among people, there are those who worship Allah as if they see Him, due to the veil (الحجاب) that prevents them from seeing Him. And among people, there are those who worship Him based on vision and witnessing (رؤية ومشاهدة). The only difference between the one who sees Him and the one who does not see Him is that the one who does not see Him does not recognize Him, even though He, the Mighty and Majestic, is witnessed by him. The Gnostic (العارف) recognizes Him. However, such gnosis (معرفة) should not be spoken of, for it is not accepted. If a person witnesses this from his own soul, he cannot possibly be ignorant of it. At that point, he becomes one of those who see Allah in their worship, and the ruling of \"as if you see Him\" is removed from them. Know this.\n\nAs for His saying, the Exalted: <<فَلا تَعْلَمُ نَفْسٌ ما أُخْفِيَ لَهُمْ>> (No soul knows what has been hidden for them)—meaning for the people whose description preceded—<<جَزاءً بِما كانُوا يَعْمَلُونَ>> (as reward for what they used to do). Their recompense (جزاؤهم) here is nothing but the concealment of that from this soul (نفس) that does not know. Thus, the concealment of the state of these people and what they possess with Allah from these ignorant souls is a recompense for them. That is, their recompense is that their station (مقامهم) with Allah remains unknown, so no soul can measure their measure (قدرهم), just as The Real said concerning Himself: <<وما قَدَرُوا الله حَقَّ قَدْرِهِ>> (And they did not measure Allah with His true measure). So He granted them His own attribute (نعته) in His creation. Thus, no soul knows what has been hidden for these people of comfort for eyes (قرة أعين), by which their eyes are comforted.\n\nLikewise, the Prophet, peace and blessings be upon him, said: \"The comfort of my eye (قرة عيني) was made in the prayer (الصلاة).\" He mentioned the eyes (الأعين) specifically, excluding all other perceptions, because every speech, Divine or otherwise, must necessarily have its essence (عينه) derived from an existent entity (عين موجودة). And there is nothing but speech. Thus, there are only entities that come into existence. The object of vision (الرؤية) is the perception of the essence (عين) of the seen thing and the readiness of the seen thing for vision, whether it is non-existent or existent. When he sees it, his eye is comforted by what he sees, since others do not see that. For this reason, Moses asked for the Vision (الرؤية), so that his eye might be comforted by what he saw. The Messenger of Allah, peace and blessings be upon him, was a possessor of vision and witnessing (رؤية وشهود) during his prayer. Therefore, the prayer was the locus of the comfort of his eye, because he was conversing intimately (مناج). And the entities (الأعيان), as we said, are formed by speech. Thus, he and The Real (الحق) are amidst forms as long as he is conversing intimately in his prayer. He sees what is formed from his recitation and what is formed from Allah's saying to him in response to what he spoke, as mentioned in the tradition that divides the prayer between the servant's saying and Allah's saying.\n\nAs for His saying in this chapter: <<وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله>> (And none knows its interpretation [تأويله] except Allah), the outcome (مال) of a thing cannot be actualized and seen unless it is represented to the viewer, so that it is *as if* he sees it. The outcome is contrasted with the state (الحال). The state is existent, but the outcome is not existent, which is why it is called an outcome. The interpretation (التأويل) is that to which the ruling of this ambiguous matter (المتشابه) reverts. It is definitive (محكم), not ambiguous, for the one who knows its interpretation, and that is none but Allah. The firmly rooted in knowledge (الراسخ في العلم) say: <<آمَنَّا به كُلٌّ من عِنْدِ رَبِّنا>> (We believe in it; all is from our Lord)—meaning its ambiguous and its definitive parts. If Allah grants him witnessing of its outcome (ماله), then it is definitive for him, and the ambiguity (التشابه) is removed for this knower. It is with him as it is with Allah in that respect. Yet, it is also ambiguous for him due to its suitability for both sides without purification, as it is in reality (نفس الأمر) according to the conventional usage. Even if he knows its interpretation, it has not ceased to be ambiguous in its ruling, because the other aspect demands it by what it indicates and implies, just as the aspect by which Allah informed this person demanded it. The true knowledge of Allah concerning it is to know its interpretation—that is, what it reverts to from both sides, regarding every single person, or multiple sides if they are many. Thus, He knows it as ambiguous, because that is what it is, since every side demands it by its share and its indication from it.\n\nThe definitive (المحكم) is definitive and does not cease, and the ambiguous (المتشابه) is ambiguous and does not cease. We only said this so that it is not imagined that the knower's knowledge of what that word reverts to, concerning everyone who has a ruling in it, removes it from being ambiguous. The matter is not so. Rather, it remains ambiguous according to its origin, along with the knowledge of what it reverts to concerning everyone who has a share in it. This comprehensive knowledge (الإحاطة) is unknown and is only known in this Station (منازلة). Thus, from this ambiguous matter, every possessor of a right is given his right, just as Allah gave <<كُلَّ شَيْ‏ءٍ خَلْقَهُ>> (everything its creation) in terms of resemblance and participation. As for the keys of the Unseen (مفاتح الغيب): <<لا يَعْلَمُها إِلَّا هُوَ>> (None knows them except Him). This is related to this chapter. They are not known except by Allah's informing (إعلام). Even if they are known, they are not known *as* the keys of the Unseen. Pay attention to this.\n\n### [The Readinesses (الاستعدادات) of the Receptacles (القوابل) are the Keys of the Unseen]\n\nKnow that the Divine informing (الإعلام) has revealed to us that the readinesses (الاستعدادات) of the receptacles (القوابل) are the keys of the Unseen (مفاتح الغيب). This is because there is nothing but absolute, general bestowal (وهب مطلق عام) and the overflowing of generosity (فيض جود). There is no Unseen (غيب) in reality (نفس الأمر), nor is there Witnessing (شهود), but rather endless known things (معلومات). Among them are those that have existence, and those that do not have existence. Among them are those that have causality, and those that do not have causality. Among them are those that have the acceptance of existence (قبول الوجود), and those that do not have acceptance. Thus, there is a key (مفتاح), an opening (فتح), and an opened thing (مفتوح). When the opened thing is opened, what was a veil (حجاب) from it becomes manifest. The key is your readiness (استعدادك) to learn and accept knowledge (قبول العلم). The opening is the teaching (التعليم). The opened thing is the door you were standing before. If you do not stop but proceed, you will see at every step what you have not seen, and you will know what you did not know, and the bounty of Allah upon you will be great.\n\nReadiness (الاستعداد) is not acquired; rather, it is a Divine gift (منحة إلهية). For this reason, none knows it except Allah. He knows that there are keys of the Unseen, but He does not know what specific key of the Unseen belongs to each individual item of the Unseen. When the readiness is attained from Allah the Exalted, the key is attained, and the opening remains until the teaching occurs, as He said: <<الرَّحْمنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ>> (The Most Merciful taught the Qur'an. He created man. He taught him clear expression). The teaching is the very essence of the opening.\n\nRelated to this chapter is <<فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله>> (So wherever you turn, there is the Face of Allah), like praying upon a riding animal. The direction faced is not restricted; it is according to the direction the animal walks. Likewise, the Gnostic (العارف) does not know where his Lord will lead him in his intimate conversation (مناجاته). It is according to what He converses with him from His Speech, and His Speech consists of the chapters (surahs) of the Qur'an. He recites whatever chapter or verse He wills, without designation, because the Lawgiver (الشارع) did not restrict him to a specific chapter. It is according to what is cast into his mind, and that belongs to Allah. Just as he has no knowledge of what He casts into his soul for him to converse with until He casts it, likewise he does not know what The Real (الحق) says to him in his intimate conversation in his station (منازلته).\n\nRelated to this chapter is His saying: <<فَعِدَّةٌ من أَيَّامٍ أُخَرَ>> (then [the prescribed period is] a number of other days). These are the days of Allah that the servant completes by performing *Umrah* (minor pilgrimage), whose measure is not designated, which is why He made them indefinite. What is incumbent upon the legally responsible person (المكلف) during his travel is a number of other days, and he has the choice in designating them. However, he does not know what he will designate from them except by Allah casting that into his soul. Fasting (الصوم) has no likeness (لا مثل له). Thus, he does not know in which unlikeness-possessing attribute (صفة) from the side of The Real He establishes him. This refers to every Divine Attribute (صفة إلهية) with which the servant cannot be characterized, even if he knows it, just as he knows that The Real has no likeness. He does not become a god (إلها) through this knowledge, because Divinity (الألوهة) is not his attribute.\n\nThis is the meaning of his saying, peace and blessings be upon him, when he asked his Lord: \"O Allah, I ask You by every Name You have named Yourself with, or taught to any of Your creation, or kept exclusively in Your knowledge of the Unseen (علم غيبك).\" This includes every Name with which it is possible for him to be characterized and every Name with which it is impossible for him to be characterized. The Names with which he cannot be characterized have no likeness. Thus, they are known to us in our fasting, but not established in us in such a way that we are characterized by them. This is the benefit of the lack of designation (عدم التعيين) in the days we fast when we travel and break the fast, so we make up the days of Ramadan or perform it on undesignated days.\n\nThe possessor of this station (منازلة) intends Allah the Exalted in his ascent (عروجه), empty-hearted, soul-vacant, stripped of the intention of a specific Divine Name, based on the fact that you are a servant and He is a God (إله), Doer of what He wills. No matter that you seek from Him occurs to your mind. Rather, it is that you are with Him in your ascent according to what proceeds from Him, while observing your times regarding the legal responsibility (التكليف) that has fallen upon you, fulfilling the right of the time and observing the address of the Divine Law (خطاب الشرع). This is done while being absent from yourself in that, by His taking charge of what you are in, and you being the locus for the flow of His decrees (مقاديره), along with caution and adherence to proper conduct (الأدب) lest He make you the locus for what He has forbidden you. If you proceed upon this method, there will appear to you from The Real (الحق) in His station (منازلته) what has not occurred to your mind, indeed, what cannot be spoken and what expression (العبارة) cannot encompass.",
    "ur": "باب تین سو اٹھاسی: نامعلوم منزل (Manzila Majhūla) کی معرفت میں\n\nاور یہ اس وقت ہوتا ہے جب سالک (Sālik) بغیر کسی خاص ارادے کے اس چیز کی طرف عروج (Irtiqā) کرتا ہے جس کا وہ ذات حق (الحق) سے قصد کرتا ہے، حالانکہ ذات حق (الحق) کے نزدیک ہر شے متعین (Mu'ayyan) ہے۔ پس اس نے ذات حق (الحق) سے اس چیز کا قصد کیا جو عدمِ تعین (Adam al-Ta'yīn) کے اس کے قصد کے مناسب نہیں ہے۔\n\n> جب ہم جمع ہوتے ہیں تو ہم ایک دوسرے کی ضد ہوتے ہیں،\n> اور ہمارے ذریعے ہی تم یکساں ہوتے ہو۔\n> اور تحقیق (Taḥqīq) میں، کائنات میں کوئی عین (Ayn) نہیں ہے،\n> بغیر کسی شک و شبہ کے، اس کے سوا کوئی نہیں۔\n> پس میرے صحیح قول کے منکروں سے کہہ دو:\n> تم عماء (Al-'Amā' - غیب مطلق) کے مشاہدے سے اندھے ہو گئے ہو۔\n> اور اس نفس (Nafs) سے بھی جو اس میں خلق (Khalq) ہوتا ہے،\n> جس کی کثیر شکلیں آئینے کی شکل جیسی ہوتی ہیں۔\n> پس وہ دیکھنے والے کی صورت کو اپنی طرف پلٹ دیتا ہے،\n> ہر دیکھنے والے میں ایک ثابت حکم (Ḥukm) کے ساتھ۔\n\n### [زیادہ (Ziyāda) سے مراد وہ ہے جو دل میں کبھی نہ آیا ہو]\n\nاللہ تعالیٰ نے فرمایا: \"جن لوگوں نے نیکی کی ان کے لیے بھلائی (الحسنیٰ) ہے اور زیادہ (وزِیادَةٌ) بھی ہے۔\" (سورۃ یونس، ۱۰:۲۶) پس اس نے متعین (Mu'ayyan) کے لیے متعین کو مقرر کیا اور غیر متعین (Ghayr Mu'ayyan) کو زیادہ کیا۔ میں نے اپنے بعض شیوخ سے زیادتی (Ziyāda) کے بارے میں پوچھا تو انہوں نے فرمایا: \"وہ جو دل میں کبھی نہ آیا ہو۔\" اور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"بے شک جنت میں وہ کچھ ہے جسے نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی بشر کے دل پر اس کا خیال گزرا۔\"\n\nلہٰذا ضروری ہے کہ وہ بشر کے لیے نامعلوم ہو، اور یہ بھی ضروری ہے کہ بشر میں کوئی ایسی صفت ہو جو نامعلوم اور غیر متعین ہو، جس سے اسے وہ چیز حاصل ہو جو ذکر کی گئی کہ وہ کسی بشر کے دل پر نہیں گزری۔ یہ نامعلوم (Majhūl) کا نامعلوم سے موازنہ ہے۔ اور اللہ تعالیٰ نے فرمایا: \"پس کوئی جان نہیں جانتی\" (فَلا تَعْلَمُ نَفْسٌ) \"جو کچھ ان کے لیے آنکھوں کی ٹھنڈک کے طور پر چھپا کر رکھا گیا ہے۔\" (مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ) (سورۃ السجدہ، ۳۲:۱۷) پس ہم نے اجمالی طور پر جان لیا کہ یہ ایک مشاہدہ کی جانے والی چیز ہے کیونکہ اس نے اسے آنکھوں کے ساتھ جوڑا ہے، کان یا کسی اور ادراک (Idrāk) کے ساتھ نہیں۔ اسی لیے ہم نے جانا کہ:\n\nنبی اکرم صلی اللہ علیہ وسلم کا یہ فرمان کہ \"میری آنکھوں کی ٹھنڈک نماز میں رکھی گئی ہے،\" اس سے مراد مناجات (Munājāt) نہیں تھی، بلکہ اس ذات کا شہود (الشہود) تھا جس سے وہ نماز میں مناجات کر رہے تھے۔ اور اسی لیے آپ نے ہمیں خبر دی کہ اللہ نمازی کے قبلہ (Qibla) میں ہوتا ہے، اور فرمایا: \"اللہ کی عبادت (Ibādah) ایسے کرو گویا تم اسے دیکھ رہے ہو۔\" بے شک آپ صلی اللہ علیہ وسلم اپنی عبادت میں اسے دیکھتے تھے، نہ کہ گویا دیکھتے تھے۔ اور اہل اللہ (Ahl Allāh) میں سے بعض کو یہ رتبہ (Rutbah) حاصل ہوتا ہے، اور اگر یہ حاصل نہ ہوتا تو آپ اسے عمل (Amal) کے بجائے عبادت (Ibādah) کے ساتھ نہ جوڑتے۔ آپ نے یہ نہیں فرمایا کہ \"اللہ کے لیے عمل ایسے کرو گویا تم اسے دیکھ رہے ہو۔\" کیونکہ صریح شہود (Shuhūd) یا صحیح تخیلِ شہود کے بغیر عبادت درست نہیں ہوتی۔ اور اسی باب میں اللہ تعالیٰ کا یہ فرمان ہے: \"اور اس کی تاویل (Ta'wīl) کو اللہ کے سوا کوئی نہیں جانتا۔\" (وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ) (سورۃ آل عمران، ۳:۷) اور اسی میں غیب کی کنجیوں (Mufātiḥ al-Ghayb) کا علم ہے: \"انہیں اس کے سوا کوئی نہیں جانتا۔\" (لَا يَعْلَمُهَا إِلَّا هُوَ) (سورۃ الانعام، ۶:۵۹) اور ہر وہ علم جو اللہ پر موقوف ہے، وہ اللہ کے بتانے یا اس کا شہود (الشہود) کرانے کے بغیر معلوم نہیں ہو سکتا۔ اور اسی باب میں اللہ تعالیٰ کا یہ فرمان ہے: \"پس تم جدھر بھی رخ کرو گے، وہیں اللہ کا چہرہ (وَجْهُ اللَّهِ) ہے۔\" (سورۃ البقرہ، ۲:۱۱۵) اور اسی باب میں یہ فرمان ہے: \"تو دوسرے دنوں میں گنتی پوری کرے۔\" (فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ) (سورۃ البقرہ، ۲:۱۸۴) بغیر کسی متعین دنوں کے تعین کے۔\n\nجہاں تک بندے کی طرف سے اس منزل (Manzila) کی صورت کا تعلق ہے، تو وہ وہی ہے جو ابو یزید (بسطامی) نے اللہ کے ساتھ بغیر کسی حال (Ḥāl) یا نعت (Na't) کے بیٹھنے کے بارے میں کہا۔ اور وہ یہ ہے کہ بندہ اپنے قصد میں اس چیز پر ہو جسے اللہ جانتا ہے، وہ اللہ پر کسی چیز کا تعین نہ کرے۔ کیونکہ جو شخص اپنے قصد میں اللہ پر کسی چیز کا تعین کرتا ہے، تو صورت کے اعتبار سے اس میں اور اس شخص میں کوئی فرق نہیں جو اللہ کی عبادت کنارے پر رہ کر کرتا ہے۔ پس اس منزل (Manzila) کا مالک اپنے رب کی عبادت اوقات کے تعین کے ساتھ کرتا ہے، نہ کہ اپنے تعین کے ساتھ۔ پس وہ اپنے وقت کے حکم میں ہوتا ہے، اور وقت اللہ کی طرف سے ہے نہ کہ اس کی طرف سے۔ لہٰذا وہ نہیں جانتا کہ اس کا وقت اسے کس چیز سے اچانک دوچار کرے گا۔ اس کی انتہا یہ ہے کہ وہ ایک نامعلوم الٰہی وارد (Wārid) کے لیے تیار ہو جو اسے کسی بھی عبادت میں کھڑا کر دے جو وہ چاہے، پس وہ عبادت اس کے لیے ذات حق (الحق) کی طرف سے اس کی منزل (Manzila) میں وہ نتیجہ پیدا کرتی ہے جو اس عمل کے علم کے مناسب نہیں ہوتا، مگر وہ اس عمل میں اس کی عبادت کے مناسب ہوتا ہے۔ پس یہ عمل کے لحاظ سے زیادتی (Ziyāda) ہے، اور اس میں عبادت کے لحاظ سے نتیجہ (Natīja) ہے۔ اور یہ ایسا مقام ہے جس کا ذائقہ چکھنے والا ہم نے اپنے علم میں اہل اللہ (Ahl Allāh) میں سے نہیں پایا، کیونکہ ان میں سے اکثر عبادت (Ibādah) اور عمل (Amal) میں فرق نہیں کرتے۔ اور ہر وہ عمل جس کی شارع (Shāri') کی طرف سے کوئی علت (Ta'līl) ظاہر نہ ہو، وہ تعبد (Ta'abbud) ہے۔ پس ہر غیر معلل عمل میں عبادت، معلل عمل کی نسبت زیادہ ظاہر ہوتی ہے۔ کیونکہ جب عمل کی علت بیان کی جاتی ہے تو بسا اوقات اس علت کی حکمت بندے کو اس کی طرف کھڑا کر دیتی ہے، اور جب اس کی علت بیان نہیں کی جاتی تو اسے اس عمل کی طرف صرف عبادتِ محضہ (Ibādah Maḥḍah) ہی کھڑا کرتی ہے۔\n\n### [عبادت (Ibādah) انسان کا ذاتی حال (Ḥāl Dhātī) ہے]\n\nاور جان لو کہ عبادت (العبادة) انسان کا ایک ذاتی حال (Ḥāl Dhātī) ہے، اور یہ درست نہیں کہ اس کا کوئی مخلوق اجر (Ajr Makhlūq) ہو، کیونکہ یہ اصلاً مخلوق نہیں ہے۔ پس اللہ کے سوا ہر شے کے اعیان (A'yān) مخلوق، موجود اور حادث (Ḥādith) ہیں، لیکن ان میں عبادت مخلوق نہیں ہے۔ کیونکہ یہ ان اعیان کے لیے ہے، یعنی عالم کے اعیان کے لیے ان کی عدم (Adam) کی حالت میں اور ان کے وجود (Wujūd) کی حالت میں۔ اور اسی کے ذریعے ان کے لیے اللہ کے امرِ تکوین (Amr al-Takwīn) کو بغیر کسی سستی کے قبول کرنا درست ہوا۔ بلکہ اللہ تعالیٰ نے خبر دی کہ وہ اسے \"ہو جا\" (كُنْ) کہتا ہے تو وہ \"ہو جاتا ہے\" (فَيَكُونُ)۔ پس ممکن (Mumkin) کے لیے عبادت کا حکم اس کی عدم کی حالت میں اس کے وجود کی حالت سے زیادہ ممکن (Amkan) ہے۔ کیونکہ اس کے لیے وجود کی حالت میں، اور اس کی رائے کے پختہ ہونے، اپنے نفس کو دیکھنے اور اس کے استقلال (Istiqlāl) کی وجہ سے، کسی نہ کسی صورت میں سیادت (Siyādah) کا دعویٰ ضروری ہو جاتا ہے، خواہ وہ کچھ بھی ہو۔ پس اس کی عبادت کے حکم میں اس قدر کمی آ جاتی ہے جس قدر اس نے سیادت کا دعویٰ کیا۔ اسی لیے ہم نے کہا کہ ممکن کے لیے عبادت کا حکم اس کی عدم کی حالت میں اس کے وجود کی حالت سے زیادہ ممکن ہے۔ پس جسے یہ حال حاصل ہو جائے، شہود (الشہود) دنیا اور آخرت میں اس کا ساتھی بن جاتا ہے۔ اور اس کی صفت یہ ہے کہ جب یہ اس کا حال ہو تو وہ کسی چیز پر خوش نہیں ہوتا، نہ کسی چیز پر غمگین ہوتا ہے، نہ ہنستا ہے اور نہ روتا ہے، نہ کوئی وصف اسے مقید کرتا ہے اور نہ کوئی وجودی نعت (Na't Wujūdī) اسے ممتاز کرتی ہے۔ پس اس کا کوئی رسم (Rasm) ہے اور نہ کوئی وصف (Waṣf)۔\n\nابو یزید البسطامی رضی اللہ عنہ نے اس مقام کے بارے میں فرمایا: \"میں ایک زمانے تک ہنسا اور ایک زمانے تک رویا، اور آج میں نہ ہنستا ہوں اور نہ روتا ہوں۔\" اور اسی مقام کے بارے میں جب ان سے پوچھا گیا کہ آپ نے صبح کیسے کی؟ تو انہوں نے فرمایا: \"میری کوئی صبح ہے نہ شام۔ صبح اور شام تو اس کے لیے ہے جو صفت (Ṣifah) سے مقید ہو، اور میری کوئی صفت نہیں۔\" پس انہوں نے اپنے آپ کو اطلاق (Iṭlāq) سے متصف کیا، اور اطلاق صرف عبادت (Ibādah) میں ہی درست ہے، کیونکہ بندہ اس آقا کے ارادے سے مقید ہے جو اس میں اس کا مالک ہے۔ اور جس کے لیے اطلاق ہو، اس کا اجر (Ajr) نہ مقید ہوتا ہے اور نہ متعین، کیونکہ بندہ مزدور کی طرح نہیں ہوتا کہ اس کا کوئی اجر ہو۔ اور ہمارے شیخ ابو العباس العرینی، جو اندلس کے مغرب میں علیا سے تھے، اور وہ پہلے شیخ تھے جن کی میں نے خدمت کی اور ان سے فائدہ اٹھایا، ان کا اس باب، یعنی بابِ عبودیت (Bāb al-'Ubūdiyyah) میں راسخ قدم تھا۔ اور بندہ اس کا ساتھی اپنے معاملے میں ہوتا ہے، جیسا کہ ذات حق (الحق) اپنے معاملے میں ہے۔ پس اطلاق کا بدلہ اطلاق ہے۔\n\nجبرائیل علیہ السلام نے رسول اللہ صلی اللہ علیہ وسلم سے احسان (الإحسان) کے بارے میں پوچھا تو آپ نے فرمایا: \"یہ کہ تم اللہ کی عبادت ایسے کرو گویا تم اسے دیکھ رہے ہو۔\" اور آپ نے عمل (Amal) کا ذکر نہیں کیا بلکہ عبادت (Ibādah) کا ذکر کیا۔ اور اللہ تعالیٰ نے فرمایا: \"احسان (الإحسان) کا بدلہ احسان (الإحسان) کے سوا کیا ہے؟\" (هَلْ جَزَاءُ الْإِحْسَانِ إِلَّا الْإِحْسَانُ) (سورۃ الرحمن، ۵۵:۶۰) پس یہی ہمارا قول ہے کہ اطلاق (Iṭlāq) کا بدلہ اطلاق کے سوا کچھ نہیں۔ اور اجور (Ajūr) دس گنا سے سات سو گنا تک مقید ہیں، کیونکہ وہ متعین اعمال کے اجور ہیں جن کا زمانہ محدود ہے، لہٰذا ضروری ہے کہ ان کا اجر عدد کے ساتھ مقید ہو۔ اگرچہ وہ اندازے سے ہو، تب بھی وہ اللہ کے نزدیک عدد کے ساتھ مقید ہے۔ جیسے صبر کرنے والے کو اس کا اجر بغیر کسی متعین حساب کے پورا دیا جاتا ہے، جس کا علم ہمارے نزدیک ہے، لیکن اللہ کے نزدیک وہ ایک معلوم مقدار کے ساتھ مقید ہے۔ کیونکہ صبر تمام اعمال کو شامل ہے، اس لیے کہ یہ نفس کو مشروع اعمال پر روکنا ہے۔ اسی لیے اسے مقدار نے نہیں لیا، جبکہ اعمال کو مقداریں لیتی ہیں۔ پس جس قدر مکلف کو موت تک اعمال میں کھڑا کیا جاتا ہے، وہ اپنے نفس کو ان پر روکے رکھتا ہے، یہاں تک کہ اس کے لیے صبر کا حال (Ḥāl) اور صابر کا نام صحیح ہو جاتا ہے۔ پس اس کا اجر اس کے نزدیک ایک ہی جملے میں نامعلوم اور غیر مقدر ہوتا ہے، اگرچہ وہ اللہ کے نزدیک معلوم ہوتا ہے، جیسے بیع میں بغیر ناپ تول کے اندازے سے لین دین کرنا۔ اور صبر عبادت سے اس طرح مختلف ہے کہ عبادت اس کے لیے اس کی عدم (Adam) کی حالت میں اور عدمِ تکلیف (Adam al-Taklīf) کی حالت میں بھی ہے، جبکہ صبر اس کے لیے اس کی عدم کی حالت میں اور عدمِ تکلیف کی حالت میں نہیں ہوتا۔ پس عبادت دنیا اور آخرت میں اس کے ساتھ نہیں چھوڑتی۔\n\nپس جب اس کا مشہد (Mashhad) اس کی عبادت ہو اس کے عروج (Irtiqā') کی حالت میں، اور ذات حق (الحق) اس کی طرف نازل ہو جیسا کہ ذات حق (الحق) نے اپنے آپ کو نزول (Nuzūl) سے متصف کیا ہے، تو اجتماع (Ijtima') واقع ہوتا ہے، اور یہی منازلہ (Al-Munāzala) ہے۔ چونکہ بندہ اعمال میں سے کسی عمل والا ہوتا ہے، کیونکہ اس کے لیے کسی مشروع صالح عمل میں ہونا ضروری ہے، اور یہی وہ چیز ہے جس کے ذریعے وہ اوپر چڑھتا ہے، پس یہ اس کا براق (Burāq) ہے کیونکہ اسے اٹھایا جاتا ہے، تو اللہ کی طرف سے اس عمل کے لحاظ سے اس نیکی کے ساتھ اس کا استقبال کیا جاتا ہے جو اللہ نے اس کے لانے والے کے لیے مقرر کی ہے، اور وہ مقدر اور معلوم ہے۔ پھر ذات حق (الحق) اس مکلف کو دیکھتا ہے اور اسے اس حال میں پاتا ہے کہ وہ اپنے عمل میں ہے لیکن اسے اس عمل کا شہود (الشہود) حاصل نہیں ہے، کیونکہ وہ جانتا ہے کہ اللہ ہی اس کا عامل ہے نہ کہ وہ، اور وہ اس عمل کے خلق ہونے کا محل (Maḥall) ہے اور اس عمل کے وجود کے لیے آلہ (Ālah) کی مانند ہے۔ پس ذات حق (الحق) اس عمل کا استحقاق اس وعدے کے لحاظ سے عطا کرتا ہے جو اس میں کیا گیا ہے، اور وہ اس شخص کے مشہد (Mashhad) کو دیکھتا ہے تو اسے اس کی عبادت (Ibādah) میں پاتا ہے جس پر وہ اپنی عدم (Adam) کی حالت میں بھی قائم تھا۔ پس اس کے مقابلے میں کوئی جزا (Jazā') نہیں ہے سوائے اس کے کہ اسے مکلفین میں غفلتوں کے خلق ہونے کے زمانے میں اس سے غفلت (Ghaflah) نصیب نہ ہو۔ بس یہی ہے، اور یہی وہ بات ہے جو ہم نے ممکن (Mumkin) کے وجود کی حالت میں کہی تھی کہ اس سے سیادت (Siyādah) کا کوئی حکم ضرور ظاہر ہوتا ہے، کیونکہ وہ غفلتوں کے حکم کے زمانے میں ہے۔ پس اس بندے کی اس منزل (Manzila) میں عنایت (Ināyah) یہ ہے کہ ہر حال میں عبادت سے غفلت کو اٹھا لیا جائے۔ پس یہی وہ زیادتی (الزیادة) ہے جو اللہ کے اس فرمان میں ہے: \"جن لوگوں نے نیکی کی ان کے لیے بھلائی (الحسنیٰ) ہے اور زیادہ (وزِیادَةٌ) بھی ہے۔\" (لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ) (سورۃ یونس، ۱۰:۲۶) ان لوگوں کے لیے جنہوں نے اعمال کے ذریعے احسان (Iḥsān) کیا، ان اجور کے ساتھ جو انہیں ملتے ہیں، بلکہ ان اجور کے ساتھ جو اعمال کے لیے ہیں، کیونکہ وہ بعینہٖ عامل کے لیے ہیں۔ اور زیادتی (Ziyāda) وہ ہے جو ہم نے صاحبِ عبادت (Ṣāḥib al-'Ibādah) کے حق میں ذکر کی، کہ اسے عمل کے وقت اس ذات سے غفلت نصیب نہیں ہوتی جو عامل ہے۔ پس وہ دیکھتا ہے کہ عامل اللہ ہے، اور عمل جو اجر طلب کرتا ہے وہ صرف عامل پر ہی لوٹتا ہے۔ پس اس کے نزدیک عامل اللہ ہے۔ پس اگر وہ اجور قبول کرنے والوں میں سے ہوتا تو اس کا اجر اس کے قدر کے مطابق ہوتا۔ پس مکلف جو اجور قبول کرنے والا آلہ (Ālah) ہے، اسے اس کا اجر حاصل ہوتا جو اللہ اگر مزدور کو قبول کرتا تو اس کا اجر کیسا ہوتا؟ کیا وہ اس کی قدر کے مطابق نہ ہوتا، اگرچہ عمل اسے مقید کر دے؟ پس اس شہود (الشہود) والے مکلف کا اجر اس شخص کے اجر سے کہاں ہے جو اپنے عمل میں یہ دیکھتا ہے کہ مکلف ہی عامل ہے نہ کہ ذات حق (الحق)؟ پس اس کا اجر اس مکلف کی قدر کے مطابق ہوتا ہے، اور اسے صرف عمل کا اجر ہی حاصل ہوتا ہے، مگر عامل کے اجر کی قدر کے مطابق، کیونکہ عامل اس کے نزدیک اس کا عین (Ayn) ہے اور اس کی کوئی قدر نہیں ہے۔ اور اگر اس کا ظہور اور اپنے رب کی اطاعت کے ساتھ متصف ہونا اس کے عمل میں نہ ہوتا تو اس کی اپنی طرف سے کوئی قدر نہ ہوتی۔ اسی لیے تم دیکھتے ہو کہ مخالف کا انجام کیا ہوتا ہے۔ اگر اس کی نفسِ امر (Nafs al-Amr) میں کوئی قدر ہوتی تو وہ اپنی قدر کے حکم سے سعادت مند ہوتا، لیکن وہ صرف اللہ کی رحمت سے سعادت مند ہوتا ہے۔ اور اگر ان کی کوئی قدر ہوتی جس کے ذریعے وہ سعادت کے مستحق ہوتے تو ان کی سعادت میں تفاوت نہ ہوتا۔ اور ہمیں کوئی شک نہیں کہ وہ سعادت میں متفاضل (Mutafāḍilūn) ہیں، جیسا کہ وہ اعمال میں متفاضل ہیں، حال، زمانہ، مکان، عینِ عمل، دوام، اجتماع اور انفراد وغیرہ کے لحاظ سے جن میں تفاوت واقع ہوتا ہے۔ پس ہم نے جان لیا کہ وہاں قدر کی کوئی جزا نہیں ہے۔ پس ہم نے جان لیا کہ انسان اپنی عین (Ayn) کے لحاظ سے کوئی قدر نہیں رکھتا، مگر اپنے رب کی اطاعت اور اپنے عمل کی قدر کے ساتھ۔ پھر ذات حق (الحق) اس نظر اور جزا کے تعین کے بعد، جیسا کہ ہم نے مقرر کیا، اس مکلف کے شہود (الشہود) کو دیکھتا ہے تو اسے عبادت والا پاتا ہے اور عمل اس میں اس کا تابع ہوتا ہے۔ اور وہ نہ اعمال سے اعراض (I'rāḍ) کرنے سے متصف ہوتا ہے اور نہ ان کی طرف اقبال (Iqbāl) کرنے سے، اور وہ اسی حال پر ہوتا ہے جس پر وہ اپنی عدم (Adam) کی حالت میں تھا۔ پس وہ اسے اس کے حال پر باقی رکھتا ہے اور غفلت (Ghaflah) کو اس سے حجاب میں رکھتا ہے، پس اس میں کسی بھی صورت میں اس کا کوئی اثر نہیں ہوتا۔ اور یہی عصمتِ عامہ (Al-'Iṣmah al-'Āmmah) ہے۔ پس اگر اس سے کوئی مخالفت واقع ہوتی ہے تو وہ صرف قضا و قدر (Qaḍā' wa Qadar) کے حکم سے واقع ہوتی ہے، ان کے اس میں تکوین (Takwīn) کے ذریعے، جیسا کہ اطاعت واقع ہوئی۔ پس اس کی عبادت کے حال میں کوئی کمی نہیں آتی، کیونکہ غفلت محجوب (Maḥjūb) ہے اور حضور (Ḥuḍūr) اس کے لیے دائمی ہے۔ پس جب اس سے جو کچھ واقع ہوتا ہے، وہ اللہ کی طرف سے ہے، اس واقعے کا اس محل میں عینِ تکوین (Ayn Takwīn) ہے۔ اس کا ظاہر شرعی خطاب کے حکم سے معصیت (Ma'ṣiyah) کی صورت ہے، اور وہ نفسِ امر (Nafs al-Amr) میں، یعنی وہ واقعہ، ایک موجود ہے جسے اللہ نے اس محل میں اپنی حمد کے ساتھ تسبیح کرنے والے موجودات میں سے پیدا کیا ہے۔ پس اس مخالفت کا اس میں کوئی اثر نہیں ہوتا، جیسا کہ اطاعت کا بھی اس میں کوئی اثر نہیں ہوتا۔ پس نفسِ حیوانیہ (Nafs al-Ḥaywāniyyah) اس عمل سے سعادت مند ہوتی ہے، خواہ وہ عمل ظاہر میں کچھ بھی ہو، جسے گناہ کی زبان یا خیر کی زبان جاری کرتی ہے، کیونکہ وہ نفسِ امر میں گناہ نہیں ہے۔ بلکہ اس کی حیوانی حرکت غیر مکلف کی حرکات کی طرح ہے جو نہ اطاعت سے متصف ہوتی ہے اور نہ معصیت سے۔ بلکہ یہ اس محل میں صورتوں کا ایجاد (Inshā') ہے جسے علماء الرسوم (Ulamā' al-Rusūm) دیکھتے ہیں جو ایک مؤمن، عاقل، بالغ سے ظاہر ہوئی ہیں، پس وہ اس پر شرعی حکم کے مطابق فیصلہ کرتے ہیں کہ وہ اطاعت ہے یا معصیت۔ ان پر اس کے سوا کچھ لازم نہیں، جب تک کہ اس میں احتمال (Iḥtimāl) داخل نہ ہو۔ اور اگر اس میں احتمال داخل ہو جائے تو ان کے لیے یہ جائز نہیں کہ وہ گناہ کی زبان کے پہلو کو دوسرے پر ترجیح دیں۔ جیسے ایک شخص جسے تم کسی شہر میں صحیح و سالم حالت میں رمضان میں دن کے وقت کھاتے ہوئے دیکھو، اور تم اسے مؤمن بھی جانتے ہو، تو اس میں یہ احتمال داخل ہو جاتا ہے کہ اسے کوئی ایسی بیماری ہو جسے تم نہیں جانتے، یا وہ سفر کی حالت میں ہو اور تم یہ نہیں جانتے۔ پس اس احتمال کے ساتھ تمہارے لیے اس پر انکار کرنے میں پہل کرنا جائز نہیں، اور نہ ہی تم پر اس کے بارے میں پوچھنا لازم ہے۔ بلکہ تمہارا اپنے نفس کے ساتھ مشغول رہنا تمہارے لیے زیادہ بہتر ہے۔\n\nاور جہاں تک اس باب میں نبی اکرم صلی اللہ علیہ وسلم کے اس فرمان کا تعلق ہے کہ: \"بے شک جنت میں وہ کچھ ہے جسے نہ کسی آنکھ نے دیکھا، نہ کسی کان نے سنا، اور نہ کسی بشر کے دل پر اس کا خیال گزرا۔\"\n\n### [جنت (Jannah) کے نام رکھنے کی وجہ]\n\nپس جان لو کہ جنت (الجنة) کا نام جنت نہیں رکھا گیا مگر اس وجہ سے جو ہم ذکر کریں گے۔ اور اسی طرح فرشتوں کا نام جنۃ (Jinnah) اور جن (Jinn) کا نام بھی۔ یہ سب استتار (Istītār - پوشیدگی) کی طرف لوٹتے ہیں۔ اور استتار ایک ہی انداز پر نہیں ہے بلکہ اس کا حکم مختلف ہے۔ اور وہ یہ ہے کہ اس نوع میں سے یہ ہے کہ ذات حق (الحق) قیامت میں تجلی (التجلی) فرمائے گا اور کہے گا: \"میں تمہارا رب ہوں،\" اور وہ اسے دیکھیں گے، اس کے باوجود وہ اس کا انکار کریں گے اور یہ تصدیق نہیں کریں گے کہ وہ ان کا رب ہے، حالانکہ حجاب (Ḥijāb) اٹھ جانے کے باوجود رؤیت (Rū'yah) موجود ہے۔ پھر جب وہ اس علامت میں ان کے لیے تبدیل ہو گا جسے وہ پہچانتے ہیں، تو وہ کہیں گے: \"تو ہمارا رب ہے،\" حالانکہ وہ وہی تھا جس کا انہوں نے انکار کیا اور جس سے پناہ مانگی، اور وہی تھا جس کا انہوں نے اقرار کیا اور اعتراف کیا۔ پس یہ کون سا حجاب ہے جو انہیں شہود (الشہود) کے باوجود حاصل ہوا؟ کیا یہ کوئی وجودی امر (Amr Wujūdī) ہے یا عدمی حکم (Ḥukm 'Adamī)؟ پس وہ مشہود (Mashhūd) ہے جو محجوب (Maḥjūb) ہے، اور نہ کوئی وجودی حجاب ہے اور نہ موجود میں عدم کا کوئی حکم ہے۔ پس دیکھو یہ کتنا مخفی ہے۔ اور دنیا میں عالم میں اس کے سوا کوئی واقعہ نہیں ہے، تمام امور میں، اور لوگ اس سے غفلت میں ہیں۔ جیسا کہ ہم ایمان رکھتے ہیں کہ فرشتہ ہمارے ساتھ ہے اور شیطان ہمارے ساتھ ہے، اور محسوس حجابات ہمارے پاس موجود نہیں ہیں، اور ہماری آنکھیں دیکھ رہی ہیں، اس کے باوجود ہم نہ فرشتے کو پاتے ہیں اور نہ جن کو، حالانکہ وہ اور اس کا قبیلہ ہمیں وہاں سے دیکھتا ہے جہاں سے ہم اسے نہیں دیکھتے۔ پس وہ اور اس کا قبیلہ ہمیں عینی شہود (Shuhūd 'Aynī) کے ساتھ دیکھتے ہیں اور ہم انہیں ایمان کے ساتھ دیکھتے ہیں نہ کہ عین کے ساتھ۔ پس یہ کون سا پردہ ہے جو ہمارے درمیان ہے؟ کیونکہ اگر یہ ہمارے درمیان ہوتا تو وہ انہیں ہم سے حجاب میں رکھتا جیسا کہ وہ ہمیں ان سے حجاب میں رکھتا ہے۔ پس اس میں کسی حکمت کا تعین ضروری ہے۔ اور اسی طرح وہ حجابات جن کا اللہ نے اپنے بارے میں ذکر کیا ہے جو ہمارے اور اس کے درمیان ہیں، نور (Nūr) اور ظلمت (Ẓulmah) کے۔ پس ظلمت سے تنزیہ (Tanzīh) واقع ہوا، تو ہم نے اس سے محدثات (Muḥdathāt) کی صفات کی نفی کی، پس ہم نے اسے نہیں دیکھا۔ پس ہم نے اس نظر سے اپنی آنکھوں پر حجابات ڈال لیے۔ اور نور (Nūr) اس کے ہمارے لیے ظاہر ہونے کی طرح ہے، یہاں تک کہ ہم اس کا شہود (الشہود) کرتے ہیں اور انکار کرتے ہیں کہ وہ وہی ہے، جیسا کہ ہم نے قیامت میں تجلی (التجلی) کے بارے میں پہلے بیان کیا۔ اور یہ عارفین (Al-'Ārifīn) کے نزدیک آج دنیا میں اسی حکم پر ہے۔ پس عارفین اسے ممکناتِ محدثاتِ وجود (Mumkināt Muḥdathāt al-Wujūd) کی صورتوں میں دیکھتے ہیں، اور علماء الرسوم (Ulamā' al-Rusūm) میں سے محجوب (Maḥjūbūn) لوگ اس کا انکار کرتے ہیں۔ اسی لیے یہ ان عارفین کے حق میں ظاہر (Ẓāhir) کہلاتا ہے اور ان محجوب لوگوں کے حق میں باطن (Bāṭin)۔ اور وہ سبحانہ و تعالیٰ کے سوا کوئی نہیں ہے۔ پس اہل اللہ (Ahl Allāh) جو اس کے اہل ہیں، وہ دنیا اور آخرت میں ہمیشہ دائمی عینی مشاہدہ (Mushāhadah 'Aynī) میں رہے ہیں اور رہیں گے، اگرچہ صورتوں میں اختلاف ہو، تو یہ ان کے نزدیک کوئی نقص پیدا نہیں کرتا۔\n\nاگر کوئی کہنے والا کہے کہ موسیٰ (علیہ السلام) اس صفت کے ولی (Walī) سے زیادہ حقدار تھے، اور انہوں نے رؤیت (Rū'yah) کا سوال کیا تھا؟ تو ہم کہیں گے کہ اگر تم مؤمن ہو، اگرچہ اہل کشف (أهل الکشف) میں سے نہیں ہو، تو تمہارے نزدیک یہ ثابت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے خبر دی ہے کہ اللہ ایک صورت میں تجلی (التجلی) فرماتا ہے اور دوسری صورت میں تبدیل ہو جاتا ہے، اور اسے پہچانا بھی جاتا ہے اور اس کا انکار بھی کیا جاتا ہے۔ اگر تم مؤمن ہو تو اس میں شک نہیں کرو گے۔ اور یہ بھی بیان کیا گیا ہے کہ صورتوں میں تجلی (التجلی) متجلی لہ (جس پر تجلی ہو) کی قدر کے مطابق ہوتی ہے۔ جب تم یہ جان لو گے تو تم جان لو گے کہ موسیٰ (علیہ السلام) نے ذات حق (الحق) کو اس صورت میں دیکھا جو اولیاء (Awliyā') کے لیے متجلی ہوتی ہے، کیونکہ وہ جانتے تھے کہ وہ اولیاء کے لیے مختلف صورتوں میں تجلی فرماتا ہے۔ کیونکہ موسیٰ اللہ کے ولی تھے اور وہ یہ جانتے تھے۔ اور ایسی بات مخفی نہیں رہتی۔ انہوں نے تو صرف اس صورت میں تجلی کا سوال کیا تھا جسے صرف انبیاء ہی ادراک کر سکتے ہیں، اور انبیاء میں سے بعض کو اللہ نے ایسے مقام سے خاص کیا جو کسی اور کو حاصل نہیں ہوا، جیسے موسیٰ علیہ السلام کے لیے واسطوں کے بغیر کلام (Kalām)۔ پس موسیٰ علیہ السلام نے اپنے رب سے اس صورت میں دیکھنے کا مطالبہ کیا جو ان کے مقام کا تقاضا تھا۔ اور جہاں تک ان کا اس صورت میں دیکھنا ہے جو اولیاء دیکھتے ہیں، تو یہ ان کی خبر اور عادت تھی۔ اور تمہیں اعتراض کے طور پر ایسی بات کہنے پر صرف اسی چیز نے آمادہ کیا کہ تم عارف ولی (Walī 'Ārif) نہیں ہو، کیونکہ اگر تم عارفین میں سے ہوتے تو تم اس کا شہود (الشہود) کرتے اور تمہارے سوال کے جواب میں جو علم ہم نے بیان کیا ہے وہ تم سے غائب نہ ہوتا۔ پس آپ صلی اللہ علیہ وسلم کا یہ فرمان صحیح ہے کہ \"جنت میں وہ کچھ ہے جسے نہ کسی آنکھ نے دیکھا،\" یعنی اعتبار کے لحاظ سے پردے (Al-Sitr) میں، نہ کہ تفسیر کے لحاظ سے۔ کیونکہ اگر اسے کسی آنکھ نے دیکھا ہوتا تو وہ مستور (Mastūr) نہ ہوتا۔ اور اگر اسے دیکھا ہوتا تو وہ اس کے بارے میں بولتی اور وہ مسموع (Masmu') ہوتا۔ اور اگر وہ مسموع ہوتا تو محدود (Maḥdūd) ہوتا۔ اور اگر وہ محدود ہوتا تو تم اسے دل میں لاتے، پس وہ معلوم ہوتا۔ پس یہ ایک ایسا امر ہے جس سے ہمیں ایک ایسے حجاب (Ḥijāb) کے ذریعے حجاب میں رکھا گیا ہے جو جانا نہیں جاتا۔ کیونکہ وہ اس پردے میں ہے جسے جنت (الجنة) سے تعبیر کیا گیا ہے۔ پس جب اس کا عین (Ayn) ہی عینِ پردہ ہے، تو ہمیں حجاب میں نہیں رکھا گیا مگر یہ کہ ہم نے جو کچھ دیکھا اسے پردہ بنا لیا، پس ہمت (Himmah) اس چیز سے متعلق ہو گئی جو پردے کے پیچھے ہے، اور وہ مستور (Mastūr) ہے۔ پس ہم پر ہماری طرف سے ہی آفت آئی۔ اور ہم نے اس میں صرف تنزیہ (Tanzīh) کو ہی رکھا۔ اور اسی لیے انبیاء علیہم السلام تنزیہ کے ساتھ تشبیہ (Tashbīh) کی نعتیں لے کر آئے تاکہ لوگوں کے لیے معاملہ قریب ہو جائے اور اللہ کے قریب ترین لوگوں کو تنبیہ ہو جو قرب کے عین میں ہیں، اس حجاب کے ساتھ جو اس پر امر ہے۔ پس اس تشبیہ کے ذریعے تنبیہ میں بصارت سے پردے اٹھانا ہوتا ہے، تو بصارت تیز ہو جاتی ہے، جیسا کہ محتضر (مرنے والے) کی بصارت تیز ہو جاتی ہے۔ اللہ تعالیٰ نے فرمایا: \"پس ہم نے تجھ سے تیرا پردہ ہٹا دیا، تو آج تیری نگاہ تیز ہے۔\" (فَكَشَفْنَا عَنْكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ) (سورۃ ق، ۵۰:۲۲) پس محتضر وہ دیکھتا ہے جو اس کے پاس بیٹھے ہوئے لوگ نہیں دیکھتے، اور وہ اپنے پاس بیٹھے ہوئے لوگوں کو اس چیز کے بارے میں بتاتا ہے جسے وہ دیکھتا اور ادراک کرتا ہے، اور سچائی کے ساتھ خبر دیتا ہے، جبکہ حاضرین کچھ نہیں دیکھتے، جیسا کہ وہ فرشتوں اور روحانیوں کو نہیں دیکھتے جو اس کے ساتھ ایک ہی مجلس میں ہیں۔ اور اللہ نے ہمیں خبر دی ہے کہ فرشتے ذکر کی مجالس میں حاضر ہوتے ہیں، اور وہ ان مجالس کی تلاش میں سیاحت کرنے والے ہیں۔ پس جب وہ ذکر کی مجلس دیکھتے ہیں تو ایک دوسرے کو پکارتے ہیں: \"آؤ اپنی مطلوبہ چیز کی طرف۔\" اور اس مجلس کے اہل میں سے کوئی بشر انہیں ادراک نہیں کرتا مگر وہ جس کی آنکھ سے اللہ نے پردہ اٹھا دیا ہو، اور وہ اہل کشف (أهل الکشف) ہیں۔ کیا تم نے نبی اکرم صلی اللہ علیہ وسلم کا یہ فرمان نہیں سنا: \"جو لوگ جنازوں کے پیچھے سوار ہو کر چلتے ہیں، کیا تمہیں شرم نہیں آتی کہ فرشتے جنازے میں اپنے قدموں پر چلتے ہیں اور تم سوار ہوتے ہو؟\" پس مؤمن کو چاہیے کہ وہ مقامات کے ساتھ ویسا ہی معاملہ کرے جیسا صاحبِ عیان (Ṣāḥib al-'Iyān - مشاہدہ کرنے والا) کرتا ہے، ورنہ وہ حقیقی مؤمن نہیں ہے۔ کیونکہ ہر حق کی ایک حقیقت (Ḥaqīqah) ہوتی ہے، اور ہر حق کی حقیقت اس کے سوا کچھ نہیں کہ اسے مشہود (Mashhūd) اور بصارت سے مدرک (Mudrak) کی منزل پر اتارا جائے۔ اور یہ بات رسول اللہ صلی اللہ علیہ وسلم نے اس شخص سے کہی جسے آپ نے سنا کہ وہ کہہ رہا تھا: \"میں حقیقی مؤمن ہوں۔\" تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: \"بے شک ہر حق کی ایک حقیقت ہوتی ہے، پس تمہارے ایمان کی حقیقت کیا ہے؟\" تو اس شخص نے کہا: \"گویا میں اپنے رب کے عرش کو ظاہر (Bāriz) دیکھ رہا ہوں، یعنی قیامت کے دن۔\" تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: \"تم نے پہچان لیا، پس اس پر قائم رہو۔\"\n\nپس اس نے حقیقت (Ḥaqīqah) کی تفسیر نظر اور رؤیت (Rū'yah) سے کی اور اسے \"گویا\" (Ka'anna) کے ساتھ رکھا، کیونکہ قیامت کا دن حسی طور پر واقع نہیں ہوا، لیکن اس کے حق میں تمثیل (Tamthīl) کے طور پر واقع ہوا، پس اس نے اسے تمثیل میں ایسے ادراک کیا جیسے وہ حس (Ḥiss) میں واقع ہو۔ جیسے اس عابد (Ābid) کے لیے کہا گیا: \"اللہ کی عبادت ایسے کرو گویا تم اسے دیکھ رہے ہو۔\" یہ ظاہر عرش (Al-'Arsh al-Bāriz) کی طرح نہیں ہے، کیونکہ اللہ یہاں نفسِ امر (Nafs al-Amr) میں نمازی کے قبلہ میں یا کسی بھی عمل میں عابد کے لیے موجود ہے۔ اور عرش کا ظاہر ہونا ایسا نہیں ہے۔ پس لوگوں میں سے کچھ وہ ہیں جو اللہ کی عبادت ایسے کرتے ہیں گویا وہ اسے دیکھ رہے ہیں، اس حجاب (Ḥijāb) کی وجہ سے جس نے انہیں اسے دیکھنے سے روکا ہے۔ اور کچھ لوگ وہ ہیں جو اس کی عبادت رؤیت (Rū'yah) اور مشاہدہ (Mushāhadah) پر کرتے ہیں۔ اور جو دیکھتا ہے اور جو نہیں دیکھتا، ان کے درمیان صرف یہ فرق ہے کہ جو نہیں دیکھتا وہ اسے نہیں پہچانتا، حالانکہ وہ عزوجل اس کے لیے مشہود (Mashhūd) ہے۔ اور عارف (Al-'Ārif) اسے پہچانتا ہے، لیکن ایسی معرفت (المعرفۃ) بیان نہیں کرنی چاہیے کیونکہ وہ قبول نہیں کی جاتی۔ پس جب انسان اپنے نفس سے اس کا شہود (الشہود) کر لیتا ہے تو اس کے لیے یہ ممکن نہیں رہتا کہ وہ اسے نہ جانے۔ پس وہ اس وقت ان لوگوں میں سے ہو جاتا ہے جو اپنی عبادت میں اللہ کو دیکھتے ہیں اور ان سے \"گویا تم اسے دیکھ رہے ہو\" کا حکم زائل ہو جاتا ہے۔ پس یہ جان لو۔\n\nاور جہاں تک اللہ تعالیٰ کے اس فرمان کا تعلق ہے: \"پس کوئی جان نہیں جانتی جو کچھ ان کے لیے چھپا کر رکھا گیا ہے،\" (فَلَا تَعْلَمُ نَفْسٌ مَّا أُخْفِيَ لَهُمْ) یعنی ان لوگوں کے لیے جن کا وصف پہلے بیان ہو چکا ہے، \"بدلہ اس کا جو وہ کرتے تھے۔\" (جَزَاءً بِمَا كَانُوا يَعْمَلُونَ) (سورۃ السجدہ، ۳۲:۱۷) پس یہاں ان کی جزا (Jazā') اس کے سوا کچھ نہیں کہ وہ چیز اس نفس سے چھپا دی جائے جو نہیں جانتا۔ پس ان لوگوں کے حال اور اللہ کے نزدیک ان کے مقام کا ان نفوس سے چھپایا جانا جو نہیں جانتے، ان کے لیے جزا ہے۔ یعنی ان کی جزا یہ ہے کہ اللہ کے نزدیک ان کا مقام نامعلوم رہے، پس کوئی نفس ان کی قدر نہ کر سکے، جیسا کہ ذات حق (الحق) نے اپنے بارے میں فرمایا: \"اور انہوں نے اللہ کی قدر نہ کی جیسا کہ اس کی قدر کرنے کا حق تھا۔\" (وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ) (سورۃ الانعام، ۶:۹۱) پس اس نے اپنی صفت کو اپنی مخلوق میں انہیں عطا کر دیا۔ پس کسی نفس نے نہیں جانا کہ ان کے لیے آنکھوں کی ٹھنڈک کے طور پر کیا چھپا کر رکھا گیا ہے، جس سے ان کی آنکھیں ٹھنڈی ہوں۔ اور اسی طرح نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"اور میری آنکھوں کی ٹھنڈک نماز میں رکھی گئی ہے۔\" اور آپ نے تمام ادراکات (Idrākāt) کے بجائے صرف آنکھوں کا ذکر کیا، کیونکہ ہر کلام، الٰہی ہو یا غیر الٰہی، ضروری ہے کہ اس کا عین (Ayn) کسی موجود عین سے ہو۔ اور وہاں صرف کلام ہے، پس وہاں صرف اعیان (A'yān) ہیں جو وجود میں آتے ہیں۔ اور رؤیت (Rū'yah) کا تعلق مرئی (دیکھی جانے والی چیز) کے عین کے ادراک سے ہے اور مرئی کے رؤیت کے لیے استعداد (Isti'dād) سے ہے، خواہ وہ معدوم ہو یا موجود۔ پس جب وہ اسے دیکھتا ہے تو اس کی آنکھ اس چیز سے ٹھنڈی ہوتی ہے جسے اس نے دیکھا، کیونکہ کوئی دوسرا اسے نہیں دیکھتا۔ اور اسی لیے موسیٰ (علیہ السلام) نے رؤیت کا سوال کیا تاکہ ان کی آنکھ اس چیز سے ٹھنڈی ہو جسے وہ دیکھیں۔ پس رسول اللہ صلی اللہ علیہ وسلم اپنی نماز کی حالت میں رؤیت اور شہود (الشہود) والے تھے، اور اسی لیے نماز آپ کی آنکھوں کی ٹھنڈک کا محل تھی، کیونکہ آپ مناجات کرنے والے تھے۔ اور اعیان (A'yān)، جیسا کہ ہم نے کہا، کلام سے وجود میں آتے ہیں۔ پس وہ اور ذات حق (الحق) صورتوں کے دوران ہوتے ہیں جب تک وہ اپنی نماز میں مناجات کر رہے ہوتے ہیں، پس وہ دیکھتے ہیں جو ان کی تلاوت سے وجود میں آتا ہے اور جو اللہ کے قول سے اس کے مقابلے میں وجود میں آتا ہے جو انہوں نے کلام کیا، جیسا کہ اس خبر میں وارد ہے جس میں بندے کے قول سے نماز کی تقسیم ہے، تو اللہ فرماتا ہے۔\n\nاور جہاں تک اس باب میں اللہ تعالیٰ کے اس فرمان کا تعلق ہے: \"اور اس کی تاویل (تأویل) کو اللہ کے سوا کوئی نہیں جانتا،\" (وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ) (سورۃ آل عمران، ۳:۷) تو شے کا مال (Māl - انجام) صحیح نہیں ہے کہ وہ واقع ہو کر دیکھا جائے، مگر یہ کہ دیکھنے والے کے لیے اس کی تمثیل (Tamthīl) کی جائے، پس گویا وہ اسے دیکھتا ہے۔ کیونکہ مال (انجام) حال (Ḥāl - موجودہ حالت) کے مقابل ہے۔ پس حال موجود ہے اور مال موجود نہیں ہے، اسی لیے اسے مال (انجام) کہا گیا۔ اور تاویل (التأویل) وہ ہے جس کی طرف اس متشابہ (Mutashābih) کا حکم لوٹتا ہے۔ پس وہ اس شخص کے نزدیک محکم (Muḥkam) ہے جو اس کی تاویل جانتا ہے، اور وہ صرف اللہ ہے۔ اور علم میں راسخ (Rāsikh) لوگ کہتے ہیں: \"ہم اس پر ایمان لائے، سب ہمارے رب کی طرف سے ہے۔\" (آمَنَّا بِهِ كُلٌّ مِّنْ عِندِ رَبِّنَا) (سورۃ آل عمران، ۳:۷) یعنی اس کا متشابہ اور اس کا محکم۔ پس جب اللہ اسے اس کا مال (انجام) دکھا دیتا ہے تو وہ اس کے نزدیک محکم ہو جاتا ہے، اور اس عالم کے حق میں اس سے تشابہ (Tashābuḥ) زائل ہو جاتا ہے۔ پس وہ اس کے نزدیک اسی طرح ہوتا ہے جیسا کہ اللہ کے نزدیک اس پہلو سے ہے۔ اور وہ اس کے نزدیک بھی متشابہ رہتا ہے، کیونکہ وہ دونوں اطراف کے لیے صلاحیت رکھتا ہے بغیر کسی تخصیص کے، جیسا کہ وہ نفسِ امر (Nafs al-Amr) میں اصطلاحی وضع کے حکم سے ہے۔ پس اگرچہ وہ اس کی تاویل جانتا ہے، لیکن اس کا حکم متشابہ ہونے سے زائل نہیں ہوتا، کیونکہ دوسرا پہلو اسے اس چیز کے ذریعے طلب کرتا ہے جو اس پر دلالت کرتی ہے اور اسے شامل ہوتی ہے، جیسا کہ اس پہلو نے طلب کیا جس کا علم اللہ نے اس شخص کو دیا۔ پس اللہ کا حقیقی علم اس کے ساتھ یہ ہے کہ وہ اس کی تاویل کو جانتا ہے، یعنی جو دونوں جانبوں سے ہر ایک کے حق میں لوٹتا ہے، یا جوانب (Jawanib) اگر وہ زیادہ ہوں، تو وہ اسے متشابہ جانتا ہے، کیونکہ وہ ایسا ہی ہے۔ کیونکہ ہر جانب اسے اپنے حصے اور اس سے اپنی دلالت کے ساتھ طلب کرتی ہے۔ پس محکم (Muḥkam) محکم ہے جو زائل نہیں ہوتا، اور متشابہ (Mutashābih) متشابہ ہے جو زائل نہیں ہوتا۔ اور ہم نے یہ اس لیے کہا تاکہ یہ خیال نہ کیا جائے کہ عالم کا اس علم کے ساتھ کہ وہ لفظ ہر اس شخص کے حق میں کس طرف لوٹتا ہے جس کے لیے اس میں کوئی حکم ہے، اسے متشابہ ہونے سے خارج کر دیتا ہے۔ معاملہ ایسا نہیں ہے، بلکہ وہ اپنی اصل پر متشابہ ہے، اس علم کے ساتھ کہ وہ ہر اس شخص کے حق میں کس طرف لوٹتا ہے جس کا اس میں حصہ ہے۔ پس یہ احاطہ (Iḥāṭah) نامعلوم ہے اور صرف اسی منزل (Manzila) میں معلوم ہوتی ہے۔ پس اس متشابہ سے ہر حق والے کو اس کا حق دیا جاتا ہے، جیسا کہ اللہ نے \"ہر چیز کو اس کی خلقت (خَلْقَهُ) عطا کی\" (سورۃ طٰہٰ، ۲۰:۵۰) مشابہت اور اشتراک کے لحاظ سے۔ اور جہاں تک غیب کی کنجیوں (مفاتح الغیب) کا تعلق ہے، تو \"انہیں اس کے سوا کوئی نہیں جانتا۔\" (لَا يَعْلَمُهَا إِلَّا هُوَ) (سورۃ الانعام، ۶:۵۹) اور یہ اسی باب میں سے ہے۔ پس وہ اللہ کے بتانے کے بغیر معلوم نہیں ہوتیں، اور اگر وہ معلوم بھی ہو جائیں تو یہ معلوم نہیں ہوتا کہ وہ غیب کی کنجیاں ہیں۔ پس اس پر غور کرو۔\n\n### [قبول کرنے والوں (Al-Qawābil) کی استعدادیں (Al-Isti'dādāt) ہی غیب کی کنجیاں (مفاتح الغیب) ہیں]\n\nاور جان لو کہ ہمیں اطلاع (I'lām) نے یہ ظاہر کیا ہے کہ قبول کرنے والوں (القوابل) کی استعدادیں (الاستعدادات) ہی غیب کی کنجیاں (مفاتح الغیب) ہیں، کیونکہ وہاں صرف مطلق عام وہب (Wahb) اور جود (Jūd) کا فیض (Fayḍ) ہے۔ نفسِ امر (Nafs al-Amr) میں نہ کوئی غیب ہے اور نہ کوئی شہود (الشہود)، بلکہ لامتناہی معلومات (Ma'lūmāt) ہیں۔ ان میں سے کچھ وجود (Wujūd) رکھتی ہیں اور کچھ وجود نہیں رکھتیں، ان میں سے کچھ سببیت (Sababiyyah) رکھتی ہیں اور کچھ سببیت نہیں رکھتیں، اور ان میں سے کچھ وجود کو قبول کرنے کی صلاحیت رکھتی ہیں اور کچھ نہیں رکھتیں۔ پس وہاں کنجی (Miftāḥ)، کھولنا (Fatḥ)، اور کھولی جانے والی چیز (Maftūḥ) ہے، جو اس کے کھلنے پر ظاہر ہوتی ہے جس سے یہ کھولی جانے والی چیز حجاب (Ḥijāb) میں تھی۔ پس کنجی تمہاری سیکھنے کی استعداد (Isti'dād) اور علم کو قبول کرنا ہے، اور کھولنا (الفتح) تعلیم (Ta'līm) ہے، اور کھولی جانے والی چیز (المفتوح) وہ دروازہ ہے جس کے ساتھ تم کھڑے تھے۔ پس اگر تم نہ رکو اور چلتے رہو تو تم ہر قدم پر وہ دیکھو گے جو تم نے نہیں دیکھا، پس تم وہ جانو گے جو تم نہیں جانتے تھے، اور اللہ کا فضل تم پر عظیم ہو گا۔ پس استعداد (Isti'dād) کسبی (Maktasab) نہیں ہے بلکہ ایک الٰہی عطیہ (Minḥah Ilāhiyyah) ہے۔ اسی لیے اسے اللہ کے سوا کوئی نہیں جانتا۔ پس وہ جانتا ہے کہ غیب کی کنجیاں (مفاتح الغیب) ہیں، لیکن وہ یہ نہیں جانتا کہ غیب کی ہر ایک فرد میں خاص غیب کی کنجی کیا ہے۔ پس جب اللہ تعالیٰ کی طرف سے استعداد (Isti'dād) حاصل ہو جاتی ہے تو کنجی حاصل ہو جاتی ہے، اور کھولنا (الفتح) باقی رہتا ہے یہاں تک کہ تعلیم (Ta'līm) واقع ہو، جیسا کہ فرمایا: \"رحمن (الرَّحْمَنُ) نے قرآن سکھایا (عَلَّمَ الْقُرْآنَ)، انسان کو پیدا کیا (خَلَقَ الْإِنْسَانَ)، اسے بیان سکھایا (عَلَّمَهُ الْبَيَانَ)۔\" (سورۃ الرحمن، ۵۵:۱-۴) پس تعلیم ہی عینِ فتح (Ayn al-Fatḥ) ہے۔ اور اسی باب میں یہ فرمان ہے: \"پس تم جدھر بھی رخ کرو گے، وہیں اللہ کا چہرہ (وَجْهُ اللَّهِ) ہے۔\" (فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ) (سورۃ البقرہ، ۲:۱۱۵) جیسے سواری پر نماز پڑھنا، تو استقبال (Istiqbāl) مقید نہیں ہوتا، پس وہ اس کے مطابق ہوتا ہے جس پر وہ چل رہی ہو۔ اسی طرح عارف (Al-'Ārif) نہیں جانتا کہ اس کا رب اسے اپنی مناجات (Munājāt) میں کہاں لے جائے گا، کیونکہ یہ اس کے مطابق ہوتا ہے جس کے ذریعے وہ اس سے مناجات کرتا ہے، اور اس کا کلام قرآن کی سورتیں ہیں۔ پس وہ جو سورت یا جو آیت چاہے بغیر کسی تعین کے پڑھتا ہے، کیونکہ شارع (Shāri') نے اسے کسی خاص سورت سے مقید نہیں کیا۔ پس وہ اس کے مطابق ہوتا ہے جو اس کے دل میں ڈالا جاتا ہے، اور یہ اللہ کی طرف ہے۔ پس جس طرح اسے اس چیز کا علم نہیں ہوتا جو وہ اس کے نفس میں ڈالتا ہے جس کے ذریعے وہ اس سے مناجات کرتا ہے، مگر جب وہ اسے ڈال دیتا ہے، اسی طرح وہ نہیں جانتا کہ ذات حق (الحق) اس کی مناجات میں اس کی منزل (Manzila) میں اسے کیا کہتا ہے۔ اور اسی باب میں یہ فرمان ہے: \"تو دوسرے دنوں میں گنتی پوری کرے۔\" (فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ) (سورۃ البقرہ، ۲:۱۸۴) اور اللہ کے وہ دن جنہیں بندہ عمرہ کے ساتھ پورا کرتا ہے، ان کی مقدار متعین نہیں کرتا، اور اسی لیے اس نے انہیں نکرہ (Nakra) رکھا۔ پس جو مکلف پر سفر میں لازم ہے وہ دوسرے دنوں کی گنتی ہے، اسے ان کے تعین کا اختیار ہے، لیکن وہ نہیں جانتا کہ ان میں سے کیا متعین کرے گا مگر اللہ کے اس کے نفس میں ڈالنے سے۔ اور روزے کی کوئی مثال نہیں ہے، پس وہ نہیں جانتا کہ حق کی طرف سے بے مثال صفات میں سے کس صفت میں اسے کھڑا کرے گا، اور وہ ہر وہ الٰہی صفت ہے جس کے ساتھ بندے کا متصف ہونا ممکن نہیں، اگرچہ وہ اسے جانتا ہو، جیسا کہ وہ جانتا ہے کہ ذات حق (الحق) اس کے مماثل نہیں ہے، اور وہ اس علم سے الٰہ نہیں بن جاتا، کیونکہ الوہیت (Al-Ulūhiyyah) اس کی صفت نہیں ہے۔ اور یہی نبی اکرم صلی اللہ علیہ وسلم کے اس فرمان کا معنی ہے جب آپ نے اپنے رب سے دعا کی: \"اے اللہ! میں تجھ سے تیرے ہر اس نام کے ذریعے سوال کرتا ہوں جو تو نے اپنا نام رکھا، یا اپنی مخلوق میں سے کسی کو سکھایا، یا اپنے علمِ غیب (Ilm al-Ghayb) میں اپنے پاس محفوظ رکھا۔\" پس اس میں ہر وہ نام داخل ہو گیا جس کے ساتھ متصف ہونا ممکن ہے اور ہر وہ نام بھی جس کے ساتھ متصف ہونا ممکن نہیں۔ پس جن اسماء کے ساتھ متصف ہونا ممکن نہیں، ان کی کوئی مثال نہیں ہے، پس وہ ہمارے روزے میں ہمارے لیے معلوم ہوتے ہیں، لیکن ہم میں قائم نہیں ہوتے کہ ہم ان سے متصف ہو سکیں۔ یہ ان دنوں میں عدمِ تعین کا فائدہ ہے جن میں ہم روزہ رکھتے ہیں جب ہم مسافر ہوں اور افطار کر لیں، تو ہم رمضان کے دنوں کی قضا کرتے ہیں یا اسے غیر متعین دنوں میں ادا کرتے ہیں۔ پس اس منزل (Manzila) کا مالک اپنے عروج (U'rūj) میں اللہ تعالیٰ کا قصد کرتا ہے، خالی دل، خالی نفس کے ساتھ، کسی متعین الٰہی نام کے قصد سے عاری ہو کر، اس حیثیت سے کہ تم بندے ہو اور وہ الٰہ ہے جو جو چاہتا ہے کرتا ہے۔ تمہارے دل میں کوئی ایسی چیز نہیں آتی جس کا تم اس سے مطالبہ کرو۔ بلکہ یہ ہے کہ تم اپنے عروج میں اس کے ساتھ اس کے مطابق رہو جو اس کی طرف سے ہو، اپنے اوقات کی حفاظت کے ساتھ اس تکلیف میں جو تم پر واقع ہوئی ہے، وقت کا حق ادا کرنے اور شرعی خطاب کی رعایت کرتے ہوئے، اس میں اپنے آپ سے غائب رہتے ہوئے، اس چیز میں اس کے متولی ہونے کے ساتھ جس میں تم ہو، اور تم اس کی تقدیروں کے جاری ہونے کا محل ہو، تحفظ اور ادب کو لازم رکھتے ہوئے کہ وہ تمہیں اس چیز کا محل نہ بنائے جس سے اس نے تمہیں منع کیا ہے۔ پس اگر تم اس اسلوب پر چلو گے تو ذات حق (الحق) کی طرف سے اس کی منزل (Manzila) میں تمہارے لیے وہ ظاہر ہو گا جو تمہارے دل میں کبھی نہیں آیا، بلکہ وہ جو بیان نہیں کیا جا سکتا اور نہ ہی عبارت (Ibārah) اسے سما سکتی ہے۔",
    "fa": "«باب سیصد و هشتاد و هشتم: در معرفت منزلت‌های (منازلة) مجهول»\n\nو این زمانی است که سالک بدون تعیین قصد آنچه از حق (الحق) قصد می‌کند، ارتقا یابد. و هر چیزی نزد حق (الحق) معین است؛ پس او چیزی را از حق قصد کرده که با قصد او از عدم تعیین (عدم التعيين) تناسب ندارد.\n\n> اگر جمع شویم، بر نقیض یکدیگریم *** و اگر به واسطه ما باشد، بر یکسانی خواهیم بود\n> و در حقیقت (التحقيق)، آنچه در هستی (الكون) است، عین حق است *** بدون شک و تردید، غیر او نیست\n> پس به منکران سخن صحیح من بگو *** شما از مشاهده‌ی «عماء» کور شده‌اید\n> و از نفسی که در آن خلقی است *** بسیار، که شکلش شکل آینه‌هاست\n> پس صورت بیننده را به سوی خود برمی‌گرداند *** به حکم ثابتی که در هر بیننده‌ای جاری است.\n\n[زیادت (الزيادة) عبارت است از آنچه به خاطر خطور نکرده است]\n\nخداوند متعال می‌فرماید: **لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ** (برای کسانی که نیکی کردند، نیکی و افزونی است). پس برای امر معین، امری معین را تعیین کرد و افزونی را برای غیر معین افزود. از برخی مشایخمان درباره زیادت (الزيادة) پرسیدم، گفت: «آنچه به خاطر خطور نکرده است.» و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «همانا در بهشت چیزی است که نه چشمی آن را دیده، نه گوشی آن را شنیده و نه بر قلب بشری خطور کرده است.»\n\nپس ناگزیر است که آن [زیادت] برای بشر نامعلوم باشد و ناگزیر است که در بشر صفتی نامعلوم و نامعین وجود داشته باشد که از آن، این امر که ذکر شد و بر قلب بشری خطور نکرده، برای او حاصل شود؛ این موازنه‌ای است میان مجهول و مجهول. و خداوند متعال فرمود: **فَلا تَعْلَمُ نَفْسٌ** (پس هیچ نفسی نمی‌داند)؛ پس [علم را] نکره آورد و علم را نفی کرد، **ما أُخْفِيَ لَهُمْ من قُرَّةِ أَعْيُنٍ** (آنچه از روشنی چشم‌ها برایشان پنهان شده است). پس ما به طور اجمالی دانستیم که آن امری دیدنی (مشاهد) است، زیرا آن را به چشم‌ها پیوند داد و به گوش یا هیچ یک از ادراکات دیگر پیوند نداد. و به همین دلیل دانستیم که\n\nسخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) که فرمود: «روشنی چشم من در نماز قرار داده شده است»، این است که ایشان مناجات را اراده نکرده، بلکه شهود (الشهود) کسی را که با او مناجات می‌کند، اراده کرده است. و به همین دلیل به ما خبر داد که خداوند در قبله نمازگزار است و فرمود: «خدا را چنان عبادت کن که گویی او را می‌بینی.» همانا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در عبادت خود او را می‌دید، نه اینکه «گویی او را می‌دید». و از اهل حق (أهل الله) کسانی هستند که این رتبه را دارند و اگر این رتبه حاصل نمی‌شد، آن را به عبادت پیوند نمی‌داد، نه به عمل. پس نفرمود: «برای خدا چنان عمل کن که گویی او را می‌بینی.» زیرا عبادت (العبادة) بدون شهود (الشهود) صریح یا تخیل شهود (الشهود) صحیح، درست نیست.\nو در این باب، سخن خداوند متعال است: **وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله** (و تأویل آن را جز خدا نمی‌داند). و در آن، علم مفاتح الغیب (کلیدهای غیب) است: **لا يَعْلَمُها إِلَّا هُوَ** (آن‌ها را جز او نمی‌داند). و هر آنچه علمش موقوف به خداست، دانسته نمی‌شود مگر با اعلام خدا یا با به شهود رساندن او. و از این باب است سخن خداوند متعال: **فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله** (پس به هر سو رو کنید، آنجا وجه خداست). و از این باب است: **فَعِدَّةٌ من أَيَّامٍ أُخَرَ** (پس تعدادی از روزهای دیگر) بدون تعیین روزهای مشخص.\nاما صورت این منزلت (المنازلة) از جانب بنده، همان است که ابویزید [بسطامی] در مورد «نشستن با خدا بلا حال و نعت» گفت. و آن این است که بنده در قصد خود بر آن چیزی باشد که خدا می‌داند، و چیزی را بر خدا تعیین نکند. زیرا هر کس در قصد خود چیزی را بر خدا تعیین کند، در ظاهر با کسی که خدا را بر یک حرف (بر لبه) عبادت می‌کند، تفاوتی ندارد.\nپس صاحب این منزلت (المنازلة) پروردگارش را با تعیین اوقات عبادت می‌کند، نه با تعیین خود او. پس او در حکم وقت خویش است و وقت از جانب خداست، نه از جانب او. پس نمی‌داند که وقتش با چه چیزی او را غافلگیر خواهد کرد. نهایت امر او این است که مهیای وارد مجهول الهی باشد که او را در هر عبادتی که بخواهد، برپا دارد. پس آن عبادت، از حق (الحق) در منزلت (منازلة) او چیزی را برایش به بار می‌آورد که در علم او با آن عمل تناسب ندارد، مگر اینکه با عبادت او در آن عمل مناسبت دارد. پس آن [نتیجه]، زیادت (الزيادة) است به اعتبار عمل، و نتیجه است به اعتبار عبادت (العبادة) در آن.\nاین مقامی است که ما در علم خود، برای آن در میان اهل حق (أهل الله) ذائقه‌ای (چشنده‌ای) نیافتیم، زیرا بیشتر آن‌ها بین عبادت و عمل تفاوتی قائل نیستند. و هر عملی که شارع از جانب خود برای آن تعلیلی (دلیلی) آشکار نکرده باشد، تعبّد است. پس عبادت (العبادة) در هر عمل غیر معلّل، آشکارتر از عمل معلّل است. زیرا اگر عملی تعلیل شود، چه بسا حکمت آن علّت، بنده را به سوی آن برانگیزد؛ اما اگر تعلیل نشود، جز عبادت محضه، چیزی او را به سوی آن عمل برنمی‌انگیزد.\n\n[عبادت (العبادة) حال ذاتی انسان است]\n\nو بدان که عبادت (العبادة) حال ذاتی انسان است و روا نیست که برای آن پاداش مخلوقی باشد، زیرا اصلاً مخلوق نیست. پس اعیان (ذوات) هر آنچه غیر خداست، مخلوق، موجود و حادث هستند، اما عبادت در آن‌ها مخلوق نیست. زیرا عبادت برای این اعیان، یعنی اعیان عالم، در حال عدمشان و در حال وجودشان است. و به واسطه آن [عبادت]، برای او صحیح شد که امر خدا به تکوین را بدون درنگ بپذیرد، بلکه خداوند متعال خبر داد که به آن می‌گوید: **كُنْ فَيَكُونُ** (باش، پس می‌شود).\nپس حکم عبادت برای ممکن (الممكن) در حال عدمش، در او امکان‌پذیرتر است تا در حال وجودش. زیرا در حال وجود و استحکام رأی و نظرش نسبت به خود و استقلالش، ناگزیر است که به نوعی ادعای سیادت کند، هر چه که باشد. پس به همان اندازه که ادعای سیادت کرده، از حکم عبادتش کاسته می‌شود. به همین دلیل گفتیم که حکم عبادت برای ممکن (الممكن) در حال عدمش، امکان‌پذیرتر از حال وجودش است.\nپس هر کس که عبادت او را همراهی کند، شهود (الشهود) نیز او را در دنیا و آخرت همراهی کرده است. و نعت او، اگر این حالش باشد، این است که به چیزی شاد نمی‌شود و برای چیزی غمگین نمی‌گردد، نمی‌خندد و نمی‌گرید، وصفی او را مقید نمی‌کند و نعت وجودی او را متمایز نمی‌سازد. پس نه رسم و نه وصفی دارد.\nابویزید بسطامی (رضی الله عنه) در این مقام گفت: «زمانی خندیدم و زمانی گریستم، و امروز نه می‌خندم و نه می‌گریم.» و در این مقام، هنگامی که به او گفته شد: «چگونه صبح کردی؟» گفت: «برای من نه صباحی است و نه مسائی. همانا صباح و مساء برای کسی است که مقید به صفت باشد، و من صفتی ندارم.» پس خود را به اطلاق وصف کرد، و اطلاق جز در عبادت (العبادة) خاصه صحیح نیست، زیرا بنده مقید به اراده‌ی مولایی است که مالک اوست. و هر کس اطلاق داشته باشد، پاداشش مقید و معین نمی‌شود، زیرا بنده پاداشی ندارد که مانند پاداش اجیر باشد.\nو شیخ ما ابوالعباس العرینی از عُلیا در غرب اندلس، که اولین شیخی بود که خدمتش کردم و از او بهره بردم، در این باب، یعنی باب عبودیت، قدمی راسخ داشت. و بنده تنها در شأن خود، صاحب آن [عبودیت] است، همان‌گونه که حق (الحق) در شأن خود است. پس جزای اطلاق، اطلاق است.\n\nجبرئیل از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) درباره احسان پرسید، ایشان فرمود: «این است که خدا را چنان عبادت کنی که گویی او را می‌بینی.» و عمل را ذکر نکرد، بلکه عبادت (العبادة) را ذکر کرد. و خداوند متعال فرمود: **هَلْ جَزاءُ الْإِحْسانِ إِلَّا الْإِحْسانُ** (آیا جزای احسان جز احسان است؟). پس این همان سخن ماست که جزای اطلاق، جز اطلاق نیست.\nو پاداش‌ها مقید هستند، از ده تا هفتصد برابر، زیرا آن‌ها پاداش اعمال معین و متناهی‌الزمان هستند، پس ناگزیر است که پاداش آن‌ها به عدد مقید شود. و اگرچه جزاف (بدون اندازه‌گیری دقیق) باشد، نزد خدا به عدد مقید است، مانند صابر که پاداشش بدون حساب معین به او داده می‌شود. علم آن نزد ما نامعین است، اما نزد خدا به مقدار معلوم مقید است، زیرا صبر شامل همه اعمال می‌شود، چرا که حبس نفس بر اعمال مشروع است. به همین دلیل، مقدار آن را در بر نمی‌گیرد، در حالی که اعمال را مقادیر در بر می‌گیرند. پس به اندازه‌ای که مکلف تا هنگام مرگ در اعمال برپا داشته می‌شود، نفس خود را بر آن‌ها حبس می‌کند تا حال صبر و نام صابر برایش صحیح شود. پس پاداش او نزد خودش به طور کلی نامعلوم و نامقدر است، اگرچه نزد خدا معلوم است، مانند معامله جزافی در خرید و فروش بدون پیمانه در پیمانه‌ای‌ها و بدون وزن در وزن‌کردنی‌ها.\nو صبر با عبادت (العبادة) تفاوت دارد، زیرا عبادت برای او در حال عدمش و عدم تکلیفش وجود دارد، در حالی که صبر در حال عدمش و عدم تکلیفش برای او نیست. پس عبادت در دنیا و آخرت از او جدا نمی‌شود.\nپس اگر مشهد او، عبادتش در حال ارتقا باشد و حق (الحق) به سوی او نازل شود، همان‌گونه که حق (الحق) خود را به نزول وصف کرده است، در این صورت اجتماع رخ می‌دهد و این همان منزلت (المنازلة) است.\nاز آن جهت که بنده صاحب عملی از اعمال است، زیرا ناگزیر است که در عمل مشروع صالحی باشد و این همان چیزی است که با آن صعود می‌کند، پس آن عمل براق اوست، زیرا حمل می‌شود. پس حق (الحق) از جهت آن عمل، با نیکی‌ای که خدا برای آورنده آن معین کرده و مقدر و معلوم است، او را دریافت می‌کند. سپس حق (الحق) به این مکلف می‌نگرد و او را می‌بیند که با وجود بودن در عملش، آن عمل برایش مشهود نیست، زیرا می‌داند که خدا عامل آن است نه او، و او محل خلق آن عمل و مانند ابزاری برای وجود آن عمل است.\nپس حق (الحق) استحقاق آن عمل را از جهت آنچه در آن وعده داده، عطا می‌کند و به مشهد آن شخص می‌نگرد و او را در عبادتش می‌یابد که در حال عدمش نیز بر آن بوده و از آن جدا نشده است. پس در مقابل آن [عبادت] جزایی نیست، مگر اینکه در زمان خلق غفلت‌ها در مکلفین، غفلت از آن [عبادت] روزی او نشود. جز این نیست. و این همان است که در مورد ممکن (الممكن) در حال وجودش گفتیم که ناگزیر است حکم سیادتی از او ظاهر شود، زیرا او در زمان حکم غفلت‌هاست.\nپس عنایت به این بنده در این منزلت (المنازلة)، رفع غفلت از عبادت (العبادة) در هر حال است. پس این همان زیادت (الزيادة) است در سخن خداوند: **لِلَّذِينَ أَحْسَنُوا الْحُسْنى‏ وزِيادَةٌ** (برای کسانی که نیکی کردند، نیکی و افزونی است). برای کسانی که با اعمال نیکی کردند، حسنی (نیکی) به واسطه پاداش‌هایی است که برای آن‌هاست، بلکه به واسطه پاداش‌هایی است که برای اعمال است، زیرا آن‌ها عیناً برای عامل هستند. و زیادت (الزيادة) همان است که در حق صاحب عبادت (العبادة) ذکر کردیم، زیرا در وقت عمل، غفلت از کسی که عامل است، روزی او نمی‌شود. پس می‌بیند که عامل، خداست. و پاداشی که عمل می‌طلبد، جز به عامل باز نمی‌گردد. پس عامل نزد او خداست. و اگر او از کسانی بود که پاداش می‌پذیرفت، مزدش به اندازه قدر او بود. پس برای مکلف که ابزار پذیرنده پاداش‌هاست، پاداش کسی حاصل می‌شود که اگر خدا اجیر را می‌پذیرفت، پاداشش چگونه بود؟ آیا جز به اندازه قدر او بود، حتی اگر عمل آن را مقید کرده باشد؟\nپس پاداش این مکلف با این شهود (الشهود)، کجا در برابر پاداش کسی است که در عملش می‌بیند مکلف عامل است نه حق (الحق)؟ پس پاداش او به اندازه قدر این مکلف خواهد بود و جز پاداش عمل خاصه، چیزی به او نمی‌رسد، مگر به اندازه پاداش عامل، زیرا عامل نزد او عین اوست و قدری ندارد. و اگر ظهور و اتصاف او به طاعت پروردگارش در عملش نبود، از جانب خود قدری نداشت. و به همین دلیل می‌بینی که سرانجام مخالف به آنجا می‌رسد که می‌رسد. اگر در نفس‌الامر قدری داشت، به حکم قدرش سعادتمند می‌شد، در حالی که تنها به رحمت خدا سعادتمند می‌شود. و اگر قدری داشتند که به واسطه آن مستحق سعادت باشند، سعادتشان متفاوت نمی‌شد. و ما شک نداریم که آن‌ها در سعادت متفاوت هستند، همان‌گونه که در اعمال متفاوتند، از جهت حال، زمان، مکان، عین عمل، دوام، اجتماع و انفراد و غیره، در آنچه تفاضل در آن رخ می‌دهد. پس دانستیم که جزای قدر وجود ندارد. پس دانستیم که انسان از جهت عین خود، قدری ندارد، مگر به طاعت پروردگارش و قدر عملش.\nسپس حق (الحق) پس از این نظر و تعیین جزا، همان‌گونه که مقرر کردیم، به شهود (الشهود) این مکلف می‌نگرد و او را صاحب عبادت (العبادة) می‌بیند و عمل در آن تابع عبادت است. و او به اعراض از اعمال و اقبال به آن‌ها متصف نمی‌شود، و بر همان حالی است که در حال عدمش بود و تغییر نکرده است. پس او را بر حالش باقی می‌گذارد و غفلت را از او محجوب می‌سازد، به طوری که غفلت از هیچ وجهی در او اثری نداشته باشد. و این همان عصمت عامه است.\nپس اگر از او مخالفت (گناهی) سر زند، تنها به حکم قضا و قدر از تکوین آن‌ها در او رخ می‌دهد، همان‌گونه که طاعت رخ داد. پس از حال او در عبادتش کاسته نمی‌شود، زیرا غفلت از او محجوب است و حضور برای او دائمی است. پس اگر آنچه رخ داد، از جانب خدا عین تکوین آن واقعه در این محل است. ظاهر آن صورت معصیت است به حکم خطاب شرع، در حالی که در نفس‌الامر، یعنی آن واقعه، موجودی است که خدا آن را در این محل از موجودات تسبیح‌گوی به حمدش ایجاد کرده است. پس این مخالفت در او اثری ندارد، همان‌گونه که طاعت در او اثری ندارد.\nپس نفس حیوانی به آن عمل سعادتمند می‌شود، هر عملی که در ظاهر باشد، از آنچه زبان گناه یا زبان خیر بر آن جاری می‌شود. زیرا در نفس‌الامر گناه نیست، بلکه حرکت حیوانی او مانند حرکات غیر مکلف است که به طاعت و معصیت متصف نمی‌شود. بلکه آن، ایجاد صورت‌هایی در این محل است که علمای رسوم به آن‌ها می‌نگرند، که از مؤمن عاقل بالغی ظاهر شده است، و بر او حکم می‌کنند بر اساس آنچه نزد آن‌ها در حکم شرع است، از طاعت یا معصیت. جز این بر آن‌ها لازم نیست، مگر اینکه احتمال در آن وارد شود. اگر احتمال در آن وارد شود، برای آن‌ها جایز نیست که جانب زبان گناه را بر غیر آن ترجیح دهند. مانند مردی که او را در شهری سالم و تندرست در ماه رمضان می‌بینی که در روز غذا می‌خورد، با اینکه می‌دانی او مؤمن است. در اینجا احتمال وارد می‌شود که او بیماری‌ای داشته باشد که تو نمی‌دانی، یا در حال سفر باشد و تو از آن خبر نداری. پس با وجود این احتمال، حق نداری بر انکار او پیشی بگیری و سؤال کردن از او نیز بر تو لازم نیست، بلکه مشغول شدن به خودت برای تو اولی‌تر است.\nو اما سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در این باب که فرمود: «همانا در بهشت چیزی است که نه چشمی آن را دیده، نه گوشی آن را شنیده و نه بر قلب بشری خطور کرده است.»\n\n[وجه نامگذاری بهشت (الجنة)]\n\nپس بدان که بهشت (الجنة) جز به دلیل آنچه ذکر می‌کنیم، جنة نامیده نشده است. و همچنین نامگذاری ملائکه به جنة و همچنین جن. پس همه این‌ها به استتار (پوشیدگی) باز می‌گردد. و استتار بر یک شیوه نیست، بلکه حکم آن متفاوت است.\nو از این نوع است که حق (الحق) در قیامت تجلی (التجلی) می‌کند و می‌گوید: «من پروردگار شما هستم» و او را می‌بینند، با این حال او را انکار می‌کنند و تصدیق نمی‌کنند که او پروردگارشان است، با وجود رؤیت و برداشته شدن حجاب. پس هنگامی که در علامتی که او را با آن می‌شناسند، برایشان متحول می‌شود، می‌گویند: «تو پروردگار مایی.» و او همان کسی بود که انکارش کردند و از او پناه بردند، و او همان کسی است که به او اقرار و اعتراف کردند.\nپس این حجابی که با وجود شهود (الشهود) برایشان حاصل شد، چیست؟ آیا امری وجودی است یا حکم عدمی؟ پس او مشهودِ محجوب است، و نه حجاب وجودی است و نه عدم در موجود حکمی دارد. پس بنگر که این چقدر پنهان است! و در عالم دنیا، در همه امور، واقعه‌ای جز این نیست و مردم از آن در غفلت هستند.\nهمان‌گونه که ما ایمان داریم که فرشته با ماست و شیطان با ماست، و حجاب‌های محسوس نزد ما موجود نیستند و چشمان ما ناظر است، با این حال نه فرشته را درک می‌کنیم و نه جن را. و او و قبیله‌اش ما را می‌بینند از جایی که ما آن‌ها را نمی‌بینیم. پس او و قبیله‌اش ما را شهود (الشهود) عینی می‌بینند و ما او را ایمانی می‌بینیم نه عینی. پس این پرده‌ای که بین ماست چیست؟ زیرا اگر بین ما بود، آن‌ها را از ما محجوب می‌کرد، همان‌گونه که ما را از آن‌ها محجوب می‌کند. پس ناگزیر باید حکمتی در این تعیین شود.\nو همچنین حجاب‌هایی که خدا از خود ذکر کرده و بین ما و اوست، از نور و ظلمت. پس از ظلمت، تنزیه (منزه دانستن) واقع شد، پس صفات مُحدَثات را از او نفی کردیم و او را ندیدیم. پس ما با این نظر، حجاب‌ها را بر چشمان خود قرار دادیم. و نور مانند ظهور او برای ماست تا او را شهود (الشهود) کنیم و انکار کنیم که اوست، همان‌گونه که در مورد تجلی (التجلی) در قیامت بیان کردیم.\nو این حکم امروز در دنیا نزد عارفان جاری است. پس عارفان او را در صور ممکناتِ حادث‌الوجود شهود (الشهود) می‌کنند و محجوبان از علمای رسوم او را انکار می‌کنند. و به همین دلیل، در حق این عارفان، ظاهر نامیده می‌شود و در حق این محجوبان، باطن. و جز او نیست، سبحانه و تعالی.\nپس اهل حق (أهل الله) که اهل او هستند، در دنیا و آخرت پیوسته در مشاهده عینی دائمی بوده‌اند و خواهند بود، و اگرچه در صور مختلف باشد، این امر نزد آن‌ها قدحی وارد نمی‌کند.\nاگر کسی بگوید: «موسی به این صفت از ولی سزاوارتر بود و حال آنکه رؤیت را درخواست کرد.» به او می‌گوییم: اگر مؤمن باشی، و اگرچه از اهل کشف (الکشف) نباشی، نزد تو ثابت شده است که\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داده است که خداوند در صورتی تجلی (التجلی) می‌کند و به صورتی دیگر متحول می‌شود و اینکه او شناخته می‌شود و انکار می‌گردد. اگر مؤمن باشی، در این شک نمی‌کنی. و اینکه او بیان کرده است که تجلی (التجلی) در صور، بر اساس قدر کسی است که تجلی بر او صورت می‌گیرد. پس هنگامی که این را دانستی، می‌دانی که موسی حق (الحق) را به همان صورتی که بر اولیا تجلی می‌کند، دیده است، زیرا می‌دانست که او بر اولیا در صور مختلف تجلی می‌کند، چرا که موسی ولی خدا بود و این را می‌دانست و چنین چیزی پنهان نمی‌ماند. و او تنها تجلی در صورتی را درخواست کرد که جز انبیا آن را درک نمی‌کنند، و از انبیا کسانی هستند که خدا آن‌ها را به مقامی اختصاص داده که دیگری به آن نرسیده است، مانند سخن گفتن بدون واسطه برای موسی (علیه السلام). پس موسی (علیه السلام) از پروردگارش خواست که او را در آن صورتی ببیند که مقامش آن را می‌طلبد. و اما رؤیت او در صورتی که اولیا می‌بینند، آن خبر و عادت او بود. و آنچه تو را واداشت که چنین سخنی را به طریق اعتراض بگویی، جز این نیست که تو ولی عارف نیستی، زیرا اگر از عارفان بودی، او را شهود (الشهود) می‌کردی و علم آنچه ما در پاسخ سؤال تو بیان کردیم، از تو غایب نمی‌شد.\nپس سخن او صحیح است که: «همانا در بهشت چیزی است که نه چشمی آن را دیده است»، یعنی در پرده است، از باب اعتبار نه تفسیر. زیرا اگر چشمی آن را می‌دید، مستور نبود. و اگر آن را می‌دید، به آن سخن می‌گفت و شنیده می‌شد. و اگر شنیده می‌شد، محدود بود. و اگر محدود بود، به خاطر خطور می‌کرد و معلوم می‌شد. پس آن امری است که با حجابی ناشناخته از ما پوشیده شده است، زیرا در پرده‌ای است که از آن به بهشت (الجنة) تعبیر می‌شود.\nپس اگر عین آن، عین پرده باشد، ما را محجوب نکرده است، مگر اینکه آنچه را دیده‌ایم، پرده قرار داده‌ایم. پس همت به آنچه پشت پرده است، یعنی مستور، تعلق گرفته است. پس آنچه از ماست، بر ما وارد شده است. و آنچه ما را در این امر قرار داد، جز تنزیه (منزه دانستن) نبود. و به همین دلیل انبیا (علیهم السلام) همراه با تنزیه، با نعت‌های تشبیه آمدند تا امر را بر مردم نزدیک سازند و نزدیک‌ترین افراد به خدا را که در عین قرب هستند، با وجود حجابی که امر بر آن است، آگاه سازند. پس در آن تنبیه به تشبیه، برداشته شدن پوشش‌ها از دیدگان است، پس دیده به تیزبینی متصف می‌شود، همان‌گونه که دیده‌ی محتضر متصف می‌شود. خداوند متعال می‌فرماید: **فَكَشَفْنا عَنْكَ غِطاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ** (پس ما پرده‌ات را از تو برداشتیم، و امروز دیده‌ات تیز است). پس محتضر چیزی را می‌بیند که همنشینانش نمی‌بینند و به همنشینانش از آنچه می‌بیند و درک می‌کند، خبر می‌دهد و از روی صدق خبر می‌دهد، در حالی که حاضران چیزی نمی‌بینند، همان‌گونه که فرشتگان و روحانیانی را که با او در یک مجلس هستند، نمی‌بینند. و خداوند به ما خبر داده است که فرشتگان در مجالس ذکر حاضر می‌شوند و آن‌ها سیاحانی هستند که در جستجوی این مجالس‌اند. پس هنگامی که مجلس ذکر را می‌بینند، برخی به برخی دیگر ندا می‌دهند: «به سوی خواسته‌ی خود بشتابید.» و هیچ یک از بشر از اهل آن مجلس، آن‌ها را درک نمی‌کند، مگر کسی که خدا پرده را از دیده‌اش برداشته باشد، و آن‌ها اهل کشف (الکشف) هستند. آیا نشنیدی\n\nسخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) را که به کسانی که سواره پشت جنازه‌ها راه می‌رفتند، فرمود: «آیا شرم نمی‌کنید که فرشتگان در تشییع جنازه پیاده راه می‌روند و شما سوار هستید؟»\n\nپس شایسته است که مؤمن با موقعیت‌ها چنان رفتار کند که صاحب عیان (مشاهده) با آن‌ها رفتار می‌کند، وگرنه مؤمن حقیقی نیست. زیرا برای هر حقی، حقیقتی است، و حقیقت هر حق، جز این نیست که آن را در منزلت مشهودِ درک‌شونده برای چشم قرار دهی. و این را رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به مردی گفت که شنید او می‌گوید: «من مؤمن حقیقی هستم.» پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به او فرمود: «همانا برای هر حقی، حقیقتی است، حقیقت ایمان تو چیست؟» مرد گفت: «گویی به عرش پروردگارم می‌نگرم که آشکار است»، یعنی روز قیامت. پس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به او فرمود: «شناختی، پس ثابت قدم باش.»\n\nپس حقیقت را به نظر و رؤیت تفسیر کرد و آن را با «گویی» آورد، زیرا روز قیامت به حس واقع نشده است، اما در حق او به صورت تمثیل واقع شده است. پس آن را در تمثیل مانند واقع در حس درک کرد، مانند عابدی که به او گفته شد: «خدا را چنان عبادت کن که گویی او را می‌بینی.» و این مانند عرش آشکار نیست، زیرا خدا در اینجا در نفس‌الامر در قبله نمازگزار یا عابد در هر عملی که باشد، موجود است، در حالی که آشکار شدن عرش چنین نیست.\nپس برخی از مردم خدا را چنان عبادت می‌کنند که گویی او را می‌بینند، به دلیل حجابی که مانع دیدن او شده است. و برخی از مردم او را بر اساس رؤیت و مشاهده عبادت می‌کنند. و بین کسی که او را می‌بیند و کسی که او را نمی‌بیند، جز این نیست که این کسی که او را نمی‌بیند، او را نمی‌شناسد، با اینکه او عز و جل مشهود اوست. و عارف او را می‌شناسد، اما چنین معرفتی شایسته گفتن نیست، زیرا پذیرفته نمی‌شود. پس هنگامی که انسان آن را از خود شهود (الشهود) کند، نمی‌تواند آن را نادیده بگیرد. پس در آن هنگام از کسانی خواهد بود که خدا را در عبادتشان می‌بینند و حکم «گویی او را می‌بینی» از آن‌ها زایل می‌شود. پس این را بدان.\nو اما سخن خداوند متعال: **فَلا تَعْلَمُ نَفْسٌ ما أُخْفِيَ لَهُمْ** (پس هیچ نفسی نمی‌داند آنچه برایشان پنهان شده است)، یعنی برای قومی که وصفشان گذشت، **جَزاءً بِما كانُوا يَعْمَلُونَ** (به پاداش آنچه عمل می‌کردند). پس جزای آن‌ها در اینجا جز پنهان داشتن آن از این نفسی که نمی‌داند، نیست. پس پنهان داشتن حال اینان و آنچه نزد خدا دارند، از این نفوس که نمی‌دانند، جزایی برای آن‌هاست. یعنی جزای آن‌ها این است که مقامشان نزد خدا مجهول بماند، به طوری که هیچ نفسی قدر آن‌ها را نداند، همان‌گونه که حق (الحق) درباره خود فرمود: **وما قَدَرُوا الله حَقَّ قَدْرِهِ** (و خدا را آن‌گونه که شایسته قدر اوست، نشناختند). پس نعت خود را در خلقش به آن‌ها عطا کرد.\nپس هیچ نفسی نمی‌داند که چه چیزی از روشنی چشم‌ها برای اینان پنهان شده است، از آنچه چشم‌هایشان به آن روشن می‌شود. و همچنین\n\nپیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «و روشنی چشم من در نماز قرار داده شده است.»\nو تنها چشم‌ها را ذکر کرد نه همه ادراکات را، زیرا هر کلام الهی و غیر الهی ناگزیر است که عین آن از عین موجودی باشد، و در آنجا جز کلام نیست. پس در آنجا جز اعیانی که به وجود می‌آیند، نیست. و متعلق رؤیت، درک عین مرئی و آمادگی مرئی برای رؤیت است، چه معدوم باشد و چه موجود. پس هنگامی که آن را ببیند، چشمش به آنچه دیده روشن می‌شود، زیرا دیگری آن را نمی‌بیند. و به همین دلیل موسی رؤیت را درخواست کرد تا چشمش به آنچه می‌بیند روشن شود.\nپس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در حال نماز، صاحب رؤیت و شهود (الشهود) بود، و به همین دلیل نماز محل روشنی چشم او بود، زیرا او مناجات‌کننده است. و اعیان، همان‌گونه که گفتیم، به واسطه کلام تکوین می‌یابند. پس او و حق (الحق) در اثنای صور هستند، مادامی که در نماز مناجات می‌کند. پس آنچه از تلاوت او تکوین می‌یابد و آنچه از قول خدا در مقابل آنچه او سخن گفته تکوین می‌یابد را می‌بیند، همان‌گونه که در خبری که تقسیم نماز از قول بنده در آن است و خدا می‌گوید، وارد شده است.\nو اما سخن او در این باب: **وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله** (و تأویل آن را جز خدا نمی‌داند)، این است که مال (سرانجام) شیء صحیح نیست که واقع شود و دیده شود، مگر اینکه برای بیننده تمثیل شود، پس گویی آن را می‌بیند. زیرا مال (المال) در مقابل حال (الحال) است. حال موجود است و مال موجود نیست، و به همین دلیل مال نامیده شده است.\nو تأویل (التأويل) همان چیزی است که حکم این متشابه به آن باز می‌گردد. پس نزد کسی که تأویل آن را می‌داند، محکم است و متشابه نیست، و او جز خدا نیست. و راسخان در علم می‌گویند: **آمَنَّا به كُلٌّ من عِنْدِ رَبِّنا** (به آن ایمان آوردیم، همه از جانب پروردگار ماست)، یعنی متشابه و محکم آن.\nپس هنگامی که خدا آنچه را که مال (سرانجام) آن است، به شهود او رساند، نزد او محکم است و تشابه در حق این عالم از بین رفته است. پس نزد او همان‌گونه است که نزد خداست، از آن وجه. و نزد او نیز متشابه است، به دلیل صلاحیتش برای هر دو طرف بدون خالص‌سازی، همان‌گونه که در نفس‌الامر به حکم وضع مصطلح است. پس او اگرچه تأویل آن را شناخته است، اما از حکم تشابه خود خارج نشده است، زیرا وجه دیگر آن را با آنچه بر آن دلالت می‌کند و در بر می‌گیرد، می‌طلبد، همان‌گونه که وجهی که خدا این شخص را به آن آگاه کرد، آن را طلبید.\nپس علم خدا بر حقیقت آن، این است که تأویل آن را بداند، یعنی آنچه از هر دو جانب در حق هر یک یا جوانب (اگر زیاد باشند) به آن باز می‌گردد. پس آن را متشابه می‌داند، زیرا چنین است، چرا که هر جانب آن را با نصیب و دلالت خود از آن می‌طلبد. پس محکم، محکم است و زایل نمی‌شود، و متشابه، متشابه است و زایل نمی‌شود.\nو این را گفتیم تا کسی خیال نکند که علم عالم به آنچه آن لفظ در حق هر کس که در آن حکمی دارد، به آن باز می‌گردد، آن را از متشابه بودن خارج می‌کند. امر چنین نیست، بلکه با وجود علم به آنچه در حق هر کس که نصیبی در آن دارد، به آن باز می‌گردد، بر اصل خود متشابه است.\nپس این احاطه مجهول است و جز در این منزلت (المنازلة) دانسته نمی‌شود. پس از این متشابه، حق هر صاحب حقی را می‌دهد، همان‌گونه که خدا **كُلَّ شَيْ‏ءٍ خَلْقَهُ** (به هر چیزی خلقتش را) از شباهت و اشتراک عطا کرد.\nو اما مفاتح الغیب (کلیدهای غیب)، **لا يَعْلَمُها إِلَّا هُوَ** (آن‌ها را جز او نمی‌داند). و این از همین باب است. پس دانسته نمی‌شود مگر با اعلام خدا. و اگرچه دانسته شوند، دانسته نمی‌شود که آن‌ها مفاتح الغیب (کلیدهای غیب) هستند. پس به این نکته توجه کن.\n\n[استعدادات از قوابل (پذیرنده‌ها) همان مفاتح الغیب (کلیدهای غیب) هستند]\n\nو بدان که اعلام [الهی] برای ما آشکار ساخت که استعدادها از قوابل (پذیرنده‌ها) همان مفاتح الغیب (کلیدهای غیب) هستند، زیرا در آنجا جز بخشش مطلق و عام و فیض جود نیست. در نفس‌الامر نه غیبی هست و نه شهودی (الشهود)، بلکه معلومات بی‌پایانی هستند که برخی از آن‌ها وجود دارند و برخی وجود ندارند، برخی سببیت دارند و برخی سببیت ندارند، برخی قابلیت وجود دارند و برخی قابلیت ندارند.\nپس در آنجا کلید (مفتاح)، گشایش (فتح) و گشوده (مفتوح) وجود دارد. هنگامی که گشوده می‌شود، آنچه این گشوده حجاب آن بوده، آشکار می‌گردد. پس کلید، استعداد تو برای آموختن و پذیرش علم است، و گشایش، تعلیم است، و گشوده، دری است که در کنار آن ایستاده بودی. پس اگر نایستی و حرکت کنی، در هر قدم چیزی را می‌بینی که ندیده‌ای، پس چیزی را می‌دانی که نمی‌دانستی، و فضل خدا بر تو عظیم بوده است.\nپس استعداد اکتسابی نیست، بلکه موهبتی الهی است. به همین دلیل جز خدا آن را نمی‌داند. پس می‌داند که مفاتح الغیب (کلیدهای غیب) وجود دارند، اما نمی‌داند که مفتاح غیب خاص در هر یک از غیب‌ها چیست.\nپس هنگامی که استعداد از جانب خداوند متعال حاصل شد، کلید حاصل شده است و گشایش باقی می‌ماند تا تعلیم واقع شود، همان‌گونه که فرمود: **الرَّحْمنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ** (خداوند رحمان، قرآن را تعلیم داد، انسان را آفرید، بیان را به او آموخت). پس تعلیم، عین گشایش است.\nو از این باب است: **فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله** (پس به هر سو رو کنید، آنجا وجه خداست)، مانند نماز بر مرکب. پس جهت قبله مقید نیست، بلکه بر اساس مسیری است که مرکب می‌رود. همچنین عارف نمی‌داند که پروردگارش او را در مناجاتش به کجا می‌برد. زیرا آن بر اساس کلامی است که با آن مناجات می‌کند، و کلام او سوره‌های قرآن است. پس هر سوره یا هر آیه‌ای را که بخواهد می‌خواند، بدون تعیین، زیرا شارع او را به سوره خاصی مقید نکرده است. پس آن بر اساس چیزی است که در خاطرش القا می‌شود و این به خدا باز می‌گردد.\nهمان‌گونه که او به آنچه در نفسش القا می‌شود و با آن مناجات می‌کند، علم ندارد مگر تا زمانی که القا شود، همچنین نمی‌داند که حق (الحق) در مناجاتش در منزلت (منازلة) او چه می‌گوید.\nو از این باب است سخن او: **فَعِدَّةٌ من أَيَّامٍ أُخَرَ** (پس تعدادی از روزهای دیگر). و روزهای خدا که بنده با عمره آن‌ها را طی می‌کند، قدر آن‌ها را معین نمی‌کند و به همین دلیل آن‌ها را نکره آورده است. پس آنچه بر مکلف در سفرش واجب است، تعدادی از روزهای دیگر است که در تعیین آن‌ها اختیار دارد، اما نمی‌داند که چه چیزی را از آن‌ها تعیین کند، مگر با القای خدا در نفس او.\nو روزه مِثلی ندارد. پس نمی‌داند که در کدام صفت از صفات بی‌مثال از جانب حق (الحق) او را برپا می‌دارد، و آن هر صفت الهی است که بنده نمی‌تواند به آن متصف شود، اگرچه آن را بداند، همان‌گونه که می‌داند حق (الحق) مِثل ندارد و با این علم، خدا نمی‌شود، زیرا الوهیت صفت او نیست.\nو این معنای سخن پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) است هنگامی که از پروردگارش درخواست کرد: «بار خدایا، از تو می‌خواهم به هر نامی که خود را به آن نامیدی، یا آن را به یکی از خلق خود آموختی، یا آن را در علم غیب خود به خود اختصاص دادی.»\nپس در این [دعا] هر نامی که ممکن است به آن متصف شود و هر نامی که ممکن نیست به آن متصف شود، وارد شده است. پس آنچه از اسماء که به آن متصف نمی‌شود، مِثلی ندارد. پس در روزه ما برای ما معلوم است، اما در ما قائم نیست به طوری که به آن متصف شویم. این فایده عدم تعیین در روزهایی است که روزه می‌گیریم، اگر مسافر باشیم و افطار کرده باشیم، پس روزهای رمضان را قضا می‌کنیم یا آن را در روزهای نامعین ادا می‌کنیم.\nپس صاحب این منزلت (المنازلة) در عروج خود، با قلب خالی و نفس تهی، و عاری از قصد نام معین الهی، قصد خدا را می‌کند، به اعتبار اینکه تو بنده هستی و او خدایی است که هر چه بخواهد انجام می‌دهد. امری به خاطرت خطور نمی‌کند که آن را از او بخواهی، بلکه این است که در عروجت با او باشی، بر اساس آنچه از او صادر می‌شود، با حفظ اوقاتت در آنچه از تکلیف بر تو واقع شده است، برای ادای حق وقت و رعایت خطاب شرع، همراه با غیبت تو از خودت در آن، به واسطه تولّی او در آنچه تو در آن هستی، و تو محل جریان مقادیر او هستی، همراه با احتیاط و لزوم ادب از اینکه تو را محل چیزی قرار دهد که بر تو حرام کرده است.\nاگر بر این شیوه سلوک کنی، از حق (الحق) در منزلت (منازلة) تو چیزی آشکار می‌شود که به خاطرت خطور نکرده است، بلکه چیزی است که قابل بیان نیست و عبارت آن را در بر نمی‌گیرد."
  },
  "page_count": 6
}