{
  "id": 6,
  "title": {
    "ar": "الباب السادس في معرفة بدء الخلق الروحاني‏",
    "en": "The Sixth Chapter: Concerning the Knowledge of the Origin of the Spiritual Creation.",
    "ur": "چھٹا باب: روحانی تخلیق کی ابتدا کی معرفت میں",
    "fa": "باب ششم در معرفت آغاز آفرینش روحانی"
  },
  "content": {
    "ar": "## (الباب السادس) في معرفة بدء الخلق الروحاني‏\n\n\n(بسم الله الرحمن الرحيم) ومن هو أول موجود فيه ومم وجد وفيم وجد وعلى أي مثال وجد ولم وجد وما غايته ومعرفة أفلاك العالم الأكبر والأصغر\n\n\n> انظر إلى هذا الوجود المحكم *** ووجودنا مثل الرداء المعلم‏\n\n\n> وانظر إلى خلفائه في ملكهم *** من مفصح طلق اللسان وأعجم‏\n\n\n> ما منهمو أحد يحب إلهه *** إلا ويمزجه بحب الدرهم‏\n\n\n> فيقال هذا عبد معرفة وذا *** عبد الجنان وذا عبيد جهنم‏\n\n\n> إلا القليل من القليل فإنهم *** سكرى به من غير حس توهم‏\n\n\n> فهموا عبيد الله لا يدري بهم *** أحد سواه لا عبيد المنعم‏\n\n\n> فأفادهم لما أراد رجوعهم *** لقصورهم من كل علم مبهم‏\n\n\n> علم المقدم في البسائط وحده *** وأساسه ذو عنه لم يتصرم‏\n\n\n> وحقيقة الظرف الذي سترته عن *** أمثاله ومثاله لم يكتم‏\n\n\n> والعلم بالسبب الذي وجدت له *** عين العوالم في الطراز الأقدم‏\n\n\n> ونهاية الأمر الذي لا غاية *** تدري له فيه العظيم الأعظم‏\n> وعلوم أفلاك الوجود كبيره *** وصغيره إلا على الذي لم يذمم‏\n\n\n> هذي علوم من تحقق كشفها *** يهدي القلوب إلى السبيل الأقوم‏\n\n\n> فالحمد لله الذي أنا جامع *** لعلومها ولعلم ما لم يعلم‏\n\n\n### [إيجاز البيان بضرب من الإجمال‏]\n\n\nإيجاز البيان بضرب من الإجمال بدء الخلق الهباء وأول موجود فيه الحقيقة المحمدية الرحمانية ولا أين يحصرها لعدم التحيز ومم وجد وجد من الحقيقة المعلومة التي لا تتصف بالوجود ولا بالعدم وفيم وجد في الهباء وعلى أي مثال وجد الصورة المعلومة في نفس الحق ولم وجد لإظهار الحقائق الإلهية وما غايته التخليص من المزجة فيعرف كل عالم حظه من منشئه من غير امتزاج فغايته إظهار حقائقه ومعرفة أفلاك الأكبر من العالم وهو ما عدا الإنسان في اصطلاح الجماعة والعالم الأصغر يعني الإنسان روح العالم وعلته وسببه وأفلاكه مقاماته وحركاته وتفصيل طبقاته فهذا جميع ما يتضمنه هذا الباب‏\n\n\n### [الإنسان عالم صغير]\n\n\nفكما إن الإنسان عالم صغير من طريق الجسم كذلك هو أيضا حقير من طريق الحدوث وصح له التأله لأنه خليفة الله في العالم والعالم مسخر له مألوه كما إن الإنسان مألوه لله تعالى واعلم أن أكمل نشأة الإنسان إنما هي في الدنيا وأما الآخرة فكل إنسان من الفرقتين على النصف في الحال لا في العلم فإن كل فرقة عالمة بنقيض حالها فليس الإنسان إلا المؤمن والكافر معا سعادة وشقاء نعيم وعذاب منعم ومعذب ولهذا معرفة الدنيا أتم وتجلى الآخرة أعلى فافهم وحل هذا القفل ولنا رمز لمن تفطن وهو لفظه بشيع شنيع ومعناه بديع‏\n\n\n> روح الوجود الكبير *** هذا الوجود الصغير\n\n\n> لولاه ما قال إني *** أنا الكبير القدير\n\n\n> لا يحجبنك حدوثي *** ولا الفناء والنشور\n\n\n> فإنني إن تأملتني *** المحيط الكبير\n\n\n> فللقديم بذاتي *** وللجديد ظهور\n\n\n> والله فرد قديم *** لا يعتريه قصور\n\n\n> والكون خلق جديد *** في قبضتيه أسير\n\n\n> فجاء من هذا إني *** أنا الوجود الحقير\n\n\n> وإن كل وجود *** على وجودي يدور\n\n\n> فلا كليلي ليل *** ولا كنوري نور\n\n\n> فمن يقل في عبد *** أنا العبيد الفقير\n\n\n> أو قال إني وجود *** أنا الوجود الخبير\n\n\n> فصحني ملكا تجدني *** أو سوقة ما تجور\n\n\n> فيا جهولا بقدري *** أنت العليم البصير\n\n\n> بلغ وجودي عني *** والقول صدق وزور\n\n\n> وقل لقومك إني *** أنا الرحيم الغفور\n\n\n> وقل بأن عذابي *** هو العذاب المبير\n\n\n> وقل بأني ضعيف *** لا أستطيع أسير\n\n\n> فكيف ينعم شخص *** على يدي أو يبور\n\n\n### بسط الباب وبيانه ومن الله التأييد والعون [المعلومات الوجودية الأربعة]\n\n\nاعلموا أن المعلومات أربعة الحق تعالى وهو الموصوف بالوجود المطلق لأنه سبحانه ليس معلولا لشي‏ء ولا علة بل هو موجود بذاته والعلم به عبارة عن العلم بوجوده ووجوده ليس غير ذاته مع أنه غير معلوم الذات لكن يعلم ما ينسب إليه من الصفات أعني صفات المعاني وهي صفات الكمال وأما العلم بحقيقة الذات‏\nفممنوع لا تعلم بدليل ولا ببرهان عقلي ولا يأخذها حد فإنه سبحانه لا يشبه شيئا ولا يشبهه شي‏ء فكيف يعرف من يشبه الأشياء من لا يشبهه شي‏ء ولا يشبهه شيئا فمعرفتك به إنما هي إنه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ ويُحَذِّرُكُمُ الله نَفْسَهُ وقد ورد المنع من الشرع في التفكر في ذات الله‏\n\n\n### [حقيقة الحقائق‏]\n\n\n(و معلوم ثان) وهو الحقيقة الكلية التي هي للحق وللعالم لا تتصف بالوجود ولا بالعدم ولا بالحدوث ولا بالقدم هي في القديم إذا وصف بها قديمة وفي المحدث إذا وصف بها محدثة لا تعلم المعلومات قديمها وحديثها حتى تعلم هذه الحقيقة ولا توجد هذه الحقيقة حتى توجد الأشياء الموصوفة بها فإن وجد شي‏ء عن غير عدم متقدم كوجود الحق وصفاته قيل فيها موجود قديم لإنصاف الحق بها وإن وجد شي‏ء عن عدم كوجود ما سوى الله وهو المحدث الموجود بغيره قيل فيها محدثة وهي في كل موجود بحقيقتها فإنها لا تقبل التجزي فما فيها كل ولا بعض ولا يتوصل إلى معرفتها مجردة عن الصورة بدليل ولا ببرهان فمن هذه الحقيقة وجد العالم بوساطة الحق تعالى وليست بموجودة فيكون الحق قد أوجدنا من موجود قديم فيثبت لنا القدم وكذلك لتعلم أيضا أن هذه الحقيقة لا تتصف بالتقدم على العالم ولا العالم بالتأخر عنها ولكنها أصل الموجودات عموما وهي أصل الجوهر وفلك الحياة والحق المخلوق به وغير ذلك وهي الفلك المحيط المعقول فإن قلت إنها العالم صدقت أو إنها ليست العالم صدقت أو إنها الحق أو ليست الحق صدقت تقبل هذا كله وتتعدد بتعدد أشخاص العالم وتتنزه بتنزيه الحق وإن أردت مثالها حتى يقرب إلى فهمك فانظر في العودية في الخشبة والكرسي والمحبرة والمنبر والتابوت وكذلك التربيع وأمثاله في الأشكال في كل مربع مثلا من بيت وتابوت وورقة والتربيع والعودية بحقيقتها في كل شخص من هذه الأشخاص وكذلك الألوان بياض الثوب والجوهر والكاغذ والدقيق والدهان من غير أن تتصف البياضية المعقولة في الثوب بأنها جزء منها فيه بل حقيقتها ظهرت في الثوب ظهورها في الكاغذ وكذلك العلم والقدرة والإرادة والسمع والبصر وجميع الأشياء كلها فقد بينت لك هذا المعلوم وقد بسطنا القول فيه كثيرا في كتابنا الموسوم بإنشاء الجداول والدوائر (و معلوم ثالث) وهو العالم كله الأملاك والأفلاك وما تحويه من العوالم والهواء والأرض وما فيهما من العالم وهو الملك الأكبر (و معلوم رابع) وهو الإنسان الخليفة الذي جعله الله في هذا العالم المقهور تحت تسخيره قال تعالى وسَخَّرَ لَكُمْ ما في السَّماواتِ وما في الْأَرْضِ جَمِيعاً مِنْهُ فمن علم هذه المعلومات فما بقي له معلوم أصلا يطلبه فمنها ما لا نعلم إلا وجوده وهو الحق تعالى وتعلم أفعاله وصفاته بضرب من الأمثلة ومنها ما لا يعلم إلا بالمثال كالعلم بالحقيقة الكلية ومنها ما يعلم بهذين الوجهين وبالماهية والكيفية وهو العالم والإنسان‏\n\n\n### «وصل» [بدء العالم ومثاله: الهباء والحقيقة المحمدية]\n\n\nكان الله ولا شي‏ء معه‏\n\n\nثم أدرج فيه‏\n\n\nوهو الآن على ما عليه‏\n\n\nكان لم يرجع إليه من إيجاده العالم صفة لم يكن عليها بل كان موصوفا لنفسه ومسمى قبل خلقه بالأسماء التي يدعونه بها خلقه فلما أراد وجود العالم وبدأه على حد ما علمه بعلمه بنفسه انفعل عن تلك الإرادة المقدسة بضرب تجل من تجليات التنزيه إلى الحقيقة الكلية انفعل عنها حقيقة تسمى الهباء هي بمنزلة طرح البناء الجص ليفتح فيها ما شاء من الأشكال والصور وهذا هو أول موجود في العالم وقد ذكره علي بن أبي طالب رضي الله عنه وسهل بن عبد الله رحمه الله وغيرهما من أهل التحقيق أهل الكشف والوجود ثم إنه سبحانه تجلى بنوره إلى ذلك الهباء ويسمونه أصحاب الأفكار الهيولى الكل والعالم كله فيه بالقوة والصلاحية فقبل منه تعالى كل شي‏ء في ذلك الهباء على حسب قوته واستعداده كما تقبل زوايا البيت نور السراج وعلى قدر قربه من ذلك النور يشتد ضوءه وقبوله قال تعالى مَثَلُ نُورِهِ كَمِشْكاةٍ فِيها مِصْباحٌ فشبه نوره بالمصباح فلم يكن أقرب إليه قبولا في ذلك الهباء إلا حقيقة محمد صلى الله عليه وسلم المسماة بالعقل فكان سيد العالم بأسره وأول ظاهر في الوجود فكان وجوده من ذلك النور الإلهي ومن الهباء ومن الحقيقة الكلية وفي الهباء وجد عينه وعين العالم من تجليه وأقرب الناس إليه علي بن أبي طالب وأسرار الأنبياء أجمعين وأما المثال الذي عليه وجد العالم كله من غير تفصيل فهو العلم القائم بنفس الحق تعالى فإنه سبحانه علمنا بعلمه بنفسه وأوجدنا على حد ما علمنا ونحن على هذا الشكل المعين في علمه ولو لم يكن الأمر كذلك لأخذنا هذا الشكل بالاتفاق لا عن قصد لأنه لا يعلمه وما يتمكن أن تخرج صورة في الوجود بحكم الاتفاق فلو لا إن هذا الشكل المعين معلوم لله سبحانه ومراد له ما أوجدنا عليه ولم يأخذ هذا الشكل من غيره إذ قد ثبت أنه كان ولا شي‏ء معه فلم يبق إلا أن يكون‏\nما برز عليه في نفسه من الصورة فعلمه بنفسه علمه بنا أزلا لا عن عدم فعلمه بنا كذلك فمثالنا الذي هو عين علمه بنا قديم بقدم الحق لأنه صفة له ولا تقوم بنفسه الحوادث جل الله عن ذلك‏\n\n\n### [غاية العالم‏]\n\n\nوأما قولنا ولم وجد وما غايته يقول الله عز وجل وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فصرح بالسبب الذي لأجله أوجدنا وهكذا العالم كله وخصصنا والجن بالذكر والجن هنا كل مستتر من ملك وغيره وقد قال تعالى في حق السموات والأرض ائْتِيا طَوْعاً أَوْ كَرْهاً قالَتا أَتَيْنا طائِعِينَ وكذلك قال فَأَبَيْنَ أَنْ يَحْمِلْنَها وذلك لما كان عرضا وأما لو كان أمرا لأطاعوا وحملوها فإنه لا تتصور منهم معصية جبلوا على ذلك والجن الناري والإنس ما جبلا على ذلك‏\n\n\n### [العالم كله حي ناطق‏]\n\n\nوكذلك من الإنس أصحاب الأفكار من أهل النظر والأدلة المقصورة على الحواس والضرورات والبديهيات يقولون لا بد أن يكون المكلف عاقلا بحيث يفهم ما يخاطب به وصدقوا وكذلك هو الأمر عندنا العالم كله عاقل حي ناطق من جهة الكشف بخرق العادة التي الناس عليها أعني حصول العلم بهذا عندنا غير أنهم قالوا هذا جماد لا يعقل ووقفوا عند ما أعطاهم بصرهم والأمر عندنا بخلاف ذلك فإذا جاء عن نبي أن حجرا كلمه أو كتف شاة أو جذع نخلة أو بهيمة يقولون خلق الله فيه الحياة والعلم في ذلك الوقت والأمر عندنا ليس كذلك بل سر الحياة في جميع العالم وأن كل من يسمع المؤذن من رطب ويابس يشهد له ولا يشهد إلا من علم هذا عن كشف عندنا لا عن استنباط من نظر بما يقتضيه ظاهر خبر ولا غير ذلك ومن أراد أن يقف عليه فليسلك طريق الرجال وليلزم الخلوة والذكر فإن الله سيطلعه على هذا كله عينا فيعلم إن الناس في عماية عن إدراك هذه الحقائق‏\n\n\n### [وجود العلم ظهور سلطان السماء]\n\n\nفأوجد العالم سبحانه ليظهر سلطان الأسماء فإن قدرة بلا مقدور وجودا بلا عطاء ورازقا بلا مرزوق ومغيثا بلا مغاث ورحيما بلا مرحوم حقائق معطلة التأثير وجعل العالم في الدنيا ممتزجا مزج القبضتين في العجنة ثم فصل الأشخاص منها فدخل من هذه في هذه من كل قبضة في أختها فجهلت الأحوال وفي هذا تفاضلت العلماء في استخراج الخبيث من الطيب والطيب من الخبيث وغايته التخليص من هذه المزجة وتمييز القبضتين حتى تنفرد هذه بعالمها وهذه بعالمها كما قال الله تعالى لِيَمِيزَ الله الْخَبِيثَ من الطَّيِّبِ ويَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلى‏ بَعْضٍ فَيَرْكُمَهُ جَمِيعاً فَيَجْعَلَهُ في جَهَنَّمَ فمن بقي فيه شي‏ء من المزجة حتى مات عليها لم يحشر يوم القيامة من الآمنين ولكنه منهم من يتخلص من المزجة في الحساب ومنهم من لا يتخلص منها إلا في جهنم فإذا تخلص أخرج فهؤلاء هم أهل الشفاعة وأما من تميز هنا في إحدى القبضتين انقلب إلى الدار الآخرة بحقيقته من قبره إلى نعيم أو إلى عذاب وجحيم فإنه قد تخلص فهذا غاية العالم وهاتان حقيقتان راجعتان إلى صفة هو الحق عليها في ذاته ومن هنا قلنا يرونه أهل النار معذبا وأهل الجنة منعما وهذا سر شريف ربما تقف عليه في الدار الآخرة عند المشاهدة إن شاء الله وقد نالها المحققون في هذه الدار\n\n\n### [العوالم العلوية والسفلية ونظائرها من الإنسان‏]\n\n\nوأما قولنا في هذا الباب ومعرفة أفلاك العالم الأكبر والأصغر الذي هو الإنسان فأعني به عوالم كلياته وأجناسه وأمراؤه الذين لهم التأثير في غيرهم وجعلتها مقابلة هذا نسخة من هذا وقد ضربنا لها دوائر على صور الأفلاك وترتيبها في كتاب إنشاء الدوائر والجداول الذي بدأنا وضعه بتونس بمحل الإمام أبي محمد عبد العزيز ولينا وصفينا رحمه الله فلنلق منه في هذا الباب ما يليق بهذا المختصر فنقول إن العوالم أربعة العالم الأعلى وهو عالم البقاء ثم عالم الاستحالة وهو عالم الفناء ثم عالم التعمير وهو عالم البقاء والفناء ثم عالم النسب وهذه العوالم في موطنين في العالم الأكبر وهو ما خرج عن الإنسان وفي العالم الأصغر وهو الإنسان (فأما العالم الأعلى) فالحقيقة المحمدية وفلكها الحياة نظيرها من الإنسان اللطيفة والروح القدسي ومنهم العرش المحيط ونظيره من الإنسان الجسم ومن ذلك الكرسي ونظيره من الإنسان النفس ومن ذلك البيت المعمور ونظيره من الإنسان القلب ومن ذلك الملائكة ونظيرها من الإنسان الأرواح التي فيه والقوي ومن ذلك زحل وفلكه نظيره من الإنسان القوة العلمية والنفس ومن ذلك المشتري وفلكه نظيرهما القوة الذاكرة ومؤخر الدماغ ومن ذلك الأحمر وفلكه نظيرهما القوة العاقلة واليافوخ ومن ذلك الشمس وفلكها نظيرهما القوة المفكرة ووسط الدماغ ثم الزهرة وفلكها نظيرهما القوة الوهمية والروح الحيواني ثم الكاتب وفلكه نظيرهما القوة الخيالية ومقدم الدماغ ثم القمر وفلكه نظيرهما القوة الحسية والجوارح التي تحس فهذه طبقات العالم الأعلى ونظائره من الإنسان (و أما عالم‏\nالاستحالة) فمن ذلك كرة الأثير وروحها الحرارة واليبوسة وهي كرة النار ونظيرها الصفراء وروحها القوة الهاضمة ومن ذلك الهواء وروحه الحرارة والرطوبة ونظيره الدم وروحه القوة الجاذبة ومن ذلك الماء وروحه البرودة والرطوبة نظيره البلغم وروحه القوة الدافعة ومن ذلك التراب وروحه البرودة واليبوسة نظيره السوداء وروحها القوة الماسكة وأما الأرض فسبع طباق أرض سوداء وأرض غبراء وأرض حمراء وأرض صفراء وأرض بيضاء وأرض زرقاء وأرض خضراء نظير هذه السبعة من الإنسان في جسمه الجلد والشحم واللحم والعروق والعصب والعضلات والعظام (و أما عالم التعمير) فمنهم الروحانيون نظيرهم القوي التي في الإنسان ومنهم عالم الحيوان نظيره ما يحس من الإنسان ومنهم عالم النبات نظيره ما ينمو من الإنسان ومن ذلك عالم الجماد نظيره ما لا يحس من الإنسان (و أما عالم النسب) فمنهم العرض نظيره الأسود والأبيض والألوان والأكوان ثم الكيف نظيره الأحوال مثل الصحيح والسقيم ثم الكم نظيره الساق أطول من الذراع ثم الأين نظيره العنق مكان للرأس والساق مكان للفخذ ثم الزمان نظيره حركت رأسي وقت تحريك يدي ثم الإضافة نظيرها هذا أبي فأنا ابنه ثم الوضع نظيره لغتي ولحني ثم أن يفعل نظيره أكلت ثم أن ينفعل نظيره شبعت ومنهم اختلاف الصور في الأمهات كالفيل والحمار والأسد والصرصر نظير هذا القوة الإنسانية التي تقبل الصور المعنوية من مذموم ومحمود هذا فطن فهو فيل هذا بليد فهو حمار هذا شجاع فهو أسد هذا جبان فهو صرصر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## (Chapter Six) Concerning the Knowledge of the Beginning of the Spiritual Creation\n\nAnd who is the first existent therein, from what did it come into existence, in what did it come into existence, upon what model did it come into existence, why did it come into existence, what is its ultimate purpose, and the knowledge of the spheres (أفلاك) of the Greater World (العالم الأكبر) and the Lesser World (العالم الأصغر).\n\n> Look upon this firmly established Existence (الوجود المحكم),\n> And our existence is like an embroidered cloak.\n> And look upon His vicegerents (خلفائه) in their dominion,\n> Whether eloquent, fluent of tongue, or mute.\n> There is none among them who loves his God,\n> Except that he mixes it with the love of the dirham.\n> So it is said: this one is a servant of Gnosis (عبد معرفة), and that one\n> Is a servant of Paradise (عبد الجنان), and those are servants of Hell.\n> Except for the few among the few, for they\n> Are intoxicated by Him, without any sense of illusion.\n> They are the servants of Allah; none knows them\n> Except Him—not the servants of the Bestower (المنعم).\n> So He benefited them when He desired their return\n> To their palaces, from every obscure knowledge.\n> The knowledge of the Precedent in the simple realities (البسائط) alone,\n> And its foundation, which has not been severed from Him.\n> And the Reality of the Vessel (حقيقة الظرف) which He concealed from\n> Its likes, yet its likeness was not hidden.\n> And the knowledge of the cause for which\n> The very essence of the worlds (عين العوالم) came into existence in the most ancient pattern.\n> And the end of the matter, for which no ultimate purpose\n> Is known therein by the Great and Most Great.\n> And the sciences of the spheres (أفلاك) of Existence (الوجود), both great\n> And small, except for the one who is not blamed.\n> These are the sciences whose unveiling (كشفها) is realized by one who\n> Guides hearts to the most upright path.\n> So praise be to Allah, Who has made me the collector\n> Of these sciences and the knowledge of what is yet unknown.\n\n### [A Concise Statement by Way of Summary]\n\nA concise statement by way of summary: The beginning of creation is the Dust (الهباء), and the first existent therein is the Merciful Muhammadan Reality (الحقيقة المحمدية الرحمانية), and no place (أين) confines it due to the absence of spatial limitation (عدم التحيز). From what did it come into existence? It came into existence from the Known Reality (الحقيقة المعلومة) which is not described by Existence (الوجود) nor by non-existence (العدم). In what did it come into existence? In the Dust (الهباء). Upon what model did it come into existence? The known form (الصورة المعلومة) in the Essence (نفس) of the Real (الحق). Why did it come into existence? To manifest the Divine Realities (الحقائق الإلهية). What is its ultimate purpose? Separation (التخليص) from the mixture (المزجة), so that every knower recognizes his portion from his Originator without admixture. Thus, its ultimate purpose is the manifestation of His Realities. And the knowledge of the spheres (أفلاك) of the Greater World (العالم الأكبر)—which is everything other than the human according to the terminology of the group [Sufis]—and the Lesser World (العالم الأصغر), meaning the human, who is the spirit of the world, its cause, and its reason. His spheres are his spiritual stations (مقاماته), his movements, and the detailed classification of his levels (طبقاته). This is the entirety of what this chapter encompasses.\n\n### [The Human is a Lesser World]\n\nJust as the human is a lesser world (عالم صغير) by way of the body, so too is he humble (حقير) by way of origination (الحدوث). And deification (التأله) is valid for him because he is the vicegerent (خليفة) of Allah in the World (العالم), and the World is subjugated to him and deified, just as the human is deified for Allah the Exalted. Know that the most complete state of human existence (نشأة) is in the world (الدنيا). As for the Hereafter (الآخرة), every human from the two groups (the saved and the damned) is in a state of half-knowledge, not complete knowledge, for each group knows the opposite of its condition. The human is nothing but the believer and the disbeliever together: happiness and misery, bliss and torment, enjoying bliss and being tormented. For this reason, the knowledge of the world is more complete, while the Theophany (تجلى) of the Hereafter is higher. Understand this and unlock this mystery. We have a symbol for the one who is perceptive: it is the word *bashī‘ shanī‘* (بشيع شنيع - ugly, repulsive), yet its meaning is wondrous (بديع).\n\n> The spirit of the Greater Existence (الوجود الكبير)\n> Is this Lesser Existence (الوجود الصغير).\n> Were it not for him, He would not have said:\n> \"Indeed, I am the Great, the Powerful.\"\n> Let not my origination (حدوثي) veil you,\n> Nor annihilation (الفناء) and resurrection (النشور).\n> For if you contemplate me,\n> I am the Great Encompasser (المحيط الكبير).\n> To the Eternal (القديم) belongs my Essence (ذاتي),\n> And to the new belongs my manifestation (ظهور).\n> And Allah is Single, Eternal,\n> No deficiency afflicts Him.\n> And the Cosmos (الكون) is a new creation,\n> Captive in His two Hands.\n> Thus, from this came that I am\n> The humble Existence (الوجود الحقير).\n> And indeed, every existence\n> Revolves around my existence.\n> So my night is not like night,\n> Nor is my light like light.\n> So whoever says concerning a servant:\n> \"I am the poor servant,\"\n> Or says: \"Indeed, I am Existence,\"\n> \"I am the Knowing Existence.\"\n> Then confirm me as a king, you will find me,\n> Or a commoner who does not oppress.\n> O ignorant of my worth,\n> You are the All-Knowing, the All-Seeing.\n> Convey my existence from me,\n> And the saying is truth and falsehood.\n> And say to your people: \"Indeed, I am\n> The Merciful, the Forgiving.\"\n> And say that my torment\n> Is the destructive torment.\n> And say that I am weak,\n> I cannot walk.\n> So how can a person be blessed\n> By my hand, or perish?\n\n### Elaboration and Explanation of the Chapter, and from Allah is Support and Aid\n\n#### [The Four Existential Knowns]\n\nKnow that the Knowns (المعلومات) are four: The Real (الحق) the Exalted, Who is described by Absolute Existence (الوجود المطلق), because He, glory be to Him, is not caused by anything, nor is He a cause, but rather He is existent by His Essence (بذاته). Knowledge (العلم) of Him is expressed as knowledge of His Existence (وجوده), and His Existence is not other than His Essence (ذاته), although His Essence is not known. However, what is attributed to Him of the Attributes (الصفات) is known—meaning the Attributes of Meaning (صفات المعاني), which are the Attributes of Perfection. As for the knowledge of the Reality of the Essence (حقيقة الذات), it is forbidden; it is not known by proof, nor by rational demonstration, nor can it be defined. For He, glory be to Him, resembles nothing, and nothing resembles Him. So how can the one who resembles things know the One Whom nothing resembles and Who resembles nothing? Your Gnosis (معرفتك) of Him is only that: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him), and <<وَيُحَذِّرُكُمُ اللهُ نَفْسَهُ>> (And Allah warns you of Himself). And the prohibition against contemplating the Essence of Allah (ذات الله) has been transmitted in the Sacred Law (الشرع).\n\n#### [The Reality of Realities]\n\n(And the second Known) is the Universal Reality (الحقيقة الكلية), which belongs to the Real (الحق) and to the World (العالم). It is not described by Existence (الوجود) nor by non-existence (العدم), nor by origination (الحدوث) nor by eternity (القدم). It is eternal (قديمة) when described by the Eternal, and originated (محدثة) when described by the originated. The Knowns, both eternal and originated, are not known until this Reality is known, and this Reality does not exist until the things described by it exist. If something exists without prior non-existence, such as the Existence of the Real and His Attributes (صفاته), it is said to be an eternal existent (موجود قديم) because the Real is characterized by it. And if something exists from non-existence, such as the existence of what is other than Allah—which is the originated (المحدث) existing by another—it is said to be originated (محدثة). It is in every existent by its reality, for it does not accept division (التجزي); there is no whole or part in it. Its knowledge, stripped of form, cannot be attained by proof or demonstration. From this Reality, the World (العالم) came into existence through the mediation of the Real (الحق) the Exalted. Yet, it is not existent itself, lest the Real should have brought us into existence from an eternal existent, thereby establishing eternity for us. Likewise, you should also know that this Reality is not described by precedence over the World, nor is the World described by being subsequent to it. Rather, it is the origin of existents generally, and it is the origin of the Substance (الجوهر), the Sphere of Life (فلك الحياة), the Real created by Him (الحق المخلوق به), and other things. It is the intelligible encompassing sphere (الفلك المحيط المعقول). If you say it is the World, you speak truly; or if you say it is not the World, you speak truly; or if you say it is the Real, or it is not the Real, you speak truly. It accepts all of this. It multiplies with the multiplicity of the individuals of the World, and it is transcendent (تتنزه) with the transcendence of the Real. If you desire an example of it so that it may be closer to your understanding, look at the quality of woodness (العودية) in the piece of wood, the chair, the inkwell, the pulpit, and the coffin. Likewise, the quality of squareness (التربيع) and its likes in shapes, such as in every square—a house, a coffin, a piece of paper. The squareness and the woodness are present by their reality in every one of these individuals. Likewise, the colors: the whiteness of the garment, the jewel, the paper, the flour, and the paint, without the intelligible quality of whiteness in the garment being described as a part of it therein. Rather, its reality appeared in the garment just as it appeared in the paper. And likewise, Knowledge (العلم), Power (القدرة), Will (الإرادة), Hearing, Sight, and all things entirely. I have thus explained this Known to you, and we have elaborated upon it greatly in our book titled *The Creation of Tables and Circles* (إنشاء الجداول والدوائر). (And the third Known) is the entire World (العالم كله): the dominions (الأملاك), the spheres (الأفلاك), and the worlds they contain, the air, and the earth, and the world within them, which is the Greater Dominion (الملك الأكبر). (And the fourth Known) is the human, the vicegerent (الخليفة), whom Allah placed in this World, subjugated under his command. The Exalted said: <<وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ>> (And He has subjected to you whatever is in the heavens and whatever is on the earth—all from Him). Whoever knows these Knowns has no known thing left to seek. Of these, there is that whose Existence (وجوده) alone we know, which is the Real (الحق) the Exalted, and His Acts (أفعاله) and Attributes (صفاته) are known by way of examples. And of these, there is that which is known only by example, such as the knowledge of the Universal Reality (الحقيقة الكلية). And of these, there is that which is known by these two aspects, and by quiddity (الماهية) and quality (الكيفية), which are the World and the Human.\n\n### «Connection» [The Beginning of the World and its Model: The Dust and the Muhammadan Reality]\n\n\"Allah was, and there was nothing with Him.\" Then He included in it: \"And He is now as He was.\"\n\nHe was; no attribute that He did not possess reverted to Him from His bringing the World into existence. Rather, He was described for Himself and named before His creation by the Names (الأسماء) by which His creation calls upon Him. When He willed the existence of the World and initiated it according to what He knew by His knowledge of Himself, that sacred Will (الإرادة المقدسة) reacted through a type of Theophany (تجلي) from the Theophanies of Transcendence (تجليات التنزيه) toward the Universal Reality (الحقيقة الكلية). From this, a reality called the Dust (الهباء) reacted. It is in the position of the plaster cast used by the builder, so that He may open up in it whatever shapes and forms He wills. This is the first existent (أول موجود) in the World. Ali ibn Abi Talib (may Allah be pleased with him), Sahl ibn Abdullah (may Allah have mercy on him), and others among the People of Realization (أهل التحقيق), the People of Unveiling (أهل الكشف) and Existence (الوجود), have mentioned it. Then He, glory be to Him, disclosed Himself (تجلى) with His Light (نوره) to that Dust (الهباء), which the People of Intellect (أصحاب الأفكار) call the Universal Hyle (الهيولى الكل). The entire World is in it potentially (بالقوة) and with readiness (الصلاحية). So everything in that Dust accepted from Him, the Exalted, according to its potential and readiness, just as the corners of a house receive the light of a lamp. And according to its proximity to that Light, its brightness and acceptance intensify. The Exalted said: <<مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ>> (The example of His Light is like a niche wherein is a lamp). Thus, He likened His Light to the lamp. The one that was closest to Him in acceptance within that Dust was none other than the Reality of Muhammad (حقيقة محمد), peace and blessings be upon him, which is called the Intellect (العقل). Thus, he was the Master of the entire World and the first manifest in Existence (الوجود). His existence was from that Divine Light (النور الإلهي), from the Dust (الهباء), and from the Universal Reality (الحقيقة الكلية). And in the Dust, his essence (عينه) was found, and the essence of the World was found from his Theophany (تجليه). And the closest of people to him is Ali ibn Abi Talib and the secrets of all the Prophets.\n\nAs for the model (المثال) upon which the entire World came into existence without distinction, it is the Knowledge (العلم) subsisting in the Essence (نفس) of the Real (الحق) the Exalted. For He, glory be to Him, knew us by His knowledge of Himself, and He brought us into existence according to what He knew of us, and we are upon this specific form (الشكل المعين) in His Knowledge. If the matter were not so, we would have taken this form by chance, not by intention, because He would not have known it. And it is not possible for a form to emerge in Existence by chance. Were it not that this specific form was known to Allah, glory be to Him, and willed by Him, He would not have brought us into existence upon it. And He did not take this form from another, since it is established that He was, and nothing was with Him. Thus, it remains only that what manifested upon Him in His Essence (نفسه) of the form—His knowledge of Himself was His knowledge of us eternally (أزلا), not from non-existence. So His knowledge of us is likewise. Therefore, our model, which is the very essence of His knowledge of us, is eternal (قديم) by the eternity of the Real, because it is an Attribute (صفة) of His, and originated things do not subsist in His Essence. Allah is far exalted above that.\n\n#### [The Ultimate Purpose of the World]\n\nAs for our statement, \"Why did it come into existence and what is its ultimate purpose?\" Allah, the Mighty and Majestic, says: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me). Thus, He explicitly stated the reason for which He brought us into existence, and likewise the entire World. He specified us and the jinn by mention. The jinn here refers to everything concealed (مستتر), whether angel or otherwise. The Exalted said concerning the heavens and the earth: <<ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ>> (Come willingly or unwillingly. They both said: We have come willingly). Likewise, He said: <<فَأَبَيْنَ أَنْ يَحْمِلْنَهَا>> (But they refused to bear it). That was because it was an offer (عرضا). Had it been a command (أمرا), they would have obeyed and borne it, for disobedience is inconceivable from them; they were naturally disposed to obedience. The fiery jinn and mankind were not naturally disposed to that.\n\n#### [The Entire World is Living and Speaking]\n\nLikewise, among mankind, the People of Intellect (أصحاب الأفكار) who rely on speculation (النظر) and proofs limited to the senses, necessities, and axioms, say that the responsible being (المكلف) must necessarily be rational (عاقلا) such that he understands what he is addressed with. They spoke truly. And this is also the case with us: the entire World is rational, living, and speaking (حي ناطق), from the perspective of Unveiling (الكشف), by breaking the customary habit upon which people rely. I mean the attainment of this knowledge with us. However, they say, \"This is inanimate (جماد) and does not reason,\" and they stopped at what their sight granted them. The matter with us is contrary to that. So when it is reported from a Prophet that a stone spoke to him, or a sheep's shoulder, or a palm trunk, or an animal, they say that Allah created life and knowledge in it at that time. The matter with us is not like that. Rather, the secret of life is in the entire World. And that everything that hears the caller to prayer, whether moist or dry, bears witness for him. And none bears witness except one who knows this through Unveiling (كشف) with us, not through inference from speculation (نظر) based on the apparent meaning of a report or otherwise. Whoever wishes to grasp this, let him follow the path of the Men [of God] (طريق الرجال) and adhere to retreat (الخلوة) and remembrance (الذكر), for Allah will show him all of this directly (عينا), and he will know that people are in blindness regarding the realization of these Realities (الحقائق).\n\n#### [The Existence of the World is the Manifestation of the Dominion of the Names]\n\nHe, glory be to Him, brought the World into existence to manifest the dominion (سلطان) of the Names (الأسماء). For Power (قدرة) without an object of power, Existence (وجودا) without giving, a Provider (رازقا) without a provided, a Helper (مغيثا) without a helped, and a Merciful (رحيما) without a recipient of mercy—these are Realities whose effect is suspended (معطلة التأثير). He made the World in this life mixed, like the mixing of the two handfuls (القبضتين) in the dough. Then He separated the individuals from it, so that some of this entered into some of that, from each handful into its sister, and thus the states became unknown. In this, the scholars differed regarding the extraction of the foul from the good and the good from the foul. Its ultimate purpose is separation (التخليص) from this mixture (المزجة) and the distinction of the two handfuls, so that one is isolated in its world and the other in its world, as Allah the Exalted said: <<لِيَمِيزَ اللهُ الْخَبِيثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلَى بَعْضٍ فَيَرْكُمَهُ جَمِيعًا فَيَجْعَلَهُ فِي جَهَنَّمَ>> (So that Allah may distinguish the wicked from the good and put the wicked one upon another and heap them all together and place them in Hell). Whoever retains something of the mixture until he dies upon it will not be resurrected on the Day of Resurrection among the secure. Rather, some of them will be separated from the mixture during the Reckoning, and some will not be separated from it except in Hell. When they are separated, they will be brought out. These are the People of Intercession (أهل الشفاعة). As for the one who is distinguished here into one of the two handfuls, he will turn to the Hereafter with his reality, from his grave to bliss or to torment and Hellfire, for he has been separated. This is the ultimate purpose of the World. These two are realities that revert to an Attribute (صفة) that the Real (الحق) possesses in His Essence (ذاته). From this, we said that the People of the Fire see Him as tormenting, and the People of Paradise see Him as bestowing bliss. This is a noble secret that you may perhaps grasp in the Hereafter upon witnessing (المشاهدة), if Allah wills. The People of Realization (المحققون) have attained it in this world.\n\n#### [The Higher and Lower Worlds and their Counterparts in the Human]\n\nAs for our statement in this chapter, \"And the knowledge of the spheres (أفلاك) of the Greater World (العالم الأكبر) and the Lesser World (العالم الأصغر), which is the human,\" I mean by it the worlds of its universals (كلياته), its genera, and its princes who have influence over others. I have made them corresponding, this being a copy of that. We have drawn circles for them in the form and arrangement of the spheres in the book *The Creation of Tables and Circles* (إنشاء الدوائر والجداول), which we began composing in Tunis at the residence of Imam Abu Muhammad Abd al-Aziz, our patron and chosen friend, may Allah have mercy on him. Let us present from it in this chapter what is appropriate for this summary. We say that the Worlds (العوالم) are four: The Highest World (العالم الأعلى), which is the World of Subsistence (البقاء); then the World of Transformation (عالم الاستحالة), which is the World of Annihilation (الفناء); then the World of Construction (عالم التعمير), which is the World of Subsistence and Annihilation; and then the World of Relations (عالم النسب). These Worlds exist in two locations: in the Greater World (العالم الأكبر), which is everything outside the human, and in the Lesser World (العالم الأصغر), which is the human.\n\n(As for the Highest World): It is the Muhammadan Reality (الحقيقة المحمدية), and its sphere is Life (الحياة). Its counterpart in the human is the Subtle Essence (اللطيفة) and the Holy Spirit (الروح القدسي). Among them is the Encompassing Throne (العرش المحيط), and its counterpart in the human is the body (الجسم). And of that is the Footstool (الكرسي), and its counterpart in the human is the Soul (النفس). And of that is the Frequented House (البيت المعمور), and its counterpart in the human is the Heart (القلب). And of that are the Angels (الملائكة), and their counterpart in the human are the spirits (الأرواح) within him and the faculties (القوي). And of that is Saturn (زحل) and its sphere; its counterpart in the human is the cognitive faculty (القوة العلمية) and the soul (النفس). And of that is Jupiter (المشتري) and its sphere; their counterpart is the memorizing faculty (القوة الذاكرة) and the back of the brain. And of that is Mars (الأحمر) and its sphere; their counterpart is the rational faculty (القوة العاقلة) and the fontanelle (اليافوخ). And of that is the Sun (الشمس) and its sphere; their counterpart is the reflective faculty (القوة المفكرة) and the middle of the brain. Then Venus (الزهرة) and its sphere; their counterpart is the imaginative faculty (القوة الوهمية) and the animal spirit (الروح الحيواني). Then Mercury (الكاتب) and its sphere; their counterpart is the faculty of Imagination (القوة الخيالية) and the front of the brain. Then the Moon (القمر) and its sphere; their counterpart is the sensory faculty (القوة الحسية) and the limbs that sense. These are the levels of the Highest World and their counterparts in the human.\n\n(As for the World of Transformation [عالم الاستحالة]): Of that is the sphere of the Aether (كرة الأثير), and its spirit is heat and dryness, which is the sphere of Fire. Its counterpart is the yellow bile (الصفراء), and its spirit is the digestive faculty (القوة الهاضمة). And of that is the Air (الهواء), and its spirit is heat and moisture. Its counterpart is the blood (الدم), and its spirit is the attractive faculty (القوة الجاذبة). And of that is the Water (الماء), and its spirit is coldness and moisture. Its counterpart is the phlegm (البلغم), and its spirit is the repulsive faculty (القوة الدافعة). And of that is the Earth (التراب), and its spirit is coldness and dryness. Its counterpart is the black bile (السوداء), and its spirit is the retentive faculty (القوة الماسكة). As for the Earth, it has seven layers: black earth, dusty earth, red earth, yellow earth, white earth, blue earth, and green earth. The counterparts of these seven in the human body are the skin, fat, flesh, veins, nerves, muscles, and bones.\n\n(As for the World of Construction [عالم التعمير]): Of them are the spiritual beings (الروحانيون); their counterpart is the faculties (القوي) in the human. And of them is the animal world (عالم الحيوان); its counterpart is what senses in the human. And of them is the plant world (عالم النبات); its counterpart is what grows in the human. And of that is the inanimate world (عالم الجماد); its counterpart is what does not sense in the human.\n\n(As for the World of Relations [عالم النسب]): Of them is Accident (العرض); its counterpart is black and white, colors, and occurrences (الأكوان). Then Quality (الكيف); its counterpart is states, such as the healthy and the sick. Then Quantity (الكم); its counterpart is the leg being longer than the forearm. Then Where (الأين); its counterpart is the neck being a place for the head, and the leg being a place for the thigh. Then Time (الزمان); its counterpart is \"I moved my head at the time I moved my hand.\" Then Relation (الإضافة); its counterpart is \"This is my father, so I am his son.\" Then Position (الوضع); its counterpart is my language and my melody. Then To Act (أن يفعل); its counterpart is \"I ate.\" Then To Be Acted Upon (أن ينفعل); its counterpart is \"I became full.\" And of them is the difference in forms in the mothers, such as the elephant, the donkey, the lion, and the cricket. The counterpart of this is the human faculty (القوة الإنسانية) that accepts conceptual forms (الصور المعنوية), whether blameworthy or praiseworthy: \"This one is perceptive, so he is an elephant.\" \"This one is dull, so he is a donkey.\" \"This one is brave, so he is a lion.\" \"This one is cowardly, so he is a cricket.\" And <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "(باب ششم) روحانی تخلیق (الخلق الروحاني) کے آغاز کی معرفت میں\n\n(بسم اللہ الرحمن الرحیم) اور اس میں سب سے پہلی موجود شے کیا ہے، اور وہ کس چیز سے وجود میں آئی، اور کس چیز میں وجود میں آئی، اور کس مثال پر وجود میں آئی، اور کیوں وجود میں آئی، اور اس کی غایت کیا ہے، اور عالم اکبر اور عالم اصغر کے افلاک کی معرفت۔\n\nدیکھو اس محکم ہستی (الوجود) کو\nاور ہماری ہستی (وجودنا) اس منقش چادر کی مانند ہے\nاور دیکھو اس کے خلفاء کو ان کی بادشاہت میں\nخواہ وہ فصیح، شیریں زبان ہو یا گونگا\nان میں سے کوئی بھی اپنے معبود سے محبت نہیں کرتا\nمگر یہ کہ وہ اسے درہم کی محبت سے ملا دیتا ہے\nتو کہا جاتا ہے کہ یہ معرفت (المعرفۃ) کا بندہ ہے اور وہ\nجنت کا بندہ ہے اور یہ جہنم کے بندے ہیں\nسوائے قلیل میں سے قلیل کے، کیونکہ وہ\nاس (حق) کے نشے میں ہیں، بغیر کسی وہم کے احساس کے\nوہ اللہ کے بندے ہیں، ان کے بارے میں کوئی نہیں جانتا\nسوائے اس کے، نہ کہ انعام دینے والے کے بندے\nپس اس نے انہیں فائدہ پہنچایا جب اس نے ان کی واپسی کا ارادہ کیا\nان کے قصوروں کی طرف، ہر مبہم علم سے\nبسیط حقائق میں مقدم (اول) کا علم تنہا\nاور اس کی بنیاد جو اس سے منقطع نہیں ہوئی\nاور اس ظرف کی حقیقت جسے میں نے چھپا رکھا ہے\nاس کے ہم مثلوں سے، اور اس کی مثال پوشیدہ نہیں ہے\nاور اس سبب کا علم جس کے لیے وجود میں آئی\nقدیم ترین طرز پر عالموں کی اصل\nاور اس امر کی انتہا جس کی کوئی غایت نہیں\nجسے عظیم ترین، سب سے بڑا (الحق) اس میں جانتا ہے\nاور ہستی (الوجود) کے افلاک کے علوم، اس کے بڑے\nاور چھوٹے، مگر اس پر جو قابلِ مذمت نہیں\nیہ وہ علوم ہیں جن کے کشف (الکشف) کی تصدیق ہو جائے\nتو وہ دلوں کو سیدھے راستے کی طرف رہنمائی کرتے ہیں\nپس تمام تعریفیں اس اللہ کے لیے ہیں جس کے لیے میں جمع کر رہا ہوں\nان کے علوم کو اور اس علم کو جو معلوم نہیں ہے۔\n\n### [اجمالی انداز میں بیان کا اختصار]\n\nتخلیق کا آغاز ہباء (الہباء) سے ہوا، اور اس میں سب سے پہلی موجود شے حقیقت محمدیہ رحمانیہ (الحقیقۃ المحمدیۃ) ہے، اور کوئی جگہ اسے محدود نہیں کر سکتی کیونکہ وہ تحیز (جگہ گھیرنے) سے پاک ہے۔ اور وہ کس چیز سے وجود میں آئی؟ وہ اس معلوم حقیقت سے وجود میں آئی جو نہ ہستی (الوجود) سے متصف ہے اور نہ عدم سے، اور کس چیز میں وجود میں آئی؟ ہباء (الہباء) میں۔ اور کس مثال پر وجود میں آئی؟ ذات حق (الحق) کے نفس میں معلوم صورت پر۔ اور کیوں وجود میں آئی؟ حقائق الٰہیہ کے اظہار کے لیے۔ اور اس کی غایت کیا ہے؟ آمیزش سے چھٹکارا حاصل کرنا، تاکہ ہر عالم اپنے خالق سے اپنا حصہ بغیر کسی آمیزش کے جان لے، پس اس کی غایت اس کے حقائق کا اظہار ہے۔ اور عالم اکبر کے افلاک کی معرفت، جو جماعت کی اصطلاح میں انسان کے علاوہ سب کچھ ہے، اور عالم اصغر یعنی انسان، جو عالم کی روح، اس کی علت اور اس کا سبب ہے، اور اس کے افلاک اس کے مقامات اور اس کی حرکات اور اس کے طبقات کی تفصیل ہیں۔ پس یہ سب کچھ ہے جو اس باب میں شامل ہے۔\n\n### [انسان عالم صغیر ہے]\n\nپس جس طرح انسان جسم کے لحاظ سے ایک عالم صغیر ہے، اسی طرح وہ حدوث (پیدائش) کے لحاظ سے بھی حقیر ہے۔ اور اس کے لیے الوہیت کا حق اس لیے ثابت ہوا کہ وہ عالم میں اللہ کا خلیفہ ہے، اور عالم اس کے لیے مسخر ہے اور اس کا معبود ہے، جس طرح انسان اللہ تعالیٰ کا معبود ہے۔ اور جان لو کہ انسان کی سب سے کامل نشوونما دنیا میں ہی ہے، اور جہاں تک آخرت کا تعلق ہے، تو دونوں گروہوں میں سے ہر انسان حال میں نصف پر ہے نہ کہ علم میں، کیونکہ ہر گروہ اپنے حال کے برعکس کو جانتا ہے۔ پس انسان مومن اور کافر دونوں ہی ہے، سعادت اور شقاوت، نعمت اور عذاب، انعام پانے والا اور عذاب دیا جانے والا۔ اسی لیے دنیا کی معرفت (المعرفۃ) زیادہ مکمل ہے اور آخرت کا ظہور الٰہی (التجلی) بلند تر ہے۔ پس سمجھو اور اس قفل کو کھولو۔ اور ہمارے پاس اس کے لیے ایک رمز ہے جو غور کرے، اور وہ لفظ \"بشیع شنیع\" ہے، جس کا معنی \"بدیع\" (انوکھا) ہے۔\n\nوجود اکبر کی روح\nیہ وجود صغیر ہے\nاگر وہ نہ ہوتا تو وہ نہ کہتا کہ میں\nمیں ہی کبیر و قدیر ہوں\nمیری حدوث (پیدائش) تمہیں پردے میں نہ ڈالے\nاور نہ فنا (الفناء) اور حشر\nکیونکہ اگر تم مجھ پر غور کرو\nتو میں ہی محیط کبیر ہوں\nپس میری ذات کے لیے قدامت ہے\nاور جدید کے لیے ظہور\nاور اللہ یکتا، قدیم ہے\nاسے کوئی کمی لاحق نہیں ہوتی\nاور کائنات ایک نئی تخلیق ہے\nجو اس کی دو مٹھیوں میں قید ہے\nتو اس سے یہ نتیجہ نکلا کہ میں\nمیں ہی حقیر وجود ہوں\nاور ہر وجود\nمیرے وجود کے گرد گھومتا ہے\nپس نہ میری رات رات ہے\nاور نہ میرا نور نور ہے\nتو جو کوئی بندے کے بارے میں کہے\nکہ میں فقیر بندہ ہوں\nیا کہے کہ میں وجود ہوں\nمیں ہی وجود خبیر ہوں\nتو مجھے بادشاہ بناؤ، تم مجھے پاؤ گے\nیا ایک عام آدمی جو ظلم نہیں کرتا\nاے میری قدر سے ناواقف!\nتو ہی علیم و بصیر ہے\nمیری ہستی (وجود) کو میری طرف سے پہنچا دے\nاور یہ قول سچ بھی ہے اور جھوٹ بھی\nاور اپنی قوم سے کہہ کہ میں\nمیں ہی رحیم و غفور ہوں\nاور کہہ کہ میرا عذاب\nہی ہلاک کرنے والا عذاب ہے\nاور کہہ کہ میں کمزور ہوں\nمیں چل نہیں سکتا\nتو کیسے کوئی شخص\nمیرے ہاتھ سے نعمت پائے گا یا ہلاک ہو گا؟\n\n### باب کی تفصیل اور بیان، اور اللہ ہی کی طرف سے تائید اور مدد ہے [چار وجودی معلومات]\n\nجان لو کہ معلومات چار ہیں: ذات حق (الحق) تعالیٰ، اور وہ ہستی مطلق (الوجود المطلق) سے متصف ہے، کیونکہ وہ سبحانہ و تعالیٰ نہ کسی چیز کا معلول ہے اور نہ علت، بلکہ وہ اپنی ذات سے موجود ہے۔ اور اس کا علم اس کی ہستی (الوجود) کے علم کا نام ہے، اور اس کی ہستی اس کی ذات کے سوا کچھ نہیں، اگرچہ اس کی ذات معلوم نہیں ہے، لیکن وہ صفات جو اس کی طرف منسوب ہیں، یعنی صفاتِ معانی جو صفاتِ کمال ہیں، وہ معلوم ہیں۔ اور جہاں تک ذات کی حقیقت کا علم ہے، تو وہ ممنوع ہے، نہ دلیل سے معلوم ہو سکتا ہے اور نہ عقلی برہان سے، اور نہ کوئی حد اسے گھیر سکتی ہے، کیونکہ وہ سبحانہ و تعالیٰ نہ کسی چیز سے مشابہت رکھتا ہے اور نہ کوئی چیز اس سے مشابہت رکھتی ہے۔ تو جو چیزوں سے مشابہت رکھتا ہے وہ اسے کیسے جان سکتا ہے جو کسی چیز سے مشابہت نہیں رکھتا اور نہ وہ کسی چیز سے مشابہت رکھتا ہے؟ پس تمہاری معرفت (المعرفۃ) اس کے بارے میں صرف یہ ہے کہ:\n**لَيْسَ كَمِثْلِهِ شَيْءٌ** (اس جیسی کوئی چیز نہیں)\nاور **وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ** (اور اللہ تمہیں اپنی ذات سے ڈراتا ہے)۔\nاور شرع میں ذاتِ الٰہی میں غور و فکر کرنے سے منع کیا گیا ہے۔\n\n### [حقیقۃ الحقائق]\n\n(اور دوسری معلوم شے) وہ حقیقت کلیہ (حقیقۃ الحقائق) ہے جو ذات حق (الحق) اور عالم دونوں کے لیے ہے، جو نہ ہستی (الوجود) سے متصف ہے اور نہ عدم سے، نہ حدوث سے اور نہ قدم سے۔ جب قدیم اس سے متصف ہو تو وہ قدیم ہوتی ہے، اور جب محدث اس سے متصف ہو تو وہ محدث ہوتی ہے۔ معلومات، خواہ قدیم ہوں یا جدید، اس وقت تک معلوم نہیں ہو سکتیں جب تک یہ حقیقت معلوم نہ ہو جائے، اور یہ حقیقت اس وقت تک موجود نہیں ہو سکتی جب تک وہ اشیاء موجود نہ ہو جائیں جو اس سے متصف ہیں۔ پس اگر کوئی شے بغیر کسی سابقہ عدم کے موجود ہو، جیسے ذات حق (الحق) اور اس کی صفات کی ہستی (الوجود)، تو اس میں قدیم موجود کہا جاتا ہے کیونکہ ذات حق (الحق) اس سے متصف ہے۔ اور اگر کوئی شے عدم سے موجود ہو، جیسے اللہ کے سوا ہر چیز کی ہستی (الوجود)، جو کہ محدث ہے اور دوسرے کے ذریعے موجود ہے، تو اس میں محدث کہا جاتا ہے۔ اور وہ ہر موجود میں اپنی حقیقت کے ساتھ موجود ہے، کیونکہ وہ تقسیم کو قبول نہیں کرتی، پس اس میں نہ کل ہے اور نہ جز۔ اور اس کی معرفت (المعرفۃ) تک، جو صورت سے مجرد ہو، نہ دلیل سے پہنچا جا سکتا ہے اور نہ برہان سے۔ پس اسی حقیقت سے عالم ذات حق (الحق) تعالیٰ کے واسطے سے وجود میں آیا، اور وہ خود موجود نہیں ہے، تاکہ یہ نہ ہو کہ حق نے ہمیں کسی قدیم موجود سے پیدا کیا ہو اور ہمارے لیے بھی قدامت ثابت ہو جائے۔ اور اسی طرح یہ بھی جان لو کہ یہ حقیقت نہ عالم پر تقدم سے متصف ہے اور نہ عالم اس سے تاخر سے، بلکہ یہ عموماً موجودات کی اصل ہے، اور یہ جوہر کی اصل، فلکِ حیات، اور وہ حق ہے جس کے ذریعے تخلیق کی گئی، اور اس کے علاوہ بھی۔ اور یہ فلکِ محیط معقول ہے۔ اگر تم کہو کہ یہ عالم ہے تو تم سچے ہو، یا یہ کہو کہ یہ عالم نہیں ہے تو تم سچے ہو، یا یہ کہو کہ یہ حق ہے یا حق نہیں ہے تو تم سچے ہو۔ یہ ان سب کو قبول کرتی ہے، اور عالم کے افراد کی کثرت سے کثیر ہو جاتی ہے، اور ذات حق (الحق) کے تنزیہ سے پاک ہو جاتی ہے۔ اور اگر تم اس کی مثال چاہتے ہو تاکہ تمہاری سمجھ کے قریب ہو جائے، تو لکڑی، کرسی، دوات، منبر اور تابوت میں \"لکڑی پن\" (عودیہ) کو دیکھو۔ اسی طرح اشکال میں \"چوکور پن\" (تربیع) اور اس کی مثالیں، مثلاً گھر، تابوت اور کاغذ میں۔ اور \"چوکور پن\" اور \"لکڑی پن\" اپنی حقیقت کے ساتھ ان میں سے ہر شخص میں موجود ہیں۔ اسی طرح رنگ، کپڑے، جوہر، کاغذ، آٹے اور تیل کی سفیدی، اس کے بغیر کہ کپڑے میں معقول سفیدی اس کا کوئی جزو ہو، بلکہ اس کی حقیقت کپڑے میں اسی طرح ظاہر ہوئی ہے جیسے کاغذ میں۔ اور اسی طرح علم، قدرت، ارادہ، سماعت اور بصارت اور تمام اشیاء۔ پس میں نے تمہارے لیے یہ معلوم شے بیان کر دی ہے، اور ہم نے اپنی کتاب \"انشاء الجداول والدوائر\" میں اس پر بہت تفصیل سے بات کی ہے۔ (اور تیسری معلوم شے) وہ پورا عالم ہے، املاک اور افلاک اور جو کچھ وہ عالموں، ہوا اور زمین میں رکھتے ہیں، اور جو کچھ ان دونوں میں ہے، اور یہی ملک اکبر ہے۔ (اور چوتھی معلوم شے) وہ انسان خلیفہ ہے جسے اللہ نے اس عالم میں رکھا ہے جو اس کے تسخیر کے تحت مغلوب ہے۔ اللہ تعالیٰ فرماتا ہے:\n**وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِّنْهُ** (اور اس نے تمہارے لیے وہ سب کچھ مسخر کر دیا جو آسمانوں میں ہے اور جو زمین میں ہے، سب کچھ اپنی طرف سے)۔\nپس جس نے ان معلومات کو جان لیا، اس کے لیے کوئی معلوم شے باقی نہیں رہتی جسے وہ طلب کرے۔ ان میں سے کچھ ایسی ہیں جن کی ہم صرف ہستی (الوجود) کو جانتے ہیں، اور وہ ذات حق (الحق) تعالیٰ ہے، اور اس کے افعال اور صفات کو مثالوں کے ذریعے جانتے ہیں۔ اور ان میں سے کچھ ایسی ہیں جو صرف مثال کے ذریعے معلوم ہوتی ہیں، جیسے حقیقت کلیہ (حقیقۃ الحقائق) کا علم۔ اور ان میں سے کچھ ایسی ہیں جو ان دونوں طریقوں سے اور ماہیت و کیفیت کے ذریعے معلوم ہوتی ہیں، اور وہ عالم اور انسان ہیں۔\n\n### «فصل» [عالم کا آغاز اور اس کی مثال: ہباء (الہباء) اور حقیقت محمدیہ (الحقیقۃ المحمدیۃ)]\n\nاللہ تھا اور اس کے ساتھ کچھ نہیں تھا۔\nپھر اس میں یہ بات شامل کی گئی:\nاور وہ اب بھی ویسا ہی ہے جیسا وہ تھا۔\nعالم کو وجود میں لانے سے اس کی طرف کوئی ایسی صفت واپس نہیں لوٹی جس پر وہ پہلے نہ تھا، بلکہ وہ اپنی ذات کے لیے موصوف تھا اور اپنی مخلوق کی تخلیق سے پہلے ان ناموں سے موسوم تھا جن سے اس کی مخلوق اسے پکارتی ہے۔ پس جب اس نے عالم کے وجود کا ارادہ کیا اور اس کا آغاز اس حد پر کیا جو اس نے اپنے نفس کے علم سے جانا تھا، تو اس مقدس ارادے سے تنزیہ کے ظہورات (التجلیات) میں سے ایک ظہور (التجلی) کے ذریعے حقیقت کلیہ (حقیقۃ الحقائق) کی طرف انفعال ہوا، اور اس سے ایک حقیقت وجود میں آئی جسے ہباء (الہباء) کہا جاتا ہے۔ یہ اس گچ کی طرح ہے جسے معمار ڈالتا ہے تاکہ اس میں اپنی مرضی کی شکلیں اور صورتیں کھولے۔ اور یہ عالم میں سب سے پہلی موجود شے ہے، اور اس کا ذکر علی بن ابی طالب رضی اللہ عنہ اور سہل بن عبداللہ رحمہ اللہ اور دیگر اہل تحقیق، اہل کشف (الکشف) اور اہل ہستی (الوجود) نے کیا ہے۔ پھر اس نے سبحانہ و تعالیٰ نے اپنے نور کے ساتھ اس ہباء (الہباء) کی طرف تجلی (التجلی) فرمائی، اور اہل فکر اسے ہیولیٰ کل کہتے ہیں، اور پورا عالم اس میں بالقوہ اور صلاحیت کے ساتھ موجود تھا۔ پس اس ہباء (الہباء) میں ہر چیز نے اپنی قوت اور استعداد کے مطابق اس (حق) تعالیٰ سے قبول کیا، جیسے گھر کے کونے چراغ کے نور کو قبول کرتے ہیں، اور اس نور سے قربت کے بقدر اس کی روشنی اور قبولیت بڑھ جاتی ہے۔ اللہ تعالیٰ فرماتا ہے:\n**مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ** (اس کے نور کی مثال ایسی ہے جیسے ایک طاق ہو جس میں چراغ ہو)۔\nپس اس نے اپنے نور کو چراغ سے تشبیہ دی۔\nپس اس ہباء (الہباء) میں قبولیت کے لحاظ سے اس (حق) کے سب سے قریب حقیقت محمد صلی اللہ علیہ وسلم تھی، جسے عقل کہا جاتا ہے۔ پس وہ پورے عالم کے سردار تھے اور ہستی (الوجود) میں سب سے پہلے ظاہر ہونے والے تھے۔ پس ان کی ہستی (الوجود) اس نور الٰہی سے، ہباء (الہباء) سے، اور حقیقت کلیہ (حقیقۃ الحقائق) سے تھی، اور ہباء (الہباء) میں ان کی ذات اور عالم کی ذات ان کی تجلی (التجلی) سے وجود میں آئی۔ اور ان کے سب سے قریب علی بن ابی طالب اور تمام انبیاء کے اسرار ہیں۔ اور جہاں تک اس مثال کا تعلق ہے جس پر پورا عالم بغیر کسی تفصیل کے وجود میں آیا، تو وہ ذات حق (الحق) تعالیٰ کے نفس میں قائم علم ہے۔ کیونکہ اس نے سبحانہ و تعالیٰ نے ہمیں اپنے نفس کے علم سے جانا اور ہمیں اس حد پر وجود میں لایا جو اس نے ہمیں جانا تھا۔ اور ہم اس کی علم میں اسی معین شکل پر ہیں۔ اور اگر معاملہ ایسا نہ ہوتا تو ہم یہ شکل اتفاق سے اختیار کرتے، نہ کہ قصد سے، کیونکہ وہ اسے نہیں جانتا۔ اور ہستی (الوجود) میں کوئی صورت اتفاق کے حکم سے ظاہر نہیں ہو سکتی۔ پس اگر یہ معین شکل اللہ سبحانہ و تعالیٰ کے لیے معلوم اور مراد نہ ہوتی تو وہ ہمیں اس پر وجود میں نہ لاتا۔ اور اس نے یہ شکل کسی اور سے نہیں لی، کیونکہ یہ ثابت ہو چکا ہے کہ وہ تھا اور اس کے ساتھ کچھ نہیں تھا۔ پس صرف یہی باقی رہا کہ جو صورت اس کے نفس میں ظاہر ہوئی، تو اس کا اپنے نفس کا علم ہی ازل سے ہمارا علم تھا، نہ کہ عدم سے۔ پس ہمارا علم بھی اسی طرح ہے۔ پس ہماری مثال، جو کہ ہمارا عین علم ہے، ذات حق (الحق) کی قدامت کے ساتھ قدیم ہے، کیونکہ وہ اس کی صفت ہے، اور حوادث اس کے نفس میں قائم نہیں ہوتے، اللہ اس سے بلند و برتر ہے۔\n\n### [عالم کی غایت]\n\nاور جہاں تک ہمارے اس قول کا تعلق ہے کہ وہ کیوں وجود میں آیا اور اس کی غایت کیا ہے، تو اللہ عزوجل فرماتا ہے:\n**وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ** (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا)۔\nپس اس نے اس سبب کو واضح کر دیا جس کے لیے اس نے ہمیں وجود میں لایا، اور اسی طرح پورا عالم۔ اور اس نے جنوں کو خاص طور پر ذکر کیا، اور یہاں جن سے مراد ہر وہ پوشیدہ شے ہے، خواہ فرشتہ ہو یا کوئی اور۔ اور اس نے آسمانوں اور زمین کے حق میں فرمایا:\n**ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ** (تم دونوں خوشی سے آؤ یا ناخوشی سے۔ دونوں نے کہا: ہم فرمانبردار ہو کر حاضر ہیں)۔\nاور اسی طرح فرمایا:\n**فَأَبَيْنَ أَن يَحْمِلْنَهَا** (تو انہوں نے اسے اٹھانے سے انکار کر دیا)۔\nاور یہ اس لیے تھا کہ وہ ایک عرض (پیشکش) تھی، لیکن اگر وہ حکم ہوتا تو وہ اطاعت کرتے اور اسے اٹھا لیتے، کیونکہ ان سے نافرمانی کا تصور نہیں کیا جا سکتا، وہ اسی پر جبلت کیے گئے ہیں۔ اور ناری جن اور انسان اس پر جبلت نہیں کیے گئے۔\n\n### [پورا عالم زندہ اور ناطق ہے]\n\nاور اسی طرح انسانوں میں سے اہل فکر، جو نظر اور دلائل کے حامل ہیں اور حواس، ضروریات اور بدیہیات پر محدود ہیں، کہتے ہیں کہ مکلف کا عاقل ہونا ضروری ہے تاکہ وہ سمجھے کہ اسے کیا خطاب کیا جا رہا ہے، اور انہوں نے سچ کہا۔ اور ہمارے نزدیک بھی معاملہ ایسا ہی ہے، پورا عالم عاقل، زندہ اور ناطق ہے، کشف (الکشف) کے ذریعے اس عادت کو توڑتے ہوئے جس پر لوگ قائم ہیں، یعنی ہمارے نزدیک اس علم کا حصول۔ لیکن انہوں نے کہا کہ یہ جمادات ہیں جو عقل نہیں رکھتے، اور وہ اس پر رک گئے جو ان کی بصارت نے انہیں دیا۔ اور ہمارے نزدیک معاملہ اس کے برعکس ہے۔ پس جب کسی نبی سے یہ بات آتی ہے کہ کسی پتھر نے، یا بکری کے شانے نے، یا کھجور کے تنے نے، یا کسی چوپائے نے اس سے بات کی، تو وہ کہتے ہیں کہ اللہ نے اس وقت اس میں زندگی اور علم پیدا کر دیا۔ اور ہمارے نزدیک معاملہ ایسا نہیں ہے، بلکہ زندگی کا راز پورے عالم میں موجود ہے، اور ہر تر اور خشک چیز جو مؤذن کو سنتی ہے، اس کے حق میں گواہی دیتی ہے، اور گواہی صرف وہی دیتا ہے جس نے یہ علم ہمارے نزدیک کشف (الکشف) کے ذریعے حاصل کیا ہو، نہ کہ کسی ظاہری خبر یا کسی اور چیز کے تقاضے سے استنباط کے ذریعے۔ اور جو شخص اس پر مطلع ہونا چاہتا ہے، تو وہ مردانِ حق کا راستہ اختیار کرے اور خلوت اور ذکر کو لازم پکڑے، کیونکہ اللہ اسے ان سب پر عینی طور پر مطلع کر دے گا، تو وہ جان لے گا کہ لوگ ان حقائق کے ادراک سے اندھے ہیں۔\n\n### [علم کا وجود، اسماء کے سلطان کا ظہور]\n\nپس اس نے سبحانہ و تعالیٰ نے عالم کو اس لیے وجود میں لایا تاکہ اسماء (الٰہیہ) کا سلطان ظاہر ہو، کیونکہ مقدور کے بغیر قدرت، عطا کے بغیر ہستی (الوجود)، مرزوق کے بغیر رازق، مغاث کے بغیر مغیث، اور مرحوم کے بغیر رحیم، یہ سب حقائق ہیں جن کا اثر معطل ہے۔ اور اس نے دنیا میں عالم کو گوندھے ہوئے آٹے میں دو مٹھیوں کی آمیزش کی طرح ملا دیا، پھر ان میں سے افراد کو الگ کیا، تو ہر مٹھی سے دوسری مٹھی میں داخل ہو گیا، پس احوال مجہول ہو گئے۔ اور اسی میں علماء نے خبیث کو طیب سے اور طیب کو خبیث سے نکالنے میں فضیلت حاصل کی۔ اور اس کی غایت اس آمیزش سے چھٹکارا حاصل کرنا اور دونوں مٹھیوں کو ممتاز کرنا ہے، تاکہ یہ اپنے عالم کے ساتھ اور وہ اپنے عالم کے ساتھ منفرد ہو جائے، جیسا کہ اللہ تعالیٰ نے فرمایا:\n**لِيَمِيزَ اللَّهُ الْخَبِيثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلَى بَعْضٍ فَيَرْكُمَهُ جَمِيعًا فَيَجْعَلَهُ فِي جَهَنَّمَ** (تاکہ اللہ خبیث کو طیب سے الگ کر دے، اور خبیث کو ایک دوسرے پر رکھ کر سب کو اکٹھا کر دے، پھر اسے جہنم میں ڈال دے)۔\nپس جس میں آمیزش کا کچھ حصہ باقی رہا یہاں تک کہ وہ اسی پر مر گیا، تو وہ قیامت کے دن امن پانے والوں میں سے نہیں اٹھایا جائے گا، بلکہ ان میں سے کچھ ایسے ہیں جو حساب کے وقت آمیزش سے چھٹکارا پائیں گے، اور کچھ ایسے ہیں جو جہنم میں جا کر ہی اس سے چھٹکارا پائیں گے۔ پس جب وہ چھٹکارا پا لیں گے تو نکال لیے جائیں گے، اور یہی لوگ اہل شفاعت ہیں۔ اور جس نے یہاں دونوں مٹھیوں میں سے کسی ایک میں امتیاز حاصل کر لیا، تو وہ اپنی حقیقت کے ساتھ اپنی قبر سے دار آخرت میں نعمت یا عذاب اور جہنم کی طرف پلٹے گا، کیونکہ وہ چھٹکارا پا چکا ہے۔ پس یہ عالم کی غایت ہے، اور یہ دو حقائق ہیں جو اس صفت کی طرف لوٹتی ہیں جس پر ذات حق (الحق) اپنی ذات میں قائم ہے۔ اور اسی سے ہم نے کہا کہ اہل نار اسے عذاب دینے والا دیکھیں گے اور اہل جنت اسے نعمت دینے والا دیکھیں گے۔ اور یہ ایک شریف راز ہے جس پر شاید تم دار آخرت میں مشاہدہ کے وقت مطلع ہو جاؤ گے، اگر اللہ نے چاہا، اور محققین نے اسے اسی دنیا میں حاصل کر لیا ہے۔\n\n### [عالم علوی اور سفلی اور ان کے انسان سے مماثلتیں]\n\nاور جہاں تک اس باب میں ہمارے اس قول کا تعلق ہے کہ عالم اکبر اور عالم اصغر جو کہ انسان ہے، کے افلاک کی معرفت، تو اس سے میری مراد اس کے کلیات کے عالم، اس کی انواع اور اس کے وہ امراء ہیں جو دوسروں پر اثر انداز ہوتے ہیں۔ اور میں نے انہیں ایک دوسرے کے مقابل رکھا ہے، یہ اس کی نقل ہے۔ اور ہم نے اپنی کتاب \"انشاء الدوائر والجداول\" میں ان کے لیے افلاک کی صورتوں اور ان کی ترتیب پر دائرے بنائے ہیں، جس کی تالیف ہم نے تونس میں اپنے ولی اور صفی امام ابو محمد عبدالعزیز رحمہ اللہ کے مقام پر شروع کی تھی۔ پس ہم اس میں سے اس باب میں وہ کچھ پیش کرتے ہیں جو اس مختصر کے لائق ہے۔ تو ہم کہتے ہیں کہ عالم چار ہیں: عالم اعلیٰ، جو عالم بقا (البقاء) ہے؛ پھر عالم استحالت، جو عالم فنا (الفناء) ہے؛ پھر عالم تعمیر، جو عالم بقا (البقاء) اور فنا (الفناء) ہے؛ پھر عالم نسب۔ اور یہ عوالم دو مقامات پر ہیں: عالم اکبر میں، جو انسان سے باہر ہے، اور عالم اصغر میں، جو انسان ہے۔ (جہاں تک عالم اعلیٰ کا تعلق ہے) تو وہ حقیقت محمدیہ (الحقیقۃ المحمدیۃ) ہے اور اس کا فلک حیات ہے، انسان میں اس کا نظیر لطیفہ اور روح قدسی ہے۔ اور ان میں سے عرش محیط ہے، اور انسان میں اس کا نظیر جسم ہے۔ اور ان میں سے کرسی ہے، اور انسان میں اس کا نظیر نفس ہے۔ اور ان میں سے بیت المعمور ہے، اور انسان میں اس کا نظیر قلب ہے۔ اور ان میں سے ملائکہ ہیں، اور انسان میں ان کا نظیر وہ ارواح اور قوتیں ہیں جو اس میں ہیں۔ اور ان میں سے زحل اور اس کا فلک ہے، انسان میں اس کا نظیر قوت علمیہ اور نفس ہے۔ اور ان میں سے مشتری اور اس کا فلک ہے، ان کا نظیر قوت ذاکرہ اور دماغ کا پچھلا حصہ ہے۔ اور ان میں سے مریخ (الاحمر) اور اس کا فلک ہے، ان کا نظیر قوت عاقلہ اور یافوخ (تالو) ہے۔ اور ان میں سے سورج اور اس کا فلک ہے، ان کا نظیر قوت مفکرہ اور دماغ کا درمیانی حصہ ہے۔ پھر زہرہ اور اس کا فلک ہے، ان کا نظیر قوت واہمہ اور روح حیوانی ہے۔ پھر عطارد (الکاتب) اور اس کا فلک ہے، ان کا نظیر قوت خیالیہ اور دماغ کا اگلا حصہ ہے۔ پھر چاند اور اس کا فلک ہے، ان کا نظیر قوت حسیہ اور وہ جوارح ہیں جو محسوس کرتے ہیں۔ پس یہ عالم اعلیٰ کے طبقات اور انسان میں ان کے نظائر ہیں۔ (اور جہاں تک عالم استحالت کا تعلق ہے) تو ان میں سے کرہ اثیر ہے اور اس کی روح حرارت اور خشکی ہے، اور یہ کرہ نار ہے۔ اور انسان میں اس کا نظیر صفرا (پت) ہے اور اس کی روح قوت ہاضمہ ہے۔ اور ان میں سے ہوا ہے اور اس کی روح حرارت اور رطوبت ہے، اور انسان میں اس کا نظیر خون ہے اور اس کی روح قوت جاذبہ ہے۔ اور ان میں سے پانی ہے اور اس کی روح ٹھنڈک اور رطوبت ہے، انسان میں اس کا نظیر بلغم ہے اور اس کی روح قوت دافعہ ہے۔ اور ان میں سے مٹی ہے اور اس کی روح ٹھنڈک اور خشکی ہے، انسان میں اس کا نظیر سودا (سیاہ پت) ہے اور اس کی روح قوت ماسکہ ہے۔ اور جہاں تک زمین کا تعلق ہے، تو وہ سات طبقات ہیں: سیاہ زمین، خاکستری زمین، سرخ زمین، پیلی زمین، سفید زمین، نیلی زمین، اور سبز زمین۔ انسان میں اس کے جسم میں ان ساتوں کا نظیر جلد، چربی، گوشت، رگیں، پٹھے (عصب)، عضلات اور ہڈیاں ہیں۔ (اور جہاں تک عالم تعمیر کا تعلق ہے) تو ان میں سے روحانیون ہیں، انسان میں ان کا نظیر وہ قوتیں ہیں جو اس میں ہیں۔ اور ان میں سے عالم حیوان ہے، انسان میں اس کا نظیر وہ ہے جو محسوس کرتا ہے۔ اور ان میں سے عالم نباتات ہے، انسان میں اس کا نظیر وہ ہے جو بڑھتا ہے۔ اور ان میں سے عالم جمادات ہے، انسان میں اس کا نظیر وہ ہے جو محسوس نہیں کرتا۔ (اور جہاں تک عالم نسب کا تعلق ہے) تو ان میں سے عرض ہے، انسان میں اس کا نظیر سیاہ، سفید، رنگ اور اکوان (حالات) ہیں۔ پھر کیفیت ہے، انسان میں اس کا نظیر احوال ہیں جیسے تندرست اور بیمار۔ پھر کمیت ہے، انسان میں اس کا نظیر یہ ہے کہ پنڈلی بازو سے لمبی ہے۔ پھر اَین (کہاں ہونا) ہے، انسان میں اس کا نظیر یہ ہے کہ گردن سر کی جگہ ہے اور پنڈلی ران کی جگہ ہے۔ پھر زمان ہے، انسان میں اس کا نظیر یہ ہے کہ میں نے اپنا سر اس وقت ہلایا جب میں نے اپنا ہاتھ ہلایا۔ پھر اضافہ (نسبت) ہے، انسان میں اس کا نظیر یہ ہے کہ یہ میرا باپ ہے تو میں اس کا بیٹا ہوں۔ پھر وضع (حالت) ہے، انسان میں اس کا نظیر میری زبان اور میرا لہجہ ہے۔ پھر یہ کہ وہ فعل کرے، انسان میں اس کا نظیر یہ ہے کہ میں نے کھایا۔ پھر یہ کہ وہ متاثر ہو، انسان میں اس کا نظیر یہ ہے کہ میں سیر ہو گیا۔ اور ان میں سے ماؤں میں صورتوں کا اختلاف ہے، جیسے ہاتھی، گدھا، شیر اور جھینگر۔ انسان میں اس کا نظیر وہ انسانی قوت ہے جو مذموم اور محمود معنوی صورتوں کو قبول کرتی ہے: یہ سمجھدار ہے تو وہ ہاتھی ہے، یہ کند ذہن ہے تو وہ گدھا ہے، یہ بہادر ہے تو وہ شیر ہے، یہ بزدل ہے تو وہ جھینگر ہے۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی سیدھا راستہ دکھاتا ہے)۔",
    "fa": "(باب ششم) در معرفت آغاز آفرینش روحانی\n\n(به نام خداوند بخشنده مهربان) و اینکه نخستین موجود در آن کیست، و از چه چیزی یافت شد، و در چه چیزی یافت شد، و بر چه مثالی یافت شد، و چرا یافت شد، و غایت آن چیست، و معرفت افلاک عالم اکبر (العالم الأكبر) و اصغر (العالم الأصغر).\n\n> بنگر به این هستی (الوجود) استوار *** و هستی ما چون ردای نقش‌دار است\n> و بنگر به جانشینانش در مُلکشان *** از سخنور فصیح‌اللسان و گنگ\n> هیچ‌یک از ایشان نیست که معبودش را دوست بدارد *** مگر آنکه آن را با حب درهم (پول) درآمیزد\n> پس گفته می‌شود این بنده معرفت (المعرفة) است و آن *** بنده بهشت است و آن بنده دوزخ است\n> مگر اندکی از اندک، که آنان *** مست اویند بدون حس و توهم\n> آنان بندگان حق (الله) هستند که کسی جز او از حالشان آگاه نیست *** نه بندگان نعمت‌دهنده (منعم)\n> پس چون اراده بازگشتشان به قصرهایشان را نمود *** آنان را از هر علم مبهمی بهره‌مند ساخت\n> علم مقدم در بسیط‌ها به تنهایی *** و اساس آن که از او گسسته نشد\n> و حقیقت ظرفی که آن را از *** امثال خود پوشاندی و مثالش کتمان نشد\n> و علم به سببی که به خاطر آن *** عین عوالم در طراز ازلی یافت شد\n> و نهایت امری که غایتی *** برای آن در حق (الحق) عظیم اعظم دانسته نمی‌شود\n> و علوم افلاک هستی (الوجود)، بزرگ و کوچک آن *** مگر بر کسی که نکوهیده نشد\n> اینها علومی است که هر کس کشف (الکشف) آن را محقق سازد *** قلب‌ها را به سوی راه استوار هدایت می‌کند\n> پس سپاس خدایی را که من گردآورنده *** علوم آن و علم آنچه دانسته نشده هستم.\n\n### [خلاصه بیان به نحو اجمال]\n\nخلاصه بیان به نحو اجمال این است که: آغاز آفرینش، هباء (الهباء) است و نخستین موجود در آن، حقیقت محمدیه (الحقيقة المحمدية) رحمانی است، و هیچ مکانی آن را در بر نمی‌گیرد به دلیل عدم تحیّز. و از چه چیزی یافت شد؟ از حقیقت معلومی یافت شد که نه به هستی (الوجود) متصف است و نه به نیستی (العدم). و در چه چیزی یافت شد؟ در هباء (الهباء). و بر چه مثالی یافت شد؟ بر صورت معلوم در نفس حق (الحق). و چرا یافت شد؟ برای آشکار ساختن حقایق الهی. و غایت آن چیست؟ رهایی از آمیختگی (المزجة) تا هر عالَمی سهم خود را از مبدأ آفرینش خود بدون امتزاج بشناسد. پس غایت آن، اظهار حقایق اوست. و معرفت افلاک عالم اکبر (العالم الأكبر) که در اصطلاح جماعت، غیر از انسان است، و عالم اصغر (العالم الأصغر) یعنی انسان، که روح عالم و علت و سبب آن است، و افلاک آن، مقامات و حرکات و تفصیل طبقات اوست. این تمام چیزی است که این باب در بر می‌گیرد.\n\n### [انسان عالم صغیر است]\n\nهمان‌طور که انسان از جهت جسم، عالم صغیر (العالم الأصغر) است، همچنین از جهت حدوث نیز حقیر است. و تأله (خداگونه شدن) برای او صحیح است، زیرا او خلیفه خدا در عالم است و عالم مسخر او و مألوه (معبود) اوست، همان‌طور که انسان مألوه خدای تعالی است. و بدان که کامل‌ترین نشأت انسان همانا در دنیاست. اما در آخرت، هر انسانی از دو گروه (مؤمن و کافر) در حال، بر نصف است نه در علم؛ زیرا هر گروهی به نقیض حال خود عالم است. پس انسان چیزی نیست جز مؤمن و کافر با هم، در سعادت و شقاوت، نعمت و عذاب، متنعم و معذب. و به همین دلیل، معرفت (المعرفة) دنیا کامل‌تر است و تجلی (التجلی) آخرت والاتر. پس بفهم و این قفل را بگشا. و ما رمزی برای کسی که متفطن باشد داریم، و آن لفظ \"بشیع شنیع\" است که معنای آن \"بدیع\" است.\n\n> روح هستی (الوجود) بزرگ *** این هستی (الوجود) کوچک است\n> اگر او نبود، حق (الحق) نمی‌گفت که من *** منم بزرگ و توانمند\n> حدوث من تو را محجوب نسازد *** و نه فنا (الفناء) و نه برانگیختن\n> زیرا اگر در من تأمل کنی *** منم محیط بزرگ\n> پس برای قدیم به ذاتم *** و برای جدید ظهوری است\n> و حق (الله) فردی قدیم است *** که قصوری بر او عارض نمی‌شود\n> و کائنات خلقی جدید است *** که در قبضه او اسیر است\n> پس از این نتیجه شد که من *** منم هستی (الوجود) حقیر\n> و هر هستی‌ای *** بر هستی من می‌چرخد\n> پس نه شب من چون شب است *** و نه نور من چون نور است\n> پس هر کس در بنده بگوید *** منم بنده فقیر\n> یا بگوید که من هستی‌ام *** منم هستی (الوجود) آگاه\n> پس مرا پادشاهی صحیح بدان، مرا می‌یابی *** یا عامی که ستم نمی‌کند\n> ای نادان به قدر من *** تویی دانای بینا\n> هستی (الوجود) مرا از جانب من ابلاغ کن *** و این سخن راست و دروغ است\n> و به قوم خود بگو که من *** منم رحیم و غفور\n> و بگو که عذاب من *** همان عذاب هلاک‌کننده است\n> و بگو که من ضعیفم *** نمی‌توانم راه بروم\n> پس چگونه شخصی *** به دست من متنعم می‌شود یا هلاک می‌گردد؟\n\n### بسط باب و بیان آن و از خداست تأیید و یاری [معلومات وجودی چهارگانه]\n\nبدانید که معلومات چهار چیزند: حق تعالی (الحق تعالی) که موصوف به هستی (الوجود) مطلق است، زیرا او سبحانه معلول چیزی نیست و نه علت، بلکه موجود به ذات خویش است. و علم به او عبارت است از علم به هستی (الوجود) او، و هستی او غیر ذات او نیست، با اینکه ذات او معلوم نیست، اما آنچه از صفات به او نسبت داده می‌شود، یعنی صفات معانی که صفات کمال هستند، دانسته می‌شود. اما علم به حقیقت ذات، ممنوع است؛ نه با دلیل و نه با برهان عقلی دانسته نمی‌شود و حدی آن را در بر نمی‌گیرد، زیرا او سبحانه شبیه چیزی نیست و چیزی شبیه او نیست. پس چگونه کسی که شبیه اشیاست، می‌تواند کسی را بشناسد که چیزی شبیه او نیست و او شبیه چیزی نیست؟ پس معرفت (المعرفة) تو به او تنها این است که: **لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ** (چیزی مانند او نیست) و **وَيُحَذِّرُكُمُ الله نَفْسَهُ** (و خداوند شما را از [عقوبت] خود برحذر می‌دارد). و منع از تفکر در ذات حق (الله) در شرع وارد شده است.\n\n### [حقیقة الحقائق]\n\n(و معلوم دوم) و آن حقیقت کلیه (حقیقة الحقائق) است که هم برای حق (الحق) است و هم برای عالم؛ نه به هستی (الوجود) متصف می‌شود و نه به نیستی (العدم)، نه به حدوث و نه به قدم. در قدیم، اگر به آن وصف شود، قدیم است و در حادث، اگر به آن وصف شود، حادث است. معلومات، قدیم و جدیدشان، دانسته نمی‌شوند مگر اینکه این حقیقت دانسته شود، و این حقیقت یافت نمی‌شود مگر اینکه اشیای موصوف به آن یافت شوند. پس اگر چیزی بدون عدم پیشین یافت شود، مانند هستی (الوجود) حق (الحق) و صفاتش، گفته می‌شود که موجودی قدیم است، به دلیل انصاف حق به آن. و اگر چیزی از عدم یافت شود، مانند هستی (الوجود) غیر خدا که حادث و موجود به غیر است، گفته می‌شود که محدثه است. و این حقیقت در هر موجودی به حقیقت خود هست، زیرا تجزیه را نمی‌پذیرد؛ پس نه کل است و نه جزء. و به معرفت (المعرفة) آن مجرد از صورت، نه با دلیل و نه با برهان نمی‌توان رسید. از این حقیقت است که عالم به واسطه حق تعالی (الحق تعالی) یافت شد، در حالی که خود موجود نیست تا حق ما را از موجودی قدیم ایجاد کرده باشد و قدم برای ما ثابت شود. همچنین باید بدانی که این حقیقت نه به تقدم بر عالم متصف می‌شود و نه عالم به تأخر از آن، بلکه آن اصل موجودات به طور عموم است، و اصل جوهر و فلک حیات و حق مخلوق به آن و غیره است. و آن فلک محیط معقول است. اگر بگویی که آن عالم است، راست گفته‌ای؛ یا اگر بگویی که آن عالم نیست، راست گفته‌ای؛ یا اگر بگویی که آن حق (الحق) است یا حق نیست، راست گفته‌ای. این همه را می‌پذیرد و با تعدد اشخاص عالم متعدد می‌شود و با تنزیه حق (الحق) منزه می‌گردد. و اگر مثالی برای آن می‌خواهی تا به فهم تو نزدیک شود، در چوبی بودن (العودية) در تخته، صندلی، دوات، منبر و تابوت بنگر. و همچنین در مربع بودن (التربیع) و امثال آن در اشکال، مثلاً در هر مربع از خانه، تابوت و کاغذ. و مربع بودن و چوبی بودن به حقیقت خود در هر یک از این اشخاص هست. و همچنین رنگ‌ها، مانند سفیدی لباس، جوهر، کاغذ، آرد و روغن، بدون اینکه سفیدی معقول در لباس به عنوان جزئی از آن متصف شود، بلکه حقیقت آن در لباس ظاهر شده است، همان‌طور که در کاغذ ظاهر شده است. و همچنین علم، قدرت، اراده، شنوایی، بینایی و همه اشیا. پس من این معلوم را برای تو بیان کردم و در کتاب خود با عنوان *انشاء الجداول و الدوائر* در این باره بسیار سخن گفته‌ایم.\n\n(و معلوم سوم) و آن تمام عالم است، اعم از املاک و افلاک و آنچه در بر دارند از عوالم و هوا و زمین و آنچه در آن دو از عالم است، و آن مُلک اکبر (العالم الأكبر) است. (و معلوم چهارم) و آن انسان خلیفه است که خداوند او را در این عالم مسخر تحت تسخیر خود قرار داد. حق تعالی (الحق تعالی) می‌فرماید: **وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِّنْهُ** (و آنچه در آسمان‌ها و آنچه در زمین است، همه را از جانب خود مسخر شما گردانید). پس هر کس این معلومات را بداند، دیگر معلومی برای او باقی نمی‌ماند که در پی آن باشد. از این معلومات، برخی هستند که جز هستی (الوجود) آن‌ها را نمی‌دانیم، و آن حق تعالی (الحق تعالی) است، و افعال و صفات او را با نوعی از مثال‌ها می‌دانیم. و برخی هستند که جز با مثال دانسته نمی‌شوند، مانند علم به حقیقت کلیه (حقیقة الحقائق). و برخی هستند که با این دو وجه و با ماهیت و کیفیت دانسته می‌شوند، و آن عالم و انسان است.\n\n### «وصل» [آغاز عالم و مثال آن: هباء و حقیقت محمدیه]\n\nخدا بود و هیچ چیز با او نبود.\nسپس در آن درج شد:\nو او اکنون بر همان حالتی است که بود.\n\nاز ایجاد عالم، صفتی که قبلاً بر آن نبود، به او بازنگشت، بلکه او قبل از خلقش به صفاتی که خلقش او را با آن‌ها می‌خوانند، موصوف و نامیده شده بود. پس هنگامی که اراده هستی (الوجود) عالم و آغاز آن را بر اساس آنچه با علم به نفس خود می‌دانست، نمود، از آن اراده مقدسه، به واسطه نوعی تجلی (التجلی) از تجلیات تنزیه به سوی حقیقت کلیه (حقیقة الحقائق)، حقیقتی به نام هباء (الهباء) منفعل شد. هباء به منزله گچ‌کاری بناست تا هر شکل و صورتی را که بخواهد در آن بگشاید. و این نخستین موجود در عالم است که علی بن ابی طالب (رضی الله عنه) و سهل بن عبدالله (رحمه الله) و دیگر اهل تحقیق و اهل کشف (الکشف) و شهود (الشهود) آن را ذکر کرده‌اند. سپس او سبحانه با نور خود بر آن هباء (الهباء) تجلی (التجلی) نمود. اصحاب افکار آن را هیولای کل می‌نامند، و تمام عالم در آن به صورت بالقوه و صلاحیتی وجود دارد. پس هر چیزی در آن هباء (الهباء) بر حسب قوت و استعداد خود، از حق تعالی (الحق تعالی) پذیرفت، همان‌طور که زوایای خانه نور چراغ را می‌پذیرند و به اندازه نزدیکی به آن نور، روشنایی و پذیرش آن شدیدتر می‌شود. حق تعالی (الحق تعالی) می‌فرماید: **مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ** (مَثَل نور او چون چراغدانی است که در آن چراغی است). پس نور خود را به چراغ تشبیه کرد. و نزدیک‌ترین پذیرنده به او در آن هباء (الهباء) نبود مگر حقیقت محمد (صلی الله علیه و سلم) که عقل نامیده می‌شود. پس او سرور تمام عالم و اولین ظاهر در هستی (الوجود) بود. پس هستی (الوجود) او از آن نور الهی و از هباء (الهباء) و از حقیقت کلیه (حقیقة الحقائق) بود، و عین او و عین عالم از تجلی (التجلی) او در هباء (الهباء) یافت شد. و نزدیک‌ترین مردم به او علی بن ابی طالب و اسرار همه انبیا هستند. اما مثالی که عالم به طور کلی و بدون تفصیل بر آن یافت شد، همان علم قائم به نفس حق تعالی (الحق تعالی) است. زیرا او سبحانه ما را به علم خود به نفس خویش دانست و ما را بر اساس آنچه می‌دانست ایجاد کرد، و ما بر این شکل معین در علم او هستیم. و اگر امر چنین نبود، ما این شکل را به صورت اتفاقی می‌گرفتیم نه از روی قصد، زیرا او آن را نمی‌دانست، و ممکن نیست که صورتی در هستی (الوجود) به حکم اتفاق خارج شود. پس اگر این شکل معین برای خداوند سبحانه معلوم و مراد او نبود، ما را بر آن ایجاد نمی‌کرد. و این شکل را از غیر خود نگرفت، زیرا ثابت شد که او بود و هیچ چیز با او نبود. پس باقی نمی‌ماند مگر اینکه آنچه بر آن ظاهر شد، صورتی باشد که در نفس اوست. پس علم او به نفس خویش، علم او به ما ازلاً است، نه از عدم. پس علم او به ما نیز چنین است. پس مثال ما که عین علم او به ماست، به قدم حق (الحق) قدیم است، زیرا صفت اوست و حوادث در نفس او قیام نمی‌کنند، خداوند از این امر منزه است.\n\n### [غایت عالم]\n\nو اما در مورد سخن ما که چرا یافت شد و غایت آن چیست، خداوند عز و جل می‌فرماید: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ** (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند). پس به سببی که به خاطر آن ما را ایجاد کرد، تصریح نمود، و عالم نیز کلاً چنین است. و جن را به ذکر اختصاص دادیم، و جن در اینجا هر موجود مستتری است، اعم از فرشته و غیره. و حق تعالی (الحق تعالی) در حق آسمان‌ها و زمین فرمود: **ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ** (به میل یا اکراه بیایید. گفتند: با میل و رغبت آمدیم). و همچنین فرمود: **فَأَبَيْنَ أَن يَحْمِلْنَهَا** (پس از حمل آن سر باز زدند)، و این به دلیل آن بود که عرضی بود. اما اگر امری بود، اطاعت می‌کردند و آن را حمل می‌نمودند، زیرا معصیت از آن‌ها تصور نمی‌شود، بر این سرشته شده‌اند. اما جن ناری و انس بر این سرشته نشده‌اند.\n\n### [عالم کلاً زنده و ناطق است]\n\nو همچنین از انسان‌ها، صاحبان افکار از اهل نظر و ادله که محدود به حواس و ضروریات و بدیهیات هستند، می‌گویند: لازم است که مکلف عاقل باشد تا آنچه به او خطاب می‌شود را بفهمد. و راست گفتند. و امر نزد ما نیز چنین است؛ تمام عالم از جهت کشف (الکشف) به واسطه خرق عادتی که مردم بر آن هستند، عاقل، زنده و ناطق است؛ یعنی حصول علم به این امر نزد ما. با این حال، آن‌ها گفتند این جماد است و تعقل نمی‌کند و در حد آنچه دیده‌شان به آن‌ها داده، توقف کردند. و امر نزد ما خلاف این است. پس اگر از پیامبری نقل شود که سنگی با او سخن گفت یا کتف گوسفندی یا تنه نخلی یا چهارپایی، می‌گویند: خداوند در آن زمان حیات و علم را در آن خلق کرد. و امر نزد ما چنین نیست، بلکه سرّ حیات در تمام عالم است و هر تر و خشکی که صدای مؤذن را می‌شنود، برای او شهادت می‌دهد. و شهادت نمی‌دهد مگر کسی که این را نزد ما از طریق کشف (الکشف) بداند، نه از طریق استنباط نظری که ظاهر خبر یا غیر آن اقتضا کند. و هر کس بخواهد بر این امر واقف شود، باید راه مردان را بپیماید و خلوت و ذکر را لازم گیرد، زیرا خداوند او را بر تمام این امور به صورت عینی مطلع خواهد ساخت، و آنگاه می‌داند که مردم در کوری نسبت به درک این حقایق هستند.\n\n### [وجود عالم ظهور سلطنت اسماء است]\n\nپس خداوند سبحانه عالم را ایجاد کرد تا سلطنت اسماء (الهی) آشکار شود، زیرا قدرت بدون مقدور، هستی (الوجود) بدون عطا، رازق بدون مرزوق، فریادرس بدون فریادخواسته، و رحیم بدون مرحوم، حقایقی هستند که تأثیرشان معطل می‌ماند. و عالم را در دنیا آمیخته قرار داد، آمیختن دو قبضه در خمیر، سپس اشخاص را از آن جدا کرد، پس از این قبضه در آن قبضه و از هر قبضه‌ای در دیگری داخل شد، و احوال مجهول ماند. و در اینجاست که علما در استخراج خبیث از طیب و طیب از خبیث بر یکدیگر برتری یافتند. و غایت آن، رهایی از این آمیختگی (المزجة) و تمییز دو قبضه است تا این یکی به عالم خود و آن دیگری به عالم خود منفرد شود، چنانکه حق تعالی (الحق تعالی) فرمود: **لِيَمِيزَ اللَّهُ الْخَبِيثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلَى بَعْضٍ فَيَرْكُمَهُ جَمِيعًا فَيَجْعَلَهُ فِي جَهَنَّمَ** (تا خداوند ناپاک را از پاک جدا سازد و ناپاک را روی هم نهد و همه را متراکم سازد و آن را در جهنم قرار دهد). پس هر کس چیزی از این آمیختگی در او باقی بماند و بر آن بمیرد، در روز قیامت از زمره ایمن‌شدگان محشور نمی‌شود، بلکه برخی از آنان در حساب از آمیختگی رها می‌شوند و برخی از آن رها نمی‌شوند مگر در جهنم. پس چون رها شد، خارج می‌گردد. اینان همان اهل شفاعت هستند. اما کسی که در اینجا در یکی از دو قبضه متمایز شد، با حقیقت خود از قبرش به سوی دار آخرت، به نعمت یا به عذاب و دوزخ منتقل می‌شود، زیرا او رها شده است. پس این غایت عالم است. و این دو، دو حقیقتی هستند که به صفتی باز می‌گردند که حق (الحق) در ذات خود بر آن است. و از اینجاست که گفتیم اهل آتش او را معذب و اهل بهشت او را متنعم می‌بینند. و این سرّ شریفی است که شاید در دار آخرت هنگام مشاهده (المشاهدة) بر آن واقف شوی، ان شاء الله. و محققون در همین دنیا به آن دست یافته‌اند.\n\n### [عوالم علوی و سفلی و نظایر آن‌ها در انسان]\n\nو اما در مورد سخن ما در این باب و معرفت افلاک عالم اکبر (العالم الأكبر) و اصغر (العالم الأصغر) که همان انسان است، منظورم عوالم کلیات و اجناس و امرای آن است که در غیر خود تأثیر دارند. و آن‌ها را در مقابل یکدیگر قرار دادم، زیرا این (انسان) نسخه‌ای از آن (عالم اکبر) است. و ما در کتاب *انشاء الدوائر و الجداول* که تألیف آن را در تونس در محل امام ابومحمد عبدالعزیز، ولی و برگزیده ما (رحمه الله)، آغاز کردیم، برای آن‌ها دایره‌هایی به صورت افلاک و ترتیب آن‌ها ترسیم نمودیم. پس در این باب آنچه را که مناسب این مختصر است، از آن نقل می‌کنیم. می‌گوییم که عوالم چهارتا هستند: عالم اعلی که عالم بقا (البقاء) است، سپس عالم استحاله که عالم فنا (الفناء) است، سپس عالم تعمیر که عالم بقا (البقاء) و فنا (الفناء) است، و سپس عالم نَسَب. و این عوالم در دو موطن قرار دارند: در عالم اکبر (العالم الأكبر) که خارج از انسان است، و در عالم اصغر (العالم الأصغر) که انسان است.\n\n(اما عالم اعلی) حقیقت محمدیه (الحقيقة المحمدية) است و فلک آن حیات است، و نظیر آن در انسان، لطیفه و روح قدسی است. و از آن جمله عرش محیط است و نظیر آن در انسان، جسم است. و از آن جمله کرسی است و نظیر آن در انسان، نفس است. و از آن جمله بیت المعمور است و نظیر آن در انسان، قلب است. و از آن جمله ملائکه هستند و نظیر آن‌ها در انسان، ارواح و قوای موجود در اوست. و از آن جمله زحل و فلک آن است و نظیر آن در انسان، قوه علمیه و نفس است. و از آن جمله مشتری و فلک آن است و نظیر آن‌ها قوه ذاکره و مؤخر مغز است. و از آن جمله مریخ (الأحمر) و فلک آن است و نظیر آن‌ها قوه عاقله و یافوخ است. و از آن جمله خورشید و فلک آن است و نظیر آن‌ها قوه مفکره و وسط مغز است. سپس زهره و فلک آن است و نظیر آن‌ها قوه واهمه و روح حیوانی است. سپس عطارد (الکاتب) و فلک آن است و نظیر آن‌ها قوه خیالیه و مقدم مغز است. سپس ماه و فلک آن است و نظیر آن‌ها قوه حسیه و جوارحی است که حس می‌کنند. این‌ها طبقات عالم اعلی و نظایر آن‌ها در انسان هستند.\n\n(و اما عالم استحاله) از آن جمله کره اثیر است و روح آن حرارت و خشکی است، و آن کره آتش است، و نظیر آن صفرا است و روح آن قوه هاضمه است. و از آن جمله هوا است و روح آن حرارت و رطوبت است، و نظیر آن خون است و روح آن قوه جاذبه است. و از آن جمله آب است و روح آن سردی و رطوبت است، و نظیر آن بلغم است و روح آن قوه دافعه است. و از آن جمله خاک است و روح آن سردی و خشکی است، و نظیر آن سودا است و روح آن قوه ماسکه است. و اما زمین، هفت طبقه است: زمین سیاه، زمین خاکستری، زمین سرخ، زمین زرد، زمین سفید، زمین آبی و زمین سبز. نظیر این هفت در جسم انسان، پوست، پیه، گوشت، رگ‌ها، عصب، عضلات و استخوان‌ها هستند.\n\n(و اما عالم تعمیر) از آن جمله روحانیون هستند و نظیر آن‌ها قوای موجود در انسان است. و از آن جمله عالم حیوان است و نظیر آن، آنچه در انسان حس می‌کند. و از آن جمله عالم نبات است و نظیر آن، آنچه در انسان رشد می‌کند. و از آن جمله عالم جماد است و نظیر آن، آنچه در انسان حس نمی‌کند.\n\n(و اما عالم نَسَب) از آن جمله عَرَض است و نظیر آن، سیاهی و سفیدی و رنگ‌ها و اکوان است. سپس کَیف است و نظیر آن، احوال است مانند سالم و بیمار. سپس کَم است و نظیر آن، ساق از بازو بلندتر است. سپس أین است و نظیر آن، گردن جایگاه سر و ساق جایگاه ران است. سپس زمان است و نظیر آن، سرم را در وقت حرکت دادن دستم حرکت دادم. سپس اضافه است و نظیر آن، این پدر من است پس من پسر اویم. سپس وضع است و نظیر آن، زبان و لحن من. سپس أن یفعل (فعل کردن) است و نظیر آن، خوردم. سپس أن ینفعل (فعل پذیرفتن) است و نظیر آن، سیر شدم. و از آن جمله اختلاف صور در مادران است، مانند فیل و الاغ و شیر و سوسک (صرصر). نظیر این، قوه انسانی است که صور معنوی را می‌پذیرد، اعم از مذموم و محمود: این زیرک است پس فیل است، این کودن است پس الاغ است، این شجاع است پس شیر است، این ترسو است پس سوسک است. **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (و خداوند حق را می‌گوید و اوست که راه را هدایت می‌کند)."
  },
  "page_count": 5
}