{
  "id": 513,
  "title": {
    "ar": "الباب الثالث عشر وخمسمائة في معرفة حال قطب كان منزله كهيعص ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا",
    "en": "Chapter Five Hundred and Thirteen: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station (منزله) was Kâf Hâ' Yâ' 'Ayn Sâd (كهيعص), <<ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا>> (The mention of the mercy of your Lord upon His servant Zachariah).",
    "ur": "باب پانچ سو تیرہ: ایک قطب کے حال کی معرفت (معرفت) میں، جس کا روحانی منزل (منزل) یہ تھا:\n**كهيعص ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا**\n(کاف، ہا، یا، عین، صاد۔ یہ تمہارے رب کی رحمت کا ذکر ہے جو اس نے اپنے بندے زکریا پر کی)۔ [القرآن ۱۹: ۱-۲]",
    "fa": "باب پانصد و سیزدهم در معرفت حال قطبی که منزل او «کهیعص ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا» (کهیعص، یاد رحمت پروردگارت بر بنده خود زکریا) بود."
  },
  "content": {
    "ar": "## (الباب الثالث عشر وخمسمائة في معرفة حال قطب كان منزله كهيعص ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا)\n\n\n> إذا ذكرتني رحمة الرب لم أزل *** أقول له يا رب رب محمد\n\n\n> لأن لها التأكيد أن كان ربه *** فاعلو بهذا الذكر في كل مشهد\n\n\n> فأرسله الرحمن للخلق رحمة *** على كل حال بين هاد ومهتدي‏\n\n\n### [أن الله بعث محمدا صَلَّى اللهُ عَليهِ وسَلَّم رحمة للعالمين‏]\n\n\nقال الله تعالى وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ وأوحى إليه تعالى أن الله لم يبعثك سبابا ولا لعانا وإنما بعثك رحمة وقال تعالى في عبده خضر آتَيْناهُ رَحْمَةً من عِنْدِنا فقدم الرحمة على العلم وهي الرحمة التي في الجبلة ثم قال وعَلَّمْناهُ من لَدُنَّا عِلْماً فأعطاه هذا العلم من أجل قوله لَدُنَّا الرحمة المبطونة في المكروه وبهذه الرحمة قتل الغلام وخرق السفينة وبالرحمة الأولى أقام الجدار فلا يفرق بين هاتين الرحمتين إلا صاحب هذا الذكر فإن الرحمة هي التي تذكره ما هو يذكرها فتعطيه بذكره حقيقة ما فيها لأنها تطلب منه التعشق بها فإنه لا ظهور لها إلا به فهي حريصة على مثل هذا\n\n\n### [وجوب الرحمة مع زكريا]\n\n\nواعلم أن هذا الذكر تعريف إلهي بوجوب حكم الرحمة فيمن تذكره من عباده سبحانه وتعالى وجاء زكريا لا لخصوص الذكر وإنما ساقته عناية العبد فإنها ما ذكرته إلا لكونه عبدا له تعالى في جميع أحواله فأي شخص أقامه الله في هذا المقام فبرحمته به أقامه لتذكره رحمة ربه عنده تعالى فحال عبوديته هو عين رحمته الربانية التي ذكرته فأعلمت ربها أنها عند هذا العبد فأي شي‏ء صدر من هذا الشخص فهو مقبول عند الله تعالى ومن هذا المقام يحصل له من الله ما يختص به مما لا يكون لغيره وهو الأمر الذي يمتاز به ويخصه فإنه لا بد لكل مقرب عند الله من أمر يختص به وقد أشار الشرع في التعريف بهذا فقال إنه ما من أحد من المؤمنين إلا ولا بد أن يناجي ربه وحده ليس بينه وبينه ترجمان‏\n\n\nفيضع كنفه عليه وهو عموم رحمته به فذلك محل تحصيل ما يختص به كانت القيامة لهذا العبد حيث كانت لأنه من عباد الله من تعجل له قيامته فيرى ما يؤول إليه أمره في الدار الآخرة وهي البشرى التي للمؤمن في الحياة الدنيا وقد رأيناها ذوقا وكان لنا فيها مواقف منها في ليلة واحدة مائة موقف بأخذ ورجوع لو قسمت تلك الليلة على قدر الوقوف ما وسعته وذلك بمدينة فاس سنة ثلاث وتسعين وخمسمائة أشاهد في كل موقف من اتساع الرحمة ما لا يمكنني النطق به وكان ذلك لاتساع ذكر الرحمة فكيف بذكر الرحمن إذا حصل للعبد ولا يحصل إلا للعبد الجاني وأما غير الجاني فهو عين رحمة الله في خلقه به يرحم الله الخلق كافرهم ومؤمنهم ومشركهم وموحدهم وبه يرزق عباده في الدنيا وبه يقع النصر وينزل المطر وتخصب الأرض وتكثر الرسل ويعظم الخير وهو المعصوم بالشهود في عين الجنايات فيظهر عليها بحكم القضاء والقدر الحاكم في الطرفين خلق وحق إن فهمت فلا يظهر فيك ولا منك إلا عينك ولا يحكم بعلمه فيك إلا ما أعطيته من العلم بك وهنا زلت الاقدام ونكصت على أعقابها الأفهام وتحكم على الأحلام سلطان الأوهام وللأوهام الحكم الغالب التام والدوام والله ما يوجد إلا عند ظن للعبد به فليظن به خيرا والظن من بعض وزعة الوهم وهو الذي يعطي العذاب المعجل والنعيم المعجل فظن خيرا تلقه وبعض الظن إثم فو الله لو لا الظن ما عصى الله مخلوق أبدا ولا بد من العصيان وهو حكم الله في الفعل أو الترك فلا بد من الظن فمن رحمة الله بخلقه أن خلق الظن فيهم وجعله من بعض وزعة الوهم ولا يتمكن تحصيل العلم لأحد في أمر أصلا من حيث ما يحكم به على المشهود لا من حيث الشهود فإنك لا تقدر على زوال ما شهدت وهكذا جميع تعلق باقي القوي ولكن بقي الحكم على ما تعطيه هل يحصل به العلم أو الظن فعند صاحب هذا المقام لا يحصل إلا بالظن خاصة وأما غيره فيجعل ذلك علما لعدم ذوقه لهذه الحال ففرق بين ما تعطيه القوة وبين ما يحكم به على ذلك المعطى بها هل يحكم بالظن أو بالعلم فالأمر في نفسه شبهة في عين الدليل وإن لم يكن الأمر هكذا لم يتميز رب من عبد ولا حق من خلق إن فهمت فهذا بعض ما ينتجه لك هذا الذكر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 513: Concerning the Knowledge of the State of a Pole whose Station was *Kāf Hā Yā ‘Ayn Ṣād*, the mention of the mercy of your Lord upon His servant Zachariah\n\nWhen the Lord’s Mercy remembers me, I never cease\nSaying to Him: O Lord, the Lord of Muhammad.\nBecause for Her [Mercy] there is confirmation that He was Her Lord,\nSo act upon this Remembrance (الذكر) in every witnessing (مشهد).\nFor the All-Merciful (الرحمن) sent him [Muhammad] as a mercy to creation,\nIn every state, whether guiding or being guided.\n\n### [That Allah sent Muhammad (peace and blessings be upon him) as a Mercy to the Worlds]\n\nAllah the Exalted said: <<And We have not sent you except as a mercy to the worlds>> (وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ). And He revealed to him (peace be upon him) that Allah did not send you as an abuser or a curser, but rather sent you as a mercy. And the Exalted said concerning His servant Khidr: <<We gave him mercy from Our presence>> (آتَيْناهُ رَحْمَةً من عِنْدِنا). Thus, He prioritized Mercy over Knowledge, and this is the Mercy inherent in the natural disposition (الجبلة). Then He said: <<And We taught him knowledge from Our own presence>> (وعَلَّمْناهُ من لَدُنَّا عِلْماً). So He granted him this Knowledge (العلم) because of the phrase \"from Our own presence\" (لَدُنَّا), which signifies the Mercy concealed within the disliked (المكروه). It was by this Mercy that he killed the boy and scuttled the ship. And it was by the first Mercy that he repaired the wall. No one distinguishes between these two Mercies except the possessor of this Remembrance (الذكر). For Mercy is that which remembers him, even as he remembers Her. Thus, through his remembrance, She grants him the reality of what is within Her, because She seeks to be passionately loved (التعشق) by him. For She has no manifestation (ظهور) except through him, and thus She is eager for such a person.\n\n### [The Necessity of Mercy with Zachariah]\n\nKnow that this Remembrance (الذكر) is a Divine definition (تعريف إلهي) of the necessity of the rule of Mercy (حكم الرحمة) in whichever of His servants remembers Him, glory and exaltedness be to Him. And Zachariah came not due to the specificity of the Remembrance, but rather the solicitude of the servant (عناية العبد) drove him. For [Mercy] only remembered him because he was a servant (عبدا) of the Exalted in all his states. So, any person whom Allah establishes in this Station (مقام), He establishes him by His Mercy upon him, so that the Mercy of his Lord remembers him in the presence of the Exalted. Thus, his state of servitude (عبوديته) is the very essence of the Lordly Mercy (رحمته الربانية) that remembered him. And [Mercy] informed Her Lord that She was with this servant. Therefore, whatever proceeds from this person is acceptable to Allah the Exalted. And from this Station, he receives from Allah that which is specific to him and which belongs to no one else. This is the matter by which he is distinguished and specialized. For every one brought near (مقرب) to Allah must possess a matter specific to him. The Sacred Law (الشرع) has indicated this definition by saying that there is no believer who will not inevitably commune privately (يناجي) with his Lord alone, with no interpreter (ترجمان) between them.\n\nHe will place His covering (كنفه) over him, which is the universality of His Mercy upon him. That is the place where he attains what is specific to him. The Resurrection (القيامة) occurred for this servant wherever it occurred, because among the servants of Allah are those whose Resurrection is hastened for them, so they see what their affair will lead to in the Hereafter. This is the glad tidings (البشرى) granted to the believer in the life of this world. We have seen this through direct experience (ذوقا), and we had stations (مواقف) within it, including one night where we had a hundred stations of taking and returning. If that night were divided according to the measure of those stations, it would not contain them. That was in the city of Fez in the year 593 AH. In every station, I witnessed such an expansion of Mercy (اتساع الرحمة) that I cannot articulate it. That was due to the expansion of the remembrance of Mercy (ذكر الرحمة); so how much greater is the remembrance of the All-Merciful (ذكر الرحمن) when it is attained by the servant? And it is not attained except by the servant who commits transgression (الجاني). As for the non-transgressor, he is the very essence of Allah's Mercy in His creation. Through him, Allah shows mercy to creation: their disbelievers, their believers, their polytheists, and their monotheists. Through him, He provides sustenance to His servants in this world, through him victory occurs, rain descends, the earth becomes fertile, messengers multiply, and goodness is magnified. He is the one protected (المعصوم) by Witnessing (الشهود) even amidst transgressions (الجنايات). He manifests over them [the transgressions] by the ruling of Divine Decree (القضاء) and Destiny (القدر), which governs both sides: creation (خلق) and the Real (حق)—if you understand. Nothing appears in you or from you except your own essence (عينك). And He does not rule by His Knowledge (العلم) concerning you except what you have granted Him of knowledge concerning yourself. It is here that feet slip and understandings (الأفهام) retreat upon their heels. And the dominion of Illusions (الأوهام) rules over dreams (الأحلام). And for Illusions (الأوهام) is the complete, dominant, and enduring rule. By Allah, He is only found according to the servant's conjecture (ظن) about Him, so let him conjecture good about Him. And conjecture (الظن) is one of the distributors of Illusion (الوهم). It is that which grants the hastened punishment and the hastened bliss. So conjecture good, and you will find it, [though] <<some conjecture is sin>>. By Allah, were it not for conjecture (الظن), no creature would ever disobey Allah. And disobedience is inevitable, for it is Allah's ruling (حكم) in action or omission, so conjecture is necessary. Thus, it is part of Allah's Mercy upon His creation that He created conjecture (الظن) within them and made it one of the distributors of Illusion (الوهم). No one can attain Knowledge (العلم) regarding a matter at all from the perspective of what is ruled upon the witnessed thing (المشهود), but only from the perspective of the Witnessing (الشهود). For you are unable to remove what you have witnessed. And similarly for all the attachments of the remaining faculties. But the ruling remains concerning what that faculty grants: does it result in Knowledge (العلم) or Conjecture (الظن)? For the possessor of this Station (مقام), it results only in Conjecture (الظن) specifically. As for others, they deem that to be Knowledge, due to their lack of direct experience (ذوقه) of this state. So, distinguish between what the faculty grants and what is ruled upon that which is granted by it—is the ruling by Conjecture or by Knowledge? The matter itself is a subtle ambiguity (شبهة) within the very evidence (الدليل). If the matter were not thus, the Lord would not be distinguished from the servant, nor the Real (حق) from creation (خلق)—if you understand. This is some of what this Remembrance (الذكر) yields for you. <<And Allah speaks the Truth, and He guides to the way>> (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏).",
    "ur": "(باب پانچ سو تیرہ: اس قطب کے حال کی معرفت میں جس کا مقام کہیعص (كهيعص) تھا، یعنی \"یہ تیرے رب کی رحمت کا ذکر ہے جو اس نے اپنے بندے زکریا پر کی\")\n\nجب رب کی رحمت مجھے یاد کرتی ہے، تو میں ہمیشہ کہتا ہوں:\n\"اے رب! محمد (صلی اللہ علیہ وسلم) کے رب!\"\nکیونکہ اس (رحمت) کے لیے یہ تاکید ہے کہ وہ (محمد) اس کا رب تھا،\nپس ہر مشاہدے (مشہد) میں اس ذکر پر عمل کرو۔\nتو رحمن نے اسے مخلوق کے لیے رحمت بنا کر بھیجا،\nہر حال میں، ہدایت دینے والے اور ہدایت پانے والے کے درمیان۔\n\n[بیشک اللہ نے محمد صلی اللہ علیہ وسلم کو تمام جہانوں کے لیے رحمت بنا کر بھیجا]\n\nاللہ تعالیٰ نے فرمایا: \"اور ہم نے آپ کو تمام جہانوں کے لیے رحمت بنا کر ہی بھیجا ہے\" (وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ)۔ اور اللہ تعالیٰ نے آپ کی طرف وحی کی کہ اللہ نے آپ کو نہ گالی دینے والا بنا کر بھیجا ہے اور نہ لعنت کرنے والا، بلکہ آپ کو رحمت بنا کر بھیجا ہے۔ اور اللہ تعالیٰ نے اپنے بندے خضر کے بارے میں فرمایا: \"ہم نے اسے اپنی طرف سے رحمت عطا کی تھی\" (آتَيْنَاهُ رَحْمَةً مِّنْ عِندِنَا)۔ پس (ذات حق نے) رحمت کو علم پر مقدم کیا، اور یہ وہ رحمت ہے جو جبلت میں ہے۔ پھر فرمایا: \"اور ہم نے اسے اپنے پاس سے علم سکھایا تھا\" (وَعَلَّمْنَاهُ مِن لَّدُنَّا عِلْمًا)۔ پس یہ علم اسے اس قول \"لَدُنَّا\" (ہمارے پاس سے) کی وجہ سے عطا کیا گیا، جو کہ ناپسندیدہ (مکروہ) میں پوشیدہ رحمت ہے۔ اسی رحمت کے سبب اس نے لڑکے کو قتل کیا اور کشتی کو پھاڑا، اور پہلی رحمت کے سبب اس نے دیوار کھڑی کی۔ ان دونوں رحمتوں میں فرق صرف اس ذکر کے صاحب کو معلوم ہوتا ہے۔ کیونکہ رحمت ہی وہ ہے جو اسے یاد کرتی ہے، نہ کہ وہ اسے یاد کرتا ہے۔ پس وہ (رحمت) اسے اپنے ذکر کے ذریعے اس حقیقت کو عطا کرتی ہے جو اس کے اندر ہے، کیونکہ وہ اس سے چاہتی ہے کہ وہ اس سے عشق کرے، اس لیے کہ اس (رحمت) کا ظہور اس (بندے) کے بغیر نہیں ہو سکتا، لہٰذا وہ ایسے شخص کی مشتاق رہتی ہے۔\n\n[زکریا کے ساتھ رحمت کا وجوب]\n\nاور جان لو کہ یہ ذکر ایک الٰہی تعریف ہے اس بات کی کہ اللہ سبحانہ و تعالیٰ کے ان بندوں میں رحمت کا حکم واجب ہے جنہیں وہ یاد کرتا ہے۔ اور زکریا (علیہ السلام) صرف ذکر کی خصوصیت کی وجہ سے نہیں آئے، بلکہ بندے کی عنایت انہیں کھینچ لائی۔ کیونکہ رحمت نے انہیں یاد نہیں کیا مگر اس لیے کہ وہ تمام احوال میں اللہ تعالیٰ کے بندے تھے۔ پس جس شخص کو بھی اللہ اس مقام پر فائز کرتا ہے، تو وہ اپنی رحمت کے سبب اسے فائز کرتا ہے تاکہ اس کا رب اس بندے کے پاس اپنی رحمت کو یاد کرے۔ پس اس کی عبودیت (بندگی) کی حالت ہی عین وہ ربانی رحمت ہے جس نے اسے یاد کیا، اور اس نے اپنے رب کو خبر دی کہ وہ اس بندے کے پاس ہے۔ پس اس شخص سے جو کچھ بھی صادر ہوتا ہے وہ اللہ تعالیٰ کے نزدیک مقبول ہے۔ اور اس مقام سے اسے اللہ کی طرف سے وہ چیز حاصل ہوتی ہے جو اس کے لیے خاص ہوتی ہے اور کسی دوسرے کے لیے نہیں ہوتی، اور یہی وہ امر ہے جو اسے ممتاز کرتا ہے اور اس کے لیے مخصوص ہوتا ہے۔ کیونکہ اللہ کے نزدیک ہر مقرب کے لیے کوئی نہ کوئی خاص امر ہونا ضروری ہے۔ اور شریعت نے اس کی تعریف میں اشارہ کرتے ہوئے فرمایا ہے کہ کوئی بھی مومن ایسا نہیں ہے مگر یہ کہ وہ ضرور اپنے رب سے تنہائی میں سرگوشی کرے گا، اس کے اور اس کے درمیان کوئی ترجمان نہیں ہوگا۔\n\nپس وہ (اللہ) اپنی چادر اس پر ڈال دیتا ہے، اور یہ اس کی عمومی رحمت ہے اس بندے پر۔ یہی وہ محل ہے جہاں وہ چیز حاصل ہوتی ہے جو اس کے لیے خاص ہے۔ اس بندے کے لیے قیامت جہاں بھی تھی، وہیں قائم ہو گئی، کیونکہ اللہ کے بندوں میں سے کچھ ایسے ہیں جن کے لیے ان کی قیامت جلدی آ جاتی ہے، اور وہ دیکھتے ہیں کہ آخرت میں ان کا انجام کیا ہو گا، اور یہی وہ بشارت ہے جو مومن کے لیے دنیا کی زندگی میں ہے۔ اور ہم نے اسے ذوقاً (روحانی تجربے کے طور پر) دیکھا ہے، اور اس میں ہمارے لیے کئی مقامات تھے، جن میں سے ایک ہی رات میں سو (۱۰۰) مقامات تھے، جن میں قبض و بسط (اخذ و رجوع) شامل تھا۔ اگر اس رات کو ان مقامات کی تعداد پر تقسیم کیا جائے تو وہ اس کے لیے کافی نہ ہو گی۔ اور یہ واقعہ فاس شہر میں ۵۹۳ھ میں پیش آیا۔ میں ہر مقام پر رحمت کی ایسی وسعت کا مشاہدہ کرتا تھا جسے بیان کرنا میرے لیے ممکن نہیں تھا۔ اور یہ سب ذکرِ رحمت کی وسعت کی وجہ سے تھا۔ تو پھر ذکرِ رحمن کا کیا حال ہو گا جب وہ بندے کو حاصل ہو جائے؟ اور یہ (ذکرِ رحمن) صرف گناہ گار (جانی) بندے کو ہی حاصل ہوتا ہے۔ اور جو گناہ گار نہیں ہے، وہ مخلوق میں اللہ کی رحمت کا عین ہے، اسی کے ذریعے اللہ مخلوق پر رحم کرتا ہے، خواہ وہ کافر ہوں، مومن ہوں، مشرک ہوں یا موحد ہوں۔ اور اسی کے ذریعے وہ دنیا میں اپنے بندوں کو رزق دیتا ہے، اور اسی کے ذریعے نصرت حاصل ہوتی ہے، بارش نازل ہوتی ہے، زمین زرخیز ہوتی ہے، رسولوں کی کثرت ہوتی ہے، اور خیر و بھلائی عظیم ہوتی ہے۔ اور وہ (یہ بندہ) گناہوں کے عین میں شہود (الشہود) کے ذریعے معصوم ہوتا ہے، اور وہ قضا و قدر کے حکم سے ان (گناہوں) پر غالب آ جاتا ہے جو دونوں فریقوں (خلق اور حق) میں حاکم ہے۔ اگر تم سمجھو تو تم میں اور تم سے تمہاری ذات (عین) کے سوا کچھ ظاہر نہیں ہوتا، اور تمہارے بارے میں اپنے علم سے وہی حکم کرتا ہے جو تم نے اسے اپنے بارے میں علم دیا ہے۔ اور یہیں قدم ڈگمگا جاتے ہیں، اور سمجھیں اپنی ایڑیوں پر پلٹ جاتی ہیں، اور اوہام (وہم) کا غلبہ خوابوں پر حاکم ہو جاتا ہے۔ اور اوہام کا حکم غالب، کامل اور دائمی ہوتا ہے۔ اللہ کی قسم! اللہ کا وجود صرف بندے کے اس کے بارے میں گمان (ظن) کے وقت ہی ہوتا ہے۔ پس اسے چاہیے کہ وہ اس کے بارے میں اچھا گمان کرے۔ اور گمان (الظن) وہم کے تقسیم کاروں میں سے ہے، اور یہی وہ ہے جو عذابِ معجل (جلدی آنے والا عذاب) اور نعیمِ معجل (جلدی آنے والی نعمت) عطا کرتا ہے۔ پس اچھا گمان کرو، تم اسے پاؤ گے۔ اور بعض گمان گناہ ہیں۔ اللہ کی قسم! اگر گمان نہ ہوتا تو کوئی مخلوق کبھی اللہ کی نافرمانی نہ کرتی۔ اور نافرمانی ضروری ہے، اور یہ فعل یا ترک میں اللہ کا حکم ہے۔ پس گمان ضروری ہے۔ پس اللہ کی اپنے مخلوق پر رحمت میں سے یہ ہے کہ اس نے ان میں گمان پیدا کیا اور اسے وہم کے تقسیم کاروں میں سے بنا دیا۔ اور کسی کے لیے بھی کسی معاملے میں علم کا حصول ممکن نہیں ہے، اس لحاظ سے کہ وہ مشہود (جس کا مشاہدہ کیا گیا) پر حکم لگائے، نہ کہ شہود (مشاہدہ) کے لحاظ سے۔ کیونکہ تم اس چیز کو زائل کرنے پر قادر نہیں ہو جس کا تم نے مشاہدہ کیا ہے۔ اور اسی طرح باقی تمام قوتوں کا تعلق بھی ہے۔ لیکن حکم باقی رہتا ہے کہ جو کچھ وہ (قوت) عطا کرتی ہے، کیا اس سے علم حاصل ہوتا ہے یا گمان؟ پس اس مقام کے صاحب کے نزدیک صرف گمان ہی حاصل ہوتا ہے۔ لیکن اس کے علاوہ دوسرے لوگ اسے علم قرار دیتے ہیں، کیونکہ وہ اس حال کا ذوق نہیں رکھتے۔ پس اس چیز میں فرق کرو جو قوت عطا کرتی ہے اور اس چیز میں جو اس عطا کردہ پر حکم لگاتی ہے، کہ کیا گمان سے حکم لگایا جائے گا یا علم سے؟ پس معاملہ اپنی ذات میں دلیل کے عین میں شبہہ ہے، اور اگر معاملہ ایسا نہ ہوتا تو رب اور بندے میں اور حق (الحق) اور خلق میں کوئی تمیز نہ رہتی۔ اگر تم سمجھ گئے تو یہ ان نتائج میں سے کچھ ہے جو یہ ذکر تمہارے لیے پیدا کرتا ہے۔ اور اللہ حق فرماتا ہے اور وہی راہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و سیزدهم در شناخت حال قطبی که منزل او «کهیعص ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا» (یاد رحمت پروردگارت بر بنده خود زکریا) بود.\n\nچون رحمت پروردگار مرا یاد کند، پیوسته می‌گویم:\n«ای پروردگار، پروردگار محمد!»\nزیرا برای رحمت تأکیدی است که او پروردگار محمد بود،\nپس این ذکر را در هر مشهدی (مشهد) بلند کنید.\nپس خداوند رحمان او را برای خلق، رحمتی فرستاد،\nدر هر حالی، میان هدایت‌کننده و هدایت‌شده.\n\n### [اینکه خداوند محمد (صلی الله علیه و سلم) را رحمتی برای جهانیان برانگیخت]\n\nخداوند متعال فرمود: «وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ» (و تو را جز رحمتی برای جهانیان نفرستادیم). و به او وحی کرد که خداوند تو را دشنام‌دهنده و لعنت‌کننده برنینگیخته، بلکه تو را رحمت برانگیخته است. و درباره بنده خود خضر (علیه السلام) فرمود: «آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا» (از جانب خود به او رحمتی عطا کردیم). پس رحمت را بر علم مقدم داشت، و آن رحمتی است که در سرشت (جبلة) اوست. سپس فرمود: «وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا» (و از نزد خود دانشی به او آموختیم). پس این علم را به خاطر قولش «لَدُنَّا» (از نزد ما) به او عطا کرد؛ رحمتی که در ناخوشایند پنهان است. و به واسطه همین رحمت بود که پسر را کشت و کشتی را سوراخ کرد، و به واسطه رحمت اول بود که دیوار را برپا داشت. پس میان این دو رحمت فرق نمی‌گذارد مگر صاحب این ذکر. زیرا رحمت است که او را یاد می‌کند، نه اینکه او رحمت را یاد کند. پس به واسطه یاد کردنش، حقیقت آنچه در آن است را به او می‌بخشد، چرا که رحمت از او می‌خواهد که عاشقش شود، زیرا ظهور و آشکاری برای رحمت جز به واسطه او نیست، پس رحمت مشتاق چنین کسی است.\n\n### [وجوب رحمت با زکریا]\n\nو بدان که این ذکر، تعریفی الهی است به وجوب حکم رحمت در حق آن بنده از بندگانش که او را یاد می‌کند. و زکریا (علیه السلام) به خاطر خصوصیت ذکر نیامد، بلکه عنایت بنده او را سوق داد، زیرا عنایت او را یاد نکرد مگر به دلیل اینکه او در تمامی احوالش بنده حق تعالی بود. پس هر شخصی را که خداوند در این مقام (مقام) برپا دارد، به واسطه رحمتش بر او برپا داشته تا رحمت پروردگارش را نزد او یاد کند. پس حال عبودیت (عبودية) او، عین رحمت ربانی (الرحمة الربانية) است که او را یاد کرده است. پس رحمت به پروردگارش اعلام کرد که نزد این بنده است. بنابراین، هر آنچه از این شخص صادر شود، نزد خداوند متعال پذیرفته است. و از این مقام، آنچه مختص به اوست و برای دیگری نیست، از جانب خداوند به او می‌رسد؛ و آن امری است که به واسطه آن ممتاز می‌شود و به او اختصاص می‌یابد. زیرا هر مقربی نزد خداوند، ناگزیر باید امری مختص به خود داشته باشد. و شریعت در تعریف این امر اشاره کرده و فرموده است: هیچ مؤمنی نیست مگر اینکه ناگزیر باید با پروردگارش به تنهایی مناجات کند، در حالی که میان او و پروردگارش هیچ ترجمانی نیست.\n\nپس خداوند سایه حمایت خود را بر او می‌افکند، و این همان عموم رحمتش بر اوست. و آنجا محل به دست آوردن چیزی است که مختص به اوست. قیامت برای این بنده در همان جایی که بود، واقع شد؛ زیرا برخی از بندگان خدا هستند که قیامتشان برایشان تعجیل می‌شود و آنچه امرشان در سرای آخرت به آن منتهی می‌شود را می‌بینند، و این همان بشارتی است که مؤمن در زندگی دنیا دارد. و ما این را به صورت ذوق (ذوق) مشاهده کردیم و در آن مواقفی داشتیم، از جمله در یک شب صد موقف (مقام) با گرفتن و بازگشتن، که اگر آن شب را بر اندازه آن وقوف‌ها تقسیم می‌کردند، گنجایش نداشت. و این در شهر فاس در سال پانصد و نود و سه (۵۹۳ق) بود. در هر موقفی از وسعت رحمت چیزی را مشاهده می‌کردم که بیان آن برایم ممکن نبود. و این به دلیل وسعت ذکر رحمت بود، پس چگونه خواهد بود ذکر الرحمن (خداوند بخشنده) اگر برای بنده حاصل شود؟ و این حاصل نمی‌شود مگر برای بنده گناه‌کار (الجانی). اما غیر گناه‌کار، او عین رحمت خداوند در خلقش است. به واسطه او خداوند بر خلق، کافر و مؤمن و مشرک و موحدشان، رحم می‌آورد. و به واسطه او بندگانش در دنیا روزی داده می‌شوند، و به واسطه او نصرت واقع می‌شود و باران می‌بارد و زمین حاصل‌خیز می‌شود و پیامبران زیاد می‌شوند و خیر عظیم می‌گردد. و او کسی است که به واسطه شهود (الشهود) در عین گناهان (الجنایات) معصوم است، پس بر آن‌ها به حکم قضا و قدر حاکم در دو طرف (خلق و حق) ظاهر می‌شود، اگر فهمیدی. پس در تو و از تو جز عین تو ظاهر نمی‌شود، و خداوند با علم خود در مورد تو حکم نمی‌کند مگر به آنچه از علم به خودت به او داده‌ای.\n\nو در اینجا قدم‌ها می‌لغزد و فهم‌ها به عقب بازمی‌گردد، و سلطان اوهام (الأوهام) بر احلام (ادراکات) حکم می‌راند، و حکم غالب، تام و دائمی از آنِ اوهام است. و به خدا سوگند، خداوند یافت نمی‌شود مگر نزد گمان (الظن) بنده به او. پس باید به او گمان نیک ببرد. و گمان از برخی از توزیع‌کنندگان وهم (الوهم) است، و اوست که عذاب تعجیل‌شده و نعمت تعجیل‌شده را می‌بخشد. پس گمان نیک ببر تا آن را بیابی، و «وَبَعْضُ الظَّنِّ إِثْمٌ» (بعضی از گمان‌ها گناه است). پس به خدا سوگند، اگر گمان نبود، هیچ مخلوقی هرگز خدا را نافرمانی نمی‌کرد. و ناگزیر باید نافرمانی باشد، و این حکم خداوند در فعل یا ترک است. پس ناگزیر باید گمان باشد. پس از رحمت خداوند بر خلقش این است که گمان را در آن‌ها آفرید و آن را از برخی از توزیع‌کنندگان وهم قرار داد. و به دست آوردن علم برای هیچ کس در هیچ امری ممکن نیست، از آن جهت که بر مشهود حکم می‌شود، نه از جهت شهود (الشهود). زیرا تو نمی‌توانی آنچه را شهود کرده‌ای از بین ببری، و همین‌طور است تعلق سایر قوای باقیه. اما حکم بر آنچه قوه به تو می‌دهد باقی می‌ماند که آیا به واسطه آن علم حاصل می‌شود یا گمان (الظن). پس نزد صاحب این مقام، جز گمان به طور خاص حاصل نمی‌شود، اما غیر او آن را علم می‌پندارد، به دلیل نچشیدن این حال. پس فرق بگذار میان آنچه قوه به تو می‌دهد و آنچه بر آن داده‌شده توسط قوه حکم می‌شود، که آیا به گمان حکم می‌شود یا به علم. پس امر در ذات خود، شبهه‌ای در عین دلیل است. و اگر امر چنین نبود، پروردگار از بنده و حق (الحق) از خلق متمایز نمی‌شد، اگر فهمیدی. پس این بخشی از چیزی است که این ذکر برای تو به بار می‌آورد. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 1
}