{
  "id": 384,
  "title": {
    "ar": "الباب الرابع والثمانون وثلاثمائة في معرفة المنازلات الخطابية",
    "en": "Chapter Three Hundred and Eighty-Four, Concerning the Gnosis of the Discursive Communications (المنازلات الخطابية).",
    "ur": "باب تین سو چوراسی: منازلِ خطاب (المنازلات الخطابية) کی معرفت میں۔",
    "fa": "باب سیصد و هشتاد و چهارم در معرفت منازلات خطابی (المنازلات الخطابية)"
  },
  "content": {
    "ar": "## «الباب الرابع والثمانون وثلاثمائة في معرفة المنازلات الخطابية»\n\n\nالفصل الخامس في المنازلات وهو من سر قوله عز وجل وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله إِلَّا وَحْياً أَوْ من وَراءِ حِجابٍ وهو من الحضرة المحمدية\n\n\n> منازلات العلوم تبدي *** حقائق الحق والعباد\n\n\n> بلا تغال ولا مراء *** ولا جدال ولا عناد\n\n\n> فقل لعقلي أقصر فنقلي *** يهدي إلى الغي والرشاد\n\n\n> فكل ذكري إلى صلاح *** وبعض فكري إلى فساد\n\n\n> فانفع العلم علم فقري *** للسيد الواهب الجواد\n\n\n### [المنازلة فعل فاعلين وهي تنزل من اثنين كل واحد يطلب الآخر لينزل عليه‏]\n\n\nاعلم أيدك الله وإيانا وأن المنازلة فعل فاعلين هنا وهي تنزل من اثنين كل واحد يطلب الآخر لينزل عليه أو به كيف شئت فقل فيجتمعان في الطريق في موضع معين فتسمى تلك منازلة لهذا الطلب من كل واحد وهذا النزول على الحقيقة من العبد صعود وإنما سميناه نزولا لكونه يطلب بذلك الصعود النزول بالحق قال تعالى إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ يَرْفَعُهُ فهو براقه الذي يسرى به إليه وينزل به عليه ويقول تعالى في حق نفسه على ما ذكره رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عنه فقال ينزل ربنا إلى السماء الدنيا كل ليلة\n\n\nالحديث بطوله فوصفه بالنزول إلينا فهذا نزول حق لخلق ومنا نزول خلق لحق لأنه لا يتمكن لنا أن يكون لنا العلو والكبرياء والغني عنه فلنا صفة الصغار والفقر إليه وله صفة الغني والكبرياء\n\n\n> فكلنا إليه فقير *** وكلنا لديه صغير\n\n\n> وكلنا نراه سوانا *** وهو الغني عنا الكبير\n\n\n> إلا أنا فإني أراه *** عيني وإنني لخبير\n\n\n> وبعد أن علمت ذا قلت إني *** إلى غناه عبد فقير\n\n\nوعلى الحقيقة فبنا ننزل عليه وبنا ينزل علينا ولو لا ذلك ما علمنا ما يقول في خطابه لنا فإنه الغني الحميد وعلى حقيقة الحقيقة فبه ننزل عليه وبه ينزل علينا وسواء كانت منازلة أو نزولا تاما فيكون المتكلم والسامع فهو يعلم ما يقول فإنه سمع من كان هذا مقامه فما سمع كلامه غيره ولما كان هو الأصل لم نكن إلا به فإن الفرع بصورة الأصل يخرج‏\nوفيها يظهر الثمر أعني في الفروع وتحصل الفوائد كما هي محل الحوائج فما ثم إلا هو\n\n\n> لو كان لي إليك سبيل *** ما كان لي عليك دليل‏\n\n\n> لذاك أنت رب عزيز *** وإنني العبيد الذليل‏\n\n\n> عجبت من إله وعبد *** وفي منزل علي يهول‏\n\n\n> إضافة وحرفي شمول *** بأنه ونحن عديل‏\n\n\n> الله قاله لم يقله *** كون فقلته إذ يقول‏\n\n\n> ومن ذلك هذا هو الأمر الذي *** لا بد منه وكفى‏\n\n\n> فاعمل على قولي إذا *** كنت به متصفا\n\n\n> وكن إذا ناظرك ألحق *** عليه منصفا\n\n\n> فأنت إن خالفته *** كنت بها على شفا\n\n\n### [الحق لا يكلم عباده ولا يخاطبهم إلا من وراء حجاب‏]\n\n\nواعلم أن الحق لا يكلم عباده ولا يخاطبهم إلا من وَراءِ حِجابٍ صورة يتجلى لهم فيها تكون له تلك الصورة حجابا عنه ودليلا عليه كالصورة الظاهرة الجسدية من الإنسان إذا أرادت النفس الناطقة أن تكلم نفسا أخرى كلمتها من وراء حجاب صورة جسدها بلسان تلك الصورة ولغتها مع كون النفس مخلوقة وأمرها كما ذكرناه فكيف بالخالق فلا يشهد المنازل في المنازلات الخطابية إلا صور عنها تأخذ ما تترجم له عنه من الحقائق والأسرار وهي السنة الفهوانية وحد المنازلات من العماء إلى الأرض وما بينهما فمهما فارقت الصورة العماء وفارقت الصورة الإنسانية الباطنة الأرض ثم التقتا فتلك المنازلة فإن وصلت إلى العماء أو جاءها الأمر إلى الأرض فذلك نزول لا منازلة والمحل الذي وقع فيه الاجتماع منزل وتسمى هذه الحضرة التي منها يكون الخطاب الإلهي لمن شاء من عباده حضرة اللسن ومنها كلم الله تعالى موسى عليه السلام أ لا تراه تجلى له في صورة حاجته ومنها أعطى رسول الله صَلَّى اللهُ عَليهِ وسَلَّم جوامع الكلم فجمع له في هذه الحضرة صور العالم كلها فكان علم أسماء هذه الصور علم آدم عليه السلام وأعيانها لمحمد صَلَّى اللهُ عَليهِ وسَلَّم مع أسمائها التي أعطيت لآدم عليه السلام فإن آدم من الأولين الذين أعطى الله محمدا صَلَّى اللهُ عَليهِ وسَلَّم علمهم‏\n\n\nحين قال عن نفسه إنه أعطاه الله علم الأولين والآخرين‏\n\n\nومنها آتي الله تعالى داود عليه السلام الْحِكْمَةَ وفَصْلَ الْخِطابِ وجميع الصحف والكتب المنزلة من هذه الحضرة صدرت ومنها أملى الحق على القلم الأعلى ما سطره في اللوح المحفوظ وكلام العالم كله غيبه وشهادته من هذه الحضرة والكل كلام الله فإنها الحضرة الأولى فإن الممكنات أول ما لها من الله تعالى في إيجادها قول كن ففتق الأسماع من الممكنات هذا الخطاب وآخِرُ دَعْواهُمْ في الجنة الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ عند قول الله لأهل الجنة رضائي عنكم فلا أسخط عليكم أبدا ولو لا نفس الرحمن ما ظهرت أعيان الممكنات الكلمات‏\n\n\n### [الحركة لا تكون إلا من متحرك في شي‏ء عن قصد من المحرك‏]\n\n\nواعلم أن الحركات كانت ما كانت لا تكون إلا من متحرك في شي‏ء عن قصد من المحرك كان المحرك نفسه أو غيره فتحدث الصور عن حركته لا بل عن تحركه فيما تحرك فيه بحسب قصده فتتشكل الصور بحسب الموطن وبالقصد الذي كان من المحرك كالحروف في النفس الخارج من الإنسان إذا قصد إظهار حرف معين لإيجاد عينه في موطنه الذي هو له انفتحت صورة الحرف في ذلك الموطن فعين لذلك الحرف اسما يخصه يتميز به عن غيره إذا ذكر كما تتميز صورته عن صورة غيره إذا حضر وذلك بحسب امتداد النفس ثم إذا قصد إظهار كلمة في عينها قصد عند إظهار أعيان الحروف في نفسه إظهار حروف معينة لا يظهر\n\n\nغيرها فينضم في السمع بعضها إلى بعض فتحدث في السمع الكلمة وهي نسبة ضم تلك الحروف ما هي أمر زائد على الحروف إلا أنها نسبة جمعها فتعطي تلك الجمعية صورة لم تكن الحروف مع عدم هذه النسبة الجمعية تعطيها فهذا تركيب أعيان العالم المركب من بسائطه فلا تشهد العين إلا مركبا من بسائط والمركب ليس بأمر زائد على بسائطه إلا نسبة جمع البسائط وإنما ذكرنا هذا حتى تعلم أن ما تشهده العين والتركيب‏\nفي أعيان هذه الحروف لا يتناهى فلذلك لا تنفذ كلمات الله فصور الكلمات تحدث أي تظهر دائما فالوجود والإيجاد لا يزال دائما فاعلم أيها المركب من أنت وبما ذا تركبت وكيف لم تظهر لعينك في بسائطك وظهرت لعينك في تركيبك وما طرأ أمر وجودي إلا نسبة تركيب تحكم عليه بأمر لم تكن تحكم به قبل التركيب فافهم أنشأ صورة كن من النفس ثم الكائنات عن كن فما أظهرت إلا كلمات كلها عن كن وهي لفظة أمر وجودي فما ظهر عنها إلا ما يناسبها من حروف مركبة تجتمع مع كن في كونها كلمة فما أمره يعني إلا واحدة وهي قوله كن قال تعالى وما أَمْرُنا إِلَّا واحِدَةٌ وقال إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ ذلك الشي‏ء في عينه فيتصف ذلك المكون بالوجود بعد ما كان يوصف بأنه غير موجود إلا أنه ثابت مدرج في النفس غير موجود الحرفية فالمنازلة الأصلية تحدث الأكوان وتظهر صور الممكنات في الأعيان فمن علم ما قلناه علم العالم ما هو ومن هو فسبحان من أخفى هذه الأسرار في ظهورها وأظهرها في خفائها فهي الظاهرة الباطنة والأولى والآخرة لقوم يعقلون‏\n\n\n> والعين واحدة والحكم للنسب *** والعين ظاهرة والكون للسبب‏\n\n\nقال تعالى وما رَمَيْتَ فنفى إِذْ رَمَيْتَ فأثبت عين ما نفى ولكِنَّ الله رَمى‏ فنفى عين ما أثبته فصار إثبات الرمي وسطا بين طرفي نفي فالنفي الأول عين النفي الآخر فمن المحال أن يثبت عين الوسط بين النفيين لأنه محصور فيحكم عليه الحصر ولا سيما والنفي الآخر قد زاد على النفي الأول بإثبات الرمي له لا للوسط فثبت الرمي في الشهود الحسي لمحمد صَلَّى اللهُ عَليهِ وسَلَّم بثبوت محمد صَلَّى اللهُ عَليهِ وسَلَّم في كلمة الحق فكما هو رام لا رام كذلك هو في الكلمة الإلهية محمد لا محمد إذ لو كان محمدا كما تشهد صورته لكان راميا كما يشهد رميه فلما نفى الرمي عنه الخبر الإلهي انتفى عينه إذ لا فرق بين عينه ورميه وهكذا فَلَمْ تَقْتُلُوهُمْ ولكِنَّ الله قَتَلَهُمْ وهذه هي البصيرة التي كان عليها الدعاة إلى الله يعلمون من يدعو إلى الله ومن يدعي إلى الله فالإدراك واحد فإذا أدرك به الأمر على ما هو عليه سمي بصيرة لأنه علم محقق وإذا أدرك به عين نسبة ما ظهر في الحس سمي بصرا فاختلفت الألقاب عليه باختلاف الموطن كما اختلف حكم عين الأداة وإن كانت بصورة واحدة حيث كانت تختلف باختلاف المواطن مثل أداة لفظة ما لا شك أنها عين واحدة ففي موطن تكون نافية مثل قوله وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله وفي موطن تكون تعجبا مثل قوله فَما أَصْبَرَهُمْ عَلَى النَّارِ وفي موطن تكون مهيئة مثل قوله رُبَما يَوَدُّ الَّذِينَ كَفَرُوا وفي موطن تكون اسما مثل قوله إِلَّا ما أَمَرْتَنِي به إلى أمثال هذا وقد تكون مصدرية وتأتي للاستفهام وتأتي زائدة وغير ذلك من مواطنها فهذه عين واحدة حكمت عليها المواطن بأحكام مختلفة كذلك صور التجلي بمنزلة الأحكام لمن يعقل ما يرى فأبان الله لنا فيما ذكره في هذه الآية أن الذي كنا نظنه حقيقة محسوسة إنما هي متخيلة يراها رأى العين والأمر في نفسه على خلاف ما تشهده العين وهذا سار في جميع القوي الجسمانية والروحانية فالعالم كله في صور مثل منصوبة فالحضرة الوجودية إنما هي حضرة الخيال ثم تقسم ما تراه من الصور إلى محسوس ومتخيل والكل متخيل وهذا لا قائل به إلا من أشهد هذا المشهد فالفيلسوف يرمي به وأصحاب أدلة العقول كلهم يرمون به وأهل الظاهر لا يقولون به نعم ولا بالمعاني التي جاءت له هذه الصور ولا يقرب من هذا المشهد إلا السوفسطائية غير أن الفرق بيننا وبينهم إنهم يقولون إن هذا كله لا حقيقة له ونحن لا نقول بذلك بل نقول إنه حقيقة ففارقنا جميع الطوائف ووافقنا الله ورسوله بما أعلمناه مما هو وراء ما أشهدناه فعلمنا ما نشهد والشهود عناية من الله أعطاها إيانا نور الايمان الذي أنار الله به بصائرنا ومن علم ما قررناه علم علم الأرض المخلوقة من بقية خميرة طينة آدم عليه السلام وعلم إن العالم بأسره لا بل الموجودات هم عمار تلك الأرض وما خلص منها إلا الحق تعالى خالقها ومنشئها من حيث هويته إذ كان له الوجود ولا هي ولو لا ما هو الأمر على ما ذكرناه ما صحت‏\n\n\nالمنازلة بيننا وبين الحق ولا صح نزول الحق إلى السماء الدنيا ولا الاستواء على العرش ولا العماء الذي كان فيه ربنا قبل إن يخلق خلقه فلو لا حكم الاسم الظاهر ما بدت هذه الحضرة ولا ظهر هذا العالم بالصورة ولو لا الاسم الباطن ما عرفنا إن الرامي هو الله في صورة محمدية فما فوق ذلك من الصور فقال وما كانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ الله وهو بشر إِلَّا وَحْياً مثل قوله ولكِنَّ الله رَمى‏\nفالرامي هو الله والبصر يشهد محمدا أَوْ من وَراءِ حِجابٍ صورة بشرية لتقع المناسبة بين الصورتين بالخطاب أَوْ يُرْسِلَ رَسُولًا وهو ترجمان الحق في قلب العبد نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ فإذا أوحى الله إلى الرسول البشري من الوجه الخاص بارتفاع الوسائط وألقاه الرسول علينا فهو كلام الحق لنا من وراء حجاب تلك الصورة المسماة رسولا إن كان مرسلا إلينا أو نبيا وقد تكون هذه الرتبة لبعض الأولياء فإذا انكشف الغطاء البشري عن عين القلب أدرك جميع صور الموجودات كلها بهذه المثابة في خطاب بعضهم بعضا وسماع بعضهم من بعض فأنجد المتكلم والسامع والباطش والساعي والمحس والمتخيل والمصور والحافظ وجميع القوي المنسوبة إلى البشر فالمنازلات كلها برزخية بين الأول والآخر والظاهر والباطن وصور العالم وصور التجلي فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله فالمترجم المتكلم وقد عرفنا إن الكلام المسموع هو كلام الله لا كلامه فتنظر ما جاء به في خطابه البرزخى وافتح عين الفهم لإدراكه وكن بحسب ما خاطبك به ولا يسمع كلام الله إلا بسمع الله ولا كلام الصورة إلا بسمع الصورة والسامع من وراء السمع والمتكلم من وراء الكلام والله من وَرائِهِمْ مُحِيطٌ بَلْ هُوَ قُرْآنٌ مَجِيدٌ في لَوْحٍ مَحْفُوظٍ من التبديل والتغيير فأما ما يدل على توحيد وإما صفة تنزيه وإما صفة فعل وإما ما يعطي الاشتراك وإما تشبيه وإما حكم وإما قصص وإما موعظة بترغيب أو ترهيب أو دلالة على مدلول عليه فهو محصور بين محكم ومتشابه كل خطاب في العالم فالطور الجسم لما فيه من الميل الطبيعي لكونه لا يستقل بنفسه في وجوده وكتاب مسطور عن إملاء إلهي ويمين كاتبة بقلم اقتداري في رق وهو عينك من باب الإشارة لا من باب التفسير منشور ظاهر غير مطوي فما هو مستور والبيت المعمور وهو القلب الذي وسع الحق فهو عامرة والسقف المرفوع ما في الرأس من القوي الحسية والمعنوية والبحر المسجور رأى الطبيعة الموقدة بما فيها من النار الحاكم الموجب للحركة إن عذاب ربك لواقع أي ما تستعذ به النفس الحيوانية والروح الامري والعقل العلوي من سيدها المربي لها المصلح من شأنها لواقع لساقط عليها إذ كانت لها المنازل السفلية من حيث إمكانها مطلقا ومن حيث طبعها مقيدا ما لَهُ من دافِعٍ لأنه ما ثم غير ما ذكرناه فمن عندنا التلقي لتدليه والترقي لتدانيه وبين هذين الحكمين ظهور البرازخ التي لها المجد الشامخ والعلم الراسخ وقد تكون المنازلة بين الأسماء الإلهية مثل المنازلة في الحرب على هذا الإنسان إذا خالف أمر الله فيطلبه التواب والغفور والرحمن ويطلبه المنتقم والضار والمذل وأمثالهم وقد ورد في الحديث من هذا الباب‏\n\n\nقوله تعالى ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة المؤمن يكره الموت وأكره مساءته ولا بد له من لقائي‏\n\n\nوهذا من المنازلة وقد ذقت هذا الكشف رأيته من الله في قتل الدجال بحضور رسول الله صَلَّى اللهُ عَليهِ وسَلَّم معي فيه ومن هنالك انفتح لي باب بسط الرحمة على عباد الله وعلمت إن رحمته وَسِعَتْ كُلَّ شَيْ‏ءٍ فلا بد أن ينفذ حكمها في كل شي‏ء وعلمت حكمة انعدام الأعراض لا نفسها في الزمان الثاني من زمان وجودها وخلق الله الأمثال في المحل أو الأضداد إذ لو ثبت عرض ثبوت محله إذا لم يكن محله معنى مثله أي عرض آخر مثله في العرضية لبقي كما يبقى الجوهر ولم تكن تتبدل حاله على الجوهر فيكون إما دائم الشقاء من أول خلقه أو دائم السعادة فتكون رحمة الله قاصرة على أعيان مخصوصين كما تكون بالوجوب في قوم منعوتين بنعت خاص وفيمن لا ينالها بصفة مقيدة وجوبا تناله الرحمة من باب الامتنان كما نالت هذا الذي استحقها ووجبت له بالصفة التي أعطته فاتصفت بها فوجبت الرحمة له فالكل على طريق الامتنان نالها ونالته فما ثم إلا منة إلهية أصلا وفرعا ثم تسري المنازلة بين الإصبعين من أصابع الرحمن في القلب في ميدان الإرادة فإن أزاغه أزاغه رحمان وإن أقامه أقامه رحمان فما ثم حكم إلا له لأنه المستوي على العرش فلا تنفذ الأحكام إلا من هذا الاسم ثم تظهر المنازلة بين الملك والشيطان على القلب باللمتين اللتين يجدهما المكلف في قلبه فإن لم يكن مكلفا ووجد التردد في قلبه فلا يخلو إما أن يكون في دار تكليف أو لا يكون فإن كان في دار تكليف فالتردد إنما هو من اللمة الملكية واللمة الشيطانية بطلب كل واحد منهما لما نفذت فيه لمته أن يكون للمكلف في ذلك دخول بإعانة في فساد فيجوز الإثم عليه كصبيين لم يبلغا حد التكليف فيتضاربان عن لمة الشيطان التي غلبت على كل واحد منهما فيجي‏ء والداهما أو شخصان من قرابتهما أو جيرانهما أو من‏\nكان من الحاضرين من الناس فيدخلون بينهما بغير ميزان شرعي بل حمية غرض فربما يؤدي ذلك إلى أن يكتسبوا إثما فيما سعوا به في حقهما فلهذا تكون حركة الصبي بالشر عن لمة الشيطان فافهم واعرف المواطن تقر بالعلم الأتم وإن كان غير مكلف ولا في دار تكليف ووجد التردد في أمر بين فعلين لا حرج عليه فيما يفعل منهما فذلك التردد والمنازلة بين الخاطرين كالتردد الإلهي غير أنه في العبد من أجل طلب الأولى والأعلى في حقه كما يتردد المكلف بين طاعتين أيتهما يفعل فهذا تردد إلهي ما هو عن اللمتين إنما هما غرضان أو غرض واحد تعلق بأمرين إما على التساوي أو إبانة ترجيح يقتضيه الوقت وما هو مكلف ولا في دار تكليف لأنه لو لا التكليف ما قرب شيطان إنسانا بإغواء أبدا لأنه عبث والعبث لا يفعله الحق لأن الكل فعله وإليه يرجع الأمر كله فصاحب علم المنازلات لا بد له أن يقف على هذا كله وأمثاله وكل تردد في العالم كله فهذا أصله أما التردد الإلهي أو\n\n\nالإصبعان أو اللمتان فشي‏ء آخر له حكم ما هنالك والأصل التردد الإلهي وما تعطيه حقائق الأسماء الإلهية المتقابلة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ فلنذكر في هذا الفصل بعض ما حصل لنا في المنازلات من المعارف الإلهية فإنها أكثر من أن تحصى فمن ذلك ما نذكره‏\n\n",
    "en": "Chapter Three Hundred and Eighty-Four: On the Knowledge of the Dialogical Conferences (المنازلات الخطابية)\n\nThe Fifth Section on the Conferences (المنازلات), which derives from the secret of His saying, exalted is He: <<It is not for any human being that Allah should speak to him except by revelation (وحياً) or from behind a veil (حجاب)>> [Q 42:51]. This is from the Muhammadan Presence (الحضرة المحمدية).\n\n> The conferences of knowledges reveal\n> The Realities of the Real (الحق) and the creatures,\n> Without exaggeration or dispute,\n> Nor argumentation nor obstinacy.\n> So tell my intellect to cease, for my transmission\n> Guides toward error and guidance.\n> For all my remembrance leads to righteousness,\n> While some of my thought leads to corruption.\n> The most beneficial knowledge is the knowledge of my poverty\n> Before the Generous, Bestowing Master.\n\n### [The *Munāzala* (Mutual Descending/Conference) is the act of two agents, being a descent from two, where each seeks the other to descend upon him.]\n\nKnow, may Allah support you and us, that the Conference (المنازلة) here is the act of two agents, being a descent from two, where each seeks the other to descend upon him or by him—say as you wish. They meet on the path in a specific location, and this is called a Conference due to this seeking from each party.\n\nThis descent, in reality, is an ascent (صعود) from the servant. We only call it a descent because, through that ascent, the servant seeks the descent of the Real (الحق). The Exalted said: <<To Him ascends the good word, and the righteous deed elevates it>> [Q 35:10]. This ascent is his Buraq (celestial steed) by which he journeys to Him and descends upon Him.\n\nThe Exalted speaks concerning Himself, as mentioned by the Messenger of Allah (peace and blessings be upon him) reporting from Him, saying: \"Our Lord descends to the lowest heaven every night...\" (The Hadith in its entirety). Thus, He described Himself with descent toward us. This is the descent of the Real toward creation (خلق), and our descent is the descent of creation toward the Real. This is because it is not possible for us to possess loftiness, grandeur, or independence from Him. We possess the attribute of smallness and poverty toward Him, and He possesses the attribute of independence (الغني) and grandeur (الكبرياء).\n\n> All of us are poor toward Him,\n> And all of us are small before Him.\n> And all of us see Him as other than us,\n> While He is the Independent, the Great, beyond us.\n> Except for me, for I see Him\n> As my very eye, and I am truly experienced.\n> And after I knew this, I said: Indeed, I\n> Am a poor servant toward His Independence.\n\nAnd in reality (على الحقيقة), it is through us that we descend upon Him, and through us that He descends upon us. Were it not for this, we would not know what He says in His address to us, for He is the Independent, the Praiseworthy. And upon the Reality of Realities (حقيقة الحقيقة), it is by Him that we descend upon Him, and by Him that He descends upon us.\n\nWhether it is a Conference (منازلة) or a complete Descent (نزول), the speaker and the listener are one, and He knows what He says, for whoever attained this station heard Him, and no one else heard His speech. Since He is the Origin (الأصل), we are only by Him, for the branch (الفرع) emerges in the form of the Origin. It is in the branches that the fruit appears—meaning the benefits are realized—as they are the locus of needs. Thus, there is nothing there but Him.\n\n> If I had a path to You,\n> I would have no proof against You.\n> Therefore, You are a Mighty Lord,\n> And I am the abject servant.\n> I marvel at a God and a servant\n> In a lofty, awe-inspiring station.\n> An attribution and a letter of inclusion,\n> That He and we are equals.\n> Allah said it, the cosmos did not say it,\n> So I said it when He speaks.\n> And from that, this is the matter which\n> Is inevitable and sufficient.\n> So act according to my saying if\n> You are characterized by it.\n> And be just toward the Real\n> When He looks upon you.\n> For if you oppose Him,\n> You would be upon a brink.\n\n### [The Real does not speak to His servants or address them except from behind a veil.]\n\nKnow that the Real (الحق) does not speak to His servants or address them except from behind a veil (حجاب)—a form in which He manifests (يتجلى) to them. That form serves as a veil (حجاب) for Him and a proof (دليل) for Him.\n\nThis is like the apparent physical form of a human being: if the rational soul (النفس الناطقة) wishes to speak to another soul, it speaks to it from behind the veil of its physical form, using the tongue and language of that form. This is the case even though the soul is created and its affair is as we have mentioned, so how then is it with the Creator?\n\nTherefore, the one who descends (المنازل) in the Dialogical Conferences (المنازلات الخطابية) witnesses nothing but forms from which he takes what is translated to him concerning the Realities (الحقائق) and secrets (الأسرار). This is the \"Fahwāniyya Sunna\" (the tradition of understanding/implication).\n\nThe boundary of the Conferences (المنازلات) is from the Cloud (*al-Amā’*) to the Earth and what is between them. Whenever the form leaves the Cloud and the inner human form leaves the Earth, and then they meet, that is the Conference. If it reaches the Cloud, or if the command comes to the Earth, that is a Descent (نزول), not a Conference.\n\nThe place where the meeting occurs is called a station (*manzil*). This Presence (حضرة) from which the Divine Address (الخطاب الإلهي) issues to whomever He wills among His servants is called the Presence of the Tongue (حضرة اللسن). From this Presence, Allah spoke to Moses (peace be upon him). Do you not see that He manifested to him in the form of his need?\n\nFrom this Presence, the Messenger of Allah (peace and blessings be upon him) was given the comprehensive words (*Jawāmi‘ al-Kalim*). In this Presence, all the forms of the World (العالم) were gathered for him. The knowledge of the Names (أسماء) of these forms was the knowledge of Adam (peace be upon him), but their Fixed Entities (أعيان) belonged to Muhammad (peace and blessings be upon him), along with the Names that were given to Adam. For Adam is among the ancients whose knowledge Allah gave to Muhammad (peace and blessings be upon him) when he said of himself that Allah had given him the knowledge of the first and the last.\n\nFrom this Presence, Allah granted David (peace be upon him) <<wisdom (الحِكْمَةَ) and decisive speech (فَصْلَ الْخِطابِ)>> [Q 38:20]. All the scriptures and revealed books originated from this Presence. From it, the Real (الحق) dictated to the Supreme Pen (القلم الأعلى) what it inscribed in the Preserved Tablet (اللوح المحفوظ).\n\nAll the speech of the World (العالم), both its unseen and its witnessed aspects, is from this Presence, and all of it is the Speech of Allah, for this is the First Presence (الحضرة الأولى). The first thing the possibilities (الممكنات) receive from Allah in their creation is the command \"Be!\" (*Kun*). This address splits open the hearing of the possibilities. And their last prayer in Paradise is <<Praise be to Allah, Lord of the Worlds>> [Q 10:10], which occurs when Allah says to the people of Paradise: \"My satisfaction is upon you, and I shall never be angry with you again.\" Were it not for the Breath of the All-Merciful (نفس الرحمن), the Fixed Entities (أعيان) of the possible things—the Words (الكلمات)—would not have appeared.\n\n### [Movement only occurs from a mover in something, based on the intention of the mover.]\n\nKnow that movements, whatever they may be, only occur from a mover in something, based on the intention (قصد) of the mover, whether the mover is itself or something else. Thus, forms (الصور) are generated by its movement—or rather, by its moving within that in which it moves—according to its intention. The forms are shaped according to the locus and the intention of the mover.\n\nThis is like the letters in the breath (النفس) exiting a human: if one intends to manifest a specific letter to bring its entity (عينه) into existence in its proper locus, the form of that letter opens up in that locus. A specific Name (اسم) is assigned to that letter, by which it is distinguished from others when mentioned, just as its form is distinguished from the form of others when present. This occurs according to the extension of the breath.\n\nThen, if one intends to manifest a word in its entity, one intends, when manifesting the entities of the letters in the breath, to manifest specific letters and no others. These letters join together in the hearing, and the Word (الكلمة) is generated in the hearing. This Word is the relationship of combining those letters; it is not an entity added to the letters, but rather the relationship of their collection. This collection gives a form that the letters, without this collective relationship, would not give.\n\nThis is the composition (تركيب) of the entities (أعيان) of the composite World (العالم المركب) from its simple elements (بسائطه). The eye witnesses nothing but a composite of simple elements, and the composite is not an entity added to its simple elements, except for the relationship of combining the simple elements.\n\nWe mentioned this so that you may know that what the eye witnesses, and the composition in the entities of these letters, is inexhaustible. Therefore, the Words of Allah (كلمات الله) are never exhausted. The forms of the Words are generated—that is, they appear constantly. Thus, Being (الوجود) and bringing into existence (الإيجاد) are perpetual.\n\nKnow, O composite being, who you are, by what you are composed, and how you did not appear to your eye in your simple elements but appeared to your eye in your composition. No existential matter (أمر وجودي) has occurred except as a relationship of composition, by which you judge it with a quality you did not judge it with before the composition. Understand this.\n\nHe originated the form of \"Be!\" (*Kun*) from the Breath (النفس), and then the existent things (الكائنات) from *Kun*. Nothing was manifested except Words (كلمات), all originating from *Kun*, which is a word of existential command (أمر وجودي). Nothing appeared from it except what corresponds to it: composite letters that gather with *Kun* in being a Word. His command, meaning, is only one, which is His saying *Kun* (Be!). The Exalted said: <<And Our command is but one>> [Q 54:50]. And He said: <<Indeed, Our word to a thing when We intend it is only that We say to it, 'Be!' and it is>> [Q 16:40].\n\nThat thing comes into its entity (عينه), and that created thing (المكون) is characterized by Existence (الوجود) after having been described as non-existent, though it was fixed (ثابت) and inscribed in the Breath (النفس), but not existent in its literal form. The original Conference (المنازلة الأصلية) generates the universes (الأكوان) and manifests the forms of the possibilities (الممكنات) in the Entities (الأعيان).\n\nWhoever knows what we have stated knows what the World (العالم) is and who it is. Glory be to Him who concealed these secrets in their manifestation and manifested them in their concealment. Thus, they are the Manifest (الظاهرة) and the Hidden (الباطنة), the First (الأولى) and the Last (الآخرة), for a people who understand.\n\n> The Entity (العين) is one, but the ruling belongs to the relationships,\n> And the Entity is manifest, while the cosmos (الكون) is due to the cause.\n\nThe Exalted said: <<And you did not throw (وما رَمَيْتَ)>>—thus negating—<<when you threw (إِذْ رَمَيْتَ)>> [Q 8:17]—thus affirming the very thing He negated—<<but Allah threw (ولكِنَّ الله رَمى)>> [Q 8:17]—thus negating the very thing He affirmed. The affirmation of the throwing became a middle ground between two poles of negation. The first negation is the very essence of the last negation. It is impossible to affirm the entity of the middle ground between the two negations because it is confined, and confinement rules over it. Especially since the last negation added to the first negation by affirming the throwing to Him (Allah), not to the middle ground (Muhammad).\n\nThe throwing was established in sensory Witnessing (الشهود الحسي) for Muhammad (peace and blessings be upon him) by the establishment of Muhammad (peace and blessings be upon him) in the Word of the Real (كلمة الحق). Just as he is a thrower, yet not a thrower, so too is he Muhammad in the Divine Word, yet not Muhammad. For if he were Muhammad as his form witnesses, he would be a thrower as his throwing witnesses. When the Divine Report negated the throwing from him, his entity (عينه) was negated, since there is no difference between his entity and his throwing. And similarly: <<It was not you who killed them, but Allah killed them>> [Q 8:17].\n\nThis is the insight (البصيرة) upon which the callers to Allah stood, knowing who calls *to* Allah and who claims to call *to* Allah. Perception (الإدراك) is one. If the matter is perceived by it as it truly is, it is called insight (بصيرة), because it is verified knowledge (علم محقق). If the entity of the relationship that appeared in the senses is perceived by it, it is called sight (*basar*).\n\nThe appellations differ based on the difference in the locus, just as the ruling concerning the entity of a tool differs, even if it has a single form, because it varies according to the loci. For example, the particle *mā* (ما) is undoubtedly a single entity. In one locus, it is negative, such as His saying: <<And none knows its interpretation (تَأْوِيلَهُ) except Allah>> [Q 3:7]. In another locus, it expresses wonder, such as His saying: <<How patient they are (فَما أَصْبَرَهُمْ) of the Fire!>> [Q 2:175]. In another locus, it is preparatory, such as His saying: <<Perhaps (رُبَما) those who disbelieved will wish...>> [Q 15:2]. In another locus, it is a noun, such as His saying: <<Except what You commanded me (إِلَّا ما أَمَرْتَنِي)>> [Q 5:117], and similar examples. It may also be a verbal noun marker, or come for interrogation, or come as an extra particle, and other such loci.\n\nThis is a single entity (عين واحدة) upon which the loci impose different rulings. Likewise, the forms of Theophany (صور التجلي) are like rulings for one who understands what he sees. Allah made clear to us, in what He mentioned in this verse, that what we thought was a sensible reality (حقيقة محسوسة) is merely an imagined thing (متخيلة) seen by the eye, and the matter in itself is contrary to what the eye witnesses.\n\nThis applies to all physical and spiritual faculties. The entire World (العالم) exists in established similitude-forms. The Presence of Existence (الحضرة الوجودية) is nothing but the Presence of Imagination (حضرة الخيال). Then you divide the forms you see into sensible and imagined, yet all of it is imagined. No one asserts this except one who has been granted Witnessing (الشهود) of this station. The philosopher rejects it, and the proponents of rational proofs all reject it, and the people of the exoteric (أهل الظاهر) do not assert it—indeed, they do not assert the meanings for which these forms came. No one approaches this station except the Sophists (السوفسطائية).\n\nHowever, the difference between us and them is that they say all of this has no reality (حقيقة), whereas we do not say that; rather, we say it is Reality. Thus, we differ from all groups and agree with Allah and His Messenger through what He has informed us of, which lies beyond what we have witnessed. Thus, we know what we witness, and the Witnessing (الشهود) is a grace from Allah, granted to us by the light of faith (نور الايمان) with which Allah illuminated our insights (بصائرنا).\n\nWhoever knows what we have established knows the knowledge of the Earth created from the remainder of the leaven of Adam’s clay (عليه السلام), and knows that the entire World (العالم)—indeed, all existent things (الموجودات)—are the inhabitants of that Earth. Nothing is purified from it except the Real (الحق), the Exalted, its Creator and Originator, in terms of His Ipseity (هويته), since Existence (الوجود) belonged to Him and not to it.\n\nWere the matter not as we have mentioned, the Conference (المنازلة) between us and the Real would not be valid, nor would the descent of the Real to the lowest heaven be valid, nor the settling upon the Throne (الاستواء على العرش), nor the Cloud (*al-Amā’*) in which our Lord was before He created His creation. Were it not for the ruling of the Name the Manifest (الظاهر), this Presence (حضرة) would not have begun, nor would this World (العالم) have appeared in form. And were it not for the Name the Hidden (الباطن), we would not have known that the Thrower is Allah in a Muhammadan form, and in the forms above that.\n\nSo He said: <<It is not for any human being (بشر) that Allah should speak to him>>—and he is a human—<<except by revelation (وحياً)>> [Q 42:51], similar to His saying: <<but Allah threw (ولكِنَّ الله رَمى)>> [Q 8:17]. The Thrower is Allah, but sight (البصر) witnesses Muhammad. <<Or from behind a veil (حجاب)>> [Q 42:51]—a human form, so that suitability may occur between the two forms through the address. <<Or He sends a messenger (رسولاً)>> [Q 42:51], who is the interpreter (ترجمان) of the Real in the heart of the servant: <<The Trustworthy Spirit (الرُّوحُ الْأَمِينُ) has descended with it upon your heart>> [Q 26:193-194].\n\nWhen Allah reveals to the human messenger from the specific aspect, with the removal of intermediaries, and the messenger conveys it to us, then it is the speech of the Real to us from behind the veil of that form called a messenger, if he is sent to us, or a prophet. This rank may also belong to some of the Friends of Allah (الأولياء). When the human veil is lifted from the eye of the heart, it perceives all the forms of existent things (الموجودات) in this same manner, in their addressing one another and hearing from one another.\n\nThus, the speaker and the listener, the striker and the runner, the sensible and the imagined, the shaper and the preserver, and all the faculties attributed to humanity are aided. All the Conferences (المنازلات) are intermediary (برزخية), existing between the First (الأول) and the Last (الآخر), the Manifest (الظاهر) and the Hidden (الباطن), the forms of the World (العالم) and the forms of Theophany (صور التجلي).\n\n<<Grant him protection until he hears the Word of Allah (كَلامَ الله)>> [Q 9:6]. The interpreter is the speaker, and we know that the speech heard is the Speech of Allah, not his own speech. So look at what came in his intermediary address (خطابه البرزخى), open the eye of understanding for its perception, and be according to what He addressed you with.\n\nThe Speech of Allah is not heard except by the hearing of Allah, and the speech of the form is not heard except by the hearing of the form. The listener is from behind the hearing, and the speaker is from behind the speech. <<And Allah encompasses them (مُحِيطٌ) from behind>> [Q 85:20]. <<Rather, it is a glorious Quran (قُرْآنٌ مَجِيدٌ) in a Preserved Tablet (لَوْحٍ مَحْفُوظٍ)>> [Q 85:21-22], protected from alteration and change.\n\nIt is either what indicates Unity (توحيد), or an Attribute of Transcendence (صفة تنزيه), or an Attribute of Act (صفة فعل), or what implies partnership, or similitude (تشبيه), or a ruling (حكم), or stories (قصص), or an admonition through encouragement or intimidation, or an indication toward something indicated. Every address in the World (العالم) is confined between the clear (*muḥkam*) and the ambiguous (*mutashābih*).\n\nThe physical Mount (al-Ṭūr) is due to the natural inclination within it, since it is not independent in its existence. And a <<Book inscribed (كتاب مسطور)>> [Q 52:2] from a Divine dictation, and a writing hand with a Pen of Power (قلم اقتداري) upon a parchment (*raqq*)—which is your entity (عينك), by way of allusion, not exegesis—<<spread open (منشور)>> [Q 52:3], manifest, not folded, so it is not concealed. And the <<Frequented House (البيت المعمور)>> [Q 52:4], which is the heart that encompassed the Real (الحق), so He is its inhabitant. And the <<Elevated Roof (السقف المرفوع)>> [Q 52:5] is what is in the head of sensory and spiritual faculties. And the <<Sea filled with flame (البحر المسجور)>> [Q 52:6] is the opinion of Nature (الطبيعة) ignited by the fire within it, which is the ruling factor necessitating movement.\n\n<<Indeed, the punishment of your Lord will occur (لواقع)>> [Q 52:7]. That is, what the animal soul (النفس الحيوانية), the spiritual soul (الروح الامري), and the celestial intellect (العقل العلوي) seek refuge from in their Lord, who nurtures them and rectifies their affairs, will certainly fall upon them, since they possess the lower stations (*manāzil*) absolutely by virtue of their possibility (إمكانها), and restrictedly by virtue of their nature (طبعها). <<There is none to avert it (ما لَهُ من دافِعٍ)>> [Q 52:8], because there is nothing there other than what we have mentioned.\n\nFrom us comes the reception (التلقي) for His drawing near (تدليه), and the ascent (الترقي) for our drawing near (تدانيه). Between these two rulings is the manifestation of the Isthmuses (البرازخ) which possess lofty glory and firmly established Knowledge (العلم الراسخ).\n\nThe Conference (المنازلة) may occur between the Divine Names (الأسماء الإلهية), such as the conference in war waged upon this human when he violates the command of Allah. The Names the Acceptor of Repentance (التواب), the Forgiving (الغفور), and the All-Merciful (الرحمن) seek him, while the Names the Avenger (المنتقم), the Harmer (الضار), and the Humiliator (المذل) and their likes also seek him.\n\nA Hadith concerning this matter has been reported, where the Exalted says: \"I have not hesitated concerning anything I am about to do as I hesitate concerning seizing the soul of My believing servant; he dislikes death, and I dislike causing him distress, but he must meet Me.\"\n\nThis is part of the Conference (المنازلة). I have tasted this Unveiling (الكشف) and saw it from Allah during the slaying of the Dajjal (Antichrist), with the Messenger of Allah (peace and blessings be upon him) present with me in it. From there, the door of extending Mercy (الرحمة) over the servants of Allah opened for me, and I knew that His Mercy <<encompasses everything (وَسِعَتْ كُلَّ شَيْءٍ)>> [Q 7:156], so its ruling must be executed in everything.\n\nI knew the wisdom behind the non-existence of accidents (*a‘rāḍ*)—not their essences—in the second moment of their existence. And Allah created similitudes in the locus, or opposites. For if an accident were to remain as long as its locus remains, and if its locus did not signify its like—meaning another accident similar to it in accidental nature—it would persist just as the substance (*jawhar*) persists, and its state upon the substance would not change. In that case, the servant would either be perpetually wretched from the beginning of his creation or perpetually happy, and the Mercy of Allah would be restricted to specific entities (أعيان مخصوصين).\n\nJust as Mercy is obligatory for a people characterized by a specific description, so too does Mercy reach, by way of grace (امتنان), those who do not attain it by an obligatorily restricted attribute, just as it reached the one who deserved it and for whom it became obligatory by the attribute that was given to him, with which he was characterized, making Mercy obligatory for him. Thus, everyone attained it and it attained them by way of grace. There is nothing there but Divine favor (منة إلهية), fundamentally and derivatively.\n\nThen the Conference (المنازلة) flows between the two Fingers (الإصبعين) of the All-Merciful (الرحمن) in the heart, in the field of Will (الإرادة). If He deviates it, the All-Merciful deviates it; and if He establishes it, the All-Merciful establishes it. There is no ruling there except for Him, because He is the One settled upon the Throne (العرش), and rulings are executed only from this Name.\n\nThen the Conference (المنازلة) appears between the Angel (الملك) and the Devil (الشيطان) over the heart, through the two impulses (*lammatayn*) that the responsible person (*mukallaf*) finds in his heart. If he is not responsible and finds hesitation in his heart, it must be that he is either in the Abode of Responsibility (دار تكليف) or not.\n\nIf he is in the Abode of Responsibility, the hesitation is only from the angelic impulse (اللمة الملكية) and the satanic impulse (اللمة الشيطانية), with each seeking that the responsible person, through the impulse that penetrated him, should have a hand in corruption, so that sin may be incurred upon him. This is like two children who have not reached the age of responsibility fighting due to the satanic impulse that overcame each of them. Then their parents, or two relatives, or neighbors, or any people present come and intervene between them without a legal standard, but rather out of zealous self-interest. This may lead them to acquire sin through what they sought to do on the children's behalf. For this reason, the child's movement toward evil is due to the satanic impulse. Understand this and know the loci, and you will affirm the most complete Knowledge (العلم الأتم).\n\nIf he is not responsible and not in the Abode of Responsibility, and finds hesitation in a matter between two actions, neither of which incurs blame upon him, that hesitation and Conference (المنازلة) is between two passing thoughts (*khāṭirayn*), similar to the Divine Hesitation (التردد الإلهي). However, in the servant, it is for the sake of seeking what is better and higher for him, just as the responsible person hesitates between two acts of obedience, wondering which one to perform. This is a Divine Hesitation; it does not stem from the two impulses (*lammatayn*), but rather from two objectives, or a single objective related to two matters, either equally or to clarify a preference necessitated by the time.\n\nAnd he is not responsible, nor is he in the Abode of Responsibility, because were it not for responsibility, the Devil would never approach a human with temptation, as that would be futility (*‘abath*), and the Real (الحق) does not commit futility, for all is His Act, and to Him all matters return.\n\nThe master of the science of Conferences (علم المنازلات) must grasp all of this and its likes. Every hesitation in the entire World (العالم) has this as its origin: either the Divine Hesitation (التردد الإلهي), the two Fingers (الإصبعان), or the two impulses (اللمتان). Each has a different ruling in its respective domain. The origin is the Divine Hesitation and what the realities of the opposing Divine Names (الأسماء الإلهية المتقابلة) bestow.\n\n<<And Allah speaks the Truth (الْحَقَّ), and He guides to the way>> [Q 33:4]. Let us mention in this section some of the Divine Gnosis (المعارف الإلهية) that we received in the Conferences (المنازلات), for they are too numerous to count. Among them is what we shall mention.",
    "ur": "باب نمبر تین سو چوراسی: خطابی منازلات (المنازلات الخطابية) کی معرفت میں\n\nپانچواں فصل منازلات (المنازلات) کے بارے میں ہے، اور یہ اللہ عزوجل کے اس فرمان کے راز میں سے ہے: \"اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے مگر وحی کے ذریعے یا پردے کے پیچھے سے\" (وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ)، اور یہ حقیقت محمدیہ (الحقیقۃ المحمدیۃ) کی حضرہ میں سے ہے۔\n\n> علوم کے منازلات (المنازلات) ظاہر کرتے ہیں\n> ذات حق (الحق) اور بندوں کی حقیقتوں کو\n> بغیر کسی مبالغے یا شک کے\n> اور نہ کسی جھگڑے یا ضد کے\n> پس اپنے عقل سے کہہ دو کہ رک جا، کیونکہ میرا نقل (روایت)\n> گمراہی اور ہدایت کی طرف رہنمائی کرتا ہے\n> پس میرا ہر ذکر اصلاح کی طرف ہے\n> اور میرا کچھ فکر فساد کی طرف ہے\n> پس میرے فقر کا علم فائدہ مند ہے\n> سخی، عطا کرنے والے آقا کے لیے۔\n\n### [منازلہ (المنازلة) دو فاعل کا فعل ہے اور یہ دو سے نازل ہوتا ہے، ہر ایک دوسرے کو طلب کرتا ہے تاکہ اس پر نازل ہو]\n\nجان لو، اللہ تمہیں اور ہمیں قوت دے، کہ منازلہ (المنازلة) یہاں دو فاعل کا فعل ہے، اور یہ دو سے نازل ہوتا ہے، ہر ایک دوسرے کو طلب کرتا ہے تاکہ اس پر یا اس کے ذریعے نازل ہو، تم جس طرح چاہو کہہ لو۔ پس وہ ایک معین مقام پر راستے میں جمع ہوتے ہیں، تو ہر ایک کی طرف سے اس طلب کو منازلہ (المنازلة) کہا جاتا ہے۔ اور حقیقت میں بندے کی طرف سے یہ نزول (نزول) ایک صعود (بلندی) ہے، اور ہم نے اسے نزول اس لیے کہا کہ وہ اس صعود کے ذریعے ذات حق (الحق) کے ساتھ نزول کو طلب کرتا ہے۔ اللہ تعالیٰ فرماتا ہے: \"اسی کی طرف پاکیزہ کلمات چڑھتے ہیں اور نیک عمل اسے بلند کرتا ہے\" (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ)۔ پس یہ اس کا براق ہے جس پر وہ اس کی طرف سفر کرتا ہے اور اس کے ذریعے اس پر نازل ہوتا ہے۔ اور اللہ تعالیٰ اپنے حق میں فرماتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس کے بارے میں ذکر کیا، فرمایا: \"ہمارا رب ہر رات آسمان دنیا کی طرف نازل ہوتا ہے\" (پوری حدیث)۔ پس اس نے ہمارے لیے نزول کی صفت بیان کی۔ تو یہ ذات حق (الحق) کا مخلوق کے لیے نزول ہے، اور ہماری طرف سے مخلوق کا ذات حق (الحق) کے لیے نزول ہے، کیونکہ ہمارے لیے یہ ممکن نہیں کہ ہم اس سے بے نیازی، بلندی اور کبریائی رکھیں۔ پس ہماری صفت اس کے سامنے عاجزی اور فقر ہے، اور اس کی صفت غنا اور کبریائی ہے۔\n\n> پس ہم سب اس کے محتاج ہیں\n> اور ہم سب اس کے نزدیک چھوٹے ہیں\n> اور ہم سب اسے اپنے سوا دیکھتے ہیں\n> اور وہ ہم سے بے نیاز، بڑا ہے\n> سوائے میرے، کہ میں اسے\n> اپنی آنکھ دیکھتا ہوں، اور میں یقیناً باخبر ہوں\n> اور جب میں نے یہ جان لیا تو میں نے کہا کہ میں\n> اس کی بے نیازی کے سامنے ایک فقیر بندہ ہوں۔\n\nاور حقیقت میں، ہم ہی اس پر نازل ہوتے ہیں اور ہم ہی پر وہ نازل ہوتا ہے، اور اگر ایسا نہ ہوتا تو ہم نہ جان پاتے کہ وہ اپنے خطاب میں ہم سے کیا کہتا ہے، کیونکہ وہ غنی (بے نیاز) اور حمید (قابل تعریف) ہے۔ اور حقیقت کی حقیقت میں، اسی کے ذریعے ہم اس پر نازل ہوتے ہیں اور اسی کے ذریعے وہ ہم پر نازل ہوتا ہے۔ اور خواہ یہ منازلہ (المنازلة) ہو یا مکمل نزول، تو متکلم اور سامع وہی ہوتا ہے، پس وہ جانتا ہے کہ وہ کیا کہہ رہا ہے، کیونکہ جس کا یہ مقام ہے اس نے سنا، تو اس کے کلام کو اس کے سوا کسی نے نہیں سنا۔ اور چونکہ وہ اصل ہے، اس لیے ہم اس کے بغیر نہیں ہیں، کیونکہ فرع اصل کی صورت میں ظاہر ہوتی ہے۔ اور اسی میں پھل ظاہر ہوتا ہے، یعنی فروع میں، اور فوائد حاصل ہوتی ہیں، جیسا کہ وہ ضروریات کا مقام ہیں۔ پس وہاں اس کے سوا کچھ نہیں۔\n\n> اگر میری طرف تیرا راستہ ہوتا\n> تو میرے لیے تجھ پر کوئی دلیل نہ ہوتی\n> اسی لیے تو رب عزیز ہے\n> اور میں ذلیل بندہ ہوں\n> مجھے ایک معبود اور بندے پر تعجب ہے\n> اور ایک بلند مقام پر جو خوفناک ہے\n> اضافت اور میرا حرفِ شمول (شامل کرنے والا حرف)\n> اس کے ساتھ کہ وہ اور ہم برابر ہیں\n> اللہ نے اسے کہا، کسی کون (وجود) نے نہیں کہا\n> پس میں نے اسے کہا جب وہ کہہ رہا تھا\n> اور اسی میں سے یہ وہ امر ہے\n> جو ناگزیر ہے اور کافی ہے\n> پس میرے قول پر عمل کر جب\n> تو اس سے متصف ہو\n> اور جب ذات حق (الحق) تجھ سے مناظرہ کرے\n> تو اس کے حق میں انصاف کرنے والا بن\n> پس اگر تو اس کی مخالفت کرے گا\n> تو تو اس کے کنارے پر ہوگا۔\n\n### [ذات حق (الحق) اپنے بندوں سے کلام نہیں کرتا اور نہ ہی انہیں مخاطب کرتا ہے مگر پردے کے پیچھے سے]\n\nاور جان لو کہ ذات حق (الحق) اپنے بندوں سے کلام نہیں کرتا اور نہ ہی انہیں مخاطب کرتا ہے مگر پردے کے پیچھے سے (مِن وَرَاءِ حِجَابٍ)، ایک ایسی صورت میں جس میں وہ ان کے لیے ظہور الٰہی (التجلی) کرتا ہے، اور وہ صورت اس کے لیے اس سے پردہ اور اس پر دلیل بن جاتی ہے۔ جیسے انسان کی ظاہری جسمانی صورت، جب نفس ناطقہ کسی دوسرے نفس سے کلام کرنا چاہتا ہے تو وہ اپنے جسم کی صورت کے پردے کے پیچھے سے اس صورت کی زبان اور لغت میں کلام کرتا ہے، حالانکہ نفس مخلوق ہے اور اس کا معاملہ ویسا ہی ہے جیسا ہم نے ذکر کیا، تو خالق کا کیا حال ہوگا؟ پس منازلات خطابیہ (المنازلات الخطابية) میں منازل (نازل ہونے والا) صرف ان صورتوں کا شہود (الشہود) کرتا ہے جن سے وہ ان حقائق اور اسرار کو لیتا ہے جو اس کے لیے ذات حق (الحق) کی طرف سے ترجمہ کیے جاتے ہیں، اور یہ سنت فہوانیہ ہے۔ اور منازلات (المنازلات) کی حد عماء (العماء) سے لے کر زمین اور ان کے درمیان تک ہے۔ پس جب بھی صورت عماء (العماء) سے جدا ہو اور باطنی انسانی صورت زمین سے جدا ہو، پھر وہ دونوں ملیں تو یہ منازلہ (المنازلة) ہے۔ لیکن اگر وہ عماء (العماء) تک پہنچ جائے یا امر زمین تک آ جائے تو وہ نزول ہے، منازلہ نہیں۔ اور جس مقام پر اجتماع واقع ہوتا ہے وہ منزل کہلاتا ہے۔ اور اس حضرہ کو، جس سے اللہ تعالیٰ اپنے بندوں میں سے جسے چاہتا ہے خطاب کرتا ہے، حضرہ لسن (حضرة اللسن) کہا جاتا ہے۔ اور اسی سے اللہ تعالیٰ نے موسیٰ علیہ السلام سے کلام کیا، کیا تم نہیں دیکھتے کہ اس نے ان کے لیے ان کی ضرورت کی صورت میں ظہور الٰہی (التجلی) کیا۔ اور اسی سے رسول اللہ صلی اللہ علیہ وسلم کو جوامع الکلم عطا کیے گئے، پس اس حضرہ میں آپ کے لیے تمام عالم کی صورتیں جمع کر دی گئیں۔ پس ان صورتوں کے اسماء کا علم آدم علیہ السلام کا علم تھا، اور ان کے اعیان (حقیقتیں) محمد صلی اللہ علیہ وسلم کے لیے تھے، ان اسماء کے ساتھ جو آدم علیہ السلام کو دیے گئے تھے۔ کیونکہ آدم ان اولین میں سے ہیں جن کا علم اللہ نے محمد صلی اللہ علیہ وسلم کو عطا فرمایا، جب آپ نے اپنے بارے میں فرمایا کہ اللہ نے آپ کو اولین و آخرین کا علم عطا فرمایا ہے۔\n\nاور اسی سے اللہ تعالیٰ نے داؤد علیہ السلام کو حکمت (الْحِكْمَةَ) اور فیصلہ کن خطاب (فَصْلَ الْخِطَابِ) عطا فرمایا۔ اور تمام صحیفے اور نازل شدہ کتابیں اسی حضرہ سے صادر ہوئیں۔ اور اسی سے ذات حق (الحق) نے قلم اعلیٰ پر وہ املا کیا جو اس نے لوح محفوظ میں لکھا۔ اور عالم کا سارا کلام، اس کا غیب اور اس کا شہود (الشہود)، اسی حضرہ سے ہے۔ اور یہ سب اللہ کا کلام ہے، کیونکہ یہ حضرہ اولیٰ ہے۔ اس لیے کہ ممکنات کو اللہ تعالیٰ کی طرف سے ان کے وجود میں سب سے پہلے جو چیز ملی وہ \"کن\" (ہو جا) کا قول ہے۔ پس ممکنات کے کانوں نے اس خطاب کو کھولا، اور جنت میں ان کی آخری پکار \"تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے\" (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ) ہوگی، جب اللہ اہل جنت سے فرمائے گا کہ میری رضا تم پر ہے، پس میں تم پر کبھی ناراض نہیں ہوں گا۔ اور اگر نفس رحمان نہ ہوتا تو ممکنات کے کلمات کے اعیان (حقیقتیں) ظاہر نہ ہوتے۔\n\n### [حرکت نہیں ہوتی مگر کسی چیز میں متحرک سے، متحرک کے ارادے سے]\n\nاور جان لو کہ حرکات، جو بھی ہوں، نہیں ہوتیں مگر کسی چیز میں متحرک سے، متحرک کے ارادے سے، خواہ متحرک خود ہو یا کوئی اور۔ پس صورتیں اس کی حرکت سے نہیں، بلکہ اس کے تحرک سے پیدا ہوتی ہیں جس میں وہ متحرک ہوا، اس کے ارادے کے مطابق۔ پس صورتیں مقام کے مطابق اور متحرک کے ارادے کے مطابق شکل اختیار کرتی ہیں۔ جیسے انسان سے نکلنے والے نفس میں حروف، جب وہ کسی معین حرف کو ظاہر کرنے کا ارادہ کرتا ہے تاکہ اس کے لیے مخصوص مقام میں اس کا عین (حقیقت) وجود میں آئے، تو اس مقام میں حرف کی صورت کھل جاتی ہے، اور اس حرف کے لیے ایک مخصوص نام مقرر کیا جاتا ہے جس سے وہ دوسروں سے ممتاز ہوتا ہے جب اس کا ذکر کیا جائے، جیسے اس کی صورت دوسروں کی صورت سے ممتاز ہوتی ہے جب وہ حاضر ہو۔ اور یہ نفس کے پھیلاؤ کے مطابق ہوتا ہے۔ پھر جب وہ کسی کلمہ کو اس کے عین میں ظاہر کرنے کا ارادہ کرتا ہے، تو وہ اپنے نفس میں حروف کے اعیان کو ظاہر کرتے وقت معین حروف کو ظاہر کرنے کا ارادہ کرتا ہے، اور ان کے سوا کوئی اور ظاہر نہیں ہوتا۔ پس سننے میں وہ ایک دوسرے سے مل جاتے ہیں، تو سننے میں کلمہ پیدا ہوتا ہے، اور یہ ان حروف کو ملانے کی نسبت ہے، یہ حروف پر کوئی زائد امر نہیں ہے، مگر یہ ان کے جمع ہونے کی نسبت ہے۔ پس یہ مجموعیت ایک ایسی صورت دیتی ہے جو حروف اس جمعی نسبت کے نہ ہونے کی صورت میں نہیں دیتے تھے۔ پس یہ عالم کے اعیان کی ترکیب ہے جو اپنے بسیط اجزاء سے مرکب ہے۔ پس آنکھ صرف بسیط اجزاء سے مرکب چیز کا شہود (الشہود) کرتی ہے، اور مرکب اپنے بسیط اجزاء پر کوئی زائد امر نہیں ہے، مگر بسیط اجزاء کے جمع ہونے کی نسبت ہے۔ اور ہم نے یہ اس لیے ذکر کیا تاکہ تم جان لو کہ جو کچھ آنکھ شہود (الشہود) کرتی ہے اور ان حروف کے اعیان میں جو ترکیب ہے وہ لامتناہی ہے، اسی لیے اللہ کے کلمات ختم نہیں ہوتے۔ پس کلمات کی صورتیں ہمیشہ پیدا ہوتی ہیں، یعنی ظاہر ہوتی رہتی ہیں۔ پس ہستی (الوجود) اور ایجاد ہمیشہ جاری ہے۔ پس اے مرکب! جان لو کہ تم کون ہو اور کس چیز سے مرکب ہوئے، اور تمہارے بسیط اجزاء میں تمہاری آنکھ کے لیے تم کیوں ظاہر نہ ہوئے اور تمہاری ترکیب میں تمہاری آنکھ کے لیے تم ظاہر ہوئے؟ اور کوئی وجودی امر طاری نہیں ہوا مگر ترکیب کی ایک نسبت، جس پر تم ایک ایسے امر کا حکم لگاتے ہو جس کا حکم تم ترکیب سے پہلے نہیں لگاتے تھے۔ پس سمجھو کہ اس نے نفس سے \"کن\" (ہو جا) کی صورت کو پیدا کیا، پھر کائنات \"کن\" سے پیدا ہوئیں۔ پس اس نے صرف کلمات کو ظاہر کیا، جو سب \"کن\" سے ہیں، اور یہ ایک وجودی امر کا لفظ ہے۔ پس اس سے وہی ظاہر ہوا جو اس کے مناسب ہے، مرکب حروف جو کلمہ ہونے میں \"کن\" کے ساتھ جمع ہوتے ہیں۔ پس اس کا امر (یعنی اللہ کا) صرف ایک ہے، اور وہ اس کا قول \"کن\" ہے۔ اللہ تعالیٰ فرماتا ہے: \"اور ہمارا امر تو صرف ایک ہی ہوتا ہے\" (وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ)۔ اور فرمایا: \"ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا قول صرف یہ ہوتا ہے کہ ہم اسے کہیں: ہو جا، تو وہ ہو جاتی ہے\" (إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَن نَّقُولَ لَهُ كُن فَيَكُونُ)۔ وہ چیز اپنے عین میں ہو جاتی ہے، پس وہ مخلوق ہستی (الوجود) سے متصف ہو جاتی ہے، بعد اس کے کہ اسے غیر موجود کہا جاتا تھا، مگر وہ نفس میں ثابت اور درج تھی، حرفی طور پر موجود نہیں تھی۔ پس اصلی منازلہ (المنازلة) اکوان کو پیدا کرتا ہے اور ممکنات کی صورتوں کو اعیان میں ظاہر کرتا ہے۔ پس جس نے ہماری کہی ہوئی بات کو جان لیا، اس نے جان لیا کہ عالم کیا ہے اور کون ہے۔ پس پاک ہے وہ ذات جس نے ان اسرار کو ان کے ظہور میں چھپایا اور ان کے چھپاؤ میں ظاہر کیا، پس وہ ظاہر (الظاہر) اور باطن (الباطن) ہے، اور اولیٰ (الأولى) اور آخرہ (الآخرة) ہے، ان لوگوں کے لیے جو عقل رکھتے ہیں۔\n\n> اور عین (حقیقت) ایک ہے اور حکم نسبتوں کے لیے ہے\n> اور عین ظاہر ہے اور کون (وجود) سبب کے لیے ہے۔\n\nاور اللہ تعالیٰ نے فرمایا: \"اور جب تم نے پھینکا تو تم نے نہیں پھینکا\" (وَمَا رَمَيْتَ) تو اس نے نفی کی، \"جب تم نے پھینکا\" (إِذْ رَمَيْتَ) تو اس نے اسی چیز کو ثابت کیا جس کی نفی کی تھی، \"بلکہ اللہ نے پھینکا\" (وَلَكِنَّ اللَّهَ رَمَىٰ) تو اس نے اسی چیز کی نفی کی جسے اس نے ثابت کیا تھا۔ پس پھینکنے کا اثبات دو نفیوں کے درمیان ایک واسطہ بن گیا۔ پس پہلی نفی بعینہٖ آخری نفی ہے۔ پس دو نفیوں کے درمیان واسطے کے عین کو ثابت کرنا محال ہے، کیونکہ وہ محصور ہے، اور اس پر حصر کا حکم لگے گا۔ خاص طور پر جب آخری نفی نے پہلی نفی پر اس کے لیے پھینکنے کے اثبات کے ساتھ اضافہ کیا، نہ کہ واسطے کے لیے۔ پس محمد صلی اللہ علیہ وسلم کے لیے حسی شہود (الشہود) میں پھینکنا ثابت ہوا، محمد صلی اللہ علیہ وسلم کے کلمہ حق میں ثابت ہونے کے ذریعے، پس جس طرح وہ پھینکنے والا ہے اور نہ پھینکنے والا ہے، اسی طرح وہ کلمہ الٰہیہ میں محمد ہے اور نہ محمد ہے۔ کیونکہ اگر وہ محمد ہوتا جیسا کہ اس کی صورت شہود (الشہود) کرتی ہے، تو وہ پھینکنے والا ہوتا جیسا کہ اس کا پھینکنا شہود (الشہود) کرتا ہے۔ پس جب الٰہی خبر نے اس سے پھینکنے کی نفی کی تو اس کا عین بھی منتفی ہو گیا، کیونکہ اس کے عین اور اس کے پھینکنے میں کوئی فرق نہیں۔ اور اسی طرح: \"پس تم نے انہیں قتل نہیں کیا بلکہ اللہ نے انہیں قتل کیا\" (فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ)۔ اور یہی وہ بصیرت ہے جس پر اللہ کی طرف بلانے والے (دعاة) تھے، وہ جانتے تھے کہ کون اللہ کی طرف بلاتا ہے اور کون اللہ کا دعویٰ کرتا ہے۔ پس ادراک ایک ہے، جب اس کے ذریعے امر کو جیسا کہ وہ ہے ادراک کیا جائے تو اسے بصیرت کہا جاتا ہے، کیونکہ یہ علم محقق ہے۔ اور جب اس کے ذریعے اس نسبت کے عین کو ادراک کیا جائے جو حس میں ظاہر ہوئی تو اسے بصر (آنکھ کی بینائی) کہا جاتا ہے۔ پس مقام کے اختلاف سے اس پر القاب مختلف ہو گئے، جیسا کہ ایک ہی آلہ کے حکم میں اختلاف ہوا، اگرچہ وہ ایک ہی صورت میں تھا، کیونکہ وہ مقامات کے اختلاف سے مختلف ہوتا ہے۔ جیسے لفظ \"ما\" (ما) کا آلہ، بلاشبہ وہ ایک ہی عین ہے، پس ایک مقام پر وہ نافیہ (نفی کرنے والا) ہوتا ہے، جیسے اس کا قول: \"اور اس کی تاویل کو اللہ کے سوا کوئی نہیں جانتا\" (وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ)۔ اور ایک مقام پر وہ تعجب کے لیے ہوتا ہے، جیسے اس کا قول: \"پس وہ آگ پر کتنے صبر کرنے والے ہیں\" (فَمَا أَصْبَرَهُمْ عَلَى النَّارِ)۔ اور ایک مقام پر وہ مہیا کرنے والا ہوتا ہے، جیسے اس کا قول: \"بسا اوقات کافر تمنا کریں گے\" (رُبَمَا يَوَدُّ الَّذِينَ كَفَرُوا)۔ اور ایک مقام پر وہ اسم ہوتا ہے، جیسے اس کا قول: \"مگر جو تو نے مجھے حکم دیا\" (إِلَّا مَا أَمَرْتَنِي بِهِ) اور اس کی مثالیں۔ اور کبھی وہ مصدریہ ہوتا ہے، اور کبھی استفہام کے لیے آتا ہے، اور کبھی زائدہ آتا ہے، اور اس کے دیگر مقامات۔ پس یہ ایک ہی عین ہے جس پر مقامات نے مختلف احکام لگائے۔ اسی طرح ظہور الٰہی (التجلی) کی صورتیں احکام کے مانند ہیں اس شخص کے لیے جو دیکھتا ہے اسے عقل سے سمجھے۔ پس اللہ نے ہمیں اس آیت میں جو کچھ ذکر کیا اس سے واضح کیا کہ جسے ہم محسوس حقیقت سمجھتے تھے وہ محض متخیل ہے جسے آنکھ دیکھتی ہے، اور امر اپنی ذات میں اس کے خلاف ہے جس کا آنکھ شہود (الشہود) کرتی ہے۔ اور یہ تمام جسمانی اور روحانی قوتوں میں جاری ہے۔ پس سارا عالم نصب شدہ مثالوں کی صورتوں میں ہے۔ پس ہستی (الوجود) کی حضرہ محض حضرہ خیال ہے۔ پھر تم ان صورتوں کو جو تم دیکھتے ہو محسوس اور متخیل میں تقسیم کرتے ہو، حالانکہ سب متخیل ہیں۔ اور یہ بات کوئی نہیں کہتا مگر وہ جسے یہ مشہد دکھایا گیا ہو۔ پس فلسفی اسے رد کرتا ہے، اور دلائل عقول والے سب اسے رد کرتے ہیں، اور اہل ظاہر بھی اسے نہیں مانتے، اور نہ ہی ان معانی کو جو ان صورتوں کے لیے آئے ہیں۔ اور اس مشہد کے قریب صرف سوفسطائی (Sophists) آتے ہیں، مگر ہمارے اور ان کے درمیان فرق یہ ہے کہ وہ کہتے ہیں کہ اس سب کی کوئی حقیقت نہیں، اور ہم یہ نہیں کہتے، بلکہ ہم کہتے ہیں کہ یہ حقیقت ہے۔ پس ہم نے تمام گروہوں سے علیحدگی اختیار کی اور اللہ اور اس کے رسول کی موافقت کی اس علم کے ذریعے جو ہمیں اس چیز کے بارے میں دیا گیا جو ہمارے مشہود سے ماورا ہے۔ پس ہم نے جان لیا کہ ہم کیا شہود (الشہود) کرتے ہیں، اور شہود (الشہود) اللہ کی طرف سے ایک عنایت ہے جو اس نے ہمیں نور ایمان کے ذریعے عطا کی جس سے اللہ نے ہماری بصیرتوں کو منور کیا۔ اور جس نے ہماری مقرر کردہ بات کو جان لیا، اس نے اس زمین کا علم جان لیا جو آدم علیہ السلام کی مٹی کے خمیر کے باقی ماندہ حصے سے پیدا کی گئی، اور اس نے جان لیا کہ سارا عالم، بلکہ موجودات، اس زمین کے آباد کرنے والے ہیں، اور اس سے صرف ذات حق (الحق) ہی خالص ہے، جو اس کا خالق اور اس کا منشئ ہے اپنی ہویت کے اعتبار سے، کیونکہ ہستی (الوجود) اسی کے لیے تھی نہ کہ اس کے لیے۔ اور اگر معاملہ ایسا نہ ہوتا جیسا کہ ہم نے ذکر کیا، تو ہمارے اور ذات حق (الحق) کے درمیان منازلہ (المنازلة) درست نہ ہوتا، اور نہ ہی ذات حق (الحق) کا آسمان دنیا کی طرف نزول درست ہوتا، اور نہ عرش پر استواء، اور نہ وہ عماء (العماء) جس میں ہمارا رب اپنی مخلوق کو پیدا کرنے سے پہلے تھا۔ پس اگر اسم ظاہر (الظاہر) کا حکم نہ ہوتا تو یہ حضرہ ظاہر نہ ہوتی اور نہ یہ عالم صورت میں ظاہر ہوتا۔ اور اگر اسم باطن (الباطن) کا حکم نہ ہوتا تو ہم نہ جانتے کہ پھینکنے والا اللہ ہے محمدی صورت میں، اور اس سے اوپر کی صورتوں میں۔ پس اس نے فرمایا: \"اور کسی بشر کے لیے یہ ممکن نہیں کہ اللہ اس سے کلام کرے\" (وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ) حالانکہ وہ بشر ہے، \"مگر وحی کے ذریعے\" (إِلَّا وَحْيًا)، جیسے اس کا قول: \"بلکہ اللہ نے پھینکا\" (وَلَكِنَّ اللَّهَ رَمَىٰ)۔ پس پھینکنے والا اللہ ہے اور بصر محمد کا شہود (الشہود) کرتی ہے۔ \"یا پردے کے پیچھے سے\" (أَوْ مِن وَرَاءِ حِجَابٍ)، ایک بشری صورت، تاکہ خطاب کے ذریعے دونوں صورتوں کے درمیان مناسبت واقع ہو، \"یا وہ کوئی رسول بھیجے\" (أَوْ يُرْسِلَ رَسُولًا)، اور وہ بندے کے دل میں ذات حق (الحق) کا ترجمان ہوتا ہے، \"اسے روح الامین نے تمہارے دل پر نازل کیا\" (نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَىٰ قَلْبِكَ)۔ پس جب اللہ بشری رسول پر خاص وجہ سے، واسطوں کے اٹھ جانے کے ساتھ، وحی کرتا ہے اور رسول اسے ہم پر القا کرتا ہے، تو وہ ہمارے لیے ذات حق (الحق) کا کلام ہوتا ہے اس صورت کے پردے کے پیچھے سے جسے رسول کہا جاتا ہے، اگر وہ ہماری طرف بھیجا گیا ہو یا نبی ہو۔ اور یہ رتبہ بعض اولیاء کو بھی حاصل ہو سکتا ہے۔ پس جب بشری پردہ قلب کی آنکھ سے ہٹ جاتا ہے، تو وہ تمام موجودات کی صورتوں کو اسی طرح ادراک کرتا ہے کہ وہ ایک دوسرے سے خطاب کرتی ہیں اور ایک دوسرے سے سنتی ہیں۔ پس متکلم اور سامع، اور پکڑنے والا اور کوشش کرنے والا، اور محسوس کرنے والا اور متخیل، اور صورت گر اور حافظ، اور انسان سے منسوب تمام قوتیں، سب کو مدد ملتی ہے۔ پس تمام منازلات (المنازلات) اول اور آخر، ظاہر اور باطن، اور عالم کی صورتوں اور ظہور الٰہی (التجلی) کی صورتوں کے درمیان برزخی ہیں۔ \"پس اسے پناہ دے تاکہ وہ اللہ کا کلام سن لے\" (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ)۔ پس ترجمان ہی متکلم ہے۔ اور ہم جان چکے ہیں کہ سنا جانے والا کلام اللہ کا کلام ہے نہ کہ اس کا کلام۔ پس تم دیکھو کہ اس کے برزخی خطاب میں کیا آیا ہے، اور اس کے ادراک کے لیے فہم کی آنکھ کھولو، اور ویسے ہی ہو جاؤ جیسا اس نے تمہیں مخاطب کیا۔ اور اللہ کا کلام صرف اللہ کی سماعت سے سنا جاتا ہے، اور صورت کا کلام صرف صورت کی سماعت سے، اور سامع سماعت کے پیچھے ہے اور متکلم کلام کے پیچھے، اور اللہ ان کے پیچھے سے محیط ہے (وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ)۔ \"بلکہ وہ قرآن مجید ہے، لوح محفوظ میں\" (بَلْ هُوَ قُرْآنٌ مَّجِيدٌ فِي لَوْحٍ مَّحْفُوظٍ) تبدیلی اور تغیر سے محفوظ۔ پس یا تو وہ توحید پر دلالت کرتا ہے، یا صفت تنزیہ پر، یا صفت فعل پر، یا جو اشتراک دیتا ہے، یا تشبیہ پر، یا حکم پر، یا قصص پر، یا ترغیب یا ترہیب کے ذریعے نصیحت پر، یا مدلول علیہ پر دلالت پر۔ پس وہ محکم اور متشابہ کے درمیان محصور ہے، ہر خطاب عالم میں۔ پس جسم کا طور، اس میں موجود طبعی میلان کی وجہ سے، کیونکہ وہ اپنے وجود میں خود مختار نہیں ہے، اور ایک کتاب مسطور (لکھا ہوا) ہے الٰہی املا سے، اور ایک ہاتھ جو قلم اقتداری سے لکھتا ہے، ایک رَق (چرمی کاغذ) میں، اور وہ اشارے کے باب سے تمہارا عین ہے نہ کہ تفسیر کے باب سے، جو منشور (کھلا ہوا) ہے، ظاہر ہے، لپٹا ہوا نہیں، پس وہ مستور (پوشیدہ) نہیں ہے۔ اور بیت المعمور، اور وہ قلب ہے جس میں ذات حق (الحق) سما گیا، پس وہ اسے آباد کرنے والا ہے۔ اور سقف مرفوع (بلند چھت) وہ حسی اور معنوی قوتیں ہیں جو سر میں ہیں۔ اور بحر مسجور (بھڑکا ہوا سمندر) طبیعت کا وہ نظارہ ہے جو اس میں موجود آگ سے بھڑکا ہوا ہے، جو حرکت کو واجب کرنے والا حاکم ہے۔ \"یقیناً تمہارے رب کا عذاب واقع ہونے والا ہے\" (إِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ)، یعنی وہ چیز جس سے نفس حیوانی، روح امری، اور عقل علوی اپنے رب، جو ان کی تربیت کرنے والا اور ان کے معاملے کو درست کرنے والا ہے، سے پناہ مانگتے ہیں، وہ ان پر واقع ہونے والی ہے، ان پر گرنے والی ہے، کیونکہ ان کے لیے سفلی منازل ہیں ان کے مطلق امکان کے لحاظ سے، اور ان کی مقید طبیعت کے لحاظ سے۔ \"اسے کوئی ٹالنے والا نہیں\" (مَا لَهُ مِن دَافِعٍ)، کیونکہ وہاں اس کے سوا کچھ نہیں جو ہم نے ذکر کیا۔ پس ہماری طرف سے تلقّی ہے اس کے تدلی (نیچے آنے) کے لیے، اور ترقی ہے اس کے تدانی (قریب ہونے) کے لیے۔ اور ان دو حکموں کے درمیان برازخ (برزخ) کا ظہور ہے جن کے لیے بلند شان اور راسخ علم ہے۔ اور منازلہ (المنازلة) اسماء الٰہیہ کے درمیان بھی ہو سکتا ہے، جیسے اس انسان پر جنگ میں منازلہ (المنازلة) جب وہ اللہ کے حکم کی خلاف ورزی کرتا ہے، تو اسے تواب، غفور، اور رحمن طلب کرتے ہیں، اور اسے منتقم، ضار، اور مذل اور ان جیسے اسماء طلب کرتے ہیں۔ اور اس باب میں حدیث میں وارد ہوا ہے:\n\nاللہ تعالیٰ کا فرمان: \"میں نے کسی ایسے کام میں تردد نہیں کیا جسے میں کرنے والا ہوں، جتنا تردد میں نے مومن کی روح قبض کرنے میں کیا، وہ موت کو ناپسند کرتا ہے اور میں اس کی ناگواری کو ناپسند کرتا ہوں، حالانکہ اسے مجھ سے ملنا ضروری ہے۔\"\n\nاور یہ منازلہ (المنازلة) میں سے ہے۔ اور میں نے اس کشف (الکشف) کا ذائقہ چکھا، میں نے اسے اللہ کی طرف سے دجال کے قتل میں دیکھا، جب رسول اللہ صلی اللہ علیہ وسلم میرے ساتھ اس میں موجود تھے۔ اور وہیں سے مجھ پر اللہ کے بندوں پر رحمت کو پھیلانے کا دروازہ کھل گیا، اور میں نے جان لیا کہ اس کی رحمت ہر چیز پر محیط ہے (وَّسِعَتْ كُلَّ شَيْءٍ)، پس ضروری ہے کہ اس کا حکم ہر چیز میں نافذ ہو۔ اور میں نے اعراض (Accidents) کے معدوم ہونے کی حکمت کو جان لیا، نہ کہ ان کی ذات کو، ان کے وجود کے دوسرے لمحے میں۔ اور اللہ نے محل میں امثال (مثالیں) یا اضداد کو پیدا کیا، کیونکہ اگر کوئی عرض اپنے محل کے ثبوت کے ساتھ ثابت رہتا، جب کہ اس کا محل اس کی مانند کوئی معنی نہ ہوتا، یعنی عرضیت میں اس جیسا کوئی دوسرا عرض، تو وہ باقی رہتا جیسا کہ جوہر باقی رہتا ہے، اور جوہر پر اس کی حالت تبدیل نہ ہوتی۔ تو وہ یا تو اپنی تخلیق کے آغاز سے ہمیشہ کے لیے بدبخت ہوتا یا ہمیشہ کے لیے خوش بخت، تو اللہ کی رحمت مخصوص اعیان پر قاصر ہو جاتی، جیسا کہ خاص صفت سے متصف قوم میں وجوب کے ساتھ ہوتی ہے، اور جس کو وہ مقید صفت کے ساتھ وجوباً نہیں ملتی، اسے رحمت احسان کے باب سے ملتی ہے، جیسا کہ اسے ملی جو اس کا مستحق ہوا اور اس صفت کے ذریعے اس کے لیے واجب ہوئی جو اسے عطا کی گئی، پس وہ اس سے متصف ہوا تو رحمت اس کے لیے واجب ہو گئی۔ پس سب نے احسان کے طریقے پر اسے پایا اور اس نے انہیں پایا۔ پھر منازلہ (المنازلة) رحمن کی دو انگلیوں کے درمیان قلب میں ارادے کے میدان میں جاری ہوتا ہے۔ پس اگر وہ اسے ٹیڑھا کرے تو رحمن اسے ٹیڑھا کرتا ہے، اور اگر وہ اسے سیدھا کرے تو رحمن اسے سیدھا کرتا ہے۔ پس وہاں حکم صرف اسی کا ہے، کیونکہ وہ عرش پر مستوی ہے، پس احکام صرف اسی اسم سے نافذ ہوتے ہیں۔ پھر منازلہ (المنازلة) فرشتہ اور شیطان کے درمیان قلب پر ان دو لمّتوں (وسوسوں) کے ذریعے ظاہر ہوتا ہے جنہیں مکلف اپنے دل میں پاتا ہے۔ اور اگر وہ مکلف نہ ہو اور اپنے دل میں تردد پائے، تو یہ خالی نہیں ہوگا کہ یا تو وہ دارِ تکلیف میں ہے یا نہیں۔ اگر وہ دارِ تکلیف میں ہے، تو تردد صرف لمّہ ملکیہ (فرشتے کا وسوسہ) اور لمّہ شیطانیہ (شیطان کا وسوسہ) کی طرف سے ہوتا ہے، ان میں سے ہر ایک اس چیز کو طلب کرتا ہے جس میں اس کا وسوسہ نافذ ہوا کہ مکلف کا اس میں فساد میں مدد کے ساتھ دخل ہو، تو اس پر گناہ جائز ہو جاتا ہے۔ جیسے دو بچے جو حدِ تکلیف کو نہیں پہنچے، وہ شیطان کے وسوسے کی وجہ سے آپس میں لڑتے ہیں جو ان میں سے ہر ایک پر غالب آ گیا، تو ان کے والدین یا ان کے رشتہ داروں یا پڑوسیوں میں سے دو شخص یا حاضرین میں سے کوئی بھی آتا ہے اور وہ شرعی میزان کے بغیر، بلکہ غرض کی حمیت سے ان کے درمیان دخل دیتے ہیں، تو بسا اوقات یہ اس بات کا سبب بنتا ہے کہ وہ اس کوشش میں گناہ کمائیں جو انہوں نے ان کے حق میں کی۔ اسی لیے بچے کی شر کی حرکت شیطان کے وسوسے سے ہوتی ہے۔ پس سمجھو اور مقامات کو پہچانو تاکہ تم علم اتم کا اقرار کرو۔ اور اگر وہ غیر مکلف ہے اور نہ ہی دارِ تکلیف میں ہے، اور وہ دو افعال کے درمیان کسی امر میں تردد پاتا ہے جس میں اسے کوئی حرج نہیں کہ وہ ان میں سے کون سا کرے، تو وہ تردد اور منازلہ (المنازلة) دو خاطروں (خیالات) کے درمیان ہوتا ہے، جو تردد الٰہی کی طرح ہے، مگر بندے میں یہ اس کے حق میں اولیٰ اور اعلیٰ کو طلب کرنے کی وجہ سے ہوتا ہے، جیسا کہ مکلف دو اطاعتوں کے درمیان تردد کرتا ہے کہ ان میں سے کون سی کرے۔ پس یہ تردد الٰہی ہے، یہ دو لمّتوں کی طرف سے نہیں ہے، بلکہ یہ دو غرضیں ہیں یا ایک غرض ہے جو دو امور سے متعلق ہوئی ہے، یا تو برابری پر یا وقت کے تقاضے کے مطابق ترجیح کو واضح کرنے کے لیے۔ اور وہ مکلف نہیں ہے اور نہ ہی دارِ تکلیف میں ہے، کیونکہ اگر تکلیف نہ ہوتی تو شیطان کبھی کسی انسان کے قریب نہ آتا، کیونکہ یہ عبث ہے، اور ذات حق (الحق) عبث کام نہیں کرتا، کیونکہ سب اسی کا فعل ہے اور سارا امر اسی کی طرف لوٹتا ہے۔ پس صاحب علم منازلات (المنازلات) کے لیے ضروری ہے کہ وہ اس سب پر اور اس کی مثالوں پر واقف ہو، اور عالم میں ہر تردد پر۔ پس یہ اس کی اصل ہے۔ جہاں تک تردد الٰہی یا دو انگلیوں یا دو لمّتوں کا تعلق ہے، تو وہ ایک اور چیز ہے جس کا حکم وہاں ہے۔ اور اصل تردد الٰہی ہے اور وہ جو متقابل اسماء الٰہیہ کی حقیقتیں عطا کرتی ہیں۔ \"اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔ پس ہم اس فصل میں ان الٰہی معارف میں سے کچھ ذکر کریں گے جو ہمیں منازلات (المنازلات) میں حاصل ہوئے، کیونکہ وہ شمار سے باہر ہیں۔ پس ان میں سے کچھ یہ ہیں جو ہم ذکر کرتے ہیں۔",
    "fa": "باب سیصد و هشتاد و چهارم در معرفت منازلات خطابی (گفتاری)\n\nفصل پنجم در منازلات است و این از سرّ سخن خداوند عز و جل است که می‌فرماید: «وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ» (و هیچ بشری را نرسد که خدا با او سخن گوید مگر به طریق وحی یا از پس پرده‌ای) و این از حضرت محمدیه است.\n\nمنازلات علوم، حقایق حق و بندگان را آشکار می‌سازد\nبدون زیاده‌روی و بدون ستیز\nو بدون جدال و بدون عناد\nپس به عقل من بگو کوتاه بیا، زیرا نقل من\nبه گمراهی و هدایت رهنمون می‌شود\nپس هر ذکر من به سوی صلاح است\nو برخی از فکر من به سوی فساد\nپس سودمندترین علم، علم فقر من است\nبرای آن سرور بخشنده و جواد.\n\n[منازله فعل دو فاعل است و آن نزول از سوی دو نفر است که هر یک دیگری را می‌طلبد تا بر او نازل شود]\n\nبدان، خداوند ما و شما را تأیید کند، که منازله (المنازلة) در اینجا فعل دو فاعل است و آن نزول از سوی دو نفر است که هر یک دیگری را می‌طلبد تا بر او یا به واسطه او نازل شود، هر طور که خواهی بگو. پس در راهی در موضعی معین به هم می‌رسند و به دلیل این طلب از سوی هر یک، آن را منازله می‌نامند. این نزول در حقیقت از جانب بنده، صعود است. ما آن را نزول نامیدیم، زیرا بنده با آن صعود، نزول حق را می‌طلبد. خداوند متعال می‌فرماید: «إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ» (سخنان پاکیزه به سوی او صعود می‌کند و عمل صالح آن را بالا می‌برد). پس آن (صعود) براق اوست که با آن به سوی او سیر می‌کند و او با آن بر بنده نازل می‌شود. و خداوند متعال در حق خود می‌فرماید، بر اساس آنچه رسول خدا (صلی الله علیه و سلم) از او نقل کرده است که فرمود: «پروردگار ما هر شب به آسمان دنیا نازل می‌شود» (الحديث بطوله). پس او خود را به نزول به سوی ما وصف کرده است. این نزول حق (الحق) برای خلق است، و نزول ما نزول خلق برای حق است، زیرا برای ما امکان ندارد که علو، کبریا و بی‌نیازی از او داشته باشیم. پس صفت صغار (کوچکی) و فقر برای ماست و صفت غنا (بی‌نیازی) و کبریا برای اوست.\n\nهمه ما به سوی او فقیر هستیم\nو همه ما نزد او کوچک\nو همه ما او را غیر خود می‌بینیم\nو او بی‌نیاز از ما و بزرگ است\nجز من، که او را\nچشم خود می‌بینم و من آگاه هستم\nو پس از آنکه این را دانستم، گفتم که من\nدر برابر بی‌نیازی او بنده‌ای فقیرم.\n\nو در حقیقت، به واسطه ماست که بر او نازل می‌شویم و به واسطه ماست که او بر ما نازل می‌شود. اگر چنین نبود، نمی‌دانستیم که او در خطابش با ما چه می‌گوید، زیرا او غنی حمید (بی‌نیاز ستوده) است. و بر حقیقتِ حقیقت (حقيقة الحقيقة)، به واسطه اوست که بر او نازل می‌شویم و به واسطه اوست که او بر ما نازل می‌شود. و فرقی نمی‌کند که منازله باشد یا نزول تام، در هر صورت متکلم و شنونده وجود دارد. او می‌داند چه می‌گوید، زیرا کسی که این مقام را دارد، کلام او را شنیده است و غیر او کلامش را نشنیده است. و چون او اصل است، ما جز به واسطه او نیستیم، زیرا فرع به صورت اصل خارج می‌شود. و در آن (فروع) است که ثمره ظاهر می‌شود، یعنی در فروع، و فواید حاصل می‌گردد، همان‌طور که محل حوائج است. پس در آنجا جز او نیست.\n\nاگر راهی به سوی تو داشتم\nدلیلی بر تو نداشتم\nاز این رو تو پروردگار عزیز هستی\nو من بنده ذلیل\nاز خدایی و بنده‌ای در شگفتم\nکه در منزلی بلند و هولناک قرار دارند\nاضافه‌ای و حرفی از شمول\nبه اینکه او و ما برابر هستیم\nخداوند آن را گفت، نه کونی (موجودی)\nپس من آن را گفتم، هنگامی که او می‌گوید\nو از این روست که این همان امری است که\nناگزیر است و کافی است\nپس بر اساس قول من عمل کن، اگر\nبه آن متصف باشی\nو هنگامی که حق با تو مناظره کرد\nنسبت به او منصف باش\nزیرا اگر با او مخالفت کنی\nبر لبه پرتگاه خواهی بود.\n\n[حق بندگانش را جز از پس پرده‌ای مورد خطاب قرار نمی‌دهد و با آنان سخن نمی‌گوید]\n\nو بدان که حق (الحق) بندگانش را مورد خطاب قرار نمی‌دهد و با آنان سخن نمی‌گوید مگر «مِنْ وَرَاءِ حِجَابٍ» (از پس پرده‌ای)، که آن پرده صورتی است که حق در آن برای ایشان تجلی (التجلی) می‌کند. آن صورت برای حق حجابی از خودش و دلیلی بر اوست. مانند صورت ظاهری جسمانی انسان، هنگامی که نفس ناطقه بخواهد با نفس دیگری سخن بگوید، از پس پرده صورت جسدش، با زبان و لغت آن صورت با او سخن می‌گوید، با وجود اینکه نفس مخلوق است و امرش همان‌طور است که ذکر کردیم؛ پس حال خالق چگونه است؟ بنابراین، کسی که در منازلات خطابی (گفتاری) است، جز صورتهایی را شهود (الشهود) نمی‌کند که از آنها حقایق و اسراری را که حق از آنها ترجمه می‌کند، دریافت می‌نماید. و این همان سنت فهمانی است. حد منازلات از عماء (العماء) تا زمین و آنچه میان آن دو است می‌باشد. پس هرگاه صورت از عماء جدا شود و صورت باطنی انسانی از زمین جدا شود، سپس به هم برسند، آن منازله است. اما اگر به عماء برسد یا امر به زمین بیاید، آن نزول است نه منازله. و محلی که اجتماع در آن واقع می‌شود، منزل نامیده می‌شود. و این حضرت (الحضرة) که خطاب الهی از آن برای هر یک از بندگانش که بخواهد صادر می‌شود، «حضرت لسن» (حضرة اللسن) نامیده می‌شود. و از همین حضرت بود که خداوند متعال با موسی (علیه السلام) سخن گفت. آیا نمی‌بینی که در صورت حاجت او بر او تجلی کرد؟ و از همین حضرت بود که رسول خدا (صلی الله علیه و سلم) جوامع الکلم (سخنان جامع) را دریافت کرد. پس در این حضرت، صور تمام عالم برای او جمع شد. علم اسماء این صور، علم آدم (علیه السلام) بود، و اعیان آنها برای محمد (صلی الله علیه و سلم) بود، همراه با اسمائی که به آدم (علیه السلام) داده شده بود؛ زیرا آدم از اولین کسانی است که خداوند علم آنان را به محمد (صلی الله علیه و سلم) عطا کرد.\n\nآنگاه که در مورد خود فرمود که خداوند علم اولین و آخرین را به او عطا کرده است.\n\nو از همین حضرت بود که خداوند متعال به داود (علیه السلام) «الْحِكْمَةَ وَفَصْلَ الْخِطَابِ» (حکمت و فصل الخطاب) را عطا کرد. و تمام صحیفه‌ها و کتاب‌های نازل شده از این حضرت صادر شده‌اند. و از همین حضرت بود که حق بر قلم اعلی املا کرد آنچه را که در لوح محفوظ نگاشت. و کلام تمام عالم، غیب و شهودش، از این حضرت است. و همه آن کلام خداست، زیرا این حضرت، حضرت اولی است. زیرا اولین چیزی که ممکنات از جانب خداوند متعال در ایجاد خود دارند، قول «کن» (باش) است. پس این خطاب، گوش‌های ممکنات را شکافت. و «آخِرُ دَعْوَاهُمْ» (آخرین دعایشان) در بهشت «أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ» (که ستایش مخصوص خدا پروردگار جهانیان است) است، هنگامی که خداوند بهشتیان را می‌گوید: «رضایت من از شماست، پس هرگز بر شما خشمگین نخواهم شد.» و اگر نَفَس رحمان (نفس الرحمن) نبود، اعیان ممکنات (کلمات) ظاهر نمی‌شدند.\n\n[حرکت جز از متحرکی در چیزی و با قصدی از سوی محرک صورت نمی‌گیرد]\n\nو بدان که حرکات، هر چه که باشند، جز از متحرکی در چیزی و با قصدی از سوی محرک صورت نمی‌گیرند، خواه محرک خودش باشد یا غیر خودش. پس صور از حرکت او پدید می‌آیند، بلکه از تحرک او در آنچه در آن تحرک کرده است، بر اساس قصد او. پس صور بر اساس موطن و قصدی که از محرک بوده است، شکل می‌گیرند. مانند حروف در نَفَس خارج شده از انسان، هنگامی که قصد کند حرف معینی را برای ایجاد عین آن در موطن مخصوص به آن ظاهر سازد، صورت آن حرف در آن موطن گشوده می‌شود. پس برای آن حرف اسمی خاص تعیین می‌شود که به واسطه آن از غیر خود متمایز می‌گردد، هنگامی که ذکر می‌شود، همان‌طور که صورتش از صورت غیر خود متمایز می‌شود، هنگامی که حاضر است. و این بر اساس امتداد نَفَس است. سپس هنگامی که قصد کند کلمه‌ای را در عین آن ظاهر سازد، هنگام اظهار اعیان حروف در نَفَس خود، قصد می‌کند که حروف معینی را ظاهر سازد و غیر آنها را ظاهر نمی‌کند.\n\nپس در گوش، برخی از آنها به برخی دیگر ضمیمه می‌شوند و کلمه در گوش پدید می‌آید. و کلمه نسبت ضمیمه شدن آن حروف است و امر زائدی بر حروف نیست، جز اینکه نسبت جمع آنهاست. پس آن جمعیّت، صورتی را می‌دهد که حروف بدون این نسبت جمعیّت آن را نمی‌دادند. این همان ترکیب اعیان عالم مرکب از بسائط آن است. پس چشم جز مرکبی از بسائط را شهود نمی‌کند. و مرکب امر زائدی بر بسائط خود نیست، جز نسبت جمع بسائط. ما این را ذکر کردیم تا بدانی آنچه چشم شهود می‌کند و ترکیب در اعیان این حروف نامتناهی است. به همین دلیل است که کلمات خدا تمام نمی‌شود. پس صور کلمات دائماً پدید می‌آیند، یعنی ظاهر می‌شوند. بنابراین، هستی (الوجود) و ایجاد (الإیجاد) دائماً ادامه دارد. پس ای موجود مرکب، بدان که تو کیستی و به چه چیز ترکیب شده‌ای و چگونه در بسائط خود برای چشمت ظاهر نشدی و در ترکیب خود برای چشمت ظاهر شدی؟ و هیچ امر وجودی پدید نیامد مگر نسبت ترکیبی که بر آن حکمی می‌کنی که قبل از ترکیب بر آن حکم نمی‌کردی. پس بفهم که صورت «کن» (باش) را از نَفَس ایجاد کرد، سپس کائنات را از «کن». پس جز کلماتی را ظاهر نکرد که همه از «کن» هستند. و «کن» لفظ امر وجودی است. پس جز آنچه با آن مناسبت دارد، از حروف مرکبی که با «کن» در کلمه بودن جمع می‌شوند، از آن ظاهر نشد. پس امر او جز یکی نیست و آن قول اوست: «کن». خداوند متعال می‌فرماید: «وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ» (و فرمان ما جز یکی نیست). و می‌فرماید: «إِنَّمَا قَوْلُنَا لِشَيْءٍ إِذَا أَرَدْنَاهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ» (سخن ما به چیزی هنگامی که اراده‌اش کنیم، این است که به آن بگوییم: باش، پس می‌شود). آن شیء در عین خود موجود می‌شود. پس آن موجود به هستی (الوجود) متصف می‌شود، پس از آنکه وصف می‌شد که غیر موجود است، جز اینکه ثابت و در نَفَس درج شده است، اما موجودِ حرفی نیست. پس منازله اصلی، اکوان را پدید می‌آورد و صور ممکنات را در اعیان ظاهر می‌سازد. پس هر کس آنچه را گفتیم بداند، می‌داند که عالم چیست و کیست. پس منزه است کسی که این اسرار را در ظهورشان پنهان کرد و در پنهانی‌شان آشکار ساخت. پس اوست الظاهر و الباطن و الاول و الآخر برای قومی که تعقل می‌کنند.\n\nو عین (ذات) یکی است و حکم برای نسبت‌هاست\nو عین ظاهر است و کون (هستی) برای سبب.\n\nخداوند متعال می‌فرماید: «وَمَا رَمَيْتَ» (و تو پرتاب نکردی)، پس نفی کرد، «إِذْ رَمَيْتَ» (هنگامی که پرتاب کردی)، پس عین آنچه را نفی کرده بود، اثبات کرد، «وَلَكِنَّ اللَّهَ رَمَى» (بلکه خدا پرتاب کرد)، پس عین آنچه را اثبات کرده بود، نفی کرد. پس اثبات پرتاب، واسطه‌ای شد میان دو طرف نفی. پس نفی اول، عین نفی آخر است. و محال است که عین واسطه میان دو نفی اثبات شود، زیرا محصور است و حکم حصر بر آن جاری می‌شود. به ویژه که نفی آخر با اثبات پرتاب برای حق، نه برای واسطه، بر نفی اول افزوده است. پس پرتاب در شهود (الشهود) حسی برای محمد (صلی الله علیه و سلم) ثابت شد، به واسطه ثبوت محمد (صلی الله علیه و سلم) در کلمه حق. پس همان‌طور که او پرتاب‌کننده است و پرتاب‌کننده نیست، همچنین در کلمه الهی، محمد است و محمد نیست. زیرا اگر محمد بود، همان‌طور که صورتش شهود می‌شود، پرتاب‌کننده بود، همان‌طور که پرتاب کردنش شهود می‌شود. پس هنگامی که خبر الهی پرتاب را از او نفی کرد، عین او نیز منتفی شد، زیرا فرقی میان عین او و پرتاب او نیست. و همچنین است: «فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ» (شما آنان را نکشتید، بلکه خدا آنان را کشت). و این همان بصیرتی است که دعوت‌کنندگان به سوی خدا بر آن بودند. آنان می‌دانند چه کسی به سوی خدا دعوت می‌کند و چه کسی ادعای دعوت به سوی خدا دارد. پس ادراک یکی است. اگر امر به واسطه آن (ادراک) بر همان‌طور که هست، درک شود، بصیرت نامیده می‌شود، زیرا علم محقق است. و اگر عین نسبتی که در حس ظاهر شده است، به واسطه آن درک شود، بصر (بینایی) نامیده می‌شود. پس القاب بر اساس اختلاف موطن بر آن مختلف شده است، همان‌طور که حکم عین ابزار، با وجود اینکه به یک صورت است، با اختلاف مواطن متفاوت می‌شود. مانند ابزار لفظ «ما» که شکی نیست عین واحدی است. در موطنی نافیه است، مانند قول او: «وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ» (و تأویل آن را جز خدا نمی‌داند). و در موطنی تعجبی است، مانند قول او: «فَمَا أَصْبَرَهُمْ عَلَى النَّارِ» (پس چقدر بر آتش شکیبا هستند). و در موطنی مهیئه (آماده‌ساز) است، مانند قول او: «رُبَمَا يَوَدُّ الَّذِينَ كَفَرُوا» (چه بسا کسانی که کافر شدند آرزو کنند). و در موطنی اسم است، مانند قول او: «إِلَّا مَا أَمَرْتَنِي بِهِ» (جز آنچه مرا به آن امر کردی). و امثال اینها. و گاهی مصدریه است و برای استفهام می‌آید و گاهی زائده و غیر آن از مواطن آن. پس این عین واحدی است که مواطن بر آن احکام مختلفی را جاری کرده‌اند. همچنین صور تجلی (التجلی) به منزله احکام هستند برای کسی که آنچه را می‌بیند، تعقل کند. پس خداوند برای ما در آنچه در این آیه ذکر کرد، روشن ساخت که آنچه ما گمان می‌کردیم حقیقتی محسوس است، در واقع متخیّل است که چشم آن را می‌بیند، در حالی که امر در نفس خود بر خلاف چیزی است که چشم شهود می‌کند. و این در تمام قوای جسمانی و روحانی جاری است. پس تمام عالم در صورتی مانند مثال‌های نصب شده است. پس حضرت وجودی (الحضرة الوجودية) همان حضرت خیال است. سپس آنچه را از صور می‌بینی، به محسوس و متخیّل تقسیم می‌کنی، در حالی که همه متخیّل است. و این را جز کسی که این مشهد را شهود کرده باشد، نمی‌گوید. پس فیلسوف آن را رد می‌کند و تمام اصحاب ادله عقلی آن را رد می‌کنند و اهل ظاهر به آن قائل نیستند. بله، و نه به معانی‌ای که این صور برای آن آمده‌اند. و جز سوفسطائیان به این مشهد نزدیک نمی‌شوند، با این تفاوت که آنان می‌گویند این همه حقیقتی ندارد، در حالی که ما چنین نمی‌گوییم، بلکه می‌گوییم حقیقت است. پس ما از تمام طوایف جدا شدیم و با خداوند و رسولش موافقت کردیم، به واسطه آنچه او ما را از آنچه ورای شهود ماست، آگاه ساخت. پس ما آنچه را شهود می‌کنیم، می‌دانیم. و شهود (الشهود) عنایتی از جانب خداست که نور ایمانی که خداوند بصیرت‌های ما را با آن روشن کرده است، به ما عطا کرده است. و هر کس آنچه را مقرر کردیم بداند، علم زمین را که از باقیمانده خمیر طینت آدم (علیه السلام) خلق شده است، می‌داند. و می‌داند که تمام عالم، بلکه موجودات، آبادکنندگان آن زمین هستند و جز حق تعالی، خالق و منشئ آن از حیث هویتش، از آن خلاص نشده است، زیرا هستی (الوجود) برای او بود و نه برای آن (زمین). و اگر امر بر همان‌طور که ذکر کردیم نبود، منازله میان ما و حق صحیح نبود و نزول حق به آسمان دنیا و استواء بر عرش و عماء (العماء) که پروردگار ما قبل از خلق خلقش در آن بود، صحیح نبود. پس اگر حکم اسم الظاهر نبود، این حضرت (الحضرة) پدیدار نمی‌شد و این عالم به این صورت ظاهر نمی‌گشت. و اگر اسم الباطن نبود، نمی‌دانستیم که پرتاب‌کننده، خدا در صورت محمدیه است، و نه آنچه بالاتر از آن از صور است. پس فرمود: «وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ» (و هیچ بشری را نرسد که خدا با او سخن گوید)، در حالی که او بشر است، «إِلَّا وَحْيًا» (مگر به طریق وحی)، مانند قول او: «وَلَكِنَّ اللَّهَ رَمَى» (بلکه خدا پرتاب کرد).\n\nپس پرتاب‌کننده خداست و بصر، محمد را شهود می‌کند. «أَوْ مِنْ وَرَاءِ حِجَابٍ» (یا از پس پرده‌ای)، که صورت بشری است تا مناسبت میان دو صورت در خطاب واقع شود. «أَوْ يُرْسِلَ رَسُولًا» (یا رسولی بفرستد)، که او ترجمان حق در قلب بنده است: «نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ» (روح الامین آن را بر قلب تو نازل کرد). پس هنگامی که خداوند به رسول بشری از وجه خاص، با ارتفاع واسطه‌ها، وحی کند و رسول آن را بر ما القا کند، آن کلام حق برای ما از پس پرده آن صورت است که رسول نامیده می‌شود، اگر به سوی ما فرستاده شده باشد، یا نبی. و این رتبه ممکن است برای برخی از اولیاء نیز باشد. پس هنگامی که پوشش بشری از عین قلب کنار رود، تمام صور موجودات را در این مرتبه در خطاب برخی با برخی دیگر و شنیدن برخی از برخی دیگر درک می‌کند. پس متکلم و سامع و باطش (گیرنده) و ساعی (کوشنده) و محسوس و متخیّل و مصوّر و حافظ و تمام قوای منسوب به بشر، یاری می‌شوند. پس تمام منازلات، برزخی (برزخية) هستند میان اول و آخر و ظاهر و باطن و صور عالم و صور تجلی (التجلی). «فَأَجِرْهُ حَتَّى يَسْمَعَ كَلَامَ اللَّهِ» (پس او را پناه ده تا کلام خدا را بشنود). پس مترجم، متکلم است. و ما دانستیم که کلام شنیده شده، کلام خداست نه کلام او. پس بنگر که در خطاب برزخی خود چه آورده است و چشم فهم را برای درک آن بگشا و بر اساس آنچه تو را به آن خطاب کرده است، باش. و کلام خدا را جز با سمع خدا نمی‌شنود و کلام صورت را جز با سمع صورت. و شنونده از ورای سمع است و متکلم از ورای کلام. و «وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ» (و خدا از پشت سرشان احاطه دارد). «بَلْ هُوَ قُرْآنٌ مَجِيدٌ * فِي لَوْحٍ مَحْفُوظٍ» (بلکه آن قرآنی مجید است * در لوح محفوظ) از تبدیل و تغییر. پس یا دلالت بر توحید دارد، یا صفت تنزیه، یا صفت فعل، یا آنچه اشتراک را می‌رساند، یا تشبیه، یا حکم، یا قصص، یا موعظه‌ای با ترغیب یا ترهیب، یا دلالت بر مدلول علیه. پس آن محصور میان محکم و متشابه است. هر خطابی در عالم چنین است. پس طور جسم به دلیل میل طبیعی‌اش، چون در وجود خود مستقل نیست، و «كِتَابٍ مَسْطُورٍ» (و کتابی نوشته شده) از املای الهی و دست نویسنده با قلم اقتداری «فِي رَقٍّ مَنْشُورٍ» (در پوستی گشوده)، که آن عین توست از باب اشاره نه از باب تفسیر، آشکار است و درهم پیچیده نیست، پس پوشیده نیست. و «وَالْبَيْتِ الْمَعْمُورِ» (و خانه آباد)، که قلب است که حق را در خود جای داده، پس آباد است. و «وَالسَّقْفِ الْمَرْفُوعِ» (و سقف برافراشته)، آنچه در سر از قوای حسی و معنوی است. و «وَالْبَحْرِ الْمَسْجُورِ» (و دریای برافروخته)، رأی طبیعت افروخته شده با آتشی که در آن است، که حاکم و موجب حرکت است. «إِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ» (همانا عذاب پروردگارت واقع شدنی است)، یعنی آنچه نفس حیوانی و روح امری و عقل علوی از سرور مربی و مصلح شأن خود به آن پناه می‌برند، واقع شدنی است، یعنی بر آن ساقط می‌شود، زیرا منازل سفلی از حیث امکان مطلق و از حیث طبع مقید برای آن است. «مَا لَهُ مِنْ دَافِعٍ» (هیچ دفع‌کننده‌ای برای آن نیست)، زیرا در آنجا جز آنچه ذکر کردیم، نیست. پس تلقی (دریافت) برای تدلی (نزدیک شدن) و ترقی (بالا رفتن) برای تدانی (نزدیک شدن) از جانب ماست. و میان این دو حکم، ظهور برازخ (البرزخ) است که دارای مجد شامخ و علم راسخ هستند. و منازله ممکن است میان اسماء الهی باشد، مانند منازله در جنگ بر سر این انسان، هنگامی که با امر خدا مخالفت کند. پس تواب و غفور و رحمان او را می‌طلبند و منتقم و ضار و مذل و امثال آنها او را می‌طلبند. و در حدیثی از این باب وارد شده است:\n\nقول خداوند متعال: «در هیچ کاری که فاعل آن هستم، تردید نکردم، مانند تردیدی که در قبض روح بنده مؤمن می‌کنم. او مرگ را ناخوش می‌دارد و من ناخوش داشتن او را ناخوش می‌دارم، در حالی که چاره‌ای جز ملاقات من ندارد.»\n\nو این از منازله است. و من این کشف (الکشف) را چشیده‌ام و آن را از جانب خدا در کشتن دجال، در حضور رسول خدا (صلی الله علیه و سلم) دیدم. و از آنجا بود که باب بسط رحمت بر بندگان خدا برای من گشوده شد و دانستم که «رَحْمَتُهُ وَسِعَتْ كُلَّ شَيْءٍ» (رحمت او همه چیز را فرا گرفته است). پس ناگزیر است که حکم آن در هر چیزی نافذ شود. و حکمت معدوم شدن اعراض، نه خود آنها، در زمان دوم از زمان وجودشان و خلق امثال یا اضداد در محل را دانستم. زیرا اگر عرضی به ثبوت محلش ثابت می‌ماند، در صورتی که محل آن معنای مثلی، یعنی عرض دیگری مانند آن در عرضیت، نداشت، مانند جوهر باقی می‌ماند و حالش بر جوهر تغییر نمی‌کرد. پس یا از اول خلقتش دائم الشقاء (بدبخت) می‌بود یا دائم السعاده (خوشبخت). در نتیجه رحمت خدا بر اعیان مخصوصی محدود می‌شد، همان‌طور که به وجوب در قومی با نعت خاص است. و در کسی که به واسطه صفتی مقید به وجوب به آن (رحمت) نمی‌رسد، رحمت از باب امتنان به او می‌رسد، همان‌طور که به کسی رسید که مستحق آن بود و به واسطه صفتی که به او عطا شد، بر او واجب گشت و به آن متصف شد، پس رحمت برای او واجب شد. پس همه از طریق امتنان به آن رسیدند و آن به ایشان رسید. پس در آنجا جز منّت الهی نیست، نه در اصل و نه در فرع. سپس منازله میان دو انگشت از انگشتان رحمان در قلب، در میدان اراده، جریان می‌یابد. اگر آن را منحرف کند، رحمان آن را منحرف می‌کند و اگر آن را برپا دارد، رحمان آن را برپا می‌دارد. پس حکمی جز برای او نیست، زیرا او مستوی بر عرش است. پس احکام جز از این اسم نافذ نمی‌شوند. سپس منازله میان فرشته و شیطان بر قلب، به واسطه دو لَمّه (خطور) که مکلف در قلب خود می‌یابد، ظاهر می‌شود. اگر مکلف نباشد و ترددی در قلب خود بیابد، یا در دار تکلیف است یا نیست. اگر در دار تکلیف باشد، تردید فقط از لَمّه مَلَکی و لَمّه شیطانی است، به دلیل طلب هر یک از آن دو که آنچه لَمّه‌اش در آن نفوذ کرده است، برای مکلف در آن دخالتی با کمک در فساد باشد، تا گناه بر او جایز شود. مانند دو کودکی که به حد تکلیف نرسیده‌اند و به دلیل لَمّه شیطان که بر هر دوی آنها غلبه کرده است، با هم درگیر می‌شوند. سپس والدین آنها یا دو نفر از خویشاوندان یا همسایگان یا هر کس از حاضران از مردم می‌آیند و بدون میزان شرعی، بلکه از روی حمیت غرض، میان آنها دخالت می‌کنند. و چه بسا این امر منجر به کسب گناهی شود در آنچه برای آن دو تلاش کردند. به همین دلیل، حرکت کودک به شر از لَمّه شیطان است. پس بفهم و مواطن را بشناس تا به علم اتم اقرار کنی. و اگر مکلف نباشد و در دار تکلیف هم نباشد و ترددی در امری میان دو فعل بیابد که در انجام هیچ یک از آنها حرجی بر او نیست، آن تردید و منازله میان دو خاطر، مانند تردید الهی است، جز اینکه در بنده به خاطر طلب اولی و اعلی در حق اوست، همان‌طور که مکلف میان دو طاعت مردد می‌شود که کدام یک را انجام دهد. این تردید الهی است و از دو لَمّه نیست، بلکه دو غرض یا یک غرض است که به دو امر تعلق گرفته است، یا بر تساوی یا بیان ترجیحی که وقت اقتضا می‌کند. و او مکلف نیست و در دار تکلیف هم نیست، زیرا اگر تکلیف نبود، شیطان هرگز انسانی را با اغوا نزدیک نمی‌کرد، چون عبث است و حق، عبث نمی‌کند، زیرا همه فعل اوست و امر همه به او باز می‌گردد. پس صاحب علم منازلات باید بر همه اینها و امثال آن و هر ترددی در تمام عالم وقوف یابد. پس اصل اینها یا تردید الهی است یا دو انگشت یا دو لَمّه. و این امر دیگری است که حکم خاص خود را دارد. و اصل، تردید الهی و آنچه حقایق اسماء الهی متقابل اقتضا می‌کنند، می‌باشد. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خدا حق را می‌گوید و او راه را هدایت می‌کند). پس در این فصل برخی از معارف الهی را که در منازلات برای ما حاصل شده است، ذکر می‌کنیم، زیرا بیش از آن است که به شمار آید. از جمله آنها، آنچه ذکر می‌کنیم."
  },
  "page_count": 5
}