{
  "id": 399,
  "title": {
    "ar": "الباب التاسع والتسعون وثلاثمائة في معرفة منازلة منزل من دخله ضربت عنقه وما بقي أحد إلا دخله",
    "en": "Chapter Three Hundred and Ninety-Nine: Concerning the knowledge of the station (منزل) such that whoever enters it is executed, yet no one remains who does not enter it.",
    "ur": "باب تین سو ننانوے: اس منزل کے مقامات کی معرفت کے بیان میں کہ جو اس میں داخل ہوا اس کی گردن مار دی گئی، اور کوئی باقی نہیں رہا مگر وہ اس میں داخل ہوا۔",
    "fa": "باب سیصد و نود و نهم: در معرفتِ (المعرفة) منازلِ (منازلة) منزلگاهی که هر کس وارد آن شود، گردنش زده می‌شود، و هیچ کس باقی نمی‌ماند مگر اینکه وارد آن گردد."
  },
  "content": {
    "ar": "## «الباب التاسع والتسعون وثلاثمائة في معرفة منازلة منزل من دخله ضربت عنقه وما بقي أحد إلا دخله»\n\n\n> لو لا وجود الحق في الخلق *** لم يبق من يبقى ومن يبقى‏\n\n\n> قلت له إن كنت لي مغنيا *** من غير ما تحكم فاستبق‏\n\n\n> ما أنا غير لا ولا عينكم *** لأنني اعلم من يلقي‏\n\n\n> فانظر إلى الحكمة مكشوفة *** في الحق إذ ينعت بالحق‏\n\n\n### [منزل الاتحاد والعلماء بالله‏]\n\n\nوهذا هو منزل الاتحاد الذي ما سلم أحد منه ولا سيما العلماء بالله الذين علموا الأمر على ما هو عليه ومع هذا قالوا به فمنهم من قال به عن أمر إلهي ومنهم من قال به بما أعطاه الوقت والحال ومنهم من قال به ولا يعلم أنه قال به فأحوال الخلق مختلفة فيه فأما أصحاب النظر العقلي فأحالوه لأنه عندهم يصير الذاتين ذاتا واحدة وذلك محال ونحن وأمثالنا ترى ذاتا واحدة لا ذاتين ويجعل الاختلاف في النسب والوجوه والعين واحدة في الوجود والنسب عدمية وفيها وقع الاختلاف فتقبل الضدين الذات الواحدة من نسبتين مختلفتين فالله يقول فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله ويقول وهو القائل على لسان عبده سمع الله لمن حمده ويقول كنت سمعه الذي يسمع به وبصره ولسانه ويده ورجله‏\n\n\nوغير ذلك قولا شافيا لأنه ذكر أحكامها فقال الذي يبطش بها ويسعى بها ويتكلم به ويسمع به ويبصر به ويعلم ومعلوم أنه يسمع بسمعه أو بذاته يسمع وعلى كل حال فجعل الحق هويته عين سمع عبده وبصره ويده وغير ذلك فأما ذات العبد وإما صفته وأما نسبته فهذا قول الحق الذي فيه يمترون والملك يقول مع علمه بذلك ونَحْنُ نُسَبِّحُ بِحَمْدِكَ ونُقَدِّسُ لَكَ والجن يقول أَنَا خَيْرٌ مِنْهُ والرسول يقول ما قُلْتُ لَهُمْ إِلَّا ما أَمَرْتَنِي به ومن الناس من يقول أَ إِنَّا لَمَرْدُودُونَ في الْحافِرَةِ والسموات والأرض والجبال تأبى وتشفق من حمل الأمانة وتقول أَتَيْنا طائِعِينَ فما في العالم إلا من نسب الفعل إليه أي إلى نفسه مع علم العلماء بالله أن الفعل لله لا لغيره والله يقول والله خَلَقَكُمْ وما تَعْمَلُونَ فأضاف العلم إليهم وهو خالقه وموجدة أعني العمل‏\n\n\n> فأين حال الدعاوي *** من حال من يتبرأ\n\n\n> والأمر في العين فرد *** أحكامه فيه تترى‏\n\n\nوقال الهدهد أَحَطْتُ علما بِما لَمْ تُحِطْ به وقالَتْ نَمْلَةٌ يا أَيُّهَا النَّمْلُ ادْخُلُوا مَساكِنَكُمْ لا يَحْطِمَنَّكُمْ سُلَيْمانُ وجُنُودُهُ وقال الله يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ وقالت الجلود أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ وقال وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ فما ترك شيئا من المخلوقات إلا وأضاف الفعل إليه إلا إن هذا المنزل لا يتمكن لمن دخله أن يرأس عليه أحد من جنسه لا بل ولا أحد من المخلوقين وهو تعريف إلهي في حضرة خيال ومقامه أن يكشف له عن ماهية أحكام نفسه فيرى أنه محال أن يرأس عليه أحد فإن كشف له عن ماهيات أحكام نفوس العالم يرى أنه من المحال أن يرأس على أحد أو يرأس عليه أحد فإن الأمر واحد في نفسه والواحد لا يرأس على نفسه وهو مشهد عزيز العالم كله فيه ولا يعلمه إلا من شاهده ثم من هذا المقام ما تخيله من لم يطلع على صورة الأمر على ما هو عليه في نفسه من‏\n\n\nقوله تعالى قسمت الصلاة بيني وبين عبدي نصفين‏\n\n\nفتخيل أنه عينه الثابت في العدم ربما حصل لها الوجود لما رآه من حكم عينها في وجود الحق حتى انطلق عليه اسم هذا العين وما علم إن الوجود وجود الحق والحكم حكم الممكن مع ثبوته في عدمه فلما تخيل بعض الممكنات هذا التخيل من اتصافه بالوجود حكم بأنه قد شارك الحق في الوجود فصح له المقام مقام الجمع بوجود الحق في الوجود وفي نفس الأمر الوجود عين الحق ليس غيره فلما أدخله حضرته تعالى ضرب عنقه أي أزال جماعته لأن العنق الجماعة فلما زال عنه إطلاق الجماعة عليه بما أعطاه من أحدية الأمر وعلم أنه جهل في إمكانه نفسه وأن جميع الممكنات مثله في هذا الحكم وهو قوله وما بقي أحد إلا دخله أي في نفس الأمر ما ثم إلا أحدية مجردة علمها من علمها وجهلها من جهلها وهذا الحكم يظهر في الشهادة في وجود الحق بالاسم الخاص الذي لذلك الممكن الذي يقال فيه إنه عالم وجاهل وما كان من الأسماء والأحكام للممكنات والوجود للحق فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "## Chapter 399: Concerning the Knowledge of the Station of the Dwelling, such that whoever enters it has his neck struck, yet no one remains who has not entered it.\n\nWere it not for the existence (وجود) of the Real (الحق) in Creation (الخلق),\nNone would remain who remains, and none would subsist.\n\nI said to Him: If You are sufficient for me,\nWithout any judgment, then remain.\n\nI am nothing but negation, nor am I your essence,\nFor I know who casts forth (the revelation).\n\nSo look at Wisdom unveiled\nIn the Real, when He is described by the Real.\n\n### [The Station of Unification (Ittiḥād) and the Gnostics of Allah]\n\nThis is the station of Unification (الاتحاد), from which no one is safe, especially the Gnostics of Allah (العلماء بالله) who know the matter as it truly is, and yet they affirmed it. Among them, some affirmed it by Divine command, some affirmed it based on what the moment and the spiritual state (الحال) granted them, and some affirmed it without knowing that they affirmed it. Thus, the states of creation concerning it are diverse.\n\nAs for the people of rational speculation, they deemed it impossible, because in their view, it necessitates two essences (Dhāt) [الذات] becoming one essence, which is impossible. We and those like us see one Essence, not two essences. We place the difference in the relations (nisab) and aspects, while the Entity (العين) is one in Existence (الوجود). The relations are non-existent (عدمية), and it is in them that the difference occurs. Thus, the single Essence accepts the two opposites from two different relations.\n\nSo Allah says: <<فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله>> (Grant him protection until he hears the Word of Allah). And He says—and He is the Speaker through the tongue of His servant—\"Allah hears the one who praises Him.\" And He says (in the sacred Hadith): \"I was his hearing with which he hears, and his sight with which he sees, and his tongue, and his hand, and his foot.\" And other such statements that are conclusive, because He mentioned their functions (أحكام), saying: \"with which he strikes, and with which he walks, and with which he speaks, and with which he hears, and with which he sees, and with which he knows.\" It is known that He hears either by His hearing or by His Essence. In any case, the Real (الحق) made His Ipseity (هوية) the very essence of His servant's hearing, sight, hand, and so forth. Whether it is the servant's essence, or his attribute (صفة), or his relation—this is the saying of the Real concerning which they doubt.\n\nAnd the Angel says, despite knowing this: <<وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ>> (While we glorify You with praise and sanctify You). And the Jinn (Iblis) says: <<أَنَا خَيْرٌ مِنْهُ>> (I am better than him). And the Messenger (Jesus) says: <<مَا قُلْتُ لَهُمْ إِلَّا مَا أَمَرْتَنِي بِهِ>> (I said nothing to them except what You commanded me to say). And among mankind are those who say: <<أَإِنَّا لَمَرْدُودُونَ فِي الْحَافِرَةِ>> (Shall we indeed be restored to our former state?). And the heavens, the earth, and the mountains refuse and fear to bear the Trust, yet they say: <<أَتَيْنَا طَائِعِينَ>> (We have come willingly). There is no one in the World (العالم) except those who attribute the act to themselves—that is, to their own selves—even though the Gnostics of Allah know that the act belongs to Allah, not to anyone else. And Allah says: <<وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do). Thus, He attributed the action (العمل) to them, while He is its Creator and Originator.\n\nSo where is the state of claims\nCompared to the state of one who disavows?\n\nYet the matter, in its essence, is singular;\nIts rulings (أحكام) follow one after another within it.\n\nAnd the Hoopoe said: <<أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ>> (I have encompassed knowledge of what you have not encompassed). And an ant said: <<يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ>> (O ants, enter your dwellings, lest Solomon and his soldiers crush you). And Allah says: <<يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ>> (The Day when their tongues, their hands, and their feet will testify against them). And the skins will say: <<أَنطَقَنَا اللَّهُ الَّذِي أَنطَقَ كُلَّ شَيْءٍ>> (Allah has made us speak, He who makes everything speak). And He says: <<وَإِن مِّن شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ>> (There is not a thing but glorifies Him with praise). Thus, He left nothing among the created things without attributing the act to it.\n\nHowever, this dwelling (منزل) is such that whoever enters it cannot be ruled over by anyone of his own kind, nor indeed by any of the created beings. It is a Divine definition (تعريف إلهي) in the Presence of Imagination (حضرة خيال). Its station (مقامه) is that the reality of the rulings of his own soul is unveiled to him, and he sees that it is impossible for anyone to rule over him. If the realities of the rulings of the souls of the World are unveiled to him, he sees that it is impossible for him to rule over anyone, or for anyone to rule over him. For the matter is one in itself, and the One does not rule over itself. This is a precious witnessing (مشهد عزيز); the entire World is within it, and none knows it except he who witnesses it.\n\nFurthermore, concerning this station, there is what was imagined by those who were not informed of the true form of the matter as it is in itself, based on His saying, the Exalted: \"I have divided the prayer between Myself and My servant into two halves.\" They imagined that his Fixed Entity (العين الثابت) in non-existence (العدم) might have attained Existence, because they saw the ruling of that entity within the Existence of the Real (وجود الحق), until the name of this entity was applied to him. But he did not know that Existence is the Existence of the Real, and the ruling is the ruling of the contingent (الممكن), despite its fixity in its non-existence. When some contingent beings entertained this imagination—that they were characterized by Existence—they judged that they had shared in the Existence of the Real. Thus, the station of Gathering (مقامه مقام الجمع) was validated for them through the Existence of the Real in Existence. Yet, in reality, Existence is the very essence of the Real, and nothing else.\n\nSo when He, the Exalted, admitted him into His Presence (حضرة), He \"struck his neck\"—meaning, He removed his collectivity (جماعته), because the neck (العنق) signifies the collectivity. When the attribution of collectivity was removed from him, due to the Oneness (أحدية) of the matter granted to him, and he knew that he was ignorant regarding his own contingency, and that all contingent beings are like him in this ruling—this is His saying: \"yet no one remains who has not entered it.\" That is, in reality, there is nothing there except absolute Oneness (أحدية مجردة), known by those who know it and ignored by those who ignore it. This ruling appears in the Witnessing (الشهود) within the Existence of the Real, by means of the specific Name belonging to that contingent being, concerning whom it is said that he is knowing or ignorant. Whatever pertains to the Names (الأسماء) and rulings belongs to the contingent beings, while Existence (الوجود) belongs to the Real. Know this. And Allah says: <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "تین سو ننانوےواں باب: اس منزل کے مقام کی معرفت میں جس میں داخل ہونے والے کی گردن مار دی جاتی ہے، اور کوئی ایسا نہیں بچا جو اس میں داخل نہ ہوا ہو۔\n\nاگر مخلوق میں الحق (ذات حق) کا وجود نہ ہوتا،\nتو کوئی باقی رہنے والا باقی نہ رہتا، اور کون باقی رہتا؟\n\nمیں نے اس سے کہا: اگر تو میرے لیے بے حکمتی کے بغیر غنی کرنے والا ہے، تو باقی رہ۔\n\nمیں نہ تو غیر ہوں، نہ تمہاری عین (ذات)،\nکیونکہ میں جانتا ہوں کہ کون القاء (ڈالتا) کرتا ہے۔\n\nپس حکمت کو دیکھو جو الحق (ذات حق) میں منکشف ہے،\nجب وہ الحق (ذات حق) کے ساتھ موصوف ہوتا ہے۔\n\n### [منزل الاتحاد (اتحاد) اور اللہ کے علماء]\n\nاور یہ منزل الاتحاد (اتحاد) ہے جس سے کوئی بھی محفوظ نہیں رہا، خاص طور پر وہ علماء باللہ (اللہ کے علماء) جنہوں نے امر کو اس کی اصل حالت پر جانا۔ اس کے باوجود انہوں نے اس کا اقرار کیا، تو ان میں سے بعض نے حکم الٰہی کے تحت اس کا اقرار کیا، اور بعض نے اس حال اور وقت کے عطا کردہ کے سبب اس کا اقرار کیا، اور بعض نے اس کا اقرار کیا اور انہیں علم بھی نہیں کہ وہ اس کا اقرار کر رہے ہیں۔ پس اس میں مخلوق کے احوال مختلف ہیں۔\n\nلیکن جہاں تک عقلی نظر رکھنے والوں کا تعلق ہے، تو انہوں نے اسے محال قرار دیا کیونکہ ان کے نزدیک یہ دو ذاتوں کو ایک ذات بنا دیتا ہے، اور یہ محال ہے۔ اور ہم اور ہمارے جیسے لوگ ایک ہی ذات دیکھتے ہیں، دو ذاتیں نہیں، اور اختلاف کو نسبتوں اور وجوہات میں قرار دیتے ہیں، جبکہ عین (ذات) الوجود (ہستی) میں ایک ہے۔ اور نسبتیں عدمی ہیں، اور انہی میں اختلاف واقع ہوا ہے۔ پس ایک ہی ذات دو مختلف نسبتوں سے دو متضاد چیزوں کو قبول کرتی ہے۔\n\nپس اللہ تعالیٰ فرماتا ہے:\n**فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله** (تو اسے پناہ دے تاکہ وہ اللہ کا کلام سن لے) [التوبہ: 6]\nاور وہ فرماتا ہے، اور وہ اپنے بندے کی زبان پر کہنے والا ہے: \"سمع الله لمن حمده\" (اللہ نے سن لیا جس نے اس کی تعریف کی)۔\nاور وہ فرماتا ہے (حدیث قدسی میں): \"میں اس کا کان بن جاتا ہوں جس سے وہ سنتا ہے، اور اس کی آنکھ جس سے وہ دیکھتا ہے، اور اس کی زبان، اور اس کا ہاتھ، اور اس کا پاؤں۔\"\n\nاور اس کے علاوہ بھی شافی قول ہے، کیونکہ اس نے ان کے احکام کا ذکر کیا، پس فرمایا: \"جس سے وہ پکڑتا ہے، اور جس سے وہ چلتا ہے، اور جس سے وہ کلام کرتا ہے، اور جس سے وہ سنتا ہے، اور جس سے وہ دیکھتا ہے، اور جس سے وہ جانتا ہے۔\" اور یہ معلوم ہے کہ وہ اپنے کان سے سنتا ہے یا اپنی ذات سے سنتا ہے، اور بہر حال، الحق (ذات حق) نے اپنی ہویت کو اپنے بندے کے کان، اس کی آنکھ، اس کے ہاتھ اور دیگر چیزوں کا عین (ذات) قرار دیا۔ پس یا تو یہ بندے کی ذات ہے، یا اس کی صفت ہے، یا اس کی نسبت ہے۔ یہ الحق (ذات حق) کا وہ قول ہے جس میں وہ شک کرتے ہیں۔\n\nاور فرشتہ اس علم کے باوجود کہتا ہے:\n**وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ** (اور ہم تیری حمد کے ساتھ تسبیح کرتے ہیں اور تیری پاکیزگی بیان کرتے ہیں) [البقرہ: 30]\nاور جن کہتا ہے:\n**أَنَا خَيْرٌ مِنْهُ** (میں اس سے بہتر ہوں) [ص: 76]\nاور رسول (عیسیٰ علیہ السلام) کہتے ہیں:\n**مَا قُلْتُ لَهُمْ إِلَّا مَا أَمَرْتَنِي بِهِ** (میں نے ان سے نہیں کہا مگر وہی جس کا تو نے مجھے حکم دیا) [المائدہ: 117]\nاور لوگوں میں سے کوئی کہتا ہے:\n**أَإِنَّا لَمَرْدُودُونَ فِي الْحَافِرَةِ** (کیا ہم پہلی حالت کی طرف لوٹائے جائیں گے؟) [النازعات: 10]\nاور آسمان، زمین اور پہاڑ امانت اٹھانے سے انکار کرتے ہیں اور ڈرتے ہیں، اور کہتے ہیں:\n**أَتَيْنَا طَائِعِينَ** (ہم فرمانبردار ہو کر آئے) [فصلت: 11]\n\nپس عالم میں کوئی ایسا نہیں مگر جس نے فعل کو اپنی طرف یعنی اپنی ذات کی طرف منسوب کیا، باوجود اس کے کہ علماء باللہ (اللہ کے علماء) جانتے ہیں کہ فعل اللہ کے لیے ہے نہ کہ کسی اور کے لیے۔ اور اللہ فرماتا ہے:\n**وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ** (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا) [الصافات: 96]\nپس اس نے عمل کو ان کی طرف منسوب کیا، حالانکہ وہ (اللہ) ہی اس کا خالق اور موجد ہے، یعنی عمل کا۔\n\nپس دعووں کا حال،\nاس شخص کے حال سے کہاں ہے جو براءت اختیار کرتا ہے؟\n\nاور امر عین (ذات) میں فرد (اکیلا) ہے،\nاس کے احکام اس میں پے در پے آتے ہیں۔\n\nاور ہدہد نے کہا:\n**أَحَطْتُ بِمَا لَمْ تُحِطْ بِهِ** (میں نے اس چیز کا احاطہ کر لیا ہے جس کا تو نے احاطہ نہیں کیا) [النمل: 22]\nاور ایک چیونٹی نے کہا:\n**يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ** (اے چیونٹیو! اپنے بلوں میں داخل ہو جاؤ، کہیں سلیمان اور اس کے لشکر تمہیں کچل نہ ڈالیں) [النمل: 18]\nاور اللہ فرماتا ہے:\n**يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ** (جس دن ان پر ان کی زبانیں، ان کے ہاتھ اور ان کے پاؤں گواہی دیں گے) [النور: 24]\nاور کھالیں کہیں گی:\n**أَنْطَقَنَا اللَّهُ الَّذِي أَنْطَقَ كُلَّ شَيْءٍ** (ہمیں اللہ نے گویائی دی جس نے ہر چیز کو گویائی دی) [فصلت: 21]\nاور فرمایا:\n**وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ** (اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے) [الاسراء: 44]\n\nپس اس نے مخلوقات میں سے کوئی چیز نہیں چھوڑی مگر یہ کہ فعل کو اس کی طرف منسوب کیا، سوائے اس کے کہ اس منزل میں داخل ہونے والے کے لیے یہ ممکن نہیں کہ اس کی جنس کا کوئی شخص اس پر سرداری کرے، بلکہ مخلوقات میں سے کوئی بھی نہیں۔ اور یہ حضرۃ خیال میں ایک الٰہی تعریف ہے، اور اس کا مقام یہ ہے کہ اس کے لیے اس کے نفس کے احکام کی ماہیت کا الکشف (کشف) ہو جائے، پس وہ دیکھتا ہے کہ یہ محال ہے کہ کوئی اس پر سرداری کرے۔ اور اگر اس کے لیے عالم کے نفوس کے احکام کی ماہیت کا الکشف (کشف) ہو جائے، تو وہ دیکھتا ہے کہ یہ محال ہے کہ وہ کسی پر سرداری کرے یا کوئی اس پر سرداری کرے۔ کیونکہ امر اپنی ذات میں واحد ہے، اور واحد اپنی ذات پر سرداری نہیں کرتا۔ اور یہ ایک عزیز مشہد (مشاہدہ) ہے، سارا عالم اس میں ہے، اور اسے وہی جانتا ہے جس نے اس کا الشہود (شہود) کیا۔ پھر اس مقام سے وہم کیا اس شخص نے جو امر کی صورت پر مطلع نہ ہوا جیسا کہ وہ اپنی ذات میں ہے، اس کے اس قول سے:\n\nاللہ تعالیٰ کا فرمان (حدیث قدسی): \"میں نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کر دیا ہے۔\"\n\nپس اس نے وہم کیا کہ وہ اس کی عین (ذات) ہے جو عدم میں ثابت تھی، شاید اسے الوجود (ہستی) حاصل ہو گیا، جب اس نے الحق (ذات حق) کے الوجود (ہستی) میں اپنی عین (ذات) کا حکم دیکھا، یہاں تک کہ اس عین (ذات) کا نام اس پر بولا جانے لگا۔ اور اسے یہ علم نہ ہوا کہ الوجود (ہستی) الحق (ذات حق) کا الوجود (ہستی) ہے، اور حکم ممکن کا حکم ہے، باوجود اس کے کہ وہ اپنے عدم میں ثابت ہے۔ پس جب بعض ممکنات نے الوجود (ہستی) کے ساتھ متصف ہونے کا یہ وہم کیا، تو اس نے حکم لگایا کہ وہ الوجود (ہستی) میں الحق (ذات حق) کے ساتھ شریک ہو گیا ہے، پس اس کے لیے مقام جمع کا مقام صحیح ہو گیا، الوجود (ہستی) میں الحق (ذات حق) کے الوجود (ہستی) کے سبب۔\n\nاور نفس الامر میں الوجود (ہستی) الحق (ذات حق) کا عین (ذات) ہے، اس کے سوا کچھ نہیں۔ پس جب اس (اللہ) نے اسے اپنی حضرۃ میں داخل کیا تو اس کی گردن مار دی، یعنی اس کی جماعت کو زائل کر دیا، کیونکہ عنق (گردن) سے مراد جماعت ہے۔ پس جب اس پر جماعت کا اطلاق زائل ہو گیا، اس احدیت امر کے سبب جو اسے عطا کی گئی، اور اس نے جان لیا کہ وہ اپنے ممکن ہونے میں خود کو جاہل سمجھتا تھا، اور یہ کہ تمام ممکنات اس حکم میں اس کی طرح ہیں، اور یہی اس کا قول ہے: \"اور کوئی ایسا نہیں بچا جو اس میں داخل نہ ہوا ہو\"۔ یعنی نفس الامر میں صرف احدیۃ مجردہ (مجرد احدیت) ہے، اسے جس نے جانا اس نے جانا، اور جس نے اسے نہ جانا اس نے نہ جانا۔\n\nاور یہ حکم الشہود (شہود) میں الحق (ذات حق) کے الوجود (ہستی) میں اس خاص اسم کے ساتھ ظاہر ہوتا ہے جو اس ممکن کے لیے ہے، جس کے بارے میں کہا جاتا ہے کہ وہ عالم ہے اور جاہل ہے، اور جو کچھ اسماء اور احکام ممکنات کے لیے ہیں، اور الوجود (ہستی) الحق (ذات حق) کے لیے ہے، پس یہ جان لو۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے) [الاحزاب: 4]",
    "fa": "باب سیصد و نود و نهم (۳۹۹) در معرفت منزلتی که هر کس وارد آن شود گردنش زده می‌شود، و هیچ کس باقی نماند مگر آنکه وارد آن شد.\n\nاگر وجود حق (الوجود الحق) در خلق نبود،\nکسی که باقی می‌ماند و کسی که باقی می‌ماند، باقی نمی‌ماند.\n\nبه او گفتم: اگر برای من بی‌نیازکننده‌ای هستی،\nبدون هیچ حکمی، پس باقی بمان.\n\nمن نه غیرِ «لا» هستم و نه عین شما،\nزیرا من می‌دانم چه کسی القا می‌کند.\n\nپس به حکمت آشکار بنگر،\nدر حق (الحق) آنگاه که به حق وصف می‌شود.\n\n[منزل اتحاد و دانایان به حق (العلماء بالله)]\n\nاین همان منزل اتحاد است که هیچ کس از آن سالم نماند، به ویژه دانایان به حق (العلماء بالله) که امر را آن‌گونه که هست دانستند و با این حال به آن قائل شدند. برخی از آنان به امر الهی به آن قائل شدند، و برخی به آنچه وقت و حال به ایشان بخشید، و برخی به آن قائل شدند در حالی که نمی‌دانستند که به آن قائل شده‌اند. پس احوال خلق در این باره متفاوت است.\n\nاما اصحاب نظر عقلی آن را محال دانستند، زیرا نزد آنان [اتحاد] باعث می‌شود که دو ذات، یک ذات شوند و این محال است. در حالی که ما و امثال ما یک ذات می‌بینیم نه دو ذات، و اختلاف را در نسبت‌ها و وجوه قرار می‌دهیم، در حالی که عین (العین) در هستی (الوجود) یکی است. نسبت‌ها عدمی هستند و اختلاف در آنها رخ داده است. پس ذات واحد، دو ضد را از دو نسبت مختلف می‌پذیرد.\n\nپس خداوند می‌فرماید: **«پس او را پناه ده تا کلام خدا را بشنود» (فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ الله)** و می‌فرماید، و اوست گوینده بر زبان بنده‌اش: «سمع الله لمن حمده» (خداوند سخن کسی را که او را ستایش کند شنید) و می‌فرماید: «گوش او بودم که با آن می‌شنود، و چشم او، و زبان او، و دست او، و پای او.»\n\nو غیر از این، سخنی شفابخش است، زیرا احکام آنها را ذکر کرد و فرمود: «آنکه با آن می‌گیرد، و با آن می‌کوشد، و با آن سخن می‌گوید، و با آن می‌شنود، و با آن می‌بیند، و می‌داند.» و معلوم است که او با گوش خود می‌شنود یا با ذات خود می‌شنود. در هر حال، حق (الحق) هویت خود را عین گوش بنده و چشم و دست او و غیره قرار داد. پس یا ذات بنده است، یا صفت او، یا نسبت او. این سخن حق است که در آن شک می‌کنند.\n\nو فرشته با علم به این امر می‌گوید: **«و ما تو را با ستایشت تسبیح می‌گوییم و تو را تقدیس می‌کنیم» (وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ ونُقَدِّسُ لَكَ)**. و جن می‌گوید: **«من از او بهترم» (أَنَا خَيْرٌ مِنْهُ)**. و رسول می‌گوید: **«به آنان نگفتم مگر آنچه را که مرا به آن امر کردی» (ما قُلْتُ لَهُمْ إِلَّا ما أَمَرْتَنِي به)**. و برخی از مردم می‌گویند: **«آیا ما به حالت اول بازگردانده می‌شویم؟» (أَ إِنَّا لَمَرْدُودُونَ فِي الْحافِرَةِ)**. و آسمان‌ها و زمین و کوه‌ها از حمل امانت سر باز زدند و ترسیدند و گفتند: **«با اطاعت آمدیم» (أَتَيْنا طائِعِينَ)**. پس در عالم نیست مگر کسی که فعل را به خود نسبت دهد، یعنی به نفس خود، با وجود علم دانایان به حق (العلماء بالله) که فعل از آن خداست نه غیر او. و خداوند می‌فرماید: **«و خداوند شما و آنچه را عمل می‌کنید آفریده است» (والله خَلَقَكُمْ وما تَعْمَلُونَ)**. پس عمل را به آنان نسبت داد، در حالی که او خالق و ایجادکننده‌ی آن است، یعنی عمل.\n\nپس حال ادعاها کجا،\nاز حال کسی که بیزاری می‌جوید؟\n\nو امر در عین (العین) یگانه است،\nاحکامش در آن پی در پی می‌آید.\n\nو هدهد گفت: **«من به چیزی احاطه علمی یافتم که تو احاطه نیافتی» (أَحَطْتُ علما بِما لَمْ تُحِطْ به)**. و مورچه‌ای گفت: **«ای مورچگان، به خانه‌های خود وارد شوید تا سلیمان و لشکریانش شما را درهم نشکنند» (يا أَيُّهَا النَّمْلُ ادْخُلُوا مَساكِنَكُمْ لا يَحْطِمَنَّكُمْ سُلَيْمانُ وجُنُودُهُ)**. و خداوند فرمود: **«روزی که زبان‌ها و دست‌ها و پاهایشان بر ضد آنان شهادت می‌دهند» (يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وأَيْدِيهِمْ وأَرْجُلُهُمْ)**. و پوست‌ها گفتند: **«خدایی که هر چیزی را به سخن درآورده، ما را به سخن درآورده است» (أَنْطَقَنَا الله الَّذِي أَنْطَقَ كُلَّ شَيْ‏ءٍ)**. و فرمود: **«و هیچ چیزی نیست مگر آنکه با ستایش او تسبیح می‌گوید» (وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ)**. پس هیچ چیز از مخلوقات را فرو نگذاشت مگر آنکه فعل را به آن نسبت داد.\n\nجز اینکه کسی که وارد این منزل شود، ممکن نیست که کسی از جنس خودش بر او ریاست کند، بلکه هیچ یک از مخلوقات نیز نمی‌توانند. و این تعریفی الهی در حضرت خیال است. مقام او این است که ماهیت احکام نفسش بر او کشف (الکشف) شود، پس می‌بیند که محال است کسی بر او ریاست کند. و اگر ماهیات احکام نفوس عالم بر او کشف شود، می‌بیند که محال است بر کسی ریاست کند یا کسی بر او ریاست کند، زیرا امر در ذات خود واحد است و واحد بر خود ریاست نمی‌کند. و این مشهدی (الشهود) عزیز است که تمام عالم در آن است و جز کسی که آن را مشاهده کند، نمی‌داند. سپس از این مقام، کسی که بر صورت امر آن‌گونه که در ذات خود هست آگاه نشده، چنین پنداشته است از:\n\nسخن خداوند متعال: «نماز را میان خود و بنده‌ام به دو نیم تقسیم کردم.»\n\nپس گمان کرد که عین ثابت او در عدم، شاید به هستی (الوجود) رسیده باشد، به دلیل حکمی که از عین خود در هستی حق (وجود الحق) دید، تا جایی که نام این عین بر او اطلاق شد. و ندانست که هستی (الوجود)، هستی حق (وجود الحق) است و حکم، حکم ممکن است با وجود ثبوتش در عدم. پس چون برخی از ممکنات این گمان را از متصف شدن به هستی (الوجود) کردند، حکم کردند که در هستی (الوجود) با حق (الحق) شریک شده‌اند. پس مقام جمع به واسطه هستی حق (وجود الحق) در هستی برای او صحیح شد. در حالی که در نفس امر، هستی (الوجود) عین حق (الحق) است و غیر آن نیست.\n\nپس چون او را وارد حضرت خود کرد، گردنش را زد، یعنی جماعتش را از بین برد، زیرا «عنق» (گردن) به معنای جماعت است. پس چون اطلاق جماعت از او زائل شد، به واسطه آنچه از احدیت امر به او بخشید، و دانست که در امکان نفس خود جاهل بوده و اینکه تمام ممکنات در این حکم مانند او هستند، و این همان سخن اوست: «و هیچ کس باقی نماند مگر آنکه وارد آن شد»، یعنی در نفس امر، جز احدیت مجردی نیست که هر کس آن را دانست، دانست و هر کس آن را ندانست، ندانست. و این حکم در شهود (الشهود) در هستی حق (وجود الحق) با اسم خاصی که برای آن ممکن است، ظاهر می‌شود؛ همان ممکنی که درباره‌اش گفته می‌شود دانا و نادان است. و آنچه از اسماء و احکام است برای ممکنات است و هستی (الوجود) برای حق (الحق) است. پس این را بدان. و خداوند **«حق را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)**."
  },
  "page_count": 1
}