{
  "id": 149,
  "title": {
    "ar": "الباب التاسع والأربعون ومائة في معرفة مقام الخلق وأسراره",
    "en": "Chapter One Hundred and Forty-Nine: On the Gnosis of the Station of Creation and its Mysteries.",
    "ur": "ایک سو انچاسواں باب: مقام خلق کی معرفت اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و چهل و نهم در معرفت مقام خلق و اسرار آن"
  },
  "content": {
    "ar": "## (الباب التاسع والأربعون ومائة في معرفة مقام الخلق وأسراره)\n\n\n> كون التخلق في الإنسان والخلق *** مثل التكحل في العينين والكحل‏\n\n\n> وإن تضاعف فيه أجره فمتى *** ينال مرتبة الأملاك والرسل‏\n\n\n> ذاك الوحيد الذي يحيا الزمان به *** فهو المرتب للاحكام والدول‏\n\n\n> تنحط من عزها غلب الرقاب له *** وهو المثبت للاعراض والعلل‏\n\n\n### [نسبة الأخلاق إلى الله وإلى الإنسان‏]\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما كان الله لينهاكم عن الربا ويأخذه منكم‏\n\n\nوهو حديث صحيح فأدخل نفسه معنا فيما نهانا عنه في الحكم فالأخلاق كلها نعوت إلهية فكلها مكارم وكلها في جبلة الإنسان ولذلك خوطب بها فإن بعض من لا معرفة له بالحقائق يقول إنها في الإنسان تخلق وفي الحق خلق فهذا من قائله جهل بالأمور إن لم يطلق ذلك مجازا أو بالنظر إلى تقدم وجود الحق على وجود العبد لأنه واجب الوجود لنفسه والإنسان موجود بربه فاستفاد الوجود فاستفاد الخلق منه فإذا راعى هذا الأصل فقال بالتخلق كان صحيح المقصد وإن أراد بالتخلق أن ما هو للحق حقيقة واتصف به العبد إن لم يكن عنده إلا في الوقت الذي اتصف به فسماه لذلك تخلقا لا خلقا وما يكون خلقا إلا ما جبل عليه في أصل نشأته فلا علم له بنشأة الإنسان ولا بإعلام النبي صَلَّى اللهُ عَليهِ وسَلَّم بأن الله خلق آدم على صورته ويلزم هذا القائل أن يكون ما جعله من الصفات حقيقة للعبد ثم رأينا الحق قد اتصف به أن يكون ذلك في الله تخلقا من الله بما هو حق‏\nللإنسان وهذا لا يقول به من عنده أدنى شي‏ء من العلم‏\n\n\n### [الأخلاق الإلهية كلها في الجبلة الإنسانية]\n\n\nوالصحيح في هذه الأخلاق الإلهية إنها كلها في جبلة الإنسان وتظهر لمن يعرفها في كل إنسان على حد ما تظهر في الجناب الإلهي فإن كل خلق من هذه الأخلاق لا يصح أن تعم المعاملة به جميع الأكوان لا من جانب الحق ولا من جانب الإنسان فهو كريم على الإطلاق وكذلك الإنسان كريم على الإطلاق ومع كون الحق كريما على الإطلاق فمن أسمائه المانع ومن أسمائه الضار ومن أسمائه المذي ويغفر ويعذب من يشاء ويؤتي الملك وينزع الملك وينتقم ويجود وهو مع هذا التقييد في حق قوم دون قوم مطلق الصفة وكذا هي في الإنسان فهي خلق أصلي له لا تخلق ولا يصح أن تعم من الإنسان هذه الأخلاق مع كونها مطلقة في حقه كما لم يصح أن تعم من الله في جميع الخلق مع كونه تعالى مطلق الوصف بها ولا يصح في هذه الصفات الاستعارة إلا مجازا كما قلنا من حيث إنه تعالى كان بهذه الصفات وما كنا فلما كنا كنا بها لا أنا اكتسبناها ولا استعرناها منه فإنها صفة قديمة لله أي نسبة اتصف بها الحق ولا عالم والصفة لا بد لها من موصوف بها فإنها من حقيقتها لأن تقوم بنفسها ويؤدي القول باستعارتها إلى قيامها بنفسها وإلى خلو الحق عنها وإلى أن يكون الحادث محلا لوجود القديم فيه وهذا كله ما لا يقول به أحد من العلماء بالله‏\n\n\n### [العقد الصحيح من غير ترجيح في إطلاق صفات التنزيه والتشبيه‏]\n\n\nفجميع ما يظهر من الإنسان من مكارم أخلاق وسفساف أخلاق كلها في جبلته وهي له حقيقة لا مجاز ولا معارة كما أنه سبحانه جميع ما سمي به الحق نفسه لا وما وصف به نفسه من صفات الأفعال من خلق وإحياء وإماتة ومنع وعطاء وجعل ومكر وكيد واستهزاء وفصل وقضاء وجميع ما ورد في الكتب المنزلة ونطقت به الرسل من ضحك وفرح وتعجب وتبشبش وقدم ويد ويدين وأيد وأعين وذراع كل ذلك نعت صحيح فإنه كلامه تعالى عن نفسه وكلام رسله عنه وهو الصادق وهم الصادقون بالأدلة العقلية ولكن على حد ما يعلمه وعلى حد ما تقبله ذاته وما يليق بجلاله لا يزد شيئا من ذلك ولا نحيله ولا نكفيه ولا نقول بنسبة ذلك كله إليه كما ننسبه إلينا نعوذ بالله فإننا ننسبه إلينا على حد علمنا بنا فنعرف كيف ننسبه والحق يتعالى أن تعرف ذاته فيتعالى أن يعرف كيف ننسب إليه ما نسبه إلى نفسه ومن رد شيئا أثبته الحق لنفسه في كتابه أو على لسان رسوله فقد كفر بما جاء به من عند الله وبمن جاء به وبالله ومن آمن ببعض ذلك ورد بعضه فقد كفر حقا ومن آمن بذلك وشبهه في نسبة ذلك إليه تعالى مثل نسبتها إلينا أوتوهم ذلك أو خطر على باله أو تصوره أو جعل ذلك ممكنا فقد جهل وما كفر هذا هو العقد الصحيح من غير ترجيح‏\n\n\n### [الأسماء التي تطلق على العبد فقط لا على الجناب الإلهي‏]\n\n\nغير أن ثم أسماء تطلق على العبد ولا تطلق على الجناب الإلهي وإن كان المعنى يشمل ذلك كالبخيل يطلق على العبد ولا يطلق على الحق وهو منع ومن أسمائه المانع ومن بخل فقد منع هذا هو الحق غير أنا نلتمس له وجها وهو أن نقول كل بخل منع وما كل منع بخل فمن منع المستحق حقه فقد بخل والحق قرر قول موسى أن الله أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فما بخل عليك من أعطاك خلقك ووفاك حقك فمنع ما لا يستحقه الخلق ليس بمنع بخل فبهذا القدر نجعل التفرقة بين المنعين وكذلك اسم الكاذب مما اختص به العبد ولا ينبغي أن يطلق على الحق فهو الصادق بكل وجه كما أن العبد صادق وكاذب وصادق أيضا بكل وجه ولكن نسبة الصدق إلى العبد بكل وجه معروف عندنا لعلمنا بنا ونسبتها إلى الحق مجهولة لنا فهو الصادق كما ينبغي أن يضاف إليه الصدق وقال تعالى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ وقال ينزل ربنا إلى السماء الدنيا كل ليلة\n\n\nفقيد نزوله بالزمان والتقييد بالزمان تقييد بالانتقال وكل ذلك مجهول النسبة ثابت الحكم متوجه كما ينبغي لجلاله وكذلك الاسم الجاهل من أسماء الكون ولا يليق بالجناب الإلهي فالإله عالم من حيث إنه موصوف بالعلم والعبد عالم من حيث إنه موصوف بالعلم وجاهل من حيث خصوص تعلق علمه ببعض الأشياء دون بعض والحق مطلق العلم عام التعلق وقد قال تعالى ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ فحدد خلاف المعقول وأشارت السوداء إن الله في السماء حين قال لها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أين الله وأثبت لها الايمان في إشارتها\n\n\nوهذا خلاف دليل العقل فقد عرف من الله ما لم نعرف ومع هذا فنقول إن الله هو العالم بنفسه وهو الصحيح فما من اسم تسمى العبد به ولم يتسم الحق به وكان في الخلق نعت نقص وسفساف خلق إلا والعقل والحق قد منع أن يطلق على الله ذلك الاسم أو ينسب إليه ذلك الخلق ومع هذا فإنه يخبر بأمور وفصول تقابل أدلة العقول فهو الفعال لما يشاء والجاعل في خلقه ما يشاء لا احتكام عليه وهو الحاكم لا يُسْئَلُ عَمَّا يَفْعَلُ وهُمْ يُسْئَلُونَ‏\nوقد نبهناك على أمر جليل وعلم عظيم وسر غامض خفي لا يعلمه إلا الله ومن أعلمه من المخلوقين أحاله عقل وورد به نقل وبعد عنه فهم وقبله فهم‏\n\n\n### [حقيقة معرفة النفس وحقيقة معرفة الرب‏]\n\n\nفإن تدبرت فصول هذا الباب وقفت على لباب المعرفة الإلهية وتحققت‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nوقد أوجدتك أنك محل لكل صفة محمودة ومذمومة ثم أعلمتك معنى الحمد والذم وحددتك وأطلقتك ذلك لتعلم أنك العالم الذي لا يعلم وهو سبحانه العالم الذي يعلم ولا يعلم فلا يعلم ما هو العبد عليه وأعني بالعبد العالم كله والإنسان إلا الله تعالى هو يعلمه ثم أعلم بعض عبيده فمنا من علم نفسه ومنا من جهل نفسه ومنا من تخيل أنه علم نفسه ومنا من علم من نفسه بعض ما هو عليه في نفسه وبذلك القدر ينسب إليه أنه علم من ربه فإنه‏\n\n\nمن عرف نفسه عرف ربه‏\n\n\nوكما لا يجتمع الدليل والمدلول لا تجتمع أنت وهو في حد ولا حقيقة فإنه الخالق وأنت المخلوق وإن كنت خالقا وهو المالك وأنت المملوك وإن كنت مالكا فلا يحجبنك الاشتراك في الأخلاق فإنك المخلوق وهو الخلاق‏\n\n\n### [مقام الخلق والتخلق والتحقق بالخلق الإلهي‏]\n\n\nفهذا مقام الخلق قد أبنته وما عدا هذا مما تشير إليه الصوفية من التخلق فهو تلفيق من الكلام وقولهم في التخلق بالأسماء كذلك ونحن قد أطلقنا مثل ما أطلقوه ولكن عن علم محقق وإطلاق مطلق بأدب إلهي عن تحقق فهو في الحقيقة خلق لا تخلق كما أفهمتك وأكثر من هذا الإيضاح والبيان الذي يطلبه هذا المقام فلا يكون فإنا ما تعدينا فيه حدود الله في عبارتنا ولا ذكرنا شيئا ما نسبه إلى نفسه فما خرجنا عن كلامه وما أنزله على الصادقين من عباده وهُوَ الْحَكِيمُ الْعَلِيمُ بل هُوَ الْعَلِيمُ الْحَكِيمُ فهو العليم ولا عالم وهو الحكيم في ترتيب العالم فالعالم والعليم أعم والحكيم تعلق خاص للعلم فهذا هو التحقق بالخلق الإلهي‏\n\n\n### [الأخلاق التي يحتاج إلى معرفتها أهل السلوك‏]\n\n\nوأما الأخلاق التي تحتاج إلى معرفتها أهل السلوك وكلنا سالك إذ لا تصح نهاية فهو أن نقول إن العرف والشرع قد وردا بمكارم الأخلاق وسفساف الأخلاق وأمرنا بإتيان مكارمها واجتناب سفسافها ثم إن الشرع قد نبه على أنها على قسمين من الأخلاق ما يكون في جبلة الإنسان كما\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للاشج أشج عبد القيس إن فيك لخصلتين يحبهما الله ورسوله الحلم والأناة وفي لفظ آخر لغير مسلم فقال الرجل يا رسول الله أ شي‏ء جبلت عليه قال نعم قال الحمد لله الذي جبلني عليهما أو كما قال‏\n\n\nومنها مكتسبة فالمكتسب هو الذي يعبر عنه بالتخلق وهو التشبه بمن هي فيه هذه الأخلاق الكريمة جبلية في أصل خلقه ولا شك أن استعمال مكارم الأخلاق صعب لملاقاة الضد في استعمالها في الكون فإن الغرضين والإرادتين من الشخصين إذا تعارضتا وطلب كل واحد منهما منك أن تصرف معه كريم خلق بقضاء غرضه ولا يتمكن لك الجمع بينهما فمهما أرضيت الواحد أسخطت الآخر وإذا تعذر الجمع واستحال تعميم الرضي وتصريف الخلق الكريم مع كل واحد منهما تعين على الإنسان أن يخرج عن نفسه في ذلك ويجعل الحكم فيه للشرع فيتخذه لهذا الباب ميزانا وإماما\n\n\n### [الميزان والإمام للسير وفي السير إلى الإمام‏]\n\n\nفاجعل إمامك ما يرضي الله وفيما يرضي الله ولتصرف خلقك الكريم مع الله خاصة فهو الصاحب والخليفة وهو أولى أن يعامل بمكارم الأخلاق فما قدمه الله قدمه فإن ذلك التقديم هو تصريف الحق لذلك الخلق مع ذلك العبد وفي ذلك المحل فتصريف خلقك مع الله أولى من تصريفه مع الكون بل هو واجب لا أولى فإن جميع الخلق من الملائكة والرسل والمؤمنين يحمدونك على ذلك الفعل والخلق الذي عاملت به ذلك الشخص الذي قدمه الحق وأوجب عليك أن تعامله به وما يذمك فيه إلا صاحب ذلك الغرض إذا لم يكن مؤمنا ومراعاة الأصل أولى وإذا لم تتخلق بمكارم الأخلاق على ما رسمته لك لم يصح لك هذا المقام ويذمك فيه كل مخلوق أ لا ترى شاهد الزور فإنه أول من يتجرح عنده ولا يعتقد فيه ويذمه في باطنه من شهد له وقد أسخط الله وملائكته ورسله والمؤمنين وليست مكارم الأخلاق إلا ما يتعلق منها بمعاملة غيرك لا غير وما عدا ذلك فلا يسمى مكارم خلق وإنما هي نعوت يتخلق بها لتصحيح الصورة أو النسبة لا غير هذا هو ربط هذا الباب في السالكين والمخلصين سعادة الأبد وتفاصيل تصاريف الأخلاق مع الموجودات تكثر لو بيناها وكيفياتها لم يحصرها كتاب وبعد أن أعطيناك أصلا فيها تعتمد عليه فاعمل به وهو أن تنظر إلى حكم الشرع في كل حركة منك في حق كل موجود فتعامله بما قال لك الشارع عامله به على الوجوب أو الندب ولا تتعداه تكن في ذلك محمود النقيبة مأمونا معظما عند الله صاحب نور إلهي‏\n\n\nفإن كنت فعالا بالهمة أرضيت جميع الموجودات عنك إذ كان لك‏\nالتصرف في الكل وهو مقام عزيز يعلم ويعقل ولكن ما حصله أحد من خلق الله فهو مخصوص بالحق ولا يظهر به الحق إلا إذا أخذ أهل النار منازلهم وأهل الجنة منازلهم رضي الكل بما هم فيه بإرضاء الحق فلا يشتهي واحد منهم يخرج عن منزلته وهو بها مسرور وهو سر عجيب ما رأينا أحدا نبه عليه من خلق الله وإن كانوا قد علموه بلا شك وما صانوه والله أعلم إلا صيانة لأنفسهم ورحمة بالخلق لأن الإنكار يسرع إليه من السامعين وو الله ما نبهت عليه هنا إلا لغلبة الرحمة علي في هذا الوقت فمن فهم سعد ومن لم يفهم لم يشق بعدم فهمه وإن كان محروما والسلام‏\n\n",
    "en": "Chapter One Hundred and Forty-Nine: Concerning the Knowledge of the Station of Character (مقام الخلق) and its Secrets.\n\nThe existence of acquired character (التخلق) in the human and innate character (الخلق)\nIs like the application of kohl (التكحل) to the eyes and the kohl itself (الكحل).\n\nEven if his reward is multiplied therein, when\nWill he attain the level (مرتبة) of the angels and the Messengers (الرسل)?\n\nThat unique one by whom Time is sustained,\nHe is the arranger of decrees and dominions.\n\nNecks bow down to him from their glory,\nAnd he is the establisher of accidents and causes.\n\n### The Relation of Characters to God and to Man\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Allah would not forbid you from usury (الربا) and then take it from you.\" This is an authentic hadith, and thus He included Himself with us in the ruling concerning what He forbade us.\n\nAll characters (الأخلاق) are Divine descriptions (نعوت إلهية); all of them are noble qualities (مكارم), and all of them are in the innate nature (جبلة) of the human, which is why he is addressed concerning them. Indeed, some who lack gnosis (معرفة) of the Realities (الحقائق) say that these qualities are acquired character (تخلق) in the human, but innate character (خلق) in the Real (الحق). This statement, unless intended metaphorically or by considering the priority of the Real’s Existence (وجود الحق) over the servant’s existence—since He is the Necessary Existent (واجب الوجود) by Himself, and the human exists through his Lord, thereby gaining existence and consequently gaining character from Him—is ignorance of the matters on the part of its speaker.\n\nIf he observes this principle and speaks of acquired character (التخلق), his intention is sound. But if he means by acquired character (التخلق) that which is a Reality (حقيقة) belonging to the Real, and which the servant only possesses at the moment he is described by it, and therefore calls it *takhalluq* (acquired character) and not *khuluq* (innate character)—and holds that *khuluq* is only that upon which one is innately constituted (جبل عليه) in the origin of his creation—then he has no knowledge of the creation of the human nor of the Prophet’s notification, peace and blessings be upon him, that Allah created Adam upon His form (صورته). Furthermore, this speaker would be obliged to accept that any attribute he deems a reality belonging to the servant, which we then see the Real described by, must be an acquired character (تخلق) in God, adopted from what is proper to the human. No one possessing the slightest degree of knowledge would assert this.\n\n### All Divine Characters are in the Human Innate Nature\n\nThe correct view regarding these Divine characters (الأخلاق الإلهية) is that they are all present in the innate nature (جبلة) of the human, and they appear to those who know them in every human being just as they appear in the Divine Presence (الجناب الإلهي). For it is not valid for any of these characters to be universally applied in interaction with all existent things (الأكوان), neither from the side of the Real nor from the side of the human. He (the Real) is Generous (كريم) absolutely (على الإطلاق), and likewise, the human is Generous absolutely. Yet, despite the Real being Generous absolutely, among His Names are The Withholder (المانع), The Harmer (الضار), and The Humiliator (المذي). He forgives and punishes whom He wills, grants sovereignty and removes sovereignty, takes vengeance, and bestows bounty. Despite this restriction concerning some people rather than others, He is absolute in description.\n\nSimilarly, these qualities are in the human; they are an original character (خلق أصلي) for him, not an acquired character (تخلق). It is not valid for the human to universally apply these characters, even though they are absolute in relation to him, just as it was not valid for God to universally apply them to all creation, despite His being absolutely described by them.\n\nIt is not valid to speak of these attributes as being borrowed (الاستعارة) except metaphorically, as we said, in the sense that He, the Exalted, was described by these attributes while we were not; then, when we came into existence, we possessed them, not that we acquired them or borrowed them from Him. For they are ancient attributes (صفة قديمة) of Allah—meaning a relation by which the Real was described while there was no world (عالم). An attribute must necessarily have a subject described by it, as it is inherent to its reality that it cannot subsist by itself. The assertion that they are borrowed (استعارتها) leads to their self-subsistence, to the Real being devoid of them, and to the contingent (الحادث) becoming a locus for the existence of the Ancient (القديم) within it. None of the scholars of God (العلماء بالله) would assert any of this.\n\n### The Correct Creed without Preference in Applying the Attributes of Transcendence and Similarity\n\nTherefore, all that appears from the human, whether noble characters (مكارم أخلاق) or base characters (سفساف أخلاق), are all in his innate nature (جبلته); they are a reality for him, not a metaphor nor borrowed. Just as He, the Glorified, all that the Real named Himself with, and all that He described Himself with from the attributes of Acts (صفات الأفعال)—such as creating, giving life, causing death, withholding, giving, appointing, plotting (مكر), scheming (كيد), mocking (استهزاء), separating, and judging—and all that was mentioned in the revealed Books and spoken by the Messengers (الرسل) concerning laughter (ضحك), joy, wonder, smiling, foot (قدم), hand (يد), two hands (يدين), hands (أيد), eyes (أعين), and arm (ذراع)—all of that is a true description (نعت صحيح).\n\nFor it is His speech, the Exalted, about Himself, and the speech of His Messengers about Him, and He is the Truthful, and they are the truthful, based on rational proofs (الأدلة العقلية). However, this is according to the limit He knows, and according to what His Essence (ذاته) accepts and what befits His Majesty (جلاله). We neither add anything to that, nor deny it, nor suffice ourselves with it, nor do we assert that all of this is attributed to Him in the same way we attribute it to ourselves—we seek refuge in Allah! For we attribute it to ourselves according to our knowledge of ourselves, and thus we know how to attribute it. But the Real is too exalted for His Essence to be known, and thus too exalted for it to be known how we should attribute to Him what He attributed to Himself.\n\nWhoever rejects anything that the Real affirmed for Himself in His Book or upon the tongue of His Messenger has disbelieved in what came from God, in the one who brought it, and in God. Whoever believes in some of that and rejects some of it has truly disbelieved. And whoever believes in that but likens (شبهه) its attribution to the Exalted to its attribution to us, or imagines that, or lets it cross his mind, or pictures it, or deems it possible, has been ignorant, but has not disbelieved. This is the correct creed (العقد الصحيح) without preference (من غير ترجيح).\n\n### Names Applied Only to the Servant, Not to the Divine Presence\n\nHowever, there are Names (أسماء) applied to the servant (العبد) but not to the Divine Presence (الجناب الإلهي), even if the meaning encompasses them. For example, The Miser (البخيل) is applied to the servant but not to the Real (الحق). Miserliness is withholding (منع), and among His Names is The Withholder (المانع). Whoever is miserly has withheld. This is the truth. Yet, we seek a way to reconcile this by saying: every miserliness is withholding, but not every withholding is miserliness. Whoever withholds what is due to the deserving has been miserly. The Real confirmed the saying of Moses: <<أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ>> (He gave everything its creation). He was not miserly toward you, since He gave you your creation and fulfilled your due. Therefore, withholding what creation does not deserve is not miserly withholding. By this measure, we establish the distinction between the two types of withholding.\n\nLikewise, the name The Liar (الكاذب) is specific to the servant and should not be applied to the Real, for He is The Truthful (الصادق) in every respect. Just as the servant is truthful and a liar, and also truthful in every respect, but the attribution of truthfulness to the servant in every respect is known to us due to our knowledge of ourselves, while its attribution to the Real is unknown to us. Thus, He is The Truthful as befits the attribution of truthfulness to Him.\n\nThe Exalted said: <<الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏>> (The All-Merciful established Himself upon the Throne). And He said: \"Our Lord descends to the lowest heaven every night.\" He restricted His descent by time, and restriction by time implies restriction by movement (الانتقال). All of this is unknown in its modality (مجهول النسبة), yet fixed in its ruling, and directed as befits His Majesty (جلاله).\n\nLikewise, the name The Ignorant (الجاهل) is among the names of the cosmos (الكون) and is not fitting for the Divine Presence. The God is Knower (عالم) in that He is described by Knowledge (العلم). The servant is Knower in that he is described by Knowledge, and ignorant in that the specific relation of his knowledge pertains to some things but not others. The Real is absolute in Knowledge (مطلق العلم) and universal in relation.\n\nThe Exalted said: <<ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ>> (And We are nearer to him than the jugular vein). Thus, He established a limit contrary to what is rationally conceivable. And the black woman pointed out that God is in the heaven when the Messenger of Allah, peace and blessings be upon him, asked her, \"Where is Allah?\" and he affirmed her faith based on her gesture. This contradicts the proof of the intellect (دليل العقل). She knew something of God that we did not know.\n\nDespite this, we say that God is the Knower of Himself, and this is the correct view. There is no name by which the servant is named, and by which the Real is not named, that contains a description of deficiency (نعت نقص) or base character (سفساف خلق) in creation, except that both the intellect and the Real have forbidden that name to be applied to God or that character to be attributed to Him. Nevertheless, He informs of matters and distinctions that oppose the proofs of the intellects. He is the Doer of what He wills, and the Establisher in His creation of what He wills. There is no judgment over Him; He is the Judge. <<لا يُسْئَلُ عَمَّا يَفْعَلُ وهُمْ يُسْئَلُونَ>> (He is not questioned concerning what He does, but they will be questioned).\n\nWe have alerted you to a momentous matter, a great knowledge, and a profound, hidden secret (سر غامض خفي) that none knows save Allah and those of His creatures whom He informs. The intellect deems it impossible, yet revelation (نقل) has brought it, and some understandings reject it while others accept it.\n\n### The Reality of Knowing the Self and the Reality of Knowing the Lord\n\nIf you reflect upon the sections of this chapter, you will grasp the core of Divine Gnosis (المعرفة الإلهية) and realize the truth of his saying, peace and blessings be upon him: \"Whoever knows his self knows his Lord.\"\n\nI have shown you that you are the locus (محل) for every praised and blameworthy attribute. Then I informed you of the meaning of praise and blame, and I restricted you and made you absolute in that, so that you may know that you are the world (العالم) that is not known, and He, the Glorified, is the Knower (العالم) who knows and is not known.\n\nWhat the servant is upon is not known—and by the servant, I mean the entire cosmos (العالم كله) and the human—except by Allah the Exalted, who knows him. Then He informed some of His servants. Among us are those who know their selves, those who are ignorant of their selves, those who imagine they know their selves, and those who know some of what they are in themselves. By that measure, it is attributed to him that he knows something of his Lord, for: \"Whoever knows his self knows his Lord.\"\n\nJust as the proof (الدليل) and the proven (المدلول) do not coincide, you and He do not coincide in limit or reality. For He is the Creator (الخالق) and you are the created (المخلوق), even if you are a creator. He is the Owner (المالك) and you are the owned (المملوك), even if you are an owner. Do not let the sharing of characters (الأخلاق) veil you, for you are the created, and He is the Supreme Creator (الخلاق).\n\n### The Station of Character, Acquired Character, and Realization of the Divine Character\n\nThis is the station of Character (مقام الخلق) which I have clarified. Anything else the Sufis (الصوفية) refer to as acquired character (التخلق) is merely a fabrication of words. Their saying regarding the acquisition of the Names (التخلق بالأسماء) is likewise. We have used the same terminology they used, but based on verified knowledge (علم محقق) and absolute application, grounded in Divine etiquette (أدب إلهي) and realization (تحقق). Thus, in reality, it is innate character (خلق), not acquired character (تخلق), as I have made you understand.\n\nMore clarification and exposition than this, which this station demands, cannot be given. For we have not transgressed the limits of God in our expression, nor have we mentioned anything that He did not attribute to Himself. Thus, we have not departed from His speech and what He revealed to His truthful servants. <<وَهُوَ الْحَكِيمُ الْعَلِيمُ>> (And He is the Wise, the All-Knowing)—rather, He is the All-Knowing, the Wise (الْعَلِيمُ الْحَكِيمُ). He is the All-Knowing (العليم), and there is no knower (عالم). He is the Wise (الحكيم) in the ordering of the world (العالم). The Knower (العالم) and the All-Knowing (العليم) are more general, while the Wise (الحكيم) is a specific relation of Knowledge. This is the realization (التحقق) of the Divine Character (الخلق الإلهي).\n\n### The Characters that the People of the Path Need to Know\n\nAs for the characters that the people of the spiritual path (أهل السلوك) need to know—and all of us are travelers (سالك), since no end is valid—we say that custom (العرف) and the Law (الشرع) have both brought noble characters (مكارم الأخلاق) and base characters (سفساف الأخلاق), and commanded us to adopt the noble ones and avoid the base ones.\n\nFurthermore, the Law has indicated that character is of two types: that which is in the innate nature (جبلة) of the human, as the Messenger of Allah, peace and blessings be upon him, said to Al-Ashajj of the tribe of Abd al-Qays: \"Indeed, you possess two qualities that Allah and His Messenger love: forbearance (الحلم) and deliberation (الأناة).\" In another narration, not by Muslim, the man said: \"O Messenger of Allah, is it something upon which I was innately constituted (جبلت عليه)?\" He said: \"Yes.\" The man said: \"Praise be to Allah who constituted me upon them,\" or words to that effect.\n\nAnd the second type is acquired (مكتسبة). The acquired is what is expressed as acquired character (التخلق), which is the imitation of one in whom these noble characters are innate in the origin of his creation.\n\nThere is no doubt that the application of noble characters is difficult due to encountering opposition in their application within the cosmos (الكون). If the aims and wills of two individuals conflict, and each asks you to apply a noble character toward him by fulfilling his aim, and you cannot combine the two, then whenever you satisfy one, you anger the other. When combination is impossible, and universal satisfaction and the application of the noble character toward both become unfeasible, it is incumbent upon the human to step outside of his own self in that matter and make the Law (الشرع) the judge, taking it as a balance (ميزانا) and a guide (إماما) for this chapter.\n\n### The Balance and the Guide for the Journey, and in the Journey to the Guide\n\nTherefore, make your guide (إمامك) that which pleases Allah and in that which pleases Allah. And apply your noble character specifically toward Allah, for He is the Companion and the Successor (الخليفة), and He is most worthy of being treated with noble characters. Whatever Allah prioritizes, prioritize it. For that prioritization is the Real’s application of that character toward that servant and in that specific locus.\n\nThus, the application of your character toward God is more worthy than its application toward the cosmos; rather, it is obligatory, not merely more worthy. For all creation—including the angels, the Messengers, and the believers—will praise you for that action and the character with which you treated the person whom the Real prioritized and whom He obligated you to treat in that manner. None will blame you for it except the person whose aim was thwarted, if he is not a believer. And observing the origin (الأصل) is more worthy.\n\nIf you do not acquire noble characters (تتخلق بمكارم الأخلاق) according to what I have outlined for you, this station will not be valid for you, and every creature will blame you for it. Do you not see the false witness (شاهد الزور)? He is the first one to be discredited and distrusted, and even the one for whom he testified blames him inwardly, while he has angered Allah, His angels, His Messengers, and the believers.\n\nNoble characters are only those that relate to your interaction with others, and nothing else. Anything besides that is not called a noble character; rather, they are descriptions (نعوت) adopted (يتخلق بها) merely to correct the form or the relation. This is the connection of this chapter for the travelers (السالكين) and the sincere (المخلصين) to eternal felicity (سعادة الأبد).\n\nThe details of applying characters in relation to existent things (الموجودات) would be too numerous to explain, and their modalities cannot be contained in a book. Since we have given you a principle (أصلا) upon which to rely, act upon it: look to the ruling of the Law (حكم الشرع) in every movement you make concerning every existent thing, and treat it according to what the Lawgiver (الشارع) told you to treat it, whether obligatorily or commendably. Do not transgress that, and you will be praiseworthy in nature, trustworthy, honored by God, and possessor of a Divine Light (نور إلهي).\n\nIf you are an active agent through spiritual resolve (الهمة), you will satisfy all existent things (الموجودات) concerning you, since you will have disposal over the totality. This is a noble station (مقام عزيز) that is known and understood, but none of God’s creation has attained it. It is specific to the Real (الحق), and the Real does not manifest it until the people of the Fire have taken their stations and the people of Paradise have taken their stations. Then, all will be content with what they are in, through the contentment of the Real. Not one of them will desire to leave his station, and he will be joyful in it. This is a wondrous secret (سر عجيب) that we have not seen anyone among God’s creation point out, although they undoubtedly knew it. They guarded it—and God knows best—only out of protection for themselves and mercy for creation, because denial quickly rushes upon the listeners. By God, I have only alerted you to it here due to the overwhelming mercy upon me at this time. Whoever understands will be felicitous, and whoever does not understand will not be wretched due to his lack of understanding, even if he is deprived. Peace.",
    "ur": "(باب ایک سو انچاس: مقام خلق (کردار) اور اس کے اسرار کی معرفت میں)\n\nانسان میں تخلق (التخلق) اور خلق (الخلق) کا ہونا، آنکھوں میں سرمہ لگانے اور سرمے کی مانند ہے۔\n\nاگرچہ اس میں اس کا اجر دوگنا ہو جائے، تو وہ فرشتوں اور رسولوں کا مرتبہ کب حاصل کرے گا؟\n\nوہ اکیلا (وحید) ہے جس سے زمانہ زندہ ہے، پس وہی احکام اور سلطنتوں کو ترتیب دینے والا ہے۔\n\nگردنیں اس کے غلبے کے لیے اپنی عزت سے جھک جاتی ہیں، اور وہی اعراض (عارضی صفات) اور علتوں (اسباب) کو ثابت کرنے والا ہے۔\n\n### [اخلاق کی نسبت اللہ اور انسان کی طرف]\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اللہ ایسا نہیں ہے کہ تمہیں سود سے منع کرے اور پھر خود تم سے سود لے۔\" (یہ حدیث صحیح ہے)۔ پس اس نے اپنے آپ کو ہمارے ساتھ اس حکم میں شامل کیا جس سے اس نے ہمیں منع کیا۔ لہٰذا تمام اخلاق (الأخلاق) الٰہی صفات (نعوت إلهية) ہیں، وہ سب کی سب مکارم (عمدہ صفات) ہیں اور سب انسان کی جبلت (جبلۃ) میں موجود ہیں۔ اسی لیے انسان کو ان کے ذریعے مخاطب کیا گیا۔ کیونکہ بعض وہ لوگ جنہیں حقائق (الحقائق) کی معرفت (المعرفۃ) نہیں ہے، وہ کہتے ہیں کہ یہ صفات انسان میں تخلق (اکتسابی کردار) ہیں اور ذات حق (الحق) میں خلق (فطری کردار) ہیں۔ یہ بات کہنے والے کی طرف سے جہالت ہے، الا یہ کہ وہ اسے مجازاً استعمال کرے، یا اس نظر سے کہ وجود حق (وجود الحق) کو وجود عبد (وجود العبد) پر تقدم حاصل ہے، کیونکہ وہ بذات خود واجب الوجود ہے اور انسان اپنے رب کے ذریعے موجود ہے، پس اس نے وجود (الوجود) حاصل کیا اور اس سے خلق (کردار) حاصل کیا۔ اگر وہ اس اصل کو مدنظر رکھتے ہوئے تخلق (التخلق) کا قائل ہو تو اس کا مقصد صحیح ہے۔ لیکن اگر وہ تخلق سے یہ مراد لیتا ہے کہ جو صفت ذات حق کے لیے حقیقت ہے اور بندے نے اسے اختیار کیا، اگر وہ بندے کے پاس صرف اسی وقت آئی جب اس نے اسے اختیار کیا، تو اس نے اسے اسی وجہ سے تخلق کہا، نہ کہ خلق۔ اور خلق صرف وہی ہو سکتا ہے جو اس کی اصل نشوونما میں اس کی جبلت (جبلۃ) میں ڈالا گیا ہو۔ (اگر وہ یہ کہتا ہے) تو اسے انسان کی نشوونما کا کوئی علم نہیں، اور نہ ہی نبی صلی اللہ علیہ وسلم کے اس اعلان کا علم ہے کہ اللہ نے آدم کو اپنی صورت پر پیدا کیا۔ اس قائل پر یہ لازم آئے گا کہ جو صفات اس نے بندے کے لیے حقیقت قرار دی ہیں، پھر ہم دیکھتے ہیں کہ ذات حق نے بھی ان سے خود کو متصف کیا ہے، تو وہ صفات اللہ میں تخلق ہوں گی، یعنی اللہ نے ان صفات سے تخلق کیا جو انسان کا حق ہیں۔ اور یہ بات وہ شخص نہیں کہہ سکتا جس کے پاس علم کا ادنیٰ حصہ بھی ہو۔\n\n### [تمام الٰہی اخلاق انسانی جبلت میں ہیں]\n\nان الٰہی اخلاق کے بارے میں صحیح بات یہ ہے کہ یہ سب انسان کی جبلت (جبلۃ) میں موجود ہیں، اور جو شخص انہیں جانتا ہے، اسے وہ ہر انسان میں اسی طرح ظاہر ہوتی نظر آتی ہیں جس طرح وہ جناب الٰہی میں ظاہر ہوتی ہیں۔ کیونکہ ان اخلاق میں سے ہر ایک خلق کے ساتھ تمام کائنات کے ساتھ معاملہ کرنا صحیح نہیں ہے، نہ ذات حق کی طرف سے اور نہ انسان کی طرف سے۔ وہ (ذات حق) مطلق طور پر کریم ہے، اور اسی طرح انسان بھی مطلق طور پر کریم ہے۔ اور ذات حق کے مطلق طور پر کریم ہونے کے باوجود، اس کے ناموں میں سے المانع (روکنے والا)، الضار (نقصان پہنچانے والا)، اور المذی (ذلیل کرنے والا) بھی ہیں۔ وہ جسے چاہتا ہے بخشتا ہے اور جسے چاہتا ہے عذاب دیتا ہے، وہ بادشاہی دیتا ہے اور بادشاہی چھین لیتا ہے، وہ انتقام لیتا ہے اور جود و کرم کرتا ہے۔ اور قوموں کے حق میں اس تقیید کے باوجود، وہ صفت میں مطلق ہے۔ اور اسی طرح یہ صفات انسان میں بھی ہیں، یہ اس کا اصلی خلق (کردار) ہیں، نہ کہ تخلق (اکتساب)۔ اور انسان کے لیے یہ صحیح نہیں ہے کہ وہ ان اخلاق کو عام کر دے، باوجود اس کے کہ وہ اس کے حق میں مطلق ہیں، جیسا کہ اللہ کے لیے یہ صحیح نہیں تھا کہ وہ انہیں تمام مخلوق میں عام کر دے، باوجود اس کے کہ وہ ان صفات کے ساتھ مطلقاً موصوف ہے۔ اور ان صفات میں استعارہ (عارضی طور پر لینا) صحیح نہیں ہے، مگر مجازاً، جیسا کہ ہم نے کہا، اس لحاظ سے کہ اللہ تعالیٰ ان صفات کے ساتھ تھا اور ہم نہیں تھے، پھر جب ہم موجود ہوئے تو ہم ان صفات کے ساتھ موجود ہوئے، نہ یہ کہ ہم نے انہیں کمایا یا اس سے مستعار لیا۔ کیونکہ یہ اللہ کی قدیم صفت ہے، یعنی وہ نسبت جس سے ذات حق متصف ہوئی اور کوئی عالم موجود نہیں تھا۔ اور صفت کے لیے ضروری ہے کہ اس کا کوئی موصوف ہو، کیونکہ صفت کی حقیقت یہ ہے کہ وہ بذات خود قائم نہیں ہو سکتی۔ اور اس کے مستعار ہونے کا قول اسے بذات خود قائم ہونے کی طرف لے جاتا ہے، اور ذات حق کو اس سے خالی ہونے کی طرف، اور یہ کہ حادث (نئی چیز) قدیم کے وجود کے لیے محل (جگہ) بن جائے، اور یہ سب وہ باتیں ہیں جن کا قائل اللہ کے بارے میں علم رکھنے والا کوئی عالم نہیں ہے۔\n\n### [تنزيه اور تشبیہ کی صفات کے اطلاق میں بغیر ترجیح کے صحیح عقیدہ]\n\nپس انسان سے جو بھی عمدہ اخلاق (مکارم أخلاق) اور رذیل اخلاق (سفساف أخلاق) ظاہر ہوتے ہیں، وہ سب اس کی جبلت (جبلۃ) میں ہیں اور اس کے لیے حقیقت ہیں، نہ کہ مجاز یا مستعار۔ جیسا کہ وہ سبحانہ و تعالیٰ بھی، تمام وہ نام جن سے ذات حق نے خود کو موسوم کیا ہے، اور وہ صفات افعال جن سے اس نے خود کو موصوف کیا ہے، جیسے خلق (پیدا کرنا)، احیاء (زندہ کرنا)، اماتت (مارنا)، منع (روکنا)، عطاء (دینا)، جعل (بنانا)، مکر، کید، استہزاء (مذاق اڑانا)، فصل (فیصلہ کرنا)، قضاء (حکم دینا)، اور وہ سب کچھ جو نازل شدہ کتابوں میں آیا ہے اور رسولوں نے بیان کیا ہے، جیسے ضحک (ہنسنا)، فرح (خوش ہونا)، تعجب، تبشبش (خوش دلی سے ملنا)، قدم، ید (ہاتھ)، یدین (دو ہاتھ)، أید (ہاتھ)، أعین (آنکھیں)، اور ذراع (بازو) – یہ سب صحیح صفات ہیں۔ کیونکہ یہ اس کا اپنی ذات کے بارے میں کلام ہے اور اس کے رسولوں کا اس کے بارے میں کلام ہے، اور وہ سچا ہے اور وہ (رسول) عقلی دلائل کے ساتھ سچے ہیں۔ لیکن یہ سب اس حد تک ہے جو وہ جانتا ہے اور اس حد تک جو اس کی ذات قبول کرتی ہے اور جو اس کے جلال کے لائق ہے۔ ہم ان میں سے کسی چیز کا اضافہ نہیں کرتے، نہ ہی اسے باطل کرتے ہیں، نہ ہی اس کی کیفیت بیان کرتے ہیں، اور نہ ہی ہم ان سب کی نسبت اس کی طرف اس طرح کرتے ہیں جیسے ہم اپنی طرف کرتے ہیں، ہم اللہ کی پناہ مانگتے ہیں۔ کیونکہ ہم اپنی نسبت اپنی ذات کے علم کی حد تک کرتے ہیں، لہٰذا ہم جانتے ہیں کہ اس کی نسبت کیسے کرنی ہے۔ اور ذات حق اس سے بلند ہے کہ اس کی ذات کو جانا جائے، لہٰذا وہ اس سے بلند ہے کہ یہ جانا جائے کہ اس کی طرف اس چیز کی نسبت کیسے کی جائے جو اس نے خود اپنی طرف منسوب کی ہے۔ اور جس نے کسی ایسی چیز کو رد کیا جسے ذات حق نے اپنی کتاب میں یا اپنے رسول کی زبان پر اپنے لیے ثابت کیا ہے، تو اس نے اس چیز کا کفر کیا جو اللہ کی طرف سے آئی، اور اس کا بھی جو اسے لایا، اور اللہ کا بھی۔ اور جس نے ان میں سے بعض پر ایمان لایا اور بعض کو رد کیا، تو اس نے یقیناً کفر کیا۔ اور جس نے ان پر ایمان لایا اور ان کی نسبت اللہ کی طرف کرنے میں انہیں ہماری نسبت کی طرح تشبیہ دی، یا ایسا وہم کیا، یا اس کے دل میں یہ خیال آیا، یا اس نے اس کا تصور کیا، یا اسے ممکن سمجھا، تو وہ جاہل ہوا اور اس نے کفر نہیں کیا۔ یہ بغیر کسی ترجیح کے صحیح عقیدہ ہے۔\n\n### [وہ اسماء جو صرف بندے پر لاگو ہوتے ہیں، نہ کہ جناب الٰہی پر]\n\nتاہم، کچھ ایسے نام ہیں جو بندے پر لاگو ہوتے ہیں اور جناب الٰہی پر لاگو نہیں ہوتے، اگرچہ معنی میں وہ شامل ہوں۔ جیسے البخیل (کنجوس) بندے پر لاگو ہوتا ہے، لیکن ذات حق پر لاگو نہیں ہوتا، حالانکہ بخل منع کرنا ہے اور اس کے ناموں میں المانع (روکنے والا) بھی ہے۔ اور جس نے بخل کیا اس نے منع کیا۔ یہ حق ہے۔ تاہم، ہم اس کے لیے ایک توجیہ تلاش کرتے ہیں، اور وہ یہ ہے کہ ہم کہیں: ہر بخل منع ہے، لیکن ہر منع بخل نہیں ہے۔ جس نے مستحق کو اس کا حق دینے سے منع کیا، اس نے بخل کیا۔ اور ذات حق نے موسیٰ علیہ السلام کے اس قول کی تصدیق کی: **أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ** (اس نے ہر چیز کو اس کی خلقت عطا کی)۔ پس جس نے تمہیں تمہاری خلقت عطا کی اور تمہارا حق پورا کیا، اس نے تم پر بخل نہیں کیا۔ لہٰذا، جو چیز مخلوق کا حق نہیں ہے، اسے روکنا بخل کا منع نہیں ہے۔ اس حد تک ہم دونوں منع کے درمیان فرق کرتے ہیں۔ اسی طرح، اسم الکاذب (جھوٹا) بھی ان ناموں میں سے ہے جو بندے کے ساتھ خاص ہیں اور ذات حق پر لاگو نہیں ہونا چاہیے۔ وہ ہر لحاظ سے الصادق (سچا) ہے، جیسا کہ بندہ بھی صادق اور کاذب دونوں ہوتا ہے، اور ہر لحاظ سے صادق بھی ہوتا ہے۔ لیکن بندے کی طرف صدق کی نسبت ہر لحاظ سے ہمارے نزدیک معروف ہے کیونکہ ہم اپنے آپ کو جانتے ہیں، اور ذات حق کی طرف اس کی نسبت ہمارے لیے مجہول ہے۔ پس وہ الصادق ہے جیسا کہ صدق کی نسبت اس کی طرف کی جانی چاہیے۔ اور اللہ تعالیٰ نے فرمایا: **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏** (رحمن عرش پر مستوی ہوا)۔ اور فرمایا: \"ہمارا رب ہر رات آسمان دنیا پر نازل ہوتا ہے۔\" پس اس نے اپنے نزول کو زمان کے ساتھ مقید کیا، اور زمان کے ساتھ تقیید انتقال کے ساتھ تقیید ہے۔ اور یہ سب نسبت میں مجہول ہیں، لیکن حکم میں ثابت ہیں، اور اس کے جلال کے لائق ہیں۔ اسی طرح، اسم الجاہل (جاہل) کائنات کے ناموں میں سے ہے اور جناب الٰہی کے لائق نہیں ہے۔ الٰہ عالم ہے اس لحاظ سے کہ وہ علم کے ساتھ موصوف ہے، اور بندہ عالم ہے اس لحاظ سے کہ وہ علم کے ساتھ موصوف ہے، اور جاہل ہے اس لحاظ سے کہ اس کے علم کا تعلق بعض چیزوں سے خاص ہوتا ہے نہ کہ سب سے۔ اور ذات حق مطلق العلم ہے اور اس کا تعلق عام ہے۔ اور اللہ تعالیٰ نے فرمایا: **وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ** (اور ہم اس کی شہ رگ سے بھی زیادہ قریب ہیں)۔ پس اس نے خلاف معقول حد بندی کی۔ اور ایک سیاہ فام عورت نے آسمان کی طرف اشارہ کیا جب رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا: \"اللہ کہاں ہے؟\" اور آپ نے اس کے اشارے میں ایمان کو ثابت کیا۔ اور یہ عقل کے دلیل کے خلاف ہے۔ پس اس نے اللہ کے بارے میں وہ جانا جو ہم نہیں جانتے۔ اس کے باوجود، ہم کہتے ہیں کہ اللہ اپنی ذات کو جاننے والا ہے، اور یہی صحیح ہے۔ پس کوئی ایسا نام نہیں ہے جس سے بندے کو موسوم کیا گیا ہو اور ذات حق نے خود کو اس سے موسوم نہ کیا ہو، اور وہ مخلوق میں نقص کی صفت یا رذیل خلق (سفساف خلق) ہو، مگر یہ کہ عقل اور حق نے منع کیا ہے کہ وہ نام اللہ پر لاگو کیا جائے یا وہ خلق اس کی طرف منسوب کیا جائے۔ اس کے باوجود، وہ ایسے امور اور فیصلوں کی خبر دیتا ہے جو عقلی دلائل کے مقابل ہوتے ہیں۔ وہ جو چاہتا ہے کرنے والا ہے، اور اپنی مخلوق میں جو چاہتا ہے بنانے والا ہے، اس پر کوئی حکم نہیں چلتا، اور وہ حاکم ہے: **لَا يُسْئَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْئَلُونَ** (اس سے اس کے افعال کے بارے میں سوال نہیں کیا جائے گا، اور ان سے سوال کیا جائے گا)۔ اور ہم نے تمہیں ایک عظیم امر، ایک عظیم علم، اور ایک گہرے پوشیدہ راز پر متنبہ کیا ہے جسے اللہ کے سوا کوئی نہیں جانتا، اور جسے اس نے مخلوق میں سے جسے چاہا، اسے بتایا۔ عقل نے اسے محال قرار دیا، اور نقل (وحی) اس کے ساتھ آئی، اور فہم اس سے دور رہا، اور فہم نے اسے قبول کیا۔\n\n### [نفس کی معرفت کی حقیقت اور رب کی معرفت کی حقیقت]\n\nاگر تم نے اس باب کے فصول پر غور کیا تو تم معرفت الٰہیہ (المعرفۃ الإلہیۃ) کے مغز پر پہنچ جاؤ گے اور رسول اللہ صلی اللہ علیہ وسلم کے اس قول کی حقیقت کو پا لو گے: **من عرف نفسه عرف ربه** (جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا)۔\n\nاور میں نے تمہیں یہ دکھا دیا ہے کہ تم ہر محمود (قابل تعریف) اور مذموم (قابل مذمت) صفت کا محل ہو۔ پھر میں نے تمہیں حمد اور ذم کا معنی بتایا، اور تمہیں محدود کیا اور مطلق بھی کیا، تاکہ تم جانو کہ تم وہ عالم ہو جسے نہیں جانا جاتا، اور وہ سبحانہ و تعالیٰ وہ عالم ہے جو جانتا ہے اور نہیں جانا جاتا۔ پس وہ نہیں جانتا کہ بندہ کس حال پر ہے، اور بندے سے میری مراد تمام عالم اور انسان ہے، سوائے اللہ تعالیٰ کے، وہ اسے جانتا ہے۔ پھر اس نے اپنے بعض بندوں کو آگاہ کیا۔ پس ہم میں سے کچھ وہ ہیں جنہوں نے اپنے نفس کو جانا، اور ہم میں سے کچھ وہ ہیں جنہوں نے اپنے نفس سے جہالت برتی، اور ہم میں سے کچھ وہ ہیں جنہوں نے گمان کیا کہ انہوں نے اپنے نفس کو جانا، اور ہم میں سے کچھ وہ ہیں جنہوں نے اپنے نفس کے بارے میں کچھ وہ جانا جو وہ حقیقت میں ہے، اور اسی قدر کی وجہ سے اس کی طرف یہ نسبت کی جاتی ہے کہ اس نے اپنے رب کو جانا، کیونکہ: **من عرف نفسه عرف ربه** (جس نے اپنے نفس کو پہچانا، اس نے اپنے رب کو پہچانا)۔\n\nاور جس طرح دلیل اور مدلول (جس پر دلیل قائم کی گئی ہو) جمع نہیں ہو سکتے، اسی طرح تم اور وہ کسی حد یا حقیقت میں جمع نہیں ہو سکتے۔ کیونکہ وہ الخالق (پیدا کرنے والا) ہے اور تم المخلوق (پیدا کیے گئے) ہو، اگرچہ تم بھی خالق ہو۔ اور وہ المالک (مالک) ہے اور تم المملوک (ملکیت) ہو، اگرچہ تم بھی مالک ہو۔ پس اخلاق میں اشتراک تمہیں حجاب میں نہ ڈال دے، کیونکہ تم المخلوق ہو اور وہ الخلاق (بہت زیادہ پیدا کرنے والا) ہے۔\n\n### [مقام خلق، تخلق اور خلق الٰہی کے ساتھ تحقق]\n\nپس یہ مقام خلق ہے جسے میں نے واضح کر دیا ہے۔ اور اس کے علاوہ جس کی طرف صوفیاء تخلق (التخلق) سے اشارہ کرتے ہیں، وہ کلام کا ایک جوڑ توڑ (تلفیق) ہے۔ اور اسماء کے ساتھ تخلق کے بارے میں ان کا قول بھی ایسا ہی ہے۔ اور ہم نے بھی وہی اطلاق کیا ہے جو انہوں نے کیا ہے، لیکن محقق علم اور الٰہی ادب کے ساتھ مطلق اطلاق کے ذریعے، جو تحقق (تحقق) پر مبنی ہے۔ پس حقیقت میں یہ خلق ہے، نہ کہ تخلق، جیسا کہ میں نے تمہیں سمجھایا۔ اور اس وضاحت اور بیان سے زیادہ جو یہ مقام طلب کرتا ہے، وہ ممکن نہیں ہے۔ کیونکہ ہم نے اپنی عبارت میں اللہ کی حدود کو پار نہیں کیا، اور نہ ہی ہم نے کوئی ایسی چیز ذکر کی جو اس نے خود اپنی طرف منسوب نہیں کی۔ پس ہم اس کے کلام اور اس چیز سے باہر نہیں نکلے جو اس نے اپنے سچے بندوں پر نازل کی، اور **هُوَ الْحَكِيمُ الْعَلِيمُ** (اور وہ الحکیم (حکمت والا)، العلیم (جاننے والا) ہے)۔ بلکہ **هُوَ الْعَلِيمُ الْحَكِيمُ** (وہ العلیم، الحکیم ہے)۔ پس وہ العلیم ہے اور کوئی عالم نہیں، اور وہ عالم کی ترتیب میں الحکیم ہے۔ پس العالم اور العلیم زیادہ عام ہیں، اور الحکیم علم کا ایک خاص تعلق ہے۔ پس یہی خلق الٰہی کے ساتھ تحقق (التحقق) ہے۔\n\n### [وہ اخلاق جن کی معرفت اہل سلوک کو درکار ہے]\n\nاور وہ اخلاق جن کی معرفت اہل سلوک (اہل السلوک) کو درکار ہے—اور ہم سب سالک ہیں کیونکہ کوئی انتہا صحیح نہیں ہے—وہ یہ ہے کہ ہم کہیں کہ عرف (رواج) اور شرع دونوں مکارم اخلاق (عمدہ اخلاق) اور سفساف اخلاق (رذیل اخلاق) کے ساتھ وارد ہوئے ہیں، اور ہمیں ان کے مکارم کو اختیار کرنے اور ان کے سفساف سے بچنے کا حکم دیا گیا ہے۔ پھر شرع نے اس بات پر متنبہ کیا ہے کہ اخلاق دو قسم کے ہیں:\n\n۱. وہ اخلاق جو انسان کی جبلت (جبلۃ) میں ہوتے ہیں، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اشج عبد القیس سے فرمایا: \"تمہارے اندر دو خصلتیں ہیں جنہیں اللہ اور اس کا رسول پسند کرتے ہیں: حلم (بردباری) اور اناۃ (ٹھہراؤ)۔\" اور ایک دوسرے لفظ میں (جو مسلم کے علاوہ ہے) تو اس شخص نے عرض کیا: \"یا رسول اللہ! کیا یہ ایسی چیز ہے جس پر مجھے جبلت دی گئی ہے؟\" آپ نے فرمایا: \"ہاں۔\" اس نے کہا: \"الحمد للہ جس نے مجھے ان پر جبلت دی۔\" یا جیسا کہ اس نے کہا۔\n\n۲. اور ان میں سے وہ ہیں جو اکتسابی (مکتسبۃ) ہیں۔ اکتسابی وہ ہے جسے تخلق (التخلق) سے تعبیر کیا جاتا ہے، اور وہ ان لوگوں کی مشابہت اختیار کرنا ہے جن میں یہ عمدہ اخلاق ان کی اصل خلقت میں جبلتی طور پر موجود ہیں۔ اور اس میں کوئی شک نہیں کہ مکارم اخلاق کا استعمال مشکل ہے کیونکہ کائنات میں ان کے استعمال میں ضد کا سامنا کرنا پڑتا ہے۔ جب دو اشخاص کے مقاصد اور ارادے آپس میں ٹکرائیں اور ان میں سے ہر ایک تم سے یہ مطالبہ کرے کہ تم اس کے مقصد کو پورا کرنے کے لیے اس کے ساتھ کریم خلق کا برتاؤ کرو، اور تمہارے لیے ان دونوں کو جمع کرنا ممکن نہ ہو، تو تم جس کو راضی کرو گے، دوسرے کو ناراض کرو گے۔ اور جب جمع کرنا مشکل ہو جائے اور رضامندی کو عام کرنا اور ہر ایک کے ساتھ کریم خلق کا برتاؤ کرنا محال ہو جائے، تو انسان پر لازم ہے کہ وہ اس معاملے میں اپنے نفس سے باہر نکلے اور اس میں حکم شرع کو دے، اور اسے اس باب کے لیے میزان (ترازو) اور امام (رہنما) بنا لے۔\n\n### [سیر کے لیے میزان اور امام، اور امام کی طرف سیر]\n\nپس اپنے امام کو وہ بناؤ جو اللہ کو راضی کرے، اور جو اللہ کو راضی کرنے میں ہو۔ اور اپنے کریم خلق کو خاص طور پر اللہ کے ساتھ برتو۔ پس وہی صاحب (ساتھی) اور خلیفہ ہے، اور وہی زیادہ حقدار ہے کہ اس کے ساتھ مکارم اخلاق سے معاملہ کیا جائے۔ پس جس کو اللہ نے مقدم کیا، اسے مقدم کرو۔ کیونکہ یہ تقدیم (آگے کرنا) اس بندے کے ساتھ اور اس مقام پر اس خلق کے ساتھ حق کا برتاؤ ہے۔ پس اپنے خلق کا برتاؤ اللہ کے ساتھ کرنا، کائنات کے ساتھ برتاؤ کرنے سے زیادہ اولیٰ ہے، بلکہ یہ واجب ہے، اولیٰ نہیں۔ کیونکہ تمام مخلوق، فرشتوں، رسولوں اور مومنین سمیت، تمہارے اس فعل اور خلق پر تمہاری تعریف کریں گے جس کے ساتھ تم نے اس شخص سے معاملہ کیا جسے حق نے مقدم کیا اور تم پر لازم کیا کہ تم اس کے ساتھ معاملہ کرو۔ اور اس میں تمہیں صرف وہی شخص برا کہے گا جس کا وہ مقصد پورا نہ ہوا ہو، اگر وہ مومن نہ ہو۔ اور اصل کی رعایت زیادہ اولیٰ ہے۔ اور اگر تم مکارم اخلاق کے ساتھ اس طرح تخلق نہ کرو جیسا کہ میں نے تمہارے لیے بیان کیا ہے، تو تمہارے لیے یہ مقام صحیح نہیں ہو گا، اور ہر مخلوق تمہیں اس میں برا کہے گی۔ کیا تم جھوٹے گواہ کو نہیں دیکھتے؟ وہ پہلا شخص ہے جس کے نزدیک وہ مجروح ہو جاتا ہے اور اس پر اعتبار نہیں کیا جاتا، اور جس کے حق میں اس نے گواہی دی، وہ بھی باطن میں اسے برا کہتا ہے، حالانکہ اس نے اللہ، اس کے فرشتوں، اس کے رسولوں اور مومنین کو ناراض کیا ہے۔ اور مکارم اخلاق صرف وہی ہیں جن کا تعلق تمہارے غیر کے ساتھ معاملہ کرنے سے ہو، اور بس۔ اس کے علاوہ کوئی چیز مکارم خلق نہیں کہلاتی۔ بلکہ وہ صرف ایسی صفات ہیں جن سے تخلق کیا جاتا ہے تاکہ صورت یا نسبت کو صحیح کیا جا سکے، اور بس۔ سالکین (السالکین) اور مخلصین (المخلصین) کے لیے ابدی سعادت میں اس باب کا یہی ربط ہے۔ اور موجودات کے ساتھ اخلاق کے برتاؤ کی تفصیلات اگر ہم بیان کریں تو بہت زیادہ ہو جائیں گی، اور ان کی کیفیات کو کوئی کتاب احاطہ نہیں کر سکتی۔ اور جب ہم نے تمہیں اس میں ایک اصل دے دی ہے جس پر تم بھروسہ کر سکتے ہو، تو اس پر عمل کرو۔ اور وہ یہ ہے کہ تم ہر موجود کے حق میں اپنی ہر حرکت میں شرع کے حکم کو دیکھو، اور اس کے ساتھ وہی معاملہ کرو جو شارع نے تمہیں اس کے ساتھ کرنے کو کہا ہے، خواہ وجوب کے طور پر ہو یا ندب (مستحب) کے طور پر، اور اس سے تجاوز نہ کرو۔ تب تم اس میں قابل تعریف فطرت والے، امانت دار، اللہ کے نزدیک معزز، اور الٰہی نور کے حامل ہو گے۔\n\nاگر تم ہمت (الہمۃ) کے ساتھ عمل کرنے والے ہو، تو تم تمام موجودات کو اپنے سے راضی کر لو گے، کیونکہ تمہیں سب میں تصرف حاصل ہو گا۔ اور یہ ایک عزیز مقام ہے جسے جانا اور سمجھا جاتا ہے، لیکن اللہ کی مخلوق میں سے کسی نے اسے حاصل نہیں کیا۔ یہ صرف ذات حق کے ساتھ خاص ہے، اور ذات حق اسے ظاہر نہیں کرتی مگر جب اہل نار اپنے ٹھکانے اور اہل جنت اپنے ٹھکانے لے لیں گے۔ تب سب اس پر راضی ہوں گے جس میں وہ ہیں، اللہ کے راضی کرنے سے۔ پس ان میں سے کوئی بھی اپنی منزل سے نکلنا نہیں چاہے گا، اور وہ اس میں خوش ہو گا۔ اور یہ ایک عجیب راز ہے جس پر ہم نے اللہ کی مخلوق میں سے کسی کو متنبہ کرتے ہوئے نہیں دیکھا، اگرچہ انہوں نے اسے بلاشبہ جانا ہو گا۔ اور اللہ بہتر جانتا ہے، انہوں نے اسے صرف اپنے نفسوں کی حفاظت اور مخلوق پر رحم کی وجہ سے پوشیدہ رکھا، کیونکہ سننے والوں کی طرف سے انکار تیزی سے آتا ہے۔ اور اللہ کی قسم، میں نے یہاں اس پر صرف اس وقت مجھ پر غالب آنے والی رحمت کی وجہ سے متنبہ کیا ہے۔ پس جو سمجھے گا وہ کامیاب ہو گا، اور جو نہیں سمجھے گا وہ نہ سمجھنے کی وجہ سے بدبخت نہیں ہو گا، اگرچہ وہ محروم ہی کیوں نہ ہو۔ والسلام۔",
    "fa": "(باب صد و چهل و نهم در معرفت مقام خلق و اسرار آن)\n\nبودن تخلق (اكتساب اخلاق) در انسان و خلق (سرشت) *** مانند سرمه کشیدن در دو چشم و خود سرمه است.\nو اگر پاداش او در آن دو چندان شود، پس کِی *** به مرتبه فرشتگان و رسولان می‌رسد؟\nآن یگانه‌ای که زمان به او زنده است *** اوست که احکام و دولت‌ها را سامان می‌دهد.\nگردن‌ها از عزت خود برای او فرو می‌افتند *** و اوست که اعراض و علل را ثابت می‌دارد.\n\n### [نسبت اخلاق به حق و به انسان]\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «خداوند شما را از ربا نهی نمی‌کند در حالی که خود آن را از شما بگیرد.» (ما كان الله لينهاكم عن الربا ويأخذه منكم‏) و این حدیثی صحیح است. پس او خود را در حکمی که ما را از آن نهی کرده، با ما شریک ساخته است. بنابراین، اخلاق همگی صفات الهی هستند و همگی مکارم (فضائل) می‌باشند و همگی در سرشت (جبلة) انسان قرار دارند. به همین دلیل است که انسان مخاطب این اخلاق قرار گرفته است. زیرا برخی از کسانی که معرفت (معرفة) به حقایق ندارند، می‌گویند که این اخلاق در انسان «تخلق» (اكتساب) است و در حق (الحق) «خلق» (سرشت). این سخن، اگر به صورت مجازی یا با توجه به تقدم وجود حق (الحق) بر وجود بنده بیان نشده باشد، ناشی از جهل گوینده به امور است. زیرا حق (الحق) واجب الوجود بالذات است و انسان موجود به واسطه پروردگارش است، پس وجود (الوجود) را کسب کرده و خلق (سرشت) را از آن وجود به دست آورده است. اگر این اصل را در نظر بگیرد و قائل به تخلق (اكتساب اخلاق) شود، مقصودش صحیح است. اما اگر مرادش از تخلق این باشد که آنچه حقیقتاً از آنِ حق (الحق) است و بنده بدان متصف شده، نزد او جز در همان زمانی که بدان متصف شده، وجود نداشته است، و به همین دلیل آن را تخلق نامیده نه خلق (سرشت)؛ و خلق فقط آن چیزی باشد که انسان در اصل نشأت خود بر آن سرشته شده است؛ پس او نه به نشأت انسان علم دارد و نه به اعلام پیامبر (صلی الله علیه و سلم) که فرمود: «خداوند آدم را بر صورت خود آفرید.» و بر این گوینده لازم می‌آید که آنچه را از صفات، حقیقتی برای بنده قرار داده است و سپس ما حق (الحق) را متصف به آن می‌بینیم، در مورد خداوند نیز تخلق (اكتساب) باشد، یعنی خداوند با آنچه حق (الحق) انسان است، تخلق کرده باشد. و این سخنی است که هیچ کس که اندک علمی دارد، بر زبان نمی‌آورد.\n\n### [اخلاق الهی همگی در سرشت انسانی هستند]\n\nو صحیح در مورد این اخلاق الهی آن است که همگی در سرشت (جبلة) انسان قرار دارند و برای کسی که آن‌ها را می‌شناسد، در هر انسانی به همان صورتی که در جناب الهی ظاهر می‌شوند، آشکار می‌گردند. زیرا هیچ یک از این اخلاق صحیح نیست که معامله با آن شامل همه کائنات شود، نه از جانب حق (الحق) و نه از جانب انسان. حق (الحق) کریم علی‌الاطلاق است و همچنین انسان نیز کریم علی‌الاطلاق است. با وجود اینکه حق (الحق) کریم علی‌الاطلاق است، اما از اسماء او «المانع» (بازدارنده) و «الضار» (زیان‌رسان) و «المُذِی» (خوارکننده) است. او می‌آمرزد و هر که را بخواهد عذاب می‌کند، ملک می‌دهد و ملک را می‌ستاند، انتقام می‌گیرد و جود می‌ورزد. و او با وجود این تقیید در حق قومی دون قوم دیگر، صفتش مطلق است. و همین‌طور این صفات در انسان نیز خلق (سرشت) اصلی او هستند، نه تخلق (اكتساب). و صحیح نیست که این اخلاق از انسان شامل همه موجودات شود، با وجود اینکه در حق او مطلق هستند، همان‌طور که صحیح نبود که از جانب خداوند در مورد همه خلق عمومیت یابد، با وجود اینکه او تعالی در وصف به آن‌ها مطلق است. و در این صفات، استعاره صحیح نیست مگر به صورت مجاز، همان‌طور که گفتیم، از این جهت که او تعالی به این صفات متصف بود و ما نبودیم؛ پس هنگامی که ما بود شدیم، به واسطه آن‌ها بود شدیم، نه اینکه آن‌ها را کسب کرده یا از او به عاریت گرفته باشیم. زیرا این صفتی است قدیم برای خداوند، یعنی نسبتی که حق (الحق) بدان متصف شد در حالی که عالمی وجود نداشت. و صفت ناگزیر باید موصوفی داشته باشد، زیرا از حقیقت صفت این است که به خودی خود قائم نباشد. و قول به استعاره آن، منجر به این می‌شود که صفت به خودی خود قائم باشد، و حق (الحق) از آن خالی بماند، و حادث محل وجود (الوجود) قدیم در خود شود. و این‌ها همگی اموری هستند که هیچ یک از عالمان به خداوند بدان قائل نیستند.\n\n### [عقیده صحیح بدون ترجیح در اطلاق صفات تنزیه و تشبیه]\n\nپس تمام آنچه از انسان ظاهر می‌شود، از مکارم اخلاق و سفساف اخلاق (اخلاق پست)، همگی در سرشت او هستند و برای او حقیقت‌اند، نه مجاز و نه عاریت. همان‌طور که او سبحانه، تمام آنچه حق (الحق) خود را بدان نامیده و آنچه خود را بدان وصف کرده است از صفات افعال، مانند خلق، زنده کردن، میراندن، منع، عطا، قرار دادن، مکر، کید، استهزاء، فصل (جدایی) و قضا؛ و تمام آنچه در کتب نازل شده آمده و رسولان بدان سخن گفته‌اند، از خنده، شادی، تعجب، تبشبش (خوشرویی)، قدم، دست، دو دست، دست‌ها، چشم‌ها و بازو؛ همه این‌ها وصفی صحیح است. زیرا این سخن خود او تعالی درباره خویش است و سخن رسولانش درباره اوست، و او صادق است و آن‌ها نیز به دلایل عقلی صادق هستند. اما این صفات بر حدّی است که او می‌داند و بر حدّی است که ذات او می‌پذیرد و شایسته جلال اوست. ما چیزی از آن را اضافه نمی‌کنیم و آن را محال نمی‌دانیم و آن را انکار نمی‌کنیم و نمی‌گوییم که نسبت دادن همه این‌ها به او مانند نسبت دادن آن‌ها به ماست، پناه بر خدا! زیرا ما این صفات را بر حدّ علم خودمان به خودمان به او نسبت می‌دهیم، پس می‌دانیم چگونه آن را نسبت دهیم. و حق (الحق) متعالی‌تر از آن است که ذاتش شناخته شود، پس متعالی‌تر از آن است که دانسته شود چگونه باید آنچه را که خود به خویش نسبت داده، به او نسبت دهیم. و هر کس چیزی را که حق (الحق) برای خود در کتابش یا بر زبان رسولش ثابت کرده، رد کند، به آنچه از نزد خدا آمده و به آورنده آن و به خداوند کفر ورزیده است. و هر کس به برخی از آن ایمان آورد و برخی را رد کند، حقیقتاً کفر ورزیده است. و هر کس به آن ایمان آورد و در نسبت دادن آن به او تعالی، آن را مانند نسبت دادن به ما تشبیه کند، یا چنین توهمی کند، یا به دلش خطور کند، یا آن را تصور کند، یا آن را ممکن بداند، قطعاً جاهل است و کفر نورزیده است. این است عقیده صحیح بدون ترجیح.\n\n### [اسم‌هایی که فقط بر بنده اطلاق می‌شوند نه بر جناب الهی]\n\nجز اینکه اسم‌هایی وجود دارند که فقط بر بنده اطلاق می‌شوند و بر جناب الهی اطلاق نمی‌گردند، اگرچه معنای آن شامل او نیز می‌شود. مانند «بخیل» که بر بنده اطلاق می‌شود و بر حق (الحق) اطلاق نمی‌شود، در حالی که بخل منع کردن است و از اسماء او «المانع» است. و هر کس بخل ورزد، منع کرده است. این حق است. اما ما برای آن وجهی می‌جوییم و می‌گوییم: هر بخلی منع است، اما هر منعی بخل نیست. پس کسی که حقِ مستحق را منع کند، بخل ورزیده است. و حق (الحق) سخن موسی را تأیید کرد که: **أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ** (به هر چیزی خلقتش را عطا کرد.) پس کسی که خلقت تو را به تو عطا کرده و حق تو را به طور کامل داده است، بر تو بخل نورزیده است. بنابراین، منع کردن آنچه خلق استحقاقش را ندارند، منع بخل نیست. به این اندازه، ما بین دو نوع منع تفاوت قائل می‌شویم. و همچنین اسم «کاذب» (دروغگو) از اسم‌هایی است که مختص بنده است و شایسته نیست بر حق (الحق) اطلاق شود. او صادق است از هر جهت، همان‌طور که بنده نیز صادق و کاذب است و همچنین صادق از هر جهت. اما نسبت صدق به بنده از هر جهت نزد ما معلوم است، به دلیل علم ما به خودمان؛ و نسبت آن به حق (الحق) برای ما مجهول است. پس او صادق است آن‌گونه که شایسته است صدق به او نسبت داده شود. و خداوند تعالی فرمود: **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏** (رحمان بر عرش استیلا یافت). و فرمود: «پروردگار ما هر شب به آسمان دنیا فرود می‌آید.» پس فرود آمدن خود را به زمان مقید کرد، و تقیید به زمان، تقیید به انتقال است. و همه این‌ها مجهول النسبة (نسبتشان ناشناخته) و ثابت الحکم (حکمشان ثابت) و متوجه (منسوب) است آن‌گونه که شایسته جلال اوست. و همچنین اسم «جاهل» از اسماء کونی است و شایسته جناب الهی نیست. پس اله عالم است از آن جهت که به علم موصوف است، و بنده عالم است از آن جهت که به علم موصوف است، و جاهل است از آن جهت که تعلق علمش به برخی اشیاء خاص است نه همه. و حق (الحق) مطلق العلم و عام التعلق است. و خداوند تعالی فرمود: **وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ** (و ما از رگ گردن به او نزدیک‌تریم). پس حدی را تعیین کرد که خلاف معقول است. و آن زن سیاهپوست اشاره کرد که خداوند در آسمان است، هنگامی که رسول خدا (صلی الله علیه و سلم) به او فرمود: «خدا کجاست؟» و ایمان را در اشاره او ثابت دانست. و این خلاف دلیل عقل است. پس او از خداوند چیزی را شناخت که ما نشناختیم. با این حال، ما می‌گوییم که خداوند عالم به نفس خود است و این صحیح است. پس هیچ اسمی نیست که بنده بدان نامیده شود و حق (الحق) بدان نامیده نشود، و آن اسم در خلق، وصف نقص و سفساف خلق (اخلاق پست) باشد، مگر اینکه عقل و حق (الحق) منع کرده‌اند که آن اسم بر خداوند اطلاق شود یا آن خلق به او نسبت داده شود. با این وجود، او از اموری و فصولی خبر می‌دهد که در مقابل دلایل عقول قرار می‌گیرند. اوست که هر چه بخواهد انجام می‌دهد و در خلق خود هر چه بخواهد قرار می‌دهد، هیچ حکمی بر او نیست. او حاکم است: **لَا يُسْئَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْئَلُونَ** (او از آنچه می‌کند بازخواست نمی‌شود، ولی آنان بازخواست می‌شوند).\nو ما تو را بر امری جلیل و علمی عظیم و سِرّی غامض و پنهان آگاه ساختیم که جز خداوند و کسی که او از مخلوقاتش آگاه سازد، نمی‌داند؛ امری که عقل آن را محال دانسته و نقل (روایت) بدان وارد شده است، و فهمی از آن دور شده و فهمی آن را پذیرفته است.\n\n### [حقیقت معرفت نفس و حقیقت معرفت رب]\n\nاگر در فصول این باب تدبر کنی، بر مغز معرفت الهی دست می‌یابی و قول او (صلی الله علیه و سلم) را محقق می‌سازی:\n«هر کس خود را شناخت، پروردگارش را شناخت.» (من عرف نفسه عرف ربه‏)\nو من به تو نشان دادم که تو محل هر صفت ستوده و نکوهیده هستی. سپس معنای حمد و ذم را به تو آموختم و تو را محدود و مطلق ساختم تا بدانی که تو عالمی هستی که دانسته نمی‌شود، و او سبحانه عالمی است که می‌داند و دانسته نمی‌شود. پس او نمی‌داند بنده بر چه حالی است، و منظورم از بنده، تمام عالم و انسان است، مگر خداوند تعالی که او آن را می‌داند. سپس برخی از بندگانش را آگاه ساخت. پس برخی از ما خود را شناختیم و برخی خود را نشناختیم، و برخی گمان کردند که خود را شناخته‌اند، و برخی بخشی از آنچه را که در نفس خود بر آن هستند، شناختند. و به همین اندازه به او نسبت داده می‌شود که پروردگارش را شناخته است، زیرا:\n«هر کس خود را شناخت، پروردگارش را شناخت.» (من عرف نفسه عرف ربه‏)\nو همان‌طور که دلیل و مدلول با هم جمع نمی‌شوند، تو و او نیز در هیچ حد و حقیقتی با هم جمع نمی‌شوید. زیرا او خالق است و تو مخلوق، اگرچه تو نیز خالق هستی؛ و او مالک است و تو مملوک، اگرچه تو نیز مالک هستی. پس اشتراک در اخلاق تو را محجوب نسازد، زیرا تو مخلوقی و او خلاق (بسیار آفریننده) است.\n\n### [مقام خلق و تخلق و تحقق به خلق الهی]\n\nاین است مقام خلق که آن را بیان کردم. و غیر از این، آنچه صوفیه از تخلق (اكتساب اخلاق) بدان اشاره می‌کنند، تلفیقی از کلام است. و سخن آن‌ها در مورد تخلق به اسماء نیز همین‌طور است. و ما نیز مانند آن‌ها اطلاق کردیم، اما از روی علم محقق و اطلاق مطلق با ادب الهی و از روی تحقق (تحقق). پس در حقیقت، آن خلق (سرشت) است نه تخلق (اكتساب)، همان‌طور که به تو فهماندم. و بیش از این ایضاح و بیانی که این مقام می‌طلبد، وجود ندارد. زیرا ما در عبارت خود از حدود الهی تجاوز نکردیم و چیزی را ذکر نکردیم مگر آنچه را که او به خود نسبت داده است. پس از کلام او و آنچه بر بندگان صادقش نازل کرده، خارج نشدیم. و **هُوَ الْحَكِيمُ الْعَلِيمُ** (او حکیم داناست)، بلکه **هُوَ الْعَلِيمُ الْحَكِيمُ** (او دانای حکیم است). پس او علیم است و عالمی جز او نیست، و او حکیم است در ترتیب عالم. پس عالم و علیم عام‌تر هستند و حکیم تعلق خاصی از علم است. این است تحقق (تحقق) به خلق الهی.\n\n### [اخلاقی که اهل سلوک به معرفت آن نیاز دارند]\n\nاما اخلاقی که اهل سلوک به معرفت آن نیاز دارند – و همه ما سالک هستیم، زیرا نهایت (نهایت) صحیح نیست – این است که بگوییم: عرف و شرع هر دو به مکارم اخلاق و سفساف اخلاق (اخلاق پست) وارد شده‌اند و ما را به انجام مکارم و اجتناب از سفساف امر کرده‌اند. سپس شرع متذکر شده است که اخلاق بر دو قسم است:\n۱. اخلاقی که در سرشت (جبلة) انسان است، چنانکه رسول خدا (صلی الله علیه و سلم) به اَشَجّ، اَشَجّ عبدالقیس، فرمود: «در تو دو خصلت است که خداوند و رسولش آن‌ها را دوست دارند: حلم و تأنی (آرامش).» (إن فيك لخصلتين يحبهما الله ورسوله الحلم والأناة) و در لفظی دیگر برای غیر مسلم آمده است که آن مرد گفت: ای رسول خدا، آیا این چیزی است که بر آن سرشته شده‌ام؟ فرمود: «بله.» گفت: «حمد خدایی را که مرا بر آن دو سرشت.» یا چنانکه فرمود.\n۲. و اخلاقی که اکتسابی است. اکتسابی همان است که از آن به تخلق (اكتساب اخلاق) تعبیر می‌شود، و آن شبیه شدن به کسی است که این اخلاق کریمه در اصل خلقتش سرشتی (جبلية) است. و شکی نیست که به کار بردن مکارم اخلاق دشوار است، زیرا در به کار بردن آن‌ها در عالم، با ضد مواجه می‌شویم. اگر دو غرض و دو اراده از دو شخص با هم تعارض کنند و هر یک از تو بخواهد که خلق کریم را با برآورده کردن غرض او به کار ببری، و جمع کردن بین آن دو برای تو ممکن نباشد، هر که را راضی کنی، دیگری را خشمگین ساخته‌ای. و چون جمع کردن متعذر باشد و تعمیم رضایت و به کار بردن خلق کریم با هر دوی آن‌ها محال باشد، بر انسان واجب است که در این مورد از نفس خود خارج شود و حکم را به شرع واگذار کند و شرع را برای این باب، میزان و امام قرار دهد.\n\n### [میزان و امام برای سلوک و در سلوک به سوی امام]\n\nپس امام خود را آنچه خدا را راضی می‌کند و در آنچه خدا را راضی می‌کند، قرار ده. و خلق کریم خود را فقط با خداوند به کار ببر. اوست صاحب و خلیفه، و او سزاوارتر است که با مکارم اخلاق با او معامله شود. پس آنچه را خداوند مقدم داشته، تو نیز مقدم بدار. زیرا آن تقدیم، به کار بردن حق (الحق) آن خلق را با آن بنده و در آن محل است. پس به کار بردن خلق خود با خداوند، سزاوارتر از به کار بردن آن با عالم است، بلکه واجب است نه سزاوارتر. زیرا تمام خلق، از فرشتگان و رسولان و مؤمنان، تو را بر آن فعل و خلقی که با آن شخص که حق (الحق) او را مقدم داشته و بر تو واجب کرده که با او معامله کنی، ستایش می‌کنند. و در آن، تو را نکوهش نمی‌کند مگر صاحب آن غرض، اگر مؤمن نباشد. و رعایت اصل سزاوارتر است. و اگر بر اساس آنچه برایت ترسیم کردم، به مکارم اخلاق تخلق (اكتساب) نکنی، این مقام برای تو صحیح نخواهد بود. و هر مخلوقی تو را در آن نکوهش می‌کند. آیا شاهد دروغ را نمی‌بینی؟ او اولین کسی است که نزد او جرح می‌شود و به او اعتقاد نمی‌ورزد، و کسی که به نفع او شهادت داده، در باطن خود او را نکوهش می‌کند، در حالی که او خداوند و فرشتگان و رسولان و مؤمنان را خشمگین ساخته است. و مکارم اخلاق جز آن‌هایی که به معامله با غیر تو تعلق دارند، نیستند و غیر از آن، مکارم خلق نامیده نمی‌شوند، بلکه آن‌ها صفاتی هستند که برای تصحیح صورت یا نسبت، تخلق (اكتساب) می‌شوند و بس. این است پیوند این باب در سالکان و مخلصان، که سعادت ابدی است. و تفصیلات به کار بردن اخلاق با موجودات، اگر آن‌ها را بیان کنیم و کیفیت‌هایشان را شرح دهیم، بسیار زیاد است و هیچ کتابی آن‌ها را در بر نمی‌گیرد. و پس از آنکه اصلی در این باره به تو دادیم که بر آن اعتماد کنی، بدان عمل کن. و آن این است که در هر حرکت خود در حق هر موجودی، به حکم شرع بنگری و با او به گونه‌ای معامله کنی که شارع به تو گفته است، چه بر وجه وجوب یا ندب (استحباب)، و از آن تجاوز نکنی. در این صورت، تو ستوده سرشت، امین، بزرگ داشته شده نزد خداوند و صاحب نور الهی خواهی بود.\n\nاگر با همت، فعال باشی، همه موجودات را از خود راضی می‌کنی، زیرا تو در همه تصرف داری. و این مقامی عزیز است که دانسته و فهمیده می‌شود، اما هیچ یک از خلق خدا آن را به دست نیاورده است. این مقام مخصوص حق (الحق) است و حق (الحق) آن را آشکار نمی‌سازد مگر زمانی که اهل آتش جایگاه خود و اهل بهشت جایگاه خود را بگیرند و همه به رضایت حق (الحق) از آنچه در آن هستند، راضی شوند. پس هیچ یک از آن‌ها آرزو نمی‌کند که از جایگاه خود خارج شود و در آن شادمان است. و این سِرّی شگفت‌انگیز است که ندیده‌ایم هیچ یک از خلق خدا بدان توجه داده باشد، اگرچه بدون شک آن را می‌دانسته‌اند. و به خدا سوگند، آن را حفظ نکردند مگر برای حفظ خود و رحمت بر خلق، زیرا انکار از سوی شنوندگان به سرعت به آن می‌رسد. و به خدا سوگند، من در اینجا بدان توجه ندادم مگر به دلیل غلبه رحمت بر من در این زمان. پس هر که فهمید، سعادتمند شد، و هر که نفهمید، به دلیل نفهمیدن شقی نشد، اگرچه محروم ماند. و السلام."
  },
  "page_count": 4
}