{
  "id": 160,
  "title": {
    "ar": "الباب الستون ومائة في معرفة الرسالة الملكية",
    "en": "Chapter One Hundred and Sixty: Concerning the Gnosis (المعرفة) of the Angelic Mission (الرسالة الملكية)",
    "ur": "ایک سو ساٹھواں باب: رسالت ملکیہ (الرسالة الملكية) کی معرفت میں",
    "fa": "باب صد و شصتم در معرفت رسالت ملکیه (الملكية)"
  },
  "content": {
    "ar": "## (الباب الستون ومائة في معرفة الرسالة الملكية)\n\n\n> تنزلت الأملاك ليلا على قلبي *** ودارت عليه مثل دائرة القلب‏\n\n\n> حذارا من إلقاء اللعين إذا يرى *** نزول علوم الغيب عينا على قلب‏\n\n\n> وذلك حفظ الله في مثل طورنا *** وعصمته في المرسلين بلا ريب‏\n\n\n> فنحن وإياهم مصانون بالحمى *** تخاطبنا الأسماء من حضرة القرب‏\n\n\n> ويفترق الصنفان عند رجوعهم *** من المشهد الأعلى إلى عالم الترب‏\n\n\n> فيظهر هذا بالرسالة واضعا *** حدودا وأحكاما عن الروح والرب‏\n\n\n> وذلك مأمور بستر مقامه *** وإن كان قد داناه في الذوق والشرب‏\n\n\n> فسبحان من أعطى الوجود بجوده *** وقسمه قسمين للكشف والحجب‏\n\n\n> فأشهد ذا فضلا وسبق عناية *** وأوقف ذا خلف الحجاب بلا ذنب‏\n\n\n> فقف وتأدب واتعظ ثم ولا تقل *** حجبت بلا ذنب وهذا من الذنب‏\n\n\n> ألا إنما العقبي لمن بات سره *** يرى البعد والتقريب في الذنب والعتب‏\n\n\n### [سفراء الحق إلى الخلق بتنفيذ الأحكام في عالم الأركان‏]\n\n\nقال تعالى في صُحُفٍ مُكَرَّمَةٍ مَرْفُوعَةٍ مُطَهَّرَةٍ يعني التذكرة التي هي الرسالة بِأَيْدِي سَفَرَةٍ والسفرة هم الرسل من الملائكة هنا كذلك ما يجودون به على المرسلين إليهم في رسالتهم بَرَرَةٍ أي محسنين فهؤلاء هم سفراء الحق إلى الخلق بما يريد أن ينفذه فيهم من الحكم من عالم الأركان‏\n\n\n### [نزول الرسالة الملكية من مستوى أحدية الكلمة ومن حد انقسام الكلمة]\n\n\nفإذا أراد الله إنفاذ أمر في خلقه أوحى إلى الملك الأقرب إلى مقام تنفيذ الأوامر وهو الكرسي فيلقي إليه ذلك الأمر على وجوه مختلفة ثم يأمره بأن يوحي به إلى من يليه ويوحي إليه أن يوحي إلى من يليه أن يوحي به إلى من يليه من أعلى إلى أدنى إلينا هذا من حد انقسام الكلمة وأما من أحدية الكلمة فهو نزولها من رتبة زلفى إلى مقام أدنى إلى مكان أزهى إلى محل أسنى إلى رفرف أبهى إلى عرش أعلى إلى كرسي أجلي فتنقسم هناك الكلمة أي يتعين هنالك ما أريد بها من حكم أو خبر ثم تنزل إلى سدرة المنتهى إلى سماء فسماء إلى السماء الدنيا\n\n\n### [استيداع الرسالة الملكية عند ملك الماء وملائكة اللمات‏]\n\n\nفينادي بملك الماء فيودع تلك الرسالة فيضعها في الماء وينادي ملائكة اللمات وهم ملائكة القلوب فيلقنونها فيجعلها لمات في قلوب العباد فتعرف الشياطين ما جاءت به الملائكة فتأتي بأمثاله إلى قلوب الخلق فتنطق الألسنة بما تجده في القلوب وهي الخواطر قبل التكوين بأنه كان كذا واتفق كذا لما لم يكن فما يكون منه بعد الكلام به فذلك مما جاءت به الملائكة وما لم يكن فهو مما ألقته الشياطين ويسمى ذلك في العالم الإرجاف وتراه العامة مقدمات التكوين‏\n\n\n### [ملك الماء يلقى ما أوحى به إليه في الماء]\n\n\nوأما ملك الماء فيلقي ما أوحي به إليه في الماء فلا يشرب الماء حيوان إلا ويعرف ذلك السر إلا الثقلين‏\nولكن لا يعرف من أين جاء ولا كيف حصل ومن هذا المنزل هو البلاء الذي ينزل في كانون فلا يجد إناء فيه ماء غير مغطى إلا دخل فيه ومن هذا الباب ما يجده الإنسان من بغض شخص وحب شخص من غير سبب ظاهر معلوم له ويكون بالسماع وبالرؤية وورد خبر في مثل هذا\n\n\n### [السياسة الحكمية التي تنزل بها ملائكة اللمات في أزمنة الفترات‏]\n\n\nومن هذا الباب السياسة الحكمية لمصالح العالم التي لم يأت بها شرع عند فقد الأنبياء عليهم السلام وأزمنة الفترات تنزل بها ملائكة الإلهام واللمات على قلوب عقلاء الزمان وحكماء الوقت فيلقونها في أفكارهم لا على أسرارهم فيضعونها ويحملون الناس عليها والملوك وما فيها شي‏ء من الشرك فهذه هي الرسالة الملكية التي فيها مصالح العالم في الدنيا وهي البدع الحسنة التي أثنى الله على من رعاها حق رعايتها ابتغاء رضوان الله وثم رسالات أخر أيضا على أيدي الملائكة بتسخير العالم بعضه لبعض مطلقا\n\n",
    "en": "Chapter 160: Concerning the Knowledge of the Angelic Message (الرسالة الملكية)\n\nThe angels descended upon my heart by night,\nAnd circled it like the circumference of the heart.\n\nGuarding against the casting of the Accursed One when he sees\nThe descent of the sciences of the Unseen directly upon the heart.\n\nThat is the preservation of Allah in a state like ours,\nAnd His infallibility (عصمته) in the Messengers, without doubt.\n\nThus, we and they are protected within the sanctuary,\nThe Names address us from the Presence of Nearness (حضرة القرب).\n\nThe two groups separate when they return\nFrom the Highest Station of Witnessing (المشهد الأعلى) to the world of dust (عالم الترب).\n\nThen this one appears with the Message, establishing\nLimits and rulings concerning the Spirit and the Lord.\n\nAnd that one is commanded to conceal his station,\nEven though he has drawn near to Him in spiritual Taste (الذوق) and Intake (الشرب).\n\nGlory be to Him who gave Existence (الوجود) through His generosity,\nAnd divided it into two parts: for Unveiling (الكشف) and for Veiling (الحجب).\n\nSo He grants this one favor and precedence of care,\nAnd causes that one to stand behind the veil without fault.\n\nSo stop, be courteous, take heed, and do not say,\n\"I was veiled without fault,\" for this itself is a fault.\n\nIndeed, the ultimate reward belongs only to him whose secret heart\nSees distance and nearness in both sin (الذنب) and blame (العتب).\n\n### [The Ambassadors of the Real (الحق) to Creation (الخلق) for the Execution of Rulings in the World of Elements (عالم الأركان)]\n\nAllah the Exalted said: <<In honored scriptures, exalted, purified,>> (meaning the reminder, which is the Message) <<in the hands of scribes (سفرة)>>. The *Safarata* (scribes/ambassadors) here are the Messengers among the angels, just as they bestow generously upon those to whom they are sent in their message, <<righteous (بررة)>>—meaning, benevolent ones. These, then, are the ambassadors of the Real (الحق) to Creation (الخلق) concerning the decree He wishes to execute among them from the World of Elements (عالم الأركان).\n\n### [The Descent of the Angelic Message (الرسالة الملكية) from the Level of the Oneness of the Word (أحدية الكلمة) and from the Limit of the Division of the Word]\n\nWhen Allah desires to execute a command among His creation, He reveals it to the angel closest to the station of executing commands, which is the Pedestal (الكرسي). He casts that command to him in various forms, then commands him to reveal it to the one below him, and reveals to that one to reveal it to the one below him, and so on, from the highest to the lowest, down to us. This is from the limit of the division of the Word. As for the descent from the Oneness of the Word (أحدية الكلمة), it is its descent from a rank of proximity (رتبة زلفى) to a lower station (مقام أدنى), to a more radiant place (مكان أزهى), to a loftier abode (محل أسنى), to a more glorious cushion (رفرف أبهى), to a higher Throne (عرش أعلى), to a more manifest Pedestal (كرسي أجلي). There, the Word divides—meaning, the decree or information intended by it becomes specified—then it descends to the Lote-Tree of the Utmost Boundary (سدرة المنتهى), then from heaven to heaven, down to the lowest heaven.\n\n### [The Entrusting of the Angelic Message (الرسالة الملكية) to the Angel of Water and the Angels of Intuitions (ملائكة اللمات)]\n\nThen the Angel of Water is called, and that Message is entrusted to him, so he places it in the water. And the Angels of Intuitions (ملائكة اللمات)—who are the angels of the hearts—are called, and they are taught the Message, which they then make into intuitions (لمات) in the hearts of the servants. The devils recognize what the angels have brought, so they bring similar things to the hearts of creation. The tongues then speak what they find in the hearts—these are the thoughts (الخواطر) before the actualization—saying that such-and-such was, or such-and-such happened, when it had not yet occurred. Whatever of this comes into being after being spoken, that is from what the angels brought. But whatever does not come into being is from what the devils cast. This is called *al-Irjaf* (spreading rumors/false news) in the world, and the common people see it as the preliminaries of actualization (مقدمات التكوين).\n\n### [The Angel of Water Casts What Was Revealed to Him into the Water]\n\nAs for the Angel of Water, he casts what was revealed to him into the water. No living creature drinks that water without knowing that secret, except for the two weighty ones (الثقلين: humans and jinn). However, they do not know where it came from or how it was obtained. From this station comes the affliction (البلاء) that descends in the month of Kanun (December/January), such that it enters any uncovered vessel containing water. Also from this chapter is the feeling a person finds of hating someone or loving someone without any apparent, known reason, which occurs through hearing or seeing. A report has been transmitted concerning this matter.\n\n### [The Wise Governance (السياسة الحكمية) Brought Down by the Angels of Intuitions (ملائكة اللمات) During Periods of Intermission (أزمنة الفترات)]\n\nAlso from this chapter is the wise governance (السياسة الحكمية) for the welfare of the world, which was not brought by revealed law (شرع) during the absence of the Prophets (peace be upon them) and during periods of intermission (أزمنة الفترات). The Angels of Inspiration (ملائكة الإلهام) and Intuitions (اللمات) descend with it upon the hearts of the wise men of the age and the sages of the time. They cast these matters into their thoughts—not into their innermost secrets (أسرارهم)—and they establish them and impose them upon the people and the kings, provided they contain nothing of polytheism (الشرك). This is the Angelic Message (الرسالة الملكية) that contains the welfare of the world in this life. These are the praiseworthy innovations (البدع الحسنة) that Allah praised those who upheld them properly, seeking Allah’s pleasure. Furthermore, there are other messages also carried by the angels concerning the absolute subjugation of one part of the cosmos to another.",
    "ur": "(باب ایک سو ساٹھ: ملکی رسالت (الرسالة الملكية) کی معرفت میں)\n\nرات کو ملائکہ میرے قلب پر نازل ہوئے\nاور اس کے گرد دل کے دائرے کی طرح گھومتے رہے\n\nاس لعین (شیطان) کے القاء سے بچنے کے لیے جب وہ\nغیب کے علوم کا عین قلب پر نزول دیکھتا ہے\n\nاور یہ ہمارے جیسے مقام پر اللہ کی حفاظت ہے\nاور رسولوں میں بلا شبہ اس کی عصمت ہے\n\nپس ہم اور وہ (رسول) دونوں اس پناہ گاہ میں محفوظ ہیں\nاسماء (الٰہیہ) ہم سے حضرۃ القرب (قرب کی بارگاہ) سے ہم کلام ہوتے ہیں\n\nاور دونوں گروہ اس وقت جدا ہو جاتے ہیں جب وہ\nمشہد اعلیٰ سے عالم تراب (مٹی کے عالم) کی طرف لوٹتے ہیں\n\nپس یہ (رسول) رسالت کے ساتھ ظاہر ہوتا ہے، جو\nروح اور رب کی طرف سے حدود اور احکام مقرر کرتا ہے\n\nاور وہ (ولی) اپنے مقام کو چھپانے کا حکم دیا گیا ہے\nاگرچہ وہ ذوق اور شرب (باطنی تجربہ) میں اس کے قریب ہو\n\nپس پاک ہے وہ ذات جس نے اپنے جود سے الوجود (ہستی) عطا کی\nاور اسے کشف (الکشف) اور حجابات (الحجب) کے لیے دو حصوں میں تقسیم کیا\n\nپس اس (رسول) کو فضل اور سبقتِ عنایت کا مشاہدہ کرایا\nاور اس (ولی) کو بغیر کسی گناہ کے حجاب کے پیچھے ٹھہرا دیا\n\nپس ٹھہر جا، ادب کر، نصیحت حاصل کر، اور پھر یہ نہ کہہ\nکہ مجھے بغیر گناہ کے حجاب میں رکھا گیا، کیونکہ یہی گناہ ہے\n\nخبردار! انجام تو اس شخص کے لیے ہے جس کا باطن\nدوری اور قربت کو گناہ اور عتاب میں دیکھتا ہے\n\n### [عالم ارکان میں احکام کے نفاذ کے لیے ذات حق (الحق) کے مخلوق کی طرف سفیر]\n\nاللہ تعالیٰ نے فرمایا: \"صُحُفٍ مُكَرَّمَةٍ (عزت والے صحیفوں میں) مَرْفُوعَةٍ مُطَهَّرَةٍ (جو بلند اور پاک ہیں)\" یعنی وہ تذکرہ جو رسالت ہے، \"بِأَيْدِي سَفَرَةٍ (سفیروں کے ہاتھوں میں)\" اور یہاں سفیر سے مراد ملائکہ میں سے رسول ہیں، اسی طرح جو کچھ وہ ان رسولوں پر اپنی رسالت میں جود و کرم کرتے ہیں، وہ \"بَرَرَةٍ (نیکوکار)\" یعنی احسان کرنے والے ہیں۔ پس یہ (ملائکہ) عالم ارکان سے ان احکام کو نافذ کرنے کے لیے ذات حق (الحق) کے مخلوق کی طرف سفیر ہیں جنہیں وہ ان میں نافذ کرنا چاہتا ہے۔\n\n### [ملکی رسالت کا نزول احدیۃ الکلمہ کے مقام سے اور انقسام الکلمہ کی حد سے]\n\nپس جب اللہ تعالیٰ اپنی مخلوق میں کسی امر کو نافذ کرنا چاہتا ہے تو وہ اس ملک کی طرف وحی کرتا ہے جو اوامر کے نفاذ کے مقام سے سب سے زیادہ قریب ہے، اور وہ کرسی (الکرسی) ہے۔ پس وہ اس امر کو مختلف صورتوں میں اس پر القاء کرتا ہے، پھر اسے حکم دیتا ہے کہ وہ اپنے سے نچلے کو وحی کرے، اور اسے وحی کرتا ہے کہ وہ اپنے سے نچلے کو وحی کرے، اور اسے وحی کرتا ہے کہ وہ اپنے سے نچلے کو وحی کرے، اس طرح اعلیٰ سے ادنیٰ کی طرف ہم تک پہنچتا ہے۔ یہ انقسام الکلمہ (کلمہ کے تقسیم ہونے) کی حد سے ہے۔ اور جہاں تک احدیۃ الکلمہ (کلمہ کی احدیت) کا تعلق ہے، تو یہ اس کا نزول ہے رتبہ زلفیٰ سے ایک ادنیٰ مقام کی طرف، ایک زیادہ روشن جگہ کی طرف، ایک بلند تر محل کی طرف، ایک زیادہ شاندار رفرف کی طرف، ایک اعلیٰ عرش کی طرف، ایک زیادہ جلیل کرسی (الکرسی) کی طرف۔ پس وہاں کلمہ تقسیم ہو جاتا ہے، یعنی وہاں وہ حکم یا خبر متعین ہو جاتی ہے جو اس سے مراد لی گئی تھی، پھر وہ سدرۃ المنتہیٰ کی طرف، پھر ایک آسمان سے دوسرے آسمان کی طرف، یہاں تک کہ آسمان دنیا کی طرف نازل ہوتی ہے۔\n\n### [ملکی رسالت کا ملک الماء اور ملائکہ اللمات کے پاس امانت رکھا جانا]\n\nپس ملک الماء (پانی کے فرشتے) کو پکارا جاتا ہے اور وہ رسالت اس کے پاس امانت رکھ دی جاتی ہے، پس وہ اسے پانی میں رکھ دیتا ہے۔ اور ملائکہ اللمات (لمّات کے فرشتوں) کو پکارا جاتا ہے، اور وہ دلوں کے فرشتے ہیں، پس وہ اسے تلقین کرتے ہیں اور اسے بندوں کے دلوں میں لمّات (خیالات) بنا دیتے ہیں۔ پس شیاطین جان لیتے ہیں کہ ملائکہ کیا لائے ہیں، اور وہ اس کی مثالیں مخلوق کے دلوں میں لے آتے ہیں۔ پس زبانیں اس چیز کے ساتھ بولتی ہیں جو وہ دلوں میں پاتی ہیں، اور یہ تکوین (وجود میں آنے) سے پہلے کے خواطر (خیالات) ہوتے ہیں کہ ایسا تھا اور ایسا ہوا، حالانکہ وہ چیز ابھی وجود میں نہیں آئی ہوتی۔ پس جو چیز اس کے بارے میں بات کرنے کے بعد وجود میں آتی ہے، وہ ملائکہ کی لائی ہوئی چیزوں میں سے ہے، اور جو وجود میں نہیں آتی، وہ شیاطین کے القاء کردہ چیزوں میں سے ہے۔ اور اس کو عالم میں \"ارجاف\" (افواہ سازی) کہا جاتا ہے، اور عام لوگ اسے تکوین کی مقدمات سمجھتے ہیں۔\n\n### [ملک الماء اس چیز کو پانی میں ڈال دیتا ہے جو اس کی طرف وحی کی گئی]\n\nاور جہاں تک ملک الماء کا تعلق ہے، وہ اس چیز کو پانی میں ڈال دیتا ہے جو اس کی طرف وحی کی گئی، پس کوئی بھی جاندار اس پانی کو نہیں پیتا مگر وہ اس راز کو جان لیتا ہے، سوائے ثقلین (جن و انس) کے۔ لیکن وہ یہ نہیں جانتا کہ یہ کہاں سے آیا اور کیسے حاصل ہوا۔ اور اسی منزل سے وہ بلاء (آفت) ہے جو کانون (دسمبر/جنوری) میں نازل ہوتی ہے، پس وہ کوئی ایسا برتن نہیں پاتی جس میں پانی ہو اور وہ ڈھکا ہوا نہ ہو، مگر اس میں داخل ہو جاتی ہے۔ اور اسی باب سے وہ چیز ہے جو انسان کسی شخص سے بغض یا محبت کی صورت میں پاتا ہے، بغیر کسی ظاہری معلوم سبب کے، اور یہ سماعت اور رؤیت (دیکھنے) سے ہوتا ہے، اور اس طرح کی چیز کے بارے میں خبر وارد ہوئی ہے۔\n\n### [حکمی سیاست جو ملائکہ اللمات فترت کے زمانوں میں نازل کرتے ہیں]\n\nاور اسی باب سے وہ حکمی سیاست ہے جو عالم کی مصلحتوں کے لیے ہے، جو انبیاء علیہم السلام کے فقدان اور فترت کے زمانوں میں شریعت میں نہیں آئی۔ اسے ملائکہ الہام اور لمّات (ملائکہ اللمات) وقت کے عقلمندوں اور حکماء کے دلوں پر نازل کرتے ہیں، پس وہ اسے ان کے افکار میں القاء کرتے ہیں نہ کہ ان کے اسرار میں۔ پس وہ اسے وضع کرتے ہیں اور لوگوں اور بادشاہوں کو اس پر عمل کراتے ہیں، اور اس میں شرک کا کوئی شے نہیں ہوتا۔ پس یہ وہ ملکی رسالت (الرسالة الملكية) ہے جس میں دنیا میں عالم کی مصلحتیں ہیں، اور یہ وہ بدعات حسنہ ہیں جن کی اللہ نے ان لوگوں کی تعریف کی ہے جنہوں نے رضائے الٰہی کی طلب میں ان کی کما حقہ رعایت کی۔ اور پھر ملائکہ کے ہاتھوں پر دیگر رسالتیں بھی ہیں جو مطلقاً عالم کے بعض کو بعض کے لیے مسخر کرنے سے متعلق ہیں۔",
    "fa": "(باب صد و شصتم در معرفت رسالت ملکوتی)\n\nفرشتگان شبانه بر قلبم فرود آمدند *** و گرد آن چرخیدند، همچون دایره قلب.\n\nاز بیم آنکه آن لعین (شیطان) ببیند *** نزول علوم غیب را عیناً بر قلب،\n\nو این است حفظ الهی در مرتبه ما *** و عصمت او در پیامبران، بی‌هیچ تردیدی.\n\nپس ما و ایشان در پناهگاه (حمى) محفوظیم *** اسماء (الهی) از حضرت قرب با ما سخن می‌گویند.\n\nو این دو گروه (ما و پیامبران) هنگام بازگشتشان *** از مشهد اعلی به عالم خاک (عالم الترب) جدا می‌شوند.\n\nپس این (پیامبر) با رسالت آشکار می‌شود، در حالی که *** حدود و احکامی را از جانب روح و پروردگار وضع می‌کند.\n\nو آن (ولی/عارف) مأمور به پوشاندن مقام خویش است *** هرچند در ذوق و شرب (تجربه عرفانی) به او نزدیک شده باشد.\n\nپس منزه است آنکه هستی (الوجود) را با جود خویش عطا کرد *** و آن را دو بخش نمود: برای کشف (الکشف) و حجاب.\n\nپس این یکی را شاهد فضل و سبقت عنایت قرار داد *** و آن دیگری را پشت حجاب متوقف ساخت، بی‌آنکه گناهی داشته باشد.\n\nپس بایست و ادب نگه دار و پند گیر، و هرگز مگو *** «بی‌گناه محجوب شدم»، که این خود از گناه است.\n\nآگاه باش! همانا عاقبت نیکو از آن کسی است که سرّش *** دوری و نزدیکی را در گناه و عتاب می‌بیند.\n\n### [سفیران حق (الحق) به سوی خلق برای اجرای احکام در عالم ارکان (عالم الأركان)]\n\nخداوند متعال می‌فرماید: «در صحیفه‌هایی گرامی، بلندمرتبه و پاکیزه (صُحُفٍ مُكَرَّمَةٍ مَرْفُوعَةٍ مُطَهَّرَةٍ)»؛ یعنی تذکره‌ای که همان رسالت است، «به دست سفیرانی (بِأَيْدِي سَفَرَةٍ)»؛ و سفیران (السفرة) در اینجا همان فرستادگان از فرشتگان هستند، همچنین آنچه را که بر رسولانِ مأمور به رسالت خویش، جود می‌کنند، «نیکوکارند (بَرَرَةٍ)»؛ یعنی احسان‌کنندگان. پس اینان سفیران حق (الحق) به سوی خلق هستند، با آنچه او می‌خواهد از حکم در عالم ارکان (عالم الأركان) در میان ایشان اجرا کند.\n\n### [نزول رسالت ملکوتی (الرسالة الملكية) از سطح احدیت کلمه و از مرز انقسام کلمه]\n\nپس هرگاه خداوند بخواهد امری را در خلق خویش اجرا کند، به نزدیک‌ترین فرشته به مقام اجرای اوامر، که همان کرسی است، وحی می‌کند. آن فرشته آن امر را به وجوه مختلف به کرسی القا می‌کند، سپس به او فرمان می‌دهد که به فرشته‌ای که در پی اوست وحی کند، و به او وحی می‌کند که به فرشته‌ای که در پی اوست وحی کند، و همین‌طور از بالا به پایین تا به ما برسد. این از مرز انقسام کلمه است. اما از احدیت کلمه، نزول آن از مرتبه زلفی (نزدیکی) به مقامی پایین‌تر، به مکانی درخشان‌تر، به محلی والاتر، به رفرفی زیباتر، به عرشی بالاتر، به کرسی‌ای جلیل‌تر است. پس کلمه در آنجا منقسم می‌شود؛ یعنی آنچه از حکم یا خبر که با آن اراده شده، در آنجا معین می‌گردد. سپس به سدرة المنتهی، به آسمانی پس از آسمانی دیگر، تا به آسمان دنیا فرود می‌آید.\n\n### [به ودیعه نهادن رسالت ملکوتی (الرسالة الملكية) نزد فرشته آب و فرشتگان لَمّات (ملائكة اللمات)]\n\nپس فرشته آب (ملك الماء) ندا داده می‌شود و آن رسالت به او سپرده می‌شود، و او آن را در آب قرار می‌دهد. و فرشتگان لَمّات (ملائكة اللمات) ندا داده می‌شوند، که همان فرشتگان قلب‌ها هستند، پس آن را تلقی می‌کنند و به صورت لَمّات (الهامات) در قلب‌های بندگان قرار می‌دهند. شیاطین آنچه را که فرشتگان آورده‌اند می‌شناسند، پس نظایر آن را به قلب‌های خلق می‌آورند. آنگاه زبان‌ها به آنچه در قلب‌ها می‌یابند، که همان خواطر (افکار) پیش از تکوین (تحقق) است، گویا می‌شوند که چنین خواهد شد و چنان اتفاق خواهد افتاد، در حالی که هنوز وجود نیافته است. پس آنچه پس از سخن گفتن محقق می‌شود، از آن چیزی است که فرشتگان آورده‌اند؛ و آنچه محقق نمی‌شود، از القائات شیاطین است. این در عالم، «ارجاف» نامیده می‌شود و عوام آن را مقدمات تکوین می‌دانند.\n\n### [فرشته آب (ملك الماء) آنچه را که به او وحی شده در آب می‌اندازد]\n\nو اما فرشته آب (ملك الماء)، آنچه را که به او وحی شده در آب می‌اندازد. پس هیچ حیوانی از آن آب نمی‌نوشد مگر آنکه آن سرّ را می‌شناسد، جز ثقلین (جن و انس). اما نمی‌داند که از کجا آمده و چگونه حاصل شده است. و از این منزل است بلایی که در ماه کانون (دی/ژانویه) نازل می‌شود، پس هیچ ظرف آب بدون پوششی را نمی‌یابد مگر آنکه وارد آن می‌شود. و از این باب است آنچه انسان از بغض یا محبت نسبت به شخصی می‌یابد، بدون هیچ سبب ظاهری معلومی برای او، و این امر با شنیدن و دیدن حاصل می‌شود، و در این باره خبری (حدیثی) وارد شده است.\n\n### [سیاست حکمی (السياسة الحكمية) که فرشتگان لَمّات (ملائكة اللمات) در زمان‌های فترت (فترات) با آن نازل می‌شوند]\n\nو از این باب است سیاست حکمی (السياسة الحكمية) برای مصالح عالم که شریعتی آن را نیاورده است، در زمان فقدان پیامبران (علیهم السلام) و دوران‌های فترت (فترات). فرشتگان الهام و لَمّات (ملائكة اللمات) با آن بر قلب‌های خردمندان زمان و حکیمان وقت نازل می‌شوند، پس آن را در افکارشان القا می‌کنند، نه بر اسرارشان. سپس آن را وضع می‌کنند و مردم و پادشاهان را بر آن وادار می‌سازند، و در آن هیچ‌گونه شرکی نیست. پس این همان رسالت ملکوتی (الرسالة الملكية) است که مصالح عالم در دنیا در آن نهفته است، و آن همان بدعت‌های نیکویی (البدع الحسنة) است که خداوند بر کسی که حق رعایت آن را به جا آورد، در طلب رضوان الهی، ثنا گفته است. و همچنین رسالت‌های دیگری نیز به دست فرشتگان وجود دارد که به تسخیر مطلق برخی از اجزای عالم برای برخی دیگر مربوط می‌شود."
  },
  "page_count": 2
}