{
  "id": 136,
  "title": {
    "ar": "الباب السادس والثلاثون ومائة في معرفة مقام الصدق وأسراره",
    "en": "Chapter 136: On the Knowledge of the Station of Veracity (مقام الصدق) and its Mysteries.",
    "ur": "باب ایک سو چھتیس: مقام صدق اور اس کے اسرار کی معرفت کا بیان۔",
    "fa": "باب صد و سی و ششم در معرفت مقام صدق و اسرار آن"
  },
  "content": {
    "ar": "### (الباب السادس والثلاثون ومائة في معرفة مقام الصدق وأسراره)\n\n\n> الصدق سيف الله في أرضه *** فاصدق ترى الصادق من عرضه‏\n\n\n> فإن أتى الدجال فاضرب به *** هامته بالحد من عرضه‏\n\n\n> فالسيف محصور بحديه في *** نفل من الفعل وفي فرضه‏\n\n\n> ولا تقل هذا محال فقد *** يفرضه الفارض في فرضه‏\n\n\n> فكم غنى يظهر الفقر إذ *** يستقرض المسكين من قرضه‏\n\n\n### [الصادق المتحقق بالصدق له الفعل بالهمة]\n\n\nالصدق شدة وصلابة في الدين والغيرة لله من أحواله ولصاحبه المتحقق به الفعل بالهمة وهو قوة الايمان قيل لأبي يزيد ما اسم الله الأعظم الذي به تنفعل الأشياء فقال أروني الأصغر حتى أريكم الأعظم ما هو إلا الصدق أصدق وخذ أي اسم شئت أسماء الله كلها عظيمة قال تعالى والَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ أي أصدق حبا لله من حب المشركين لمن جعلوهم شركاء والصادق من أسمائه وقال تعالى لِيَسْئَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ ولهذا له الدعوى‏\n\n\n### [الصدق الذي هو نعت إلهى قائم بالصادق وهو له ذائق‏]\n\n\nفلا يكون الصادق صادقا ما لم يقم الصدق به فإذا قام به كان له ذوقا وكان كونه صادقا حال صدقه وهو قد تسمى بالصادق فلهذا يسألهم هل صدقهم هو النعت الإلهي الذي به تسمى الله بالصادق أم لا فإن كان هو طالبهم بأن يقوموا بأحكامه قيامه فلا يغلبهم شي‏ء ولا يقاومهم في حال صدقهم فيكون الله صدقهم كما كان سمعهم وبصرهم النسبة واحدة فإن لم يحكموا هذا المقام ولا وجدوا منه هذه الحال فما هو هذا الصدق الذي هو النعت الإلهي بل هو أمر ظهر بصورة الصدق ظهور الشبهة بصورة الدليل وكما لا وجه للشبهة لا حقيقة لهذا الصدق وهذا معنى قول الله هذا يَوْمُ يَنْفَعُ الصَّادِقِينَ صِدْقُهُمْ فلا يؤثر فيهم عوارض يوم القيامة بل تخاف الناس ولا يخافون وتحزن الناس ولا يحزنون وقال في حق طائفة فَلَوْ صَدَقُوا الله لَكانَ خَيْراً لَهُمْ هذا حكمه في النطق فكيف في جميع الأحوال‏\n\n\n### [الصدق الذي هو حال والصدق الذي هو مقام‏]\n\n\nوالصدق إذا جاء من خارج جاء بغير صورته فإنه ظهر في مادة إمكانية فلم يؤثر أثرا في كل من جاء إليه فإن كان في المحل صدق الايمان ميزه وعرفه في المادة التي ظهر فيها فقبله وعمل بمقتضاه فكان نورا على نور لِيَزْدادُوا إِيماناً مَعَ إِيمانِهِمْ كما زاد من ليست له حالة الصدق رجسا إلى رجسهم والصدق بذاته مؤثر حيث ظهر عينه ظهر حكمه ومن ليست له هذه الحال المؤثرة في الوقت فهو غائب عن صدقه في ذلك الوقت ولا بد ويدعيه من مكان بعيد فالصدق من حيث تعلقه بالكون هو حال ومن حيث تعلقه من الصادق بالله هو مقام فمن حيث هو مقام لا يكون عنه أثر فإن تعلقه بالله والله ليس بمحل لتأثر الأكوان فيكون صاحبه صادق التوجه إلى الله فإن ظهر عمن‏\nهذه صفته أثر في الكون فعن غير تعمل ولا قصد إنما ذلك إلى الله يجريه على لسانه أو يده ولا علم له به فإن أثر على علم وادعى أنه صادق مع الله فهو إما جاهل بالأمر وإما كاذب وهذا ليس من صفة أهل الله فحال الصدق يناقض مقامه ومقامه أعلى من حاله في الخصوص وحاله أشهر وأعلى في العموم‏\n\n\n### [الشيخ عبد القادر كان له حال الصدق وتلميذه الشيخ أبو السعود بن الشبل كان له مقام الصدق‏]\n\n\nوكان للإمام عبد القادر على ما ينقل إلينا من أحواله حال الصدق لا مقامه وصاحب الحال له الشطح وكذلك كان رضي الله عنه وكان للإمام أبي السعود بن الشبلي تلميذ عبد القادر مقام الصدق لا حاله فكان في العالم مجهولا لا يعرف ونكرة لا تتعرف نقيض عبد القادر عجزا محققا لتمكنه في مقام الصدق مع الله كما كان عبد القادر محققا متمكنا في حال الصدق فرضي الله عنهما فما سمعنا في زماننا من كان مثل عبد القادر في حال الصدق ولا مثل أبي السعود في مقام الصدق‏\n\n\n### [الصدق الذي لأهل الله والصدق الذي هو في معلوم الناس‏]\n\n\nفالصدق الذي هو نعت إلهي لا يكون إلا لأهل الله والصدق الذي في معلوم الناس سار في كل صادق من مؤمن وكافر وهذا الصدق للصدق الإلهي كالظل للشخص فهو ظله ولهذا يظهر أثره في كل صادق من كل ملة ولو لم يكن ظلا له ما صح عنه أثر فاجعل بالك لما أشرنا إليه وبسطناه فالناس عنه في عماية وعن أمثاله من المقامات والأحوال‏\n\n\n> فلو لا الصدق ما كان الوجود *** ولولاه لما كان الشهود\n\n",
    "en": "### Chapter 136: On the Knowledge of the Station of Truthfulness (مقام الصدق) and its Secrets\n\nTruthfulness is the Sword of Allah upon His earth,\nSo be truthful, and you will see the Truthful One from its breadth.\n\nIf the Dajjal (Antichrist) comes, strike with it\nHis crown with the edge of its breadth.\n\nFor the sword is confined by its two edges\nIn a supererogatory act (نفل) and in an obligatory act (فرض).\n\nAnd do not say this is impossible, for\nThe Imposer may impose it in His imposition.\n\nHow many a rich person displays poverty\nWhen the needy borrows from his loan.\n\n### [The Truthful One (الصادق) Realized in Truthfulness has the Act through Spiritual Resolve (الهمة)]\n\nTruthfulness (الصدق) is intensity and firmness in the Religion, and zeal for Allah is among its states. The one who is realized (المتحقق) in it possesses the power of action through Spiritual Resolve (الهمة), which is the strength of faith.\n\nAbu Yazid was asked, \"What is the Greatest Name of Allah (الاسم الأعظم) by which things are brought into being?\" He replied, \"Show me the lesser name, and I will show you the Greater Name. It is nothing but Truthfulness. Be truthful, and take any Name you wish; all the Names of Allah are Great.\"\n\nAllah the Exalted said: <<وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ>> (And those who believe are stronger in love for Allah). Meaning, they are more truthful in their love for Allah than the love the polytheists have for those they associate as partners. The Truthful One (الصادق) is one of His Names. And Allah the Exalted said: <<لِيَسْئَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ>> (That He may question the truthful about their truthfulness). For this reason, the truthful one has the claim.\n\n### [Truthfulness (الصدق) which is a Divine Attribute (نعت إلهي) subsisting in the Truthful One, and he is its Taster (ذائق)]\n\nThe truthful person (الصادق) is not truly truthful unless Truthfulness subsists in him. If it subsists in him, he has a direct experience (ذوق) of it, and his being truthful is the state of his truthfulness. Since he is named \"The Truthful One,\" He questions them: Is their truthfulness the Divine Attribute by which Allah is named The Truthful One, or not?\n\nIf it is, He demands that they uphold its rulings as He upholds them. Then nothing will overcome them, nor will anything resist them in the state of their truthfulness. Thus, Allah becomes their truthfulness, just as He becomes their hearing and their sight—the relationship is one and the same.\n\nIf they do not master this Station (المقام) and do not find this State (الحال) within themselves, then this is not the Truthfulness which is the Divine Attribute. Rather, it is an affair that appeared in the form of truthfulness, like the appearance of a specious argument in the form of a proof. Just as the specious argument has no substance, this truthfulness has no reality (حقيقة).\n\nThis is the meaning of Allah’s saying: <<هذا يَوْمُ يَنْفَعُ الصَّادِقِينَ صِدْقُهُمْ>> (This is the Day when the truthfulness of the truthful will benefit them). The afflictions of the Day of Resurrection will not affect them; rather, people will fear, but they will not fear, and people will grieve, but they will not grieve.\n\nHe said concerning another group: <<فَلَوْ صَدَقُوا الله لَكانَ خَيْراً لَهُمْ>> (Had they been truthful with Allah, it would have been better for them). This is His ruling concerning speech, so how about all other states?\n\n### [Truthfulness (الصدق) which is a State (حال) and Truthfulness which is a Station (مقام)]\n\nWhen Truthfulness comes from outside, it comes without its true form, for it appears in a material of possibility (مادة إمكانية). Thus, it does not produce an effect in everyone it reaches. If there is the truthfulness of faith in the locus, it distinguishes and recognizes it in the material in which it appeared, accepts it, and acts according to its requirement. It becomes \"light upon light\" <<لِيَزْدادُوا إِيماناً مَعَ إِيمَانِهِمْ>> (that they may increase in faith along with their faith), just as it increases the defilement of those who lack the state of truthfulness.\n\nTruthfulness by its Essence (بذاته) is effective; wherever its essence appears, its ruling appears. Whoever lacks this effective state at a given time is necessarily absent from his truthfulness at that time, and he claims it from a distant place.\n\nTruthfulness, in terms of its relation to the cosmos (الكون), is a State (حال). In terms of its relation to the one who is truthful with Allah, it is a Station (مقام). From the perspective of it being a Station, no effect proceeds from it, because its relation is to Allah, and Allah is not a locus for the influence of created things (الأكوان). The possessor of this Station is truthful in his turning toward Allah.\n\nIf an effect appears from one whose description is this, it is without deliberate effort or intention. Rather, that is left to Allah, Who causes it to flow through his tongue or hand, and he has no knowledge of it. If he produces an effect knowingly and claims that he is truthful with Allah, he is either ignorant of the matter or a liar. This is not the description of the People of Allah (أهل الله).\n\nThe State of Truthfulness contradicts its Station. His Station is higher than his State in particularity, but his State is more famous and higher in generality.\n\n### [Shaykh Abd al-Qadir possessed the State of Truthfulness (حال الصدق), and his disciple Shaykh Abu al-Su'ud ibn al-Shibli possessed the Station of Truthfulness (مقام الصدق)]\n\nImam Abd al-Qadir, according to what is transmitted to us of his states, possessed the State of Truthfulness, not its Station. The possessor of the State is prone to ecstatic utterances (الشطح), and such was he (may Allah be pleased with him).\n\nImam Abu al-Su'ud ibn al-Shibli, the disciple of Abd al-Qadir, possessed the Station of Truthfulness, not its State. Thus, he was unknown in the world, unrecognized, and an indefinite person—the opposite of Abd al-Qadir—due to a verified inability resulting from his firm establishment in the Station of Truthfulness with Allah. This is just as Abd al-Qadir was verified and firmly established in the State of Truthfulness. May Allah be pleased with them both. We have not heard in our time of anyone who was like Abd al-Qadir in the State of Truthfulness, nor like Abu al-Su'ud in the Station of Truthfulness.\n\n### [The Truthfulness (الصدق) belonging to the People of Allah (أهل الله) and the Truthfulness known among people]\n\nThe Truthfulness which is a Divine Attribute belongs only to the People of Allah. The Truthfulness known among people is common to every truthful person, whether believer or disbeliever.\n\nThis common truthfulness is to the Divine Truthfulness as the shadow is to the person. It is its shadow. For this reason, its effect appears in every truthful person of every creed. If it were not its shadow, no effect would rightly proceed from it.\n\nPay attention to what we have indicated and elaborated upon, for people are blind to it and to its likes among the Stations and States.\n\nWere it not for Truthfulness, Being (الوجود) would not have been,\nAnd were it not for it, Witnessing (الشهود) would not have been.",
    "ur": "(باب ایک سو چھتیس: مقام صدق اور اس کے اسرار کی معرفت میں)\n\nصدق (الصدق) اللہ کی زمین میں اس کی تلوار ہے\nپس سچے ہو جاؤ تاکہ تم سچے کو اس کی پیشکش میں دیکھو۔\nاگر دجال آئے تو اس تلوار سے\nاس کے سر کو اس کی حد سے مارو۔\nپس تلوار اپنی دونوں حدوں میں محدود ہے\nفعل کے نفل میں اور اس کے فرض میں۔\nاور یہ نہ کہو کہ یہ ناممکن ہے، کیونکہ\nفرض کرنے والا اسے اپنے فرض میں فرض کر سکتا ہے۔\nکتنے ہی مالدار ہیں جو فقر ظاہر کرتے ہیں جب\nمسکین ان کے قرض سے قرض مانگتا ہے۔\n\n[صدق (الصدق) سے متحقق ہونے والے صادق کے لیے ہمت (الہمۃ) کے ذریعے فعل ہے]\n\nصدق (الصدق) دین میں شدت اور صلابت ہے، اور اس کے احوال میں اللہ کے لیے غیرت ہے۔ اور اس سے متحقق ہونے والے صاحبِ صدق کے لیے ہمت (الہمۃ) کے ذریعے فعل ہے، اور یہی ایمان کی قوت ہے۔ ابو یزید (بسطامی) سے پوچھا گیا کہ اللہ کا وہ اسم اعظم کیا ہے جس کے ذریعے اشیاء متاثر ہوتی ہیں؟ تو انہوں نے فرمایا: مجھے اصغر دکھاؤ تاکہ میں تمہیں اعظم دکھاؤں۔ وہ صدق (الصدق) کے سوا کچھ نہیں ہے۔ سچے ہو جاؤ اور جو اسم چاہو لے لو، اللہ کے تمام اسماء عظیم ہیں۔ اللہ تعالیٰ فرماتا ہے:\n**وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ** (اور جو ایمان لائے وہ اللہ سے سب سے زیادہ شدید محبت رکھتے ہیں)۔\nیعنی وہ مشرکوں کی اپنے شریکوں سے محبت کے مقابلے میں اللہ سے زیادہ سچی محبت رکھتے ہیں۔ اور الصادق (سچا) اللہ کے اسماء میں سے ہے۔ اور اللہ تعالیٰ فرماتا ہے:\n**لِيَسْئَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ** (تاکہ وہ سچوں سے ان کے صدق (الصدق) کے بارے میں پوچھے)۔\nاور اسی وجہ سے اس (صادق) کے لیے دعویٰ ہے۔\n\n[وہ صدق (الصدق) جو نعت الٰہی (النعت الإلٰہی) ہے، صادق کے ساتھ قائم ہے اور وہ اس کا ذوق (الذوق) ہے]\n\nصادق (سچا) اس وقت تک صادق نہیں ہو سکتا جب تک صدق (الصدق) اس کے ساتھ قائم نہ ہو جائے۔ جب وہ اس کے ساتھ قائم ہو جاتا ہے تو وہ اس کے لیے ذوق (الذوق) بن جاتا ہے، اور اس کا صادق ہونا اس کے صدق (الصدق) کی حال (حال) ہوتی ہے۔ اور وہ (صادق) الصادق (سچا) کے نام سے موسوم ہوا ہے۔ اسی لیے اللہ ان سے پوچھتا ہے کہ کیا ان کا صدق (الصدق) وہی نعت الٰہی (النعت الإلٰہی) ہے جس کے ذریعے اللہ الصادق (سچا) کہلایا؟ یا نہیں؟ اگر وہ وہی ہے تو اللہ ان سے مطالبہ کرتا ہے کہ وہ اس کے احکام کے ساتھ اس طرح قائم ہوں جس طرح وہ (صدق) قائم ہے، تو کوئی چیز ان پر غالب نہیں آ سکتی اور نہ ہی ان کے صدق (الصدق) کی حال (حال) میں ان کا مقابلہ کر سکتی ہے۔ پس اللہ ان کی تصدیق کرتا ہے، جیسا کہ وہ ان کی سماعت اور بصارت تھا، نسبت ایک ہی ہے۔ اور اگر وہ اس مقام (مقام) پر حکم نہیں چلاتے اور نہ ہی یہ حال (حال) پاتے ہیں، تو یہ وہ صدق (الصدق) نہیں ہے جو نعت الٰہی (النعت الإلٰہی) ہے، بلکہ یہ ایک ایسا امر ہے جو صدق (الصدق) کی صورت میں ظاہر ہوا ہے، جیسے شبہ کا دلیل کی صورت میں ظاہر ہونا۔ اور جس طرح شبہ کی کوئی حقیقت نہیں، اسی طرح اس صدق کی بھی کوئی حقیقت نہیں۔ اور یہی اللہ کے اس قول کا معنی ہے:\n**هذا يَوْمُ يَنْفَعُ الصَّادِقِينَ صِدْقُهُمْ** (یہ وہ دن ہے جب سچوں کو ان کا صدق (الصدق) فائدہ دے گا)۔\nپس قیامت کے دن کے عوارض ان پر اثر انداز نہیں ہوں گے، بلکہ لوگ خوف زدہ ہوں گے اور وہ خوف زدہ نہیں ہوں گے، اور لوگ غمگین ہوں گے اور وہ غمگین نہیں ہوں گے۔ اور ایک گروہ کے حق میں فرمایا:\n**فَلَوْ صَدَقُوا الله لَكانَ خَيْراً لَهُمْ** (پس اگر وہ اللہ سے سچے رہتے تو یہ ان کے لیے بہتر ہوتا)۔\nیہ اس کا حکم ہے نطق (بولنے) میں، تو تمام احوال (أحوال) میں کیسا ہو گا؟\n\n[وہ صدق (الصدق) جو حال (حال) ہے اور وہ صدق (الصدق) جو مقام (مقام) ہے]\n\nاور جب صدق (الصدق) باہر سے آتا ہے تو وہ اپنی صورت کے بغیر آتا ہے، کیونکہ وہ ایک امکانی مادے میں ظاہر ہوا ہے۔ پس وہ ہر اس شخص میں کوئی اثر نہیں کرتا جس کے پاس وہ آیا۔ لیکن اگر اس محل میں ایمان کا صدق (الصدق) موجود ہو تو وہ اسے پہچان لیتا ہے اور اس مادے میں جان لیتا ہے جس میں وہ ظاہر ہوا، پس اسے قبول کرتا ہے اور اس کے تقاضے پر عمل کرتا ہے، تو وہ نور پر نور ہوتا ہے:\n**لِيَزْدادُوا إِيماناً مَعَ إِيمانِهِمْ** (تاکہ وہ اپنے ایمان کے ساتھ اور ایمان میں بڑھ جائیں)۔\nجیسا کہ جس شخص میں صدق (الصدق) کی حال (حال) نہیں ہوتی، اس کے رجس میں رجس کا اضافہ ہوتا ہے۔ اور صدق (الصدق) اپنی ذات میں مؤثر ہے، جہاں اس کا عین ظاہر ہوتا ہے، اس کا حکم ظاہر ہوتا ہے۔ اور جس شخص میں وقت پر یہ مؤثر حال (حال) نہیں ہوتی، تو وہ اس وقت اپنے صدق (الصدق) سے غائب ہوتا ہے، اور وہ اسے دور کی جگہ سے دعویٰ کرتا ہے۔ پس صدق (الصدق) اپنے تعلق کے لحاظ سے کائنات سے ایک حال (حال) ہے، اور اللہ کے ساتھ صادق سے اپنے تعلق کے لحاظ سے ایک مقام (مقام) ہے۔ اور چونکہ یہ ایک مقام (مقام) ہے، اس لیے اس سے کوئی اثر ظاہر نہیں ہوتا، کیونکہ اس کا تعلق اللہ سے ہے، اور اللہ کائنات کے متاثر ہونے کا محل نہیں ہے۔ پس اس کا صاحب اللہ کی طرف صادق التوجہ ہوتا ہے۔ اگر اس صفت والے شخص سے کائنات میں کوئی اثر ظاہر ہو تو وہ بغیر کسی تکلف یا قصد کے ہوتا ہے، بلکہ یہ اللہ کی طرف سے ہوتا ہے جو اسے اس کی زبان یا ہاتھ پر جاری کرتا ہے، اور اسے اس کا علم نہیں ہوتا۔ لیکن اگر وہ علم کے ساتھ اثر کرے اور دعویٰ کرے کہ وہ اللہ کے ساتھ صادق ہے، تو وہ یا تو اس امر سے جاہل ہے یا جھوٹا ہے۔ اور یہ اہل اللہ کی صفت نہیں ہے۔ پس صدق (الصدق) کا حال (حال) اس کے مقام (مقام) کے منافی ہے، اور اس کا مقام (مقام) خصوص میں اس کے حال (حال) سے اعلیٰ ہے، جبکہ اس کا حال (حال) عموم میں زیادہ مشہور اور اعلیٰ ہے۔\n\n[شیخ عبدالقادر کے لیے صدق (الصدق) کا حال (حال) تھا اور ان کے شاگرد شیخ ابو السعود بن الشبل کے لیے صدق (الصدق) کا مقام (مقام) تھا]\n\nامام عبدالقادر (جیلانی) کے لیے، جیسا کہ ان کے احوال ہم تک پہنچائے گئے ہیں، صدق (الصدق) کا حال (حال) تھا نہ کہ مقام (مقام)۔ اور صاحبِ حال (حال) کے لیے شطح (بے خودی کی باتیں) ہوتی ہیں، اور وہ رضی اللہ عنہ اسی طرح تھے۔ اور امام ابو السعود بن الشبلی، جو عبدالقادر کے شاگرد تھے، ان کے لیے صدق (الصدق) کا مقام (مقام) تھا نہ کہ حال (حال)۔ پس وہ دنیا میں مجہول تھے، کوئی انہیں نہیں جانتا تھا، اور وہ نکرہ تھے جو پہچانے نہیں جاتے تھے، جو عبدالقادر کے برعکس تھا، یہ ایک محقق عجز تھا کیونکہ وہ اللہ کے ساتھ صدق (الصدق) کے مقام (مقام) میں متمکن تھے، جیسا کہ عبدالقادر صدق (الصدق) کے حال (حال) میں محقق اور متمکن تھے۔ پس اللہ ان دونوں سے راضی ہو۔ ہم نے اپنے زمانے میں کسی کو نہیں سنا جو صدق (الصدق) کے حال (حال) میں عبدالقادر جیسا ہو اور نہ ہی صدق (الصدق) کے مقام (مقام) میں ابو السعود جیسا ہو۔\n\n[وہ صدق (الصدق) جو اہل اللہ کے لیے ہے اور وہ صدق (الصدق) جو لوگوں کے علم میں ہے]\n\nپس وہ صدق (الصدق) جو نعت الٰہی (النعت الإلٰہی) ہے، وہ صرف اہل اللہ کے لیے ہوتا ہے۔ اور وہ صدق (الصدق) جو لوگوں کے علم میں ہے، وہ ہر صادق میں جاری ہے، خواہ وہ مومن ہو یا کافر۔ اور یہ صدق (الصدق) الٰہی صدق (الصدق الإلٰہی) کے لیے ایسا ہے جیسے شخص کے لیے سایہ ہوتا ہے۔ پس یہ اس کا سایہ ہے۔ اور اسی لیے اس کا اثر ہر ملت کے ہر صادق میں ظاہر ہوتا ہے۔ اور اگر یہ اس کا سایہ نہ ہوتا تو اس سے کوئی اثر صحیح نہ ہوتا۔ پس جو کچھ ہم نے اشارہ کیا اور تفصیل سے بیان کیا ہے، اس پر توجہ دو، کیونکہ لوگ اس سے اور اس جیسے مقامات (مقامات) اور احوال (أحوال) سے غفلت میں ہیں۔\n\nاگر صدق (الصدق) نہ ہوتا تو الوجود (الوجود) نہ ہوتا\nاور اگر وہ نہ ہوتا تو الشہود (الشہود) نہ ہوتا۔",
    "fa": "(باب صد و سی و ششم در معرفت مقام صدق و اسرار آن)\n\nصدق شمشیر خدا در زمین اوست\nپس راست باش تا صادق را از عرضش ببینی\n\nو اگر دجال آمد، با آن شمشیر\nفرق سرش را با تیزیِ عرضش بزن\n\nپس شمشیر در دو حد خود محصور است\nدر نافله‌ای از فعل و در فرض آن\n\nو مگو که این محال است، زیرا\nفرض‌کننده آن را در فرضش واجب می‌سازد\n\nچه بسیار توانگری که فقر را آشکار می‌سازد، آنگاه که\nمسکین از وام او قرض می‌گیرد\n\n[صادقی که به صدق (الصدق) متحقق شده، فعلش به واسطه همت (الهمة) است]\n\nصدق (الصدق) شدت و صلابت در دین و غیرت برای خدا از احوال آن است. و برای صاحب آن که به صدق متحقق شده، فعل به واسطه همت (الهمة) است، و آن همان قوت ایمان است. به ابویزید (بسطامی) گفته شد: اسم اعظم خداوند که اشیاء به واسطه آن منقاد می‌شوند چیست؟ گفت: اصغر را به من نشان دهید تا اعظم را به شما نشان دهم. آن چیزی جز صدق نیست. راستگو باش و هر اسمی را که می‌خواهی برگزین؛ همه اسماء خداوند عظیم‌اند. خداوند متعال می‌فرماید: **وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ** (و کسانی که ایمان آورده‌اند، محبتشان به خدا شدیدتر است)؛ یعنی محبتشان به خدا صادقانه‌تر از محبت مشرکان به کسانی است که شریک خدا قرار داده‌اند. و «الصادق» از اسماء اوست. و خداوند متعال می‌فرماید: **لِيَسْئَلَ الصَّادِقِينَ عَنْ صِدْقِهِمْ** (تا صادقان را از صدقشان بپرسد). و به همین دلیل، او (صادق) دارای دعوی است.\n\n[صدقی که صفت الهی (نعت إلهی) است، قائم به صادق است و او چشنده آن است]\n\nپس صادق، صادق نخواهد بود مگر آنکه صدق (الصدق) به او قائم شود. و چون به او قائم شد، برای او ذوقی (چششی) خواهد بود و صادق بودن او حال صدق اوست. و او (خداوند) به «الصادق» نامیده شده است. به همین دلیل از آنها می‌پرسد که آیا صدقشان همان صفت الهی (النعت الإلهی) است که خداوند به واسطه آن به «الصادق» نامیده شده است یا خیر؟ اگر آن صفت الهی باشد، خداوند از آنها می‌خواهد که به احکام آن صفت قیام کنند، به گونه‌ای که هیچ چیز بر آنها غلبه نکند و در حال صدقشان در برابرشان مقاومت ننماید. در این صورت، خداوند صدق آنها می‌شود، همان‌گونه که سمع و بصر آنها می‌شود؛ نسبت یکی است. اما اگر این مقام (المقام) را محکم نکرده باشند و این حال (الحال) را از آن نیافته باشند، پس این صدق، آن صدق که صفت الهی است نیست، بلکه امری است که به صورت صدق ظاهر شده، مانند ظهور شبهه به صورت دلیل. و همان‌گونه که شبهه وجهی ندارد، این صدق نیز حقیقتی ندارد. و این معنای کلام خداوند است: **هَذَا يَوْمُ يَنْفَعُ الصَّادِقِينَ صِدْقُهُمْ** (امروز روزی است که صدق صادقان به آنها سود می‌بخشد). پس عوارض روز قیامت در آنها تأثیر نمی‌گذارد، بلکه مردم می‌ترسند و آنها نمی‌ترسند، و مردم اندوهگین می‌شوند و آنها اندوهگین نمی‌شوند. و در حق گروهی فرمود: **فَلَوْ صَدَقُوا اللَّهَ لَكَانَ خَيْرًا لَهُمْ** (پس اگر با خدا صادق بودند، برایشان بهتر بود). این حکم صدق در گفتار است، پس چگونه خواهد بود در جمیع احوال؟\n\n[صدقی که حال (الحال) است و صدقی که مقام (المقام) است]\n\nو صدق (الصدق) هنگامی که از خارج می‌آید، به غیر صورت خود می‌آید، زیرا در ماده‌ای امکانی (مادی) ظاهر شده است و در هر کس که به او رسیده تأثیری نگذاشته است. اما اگر در آن محل، صدق ایمان وجود داشته باشد، آن صدق را در ماده‌ای که در آن ظاهر شده تشخیص می‌دهد و می‌شناسد، پس آن را می‌پذیرد و به مقتضای آن عمل می‌کند، و این نورٌ علی نور (نوری بر نور) است تا **لِيَزْدادُوا إِيمَاناً مَعَ إِيمَانِهِمْ** (تا ایمانی بر ایمانشان بیفزایند)، همان‌گونه که برای کسی که حال صدق ندارد، پلیدی بر پلیدی‌شان افزوده می‌شود. و صدق به ذات خود مؤثر است؛ هر جا که عین آن ظاهر شود، حکم آن نیز ظاهر می‌شود. و کسی که این حال (الحال) مؤثر را در آن وقت ندارد، ناگزیر در آن زمان از صدق خود غایب است و آن را از مکانی دور ادعا می‌کند. پس صدق از حیث تعلقش به کائنات، حال (الحال) است و از حیث تعلقش از جانب صادق به خدا، مقام (المقام) است. از آن جهت که مقام است، اثری از آن صادر نمی‌شود، زیرا تعلق آن به خداست و خداوند محل تأثیر کائنات نیست. پس صاحب آن، صادقِ توجه به خداست. اگر از کسی که این صفت اوست، اثری در کائنات ظاهر شود، بدون تکلف و قصد است؛ بلکه این امر به خدا بازمی‌گردد که آن را بر زبان یا دست او جاری می‌سازد و او خود به آن علم ندارد. اما اگر با علم تأثیر بگذارد و ادعا کند که با خدا صادق است، پس یا جاهل به امر است یا دروغگو، و این از صفات اهل الله نیست. پس حال صدق با مقام آن در تناقض است، و مقام آن در خصوص بالاتر از حال آن است، در حالی که حال آن در عموم مشهورتر و بالاتر است.\n\n[شیخ عبدالقادر دارای حال صدق (حال الصدق) بود و شاگردش شیخ ابوالسعود بن الشبل دارای مقام صدق (مقام الصدق) بود]\n\nو برای امام عبدالقادر، بنا بر آنچه از احوالش به ما نقل شده، حال صدق (حال الصدق) بود نه مقام صدق (مقام الصدق). و صاحب حال (الحال) دارای شطح (سخنان غریب) است، و او (عبدالقادر) نیز چنین بود، رضوان الله علیه. و برای امام ابوالسعود بن شبلی، شاگرد عبدالقادر، مقام صدق (مقام الصدق) بود نه حال صدق. پس او در عالم ناشناخته بود و شناخته نمی‌شد و نکره‌ای بود که تعریف نمی‌شد، بر خلاف عبدالقادر؛ این عجز (ناتوانی از شهرت) محقق بود به دلیل تمکنش در مقام صدق (مقام الصدق) با خدا، همان‌گونه که عبدالقادر در حال صدق (حال الصدق) محقق و متمکن بود. پس خداوند از هر دوی آنها راضی باد. ما در زمان خود کسی را نشنیده‌ایم که در حال صدق مانند عبدالقادر باشد و نه در مقام صدق مانند ابوالسعود.\n\n[صدقی که مخصوص اهل الله است و صدقی که در معلوم مردم است]\n\nپس صدقی که صفت الهی (نعت إلهی) است، جز برای اهل الله نیست. و صدقی که در معلوم مردم است، در هر صادقی از مؤمن و کافر جاری است. و این صدق برای صدق الهی مانند سایه برای شخص است؛ پس سایه آن است. و به همین دلیل اثر آن در هر صادقی از هر ملتی ظاهر می‌شود، و اگر سایه آن نبود، اثری از آن صحیح نبود. پس توجه خود را به آنچه اشاره کردیم و بسط دادیم معطوف دار، زیرا مردم از آن و از امثال آن مقامات (المقامات) و احوال (الأحوال) در غفلت و کوری هستند.\n\nو اگر صدق نبود، هستی (الوجود) وجود نمی‌یافت\nو اگر صدق نبود، شهود (الشهود) محقق نمی‌شد"
  },
  "page_count": 2
}