{
  "id": 491,
  "title": {
    "ar": "الباب الأحد والتسعون وأربعمائة في معرفة حال قطب كان منزله لا تَفْرَحْ إِنَّ الله لا يُحِبُّ الْفَرِحِينَ",
    "en": "Chapter Four Hundred and Ninety-One: Concerning the Knowledge of the State of a Pole (قطب) Whose Station (منزل) Was: <<لَا تَفْرَحْ إِنَّ اللَّهَ لَا يُحِبُّ الْفَرِحِينَ>> (Do not exult. Indeed, Allah does not love the exultant).",
    "ur": "باب چار سو اکیانوے: ایک ایسے قطب کے حال کی معرفت (المعرفۃ) کے بیان میں جس کا منزل (منزل) یہ تھا: \"نہ اترایا کر، بے شک اللہ اترانے والوں کو پسند نہیں کرتا (لا تَفْرَحْ إِنَّ الله لا يُحِبُّ الْفَرِحِينَ)\"۔",
    "fa": "باب چهارصد و نود و یکم در معرفت حال قطبی که منزل او «شاد مباش، زیرا خداوند شادمانان را دوست ندارد» [القصص: ۷۶] بود."
  },
  "content": {
    "ar": "## «الباب الأحد والتسعون وأربعمائة في معرفة حال قطب كان منزله لا تَفْرَحْ إِنَّ الله لا يُحِبُّ الْفَرِحِينَ»\n\n\n> إنما الدنيا هموم وغموم *** حالها ذا في خصوص وعموم‏\n\n\n> فالذي يفرح فيها ما له *** فكرة العالم بالأمر الحكيم‏\n\n\n> إنما الأمر إذا حققته *** عن شهود في حديث وقديم‏\n\n\n> عبرة موعظة قد نصبت *** لخبير ذي تجاريب عليم‏\n\n\n> فبفضل الله فليفرح من *** شاء أن يفرح من أهل النعيم‏\n\n\n### [إن الله يفرح بتوبة عبده‏]\n\n\nقال الله تعالى قُلْ بِفَضْلِ الله وبِرَحْمَتِهِ فَبِذلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ فيفرحون به ولا يفرح عاقل إلا بثابت لا بزائل ولهذا الفرح الذي نسب إلى الله في فرحه بتوبة عبده لأن التوبة أمر لازم دائم الوجود ولا سيما في الآخرة لأن العبد راجع إلى الله في كل ما هو عليه إن كان في حال الحجاب إيمانا وإن كان مع رفع الحجاب فشهود عين وهذا الهجير\nما هو من قول الله في النهي وإنما حكى الله نهى قومه له فقال قالَ لَهُ قَوْمُهُ أي قوم قارون لا تَفْرَحْ إِنَّ الله لا يُحِبُّ الْفَرِحِينَ فهل أصابوا في هذا الإطلاق ولم يقيدوا أم لا فذلك أمر آخر فإن كان اتكالهم في ذلك على قرينة الحال فقد قيدوا لأن قرائن الأحوال تقيد وإن اقتضت الإطلاق في بعض المواطن فهو تقييد إطلاق لا تقييد ينتج لصاحب هذا الذكر الفرح بفضل الله وبرحمته فينتج له نقيض ذكره فتراه أبد آخرين القلب ما دام في الدنيا إلى الموت وإن فتح له ما يقع له به الفرح لو كان في غير هذا الهجير وذلك إذا فتح له فيما يوجب الفرح يرى ما عليه من الشكر لله فيما فتح له فيه فيعظم حزنه أشد مما كان فيه قبل الفتح كما فعل رسول الله صَلَّى اللهُ عَليهِ وسَلَّم حين بشر بأن الله غفر له ما تقدم من ذنبه وما تأخر فزاد في العمل شكر الله فقام حتى تورمت قدماه وقال أ فلا أكون عبدا شكورا ومن كان في مقام يريد أن يوفيه حقه لا يمكن له الفرح إلا بعد أن لا يبقى عليه من حقه شي‏ء ولا يزال هذا الحق المعين على المكلف المبشر بِفَضْلِ الله وبِرَحْمَتِهِ عليه إلى آخر نفس يكون عليه في الدنيا فلا يفرح إلا عند خروجه منها فإنه لا يسقط عنه التكليف إلا بعد رحلته من دار التكليف وهي الدار الدنيا فمن ادعى هذا الذكر ورؤي عليه الفرح فما لهذا الذكر فيه أثر وليس من أهله ولقد رأى بعض الصالحين رجلا أو شخصا يفرح ويضحك فقال له يا هذا إن كنت ممن بشره الله فما هذه حالة الشاكرين لما بشرهم الله به وإن كنت ممن لم يبشره الله فما هذه حالة الخائفين فأنكر عليه حالة الفرح في الوجهين وهذا عين ما قلناه في هذا الهجير وهذه المحبة المنفية محبة خاصة لا كل محبة فإن المحبة الإلهية لها وجوه كثيرة ولا يلزم من انتفاء وجه منها انتفاء الوجوه كلها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Ninety-One: Concerning the Knowledge of the State of a Pole (قطب) Whose Station (منزله) Was: \"Do not exult; indeed, Allah does not love the exultant ones.\"\n\nThe world is nothing but anxieties and sorrows;\nThis is its state, both specifically and generally.\n\nSo, he who rejoices in it does not possess\nThe reflection of one who knows the Wise Command.\n\nIndeed, the matter, if you verify it,\nIs based on witnessing (شهود) in both the recent and the ancient.\n\nIt is a lesson and an admonition established\nFor the expert, the knowledgeable one possessing experiences.\n\nSo, let whoever wills to rejoice among the people of bliss (أهل النعيم)\nRejoice through the favor (فضل) of Allah.\n\n### [Indeed, Allah rejoices at the repentance of His servant]\n\nAllah the Exalted said: <<قُلْ بِفَضْلِ الله وبِرَحْمَتِهِ فَبِذلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ>> (Say: \"In the Bounty of Allah and in His Mercy—in that let them rejoice; it is better than what they accumulate.\") [Quran 10:58]. So, they rejoice in it. A rational person (عاقل) does not rejoice except in what is permanent, not in what is transient. This is why the joy (فرح) attributed to Allah—His joy at the repentance (التوبة) of His servant—is [valid], because repentance is a necessary matter, perpetually existing, especially in the Hereafter, for the servant is returning to Allah in every state he is in, whether he is in the state of veiling (الحجاب) through faith (إيمانا), or if the veiling is lifted, then through direct witnessing (شهود عين).\n\nAnd this station (الهجير) is not a prohibition spoken by Allah Himself, but rather Allah recounted the prohibition spoken by Qarun's people to him, saying: <<قالَ لَهُ قَوْمُهُ>> (His people said to him) [i.e., the people of Qarun] <<لا تَفْرَحْ إِنَّ الله لا يُحِبُّ الْفَرِحِينَ>> (Do not exult; indeed, Allah does not love the exultant ones.) [Quran 28:76]. Did they succeed in this absolute statement (الإطلاق) without qualification, or not? That is another matter. If their reliance in this was upon the circumstantial evidence (قرينة الحال), then they did qualify it, because circumstantial evidence provides qualification. Even if it necessitated the absolute statement in some instances, it is a qualification of the absolute, not a qualification that results in the possessor of this invocation (الذكر) rejoicing in the Bounty of Allah and His Mercy. Thus, it results in the opposite of his invocation.\n\nThus, you see him perpetually maintaining the heart's seriousness as long as he is in the world, until death, even if an unveiling (فتح) occurs for him that would cause joy if he were in a station other than this one. This is because when an unveiling occurs for him regarding something that necessitates joy, he sees the obligation of gratitude (الشكر) to Allah for what has been unveiled to him, and thus his sorrow (حزنه) becomes greater than it was before the unveiling. Just as the Messenger of Allah (may Allah bless him and grant him peace) did when he was given the glad tidings that Allah had forgiven him his past and future sins. He increased his actions in gratitude to Allah, standing [in prayer] until his feet swelled, and he said, \"Should I not be a grateful servant (عبدا شكورا)?\"\n\nAnd whoever is in a station (مقام) and desires to fulfill its due right cannot experience joy until nothing remains of that right upon him. This specific right (الحق المعين) remains incumbent upon the responsible person (المكلف) who has been given glad tidings of the Bounty of Allah and His Mercy, until the very last breath he takes in this world. Therefore, he does not rejoice except upon his departure from it, for the obligation (التكليف) is not lifted from him until after his journey from the Abode of Obligation, which is the worldly abode (الدار الدنيا).\n\nSo, whoever claims this invocation and is seen rejoicing, this invocation has no effect upon him, and he is not among its people. Indeed, some of the righteous (الصالحين) saw a man or person rejoicing and laughing, and said to him: \"O man, if you are among those whom Allah has given glad tidings, this is not the state of those who are grateful (الشاكرين) for what Allah has announced to them. And if you are among those whom Allah has not given glad tidings, this is not the state of those who fear (الخائفين).\" Thus, he censured the state of joy in both cases. This is precisely what we have stated concerning this station.\n\nAnd this negated love (المحبة المنفية) is a specific love, not all love, for Divine Love (المحبة الإلهية) has many aspects (وجوه كثيرة), and the negation of one aspect does not necessitate the negation of all aspects. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way.) [Quran 33:4].",
    "ur": "باب نمبر چار سو اکیانوے: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"تو خوش نہ ہو، بے شک اللہ خوش ہونے والوں کو پسند نہیں کرتا۔\" (لا تَفْرَحْ إِنَّ الله لا يُحِبُّ الْفَرِحِينَ)\n\nدنیا تو بس غم اور پریشانیاں ہیں\nاس کا یہ حال خاص و عام سب کے لیے ہے\n\nپس جو شخص اس میں خوش ہوتا ہے، وہ\nحکیمانہ امر (الحق) کو جاننے والے کی فکر نہیں رکھتا\n\nجب تم امر (الوجود) کی تحقیق کرتے ہو تو وہ\nقدیم اور جدید (ہر زمانے) میں شہود (الشہود) سے ظاہر ہوتا ہے\n\nیہ ایک عبرت اور نصیحت ہے جو\nتجربہ کار اور دانا شخص کے لیے قائم کی گئی ہے\n\nپس اللہ کے فضل سے وہی خوش ہو جو\nاہل نعمت میں سے خوش ہونا چاہے\n\n### [بے شک اللہ اپنے بندے کی توبہ سے خوش ہوتا ہے]\n\nاللہ تعالیٰ نے فرمایا: قُلْ بِفَضْلِ الله وبِرَحْمَتِهِ فَبِذلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ \"کہہ دیجیے کہ اللہ کے فضل اور اس کی رحمت کے ساتھ، پس اسی پر انہیں خوش ہونا چاہیے، یہ اس سے بہتر ہے جو وہ جمع کرتے ہیں۔\" (یونس: ۵۸)\n\nپس وہ اسی (فضل و رحمت) سے خوش ہوتے ہیں، اور کوئی بھی عقل مند زائل ہونے والی چیز سے نہیں بلکہ صرف ثابت (دائم) چیز سے خوش ہوتا ہے۔ اور اسی وجہ سے وہ خوشی جو اللہ کی طرف منسوب کی گئی ہے کہ وہ اپنے بندے کی توبہ سے خوش ہوتا ہے، کیونکہ توبہ ایک لازمی امر ہے جو ہمیشہ موجود رہتا ہے، خاص طور پر آخرت میں۔ کیونکہ بندہ ہر حال میں اللہ کی طرف رجوع کرنے والا ہے، اگر وہ حجاب کی حالت میں ہے تو ایمان کے ذریعے، اور اگر حجاب اٹھا دیا گیا ہے تو عین شہود (الشہود) کے ذریعے (رجوع کرتا ہے۔)\n\nاور یہ ذکر (یعنی \"لا تفرح\") اللہ کا قول نہیں ہے جو نہی (منع) کے طور پر ہو، بلکہ اللہ نے قارون کی قوم کی نہی کو نقل کیا ہے، پس فرمایا: قالَ لَهُ قَوْمُهُ \"اس سے اس کی قوم نے کہا،\" یعنی قارون کی قوم نے: لا تَفْرَحْ إِنَّ الله لا يُحِبُّ الْفَرِحِينَ \"تو خوش نہ ہو، بے شک اللہ خوش ہونے والوں کو پسند نہیں کرتا۔\" (القصص: ۷۶)\n\nتو کیا انہوں نے اس اطلاق (غیر مشروط حکم) میں درست کہا اور اسے مقید (مشروط) نہیں کیا؟ یا نہیں؟ یہ ایک دوسرا معاملہ ہے۔ پس اگر ان کا انحصار اس معاملے میں قرینہ حال پر تھا، تو انہوں نے اسے مقید کر دیا، کیونکہ قرائن احوال (حالات کے اشارے) مقید کر دیتے ہیں۔ اور اگرچہ بعض مقامات پر یہ اطلاق کا تقاضا کرتا ہے، تو یہ اطلاق کی تقیید ہے، نہ کہ ایسی تقیید جو اس ذکر کے حامل کے لیے اللہ کے فضل اور اس کی رحمت سے خوشی پیدا کرے۔ پس اس کے لیے اس کے ذکر کا نقیض (الٹ) پیدا ہوتا ہے۔\n\nپس تم اسے دیکھتے ہو کہ جب تک وہ دنیا میں ہے موت تک اس کا دل ہمیشہ غمگین رہتا ہے، اگرچہ اس کے لیے وہ چیزیں کھل جائیں جن سے اسے خوشی حاصل ہو سکتی تھی اگر وہ اس ذکر کے علاوہ کسی اور مقام پر ہوتا۔ اور یہ اس طرح ہوتا ہے کہ جب اس کے لیے کوئی ایسی چیز کھلتی ہے جو خوشی کا موجب ہو، تو وہ اس پر اللہ کا شکر ادا کرنے کی ذمہ داری کو دیکھتا ہے جو اس پر عائد ہوتی ہے، پس اس کا غم اس سے بھی زیادہ بڑھ جاتا ہے جتنا کہ فتح سے پہلے تھا۔ جیسا کہ رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے کیا، جب آپ کو یہ بشارت دی گئی کہ اللہ نے آپ کے اگلے پچھلے تمام گناہ معاف کر دیے ہیں، تو آپ نے اللہ کا شکر ادا کرنے کے لیے عمل میں اضافہ کر دیا، یہاں تک کہ آپ کھڑے رہے اور آپ کے قدم مبارک سوج گئے، اور آپ نے فرمایا: \"کیا میں شکر گزار بندہ نہ بنوں؟\"\n\nاور جو شخص کسی ایسے مقام پر ہو جس کا حق وہ پورا کرنا چاہتا ہو، اس کے لیے خوش ہونا ممکن نہیں جب تک کہ اس پر اس حق میں سے کچھ بھی باقی نہ رہ جائے۔ اور یہ حق جو مکلف پر عائد ہوتا ہے، جسے اللہ کے فضل اور اس کی رحمت کی بشارت دی گئی ہے، دنیا میں اس کی آخری سانس تک اس پر باقی رہتا ہے۔ پس وہ خوش نہیں ہوتا مگر اس دنیا سے نکلتے وقت، کیونکہ اس سے تکلیف (شرعی ذمہ داری) ساقط نہیں ہوتی مگر دارِ تکلیف یعنی دنیا سے کوچ کرنے کے بعد۔\n\nپس جس نے اس ذکر کا دعویٰ کیا اور اس پر خوشی دیکھی گئی، تو اس ذکر کا اس میں کوئی اثر نہیں اور وہ اس کے اہل میں سے نہیں ہے۔ اور یقیناً بعض صالحین نے ایک شخص کو خوش ہوتے اور ہنستے ہوئے دیکھا تو اس سے کہا: \"اے شخص! اگر تم ان لوگوں میں سے ہو جنہیں اللہ نے بشارت دی ہے، تو یہ ان لوگوں کا حال نہیں ہے جو اللہ کی بشارت پر شکر ادا کرتے ہیں، اور اگر تم ان لوگوں میں سے ہو جنہیں اللہ نے بشارت نہیں دی، تو یہ خوف زدہ لوگوں کا حال نہیں ہے۔\" پس انہوں نے دونوں صورتوں میں خوشی کی حالت پر اعتراض کیا۔ اور یہ بعینہٖ وہی بات ہے جو ہم نے اس ذکر کے بارے میں کہی ہے۔\n\nاور یہ محبّت جو منفی کی گئی ہے (یعنی \"اللہ خوش ہونے والوں کو پسند نہیں کرتا\")، یہ ایک خاص محبّت ہے نہ کہ ہر طرح کی محبّت، کیونکہ محبّت الٰہیہ کے بہت سے پہلو ہیں، اور ان میں سے کسی ایک پہلو کے ختم ہونے سے تمام پہلوؤں کا ختم ہونا لازم نہیں آتا۔\n\nاور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏ \"حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے۔\" (الاحزاب: ۴)",
    "fa": "باب چهارصد و نود و یکم در شناخت حال قطبی که مقام او «شاد مباش، زیرا خداوند شادمانان را دوست ندارد» بود.\n\nدنیا جز اندوه و غم نیست *** حالش در خاص و عام چنین است.\n\nپس آنکه در آن شادمان شود، *** اندیشهٔ دانای به امر حکیم را ندارد.\n\nهمانا امر (حقیقت) اگر آن را دریابی، *** از شهود (شهود) در نو و کهن (گذشته و حال) است.\n\nعبرتی و موعظه‌ای است که برپا شده *** برای خبیری صاحب تجربه‌های دانا.\n\nپس به فضل خداوند باید شاد شود کسی *** که از اهل نعمت بخواهد شاد شود.\n\n[همانا خداوند به توبه بنده‌اش شاد می‌شود]\n\nخداوند متعال می‌فرماید: «قُلْ بِفَضْلِ الله وبِرَحْمَتِهِ فَبِذلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِمَّا يَجْمَعُونَ» (بگو: به فضل خدا و رحمت اوست که باید شاد شوند؛ این از آنچه گرد می‌آورند بهتر است). پس به آن شاد می‌شوند، و هیچ عاقلی جز به امر ثابت شاد نمی‌شود، نه به امر زوال‌پذیر. و به همین دلیل است شادمانی‌ای که به خداوند نسبت داده شده در شادمانی‌اش به توبه بنده‌اش؛ زیرا توبه امری لازم و دائم الوجود (الوجود) است، به ویژه در آخرت؛ چرا که بنده در هر حالتی که هست به سوی خداوند باز می‌گردد، اگر در حال حجاب باشد با ایمان، و اگر با رفع حجاب باشد با شهود (شهود) عینی.\n\nو این ذکر (مقام) از قول خداوند در نهی نیست، بلکه خداوند نهی قوم او را از وی حکایت کرده است، پس فرمود: «قالَ لَهُ قَوْمُهُ» (قومش به او گفتند) یعنی قوم قارون: «لا تَفْرَحْ إِنَّ الله لا يُحِبُّ الْفَرِحِينَ» (شاد مباش، زیرا خداوند شادمانان را دوست ندارد). پس آیا در این اطلاق (بی‌قید سخن گفتن) درست عمل کردند و قیدی نزدند یا نه؟ این امری دیگر است. اگر اتکای آنان در این امر بر قرینه حال بوده باشد، پس قید زده‌اند؛ زیرا قرائن احوال قید می‌زنند. و اگرچه در برخی مواضع اقتضای اطلاق داشته باشد، این تقییدِ اطلاق است، نه تقییدی که برای صاحب این ذکر، شادمانی به فضل خدا و رحمت او را نتیجه دهد؛ بلکه نقیض ذکرش را برای او نتیجه می‌دهد.\n\nپس او را می‌بینی که تا زمانی که در دنیاست، تا دم مرگ، قلبش همیشه در آخرت است. و اگر برای او کشفی (الکشف) حاصل شود که در غیر این مقام (الهجیر) موجب شادمانی می‌شد، و این زمانی است که در آنچه موجب شادمانی است، کشفی برایش حاصل شود، آنچه را که از شکرگزاری نسبت به خداوند در قبال آن کشف بر عهده دارد، می‌بیند؛ پس اندوهش شدیدتر می‌شود از آنچه پیش از کشف در آن بود. چنانکه رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) چنین کرد، هنگامی که به او بشارت داده شد که خداوند گناهان گذشته و آینده‌اش را آمرزیده است، در عمل شکر خداوند افزود، پس به نماز ایستاد تا پاهایش ورم کرد و فرمود: «آیا بنده شکرگزار نباشم؟»\n\nو کسی که در مقامی است و می‌خواهد حق آن را به طور کامل ادا کند، شادمانی برای او ممکن نیست مگر پس از آنکه چیزی از حق آن بر عهده‌اش باقی نماند. و این حق معین بر مکلفی که به «بِفَضْلِ الله وبِرَحْمَتِهِ» بشارت داده شده، تا آخرین نفسی که در دنیا می‌کشد، بر عهده او باقی است. پس شاد نمی‌شود مگر هنگام خروج از دنیا. زیرا تکلیف از او ساقط نمی‌شود مگر پس از کوچیدن از سرای تکلیف که همان سرای دنیاست. پس هر کس مدعی این ذکر (مقام) باشد و شادمانی بر او دیده شود، این ذکر در او اثری ندارد و او از اهل آن نیست.\n\nو به راستی برخی از صالحان مردی یا شخصی را دیدند که شادمانی و خنده می‌کرد، پس به او گفتند: ای مرد، اگر از کسانی هستی که خداوند به او بشارت داده است، این حال شکرگزاران در برابر بشارت الهی نیست؛ و اگر از کسانی هستی که خداوند به او بشارت نداده است، این حال خائفان نیست. پس حالت شادمانی او را در هر دو وجه انکار کرد. و این عین همان چیزی است که ما در این مقام (الهجیر) گفتیم. و این محبتی که نفی شده، محبتی خاص است نه هر محبتی؛ زیرا محبت الهی وجوه بسیاری دارد و از نفی یک وجه از آن، نفی همه وجوه لازم نمی‌آید. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 2
}