{
  "id": 59,
  "title": {
    "ar": "الباب التاسع والخمسون في معرفة الزمان الموجود والمقدر",
    "en": "Chapter Fifty-Nine: Concerning the Knowledge of Existing Time and Determined Time.",
    "ur": "باب انسٹھواں: موجود اور مقدر زمان کی معرفت میں",
    "fa": "باب پنجاه و نهم در معرفت زمان موجود و مقدر"
  },
  "content": {
    "ar": "## (الباب التاسع والخمسون في معرفة الزمان الموجود والمقدر)\n> إن الزمان إذا حققت حاصله *** محقق فهو بالأوهام معلوم‏\n\n\n> مثل الطبيعة في التأثير قوته *** والعين منها ومنه فيه معدوم‏\n\n\n> به تعينت الأشياء وليس له *** عين يكون عليه منه تحكيم‏\n\n\n> العقل يعجز عن إدراك صورته *** لذا نقول بأن الدهر موهوم‏\n\n\n> لو لا التنزه ما سمي الإله به *** وجوده فله في القلب تعظيم‏\n\n\n> أصل الزمان إذا أنصفت من أزل *** فحكمه أزلي وهو محكوم‏\n\n\n> مثل الخلأ امتداد ما له طرف *** في غير جسم بوهم فيه تجسيم‏\n\n\n### [أولية الحق ووجوده وأولية العالم ووجوده‏]\n\n\nاعلم أولا أن الله تعالى هو الأول الذي لا أولية لشي‏ء قبله ولا أولية لشي‏ء يكون قائما به أو غير قائم به معه فهو الواحد سبحانه في أوليته فلا شي‏ء واجب الوجود لنفسه إلا هو فهو الغني بذاته على الإطلاق عن العالمين قال تعالى فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ بالدليل العقلي والشرعي فوجود العالم لا يخلو ما أن يكون وجوده عن الله لنفسه سبحانه أو لأمر زائد ما هو نفسه إذ لو كان نفسه لم يكن زائدا ولو كان نفسه أيضا لكان مركبا في نفسه وكانت الأولية لذلك الأمر الزائد وقد فرضنا أنه لا أولية لشي‏ء معه ولا قبله فإذا لم يكن ذلك الأمر الزائد نفسه فلا يخلو إما أن يكون وجودا أو لا وجودا محال أن يكون لا وجود فإن لا وجود لا يصح أن يكون له أثر إيجاد فيما هو موصوف بأن لا وجود وهو العالم فليس أحدهما بأولى بتأثير الإيجاد من الآخر إذ كلاهما أن لا وجود فإن لا وجود لا أثر له لأنه عدم ومحال أن يكون وجودا فإنه لا يخلو عند ذلك إما أن يكون وجوده لنفسه أو لا يكون محال أن يكون وجوده لنفسه فإنه قد قام الدليل على إحالة أن يكون في الوجود اثنان واجبا الوجود لأنفسهما فلم يبق إلا أن يكون وجوده بغيره ولا معنى لا مكان العالم إلا أن وجوده بغيره فهو العالم إذن أو من العالم ولو كان وجود العالم عن الله لنسبة ما لولاها ما وجد العالم تسمى تلك النسبة إرادة أو مشيئة أو علما أو ما شئت مما يطلبه وجود الممكن فيكون الحق تعالى بلا شك لا يفعل شيئا إلا بتلك النسبة ولا معنى للافتقار إلا هذا وهو محال على الله فإن الله له الغني على الإطلاق فهو كما قال غَنِيٌّ عَنِ الْعالَمِينَ فإن قيل إن المراد بالنسبة عين ذاته قلنا فالشي‏ء لا يكون مفتقرا إلى نفسه فإنه غني لنفسه فيكون الشي‏ء الواحد فقيرا من حيث ما هو عني كل ذلك لنفسه وهو محال وقد نفينا الأمر الزائد فاقتضى ذلك أن يكون وجود العالم من حيث ما هو موجود بغيره مرتبطا بالواجب الوجود لنفسه وإن عين الممكن محل تأثير الواجب الوجود لنفسه بالإيجاد ولا يعقل إلا هكذا فمشيئته وإرادته وعلمه وقدرته ذاته تعالى الله أن يتكثر في ذاته علوا كبيرا بل له الوحدة المطلقة وهو الواحد الأحد الله الصَّمَدُ لَمْ يَلِدْ فيكون مقدمة ولَمْ يُولَدْ فيكون نتيجة ولَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ فيكون به وجود العالم نتيجة عن مقدمتين عن الحق والكفؤ تعالى الله وبهذا وصف نفسه سبحانه في كتابه لما سئل النبي صلى الله عليه وسلم عن صفة ربه فنزلت سورة الإخلاص تخلصت من الاشتراك مع غيره تعالى الله في تلك النعوت المقدسة والأوصاف فما من شي‏ء نفاه في هذه السورة ولا أثبته إلا وذلك المنفي أو المثبت مقالة في الله لبعض الناس وبعد أن بينا لك ما ينبغي أن يكون عليه من نحن مفتقرون إليه وهو الله سبحانه فلنبين ما بوبنا عليه فاعلم أن نسبة الأزل إلى الله نسبة الزمان إلينا ونسبة الأزل نعت سلبي لا عين له فلا يكون عن هذه الحقيقة وجود فيكون الزمان للممكن نسبة متوهمة الوجود لا موجودة لأن كل شي‏ء تفرضه يصح عنه السؤال بمتى ومتى سؤال عن زمان فلا بد أن يكون الزمان أمرا متوهما لا وجودا ولهذا أطلقه الحق على نفسه في قوله وكانَ الله بِكُلِّ شَيْ‏ءٍ عَلِيماً ولِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ وفي السنة تقرير قول السائل أين كان ربنا قبل أن يخلق خلقه ولو كان الزمان أمرا وجوديا في نفسه ما صح تنزيه الحق عن التقييد إذ كان حكم الزمان يقيده فعرفنا أن هذه الصيغ ما تحتها أمر وجودي‏\n\n\n### [الزمان: معقوله ومدلوله‏]\n\n\nثم نقول إن لفظة الزمان اختلف الناس في معقولها ومدلولها فالحكماء تطلقه بإزاء أمور مختلفة وأكثرهم على أنه مدة متوهمة تقطعها حركات الأفلاك والمتكلمون يطلقونه بإزاء أمر آخر وهو مقارنة حادث لحادث يسأل عنه بمتى والعرب تطلقه وتريد به الليل والنهار وهو مطلوبنا في هذا الباب والليل والنهار فصلا اليوم فمن طلوع‏\nالشمس إلى غروبها يسمى نهارا ومن غروب الشمس إلى ما طلوعها يسمى ليلا وهذه العين المفصلة تسمى يوما وأظهر هذا اليوم وجود الحركة الكبرى وما في الوجود العيني إلا وجود المتحرك لا غير وما هو عين الزمان فرجع محصول ذلك إلى أن الزمان أمر متوهم لا حقيقة له وإذا تقرر هذا فاليوم المعقول المقدر هو المعبر عنه بالزمان الموجود وبه تظهر الجمعات والشهور والسنون والدهور وتسمى أيا وتقدر بهذا اليوم الأصغر المعتاد الذي فصله الليل والنهار فالزمان المقدر هو ما زاد على هذا اليوم الأصغر الذي تقدر به سائر الأيام الكبار فيقال في يَوْمٍ كانَ مِقْدارُهُ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ وقال في يَوْمٍ كانَ مِقْدارُهُ خَمْسِينَ أَلْفَ سَنَةٍ\n\n\n### [أيام الدجال المقدرة]\n\n\nوقال عليه السلام في أيام الدجال يوم كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم‏\n\n\nفقد يكون هذا الشدة الهول فرفع الإشكال ظاهر إتمام الحديث في قول عائشة فكيف يفعل في الصلاة في ذلك اليوم قال يقدر لها فلو لا أن الأمر في حركات الأفلاك على ما هو عليه باق ما اختل ما صح أن يقدر لذلك بالساعات التي يعمل صورتها أهل هذا العلم فيعلمون بها الأوقات في أيام الغيم إذ لا ظهور للشمس فيكون في أول خروج الدجال تكثر الغيوم وتتوالى بحيث أن يستوي في رأى العين وجود الليل والنهار وهو من الأشكال الغريبة التي تحدث في آخر الزمان فيحول ذلك الغيم المتراكم بيننا وبين السماء والحركات كما هي فتظهر الحركات في الصنائع العملية التي عملها أهل صنعة العلماء بالهيئة ومجاري النجوم فيقدرون بها الليل والنهار وساعات الصلوات بلا شك ولو كان ذلك اليوم الذي هو كسنة يوما واحدا لم يلزمنا أن نقدر للصلوات فإنا ننتظر زوال الشمس فما لم نزل لا نصلي الظهر المشروع ولو أقامت لا تزول ما مقداره عشرون ألف سنة لم يكلفنا الله غير ذلك فلما قرر الشارع العبادة بالتقدير عرفنا أن حركات الأفلاك على بابها لم يختل نظامها\n\n\n### [الزمن الفرد والجوهر الفرد]\n\n\nفقد أعلمتك ما هو الزمان وما معنى نسبة الوجود إليه ونسبة التقدير فالأيام كثيرة ومنها كبير وصغير فأصغرها الزمن الفرد وعليه يخرج كُلَّ يَوْمٍ هُوَ في شَأْنٍ فسمى الزمن الفرد يوما لأن الشأن يحدث فيه فهو أصغر الأزمان وأدقها ولا حد لأكبرها يوقف عنده وبينهما أيام متوسطة أولها اليوم المعلوم في العرف وتفصله الساعات والساعات تفصلها الدرج والدرج تفصله الدقائق وهكذا إلى ما لا يتناهى عند بعض الناس فإنهم يفصلون الدقائق إلى ثوان فلما دخلها حكم العدد كان حكمها العدد والعدد لا يتناهى فالتفصيل في ذلك لا ينتهي وبعض الناس يقولون بالتناهي في ذلك وينظرونه من حيث المعدود وهم الذين يثبتون أن للزمان عينا موجودة وكل ما دخل في الوجود فهو متناه بلا شك والمخالف يقول المعدود من كونه يعد ما دخل في الوجود فلا يوصف بالتناهي فإن العدد لا يتصف بالتناهي وبهذا يحتج منكر الجوهر الفرد وإن الجسم ينقسم إلى ما لا نهاية له في العقل وهي مسألة خلاف بين أهل النظر حدثت من عدم الإنصاف والبحث عن مدلول الألفاظ وقد ورد في الخبر الصحيح أن من أسماء الله الدهر\n\n\nومعقولية الدهر معلومة نذكر ذلك إن شاء الله تعالى في هذا الكتاب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء السابع والعشرون‏\n\n",
    "en": "## (Chapter Fifty-Nine: Concerning the Knowledge of Existent and Measured Time)\n\nIf you verify the essence of Time (الزمان), it is verified, yet known only through conjectures (الأوهام).\nIts power is like Nature's in its effect, yet the concrete entity (العين) from it and in it is non-existent.\nBy it, things are determined, yet it has no concrete entity (عين) upon which judgment can be passed from it.\nThe intellect is incapable of grasping its form, thus we say that Perpetual Time (الدهر) is conceptual (موهوم).\nWere it not for transcendence (*tanzih*), the Deity would not be named by it; His Existence (وجوده) is therefore magnified in the heart.\nThe origin of Time, if you are just, is from Pre-eternity (أزل); thus its ruling is pre-eternal, and it is ruled.\nIt is like the extension of the void (*al-khala'*) which has no limit, yet through conjecture (وهم), it is given corporeality in a non-body.\n\n### [The Priority of The Real (الحق) and His Existence, and the Priority of the World (العالم) and its Existence]\n\nKnow first that Allah, the Exalted, is The First (الأول), before Whom nothing has priority, and nothing has priority that subsists by Him or does not subsist by Him alongside Him. He, the Glorified, is the One (الواحد) in His priority, for nothing is Necessary Existence (واجب الوجود) by itself except Him. He is absolutely Self-Sufficient (الغني بذاته) from the worlds. He, the Exalted, said: <<فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ>> (Indeed, Allah is Self-Sufficient above the worlds), by rational and legal proof.\n\nThe existence of the world (العالم) must be either its existence from Allah for His Essence (سبحانه) or for an added matter (أمر زائد) that is not His Essence. If it were His Essence, it would not be added. If it were His Essence, He would also be composite in Himself, and the priority would belong to that added matter. We have stipulated that nothing has priority alongside Him or before Him. If that added matter is not His Essence, then it must be either existence (وجود) or non-existence (لا وجود). It is impossible for it to be non-existence, for non-existence cannot have an effect of bringing into existence upon that which is described as non-existence, which is the world. Neither of them is more entitled to the effect of bringing into existence than the other, since both are non-existence, and non-existence has no effect because it is nothingness (*adam*).\n\nIt is impossible for it to be existence, for in that case, it must either be existence by itself or not. It is impossible for its existence to be by itself, for proof has been established that it is impossible for there to be two Necessary Existences (واجبا الوجود) in existence by themselves. Therefore, it remains only that its existence is by another. The meaning of the contingency (*imkan*) of the world is nothing other than that its existence is by another; thus, it is the world (العالم) or from the world.\n\nEven if the existence of the world were from Allah due to a certain relationship (نسبة) without which the world would not exist—a relationship called Will (إرادة), or Wishing (مشيئة), or Knowledge (علم), or whatever you wish that the existence of the contingent (الممكن) demands—then The Real (الحق), the Exalted, would undoubtedly do nothing except through that relationship. The meaning of dependence (*iftiqar*) is nothing but this, and this is impossible for Allah, for Allah possesses absolute Self-Sufficiency (الغني على الإطلاق). Thus, He is as He said: <<غَنِيٌّ عَنِ الْعالَمِينَ>> (Self-Sufficient above the worlds).\n\nIf it is said that the intended relationship is the very Essence (عين ذاته), we reply that a thing cannot be dependent upon itself, for it is self-sufficient by itself. Thus, the one thing would be poor (فقير) from the perspective that it is rich (غني), all by itself, which is impossible. We have already negated the added matter (الأمر الزائد). This necessitates that the existence of the world, insofar as it exists by another, is linked to the Necessary Existence (الواجب الوجود) by Himself, and that the essence of the contingent (عين الممكن) is the locus of the effect of the Necessary Existence by Himself through bringing into existence. This is the only way it can be rationally conceived. Therefore, His Wishing (مشيئته), His Will (إرادته), His Knowledge (علمه), and His Power (قدرته) are His Essence (ذاته). Exalted is Allah far above being multiplied in His Essence (ذاته) with great exaltation. Rather, He possesses absolute Unity (الوحدة المطلقة). He is The One, The Unique (الواحد الأحد), Allah, The Eternal Refuge (الصَّمَدُ). <<لَمْ يَلِدْ>> (He begets not)—which serves as a premise—and <<وَلَمْ يُولَدْ>> (nor is He begotten)—which serves as a conclusion—and <<وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ>> (nor is there to Him any equivalent), through which the existence of the world results from two premises concerning The Real (الحق) and the equivalent. Exalted is Allah.\n\nBy this, He, the Glorified, described Himself in His Book when the Prophet (peace and blessings be upon him) was asked about the description of his Lord, and Surah Al-Ikhlas (سورة الإخلاص) was revealed, purifying Him from sharing those sacred attributes and descriptions with others. Exalted is Allah. There is nothing He negated or affirmed in this Surah except that the negated or affirmed matter was a statement made about Allah by some people. After we have clarified for you what the One upon whom we depend—Allah, the Glorified—must be, let us clarify what we have structured this chapter upon.\n\nKnow that the relationship (نسبة) of Pre-eternity (الأزل) to Allah is the relationship of Time (الزمان) to us. The relationship of Pre-eternity is a negative attribute (*na‘t salbi*) that has no concrete entity (عين له). Thus, no existence (وجود) results from this reality. Therefore, Time for the contingent (الممكن) is a relationship that is conceptually imagined (متوهمة الوجود), not existent. This is because everything you hypothesize can be questioned with \"When?\" (*mata*), and \"When?\" is a question about time. Thus, Time must be a conceptually imagined matter (أمر متوهما), not an existence. For this reason, The Real (الحق) applied it to Himself in His saying: <<وَكَانَ الله بِكُلِّ شَيْ‏ءٍ عَلِيماً>> (And Allah is ever Knowing of all things) and <<وَلِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ>> (And to Allah belongs the command before and after). And in the Sunnah, there is the confirmation of the questioner's saying: \"Where was our Lord before He created His creation?\" If Time were an existent matter in itself, it would not be correct to transcend The Real (الحق) from limitation, since the ruling of Time would limit Him. Thus, we know that these formulations do not contain an existent matter beneath them.\n\n### [Time (الزمان): Its Concept and Its Denotation]\n\nWe then say that people have differed regarding the concept (*ma‘qul*) and denotation (*madlul*) of the word Time (الزمان). Philosophers apply it to various matters, and most of them hold that it is an imagined duration (مدة متوهمة) traversed by the movements of the celestial spheres (*aflak*). The theologians (*mutakallimun*) apply it to another matter, which is the concomitance of an event with an event, about which one asks \"When?\" The Arabs apply it intending the night and the day, which is our objective in this chapter.\n\nNight and day are the divisions of the day. From sunrise to sunset is called day (*nahar*), and from sunset until sunrise is called night (*layl*). This divided entity is called a day (*yawm*). The existence of the greater movement makes this day manifest. In concrete existence (الوجود العيني), there is only the existence of the moving object and nothing else, and that is not the essence of Time. The outcome of this is that Time is a conceptually imagined matter (أمر متوهم) that has no reality.\n\nIf this is established, then the conceptually understood, measured day is what is expressed as Existent Time (الزمان الموجود). By it, weeks, months, years, and aeons (*duhur*) become manifest. They are called days (*ayyam*) and are measured by this smallest customary day, which is divided by night and day. Measured Time (الزمان المقدر) is what exceeds this smallest day by which all the great days are measured. Thus, it is said: <<فِي يَوْمٍ كَانَ مِقْدَارُهُ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ>> (in a Day, the measure of which is a thousand years of what you count), and He said: <<فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ>> (in a Day, the measure of which is fifty thousand years).\n\n### [The Measured Days of the Dajjal]\n\nThe Prophet (peace and blessings be upon him) said concerning the days of the Dajjal: \"A day like a year, a day like a month, and a day like a week, and the rest of his days are like your days.\"\n\nThis may be due to the severity of the terror, and the resolution of the ambiguity is clear in the completion of the Hadith, in the saying of Aisha: \"How shall we perform the prayer on that day?\" He replied: \"You shall estimate (يقدر) for it.\" Were it not that the matter concerning the movements of the celestial spheres (*aflak*) remains as it is, without disruption, it would not be correct to estimate that by the hours whose form is calculated by the people of this science, by which they know the times during cloudy days, since the sun is not visible.\n\nThus, at the beginning of the Dajjal's emergence, clouds will multiply and follow one another such that the existence of night and day appears equal to the naked eye. This is one of the strange forms that will occur at the end of time, where the accumulated clouds will intervene between us and the sky, while the movements remain as they are. The movements will then become apparent through the practical crafts created by the practitioners of the science of astronomy (*hay'a*) and the courses of the stars, by which they estimate the night, the day, and the hours of prayer without doubt.\n\nIf that day which is like a year were a single day, we would not be obliged to estimate the prayers, for we would wait for the sun's zenith (*zawal*). As long as the sun has not passed the zenith, we do not pray the prescribed Dhuhr prayer. If it remained without passing the zenith for a duration of twenty thousand years, Allah would not burden us with anything other than that. Since the Lawgiver established the worship through estimation (تقدير), we know that the movements of the celestial spheres are in their proper place and their system has not been disrupted.\n\n### [The Individual Instant (الزمن الفرد) and the Individual Substance (الجوهر الفرد)]\n\nI have informed you what Time is, and the meaning of attributing existence (وجود) and attribution of measurement (تقدير) to it. Days are many, some large and some small. The smallest of them is the Individual Instant (الزمن الفرد), upon which the verse <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [some] affair) is based. The Individual Instant is called a day because the affair (*sha'n*) occurs within it. It is the smallest and most subtle of times.\n\nThere is no limit to its largest unit that one can stop at. Between them are intermediate days, the first of which is the day known in common usage, which is divided by hours, and the hours are divided by degrees, and the degrees are divided by minutes, and so on, to what is considered infinite by some people, for they divide the minutes into seconds. Since the ruling of number (*adad*) entered into it, its ruling became that of number, and number is infinite. Thus, the division in this regard does not end.\n\nSome people hold that there is a limit to this division, viewing it from the perspective of the counted object (*ma‘dud*). These are the ones who affirm that Time has an existent entity (عينا موجودة), and everything that enters into existence is undoubtedly finite. The opponent argues that the counted object, by virtue of being counted, has entered into existence, but it is not described as finite, for number itself is not described as finite. By this, those who deny the Individual Substance (الجوهر الفرد) argue that the body is divisible infinitely in the intellect. This is a matter of dispute among the people of speculation (*ahl al-nazar*) that arose from a lack of fairness and proper investigation into the denotation of the terms.\n\nIt has been reported in an authentic Hadith that one of the Names of Allah is Perpetual Time (الدهر). The conceptual meaning of Perpetual Time is known, and we shall mention that, if Allah wills, in this Book. <<وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way). End of the Twenty-Seventh Part.",
    "ur": "(باب نمبر انسٹھ: موجود (Actual) اور مقدر (Conceptual) زمان کی معرفت میں)\n\nاگر تم زمان کی حقیقت کو جانچو، تو اس کا حاصل (حقیقی) نہیں ہے، بلکہ وہ اوہام (وہموں) کے ذریعے معلوم ہوتا ہے۔\nاس کی قوت تاثیر میں طبیعت (Nature) کی مانند ہے، مگر اس کی عین (حقیقت) طبیعت سے اور خود زمان سے معدوم ہے۔\nاسی کے ذریعے اشیاء متعین ہوئیں، مگر اس کی کوئی عین (حقیقت) نہیں جس پر اس کا حکم چل سکے۔\nعقل اس کی صورت کے ادراک سے عاجز ہے، اسی لیے ہم کہتے ہیں کہ دہر (الدهر) موہوم (خیالی) ہے۔\nاگر تنزیہ نہ ہوتا تو اللہ تعالیٰ کا نام اس پر نہ رکھا جاتا، اس کا الوجود (ہستی) ہے، پس دل میں اس کی تعظیم ہے۔\nاگر تم انصاف کرو تو زمان کی اصل ازل (الأزل) سے ہے، پس اس کا حکم ازلی ہے اور وہ محکوم ہے۔\nوہ خلا (الخلأ) کی طرح ایک ایسا امتداد ہے جس کا کوئی کنارہ نہیں، جو غیر جسم میں ہے اور وہم کے ذریعے اس میں تجسیم (جسمانیت) کی جاتی ہے۔\n\n### [الحق (ذات حق) کی اولیت اور اس کا الوجود (ہستی)، اور عالم کی اولیت اور اس کا الوجود (ہستی)]\n\nسب سے پہلے یہ جان لو کہ اللہ تعالیٰ وہ الاول (پہلا) ہے جس سے پہلے کسی شے کی اولیت نہیں، اور نہ ہی کوئی شے اس کے ساتھ قائم ہے یا اس کے ساتھ غیر قائم ہے۔ پس وہ اپنی اولیت میں واحد (سبحانہ) ہے۔ اس کے سوا کوئی شے واجب الوجود (واجب الوجود) لنفسہ (اپنے لیے) نہیں ہے۔ پس وہ مطلق طور پر عالمین سے اپنی ذات کے ساتھ غنی ہے۔ اللہ تعالیٰ فرماتا ہے: فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ (بیشک اللہ تمام جہانوں سے بے نیاز ہے)۔ یہ عقلی اور شرعی دلیل سے ثابت ہے۔\n\nعالم کا الوجود (ہستی) اس سے خالی نہیں کہ یا تو اس کا الوجود (ہستی) اللہ کی طرف سے اس کی اپنی ذات کے لیے ہو (سبحانہ)، یا کسی زائد امر کے لیے ہو جو اس کی ذات نہ ہو۔ اگر وہ زائد امر اس کی ذات ہوتا تو وہ زائد نہ ہوتا۔ اور اگر وہ اس کی ذات ہوتا تو وہ اپنی ذات میں مرکب ہوتا، اور اولیت اس زائد امر کی ہوتی۔ جبکہ ہم فرض کر چکے ہیں کہ اس کے ساتھ یا اس سے پہلے کسی شے کی اولیت نہیں ہے۔\n\nپس جب وہ زائد امر اس کی ذات نہیں ہے، تو وہ یا تو الوجود (ہستی) ہوگا یا لا وجود (عدم)۔ یہ محال ہے کہ وہ لا وجود ہو، کیونکہ لا وجود میں ایجادی تاثیر کی صلاحیت نہیں ہو سکتی اس شے میں جو لا وجود سے موصوف ہے، اور وہ عالم ہے۔ پس ان دونوں میں سے کوئی بھی ایجادی تاثیر کے لیے دوسرے سے زیادہ اولیٰ نہیں ہے، کیونکہ دونوں ہی لا وجود ہیں۔ لا وجود کی کوئی تاثیر نہیں ہوتی کیونکہ وہ عدم ہے۔\n\nاور یہ محال ہے کہ وہ الوجود (ہستی) ہو، کیونکہ اس صورت میں وہ اس سے خالی نہیں ہوگا کہ یا تو اس کا الوجود (ہستی) لنفسہ (اپنے لیے) ہو یا نہ ہو۔ یہ محال ہے کہ اس کا الوجود (ہستی) لنفسہ ہو، کیونکہ دلیل قائم ہو چکی ہے کہ الوجود (ہستی) میں دو واجب الوجود (واجب الوجود) لنفسہ کا ہونا محال ہے۔\n\nپس صرف یہی باقی رہا کہ اس کا الوجود (ہستی) بغیرہ (کسی دوسرے کے ذریعے) ہو۔ اور عالم کے ممکن ہونے کا کوئی معنی نہیں سوائے اس کے کہ اس کا الوجود (ہستی) کسی دوسرے کے ذریعے ہے۔ پس وہ عالم ہے، یا عالم سے ہے۔\n\nاور اگر عالم کا الوجود (ہستی) اللہ کی طرف سے کسی ایسی نسبت (Relation) کے سبب ہوتا جس کے بغیر عالم موجود نہ ہوتا، تو اس نسبت کو ارادہ، یا مشیت، یا علم، یا جو کچھ بھی تم چاہو، کہہ سکتے تھے جو ممکن کے الوجود (ہستی) کا تقاضا کرتا ہے۔ اس صورت میں الحق (ذات حق) تعالیٰ بلا شک اس نسبت کے بغیر کچھ نہ کرتا۔ اور افتقار (محتاجی) کا معنی یہی ہے، اور یہ اللہ پر محال ہے۔ کیونکہ اللہ مطلق طور پر غنی ہے۔ پس وہ جیسا کہ اس نے فرمایا: غَنِيٌّ عَنِ الْعالَمِينَ (جہانوں سے بے نیاز ہے)۔\n\nاگر یہ کہا جائے کہ نسبت سے مراد عین ذات ہے، تو ہم کہیں گے کہ شے اپنی ذات کی محتاج نہیں ہو سکتی، کیونکہ وہ اپنی ذات کے لیے غنی ہے۔ اس طرح ایک ہی شے فقیر بھی ہوگی اور غنی بھی، اور یہ سب کچھ اس کی اپنی ذات کے لیے ہوگا، جو کہ محال ہے۔\n\nاور ہم زائد امر کی نفی کر چکے ہیں۔ اس کا تقاضا یہ ہے کہ عالم کا الوجود (ہستی)، چونکہ وہ بغیرہ (کسی دوسرے کے ذریعے) موجود ہے، واجب الوجود (واجب الوجود) لنفسہ کے ساتھ مربوط ہو۔ اور ممکن کی عین (حقیقت) واجب الوجود لنفسہ کے لیے ایجادی تاثیر کا محل ہے۔ اور اس کے سوا کوئی اور تصور نہیں کیا جا سکتا۔\n\nپس اس کی مشیت، اس کا ارادہ، اس کا علم، اور اس کی قدرت اس کی ذات ہے۔ اللہ تعالیٰ اس سے بہت بلند ہے کہ اس کی ذات میں کثرت ہو۔ بلکہ اس کے لیے وحدت مطلقہ ہے، اور وہ الواحد الاحد (ایک، اکیلا) ہے۔ الله الصَّمَدُ (اللہ بے نیاز ہے)۔ لَمْ يَلِدْ (نہ اس نے کسی کو جنا) تاکہ وہ مقدمہ ہو، اور لَمْ يُولَدْ (اور نہ وہ جنا گیا) تاکہ وہ نتیجہ ہو، اور لَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ (اور نہ کوئی اس کا ہمسر ہے) تاکہ اس کے ذریعے عالم کا الوجود (ہستی) الحق (ذات حق) کی دو مقدمات سے نتیجہ ہو۔ اور کفو (ہمسر) سے اللہ تعالیٰ بلند ہے۔\n\nاور اسی طرح اس نے اپنے آپ کو اپنی کتاب میں بیان کیا جب نبی صلی اللہ علیہ وسلم سے ان کے رب کی صفت کے بارے میں پوچھا گیا، تو سورۃ الاخلاص نازل ہوئی، جو اللہ تعالیٰ کو ان مقدس صفات اور اوصاف میں دوسروں کے ساتھ اشتراک سے پاک کرتی ہے۔ اس سورت میں جس چیز کی بھی نفی کی گئی ہے یا جس چیز کو بھی ثابت کیا گیا ہے، وہ یا تو بعض لوگوں کا اللہ کے بارے میں قول تھا جسے رد کیا گیا یا ثابت کیا گیا۔\n\nاور جب ہم نے تمہارے لیے بیان کر دیا کہ جس کے ہم محتاج ہیں، یعنی اللہ سبحانہ، اس کی کیا شان ہونی چاہیے، تو اب ہم اس چیز کو بیان کرتے ہیں جس پر ہم نے باب قائم کیا ہے۔\n\nجان لو کہ ازل (الأزل) کی نسبت اللہ کی طرف وہی ہے جو زمان (الزمان) کی نسبت ہماری طرف ہے۔ اور ازل (الأزل) ایک سلبی نعت (Negative Attribute) ہے جس کی کوئی عین (حقیقت) نہیں ہے۔ پس اس حقیقت سے کوئی الوجود (ہستی) نہیں ہو سکتا۔\n\nپس زمان (الزمان) ممکن کے لیے ایک متوہم الوجود (خیالی ہستی) کی نسبت ہے، نہ کہ موجودہ (حقیقی)۔ کیونکہ ہر وہ شے جسے تم فرض کرتے ہو، اس کے بارے میں \"کب؟\" (متى) کا سوال درست ہوتا ہے، اور \"کب؟\" زمان کے بارے میں سوال ہے۔ لہٰذا ضروری ہے کہ زمان ایک متوہم امر ہو، نہ کہ الوجود (ہستی)۔ اسی لیے الحق (ذات حق) نے اسے اپنی ذات پر اطلاق کیا اپنے اس قول میں: وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا (اور اللہ ہر چیز کو جاننے والا ہے) اور وَلِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ (اور اللہ ہی کے لیے ہے حکم پہلے بھی اور بعد میں بھی)۔ اور سنت میں سائل کے اس قول کی تائید ہے کہ \"ہمارا رب اپنی مخلوق کو پیدا کرنے سے پہلے کہاں تھا؟\" اگر زمان اپنی ذات میں ایک وجودی امر ہوتا، تو الحق (ذات حق) کو قید سے پاک کرنا درست نہ ہوتا، کیونکہ زمان کا حکم اسے مقید کر دیتا۔ پس ہم نے جان لیا کہ ان صیغوں کے نیچے کوئی وجودی امر نہیں ہے۔\n\n### [زمان: اس کا معقول اور مدلول]\n\nپھر ہم کہتے ہیں کہ لفظ زمان (الزمان) کے معقول (Concept) اور مدلول (Meaning) میں لوگوں نے اختلاف کیا ہے۔ حکماء اسے مختلف امور کے لیے استعمال کرتے ہیں، اور ان میں سے اکثر اس بات پر ہیں کہ یہ ایک متوہم مدت ہے جسے افلاک کی حرکات طے کرتی ہیں۔ متکلمین اسے ایک دوسرے امر کے لیے استعمال کرتے ہیں، اور وہ ہے ایک حادث کا دوسرے حادث کے ساتھ مقارنت (ملا ہونا) جس کے بارے میں \"کب؟\" (متى) سے سوال کیا جاتا ہے۔\n\nاور عرب اسے استعمال کرتے ہیں اور اس سے مراد رات اور دن لیتے ہیں، اور یہی اس باب میں ہمارا مطلوب ہے۔ رات اور دن، دن کی تفصیل کرتے ہیں۔ پس سورج کے طلوع ہونے سے لے کر غروب ہونے تک کا وقت \"دن\" کہلاتا ہے، اور سورج کے غروب ہونے سے لے کر اس کے طلوع ہونے تک کا وقت \"رات\" کہلاتا ہے۔ اور یہ مفصل عین (حقیقت) \"یوم\" (دن) کہلاتی ہے۔\n\nاور اس دن کا الوجود (ہستی) حرکت کبریٰ (عظیم حرکت) سے ظاہر ہوتا ہے۔ اور الوجود العینی (حقیقی ہستی) میں متحرک (حرکت کرنے والی شے) کے الوجود (ہستی) کے سوا کچھ نہیں ہے۔ اور وہ عین زمان (زمان کی حقیقت) ہے۔ پس اس کا حاصل یہ نکلا کہ زمان ایک متوہم امر ہے جس کی کوئی حقیقت نہیں ہے۔\n\nاور جب یہ بات مقرر ہو گئی، تو وہ معقول (Conceptual) اور مقدر (Estimated) دن ہی ہے جسے موجود زمان (الزمان الموجود) سے تعبیر کیا جاتا ہے۔ اور اسی سے جمعے، مہینے، سال اور دہر (ادوار) ظاہر ہوتے ہیں۔ اور انہیں ایام (دن) کہا جاتا ہے، اور ان کا اندازہ اسی چھوٹے، معمول کے دن سے لگایا جاتا ہے جسے رات اور دن نے تقسیم کیا ہے۔\n\nپس مقدر زمان (الزمان المقدر) وہ ہے جو اس چھوٹے دن سے زیادہ ہو جس سے تمام بڑے دنوں کا اندازہ لگایا جاتا ہے۔ چنانچہ کہا گیا: فِي يَوْمٍ كَانَ مِقْدَارُهُ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ (ایک دن میں جس کی مقدار تمہارے شمار کے مطابق ایک ہزار سال ہے)۔ اور فرمایا: فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ (ایک دن میں جس کی مقدار پچاس ہزار سال ہے)۔\n\n### [دجال کے مقدر (Estimated) ایام]\n\nاور نبی علیہ السلام نے دجال کے دنوں کے بارے میں فرمایا: \"ایک دن ایک سال کے برابر ہوگا، اور ایک دن ایک مہینے کے برابر ہوگا، اور ایک دن ایک ہفتے کے برابر ہوگا، اور اس کے باقی دن تمہارے دنوں کی طرح ہوں گے۔\"\n\nیہ شدید ہولناکی ہو سکتی ہے، اور اس اشکال کا حل حدیث کے اس حصے سے ظاہر ہوتا ہے جب عائشہ رضی اللہ عنہا نے پوچھا: \"اس دن نماز کا کیا کریں گے؟\" آپ نے فرمایا: \"اس کا اندازہ لگایا جائے گا۔\"\n\nاگر افلاک کی حرکات اپنی موجودہ حالت پر باقی نہ رہتیں اور ان میں خلل آ جاتا، تو اس کے لیے ان گھڑیوں کے ذریعے اندازہ لگانا درست نہ ہوتا جن کی صورت اہل علم بناتے ہیں اور جن کے ذریعے وہ بادلوں والے دنوں میں اوقات کا علم حاصل کرتے ہیں، جب سورج ظاہر نہیں ہوتا۔\n\nپس دجال کے ابتدائی خروج کے وقت بادلوں کی کثرت ہوگی اور وہ اس قدر مسلسل ہوں گے کہ بظاہر رات اور دن کا الوجود (ہستی) برابر ہو جائے گا۔ اور یہ ان عجیب اشکال میں سے ہے جو آخر زمان میں پیش آئیں گے۔ یہ متراکم بادل ہمارے اور آسمان کے درمیان حائل ہو جائیں گے، جبکہ حرکات ویسی ہی رہیں گی۔ پس حرکات ان عملی صنعتوں میں ظاہر ہوں گی جو ہیئت اور ستاروں کے مدار کے علماء نے بنائی ہیں۔ وہ ان کے ذریعے رات اور دن اور نمازوں کے اوقات کا بلا شک اندازہ لگائیں گے۔\n\nاور اگر وہ دن جو ایک سال کے برابر ہوگا، صرف ایک ہی دن ہوتا، تو ہم پر نمازوں کا اندازہ لگانا لازم نہ ہوتا۔ کیونکہ ہم سورج کے زوال کا انتظار کرتے ہیں۔ جب تک زوال نہ ہو، ہم مشروع ظہر کی نماز نہیں پڑھتے۔ اور اگر وہ بیس ہزار سال کی مقدار تک زوال نہ کرتا، تب بھی اللہ ہم پر اس کے سوا کوئی تکلیف نہ ڈالتا۔\n\nپس جب شارع (نبی صلی اللہ علیہ وسلم) نے عبادت کو تقدیر (اندازہ لگانے) کے ساتھ مقرر کیا، تو ہم نے جان لیا کہ افلاک کی حرکات اپنی جگہ پر ہیں اور ان کا نظام درہم برہم نہیں ہوا۔\n\n### [فردی وقت (الزمن الفرد) اور جوہر فرد (الجوهر الفرد)]\n\nمیں نے تمہیں بتا دیا کہ زمان کیا ہے، اور اس کی نسبت الوجود (ہستی) کی طرف اور نسبت تقدیر (اندازہ لگانے) کی طرف کیا معنی رکھتی ہے۔ پس ایام (دن) بہت ہیں، اور ان میں بڑے بھی ہیں اور چھوٹے بھی۔ ان میں سب سے چھوٹا الزمن الفرد (فردی وقت) ہے۔ اور اسی پر یہ آیت صادق آتی ہے: كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (وہ ہر دن ایک نئی شان میں ہے)۔\n\nپس الزمن الفرد (فردی وقت) کو یوم (دن) کہا گیا کیونکہ اس میں شان (امر) واقع ہوتا ہے۔ پس یہ زمانوں میں سب سے چھوٹا اور سب سے باریک ہے۔ اور اس کے سب سے بڑے کی کوئی حد نہیں جس پر ٹھہرا جا سکے۔ اور ان دونوں کے درمیان متوسط ایام ہیں، جن میں سب سے پہلا وہ دن ہے جو عرف میں معلوم ہے، اور اسے گھڑیاں تقسیم کرتی ہیں، اور گھڑیوں کو درجے تقسیم کرتے ہیں، اور درجوں کو دقائق (منٹ) تقسیم کرتے ہیں، اور اسی طرح یہ سلسلہ بعض لوگوں کے نزدیک لامتناہی (Endless) ہے۔ کیونکہ وہ دقائق کو ثوانی (سیکنڈ) میں تقسیم کرتے ہیں۔\n\nپس جب اس میں عدد کا حکم داخل ہوا، تو اس کا حکم عدد کا ہو گیا، اور عدد لامتناہی ہوتا ہے۔ لہٰذا اس میں تفصیل ختم نہیں ہوتی۔ اور بعض لوگ اس میں تناہي (ختم ہونے) کے قائل ہیں، اور وہ اسے معدود (شمار کی جانے والی شے) کے لحاظ سے دیکھتے ہیں۔ اور یہ وہ لوگ ہیں جو یہ ثابت کرتے ہیں کہ زمان کی ایک موجودہ عین (حقیقت) ہے۔ اور جو کچھ بھی الوجود (ہستی) میں داخل ہوا، وہ بلا شک متناہی (محدود) ہے۔\n\nاور مخالف کہتا ہے کہ معدود، چونکہ وہ شمار کیا جاتا ہے، اس لیے وہ الوجود (ہستی) میں داخل نہیں ہوتا، لہٰذا اسے تناہي سے موصوف نہیں کیا جا سکتا، کیونکہ عدد تناہي سے متصف نہیں ہوتا۔ اور اسی سے جوہر فرد (الجوهر الفرد) کے منکر دلیل پکڑتے ہیں، اور کہتے ہیں کہ جسم عقل میں لامتناہی طور پر تقسیم ہوتا ہے۔ اور یہ اہل نظر کے درمیان ایک اختلافی مسئلہ ہے جو عدم انصاف اور الفاظ کے مدلول کی تحقیق نہ کرنے کی وجہ سے پیدا ہوا۔\n\nاور صحیح خبر میں آیا ہے کہ دہر (الدهر) اللہ کے ناموں میں سے ایک ہے۔\n\nاور دہر (الدهر) کی معقولیت معلوم ہے، ہم ان شاء اللہ اس کتاب میں اس کا ذکر کریں گے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ ستائیسواں حصہ ختم ہوا۔",
    "fa": "(باب پنجاه و نهم در معرفت زمان موجود و زمان مقدر)\n\nاگر حاصل زمان را به تحقیق دریابی،\nمحقق است، اما به اوهام دانسته می‌شود.\nقوت آن در تأثیر، مانند طبیعت است،\nو عین (ذات) از آن و در آن، معدوم است.\nاشیاء به واسطه آن تعین یافتند، در حالی که\nعینی ندارد که حکمی بر آن جاری شود.\nعقل از درک صورت آن عاجز است،\nاز این رو می‌گوییم که دهر (الدهر) موهوم است.\nاگر تنزه (تنزیه) نبود، خداوند به آن نامیده نمی‌شد،\nهستی (الوجود) اوست، پس در قلب تعظیم دارد.\nاگر انصاف دهی، اصل زمان از ازل (أزل) است،\nپس حکم آن ازلی است و خود محکوم است.\nمانند خلأ (فضای خالی)، امتدادی است که انتهایی ندارد،\nدر غیر جسم، که به وهم در آن تجسیم (جسمیت) است.\n\n[اولیّت حق (الحق) و هستی (وجود) او، و اولیّت عالم و هستی (وجود) آن]\n\nنخست بدان که خداوند متعال همان اول است که هیچ چیز پیش از او اولیتی ندارد و هیچ چیز، چه قائم به او باشد و چه غیر قائم به او، همراه او اولیتی ندارد. پس او سبحانه در اولیّت خود واحد است. هیچ چیز واجب الوجود (واجب الوجود) بالذات نیست مگر او. او به طور مطلق از عالمیان بی‌نیاز است. خداوند متعال می‌فرماید: «فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ» (همانا خداوند از عالمیان بی‌نیاز است) به دلیل عقلی و شرعی.\n\nهستی (وجود) عالم از دو حال خارج نیست: یا هستی آن از جانب خداوند برای ذات اوست، یا برای امری زائد است که عین ذات او نیست. زیرا اگر عین ذات او بود، زائد نبود. و اگر عین ذات او بود، ذات او مرکب می‌شد و اولیّت برای آن امر زائد می‌بود، در حالی که فرض کردیم هیچ چیز همراه او یا پیش از او اولیتی ندارد. پس اگر آن امر زائد عین ذات او نباشد، یا وجود است یا لاوجود. محال است که لاوجود باشد، زیرا لاوجود نمی‌تواند اثر ایجادی در چیزی داشته باشد که به لاوجود توصیف شده است، و آن چیز عالم است. هیچ یک از آن دو (خداوند و عالم) برای تأثیر ایجادی بر دیگری اولویت ندارد، زیرا هر دو لاوجود هستند، و لاوجود اثری ندارد چون عدم است.\n\nو محال است که وجود باشد، زیرا در این صورت یا وجودش بالذات است یا نیست. محال است که وجودش بالذات باشد، زیرا دلیل بر محال بودن وجود دو واجب الوجود (واجب الوجود) بالذات در هستی (الوجود) اقامه شده است. پس باقی نمی‌ماند مگر اینکه وجودش به غیر باشد. و معنای امکان عالم (جهان) جز این نیست که وجودش به غیر است. پس عالم (جهان) یا خود آن غیر است یا از آن غیر است.\n\nو اگر هستی (وجود) عالم از جانب خداوند به واسطه نسبتی بود که اگر آن نسبت نبود، عالم (جهان) وجود نمی‌یافت، و آن نسبت را اراده یا مشیّت یا علم یا هر آنچه که وجود ممکن (موجود ممکن) اقتضا می‌کند بنامیم، در این صورت حق (الحق) تعالی بدون شک هیچ کاری را جز به واسطه آن نسبت انجام نمی‌دهد. و معنای افتقار (نیازمندی) جز این نیست، و این بر خداوند محال است، زیرا خداوند به طور مطلق بی‌نیاز است، پس همان‌طور که فرمود: «غَنِيٌّ عَنِ الْعالَمِينَ» (از عالمیان بی‌نیاز است).\n\nاگر گفته شود که منظور از آن نسبت، عین ذات اوست، می‌گوییم: شیء به خودش نیازمند نمی‌شود، زیرا او بالذات بی‌نیاز است. در این صورت، یک شیء واحد از جهتی که بی‌نیاز است، فقیر (نیازمند) خواهد بود، و همه این‌ها برای ذات اوست، و این محال است. ما امر زائد را نفی کردیم، پس این اقتضا می‌کند که هستی (وجود) عالم، از آن جهت که موجود به غیر است، به واجب الوجود (واجب الوجود) بالذات مرتبط باشد، و عین ممکن (موجود ممکن) محل تأثیر واجب الوجود بالذات به واسطه ایجاد است، و جز این قابل تعقل نیست.\n\nپس مشیّت، اراده، علم و قدرت او، عین ذات اوست. خداوند بسیار برتر است از اینکه در ذاتش کثرت یابد، بلکه وحدت مطلقه از آن اوست، و اوست الواحد الأحد (یگانه یکتا): «الله الصَّمَدُ» (خداوند بی‌نیاز است). «لَمْ يَلِدْ» (نزاده است) که مقدمه باشد، و «وَلَمْ يُولَدْ» (و زاده نشده است) که نتیجه باشد، و «وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ» (و هیچ کس همتای او نبوده است) که به واسطه آن، هستی (وجود) عالم (جهان) نتیجه‌ای از دو مقدمه (حق و کفو) باشد. خداوند متعال برتر است. و بدین‌سان خداوند سبحانه خود را در کتابش وصف کرد، هنگامی که از پیامبر (صلی الله علیه و سلم) درباره صفت پروردگارش سؤال شد، سوره اخلاص نازل شد که از اشتراک با غیر، در آن اوصاف و نعوت مقدسه، مبرا است. هیچ چیزی در این سوره نفی یا اثبات نشده است، مگر اینکه آن امر منفی یا مثبت، قولی درباره خداوند بوده که برخی از مردم قائل به آن بودند.\n\nو پس از آنکه برای تو بیان کردیم آنچه را که شایسته است کسی که ما به او نیازمندیم (یعنی خداوند سبحانه) بر آن باشد، اکنون آنچه را که برای آن باب گشوده‌ایم بیان می‌کنیم. بدان که نسبت ازل (أزل) به خداوند، مانند نسبت زمان به ماست. و نسبت ازل (أزل) یک نعت سلبی است که عینی ندارد، پس از این حقیقت، هستی (وجود) حاصل نمی‌شود. بنابراین، زمان برای ممکن (موجود ممکن) نسبتی است که هستی (وجود) آن موهوم است نه موجود، زیرا هر چیزی را که فرض کنی، سؤال «متی» (چه وقت) درباره آن صحیح است، و «متی» سؤالی درباره زمان است. پس ناگزیر زمان باید امری موهوم باشد نه موجود. به همین دلیل، حق (الحق) آن را بر خود اطلاق کرده است در این فرموده: «وَكَانَ الله بِكُلِّ شَيْ‏ءٍ عَلِيماً» (و خداوند به هر چیزی داناست) و «وَلِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ» (و امر از پیش و پس از آن، از آنِ خداست). و در سنت (حدیث) نیز تأیید قول سؤال‌کننده آمده است که: «پروردگار ما پیش از آنکه خلقش را بیافریند کجا بود؟» اگر زمان امری وجودی بالذات بود، تنزیه حق (الحق) از تقیید صحیح نبود، زیرا حکم زمان او را مقید می‌ساخت. پس دانستیم که زیر این صیغه‌ها، امر وجودی‌ای نیست.\n\n[زمان: معقول و مدلول آن]\n\nسپس می‌گوییم که مردم در معقول و مدلول لفظ زمان اختلاف کرده‌اند. حکما آن را در برابر امور مختلفی اطلاق می‌کنند و بیشتر آن‌ها بر این عقیده‌اند که زمان، مدتی موهوم است که حرکات افلاک آن را قطع می‌کند. متکلمان آن را در برابر امر دیگری اطلاق می‌کنند و آن مقارنت حادثی با حادث دیگر است که با «متی» (چه وقت) از آن سؤال می‌شود. و عرب آن را اطلاق می‌کند و منظورشان شب و روز است، و این همان مطلوب ما در این باب است. شب و روز، فصول روز هستند. از طلوع خورشید تا غروب آن، روز (نهار) نامیده می‌شود، و از غروب خورشید تا طلوع آن، شب (لیل) نامیده می‌شود. و این عین مفصّل، روز نامیده می‌شود. و آنچه وجود این روز را آشکار کرده، وجود حرکت کبری است. و در هستی عینی (الوجود العینی) جز وجود متحرک نیست، و آن عین زمان است. پس حاصل این امر به اینجا باز می‌گردد که زمان، امری موهوم است و حقیقتی ندارد.\n\nو چون این امر مقرر شد، پس روز معقول مقدر، همان است که از آن به زمان موجود تعبیر می‌شود. و به واسطه آن، هفته‌ها، ماه‌ها، سال‌ها و دهرها (الدهور) ظاهر می‌شوند و ایام نامیده می‌شوند و به واسطه این روز کوچک‌تر و معمول که شب و روز آن را فصل داده‌اند، اندازه‌گیری می‌شوند. پس زمان مقدر، آن چیزی است که بر این روز کوچک‌تر افزوده می‌شود و سایر روزهای بزرگ با آن اندازه‌گیری می‌شوند. چنانکه در مورد روزی گفته می‌شود: «فِي يَوْمٍ كَانَ مِقْدَارُهُ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ» (در روزی که مقدار آن هزار سال از آن چیزی است که شما می‌شمارید) و در مورد روزی دیگر فرمود: «فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ» (در روزی که مقدار آن پنجاه هزار سال است).\n\n[ایام مقدر دجال]\n\nو پیامبر (علیه السلام) درباره روزهای دجال فرمود: «روزی مانند یک سال، و روزی مانند یک ماه، و روزی مانند یک هفته، و سایر روزهایش مانند روزهای شماست.»\n\nاین شدت هولناک ممکن است به این دلیل باشد. رفع اشکال در ادامه حدیث در قول عایشه (رضی الله عنها) ظاهر است که پرسید: «در آن روز چگونه نماز بخوانیم؟» فرمود: «برای آن اندازه‌گیری می‌شود.» اگر امر در حرکات افلاک بر همان حال که هست باقی نمی‌ماند و مختل نمی‌شد، صحیح نبود که برای آن به واسطه ساعاتی که اهل این علم صورت آن را می‌سازند، اندازه‌گیری شود. آن‌ها به واسطه آن ساعات، اوقات را در روزهای ابری می‌دانند، زیرا خورشید ظاهر نیست. پس در ابتدای خروج دجال، ابرها زیاد می‌شوند و پی در پی می‌آیند، به طوری که وجود شب و روز در ظاهر چشم یکسان می‌شود. و این از اشکال غریبی است که در آخرالزمان رخ می‌دهد. آن ابر متراکم بین ما و آسمان حائل می‌شود، در حالی که حرکات (افلاک) همان‌گونه که هستند باقی می‌مانند. پس حرکات در مصنوعات عملی که اهل صنعتِ علمای هیئت و مجاری نجوم ساخته‌اند، ظاهر می‌شود و به واسطه آن‌ها شب و روز و ساعات نمازها را بدون شک اندازه‌گیری می‌کنند. اگر آن روز که مانند یک سال است، یک روز واحد بود، لازم نبود که برای نمازها اندازه‌گیری کنیم، زیرا ما منتظر زوال خورشید هستیم. تا زمانی که زوال رخ ندهد، نماز ظهر مشروع را نمی‌خوانیم. و اگر (خورشید) بیست هزار سال هم زوال نکند، خداوند ما را به غیر از آن مکلف نکرده است. پس چون شارع (قانون‌گذار) عبادت را به تقدیر (اندازه‌گیری) مقرر کرد، دانستیم که حرکات افلاک بر جای خود باقی است و نظام آن‌ها مختل نشده است.\n\n[زمان فرد و جوهر فرد]\n\nپس تو را آگاه ساختم که زمان چیست و معنای نسبت هستی (الوجود) و نسبت تقدیر (اندازه‌گیری) به آن چیست. روزها بسیارند و از آن‌ها بزرگ و کوچک وجود دارد. کوچک‌ترین آن‌ها «زمان فرد» است، و بر این اساس است که آیه «كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» (هر روز او در کاری است) تفسیر می‌شود. پس زمان فرد، روز نامیده شد، زیرا شأن (کار الهی) در آن رخ می‌دهد. این کوچک‌ترین و دقیق‌ترین زمان‌هاست، و برای بزرگ‌ترین آن‌ها حدی نیست که بتوان در آن متوقف شد. و بین این دو، روزهای متوسطی وجود دارد که اولین آن‌ها روزی است که در عرف معلوم است و ساعات آن را فصل می‌دهد، و ساعات را درجه‌ها، و درجه‌ها را دقیقه‌ها، و همین‌طور تا بی‌نهایت نزد برخی از مردم، زیرا آن‌ها دقیقه‌ها را به ثانیه‌ها تقسیم می‌کنند. چون حکم عدد در آن وارد شد، حکم آن، حکم عدد است و عدد متناهی نیست، پس تفصیل در آن پایان نمی‌پذیرد. و برخی از مردم قائل به تناهی در این امر هستند و از جهت معدود به آن می‌نگرند، و اینان کسانی هستند که برای زمان عینی موجود قائل‌اند، و هر آنچه وارد هستی (الوجود) شود، بدون شک متناهی است. و مخالف می‌گوید: معدود از آن جهت که آنچه وارد هستی (الوجود) شده را می‌شمارد، به تناهی وصف نمی‌شود، زیرا عدد متصف به تناهی نیست. و به همین دلیل، منکر جوهر فرد (الجوهر الفرد) احتجاج می‌کند که جسم در عقل تا بی‌نهایت قابل تقسیم است. و این مسئله اختلافی بین اهل نظر است که از عدم انصاف و بحث درباره مدلول الفاظ پدید آمده است. و در خبر صحیح وارد شده است که «الدهر» (دهر) از اسماء خداوند است. و معقولیت دهر (الدهر) معلوم است که ان‌شاءالله تعالی آن را در این کتاب ذکر خواهیم کرد. «وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند). جزء بیست و هفتم به پایان رسید."
  },
  "page_count": 3
}