{
  "id": 34,
  "title": {
    "ar": "الباب الرابع والثلاثون في معرفة شخص تحقق في منزل الأنفاس فعاين منها أمورا أذكرها إن شاء الله",
    "en": "Chapter Thirty-Four: Regarding the knowledge of an individual who attained realization in the station of the Breaths, and witnessed therein matters which I shall mention, God willing.",
    "ur": "چونتیسواں باب: اس شخص کی معرفت کے بیان میں جس نے منزل الأنفاس (منزل الأنفاس) میں تحقق حاصل کیا، اور اس میں ایسے امور کا مشاہدہ کیا جن کا ذکر میں ان شاء اللہ کروں گا۔",
    "fa": "باب سی و چهارم: در معرفت (معرفة) شخصی که در منزل (منزل) انفاس (الأنفاس) تحقق (تحقق) یافت و از آن اموری را مشاهده کرد که به خواست خداوند ذکر خواهم کرد."
  },
  "content": {
    "ar": "## (الباب الرابع والثلاثون في معرفة شخص تحقق في منزل الأنفاس فعاين منها أمورا أذكرها إن شاء الله)\n\n\n> إن المحقق بالأنفاس رحمان *** فالعرش في حقه إن كان إنسان‏\n\n\n> وإن توجه نحو العين يطلبها *** له العماء وإحسان فإحسان‏\n\n\n> مقامه باطن الأعراف يسكنه *** يزوره فيه أنصار وأعوان‏\n\n\n> له من الليل إن حققت آخره *** كما له من وجود العين إنسان‏\n\n\n> إن لاح ظاهره تقول قرآن *** أو لاح باطنه تقول فرقان‏\n\n\n> قد جمع الله فيه كل منقبة *** فهو الكمال الذي ما فيه نقصان‏\n\n\n### [الإدراكات والمعلومات‏]\n\n\nاعلم أيدك الله بروح القدس أن المعلومات مختلفة لأنفسها وأن الإدراكات التي تدرك بها المعلومات مختلفة أيضا لأنفسها كالمعلومات ولكن من حيث أنفسها وذواتها لا من حيث كونها إدراكات وإن كانت مسألة خلاف عند أرباب النظر وقد جعل الله لكل حقيقة مما يجوز أن يعلم إدراكا خاصا عادة لا حقيقة أعني محلها وجعل المدرك بهذه الإدراكات لهذه المدركات عينا واحدة وهي ستة أشياء سمع وبصر وشم ولمس وطعم وعقل وإدراك جميعها للأشياء ما عدا العقل ضروري ولكن الأشياء التي ارتبطت بها عادة لا تخطئ أبدا وقد غلط في هذا جماعة من العقلاء ونسبوا الغلط للحس وليس كذلك وإنما الغلظ للحاكم‏\n\n\n### [المعرفة العقلية والحسية]\n\n\nوأما إدراك العقل المعقولات فهو على قسمين منه ضروري مثل سائر الإدراكات ومنه ما ليس بضروري بل يفتقر في علمه إلى أدوات ست منها الحواس الخمس التي ذكرناها ومنها القوة المفكرة ولا يخلو معلوم يصح أن يعلمه مخلوق أن يكون مدركا بأحد هذه الإدراكات وإنما قلنا إن جماعة غلطت في إدراك الحواس فنسبت إليها الأغاليط وذلك أنهم رأوا إذا كانوا في سفينة تجري بهم مع‏\nالساحل رأوا الساحل يجري بجري السفينة فقد أعطاهم البصر ما ليس بحقيقة ولا معلوم أصلا فإنهم عالمون علما ضروريا أن الساحل لم يتحرك من مكانه ولا يقدرون على إنكار ما شاهدوه من التحرك وكذلك إذا طعموا سكرا أو عسلا فوجدوه مرا وهو حلو فعلموا ضرورة أن حاسة الطعم غلطت عندهم ونقلت ما ليس بصحيح والأمر عندنا ليس كذلك ولكن القصور والغلط وقع من الحاكم الذي هو العقل لا من الحواس فإن الحواس إدراكها لما تعطيه حقيقتها ضروري كما إن العقل فيما يدركه بالضرورة لا يخطئ وفيما يدركه بالحواس أو بالفكر قد يغلط فما غلط حس قط ولا ما هو إدراكه ضروري فلا شك أن الحس رأى تحركا بلا شك ووجد طعما مرا بلا شك فأدرك البصر التحرك بذاته وأدرك الطعم قوة المرارة بذاته وجاء عقل فحكم إن الساحل متحرك وأن السكر مر وجاء عقل آخر وقال إن الخلط الصفراوي قام بمحل الطعم فأدرك المرارة وحال ذلك الخلط بين قوة الطعم وبين السكر فاذن فما ذاق الطعم إلا مرارة الصفراء فقد أجمع العقلان من الشخصين على أنه أدرك المرارة بلا شك واختلف العقلان فيما هو المدرك للطعم فبان إن العقل غلط لا الحس فلا ينسب الغلط أبدا في الحقيقة إلا للحاكم لا للشاهد وعندي في هذه المسألة أمر آخر يخالف ما ادعوه وهو أن الحلاوة التي في الحلو وغير ذلك من المطعومات ليس هو في المطعوم لأمر إذا بحثت عليه وجدت صحة ما ذهبنا إليه وكذا الحكم في سائر الإدراكات ولو كان في العادة فوق العقل مدرك آخر يحكم على العقل ويأخذ عنه كما يحكم العقل على الحس لغلط أيضا ذلك المدرك الحاكم فيما هو للعقل ضروري وكان يقول إن العقل غلط فيما هو له ضروري‏\n\n\n### [الإدراك الخارق للعادة والمعرفة الصوفية]\n\n\nفإذا تقرر هذا وعرفت كيف رتب الله المدركات والإدراكات وأن ذلك الارتباط أمر عادي فاعلم إن لله عبادا آخرين خرق لهم العادة في إدراكهم العلوم فمنهم من جعل له إدراك ما يدرك بجميع القوي من المعقولات والمحسوسات بقوة البصر خاصة وآخر بقوة السمع وهكذا بجميع القوي ثم بأمور عرضية خلاف القوي من ضرب وحركة وسكون وغير ذلك‏\n\n\nقال رسول الله صلى الله عليه وسلم إن الله ضرب بيده بين كتفي فوجدت برد أنامله بين ثديي فعلمت علم الأولين والآخرين‏\n\n\nفدخل في هذا العلم كل معلوم معقول ومحسوس مما يدركه المخلوق فهذا علم حاصل لا عن قوة من القوي الحسية والمعنوية فلهذا قلنا إن ثم سببا آخر خلاف هذه القوي تدرك به المعلومات وإنما قلنا قد تدرك العلوم بغير قواها المعتادة فحكمنا على هذه الإدراكات لمدركاتها المعتادة بالعادة من أجل المتفرس فينظر صاحب الفراسة في الشخص فيعلم ما يكون منه أو ما خطر له في باطنه أو ما فعل وكذلك الزاجر وأشباهه وإنما جئنا بهذا كله تأنيسا لما نريد أن ننسبه إلى أهل الله من الأنبياء والأولياء فيما يدركونه من العلوم على غير الطرق المعتادة فإذا أدركوها نسبوا إلى تلك الصفة التي أدركوا بها المعلومات فيقولون فلان صاحب نظر أي بالنظر يدرك جميع المعلومات وهذا ذقته مع رسول الله صلى الله عليه وسلم وفلان صاحب سمع وفلان صاحب طعم وصاحب نفس وأنفاس يعني الشم وصاحب لمس وفلان صاحب معنى وهذا خارج عن هؤلاء بل هو كما يقال في العامة صاحب فكر صحيح فمن الناس من أعطى النظر إلى آخر القوي على قدر ما أعطى وهو له عادة إذا استمر ذلك عليه لأنه مشتق من العود أي يعود ذلك عليه في كل نظرة أو في كل شم ما ثم غير ذلك‏\n\n\n### [الأسماء الإلهية والمعارف الصوفية المعرفة]\n\n\nوكذلك أيضا لتعلم إن الأسماء الإلهية مثل هذا وأن كل اسم يعطي حقيقة خاصة ففي قوته أن يعطي كل واحد من الأسماء الإلهية ما تعطيه جميع الأسماء قال تعالى قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ وكذلك لو ذكر كل اسم لقال فيه إن له الأسماء الحسنى وذلك لاحدية المسمى فاعلم ذلك فمن الناس من يختص به الاسم الله فتكون معارفه إلهية ومنهم من يختص به الاسم الرحمن فتكون معارفه رحمانية كما كانت في القوي الكونية يقال فيها معارف هذا الشخص نظرية وفي حق آخر سمعية فهو من عالم النظر وعالم السمع وعالم الأنفاس هكذا تنسب معارفه في الإلهيات إلى الاسم الإلهي الذي فتح له فيه فتندرج فيه حقائق الأسماء كلها\n\n\n### [المعرفة الرحمانية ومنزل الأنفاس‏]\n\n\nفإذا علمت هذا أيضا فاعلم إن الذي يختص بهذا الباب من الأسماء الإلهية لهذا الشخص المعين الاسم الرحمن والذي يختص به من القوي فينسب إليها قوة الشم ومتعلقها الروائح وهي الأنفاس فهو من عالم الأنفاس في نسبة القوي ومن الرحمانيين في مراتب الأسماء فنقول إن هذا الشخص المعين في هذا الباب سواء كان زيدا أو عمرا معرفته رحمانية فكل أمر ينسب إلى الاسم الرحمن‏\nفي كتاب أو سنة فإنه ينسب إلى هذا الشخص فإن هذا الاسم هو الممد له وليس لاسم إلهي عليه حكم إلا بوساطة هذا الاسم على أي وجه كان ولهذا نقول إن الله سبحانه قد أبطن في مواضع رحمته في عذابه ونقمته كالمريض الذي جعل في عذابه بالمرض رحمته به فيما يكفر عنه من الذنوب فهذه رحمة في نقمة وكذلك من انتقم منه في إقامة الحد من قتل أو ضرب فهو عذاب حاضر فيه رحمة باطنة بها ارتفعت عنه المطالبة في الدار الآخرة كما أنه في نعمته في الدنيا من الاسم المنعم أبطن نقمته فهو ينعم الآن بما به يتعذب لبطون العذاب فيه في الدار الآخرة أو في زمان التوبة فإن الإنسان إذا ناب ونظر وفكر فيما تلذذ به من المحرمات تعود تلك الصور المستحضرة عليه عذابا وكان قبل التوبة حين يستحضرها في ذهنه يلتذ بها غاية اللذة فسبحان من أبطن رحمته في عذابه وعذابه في رحمته ونعمته في نقمته ونقمته في نعمته فالمبطون أبدا هو روح العين الظاهرة أي شي‏ء كان فهذا الشخص لما كانت معرفته رحمانية وكان الاسم الرحمن استوى على العرش فقال تعالى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ كانت همة هذا الشخص عرشية فكما كان العرش للرحمن كانت الهمة لهذه المعرفة محلا لاستوائها فقيل همته عرشية ومقام هذا الشخص باطن الأعراف وهو السور الذي بين أهل السعادة والشقاوة للاعراف رجال سيذكرون وهم الذين لم تقيدهم صفة كأبي يزيد وغيره وإنما كان مقامه باطن الأعراف لأن معرفته رحمانية وهمته عرشية فإن العرش مستوي الرحمن كذلك باطن الأعراف فيه الرحمة كما إن ظاهره فيه العذاب‏\n\n\n### [الرحمة عرش الذات الإلهية]\n\n\nفهذا الشخص له رحمة بالموجودات كلها بالعصاة والكفار وغيرهم‏\n\n\nقال تعالى لسيد هذا المقام وهو محمد صلى الله عليه وسلم حين دعا على رعل وذكوان وعصية بالعذاب والانتقام فقال عليك بفلان وفلان وذكر ما كان منهم قال الله له إن الله ما بعثك سبابا ولا لعانا ولكن بعثك رحمة\n\n\nفنهى عن الدعاء عليهم وسبهم وما يكرهون وأنزل الله عز وجل عليه وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ فعم العالم أي لترحمهم وتدعوني لهم لا عليهم فيكون عوض قوله لعنهم الله تاب الله عليهم وهداهم كما\n\n\nقال حين جرحوه اللهم اهد قومي فإنهم لا يعلمون‏\n\n\nيريد من كذبه من غير أهل الكتاب والمقلدة من أهل الكتاب لا غيرهم فلهذا قلنا في حق هذا الشخص صاحب هذا المقام إنه رحيم بالعصاة والكفار فإذا كان حاكما هذا الشخص وأقام الحد أو كان ممن تتعين عليه شهادة في إقامة حد فشهد به أو أقامه فلا يقيمه إلا من باب الرحمة ومن الاسم الرحمن في حق المحدود والمشهود عليه لا من باب الانتقام وطلب التشفي لا يقتضيه مقام هذا الاسم فلا يعطيه حاله هذا الشخص قال تعالى في قصة إبراهيم إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ‏\n\n\n### [استوائية العرش وأينية العماء]\n\n\nومن كان هذا مقامه ومعرفته وهذا الاسم الرحمن ينظر إليه فيعاين من الأسرار ذوقا ما بين نسبة الاستواء إلى العرش وما بين نسبة الأين إلى العماء هل هما على حد واحد أو يختلف ويعلم ما للحق من نعوت الجلال واللطف معا بين العماء والاستواء إذ قد كان في العماء ولا عرش فيوصف بالاستواء عليه ثم خلق العرش واستوى عليه بالاسم الرحمن وللعرش حد يتميز به من العماء الذي هو الاسم الرب وللعماء حد يتميز به عن العرش ولا بد من انتقال من صفة إلى صفة فما كان نعته تعالى بين العماء والعرش أو بأي نسبة ظهر بينهما إذ قد تميز كل واحد منهما عن صاحبه بحده وحقيقته كما يتميز العماء الذي فوقه الهواء وتحته الهواء وهو السحاب الرقيق الذي يحمله الهواء الذي تحته وفوقه عن العماء الذي ما فوقه هواء وما تحته هواء فهو عماء غير محمول فيعلم السامع أن العماء الذي جعل للرب أينية أنه عماء غير محمول ثم جاء قوله تعالى هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ الله في ظُلَلٍ من الْغَمامِ فهل هذا الغمام هو راجع إلى ذلك العماء فيكون العماء حاملا للعرش ويكون العرش مستوي الرحمن فتجمع القيامة بين العماء والعرش أو هو هذا المقام المقصود الذي فوقه هواء وتحته هواء فصاحب هذا المقام يعطي علم ذلك كله‏\n\n\n### [نزول الرب من العرش إلى سماء الدنيا]\n\n\nثم إن صاحب هذا المقام يعطي أيضا من العلوم الإلهية من هذا النوع بالاسم الرحمن نزول الرب إلى سماء الدنيا من العرش يكون هذا النزول أو من العماء فإن العماء إنما\n\n\nورد حين وقع السؤال عن الاسم الرب فقيل له أين كان ربنا قبل أن يخلق خلقه فقال كان في عماء ما فوقه هواء وما تحته هواء\n\n\nفاسم كان المضمر هو ربنا وقال ينزل ربنا إلى السماء\n\n\nفيدلك هذا على إن نزوله إلى السماء الدنيا من ذلك العماء كما كان استواءه على العرش من ذلك العماء فنسبته إلى السماء الدنيا كنسبته إلى العرش لا فرق فما فارق العرش في نزوله إلى السماء الدنيا ولا فارق العماء في نزوله إلى‏\nالعرش ولا إلى السماء الدنيا ولما\n\n\nأخبر النبي صلى الله عليه وسلم أن الله يقول في هذا النزول إلى السماء الدنيا هل من تائب فأتوب عليه هل من مستغفر فاغفر له هل من سائل فأعطيه هل من داع فأجيبه‏\n\n\nفهذا كله من باب رحمته ولطفه وهذا حقيقة الاسم الرحمن الذي اسْتَوى‏ عَلَى الْعَرْشِ فنزلت هذه الصفة مع الاسم الرب إلى السماء الدنيا فهو ما أعلمناك به إن كل اسم إلهي يتضمن حكم جميع الأسماء الإلهية من حيث إن المسمى واحد\n\n\n### [نزول الرب من العماء إلى السماء]\n\n\nفيعلم صاحب هذا المقام من هذا النزول الرباني السماوي ما يختص بالاسم الرحمن منه الذي قال به هل من تائب هل من مستغفر فإن الرحمن يطلب هذا القول بلا شك فهذا حظ ما يعلم صاحب هذا المقام من هذا النزول بلا واسطة ويعلم نزول الرب من العماء إلى السماء بوساطة الاسم الرحمن لأنه ليس للاسم الرب على صاحب هذا المقام سلطان فإنه كما قلنا الاسم الرحمن فلا يعلم من الاسم الرب ولا غيره أمرا إلا بالاسم الرحمن فيعلم عند ذلك بإعلام الرحمن إياه ما أراد الحق بنزوله من العماء إلى السماء على هذا الوجه هي معرفته‏\n\n\n### [قلب المؤمن عرش الرحمن‏]\n\n\nثم مما يختص بعلمه صاحب هذا المقام بوساطة الاسم الرحمن علم‏\n\n\nقول الله ما وسعني أرضي ولا سمائي ووسعني قلب عبدي المؤمن‏\n\n\nفأتى بياء الإضافة في السعة والعبودية فلم يأخذ من الله إلا قدر ما تعطيه الياء خاصة ويتضمن هذا علمين علما بما فيه من العناية بعبده المؤمن فيأخذه من الاسم الرحمن بذاته وعلما بما فيه من سر الإضافة بحرف الياء فيأخذه من الله بترجمة الاسم الرحمن فيعلم إن للسعة هنا المراد بها الصورة التي خلق الإنسان عليها كأنه يقول ما ظهرت أسمائي كلها إلا في النشأة الإنسانية قال تعالى وعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها أي الأسماء الإلهية التي وجدت عنها الأكوان كلها ولم تعطها الملائكة وقال صلى الله عليه وسلم إن الله خلق آدم على صورته‏\n\n\nوإن كان الضمير عندنا متوجها أن يعود على آدم فيكون فيه رد على بعض النظار من أهل الأفكار ويتوجه أن يعود على الله لتخلقه بجميع الأسماء الإلهية فعلمت إن هذه السعة إنما قبلها العبد المؤمن لكونه على الصورة كما قبلت المرآة صورة الرائي دون غيرها مما لا صقالة فيه ولا صفاء ولم يكن هذا للسماء لكونها شفافة ولا للأرض لكونها غير مصقولة فدل على إن خلق الإنسان وإن كان عن حركات فلكية هي أبوه وعن عناصر قابلة وهي أمه فإن له من جانب الحق أمرا ما هو في آبائه ولا في أمهاته من ذلك الأمر وسع جلال الله تعالى إذ لو كان ذلك من قبل أبيه الذي هو السماء أو أمه التي هي الأرض أو منهما لكان السماء والأرض أولى بأن يسعا الحق ممن تولد عنهما ولا سيما والله تعالى يقول لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ يريد في المعنى لا في الجرمية ومع هذا فاختص الإنسان بأمر أعطاه هذه السعة التي ضاق عنها السماء والأرض فلم تكن له هذه السعة إلا من حيث أمر آخر من الله فضل به على السماء والأرض فكل واحد من العالم فاضل مفضول فقد فضل كل واحد من العالم من فضله لحكمة الافتقار والنقص الذي هو عليه كل ما سوى الله فإن الإنسان إذا زها بهذه السعة وافتخر على الأرض والسماء جاءه قوله تعالى لَخَلْقُ السَّماواتِ والْأَرْضِ أَكْبَرُ من خَلْقِ النَّاسِ وإذا زهت السماء والأرض بهذه الآية على الإنسان جاء\n\n\nقوله ما وسعني أرضي ولا سمائي ووسعني قلب عبدي‏\n\n\nفأزال عنه هذا العلم ذلك الزهو والفخر وعنهما وافتقر الكل إلى ربه وانحجب عن زهوه ونفسه وقوله ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ يدل على إن بعض الناس يعلم ذلك وعلم هذا من علمه منا من الاسم الرحمن الذي هو له وبه تحقق فَسْئَلْ به خَبِيراً فرحمه عند ما زها بعلم ما فضل به على السماء والأرض وعلم من ذلك أنه ما حصل له من الاسم الرحمن إلا قدر ما كشف له مما فيه دواؤه فإن ذلك الأمر الذي به فضل السماء والأرض هذا العبد هو أيضا من الاسم الرحمن ما جاد به على هذا العبد\n\n\n### [الإنسان نسخة جامعة]\n\n\nولا تقول إن هذا طعن في كونه نسخة من العالم بل هو على الحقيقة نسخة جامعة باعتبار إن فيه شيئا من السماء بوجه ما ومن الأرض بوجه ما ومن كل شي‏ء بوجه ما لا من جميع الوجوه فإن الإنسان على الحقيقة من جملة المخلوقات لا يقال فيه إنه سماء ولا أرض ولا عرش ولكن يقال فيه إنه يشبه السماء من وجه كذا والأرض من وجه كذا والعرش من وجه كذا وعنصر النار من وجه كذا وركن الهواء من وجه كذا والماء والأرض وكل شي‏ء في العالم فبهذا الاعتبار يكون نسخة وله اسم الإنسان كما للسماء اسم السماء\n\n\n### [النزول القرآني والتنزل الفرقاني‏]\n\n\nومن علوم صاحب هذا المقام نزول القرآن فرقانا لا قرآنا فإذا علمه قرآنا فليس من الاسم الرحمن وإنما الاسم الرحمن ترجم له عن اسم آخر إلهي يتضمنه الاسم الرحمن وأنه نزل في ليلة مباركة وهي ليلة القدر\nفعرف بنزوله مقادير الأشياء وأوزانها وعرف بقدره منها كما نزل الرب تعالى في الثلث الباقي من الليل فالليل محل النزول الزماني للحق وصفته التي هي القرآن وكان الثلث الباقي من الليل في نزول الرب غيب محمد صلى الله عليه وسلم وغيب هذا النوع الإنساني فإن الغيب ستر والليل ستر وسمي هذا الباقي من الليل الثلث لأن هذه النشأة الإنسانية لها البقاء دائما في دار الخلود فإن الثلثين الأولين ذهبا بوجود الثلث الباقي أو الآخر من الليل فيه نزل الحق فأوجب له البقاء أيضا وهو ليل لا يعقبه صباح أبدا فلا يذهب لكن ينتقل من حال إلى حال ومن دار إلى دار كما ينتقل الليل من مكان إلى مكان أمام الشمس وإنما يفر أمامها لئلا تذهب عينه إذ كان النور ينافي الظلمة وتنافيه غير أن سلطان النور أقوى فالنور ينفر الظلمة والظلمة لا تنفر النور وإنما هو النور ينتقل فتظهر الظلمة في الموضع الذي لا عين للنور فيه أ لا ترى الحق تسمى بالنور ولم يتسم بالظلمة إذ كان النور وجودا والظلمة عدما وإذ كان النور لا تغالبه الظلمة بل النور الغالب كذلك الحق لا يغالبه الخلق بل الحق الغالب فسمى نفسه نورا\n\n\n### [الإنسان هو الثلث الباقي من ليل الوجود]\n\n\nفتذهب السماء وهو الثلث الأول من الليل وتذهب الأرض وهو الثلث الثاني من الليل ويبقى الإنسان في الدار الآخرة أبد الآبدين إلى غير نهاية وهو الثلث الباقي من الليل وهو الولد عن هذين الأبوين السماء والأرض فنزل القرآن في الليلة المباركة في الثلث الآخر منها وهو الإنسان الكامل ففرق فيه كل أمر حكيم فتميز عن أبويه بالبقاء نَزَلَ به الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ هو محمد صلى الله عليه وسلم أ لا ترى الشارع كيف‏\n\n\nقال في ولد الزنا إنه شر الثلاثة وكذلك ولد الحلال خير الثلاثة\n\n\nمن هذا الوجه خاصة فإن الماء الذي خلق منه الولد من الرجل والمرأة أراد الخروج وهو الماء الذي تكون منه الولد وهو الأمر الثالث فحرك لما أراد الخروج الأبوين للنكاح ليخرج وكان تحريكه لهما على غير وجه مرضي شرعا يسمى سفاحا فقيل فيه إنه شر الثلاثة أي هو سبب الحركة التي بها انطلق عليهم اسم الشر فجعله ثلاثة أثلاث الأبوان ثلثان والولد ثالث كذلك قسم الليل على ثلاثة أثلاث ثلثان ذاهبان وهما السماء والأرض وثلث باق وهو الإنسان وفيه ظهرت صورة الرحمن وفيه نزل القرآن وإنما سميت السماء والأرض ليلا لأن الظلمة لها من ذاتها والإضاءة فيها من غيرها من الأجسام المستنيرة التي هي الشمس وأمثالها فإذا زالت الشمس أظلمت السماء والأرض‏\n\n\n### [منزل الأنفاس: علوم الشخص المحقق فيه‏]\n\n\nفهذا يا أخي قد استفدت علوما لم تكن تعرفها قبل هذا وهي علوم هذا الشخص المحقق بمنزل الأنفاس وكل ما أدركه هذا الشخص فإنما أدركه من الروائح بالقوة الشمية لا غير وقد رأينا منهم جماعة بإشبيلية وبمكة وبالبيت المقدس وفاوضناهم في ذلك مفاوضة حال لا مفاوضة نطق كما أني فاوضت طائفة أخرى من أصحاب النظر البصري بالبصر فكنت أسأل وأجاب ونسأل ونجيب بمجرد النظر ليس بيننا كلام معتاد ولا اصطلاح بالنظر أصلا لكن كنت إذا نظرت إليه علمت جميع ما يريده مني وإذا نظر إلى علم جميع ما نريده منه فيكون نظره إلي سؤالا أو جوابا ونظري إليه كذلك فنحصل علوما جمة بيننا من غير كلام ويكفي هذا القدر من بعض علم هذا الشخص فإن علومه كثيرة أحطنا بها فمن أراد أن يعرف مما ذكرناه شيئا فليعلم الفرق بين في في قوله كان في عماء وبين استوى في قوله الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ ولم يقل في كما قال في السماء وفي الليل ويتبين لك في كل ما ذكرناه مقام جمع الجمع ومقام الجمع ومقام التفرقة ومقام تمييز المراتب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى الجزء التاسع عشر\n\n",
    "en": "Chapter Thirty-Four: Concerning the Gnosis [Maʿrifa] of a person realized in the Station of Breaths [Manzil al-Anfās], who witnesses matters therein which I shall mention, if God wills.\n\nThe one realized through the Breaths [al-Anfās] is the All-Merciful [Raḥmān],\nFor the Throne [al-ʿArsh] is in his right, if he is the Human.\nAnd if he turns toward the Essence [al-ʿAyn] seeking it,\nFor him is the Cloud [al-ʿAmāʾ], and grace upon grace.\nHis station is the inner side of the Heights [Bāṭin al-Aʿrāf], where he dwells;\nSupporters and helpers visit him there.\nHe possesses the last part of the Night, if you realize it,\nJust as he possesses the Human from the existence of the Essence [al-ʿAyn].\nIf his outward aspect appears, you say, \"Qur'an,\"\nOr if his inward aspect appears, you say, \"Criterion\" [Furqān].\nGod has gathered in him every virtue,\nSo he is the Perfection [al-Kamāl] in which there is no deficiency.\n\n### Perceptions and Objects of Knowledge [Al-Idrākāt wa al-Maʿlūmāt]\n\nKnow, may God aid you with the Holy Spirit [Rūḥ al-Qudus], that the objects of knowledge [al-Maʿlūmāt] are different in themselves, and the perceptions [al-Idrākāt] by which these objects of knowledge are perceived are also different in themselves, just like the objects of knowledge. However, they differ in terms of their essences and quiddities [dhawātihā], not in terms of their being perceptions—although this is a matter of dispute among the masters of speculation [arbāb al-naẓar].\n\nGod has customarily assigned a specific perception to every reality [ḥaqīqa] that is possible to know—I mean, to its locus, not to its essential reality. He has made the entity perceived by these perceptions a single entity [ʿayn wāḥida], which consists of six things: hearing, sight, smell, touch, taste, and intellect [ʿaql]. The perception of all things by these faculties, except for the intellect, is necessary [ḍarūrī]. The things to which these faculties are customarily linked never err. A group of rationalists [al-ʿuqalāʾ] have erred in this matter and attributed the error to the sense faculty [al-ḥiss], but this is not the case. Rather, the error belongs to the Judge [al-Ḥākim].\n\n### Intellectual and Sensory Gnosis [Al-Maʿrifa al-ʿAqliyya wa al-Ḥissiyya]\n\nAs for the intellect’s perception of intelligibles [al-Maʿqūlāt], it is of two types: one is necessary [ḍarūrī], like all other perceptions; and one is not necessary, but requires tools for its knowledge. These tools are six: the five senses we mentioned, and the reflective faculty [al-Qūwa al-Mufakkira]. No object of knowledge that a creature can possibly know is perceived without one of these perceptions.\n\nWe said that a group erred concerning the perception of the senses and attributed errors to them because they observed that when they were in a ship sailing along the shore, they saw the shore moving with the movement of the ship. Thus, sight gave them something that was neither a reality nor an object of knowledge at all, for they know with necessary knowledge that the shore has not moved from its place, yet they cannot deny what they witnessed of the movement. Similarly, when they taste sugar or honey and find it bitter, though it is sweet, they know necessarily that the sense of taste has erred and conveyed something incorrect.\n\nThe matter, according to us, is not so. Rather, the deficiency and error occurred on the part of the Judge, which is the intellect, not the senses. The perception of the senses concerning what their reality grants is necessary, just as the intellect does not err in what it perceives necessarily. However, in what it perceives through the senses or through reflection, it may err.\n\nTherefore, the sense faculty has never erred, nor has any perception that is necessary to it. There is no doubt that the sense of sight saw movement, and the sense of taste found a bitter flavor. The sight perceived movement in itself, and the taste perceived the intensity of bitterness in itself. Then an intellect came and judged that the shore was moving and that the sugar was bitter. Then another intellect came and said that the bilious humor [al-Khilṭ al-Ṣafrāwī] occupied the locus of taste, and thus perceived bitterness, and that humor intervened between the faculty of taste and the sugar. Therefore, the taste perceived nothing but the bitterness of the bile.\n\nThe two intellects of the two persons agreed that bitterness was perceived without doubt, but they differed concerning what the object of taste was. Thus, it became clear that the intellect erred, not the sense faculty. Therefore, error is never truly attributed except to the Judge, not to the Witness [al-Shāhid].\n\nI have another point regarding this issue that differs from what they claimed, which is that the sweetness in sweet things, and other flavors in edibles, is not inherent in the edible itself—a matter which, if you investigate it, you will find the correctness of our position. The same ruling applies to all other perceptions. If there were, customarily, another perceiver above the intellect that judged the intellect and received knowledge from it, just as the intellect judges the sense faculty, that judging perceiver would also err concerning what is necessary for the intellect, and it would say that the intellect erred in what is necessary for it.\n\n### Extraordinary Perception and Sufi Gnosis [Al-Idrāk al-Khāriq li al-ʿĀda wa al-Maʿrifa al-Ṣūfiyya]\n\nOnce this is established, and you know how God has ordered the perceived objects and the perceptions, and that this linkage is a customary matter, know that God has other servants for whom He breaks the custom [kharq al-ʿāda] in their perception of knowledge.\n\nAmong them are those who are granted the perception of all intelligibles and sensibles—which are usually perceived by all faculties—through the faculty of sight alone. Others perceive them through the faculty of hearing alone, and so on, through all the faculties. Furthermore, they may perceive them through accidental matters [umūr ʿaraḍiyya] other than the faculties, such as striking, movement, stillness, and other things.\n\nThe Messenger of God, peace and blessings be upon him, said:\n<<إِنَّ اللهَ ضَرَبَ بِيَدِهِ بَيْنَ كَتِفَيَّ فَوَجَدْتُ بَرْدَ أَنَامِلِهِ بَيْنَ ثَدْيَيَّ فَعَلِمْتُ عِلْمَ الْأَوَّلِينَ وَالْآخِرِينَ>> (Indeed, God struck His Hand between my shoulders, and I found the coolness of His fingertips between my breasts, and I knew the knowledge of the first and the last.)\n\nThis knowledge encompasses every intelligible and sensible object of knowledge that a creature can perceive. This knowledge was attained not through any of the sensory or spiritual faculties. This is why we said that there is another cause, apart from these faculties, by which objects of knowledge are perceived.\n\nWe only stated that knowledge may be perceived without its customary faculties, and we ruled that these perceptions are customary for their customary objects, for the sake of the intuitive observer [al-mutafarris]. The person of intuition [ṣāḥib al-firāsa] looks at a person and knows what will happen from him, or what has occurred to him inwardly, or what he has done. The same applies to the augur [al-zājir] and those like him.\n\nWe have brought all this up to provide familiarity with what we wish to attribute to the People of God—the Prophets and the Saints—regarding the knowledge they perceive through non-customary means. When they perceive knowledge in this way, they are attributed to the quality by which they perceived the objects of knowledge. Thus, they say: \"So-and-so is a person of sight,\" meaning he perceives all objects of knowledge through sight. (I tasted this with the Messenger of God, peace and blessings be upon him.) And \"So-and-so is a person of hearing,\" and \"So-and-so is a person of taste,\" and \"a person of soul and breaths\" (meaning smell), and \"a person of touch,\" and \"So-and-so is a person of meaning.\" This last is outside the scope of the others, but is like what is said among the common people: \"a person of sound reflection.\"\n\nSome people are granted sight up to the last of the faculties, according to what they are given, and this becomes a custom for them if it persists, because it is derived from *al-ʿawd* (returning), meaning it returns to them in every glance or in every smell, and nothing else.\n\n### Divine Names and Sufi Gnosis [Al-Asmāʾ al-Ilāhiyya wa al-Maʿārif al-Ṣūfiyya]\n\nLikewise, you should know that the Divine Names [al-Asmāʾ al-Ilāhiyya] are similar to this. Every Name grants a specific reality [ḥaqīqa khāṣṣa], yet it is within the power of every single Divine Name to grant what all the Names grant. God Almighty said: <<قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى>> (Say: Call upon Allah or call upon the All-Merciful [al-Raḥmān]. Whichever you call upon, to Him belong the Most Beautiful Names.)\n\nSimilarly, if every Name were mentioned, it would be said of it that \"to Him belong the Most Beautiful Names,\" due to the Unicity [Aḥadiyya] of the Named One. Know this.\n\nSome people are specialized by the Name *Allāh*, so their gnoses [Maʿārif] are Divine (*Ilāhiyya*). Others are specialized by the Name *al-Raḥmān*, so their gnoses are Merciful (*Raḥmāniyya*). Just as in the cosmic faculties, one might say, \"The gnoses of this person are visual,\" and concerning another, \"auditory,\" so he belongs to the world of sight, the world of hearing, or the world of Breaths [ʿĀlam al-Anfās]. In this way, his gnoses in Divine matters are attributed to the Divine Name through which he was opened, and the realities of all the Names are encompassed within it.\n\n### The Raḥmānī Gnosis and the Station of Breaths [Al-Maʿrifa al-Raḥmāniyya wa Manzil al-Anfās]\n\nIf you have understood this, know also that the Divine Name specific to this particular person in this chapter is *al-Raḥmān*. The faculty specific to him, to which he is attributed, is the faculty of smell [Qūwa al-Shammiyya], and its correlate is scents, which are the Breaths [al-Anfās]. Thus, he belongs to the World of Breaths in terms of the faculties, and to the Merciful Ones (*al-Raḥmāniyyīn*) in terms of the degrees of the Names.\n\nWe therefore say that the Gnosis of this specific person in this chapter, whether he is Zayd or ʿAmr, is *Raḥmānī* (Merciful). Every matter attributed to the Name *al-Raḥmān* in the Book or the Sunna is attributed to this person, for this Name is his source of sustenance [al-Mumidd]. No other Divine Name has authority over him except through the mediation of this Name, in whatever manner that may be.\n\nFor this reason, we say that God Almighty has concealed His Mercy in places of His punishment and vengeance. For example, the sick person, whose suffering through illness is made a mercy for him in that it expiates his sins. This is mercy within vengeance. Likewise, the one upon whom vengeance is exacted through the execution of a legal punishment [ḥadd], such as killing or flogging: this is a present punishment containing a hidden mercy, by which the demand upon him in the Hereafter is lifted.\n\nSimilarly, in His blessing in this world, derived from the Name *al-Munʿim* (The Bestower of Blessings), He has concealed His vengeance. He blesses now with that by which the person will be tormented later, due to the concealment of the torment within it in the Hereafter or during the time of repentance. For when a person repents, reflects, and contemplates the forbidden pleasures he enjoyed, those recalled images turn into torment for him, whereas before repentance, when he recalled them in his mind, he enjoyed them with the utmost pleasure. Glory be to Him who concealed His Mercy in His torment, and His torment in His Mercy, and His blessing in His vengeance, and His vengeance in His blessing. The concealed element is always the spirit [rūḥ] of the manifest entity, whatever it may be.\n\nSince the Gnosis of this person is *Raḥmānī*, and the Name *al-Raḥmān* established itself upon the Throne, as God Almighty said: <<الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى>> (The All-Merciful established Himself upon the Throne), the spiritual aspiration [Himma] of this person is Throne-like (*ʿArshiyya*). Just as the Throne belongs to *al-Raḥmān*, so too is the aspiration the locus for the establishment of this Gnosis. Thus, it is said that his aspiration is Throne-like.\n\nThe station of this person is the inner side of the Heights [Bāṭin al-Aʿrāf], which is the barrier between the people of felicity and the people of wretchedness. The men of the Heights [Aʿrāf] will be mentioned; they are those who were not bound by a specific attribute, like Abū Yazīd and others. His station is the inner side of the Heights because his Gnosis is *Raḥmānī* and his aspiration is Throne-like. Just as the Throne is the locus of *al-Raḥmān*'s establishment, so too does the inner side of the Heights contain Mercy, just as its outer side contains punishment.\n\n### Mercy is the Throne of the Divine Essence [Al-Raḥma ʿArsh al-Dhāt al-Ilāhiyya]\n\nThis person possesses mercy for all existing things, including sinners, disbelievers, and others.\n\nGod Almighty said to the master of this station, Muhammad (PBUH), when he prayed for punishment and vengeance upon the tribes of Riʿl, Dhakwān, and ʿUṣayya, mentioning what they had done: God said to him, \"God did not send you as an insulter or a curser, but sent you as a Mercy.\"\n\nThus, He forbade him from praying against them and cursing them or wishing them ill. God Almighty revealed to him: <<وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ>> (And We have not sent you except as a Mercy to the worlds). This encompasses the entire world, meaning that he should show them mercy and pray *for* them, not *against* them. Thus, his response, instead of saying, \"May God curse them,\" was, \"May God forgive them and guide them,\" as he said when they wounded him: <<اللَّهُمَّ اهْدِ قَوْمِي فَإِنَّهُمْ لَا يَعْلَمُونَ>> (O God, guide my people, for they do not know).\n\nHe meant those who denied him, excluding the People of the Book and the imitators among the People of the Book, but not others.\n\nFor this reason, we said concerning this person who holds this station that he is merciful toward sinners and disbelievers. If this person is a judge and executes a legal punishment, or if he is one upon whom testimony is incumbent for the execution of a punishment and he testifies or executes it, he does so only out of Mercy and from the Name *al-Raḥmān* toward the one being punished or testified against, not out of vengeance or seeking gratification. His state does not permit this, as it is not required by the station of this Name. God Almighty said in the story of Abraham: <<إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ من الرَّحْمنِ>> (Indeed, I fear that a torment from the All-Merciful [al-Raḥmān] may afflict you).\n\n### The Istiwāʾ of the Throne and the Ayna of the Cloud [Istiwāʾiyyat al-ʿArsh wa Ayniyyat al-ʿAmāʾ]\n\nWhoever holds this station and Gnosis, and to whom the Name *al-Raḥmān* looks, witnesses through direct experience [dhawqan] secrets concerning the relationship between the establishment [Istiwāʾ] upon the Throne and the relationship of the Where-ness [Ayniyya] to the Cloud [al-ʿAmāʾ]: whether they are on the same level or differ.\n\nHe knows what belongs to The Real [al-Ḥaqq] of the attributes of Majesty [Jalāl] and Subtlety [Luṭf] simultaneously, between the Cloud and the Establishment, since He was in the Cloud and there was no Throne upon which He could be described as established. Then He created the Throne and established Himself upon it by the Name *al-Raḥmān*.\n\nThe Throne has a limit by which it is distinguished from the Cloud, which is the Name *al-Rabb* (The Lord), and the Cloud has a limit by which it is distinguished from the Throne. There must be a transition from one attribute to another. What was His attribute between the Cloud and the Throne, or by what relationship did He appear between them, since each of them is distinguished from the other by its limit and reality?\n\nThis is like the distinction between the Cloud that has air above it and air below it (which is the thin cloud carried by the air below and above it) and the Cloud that has no air above it and no air below it. This latter is an uncarried Cloud. The listener knows that the Cloud to which the Lord's Where-ness [Ayniyya] was assigned is an uncarried Cloud.\n\nThen comes His saying, Almighty: <<هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ الله في ظُلَلٍ من الْغَمامِ>> (Do they await anything but that God should come to them in the shadows of the clouds [al-Ghamām]?). Does this cloud refer back to that Cloud [al-ʿAmāʾ], so that the Cloud carries the Throne, and the Throne is the locus of *al-Raḥmān*'s establishment, thus uniting the Cloud and the Throne on the Day of Resurrection? Or is it this intended station, which has air above it and air below it? The possessor of this station is granted the knowledge of all that.\n\n### The Descent of the Lord from the Throne to the Lower Heaven [Nuzūl al-Rabb min al-ʿArsh ilā Samāʾ al-Dunyā]\n\nFurthermore, the possessor of this station is also granted Divine knowledge of this type, through the Name *al-Raḥmān*, concerning the descent of the Lord to the lower heaven [samāʾ al-dunyā]—whether this descent is from the Throne or from the Cloud. The Cloud was mentioned when the question was asked about the Name *al-Rabb*:\n\n<<قِيلَ لَهُ أَيْنَ كَانَ رَبُّنَا قَبْلَ أَنْ يَخْلُقَ خَلْقَهُ فَقَالَ كَانَ فِي عَمَاءٍ مَا فَوْقَهُ هَوَاءٌ وَمَا تَحْتَهُ هَوَاءٌ>> (He was asked, \"Where was our Lord before He created His creation?\" He said, \"He was in a Cloud [ʿAmāʾ], with no air above it and no air below it.\")\n\nThe implied subject of \"He was\" is our Lord. And He says, \"Our Lord descends to the heaven.\"\n\nThis indicates that His descent to the lower heaven is from that Cloud, just as His establishment upon the Throne was from that Cloud. His relationship to the lower heaven is like His relationship to the Throne; there is no difference. He did not depart from the Throne in His descent to the lower heaven, nor did He depart from the Cloud in His descent to the Throne or to the lower heaven.\n\nWhen the Prophet (PBUH) informed that God says during this descent to the lower heaven: <<هَلْ مِنْ تَائِبٍ فَأَتُوبَ عَلَيْهِ هَلْ مِنْ مُسْتَغْفِرٍ فَأَغْفِرَ لَهُ هَلْ مِنْ سَائِلٍ فَأُعْطِيَهُ هَلْ مِنْ دَاعٍ فَأُجِيبَهُ>> (Is there any repentant one that I may forgive him? Is there any seeker of forgiveness that I may forgive him? Is there any petitioner that I may grant him? Is there any supplicant that I may answer him?),\n\nAll this is from the category of His Mercy and Subtlety [Luṭf]. This is the reality of the Name *al-Raḥmān* who established Himself upon the Throne [istawā ʿalā al-ʿArsh]. This attribute descended with the Name *al-Rabb* to the lower heaven. This confirms what we informed you: that every Divine Name encompasses the ruling of all the Divine Names, since the Named One is one.\n\n### The Descent of the Lord from the Cloud to the Heaven [Nuzūl al-Rabb min al-ʿAmāʾ ilā al-Samāʾ]\n\nThe possessor of this station knows, concerning this celestial Lordly Descent, what is specific to the Name *al-Raḥmān* in it, which is expressed by the phrase, \"Is there any repentant one? Is there any seeker of forgiveness?\" For *al-Raḥmān* undoubtedly seeks this utterance. This is the portion of knowledge the possessor of this station knows concerning this Descent without mediation.\n\nHe also knows the descent of the Lord from the Cloud to the heaven through the mediation of the Name *al-Raḥmān*, because the Name *al-Rabb* has no direct authority over the possessor of this station, as he is, as we said, the Name *al-Raḥmān*. Thus, he knows nothing of the Name *al-Rabb* or any other Name except through the Name *al-Raḥmān*. He then knows, by the information given to him by *al-Raḥmān*, what The Real intended by His descent from the Cloud to the heaven in this manner. This is his Gnosis.\n\n### The Heart of the Believer is the Throne of the All-Merciful [Qalb al-Mu'min ʿArsh al-Raḥmān]\n\nFurthermore, among the knowledge specific to the possessor of this station, through the mediation of the Name *al-Raḥmān*, is the knowledge of God’s saying:\n\n<<مَا وَسِعَنِي أَرْضِي وَلَا سَمَائِي وَوَسِعَنِي قَلْبُ عَبْدِي الْمُؤْمِنِ>> (My Earth and My Heaven do not contain Me, but the heart of My believing servant does contain Me.)\n\nHe used the possessive *yāʾ* (My) in relation to capacity [al-Saʿa] and servitude [al-ʿUbūdiyya]. The servant receives from God only the measure granted specifically by that *yāʾ*. This encompasses two types of knowledge: knowledge of the special care [al-ʿInāya] for His believing servant, which he receives from the Name *al-Raḥmān* in its essence; and knowledge of the secret of the possessive attribution through the letter *yāʾ*, which he receives from God through the interpretation of the Name *al-Raḥmān*.\n\nHe knows that the capacity [al-Saʿa] intended here is the Form [al-Ṣūra] upon which the human was created. It is as if He says: \"My Names were not all manifested except in the human constitution [al-Nashʾa al-Insāniyya].\" God Almighty said: <<وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا>> (And He taught Adam all the Names), meaning the Divine Names from which all existents [al-Akwān] originated, and which were not granted to the angels. The Prophet (PBUH) said: <<إِنَّ اللهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ>> (Indeed, God created Adam upon His Form).\n\nAlthough the pronoun, in our view, is directed to return to Adam—which contains a refutation of some speculative thinkers [ahl al-afkār]—it is also directed to return to God, due to the human being characterized by all the Divine Names.\n\nThus, I knew that this capacity was accepted by the believing servant because he is upon the Form, just as the mirror accepts the image of the viewer, unlike other things that lack polish and clarity. This capacity was not granted to the heaven because it is transparent, nor to the earth because it is unpolished.\n\nThis indicates that although the creation of the human being originated from celestial movements, which are his father, and from receptive elements, which are his mother, he possesses from the side of The Real a matter that is neither in his fathers nor in his mothers. It is by that matter that the Majesty of God Almighty was contained. If that matter had been from his father (the heaven) or his mother (the earth) or from both, the heaven and the earth would have been more worthy of containing The Real than the one born from them. Especially since God Almighty says: <<لَخَلْقُ السَّماواتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ>> (The creation of the heavens and the earth is greater than the creation of mankind, but most of mankind do not know)—He means in meaning, not in physical size.\n\nDespite this, the human being was specialized by a matter that granted him this capacity [al-Saʿa], which the heaven and earth were too narrow to hold. This capacity was only granted to him from another matter originating from God, by which He favored him over the heaven and the earth.\n\nEvery part of the cosmos is both superior and inferior. Every part of the cosmos has been favored by God for the wisdom of need and deficiency that characterizes everything other than God. If the human being boasts of this capacity and prides himself over the earth and the heaven, he is met by His saying, Almighty: <<لَخَلْقُ السَّماواتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ>>. And if the heaven and the earth boast over the human being with this verse, they are met by His saying: <<مَا وَسِعَنِي أَرْضِي وَلَا سَمَائِي وَوَسِعَنِي قَلْبُ عَبْدِي>>.\n\nThis knowledge removes that boasting and pride from him and from them. All become dependent upon their Lord and veiled from their own pride and self. His saying, <<وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ>> (but most of mankind do not know), indicates that some people do know this. The knowledge of this is attained by those among us who are realized by the Name *al-Raḥmān*, which belongs to him and by which he is realized: <<فَاسْأَلْ بِهِ خَبِيراً>> (So ask concerning Him one who is informed).\n\nGod showed him mercy when he boasted of the knowledge by which he was favored over the heaven and the earth, and he knew from that that he only attained from the Name *al-Raḥmān* the measure of what was unveiled to him, which contained his cure. For that matter by which this servant was favored over the heaven and the earth is also from the Name *al-Raḥmān*, which He bestowed upon this servant.\n\n### The Human is a Comprehensive Copy [Al-Insān Nuskha Jāmiʿa]\n\nDo not say that this contradicts the human being being a copy [nuskha] of the cosmos. Rather, he is truly a Comprehensive Copy [Nuskha Jāmiʿa] in the sense that he contains something of the heaven in one respect, and something of the earth in one respect, and something of everything in one respect, but not in all respects. The human being is truly one of the created things; he is not called heaven, nor earth, nor Throne. But he is said to resemble the heaven in such-and-such a respect, the earth in such-and-such a respect, the Throne in such-and-such a respect, the element of fire in such-and-such a respect, the element of air in such-and-such a respect, and water and earth, and everything in the cosmos. It is by this consideration that he is a copy, and he has the name \"Human,\" just as the heaven has the name \"Heaven.\"\n\n### The Qur'anic Descent and the Furqānī Manifestation [Al-Nuzūl al-Qurʾānī wa al-Tanazzul al-Furqānī]\n\nAmong the knowledge of the possessor of this station is the descent of the Qur'an as a Criterion [Furqān], not merely as a Recitation [Qur'ān]. If he knows it as a Recitation, it is not from the Name *al-Raḥmān*. Rather, the Name *al-Raḥmān* interprets it for him from another Divine Name that *al-Raḥmān* encompasses.\n\nHe knows that it descended on a blessed night, which is the Night of Power [Laylat al-Qadr]. By its descent, the measures and weights of things were known, and he knew his own measure from it. This is like the descent of the Lord Almighty in the last third of the night. The night is the temporal locus of the descent of The Real and His attribute, which is the Qur'an.\n\nThe last third of the night in the descent of the Lord is the mystery [ghayb] of Muhammad (PBUH) and the mystery of this human species. For the mystery is a veil, and the night is a veil. This remaining part of the night is called the third because this human constitution [al-Nashʾa al-Insāniyya] has perpetual subsistence [al-Baqāʾ] in the Abode of Eternity. The first two thirds passed away with the existence of the remaining or last third of the night, in which The Real descended, thereby necessitating its subsistence as well. It is a night that is never followed by daybreak, so it does not pass away, but rather transitions from state to state and from abode to abode, just as the night moves from place to place ahead of the sun. It only flees before the sun so that its essence is not destroyed, since light negates darkness, and darkness negates it, except that the dominion of light is stronger. Light repels darkness, but darkness does not repel light. Rather, it is the light that moves, and darkness appears in the place where the light has no essence. Do you not see that The Real named Himself Light [al-Nūr] and did not name Himself Darkness [al-Ẓulma], since light is Existence [Wujūd] and darkness is non-existence [ʿAdam]? And since darkness does not overcome light, but light is the conqueror, so too The Real is not overcome by creation, but The Real is the conqueror. Thus, He named Himself Light.\n\n### The Human is the Remaining Third of the Night of Existence [Al-Insān huwa al-Thulth al-Bāqī min Layl al-Wujūd]\n\nThe heaven passes away—which is the first third of the night—and the earth passes away—which is the second third of the night—and the human being remains in the Hereafter forever and ever, without end. He is the remaining third of the night, and he is the offspring of these two parents: the heaven and the earth.\n\nThe Qur'an descended in the blessed night, in its last third, which is the Perfect Human [al-Insān al-Kāmil]. In him, every wise matter was distinguished [furriqa], so he was distinguished from his two parents by subsistence. <<نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ>> (The Trustworthy Spirit [Rūḥ al-Amīn] descended with it upon your heart)—that is Muhammad (PBUH).\n\nDo you not see how the Lawgiver said concerning the child of fornication that he is the worst of the three? Similarly, the child of lawful marriage is the best of the three, specifically from this perspective. The water from which the child is created, from the man and the woman, desired to emerge—and that water which forms the child is the third element. When it desired to emerge, it moved the two parents to intercourse so that it might exit. If its movement of them was not in a manner pleasing to the Law, it is called fornication [sifāḥ], and it is said that the child is the worst of the three, meaning he is the cause of the movement by which the name of evil was applied to them.\n\nThus, He made it three thirds: the two parents are two thirds, and the child is the third. Likewise, the night is divided into three thirds: two thirds that pass away, which are the heaven and the earth, and one third that remains, which is the human being. In him, the Form of *al-Raḥmān* appeared, and in him, the Qur'an descended.\n\nThe heaven and the earth are called \"night\" because darkness belongs to them essentially, and illumination comes to them from external luminous bodies, such as the sun and its like. When the sun departs, the heaven and the earth become dark.\n\n### The Station of Breaths: The Gnosis of the Realized Person Therein [Manzil al-Anfās: ʿUlūm al-Shakhṣ al-Muḥaqqaq Fīhi]\n\nThis, my brother, is knowledge you did not know before this. It is the knowledge of this person realized in the Station of Breaths [Manzil al-Anfās]. Everything this person perceives, he perceives only through scents, by the olfactory faculty [al-Qūwa al-Shammiyya].\n\nWe have seen a group of them in Seville, Mecca, and Jerusalem, and we engaged them in dialogue—a dialogue of state [ḥāl], not a dialogue of speech. Just as I engaged another group, the people of visual speculation [al-Naẓar al-Baṣarī], through sight. I would ask, and they would answer; we would ask, and we would answer, merely by looking, without customary speech between us, nor any prior agreement on visual signs. But when I looked at him, I knew everything he wanted from me, and when he looked at me, he knew everything I wanted from him. Thus, his look at me was a question or an answer, and my look at him was likewise. We attained abundant knowledge between us without speech.\n\nThis much suffices concerning some of the knowledge of this person. His knowledge is vast, and we have encompassed it. Whoever wishes to know something of what we have mentioned should know the difference between the preposition *fī* (in) in His saying, \"He was *in* a Cloud,\" and *istawā* (established Himself) in His saying, <<الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى>> (The All-Merciful established Himself *upon* the Throne), and why He did not say *fī* (in), as He said concerning the heaven and the night.\n\nIn everything we have mentioned, the station of the Gathering of the Gathering [Maqām Jamʿ al-Jamʿ], the station of the Gathering [Maqām al-Jamʿ], the station of Differentiation [Maqām al-Tafriqa], and the station of Distinguishing the Levels [Maqām Tamyīz al-Marātib] will become clear to you. And God speaks the Truth, and He guides to the Way.\n\n[End of the Nineteenth Part]",
    "ur": "چونتیسواں باب: اس شخص کی معرفت میں جو منزلِ انفاس (منزل الأنفاس) میں متحقق ہوا، اور اس نے وہاں سے ایسے امور کا مشاہدہ کیا جن کا ذکر میں ان شاء اللہ کروں گا۔\n\nبے شک انفاس (الأنفاس) کے ذریعے متحقق ہونے والا شخص رحمن (الرحمن) ہے\nپس اگر وہ انسان (إنسان) ہو تو عرش (العرش) اس کے حق میں ہے۔\nاور اگر وہ عین (العين) کی طرف متوجہ ہو کر اسے طلب کرے\nتو اس کے لیے عماء (العماء) ہے، اور احسان پر احسان ہے۔\nاس کا مقام اعراف (الأعراف) کا باطن ہے جہاں وہ سکونت پذیر ہے\nاس میں اس کے مددگار اور معاون اس کی زیارت کرتے ہیں۔\nاگر تم رات کے آخری حصے کو متحقق کرو تو وہ اس کے لیے ہے\nجیسا کہ وجودِ عین (وجود العين) سے اس کے لیے انسان (إنسان) ہے۔\nاگر اس کا ظاہر نمایاں ہو تو تم کہو گے کہ یہ قرآن ہے\nاور اگر اس کا باطن نمایاں ہو تو تم کہو گے کہ یہ فرقان ہے۔\nاللہ نے اس میں ہر منقبت جمع کر دی ہے\nپس وہ ایسا کمال ہے جس میں کوئی نقص نہیں۔\n\n### [ادراکات اور معلومات‏]\n\nجان لو، اللہ روح القدس کے ذریعے تمہاری تائید کرے، کہ معلومات (المعلومات) اپنی ذات کے اعتبار سے مختلف ہیں، اور وہ ادراکات (الإدراکات) جن کے ذریعے معلومات کا ادراک کیا جاتا ہے، وہ بھی معلومات کی طرح اپنی ذات کے اعتبار سے مختلف ہیں، لیکن اپنی ذات اور ماہیت کے لحاظ سے، نہ کہ ادراک ہونے کے لحاظ سے۔ اگرچہ یہ اہل نظر کے نزدیک ایک اختلافی مسئلہ ہے۔ اور اللہ نے ہر اس حقیقت کے لیے جس کا علم ممکن ہے، ایک خاص ادراک (الإدراك) مقرر کیا ہے، جو کہ عادتاً ہے نہ کہ حقیقتاً—میرا مطلب ہے اس کا محل۔ اور ان ادراکات کے ذریعے ادراک کرنے والے کے لیے ایک ہی عین (العين) مقرر کیا ہے، اور وہ چھ چیزیں ہیں: سننا، دیکھنا، سونگھنا، چھونا، چکھنا، اور عقل۔ اور ان سب کا اشیاء کا ادراک کرنا، سوائے عقل کے، ضروری (ضروری) ہے۔ لیکن جن اشیاء سے یہ عادتاً وابستہ ہیں، وہ کبھی خطا نہیں کرتیں۔ عقلمندوں کی ایک جماعت نے اس میں غلطی کی اور غلطی کو حس (الحس) کی طرف منسوب کیا، حالانکہ ایسا نہیں ہے، بلکہ غلطی تو حاکم (الحاکم) کی طرف سے ہوتی ہے۔\n\n### [عقلی اور حسی معرفت]\n\nاور جہاں تک عقل (العقل) کا معقولات (المعقولات) کا ادراک کرنا ہے، تو وہ دو قسموں پر ہے: ایک وہ جو ضروری (ضروری) ہے، جیسے باقی تمام ادراکات، اور دوسرا وہ جو ضروری نہیں ہے، بلکہ اس کے علم کے لیے آلات کی ضرورت ہوتی ہے، جن میں سے چھ ہیں: وہ پانچ حواس (الحواس) جن کا ہم نے ذکر کیا، اور قوتِ مفکرہ (القوة المفكرة)۔ کوئی بھی معلوم چیز جس کا علم کسی مخلوق کے لیے صحیح ہو، ان ادراکات میں سے کسی ایک کے ذریعے مدرک ہونے سے خالی نہیں ہو سکتی۔ ہم نے یہ اس لیے کہا کہ ایک جماعت نے حواس (الحواس) کے ادراک میں غلطی کی اور غلطیوں کو ان کی طرف منسوب کیا۔ یہ اس طرح ہے کہ جب وہ کسی چلتی ہوئی کشتی میں ساحل کے ساتھ سفر کرتے ہیں، تو وہ ساحل کو کشتی کے چلنے کے ساتھ چلتا ہوا دیکھتے ہیں۔ پس بصارت نے انہیں وہ چیز دی جو نہ حقیقت ہے اور نہ ہی معلوم۔ حالانکہ وہ ضروری علم رکھتے ہیں کہ ساحل اپنی جگہ سے حرکت نہیں کر رہا، اور وہ اس حرکت کا انکار بھی نہیں کر سکتے جس کا انہوں نے مشاہدہ کیا۔ اسی طرح جب وہ شکر یا شہد چکھتے ہیں اور اسے کڑوا پاتے ہیں، حالانکہ وہ میٹھا ہے، تو وہ ضروری طور پر جان لیتے ہیں کہ حاسہ ذائقہ نے غلطی کی اور وہ چیز منتقل کی جو صحیح نہیں ہے۔ ہمارے نزدیک معاملہ ایسا نہیں ہے، بلکہ کوتاہی اور غلطی حاکم (الحاکم) یعنی عقل سے واقع ہوئی ہے، نہ کہ حواس سے۔ کیونکہ حواس کا ادراک اس چیز کا جو ان کی حقیقت انہیں دیتی ہے، ضروری ہے۔ جیسا کہ عقل بھی ضروری ادراک میں خطا نہیں کرتی۔ لیکن حواس یا فکر کے ذریعے ادراک کرنے میں وہ غلطی کر سکتی ہے۔ پس حس نے کبھی غلطی نہیں کی، اور نہ ہی وہ چیز جس کا ادراک ضروری ہے۔ لہٰذا، اس میں کوئی شک نہیں کہ حس نے حرکت کو دیکھا، اور اس میں کوئی شک نہیں کہ اس نے کڑوا ذائقہ پایا۔ پس بصارت نے بذاتِ خود حرکت کا ادراک کیا، اور ذائقہ نے بذاتِ خود کڑواہٹ کی قوت کا ادراک کیا۔ پھر ایک عقل آئی اور فیصلہ کیا کہ ساحل متحرک ہے اور شکر کڑوی ہے۔ اور ایک دوسری عقل آئی اور کہا کہ صفراوی مادہ (الخلط الصفراوي) ذائقہ کے محل میں موجود تھا، پس اس نے کڑواہٹ کا ادراک کیا، اور اس مادے نے قوتِ ذائقہ اور شکر کے درمیان رکاوٹ ڈال دی۔ لہٰذا، ذائقہ نے صرف صفراء کی کڑواہٹ چکھّی۔ پس دونوں اشخاص کی عقلیں اس بات پر متفق ہو گئیں کہ اس نے بلا شک کڑواہٹ کا ادراک کیا، لیکن دونوں عقلوں نے اس چیز کے بارے میں اختلاف کیا جو ذائقہ کے لیے مدرک ہے۔ پس یہ واضح ہوا کہ غلطی عقل نے کی، نہ کہ حس نے۔ لہٰذا، حقیقت میں غلطی کبھی بھی شاہد (الحس) کی طرف منسوب نہیں کی جاتی، بلکہ حاکم (العقل) کی طرف۔ اور میرے نزدیک اس مسئلے میں ایک اور بات ہے جو ان کے دعوے سے مختلف ہے، اور وہ یہ ہے کہ مٹھاس جو میٹھی چیز میں ہے، اور دیگر چکھنے والی چیزوں میں، وہ مطعوم (چکھی جانے والی چیز) میں نہیں ہے، اگر تم اس پر تحقیق کرو تو تمہیں ہمارے موقف کی صحت معلوم ہو جائے گی۔ اور یہی حکم باقی تمام ادراکات میں ہے۔ اور اگر عادتاً عقل کے اوپر کوئی اور مدرک ہوتا جو عقل پر حکم لگاتا اور اس سے علم لیتا، جیسا کہ عقل حس پر حکم لگاتی ہے، تو وہ مدرکِ حاکم بھی اس چیز میں غلطی کرتا جو عقل کے لیے ضروری ہے، اور وہ کہتا کہ عقل نے اس چیز میں غلطی کی جو اس کے لیے ضروری ہے۔\n\n### [خارقِ عادت ادراک اور صوفیانہ معرفت]\n\nپس جب یہ بات طے ہو گئی اور تم نے جان لیا کہ اللہ نے مدرکات اور ادراکات کو کس طرح ترتیب دیا ہے، اور یہ کہ یہ وابستگی ایک عادتی امر ہے، تو جان لو کہ اللہ کے کچھ دوسرے بندے بھی ہیں جن کے لیے اللہ نے علوم کے ادراک میں عادت کو توڑ دیا ہے (خرق لهم العادة)۔ پس ان میں سے بعض کو یہ ادراک دیا گیا ہے کہ وہ تمام قویٰ (قوتوں) سے مدرک ہونے والی چیزوں—معقولات اور محسوسات—کو صرف قوتِ بصارت (قوة البصر) کے ذریعے ادراک کر لیتے ہیں۔ اور دوسرے کو قوتِ سمع (قوة السمع) کے ذریعے، اور اسی طرح تمام قویٰ کے ذریعے، پھر قویٰ کے علاوہ دیگر عارضی امور جیسے مارنے، حرکت، سکون وغیرہ کے ذریعے بھی۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا:\n> **إن الله ضرب بيده بين كتفي فوجدت برد أنامله بين ثديي فعلمت علم الأولين والآخرين‏**\n> (بے شک اللہ نے اپنا ہاتھ میرے دونوں کندھوں کے درمیان مارا، تو میں نے اس کی انگلیوں کی ٹھنڈک اپنے سینے کے درمیان محسوس کی، پس میں نے اولین و آخرین کا علم جان لیا۔)\n\nپس اس علم میں ہر وہ معلوم چیز شامل ہو گئی جو مخلوق ادراک کر سکتی ہے، خواہ وہ معقول ہو یا محسوس۔ یہ علم حسی یا معنوی قویٰ میں سے کسی قوت کے بغیر حاصل ہوا۔ اسی لیے ہم نے کہا کہ ان قویٰ کے علاوہ کوئی اور سبب بھی ہے جس سے معلومات کا ادراک کیا جاتا ہے۔ اور ہم نے یہ اس لیے کہا کہ علوم کا ادراک ان کی معتاد قوتوں کے بغیر بھی ہو سکتا ہے، پس ہم نے ان ادراکات کو ان کے معتاد مدرکات کے لیے عادت کے ذریعے حکم لگایا، فراست والے شخص کی خاطر۔ پس صاحبِ فراست (صاحب الفراسة) کسی شخص کو دیکھتا ہے اور جان لیتا ہے کہ اس سے کیا ہونے والا ہے، یا اس کے باطن میں کیا خیال آیا ہے، یا اس نے کیا کیا ہے۔ اور اسی طرح زاجر (غیب کی خبر دینے والا) اور اس جیسے لوگ۔ ہم یہ سب اس لیے لائے ہیں تاکہ اہل اللہ—انبیاء اور اولیاء—کے اس علم کو مانوس کر سکیں جو وہ غیر معتاد طریقوں سے ادراک کرتے ہیں۔ پس جب وہ ان کا ادراک کرتے ہیں، تو انہیں اس صفت کی طرف منسوب کیا جاتا ہے جس کے ذریعے انہوں نے معلومات کا ادراک کیا، تو وہ کہتے ہیں: فلاں صاحبِ نظر ہے، یعنی وہ نظر کے ذریعے تمام معلومات کا ادراک کرتا ہے۔ اور یہ وہ چیز ہے جو میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چکھّی ہے۔ اور فلاں صاحبِ سمع ہے، اور فلاں صاحبِ طعم ہے، اور صاحبِ نفس اور انفاس (یعنی سونگھنے والا)، اور صاحبِ لمس ہے، اور فلاں صاحبِ معنی ہے۔ اور یہ ان سب سے باہر ہے، بلکہ یہ ایسا ہی ہے جیسا کہ عام لوگوں میں کہا جاتا ہے کہ وہ صحیح فکر (صحیح فكر) کا مالک ہے۔ پس لوگوں میں سے بعض کو نظر سے لے کر آخری قوت تک عطا کیا گیا ہے، اس مقدار کے مطابق جو اسے عطا کی گئی، اور یہ اس کے لیے عادت بن جاتی ہے اگر وہ اس پر قائم رہے، کیونکہ یہ 'عود' (لوٹنے) سے مشتق ہے، یعنی ہر نظر میں یا ہر سونگھنے میں اس پر وہی چیز لوٹتی ہے، اس کے علاوہ کچھ نہیں۔\n\n### [اسمائے الٰہیہ اور صوفیانہ معرفت]\n\nاسی طرح تم یہ بھی جان لو کہ اسمائے الٰہیہ (الأسماء الإلهية) بھی اسی طرح ہیں، اور ہر اسم ایک خاص حقیقت عطا کرتا ہے، لیکن اس کی قوت میں یہ ہے کہ وہ ہر وہ چیز عطا کرے جو تمام اسمائے الٰہیہ عطا کرتے ہیں۔ اللہ تعالیٰ فرماتا ہے:\n> **قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏**\n> (کہو: اللہ کو پکارو یا رحمن کو پکارو، تم جس نام سے بھی پکارو، اسی کے لیے سب اچھے نام ہیں۔)\n\nاسی طرح اگر ہر اسم کا ذکر کیا جائے تو اس کے بارے میں کہا جائے گا کہ اس کے لیے اسماء حسنیٰ ہیں، اور یہ مسمیٰ (ذات) کی احدیت (لاحدية) کی وجہ سے ہے۔ پس یہ جان لو۔ پس لوگوں میں سے بعض کے ساتھ اسم اللہ خاص ہو جاتا ہے، تو اس کی معرفتیں الٰہیہ (إلهية) ہوتی ہیں۔ اور بعض کے ساتھ اسم رحمن (الرحمن) خاص ہو جاتا ہے، تو اس کی معرفتیں رحمانیہ (رحمانية) ہوتی ہیں۔ جیسا کہ کونی قوتوں میں کہا جاتا ہے کہ اس شخص کی معرفتیں نظریاتی ہیں، اور دوسرے کے حق میں سمعی ہیں۔ پس وہ عالمِ نظر، عالمِ سمع، اور عالمِ انفاس (عالم الأنفاس) سے ہے۔ اسی طرح اس کی معرفتیں الٰہیات میں اس اسمِ الٰہی کی طرف منسوب کی جاتی ہیں جس میں اس کے لیے کشف ہوا، پس اس میں تمام اسماء کی حقائق شامل ہو جاتی ہیں۔\n\n### [رحمانی معرفت اور منزلِ انفاس‏]\n\nپس جب تم نے یہ بھی جان لیا، تو جان لو کہ اس خاص شخص کے لیے اسمائے الٰہیہ میں سے جو اسم اس باب کے ساتھ خاص ہے، وہ اسم رحمن (الرحمن) ہے۔ اور قویٰ میں سے جو قوت اس کے ساتھ خاص ہے اور جس کی طرف وہ منسوب کیا جاتا ہے، وہ قوتِ شم (سونگھنے کی قوت) ہے، اور اس کا تعلق روائح (خوشبوؤں) سے ہے، جو کہ انفاس (الأنفاس) ہیں۔ پس وہ قویٰ کی نسبت سے عالمِ انفاس (عالم الأنفاس) سے ہے، اور اسماء کے مراتب میں سے رحمانیین (الرحمانيين) میں سے ہے۔ پس ہم کہتے ہیں کہ یہ خاص شخص، خواہ وہ زید ہو یا عمرو، اس باب میں اس کی معرفت رحمانیہ (رحمانية) ہے۔ پس ہر وہ امر جو کتاب یا سنت میں اسم رحمن کی طرف منسوب کیا گیا ہے، وہ اس شخص کی طرف منسوب کیا جاتا ہے۔ کیونکہ یہ اسم ہی اس کا ممد (مددگار) ہے۔ اور کوئی بھی اسمِ الٰہی اس پر حکم نہیں رکھتا مگر اس اسم کے واسطے سے، خواہ وہ کسی بھی صورت میں ہو۔ اور اسی لیے ہم کہتے ہیں کہ اللہ سبحانہ نے اپنی رحمت کو اپنے عذاب اور انتقام کے مقامات میں پوشیدہ رکھا ہے، جیسے بیمار شخص جس کے مرض کے عذاب میں اس کے لیے رحمت رکھی گئی ہے، اس کے گناہوں کی معافی کے ذریعے جو اس سے دور ہوتے ہیں۔ پس یہ انتقام (نقمة) میں رحمت ہے۔ اسی طرح جس سے حد قائم کر کے انتقام لیا گیا، خواہ قتل ہو یا مار پیٹ، تو یہ ایک حاضر عذاب ہے جس میں باطنی رحمت ہے، جس کے ذریعے آخرت میں اس سے مطالبہ ختم ہو گیا۔ جیسا کہ دنیا میں اپنی نعمت (نعمته) میں، جو کہ اسم المنعم (نعمت دینے والا) سے ہے، اس نے اپنا انتقام (نقمته) پوشیدہ رکھا ہے۔ پس وہ اب ایسی چیز سے نعمت دے رہا ہے جس سے وہ عذاب پائے گا، کیونکہ اس میں عذاب آخرت میں یا توبہ کے وقت پوشیدہ ہے۔ کیونکہ جب انسان توبہ کرتا ہے اور ان حرام لذتوں پر غور و فکر کرتا ہے جن سے اس نے لطف اٹھایا تھا، تو وہ مستحضر شدہ صورتیں اس کے لیے عذاب بن جاتی ہیں، حالانکہ توبہ سے پہلے جب وہ انہیں اپنے ذہن میں لاتا تھا تو انتہائی لذت محسوس کرتا تھا۔ پس پاک ہے وہ ذات جس نے اپنی رحمت کو اپنے عذاب میں، اور اپنے عذاب کو اپنی رحمت میں، اور اپنی نعمت کو اپنے انتقام میں، اور اپنے انتقام کو اپنی نعمت میں پوشیدہ رکھا۔ پس جو چیز ہمیشہ پوشیدہ ہوتی ہے، وہ ظاہر عین (العين الظاهرة) کی روح ہوتی ہے، خواہ وہ کوئی بھی شے ہو۔ چونکہ اس شخص کی معرفت رحمانیہ تھی، اور اسم رحمن عرش پر استواء (استوى) فرمایا، جیسا کہ اللہ تعالیٰ فرماتا ہے:\n> **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏**\n> (رحمن عرش پر متمکن ہوا۔)\n\nاس شخص کی ہمت عرشیہ (عرشية) تھی۔ پس جس طرح عرش رحمن کے لیے تھا، اسی طرح یہ معرفت اس کے استواء کا محل تھی، لہٰذا کہا گیا کہ اس کی ہمت عرشیہ ہے۔ اور اس شخص کا مقام اعراف (الأعراف) کا باطن ہے، جو اہل سعادت اور اہل شقاوت کے درمیان کی دیوار ہے۔ اعراف کے کچھ لوگ ہیں جن کا ذکر کیا جائے گا، اور وہ وہ ہیں جنہیں کسی صفت نے مقید نہیں کیا، جیسے ابو یزید اور دیگر۔ اور اس کا مقام اعراف کا باطن اس لیے تھا کہ اس کی معرفت رحمانیہ تھی اور اس کی ہمت عرشیہ تھی۔ کیونکہ عرش رحمن کا مستویٰ ہے، اسی طرح اعراف کے باطن میں رحمت ہے، جیسا کہ اس کے ظاہر میں عذاب ہے۔\n\n### [رحمت ذاتِ الٰہیہ کا عرش]\n\nپس یہ شخص تمام موجودات کے لیے رحمت رکھتا ہے، گناہ گاروں، کافروں اور دیگر سب کے لیے۔\nاللہ تعالیٰ نے اس مقام کے سردار یعنی محمد صلی اللہ علیہ وسلم سے فرمایا، جب آپ نے رعل، ذکوان اور عُصیہ کے لیے عذاب اور انتقام کی دعا کی، اور ان کا ذکر کیا جو ان کی طرف سے ہوا تھا، تو اللہ نے آپ سے فرمایا: \"اللہ نے آپ کو سبّاب (گالی دینے والا) یا لعان (لعنت کرنے والا) بنا کر نہیں بھیجا، بلکہ آپ کو رحمت بنا کر بھیجا ہے۔\"\nپس آپ کو ان کے خلاف دعا کرنے اور انہیں برا بھلا کہنے سے منع فرمایا، اور اللہ عزوجل نے آپ پر نازل فرمایا:\n> **وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ**\n> (اور ہم نے آپ کو تمام جہانوں کے لیے رحمت بنا کر ہی بھیجا ہے۔)\n\nپس یہ عالمین (العالمين) کو عام ہے، یعنی تاکہ آپ ان پر رحم کریں اور ان کے لیے دعا کریں نہ کہ ان کے خلاف۔ پس آپ کے قول \"اللہ ان پر لعنت کرے\" کے بدلے \"اللہ ان پر توبہ کرے اور انہیں ہدایت دے\" ہو، جیسا کہ آپ نے فرمایا جب آپ کو زخمی کیا گیا:\n> **اللهم اهد قومي فإنهم لا يعلمون‏**\n> (اے اللہ! میری قوم کو ہدایت دے، کیونکہ وہ نہیں جانتے۔)\n\nآپ کا مطلب اہل کتاب کے علاوہ جھٹلانے والے اور اہل کتاب میں سے مقلدین تھے، نہ کہ دوسرے۔ اسی لیے ہم نے اس مقام کے حامل شخص کے حق میں کہا کہ وہ گناہ گاروں اور کافروں پر رحیم ہے۔ پس اگر یہ شخص حاکم ہو اور حد قائم کرے، یا ان لوگوں میں سے ہو جن پر حد قائم کرنے کے لیے گواہی دینا ضروری ہو، اور وہ گواہی دے یا حد قائم کرے، تو وہ اسے صرف رحمت کے باب سے اور اسم رحمن (الرحمن) کے ذریعے قائم کرے گا، محدود (جس پر حد لگائی گئی) اور مشہود علیہ کے حق میں، نہ کہ انتقام اور تشفی کی طلب کے باب سے۔ یہ اس اسم کے مقام کا تقاضا نہیں ہے، لہٰذا اس شخص کا حال اسے یہ نہیں دیتا۔ اللہ تعالیٰ ابراہیم علیہ السلام کے قصے میں فرماتا ہے:\n> **إِنِّي أَخَافُ أَنْ يَمَسَّكَ عَذَابٌ مِنَ الرَّحْمَنِ**\n> (بے شک میں ڈرتا ہوں کہ تمہیں رحمن کی طرف سے کوئی عذاب چھو لے۔)\n\n### [عرش کا استواء اور عماء کا اَین]\n\nاور جس کا یہ مقام اور معرفت ہو، اور یہ اسم رحمن (الرحمن) اس پر نظر ڈالتا ہے، تو وہ ذوقاً ان اسرار کا مشاہدہ کرتا ہے جو عرش (العرش) کے ساتھ استواء (الاستواء) کی نسبت اور عماء (العماء) کے ساتھ اَین (کہاں ہونے) کی نسبت کے درمیان ہیں—کہ آیا وہ دونوں ایک ہی حد پر ہیں یا مختلف ہیں؟ اور وہ جانتا ہے کہ ذات حق (الحق) کے لیے عماء اور استواء کے درمیان جلال اور لطف کی کون سی صفات جمع ہیں۔ کیونکہ وہ عماء میں تھا اور کوئی عرش نہیں تھا کہ اس پر استواء کی صفت سے متصف ہوتا۔ پھر اس نے عرش کو پیدا کیا اور اسم رحمن (الرحمن) کے ذریعے اس پر استواء فرمایا۔ اور عرش کی ایک حد ہے جو اسے عماء سے ممتاز کرتی ہے، جو کہ اسم رب (الرب) ہے۔ اور عماء کی ایک حد ہے جو اسے عرش سے ممتاز کرتی ہے۔ اور ایک صفت سے دوسری صفت کی طرف منتقل ہونا ضروری ہے۔ پس اس کی نعت (صفت) عماء اور عرش کے درمیان کیا تھی، یا ان دونوں کے درمیان وہ کس نسبت سے ظاہر ہوا، جب کہ ان میں سے ہر ایک اپنی حد اور حقیقت کے ساتھ دوسرے سے ممتاز ہو گیا؟ جیسا کہ وہ عماء جو اس کے اوپر ہوا ہے اور اس کے نیچے ہوا ہے—جو کہ ہلکا بادل ہے جسے نیچے اور اوپر کی ہوا اٹھائے ہوئے ہے—وہ اس عماء سے ممتاز ہے جس کے اوپر ہوا نہیں اور نیچے ہوا نہیں۔ پس وہ ایسا عماء ہے جو اٹھایا ہوا نہیں ہے۔ پس سننے والا جانتا ہے کہ وہ عماء جسے رب کے لیے اَین (کہاں ہونے) کا محل بنایا گیا، وہ ایسا عماء ہے جو اٹھایا ہوا نہیں ہے۔ پھر اللہ تعالیٰ کا یہ قول آیا:\n> **هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ الله فِي ظُلَلٍ مِنَ الْغَمَامِ**\n> (کیا وہ اس کے سوا کسی اور چیز کا انتظار کر رہے ہیں کہ اللہ بادلوں کے سائے میں ان کے پاس آ جائے؟)\n\nتو کیا یہ غمام (بادل) اسی عماء کی طرف لوٹتا ہے؟ پس عماء عرش کو اٹھانے والا ہو، اور عرش رحمن کا مستویٰ ہو، تو قیامت عماء اور عرش کو جمع کر دے؟ یا یہ وہی مقصود مقام ہے جس کے اوپر ہوا ہے اور نیچے ہوا ہے؟ پس اس مقام کا مالک ان سب کا علم عطا کرتا ہے۔\n\n### [رب کا عرش سے آسمانِ دنیا پر نزول]\n\nپھر اس مقام کا مالک اسم رحمن (الرحمن) کے ذریعے اس نوع کے الٰہی علوم میں سے یہ بھی عطا کرتا ہے کہ رب کا عرش سے آسمانِ دنیا پر نزول ہوتا ہے، یا عماء سے؟ کیونکہ عماء کا ذکر تب آیا جب اسم رب (الرب) کے بارے میں سوال کیا گیا، تو آپ صلی اللہ علیہ وسلم سے پوچھا گیا:\n> **أين كان ربنا قبل أن يخلق خلقه فقال كان في عماء ما فوقه هواء وما تحته هواء**\n> (ہمارا رب اپنی مخلوق کو پیدا کرنے سے پہلے کہاں تھا؟ آپ نے فرمایا: وہ ایک عماء میں تھا، جس کے اوپر ہوا نہیں تھی اور نہ ہی اس کے نیچے ہوا تھی۔)\n\nپس ضمیر میں پوشیدہ اسم 'کان' (تھا) ہمارا رب ہے۔ اور آپ نے فرمایا: \"ہمارا رب آسمان پر نازل ہوتا ہے۔\"\nیہ تمہیں بتاتا ہے کہ اس کا آسمانِ دنیا پر نزول اسی عماء سے ہے، جیسا کہ اس کا عرش پر استواء اسی عماء سے تھا۔ پس اس کی نسبت آسمانِ دنیا کی طرف وہی ہے جو اس کی نسبت عرش کی طرف ہے، کوئی فرق نہیں۔ پس وہ آسمانِ دنیا پر نزول میں عرش سے جدا نہیں ہوا، اور نہ ہی عرش پر یا آسمانِ دنیا پر نزول میں عماء سے جدا ہوا۔ اور جب نبی صلی اللہ علیہ وسلم نے خبر دی کہ اللہ اس نزول کے بارے میں آسمانِ دنیا پر فرماتا ہے:\n> **هل من تائب فأتوب عليه هل من مستغفر فاغفر له هل من سائل فأعطيه هل من داع فأجيبه‏**\n> (کیا کوئی توبہ کرنے والا ہے کہ میں اس کی توبہ قبول کروں؟ کیا کوئی مغفرت چاہنے والا ہے کہ میں اسے بخش دوں؟ کیا کوئی سوال کرنے والا ہے کہ میں اسے عطا کروں؟ کیا کوئی دعا کرنے والا ہے کہ میں اس کی دعا قبول کروں؟)\n\nیہ سب اس کی رحمت اور لطف کے باب سے ہے۔ اور یہ اسم رحمن (الرحمن) کی حقیقت ہے جو عرش پر استواء (استوى) فرمایا۔ پس یہ صفت اسم رب (الرب) کے ساتھ آسمانِ دنیا پر نازل ہوئی ہے۔ اور یہ وہی ہے جو ہم نے تمہیں بتایا کہ ہر اسمِ الٰہی تمام اسمائے الٰہیہ کے حکم کو اپنے اندر شامل رکھتا ہے، اس لحاظ سے کہ مسمیٰ (ذات) ایک ہے۔\n\n### [رب کا عماء سے آسمان پر نزول]\n\nپس اس مقام کا مالک اس ربانی سماوی نزول میں سے وہ چیز جانتا ہے جو اسم رحمن (الرحمن) کے ساتھ خاص ہے، جس کے بارے میں اس نے فرمایا: \"کیا کوئی توبہ کرنے والا ہے؟ کیا کوئی مغفرت چاہنے والا ہے؟\" کیونکہ رحمن بلا شک اس قول کا طالب ہے۔ پس یہ اس علم کا حصہ ہے جو اس مقام کا مالک بلا واسطہ جانتا ہے۔ اور وہ اسم رحمن کے واسطے سے رب کا عماء سے آسمان پر نزول جانتا ہے، کیونکہ اسم رب (الرب) کا اس مقام کے مالک پر کوئی تسلط نہیں ہے۔ جیسا کہ ہم نے کہا، وہ اسم رحمن کا شخص ہے۔ پس وہ اسم رب یا کسی اور اسم سے کوئی امر نہیں جانتا مگر اسم رحمن کے ذریعے سے۔ پس وہ اس وقت رحمن کے مطلع کرنے سے جانتا ہے کہ ذات حق (الحق) نے عماء سے آسمان پر اس طرح نزول سے کیا ارادہ فرمایا۔ یہی اس کی معرفت ہے۔\n\n### [مومن کا دل رحمن کا عرش‏]\n\nپھر ان علوم میں سے جو اس مقام کے مالک کے ساتھ اسم رحمن کے واسطے سے خاص ہیں، وہ اللہ کے اس قول کا علم ہے:\n> **ما وسعني أرضي ولا سمائي ووسعني قلب عبدي المؤمن‏**\n> (میری زمین اور میرا آسمان میری وسعت میں نہ آ سکے، لیکن میرے مومن بندے کا دل میری وسعت میں آ گیا۔)\n\nپس اس نے وسعت (السعة) اور عبودیت (العبودية) میں یاءِ اضافت (یاء الإضافة) لایا۔ پس اس نے اللہ سے صرف اتنی ہی مقدار لی جو یاء خاص طور پر عطا کرتی ہے۔ اور یہ دو علوم کو شامل کرتا ہے: ایک وہ علم جو اس کے مومن بندے کی عنایت (العناية) میں ہے، جسے وہ اسم رحمن سے بذاتِ خود لیتا ہے، اور دوسرا وہ علم جو یاء کے حرف کے ساتھ اضافت کے راز میں ہے، جسے وہ اللہ سے اسم رحمن کی ترجمانی کے ذریعے لیتا ہے۔ پس وہ جانتا ہے کہ یہاں وسعت سے مراد وہ صورت (الصورة) ہے جس پر انسان کو پیدا کیا گیا، گویا وہ کہہ رہا ہے کہ میرے تمام اسماء صرف انسانی نشأت (النشأة الإنسانية) میں ہی ظاہر ہوئے ہیں۔ اللہ تعالیٰ فرماتا ہے:\n> **وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا**\n> (اور اس نے آدم کو تمام نام سکھا دیے۔)\n\nیعنی وہ اسمائے الٰہیہ جن سے تمام کائناتیں وجود میں آئیں، اور جو فرشتوں کو نہیں دیے گئے۔ اور نبی صلی اللہ علیہ وسلم نے فرمایا:\n> **إن الله خلق آدم على صورته‏**\n> (بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا۔)\n\nاگرچہ ہمارے نزدیک ضمیر کا مرجع آدم کی طرف لوٹنا بھی ممکن ہے، جس میں اہل فکر کے بعض نظریات پر رد ہے، اور اللہ کی طرف لوٹنا بھی ممکن ہے، کیونکہ وہ تمام اسمائے الٰہیہ سے متخلق ہے۔ پس تم نے جان لیا کہ یہ وسعت مومن بندے نے صرف اس لیے قبول کی کہ وہ اس صورت (الصورة) پر ہے، جیسا کہ آئینے نے دیکھنے والے کی صورت کو قبول کیا، نہ کہ کسی اور چیز کو جس میں صقالت (چمک) اور صفائی نہ ہو۔ اور یہ وسعت آسمان کو اس لیے حاصل نہ ہوئی کہ وہ شفاف ہے، اور نہ ہی زمین کو اس لیے کہ وہ غیر مصقول (غیر چمکدار) ہے۔ پس یہ اس بات کی دلیل ہے کہ اگرچہ انسان کی تخلیق فلکی حرکات سے ہوئی جو اس کے باپ ہیں، اور قابل عناصر سے ہوئی جو اس کی ماں ہیں، لیکن اس کے لیے ذات حق (الحق) کی طرف سے ایک ایسا امر ہے جو نہ اس کے آباء میں ہے اور نہ اس کی امہات میں، اور اسی امر نے اللہ کے جلال کو وسعت دی۔ کیونکہ اگر یہ اس کے باپ یعنی آسمان، یا اس کی ماں یعنی زمین، یا ان دونوں کی طرف سے ہوتا، تو آسمان اور زمین اس بات کے زیادہ حقدار ہوتے کہ وہ ذات حق کو اپنے اندر سمو لیں، بہ نسبت اس کے جو ان سے پیدا ہوا۔ خاص طور پر جب اللہ تعالیٰ فرماتا ہے:\n> **لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ**\n> (یقیناً آسمانوں اور زمین کی تخلیق لوگوں کی تخلیق سے بڑی ہے، لیکن اکثر لوگ نہیں جانتے۔)\n\nاس سے مراد معنی میں بزرگی ہے، نہ کہ جسامت میں۔ اس کے باوجود، انسان کو ایک ایسے امر کے ساتھ خاص کیا گیا جس نے اسے یہ وسعت عطا کی، جس سے آسمان اور زمین تنگ پڑ گئے۔ پس یہ وسعت اسے صرف اللہ کی طرف سے ایک دوسرے امر کی وجہ سے ملی، جس کے ذریعے اسے آسمان اور زمین پر فضیلت دی گئی۔ پس عالم میں ہر ایک فاضل بھی ہے اور مفضول بھی۔ عالم میں ہر ایک کو اس کی فضیلت سے فضیلت دی گئی ہے، حکمتِ احتیاج اور نقص کی وجہ سے جو اللہ کے سوا ہر چیز میں ہے۔ پس جب انسان اس وسعت پر فخر کرے اور آسمان و زمین پر بڑائی جتائے، تو اس کے پاس اللہ کا یہ قول آتا ہے: **لَخَلْقُ السَّمَاوَاتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ**۔ اور جب آسمان اور زمین اس آیت کے ذریعے انسان پر فخر کریں، تو یہ قول آتا ہے:\n> **ما وسعني أرضي ولا سمائي ووسعني قلب عبدي‏**\n\nپس یہ علم اس سے اور ان دونوں سے وہ فخر اور بڑائی دور کر دیتا ہے، اور سب اپنے رب کے محتاج ہو جاتے ہیں، اور اپنے فخر اور نفس سے پردے میں آ جاتے ہیں۔ اور اللہ کا قول: **وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ** اس بات کی دلیل ہے کہ بعض لوگ یہ جانتے ہیں۔ اور اس علم کو جاننے والوں میں سے اس شخص نے اسم رحمن (الرحمن) سے جانا جو اس کے لیے ہے اور جس کے ذریعے وہ متحقق ہوا: **فَاسْأَلْ بِهِ خَبِيرًا** (پس اس کے بارے میں کسی باخبر سے پوچھو)۔ پس جب اس نے اس علم پر فخر کیا جس سے اسے آسمان و زمین پر فضیلت دی گئی، تو رحمن نے اس پر رحم کیا، اور اس نے جان لیا کہ اسے اسم رحمن سے صرف اتنی ہی مقدار میں کشف ہوا ہے جس میں اس کی دوا ہے۔ کیونکہ وہ امر جس کے ذریعے اس بندے کو آسمان و زمین پر فضیلت دی گئی، وہ بھی اسم رحمن کی طرف سے ہے جو اس نے اس بندے پر عطا کیا۔\n\n### [انسان ایک جامع نسخہ]\n\nاور یہ نہ کہو کہ یہ اس کے عالم کا نسخہ ہونے پر طعن ہے، بلکہ وہ حقیقت میں ایک جامع نسخہ (نسخة جامعة) ہے، اس اعتبار سے کہ اس میں کسی نہ کسی پہلو سے آسمان کا کچھ حصہ ہے، اور کسی نہ کسی پہلو سے زمین کا کچھ حصہ ہے، اور کسی نہ کسی پہلو سے ہر چیز کا کچھ حصہ ہے، نہ کہ تمام پہلوؤں سے۔ کیونکہ انسان حقیقت میں مخلوقات کے مجموعے میں سے ہے، اسے آسمان یا زمین یا عرش نہیں کہا جاتا، لیکن یہ کہا جاتا ہے کہ وہ فلاں پہلو سے آسمان سے مشابہت رکھتا ہے، اور فلاں پہلو سے زمین سے، اور فلاں پہلو سے عرش سے، اور فلاں پہلو سے عنصرِ نار سے، اور فلاں پہلو سے رکنِ ہوا سے، اور پانی اور زمین اور عالم کی ہر چیز سے۔ پس اس اعتبار سے وہ ایک نسخہ ہے، اور اس کا نام انسان ہے، جیسا کہ آسمان کا نام آسمان ہے۔\n\n### [قرآنی نزول اور فرقانی تنزل]\n\nاور اس مقام کے مالک کے علوم میں سے قرآن کا فرقان (فرقان) کے طور پر نزول ہے، نہ کہ قرآن (قرآن) کے طور پر۔ پس اگر وہ اسے قرآن کے طور پر جانتا ہے، تو وہ اسم رحمن (الرحمن) سے نہیں ہے۔ بلکہ اسم رحمن نے اس کے لیے کسی دوسرے اسمِ الٰہی کی ترجمانی کی ہے جو اسم رحمن میں شامل ہے، اور یہ کہ وہ ایک مبارک رات میں نازل ہوا، جو شبِ قدر (ليلة القدر) ہے۔\nپس اس کے نزول سے اشیاء کی مقداریں اور ان کے اوزان معلوم ہوئے، اور اس کی قدر سے اس کا علم ہوا۔ جیسا کہ رب تعالیٰ رات کے آخری تہائی حصے میں نازل ہوتا ہے۔ پس رات ذات حق (الحق) اور اس کی صفت یعنی قرآن کے زمانی نزول کا محل ہے۔ اور رات کا آخری تہائی حصہ رب کے نزول میں محمد صلی اللہ علیہ وسلم کا غیب (غيب) تھا، اور اس انسانی نوع کا غیب تھا۔ کیونکہ غیب پردہ ہے اور رات پردہ ہے۔ اور رات کے اس باقی حصے کو تہائی اس لیے کہا گیا کہ یہ انسانی نشأت (النشأة الإنسانية) دارِ خلود میں ہمیشہ باقی رہنے والی ہے۔ کیونکہ پہلے دو تہائی حصے رات کے آخری یا باقی تہائی حصے کے وجود سے چلے گئے۔ اس میں ذات حق نازل ہوئی، پس اس نے اس کے لیے بھی بقا کو واجب کر دیا۔ اور یہ ایسی رات ہے جس کے بعد کبھی صبح نہیں ہوتی، پس یہ ختم نہیں ہوتی، لیکن ایک حال سے دوسرے حال میں اور ایک گھر سے دوسرے گھر میں منتقل ہوتی ہے، جیسا کہ رات سورج کے سامنے ایک جگہ سے دوسری جگہ منتقل ہوتی ہے۔ اور وہ سورج کے سامنے سے صرف اس لیے بھاگتی ہے تاکہ اس کی عین (ذات) ختم نہ ہو جائے، کیونکہ نور ظلمت کے منافی ہے، اور ظلمت اس کے منافی ہے۔ لیکن نور کا سلطان زیادہ قوی ہے۔ پس نور ظلمت کو بھگاتا ہے، اور ظلمت نور کو نہیں بھگاتی۔ بلکہ نور منتقل ہوتا ہے، تو ظلمت اس جگہ ظاہر ہوتی ہے جہاں نور کی عین نہیں ہوتی۔ کیا تم نہیں دیکھتے کہ ذات حق نے اپنا نام نور (النور) رکھا اور ظلمت (الظلمة) نہیں رکھا؟ کیونکہ نور وجود ہے اور ظلمت عدم ہے۔ اور چونکہ نور پر ظلمت غالب نہیں آتی، بلکہ نور غالب ہے، اسی طرح ذات حق پر مخلوق غالب نہیں آتی، بلکہ ذات حق غالب ہے۔ پس اس نے اپنا نام نور رکھا۔\n\n### [انسان وجود کی رات کا باقی ماندہ تہائی حصہ ہے]\n\nپس آسمان چلا جائے گا، جو رات کا پہلا تہائی حصہ ہے، اور زمین چلی جائے گی، جو رات کا دوسرا تہائی حصہ ہے، اور انسان دارِ آخرت میں ہمیشہ ہمیشہ کے لیے باقی رہے گا، جو رات کا باقی ماندہ تہائی حصہ ہے۔ اور وہ ان دو والدین—آسمان اور زمین—کا بیٹا ہے۔ پس قرآن مبارک رات میں اس کے آخری تہائی حصے میں نازل ہوا، جو انسان کامل (الإنسان الكامل) ہے۔ پس اس میں ہر حکیمانہ امر کو فرق کیا گیا (تمیز کیا گیا)، پس وہ بقا کے لحاظ سے اپنے والدین سے ممتاز ہوا۔ **نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلَى قَلْبِكَ** (اسے روح الامین نے آپ کے دل پر نازل کیا)۔ وہ محمد صلی اللہ علیہ وسلم ہیں۔ کیا تم نہیں دیکھتے کہ شارع (نبی صلی اللہ علیہ وسلم) نے زنا کے بچے کے بارے میں کس طرح فرمایا:\n> **إنه شر الثلاثة**\n> (وہ تینوں میں سب سے برا ہے۔)\n\nاور اسی طرح حلال کا بچہ تینوں میں سب سے بہتر ہے۔\nیہ صرف اس خاص پہلو سے ہے۔ کیونکہ وہ پانی جس سے بچہ مرد اور عورت سے پیدا ہوتا ہے، وہ نکلنا چاہتا تھا، اور وہ پانی جس سے بچہ بنتا ہے، وہ تیسرا امر ہے۔ پس جب وہ نکلنا چاہتا تھا تو اس نے والدین کو نکاح کے لیے حرکت دی تاکہ وہ نکلے۔ اور ان کی حرکت اگر شرعی طور پر پسندیدہ طریقے پر نہ ہو تو اسے سفاح (زنا) کہا جاتا ہے۔ پس اس کے بارے میں کہا گیا کہ وہ تینوں میں سب سے برا ہے، یعنی وہ اس حرکت کا سبب ہے جس کی وجہ سے ان پر شر کا نام لاگو ہوا۔ پس اس نے اسے تین تہائی حصوں میں تقسیم کیا: والدین دو تہائی اور بچہ تیسرا۔ اسی طرح رات کو تین تہائی حصوں میں تقسیم کیا گیا: دو تہائی جانے والے، جو آسمان اور زمین ہیں، اور ایک تہائی باقی رہنے والا، جو انسان ہے۔ اور اسی میں رحمن کی صورت ظاہر ہوئی، اور اسی میں قرآن نازل ہوا۔ اور آسمان اور زمین کو رات اس لیے کہا گیا کہ ظلمت ان کی اپنی ذات سے ہے، اور ان میں روشنی غیر سے ہے، یعنی روشن اجسام جیسے سورج اور اس کی مثالیں۔ پس جب سورج غائب ہو جاتا ہے تو آسمان اور زمین تاریک ہو جاتے ہیں۔\n\n### [منزلِ انفاس: اس میں متحقق شخص کے علوم‏]\n\nپس اے میرے بھائی! تم نے ایسے علوم حاصل کیے ہیں جنہیں تم اس سے پہلے نہیں جانتے تھے، اور یہ اس شخص کے علوم ہیں جو منزلِ انفاس (منزل الأنفاس) میں متحقق ہے۔ اور اس شخص نے جو کچھ بھی ادراک کیا، وہ صرف قوتِ شمیہ (سونگھنے کی قوت) کے ذریعے روائح (خوشبوؤں) سے ادراک کیا، اور بس۔ اور ہم نے ان میں سے ایک جماعت کو اشبیلیہ، مکہ اور بیت المقدس میں دیکھا، اور ہم نے ان سے اس بارے میں حال کی مفاوضت (گفتگو) کی، نہ کہ نطق (زبان) کی۔ جیسا کہ میں نے بصری نظر کے حامل ایک دوسرے گروہ سے بصارت کے ذریعے مفاوضت کی۔ میں سوال کرتا اور وہ جواب دیتے، اور ہم سوال کرتے اور ہم جواب دیتے، صرف نظر کے ذریعے، ہمارے درمیان کوئی معتاد کلام نہیں تھا اور نہ ہی نظر کا کوئی اصطلاح تھا۔ لیکن جب میں اسے دیکھتا تو وہ سب کچھ جان لیتا جو میں اس سے چاہتا تھا، اور جب وہ مجھے دیکھتا تو وہ سب کچھ جان لیتا جو میں اس سے چاہتا تھا۔ پس اس کی نظر میری طرف سوال یا جواب ہوتی، اور میری نظر اس کی طرف بھی اسی طرح ہوتی۔ پس ہم بغیر کلام کے بہت سے علوم حاصل کر لیتے تھے۔ اور اس شخص کے بعض علم کے لیے یہ مقدار کافی ہے، کیونکہ اس کے علوم بہت زیادہ ہیں جن کا ہم نے احاطہ کیا ہے۔ پس جو شخص اس میں سے کچھ جاننا چاہے جو ہم نے ذکر کیا ہے، تو اسے 'فی' (میں) کے فرق کو جاننا چاہیے، اللہ کے اس قول میں: **كَانَ فِي عَمَاءٍ** (وہ عماء میں تھا)، اور 'علی' (پر) کے فرق کو اس کے قول میں: **الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى** (رحمن عرش پر متمکن ہوا)، اور اس نے 'فی' نہیں کہا، جیسا کہ اس نے آسمان اور رات کے بارے میں کہا۔ اور جو کچھ ہم نے ذکر کیا ہے، اس میں تمہیں مقامِ جمع الجمع (جمع الجمع)، مقامِ جمع (الجمع)، مقامِ تفرقہ (التفرقة)، اور مراتب کی تمیز کا مقام واضح ہو جائے گا۔ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے۔) انیسواں حصہ مکمل ہوا۔",
    "fa": "باب سی و چهارم در معرفت شخصی که در منزل انفاس (الأنفاس) متحقق شده و اموری را از آن مشاهده کرده است که ان‌شاءالله ذکر خواهم کرد.\n\nآنکه به انفاس (الأنفاس) متحقق گشته، رحمان است،\nپس عرش در حق او، اگر انسان باشد، [مقام اوست].\nو اگر به سوی عین (العين) متوجه شود و آن را بطلبد،\nعماء (العماء) و احسان است و احسان.\nمقام او باطن اعراف (الأعراف) است که در آن ساکن است،\nو یاران و مددکاران در آنجا به دیدارش می‌آیند.\nاگر آخر شب را تحقیق کنی، از آنِ اوست،\nهمان‌گونه که از وجود عین (العين)، انسان از آنِ اوست.\nاگر ظاهرش آشکار شود، می‌گویی قرآن است،\nو اگر باطنش آشکار شود، می‌گویی فرقان است.\nخداوند هر فضیلتی را در او جمع کرده است،\nپس او کمالی است که هیچ نقصی در آن نیست.\n\n### [ادراکات و معلومات]\n\nبدان، خداوند تو را به روح القدس تأیید کند، که معلومات (المعلومات) ذاتاً متفاوت هستند و ادراکاتی (الإدراكات) که معلومات با آن‌ها درک می‌شوند نیز ذاتاً مانند معلومات متفاوت‌اند، اما از حیث نفس و ذات خود، نه از حیث ادراک بودنشان، هرچند این مسئله نزد اهل نظر مورد اختلاف است. خداوند برای هر حقیقتی که قابلیت دانسته شدن دارد، ادراکی خاص قرار داده است، به صورت عادت، نه از حیث حقیقت (الحقيقة) یعنی محل آن. و مدرِک (المدرِك) این ادراکات برای این مدرَکات، یک عین (العين) واحد قرار داده است که شش چیز است: شنوایی، بینایی، بویایی، لامسه، چشایی و عقل. ادراک همه این‌ها نسبت به اشیاء، به جز عقل، ضروری است، اما اشیائی که به طور عادت به آن‌ها مرتبط شده‌اند، هرگز خطا نمی‌کنند. گروهی از عقلا در این باره دچار اشتباه شده و خطا را به حس نسبت داده‌اند، در حالی که چنین نیست؛ بلکه خطا از جانب حاکم (العقل) است.\n\n### [معرفت عقلی و حسی]\n\nاما ادراک معقولات (المعقولات) توسط عقل بر دو قسم است: قسمی ضروری است، مانند سایر ادراکات، و قسمی ضروری نیست، بلکه علم به آن نیازمند شش ابزار است که پنج تای آن‌ها همان حواس پنج‌گانه مذکور و ششمین آن‌ها قوه متفکره (القوة المفكرة) است. هیچ معلومی که مخلوقی بتواند آن را بداند، از ادراک شدن توسط یکی از این ادراکات خالی نیست. و اما اینکه گفتیم گروهی در ادراک حواس دچار اشتباه شده و خطاها را به آن‌ها نسبت داده‌اند، به این دلیل است که وقتی در کشتی‌ای هستند که در کنار ساحل حرکت می‌کند، ساحل را در حال حرکت می‌بینند که با حرکت کشتی همراه است. در این حالت، بصر (بینایی) چیزی را به آن‌ها داده که اصلاً حقیقت و معلوم نیست، زیرا آن‌ها به صورت ضروری می‌دانند که ساحل از جای خود حرکت نکرده است، اما نمی‌توانند آنچه را که از حرکت مشاهده کرده‌اند، انکار کنند. همچنین وقتی شکر یا عسل می‌چشند و آن را تلخ می‌یابند، در حالی که شیرین است، به صورت ضروری می‌دانند که حس چشایی آن‌ها دچار اشتباه شده و چیزی را که صحیح نیست، منتقل کرده است. اما امر نزد ما چنین نیست، بلکه قصور و خطا از جانب حاکم که همان عقل است، واقع شده است، نه از حواس. زیرا ادراک حواس نسبت به آنچه حقیقتشان اقتضا می‌کند، ضروری است، همان‌گونه که عقل در آنچه به ضرورت درک می‌کند، خطا نمی‌کند؛ اما در آنچه با حواس یا فکر درک می‌کند، ممکن است دچار اشتباه شود. پس حس هرگز خطا نکرده است و آنچه ادراکش ضروری است نیز خطا نمی‌کند. شکی نیست که حس حرکت را دیده است و شکی نیست که طعم تلخ را یافته است. پس بصر (بینایی) حرکت را به ذات خود درک کرده و چشایی، نیروی تلخی را به ذات خود درک کرده است. سپس عقلی آمده و حکم کرده است که ساحل متحرک است و شکر تلخ است. و عقل دیگری آمده و گفته است که خلط صفراوی در محل چشایی قرار گرفته و تلخی را درک کرده است و آن خلط میان قوه چشایی و شکر حائل شده است. بنابراین، چشایی جز تلخی صفرا را نچشیده است. پس دو عقل از دو شخص بر این امر اجماع کرده‌اند که تلخی بدون شک ادراک شده است، اما در مورد اینکه چه چیزی مدرِک طعم است، اختلاف کرده‌اند. پس روشن شد که عقل خطا کرده است، نه حس. بنابراین، در حقیقت، خطا هرگز به شاهد (الحس) نسبت داده نمی‌شود، بلکه به حاکم (العقل) نسبت داده می‌شود. و نزد من در این مسئله امر دیگری است که با ادعای آن‌ها مخالف است، و آن این است که شیرینی موجود در شیرینی‌ها و سایر خوردنی‌ها، در خود خوردنی نیست، به دلیلی که اگر در آن تحقیق کنی، صحت نظر ما را خواهی یافت. و حکم در سایر ادراکات نیز چنین است. و اگر به طور عادت، مدرِک دیگری بالاتر از عقل وجود داشت که بر عقل حکم می‌کرد و از آن می‌گرفت، همان‌گونه که عقل بر حس حکم می‌کند، آن مدرِک حاکم نیز در آنچه برای عقل ضروری است، دچار اشتباه می‌شد و می‌گفت که عقل در آنچه برایش ضروری است، خطا کرده است.\n\n### [ادراک خارق عادت و معرفت صوفیانه]\n\nپس هنگامی که این امر تثبیت شد و دانستی که خداوند چگونه مدرَکات و ادراکات را سامان داده و این ارتباط امری عادی است، بدان که خداوند بندگان دیگری دارد که عادت را برایشان در ادراک علوم شکسته است. از جمله آن‌ها کسی است که ادراک آنچه با تمام قوا از معقولات (المعقولات) و محسوسات درک می‌شود، به طور خاص با قوه بینایی به او داده شده است، و دیگری با قوه شنوایی، و همین‌طور با تمام قوا. سپس با امور عرضی‌ای غیر از قوا، مانند ضربه، حرکت، سکون و غیره.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «خداوند دست خود را بین دو کتف من زد، پس سردی انگشتانش را بین دو پستانم یافتم، و علم اولین و آخرین را دانستم.»\n\nپس در این علم، هر معلوم معقول و محسوس که مخلوق آن را درک می‌کند، داخل شد. این علمی است که نه از طریق قوای حسی و نه معنوی حاصل شده است. به همین دلیل گفتیم که سبب دیگری غیر از این قوا وجود دارد که معلومات با آن درک می‌شوند. و اینکه گفتیم علوم ممکن است با غیر از قوای معتاد خود درک شوند، و ما بر این ادراکات برای مدرَکات معتادشان به عادت حکم کردیم، به خاطر متفرّس (صاحب فراست) است. صاحب فراست به شخص می‌نگرد و می‌داند که چه چیزی از او سر خواهد زد، یا چه چیزی در باطن او خطور کرده، یا چه کاری انجام داده است. و همچنین زاجر (پیش‌گو) و امثال او. ما این‌ها را آوردیم تا زمینه‌ای فراهم کنیم برای آنچه می‌خواهیم به اهل الله از انبیا و اولیا نسبت دهیم، در مورد علومی که آن‌ها به غیر از طرق معتاد درک می‌کنند. هنگامی که آن‌ها این علوم را درک می‌کنند، به آن صفتی که با آن معلومات را درک کرده‌اند، نسبت داده می‌شوند. پس می‌گویند: فلان شخص صاحب نظر است، یعنی با نظر، همه معلومات را درک می‌کند. و من این را با رسول خدا (صلی الله علیه و سلم) چشیده‌ام. و فلان شخص صاحب سمع است، و فلان شخص صاحب طعم، و صاحب نفس و انفاس (الأنفاس) یعنی بویایی، و صاحب لمس، و فلان شخص صاحب معنی است. و این از این‌ها خارج است، بلکه همان‌گونه است که در میان عوام گفته می‌شود: صاحب فکر صحیح است. پس به برخی از مردم، نظر تا آخرین قوا، به اندازه‌ای که به او داده شده، اعطا شده است، و این برای او عادتی است اگر بر آن استمرار یابد، زیرا از \"عود\" (بازگشت) مشتق شده است، یعنی در هر نظر یا در هر بوییدن، آن امر بر او باز می‌گردد و غیر از آن نیست.\n\n### [اسماء الهی و معارف صوفیانه]\n\nهمچنین بدان که اسماء الهی (الأسماء الإلهية) نیز این‌گونه‌اند و هر اسمی حقیقتی خاص می‌بخشد، اما در قوه آن است که هر یک از اسماء الهی، آنچه را که همه اسماء می‌بخشند، عطا کند. خداوند متعال می‌فرماید: **قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏** (بگو: «الله را بخوانید یا رحمان را بخوانید؛ هر کدام را بخوانید، پس نیکوترین نام‌ها [از آنِ] اوست»). همچنین اگر هر اسمی ذکر شود، در مورد آن گفته می‌شود که اسماء حسنی (الأسماء الحسنى) از آنِ اوست، و این به دلیل احدیت (الأحدية) مسمّی است. پس این را بدان. برخی از مردم به اسم «الله» اختصاص می‌یابند، پس معارفشان الهی (إلهية) می‌شود، و برخی به اسم «الرحمن» اختصاص می‌یابند، پس معارفشان رحمانیه (رحمانية) می‌شود. همان‌گونه که در قوای کونی گفته می‌شود: معارف این شخص نظری است و در حق دیگری سمعی است، پس او از عالم نظر و عالم سمع و عالم انفاس (الأنفاس) است. به همین ترتیب، معارف او در الهیات به اسم الهی‌ای که در آن برایش گشایش یافته، نسبت داده می‌شود و حقایق همه اسماء در آن مندرج می‌گردد.\n\n### [معرفت رحمانیه و منزل انفاس]\n\nپس هنگامی که این را نیز دانستی، بدان که اسم الهی‌ای که در این باب به این شخص معین اختصاص دارد، اسم «الرحمن» است، و از میان قوا، قوه بویایی به او اختصاص دارد که متعلق آن روایح (بوها) است و آن همان انفاس (الأنفاس) است. پس او در نسبت قوا از عالم انفاس و در مراتب اسماء از رحمانیون است. بنابراین می‌گوییم که معرفت این شخص معین در این باب، خواه زید باشد یا عمرو، رحمانیه (رحمانية) است. پس هر امری که در کتاب یا سنت به اسم «الرحمن» نسبت داده شود، به این شخص نسبت داده می‌شود، زیرا این اسم، مددکار اوست و هیچ اسم الهی دیگری بر او حکمی ندارد مگر به واسطه این اسم، به هر صورتی که باشد. به همین دلیل می‌گوییم که خداوند سبحان در مواضعی، رحمت خود را در عذاب و نقمتش پنهان کرده است، مانند بیمار که در عذاب بیماری‌اش، رحمت خود را قرار داده است، به این دلیل که گناهانش را کفاره می‌کند. پس این رحمت در نقمت است. همچنین کسی که در اجرای حد، از قتل یا ضرب، از او انتقام گرفته می‌شود، این عذابی حاضر است که در آن رحمتی باطنی وجود دارد که به واسطه آن، مطالبه از او در سرای آخرت برداشته می‌شود. همان‌گونه که در نعمت دنیوی خود از اسم «المنعم»، نقمت خود را پنهان کرده است. پس او اکنون به چیزی نعمت می‌دهد که به واسطه آن در سرای آخرت یا در زمان توبه عذاب خواهد کشید. زیرا انسان هنگامی که توبه می‌کند و در آنچه از محرمات لذت برده است، نظر و فکر می‌کند، آن صور مستحضر بر او به عذاب تبدیل می‌شوند، در حالی که قبل از توبه، هنگامی که آن‌ها را در ذهن خود حاضر می‌کرد، نهایت لذت را می‌برد. پس منزه است کسی که رحمت خود را در عذابش و عذابش را در رحمتش، و نعمتش را در نقمتش و نقمتش را در نعمتش پنهان کرده است. و امر پنهان (المبطون) همیشه روح عین (العين) ظاهر است، هر چه که باشد. از آنجا که معرفت این شخص رحمانیه بود و اسم «الرحمن» بر عرش استوا (الاستواء) یافت، چنانکه خداوند متعال فرمود: **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏** (رحمان بر عرش استیلا یافت)، همت این شخص عرشی بود. همان‌گونه که عرش برای رحمان بود، همت نیز برای این معرفت، محل استوای آن شد. پس گفته شد همت او عرشی است. و مقام این شخص باطن اعراف (الأعراف) است، و آن دیواری است که میان اهل سعادت و شقاوت قرار دارد. برای اعراف مردانی هستند که ذکر خواهند شد، و آن‌ها کسانی هستند که صفتی آن‌ها را مقید نکرده است، مانند ابویزید و غیر او. و مقام او باطن اعراف است، زیرا معرفتش رحمانیه و همتش عرشی است. همان‌گونه که عرش، مستوای رحمان است، باطن اعراف نیز رحمت دارد، همان‌گونه که ظاهرش عذاب دارد.\n\n### [رحمت، عرش ذات الهی]\n\nپس این شخص نسبت به همه موجودات، اعم از گناهکاران، کفار و دیگران، رحمت دارد.\n\nخداوند متعال به سرور این مقام، یعنی محمد (صلی الله علیه و سلم)، هنگامی که بر قبیله‌های رعل و ذکوان و عُصَیّه به عذاب و انتقام دعا کرد و فرمود: «بر فلان و فلان باد» و آنچه از آن‌ها سر زده بود را ذکر کرد، خداوند به او فرمود: «خداوند تو را دشنام‌دهنده و لعنت‌کننده مبعوث نکرده است، بلکه تو را رحمت مبعوث کرده است.»\n\nپس او را از دعا کردن علیه آن‌ها و دشنام دادن به آن‌ها و آنچه ناخوش می‌دارند، نهی کرد و خداوند عز و جل بر او نازل فرمود: **وَما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ** (و تو را جز رحمتی برای جهانیان نفرستادیم). پس این رحمت شامل همه عالم شد، یعنی تا بر آن‌ها رحم کنی و برای آن‌ها دعا کنی، نه علیه آن‌ها. پس به جای اینکه بگوید: «خداوند آن‌ها را لعنت کند»، می‌گوید: «خداوند توبه آن‌ها را بپذیرد و هدایتشان کند»، همان‌گونه که\n\nهنگامی که او را زخمی کردند، فرمود: «خداوندا، قوم مرا هدایت کن، زیرا آن‌ها نمی‌دانند.»\n\nمنظور او کسانی بودند که او را تکذیب کردند، از غیر اهل کتاب و مقلدین اهل کتاب، نه دیگران. به همین دلیل در حق این شخص صاحب این مقام گفتیم که او نسبت به گناهکاران و کفار رحیم است. پس اگر این شخص حاکم باشد و حدی را اجرا کند، یا از کسانی باشد که شهادت دادن برای اجرای حدی بر او واجب است و شهادت دهد یا آن را اجرا کند، آن را اجرا نمی‌کند مگر از باب رحمت و از اسم «الرحمن» در حق کسی که حد بر او جاری می‌شود و کسی که علیه او شهادت داده می‌شود، نه از باب انتقام و طلب تشفی. این مقام این اسم چنین اقتضایی ندارد و حال این شخص آن را نمی‌بخشد. خداوند متعال در داستان ابراهیم (علیه السلام) می‌فرماید: **إِنِّي أَخافُ أَنْ يَمَسَّكَ عَذابٌ مِنَ الرَّحْمنِ** (من می‌ترسم که عذابی از جانب رحمان به تو برسد).\n\n### [استوائیت عرش و اینیت عماء]\n\nو کسی که این مقام و معرفت (المعرفة) را دارد و این اسم «الرحمن» به او نظر می‌کند، از اسرار، به صورت ذوقی (ذوقاً) مشاهده می‌کند که آیا نسبت استواء (الاستواء) به عرش و نسبت أین (الأين - کجا بودن) به عماء (العماء) بر یک حد هستند یا متفاوت‌اند. و می‌داند که حق (الحق) چه نعت‌هایی از جلال و لطف را همزمان میان عماء و استواء دارد، زیرا او در عماء بود و عرشی وجود نداشت تا به استواء بر آن وصف شود. سپس عرش را خلق کرد و با اسم «الرحمن» بر آن استوا یافت. و عرش حدی دارد که با آن از عماء که اسم «الرب» است، متمایز می‌شود، و عماء نیز حدی دارد که با آن از عرش متمایز می‌شود. و ناگزیر باید از صفتی به صفتی دیگر منتقل شد. پس نعت خداوند متعال میان عماء و عرش چه بود، یا به چه نسبتی میان آن دو ظاهر شد، در حالی که هر یک از آن‌ها با حد و حقیقت خود از دیگری متمایز شده است؟ همان‌گونه که عماء که بالای آن هوا و زیر آن هواست (و آن ابر رقیقی است که هوای زیر و بالای آن، آن را حمل می‌کند) از عماء که بالای آن هوا نیست و زیر آن هوا نیست (و آن عماء غیرمحمول است) متمایز می‌شود. پس شنونده می‌داند که عماء که برای رب (الرب) أینیت (کجا بودن) قرار داده شده، عماء غیرمحمول است. سپس قول خداوند متعال آمد: **هَلْ يَنْظُرُونَ إِلَّا أَنْ يَأْتِيَهُمُ الله فِي ظُلَلٍ مِنَ الْغَمامِ** (آیا جز این انتظار دارند که خداوند در سایه‌هایی از ابرهای تیره به سوی آنان آید؟). آیا این غمام (ابر) به آن عماء باز می‌گردد، به طوری که عماء حامل عرش باشد و عرش مستوای رحمان باشد، و قیامت میان عماء و عرش جمع کند؟ یا این همان مقام مقصود است که بالای آن هوا و زیر آن هواست؟ صاحب این مقام علم همه این‌ها را می‌بخشد.\n\n### [نزول رب از عرش به آسمان دنیا]\n\nسپس صاحب این مقام، از علوم الهی از این نوع، به واسطه اسم «الرحمن»، علم نزول رب (الرب) به آسمان دنیا را نیز می‌بخشد. آیا این نزول از عرش است یا از عماء (العماء)؟ زیرا عماء تنها هنگامی وارد شد که سؤال از اسم «الرب» مطرح شد. پس به او گفته شد: «پروردگار ما قبل از خلق خلقش کجا بود؟» فرمود: «در عماء بود، که نه بالای آن هوا بود و نه زیر آن هوا.»\n\nاسم ضمیر «کان» (بود) همان پروردگار ماست. و فرمود: «پروردگار ما به آسمان نازل می‌شود.»\n\nاین امر دلالت می‌کند بر اینکه نزول او به آسمان دنیا از همان عماء است، همان‌گونه که استوای او بر عرش از همان عماء بود. پس نسبت او به آسمان دنیا مانند نسبت او به عرش است و تفاوتی نیست. او در نزولش به آسمان دنیا، عرش را ترک نکرد و در نزولش به عرش و نه به آسمان دنیا، عماء را ترک نکرد. و هنگامی که پیامبر (صلی الله علیه و سلم) خبر داد که خداوند در این نزول به آسمان دنیا می‌فرماید: «آیا توبه‌کننده‌ای هست تا توبه‌اش را بپذیرم؟ آیا استغفارکننده‌ای هست تا او را ببخشم؟ آیا سائل و درخواست‌کننده‌ای هست تا به او عطا کنم؟ آیا دعاکننده‌ای هست تا اجابتش کنم؟»\n\nهمه این‌ها از باب رحمت و لطف اوست، و این حقیقت اسم «الرحمن» است که **عَلَى الْعَرْشِ اسْتَوى‏** (بر عرش استیلا یافت). پس این صفت همراه با اسم «الرب» به آسمان دنیا نازل شد. و این همان چیزی است که به تو آگاهاندیم که هر اسم الهی، حکم همه اسماء الهی را در بر می‌گیرد، از آن جهت که مسمّی واحد است.\n\n### [نزول رب از عماء به آسمان]\n\nپس صاحب این مقام از این نزول ربانی سماوی، آنچه را که به اسم «الرحمن» اختصاص دارد و با آن فرموده است: «آیا توبه‌کننده‌ای هست؟ آیا استغفارکننده‌ای هست؟»، می‌داند. زیرا رحمان بدون شک این سخن را می‌طلبد. این بهره‌ای است که صاحب این مقام از این نزول بدون واسطه می‌داند. و نزول رب (الرب) از عماء (العماء) به آسمان را به واسطه اسم «الرحمن» می‌داند، زیرا اسم «الرب» بر صاحب این مقام سلطه‌ای ندارد، چرا که او، همان‌گونه که گفتیم، اسم «الرحمن» است. پس هیچ امری را از اسم «الرب» یا غیر آن نمی‌داند مگر به واسطه اسم «الرحمن». در این هنگام، با آگاهاندن رحمان به او، می‌داند که حق (الحق) از نزولش از عماء به آسمان چه اراده کرده است. معرفت او بر این وجه است.\n\n### [قلب مؤمن عرش رحمان]\n\nسپس از جمله علومی که به واسطه اسم «الرحمن» به علم صاحب این مقام اختصاص دارد، علم به قول خداوند است: «زمین و آسمان من گنجایش مرا نداشتند، اما قلب بنده مؤمن من گنجایش مرا داشت.»\n\nپس «یاء» اضافه را در سعه و عبودیت آورد، پس او از خداوند جز به اندازه آنچه «یاء» به طور خاص می‌بخشد، دریافت نکرد. این امر شامل دو علم است: علمی در مورد عنایتی که در آن نسبت به بنده مؤمنش وجود دارد، که آن را از خود اسم «الرحمن» می‌گیرد؛ و علمی در مورد راز اضافه با حرف «یاء»، که آن را از خداوند با ترجمه اسم «الرحمن» می‌گیرد. پس می‌داند که منظور از سعه در اینجا، صورتی است که انسان بر آن خلق شده است. گویی می‌گوید: همه اسماء من جز در نشئه انسانی (النشأة الإنسانية) ظاهر نشدند. خداوند متعال می‌فرماید: **وَعَلَّمَ آدَمَ الْأَسْماءَ كُلَّها** (و همه اسماء را به آدم آموخت)، یعنی اسماء الهی‌ای که همه اکوان (الأكوان) از آن‌ها به وجود آمدند و به ملائکه داده نشدند. و پیامبر (صلی الله علیه و سلم) فرمود: «خداوند آدم را بر صورت خود آفرید.»\n\nاگرچه ضمیر نزد ما متوجه است که به آدم بازگردد، که در این صورت ردی بر برخی از اهل نظر و اندیشه است، و همچنین متوجه است که به خداوند بازگردد، به دلیل تخلق او به همه اسماء الهی. پس دانستی که این سعه را بنده مؤمن پذیرفت، به دلیل اینکه بر صورت (الصورة) است، همان‌گونه که آینه صورت بیننده را می‌پذیرد، نه چیزهای دیگر را که در آن‌ها صیقل و صفایی نیست. و این سعه برای آسمان به دلیل شفافیتش و برای زمین به دلیل صیقلی نبودنش حاصل نشد. پس دلالت می‌کند بر اینکه خلقت انسان، اگرچه از حرکات فلکی که پدر او هستند و از عناصر قابل که مادر او هستند، نشأت گرفته است، اما از جانب حق (الحق) امری در اوست که نه در پدران و نه در مادران اوست. از آن امر، جلال خداوند متعال گنجایش یافت. زیرا اگر این امر از جانب پدرش که آسمان است یا مادرش که زمین است یا از هر دوی آن‌ها بود، آسمان و زمین سزاوارتر بودند که حق را در خود بگنجانند تا کسی که از آن‌ها متولد شده است. به ویژه که خداوند متعال می‌فرماید: **لَخَلْقُ السَّماواتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ** (آفرینش آسمان‌ها و زمین بزرگ‌تر از آفرینش مردم است، ولی بیشتر مردم نمی‌دانند). منظور در معناست، نه در جرمیت. با این حال، انسان به امری اختصاص یافت که این سعه را به او داد، سعه‌ای که آسمان و زمین از آن تنگ آمدند. پس این سعه برای او حاصل نشد مگر از جهت امر دیگری از جانب خداوند که او را به واسطه آن بر آسمان و زمین برتری داد. پس هر یک از عالم، فاضل و مفضول است. هر یک از عالم به واسطه فضلی که به او داده شده، برتری یافته است، به دلیل حکمت افتقار و نقصی که بر هر آنچه غیر از خداست، حاکم است. پس اگر انسان به این سعه فخر کند و بر زمین و آسمان برتری جوید، قول خداوند متعال به او می‌رسد: **لَخَلْقُ السَّماواتِ وَالْأَرْضِ أَكْبَرُ مِنْ خَلْقِ النَّاسِ**. و اگر آسمان و زمین به واسطه این آیه بر انسان فخر کنند، قول او می‌آید: «زمین و آسمان من گنجایش مرا نداشتند، اما قلب بنده من گنجایش مرا داشت.» پس این علم، آن فخر و غرور را از او و از آن دو زائل می‌کند و همه به پروردگار خود محتاج می‌شوند و از غرور و نفس خود محجوب می‌گردند. و قول او: **وَلكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ** دلالت می‌کند بر اینکه برخی از مردم آن را می‌دانند. و علم این امر از علم او به ما، از اسم «الرحمن» است که از آنِ اوست و به واسطه آن متحقق شده است. **فَسْئَلْ بِهِ خَبِيراً** (پس درباره آن از آگاه بپرس). پس هنگامی که به علم آنچه به واسطه آن بر آسمان و زمین برتری یافته، فخر کرد، خداوند بر او رحم کرد. و از آن دانست که از اسم «الرحمن» جز به اندازه آنچه برایش کشف شده و در آن دوای اوست، حاصل نکرده است. زیرا آن امری که این بنده به واسطه آن بر آسمان و زمین برتری یافت، نیز از اسم «الرحمن» است که بر این بنده بخشیده است.\n\n### [انسان نسخه جامع]\n\nو مگو که این امر طعنه‌ای بر نسخه بودن او از عالم است، بلکه او در حقیقت نسخه جامع (نسخة جامعة) است، به این اعتبار که چیزی از آسمان را به وجهی و چیزی از زمین را به وجهی و چیزی از هر چیز را به وجهی در خود دارد، نه از همه وجوه. زیرا انسان در حقیقت از جمله مخلوقات است و درباره او گفته نمی‌شود که آسمان است یا زمین یا عرش، بلکه گفته می‌شود که او از فلان وجه شبیه آسمان است و از فلان وجه شبیه زمین و از فلان وجه شبیه عرش و از فلان وجه شبیه عنصر آتش و از فلان وجه شبیه رکن هوا و آب و زمین و هر چیز دیگری در عالم است. پس به این اعتبار، او نسخه است و نام «انسان» را دارد، همان‌گونه که آسمان نام «آسمان» را دارد.\n\n### [نزول قرآنی و تنزل فرقانی]\n\nو از جمله علوم صاحب این مقام، نزول قرآن به صورت فرقان (الفرقان) است، نه قرآن (القرآن). پس اگر آن را به صورت قرآن بداند، از اسم «الرحمن» نیست، بلکه اسم «الرحمن» آن را از اسم الهی دیگری که اسم «الرحمن» متضمن آن است، برای او ترجمه کرده است. و اینکه قرآن در شبی مبارک، یعنی شب قدر (ليلة القدر)، نازل شد. پس با نزول آن، مقادیر اشیاء و اوزان آن‌ها شناخته شد و قدر خود را از آن شناخت، همان‌گونه که رب (الرب) متعال در ثلث باقی‌مانده از شب نازل شد. پس شب، محل نزول زمانی حق (الحق) و صفت او که همان قرآن است، می‌باشد. و ثلث باقی‌مانده از شب در نزول رب، غیب محمد (صلی الله علیه و سلم) و غیب این نوع انسانی بود. زیرا غیب پوشش است و شب پوشش است. و این باقی‌مانده از شب، ثلث نامیده شد، زیرا این نشئه انسانی (النشأة الإنسانية) بقای دائمی در سرای خلود دارد. زیرا دو ثلث اول با وجود ثلث باقی‌مانده یا آخر شب از بین رفتند. در آن، حق نازل شد و بقا را نیز برای آن واجب کرد. و آن شبی است که هرگز صبحی به دنبال ندارد، پس از بین نمی‌رود، بلکه از حالی به حال دیگر و از سرایی به سرای دیگر منتقل می‌شود، همان‌گونه که شب از مکانی به مکان دیگر در مقابل خورشید منتقل می‌شود. و تنها به این دلیل از مقابل آن می‌گریزد تا عین (العين) آن از بین نرود، زیرا نور با ظلمت منافات دارد و ظلمت نیز با آن منافات دارد، با این تفاوت که سلطه نور قوی‌تر است. پس نور، ظلمت را می‌راند، اما ظلمت، نور را نمی‌راند، بلکه نور منتقل می‌شود و ظلمت در جایی که عین نور در آن نیست، ظاهر می‌گردد. آیا نمی‌بینی که حق (الحق) خود را «نور» نامیده و خود را «ظلمت» ننامیده است؟ زیرا نور وجود (الوجود) است و ظلمت عدم. و چون نور بر ظلمت غلبه نمی‌کند، بلکه نور غالب است، همچنین حق بر خلق غلبه نمی‌کند، بلکه حق غالب است. پس خود را نور نامید.\n\n### [انسان ثلث باقی‌مانده از شب وجود]\n\nپس آسمان که ثلث اول شب است، از بین می‌رود، و زمین که ثلث دوم شب است، از بین می‌رود، و انسان در سرای آخرت تا ابدالآبدین و بی‌نهایت باقی می‌ماند، و او ثلث باقی‌مانده از شب است. و او فرزندی است که از این دو پدر و مادر، یعنی آسمان و زمین، به وجود آمده است. پس قرآن در شب مبارک، در ثلث آخر آن، که همان انسان کامل (الإنسان الکامل) است، نازل شد. پس در آن هر امر حکیمانه‌ای تفریق شد و به واسطه بقا از پدر و مادرش متمایز گشت. **نَزَلَ بِهِ الرُّوحُ الْأَمِينُ عَلى‏ قَلْبِكَ** (روح‌الامین آن را بر قلب تو نازل کرد)، و او محمد (صلی الله علیه و سلم) است. آیا نمی‌بینی که شارع چگونه\n\nدر مورد فرزند زنا فرمود که او شرّ سه نفر است، و همچنین فرزند حلال، خیر سه نفر است؟\n\nاین امر به طور خاص از این وجه است: آبی که فرزند از آن خلق شده، از مرد و زن، قصد خروج داشت، و آن آبی است که فرزند از آن تشکیل می‌شود و امر سوم است. پس هنگامی که قصد خروج داشت، پدر و مادر را برای نکاح به حرکت درآورد تا خارج شود. و اگر حرکت دادن آن‌ها بر وجهی که شرع آن را نمی‌پسندد، باشد، سفاح (زنا) نامیده می‌شود. پس در مورد او گفته شد که او شرّ سه نفر است، یعنی او سبب حرکتی است که به واسطه آن نام شر بر آن‌ها اطلاق شد. پس آن را سه ثلث قرار داد: پدر و مادر دو ثلث و فرزند ثلث سوم. همچنین شب بر سه ثلث تقسیم شد: دو ثلث از بین رونده که آسمان و زمین هستند، و یک ثلث باقی‌مانده که انسان است. و در او صورت رحمان ظاهر شد و در او قرآن نازل گشت. و آسمان و زمین از این رو شب نامیده شدند که ظلمت از ذات خودشان است و روشنایی در آن‌ها از غیر آن‌ها، یعنی اجسام نورانی مانند خورشید و امثال آن، می‌باشد. پس هنگامی که خورشید زائل شود، آسمان و زمین تاریک می‌گردند.\n\n### [منزل انفاس: علوم شخص متحقق در آن]\n\nپس ای برادر، تو از این‌ها علومی را کسب کردی که پیش از این نمی‌دانستی، و آن علوم این شخص متحقق به منزل انفاس (الأنفاس) است. و هر آنچه این شخص درک کرده است، تنها از طریق روایح (بوها) و با قوه بویایی درک کرده است و نه چیز دیگر. ما گروهی از آن‌ها را در اشبیلیه، مکه و بیت‌المقدس دیده‌ایم و با آن‌ها در این باره به مفاوضه حال (مذاکره باطنی) پرداختیم، نه مفاوضه نطق (مذاکره کلامی). همان‌گونه که با گروه دیگری از اصحاب نظر بصری (بینایی) با بصر (بینایی) مفاوضه کردم. من سؤال می‌کردم و او جواب می‌داد، و ما سؤال می‌کردیم و جواب می‌دادیم، تنها با نگاه، بدون اینکه میان ما کلام معتاد یا اصطلاحی در نگاه وجود داشته باشد. اما من هنگامی که به او نگاه می‌کردم، همه آنچه را که از من می‌خواست، می‌دانستم، و هنگامی که او به من نگاه می‌کرد، همه آنچه را که ما از او می‌خواستیم، می‌دانست. پس نگاه او به من سؤالی بود یا جوابی، و نگاه من به او نیز چنین بود. بدین ترتیب، علوم بسیاری میان ما بدون کلام حاصل می‌شد. و همین مقدار از بخشی از علم این شخص کافی است، زیرا علوم او بسیار است و ما بر آن‌ها احاطه یافته‌ایم. پس هر کس بخواهد چیزی از آنچه ذکر کردیم بداند، باید تفاوت میان «فی» (در) در قول خداوند: «کان فی عماء» (در عماء بود) و «استوی» (استیلا یافت) در قول خداوند: **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏** (رحمان بر عرش استیلا یافت) را بداند، و اینکه نگفت «فی»، همان‌گونه که در مورد آسمان و شب گفت. و در هر آنچه ذکر کردیم، مقام جمع الجمع (جمع الجمع)، مقام جمع (الجمع)، مقام تفرقه (التفرقة) و مقام تمییز مراتب برای تو آشکار خواهد شد. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. پایان جزء نوزدهم."
  },
  "page_count": 5
}