{
  "id": 464,
  "title": {
    "ar": "الباب الرابع والستون وأربعمائة في حال قطب هجيره لا إله إلا الله",
    "en": "Chapter Four Hundred and Sixty-Four: Concerning the State of the Pole (قطب) Whose Constant Invocation is \"There is no god but Allah.\"",
    "ur": "باب چار سو چونسٹھ (۴۶۴) قطب (Qutb) کے اس حال کے بیان میں جس کا دائمی ورد (Wird) لا إله إلا الله (Lā ilāha illā Allāh) ہے۔",
    "fa": "باب چهارصد و شصت و چهارم در حال قطبِ (قطب) هجیرش (ذکر) «لا إله إلا الله» است."
  },
  "content": {
    "ar": "## «الباب الرابع والستون وأربعمائة في حال قطب هجيره لا إله إلا الله»\n\n\n> من كان هجيره نفي وإثبات *** ذاك الإمام الذي تبديه آيات‏\n\n\n> وتر وليس له شفع يعدده *** وما تقيده فينا علامات‏\n\n\n> وما له في وجود النعت من صفة *** وما له في شهود الذات لذات‏\n\n\n> تأثر الكل فيه من تأثره *** فنعتهم فيه أحياء وأموات‏\n\n\n> هم المصانون لا تحصى مناقبهم *** ولا يقوم بهم للموت آفات‏\n\n\nقال الله عز وجل فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله‏\n\n\n### [أن لكل ذكر نتيجة]\n\n\nاعلم أن الهجير هو الذي يلازمه العبد من الذكر كان الذكر ما كان ولكل ذكر نتيجة لا تكون لذكر آخر وإذا عرض الإنسان على نفسه الأذكار الإلهية فلا يقبل منها إلا ما يعطيه استعداده فأول فتح له في الذكر قبوله له ثم لا يزال يواظب عليه مع الأنفاس فلا يخرج منه نفس في يقظة ولا نوم إلا به لاستهتاره فيه ومتى لم يكن حال الذاكر على هذا فليس هو بصاحب هجير فمن كان ذكره لا إله إلا الله فمعقول ذكره الألوهة وهي مرتبة لا تكون إلا لواحد هو مسمى الله وهذه المرتبة هي التي تنفيها وهي التي تثبتها ولا تنتفي‏\nعمن تنتفي عنه بنفي النافي ولا ثبيت لمن تثبت بثبت الثابت المثبت فثبوتها لها ونفيها لها غير ذلك ما هو فلا تنتج للذاكر إلا شهودها وليس شهودها سوى العلم بها وليس معلوم هذا العلم الأنسب والنسبة أمر عدمي والحكم للنسبة والمنسوب والمنسوب إليه وبالمجموع يكون الأثر والحكم مهما أفردت واحدا من هذه الثلاثة دون الباقي لم يكن أثر ولا صح حكم فلهذا كان الإيجاد بالفردية لا بالأحدية خلافا لمن يقول إنه ما صدر إلا واحد فإنه عن واحد فهو قول صحيح لا إنه واقع ثم جاء الكشف النبوي والإخبار الإلهي بقوله عن ذات تسمى إلها إذا أراد شيئا فهذان أمران قال له كُنْ فهذا أمر ثالث والثلاثة أول الأفراد فظهر التكوين عن الفرد لا عن الأحد وهذه كلها راجعة إلى عين واحدة فإذا ظهر المكون بالتكوين عن كُنْ لم يكن غير تجلى إلهي في صورة ممكن لصورة ممكن ناظر بعين إلهي كما أنه ما سمع فيكون إلا بسمع إلهي ولهذا أسرع بالظهور لأنه المريد والمراد والقائل والمقول له والقول فحاله في التكوين أن ينطق بالله فينفخ فيه فيكون طائرا بإذن الله ثُمَّ ادْعُهُنَّ بأمره يَأْتِينَكَ سَعْياً لأنه السامع الذي دعاهن ولهذا الذكر من المعارف معرفة النفي والإيجاب والتنكير والتعريف وله من الحروف الألف المزادة والألف الطبيعية والهمزة المكسورة وألف الوصل وللام والهاء ومن الكلمات أربعة متقابلة في عين واحدة يقابل النفي منها الإثبات والإثبات النفي والمنفي الثابت والثابت المنفي فأما معرفة النفي فهو اطلاع على ما ليس هو فيما قيل فيه إنه هو وإن كان الذي قيل إنه هو صحيح كشفا لكنه محال عقلا ولهذا التزم بعض أهل الله ذكر الله الله ورأيت على هذا الذكر شيخنا أبا العباس العربي من أهل العليا من عرب الأندلس والتزم آخرون الهاء من الله لدلالتها على الهوية وجعله ذكر خاصة الخاصة وهو أبو حامد الغزالي وغيره وأما الأكابر فيلتزمون لا إله إلا الله على غير ما يعطيه النظر العقلي أي الوجود هو الله والعدم منفي الذات والعين بالنفي الذاتي والثابت ثابت لذات والعين بالإثبات الذاتي وتوجه النفي على النكرة وهو إله وتوجه الإثبات على المعرفة وهو الله وإنما توجه النفي على النكرة وهو إله لأن تحتها كل شي‏ء وما من شي‏ء إلا وله نصيب في الألوهة يدعيه فلهذا توجه عليه النفي لأن الإله من لا يتعين له نصيب فله الأنصباء كلها ولما عرف أن الإله حاز الأنصباء كلها عرفوا أنه مسمى الله وكل شي‏ء له نصيب فهو اسم من أسماء مسمى الله فالكل أسماؤه فكل اسم دليل على الهوية بل هو عينها ولهذا قال قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ وهذا حكم كل اسم تدعونه له الأسماء الحسنى فله أسماء العالم كله فالعالم كله في المرتبة الحسنى فالأمر تنكير في عين تعريف ونكرة في عين معرفة وتعريف في عين تنكير ومعرفة في عين نكرة فما ثم إلا منكور ومعروف وأما حروف هذا الهجير فالألف المزادة وهي كل ألف لها موجب يوجب الزيادة فيها والزيادة ظهور مثل على صورتها فتكون ألفان والألف أبدا ساكنة فالظاهر أحد الألفين أبدا إما عبد وإما رب وإما حق وإما خلق والموجب له في موطن رتبة التقدم وفي موطن رتبة التأخر وهما موجبان الواحد ما يدل على الاتحاد وهو التضعيف والآخر ما يدل على الباعث للتكوين أو الإعدام وهو التحقيق المعبر عنه بالمهمزة وقد يكون هذان الموجبان في مقام النزول مثل فَسْئَلِ الْعادِّينَ ولا إِلهَ إِلَّا الله وإِي ورَبِّي إِنَّهُ لَحَقٌّ وقد يكون في مقام رَفِيعُ الدَّرَجاتِ وسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى مثل يُحَادُّونَ الله وأَوْلِياءُ أُولئِكَ وأُوتُوا الْكِتابَ وقد يكون الموجب في مقام البرزخ وهو الوسط مثل من حَادَّ الله وآتَيْناهُ الْحُكْمَ صَبِيًّا ولَأَنْتُمْ أَشَدُّ رَهْبَةً في صُدُورِهِمْ فإن كان الموجب اسم فاعل ربا كان الموجب أو خلقا وإن كان الموجب خلقا كان الموجب بفتح الجيم حقا فأثر ظاهر من خلق في حق أُجِيبُ دَعْوَةَ الدَّاعِ وأثر ظاهر من حق في خلق كُنْ فَيَكُونُ وذلك أما عن باعث وإما عن اتحاد والإيجاد\n\n\nإبداله له الاسم الآخر ليس له في الأول قدم والباعث يكون له الأول والآخر فالباعث حق وخلق والإيجاد حق وخلق إلا أنه لا يكون حقا مفردا إلا بخلق كالمعرفة بالله من حيث كونه إلها لا يكون إلا بخلق لا بد من ذلك فهي حق في خلق والخلق متأخر حيث عقل أبدا وأما الألف الطبيعية في مثل قال وسارَ فهو الأمر الواحد الذي يجمع الطبيعة فيظهر العالم ويفرقها فيفني العالم وهو الأصل المفرق المجمع وكل ألف مزادة فإنما تظهر على حكم التشبيه بها والموجب لهذا الأمر المفرق المجمع إنما هو الفتح وهو الأصل وقد يكون الفتح بما يسر\nوهو الرحمة وبما يسوء وهو فتح العذاب‏\n\n\n### [فتح العذاب على نوعين‏]\n\n\nوهو على نوعين فتح عذاب فيه رحمة وفتح عذاب لا يشوبه رحمة إلا عندنا فإنه ما ثم عذاب لا يشوبه رحمة قط فإن الرحمة وَسِعَتْ كُلَّ شَيْ‏ءٍ وأما الميل الطبيعي وهو مثل الألف التي يسمى واو علة وياء علة فهو ميلها إلى جانب الحق مثل قولوا ومثل فيه وأما الهمزة المكسورة في هذا الذكر فهو باعث الحق إلى النزول إلى السماء الدنيا وإلى كل ما يكون لجانب الخلق هذا في باعث الحق وأما إذا كان باعث الخلق فهو إن نظره في نفسه يبعثه على التعمل في تحصيل علمه بربه فلذلك كانت الهمزة مكسورة في النفي وفي كلمة الإثبات والمنفي مكسور أبدا وأما ألف الوصل فهو وصل علم بتمييز مع وجود تشبيه إن لم يكن هناك وجود تشبيه فهي ألف قطع لا ألف وصل وأما اللام فهي جبروتية لأنها من الوسط من رفيع الدرجات والهاء ملكوتية فإنها من الصدر من أول مجرى النفس وهي أصلية في هاتين الكلمتين في المنفي والمثبت وما ثم إلا هويتان هوية خلق وهي المنفية في دعواها ما ليس لها وهوية حق وهي الثابتة فإنها لم تزل فإن العبد من حيث عينه هالك وإذا كان الحق هويته فليس هو ففي كل وجه ما هو هو فتنتفى هوية الحق إذا لبست الخلق ولا تنفي هوية الخلق إذا لبست الحق فعلى كل حال ما ثم إلا حق ثابت غير منفي وأما الكلمات الأربع أداة نفي على منفي وأداة إثبات على ثابت وبقي لمن يضاف العمل هل للاداة أو للذي دخلت عليه فإن كان الحكم لمن دخلت عليه فإنه الذي يطلبها فإنه ما انتفى بها وإنما جاءت الأداة معرفة للسامع بأن الذي دخلت عليه منفي أو ثابت وما عملت الأداة فيمن دخلت عليه إلا تعيين مرتبة العلو أو السفل أو ما بينهما فبالأداة تظهر المراتب وبمن دخلت عليه تتعين الأداة الخاصة من غيرها من الأدوات كما ارتبط وجود الخلق بالحق وارتبط وجود العلم القديم بالمحدث فهذا بعض ما ينتجه لا إله إلا الله من العلم الإلهي وله ستة وثلاثون وجها يعطي كل وجه ما لا يعطيه الوجه الآخر قد ذكرنا هذه الوجوه في باب النفس بفتح الفاء\n\n\n### [إن الحروف تقسمه حقيقية]\n\n\nواعلم أنه ما قسمنا الحروف تقسيم من يعقل على طريق التجوز بل ذلك على الحقيقة فإن الحروف عندنا وعند أهل الكشف والايمان حروف اللفظ وحروف الرقم وحروف التخيل أمم من جملة الأمم لصورها أرواح مدبرة فهي حية ناطقة تسبح الله بحمده طائعة ربها فمنها ما يلحق بعالم الجبروت ومنها ما يلحق بعالم الملكوت ومنها ما يلحق بعالم الملك فما الحروف عندنا كما هي عند أهل الحجاب الذين أعماهم الله وجعل عَلى‏ أَبْصارِهِمْ غِشاوَةٌ وهم ينظرون كما قال تعالى وتَراهُمْ يَنْظُرُونَ إِلَيْكَ وهُمْ لا يُبْصِرُونَ فإذا قال العبد لا إله إلا الله كان خلاقا لهذه الكلمات فتسبح خالقها ويحق لها ذلك والحق منزه بالأصالة لا بتنزيه المنزه وقد نسب تعالى الخلق لعبده ووصف نفسه بالأحسن فيه في قوله أَحْسَنُ الْخالِقِينَ فيعود تسبيح هذه الكلمة وكل كلمة على قائلها فإذا كان العبد من أهل الكشف لما ذكرناه هو الذي نقل عنه من الرجال إنه قال سبحاني ولا علم لمن كفره بذلك‏\n\n\n> فكن مع القوم حيث كانوا *** ولا تكن دونهم فتشقى‏\n\n\n> فإنما القوم أهل كشف *** أراهم الله الحق حقا\n\n\n> فهم عباد الإله صدقا *** رقوا من العلم كل مرقى‏\n\n\nوقد تقدم في الحروف في هذا الكتاب كلام مختصر شاف في الباب الثاني من هذا الكتاب في صغارها وكبارها والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 464: Concerning the State of the Pole (قطب) Whose Constant Invocation (هجيره) is \"There is no god but Allah\"\n\nHe whose constant invocation is negation and affirmation,\nThat is the Imam whom signs reveal.\n\nHe is the Odd (وتر), having no even counterpart to number him,\nAnd no signs restrict him among us.\n\nHe has no attribute in the existence of description,\nAnd no pleasure in the witnessing (شهود) of the Essence (الذات) for the Essence.\n\nThe whole is affected in him by his being affected,\nSo their description in him is living and dead.\n\nThey are the protected ones whose virtues cannot be counted,\nAnd the calamities of death do not stand against them.\n\nAllah, the Mighty and Majestic, said: <<So know that there is no god but Allah>> (Quran 47:19).\n\n### [That Every Invocation Has a Result]\n\nKnow that the constant invocation (الهجير) is the remembrance (*dhikr*) that the servant constantly adheres to, whatever that remembrance may be. Every remembrance has a result that is unique and not shared by another remembrance. When a person presents the Divine invocations to himself, he accepts only what his preparedness (*isti'dād*) grants him. The first opening (*fath*) for him in the invocation is his acceptance of it. Then he continues to adhere to it constantly with every breath, so that no breath leaves him, whether in wakefulness or sleep, except with it, due to his absorption in it. If the state of the invoker is not like this, he is not a master of the constant invocation (صاحب هجير).\n\nFor the one whose invocation is *La ilaha illa Allah* (There is no god but Allah), the intelligible meaning of his invocation is Divinity (الألوهة). This is a Level (مرتبة) that belongs only to the One named Allah. This Level is what you negate and what you affirm. It is not negated from the one from whom it is negated by the negation of the negator, nor is it affirmed for the one for whom it is affirmed by the affirmation of the affirming affirmer. Its affirmation belongs to it, and its negation belongs to it; nothing else is what it is. Therefore, it produces nothing for the invoker except the witnessing (شهود) of it.\n\nThe witnessing of it is nothing but the Knowledge (العلم) of it. The object of this Knowledge is the most appropriate relationship (النسبة الأنسب), and the relationship is a non-existent matter (أمر عدمي). The ruling (الحكم) belongs to the relationship, the related object (المنسوب), and the object to which it is related (المنسوب إليه). The effect and the ruling occur through the totality. If you isolate one of these three without the others, there is no effect and the ruling is invalid.\n\nFor this reason, creation (الإيجاد) occurs through Singularity (الفردية), not through Absolute Oneness (الأحدية), contrary to those who say that only one thing emanated, for it emanated from One—which is a sound statement, but not the reality of the occurrence. Then came the Prophetic Unveiling (الكشف النبوي) and the Divine communication, speaking of an Essence (ذات) called a God (*Ilāh*) when He wills a thing—these are two matters. He said to it, \"Be!\" (كُنْ)—this is a third matter. The number three is the first of the odd numbers (الأفراد). Thus, the bringing into existence (التكوين) appeared from the Singular (الفرد), not from the Absolutely One (الأحد). Yet, all of these return to a single immutable Essence (عين واحدة).\n\nWhen the thing brought into existence (المكون) appears through the bringing into existence from \"Be!\" (كُنْ), it is nothing but a Divine Theophany (تجلى إلهي) in the form of a contingent thing, for the sake of a contingent form, observing with a Divine eye. Just as nothing is heard in the process of \"it comes into being\" except by a Divine hearing. For this reason, it hastened to appear, because He is the Willer, the Willed, the Speaker, the Spoken-to, and the Speech. His state in the bringing into existence is that He speaks by Allah, then breathes into it, so it becomes a bird by Allah's permission. <<Then call them>> by His command, <<they will come to you in haste>> (Quran 2:260), because He is the Hearer who called them.\n\nThis invocation possesses, among the Gnostic Knowledges (المعارف), the knowledge of negation (النفي), affirmation (الإيجاب), indefiniteness (التنكير), and definiteness (التعريف). It also possesses, among the letters, the augmented *alif*, the natural *alif*, the broken *hamza*, the connecting *alif* (alif al-wasl), the *lām*, and the *hā’*. And among the words are four opposites in a single immutable Essence (عين واحدة): negation opposes affirmation, affirmation opposes negation, the negated opposes the affirmed, and the affirmed opposes the negated.\n\nAs for the knowledge of negation, it is an awareness of what is not Him, in that which is said to be Him—even if what is said to be Him is true by Unveiling (كشفا), it is rationally impossible (محال عقلا). For this reason, some of the People of Allah (أهل الله) adhered to the invocation *Allah, Allah*. I saw our Shaykh Abu al-Abbas al-Arabi, one of the noble Arabs of Andalusia, adhering to this invocation. Others adhered to the letter *hā’* (ه) from *Allah*, because it signifies the Ipseity (Huwiyya / الهوية), making it the invocation of the elect of the elect. This includes Abu Hamid al-Ghazali and others.\n\nAs for the Great Masters (الأكابر), they adhere to *La ilaha illa Allah* (There is no god but Allah) in a way that transcends rational consideration. That is, Existence (الوجود) is Allah, and non-existence is negated from the Essence (الذات) and the Immutable Essence (العين) by essential negation, while the affirmed is affirmed for the Essence and the Immutable Essence by essential affirmation.\n\nThe negation is directed toward the indefinite term, which is *ilāh* (god), and the affirmation is directed toward the definite term, which is *Allah*. The negation is directed toward the indefinite *ilāh* because everything falls under it. There is nothing that does not claim a share in Divinity (الألوهة). Therefore, the negation is directed toward it, because the God (*al-Ilāh*) is the one for whom no share is specified; rather, He possesses all shares. When it is known that the God (*al-Ilāh*) has acquired all shares, they know that He is the One named Allah. Everything that has a share is a Name (اسم) among the Names of the One named Allah. Thus, all are His Names. Every Name is a proof of the Ipseity (الهوية); indeed, it is the Ipseity itself. For this reason, He said: <<Say, \"Call upon Allah or call upon the Most Merciful. Whichever you call upon—to Him belong the Most Beautiful Names (الأسماء الحسنى).\">> (Quran 17:110). This is the ruling for every Name you call upon: to Him belong the Most Beautiful Names. Thus, He possesses the names of the entire Cosmos (العالم). The entire Cosmos is in the Most Beautiful Level (المرتبة الحسنى). The matter is indefiniteness in the very Essence (عين) of definiteness, and indefinite in the very Essence of definite knowledge (معرفة), and definiteness in the very Essence of indefiniteness, and definite knowledge in the very Essence of the indefinite. Thus, there is nothing there except the indefinite and the definite.\n\nAs for the letters of this constant invocation (*hajir*): The augmented *alif* (الألف المزادة) is every *alif* that has a cause (*mūjib*) necessitating its augmentation. Augmentation is the appearance of a likeness upon its form, resulting in two *alifs*. The *alif* is always quiescent (sākin). The apparent one of the two *alifs* is always either servant or Lord, either The Real (الحق) or Creation (الخلق). The cause for it is, in one place, the Level of Precedence (التقدم), and in another place, the Level of Posteriority (التأخر). These are two causes: one indicates Union (الاتحاد), which is doubling (التضعيف); and the other indicates the Impetus (الباعث) for creation or annihilation, which is the verification expressed by the *hamza*.\n\nThese two causes may be in the Station of Descent (مقام النزول), such as <<So ask those who count (الْعَادِّينَ)>> (Quran 23:113), and *La ilaha illa Allah*, and <<Yes, by my Lord (إِي ورَبِّي), indeed, it is the truth>> (Quran 10:53). And they may be in the Station of <<Exalter of Ranks (رَفِيعُ الدَّرَجَاتِ)>> (Quran 40:15) and <<Glorify the Name of your Lord, the Most High (سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى)>> (Quran 87:1), such as <<They oppose Allah (يُحَادُّونَ الله)>> (Quran 58:5), <<Those are the allies (أَوْلِيَاءُ أُولَئِكَ)>> (Quran 46:13), and <<They were given the Scripture (أُوتُوا الْكِتَابَ)>> (Quran 3:23). The cause may also be in the Station of the Isthmus (البرزخ), which is the middle, such as <<Whoever opposes Allah (مَنْ حَادَّ اللَّهَ)>> (Quran 58:5), <<And We gave him judgment while yet a boy (آتَيْنَاهُ الْحُكْمَ صَبِيًّا)>> (Quran 19:12), and <<You are surely a greater fear in their breasts (لَأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ)>> (Quran 59:13).\n\nIf the cause (*mūjib*) is an active participle, then the caused (*mūjab*) is Lord or creation. If the cause is creation, then the caused (*mūjab*) is The Real (الحق). An effect apparent from creation in The Real is <<I answer the call of the caller (أُجِيبُ دَعْوَةَ الدَّاعِ)>> (Quran 2:186). An effect apparent from The Real in creation is <<Be! and it is (كُنْ فَيَكُونُ)>> (Quran 2:117). This occurs either through an Impetus (باعث) or through Union (اتحاد) and bringing into existence (الإيجاد).\n\nThe substitution of the other Name for Him has no precedence in the first. The Impetus possesses the First and the Last. Thus, the Impetus is The Real and creation, and the bringing into existence is The Real and creation. However, He is not The Real (الحق) singularly except through creation, just as Gnosis (المعرفة) of Allah, in terms of His being a God (*Ilāh*), cannot occur except through creation; this is necessary. Thus, it is The Real in creation, and creation is always posterior where it is rationally conceived.\n\nAs for the natural *alif* (الألف الطبيعية), as in *qāla* (said) and *sāra* (traveled), it is the Single Command (الأمر الواحد) that gathers Nature (الطبيعة), thereby manifesting the Cosmos (العالم), and disperses it, thereby annihilating the Cosmos. It is the original principle that disperses and gathers. Every augmented *alif* appears only according to the ruling of resemblance to it. The cause for this dispersing and gathering Command is the Opening (الفتح), which is the Origin. The Opening may be through what brings joy, which is Mercy (الرحمة), or through what brings distress, which is the opening of punishment (فتح العذاب).\n\n### [The Opening of Punishment is of Two Types]\n\nIt is of two types: the opening of punishment that contains Mercy, and the opening of punishment that is not mixed with Mercy—except according to us, for there is absolutely no punishment that is not mixed with Mercy, since <<My Mercy encompasses all things (وَسِعَتْ كُلَّ شَيْءٍ)>> (Quran 7:156).\n\nAs for the natural inclination (الميل الطبيعي), which is like the *alif* called the *wāw* of prolongation and the *yā’* of prolongation, it is its inclination toward the side of The Real (الحق), such as in *qūlū* (say) and *fīhi* (in him).\n\nAs for the broken *hamza* (الهمزة المكسورة) in this invocation, it is the Impetus of The Real toward descending to the lowest heaven and toward everything that belongs to the side of creation. This is concerning the Impetus of The Real. But if it is the impetus of creation, then his contemplation of himself impels him to exert effort in acquiring Knowledge (علم) of his Lord. Therefore, the *hamza* is broken in the negation and in the word of affirmation, and the negated is always broken (i.e., in the genitive case).\n\nAs for the connecting *alif* (ألف الوصل), it is the connection of Knowledge (علم) with distinction, provided there is a presence of resemblance (تشبيه). If there is no presence of resemblance, it is a separating *alif* (alif al-qat‘), not a connecting *alif*.\n\nAs for the *lām*, it is related to the Realm of Power (Jabarūtiyya / جبروتية) because it is from the middle, from the Exalter of Ranks (رفيع الدرجات). The *hā’* is related to the Realm of Dominion (Malakūtiyya / ملكوتية) because it is from the chest, from the beginning flow of the breath. Both are essential in these two words: the negated and the affirmed.\n\nThere are only two Ipseities (هويتان): the Ipseity of creation (خلق), which is negated in its claim to what does not belong to it, and the Ipseity of The Real (حق), which is affirmed, for it is eternal. For the servant, in terms of his immutable essence (عينه), is perishable. If The Real is his Ipseity, then he is not himself. Thus, in every aspect, what is, is not him. The Ipseity of The Real is negated when it wears creation, but the Ipseity of creation is not negated when it wears The Real. In any case, there is nothing there except The Real, affirmed and not negated.\n\nAs for the four words: an instrument of negation upon the negated, and an instrument of affirmation upon the affirmed. It remains to be seen to whom the action is attributed: to the instrument or to that upon which it entered. If the ruling belongs to that upon which it entered, then it is the one that seeks the instrument, for it was not negated by the instrument. Rather, the instrument came to inform the listener that what it entered upon is negated or affirmed. The instrument only acts upon that which it enters by specifying the Level (مرتبة) of highness, lowness, or what is between them. Through the instrument, the Levels appear, and through that upon which it entered, the specific instrument is distinguished from other instruments. Just as the existence of creation (الخلق) is linked to The Real (الحق), and the existence of pre-eternal Knowledge (العلم القديم) is linked to the originated (المحدث). This is part of what *La ilaha illa Allah* produces of Divine Knowledge (العلم الإلهي). It has thirty-six aspects, each yielding what the other aspects do not. We have mentioned these aspects in the Chapter on the Soul (*Nafs* with *fatha*).\n\n### [That the Division of Letters is Real]\n\nKnow that we have not divided the letters as one who understands metaphorically, but rather this is based on Reality (الحقيقة). For the letters, according to us and the People of Unveiling (أهل الكشف) and faith, whether they are letters of pronunciation, letters of writing, or letters of Imagination (التخيل), are nations among the nations. Their forms possess governing spirits (أرواح مدبرة). They are living and speaking, glorifying Allah with His praise, obedient to their Lord. Some of them belong to the Realm of Power (عالم الجبروت), some to the Realm of Dominion (عالم الملكوت), and some to the Realm of the Visible World (عالم الملك).\n\nThus, the letters are not with us as they are with the People of the Veil (أهل الحجاب), whom Allah has blinded, placing <<a covering over their eyes (عَلَى أَبْصَارِهِمْ غِشَاوَةٌ)>> (Quran 2:7), even while they look, as He, the Exalted, said: <<And you see them looking at you while they do not perceive (وَتَرَاهُمْ يَنْظُرُونَ إِلَيْكَ وَهُمْ لَا يُبْصِرُونَ)>> (Quran 7:198).\n\nWhen the servant says *La ilaha illa Allah*, he is a creator (*khallāq*) of these words, and they glorify their creator, which is their right. The Real (الحق) is essentially transcendent, not by the transcendence declared by the transcender. He, the Exalted, attributed creation to His servant and described Himself as the most beautiful in it, in His saying: <<the Best of creators (أَحْسَنُ الْخَالِقِينَ)>> (Quran 23:14). Thus, the glorification of this word, and every word, returns to its speaker. If the servant is one of the People of Unveiling (أهل الكشف), as we mentioned, he is the one from whom it was transmitted among men that he said, \"Glory be to me!\" (Subhānī), and there is no knowledge for the one who deems him an infidel for that.\n\nSo be with the People wherever they are,\nAnd do not be beneath them, lest you suffer.\n\nFor the People are truly the People of Unveiling,\nWhom Allah has shown The Real (الحق) as The Real.\n\nThey are truly the servants of the God (الإله),\nThey have ascended every ascent of Knowledge (العلم).\n\nA concise and sufficient discussion regarding the letters, both minor and major, has already been presented in the second chapter of this book. And Allah <<speaks the Truth (يَقُولُ الْحَقَّ) and guides to the way (وَهُوَ يَهْدِي السَّبِيلَ)>> (Quran 33:4).",
    "ur": "باب نمبر چار سو چونسٹھ: اس قطب کے حال میں جس کا ہجیر (لازمی ذکر) \"لا إله إلا الله\" ہے۔\n\nجس کا ہجیر (لازمی ذکر) نفی اور اثبات ہو،\nوہ ایسا امام ہے جسے آیات ظاہر کرتی ہیں۔\nوہ طاق (وتر) ہے اور اس کا کوئی جوڑا (شفع) نہیں جسے شمار کیا جائے،\nاور نہ ہی ہماری نشانیاں اسے مقید کرتی ہیں۔\nوجودِ نعت میں اس کے لیے کوئی صفت نہیں،\nاور نہ ہی شہودِ ذات (شهود الذات) میں اس کے لیے کوئی لذت ہے۔\nسب اس میں اس کے اثر سے متاثر ہوئے،\nپس ان کی صفت اس میں زندہ اور مردہ ہیں۔\nوہ محفوظ ہیں، ان کے مناقب کا احاطہ نہیں کیا جا سکتا،\nاور موت کی آفات ان پر غالب نہیں آتیں۔\n\nاللہ عزوجل نے فرمایا: \"پس جان لو کہ اللہ کے سوا کوئی معبود نہیں\" (فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله‏)۔\n\n### [کہ ہر ذکر کا ایک نتیجہ ہے]\n\nجان لو کہ ہجیر (الہجیر) وہ ذکر ہے جسے بندہ لازم پکڑ لیتا ہے، ذکر خواہ کوئی بھی ہو۔ اور ہر ذکر کا ایک ایسا نتیجہ ہوتا ہے جو کسی دوسرے ذکر کا نہیں ہوتا۔ جب انسان اپنے نفس پر الٰہی اذکار پیش کرتا ہے تو وہ ان میں سے صرف وہی قبول کرتا ہے جو اس کی استعداد اسے دیتی ہے۔ ذکر میں اس کی پہلی فتح اس کا قبول کرنا ہے۔ پھر وہ سانسوں کے ساتھ اس پر مسلسل مواظبت کرتا ہے، پس بیداری یا نیند میں کوئی سانس اس کے بغیر نہیں نکلتا، کیونکہ وہ اس میں مستغرق ہو چکا ہوتا ہے۔ اور جب تک ذاکر کا حال یہ نہ ہو، وہ صاحبِ ہجیر نہیں ہے۔\n\nپس جس کا ذکر \"لا إله إلا الله\" ہو، اس کے ذکر کا معقول الوہیت (الألوهة) ہے، اور یہ وہ مرتبہ ہے جو صرف ایک ہی کے لیے ہے، جو مسمیٰ اللہ ہے۔ یہ وہی مرتبہ ہے جس کی تم نفی کرتے ہو اور یہی وہ ہے جسے تم ثابت کرتے ہو۔ اور یہ اس سے نفی نہیں ہوتی جس سے نفی کرنے والے کی نفی کے ذریعے نفی کی جائے، اور نہ ہی یہ اس کے لیے ثابت ہوتی ہے جس کے لیے ثابت کرنے والے کے اثبات کے ذریعے ثابت کی جائے۔ پس اس کا ثبوت اس کے لیے ہے اور اس کی نفی اس کے لیے ہے۔ اس کے علاوہ جو کچھ ہے وہ نہیں ہے۔\n\nلہٰذا یہ ذاکر کے لیے شہود (الشهود) کے سوا کوئی نتیجہ پیدا نہیں کرتا، اور اس کا شہود اس کے علم کے سوا کچھ نہیں ہے۔ اور اس علم کا معلوم نسبت (النسبة) کے سوا کچھ نہیں ہے۔ اور نسبت ایک عدمی امر ہے۔ اور حکم نسبت، منسوب اور منسوب الیہ کے لیے ہے۔ اور مجموعے سے ہی اثر اور حکم پیدا ہوتا ہے۔ جب بھی تم ان تینوں میں سے کسی ایک کو باقی دو کے بغیر اکیلا کرو گے تو نہ کوئی اثر ہوگا اور نہ ہی کوئی حکم صحیح ہوگا۔ اسی لیے ایجاد فردیت (الفردية) کے ذریعے ہوئی ہے نہ کہ احدیت (الأحدية) کے ذریعے۔ یہ اس شخص کے خلاف ہے جو کہتا ہے کہ صرف ایک ہی صادر ہوا ہے، کیونکہ وہ ایک سے صادر ہوا ہے۔ یہ قول صحیح ہے، لیکن یہ واقع نہیں ہے۔\n\nپھر نبوی کشف (الکشف) اور الٰہی خبر آئی، جس میں ایک ذات کے بارے میں کہا گیا جسے الٰہ کہا جاتا ہے، کہ جب وہ کسی چیز کا ارادہ کرتا ہے، تو یہ دو امور ہیں۔ اس نے اسے \"کُن\" (ہو جا) کہا، یہ تیسرا امر ہے۔ اور تین افراد (الأفراد) میں سے پہلا ہے۔ پس تکوین (التكوين) فرد سے ظاہر ہوئی نہ کہ احد سے۔ اور یہ سب ایک ہی عین کی طرف لوٹتے ہیں۔ پس جب مکوّن \"کُن\" کے ذریعے تکوین کے ساتھ ظاہر ہوا، تو وہ ایک ممکن کی صورت میں ایک الٰہی تجلی (تجلی) کے سوا کچھ نہ تھا، جو ایک ممکن کی صورت کے لیے الٰہی آنکھ سے دیکھ رہا تھا۔ جیسا کہ تکوین میں کچھ نہیں سنا گیا مگر الٰہی سماعت سے۔ اور اسی لیے وہ جلد ظاہر ہوا، کیونکہ وہ مراد، ارادہ کرنے والا، کہنے والا، جس سے کہا گیا، اور قول ہے۔ پس تکوین میں اس کا حال یہ ہے کہ وہ اللہ کے ساتھ بولتا ہے، پھر اس میں پھونکا جاتا ہے، تو وہ اللہ کے حکم سے پرندہ بن جاتا ہے۔ \"پھر انہیں اپنے حکم سے بلاؤ، وہ تمہارے پاس دوڑتے ہوئے آئیں گے\" (ثُمَّ ادْعُهُنَّ بأَمْرِهِ يَأْتِينَكَ سَعْياً)، کیونکہ وہ سننے والا ہے جس نے انہیں بلایا۔\n\nاور اس ذکر کے لیے معارف (المعارف) میں سے نفی، ایجاب، تنکیر اور تعریف کی معرفت ہے۔ اور اس کے حروف میں الفِ مزادہ (بڑھا ہوا الف)، الفِ طبیعیہ، ہمزہ مکسورہ، الفِ وصل، لام اور ہاء شامل ہیں۔ اور کلمات میں چار ہیں جو ایک ہی عین میں متقابل ہیں: نفی کا مقابلہ اثبات سے، اثبات کا نفی سے، منفی کا ثابت سے، اور ثابت کا منفی سے ہے۔\n\nجہاں تک نفی کی معرفت کا تعلق ہے، تو یہ اس چیز پر مطلع ہونا ہے جو وہ نہیں ہے جس کے بارے میں کہا گیا کہ وہ ہے، اگرچہ جسے وہ کہا گیا وہ کشف (الکشف) کے لحاظ سے صحیح ہو، لیکن عقل کے لحاظ سے محال ہے۔ اسی لیے بعض اہل اللہ نے ذکر \"اللہ اللہ\" کو لازم پکڑا۔ اور میں نے اس ذکر پر اپنے شیخ ابو العباس العربی کو دیکھا، جو اندلس کے عربوں میں سے اعلیٰ طبقے سے تھے۔ اور دوسروں نے \"اللہ\" میں سے ہاء کو لازم پکڑا، کیونکہ یہ ہویت (الہویۃ) پر دلالت کرتا ہے، اور اسے خاص الخاص کا ذکر قرار دیا، جیسے ابو حامد الغزالی اور دیگر۔\n\nلیکن اکابر \"لا إله إلا الله\" کو اس کے برعکس لازم پکڑتے ہیں جو عقلی نظر دیتی ہے، یعنی: وجود (الوجود) ہی اللہ ہے، اور عدم (العدم) ذاتی نفی کے ذریعے ذات اور عین سے منفی ہے، اور ثابت ذاتی اثبات کے ذریعے ذات اور عین سے ثابت ہے۔ اور نفی نکرہ (إله) پر متوجہ ہوتی ہے، اور اثبات معرفہ (الله) پر متوجہ ہوتا ہے۔ نفی نکرہ (إله) پر اس لیے متوجہ ہوئی کہ اس کے تحت ہر چیز ہے، اور کوئی چیز ایسی نہیں جسے الوہیت (الألوهة) میں اپنا حصہ ہونے کا دعویٰ نہ ہو۔ اسی لیے نفی اس پر متوجہ ہوئی، کیونکہ الٰہ وہ ہے جس کے لیے کوئی حصہ متعین نہیں، بلکہ اس کے لیے تمام حصے ہیں۔ اور جب یہ معلوم ہو گیا کہ الٰہ نے تمام حصے حاصل کر لیے ہیں، تو انہوں نے جان لیا کہ وہ مسمیٰ اللہ ہے۔ اور ہر وہ چیز جس کا کوئی حصہ ہے، وہ مسمیٰ اللہ کے اسماء میں سے ایک اسم ہے۔ پس سب اس کے اسماء ہیں۔ ہر اسم ہویت (الہویۃ) پر دلیل ہے، بلکہ وہ اس کا عین ہے۔ اسی لیے فرمایا: \"کہو، اللہ کو پکارو یا رحمن کو پکارو، جس نام سے بھی تم پکارو، تو اسی کے لیے سب اچھے نام ہیں\" (قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏)۔ اور یہ ہر اس اسم کا حکم ہے جسے تم پکارتے ہو، اس کے لیے اسماء حسنیٰ ہیں۔ پس اس کے لیے تمام عالم کے اسماء ہیں۔ پس سارا عالم مرتبہ حسنیٰ میں ہے۔ پس امر تنکیر ہے عینِ تعریف میں، اور نکرہ ہے عینِ معرفہ میں، اور تعریف ہے عینِ تنکیر میں، اور معرفہ ہے عینِ نکرہ میں۔ پس وہاں صرف منکور اور معروف ہے۔\n\nجہاں تک اس ہجیر کے حروف کا تعلق ہے، تو الفِ مزادہ (بڑھا ہوا الف) وہ ہر الف ہے جس کا کوئی موجب ہو جو اس میں زیادتی کو واجب کرے، اور زیادتی اس کی صورت پر ایک مثل کا ظہور ہے۔ پس وہ دو الف ہو جاتے ہیں۔ اور الف ہمیشہ ساکن ہوتا ہے۔ پس ظاہر ہونے والا ہمیشہ دو الفوں میں سے ایک ہوتا ہے، یا تو عبد یا رب، یا حق یا خلق۔ اور اس کا موجب ایک مقام پر تقدم کا مرتبہ ہے اور دوسرے مقام پر تاخر کا مرتبہ ہے۔ اور یہ دو موجب ہیں: ایک وہ جو اتحاد پر دلالت کرتا ہے، جو تضعیف ہے، اور دوسرا وہ جو تکوین (التكوين) یا اعدام کا باعث ہے، جسے تحقیق کہا جاتا ہے اور ہمزہ سے تعبیر کیا جاتا ہے۔\n\nاور یہ دونوں موجب مقام نزول میں ہو سکتے ہیں، جیسے: \"پس شمار کرنے والوں سے پوچھو\" (فَسْئَلِ الْعادِّينَ)، اور \"لا إله إلا الله\"، اور \"ہاں، میرے رب کی قسم، یہ یقیناً حق ہے\" (إِي ورَبِّي إِنَّهُ لَحَقٌّ)۔ اور یہ مقام \"رفیع الدرجات\" اور \"اپنے رب اعلیٰ کے نام کی تسبیح کرو\" (سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى) میں ہو سکتے ہیں، جیسے: \"وہ اللہ کی مخالفت کرتے ہیں\" (يُحَادُّونَ الله)، اور \"وہ اولیاء\" (أَوْلِياءُ أُولئِكَ)، اور \"انہیں کتاب دی گئی\" (أُوتُوا الْكِتابَ)۔ اور موجب مقام برزخ میں ہو سکتا ہے، جو وسط ہے، جیسے: \"جس نے اللہ کی مخالفت کی\" (من حَادَّ الله)، اور \"ہم نے اسے بچپن میں ہی حکم دیا\" (وآتَيْناهُ الْحُكْمَ صَبِيًّا)، اور \"یقیناً تم ان کے سینوں میں زیادہ خوفناک ہو\" (لَأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ)۔ اگر موجب (موجب) اسم فاعل ہو، تو وہ رب ہوگا یا خلق۔ اور اگر موجب (موجب) خلق ہو، تو موجب (موجَب، فتح جیم کے ساتھ) حق ہوگا۔ پس خلق سے حق میں ظاہر ہونے والا اثر: \"میں دعا کرنے والے کی دعا قبول کرتا ہوں\" (أُجِيبُ دَعْوَةَ الدَّاعِ)۔ اور حق سے خلق میں ظاہر ہونے والا اثر: \"ہو جا، پس وہ ہو جاتا ہے\" (كُنْ فَيَكُونُ)۔ اور یہ یا تو باعث کی وجہ سے ہوتا ہے یا اتحاد اور ایجاد کی وجہ سے۔\n\nاس کا دوسرے اسم کے لیے بدل جانا، اس کی پہلے میں کوئی بنیاد نہیں ہے۔ اور باعث کے لیے اول اور آخر ہوتا ہے۔ پس باعث حق اور خلق ہے، اور ایجاد حق اور خلق ہے۔ مگر یہ صرف خلق کے ساتھ ہی حقِ مفرد نہیں ہوتا، جیسے اللہ کی معرفت (المعرفۃ) اس حیثیت سے کہ وہ الٰہ ہے، صرف خلق کے بغیر نہیں ہو سکتی، یہ ضروری ہے۔ پس یہ خلق میں حق ہے، اور خلق ہمیشہ مؤخر ہوتا ہے جہاں سے اسے عقل کیا جائے۔ جہاں تک الفِ طبیعیہ کا تعلق ہے، جیسے \"قال\" (کہا) اور \"سار\" (چلا)، تو یہ وہ واحد امر ہے جو طبیعت کو جمع کرتا ہے تو عالم ظاہر ہوتا ہے، اور اسے منتشر کرتا ہے تو عالم فنا ہو جاتا ہے۔ اور یہ اصل ہے جو منتشر کرنے والا اور جمع کرنے والا ہے۔ اور ہر الفِ مزادہ (بڑھا ہوا الف) اسی کے حکمِ تشبیہ پر ظاہر ہوتا ہے۔ اور اس منتشر کرنے والے، جمع کرنے والے امر کا موجب صرف فتح (الفتح) ہے، اور یہی اصل ہے۔ اور فتح اس چیز سے ہو سکتا ہے جو خوش کرے، جو رحمت ہے، اور اس چیز سے جو غمگین کرے، جو عذاب کا فتح ہے۔\n\n### [فتحِ عذاب دو قسم پر ہے]\n\nاور یہ دو قسموں پر ہے: ایک فتحِ عذاب جس میں رحمت ہے، اور ایک فتحِ عذاب جس میں رحمت کی آمیزش نہیں، مگر یہ صرف ہمارے نزدیک ہے۔ کیونکہ وہاں کوئی عذاب ایسا نہیں جس میں رحمت کی آمیزش نہ ہو، اس لیے کہ رحمت \"ہر چیز پر محیط ہے\" (وَسِعَتْ كُلَّ شَيْ‏ءٍ)۔ جہاں تک طبعی میلان کا تعلق ہے، جیسے وہ الف جسے واوِ علت اور یاءِ علت کہا جاتا ہے، تو یہ اس کا حق کی جانب میلان ہے، جیسے \"قولوا\" (کہو) اور \"فیه\" (اس میں)۔\n\nاور اس ذکر میں ہمزہ مکسورہ (زیر والا ہمزہ) حق کا آسمانِ دنیا کی طرف اور ہر اس چیز کی طرف نزول کا باعث ہے جو خلق کی جانب ہو۔ یہ حق کے باعث میں ہے۔ اور جب باعث خلق ہو، تو اس کا اپنے نفس میں دیکھنا اسے اپنے رب کے علم کے حصول میں کوشش کرنے پر ابھارتا ہے۔ اسی لیے ہمزہ نفی میں اور کلمہ اثبات میں مکسور ہے، اور منفی ہمیشہ مکسور ہوتا ہے۔ جہاں تک الفِ وصل کا تعلق ہے، تو یہ تمیز کے ساتھ علم کا وصل ہے، بشرطیکہ وہاں تشبیہ کا وجود ہو۔ اگر وہاں تشبیہ کا وجود نہ ہو تو وہ الفِ قطع ہے، الفِ وصل نہیں۔ اور لام جبروتی ہے، کیونکہ یہ وسط سے ہے، رفیع الدرجات سے۔ اور ہاء ملکوتی ہے، کیونکہ یہ سینے سے ہے، سانس کے پہلے گزرنے کی جگہ سے۔ اور یہ ان دونوں کلمات میں اصلی ہے، منفی اور مثبت میں۔\n\nاور وہاں دو ہویتوں (ہویات) کے سوا کچھ نہیں: ایک خلق کی ہویت جو اپنے دعوے میں منفی ہے اس چیز کے لیے جو اس کی نہیں ہے، اور ایک حق کی ہویت جو ثابت ہے، کیونکہ وہ ہمیشہ سے ہے۔ پس بندہ اپنی عین کے لحاظ سے ہلاک ہونے والا ہے، اور جب حق اس کی ہویت ہو تو وہ وہ نہیں ہے۔ پس ہر صورت میں جو کچھ ہے وہ وہ نہیں ہے۔ پس حق کی ہویت نفی ہو جاتی ہے جب وہ خلق کو پہنتی ہے، اور خلق کی ہویت نفی نہیں ہوتی جب وہ حق کو پہنتی ہے۔ پس بہر حال، وہاں صرف حقِ ثابت ہے جو منفی نہیں ہے۔\n\nجہاں تک چار کلمات کا تعلق ہے: نفی کا آلہ منفی پر، اور اثبات کا آلہ ثابت پر۔ اور یہ باقی رہا کہ عمل کس کی طرف منسوب کیا جائے، کیا آلہ کی طرف یا اس کی طرف جس پر وہ داخل ہوا؟ اگر حکم اس کے لیے ہے جس پر وہ داخل ہوا، تو وہی اسے طلب کرتا ہے، کیونکہ وہ اس کے ذریعے منفی نہیں ہوا۔ بلکہ آلہ سامع کو یہ بتانے کے لیے آیا ہے کہ جس پر وہ داخل ہوا ہے وہ منفی ہے یا ثابت۔ اور آلہ نے جس پر وہ داخل ہوا اس میں کوئی عمل نہیں کیا مگر صرف علو یا سفل یا ان کے درمیان کے مرتبے کا تعین۔ پس آلہ کے ذریعے مراتب ظاہر ہوتے ہیں، اور جس پر وہ داخل ہوا اس کے ذریعے خاص آلہ دوسرے آلات سے متعین ہوتا ہے۔ جیسا کہ خلق کا وجود حق کے ساتھ مربوط ہے، اور علم قدیم کا وجود محدث کے ساتھ مربوط ہے۔ یہ اس الٰہی علم کا کچھ حصہ ہے جو \"لا إله إلا الله\" سے پیدا ہوتا ہے۔ اور اس کے چھتیس (۳۶) وجوہ ہیں، ہر وجہ وہ دیتی ہے جو دوسری وجہ نہیں دیتی۔ ہم نے ان وجوہ کا ذکر اس کتاب کے بابِ نفس (باب النفس) میں، فاء کے فتح کے ساتھ، کر دیا ہے۔\n\n### [حروف کی تقسیم حقیقی ہے]\n\nاور جان لو کہ ہم نے حروف کو اس طرح تقسیم نہیں کیا جیسے کوئی عقل والا مجاز کے طریقے پر تقسیم کرتا ہے، بلکہ یہ حقیقت پر مبنی ہے۔ کیونکہ ہمارے نزدیک اور اہل کشف (الکشف) اور ایمان کے نزدیک، حروفِ لفظ، حروفِ رقم، اور حروفِ تخیل، امتوں میں سے امتیں ہیں، جن کی صورتوں کے لیے مدبر ارواح ہیں، پس وہ زندہ، ناطق ہیں، اپنے رب کی اطاعت کرتے ہوئے اس کی حمد کے ساتھ تسبیح کرتے ہیں۔ پس ان میں سے کچھ عالمِ جبروت سے ملحق ہیں، اور کچھ عالمِ ملکوت سے، اور کچھ عالمِ ملک سے۔ پس حروف ہمارے نزدیک ویسے نہیں ہیں جیسے وہ اہل حجاب کے نزدیک ہیں جنہیں اللہ نے اندھا کر دیا اور \"ان کی آنکھوں پر پردہ ڈال دیا\" (عَلى‏ أَبْصارِهِمْ غِشاوَةٌ)، حالانکہ وہ دیکھتے ہیں، جیسا کہ اللہ تعالیٰ نے فرمایا: \"اور تم انہیں دیکھو گے کہ وہ تمہاری طرف دیکھ رہے ہیں حالانکہ وہ نہیں دیکھتے\" (وتَراهُمْ يَنْظُرُونَ إِلَيْكَ وهُمْ لا يُبْصِرُونَ)۔\n\nپس جب بندہ \"لا إله إلا الله\" کہتا ہے، تو وہ ان کلمات کا خالق ہوتا ہے، پس وہ اپنے خالق کی تسبیح کرتے ہیں، اور یہ ان کا حق ہے۔ اور حق اصالتاً منزہ ہے، نہ کہ منزہ کے تنزیہ سے۔ اور اللہ تعالیٰ نے خلق کو اپنے بندے کی طرف منسوب کیا اور خود کو اس میں احسن کے ساتھ وصف کیا، اپنے قول میں: \"بہترین خالق\" (أَحْسَنُ الْخالِقِينَ)۔ پس اس کلمے اور ہر کلمے کی تسبیح اس کے کہنے والے کی طرف لوٹتی ہے۔ پس جب بندہ اہل کشف میں سے ہو، تو جو کچھ ہم نے ذکر کیا، وہی ہے جو مردوں میں سے اس شخص سے نقل کیا گیا جس نے کہا: \"سبحانی\" (میں پاک ہوں)، اور جس نے اسے کافر قرار دیا اسے اس کا علم نہیں تھا۔\n\nپس قوم کے ساتھ رہو جہاں وہ ہوں،\nاور ان سے پیچھے نہ رہو ورنہ شقی ہو جاؤ گے۔\nکیونکہ قوم اہل کشف (الکشف) ہیں،\nاللہ نے انہیں حق کو حق دکھایا ہے۔\nپس وہ سچے دل سے اللہ کے بندے ہیں،\nوہ علم کی ہر بلندی پر چڑھ گئے۔\n\nاور اس کتاب میں حروف کے بارے میں ایک مختصر اور شافی کلام اس کتاب کے دوسرے باب میں، ان کے صغار اور کبار کے بارے میں، گزر چکا ہے۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)۔",
    "fa": "باب چهارصد و شصت و چهارم در حال قطب که ذکر دائمی‌اش (هجیره) «لا إله إلا الله» است.\n\nآن کس که ذکر دائمی‌اش (هجیره) نفی و اثبات است، *** او همان امامی است که آیات او را آشکار می‌سازند.\nاو فرد است و جفتی ندارد که او را بشمارد، *** و نشانه‌ها او را در ما محدود نمی‌کنند.\nاو در هستیِ وصف، صفتی ندارد، *** و در شهود ذات، لذتی برای ذات ندارد.\nهمه از تأثیر او در او تأثیر پذیرفته‌اند، *** پس وصفشان در او زندگان و مردگان است.\nآنان مصون هستند، مناقبشان به شمار نمی‌آید، *** و آفات مرگ بر آنان چیره نمی‌شود.\n\nخداوند عز و جل فرمود: «پس بدان که هیچ معبودی جز الله نیست.» (فَاعْلَمْ أَنَّهُ لا إِلهَ إِلَّا الله‏)\n\n### [اینکه هر ذکری نتیجه‌ای دارد]\n\nبدان که هجیر (هجير) همان ذکری است که بنده ملازم آن می‌شود، هر ذکری که باشد. و هر ذکری نتیجه‌ای دارد که برای ذکر دیگر نیست. و هنگامی که انسان اذکار الهی را بر نفس خود عرضه می‌کند، جز آنچه استعدادش به او می‌دهد، نمی‌پذیرد. اولین گشایش (فتح) برای او در ذکر، پذیرش آن است. سپس پیوسته بر آن مداومت می‌کند، همراه با هر نفس؛ به طوری که هیچ نفسی در بیداری و خواب از او خارج نمی‌شود مگر به واسطه‌ی آن، به دلیل شیفتگی‌اش در آن. و هرگاه حال ذاکر بر این منوال نباشد، او صاحب هجیر نیست.\n\nپس کسی که ذکرش «لا إله إلا الله» است، مفهوم معقول ذکرش، الوهیت (الألوهة) است؛ و آن مرتبه‌ای است که جز برای یکتا (که مسمای الله است) نیست. این مرتبه همان است که تو آن را نفی می‌کنی و همان است که تو آن را اثبات می‌کنی. و از کسی که از او نفی می‌شود، به نفیِ نفی‌کننده، نفی نمی‌گردد؛ و برای کسی که به اثباتِ ثابتِ اثبات‌کننده، ثبوتی نیست. پس ثبوت آن برای خودش و نفی آن برای خودش است، نه چیز دیگر. بنابراین، برای ذاکر جز شهود (الشهود) آن نتیجه‌ای نمی‌دهد، و شهود آن چیزی جز علم به آن نیست. و معلوم این علم، همان نسبت (النسبة) است. و نسبت امری عدمی است، و حکم برای نسبت و منسوب و منسوبٌ‌الیه است. و اثر و حکم به مجموع این‌ها حاصل می‌شود. هرگاه یکی از این سه را بدون بقیه جدا کنی، نه اثری خواهد بود و نه حکمی صحیح. به همین دلیل، ایجاد (الإيجاد) به فردیت (الفردية) است نه به احدیت (الأحدية)؛ برخلاف کسانی که می‌گویند جز واحد صادر نشده است. زیرا صدور از واحد، قولی صحیح است، اما نه اینکه واقع شده باشد.\n\nسپس کشف نبوی (الکشف النبوي) و اخبار الهی با این سخن آمد که درباره‌ی ذاتی که «إله» نامیده می‌شود، می‌فرماید: «اگر چیزی را اراده کند...» پس این دو امر هستند. و به آن می‌گوید: «باش (كُنْ)»؛ این امر سوم است. و سه، اولین اعداد فرد است. پس تکوین (التكوين) از فرد ظاهر شد نه از احد. و همه‌ی این‌ها به یک عین واحد بازمی‌گردند. پس هنگامی که مُکَوَّن (آنچه تکوین یافته) به واسطه‌ی «باش (كُنْ)» ظاهر می‌شود، چیزی جز تجلی الهی (تجلی إلهي) در صورت ممکن برای صورت ممکن نیست که با چشم الهی می‌نگرد؛ همان‌طور که در تکوین جز با گوش الهی شنیده نمی‌شود. و به همین دلیل، ظهور سریع بود، زیرا او مراد و اراده‌کننده، و گوینده و مخاطبِ قول و خودِ قول است. پس حال او در تکوین این است که به واسطه‌ی الله سخن می‌گوید و در آن می‌دمد، پس به اذن الله پرنده‌ای می‌شود. سپس به امر او «آن‌ها را بخوان (ثُمَّ ادْعُهُنَّ)» تا «شتابان نزد تو آیند (يَأْتِينَكَ سَعْياً)»؛ زیرا او همان شنونده‌ای است که آن‌ها را خوانده است.\n\nو برای این ذکر، از معارف (المعارف)، معرفت نفی (النفي) و ایجاب (الإيجاب) و تنکیر (التنكير) و تعریف (التعريف) وجود دارد. و از حروف، الفِ افزوده (المزادة)، الفِ طبیعی، همزه‌ی مکسور، الف وصل، لام و هاء را داراست. و از کلمات، چهار کلمه‌ی متقابل در یک عین واحد دارد: نفی در آن مقابل اثبات است، و اثبات مقابل نفی، و منفی مقابل ثابت، و ثابت مقابل منفی.\n\nاما معرفت نفی، آگاهی بر چیزی است که او نیست، در آنچه گفته شده که اوست؛ اگرچه آنچه گفته شده که اوست، از نظر کشف (الکشف) صحیح باشد، اما از نظر عقل (العقل) محال است. به همین دلیل، برخی از اهل الله ذکر «الله الله» را لازم دانستند. و من شیخ ما ابوالعباس العربی از اهل عُلیا از عرب‌های اندلس را بر این ذکر دیدم. و دیگران «هاء» از «الله» را به دلیل دلالتش بر هویت (الهوية) لازم دانستند و آن را ذکر خاص الخاصه قرار دادند، مانند ابوحامد غزالی و دیگران.\n\nاما اکابر، «لا إله إلا الله» را بر خلاف آنچه نظر عقلی می‌دهد، لازم می‌دانند؛ یعنی وجود (الوجود) همان الله است، و عدم (العدم) به نفی ذاتی، ذات و عینش نفی شده است، و ثابت به اثبات ذاتی، ذات و عینش ثابت است. و نفی بر نکره (إله) وارد شده است و اثبات بر معرفه (الله). و نفی بر نکره (إله) وارد شده است، زیرا زیر آن هر چیزی قرار دارد، و هیچ چیزی نیست مگر اینکه نصیبی در الوهیت دارد و آن را ادعا می‌کند. به همین دلیل، نفی بر آن وارد شده است، زیرا «إله» کسی است که نصیبی برایش تعیین نشده است، پس همه‌ی نصیب‌ها برای اوست. و چون دانسته شد که «إله» همه‌ی نصیب‌ها را در بر گرفته است، دانستند که او مسمای «الله» است. و هر چیزی که نصیبی دارد، اسمی از اسم‌های مسمای «الله» است. پس همه اسم‌های او هستند. و هر اسمی دلیلی بر هویت است، بلکه عین آن است. به همین دلیل فرمود: «بگو: الله را بخوانید یا رحمان را بخوانید، هر کدام را بخوانید، پس نام‌های نیکو (الْأَسْماءُ الْحُسْنى‏) از آن اوست.» (قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏) و این حکم هر اسمی است که شما او را به آن می‌خوانید، نام‌های نیکو از آن اوست. پس او نام‌های تمام عالم را دارد. بنابراین، تمام عالم در مرتبه‌ی حُسنی (نیکو) قرار دارد. پس امر، تنکیر در عین تعریف است، و نکره در عین معرفه، و تعریف در عین تنکیر، و معرفه در عین نکره. پس جز منکور (نکره) و معروف (معرفه) در آنجا نیست.\n\nاما حروف این هجیر: الفِ افزوده (الألف المزادة) که هر الفی است که موجبی دارد که موجب افزایش در آن می‌شود. و افزایش، ظهور مثلی بر صورت آن است، پس دو الف می‌شود. و الف همیشه ساکن است. پس آنچه ظاهر می‌شود، همیشه یکی از دو الف است: یا عبد (بنده) یا رب (پروردگار)، یا حق (الحق) یا خلق (الخلق). و موجب آن در یک موطن، مرتبه‌ی تقدم است و در موطنی دیگر، مرتبه‌ی تأخر. و این دو، دو موجب هستند: یکی آنچه بر اتحاد دلالت می‌کند که همان تضعیف است، و دیگری آنچه بر برانگیزاننده برای تکوین (التكوين) یا اعدام (الإعدام) دلالت می‌کند که همان تحقیق است که با همزه از آن تعبیر می‌شود. و این دو موجب ممکن است در مقام نزول باشند، مانند: «از شمارندگان بپرس (فَسْئَلِ الْعادِّينَ)» و «لا إله إلا الله» و «به پروردگارم سوگند که آن حق است (إِي ورَبِّي إِنَّهُ لَحَقٌّ)». و ممکن است در مقام «رفیع الدرجات (رَفِيعُ الدَّرَجاتِ)» و «پروردگار والای خود را تسبیح کن (سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى)» باشند، مانند: «با خدا دشمنی می‌کنند (يُحَادُّونَ الله)» و «آنان اولیاء هستند (أَوْلِياءُ أُولئِكَ)» و «کتاب به آنان داده شد (أُوتُوا الْكِتابَ)». و ممکن است موجب در مقام برزخ باشد که همان وسط است، مانند: «کسی که با خدا دشمنی کند (من حَادَّ الله)» و «در کودکی به او حکم دادیم (آتَيْناهُ الْحُكْمَ صَبِيًّا)» و «شما در سینه‌های آنان ترسناک‌تر هستید (لَأَنْتُمْ أَشَدُّ رَهْبَةً في صُدُورِهِمْ)».\n\nاگر موجب، اسم فاعل باشد، یا رب است یا خلق. و اگر موجب، خلق باشد، موجب (با فتح جیم) حق است. پس اثری که از خلق در حق ظاهر می‌شود: «دعای دعا کننده را اجابت می‌کنم (أُجِيبُ دَعْوَةَ الدَّاعِ)». و اثری که از حق در خلق ظاهر می‌شود: «باش، پس می‌شود (كُنْ فَيَكُونُ)». و این یا از روی باعث است یا از روی اتحاد و ایجاد.\n\nتبدیل کردن اسم دیگر برای او، در اول قدمی ندارد. و باعث، اول و آخر را دارد. پس باعث، حق و خلق است؛ و ایجاد، حق و خلق است. جز اینکه حق به تنهایی نیست مگر به واسطه‌ی خلق؛ مانند معرفت به الله از آن جهت که او إله است، که جز به واسطه‌ی خلق حاصل نمی‌شود، و این ضروری است. پس آن حق در خلق است. و خلق همیشه در جایی که تعقل شود، متأخر است.\n\nو اما الف طبیعی در مانند «قال» و «سارَ»، همان امر واحدی است که طبیعت را جمع می‌کند و عالم ظاهر می‌شود، و آن را متفرق می‌کند و عالم فانی می‌شود. و آن اصلِ متفرق‌کننده و جمع‌کننده است. و هر الف افزوده، تنها بر حکم تشبیه به آن ظاهر می‌شود. و موجب این امرِ متفرق‌کننده و جمع‌کننده، همان فتح (گشایش) است که اصل است. و فتح ممکن است به آنچه شاد می‌کند باشد که همان رحمت است، و به آنچه بد می‌آورد که همان فتح عذاب است.\n\n### [فتح عذاب بر دو نوع است]\n\nو آن بر دو نوع است: فتح عذابی که در آن رحمت است، و فتح عذابی که هیچ رحمتی آن را در بر نمی‌گیرد، مگر نزد ما؛ زیرا هیچ عذابی نیست که رحمت آن را در بر نگیرد، چرا که «رحمت من همه چیز را فرا گرفته است (وَسِعَتْ كُلَّ شَيْ‏ءٍ)».\n\nاما میل طبیعی، مانند الفی که واو عله و یاء عله نامیده می‌شود، میل آن به جانب حق (الحق) است، مانند «قولوا» و مانند «فیه». و اما همزه‌ی مکسور در این ذکر، همان باعث حق است برای نزول به آسمان دنیا و به هر آنچه که به جانب خلق باشد. این در مورد باعث حق است. و اما اگر باعث، خلق باشد، آنگاه نظر کردن او در نفس خود، او را بر تکلف در تحصیل علمش به پروردگارش برمی‌انگیزد. به همین دلیل، همزه در نفی و در کلمه‌ی اثبات مکسور است. و منفی همیشه مکسور است.\n\nو اما الف وصل، وصل شدن علمی است به تمییز، همراه با وجود تشبیه. اگر در آنجا وجود تشبیه نباشد، آن الف قطع است نه الف وصل. و اما لام (اللام)، جبروتی (جبروتية) است، زیرا از وسط، از «رفیع الدرجات» است. و هاء (الهاء)، ملکوتی (ملکوتية) است، زیرا از سینه، از اولین مجرای نفس است. و این دو در این دو کلمه، در منفی و مثبت، اصلی هستند.\n\nو در آنجا جز دو هویت (هويتان) نیست: هویت خلق (هوية خلق) که در ادعای آنچه برایش نیست، نفی می‌شود؛ و هویت حق (هوية حق) که ثابت است، زیرا همیشه بوده است. زیرا بنده از حیث عین خود، هالک است. و اگر حق، هویت او باشد، پس او، او نیست. پس در هر وجهی، آنچه هست، او نیست. بنابراین، هویت حق هنگامی که لباس خلق را می‌پوشد، نفی می‌شود؛ اما هویت خلق هنگامی که لباس حق را می‌پوشد، نفی نمی‌شود. پس در هر حال، جز حق ثابتِ غیرمنفی در آنجا نیست.\n\nو اما کلمات چهارگانه: ابزار نفی (أداة نفي) بر منفی، و ابزار اثبات (أداة إثبات) بر ثابت. و باقی می‌ماند که عمل به چه کسی اضافه می‌شود؟ آیا به ابزار (الأداة) یا به آنچه بر آن وارد شده است؟ اگر حکم برای آنچه بر آن وارد شده باشد، پس اوست که آن را می‌طلبد، زیرا به واسطه‌ی آن نفی نشده است. بلکه ابزار آمده است تا به شنونده بشناساند که آنچه بر آن وارد شده، منفی است یا ثابت. و ابزار در آنچه بر آن وارد شده، عملی نکرده است مگر تعیین مرتبه‌ی علو یا سفل یا آنچه میان آن دو است. پس به واسطه‌ی ابزار، مراتب ظاهر می‌شوند؛ و به واسطه‌ی آنچه بر آن وارد شده، ابزار خاص از سایر ابزارها متمایز می‌گردد. همان‌طور که وجود خلق به حق مرتبط شد و وجود علم قدیم به حادث مرتبط شد. این بخشی از آن چیزی است که «لا إله إلا الله» از علم الهی نتیجه می‌دهد. و برای آن سی و شش وجه است که هر وجهی چیزی را می‌دهد که وجه دیگر نمی‌دهد. ما این وجوه را در باب «النفس» (با فتح فاء) ذکر کرده‌ایم.\n\n### [تقسیم حروف، تقسیمی حقیقی است]\n\nو بدان که ما حروف را تقسیم نکرده‌ایم، تقسیم کسی که به طریق مجاز تعقل می‌کند، بلکه این تقسیم بر حقیقت (الحقيقة) است. زیرا حروف نزد ما و نزد اهل کشف (الکشف) و ایمان، حروف لفظ و حروف رقم و حروف تخیل، امت‌هایی از جمله‌ی امت‌ها هستند که صورشان ارواح مدبری دارند. پس آن‌ها زنده و گویا هستند و با حمد پروردگارشان، او را تسبیح می‌گویند و مطیع پروردگارشان هستند. پس برخی از آن‌ها به عالم جبروت (الجبروت) ملحق می‌شوند، و برخی به عالم ملکوت (الملکوت)، و برخی به عالم مُلک (الملک). پس حروف نزد ما مانند آنچه نزد اهل حجاب است، نیست؛ کسانی که خداوند آنان را کور کرده و «بر دیدگانشان پرده‌ای قرار داده است (عَلى‏ أَبْصارِهِمْ غِشاوَةٌ)» در حالی که می‌نگرند، چنانکه تعالی فرمود: «و آنان را می‌بینی که به تو می‌نگرند در حالی که نمی‌بینند (وتَراهُمْ يَنْظُرُونَ إِلَيْكَ وهُمْ لا يُبْصِرُونَ)».\n\nپس هنگامی که بنده «لا إله إلا الله» می‌گوید، خالق این کلمات است. پس آن‌ها خالق خود را تسبیح می‌گویند و این حق آن‌هاست. و حق (الحق) به اصالت منزه است، نه به تنزیه تنزیه‌کننده. و خداوند تعالی خلق را به بنده‌اش نسبت داده و خود را در آن به «احسن» وصف کرده است، در قولش: «بهترین آفرینندگان (أَحْسَنُ الْخالِقِينَ)». پس تسبیح این کلمه و هر کلمه‌ای به گوینده‌ی آن بازمی‌گردد. پس اگر بنده از اهل کشف باشد، همان است که از مردان نقل شده که گفت: «سبحانی (منزه باد من)»؛ و برای کسی که او را به این سخن کافر دانست، علمی نیست.\n\nپس با قوم باش، هر جا که بودند، *** و از آنان فروتر مباش که بدبخت شوی.\nزیرا قوم، اهل کشف (کشف) هستند، *** خداوند حق (الحق) را به آنان، حق نشان داد.\nپس آنان بندگان راستین إله هستند، *** که از علم به هر مرتبه‌ای صعود کرده‌اند.\n\nو پیش از این در این کتاب، در باب دوم، کلامی مختصر و کافی درباره‌ی حروف، در کوچک و بزرگ بودنشان، گذشت. و «خداوند حق را می‌گوید و او راه را هدایت می‌کند (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)»."
  },
  "page_count": 3
}