{
  "id": 36,
  "title": {
    "ar": "الباب السادس والثلاثون في معرفة العيسويين وأقطابهم وأصولهم",
    "en": "Chapter Thirty-Six: On the Knowledge of the 'Isawiyyūn [العيسويون], their Poles [أقطاب], and their Principles [أصول]",
    "ur": "چھتیسواں باب: عیسویین (العيسويين)، ان کے اقطاب (أقطاب)، اور ان کے اصول (أصول) کی معرفت (معرفة) میں۔",
    "fa": "باب سی و ششم در شناخت عیسویان (العيسويين)، اقطابشان و اصولشان."
  },
  "content": {
    "ar": "## (الباب السادس والثلاثون في معرفة العيسويين وأقطابهم وأصولهم)\n\n\n> كل من أحيا حقيقته *** وشفى من علة الحجب‏\n\n\n> فهو عيسى لا يناط به *** عندنا شي‏ء من الريب‏\n\n\n> فلقد أعطت سجيته *** رتبة تسمو على الرتب‏\n\n\n> بنعوت القدس تعرفه *** في صريح الوحي والكتب‏\n\n\n> لم ينلها غير وارثه *** صفة في سالف الحقب‏\n\n\n> فسرت في الكون همته *** في أعاجم وفي عرب‏\n\n\n> فبها تحيا نفوسهمو *** وبها إزالة النوب‏\n\n\n### [الشريعة المحمدية وعالمية وارثيها]\n\n\nاعلم أيدك الله أنه لما كان شرع محمد صلى الله عليه وسلم تضمن جميع الشرائع المتقدمة وأنه ما بقي لها حكم في هذه الدنيا إلا ما قررته الشريعة المحمدية فبتقريرها ثبتت فتعبدنا بها نفوسنا من حيث إن محمدا صلى الله عليه وسلم قررها لا من حيث إن النبي المخصوص بها في وقته قررها فلهذا أوتي رسول الله صلى الله عليه وسلم جوامع الكلم فإذا عمل المحمدي وجميع العالم المكلف اليوم من الإنس والجن محمدي ليس في العالم اليوم شرع إلهي سوى هذا الشرع المحمدي فلا يخلو هذا العامل من هذه الأمة إن يصادف في عمله فيما يفتح له منه في قلبه وطريقه ويتحقق به طريقة من طرق نبي من الأنبياء المتقدمين مما تتضمنه هذه الشريعة وقررت طريقته وصحبتها نتيجته فإذا فتح له في ذلك فإنه ينتسب إلى صاحب تلك الشريعة فيقال فيه عيسوي أو موسوي أو إبراهيمي وذلك لتحقيق ما تميز له من المعارف وظهر له من المقام من جملة ما هو تحت حيطة شريعة محمد صلى الله عليه وسلم فيتميز بتلك النسبة أو بذلك النسب من غيره ليعرف أنه ما ورث من محمد صلى الله عليه وسلم إلا ما لو كان موسى أو غيره من الأنبياء حيا واتبعه ما ورث إلا ذلك منه ولما تقدمت شرائعهم قبل هذه الشريعة جعلنا هذا العارف وارثا إذ كان الورث للآخر من الأول فلو لم يكن لذلك الأول شرع مقرر قبل تقرير محمد صلى الله عليه وسلم لساوينا الأنبياء والرسل إذ جمعنا زمان شريعة محمد صلى الله عليه وسلم كما يساوينا اليوم الياس والخضر وعيسى إذا نزل فإن الوقت يحكم عليه إذ لا نبوة تشريع بعد محمد صلى الله عليه وسلم‏\n### [الوارث المحمدي‏]\n\n\nولا يقال في أحد من أهل هذه الطريقة أنه محمدي إلا لشخصين إما شخص اختص بميراث علم من حكم لم يكن في شرع قبله فيقال فيه محمدي وإما شخص جمع المقامات ثم خرج عنها إلى لا مقام كأبي يزيد وأمثاله فهذا أيضا يقال فيه محمدي وما عدا هذين الشخصين فينسب إلى نبي من الأنبياء ولهذا\n\n\nورد في الخبر أن العلماء ورثة الأنبياء\n\n\nولم يقل ورثة نبي خاص والمخاطب بهذا علماء هذه الأمة وقد ورد أيضا بهذا اللفظ قوله صلى الله عليه وسلم علماء هذه الأمة أنبياء سائر الأمم وفي رواية كأنبياء بنى إسرائيل‏\n\n\n### [العيسويون الأوائل والثواني‏]\n\n\nفالعيسويون الأول هم الحواريون أتباع عيسى فمن أدرك منهم إلى الآن شرع محمد صلى الله عليه وسلم وآمن به واتبعه واتفق أن يكون قد حصل له من هذه الشريعة ما كان قبل هذا شرعا لعيسى عليه السلام فيرث من عيسى عليه السلام ما ورثه من غير حجاب ثم يرث من عيسى عليه السلام في شريعة محمد صلى الله عليه وسلم ميراث تابع من تابع لا من متبوع وبينهما في الذوق فرقان ولهذا قال رسول الله صلى الله عليه وسلم في مثل هذا الشخص أن له الأجر مرتين كذلك له ميراثان وفتحان وذوقان مختلفان ولا ينسب فيهما إلا إلى ذلك النبي عليه السلام فهؤلاء هم العيسويون الثواني وأصولهم توحيد التجريد من طريق المثال لأن وجود عيسى عليه السلام لم يكن عن ذكر بشري وإنما كان عن تمثل روح في صورة بشر ولهذا غلب على أمة عيسى بن مريم دون سائر الأمم القول بالصورة فيصورون في كنائسهم مثلا ويتعبدون في أنفسهم بالتوجه إليها فإن أصل نبيهم عليه السلام كان عن تمثل فسرت تلك الحقيقة في أمته إلى الآن ولما جاء شرع محمد صلى الله عليه وسلم ونهى عن الصور وهو صلى الله عليه وسلم قد حوى على حقيقة عيسى وانطوى شرعه في شرعه فشرع لنا صلى الله عليه وسلم أن نعبد الله كأنا نراه فأدخله لنا في الخيال وهذا هو معنى التصوير إلا أنه نهى عنه في الحس أن يظهر في هذه الأمة بصورة حسية\n\n\n### [عبادة الله على الرؤية]\n\n\nثم إن هذا الشرع الخاص الذي هواعبد الله كأنك تراه ما قاله محمد صلى الله عليه وسلم‏\n\n\nلنا بلا واسطة بل قاله لجبريل عليه السلام وهو الذي تمثل لمريم بَشَراً سَوِيًّا عند إيجاد عيسى عليه السلام فكان كما قيل في المثل السائر إياك أعني فاسمعي يا جارة فكنا نحن المرادين بذلك القول ولهذا\n\n\nجاء في آخر الحديث هذا جبريل أراد أن تعلموا إذا لم تسألوا\n\n\nوفي رواية جاء ليعلم الناس دينهم وفي رواية أتاكم يعلمكم دينكم‏\n\n\nفما خرجت الروايات عن كوننا المقصودين بالتعليم ثم لتعلم إن الذي لنا من غير شرع عيسى ع‏\n\n\nقوله فإن لم تكن تراه فإنه يراك‏\n\n\nفهذا من أصولهم وكان شيخنا أبو العباس العربي رحمه الله عيسويا في نهايته وهي كانت بدايتنا أعني نهاية شيخنا في هذا الطريق كانت عيسوية ثم نقلنا إلى الفتح الموسوي الشمسي ثم بعد ذلك نقلنا إلى هود عليه السلام ثم بعد ذلك نقلنا إلى جميع النبيين عليهم السلام ثم بعد ذلك نقلنا إلى محمد صلى الله عليه وسلم هكذا كان أمرنا في هذا الطريق ثبته الله علينا ولا حاد بنا عن سواء السبيل فأعطانا الله من أجل هذه النشأة التي أنشأنا الله عليها في هذا الطريق وجه الحق في كل شي‏ء فليس في العالم عندنا في نظرنا شي‏ء موجود إلا ولنا فيه شهود عين حق نعظمه منه فلا نرمي بشي‏ء من العالم الوجودي‏\n\n\n### [أصحاب عيسى ويونس في زمان ابن عربي‏]\n\n\nوفي زماننا اليوم جماعة من أصحاب عيسى عليه السلام ويونس عليه السلام يحبون وهم منقطعون عن الناس فأما القوم الذين هم من قوم يونس فرأيت أثر قدم واحد منهم بالساحل كان صاحبه قد سبقني بقليل فشبرت قدمه في الأرض فوجدت طول قدمه ثلاثة أشبار ونصفا وربعا بشبري وأخبرني صاحبي أبو عبد الله بن خرز الطنجي أنه اجتمع به في حكاية وجاءني بكلام من عنده مما يتفق في الأندلس في سنة خمس وثمانين وخمسمائة وهي السنة التي كنا فيها وما يتفق في سنة ست وثمانين مع الإفرنج فكان كما قال ما غادر حرفا\n\n\n### [زريب بن برثملا وصي العبد الصالح عيسى بن مريم‏]\n\n\nوأما الذي في الزمان من أصحاب عيسى فهو ما رويناه من حديث عربشاه بن محمد بن أبي المعالي العلوي النوقي الخبوشاني كتابة قال حدثنا محمد بن الحسن بن سهل العباسي الطوسي أنا أبو المحاسن علي بن أبي الفضل الفارمدي إنا أحمد بن الحسين بن علي قال حدثنا أبو عبد الله الحافظ ثنا أبو عمر وعثمان بن أحمد بن السماك ببغداد إملاء ثنا يحيى بن أبي طالب ثنا عبد الرحمن بن إبراهيم الراسبي ثنا مالك بن أنس عن نافع عن ابن عمر قال كتب عمر بن الخطاب إلى سعد بن أبي وقاص وهو بالقادسية أن وجه نضلة بن معاوية الأنصاري إلى حلوان العراق فليغز على ضواحيها قال فوجه سعد نضلة في ثلاثمائة فارس فخرجوا حتى أتوا حلوان العراق وأغاروا على ضواحيها وأصابوا غنيمة وسبيا فأقبلوا يسوقون الغنيمة والسبي حتى رهقت بهم‏\nالعصر وكادت الشمس أن تغرب فالجأ نضلة السبي والغنيمة إلى سفح الجبل ثم قام فاذن فقال الله أكبر الله أكبر قال ومجيب من الجبل يجيبه كبرت كبيرا يا نضلة ثم قال أشهد أن لا إله إلا الله فقال كلمة الإخلاص يا نضلة وقال أشهد أن محمدا رسول الله فقال هو الدين وهو الذي بشرنا به عيسى بن مريم عليهما السلام وعلى رأس أمته تقوم الساعة ثم قال حي على الصلاة قال طوبى لمن مشى إليها وواظب عليها ثم قال حي على الفلاح قال قد أفلح من أجاب محمدا صلى الله عليه وسلم وهو البقاء لأمته قال الله أكبر الله أكبر قال كبرت كبيرا قال لا إله إلا الله قال أخلصت الإخلاص يا نضلة فحرم الله جسدك على النار قال فلما فرغ من أذانه قمنا فقلنا من أنت يرحمك الله أملك أنت أم ساكن من الجن أم من عباد الله أسمعتنا صوتك فارنا شخصك فإنا وفد الله ووفد رسول الله صلى الله عليه وسلم ووفد عمر بن الخطاب قال فانفلق الجبل عن هامة كالرحى أبيض الرأس واللحية عليه طمران من صوف فقال السلام عليكم ورحمة الله وبركاته فقلنا وعليك السلام ورحمة الله وبركاته من أنت يرحمك الله قال أنا زريب بن برثملا وصي العبد الصالح عيسى بن مريم عليهما السلام أسكنني هذا الجبل ودعا لي بطول البقاء إلى نزوله من السماء فيقتل الخنزير ويكسر الصليب ويتبرأ مما نحلته النصارى ما فعل النبي صلى الله عليه وسلم قلنا قبض فبكى بكاء طويلا حتى خضب لحيته بالدموع ثم قال فمن قام فيكم بعده قلنا أبو بكر قال ما فعل قلنا قبض قال فمن قام فيكم بعده قلنا عمر قال إذا فاتني لقاء محمد صلى الله عليه وسلم فأقرءوا عمر مني السلام وقولوا يا عمر سدد وقارب فقد دنا الأمر وأخبروه بهذه الخصال التي أخبركم بها يا عمر إذا ظهرت هذه الخصال في أمة محمد صلى الله عليه وسلم فالهرب الهرب إذا استغنى الرجال بالرجال والنساء بالنساء وانتسبوا في غير مناسبهم وانتموا إلى غير مواليهم ولم يرحم كبيرهم صغيرهم ولم يوقر صغيرهم كبيرهم وترك الأمر بالمعروف فلم يؤمر به وترك النهي عن المنكر فلم ينه عنه وتعلم عالمهم العلم ليجلب به الدنانير والدراهم وكان المطر قيظا والولد غيظا وطولوا المنابر وفضضوا المصاحف وزخرفوا المساجد وأظهروا الرشي وشيدوا البناء واتبعوا الهوى وباعوا الدين بالدنيا واستخفوا الدماء وتقطعت الأرحام وبيع الحكم وأكل الربا وصار التسلط فخرا والغني عزا وخرج الرجل من بيته فقام إليه من هو خير منه وركبت النساء السروج قال ثم غاب عنا فكتب بذلك نضلة إلى سعد وكتب سعد إلى عمر فكتب عمر ائت أنت ومن معك من المهاجرين والأنصار حتى تنزل هذا الجبل فإذا لقيته فأقرئه مني السلام‏\n\n\nفإن رسول الله صلى الله عليه وسلم قال إن بعض أوصياء عيسى بن مريم عليه السلام نزل بذلك الجبل بناحية العراق‏\n\n\nفنزل سعد في أربعة آلاف من المهاجرين والأنصار حتى نزل الجبل أربعين يوما ينادي بالأذان في وقت كل صلاة فلم يجده لم يتابع الراسبي على قوله عن مالك ابن أنس والمعروف في هذا الحديث مالك بن الأزهر عن نافع وابن الأزهر مجهول قال أبو عبد الله الحاكم لم يسمع بذكر ابن الأزهر في غير هذا الحديث والسؤال عن النبي صلى الله عليه وسلم وعن أبي بكر هو من حديث ابن لهيعة عن ابن الأزهر قلنا هذا الحديث وإن تكلم في طريقه فهو صحيح عند أمثالنا كشفا وقوله في زخرفة المساجد وتفضيض المصاحف ليسا على طريق الذم وإنما هما دلالة على اقتراب الساعة وفساد الزمان كدلالة نزول عيسى عليه السلام وخروج المهدي وطلوع الشمس من مغربها معلوم كل ذلك إنه ليس على طريق الذم وإنما الدلالات على الشي‏ء قد تكون مذمومة ومحمودة\n\n\n### [أوصياء الأنباء السابقين في زمان الشريعة المحمدية]\n\n\nهذا الوصي العيسوى بن برثملا لم يزل في ذلك الجبل يتعبد لا يعاشر أحدا وقد بعث رسول الله صلى الله عليه وسلم أ ترى ذلك الراهب بقي على أحكام النصارى لا والله فإن شريعة محمد صلى الله عليه وسلم ناسخة يقول صلى الله عليه وسلم لو كان موسى حيا ما وسعه إلا أن يتبعني وهذا عيسى إذا نزل ما يؤمنا إلا منا أي بسنتنا ولا يحكم فينا إلا بشرعنا فهذا الراهب ممن هو عَلى‏ بَيِّنَةٍ من رَبِّهِ علمه ربه من عنده ما افترضه عليه من شرع نبينا محمد صلى الله عليه وسلم على الطريق التي اعتادها من الله وهذا عندنا ذوق محقق فإنا أخذنا كثيرا من أحكام محمد صلى الله عليه وسلم المقررة في شرعه عند علماء الرسوم وما كان عندنا منها علم فأخذناها من هذا الطريق ووجدناها عند علماء الرسوم كما هي عندنا ومن تلك الطريق نصحح الأحاديث النبوية ونردها أيضا إذا أعلمنا أنها واهية الطرق غير صحيحة عن رسول الله صلى الله عليه وسلم وإن قرر الشارع حكم المجتهد وإن أخطأ ولكن أهل هذه الطريقة ما يأخذون إلا بما حكم به رسول‏\nالله صلى الله عليه وسلم وهذا الوصي من الأفراد وطريقه في مآخذ العلوم طريق الخضر صاحب موسى عليه السلام فهو على شرعنا وإن اختلف الطريق الموصل إلى العلم الصحيح فإن ذلك لا يقدح في العلم‏\n\n\nقال رسول الله صلى الله عليه وسلم فيمن أعطى الولاية من غير مسألة إن الله يعينه عليها وإن الله يبعث إليه ملكا يسدده‏\n\n\nيريد عصمته من الغلط فيما يحكم به قال الخضر وما فَعَلْتُهُ عَنْ أَمْرِي وقال عليه السلام إن يكن في أمتي محدثون فمنهم عمر\n\n\nقد ثبت عندنا إن النبي صلى الله عليه وسلم نهى عن قتل الرهبان الذين اعتزلوا الخلق وانفردوا بربهم فقال ذروهم وما انقطعوا إليه‏\n\n\nفأتى بلفظ مجمل ولم يأمرنا بأن ندعوهم لعلمه صلى الله عليه وسلم أنهم على بينة من ربهم وقد أمر صلى الله عليه وسلم بالتبليغ وأمرنا أن يبلغ الشاهد الغائب فلو لا ما علم رسول الله صلى الله عليه وسلم أن الله يتولى تعليمهم مثل ما تولى تعليم الخضر وغيره ما كان كلامه هذا ولا قرره على شرع منسوخ عنده في هذه الملة وهو الصادق في دعواه صلى الله عليه وسلم أنه بعث إلى الناس كافة كما ذكر الله تعالى فيه فعمت رسالته جميع الخلق وروح هذا التعريف أنه كل من أدركه زمانه وبلغت إليه دعوته لم يتعبده الله إلا بشرعه فإنا نعلم قطعا أنه صلى الله عليه وسلم ما شافه جميع الناس بالخطاب في زمانه فما هو إلا الوجه الذي ذكرنا وهذا الراهب من العيسويين الذين ورثوا عيسى عليه السلام إلى زمان بعثة محمد صلى الله عليه وسلم فلما بعث محمد صلى الله عليه وسلم تعبد الله هذا الراهب بشرعه صلى الله عليه وسلم وعلمه من لدنه علما بالرحمة التي آتاه من عنده كان ورثه أيضا حالة عيسوية من محمد صلى الله عليه وسلم فلم يزل عيسويا في الشريعتين أ لا ترى هذا الراهب قد أخبر بنزول عيسى عليه السلام وأخبر أنه إذا نزل يقتل الخنزير ويكسر الصليب أ تراه بقي على تحليل لحم الخنزير فلم يزل هذا الراهب عيسويا في الشريعتين فله الأجر مرتين أجر اتباعه نبيه وأجر اتباعه محمدا صلى الله عليه وسلم وهو في انتظار عيسى إلى أن ينزل وهؤلاء الصحابة قد رأوه مع نضلة وما سألوه عن حاله في الإسلام والايمان ولا بما يتعبد نفسه من الشرائع لأن النبي صلى الله عليه وسلم ما أمرهم بسؤال مثله فعلمنا قطعا أن النبي صلى الله عليه وسلم لا يقر أحدا على الشرك وعلم إن لله عبادا يتولى الحق تعليمهم من لدنه علم ما أنزله على محمد صلى الله عليه وسلم رحمة منه وفضلا وكان فضل الله عظيما ولو كان ممن يؤدي الجزية لقلنا إن الشرع المحمدي قد قرر له دينه ما دام يعطي الجزية وهذه مسألة دقيقة في عموم رسالته وأنه بظهوره لم يبق شرع إلا ما شرعه ومما شرع تقريرهم على شرعهم ما داموا يعطون الجزية إذا كانوا من أهل الكتاب وكم لله تعالى من هؤلاء العباد في الأرض‏\n\n\n### [أصول العيسويين وروحانيتهم‏]\n\n\nفأصل العيسويين كما قررناه تجريد التوحيد من الصور الظاهرة في الأمة العيسوية والمثل التي لهم في الكنائس من أجل أنهم على شريعة محمد صلى الله عليه وسلم ولكن الروحانية الحالية التي هم عليها عيسوية في النصارى وموسوية في اليهود من مشكاة محمد صلى الله عليه وسلم من‏\n\n\nقوله صلى الله عليه وسلم اعبد الله كأنك تراه والله في قبلة المصلي وإن العبد إذا صلى استقبل ربه‏\n\n\nومن كل ما ورد في الله من أمثال هذه النسب وليس للعيسوي من هذه الأمة من الكرامات المشي في الهواء ولكن لهم المشي على الماء والمحمدي يمشي في الهواء بحكم التبعية فإن النبي صلى الله عليه وسلم ليلة أسرى به وكان محمولا\n\n\nقال في عيسى عليه السلام لو ازداد يقينا لمشى في الهواء\n\n\nولا شك أن عيسى عليه السلام أقوى في اليقين منا بما لا يتقارب فإنه من أولي العزم من الرسل ونحن نمشي في الهواء بلا شك وقد رأينا خلقا كثيرا ممن يمشي في الهواء في حال مشيهم في الهواء فعلمنا قطعا إن مشينا في الهواء إنما هو بحكم صدق التبعية لا بزيادة اليقين على يقين عيسى عليه السلام قد علم كل منا مشربه فمشينا بحكم التبعية لمحمد صلى الله عليه وسلم من الوجه الخاص الذي له هذا المقام لا من قوة اليقين كما قلنا الذي كنا نفضل به عيسى عليه السلام حاشى لله أن نقول بهذا كما إن أمة عيسى يمشون على الماء بحكم التبعية لا بمساواة يقينهم يقين عيسى عليه السلام فنحن مع الرسل في خرق العوائد الذين اختصوا بها من الله وظهر أمثالها علينا بحكم التبعية كما مثلناه في كتاب اليقين لنا أن لمماليك الخواص الذين يمسكون نعال أستاذيهم من الأمراء إذا دخلوا على السلطان وبقي بعض الأمراء خارج الباب حين لم يؤذن لهم في الدخول أ ترى المماليك الداخلين مع أستاذيهم أرفع منصبا من الأمراء الذي ما أذن لهم فهل دخلوا إلا بحكم التبعية لأستاذيهم بل كل شخص على رتبته فالأمراء متميزون على الأمراء والمماليك متميزون على المماليك‏\nفي جنسهم كذلك نحن مع الأنبياء فيما يكون للاتباع من خرق العوائد ثم إن النبي صلى الله عليه وسلم ما مشى في الهواء إلا محمولا على البراق كالراكب وعلى الرفرف كالمحمول في المحفة فأظهر البراق والرفرف صورة المقام الذي هو عليه في نفسه بأنه محمول في نفسه ونسبة أيضا إلهية من قوله تعالى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ ومن قوله ويَحْمِلُ عَرْشَ رَبِّكَ فالعرش محمول فهذا حمل كرامة بالحاملين وحال راحة ومجد وعز للمحمولين وقد قررنا لك في غير موضع أن المحمول أعلى من غير المحمول في هذا المقام وأمثاله وأنه لا حول ولا قوة إلا بالله مما اختص به الحملة وإن كان جميع الخلق محمولين ولكن لم يكشف ذلك الحمل لكل أحد وإن كان الحمل على مراتب حمل عن عجز وحمل عن حقيقة كحمل الأثقال وحمل عن شرف ومجد فالعناية بهذه الطائفة أن يكونوا محمولين ظاهرا كما هو الأمر في نفسه باطنا لتبريهم من الدعوى كما قررناه في بابه‏\n\n\n### [علامات العيسويين‏]\n\n\nوللعيسويين همة فعالة ودعاء مقبول وكلمة مسموعة ومن علامة العيسويين إذا أردت أن تعرفهم فتنظر كل شخص فيه رحمة بالعالم وشفقة عليه كان من كان وعلى أي دين كان وبأية نحلة ظهر وتسليم لله فيهم لا ينطقون بما تضيق الصدور له في حق الخلق أجمعين عند خطابهم عباد الله ومن علامتهم أنهم ينظرون من كل شي‏ء أحسنه ولا يجري على ألسنتهم إلا الخير واشتركت في ذلك الطبقة الأولى والثانية فالأولى مثل ما\n\n\nروى عن عيسى عليه السلام أنه رأى خنزيرا فقال له أنج بسلام فقيل له في ذلك فقال أعود لساني قول الخير\n\n\nوأما الثانية\n\n\nفإن النبي صلى الله عليه وسلم قال في الميتة حين مر عليها ما أحسن بياض أسنانها وقال من كان معه ما أنتن ريحها\n\n\nوأن النبي صلى الله عليه وسلم وإن كان قد أمر بقتل الحيات على وجه خاص وأخبر أن الله يحب الشجاعة ولو على قتل حية ومع هذا فإنه كان بالغار في منى وقد نزلت عليه سورة والمرسلات وبالمرسلات يعرف الغار إلى الآن دخلته تبركا فخرجت حية وابتدر الصحابة إلى قتلها فأعجزهم فقال رسول الله صلى الله عليه وسلم إن الله وقاها شركم كما وقاكم شرها\n\n\nفسماه شرا مع كونه مأمورا به مثل قوله تعالى في القصاص وجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها فسمى القصاص سيئة وندب إلى العفو فما وقعت عينه صلى الله عليه وسلم إلا على أحسن ما كان في الميتة فهكذا أولياء الله لا ينظرون من كل منظورا لا أحسن ما فيه وهم العمي عن مساوي الخلق لا عن المساوي لأنهم مأمورون باجتنابها كما هم ضم عن سماع الفحشاء كما هم البكم عن التلفظ بالسوء من القول وإن كان مباحا في بعض المواطن هكذا عرفناهم فسبحان من اصطفاهم واجتباهم وهداهم إِلى‏ صِراطٍ مُسْتَقِيمٍ أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ فهذا مقام عيسى عليه السلام في محمد صلى الله عليه وسلم لأنه تقدمه بالزمان ونقلت عنه هذه الأحوال قال تعالى لنبيه صلى الله عليه وسلم حين ذكر في القرآن من ذكر من النبيين وعيسى في جملة من ذكر عليهم السلام أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ وإن كان مقام الرسالة يقتضي تبيين الحسن من القبيح ليعلم كما قال تعالى لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ فإن بين السوء في حق شخص فبوحي من الله كما قال في شخص بئس أين العشيرة والخضر قتل الغلام وقال فيه طبع كافر أو أخبر لو تركه بما يكون منه من السوء في حق أبويه وقال ما فعلت ذلك عن أمري فالذي للرجال من ذواتهم القول الحسن والنظر إلى الحسن والإصغاء بالسمع إلى الحسن فإن ظهر منهم وقتا ما خلاف هذا من نبي أو ولي مرجوم فذلك عن أمر إلهي ما هو لسانهم فهذا قد ذكرنا من أحوال العيسويين ما يسره الله على لساني والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## (Chapter Thirty-Six: Concerning the Knowledge of the ‘Isawiyyun [Followers of Jesus], their Poles, and their Principles)\n\nWhoever revives his Reality (حقيقته) / And is cured of the ailment of veils (الحجب),\nHe is Jesus (‘Isa); no trace / Of doubt (الريب) attaches to him in our view.\nFor his nature has granted him / A rank (رتبة) that transcends all ranks.\nYou recognize him by the attributes of Holiness (القدس) / In the clear text of Revelation (الوحي) and the Scriptures.\nNo one attained this attribute / In ages past, save his heir (وارثه).\nHis spiritual resolve (همته) flows through the cosmos, / Among non-Arabs and Arabs alike.\nBy it, their souls are revived, / And by it, calamities are removed.\n\n### [The Muhammadan Law (Shari'a) and the Universality of its Heirs]\n\nKnow, may Allah support you, that since the Law of Muhammad (peace and blessings be upon him) encompassed all preceding Laws, and since no ruling of those previous Laws remains in this world except what the Muhammadan Law (الشريعة المحمدية) has confirmed—it is by this confirmation that they are established. Thus, we worship according to them because Muhammad (PBUH) confirmed them, not because the specific Prophet of that time confirmed them. For this reason, the Messenger of Allah (PBUH) was granted the comprehensive words (جوامع الكلم). When a Muhammadan acts—and today, all accountable beings in the world, both humans and jinn, are Muhammadan, as there is no divine Law (شرع إلهي) in the world today except this Muhammadan Law—this actor from this Community (الأمة) will inevitably encounter, in his action, a path (طريقة) belonging to one of the preceding Prophets, which is contained within this Law. This occurs through the unveiling (فتح) granted to his heart and his path, and by the realization (تحقق) of that path, whose result accompanies it. When he is granted an unveiling in that specific path, he is attributed to the owner of that Law, and is called ‘Isawi (Follower of Jesus), Musawi (Follower of Moses), or Ibrahimi (Follower of Abraham). This attribution is due to the realization of the specific gnosis (المعارف) and the spiritual station (المقام) that manifested for him, all of which falls under the protection of the Law of Muhammad (PBUH). He is distinguished by that attribution or lineage (النسب) from others, so that it may be known that what he inherited from Muhammad (PBUH) is exactly what Moses or any other Prophet, had they been alive and followed him, would have inherited. Since their Laws preceded this Law, we consider this Gnostic (العارف) an heir (وارثا), as inheritance is from the first to the last. If that first Prophet had not had an established Law prior to the confirmation by Muhammad (PBUH), we would have equated the Prophets and Messengers, since the time of the Muhammadan Law encompasses us all. This is the same way Elias, Khidr, and Jesus (when he descends) are equal to us today, for the present time governs them, as there is no legislative prophecy (نبوة تشريع) after Muhammad (PBUH).\n\n### [The Muhammadan Heir]\n\nNo one among the people of this path is called \"Muhammadan\" except for two types of individuals: First, a person who is specialized in inheriting a knowledge of a ruling (حكم) that did not exist in any previous Law—he is called Muhammadan. Second, a person who has gathered all the spiritual stations (المقامات) and then transcended them into the state of No-Station (لا مقام), such as Abu Yazid and his peers—he is also called Muhammadan. Everyone else besides these two individuals is attributed to one of the Prophets. For this reason,\n\nIt is reported in the Hadith that the scholars are the heirs of the Prophets (العلماء ورثة الأنبياء),\n\nand it did not say \"heirs of a specific Prophet.\" The ones addressed by this are the scholars of this Community (الأمة). It is also reported with this wording, his (PBUH) saying: *The scholars of this Community are the Prophets of other communities,* and in one narration: *like the Prophets of the Children of Israel.*\n\n### [The First and Second ‘Isawiyyun]\n\nThe first ‘Isawiyyun are the Disciples (الحواريون), the followers of Jesus. Whoever among them survived until the Law of Muhammad (PBUH), believed in it, and followed it, and it happened that he attained from this Law what was previously the Law of Jesus (PBUH)—he inherits from Jesus (PBUH) without any veil (حجاب). Then, he inherits from Jesus (PBUH) within the Law of Muhammad (PBUH) as a follower inherits from a follower, not from a leader. There is a difference between the two in direct experience (الذوق). For this reason, the Messenger of Allah (PBUH) said concerning such a person that he has a double reward (الأجر مرتين). Likewise, he has two inheritances, two unveilings (فتحان), and two distinct tastes (ذوقان), yet he is attributed only to that Prophet (PBUH). These are the second ‘Isawiyyun. Their principle (أصولهم) is the unification of purification (توحيد التجريد) through the path of similitude (المثال), because the existence of Jesus (PBUH) was not through human intercourse, but through the representation (تمثل) of a spirit in the form of a human. This is why the emphasis on form (الصورة) prevailed among the community of Jesus son of Mary, unlike other communities. They depict images in their churches, and they worship inwardly by turning towards them, for the origin of their Prophet (PBUH) was through representation (تمثل). That Reality (الحقيقة) has flowed through his community until now. When the Law of Muhammad (PBUH) came and forbade images, yet he (PBUH) contained the Reality of Jesus and his Law was folded into his Law, he legislated for us (PBUH) that we should worship Allah *as if we see Him*. Thus, he introduced it to us through the Imagination (الخيال). This is the meaning of representation (التصوير), except that he forbade its manifestation in a sensory form (صورة حسية) within this Community.\n\n### [Worshiping Allah based on Vision]\n\nFurthermore, this specific ruling—which is, \"Worship Allah as if you see Him\"—was not spoken by Muhammad (PBUH) to us directly, but he spoke it to Gabriel (Jibril, PBUH), who was the one who represented himself to Mary as a perfect man (بَشَراً سَوِيًّا) during the creation of Jesus (PBUH). It was as the common proverb says: \"I mean you, so listen, neighbor.\" Thus, we were the intended audience of that saying. For this reason,\n\nIt came at the end of the Hadith: *This was Gabriel, who wished that you should learn, since you did not ask.*\n\nIn one narration: *He came to teach the people their religion.* In another narration: *He came to teach you your religion.*\n\nThe narrations never depart from the fact that we were the intended recipients of the teaching. Then, know that what we have, which is not part of the Law of Jesus (PBUH), is his saying: *And if you do not see Him, then indeed He sees you.*\n\nThis is one of their principles. Our Shaykh, Abu al-Abbas al-Arabi (may Allah have mercy on him), was an ‘Isawi in his culmination (نهايته), which was our beginning. I mean, the culmination of our Shaykh in this path was ‘Isawi. Then we were transferred to the Musawi (Mosaic) Solar Unveiling (الفتح الموسوي الشمسي). After that, we were transferred to [the path of] Hud (PBUH). Then, after that, we were transferred to all the Prophets (PBUH). Then, after that, we were transferred to Muhammad (PBUH). This is how our affair proceeded in this path—may Allah establish us upon it and not turn us away from the straight path. Because of this nature (النشأة) upon which Allah created us in this path, Allah granted us the face of the Real (وجه الحق) in everything. In our view, there is nothing existing in the world except that we have a witnessing (شهود) of the very essence of the Real (عين حق) in it, which we venerate. Thus, we do not reject anything in the existent world (العالم الوجودي).\n\n### [The Companions of Jesus and Jonah in Ibn Arabi’s Time]\n\nIn our time today, there is a group of the companions of Jesus (PBUH) and Jonah (PBUH) whom they love, and who are secluded from people. As for the people who belong to the community of Jonah, I saw the footprint of one of them on the coast. His owner had preceded me by a short time. I measured his foot in the earth and found its length to be three and a half and a quarter spans by my span. My companion, Abu Abdullah ibn Kharraz al-Tanji, informed me that he met him in a story, and he brought me words from him concerning events that would occur in Andalusia in the year 585 AH (the year we were in), and events that would occur in the year 586 AH with the Franks. It happened exactly as he said, without missing a single letter.\n\n### [Zurayb ibn Barthamla, the Successor (Wasi) of the Righteous Servant Jesus son of Mary]\n\nAs for the one among the companions of Jesus in this time, it is what we narrated in writing from the Hadith of Arabshah ibn Muhammad ibn Abi al-Ma’ali al-Alawi al-Nawqi al-Khabushani. He said: Muhammad ibn al-Hasan ibn Sahl al-Abbasi al-Tusi narrated to us, saying: Abu al-Mahasin Ali ibn Abi al-Fadl al-Farmadi informed us, saying: Ahmad ibn al-Husayn ibn Ali informed us, saying: Abu Abdullah al-Hafiz narrated to us, saying: Abu Amr Uthman ibn Ahmad ibn al-Sammak narrated to us in Baghdad by dictation, saying: Yahya ibn Abi Talib narrated to us, saying: Abd al-Rahman ibn Ibrahim al-Rasibi narrated to us, saying: Malik ibn Anas narrated from Nafi’ from Ibn Umar, who said: Umar ibn al-Khattab wrote to Sa’d ibn Abi Waqqas, who was at Qadisiyya, instructing him to dispatch Nadla ibn Mu’awiya al-Ansari to Hulwan of Iraq to raid its outskirts. Sa’d dispatched Nadla with three hundred horsemen. They set out until they reached Hulwan of Iraq, raided its outskirts, and seized spoils and captives. They proceeded, driving the spoils and captives, until the afternoon (Asr) overtook them, and the sun was about to set. Nadla sheltered the captives and spoils at the foot of the mountain. Then he stood up and called the Adhan (call to prayer), saying: \"Allahu Akbar, Allahu Akbar.\" A voice from the mountain answered him, saying: \"You have magnified the Great One, O Nadla.\" Then he said: \"I bear witness that there is no god but Allah.\" The voice said: \"The word of sincerity, O Nadla.\" And he said: \"I bear witness that Muhammad is the Messenger of Allah.\" The voice said: \"He is the Religion, and he is the one whom Jesus son of Mary (peace be upon them both) gave us glad tidings of. The Hour will rise upon the head of his Community.\" Then he said: \"Hasten to the Prayer (Hayya ‘ala al-Salah).\" The voice said: \"Blessed is he who walks to it and perseveres in it.\" Then he said: \"Hasten to Salvation (Hayya ‘ala al-Falah).\" The voice said: \"He who answers Muhammad (PBUH) has attained salvation; it is the subsistence (البقاء) for his Community.\" He said: \"Allahu Akbar, Allahu Akbar.\" The voice said: \"You have magnified the Great One.\" He said: \"La ilaha illa Allah.\" The voice said: \"You have perfected sincerity, O Nadla, and Allah has forbidden your body to the Fire.\" When he finished his Adhan, we stood up and said: \"Who are you, may Allah have mercy on you? Are you an angel, a resident jinn, or one of the servants of Allah? You have made us hear your voice, so show us your person, for we are the delegation of Allah, the delegation of His Messenger (PBUH), and the delegation of Umar ibn al-Khattab.\" The mountain then split open, revealing a head the size of a millstone, white-haired and white-bearded, wearing two coarse woolen garments (طمران). He said: \"Peace and the mercy of Allah and His blessings be upon you.\" We replied: \"And upon you be peace and the mercy of Allah and His blessings. Who are you, may Allah have mercy on you?\" He said: \"I am Zurayb ibn Barthamla, the successor (وصي) of the righteous servant Jesus son of Mary (peace be upon them both). He settled me in this mountain and prayed for me to have a long life until his descent from heaven, when he will kill the swine, break the cross, and disavow what the Christians have attributed to him. What happened to the Prophet (PBUH)?\" We said: \"He passed away.\" He wept for a long time until his beard was soaked with tears. Then he asked: \"Who succeeded him among you?\" We said: \"Abu Bakr.\" He asked: \"What happened to him?\" We said: \"He passed away.\" He asked: \"Who succeeded him among you?\" We said: \"Umar.\" He said: \"Since I missed meeting Muhammad (PBUH), convey my greetings to Umar, and tell him: O Umar, be firm and moderate, for the matter is near. Inform him of these characteristics that I shall tell you, O Umar: When these characteristics appear in the Community of Muhammad (PBUH), then flee, flee! [These are:] when men suffice themselves with men, and women with women; when they claim lineage outside their own and allegiance outside their patrons; when their elders show no mercy to their young, and their young show no respect to their elders; when commanding the good is abandoned and not commanded, and forbidding the evil is abandoned and not forbidden; when their scholar learns knowledge only to attract dinars and dirhams; when the rain is like the summer heat (قيظا), and the child is a source of rage (غيظا); when they lengthen the pulpits, adorn the Qurans with silver (فضضوا المصاحف), decorate the mosques, display bribery (الرشي), build tall structures, follow caprice (الهوى), sell religion for the world, treat bloodshed lightly, sever kinship ties, sell judgment, consume usury (الربا), when domination becomes a source of pride, and wealth a source of honor; when a man leaves his house and someone better than him stands up to greet him; and when women ride saddles.\" Then he disappeared from us. Nadla wrote about this to Sa’d, and Sa’d wrote to Umar. Umar wrote back: \"Go, you and those with you from the Muhajirun and the Ansar, until you descend upon this mountain. If you meet him, convey my greetings to him.\"\n\nFor the Messenger of Allah (PBUH) said that one of the successors of Jesus son of Mary (PBUH) had settled in that mountain in the region of Iraq.\n\nSa’d descended with four thousand of the Muhajirun and the Ansar until he reached the mountain. He stayed forty days, calling the Adhan at the time of every prayer, but he did not find him. Al-Rasibi was not followed in his narration from Malik ibn Anas. What is known in this Hadith is Malik ibn al-Azhar from Nafi’, and Ibn al-Azhar is unknown. Abu Abdullah al-Hakim said: The mention of Ibn al-Azhar is not heard in any Hadith other than this one. The questioning about the Prophet (PBUH) and Abu Bakr is from the Hadith of Ibn Lahi’a from Ibn al-Azhar. We say: Although there is discussion regarding the chain of transmission (طريقه) of this Hadith, it is sound (صحيح) according to people like us through Unveiling (كشفا). And his statement regarding the decoration of mosques and the adornment of Qurans with silver (تفضيض المصاحف) is not meant as a condemnation (ذم), but rather as an indication of the approach of the Hour and the corruption of the time, just like the indication of the descent of Jesus (PBUH), the emergence of the Mahdi, and the rising of the sun from its setting. It is known that all of this is not meant as condemnation, but indications of a thing may be blameworthy or praiseworthy.\n\n### [The Successors of Previous Prophets in the Time of the Muhammadan Law]\n\nThis ‘Isawi successor, Ibn Barthamla, has remained in that mountain, worshipping, and not socializing with anyone. The Messenger of Allah (PBUH) was sent. Do you think that monk remained upon the rulings of the Christians? No, by Allah! For the Law of Muhammad (PBUH) is abrogating (ناسخة). He (PBUH) said: *If Moses were alive, he would have no choice but to follow me.* And Jesus, when he descends, will only lead us in prayer *from among us*—meaning, according to our Sunna—and he will only rule among us according to our Law. This monk is one of those who are <<on a clear proof (بَيِّنَةٍ) from his Lord>>. His Lord taught him, from His presence (لدنه), what He obligated upon him from the Law of our Prophet Muhammad (PBUH), according to the method he was accustomed to receiving from Allah. This, in our view, is a verified direct experience (ذوق محقق). We have taken many of the rulings of Muhammad (PBUH) established in his Law by the scholars of external forms (علماء الرسوم), and what we did not have knowledge of, we took through this path, and we found them with the scholars of external forms exactly as they were with us. It is through that path that we verify the prophetic Hadiths and also reject them if we are informed that their chains of transmission are weak and not soundly reported from the Messenger of Allah (PBUH). Although the Lawgiver confirmed the ruling of the *mujtahid* (independent jurist) even if he erred, the people of this path only accept what the Messenger of Allah (PBUH) ruled. This successor is one of the Solitaries (الأفراد), and his method of acquiring knowledge is the method of Khidr, the companion of Moses (PBUH). Thus, he is upon our Law, even if the path leading to sound knowledge differs, for that does not invalidate the knowledge.\n\nThe Messenger of Allah (PBUH) said concerning one who is granted governorship (الولاية) without asking for it: *Allah assists him in it, and Allah sends an angel to guide him.*\n\nThis refers to his protection (عصمته) from error in what he judges. Khidr said: <<Nor did I do it of my own accord (عَنْ أَمْرِي)>>. And he (PBUH) said: *If there are inspired people (محدثون) in my Community, Umar is one of them.*\n\nIt is established with us that the Prophet (PBUH) forbade the killing of monks who have isolated themselves from creation and devoted themselves solely to their Lord, saying: *Leave them and what they have devoted themselves to.*\n\nHe used a general term (لفظ مجمل) and did not command us to invite them [to Islam], knowing (PBUH) that they are <<on a clear proof from their Lord>>. He (PBUH) commanded the conveyance [of the message] and commanded that the witness should inform the absent. If the Messenger of Allah (PBUH) had not known that Allah takes charge of teaching them, just as He took charge of teaching Khidr and others, he would not have spoken this way, nor would he have confirmed them upon an abrogated law in this religion. He (PBUH) is truthful in his claim that he was sent to all people (كافة), as Allah mentioned concerning him. Thus, his message encompasses all creation. The essence of this definition is that whoever lived during his time and received his call, Allah only obligates him to worship according to his Law. We know with certainty that he (PBUH) did not address all people directly in his time, so the matter is only as we have mentioned. This monk is one of the ‘Isawiyyun who inherited Jesus (PBUH) up until the time of the mission of Muhammad (PBUH). When Muhammad (PBUH) was sent, Allah obligated this monk to worship according to his Law (PBUH) and taught him knowledge from His presence (لدنه) through the mercy He granted him. He also inherited the ‘Isawi state from Muhammad (PBUH). Thus, he remained ‘Isawi in both Laws. Do you not see that this monk informed [us] of the descent of Jesus (PBUH) and informed [us] that when he descends, he will kill the swine and break the cross? Do you think he remained upon the permissibility of swine meat? This monk has remained ‘Isawi in both Laws, so he has a double reward: the reward for following his Prophet and the reward for following Muhammad (PBUH). He is awaiting Jesus until he descends. These companions saw him with Nadla, and they did not ask him about his state in Islam and faith, nor about the laws by which he worshipped himself, because the Prophet (PBUH) did not command them to question someone like him. We know with certainty that the Prophet (PBUH) would not confirm anyone upon polytheism (الشرك), and we know that Allah has servants whom the Real (الحق) takes charge of teaching, from His presence, the knowledge He revealed to Muhammad (PBUH), out of His mercy and grace. And the grace of Allah is immense. If he were one who paid the *jizya* (poll tax), we would say that the Muhammadan Law confirmed his religion as long as he paid the *jizya*. This is a subtle issue regarding the universality of his message and that, with his appearance, no law remained except what he legislated. And among what he legislated is the confirmation of their religion, as long as they pay the *jizya*, if they are People of the Book. And how many such servants of Allah are there on Earth?\n\n### [The Principles and Spirituality of the ‘Isawiyyun]\n\nThe principle of the ‘Isawiyyun, as we established, is the purification of Unity (توحيد التجريد) from the apparent forms (الصور الظاهرة) in the ‘Isawi community and the images they have in churches. This is because they are upon the Law of Muhammad (PBUH). However, the spiritual state (الروحانية الحالية) they are upon is ‘Isawi among the Christians and Musawi among the Jews, [derived] from the niche (مشكاة) of Muhammad (PBUH), from\n\nHis (PBUH) saying: *Worship Allah as if you see Him,* and *Allah is in the direction of the worshipper’s prayer (Qibla),* and *When the servant prays, he faces his Lord.*\n\nAnd from everything reported concerning Allah regarding such attributions. The ‘Isawi of this Community does not possess the miracle (كرامات) of walking in the air, but they do possess walking on water. The Muhammadan walks in the air by virtue of following (بحكم التبعية). For the Prophet (PBUH), on the night of his Ascension (Mi’raj), was carried.\n\nHe said concerning Jesus (PBUH): *Had he increased in certainty (yaqin), he would have walked in the air.*\n\nThere is no doubt that Jesus (PBUH) is incomparably stronger in certainty than we are, for he is one of the Messengers of Resolve (أولي العزم من الرسل). Yet, we walk in the air without doubt. We have seen many people walking in the air while they were doing so. Thus, we know with certainty that our walking in the air is only by virtue of the sincerity of our following (صدق التبعية), not by an increase in certainty over the certainty of Jesus (PBUH). Each of us knows his source (مشربه). We walk by virtue of following Muhammad (PBUH) from the specific aspect (الوجه الخاص) that holds this station, not from the strength of certainty, which we would otherwise prefer over Jesus (PBUH)—God forbid that we should say this! Similarly, the community of Jesus walks on water by virtue of following, not by their certainty equaling the certainty of Jesus (PBUH). We are with the Messengers in the breaking of customs (خرق العوائد) that were specific to them from Allah, and the like of which appears upon us by virtue of following. We illustrate this, as we did in our Book of Certainty (كتاب اليقين), with the example of the special servants (مماليك الخواص) who hold the sandals of their masters, the Emirs, when they enter upon the Sultan, while some Emirs remain outside the door because they were not granted permission to enter. Do you think the servants who entered with their masters hold a higher rank than the Emirs who were not permitted entry? They only entered by virtue of following their masters. Rather, every person is in his rank: the Emirs are distinguished above the Emirs, and the servants are distinguished above the servants within their own class. Likewise, we are with the Prophets regarding the breaking of customs that occurs for the followers. Furthermore, the Prophet (PBUH) only walked in the air while being carried—on the Buraq, like a rider, and on the Rafraf, like one carried in a litter (محفة). The Buraq and the Rafraf manifested the form of the station he held in himself: that he is inherently carried. This is also a divine attribution, from His saying, the Exalted: <<The Most Merciful is established upon the Throne (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى)>> and His saying: <<And your Lord’s Throne will be borne (يَحْمِلُ عَرْشَ رَبِّكَ)>>. The Throne is carried. This carrying is a miracle (كرامة) by the carriers, and a state of rest, glory, and honor for the carried. We have established for you elsewhere that the carried is higher than the non-carried in this station and its like, and that the phrase \"There is no power and no strength except with Allah\" (لا حول ولا قوة إلا بالله) is specific to the bearers. Although all creation is carried, that carrying is not unveiled to everyone. Carrying is of different levels: carrying due to incapacity, carrying due to Reality (حقيقة), such as carrying heavy burdens, and carrying due to honor and glory. The special providence (العناية) for this group is that they are carried outwardly, just as the matter is inwardly, so that they may be free from pretension, as we established in its chapter.\n\n### [The Signs of the ‘Isawiyyun]\n\nThe ‘Isawiyyun possess effective spiritual resolve (همة فعالة), an accepted prayer (دعاء مقبول), and a word that is heard (كلمة مسموعة). If you wish to recognize the ‘Isawiyyun, look for every person who possesses mercy (رحمة) and compassion (شفقة) for the world, whoever they may be, whatever religion they follow, and whatever creed they manifest. They possess submission to Allah concerning them, and they do not speak what causes distress in the hearts regarding all creation when addressing the servants of Allah. One of their signs is that they look for the best in everything, and only goodness flows from their tongues. The first and second classes share this characteristic. The first class is exemplified by what\n\nwas narrated concerning Jesus (PBUH): He saw a pig and said to it, \"Pass in peace.\" When questioned about this, he replied, \"I have accustomed my tongue to speak only good.\"\n\nAs for the second class,\n\nThe Prophet (PBUH) said concerning a carcass (الميتة) when he passed by it: *How beautiful the whiteness of its teeth is!* while those with him said: *How foul its smell is!*\n\nAlthough the Prophet (PBUH) commanded the killing of snakes in a specific context and informed us that Allah loves courage, even if it is against a snake, despite this, when he was in the cave in Mina, the Surah *Al-Mursalat* (The Emissaries) was revealed to him. The cave is known by *Al-Mursalat* to this day. I entered it seeking blessing. A snake came out, and the Companions rushed to kill it, but it eluded them. The Messenger of Allah (PBUH) said: *Allah protected it from your evil, just as He protected you from its evil.*\n\nHe called it \"evil\" (شرا), even though killing it was commanded, similar to His saying, the Exalted, concerning retaliation (القصاص): <<The recompense of an evil deed is an evil deed like it (وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها)>>. He called retaliation an \"evil deed\" (سيئة) and recommended forgiveness. The eye of the Prophet (PBUH) only fell upon the most beautiful aspect of the carcass. Thus are the Friends of Allah (أولياء الله): they only look at the best part of everything observed. They are blind to the faults of creation (مساوي الخلق), not blind to the faults themselves, because they are commanded to avoid them. Likewise, they are deaf to hearing obscenity, and mute concerning uttering evil speech, even if it is permissible in some situations. This is how we have known them. Glory be to Him who chose them, selected them, and guided them <<to a straight path (إِلى‏ صِراطٍ مُسْتَقِيمٍ)>>. <<Those are the ones whom Allah has guided, so follow their guidance (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ)>>. This is the station of Jesus (PBUH) within Muhammad (PBUH), because he preceded him in time, and these states were transmitted from him. Allah, the Exalted, said to His Prophet (PBUH) when He mentioned the Prophets in the Quran, and Jesus was among those mentioned (PBUH): <<Those are the ones whom Allah has guided, so follow their guidance>>. Although the station of Messengership requires the clarification of the good from the ugly, so that it may be known, as the Exalted said: <<that you may make clear to the people what was sent down to them (لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ)>>. If he clarifies evil concerning a person, it is by revelation from Allah, as he said concerning a person: *What a wretched clan!* And Khidr killed the boy and said that he was stamped as an unbeliever, or he informed [Moses] of the evil that would come from him concerning his parents, and he said: <<Nor did I do it of my own accord (عَنْ أَمْرِي)>>. Thus, what belongs to men by their own essence (ذواتهم) is good speech, looking at the good, and listening to the good. If, at any time, the opposite of this appears from a Prophet or a Friend (ولي) who is stoned, that is by divine command; it is not their natural tongue. This is what Allah facilitated for me to mention concerning the states of the ‘Isawiyyun. And Allah <<speaks the Truth (يَقُولُ الْحَقَّ) and guides to the way (يَهْدِي السَّبِيلَ)>>.",
    "ur": "(باب چھتیسواں: عیسویون، ان کے اقطاب اور ان کے اصول کی معرفت میں)\n\nجس نے بھی اپنی حقیقت کو زندہ کیا\nاور حجابات (الحجب) کی بیماری سے شفا پائی\n\nتو وہ ہمارے نزدیک عیسیٰ ہے، اس کے ساتھ\nکسی شک و شبہ کا تعلق نہیں ہے\n\nکیونکہ اس کی فطرت نے ایسا مرتبہ عطا کیا ہے\nجو تمام مراتب سے بلند ہے\n\nتم اسے قدس کی صفات کے ذریعے پہچانتے ہو\nواضح وحی اور کتب میں\n\nگزشتہ زمانوں میں اس صفت کو اس کے وارث کے سوا کسی نے حاصل نہیں کیا\nپس اس کی ہمت (الهمة) کائنات میں پھیل گئی، عجمیوں اور عربوں میں\n\nپس اسی کے ذریعے ان کے نفوس زندہ ہوتے ہیں\nاور اسی کے ذریعے مصیبتیں دور ہوتی ہیں۔\n\n### [شریعت محمدیہ اور اس کے وارثوں کی عالمگیریت]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ جب شریعت محمد صلی اللہ علیہ وسلم تمام سابقہ شرائع کو شامل تھی اور اس دنیا میں ان شرائع کا کوئی حکم باقی نہیں رہا سوائے اس کے جسے شریعت محمدیہ نے برقرار رکھا، تو اس کے برقرار رکھنے سے وہ ثابت ہوئیں، اور ہم نے ان کے ذریعے اپنے نفوس کو اس حیثیت سے عبادت میں لگایا کہ محمد صلی اللہ علیہ وسلم نے انہیں برقرار رکھا، نہ کہ اس حیثیت سے کہ اس کے مخصوص نبی نے اپنے وقت میں اسے مقرر کیا تھا۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم کو جوامع الکلم عطا کیے گئے۔\n\nپس جب محمدی عمل کرتا ہے—اور آج جن و انس میں سے تمام مکلف عالم محمدی ہے، آج دنیا میں اس شریعت محمدیہ کے سوا کوئی الٰہی شریعت نہیں ہے—تو اس امت کا یہ عامل اس سے خالی نہیں ہوتا کہ وہ اپنے عمل میں، جو کچھ اس کے دل اور اس کے طریق میں اس کے لیے کھولا جاتا ہے، اس میں کسی سابقہ نبی کے طریق کو پائے اور اس سے متحقق ہو، جو اس شریعت میں شامل ہے اور جس کے طریق کو اس نے برقرار رکھا ہے اور جس کا نتیجہ اس کے ساتھ صحیح ثابت ہوا ہے۔ پس جب اس کے لیے اس میں کشف (الکشف) ہوتا ہے، تو وہ اس شریعت کے صاحب کی طرف منسوب ہوتا ہے، اور اسے عیسوی، یا موسوی، یا ابراہیمی کہا جاتا ہے۔ یہ اس معرفت (المعرفۃ) کے تحقق کی وجہ سے ہے جو اسے حاصل ہوئی اور اس مقام (المقام) کے ظہور کی وجہ سے ہے جو اس کے لیے ظاہر ہوا، جو سب شریعت محمدیہ کے احاطے میں ہے۔ پس وہ اس نسبت یا اس نسب کے ذریعے دوسروں سے ممتاز ہو جاتا ہے تاکہ یہ معلوم ہو جائے کہ اس نے محمد صلی اللہ علیہ وسلم سے وہی وراثت پائی ہے جو اگر موسیٰ یا دیگر انبیاء زندہ ہوتے اور آپ کی پیروی کرتے تو وہ بھی آپ سے وہی وراثت پاتے۔\n\nاور چونکہ ان کی شرائع اس شریعت سے پہلے تھیں، اس لیے ہم نے اس عارف کو وارث قرار دیا، کیونکہ وراثت بعد والے کو پہلے والے سے ملتی ہے۔ اگر اس پہلے نبی کے لیے محمد صلی اللہ علیہ وسلم کے مقرر کرنے سے پہلے کوئی مقرر شدہ شریعت نہ ہوتی، تو ہم انبیاء اور رسولوں کو برابر قرار دیتے، کیونکہ ہم سب کو شریعت محمدیہ کا زمانہ جمع کرتا ہے، جیسا کہ آج الیاس، خضر، اور عیسیٰ جب نازل ہوں گے تو وہ ہمارے برابر ہوں گے، کیونکہ وقت ان پر حکم لگائے گا، اس لیے کہ محمد صلی اللہ علیہ وسلم کے بعد کوئی تشریعی نبوت نہیں ہے۔\n\n### [وارث محمدی]\n\nاور اس طریق کے کسی بھی شخص کو محمدی نہیں کہا جاتا مگر دو اشخاص کو: یا تو وہ شخص جو کسی ایسے حکم کے علم کی وراثت میں خاص ہو جو اس سے پہلے کسی شریعت میں نہ تھا، تو اسے محمدی کہا جاتا ہے۔ یا وہ شخص جو تمام مقامات کو جمع کر لے، پھر ان سے نکل کر لا مقام (لا مقام) کی طرف چلا جائے، جیسے ابو یزید اور ان جیسے دوسرے۔ تو اسے بھی محمدی کہا جاتا ہے۔ ان دو اشخاص کے علاوہ ہر شخص کسی نہ کسی نبی کی طرف منسوب ہوتا ہے۔ اسی لیے\n\nخبر میں آیا ہے کہ: \"علماء انبیاء کے وارث ہیں\" (العلماء ورثة الأنبياء)۔\n\nاور یہ نہیں کہا گیا کہ کسی خاص نبی کے وارث ہیں۔ اور اس کے مخاطب اس امت کے علماء ہیں۔ اور اسی لفظ کے ساتھ آپ صلی اللہ علیہ وسلم کا یہ قول بھی آیا ہے: \"اس امت کے علماء دیگر امتوں کے انبیاء کی مانند ہیں\" (علماء هذه الأمة أنبياء سائر الأمم) اور ایک روایت میں ہے: \"بنی اسرائیل کے انبیاء کی طرح\" (كأنبياء بنى إسرائيل)۔\n\n### [عیسویون اوّل اور ثانی]\n\nپس عیسویون اوّل وہ حواری تھے جو عیسیٰ کے پیروکار تھے۔ پس ان میں سے جو بھی اب تک شریعت محمدیہ کو پا چکا اور اس پر ایمان لایا اور اس کی پیروی کی، اور اتفاق سے اسے اس شریعت سے وہ کچھ حاصل ہوا جو اس سے پہلے عیسیٰ علیہ السلام کی شریعت تھی، تو وہ عیسیٰ علیہ السلام سے وہ وراثت پاتا ہے جو اس نے بغیر کسی حجاب کے پائی۔ پھر وہ عیسیٰ علیہ السلام سے شریعت محمدیہ میں ایک تابع کی وراثت پاتا ہے، نہ کہ متبوع کی۔ اور ان دونوں کے ذوق (الذوق) میں فرق ہے۔ اسی لیے رسول اللہ صلی اللہ علیہ وسلم نے ایسے شخص کے بارے میں فرمایا کہ اسے دوہرا اجر ملے گا، اسی طرح اس کے لیے دو وراثتیں، دو کشف (الکشف) اور دو مختلف ذوق ہیں۔ اور ان دونوں میں اسے صرف اسی نبی علیہ السلام کی طرف منسوب کیا جاتا ہے۔\n\nپس یہ عیسویون ثانی ہیں۔ اور ان کے اصول مثال کے طریق سے توحید التجرید (تجرید کی توحید) ہیں۔ کیونکہ عیسیٰ علیہ السلام کا وجود بشری ذکر سے نہیں تھا، بلکہ روح کے بشر کی صورت میں تمثل (تمثل روح) سے تھا۔ اسی لیے عیسیٰ بن مریم کی امت پر دیگر امتوں کے مقابلے میں صورت کا قول غالب رہا۔ چنانچہ وہ اپنے گرجوں میں مثالیں بناتے ہیں اور ان کی طرف متوجہ ہو کر اپنے نفوس میں عبادت کرتے ہیں، کیونکہ ان کے نبی علیہ السلام کی اصل تمثل سے تھی، پس وہ حقیقت ان کی امت میں اب تک سرایت کیے ہوئے ہے۔\n\nاور جب شریعت محمدیہ آئی اور اس نے تصویروں سے منع کیا، حالانکہ آپ صلی اللہ علیہ وسلم نے عیسیٰ کی حقیقت کو اپنے اندر سمو لیا تھا اور آپ کی شریعت میں ان کی شریعت لپٹی ہوئی تھی، تو آپ صلی اللہ علیہ وسلم نے ہمارے لیے یہ شریعت مقرر فرمائی کہ ہم اللہ کی عبادت اس طرح کریں گویا ہم اسے دیکھ رہے ہیں، پس آپ نے اسے ہمارے لیے خیال (الخيال) میں داخل کر دیا۔ اور یہی تصویر کا معنی ہے، مگر آپ نے اس امت میں حسی صورت میں ظاہر ہونے سے منع فرمایا۔\n\n### [عبادت الٰہی بر بنیاد رؤیت]\n\nپھر یہ خاص شرعی حکم جو کہ \"اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو\" محمد صلی اللہ علیہ وسلم نے ہمیں بلا واسطہ نہیں فرمایا، بلکہ جبرائیل علیہ السلام سے فرمایا، اور وہی تھے جو مریم کے سامنے ایک مکمل انسان کی صورت میں ظاہر ہوئے تھے (بَشَراً سَوِيًّا) جب عیسیٰ علیہ السلام کو پیدا کیا گیا۔ [سورۃ مریم: ۱۷] پس یہ ایسا ہی ہوا جیسا کہ مشہور مثل میں کہا جاتا ہے: \"میرا مطلب تم ہو، اے پڑوسن سنو!\" پس ہم ہی اس قول کے مراد تھے۔ اسی لیے\n\nحدیث کے آخر میں آیا ہے: \"یہ جبرائیل تھے، وہ چاہتے تھے کہ تم جان لو جب تم نے سوال نہیں کیا\"۔\n\nاور ایک روایت میں ہے: \"وہ اس لیے آئے تھے تاکہ لوگوں کو ان کا دین سکھائیں\"۔ اور ایک روایت میں ہے: \"وہ تمہارے پاس تمہارا دین سکھانے آئے تھے\"۔\n\nپس روایات اس بات سے باہر نہیں نکلیں کہ ہم ہی تعلیم کے مقصود تھے۔ پھر آپ کو یہ بھی معلوم ہونا چاہیے کہ جو چیز ہمیں عیسیٰ علیہ السلام کی شریعت کے علاوہ حاصل ہے، وہ آپ کا یہ قول ہے: \"اگر تم اسے نہیں دیکھتے تو وہ تمہیں دیکھتا ہے\"۔\n\nپس یہ ان کے اصول میں سے ہے۔ اور ہمارے شیخ ابو العباس العربی رحمۃ اللہ علیہ اپنی نہایت میں عیسوی تھے، اور وہ ہماری ابتدا تھی—یعنی ہمارے شیخ کی اس طریق میں نہایت عیسویہ تھی—پھر ہمیں موسوی شمسی فتح (الفتح الموسوي الشمسي) کی طرف منتقل کیا گیا، پھر اس کے بعد ہمیں ہود علیہ السلام کی طرف منتقل کیا گیا، پھر اس کے بعد ہمیں تمام انبیاء علیہم السلام کی طرف منتقل کیا گیا، پھر اس کے بعد ہمیں محمد صلی اللہ علیہ وسلم کی طرف منتقل کیا گیا۔ اس طریق میں ہمارا معاملہ اسی طرح تھا، اللہ اسے ہم پر ثابت رکھے اور ہمیں سیدھے راستے سے نہ ہٹائے۔ پس اللہ نے ہمیں اس نشأت کی وجہ سے جو اس نے ہمیں اس طریق میں عطا کی، ہر چیز میں حق کا چہرہ عطا فرمایا۔ پس ہمارے نزدیک دنیا میں کوئی موجود چیز ایسی نہیں ہے جس میں ہمارے لیے عین حق کا شہود (الشہود) نہ ہو، جس کی ہم اس میں تعظیم کرتے ہیں۔ پس ہم وجودی عالم کی کسی بھی چیز کو حقیر نہیں سمجھتے۔\n\n### [ابن عربی کے زمانے میں عیسیٰ اور یونس کے اصحاب]\n\nاور ہمارے زمانے میں آج بھی عیسیٰ علیہ السلام اور یونس علیہ السلام کے اصحاب کی ایک جماعت ہے جو محبت کرتی ہے اور لوگوں سے منقطع ہے۔ جہاں تک یونس کی قوم کے لوگوں کا تعلق ہے، تو میں نے ساحل پر ان میں سے ایک کے قدم کا نشان دیکھا، جس کا صاحب مجھ سے تھوڑا پہلے گزر چکا تھا۔ میں نے زمین میں اس کے قدم کو ناپا تو وہ میرے ہاتھ کے تین بالشت اور آدھا اور ایک چوتھائی بالشت لمبا تھا۔ اور میرے ساتھی ابو عبداللہ بن خرز الطنجی نے مجھے بتایا کہ وہ ایک حکایت میں اس سے ملے تھے اور وہ ان کے پاس ان باتوں کے بارے میں کلام لائے جو اندلس میں پانچ سو پچاسی ہجری (۵۸۵ھ) میں ہونے والی تھیں—جو کہ وہ سال تھا جس میں ہم موجود تھے—اور جو چھیاسی ہجری (۵۸۶ھ) میں فرنگیوں کے ساتھ ہونے والی تھیں۔ پس وہ سب ویسا ہی ہوا جیسا انہوں نے کہا تھا، ایک حرف بھی نہیں بدلا۔\n\n### [زریب بن برثملا، عبد صالح عیسیٰ بن مریم کے وصی]\n\nاور جہاں تک اس زمانے میں عیسیٰ کے اصحاب میں سے ایک کا تعلق ہے، تو وہ وہ ہے جو ہم نے عربشاہ بن محمد بن ابی المعالی العلوی النوقی الخبوشانی سے کتابت کے ذریعے روایت کیا ہے۔ انہوں نے کہا: ہمیں محمد بن الحسن بن سہل العباسی الطوسی نے حدیث بیان کی، انہیں ابو المحاسن علی بن ابی الفضل الفارمدی نے، انہیں احمد بن الحسین بن علی نے، انہوں نے کہا: ہمیں ابو عبداللہ الحافظ نے حدیث بیان کی، ہمیں ابو عمرو عثمان بن احمد بن السماک نے بغداد میں املاء کرایا، ہمیں یحییٰ بن ابی طالب نے، ہمیں عبدالرحمن بن ابراہیم الراسبی نے، ہمیں مالک بن انس نے نافع سے، انہوں نے ابن عمر سے روایت کی کہ عمر بن خطاب رضی اللہ عنہ نے سعد بن ابی وقاص کو خط لکھا، جب وہ قادسیہ میں تھے، کہ نضلة بن معاویہ الانصاری کو حلوان عراق کی طرف بھیجیں تاکہ وہ اس کے نواحی علاقوں پر حملہ کریں۔\n\nسعد نے نضلة کو تین سو سواروں کے ساتھ بھیجا۔ وہ نکلے یہاں تک کہ حلوان عراق پہنچے اور اس کے نواحی علاقوں پر حملہ کیا اور مال غنیمت اور قیدی حاصل کیے۔ وہ مال غنیمت اور قیدیوں کو ہانکتے ہوئے واپس آئے یہاں تک کہ عصر کا وقت قریب آ گیا اور سورج غروب ہونے کے قریب تھا۔ نضلة نے قیدیوں اور مال غنیمت کو پہاڑ کے دامن میں ٹھہرایا، پھر کھڑے ہوئے اور اذان دی، کہا: \"اللہ اکبر، اللہ اکبر\"۔\n\nراوی کہتے ہیں: پہاڑ سے ایک جواب دینے والا جواب دیتا ہے: \"اے نضلة! تو نے بہت بڑی تکبیر کہی\"۔\n\nپھر نضلة نے کہا: \"أشهد أن لا إله إلا الله\" (میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں)۔ تو اس نے کہا: \"اخلاص کا کلمہ ہے، اے نضلة!\"\n\nاور نضلة نے کہا: \"أشهد أن محمدا رسول الله\" (میں گواہی دیتا ہوں کہ محمد اللہ کے رسول ہیں)۔ تو اس نے کہا: \"یہی دین ہے، اور یہی وہ ہے جس کی بشارت ہمیں عیسیٰ بن مریم علیہما السلام نے دی تھی، اور ان کی امت کے سر پر قیامت قائم ہوگی\"۔\n\nپھر نضلة نے کہا: \"حي على الصلاة\" (نماز کی طرف آؤ)۔ تو اس نے کہا: \"خوشخبری ہے اس کے لیے جو اس کی طرف چلا اور اس پر پابندی کی\"۔\n\nپھر نضلة نے کہا: \"حي على الفلاح\" (فلاح کی طرف آؤ)۔ تو اس نے کہا: \"وہ کامیاب ہوا جس نے محمد صلی اللہ علیہ وسلم کی بات مانی، اور یہی ان کی امت کے لیے بقا ہے\"۔\n\nنضلة نے کہا: \"اللہ اکبر، اللہ اکبر\"۔ تو اس نے کہا: \"تو نے بہت بڑی تکبیر کہی\"۔\n\nنضلة نے کہا: \"لا إله إلا الله\" (اللہ کے سوا کوئی معبود نہیں)۔ تو اس نے کہا: \"تو نے اخلاص کو خالص کر دیا، اے نضلة! پس اللہ نے تیرے جسم کو آگ پر حرام کر دیا\"۔\n\nراوی کہتے ہیں: جب وہ اپنی اذان سے فارغ ہوئے، تو ہم کھڑے ہوئے اور کہا: \"اے اللہ تجھ پر رحم کرے، تو کون ہے؟ کیا تو فرشتہ ہے، یا جنوں میں سے کوئی رہنے والا، یا اللہ کے بندوں میں سے؟ تو نے ہمیں اپنی آواز سنائی ہے، پس ہمیں اپنی صورت دکھا، کیونکہ ہم اللہ کے وفد ہیں، اور رسول اللہ صلی اللہ علیہ وسلم کے وفد ہیں، اور عمر بن خطاب کے وفد ہیں\"۔\n\nراوی کہتے ہیں: تو پہاڑ ایک چکی کی طرح کے سر سے پھٹ گیا، جس کا سر اور داڑھی سفید تھی، اور اس پر اون کے دو پرانے کپڑے تھے۔ اس نے کہا: \"السلام علیکم ورحمۃ اللہ وبرکاتہ\"۔ ہم نے کہا: \"وعلیک السلام ورحمۃ اللہ وبرکاتہ، اے اللہ تجھ پر رحم کرے، تو کون ہے؟\"\n\nاس نے کہا: \"میں زریب بن برثملا ہوں، عبد صالح عیسیٰ بن مریم علیہما السلام کا وصی ہوں۔ انہوں نے مجھے اس پہاڑ میں ٹھہرایا اور میرے لیے طول بقا کی دعا کی یہاں تک کہ وہ آسمان سے نازل ہوں گے، پھر وہ خنزیر کو قتل کریں گے اور صلیب کو توڑیں گے اور ان چیزوں سے براءت کا اظہار کریں گے جو نصاریٰ نے ان کی طرف منسوب کی ہیں۔\"\n\nہم نے پوچھا: \"نبی صلی اللہ علیہ وسلم نے کیا کیا؟\" ہم نے کہا: \"آپ کا وصال ہو گیا\"۔ تو وہ بہت دیر تک روتا رہا یہاں تک کہ اس کی داڑھی آنسوؤں سے تر ہو گئی۔\n\nپھر اس نے پوچھا: \"آپ کے بعد کون کھڑا ہوا؟\" ہم نے کہا: \"ابو بکر\"۔ اس نے پوچھا: \"انہوں نے کیا کیا؟\" ہم نے کہا: \"ان کا وصال ہو گیا\"۔ اس نے پوچھا: \"آپ کے بعد کون کھڑا ہوا؟\" ہم نے کہا: \"عمر\"۔\n\nاس نے کہا: \"اگر مجھ سے محمد صلی اللہ علیہ وسلم کی ملاقات فوت ہو گئی، تو عمر کو میری طرف سے سلام کہنا اور کہنا: اے عمر! سیدھے رہو اور قریب رہو، کیونکہ معاملہ قریب آ چکا ہے۔ اور انہیں ان خصلتوں کے بارے میں بتاؤ جو میں تمہیں بتا رہا ہوں: اے عمر! جب محمد صلی اللہ علیہ وسلم کی امت میں یہ خصلتیں ظاہر ہوں، تو بھاگو، بھاگو! جب مرد مردوں سے اور عورتیں عورتوں سے بے نیاز ہو جائیں، اور وہ اپنے غیر نسب کی طرف نسبت کریں، اور اپنے غیر موالی کی طرف منسوب ہوں، اور ان کا بڑا ان کے چھوٹے پر رحم نہ کرے، اور ان کا چھوٹا ان کے بڑے کی تعظیم نہ کرے، اور امر بالمعروف (الأمر بالمعروف) کو چھوڑ دیا جائے اور اس کا حکم نہ دیا جائے، اور نہی عن المنکر (النهي عن المنكر) کو چھوڑ دیا جائے اور اس سے منع نہ کیا جائے، اور ان کا عالم علم اس لیے سیکھے تاکہ اس سے دینار اور درہم حاصل کرے، اور بارش گرمی میں ہو، اور اولاد غصے کا سبب ہو، اور وہ منبروں کو لمبا کریں، اور مصاحف کو چاندی سے مزین کریں، اور مسجدوں کو نقش و نگار سے آراستہ کریں، اور رشوت کو ظاہر کریں، اور عمارتوں کو مضبوط بنائیں، اور خواہشات کی پیروی کریں، اور دین کو دنیا کے بدلے بیچ دیں، اور خون کو ہلکا سمجھیں، اور رشتے ٹوٹ جائیں، اور حکم بیچا جائے، اور سود کھایا جائے، اور تسلط فخر بن جائے، اور مالداری عزت بن جائے، اور آدمی اپنے گھر سے نکلے تو اس سے بہتر شخص اس کے لیے کھڑا ہو جائے، اور عورتیں زینوں پر سوار ہوں۔\"\n\nراوی کہتے ہیں: پھر وہ ہم سے غائب ہو گیا۔ نضلة نے یہ بات سعد کو لکھی، اور سعد نے عمر کو لکھی۔ عمر نے لکھا: \"تم اور تمہارے ساتھ مہاجرین و انصار میں سے جو ہیں، آؤ یہاں تک کہ اس پہاڑ پر اترو۔ جب تم اس سے ملو تو اسے میری طرف سے سلام کہنا۔\"\n\nکیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا: \"عیسیٰ بن مریم علیہ السلام کے بعض وصی عراق کے اس علاقے میں اس پہاڑ پر اترے ہوئے ہیں۔\"\n\nپس سعد چار ہزار مہاجرین و انصار کے ساتھ اترے یہاں تک کہ چالیس دن تک پہاڑ پر قیام کیا، ہر نماز کے وقت اذان دیتے رہے، مگر انہیں وہ نہ ملا۔\n\nالراسبي نے اپنے قول میں مالک بن انس سے روایت کرنے میں متابعت نہیں کی، اور اس حدیث میں معروف مالک بن الازہر عن نافع ہے، اور ابن الازہر مجہول ہے۔ ابو عبداللہ الحاکم نے کہا: ابن الازہر کا ذکر اس حدیث کے علاوہ کہیں نہیں سنا گیا۔ اور نبی صلی اللہ علیہ وسلم اور ابو بکر کے بارے میں سوال ابن لہیعہ کی حدیث سے ہے جو ابن الازہر سے مروی ہے۔\n\nہم کہتے ہیں: اگرچہ اس حدیث کے طریق میں کلام کیا گیا ہے، لیکن یہ ہمارے جیسے لوگوں کے نزدیک کشف (الکشف) کے ذریعے صحیح ہے۔ اور اس کا قول مسجدوں کو مزین کرنے اور مصاحف کو چاندی سے مزین کرنے کے بارے میں مذمت کے طریق پر نہیں ہے، بلکہ یہ قیامت کے قریب آنے اور زمانے کے فساد کی علامتیں ہیں، جیسے عیسیٰ علیہ السلام کا نزول، مہدی کا خروج، اور سورج کا مغرب سے طلوع ہونا۔ یہ سب معلوم ہے کہ یہ مذمت کے طریق پر نہیں ہیں، بلکہ کسی چیز کی علامتیں کبھی مذموم اور کبھی محمود ہو سکتی ہیں۔\n\n### [شریعت محمدیہ کے زمانے میں سابقہ انبیاء کے وصی]\n\nیہ عیسوی وصی ابن برثملا اس پہاڑ میں عبادت کرتے رہے، کسی سے میل جول نہیں رکھا، حالانکہ رسول اللہ صلی اللہ علیہ وسلم مبعوث ہو چکے تھے۔ کیا آپ سمجھتے ہیں کہ وہ راہب نصاریٰ کے احکام پر باقی رہا؟ نہیں، اللہ کی قسم! کیونکہ شریعت محمدیہ ناسخ ہے۔ آپ صلی اللہ علیہ وسلم فرماتے ہیں: \"اگر موسیٰ زندہ ہوتے تو ان کے لیے بھی میری پیروی کے سوا کوئی چارہ نہ ہوتا۔\" اور یہ عیسیٰ ہیں، جب وہ نازل ہوں گے تو وہ ہماری ہی امامت کریں گے، یعنی ہماری سنت کے مطابق، اور ہم میں ہمارے ہی شرع کے مطابق حکم کریں گے۔\n\nپس یہ راہب ان لوگوں میں سے ہے جو \"اپنے رب کی طرف سے واضح دلیل پر\" (عَلى‏ بَيِّنَةٍ من رَبِّهِ) ہیں۔ [سورۃ ہود: ۱۷] ان کے رب نے انہیں اپنے پاس سے وہ علم سکھایا جو ہمارے نبی محمد صلی اللہ علیہ وسلم کی شریعت میں ان پر فرض کیا گیا تھا، اس طریق پر جس کے وہ اللہ سے عادی تھے۔ اور یہ ہمارے نزدیک ایک محقق ذوق (الذوق) ہے۔ کیونکہ ہم نے محمد صلی اللہ علیہ وسلم کے بہت سے احکام جو علماء رسوم کے ہاں آپ کی شریعت میں مقرر ہیں، اور جن کا علم ہمارے پاس نہیں تھا، اسی طریق سے حاصل کیے اور انہیں علماء رسوم کے ہاں ویسا ہی پایا جیسا کہ ہمارے پاس ہے۔ اور اسی طریق سے ہم احادیث نبویہ کی تصحیح کرتے ہیں اور انہیں رد بھی کرتے ہیں اگر ہمیں معلوم ہو جائے کہ وہ کمزور طریق والی ہیں اور رسول اللہ صلی اللہ علیہ وسلم سے صحیح نہیں ہیں، اگرچہ شارع نے مجتہد کے حکم کو برقرار رکھا ہے اگرچہ اس نے غلطی کی ہو، لیکن اس طریق کے لوگ صرف اسی کو لیتے ہیں جس کا حکم رسول اللہ صلی اللہ علیہ وسلم نے دیا ہو۔\n\nاور یہ وصی افراد میں سے ہیں، اور علوم کے حصول میں ان کا طریق خضر، موسیٰ کے ساتھی، کا طریق ہے۔ پس وہ ہماری شریعت پر ہیں، اگرچہ علم صحیح تک پہنچنے کا طریق مختلف ہو، کیونکہ یہ علم میں کوئی نقص پیدا نہیں کرتا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے اس شخص کے بارے میں فرمایا جسے بغیر سوال کے ولایت عطا کی گئی ہو: \"اللہ اس پر اس کی مدد کرتا ہے، اور اللہ اس کی طرف ایک فرشتہ بھیجتا ہے جو اسے درست رکھتا ہے\"۔\n\nاس سے مراد یہ ہے کہ وہ اپنے فیصلوں میں غلطی سے محفوظ رہتا ہے۔ خضر نے کہا: \"اور میں نے یہ اپنے حکم سے نہیں کیا\" (وَما فَعَلْتُهُ عَنْ أَمْرِي) [سورۃ الکہف: ۸۲]۔ اور آپ علیہ السلام نے فرمایا: \"اگر میری امت میں محدثون ہیں تو ان میں سے عمر ہیں\"۔\n\nہمارے نزدیک یہ ثابت ہے کہ نبی صلی اللہ علیہ وسلم نے ان راہبوں کو قتل کرنے سے منع فرمایا جو مخلوق سے کنارہ کش ہو گئے اور اپنے رب کے لیے تنہا ہو گئے، آپ نے فرمایا: \"انہیں چھوڑ دو اور جس چیز کے لیے وہ منقطع ہوئے ہیں اسے بھی چھوڑ دو\" (ذروهم وما انقطعوا إليه)۔\n\nپس آپ نے ایک مجمل لفظ استعمال کیا اور ہمیں یہ حکم نہیں دیا کہ ہم انہیں دعوت دیں، کیونکہ آپ صلی اللہ علیہ وسلم کو معلوم تھا کہ وہ اپنے رب کی طرف سے واضح دلیل پر ہیں، حالانکہ آپ صلی اللہ علیہ وسلم نے تبلیغ کا حکم دیا اور ہمیں حکم دیا کہ حاضر غائب کو پہنچا دے۔ اگر رسول اللہ صلی اللہ علیہ وسلم کو یہ معلوم نہ ہوتا کہ اللہ ان کی تعلیم کا ذمہ لیتا ہے، جیسا کہ اس نے خضر اور دیگر کی تعلیم کا ذمہ لیا، تو آپ کا یہ کلام نہ ہوتا اور نہ ہی آپ اس ملت میں منسوخ شریعت پر انہیں برقرار رکھتے، حالانکہ آپ صلی اللہ علیہ وسلم اپنے دعوے میں سچے ہیں کہ آپ تمام لوگوں کے لیے مبعوث کیے گئے، جیسا کہ اللہ تعالیٰ نے آپ کے بارے میں ذکر فرمایا۔ پس آپ کی رسالت تمام مخلوق کو شامل ہے۔\n\nاور اس تعریف کی روح یہ ہے کہ جو بھی آپ کا زمانہ پائے اور آپ کی دعوت اس تک پہنچے، اللہ اسے صرف آپ کی شریعت کے مطابق ہی عبادت کا حکم دیتا ہے۔ کیونکہ ہم یقینی طور پر جانتے ہیں کہ آپ صلی اللہ علیہ وسلم نے اپنے زمانے میں تمام لوگوں کو براہ راست خطاب نہیں فرمایا، پس یہ وہی صورت ہے جو ہم نے ذکر کی۔\n\nاور یہ راہب ان عیسویون میں سے ہے جنہوں نے عیسیٰ علیہ السلام کی وراثت پائی یہاں تک کہ محمد صلی اللہ علیہ وسلم کی بعثت کا زمانہ آیا۔ پس جب محمد صلی اللہ علیہ وسلم مبعوث ہوئے، تو اللہ نے اس راہب کو آپ صلی اللہ علیہ وسلم کی شریعت کے مطابق عبادت کا حکم دیا، اور اسے اپنی طرف سے علم لدنی (علم لدنی) سکھایا، اس رحمت کے ذریعے جو اس نے اسے اپنے پاس سے عطا کی تھی۔ وہ محمد صلی اللہ علیہ وسلم سے عیسوی حالت کی وراثت بھی پایا۔ پس وہ دونوں شریعتوں میں عیسوی رہا۔ کیا آپ نہیں دیکھتے کہ اس راہب نے عیسیٰ علیہ السلام کے نزول کی خبر دی اور خبر دی کہ جب وہ نازل ہوں گے تو خنزیر کو قتل کریں گے اور صلیب کو توڑیں گے؟ کیا آپ سمجھتے ہیں کہ وہ خنزیر کا گوشت حلال سمجھنے پر باقی رہا؟ پس یہ راہب دونوں شریعتوں میں عیسوی رہا، لہذا اسے دوہرا اجر ملے گا: اپنے نبی کی پیروی کا اجر اور محمد صلی اللہ علیہ وسلم کی پیروی کا اجر۔ اور وہ عیسیٰ کے نزول کا انتظار کر رہا ہے۔\n\nاور ان صحابہ نے اسے نضلة کے ساتھ دیکھا، اور انہوں نے اس سے اسلام اور ایمان کی حالت کے بارے میں یا وہ کن شرائع کے مطابق عبادت کرتا ہے، اس بارے میں سوال نہیں کیا، کیونکہ نبی صلی اللہ علیہ وسلم نے انہیں ایسے شخص سے سوال کرنے کا حکم نہیں دیا تھا۔ پس ہم یقینی طور پر جانتے ہیں کہ نبی صلی اللہ علیہ وسلم کسی کو شرک پر برقرار نہیں رکھتے، اور یہ بھی جانتے ہیں کہ اللہ کے کچھ بندے ایسے ہیں جن کی تعلیم کا ذمہ ذات حق (الحق) اپنی طرف سے لیتا ہے، انہیں وہ علم سکھاتا ہے جو اس نے محمد صلی اللہ علیہ وسلم پر نازل کیا، اپنی رحمت اور فضل سے۔ اور اللہ کا فضل بہت بڑا ہے۔\n\nاور اگر وہ ان لوگوں میں سے ہوتا جو جزیہ ادا کرتے ہیں، تو ہم کہتے کہ شریعت محمدیہ نے اس کے دین کو برقرار رکھا ہے جب تک وہ جزیہ دیتا ہے، اگر وہ اہل کتاب میں سے ہو۔ اور یہ آپ کی رسالت کی عمومیت میں ایک دقیق مسئلہ ہے، اور یہ کہ آپ کے ظہور کے بعد کوئی شریعت باقی نہیں رہی سوائے اس کے جو آپ نے مقرر کی، اور جو کچھ آپ نے مقرر کیا ان میں سے ایک یہ بھی ہے کہ انہیں ان کی شریعت پر برقرار رکھا جائے جب تک وہ جزیہ دیتے ہیں، اگر وہ اہل کتاب میں سے ہوں۔ اور اللہ تعالیٰ کے ایسے بندے زمین میں کتنے ہی ہیں۔\n\n### [عیسویون کے اصول اور ان کی روحانیت]\n\nپس عیسویون کا اصل، جیسا کہ ہم نے مقرر کیا، عیسوی امت میں ظاہر ہونے والی ظاہری صورتوں سے توحید التجرید (تجرید کی توحید) ہے۔ اور ان کے لیے گرجوں میں جو مثالیں ہیں، وہ اس لیے ہیں کہ وہ شریعت محمدیہ پر ہیں۔ لیکن وہ روحانی حالت (الروحانية الحالية) جس پر وہ قائم ہیں، وہ نصاریٰ میں عیسویہ اور یہودیوں میں موسویہ ہے، جو مشکوٰۃ محمد صلی اللہ علیہ وسلم سے ہے، آپ کے اس قول سے:\n\n\"اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو\" (اعبد الله كأنك تراه)۔ اور \"اللہ نمازی کے قبلہ میں ہے\" اور \"جب بندہ نماز پڑھتا ہے تو اپنے رب کا استقبال کرتا ہے\"۔\n\nاور ہر وہ چیز جو اللہ کے بارے میں اس طرح کی نسبتوں میں وارد ہوئی ہے۔ اور اس امت کے عیسوی کے لیے کرامات (الکرامات) میں ہوا میں چلنا نہیں ہے، لیکن ان کے لیے پانی پر چلنا ہے۔ اور محمدی ہوا میں چلتا ہے، تبعیت (التبعية) کے حکم سے۔ کیونکہ نبی صلی اللہ علیہ وسلم جب معراج کی رات گئے تو آپ کو سواری پر اٹھایا گیا تھا۔\n\nآپ نے عیسیٰ علیہ السلام کے بارے میں فرمایا: \"اگر وہ یقین میں اور بڑھ جاتے تو ہوا میں چلتے\"۔\n\nاور اس میں کوئی شک نہیں کہ عیسیٰ علیہ السلام یقین میں ہم سے بہت زیادہ قوی ہیں، جس کا کوئی مقابلہ نہیں، کیونکہ وہ اولو العزم رسولوں میں سے ہیں۔ اور ہم بلا شک ہوا میں چلتے ہیں۔ اور ہم نے بہت سی مخلوق کو دیکھا ہے جو ہوا میں چلتے ہیں۔ پس ہم یقینی طور پر جانتے ہیں کہ ہمارا ہوا میں چلنا صرف سچی تبعیت کے حکم سے ہے، نہ کہ عیسیٰ علیہ السلام کے یقین پر یقین کی زیادتی سے۔ ہم میں سے ہر ایک نے اپنا مشرب جان لیا ہے۔ پس ہم محمد صلی اللہ علیہ وسلم کی تبعیت کے حکم سے چلتے ہیں، اس خاص پہلو سے جس کے لیے یہ مقام ہے، نہ کہ یقین کی قوت سے، جیسا کہ ہم نے کہا، جس کی وجہ سے ہم عیسیٰ علیہ السلام کو فضیلت دیتے—اللہ کی پناہ کہ ہم ایسا کہیں۔\n\nجیسا کہ عیسیٰ کی امت پانی پر چلتی ہے، تبعیت کے حکم سے، نہ کہ ان کے یقین کی عیسیٰ علیہ السلام کے یقین کے برابر ہونے سے۔ پس ہم رسولوں کے ساتھ ان خرق عادات (خرق العوائد) میں ہیں جو اللہ کی طرف سے ان کے لیے خاص تھیں اور ان کی مثالیں ہم پر تبعیت کے حکم سے ظاہر ہوئیں، جیسا کہ ہم نے اپنی کتاب \"الیقین\" میں مثال دی ہے کہ خاص غلام (مماليك الخواص) جو اپنے آقا امیروں کے جوتے اٹھاتے ہیں جب وہ سلطان کے پاس داخل ہوتے ہیں، جبکہ بعض امیر دروازے کے باہر رہ جاتے ہیں کیونکہ انہیں داخلے کی اجازت نہیں ملی۔ کیا آپ سمجھتے ہیں کہ وہ غلام جو اپنے آقاؤں کے ساتھ داخل ہوئے، وہ ان امیروں سے زیادہ بلند مرتبہ ہیں جنہیں اجازت نہیں ملی؟ کیا وہ صرف اپنے آقاؤں کی تبعیت کے حکم سے داخل نہیں ہوئے؟ بلکہ ہر شخص اپنے مرتبے پر ہے۔ پس امیر امیروں پر ممتاز ہیں، اور غلام اپنی جنس میں غلاموں پر ممتاز ہیں۔ اسی طرح ہم انبیاء کے ساتھ ہیں ان خرق عادات میں جو پیروکاروں کو حاصل ہوتی ہیں۔\n\nپھر نبی صلی اللہ علیہ وسلم ہوا میں نہیں چلے مگر اٹھائے ہوئے، براق پر سوار کی طرح، اور رفرف پر پالکی میں اٹھائے ہوئے کی طرح۔ پس براق اور رفرف نے اس مقام کی صورت ظاہر کی جس پر آپ خود تھے کہ آپ خود اٹھائے ہوئے ہیں، اور یہ ایک الٰہی نسبت بھی ہے، اللہ تعالیٰ کے اس قول سے: \"رحمن عرش پر مستوی ہوا\" (الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏) [سورۃ طہ: ۵] اور اس کے قول سے: \"اور تیرے رب کا عرش اٹھاتے ہیں\" (وَيَحْمِلُ عَرْشَ رَبِّكَ) [سورۃ الحاقہ: ۱۷]۔ پس عرش اٹھایا ہوا ہے۔ تو یہ اٹھانے والوں کے ذریعے کرامت کا اٹھانا ہے، اور اٹھائے جانے والوں کے لیے راحت، مجد اور عزت کی حالت ہے۔ اور ہم نے آپ کے لیے کئی جگہوں پر مقرر کیا ہے کہ اس مقام اور اس جیسی جگہوں پر اٹھایا ہوا شخص غیر اٹھائے ہوئے سے اعلیٰ ہوتا ہے۔ اور \"لا حول ولا قوة إلا بالله\" (کوئی طاقت اور قوت نہیں مگر اللہ کے ساتھ) ان لوگوں کے لیے خاص ہے جو اٹھانے والے ہیں۔ اگرچہ تمام مخلوق اٹھائی ہوئی ہے، لیکن یہ اٹھانا ہر ایک پر ظاہر نہیں کیا گیا۔ اگرچہ اٹھانا مراتب پر ہے: عاجزی کی وجہ سے اٹھانا، اور حقیقت کی وجہ سے اٹھانا، جیسے بوجھ اٹھانا، اور شرف و مجد کی وجہ سے اٹھانا۔ پس اس گروہ پر عنایت یہ ہے کہ وہ ظاہراً اٹھائے ہوئے ہوں، جیسا کہ معاملہ باطناً خود ہے، تاکہ وہ دعوے سے بری ہوں، جیسا کہ ہم نے اس کے باب میں مقرر کیا ہے۔\n\n### [عیسویون کی علامتیں]\n\nاور عیسویون کے لیے ایک فعال ہمت (همة فعالة)، مقبول دعا، اور سنی جانے والی بات ہوتی ہے۔ اور اگر آپ عیسویون کو پہچاننا چاہیں تو ان کی علامتوں میں سے یہ ہے کہ آپ ہر اس شخص کو دیکھیں جس میں عالم پر رحمت (رحمة) اور شفقت (شفقة) ہو، خواہ وہ کوئی بھی ہو، اور کسی بھی دین پر ہو، اور کسی بھی مذہب پر ظاہر ہو، اور ان کے بارے میں اللہ پر تسلیم ہو، وہ اللہ کے بندوں سے خطاب کرتے وقت ایسی بات نہیں کرتے جس سے سینے تنگ ہوں۔ اور ان کی علامتوں میں سے یہ ہے کہ وہ ہر چیز میں سے بہترین کو دیکھتے ہیں، اور ان کی زبانوں پر صرف خیر جاری ہوتا ہے۔ اور اس میں پہلی اور دوسری دونوں طبقات شریک ہیں۔\n\nپہلی طبقت کی مثال وہ ہے جو عیسیٰ علیہ السلام سے روایت ہے کہ انہوں نے ایک خنزیر کو دیکھا تو اس سے کہا: \"سلامتی کے ساتھ گزر جاؤ\" (أنج بسلام)۔ جب ان سے اس بارے میں پوچھا گیا تو انہوں نے کہا: \"میں نے اپنی زبان کو اچھی بات کہنے کا عادی بنایا ہے\" (أعود لساني قول الخير)۔\n\nاور دوسری طبقت کی مثال یہ ہے کہ نبی صلی اللہ علیہ وسلم نے ایک مردار (میتة) کے پاس سے گزرتے ہوئے فرمایا: \"اس کے دانت کتنے سفید ہیں\" (ما أحسن بياض أسنانها)۔ جبکہ جو آپ کے ساتھ تھے انہوں نے کہا: \"اس کی بو کتنی بدبودار ہے\" (ما أنتن ريحها)۔\n\nاور اگرچہ نبی صلی اللہ علیہ وسلم نے خاص طور پر سانپوں کو مارنے کا حکم دیا اور خبر دی کہ اللہ بہادری کو پسند کرتا ہے، اگرچہ وہ سانپ کو مارنے میں ہو، اس کے باوجود آپ صلی اللہ علیہ وسلم منیٰ میں غار میں تھے اور آپ پر سورۃ المرسلات نازل ہو رہی تھی—اور المرسلات کے ذریعے وہ غار اب تک پہچانا جاتا ہے، میں نے برکت حاصل کرنے کے لیے اس میں داخلہ لیا—تو ایک سانپ نکلا اور صحابہ اسے مارنے کے لیے لپکے، مگر وہ ان کی پہنچ سے باہر ہو گیا۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اللہ نے اسے تمہارے شر سے بچایا، جیسا کہ اس نے تمہیں اس کے شر سے بچایا\"۔\n\nآپ نے اسے شر کہا، حالانکہ اس کے قتل کا حکم دیا گیا تھا۔ جیسے اللہ تعالیٰ کا قصاص کے بارے میں قول: \"اور برائی کا بدلہ اسی جیسی برائی ہے\" (وَجَزاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُها) [سورۃ الشوریٰ: ۴۰]۔ پس اس نے قصاص کو برائی کہا اور معاف کرنے کی ترغیب دی۔\n\nپس آپ صلی اللہ علیہ وسلم کی نظر مردار میں صرف بہترین چیز پر پڑی۔ اسی طرح اللہ کے اولیاء ہر دیکھی جانے والی چیز میں صرف بہترین کو دیکھتے ہیں، اور وہ مخلوق کی برائیوں سے اندھے ہوتے ہیں، نہ کہ برائیوں سے، کیونکہ انہیں ان سے بچنے کا حکم دیا گیا ہے۔ جیسا کہ وہ فحش سننے سے بہرے ہوتے ہیں، جیسا کہ وہ بری بات زبان سے نکالنے سے گونگے ہوتے ہیں، اگرچہ بعض مواقع پر وہ مباح ہو۔ ہم نے انہیں اسی طرح پہچانا ہے۔ پس پاک ہے وہ ذات جس نے انہیں چن لیا اور انہیں ہدایت دی \"سیدھے راستے کی طرف\" (إِلى‏ صِراطٍ مُسْتَقِيمٍ)۔ \"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کریں\" (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ) [سورۃ الانعام: ۹۰]۔\n\nپس یہ عیسیٰ علیہ السلام کا مقام محمد صلی اللہ علیہ وسلم میں ہے، کیونکہ وہ زمانے میں آپ سے پہلے تھے اور یہ احوال ان سے منتقل ہوئے ہیں۔ اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم سے فرمایا جب قرآن میں انبیاء کا ذکر کیا گیا اور عیسیٰ بھی ان مذکورین میں شامل تھے: \"یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کریں\" (أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ)۔\n\nاگرچہ رسالت کا مقام اچھے اور برے کو واضح کرنے کا تقاضا کرتا ہے تاکہ لوگ جان لیں، جیسا کہ اللہ تعالیٰ نے فرمایا: \"تاکہ آپ لوگوں کے لیے وہ چیز واضح کر دیں جو ان پر نازل کی گئی ہے\" (لِتُبَيِّنَ لِلنَّاسِ ما نُزِّلَ إِلَيْهِمْ) [سورۃ النحل: ۴۴]۔ پس اگر کسی شخص کے حق میں برائی کو واضح کیا گیا تو وہ اللہ کی وحی سے تھا، جیسا کہ ایک شخص کے بارے میں فرمایا: \"وہ برا ہے، قبیلہ کہاں ہے؟\" اور خضر نے لڑکے کو قتل کیا اور اس کے بارے میں کہا کہ اس کی فطرت کافرانہ تھی، یا خبر دی کہ اگر اسے چھوڑ دیا جاتا تو وہ اپنے والدین کے حق میں کیا برائی کرتا۔ اور کہا: \"میں نے یہ اپنے حکم سے نہیں کیا\" (ما فعلت ذلك عن أمري)۔\n\nپس مردوں کے لیے ان کی ذات سے اچھی بات کہنا، اچھے کو دیکھنا، اور اچھے کو کان لگا کر سننا ہے۔ پس اگر ان سے کسی وقت اس کے خلاف کوئی چیز ظاہر ہو، خواہ وہ نبی ہو یا ولی، تو وہ اللہ کے حکم سے ہوتی ہے، وہ ان کی زبان نہیں ہوتی۔ پس یہ وہ کچھ ہے جو اللہ نے میری زبان پر جاری کیا، عیسویون کے احوال میں سے۔ اور \"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) [سورۃ الاحزاب: ۴]۔",
    "fa": "(باب سی و ششم در شناخت عیسویان، اقطاب و اصول آن‌ها)\n\nهر آن کس که حقیقت (حقيقة) خویش را زنده کرد *** و از بیماری حجاب‌ها شفا یافت\nاو عیسی است و نزد ما *** هیچ شکی به او راه ندارد\nزیرا سرشت او مرتبه‌ای بخشیده است *** که بر مراتب دیگر برتری دارد\nاو را با صفات قدس می‌شناسی *** در وحی صریح و کتاب‌ها\nاین صفت را جز وارث او *** در دوران‌های گذشته به دست نیاورد\nپس همت او در هستی (الکون) جاری شد *** در عجم‌ها و در عرب‌ها\nبه واسطه آن، جان‌هایشان زنده می‌شود *** و به واسطه آن، سختی‌ها برطرف می‌گردد.\n\n### [شریعت محمدی و جهان‌شمولی وارثان آن]\n\nبدان، خداوند تو را یاری کند، از آنجا که شریعت محمد صلی الله علیه و سلم دربرگیرنده تمامی شرایع پیشین است و هیچ حکمی از آن‌ها در این دنیا باقی نمانده مگر آنچه شریعت محمدی آن را تأیید کرده است؛ پس به واسطه تأیید آن، احکام ثابت شده‌اند و ما به آن‌ها متعبد می‌شویم از این جهت که محمد صلی الله علیه و سلم آن‌ها را تأیید کرده است، نه از این جهت که پیامبر مخصوص آن در زمان خود آن را تأیید کرده است. به همین دلیل، به رسول خدا صلی الله علیه و سلم جوامع الکلم (جوامع الکلم) عطا شد. هنگامی که فرد محمدی و تمامی مکلفان امروز از جن و انس عمل می‌کنند – و امروز در جهان هیچ شریعت الهی جز این شریعت محمدی نیست – این عامل از این امت خالی از این نیست که در عمل خود، در آنچه برایش در قلب و طریقش گشوده می‌شود و به آن متحقق می‌گردد، با طریقی از طرق پیامبران پیشین مواجه شود که این شریعت آن را دربرگرفته و طریق او را تأیید کرده و نتیجه‌اش همراه آن بوده است. پس اگر در آن برایش گشایشی حاصل شود، به صاحب آن شریعت منتسب می‌شود و به او عیسوی یا موسوی یا ابراهیمی گفته می‌شود. این انتساب به خاطر تحقق آن معارف (المعارف) است که برای او متمایز شده و مقامی که برایش آشکار گشته، از جمله آنچه تحت احاطه شریعت محمد صلی الله علیه و سلم است. پس به واسطه آن نسبت یا آن نسب از دیگران متمایز می‌شود تا شناخته شود که او از محمد صلی الله علیه و سلم چیزی را به ارث برده است که اگر موسی یا هر پیامبر دیگری زنده بود و از او پیروی می‌کرد، جز آن را به ارث نمی‌برد. و چون شرایع آن‌ها قبل از این شریعت پیشی گرفته‌اند، ما این عارف را وارث قرار دادیم، زیرا ارث برای متأخر از متقدم است. اگر برای آن متقدم شریعتی مقرر قبل از تأیید محمد صلی الله علیه و سلم نبود، ما پیامبران و رسولان را برابر می‌دانستیم، زیرا زمان شریعت محمد صلی الله علیه و سلم ما را جمع کرده است، همان‌طور که امروز الیاس و خضر و عیسی هنگامی که نازل می‌شود، با ما برابرند، زیرا زمان بر او حکم می‌کند، چرا که پس از محمد صلی الله علیه و سلم نبوت تشریعی وجود ندارد.\n\n### [وارث محمدی]\n\nو به هیچ یک از اهل این طریقت، محمدی گفته نمی‌شود مگر به دو شخص: یا شخصی که به میراث علم حکمی اختصاص یافته که در شریعت پیش از او نبوده است، پس به او محمدی گفته می‌شود؛ و یا شخصی که مقامات را جمع کرده و سپس از آن‌ها به سوی لا مقام (لا مقام) خارج شده است، مانند ابویزید و امثال او. به این شخص نیز محمدی گفته می‌شود. و غیر از این دو شخص، به پیامبری از پیامبران منتسب می‌شود. به همین دلیل است که:\n> ورد في الخبر أن العلماء ورثة الأنبياء\n> *Translation:* در خبر آمده است که: «علما وارثان پیامبران هستند.»\nو نگفت: «وارثان پیامبر خاصی». و مخاطب این سخن، علمای این امت هستند. همچنین با همین لفظ آمده است که پیامبر صلی الله علیه و سلم فرمود:\n> علماء هذه الأمة أنبياء سائر الأمم وفي رواية كأنبياء بنى إسرائيل‏\n> *Translation:* «علمای این امت، پیامبران سایر امت‌ها هستند.» و در روایتی دیگر: «مانند پیامبران بنی اسرائیل.»\n\n### [عیسویان اولیه و ثانویه]\n\nعیسویان اولیه همان حواریون، پیروان عیسی، هستند. پس هر کس از آن‌ها که تا کنون شریعت محمد صلی الله علیه و سلم را درک کرده و به آن ایمان آورده و از آن پیروی کرده و اتفاقاً از این شریعت چیزی را به دست آورده باشد که پیش از این شریعت عیسی علیه السلام بوده است، از عیسی علیه السلام آنچه را که او به ارث برده، بدون حجاب به ارث می‌برد. سپس در شریعت محمد صلی الله علیه و سلم از عیسی علیه السلام میراثی را به ارث می‌برد که میراث تابع از تابع است، نه از متبوع. و بین این دو در ذوق (الذوق) تفاوت‌هایی وجود دارد. به همین دلیل رسول خدا صلی الله علیه و سلم درباره چنین شخصی فرمود که او دو بار پاداش دارد. همچنین او دو میراث، دو گشایش و دو ذوق متفاوت دارد، اما در هر دو مورد فقط به آن پیامبر علیه السلام منتسب می‌شود. این‌ها همان عیسویان ثانویه هستند. و اصول آن‌ها توحید (التوحید) تجرید از طریق مثال است، زیرا وجود عیسی علیه السلام از طریق آمیزش بشری نبود، بلکه از طریق تمثل روح در صورت بشر بود. به همین دلیل، در امت عیسی بن مریم، برخلاف سایر امت‌ها، غلبه با قول به صورت است؛ پس در کلیساهای خود تصاویری می‌کشند و در درون خود با توجه به آن‌ها عبادت می‌کنند، زیرا اصل نبوتشان علیه السلام از تمثل بود و آن حقیقت تا کنون در امت او جاری شده است. هنگامی که شریعت محمد صلی الله علیه و سلم آمد و از تصاویر نهی کرد، در حالی که او صلی الله علیه و سلم حقیقت عیسی (الحقیقة العیسویة) را در خود داشت و شریعت او در شریعت وی درهم پیچیده بود، برای ما تشریع کرد که خدا را چنان عبادت کنیم که گویی او را می‌بینیم. پس این را برای ما در خیال (الخیال) وارد کرد، و این همان معنای تصویر است، جز اینکه در حس از آن نهی کرد که در این امت به صورت حسی ظاهر شود.\n\n### [عبادت خدا بر اساس رؤیت]\n\nسپس این حکم خاص که «خدا را چنان عبادت کن که گویی او را می‌بینی»، محمد صلی الله علیه و سلم بدون واسطه به ما نگفت، بلکه به جبرئیل علیه السلام گفت، و او همان کسی است که برای مریم به صورت بَشَراً سَوِيًّا (بَشَراً سَوِيًّا) [انسانی کامل] متمثل شد هنگام ایجاد عیسی علیه السلام. پس همان‌طور که در مثل مشهور گفته شده است: «ایاک أعنی فاسمعی یا جارة» [منظورم تو هستی، پس ای همسایه بشنو]. ما بودیم که مقصود آن سخن بودیم. به همین دلیل:\n> جاء في آخر الحديث هذا جبريل أراد أن تعلموا إذا لم تسألوا\n> *Translation:* در پایان حدیث آمده است: «این جبرئیل بود که خواست به شما بیاموزد، هنگامی که سؤال نکردید.»\nو در روایتی دیگر: «آمد تا دینشان را به مردم بیاموزد.» و در روایتی دیگر: «آمد تا دینتان را به شما بیاموزد.»\nپس روایات از این که ما مقصود تعلیم بوده‌ایم، خارج نشده‌اند. سپس بدان که آنچه برای ما از غیر شریعت عیسی علیه السلام است، این سخن است:\n> قوله فإن لم تكن تراه فإنه يراك‏\n> *Translation:* «پس اگر تو او را نمی‌بینی، او تو را می‌بیند.»\nاین از اصول آن‌هاست. شیخ ما ابوالعباس العربی رحمه الله در نهایت خود عیسوی بود، و آن نهایت، آغاز ما بود؛ یعنی نهایت شیخ ما در این طریق، عیسوی بود. سپس ما را به فتح موسوی شمسی منتقل کرد، و پس از آن به هود علیه السلام، و پس از آن به تمامی پیامبران علیهم السلام، و سپس به محمد صلی الله علیه و سلم. امر ما در این طریق چنین بود. خداوند آن را بر ما ثابت بدارد و ما را از راه راست منحرف نسازد. پس خداوند به خاطر این نشأتی که ما را در این طریق بر آن نشأت داد، وجه حق (الحق) را در هر چیزی به ما عطا کرد. پس در جهان، در نظر ما، هیچ موجودی نیست مگر اینکه در آن شهود (الشهود) عین حق را داریم که آن را از آن جهت تعظیم می‌کنیم. پس هیچ چیز از عالم وجودی را دور نمی‌اندازیم.\n\n### [یاران عیسی و یونس در زمان ابن عربی]\n\nو در زمان ما امروز جماعتی از یاران عیسی علیه السلام و یونس علیه السلام هستند که دوست می‌دارند و از مردم کناره گرفته‌اند. اما قومی که از قوم یونس هستند، من اثر قدم یکی از آن‌ها را در ساحل دیدم که صاحبش اندکی پیش از من رفته بود. قدم او را در زمین اندازه گرفتم و طول قدمش را سه وجب و نیم و یک چهارم وجب خود یافتم. و رفیقم ابوعبدالله بن خرز طنجی به من خبر داد که در حکایتی با او ملاقات کرده است و سخنانی از جانب او برایم آورد که مربوط به وقایع اندلس در سال پانصد و هشتاد و پنج هجری بود، که ما در آن سال بودیم، و وقایعی که در سال هشتاد و شش با فرنگیان (الإفرنج) رخ می‌داد. و همان‌طور که گفت، حتی یک حرف هم تغییر نکرد.\n\n### [زریب بن برثملا، وصی بنده صالح عیسی بن مریم]\n\nو اما کسی که در این زمان از یاران عیسی است، همان است که از حدیث عربشاه بن محمد بن ابی المعالی علوی نوقی خبوشانی به صورت کتبی روایت کرده‌ایم. گفت: محمد بن الحسن بن سهل عباسی طوسی برای ما حدیث کرد، گفت: ابومحاسن علی بن ابی الفضل فارمدی برای ما حدیث کرد، گفت: احمد بن الحسین بن علی برای ما حدیث کرد، گفت: ابوعبدالله الحافظ برای ما حدیث کرد، گفت: ابوعمرو عثمان بن احمد بن سماک در بغداد برای ما املاء کرد، گفت: یحیی بن ابی طالب برای ما حدیث کرد، گفت: عبدالرحمن بن ابراهیم راسبی برای ما حدیث کرد، گفت: مالک بن انس از نافع از ابن عمر گفت: عمر بن خطاب به سعد بن ابی وقاص که در قادسیه بود، نوشت که نضلة بن معاویه انصاری را به حلوان عراق بفرست تا به اطراف آن حمله کند. سعد، نضله را با سیصد سوار فرستاد. آن‌ها حرکت کردند تا به حلوان عراق رسیدند و به اطراف آن حمله کردند و غنیمت و اسیرانی به دست آوردند. آن‌ها غنیمت و اسیران را می‌راندند تا اینکه نزدیک عصر شد و خورشید نزدیک بود غروب کند. نضله اسیران و غنیمت را به دامنه کوه پناه داد، سپس برخاست و اذان گفت: «الله اکبر الله اکبر». گفت: و پاسخ‌دهنده‌ای از کوه به او پاسخ داد: «بزرگ را بزرگ شمردی ای نضله.» سپس گفت: «أشهد أن لا إله إلا الله». گفت: «کلمه اخلاص است ای نضله.» و گفت: «أشهد أن محمدا رسول الله». گفت: «او دین است و همان است که عیسی بن مریم علیهما السلام ما را به او بشارت داد و قیامت بر سر امت او برپا می‌شود.» سپس گفت: «حی علی الصلاة». گفت: «خوشا به حال کسی که به سوی آن رفت و بر آن مداومت کرد.» سپس گفت: «حی علی الفلاح». گفت: «رستگار شد کسی که محمد صلی الله علیه و سلم را اجابت کرد و این بقا (البقاء) برای امت اوست.» گفت: «الله اکبر الله اکبر». گفت: «بزرگ را بزرگ شمردی.» گفت: «لا إله إلا الله». گفت: «اخلاص را خالص کردی ای نضله، پس خداوند جسد تو را بر آتش حرام کرد.» گفت: هنگامی که از اذان فارغ شد، برخاستیم و گفتیم: «تو کیستی، خدا تو را رحمت کند؟ آیا فرشته‌ای هستی یا ساکنی از جن یا از بندگان خدا؟ صدایت را به ما شناندی، پس شخص خود را به ما نشان ده، زیرا ما فرستاده خدا و فرستاده رسول خدا صلی الله علیه و سلم و فرستاده عمر بن خطاب هستیم.» گفت: پس کوه شکافته شد و سری مانند آسیاب، با مو و ریش سفید، که دو جامه پشمین بر تن داشت، از آن بیرون آمد. گفت: «السلام علیکم ورحمة الله وبرکاته». گفتیم: «و علیک السلام ورحمة الله وبرکاته. تو کیستی، خدا تو را رحمت کند؟» گفت: «من زریب بن برثملا، وصی بنده صالح عیسی بن مریم علیهما السلام هستم. او مرا در این کوه ساکن کرد و برایم دعای طول بقا کرد تا زمانی که از آسمان نازل شود و خوک را بکشد و صلیب را بشکند و از آنچه نصاری به او نسبت داده‌اند، بیزاری جوید. پیامبر صلی الله علیه و سلم چه کرد؟» گفتیم: «قبض شد (درگذشت).» پس گریه طولانی کرد تا ریشش از اشک خیس شد. سپس گفت: «چه کسی پس از او در میان شما قیام کرد؟» گفتیم: «ابوبکر.» گفت: «چه کرد؟» گفتیم: «قبض شد.» گفت: «چه کسی پس از او در میان شما قیام کرد؟» گفتیم: «عمر.» گفت: «اگر دیدار محمد صلی الله علیه و سلم از من فوت شد، سلام مرا به عمر برسانید و بگویید: ای عمر، استوار باش و به حق نزدیک شو، زیرا امر نزدیک شده است. و این خصلت‌هایی را که به شما خبر می‌دهم، به او خبر دهید: ای عمر، هنگامی که این خصلت‌ها در امت محمد صلی الله علیه و سلم ظاهر شد، پس فرار، فرار! هنگامی که مردان به مردان و زنان به زنان بی‌نیاز شوند، و خود را به غیر از نسب‌هایشان نسبت دهند، و به غیر از موالیان خود منتسب شوند، و بزرگشان به کوچکشان رحم نکند و کوچکشان بزرگشان را احترام نگذارد، و امر به معروف ترک شود و به آن امر نشود، و نهی از منکر ترک شود و از آن نهی نشود، و عالمشان علم را بیاموزد تا با آن دینارها و درهم‌ها به دست آورد، و باران در تابستان ببارد (قیظ باشد)، و فرزند مایه خشم باشد، و منبرها را بلند کنند، و مصحف‌ها را با نقره بیارایند، و مساجد را زینت دهند، و رشوه را آشکار سازند، و ساختمان‌ها را محکم سازند، و از هوی و هوس پیروی کنند، و دین را به دنیا بفروشند، و خون‌ها را سبک شمارند، و پیوندهای خویشاوندی قطع شود، و حکم فروخته شود، و ربا خورده شود، و تسلط مایه فخر گردد، و ثروتمند مایه عزت، و مرد از خانه‌اش خارج شود و کسی که از او بهتر است به احترامش برخیزد، و زنان بر زین‌ها سوار شوند.» گفت: سپس از ما غایب شد. نضله این را به سعد نوشت و سعد به عمر نوشت. عمر نوشت: «تو و هر کس از مهاجرین و انصار که با تو هستند، بیایید تا در این کوه فرود آیید. اگر او را دیدی، سلام مرا به او برسان.»\n> فإن رسول الله صلى الله عليه وسلم قال إن بعض أوصياء عيسى بن مريم عليه السلام نزل بذلك الجبل بناحية العراق‏\n> *Translation:* زیرا رسول خدا صلی الله علیه و سلم فرمود: «همانا برخی از اوصیای عیسی بن مریم علیه السلام در آن کوه در ناحیه عراق فرود آمده‌اند.»\nسعد با چهار هزار نفر از مهاجرین و انصار فرود آمد تا چهل روز در آن کوه ماند و در وقت هر نماز اذان می‌گفت، اما او را نیافت. راسبی در نقل خود از مالک بن انس متابعت نشده است. و معروف در این حدیث، مالک بن ازهر از نافع است، و ابن ازهر مجهول است. ابوعبدالله حاکم گفت: نام ابن ازهر جز در این حدیث شنیده نشده است. و سؤال از پیامبر صلی الله علیه و سلم و ابوبکر از حدیث ابن لهیعه از ابن ازهر است. ما می‌گوییم: این حدیث، اگرچه در طریق آن سخن گفته شده است، اما نزد امثال ما از طریق کشف (الکشف) صحیح است. و سخن او درباره زینت دادن مساجد و نقره‌کاری مصحف‌ها، از باب مذمت نیست، بلکه دلالتی بر نزدیک شدن قیامت و فساد زمان است، مانند دلالت نزول عیسی علیه السلام و خروج مهدی و طلوع خورشید از مغربش. معلوم است که همه این‌ها از باب مذمت نیست، بلکه دلالت‌ها بر یک چیز ممکن است مذموم یا محمود باشند.\n\n### [اوصیای پیامبران پیشین در زمان شریعت محمدی]\n\nاین وصی عیسوی، ابن برثملا، همچنان در آن کوه به عبادت مشغول است و با کسی معاشرت نمی‌کند. در حالی که رسول خدا صلی الله علیه و سلم مبعوث شده است. آیا گمان می‌کنی آن راهب بر احکام نصاری باقی مانده است؟ نه، به خدا سوگند! زیرا شریعت محمد صلی الله علیه و سلم ناسخ است. پیامبر صلی الله علیه و سلم می‌فرماید:\n> لو كان موسى حيا ما وسعه إلا أن يتبعني\n> *Translation:* «اگر موسی زنده بود، چاره‌ای جز پیروی از من نداشت.»\nو این عیسی، هنگامی که نازل می‌شود، جز با ما امامت نمی‌کند، یعنی با سنت ما، و جز با شریعت ما در میان ما حکم نمی‌کند. پس این راهب از کسانی است که عَلَى‏ بَيِّنَةٍ مِنْ رَبِّهِ (علَى‏ بَيِّنَةٍ مِنْ رَبِّهِ) [بر دلیل روشنی از پروردگارش] است. پروردگارش از نزد خود آنچه را که بر او از شریعت پیامبر ما محمد صلی الله علیه و سلم واجب کرده، به او آموخته است، بر همان طریقی که از خدا به آن عادت کرده است. و این نزد ما ذوق (الذوق) محقق است، زیرا ما بسیاری از احکام محمد صلی الله علیه و سلم را که نزد علمای رسوم در شریعتش مقرر است و ما از آن‌ها علمی نداشتیم، از این طریق گرفتیم و آن‌ها را نزد علمای رسوم همان‌گونه که نزد ماست، یافتیم. و از آن طریق، احادیث نبوی را تصحیح می‌کنیم و همچنین اگر به ما اعلام شود که طرق آن‌ها سست و غیر صحیح از رسول خدا صلی الله علیه و سلم است، آن‌ها را رد می‌کنیم، اگرچه شارع حکم مجتهد را تأیید کرده باشد، حتی اگر خطا کرده باشد. اما اهل این طریقت جز آنچه رسول خدا صلی الله علیه و سلم حکم کرده است، نمی‌گیرند. و این وصی از افراد (الأفراد) است و طریق او در اخذ علوم، طریق خضر، یار موسی علیه السلام، است. پس او بر شریعت ماست، اگرچه طریق رسیدن به علم صحیح متفاوت باشد، زیرا این امر به علم لطمه نمی‌زند.\n> قال رسول الله صلى الله عليه وسلم فيمن أعطى الولاية من غير مسألة إن الله يعينه عليها وإن الله يبعث إليه ملكا يسدده‏\n> *Translation:* رسول خدا صلی الله علیه و سلم درباره کسی که ولایت (الولایة) بدون درخواست به او داده شده است، فرمود: «خداوند او را بر آن یاری می‌کند و فرشته‌ای را به سوی او می‌فرستد تا او را استوار سازد.»\nمنظور، عصمت او از غلط در آنچه حکم می‌کند، است. خضر گفت: وَمَا فَعَلْتُهُ عَنْ أَمْرِي (وَمَا فَعَلْتُهُ عَنْ أَمْرِي) [و آن را از پیش خود انجام ندادم]. و پیامبر علیه السلام فرمود:\n> إن يكن في أمتي محدثون فمنهم عمر\n> *Translation:* «اگر در امت من محدثانی باشند، عمر از آن‌هاست.»\nنزد ما ثابت شده است که پیامبر صلی الله علیه و سلم از کشتن راهبانی که از خلق کناره گرفته و به پروردگارشان منفرد شده‌اند، نهی کرد و فرمود:\n> ذروهم وما انقطعوا إليه‏\n> *Translation:* «آن‌ها را رها کنید و آنچه را که به آن پیوسته‌اند.»\nپس با لفظی مجمل آمد و ما را به دعوت آن‌ها امر نکرد، زیرا او صلی الله علیه و سلم می‌دانست که آن‌ها بر دلیل روشنی از پروردگارشان هستند. در حالی که پیامبر صلی الله علیه و سلم به تبلیغ امر کرد و ما را امر کرد که شاهد به غایب برساند. اگر رسول خدا صلی الله علیه و سلم نمی‌دانست که خداوند تعلیم آن‌ها را بر عهده می‌گیرد، همان‌طور که تعلیم خضر و دیگران را بر عهده گرفت، سخن او این نبود و او را بر شریعت منسوخ نزد خود در این ملت تأیید نمی‌کرد. و او صلی الله علیه و سلم در ادعای خود صادق است که به سوی تمامی مردم مبعوث شده است، همان‌طور که خداوند درباره او ذکر کرده است. پس رسالت او تمامی خلق را فرا گرفت. و روح این تعریف این است که هر کس زمان او را درک کند و دعوت او به او برسد، خداوند او را جز به شریعت او متعبد نمی‌سازد. زیرا ما قطعاً می‌دانیم که او صلی الله علیه و سلم در زمان خود با تمامی مردم به صورت مستقیم سخن نگفت. پس این جز همان وجهی نیست که ذکر کردیم. و این راهب از عیسویانی است که عیسی علیه السلام را تا زمان بعثت محمد صلی الله علیه و سلم به ارث بردند. فلما بعث محمد صلی الله علیه و سلم تعبد الله هذا الراهب بشرعه صلی الله علیه و سلم وعلمه من لدنه علما بالرحمة التی آتاه من عنده کان ورثه أیضا حالة عیسویة من محمد صلی الله علیه و سلم فلم یزل عیسویا فی الشریعتین أ لا تری هذا الراهب قد أخبر بنزول عیسی علیه السلام وأخبر أنه إذا نزل یقتل الخنزیر ویکسر الصلیب أ تراه بقی علی تحلیل لحم الخنزیر فلم یزل هذا الراهب عیسویا فی الشریعتین فله الأجر مرتین أجر اتباعه نبیه وأجر اتباعه محمدا صلی الله علیه و سلم وهو فی انتظار عیسی إلی أن ینزل وهؤلاء الصحابة قد رأوه مع نضلة وما سألوه عن حاله فی الإسلام والإیمان ولا بما یتعبد نفسه من الشرائع لأن النبی صلی الله علیه و سلم ما أمرهم بسؤال مثله فعلمنا قطعا أن النبی صلی الله علیه و سلم لا یقر أحدا علی الشرک وعلم إن لله عبادا یتولی الحق تعلیمهم من لدنه علم ما أنزله علی محمد صلی الله علیه و سلم رحمة منه وفضلا وکان فضل الله عظیما ولو کان ممن یؤدی الجزیة لقلنا إن الشرع المحمدی قد قرر له دینه ما دام یعطی الجزیة وهذه مسألة دقیقة فی عموم رسالته وأنه بظهوره لم یبق شرع إلا ما شرعه ومما شرع تقریرهم علی شرعهم ما داموا یعطون الجزیة إذا کانوا من أهل الکتاب و کم لله تعالی من هؤلاء العباد فی الأرض‏\n\n### [اصول عیسویان و روحانیت آن‌ها]\n\nپس اصل عیسویان، همان‌طور که مقرر کردیم، تجرید توحید (التوحید) از صورت‌های ظاهری در امت عیسوی و مثال‌هایی است که در کلیساها دارند، به این دلیل که آن‌ها بر شریعت محمد صلی الله علیه و سلم هستند. اما روحانیت (الروحانية) حالی که بر آن هستند، عیسوی است در نصاری و موسوی است در یهود، از مشکات محمد صلی الله علیه و سلم، از:\n> قوله صلى الله عليه وسلم اعبد الله كأنك تراه والله في قبلة المصلي وإن العبد إذا صلى استقبل ربه‏\n> *Translation:* سخن او صلی الله علیه و سلم: «خدا را چنان عبادت کن که گویی او را می‌بینی، و خداوند در قبله نمازگزار است، و بنده هنگامی که نماز می‌خواند، رو به پروردگارش می‌کند.»\nو از هر آنچه در مورد خدا از امثال این نسبت‌ها وارد شده است. و برای عیسوی از این امت، از کرامات، راه رفتن در هوا نیست، بلکه برای آن‌ها راه رفتن بر روی آب است. و محمدی به حکم تبعیت (التبعية) در هوا راه می‌رود. زیرا پیامبر صلی الله علیه و سلم در شب معراج، محمول بود.\n> قال في عيسى عليه السلام لو ازداد يقينا لمشى في الهواء\n> *Translation:* درباره عیسی علیه السلام فرمود: «اگر یقینش بیشتر می‌شد، در هوا راه می‌رفت.»\nو شکی نیست که یقین عیسی علیه السلام از ما بسیار قوی‌تر است، زیرا او از اولی العزم (أولي العزم) از رسولان است. و ما بدون شک در هوا راه می‌رویم. و ما خلق بسیاری را دیده‌ایم که در حال راه رفتن در هوا هستند. پس قطعاً دانستیم که راه رفتن ما در هوا تنها به حکم صدق تبعیت است، نه به واسطه افزایش یقین بر یقین عیسی علیه السلام. هر یک از ما مشرب (مشرب) خود را دانسته است. پس ما به حکم تبعیت از محمد صلی الله علیه و سلم، از وجه خاصی که این مقام را دارد، راه می‌رویم، نه از قوت یقین، همان‌طور که گفتیم که با آن عیسی علیه السلام را برتری دهیم. حاشا لله که چنین بگوییم. همان‌طور که امت عیسی بر روی آب راه می‌روند به حکم تبعیت، نه به واسطه برابری یقینشان با یقین عیسی علیه السلام. پس ما با رسولان در خرق عادات (خرق العوائد) که به آن‌ها اختصاص یافته و امثال آن‌ها به حکم تبعیت بر ما ظاهر شده است، همراه هستیم. همان‌طور که در کتاب الیقین (کتاب الیقین) برای خود مثال زدیم که ممالیک خواص که نعلین استادان خود از امرا را نگه می‌دارند، هنگامی که بر سلطان وارد می‌شوند، و برخی از امرا بیرون در می‌مانند، چون به آن‌ها اجازه ورود داده نشده است؛ آیا گمان می‌کنی ممالیکی که با استادان خود وارد شده‌اند، از امرایی که به آن‌ها اجازه داده نشده، منصب بالاتری دارند؟ آیا آن‌ها وارد نشدند مگر به حکم تبعیت از استادان خود؟ بلکه هر کس بر مرتبه خود است. پس امرا بر امرا متمایز هستند و ممالیک بر ممالیک در جنس خود متمایز هستند. همچنین ما با انبیا در آنچه برای پیروان از خرق عادات رخ می‌دهد، چنین هستیم. سپس پیامبر صلی الله علیه و سلم در هوا راه نرفت مگر در حالی که بر براق سوار بود، مانند سوارکار، و بر رفرف، مانند کسی که در محفه حمل می‌شود. پس براق و رفرف صورت مقامی را که او در نفس خود بر آن است، آشکار کردند که او در نفس خود محمول است. و همچنین نسبتی الهی از قول خداوند متعال: الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى (الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى) [رحمان بر عرش استیلا یافت] و از قول او: وَيَحْمِلُ عَرْشَ رَبِّكَ (وَيَحْمِلُ عَرْشَ رَبِّكَ) [و عرش پروردگارت را حمل می‌کنند]. پس عرش محمول است. این حمل، حمل کرامت است به واسطه حاملان، و حالتی از آسایش و مجد و عزت برای محمولان. و ما در جای دیگری برای تو مقرر کردیم که محمول در این مقام و امثال آن، بالاتر از غیر محمول است. و اینکه «لا حول ولا قوة إلا بالله» (لا حول ولا قوة إلا بالله) از جمله چیزهایی است که حاملان به آن اختصاص یافته‌اند، اگرچه تمامی خلق محمول هستند، اما آن حمل برای هر کسی کشف نشده است. اگرچه حمل بر مراتب است: حمل از روی عجز، و حمل از روی حقیقت، مانند حمل بارهای سنگین، و حمل از روی شرف و مجد. پس عنایت به این طایفه آن است که ظاهراً محمول باشند، همان‌طور که باطناً امر در نفس خود چنین است، تا از ادعا مبرا باشند، همان‌طور که در باب خود مقرر کردیم.\n\n### [نشانه‌های عیسویان]\n\nو برای عیسویان همتی فعال، دعایی مقبول و کلامی شنیده شده است. و اگر می‌خواهی عیسویان را بشناسی، به نشانه‌های آن‌ها بنگر: هر شخصی که در او رحمتی نسبت به عالم و شفقتی بر آن باشد، هر که باشد و بر هر دینی که باشد و با هر نحلتی که ظاهر شود، و تسلیم در برابر خدا در مورد آن‌ها داشته باشد، با کلامی که سینه‌ها را در حق تمامی خلق تنگ می‌کند، با بندگان خدا سخن نمی‌گویند. و از نشانه‌های آن‌ها این است که از هر چیزی، بهترین آن را می‌بینند و جز خیر بر زبانشان جاری نمی‌شود. و طبقه اول و دوم در این امر مشترک هستند. طبقه اول مانند آنچه:\n> روى عن عيسى عليه السلام أنه رأى خنزيرا فقال له أنج بسلام فقيل له في ذلك فقال أعود لساني قول الخير\n> *Translation:* از عیسی علیه السلام روایت شده است که خوکی را دید و به او گفت: «به سلامت برو.» از او درباره این سخن پرسیدند، گفت: «زبانم را به گفتن خیر عادت داده‌ام.»\nو اما طبقه دوم:\n> فإن النبي صلى الله عليه وسلم قال في الميتة حين مر عليها ما أحسن بياض أسنانها وقال من كان معه ما أنتن ريحها\n> *Translation:* پیامبر صلی الله علیه و سلم درباره مرداری که از کنار آن گذشت، فرمود: «چه دندان‌های سفیدی دارد.» و کسی که با او بود، گفت: «چه بوی گندی دارد.»\nو پیامبر صلی الله علیه و سلم اگرچه به کشتن مارها به وجه خاصی امر کرد و خبر داد که خداوند شجاعت را دوست دارد، حتی در کشتن مار، با این حال، در غار در مِنی بود و سوره والمرسلات بر او نازل شد. و غار تا کنون به واسطه والمرسلات شناخته می‌شود. من برای تبرک وارد آن شدم. ماری از آن خارج شد و صحابه برای کشتن آن شتافتند، اما مار از دست آن‌ها گریخت. رسول خدا صلی الله علیه و سلم فرمود:\n> إن الله وقاها شركم كما وقاكم شرها\n> *Translation:* «خداوند او را از شر شما حفظ کرد، همان‌طور که شما را از شر او حفظ کرد.»\nپس آن را شر نامید، با وجود اینکه به آن امر شده بود، مانند قول خداوند متعال در قصاص: وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا (وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا) [و جزای بدی، بدی مانند آن است]. پس قصاص را بدی نامید و به عفو ترغیب کرد. پس چشم او صلی الله علیه و سلم جز بر بهترین چیزی که در مردار بود، نیفتاد. اولیای خدا نیز چنین هستند؛ از هر منظوری، جز بهترین آن را نمی‌بینند. و آن‌ها نسبت به بدی‌های خلق کور هستند، نه نسبت به بدی‌ها، زیرا مأمور به اجتناب از آن‌ها هستند. همان‌طور که نسبت به شنیدن فحشا کر هستند، و نسبت به بر زبان آوردن سخن بد لال هستند، اگرچه در برخی مواقع مباح باشد. ما آن‌ها را این‌گونه شناختیم. پس منزه است کسی که آن‌ها را برگزید و انتخاب کرد و به صِرَاطٍ مُسْتَقِيمٍ (صِرَاطٍ مُسْتَقِيمٍ) [راه راست] هدایت کرد. أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ (أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ) [آنان کسانی هستند که خدا هدایتشان کرده، پس به هدایت آنان اقتدا کن]. این مقام عیسی علیه السلام در محمد صلی الله علیه و سلم است، زیرا او از نظر زمانی بر او تقدم داشت و این احوال از او نقل شده است. خداوند متعال به پیامبرش صلی الله علیه و سلم هنگامی که در قرآن از پیامبرانی که ذکر شدند، و عیسی در زمره آن‌هاست، فرمود: أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ (أُولَئِكَ الَّذِينَ هَدَى اللَّهُ فَبِهُدَاهُمُ اقْتَدِهْ). اگرچه مقام رسالت اقتضا می‌کند که نیک از زشت تبیین شود تا دانسته شود، همان‌طور که خداوند متعال فرمود: لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ (لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَيْهِمْ) [تا آنچه را که برای مردم نازل شده است، برایشان تبیین کنی]. پس اگر بدی را در حق شخصی تبیین کرد، به وحی از جانب خداست، همان‌طور که درباره شخصی فرمود: «بئس أين العشيرة» [چه بد است این قبیله]. و خضر آن پسر را کشت و درباره او گفت: «طبع کافر» یا خبر داد که اگر او را رها کند، چه بدی‌هایی از او در حق پدر و مادرش سر خواهد زد، و گفت: «ما فعلت ذلك عن أمري» [آن را از پیش خود انجام ندادم]. پس آنچه برای مردان از ذات خودشان است، سخن نیکو و نظر به نیکی و گوش سپردن به نیکی است. پس اگر زمانی خلاف این از پیامبر یا ولی ظاهر شد، آن از امر الهی است و زبان آن‌ها نیست. این‌ها را از احوال عیسویان ذکر کردیم، آنچه خداوند بر زبان من آسان کرد. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) [و خداوند حق را می‌گوید و او راه را می‌نمایاند]."
  },
  "page_count": 5
}