{
  "id": 320,
  "title": {
    "ar": "الباب الموفي عشرين وثلاثمائة في معرفة منزل تسبيح القبضتين وتمييزهما",
    "en": "Chapter Three Hundred and Twenty: Concerning the Gnosis (معرفة) of the Station (منزل) of the Glorification (تسبيح) of the Two Grips (القبضتين) and their Differentiation.",
    "ur": "باب تین سو بیس: دو قبضوں کی تسبیح کے مقام کی معرفت اور ان کے امتیاز کے بیان میں۔",
    "fa": "باب سیصد و بیستم در معرفت منزل تسبیح دو قبضه و تمییز آن دو"
  },
  "content": {
    "ar": "## «الباب الموفي عشرين وثلاثمائة في معرفة منزل تسبيح القبضتين وتمييزهما»\n\n\n> من عامل الحق بالإخلاص قد ربحا *** وإن يكن فيه شرك فهو قد سمحا\n\n\n> العلم علمان موهوب ومكتسب *** وخير علم ينال العبد ما منحا\n\n\n> كذاك معلوم علم الكسب ليس له *** في الوزن حظ لأن العبد ما كدحا\n\n\n> يغتم قلبك إن خفت موازنه *** كما يسر إذا ميزانه رجحا\n\n\n> فاقدح زنادك لا تكسل فليس لمن *** يسعى إلى الحق قدر غير ما قدحا\n\n\n> الفكر في ذات من لا شي‏ء يشبهه *** جهل فلا تلتفت للعقل أن جنحا\n\n\n> وادخل على باب تفريغ المحل ترى *** علم العيان إذا ما بابه فتحا\n\n\n### [أن دار الأشقياء وملائكة العذاب في دار النعيم‏]\n\n\nاعلم أن دار الأشقياء وملائكة العذاب وهم في تعظيم الله وتمجيده كما هم ملائكة النعيم في دار النعيم لا فرق كلهم عبد مطيع الواحد ينعم لله والآخر ينتقم لله وكذلك القبضتان وهما العالمان عالم السعادة وعالم الشقاوة وما منهم جارحة ولا فيهم جوهر فرد إلا وهو مسبح لله مقدس لجلاله غير عالم بما تصرفه فيه نفسه المدبرة له المكلفة التي كلفها الله تعالى عبادته والوقوف بهذه الجوارح وبعالم ظاهره عند ما حد له فلو علمت الجوارح ما تعلمه النفس من تعيين ما هو معصية وما هو طاعة ما وافقته على مخالفة أصلا فإنها ما تعاين شيئا من الموجودات إلا مسبحا لله مقدسا لجلاله غير أنها قد أعطيت من الحفظ القوة العظيمة فلا تصرفها النفس في أمر إلا وتحتفظ على ذلك الأمر وتعلمه والنفس تعلم أن ذلك طاعة ومعصية فإذا وقع الإنكار يوم القيامة عند السؤال من هذه النفس يقول الله لها نبعث عليك شاهدا من نفسك فتقول في نفسها من يشهد علي فيسأل الله تعالى الجوارح عن تلك الأفعال التي صرفها فيها فيقول للعين قولي فيما صرفك فتقول له يا رب نظر بي إلى أمر كذا وكذا وتقول الأذن أصغى بي إلى كذا وكذا وتقول اليد بطش بي في كذا وكذا والرجل كذلك والجلود كذلك والألسنة كذلك فيقول الله له هل تنكر شيئا من ذلك فيحار ويقول لا والجوارح لا تعرف ما الطاعة ولا المعصية فيقول الله أ لم أقل لك على لسان رسولي وفي كتبي لا تنظر إلى كذا ولا تسمع كذا ولا تسع إلى كذا ولا تبطش بكذا ويعين له جميع ما تعلق من التكليف بالحواس ثم يفعل كذلك في الباطن فيما حجر عليه من سوء الظن وغيره فإذا عذبت النفس في دار الشقاء بما يمس الجوارح من النار وأنواع العذاب فأما الجوارح فتستعذب جميع ما يطرأ عليها من أنواع العذاب ولذا سمي عذابا لأنها تستعذبه كما يستعذب ذلك خزنة النار حيث ينتقم لله وكذلك الجوارح حيث جعلها الله محلا للانتقام من تلك النفس التي كانت تحكم عليها والآلام تختلف على النفس الناطقة بما تراه في ملكها وبما تنقله إليها الروح الحيواني فإن الحس ينقل للنفس الآلام في تلك الأفعال المؤلمة والجوارح ما عندها إلا النعيم الدائم في جهنم مثل ما هي الخزنة عليه ممجدة مسبحة لله تعالى مستعذبة لما يقوم بها من الأفعال كما كانت في الدنيا فيتخيل الإنسان أن العضو يتألم لإحساسه في نفسه بالألم وليس كذلك إنما هو المتألم بما تحمله الجارحة أ لا ترى المريض إذا نام لا شك أن النائم حي والحس عنده موجود والجرح الذي يتألم به في يقظته موجود ومع هذا لا يجد العضو ألما لأن الواجد للألم قد صرف وجهه عن عالم الشهادة إلى البرزخ فما عنده خبر فارتفعت عنه الآلام الحسية وبقي في البرزخ على ما يكون عليه إما في رؤيا مفزعة فيتألم أو في رؤيا حسنة فيتنعم فينتقل معه الألم أو النعيم حيث انتقل فإذا استيقظ المريض وهو رجوع نفسه إلى عالم الشهادة قامت به الآلام والأوجاع فقد تبين لك إن كنت عاقلا من يحمل الألم منك ومن يحس به ممن لا يحمله ولا يحس به‏\nولو كانت الجوارح تتألم لا نكرت كما تنكر النفس وما كانت تشهد عليه قال تعالى وما كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ ولا أَبْصارُكُمْ ولا جُلُودُكُمْ وقال إِنَّ السَّمْعَ والْبَصَرَ والْفُؤادَ كُلُّ أُولئِكَ كانَ عَنْهُ مَسْؤُلًا فاسم كان هو النفس تسأل النفس عن سمعه وبصره وفؤاده كما قررناه يقال له ما فعلت برعيتك أ لا ترى الوالي الجائر إذا أخذه الملك وعذبه عند استغاثة رعيته به كيف تفرح الرعية بالانتقام من واليها كذلك الجوارح يكشف لك يوم القيامة عن فرحها ونعيمها بما تراه في النفس التي كانت تدبرها في ولايتها عليه لأن حرمة الله عظيمة عند الجوارح أ لا ترى العصاة من المؤمنين كيف يميتهم الله في النار إماتة كما ينام المريض هنا فلا يحس بالألم عناية من الله بمن ليس من أهل النار حتى إذا عادوا حمما أخرجوا من النار فلو كانت الجوارح تتألم لوصفها الله بالألم في ذلك الوقت ولم يرد بذلك كتاب ولا سنة فإن قلت فما فائدة حرقها حتى تعود حمما قلنا كل محل يعطي حقيقته فذلك المحل يعطي هذا الفعل في الصور أ لا ترى الإنسان إذا قعد في الشمس يسود وجهه وبدنه والشقة إذا نشرت في الشمس وتتبعت بالماء كلما نشفت تبيض فهل أعطى ذلك إلا المحل المخصوص والمزاج المخصوص فلم يكن المقصود العذاب ولو كان لم يمتهم الله فيها إماتة فإن محل الحياة في النفوس يطلب النعيم أو الألم بحسب الأسباب المؤلمة والمنعمة فألقوا بل هي الموصوفة بما ذكرناه وإذا أحياهم الله تعالى وأخرجهم ونظروا إلى تغير ألوانهم وكونهم قد صاروا حمما ساءهم ذلك فينعم الله عليهم بالصورة التي يستحسنونها فينشئهم عليها ليعلموا نعمة الله عليهم حين نقلهم مما يسوؤهم إلى ما يسرهم فقد علمت يا أخي من يعذب منك ومن يتنعم وما أنت سواك فلا تجعل رعيتك تشهد عليك فتبوء بالخسران وقد ولاك الله الملك وأعطاك اسما من أسمائه فسماك ملكا مطاعا فلا تجر ولا تحف فإن ذلك ليس من صفة من ولاك وإن الله يعاملك بأمر قد عامل به نفسه فأوجب على نفسه كما أوجب عليك ودخل لك تحت العهد كما أدخلك تحت العهد فما أمرك بشي‏ء إلا وقد جعل على نفسه مثل ذلك هذا لتكون له الحجة البالغة ووفى بكل ما أوجبه على نفسه وطلب منك الوفاء بما أوجبه عليك هذا كله إنما فعله حتى لا تقول أنا عبد قد أوجب على كذا وكذا ولم يتركني لنفسي بل أدخلني تحت العهد والوجوب فيقول الله له هل أدخلتك فيما لم أدخل فيه نفسي أ لم أوجب على نفسي كما أوجبت عليك أ لم أدخل نفسي تحت عهدك كما أدخلتك تحت عهدي وقلت لك إن وفيت بعهدي وفيت بعهدك قال تعالى قُلْ يا محمد فَلِلَّهِ الْحُجَّةُ الْبالِغَةُ وهذا معنى قوله تعالى رَبِّ احْكُمْ بِالْحَقِّ وهل يحكم الله إلا بالحق ولكن جعل الحق نفسه في هذه الآية مأمورا لنبيه عليه السلام فإن لفظة احكم أمر وأمره سبحانه أن يقول له ذلك قال تعالى قل يا محمد رَبِّ احْكُمْ بِالْحَقِّ وأكثر من هذا النزول الإلهي إلى العباد ما يكون فيا أيها العبد أ ليس هذا من كرمه أ ليس هذا من لطفه أ لم يف سبحانه بكل ما أوجبه على نفسه أ لم يف بعهد كل من وفى له بعهده أ لم يصفح وعفا عن كثير مما لو شاء آخذ به عباده أين أنت أين نظرك من هذا الفضل العظيم من رب قاهر قادر لا يعارض ولا يغالب‏\n\n\n### [أن سبب وصف القبضتين بالتسبيح كونهما مقبوضتين للحق تعالى‏]\n\n\nواعلم أن سبب وصف القبضتين بالتسبيح كونهما مقبوضتين للحق تعالى فجعل القبضتين في يده فقال هؤلاء للنار ولا أبالي وهؤلاء للجنة ولا أبالي فهم ما عرفوا إلا الله فهم يسبحونه ويمجدونه لأنهم في قبضته ولا خروج لهم عن القبضة ثم إن الله بكرمه لم يقل فهؤلاء للعذاب ولا أبالي وهؤلاء للنعيم ولا أبالي وإنما أضافهم إلى الدارين ليعمروهما وكذا\n\n\nورد في الخبر الصحيح أن الله لما خلق الجنة والنار قال لكل واحدة منها لها على ملؤها\n\n\nأي أملؤها سكانا إذ كان عمارة الدار بساكنها كما قال القائل‏\n\n\nوعمارة الأوطان بالسكان‏\n\n\nلأنها محل ولا تكون محلا إلا بالحلول فيها ولهذا يقول الله لِجَهَنَّمَ هَلِ امْتَلَأْتِ فتقول هَلْ من مَزِيدٍ\n\n\nفإذا وضع الجبار فيها قدمه قالت قطني قطني وفي رواية قط قط أي قد امتلأت فقد ملأها بقدمه على ما شاء سبحانه‏\n\n\nمن علم ذلك فيخلق الله فيها خلقا يعمرونها قال تعالى أَنَّ لَهُمْ قَدَمَ صِدْقٍ أي سابقة بأمر قد أعلمهم به قبل أن يعطيهم ذلك ثم أعطاهم فصدق فيما وعدهم به وقد وعد النار بأن يملأها فكونه إذ يملأها بقدمه أي بسابقة قوله إنه سيملأها فصدق لها في ذلك بأن خلق فيها خلقا يعمرونها وأضاف القدم إلى الجبار لأن هذا الاسم للعظمة والنار موجودة من العظمة والجنة موجودة من الكرم فلهذا اختص اسم الجبار بالقدم للنار وأضافه إليه فيستروح من هذا عموم الرحمة في الدارين وشمولها حيث ذكرهما ولم يتعرض لذكر الآلام وقال بامتلائهما وما تعرض لشي‏ء من‏\nذلك وهذا كله من سلطان‏\n\n\nقوله لعباده إن رحمته سبقت غضبه‏\n\n\nفالسابقة حاكمة أبدا ويقال لفلان في هذا الأمر سابقة قدم فتلك بشرى إن شاء الله وإن السكنى لأهل النار في النار لا يخرجون منها كما قال تعالى خالِدِينَ فِيها يعني في النار وخالِدِينَ فِيها يعني في الجنة ولم يقل فيه فيريد العذاب فلو قال عند ذكر العذاب خالدين فيه أشكل الأمر ولما أعاد الضمير على الدار لم يلزم العذاب فإن قال قائل فكذلك لا يلزم النعيم كما لم يلزم العذاب قلنا وكذلك كنا نقول ولكن لما قال الله تعالى في نعيم الجنة إنه عطاء غَيْرَ مَجْذُوذٍ أي عطاء غير مقطوع وقال لا مَقْطُوعَةٍ ولا مَمْنُوعَةٍ لهذا قلنا بالخلود في النعيم والدار ولم يرد مثل هذا قط في عذاب النار فلهذا لم نقل به فإن قلت فقد قال خالِدِينَ فِيهِ وساءَ لَهُمْ يَوْمَ الْقِيامَةِ حِمْلًا قلنا إنما ذلك في موطن من مواطن الآخرة والضمير يعود على الوزر لا على العذاب فإذا أقيموا في حمل الأثقال التي هي الأوزار يحملونها كما قال لَيَحْمِلُنَّ أَثْقالَهُمْ وأَثْقالًا مَعَ أَثْقالِهِمْ ولَيُسْئَلُنَّ يَوْمَ الْقِيامَةِ عَمَّا كانُوا يَفْتَرُونَ وهو زمان مخصوص فيقول خالِدِينَ فِيهِ أي في حمل الوزر من الموضع الذي يحملونه من خروجهم من قبورهم إلى أن يصلوا به إلى النار فيدخلونها فهم خالدون فيه في تلك المدة لا يفتر عنهم ولا يأخذه من على ظهورهم غيرهم قال تعالى من أَعْرَضَ عَنْهُ فَإِنَّهُ يَحْمِلُ يَوْمَ الْقِيامَةِ وِزْراً خالِدِينَ فِيهِ فأعاد الضمير على الوزر وجعله ليوم القيامة هذا الحمل ويوم القيامة مدته من خروج الناس من قبورهم إلى أن ينزلوا منازلهم من الجنة والنار وينقضي ذلك اليوم فينقضي بانقضائه جميع ما كان فيه ومما كان فيه الخلود في حمل الأوزار فلما انقضى اليوم لم يبق للخلود ظرف يكون فيه وانتقل الحكم إلى النار والجنان والعذاب والنعيم المختص بهما وما ورد في العذاب شي‏ء يدل على الخلود فيه كما ورد في الخلود في النار ولكن العذاب لا بد منه في النار وقد غيب عنا الأجل في ذلك وما نحن منه من جهة النصوص على يقين إلا إن الظواهر تعطي الأجل في ذلك ولكن كميته مجهولة لم يرد بها نص وأهل الكشف كلهم مع الظواهر على السواء فهم قاطعون من حيث كشفهم فيسلم لهم إذ لا نص يعارضهم ونبقى نحن مع قوله تعالى إِنَّ رَبَّكَ فَعَّالٌ لِما يُرِيدُ وأي شي‏ء أراد فهو ذلك ولا يلزم أهل الايمان أكثر من ذلك إلا أن يأتي نص بالتعيين متواتر يفيد العلم فحينئذ يقطع المؤمن وإلا فلا فسبحان المسبح بكل لسان والمدلول عليه بكل برهان وهذا المنزل يتضمن علوما جمة منها علم التنزيه الذي يليق بكل عالم فإن التنزيه يختلف باختلاف العوالم وإن كل عالم ينزه الحق على قدر علمه بنفسه فينزهه من كل ما هو عليه إذ كان كل ما هو عليه محدث فينزه الحق عن قيام الحوادث به أعني الحوادث المختصة به ولهذا يختلف تنزيه الحق باختلاف المنزهين فيقول العرض مثلا سبحان من لا يفتقر في وجوده إلى محل يكون ظهوره به ويقول الجوهر سبحان من لا يفتقر في وجوده إلى موجد يوجده ويقول الجسم سبحان من لا يفتقر في وجوده إلى أداة تمسكه فهذا حصر التنزيه من حيث الأمهات لأنه ما ثم إلا جوهر أو جسم أو عرض لا غير ثم كل صنف يختص بأمور لا تكون لغيره فسبح الله من تلك الصفات ومن ذلك المقام والإنسان الكامل يسبح الله بجميع تسبيحات العالم لأنه نسخة منه إذ كشف له عن ذلك ويتضمن هذا المنزل من العلوم علم تمييز الأشياء ويتضمن علم الحق المخلوق به الذي يشير إليه عبد السلام أبو الحكم ابن برجان في كلامه كثيرا وكذلك الإمام سهل بن عبد الله التستري ولكن يسميه سهل بالعدل ويسميه أبو الحكم الحق المخلوق به أخذه من قوله وما خَلَقْنَا السَّماواتِ والْأَرْضَ وما بَيْنَهُما إِلَّا بِالْحَقِّ وله فيه كلام كبير شاف ويتضمن علم الصورة وهل هي عرض أو جوهر فإن الناس اختلفوا في ذلك وفيه علم الرجعة وفيه علم العلم أي بما ذا يعلم العلم وفيه علم الغيب والشهادة وفيه علم الورود والصدور وفيه علم الاعتبار وما حده وفيه علم الأذواق وهي أول مبادي التجلي وفيه علم العلل ومراتبها ومن يجوز أن يوصف بها\n\n\nممن لا يجوز وفيه علم تجلى الزعامة وهل مدلولها العلم أم لا وقوله عليه السلام الزعيم غارم وزعيم القوم ما رتبته ولم سمي زعيما وفيه علم الايمان وفيه علم النور دون غيره ولكن النور المنزل لا غير وفيه علم الخبرة والمخابرة وفيه علم المتاجر المربحة وأزمنتها والخسران وفيه علم الوعد والوعيد وفيه علم الأذن الإلهي وفيما ذا يكون وهل هو عام أو خاص والفرق بين الأمر والأذن وهل يعصى في الأذن كما يعصى في الأمر أم لا وفيه وصف العلم بالإحاطة وفيه علم التوحيد لما ذا يرجع وفيه علم التوكل وفيه علم مراتب الخلق في الولاية والعداوة وفيه علم الإنذار والتحذير ومن يحذر منه وما يحذر منه وفيه علم الفرق بين الاستطاعة والحق وفيه علم شرف‏\nصفة الكرم وفيه علم سبب الطلب الإلهي من العباد وفيه علم نتائج الشكر وفيه علم الفرق بين الحلم والعفو وفيه علم ترتيب الأشياء وفيه علم الحجاب الإلهي الأحمى والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 320: Concerning the Knowledge of the Station of the Glorification of the Two Hands and their Distinction\n\n> Whoever deals with the Real (الحق) with sincerity (الإخلاص) has surely profited,\n> And even if there is association (shirk) in it, He has forgiven.\n\n> Knowledge is two kinds: bestowed (موهوب) and acquired (مكتسب),\n> And the best knowledge the servant attains is that which is granted.\n\n> Likewise, the known object of acquired knowledge has no\n> Share in the weighing, because the servant did not toil (for the bestowed).\n\n> Your heart grieves if its scales are light,\n> Just as it rejoices if its scale is heavy.\n\n> Strike your flint, do not be lazy, for there is not for one\n> Who strives toward the Real a measure other than what he has struck.\n\n> Thinking about the Essence (الذات) of Him Whom nothing resembles\n> Is ignorance, so do not turn to the intellect (العقل) if it inclines (to such thought).\n\n> And enter the door of emptying the locus (تفريغ المحل) and you will see\n> The knowledge of direct vision (علم العيان) when its door is opened.\n\n### That the Abode of the Wretched and the Angels of Torment are in the Abode of Bliss\n\nKnow that the abode of the wretched (دار الأشقياء) and the angels of torment (ملائكة العذاب) are engaged in the magnification and glorification of Allah, just as the angels of bliss (ملائكة النعيم) are in the Abode of Bliss (دار النعيم). There is no difference; all are obedient servants. One grants bliss for Allah, and the other executes vengeance for Allah.\n\nLikewise are the Two Hands (القبضتان), which are the two worlds (العالمان): the world of felicity (عالم السعادة) and the world of wretchedness (عالم الشقاوة). There is no limb (جارحة) among them, nor any single atom (جوهر فرد) within them, but that it glorifies Allah (مسبح لله) and sanctifies His Majesty, without knowing what the governing, responsible soul (النفس المدبرة المكلفة) is directing it to do—the soul which Allah has charged with His worship and with standing by these limbs and by the manifest world (عالم ظاهره) according to the limits set for it.\n\nIf the limbs knew what the soul knows concerning the designation of what is sin (معصية) and what is obedience (طاعة), they would never agree to disobedience at all. For they witness nothing among existing things except that which glorifies Allah and sanctifies His Majesty. However, they have been granted a great power of preservation (الحفظ), so the soul does not direct them in any matter except that they preserve that matter and know it. The soul knows whether that is obedience or sin.\n\nWhen denial occurs on the Day of Resurrection during the questioning of this soul, Allah says to it, \"We shall send a witness against you from yourself.\" The soul wonders, \"Who will testify against me?\" Allah then questions the limbs about those actions in which the soul directed them. He says to the eye, \"Speak concerning what you were directed in.\" It says, \"O Lord, I was used to look at such-and-such an affair.\" The ear says, \"I was used to listen to such-and-such.\" The hand says, \"I was used to strike in such-and-such,\" and likewise the foot, the skins, and the tongues. Allah then says to the soul, \"Do you deny any of that?\" The soul is bewildered and says, \"No.\"\n\nThe limbs themselves do not know what obedience or disobedience is. Allah then says, \"Did I not tell you, through the tongue of My Messenger and in My Books, 'Do not look at this, nor listen to that, nor walk toward that, nor strike with that'?\"—detailing all the obligations related to the senses. Then He does the same concerning the inner realm (الباطن) regarding what was forbidden, such as bad suspicion and other matters.\n\nWhen the soul is tormented in the Abode of Wretchedness by the fire and various kinds of torment that touch the limbs, the limbs themselves find pleasure (تستعذب) in all the kinds of torment that befall them. It is called *azab* (torment) because the soul finds it painful, just as the keepers of the Fire find pleasure in executing vengeance for Allah. Likewise are the limbs, since Allah made them the locus (محلا) for vengeance against that soul which used to govern them.\n\nThe pains differ for the rational soul (النفس الناطقة) based on what it sees in its domain and what the animal spirit (الروح الحيواني) transmits to it. The sense (الحس) transmits the pains to the soul during those painful actions. But the limbs possess only perpetual bliss (النعيم الدائم) in Hell, just as the keepers of the Fire do, magnifying and glorifying Allah, finding pleasure in the actions performed upon them, just as they did in the world.\n\nMan imagines that the organ feels pain because of its own sensation of the pain, but this is not so. Rather, the soul is the one pained by what the limb carries. Do you not see that when a sick person sleeps—and there is no doubt that the sleeper is alive and the sense is present, and the wound that pains him while awake is still there—yet the organ feels no pain? This is because the one who finds the pain (the soul) has turned its attention away from the world of witnessing (عالم الشهادة) toward the Isthmus (البرزخ). It has no news of the physical pain, which is thus lifted from it. It remains in the Isthmus according to its state, either in a frightening dream, so it is pained, or in a pleasant dream, so it is in bliss. The pain or bliss moves with it wherever it moves. When the patient wakes up—which is the return of his soul to the world of witnessing—the pains and aches return to him.\n\nIf you are intelligent, it has become clear to you who among you carries the pain and senses it, and who neither carries nor senses it.\n\nIf the limbs felt pain, they would deny, just as the soul denies, and they would not testify against it. Allah the Exalted said: <<وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ>> (And you were not covering yourselves lest your hearing testify against you, or your sight, or your skins). And He said: <<إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولَئِكَ كَانَ عَنْهُ مَسْؤُولًا>> (Indeed, the hearing, the sight, and the heart—all those will be questioned). The subject of \"was\" (كان) is the soul. The soul is questioned about its hearing, sight, and heart, as we have established. It is said to it, \"What did you do with your subjects?\" Do you not see how, when a tyrannical governor is seized by the King and tormented upon the plea of his subjects, the subjects rejoice in the vengeance taken upon their governor? Likewise, on the Day of Resurrection, the joy and bliss of the limbs will be unveiled to you, due to what they see happening to the soul that governed them during its authority over them, because the sanctity of Allah is immense to the limbs.\n\nDo you not see how Allah causes disobedient believers to die in the Fire—a death like the sleep of the sick person here—so that they do not feel pain? This is Divine care for those who are not truly people of the Fire. When they turn to charcoal (حمما), they are removed from the Fire. If the limbs felt pain, Allah would have described them as feeling pain at that time, but no Book or Sunnah mentions this.\n\nIf you say, \"What is the benefit of burning them until they turn to charcoal?\" We say: Every locus (محل) gives its reality. That locus gives this effect in the forms. Do you not see that when a person sits in the sun, his face and body darken, while cloth spread in the sun and repeatedly wetted whitens as it dries? Was this effect given except by the specific locus and the specific temperament? Thus, the purpose was not torment. If it were, Allah would not cause them to die therein. The locus of life in the souls seeks bliss or pain according to the causes of pain or bliss.\n\nWhen Allah revives them and brings them out, and they see the change in their colors and that they have become charcoal, this distresses them. Then Allah bestows bliss upon them by giving them a form they find pleasing, re-creating them upon it, so they may know Allah's favor upon them when He transferred them from what distressed them to what pleased them.\n\nYou have learned, my brother, who among you is tormented and who is in bliss. You are nothing but yourself. Do not let your subjects testify against you, lest you incur loss. Allah has entrusted you with sovereignty and given you a Name from His Names, calling you an obeyed sovereign (ملكا مطاعا). Do not be tyrannical or unjust, for that is not the attribute of Him Who appointed you.\n\nIndeed, Allah deals with you based on a principle He applied to Himself: He made obligations upon Himself just as He made obligations upon you, and He entered into a covenant with you just as He brought you under the covenant. He commanded you nothing without placing a similar obligation upon Himself. This is so that He may have the conclusive argument (الحجة البالغة). He fulfilled everything He obligated upon Himself and demanded that you fulfill what He obligated upon you. All this He did so that you could not say, \"I am a servant upon whom obligations were placed, and I was not left to myself, but brought under covenant and obligation.\" Allah will say to him, \"Did I bring you into something I did not bring Myself into? Did I not obligate Myself just as I obligated you? Did I not enter into a covenant with you just as I brought you under My covenant, saying, 'If you fulfill My covenant, I will fulfill yours'?\"\n\nAllah the Exalted said: <<قُلْ>> (Say, O Muhammad) <<فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ>> (To Allah belongs the conclusive argument). This is the meaning of His saying: <<رَبِّ احْكُمْ بِالْحَقِّ>> (My Lord, judge by the Real/Truth). Does Allah judge by anything other than the Real? But in this verse, He made the Real (الحق) Himself commanded by His Prophet (PBUH), for the word *uhkum* (judge) is a command, and He commanded His Prophet to say it. Allah the Exalted said: <<قُلْ يَا مُحَمَّدُ رَبِّ احْكُمْ بِالْحَقِّ>>. There is no greater Divine descent (النزول الإلهي) to the servants than this. O servant, is this not from His generosity? Is this not from His kindness? Did He not fulfill everything He obligated upon Himself? Did He not fulfill the covenant of everyone who fulfilled their covenant with Him? Did He not pardon and forgive much of what He could have held His servants accountable for? Where are you? Where is your contemplation of this immense favor from an Overpowering, Capable Lord Who is neither opposed nor overcome?\n\n### That the Reason for Describing the Two Hands with Glorification is that they are Held by the Real\n\nKnow that the reason the Two Hands (القبضتين) are described as glorifying (التسبيح) is that they are held (مقبوضتين) by the Real (الحق تعالى). He placed the Two Hands in His Hand and said, \"These are for the Fire, and I care not; and these are for Paradise, and I care not.\" They know nothing but Allah, so they glorify and magnify Him because they are in His grasp and cannot exit the grasp.\n\nFurthermore, out of His generosity, Allah did not say, \"These are for torment, and I care not,\" and \"These are for bliss, and I care not.\" Rather, He attributed them to the two abodes (الدارين) so that they might populate them.\n\nIt is mentioned in the sound tradition that when Allah created Paradise and the Fire, He said to each, \"You have upon you your fullness,\" meaning, \"I shall fill you with inhabitants,\" since the habitation of an abode is by its residents, as the poet said:\n\n> And the habitation of homelands is by the inhabitants.\n\nBecause it is a locus, and it cannot be a locus except by dwelling therein. For this reason, Allah says to Hell, <<هَلِ امْتَلَأْتِ>> (Have you been filled?), and it replies, <<هَلْ مِنْ مَزِيدٍ>> (Is there any more?).\n\nWhen the Almighty (الجبار) places His Foot (قدمه) therein, it says, \"Enough for me, enough for me,\" and in a narration, \"Enough, enough,\" meaning it is full. He fills it with His Foot as He wills.\n\nThis refers to the creation of beings to populate it. Allah the Exalted said: <<أَنَّ لَهُمْ قَدَمَ صِدْقٍ>> (That for them is a Foot/Precedence of Truth), meaning a precedence by an affair He informed them of before granting it to them, and then He granted it, thus proving true what He promised them. He had promised the Fire that He would fill it. His filling it with His Foot means by the precedence of His word that He would fill it. He proved true to it by creating beings to populate it. The Foot is attributed to the Almighty (الجبار) because this Name signifies Majesty (العظمة), and the Fire originates from Majesty, while Paradise originates from Generosity (الكرم). Therefore, the Name Al-Jabbar is specifically associated with the Foot for the Fire.\n\nFrom this, one can perceive the universality and comprehensiveness of Mercy in both abodes, as He mentioned them and referred to their filling without mentioning pains or torments.\n\nThis is all under the dominion of His saying to His servants that His Mercy preceded His Wrath. The precedence is always the ruling factor. It is said that so-and-so has a precedence (سابقة قدم) in this matter. That is good tidings, if Allah wills.\n\nThe dwelling of the people of the Fire in the Fire is eternal (خالدِينَ فِيهَا), meaning in the Fire, just as the dwelling of the people of Paradise is eternal (خالدِينَ فِيهَا), meaning in Paradise. He did not say *fīhi* (in it, referring to the torment). If He had said *khālidīna fīhi* when mentioning the torment, the matter would be ambiguous. Since the pronoun refers back to the abode, torment is not necessarily implied. If someone argues that bliss is also not necessarily implied, we respond: We would agree, but since Allah the Exalted said concerning the bliss of Paradise that it is a gift <<غَيْرَ مَجْذُوذٍ>> (uninterrupted), and He said <<لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ>> (neither cut off nor forbidden), for this reason, we affirm the eternity in bliss and the abode. No such statement has ever been revealed concerning the torment of the Fire. Therefore, we do not affirm it.\n\nIf you say, \"But He said <<خَالِدِينَ فِيهِ وَسَاءَ لَهُمْ يَوْمَ الْقِيَامَةِ حِمْلًا>> (Abiding eternally therein, and evil for them will be that burden on the Day of Resurrection),\" we reply: That refers only to a specific station of the Afterlife, and the pronoun refers back to the burden (الوزر), not the torment. When they are made to carry the heavy burdens of their sins, they carry them, as He said: <<لَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ>> (They will surely carry their burdens and other burdens along with their burdens). This is a specific time. He says, *khālidīna fīhi* (abiding eternally therein), meaning in the carrying of the burden, from the moment they emerge from their graves until they reach the Fire and enter it. They are eternal in that duration; the burden is not lightened, nor is it taken from their backs by others. Allah the Exalted said: <<مَنْ أَعْرَضَ عَنْهُ فَإِنَّهُ يَحْمِلُ يَوْمَ الْقِيَامَةِ وِزْرًا خَالِدِينَ فِيهِ>> (Whoever turns away from it—indeed, he will carry on the Day of Resurrection a burden, abiding eternally therein). He made the pronoun refer back to the burden and assigned this carrying to the Day of Resurrection. The Day of Resurrection lasts from the people's emergence from their graves until they settle in their stations in Paradise or the Fire, and that Day concludes. With its conclusion, everything that occurred during it concludes, including the eternity of carrying burdens. When the Day ends, the eternity (of carrying burdens) loses its temporal container, and the ruling transfers to the Fire and the Gardens, and the torment and bliss specific to them.\n\nNothing has been revealed concerning the torment that indicates eternity therein, as has been revealed concerning eternity in the Fire (as the abode). Torment in the Fire is inevitable, but its duration has been concealed from us. We are not certain of its duration based on the texts, except that the apparent meanings (الظواهر) suggest a duration, but its quantity is unknown, as no text specifies it. The people of Unveiling (أهل الكشف) are all in agreement with the apparent meanings. They are decisive based on their unveiling, and this is accepted for them since no text contradicts them. We remain with His saying: <<إِنَّ رَبَّكَ فَعَّالٌ لِمَا يُرِيدُ>> (Indeed, your Lord is the Doer of what He intends). Whatever He intends, that is what it is. Nothing more is required of the people of faith unless a decisive, consecutively transmitted text providing certain knowledge arrives. Only then does the believer become decisive; otherwise, no.\n\nGlory be to the One glorified by every tongue, and indicated by every proof!\n\nThis station contains many sciences, among them:\n\nThe science of transcendence (علم التنزيه) appropriate for every world, for transcendence differs according to the worlds. Every world transcends the Real according to its knowledge of itself, transcending Him from everything that belongs to it, since everything belonging to it is originated (محدث). For this reason, the transcendence of the Real differs according to the glorifiers. For example, the accident (العرض) says: \"Glory be to Him Who does not require a locus (محل) for His existence.\" The substance (الجوهر) says: \"Glory be to Him Who does not require an originator (موجد) to bring Him into existence.\" The body (الجسم) says: \"Glory be to Him Who does not require an instrument (أداة) to hold Him.\" This confines transcendence to the fundamental categories, for there is nothing but substance, body, or accident. Then, each category is specific to matters that do not belong to others, so they glorify Allah from those attributes and from that station. The Perfect Human (الإنسان الكامل) glorifies Allah with all the glorifications of the cosmos (العالم) because he is a copy (نسخة) of it, as this has been unveiled to him.\n\nIt also contains the science of distinguishing things.\n\nIt contains the science of the Real created by which (علم الحق المخلوق به), which Abd al-Salam Abu al-Hakam Ibn Barrajān frequently refers to in his discourse, as does Imam Sahl ibn Abd Allah al-Tustarī, though Sahl calls it Justice (العدل) and Abu al-Hakam calls it the Real created by which, taking it from His saying: <<وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ>> (And We did not create the heavens and the earth and what is between them except with the Real/Truth). He has extensive and satisfying discourse on this.\n\nIt contains the science of the form (علم الصورة) and whether it is an accident or a substance, for people have differed on this.\n\nIt contains the science of the Return (علم الرجعة).\n\nIt contains the science of Knowledge (علم العلم)—i.e., by what is knowledge known?\n\nIt contains the science of the Unseen (الغيب) and the Witnessed (الشهادة).\n\nIt contains the science of Arrival (الورود) and Departure (الصدور).\n\nIt contains the science of Consideration/Reflection (الاعتبار) and its limit.\n\nIt contains the science of Tastes (الأذواق), which are the first beginnings of Theophany (التجلي).\n\nIt contains the science of Causes (العلل) and their levels, and who may be described by them and who may not.\n\nIt contains the science of the Theophany of Leadership (تجلى الزعامة), and whether its meaning is knowledge or not, and the Prophet's saying: \"The guarantor (الزعيم) is responsible,\" and the rank of the leader of the people, and why he is called a guarantor.\n\nIt contains the science of Faith (علم الايمان).\n\nIt contains the science of Light (علم النور), specifically the revealed Light (النور المنزل) and no other.\n\nIt contains the science of Expertise (الخبرة) and Mutual Information (المخابرة).\n\nIt contains the science of Profitable Trades (المتاجر المربحة), their times, and loss.\n\nIt contains the science of Promise (الوعد) and Threat (الوعيد).\n\nIt contains the science of Divine Permission (الإذن الإلهي), what it pertains to, whether it is general or specific, the difference between Command (الأمر) and Permission (الإذن), and whether disobedience occurs in Permission as it does in Command.\n\nIt contains the description of Knowledge with Comprehensiveness (الإحاطة).\n\nIt contains the science of Unity (التوحيد)—to what does it return?\n\nIt contains the science of Reliance (التوكل).\n\nIt contains the science of the ranks of creation in Sainthood (الولاية) and Enmity (العداوة).\n\nIt contains the science of Warning (الإنذار) and Caution (التحذير), whom to caution against, and what to caution against.\n\nIt contains the science of the difference between Ability (الاستطاعة) and the Real (الحق).\n\nIt contains the science of the nobility of the Attribute of Generosity (الكرم).\n\nIt contains the science of the reason for the Divine Demand (الطلب الإلهي) from the servants.\n\nIt contains the science of the results of Gratitude (الشكر).\n\nIt contains the science of the difference between Forbearance (الحلم) and Pardon (العفو).\n\nIt contains the science of the ordering of things.\n\nIt contains the science of the Most Protected Divine Veil (الحجاب الإلهي الأحمى).\n\nAnd Allah speaks the Truth, and He guides to the Way. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>>.",
    "ur": "باب نمبر تین سو بیس: دو مٹھیوں (القبضتان) کی تسبیح کے مقام کی معرفت اور ان میں تمیز کا بیان\n\nجس نے اخلاص کے ساتھ الحق (ذات حق) سے معاملہ کیا، اس نے نفع پایا۔\nاور اگر اس میں شرک بھی ہو تو الحق نے اسے معاف کر دیا۔\n\nعلم دو طرح کا ہے: موہوب (عطیہ کردہ) اور مکتسب (حاصل کردہ)۔\nاور بندے کو جو علم عطا کیا جائے، وہی بہترین علم ہے۔\n\nاسی طرح، علمِ کسب کا معلوم (معلوم علم) وزن میں کوئی حصہ نہیں رکھتا،\nکیونکہ بندے نے اس میں مشقت نہیں کی۔\n\nتمہارا دل غمگین ہوتا ہے اگر اس کا وزن ہلکا ہو،\nجیسا کہ خوش ہوتا ہے جب اس کا میزان بھاری ہو۔\n\nپس اپنی چقماق کو رگڑو، سستی نہ کرو، کیونکہ جو\nالحق (ذات حق) کی طرف کوشش کرتا ہے، اس کا مرتبہ اس سے زیادہ نہیں جو اس نے رگڑ کر حاصل کیا۔\n\nاس ذات میں غور و فکر کرنا جس کی کوئی شے مشابہ نہیں، جہالت ہے۔\nلہٰذا اگر عقل اس طرف مائل ہو تو اس کی طرف توجہ نہ دو۔\n\nاور محل (دل) کو خالی کرنے کے دروازے میں داخل ہو جاؤ،\nتم علم العیان (مشاہدے کا علم) دیکھو گے جب اس کا دروازہ کھل جائے گا۔\n\n### [بدبختوں کا گھر اور عذاب کے فرشتے نعمتوں کے گھر میں ہیں]\n\nجان لو کہ بدبختوں کا گھر (دار الأشقياء) اور عذاب کے فرشتے، وہ اللہ کی تعظیم اور تمجید میں اسی طرح مشغول ہیں جیسے نعمتوں کے گھر (دار النعيم) میں نعمت کے فرشتے۔ کوئی فرق نہیں، سب کے سب فرمانبردار بندے ہیں۔ ایک اللہ کے لیے نعمتیں دیتا ہے اور دوسرا اللہ کے لیے انتقام لیتا ہے۔ اسی طرح دو مٹھیاں (القبضتان) ہیں، جو دو عالم ہیں: عالمِ سعادت اور عالمِ شقاوت۔ ان میں کوئی عضو (جارحہ) یا کوئی جوہرِ فرد ایسا نہیں جو اللہ کی تسبیح نہ کر رہا ہو اور اس کے جلال کی تقدیس نہ کر رہا ہو، مگر وہ اس بات سے بے خبر ہے کہ اس کا مدبر، مکلف نفس (النفس) اسے کس چیز میں استعمال کر رہا ہے، جسے اللہ تعالیٰ نے اپنی عبادت اور ان اعضاء (جوارح) اور عالمِ ظاہر کے ساتھ اس حد پر قائم رہنے کا مکلف بنایا ہے جو اس کے لیے مقرر کی گئی ہے۔ اگر اعضاء (جوارح) وہ جان لیتے جو نفس (النفس) جانتا ہے کہ کون سی چیز معصیت ہے اور کون سی طاعت، تو وہ ہرگز اس کی مخالفت پر اس کا ساتھ نہ دیتے۔ کیونکہ وہ موجودات میں سے کسی چیز کا مشاہدہ نہیں کرتے مگر یہ کہ وہ اللہ کی تسبیح کر رہی ہو اور اس کے جلال کی تقدیس کر رہی ہو۔ تاہم، انہیں حفظ کی عظیم قوت عطا کی گئی ہے، لہٰذا نفس (النفس) انہیں جس کام میں بھی استعمال کرتا ہے، وہ اس کام کو محفوظ رکھتے ہیں اور اسے جانتے ہیں۔ اور نفس (النفس) جانتا ہے کہ یہ طاعت ہے یا معصیت۔\n\nپس جب قیامت کے دن اس نفس سے سوال کے وقت انکار واقع ہوگا، تو اللہ اس سے فرمائے گا: ہم تم پر تمہاری ذات میں سے ایک گواہ بھیجتے ہیں۔ وہ اپنے دل میں کہے گا: مجھ پر کون گواہی دے گا؟ تب اللہ تعالیٰ اعضاء (جوارح) سے ان افعال کے بارے میں سوال کرے گا جن میں نفس نے انہیں استعمال کیا تھا۔ اللہ آنکھ سے فرمائے گا: بتاؤ، تمہیں کس چیز میں استعمال کیا گیا؟ وہ عرض کرے گی: اے میرے رب! مجھ سے فلاں فلاں چیز کی طرف دیکھا گیا۔ کان کہے گا: مجھ سے فلاں فلاں چیز سنی گئی۔ ہاتھ کہے گا: مجھ سے فلاں فلاں چیز پر ظلم کیا گیا۔ اور پاؤں بھی اسی طرح کہیں گے، اور کھالیں بھی اسی طرح، اور زبانیں بھی اسی طرح۔ تب اللہ اس (نفس) سے فرمائے گا: کیا تم ان میں سے کسی چیز کا انکار کرتے ہو؟ وہ حیران ہو کر کہے گا: نہیں۔ حالانکہ اعضاء (جوارح) طاعت اور معصیت کو نہیں جانتے۔ تب اللہ فرمائے گا: کیا میں نے تمہیں اپنے رسول کی زبان سے اور اپنی کتابوں میں نہیں کہا تھا کہ فلاں چیز کی طرف نہ دیکھو، فلاں چیز نہ سنو، فلاں چیز کی طرف نہ چلو، اور فلاں چیز پر ظلم نہ کرو؟ اور اللہ اسے تمام وہ چیزیں گنوا دے گا جو حواس سے متعلقہ تکلیف (مکلفیت) سے وابستہ تھیں۔ پھر اسی طرح باطن میں بھی کرے گا، ان چیزوں کے بارے میں جن سے منع کیا گیا تھا، جیسے بدگمانی وغیرہ۔\n\nپس جب نفس کو بدبختی کے گھر (دار الشقاء) میں آگ اور طرح طرح کے عذابوں سے عذاب دیا جائے گا جو اعضاء (جوارح) کو چھوئیں گے، تو اعضاء (جوارح) اپنے اوپر آنے والے ہر قسم کے عذاب کو لذیذ سمجھیں گے۔ اسی لیے اسے عذاب (عذاب) کہا گیا ہے، کیونکہ وہ اسے لذیذ سمجھتے ہیں، جیسا کہ دوزخ کے داروغے اسے لذیذ سمجھتے ہیں جب وہ اللہ کے لیے انتقام لیتے ہیں۔ اسی طرح اعضاء (جوارح) بھی، کیونکہ اللہ نے انہیں اس نفس سے انتقام لینے کا محل بنایا ہے جو ان پر حکومت کرتا تھا۔ اور ناطق نفس پر درد مختلف ہوتا ہے، اس چیز کی وجہ سے جو وہ اپنی بادشاہت میں دیکھتا ہے اور اس چیز کی وجہ سے جو حیوانی روح اس تک منتقل کرتی ہے۔ کیونکہ حس (احساس) نفس تک ان تکلیف دہ افعال میں درد منتقل کرتا ہے۔ جبکہ اعضاء (جوارح) کے پاس جہنم میں دائمی نعمت کے سوا کچھ نہیں، جیسا کہ داروغے اس پر قائم ہیں، اللہ کی تمجید اور تسبیح کر رہے ہیں، اور ان افعال کو لذیذ سمجھ رہے ہیں جو ان کے ساتھ ہو رہے ہیں، جیسا کہ وہ دنیا میں تھے۔ پس انسان یہ خیال کرتا ہے کہ عضو اپنے اندر درد محسوس کرنے کی وجہ سے تکلیف میں ہے، حالانکہ ایسا نہیں ہے۔ بلکہ تکلیف میں وہ (نفس) ہے جسے عضو اٹھائے ہوئے ہے۔ کیا تم مریض کو نہیں دیکھتے جب وہ سو جاتا ہے؟ بلاشبہ سونے والا زندہ ہے اور حس (احساس) اس کے پاس موجود ہے، اور وہ زخم بھی موجود ہے جس سے وہ بیداری میں تکلیف محسوس کرتا ہے، اس کے باوجود عضو کوئی درد محسوس نہیں کرتا۔ کیونکہ درد پانے والا (نفس) اپنا رخ عالمِ شہود سے برزخ کی طرف پھیر چکا ہے، لہٰذا اسے کوئی خبر نہیں ہوتی۔ پس اس سے حسی درد ختم ہو جاتے ہیں، اور وہ برزخ میں اس حالت پر رہتا ہے جو اس پر ہوتی ہے، یا تو خوفناک خواب میں ہوتا ہے تو تکلیف پاتا ہے، یا اچھے خواب میں ہوتا ہے تو نعمت پاتا ہے۔ پس درد یا نعمت اس کے ساتھ منتقل ہو جاتی ہے جہاں وہ منتقل ہوتا ہے۔ جب مریض بیدار ہوتا ہے، جو کہ اس کے نفس کا عالمِ شہود کی طرف لوٹنا ہے، تو درد اور تکلیفیں اس پر قائم ہو جاتی ہیں۔ پس اگر تم عقل مند ہو تو تمہارے لیے واضح ہو گیا کہ تم میں سے درد کون اٹھاتا ہے اور کون اسے محسوس کرتا ہے، اور کون اسے نہ اٹھاتا ہے اور نہ محسوس کرتا ہے۔\n\nاور اگر اعضاء (جوارح) تکلیف محسوس کرتے تو وہ انکار کرتے جیسا کہ نفس (النفس) انکار کرتا ہے، اور وہ اس کے خلاف گواہی نہ دیتے۔ اللہ تعالیٰ فرماتا ہے: **\"اور تم اس سے چھپتے نہ تھے کہ تمہارے کان، تمہاری آنکھیں اور تمہاری کھالیں تمہارے خلاف گواہی دیں۔\" (وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ)** اور فرمایا: **\"بے شک کان، آنکھ اور دل، ان سب کے بارے میں پوچھا جائے گا۔\" (إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولَئِكَ كَانَ عَنْهُ مَسْئُولًا)** یہاں \"کان\" کا اسمِ کان (فعل ناقص کا اسم) نفس ہے، نفس سے اس کے کان، اس کی آنکھ اور اس کے دل کے بارے میں پوچھا جائے گا، جیسا کہ ہم نے بیان کیا۔ اس سے کہا جائے گا: تم نے اپنی رعایا کے ساتھ کیا کیا؟ کیا تم ظالم حاکم کو نہیں دیکھتے جب بادشاہ اسے پکڑتا ہے اور اس کی رعایا کی فریاد پر اسے عذاب دیتا ہے، تو رعایا اپنے حاکم سے انتقام لیے جانے پر کس طرح خوش ہوتی ہے؟ اسی طرح قیامت کے دن تمہارے لیے اعضاء (جوارح) کی خوشی اور نعمت کا انکشاف کیا جائے گا، اس چیز کی وجہ سے جو وہ اس نفس میں دیکھیں گے جو ان پر اپنی ولایت میں حکومت کرتا تھا، کیونکہ اعضاء (جوارح) کے نزدیک اللہ کا احترام بہت عظیم ہے۔ کیا تم مومن گناہ گاروں کو نہیں دیکھتے کہ اللہ انہیں دوزخ میں موت دے دیتا ہے، جیسا کہ مریض یہاں سو جاتا ہے، تاکہ وہ درد محسوس نہ کریں، یہ اللہ کی طرف سے ان لوگوں پر عنایت ہے جو اہل دوزخ میں سے نہیں ہیں۔ یہاں تک کہ جب وہ کوئلہ بن جائیں گے تو انہیں دوزخ سے نکال لیا جائے گا۔ اگر اعضاء (جوارح) تکلیف محسوس کرتے تو اللہ اس وقت انہیں تکلیف میں مبتلا ہونے سے موصوف کرتا، حالانکہ اس بارے میں نہ کوئی کتاب (قرآن) وارد ہوئی ہے اور نہ کوئی سنت۔ اگر تم کہو کہ انہیں جلانے کا کیا فائدہ یہاں تک کہ وہ کوئلہ بن جائیں؟ ہم کہیں گے: ہر محل اپنی حقیقت عطا کرتا ہے۔ پس وہ محل (جسم) صورتوں میں یہ فعل عطا کرتا ہے۔ کیا تم نہیں دیکھتے کہ جب انسان دھوپ میں بیٹھتا ہے تو اس کا چہرہ اور بدن سیاہ ہو جاتا ہے؟ اور کپڑا جب دھوپ میں پھیلایا جاتا ہے اور اسے پانی سے تر کیا جاتا ہے، تو جب بھی وہ سوکھتا ہے تو سفید ہو جاتا ہے۔ تو کیا یہ چیزیں مخصوص محل اور مخصوص مزاج کے سوا کسی اور نے عطا کی ہیں؟ پس مقصود عذاب نہیں تھا، اور اگر ہوتا تو اللہ انہیں اس میں موت نہ دیتا۔ کیونکہ نفوس میں زندگی کا محل، تکلیف دہ اور نعمت بخش اسباب کے مطابق نعمت یا درد کا طالب ہوتا ہے۔ پس انہیں ڈال دیا گیا، بلکہ وہ اس چیز سے موصوف ہیں جو ہم نے ذکر کی۔ اور جب اللہ تعالیٰ انہیں زندہ کرے گا اور نکالے گا، اور وہ اپنے رنگوں کی تبدیلی اور کوئلہ بن جانے کو دیکھیں گے، تو یہ چیز انہیں ناگوار گزرے گی۔ تب اللہ انہیں اس صورت پر نعمت عطا کرے گا جسے وہ پسند کرتے ہیں، اور انہیں اس پر پیدا کرے گا، تاکہ وہ اللہ کی نعمت کو جانیں جب اس نے انہیں اس چیز سے منتقل کیا جو انہیں ناگوار تھی، اس چیز کی طرف جو انہیں خوش کرتی ہے۔\n\nپس اے میرے بھائی! اگر تم عقل مند ہو تو تم نے جان لیا کہ تم میں سے کون عذاب پاتا ہے اور کون نعمت پاتا ہے، اور تم تمہارے سوا کچھ نہیں۔ پس اپنی رعایا کو اپنے خلاف گواہی دینے کا موقع نہ دو، ورنہ تم خسارے میں پڑ جاؤ گے۔ اللہ نے تمہیں بادشاہت عطا کی ہے اور تمہیں اپنے ناموں میں سے ایک نام دیا ہے، پس تمہیں مطاع بادشاہ (ملک مطاع) کہا ہے۔ لہٰذا ظلم نہ کرو اور نہ ہی حد سے تجاوز کرو، کیونکہ یہ اس کی صفت نہیں جس نے تمہیں والی بنایا ہے۔ اور اللہ تمہارے ساتھ اس معاملے سے پیش آتا ہے جس سے اس نے خود اپنے ساتھ معاملہ کیا ہے، پس اس نے خود پر واجب کیا جیسا کہ تم پر واجب کیا، اور وہ تمہارے ساتھ عہد کے تحت داخل ہوا جیسا کہ اس نے تمہیں عہد کے تحت داخل کیا۔ پس اس نے تمہیں کسی چیز کا حکم نہیں دیا مگر یہ کہ اس نے خود پر بھی اسی طرح کی چیز لازم کر لی۔ یہ اس لیے ہے تاکہ اس کی طرف سے **حجت بالغہ (الحجۃ البالغۃ)** قائم ہو جائے۔ اور اس نے ہر اس چیز کو پورا کیا جو اس نے خود پر واجب کی تھی، اور تم سے اس چیز کو پورا کرنے کا مطالبہ کیا جو اس نے تم پر واجب کی تھی۔ یہ سب کچھ اس نے اس لیے کیا تاکہ تم یہ نہ کہو کہ میں ایک بندہ ہوں جس پر فلاں فلاں چیز واجب کی گئی ہے اور مجھے میرے نفس پر نہیں چھوڑا گیا، بلکہ مجھے عہد اور وجوب کے تحت داخل کر دیا گیا ہے۔ تب اللہ اس سے فرمائے گا: کیا میں نے تمہیں اس چیز میں داخل کیا جس میں میں نے خود کو داخل نہیں کیا؟ کیا میں نے خود پر واجب نہیں کیا جیسا کہ تم پر واجب کیا؟ کیا میں نے خود کو تمہارے عہد کے تحت داخل نہیں کیا جیسا کہ تمہیں اپنے عہد کے تحت داخل کیا؟ اور میں نے تم سے کہا تھا کہ اگر تم میرے عہد کو پورا کرو گے تو میں تمہارے عہد کو پورا کروں گا۔ اللہ تعالیٰ فرماتا ہے: **\"کہہ دیجیے (اے محمد): پس اللہ ہی کے لیے حجت بالغہ (الحجۃ البالغۃ) ہے۔\" (قُلْ يَا مُحَمَّدُ فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ)** اور یہ اللہ تعالیٰ کے اس قول کا مفہوم ہے: **\"اے میرے رب! حق کے ساتھ فیصلہ فرما۔\" (رَبِّ احْكُمْ بِالْحَقِّ)** اور کیا اللہ حق کے سوا فیصلہ کرتا ہے؟ لیکن اس آیت میں اس نے حق (الحق) کو اپنے نبی علیہ السلام کے لیے مامور بنا دیا ہے، کیونکہ لفظ \"احکم\" (فیصلہ فرما) امر (حکم) ہے، اور اس نے اپنے نبی کو حکم دیا کہ وہ اس سے یہ کہیں۔ اللہ تعالیٰ فرماتا ہے: **\"کہہ دیجیے (اے محمد): اے میرے رب! حق کے ساتھ فیصلہ فرما۔\" (قُلْ يَا مُحَمَّدُ رَبِّ احْكُمْ بِالْحَقِّ)** اور اس سے زیادہ بندوں کے لیے الٰہی نزول (تنزّل) اور کیا ہو سکتا ہے؟ اے بندے! کیا یہ اس کے کرم میں سے نہیں؟ کیا یہ اس کی مہربانی میں سے نہیں؟ کیا اس نے ہر وہ چیز پوری نہیں کی جو اس نے خود پر واجب کی تھی؟ کیا اس نے ہر اس شخص کا عہد پورا نہیں کیا جس نے اس کا عہد پورا کیا؟ کیا اس نے بہت سی چیزوں سے درگزر نہیں کیا اور معاف نہیں کیا جن پر اگر وہ چاہتا تو اپنے بندوں کو پکڑ سکتا تھا؟ تم کہاں ہو؟ تمہاری نظر اس عظیم فضل پر کہاں ہے جو ایک قاہر، قادر رب کی طرف سے ہے جسے کوئی چیلنج نہیں کر سکتا اور نہ ہی مغلوب کر سکتا ہے۔\n\n### [دو مٹھیوں (القبضتان) کو تسبیح سے موصوف کرنے کی وجہ یہ ہے کہ وہ الحق (ذات حق) کے لیے مقبوض ہیں]\n\nاور جان لو کہ دو مٹھیوں (القبضتان) کو تسبیح (التسبيح) سے موصوف کرنے کی وجہ یہ ہے کہ وہ الحق (ذات حق) کے لیے مقبوض ہیں۔ پس اس نے دونوں مٹھیوں کو اپنے ہاتھ میں رکھا اور فرمایا: یہ آگ کے لیے ہیں اور مجھے پرواہ نہیں، اور یہ جنت کے لیے ہیں اور مجھے پرواہ نہیں۔ پس انہوں نے اللہ کے سوا کسی کو نہیں جانا، لہٰذا وہ اس کی تسبیح اور تمجید کرتے ہیں، کیونکہ وہ اس کی گرفت میں ہیں اور اس گرفت سے ان کا کوئی خروج نہیں۔ پھر اللہ نے اپنے کرم سے یہ نہیں فرمایا کہ: یہ عذاب کے لیے ہیں اور مجھے پرواہ نہیں، اور یہ نعمت کے لیے ہیں اور مجھے پرواہ نہیں۔ بلکہ اس نے انہیں دونوں گھروں (دارین) سے منسوب کیا تاکہ وہ انہیں آباد کریں۔\n\nاور اسی طرح صحیح حدیث میں آیا ہے کہ جب اللہ نے جنت اور دوزخ کو پیدا کیا تو ان میں سے ہر ایک سے فرمایا: \"اسے بھرنا مجھ پر لازم ہے۔\" یعنی میں اسے باشندوں سے بھر دوں گا، کیونکہ گھر کی آبادی اس کے رہنے والوں سے ہوتی ہے، جیسا کہ شاعر نے کہا:\n\n**\"اور وطنوں کی آبادی باشندوں سے ہے۔\" (وعمارة الأوطان بالسكان)**\n\nکیونکہ وہ ایک محل (جگہ) ہے اور اس میں حلول کیے بغیر وہ محل نہیں بن سکتی۔ اسی لیے اللہ جہنم سے فرماتا ہے: **\"کیا تو بھر گئی؟\" (هَلِ امْتَلَأْتِ)** تو وہ کہتی ہے: **\"کیا مزید ہے؟\" (هَلْ مِنْ مَزِيدٍ)**\n\nپس جب جبار (الجبار) اس میں اپنا قدم (قدم) رکھے گا تو وہ کہے گی: بس، بس (قطني قطني)۔ اور ایک روایت میں ہے: بس، بس (قط قط)۔ یعنی وہ بھر گئی ہے۔ پس اس نے اسے اپنے قدم سے بھر دیا، جیسا کہ وہ سبحانہ چاہتا ہے۔\n\nجو اس بات کو جانتا ہے، تو اللہ اس میں مخلوق پیدا کرتا ہے جو اسے آباد کرتی ہے۔ اللہ تعالیٰ فرماتا ہے: **\"بے شک ان کے لیے قدمِ صدق (قَدَمَ صِدْقٍ) ہے۔\"** یعنی ایک سابقہ (پیش قدمی) ہے ایک ایسے امر کے ساتھ جس کی خبر اس نے انہیں عطا کرنے سے پہلے دی تھی، پھر انہیں عطا کیا۔ پس اس نے اپنے وعدے میں سچ کر دکھایا۔ اور اس نے دوزخ سے وعدہ کیا تھا کہ وہ اسے بھر دے گا۔ پس اس کا اسے اپنے قدم سے بھرنا، یعنی اس کے سابقہ قول کی وجہ سے کہ وہ اسے بھر دے گا، پس اس نے اس کے لیے اس وعدے کو سچ کر دکھایا کہ اس میں ایسی مخلوق پیدا کی جو اسے آباد کرتی ہے۔ اور قدم (القدم) کو جبار (الجبار) سے منسوب کیا، کیونکہ یہ نام عظمت کے لیے ہے، اور دوزخ عظمت سے موجود ہوئی ہے، اور جنت کرم سے موجود ہوئی ہے۔ اسی لیے جبار (الجبار) کا نام دوزخ کے لیے قدم (القدم) کے ساتھ خاص ہوا اور اسے اپنی طرف منسوب کیا۔ اس سے دونوں گھروں میں رحمت کی عمومیت اور شمولیت کا سکون ملتا ہے، جہاں اس نے ان دونوں کا ذکر کیا اور دردوں کے ذکر سے تعرض نہیں کیا، اور ان کے بھرنے کی بات کی، اور کسی بھی چیز کا ذکر نہیں کیا۔\n\nاور یہ سب کچھ اس کے اس فرمان کے دائرہ اختیار میں ہے جو اس نے اپنے بندوں سے فرمایا کہ **\"اس کی رحمت اس کے غضب پر سبقت لے گئی ہے۔\"** پس سبقت ہمیشہ حاکم ہوتی ہے۔ اور کہا جاتا ہے کہ فلاں شخص کے لیے اس معاملے میں قدمِ سابقہ (سابقہ قدم) ہے۔ پس یہ ان شاء اللہ بشارت ہے۔ اور اہل دوزخ کا دوزخ میں رہنا ایسا ہے کہ وہ اس سے نہیں نکلیں گے، جیسا کہ اللہ تعالیٰ نے فرمایا: **\"وہ اس میں ہمیشہ رہنے والے ہوں گے۔\" (خَالِدِينَ فِيهَا)** یعنی دوزخ میں۔ اور **\"وہ اس میں ہمیشہ رہنے والے ہوں گے۔\" (خَالِدِينَ فِيهَا)** یعنی جنت میں۔ اور اس نے یہ نہیں فرمایا کہ \"اس میں\" (فیہ) اور اس سے عذاب مراد لیا ہو۔ اگر وہ عذاب کے ذکر کے وقت \"خالدین فیہ\" (اس میں ہمیشہ رہنے والے) فرماتا تو معاملہ مشتبہ ہو جاتا۔ اور جب اس نے ضمیر کو گھر (دار) کی طرف لوٹایا تو عذاب لازم نہیں آیا۔ اگر کوئی کہنے والا کہے کہ اسی طرح نعمت بھی لازم نہیں آئی جیسا کہ عذاب لازم نہیں آیا؟ ہم کہیں گے: ہم بھی یہی کہتے، لیکن جب اللہ تعالیٰ نے جنت کی نعمت کے بارے میں فرمایا کہ یہ **\"نہ ختم ہونے والا عطیہ (عَطَاءً غَيْرَ مَجْذُوذٍ)\"** ہے، یعنی نہ کٹنے والا عطیہ، اور فرمایا: **\"نہ کٹنے والی اور نہ روکی جانے والی۔\" (لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ)** اس لیے ہم نے نعمت اور گھر میں خلود (ہمیشگی) کا قول کیا۔ اور دوزخ کے عذاب میں اس طرح کی کوئی چیز ہرگز وارد نہیں ہوئی، اس لیے ہم نے اس کا قول نہیں کیا۔ اگر تم کہو کہ اللہ نے تو فرمایا ہے: **\"وہ اس میں ہمیشہ رہنے والے ہوں گے، اور قیامت کے دن یہ ان کے لیے برا بوجھ ہے۔\" (خَالِدِينَ فِيهِ وَسَاءَ لَهُمْ يَوْمَ الْقِيَامَةِ حِمْلًا)** ہم کہیں گے: یہ صرف آخرت کے ایک مقام میں ہے، اور ضمیر (فِيهِ) عذاب کی طرف نہیں بلکہ بوجھ (وزر) کی طرف لوٹتا ہے۔ پس جب انہیں ان بوجھوں کو اٹھانے کے لیے کھڑا کیا جائے گا جو ان کے گناہ ہیں، تو وہ انہیں اٹھائیں گے، جیسا کہ فرمایا: **\"وہ ضرور اپنے بوجھ اٹھائیں گے اور اپنے بوجھوں کے ساتھ مزید بوجھ بھی۔\" (لَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ)** اور **\"اور قیامت کے دن ان سے ضرور پوچھا جائے گا جو وہ جھوٹ گھڑتے تھے۔\" (وَلَيُسْأَلُنَّ يَوْمَ الْقِيَامَةِ عَمَّا كَانُوا يَفْتَرُونَ)** اور یہ ایک مخصوص وقت ہے، پس وہ فرماتا ہے: **\"وہ اس میں ہمیشہ رہنے والے ہوں گے۔\" (خَالِدِينَ فِيهِ)** یعنی بوجھ اٹھانے میں، اس جگہ سے جہاں سے وہ اسے اٹھائیں گے، یعنی اپنی قبروں سے نکلنے سے لے کر دوزخ تک پہنچنے اور اس میں داخل ہونے تک۔ پس وہ اس مدت میں ہمیشہ رہنے والے ہوں گے، نہ ان سے یہ بوجھ ہلکا کیا جائے گا اور نہ ہی کوئی دوسرا اسے ان کی پیٹھ سے لے گا۔ اللہ تعالیٰ فرماتا ہے: **\"اور جو اس سے منہ موڑے گا، تو بے شک وہ قیامت کے دن بوجھ اٹھائے گا۔ وہ اس میں ہمیشہ رہنے والے ہوں گے۔\" (مَنْ أَعْرَضَ عَنْهُ فَإِنَّهُ يَحْمِلُ يَوْمَ الْقِيَامَةِ وِزْرًا خَالِدِينَ فِيهِ)** پس اس نے ضمیر کو بوجھ (وزر) کی طرف لوٹایا اور اس بوجھ کو قیامت کے دن کے لیے قرار دیا۔ اور قیامت کا دن لوگوں کے قبروں سے نکلنے سے لے کر جنت اور دوزخ میں اپنی منزلوں پر اترنے تک کی مدت ہے۔ اور وہ دن ختم ہو جائے گا، اور اس کے ختم ہونے سے وہ سب کچھ ختم ہو جائے گا جو اس میں تھا، اور جو کچھ اس میں تھا ان میں اوزار (بوجھ) اٹھانے میں خلود بھی تھا۔ پس جب دن ختم ہو گیا تو خلود کے لیے کوئی ظرف باقی نہ رہا جس میں وہ ہو، اور حکم دوزخ اور جنت اور ان سے مخصوص عذاب اور نعمت کی طرف منتقل ہو گیا۔ اور عذاب کے بارے میں کوئی ایسی چیز وارد نہیں ہوئی جو اس میں خلود (ہمیشگی) پر دلالت کرے، جیسا کہ دوزخ میں خلود کے بارے میں وارد ہوا ہے۔ لیکن دوزخ میں عذاب ناگزیر ہے، اور اس کی مدت ہم سے پوشیدہ رکھی گئی ہے۔ اور ہم اس کے بارے میں نصوص کی رو سے یقین پر نہیں ہیں، سوائے اس کے کہ ظواہر اس میں مدت (اجل) کو ظاہر کرتے ہیں، لیکن اس کی مقدار نامعلوم ہے، اس بارے میں کوئی نص وارد نہیں ہوئی۔ اور اہل کشف (الکشف) سب کے سب ظواہر کے ساتھ متفق ہیں، پس وہ اپنے کشف (الکشف) کی رو سے قطعی ہیں، اور ان کے لیے یہ بات تسلیم کی جاتی ہے کیونکہ کوئی نص ان سے متصادم نہیں ہوتی۔ اور ہم اللہ تعالیٰ کے اس قول کے ساتھ رہتے ہیں: **\"بے شک تمہارا رب جو چاہتا ہے وہ کر گزرتا ہے۔\" (إِنَّ رَبَّكَ فَعَّالٌ لِمَا يُرِيدُ)** اور جو کچھ وہ چاہتا ہے، وہی ہوتا ہے۔ اور اہل ایمان پر اس سے زیادہ لازم نہیں، سوائے اس کے کہ کوئی متواتر نص آئے جو علم کا فائدہ دے، تب مومن قطعی ہو جائے گا، ورنہ نہیں۔ پس پاک ہے وہ ذات جو ہر زبان سے تسبیح کی جاتی ہے اور ہر دلیل سے جس پر دلالت کی جاتی ہے۔\n\nاور یہ مقام (منزل) بہت سے علوم پر مشتمل ہے، جن میں سے ایک علمِ تنزیہ (التنزیہ) ہے جو ہر عالم کے لائق ہے۔ کیونکہ تنزیہ عوالم کے اختلاف سے مختلف ہوتا ہے۔ اور ہر عالم الحق (ذات حق) کی تنزیہ اپنی ذات کے علم کے مطابق کرتا ہے، پس وہ اسے ہر اس چیز سے پاک قرار دیتا ہے جو اس پر ہے، کیونکہ جو کچھ اس پر ہے وہ حادث (محدث) ہے۔ پس وہ الحق کو حوادث کے اس کے ساتھ قائم ہونے سے پاک قرار دیتا ہے، میرا مطلب وہ حوادث ہیں جو اس کے ساتھ خاص ہیں۔ اسی لیے الحق کی تنزیہ، تنزیہ کرنے والوں کے اختلاف سے مختلف ہوتی ہے۔ پس عرض (صفت) کہتا ہے: پاک ہے وہ ذات جسے اپنے وجود میں کسی محل کی ضرورت نہیں جس کے ذریعے اس کا ظہور ہو۔ اور جوہر کہتا ہے: پاک ہے وہ ذات جسے اپنے وجود میں کسی موجد کی ضرورت نہیں جو اسے وجود بخشے۔ اور جسم کہتا ہے: پاک ہے وہ ذات جسے اپنے وجود میں کسی آلے کی ضرورت نہیں جو اسے تھامے۔ یہ تنزیہ کی تقسیم امہات (بنیادی اقسام) کے لحاظ سے ہے، کیونکہ وہاں جوہر، جسم یا عرض کے سوا کچھ نہیں۔ پھر ہر صنف ان امور کے ساتھ خاص ہوتی ہے جو دوسروں کے لیے نہیں ہوتیں۔ پس اللہ نے ان صفات اور اس مقام سے پاکی بیان کی۔ اور **انسان کامل (الإنسان الکامل)** تمام عالم کی تسبیحات کے ساتھ اللہ کی تسبیح کرتا ہے، کیونکہ وہ اس کی نقل (نسخہ) ہے، جب اس کے لیے اس کا کشف (الکشف) کیا گیا۔\n\nاور یہ مقام علوم میں سے اشیاء میں تمیز کے علم پر مشتمل ہے۔ اور یہ الحق المخلوق بہ (وہ حق جس کے ذریعے مخلوق پیدا کی گئی) کے علم پر مشتمل ہے، جس کی طرف عبد السلام ابو الحکم ابن برجان اپنی گفتگو میں کثرت سے اشارہ کرتے ہیں۔ اور اسی طرح امام سہل بن عبد اللہ تستری بھی، لیکن سہل اسے عدل (العدل) کہتے ہیں اور ابو الحکم اسے الحق المخلوق بہ کہتے ہیں، جو انہوں نے اللہ کے اس قول سے لیا ہے: **\"اور ہم نے آسمانوں اور زمین کو اور جو کچھ ان کے درمیان ہے، حق (الحق) کے سوا پیدا نہیں کیا۔\" (وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ)** اور اس بارے میں ان کی بڑی اور شافی گفتگو ہے۔ اور یہ مقام صورت (الصورة) کے علم پر مشتمل ہے، اور آیا وہ عرض ہے یا جوہر، کیونکہ لوگوں نے اس بارے میں اختلاف کیا ہے۔ اور اس میں رجعت (الرجعة) کا علم ہے۔ اور اس میں علم کا علم ہے، یعنی علم کس چیز سے جانا جاتا ہے۔ اور اس میں غیب اور شہود کا علم ہے۔ اور اس میں ورود اور صدور کا علم ہے۔ اور اس میں اعتبار کا علم اور اس کی حد کیا ہے۔ اور اس میں اذواق (الأذواق) کا علم ہے، جو ظہور الٰہی (التجلی) کی پہلی ابتداء ہیں۔ اور اس میں علتوں (العلل) کا علم اور ان کے مراتب ہیں، اور کون ان سے موصوف ہو سکتا ہے اور کون نہیں۔\n\nاور اس میں زعامت (الزعامۃ) کے ظہور الٰہی (تجلی) کا علم ہے، اور آیا اس کا مدلول علم ہے یا نہیں، اور نبی علیہ السلام کا قول: \"ضامن (الزعیم) تاوان بھرنے والا ہے،\" اور قوم کے ضامن کا مرتبہ کیا ہے اور اسے ضامن کیوں کہا گیا؟ اور اس میں ایمان کا علم ہے۔ اور اس میں صرف نور (النور) کا علم ہے، لیکن صرف نورِ منزل (نازل کردہ نور) کا۔ اور اس میں خبرہ اور مخابرہ کا علم ہے۔ اور اس میں نفع بخش تجارتوں اور ان کے اوقات اور خسارے کا علم ہے۔ اور اس میں وعدہ اور وعید کا علم ہے۔ اور اس میں الٰہی اذن (الإذن الإلهي) کا علم ہے، اور وہ کس چیز میں ہوتا ہے، اور آیا وہ عام ہے یا خاص، اور امر (حکم) اور اذن (اجازت) کے درمیان فرق کیا ہے، اور کیا اذن میں نافرمانی کی جاتی ہے جیسا کہ امر میں کی جاتی ہے یا نہیں؟ اور اس میں علم کو احاطہ سے موصوف کرنے کا علم ہے۔ اور اس میں توحید (التوحید) کا علم ہے کہ وہ کس چیز کی طرف لوٹتی ہے۔ اور اس میں توکل (التوکل) کا علم ہے۔ اور اس میں ولایت اور عداوت میں مخلوق کے مراتب کا علم ہے۔ اور اس میں انذار اور تحذیر کا علم ہے، اور کس سے ڈرایا جاتا ہے اور کس چیز سے ڈرایا جاتا ہے۔ اور اس میں استطاعت اور الحق (ذات حق) کے درمیان فرق کا علم ہے۔ اور اس میں صفتِ کرم کی شرافت کا علم ہے۔ اور اس میں بندوں سے الٰہی طلب (مطالبہ) کی وجہ کا علم ہے۔ اور اس میں شکر کے نتائج کا علم ہے۔ اور اس میں حلم اور عفو کے درمیان فرق کا علم ہے۔ اور اس میں اشیاء کی ترتیب کا علم ہے۔ اور اس میں الٰہی حجابِ احمیٰ (الأحمى) کا علم ہے۔ اور **\"اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)**",
    "fa": "باب سیصد و بیستم در معرفت منزل تسبیح دو قبضه (القبضتان) و تمییز آن‌ها\n\nآنکه با حق (الحق) به اخلاص رفتار کند، سود برده است؛ *** و اگر در آن شرکی باشد، او (حق) بخشیده است.\n\nعلم دو گونه است: موهوبی و اکتسابی؛ *** و بهترین علمی که بنده بدان دست یابد، آن است که به او عطا شده است.\n\nهمچنین، معلومِ علمِ کسبی در وزن (سنجش) بهره‌ای ندارد، *** زیرا بنده برای آن رنج نبرده است.\n\nاگر میزان‌هایش سبک شود، دلت اندوهگین می‌گردد، *** همان‌گونه که اگر میزانش سنگین شود، شادمان می‌گردد.\n\nپس آتش‌زنه‌ات را بزن و سستی مکن، زیرا برای آنکه *** به سوی حق (الحق) می‌شتابد، قدری جز آنچه افروخته، نیست.\n\nاندیشیدن در ذات کسی که هیچ چیز شبیه او نیست، جهل است؛ *** پس اگر عقل به آن متمایل شد، به آن توجه مکن.\n\nو بر درِ تهی ساختن محل (قلب) وارد شو، *** تا علم شهود (علم العیان) را ببینی، آنگاه که درش گشوده شود.\n\n### [اینکه سرای شقاوت‌مندان و فرشتگان عذاب در سرای نعیم هستند]\n\nبدان که سرای شقاوت‌مندان و فرشتگان عذاب، در تعظیم و تمجید خداوند هستند، همان‌گونه که فرشتگان نعیم در دارالنعیم هستند. هیچ تفاوتی نیست؛ همه بنده‌ای مطیع‌اند. یکی برای خدا نعمت می‌بخشد و دیگری برای خدا انتقام می‌گیرد. همچنین است دو قبضه (القبضتان) که همان دو عالم‌اند: عالم سعادت و عالم شقاوت. هیچ عضوی از آن‌ها و هیچ جوهر فردی در آن‌ها نیست مگر آنکه تسبیح‌گوی خداوند و مقدس‌دارنده جلال اوست، در حالی که از آنچه نفس مدبر و مکلف او، که خداوند او را به عبادت و ایستادن با این جوارح و با عالم ظاهرش در حدودی که برایش تعیین کرده، مکلف ساخته، بی‌خبر است. اگر جوارح می‌دانستند آنچه را که نفس از تعیین معصیت و طاعت می‌داند، هرگز با مخالفت موافقت نمی‌کردند، زیرا آن‌ها هیچ موجودی را نمی‌بینند مگر آنکه تسبیح‌گوی خداوند و مقدس‌دارنده جلال اوست. با این حال، به آن‌ها نیروی حفظ عظیمی داده شده است، پس نفس آن‌ها را در هیچ امری به کار نمی‌برد مگر آنکه آن امر را حفظ می‌کنند و از آن آگاه می‌شوند. و نفس می‌داند که آن عمل طاعت است یا معصیت.\n\nپس هنگامی که روز قیامت، هنگام سؤال از این نفس، انکار واقع شود، خداوند به او می‌گوید: «شاهدی از خودت بر تو می‌فرستیم.» نفس در دل خود می‌گوید: «چه کسی بر من شهادت می‌دهد؟» پس خداوند از جوارح درباره آن افعالی که نفس آن‌ها را در آن به کار برده، سؤال می‌کند. به چشم می‌گوید: «بگو در چه چیزی تو را به کار برد؟» چشم می‌گوید: «پروردگارا، با من به فلان امر نگریسته شد.» گوش می‌گوید: «با من به فلان چیز گوش داده شد.» دست می‌گوید: «با من در فلان کار زورآزمایی شد.» و پا و پوست‌ها و زبان‌ها نیز همین‌گونه می‌گویند. خداوند به نفس می‌گوید: «آیا چیزی از این‌ها را انکار می‌کنی؟» نفس متحیر می‌شود و می‌گوید: «نه.» در حالی که جوارح نمی‌دانند طاعت چیست و معصیت کدام است. پس خداوند می‌گوید: «آیا من بر زبان رسولم و در کتاب‌هایم به تو نگفتم که به فلان چیز نگاه مکن، فلان چیز را گوش مکن، به فلان جا مرو و با فلان چیز زورآزمایی مکن؟» و تمام آنچه از تکلیف (التکلیف) به حواس مربوط می‌شود را برای او مشخص می‌کند. سپس همین کار را در باطن انجام می‌دهد، در مورد آنچه از سوء ظن و غیره بر او ممنوع شده بود.\n\nپس هنگامی که نفس در سرای شقاوت (دار الشقاء) با آتشی که جوارح را لمس می‌کند و انواع عذاب‌ها، معذب می‌شود، اما جوارح تمام آنچه از انواع عذاب بر آن‌ها وارد می‌شود را گوارا می‌یابند (تستعذب). و به همین دلیل عذاب نامیده شده است، زیرا آن‌ها آن را گوارا می‌یابند، همان‌گونه که خزانه‌داران آتش آن را گوارا می‌یابند، چرا که برای خدا انتقام می‌گیرند. همچنین جوارح، زیرا خداوند آن‌ها را محل انتقام از آن نفسی قرار داده که بر آن‌ها حکم می‌راند. و دردها بر نفس ناطقه متفاوت است، به واسطه آنچه در مُلک خود می‌بیند و آنچه روح حیوانی به آن منتقل می‌کند. حس، دردها را در آن افعال دردناک به نفس منتقل می‌کند، در حالی که جوارح در جهنم جز نعیم دائم ندارند، همانند خزانه‌داران که در تمجید و تسبیح خداوند هستند و آنچه از افعال بر آن‌ها جاری می‌شود را گوارا می‌یابند، همان‌گونه که در دنیا بودند. پس انسان تصور می‌کند که عضو به دلیل احساس درد در نفس خود، متألم می‌شود، در حالی که چنین نیست؛ بلکه نفس است که به واسطه آنچه جارحه حمل می‌کند، متألم می‌شود. آیا نمی‌بینی بیمار را که به خواب می‌رود؟ شکی نیست که فرد خوابیده زنده است و حس نزد او موجود است و زخمی که در بیداری از آن درد می‌کشد نیز موجود است، با این حال، عضو دردی احساس نمی‌کند، زیرا یابنده درد، روی خود را از عالم شهادت به برزخ برگردانده است و خبری ندارد. پس دردهای حسی از او برطرف شده و در برزخ باقی می‌ماند، یا در رؤیایی وحشتناک که متألم می‌شود، یا در رؤیایی نیکو که متنعم می‌گردد. پس درد یا نعیم با او منتقل می‌شود، هر جا که او منتقل شود. هنگامی که بیمار بیدار می‌شود، که همان بازگشت نفس او به عالم شهادت است، دردها و رنج‌ها به او بازمی‌گردد. پس اگر عاقل باشی، برایت روشن شد که چه کسی از تو درد را حمل می‌کند و چه کسی آن را احساس می‌کند و چه کسی نه آن را حمل می‌کند و نه احساس می‌کند.\n\nو اگر جوارح متألم می‌شدند، انکار می‌کردند، همان‌گونه که نفس انکار می‌کند، و بر او شهادت نمی‌دادند. خداوند متعال می‌فرماید: **«وَمَا كُنتُمْ تَسْتَتِرُونَ أَن يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ»** (و شما [هنگام گناه] خود را پنهان نمی‌کردید از اینکه گوش‌ها و چشم‌ها و پوست‌هایتان بر شما شهادت دهند). و فرمود: **«إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُولَئِكَ كَانَ عَنْهُ مَسْؤُولًا»** (همانا گوش و چشم و دل، همه این‌ها مورد سؤال قرار خواهند گرفت). اسم «کان» در اینجا نفس است. نفس از گوش و چشم و دل خود سؤال می‌شود، همان‌گونه که مقرر کردیم. به او گفته می‌شود: «با رعیت خود چه کردی؟» آیا نمی‌بینی والی ستمگر را که وقتی پادشاه او را می‌گیرد و به دلیل استغاثه رعیتش او را عذاب می‌دهد، چگونه رعیت از انتقام گرفتن از والی خود شاد می‌شوند؟ همچنین است جوارح؛ روز قیامت برای تو آشکار می‌شود که آن‌ها از دیدن نفس که در دوران ولایتش بر آن‌ها تدبیر می‌کرد، شاد و متنعم هستند، زیرا حرمت خداوند نزد جوارح عظیم است. آیا نمی‌بینی که خداوند چگونه گناهکاران مؤمن را در آتش می‌میراند، همان‌گونه که بیمار در اینجا می‌خوابد؟ پس او درد را احساس نمی‌کند. این از عنایت خداوند به کسی است که از اهل آتش نیست، تا زمانی که به زغال تبدیل شوند، از آتش خارج گردند. اگر جوارح متألم می‌شدند، خداوند آن‌ها را در آن هنگام به درد توصیف می‌کرد، در حالی که نه در کتاب و نه در سنت چنین چیزی وارد نشده است. اگر بگویی: «پس فایده سوزاندن آن‌ها تا زغال شوند چیست؟» می‌گوییم: هر محلی حقیقت خود را می‌دهد. آن محل این فعل را در صورت‌ها می‌دهد. آیا نمی‌بینی انسان وقتی زیر آفتاب می‌نشیند، صورت و بدنش سیاه می‌شود؟ و پارچه وقتی زیر آفتاب پهن می‌شود و با آب دنبال می‌شود، هر بار که خشک می‌شود، سفید می‌گردد. آیا این اثر جز به محل مخصوص و مزاج مخصوص داده شده است؟ پس مقصود عذاب نبوده است، و اگر بود، خداوند آن‌ها را در آن نمی‌میراند. زیرا محل حیات در نفوس، نعیم یا الم را بر حسب اسباب دردناک و نعمت‌بخش می‌طلبد. پس آن‌ها (جوارح) همان‌هایی هستند که به آنچه ذکر کردیم، توصیف شده‌اند. و هنگامی که خداوند آن‌ها را زنده می‌کند و خارج می‌سازد و به تغییر رنگ‌هایشان و زغال شدنشان می‌نگرند، این امر آن‌ها را ناخوش می‌آید. پس خداوند بر آن‌ها نعمت می‌بخشد با صورتی که آن را نیکو می‌شمارند و آن‌ها را بر آن صورت ایجاد می‌کند تا نعمت خداوند را بر خود بدانند، هنگامی که آن‌ها را از آنچه ناخوشایندشان بود به آنچه شادمانشان می‌سازد، منتقل کرد. پس ای برادر، دانستی که چه کسی از تو عذاب می‌کشد و چه کسی متنعم می‌شود، و تو جز خودت نیستی. پس مگذار رعیتت بر تو شهادت دهند که در این صورت به خسران بازمی‌گردی. خداوند تو را مالک گردانیده و اسمی از اسم‌های خود را به تو داده و تو را پادشاهی مطاع نامیده است. پس ستم مکن و از حد مگذر، زیرا این از صفات کسی که تو را والی کرده، نیست. و خداوند با تو به امری رفتار می‌کند که خود با آن رفتار کرده است؛ پس بر خود واجب کرده، همان‌گونه که بر تو واجب کرده است، و تحت عهد تو درآمده، همان‌گونه که تو را تحت عهد درآورده است. او تو را به چیزی امر نکرده مگر آنکه مانند آن را بر خود قرار داده است. این برای آن است که حجت بالغه (الحجة البالغة) برای او باشد. و او به تمام آنچه بر خود واجب کرده، وفا نموده و از تو خواسته است که به آنچه بر تو واجب کرده، وفا کنی. همه این‌ها را انجام داده تا نگویی: «من بنده‌ای هستم که بر من چنین و چنان واجب شده و مرا به حال خود رها نکرده، بلکه مرا تحت عهد و وجوب درآورده است.» پس خداوند به او می‌گوید: «آیا تو را در چیزی وارد کردم که خود را در آن وارد نکردم؟ آیا بر خود واجب نکردم، همان‌گونه که بر تو واجب کردم؟ آیا خود را تحت عهد تو درنیاوردم، همان‌گونه که تو را تحت عهد خود درآوردم؟ و به تو نگفتم که اگر به عهد من وفا کنی، من نیز به عهد تو وفا می‌کنم؟» خداوند متعال می‌فرماید: **«قُلْ»** (بگو) ای محمد **«فَلِلَّهِ الْحُجَّةُ الْبَالِغَةُ»** (پس حجت رسا و کامل از آن خداست). و این معنای قول خداوند متعال است: **«رَبِّ احْكُمْ بِالْحَقِّ»** (پروردگارا، به حق حکم کن). و آیا خداوند جز به حق حکم می‌کند؟ اما در این آیه، حق (الحق) را خود مأمور قرار داده است تا پیامبرش به او بگوید. زیرا لفظ «احکم» امر است و خداوند به او امر کرده که آن را بگوید. خداوند متعال می‌فرماید: **«قُلْ»** ای محمد **«رَبِّ احْكُمْ بِالْحَقِّ»** (پروردگارا، به حق حکم کن). و نزول الهی به سوی بندگان بیش از این نمی‌تواند باشد. ای بنده، آیا این از کرم او نیست؟ آیا این از لطف او نیست؟ آیا او به تمام آنچه بر خود واجب کرده، وفا نکرده است؟ آیا به عهد هر کس که به عهد او وفا کرده، وفا نکرده است؟ آیا از بسیاری از امور که اگر می‌خواست، بندگانش را به خاطر آن مؤاخذه می‌کرد، درنگذشت و عفو نکرد؟ تو کجایی؟ و نظر تو از این فضل عظیم پروردگار قاهر و قادری که با او معارضه و غلبه نمی‌شود، کجاست؟\n\n### [اینکه سبب توصیف دو قبضه (القبضتان) به تسبیح، این است که آن‌ها در قبضه حق (الحق) تعالی هستند]\n\nو بدان که سبب توصیف دو قبضه (القبضتان) به تسبیح، این است که آن‌ها در قبضه حق (الحق) تعالی هستند. پس دو قبضه را در دست خود قرار داد و فرمود: «اینان برای آتش‌اند و باکی ندارم، و اینان برای بهشت‌اند و باکی ندارم.» پس آن‌ها جز خدا را نشناخته‌اند، از این رو او را تسبیح و تمجید می‌کنند، زیرا در قبضه او هستند و خروجی از قبضه برایشان نیست. سپس خداوند از روی کرم خود نگفت: «اینان برای عذاب‌اند و باکی ندارم، و اینان برای نعیم‌اند و باکی ندارم.» بلکه آن‌ها را به دو سرا اضافه کرد تا آن‌ها را آباد کنند.\n\nهمچنین در خبر صحیح وارد شده است که خداوند هنگامی که بهشت و دوزخ را آفرید، به هر یک از آن‌ها فرمود: **«لَكِ عَلَيَّ مِلْؤُهَا»** (بر من است که تو را پر کنم)، یعنی آن را از ساکنان پر می‌کنم، زیرا آبادانی خانه به ساکنان آن است، چنانکه شاعر گفته است:\n\nوعمارة الأوطان بالسكان\n\nو آبادانی وطن‌ها به ساکنان است.\n\nزیرا آن محل است و محل نمی‌شود مگر با حلول در آن. و به همین دلیل خداوند به جهنم می‌گوید: **«هَلِ امْتَلَأْتِ»** (آیا پر شدی؟) و جهنم می‌گوید: **«هَلْ مِن مَّزِيدٍ»** (آیا افزون بر این هست؟). پس هنگامی که جبار (الجبار) پای خود را در آن می‌گذارد، می‌گوید: «بس است، بس است (قطني قطني)» و در روایتی «قط قط»، یعنی پر شدم. پس خداوند آن را با قدم خود پر کرده است، بر اساس آنچه سبحانه خواسته است.\n\nهر کس این را بداند، خداوند در آن خلقی می‌آفریند که آن را آباد می‌کنند. خداوند متعال می‌فرماید: **«أَنَّ لَهُمْ قَدَمَ صِدْقٍ»** (که برای آن‌ها قدم صدق است)، یعنی سابقه‌ای به امری که پیش از عطا کردن آن، آن‌ها را از آن آگاه کرده بود، سپس به آن‌ها عطا کرد و در آنچه به آن‌ها وعده داده بود، صادق بود. و به آتش وعده داده بود که آن را پر کند. پس پر کردن آن با قدم او، یعنی با سابقه قول او که آن را پر خواهد کرد، برای آن صدق بود، به این صورت که در آن خلقی آفرید که آن را آباد می‌کنند. و قدم را به جبار (الجبار) نسبت داد، زیرا این اسم برای عظمت است و آتش از عظمت موجود شده و بهشت از کرم موجود شده است. به همین دلیل اسم جبار به قدم برای آتش اختصاص یافت و آن را به خود نسبت داد. از این امر، عمومیت رحمت در دو سرا و شمول آن استشمام می‌شود، زیرا هر دو را ذکر کرد و متعرض ذکر دردها نشد و از پر شدن آن‌ها سخن گفت و متعرض هیچ چیز دیگری نشد. و همه این‌ها از سلطنت قول او به بندگانش است که: **«رحمت او بر غضبش پیشی گرفته است»**. پس سابقه همیشه حاکم است. و گفته می‌شود که فلان شخص در این امر سابقه قدم دارد. پس این بشارتی است، ان‌شاءالله. و سکونت برای اهل آتش در آتش است و از آن خارج نمی‌شوند، چنانکه خداوند متعال فرمود: **«خَالِدِينَ فِيهَا»** (در آن جاودانه‌اند)، یعنی در آتش. و **«خَالِدِينَ فِيهَا»** (در آن جاودانه‌اند)، یعنی در بهشت. و نفرمود: «خالدین فیه» (در آن جاودانه‌اند) که مراد عذاب باشد. اگر هنگام ذکر عذاب می‌فرمود: «خالدین فیه»، امر مشتبه می‌شد. و چون ضمیر را به سرا (دار) برگرداند، عذاب لازم نمی‌آید. اگر کسی بگوید: «پس نعیم نیز لازم نمی‌آید، همان‌گونه که عذاب لازم نیامد.» می‌گوییم: ما نیز همین را می‌گفتیم، اما چون خداوند متعال درباره نعیم بهشت فرمود: **«عَطَاءً غَيْرَ مَجْذُوذٍ»** (عطایی بی‌انقطاع)، یعنی عطایی که قطع نمی‌شود، و فرمود: **«لَا مَقْطُوعَةٍ وَلَا مَمْنُوعَةٍ»** (نه قطع می‌شود و نه ممنوع می‌گردد)، به همین دلیل ما به خلود در نعیم و سرا قائل شدیم. و هرگز چنین چیزی در عذاب آتش وارد نشده است، به همین دلیل ما به آن قائل نشدیم. اگر بگویی: «پس خداوند فرموده است: **«خَالِدِينَ فِيهِ وَسَاءَ لَهُمْ يَوْمَ الْقِيَامَةِ حِمْلًا»** (در آن جاودانه‌اند و چه بد باری است برایشان در روز قیامت).» می‌گوییم: این تنها در موطنی از مواطن آخرت است و ضمیر به وزر (بار گناه) برمی‌گردد، نه به عذاب. پس هنگامی که برای حمل بارهای سنگین که همان وزرها هستند، برپا داشته می‌شوند، آن‌ها را حمل می‌کنند، چنانکه فرمود: **«لَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَّعَ أَثْقَالِهِمْ»** (قطعاً بارهای خود و بارهایی دیگر را همراه بارهایشان حمل خواهند کرد) و **«وَلَيُسْأَلُنَّ يَوْمَ الْقِيَامَةِ عَمَّا كَانُوا يَفْتَرُونَ»** (و قطعاً در روز قیامت از آنچه افترا می‌بستند، سؤال خواهند شد). و این زمانی مخصوص است. پس می‌گوید: **«خَالِدِينَ فِيهِ»** (در آن جاودانه‌اند)، یعنی در حمل وزر، از مکانی که آن را حمل می‌کنند، از خروجشان از قبرها تا رسیدن به آتش و ورود به آن. پس آن‌ها در آن مدت جاودانه‌اند و از آن‌ها سست نمی‌شود و دیگری آن را از پشتشان برنمی‌دارد. خداوند متعال می‌فرماید: **«وَمَنْ أَعْرَضَ عَنْهُ فَإِنَّهُ يَحْمِلُ يَوْمَ الْقِيَامَةِ وِزْرًا * خَالِدِينَ فِيهِ»** (و هر کس از آن روی برگرداند، پس او در روز قیامت باری سنگین حمل خواهد کرد * در آن جاودانه‌اند). پس ضمیر را به وزر برگرداند و این حمل را برای روز قیامت قرار داد. و مدت روز قیامت از خروج مردم از قبرها تا فرود آمدنشان در منازل خود در بهشت و دوزخ است. و آن روز به پایان می‌رسد و با پایان یافتن آن، تمام آنچه در آن بود، از جمله خلود در حمل وزرها، پایان می‌یابد. پس چون روز به پایان رسید، ظرفی برای خلود باقی نمی‌ماند و حکم به آتش و بهشت و عذاب و نعیم مختص به آن‌ها منتقل می‌شود. و در مورد عذاب، چیزی وارد نشده که دلالت بر خلود در آن کند، همان‌گونه که در خلود در آتش وارد شده است. اما عذاب در آتش ناگزیر است و اجل آن از ما پنهان شده است. و ما از جهت نصوص بر یقین نیستیم، جز اینکه ظواهر، اجل را در آن نشان می‌دهند، اما کمیت آن مجهول است و نصی در مورد آن وارد نشده است. و اهل کشف (الکشف) همگی با ظواهر هم‌رأی هستند. پس آن‌ها از جهت کشف خود قاطع‌اند و این برایشان پذیرفته است، زیرا نصی با آن‌ها معارضه نمی‌کند. و ما با قول خداوند متعال باقی می‌مانیم که: **«إِنَّ رَبَّكَ فَعَّالٌ لِّمَا يُرِيدُ»** (همانا پروردگار تو هر چه بخواهد، انجام می‌دهد). و هر چه اراده کند، همان است. و بر اهل ایمان بیش از این لازم نیست، مگر آنکه نصی متواتر و معین بیاید که علم‌آور باشد. در آن صورت مؤمن قطع پیدا می‌کند، وگرنه نه. پس پاک است آنکه با هر زبانی تسبیح می‌شود و با هر برهانی بر او دلالت می‌شود.\n\nو این منزل شامل علوم بسیاری است، از جمله علم تنزیه (التنزیه) که شایسته هر عالمی است، زیرا تنزیه با اختلاف عوالم متفاوت است. و هر عالمی حق (الحق) را به اندازه علم خود به خویشتن، تنزیه می‌کند. پس او را از هر آنچه بر اوست، تنزیه می‌کند، زیرا هر آنچه بر اوست، حادث است. پس حق را از قیام حوادث به او، یعنی حوادث مختص به او، تنزیه می‌کند. و به همین دلیل تنزیه حق با اختلاف تنزیه‌کنندگان متفاوت است. مثلاً عَرَض می‌گوید: «پاک است کسی که در وجود خود نیازمند محلی نیست تا ظهورش به واسطه آن باشد.» و جوهر می‌گوید: «پاک است کسی که در وجود خود نیازمند مُوجِدی نیست که او را ایجاد کند.» و جسم می‌گوید: «پاک است کسی که در وجود خود نیازمند ابزاری نیست که او را نگه دارد.» این حصر تنزیه از جهت امهات است، زیرا جز جوهر یا جسم یا عرض نیست و بس. سپس هر صنفی به اموری اختصاص دارد که برای دیگری نیست. پس خداوند را از آن صفات و از آن مقام تسبیح کن. و انسان کامل (الإنسان الکامل) خداوند را با تمام تسبیحات عالم تسبیح می‌کند، زیرا او نسخه‌ای از عالم است، چرا که کشف (الکشف) آن برای او حاصل شده است.\n\nو این منزل از علوم شامل علم تمییز اشیاء است. و شامل علم حق مخلوق به (الحق المخلوق به) است که عبدالسلام ابوالحکم ابن برجان در کلام خود بسیار به آن اشاره می‌کند، و همچنین امام سهل بن عبدالله تستری، اما سهل آن را عدل می‌نامد و ابوالحکم آن را حق مخلوق به (الحق المخلوق به) می‌نامد. او این اصطلاح را از قول خداوند گرفته است: **«وَمَا خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا إِلَّا بِالْحَقِّ»** (و ما آسمان‌ها و زمین و آنچه میان آن دو است را جز به حق (الحق) نیافریدیم). و او در این باره کلامی بزرگ و شفابخش دارد. و شامل علم صورت است و اینکه آیا عرض است یا جوهر، زیرا مردم در این باره اختلاف کرده‌اند. و در آن علم رجعت است. و در آن علم علم است، یعنی علم با چه چیزی دانسته می‌شود. و در آن علم غیب و شهادت است. و در آن علم ورود و صدور است. و در آن علم اعتبار و حد آن است. و در آن علم اذواق است که اولین مبادی تجلی (التجلی) است. و در آن علم علل و مراتب آن‌هاست و اینکه چه کسی جایز است به آن‌ها توصیف شود و چه کسی جایز نیست.\n\nو در آن علم تجلی (التجلی) زعامت است و اینکه آیا مدلول آن علم است یا نه، و قول پیامبر (ص) که: **«الزَّعِيمُ غَارِمٌ»** (ضامن، بدهکار است)، و رتبه زعیم قوم چیست و چرا زعیم نامیده شده است. و در آن علم ایمان است. و در آن علم نور است، نه غیر آن، اما فقط نور نازل شده. و در آن علم خبره و مخابره است. و در آن علم تجارت‌های سودآور و زمان‌های آن‌ها و خسران است. و در آن علم وعد و وعید است. و در آن علم اذن الهی است و اینکه در چه چیزی است و آیا عام است یا خاص، و فرق بین امر و اذن، و اینکه آیا در اذن معصیت می‌شود، همان‌گونه که در امر معصیت می‌شود یا نه. و در آن وصف علم به احاطه است. و در آن علم توحید است که به چه چیزی بازمی‌گردد. و در آن علم توکل است. و در آن علم مراتب خلق در ولایت و عداوت است. و در آن علم انذار و تحذیر است و اینکه از چه کسی باید حذر کرد و از چه چیزی باید حذر کرد. و در آن علم فرق بین استطاعت و حق (الحق) است. و در آن علم شرف صفت کرم است. و در آن علم سبب طلب الهی از بندگان است. و در آن علم نتایج شکر است. و در آن علم فرق بین حلم و عفو است. و در آن علم ترتیب اشیاء است. و در آن علم حجاب الهی احمی است. و **«وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 4
}