{
  "id": 356,
  "title": {
    "ar": "الباب السادس والخمسون وثلاثمائة في معرفة منزل ثلاثة أسرار مكتتمة والسر العربي في الأدب الإلهي والوحي النفسي والطبيعي وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Fifty-Six: Concerning the Gnosis of the Station of Three Concealed Secrets, and the Arabic Secret in Divine Etiquette (الأدب الإلهي), and the Psychic and Natural Revelation (الوحي), which is from the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب تین سو چھپن: تین پوشیدہ اسرار کے مقام (منزل) کی معرفت کے بیان میں، اور ادب الٰہی میں السر العربی (السر العربی) کا بیان، نیز وحی نفسی (الوحي النفسي) اور وحی طبیعی (الوحي الطبيعي) کا بیان، اور یہ باب الحضرة المحمدیة (الحضرة المحمدیۃ) سے ہے۔",
    "fa": "باب سیصد و پنجاه و ششم در معرفت منزل سه راز پنهان و سرّ عربی در ادب الهی و وحی نفسانی و طبیعی، و آن از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب السادس والخمسون وثلاثمائة في معرفة منزل ثلاثة أسرار مكتتمة والسر العربي في الأدب الإلهي والوحي النفسي والطبيعي وهو من الحضرة المحمدية»\n\n\n> بذلت نفسي لنفسي كي أفوز بمن *** قد كان عندي ولم أشعر بموضعه‏\n\n\n> حتى رأيت له شكلا يماثلني *** فغبت فيه بأمر من مشرعه‏\n\n\n> هل للنعيم به أو للتخلق بالأسماء *** فانظر إلى أحوال مبدعه‏\n\n\n> فإن يخاطبك الرحمن من كتب *** بسر حكمته فاحضر عسى تعه‏\n\n\n### [أن الله تعالى عمر الخلأ بالعالم كله وامتلأ به‏]\n\n\nاعلم أيدك الله أن الله تعالى لما عمر الخلأ بالعالم كله امتلأ به وخلق فيه الحركة ليستحيل بعضه لبعض وتختلف فيه الصور بالاستحالات لطبيعة الخلأ الذي ملأه من العالم ذلك الذي استحال إليه فلا يزال يستحيل دائما وذلك هو الخلق الجديد الذي أكثر الناس منه في لبس وشك ومن علم هذا من أهل الله الذين أشهدهم الله ذلك عينا في سرائرهم علم استحالة الدنيا إلى الآخرة واستحالة الآخرة بعضها إلى بعض كما استحال منها ما استحال إلى الدنيا\n\n\nكما ورد في الخبر في النيل والفرات وسيحان وجيحان إنها من أنهار الجنة استحالت فظهرت في الدنيا بخلاف الصورة التي كانت عليها في الآخرة\n\n\nقوله بين قبري ومنبري روضة من رياض الجنة\n\n\nفاستحالت تربة في الدنيا في مساحة مقدرة معلومة وكذلك وادي محسر هو واد في النار استحال إلى الدنيا وآدم وحواء وإبليس من عالم الآخرة استحالوا إلى الدنيا ثم يستحيلون إلى الآخرة فتتغير عليهم الصور بحسب ما تعطيه طبيعة المكان المتوهم الذي تنقلهم إليه الحركة فتؤثر فيهم روحا كان أو جسما متحيزا كان أو غير متحيز والله محركه على الدوام ولو لا نحن ما تميزت آخرة من دنيا فإن الله ما اعتبر من العالم في هذه الإضافة إلا هذا النوع الإنساني والجان فجعل الظهور للانس من اسمه الظاهر وجعل البطون للجان من اسمه الباطن وما عداهما فمسخر لهما كما هو في نفسه مسخر بعضه لبعضه من أجل الدرجات التي أنزلهم فيها فأعطتهم الدرجات صور ما استحالوا إليه لما نقلتهم الحركة الإلهية إليها ولما لم تظهر لأعياننا إلا هنا سميت هذه الدار دار الدنيا والأولى وسميت الحياة الدنيا فإذا استحلنا إلى البرزخ واستحلنا من البرزخ إلى الصور التي يكون فيها النشر والبعث سميت تلك الآخرة ولا يزال الأمر في الآخرة في خلق جديد منها فيها أهل الجنة في الجنة وأهل النار في النار إلى ما لا يتناهى فلا نشاهد في الآخرة إلا خلقا جديدا في عين واحدة فالعالم متناه لا متناه ولما كان الأمر هكذا لذلك يرى الإنسان نفسه إذا هو نام في الجنة أو في القيامة أو في غير مكانه وبلده مما يعرفه أو يجهله وفي غير صورته وفي غير حاله فقد استحال في نفسه بحركته التي نقلته من اليقظة إلى النوم إلى صور يعهدها في أوقات ولا يعهدها في أوقات وإلى أحوال محمودة حسنة يسر بها وأحوال مذمومة قبيحة يتألم لها ثم تسرع إليه الاستحالة فيرجع إلى اليقظة إما باستيفاء المعنى الذي استحال إليه في النوم فلم يبق فيه ما يعطيه في تلك الاستحالة الخاصة وهو الذي ينتبه من غير سبب وهو الانتباه الطبيعي لما أخذت النفس للعين حقها من النوم الذي فيه راحتها فإن انتقل من النوم إلى اليقظة بسبب إما من جهة الحس وإما من أمر مفزع أو حركة ما مزعجة ظهرت منه في حال نومه فاستيقظ فإن وافق ذلك الأمر استيفاء العين حقها من النوم الطبيعي كان وإن لم يوافق وبقي من حق العين بقية لو لا ذلك السبب لاستوفاها فإنه يستوفيها في نوم آخر ولذلك بعض النائمين يطول نومهم في وقت وسبب طوله ما ذكرناه وأما قصر نومه فلأحد أمرين وهو ما ذكرناه‏\nإما لسبب يوقظه وإما لاستيفاء العين حقها في تلك النومة الخاصة من أجل المزاج الذي يكون عليه فإنه لا يستوي مزاج المتعوب ومزاج المستريح فالمتعوب يطلب من الراحة ما يزيل به ذلك التعب فيستغرقه النوم ويطول لأنه يحب استيفاء الراحة فلا يوقظه قبل الاستيفاء إلا أحد ثلاثة أشياء أو كلها أو بعضها على حسب ما يقع إما بأمر مزعج يراه في نومه أو يوقظه أحد من المتيقظين قصدا أو صيحة عظيمة أو حركة أو ما كان من هذه الأسباب في عالم الحس مقصودا لانتباهه أو غير مقصود بل يقع بالاتفاق والأمر الثالث أن تكون النفس متعلقة الخاطر بقضاء شغل ما تحب أن تفعله فتنام على ذلك الخاطر وهو متعلق بذلك الأمر فيزعجه فينتبه قبل استيفاء حقه من النوم وليس المقصود مما ذكرناه إلا تعريفك بأن العالم لا يخلو في كل نفس من الاستحالة ولو لا إن عين الجوهر من الذي يقبل هذه الاستحالة في نفسه واحد ثابت لا يستحيل من حيث جوهره ما علم حين يستحيل إلى أمر ما ما كان عليه من الحال قبل تلك الاستحالة غير إن الاستحالات قد يخفى بعضها ويدق وبعضها يكون ظاهرا تحس به النفس كاستحالة خواطرها وحركاتها الظاهرة وأحوالها وتدق وتخفى كاستحالتها في علومها وقواها وألوان المتلونات بتجديد أمثالها فهي لا تدرك ذلك الأمر إلا من كان من أهل الكشف فإنه يدرك ذلك وأزال عنه الكشف ذلك اللبس الذي أعمى غيره عن إدراك هذا الأمر فإن قلت فهذه الصورة التي‏\n\n\nيستحيل إليها جواهر العالم ما هي قلنا الممكنات ليس غيرها هي في شيئية ثبوتها وهي قوله تعالى إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ فإذا ظهر عن قوله كن ليس شيئية الوجود وهو قوله وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً أي قدرتك أي ما كانت لك شيئية الوجود وهي على الحقيقة شيئية الظهور ظهور لعينه وإن كان في شيئية ثبوته ظاهرا متميزا عن غيره بحقيقته ولكن لربه لا لنفسه فما ظهر لنفسه إلا بعد تعلق الأمر الإلهي من قوله كن بظهوره فاكتسب ظهوره لنفسه فعرف نفسه وشاهد عينه فاستحال من شيئية ثبوته إلى شيئية وجوده وإن شئت قلت استحال في نفسه من كونه لم يكن ظاهرا لنفسه إلى حالة ظهر بها لنفسه بتقدير العزيز العليم فالعالم كله طالع غارب وفلك دائر ونجم سابح ظاهر بين طلوع وغروب عن وحي إلهي وهو ما يتوجه عليه من أمر بظهور وخفاء ووحي نفسي وهو ما يطلبه منه الحق وما يطلب من الحق تعالى فيوحي إلى الحق كما أوحى الحق إليه فيعمل الحق بما أوحى إليه عبده وقتا وقد لا يعمل وقتا كما إن العبد إذا أوحى الحق إليه فأمره بشي‏ء يعمله أو يتركه فيطيعه وقتا ويعصيه وقتا فظهر الحق للمكلف بصورته في العطاء والإباية فما رأى العبد في الحق إلا صورته فلا يلومن إلا نفسه إذا دعا الحق في أمر فلم يجبه أ لا ترى إلى الملائكة لما لم يعصوا الله تعالى فيما دعاهم إليه من فعل كما أخبر عنهم ما دعوه في شي‏ء إلا أجابهم لأنهم ليسوا على صورة منع مما دعاهم الحق إليه والعالم لا يشهد من الحق إلا صورة ما هو عليه ولذلك قال صَلَّى اللهُ عَليهِ وسَلَّم فيمن يقول آمين بعد قراءة الفاتحة من وافق تأمينه تأمين الملائكة غفر له‏\n\n\nلأن تأمين الملائكة مقبول عند الله مجاب فوافق زمان الإجابة للملائكة فحصلت له الإجابة بحكم التبعية إلا أن يكون وقته وقت إجابة له جزاء لما امتثل من أمر الحق في وقت ما والأصل في العالم قبول الأمر الإلهي في التكوين والعصيان أمر عارض عرض له نسبي وفي الحقيقة ما عصى الله أحد ولا أطاعه بل الأمر كله لله وهو قوله وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فأفعال العباد خلق لله والعبد محل لذلك الخلق فالعالم كله محصور في ثلاثة أسرار جوهره وصوره والاستحالة وما ثم أمر رابع فإن قلت فمن أين ظهر حكم الاستحالة في العالم من الحقائق الإلهية قلنا إن الحق وصف نفسه بأنه كل يَوْمٍ هُوَ في شَأْنٍ والشئون مختلفة ووصف نفسه بالفرح بتوبة عبده ولم يفرح بها قبل كونها وكذلك‏\n\n\nقوله صَلَّى اللهُ عَليهِ وسَلَّم إن الله لا يمل حتى تملوا\n\n\nوذكر عنه العارفون به وهم الرسل عليه السلام إن الله تعالى يغضب يوم القيامة غضبا لم يغضب قبله مثله ولن يغضب بعده مثله كما يليق بجلاله فقد نعتوه بأنه كان على حالة قبل هذا الغضب لم يكن فيها منعوتا بهذا الغضب وقد ورد في الصحيح تحوله في الصور يوم القيامة إذا تجلى لعباده والتحول هو عين الاستحالة ليس غيرها في الظهور ولو لا ذلك ما صح للعالم ابتداء في الخلق وكان العالم مساوقا لله في الوجود وهذا ليس بصحيح في نفس الأمر فكما قبل تعالى الظهور لعباده في صور مختلفة كذلك أيضا لم يخلق ثم خلق فكان موصوفا في الأزل بأنه عالم قادر أي متمكن من إيجاد الممكن لكن له أن يظهر في صورة إيجاده وأن لا يظهر فظهر في إيجاد صورة الممكن لما شاء ولا فرق بين الممكنات في النسبة إليه سبحانه ونحن نعلم أن زيدا ما\nأوجده الله مثلا إلا أمس أو الآن فقد تأخر وجوده مع كون الحق قادرا فكذلك يلزم الحكم في أول موجود من العالم أن يكون الله يتصف بالقدرة على إيجاد الشي‏ء وإن لم يوجده كما إنك قادر على الحركة في وقت سكونك وإن لم تتحرك ولا يلزم من هذا محال فإنه لا فرق بين الممكن الموجود الآن المتأخر عن غيره وبين الممكن الأول فإن الحق غير موصوف بإيجاد زيد في وقت عدم زيد فالصورة واحدة إن فهمت غير إن إطلاق لفظ الاستحالة لا يطلق على الله وإن كان قد أطلق على نفسه التحول فنقف عنده مع معقولية ما ذكرناه فما ثم إلا الله والتوجه وقبول الممكنات لما أراد الله بذلك التوجه فهذه ثلاثة لا بد منها ومن ظهور حكمها فالغروب لا يكون إلا عن طلوع من طالع ثم غرب والظهور لا يكون إلا من بطون لا عن بطون وأعني بقولي لا عن بطون أنه لم يكن ظاهرا ثم بطن ثم ظهر عن ذلك البطون بل لم يزل باطنا ثم أظهره الله فظهر لنفسه‏\n\n\n### «وصل» لما كان الوصف النفسي للموصوف لا يتمكن رفعه‏\n\n\nإلا ويرتفع معه الموصوف لأنه عين الموصوف ليس غيره وكان تقدم العدم للممكنات نعتا نفسيا لأن الممكن يستحيل عليه الوجود أزلا فلم يبق إلا أن يكون أزلي العدم فتقدم العدم له نعت نفسي والممكنات متميزة الحقائق والصور في ذاتها لأن الحقائق تعطي ذلك فلما أراد الله أن يلبسها حالة الوجود وما ثم إلا الله وهو عين الوجود وهو الموجود ظهر تعالى للممكنات باستعدادات الممكنات وحقائقها فرأت نفسها بنفسها في وجود موجدها وهي على حالها من العدم فإن لها الإدراكات في حال عدمها كما أنها مدركة للمدرك لها في حال عدمها ولذا جاء في الشرع أن الله يأمر الممكن بالتكوين فيتكون فلو لا إن له حقيقة السمع وأنه مدرك أمر الحق إذا توجه عليه لم يتكون ولا وصفه الله بالتكون ولا وصف نفسه بالقول لذلك الشي‏ء المنعوت بالعدم فكذلك للممكن جميع القوي التي يدرك بها المدركات التي تخص هذه الإدراكات فلما أمرها بالتكوين لم تجد وجود انتصف به إذ لم يكن ثم إلا وجود الحق فظهرت صورا في وجود الحق فلذلك تداخلت الصفات الإلهية والكونية فوصف الخلق بصفات الحق ووصف الحق بصفات الخلق فمن قال ما رأيت إلا الله صدق ومن قال ما رأيت إلا العالم صدق ومن قال ما رأيت شيئا صدق لسرعة الاستحالة وعدم الثبات فيقول ما رأيت شيئا ومن قال ما رأيت شيئا إلا رأيت الله قبله فهو ما قلنا إن للممكن إدراكا في حال عدمه فإذا جاءه الأمر الإلهي بالتكوين لم يجد إلا وجود الحق فظهر فيه لنفسه فرأى الحق قبل رؤية نفسه فلما لبسه وجود الحق رأى نفسه عند ذلك فقال ما رأيت شيئا إلا رأيت الله قبله أي قبل أن يتكون فيه فيقبل الحق صورة ذلك الشي‏ء فمن لم يعلم الأمر هكذا وإلا فما علم الحق ولا الخلق ولا هذه النسب ف كُلُّ شَيْ‏ءٍ هالِكٌ بالصورة للاستحالات إِلَّا وَجْهَهُ والضمير في وجهه يعود على الشي‏ء فالشي‏ء هالك من حيث صورته غير هالك من حيث وجهه وحقيقته وليس إلا وجود الحق الذي ظهر به لنفسه لَهُ الْحُكْمُ أي لذلك الشي‏ء الحكم في الوجه فتختلف عليه الأحكام باختلاف الصور وإِلَيْهِ تُرْجَعُونَ في ذلك الحكم أي إلى ذلك الشي‏ء يرجع الحكم الذي حكم به على الوجه فالحكم والتحكيم للاحالة لأنها المقصود لا محالة فما ثم إلا هلاك وإيجاد في عين واحدة لا تبديل إلا لله لا تَبْدِيلَ لِخَلْقِ الله لا تَبْدِيلَ لِكَلِماتِ الله بل التبديل له كما لِلَّهِ الْأَمْرُ من قَبْلُ ومن بَعْدُ يقضي بذلك كونه أخبر عن نفسه أنه الْأَوَّلُ والْآخِرُ من عين واحدة فليس إلا صور ظاهر هنا وفي البرزخ والآخرة وهو الذي جاء به قوله إِنَّا لَمَرْدُودُونَ في الْحافِرَةِ توهموا ذاك وما حققوا لذلك قالوا كَرَّةٌ خاسِرَةٌ فلو رأوها لرأوا أنها ليست سوى أعيانها الظاهرة فما أحالوها ولا عرجوا عنها لكونهم ما نظرت أعينهم إلا إليها فكيف ينكرون ما رأوه أو يجحدون عن نفوسهم ما تيقنوه ومن لم يكن له هذا الإدراك فقد حرم العلم والمعرفة التي أعطاها الشهود والكشف وفي هذا المنزل من العلوم علم المعجزات وعلم الطمس وعلم التتالي وتتابع الموجودات في الخلق وفيه علم اليقين وفيه علم ما يحصل بالخبر وفيه علم ما يحمد ويذم وفيه علم الغضب ولا يقع إلا ممن لم يعط الأمور حقها في حدودها وفيه علم الرحمة بالضعفاء والخلق كلهم ضعفاء بالأصالة فالرحمة تشملهم وفيه علم ورث الكون للأسماء الإلهية وفيه علم التمكين وفيه علم الإشهاد وفيه علم البيان لتمييز ما يحذر وما لا يحذر وفيه علم إلحاق الإناث بالذكور وهو إلحاق المنفعل بالفاعل من حيث ما ينفعل عنه منفعل آخر حتى ينتهي الأمر إلى منفعل آخر لا ينفعل عنه منفعل كما ينتهي الأمر من‏\nالطرف الآخر إلى فاعل لا يكون منفعلا عن فاعل وهو الحق تعالى وفيه علم اختلاف الوجوه في العين الواحدة وفيه علم الآثار وما تعطي العالم بها من العلوم ومن هنا أخذ السامري القبضة من أثر جبريل فلو لا علمه بما تعطيه الآثار ما فعل ومن هذا الباب الذين يقصون الأثر في طلب الشي‏ء ومن هذا الباب تعرف أقدام السعداء من أقدام الأشقياء إذا رأى صاحب هذا العلم وطاتهم في الأرض وإن لم ير أشخاصهم فإذا رأى أثر أرجلهم حكم عليهم بما يظهر له وفيه علم التعريض وقولهم في المثل السائر إن في المعاريض لمندوحة عن الكذب وفيه علم التورية ولذلك كان صَلَّى اللهُ عَليهِ وسَلَّم إذا أراد غزو جهة ورى بغيرها وفيه علم ما تعطيه الأسباب من الحكم في العالم وفيه علم حكم الأحوال على الرجال الأقوياء بل حكم الأحوال على كل شي‏ء ومن هذا الباب رضي الله عن المطيع وغضبه على من يشاء من العصاة وفيه علم من أين نصر الشخص من يشبهه في الصفة إذا تعدى عليه آخر وهو ضد لمماثله بالجسد الذي ركبه الله عليه ويظهر ذلك في الحيوان كثيرا وفيه علم الأسباب التي تورث الالتجاء إلى الله عز وجل وهي أسباب القهر وفيه علم سفر الخواطر وسفر الأجسام وما ينتج كل سفر منها وفيه علم من أين يترك الإنسان طلب ما هو محتاج إليه بالطبع مثل قول بعضهم في إن الفقير من ليست له إلى الله حاجة وهذا وإن كان لفظه في غاية القبح فهو من جهة المعنى في غاية الحسن لأنه أرفع درجات التسليم وصاحب هذا المقام هو الذي اتخذ الله وكيلا لعلمه بأنه تعالى أعلم بما يصلح لهذا العبد فلا يعين له العبد حاجة لجهله بالمصالح فالفقير ليست له إلى الله حاجة معينة بل رد أمره كله إلى الله وفيه علم ما ينتج من له هذا المقام وكان حاله وفيه علم من عرف مقدار النساء ومنزلتهن في الوجود ولهذا حببهن الله لمحمد صَلَّى اللهُ عَليهِ وسَلَّم فإنه من أسرار الاختصاص ولما علم الله موسى عليه السلام قدر هذا استأجر نفسه في مهر امرأة عشر سنين وأعني بالنساء الأنوثة السارية في العالم وكانت في النساء أظهر فلهذا حببت لمن حببت إليه فإن النظر العقلي لا يعطي ذلك لبعده عن الشهوة الطبيعية وما علم هذا العقل أنه ما تنزه عن الشهوة لطبيعية الحيوانية في زعمه إلا بالشهوة الطبيعية فما زهد في شي‏ء إلا بما زهد فيه فما خرج عن حكمه وهذا أجهل الجاهلين ولو لم يكن من شرف النساء إلا هيأة السجود لهن عند النكاح والسجود أشرف حالات للعبد في الصلاة ولو لا خوفي أن أثير الشهوة في نفوس السامعين فيؤدي ذلك إلى أمور يكون فيها حجاب الخلق عما دعاهم الحق إليه لجهلهم بما كنت أذكره في ذلك ولكن له مواطن يستعمل فيها لا ظهرت من ذلك ما لا يظهر على فضله فضل شي‏ء ولذلك قرن معه حب الطيب والصلاة ومن أسماء الله تعالى الطيب ولو نظرت فيما أنتج الله من‏\n\n\nالكلام الإلهي لموسى عليه السلام حين خرج ساعيا لأهله لما كانوا يحتاجون إليه من النار فبسعيه على عياله واستفراغه ناداه الحق وكلمه في عين حاجته وهي النار فقال له أن بورك من في النار ومن حولها وفيه علم وجود الحق في عين الخلاف كما يوجد في عين الاتفاق لمن عقل وفيه علم افتقار الأعلى إلى الأدنى وحاجته إليه وهذا العلم من أصعب العلوم لدقة ميزانه فإنه ما كل أحد يقدر يزن بهذا الميزان ولا سيما في قوله وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ ما أُرِيدُ مِنْهُمْ من رِزْقٍ وما أُرِيدُ أَنْ يُطْعِمُونِ فمن أي شي‏ء تحفظ في قوله ما أُرِيدُ مِنْهُمْ من رِزْقٍ وما أُرِيدُ أَنْ يُطْعِمُونِ ونحن نعلم أنه لا يطعم ولا يطلب الرزق من عباده بل هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ لما كانت القوة فينا للغذاء فقال أَنْ يُطْعِمُونِ فتكون قوتي مما طمعت بل لي القوة من غير غذاء ولا طعام وفيه علم الإمامة في العالم وأنه لا يجتمع أمر العالم إلا بها ولا تكون المصالح إلا بها وفيه علم تعليم العلم وفيه علم الغيب الإضافي وما ثم غيب مطلق وفيه علم من طلب شيئا فلما أعطيه رده ولم يقبله فما\n\n\nالسبب الذي حمل الطالب على طلبه وما السبب الذي جعله يرده ولا يقبله فينبني على هذا علم السبب المؤدي إلى الطلب على الإطلاق من غير تخصيص طالب من طالب وفيه علم ما يتبع الشخص إلا من له الحكم فيه وما يحكم فيه إلا من له التعشق به وهذا اتباع الاختيار لا اتباع الجبر فإن اتباع الجبر قد لا يكون له حكم ما ذكرناه وإن كان العاشق مجبورا للعشق القائم به ولكن الفرق ظاهر بين الحركتين وفيه علم التوصيل وما ينتج وفيه علم الأصناف الذين يضاعف لهم العطاء في الآخرة وفيه علم ما ينبغي أن يطلب له العالم وفيه علم ما يحذر من الاتباع وما لا يحذر وما يذم من الحذر وما لا يذم وفيه علم السبب الموجب لهلاك ما يهلك من العالم وفيه علم المفاضلة في العالم‏\nبالمراتب وفيه علم الأنساب والأحساب وما يقع به الشرف في الانتساب وما لا يقع ونهى النبي صَلَّى اللهُ عَليهِ وسَلَّم عن الطعن في الأنساب‏\n\n\nوفيه علم الأهوال الشاغلة وفيه علم الجبر ومن هو المجبور وفيه علم التنزيه وفيه علم عواقب الثناء وأوائله وفيه علم الأحكام ولمن تنسب ومن يحكم بها وفيه علم التقدير الذي لم يقع لو وقع ما ينتج وهل ترك وقوعه من باب الرحمة بالعالم أم لا وفيه علم إقامة الحجج وفيه علم الابتلاء وما فائدته وفيه علم صنعة الكيمياء وفيه علم الاعتبار وفيه علم التمني وما يفيد منه وينفع المتمني وما لا يفيد ولا ينفع وفيه علم أهلية كل موجود لما أهل له وفيه علم من جازى بأفضل مما عمل له ومن أجاب بأكثر مما سئل عنه وفيه علم ما نهي عنه المؤمن هل هو بقاء على الأصل لأنه ترك ولما ذا تأخر عن الأمر وكلاهما حكم الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Three Hundred and Fifty-Six: Concerning the Knowledge of the Station of Three Hidden Secrets, the Arabic Secret in Divine Etiquette, Psychic Revelation, and Natural Revelation, and this is from the Muhammadan Presence (الحضرة المحمدية)\n\nI sacrificed my self for my Self so that I might attain Him\nWho was already with me, though I was unaware of His location.\n\nUntil I saw for Him a form that resembled me,\nSo I became annihilated (غبت) in it, by the command of its Legislator.\n\nIs it for bliss through Him, or for assuming the character of the Names (الأسماء)?\nThen look upon the states of its Originator.\n\nIf the All-Merciful addresses you from books\nWith the secret of His Wisdom, then be present, perhaps you will comprehend it.\n\n### [That Allah Almighty filled the Void (الخلأ) with the entire Cosmos (العالم) and was filled by it]\n\nKnow, may Allah strengthen you, that when Allah Almighty filled the Void (الخلأ) with the entire Cosmos (العالم), it was filled by it, and He created movement within it so that parts of it might transform (يستحيل) into other parts, and forms might differ through these transformations (الاستحالات), due to the nature of the Void which He filled with the Cosmos—that which transformed into it. Thus, it is perpetually transforming. This is the New Creation (الخلق الجديد) about which most people are confused and doubtful.\n\nWhoever knows this among the People of Allah (أهل الله)—those whom Allah has granted direct witnessing (عينا) of this in their innermost beings (سرائرهم)—knows the transformation of the world (الدنيا) into the Hereafter (الآخرة), and the transformation of parts of the Hereafter into other parts, just as parts of the Hereafter transformed into the world.\n\nAs is mentioned in the tradition (الخبر) concerning the Nile, the Euphrates, Sayhan, and Jayhan: that they are rivers of Paradise (الجنة) that transformed and appeared in the world in a form different from the one they possessed in the Hereafter.\n\nHis saying, \"Between my grave and my pulpit is a garden (روضة) from the gardens of Paradise,\" means it transformed into earth (تربة) in the world within a known, measured area. Likewise, the Valley of Muhassir is a valley in the Fire (النار) that transformed into the world.\n\nAdam, Eve, and Iblis, being from the realm of the Hereafter (عالم الآخرة), transformed into the world, and then they will transform back into the Hereafter. Their forms change according to what is dictated by the nature of the imagined place (المكان المتوهم) to which movement transports them, affecting them whether they are spirit (روحا) or body (جسما), localized (متحيزا) or non-localized (غير متحيز). Allah is their perpetual mover. Were it not for us [the human species], the Hereafter would not be distinguished from the world. For Allah did not consider, in this attribution, any part of the Cosmos except this human species (النوع الإنساني) and the Jinn. He made the manifestation (الظهور) for humans from His Name, the Manifest (الظاهر), and He made the hiddenness (البطون) for the Jinn from His Name, the Hidden (الباطن). Everything besides these two is subjugated (مسخر) to them, just as the Cosmos itself is subjugated, part to part, because of the Levels (الدرجات) in which He placed them. These Levels gave them the forms into which they transformed when the Divine Movement (الحركة الإلهية) transported them there. Since they only manifested to our Fixed Entities (أعياننا) here, this abode was named the abode of the world (دار الدنيا) and the first, and it was named the worldly life (الحياة الدنيا).\n\nWhen we transform into the Isthmus (البرزخ), and transform from the Isthmus into the forms in which the Resurrection (النشر) and the Raising (البعث) occur, that is named the Hereafter (الآخرة). The matter in the Hereafter remains in a New Creation (خلق جديد) perpetually, including the people of Paradise in Paradise and the people of the Fire in the Fire, unto infinity. Thus, we witness in the Hereafter nothing but a New Creation in a single essence (عين واحدة). Therefore, the Cosmos is finite yet infinite.\n\nSince the matter is thus, a person sees himself, when asleep, in Paradise, or in the Resurrection, or in a place and country other than his own, whether known or unknown, and in a form and state other than his own. He has thus transformed within himself by the movement that transported him from wakefulness to sleep, into forms he recognizes at times and does not recognize at other times, and into praiseworthy, good states that delight him, and blameworthy, ugly states that cause him pain. Then transformation swiftly returns him to wakefulness, either by the fulfillment of the meaning (المعنى) into which he transformed in sleep—so that nothing remains in him that that specific transformation could bestow (this is when one wakes up without cause, which is natural awakening, when the soul has taken its due rest for the eye)—or he transitions from sleep to wakefulness due to a cause, either sensory, or a frightening event, or some disturbing movement that occurred during his sleep, causing him to wake up. If that event coincided with the eye having taken its due natural sleep, then so be it. If it did not coincide, and some portion of the eye's due remained—which, but for that cause, would have been fulfilled—then he will fulfill it in another sleep. This is why some sleepers have long periods of sleep at one time; the reason for its length is what we mentioned. As for the shortness of his sleep, it is due to one of two things, which we also mentioned: either a cause wakes him, or the eye fulfills its due in that specific sleep due to the temperament (المزاج) he is in. The temperament of the weary person is not the same as the temperament of the rested person. The weary person seeks rest to remove that fatigue, so sleep overwhelms him and lasts long because he desires the fulfillment of rest. Nothing wakes him before fulfillment except one of three things, or all or some of them, depending on the occurrence: either a disturbing matter he sees in his sleep, or someone awake intentionally wakes him, or a loud shout, or a movement, or any of these causes in the sensory world, whether intended for his awakening or accidental. The third matter is that the soul's thought (الخاطر) is attached to completing some task it wishes to perform, so it sleeps with that thought attached to that matter, which then disturbs it, causing it to wake up before fulfilling its due sleep.\n\nThe only purpose of what we have mentioned is to inform you that the Cosmos is never devoid of transformation (الاستحالة) in every breath (نفس). Were it not that the essence (عين الجوهر) which accepts this transformation within itself is one and fixed—not transforming in terms of its essence—it would not know, when transforming into a certain state, what state it was in before that transformation. However, some transformations are subtle and hidden, while others are manifest and felt by the soul, such as the transformation of its thoughts (خواطرها), its manifest movements, and its states. Others are subtle and hidden, such as its transformation in its knowledges (علومها), its powers (قواها), and the colors of changing things through the renewal of their likes. Only those who possess Unveiling (أهل الكشف) can perceive this matter, for Unveiling removes the confusion (اللبس) that blinds others from perceiving this matter.\n\nIf you ask: What is this form into which the essences (جواهر) of the Cosmos transform? We say: They are the possibilities (الممكنات) and nothing else. They are in the thingness (شيئية) of their immutability (ثبوتها), which is His saying: <<إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ أَنْ نَقُولَ لَهُ كُنْ فَيَكُونُ>> (Indeed, Our word to a thing, when We intend it, is only [that] We say to it, \"Be,\" and it is). When it manifests from His saying \"Be,\" it is not the thingness of Existence (شيئية الوجود), which is His saying: <<وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً>> (And I had created you before, when you were nothing). That is, your potentiality (قدرتك)—you did not possess the thingness of Existence. In reality, it is the thingness of manifestation (شيئية الظهور), a manifestation for its own essence (عينه), even though in the thingness of its immutability (شيئية ثبوته) it is manifest and distinguished from others by its reality, but this is for its Lord, not for itself. It only manifested to itself after the Divine Command (الأمر الإلهي), \"Be,\" related to its manifestation. Thus, it acquired its manifestation for itself, knew itself, and witnessed its essence (عينه). It transformed from the thingness of its immutability to the thingness of its existence. If you wish, you could say it transformed within itself from the state of not being manifest to itself to a state by which it became manifest to itself, by the decree of the Almighty, the All-Knowing.\n\nThe entire Cosmos is rising and setting, a revolving sphere, and a swimming star, manifest between rising and setting, due to Divine Revelation (وحي إلهي)—which is the command directed upon it for manifestation and hiddenness—and psychic revelation (وحي نفسي)—which is what the Real (الحق) demands from it, and what it demands from the Real Almighty, so it reveals to the Real just as the Real revealed to it. The Real acts upon what His servant revealed to Him at times, and at times He may not act. Just as the servant, when the Real reveals to him and commands him to do or leave something, obeys Him at times and disobeys Him at times. Thus, the Real manifests to the responsible person (المكلف) in his own form (صورته) in giving and refusing. The servant sees nothing in the Real but his own form. Therefore, let him blame no one but himself if he calls upon the Real concerning a matter and is not answered. Do you not see that the angels, since they do not disobey Allah Almighty in any action He calls them to, as He informed us about them, they never call upon Him for anything except that He answers them? This is because they are not in the form of refusal regarding what the Real calls them to. The Cosmos witnesses nothing of the Real except the form of what it is upon. Therefore, the Prophet, peace and blessings be upon him, said concerning the one who says *Amin* after reciting the Fatiha: \"Whoever's saying *Amin* coincides with the *Amin* of the angels, he is forgiven.\" This is because the *Amin* of the angels is accepted by Allah and answered. So, his *Amin* coincided with the time of the angels' answer, and he received the answer by way of dependence (التبعية), unless his time was a time of answer for him as a reward for having complied with a command of the Real at some time. The fundamental principle (الأصل) in the Cosmos is the acceptance of the Divine Command (الأمر الإلهي) in creation (التكوين). Disobedience is a relative, accidental matter that occurs to it. In reality, no one disobeys Allah, nor does anyone obey Him. Rather, the entire command belongs to Allah, which is His saying: <<وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him is returned the whole affair). Thus, the acts of the servants are the creation of Allah, and the servant is the locus (محل) for that creation. The entire Cosmos is confined to three secrets: its essence (جوهره), its forms (صوره), and transformation (الاستحالة). There is no fourth matter.\n\nIf you ask: From where did the ruling of transformation (الاستحالة) manifest in the Cosmos from the Divine Realities (الحقائق الإلهية)? We say: The Real described Himself as: <<كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ>> (Every day He is in [some] affair), and the affairs (الشئون) are different. He described Himself as rejoicing (الفرح) at the repentance of His servant, and He did not rejoice at it before it occurred. Likewise, His saying, peace and blessings be upon him: \"Indeed, Allah does not tire until you tire.\" And the Gnostics (العارفون) of Him—who are the Messengers, peace be upon them—mentioned that Allah Almighty will be angry on the Day of Resurrection with an anger He has never been angry with before, nor will He be angry with the like of it afterward, as befits His Majesty. Thus, they described Him as having been in a state before this anger in which He was not described by this anger. It has been reported in the authentic tradition (الصحيح) that He transforms (تحوله) into forms on the Day of Resurrection when He discloses Himself (تجلى) to His servants. Transformation (التحول) is the very essence of transformation (الاستحالة) in manifestation, nothing else. Were it not for this, the Cosmos would not have a valid beginning in creation, and the Cosmos would be co-existent (مساوقا) with Allah in Existence (الوجود), which is not correct in reality (في نفس الأمر). Just as the Almighty accepted manifestation to His servants in different forms, likewise, He did not create, and then He created. Thus, He was described in pre-eternity (الأزل) as All-Knowing (عالم) and All-Powerful (قادر)—meaning, capable of bringing the possible (الممكن) into existence—but He has the choice to manifest in the form of its creation or not to manifest. He manifested in the creation of the form of the possible when He willed. There is no difference between the possibilities in relation to Him, glory be to Him. We know that Allah did not bring Zayd into existence, for example, until yesterday or now. His existence was delayed despite the Real being All-Powerful. Likewise, the same ruling must apply to the first existent thing in the Cosmos: that Allah is characterized by the power to bring a thing into existence even if He does not bring it into existence, just as you are capable of movement during your stillness, even if you do not move. No impossibility results from this. For there is no difference between the possible thing existing now, which is subsequent to others, and the first possible thing. The Real is not described as creating Zayd during Zayd's non-existence. The form is one, if you understand. However, the term transformation (الاستحالة) is not applied to Allah, even though He applied the term transformation (التحول) to Himself, so we stop there, along with the intelligibility of what we mentioned. There is nothing but Allah, the Direction (التوجه), and the acceptance of the possibilities of what Allah willed by that Direction. These three are indispensable, as is the manifestation of their ruling. Setting (الغروب) only occurs after the rising (طلوع) of something that rose and then set. Manifestation (الظهور) only occurs from hiddenness (بطون), but not *out of* hiddenness. By my saying \"not out of hiddenness,\" I mean that it was not manifest, then hidden, and then manifested out of that hiddenness. Rather, it was perpetually hidden, then Allah manifested it, and it manifested to itself.\n\n### Connection (وصل)\n\nSince the psychic attribute (الوصف النفسي) of the described thing cannot be removed without the described thing being removed along with it—because it is the very essence of the described thing and nothing else—and since the precedence of non-existence (تقدم العدم) for the possibilities (الممكنات) was a psychic attribute (نعت نفسي)—because existence (الوجود) is impossible for the possible eternally (أزلا), so it must necessarily be eternally non-existent—the precedence of non-existence is a psychic attribute for it. The possibilities are distinguished in their realities (الحقائق) and forms in their Essence (ذاتها), because the realities dictate this. When Allah willed to clothe them in the state of Existence (الوجود)—and there was nothing but Allah, who is the very Essence of Existence (عين الوجود) and the Existent (الموجود)—He Almighty manifested to the possibilities through the preparedness (استعدادات) and realities of the possibilities. They saw themselves by themselves within the Existence of their Creator, while still in their state of non-existence. For they possess perceptions (الإدراكات) in their state of non-existence, just as they are perceived by the One who perceives them in their state of non-existence. Therefore, it came in the Sacred Law (الشرع) that Allah commands the possible thing to \"Be\" (التكوين), and it comes into being. Were it not that it possesses the reality of hearing (حقيقة السمع) and that it perceives the command of the Real when it is directed upon it, it would not come into being, nor would Allah describe it as coming into being, nor would He describe Himself as speaking to that thing characterized by non-existence. Likewise, the possible thing possesses all the powers (القوي) by which it perceives the perceptibles specific to these perceptions. When He commanded them to come into being, they found no existence by which they could be characterized, for there was nothing but the Existence of the Real. Thus, they appeared as forms within the Existence of the Real. Therefore, the Divine Attributes (الصفات الإلهية) and the cosmic attributes (الكونية) intermingled. Creation (الخلق) was described by the Attributes of the Real, and the Real was described by the attributes of creation. So, whoever said, \"I saw nothing but Allah,\" spoke truly. And whoever said, \"I saw nothing but the Cosmos,\" spoke truly. And whoever said, \"I saw nothing,\" spoke truly, due to the speed of transformation and the lack of permanence, so he says, \"I saw nothing.\"\n\nAnd whoever said, \"I saw nothing except that I saw Allah before it,\" this is what we said: that the possible thing has perception in its state of non-existence. When the Divine Command for creation came to it, it found nothing but the Existence of the Real, so it manifested within it to itself. It saw the Real before seeing itself. When the Existence of the Real clothed it, it then saw itself. Thus, he said, \"I saw nothing except that I saw Allah before it,\" meaning before it came into being within it, and the Real accepted the form of that thing. Whoever does not know the matter thus has not known the Real, nor creation, nor these relations. <<كُلُّ شَيْءٍ هَالِكٌ>> (Everything is perishing) in form due to transformations, <<إِلَّا وَجْهَهُ>> (except His Face). The pronoun in \"His Face\" refers back to the thing (الشيء). Thus, the thing is perishing in terms of its form, but not perishing in terms of its Face (وجهه) and its reality (حقيقته), which is nothing but the Existence of the Real by which it manifested to itself. <<لَهُ الْحُكْمُ>> (To Him belongs the judgment)—meaning, to that thing belongs the judgment in the Face (الوجه), so the rulings differ upon it according to the difference in forms. <<وَإِلَيْهِ تُرْجَعُونَ>> (And to Him you will be returned) in that judgment—meaning, the judgment that was passed upon the Face returns to that thing. Thus, the judgment and the arbitration belong to transformation (الاحالة), for it is inevitably the goal. There is nothing but perishing and creation in a single essence (عين واحدة). There is no change except for Allah. <<لَا تَبْدِيلَ لِخَلْقِ اللَّهِ>> (There is no change in the creation of Allah). <<لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ>> (There is no change in the Words of Allah). Rather, the change belongs to Him, just as <<لِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ>> (To Allah belongs the command before and after). This is necessitated by His informing about Himself that He is <<الْأَوَّلُ وَالْآخِرُ>> (The First and The Last) from a single essence. There are only manifest forms here, in the Barzakh (البرزخ), and in the Hereafter. This is what is meant by their saying: <<إِنَّا لَمَرْدُودُونَ فِي الْحَافِرَةِ>> (Indeed, we will be returned to the former state). They imagined that but did not realize it fully. Therefore, they said: <<كَرَّةٌ خَاسِرَةٌ>> (A losing return). If they had seen it, they would have seen that it is nothing but their manifest essences (أعيانها الظاهرة). They would not have deemed it impossible or turned away from it, because their eyes looked only upon it. How could they deny what they saw or reject what they were certain of within themselves?\n\nWhoever lacks this perception is deprived of the Knowledge (العلم) and Gnosis (المعرفة) bestowed by Witnessing (الشهود) and Unveiling (الكشف). In this station (المنزل) are the sciences of miracles (المعجزات), the science of effacement (الطمس), the science of the succession and continuity of existent things in creation, the science of certainty (اليقين), the science of what is obtained through report, the science of what is praised and what is blamed, and the science of anger—which only occurs from one who does not give matters their due within their limits. It contains the science of mercy (الرحمة) toward the weak, and all creation is fundamentally weak, so mercy encompasses them. It contains the science of the Cosmos inheriting the Divine Names (الأسماء الإلهية), the science of establishment (التمكين), the science of witnessing (الإشهاد), the science of clarification (البيان) for distinguishing what should be avoided and what should not, and the science of attaching females to males, which is the attachment of the passive (المنفعل) to the active (الفاعل), in terms of that from which another passive thing is acted upon, until the matter ends with a final passive thing that is not acted upon by another passive thing, just as the matter ends on the other side with an active thing that is not acted upon by an active thing, which is the Real Almighty.\n\nIt contains the science of the difference of Faces (الوجوه) in the single Essence (العين الواحدة), and the science of traces (الآثار) and the knowledges they bestow upon the knower. It is from this that the Samiri took a handful from the trace of Gabriel; had he not known what traces bestow, he would not have done so. From this chapter are those who track the trace (يقصون الأثر) when seeking something. From this chapter, the footprints of the fortunate (السعداء) are known from the footprints of the wretched (الأشقياء) when the possessor of this knowledge sees their steps on the earth, even if he does not see their persons. When he sees the trace of their feet, he judges them according to what is revealed to him.\n\nIt contains the science of allusion (التعريض) and their saying in the common proverb: \"In allusions, there is room to avoid lying.\" It contains the science of equivocation (التورية), which is why the Prophet, peace and blessings be upon him, when he intended to raid one direction, would equivocate by mentioning another. It contains the science of the rulings that causes (الأسباب) bestow upon the Cosmos. It contains the science of the ruling of states (الأحوال) over strong men—indeed, the ruling of states over everything. From this chapter is Allah's pleasure with the obedient and His anger with whomever He wills among the disobedient.\n\nIt contains the science of why a person who resembles another in attribute is aided when another person transgresses against him, even though the transgressor is an opposite to his counterpart through the body Allah composed for him—this appears frequently in animals. It contains the science of the causes that lead to seeking refuge in Allah, the Mighty and Majestic, which are the causes of subjugation (القهر). It contains the science of the journey of thoughts (سفر الخواطر) and the journey of bodies, and what each journey produces. It contains the science of why a person abandons the pursuit of what he naturally needs, such as the saying of some: \"The poor (الفقير) is he who has no need of Allah.\" Although the wording of this is extremely ugly, its meaning is extremely beautiful, because it is the highest degree of submission (التسليم). The possessor of this station (المقام) is the one who has taken Allah as his Trustee (وكيلا), knowing that He Almighty is more knowledgeable of what is suitable for this servant. Thus, the servant does not specify a need for Him, due to his ignorance of what is beneficial. The poor person has no specific need of Allah; rather, he has returned his entire affair to Allah.\n\nIt contains the science of what is produced by one who possesses this station and state. It contains the science of one who knows the measure of women and their station in Existence (الوجود). For this reason, Allah made them beloved to Muhammad, peace and blessings be upon him, for this is one of the secrets of specialization (أسرار الاختصاص). When Allah taught Moses, peace be upon him, the measure of this, he hired himself out for the dowry of a woman for ten years. By \"women,\" I mean the femininity (الأنوثة) that permeates the Cosmos, which is most manifest in women. For this reason, they were made beloved to whomever they were made beloved. Rational consideration (النظر العقلي) does not yield this, due to its distance from natural desire (الشهوة الطبيعية). This intellect does not know that it only purified itself from the natural animal desire, as it claims, by means of natural desire itself. It only abstained from something by means of that which it abstained from, so it did not escape its ruling. This is the most ignorant of the ignorant. If there were no honor for women except the posture of prostration (السجود) toward them during intercourse—and prostration is the most noble state for the servant in prayer—[that would suffice]. Were it not for my fear of arousing desire in the souls of the listeners, which might lead to matters that would veil creation from what the Real called them to, due to their ignorance of what I would mention concerning that, I would have revealed from it what shows that nothing surpasses its excellence. But it has specific contexts in which it is used. For this reason, the love of perfume (الطيب) and prayer (الصلاة) were coupled with it. One of the Names of Allah Almighty is The Good (الطيب). If you consider what Allah produced of Divine Speech (الكلام الإلهي) for Moses, peace be upon him, when he went out seeking fire for his family, which they needed, by his effort for his dependents and his exhaustion, the Real called him and spoke to him precisely at the locus of his need, which was the fire. He said to him: <<أَن بُورِكَ مَن فِي النَّارِ وَمَن حَولَهَا>> (Blessed is He who is in the fire and whoever is around it).\n\nIt contains the science of the Existence of the Real (وجود الحق) in the very essence of disagreement (عين الخلاف), just as He exists in the very essence of agreement, for those who understand. It contains the science of the dependence of the higher upon the lower and its need for it. This science is one of the most difficult sciences due to the subtlety of its balance. Not everyone is able to weigh with this balance, especially regarding His saying: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ * مَا أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ>> (And I did not create the jinn and mankind except to worship Me. I do not desire from them any provision, nor do I desire that they feed Me). What do you preserve in His saying: \"I do not desire from them any provision, nor do I desire that they feed Me\"? We know that He does not eat, nor does He seek provision from His servants. Rather, <<هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ>> (He is the Provider, Possessor of Strength). Since strength in us comes from nourishment, He said, \"that they feed Me,\" implying that My strength would come from what I desired. Rather, I possess strength without nourishment or food.\n\nIt contains the science of leadership (الإمامة) in the Cosmos, and that the affairs of the Cosmos cannot be gathered except through it, nor can benefits (المصالح) be realized except through it. It contains the science of teaching Knowledge (العلم). It contains the science of relative Unseen (الغيب الإضافي), and that there is no absolute Unseen. It contains the science of one who sought something, and when it was given to him, he rejected it and did not accept it. What was the reason that drove the seeker to seek it, and what was the reason that made him reject it and not accept it? Upon this is built the science of the cause that leads to seeking absolutely, without distinguishing one seeker from another.\n\nIt contains the science that a person is only followed by one who has authority (الحكم) over him, and authority is only held by one who is passionately devoted (التعشق) to him. This is following by choice (الاختيار), not following by compulsion (الجبر). For following by compulsion may not have the ruling we mentioned, even if the lover is compelled by the love established within him. But the difference between the two movements is clear.\n\nIt contains the science of connection (التوصيل) and what it produces. It contains the science of the categories of people whose reward is multiplied in the Hereafter. It contains the science of what the knower (العالم) should seek. It contains the science of what kind of following should be avoided and what should not, and what kind of caution (الحذر) is blameworthy and what is not. It contains the science of the necessary cause for the perishing of what perishes in the Cosmos. It contains the science of preference (المفاضلة) in the Cosmos by Levels (المراتب). It contains the science of lineages (الأنساب) and merits (الأحساب), and what brings honor in affiliation and what does not. The Prophet, peace and blessings be upon him, forbade slandering lineages.\n\nIt contains the science of distracting terrors (الأهوال الشاغلة). It contains the science of compulsion (الجبر) and who the compelled one is. It contains the science of transcendence (التنزيه). It contains the science of the consequences and beginnings of praise. It contains the science of rulings (الأحكام), to whom they are attributed, and who judges by them. It contains the science of the decree (التقدير) that did not occur: what would result if it had occurred, and whether its non-occurrence was out of mercy for the Cosmos or not. It contains the science of establishing proofs (الحجج). It contains the science of trial (الابتلاء) and its benefit. It contains the science of the craft of alchemy (الكيمياء). It contains the science of consideration (الاعتبار). It contains the science of wishing (التمني), what benefits and profits the wisher from it, and what does not benefit or profit. It contains the science of the suitability (أهلية) of every existent thing for what it was made suitable. It contains the science of one who rewarded better than the deed done for him, and one who answered more than what was asked of him. It contains the science of whether what the believer is forbidden from is a persistence upon the fundamental principle (الأصل) because it is an omission, and why it was delayed from the command, when both are the ruling of Allah. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب تین سو چھپن: تین پوشیدہ رازوں کے مقام کی معرفت میں، اور ادبِ الٰہی، وحیِ نفسی، اور وحیِ طبعی میں عربی راز، اور یہ مقام حضرت محمدیہ (الحضرة المحمدیۃ) سے ہے۔\n\nمیں نے اپنی جان کو اپنی جان کے لیے قربان کر دیا تاکہ میں اس سے فائز ہو جاؤں جو میرے پاس تھا مگر میں اس کے مقام سے واقف نہ تھا۔\n\nیہاں تک کہ میں نے اس کی ایک ایسی صورت دیکھی جو مجھ سے مشابہ تھی، پس میں اس میں غائب ہو گیا، اپنے شارع کے حکم سے۔\n\nکیا اس میں نعمت ہے یا اسماء (الأسماء) کے ساتھ تخلق؟ پس اس کے مبدع (پیدا کرنے والے) کے احوال کی طرف دیکھ۔\n\nپس اگر رحمن تجھ سے اپنی حکمت کے راز کے ساتھ کتابوں سے خطاب کرے، تو حاضر ہو جا، شاید تو اسے سمجھ لے۔\n\n### [بے شک اللہ تعالیٰ نے خلا (الخلأ) کو تمام عالم سے آباد کیا اور وہ اس سے بھر گیا]\n\nجان لو، اللہ تمہاری تائید کرے، کہ جب اللہ تعالیٰ نے خلا (الخلأ) کو تمام عالم سے آباد کیا تو وہ اس سے بھر گیا، اور اس میں حرکت (الحرکۃ) پیدا کی تاکہ اس کا بعض حصہ بعض میں تبدیل (استحال) ہو جائے، اور اس تبدیلیوں (الاستحالات) کے ذریعے صورتیں مختلف ہوں، اس خلا کی طبیعت کی وجہ سے جسے اس نے عالم سے بھر دیا تھا، جو اس میں تبدیل ہو گیا۔ پس وہ ہمیشہ تبدیل ہوتا رہتا ہے، اور یہی وہ خلقِ جدید (الخلق الجدید) ہے جس کے بارے میں اکثر لوگ شک اور الجھن میں ہیں۔ اور جس نے اسے اہل اللہ میں سے جانا، جنہیں اللہ نے یہ چیز ان کے باطن میں عین الیقین کے ساتھ مشاہدہ کرایا، اس نے دنیا کا آخرت میں تبدیل ہونا اور آخرت کا بعض کا بعض میں تبدیل ہونا جان لیا، جیسا کہ اس میں سے جو کچھ دنیا میں تبدیل ہوا۔\n\nجیسا کہ خبر میں وارد ہوا ہے کہ نیل، فرات، سیحان اور جیحان جنت کی نہروں میں سے ہیں جو تبدیل ہو کر دنیا میں ظاہر ہوئیں، اس صورت کے برعکس جو ان کی آخرت میں تھی۔\n\nآپ صلی اللہ علیہ وسلم کا فرمان ہے: \"قبر اور منبر کے درمیان کی جگہ جنت کے باغوں میں سے ایک باغ ہے۔\"\n\nپس وہ دنیا میں ایک معلوم اور مقررہ رقبے میں مٹی میں تبدیل ہو گیا۔ اور اسی طرح وادی محسر، جو کہ آگ کی ایک وادی ہے، دنیا میں تبدیل ہو گئی۔ اور آدم، حوا، اور ابلیس عالمِ آخرت سے دنیا میں تبدیل ہوئے، پھر وہ آخرت میں تبدیل ہو جائیں گے، پس ان پر صورتیں بدل جائیں گی، اس موہوم جگہ کی طبیعت کے مطابق جہاں حرکت انہیں منتقل کرے گی، اور وہ ان پر اثر انداز ہو گی، خواہ وہ روح ہو یا جسمِ متحیز (محدود)، یا غیر متحیز۔ اور اللہ ہی اسے ہمیشہ حرکت دینے والا ہے۔ اور اگر ہم نہ ہوتے تو آخرت دنیا سے ممتاز نہ ہوتی، کیونکہ اللہ نے اس اضافت میں عالم میں سے صرف اسی نوعِ انسانی اور جنات کو ہی معتبر جانا ہے۔ پس اس نے انسانوں کے لیے اپنے اسم الظاہر (الظاہر) سے ظہور مقرر کیا، اور جنات کے لیے اپنے اسم الباطن (الباطن) سے بطون مقرر کیا۔ اور ان دونوں کے علاوہ ہر چیز ان کے لیے مسخر ہے، جیسا کہ وہ بذاتِ خود بعض کا بعض کے لیے مسخر ہے، ان درجات کی وجہ سے جن میں اللہ نے انہیں اتارا۔ پس ان درجات نے انہیں ان صورتوں کی شکل دی جن میں وہ تبدیل ہوئے جب الٰہی حرکت (الحرکۃ الإلٰہیۃ) انہیں وہاں منتقل کر گئی۔ اور چونکہ وہ ہماری آنکھوں کے لیے صرف یہیں ظاہر ہوئی، اس لیے اس دار کو دارِ دنیا اور پہلی زندگی (الحیاۃ الدنیا) کہا گیا۔ پس جب ہم برزخ میں تبدیل ہوں گے، اور برزخ سے ان صورتوں میں تبدیل ہوں گے جن میں نشر اور بعث ہو گا، تو اسے آخرت (الآخرۃ) کہا جائے گا۔ اور آخرت میں معاملہ ہمیشہ خلقِ جدید (خلق جدید) میں رہے گا، جس میں اہل جنت جنت میں اور اہل نار جہنم میں ہوں گے، لامتناہی طور پر۔ پس ہم آخرت میں ایک ہی عین میں خلقِ جدید کے سوا کچھ نہیں دیکھیں گے۔ پس عالم متناہی بھی ہے اور لامتناہی بھی۔\n\nاور چونکہ معاملہ ایسا ہی ہے، اس لیے انسان اپنے آپ کو جب سوتا ہے تو جنت میں یا قیامت میں یا اپنی جگہ اور شہر کے علاوہ کسی ایسی جگہ میں دیکھتا ہے جسے وہ جانتا ہے یا نہیں جانتا، اور اپنی صورت کے علاوہ کسی اور صورت میں، اور اپنی حالت کے علاوہ کسی اور حالت میں۔ پس وہ اپنی ذات میں اس حرکت کے ذریعے تبدیل ہو گیا جس نے اسے بیداری سے نیند کی طرف منتقل کیا، ایسی صورتوں کی طرف جنہیں وہ بعض اوقات پہچانتا ہے اور بعض اوقات نہیں پہچانتا، اور ایسی محمود اور اچھی حالتوں کی طرف جن سے وہ خوش ہوتا ہے، اور ایسی مذموم اور بری حالتوں کی طرف جن سے وہ تکلیف محسوس کرتا ہے۔ پھر تبدیلی (الاستحالۃ) تیزی سے اس کی طرف آتی ہے اور وہ بیداری کی طرف لوٹ آتا ہے، یا تو اس معنی کی تکمیل کے ساتھ جس میں وہ نیند میں تبدیل ہوا تھا اور اس میں کچھ باقی نہیں رہا جو اسے اس خاص تبدیلی میں دے سکے—اور یہی وہ شخص ہے جو بغیر کسی سبب کے بیدار ہوتا ہے، اور یہ طبعی بیداری ہے، جب نفس نے آنکھ کے لیے نیند کا حق پورا کر لیا جس میں اس کی راحت تھی۔ یا پھر وہ کسی سبب سے نیند سے بیداری کی طرف منتقل ہوا، خواہ وہ حسی (الحس) جہت سے ہو یا کسی خوفناک امر سے، یا کسی پریشان کن حرکت سے جو اس کے سونے کی حالت میں ظاہر ہوئی اور وہ بیدار ہو گیا۔ اگر یہ امر آنکھ کے طبعی نیند کے حق کی تکمیل کے موافق ہو تو ٹھیک ہے، اور اگر موافق نہ ہو اور آنکھ کے حق میں کچھ باقی رہ گیا ہو، جسے وہ اس سبب کے بغیر پورا کر لیتی، تو وہ اسے کسی دوسری نیند میں پورا کرے گا۔ اور اسی وجہ سے بعض سونے والوں کی نیند ایک وقت میں لمبی ہو جاتی ہے، اور اس کی لمبائی کا سبب وہی ہے جو ہم نے ذکر کیا۔ اور اس کی نیند کا مختصر ہونا دو میں سے ایک امر کی وجہ سے ہے، اور وہ وہی ہے جو ہم نے ذکر کیا:\n\nیا تو کسی ایسے سبب کی وجہ سے جو اسے بیدار کر دے، یا اس خاص نیند میں آنکھ کے حق کی تکمیل کی وجہ سے، اس مزاج (المزاج) کے سبب جو اس پر غالب ہو۔ کیونکہ تھکے ہوئے شخص کا مزاج اور آرام دہ شخص کا مزاج برابر نہیں ہوتا۔ تھکا ہوا شخص ایسی راحت طلب کرتا ہے جس سے وہ تھکاوٹ دور کر سکے، پس نیند اس پر غالب آ جاتی ہے اور لمبی ہو جاتی ہے کیونکہ وہ راحت کی تکمیل چاہتا ہے۔ پس تکمیل سے پہلے اسے صرف تین چیزوں میں سے کوئی ایک یا سب یا بعض بیدار کر سکتے ہیں، جیسا کہ واقع ہو: یا تو کوئی پریشان کن امر جو وہ اپنی نیند میں دیکھے، یا کوئی بیدار شخص اسے جان بوجھ کر بیدار کر دے، یا کوئی زوردار چیخ یا حرکت، یا حسی عالم (عالم الحس) میں ان اسباب میں سے کوئی بھی جو اس کی بیداری کے لیے مقصود ہو یا غیر مقصود بلکہ اتفاقاً واقع ہو جائے۔ اور تیسرا امر یہ ہے کہ نفس کسی کام کو پورا کرنے کے خیال سے متعلق ہو جسے وہ کرنا چاہتا ہے، پس وہ اسی خیال پر سو جاتا ہے، اور وہ خیال اس امر سے متعلق ہوتا ہے، پس وہ اسے پریشان کرتا ہے اور وہ نیند کا حق پورا کرنے سے پہلے بیدار ہو جاتا ہے۔ اور جو کچھ ہم نے ذکر کیا ہے اس کا مقصد صرف تمہیں یہ بتانا ہے کہ عالم ہر سانس میں تبدیلی (الاستحالۃ) سے خالی نہیں ہوتا۔ اور اگر اس جوہر (الجوہر) کی عین جو اس تبدیلی کو اپنی ذات میں قبول کرتا ہے، ایک ثابت اور واحد نہ ہوتی جو اپنے جوہر کے لحاظ سے تبدیل نہیں ہوتا، تو جب وہ کسی امر میں تبدیل ہوتا تو اسے معلوم نہ ہوتا کہ اس تبدیلی سے پہلے وہ کس حال پر تھا۔ البتہ، تبدیلیاں بعض اوقات پوشیدہ اور باریک ہوتی ہیں، اور بعض اوقات ظاہر ہوتی ہیں جنہیں نفس محسوس کرتا ہے، جیسے اس کے خواطر اور اس کی ظاہری حرکات اور اس کے احوال کی تبدیلی، اور وہ باریک اور پوشیدہ ہوتی ہیں جیسے اس کے علوم اور اس کی قوتوں کی تبدیلی، اور رنگ بدلنے والی چیزوں کے رنگوں کی تبدیلی ان کی مثالوں کی تجدید کے ساتھ۔ پس اس امر کو صرف اہل کشف (أهل الکشف) ہی سمجھ سکتے ہیں، کیونکہ کشف (الکشف) نے ان سے وہ الجھن دور کر دی ہے جس نے دوسروں کو اس امر کے ادراک سے اندھا کر دیا ہے۔\n\nاگر تم کہو کہ یہ صورتیں کیا ہیں جن میں عالم کے جواہر تبدیل ہوتے ہیں؟ ہم کہیں گے: وہ ممکنات (الممکنات) ہیں، اور کچھ نہیں۔ وہ اپنے ثبوت کی شیئیت (شیئية ثبوتها) میں ہیں، اور یہی اللہ تعالیٰ کا قول ہے: **إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ** (ہم جب کسی چیز کا ارادہ کرتے ہیں تو ہمارا کہنا صرف یہ ہوتا ہے)۔ پس جب وہ اس کے قول \"کن\" (ہو جا) سے ظاہر ہوتا ہے، تو یہ وجود کی شیئیت (شیئية الوجود) نہیں ہوتی، اور یہی اس کا قول ہے: **وقَدْ خَلَقْتُكَ من قَبْلُ ولَمْ تَكُ شَيْئاً** (حالانکہ میں تجھے اس سے پہلے پیدا کر چکا ہوں اور تو کوئی چیز نہ تھا)۔ یعنی تیری قدرت، یعنی تیرے لیے وجود کی شیئیت نہ تھی، حالانکہ حقیقت میں وہ ظہور کی شیئیت (شیئية الظہور) ہے، اس کی عین کے لیے ظہور، اگرچہ وہ اپنے ثبوت کی شیئیت میں اپنی حقیقت کے لحاظ سے دوسروں سے ممتاز ظاہر ہے، لیکن اپنے رب کے لیے، اپنی ذات کے لیے نہیں۔ پس وہ اپنی ذات کے لیے ظاہر نہیں ہوا مگر اس کے ظہور کے ساتھ امرِ الٰہی (الأمر الإلٰہی) کے تعلق کے بعد، جو اس کے قول \"کن\" سے ہے۔ پس اس نے اپنی ذات کے لیے اپنا ظہور حاصل کیا، اور اپنی ذات کو پہچانا اور اپنی عین کا مشاہدہ کیا۔ پس وہ اپنے ثبوت کی شیئیت سے اپنے وجود کی شیئیت میں تبدیل ہو گیا، اور اگر تم چاہو تو کہو کہ وہ اپنی ذات میں اس حالت سے تبدیل ہو گیا کہ وہ اپنی ذات کے لیے ظاہر نہ تھا، اس حالت کی طرف جس سے وہ عزیز و علیم (العزیز العلیم) کی تقدیر سے اپنی ذات کے لیے ظاہر ہوا۔ پس سارا عالم طلوع کرنے والا، غروب ہونے والا، ایک گھومتا ہوا فلک، اور ایک تیرتا ہوا ستارہ ہے جو طلوع اور غروب کے درمیان ظاہر ہے، الٰہی وحی (وحی إلهي) کے ذریعے—اور وہ یہ ہے کہ جو امر اس پر ظہور اور خفا کے ساتھ متوجہ ہوتا ہے—اور وحیِ نفسی (وحي نفسي) کے ذریعے—اور وہ یہ ہے جو حق (الحق) اس سے طلب کرتا ہے اور جو وہ حق تعالیٰ سے طلب کرتا ہے، پس وہ حق کی طرف وحی کرتا ہے جیسا کہ حق نے اس کی طرف وحی کی—پس حق اس پر عمل کرتا ہے جو اس کے بندے نے اس کی طرف وحی کی، کبھی اور کبھی نہیں کرتا، جیسا کہ بندہ جب حق اس کی طرف وحی کرتا ہے اور اسے کسی چیز کے کرنے یا چھوڑنے کا حکم دیتا ہے تو وہ کبھی اس کی اطاعت کرتا ہے اور کبھی نافرمانی کرتا ہے۔ پس حق مکلف کے لیے عطا اور انکار کی صورت میں ظاہر ہوا، پس بندے نے حق میں اپنی صورت کے سوا کچھ نہیں دیکھا۔ پس وہ اپنے آپ کو ہی ملامت کرے اگر وہ کسی معاملے میں حق کو پکارے اور وہ اسے جواب نہ دے۔ کیا تم فرشتوں کو نہیں دیکھتے، جب انہوں نے اللہ کی نافرمانی نہیں کی اس فعل میں جس کے لیے اس نے انہیں بلایا، جیسا کہ ان کے بارے میں خبر دی گئی ہے، تو انہوں نے کسی چیز میں اسے نہیں پکارا مگر اس نے انہیں جواب دیا، کیونکہ وہ اس صورت پر نہیں ہیں جو انہیں اس چیز سے روکتی ہو جس کے لیے حق نے انہیں بلایا۔ اور عالم حق میں صرف اسی چیز کی صورت کا مشاہدہ کرتا ہے جس پر وہ خود ہے۔ اور اسی لیے نبی صلی اللہ علیہ وسلم نے اس شخص کے بارے میں فرمایا جو سورۃ فاتحہ پڑھنے کے بعد \"آمین\" کہتا ہے: \"جس کی آمین فرشتوں کی آمین کے موافق ہو گئی، اس کے گناہ بخش دیے گئے۔\"\n\nکیونکہ فرشتوں کی آمین اللہ کے ہاں مقبول اور مجاب ہے۔ پس اس نے فرشتوں کے لیے اجابت کے وقت کو موافق پایا، اور اسے تبعیت کے حکم سے اجابت حاصل ہو گئی، مگر یہ کہ اس کا وقت اس کے لیے اجابت کا وقت ہو، اس چیز کے بدلے میں جو اس نے کسی وقت حق کے حکم کی تعمیل کی۔ اور عالم میں اصل، تکوین (التکوین) میں امرِ الٰہی (الأمر الإلٰہی) کا قبول کرنا ہے، اور نافرمانی ایک عارضی امر ہے جو اس کے لیے نسبتاً پیش آیا ہے۔ اور حقیقت میں کسی نے اللہ کی نافرمانی نہیں کی اور نہ ہی اطاعت کی، بلکہ امر سارا اللہ ہی کے لیے ہے، اور یہی اس کا قول ہے: **وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ** (اور تمام معاملات اسی کی طرف لوٹائے جاتے ہیں)۔ پس بندوں کے افعال اللہ کی تخلیق ہیں، اور بندہ اس تخلیق کا محل ہے۔ پس سارا عالم تین رازوں میں محدود ہے: اس کا جوہر، اس کی صورتیں، اور تبدیلی (الاستحالۃ)۔ اور کوئی چوتھا امر نہیں ہے۔ اگر تم کہو کہ عالم میں تبدیلی (الاستحالۃ) کا حکم الٰہی حقائق سے کیسے ظاہر ہوا؟ ہم کہیں گے کہ حق نے اپنی ذات کو اس طرح بیان کیا ہے کہ **كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ** (وہ ہر دن ایک نئی شان میں ہوتا ہے)، اور یہ شانیں مختلف ہیں۔ اور اس نے اپنی ذات کو اپنے بندے کی توبہ پر خوش ہونے سے بیان کیا، حالانکہ وہ اس کے ہونے سے پہلے اس پر خوش نہیں ہوا تھا۔ اور اسی طرح\n\nنبی صلی اللہ علیہ وسلم کا فرمان ہے: **إِنَّ اللهَ لَا يَمَلُّ حَتَّى تَمَلُّوا** (بے شک اللہ نہیں تھکتا جب تک تم تھک نہ جاؤ)۔\n\nاور اس کے عارفین، جو کہ رسول ہیں، نے اس کے بارے میں ذکر کیا ہے کہ اللہ تعالیٰ قیامت کے دن ایسا غضب فرمائے گا جیسا اس نے اس سے پہلے کبھی نہیں کیا اور نہ اس کے بعد کبھی کرے گا، جیسا کہ اس کے جلال کے لائق ہے۔ پس انہوں نے اس کی صفت بیان کی کہ وہ اس غضب سے پہلے ایک ایسی حالت پر تھا جس میں وہ اس غضب سے متصف نہ تھا۔ اور صحیح حدیث میں وارد ہے کہ قیامت کے دن جب وہ اپنے بندوں پر تجلی (التجلی) فرمائے گا تو صورتوں میں تبدیل ہو گا، اور یہ تحول (التحول) عین تبدیلی (الاستحالۃ) ہے، ظہور میں اس کے سوا کچھ نہیں۔ اور اگر ایسا نہ ہوتا تو عالم کے لیے تخلیق میں ابتدا صحیح نہ ہوتی، اور عالم وجود میں اللہ کے مساوی ہوتا، اور یہ حقیقتِ امر میں صحیح نہیں ہے۔ پس جس طرح اللہ تعالیٰ نے اپنے بندوں کے لیے مختلف صورتوں میں ظاہر ہونا قبول کیا، اسی طرح اس نے پہلے خلق نہیں کیا تھا پھر خلق کیا، پس وہ ازل میں عالم اور قادر ہونے کی صفت سے متصف تھا، یعنی ممکن کو وجود میں لانے کی قدرت رکھتا تھا، لیکن اسے اختیار تھا کہ وہ اپنے ایجاد کی صورت میں ظاہر ہو یا نہ ہو۔ پس وہ ممکن کی صورت کے ایجاد میں ظاہر ہوا جب اس نے چاہا۔ اور اس کی ذاتِ سبحانہ کے لحاظ سے ممکنات میں کوئی فرق نہیں ہے۔ اور ہم جانتے ہیں کہ اللہ نے زید کو مثال کے طور پر کل یا ابھی پیدا کیا ہے، پس اس کا وجود مؤخر ہوا، حالانکہ حق قادر تھا۔ پس یہی حکم عالم کے پہلے موجود پر بھی لازم آتا ہے کہ اللہ چیز کو ایجاد کرنے کی قدرت سے متصف ہو، اگرچہ وہ اسے ایجاد نہ کرے، جیسا کہ تم اپنے سکون کے وقت حرکت پر قادر ہو اگرچہ تم حرکت نہ کرو۔ اور اس سے کوئی محال لازم نہیں آتا، کیونکہ اس ممکن میں جو ابھی موجود ہے اور دوسروں سے مؤخر ہے، اور پہلے ممکن میں کوئی فرق نہیں ہے۔ کیونکہ حق زید کے عدم کے وقت زید کو ایجاد کرنے کی صفت سے متصف نہیں ہے۔ پس صورت ایک ہی ہے اگر تم سمجھو۔ البتہ، لفظِ تبدیلی (الاستحالۃ) کا اطلاق اللہ پر نہیں کیا جاتا، اگرچہ اس نے اپنی ذات پر تحول (التحول) کا اطلاق کیا ہے، پس ہم اس پر رکتے ہیں، اس کے ساتھ جو ہم نے ذکر کیا ہے وہ معقول ہے۔ پس اللہ کے سوا کچھ نہیں، اور توجہ (التوجہ)، اور ممکنات کا اس چیز کو قبول کرنا جو اللہ نے اس توجہ سے ارادہ کیا۔ پس یہ تین چیزیں ضروری ہیں اور ان کے حکم کا ظہور بھی ضروری ہے۔ پس غروب صرف اس طلوع کے بعد ہی ہوتا ہے جو طلوع کر کے پھر غروب ہو گیا، اور ظہور صرف بطون (پوشیدگی) سے ہوتا ہے، نہ کہ بطون کے بعد۔ اور میرے قول \"نہ کہ بطون کے بعد\" سے میری مراد یہ ہے کہ وہ پہلے ظاہر نہیں تھا پھر پوشیدہ ہوا پھر اس پوشیدگی سے ظاہر ہوا، بلکہ وہ ہمیشہ باطن رہا، پھر اللہ نے اسے ظاہر کیا، پس وہ اپنی ذات کے لیے ظاہر ہوا۔\n\n### «وصل» چونکہ موصوف کی وصفِ نفسی (الوصف النفسی) کو ختم کرنا ممکن نہیں،\n\nمگر یہ کہ موصوف بھی اس کے ساتھ ختم ہو جائے، کیونکہ وہ عینِ موصوف ہے، اس کے سوا کچھ نہیں، اور ممکنات کے لیے عدم (العدم) کا تقدم ایک وصفِ نفسی (نعت نفسی) تھا، کیونکہ ممکن کے لیے ازل میں وجود (الوجود) محال ہے، پس اس کے لیے ازلی عدم ہی باقی رہا۔ اور ممکنات اپنی ذات میں حقائق اور صورتوں میں ممتاز ہیں، کیونکہ حقائق یہی تقاضا کرتی ہیں۔ پس جب اللہ نے ارادہ کیا کہ انہیں وجود کی حالت پہنائے، اور وہاں اللہ کے سوا کچھ نہیں تھا، اور وہ عینِ وجود (عین الوجود) ہے اور وہ موجود (الموجود) ہے، تو وہ ممکنات کے لیے ممکنات کے استعدادات اور ان کی حقائق کے ساتھ ظاہر ہوا، پس انہوں نے اپنے آپ کو اپنے موجد کے وجود میں اپنی ذات سے دیکھا، اور وہ عدم کی حالت پر ہی تھے، کیونکہ انہیں اپنی عدم کی حالت میں بھی ادراکات حاصل ہیں، جیسا کہ وہ اپنی عدم کی حالت میں بھی اپنے مدرک کو مدرک ہیں۔ اور اسی لیے شریعت میں آیا ہے کہ اللہ ممکن کو تکوین (التکوین) کا حکم دیتا ہے تو وہ بن جاتا ہے۔ پس اگر اس میں سننے کی حقیقت نہ ہوتی اور وہ حق کے امر کو نہ سمجھتا جب وہ اس پر متوجہ ہوتا، تو وہ نہ بنتا، اور نہ اللہ اسے تکوین سے متصف کرتا اور نہ ہی اپنی ذات کو اس چیز کے لیے قول سے متصف کرتا جو عدم سے متصف ہے۔ پس اسی طرح ممکن کے لیے وہ تمام قوتیں ہیں جن سے وہ ان مدرکات کو سمجھتا ہے جو ان ادراکات کے لیے خاص ہیں۔ پس جب اللہ نے انہیں تکوین کا حکم دیا تو انہوں نے کوئی ایسا وجود نہ پایا جس سے وہ متصف ہوں، کیونکہ وہاں حق کے وجود کے سوا کچھ نہ تھا۔ پس وہ حق کے وجود میں صورتوں کی شکل میں ظاہر ہوئے۔ اسی لیے الٰہی اور کونی صفات آپس میں گھل مل گئیں، پس مخلوق کو حق کی صفات سے متصف کیا گیا اور حق کو مخلوق کی صفات سے متصف کیا گیا۔ پس جس نے کہا کہ میں نے اللہ کے سوا کچھ نہیں دیکھا، اس نے سچ کہا، اور جس نے کہا کہ میں نے عالم کے سوا کچھ نہیں دیکھا، اس نے سچ کہا، اور جس نے کہا کہ میں نے کچھ نہیں دیکھا، اس نے تبدیلی (الاستحالۃ) کی تیزی اور عدمِ ثبات کی وجہ سے سچ کہا، پس وہ کہتا ہے کہ میں نے کچھ نہیں دیکھا۔ اور جس نے کہا کہ میں نے کوئی چیز نہیں دیکھی مگر اس سے پہلے اللہ کو دیکھا، تو یہ وہی ہے جو ہم نے کہا کہ ممکن کو اپنی عدم کی حالت میں ادراک حاصل ہوتا ہے۔ پس جب اسے تکوین کا امرِ الٰہی آیا تو اس نے حق کے وجود کے سوا کچھ نہ پایا، پس وہ اس میں اپنی ذات کے لیے ظاہر ہوا، اور اس نے اپنی ذات کو دیکھنے سے پہلے حق کو دیکھا۔ پس جب حق کے وجود نے اسے پہنا دیا، تو اس نے اس وقت اپنی ذات کو دیکھا، پس اس نے کہا: میں نے کوئی چیز نہیں دیکھی مگر اس سے پہلے اللہ کو دیکھا، یعنی اس سے پہلے کہ وہ اس میں متکون ہو، پس حق اس چیز کی صورت کو قبول کرے۔ پس جس نے اس امر کو اس طرح نہ جانا، اس نے نہ حق کو جانا اور نہ خلق کو اور نہ ان نسبتوں کو۔ پس **كُلُّ شَيْ‏ءٍ هالِكٌ** (ہر چیز ہلاک ہونے والی ہے) صورت کے لحاظ سے تبدیلیوں (الاستحالات) کی وجہ سے، **إِلَّا وَجْهَهُ** (سوائے اس کی ذات کے)۔ اور \"وجہہ\" میں ضمیر \"شیئ\" (چیز) کی طرف لوٹتی ہے۔ پس چیز اپنی صورت کے لحاظ سے ہلاک ہونے والی ہے، مگر اپنے وجہ اور اپنی حقیقت کے لحاظ سے ہلاک ہونے والی نہیں۔ اور وہ حق کا وجود ہے جس سے وہ اپنی ذات کے لیے ظاہر ہوا۔ **لَهُ الْحُكْمُ** (اسی کا حکم ہے) یعنی اس چیز کے لیے وجہ میں حکم ہے، پس صورتوں کے اختلاف سے اس پر احکام مختلف ہوتے ہیں۔ **وَإِلَيْهِ تُرْجَعُونَ** (اور تم اسی کی طرف لوٹائے جاؤ گے) اس حکم میں، یعنی اس چیز کی طرف وہ حکم لوٹتا ہے جو وجہ پر لگایا گیا تھا۔ پس حکم اور تحکیم تبدیلی (الاحالۃ) کے لیے ہے، کیونکہ وہ لامحالہ مقصود ہے۔ پس ایک ہی عین میں ہلاکت اور ایجاد کے سوا کچھ نہیں ہے۔ اللہ کی تخلیق میں کوئی تبدیلی نہیں ہے: **لَا تَبْدِيلَ لِخَلْقِ اللهِ** (اللہ کی تخلیق میں کوئی تبدیلی نہیں)، **لَا تَبْدِيلَ لِكَلِمَاتِ اللهِ** (اللہ کے کلمات میں کوئی تبدیلی نہیں)، بلکہ تبدیلی اس کے لیے ہے، جیسا کہ **لِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ** (اللہ ہی کے لیے ہے حکم پہلے بھی اور بعد میں بھی)۔ وہ اس سے فیصلہ کرتا ہے کہ اس نے اپنی ذات کے بارے میں خبر دی کہ وہ **الْأَوَّلُ** (اول) اور **الْآخِرُ** (آخر) ہے ایک ہی عین سے۔ پس یہاں اور برزخ اور آخرت میں صورتوں کے سوا کچھ نہیں ہے، اور یہی وہ ہے جو اس کے قول سے آیا ہے: **إِنَّا لَمَرْدُودُونَ فِي الْحَافِرَةِ** (کیا ہم پہلی حالت کی طرف لوٹائے جائیں گے؟)۔ انہوں نے یہ وہم کیا اور اسے حقیقت نہ جانا، اسی لیے انہوں نے کہا: **كَرَّةٌ خَاسِرَةٌ** (یہ تو نقصان دہ لوٹنا ہے)۔ پس اگر وہ اسے دیکھتے تو دیکھتے کہ وہ ان کی ظاہری اعیان کے سوا کچھ نہیں ہے۔ پس انہوں نے اسے تبدیل نہ کیا اور نہ اس سے منہ موڑا، کیونکہ ان کی آنکھوں نے صرف اسی کو دیکھا۔ پس وہ اس چیز کا انکار کیسے کر سکتے ہیں جو انہوں نے دیکھا یا اس چیز کا انکار کیسے کر سکتے ہیں جس کا انہیں اپنی جانوں میں یقین ہو گیا؟ اور جسے یہ ادراک حاصل نہیں ہوا، وہ اس علم اور معرفت (المعرفۃ) سے محروم رہا جو شہود (الشہود) اور کشف (الکشف) نے عطا کی۔\n\nاور اس مقام (المنزل) میں علومِ معجزات کا علم ہے، اور طمس (مٹانے) کا علم ہے، اور تسلسل (التتالی) اور تخلیق میں موجودات کے پے در پے آنے کا علم ہے۔ اور اس میں علم الیقین (علم الیقین) ہے، اور اس میں وہ علم ہے جو خبر سے حاصل ہوتا ہے، اور اس میں وہ علم ہے جو قابلِ تعریف ہے اور جو قابلِ مذمت ہے۔ اور اس میں غضب کا علم ہے، اور یہ صرف اسی سے واقع ہوتا ہے جس نے امور کو ان کی حدود میں ان کا حق نہ دیا۔ اور اس میں کمزوروں پر رحمت کا علم ہے، اور خلق سب کے سب اصالتاً کمزور ہیں، پس رحمت انہیں شامل ہے۔ اور اس میں الٰہی اسماء (الأسماء الإلٰہیۃ) کے لیے کون (وجود) کی وراثت کا علم ہے۔ اور اس میں تمکین (التمکین) کا علم ہے۔ اور اس میں اشہاد (الإشہاد) کا علم ہے۔ اور اس میں بیان کا علم ہے تاکہ اس چیز کو ممتاز کیا جائے جس سے بچنا چاہیے اور جس سے نہیں بچنا چاہیے۔ اور اس میں مؤنث کو مذکر سے ملانے کا علم ہے، اور یہ منفعل (Passive) کو فاعل (Active) سے ملانا ہے، اس لحاظ سے کہ ایک منفعل سے دوسرا منفعل ہوتا ہے، یہاں تک کہ معاملہ ایک ایسے منفعل پر ختم ہو جائے جس سے کوئی دوسرا منفعل نہ ہو، جیسا کہ معاملہ دوسرے سرے سے ایک ایسے فاعل پر ختم ہوتا ہے جو کسی فاعل سے منفعل نہ ہو، اور وہ حق تعالیٰ ہے۔ اور اس میں ایک ہی عین میں چہروں کے اختلاف کا علم ہے۔ اور اس میں آثار (الآثار) کا علم ہے اور جو علوم وہ عالم کو ان کے ذریعے عطا کرتے ہیں۔ اور یہیں سے سامری نے جبرائیل کے اثر (أثر جبريل) سے ایک مٹھی لی تھی، اور اگر اسے آثار کے عطا کردہ علم کا علم نہ ہوتا تو وہ ایسا نہ کرتا۔ اور اسی باب سے وہ لوگ ہیں جو کسی چیز کی تلاش میں اثر کا پیچھا کرتے ہیں۔ اور اسی باب سے خوش نصیبوں کے قدموں کو بد نصیبوں کے قدموں سے پہچانا جاتا ہے، جب اس علم کا مالک زمین پر ان کے نشانات کو دیکھے، اگرچہ وہ ان کے اشخاص کو نہ دیکھے۔ پس جب وہ ان کے قدموں کے نشانات کو دیکھتا ہے تو اس پر جو ظاہر ہوتا ہے اس کے مطابق ان پر حکم لگاتا ہے۔ اور اس میں تعریض (اشارہ) کا علم ہے، اور ان کا مشہور قول ہے کہ \"تعریض میں جھوٹ سے بچنے کی گنجائش ہے۔\" اور اس میں توریہ (الٹ پھیر) کا علم ہے، اور اسی لیے نبی صلی اللہ علیہ وسلم جب کسی جہت پر حملہ کا ارادہ کرتے تو اس کے علاوہ کسی اور سے توریہ کرتے۔ اور اس میں ان احکام کا علم ہے جو اسباب عالم میں عطا کرتے ہیں۔ اور اس میں طاقتور مردوں پر احوال کے حکم کا علم ہے، بلکہ ہر چیز پر احوال کے حکم کا علم ہے۔ اور اسی باب سے اللہ کا مطیع سے راضی ہونا اور گنہگاروں میں سے جس پر چاہے غضب کرنا ہے۔ اور اس میں اس علم کا علم ہے کہ کوئی شخص اپنے ہم صفت کی مدد کیوں کرتا ہے جب دوسرا اس پر زیادتی کرتا ہے جو اس کے جسمانی مماثل کا مخالف ہے جسے اللہ نے اس پر مرکب کیا ہے، اور یہ جانوروں میں کثرت سے ظاہر ہوتا ہے۔ اور اس میں ان اسباب کا علم ہے جو اللہ عزوجل کی پناہ لینے کا باعث بنتے ہیں، اور وہ قہر (القہر) کے اسباب ہیں۔ اور اس میں خواطر (خیالات) کے سفر اور اجسام کے سفر کا علم ہے، اور ہر سفر سے کیا نتیجہ نکلتا ہے۔ اور اس میں اس علم کا علم ہے کہ انسان طبعی طور پر جس چیز کا محتاج ہوتا ہے اسے کیوں چھوڑ دیتا ہے، جیسے بعض کا یہ قول کہ \"فقیر وہ ہے جسے اللہ سے کوئی حاجت نہ ہو۔\" اور اگرچہ اس کا لفظ انتہائی قبیح ہے، لیکن معنی کے لحاظ سے یہ انتہائی حسین ہے، کیونکہ یہ تسلیم (التسلیم) کے بلند ترین درجات میں سے ہے۔ اور اس مقام کا مالک وہ ہے جس نے اللہ کو وکیل بنایا، اس علم کی وجہ سے کہ اللہ تعالیٰ اس بندے کے لیے زیادہ جانتا ہے کہ کیا مصلحت ہے، پس بندہ اپنی جہالت کی وجہ سے کوئی حاجت مقرر نہیں کرتا۔ پس فقیر کو اللہ سے کوئی معین حاجت نہیں ہوتی، بلکہ وہ اپنا سارا معاملہ اللہ کے سپرد کر دیتا ہے۔ اور اس میں اس علم کا علم ہے کہ جس کا یہ مقام ہو اور یہ حال ہو تو کیا نتیجہ نکلتا ہے۔ اور اس میں اس علم کا علم ہے جس نے عورتوں کی قدر اور وجود میں ان کے مقام کو پہچانا۔ اور اسی لیے اللہ نے انہیں محمد صلی اللہ علیہ وسلم کے لیے محبوب بنایا، کیونکہ یہ اختصاص (الاختصاص) کے رازوں میں سے ہے۔ اور جب موسیٰ علیہ السلام نے اس کی قدر کو جانا، تو انہوں نے ایک عورت کے مہر میں دس سال کے لیے خود کو اجرت پر دے دیا۔ اور عورتوں سے میری مراد وہ انوثت (الأنوثۃ) ہے جو عالم میں جاری ہے، اور وہ عورتوں میں زیادہ ظاہر تھی، اسی لیے وہ اس کے لیے محبوب بنائی گئیں جس کے لیے وہ محبوب بنائی گئیں۔ کیونکہ عقلی نظر اس چیز کو نہیں دیتی، کیونکہ وہ طبعی شہوت سے دور ہے۔ اور اس عقل کو یہ معلوم نہیں کہ وہ حیوانی طبعی شہوت سے اپنے گمان میں صرف طبعی شہوت کے ذریعے ہی پاک ہوا ہے۔ پس اس نے کسی چیز سے زہد نہیں کیا مگر اسی چیز کے ذریعے جس سے اس نے زہد کیا، پس وہ اس کے حکم سے باہر نہیں نکلا۔ اور یہ جاہلوں میں سب سے بڑا جاہل ہے۔ اور اگر عورتوں کی شرافت میں صرف یہی نہ ہوتا کہ نکاح کے وقت ان کے لیے سجدے کی ہیئت اختیار کی جاتی ہے، اور سجدہ نماز میں بندے کی اشرف ترین حالت ہے، اور اگر مجھے یہ خوف نہ ہوتا کہ میں سننے والوں کے نفوس میں شہوت کو ابھار دوں گا، جس سے ایسے امور پیدا ہوں گے جن میں مخلوق اس چیز سے پردے میں آ جائے گی جس کی طرف حق نے انہیں بلایا ہے، اس جہالت کی وجہ سے جو وہ اس چیز کے بارے میں رکھتے ہیں جو میں اس بارے میں ذکر کروں گا، لیکن اس کے لیے ایسے مقامات ہیں جہاں اسے استعمال کیا جاتا ہے، تو میں اس میں سے وہ ظاہر کر دیتا جس پر کسی چیز کی فضیلت ظاہر نہ ہوتی۔ اور اسی لیے اس کے ساتھ خوشبو اور نماز کی محبت کو جوڑا گیا، اور \"الطيّب\" (پاکیزہ) اللہ کے اسماء میں سے ہے۔ اور اگر تم اس پر غور کرو جو اللہ نے موسیٰ علیہ السلام کے لیے الٰہی کلام (الکلام الإلٰہی) سے پیدا کیا جب وہ اپنے اہل کے لیے آگ کی ضرورت کی وجہ سے نکلے تھے، تو ان کے اپنے اہل کے لیے کوشش کرنے اور اپنی ضرورت (آگ) کے لیے خود کو تھکانے کی وجہ سے حق نے انہیں پکارا اور ان سے کلام کیا، اور فرمایا: **أَنْ بُورِكَ مَنْ فِي النَّارِ وَمَنْ حَوْلَهَا** (برکت دی گئی اس کو جو آگ میں ہے اور جو اس کے ارد گرد ہے)۔ اور اس میں اختلاف (الخلاف) کی عین میں حق کے وجود کا علم ہے، جیسا کہ وہ اتفاق (الاتفاق) کی عین میں پایا جاتا ہے، اس شخص کے لیے جو عقل رکھتا ہے۔ اور اس میں اعلیٰ کا ادنیٰ کا محتاج ہونا اور اس کی ضرورت کا علم ہے۔ اور یہ علم مشکل ترین علوم میں سے ہے، کیونکہ اس کا میزان بہت باریک ہے۔ پس ہر کوئی اس میزان سے وزن نہیں کر سکتا، خاص طور پر اس کے قول میں: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ** (اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں، میں ان سے کوئی رزق نہیں چاہتا اور نہ یہ چاہتا ہوں کہ وہ مجھے کھلائیں)۔ پس تم اس کے قول **مَا أُرِيدُ مِنْهُمْ مِنْ رِزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ** میں کس چیز سے حفاظت کرتے ہو؟ اور ہم جانتے ہیں کہ وہ نہ کھلاتا ہے اور نہ اپنے بندوں سے رزق طلب کرتا ہے، بلکہ **هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ** (وہ ہی رزق دینے والا، بڑی قوت والا ہے)۔ چونکہ قوت ہم میں غذا کے لیے ہوتی ہے، اس لیے اس نے فرمایا: **أَنْ يُطْعِمُونِ** (کہ وہ مجھے کھلائیں)، پس میری قوت اس چیز سے ہو جس کی میں نے طمع کی، بلکہ میری قوت بغیر غذا اور طعام کے ہے۔ اور اس میں عالم میں امامت کا علم ہے، اور یہ کہ عالم کا امر اس کے بغیر جمع نہیں ہو سکتا اور مصالح اس کے بغیر نہیں ہو سکتیں۔ اور اس میں علم سکھانے کا علم ہے۔ اور اس میں غیبِ اضافی (الغیب الإضافی) کا علم ہے، اور کوئی غیبِ مطلق نہیں ہے۔ اور اس میں اس شخص کا علم ہے جس نے کوئی چیز طلب کی، پھر جب اسے دی گئی تو اس نے اسے واپس کر دیا اور قبول نہ کیا، پس وہ کیا سبب تھا جس نے طالب کو اس کے طلب پر آمادہ کیا، اور وہ کیا سبب تھا جس نے اسے واپس کرنے اور قبول نہ کرنے پر مجبور کیا؟ پس اس پر مطلقاً طلب کی طرف لے جانے والے سبب کا علم مبنی ہے، بغیر کسی طالب کو دوسرے طالب سے خاص کیے ہوئے۔ اور اس میں اس علم کا علم ہے کہ شخص صرف اسی کی پیروی کرتا ہے جس کا اس پر حکم ہو، اور اس پر صرف وہی حکم کرتا ہے جسے اس سے عشق (التعشق) ہو۔ اور یہ اختیاری پیروی ہے، جبری پیروی نہیں۔ کیونکہ جبری پیروی میں وہ حکم نہیں ہو سکتا جو ہم نے ذکر کیا، اگرچہ عاشق اس عشق کی وجہ سے مجبور ہوتا ہے جو اس کے ساتھ قائم ہے، لیکن دونوں حرکتوں میں فرق ظاہر ہے۔ اور اس میں توصیل (ملانے) کا علم ہے اور اس سے کیا نتیجہ نکلتا ہے۔ اور اس میں ان اصناف کا علم ہے جن کے لیے آخرت میں عطا کو دوگنا کیا جائے گا۔ اور اس میں اس علم کا علم ہے جس کے لیے عالم کو طلب کرنا چاہیے۔ اور اس میں اس اتباع کا علم ہے جس سے بچنا چاہیے اور جس سے نہیں بچنا چاہیے، اور اس احتیاط کا علم ہے جو قابلِ مذمت ہے اور جو قابلِ مذمت نہیں۔ اور اس میں اس سبب کا علم ہے جو عالم میں ہلاک ہونے والی چیزوں کی ہلاکت کا موجب بنتا ہے۔ اور اس میں مراتب کے لحاظ سے عالم میں فضیلت (المفاضلۃ) کا علم ہے۔\n\nاور اس میں نسبوں اور حسبوں کا علم ہے، اور وہ کیا ہے جس سے انتساب میں شرف حاصل ہوتا ہے اور کیا ہے جس سے نہیں ہوتا۔ اور نبی صلی اللہ علیہ وسلم نے نسبوں میں طعن کرنے سے منع فرمایا ہے۔\n\nاور اس میں مشغول کر دینے والی ہولناکیوں کا علم ہے۔ اور اس میں جبر (الجبر) کا علم ہے اور یہ کہ مجبور کون ہے۔ اور اس میں تنزیہ (التنزیہ) کا علم ہے۔ اور اس میں تعریف کے انجام اور اس کی ابتدا کا علم ہے۔ اور اس میں احکام کا علم ہے اور وہ کس کی طرف منسوب ہوتے ہیں اور کون ان کا حکم دیتا ہے۔ اور اس میں اس تقدیر کا علم ہے جو واقع نہیں ہوئی، اگر وہ واقع ہوتی تو کیا نتیجہ نکلتا، اور کیا اس کا واقع نہ ہونا عالم پر رحمت کے باب سے ہے یا نہیں؟ اور اس میں حجتیں قائم کرنے کا علم ہے۔ اور اس میں ابتلاء (آزمائش) کا علم ہے اور اس کا فائدہ کیا ہے۔ اور اس میں کیمیا (الکیمیاء) کی صنعت کا علم ہے۔ اور اس میں اعتبار (غور و فکر) کا علم ہے۔ اور اس میں تمنا (التمنی) کا علم ہے اور اس سے کیا فائدہ ہوتا ہے اور متمنی کو کیا نفع دیتا ہے اور کیا فائدہ نہیں دیتا اور نفع نہیں دیتا۔ اور اس میں ہر موجود کی اس چیز کے لیے اہلیت کا علم ہے جس کے لیے وہ اہل بنایا گیا ہے۔ اور اس میں اس شخص کا علم ہے جس نے اس سے بہتر بدلہ دیا جو اس کے لیے عمل کیا گیا، اور اس شخص کا علم ہے جس نے اس سے زیادہ جواب دیا جو اس سے پوچھا گیا۔ اور اس میں اس علم کا علم ہے کہ مومن کو جس چیز سے منع کیا گیا ہے، کیا وہ اصل پر باقی رہنا ہے کیونکہ وہ ترک ہے، اور وہ امر سے کیوں مؤخر ہوا، حالانکہ دونوں اللہ کا حکم ہیں؟ اور **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب سیصد و پنجاه و ششم در معرفت منزل سه راز پنهان و سرّ عربی در ادب الهی، وحی نفسانی و طبیعی، و این باب از حضرت محمدیه (الحضرة المحمدية) است.\n\nجانم را فدای جانم کردم تا به کسی دست یابم\nکه نزد من بود و جایگاهش را نمی‌دانستم.\n\nتا آنکه شکلی دیدم که شبیه من بود\nپس به فرمان شارعش (مشرعه) در آن غرق شدم.\n\nآیا برای نعمت یافتن به اوست یا برای تخلق به اسماء؟\nپس به احوال آفریننده‌اش بنگر.\n\nاگر خداوند رحمان از کتاب‌ها با تو سخن گوید\nبه راز حکمتش، پس حاضر باش، شاید آن را دریابی.\n\n### [اینکه خداوند متعال خلأ را با تمام عالم آباد کرد و پر شد]\n\nبدان، خداوند تو را تأیید کند، هنگامی که خداوند متعال خلأ را با تمام عالم آباد کرد، آن خلأ پر شد و خداوند در آن حرکت را آفرید تا اجزای آن به یکدیگر استحاله (استحالة) یابند و صورت‌ها در آن به واسطه استحالات (الاستحالات) مختلف شوند؛ به دلیل طبیعت آن خلأ که آن را از عالمی که به آن استحاله یافته، پر کرده است. پس پیوسته در حال استحاله است و این همان خلق جدید (الخلق الجديد) است که بیشتر مردم در مورد آن در ابهام و شک هستند. و هر کس از اهل الله (أهل الله) که خداوند این امر را به عین در باطنشان به شهود (الشهود) رسانده است، استحاله دنیا به آخرت و استحاله آخرت به یکدیگر را می‌داند، همان‌گونه که آنچه از آن به دنیا استحاله یافت.\n\nچنانکه در خبر آمده است درباره نیل و فرات و سیحان و جیحان که آن‌ها از نهرهای بهشت هستند که استحاله یافتند و در دنیا به صورتی متفاوت با صورتی که در آخرت داشتند، ظاهر شدند.\n\nسخن پیامبر (ص) که فرمود: «بین قبر و منبر من باغی از باغ‌های بهشت است» (قوله بين قبري ومنبري روضة من رياض الجنة).\n\nپس به صورت خاکی در دنیا در مساحتی معلوم و اندازه‌گیری شده استحاله یافت. همچنین وادی مُحَسِّر، دره‌ای در آتش است که به دنیا استحاله یافته است. و آدم و حوا و ابلیس از عالم آخرت به دنیا استحاله یافتند و سپس به آخرت استحاله خواهند یافت. پس صورت‌هایشان بر حسب آنچه طبیعت مکان موهوم که حرکت آن‌ها را به آنجا منتقل می‌کند، تغییر می‌یابد و در آن‌ها تأثیر می‌گذارد، خواه روح باشد یا جسمی دارای حیز یا غیر دارای حیز؛ و خداوند پیوسته محرک آن است. و اگر ما (نوع انسانی) نبودیم، آخرت از دنیا متمایز نمی‌شد، زیرا خداوند در این اضافه (نسبت) از عالم، جز این نوع انسانی و جن را در نظر نگرفت. پس ظهور را برای انس از اسم «الظاهر» قرار داد و بطون را برای جن از اسم «الباطن». و غیر از این دو، مسخر آن‌ها هستند، همان‌گونه که عالم در ذات خود مسخر بعضی برای بعضی دیگر است به خاطر درجاتی که خداوند آن‌ها را در آن نازل کرده است. پس درجات، صورت‌هایی را که به آن‌ها استحاله یافتند، هنگامی که حرکت الهی آن‌ها را به آنجا منتقل کرد، به آن‌ها بخشید. و چون این دار جز در اینجا برای اعیان ما ظاهر نشد، این دار، دار دنیا و اولی نامیده شد و زندگی دنیا نامیده شد. پس هنگامی که به برزخ استحاله یابیم و از برزخ به صورت‌هایی که در آن‌ها نشر و بعث است استحاله یابیم، آن را آخرت می‌نامند. و امر در آخرت پیوسته در خلق جدید (خلق جديد) است، اهل بهشت در بهشت و اهل دوزخ در دوزخ، تا بی‌نهایت. پس ما در آخرت جز خلق جدیدی در یک عین (ذات) واحد مشاهده نمی‌کنیم. پس عالم متناهی است و در عین حال نامتناهی.\n\nو چون امر چنین است، انسان هنگامی که می‌خوابد، خود را در بهشت یا در قیامت یا در مکانی غیر از مکان و شهر خود که می‌شناسد یا نمی‌شناسد، و در صورتی غیر از صورت خود و در حالی غیر از حال خود می‌بیند. پس او در نفس خود به واسطه حرکتی که او را از بیداری به خواب منتقل کرده است، به صورت‌هایی استحاله یافته که گاهی آن‌ها را می‌شناسد و گاهی نمی‌شناسد، و به احوال ستوده و نیکویی که از آن‌ها شاد می‌شود و احوال نکوهیده و زشتی که از آن‌ها رنج می‌برد. سپس استحاله به سرعت به سوی او می‌آید و به بیداری باز می‌گردد؛ یا به دلیل استیفای معنایی که در خواب به آن استحاله یافته بود و دیگر چیزی در آن باقی نمانده که در آن استحاله خاص به او بدهد، و این همان کسی است که بدون سبب بیدار می‌شود و آن بیداری طبیعی است، هنگامی که نفس حق چشم را از خوابی که در آن آسایش اوست، گرفته باشد. و اگر انتقال از خواب به بیداری به سببی باشد، یا از جهت حس یا از امری ترسناک یا حرکتی آزاردهنده که در حال خواب از او ظاهر شده و بیدار شده است، اگر آن امر با استیفای حق طبیعی چشم از خواب موافق باشد، بیداری رخ می‌دهد. و اگر موافق نباشد و از حق چشم باقی مانده باشد که اگر آن سبب نبود، آن را استیفا می‌کرد، در خواب دیگری آن را استیفا می‌کند. به همین دلیل است که خواب برخی از خوابیدگان در یک زمان طولانی می‌شود و سبب طولانی شدن آن همان است که ذکر کردیم. و اما کوتاه شدن خواب او به یکی از دو امر است که ذکر کردیم: یا به سببی که او را بیدار می‌کند، یا به دلیل استیفای حق چشم در آن خواب خاص به خاطر مزاجی که بر آن است. زیرا مزاج شخص خسته با مزاج شخص آسوده یکسان نیست. شخص خسته از آسایش چیزی را می‌طلبد که با آن خستگی را برطرف کند، پس خواب او را فرا می‌گیرد و طولانی می‌شود، زیرا او دوست دارد آسایش را استیفا کند. پس او را قبل از استیفا بیدار نمی‌کند مگر یکی از سه چیز یا همه آن‌ها یا بعضی از آن‌ها، بسته به آنچه رخ می‌دهد: یا به امری ترسناک که در خواب می‌بیند، یا کسی از بیداران او را عمداً بیدار می‌کند، یا فریادی بزرگ یا حرکتی یا هر یک از این اسباب در عالم حس که برای بیدار شدن او مقصود باشد یا غیر مقصود، بلکه به صورت اتفاقی رخ دهد. و امر سوم این است که نفس به خاطر انجام کاری که دوست دارد انجام دهد، مشغول باشد و با آن خاطر بخوابد و آن خاطر به آن امر وابسته باشد، پس او را آشفته می‌کند و قبل از استیفای حق خود از خواب بیدار می‌شود. و مقصود از آنچه ذکر کردیم جز این نیست که تو را آگاه سازیم که عالم در هر نفس از استحاله خالی نیست. و اگر عین جوهر (جوهر) که این استحاله را در خود می‌پذیرد، واحد و ثابت نبود و از حیث جوهر خود استحاله نمی‌یافت، هنگام استحاله به امری، نمی‌دانست که قبل از آن استحاله بر چه حالی بوده است. جز اینکه برخی از استحالات پنهان و دقیق هستند و برخی دیگر آشکارند که نفس آن‌ها را حس می‌کند، مانند استحاله خواطر و حرکات ظاهری و احوال آن. و برخی دقیق و پنهان هستند، مانند استحاله آن در علوم و قوای آن و رنگ‌های متلونات به واسطه تجدید امثالشان. و این امر را درک نمی‌کند مگر کسی که از اهل کشف (الکشف) باشد، زیرا او آن را درک می‌کند و کشف (الکشف) آن ابهامی را که دیگران را از درک این امر کور کرده است، از او برطرف کرده است. اگر بگویی: پس این صورتی که جواهر عالم به آن استحاله می‌یابند چیست؟ می‌گوییم: چیزی جز ممکنات (الممكنات) نیستند. آن‌ها در شیئیت ثبوت خود هستند و این همان قول خداوند متعال است: «إِنَّما قَوْلُنا لِشَيْ‏ءٍ إِذا أَرَدْناهُ» (همانا گفتار ما برای چیزی که اراده‌اش کنیم). پس هنگامی که از قول «کن» (باش) ظاهر شد، شیئیت وجود (شيئية الوجود) نیست، و این همان قول خداوند است: «وَقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْئاً» (و تو را پیش از این آفریدم و چیزی نبودی)، یعنی قدرت تو؛ یعنی شیئیت وجود برای تو نبود، و آن در حقیقت شیئیت ظهور (شيئية الظهور) است، ظهوری برای عین خود، اگرچه در شیئیت ثبوت خود به حقیقتش از غیر خود متمایز و ظاهر بود، اما برای پروردگارش، نه برای نفس خود. پس برای نفس خود ظاهر نشد مگر پس از تعلق امر الهی از قول «کن» به ظهورش. پس ظهور خود را برای نفس خود کسب کرد و نفس خود را شناخت و عین خود را مشاهده کرد. پس از شیئیت ثبوت خود به شیئیت وجود خود استحاله یافت. و اگر بخواهی، بگو: در نفس خود از حالتی که برای خود ظاهر نبود، به حالتی استحاله یافت که به تقدیر عزیز علیم برای خود ظاهر شد. پس عالم همه طالع و غارب (طلوع کننده و غروب کننده) است و فلکی است که می‌چرخد و ستاره‌ای است که شناور است و آشکار است بین طلوع و غروب، از وحی الهی (وحي إلهي) که همان امری است که با ظهور و خفا بر آن متوجه می‌شود، و وحی نفسانی (وحي نفسي) که همان چیزی است که حق (الحق) از آن می‌طلبد و آنچه از حق تعالی طلب می‌شود، پس به حق وحی می‌کند، همان‌گونه که حق به او وحی کرده است. پس حق به آنچه بنده‌اش به او وحی کرده است، گاهی عمل می‌کند و گاهی عمل نمی‌کند، همان‌گونه که بنده هنگامی که حق به او وحی می‌کند و او را به انجام یا ترک چیزی امر می‌کند، گاهی اطاعت می‌کند و گاهی نافرمانی می‌کند. پس حق (الحق) برای مکلف به صورت او در بخشش و امتناع ظاهر شد. پس بنده در حق جز صورت خود را ندید. پس اگر حق را در امری خواند و او اجابت نکرد، جز خود را ملامت نکند. آیا نمی‌بینی که فرشتگان چون در آنچه خداوند آن‌ها را به انجام آن فراخواند، نافرمانی نکردند، همان‌گونه که از آن‌ها خبر داده است، در هیچ چیز او را نخواندند مگر اینکه اجابتشان کرد، زیرا آن‌ها بر صورت امتناع از آنچه حق آن‌ها را به آن فراخوانده است، نیستند. و عالم از حق جز صورت آنچه بر آن است، شهود (الشهود) نمی‌کند. به همین دلیل پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) درباره کسی که بعد از خواندن فاتحه «آمین» می‌گوید، فرمود: «هر کس آمین گفتنش با آمین گفتن فرشتگان موافق شود، آمرزیده می‌شود» (من وافق تأمينه تأمين الملائكة غفر له).\nزیرا آمین گفتن فرشتگان نزد خداوند مقبول و مستجاب است. پس با زمان اجابت فرشتگان موافق شد و اجابت به حکم تبعیت برای او حاصل شد، مگر اینکه وقت او وقت اجابت برای خودش باشد، به عنوان پاداش آنچه در زمانی از امر حق اطاعت کرده است. و اصل در عالم، پذیرش امر الهی در تکوین (التكوين) است و نافرمانی امری عارضی است که به صورت نسبی برای او عارض شده است. و در حقیقت هیچ کس خداوند را نافرمانی نکرده و اطاعت ننموده است، بلکه امر همه از آن خداوند است و این همان قول اوست: «وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ» (و امر همه به سوی او بازگردانده می‌شود). پس افعال بندگان خلق خداوند است و بنده محل آن خلق است. پس عالم همه در سه راز محصور است: جوهرش، صورت‌هایش و استحاله (الاستحالة). و امر چهارمی در کار نیست. اگر بگویی: پس حکم استحاله در عالم از حقایق الهی (الحقائق الإلهية) از کجا ظاهر شد؟ می‌گوییم: حق (الحق) خود را وصف کرده است که: «كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ» (هر روز او در کاری است) و شئون مختلف هستند. و خود را به شادمانی از توبه بنده‌اش وصف کرده است و قبل از وقوع آن شادمان نبوده است. و همچنین قول پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم): «خداوند خسته نمی‌شود تا شما خسته شوید» (إن الله لا يمل حتى تملوا).\nو عارفان به او که همان رسولان (علیهم السلام) هستند، از او ذکر کرده‌اند که خداوند متعال در روز قیامت چنان غضبی می‌کند که قبل از آن مانند آن غضب نکرده و بعد از آن نیز مانند آن غضب نخواهد کرد، آن‌گونه که شایسته جلال اوست. پس او را وصف کرده‌اند که قبل از این غضب بر حالتی بوده که به این غضب وصف نشده بود. و در صحیح آمده است که او در روز قیامت هنگامی که بر بندگانش تجلی (التجلی) می‌کند، در صورت‌ها تحول (تحول) می‌یابد. و تحول (التحول) عین استحاله (الاستحالة) است و در ظهور غیر از آن نیست. و اگر این نبود، آغاز خلق برای عالم صحیح نبود و عالم در وجود (الوجود) با خداوند مساوی می‌شد، و این در نفس الامر صحیح نیست. پس همان‌گونه که خداوند متعال پذیرفت که در صورت‌های مختلف بر بندگانش ظاهر شود، همچنین خلق نکرد و سپس خلق کرد. پس در ازل به عالم و قادر بودن وصف شده بود، یعنی متمکن از ایجاد ممکن، اما اختیار داشت که در صورت ایجاد آن ظاهر شود یا ظاهر نشود. پس در ایجاد صورت ممکن هنگامی که خواست، ظاهر شد. و در نسبت به او سبحانه، فرقی بین ممکنات نیست. و ما می‌دانیم که خداوند مثلاً زید را جز دیروز یا اکنون ایجاد نکرده است. پس وجود او با وجود اینکه حق (الحق) قادر است، تأخیر یافته است. پس همین حکم در اولین موجود عالم نیز لازم است که خداوند به قدرت بر ایجاد شیء وصف شود، اگرچه آن را ایجاد نکرده باشد، همان‌گونه که تو در وقت سکون خود بر حرکت قادری، اگرچه حرکت نکنی. و از این امر محالی لازم نمی‌آید، زیرا فرقی بین ممکن موجود اکنون که از غیر خود تأخیر یافته است و ممکن اول نیست. زیرا حق (الحق) به ایجاد زید در وقت عدم زید وصف نمی‌شود. پس اگر بفهمی، صورت یکی است. جز اینکه اطلاق لفظ استحاله (الاستحالة) بر خداوند اطلاق نمی‌شود، اگرچه او تحول (التحول) را بر خود اطلاق کرده است. پس ما در نزد آن توقف می‌کنیم، با معقول بودن آنچه ذکر کردیم. پس در آنجا جز خداوند و توجه (التوجه) و پذیرش ممکنات (الممكنات) برای آنچه خداوند با آن توجه اراده کرده است، نیست. پس این سه امر ضروری هستند و حکم آن‌ها باید ظاهر شود. پس غروب جز از طلوع کسی که طلوع کرده و سپس غروب کرده است، رخ نمی‌دهد. و ظهور جز از بطون (پنهانی) رخ نمی‌دهد، نه از بطونی که قبلاً ظاهر بوده است. و منظورم از «نه از بطون» این است که او ظاهر نبوده و سپس پنهان شده و سپس از آن بطون ظاهر شده باشد، بلکه پیوسته باطن بوده و سپس خداوند او را ظاهر کرده است، پس برای نفس خود ظاهر شده است.\n\n### «وصل»\n\nچون وصف نفسانی برای موصوف ممکن نیست که برداشته شود مگر اینکه موصوف نیز با آن برداشته شود، زیرا آن عین موصوف است و غیر آن نیست، و تقدم عدم برای ممکنات نعت نفسانی بود، زیرا وجود (الوجود) در ازل بر ممکن محال است، پس چاره‌ای نیست جز اینکه ازلی العدم باشد. پس تقدم عدم برای آن نعت نفسانی است. و ممکنات از حیث ذات خود، حقایق و صورت‌های متمایزی دارند، زیرا حقایق این را اقتضا می‌کنند. پس هنگامی که خداوند اراده کرد که لباس وجود (الوجود) را بر آن‌ها بپوشاند، و در آنجا جز خداوند نبود و او عین وجود (الوجود) و موجود است، خداوند متعال بر ممکنات به واسطه استعدادات و حقایق ممکنات ظاهر شد. پس آن‌ها خود را به خود در وجود (الوجود) موجد خود دیدند، در حالی که بر حال عدم خود بودند. زیرا آن‌ها در حال عدم خود نیز ادراکاتی دارند، همان‌گونه که در حال عدم خود، مدرِکِ مدرَکِ خود هستند. به همین دلیل در شرع آمده است که خداوند ممکن را به تکوین (التكوين) امر می‌کند و آن تکوین می‌یابد. و اگر برای آن حقیقت سمع نبود و اینکه امر حق (الحق) را هنگامی که بر آن متوجه می‌شود، درک می‌کند، تکوین نمی‌یافت و خداوند آن را به تکوین وصف نمی‌کرد و خود را به قول برای آن شیء که به عدم وصف شده است، وصف نمی‌کرد. پس همچنین ممکن تمام قوایی را دارد که با آن‌ها مدرکات مربوط به این ادراکات را درک می‌کند. پس هنگامی که خداوند آن‌ها را به تکوین امر کرد، وجودی را که با آن متصف شوند، نیافتند، زیرا در آنجا جز وجود حق (وجود الحق) نبود. پس به صورت‌هایی در وجود حق (وجود الحق) ظاهر شدند. به همین دلیل صفات الهی و کونی در هم آمیختند. پس خلق به صفات حق (الحق) وصف شد و حق (الحق) به صفات خلق وصف شد. پس هر کس گفت: «جز خدا ندیدم»، راست گفت. و هر کس گفت: «جز عالم ندیدم»، راست گفت. و هر کس گفت: «چیزی ندیدم»، راست گفت، به دلیل سرعت استحاله (الاستحالة) و عدم ثبات، پس می‌گوید: «چیزی ندیدم». و هر کس گفت: «چیزی ندیدم مگر اینکه خدا را قبل از آن دیدم»، این همان است که گفتیم: ممکن در حال عدم خود ادراکی دارد. پس هنگامی که امر الهی برای تکوین به او رسید، جز وجود حق (وجود الحق) را نیافت. پس در آن برای نفس خود ظاهر شد و حق (الحق) را قبل از دیدن خود دید. پس هنگامی که وجود حق (وجود الحق) لباس او شد، در آن هنگام خود را دید و گفت: «چیزی ندیدم مگر اینکه خدا را قبل از آن دیدم»، یعنی قبل از اینکه در آن تکوین یابد و حق (الحق) صورت آن شیء را بپذیرد. پس هر کس امر را این‌گونه نداند، حق (الحق) و خلق و این نسبت‌ها را نشناخته است. پس «كُلُّ شَيْ‏ءٍ هالِكٌ» (هر چیزی هلاک شونده است) به واسطه صورت به دلیل استحالات (الاستحالات)، «إِلَّا وَجْهَهُ» (مگر وجه او). و ضمیر در «وجهه» به شیء باز می‌گردد. پس شیء از حیث صورتش هلاک شونده است، اما از حیث وجه و حقیقتش هلاک شونده نیست. و آن جز وجود حق (وجود الحق) نیست که شیء به واسطه آن برای نفس خود ظاهر شد. «لَهُ الْحُكْمُ» (حکم از آن اوست)، یعنی حکم در وجه از آن آن شیء است. پس احکام بر آن به اختلاف صورت‌ها مختلف می‌شود. «وَإِلَيْهِ تُرْجَعُونَ» (و به سوی او بازگردانده می‌شوید) در آن حکم، یعنی حکم که بر وجه صادر شده است، به آن شیء باز می‌گردد. پس حکم و تحکیم برای استحاله (الاحالة) است، زیرا آن مقصود است و چاره‌ای از آن نیست. پس در آنجا جز هلاکت و ایجاد در یک عین (ذات) واحد نیست. تبدیلی جز برای خداوند نیست. «لَا تَبْدِيلَ لِخَلْقِ اللَّهِ» (در آفرینش خدا تبدیلی نیست)، «لَا تَبْدِيلَ لِكَلِمَاتِ اللَّهِ» (در کلمات خدا تبدیلی نیست)، بلکه تبدیل برای اوست، همان‌گونه که «لِلَّهِ الْأَمْرُ مِنْ قَبْلُ وَمِنْ بَعْدُ» (امر از پیش و پس از آن از آن خداست). این امر به دلیل این است که او از خود خبر داده است که «الْأَوَّلُ» (اول) و «الْآخِرُ» (آخر) است از یک عین (ذات) واحد. پس جز صورت‌هایی که در اینجا و در برزخ و آخرت ظاهر می‌شوند، نیست. و این همان چیزی است که قول آن‌ها: «إِنَّا لَمَرْدُودُونَ فِي الْحَافِرَةِ» (آیا ما به حالت اول بازگردانده می‌شویم؟) به آن اشاره دارد. آن‌ها این را توهم کردند و آن را محقق نساختند، به همین دلیل گفتند: «كَرَّةٌ خَاسِرَةٌ» (بازگشتی زیانبار). پس اگر آن را می‌دیدند، می‌دیدند که آن جز اعیان ظاهری آن‌ها نیست. پس آن را محال نمی‌شمردند و از آن روی برنمی‌گرداندند، زیرا چشمانشان جز به آن نگاه نکرده بود. پس چگونه آنچه را دیده‌اند انکار می‌کنند یا آنچه را یقین کرده‌اند از نفس خود کتمان می‌نمایند؟ و هر کس این ادراک را نداشته باشد، از علم و معرفت (المعرفة) که شهود (الشهود) و کشف (الکشف) به او بخشیده است، محروم شده است. و در این منزل از علوم، علم معجزات و علم طمس (محو کردن) و علم توالی و پیوستگی موجودات در خلق وجود دارد. و در آن علم الیقین (علم اليقين) و علم آنچه با خبر حاصل می‌شود، و علم آنچه ستوده و نکوهیده می‌شود، وجود دارد. و در آن علم غضب است که جز از کسی که امور را در حدود خود حق آن‌ها را نداده است، رخ نمی‌دهد. و در آن علم رحمت به ضعفا است، و خلق همه در اصل ضعیف هستند، پس رحمت آن‌ها را در بر می‌گیرد. و در آن علم وراثت کون برای اسماء الهی است. و در آن علم تمکین (قدرت بخشیدن) است. و در آن علم اِشهاد (به شهادت گرفتن) است. و در آن علم بیان برای تمییز آنچه باید از آن حذر کرد و آنچه نباید حذر کرد، وجود دارد. و در آن علم الحاق اناث به ذکور است، و آن الحاق منفعل به فاعل است از حیث آنچه منفعل دیگری از آن منفعل می‌شود، تا اینکه امر به منفعل دیگری برسد که منفعل دیگری از آن منفعل نمی‌شود، همان‌گونه که امر از طرف دیگر به فاعلی می‌رسد که از فاعل دیگری منفعل نیست و او حق تعالی (الحق تعالی) است. و در آن علم اختلاف وجوه در عین واحد است. و در آن علم آثار و آنچه عالم به واسطه آن‌ها از علوم به دست می‌آورد، وجود دارد. و از همین جا بود که سامری یک مشت از اثر جبرئیل گرفت. و اگر علم او به آنچه آثار می‌بخشند نبود، این کار را نمی‌کرد. و از این باب هستند کسانی که در طلب چیزی اثر را دنبال می‌کنند. و از این باب است که اگر صاحب این علم جای پای سعادتمندان را از جای پای شقاوتمندان در زمین ببیند، اگرچه اشخاص آن‌ها را ندیده باشد، آن‌ها را می‌شناسد. پس هنگامی که اثر پاهای آن‌ها را ببیند، بر آن‌ها حکم می‌کند به آنچه برایش ظاهر می‌شود. و در آن علم تعریض (کنایه) و قول آن‌ها در مثل رایج که «در تعریض‌ها از دروغ گریزگاهی است» وجود دارد. و در آن علم توریه (پوشاندن حقیقت) است و به همین دلیل پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که قصد غزوه به سمتی را داشت، با غیر آن توریه می‌کرد. و در آن علم آنچه اسباب از حکم در عالم می‌دهند، وجود دارد. و در آن علم حکم احوال بر مردان قوی، بلکه حکم احوال بر هر چیزی است. و از این باب است رضایت خداوند از مطیع و غضب او بر هر کس از عاصیان که بخواهد. و در آن علم این است که چگونه شخصی، کسی را که در صفت شبیه اوست، یاری می‌کند، هنگامی که دیگری بر او تعدی کند، در حالی که او با جسدی که خداوند بر او ترکیب کرده است، ضد مماثل خود است. و این در حیوانات بسیار ظاهر می‌شود. و در آن علم اسبابی است که موجب پناه بردن به خداوند عز و جل می‌شود و آن‌ها اسباب قهر هستند. و در آن علم سفر خواطر و سفر اجسام و آنچه هر یک از این سفرها نتیجه می‌دهد، وجود دارد. و در آن علم این است که چگونه انسان طلب آنچه را که طبعاً به آن محتاج است، ترک می‌کند، مانند قول برخی از آن‌ها که «فقیر کسی است که به خداوند حاجتی ندارد». و این اگرچه لفظش در نهایت زشتی است، اما از جهت معنا در نهایت زیبایی است، زیرا بالاترین درجات تسلیم است. و صاحب این مقام کسی است که خداوند را وکیل خود قرار داده است، به دلیل علمش به اینکه خداوند متعال به آنچه برای این بنده صلاح است، داناتر است. پس بنده به دلیل جهلش به مصالح، حاجتی را برای او تعیین نمی‌کند. پس فقیر به خداوند حاجت معینی ندارد، بلکه امر خود را تماماً به خداوند بازگردانده است. و در آن علم آنچه از کسی که این مقام و حال را دارد، نتیجه می‌شود، وجود دارد. و در آن علم کسی است که مقدار زنان و منزلت آن‌ها را در وجود (الوجود) شناخته است. و به همین دلیل خداوند آن‌ها را برای محمد (صَلَّى اللهُ عَليهِ وسَلَّم) محبوب گردانید، زیرا این از اسرار اختصاص است. و هنگامی که موسی (علیه السلام) قدر این را دانست، خود را برای مهریه زنی ده سال اجیر کرد. و منظورم از زنان، انوثت (مؤنث بودن) ساری در عالم است که در زنان آشکارتر بود. به همین دلیل برای کسی که به او محبوب شده است، محبوب گردیده است. زیرا نظر عقلی این را نمی‌دهد، به دلیل دوری آن از شهوت طبیعی. و این عقل ندانسته است که او به زعم خود از شهوت طبیعی حیوانی تنزه نکرده است مگر به واسطه شهوت طبیعی. پس در چیزی زهد نورزیده مگر به واسطه آنچه در آن زهد ورزیده است. پس از حکم آن خارج نشده است. و این نادان‌ترین نادانان است. و اگر از شرف زنان جز هیئت سجده برای آن‌ها هنگام نکاح نبود، کافی بود، و سجده شریف‌ترین حالات برای بنده در نماز است. و اگر ترس این نبود که شهوت را در نفوس شنوندگان برانگیزم و این امر به اموری منجر شود که در آن حجاب خلق از آنچه حق (الحق) آن‌ها را به آن فراخوانده است، باشد، به دلیل جهل آن‌ها به آنچه در آن ذکر می‌کردم، آن را ظاهر می‌ساختم. اما برای آن مواطنی است که در آن‌ها به کار برده می‌شود. پس از آن چیزی را ظاهر ساختم که فضیلت هیچ چیز بر فضیلت آن ظاهر نمی‌شود. و به همین دلیل حب بوی خوش و نماز را با آن قرین ساخت. و از اسماء خداوند متعال «الطیب» (پاکیزه) است. و اگر در آنچه خداوند از کلام الهی برای موسی (علیه السلام) نتیجه داد، هنگامی که برای خانواده‌اش در جستجوی آتشی بود که به آن نیاز داشتند، بنگری، می‌بینی که به واسطه تلاش او برای عیالش و استغراقش، حق (الحق) او را ندا داد و با او در عین حاجتش که همان آتش بود، سخن گفت و به او فرمود: «أَن بُورِكَ مَن فِي النَّارِ وَمَن حَولَهَا» (مبارک است آنکه در آتش است و آنکه پیرامون آن است). و در آن علم وجود حق (وجود الحق) در عین خلاف است، همان‌گونه که در عین اتفاق برای کسی که تعقل کند، وجود دارد. و در آن علم احتیاج بالاتر به پایین‌تر و نیاز او به آن است. و این علم از دشوارترین علوم است به دلیل دقت میزان آن. زیرا هر کسی نمی‌تواند با این میزان وزن کند، به ویژه در قول او: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای آنکه مرا بپرستند)، «مَا أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ» (از ایشان روزی نمی‌خواهم و نمی‌خواهم که مرا طعام دهند). پس از چه چیزی در قول او: «مَا أُرِيدُ مِنْهُم مِّن رِّزْقٍ وَمَا أُرِيدُ أَنْ يُطْعِمُونِ» محافظت می‌کنی؟ و ما می‌دانیم که او طعام نمی‌خورد و از بندگانش روزی نمی‌طلبد، بلکه «هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ» (او روزی دهنده و صاحب قدرت است). چون قوت در ما برای غذاست، فرمود: «أَنْ يُطْعِمُونِ» (که مرا طعام دهند)، پس قوت من از چیزی باشد که به آن طمع کرده‌ام، بلکه قوت من بدون غذا و طعام است. و در آن علم امامت در عالم است و اینکه امر عالم جز با آن جمع نمی‌شود و مصالح جز با آن حاصل نمی‌گردد. و در آن علم تعلیم علم است. و در آن علم غیب اضافی است و غیب مطلقی در کار نیست. و در آن علم کسی است که چیزی را طلب کرد، پس هنگامی که به او داده شد، آن را رد کرد و نپذیرفت. پس چه سببی طالب را به طلب آن واداشت و چه سببی باعث شد که آن را رد کند و نپذیرد؟ پس بر این اساس، علم سبب مؤدی به طلب به طور مطلق، بدون تخصیص طالب از طالب، بنا می‌شود. و در آن علم این است که شخص جز کسی را که حکم در او دارد، دنبال نمی‌کند و حکم در او نمی‌کند مگر کسی که به او عشق ورزیده است. و این پیروی از اختیار است، نه پیروی از جبر. زیرا پیروی از جبر ممکن است حکم آنچه ذکر کردیم را نداشته باشد، اگرچه عاشق به عشقی که در اوست مجبور است، اما فرق بین دو حرکت آشکار است. و در آن علم توصیل (رساندن) و آنچه نتیجه می‌دهد، وجود دارد. و در آن علم اصنافی است که عطای آن‌ها در آخرت مضاعف می‌شود. و در آن علم آنچه عالم باید برای آن طلب کند، وجود دارد. و در آن علم آنچه باید از پیروی از آن حذر کرد و آنچه نباید حذر کرد، و آنچه از حذر نکوهیده می‌شود و آنچه نکوهیده نمی‌شود، وجود دارد. و در آن علم سبب موجب هلاکت آنچه از عالم هلاک می‌شود، وجود دارد. و در آن علم برتری دادن در عالم به واسطه مراتب است. و در آن علم انساب و احساب و آنچه شرافت در انتساب به واسطه آن رخ می‌دهد و آنچه رخ نمی‌دهد، وجود دارد. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) از طعنه زدن در انساب نهی کرد.\n\nو در آن علم اهوال مشغول کننده است. و در آن علم جبر و اینکه مجبور کیست، وجود دارد. و در آن علم تنزیه (منزه دانستن) است. و در آن علم عواقب ثنا و اوایل آن است. و در آن علم احکام و اینکه به چه کسی نسبت داده می‌شود و چه کسی با آن‌ها حکم می‌کند، وجود دارد. و در آن علم تقدیر است که اگر واقع می‌شد، چه نتیجه‌ای می‌داد و آیا ترک وقوع آن از باب رحمت به عالم بوده است یا خیر. و در آن علم اقامه حجت‌ها است. و در آن علم ابتلا و فایده آن چیست، وجود دارد. و در آن علم صنعت کیمیا است. و در آن علم اعتبار (عبرت گرفتن) است. و در آن علم تمنی (آرزو کردن) و آنچه از آن فایده می‌برد و متمنی را سود می‌رساند و آنچه فایده نمی‌دهد و سود نمی‌رساند، وجود دارد. و در آن علم اهلیت هر موجود برای آنچه برای آن اهل شده است، وجود دارد. و در آن علم کسی است که به بهتر از آنچه عمل کرده است، پاداش داده است و کسی که به بیشتر از آنچه از او سؤال شده است، پاسخ داده است. و در آن علم این است که آیا آنچه مؤمن از آن نهی شده است، بقا بر اصل است، زیرا آن ترک است، و چرا از امر تأخیر یافته است، در حالی که هر دو حکم خداوند هستند. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 5
}