{
  "id": 465,
  "title": {
    "ar": "الباب الخامس والستون وأربعمائة في معرفة حال قطب كان منزله الله أكبر",
    "en": "Chapter Four Hundred and Sixty-Five, Concerning the Knowledge of the State of a Pole (قطب) Whose Station Was \"Allahu Akbar.\"",
    "ur": "باب چار سو پینسٹھ: ایک قطب (قطب) کے حال کی معرفت میں جس کا روحانی منزل \"اللہ اکبر\" تھا۔",
    "fa": "باب چهارصد و شصت و پنجم در معرفت حال قطبی که منزل او «الله اکبر» بود"
  },
  "content": {
    "ar": "## «الباب الخامس والستون وأربعمائة في معرفة حال قطب كان منزله الله أكبر»\n\n\n> الله أكبر لا أبغي مفاضلة *** فإن افعل تعطيها وتطلبها\n\n\n> وقد تصح إذا جاءت عقائدنا *** وإنه بوجود العين يذهبها\n\n\n> إلا إذا كان بالآيات يطلبنا *** فإن افعل تأتي وهي تحجبها\n\n\nوردت السنة بلفظ هذا الذكر ولا سيما في الصلاة والأذان لها والإقامة وعقيب الصلاة المفروضة وعند النوم وفي مواضع كثيرة وجاء بلفظة افعل وهذه لفظة افعل يأتي في الأغلب بطريق المفاضلة وفي أماكن لا تقتضي المفاضلة\nبحسب ما يقتضيه دليل الوقت فيعقل منها عند ذلك ما يعقل فإذا كانت هجيرا لأحد فإن كان المثابر عليها يذكر بها ربه بالمفاضلة كان الكشف له من عند الله بحسب ما نوى فلا يرى إلا مفاضلة وهو كشف معين سأذكره في هذا الباب وإن كان الذاكر به ربه يستحيل عنده المفاضلة كان الكشف له من عند الله بحسب ما نوى فلا يرى مفاضلة وهو كشف معين سأذكره في هذا الباب إن شاء الله وإن كان الذاكر به ربه من حيث هو ذكر مشروع لا تخطر له فيه المفاضلة ولا ترك المفاضلة نتج له ما هو الأمر عليه من غير تقييد فيكون ما حصل لمن نوى المفاضلة ومن لم ينوها تحت علم هذا الذاكر الثالث وهذه الهجيرات هي قوله تعالى والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ فالهجير هو الكثرة من الذكر دائما فإذا تقرر هذا فلنقل‏\n\n\n### «فصل» فيمن ذكر هذه اللفظة بطريق المفاضلة\n\n\nاعلم أن المفاضلة في هذا الذكر وأمثاله على قسمين قسم يرجع الفاضل فيه والمفضول إلى الحق وقسم يرجع الفاضل فيه إلى الحق والمفصول إلى الخلق فلنبدأ بما يرجع إلى الحق وهو على قسمين قسم يرجع إلى هذا الاسم من حيث لفظه وقسم يرجع إلى غير لفظه من الأسماء فالذي يرجع إلى لفظه كالكبير في قوله تعالى إنه الْكَبِيرُ الْمُتَعالِ وكالمتكبر في قوله تعالى الْجَبَّارُ الْمُتَكَبِّرُ فيكون الكبير أفضل من المتكبر لأن الكبير لنفسه هو كبير والمتكبر تعمل في حصول الكبرياء وما هو بالذات أفضل بما هو بالتعمل فإن التعمل اكتساب وإنما كان التكبر من صفات الحق لما كان من نزوله في الصفات إلى ما يعتقده أصحاب النظر وأكثر الخلق أنه صفة المخلوق فلما علم ذلك منهم وهو سبحانه قد وصف لهم نفسه بتلك الصفات حتى طمعوا فيه وضل بها قوم عن طريق الهدى كما اهتدى بها قوم في طريق الحيرة قام لهم تعالى في صفة التكبر عن ذلك النزول ليعلمهم أنه وإن اشترك معهم في الاسمية فإن نسبتها إليه تعالى ليست كنسبتها إلى المخلوق فيكون مثل هذا تكبر أو لا يحتاج الكبير إلى هذا كله فتبين لك المفاضلة بين الكبير والمتكبر وأما المفاضلة التي لهذه الكلمة أعني قولك الله أكبر فهي كلمة مفاضلة على كل اسم من الأسماء الإلهية بما يعطيه فهم الخلق فيه أعني في كل اسم اسم لأن فهم العالم لا بد أن يكون يقصر عما هو الأمر عليه ولا يتمكن أن يقبل توصيل ذلك لو تمكن أن يوصله الحق إليك فنحن لا قوة لنا على التحصيل ولا قوة في نفس الأمر على التوصيل فلا بد من قصور الفهم فتدل لفظة الله أكبر من كل ما أعطاه فهم من نسبة الكبرياء إلى الله بأي اسم كان من الأسماء الإلهية بهذا اللفظ وغيره فإن الله يقال فيه إنه أعظم وأكرم وأجل وأعلى وأرحم وأسرع وأحسن وأحكم وأمثال ذلك مما لا يحصى كثرة أ لا ترى إلى المشركين لما قالوا أعل هبل أعل هبل وهبل اسم صنم كان يعبد في الجاهلية وهو الحجر الذي يطئوه الناس في العتبة السفلي في باب بنى شيبة هو مكبوب على وجهه‏\n\n\nفقال النبي صَلَّى اللهُ عَليهِ وسَلَّم لأصحابه لما سمع المشركين يقولون ذلك قولوا\n\n\nالله أعلى وأجل‏\n\n\nيعني بالمفاضلة عندهم في اعتقادهم فساقه في معرض الحجة عليهم لأن النبي صَلَّى اللهُ عَليهِ وسَلَّم ما دعاهم إلا إلى الايمان بالله الذي هو عندهم وفي اعتقادهم أعلى وأجل من هبل ومن سائر الآلهة بما قالوه عن نفوسهم فقالوا ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فاتخذوهم حجبة فالله أعلى وأجل من هبل عندهم فكان ذلك تنبيها من رسول الله صَلَّى اللهُ عَليهِ وسَلَّم للمشركين فإنه في نفس الأمر ليس هبل بإله حتى يكون الله أعلى وأجل في الألوهة من هبل ولو قالها رسول الله صَلَّى اللهُ عَليهِ وسَلَّم على طريق المفاضلة في نفس الأمر لكان تقريرا منه صَلَّى اللهُ عَليهِ وسَلَّم لألوهة هبل إلا إن الله أعلى منه وأجل في الألوهة وهذا محال على النبي صَلَّى اللهُ عَليهِ وسَلَّم وعلى كل عالم أن يعتقده لأنه الجهل المحض على كل وجه فهذه أيضا مفاضلة مقررة شرعية في قولك الله أكبر فصاحب هذا الهجير بطريق المفاضلة يطالعه الحق بسريان هويته في جميع الخلق مثل‏\n\n\nقوله في الصحيح إن الله قال على لسان عبده سمع الله لمن حمده‏\n\n\nوقوله كنت سمعه وبصره ويده ورجله‏\n\n\nإلى غير ذلك وقوله فبي يسمع وبي يبصر\n\n\nولكن نسبة القول إليه دون نسبة القول إليه بلسان عبده أعلى من نسبة القول إليه بلسان الخلق فهو أكبر في ذاته من كبريائه في خلقه فاعلم ذلك فنقول عند ذلك الله أكبر مفاضلة إذ لم يخرج عنه كأنه يقول ذكرك نفسك أعظم وأكبر من ذكري إياك‏\nوإن ذكرتك بك فلا بد للنسبة من أثر لأن غاية شرف ذكري إياك أن أذكرك بك فتكون أنت الذاكر نفسك بلساني ونسبة الذكر إليك أكبر من نسبته إلي ولو كنت بك‏\n\n\n### «فصل» في الذكر لا على طريق المفاضلة\n\n\nوينقسم أيضا الذاكرون به هنا على هذا الوجه إلى قسمين طائفة تمنع المفاضلة في الذكر لأنه عين كل ذاكر من حيث ما هو ذاكر فلا ترى ذاكرا إلا الله وهو من حيث هويته وعينه لا يقبل المفاضلة لأن الواحد لا يفضل نفسه فينتج له هذا الذكر على هذا الحد كشف هذا ذوقا فيتبين له أنه الحق عينه وطائفة أخرى وهم القسم الآخر لا يرون التفاضل إلا مع وجود المناسبة ولا مناسبة بين الله وبين خلقه فذكر الله نفسه ذكر وذكر العبد ربه ذكر كل على حقيقة لا يقال هذا الذكر أفضل ولا أكبر من هذا بل هو الذكر الكبير من غير مفاضلة لله تعالى وهو في حق العبد المذكور كبير عند العبد لا أكبر فإن العبد عبد لذاته والرب رب لذاته فلا يحجبنك ما تراه من تداخل الأوصاف فإن ذلك وإن كان حقيقة فكل حقيقة على ما هي عليه ما لها أثر في الأخرى يخرجها عما تقتضيه ذاتها فالحقائق لا تتبدل ولو تبدلت لارتفع العلم من الله ومن الخلق فإذا ذكر من هذه صفته أنتج له ذلك كشفا وذوقا إن الأمر كما نواه وقال به‏\n\n\n### «فصل» في الذكر به من حيث ما هو ذكر مشروع‏\n\n\n(اعلم) أن الذاكر به على ما ذكرنا من كونه ذكرا مشروعا ينقسم إلى قسمين طائفة تذكره على أنه مشروع للخلق ويقولون بأن الله تعالى لما أوجد العالم ما خلقهم إلا ليعبدوه ويسبحوه فما من شي‏ء إلا وهو يُسَبِّحُ بِحَمْدِهِ ولكن لا نفقة تسبيحه وقال وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فخلق العالم لعبادته فهؤلاء إذا ذكروا الله ذكروه من حيث إن الله شرع لهم كيف يذكرونه ولا يعلمون ما تحت ذلك الذكر المشروع عند الله وإن علموه في اللسان فينتج لهم هذا الذكر لما ذا شرعه الحق في العالم بهذا القول الخاص دون غيره أي ذكر كان والقسم الآخر يعتقد أن العالم ما اكتسب من الحق إلا الوجود وليس الوجود غير الحق فما أكسيهم سوى هويته فهو الوجود بصور الممكنات وما يذكره إلا موجود وما ثم إلا هو فما شرع الذكر إلا لنفسه لا لغيره فإن الغير ما هو ثم وهو عالم بما شرع فيفتح لصورة الممكن ما ذكرناه كشفا هذا الذكر وهو قولهم لا يذكر الله إلا الله ولا يرى الله إلا الله فالمفيد والمستفيد عين واحدة فهو ذاكر من حيث إنه قابل وهو مذكور من حيث إنه عين مقصودة بالذكر والعالم على أصله في العدم والحكم له فيما ظهر من وجود الحق فما ثم إلا الحق مجملا ومفصلا لأن المحدث إذا قرنته بالقديم لم يبق له أثر وإن بقي له عين فإن العين بلا أثر ما هي معتبرة ولهذا قلنا فيمن دل على معرفة الواجب لنفسه لا يتمكن له أن يثبت له أثرا حتى يعلم أن هذه الآثار الكائنة في العالم تحتاج إلى مستند لإمكانها فعند ذلك يقوم لهم البرهان على استنادها لواجب الوجود لنفسه وذلك كمال العلم فإن الكمال للمرتبة أي بالمرتبة والتمام بما ترجع إليه في نفسها أعني التام فينتج لهذا القسم هذا الذكر ما قررناه من أنه يستحيل أن يذكره إلا هو أو يسمع ذكره إلا هو أو يكون المذكور إلا هو ومن ذكرت به فهو المذكور لا أنت هَلْ أَتى‏ عَلَى الْإِنْسانِ حِينٌ من الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً حتى ذكر بربه فكان مذكورا بربه لا به وسيرد في باب الأسماء الإلهية ما يشفي في هذا النوع إن شاء الله تعالى من هذا الكتاب والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيل‏\n\n",
    "en": "## Chapter 465: Concerning the Knowledge of the State of a Pole whose Station was *Allahu Akbar*\n\nGod is Greater, I do not seek comparison,\nFor if I do, You grant it and seek it.\nAnd it may be sound when our doctrines arrive,\nBut by the existence of the Entity (العين), He removes them.\nUnless He seeks us through the signs (الآيات),\nFor if I do, they come, and yet they veil them.\n\nThe Sunnah came with the wording of this remembrance (*dhikr*), especially in the prayer, the call to prayer (*adhan*), the establishment of the prayer (*iqama*), immediately following the obligatory prayer, upon sleeping, and in many places. And it came with the elative form (*af'al*), which usually comes by way of comparison (*mufadala*), and in places where comparison is not necessitated, according to what the indication of the moment (*waqt*) requires, so that what is understood from it is understood at that time.\n\nIf it becomes a constant recitation (*hajir*) for someone, then if the one who perseveres in it remembers his Lord through comparison, the unveiling (*kashf*) granted to him by God will be according to what he intended, and he will see nothing but comparison. This is a specific unveiling which I shall mention in this chapter.\n\nAnd if the one who remembers his Lord through it considers comparison impossible, the unveiling granted to him by God will be according to what he intended, and he will see no comparison. This is a specific unveiling which I shall mention in this chapter, God willing.\n\nAnd if the one who remembers his Lord through it does so merely as a prescribed remembrance (*dhikr mashru'*), neither comparison nor the rejection of comparison occurring to him, the result for him will be the reality of the matter (*al-amr*) without restriction. Thus, what was attained by the one who intended comparison and the one who did not intend it falls under the knowledge of this third type of rememberer. These constant recitations (*hajirat*) are referred to in His saying, the Exalted: <<وَالذَّاكِرِينَ اللهَ كَثِيراً وَالذَّاكِرَاتِ>> (And the men who remember Allah often and the women who remember). The *hajir* is therefore the constant abundance of remembrance. Having established this, let us proceed.\n\n### Section: Concerning the one who recites this word by way of Comparison\n\nKnow that comparison (*mufadala*) in this remembrance and its like is of two types: a type in which the superior (*al-fadil*) and the inferior (*al-mafdul*) both refer back to The Real (الحق), and a type in which the superior refers back to The Real and the inferior refers back to Creation (الخلق).\n\nLet us begin with that which refers back to The Real, which is also of two types: a type that refers to this Name [Akbar] in terms of its wording, and a type that refers to other Names besides its wording.\n\nThat which refers to its wording is like *Al-Kabir* (The Great) in His saying, the Exalted: <<إِنَّهُ الْكَبِيرُ الْمُتَعالِ>> (Indeed He is The Great, The Most High), and like *Al-Mutakabbir* (The Majestic/Haughty) in His saying, the Exalted: <<الْجَبَّارُ الْمُتَكَبِّرُ>> (The Compeller, The Majestic). *Al-Kabir* is superior to *Al-Mutakabbir* because *Al-Kabir* is Great by Himself, while *Al-Mutakabbir* involves an operation in the attainment of Greatness (*Kibriya'*). That which is by Essence (*bi al-Dhat*) is superior to that which is by operation (*bi al-ta'ammul*), for operation is acquisition.\n\nThe reason *Al-Mutakabbir* is among the Attributes of The Real is due to His descent in the Attributes to what the people of speculation and most of creation believe to be an attribute of the creature. When He knew this from them, and He, glory be to Him, had described Himself to them with those Attributes so that they might aspire to Him—though some were led astray by them from the path of guidance, just as others were guided by them on the path of bewilderment—He stood before them in the Attribute of *Al-Mutakabbir* (The Majestic) concerning that descent, to inform them that even though He shares the Name with them, its relation to Him, the Exalted, is not like its relation to the creature. Thus, such a quality is Majesty, or The Great (Al-Kabir) does not need any of this. This clarifies the comparison between *Al-Kabir* and *Al-Mutakabbir*.\n\nAs for the comparison inherent in this phrase—I mean your saying *Allahu Akbar*—it is a word of comparison over every Divine Name, based on the understanding that creation grants to that Name. This is because the understanding of the world (*al-alam*) must necessarily fall short of the reality of the matter, and it is unable to accept the conveyance of that reality, even if The Real were able to convey it to you. We have no power for attainment, nor is there power in the matter itself for conveyance. Therefore, a deficiency in understanding is inevitable.\n\nThe phrase *Allahu Akbar* indicates that God is greater than whatever understanding one has attained regarding the attribution of Greatness (*Kibriya'*) to God, by whatever Divine Name this attribution is made, whether by this wording or another. For God is said to be Greater (*A'zam*), Nobler (*Akram*), More Majestic (*Ajall*), Higher (*A'la*), More Merciful (*Arham*), Swifter (*Asra'*), Better (*Ahsan*), Wiser (*Ahkam*), and countless similar terms.\n\nDo you not see that when the polytheists said, \"Hibal is Higher! Hibal is Higher!\"—and Hibal was the name of an idol worshipped in the Age of Ignorance, which is the stone that people step on at the lower threshold of the gate of Banu Shaybah, lying face down—the Prophet, peace and blessings be upon him, said to his Companions when he heard the polytheists say that: \"Say: God is Higher and More Majestic (أعلى وأجل).\"\n\nHe meant comparison according to their belief, presenting it as an argument against them. This is because the Prophet, peace and blessings be upon him, only called them to faith in God, Who, in their own belief, was Higher and More Majestic than Hibal and all other deities, based on what they said themselves: <<مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللهِ زُلْفَى>> (We only worship them that they may bring us nearer to Allah in proximity). They took them as intercessors. Thus, God was Higher and More Majestic than Hibal in their view.\n\nThis was an admonition from the Messenger of God, peace and blessings be upon him, to the polytheists, for in reality, Hibal is not a god such that God would be Higher and More Majestic than Hibal in divinity. Had the Messenger of God, peace and blessings be upon him, said it by way of comparison in reality, it would have been an affirmation from him of Hibal's divinity, except that God is Higher and More Majestic than him in divinity. This is impossible (*muhal*) for the Prophet, peace and blessings be upon him, and for any knower to believe, as it is pure ignorance in every respect.\n\nThis, too, is a comparison that is established and sanctioned in your saying *Allahu Akbar*.\n\nThe one who makes this constant recitation (*hajir*) by way of comparison is unveiled by The Real through the pervasive reality of His Identity (*Huwiyya*) in all creation, such as His saying in the *Sahih* Hadith: \"Indeed, God said by the tongue of My servant: 'God hears the one who praises Him,'\" and His saying: \"I was his hearing, his sight, his hand, and his foot,\" and so on, and His saying: \"By Me he hears, and by Me he sees.\"\n\nHowever, the attribution of the saying directly to Him is higher than the attribution of the saying to Him through the tongue of His servant. He is greater in His Essence (*Dhat*) than His Greatness (*Kibriya'*) in His creation. Know this.\n\nTherefore, we say *Allahu Akbar* by way of comparison, since nothing is outside of Him. It is as if He says: \"Your remembrance of yourself is mightier and greater than My remembrance of you, even if I remember you by you. For the attribution must have an effect, because the ultimate honor of My remembrance of you is that I remember you by you, so that You are the One remembering Yourself by My tongue. Yet the attribution of the remembrance to You is greater than its attribution to me, even if I am by You.\"\n\n### Section: Concerning Remembrance Not by Way of Comparison\n\nThose who remember Him in this manner are also divided into two types here.\n\nOne group prevents comparison in the remembrance because He is the very Essence (*ayn*) of every rememberer, in terms of what the rememberer is. They see no rememberer but God, and He, in terms of His Identity (*Huwiyya*) and His Essence, does not accept comparison, because the One cannot compare Himself to Himself. This remembrance, on this basis, results in the unveiling (*kashf*) of this reality through direct experience (*dhawq*), making it clear to him that He is The Real Itself (الحق عينه).\n\nThe other group—the second type—do not see comparison except where there is suitability (*munasaba*), and there is no suitability between God and His creation. God's remembrance of Himself is one remembrance, and the servant's remembrance of his Lord is another remembrance, each upon its own reality. It is not said that this remembrance is superior or greater than that one; rather, it is The Great Remembrance (*al-Dhikr al-Kabir*) without comparison for God, the Exalted. And in the case of the servant, the One remembered is great (*kabir*) in the eyes of the servant, but not greater (*akbar*). For the servant is a servant by his essence, and the Lord is a Lord by His essence.\n\nDo not be veiled by the intermingling of the Attributes that you witness, for even though that is a reality, every reality remains as it is, and nothing has an effect on the other that would remove it from what its essence necessitates. Realities do not change; if they changed, Knowledge (*al-Ilm*) would be removed from God and from creation. When one whose description is this remembers, it results in an unveiling and a direct experience that the matter is as he intended and affirmed.\n\n### Section: Concerning Remembrance as a Prescribed Act\n\nKnow that the one who remembers Him, as we mentioned, by virtue of it being a prescribed remembrance, is divided into two types.\n\nOne group remembers it on the basis that it is prescribed for creation. They say that when God, the Exalted, brought the world into existence, He only created them to worship and glorify Him. There is nothing that does not <<يُسَبِّحُ بِحَمْدِهِ>> (glorify Him with His praise), but you do not understand their glorification. And He said: <<وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ>> (And I did not create the jinn and mankind except to worship Me). Thus, He created the world for His worship.\n\nWhen these people remember God, they remember Him based on the fact that God prescribed for them how they should remember Him, and they do not know what lies beneath that prescribed remembrance in the sight of God, even if they know it linguistically. This remembrance results for them in the unveiling of why The Real prescribed it in the world with this specific saying rather than any other remembrance.\n\nThe other group believes that the world acquired nothing from The Real except Existence (الوجود), and Existence is nothing other than The Real. He bestowed upon them nothing but His Identity (*Huwiyya*). He is Existence in the forms of the contingent entities (*al-mumkinat*), and none remembers Him but the Existent, and there is none there but Him. Therefore, He prescribed remembrance only for Himself, not for any other, for the \"other\" is not truly there. He is aware of what He prescribed, and thus He opens for the form of the contingent entity the unveiling of this remembrance that we mentioned, which is their saying: \"None remembers God but God, and none sees God but God.\"\n\nThe Benefactor (*al-Mufid*) and the Beneficiary (*al-Mustafid*) are one and the same Essence (*ayn wahida*). He is the rememberer in that He is the recipient, and He is the One remembered in that He is the Essence intended by the remembrance. The world remains upon its origin in non-existence, and the ruling belongs to it in what has appeared of the Existence of The Real. Thus, there is none there but The Real, both in summary and in detail, because when the contingent (*al-muhdath*) is juxtaposed with the Eternal (*al-Qadim*), it loses its effect (*athar*), even if its entity remains. An entity without effect is not considered.\n\nFor this reason, we said concerning the one who is guided to the knowledge of the Necessary Being by Himself: he cannot establish an effect for it until he knows that these effects existing in the world require a foundation due to their contingency. At that point, the proof is established for them regarding their reliance upon the Necessary Being by Himself. That is the perfection of Knowledge (*kamal al-ilm*), for perfection is for the Level (*al-martaba*), and completeness is for that to which it returns in itself—I mean the Complete (*al-Tamm*).\n\nThis remembrance results for this group in the realization that it is impossible for anyone but Him to remember Him, or hear His remembrance, or be the One remembered. And the one by whom you remember Him is the One remembered, not you. <<هَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً>> (Has there not come upon man a period of time when he was not a thing mentioned?) until he was mentioned by his Lord, so he was mentioned by his Lord, not by himself.\n\nWhat satisfies this type of knowledge, God willing, will be presented in the chapter on the Divine Names in this book. And God speaks the Truth, and He guides to the Way.",
    "ur": "باب نمبر چار سو پینسٹھ: اس قطب کے حال کی معرفت میں جس کا مقام \"اللہ اکبر\" تھا۔\n\nاللہ اکبر، میں فضیلت نہیں چاہتا،\nاگر میں ایسا کروں تو تو اسے عطا کرتا ہے اور اسے طلب کرتا ہے۔\n\nاور یہ درست ہو سکتا ہے جب ہمارے عقائد آئیں،\nاور یہ (فضیلت) عین (حقیقت) کے وجود سے زائل ہو جاتی ہے۔\n\nمگر یہ کہ وہ (اللہ) آیات (نشانات) کے ذریعے ہمیں طلب کرے،\nتو \"افعل\" (فضیلت کا صیغہ) آتا ہے اور وہ اسے (حقیقت کو) چھپا دیتا ہے۔\n\nیہ ذکر (اللہ اکبر) سنت میں اس لفظ کے ساتھ وارد ہوا ہے، خاص طور پر نماز میں، اذان اور اقامت میں، فرض نماز کے بعد، سونے کے وقت، اور کئی دیگر مقامات پر۔ اور یہ \"افعل\" (فضیلت کا صیغہ) کے لفظ کے ساتھ آیا ہے۔ یہ لفظ \"افعل\" اکثر مفاضلت (فضیلت دینے) کے طریقے پر آتا ہے، اور بعض جگہوں پر مفاضلت کا تقاضا نہیں کرتا۔\n\nیہ وقت کے دلیل کے تقاضے کے مطابق ہوتا ہے، لہٰذا اس وقت اس سے وہی سمجھا جاتا ہے جو سمجھا جاتا ہے۔ پس اگر یہ کسی کے لیے ورد (ہجیرا) بن جائے، تو اگر اس پر ثابت قدم رہنے والا اپنے رب کا ذکر مفاضلت کے ساتھ کرتا ہے، تو اس کے لیے اللہ کی طرف سے الکشف (کشف) اس کی نیت کے مطابق ہوتا ہے، اور وہ صرف مفاضلت ہی دیکھتا ہے۔ یہ ایک مخصوص الکشف (کشف) ہے جسے میں اس باب میں بیان کروں گا۔ اور اگر ذکر کرنے والا اپنے رب کا ذکر اس طرح کرتا ہے کہ اس کے نزدیک مفاضلت محال ہے، تو اس کے لیے اللہ کی طرف سے الکشف (کشف) اس کی نیت کے مطابق ہوتا ہے، اور وہ مفاضلت نہیں دیکھتا۔ یہ بھی ایک مخصوص الکشف (کشف) ہے جسے میں ان شاء اللہ اس باب میں بیان کروں گا۔ اور اگر ذکر کرنے والا اپنے رب کا ذکر اس حیثیت سے کرتا ہے کہ یہ ایک مشروع ذکر ہے، اور اس کے دل میں نہ مفاضلت کا خیال آتا ہے اور نہ مفاضلت کو ترک کرنے کا، تو اس کے لیے وہی نتیجہ نکلتا ہے جو امر (حقیقت) ہے، بغیر کسی قید کے۔ پس جو کچھ مفاضلت کی نیت کرنے والے اور نیت نہ کرنے والے کو حاصل ہوا، وہ سب اس تیسرے ذاکر کے علم کے تحت آ جاتا ہے۔ اور یہ ورد (الہجیرات) اللہ تعالیٰ کے اس فرمان میں ہیں: **وَالذَّاكِرِينَ الله كَثِيراً وَالذَّاكِراتِ** (اور کثرت سے اللہ کا ذکر کرنے والے مرد اور ذکر کرنے والی عورتیں)۔ پس ورد (الہجیر) ہمیشہ کثرت سے ذکر کرنا ہے۔ جب یہ بات طے ہو گئی، تو اب ہم کہتے ہیں:\n\n### فصل: اس شخص کے بارے میں جس نے یہ لفظ مفاضلت (فضیلت دینے) کے طریقے پر ذکر کیا۔\n\nجان لو کہ اس ذکر اور اس جیسے اذکار میں مفاضلت دو قسموں پر ہے۔ ایک قسم وہ ہے جس میں فاضل (فضیلت والا) اور مفضول (جسے فضیلت دی گئی) دونوں الحق (ذات حق) کی طرف لوٹتے ہیں۔ اور دوسری قسم وہ ہے جس میں فاضل الحق (ذات حق) کی طرف لوٹتا ہے اور مفضول خلق کی طرف۔ ہم اس سے شروع کرتے ہیں جو الحق (ذات حق) کی طرف لوٹتا ہے، اور یہ بھی دو قسموں پر ہے۔ ایک قسم جو اس اسم کی طرف اس کے لفظ کے اعتبار سے لوٹتی ہے، اور ایک قسم جو اس کے لفظ کے علاوہ دوسرے اسماء کی طرف لوٹتی ہے۔\n\nجو اس کے لفظ کی طرف لوٹتی ہے، جیسے \"الکبیر\" (بڑا) اللہ تعالیٰ کے اس فرمان میں: **إِنَّهُ الْكَبِيرُ الْمُتَعالِ** (بے شک وہ بہت بڑا، بلند و بالا ہے)۔ اور جیسے \"المتکبر\" (بڑائی والا) اللہ تعالیٰ کے اس فرمان میں: **الْجَبَّارُ الْمُتَكَبِّرُ** (زبردست، بڑائی والا)۔ پس \"الکبیر\" (بڑا) \"المتکبر\" (بڑائی والا) سے افضل ہے، کیونکہ \"الکبیر\" اپنی ذات کے لیے بڑا ہے، جبکہ \"المتکبر\" کبریائی کے حصول میں تکلف (التعمل) کرتا ہے۔ اور جو بالذات (اپنی ذات سے) ہے وہ اس سے افضل ہے جو بالتعمل (تکلف سے) ہے، کیونکہ تکلف (التعمل) اکتساب ہے۔\n\nتکبر (التکبر) الحق (ذات حق) کی صفات میں سے اس لیے ہوا کہ یہ صفات میں اس نزول (اترنے) سے ہے جسے اہل نظر اور اکثر مخلوق مخلوق کی صفت سمجھتے ہیں۔ جب اللہ نے ان سے یہ جان لیا، اور اس نے خود کو ان صفات سے متصف کیا تاکہ وہ اس میں طمع کریں، اور کچھ لوگ اس کے ذریعے ہدایت کے راستے سے بھٹک گئے، جیسا کہ کچھ لوگ حیرت کے راستے میں ہدایت پا گئے، تو اللہ تعالیٰ ان کے لیے اس نزول سے تکبر (التکبر) کی صفت میں کھڑا ہوا، تاکہ انہیں معلوم ہو جائے کہ اگرچہ وہ ان کے ساتھ اسمیت میں شریک ہے، لیکن اس کی نسبت اللہ تعالیٰ کی طرف ویسی نہیں ہے جیسی مخلوق کی طرف ہے۔ پس ایسی صورت میں یہ تکبر (التکبر) ہوتا ہے، جبکہ \"الکبیر\" (بڑا) کو ان سب کی ضرورت نہیں ہے۔ پس تمہارے لیے \"الکبیر\" اور \"المتکبر\" کے درمیان مفاضلت واضح ہو گئی۔\n\nجہاں تک اس کلمے کی مفاضلت کا تعلق ہے، یعنی تمہارا قول \"اللہ اکبر\"، تو یہ تمام الٰہی اسماء پر مفاضلت کا کلمہ ہے، اس فہم کے مطابق جو مخلوق کو ہر اسم میں حاصل ہوتا ہے، کیونکہ عالم کا فہم لازمی طور پر اس حقیقت سے قاصر ہوتا ہے جس پر امر (حقیقت) قائم ہے۔ اور وہ اس بات کو قبول کرنے کی طاقت نہیں رکھتا کہ اگر الحق (ذات حق) اسے تم تک پہنچا بھی دے تو تم اسے وصول کر سکو۔ پس نہ ہمیں حصول کی طاقت ہے اور نہ نفس الامر میں (حقیقت میں) پہنچانے کی طاقت ہے۔ لہٰذا فہم کی کمی لازمی ہے۔\n\nپس لفظ \"اللہ اکبر\" ہر اس چیز سے بڑا ہونے پر دلالت کرتا ہے جو تمہارے فہم نے کبریائی کی نسبت اللہ کی طرف کسی بھی الٰہی اسم کے ذریعے دی ہو، خواہ وہ اس لفظ سے ہو یا کسی اور سے۔ کیونکہ اللہ کے بارے میں کہا جاتا ہے کہ وہ اعظم (سب سے بڑا)، اکرم (سب سے زیادہ سخی)، اجل (سب سے زیادہ جلیل)، اعلیٰ (سب سے بلند)، ارحم (سب سے زیادہ رحم کرنے والا)، اسرع (سب سے زیادہ تیز)، احسن (سب سے زیادہ اچھا)، احکم (سب سے زیادہ حکمت والا) اور اس طرح کی بے شمار صفات ہیں۔\n\nکیا تم مشرکین کو نہیں دیکھتے جب انہوں نے کہا: \"اعل ہبل، اعل ہبل\" (ہبل بلند ہو، ہبل بلند ہو)۔ اور ہبل ایک بت کا نام تھا جس کی جاہلیت میں پوجا کی جاتی تھی، اور وہ وہ پتھر ہے جسے لوگ بنی شیبہ کے دروازے کی نچلی دہلیز میں روندتے تھے، اور وہ اپنے چہرے کے بل گرا ہوا تھا۔\n\nجب نبی اکرم صلی اللہ علیہ وسلم نے مشرکین کو یہ کہتے ہوئے سنا تو اپنے صحابہ سے فرمایا: کہو:\n\n**اللہ اعلیٰ و اجل** (اللہ سب سے بلند اور سب سے جلیل ہے)\n\nیعنی ان کے اعتقاد میں ان کے نزدیک مفاضلت کے ساتھ۔ پس آپ صلی اللہ علیہ وسلم نے اسے ان پر حجت کے طور پر پیش کیا، کیونکہ نبی صلی اللہ علیہ وسلم نے انہیں صرف اللہ پر ایمان لانے کی دعوت دی تھی، جو ان کے نزدیک اور ان کے اعتقاد میں ہبل اور دیگر معبودوں سے اعلیٰ اور اجل ہے۔ جیسا کہ انہوں نے خود کہا تھا: **مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفىٰ** (ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں)۔ پس انہوں نے انہیں دربان بنا لیا۔ لہٰذا اللہ ان کے نزدیک ہبل سے اعلیٰ اور اجل ہے۔ پس یہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے مشرکین کے لیے ایک تنبیہ تھی، کیونکہ نفس الامر (حقیقت) میں ہبل کوئی معبود نہیں ہے کہ اللہ الوہیت میں ہبل سے اعلیٰ اور اجل ہو۔ اور اگر رسول اللہ صلی اللہ علیہ وسلم نے اسے نفس الامر میں مفاضلت کے طریقے پر کہا ہوتا، تو یہ آپ صلی اللہ علیہ وسلم کی طرف سے ہبل کی الوہیت کا اقرار ہوتا، مگر یہ کہ اللہ الوہیت میں اس سے اعلیٰ اور اجل ہے۔ اور یہ نبی صلی اللہ علیہ وسلم اور ہر عالم کے لیے محال ہے کہ وہ ایسا اعتقاد رکھے، کیونکہ یہ ہر لحاظ سے محض جہالت ہے۔\n\nپس یہ بھی ایک مقرر شدہ شرعی مفاضلت ہے تمہارے قول \"اللہ اکبر\" میں۔\n\nپس اس مفاضلت کے طریقے پر ورد (ہجیر) کرنے والے پر الحق (ذات حق) اپنی ہویت (ذات) کے تمام مخلوق میں سرایت کرنے کے ذریعے مطلع ہوتا ہے، جیسے:\n\nصحیح حدیث میں اس کا فرمان: **إِنَّ اللهَ قَالَ عَلَى لِسَانِ عَبْدِهِ سَمِعَ اللهُ لِمَنْ حَمِدَهُ** (بے شک اللہ نے اپنے بندے کی زبان سے فرمایا: اللہ نے سن لیا جس نے اس کی تعریف کی)۔\n\nاور اس کا فرمان: **كُنْتُ سَمْعَهُ وَبَصَرَهُ وَيَدَهُ وَرِجْلَهُ** (میں اس کا کان، اس کی آنکھ، اس کا ہاتھ اور اس کا پاؤں بن جاتا ہوں)۔\n\nاور اس کے علاوہ، اور اس کا فرمان: **فَبِي يَسْمَعُ وَبِي يُبْصِرُ** (پس وہ مجھ سے سنتا ہے اور مجھ سے دیکھتا ہے)۔\n\nلیکن قول کی نسبت اس کی طرف کرنا، قول کی نسبت اس کے بندے کی زبان سے کرنے سے اعلیٰ ہے۔ پس وہ اپنی ذات میں اپنی مخلوق میں اپنی کبریائی سے بڑا (اکبر) ہے۔ پس یہ جان لو۔\n\nپس ہم اس وقت \"اللہ اکبر\" مفاضلت کے طور پر کہتے ہیں، کیونکہ وہ اس سے باہر نہیں نکلا، گویا وہ کہتا ہے: تمہارا اپنے آپ کو یاد کرنا میرے تمہیں یاد کرنے سے زیادہ عظیم اور بڑا ہے۔\n\nاور اگر میں تمہارا ذکر تمہارے ذریعے کروں، تو نسبت کا اثر ہونا ضروری ہے، کیونکہ میرے تمہارا ذکر کرنے کی انتہا یہ ہے کہ میں تمہارا ذکر تمہارے ذریعے کروں، پس تم ہی میری زبان سے اپنا ذکر کرنے والے ہو، اور ذکر کی نسبت تمہاری طرف کرنا میری طرف نسبت کرنے سے بڑا ہے، اگرچہ میں تمہارے ذریعے ہی کیوں نہ ہوں۔\n\n### فصل: ذکر میں جو مفاضلت (فضیلت دینے) کے طریقے پر نہ ہو۔\n\nاس طریقے پر ذکر کرنے والے بھی یہاں دو قسموں میں تقسیم ہوتے ہیں۔ ایک گروہ ذکر میں مفاضلت کو منع کرتا ہے، کیونکہ وہ ہر ذاکر کی عین (حقیقت) ہے، اس حیثیت سے کہ وہ ذاکر ہے۔ پس وہ اللہ کے سوا کسی ذاکر کو نہیں دیکھتے، اور وہ اپنی ہویت (ذات) اور عین (حقیقت) کے لحاظ سے مفاضلت کو قبول نہیں کرتا، کیونکہ واحد اپنی ذات کو فضیلت نہیں دیتا۔ پس اس حد پر یہ ذکر اسے ذوقاً (باطنی تجربے سے) یہ الکشف (کشف) دیتا ہے کہ وہ الحق (ذات حق) کی عین (حقیقت) ہے۔\n\nاور دوسرا گروہ وہ ہے جو تفاضل (فضیلت) کو صرف مناسبت کے وجود کے ساتھ ہی دیکھتے ہیں، اور اللہ اور اس کی مخلوق کے درمیان کوئی مناسبت نہیں ہے۔ پس اللہ کا اپنا ذکر کرنا ایک ذکر ہے، اور بندے کا اپنے رب کا ذکر کرنا ایک ذکر ہے، ہر ایک اپنی حقیقت پر ہے۔ یہ نہیں کہا جاتا کہ یہ ذکر اس ذکر سے افضل یا اکبر (بڑا) ہے۔ بلکہ وہ اللہ تعالیٰ کے لیے بغیر مفاضلت کے \"الذکر الکبیر\" (بڑا ذکر) ہے۔ اور بندے کے حق میں، جس کا ذکر کیا گیا، وہ بندے کے نزدیک \"کبیر\" (بڑا) ہے، \"اکبر\" (سب سے بڑا) نہیں۔ کیونکہ بندہ اپنی ذات کے لیے عبد ہے اور رب اپنی ذات کے لیے رب ہے۔\n\nجو کچھ تم اوصاف کے تداخل (گڈ مڈ ہونے) سے دیکھتے ہو، وہ تمہیں حجاب میں نہ ڈالے، کیونکہ اگرچہ یہ ایک حقیقت ہے، لیکن ہر حقیقت اپنی جگہ پر ہے، اور اس کا دوسری حقیقت پر کوئی ایسا اثر نہیں ہوتا جو اسے اس کے ذاتی تقاضے سے نکال دے۔ پس حقائق تبدیل نہیں ہوتیں، اور اگر وہ تبدیل ہو جائیں تو اللہ اور مخلوق دونوں سے علم اٹھ جائے گا۔\n\nپس جب اس صفت کا حامل شخص ذکر کرتا ہے، تو یہ اسے الکشف (کشف) اور ذوق (باطنی تجربہ) دیتا ہے کہ امر (حقیقت) وہی ہے جو اس نے نیت کی اور کہا۔\n\n### فصل: ذکر میں اس حیثیت سے کہ وہ ایک مشروع (شرعی) ذکر ہے۔\n\n(جان لو) کہ اس حیثیت سے ذکر کرنے والے، جیسا کہ ہم نے بیان کیا کہ یہ ایک مشروع ذکر ہے، دو قسموں میں تقسیم ہوتے ہیں۔ ایک گروہ اسے اس حیثیت سے ذکر کرتا ہے کہ یہ مخلوق کے لیے مشروع ہے۔ اور وہ کہتے ہیں کہ جب اللہ تعالیٰ نے عالم کو الوجود (ہستی) بخشا تو انہیں صرف اپنی عبادت اور تسبیح کے لیے پیدا کیا۔ **وَمَا مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ** (اور کوئی چیز نہیں مگر وہ اس کی حمد کے ساتھ تسبیح کرتی ہے، لیکن تم ان کی تسبیح کو نہیں سمجھتے)۔ اور فرمایا: **وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ** (اور میں نے جنوں اور انسانوں کو صرف اپنی عبادت کے لیے پیدا کیا)۔ پس اس نے عالم کو اپنی عبادت کے لیے پیدا کیا۔\n\nیہ لوگ جب اللہ کا ذکر کرتے ہیں تو اس حیثیت سے کرتے ہیں کہ اللہ نے ان کے لیے ذکر کرنے کا طریقہ مشروع کیا ہے، اور وہ نہیں جانتے کہ اس مشروع ذکر کے تحت اللہ کے نزدیک کیا ہے، اگرچہ وہ اسے زبان سے جانتے ہیں۔ پس یہ ذکر انہیں یہ نتیجہ دیتا ہے کہ الحق (ذات حق) نے عالم میں اس خاص قول کو کیوں مشروع کیا، نہ کہ کسی اور ذکر کو۔\n\nدوسرا گروہ یہ اعتقاد رکھتا ہے کہ عالم نے الحق (ذات حق) سے صرف الوجود (ہستی) ہی حاصل کیا ہے، اور الوجود (ہستی) الحق (ذات حق) کے سوا کچھ نہیں ہے۔ پس اس نے انہیں اپنی ہویت (ذات) کے سوا کچھ نہیں پہنایا۔ پس وہ ممکنات کی صورتوں میں الوجود (ہستی) ہے۔ اور اس کا ذکر صرف موجود ہی کرتا ہے، اور وہاں اس کے سوا کوئی نہیں ہے۔ پس اس نے ذکر صرف اپنے لیے مشروع کیا ہے، کسی اور کے لیے نہیں، کیونکہ غیر وہاں موجود ہی نہیں ہے۔\n\nاور وہ جانتا ہے کہ اس نے کیا مشروع کیا ہے۔ پس یہ ذکر ممکن کی صورت کے لیے وہ الکشف (کشف) کھولتا ہے جو ہم نے بیان کیا، اور وہ ان کا قول ہے: \"اللہ کا ذکر اللہ کے سوا کوئی نہیں کرتا، اور اللہ کو اللہ کے سوا کوئی نہیں دیکھتا۔\" پس فائدہ دینے والا اور فائدہ اٹھانے والا ایک ہی عین (حقیقت) ہیں۔ پس وہ ذاکر ہے اس حیثیت سے کہ وہ قابل ہے، اور وہ مذکور ہے اس حیثیت سے کہ وہ ذکر کا مقصود عین (حقیقت) ہے۔\n\nاور عالم اپنی اصل پر عدم میں ہے، اور حکم اس کے لیے ہے جو الحق (ذات حق) کے وجود سے ظاہر ہوا۔ پس وہاں الحق (ذات حق) کے سوا کچھ نہیں ہے، خواہ وہ اجمالی ہو یا تفصیلی۔ کیونکہ جب تم محدث (حادث چیز) کو قدیم کے ساتھ ملاؤ تو اس کا کوئی اثر باقی نہیں رہتا، اگرچہ اس کی عین (حقیقت) باقی رہتی ہے۔ کیونکہ عین (حقیقت) بغیر اثر کے قابل اعتبار نہیں ہے۔\n\nاسی لیے ہم نے کہا کہ جو شخص واجب الوجود لنفسہ (اپنی ذات کے لیے واجب الوجود) کی معرفت پر دلالت کرتا ہے، وہ اس کے لیے کوئی اثر ثابت نہیں کر سکتا، یہاں تک کہ وہ جان لے کہ عالم میں موجود یہ آثار اپنے امکان کی وجہ سے ایک مستند (بنیاد) کے محتاج ہیں۔ اس وقت ان کے لیے ان آثار کے واجب الوجود لنفسہ کی طرف مستند ہونے پر برہان قائم ہوتا ہے۔ اور یہی علم کا کمال ہے۔ کیونکہ کمال مرتبے کے لیے ہے، اور تمام (مکمل ہونا) اس کے لیے ہے جو اپنی ذات میں اس کی طرف لوٹتا ہے، یعنی التام (مکمل)۔\n\nپس یہ ذکر اس گروہ کے لیے وہی نتیجہ دیتا ہے جو ہم نے مقرر کیا کہ یہ محال ہے کہ اس کا ذکر اس (اللہ) کے سوا کوئی کرے، یا اس کے ذکر کو اس (اللہ) کے سوا کوئی سنے، یا مذکور اس (اللہ) کے سوا کوئی ہو۔ اور جس کے ذریعے تم نے ذکر کیا، وہ مذکور ہے، نہ کہ تم۔ **هَلْ أَتَىٰ عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا** (کیا انسان پر زمانے میں ایک ایسا وقت نہیں آیا جب وہ کوئی قابل ذکر چیز نہ تھا؟) یہاں تک کہ اس کا ذکر اس کے رب کے ذریعے ہوا، پس وہ اپنے رب کے ذریعے مذکور ہوا، نہ کہ اپنے ذریعے۔\n\nاور ان شاء اللہ اس کتاب میں اسماء الٰہیہ کے باب میں اس نوع کے بارے میں شافی بیان آئے گا۔ **وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔)",
    "fa": "باب چهارصد و شصت و پنجم در معرفت حال قطبی که منزلگاهش «الله اکبر» بود\n\nالله اکبر، من مفاضله‌ای نمی‌جویم؛ زیرا اگر چنین کنم، تو آن را عطا می‌کنی و آن را می‌طلبی.\nو هرگاه عقاید ما (درست) آید، آن (مفاضله) صحیح می‌شود؛ و همانا با وجود عین (حقیقت)، آن را از بین می‌برد.\nمگر آنکه با آیات (نشانه‌ها) ما را بطلبد؛ زیرا اگر چنین کنم، (مفاضله) می‌آید در حالی که آن (آیات) آن را می‌پوشاند.\n\nسنت با لفظ این ذکر وارد شده است، به ویژه در نماز، اذان و اقامه آن، پس از نمازهای واجب، هنگام خواب و در بسیاری از مواضع دیگر. و با لفظ «افعل» آمده است. این لفظ «افعل» غالباً به طریق مفاضله می‌آید و در جاهایی نیز هست که مقتضی مفاضله نیست، بر حسب آنچه دلیل وقت اقتضا می‌کند، در آن هنگام از آن چیزی فهمیده می‌شود که فهمیده می‌شود.\n\nپس اگر این (ذکر) ورد (هجیر) کسی باشد، اگر مداومت‌کننده بر آن، پروردگارش را با قصد مفاضله ذکر کند، کشف (کشف) او از جانب حق (الحق) بر حسب نیتی است که کرده است؛ پس جز مفاضله نمی‌بیند، و این کشف معینی است که در این باب ذکر خواهم کرد. و اگر ذاکر (ذاکر) پروردگارش را به گونه‌ای ذکر کند که مفاضله نزد او محال باشد، کشف (کشف) او از جانب حق (الحق) بر حسب نیتی است که کرده است؛ پس مفاضله‌ای نمی‌بیند، و این کشف معینی است که ان‌شاءالله در این باب ذکر خواهم کرد. و اگر ذاکر پروردگارش را از آن حیث که ذکری مشروع است ذکر کند و نه مفاضله و نه ترک مفاضله به ذهنش خطور نکند، نتیجه‌ای که برای او حاصل می‌شود همان چیزی است که امر بر آن است، بدون هیچ قید و بندی. بنابراین، آنچه برای کسی که قصد مفاضله کرده و کسی که قصد نکرده حاصل شده است، تحت علم این ذاکر سوم قرار می‌گیرد. این وردها (هجیرات) همان قول خداوند متعال است: «وَالذَّاكِرِينَ الله كَثِيراً وَالذَّاكِراتِ» (و مردان و زنانی که خدا را بسیار یاد می‌کنند). پس ورد (هجیر) همان کثرت ذکر به طور دائمی است. حال که این مقرر شد، سخن را آغاز می‌کنیم.\n\n### «فصل» در مورد کسی که این لفظ را به طریق مفاضله ذکر کند\n\nبدان که مفاضله در این ذکر و امثال آن بر دو قسم است: قسمی که فاضل و مفضول در آن به حق (الحق) بازمی‌گردند، و قسمی که فاضل در آن به حق (الحق) و مفضول به خلق (الخلق) بازمی‌گردد. پس با آنچه به حق (الحق) بازمی‌گردد شروع می‌کنیم، و آن نیز بر دو قسم است: قسمی که به این اسم از حیث لفظش بازمی‌گردد، و قسمی که به غیر لفظش از اسماء بازمی‌گردد.\n\nآنچه به لفظش بازمی‌گردد، مانند «الکبیر» در قول خداوند متعال: «إِنَّهُ الْكَبِيرُ الْمُتَعالِ» (همانا او بزرگ و متعالی است) و مانند «المتکبر» در قول خداوند متعال: «الْجَبَّارُ الْمُتَكَبِّرُ» (جبار و متکبر). پس «الکبیر» برتر از «المتکبر» است، زیرا کبیر بودن برای ذاتش، کبیر است، در حالی که «المتکبر» در حصول کبریا عمل می‌کند (تکلف دارد). و آنچه بالذات است، برتر از چیزی است که با تکلف (التعمل) حاصل می‌شود، زیرا تکلف نوعی اکتساب است.\n\nو تکبر از صفات حق (الحق) بود، زیرا نزول او در صفات به حدی بود که صاحبان نظر و بیشتر خلق آن را صفتی برای مخلوق می‌پندارند. چون حق (الحق) این را از ایشان دانست، و او سبحانه خود را با آن صفات برای ایشان وصف کرده بود تا در او طمع کنند، و گروهی به واسطه آن از راه هدایت گمراه شدند، همان‌گونه که گروهی در راه حیرت هدایت یافتند، خداوند متعال در صفت تکبر در برابر آن نزول ایستاد تا به ایشان بیاموزد که اگرچه در اسمیت با ایشان مشترک است، اما نسبت آن به او تعالی مانند نسبت آن به مخلوق نیست. پس چنین چیزی تکبر است، در حالی که کبیر به هیچ یک از این‌ها نیاز ندارد. بدین ترتیب مفاضله میان «الکبیر» و «المتکبر» برای تو آشکار شد.\n\nاما مفاضله‌ای که برای این کلمه است، یعنی قول تو «الله اکبر»، کلمه مفاضله‌ای است بر هر اسمی از اسماء الهی، به واسطه آنچه فهم خلق در آن اسم (یعنی در هر اسم) به آن می‌دهد؛ زیرا فهم عالم ناگزیر از آن است که از آنچه امر بر آن است قاصر باشد و نمی‌تواند پذیرای رساندن آن باشد، حتی اگر حق (الحق) می‌توانست آن را به تو برساند. پس ما نه بر تحصیل قدرت داریم و نه در نفس‌الامر بر رساندن قدرت داریم. بنابراین، قصور فهم ناگزیر است. پس لفظ «الله اکبر» بر هر آنچه فهمی از نسبت کبریا به خداوند، با هر اسمی از اسماء الهی، با این لفظ یا غیر آن، به او داده است، دلالت می‌کند. زیرا درباره خداوند گفته می‌شود که او اعظم، اکرم، اجل، اعلی، ارحم، اسرع، احسن، احکم و امثال آن است که کثرتشان قابل شمارش نیست.\n\nآیا نمی‌بینی که مشرکان وقتی گفتند: «أعل هبل، أعل هبل» (هبل برتر است، هبل برتر است)؟ و هبل نام بتی بود که در جاهلیت پرستیده می‌شد و آن سنگی است که مردم در آستانه پایینی درِ بنی شیبه بر آن پا می‌گذارند و بر صورت افتاده است.\nپیامبر (صلی الله علیه و سلم) به اصحابش فرمود، هنگامی که شنید مشرکان چنین می‌گویند، بگویید:\n«الله أعلى وأجل» (خداوند بالاتر و بزرگوارتر است).\nیعنی (این مفاضله) بر اساس اعتقاد آنان است. پس آن را در معرض حجت بر ایشان قرار داد، زیرا پیامبر (صلی الله علیه و سلم) آنان را جز به ایمان به خدایی دعوت نکرد که نزد آنان و در اعتقادشان، بالاتر و بزرگوارتر از هبل و سایر خدایان بود، به واسطه آنچه خودشان گفته بودند: «مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى الله زُلْفَى» (ما آن‌ها را نمی‌پرستیم مگر برای اینکه ما را به خدا نزدیک کنند). پس آن‌ها را واسطه قرار دادند. بنابراین، خداوند نزد آنان بالاتر و بزرگوارتر از هبل بود.\n\nاین (پاسخ) تنبیهی از جانب رسول الله (صلی الله علیه و سلم) برای مشرکان بود، زیرا در نفس‌الامر، هبل خدا نیست تا خداوند در الوهیت بالاتر و بزرگوارتر از هبل باشد. و اگر رسول الله (صلی الله علیه و سلم) آن را به طریق مفاضله در نفس‌الامر می‌گفت، تأییدی از جانب او (صلی الله علیه و سلم) بر الوهیت هبل بود، مگر اینکه خداوند در الوهیت بالاتر و بزرگوارتر از او باشد. و این بر پیامبر (صلی الله علیه و سلم) و بر هر عالمی محال است که چنین اعتقادی داشته باشد، زیرا این جهل محض است از هر جهت.\n\nپس این نیز مفاضله‌ای مقرر و شرعی در قول تو «الله اکبر» است. صاحب این ورد (هجیر) به طریق مفاضله، حق (الحق) با سریان هویتش در جمیع خلق بر او تجلی می‌کند، مانند:\nقول او در صحیح (حدیث قدسی): «إن الله قال على لسان عبده سمع الله لمن حمده» (همانا خداوند بر زبان بنده‌اش فرمود: خداوند سخن کسی را که او را ستایش کند شنید).\nو قول او: «كنت سمعه وبصره ويده ورجله» (من گوش او، چشم او، دست او و پای او بودم).\nو غیر از این‌ها، و قول او: «فبي يسمع وبي يبصر» (پس به واسطه من می‌شنود و به واسطه من می‌بیند).\n\nاما نسبت قول به او، بدون نسبت قول به او به زبان بنده‌اش، بالاتر از نسبت قول به او به زبان خلق است. پس او در ذاتش بزرگتر (اکبر) از کبرای خود در خلقش است. این را بدان. پس در این هنگام می‌گوییم: «الله اکبر» مفاضله است، زیرا از او خارج نشده است. گویی می‌گوید: ذکر کردن تو خودت را، عظیم‌تر و بزرگتر از ذکر کردن من تو را است.\nو اگر تو را به واسطه خودت ذکر کنم، ناگزیر نسبت (ذکر) اثری دارد؛ زیرا نهایت شرف ذکر کردن من تو را این است که تو را به واسطه خودت ذکر کنم، پس تو خودت باشی که خودت را با زبان من ذکر می‌کنی، و نسبت ذکر به تو بزرگتر از نسبت آن به من است، حتی اگر من به واسطه تو باشم.\n\n### «فصل» در ذکر نه به طریق مفاضله\n\nذاکران به این وجه نیز در اینجا به دو دسته تقسیم می‌شوند: گروهی مفاضله در ذکر را منع می‌کنند، زیرا او عین هر ذاکری است از آن حیث که ذاکر است، پس جز حق (الحق) ذاکری نمی‌بینند، و او از حیث هویت و عینش مفاضله را نمی‌پذیرد، زیرا واحد (الواحد) خود را بر خود برتری نمی‌دهد. نتیجه این ذکر برای او در این حد، کشف (کشف) ذوقی است، پس برای او آشکار می‌شود که او عین حق (الحق) است.\n\nو گروه دیگری که قسم دوم هستند، تفاضل را جز با وجود مناسبت نمی‌بینند، و هیچ مناسبتی میان خداوند و خلقش نیست. پس ذکر خداوند خودش را، ذکر است، و ذکر بنده پروردگارش را، ذکر است، که هر یک بر حقیقت خود است. گفته نمی‌شود که این ذکر برتر یا بزرگتر از آن است، بلکه او ذکر کبیر است بدون مفاضله برای خداوند متعال. و در حق بنده مذکور، نزد بنده کبیر است نه اکبر؛ زیرا بنده برای ذاتش بنده است و رب برای ذاتش رب است. پس آنچه از تداخل اوصاف می‌بینی تو را محجوب نسازد، زیرا اگرچه آن حقیقت است، اما هر حقیقتی بر همان چیزی است که هست و اثری در دیگری ندارد که آن را از آنچه ذاتش اقتضا می‌کند خارج سازد. پس حقایق دگرگون نمی‌شوند، و اگر دگرگون می‌شدند، علم از خداوند و از خلق برداشته می‌شد. پس اگر کسی با این صفت ذکر کند، نتیجه آن برای او کشف (کشف) و ذوقی است که امر همان‌گونه است که نیت کرده و گفته است.\n\n### «فصل» در ذکر به آن از آن حیث که ذکری مشروع است\n\nبدان که ذاکر به آن، بر اساس آنچه ذکر کردیم که ذکری مشروع است، به دو دسته تقسیم می‌شود: گروهی آن را از آن حیث که برای خلق مشروع است ذکر می‌کنند و می‌گویند: خداوند متعال چون عالم را ایجاد کرد، آن‌ها را نیافرید مگر برای اینکه او را عبادت کنند و تسبیح گویند. «وَمَا مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ» (و هیچ چیز نیست مگر اینکه با ستایش او تسبیح می‌گوید، ولی شما تسبیح آن‌ها را نمی‌فهمید) و فرمود: «وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای اینکه مرا بپرستند). پس عالم را برای عبادت خود آفرید. اینان وقتی خداوند را ذکر می‌کنند، او را از آن حیث ذکر می‌کنند که خداوند برایشان مشروع کرده است که چگونه او را ذکر کنند و نمی‌دانند که زیر آن ذکر مشروع نزد خداوند چیست، اگرچه آن را در زبان می‌دانند. نتیجه این ذکر برای ایشان این است که حق (الحق) چرا آن را در عالم با این قول خاص، نه با ذکر دیگری، مشروع کرده است.\n\nو قسم دیگر معتقدند که عالم از حق (الحق) جز هستی (الوجود) کسب نکرده است، و هستی (الوجود) غیر از حق (الحق) نیست. پس جز هویت خود را به آن‌ها نپوشانده است. پس او هستی (الوجود) است در صور ممکنات (الممکنات)، و جز موجود او را ذکر نمی‌کند، و جز او در آنجا نیست. پس ذکر را جز برای خودش مشروع نکرده است، زیرا غیر در آنجا نیست. و او به آنچه مشروع کرده عالم است. پس این ذکر، کشفی را برای صورت ممکنات می‌گشاید که ذکر کردیم، و آن قول ایشان است: «خداوند را جز خداوند ذکر نمی‌کند و خداوند را جز خداوند نمی‌بیند.» پس فایده‌دهنده (المفید) و فایده‌گیرنده (المستفید) یک عین واحد هستند. پس او ذاکر است از آن حیث که قابل است، و مذکور است از آن حیث که عین مقصود به ذکر است.\n\nو عالم بر اصل خود در عدم است و حکم برای او در آنچه از هستی (الوجود) حق (الحق) ظاهر شده است، می‌باشد. پس جز حق (الحق) در آنجا نیست، چه به صورت اجمالی و چه تفصیلی؛ زیرا اگر محدث را با قدیم قرین کنی، اثری برایش باقی نمی‌ماند، اگرچه عینی برایش باقی بماند. و عین بدون اثر معتبر نیست. به همین دلیل گفتیم: کسی که بر معرفت واجب لنفسه دلالت کند، نمی‌تواند اثری برای او اثبات کند تا زمانی که بداند این آثار موجود در عالم به مستندی برای امکانشان نیاز دارند. در آن هنگام برهان بر استناد آن‌ها به واجب الوجود لنفسه برایشان اقامه می‌شود. و این کمال علم است، زیرا کمال برای مرتبه است (یعنی به واسطه مرتبه) و تمام به چیزی است که در نفس خود به آن بازمی‌گردد (یعنی تام).\n\nنتیجه این ذکر برای این قسم، همان چیزی است که مقرر کردیم: محال است که جز او، او را ذکر کند، یا جز او، ذکر او را بشنود، یا جز او، مذکور باشد. و کسی که تو به واسطه او ذکر کردی، او مذکور است نه تو. «هَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً» (آیا بر انسان زمانی از روزگار نگذشت که چیزی قابل ذکر نبود؟) تا اینکه به واسطه پروردگارش ذکر شد، پس به واسطه پروردگارش مذکور بود نه به واسطه خودش. و ان‌شاءالله در باب اسماء الهی آنچه در این نوع شفا می‌دهد، در این کتاب خواهد آمد. «وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 3
}