{
  "id": 213,
  "title": {
    "ar": "الباب الثالث عشر ومائتان في حال الغيرة",
    "en": "Chapter Two Hundred and Thirteenth concerning the State (حال) of Jealousy (غيرة)",
    "ur": "۲۱۳ واں باب غیرت کے حال کے بیان میں",
    "fa": "باب دویست و سیزدهم در بیان حال غیرت"
  },
  "content": {
    "ar": "## «الباب الثالث عشر ومائتان في حال الغيرة»\n\n\nشعر في المعنى‏\n\n\n> إن التغير حال كونه خطر *** ما بين علم وحكم يذهب الناس‏\n\n\n> إن قال ما ذا بحكم رده علم *** من الحقيقة ردا فيه إفلاس‏\n\n\n> كذاك ذو الكم ممن فهو أجهل من *** لم يهده في ظلام الليل نبراس‏\n\n\n> وضنة الحق أولى أن تنزهه *** عنها فليس لذاك الحكم إيناس‏\n\n\n### [أن الغيرة مشاهدة الغير إذا ثبت أن ثم غيرا ولها ثلاث مقامات‏]\n\n\nاعلم أنه لما كانت الغيرة عند الطائفة على ثلاثة مقامات غيرة في الحق وغيرة على الحق وغيرة من الحق كان لها ثلاثة أحوال بحسب ما تنسب إليه من أجل التجانس فأما الغيرة فأصلها مشاهدة الغير إذا ثبت أن ثم غيرا فإذا ثبت صح ما قلناه عنهم من التفاصيل وأعني بثبوته عين وجود الغير لا عين معقوليته فإنه معقول بلا شك ولكن هل هو موجود العين هذا الغير المعقول أم لا فمن قال بالظاهر في المظاهر لم يقل بوجود الغير مع ثبوت حكمه وحاله المعبر عن ذلك بالغيرة وهو أثر استعداد المظاهر في الظاهر والغير موجب الكثرة عينا أو حالا لا بد من ذلك والكثرة معقولة بلا شك ولكن هل لها وجود عيني أم لا فيه نظر فمن قال إن هذه الكثرة الظاهرة في العين أحوال مختلفة قائمة بعين واحدة لا وجود لها إلا في تلك العين فهي نسب فلا حقيقة لها عينية في الوجود العيني ومن قال إن لها أعيانا لم يقل‏\nبالعين الواحدة ولا بالظاهر في المظاهر لأن الكثير مشهود لا الكثرة فالكثرة معقولة والكثير موجود مشهود فمن هنا ظهر حكم حال الغيرة في الأشياء واتصف بالغيرة إلا له والشي‏ء لا يكون غير نفسه إلا إذا كان الشي‏ء أشياء فيكون كل شي‏ء غيرا للشي‏ء الآخر والحق ليس بأشياء فلا يقبل الغير وقد اتصف بأنه غيور ومن غيرته حرم الفواحش فتدبر ما ذكرناه حتى تعرف ما الفاحشة وما الفعل المسمى فاحشة وغير فاحشة فالغير على الحقيقة ثابت لا ثابت هو لا هوفأما حال الغيرة في الحق‏\n\n\nوهي الغيرة التي تكون عند رؤية المنكر والفواحش وهي التي اتصف الحق بها والملأ الأعلى والرسل وصالحو المؤمنين على إن الغيرة مركوزة في الطبع فلا بد منها إلا أنها تنقسم إلى محمود ومذموم وكلامنا في المحمود منها وهي الغيرة في الحق وهي من أشكل المسائل فإنه تعالى من غيرته حرم الفواحش ثم إذا وقعت الفواحش في الكون لم نره يسرع بالأخذ عليها لا دنيا ولا آخرة فعلمنا إن ثم مانعا أقوى يمنع من ذلك يكون ذلك المانع أعظم إحاطة وتكون نسبته إلى الغيرة نسبة العلم الإلهي إلى القدرة الإلهية فإن القدرة وإن تعلقت بما لا يتناهى من الممكنات فلا تشك أن العلم أكثر إحاطة منها لأنه يتعلق بها وبالممكنات والواجبات والمستحيلات والكائنات وغير الكائنات مع ما يعطي الدليل أن ما لا يتناهى لا يفضل ما لا يتناهى كذلك السبب الموجب لترك المؤاخذة على ما يقع عمن يأتي ما وقعت عليه الغيرة ولا بد أن يكون أقوى من حال الغيرة هذا كله في حق الحق وأما في حق المخلوق فلا بد من تغيير النفس وهو مكلف بها في الحق لا بد من ذلك ومذموم من لم يجد ذلك من المكلفين فإنه مخاطب بتغييره من يده بالفعل إلى لسانه بالقول إلى وجود ذلك في النفس وهو أضعف الايمان في الزمان لا في نفس الغيور فحال الغيرة هو ما يجده الغيور من اختلاف الأمر عليه في نفسه عند وقوع ما لا يرضى الله سواء وقع ذلك منه أو من غيره بل من هذه صفته هو معصوم فإن من وقع منه ما يوجب الغيرة ولا يغار وإذا رأى ذلك من الغير أدركته الغيرة فليست بغيرة حقية إلهية وإنما هي غيرة نفسية لا قربة فيها إلى الله تعالى تلك هي الغيرة الإلهية الصحيحة ولكن لا يشعر بها كثير من أهل الله إلا من عرف الحق حق معرفته فإن الله هو الغيور الأعظم في الغيرة من المخلوق وهو الفاعل للأمر الذي يوجب الغيرة ولا يؤاخذ على ذلك أخذ عموم فكذلك من توجد منه الغيرة في حق زيد لفعل خاص وإذا وقع منه ذلك الفعل لا يجد غيرة فلهذا قلنا صاحب هذا الحال أحق وأقرب للاتصاف بالنعت الإلهي بالغيرة من الذي يغار مطلقا في حق نفسه وغيره ومن أجل ذلك سمي معصوما أو محفوظا فلم يقع منه ما يوجب الغيرة وهو السعيد في العموم المثنى عليه في الشرع والآخر يذم كما يذم الجبار من المخلوقين وإن كان الجبروت وصفا إلهيا كذلك خصوص الغيرة لا ينبغي للمؤمن أن يتصف بذلك بل تعم غيرته في الحق وحينئذ يحمده الله تعالى ويثني عليه فقد نبهتك على سر من أسرار الغيرة لتستريح إليه إن تفطنت له ولا تستعمله فتشقى بل كن لله غيورا في الحق مطلقا من غير تقييد\n\n\nوأما حال الغيرة على الحق‏\n\n\nوهي كتمان السرائر والأسرار وتلك حالة الأخفياء الأبرياء من الملامية المجهولين المجهولة مقاماتهم فلا يظهر عليهم أمر إلهي يعرف به إن لله عناية بهم فأحوالهم تستر مقامهم لحكمة الموطن فإنهم لا يظهرون في محل النزاع إذ كان سيدهم وهو الله تعالى قد نوزع في ألوهيته في هذه الدار وهذه الطائفة متحققة بسيدها فمنعهم ذلك التحقق أن يظهروا في الموطن الذي استتر سيدهم فيه فجروا مع العامة على ما هي العامة عليه من ظاهر الطاعات التي لم تجر العادة في العرف أن يسموا بها أنهم من أهل الله لأنهم ما ظهر منهم ما يتميزون به عن العامة من الأفعال كما ظهر من بعض الأولياء من خرق العوائد في الأحوال أو من تتبع تغيير المنكرات إذا بدت تغييرا يتميز به عن التغيير العام بحيث أن يشار إليه فيه فهذه حال الغيرة على الحق‏\n\n\nوأما حال الغيرة من الحق‏\n\n\nوهي ضنته بأوليائه حيث سترهم عن سائر عباده فحبب إليهم الستر ووفقهم للمعرفة بحكم الموطن فاتصفوا بصفة سيدهم فكانوا عنده خلف حجب العوائد فهم ضنائن الله وعرائسه فهم عنده كهو عندهم فما يشاهدون سواه ولا ينظر هو إلا إليهم فمن أراد أن يعرفهم فليسلك مسلك الغيرة على الحق فينتظم في سلكهم وأما قول بعضهم في الغيرة على الحق أن يذكر بالسنة الغافلين فكل لسان ذكره فليس بغافل بل له ثمرة صحيحة ينالها الذاكر وهو اللسان وإن لم تقرن به نية من نفس صاحب ذلك اللسان فما ذكره ذاكر بغفلة قط بل ذلك من قوله تعالى وإِنْ من شَيْ‏ءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ ولكِنْ لا تَفْقَهُونَ تَسْبِيحَهُمْ مثل هؤلاء\nفصاحب هذا القول لا حظ له في الرجولة وكذلك قول الآخر أغار على ذلك الجمال الأنزه عن نظر مثلي يا ليت شعري وأي نظر لك وأين الموجود الذي له نظر من ذاته وهل ينظره إلا هو يا أيها المشرك أما تستحيي أن تقول مثل هذا القول فحال الغيرة من الحق أن تكون حقا وتقوم فيها بنسبتها إلى الحق فتنظر ما الغيرة منه فتكون على ذلك ومع هذا على كل وجه فإنه يطلب ثبوت الغير والتفرقة بين الأشياء والتميز فتحفظ في ذلك من إثبات وجود عين زائدة أو من نفي عيون كثيرة في غير وجود عيني فأثبت الكثرة في الثبوت وأنفها من الوجود وأثبت الوحدة في الوجود وأنفها من الثبوت فاعلم ذلك‏\n\n",
    "en": "## Chapter 213: Concerning the State of Zeal (الغيرة)\n\nA Poem on the Meaning:\n\n> Indeed, alteration, while being a risk,\n> Between Knowledge and Judgment, causes people to perish.\n> If one asks, 'What is this?' based on judgment, Knowledge rejects him,\n> A rejection from the Reality (الحقيقة) that entails failure.\n> Likewise, the possessor of perfection (الكم) is more ignorant than\n> One whom a lamp does not guide in the darkness of night.\n> And the preciousness (ضنة) of the Real (الحق) is more worthy that you declare Him transcendent\n> From it, for that judgment holds no comfort.\n\n### [That Zeal (الغيرة) is the Witnessing of the Other (الغير) if it is Established that there is an Other, and it has Three Stations]\n\nKnow that since Zeal (الغيرة) among the Sufi community (الطائفة) is divided into three stations (مقامات)—Zeal *in* the Real (في الحق), Zeal *for* the Real (على الحق), and Zeal *from* the Real (من الحق)—it therefore has three states (أحوال) corresponding to that to which it is attributed, due to homogeneity.\n\nAs for Zeal, its origin is the witnessing (مشاهدة) of the Other (الغير) if it is established that there is an Other. If this is established, then the details we mentioned concerning them are correct. By its establishment, I mean the actual existence (عين وجود) of the Other, not merely its conceptual existence (عين معقوليته), for it is undoubtedly conceivable. But is this conceivable Other actually existent or not?\n\nWhoever affirms the Manifest (الظاهر) in the Manifestations (المظاهر) does not affirm the existence of the Other, even though its ruling (حكمه) and state (حاله)—which is expressed by Zeal—are established. This state is the effect of the preparedness (استعداد) of the Manifestations in the Manifest. The Other necessitates Multiplicity (الكثرة), either actually (عينا) or as a state (حالا); this is inevitable.\n\nMultiplicity is undoubtedly conceivable, but whether it has an actual existence (وجود عيني) or not is subject to scrutiny. Whoever says that this Multiplicity apparent in the actual world consists of different states subsisting in a single entity (عين واحدة), having no existence except within that entity, then these are merely relations (نسب), and thus they have no essential reality (حقيقة عينية) in actual Existence (الوجود العيني). And whoever says that they possess distinct entities (أعيانا) has not affirmed the Single Entity nor the Manifest in the Manifestations, because the many (الكثير) are witnessed, not Multiplicity itself. Multiplicity is conceivable, but the many are existent and witnessed.\n\nFrom this perspective, the ruling of the state of Zeal appears in things, and He (Allah) is described by Zeal, except that a thing cannot be the other of itself unless that thing is *things*, in which case every thing is an other (غير) to the other thing. The Real (الحق) is not *things*, so He does not accept the Other, yet He is described as being Zealous (غيور). And out of His Zeal, He forbade abominations (الفواحش). Ponder what we have mentioned so that you may know what an abomination is, and what is the act called an abomination and what is not an abomination. The Other is truly established, but it is not established as 'He is not He.'\n\nNow, as for the state of Zeal *in* the Real:\n\n### Zeal in the Real (الغيرة في الحق)\n\nThis is the Zeal that occurs upon seeing the reprehensible (المنكر) and abominations. It is that by which the Real (al-Ḥaqq), the Highest Assembly (الملأ الأعلى), the Messengers, and the righteous believers are described. Although Zeal is inherent (مركوزة) in nature (الطبع) and thus unavoidable, it is divided into praiseworthy and blameworthy. Our discussion concerns the praiseworthy type, which is Zeal *in* the Real, and this is one of the most complex issues.\n\nFor He, the Exalted, out of His Zeal, forbade abominations. Yet, when abominations occur in the cosmos (العالم), we do not see Him hasten to punish them, neither in this world nor in the Hereafter. Thus, we know that there is a stronger impediment (مانع) that prevents this, and that impediment must be greater in comprehensiveness (إحاطة). Its relation to Zeal is like the relation of Divine Knowledge (العلم الإلهي) to Divine Power (القدرة الإلهية). For even though Power relates to the infinite possibilities (الممكنات), there is no doubt that Knowledge is more comprehensive than it, because Knowledge relates to Power itself, to possibilities, necessities (الواجبات), impossibilities (المستحيلات), existing things, and non-existing things. Furthermore, the evidence shows that the infinite does not surpass the infinite. Likewise, the cause necessitating the abandonment of punishment for what occurs from those who commit the act that provoked the Zeal must necessarily be stronger than the state of Zeal itself. This is all concerning the Real.\n\nAs for the creature (المخلوق), the changing of the self is necessary, and he is obligated to do so *in* the Real; this is unavoidable. And whoever among the obligated (المكلفين) does not find this is blameworthy. For he is addressed regarding changing it, starting with his hand (by action), then his tongue (by speech), down to the existence of that change in the soul (النفس), which is the weakest degree of faith (أضعف الايمان) in this era, though not in the soul of the zealous person himself.\n\nThe state of Zeal is what the zealous person finds as a disturbance within his soul upon the occurrence of what displeases Allah, whether that occurs from himself or from another. Rather, whoever possesses this characteristic is protected (معصوم). For the one who commits an act that necessitates Zeal but feels no zeal, yet when he sees that act committed by another, Zeal overtakes him—that is not true Divine Zeal. Rather, it is psychological zeal (غيرة نفسية) in which there is no proximity (قربة) to Allah, the Exalted.\n\nThat is the true Divine Zeal, but many of the People of Allah (أهل الله) do not perceive it, except for those who know the Real with true Gnosis (المعرفة). For Allah is the Greatest Zealous One (الغيور الأعظم) in Zeal compared to the creature. He is the Doer (الفاعل) of the matter that necessitates Zeal, yet He does not punish for it universally. Likewise, the one who feels Zeal regarding a specific act committed by Zayd, but when that same act occurs from himself, he feels no zeal—for this reason, we said that the possessor of this state is more worthy and closer to being described by the Divine Attribute of Zeal than the one who feels zeal absolutely regarding himself and others.\n\nBecause of this, he is called protected or preserved (محفوظا), for that which necessitates Zeal does not occur from him. He is the generally felicitous one (السعيد في العموم), praised in the Sacred Law (الشرع). The other is blameworthy, just as the tyrant (الجبار) among creatures is blameworthy, even though Omnipotence (الجبروت) is a Divine Attribute. Likewise, the specificity of Zeal should not be an attribute of the believer. Rather, his Zeal should be universal *in* the Real, and then Allah, the Exalted, praises and commends him.\n\nI have alerted you to one of the secrets of Zeal so that you may find comfort in it if you grasp it. But do not employ it, lest you become wretched. Rather, be zealous for Allah *in* the Real absolutely, without restriction.\n\n### Zeal for the Real (الغيرة على الحق)\n\nAs for the state of Zeal *for* the Real, it is the concealment of inner secrets (السرائر) and mysteries (الأسرار). This is the state of the hidden ones (الأخفياء), the innocent ones among the Blameworthy (الملامية), whose stations (مقاماتهم) are unknown. No Divine matter appears from them by which it is known that Allah has special care (عناية) for them. Their states conceal their station due to the wisdom of the locale.\n\nFor they do not appear in the place of contention, since their Master, who is Allah, the Exalted, has been contended against regarding His Divinity (ألوهيته) in this abode. This group is realized (متحققة) in their Master, and that realization prevents them from appearing in the locale where their Master concealed Himself. Thus, they proceed with the common people (العامة) according to the outward acts of obedience (الطاعات) that are not customarily used to designate them as being among the People of Allah (أهل الله). This is because no actions have appeared from them that distinguish them from the common people, unlike what has appeared from some saints (الأولياء), such as breaking customs (خرق العوائد) in their states, or pursuing the changing of reprehensible acts when they appear, with a change that distinguishes them from the general change, such that they are pointed out for it. This, then, is the state of Zeal *for* the Real.\n\n### Zeal from the Real (الغيرة من الحق)\n\nAs for the state of Zeal *from* the Real, it is His preciousness (ضنته) regarding His friends (أوليائه), whereby He conceals them from the rest of His servants. He made concealment beloved to them and granted them success in Gnosis (المعرفة) according to the ruling of the locale. Thus, they were described by the attribute of their Master. They are with Him behind the veils of customs (حجب العوائد). They are the precious treasures (ضنائن الله) and brides (عرائسه) of Allah. They are with Him as He is with them: they witness none other than Him, and He looks upon none but them.\n\nWhoever wishes to know them should follow the path of Zeal *for* the Real so that he may be included in their company.\n\nAs for the saying of some concerning Zeal *for* the Real—that it is to be mentioned by the tongues of the heedless (الغافلين)—every tongue that mentions Him is not heedless. Rather, there is a sound fruit attained by the rememberer, which is the tongue, even if the intention of the owner of that tongue is not coupled with it. No rememberer has ever mentioned Him in heedlessness. Rather, this falls under His saying, the Exalted: <<وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ>> (And there is not a thing except that it glorifies Him with praise, but you do not understand their glorification). Such people are like this.\n\nThe proponent of this saying has no share in true manhood (الرجولة). Likewise, the saying of another: \"I feel zeal for that Beauty (الجمال) which is too transcendent (الأنزه) for the gaze of the likes of me.\" I wish I knew: what gaze do you possess? And where is the existent being (الموجود) who has a gaze originating from his own Essence (ذاته)? Does anyone gaze upon Him except He? O polytheist (المشرك)! Are you not ashamed to utter such a statement?\n\nThe state of Zeal *from* the Real is that you become the Real and stand in it according to its relation to the Real. Then you observe what the Zeal *from* Him is, and you act accordingly. Nevertheless, in every aspect, it requires the establishment of the Other (الغير), the differentiation between things, and distinction (التميز). Therefore, be careful in this regard not to affirm the existence of a superfluous entity (عين زائدة), nor to negate many entities (عيون كثيرة) in the absence of actual existence. So, affirm Multiplicity (الكثرة) in the state of immutability (الثبوت), but negate it from Existence (الوجود). And affirm Unity (الوحدة) in Existence, but negate it from immutability. Know this.",
    "ur": "باب نمبر دو سو تیرہ: غیرت کے حال کے بیان میں\n\nاس معنی میں شعر:\n\n> بیشک تغیر (تبدیلی) ایک خطرناک حال ہے،\n> جو علم اور حکم کے درمیان لوگوں کو لے جاتا ہے۔\n> اگر وہ کہے کہ حکم کے ذریعے کیا ہے، تو حقیقت کا علم\n> اسے ایسی تردید سے رد کر دیتا ہے جس میں افلاس (خسارہ) ہے۔\n> اسی طرح کمال والا شخص اس سے زیادہ جاہل ہے\n> جسے رات کے اندھیرے میں کوئی چراغ ہدایت نہ دے۔\n> اور ذات حق (الحق) کی غیرت کو اس سے پاک رکھنا زیادہ اولیٰ ہے،\n> کیونکہ اس حکم کے لیے کوئی انس (مانوسیت) نہیں ہے۔\n\n[غیرت غیر کا مشاہدہ ہے، بشرطیکہ غیر کا وجود ثابت ہو، اور اس کے تین مقامات ہیں]\n\nجان لو کہ چونکہ صوفیاء کے نزدیک غیرت کے تین مقامات ہیں: حق میں غیرت (غيرة في الحق)، حق پر غیرت (غيرة على الحق)، اور حق سے غیرت (غيرة من الحق)، اس لیے تجانس کی وجہ سے جس کی طرف اس کی نسبت کی جاتی ہے، اس کے تین احوال ہیں۔ غیرت کی اصل غیر (الغیر) کا مشاہدہ (الشہود) ہے، بشرطیکہ یہ ثابت ہو کہ وہاں کوئی غیر موجود ہے۔ اگر یہ ثابت ہو جائے تو ہماری بیان کردہ تفصیلات درست ہو جاتی ہیں۔ میرے نزدیک اس کے ثبوت سے مراد غیر کا وجودِ عین (عین وجود الغير) ہے، نہ کہ اس کی معقولیت (عین معقولیتہ)۔ کیونکہ یہ بلاشبہ معقول (Conceptual) ہے، لیکن کیا یہ معقول غیر عیناً موجود ہے یا نہیں؟ جس نے مظاہر (المظاہر) میں ظاہر (الظاہر) کا قول کیا، اس نے غیر کے وجود کا قول نہیں کیا، باوجود اس کے کہ اس کا حکم اور حال ثابت ہے، جسے غیرت (الغیرة) سے تعبیر کیا جاتا ہے۔ یہ ظاہر میں مظاہر کے استعداد کا اثر ہے۔ غیر (الغیر) عیناً یا حالاً کثرت (الكثرة) کو واجب کرتا ہے، یہ ضروری ہے۔ اور کثرت بلاشبہ معقول ہے، لیکن کیا اس کا کوئی وجودِ عینی ہے یا نہیں، اس میں غور ہے۔ جس نے کہا کہ یہ ظاہری کثرت (الكثرة الظاهرة) ایک ہی عین (عین واحدہ) کے ساتھ قائم مختلف احوال ہیں، جن کا وجود اس عین کے علاوہ نہیں ہے، تو یہ محض نسبتیں ہیں، لہٰذا وجودِ عینی میں ان کی کوئی عینی حقیقت نہیں ہے۔ اور جس نے کہا کہ ان کی اپنی اعیان (Essences) ہیں، اس نے نہ تو عین واحدہ کا قول کیا اور نہ ہی مظاہر میں ظاہر کا۔ کیونکہ کثیر (Multiples) مشہود (Witnessed) ہے، نہ کہ کثرت (Multiplicity)۔ پس کثرت معقول ہے اور کثیر موجود اور مشہود ہے۔ اسی وجہ سے اشیاء میں غیرت کے حال کا حکم ظاہر ہوا، اور ذات حق (الحق) کے علاوہ ہر شے غیرت سے متصف ہوئی۔ کوئی شے اپنی ذات کے علاوہ غیر نہیں ہو سکتی، مگر یہ کہ وہ شے کئی اشیاء ہو، تب ہر شے دوسری شے کا غیر ہو گی۔ اور ذات حق (الحق) اشیاء نہیں ہے، لہٰذا وہ غیر کو قبول نہیں کرتا۔ اس کے باوجود وہ غیور ہونے سے متصف ہوا ہے، اور اس کی غیرت ہی کی وجہ سے اس نے فواحش (الفواحش) کو حرام قرار دیا۔ پس جو کچھ ہم نے ذکر کیا ہے اس پر غور کرو تاکہ تم جان سکو کہ فاحشہ کیا ہے اور وہ فعل کیا ہے جسے فاحشہ یا غیر فاحشہ کہا جاتا ہے۔ پس حقیقت میں غیر ثابت ہے، لیکن وہ ثابت نہیں ہے جو وہ نہیں ہے۔\n\nجہاں تک حق میں غیرت (غيرة في الحق) کے حال کا تعلق ہے\n\nیہ وہ غیرت ہے جو منکر اور فواحش (الفواحش) کو دیکھنے پر پیدا ہوتی ہے۔ یہ وہ غیرت ہے جس سے ذات حق (الحق)، ملأ اعلیٰ، رسولوں اور صالح مومنین متصف ہوئے ہیں۔ اگرچہ غیرت طبع میں مرکوز ہے اور ناگزیر ہے، لیکن یہ محمود (قابل تعریف) اور مذموم (قابل مذمت) میں تقسیم ہوتی ہے۔ ہماری گفتگو محمود غیرت کے بارے میں ہے، اور وہ حق میں غیرت (غيرة في الحق) ہے، جو مشکل ترین مسائل میں سے ہے۔ کیونکہ اللہ تعالیٰ نے اپنی غیرت کی وجہ سے فواحش کو حرام قرار دیا، لیکن جب کائنات میں فواحش واقع ہوتے ہیں، تو ہم نہیں دیکھتے کہ وہ دنیا یا آخرت میں فوراً ان پر گرفت کرتا ہے۔ اس سے ہمیں معلوم ہوا کہ وہاں کوئی قوی تر مانع ہے جو اس سے روکتا ہے۔ یہ مانع احاطہ میں عظیم تر ہوتا ہے، اور اس کی نسبت غیرت سے وہی ہے جو علم الٰہی کی نسبت قدرت الٰہی سے ہے۔ اگرچہ قدرت ممکنات میں سے لامتناہی چیزوں سے متعلق ہے، لیکن اس میں شک نہیں کہ علم اس سے زیادہ احاطہ کرنے والا ہے، کیونکہ وہ ممکنات، واجبات، مستحیلات، موجودات اور غیر موجودات سب سے متعلق ہے۔ اس کے ساتھ ہی دلیل یہ بھی بتاتی ہے کہ لامتناہی چیز لامتناہی چیز پر فضیلت نہیں رکھتی۔ اسی طرح، جو شخص غیرت کے موجب فعل کا ارتکاب کرتا ہے، اس پر مؤاخذہ ترک کرنے کا سبب غیرت کے حال سے ضرور قوی تر ہونا چاہیے۔ یہ سب ذات حق (الحق) کے حق میں ہے۔ جہاں تک مخلوق کا تعلق ہے، تو نفس کو بدلنا ضروری ہے، اور وہ حق میں اس کا مکلف ہے۔ یہ ضروری ہے۔ اور جو مکلفین ایسا نہیں پاتے وہ مذموم ہیں۔ کیونکہ اسے حکم دیا گیا ہے کہ وہ اسے اپنے ہاتھ سے (فعل سے)، پھر اپنی زبان سے (قول سے)، پھر اپنے نفس میں اس کے وجود تک تبدیل کرے۔ اور یہ آخری درجہ زمانے میں ایمان کا سب سے کمزور درجہ ہے، نہ کہ غیور شخص کے نفس میں۔ پس غیرت کا حال وہ ہے جو غیور شخص اپنے نفس میں اس وقت محسوس کرتا ہے جب کوئی ایسا کام واقع ہو جو اللہ کو پسند نہ ہو، خواہ وہ اس سے سرزد ہو یا کسی اور سے۔ بلکہ جس کی یہ صفت ہو وہ معصوم (محفوظ) ہے۔ کیونکہ جس سے غیرت کا موجب فعل سرزد ہو اور وہ غیرت محسوس نہ کرے، لیکن جب وہ یہی فعل کسی دوسرے سے دیکھے تو اسے غیرت آ جائے، تو یہ حقیقی الٰہی غیرت نہیں ہے، بلکہ یہ نفسانی غیرت ہے جس میں اللہ تعالیٰ کا قرب نہیں ہے۔ وہ صحیح الٰہی غیرت ہے، لیکن اہل اللہ میں سے بہت سے لوگ اسے محسوس نہیں کرتے، سوائے اس کے جس نے حق کو حق معرفت (المعرفۃ) کے ساتھ پہچانا ہو۔ کیونکہ اللہ مخلوق کی غیرت سے زیادہ عظیم غیور ہے، اور وہ اس فعل کا فاعل ہے جو غیرت کو واجب کرتا ہے، لیکن وہ اس پر عمومی گرفت نہیں کرتا۔ اسی طرح، جس شخص میں زید کے حق میں کسی خاص فعل پر غیرت پائی جاتی ہے، لیکن جب وہی فعل اس سے سرزد ہو تو وہ غیرت محسوس نہ کرے (تو یہ درست نہیں)۔ اسی لیے ہم نے کہا کہ اس حال کا مالک اس شخص سے زیادہ حقدار اور قریب ہے کہ وہ غیرت کی الٰہی صفت سے متصف ہو جو مطلقاً اپنے اور دوسروں کے حق میں غیرت کرتا ہے۔ اسی وجہ سے اسے معصوم یا محفوظ کہا گیا، کیونکہ اس سے غیرت کا موجب فعل سرزد نہیں ہوا۔ اور وہ عموماً سعید ہے، جس کی شریعت میں تعریف کی گئی ہے۔ اور دوسرا شخص مذمت کا مستحق ہے، جیسا کہ مخلوق میں سے جبار کی مذمت کی جاتی ہے، اگرچہ جبروت ایک الٰہی صفت ہے۔ اسی طرح، غیرت کی خصوصیت سے مومن کو متصف نہیں ہونا چاہیے، بلکہ اس کی غیرت حق میں عام ہونی چاہیے۔ تب اللہ تعالیٰ اس کی تعریف کرتا ہے اور اس کی ثنا کرتا ہے۔ میں نے تمہیں غیرت کے اسرار میں سے ایک راز پر متنبہ کیا ہے تاکہ اگر تم اسے سمجھ لو تو اس سے راحت پاؤ، لیکن اسے استعمال نہ کرو ورنہ تم شقی ہو جاؤ گے۔ بلکہ بغیر کسی قید کے، حق میں مطلقاً اللہ کے لیے غیور بنو۔\n\nجہاں تک حق پر غیرت (غيرة على الحق) کے حال کا تعلق ہے\n\nیہ سرائر (باطنی راز) اور اسرار کو چھپانا ہے۔ یہ ملامتیہ (ملامتی) میں سے ان پوشیدہ، بے گناہ لوگوں کا حال ہے جن کے مقامات نامعلوم ہیں۔ ان پر کوئی ایسا الٰہی امر ظاہر نہیں ہوتا جس سے یہ معلوم ہو کہ اللہ کی خاص عنایت ان پر ہے۔ ان کے احوال مقام کی حکمت کی وجہ سے ان کے مقام کو چھپاتے ہیں۔ کیونکہ وہ نزاع کی جگہ پر ظاہر نہیں ہوتے، اس لیے کہ ان کے آقا، یعنی اللہ تعالیٰ، کی الوہیت کے بارے میں اس دنیا میں نزاع کیا گیا ہے۔ اور یہ گروہ اپنے آقا کے ساتھ متحقق (حقیقت پذیر) ہے، لہٰذا اس تحقق نے انہیں اس جگہ ظاہر ہونے سے روک دیا جہاں ان کے آقا نے خود کو چھپایا ہے۔ پس وہ عام لوگوں کے ساتھ ان ظاہری اطاعات پر چلتے ہیں جن کے ذریعے عرف میں انہیں اہل اللہ میں شمار کرنے کا رواج نہیں ہے، کیونکہ ان سے ایسے افعال ظاہر نہیں ہوئے جو انہیں عام لوگوں سے ممتاز کریں، جیسا کہ بعض اولیاء سے احوال میں خرقِ عادات کا ظاہر ہونا، یا منکرات کے ظاہر ہونے پر ان کی ایسی تبدیلی کی پیروی کرنا جو عام تبدیلی سے ممتاز ہو، یہاں تک کہ ان کی طرف اشارہ کیا جائے۔ پس یہ حق پر غیرت (غيرة على الحق) کا حال ہے۔\n\nجہاں تک حق سے غیرت (غيرة من الحق) کے حال کا تعلق ہے\n\nیہ ذات حق (الحق) کا اپنے اولیاء کے ساتھ بخل کرنا ہے، جہاں اس نے انہیں اپنے باقی بندوں سے چھپا دیا۔ پس اس نے ان کے لیے پردہ پوشی کو محبوب بنا دیا اور انہیں مقام کی حکمت کے مطابق معرفت (المعرفة) کی توفیق دی۔ چنانچہ وہ اپنے آقا کی صفت سے متصف ہوئے، اور وہ اس کے نزدیک عادات کے پردوں کے پیچھے ہیں۔ پس وہ اللہ کے ضنائین (محبوب ترین) اور اس کی دلہنیں ہیں۔ وہ اس کے نزدیک ایسے ہیں جیسے وہ ان کے نزدیک ہے۔ پس وہ اس کے سوا کسی کا مشاہدہ (الشہود) نہیں کرتے، اور وہ بھی ان کے سوا کسی کو نہیں دیکھتا۔ جو شخص انہیں جاننا چاہے، اسے چاہیے کہ وہ حق پر غیرت (غيرة على الحق) کے راستے پر چلے تاکہ ان کے زمرے میں شامل ہو جائے۔\n\nاور بعض لوگوں کا حق پر غیرت کے بارے میں یہ قول کہ غافلوں کی زبانوں سے ذکر کیا جائے، تو ہر وہ زبان جو اس کا ذکر کرتی ہے وہ غافل نہیں ہے، بلکہ اس کے لیے ایک صحیح ثمرہ ہے جو ذاکر (یعنی زبان) کو حاصل ہوتا ہے، اگرچہ اس زبان کے مالک کے نفس میں کوئی نیت شامل نہ ہو۔ پس کسی ذاکر نے کبھی غفلت سے ذکر نہیں کیا، بلکہ یہ اللہ تعالیٰ کے اس قول میں شامل ہے: **\"اور کوئی چیز ایسی نہیں جو اس کی حمد کے ساتھ تسبیح نہ کرتی ہو، لیکن تم ان کی تسبیح کو نہیں سمجھتے\"** (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ)۔ ایسے ہی لوگ ہیں۔ پس اس قول کے قائل کا رجولیت (مردانگی) میں کوئی حصہ نہیں ہے۔ اسی طرح دوسرے کا یہ قول کہ: \"میں اس جمال پر غیرت کرتا ہوں جو مجھ جیسے کی نظر سے پاک ہے، کاش میں جانتا!\" اور تمہاری کون سی نظر ہے؟ اور وہ موجود کہاں ہے جس کی اپنی ذات سے کوئی نظر ہو؟ اور کیا اسے اس کے سوا کوئی دیکھتا ہے؟ اے مشرک! کیا تمہیں ایسی بات کہتے ہوئے شرم نہیں آتی؟\n\nپس حق سے غیرت (غيرة من الحق) کا حال یہ ہے کہ تم حق ہو جاؤ اور اس میں حق سے اس کی نسبت کے ساتھ قائم ہو جاؤ۔ پھر تم دیکھو کہ اس سے غیرت کیا ہے اور اس پر قائم ہو جاؤ۔ اس کے باوجود، ہر صورت میں، یہ غیر (الغیر) کے ثبوت، اشیاء کے درمیان فرق اور امتیاز کو طلب کرتا ہے۔ پس اس میں کسی زائد عین (عین زائدہ) کے وجود کو ثابت کرنے سے یا غیر عینی وجود میں کثیر اعیان کی نفی کرنے سے بچو۔ پس کثرت (الكثرة) کو ثبوت (Establishment) میں ثابت کرو اور وجود (الوجود) سے اس کی نفی کرو، اور وحدت (الواحدۃ) کو وجود میں ثابت کرو اور ثبوت سے اس کی نفی کرو۔ پس یہ جان لو۔",
    "fa": "«باب دویست و سیزدهم در حال غیرت»\n\nشعر در این معنی:\n\n> تغییر، در حالی که خطرناک است، *** مردم را میان علم و حکم به گمراهی می‌کشاند.\n> اگر کسی بگوید حکم چیست، علم آن را رد می‌کند، *** ردی از حقیقت که در آن ورشکستگی (افلاس) است.\n> همچنین، صاحب کمال از کسی که *** در تاریکی شب چراغی او را هدایت نکرده، نادان‌تر است.\n> و غیرت (ضنّت) حق سزاوارتر است که او را *** از آن منزه بدانی، زیرا آن حکم را الفتی نیست.\n\n[غیرت، مشاهده غیر است، اگر ثابت شود که غیری وجود دارد، و برای آن سه مقام است]\n\nبدان که چون غیرت نزد این طایفه (صوفیه) بر سه مقام است: غیرت در حق (غيرة في الحق)، غیرت بر حق (غيرة على الحق)، و غیرت از حق (غيرة من الحق)؛ پس برای آن سه حال است بر حسب آنچه به آن نسبت داده می‌شود به جهت تجانس. اما اصل غیرت، مشاهده (الشهود) غیر است، اگر ثابت شود که غیری وجود دارد. اگر این ثابت شود، آنچه ما از ایشان در باب تفصیلات گفته‌ایم صحیح است. و منظور من از ثبوت آن، عین وجود غیر است، نه عین معقولیت آن؛ زیرا غیر بدون شک معقول است، اما آیا این غیر معقول، عیناً موجود است یا خیر؟ پس کسی که به «ظاهر در مظاهر» قائل است، وجود غیر را نمی‌پذیرد، هرچند حکم و حال آن که به غیرت تعبیر می‌شود، ثابت باشد. و این (غیرت) اثر استعداد مظاهر در ظاهر است. و غیر، موجب کثرت است، خواه عیناً یا حالاً، و این ضروری است. و کثرت بدون شک معقول است، اما آیا وجود عینی دارد یا خیر، جای تأمل است. پس کسی که می‌گوید این کثرتِ آشکار در عین، احوال مختلفی است که به یک عین واحد قائم‌اند و وجودی جز در آن عین ندارند، این‌ها نسبت‌هایی هستند و حقیقت عینی در وجود عینی ندارند. و کسی که می‌گوید کثرت دارای اعیان است، به عین واحد و به «ظاهر در مظاهر» قائل نیست؛ زیرا آنچه مشهود است، کثیر است نه کثرت. پس کثرت معقول است و کثیر موجود و مشهود است. از اینجاست که حکم حال غیرت در اشیاء ظاهر شد و حق (الحق) به غیرت متصف گردید. و شیء، غیرِ خود نمی‌شود مگر آنکه آن شیء، اشیاء باشد، در این صورت هر شیئی غیرِ شیء دیگر خواهد بود. و حق (الحق) اشیاء نیست، پس غیر را نمی‌پذیرد، با این حال به غیور بودن متصف شده است. و از غیرت اوست که فواحش را حرام کرده است. پس در آنچه ذکر کردیم تدبر کن تا بدانی فاحشه چیست و فعلی که فاحشه نامیده می‌شود و غیر فاحشه کدام است. پس غیر، بر حقیقت ثابت است، نه ثابتی که او نیست.\n\nو اما حال غیرت در حق (غيرة في الحق)، آن غیرتی است که هنگام دیدن منکر و فواحش حاصل می‌شود و این همان صفتی است که حق (الحق)، ملأ اعلی، رسولان و صالحان مؤمنان به آن متصف شده‌اند. غیرت در طبع سرشته شده و ناگزیر است، اما به محمود و مذموم تقسیم می‌شود و سخن ما در مورد نوع محمود آن است که همان غیرت در حق است. این از دشوارترین مسائل است؛ زیرا خداوند متعال از روی غیرت، فواحش را حرام کرده است، اما هنگامی که فواحش در هستی (الوجود) واقع می‌شوند، نمی‌بینیم که او در گرفتن و مؤاخذه کردن بر آن‌ها شتاب کند، نه در دنیا و نه در آخرت. پس دانستیم که مانعی قوی‌تر وجود دارد که از این کار جلوگیری می‌کند. این مانع باید احاطه‌ای عظیم‌تر داشته باشد و نسبت آن به غیرت، مانند نسبت علم الهی به قدرت الهی است. زیرا قدرت، هرچند به بی‌نهایت ممکنات تعلق می‌گیرد، اما شک نکن که علم احاطه‌اش بیشتر است، زیرا علم به ممکنات، واجبات، مستحیلات، کائنات و غیر کائنات تعلق می‌گیرد، علاوه بر اینکه دلیل نشان می‌دهد که بی‌نهایت بر بی‌نهایت برتری ندارد. همچنین، سببی که موجب ترک مؤاخذه بر آنچه از کسی که مرتکب عملی شده که غیرت بر آن واقع شده، می‌شود، باید قوی‌تر از حال غیرت باشد. این همه در حق حق (الحق) است. اما در حق مخلوق، تغییر نفس ضروری است و او در حق به آن مکلف است و این ناگزیر است. و کسی که از مکلفین این حال را نیابد، مذموم است؛ زیرا او مخاطب است که منکر را با دستش (فعل)، سپس با زبانش (قول) و سپس با وجود آن در نفسش تغییر دهد، که این در این زمان، ضعیف‌ترین ایمان است، نه در نفس شخص غیور. پس حال غیرت، آن چیزی است که شخص غیور در نفس خود هنگام وقوع آنچه مورد رضای خدا نیست، از دگرگونی امر می‌یابد، خواه آن عمل از خود او سر زده باشد یا از دیگری. بلکه کسی که صفتش این باشد، معصوم است. زیرا کسی که از او عملی سر می‌زند که موجب غیرت است، اما غیرت نمی‌ورزد، ولی وقتی آن را از دیگری می‌بیند، غیرت او را فرا می‌گیرد، این غیرت، غیرت حقیقی الهی نیست، بلکه غیرت نفسانی است که در آن قربی به خداوند متعال نیست. آن غیرت الهی صحیح است، اما بسیاری از اهل الله آن را درک نمی‌کنند، مگر کسی که حق (الحق) را به حق معرفت (المعرفة) شناخته باشد. زیرا خداوند در غیرت ورزیدن، از مخلوق غیورتر است و او فاعل امری است که موجب غیرت می‌شود و بر آن مؤاخذه عمومی نمی‌کند. همچنین، کسی که در حق زید به خاطر فعل خاصی غیرت می‌ورزد، اما وقتی همان فعل از خودش سر می‌زند، غیرتی نمی‌یابد، به همین دلیل گفتیم صاحب این حال، سزاوارتر و نزدیک‌تر به اتصاف به نعت الهی غیرت است تا کسی که مطلقاً در حق خود و غیر خود غیرت می‌ورزد. و به همین دلیل است که او معصوم یا محفوظ نامیده شده است، زیرا از او عملی که موجب غیرت است، سر نزده است. و او در عموم، سعادتمند و ستایش شده در شرع است. و دیگری مذمت می‌شود، همان‌طور که جبار از مخلوقین مذمت می‌شود، هرچند جبروت وصفی الهی است. همچنین، خصوصیت غیرت شایسته نیست که مؤمن به آن متصف شود، بلکه باید غیرت او در حق عمومیت یابد و در آن هنگام خداوند او را می‌ستاید و ثنا می‌گوید. من تو را به رازی از اسرار غیرت آگاه ساختم تا اگر آن را دریابی، به آن آرامش یابی و آن را به کار نَبَری که شقی شوی، بلکه برای خدا در حق، مطلقاً و بدون قید، غیور باش.\n\nو اما حال غیرت بر حق (غيرة على الحق)، آن کتمان سرائر و اسرار است. و این حال اخفیاء (پنهان‌شدگان) و بی‌گناهان از ملامتیه (اهل ملامت) است که ناشناخته‌اند و مقاماتشان مجهول است. هیچ امر الهی بر آنان ظاهر نمی‌شود که به واسطه آن دانسته شود که خداوند به آنان عنایت دارد. پس احوالشان مقامشان را به جهت حکمت این موطن می‌پوشاند؛ زیرا آنان در محل نزاع ظاهر نمی‌شوند، چرا که سرورشان، یعنی خداوند متعال، در این دنیا در الوهیتش مورد نزاع قرار گرفته است. و این طایفه به سرور خود متحقق شده‌اند، پس این تحقق مانع از آن شد که در موطنی که سرورشان در آن پنهان شده، ظاهر شوند. بنابراین، با عامه مردم بر همان ظواهر طاعاتی که عامه بر آن هستند، رفتار می‌کنند؛ طاعاتی که در عرف معمول نیست که به واسطه آن‌ها اهل الله نامیده شوند، زیرا از ایشان افعالی که آنان را از عامه متمایز سازد، ظاهر نشده است، مانند خرق عادات در احوال که از برخی اولیاء ظاهر شده، یا پیگیری تغییر منکرات به گونه‌ای که از تغییر عمومی متمایز باشد و به او اشاره شود. پس این حال غیرت بر حق است.\n\nو اما حال غیرت از حق (غيرة من الحق)، آن غیرت ورزیدن (ضنّت) حق به اولیای خود است، آنجا که آنان را از سایر بندگانش پنهان داشته است. پس ستر را محبوب آنان گردانیده و ایشان را به معرفت (المعرفة) به حکم موطن موفق داشته است. پس به صفت سرورشان متصف شده‌اند و نزد او پشت پرده‌های عادات قرار گرفته‌اند. آنان ضنائن (محبوبان خاص) و عروسان خدا هستند. آنان نزد او همانند او نزد ایشان هستند؛ پس جز او را مشاهده (الشهود) نمی‌کنند و او نیز جز به آنان نمی‌نگرد. پس هر کس بخواهد آنان را بشناسد، باید راه غیرت بر حق (غيرة على الحق) را بپیماید تا در سلک آنان درآید. و اما سخن برخی از ایشان در باب غیرت بر حق که می‌گویند: «ذکر حق به زبان غافلان است»، هر زبانی که او را ذکر کند، غافل نیست، بلکه ثمری صحیح دارد که ذاکر، یعنی همان زبان، آن را می‌یابد، حتی اگر نیتی از نفس صاحب آن زبان همراه آن نباشد. پس هیچ ذاکری با غفلت او را ذکر نکرده است، بلکه این از قول خداوند متعال است: **«و هیچ چیز نیست مگر آنکه با ستایش او تسبیح می‌گوید، ولی شما تسبیح آن‌ها را در نمی‌یابید» (وَإِنْ مِنْ شَيْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لَا تَفْقَهُونَ تَسْبِيحَهُمْ)**. صاحب این سخن بهره‌ای از رجولیت (مردانگی معنوی) ندارد. همچنین سخن دیگری که می‌گوید: «بر آن جمالی که از نظر امثال من منزه است، غیرت می‌ورزم. ای کاش می‌دانستم!» و تو را چه نظری است؟ و موجودی که از ذات خود نظر دارد کجاست؟ و آیا جز او کسی به او می‌نگرد؟ ای مشرک، آیا شرم نمی‌کنی که چنین سخنی بگویی؟ پس حال غیرت از حق (غيرة من الحق) آن است که خود حق باشی و در آن به نسبت خود به حق قیام کنی، پس بنگری که غیرت از او چیست و بر آن باشی. با این حال، در هر صورت، غیرت مستلزم ثبوت غیر و تفرقه میان اشیاء و تمایز است. پس در این باره از اثبات وجود عین زائد یا از نفی اعیان کثیر در غیر وجود عینی برحذر باش. پس کثرت را در ثبوت اثبات کن و آن را از وجود (الوجود) نفی کن، و وحدت را در وجود اثبات کن و آن را از ثبوت نفی کن. پس این را بدان."
  },
  "page_count": 3
}