{
  "id": 506,
  "title": {
    "ar": "الباب السادس وخمسمائة في معرفة حال قطب كان منزله ومَكَرُوا ومَكَرَ الله والله خَيْرُ الْماكِرِينَ ومَكَرُوا مَكْراً ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ",
    "en": "Chapter Five Hundred and Six: Concerning the knowledge of the state (حال) of a Pole (قطب) whose station was [defined by the verses]: <<وَمَكَرُوا وَمَكَرَ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ>> (And they plotted, and Allah plotted, and Allah is the best of plotters) and <<وَمَكَرُوا مَكْرًا وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ>> (And they devised a plan, and We devised a plan, while they perceived not).",
    "ur": "باب پانچ سو چھ (۵۰۶): ایک قطب (Qutb) کے حال کی معرفت (المعرفۃ) کے بیان میں جس کا روحانی مقام (منزل) یہ تھا: \"اور انہوں نے مکر کیا اور اللہ نے بھی مکر کیا، اور اللہ سب سے بہتر مکر کرنے والا ہے\" (ومَكَرُوا ومَكَرَ الله والله خَيْرُ الْماكِرِينَ) اور \"اور انہوں نے ایک چال چلی اور ہم نے بھی ایک چال چلی، اور انہیں خبر بھی نہ ہوئی\" (ومَكَرُوا مَكْراً ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ)",
    "fa": "باب پانصد و ششم در معرفت (المعرفة) حال قطبی (قطب) که منزلش بود: و مکر کردند و خدا مکر کرد و خدا بهترین مکرکنندگان است (ومَكَرُوا ومَكَرَ الله والله خَيْرُ الْماكِرِينَ) و مکر کردند مکری، و ما نیز مکری کردیم در حالی که ایشان درک نمی‌کردند (ومَكَرُوا مَكْراً ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ)"
  },
  "content": {
    "ar": "## (الباب السادس وخمسمائة في معرفة حال قطب كان منزله ومَكَرُوا ومَكَرَ الله والله خَيْرُ الْماكِرِينَ ومَكَرُوا مَكْراً ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ)\n\n\n> أن لله في الخلائق مكرا *** وهو عنهم مغيب ليس يدري‏\n\n\n> وهو منهم وليس يدريه إلا *** من أقام الصلاة شفعا ووترا\n\n\n> بمناجاة ذلة وخضوع *** تتوالى عليه فيها وتترى‏\n\n\n> وشهود ترى الحقائق فيه *** طالعات عليه شمسا وبدرا\n\n\n> ووجود ترى الكوائن فيه *** يهب العلم منه سرا وجهرا\n\n\n### [مكر الإلهي‏]\n\n\nقال الله عز جلاله سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ وقال ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ فإذا شعر بالمكر زال كونه مكرا إلا في حال واحد وذلك إذا شعر بمكر الله في أمر أقامه فيه وأقام عليه وأقامته عليه بعد العلم أنه من مكر الله مكر من الله مثل قوله وأَضَلَّهُ الله عَلى‏ عِلْمٍ وبهذا القدر يفارق علم الغيب فإن عالم الغيب إذا علمه لم يكن غيبا عنده فزال عنه في حقه اسم الغيب ولم يزل عن هذا الذي أقام على الأمر الذي كان لا يشعر به أنه مكر من الله اسم المكر به في إقامته على ذلك الأمر في حقه وإلا فالمسألة على السواء لو لا هذا الفارق الدقيق ومن المكر الإلهي ما يقصد به ضررا لعبد ومنه ما لا يقصد به ضررا لعبد وإنما يكون لحكمة أخرى يكون فيها سعادة العبد فإنه لو لا المكر الخفي لما صح تكليف ولا طلب جزاء فإنه من مكر الله المحمود في الممكور به تكليف الله إياه بالأعمال والسمع والطاعة له فيما كلفه به والأمر يعطي في نفسه أن الأعمال خلق لله في العبد وأن الله لا يكلف نفسه وليس العامل إلا هو وهذا قد شعر به بعض الناس وأقاموا على العمل وثابروا عليه أعني عمل الخيرات ومن مكر الله قسمه لصلاة\nبينه وبين عبده نصفين والكل له فمن أداها بالقسمة فقد شفع صلاته ومن أداها بقوله إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ أداها وترا فمؤدي الصلاة شفعا هو الخاشع في صلاته ومن أداها وترا على علم لا يتصف بالخشوع في نفسه وإن ظهر على ظاهره فإن ذلك حكمه حكم ظهور العمل منه والله العامل لا هو قال تعالى والله خَلَقَكُمْ وما تَعْمَلُونَ وأما من يرى مكر\n\n\nالله ليس غير مكرهم وهم الذين يُخادِعُونَ الله وهُوَ خادِعُهُمْ بعين اعتقادهم أنهم يخادعون الله فما يخادع الله إلا جاهل بالله غاية الجهل أو عارف بالله غاية المعرفة التي لا يمكن أن يكون للمحدث أتم منها فأما الجهل في ذلك فمعلوم وأما المعرفة في ذلك فكما قال عمر رضي الله عنه من خدعنا في الله انخدعنا له وفائدة هذا إنه يعلم من المخادع أنه يخدعه فينخدع له ولا يعلمه أنه انخدع له وهو المتباله الذي يظن فيه أنه أبله وليس بإبله فإذا علم العارف أنه لا واهب ولا قابل إلا الله ومع هذا يستعيذ من مكر الله كما تعوذ رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بالله من الله تمشية لمراد الله أي لإرادة الله فإنه ما وضع في العالم حكما إلا ليستعمل في محكوم عليه ولو لم يرد استعماله لكان عبثا ولو لم يوحد من يستعمل فيه ذلك الحكم ومن يعمل به لكان أيضا عبثا فالعامل به على بصيرة أولى من العامل به على غير بصيرة فلا يستوي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ وإن الله قد مشى لمن زعم أنه يخدع الله خداعه ومكره هنا فيكون في حق طائفة من مكر الله بهم ويكون في حق طائفة أخرى من عناية الله بهم مثل قوله افعل ما شئت فقد غفرت لك أي سترت نفسي عنك من أجلك فلا نؤاخذك إذا آخذت غيرك بذلك لما سبقت لك عندي من العناية فقدم المغفرة للذنب قبل وقوع الذنب وهو قوله وما تأخر فيأتي الذنب مغفورا أي مستورا أي بحجاب بينه وبين من يقع منه فلا يؤثر فيه حكمه لأجل ذلك الستر وما سمي الله المكر استدراجا إلا لتنقله في المراتب من درج إلى درج ولو لا ذلك الانتقال لما اتصف به أهل الله فإنه بانتقاله يعم المقامات والمراتب وهي بين محمود ومذموم ولو لا ذلك ما وصف الله نفسه بالمكر والاستدراج ولذلك يتصف به أهل الله فيخادعون وينخدعون‏\n\n\nورد خبر أن بعض العباد يوقفه الله في السؤال يوم القيامة فيعترف بين يديه أنه عمل من الخير ما لم يعمل وهو كاذب في ذلك فيتجاهل له ربه حتى يقول ذلك القائل إن الله قد مشى عليه ما كذب به عنده فيأمر به إلى الجنة فتقول الملائكة يا رب إنه كذب فيقول الله قد علمت ذلك ولكني استحييت أن أكذب شيبته‏\n\n\nفهذا من انخداع الله له فأهل الله أولى بالتجاوز عن عباد الله إذا عاملوهم بمثل هذه المعاملة ونحن ممن تحقق به غاية التحقق وهو من أعظم مكارم الأخلاق الإلهية فمن يقدر على الاغتبان ولا يظهر للغابن أنه اغتبن له فقد تمكن من حكم نفسه غاية التمكن لأن طبع النفس يطلب أن يعرف الخير منها ولا خير مثل الاغتبان فإنه نظير الحلم مع القدرة في نفس الأمر وهو يظهر للجاني أنه عجز عن مؤاخذته وهو ما ترك مؤاخذته إلا حلما لا عجزا وذلك لا يصدر إلا من قوى على حكم طبعه ونفسه والله ذو القوة المتين بحلمه لمن عرف والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 506: On the Gnosis of the State of a Pole Whose Station is [Related to the Verses]: And they planned, and Allah planned, and Allah is the best of planners, and they planned a plan, and We planned a plan, while they perceived not\n\nIndeed, Allah has a subtle stratagem (مكرا) concerning creation,\nAnd it is hidden from them; they do not perceive it.\n\nAnd it is from them, yet none knows it\nExcept he who establishes the prayer in pairs (شفعا) and singly (وترا),\n\nThrough intimate supplication (مناجاة) of humility and submission (خضوع)\nWhich follows upon him continuously and successively,\n\nAnd a witnessing (شهود) in which he sees the Realities (الحقائق)\nRising upon him like the sun and the moon,\n\nAnd an Existence (وجود) in which he sees the Contingent Things (الكوائن)\nGranting Knowledge (العلم) from it, secretly and openly.\n\n### [The Divine Stratagem]\n\nAllah, Glorious is His Majesty, said: <<سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ>> (We will lead them on step by step from where they do not perceive) and He said: <<وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ>> (And We planned a plan, while they perceived not). If one perceives the stratagem (المكر), its nature as a stratagem ceases, except in one specific state: when one perceives Allah’s stratagem in a matter in which He established him, and upon which he persevered, and his perseverance upon it—even after knowing it is from Allah’s stratagem—is itself a stratagem from Allah. This is similar to His saying: <<وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ>> (And Allah led him astray upon [His] Knowledge).\n\nBy this measure, it differs from the Knowledge of the Unseen (علم الغيب). For the knower of the Unseen, when he knows it, it is no longer unseen to him, and the designation of the Unseen (الغيب) is removed concerning him. However, the designation of the stratagem (المكر) is not removed from the one who perseveres upon the matter—which he did not perceive to be a stratagem from Allah—due to his perseverance upon that matter in his regard. Otherwise, the issue would be identical, were it not for this subtle distinction (الفارق الدقيق).\n\nPart of the Divine Stratagem (المكر الإلهي) is that by which harm is intended for a servant, and part of it is that by which no harm is intended for a servant, but rather it is for another wisdom (حكمة أخرى) in which the servant’s felicity (سعادة) lies. For were it not for the hidden stratagem (المكر الخفي), neither obligation (تكليف) nor the demand for recompense (جزاء) would be valid. Indeed, among Allah’s praiseworthy stratagems (مكر الله المحمود) concerning the one upon whom the stratagem is enacted, is Allah’s obligation upon him regarding deeds, and hearing and obeying Him in what He has obligated. Yet the matter inherently implies that deeds (الأعمال) are Allah’s creation within the servant, and that Allah does not obligate Himself, and the only Actor (العامل) is He. Some people have perceived this and have persevered in action and maintained it—I mean the performance of good deeds (عمل الخيرات).\n\nPart of Allah’s stratagem is His division of the prayer (صلاة) between Himself and His servant into two halves, though the entirety belongs to Him. Whoever performs it according to this division has performed his prayer in pairs (شفعا). And whoever performs it based on His saying: <<إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (To Him returns the whole affair), has performed it singly (وترا). Thus, the one who performs the prayer in pairs (شفعا) is the one who is humble (الخاشع) in his prayer. But the one who performs it singly (وترا) upon [Divine] Knowledge (علم) is not characterized by humility (الخشوع) in his inner self, even if it appears on his exterior, for that appearance is governed by the manifestation of the deed from Him, and Allah is the Actor, not the servant. The Exalted said: <<وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ>> (And Allah created you and what you do).\n\nAs for those who see Allah’s stratagem as nothing other than their own stratagem—these are the ones who <<يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ>> (seek to deceive Allah, but He is deceiving them) by the very nature of their belief that they are deceiving Allah. None seeks to deceive Allah except one who is utterly ignorant (جاهل) of Allah, or one who possesses the ultimate Gnosis (المعرفة) that cannot be surpassed by any contingent being (المحدث). As for the ignorance in this matter, it is known. As for the Gnosis in this matter, it is as Umar, may Allah be pleased with him, said: \"Whoever deceives us concerning Allah, we allow ourselves to be deceived by him.\" The benefit of this is that the Gnostic knows that the deceiver is deceiving him, so he allows himself to be deceived by him, yet he does not let the deceiver know that he has been deceived. This is the feigned simpleton (المتباله) who is thought to be foolish, but is not foolish.\n\nWhen the Gnostic (العارف) knows that there is no Giver and no Receiver except Allah, yet despite this, he seeks refuge from Allah’s stratagem (مكر الله), just as the Messenger of Allah, peace and blessings be upon him, sought refuge with Allah from Allah—this is done to facilitate Allah’s Will (مراد الله), meaning His Intention (إرادة الله). For He did not establish any ruling (حكما) in the World (العالم) except that it should be applied to the one ruled over. Had He not willed its application, it would have been in vain (عبثا). And had He not unified the one upon whom that ruling is applied and the one who acts by it, it would also have been in vain. Therefore, the one who acts upon insight (بصيرة) is superior to the one who acts without insight. Thus, <<لَا يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ>> (Those who know and those who do not know are not equal).\n\nIndeed, Allah has allowed the deceit and stratagem of the one who claims to deceive Allah to proceed here. Thus, for one group, it is part of Allah’s stratagem against them, and for another group, it is part of Allah’s special care (عناية) for them. An example is His saying: \"Do what you wish, for I have forgiven you,\" meaning: \"I have veiled Myself from you for your sake, so I will not hold you accountable when I hold others accountable for the same, due to the special care that preceded for you with Me.\" Thus, He granted forgiveness for the sin before the sin occurred, which is His saying: \"and what is delayed.\" So the sin comes forgiven, meaning veiled (مستورا), meaning with a barrier (حجاب) between it and the one from whom it occurs, so its ruling does not affect him because of that veil.\n\nAllah only named the stratagem *Istidraj* (leading on step by step) because of its transition through the Levels (المراتب) from degree to degree. Were it not for this transition, the People of Allah (أهل الله) would not be characterized by it. Through its transition, it encompasses the spiritual Stations (المقامات) and Levels (المراتب), which are between praiseworthy and blameworthy. Were it not for this, Allah would not have described Himself with the stratagem (المكر) and *Istidraj*. For this reason, the People of Allah are characterized by it: they deceive and are deceived.\n\nA report has been transmitted that some servants will be made to stand before Allah for questioning on the Day of Resurrection, and one will confess before Him that he performed good deeds which he did not actually perform, and he is lying in this. His Lord will feign ignorance (يتجاهل) toward him until that speaker says that Allah has allowed the lie he told to pass with Him. Then He commands that the servant be taken to Paradise. The angels will say, \"O Lord, he lied.\" Allah will say, \"I knew that, but I was ashamed to belie his gray hair.\"\n\nThis is part of Allah allowing Himself to be deceived by him. Thus, the People of Allah (أهل الله) are more deserving of overlooking the faults of Allah’s servants when they deal with them in a similar manner. We are among those who have realized this to the utmost degree of realization, and it is one of the greatest noble Divine characteristics (مكارم الأخلاق الإلهية). Whoever is able to allow himself to be cheated (الاغتبان) and does not reveal to the cheater (الغابن) that he has been cheated, has attained the utmost mastery over the rule of his own soul (نفسه). This is because the nature of the soul demands that the good within it be known, and there is no good like allowing oneself to be cheated, for it is analogous to forbearance (الحلم) combined with power in reality. It appears to the offender that he was incapable of holding him accountable, yet he only refrained from accountability out of forbearance, not incapacity. This only proceeds from one who has mastered the rule of his nature and his soul. And Allah is the Possessor of Strength, the Firm, by His forbearance toward the one who knows. And <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "(باب پانچ سو چھٹا: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: وَمَكَرُوا وَمَكَرَ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ (اور انہوں نے مکر کیا اور اللہ نے بھی مکر کیا، اور اللہ سب سے بہتر مکر کرنے والا ہے) اور وَمَكَرُوا مَكْرًا وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ (اور انہوں نے ایک چال چلی اور ہم نے بھی ایک چال چلی اور انہیں خبر بھی نہ ہوئی))\n\nبے شک اللہ کا مخلوقات (الخلائق) میں ایک مکر (مكر) ہے،\nاور وہ ان سے پوشیدہ ہے، جس کا ادراک نہیں کیا جاتا۔\n\nاور وہ (مکر) ان ہی میں ہے، مگر اسے کوئی نہیں جانتا\nسوائے اس کے جو نماز کو شفع (جفت) اور وتر (طاق) کے طور پر قائم کرتا ہے۔\n\nذلت اور عاجزی کی مناجات کے ساتھ،\nجو اس پر پے در پے اور مسلسل آتی ہے۔\n\nاور ایسے شہود (الشہود) کے ساتھ جس میں وہ حقائق (الحقائق) کو دیکھتا ہے\nجو اس پر سورج اور چاند کی طرح طلوع ہوتے ہیں۔\n\nاور ایسی ہستی (الوجود) کے ساتھ جس میں وہ کائنات (الکوائن) کو دیکھتا ہے،\nجو اس سے علم (العلم) کو پوشیدہ اور ظاہر طور پر عطا کرتی ہے۔\n\n### [مکر الٰہی (مكر الإلهي)]\n\nاللہ عز جلالہ نے فرمایا: سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ (ہم انہیں تدریجی گرفت (الاستدراج) میں لیں گے جہاں سے انہیں خبر بھی نہ ہوگی) اور فرمایا: وَمَكَرْنَا مَكْرًا وَهُمْ لَا يَشْعُرُونَ (اور ہم نے ایک چال چلی اور انہیں خبر بھی نہ ہوئی)۔ پس جب کوئی شخص مکر (مكر) کا شعور (الشعور) حاصل کر لیتا ہے تو وہ مکر ہونا ختم ہو جاتا ہے، سوائے ایک حالت کے۔ اور وہ یہ ہے کہ جب وہ کسی ایسے معاملے میں اللہ کے مکر کا شعور حاصل کر لے جس میں اللہ نے اسے قائم کیا، اور وہ اس پر قائم رہا، اور اس کا اس پر قائم رہنا، یہ جاننے کے بعد بھی کہ یہ اللہ کی طرف سے مکر ہے، اللہ کی طرف سے مکر ہی رہتا ہے، جیسا کہ اس کے اس قول میں ہے: وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ (اور اللہ نے اسے علم (العلم) کے باوجود گمراہ کر دیا)۔ اور اسی قدر سے یہ علم غیب (علم الغيب) سے جدا ہو جاتا ہے، کیونکہ غیب (الغيب) کا جاننے والا جب اسے جان لیتا ہے تو وہ اس کے نزدیک غیب نہیں رہتا، اور اس کے حق میں غیب کا نام زائل ہو جاتا ہے۔ لیکن اس شخص سے، جو اس امر پر قائم رہا جس کے بارے میں اسے شعور نہیں تھا کہ یہ اللہ کی طرف سے مکر ہے، اس کے حق میں اس امر پر قائم رہنے کی وجہ سے مکر کا نام زائل نہیں ہوتا۔ ورنہ اگر یہ دقیق فرق نہ ہوتا تو معاملہ برابر ہوتا۔ اور مکر الٰہی (المكر الإلهي) میں سے کچھ وہ ہے جس کا مقصد بندے کو نقصان پہنچانا ہوتا ہے، اور کچھ وہ ہے جس کا مقصد بندے کو نقصان پہنچانا نہیں ہوتا، بلکہ وہ کسی دوسری حکمت کے لیے ہوتا ہے جس میں بندے کی سعادت ہوتی ہے۔ کیونکہ اگر مکر خفی (پوشیدہ مکر) نہ ہوتا تو نہ تکلیف (شرعی ذمہ داری) صحیح ہوتی اور نہ ہی جزا کا مطالبہ۔ پس مکر الٰہی (مكر الله) میں سے جو مکر کیے جانے والے کے حق میں قابل تعریف ہے، وہ اللہ کا اسے اعمال کی تکلیف دینا، اور جو کچھ اس پر فرض کیا گیا ہے اس میں اس کی بات سننا اور اطاعت کرنا ہے۔ اور معاملہ بذات خود یہ ظاہر کرتا ہے کہ اعمال بندے میں اللہ کی تخلیق ہیں، اور اللہ خود کو تکلیف نہیں دیتا، اور عامل (عمل کرنے والا) اس کے سوا کوئی نہیں ہے۔ بعض لوگوں نے اس کا شعور (الشعور) حاصل کر لیا ہے اور وہ عمل پر قائم رہے اور اس پر ثابت قدم رہے، یعنی نیک اعمال پر۔\n\nاور اللہ کے مکر (مكر الله) میں سے یہ ہے کہ اس نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کیا، حالانکہ سب کچھ اسی کا ہے۔ پس جس نے اسے تقسیم کے ساتھ ادا کیا، اس نے اپنی نماز کو شفع (جفت) بنا دیا، اور جس نے اسے اس قول کے ساتھ ادا کیا کہ إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ (تمام معاملات اسی کی طرف لوٹائے جاتے ہیں)، اس نے اسے وتر (طاق) ادا کیا۔ پس نماز کو شفع ادا کرنے والا وہ ہے جو اپنی نماز میں خشوع اختیار کرتا ہے، اور جو اسے علم (العلم) کے ساتھ وتر ادا کرتا ہے، وہ بذات خود خشوع سے متصف نہیں ہوتا، اگرچہ اس کے ظاہر پر خشوع دکھائی دے، کیونکہ اس کا حکم اس عمل کے ظاہر ہونے کا حکم ہے جو اس سے صادر ہوا، اور اللہ ہی عامل ہے نہ کہ وہ (بندہ)۔ اللہ تعالیٰ نے فرمایا: وَاللَّهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ (اور اللہ نے تمہیں اور تمہارے اعمال کو پیدا کیا)۔\n\nاور وہ جو اللہ کے مکر (مكر الله) کو صرف اپنا مکر سمجھتے ہیں، وہ وہی ہیں جو يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ (اللہ کو دھوکہ دیتے ہیں حالانکہ وہ انہیں دھوکہ دینے والا ہے)، ان کے اسی اعتقاد کی بنا پر کہ وہ اللہ کو دھوکہ دے رہے ہیں۔ پس اللہ کو دھوکہ نہیں دیتا مگر یا تو وہ جو اللہ سے انتہائی جہالت رکھتا ہو، یا وہ جو اللہ کی ایسی معرفت (المعرفۃ) رکھتا ہو جو ممکن نہیں کہ کسی محدث (پیدا کی گئی شے) کے لیے اس سے زیادہ کامل ہو۔ جہاں تک اس میں جہالت کا تعلق ہے تو وہ معلوم ہے، اور جہاں تک اس میں معرفت (المعرفۃ) کا تعلق ہے تو وہ ایسا ہے جیسا کہ عمر رضی اللہ عنہ نے فرمایا: \"جس نے ہمیں اللہ کے معاملے میں دھوکہ دیا، ہم اس کے لیے دھوکہ کھا گئے۔\" اور اس کا فائدہ یہ ہے کہ وہ عارف (جاننے والا) دھوکہ دینے والے کے بارے میں جانتا ہے کہ وہ اسے دھوکہ دے رہا ہے، پس وہ اس کے لیے دھوکہ کھا لیتا ہے، لیکن اسے یہ نہیں بتاتا کہ وہ اس کے لیے دھوکہ کھا چکا ہے۔ اور یہ وہ شخص ہے جو خود کو احمق ظاہر کرتا ہے، جس کے بارے میں گمان کیا جاتا ہے کہ وہ بے وقوف ہے، حالانکہ وہ بے وقوف نہیں ہوتا۔\n\nپس جب عارف (جاننے والا) یہ جان لیتا ہے کہ اللہ کے سوا کوئی عطا کرنے والا اور کوئی قبول کرنے والا نہیں ہے، اس کے باوجود وہ اللہ کے مکر (مكر الله) سے پناہ مانگتا ہے، جیسا کہ رسول اللہ صلی اللہ علیہ وسلم نے اللہ سے اللہ کی پناہ مانگی، یہ اللہ کی مراد (ارادہ) کو جاری رکھنے کے لیے ہے۔ کیونکہ اللہ نے دنیا میں کوئی حکم نہیں رکھا مگر اس لیے کہ وہ کسی محکوم علیہ پر استعمال ہو، اور اگر وہ اس کے استعمال کا ارادہ نہ کرتا تو یہ عبث (بے مقصدیت) ہوتا۔ اور اگر کوئی ایسا نہ ہوتا جو اس حکم کو استعمال کرے اور جو اس پر عمل کرے تو یہ بھی عبث ہوتا۔ پس بصیرت کے ساتھ عمل کرنے والا اس شخص سے بہتر ہے جو بصیرت کے بغیر عمل کرتا ہے۔ لہٰذا الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ (وہ جو جانتے ہیں اور وہ جو نہیں جانتے) برابر نہیں ہو سکتے۔ اور بے شک اللہ نے اس شخص کے لیے، جو یہ گمان کرتا ہے کہ وہ اللہ کو دھوکہ دے رہا ہے، اس کے دھوکے اور مکر کو یہاں جاری رکھا ہے۔ پس یہ ایک گروہ کے حق میں اللہ کی طرف سے مکر (مكر الله) ہوتا ہے، اور دوسرے گروہ کے حق میں اللہ کی طرف سے عنایت (عناية) ہوتا ہے، جیسا کہ اس کا یہ قول: \"جو چاہو کرو، میں نے تمہیں بخش دیا\" یعنی میں نے تمہاری خاطر اپنے آپ کو تم سے چھپا لیا، پس جب میں کسی دوسرے کو اس پر پکڑتا ہوں تو تمہیں نہیں پکڑتا، کیونکہ تمہارے لیے میرے پاس پہلے سے عنایت موجود تھی۔ پس اس نے گناہ کے واقع ہونے سے پہلے ہی مغفرت (بخشِش) کو مقدم کر دیا، اور وہ اس کا قول ہے: \"وَمَا تَأَخَّرَ\" (اور جو بعد میں ہونے والا ہے)۔ پس گناہ مغفور (بخشا ہوا) آتا ہے، یعنی مستور (پوشیدہ)، یعنی اس کے اور اس شخص کے درمیان جس سے وہ واقع ہوتا ہے، ایک حجاب ہوتا ہے، پس اس پر اس کا حکم اس پردے کی وجہ سے اثر انداز نہیں ہوتا۔ اور اللہ نے مکر (المكر) کو تدریجی گرفت (الاستدراج) کا نام نہیں دیا مگر اس لیے کہ وہ مراتب میں ایک درجے سے دوسرے درجے کی طرف منتقل ہوتا ہے۔ اور اگر یہ انتقال نہ ہوتا تو اہل اللہ اس سے متصف نہ ہوتے، کیونکہ اس کے انتقال سے وہ مقامات اور مراتب کو عام کرتا ہے، اور وہ محمود (قابل تعریف) اور مذموم (قابل مذمت) کے درمیان ہیں۔ اور اگر ایسا نہ ہوتا تو اللہ خود کو مکر اور تدریجی گرفت (الاستدراج) سے متصف نہ کرتا۔ اسی لیے اہل اللہ بھی اس سے متصف ہوتے ہیں، پس وہ دھوکہ دیتے ہیں اور دھوکہ کھاتے ہیں۔\n\nایک خبر آئی ہے کہ قیامت کے دن اللہ بعض بندوں کو سوال کے لیے کھڑا کرے گا، تو وہ اس کے سامنے اعتراف کرے گا کہ اس نے وہ نیک عمل کیے جو اس نے نہیں کیے تھے، اور وہ اس میں جھوٹا ہوگا۔ تو اس کا رب اس کے لیے انجان بن جائے گا، یہاں تک کہ وہ کہنے والا یہ کہے گا کہ اللہ نے اس کے جھوٹ کو اپنے ہاں جاری رکھا۔ پس اللہ اسے جنت میں بھیجنے کا حکم دے گا۔ فرشتے کہیں گے: اے رب! اس نے جھوٹ بولا ہے۔ تو اللہ فرمائے گا: میں یہ جانتا تھا، لیکن مجھے اس کے سفید بالوں کو جھٹلانے سے حیا آئی۔\n\nپس یہ اللہ کی طرف سے اس کے لیے دھوکہ کھانا ہے۔ لہٰذا اہل اللہ (اہل الله) زیادہ حقدار ہیں کہ وہ اللہ کے بندوں سے درگزر کریں جب وہ ان کے ساتھ ایسا معاملہ کریں۔ اور ہم ان لوگوں میں سے ہیں جنہوں نے اس (مکر) کو کمال درجے تک متحقق کیا ہے، اور یہ اخلاق الٰہیہ (مكارم الأخلاق الإلهية) میں سب سے عظیم ہے۔ پس جو شخص دھوکہ کھانے پر قادر ہو اور دھوکہ دینے والے پر یہ ظاہر نہ کرے کہ اسے دھوکہ دیا گیا ہے، تو اس نے اپنے نفس پر کمال درجے کا قابو پا لیا۔ کیونکہ نفس کی فطرت یہ چاہتی ہے کہ اس کی نیکی کو جانا جائے، اور دھوکہ کھانے (الاغتبان) سے بڑھ کر کوئی نیکی نہیں۔ کیونکہ یہ درحقیقت قدرت کے باوجود حلم (بردباری) کے مترادف ہے۔ اور وہ (عارف) مجرم پر یہ ظاہر کرتا ہے کہ وہ اسے پکڑنے سے عاجز ہے، حالانکہ اس نے اسے حلم کی وجہ سے چھوڑا ہے نہ کہ عاجزی کی وجہ سے۔ اور یہ صرف اسی شخص سے صادر ہو سکتا ہے جس نے اپنی فطرت اور اپنے نفس پر قابو پا لیا ہو۔ اور اللہ ہی قوت والا، مضبوط ہے، اپنے حلم کے ساتھ اس کے لیے جو اسے جانتا ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب پانصد و شصتم در معرفت حال قطبی که منزل او [این آیات] بود: «و مکر کردند و خدا نیز مکر کرد و خدا بهترین مکرکنندگان است» [آل عمران: ۵۴] و «و مکر کردند مکری و ما نیز مکر کردیم در حالی که ایشان درک نمی‌کردند» [نمل: ۵۰]).\n\nهمانا خداوند در میان خلایق (مکر)ی دارد *** که از ایشان پنهان است و دانسته نمی‌شود\nو آن [مکر] از خود ایشان است و آن را نمی‌داند مگر *** کسی که نماز را شفع و وتر برپا دارد\nبا مناجات ذلت و فروتنی *** که پی در پی و متوالی بر او می‌آید\nو (شهود)ی که حقایق را در آن می‌بینی *** که چون خورشید و ماه بر او طلوع می‌کنند\nو (وجود)ی که کائنات را در آن می‌بینی *** که علم از آن پنهان و آشکارا می‌وزد.\n\n### [مکر الهی]\n\nخداوند عز جلاله فرمود: «به تدریج آنان را از جایی که نمی‌دانند [به سوی عذاب] می‌کشانیم» (سَنَسْتَدْرِجُهُمْ من حَيْثُ لا يَعْلَمُونَ) [اعراف: ۱۸۲] و فرمود: «و ما نیز مکر کردیم در حالی که ایشان درک نمی‌کردند» (ومَكَرْنا مَكْراً وهُمْ لا يَشْعُرُونَ) [نمل: ۵۰]. پس اگر کسی از مکر آگاه شود، دیگر مکر بودن آن از بین می‌رود، مگر در یک حالت. و آن هنگامی است که به مکر خداوند در امری که او را در آن برپا داشته و او بر آن امر پایداری کرده است، آگاه شود؛ و پایداری او بر آن امر، پس از علم به اینکه آن از مکر خداوند است، مکر از جانب خداست. مانند سخن او [خداوند]: «و او را با وجود علمش گمراه ساخت» (وأَضَلَّهُ الله عَلى‏ عِلْمٍ) [جاثیه: ۲۳]. با این مقدار، [مکر] از علم غیب جدا می‌شود؛ زیرا عالم غیب اگر آن را بداند، دیگر نزد او غیب نیست و نام غیب در حق او از آن زایل می‌شود. اما نام مکر در حق کسی که بر امری پایداری کرده که نمی‌دانسته مکر از جانب خداست، در پایداری او بر آن امر، زایل نمی‌شود. وگرنه، اگر این فرق دقیق نبود، مسئله یکسان می‌شد.\n\nبخشی از مکر الهی آن است که قصد ضرر رساندن به بنده‌ای در آن است، و بخشی از آن چیزی است که قصد ضرر رساندن به بنده‌ای در آن نیست، بلکه برای حکمتی دیگر است که سعادت بنده در آن است. زیرا اگر مکر خفی (پنهان) نبود، تکلیف و طلب جزا صحیح نمی‌شد. از مکر ستوده خداوند در حق کسی که مکر بر او واقع شده، این است که خداوند او را به اعمال و شنیدن و اطاعت از آنچه مکلف کرده، تکلیف نموده است. در حالی که امر در ذات خود اقتضا می‌کند که اعمال، خلق خداوند در بنده است و خداوند خود را مکلف نمی‌کند و عامل جز او نیست. این امر را برخی از مردم درک کرده‌اند و بر عمل پایداری کرده و بر آن مداومت ورزیده‌اند، منظورم عمل خیرات است.\n\nو از مکر خداوند، تقسیم نماز میان خود و بنده‌اش به دو نیم است، در حالی که همه آن از آنِ اوست. پس هر کس آن را با تقسیم ادا کند، نماز خود را شفع (جفت) ادا کرده است، و هر کس آن را با قول «همه امور به سوی او بازگردانده می‌شود» (إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ) [هود: ۱۲۳] ادا کند، آن را وتر (تک) ادا کرده است. پس کسی که نماز را شفع ادا می‌کند، در نماز خود خاشع است، و کسی که آن را وتر و بر اساس (معرفت/عرفان) ادا می‌کند، در ذات خود به خشوع متصف نیست، اگرچه در ظاهر او نمایان شود؛ زیرا آن [خشوع ظاهری] حکم عمل است که از او ظاهر می‌شود، در حالی که خداوند عامل است نه او. خداوند متعال فرمود: «و خداوند شما و آنچه عمل می‌کنید را آفرید» (والله خَلَقَكُمْ وما تَعْمَلُونَ) [صافات: ۹۶].\n\nاما کسی که مکر خداوند را چیزی جز مکر خودشان نمی‌بیند، آنان کسانی هستند که «با خدا مکر می‌کنند و او با آنان مکر می‌کند» (يُخادِعُونَ الله وهُوَ خادِعُهُمْ) [نساء: ۱۴۲]، به عین اعتقادشان که با خدا مکر می‌کنند. با خدا مکر نمی‌کند مگر جاهلی که نهایت جهل را نسبت به خدا دارد، یا عارفی که نهایت (معرفت/عرفان) را نسبت به خدا دارد، معرفتی که کامل‌تر از آن برای موجود ممکن نیست.\n\nاما جهل در این باره معلوم است، و اما (معرفت/عرفان) در این باره، همان است که عمر رضی الله عنه فرمود: «هر کس ما را در راه خدا فریب دهد، ما فریب او را می‌خوریم.» فایده این [سخن] آن است که عارف می‌داند که فریب‌دهنده او را فریب می‌دهد، پس فریب او را می‌خورد، اما به او نمی‌فهماند که فریب خورده است. و او همان کسی است که خود را به نادانی می‌زند (المتباله) که گمان می‌رود ابله است، در حالی که ابله نیست.\n\nپس هنگامی که عارف می‌داند که بخشنده و پذیرنده‌ای جز خداوند نیست، با این حال از مکر خداوند پناه می‌جوید، همان‌گونه که رسول الله (صَلَّى اللهُ عَليهِ وسَلَّم) از خدا به خدا پناه برد، تا مراد خدا یعنی اراده خدا را به جریان اندازد. زیرا خداوند هیچ حکمی را در عالم قرار نداد مگر برای اینکه در مورد محکوم‌علیه به کار رود، و اگر اراده به کارگیری آن را نداشت، عبث می‌بود. و اگر کسی که آن حکم در او به کار می‌رود و کسی که آن را اجرا می‌کند، یگانه نمی‌شد، باز هم عبث می‌بود. پس کسی که با بصیرت عمل می‌کند، سزاوارتر از کسی است که بدون بصیرت عمل می‌کند. «آنان که می‌دانند و آنان که نمی‌دانند برابر نیستند» (الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ) [زمر: ۹].\n\nو خداوند برای کسی که گمان می‌کند خدا را فریب می‌دهد، فریب و مکر او را در اینجا به جریان انداخته است. پس این [مکر] در حق گروهی از مکر خداوند با ایشان است، و در حق گروهی دیگر از عنایت خداوند به ایشان است. مانند سخن او [خداوند]: «هر چه می‌خواهی انجام بده، من تو را آمرزیدم.» یعنی: من به خاطر تو، خود را از تو پوشاندم، پس اگر دیگری را به خاطر آن مؤاخذه کنم، تو را مؤاخذه نمی‌کنم، به دلیل عنایتی که از پیش نزد من داشتی. پس آمرزش گناه را پیش از وقوع گناه مقدم داشت، و آن سخن اوست: «و آنچه تأخیر افتاده است» (وما تأخر) [فتح: ۲]. پس گناه آمرزیده شده می‌آید، یعنی پوشیده شده، یعنی حجابی میان آن و کسی که گناه از او سر می‌زند قرار می‌گیرد، پس حکم آن به خاطر آن پوشش در او تأثیر نمی‌کند.\n\nو خداوند مکر را (استدراج) نامید، مگر به دلیل انتقال آن در مراتب از درجه‌ای به درجه دیگر. و اگر این انتقال نبود، اهل الله به آن متصف نمی‌شدند، زیرا با انتقال آن، مقامات و مراتب را در بر می‌گیرد، که میان ستوده و نکوهیده هستند. و اگر این نبود، خداوند خود را به مکر و (استدراج) وصف نمی‌کرد. به همین دلیل، اهل الله به آن متصف می‌شوند، پس فریب می‌دهند و فریب می‌خورند.\n\nخبری وارد شده است که خداوند برخی از بندگان را در روز قیامت برای سؤال متوقف می‌سازد، پس او در برابر خداوند اعتراف می‌کند که اعمال خیری انجام داده که در واقع انجام نداده است، و در این باره دروغگوست. پروردگارش خود را نسبت به او به نادانی می‌زند تا آن گوینده بگوید که خداوند دروغی را که نزد او گفته است، به جریان انداخته است. پس خداوند فرمان می‌دهد که او را به بهشت ببرند. فرشتگان می‌گویند: پروردگارا، او دروغ گفت. خداوند می‌فرماید: من این را می‌دانستم، اما شرم داشتم که موی سپید او را تکذیب کنم.\n\nاین از فریب خوردن خداوند از اوست. پس اهل الله سزاوارترند که از بندگان خدا درگذرند، اگر با آنان چنین رفتاری داشته باشند. و ما از کسانی هستیم که به نهایت تحقق به این امر رسیده‌ایم، و این از بزرگترین مکارم اخلاق الهی است. پس کسی که می‌تواند فریب بخورد و به فریب‌دهنده نشان ندهد که فریب خورده است، به نهایت تمکن بر حکم نفس خود دست یافته است. زیرا طبع نفس می‌خواهد که خیر از آن شناخته شود، و هیچ خیری مانند فریب خوردن نیست، زیرا این نظیر حلم (بردباری) همراه با قدرت در نفس‌الامر است. و این [فریب خوردن] به جانی نشان می‌دهد که [عارف] از مؤاخذه او عاجز است، در حالی که مؤاخذه او را ترک نکرده مگر از روی حلم، نه عجز. و این [رفتار] صادر نمی‌شود مگر از کسی که بر حکم طبع و نفس خود قوی باشد. و خداوند صاحب نیروی استوار است، به حلمش نسبت به کسی که [او را] شناخته است. «و خداوند حق را می‌گوید و او راه را هدایت می‌کند» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ) [احزاب: ۴]."
  },
  "page_count": 2
}