{
  "id": 396,
  "title": {
    "ar": "الباب السادس والتسعون وثلاثمائة في معرفة منازلة من جمع المعارف والعلوم حجبته عني وهو من الحضرة المحمدية",
    "en": "Chapter Three Hundred and Ninety-Six: Concerning the Knowledge of the Station of him who combined Gnosis (المعارف) and Sciences (العلوم), which veiled him from me, and who belongs to the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "تین سو چھیانوےواں باب: اس شخص کے مقام کی معرفت کے بیان میں جس نے معارف اور علوم کو جمع کیا، جس نے اسے مجھ سے محجوب رکھا، اور وہ الحضرة المحمدية (الحضرة المحمدية) سے ہے۔",
    "fa": "باب سیصد و نود و ششم در معرفت منزلت کسی که معارف و علوم را جمع کرد، و آن (جمع) او را از من محجوب ساخت، و او از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب السادس والتسعون وثلاثمائة في معرفة منازلة من جمع المعارف والعلوم حجبته عني وهو من الحضرة المحمدية»\n\n\n> ألا إلى الله تصير الأمور *** ما أنت يا دنياي إلا غرور\n\n\n> أهل التقى لم يأمنوا كيدها *** مع التلقي فكيف أهل الفجور\n\n\n> لها صفات الحق في مكرها *** وما لنا في مكره من شعور\n\n\n> لو أنها تنصف في حالها *** كانت لهم نعم البشير النذير\n\n\n> من صدقها في حالها أنها *** أرت رحى الموت علينا تدور\n\n\n> وكان لي فيها وما عندها *** موعظة مذكرة للخبير\n\n\n> بها ينال العبد في كونها *** كمال نعت الحق يوم النشور\n\n\n> وهو على النصف إذا ما مضى *** عنها ومن يجحد هذا يجوز\n\n\n> ميزانها قام بها والذي *** يعلمه هو العليم القدير\n\n\n> كأحمد السبتي في الفعل إذ *** ملكه الله زمام الأمور\n\n\n> ما يظهر العبد بأسمائه *** إلا بها فهو المبين الغفور\n\n\n### [أن الله تعالى في نفسه وجل أن يعرفه عبده‏]\n\n\nاعلم أيدنا الله وإياك بروح القدس أن الله تعالى في نفسه وجل أن يعرفه عبده واستحال ذلك فلم يبقى لنا معلوم نطلبه إلا النسب خاصة أو أعيان الممكنات وما ينسب إليها فالمعرفة تتعلق بأعيان الذوات من الممكنات والعلوم تتعلق بما ينسب إليها فتعلم الذوات والأعيان بالضرورة من غير فكر ولا نظر بل النفس تدركها بما ركز الله فيها وتعلم النسب إليها وهو علم الإخبار عنها مما توصف به أو يحكم به عليها بالدليل النظري أو بالأخبار الاعتصامي بغير هذا لا يوصل إلى العلم بذلك والأحكام والأخبار غير متناهية الكثرة فتفرق الناظر فيها ولا يجمعها وأراد الحق من عباده أن يجمعهم عليه لا على تتبع هذه الكثرة حتى تعلم بل أباح لبعض عباده منها ما يتعلق العلم بها الذي يجمعه عليه وهو قوله في النظر في ذلك حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ فمن افترق في نفسه في جمع علوم لا ينظر فيها من حيث دلالتها على الحق حجبته عن موضع الدلالة التي فيها على الحق كعلوم الحساب والهندسة وعلوم الرياضات والمنطق والعلم الطبيعي فما منها علم إلا وفيه دلالة وطريق إلى العلم بالله ولكن أكثر الناس لا ينظر فيه من حيث طلبه ذلك الوجه الدال على الله فوقع الذم عليه والحجاب عن هذه الدلالة ثم إن بعض الناس إذا نبهه الله على طلب موضع الدلالة من كل معلوم على الله فإن الله تعالى يفرقه في المعلومات وإن كان مطلوبه دلالتها على الله فلا نشك أن جمعه لهذه المعلومات التي هي محل نظره حجاب عن الله أي عن الوجه الذي ينبغي أن يعلم منه ما في وسع القابل من الله وليس له طريق إلى ذلك إلا بأن يترك جميع المعلومات وجميع العالم من خاطره ويجلس فارغ القلب مع الله بحضور ومراقبة وسكينة وذكر إلهي بالاسم الله ذكر قلب ولا ينظر في دليل يوصله إلى علمه بالله فإذا لزم الباب وأد من القرع بالذكر وهذه هي الرحمة التي يؤتيه الله من عنده أعني توفيقه والهامة لما ذكرناه فتولى الحق تعليمه شهودا كما تولى أهل الله كالخضر وغيره فيعلمه من لدنه علما قال تعالى آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً من الوجه الخاص الذي بينه وبين الله وهو لكل مخلوق إذ يستحيل أن يكون للأسباب أثر في المسببات فإن ذلك لسان الظاهر كما قال في عيسى فَتَنْفُخُ فِيها فَتَكُونُ طَيْراً بِإِذْنِي لا ينفخك والنفخ سبب التكوين في الظاهر والتكوين ليس في الحقيقة إلا عن الأذن الإلهي وهذا وجه لا يطلع عليه من العبيد نبي مرسل ولا ملك مقرب من أحد وغاية العناية الإلهية بالشخص من ملك أو رسول أو ولي أن يوقفه الله من ذلك على الوجه الخاص به لا على وجه غيره كما\n\n\nقال الخضر لموسى عليه السلام أنا على علم علمنيه الله لا تعلمه أنت‏\n\n\nلأنه كان من الوجه‏\nالخاص الذي من الله لعبده لا يطلع على ذلك الوجه إلا صاحبه إذا اعتنى الله به وما من مخلوق إلا وله ذلك الوجه ويعلمه الله منه أمورا كثيرة ولكن لا يعرف بعض العبيد أنه أتاه ذلك العلم من ذلك الوجه وهو كل علم ضروري يجده لا يتقدم له فيه فكر ولا تدبر وصاحب العناية يعلم أن الله أعطاه ذلك العلم من ذلك الوجه‏\n\n\nثم قال له الخضر أيضا وأنت على علم علمكه الله لا أعلمه أنا\n\n\nفإن كان موسى قد علم وجهه الخاص عرف ما يأتيه العلم من ذلك الوجه وإن كان لم يعلم ذلك فقد نبهه الخضر عليه ليسأل الله فيه فإذا علم الأشياء كلها من ذلك الوجه فهو ملازم لتلك المشاهدة والشئون الإلهية والأشياء تتكون عن الله وهو ينظر إليها فلا تشغله مع كثرة ما يشاهد من الكائنات في العالم وهو مقام الصديق في قوله ما رأيت شيئا إلا رأيت الله قبله وذلك لما ذكرناه من شهوده صدور الأشياء عن الله بالتكوين فهو في شهود دائم والتكوينات تحدث فما من شي‏ء حادث يحدث عن الله إلا والله مشهود له قبل ذلك الحادث وما نبه أحد فيما وصل إلينا على هذا الوجه وما يتكون منه في قلب المعتكف على شهوده إلا أبو بكر الصديق ولكن نحن ما أخذناه من تنبيه أبي بكر الصديق عليه لكوننا ما فهمنا عنه ما أراد ولا فكرنا فيه وإنما اعتنى الله بنا فيه ففاجأنا العلم به ابتداء ولم نكن نعرفه فأنكرنا ذلك وقلنا هذا من أين ففتح الله بيننا وبينه ذلك الباب فعلمنا ما لنا من الحق على الخصوص وعرفنا إن هذا هو الوجه الخاص الذي من الله عز وجل لكل كائن عنه فلزمته واسترحت وعلامة من يدعيه لزوم الأدب الشرعي وإن وقعت منه معصية بالتقدير الإلهي الذي لا بد من نفوذه فإن كان يراها معصية ومخالفة للأمر المشروع فيعلم أنه من أهل هذا الوجه وإن كان يعتقد خلاف هذا فنعلم إن الله ما أطلعه قط على هذا الوجه الخاص ولا فتح له فيه وأنه شخص لا يعبأ الله به فإنه ما من أحد أعظم أدبا مع الشرع ولا اعتقادا حقيقيا فيه إنه الحق كما يعلمه العامي سواء إلا أهل هذا الوجه فإنهم يعلمون الأمور على ما هي عليه فيعلمون إن حظهم من هذا الأمر المشروع والتكليف وحظ الآتي به وهو الرسول وحظ العامة المخاطبين أيضا به على السواء لا فضل لأحدهم على الآخر فيه لأنه لذاته ورد لا لأمر آخر فالذي يحرم بالعموم في الخطاب المشروع على واحد يعم جميع المكلفين من غير اختصاص حتى لو قال بتحليل ذلك في حق شخص يتوجه عليه به لسان الذم في الظاهر كان كافرا عند الجميع وكان كاذبا في دعواه إنه من أهل هذا الوجه فإن أخص علوم هذا الوجه ما جاءت به الشرائع ولذلك‏\n\n\nقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لما خطب الناس في حق علي بن أبي طالب إذ قيل له إنه يخطب ابنة أبي جهل على ابنته فاطمة!!! فقال صَلَّى اللهُ عَليهِ وسَلَّم إن فاطمة بضعة مني يسوءني ما يسوءها ويسرني ما يسرها وأنه ليس لي تحريم ما أحل الله ولا تحليل ما حرم الله‏\n\n\nفمع معرفته بالوجه الخاص الإلهي لم يعطه إلا إبقاء ما هو محرم على تحريمه وما هو محلل على تحليله فما حرم على علي نكاح ابنة أبي جهل إذ كان حلالا له ذلك ولكنه قال إن أراد ذلك يطلق ابنتي فو الله ما تجتمع بنت عدو الله وبنت رسول الله صَلَّى اللهُ عَليهِ وسَلَّم تحت رجل واحد وأثنى على زوج ابنته الأخرى خيرا فرجع علي بن أبي طالب عن ذلك‏\n\n\nفلو كان ذلك الوجه يعطي ما يزعم هذا المجادل أنه أعطاه لكان رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أولى بذلك وما فعل وله الكشف الأتم والحكم الأعم والحظ الأوفر إذ هو السيد الأكبر ولا بد لكل شخص من خصوص وصف ينفرد به يعطيه الله ذلك من ذلك الوجه وبه يسعد الله في المال من يقال فيه إنه لا يسعد ولا تناله رحمة الله التي وَسِعَتْ كُلَّ شَيْ‏ءٍ فإنها صدرت من وجوه الاختصاص فعمت العالم والجاهل والطائع والعاصي جعلنا الله ممن نالته في أحواله كلها فيلقي الله ولم يجر عليه لسان ذنب بعد معرفته بهذا الوجه وأحكام المجتهدين وجميع الشرائع من هذا الوجه الخاص صدورها والتعبير للرؤيا بالقوة من غير نظر في كتاب ولا استدلال من هذا الوجه الخاص يكون فمن أراد تحصيله فليلزم ما قررناه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 396: Concerning the Knowledge of the Station of One Who Gathers Knowledges and Sciences, Which Veiled Him from Me, and Who Belongs to the Muhammadan Presence (الحضرة المحمدية)\n\nIndeed, to Allah all affairs return.\nO my world, you are nothing but delusion.\n\nThe people of piety (أهل التقى) did not feel safe from its cunning,\nEven with receiving (guidance); so how can the people of wickedness (أهل الفجور)?\n\nIt possesses the Attributes (صفات) of the Real (الحق) in its cunning,\nYet we have no awareness of its cunning.\n\nIf it were just in its state,\nIt would be for them an excellent bearer of good tidings and a warner.\n\nPart of its truthfulness in its state is that\nIt shows the millstone of death turning over us.\n\nAnd for me, in it and in what it possesses,\nThere was an admonition reminding the expert.\n\nThrough it, the servant attains in its existence\nThe perfection of the Attribute (نعت) of the Real (الحق) on the Day of Resurrection.\n\nAnd he is upon fairness when he passes\nAway from it; and whoever denies this is permitted (to do so).\n\nIts balance (ميزانها) is established by it, and the One\nWho knows it is the All-Knowing, the All-Powerful (العليم القدير).\n\nLike Ahmad al-Sabti in action, when\nAllah made him master of the reins of affairs.\n\nThe servant does not manifest by His Names (أسمائه)\nExcept through it; for He is the Manifest (المبين), the Forgiving (الغفور).\n\n[That Allah, Exalted is He, in His Essence (ذاته), is too Sublime for His servant to know Him]\n\nKnow, may Allah support us and you with the Holy Spirit (روح القدس), that Allah, Exalted is He, in His Essence (ذاته), is too sublime for His servant to know Him, and this is impossible. Thus, the only knowable things remaining for us to seek are the relations (النسب) specifically, or the entities of the contingent things (أعيان الممكنات) and what is related to them. Gnosis (المعرفة) relates to the essential entities (أعيان الذوات) of the contingent things, while the sciences (العلوم) relate to what is attributed to them. The essences and entities are known by necessity (بالضرورة), without reflection or speculation, but rather the soul perceives them through what Allah has implanted within it. The relations attributed to them are known—this is the knowledge of reporting about them, concerning what they are described by or what is judged upon them, either through theoretical proof (بالدليل النظري) or through authoritative transmission (بالأخبار الاعتصامي). Without this, one cannot attain knowledge of that. The judgments and reports are infinitely numerous, which disperses the seeker and prevents him from gathering them.\n\nThe Real (الحق) desired of His servants that He gather them upon Him, not upon the tracking of this multiplicity (الكثرة) until it is known. Rather, He permitted some of His servants to know only that part of it whose knowledge gathers them upon Him, which is His saying concerning reflection upon this: <<حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ>> (Until it becomes clear to them that He is the Truth/Real). Therefore, whoever is dispersed within himself by gathering sciences without looking at them from the perspective of their indication of the Real, those sciences veil him from the point of indication within them that points to the Real. This includes the sciences of calculation, geometry, mathematics, logic, and natural science. There is no science among them that does not contain an indication and a path to the knowledge of Allah, but most people do not look at it from the perspective of seeking that face which indicates Allah. Thus, blame falls upon him, and he is veiled from this indication.\n\nFurthermore, if Allah alerts some people to seek the point of indication of Allah in every piece of knowledge, even if his goal is their indication of Allah, Allah disperses him among the pieces of knowledge. We have no doubt that his gathering of these pieces of knowledge, which are the object of his contemplation, is a veil from Allah—that is, from the aspect (الوجه) from which knowledge of Allah should be derived, to the extent possible for the recipient. He has no path to this except by abandoning all pieces of knowledge and the entire world from his mind, and sitting with an empty heart (فارغ القلب) with Allah, in presence (بحضور), contemplation (مراقبة), tranquility (سكينة), and Divine remembrance (ذكر إلهي) using the Name Allah—a remembrance of the heart. He should not look for any proof that leads him to the knowledge of Allah. If he adheres to the door and persists in knocking through remembrance, this is the Mercy (الرحمة) that Allah grants him from Himself—meaning His Divine Aid (توفيقه) and inspiration (إلهامه) for what we have mentioned. Then the Real (الحق) takes charge of teaching him through witnessing (شهودا), just as He took charge of the People of Allah, like al-Khidr and others. He teaches him knowledge from His Presence (علما من لدنه). Allah, Exalted is He, said: <<آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً>> (We gave him mercy from Our presence and taught him knowledge from Our own presence).\n\nThis is from the Private Aspect (الوجه الخاص) that exists between him and Allah, and it exists for every creature, since it is impossible for causes (الأسباب) to have an effect on the effects (المسببات). That is merely the language of the apparent (لسان الظاهر), as He said concerning Jesus: <<فَتَنْفُخُ فِيها فَتَكُونُ طَيْراً بِإِذْنِي>> (Then you breathe into it, and it becomes a bird by My permission). It is not your breath (that creates). The breath is the cause of formation in the apparent sense, but in reality, formation is only through the Divine Permission (الإذن الإلهي). This is an aspect that neither a Messenger Prophet nor a near-stationed Angel among the servants can fully grasp. The utmost extent of Divine Providence (العناية الإلهية) for an individual, whether angel, messenger, or saint, is that Allah informs him of the aspect specific to him (الوجه الخاص به), not the aspect of another.\n\nAs al-Khidr said to Moses, peace be upon him: \"I possess a knowledge that Allah taught me, which you do not know.\" This is because it came from the Private Aspect (الوجه الخاص) that Allah grants to His servant, and no one is informed of that aspect except its possessor, when Allah grants him providence. There is no creature that does not possess that aspect, and Allah teaches him many things through it, but some servants do not recognize that this knowledge came to them from that aspect. This includes all necessary knowledge (علم ضروري) that one finds without prior reflection or deliberation. The person of providence (صاحب العناية) knows that Allah gave him that knowledge from that aspect.\n\nThen al-Khidr also said to him: \"And you possess a knowledge that Allah taught you, which I do not know.\" If Moses knew his Private Aspect, he would have recognized the source of the knowledge coming from that aspect. If he did not know it, al-Khidr alerted him to it so that he might ask Allah concerning it. When he knows all things from that aspect, he adheres to that witnessing (المشاهدة) and the Divine Affairs (الشئون الإلهية). Things are formed by Allah while he looks upon them, and the multiplicity of created things in the world does not distract him. This is the station of the Veracious (مقام الصديق), in his saying: \"I have not seen a thing except that I saw Allah before it.\" This is due to his witnessing the issuance of things from Allah through formation (التكوين). He is in perpetual witnessing, and the formations occur. There is no contingent thing that occurs from Allah except that Allah is witnessed by him before that contingent thing.\n\nNo one, to our knowledge, has drawn attention to this aspect and what is formed from it in the heart of the one devoted to witnessing (المعتكف) except Abu Bakr al-Siddiq. However, we did not derive it from the notification of Abu Bakr al-Siddiq, because we did not understand what he intended, nor did we reflect upon it. Rather, Allah granted us providence concerning it, and the knowledge surprised us initially (فاجأنا العلم به ابتداء). We did not know it, so we denied it and asked, \"Where is this from?\" Then Allah opened that door between us and Him, and we knew our specific right (ما لنا من الحق على الخصوص). We recognized that this is the Private Aspect (الوجه الخاص) that comes from Allah, Almighty and Majestic, for every existent thing. So I adhered to it and found rest. The sign of one who claims this is adherence to the Legal Etiquette (الأدب الشرعي), even if a sin (معصية) occurs from him by the Divine Decree (التقدير الإلهي) which must inevitably be executed. If he sees it as a sin and a violation of the prescribed command (الأمر المشروع), then he knows that he belongs to the people of this aspect. But if he believes otherwise, then we know that Allah has never informed him of this Private Aspect (الوجه الخاص) nor opened it for him, and that he is a person whom Allah does not regard. For there is no one who possesses greater etiquette toward the Law (الشرع) or a more genuine belief that it is the Truth—just as the common person knows it—than the people of this aspect. They know things as they truly are. They know that their share of this prescribed command and obligation (التكليف), the share of the one who brought it (the Messenger), and the share of the general public who are addressed by it, are all equal. None of them has superiority over the other in it, because it was revealed for its own sake, not for any other reason. That which is generally forbidden in the prescribed address to one person applies to all those obligated (المكلفين) without exception. If someone were to claim the permissibility (تحليل) of that for a specific person, the tongue of blame would be directed at him outwardly, and he would be considered a disbeliever (كافرا) by all, and a liar in his claim that he belongs to the people of this aspect. For the most specific knowledge of this aspect is what the Divine Laws (الشرائع) brought.\n\nFor this reason, the Messenger of Allah, peace and blessings be upon him, said when he addressed the people concerning Ali ibn Abi Talib, when it was said that Ali intended to propose to the daughter of Abu Jahl while married to his daughter Fatima: The Prophet, peace and blessings be upon him, said: \"Indeed, Fatima is a piece of me (بضعة مني); what displeases her displeases me, and what pleases her pleases me. And it is not for me to forbid what Allah has permitted, nor to permit what Allah has forbidden.\"\n\nDespite his knowledge of the Divine Private Aspect (الوجه الخاص الإلهي), it only granted him the preservation of what is forbidden as forbidden, and what is permitted as permitted. Thus, the marriage to the daughter of Abu Jahl was not forbidden to Ali, as it was lawful for him. However, the Prophet said that if Ali desired that, he must divorce his daughter, saying: \"By Allah, the daughter of the enemy of Allah and the daughter of the Messenger of Allah, peace and blessings be upon him, shall not be gathered under one man.\" And he praised the husband of his other daughter. So Ali ibn Abi Talib withdrew from that.\n\nIf that aspect granted what this disputant claims it grants, the Messenger of Allah, peace and blessings be upon him, would have been the most deserving of it, yet he did not do so. He possessed the Most Complete Unveiling (الكشف الأتم), the Most General Ruling (الحكم الأعم), and the Most Abundant Share (الحظ الأوفر), as he is the Greatest Master. Every person must have a specific quality (خصوص وصف) unique to him, which Allah grants him from that aspect. Through it, Allah grants happiness in the end to those who are said to be unhappy and unreachable by Allah's Mercy (رحمة الله) which <<وَسِعَتْ كُلَّ شَيْ‏ءٍ>> (encompasses everything). For this Mercy originated from the aspects of specialization (وجوه الاختصاص), thus encompassing the knowledgeable and the ignorant, the obedient and the disobedient. May Allah make us among those whom this Mercy reached in all their states, so that they meet Allah without the tongue of blame having been directed at them after their knowledge of this aspect. The rulings of the jurists (أحكام المجتهدين) and all the Divine Laws (الشرائع) originate from this Private Aspect (الوجه الخاص). The interpretation of dreams (التعبير للرؤيا) through inherent power, without consulting a book or relying on inference, also comes from this Private Aspect. Whoever desires to attain it should adhere to what we have established. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر تین سو چھیانوے (396): ان لوگوں کے مقامات کی معرفت میں جنہوں نے معارف اور علوم کو جمع کیا، مگر وہ (علوم) انہیں مجھ سے حجاب میں رکھتے ہیں، اور وہ (مقام) حضرت محمدیہ (الحضرۃ المحمدیۃ) سے ہے۔\n\nخبردار! تمام معاملات اللہ ہی کی طرف لوٹتے ہیں\nاے میری دنیا! تو فریب کے سوا کچھ نہیں\n\nمتقی لوگ بھی اس کی فریب کاری سے محفوظ نہ رہ سکے،\nباوجود اس کے کہ انہیں (ہدایت) ملی، تو پھر فاجر لوگ کیسے محفوظ رہ سکتے ہیں؟\n\nاس (دنیا) میں مکر کے معاملے میں الحق (الحق) کی صفات ہیں،\nاور ہمیں اس کے مکر کا کوئی شعور نہیں۔\n\nاگر یہ اپنے حال میں انصاف کرتی،\nتو یہ ان کے لیے بہترین بشارت دینے والی اور ڈرانے والی ہوتی۔\n\nاس کے حال کی سچائی یہ ہے کہ اس نے ہمیں دکھایا\nکہ موت کی چکی ہم پر گھوم رہی ہے۔\n\nاور میرے لیے اس میں اور اس کے پاس\nباخبر کے لیے یاد دہانی کرانے والی نصیحت تھی۔\n\nاس (دنیا) کے وجود میں بندہ قیامت کے دن\nالحق (الحق) کی صفت کا کمال حاصل کرتا ہے۔\n\nاور جب وہ اس سے گزر جاتا ہے تو وہ انصاف پر ہوتا ہے،\nاور جو اس کا انکار کرتا ہے وہ (حد سے) تجاوز کرتا ہے۔\n\nاس کا میزان اس کے ساتھ قائم ہے، اور جو اسے جانتا ہے\nوہ علیم و قدیر ہے۔\n\nجیسے احمد سبتی اپنے فعل میں، جب اللہ نے اسے\nمعاملات کی باگ ڈور سونپ دی۔\n\nبندہ اپنے اسماء کے ساتھ ظاہر نہیں ہوتا مگر اسی (دنیا) کے ذریعے،\nپس وہی (اللہ) مبین (ظاہر کرنے والا) اور غفور (بخشنے والا) ہے۔\n\n***\n\n### [کہ اللہ تعالیٰ اپنی ذات میں اس سے جلیل ہے کہ کوئی بندہ اسے پہچان سکے]\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس کے ذریعے تائید بخشے، کہ اللہ تعالیٰ اپنی ذات میں اس سے جلیل ہے کہ کوئی بندہ اسے پہچان سکے، اور یہ ناممکن ہے۔ پس ہمارے لیے کوئی معلوم چیز باقی نہیں رہتی جسے ہم طلب کریں، سوائے خاص نسبتوں کے، یا ممکنات (الممکنات) کے اعیان (ذوات) کے، اور ان چیزوں کے جو ان سے منسوب ہیں۔ پس المعرفۃ (المعرفۃ) کا تعلق ممکنات (الممکنات) کی ذوات کے اعیان سے ہے، اور علوم کا تعلق ان چیزوں سے ہے جو ان سے منسوب ہیں۔\n\nپس ذوات اور اعیان کا علم بالضرورہ حاصل ہوتا ہے، بغیر کسی فکر یا غور و خوض کے، بلکہ نفس انہیں اس چیز کے ذریعے ادراک کرتا ہے جو اللہ نے اس میں ودیعت کی ہے۔ اور ان سے منسوب نسبتوں کا علم، جو ان کے بارے میں خبر دینے کا علم ہے، ان اوصاف کے ذریعے جن سے وہ متصف ہوں، یا ان احکام کے ذریعے جو ان پر نظری دلیل یا اعتصامی خبر (قابل اعتماد روایت) کے ذریعے لگائے جائیں۔ اس کے بغیر اس علم تک رسائی نہیں ہو سکتی۔ اور احکام اور اخبار کی کثرت غیر متناہی ہے، جو ان پر غور کرنے والے کو منتشر کر دیتی ہے اور وہ انہیں جمع نہیں کر پاتا۔\n\nاور الحق (الحق) نے اپنے بندوں سے یہ ارادہ کیا کہ وہ انہیں اس (ذات حق) پر جمع کرے، نہ کہ اس کثرت کی پیروی پر تاکہ وہ معلوم ہو جائے۔ بلکہ اس نے اپنے بعض بندوں کے لیے ان میں سے وہ چیزیں مباح کر دیں جن کا علم اس سے متعلق ہے جو اسے (بندے کو) اس (ذات حق) پر جمع کرتا ہے، اور یہ اس کے بارے میں اس کا قول ہے:\n> حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ (یہاں تک کہ ان پر واضح ہو جائے کہ وہی الحق (الحق) ہے۔) [سورۃ فصلت: ۵۳]\n\nپس جو شخص اپنے نفس میں ایسے علوم جمع کرنے میں منتشر ہو جائے جن میں وہ اس پہلو سے غور نہ کرے کہ وہ الحق (الحق) پر دلالت کرتے ہیں، تو وہ (علوم) اسے اس مقام دلالت سے حجاب میں ڈال دیتے ہیں جو ان میں الحق (الحق) پر موجود ہے۔ جیسے حساب، ہندسہ، ریاضیات، منطق اور علم طبیعی (فزکس) کے علوم۔ ان میں سے کوئی علم ایسا نہیں مگر اس میں اللہ کے علم کی طرف دلالت اور راستہ موجود ہے، لیکن اکثر لوگ اس میں اس پہلو سے غور نہیں کرتے کہ وہ اللہ پر دلالت کرنے والے اس رخ کو طلب کریں، لہٰذا ان پر مذمت واقع ہوئی اور وہ اس دلالت سے حجاب میں رہ گئے۔\n\nپھر بعض لوگ ایسے ہیں کہ جب اللہ انہیں ہر معلوم چیز میں اللہ پر دلالت کے مقام کو طلب کرنے پر متنبہ کرتا ہے، تو اللہ تعالیٰ انہیں معلومات میں منتشر کر دیتا ہے، اگرچہ ان کا مطلوب ان معلومات کی اللہ پر دلالت ہی ہو۔ پس ہمیں کوئی شک نہیں کہ ان معلومات کا جمع کرنا جو ان کے غور و فکر کا مقام ہیں، اللہ سے حجاب ہے، یعنی اس رخ سے حجاب ہے جس سے اللہ کی طرف سے وہ چیز معلوم ہونی چاہیے جو قبول کرنے والے کی وسعت میں ہے۔\n\nاور اس کے لیے اس کا کوئی راستہ نہیں مگر یہ کہ وہ تمام معلومات اور تمام عالم کو اپنے دل سے نکال دے، اور حضور، مراقبہ، سکینہ (اطمینان) اور اسم اللہ کے ساتھ قلبی ذکر کے ذریعے فارغ القلب ہو کر اللہ کے ساتھ بیٹھے۔ اور وہ کسی ایسی دلیل میں غور نہ کرے جو اسے اللہ کے علم تک پہنچائے۔ پس جب وہ دروازے پر قائم رہے گا اور ذکر کے ذریعے دستک دیتا رہے گا، تو یہی وہ رحمت ہے جو اللہ اسے اپنے پاس سے عطا کرتا ہے، یعنی اس کی توفیق اور اس چیز کا الہام جو ہم نے ذکر کی۔ پس الحق (الحق) خود اس کی تعلیم کا ذمہ دار ہو جاتا ہے، بطور شہود (الشہود)، جیسا کہ اللہ والوں جیسے خضر اور دیگر کی تعلیم کا ذمہ دار ہوا، اور اسے اپنے لدُن سے علم سکھاتا ہے۔ اللہ تعالیٰ نے فرمایا:\n> آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً (ہم نے اسے اپنی طرف سے رحمت عطا کی اور اسے اپنے پاس سے علم سکھایا۔) [سورۃ الکہف: ۶۵]\n\nیہ اس خاص رخ سے ہوتا ہے جو اس (بندے) اور اللہ کے درمیان ہے، اور یہ ہر مخلوق کے لیے ہے، کیونکہ یہ ناممکن ہے کہ اسباب کا مسببات میں کوئی اثر ہو، کیونکہ یہ صرف ظاہر کی زبان ہے۔ جیسا کہ عیسیٰ علیہ السلام کے بارے میں فرمایا:\n> فَتَنْفُخُ فِيها فَتَكُونُ طَيْراً بِإِذْنِي (پس تو اس میں پھونکتا ہے تو وہ میرے حکم سے پرندہ بن جاتا ہے۔) [سورۃ المائدہ: ۱۱۰]\nوہ تجھے نہیں پھونکتا۔ اور پھونکنا ظاہر میں تخلیق کا سبب ہے، جبکہ حقیقت میں تخلیق صرف اذنِ الٰہی سے ہوتی ہے۔\n\nاور یہ وہ رخ ہے جس پر بندوں میں سے کوئی نبی مرسل اور نہ کوئی مقرب فرشتہ مطلع ہوتا ہے۔ اور کسی شخص، خواہ وہ فرشتہ ہو، رسول ہو یا ولی، کے ساتھ عنایت الٰہی کی انتہا یہ ہے کہ اللہ اسے اس میں سے صرف اس کے خاص رخ پر مطلع کرے، نہ کہ کسی دوسرے کے رخ پر۔ جیسا کہ خضر علیہ السلام نے موسیٰ علیہ السلام سے کہا: \"میں ایک ایسے علم پر ہوں جو اللہ نے مجھے سکھایا ہے، جسے تم نہیں جانتے۔\" کیونکہ یہ اس خاص رخ سے تھا جو اللہ کی طرف سے اس کے بندے کے لیے ہوتا ہے، اور اس رخ پر اس کا مالک ہی مطلع ہوتا ہے جب اللہ اس پر عنایت فرماتا ہے۔\n\nاور کوئی مخلوق ایسی نہیں مگر اس کے لیے وہ رخ موجود ہے، اور اللہ اسے اس رخ سے بہت سے امور سکھاتا ہے، لیکن بعض بندے یہ نہیں جانتے کہ یہ علم انہیں اسی رخ سے ملا ہے۔ اور یہ ہر وہ علم ضروری ہے جو اسے حاصل ہوتا ہے، جس میں اس سے پہلے کوئی فکر یا تدبر شامل نہیں ہوتا۔ اور صاحبِ عنایت جانتا ہے کہ اللہ نے اسے وہ علم اسی رخ سے عطا کیا ہے۔\n\nپھر خضر نے ان سے یہ بھی کہا: \"اور تم ایک ایسے علم پر ہو جو اللہ نے تمہیں سکھایا ہے، جسے میں نہیں جانتا۔\" پس اگر موسیٰ علیہ السلام اپنے خاص رخ کو جانتے تھے تو وہ پہچان گئے کہ علم انہیں اسی رخ سے آتا ہے، اور اگر وہ نہیں جانتے تھے تو خضر نے انہیں اس پر متنبہ کیا تاکہ وہ اللہ سے اس کے بارے میں سوال کریں۔\n\nپس جب وہ تمام چیزوں کو اسی رخ سے جان لیتا ہے، تو وہ اس مشاہدہ (الشہود) اور شؤونِ الٰہیہ (الٰہی معاملات) کا پابند ہو جاتا ہے، اور چیزیں اللہ کی طرف سے وجود میں آتی ہیں اور وہ انہیں دیکھتا ہے، لہٰذا عالم میں کائنات کی کثرت کے باوجود وہ اسے مشغول نہیں کرتی۔ اور یہ صدیق کا مقام ہے ان کے اس قول میں کہ: \"میں نے کوئی چیز نہیں دیکھی مگر اس سے پہلے اللہ کو دیکھا۔\" اور یہ اس وجہ سے ہے جو ہم نے ذکر کیا کہ وہ اشیاء کے اللہ کی طرف سے تکوین (وجود میں آنے) کا شہود (الشہود) کرتا ہے، پس وہ دائمی شہود (الشہود) میں ہوتا ہے اور تکوینیات واقع ہوتی رہتی ہیں، پس اللہ کی طرف سے کوئی حادث چیز واقع نہیں ہوتی مگر اللہ اس حادث سے پہلے اس کے لیے مشہود ہوتا ہے۔\n\nاور جہاں تک ہمیں معلوم ہے، کسی نے بھی اس رخ پر اور اس چیز پر جو اس سے شہود (الشہود) پر اعتکاف کرنے والے کے دل میں پیدا ہوتی ہے، ابوبکر صدیق کے سوا کسی نے متنبہ نہیں کیا۔ لیکن ہم نے اسے ابوبکر صدیق کے تنبیہ سے حاصل نہیں کیا، کیونکہ ہم ان کی مراد کو سمجھ نہیں پائے اور نہ ہی ہم نے اس پر غور کیا۔ بلکہ اللہ نے اس میں ہم پر عنایت فرمائی، پس یہ علم ہمیں اچانک ابتدائی طور پر ملا، اور ہم اسے نہیں جانتے تھے، تو ہم نے اس کا انکار کیا اور کہا کہ یہ کہاں سے آیا؟ پس اللہ نے ہمارے اور اس کے درمیان وہ دروازہ کھول دیا، تو ہم نے خاص طور پر اپنے لیے الحق (الحق) کو جانا، اور پہچانا کہ یہ وہی خاص رخ ہے جو اللہ عزوجل کی طرف سے ہر اس چیز کے لیے ہے جو اس سے وجود میں آتی ہے۔ پس میں اس پر قائم رہا اور مجھے راحت ملی۔\n\nاور جو شخص اس کا دعویٰ کرتا ہے اس کی علامت شرعی ادب کی پابندی ہے۔ اور اگر اس سے کوئی معصیت واقع ہو جائے، اس تقدیر الٰہی کے تحت جس کا نفاذ ضروری ہے، تو اگر وہ اسے معصیت اور امر مشروع کی خلاف ورزی سمجھتا ہے، تو وہ جان لے کہ وہ اس رخ کے اہل میں سے ہے۔ اور اگر وہ اس کے برعکس اعتقاد رکھتا ہے، تو ہم جانتے ہیں کہ اللہ نے اسے کبھی بھی اس خاص رخ پر مطلع نہیں کیا اور نہ ہی اس کے لیے اس میں کوئی کشف (الکشف) کھولا، اور وہ ایسا شخص ہے جسے اللہ کوئی اہمیت نہیں دیتا۔\n\nکیونکہ اس رخ کے اہل کے سوا کوئی بھی شرع کے ساتھ زیادہ ادب والا نہیں، اور نہ ہی اس میں حقیقی اعتقاد رکھنے والا ہے کہ یہ الحق (الحق) ہے، جیسا کہ ایک عام آدمی اسے جانتا ہے۔ کیونکہ وہ امور کو ان کی حقیقت کے مطابق جانتے ہیں، پس وہ جانتے ہیں کہ اس امر مشروع اور تکلیف میں ان کا حصہ، اور اسے لانے والے یعنی رسول کا حصہ، اور عام مخاطبین کا حصہ بھی برابر ہے، ان میں سے کسی کو دوسرے پر کوئی فضیلت نہیں، کیونکہ یہ (شرع) اپنی ذات کے لیے وارد ہوئی ہے نہ کہ کسی دوسرے امر کے لیے۔ پس جو چیز شرعی خطاب میں عموم کے ساتھ ایک شخص پر حرام کی گئی ہے، وہ تمام مکلفین کو بغیر کسی تخصیص کے شامل ہے، یہاں تک کہ اگر کوئی شخص کسی کے حق میں اس کی حلت کا قائل ہو جائے، تو ظاہر میں اس پر مذمت کی زبان متوجہ ہو گی، وہ سب کے نزدیک کافر ہو گا، اور اپنے اس دعوے میں جھوٹا ہو گا کہ وہ اس رخ کے اہل میں سے ہے۔\n\nاور اسی لیے رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے لوگوں کو علی بن ابی طالب کے حق میں خطبہ دیا، جب آپ کو بتایا گیا کہ وہ اپنی بیٹی فاطمہ کے ہوتے ہوئے ابو جہل کی بیٹی سے نکاح کا پیغام دے رہے ہیں!!! تو آپ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا:\n> إن فاطمة بضعة مني يسوءني ما يسوءها ويسرني ما يسرها وأنه ليس لي تحريم ما أحل الله ولا تحليل ما حرم الله (بے شک فاطمہ میرے جسم کا ٹکڑا ہے، جو چیز اسے ناگوار گزرتی ہے وہ مجھے بھی ناگوار گزرتی ہے، اور جو چیز اسے خوش کرتی ہے وہ مجھے بھی خوش کرتی ہے، اور میرے لیے یہ اختیار نہیں کہ میں اس چیز کو حرام کر دوں جسے اللہ نے حلال کیا ہے، اور نہ ہی اس چیز کو حلال کر دوں جسے اللہ نے حرام کیا ہے۔) [حدیث]\n\nپس اللہ کے خاص رخ کی معرفت کے باوجود، اس نے آپ کو صرف یہی دیا کہ جو چیز حرام ہے اسے اس کی حرمت پر باقی رکھا جائے اور جو حلال ہے اسے اس کی حلت پر باقی رکھا جائے۔ پس علی پر ابو جہل کی بیٹی سے نکاح حرام نہیں ہوا، کیونکہ وہ ان کے لیے حلال تھا، لیکن آپ نے فرمایا کہ اگر وہ ایسا چاہتے ہیں تو میری بیٹی کو طلاق دے دیں، پس اللہ کی قسم! اللہ کے دشمن کی بیٹی اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم کی بیٹی ایک شخص کے نکاح میں جمع نہیں ہو سکتیں۔ اور آپ نے اپنی دوسری بیٹی کے شوہر کی تعریف کی، تو علی بن ابی طالب اس ارادے سے باز آ گئے۔\n\nپس اگر وہ رخ وہ چیز عطا کرتا جس کا یہ جھگڑالو دعویٰ کرتا ہے کہ اسے عطا کی گئی ہے، تو رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم اس کے زیادہ حقدار ہوتے، مگر آپ نے ایسا نہیں کیا۔ حالانکہ آپ کو کامل ترین کشف (الکشف)، عام ترین حکم اور سب سے زیادہ حصہ حاصل تھا، کیونکہ آپ سید الاکبر (سب سے بڑے سردار) ہیں۔\n\nاور ہر شخص کے لیے ایک خاص وصف کا ہونا ضروری ہے جس میں وہ منفرد ہو، اللہ اسے وہ وصف اسی رخ سے عطا کرتا ہے، اور اسی کے ذریعے اللہ آخرت میں اسے سعادت بخشتا ہے جس کے بارے میں کہا جاتا ہے کہ وہ سعادت مند نہیں ہو گا اور اسے اللہ کی وہ رحمت نہیں ملے گی جو\n> وَسِعَتْ كُلَّ شَيْ‏ءٍ (ہر چیز پر محیط ہے۔) [سورۃ الاعراف: ۱۵۶]\nکیونکہ یہ (رحمت) اختصاص کے وجوہ سے صادر ہوئی، پس اس نے عالم، جاہل، فرمانبردار اور نافرمان سب کو شامل کر لیا۔\n\nاللہ ہمیں ان لوگوں میں شامل کرے جسے یہ رحمت اس کے تمام احوال میں حاصل ہوئی، تاکہ وہ اللہ سے ملاقات کرے اور اس رخ کی معرفت کے بعد اس پر گناہ کی زبان جاری نہ ہو۔ اور مجتہدین کے احکام اور تمام شرائع کا صدور اسی خاص رخ سے ہوتا ہے، اور خوابوں کی تعبیر کا قوت کے ساتھ، بغیر کسی کتاب میں دیکھے یا استدلال کیے، اسی خاص رخ سے ہوتا ہے۔ پس جو شخص اسے حاصل کرنا چاہے، وہ اس چیز کو لازم پکڑے جو ہم نے مقرر کی ہے، اور\n> وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے۔) [سورۃ الاحزاب: ۴]",
    "fa": "باب سیصد و نود و ششم: در معرفت منزلت کسی که معارف و علوم را جمع کرده، اما [این جمع‌آوری] او را از من محجوب ساخته است، در حالی که او از حضرت محمدیه (الحضرة المحمدیة) است.\n\nآگاه باشید که امور به سوی خداوند بازمی‌گردد *** ای دنیای من، تو جز فریب نیستی\nاهل تقوا با وجود دریافت [الهی] از مکر آن ایمن نبودند *** پس اهل فجور چگونه خواهند بود؟\nدنیا در مکر خود صفات حق (الحق) را دارد *** و ما را در مکر او هیچ شعوری نیست\nاگر دنیا در حال خود انصاف می‌ورزید *** برای آنان چه نیکو بشارت‌دهنده و بیم‌دهنده‌ای بود\nاز صدق دنیا در حالش این است که *** آسیاب مرگ را بر ما در حال چرخش نشان داد\nو برای من در آن و آنچه نزد آن است *** موعظه‌ای است که خبیر را به یاد می‌آورد\nبنده در هستی (الوجود) آن، کمال وصف حق (الحق) را *** در روز رستاخیز (النشور) به دست می‌آورد\nو او بر انصاف است هنگامی که از آن بگذرد *** و هر که این را انکار کند، [از حق] دور می‌شود\nترازوی آن به واسطه آن برپا شده است *** و کسی که آن را می‌داند، اوست دانای توانا (العلیم القدیر)\nمانند احمد سبتی در عمل، آنگاه که *** خداوند زمام امور را به او سپرد\nبنده با اسماء خود آشکار نمی‌شود *** مگر به واسطه آن [دنیا]، پس اوست آشکارکننده و آمرزنده (المبین الغفور)\n\n### اینکه خداوند متعال در ذات خود والاتر از آن است که بنده‌اش او را بشناسد\n\nبدان، خداوند ما و تو را به روح القدس تأیید کند، که خداوند متعال در ذات خود والاتر از آن است که بنده‌اش او را بشناسد و این امر محال است. بنابراین، برای ما معلومی که در پی آن باشیم باقی نمی‌ماند مگر نسبت‌ها به طور خاص، یا اعیان ممکنات و آنچه به آنها نسبت داده می‌شود. پس معرفت (المعرفة) به اعیان ذوات ممکنات تعلق می‌گیرد و علوم به آنچه به آنها نسبت داده می‌شود. ذوات و اعیان به ضرورت و بدون فکر و نظر آموخته می‌شوند، بلکه نفس آنها را با آنچه خداوند در آن نهاده است درک می‌کند. و نسبت‌های مربوط به آنها آموخته می‌شود، که همان علم خبر دادن از آنهاست، از آنچه بدان وصف می‌شوند یا با دلیل نظری یا اخبار اعتصامی (مستند) بر آنها حکم می‌شود. بدون این [روش‌ها]، دستیابی به علم به آن ممکن نیست.\n\nو احکام و اخبار کثرتی نامتناهی دارند که نظرکننده در آنها را متفرق می‌سازد و او را جمع نمی‌کند. حق (الحق) از بندگانش خواسته است که آنها را بر خود جمع کند، نه بر پیگیری این کثرت تا آموخته شود. بلکه برای برخی از بندگانش از آن [کثرت]، آنچه را که علم به آن تعلق می‌گیرد و او را بر حق (الحق) جمع می‌کند، مباح ساخته است، و آن قول اوست در نظر کردن در آن: **«تا برایشان روشن شود که او حق است»** (حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ).\n\nپس هر کس که در جمع‌آوری علومی که در آنها از حیث دلالتشان بر حق (الحق) نظر نمی‌کند، در نفس خود متفرق شود، آن علوم او را از موضع دلالتی که در آنها بر حق (الحق) وجود دارد، محجوب می‌سازد؛ مانند علوم حساب، هندسه، علوم ریاضیات، منطق و علم طبیعی. هیچ علمی از آنها نیست مگر اینکه در آن دلالت و راهی به سوی علم به خداوند وجود دارد، اما بیشتر مردم در آن از حیث طلب آن وجه دال بر خداوند نظر نمی‌کنند، پس مذمت بر او واقع می‌شود و از این دلالت محجوب می‌گردد.\n\nسپس اگر خداوند برخی از مردم را بر طلب موضع دلالت بر خداوند در هر معلومی آگاه سازد، خداوند متعال او را در معلومات متفرق می‌سازد، اگرچه مطلوب او دلالت آن معلومات بر خداوند باشد. پس شک نداریم که جمع‌آوری این معلومات که محل نظر اوست، حجابی از خداوند است؛ یعنی از آن وجهی که شایسته است از آن، آنچه در وسع قابل از خداوند است، دانسته شود. و راهی برای او به سوی این [معرفت] نیست مگر اینکه تمام معلومات و تمام عالم را از خاطر خود رها کند و با قلبی فارغ، با حضور، مراقبه، سکینه و ذکر الهی با اسم «الله» (ذکر قلبی) با خداوند بنشیند. و در دلیلی که او را به علم به خداوند برساند، نظر نکند. پس هنگامی که ملازم این درگاه شد و بر کوبیدن [در] با ذکر مداومت ورزید، این همان رحمتی است که خداوند از نزد خود به او می‌دهد؛ منظورم توفیق و الهام او برای آنچه ذکر کردیم است.\n\nپس حق (الحق) تعلیم او را به صورت شهودی (الشهود) بر عهده می‌گیرد، همان‌گونه که تعلیم اهل الله مانند خضر و دیگران را بر عهده گرفت، و از نزد خود به او علمی می‌آموزد. خداوند متعال می‌فرماید: **«به او رحمتی از جانب خود دادیم و از نزد خود به او علمی آموختیم»** (آتَيْناهُ رَحْمَةً من عِنْدِنا وعَلَّمْناهُ من لَدُنَّا عِلْماً). [این علم] از وجه خاصی است که میان او و خداوند است، و این وجه برای هر مخلوقی وجود دارد، زیرا محال است که اسباب در مسببات تأثیری داشته باشند؛ چرا که آن [تأثیر اسباب] زبان ظاهر است، چنانکه در مورد عیسی فرمود: **«پس در آن می‌دمی و به اذن من پرنده می‌شود»** (فَتَنْفُخُ فِيها فَتَكُونُ طَيْراً بِإِذْنِي). [خداوند] به تو نمی‌دمد. و دمیدن در ظاهر سبب تکوین است، در حالی که تکوین در حقیقت جز به اذن الهی نیست. و این وجهی است که هیچ پیامبر مرسلی و هیچ فرشته مقربی از بندگان بر آن آگاه نمی‌شود.\n\nو نهایت عنایت الهی به شخص، چه فرشته باشد، چه رسول یا ولی، این است که خداوند او را از آن [وجه] بر وجه خاص خودش آگاه سازد، نه بر وجه دیگری. چنانکه خضر به موسی (علیه السلام) گفت: **«من بر علمی هستم که خداوند به من آموخته و تو آن را نمی‌دانی»**. زیرا آن [علم] از وجه خاصی بود که خداوند به بنده‌اش عطا کرده است، و جز صاحب آن، هنگامی که خداوند به او عنایت کند، بر آن وجه آگاه نمی‌شود. و هیچ مخلوقی نیست مگر اینکه آن وجه را دارد و خداوند از آن طریق امور بسیاری را به او می‌آموزد، اما برخی از بندگان نمی‌دانند که آن علم از آن وجه به آنها رسیده است. و آن [علم] هر علم ضروری است که آن را می‌یابد و هیچ فکر و تدبری در آن پیشی نگرفته است. و صاحب عنایت می‌داند که خداوند آن علم را از آن وجه به او عطا کرده است.\n\nسپس خضر همچنین به او گفت: **«و تو بر علمی هستی که خداوند به تو آموخته و من آن را نمی‌دانم»**. پس اگر موسی وجه خاص خود را می‌دانست، می‌فهمید که علم از آن وجه به او می‌رسد، و اگر آن را نمی‌دانست، خضر او را بر آن آگاه ساخت تا در مورد آن از خداوند سؤال کند. پس هنگامی که همه چیز را از آن وجه دانست، ملازم آن مشاهده و شئون الهی است. و اشیاء از خداوند تکوین می‌یابند و او به آنها می‌نگرد، پس با وجود کثرت آنچه از کائنات در عالم مشاهده می‌کند، او را مشغول نمی‌سازد.\n\nو این مقام صدیق (ابوبکر) است در قولش: «چیزی را ندیدم مگر اینکه خداوند را پیش از آن دیدم». و این به دلیل همان شهود (الشهود) اوست که صدور اشیاء از خداوند به واسطه تکوین را مشاهده می‌کند، پس او در شهود (الشهود) دائمی است. و تکوین‌ها رخ می‌دهند، پس هیچ شیء حادثی نیست که از خداوند رخ دهد، مگر اینکه خداوند پیش از آن حادث برای او مشهود است. و در آنچه به ما رسیده است، هیچ کس بر این وجه و آنچه از آن در قلب معتکف بر شهود (الشهود) آن تکوین می‌یابد، آگاه نساخته است، مگر ابوبکر صدیق.\n\nاما ما آن را از تنبیه ابوبکر صدیق نگرفتیم، زیرا آنچه او اراده کرده بود را نفهمیدیم و در آن فکر نکردیم، بلکه خداوند در مورد آن به ما عنایت کرد و علم به آن به صورت ناگهانی و ابتدایی به ما رسید و ما آن را نمی‌شناختیم، پس آن را انکار کردیم و گفتیم این از کجاست؟ پس خداوند آن در را میان ما و او گشود و ما آنچه را که به طور خاص از حق (الحق) برای ماست دانستیم و شناختیم که این همان وجه خاصی است که خداوند عزوجل برای هر موجودی از آن طریق عطا می‌کند. پس ملازم آن شدم و آسوده گشتم.\n\nو نشانه کسی که مدعی آن است، ملازمت ادب شرعی است. و اگر به تقدیر الهی که ناگزیر از نفوذ است، معصیتی از او سر زد، اگر آن را معصیت و مخالفت با امر مشروع ببیند، می‌داند که از اهل این وجه است. و اگر خلاف این را اعتقاد داشته باشد، می‌دانیم که خداوند هرگز او را بر این وجه خاص آگاه نساخته و دری برای او در آن نگشوده است، و او شخصی است که خداوند به او اعتنایی ندارد. زیرا هیچ کس در ادب با شرع و اعتقاد حقیقی به اینکه شرع حق (الحق) است، مانند آنچه عامی می‌داند، بزرگتر نیست، مگر اهل این وجه. زیرا آنان امور را بر همان‌گونه که هستند می‌دانند، پس می‌دانند که بهره آنها از این امر مشروع و تکلیف، و بهره آورنده آن که رسول است، و بهره عموم مخاطبان نیز در آن یکسان است و هیچ یک بر دیگری فضیلتی ندارد، زیرا [شرع] به خاطر ذات خود وارد شده است نه به خاطر امر دیگری.\n\nپس آنچه به طور عمومی در خطاب مشروع بر یک نفر حرام می‌شود، شامل همه مکلفین بدون اختصاص می‌گردد. حتی اگر کسی به حلال بودن آن در حق شخصی حکم کند، زبان مذمت در ظاهر متوجه او می‌شود و نزد همگان کافر خواهد بود و در ادعای خود مبنی بر اینکه از اهل این وجه است، دروغگوست. زیرا خاص‌ترین علوم این وجه، همان چیزی است که شرایع آورده‌اند. و به همین دلیل، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که در مورد علی بن ابی طالب (رضی الله عنه) برای مردم خطبه می‌خواند، زمانی که به او گفته شد که علی می‌خواهد دختر ابی جهل را بر دخترش فاطمه خواستگاری کند، فرمود:\n\nرسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: **«فاطمه پاره تن من است، آنچه او را ناراحت کند مرا ناراحت می‌کند و آنچه او را شاد کند مرا شاد می‌کند. و من حق ندارم آنچه را خداوند حلال کرده، حرام کنم و آنچه را حرام کرده، حلال سازم»**.\n\nپس با وجود معرفت او به وجه خاص الهی، این وجه به او جز ابقای آنچه حرام است بر حرمتش و آنچه حلال است بر حلیتش، نداد. پس ازدواج با دختر ابی جهل بر علی حرام نشد، زیرا این کار برای او حلال بود، اما [پیامبر] فرمود: اگر او این را می‌خواهد، باید دخترم را طلاق دهد. **«به خدا سوگند، دختر دشمن خدا و دختر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) زیر [سقف] یک مرد جمع نمی‌شوند»**. و بر داماد دیگرش ثنای خیر گفت. پس علی بن ابی طالب از آن [تصمیم] بازگشت.\n\nپس اگر آن وجه چیزی را می‌داد که این مجادله‌گر گمان می‌کند به او داده است، رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) به آن سزاوارتر بود، در حالی که چنین نکرد. و او دارای کامل‌ترین کشف (الکشف)، فراگیرترین حکم و بیشترین بهره بود، زیرا او سید اکبر است. و برای هر شخصی ناگزیر وصف خاصی وجود دارد که به آن منفرد است و خداوند آن را از آن وجه به او عطا می‌کند. و به واسطه آن، خداوند در نهایت کار، کسی را سعادتمند می‌سازد که درباره‌اش گفته می‌شود سعادتمند نمی‌شود و رحمت خداوند که **«همه چیز را فرا گرفته است»** (وَسِعَتْ كُلَّ شَيْ‏ءٍ) به او نمی‌رسد. زیرا آن [رحمت] از وجوه اختصاص صادر شده و عالم و جاهل، مطیع و عاصی را فرا گرفته است. خداوند ما را از کسانی قرار دهد که در تمام احوالشان به آن دست یافته‌اند، پس خداوند را ملاقات کنند در حالی که پس از معرفت به این وجه، زبان گناهی بر آنان جاری نشده باشد.\n\nو احکام مجتهدین و تمامی شرایع، صدورشان از این وجه خاص است. و تعبیر رؤیا با قدرت، بدون نظر در کتاب و بدون استدلال، از این وجه خاص حاصل می‌شود. پس هر کس که خواهان دستیابی به آن است، باید ملازم آنچه مقرر کردیم باشد. و خداوند **«حق را می‌گوید و او راه را هدایت می‌کند»** (يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}