{
  "id": 184,
  "title": {
    "ar": "الباب الرابع والثمانون ومائة في معرفة مقام الكرامات",
    "en": "Chapter One Hundred and Eighty-Four: Concerning the Knowledge (معرفة) of the Station (مقام) of Charismata (الكرامات)",
    "ur": "باب ایک سو چوراسیواں، کرامات کے مقام کی معرفت میں",
    "fa": "باب صد و هشتاد و چهارم در معرفت مقام کرامات"
  },
  "content": {
    "ar": "## (الباب الرابع والثمانون ومائة في معرفة مقام الكرامات)\n\n\n> بعض الرجال يرى كون الكرامات *** دليل حق على نيل المقامات‏\n\n\n> وأنها عين بشرى قد أتتك بها *** رسل المهيمن من فوق السموات‏\n\n\n> وعندنا فيه تفصيل إذا علمت *** به الجماعة لم تفرح بآيات‏\n\n\n> كيف السرور الاستدراج يصحبها *** في حق قوم ذوي جهل وآفات‏\n\n\n> وليس يدرون حقا أنهم جهلوا *** وذا إذا كان من أقوى الجهالات‏\n\n\n> وما الكرامة إلا عصمة وجدت *** في حال قول وأفعال ونيات‏\n\n\n> تلك الكرامة لا تبغي بها بدلا *** واحذر من المكر في طي الكرامات‏\n\n\n### [إن الكرامة من الحق من اسمه البر وهو على قسمين‏]\n\n\nاعلم أيدك الله أن الكرامة من الحق من اسمه البر ولا تكون إلا للأبرار من عباده جَزاءً وِفاقاً فإن المناسبة تطلبها وإن لم يقم طلب ممن ظهرت عليه وهي على قسمين حسية ومعنوية\n\n\n### [أما الكرامة الحسية]\n\n\nفالعامة ما تعرف الكرامة إلا الحسية مثل الكلام على الخاطر والأخبار بالمغيبات الماضية والكائنة والآتية والأخذ من الكون والمشي على الماء واختراق الهواء وطي الأرض والاحتجاب عن الأبصار وإجابة الدعاء في الحال فالعامة لا تعرف الكرامات إلا مثل هذا\n\n\n### [أما الكرامة المعنوية]\n\n\nوأما الكرامة المعنوية فلا يعرفها إلا الخواص من عباد الله والعامة لا تعرف ذلك وهي أن تحفظ عليه آداب الشريعة وأن يوفق لإتيان مكارم الأخلاق واجتناب سفسافها والمحافظة على أداء الواجبات مطلقا في أوقاتها والمسارعة إلى الخيرات وإزالة الغل والحقد من صدره للناس والحسد وسوء الظن وطهارة القلب من كل صفة مذمومة وتحليته بالمراقبة مع الأنفاس ومراعاة حقوق الله في نفسه وفي الأشياء وتفقد آثار ربه في قلبه ومراعاة أنفاسه في خروجها ودخولها فيتلقاها بالأدب إذا وردت عليه ويخرجها وعليها خلعة الحضور فهذه كلها عندنا كرامات الأولياء المعنوية التي لا يدخلها مكر ولا استدراج بل هي دليل على الوفاء بالعهود وصحة القصد والرضي بالقضاء في عدم المطلوب ووجود المكروه ولا يشاركك في هذه الكرامات إلا الملائكة المقربون وأهل الله المصطفون الأخيار وأما الكرامات التي ذكرنا أن العامة تعرفها فكلها يمكن أن يدخلها المكر الخفي‏\n\n\n### [أن الكرامة لا بد أن تكون نتيجة عن استقامة]\n\n\nثم إنا إذا فرضناها كرامة فلا بد أن تكون نتيجة عن استقامة أو تنتج استقامة لا بد من ذلك وإلا فليست بكرامة وإذا كانت الكرامة نتيجة استقامة فقد يمكن أن يجعلها الله حظ عملك وجزاء فعلك فإذا قدمت عليه يمكن أن يحاسبك بها وما ذكرناه من الكرامات المعنوية فلا يدخلها شي‏ء مما ذكرناه فإن العلم يصحبها وقوة العلم وشرفه تعطيك أن المكر لا يدخلها فإن الحدود الشرعية لا تنصب حبالة للمكر الإلهي فإنها عين الطريق الواضحة إلى نيل السعادة والعلم يعصمك من العجب بعملك فإن العلم من شرفه أنه يستعملك وإذا استعملك جردك منه وأضاف ذلك إلى الله وأعلمك أن بتوفيقه وهدايته ظهر منك ما ظهر من طاعته والحفظ لحدوده فإذا ظهر عليه شي‏ء من كرامات العامة ضج إلى الله منها وسأل الله ستره بالعوائد وأن لا يتميز عن العامة بأمر يشار إليه فيه ما عدا العلم لأن العلم هو المطلوب وبه تقع المنفعة ولو لم يعمل به فإنه لا يستوي الَّذِينَ يَعْلَمُونَ والَّذِينَ لا يَعْلَمُونَ فالعلماء هم الآمنون من التلبيس فالكرامة من الله تعالى بعباده إنما تكون للوافدين عليه من الأكوان ومن نفوسهم لكونهم لم يروا وجه الحق فيهما فأسنى ما أكرمهم به من الكرامات العلم خاصة لأن الدنيا موطنه وأما غير ذلك من خرق العادات فليست الدنيا بموطن لها ولا يصح كون ذلك كرامة إلا بتعريف إلهي لا بمجرد خرق العادة وإذا لم تصح إلا بتعريف إلهي فذلك هو العلم فالكرامة الإلهية إنما هي ما يهبهم من العلم به عز وجل سئل أبو يزيد عن طي الأرض فقال ليس بشي‏ء فإن إبليس يقطع من المشرق إلى المغرب في لحظة واحدة وما هو عند الله بمكان وسئل عن اختراق الهواء فقال إن الطير يخترق‏\nالهواء والمؤمن عند الله أفضل من الطير فكيف يحسب كرامة من شاركه فيها طائر وهكذا علل جميع ما ذكرناه ثم قال إلهي إن قوما طلبوك لما ذكروه فشغلتهم به وأهلتهم له اللهم مهما أهلتني لشي‏ء فأهلني لشي‏ء من أشيائك يقول من أسرارك فما طلب إلا العلم لأنه أسنى تحفة وأعظم كرامة ولو قامت عليك به الحجة فإنه يجعلك تعترف ولا تحاج فإنك تعلم ما لك وما عليك وما له وما أمر الله تعالى نبيه صَلَّى اللهُ عَليهِ وسَلَّم أن يطلب منه الزيادة من شي‏ء إلا من العلم لأن الخير كله فيه وهو الكرامة العظمى والبطالة مع العلم أحسن من الجهل مع العمل وأسباب حصول العلم كثيرة ولا أعني بالعلم إلا العلم بالله والدار الآخرة وما تستحقه الدار الدنيا وما خلقت له ولأي شي‏ء وضعت حتى يكون الإنسان من أمره على بصيرة حيث كان فلا يجهل من نفسه ولا من حركاته شيئا والعلم صفة إحاطية إلهية فهي أفضل ما في فضل الله كما قال وعَلَّمْناهُ من لَدُنَّا عِلْماً بِرَحْمَةٍ مِنَّا\n\n\n### [العلم من معدن الرحمة]\n\n\nفاعلم أن العلم من معدن الرحمة فقد أعلمتك ما هي الكرامة وإنها التعريف الإلهي بأن هذا الذي أتحفك به كرامة منه لا ينقص لك حظا من آخرتك ولا هو جزاء لشي‏ء من عملك إلا لمجرد قدومك وإن قدومك عليه لم يكن إلا لجهلك به حيث لم تره في أول قدم كما اتفق لأبي يزيد لما خرج في طلب الحق من بسطام في أول أمره فلقيه بعض الرجال فقال له ما تطلب يا أبا يزيد قال الله قال له الذي تطلبه تركته ببسطام فتنبه أبو يزيد كيف يطلبه وهو تعالى يقول وهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ فلا علم ولا إيمان فإذا حرمك الله تحصيل علم مشاهدته فلا أقل من الايمان به فلهذا قلنا ما قدم عليه إلا من جهله فلما لم يكن لهذه الطائفة هم إلا به ويطلبه كانوا وافدين عليه فأتحفهم بما أتحفهم به وعرفهم إن ذلك جائزة الوفود خاصة ومهما لم يعلموا ذلك منه بإعلامه إياهم وإلا فيخاف من المكر الإلهي في ذلك أو نقص حظ أخروي يتمنون في الآخرة أنهم لم يعطوا شيئا من ذلك في الدنيا\n\n",
    "en": "Chapter One Hundred and Eighty-Four: Concerning the Knowledge of the Station of Miraculous Gifts (مقام الكرامات)\n\nSome men hold that the existence of Miraculous Gifts (الكرامات) is a true proof for the attainment of the Stations (المقامات).\nAnd that they are the very good tidings brought to you by the Messengers of the Sovereign (المهيمن) from above the heavens.\nBut with us, there is a detailed explanation concerning this, such that if the community knew it, they would not rejoice in such signs.\nHow can there be joy when Divine Luring (الاستدراج) accompanies them for a people possessing ignorance and defects?\nAnd they do not truly know that they are ignorant, and this is indeed the strongest form of ignorance.\nThe Miraculous Gift (الكرامة) is nothing but preservation (عصمة) found in the state of speech, actions, and intentions.\nThat is the true Miraculous Gift; do not seek a substitute for it, and beware of Subtle Deception (المكر) hidden within the Miraculous Gifts.\n\n### [The Miraculous Gift (الكرامة) comes from The Real (الحق) through His Name, The Beneficent (البر), and it is of two types]\n\nKnow, may Allah strengthen you, that the Miraculous Gift (الكرامة) comes from The Real (الحق) through His Name, The Beneficent (البر), and it is granted only to the righteous (الأبرار) among His servants, as a commensurate reward (جَزاءً وِفاقاً). This is because suitability demands it, even if no request is made by the one upon whom it appears. It is of two types: sensory (حسية) and spiritual (معنوية).\n\n### [Concerning the Sensory Miraculous Gift]\n\nAs for the sensory type, the common people (العامة) do not recognize any Miraculous Gift except the sensory one, such as speaking about what is in the mind (الكلام على الخاطر), giving news of hidden things—past, present, and future (الأخبار بالمغيبات), taking from the cosmos (الأخذ من الكون), walking on water, traversing the air, folding the earth (طي الأرض), being concealed from sight, and the immediate answering of prayers. The common people recognize no Miraculous Gifts other than these.\n\n### [Concerning the Spiritual Miraculous Gift]\n\nAs for the spiritual Miraculous Gift, only the elite (الخواص) among Allah’s servants recognize it, and the common people do not know it. This gift consists of preserving the servant in the proper conduct (آداب) of the Sacred Law (الشريعة), granting success in attaining noble character (مكارم الأخلاق) and avoiding its trivialities (سفسافها), maintaining the performance of all obligatory duties (الواجبات) precisely at their appointed times, hastening toward good deeds, removing malice (الغل), hatred (الحقد), envy (الحسد), and ill-will (سوء الظن) from his heart toward people, purifying the heart from every blameworthy attribute, and adorning it with constant mindfulness (المراقبة) during every breath. It also involves observing the rights of Allah concerning himself and concerning all things, seeking out the traces of his Lord in his heart, and being mindful of his breaths as they exit and enter. He receives them with proper conduct when they arrive and releases them while wearing the robe of Presence (الحضور). All of these, in our view, are the spiritual Miraculous Gifts of the Friends of Allah (الأولياء), into which neither Subtle Deception (مكر) nor Divine Luring (استدراج) can enter. Rather, they are proof of fidelity to covenants, soundness of intention, and contentment with the Divine Decree (القضاء) regarding the absence of what is desired and the presence of what is disliked. In these Miraculous Gifts, none share with you except the Archangels (الملائكة المقربون) and the chosen, righteous People of Allah (أهل الله المصطفون الأخيار). As for the Miraculous Gifts we mentioned that the common people recognize, all of them are susceptible to subtle deception.\n\n### [The Miraculous Gift Must Necessarily Result from Rectitude]\n\nFurthermore, even if we assume it is a Miraculous Gift (كرامة), it must necessarily be the result of rectitude (استقامة) or produce rectitude; this is essential. Otherwise, it is not a Miraculous Gift. If the Miraculous Gift is the result of rectitude, then Allah may make it the portion of your deed and the reward for your action. If you present yourself before Him, He may hold you accountable for it. However, the spiritual Miraculous Gifts we mentioned are not subject to any of the aforementioned dangers, for Knowledge (العلم) accompanies them. The power and nobility of Knowledge ensure that deception cannot enter them, because the legal boundaries (الحدود الشرعية) do not set a snare for Divine Cunning (المكر الإلهي); they are the very clear path to attaining felicity. Knowledge protects you from self-admiration regarding your actions, for the nobility of Knowledge is that it employs you, and when it employs you, it strips you of yourself and attributes the action to Allah. It informs you that what appeared from you—obedience and preservation of His limits—was only through His enabling (توفيق) and guidance. Thus, if any of the common Miraculous Gifts appear upon him, he cries out to Allah concerning them and asks Allah to conceal him by means of customary habits (العوائد), and that he not be distinguished from the common people by anything that draws attention to him, except for Knowledge (العلم). This is because Knowledge is the goal, and through it benefit occurs, even if one does not act upon it, for <<لَا يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ>> (Those who know and those who do not know are not equal). The people of Knowledge are the ones safe from delusion (التلبيس). The Miraculous Gift from Allah to His servants is only for those who approach Him (الوافدين عليه) from the cosmos and from their own souls, because they did not see the Face of The Real (وجه الحق) in either of them. Therefore, the most sublime gift with which He honors them is Knowledge specifically, because the world is its proper domain. As for other things, such as the breaking of customary habits (خرق العادات), the world is not their proper domain. Such things cannot be considered a Miraculous Gift unless by Divine definition (تعريف إلهي), not merely by the breaking of habit. And if it is only valid by Divine definition, then that definition is Knowledge. Thus, the Divine Miraculous Gift is only the Knowledge of Him, Exalted is He, that He bestows upon them. Abu Yazid was asked about the folding of the earth (طي الأرض). He said, \"It is nothing, for Iblis traverses from the East to the West in a single moment, yet he holds no station with Allah.\" He was asked about traversing the air. He said, \"The bird traverses the air, and the believer is superior to the bird in the sight of Allah. How then can something shared by a bird be considered a Miraculous Gift?\" He thus explained the deficiency of all the things we mentioned. Then he said, \"My God, a people sought You for the things they mentioned, so You preoccupied them with those things and qualified them for them. O Allah, whatever You qualify me for, qualify me for something of Your things,\" meaning, \"of Your secrets.\" He sought nothing but Knowledge, because it is the most sublime gift and the greatest Miraculous Gift. Even if the proof is established against you by it, it makes you confess and not argue, for you know what is for you and what is against you, and what is due to Him. Allah did not command His Prophet (peace and blessings be upon him) to seek an increase in anything except Knowledge, because all goodness is contained within it, and it is the Supreme Miraculous Gift. Idleness accompanied by Knowledge is better than ignorance accompanied by action. The means of acquiring Knowledge are numerous, and by Knowledge, I mean nothing but the Knowledge of Allah, the Hereafter, what the present world deserves, what it was created for, and why it was established, so that the human being may be fully aware of his affair wherever he may be, ignorant of nothing concerning himself or his movements. Knowledge is an encompassing Divine Attribute (صفة إحاطية إلهية); thus, it is the best of Allah’s bounty, as He said, <<وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْماً بِرَحْمَةٍ مِنَّا>> (And We taught him knowledge from Our Presence, by a mercy from Us).\n\n### [Knowledge is from the Source of Mercy]\n\nKnow, therefore, that Knowledge is from the source of Mercy. I have thus informed you what the Miraculous Gift is: it is the Divine definition (التعريف الإلهي) that this thing with which He honors you is a Spiritual Favor (كرامة) from Him that neither diminishes your portion in the Hereafter nor is a reward for any of your actions, but is merely due to your approach (قدومك). And your approach to Him was only due to your ignorance of Him, since you did not see Him at the very first step, as happened to Abu Yazid when he first left Bistam seeking The Real (الحق). He met a man who asked him, \"What are you seeking, O Abu Yazid?\" He replied, \"Allah.\" The man said to him, \"What you seek, you left behind in Bistam.\" Abu Yazid was thus alerted: how could he seek Him when He, Exalted is He, says, <<وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ>> (And He is with you wherever you are)? So, there was neither Knowledge nor faith. If Allah denies you the attainment of the Knowledge of witnessing Him, then the least you can have is faith in Him. This is why we said that he only approached Him out of his ignorance. Since this group had no concern except for Him and sought Him, they were approaching Him (وافدين عليه). Thus, He honored them with what He honored them with and informed them that this was specifically the prize for their approach. If they do not know this from Him through His informing them, then they fear Divine Cunning (المكر الإلهي) in that matter, or a diminution of their portion in the Hereafter, such that they will wish in the Hereafter that they had not been given anything of that in the world.",
    "ur": "(باب ایک سو چوراسی کرامات کے مقام کی معرفت میں)\n\nبعض لوگ کرامات (Al-Karāmāt) کے وجود کو\nمقامات کے حصول پر حق کی دلیل سمجھتے ہیں۔\n\nاور یہ کہ وہ بعینہٖ وہ بشارت ہے جو\nمہیمن (اللہ) کے رسول آسمانوں کے اوپر سے تمہارے پاس لائے ہیں۔\n\nاور ہمارے نزدیک اس میں ایک تفصیل ہے، اگر جماعت اسے جان لے\nتو وہ ان نشانیوں (آیات) پر خوش نہ ہو۔\n\nکیسی خوشی؟ جبکہ استدراج (Al-Istidrāj) ان کے ساتھ ہوتا ہے\nان لوگوں کے حق میں جو جہالت اور آفتوں والے ہیں۔\n\nاور وہ حقیقت میں نہیں جانتے کہ وہ جاہل ہیں\nاور یہ سب سے بڑی جہالتوں میں سے ہے۔\n\nاور کرامت (Al-Karāmah) تو صرف وہ عصمت ہے جو پائی جائے\nقول، افعال اور نیتوں کی حالت میں۔\n\nیہی وہ کرامت ہے، اس کے بدلے میں کچھ اور مت چاہو\nاور کرامات (Al-Karāmāt) کے پردے میں مکر (Al-Makr) سے بچو۔\n\n### [کرامت (Al-Karāmah) ذات حق (Al-Ḥaqq) کی طرف سے اس کے نام البر (Al-Barr) سے ہے اور یہ دو قسموں پر ہے]\n\nاللہ آپ کی تائید فرمائے، جان لیجیے کہ کرامت (Al-Karāmah) ذات حق (Al-Ḥaqq) کی طرف سے اس کے نام البر (Al-Barr) سے ہے، اور یہ صرف اس کے نیکوکار بندوں کے لیے جَزاءً وِفاقاً (بدلہ موافق) ہوتی ہے۔ کیونکہ مناسبت اس کا تقاضا کرتی ہے، اگرچہ اس شخص کی طرف سے کوئی طلب نہ ہو جس پر وہ ظاہر ہوئی ہو۔ اور یہ دو قسموں پر ہے: حسی اور معنوی۔\n\n### [بہر حال حسی کرامت (Al-Karāmah)]\n\nعوام حسی کرامت (Al-Karāmah) کے علاوہ کسی کرامت کو نہیں جانتے، جیسے دل میں آنے والے خیال پر بات کرنا، ماضی، موجودہ اور آئندہ کے غیب کی خبریں دینا، کائنات سے چیزیں حاصل کرنا، پانی پر چلنا، ہوا میں اڑنا، زمین کو لپیٹنا (طی الارض)، آنکھوں سے اوجھل ہو جانا، اور فوراً دعا کا قبول ہو جانا۔ عوام صرف اسی طرح کی کرامات (Al-Karāmāt) کو جانتے ہیں۔\n\n### [بہر حال معنوی کرامت (Al-Karāmah)]\n\nاور جہاں تک معنوی کرامت (Al-Karāmah) کا تعلق ہے، اسے صرف اللہ کے خواص (Al-Khawāṣṣ) بندے ہی جانتے ہیں اور عوام اس سے واقف نہیں ہیں۔ یہ یہ ہے کہ اللہ اس پر شریعت کے آداب کی حفاظت فرمائے، اور اسے مکارمِ اخلاق (اعلیٰ اخلاق) بجا لانے اور ان کی سفساف (ادنیٰ باتوں) سے بچنے کی توفیق دے، اور تمام واجبات کو ان کے اوقات میں ادا کرنے کی مکمل پابندی، نیکیوں کی طرف تیزی سے بڑھنا، اور لوگوں کے لیے اپنے سینے سے کینہ، حسد، بدگمانی اور غل (دشمنی) کو دور کرنا، اور قلب کو ہر مذموم صفت سے پاک کرنا، اور اسے ہر سانس کے ساتھ مراقبہ (Murāqabah) سے آراستہ کرنا، اور اپنے نفس میں اور اشیاء میں اللہ کے حقوق کی رعایت کرنا، اور اپنے قلب میں اپنے رب کے آثار کی تلاش کرنا، اور سانسوں کے اندر جانے اور باہر نکلنے کی نگرانی کرنا، پس جب وہ سانسیں اس پر وارد ہوں تو وہ انہیں ادب کے ساتھ قبول کرے اور جب انہیں باہر نکالے تو ان پر حضور (Ḥuḍūr) کی خلعت ہو۔ یہ سب ہمارے نزدیک اولیاء کی معنوی کرامات (Al-Karāmāt) ہیں جن میں نہ مکر (Al-Makr) داخل ہوتا ہے اور نہ استدراج (Al-Istidrāj)، بلکہ یہ عہدوں کی وفاداری، نیت کی صحت، اور مطلوب کے نہ ملنے اور ناپسندیدہ چیز کے وجود میں قضاء پر راضی رہنے کی دلیل ہیں۔ ان کرامات (Al-Karāmāt) میں تمہارے ساتھ صرف مقرب فرشتے اور اللہ کے چنے ہوئے نیک لوگ ہی شریک ہوتے ہیں۔ اور جہاں تک ان کرامات کا تعلق ہے جن کے بارے میں ہم نے ذکر کیا کہ عوام انہیں جانتے ہیں، تو ان سب میں خفیہ مکر (Al-Makr) داخل ہو سکتا ہے۔\n\n### [کرامت (Al-Karāmah) کا استقامت (Al-Istiqāmah) کا نتیجہ ہونا ضروری ہے]\n\nپھر جب ہم اسے کرامت (Al-Karāmah) فرض کرتے ہیں، تو ضروری ہے کہ وہ استقامت (Al-Istiqāmah) کا نتیجہ ہو یا استقامت کو جنم دے، یہ لازمی ہے۔ ورنہ وہ کرامت نہیں ہے۔ اور اگر کرامت استقامت کا نتیجہ ہے، تو ممکن ہے کہ اللہ اسے تمہارے عمل کا حصہ اور تمہارے فعل کا بدلہ بنا دے، پس جب تم اس کے حضور پیش ہو گے تو ممکن ہے کہ وہ اس پر تمہارا حساب لے۔ اور جو معنوی کرامات (Al-Karāmāt) ہم نے ذکر کی ہیں، ان میں مذکورہ بالا چیزوں میں سے کوئی بھی داخل نہیں ہوتی، کیونکہ علم (Al-ʿIlm) ان کے ساتھ ہوتا ہے، اور علم کی قوت اور اس کا شرف تمہیں یہ بتاتا ہے کہ مکر (Al-Makr) ان میں داخل نہیں ہو سکتا۔ کیونکہ شرعی حدود الٰہی مکر (Al-Makr) کے لیے جال نہیں بچھاتیں، بلکہ وہ سعادت کے حصول کا واضح راستہ ہیں۔ اور علم تمہیں اپنے عمل پر عجب (خود پسندی) سے بچاتا ہے، کیونکہ علم کا شرف یہ ہے کہ وہ تمہیں استعمال کرتا ہے، اور جب وہ تمہیں استعمال کرتا ہے تو تمہیں تم سے جدا کر دیتا ہے اور اس کا انتساب اللہ کی طرف کرتا ہے، اور تمہیں یہ بتاتا ہے کہ اس کی توفیق اور ہدایت سے ہی تمہاری اطاعت اور اس کی حدود کی حفاظت ظاہر ہوئی ہے۔ پس جب اس پر عوام کی کرامات میں سے کوئی چیز ظاہر ہوتی ہے تو وہ اللہ کے حضور آہ و زاری کرتا ہے اور اللہ سے سوال کرتا ہے کہ وہ اسے عادات کے پردے میں چھپا دے، اور یہ کہ وہ کسی ایسی چیز سے عوام سے ممتاز نہ ہو جس کی طرف اشارہ کیا جائے، سوائے علم (Al-ʿIlm) کے۔ کیونکہ علم ہی مطلوب ہے اور اسی سے فائدہ حاصل ہوتا ہے، اگرچہ اس پر عمل نہ بھی کیا جائے، کیونکہ اللہ تعالیٰ فرماتا ہے: قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ (کہو: کیا وہ لوگ جو جانتے ہیں اور وہ لوگ جو نہیں جانتے برابر ہو سکتے ہیں؟) (الزمر: 9)۔ پس علماء ہی تلبيس (فریب) سے محفوظ ہیں۔ اللہ تعالیٰ کی طرف سے اپنے بندوں پر کرامت (Al-Karāmah) صرف ان لوگوں کے لیے ہوتی ہے جو کائنات اور اپنے نفوس سے اس کی طرف آتے ہیں، کیونکہ انہوں نے ان دونوں میں ذات حق (Al-Ḥaqq) کا چہرہ نہیں دیکھا۔ پس سب سے اعلیٰ چیز جس سے اللہ انہیں کرامات (Al-Karāmāt) کے طور پر نوازتا ہے وہ صرف علم (Al-ʿIlm) ہے، کیونکہ دنیا اس کا وطن ہے۔ اور جہاں تک خرقِ عادات (عادات کو توڑنے) کا تعلق ہے، تو دنیا ان کا وطن نہیں ہے، اور یہ صرف الٰہی تعریف (تعریف الٰہی) سے ہی کرامت ہو سکتا ہے، محض خرقِ عادت سے نہیں۔ اور جب یہ صرف الٰہی تعریف سے ہی صحیح ہو سکتا ہے، تو وہ علم ہی ہے۔ پس الٰہی کرامت (Al-Karāmah) صرف وہ علم ہے جو وہ انہیں اپنی ذات عزوجل کے بارے میں عطا کرتا ہے۔ ابو یزید (بسطامی) سے طی الارض (زمین لپیٹنا) کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"یہ کوئی چیز نہیں ہے، کیونکہ ابلیس ایک لمحے میں مشرق سے مغرب تک کاٹتا ہے، اور وہ اللہ کے نزدیک کسی مقام پر نہیں ہے۔\" اور ان سے اختراقِ ہوا (ہوا میں اڑنا) کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"پرندہ ہوا میں اڑتا ہے، اور مومن اللہ کے نزدیک پرندے سے افضل ہے، تو وہ اسے کیسے کرامت سمجھے جس میں ایک پرندہ بھی اس کا شریک ہے؟\" اور اسی طرح انہوں نے ان تمام چیزوں کی علت بیان کی جن کا ہم نے ذکر کیا۔ پھر فرمایا: \"اے میرے معبود! کچھ لوگوں نے تجھے ان چیزوں کے ذریعے طلب کیا جن کا انہوں نے ذکر کیا، تو تو نے انہیں ان میں مشغول کر دیا اور انہیں ان کا اہل بنا دیا۔ اے اللہ! تو مجھے جس چیز کا بھی اہل بنائے، تو مجھے اپنی چیزوں میں سے کسی چیز کا اہل بنا۔\" یعنی اپنے اسرار میں سے۔ پس انہوں نے صرف علم (Al-ʿIlm) کو طلب کیا، کیونکہ یہ سب سے اعلیٰ تحفہ اور سب سے بڑی کرامت (Al-Karāmah) ہے۔ اگرچہ اس کے ذریعے تم پر حجت قائم ہو جائے، کیونکہ یہ تمہیں اعتراف کرنے پر مجبور کرتا ہے اور تم بحث نہیں کرتے، کیونکہ تم جانتے ہو کہ تمہارے لیے کیا ہے اور تمہارے خلاف کیا ہے، اور اس (اللہ) کے لیے کیا ہے، اور اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو کسی چیز میں زیادتی طلب کرنے کا حکم نہیں دیا سوائے علم (Al-ʿIlm) کے، کیونکہ ساری بھلائی اسی میں ہے اور یہی کرامت عظمیٰ ہے۔ اور علم کے ساتھ بے عملی جہالت کے ساتھ عمل سے بہتر ہے۔ اور علم کے حصول کے اسباب بہت ہیں، اور علم سے میری مراد صرف اللہ، دار آخرت، اور دار دنیا کے مستحق ہونے، اور اس کے لیے جس کے لیے اسے پیدا کیا گیا ہے، اور کس چیز کے لیے اسے رکھا گیا ہے، کا علم ہے، تاکہ انسان جہاں بھی ہو اپنے معاملے میں بصیرت پر ہو، پس وہ اپنے نفس یا اپنی حرکات میں سے کسی چیز سے جاہل نہ ہو۔ اور علم (Al-ʿIlm) ایک احاطی الٰہی صفت ہے، پس یہ اللہ کے فضل میں سب سے افضل ہے، جیسا کہ اس نے فرمایا: وَعَلَّمْنَاهُ مِنْ لَدُنَّا عِلْمًا بِرَحْمَةٍ مِّنَّا (اور ہم نے اسے اپنے پاس سے ایک خاص علم سکھایا، اپنی رحمت سے) (الکہف: 65)۔\n\n### [علم (Al-ʿIlm) رحمت کی کان سے ہے]\n\nپس جان لیجیے کہ علم (Al-ʿIlm) رحمت کی کان سے ہے۔ میں نے آپ کو بتا دیا کہ کرامت (Al-Karāmah) کیا ہے، اور وہ یہ ہے کہ الٰہی تعریف (تعریف الٰہی) ہو کہ یہ چیز جس سے اس نے آپ کو نوازا ہے، اس کی طرف سے کرامت ہے، جو آپ کے آخرت کے حصے میں کوئی کمی نہیں کرے گی، اور نہ ہی یہ آپ کے کسی عمل کا بدلہ ہے، بلکہ صرف آپ کے اس کی طرف آنے کی وجہ سے ہے۔ اور آپ کا اس کی طرف آنا صرف اس لیے تھا کہ آپ اس سے جاہل تھے، جہاں آپ نے اسے پہلے قدم پر نہیں دیکھا، جیسا کہ ابو یزید (بسطامی) کے ساتھ ہوا جب وہ اپنے ابتدائی دور میں بسطام سے حق کی تلاش میں نکلے، تو انہیں ایک شخص ملا جس نے ان سے پوچھا: \"اے ابو یزید! تم کیا تلاش کر رہے ہو؟\" انہوں نے کہا: \"اللہ کو۔\" اس شخص نے ان سے کہا: \"جسے تم تلاش کر رہے ہو، اسے تم بسطام میں چھوڑ آئے ہو۔\" تو ابو یزید کو تنبہ ہوا کہ وہ اسے کیسے تلاش کر رہے ہیں جبکہ وہ (اللہ) خود فرماتا ہے: وَهُوَ مَعَكُمْ أَيْنَ مَا كُنْتُمْ (اور وہ تمہارے ساتھ ہے جہاں کہیں بھی تم ہو) (الحدید: 4)۔ پس نہ علم ہے اور نہ ایمان۔ لہٰذا اگر اللہ تمہیں اس کے مشاہدے کا علم حاصل کرنے سے محروم کر دے، تو کم از کم اس پر ایمان تو ہو۔ اسی لیے ہم نے کہا کہ وہ صرف اپنی جہالت کی وجہ سے اس کی طرف آیا۔ پس جب اس گروہ کا مقصد صرف وہی تھا اور وہ اسے طلب کرتے تھے، تو وہ اس کی طرف آنے والے تھے، پس اس نے انہیں اس چیز سے نوازا جس سے نوازا، اور انہیں یہ بتا دیا کہ یہ خاص طور پر وفود (آنے والوں) کا انعام ہے۔ اور جب تک وہ اس کے بتانے سے یہ نہیں جانیں گے، تو اس میں الٰہی مکر (Al-Makr) کا خوف ہے یا اخروی حصے میں کمی کا، جس کی وجہ سے وہ آخرت میں تمنا کریں گے کہ کاش انہیں دنیا میں ان چیزوں میں سے کچھ نہ دیا جاتا۔",
    "fa": "(باب صد و هشتاد و چهارم در معرفت مقام کرامات)\n\nبرخی از مردان، وجود کرامات را\n> دليل حق على نيل المقامات‏\nدلیلی راستین بر رسیدن به مقامات می‌بینند.\nو اینکه کرامات، عین بشارتی است که\n> وأنها عين بشرى قد أتتك بها *** رسل المهيمن من فوق السموات‏\nفرستادگان خداوند مسلط از فراز آسمان‌ها برای تو آورده‌اند.\nاما نزد ما در این باره تفصیلی است که اگر\n> وعندنا فيه تفصيل إذا علمت *** به الجماعة لم تفرح بآيات‏\nگروه (سالکان) آن را بدانند، به این نشانه‌ها شادمان نمی‌شوند.\nچگونه شادمانی؟ در حالی که استدراج (الاستدراج) همراه آن است\n> كيف السرور الاستدراج يصحبها *** في حق قوم ذوي جهل وآفات‏\nدر حق قومی که اهل جهل و آفت‌ها هستند.\nو به راستی نمی‌دانند که جاهل‌اند،\n> وليس يدرون حقا أنهم جهلوا *** وذا إذا كان من أقوى الجهالات‏\nو این خود از قوی‌ترین جهالت‌هاست.\nو کرامت نیست مگر عصمتی که یافت می‌شود\n> وما الكرامة إلا عصمة وجدت *** في حال قول وأفعال ونيات‏\nدر حال گفتار، کردار و نیت‌ها.\n> تلك الكرامة لا تبغي بها بدلا *** واحذر من المكر في طي الكرامات‏\nآن کرامت است که نباید جایگزینی برایش بجویی، و از مکر (الهی) در پوشش کرامات برحذر باش.\n\n[کرامت از جانب حق (الحق) و از اسم \"البر\" است و بر دو قسم است]\n\nبدان، خداوند تو را تأیید کند، که کرامت از جانب حق (الحق) و از اسم او \"البر\" (نیکوکار) است و جز برای نیکان (الأبرار) از بندگانش به عنوان پاداشی موافق (جَزاءً وِفاقاً) نیست. زیرا تناسب آن را می‌طلبد، حتی اگر کسی که کرامت بر او ظاهر شده، آن را طلب نکرده باشد. و کرامت بر دو قسم است: حسی و معنوی.\n\n[اما کرامت حسی]\n\nعامه مردم کرامت را جز حسی نمی‌شناسند؛ مانند سخن گفتن از آنچه بر دل می‌گذرد (الخاطر)، خبر دادن از غیب‌های گذشته، موجود و آینده، گرفتن از عالم هستی (الکون)، راه رفتن بر آب، درنوردیدن هوا، طی الارض، پنهان شدن از دیدگان، و اجابت فوری دعا. عامه مردم کرامات را جز این‌گونه نمی‌شناسند.\n\n[اما کرامت معنوی]\n\nاما کرامت معنوی را جز خواص از بندگان خدا نمی‌شناسند و عامه مردم آن را درک نمی‌کنند. و آن عبارت است از اینکه آداب شریعت بر او حفظ شود، و موفق به انجام مکارم اخلاق و دوری از امور پست آن گردد، و بر ادای مطلق واجبات در اوقاتشان محافظت کند، و به سوی خیرات بشتابد، و کینه و حسد و سوء ظن را از سینه خود نسبت به مردم بزداید، و قلبش را از هر صفت نکوهیده پاک سازد، و آن را به مراقبه (المراقبة) همراه با هر نفس آراسته کند، و حقوق خداوند را در نفس خود و در اشیاء رعایت نماید، و آثار پروردگارش را در قلب خود جستجو کند، و مراقب دم و بازدم خود باشد؛ پس هرگاه نفس بر او وارد شود، آن را با ادب دریافت کند و آن را در حالی خارج سازد که خلعت حضور (الحضور) بر تن دارد. این‌ها همه نزد ما کرامات معنوی اولیا هستند که مکر و استدراج (الاستدراج) در آن‌ها راه ندارد، بلکه دلیلی بر وفای به عهدها، درستی قصد، و رضایت به قضا (القضاء) در نبود مطلوب و وجود ناخوشایند است. و در این کرامات جز فرشتگان مقرب و اهل الله برگزیده و نیکوکار با تو شریک نمی‌شوند. اما کرامات حسی که ذکر کردیم عامه مردم آن‌ها را می‌شناسند، همگی ممکن است مکر پنهان (المکر الخفي) در آن‌ها راه یابد.\n\n[کرامت حتماً باید نتیجه استقامت باشد]\n\nسپس، اگر کرامت را فرض کنیم، حتماً باید نتیجه استقامت (الاستقامة) باشد یا خود، استقامت را نتیجه دهد؛ این ضروری است، وگرنه کرامت نیست. و اگر کرامت نتیجه استقامت باشد، ممکن است خداوند آن را بهره عمل و پاداش کردار تو قرار دهد، و در این صورت، هنگامی که بر او وارد شوی، ممکن است تو را به سبب آن محاسبه کند. اما کرامات معنوی که ذکر کردیم، چیزی از آنچه گفتیم در آن‌ها راه ندارد، زیرا علم (العلم) همراه آن‌هاست. و قدرت و شرافت علم به تو می‌فهماند که مکر در آن راه نمی‌یابد، زیرا حدود شرعی دامگاهی برای مکر الهی برپا نمی‌کنند، بلکه عین راه روشن برای رسیدن به سعادت هستند. و علم تو را از عُجب (خودپسندی) به عملت باز می‌دارد، زیرا از شرافت علم این است که تو را به کار می‌گیرد و وقتی به کار گرفت، تو را از خودت تهی می‌سازد و آن را به خداوند نسبت می‌دهد و به تو می‌آموزد که آنچه از طاعت و حفظ حدود او از تو ظاهر شده، به توفیق و هدایت او بوده است. پس اگر چیزی از کرامات عامه بر ولیّ ظاهر شود، از آن به سوی خداوند ناله می‌کند و از خدا می‌خواهد که آن را با عادات (طبیعی) بپوشاند و او را به امری که به آن اشاره شود، از عامه متمایز نسازد، مگر علم؛ زیرا علم مطلوب است و منفعت به واسطه آن حاصل می‌شود، حتی اگر به آن عمل نشود، چرا که:\n> لَا يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ\n> (آیه ۹ سوره زمر: آیا کسانی که می‌دانند و کسانی که نمی‌دانند برابرند؟)\nپس عالمان از فریب (التلبیس) در امان هستند. کرامت از جانب خداوند متعال به بندگانش تنها برای کسانی است که از عوالم هستی (الأکوان) و از نفوس خود به سوی او وارد می‌شوند، زیرا وجه حق (الحق) را در آن دو ندیده‌اند. پس والاترین چیزی که خداوند آنان را با آن اکرام می‌کند، به ویژه علم است، زیرا دنیا موطن علم است. اما غیر از آن، یعنی خرق عادات، دنیا موطن آن‌ها نیست و صحیح نیست که آن را کرامت بدانیم مگر با تعریف الهی، نه صرفاً با خرق عادت. و اگر صحت آن جز با تعریف الهی نباشد، پس آن تعریف همان علم است. بنابراین، کرامت الهی تنها همان علمی است که خداوند عز و جل از خود به آنان می‌بخشد. از ابویزید (بسطامی) درباره طی الارض سؤال شد، گفت: «چیزی نیست، زیرا ابلیس در یک لحظه از مشرق تا مغرب را طی می‌کند و نزد خداوند جایگاهی ندارد.» و از او درباره درنوردیدن هوا سؤال شد، گفت: «پرنده هوا را درمی‌نوردد، و مؤمن نزد خداوند برتر از پرنده است. پس چگونه چیزی که پرنده در آن شریک است، کرامت محسوب شود؟» و این‌گونه برای تمام آنچه ذکر کردیم، دلیل آورد. سپس گفت: «خدایا، قومی تو را به خاطر آنچه ذکر کردند طلبیدند، پس تو آنان را به همان مشغول ساختی و شایسته آن گردانیدی. خدایا، اگر مرا شایسته چیزی می‌سازی، مرا شایسته چیزی از اشیاء خودت (یعنی از اسرار خودت) بگردان.» پس او جز علم را طلب نکرد، زیرا علم والاترین هدیه و بزرگ‌ترین کرامت است. و اگرچه حجت به واسطه آن بر تو اقامه شود، اما تو را وادار به اعتراف می‌کند و مجادله نمی‌کنی، زیرا می‌دانی چه چیزی به نفع تو و چه چیزی به ضرر توست و چه چیزی از آنِ اوست. و خداوند متعال پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) را امر نکرد که در طلب زیادت چیزی باشد مگر علم، زیرا تمام خیر در آن است و آن کرامت عظمی است. و بیکاری همراه با علم بهتر از جهل همراه با عمل است. و اسباب حصول علم بسیار است. و منظور من از علم، جز علم به خداوند، سرای آخرت، و آنچه سرای دنیا سزاوار آن است و برای چه آفریده شده و برای چه وضع گشته، نیست؛ تا انسان در هر کجا که باشد، نسبت به کار خود بصیرت داشته باشد و از نفس خود و حرکاتش جاهل نباشد. و علم صفتی احاطی و الهی است، پس بهترین چیزی است که در فضل خداوند وجود دارد، چنانکه فرمود:\n> وَعَلَّمْناهُ من لَدُنَّا عِلْماً بِرَحْمَةٍ مِنَّا\n> (آیه ۶۵ سوره کهف: و از جانب خود علمی از روی رحمت به او آموختیم.)\n\n[علم از معدن رحمت است]\n\nپس بدان که علم از معدن رحمت است. من تو را آگاه ساختم که کرامت چیست؛ و آن تعریف الهی است مبنی بر اینکه آنچه خداوند به تو هدیه کرده، کرامتی از جانب اوست که نه از بهره آخرت تو می‌کاهد و نه پاداش هیچ یک از اعمال توست، مگر صرفاً به خاطر ورود تو (به درگاه او). و ورود تو بر او جز به دلیل جهل تو به او نبوده است، زیرا او را در اولین قدم ندیدی، چنانکه برای ابویزید (بسطامی) اتفاق افتاد؛ هنگامی که در ابتدای کارش برای طلب حق (الحق) از بسطام خارج شد، مردی او را دید و گفت: «ای ابویزید، چه می‌جویی؟» گفت: «خدا را.» آن مرد به او گفت: «آنچه می‌جویی، در بسطام رها کرده‌ای.» پس ابویزید متوجه شد که چگونه او را می‌جوید در حالی که خداوند متعال می‌فرماید:\n> وَهُوَ مَعَكُمْ أَيْنَ ما كُنْتُمْ\n> (آیه ۴ سوره حدید: و او با شماست هر کجا که باشید.)\nپس نه علم و نه ایمان. اگر خداوند تو را از حصول علم مشاهدت (الشهود) محروم ساخت، دست‌کم ایمان به او را از دست مده. به همین دلیل گفتیم که او (سالک) جز از روی جهل بر او وارد نشده است. پس چون این طایفه (صوفیه) همّی جز او نداشتند و او را می‌طلبیدند، بر او وارد شدند، و خداوند آنان را به آنچه اکرام کرد، اکرام نمود و به ایشان شناساند که این به ویژه جایزه واردشوندگان است. و اگر این را از جانب او و با آگاه ساختن او ندانند، بیم مکر الهی (المکر الإلهي) در آن می‌رود یا نقصانی در بهره اخروی که در آخرت آرزو می‌کنند کاش هیچ یک از آن کرامات در دنیا به آنان داده نمی‌شد."
  },
  "page_count": 2
}