{
  "id": 15,
  "title": {
    "ar": "الباب الخامس عشر في معرفة الأنفاس ومعرفة أقطابها المحققين بها وأسرارهم هي",
    "en": "Chapter Fifteen: Concerning the Gnosis (معرفة) of the Breaths (الأنفاس), and the Gnosis of their Poles (أقطابها) who have realized them, and their Mysteries (أسرارهم).",
    "ur": "پندرہواں باب: انفاس کی معرفت، ان کے اقطاب محققین کی معرفت جو ان کے ساتھ قائم ہیں، اور ان کے اسرار کا بیان",
    "fa": "باب پانزدهم در معرفت انفاس و معرفت اقطاب محقق به آن و اسرار ایشان."
  },
  "content": {
    "ar": "## «الباب الخامس عشر في معرفة الأنفاس ومعرفة أقطابها المحققين بها وأسرارهم هي»\n\n\n( (بسم الله الرحمن الرحيم))\n\n\n> عالم الأنفاس من نفسي *** وهم الأعلون في القدس‏\n\n\n> مصطفاهم سيد لسن *** وحيه يأتيه في الجرس‏\n\n\n> قلت للبواب حين رأى *** ما أقاسيه من الحرس‏\n\n\n> قال ما تبغيه يا ولدي *** قلت قرب السيد الندس‏\n\n\n> من شفيعي للإمام عسى *** خطرة منه لمختلس‏\n\n\n> قال ما يعطي عوارفه *** لغني غير مبتئس‏\n\n\n### [القطب الأول: مداوي الكلوم‏]\n\n\nقال رسول الله صلى الله عليه وسلم إن نفس الرحمن يأتيني من قبل اليمن‏\n\n\nقيل إن الأنصار نفس الله بهم عن نبيه صلى الله عليه وسلم ما كان فيه من مقاساة الكفار المشركين والأنفاس روائح القرب الإلهي فلما تنسمت مشام العارفين عرف هذه الأنفاس وتوفرت الدواعي منهم إلى طلب محقق ثابت القدم في ذلك المقام ينبئهم بما في طي ذلك المقام الأقدس وما جاءت به هذه الأنفاس من العرف إلا نفس من الأسرار والعلوم بعد البحث بالهمم والتعرض لنفحات الكرم عرفوا بشخص إلهي عنده السر الذي يطلبونه والعلم الذي يريدون تحصيله وأقامه الحق فيهم قطبا يدور عليه فلكهم وأما ما يقوم به ملكهم يقال له مداوي الكلوم فانتشر عنه فيهم من العلم والحكم والأسرار ما لا يحصرها كتاب‏\n\n\n### [مداوي الكلوم وعلم الكيمياء]\n\n\nوأول سر أطلع عليه الدهر الأول الذي عنه تكونت الدهور وأول فعل أعطى فعل ما تقتضيه روحانية السماء السابعة سماء كيوان فكان يصير الحديد فضة بالتدبير والصنعة ويصير الحديد ذهبا بالخاصية وهو سر عجيب ولم يطلب على هذا رغبة في المال ولكن رغبة في حسن المال ليقف من ذلك على رتبة الكمال وأنه مكتسب في التكوين فإن المرتبة الأولى من عقد الأبخرة المعدنية بالحركات الفلكية والحرارة الطبيعية زئبقا وكبريتا وكل متكون في المعدن فإنه يطلب الغاية الذي هو الكمال وهو الذهب لكن تطرأ عليه في المعدن علل وأمراض من يبس مفرط أو رطوبة مفرطة أو حرارة أو برودة تخرجه عن الاعتدال فيؤثر فيه ذلك المرض صورة تسمى الحديد أو النحاس أو الأسرب أو غير ذلك من المعادن فأعطى هذا الحكيم معرفة العقاقير والأدوية المزيل استعمالها تلك العلة الطارئة على شخصية هذا الطالب درجة الكمال من المعدنيات وهي الذهب فأزالها فصح ومشى حتى لحق بدرجة الكمال ولكن لا يقوي في الكمالية قوة الصحيح الذي ما دخل جسمه مرض فإن الجسد الذي يدخله المرض بعيد أن يتخلص وينقى الخلوص الذي لا يشوبه كدر وهو الخلاص الأصلي كيحيى في الأنبياء وآدم عليهما السلام ولم يكن الغرض إلا درجة الكمال الإنساني في العبودية فإن الله خلقه في أَحْسَنِ تَقْوِيمٍ ثم رده إلى أسفل سافلين إِلَّا الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ فأبقوا على الصحة الأصلية وذلك أنه في طبيعته اكتسب علل الأعراض وأمراض الأغراض فأراد هذا الحكيم أن يرده إلى أحسن تقويم الذي خلقه الله عليه فهذا كان قصد الشخص العاقل بمعرفة هذه الصنعة المسماة بالكيمياء وليست سوى معرفة المقادير والأوزان‏\n\n\n### [النشأة الإنسانية]\n\n\nفإن الإنسان لما خلقه الله وهو آدم أصل هذه النشأة الإنسانية والصورة الجسمية الطبيعية العنصرية ركب جسده من حار وبارد ورطب ويابس بل من بارد يابس وبارد رطب وحار رطب وحار يابس وهي الأخلاط الأربعة السوداء والبلغم والدم والصفراء كما هي في جسم العالم الكبير النار والهواء والماء والتراب فخلق الله‏\nجسم آدم من طين وهو مزج الماء بالتراب ثم نفخ فيه نفسا وروحا ولقد ورد في النبوة الأولى في بعض الكتب المنزلة على نبي في بنى إسرائيل ما أذكر نصه الآن فإن الحاجة مست إلى ذكره فإن أصدق الأخبار ما روى عن الله تعالى فروينا عن مسلمة بن وضاح مسندا إليه وكان من أهل قرطبة فقال‏\n\n\nقال الله في بعض ما أنزله على أنبياء بنى إسرائيل إني خلقت يعني آدم من تراب وماء ونفخت فيه نفسا وروحا فسويت جسده من قبل التراب ورطوبته من الماء وحرارته من النفس وبرودته من الروح قال ثم جعلت في الجسد بعد هذا أربعة أنواع أخر لا تقوم واحدة منهن إلا بالأخرى وهي المرتان والدم والبلغم ثم أسكنت بعضهن في بعض فجعلت مسكن اليبوسة في المرة السوداء ومسكن الحرارة في المرة الصفراء ومسكن الرطوبة في الدم ومسكن البرودة في البلغم ثم قال جل ثناؤه فأي جسد اعتدلت فيه هذه الأخلاط كملت صحته واعتدلت بنيته فإن زادت واحدة منهن على الأخرى وقهرتهن دخل السقم على الجسد بقدر ما زادت وإذا كانت ناقصة ضعفت عن مقاومتهن فدخل السقم بغلبتهن إياها وضعفها عن مقاومتهن فعلم الطب أن يزيد في الناقص أو ينقص من الزائد طلب الاعتدال‏\n\n\nفي كلام طويل عن الله تعالى ذكرناه في الموعظة الحسنة\n\n\n### [مداوى الكلوم والآثار العلوية]\n\n\nفكان هذا الإمام من أعلم الناس بهذا النش‏ء الطبيعي وما للعالم العلوي فيه من الآثار المودعة في أنوار الكواكب وسباحتها وهو الأمر الذي أوحى الله في السموات وفي اقتراناتها وهبوطها وصعودها وأوجها وحضيضها قال تعالى وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها وقال في الأرض وقَدَّرَ فِيها أَقْواتَها وكان لهذا الشخص فيما ذكرناه مجال رحب وباع متسع وقدم راسخة لكن ما تعدت قوته في النظر الفلك السابع من باب الذوق والحال لكن حصل له ما في الفلك المكوكب والأطلس بالكشف والاطلاع وكان الغالب عليه قلب الأعيان في زعمه والأعيان لا تنقلب عندنا جملة واحدة فكان هذا الشخص لا يبرح يسبح بروحانيته من حيث رصده وفكره مع المقابل في درجه ودقائقه وكان عنده من أسرار إحياء الموات عجائب وكان مما خصه الله به أنه ما حل بموضع قد أجدب إلا أوجد الله فيه الخصب والبركة كما\n\n\nروينا عن رسول الله صلى الله عليه وسلم في خضر رضي الله عنه وقد سئل عن اسمه بخضر فقال صلى الله عليه وسلم ما قعد على فروة إلا اهتزت تحته خضراء\n\n\n### [المعرفة الذاتية وعلم القوة]\n\n\nوكان هذا الإمام له تلميذ كبير في المعرفة الذاتية وعلم القوة وكان يتلطف بأصحابه في التنبيه عليه ويستر عن عامة أصحابه ذلك خوفا عليه منهم ولذلك سمي مداوي الكلوم كما استكتم يعقوب يوسف عليهما السلام حذرا عليه من إخوته وكان يشغل عامة أصحابه بعلم التدبير ومثل ذلك مما يشاكل هذا الفن من تركيب الأرواح في الأجساد وتحليل الأجساد وتأليفها بخلع صورة عنها أو خلع صورة عليها ليقفوا من ذلك على صنعة الله العليم الحكيم وعن هذا القطب خرج علم العالم وكونه إنسانا كبيرا وإن الإنسان مختصرة في الجرمية مضاهية في المعنى فأخبرني الروح الذي أخذت منه ما أودعته في هذا الكتاب أنه جمع أصحابه يوما في دسكرة وقام فيهم خطيبا وكانت عليه مهابة فقال افهموا عني ما أرمزه لكم في مقامي هذا وفكروا فيه واستخرجوا كنزه واتساع زمانه في أي عالم هو وإني لكم ناصح ومأكل ما يدري يذاع فإنه لكل علم أهل يختص بهم وما يتمكن الانفراد ولا يسع الوقت فلا بد أن يكون في الجمع فطر مختلفة وأذهان غير مؤتلفة والمقصود من الجماعة واحد إياه أقصد بكلامي وبيده مفتاح رمزى ولكل مقام مقال ولكل علم رجال ولكل وارد حال فافهموا عني ما أقول وعوا ما تسمعون فبنور النور أقسمت وبروح الحياة وحياة الروح آليت إني عنكم لمنقلب من حيث جئت وراجع إلى الأصل الذي عنه وجدت فقد طال مكثي في هذه الظلمة وضاق نفسي بترادف هذه الغمة وإني سألت الرحلة عنكم وقد أذن لي في الرحيل فأثبتوا على كلامي فتعقلون ما أقول بعد انقضاء سنين عينها وذكر عددها فلا تبرحوا حتى آتيكم بعد هذه المدة وإن برحتم فلتسرعوا إلى هذا المجلس الكرة وإن لطف مغناه وغلب على الحرف معناه فالحقيقة الحقيقة والطريقة الطريقة فقد اشتركت الجنة والدنيا في اللبن والبناء وإن كانت الواحدة من طين وتبن والأخرى من عسجد ولجين هذا ما كان من وصيته لبنيه وهذه مسألة عظيمة رمزها وراح فمن عرفها استراح‏\n\n\n### [لقاء ابن عربي بابن رشد في قرطبة]\n\n\nولقد دخلت يوما بقرطبة على قاضيها أبي الوليد بن رشد وكان يرغب في لقائي لما سمع وبلغه ما فتح الله به علي في خلوتي فكان يظهر التعجب مما سمع فبعثني والدي إليه في حاجة قصدا منه حتى يجتمع بي فإنه كان من أصدقائه وأنا صبي ما بقل‏\nوجهي ولا طر شاربي فعند ما دخلت عليه قام من مكانه إلى محبة وإعظاما فعانقني وقال لي نعم قلت له نعم فزاد فرحه بي لفهمي عنه ثم إني استشعرت بما أفرحه من ذلك فقلت له لا فانقبض وتغير لونه وشك فيما عنده وقال كيف وجدتم الأمر في الكشف والفيض الإلهي هل هو ما أعطاه لنا النظر قلت له نعم لا وبين نعم ولا تطير الأرواح من موادها والأعناق من أجسادها فاصفر لونه وأخذه الأفكل وقعد يحوقل وعرف ما أشرت به إليه وهو عين هذه المسألة التي ذكرها هذا القطب الإمام أعني مداوي الكلوم وطلب بعد ذلك من أبى الاجتماع بنا ليعرض ما عنده علينا هل هو يوافق أو يخالف فإنه كان من أرباب الفكر والنظر العقلي فشكر الله تعالى الذي كان في زمان رأى فيه من دخل خلوته جاهلا وخرج مثل هذا الخروج من غير درس ولا بحث ولا مطالعة ولا قراءة وقال هذه حالة أثبتناها وما رأينا لها أربابا فالحمد لله الذي أنا في زمان فيه واحد من أربابها الفاتحين مغالق أبوابها والحمد لله الذي خصني برؤيته ثم أردت الاجتماع به مرة ثانية فأقيم لي رحمه الله في الواقعة في صورة ضرب بيني وبينه فيها حجاب رقيق أنظر إليه منه ولا يبصرني ولا يعرف مكاني وقد شغل بنفسه عني فقلت إنه غير مراد لما نحن عليه فما اجتمعت به حتى درج وذلك سنة خمس وتسعين وخمسمائة بمدينة مراكش ونقل إلى قرطبة وبها قبره ولما جعل التابوت الذي فيه جسده على الدابة جعلت تواليفه تعادله من الجانب الآخر وأنا واقف ومعي الفقيه الأديب أبو الحسين محمد بن جبير كاتب السيد أبي سعيد وصاحبي أبو الحكم عمر وابن السراج الناسخ فالتفت أبو الحكم إلينا وقال أ لا تنظرون إلى من يعادل الإمام ابن رشد في مركوبه هذا الإمام وهذه أعماله يعني تواليفه فقال له ابن جبير يا ولدي نعم ما نظرت لا فض فوك فقيدتها عندي موعظة وتذكرة رحم الله جميعهم وما بقي من تلك الجماعة غيري وقلنا في ذلك‏\n\n\n> هذا الإمام وهذه أعماله *** يا ليت شعري هل أتت آماله‏\n\n\n### [مداوي الكلوم وعلم الفلك‏]\n\n\nوكان هذا القطب مداوي الكلوم قد أظهر سر حركة الفلك وأنه لو كان على غير هذا الشكل الذي أوجده الله عليه لم يصح أن يتكون شي‏ء في الوجود الذي تحت حيطته وبين الحكمة الإلهية في ذلك ليرى الألباب علم الله في الأشياء وإِنَّهُ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ لا إله إلا هو العليم الحكيم وفي معرفة الذات والصفات علم ما أشار إليه هذا القطب فلو تحرك غير المستدير لما عمر الخلأ بحركته وكانت أحياز كثيرة تبقي في الخلأ فكان لا يتكون عن تلك الحركة تمام أمر وكان ينقص منه قدر ما نقص من عمارة تلك الأحياز بالحركة وذلك بمشيئة الله تعالى وحكمته الجارية في وضع الأسباب وأخبر هذا القطب أن العالم موجود ما بين المحيط والنقطة على مراتبهم وصغر أفلاكهم وعظمها وأن الأقرب إلى المحيط أوسع من الذي في جوفه فيومه أكبر ومكانه أفسح ولسانه أفصح وهو إلى التحقق بالقوة والصفاء أقرب وما انحط إلى العناصر نزل عن هذه الدرجة حتى إلى كرة الأرض وكل جزء في كل محيط يقابل ما فوقه وما تحته بذاته لا يزيد واحد على الآخر شي‏ء وإن اتسع الواحد وضاق الآخر وهذا من إيراد الكبير على الصغير والواسع على الضيق من غير أن يوسع الضيق أو يضيق الواسع والكل ينظر إلى النقطة بذواتهم والنقطة مع صغرها تنظر إلى كل جزء من المحيط بها بذاتها فالمختصر المحيط والمختصر منه النقطة وبالعكس فانظر ولما انحط الأمر إلى العناصر حتى انتهى إلى الأرض كثر عكره مثل الماء في الحب والزيت وكل مائع في الدن ينزل إلى أسفله عكره ويصفو أعلاه والمعنى في ذلك ما يجده عالم الطبيعة من الحجب المانعة عن إدراك الأنوار من العلوم والتجليات بكدورات الشهوات والشبهات الشرعية وعدم الورع في اللسان والنظر والسماع والمطعم والمشرب والملبس والمركب والمنكح وكدورات الشهوات بالانكباب عليها والاستفراغ فيها وإن كانت حلالا وإنما لم يمنع نيل الشهوات في الآخرة وهي أعظم من شهوات الدنيا من التجلي لأن التجلي هناك على الأبصار وليست الأبصار بمحل للشهوات والتجلي هنا في الدنيا إنما هو على البصائر والبواطن دون الظاهر والبواطن محل الشهوات ولا يجتمع التجلي والشهوة في محل واحد فلهذا جنح العارفون والزهاد في هذه الدنيا إلى التقليل من نيل شهواتها والشغل بكسب حطامها\n\n\n### [مراتب الابدال‏]\n\n\nوهذا الإمام هو الذي أعلم أصحابه أن ثم رجالا سبعة يقال لهم الأبدال يحفظ الله بهم الأقاليم السبعة لكل بدل إقليم وإليهم تنظر روحانيات السموات السبع ولكل شخص منهم قوة\nمن روحانيات الأنبياء الكائنين في هذه السموات وهم إبراهيم الخليل يليه موسى يليه هارون يتلوه إدريس يتلوه يوسف يتلوه عيسى يتلوه آدم سلام الله عليهم أجمعين وأما يحيى فله تردد بين عيسى وبين هارون فينزل على قلوب هؤلاء الأبدال السبعة من حقائق هؤلاء الأنبياء عليهم السلام وتنظر إليهم هذه الكواكب السبعة بما أودع الله تعالى في سبحاتها في أفلاكها وبما أودع الله في حركات هذه السموات السبع من الأسرار والعلوم والآثار العلوية والسفلية قال تعالى وأَوْحى‏ في كُلِّ سَماءٍ أَمْرَها فلهم في قلوبهم في كل ساعة وفي كل يوم بحسب ما يعطيه صاحب تلك الساعة وسلطان ذلك اليوم‏\n\n\n### [الإقليم الرابع وبدله‏]\n\n\nفكل أمر علمي يكون في يوم الأحد فمن مادة إدريس عليه السلام وكل أثر علوي يكون في ذلك اليوم في عنصر الهواء والنار فمن سباحة الشمس ونظرها المودع من الله تعالى فيها وما يكون من أثر في عنصر الماء والتراب في ذلك اليوم فمن حركة الفلك الرابع وموضع هذا الشخص الذي يحفظه من الأقاليم الإقليم الرابع فمما يحصل لهذا الشخص المخصوص من الأبدال بهذا الإقليم من العلوم علم أسرار الروحانيات وعلم النور والضياء وعلم البرق والشعاع وعلم كل جسم مستنير ولما ذا استنار وما المزاج الذي أعطاه هذا القبول مثل الحباحب من الحيوان وكأصول شجر التين من النبات وكحجر المها والياقوت وبعض لحوم الحيوان وعلم الكمال في المعدن والنبات والحيوان والإنسان والملك وعلم الحركة المستقيمة حيثما ظهرت في حيوان أو نبات وعلم معالم التأسيس وأنفاس الأنوار وعلم خلع الأرواح المدبرات وإيضاح الأمور المبهمات وحل المشكل من المسائل الغامضة وعلم النغمات الفلكية والدولابية وأصوات آلات الطرب من الأوتار وغيرها وعلم المناسبة بينها وبين طبائع الحيوان وما للنبات منها وعلم ما إليه تنتهي المعاني الروحانية والروائح العطرية وما المزاج الذي عطرها ولما ذا ترجع وكيف ينقلها الهواء إلى الإدراك الشمي وهل هو جوهر أو عرض كل ذلك يناله ويعلمه صاحب ذلك الإقليم في ذلك اليوم وفي سائر الأيام في ساعات حكم حركة ذلك الفلك وحكم ما فيه من الكواكب وما فيه من روحانية النبي هكذا إلى تمام دورة الجمعة\n\n\n### [الإقليم السابع وبدله‏]\n\n\nوكل أمر علمي يكون في يوم الإثنين فمن روحانية آدم عليه السلام وكل أثر علوي في عنصر الهواء والنار فمن سباحة القمر وكل أثر سفلي في عنصر الماء والتراب فمن حركة فلك السماء الدنيا ولهذا الشخص الإقليم السابع فما يحصل لهذا البدل من العلوم في نفسه في يوم الإثنين وفي كل ساعة من ساعات أيام الجمعة مما يكون لهذا الفلك حكم فيها علم السعادة والشقاء وعلم الأسماء وما لها من الخواص وعلم المد والجزر والربو والنقص‏\n\n\n### [الإقليم الثالث وبدله‏]\n\n\nوكل أمر علمي يكون في يوم الثلاثاء فمن روحانية هارون عليه السلام وكل أثر علوي في عنصر النار والهواء فمن روحانية الأحمر وكل أثر سفلي في ركن الماء والتراب فمن حركة الفلك الخامس ولهذا البدل من الأقاليم الإقليم الثالث فما يعطيه من العلوم في هذا اليوم وفي ساعاته من الأيام علم تدبير الملك وسياسته وعلم الحمية والحماية وترتيب الجيوش والقتال ومكايد الحروب وعلم القرابين وذبح الحيوان وعلم أسرار أيام النحر وسريانه في سائر البقاع وعلم الهدى والضلال وتميز الشبهة من الدليل‏\n\n\n### [الإقليم السادس وبدله‏]\n\n\nوكل أمر علمي يكون في يوم الأربعاء فمن روحانية عيسى عليه السلام وهو يوم النور وكان له نظر إلينا في دخولنا في هذا الطريق التي نحن اليوم عليها وكل أثر في عنصر النار والهواء فمن روحانية سباحة الكاتب في فلكه وكل أثر سفلي في ركن الماء والتراب فمن حركة فلك السماء الثانية وللبدل صاحب هذا اليوم الإقليم السادس ومما يحصل له من العلوم في هذا اليوم وفي ساعته من الأيام علم الأوهام والإلهام والوحي والآراء والأقيسة والرؤيا والعبادة والاختراع الصناعي والعطردة وعلم الغلط الذي يعلق بعين الفهم وعلم التعاليم وعلم الكتابة والآداب والزجر والكهانة والسحر والطلسمات والعزائم‏\n\n\n### [الإقليم الثاني وبدله‏]\n\n\nوكل أمر علمي يكون في يوم الخميس فمن روحانية موسى عليه السلام وكل أثر علوي في ركن النار والهواء فمن سباحة المشتري وكل أثر سفلي في عنصر الماء والتراب فمن حركة فلكه ولهذا البدل من الأقاليم الإقليم الثاني ومما يحصل له من العلوم في هذا اليوم وفي ساعاته من الأيام علم النبات والنواميس وعلم أسباب الخير ومكارم الأخلاق وعلم القربات وعلم قبول الأعمال وأين ينتهي بصاحبها\n\n\n### [الإقليم الخامس وبدله‏]\n\n\nوكل أمر علمي يكون في يوم الجمعة يكون لهذا الشخص الذي يحفظ الله به الإقليم الخامس فمن روحانية يوسف عليه السلام وكل أثر علوي يكون في ركن النار والهواء فمن نظر كوكب الزهرة\nوكل أثر سفلي في ركن الماء والأرض فمن حركة فلك الزهرة وهو من الأمر الذي أوحى الله في كل سماء وهذه الآثار هي الأمر الإلهي الذي يتنزل بين السماء والأرض وهو في كل ما يتولد بينهما بين السماء بما ينزل منها وبين الأرض بما تقبل من هذا النزول كما يقبل رحم الأنثى الماء من الرجل للتكوين والهواء الرطب من الطير قال تعالى خَلَقَ سَبْعَ سَماواتٍ ومن الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ الله عَلى‏ كُلِّ شَيْ‏ءٍ قَدِيرٌ والقدرة ما لها تعلق إلا بالإيجاد فعلمنا إن المقصود بهذا التنزل إنما هو التكوين ومما يحصل له من العلوم في هذا اليوم وفي ساعاته من الأيام علم التصوير من حضرة الجمال والأنس وعلم الأحوال‏\n\n\n### [الإقليم الأول وبدله‏]\n\n\nوكل أمر علمي يكون في يوم السبت لهذا البدل الذي له حفظ الإقليم الأول فمن روحانية إبراهيم الخليل عليه السلام وما يكون فيه من أثر علوي في ركن النار والهواء فمن حركة كوكب كيوان في فلكه وما كان من أثر في العالم السفلي ركن الأرض والماء فمن حركة فلكه يقول تعالى في الكواكب السيارة كُلٌّ في فَلَكٍ يَسْبَحُونَ وقال تعالى وبِالنَّجْمِ هُمْ يَهْتَدُونَ فخلقها للاهتداء بها ومما يحصل له من العلوم في هذا اليوم وفي ساعاته من باقي الأيام ليلا ونهارا علم الثبات والتمكين وعلم الدوام والبقاء\n\n\n### [مقامات الابدال السبعة وهجيراهم‏]\n\n\nوعلم هذا الإمام بمقامات هؤلاء الأبدال وهجيراهم وقال إن مقام الأول وهجيره لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وسبب ذلك كون الأولية له إذ لو تقدم له مثل لما صحت له الأولية فذكره مناسب لمقامه ومقام الشخص الثاني في هجيره لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِماتُ رَبِّي وهو مقام العلم الإلهي وتعلقه لا ينتهي وهو الثاني من الأوصاف فإن أول الأوصاف الحياة ويليه العلم وهجير الشخص الثالث ومقامه وفي أَنْفُسِكُمْ أَ فَلا تُبْصِرُونَ وهي المرتبة الثالثة فإن الآيات الأول هي الأسماء الإلهية والآيات الثواني في الآفاق والآيات التي تلي الثواني في أنفسنا قال تعالى سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ فلهذا اختص بهذا الهجير الثالث من الأبدال ومقام الرابع في هجيره يا لَيْتَنِي كُنْتُ تُراباً وهو الركن الرابع من الأركان الذي يطلب المركز عند من يقول به فليس لنقطة الأكرة أقرب من الأرض وتلك النقطة كانت سبب وجود المحيط فهو يطلب القرب من الله موجد الأشياء ولا يحصل إلا بالتواضع ولا أنزل في التواضع من الأرض وهي منابع العلوم وتفجر الأنهار وكل ما ينزل من المعصرات فإنما هو من بخارات الرطوبات التي تصعد من الأرض فمنها تتفجر العيون والأنهار ومنها تخرج البخارات إلى الجو فتستحيل ماء فينزل غيثا فلهذا اختص الرابع بالرابع من الأركان ومقام الخامس فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ ولا يسأل إلا المولود فإنه في مقام الطفولة من الطفل وهو الندى قال تعالى أَخْرَجَكُمْ من بُطُونِ أُمَّهاتِكُمْ لا تَعْلَمُونَ شَيْئاً فلا يعلم حتى يسأل فالولد في المرتبة الخامسة لأن أمهاته أربعة وهن الأركان فكان هو العين الخامسة فلهذا كان السؤال هجير البدل الخامس من بين الأبدال وأما مقام السادس فهجيره أُفَوِّضُ أَمْرِي إِلَى الله وهي المرتبة السادسة فكانت للسادس وإنما كانت السادسة له لأنه في المرتبة الخامسة كما ذكرنا يسأل وقد كان لا يعلم فعند ما سأل علم ولما علم تحقق بعلمه بربه ففوض أمره إليه لأنه علم إن أمره ليس بيده منه شي‏ء وأن الله يَفْعَلُ ما يُرِيدُ فقال قد علمت إن الله لما ملكني أمري وهو يفعل ما يريد علمت إن التفويض في ذلك أرجح لي فلذلك اتخذه هجيرا ومقام السابع إِنَّا عَرَضْنَا الْأَمانَةَ وذلك أن لها الرتبة السابعة وكان أيضا تكوين آدم المعبر عنه بالإنسان في الرتبة السابعة فإنه عن عقل ثم نفس ثم هباء ثم فلك ثم فاعلان ثم منفعلان فهذه ستة ثم تكون الإنسان الذي هو آدم في الرتبة السابعة ولما كان وجود الإنسان في السنبلة ولها من الزمان في الدلالة سبعة آلاف سنة فوجد الإنسان في الرتبة السابعة من المدة فما حمل الأمانة إلا من تحقق بالسبعة وكان هذا هو السابع من الأبدال فلذلك اتخذ هجيراه هذه الآية فهذا قد بينا لك مراتب الأبدال‏\n\n\n### [خلفاء القطب مداوي الكلوم‏]\n\n\nوأخبرت أن هذا القطب الذي هو مداوي الكلوم كان في زمان حبسه في هيكله وولايته في العالم إذا وقف وقف لوقفته سبعون قبيلة كلهم قد ظهرت فيهم المعارف الإلهية وأسرار الوجود وكان أبدا لا يتعدى كلامه السبعة ومكث زمانا طويلا في أصحابه وكان يعين في زمانه من أصحابه شخصا فاضلا كان أقرب الناس إليه مجلسا كان اسمه المستسلم فلما درج هذا الإمام ولي مقامه في القطبية المستسلم وكان غالب علمه علم الزمان وهو علم شريف منه يعرف الأزل ومنه ظهر قوله عليه السلام كان الله ولا شي‏ء معه وهذا علم لا يعلمه إلا الأفراد من الرجال وهو المعبر عنه بالدهر الأول‏\nودهر الدهور وعن هذا الأزل وجد الزمان وبه تسمى الله بالدهر وهوقوله عليه السلام لا تسبوا الدهر فإن الله هو الدهر\n\n\nوالحديث صحيح ثابت ومن حصل له علم الدهر لم يقف في شي‏ء ينسبه إلى الحق فإن له الاتساع الأعظم ومن هذا العلم تعددت المقالات في الإله ومنه اختلفت العقائد وهذا العلم يقبلها كلها ولا يرد منها شيئا وهو العلم العام وهو الظرف الإلهي وأسراره عجيبة ما له عين موجودة وهو في كل شي‏ء حاكم يقبل الحق نسبته ويقبل الكون نسبته هو سلطان الأسماء كلها المعينة والمغيبة عنا فكان لهذا الإمام فيه اليد البيضاء وكان له من علمه بدهر الدهور علم حكمة الدنيا في لعبها بأهلها ولم سمي لعبا والله أوجده وكثيرا ما ينسب اللعب إلى الزمان فيقال لعب الزمان بأهله وهو متعلق السابقة وهو الحاكم في العاقبة وكان هذا الإمام يذم الكسب ولا يقول به مع معرفته بحكمته ولكن كان يرقى بذلك هم أصحابه عن التعلق بالوسائط أخبرت أنه ما مات حتى علم من أسرار الحق في خلقه ستة وثلاثين ألف علم وخمسمائة علم من العلوم العلوية خاصة ومات رحمه الله وولي بعده شخص فاضل اسمه مظهر الحق عاش مائة وخمسين سنة ومات وولي بعده الهائج وكان كبير الشأن ظهر بالسيف عاش مائة وأربعين سنة مات مقتولا في غزاة كان الغالب على حاله من الأسماء الإلهية القهار ولما قتل ولي بعده شخص يقال له لقمان والله أعلم وكان يلقب واضع الحكم عاش مائة وعشرين سنة كان عارفا بالترتيب والعلوم الرياضية والطبيعية والإلهية وكان كثير الوصية لأصحابه فإن كان هو لقمان فقد ذكر الله لنا ما كان يوصي به ابنه مما يدل على رتبته في العلم بالله وتحريضه على القصد والاعتدال في الأشياء في عموم الأحوال ولما مات رحمه الله وكان في زمان داود عليه السلام ولي بعده شخص اسمه الكاسب وكانت له قدم راسخة في علم المناسبات بين العالمين والمناسبة الإلهية التي وجد لها العالم على هذه الصورة التي هو عليها كان هذا الإمام إذا أراد إظهار أثر ما في الوجود نظر في نفسه إلى المؤثر فيه من العالم العلوي نظرة مخصوصة على وزن معلوم فيظهر ذلك الأثر من غير مباشرة ولا حيلة طبيعية وكان يقول إن الله أودع العلم كله في الأفلاك وجعل الإنسان مجموع رقائق العالم كله فمن الإنسان إلى كل شي‏ء في العالم رقيقة ممتدة من تلك الرقيقة يكون من ذلك الشي‏ء في الإنسان ما أودع الله عند ذلك الشي‏ء من الأمور التي أمنه الله عليها ليؤديها إلى هذا الإنسان وبتلك الرقيقة يحرك الإنسان العارف ذلك الشي‏ء لما يريده فما من شي‏ء في العالم إلا وله أثر في الإنسان وللإنسان أثر فيه فكان لهذا كشف هذه الرقائق ومعرفتها وهي مثل أشعة النور عاش هذا الإمام ثمانين سنة ولما مات ورثه شخص يسمى جامع الحكم عاش مائة وعشرين سنة له كلام عظيم في أسرار الأبدال والشيخ والتلميذ وكان يقول بالأسباب وكان قد أعطى أسرار النبات وكان له في كل علم يختص بأهل هذا الطريق قدم وفيما ذكرناه في هذا الباب غنية والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Fifteen: Concerning the Knowledge of the Breaths (الأنفاس), the Knowledge of their Realized Poles (أقطابها المحققين), and their Secrets\n\n> The world of Breaths is from my soul,\n> And they are the highest in Holiness.\n> Their chosen one is a master of eloquence,\n> Whose revelation comes to him in the ringing sound.\n> I said to the gatekeeper when he saw\n> What I suffered from the guards,\n> He said, \"What do you seek, my son?\"\n> I replied, \"The proximity of the noble Master.\"\n> Who is my intercessor to the Imam? Perhaps\n> A fleeting thought from him for one who steals a glance.\n> He said, \"He does not grant his favors\n> To a rich man who is not distressed.\"\n\n### The First Pole: The Healer of Wounds (مداوي الكلوم)\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Indeed, the Breath of the All-Merciful (نفس الرحمن) comes to me from the direction of Yemen.\"\n\nIt is said that the Ansar (Helpers) were the means by which Allah relieved His Prophet, peace and blessings be upon him, from the suffering he endured from the disbelieving polytheists. These Breaths (الأنفاس) are the fragrances of Divine Proximity (القرب الإلهي). When the nostrils of the Gnostics (العارفين) inhaled them, they recognized these Breaths, and their motives were strengthened to seek a realized Pole (قطب) firmly established in that most Holy Station (المقام الأقدس), who would inform them of what lay hidden within that station. The fragrance brought by these Breaths is nothing but a breath of secrets and sciences, which they recognized, after diligent striving and exposure to the breezes of Divine Generosity, in a Divine Personage who possessed the secret they sought and the knowledge they wished to acquire. The Real (الحق) established him among them as a Pole around whom their celestial sphere revolves, and by whom their dominion is maintained. He is called the Healer of Wounds (مداوي الكلوم). From him spread among them knowledge, wisdom, and secrets that no book can enumerate.\n\n### The Healer of Wounds and the Science of Alchemy (علم الكيمياء)\n\nThe first secret revealed to him was the First Age (الدهر الأول) from which all ages were constituted, and the first act granted to him was the act required by the spirituality (روحانية) of the Seventh Heaven, the heaven of Saturn (كيوان). Thus, he could transform iron into silver through management and craft, and transform iron into gold through inherent property—a wondrous secret. He did not seek this out of desire for wealth, but out of desire for the beauty of the outcome (حسن المال), so that he might thereby stand upon the rank of perfection (رتبة الكمال) and realize that it is acquired in formation (التكوين).\n\nThe first rank of the condensation of metallic vapors through celestial movements and natural heat is mercury and sulfur. Every formed thing in the mineral kingdom seeks the ultimate goal, which is perfection, namely gold. However, accidental defects and diseases afflict it in the mine—such as excessive dryness, excessive moisture, heat, or cold—which remove it from equilibrium (الاعتدال). This disease then imparts a form called iron, copper, lead, or other minerals. This Sage (الحكيم) was granted knowledge of the remedies and medicines whose application removes that accidental defect (العلة الطارئة) from the essence of this seeker of the degree of perfection among minerals, which is gold. He removed the defect, so the metal became sound and progressed until it reached the degree of perfection. However, it does not possess the strength in perfection that the sound metal which never suffered disease possesses. For a body that has been afflicted by disease is far from achieving the pristine and unadulterated purity (الخلاص الأصلي) enjoyed by Yahya (John) among the Prophets and Adam, peace be upon them.\n\nThe ultimate purpose was nothing but the degree of human perfection (الكمال الإنساني) in servitude (*Ubudiyya*). For Allah created man in <<أَحْسَنِ تَقْوِيمٍ>> (the fairest stature), then reduced him to <<أَسْفَلَ سَافِلِينَ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ>> (the lowest of the low, except those who believe and do righteous deeds), who maintained their original soundness. This is because, by his nature, man acquired the defects of accidents and the diseases of purposes. This Sage desired to restore him to the fairest stature in which Allah created him. This was the intention of the rational person in knowing this craft called Alchemy (الكيمياء), which is nothing but the knowledge of measures and weights (المقادير والأوزان).\n\n### The Human Constitution (النشأة الإنسانية)\n\nWhen Allah created man, Adam, who is the origin of this human constitution and the physical, natural, elemental form, He composed his body from hot and cold, moist and dry—or rather, from cold-dry, cold-moist, hot-moist, and hot-dry. These are the four humors (الأخلاط الأربعة): black bile, phlegm, blood, and yellow bile, just as they are in the macrocosm (العالم الكبير): fire, air, water, and earth.\n\nAllah created Adam’s body from clay (طين), which is the mixture of water and earth, then breathed into him a soul (نفسا) and a spirit (روحا). It has been related in the first prophecy, in some books revealed to a prophet among the Children of Israel—whose exact text I do not recall now, though there is a need to mention it, for the most truthful reports are those narrated from Allah the Almighty—that we narrated from Maslama ibn Waddah, with a chain of transmission to him, and he was from Cordoba, who said:\n\nAllah said in some of what He revealed to the prophets of the Children of Israel: \"I created Adam from dust and water, and I breathed into him a soul and a spirit. I perfected his body from the dust, his moisture from the water, his heat from the soul, and his coldness from the spirit.\" He then said: \"Then I placed in the body, after this, four other types, none of which can subsist without the others: the two biles, blood, and phlegm. Then I settled some of them within others. I made the dwelling of dryness in the black bile, the dwelling of heat in the yellow bile, the dwelling of moisture in the blood, and the dwelling of coldness in the phlegm.\" Then He, glorified be His praise, said: \"Any body in which these humors are balanced (اعتدلت) will have complete health and an equilibrated structure. If one of them increases over the others and overpowers them, sickness will enter the body in proportion to the increase. If one is deficient, it will be too weak to resist the others, and sickness will enter due to their dominance and its weakness in resisting them.\" Thus, the science of medicine (علم الطب) seeks equilibrium by increasing the deficient or decreasing the excessive.\n\nThis is part of a long discourse from Allah the Almighty, which we mentioned in *Al-Maw'izah al-Hasana* (The Good Admonition).\n\n### The Healer of Wounds and Celestial Influences (الآثار العلوية)\n\nThis Imam was among the most knowledgeable people concerning this natural generation (النش‏ء الطبيعي) and the influences (الآثار) of the celestial world (العالم العلوي) deposited in the lights and movements of the stars. This is the command that Allah revealed in the heavens, in their conjunctions, descents, ascents, apogees, and perigees. Allah the Almighty said: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command). And He said concerning the Earth: <<وَقَدَّرَ فِيهَا أَقْوَاتَهَا>> (And He determined therein its provisions).\n\nThis personage had a wide field of action, an extensive reach, and firm footing in what we have mentioned. However, his power in astronomical observation did not exceed the Seventh Heaven in terms of direct tasting (*Dhawq*) and spiritual state (*Haal*). Yet, he attained knowledge of the Starry Sphere (الفلك المكوكب) and the Atlas Sphere (الأطلس) through Unveiling (*Kashf*) and direct observation. What dominated him was the belief in the transmutation of essences (قلب الأعيان) in his estimation, though essences are not wholly transmuted according to us.\n\nThis personage constantly engaged in spiritual contemplation (يسبح بروحانيته) based on his observation and thought, corresponding to the degree and minutes of the celestial body opposite him. He possessed wondrous secrets concerning the revivification of the dead (إحياء الموات). Among the things Allah specifically granted him was that wherever he settled in a barren place, Allah brought forth fertility and blessing therein, just as\n\nWe narrated concerning the Messenger of Allah, peace and blessings be upon him, regarding Al-Khidr, may Allah be pleased with him, when he was asked about his name, the Prophet, peace and blessings be upon him, said: \"He never sat upon a barren patch of earth (*farwah*) except that it vibrated beneath him, turning green (*khadraa*).\"\n\n### Self-Knowledge and the Science of Power (المعرفة الذاتية وعلم القوة)\n\nThis Imam had a great disciple in Essential Gnosis (المعرفة الذاتية) and the Science of Power (علم القوة). He was gentle with his companions in drawing attention to this disciple, but he concealed him from the general body of his companions out of fear for him from them. This is why he was named the Healer of Wounds (مداوي الكلوم), just as Jacob concealed Joseph, peace be upon them, fearing his brothers.\n\nHe occupied his general companions with the science of management (*Tadbir*) and similar arts, such as the composition of spirits in bodies, the analysis of bodies, and their synthesis by removing a form from them or imposing a form upon them, so that they might thereby recognize the craftsmanship of Allah, the All-Knowing, the Wise.\n\nFrom this Pole emerged the knowledge that the World (العالم) is a Great Human (إنسانا كبيرا) and that the human being is a concise summary in physical form, corresponding in meaning.\n\nThe Spirit from whom I received what I have deposited in this book informed me that the Pole once gathered his companions in a village and stood among them as a speaker, possessing great awe. He said: \"Understand from me what I symbolize for you in this station of mine, reflect upon it, extract its treasure, and determine the extent of its time in which world it resides. I am a sincere advisor to you, and food that is not known is broadcast. For every science has people specific to it. Isolation is not possible, and time is not sufficient, so there must be different temperaments and unharmonious minds in the gathering. The intended recipient of the group is one, whom I address with my speech, and in whose hand is the key to my symbol. For every station there is a discourse, for every science there are men, and for every incoming state there is a spiritual condition. So understand what I say and comprehend what you hear. By the Light of Light (بنور النور) I swear, and by the Spirit of Life (بروح الحياة) and the Life of the Spirit (وحياة الروح) I vow, I am departing from you whence I came, and returning to the Origin (الأصل) from which I was found. My stay in this darkness has been long, and my soul is constrained by the succession of this grief. I have requested permission to travel from you, and permission has been granted. So remain steadfast upon my words, and you will understand what I say after the passing of a specified number of years. Do not depart until I return to you after this period. If you must depart, hasten back to this assembly. If its meaning is subtle and its meaning dominates the letter, then Reality is Reality (الحقيقة الحقيقة) and the Path is the Path (الطريقة الطريقة). The Garden (Janna) and the World (Dunya) have shared in the milk and the structure (اللبن والبناء), even though one is of clay and straw, and the other of gold and silver.\"\n\nThis was his counsel to his sons. This is a great issue that he symbolized and then departed. Whoever recognizes it finds rest.\n\n### Ibn Arabi’s Meeting with Ibn Rushd in Cordoba\n\nI once entered Cordoba and visited its judge, Abu al-Walid Ibn Rushd (Averroes). He desired to meet me because of what he had heard and what had reached him concerning the spiritual openings (*Fath*) Allah had granted me in my seclusion (*Khalwa*). He expressed astonishment at what he heard. My father sent me to him on an errand, intending for me to meet him, as he was one of my father’s friends. I was a boy whose face was not yet bearded and whose mustache had not yet grown.\n\nWhen I entered upon him, he rose from his place out of affection and reverence, embraced me, and said, \"Yes?\" I replied, \"Yes.\" His joy in me increased because I understood him. Then, sensing what had made him happy, I said to him, \"No.\" He became troubled, his color changed, and he doubted what he possessed. He asked, \"How did you find the matter in Unveiling (*Kashf*) and Divine Effusion (*Fayd*): is it what our rational speculation (*Nazar*) gave us?\" I replied, \"Yes, no. And between 'Yes' and 'No,' spirits fly from their substances and necks from their bodies.\" His color turned yellow, he was seized by trembling, and he recited the *Hawqala* (There is no power nor strength save in Allah). He understood what I had alluded to, which is the very essence of the issue mentioned by this Pole, the Imam, meaning the Healer of Wounds.\n\nAfter that, he requested my father to arrange another meeting with us so that he might present his findings to us, to see whether they agreed or disagreed, for he was one of the masters of intellectual thought and rational speculation. He thanked Allah the Almighty that he lived in a time when he saw someone who entered his seclusion ignorant and emerged with such an outcome, without study, research, reading, or recitation. He said, \"This is a state we affirmed, but we never saw anyone who possessed it. Praise be to Allah that I am in a time when there is one of its masters, who opens the locked doors.\" And praise be to Allah who favored me with seeing him.\n\nI later desired to meet him a second time, but he was shown to me, may Allah have mercy on him, in a vision (*Waqi'a*) in a form where a thin veil (حجاب رقيق) was placed between us. I could look at him through it, but he could not see me or know my location. He was preoccupied with himself, away from me. I said, \"He is not desired for what we are upon.\" I did not meet him again until he passed away, which was in the year 595 AH in the city of Marrakesh. He was transported to Cordoba, where his grave is. When the coffin containing his body was placed upon the beast, his writings (تواليفه) were placed on the other side to balance him. I was standing there with the learned jurist Abu al-Husayn Muhammad ibn Jubayr, the secretary of Sayyid Abu Sa'id, and my companion Abu al-Hakam Umar ibn al-Sarraj, the copyist. Abu al-Hakam turned to us and said, \"Do you not look at who balances Imam Ibn Rushd on his mount? This is the Imam, and these are his works.\" Ibn Jubayr said to him, \"My son, what an excellent observation! May your mouth never lack teeth.\" I recorded this as an admonition and a reminder. May Allah have mercy on all of them. None of that group remains but me. We said concerning that:\n\n> This is the Imam, and these are his works.\n> Oh, would that I knew if his hopes were realized.\n\n### The Healer of Wounds and the Science of Astronomy (علم الفلك)\n\nThis Pole, the Healer of Wounds (مداوي الكلوم), revealed the secret of the motion of the celestial sphere (حركة الفلك) and explained that if it were not in the shape in which Allah created it, nothing under its circumference could be formed in Existence (الوجود). He clarified the Divine Wisdom (الحكمة الإلهية) in this, so that minds might perceive Allah’s knowledge in things, <<وَإِنَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ>> (and indeed He is All-Knowing of everything). There is no god but He, the All-Knowing, the Wise. The knowledge of the Essence (الذات) and the Attributes (الصفات) contains the knowledge to which this Pole alluded.\n\nIf a non-spherical body were to move, the void (الخلأ) would not be filled by its motion, and many spaces would remain empty in the void. Consequently, the formation resulting from that motion would be incomplete, lacking the amount that was missed in the filling of those spaces by the movement. This is by the Will of Allah the Almighty and His Wisdom operating in the establishment of causes.\n\nThis Pole informed us that the World (العالم) exists between the Circumference (المحيط) and the Point (النقطة) according to their ranks, the smallness and greatness of their spheres. The sphere closest to the Circumference is wider than the one within it; its day is greater, its space is vaster, and its tongue is more eloquent. It is closer to realization (التحقق) and purity (الصفاء). As existence descends toward the elements (العناصر), it falls from this degree, down to the sphere of the Earth.\n\nEvery part in every circumference corresponds to what is above it and what is below it by its essence; none exceeds the other, even if one is vast and the other narrow. This is the transmission of the great to the small, and the vast to the narrow, without the narrow being widened or the vast being narrowed. All look toward the Point (النقطة) by their essences, and the Point, despite its smallness, looks toward every part of its circumference by its essence. Thus, the Circumference is the summary, and the Point is the summary of the Circumference, and vice versa. Reflect upon this.\n\nWhen the matter descended to the elements until it reached the Earth, its turbidity (عكره) increased, like water in a jar or oil in a vat, where the sediment sinks to the bottom and the top becomes clear. The meaning of this is the veils (الحجب) that the natural world finds, which prevent the perception of the Lights of Knowledge (أنوار من العلوم) and Theophanies (التجليات) due to the impurities of desires (الشهوات) and legal doubts (الشبهات الشرعية), and the lack of scrupulousness in speech, sight, hearing, food, drink, clothing, conveyance, and marriage. The impurities of desires arise from plunging into them and exhausting oneself in them, even if they are lawful.\n\nThe reason why the attainment of desires in the Hereafter—which are greater than the desires of this world—does not prevent Theophany (التجلي) is that Theophany there is upon the eyes (الأبصار), and the eyes are not the locus of desires. Theophany here in this world is upon the inner sights (البصائر) and the inner beings (البواطن), not the exterior, and the inner beings are the locus of desires. Theophany and desire do not gather in a single locus. For this reason, the Gnostics and ascetics in this world inclined toward minimizing the attainment of its desires and avoiding preoccupation with acquiring its perishable goods.\n\n### Ranks of the Substitutes (مراتب الابدال)\n\nThis Imam is the one who informed his companions that there are seven men called the Substitutes (الأبدال) by whom Allah preserves the Seven Climes (الأقاليم السبعة), with one Clime for each Substitute. The spiritualities (روحانيات) of the Seven Heavens look upon them. Each of these individuals possesses a power derived from the spiritualities of the Prophets residing in these heavens: Abraham the Friend (الخليل), followed by Moses, followed by Aaron, followed by Idris, followed by Joseph, followed by Jesus, followed by Adam, peace be upon them all. As for Yahya (John the Baptist), he oscillates between Jesus and Aaron.\n\nThe realities of these Prophets, peace be upon them, descend upon the hearts of these seven Substitutes. These seven planets look upon them with what Allah the Almighty has deposited in their lights within their spheres, and with the secrets, sciences, and celestial and terrestrial influences (الآثار العلوية والسفلية) that Allah has deposited in the movements of these seven heavens. Allah the Almighty said: <<وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا>> (And He revealed in every heaven its command). Thus, in their hearts, they receive knowledge every hour and every day according to what the master of that hour and the sovereign of that day grants.\n\n### The Fourth Clime and its Substitute\n\nEvery matter of knowledge that occurs on Sunday is from the substance of Idris, peace be upon him. Every celestial influence that occurs on that day in the element of air and fire is from the movement of the Sun (الشمس) and its gaze, which Allah has deposited within it. And every influence that occurs in the element of water and earth on that day is from the movement of the Fourth Heaven. The location of the person who preserves this Clime among the Substitutes is the Fourth Clime (الإقليم الرابع).\n\nAmong the sciences attained by this specific Substitute of this Clime are the science of the secrets of spiritualities, the science of light and radiance, the science of lightning and rays, the science of every luminous body, why it is luminous, and the temperament that granted it this receptivity—such as fireflies among animals, the roots of fig trees among plants, and the stone of the *Maha* (a type of quartz), ruby, and certain animal flesh. He also knows the science of perfection in minerals, plants, animals, humans, and angels; the science of straight movement wherever it appears in animal or plant; the science of the landmarks of foundation; the breaths of lights; the science of removing governing spirits; the clarification of ambiguous matters; the solution of difficult, obscure problems; the science of celestial and orbital melodies; the sounds of musical instruments, strings and otherwise; the science of the correspondence between them and the temperaments of animals and the share of plants in them; and the science of the ultimate destination of spiritual meanings and aromatic fragrances, the temperament that perfumed them, why they return, and how the air transmits them to the sense of smell—whether it is a substance or an accident. All this is attained and known by the master of that Clime on that day and on all other days during the hours governed by the movement of that sphere and the rule of the stars within it, and the spirituality of the Prophet therein, until the completion of the weekly cycle.\n\n### The Seventh Clime and its Substitute\n\nEvery matter of knowledge that occurs on Monday is from the spirituality of Adam, peace be upon him. Every celestial influence in the element of air and fire is from the movement of the Moon (القمر). Every terrestrial influence in the element of water and earth is from the movement of the sphere of the lowest heaven. This personage is assigned the Seventh Clime (الإقليم السابع). Among the sciences attained by this Substitute in himself on Monday and in every hour of the days of the week over which this sphere has dominion are the science of felicity and wretchedness (السعادة والشقاء), the science of the Names and their properties, and the science of ebb and flow, swelling and deficiency.\n\n### The Third Clime and its Substitute\n\nEvery matter of knowledge that occurs on Tuesday is from the spirituality of Aaron, peace be upon him. Every celestial influence in the element of fire and air is from the spirituality of Mars (الأحمر). Every terrestrial influence in the element of water and earth is from the movement of the Fifth Heaven. This Substitute is assigned the Third Clime (الإقليم الثالث). Among the sciences granted to him on this day and in its hours are the science of managing kingship and its politics, the science of protection and defense, the arrangement of armies and fighting, the stratagems of war, the science of sacrifices and the slaughter of animals, the secrets of the days of sacrifice and their flow throughout all regions, and the science of guidance and misguidance, and distinguishing doubt from proof.\n\n### The Sixth Clime and its Substitute\n\nEvery matter of knowledge that occurs on Wednesday is from the spirituality of Jesus, peace be upon him. It is the Day of Light, and he looked upon us when we entered this Path upon which we are today. Every influence in the element of fire and air is from the spirituality of the movement of Mercury (الكاتب) in its sphere. Every terrestrial influence in the element of water and earth is from the movement of the sphere of the Second Heaven. The Substitute who is the master of this day is assigned the Sixth Clime (الإقليم السادس). Among the sciences attained by him on this day and in its hours are the science of illusions (الأوهام), inspiration (الإلهام), revelation (الوحي), opinions, analogies, dreams, worship, industrial invention, the science of error that clings to the eye of understanding, the science of teachings, the science of writing and manners, admonition, soothsaying, sorcery, talismans, and incantations.\n\n### The Second Clime and its Substitute\n\nEvery matter of knowledge that occurs on Thursday is from the spirituality of Moses, peace be upon him. Every celestial influence in the element of fire and air is from the movement of Jupiter (المشتري). Every terrestrial influence in the element of water and earth is from the movement of its sphere. This Substitute is assigned the Second Clime (الإقليم الثاني). Among the sciences attained by him on this day and in its hours are the science of botany (النبات) and laws (النواميس), the science of the causes of goodness and noble character, the science of acts of proximity (القربات), and the science of the acceptance of deeds and where they lead their doer.\n\n### The Fifth Clime and its Substitute\n\nEvery matter of knowledge that occurs on Friday is for this personage by whom Allah preserves the Fifth Clime, and it is from the spirituality of Joseph, peace be upon him. Every celestial influence in the element of fire and air is from the gaze of the planet Venus (الزهرة). Every terrestrial influence in the element of water and earth is from the movement of the sphere of Venus. This is part of the command that Allah revealed in every heaven. These influences are the Divine Command (الأمر الإلهي) that descends between the heaven and the earth, and it is in everything that is generated between them—between the heaven by what descends from it, and the earth by what it accepts from this descent, just as the womb of the female accepts the water from the male for formation (التكوين), and the moist air from the bird. Allah the Almighty said: <<خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ>> (Allah created seven heavens and of the earth the like thereof. The Command descends between them, that you may know that Allah is over all things competent). Since competence (القدرة) is only related to bringing into existence (الإيجاد), we know that the purpose of this descent is formation (التكوين). Among the sciences attained by him on this day and in its hours are the science of formation/shaping (التصوير) from the Presence of Beauty (الجمال) and Intimacy (الأنس), and the science of spiritual states (الأحوال).\n\n### The First Clime and its Substitute\n\nEvery matter of knowledge that occurs on Saturday is for this Substitute who is assigned the preservation of the First Clime, and it is from the spirituality of Abraham the Friend (الخليل), peace be upon him. Whatever celestial influence occurs therein in the element of fire and air is from the movement of the planet Saturn (كيوان) in its sphere. Whatever influence occurs in the lower world, the element of earth and water, is from the movement of its sphere. Allah the Almighty says concerning the planets: <<كُلٌّ فِي فَلَكٍ يَسْبَحُونَ>> (All swim in an orbit). And He said: <<وَبِالنَّجْمِ هُمْ يَهْتَدُونَ>> (And by the star they are guided). He created them for guidance. Among the sciences attained by him on this day and in its hours, night and day, are the science of steadfastness (الثبات) and establishment (التمكين), and the science of permanence (الدوام) and subsistence (البقاء).\n\n### The Stations of the Seven Substitutes and their Litanies\n\nThis Imam knew the stations (*Maqamat*) of these Substitutes and their constant litanies (*Hajira*). He said that the station of the first and his litany is <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). The reason for this is his primacy (الأولية), for if he had a like preceding him, his primacy would not be sound. Thus, his mention is appropriate to his station.\n\nThe station of the second personage and his litany is <<لَنَفِدَ الْبَحْرُ قَبْلَ أَن تَنفَدَ كَلِمَاتُ رَبِّي>> (The sea would be exhausted before the Words of my Lord were exhausted). This is the station of Divine Knowledge (العلم الإلهي), whose relation has no end. It is the second of the Attributes, for the first Attribute is Life, followed by Knowledge.\n\nThe litany and station of the third personage is <<وَفِي أَنفُسِكُمْ أَفَلَا تُبْصِرُونَ>> (And in yourselves? Do you not see?). This is the third rank, for the first signs are the Divine Names, the second signs are in the horizons, and the signs following the second are in ourselves. Allah the Almighty said: <<سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ>> (We will show them Our signs in the horizons and within themselves). For this reason, the third of the Substitutes is specific to this litany.\n\nThe station of the fourth is his litany: <<يَا لَيْتَنِي كُنتُ تُرَابًا>> (Oh, would that I were dust). This is the fourth of the elements (الأركان), which seeks the center according to those who affirm it. Nothing is closer to the point of the sphere than the Earth. That point was the cause of the existence of the Circumference. Thus, he seeks proximity to Allah, the Originator of things, and this is only achieved through humility. Nothing is lower in humility than the Earth, which is the source of sciences and the bursting forth of rivers. Everything that descends from the rain clouds is only from the vapors of moisture that ascend from the Earth. From it, springs and rivers burst forth, and from it, vapors rise into the atmosphere and turn into water, descending as rain. For this reason, the fourth is specific to the fourth element.\n\nThe station of the fifth is: <<فَاسْأَلُوا أَهْلَ الذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ>> (So ask the people of the Remembrance if you do not know). Only the newborn asks, for he is in the station of infancy (الطفولة), which is the dew. Allah the Almighty said: <<أَخْرَجَكُم مِّن بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا>> (He brought you out of your mothers' wombs, knowing nothing). He does not know until he asks. The child is in the fifth rank because his mothers are four (the elements), so he is the fifth essence (العين الخامسة). For this reason, asking is the litany of the fifth Substitute among the Substitutes.\n\nAs for the station of the sixth, his litany is: <<أُفَوِّضُ أَمْرِي إِلَى اللَّهِ>> (I entrust my affair to Allah). This is the sixth rank, and it belongs to the sixth. It belongs to him because, in the fifth rank, as we mentioned, he asks, having been ignorant. When he asked, he learned. When he learned, he became realized in his knowledge of his Lord, so he entrusted his affair to Him, because he knew that he possessed nothing of his own affair and that Allah <<يَفْعَلُ مَا يُرِيدُ>> (does what He wills). He said: \"I have known that since Allah made me master of my affair, and He does what He wills, I know that entrusting the affair to Him is more advantageous for me.\" Therefore, he adopted this as his litany.\n\nThe station of the seventh is: <<إِنَّا عَرَضْنَا الْأَمَانَةَ>> (Indeed, We offered the Trust [al-Amana]). This is because it holds the seventh rank. Also, the formation of Adam, referred to as Man, was in the seventh rank: for it is from Intellect (*Aql*), then Soul (*Nafs*), then Haba (Primordial Dust), then Sphere (*Falak*), then Active Principles, then Passive Principles—these are six. Then Man, who is Adam, was formed in the seventh rank. Since the existence of Man is in the constellation Virgo (Sunbula), which signifies seven thousand years in time, Man was found in the seventh rank of duration. Only he who is realized in the number seven carried the Trust (الأمانة). Since this was the seventh of the Substitutes, he adopted this verse as his litany. Thus, we have clarified for you the ranks of the Substitutes.\n\n### Successors of the Pole The Healer of Wounds\n\nI was informed that this Pole, the Healer of Wounds (مداوي الكلوم), during the time of his confinement in his physical temple and his spiritual authority in the world, if he stood, seventy tribes would stand for his standing, all of whom had manifested Divine Gnosis (المعارف الإلهية) and the secrets of Existence (أسرار الوجود). His discourse never exceeded the number seven.\n\nHe remained among his companions for a long time. During his era, he designated a virtuous person among his companions who was the closest to him in assembly, whose name was *Al-Mustaslim* (The Submissive One). When this Imam passed away, Al-Mustaslim succeeded him in the station of the Pole. The dominant part of his knowledge was the Science of Time (علم الزمان), which is a noble science. From it, Pre-Eternity (الأزل) is known, and from it emerged the Prophet's saying, peace be upon him: \"Allah was, and there was nothing with Him.\" This is a knowledge known only to the unique individuals (الأفراد) among men, and it is referred to as the First Age (الدهر الأول) and the Age of Ages (دهر الدهور). From this Pre-Eternity, Time came into existence, and by it, Allah is named *Al-Dahr* (Time), as in the Prophet's saying, peace be upon him: \"Do not curse Time, for Allah is Time.\"\n\nThis hadith is sound and established. Whoever attains the knowledge of Time does not stop at anything he attributes to the Real (الحق), for it possesses the Greatest Vastness (الاتساع الأعظم). From this knowledge, the theological opinions concerning the Divine multiplied, and from it, creeds differed. This knowledge accepts all of them and rejects none; it is the Universal Knowledge (العلم العام). It is the Divine Vessel (الظرف الإلهي), and its secrets are wondrous. It has no existing essence, yet it is the ruler in everything, accepting the attribution of the Real and accepting the attribution of the cosmos. It is the sovereign of all the Names, both those designated and those hidden from us. This Imam had the \"White Hand\" (mastery) in it.\n\nFrom his knowledge of the Age of Ages, he possessed the science of the wisdom of the world in its playing with its inhabitants, and why it is called \"play,\" even though Allah brought it into existence. Play is often attributed to Time, as when it is said, \"Time played with its inhabitants.\" It is related to precedence (السابقة) and is the ruler in the outcome.\n\nThis Imam used to condemn acquisition (الكسب) and did not advocate for it, despite his knowledge of its wisdom, but he did so to elevate the aspiration of his companions above attachment to intermediaries (الوسائط).\n\nI was informed that he did not die until he knew thirty-six thousand and five hundred sciences of the celestial sciences specifically, concerning the secrets of the Real in His creation.\n\nHe died, may Allah have mercy on him, and was succeeded by a virtuous person named *Muzhir al-Haqq* (Manifestor of the Real). He lived 150 years and died.\n\nHe was succeeded by *Al-Ha'ij* (The Agitator), who was of great stature and appeared with the sword. He lived 140 years and died killed in a raid. The dominant Divine Name in his state was *Al-Qahhar* (The Subduer).\n\nWhen he was killed, he was succeeded by a person called *Luqman*, and Allah knows best. He was nicknamed *Wadi' al-Hikam* (The Setter of Wisdom). He lived 120 years. He was knowledgeable in arrangement, mathematical, natural, and Divine sciences. He gave much counsel to his companions. If he is the Luqman mentioned by Allah, then what He mentioned of his counsel to his son indicates his rank in the knowledge of Allah and his urging toward purposefulness and moderation in all circumstances.\n\nWhen he died, may Allah have mercy on him—and he was in the time of David, peace be upon him—he was succeeded by a person named *Al-Kasib* (The Acquirer). He had a firm footing in the science of correspondences (المناسبات) between the two worlds and the Divine Correspondence (المناسبة الإلهية) by which the world came into existence in its current form. When this Imam desired to manifest an effect in Existence, he would look into his soul at the celestial influencer with a specific gaze, according to a known measure, and that effect would appear without direct intervention or natural artifice. He used to say that Allah deposited all knowledge in the spheres, and He made Man the collection of all the subtle threads (رقائق) of the world. From Man, a subtle thread extends to everything in the world. Through that thread, what Allah deposited with that thing of the matters entrusted to it is conveyed to this human being. And by that thread, the Gnostic human moves that thing toward what he desires. There is nothing in the world that does not have an effect on Man, and Man has an effect on it. Thus, he was granted the Unveiling (*Kashf*) of these subtle threads and the knowledge of them, which are like rays of light. This Imam lived eighty years.\n\nWhen he died, he was inherited by a person called *Jami' al-Hikam* (Collector of Wisdom). He lived 120 years. He had profound discourse on the secrets of the Substitutes (الأبدال), the Shaykh, and the disciple. He affirmed the role of secondary causes (الأسباب) and was granted the secrets of botany (النبات). He had a firm footing in every science specific to the people of this Path.\n\nWhat we have mentioned in this chapter is sufficient. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "پندرھواں باب: سانسوں (الأنفاس) کی معرفت، ان کے محقق قطبوں کی معرفت، اور ان کے اسرار کے بیان میں۔\n\n(بسم الله الرحمن الرحيم)\n\n> سانسوں (الأنفاس) کا عالم میری جان سے ہے، *** اور وہ قدس (القدس) میں سب سے بلند ہیں۔\n> ان کے چنے ہوئے آقا فصیح اللسان ہیں، *** ان کی وحی گھنٹی کی آواز میں آتی ہے۔\n> میں نے دربان سے کہا جب اس نے دیکھا، *** جو میں پہرے داروں سے جھیل رہا تھا۔\n> اس نے کہا: اے میرے بیٹے! تم کیا چاہتے ہو؟ *** میں نے کہا: اس معزز آقا کا قرب۔\n> امام کے لیے میرا شفیع کون ہے، شاید *** ان کی ایک نگاہ کسی چوری کرنے والے پر پڑ جائے۔\n> اس نے کہا: وہ اپنی بخششیں *** کسی بے غم امیر کو نہیں دیتے۔\n\n### [پہلا قطب: مداوی الکلوم (زخموں کا علاج کرنے والا)]\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"بے شک رحمن کی سانس (نفس الرحمن) مجھے یمن کی طرف سے آتی ہے۔\"\n\nکہا گیا ہے کہ انصار کے ذریعے اللہ نے اپنے نبی صلی اللہ علیہ وسلم سے کفار مشرکین کی وہ تمام مصیبتیں دور کر دیں جو آپ جھیل رہے تھے۔ اور یہ سانسیں (الأنفاس) قرب الٰہی کی خوشبوئیں ہیں۔ جب عارفین کی ناکوں نے ان سانسوں کو سونگھا تو انہوں نے ان کو پہچان لیا، اور ان میں یہ داعیہ قوی ہو گیا کہ وہ اس مقام میں کسی ایسے محقق، ثابت قدم شخص کی تلاش کریں جو انہیں اس اقدس مقام کے پوشیدہ رازوں سے آگاہ کرے اور جو علم ان سانسوں کے ذریعے آیا ہے۔ یہ خوشبو (عرف) اسرار اور علوم میں سے ایک سانس (نفس) ہی ہے، جو ہمتوں (الهمم) کی جستجو اور کرم کی نفحات (النفحات) کے سامنے آنے کے بعد حاصل ہوتی ہے۔ انہوں نے ایک ایسے الٰہی شخص کو پہچانا جس کے پاس وہ راز تھا جس کی وہ تلاش کر رہے تھے اور وہ علم تھا جسے وہ حاصل کرنا چاہتے تھے۔ الحق (ذات حق) نے اسے ان میں ایک قطب (القطب) بنا کر کھڑا کر دیا جس کے گرد ان کا فلک گردش کرتا ہے۔ اور جس کے ذریعے ان کی بادشاہت قائم ہوتی ہے، اسے مداوی الکلوم (زخموں کا علاج کرنے والا) کہا جاتا ہے۔ اس سے ان میں ایسا علم، حکمت اور اسرار پھیلے جن کا احاطہ کوئی کتاب نہیں کر سکتی۔\n\n### [مداوی الکلوم اور علم کیمیا]\n\nسب سے پہلا راز جس پر اسے مطلع کیا گیا وہ دہر اول (الدهر الأول) ہے جس سے تمام ادوار (الدهور) وجود میں آئے۔ اور سب سے پہلا فعل جو اسے عطا ہوا وہ ساتویں آسمان، زحل (کیوان) کے آسمان کی روحانیت کا تقاضا کرنے والا فعل تھا۔ چنانچہ وہ تدبیر اور صنعت کے ذریعے لوہے کو چاندی بنا دیتا تھا، اور خاصیت کے ذریعے لوہے کو سونا بنا دیتا تھا۔ یہ ایک عجیب راز تھا۔ اس نے یہ کام مال کی رغبت میں نہیں کیا، بلکہ حسنِ مال کی رغبت میں کیا تاکہ اس سے کمالیت (الكمالية) کے مرتبے پر فائز ہو سکے اور یہ جان سکے کہ یہ تخلیق (التكوين) میں کسب کیا جاتا ہے۔ معدنی بخارات کے فلکی حرکات اور طبعی حرارت کے ذریعے منجمد ہونے کا پہلا مرحلہ پارہ اور گندھک ہے۔ اور ہر وہ چیز جو معدن میں بنتی ہے، وہ اپنی غایت یعنی کمال (الكمال) کی طلبگار ہوتی ہے، جو کہ سونا ہے۔ لیکن معدن میں اس پر کچھ بیماریاں اور علتیں عارض ہو جاتی ہیں، جیسے شدید خشکی، شدید رطوبت، یا حرارت یا برودت، جو اسے اعتدال سے خارج کر دیتی ہیں۔ چنانچہ وہ بیماری اس میں ایک ایسی صورت پیدا کر دیتی ہے جسے لوہا، تانبا، سیسہ یا دیگر معدنیات کہا جاتا ہے۔ اس حکیم کو ان ادویات اور عقاقیر کی معرفت عطا کی گئی جن کا استعمال معدنیات میں کمالیت (الكمالية) کی ڈگری کے طالب (یعنی سونے) پر عارض ہونے والی اس علت کو دور کر دیتا ہے۔ چنانچہ اس نے اسے دور کیا، تو وہ صحت یاب ہو گیا اور چل پڑا یہاں تک کہ کمالیت (الكمالية) کے درجے کو پا لیا۔ لیکن اس میں وہ قوتِ کمالیہ نہیں ہوتی جو اس صحیح (صحت مند) میں ہوتی ہے جس کے جسم میں کبھی بیماری داخل نہ ہوئی ہو۔ کیونکہ جس جسم میں بیماری داخل ہو جائے، اس کا اس طرح خالص اور پاک ہونا مشکل ہے کہ اس میں کوئی کدورت باقی نہ رہے، جیسا کہ انبیاء میں یحییٰ اور آدم علیہما السلام کا اصلی خلاص (خلوص) تھا۔ اور اس کا مقصد صرف عبودیت میں انسانی کمال (الكمال الإنساني) کا درجہ حاصل کرنا تھا۔ کیونکہ اللہ نے اسے أَحْسَنِ تَقْوِيمٍ (بہترین ساخت) میں پیدا کیا، پھر اسے أَسْفَلَ سَافِلِينَ (سب سے نچلے درجے) کی طرف لوٹا دیا، إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ (سوائے ان لوگوں کے جو ایمان لائے اور نیک عمل کیے)۔ پس انہوں نے اصلی صحت کو برقرار رکھا۔ اور یہ اس لیے کہ انسان نے اپنی فطرت میں اعراض کی علتیں اور اغراض کی بیماریاں کسب کر لیں۔ چنانچہ اس حکیم نے چاہا کہ اسے اس أَحْسَنِ تَقْوِيمٍ کی طرف لوٹا دے جس پر اللہ نے اسے پیدا کیا تھا۔ پس یہ تھا اس عاقل شخص کا مقصد اس صنعت کی معرفت سے جسے کیمیا کہا جاتا ہے، اور یہ صرف مقادیر اور اوزان کی معرفت کے سوا کچھ نہیں۔\n\n### [نشأۃ انسانیہ (انسانی تخلیق)]\n\nجب اللہ نے انسان کو پیدا کیا، جو کہ آدم ہیں، جو اس نشأۃ انسانیہ (النشأة الإنسانية) اور جسمانی، طبعی، عنصری صورت کی اصل ہیں، تو اس کے جسم کو گرم، سرد، تر اور خشک سے مرکب کیا، بلکہ خشک سرد، تر سرد، تر گرم اور خشک گرم سے مرکب کیا، جو کہ اخلاط اربعہ (الأخلاط الأربعة) یعنی سوداء (کالی صفرا)، بلغم، خون اور صفراء (زرد صفرا) ہیں۔ جیسا کہ عالم کبیر کے جسم میں آگ، ہوا، پانی اور مٹی ہیں۔ اللہ نے آدم کا جسم مٹی سے پیدا کیا، جو کہ پانی کو مٹی کے ساتھ ملانا ہے۔ پھر اس میں ایک نفس اور روح پھونکا۔ اور پہلی نبوت میں بنی اسرائیل کے ایک نبی پر نازل ہونے والی بعض کتابوں میں وہ بات آئی ہے جس کا متن مجھے اس وقت یاد نہیں، لیکن اس کا ذکر ضروری ہے۔ کیونکہ سب سے سچی خبر وہ ہے جو اللہ تعالیٰ سے روایت کی جائے۔ چنانچہ ہم نے مسلمہ بن وضاح سے روایت کیا، جو قرطبہ کے رہنے والے تھے اور ان کی سند ان تک پہنچتی ہے، انہوں نے کہا:\n\nاللہ نے بنی اسرائیل کے انبیاء پر نازل کردہ بعض کلام میں فرمایا: \"میں نے آدم کو مٹی اور پانی سے پیدا کیا اور اس میں ایک نفس اور روح پھونکا۔ میں نے اس کے جسم کو مٹی سے، اس کی رطوبت کو پانی سے، اس کی حرارت کو نفس سے اور اس کی برودت کو روح سے برابر کیا۔\" فرمایا: \"پھر میں نے اس جسم میں اس کے بعد چار اور انواع رکھیں جن میں سے کوئی ایک بھی دوسری کے بغیر قائم نہیں رہ سکتی، اور وہ ہیں دو صفرا (المرتان)، خون اور بلغم۔ پھر میں نے ان میں سے بعض کو بعض میں ٹھہرایا۔ چنانچہ میں نے خشکی کا ٹھکانہ مرہ سوداء (کالی صفرا) میں، حرارت کا ٹھکانہ مرہ صفراء (زرد صفرا) میں، رطوبت کا ٹھکانہ خون میں اور برودت کا ٹھکانہ بلغم میں رکھا۔\" پھر جل ثناؤہ نے فرمایا: \"پس جس جسم میں یہ اخلاط (الأخلاط) معتدل ہوں گے، اس کی صحت کامل ہو گی اور اس کی ساخت معتدل ہو گی۔ اور اگر ان میں سے کوئی ایک دوسرے پر بڑھ جائے اور اسے مغلوب کر دے تو جسم میں اسی قدر بیماری داخل ہو جائے گی جس قدر وہ بڑھی ہے۔ اور اگر وہ کم ہو جائے تو وہ ان کا مقابلہ کرنے سے کمزور پڑ جائے گی، اور ان کے غلبے اور اس کے مقابلے کی کمزوری کی وجہ سے بیماری داخل ہو جائے گی۔\" پس علم طب یہ ہے کہ اعتدال کی طلب میں کم ہونے والے میں اضافہ کیا جائے یا زیادہ ہونے والے میں کمی کی جائے۔\n\n(یہ ایک طویل کلام ہے جو اللہ تعالیٰ کی طرف سے ہے، جسے ہم نے الموعظۃ الحسنۃ میں ذکر کیا ہے۔)\n\n### [مداوی الکلوم اور آثار علویہ (Celestial Effects)]\n\nیہ امام اس طبعی نشأۃ (النشء الطبيعي) اور اس میں عالم علوی کے آثار (الآثار العلوية) کے بارے میں سب سے زیادہ جاننے والا تھا، جو ستاروں کے انوار اور ان کی گردش میں ودیعت کیے گئے ہیں۔ یہ وہی امر ہے جو اللہ نے آسمانوں میں اور ان کے قرانات، ہبوط، صعود، اوج اور حضیض میں وحی کیا ہے۔ اللہ تعالیٰ فرماتا ہے: وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا (اور اس نے ہر آسمان میں اس کا حکم وحی کر دیا)۔ اور زمین کے بارے میں فرمایا: وَقَدَّرَ فِيهَا أَقْوَاتَهَا (اور اس میں اس کی غذائیں مقرر کر دیں)۔ اس شخص کو ان امور میں جو ہم نے ذکر کیے ہیں، ایک وسیع میدان، کشادہ ہاتھ اور مضبوط قدم حاصل تھا۔ لیکن اس کی قوتِ نظر ذوق و حال (الذوق والحال) کے باب میں فلک سابع سے آگے نہیں بڑھی۔ البتہ اسے فلک مکوكب اور فلک اطلس کا علم کشف (الکشف) اور اطلاع کے ذریعے حاصل تھا۔ اس پر غالب یہ تھا کہ وہ اعیان (الأعيان) کو تبدیل کرنے کا دعویٰ کرتا تھا، حالانکہ ہمارے نزدیک اعیان (الأعيان) کلی طور پر تبدیل نہیں ہوتیں۔ یہ شخص ہمیشہ اپنی روحانیت کے ساتھ، جہاں سے وہ رصد کرتا تھا اور اپنے فکر کے ساتھ، اپنے درجے اور دقائق میں مقابل کے ساتھ گردش کرتا رہتا تھا۔ اس کے پاس احیائے موات (مردوں کو زندہ کرنے) کے اسرار کے عجائبات تھے۔ اور اللہ نے اسے یہ خاصیت عطا کی تھی کہ وہ جس جگہ بھی قحط زدہ حالت میں جاتا، اللہ وہاں خوشحالی اور برکت پیدا کر دیتا، جیسا کہ:\n\nہم نے رسول اللہ صلی اللہ علیہ وسلم سے خضر رضی اللہ عنہ کے بارے میں روایت کیا، جب آپ صلی اللہ علیہ وسلم سے ان کے نام کے بارے میں پوچھا گیا کہ خضر کیوں ہے؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: \"وہ کسی خشک زمین پر نہیں بیٹھے مگر وہ ان کے نیچے سرسبز ہو کر لہلہا اٹھی۔\"\n\n### [معرفت ذاتیہ (Self-Knowledge) اور علم القوۃ]\n\nاس امام کا ایک بڑا شاگرد تھا جو معرفت ذاتیہ (المعرفة الذاتية) اور علم القوۃ میں ماہر تھا۔ وہ اپنے ساتھیوں کے سامنے اس کی طرف اشارہ کرنے میں نرمی برتتا تھا اور عام ساتھیوں سے اسے چھپاتا تھا، اس کے خوف سے۔ اسی لیے اسے مداوی الکلوم (زخموں کا علاج کرنے والا) کہا گیا۔ جیسا کہ یعقوب علیہ السلام نے یوسف علیہ السلام کو اپنے بھائیوں کے خوف سے راز چھپانے کا حکم دیا تھا۔ وہ اپنے عام ساتھیوں کو علم تدبیر اور اس فن سے مشابہ امور میں مشغول رکھتا تھا، جیسے اجسام میں ارواح کی ترکیب، اجسام کا تحلیل کرنا اور ان سے صورت کو نکال کر یا ان پر صورت چڑھا کر ان کی تالیف کرنا، تاکہ وہ اس سے اللہ علیم و حکیم کی صنعت پر واقف ہو سکیں۔ اور اسی قطب (القطب) سے عالم کا علم اور اس کا انسان کبیر (الإنسان الکامل) ہونا ظاہر ہوا، اور یہ کہ انسان جسمانیت میں مختصر ہے لیکن معنی میں مشابہ ہے۔\n\nاس روح نے جس سے میں نے وہ سب کچھ لیا جو اس کتاب میں ودیعت کیا ہے، مجھے بتایا کہ اس نے ایک دن اپنے ساتھیوں کو ایک بستی میں جمع کیا اور ان کے درمیان خطیب بن کر کھڑا ہوا، اور اس پر ایک رعب طاری تھا۔ اس نے کہا: \"جو میں تمہیں اپنے اس مقام میں رمز کے طور پر بتا رہا ہوں، اسے مجھ سے سمجھو، اس پر غور کرو، اور اس کے خزانے کو نکالو، اور اس کے زمانے کی وسعت کس عالم میں ہے؟ میں تمہارا خیر خواہ ہوں۔ اور جو کچھ وہ کھاتا ہے، وہ نہیں جانتا کہ اسے افشا کیا جائے۔ کیونکہ ہر علم کے لیے خاص اہل ہوتے ہیں۔ اور انفرادیت ممکن نہیں، اور وقت بھی کافی نہیں ہے۔ لہٰذا، جماعت میں مختلف فطرتیں اور غیر متفق ذہن ہونا ضروری ہے۔ اور جماعت کا مقصود ایک ہی ہے، میں اپنے کلام سے اسی کا قصد کر رہا ہوں، اور میرے رمز کی کنجی اسی کے ہاتھ میں ہے۔ اور ہر مقام کے لیے ایک کلام ہے، ہر علم کے لیے رجال ہیں، اور ہر وارد کے لیے ایک حال ہے۔ پس جو میں کہتا ہوں اسے مجھ سے سمجھو، اور جو تم سنتے ہو اسے یاد رکھو۔ میں نور النور کی قسم کھاتا ہوں، اور روحِ حیات اور حیاتِ روح کی قسم کھاتا ہوں، کہ میں جہاں سے آیا ہوں وہیں تمہارے پاس سے پلٹ رہا ہوں، اور اس اصل کی طرف لوٹ رہا ہوں جس سے میں وجود میں آیا ہوں۔ اس تاریکی میں میرا قیام طویل ہو گیا ہے، اور اس غم کے پے در پے آنے سے میری سانس تنگ ہو گئی ہے۔ میں نے تم سے رخصت کی درخواست کی تھی اور مجھے کوچ کی اجازت مل گئی ہے۔ پس تم میرے کلام پر ثابت قدم رہو، تاکہ تم مقررہ سالوں کے گزرنے کے بعد جو میں نے گن کر بتائے ہیں، میری بات کو سمجھ سکو۔ اور تم یہاں سے نہ ہٹنا جب تک میں اس مدت کے بعد تمہارے پاس نہ آ جاؤں۔ اور اگر تم ہٹ جاؤ تو جلدی سے اس مجلس کی طرف لوٹ آنا۔ اگرچہ اس کا مفہوم لطیف ہے اور معنی حرف پر غالب ہے، تو حقیقت حقیقت ہے اور طریقہ طریقہ ہے۔ جنت اور دنیا دودھ اور عمارت میں شریک ہیں، اگرچہ ایک مٹی اور تنکے سے بنی ہے اور دوسری سونا اور چاندی سے۔\"\n\nیہ وہ وصیت تھی جو اس نے اپنے بیٹوں کو کی۔ اور یہ ایک عظیم مسئلہ ہے جس کا اس نے رمز دیا اور چلا گیا۔ پس جس نے اسے پہچان لیا، وہ راحت پا گیا۔\n\n### [قرطبہ میں ابن عربی کی ابن رشد سے ملاقات]\n\nمیں ایک دن قرطبہ میں اس کے قاضی ابو الولید ابن رشد کے پاس گیا۔ وہ مجھ سے ملنے کی خواہش رکھتے تھے کیونکہ انہوں نے سنا تھا اور انہیں یہ خبر پہنچی تھی کہ اللہ نے مجھ پر میری خلوت میں کیا کھولا ہے (فتح کیا ہے)۔ وہ جو کچھ سنتے تھے اس پر تعجب کا اظہار کرتے تھے۔ میرے والد نے مجھے ایک ضرورت کے تحت ان کے پاس بھیجا، تاکہ وہ مجھ سے مل سکیں، کیونکہ وہ ان کے دوستوں میں سے تھے۔ میں اس وقت ایک بچہ تھا، میرے چہرے پر ابھی بال نہیں آئے تھے اور نہ ہی میری مونچھیں نکلی تھیں۔ جب میں ان کے پاس داخل ہوا تو وہ محبت اور تعظیم میں اپنی جگہ سے کھڑے ہو گئے، اور مجھے گلے لگایا اور مجھ سے کہا: \"ہاں؟\" میں نے ان سے کہا: \"ہاں۔\" تو وہ میرے سمجھنے پر بہت خوش ہوئے۔ پھر مجھے احساس ہوا کہ کس چیز نے انہیں خوش کیا ہے، تو میں نے ان سے کہا: \"نہیں۔\" تو وہ پریشان ہو گئے اور ان کا رنگ بدل گیا اور انہیں اپنے پاس موجود علم میں شک ہونے لگا۔ انہوں نے کہا: \"آپ نے کشف (الکشف) اور فیض الٰہی میں امر کو کیسا پایا؟ کیا یہ وہی ہے جو ہمیں نظری (عقلی) غور و فکر نے دیا ہے؟\" میں نے ان سے کہا: \"ہاں اور نہیں۔ اور ہاں اور نہیں کے درمیان روحیں اپنے مادوں سے اور گردنیں اپنے جسموں سے اڑ جاتی ہیں۔\" تو ان کا رنگ پیلا پڑ گیا اور ان پر کپکپی طاری ہو گئی اور وہ حوقلہ (لا حول ولا قوة الا باللہ) پڑھنے لگے، اور وہ سمجھ گئے کہ میں نے کس چیز کی طرف اشارہ کیا ہے، اور یہ بعینہٖ وہی مسئلہ ہے جس کا ذکر اس قطب امام یعنی مداوی الکلوم نے کیا تھا۔ اس کے بعد انہوں نے میرے والد سے دوبارہ ملاقات کی درخواست کی تاکہ وہ اپنا علم ہمارے سامنے پیش کریں کہ آیا وہ موافق ہے یا مخالف، کیونکہ وہ فکری اور عقلی نظر کے مالک تھے۔\n\nانہوں نے اللہ تعالیٰ کا شکر ادا کیا کہ وہ ایسے زمانے میں تھے جہاں انہوں نے ایک ایسے شخص کو دیکھا جو خلوت میں جاہل داخل ہوا اور بغیر کسی درس، بحث، مطالعہ یا قراءت کے اس طرح باہر نکلا۔ اور کہا: \"یہ ایک ایسا حال ہے جسے ہم نے ثابت کیا تھا لیکن اس کے اہل کو نہیں دیکھا تھا۔ پس الحمد للہ کہ میں ایسے زمانے میں ہوں جس میں اس کے دروازوں کے تالے کھولنے والے اہل میں سے ایک موجود ہے۔ اور الحمد للہ کہ اس نے مجھے اس کے دیدار سے نوازا۔\"\n\nپھر میں نے دوسری بار ان سے ملنے کا ارادہ کیا، تو اللہ نے انہیں (رحمۃ اللہ علیہ) میرے لیے ایک واقعہ (خواب) میں اس صورت میں کھڑا کیا کہ میرے اور ان کے درمیان ایک باریک پردہ حائل تھا، میں انہیں اس پردے سے دیکھ رہا تھا لیکن وہ مجھے نہیں دیکھ سکتے تھے اور نہ ہی میری جگہ کو پہچان سکتے تھے۔ اور وہ مجھ سے بے نیاز ہو کر اپنے کام میں مشغول تھے۔ میں نے کہا: \"وہ اس چیز کے لیے مطلوب نہیں ہیں جس پر ہم ہیں۔\" چنانچہ میں ان سے دوبارہ نہیں مل سکا یہاں تک کہ وہ وفات پا گئے، اور یہ واقعہ ۵۹۵ھ میں مراکش شہر میں پیش آیا۔ انہیں قرطبہ منتقل کیا گیا اور ان کی قبر وہیں ہے۔ جب ان کے جسد والا تابوت سواری پر رکھا گیا تو ان کی تصانیف کو دوسری طرف رکھ کر اس کا وزن برابر کیا گیا۔ میں کھڑا تھا اور میرے ساتھ فقیہ ادیب ابو الحسین محمد بن جبیر، جو سید ابو سعید کے کاتب تھے، اور میرے ساتھی ابو الحکم عمر اور کاتب ابن السراج تھے۔ ابو الحکم نے ہماری طرف مڑ کر کہا: \"کیا تم نہیں دیکھتے کہ امام ابن رشد کی سواری میں ان کا مقابلہ کون کر رہا ہے؟ یہ امام ہیں اور یہ ان کے اعمال (یعنی تصانیف) ہیں۔\" تو ابن جبیر نے ان سے کہا: \"اے میرے بیٹے! تم نے بہت اچھی بات کہی، تمہارا منہ سلامت رہے۔\" میں نے اسے اپنے پاس نصیحت اور یاد دہانی کے طور پر درج کر لیا۔ اللہ ان سب پر رحم فرمائے۔ اور اس جماعت میں سے میرے سوا کوئی باقی نہیں رہا۔ اور ہم نے اس بارے میں کہا:\n\n> یہ امام ہیں اور یہ ان کے اعمال ہیں، *** کاش میں جانتا کہ کیا ان کی امیدیں پوری ہوئیں؟\n\n### [مداوی الکلوم اور علم فلکیات]\n\nیہ قطب (القطب) مداوی الکلوم نے فلک کی حرکت کا راز ظاہر کیا اور بتایا کہ اگر یہ اس شکل کے علاوہ کسی اور شکل پر ہوتا جس پر اللہ نے اسے پیدا کیا ہے، تو اس کے احاطے میں کوئی چیز وجود میں نہیں آ سکتی تھی۔ اور اس نے اس میں الٰہی حکمت کو واضح کیا تاکہ عقل والے اللہ کا علم چیزوں میں دیکھ سکیں، وَإِنَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ (اور بے شک وہ ہر چیز کو جاننے والا ہے)، اس کے سوا کوئی معبود نہیں، وہ علیم و حکیم ہے۔ معرفت ذات و صفات میں وہ علم ہے جس کی طرف اس قطب نے اشارہ کیا۔ اگر غیر گول چیز حرکت کرتی تو اس کی حرکت سے خلا (الخلأ) آباد نہ ہوتا، اور خلا میں بہت سی جگہیں باقی رہ جاتیں۔ چنانچہ اس حرکت سے کوئی امر مکمل نہ ہوتا، اور اس میں اتنی ہی کمی رہ جاتی جتنی ان جگہوں کی حرکت سے آباد ہونے میں کمی رہتی۔ اور یہ سب اللہ کی مشیت اور اس کی حکمت کے مطابق ہے جو اسباب کے وضع کرنے میں جاری ہے۔\n\nاس قطب نے خبر دی کہ عالم محیط (المحيط) اور نقطہ (النقطة) کے درمیان موجود ہے، اپنے مراتب، اپنے افلاک کے چھوٹے ہونے اور بڑے ہونے کے ساتھ۔ اور جو محیط کے قریب ہے وہ اس سے زیادہ وسیع ہے جو اس کے اندر ہے، چنانچہ اس کا دن بڑا ہے، اس کی جگہ زیادہ کشادہ ہے، اور اس کی زبان زیادہ فصیح ہے۔ اور وہ قوت اور صفائی کے ساتھ تحقق (تحقق) کے زیادہ قریب ہے۔ اور جو عناصر کی طرف نیچے آیا، وہ اس درجے سے نیچے اتر گیا، یہاں تک کہ کرہ ارض تک۔ اور ہر محیط میں ہر جز اپنے اوپر والے اور اپنے نیچے والے کے ساتھ اپنی ذات کے اعتبار سے مقابل ہے، کوئی ایک دوسرے پر زیادہ نہیں ہوتا، اگرچہ ایک وسیع ہو اور دوسرا تنگ۔ اور یہ بڑے کا چھوٹے پر اور وسیع کا تنگ پر وارد ہونا ہے، بغیر اس کے کہ تنگ وسیع ہو جائے یا وسیع تنگ ہو جائے۔ اور سب اپنی ذات کے ساتھ نقطہ (النقطة) کی طرف دیکھتے ہیں، اور نقطہ اپنے چھوٹے پن کے باوجود اپنے ارد گرد کے ہر جز کو اپنی ذات کے ساتھ دیکھتا ہے۔ پس مختصر محیط ہے اور محیط سے مختصر نقطہ ہے۔ اور اس کے برعکس۔ پس غور کرو۔\n\nاور جب امر عناصر کی طرف نیچے آیا یہاں تک کہ زمین تک پہنچا، تو اس کی کدورت بڑھ گئی، جیسے مٹکے میں پانی اور تیل اور ہر مائع جو برتن میں ہوتا ہے، اس کی کدورت نیچے بیٹھ جاتی ہے اور اوپر کا حصہ صاف ہو جاتا ہے۔ اور اس کا مطلب یہ ہے کہ عالم طبیعت کو وہ حجابات ملتے ہیں جو علوم اور تجلیات (التجلیات) کے انوار کے ادراک سے روکتے ہیں، جو شہوات اور شرعی شبہات کی کدورتوں، اور زبان، نظر، سماعت، کھانے، پینے، لباس اور سواری میں پرہیزگاری (ورع) کی کمی کی وجہ سے ہوتے ہیں۔ اور شہوات کی کدورتیں ان پر جھکنے اور ان میں حد سے زیادہ مشغول ہونے سے پیدا ہوتی ہیں، اگرچہ وہ حلال ہی کیوں نہ ہوں۔ اور آخرت میں شہوات کا حصول، جو دنیا کی شہوات سے زیادہ عظیم ہیں، تجلی (التجلی) سے کیوں نہیں روکتا؟ اس لیے کہ وہاں تجلی آنکھوں پر ہو گی، اور آنکھیں شہوات کا محل نہیں ہیں۔ اور دنیا میں تجلی بصیرتوں اور باطن پر ہوتی ہے، ظاہر پر نہیں۔ اور باطن شہوات کا محل ہیں۔ اور تجلی (التجلی) اور شہوت ایک ہی محل میں جمع نہیں ہو سکتے۔ اسی لیے عارفین اور زاہدین نے اس دنیا میں اپنی شہوات کے حصول کو کم کرنے اور اس کے حقیر مال کمانے سے پرہیز کرنے کی طرف رجوع کیا۔\n\n### [ابدال (الأبدال) کے مراتب]\n\nیہ امام ہی تھا جس نے اپنے ساتھیوں کو بتایا کہ سات رجال ہیں جنہیں ابدال (الأبدال) کہا جاتا ہے۔ اللہ ان کے ذریعے سات اقلیموں (الأقاليم) کی حفاظت کرتا ہے۔ ہر بدل (بدل) کے لیے ایک اقلیم ہے، اور سات آسمانوں کی روحانیت ان کی طرف دیکھتی ہے۔ اور ان میں سے ہر شخص کو ان آسمانوں میں موجود انبیاء کی روحانیت سے قوت حاصل ہے۔ وہ ہیں: ابراہیم خلیل، ان کے بعد موسیٰ، ان کے بعد ہارون، ان کے بعد ادریس، ان کے بعد یوسف، ان کے بعد عیسیٰ، ان کے بعد آدم، سلام اللہ علیہم اجمعین۔ اور یحییٰ کا تردد عیسیٰ اور ہارون کے درمیان ہے۔ ان سات ابدال (الأبدال) کے دلوں پر ان انبیاء علیہم السلام کی حقائق نازل ہوتی ہیں۔ اور یہ سات ستارے ان کی طرف دیکھتے ہیں جو اللہ نے ان کی گردشوں میں ودیعت کیے ہیں، اور جو اسرار، علوم اور علوی و سفلی آثار اللہ نے ان سات آسمانوں کی حرکات میں ودیعت کیے ہیں۔ اللہ تعالیٰ فرماتا ہے: وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا (اور اس نے ہر آسمان میں اس کا حکم وحی کر دیا)۔ پس ان کے دلوں میں ہر گھڑی اور ہر دن، اس گھڑی کے مالک اور اس دن کے سلطان کے عطا کردہ کے مطابق، علم نازل ہوتا ہے۔\n\n### [چوتھا اقلیم اور اس کا بدل]\n\nہر علمی امر جو اتوار کے دن ہوتا ہے، وہ ادریس علیہ السلام کے مادے سے ہوتا ہے۔ اور ہر علوی اثر جو اس دن عنصر ہوا اور آگ میں ہوتا ہے، وہ سورج کی گردش اور اس کی نظر سے ہوتا ہے جو اللہ نے اس میں ودیعت کی ہے۔ اور جو اثر اس دن عنصر پانی اور مٹی میں ہوتا ہے، وہ چوتھے فلک کی حرکت سے ہوتا ہے۔ اور اس شخص کا مقام جسے یہ اقلیم محفوظ رکھتا ہے، چوتھا اقلیم (الإقليم الرابع) ہے۔ پس اس اقلیم کے ساتھ مخصوص ابدال (الأبدال) کو جو علوم حاصل ہوتے ہیں، ان میں روحانیات کے اسرار کا علم، نور اور ضیاء کا علم، بجلی اور شعاع کا علم، اور ہر منور جسم کا علم شامل ہے، اور یہ کہ وہ کیوں منور ہوا، اور وہ کون سا مزاج ہے جس نے اسے یہ قبولیت دی، جیسے حیوانات میں جگنو، نباتات میں انجیر کے درخت کی جڑیں، اور پتھروں میں حجر المہا اور یاقوت، اور بعض حیوانات کا گوشت۔ اور معدن، نباتات، حیوانات، انسان اور فرشتہ میں کمال (الكمال) کا علم۔ اور سیدھی حرکت کا علم جہاں بھی وہ حیوان یا نبات میں ظاہر ہو۔ اور تاسیس کے نشانات کا علم، انوار کی سانسوں (أنفاس الأنوار) کا علم، مدبر ارواح کو نکالنے کا علم، مبہم امور کو واضح کرنے کا علم، اور مشکل اور پیچیدہ مسائل کو حل کرنے کا علم۔ اور فلکی اور دولابی نغمات کا علم، اور تاروں اور دیگر آلات طرب کی آوازوں کا علم۔ اور ان کا حیوانات کی طبائع سے مناسبت کا علم، اور نباتات کا ان سے تعلق کا علم۔ اور وہ علم جس پر روحانی معانی اور خوشبودار مہکیں منتہی ہوتی ہیں، اور وہ کون سا مزاج ہے جس نے انہیں معطر کیا، اور وہ کیوں لوٹتی ہیں، اور ہوا انہیں سونگھنے کے ادراک تک کیسے منتقل کرتی ہے، اور کیا وہ جوہر ہے یا عرض؟ یہ سب کچھ اس اقلیم کا مالک اس دن اور جمعہ کے باقی دنوں میں، اس فلک کی حرکت کے حکم اور اس میں موجود ستاروں کے حکم اور اس میں موجود نبی کی روحانیت کے حکم کے مطابق حاصل کرتا ہے، یہاں تک کہ جمعہ کا دور مکمل ہو جائے۔\n\n### [ساتواں اقلیم اور اس کا بدل]\n\nہر علمی امر جو پیر کے دن ہوتا ہے، وہ آدم علیہ السلام کی روحانیت سے ہوتا ہے۔ اور ہر علوی اثر جو عنصر ہوا اور آگ میں ہوتا ہے، وہ چاند کی گردش سے ہوتا ہے۔ اور ہر سفلی اثر جو عنصر پانی اور مٹی میں ہوتا ہے، وہ آسمان دنیا کے فلک کی حرکت سے ہوتا ہے۔ اور اس شخص کے لیے ساتواں اقلیم (الإقليم السابع) ہے۔ پس اس بدل (بدل) کو پیر کے دن اور جمعہ کے دنوں کی ہر گھڑی میں، جس میں اس فلک کا حکم ہوتا ہے، جو علوم حاصل ہوتے ہیں، ان میں سعادت اور شقاوت کا علم، اسماء کا علم اور ان کی خواص کا علم، اور مد و جزر (جوار بھاٹا) اور زیادتی و کمی کا علم شامل ہے۔\n\n### [تیسرا اقلیم اور اس کا بدل]\n\nہر علمی امر جو منگل کے دن ہوتا ہے، وہ ہارون علیہ السلام کی روحانیت سے ہوتا ہے۔ اور ہر علوی اثر جو عنصر آگ اور ہوا میں ہوتا ہے، وہ سرخ ستارے (مریخ) کی روحانیت سے ہوتا ہے۔ اور ہر سفلی اثر جو پانی اور مٹی کے رکن میں ہوتا ہے، وہ پانچویں فلک کی حرکت سے ہوتا ہے۔ اور اس بدل (بدل) کے لیے اقلیموں میں سے تیسرا اقلیم (الإقليم الثالث) ہے۔ پس اسے اس دن اور اس کی گھڑیوں میں جو علوم عطا ہوتے ہیں، ان میں بادشاہت کی تدبیر اور سیاست کا علم، پرہیز اور حفاظت کا علم، فوجوں کی ترتیب اور جنگ کا علم، جنگی چالوں کا علم، قربانیوں کا علم، جانور ذبح کرنے کا علم، ایام نحر کے اسرار کا علم اور ان کا تمام علاقوں میں جاری ہونا، اور ہدایت و گمراہی کا علم، اور شبہات کو دلیل سے ممتاز کرنے کا علم شامل ہے۔\n\n### [چھٹا اقلیم اور اس کا بدل]\n\nہر علمی امر جو بدھ کے دن ہوتا ہے، وہ عیسیٰ علیہ السلام کی روحانیت سے ہوتا ہے، اور یہ نور کا دن تھا۔ اس دن ہماری طرف ان کی نظر تھی جب ہم اس راستے میں داخل ہوئے جس پر ہم آج ہیں۔ اور ہر اثر جو عنصر آگ اور ہوا میں ہوتا ہے، وہ کاتب (عطارد) کی اپنے فلک میں گردش کی روحانیت سے ہوتا ہے۔ اور ہر سفلی اثر جو پانی اور مٹی کے رکن میں ہوتا ہے، وہ دوسرے آسمان کے فلک کی حرکت سے ہوتا ہے۔ اور اس دن کے مالک بدل (بدل) کے لیے چھٹا اقلیم (الإقليم السادس) ہے۔ اور اسے اس دن اور اس کی گھڑیوں میں جو علوم حاصل ہوتے ہیں، ان میں اوہام (وہموں) کا علم، الہام کا علم، وحی کا علم، آراء اور قیاسات کا علم، خوابوں کا علم، عبادت کا علم، صنعتی ایجاد کا علم، عطاردیت (علم عطارد) کا علم، وہ غلطی جو فہم کی آنکھ سے لگ جاتی ہے، اس کا علم، تعلیمات کا علم، کتابت اور آداب کا علم، ڈانٹ ڈپٹ کا علم، کہانت، سحر اور طلسمات اور عزائم کا علم شامل ہے۔\n\n### [دوسرا اقلیم اور اس کا بدل]\n\nہر علمی امر جو جمعرات کے دن ہوتا ہے، وہ موسیٰ علیہ السلام کی روحانیت سے ہوتا ہے۔ اور ہر علوی اثر جو آگ اور ہوا کے رکن میں ہوتا ہے، وہ مشتری (Jupiter) کی گردش سے ہوتا ہے۔ اور ہر سفلی اثر جو عنصر پانی اور مٹی میں ہوتا ہے، وہ اس کے فلک کی حرکت سے ہوتا ہے۔ اور اس بدل (بدل) کے لیے اقلیموں میں سے دوسرا اقلیم (الإقليم الثاني) ہے۔ اور اسے اس دن اور اس کی گھڑیوں میں جو علوم حاصل ہوتے ہیں، ان میں نباتات کا علم، نوامیس (قوانین) کا علم، خیر کے اسباب کا علم، اخلاق حسنہ کا علم، قربتوں کا علم، اعمال کی قبولیت کا علم اور یہ کہ وہ اپنے کرنے والے کو کہاں تک پہنچاتے ہیں، شامل ہے۔\n\n### [پانچواں اقلیم اور اس کا بدل]\n\nہر علمی امر جو جمعہ کے دن ہوتا ہے، وہ اس شخص کے لیے ہوتا ہے جس کے ذریعے اللہ پانچویں اقلیم (الإقليم الخامس) کی حفاظت کرتا ہے، وہ یوسف علیہ السلام کی روحانیت سے ہوتا ہے۔ اور ہر علوی اثر جو آگ اور ہوا کے رکن میں ہوتا ہے، وہ زہرہ (Venus) ستارے کی نظر سے ہوتا ہے۔ اور ہر سفلی اثر جو پانی اور زمین کے رکن میں ہوتا ہے، وہ زہرہ کے فلک کی حرکت سے ہوتا ہے۔ اور یہ اس امر میں سے ہے جو اللہ نے ہر آسمان میں وحی کیا ہے۔ اور یہ آثار وہ امر الٰہی ہیں جو آسمان اور زمین کے درمیان نازل ہوتے ہیں، اور یہ ہر اس چیز میں ہوتے ہیں جو ان دونوں کے درمیان پیدا ہوتی ہے، آسمان سے جو نازل ہوتا ہے اور زمین سے جو اس نزول کو قبول کرتی ہے، جیسا کہ مادہ کا رحم تخلیق کے لیے مرد سے پانی قبول کرتا ہے، اور پرندے سے مرطوب ہوا قبول کرتا ہے۔ اللہ تعالیٰ فرماتا ہے: خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ (اللہ نے سات آسمان پیدا کیے اور زمین میں سے بھی ان کے مانند۔ حکم ان کے درمیان نازل ہوتا ہے تاکہ تم جان لو کہ اللہ ہر چیز پر قادر ہے)۔ اور قدرت کا تعلق صرف ایجاد سے ہے۔ پس ہم نے جانا کہ اس نزول کا مقصود تخلیق (التكوين) ہے۔ اور اسے اس دن اور اس کی گھڑیوں میں جو علوم حاصل ہوتے ہیں، ان میں جمال اور انس کی حضوری سے تصویر کشی کا علم اور احوال کا علم شامل ہے۔\n\n### [پہلا اقلیم اور اس کا بدل]\n\nہر علمی امر جو ہفتہ کے دن ہوتا ہے، وہ اس بدل (بدل) کے لیے ہوتا ہے جسے پہلے اقلیم (الإقليم الأول) کی حفاظت حاصل ہے، وہ ابراہیم خلیل علیہ السلام کی روحانیت سے ہوتا ہے۔ اور جو علوی اثر اس دن آگ اور ہوا کے رکن میں ہوتا ہے، وہ کیوان (زحل) ستارے کی اپنے فلک میں حرکت سے ہوتا ہے۔ اور جو اثر عالم سفلی میں، زمین اور پانی کے رکن میں ہوتا ہے، وہ اس کے فلک کی حرکت سے ہوتا ہے۔ اللہ تعالیٰ سیاروں کے بارے میں فرماتا ہے: كُلٌّ فِي فَلَكٍ يَسْبَحُونَ (ہر ایک اپنے فلک میں تیر رہا ہے)۔ اور فرمایا: وَبِالنَّجْمِ هُمْ يَهْتَدُونَ (اور وہ ستاروں کے ذریعے ہدایت پاتے ہیں)۔ پس اللہ نے انہیں ہدایت کے لیے پیدا کیا۔ اور اسے اس دن اور باقی دنوں کی گھڑیوں میں، رات اور دن میں، جو علوم حاصل ہوتے ہیں، ان میں ثبات (استحکام) اور تمکین (رسوخ) کا علم، اور دوام (ہمیشگی) اور بقا (البقاء) کا علم شامل ہے۔\n\n### [سات ابدال (الأبدال) کے مقامات اور ان کے ہجیر (ورد)]\n\nاس امام کو ان ابدال (الأبدال) کے مقامات اور ان کے ہجیر (ورد) کا علم تھا۔ اس نے کہا کہ پہلے کا مقام اور اس کا ہجیر (ورد) لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں) ہے۔ اور اس کی وجہ یہ ہے کہ اولیت اسی کے لیے ہے، اگر اس سے پہلے کوئی مثال ہوتی تو اس کی اولیت صحیح نہ ہوتی۔ پس اس کا ذکر اس کے مقام کے مناسب ہے۔\n\nاور دوسرے شخص کا مقام اس کے ہجیر میں لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِمَاتُ رَبِّي (اگر میرے رب کے کلمات کے لیے سمندر سیاہی بن جائے تو وہ ختم ہو جائے گا اس سے پہلے کہ میرے رب کے کلمات ختم ہوں) ہے۔ اور یہ علم الٰہی کا مقام ہے اور اس کا تعلق کبھی ختم نہیں ہوتا۔ اور یہ اوصاف میں دوسرا ہے، کیونکہ پہلا وصف حیات ہے اور اس کے بعد علم ہے۔\n\nاور تیسرے شخص کا ہجیر اور مقام وَفِي أَنْفُسِكُمْ أَفَلَا تُبْصِرُونَ (اور تمہاری جانوں میں بھی، کیا تم نہیں دیکھتے؟) ہے۔ اور یہ تیسرا مرتبہ ہے۔ کیونکہ پہلی آیات اسماء الٰہیہ ہیں، دوسری آیات آفاق میں ہیں، اور دوسری کے بعد والی آیات ہماری جانوں میں ہیں۔ اللہ تعالیٰ فرماتا ہے: سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ (ہم انہیں عنقریب اپنی نشانیاں آفاق میں اور ان کی جانوں میں دکھائیں گے)۔ اسی لیے تیسرے بدل (بدل) کو یہ تیسرا ہجیر خاص کیا گیا۔\n\nاور چوتھے کا مقام اس کے ہجیر يَا لَيْتَنِي كُنْتُ تُرَابًا (اے کاش میں مٹی ہوتا) میں ہے۔ اور یہ ارکان میں سے چوتھا رکن ہے جو مرکز کو طلب کرتا ہے، ان کے نزدیک جو اس کے قائل ہیں۔ اور کرہ کے نقطہ سے زمین سے زیادہ قریب کوئی چیز نہیں ہے۔ اور وہ نقطہ محیط کے وجود کا سبب تھا۔ پس وہ اللہ کا قرب طلب کرتا ہے جو چیزوں کو وجود بخشنے والا ہے، اور یہ صرف تواضع سے حاصل ہوتا ہے۔ اور تواضع میں زمین سے زیادہ نیچے کوئی چیز نہیں ہے۔ اور یہ علوم کا منبع ہے اور نہروں کا پھوٹنے کا مقام ہے۔ اور جو کچھ بادلوں سے نازل ہوتا ہے، وہ زمین سے اوپر اٹھنے والی رطوبتوں کے بخارات سے ہوتا ہے۔ پس اسی سے چشمے اور نہریں پھوٹتی ہیں، اور اسی سے بخارات فضا میں نکلتے ہیں اور پانی میں تبدیل ہو کر بارش بن کر نازل ہوتے ہیں۔ اسی لیے چوتھے کو ارکان میں سے چوتھا ہجیر خاص کیا گیا۔\n\nاور پانچویں کا مقام فَاسْأَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لَا تَعْلَمُونَ (پس اگر تم نہیں جانتے تو اہل ذکر سے پوچھ لو) ہے۔ اور سوال صرف مولود (پیدا ہونے والا) ہی کرتا ہے، کیونکہ وہ طفولیت کے مقام پر ہے۔ اللہ تعالیٰ فرماتا ہے: وَاللَّهُ أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا (اور اللہ نے تمہیں تمہاری ماؤں کے پیٹوں سے نکالا اس حال میں کہ تم کچھ نہیں جانتے تھے)۔ پس وہ نہیں جانتا جب تک سوال نہ کرے۔ اور بیٹا پانچویں مرتبے میں ہے، کیونکہ اس کی مائیں چار ہیں، جو کہ ارکان ہیں، تو وہ پانچویں عین (ذات) ہوا۔ اسی لیے پانچویں بدل (بدل) کے لیے ابدال (الأبدال) میں سے سوال کو ہجیر بنایا گیا۔\n\nاور چھٹے کا مقام اس کا ہجیر أُفَوِّضُ أَمْرِي إِلَى اللَّهِ (میں اپنا معاملہ اللہ کے سپرد کرتا ہوں) ہے۔ اور یہ چھٹا مرتبہ ہے۔ اور یہ چھٹا مرتبہ اس کے لیے اس لیے ہوا کہ وہ پانچویں مرتبے میں تھا، جیسا کہ ہم نے ذکر کیا، وہ سوال کرتا ہے اور وہ نہیں جانتا تھا۔ جب اس نے سوال کیا تو جان لیا، اور جب جان لیا تو اپنے رب کے علم کے ساتھ متحقق ہوا، پس اس نے اپنا معاملہ اس کے سپرد کر دیا، کیونکہ اسے معلوم تھا کہ اس کے اختیار میں اس کے معاملے میں کچھ بھی نہیں ہے، اور یہ کہ اللہ يَفْعَلُ مَا يُرِيدُ (جو چاہتا ہے کرتا ہے)۔ اس نے کہا: \"میں نے جان لیا کہ جب اللہ نے مجھے میرے معاملے کا مالک بنایا اور وہ جو چاہتا ہے کرتا ہے، تو میں نے جان لیا کہ اس میں تفویض میرے لیے زیادہ بہتر ہے۔\" اسی لیے اس نے اسے اپنا ہجیر بنا لیا۔\n\nاور ساتویں کا مقام إِنَّا عَرَضْنَا الْأَمَانَةَ (بے شک ہم نے امانت پیش کی) ہے۔ اور یہ اس لیے کہ اس کا ساتواں مرتبہ ہے۔ اور آدم، جسے انسان سے تعبیر کیا جاتا ہے، کی تخلیق بھی ساتویں مرتبے میں تھی۔ کیونکہ وہ عقل سے، پھر نفس سے، پھر ہباء (مادہ اولیہ) سے، پھر فلک سے، پھر فاعلان (فاعل) سے، پھر منفعلان (مفعول) سے ہے۔ یہ چھ ہوئے۔ پھر انسان جو کہ آدم ہے، ساتویں مرتبے میں وجود میں آیا۔ اور چونکہ انسان کا وجود سنبلہ (Virgo) میں ہوا، اور اس کی دلالت میں زمانہ سات ہزار سال ہے، تو انسان مدت کے ساتویں مرتبے میں پایا گیا۔ اور امانت صرف اسی نے اٹھائی جو سات کے ساتھ متحقق ہوا۔ اور یہ ابدال (الأبدال) میں سے ساتواں تھا۔ اسی لیے اس نے اس آیت کو اپنا ہجیر بنا لیا۔ پس ہم نے تمہارے لیے ابدال (الأبدال) کے مراتب واضح کر دیے۔\n\n### [قطب مداوی الکلوم کے خلفاء]\n\nمجھے خبر دی گئی کہ یہ قطب (القطب) جو مداوی الکلوم ہے، جب وہ اپنے جسم میں قید تھا اور عالم میں اس کی ولایت تھی، تو جب وہ کھڑا ہوتا تو اس کے کھڑے ہونے پر ستر قبیلے کھڑے ہوتے، جن سب میں معارف الٰہیہ اور اسرار الوجود (الوجود) ظاہر ہو چکے تھے۔ اور اس کا کلام ہمیشہ سات سے تجاوز نہیں کرتا تھا۔ وہ ایک طویل عرصے تک اپنے ساتھیوں میں رہا۔ اور وہ اپنے زمانے میں اپنے ساتھیوں میں سے ایک فاضل شخص کو مقرر کرتا تھا جو مجلس میں اس کے سب سے زیادہ قریب ہوتا تھا، اس کا نام المستسلم (تسلیم کرنے والا) تھا۔ جب یہ امام وفات پا گیا، تو المستسلم اس کے مقام پر قطبیت (القطبية) میں ولی بنا۔ اس کا غالب علم علم الزمان (وقت کا علم) تھا، اور یہ ایک شریف علم ہے جس سے ازل (الأزل) کی معرفت ہوتی ہے۔ اور اسی سے نبی علیہ السلام کا یہ قول ظاہر ہوا: \"کان الله ولا شیء معه\" (اللہ تھا اور اس کے ساتھ کوئی چیز نہیں تھی)۔ اور یہ علم صرف افرادِ رجال ہی جانتے ہیں، اور اسی کو دہر اول (الدهر الأول) اور دہر الدہور (زمانوں کا زمانہ) سے تعبیر کیا جاتا ہے۔ اور اسی ازل (الأزل) سے زمان (وقت) وجود میں آیا، اور اسی سے اللہ کا نام الدہر (زمانہ) پڑا، اور یہ نبی علیہ السلام کا قول ہے: \"لا تسبوا الدهر فإن الله هو الدهر\" (زمانہ کو برا نہ کہو، کیونکہ اللہ ہی زمانہ ہے)۔\n\nیہ حدیث صحیح اور ثابت ہے۔ اور جسے علم الدہر حاصل ہو جائے، وہ کسی بھی چیز میں نہیں رکتا جسے وہ الحق (ذات حق) کی طرف منسوب کرتا ہے، کیونکہ اس کے لیے سب سے بڑی وسعت ہے۔ اور اسی علم سے الٰہ کے بارے میں مختلف اقوال پیدا ہوئے، اور اسی سے عقائد میں اختلاف ہوا۔ اور یہ علم ان سب کو قبول کرتا ہے اور ان میں سے کسی کو رد نہیں کرتا۔ اور یہ علم عام ہے، اور یہ ظرف الٰہی ہے۔ اور اس کے اسرار عجیب ہیں، اس کی کوئی موجودہ عین (ذات) نہیں ہے، اور وہ ہر چیز میں حاکم ہے۔ وہ الحق (ذات حق) کی نسبت کو قبول کرتا ہے اور کون (کائنات) کی نسبت کو قبول کرتا ہے۔ وہ تمام اسماء کا سلطان ہے، خواہ وہ معین ہوں یا ہم سے غائب ہوں۔\n\nپس اس امام کو اس میں ید بیضاء (کامل مہارت) حاصل تھی۔ اور اسے اپنے علم دہر الدہور سے دنیا کی حکمت کا علم تھا کہ وہ اپنے اہل کے ساتھ کیوں کھیلتی ہے، اور اسے کھیل کیوں کہا گیا حالانانکہ اللہ نے اسے وجود بخشا ہے۔ اور اکثر کھیل کو زمانے کی طرف منسوب کیا جاتا ہے، اور کہا جاتا ہے کہ زمانے نے اپنے اہل کے ساتھ کھیلا۔ اور اس کا تعلق سابقہ (تقدیر) سے ہے، اور وہی انجام میں حاکم ہے۔\n\nیہ امام کسب کی مذمت کرتا تھا اور اس کی حکمت کی معرفت کے باوجود اس کا قائل نہیں تھا، لیکن وہ اس کے ذریعے اپنے ساتھیوں کی ہمتوں کو واسطوں سے تعلق رکھنے سے بلند کرتا تھا۔ مجھے خبر دی گئی کہ وہ اس وقت تک نہیں مرا جب تک اس نے اللہ کے اسرارِ خلق میں چھتیس ہزار پانچ سو علوم، خاص طور پر علوی علوم میں سے، نہ جان لیے۔\n\nوہ رحمۃ اللہ علیہ وفات پا گئے، اور ان کے بعد ایک فاضل شخص ولی بنا جس کا نام مظہر الحق (حق کا ظاہر کرنے والا) تھا۔ وہ ڈیڑھ سو سال زندہ رہا اور وفات پا گیا۔\n\nاور اس کے بعد الہائج (جوش والا) ولی بنا۔ وہ بڑے شان والا تھا اور تلوار کے ساتھ ظاہر ہوا۔ وہ ایک سو چالیس سال زندہ رہا اور ایک جنگ میں مقتول ہوا۔ اس کے حال پر اسماء الٰہیہ میں سے القہار (زبردست) غالب تھا۔\n\nجب وہ قتل ہوا تو اس کے بعد ایک شخص ولی بنا جسے لقمان کہا جاتا تھا، واللہ اعلم۔ اور اسے واضع الحکم (حکمت رکھنے والا) کا لقب دیا گیا تھا۔ وہ ایک سو بیس سال زندہ رہا۔ وہ ترتیب، ریاضیاتی، طبعی اور الٰہی علوم کا عارف تھا۔ وہ اپنے ساتھیوں کو بہت وصیتیں کرتا تھا۔ اگر وہ واقعی لقمان تھے، تو اللہ نے ہمیں وہ وصیتیں بتائی ہیں جو وہ اپنے بیٹے کو کرتے تھے، جو اللہ کے علم میں ان کے مرتبے اور عمومی حالات میں چیزوں میں قصد اور اعتدال پر ان کی ترغیب کی دلیل ہیں۔\n\nجب وہ رحمۃ اللہ علیہ وفات پا گئے، اور یہ داؤد علیہ السلام کے زمانے میں تھا، تو ان کے بعد ایک شخص ولی بنا جس کا نام الکاسب (کمانے والا) تھا۔ اسے دونوں عالموں کے درمیان مناسبتوں کے علم میں اور اس الٰہی مناسبت میں مضبوط قدم حاصل تھا جس پر عالم اس صورت میں وجود میں آیا جس پر وہ ہے۔ یہ امام جب وجود میں کوئی اثر ظاہر کرنا چاہتا تھا، تو وہ اپنے نفس میں عالم علوی میں اس پر اثر انداز ہونے والے کی طرف ایک مخصوص نظر سے، ایک معلوم وزن پر دیکھتا تھا، تو وہ اثر بغیر کسی براہ راست عمل یا طبعی حیلے کے ظاہر ہو جاتا تھا۔\n\nوہ کہتا تھا کہ اللہ نے سارا علم افلاک میں ودیعت کر دیا ہے، اور انسان کو پورے عالم کی رقائق (لطیف دھاگوں) کا مجموعہ بنا دیا ہے۔ انسان سے لے کر عالم کی ہر چیز تک ایک رقیقہ (لطیف دھاگہ) پھیلا ہوا ہے۔ اسی رقیقہ سے اس چیز کا وہ حصہ انسان میں ہوتا ہے جو اللہ نے اس چیز کے پاس ان امور میں سے امانت رکھا ہے جن پر اللہ نے اسے امین بنایا ہے تاکہ وہ اسے اس انسان تک پہنچا دے۔ اور اسی رقیقہ کے ذریعے عارف انسان اس چیز کو اپنی مرضی کے مطابق حرکت دیتا ہے۔ پس عالم میں کوئی چیز ایسی نہیں جس کا انسان میں اثر نہ ہو، اور انسان کا اس میں اثر نہ ہو۔ اسی لیے اسے ان رقائق (الرقائق) کا کشف (الکشف) اور ان کی معرفت حاصل تھی، اور وہ نور کی شعاعوں کی طرح ہیں۔ یہ امام اسی سال زندہ رہا۔\n\nجب وہ وفات پا گیا تو اس کا وارث ایک شخص بنا جسے جامع الحکم (حکمتوں کا جمع کرنے والا) کہا جاتا تھا۔ وہ ایک سو بیس سال زندہ رہا۔ اس کے ابدال (الأبدال)، شیخ اور شاگرد کے اسرار کے بارے میں عظیم کلام ہیں۔ وہ اسباب کا قائل تھا۔ اور اسے نباتات کے اسرار عطا کیے گئے تھے۔ اور اس راستے کے اہل سے متعلق ہر علم میں اسے قدم حاصل تھا۔\n\nاور جو کچھ ہم نے اس باب میں ذکر کیا ہے وہ کافی ہے۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب پانزدهم در شناخت نَفَس‌ها (الأنفاس) و شناخت اقطاب (أقطاب) محقق آن‌ها و اسرارشان\n\n( (بسم الله الرحمن الرحيم))\n\n> عالم نَفَس‌ها (الأنفاس) از نَفَس من است *** و آنان برترین‌ها در قُدس (قدس) هستند\n> برگزیده‌شان سروری فصیح است *** و وحی او در صدای زنگ (جرس) به او می‌رسد\n> به دربان گفتم، هنگامی که دید *** آنچه را از نگهبانان (حرس) تحمل می‌کنم\n> گفت: ای فرزندم، چه می‌خواهی؟ *** گفتم: نزدیکی سرور دانا (ندس)\n> شفیع من نزد امام کیست؟ شاید *** یک توجه (خطرة) از او برای کسی که پنهانی می‌رباید (مختلس) باشد\n> گفت: او عطایای خود را نمی‌دهد *** به توانگری که اندوهگین نیست\n\n### [قطب اول: مداوی الکلوم (مداواگر زخم‌ها)]\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «نَفَس رحمان از سوی یمن به من می‌رسد.»\n\nگفته شده است که انصار (یاران پیامبر) کسانی بودند که خداوند به واسطه آن‌ها، رنج‌هایی را که پیامبر (صلی الله علیه و سلم) از کفار مشرک می‌کشید، از او دور ساخت. و نَفَس‌ها (الأنفاس) رایحه‌های قرب الهی هستند. هنگامی که مشام عارفان این نَفَس‌ها را استشمام کرد، آن‌ها را شناختند و انگیزه‌هایشان برای یافتن محققی ثابت‌قدم در آن مقام فزونی یافت تا آنان را از آنچه در لایه‌های آن مقام اقدس نهفته است، آگاه سازد. و این عطر (عرف) که این نَفَس‌ها با خود آوردند، چیزی جز نَفَسی از اسرار و علوم نبود. پس از جستجو با همت‌ها و قرار گرفتن در معرض نفحات کرم الهی، آنان به واسطه شخصیتی الهی آگاه شدند که سرّ مطلوب و علم مورد نظرشان نزد اوست. و حق (الحق) او را در میانشان قطبی (قطبا) قرار داد که فلکشان بر گرد او می‌چرخد و ملکشان به واسطه او برپا می‌ماند. به او «مداوی الکلوم» (مداواگر زخم‌ها) گفته می‌شود. از او در میانشان علومی، حکمت‌هایی و اسراری منتشر شد که هیچ کتابی نمی‌تواند آن‌ها را در بر گیرد.\n\n### [مداوی الکلوم و علم کیمیا]\n\nاولین سرّی که بر او آشکار شد، دهر اول (الدهر الأول) بود که دهرها از آن پدید آمدند. و اولین فعلی که به او عطا شد، فعل مقتضی روحانیه آسمان هفتم، یعنی آسمان کیوان (زحل)، بود. او می‌توانست آهن را با تدبیر و صنعت به نقره تبدیل کند و با خاصیت (خاصیة) آن را به طلا تبدیل سازد؛ و این سرّی شگفت‌انگیز بود. او این کار را نه به دلیل رغبت به مال، بلکه به دلیل رغبت به حُسن مال (نتیجه نیکو) انجام می‌داد تا از این طریق بر مرتبه کمال (الکمال) واقف شود و بداند که کمال در تکوین (التکوین) اکتسابی است. زیرا مرتبه اول از انعقاد بخارات معدنی به واسطه حرکات فلکی و حرارت طبیعی، جیوه و گوگرد است. و هر متکونی در معدن، غایت خود را که کمال است و همان طلا می‌باشد، می‌طلبد. اما در معدن، عوارض و بیماری‌هایی بر آن عارض می‌شود؛ مانند خشکی مفرط، یا رطوبت مفرط، یا حرارت یا برودت که آن را از اعتدال خارج می‌سازد. در نتیجه، آن بیماری در آن، صورتی را تأثیر می‌گذارد که آهن، یا مس، یا سرب، یا دیگر فلزات نامیده می‌شود. پس به این حکیم، معرفت داروها و عقاقیر عطا شد که استعمال آن‌ها، آن عارضه طاری بر شخصیت این طالب درجه کمال از معدنیات (یعنی طلا) را از بین می‌برد. پس او آن را زایل ساخت و آن فلز سالم شد و حرکت کرد تا به درجه کمال رسید. اما در کمالیت، قدرتِ سالمِ مطلق را که هیچ بیماری وارد جسمش نشده، ندارد. زیرا جسمی که بیماری وارد آن شود، بعید است که به خلوص و پاکی‌ای برسد که هیچ کدورتی آن را نیالاید؛ و آن همان خلاص اصلی است، مانند یحیی و آدم (علیهما السلام) در میان انبیا. و هدف او چیزی جز درجه کمال انسانی در عبودیت نبود. زیرا خداوند او را در «أَحْسَنِ تَقْوِيمٍ» (بهترین ساختار) آفرید، سپس او را به «أَسْفَلَ سَافِلِينَ» (پست‌ترین پستی‌ها) بازگرداند، «إِلَّا الَّذِينَ آمَنُوا وعَمِلُوا الصَّالِحاتِ» (مگر کسانی که ایمان آوردند و کارهای شایسته انجام دادند) که بر سلامت اصلی باقی ماندند. و این بدان سبب است که انسان در طبیعت خود، علل اعراض و امراض اغراض را کسب کرده است. پس این حکیم خواست که او را به همان «أَحْسَنِ تَقْوِيمٍ» که خداوند او را بر آن آفرید، بازگرداند. این بود قصد شخص عاقل از شناخت این صنعت که کیمیا نامیده می‌شود، و آن چیزی جز شناخت مقادیر و اوزان نیست.\n\n### [نشأت انسانی]\n\nهنگامی که خداوند انسان را آفرید، و او آدم بود که اصل این نشأت انسانی و صورت جسمانی طبیعی عنصری است، جسم او را از گرم و سرد و مرطوب و خشک، بلکه از سرد خشک، سرد مرطوب، گرم مرطوب و گرم خشک ترکیب کرد. این‌ها همان اخلاط چهارگانه (سوداء، بلغم، دم، صفراء) هستند، همان‌طور که در جسم عالم کبیر، آتش، هوا، آب و خاک وجود دارند. خداوند جسم آدم را از گِل آفرید، که آمیزه‌ای از آب و خاک است، سپس در آن نَفَس و روح دمید. و در نبوت اولی، در برخی کتب نازل شده بر پیامبری از بنی اسرائیل، مطلبی آمده است که اکنون عین نص آن را ذکر می‌کنم، زیرا نیاز به ذکر آن ضروری است. زیرا صادق‌ترین اخبار، آن است که از خداوند متعال روایت شده است. پس ما از مسلمة بن وضاح، به صورت مسند، روایت کردیم که او از اهل قرطبه بود و گفت:\n\nخداوند در بخشی از آنچه بر انبیای بنی اسرائیل نازل کرد، فرمود: «من آدم را از خاک و آب آفریدم و در او نَفَس و روح دمیدم. پس جسد او را از خاک و رطوبت آن را از آب و حرارتش را از نَفَس و برودتش را از روح سامان دادم.» سپس فرمود: «بعد از این، چهار نوع دیگر در جسد قرار دادم که هیچ یک از آن‌ها جز به دیگری برپا نمی‌ماند، و آن‌ها دو مِرّه (صفرا و سودا)، خون و بلغم هستند. سپس برخی از آن‌ها را در برخی دیگر جای دادم. پس جایگاه خشکی را در مِرّه سوداء (سودا) و جایگاه حرارت را در مِرّه صفراء (صفرا) و جایگاه رطوبت را در خون (دم) و جایگاه برودت را در بلغم قرار دادم.» سپس جل ثناؤه فرمود: «پس هر جسدی که این اخلاط در آن معتدل شوند، سلامتش کامل و بنیه‌اش معتدل می‌گردد. و اگر یکی از آن‌ها بر دیگری فزونی یابد و بر آن‌ها غلبه کند، بیماری به همان اندازه فزونی، وارد جسد می‌شود. و اگر ناقص باشد، از مقاومت در برابر آن‌ها ضعیف می‌شود و بیماری به واسطه غلبه آن‌ها و ضعف آن در مقاومت، وارد می‌شود.» پس علم طب این است که برای طلب اعتدال، در ناقص بیفزاید یا از زائد بکاهد.\n\n(این در کلام طولانی از خداوند متعال است که ما آن را در الموعظة الحسنة ذکر کرده‌ایم.)\n\n### [مداوی الکلوم و آثار علوی]\n\nپس این امام از داناترین مردم به این نشأت طبیعی و آثار عالم علوی (العالم العلوي) در آن بود که در انوار کواکب و حرکت آن‌ها (سباحتها) به ودیعه نهاده شده است. و این همان امری است که خداوند در آسمان‌ها و در اقترانات، هبوط‌ها، صعودها، اوج‌ها و حضیض‌های آن‌ها وحی کرده است. خداوند متعال می‌فرماید: «وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا» (و در هر آسمانی امر آن را وحی کرد). و درباره زمین فرمود: «وَقَدَّرَ فِيهَا أَقْوَاتَهَا» (و در آن روزی‌هایش را مقدر ساخت). این شخص در آنچه ذکر کردیم، میدان وسیع و بساط گسترده و قدمی راسخ داشت، اما قدرت او در نظر (فکر) از فلک هفتم فراتر نرفت، از باب ذوق و حال (الحال). اما آنچه در فلک کواکب و فلک اطلس (الأطلس) بود، با کشف (الکشف) و اطلاع برای او حاصل شد. و آنچه بر او غالب بود، در زعم او، قلب اعیان (دگرگون کردن ماهیت اشیا) بود، در حالی که اعیان نزد ما به طور کامل دگرگون نمی‌شوند. این شخص پیوسته با روحانیه خود، از حیث رصد و فکرش، با مقابل خود در درجه و دقایقش در حال حرکت بود. و از اسرار احیای موات (زنده کردن مردگان) عجایبی نزد او بود. و از جمله اموری که خداوند به او اختصاص داده بود، این بود که به هیچ مکانی که دچار خشکسالی شده بود، وارد نمی‌شد مگر اینکه خداوند در آنجا برکت و فراوانی ایجاد می‌کرد، چنانکه:\n\nاز رسول خدا (صلی الله علیه و سلم) درباره خضر (رضی الله عنه) روایت شده است که از نام او پرسیده شد، پیامبر (صلی الله علیه و سلم) فرمود: «بر هیچ زمین خشکی ننشست مگر اینکه زیر او سبز و خرم شد.»\n\n### [معرفت ذاتی و علم قوه]\n\nاین امام شاگرد بزرگی در معرفت ذاتی (المعرفة الذاتية) و علم قوه داشت. او با یارانش در تنبیه بر این شاگرد با لطافت رفتار می‌کرد و او را از عموم یارانش پنهان می‌داشت، از ترس آسیب رسیدن به او از جانب آن‌ها. به همین دلیل «مداوی الکلوم» نامیده شد، همان‌طور که یعقوب، یوسف (علیهما السلام) را از برادرانش پنهان داشت. او عموم یارانش را به علم تدبیر و اموری شبیه به این فن، مانند ترکیب ارواح در اجساد، تحلیل اجساد و تألیف آن‌ها با کندن صورتی از آن‌ها یا پوشاندن صورتی بر آن‌ها مشغول می‌ساخت تا از این طریق بر صنعت خداوند علیم حکیم واقف شوند. و از این قطب (القطب) بود که علم عالم و اینکه عالم، انسان کبیر (إنسان کبیر) است، خارج شد، و اینکه انسان در جرمیت (جسمانیت) مختصر شده و در معنا با عالم کبیر همسان است. روحی که من آنچه را در این کتاب به ودیعه نهاده‌ام از او گرفتم، به من خبر داد که او روزی یارانش را در یک روستا جمع کرد و در میان آن‌ها به خطبه ایستاد، در حالی که هیبتی بر او بود. پس گفت: «آنچه را که در این مقام برای شما رمز می‌کنم، از من بفهمید و در آن بیندیشید و گنج آن و وسعت زمانش را در هر عالمی که هست، استخراج کنید. من برای شما خیرخواهم، و خوراکی که نمی‌داند، فاش می‌شود. زیرا هر علمی اهلی دارد که به آن اختصاص دارند. و انفراد ممکن نیست و وقت گنجایش ندارد. پس ناگزیر در جمع، فطرت‌های مختلف و ذهن‌های ناهمگون وجود دارد. و مقصود از جماعت، یک نفر است که من او را با کلامم قصد می‌کنم و کلید رمز من در دست اوست. و برای هر مقامی سخنی است و برای هر علمی مردانی و برای هر واردی حالی. پس آنچه می‌گویم از من بفهمید و آنچه می‌شنوید به خاطر بسپارید. به نورِ نور قسم می‌خورم و به روحِ حیات و حیاتِ روح سوگند یاد می‌کنم که من از جایی که آمده‌ام، از نزد شما باز خواهم گشت و به اصلی که از آن یافت شده‌ام، رجوع خواهم کرد. اقامت من در این ظلمت طولانی شده و نَفَس من از پی در پی آمدن این غم تنگ گشته است. من درخواست سفر از نزد شما را کرده‌ام و به من اجازه رحیل داده شده است. پس بر کلام من ثابت بمانید تا آنچه را می‌گویم، پس از سپری شدن سال‌هایی که تعیین و تعداد آن‌ها را ذکر کردم، درک کنید. و از اینجا دور نشوید تا پس از این مدت نزد شما بازگردم. و اگر دور شدید، باید به سرعت به این مجلس بازگردید. و اگر معنای آن لطیف شد و معنا بر لفظ غلبه کرد، پس حقیقت، حقیقت (الحقیقة الحقیقة) است و طریقت، طریقت (الطريقة الطريقة). بهشت و دنیا در شیر و بنا مشترک شدند، اگرچه یکی از گِل و کاه است و دیگری از زر و سیم. این بود وصیت او به فرزندانش. و این مسئله‌ای عظیم است که او آن را رمز کرد و رفت. پس هر کس آن را بشناسد، آسوده می‌شود.»\n\n### [دیدار ابن عربی با ابن رشد در قرطبه]\n\nروزی در قرطبه بر قاضی آن، ابوالولید ابن رشد، وارد شدم. او به دیدار من تمایل داشت، زیرا شنیده بود و به او رسیده بود که خداوند در خلوت بر من چه گشایشی (فتح) عطا کرده است. او از آنچه شنیده بود، اظهار تعجب می‌کرد. پدرم مرا به قصد دیدار با او برای کاری نزدش فرستاد، زیرا او از دوستان پدرم بود. من در آن زمان کودکی بودم که هنوز صورتم مویی در نیاورده و سبیلم نروییده بود. هنگامی که بر او وارد شدم، از جای خود به دلیل محبت و بزرگداشت برخاست و مرا در آغوش گرفت و گفت: «آری؟» من به او گفتم: «آری.» پس شادی او از فهم من فزونی یافت. سپس من آنچه را که او را شاد کرده بود، احساس کردم و به او گفتم: «نه.» پس او در هم کشیده شد و رنگش تغییر کرد و در آنچه نزد خود داشت، شک کرد و گفت: «امر را در کشف (الکشف) و فیض الهی (الفیض الإلهي) چگونه یافتید؟ آیا همان است که نظر (فکر عقلی) به ما داده است؟» به او گفتم: «آری و نه. و میان آری و نه، ارواح از موادشان و گردن‌ها از اجسادشان پرواز می‌کنند.» پس رنگش زرد شد و لرزه او را گرفت و شروع به «حوقله» (گفتن لا حول و لا قوة الا بالله) کرد. او آنچه را که من به آن اشاره کردم، فهمید، و آن عین همین مسئله‌ای است که این قطب امام، یعنی مداوی الکلوم، ذکر کرده است. پس از آن، از پدرم خواست که دوباره با ما ملاقات کند تا آنچه را نزد خود دارد، بر ما عرضه کند که آیا موافق است یا مخالف. زیرا او از اصحاب فکر و نظر عقلی بود. پس خداوند متعال را شکر کرد که در زمانی بود که کسی را دید که جاهل وارد خلوت شده و بدون درس و بحث و مطالعه و قرائت، چنین خروجی داشته است. و گفت: «این حالتی است که ما آن را اثبات کرده‌ایم، اما اربابان آن را ندیده‌ایم. پس سپاس خدای را که من در زمانی هستم که یکی از اربابان آن، که قفل‌های درهای آن را می‌گشاید، در آن حضور دارد. و سپاس خدای را که مرا به دیدن او اختصاص داد.» سپس خواستم بار دیگر با او ملاقات کنم، اما خداوند او را در واقعه‌ای (رؤیا) به صورتی برایم مجسم کرد که حجابی نازک میان من و او حائل بود. من از پشت آن به او نگاه می‌کردم، اما او مرا نمی‌دید و جایم را نمی‌شناخت و به خود مشغول بود. پس گفتم: «او برای آنچه ما بر آن هستیم، مطلوب نیست.» و دیگر با او ملاقات نکردم تا اینکه درگذشت. و این در سال پانصد و نود و پنج هجری در شهر مراکش بود. او را به قرطبه منتقل کردند و قبرش در آنجاست. هنگامی که تابوتی را که جسد او در آن بود، بر روی چهارپا قرار دادند، تألیفات او را در طرف دیگر قرار دادند تا تعادل برقرار شود. من ایستاده بودم و فقیه ادیب، ابوالحسین محمد بن جبیر، کاتب سید ابوسعید، و دوست من، ابوالحکم عمر، و ابن السراج ناسخ، با من بودند. ابوالحکم به ما روی کرد و گفت: «آیا نمی‌نگرید به کسی که در این مرکب، با امام ابن رشد تعادل برقرار کرده است؟ این امام است و این‌ها اعمال او (یعنی تألیفاتش).» ابن جبیر به او گفت: «ای فرزندم، آری، چه نیکو نگریستی، دهانت بی‌گزند باد.» پس من آن را به عنوان موعظه و تذکره نزد خود ثبت کردم. خداوند همه آن‌ها را رحمت کند. و از آن جماعت جز من باقی نمانده است. و ما در این باره گفتیم:\n\n> این امام است و این‌ها اعمال او *** ای کاش می‌دانستم آیا آرزوهایش برآورده شد؟\n\n### [مداوی الکلوم و علم فلک]\n\nاین قطب (القطب)، مداوی الکلوم، سرّ حرکت فلک را آشکار ساخت و بیان کرد که اگر فلک بر شکلی غیر از آنچه خداوند آن را آفریده بود، می‌بود، صحیح نبود که چیزی در هستی (الوجود) که تحت احاطه آن است، متکون شود. و حکمت الهی در این امر را بیان کرد تا خردمندان علم خداوند را در اشیا ببینند، «وَإِنَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ» (و او به هر چیزی داناست). لا اله الا هو العلیم الحکیم. و در معرفت ذات و صفات، علمی است که این قطب به آن اشاره کرد. اگر غیر مستدیر (غیر دایره‌ای) حرکت می‌کرد، خلأ (فضای خالی) با حرکت آن آباد نمی‌شد و فضاهای بسیاری در خلأ باقی می‌ماند. در نتیجه، امر به طور کامل از آن حرکت متکون نمی‌شد و به اندازه آنچه از آبادانی آن فضاها با حرکت کاسته می‌شد، از آن کم می‌آمد. و این به مشیت خداوند متعال و حکمت جاری او در وضع اسباب است. این قطب خبر داد که عالم موجود است، در میان محیط و نقطه، بر حسب مراتبشان و کوچکی و بزرگی افلاکشان. و آنچه به محیط نزدیک‌تر است، وسیع‌تر از آن است که در جوف آن قرار دارد. پس روز آن بزرگ‌تر و مکانش گشاده‌تر و زبانش فصیح‌تر است و به تحقق با قوه و صفا نزدیک‌تر است. و هر چه به سوی عناصر پایین‌تر آمده، از این درجه نزول کرده است، تا به کره زمین. و هر جزئی در هر محیطی، با ذات خود، مقابل مافوق و مادون خود قرار می‌گیرد، و هیچ یک بر دیگری چیزی نمی‌افزاید، اگرچه یکی وسیع و دیگری تنگ باشد. و این از باب وارد شدن بزرگ بر کوچک و وسیع بر تنگ است، بدون اینکه تنگ، وسیع شود یا وسیع، تنگ گردد. و همه با ذات خود به نقطه می‌نگرند، و نقطه با کوچکی خود، به هر جزئی از محیط پیرامونش با ذات خود می‌نگرد. پس مختصر، محیط است و مختصرِ محیط، نقطه است، و برعکس. پس بنگر. و هنگامی که امر به عناصر فرود آمد تا به زمین رسید، کدورت آن فزونی یافت، مانند آب در کوزه و روغن و هر مایعی در خمره که کدورت آن به پایین می‌نشیند و بالای آن صاف می‌شود. و معنای این امر، همان چیزی است که عالم طبیعت از حجاب‌های مانع از درک انوار علوم و تجلیات (التجلیات) به واسطه کدورت‌های شهوات و شبهات شرعی و عدم ورع در زبان، نظر، شنیدن، خوردنی، نوشیدنی، پوشیدنی، مرکب و منکح (محل ازدواج) می‌یابد. و کدورت‌های شهوات به واسطه روی آوردن و افراط در آن‌هاست، حتی اگر حلال باشند. و اینکه نیل به شهوات در آخرت، که بزرگ‌تر از شهوات دنیاست، مانع تجلی (التجلی) نمی‌شود، به این دلیل است که تجلی در آنجا بر ابصار (چشم‌های ظاهری) است و ابصار محل شهوات نیستند. اما تجلی در اینجا در دنیا، تنها بر بصائر (بینش‌های باطنی) و بواطن است، نه ظاهر. و بواطن محل شهوات هستند و تجلی و شهوت در یک محل جمع نمی‌شوند. به همین دلیل، عارفان و زاهدان در این دنیا به سوی کم کردن نیل به شهوات آن و دوری از مشغول شدن به کسب متاع آن گرایش یافتند.\n\n### [مراتب ابدال]\n\nاین امام کسی بود که یارانش را آگاه ساخت که هفت مرد هستند که به آن‌ها ابدال (الأبدال) گفته می‌شود. خداوند به واسطه آن‌ها هفت اقلیم را حفظ می‌کند. برای هر بدل (بدل) یک اقلیم است و روحانیه آسمان‌های هفت‌گانه به آن‌ها می‌نگرد. و برای هر یک از آن‌ها، نیرویی از روحانیه انبیایی که در این آسمان‌ها هستند، وجود دارد. و آن‌ها عبارتند از: ابراهیم خلیل، سپس موسی، سپس هارون، سپس ادریس، سپس یوسف، سپس عیسی، سپس آدم (سلام الله علیهم اجمعین). و اما یحیی، او ترددی میان عیسی و هارون دارد. از حقایق این انبیا (علیهم السلام) بر قلب‌های این ابدال هفت‌گانه نازل می‌شود. و این هفت کوکب به آن‌ها می‌نگرند، به واسطه آنچه خداوند در سبحات (انوار) آن‌ها در افلاکشان به ودیعه نهاده است، و به واسطه اسرار و علوم و آثار علوی و سفلی که خداوند در حرکات این هفت آسمان به ودیعه نهاده است. خداوند متعال می‌فرماید: «وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا» (و در هر آسمانی امر آن را وحی کرد). پس در قلب‌های آن‌ها در هر ساعت و در هر روز، بر حسب آنچه صاحب آن ساعت و سلطان آن روز عطا می‌کند، علوم و اسراری وارد می‌شود.\n\n### [اقلیم چهارم و بدل آن]\n\nهر امر علمی که در روز یکشنبه باشد، از ماده ادریس (علیه السلام) است. و هر اثر علوی که در آن روز در عنصر هوا و آتش باشد، از حرکت (سباحة) خورشید و نظر آن است که خداوند در آن به ودیعه نهاده است. و هر اثری که در آن روز در عنصر آب و خاک باشد، از حرکت فلک چهارم است. و جایگاه این شخص که آن را حفظ می‌کند، اقلیم چهارم است. از جمله علومی که برای این شخص مخصوص از ابدال در این اقلیم حاصل می‌شود، علم اسرار روحانیه، علم نور و ضیاء، علم برق و شعاع، و علم هر جسم نورانی است؛ و اینکه چرا نورانی شده و چه مزاجی این قابلیت را به آن داده است، مانند کرم شب‌تاب از حیوانات، و مانند ریشه‌های درخت انجیر از گیاهان، و مانند سنگ ماه (مها) و یاقوت و برخی گوشت‌های حیوانات. و علم کمال در معدن، گیاه، حیوان، انسان و فرشته. و علم حرکت مستقیم در هر کجا که در حیوان یا گیاه ظاهر شود. و علم نشانه‌های تأسیس و نَفَس‌های انوار. و علم خلع ارواح مدبره و روشن ساختن امور مبهم و حل مسائل غامض و مشکل. و علم نغمه‌های فلکی و دولابی و اصوات آلات طرب از اوتار و غیره. و علم تناسب میان آن‌ها و طبایع حیوان و آنچه گیاه از آن دارد. و علم آنچه معانی روحانیه و روایح عطری به آن منتهی می‌شود، و چه مزاجی آن را معطر ساخته و چرا باز می‌گردد و چگونه هوا آن را به ادراک شمی منتقل می‌کند، و آیا جوهر است یا عرض. همه این‌ها را صاحب آن اقلیم در آن روز و در سایر روزها در ساعات حکم حرکت آن فلک و حکم کواکب موجود در آن و روحانیه آن پیامبر، تا پایان چرخه جمعه، درک می‌کند و می‌داند.\n\n### [اقلیم هفتم و بدل آن]\n\nهر امر علمی که در روز دوشنبه باشد، از روحانیه آدم (علیه السلام) است. و هر اثر علوی در عنصر هوا و آتش، از حرکت ماه است. و هر اثر سفلی در عنصر آب و خاک، از حرکت فلک آسمان دنیا است. و اقلیم هفتم برای این شخص است. از جمله علومی که برای این بدل (بدل) در نفس خود در روز دوشنبه و در هر ساعتی از ساعات روزهای جمعه که این فلک در آن حکم دارد، حاصل می‌شود، علم سعادت و شقاوت، علم اسماء و خواص آن‌ها، و علم مد و جزر و فزونی و کاستی.\n\n### [اقلیم سوم و بدل آن]\n\nهر امر علمی که در روز سه‌شنبه باشد، از روحانیه هارون (علیه السلام) است. و هر اثر علوی در عنصر آتش و هوا، از روحانیه مریخ (الأحمر) است. و هر اثر سفلی در رکن آب و خاک، از حرکت فلک پنجم است. و اقلیم سوم برای این بدل است. از جمله علومی که در این روز و در ساعات آن از ایام به او عطا می‌شود، علم تدبیر ملک و سیاست آن، علم پرهیز و حمایت، و ترتیب لشکرها و جنگ و حیله‌های جنگی، و علم قربانی‌ها و ذبح حیوان، و علم اسرار ایام نحر (قربانی) و جریان آن در سایر مکان‌ها، و علم هدایت و ضلالت، و تمییز شبهه از دلیل.\n\n### [اقلیم ششم و بدل آن]\n\nهر امر علمی که در روز چهارشنبه باشد، از روحانیه عیسی (علیه السلام) است، و آن روز نور است. و او در ورود ما به این طریقی که امروز بر آن هستیم، نظری به ما داشت. و هر اثر در عنصر آتش و هوا، از روحانیه حرکت عطارد (الکاتب) در فلکش است. و هر اثر سفلی در رکن آب و خاک، از حرکت فلک آسمان دوم است. و اقلیم ششم برای بدل صاحب این روز است. از جمله علومی که در این روز و در ساعت آن از ایام به او حاصل می‌شود، علم اوهام و الهام (الإلهام) و وحی و آراء و قیاسات و رؤیا و عبادت و اختراع صنعتی و عطاردیت، و علم غلطی که به چشم فهم می‌چسبد، و علم تعالیم و علم کتابت و آداب و زجر و کهانت و سحر و طلسمات و عزائم.\n\n### [اقلیم دوم و بدل آن]\n\nهر امر علمی که در روز پنجشنبه باشد، از روحانیه موسی (علیه السلام) است. و هر اثر علوی در رکن آتش و هوا، از حرکت مشتری است. و هر اثر سفلی در عنصر آب و خاک، از حرکت فلک آن است. و اقلیم دوم برای این بدل است. از جمله علومی که در این روز و در ساعات آن از ایام به او حاصل می‌شود، علم نباتات و نوامیس، و علم اسباب خیر و مکارم اخلاق، و علم قربات، و علم قبول اعمال و اینکه صاحب آن به کجا منتهی می‌شود.\n\n### [اقلیم پنجم و بدل آن]\n\nهر امر علمی که در روز جمعه باشد، برای این شخص است که خداوند به واسطه او اقلیم پنجم را حفظ می‌کند، و آن از روحانیه یوسف (علیه السلام) است. و هر اثر علوی که در رکن آتش و هوا باشد، از نظر کوکب زهره است. و هر اثر سفلی در رکن آب و زمین، از حرکت فلک زهره است. و این از امری است که خداوند در هر آسمانی وحی کرده است. و این آثار، همان امر الهی است که میان آسمان و زمین نازل می‌شود، و در هر چیزی است که میان آن دو متولد می‌شود؛ میان آسمان به واسطه آنچه از آن نازل می‌شود و میان زمین به واسطه آنچه از این نزول می‌پذیرد، همان‌طور که رحم زن، آب مرد را برای تکوین می‌پذیرد و هوای مرطوب، پرنده را. خداوند متعال می‌فرماید: «خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ الْأَرْضِ مِثْلَهُنَّ يَتَنَزَّلُ الْأَمْرُ بَيْنَهُنَّ لِتَعْلَمُوا أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ» (خداوند هفت آسمان و از زمین نیز مانند آن‌ها آفرید. امر میان آن‌ها نازل می‌شود تا بدانید که خداوند بر هر چیزی تواناست). و قدرت تنها به ایجاد تعلق دارد. پس دانستیم که مقصود از این نزول، همان تکوین است. و از جمله علومی که در این روز و در ساعات آن از ایام به او حاصل می‌شود، علم تصویر از حضرت جمال و اُنس و علم احوال است.\n\n### [اقلیم اول و بدل آن]\n\nهر امر علمی که در روز شنبه باشد، برای این بدل است که حفظ اقلیم اول به اوست، و آن از روحانیه ابراهیم خلیل (علیه السلام) است. و هر اثر علوی که در آن در رکن آتش و هوا باشد، از حرکت کوکب کیوان (زحل) در فلکش است. و هر اثری که در عالم سفلی، رکن زمین و آب باشد، از حرکت فلک آن است. خداوند متعال درباره کواکب سیاره می‌فرماید: «كُلٌّ فِي فَلَكٍ يَسْبَحُونَ» (هر یک در مداری شناورند). و فرمود: «وَبِالنَّجْمِ هُمْ يَهْتَدُونَ» (و به وسیله ستاره‌ها هدایت می‌یابند). پس آن‌ها را برای هدایت به واسطه آن‌ها آفرید. و از جمله علومی که در این روز و در ساعات آن از باقی ایام، شب و روز، به او حاصل می‌شود، علم ثبات و تمکین، و علم دوام و بقا (البقاء) است.\n\n### [مقامات ابدال هفت‌گانه و هجیره‌هایشان]\n\nاین امام به مقامات (مقامات) این ابدال و هجیره‌های (ذکرها/وردها) آن‌ها آگاه بود و گفت: هجیره و مقام اول «لَيْسَ كَمِثْلِهِ شَيْءٌ» (هیچ چیز مانند او نیست) است. و سبب آن، اولیت اوست، زیرا اگر پیش از او مثلی می‌بود، اولیت برای او صحیح نبود. پس ذکر او مناسب مقام اوست. و مقام شخص دوم در هجیره‌اش «لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِمَاتُ رَبِّي» (اگر دریاها تمام شوند، کلمات پروردگارم تمام نمی‌شود) است. و این مقام علم الهی (العلم الإلهي) است و تعلق آن پایان نمی‌پذیرد. و این دومین وصف است، زیرا اولین وصف، حیات است و پس از آن علم می‌آید. و هجیره و مقام شخص سوم «وَفِي أَنفُسِكُمْ أَفَلَا تُبْصِرُونَ» (و در خودتان، آیا نمی‌بینید؟) است. و این مرتبه سوم است، زیرا آیات اول، اسماء الهی هستند و آیات دوم در آفاق و آیات پس از دوم در نفس‌های ما هستند. خداوند متعال می‌فرماید: «سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ» (به زودی آیات خود را در آفاق و در نفس‌هایشان به آن‌ها نشان خواهیم داد). به همین دلیل، این هجیره به بدل سوم اختصاص یافته است. و مقام چهارم در هجیره‌اش «يَا لَيْتَنِي كُنتُ تُرَابًا» (ای کاش خاک بودم) است. و این رکن چهارم از ارکان است که نزد کسانی که به آن قائلند، مرکز را می‌طلبد. و هیچ چیز به نقطه کره نزدیک‌تر از زمین نیست. و آن نقطه سبب وجود محیط بود. پس او قرب به خداوند، ایجادکننده اشیا، را می‌طلبد و این حاصل نمی‌شود مگر با تواضع. و در تواضع، چیزی پایین‌تر از زمین نیست، که منبع علوم و جوشش رودخانه‌هاست. و هر آنچه از ابرها نازل می‌شود، از بخارات رطوبت‌هایی است که از زمین بالا می‌رود. پس چشمه‌ها و رودخانه‌ها از آن می‌جوشند و بخارات به جوّ خارج می‌شوند و به آب تبدیل شده و به صورت باران نازل می‌گردند. به همین دلیل، چهارم به رکن چهارم اختصاص یافته است. و مقام پنجم «فَاسْأَلُوا أَهْلَ الذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ» (پس اگر نمی‌دانید، از اهل ذکر بپرسید) است. و سؤال نمی‌کند مگر مولود، زیرا او در مقام طفولیت است، که همان نَدی (شبنم) است. خداوند متعال می‌فرماید: «أَخْرَجَكُم مِّن بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا» (شما را از شکم مادرانتان خارج کرد در حالی که چیزی نمی‌دانستید). پس نمی‌داند تا اینکه سؤال کند. و فرزند در مرتبه پنجم است، زیرا مادران او چهار تا هستند (ارکان)، پس او عین پنجم بود. به همین دلیل، سؤال، هجیره بدل پنجم از میان ابدال شد. و اما مقام ششم، هجیره آن «أُفَوِّضُ أَمْرِي إِلَى اللَّهِ» (کارم را به خدا واگذار می‌کنم) است. و این مرتبه ششم است، پس برای ششم بود. و اینکه ششم برای او بود، به این دلیل است که او در مرتبه پنجم، همان‌طور که ذکر کردیم، سؤال می‌کند و نمی‌دانست. پس هنگامی که سؤال کرد، دانست. و چون دانست، به علم خود به پروردگارش محقق شد. پس کار خود را به او واگذار کرد، زیرا دانست که هیچ چیز از کارش در دست او نیست و خداوند «يَفْعَلُ مَا يُرِيدُ» (آنچه می‌خواهد انجام می‌دهد). پس گفت: «دانستم که چون خداوند مالک امر من است و او آنچه می‌خواهد انجام می‌دهد، واگذاری کار در این باره برای من ارجح است.» به همین دلیل، آن را هجیره خود قرار داد. و مقام هفتم «إِنَّا عَرَضْنَا الْأَمَانَةَ» (ما امانت را عرضه کردیم) است. و این بدان سبب است که امانت مرتبه هفتم را دارد. و همچنین تکوین آدم، که تعبیر از انسان است، در مرتبه هفتم بود. زیرا او از عقل، سپس نفس، سپس هباء، سپس فلک، سپس فاعلان، سپس منفعلان پدید آمد. این‌ها شش تا هستند، سپس انسان که آدم است، در مرتبه هفتم متکون شد. و چون وجود انسان در سنبله بود و سنبله در دلالت زمانی هفت هزار سال دارد، پس انسان در مرتبه هفتم از مدت یافت شد. و امانت را حمل نکرد مگر کسی که به هفت تحقق یافته باشد. و این شخص، هفتمین بدل از ابدال بود. به همین دلیل، این آیه را هجیره خود قرار داد. پس ما مراتب ابدال را برای تو بیان کردیم.\n\n### [جانشینان قطب مداوی الکلوم]\n\nبه من خبر داده شد که این قطب (القطب) که مداوی الکلوم است، در زمان حبسش در هیکل خود و ولایتش در عالم، اگر می‌ایستاد، هفتاد قبیله به احترام ایستادن او می‌ایستادند که همه آن‌ها معارف الهی (المعارف الإلهية) و اسرار هستی (أسرار الوجود) در آن‌ها ظاهر شده بود. و کلام او هرگز از هفت فراتر نمی‌رفت. او زمان طولانی در میان یارانش ماند و در زمان خود، شخصی فاضل از یارانش را که نزدیک‌ترین فرد به او در مجلس بود، تعیین کرد. نام او «المستسلم» (تسلیم شده) بود. هنگامی که این امام درگذشت، المستسلم مقام او را در قطبیت (القطبية) به عهده گرفت. علم غالب او، علم زمان بود، و این علم شریفی است که از آن ازل شناخته می‌شود و از آن قول پیامبر (علیه السلام) ظاهر شد که: «کان الله ولا شیء معه» (خداوند بود و هیچ چیز با او نبود). و این علمی است که جز افراد (الأفراد) از مردان آن را نمی‌دانند، و از آن به دهر اول (الدهر الأول) و دهر دهرها تعبیر می‌شود. و از این ازل، زمان وجود یافت و خداوند به واسطه آن به «الدهر» نامیده شد، و این همان قول پیامبر (علیه السلام) است که: «لا تسبوا الدهر فإن الله هو الدهر» (به دهر دشنام ندهید، زیرا خداوند همان دهر است).\n\nو این حدیث صحیح و ثابت است. و هر کس علم دهر را به دست آورد، در هیچ چیز که به حق (الحق) نسبت دهد، توقف نمی‌کند، زیرا دهر دارای وسعت اعظم است. و از این علم بود که اقوال در مورد اله (خداوند) متعدد شد و عقاید مختلف گشت. و این علم همه آن‌ها را می‌پذیرد و هیچ یک را رد نمی‌کند. و آن علم عام و ظرف الهی است. و اسرار آن شگفت‌انگیز است. او عین موجودی ندارد، اما در هر چیزی حاکم است. نسبت حق را می‌پذیرد و نسبت کون (عالم) را می‌پذیرد. او سلطان همه اسماء، چه معین و چه غایب از ما، است. پس این امام در آن ید بیضاء (قدرت کامل) داشت. و از علم او به دهر دهرها، علم حکمت دنیا در بازی کردن با اهلش بود، و اینکه چرا بازی نامیده شد، در حالی که خداوند آن را ایجاد کرده است. و اغلب بازی به زمان نسبت داده می‌شود و گفته می‌شود: «زمان با اهلش بازی کرد.» و این متعلق به سابقه (تقدیر ازلی) است و حاکم در عاقبت است. این امام کسب (مال) را مذمت می‌کرد و به آن قائل نبود، با وجود معرفتش به حکمت آن، اما با این کار همت یارانش را از تعلق به واسطه‌ها بالا می‌برد. به من خبر داده شد که او نمرد مگر اینکه از اسرار حق (الحق) در خلقش، سی و شش هزار و پانصد علم از علوم علوی خاص را دانست. او درگذشت (رحمه الله) و پس از او شخصی فاضل به نام «مُظهِر الحق» (آشکارکننده حق) جانشین شد. او صد و پنجاه سال زندگی کرد و درگذشت. و پس از او «الهائج» (برانگیخته) جانشین شد. او شأن بزرگی داشت و با شمشیر ظاهر شد. صد و چهل سال زندگی کرد و در غزوه کشته شد. اسم الهی غالب بر حال او، «القهار» بود. هنگامی که کشته شد، پس از او شخصی به نام «لقمان» جانشین شد، و خدا داناتر است. او ملقب به «واضع الحکم» (نظام‌دهنده حکمت) بود. صد و بیست سال زندگی کرد. او به ترتیب و علوم ریاضی، طبیعی و الهی عارف بود. او بسیار به یارانش وصیت می‌کرد. اگر او همان لقمان باشد، خداوند آنچه را که به پسرش وصیت می‌کرد، برای ما ذکر کرده است که دلالت بر مرتبه او در علم به خدا و تشویق او به قصد و اعتدال در امور در عموم احوال دارد. هنگامی که او درگذشت (رحمه الله)، و این در زمان داوود (علیه السلام) بود، پس از او شخصی به نام «الکاسب» (کسب‌کننده) جانشین شد. او قدمی راسخ در علم مناسبات میان دو عالم و مناسبت الهی داشت که عالم به واسطه آن بر این صورتی که هست، وجود یافت. این امام هرگاه می‌خواست اثری را در هستی (الوجود) ظاهر سازد، با نظری مخصوص و بر وزنی معلوم، در نفس خود به مؤثر آن از عالم علوی می‌نگریست، پس آن اثر بدون مباشرت و حیله طبیعی ظاهر می‌شد. او می‌گفت: «خداوند تمام علم را در افلاک به ودیعه نهاده است و انسان را مجموع رقیقه‌های تمام عالم قرار داده است.» پس از انسان تا هر چیزی در عالم، رقیقه‌ای امتداد یافته است. از آن رقیقه، آنچه را که خداوند نزد آن شیء از اموری که او را بر آن امین ساخته، به ودیعه نهاده است، در انسان حاصل می‌شود تا آن را به این انسان برساند. و به واسطه آن رقیقه، انسان عارف آن شیء را برای آنچه می‌خواهد، به حرکت درمی‌آورد. پس هیچ چیزی در عالم نیست مگر اینکه اثری در انسان دارد و انسان اثری در آن دارد. پس برای او کشف این رقیقه‌ها و معرفت آن‌ها حاصل بود، و آن‌ها مانند پرتوهای نور هستند. این امام هشتاد سال زندگی کرد. و هنگامی که درگذشت، شخصی به نام «جامع الحکم» (جمع‌کننده حکمت‌ها) وارث او شد. او صد و بیست سال زندگی کرد. او کلام عظیمی در اسرار ابدال و شیخ و مرید داشت. او به اسباب قائل بود و اسرار نباتات به او عطا شده بود. او در هر علمی که به اهل این طریق اختصاص دارد، قدمی داشت. و در آنچه در این باب ذکر کردیم، کفایت است. و خداوند «يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 6
}