{
  "id": 182,
  "title": {
    "ar": "الباب الثاني والثمانون ومائة في معرفة مقام السماع",
    "en": "Chapter One Hundred and Eighty-Two: Concerning the Knowledge of the Station of Spiritual Audition (مقام السماع)",
    "ur": "ایک سو بیاسیواں باب: مقام سماع (السماع) کی معرفت (المعرفۃ) کے بیان میں۔",
    "fa": "باب صد و هشتاد و دوم در معرفت مقام سماع"
  },
  "content": {
    "ar": "## (الباب الثاني والثمانون ومائة في معرفة مقام السماع)\n\n\n> خذها إليك نصيحة من مشفق *** ليس السماع سوى السماع المطلق‏\n\n\n> واحذر من التقييد فيه فإنه *** قول يفند كل عند محقق‏\n\n\n> أن السماع من الكتاب هو الذي *** يدريه كل معلم ومطرق‏\n\n\n> إن التغني بالقرآن سماعنا *** والحق ينطق عند كل منطق‏\n\n\n> والله يسمع ما يقول عبيده *** من قوله فسماعه بتحقق‏\n\n\n> أصل الوجود سماعنا من قول كُنْ *** فبه نكون ونحن عين المنطق‏\n\n\n> انظر إلى تقديمه في آية *** تعثر على العلم الشريف المرهق‏\n\n\n> فالسمع أشرف ما تحقق عارف *** بتعلق وتحقق وتخلق‏\n\n\nقال تعالى سَمِيعٌ عَلِيمٌ وقال سَمِيعٌ بَصِيرٌ فقدمه على العلم والبصر أول شي‏ء علمناه من الحق وتعلق به منا القول منه والسماع منا فكان عنه الوجود وكذلك نقول في هذا الطريق كل سماع لا يكون عنه وجد وعن ذلك الوجد وجود فليس بسماع فهذه رتبة السماع التي يرجع إليها أهل الله ويسمعون فقوله تعالى للشي‏ء قبل كونه كن هو الذي يراه أهل السماع في قول القائل وتهيؤ السامع المقول له كن للتكوين بمنزلة الوجد في السماع ثم وجوده في عينه عن قوله كن كما قال تعالى كُنْ فَيَكُونُ بمنزلة الوجود الذي يجده أهل السماع في قلوبهم من العلم بالله الذي أعطاهم السماع في حال الوجد فمن لم يسمع سماع وجود فما سمع ولهذا جعل القوم الوجود بعد الوجد ولما لم يصح الوجود أعني وجود العالم إلا بالقول من الله والسماع من العالم لم يظهر وجود طرق السعادة وعلم الفرق بينها وبين طرق الشقاء إلا بالقول الإلهي والسماع الكوني فجاءت الرسل بالقول جميعهم من قرآن وتوراة وإنجيل وزبور وصحف فما ثم إلا قول وسماع غير هذين لم يكن فلو لا القول ما علم مراد المريد ما يريده منا ولو لا السمع ما وصلنا إلى تحصيل ما قبل لنا فبالقول نتصرف وعن القول‏\nنتصرف مع السماع فهما مرتبطان لا يصح استقلال واحد منهما دون الآخر وهما نسبتان فبالقول والسماع نعلم ما في نفس الحق إذ لا علم لنا إلا بإعلامه وإعلامه بقوله ولا يشترط في القول الآلة ولا في السماع بل قد يكون بآلة وبغير آلة وأعني بآلة القول اللسان وآلة السماع الأذن فإذا علمت مرتبة السماع في الوجود وتميزه عن غيره من النسب فاعلم أن السماع عند أهل الله مطلق ومقيد فالمطلق هو الذي عليه أهل الله ولكن يحتاجون فيه إلى علم عظيم بالموازين حتى يفرقوا بين قول الامتثال وبين قول الابتلاء وليس يدرك ذلك كل أحد ومن أرسله من غير ميزان ضل وأضل والمقيد هو السماع المقيد بالنغمات المستحسنات التي يتحرك لها الطبع بحسب قبوله وهو الذي يريدونه غالبا بالسماع لا السماع المطلق فالسماع على هذا الحد ينقسم على ثلاثة أقسام سماع إلهي وسماع روحاني وسماع طبيعي فالسماع الإلهي بالأسرار وهو السماع من كل شي‏ء وفي كل شي‏ء وبكل شي‏ء والوجود عندهم كله كلمات الله وكلماته لا تنفد ولهم في مقابلة هذه الكلمات إسماع لا تنفد تحدث لهم هذه الأسماع في سرائرهم بحدوث الكلمات وهو قوله ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ إِلَّا اسْتَمَعُوهُ فمنهم من أعرض بعد السماع ومنهم من وقف عند ما سمع وهذا مقام لا يعلمه كل أحد وما في الوجود إلا هو ولكن يجهل ولا يعلم وهو يتعلق بأسماء الله تعالى على كثرتها فلكل اسم لسان ولكل لسان قول ولكل قول منا سمع والعين واحد من القائل والسامع فإن كان نداء أجبنا وامتثلنا وكان من قوله إن قال لنا ادْعُونِي أَسْتَجِبْ لَكُمْ فكما قال وسمعنا أمرنا عند ما جعل فينا قوة القول أن نقول فيسمع هو تعالى فمنا من يقول به كما\n\n\nقال إن الله قال على لسان عبده سمع الله لمن حمده‏\n\n\nفكلام صاحب هذا المقام كله نيابة ومنا من يقول بنفسه في زعمه وما هو كذلك في نفس الأمر فإن الله عند لسان كل قائل فكما أنه ليس في الوجود إلا الله كذلك ما ثم قائل ولا سامع إلا الله وكما قسمنا قولنا بين من يقول بالله ويقوله بنفسه كذلك سماعنا منا من يسمع بربه وهوقوله كنت سمعه الذي يسمع به‏\n\n\nومنا من يسمع بنفسه في زعمه والأمر على خلافه فهذا هو السماع الإلهي وهو سار في جميع المسموعات وأما السماع الروحاني فمتعلقه صريف الأقلام الإلهية في لوح الوجود المحفوظ من التغيير والتبديل فالوجود كله رق منشور والعالم فيه كتاب مسطور فالأقلام تنطق وآذان العقول تسمع والكلمات ترتقم فتشهد وعين شهودها عين الفهم فيها بغير زيادة ولا ينال هذا السماع إلا العقول التي ظهرت لمستوي ولما كان السماع أصله على التربيع وكان أصله عن ذات ونسبة وتوجه وقول فظهر الوجود بالسماع الإلهي كذلك السماع الروحاني عن ذات ويد وقلم وصريف قلم فيكون الوجود للنفس الناطقة في سماع صريف هذه الأقلام في ألواح القلوب بالتقليب والتصريف وكذلك السماع الطبيعي مبناه على أربعة أمور محققة فإن الطبيعة مربعة معقولة من فاعلين ومنفعلين فأظهرت الأركان الأربعة أيضا فظهرت النشأة الطبيعية على أربعة أخلاط وأربع قوى قامت عليها هذه النشأة وكل خلط منها يطلب بذاته من يحركه لبقائه وبقاء حكه فإن السكون عدم فأوجد في نفوس العلماء حين سمعوا صريف الأقلام ما ينبغي أن يحرك به هذه النشأة الطبيعية فأقاموا لها أربع نغمات لكل خلط من هذه الأخلاط نغمة في آلة مخصوصة وهي المسماة في الموسيقى وهو علم الألحان والأوزان بالبم والزير والمثنى والمثلث كل واحد من هذه يحرك خلطا من هذه الأخلاط ما بين حركة فرح وحركة بكاء وأنواع الحركات وهذا لها بما هي نشأة طبيعية لا بما هي روحانية فإن الحركة في النشأة الطبيعية والسماع الطبيعي لا يكون معه علم أصلا وإنما صاحبه يجد طربا في نفسه أو حزنا عند سماع هذه النغمات من هذه الآلات ومن أصوات القوالين ولا يجد معها علما أصلا فإنه ليس هذا حظ السماع الطبيعي مع الحال الصحيح والوجد الصحيح الذي يطلبه الطبع وهو سماع الناس اليوم والسماع الروحاني يكون معه علم ومعرفة في غير مواد جملة واحدة والسماع الإلهي يكون معه علم ومعرفة في مواد وفي غير مواد عام التعلق يجده في السماع الطبيعي والروحاني لكن بالسمع الإلهي الذي يخص الطبع والعقل خاصة ومنهم من يعلم ذلك ومنهم من لا يعلمه مع كونه يجده ولا يقدر على إنكار ما يجد فسماع الحق مطلق كما أن وجوده مطلق وتمييزه عسير وللنغمات في الكلام الإلهي والقول أصل تستند إليه وهو أقوى الأصول ولهذا لها القوة والتأثير في الطباع فلا يستطيع أحد أن يدفع عن نفسه عند ورود النغمة وتعلق السمع بها\nإذا صادفت محلها ذلك الطرب أو الأثر الذي يجده السامع في نفسه فسلطانها قوي وذلك لقوة أصلها الذي تستند إليه فإن الأسماء الإلهية وإن كانت لعين واحدة فمعلوم عند أهل الله ما بينها من التفاوت ولما كان التفاوت معقولا فيها وعلم ذلك بآثارها علمنا أن الحقائق الإلهية التي استندت إليها هذه النغمات أقوى من الذي استند إليه الكلام فإنا نسمع قارئا يقرأ أو منشدا ينشد شعرا فلا نجد في نفوسنا حركة لذلك بل ربما نتبرم من ذلك في أوقات لأنه جاء على غير الوزن الطبيعي فإذا سمعنا تلك الآية أو الشعر من صاحب نغمة وفي حقها في الميزان أصابنا وجد وحركنا ووجدنا ما لم نكن نجد فلهذا فرقنا بين ما استندت إليه النغمات الطبيعية وبين ما استند إليه القول هذا ميزان المحسوس وأما ميزان العقل فينظر حكمة الترتيب الإلهي في العالم فإن كان من أهل السماع الإلهي فينظر ترتيب الأسماء الإلهية فيكون سماعه من هناك وإن كان من أهل السماع الروحاني فينظر ترتيب آثارها في العالم الأعلى والأسفل فيجد في كل مسموع فإن المسموعات كلها نغم عنده فمنهم من تكون له حركة محسوسة ومنهم من لا تكون له وأما الحركة الروحانية فلا بد منها ولله طائفة خرجت عن الحركات الروحانية إلى الحركات الإلهية وهو قول الجنيد وتَرَى الْجِبالَ تَحْسَبُها جامِدَةً وهِيَ تَمُرُّ مَرَّ السَّحابِ ولكن في الحال التي تحسبها جامدة فتنسب الحركة إلى هذا الشخص نسبتها إلى الجناب الأقدس في فرحه بتوبة عبده وتبشبشه لمن أتى بيته فهذه أحوال إلهية يجب الايمان بها ولا يعقل لها كيفية إلا من خصه الله بها وكانت حركته في سماعه إلهية وهي من العلوم التي تنال ولا تنقال وليس الخير بالنزول إلى السماء الدنيا كل ليلة يشبه هذا الفرح ولا التبشبش لأن هذا الفرح عن سبب كوني ظهر وجوده سمع الحق عليه والنزول إلى السماء الدنيا عن أمر يتوقع لا عن أمر واقع فالأول يلحق بباب السماع والثاني لا يلحق به فاعلم ذلك وقد ربطنا السماع بما يجب له وحققناه ولم نترك منه فصلا ولا قسما إلا ذكرناه بأوجز عبارة ليوقف عنده وحكاياته كثيرة لا يحتاج إلى إيرادها فإن كتابنا هذا مبناه على تحقيق أصول الأمور لا على الحكايات فإن الكتب بها مشحونة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter One Hundred and Eighty-Two: Concerning the Knowledge of the Station of Audition\n\nTake this advice from one who is compassionate:\nAudition (السماع) is nothing but Absolute Audition (السماع المطلق).\nBeware of restriction in it, for that is a saying\nRefuted by every realized one (محقق).\nThe Audition of the Book (الكتاب) is that which\nEvery teacher and seeker knows.\nOur Audition is the chanting of the Qur'an,\nAnd The Real (الحق) speaks through every utterance.\nAnd Allah hears what His servants say of His speech,\nSo His Audition is by realization (تحقق).\nThe origin of Existence (الوجود) is our Audition of the command \"Be!\" (كُنْ),\nFor by it we come into being, and we are the very essence of utterance (عين المنطق).\nLook at its precedence in the verse,\nAnd you will stumble upon the noble, profound Knowledge (العلم الشريف المرهق).\nThus, Hearing (السمع) is the noblest thing a Gnostic (عارف) realizes,\nThrough connection (تعلق), realization (تحقق), and ethical transformation (تخلق).\n\nAllah the Exalted said: <<سَمِيعٌ عَلِيمٌ>> (All-Hearing, All-Knowing) and He said: <<سَمِيعٌ بَصِيرٌ>> (All-Hearing, All-Seeing). He gave it precedence over Knowledge (العلم) and Sight (البصر). The first thing we knew of The Real (الحق) and to which we related was the Word (القول) from Him and the Audition (السماع) from us. From this came Existence (الوجود). Likewise, we say concerning this Path (الطريق): every Audition that does not result in ecstasy (وجد), and from that ecstasy, existence (وجود), is not true Audition.\n\nThis is the rank (رتبة) of Audition to which the People of Allah (أهل الله) return and by which they hear. The saying of the Exalted to a thing before its existence, \"Be!\" (كن), is what the People of Audition see in the utterance of the speaker. The readiness of the listener—the one addressed by \"Be!\"—for creation (التكوين) is equivalent to the ecstasy (وجد) in Audition. Then, its existence in its essence (عينه) resulting from His saying \"Be!\"—as the Exalted said: <<كُنْ فَيَكُونُ>> (Be, and it is)—is equivalent to the existence (الوجود) that the People of Audition find in their hearts, stemming from the Knowledge of Allah (العلم بالله) granted to them by Audition during the state of ecstasy.\n\nWhoever does not hear the Audition of Existence (سماع وجود) has not truly heard. This is why the folk (القوم) placed Existence after Ecstasy. Since existence—meaning the existence of the World (العالم)—is only validated by the Word from Allah and the Audition from the World, the existence of the paths of felicity and the knowledge of the difference between them and the paths of wretchedness only became manifest through the Divine Word (القول الإلهي) and the Cosmic Audition (السماع الكوني). Thus, all the Messengers came with the Word: the Qur'an, the Torah, the Gospel, the Psalms, and the Scrolls. There is nothing there except Word and Audition; nothing else existed. Were it not for the Word, the will of the One Who Wills concerning what He desires from us would not be known. Were it not for Hearing (السمع), we would not attain what was accepted for us.\n\nBy the Word, we act, and from the Word, we act in conjunction with Audition. They are linked; neither can stand independently of the other. They are two relations (نسبتان). Through the Word and Audition, we know what is in the Self of The Real (نفس الحق), for we have no Knowledge (علم) except by His informing us, and His informing us is by His Word. Neither the instrument (آلة) is required for the Word nor for Audition. Rather, it may occur with an instrument or without one. By the instrument of the Word, I mean the tongue, and the instrument of Audition, the ear.\n\nHaving known the rank (مرتبة) of Audition in Existence and its distinction from other relations, know that Audition (السماع) among the People of Allah (أهل الله) is Absolute (مطلق) and Restricted (مقيد). The Absolute Audition is that which the People of Allah adhere to, but they require great knowledge of the balances (الموازين) in it, so that they may distinguish between the word of compliance (قول الامتثال) and the word of trial (قول الابتلاء). Not everyone grasps this, and whoever releases it without a balance (ميزان) goes astray and leads others astray. The Restricted Audition is the Audition bound by pleasing melodies (النغمات المستحسنات) to which the natural disposition (الطبع) responds according to its acceptance. This is what they usually mean by Audition, not the Absolute Audition.\n\nAudition, according to this definition, is divided into three categories: Divine Audition (سماع إلهي), Spiritual Audition (سماع روحاني), and Natural Audition (سماع طبيعي).\n\nDivine Audition is through the secrets (الأسرار). It is the Audition from everything, in everything, and by everything. For them, all Existence (الوجود) consists of the Words of Allah, and His Words are inexhaustible. Corresponding to these Words, they have inexhaustible hearings (إسماع). These hearings occur in their innermost beings (سرائرهم) corresponding to the occurrence of the Words. This is His saying: <<مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ إِلَّا اسْتَمَعُوهُ>> (No fresh reminder comes to them from their Lord except that they listen to it). Among them, some turn away after the Audition, and some stop at what they heard. This is a station (مقام) not known by everyone. There is nothing in Existence but Him, yet He is ignored and not known. This relates to the Names of Allah (أسماء الله تعالى) in their multiplicity. For every Name, there is a tongue; for every tongue, a word; and for every word, there is hearing from us. The essence (العين) of the speaker and the listener is one. If it is a call, we respond and comply. It is part of His Word when He says to us: <<ادْعُونِي أَسْتَجِبْ لَكُمْ>> (Call upon Me; I will respond to you). Just as He spoke and we heard, He commanded us, when He placed the power of speech within us, to speak so that He, the Exalted, may hear. Thus, some of us speak *by* Him, as He said: \"Allah said upon the tongue of His servant: 'Allah hears the one who praises Him.'\" The speech of the possessor of this station is entirely vicarious representation (نيابة). And some of us speak *by* ourselves, in our presumption, though this is not the case in reality (نفس الأمر), for Allah is present at the tongue of every speaker. Just as there is nothing in Existence but Allah, so too there is no speaker or listener but Allah. Just as we divided our speech between those who speak *by* Allah and those who speak *by* themselves, so too is our Audition: some of us hear *by* our Lord—which is His saying: \"I was his hearing (سمعه) by which he hears\"—and some of us hear *by* ourselves, in their presumption, though the reality is otherwise. This is the Divine Audition, and it permeates all things heard (المسموعات).\n\nAs for Spiritual Audition, its object of connection is the scratching sound (صريف) of the Divine Pens (الأقلام الإلهية) upon the Tablet of Existence (لوح الوجود), which is preserved from alteration and change. All Existence is an unrolled parchment (رق منشور), and the World (العالم) within it is a written book (كتاب مسطور). The Pens speak, the ears of the intellects (العقول) hear, and the Words are inscribed, so they witness. The essence of their witnessing is the essence of understanding (الفهم) them without addition. This Audition is attained only by the intellects that have manifested for the One Who is established (مستوي). Since Audition fundamentally rests upon the quaternary (التربيع)—its origin being Essence (ذات), relation (نسبة), orientation (توجه), and Word (قول)—Existence manifested through Divine Audition. Likewise, Spiritual Audition arises from Essence, Hand, Pen, and the scratching sound of the Pen. Thus, existence (الوجود) occurs for the rational soul (النفس الناطقة) in hearing the scratching of these Pens upon the tablets of the hearts (ألواح القلوب) through transformation and disposition.\n\nSimilarly, Natural Audition is based on four realized matters, for Nature (الطبيعة) is a conceptualized quaternary derived from two active principles (فاعلين) and two passive principles (منفعلين). It also manifested the four elements (الأركان الأربعة). Thus, the natural constitution (النشأة الطبيعية) appeared based on four humors (أخلاط) and four powers upon which this constitution stands. Each humor inherently seeks that which moves it for its preservation and the preservation of its rule, for stillness is non-existence. Therefore, when the scholars heard the scratching of the Pens, they found within their souls what ought to move this natural constitution. They established four melodies (نغمات) for it—one melody for each of these humors—played on a specific instrument. These are named in music (الموسيقى), which is the science of melodies and rhythms (الألحان والأوزان), as the *Bamm*, the *Zīr*, the *Muthannā*, and the *Muthallath*. Each of these moves one of the humors, resulting in movements ranging from joy to weeping and various other movements. This effect is due to its being a natural constitution, not a spiritual one. Movement in the natural constitution and Natural Audition is not accompanied by Knowledge (علم) at all. Rather, its possessor finds only rapture (طرب) or sorrow within himself upon hearing these melodies from these instruments or from the voices of the singers. He finds no Knowledge whatsoever with it, for this is not the portion of Natural Audition, even with the correct spiritual state (الحال الصحيح) and the correct ecstasy (الوجد الصحيح) sought by the natural disposition. This is the Audition of people today.\n\nSpiritual Audition is accompanied by Knowledge and Gnosis (معرفة) entirely in non-material substances. Divine Audition is accompanied by Knowledge and Gnosis in material and non-material substances, having a general connection that one finds in Natural and Spiritual Audition, but specifically through the Divine Hearing (السمع الإلهي) that pertains particularly to the natural disposition and the intellect (العقل). Some know this, and some do not know it, despite experiencing it and being unable to deny what they find. The Audition of The Real (سماع الحق) is Absolute, just as His Existence is Absolute, and distinguishing it is difficult.\n\nMelodies (النغمات) in the Divine Speech (الكلام الإلهي) and the Word have an origin upon which they rely, and it is the strongest of origins. This is why they possess power and influence over the natural dispositions (الطباع). No one can ward off from himself that rapture or effect that the listener finds within himself when the melody arrives and the hearing connects with it, provided it meets its proper place. Its authority is strong because of the strength of the origin upon which it relies. Although the Divine Names (الأسماء الإلهية) belong to a single Essence (عين واحدة), the difference between them is known to the People of Allah. Since the difference is intelligible within them and is known through their effects, we know that the Divine Realities (الحقائق الإلهية) upon which these melodies rely are stronger than that upon which mere speech relies. For we may hear a reciter reciting or a chanter chanting poetry, and we find no movement in our souls because of it; rather, we may sometimes become annoyed because it is not according to the natural rhythm (الوزن الطبيعي). But if we hear that same verse or poetry from a person of melody, and it is given its due in the balance (الميزان), ecstasy (وجد) strikes us, moves us, and we find what we did not find before. For this reason, we distinguish between that upon which natural melodies rely and that upon which the Word relies. This is the balance of the sensible (ميزان المحسوس).\n\nAs for the balance of the intellect (ميزان العقل), it examines the wisdom of the Divine ordering (الترتيب الإلهي) in the World (العالم). If one is among the People of Divine Audition, he examines the ordering of the Divine Names, and his Audition comes from there. If he is among the People of Spiritual Audition, he examines the ordering of their effects in the Higher and Lower Worlds, and he finds it in every heard thing, for all heard things are melodies (نغم) to him. Some of them experience a sensible movement, and some do not. But spiritual movement (الحركة الروحانية) is inevitable.\n\nAnd there is a group belonging to Allah who have moved beyond spiritual movements to Divine movements. This is the saying of al-Junayd, and the verse: <<وَتَرَى الْجِبَالَ تَحْسَبُهَا جَامِدَةً وَهِيَ تَمُرُّ مَرَّ السَّحَابِ>> (And you see the mountains, thinking them firm, while they pass as the passing of the clouds). But in the state where you think them firm, the movement is attributed to this person just as it is attributed to the Most Holy Presence (الجناب الأقدس) in His joy at the repentance of His servant and His welcoming smile (تبشبشه) to the one who comes to His House. These are Divine states (أحوال إلهية) that must be believed in, and their modality (كيفية) cannot be rationally grasped except by one whom Allah has singled out, and whose movement in his Audition was Divine. These are among the Knowledges that are attained but cannot be expressed. The descent to the lowest heaven every night is not similar to this joy or welcoming smile, because this joy arises from a cosmic cause whose existence has manifested, and The Real hears it. The descent to the lowest heaven is due to an anticipated matter, not an actualized one. The former belongs to the chapter of Audition, while the latter does not. Know this.\n\nWe have connected Audition to what is due to it and have realized its truth. We have not omitted any section or division of it without mentioning it in the most concise expression, so that it may be understood. Its anecdotes are numerous, but there is no need to cite them, for this book of ours is based on the realization of the principles of matters (أصول الأمور), not on anecdotes, as books are already filled with them. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "ایک سو بیاسیواں باب: مقامِ سماع (Maqām as-Samāʿ) کی معرفت (Ma‘rifah) میں\n\nیہ نصیحت ایک شفیق کی طرف سے لے لو:\nسماع (Samāʿ) مطلق (Mutlaq) سماع کے سوا کچھ نہیں۔\n\nاور اس میں تقیید (پابندی) سے بچو، کیونکہ یہ وہ قول ہے جو ہر محقق (Muḥaqqiq) کے نزدیک باطل ہے۔\n\nکتاب (قرآن) سے سماع (Samāʿ) وہ ہے جسے ہر معلم اور ہر راہ چلنے والا جانتا ہے۔\n\nقرآن کا ترنم ہمارا سماع (Samāʿ) ہے، اور ذات حق (Al-Ḥaqq) ہر نطق (Nutq) کے وقت بولتی ہے۔\n\nاور اللہ سنتا ہے جو اس کے بندے اس کے قول میں سے کہتے ہیں، پس اس کا سماع (Samāʿ) تحقق (Taḥaqquq) کے ساتھ ہے۔\n\nوجود (Al-Wujūd) کی اصل ہمارا قول \"کُنْ\" (ہو جا) سے سماع (Samāʿ) ہے، پس اسی سے ہم وجود میں آتے ہیں اور ہم عین منطق (Manṭiq) ہیں۔\n\nآیت میں اس کی تقدیم (پہلے ذکر) پر غور کرو، تم اس شریف اور گہرے علم کو پا لو گے۔\n\nپس سماعت (Samāʿ) اشرف ترین چیز ہے جسے عارف (Ārif) نے تعلق، تحقق (Taḥaqquq) اور تخلق (Takhaluq) کے ذریعے حاصل کیا۔\n\nاللہ تعالیٰ نے فرمایا: سَمِيعٌ عَلِيمٌ (سننے والا، جاننے والا) اور فرمایا: سَمِيعٌ بَصِيرٌ (سننے والا، دیکھنے والا)۔ پس اس نے اسے علم اور بصارت پر مقدم کیا۔ پہلی چیز جو ہم نے ذات حق (Al-Ḥaqq) سے جانی اور جس سے ہم میں سے قول (Al-Qawl) کا تعلق ہوا، وہ اس کی طرف سے قول اور ہماری طرف سے سماع (Samāʿ) تھا، پس اسی سے وجود (Al-Wujūd) ظاہر ہوا۔ اسی طرح ہم اس طریق میں کہتے ہیں کہ ہر وہ سماع (Samāʿ) جس سے وجد (Al-Wajd) پیدا نہ ہو، اور اس وجد (Al-Wajd) سے وجود (Al-Wujūd) پیدا نہ ہو، وہ سماع نہیں ہے۔ یہ سماع (Samāʿ) کا وہ مرتبہ ہے جس کی طرف اہل اللہ رجوع کرتے ہیں اور سنتے ہیں۔ اللہ تعالیٰ کا کسی شے کو اس کے وجود میں آنے سے پہلے \"کُنْ\" (ہو جا) کہنا، وہی ہے جسے اہل سماع (Samāʿ) کہنے والے کے قول میں دیکھتے ہیں۔ اور جس سے \"کُنْ\" کہا گیا، اس سامع کا تکوین (وجود میں آنے) کے لیے تیار ہونا، سماع (Samāʿ) میں وجد (Al-Wajd) کے مقام پر ہے۔ پھر اس کا اپنی عین میں وجود (Al-Wujūd) اس کے قول \"کُنْ\" سے ہوتا ہے، جیسا کہ اللہ تعالیٰ نے فرمایا: كُنْ فَيَكُونُ (ہو جا، پس وہ ہو جاتا ہے)۔ یہ اس وجود (Al-Wujūd) کے مقام پر ہے جسے اہل سماع (Samāʿ) اپنے دلوں میں اللہ کے اس علم سے پاتے ہیں جو اللہ نے انہیں وجد (Al-Wajd) کی حالت میں سماع (Samāʿ) کے ذریعے عطا کیا۔ پس جس نے سماعِ وجود (Samāʿ-i-Wujūd) نہ سنا، اس نے کچھ نہیں سنا۔ اسی لیے صوفیاء نے وجود (Al-Wujūd) کو وجد (Al-Wajd) کے بعد رکھا ہے۔\n\nاور چونکہ وجود (Al-Wujūd) — یعنی عالم کا وجود — اللہ کی طرف سے قول (Al-Qawl) اور عالم کی طرف سے سماع (Samāʿ) کے بغیر درست نہیں ہو سکتا تھا، اسی طرح سعادت کے راستوں کا وجود اور ان کے اور شقاوت کے راستوں کے درمیان فرق کا علم بھی قولِ الٰہی (Al-Qawl al-Ilāhī) اور سماعِ کونی (Samāʿ al-Kawnī) کے بغیر ظاہر نہیں ہو سکتا تھا۔ پس تمام رسول قول (Al-Qawl) لے کر آئے، خواہ وہ قرآن ہو، تورات ہو، انجیل ہو، زبور ہو یا صحیفے۔ پس وہاں قول (Al-Qawl) اور سماع (Samāʿ) کے سوا کچھ نہیں ہے، ان دونوں کے علاوہ کوئی چیز نہیں تھی۔ اگر قول (Al-Qawl) نہ ہوتا تو مرید (ذات حق) کا ارادہ جو وہ ہم سے چاہتا ہے، معلوم نہ ہوتا۔ اور اگر سماعت (Samāʿ) نہ ہوتی تو ہم اس چیز کے حصول تک نہ پہنچ پاتے جو ہمیں قبول کی گئی۔ پس قول (Al-Qawl) کے ذریعے ہم تصرف کرتے ہیں، اور قول (Al-Qawl) سے ہم سماع (Samāʿ) کے ساتھ تصرف کرتے ہیں۔ یہ دونوں باہم مربوط ہیں، ان میں سے کسی ایک کا دوسرے کے بغیر آزاد ہونا درست نہیں۔ یہ دونوں نسبتیں ہیں۔ قول (Al-Qawl) اور سماع (Samāʿ) کے ذریعے ہی ہم جانتے ہیں کہ ذات حق (Al-Ḥaqq) کے نفس میں کیا ہے، کیونکہ ہمیں اس کے بتائے بغیر کوئی علم نہیں ہو سکتا، اور اس کا بتانا اس کے قول (Al-Qawl) سے ہوتا ہے۔ قول (Al-Qawl) کے لیے آلہ (ذریعہ) شرط نہیں ہے اور نہ ہی سماع (Samāʿ) کے لیے، بلکہ یہ آلہ کے ساتھ بھی ہو سکتا ہے اور آلہ کے بغیر بھی۔ قول کے آلہ سے میری مراد زبان ہے اور سماع کے آلہ سے مراد کان ہے۔ جب تم نے وجود (Al-Wujūd) میں سماع (Samāʿ) کا مرتبہ اور دیگر نسبتوں سے اس کا امتیاز جان لیا، تو یہ جان لو کہ اہل اللہ کے نزدیک سماع (Samāʿ) مطلق (Mutlaq) اور مقید (Muqayyad) ہوتا ہے۔\n\nمطلق (Mutlaq) سماع وہ ہے جس پر اہل اللہ قائم ہیں، لیکن اس میں انہیں موازین (ترازوؤں) کے عظیم علم کی ضرورت ہوتی ہے تاکہ وہ قولِ امتثال (اطاعت کا قول) اور قولِ ابتلاء (آزمائش کا قول) کے درمیان فرق کر سکیں۔ یہ ہر کوئی نہیں جان سکتا، اور جو شخص اسے بغیر میزان کے چھوڑ دیتا ہے وہ خود بھی گمراہ ہوتا ہے اور دوسروں کو بھی گمراہ کرتا ہے۔ مقید (Muqayyad) سماع وہ ہے جو مستحسن نغمات کے ساتھ مقید ہو، جن سے طبع (فطرت) اپنی قبولیت کے مطابق حرکت میں آتی ہے۔ عام طور پر لوگ سماع (Samāʿ) سے اسی مقید سماع کو مراد لیتے ہیں نہ کہ مطلق سماع (Samāʿ al-Mutlaq) کو۔ اس حد تک سماع (Samāʿ) تین اقسام میں تقسیم ہوتا ہے: سماعِ الٰہی (Samāʿ Ilāhī)، سماعِ روحانی (Samāʿ Rūḥānī)، اور سماعِ طبعی (Samāʿ Ṭabī‘ī)۔\n\nسماعِ الٰہی (Samāʿ Ilāhī) اسرار (Asrār) کے ذریعے ہوتا ہے، اور یہ ہر شے سے، ہر شے میں، اور ہر شے کے ذریعے سماع (Samāʿ) ہے۔ ان کے نزدیک پورا وجود (Al-Wujūd) اللہ کے کلمات ہیں، اور اس کے کلمات ختم نہیں ہوتے۔ ان کلمات کے مقابلے میں ان کے لیے ایسی سماعتیں ہیں جو ختم نہیں ہوتیں، اور یہ سماعتیں ان کے باطن میں کلمات کے نئے ہونے کے ساتھ پیدا ہوتی ہیں۔ یہ اللہ کا قول ہے: مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ إِلَّا اسْتَمَعُوهُ (ان کے پاس ان کے رب کی طرف سے کوئی نئی نصیحت نہیں آتی مگر یہ کہ وہ اسے سنتے ہیں)۔ پس ان میں سے کچھ وہ ہیں جو سننے کے بعد اعراض کرتے ہیں، اور کچھ وہ ہیں جو جو کچھ سنا اس پر ٹھہر گئے۔ یہ ایک ایسا مقام ہے جسے ہر کوئی نہیں جانتا۔ اور وجود (Al-Wujūd) میں اس (ذات حق) کے سوا کچھ نہیں ہے، لیکن وہ مجہول رہتا ہے اور جانا نہیں جاتا۔ یہ اللہ تعالیٰ کے کثیر اسماء سے متعلق ہے۔ پس ہر اسم کی ایک زبان ہے، ہر زبان کا ایک قول ہے، اور ہر قول کے لیے ہم میں سے ایک سماعت ہے۔ اور کہنے والا اور سننے والا ایک ہی عین (Ayn) ہیں۔ اگر کوئی ندا ہو تو ہم جواب دیتے ہیں اور اطاعت کرتے ہیں۔ اور یہ اس کے قول میں سے تھا جب اس نے ہم سے کہا: ادْعُونِي أَسْتَجِبْ لَكُمْ (مجھے پکارو، میں تمہاری دعا قبول کروں گا)۔ پس جس طرح اس نے کہا اور ہم نے سنا، اسی طرح جب اس نے ہم میں قول کی قوت پیدا کی تو ہمیں حکم دیا کہ ہم کہیں تاکہ وہ تعالیٰ سنے۔ پس ہم میں سے کچھ وہ ہیں جو اس (اللہ) کے ذریعے کہتے ہیں، جیسا کہ اس نے فرمایا: \"اللہ نے اپنے بندے کی زبان پر کہا: سَمِعَ اللهُ لِمَنْ حَمِدَهُ (اللہ نے اس کی سن لی جس نے اس کی حمد کی)\"۔ اور ہم میں سے کچھ وہ ہیں جو اپنے گمان میں خود سے کہتے ہیں، حالانکہ حقیقت میں ایسا نہیں ہے، کیونکہ اللہ ہر کہنے والے کی زبان کے پاس ہے۔ پس جس طرح وجود (Al-Wujūd) میں اللہ کے سوا کوئی نہیں، اسی طرح وہاں اللہ کے سوا کوئی کہنے والا ہے نہ سننے والا۔ اور جس طرح ہم نے اپنے قول کو ان لوگوں کے درمیان تقسیم کیا جو اللہ کے ذریعے کہتے ہیں اور جو اپنے نفس سے کہتے ہیں، اسی طرح ہمارے سماع (Samāʿ) میں بھی ہم میں سے کچھ وہ ہیں جو اپنے رب کے ذریعے سنتے ہیں، اور یہ اس کا قول ہے: \"میں اس کی سماعت بن جاتا ہوں جس سے وہ سنتا ہے\"۔ اور ہم میں سے کچھ وہ ہیں جو اپنے گمان میں خود سے سنتے ہیں، حالانکہ معاملہ اس کے برعکس ہے۔ پس یہ سماعِ الٰہی (Samāʿ Ilāhī) ہے، اور یہ تمام مسموعات (سنی جانے والی چیزوں) میں جاری و ساری ہے۔\n\nاور جہاں تک سماعِ روحانی (Samāʿ Rūḥānī) کا تعلق ہے، تو اس کا تعلق وجود (Al-Wujūd) کی لوحِ محفوظ میں الٰہی قلموں کی چرچراہٹ سے ہے جو تغیر و تبدل سے محفوظ ہے۔ پس پورا وجود (Al-Wujūd) ایک پھیلا ہوا چمڑا ہے، اور عالم اس میں لکھی ہوئی کتاب ہے۔ پس قلم بولتے ہیں اور عقلوں کے کان سنتے ہیں، اور کلمات نقش ہوتے ہیں تو شہود (Shuhūd) کرتے ہیں۔ اور ان کے شہود (Shuhūd) کی عین (Ayn) ان میں بغیر کسی زیادتی کے فہم کی عین (Ayn) ہے۔ یہ سماع (Samāʿ) صرف ان عقلوں کو حاصل ہوتا ہے جو مستوی (برابر) کے لیے ظاہر ہوئیں۔ اور چونکہ سماع (Samāʿ) کی اصل چار پہلوؤں پر ہے، اور اس کی اصل ذات، نسبت، توجہ اور قول (Al-Qawl) سے ہے، پس وجود (Al-Wujūd) سماعِ الٰہی (Samāʿ Ilāhī) کے ذریعے ظاہر ہوا۔ اسی طرح سماعِ روحانی (Samāʿ Rūḥānī) ذات، ہاتھ، قلم اور قلم کی چرچراہٹ سے ہوتا ہے۔ پس نفسِ ناطقہ (Nafs-i-Nāṭiqah) کے لیے وجود (Al-Wujūd) دلوں کی الواح میں ان قلموں کی چرچراہٹ کو تقلیب (پھیرنے) اور تصریف (گردش) کے ذریعے سننے سے ہوتا ہے۔\n\nاسی طرح سماعِ طبعی (Samāʿ Ṭabī‘ī) کی بنیاد چار محققہ امور پر ہے۔ کیونکہ طبیعت (Ṭabī‘ah) دو فاعل اور دو منفعل سے معقول طور پر مربع (چار پہلوؤں والی) ہے، پس اس نے چار ارکان کو بھی ظاہر کیا۔ چنانچہ طبعی نشأت (Natural Creation) چار اخلاط (مزاجوں) اور چار قوتوں پر ظاہر ہوئی جن پر یہ نشأت قائم ہے۔ اور ان میں سے ہر خلط اپنی ذات سے کسی ایسے کو طلب کرتا ہے جو اسے اس کے بقا اور اس کے حکم کے بقا کے لیے حرکت دے، کیونکہ سکون عدم ہے۔ پس جب علماء نے قلموں کی چرچراہٹ سنی تو انہوں نے اپنے نفوس میں وہ چیز پائی جس سے اس طبعی نشأت کو حرکت دی جانی چاہیے، چنانچہ انہوں نے اس کے لیے چار نغمات مقرر کیں، ان اخلاط میں سے ہر خلط کے لیے ایک مخصوص آلہ میں ایک نغمہ۔ موسیقی (علمِ الحان و اوزان) میں انہیں بَم، زیر، مثنیٰ اور مثلث کہا جاتا ہے۔ ان میں سے ہر ایک ان اخلاط میں سے کسی ایک خلط کو حرکت دیتا ہے، خواہ وہ خوشی کی حرکت ہو یا رونے کی حرکت، اور دیگر اقسام کی حرکات۔ یہ اس لیے ہے کہ یہ ایک طبعی نشأت ہے نہ کہ روحانی۔ کیونکہ طبعی نشأت اور سماعِ طبعی (Samāʿ Ṭabī‘ī) میں حرکت کے ساتھ کوئی علم نہیں ہوتا، بلکہ اس کا حامل ان نغمات کو ان آلات سے یا قوالوں کی آوازوں سے سن کر اپنے نفس میں صرف طرب (سرور) یا غم پاتا ہے، اور اس کے ساتھ کوئی علم نہیں پاتا۔ کیونکہ صحیح حال اور صحیح وجد (Al-Wajd) کے ساتھ سماعِ طبعی (Samāʿ Ṭabī‘ī) کا یہ حصہ نہیں ہے جسے طبع طلب کرتی ہے، اور یہی آج کل لوگوں کا سماع ہے۔\n\nاور سماعِ روحانی (Samāʿ Rūḥānī) کے ساتھ علم اور معرفت (Ma‘rifah) ہوتی ہے جو مکمل طور پر غیر مادی چیزوں میں ہوتی ہے۔ جبکہ سماعِ الٰہی (Samāʿ Ilāhī) کے ساتھ علم اور معرفت (Ma‘rifah) مادی اور غیر مادی دونوں چیزوں میں ہوتی ہے، جو عام تعلق رکھتا ہے اور اسے سماعِ طبعی (Samāʿ Ṭabī‘ī) اور روحانی (Rūḥānī) میں پاتا ہے، لیکن خاص طور پر طبع اور عقل سے متعلق الٰہی سماعت کے ذریعے۔ ان میں سے کچھ وہ ہیں جو اسے جانتے ہیں اور کچھ وہ ہیں جو اسے نہیں جانتے، باوجود اس کے کہ وہ اسے پاتے ہیں اور جو کچھ پاتے ہیں اس کا انکار نہیں کر سکتے۔ پس ذات حق (Al-Ḥaqq) کا سماع (Samāʿ) مطلق (Mutlaq) ہے، جس طرح اس کا وجود (Al-Wujūd) مطلق ہے، اور اس میں تمیز کرنا مشکل ہے۔ الٰہی کلام اور قول (Al-Qawl) میں نغمات کی ایک اصل ہے جس پر وہ بھروسہ کرتی ہیں، اور یہ اصولوں میں سب سے قوی ہے۔ اسی لیے ان میں طبائع پر قوت اور تاثیر ہوتی ہے۔ جب نغمہ وارد ہوتا ہے اور سماعت اس سے متعلق ہوتی ہے، اگر وہ اپنے محل کو پا لے، تو کوئی بھی شخص اپنے نفس میں اس طرب (سرور) یا اثر کو روک نہیں سکتا جو سامع اپنے اندر پاتا ہے۔ پس اس کا تسلط قوی ہے، اور یہ اس اصل کی قوت کی وجہ سے ہے جس پر وہ بھروسہ کرتی ہے۔ اگرچہ اسماءِ الٰہیہ (Al-Asmā’ al-Ilāhiyyah) ایک ہی عین (Ayn) کے لیے ہیں، لیکن اہل اللہ کے نزدیک ان کے درمیان تفاوت معلوم ہے۔ اور چونکہ ان میں تفاوت معقول ہے اور یہ ان کے آثار سے معلوم ہوا، اس لیے ہم نے جانا کہ وہ الٰہی حقائق جن پر یہ نغمات بھروسہ کرتی ہیں، وہ اس چیز سے زیادہ قوی ہیں جس پر کلام بھروسہ کرتا ہے۔ کیونکہ ہم کسی قاری کو پڑھتے ہوئے یا کسی منشد کو شعر پڑھتے ہوئے سنتے ہیں تو اپنے نفوس میں اس کے لیے کوئی حرکت نہیں پاتے، بلکہ بعض اوقات ہم اس سے اکتا جاتے ہیں کیونکہ وہ طبعی وزن پر نہیں آیا ہوتا۔ لیکن جب ہم وہی آیت یا شعر کسی صاحبِ نغمہ سے سنتے ہیں اور وہ میزان میں اس کا حق ادا کرتا ہے، تو ہمیں وجد (Al-Wajd) لاحق ہوتا ہے اور ہمیں حرکت ملتی ہے اور ہم وہ چیز پاتے ہیں جو پہلے نہیں پا رہے تھے۔ اسی لیے ہم نے ان چیزوں میں فرق کیا جن پر طبعی نغمات بھروسہ کرتی ہیں اور جن پر قول (Al-Qawl) بھروسہ کرتا ہے۔ یہ محسوسات کا میزان ہے۔\n\nاور جہاں تک عقل کے میزان کا تعلق ہے، تو وہ عالم میں الٰہی ترتیب کی حکمت کو دیکھتا ہے۔ اگر وہ اہل سماعِ الٰہی (Samāʿ Ilāhī) میں سے ہے تو وہ اسماءِ الٰہیہ (Al-Asmā’ al-Ilāhiyyah) کی ترتیب کو دیکھتا ہے، پس اس کا سماع (Samāʿ) وہاں سے ہوتا ہے۔ اور اگر وہ اہل سماعِ روحانی (Samāʿ Rūḥānī) میں سے ہے تو وہ عالمِ بالا اور عالمِ اسفل میں ان کے آثار کی ترتیب کو دیکھتا ہے، پس وہ ہر مسموع (سنی جانے والی چیز) میں پاتا ہے، کیونکہ اس کے نزدیک تمام مسموعات نغمے ہیں۔ پس ان میں سے کچھ وہ ہیں جن کے لیے محسوس حرکت ہوتی ہے اور کچھ وہ ہیں جن کے لیے نہیں ہوتی۔ لیکن روحانی حرکت ناگزیر ہے۔ اور اللہ کی ایک جماعت ایسی ہے جو روحانی حرکات سے نکل کر الٰہی حرکات کی طرف چلی گئی، اور یہ جنید کا قول ہے: وَتَرَى الْجِبَالَ تَحْسَبُهَا جَامِدَةً وَهِيَ تَمُرُّ مَرَّ السَّحَابِ (اور تم پہاڑوں کو دیکھتے ہو اور انہیں ساکن سمجھتے ہو، حالانکہ وہ بادلوں کی طرح گزر رہے ہیں)۔ لیکن اس حال میں جب تم انہیں ساکن سمجھتے ہو، تو اس شخص کی حرکت کی نسبت جنابِ اقدس کی طرف ہوتی ہے، جیسے اس کا اپنے بندے کی توبہ پر خوش ہونا اور اس شخص پر تبشبش (خوشی کا اظہار) کرنا جو اس کے گھر آیا۔ یہ الٰہی احوال ہیں جن پر ایمان لانا واجب ہے، اور ان کی کیفیت کو کوئی نہیں سمجھ سکتا سوائے اس کے جسے اللہ نے خاص کیا ہو اور جس کی سماع (Samāʿ) میں حرکت الٰہی ہو۔ یہ ان علوم میں سے ہے جو حاصل کیے جاتے ہیں مگر بیان نہیں کیے جاتے۔ اور ہر رات آسمانِ دنیا پر نزول کرنا اس خوشی اور تبشبش (Tabashbush) کے مشابہ نہیں ہے، کیونکہ یہ خوشی ایک کونی سبب سے ہے جس کا وجود (Al-Wujūd) ظاہر ہوا اور ذات حق (Al-Ḥaqq) نے اسے سنا۔ جبکہ آسمانِ دنیا پر نزول ایک متوقع امر کے بارے میں ہوتا ہے نہ کہ ایک واقع شدہ امر کے بارے میں۔ پس پہلا (فرح) سماع (Samāʿ) کے باب سے ملحق ہے اور دوسرا اس سے ملحق نہیں ہے۔ پس یہ جان لو۔ ہم نے سماع (Samāʿ) کو اس کے واجبات کے ساتھ مربوط کر دیا ہے اور اس کی تحقیق کر دی ہے، اور ہم نے اس کا کوئی فصل یا قسم نہیں چھوڑی مگر اسے مختصر ترین عبارت میں ذکر کر دیا تاکہ اس پر توقف کیا جائے۔ اور اس کے واقعات بہت ہیں جنہیں بیان کرنے کی ضرورت نہیں، کیونکہ ہماری یہ کتاب امور کی اصول کی تحقیق پر مبنی ہے نہ کہ حکایات پر، کیونکہ کتابیں ان سے بھری پڑی ہیں۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب صد و هشتاد و دوم در معرفت مقام سماع (Maqām al-Samāʿ)\n\nبگیر این را از من که نصیحتی از دلسوزی است:\nسماع چیزی جز سماع مطلق نیست.\n\nو از مقید کردن آن بپرهیز، زیرا این قولی است که هر مدعایی را نزد محقق رد می‌کند.\n\nهمانا سماع از کتاب (قرآن) همان است که هر آموزگار و هر کوبنده‌ای (سالک) آن را می‌داند.\n\nهمانا ترنم به قرآن سماع ماست، و حق (الحق) نزد هر ناطقی سخن می‌گوید.\n\nو خداوند آنچه را بندگانش از قول او می‌گویند می‌شنود، پس سماع او به تحقق است.\n\nاصل هستی (الوجود)، سماع ما از قول «کُن» (باش) است؛ پس به واسطه آن موجود می‌شویم و ما عین منطق هستیم.\n\nبه تقدیم آن در آیه بنگر، تا بر علم شریف و دشوار دست یابی.\n\nپس سمع شریف‌ترین چیزی است که عارف به واسطه تعلق، تحقق و تخلق بدان دست یافته است.\n\nحق تعالی می‌فرماید: سَمِيعٌ عَلِيمٌ (شنوا و دانا) و می‌فرماید: سَمِيعٌ بَصِيرٌ (شنوا و بینا). پس آن را بر علم و بصر مقدم داشت. نخستین چیزی که از حق (الحق) آموختیم و قول از او و سماع از ما به آن تعلق گرفت، وجود (الوجود) بود که از آن حاصل شد. و همچنین در این طریق می‌گوییم: هر سماعی که از آن وجد (الوجد) حاصل نشود و از آن وجد، وجودی (وجود) پدید نیاید، سماع نیست. پس این مرتبه سماع است که اهل الله (أهل الله) به آن باز می‌گردند و می‌شنوند. پس قول حق تعالی به شیء پیش از وجودش که «کُن» (باش) است، همان چیزی است که اهل سماع در قول گوینده می‌بینند. و آماده شدن شنونده‌ای که به او «کُن» گفته شده برای تکوین، به منزله وجد (الوجد) در سماع است. سپس وجود یافتن آن شیء در عین خود، از قول «کُن» (باش)، چنانکه حق تعالی فرمود: كُنْ فَيَكُونُ (باش، پس می‌شود)، به منزله وجودی است که اهل سماع در قلب‌هایشان از علم به خداوند می‌یابند، همان علمی که خداوند در حال وجد (الوجد)، سماع را به آنان عطا کرد. پس هر کس سماع وجود نشنود، نشنیده است. و به همین دلیل، این قوم (صوفیه) وجود را پس از وجد قرار دادند. و از آنجا که وجود (الوجود) – منظورم وجود عالم است – جز با قول از جانب خداوند و سماع از جانب عالم صحیح نیست، وجود راه‌های سعادت و علم به تفاوت میان آن‌ها و راه‌های شقاوت، جز با قول الهی و سماع کونی آشکار نشد. پس رسولان همگی با قول آمدند، از قرآن و تورات و انجیل و زبور و صحیفه‌ها. پس در آنجا جز قول و سماع نیست و غیر از این دو چیزی نبوده است. اگر قول نبود، مرادِ مُرید (خداوند) از آنچه از ما می‌خواهد دانسته نمی‌شد، و اگر سمع نبود، به تحصیل آنچه برای ما گفته شده بود نمی‌رسیدیم. پس به واسطه قول تصرف می‌کنیم و از قول، همراه با سماع تصرف می‌کنیم. این دو به هم مرتبط‌اند و استقلال یکی بدون دیگری صحیح نیست و هر دو نسبتی هستند. پس به واسطه قول و سماع، آنچه در ذات حق (الحق) است را می‌دانیم، زیرا ما علمی نداریم مگر به واسطه آگاه ساختن او، و آگاه ساختن او به واسطه قول اوست. و در قول، ابزار (آلت) شرط نیست و در سماع نیز شرط نیست، بلکه ممکن است با ابزار یا بدون ابزار باشد. منظورم از ابزار قول، زبان و ابزار سماع، گوش است.\n\nپس هنگامی که مرتبه سماع را در وجود (الوجود) و تمایز آن را از سایر نسبت‌ها دانستی، بدان که سماع نزد اهل الله (أهل الله) مطلق و مقید است. سماع مطلق همان است که اهل الله بر آن هستند، اما در آن به علم عظیمی در مورد موازین نیاز دارند تا میان قول امتثال (اطاعت) و قول ابتلاء (آزمایش) تفاوت بگذارند. و این را هر کسی درک نمی‌کند، و هر کس آن را بدون میزان رها کند، گمراه می‌شود و گمراه می‌کند. و سماع مقید، سماعی است که مقید به نغمه‌های نیکو و دلنشین است که طبع بر حسب پذیرش خود به آن‌ها حرکت می‌کند، و غالباً منظورشان از سماع همین است، نه سماع مطلق.\n\nپس سماع بر این اساس به سه بخش تقسیم می‌شود: سماع الهی، سماع روحانی و سماع طبیعی. سماع الهی به واسطه سرائر (الأسرار) است، و آن سماع از هر چیزی، در هر چیزی و به واسطه هر چیزی است. و هستی (الوجود) نزد آنان تماماً کلمات خداوند است و کلمات او پایان نمی‌پذیرد. و در مقابل این کلمات، برای آنان شنیدن‌هایی است که پایان نمی‌پذیرد و این شنیدن‌ها در سرائر (سرائر) آنان با حدوث کلمات پدید می‌آید. و این همان قول اوست: ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ إِلَّا اسْتَمَعُوهُ (هیچ یادآوری تازه‌ای از پروردگارشان برایشان نمی‌آید مگر اینکه به آن گوش فرا می‌دهند). پس برخی از آنان پس از سماع روی برگرداندند و برخی نزد آنچه شنیدند توقف کردند. و این مقامی است که هر کسی آن را نمی‌داند. و در وجود (الوجود) جز او نیست، اما مورد جهل واقع می‌شود و دانسته نمی‌شود. و این به کثرت اسماء حق تعالی تعلق دارد. پس برای هر اسمی زبانی است و برای هر زبانی قولی است و برای هر قولی از ما سمعی است. و عین (حقیقت) گوینده و شنونده یکی است. اگر ندایی باشد، پاسخ می‌دهیم و اطاعت می‌کنیم، و این از قول اوست اگر به ما بگوید: ادْعُونِي أَسْتَجِبْ لَكُمْ (مرا بخوانید تا شما را اجابت کنم). همانطور که او گفت و ما شنیدیم، به ما امر کرد، هنگامی که در ما نیروی قول قرار داد که بگوییم تا او تعالی بشنود. پس برخی از ما به واسطه او می‌گویند، چنانکه گفته شده است: «همانا خداوند بر زبان بنده‌اش فرمود: سَمِعَ اللهُ لِمَن حَمِدَهُ (خداوند شنید کسی را که او را ستایش کرد)». و کلام صاحب این مقام تماماً نیابت است. و برخی از ما به گمان خود با نفس خویش می‌گویند، در حالی که در واقع چنین نیست. زیرا خداوند نزد زبان هر گوینده‌ای است. همانطور که در وجود (الوجود) جز خداوند نیست، در آنجا نیز گوینده و شنونده‌ای جز خداوند نیست. و همانطور که قول خود را میان کسی که به واسطه خدا می‌گوید و کسی که به گمان خود با نفس خویش می‌گوید تقسیم کردیم، سماع ما نیز چنین است: برخی از ما به واسطه پروردگارش می‌شنود، و این همان قول اوست: «کنتُ سَمعَهُ الذی یَسمَعُ بِه» (من گوش او هستم که با آن می‌شنود). و برخی از ما به گمان خود با نفس خویش می‌شنود، در حالی که امر بر خلاف آن است. پس این همان سماع الهی است و در تمامی مسموعات جاری است.\n\nاما سماع روحانی، متعلق آن صدای قلم‌های الهی در لوح وجود (الوجود) است که از تغییر و تبدیل محفوظ است. پس هستی (الوجود) تماماً طوماری گشوده است و عالم در آن کتابی نوشته شده است. پس قلم‌ها سخن می‌گویند و گوش‌های عقول می‌شنوند و کلمات نقش می‌بندند و شهود می‌کنند، و عین شهود آن‌ها عین فهم در آن کلمات است بدون هیچ افزایشی. و این سماع را جز عقولی که برای مستوی (مقام استواء) آشکار شده‌اند، درک نمی‌کنند. و از آنجا که اصل سماع بر چهارچوب (تربیع) بود و اصل آن از ذات، نسبت، توجه و قول بود، وجود (الوجود) به واسطه سماع الهی آشکار شد. همچنین سماع روحانی از ذات، دست، قلم و صدای قلم است. پس وجود (الوجود) برای نفس ناطقه در شنیدن صدای این قلم‌ها در الواح قلوب، به واسطه دگرگونی و تصریف (گرداندن) حاصل می‌شود. و همچنین سماع طبیعی، مبنای آن بر چهار امر محقق است، زیرا طبیعت چهارگوش است و از دو فاعل و دو منفعل معقول شده است، پس ارکان چهارگانه را نیز آشکار ساخت. پس نشأت طبیعی (النشأة الطبيعية) بر چهار خلط و چهار قوه‌ای که این نشأت بر آن‌ها استوار است، ظاهر شد. و هر خلطی از این‌ها به ذات خود کسی را می‌طلبد که آن را برای بقای خود و بقای حکمش به حرکت درآورد، زیرا سکون، عدم است. پس در نفوس دانشمندان، هنگامی که صدای قلم‌ها را شنیدند، آنچه را که باید این نشأت طبیعی (النشأة الطبيعية) با آن به حرکت درآید، یافتند. پس برای آن چهار نغمه قرار دادند؛ برای هر خلطی از این اخلاط، نغمه‌ای در آلت مخصوصی که در موسیقی – که علم الحان و اوزان است – به نام‌های بَم، زیر، مُثَنّی و مُثَلَّث خوانده می‌شود. هر یک از این‌ها خلطی از این اخلاط را به حرکت درمی‌آورد، میان حرکت شادی و حرکت گریه و انواع حرکات. و این برای آن است که نشأت طبیعی (النشأة الطبيعية) است، نه از آن جهت که روحانی است. زیرا حرکت در نشأت طبیعی و سماع طبیعی اصلاً همراه با علم نیست. بلکه صاحب آن فقط در نفس خود طرب یا اندوهی می‌یابد، هنگام شنیدن این نغمه‌ها از این آلات و از صدای قوالان، و اصلاً علمی همراه آن نمی‌یابد. زیرا این بهره سماع طبیعی است، همراه با حال صحیح و وجد (الوجد) صحیحی که طبع آن را می‌طلبد، و این سماع مردم امروز است. و سماع روحانی همراه با علم و معرفت (المعرفة) است، به طور کلی در غیر مواد. و سماع الهی همراه با علم و معرفت (المعرفة) است، هم در مواد و هم در غیر مواد، که تعلق عام دارد و آن را در سماع طبیعی و روحانی می‌یابد، اما به واسطه سمع الهی که به طور خاص طبع و عقل را در بر می‌گیرد. و برخی از آنان این را می‌دانند و برخی نمی‌دانند، با وجود اینکه آن را می‌یابند و نمی‌توانند آنچه را می‌یابند انکار کنند.\n\nپس سماع حق (الحق) مطلق است، همانطور که وجود (الوجود) او مطلق است، و تمییز آن دشوار است. و نغمه‌ها در کلام الهی و قول، اصلی دارند که به آن استناد می‌کنند و آن قوی‌ترین اصول است، و به همین دلیل است که در طبایع قدرت و تأثیر دارند. پس هیچ کس نمی‌تواند هنگام ورود نغمه و تعلق سمع به آن، اگر به جایگاه خود برسد، آن طرب یا اثری را که شنونده در نفس خود می‌یابد، از خود دور کند. پس سلطه آن قوی است و این به دلیل قدرت اصلی است که به آن استناد می‌کند. زیرا اسماء الهی، اگرچه برای یک عین (حقیقت) واحد هستند، اما تفاوت میان آن‌ها نزد اهل الله (أهل الله) معلوم است. و از آنجا که تفاوت در آن‌ها معقول بود و این تفاوت به واسطه آثارشان دانسته شد، دانستیم که حقایق الهی که این نغمه‌ها به آن‌ها استناد کرده‌اند، قوی‌تر از آن چیزی است که کلام به آن استناد کرده است. زیرا ما می‌شنویم که قاری‌ای قرائت می‌کند یا منشدی شعری می‌خواند، اما در نفوس خود حرکتی برای آن نمی‌یابیم، بلکه چه بسا در اوقاتی از آن بیزار شویم، زیرا بر وزن طبیعی نیامده است. اما هنگامی که آن آیه یا شعر را از صاحب نغمه‌ای بشنویم که در جایگاه حق خود در میزان باشد، وجد (الوجد) به ما دست می‌دهد و ما را به حرکت درمی‌آورد و چیزی را می‌یابیم که پیش از آن نمی‌یافتیم. به همین دلیل میان آنچه نغمه‌های طبیعی به آن استناد کرده‌اند و آنچه قول به آن استناد کرده است، تفاوت قائل شدیم. این میزان محسوس است. اما میزان عقل، حکمت ترتیب الهی در عالم را می‌نگرد. اگر از اهل سماع الهی باشد، ترتیب اسماء الهی را می‌نگرد و سماع او از آنجاست. و اگر از اهل سماع روحانی باشد، ترتیب آثار آن اسماء را در عالم بالا و پایین می‌نگرد و در هر مسموعی می‌یابد، زیرا مسموعات نزد او تماماً نغمه هستند. پس برخی از آنان حرکتی محسوس دارند و برخی ندارند، اما حرکت روحانی ناگزیر است. و برای خداوند طایفه‌ای است که از حرکات روحانی به حرکات الهی خارج شده‌اند، و این همان قول جنید است: وَتَرَى الْجِبالَ تَحْسَبُها جامِدَةً وَهِيَ تَمُرُّ مَرَّ السَّحابِ (و کوه‌ها را می‌بینی و آن‌ها را ساکن می‌پنداری، در حالی که مانند گذر ابرها در حرکت‌اند). اما در حالی که آن‌ها را ساکن می‌پنداری، حرکت را به این شخص نسبت می‌دهی، همانند نسبت آن به جناب اقدس در شادی او به توبه بنده‌اش و تبشبش (خوشرویی) او برای کسی که به خانه‌اش آمده است. پس این‌ها احوال الهی هستند که ایمان به آن‌ها واجب است و کیفیت آن‌ها را جز کسی که خداوند او را به آن اختصاص داده و حرکتش در سماعش الهی بوده است، درک نمی‌کند. و این از علومی است که به دست می‌آید اما قابل بیان نیست. و نزول به آسمان دنیا در هر شب، شبیه این شادی و خوشرویی نیست. زیرا این شادی ناشی از سببی کونی است که وجودش آشکار شده و حق (الحق) آن را شنیده است، در حالی که نزول به آسمان دنیا ناشی از امری است که مورد انتظار است، نه امری که واقع شده باشد. پس اولی به باب سماع ملحق می‌شود و دومی ملحق نمی‌شود. این را بدان. و ما سماع را به آنچه شایسته آن است مرتبط ساختیم و آن را محقق کردیم و هیچ فصل و بخشی از آن را فرو نگذاشتیم مگر اینکه با موجزترین عبارت ذکر کردیم تا بر آن توقف شود. و حکایات آن بسیار است و نیازی به آوردن آن‌ها نیست، زیرا مبنای این کتاب ما بر تحقیق اصول امور است، نه بر حکایات، چرا که کتاب‌ها از آن‌ها پر است. و خداوند حَقّ (الحق) را می‌گوید و او راه را هدایت می‌کند."
  },
  "page_count": 3
}