{
  "id": 463,
  "title": {
    "ar": "الباب الثالث والستون وأربعمائة في معرفة الاثني عشر قطبا الذين يدور عليهم عالم زمانهم",
    "en": "Chapter Four Hundred and Sixty-Three, Concerning the Gnosis of the Twelve Poles (الأقطاب) upon whom the World of their Era Revolves.",
    "ur": "باب چار سو تریسٹھ، ان بارہ اقطاب (قطب) کی معرفت کے بیان میں جن پر ان کے زمانے کا عالم گردش کرتا ہے۔",
    "fa": "باب چهارصد و شصت و سوم در معرفت (معرفت) دوازده قطب (قطب) که عالم زمانشان بر مدار آنها می‌گردد."
  },
  "content": {
    "ar": "## «الباب الثالث والستون وأربعمائة في معرفة الاثني عشر قطبا الذين يدور عليهم عالم زمانهم»\n\n\n> منتهى الأسماء في العدد *** لاثنتي عشر مع العقد\n\n\n> فبهم حفظ الوجود وما *** في وجود الحق من عدد\n\n\n> وهو المنعوت بالعدد *** وهو المنعوت بالأحد\n\n\n> ظهرت أحكام نشأتهم *** في التي قامت بلا عمد\n\n\n> تم في الأركان حكمهمو *** في أب منها وفي ولد\n\n\n### [أقطاب هذه الأمة اثنا عشر قطبا]\n\n\nقال الله تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم قُلْ هُوَ الله أَحَدٌ وعرفه فقال ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها وذَرُوا الَّذِينَ يُلْحِدُونَ في أَسْمائِهِ يقول يميلون عن أسمائه لا بل يقول يميلون في أسمائه إلى غير الوجه الذي قصد بها سَيُجْزَوْنَ ما كانُوا يَعْمَلُونَ من ذلك فكل يجزى بما مال إليه فيما أوحينا يقول اتَّبِعْ ما أُوحِيَ إِلَيْكَ من رَبِّكَ ولا تمل بميلهم فإني خلقتك متبعا لا متبعا اسم مفعول لا اسم فاعل ولذلك قال له عند ذكر الأنبياء فَبِهُداهُمُ اقْتَدِهْ لا بهم وهداهم ليس سوى شرع الله فقال شَرَعَ لَكُمْ من الدِّينِ ما وَصَّى به نُوحاً وذكر من ذكر فكان الشارع لنا الله الذي شرع لهم فلو أخذ عنهم لكان تابعا فافهم فأقطاب هذه الأمة اثنا عشر قطبا عليهم مدار هذه الأمة كما إن مدار العالم الجسمي والجسماني في الدنيا والآخرة على اثني عشر برجا قد وكلهم الله بظهور ما يكون في الدارين من الكون والفساد المعتاد وغير المعتاد وأما المفردون فكثيرون والختمان منهم أي من المفردين فما هما قطبان وليس في الأقطاب من هو على قلب محمد صَلَّى اللهُ عَليهِ وسَلَّم وأما المفردون فمنهم من هو على قلب محمد صَلَّى اللهُ عَليهِ وسَلَّم والختم منهم أعني خاتم الأولياء الخاص فأما الأقطاب الاثنا عشر فهم على قلوب الأنبياء عليه السلام فالواحد منهم على قلب وإن شئت قلت على قدم وهو أولى فإني هكذا رأيته في الكشف بإشبيلية وهو أعظم في الأدب مع الرسل والأدب مقامنا وهو الذي أرتضيه لنفسي ولعباد الله فنقول إن الأول أعني واحدا منهم على قدم نوح عليه السلام والثاني على قدم إبراهيم الخليل عليه السلام والثالث على قدم موسى عليه السلام والرابع على قدم عيسى عليه السلام والخامس على قدم داود عليه السلام والسادس على قدم سليمان عليه السلام والسابع على قدم أيوب عليه السلام والثامن على قدم الياس عليه السلام والتاسع على قدم لوط عليه السلام والعاشر على قدم هود عليه السلام والحادي عشر على قدم صالح عليه السلام والثاني عشر على قدم شعيب عليه السلام ورأيت جميع الرسل والأنبياء كلهم مشاهدة عين وكلمت منهم هودا أخا عاد دون الجماعة ورأيت المؤمنين كلهم مشاهدة عين أيضا من كان منهم ومن يكون إلى يوم القيامة أظهرهم الحق لي في صعيد واحد في زمانين مختلفين وصاحبت من الرسل وانتفعت به سوى محمد صَلَّى اللهُ عَليهِ وسَلَّم جماعة منهم إبراهيم الخليل قرأت عليه القرآن وعيسى تبت على يديه وموسى أعطاني علم الكشف والإيضاح وعلم تقليب الليل والنهار فلما حصل عندي زال الليل وبقي النهار في اليوم كله فلم تغرب لي شمس ولا طلعت فكان لي هذا الكشف أعلاما من الله أنه لا حظ لي في الشقاء في الآخرة وهود عليه السلام سألته عن مسألة فعرفني بها فوقعت في الوجود كما عرفني بها هذا إلى زماني هؤلاء وعاشرت من الرسل محمدا صَلَّى اللهُ عَليهِ وسَلَّم وإبراهيم وموسى وعيسى وهودا وداود وما بقي فرؤية لا صحبة\n\n\n### [أن لكل قطب من هؤلاء الأقطاب لبث في العالم‏]\n\n\nواعلم أن كل قطب من هؤلاء الأقطاب له لبث في العالم أعني دعوتهم فيمن بعث إليهم آجال مخصوصة مسماة تنتهي إليها ثم تنسخ بدعوة أخرى كما تنسخ الشرائع بالشرائع وأعني‏\nبدعوتهم ما لهم من الحكم والتأثير في العالم فلنذكر مدد أعمارهم في حياتهم الدنيا فمنهم من كان عمره في ولايته ثلاثة وثلاثين سنة وأربعة أشهر ومنهم من كانت مدته ثلاثين سنة وثلاثة أشهر وعشرين يوما ومنهم من دامت مدته ثمانيا وعشرين سنة وثلاثة أشهر وعشرة أيام ومنهم من دامت مدته خمسا وعشرين سنة ومنهم من دامت مدته اثنتين وعشرين سنة واحد عشر شهرا وعشرين يوما ومنهم من دامت مدته تسع عشرة سنة وخمسة أشهر وعشرة أيام ومنهم من دامت مدته ستة عشر سنة وثمانية أشهر ومنهم من دامت مدته ثلاث عشرة سنة وعشرة أشهر وعشرين يوما ومنهم من دامت مدته إحدى عشرة سنة وثلاثة أشهر وعشرة أيام ومنهم من دامت مدته سنتين وتسعة أشهر وعشرة أيام ومنهم من دامت مدته ثمان سنين وأربعة أشهر ومنهم من دامت مدته خمس سنين وستة أشهر وعشرين يوما وهجيرهم واحد وهو الله الله بسكون الهاء وتحقيق الهمزة ما لهم هجير سواه وما عدا هؤلاء الأقطاب من أقطاب القرى والجهات والأقاليم وشيوخ الجماعات فأنواع كثيرة وهي التي أذكر منها في هذا الفصل ما تيسر وما أذكر ذلك إلا لأجل نتيجة ذلك الذكر لمن دام عليه على الحال المعروفة في الذكر في الذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ ولو لم نقصد ذلك لم يكن في ذكري وتعييني له في هذا الكتاب منفعة فلنذكر أولا من أحوال هؤلاء الأقطاب ما تيسر مع أحدية هجيرهم وإنما توحد لتوحد مقام القطبية فذلك هو هجير القطبية لا هجير الشخص ولكل واحد منهم هجير في أوقات خلاف هذا وقال عليه السلام لا تقوم الساعة حتى لا يبقى في الأرض من يقول الله الله‏\n\n\nيريد لا يبقى قطب يكون عليه مدار العالم ولا مفرد يحفظ الله بهمته العالم وإن لم يكن قطبا فلا تقوم الساعة إلا على أشرار الناس‏\n\n\n### [القطب الأول على قدم نوح ع‏]\n\n\nفأما أحد الأقطاب فهو على قدم نوح عليه السلام فله من سور القرآن سورة يس فإنه لكل قطب سورة من القرآن من هؤلاء الاثني عشر وقد يكون لمن سواهم من الأقطاب الذين ذكرناهم السورة من القرآن والآية الواحدة من القرآن وقد يكون للواحد منهم ما يزيد على الصورة وقد يكون منهم من له القرآن كله كأبي يزيد البسطامي ما مات حتى استظهر القرآن فلنذكر ما يختص به هؤلاء الاثنا عشر من سور القرآن فهذا القطب الواحد له سورة يس وهو أكمل الأقطاب حكما جمع الله له بين الصورتين الظاهرة والباطنة فكان خليفة في الظاهر بالسيف وفي الباطن بالهمة ولا أسميه ولا أعينه فإني نهيت عن ذلك وعرفت لأي أمر منعت من تعيينه باسمه وليس في جماعة هؤلاء الأقطاب من أوتي جوامع ما تقتضيه القطبية غير هذا كما أوتي آدم عليه السلام جميع الأسماء كما أوتي محمد صَلَّى اللهُ عَليهِ وسَلَّم جوامع الكلم ولو كان ثم قطب على قدم محمد صَلَّى اللهُ عَليهِ وسَلَّم لكان هذا القطب إلا أنه ما ثم أحد على قدم محمد صَلَّى اللهُ عَليهِ وسَلَّم إلا بعض الأفراد الأكابر ولا يعرف لهم عدد وهم أخفياء في الخلق أبرياء علماء بالله لا يرزءون ولا يعرفون فيرزءون مقامهم الحفظ فيما يعلمون لا يدخل عليهم في علمهم شبهة تحيرهم فيما علموه بل هم على بينة من ربهم هذا حال الأفراد فلنرجع إلى ذكر هذا القطب‏\n\n\n### [كل قطب منازله على عدد آيات سورته‏]\n\n\nفنقول إن منازله عند الله على عدد آيات هذه السورة وكذلك كل قطب منازله على عدد آيات سورته وسورهم معلومة أذكرها جملة ثم أذكرها إن شاء الله تعالى فالواحد له كما قلنا سورة يس والثاني سورة الإخلاص والثالث سورة إذا جاء نصر الله والرابع سورة الكافرون والخامس سورة إذا زلزلت والسادس سورة البقرة والسابع سورة المجادلة والثامن سورة آل عمران والتاسع سورة الكهف وهو الذي يقتله الدجال ويدرك عيسى عليه السلام والعاشر سورة الأنعام والحادي عشر سورة طه وهذا القطب هو نائب الحق تعالى كما كان علي بن أبي طالب نائب محمد صَلَّى اللهُ عَليهِ وسَلَّم في تلاوة سورة براءة على أهل مكة\n\n\nوقد كان بعث بها أبا بكر ثم رجع عن ذلك فقال لا يبلغ عني القرآن إلا رجل من أهل بيتي فدعا بعلي فأمره فلحق أبا بكر فلما وصل إلى مكة حج أبو بكر بالناس وبلغ علي إلى الناس سورة براءة وتلاها عليهم نيابة عن رسول الله ص‏\n\n\nوهذا مما يدلك على صحة خلافة أبي بكر الصديق ومنزلة علي رضي الله عنهما والثاني عشر سورة تبارك الملك فهذه سور الأقطاب من القرآن إلا إن صاحب سورة المجادلة التي هي قَدْ سَمِعَ الله قَوْلَ الَّتِي تُجادِلُكَ في زَوْجِها وتَشْتَكِي إِلَى الله إنما هو سورته الواقعة وله تولع بهذه السورة وكذلك الذي له سورة الإخلاص‏\nلا غير ومنازلهم كما قد ذكرنا غير إن المنازل بحسب الآيات ومن ذكر وما ذكر فيها فإن التفاضل في الآيات مشهور على الوجه الذي جاء وفضلها يرجع إلى التالي من حيث ما هي عليه الآية في التلاوة متكلم بها لا من حيث إنها كلام الله فإن ذلك لا تفاضل فيه وإنما التفاضل يكون فيما تكلم به لا في كلامه فاعلم ذلك فأما حال هذا القطب فله التأثير في العالم ظاهرا وباطنا يشيد الله به هذا الدين أظهره بالسيف وعصمه من الجور فحكم بالعدل الذي هو حكم الحق في النوازل وربما يقع فيه من خالف حكمه من أهل المذاهب مثل الشافعية والمالكية والحنفية والحنابلة ومن انتمى إلى قول إمام لا يوافقها في الحكم هذا القطب وهو خليفة في الظاهر فإذا حكم بخلاف ما يقتضيه أدلة هؤلاء الأئمة قال أتباعهم بتخطئته في حكمه ذلك وأثموا عند الله بلا شك وهُمْ لا يَشْعُرُونَ فإنه ليس لهم أن يخطئوا مجتهدا لأن المصيب عندهم واحد لا بعينه ومن هذه حاله فلا يقدم على تخطئة عالم من علماء المسلمين كما تكلم من تكلم في إمارة أسامة وأبيه زيد بن حارثة حتى قال في ذلك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما قال فإذا طعن فيمن قدمه رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وأمره ورجحوا نظرهم على نظر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فما ظنك بأحوالهم مع القطب وأين الشهرة من الشهرة هيهات فزنا ويَخْسَرُ الْمُبْطِلُونَ فو الله لا يكون داعيا إلى الله إلا من دعا على بصيرة لا من دعا على ظن وحكم به لا جرم أن من هذه حاله حجر على أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم ما وسع الله به عليهم فضيق الله عليهم أمرهم في الآخرة وشدد الله عليهم يوم القيامة المطالبة والمحاسبة لكونهم شددوا على عباد الله أن لا ينتقلوا من مذهب إلى مذهب في نازلة طلبا لرفع الحرج واعتقدوا أن ذلك تلاعب بالدين وما عرفوا أنهم بهذا القول قد مرقوا من الدين بل شرع الله أوسع وحكمه أجمع وأنفع وقِفُوهُمْ إِنَّهُمْ مَسْؤُلُونَ ما لَكُمْ لا تَناصَرُونَ بَلْ هُمُ الْيَوْمَ مُسْتَسْلِمُونَ هذا حال هؤلاء يوم القيامة ولا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُونَ ولهذا القطب مقام الكمال فلا يقيده نعت هو حكيم الوقت لا يظهر إلا بحكم الوقت وبما يقتضيه حال الزمان الإرادة بحكمه ما هو بحكم الإرادة فله السيادة وفيه عشر خصال أولها الحلم مع القدرة لأن له الفعل بالهمة فلا يغضب لنفسه أبدا وإذا انتهكت محارم الله فلا يقوم شي‏ء لغضبه فهو يغضب لله والثانية الأناة في الأمور التي يحمد الله الأناة فيها مع المسارعة إلى الخيرات فهو يسارع إلى الأناة ويعرف مواطنها والثالثة الاقتصاد في الأشياء فلا يزيد على ما يطلبه الوقت شيئا فإن الميزان بيده يزن به الزمان والحال فيأخذ من حاله لزمانه ومن زمانه لحاله فيخفض ويرفع والرابعة التدبير وهو معرفة الحكمة فيعلم المواطن فيلقاها بالأمور التي تطلبها المواطن‏\n\n\nكما فعل أبو دجانة حين أعطاه النبي صَلَّى اللهُ عَليهِ وسَلَّم السيف بحقه في بعض غزواته فمشى به الخيلاء بين الصفين فقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم وهو ينظر إلى زهوه هذه مشية يبغضها الله ورسوله إلا في هذا الموطن‏\n\n\nولهذا كان مشي رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فيه سرعة كأنما ينحط في صبب فصاحب التدبير ينظر في الأمور قبل إن يبرزها في عالم الشهادة فله التصرف في عالم الغيب فلا يأخذ من المعاني إلا ما تقتضيه الحكمة ف هُوَ الْحَكِيمُ الْخَبِيرُ فما ينبغي أن يبديه مجملا أبداه مجملا وما ينبغي أن يبديه مفصلا أبداه مفصلا وما ينبغي أن يبديه محكما أبداه محكما وما ينبغي أن يبديه متشابها أبداه متشابها والخصلة الخامسة التفصيل وهو العلم بما يقع به الامتياز بين الأشياء مما يقع به الاشتراك فينفصل كل أمر عن مماثله ومقابله وخلافه ويأتي إلى الأسماء الإلهية القريبة التشابه كالعليم والخبير والمحصي والمحيط والحكيم وكلها من أسماء العلم وهي بمعنى العليم غير إن بين كل واحد وبين الآخر دقيقة وحقيقة يمتاز بها عن الباقي هكذا في كل اسم يكون بينه وبين غيره مشاركة والسادسة العدل وهو أمر يستعمل في الحكومات والقسمة والقضايا وإيصال الحقوق إلى أهلها وهو في الحقوق شبيه بما ذكر الله عن نفسه أنه أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ وقوله في موسى قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ وقوله في ناقة صالح لَها شِرْبٌ ولَكُمْ شِرْبُ يَوْمٍ مَعْلُومٍ ويتعلق به علم الجزاء في الدارين والعدل بين الجناية والحد والتعزير والسابعة الأدب وهو العلم بجوامع الخيرات كلها في كل عالم وهو العلم الذي يحضره في البساط ويمنحه المجالسة والشهود والمكالمة والمسامرة والحديث والخلوة والمعاملة بما في نفس الحق في المواطن من الجلوة فهذا وأمثاله هو الأدب والثامنة الرحمة ومتعلقها منه كل مستضعف وكل جبار فيستنزله برحمته ولطفه من جبروته وكبريائه وعظمته بأيسر مئونة\nفي لين وعطف وجنان والتاسعة الحياء فيستحي من الكاذب عن الكاذب ويظهر له بصورة من صدقه في قوله لا يظهر له بصورة من تعامى عنه حتى يعتقد فيه الكاذب أنه قد مشى عليه حديثه وأنه جاهل بمقامه وبما جاء به فيذل في شغله ثم لا يكون في حقه عند ربه إلا واسطة خير يدعو له بالتجاوز فيما بينه وبين الله عند الوقوف والسؤال يوم القيامة وقد ورد في الخبر ان الله يوم القيامة يدعو بشيخ فيقول له ما فعلت فيقول من المقربات ما شاء الله والله يعلم أنه كاذب في قوله فيأمر به إلى الجنة فتقول الملائكة يا رب إنه كذب فيما ادعاه فيقول الحق قد علمت ذلك ولكني استحييت منه أن أكذب شيبته‏\n\n\nوما أوصل إلينا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم هذا الخبر عن الله إلا لنكون بهذه الصفة فنحن أحق بها لحاجتنا إن يعاملنا الحق بها والعاشرة الإصلاح وأعظمه إصلاح ذات البين وهو قوله تعالى وأَصْلِحُوا ذاتَ بَيْنِكُمْ وقد ورد في الخبر إن الله يصلح بين عباده يوم القيامة فيوقف الظالم والمظلوم بين يديه للحكومة والإنصاف ثم يقول لهما ارفعا رءوسكما فينظران إلى خير كثير فيقولان لمن هذا الخير فيقول الله لهما لمن أعطاني الثمن فيقول المظلوم يا رب ومن يقدر على ثمن هذا فيقول الله له أنت بعفوك عن أخيك هذا فيقول المظلوم يا رب قد عفوت عنه فيقول الله له خذ بيد أخيك فادخلا الجنة ثم تلا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم فَاتَّقُوا الله وأَصْلِحُوا ذاتَ بَيْنِكُمْ فإن الله يصلح بين عباده يوم القيامة\n\n\nوأما القطب الثاني من الاثني عشرة فهو على قدم الخليل إبراهيم ع‏\n\n\nوهو الذي له سورة الإخلاص الذي حبه إياها أدخله الجنة ولقارئها ثلث القرآن وله من المنازل بعدد آيها وهو صاحب الحجة والدليل النظري يكون له خوض في المعقولات فيصيب ولا يخطئ وذلك أن الناس قد اختلفوا في العلم الموهوب الذي من شأنه أن يدركه العاقل بفكره ويوصله إليه دليل النظر فقال بعضهم مثل هذا العلم إذا وهبه الله من وهبه وهبه بدليله فيعلم الدليل والمدلول لا بد من ذلك ورأيت أبا عبد الله الكتاني بمدينة فاس إماما من أئمة المسلمين في أصول الدين والفقه يقول بهذا القول فقلت له هذا ذوقك هكذا أعطاكه الحق فذوقك صحيح وحكمك غير صحيح بل قد يعطيه العلم الذي لا يحصل إلا بالدليل النظري ولا يعطيه دليله وقد يعطيه إياه ويعطيه دليله كإبراهيم الخليل قال تعالى وتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ وهو أكمل من الذي يعطي العلم الذي يوصل إليه بالدليل ولا يعطي الدليل ولا يشترط أحد تخصيص دليل من دليل إنما يعطي دليلا في الجملة فإن الأدلة على الشي‏ء الواحد قد تكثر ومنها ما يكون في غاية الوضوح ومنها ما يغمض كمسألة إبراهيم الخليل في إحياء الموتى وإماتة الأحياء وعدوله إلى إتيان الشمس من المشرق أن يأتي بها الخصم من المغرب وكلاهما دليل على المقصود وهذا القطب من الدعاة إلى الله بالأمر الإلهي ومسكنه في الهواء في فضاء الجو في بيت جالس على كرسي له نظر إلى الخلق لا يزال تاليا عنده جماعة من أهل الله وخاصته كلامه في الأحدية الإلهية وفي أحدية الواحد وفي أحدية الوحدانية بالأدلة النظرية وما حصلها عن نظر ولكن هكذا وهبها الحق تعالى له وحاله الحضور دائما إلا أنه لم يحر مثل ما حار غيره بل أبان الله له ما وقف عنده ولم يشغل خاطره بما يوجب عنده الحيرة قد تفرغ مع الله لقضاء حوائج الناس يعرف الأسماء الإلهية معرفة تامة يقول بنفي المثلية في جانب الحق أخبرني الحق بالطريقة التي جرت العادة أن يخبر بها عباده في أسرارهم إن هذا العبد أعطاه الرحمة لعباده والصلة لرحمه فسأله في أمر فلم يجبه الله إليه وهو أنه سأله أن يرث مقامه عقبه فقال له ليس ذلك إليك لا يكون مقام الخلافة بالورث ذلك في العلوم والأموال وأما الخلافة فكل خليفة في قوم بحسب زمانهم فإن الناس في زمانهم أشبه منهم بآبائهم فإن الحق لا يحكم عليه خلق إلا في العلم والخلق لا يعرف أن له هذه المرتبة إلا من أعلمه الله بذلك ولقد رأيت من فتح الله عليه بصحبتي واستفاد أحوالا وعلوما وخرق عوائد أعطاه الله ذلك من حسن معاملته مع الله وأخبرني أنه ما استفاد شيئا مما هو عليه إلا مني وأنا لا علم لي بذلك إنما أدعو إلى الله والله يعلم من يجيب يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ قالُوا لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ وصدقوا وكذا هو الأمر فلا علم لأحد إلا من يعلمه الله وما عدا هذه الطريقة الإلهية في التعليم فإنما هو غلبة ظن أو مصادفة علم أو جزم على وهم وأما علم فلا فإن جميع الطرق الموصلة إلى العلم فيها شبه لا تثق النفس الطاهرة التي أوقفها الله على هذه الشبه أن تقطع بحصول علم‏\nمنها إلا بالطريقة الإلهية وهي قوله تعالى إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً وقوله خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ فهو يبين عما في نفسه ولهذا القطب أسرار عجيبة\n\n\n### [القطب الثالث وهو على قدم موسى ع‏]\n\n\nوأما القطب الثالث وهو على قدم موسى عليه السلام فسورته إِذا جاءَ نَصْرُ الله والْفَتْحُ ومنازله بعدد آيها ولها ربع القرآن وهذا القطب كان من الأوتاد ثم نقل إلى القطبية كما كان القطب الثاني من الأئمة ثم نقل إلى القطبية وهو صاحب جهد ومكابدة لا ينفك عن الاشتغال بالخلق عند الله أعطاه الله في منزل النداء اثني عشر ألف علم ذوقا في ليلة واحدة ومنزل النداء من أعظم المنازل وقد عيناه في منزل المنازل من هذا الكتاب ولنا فيه جزء مفرد أعني في طبقات المنازل وكمياتها فمن علوم هذا القطب علم الافتقار إلى الله بالله وهو علم شريف ما رأيت له ذائقا لما ذقته ومعنى هذا وسره إن الله أطلعه على إن\n\n\nحاجة الأسماء إلى التأثير في أعيان الممكنات أعظم من حاجة الممكنات إلى ظهور الأثر فيها وذلك أن الأسماء لها في ظهور آثارها السلطان والعزة والممكنات قد يحصل فيها أثر تتضرر به وقد تنتفع به وهي على خطر فبقاؤها على حالة العدم أحب إليها لو خيرت فإنها في مشاهدة ثبوتية حالية ملتذة بالتذاذ ثبوتي منعزلة كل حالة عن الحالة الأخرى لا تجمع الأحوال عين واحدة في حال الثبوت فإنها تظهر في شيئية الوجود في عين واحدة فزيد مثلا الصحيح في وقت هو بعينه العليل في وقت آخر والمعافي في وقت هو المبتلى في وقته ذلك بعينه وفي الثبوت ليس كذلك فإن الألم في الثبوت ما هو في عين المتألم وإنما هو في عينه فهو ملتذ بثبوته كما هو ملتذ بوجوده في المتألم والمحل متالم به وسبب ذلك أن الثبوت بسيط مفرد غير قائم شي‏ء بشي‏ء وفي الوجود ليس إلا التركيب فحامل ومحمول فالمحمول أبدا منزلته في الوجود مثل منزلته في الثبوت في نعيم دائم والحامل ليس كذلك فإنه إن كان المحمول يوجب لذة التذ الحامل وإن أوجب ألما تألم الحامل ولم يكن له ذلك في حال الثبوت بل العين الحاملة في ثبوتها تظهر فيما تكون عليه في وجودها إلى ما لا يتناهى فكل حال تكون عليها هو إلى جانبها ناظر إليها لا محمول فيها فالعين ملتذة بذاتها والحال ملتذ بذاته فحال الأحوال لا يتغير ذوقه بالوجود وحال الحامل يتغير بالوجود وهو علم عزيز وما تعلم الأعيان ذلك في الثبوت إلا بنظر الحال إليها ولكن لا تعلم أنه إذا حملته تتألم به لأنها في حضرة لا تعرف فيها طعم الآلام بل تتخذه صاحبا فلو علمت العين أنها تتألم بذلك الحال إذا اتصف به لتألمت في حال ثبوتها بنظره إياها لعلمها أنها تتلبس به وتحمله في حال وجودها فتألفها به في الثبوت تنعم لها وهذا الفن من أكبر أسرار علم الله في الأشياء شاهدته ذوقا إلهيا لأن من عباد الله من يطلعه الله كشفا على الأعيان الثبوتية فيراها على صورة ما ذكرناها من المجاورة والنظر ما يرى فيها حالا ولا محلا\n\n\n> بل كل ذات على انفراد *** من غير شوب ولا اتحاد\n\n\n> ولا حلول ولا انتقال *** ولا اتفاق ولا عناد\n\n\nفإذا فهمت الفرق بين الوجود والثبوت وما للاعيان في الوجود وما لها في الثبوت من الأحكام علمت إن بعض الأعيان لا تريد ظهور الأثر فيها بالحال ما لها في ذلك ذوق فهي بالحال لو عرض عليها ذوق الألم في حال الثبوت لضجت فإن أمرها في حال الوجود إذا حملت الألم قد تحمل الصبر وقد لا تحمله وفرضناها في حال الثبوت حاملة فاقدة للصبر فما لها بلسان الحال ذلك الافتقار إلى طلب الوجود وإن طلبته بالقول الثبوتي من الله فإذا وجدت تقول كما قد نقل عن بعضهم ليثني لم أخلق ليت عمر لم تلده أمه ليتها كانت عاقرا وأمثال هذا فتكون الأعيان أقل افتقارا من الأسماء والأسماء أشد افتقارا لما لها في ذلك من النعيم ولا سيما وهي تشاهد من الحق الابتهاج الذاتي بالكمال من حيث استصحاب الممكنات في ثبوتها لذاته وإنه منزه عن أثرها والتأثر بسببها فهو من حيث ذاته في كمال عن التأثر في حال ثبوت الأعيان وحال وجودها لأنه ما زاد في نفسه علما بما لم تكن عليه فيها فإنها أعطته العلم بشأنها أزلا وبتلك الصورة توجد فالمجاورة في الثبوت حلول في الوجود ففي الثبوت إلى جانبها وفي الوجود حال فيها فهذا علم واحد من تلك العلوم فاعلم ذلك‏\n\n\n### [القطب الرابع الذي على قدم عيسى ع‏]\n\n\nوأما القطب الرابع الذي على قدم عيسى عليه السلام فسورته من القرآن قُلْ يا أَيُّهَا الْكافِرُونَ ولها ربع القرآن ومنازله بعدد آيها وهذا القطب من الضنائن المصانين له التجلي‏\nالدائم كلامه في الجمع والوجود وعلم المزيد إذا رأى شبهة في أحد تحول بينه وبين العلم أزالها حتى يتبين لصاحبها صورة الحق في ذلك الأمر له ستمائة مفتاح مقام في كل مقام من العلوم ما شاء الله له علم الامتزاج والتركيب الاعتدالي لا يعرف الانحراف ولا النقص ولا الزيادة مسكنه بقبة أرين منقطع عن الخلق إلا من شاء الله عاش طيبا مع الله إلى أن توفاه الله وكان من الأوتاد أيضا فانتقل إلى القطبية يقول إن الوجود وجود الحق وإن الجمع جمع الحق صفات القدم والحدوث وهو علم غريب في الجمع ما رأيت من يقول به من أهل الله غير هذا القطب فإني شاهدت هؤلاء الأقطاب أشهدنيهم الحق وإن كانوا قد درجوا من الدنيا وهو العلم الذي وردت به الشرائع في جانب الحق فنقول ذلك هو الجمع وعنده إن المحدث صاحب دعوى في تلك الصفات المسماة محدثة ولأجل دعواه قلنا إنه جمع وإلا فالأمر واحد كلها صفات قدم في القديم ومحدثة في المحدث لظهورها فيه ولم تكن ظاهرة فحدثت عند المتصف بها كما قال ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ وليس إلا كلام الله القديم فجمعنا عليه ما له مع نسبته إلينا فسمي من فعل ذلك صاحب جمع ووجود فمحكوم حكم الممكنات وجود الحق لا غيره فمن فهم الجمع هكذا علم الأمور كيف هيه‏\n\n\n> من دري الجمع هكذا *** علم الأمر كيف هو\n\n\n> فهو الحق لا سواه *** فلا تسمعنه‏\n\n\n### [القطب الخامس الذي على قدم داود ع‏]\n\n\nوأما القطب الخامس الذي على قدم داود عليه السلام فسورته من القرآن إِذا زُلْزِلَتِ ولها نصف القرآن ومنازله بعدد آيها وحاله التفرقة وله مقام المحبة فهو معلول للحب فداؤه دواؤه وما له علم يتقدم فيه على غيره إلا علم ثبوت المحبة الإلهية والكونية ولهذا كان في مقام التفرقة وكان من الأئمة فنقل إلى القطبية يقول هذا القطب إن الحب ما ثبت وكل حب يزول فليس بحب أو يتغير فليس بحب لأن سلطان الحب أعظم من أن يزيله شي‏ء حتى إن الغفلة التي هي أعظم سلطان تحكم على الإنسان لا يتمكن لها أن تزيل الحب من المحب يتمكن عنده إن يغفل الإنسان عن نفسه بمحبوبه ولا يتمكن للمحب أن يغفل بأحد عن محبوبه فذلك هو المحب وذلك هو الحب‏\n\n\n> فداء المحبة ما لا يزول *** وإن الشفاء له مستحيل‏\n\n\n> فلا تركنن إلى غير ذا *** ولا تصغين إلى ما يقول‏\n\n\nفبحب الله أحببنا الله وحب الحق لا يتغير فحب الكون لا يتغير فقيل له فحب الكون الكون هل يتغير قال لا لأن الكون محبوب لذاته والمحبة الذاتية لا يمكن زوالها قيل له فقد رأينا من تستحيل مودته فقال تلك إرادة ما هي محبة إذ لو كانت محبة ثبتت أ لا تراها تسمى ودا لثبوتها وثبوت حكمها وذلك أنه ما في المحب لغير محبوبه فضلة من ذاته يتمكن للمزيل أن يدخل عليه منها هذا سبب ثبوتها فإنه يشاهد عين محبوبه في كل شي‏ء يشهده فلا يفقده فلو صح للمحب أن يشهد غير محبوبه في عين ما لدخل عليه من ذلك ما يزيل حبه وهذا ليس بواقع في الحب فالتبس علي من هذه حالته حكم الإرادة بحكم الحب وما كل مريد محب وكل محب مريد وما كل مراد محبوب وكل محبوب مراد فمقام هذا القطب ما ذكرناه وشأنه عجيب وتفصيل حاله يطول ومذهبنا الاختصار\n\n\n### [القطب السادس الذي على قدم سليمان ع‏]\n\n\nوأما القطب السادس الذي على قدم سليمان عليه السلام فسورته الواقعة ولها الحياة الدائمة ومنازله بعدد آيها اختص بعلم الحياة والحيوان لا يأخذ حالا من أحواله إلا عن ربه فأحواله أحوال ربه هداه هدى الأنبياء كما أمر الله نبيه صَلَّى اللهُ عَليهِ وسَلَّم لما ذكر له الأنبياء عليه السلام قال أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ وما قال فبهم اقتده فعلمنا إن محمدا مساو لجميع من ذكره من الأنبياء ومن لم يذكره فإنه لكل نبي هدى كما ذكر لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً فهو سبحانه نصب الشرائع وأوضح المناهج وجمع ذلك كله في محمد صَلَّى اللهُ عَليهِ وسَلَّم فمن رآه فقد رأى جميع المقربين ومن اهتدى بهديه فقد اهتدى بهدى جميع‏\n\n\n> النبيين وما على الله بمستنكر *** أن يجمع العالم في واحد\n\n\nوأعني بقولي إن أحوال هذا القطب أحوال ربه ما قال الحق عن نفسه من أنه كل يوم في شأن فهذا عبارة عن اختلاف الأحوال فهو من القوم الذين يشاهدون الحق في شئونه فينظرون إلى ما له من الشئون فيهم فيتلبسون بها منه فهم من أحوالهم على بصيرة فمن هذه حاله ما هو مثل من حاله التخلق بالأسماء الإلهية بل لهذا ذوق ولهذا ذوق فمثل هذا الرجل‏\nيكون مجهول الحال لأن مواطن الحق خفية لا يدركها إلا من كان مقامه التلبس بالشئون والدليل على ذلك إنا قد جمعنا على أنه لا موجد إلا الله وأنه حكيم يضع الأمور مواضعها ولا يتعدى بها موطنها فكل شي‏ء ظهر في العالم فهو حكمة في موضعه وقد جمعنا أن جميع الخلق وأن أهل الله أكثرهم يقولون لو كان كذا عن فعل من الأفعال ظهر في الوجود على يد إنسان لكان أحسن من هذا الفعل الذي فعلت وأولى يقولون للذي يظهر ذلك الفعل الإلهي فيه وعلى يديه فهل هذا إلا لجهلهم بحكمة الله فيما وقع لهم فيه مثل هذا القول فهذا ما وقع من أهل الله إلا بغفلتهم عن الله لا بجهلهم فإذا ذكروا تذكروا ويقع من غير أهل الله بجهله لا بغفلته فإنه لا يزول عما ذهب إليه في ذلك الفعل من اللؤم حتى تبدو له حكمة الله فيه متى بدت حينئذ يعترف بجهله ويعرف قصور علمه وعقله وما رأيت أحدا من أهل هذا الذوق ولا سمعت بأنه رى‏ء وهو قريب في غاية الظهور ولكن الأغراض تمنع والأهواء من التعمل في تحصيله وذلك أن حجة من لا يروم تحصيله من أهل الدين يقول إن الشرع قد أمرنا أن ننكر أشياء وأن نقول الأولى ترك هذا من فعله مع علمي بأن الفعل لله قلنا صدقت ولكن ما خرج مثل هذا الاعتراض من شخص فهم رتبتي وذلك أني قلت إنه جهل حكمة الله فيما اعترض فيه فمن اعترض باعتراض الشرع فهو ناقل اعتراض الله فيما اعترض ما هو المعترض وذلك الاعتراض إذا وجد من الله يعلم صاحب هذا الذوق حكمته ومنزلته وصاحب هذا الحال يأمر بالمعروف وينهى عن المنكر ويقيم الحدود وهو يشاهد حكمة ذلك كله ويراها في الشئون الإلهية المشهودة له ولا يشهدها إلا عند تكوينها خاصة هذا هو مقام صاحب هذا الحال فإن من أهل الله أيضا من يشاهد هذه الشئون قبل أن يكون الحق فيها وهو الذي يشاهد أعيان الممكنات في حال عدمها كما يشهدها الحق ولهذا يعين الحق منها ما يعين بالتكوين دون غيرها من الممكنات فإن الحق لا يوجدها إلا بما هي عليه في حال عدمها من غير زيادة ولا نقصان ومن أهل الله من يشهد الأمر قبل ظهوره في الحس وهو التكوين الآخر يشهده في الإمام المبين وهو اللوح المحفوظ الحاوي على المحو والإثبات فكل شي‏ء فيه فلذلك الشي‏ء تكوين أول في التسطير وهذا الكشف دون كشف الذي يريه الله أعيان الممكنات على ما تكون عليه في حال الوجود فيحكم بها حكم الله\n\n\nفيها ولإدراك هذه الشئون قبل ظهورها في الحس مدارك كثيرة أعلاها ما ذكرناه أي أقصاها وبعده مشاهدة الحق في تكوينها فإن ذلك أعلى من مشاهدة المشاهد إياها في الإمام المبين وفي غيره ودون هذا الشهود كل شهود يكون للعبد قبل تكوين الشأن هذا حال من‏\n\n\nقال ما رأيت شيئا إلا رأيت الله معه‏\n\n\nوهو أعلى حالا من الذي يقول ما رأيت شيئا إلا رأيت الله قبله فإن الأولى كلمة تحقيق وإن كانت الأخرى مثلها في التحقيق لكن بينهما فرقان فالواحد قوله مثل من يقول رأيت زيدا يصنع كذا ويقول الآخر رأيت الصانع يصنع كذا فهذا الفرق بين الشخصين فيما يشهد أنه فإن الأسماء الأعلام ما وضعت إلا للتخاطب بها في حال غيبة المسمى بها وفي الحضور ما هي مطلوبة وإن جي‏ء بها فأما لأدب يقتضيه الحال وإما تأكيد في الأخبار فقد أبنت لك من حال هذا القطب ما سمعت وله أحوال كثيرة أعرفها أفعله في كل قطب ما أذكر جميع أحواله لأن ذلك يتسع الخرق فيه بحيث إنه لا بقي به الوقت‏\n\n\n### [القطب السابع الذي على قدم أيوب ع‏]\n\n\nوأما القطب السابع الذي على قدم أيوب عليه السلام وسورته البقرة وهي البيضاء الحاوية على سيدة آي القرآن ومنازله بعدد حروفها لا آيها حال هذا القطب العظمة بحيث إنه يرى أن العالم لا يسعه لأن ذوقه كونه وسع الحق قلبه وقد ورد في الخبر أن الحق يقول ما وسعني أرضي ولا سمائي ووسعني قلب عبدي‏\n\n\nوما كل قلب يسع الحق وقال ولكِنْ تَعْمَى الْقُلُوبُ الَّتِي في الصُّدُورِ فبين مكان القلوب فإذا كان مشهودا لعبد كون الحق في قلبه فكما لا يسع العالم الحق لا يسع العالم أيضا هذا العبد فهذا سبب شهود ضيق العالم عنه وما رأيت من تحقق بهذا المقام وشهوده إلا رجلا بالموصل من أهل حديثة الموصل كان بهذه المثابة وأطلعه الحق على أمر ولم يطلعه على سره فيه وكان يطلب على من يوضح له حاله فذكرني له الإمام نجم الدين محمد بن أبي بكر بن شاى الموصلي المدرس بمدرسة سيف الدين بن علم الدين بحلب في هذا الزمان الذي نحن فيه وهو سنة ثمان وعشرين وستمائة فطلب الاجتماع بنا فلما وصل ذكرنا زلته فأوضحتها له فسرى عنه واستبشر وخرج لي بحاله لما رآني فهمته فوجدته قد أخذ من مقام العظمة بحظ وافر لكنه دون ذوق هذا القطب‏\nفيه لأنه أخبرني أن النخامة كانت تدور في فيه لا يقدر أن يلقيها من فيه لأنه لا يجد لها محلا تقع فيه خاليا من الحق وقد علم ما جاء في الأدب في إلقائها في الشرع فكان يتحير ورأيت آخر مثله بإشبيلية من بلاد الأندلس وروينا عن الحلاج أنه ذاق من هذا المقام حتى ظهر عليه منه حال المقام فكان له بيت يسمى بيت العظمة إذا دخل فيه ملأه كله بذاته في عين الناظر حتى نسب إلى علم السيمياء في ذلك لجهلهم بما هم عليه أهل الله من الأحوال والمتمكن في هذا المقام لا يظهر عليه بالحال ما يدل على أنه صاحب هذا الذوق ولكن نعوته تجري بحكم هذا المقام لا حاله فإن الحال يعطي خرق العوائد كما قال صاحب محاسن المجالس فيها لما ذكر الأحوال أنها للمريدين قال والأحوال للكرامات يريد خرق العوائد وليست الكرامات في عرف هذا اللسان الأخرق العوائد مع الاستقامة في الحال أو تنتج الاستقامة في الفور لا بد من ذلك عندهم وسبب هذا التحديد إن خرق العادة قد لا يكون كرامة من الله للعبد فأكملهم في مقام العظمة من يجهل حاله ولا يعرف فيعرف ما يعامل به ويجار الناظر فيه إلا أنه على بينة من ربه وبصيرة من أمره فمن أراد أن يعرف أحوال هذا الإمام فليتدبر آيات سورة البقرة آية بعد آية حتى بختمها فهذا القطب مجموع آيها وبالله التوفيق وأما القطب الثامن الذي على قدم الياس عليه السلام وسورته آل عمران وهي البيضاء أيضا ومنازله بعدد آيها ولست أعني بقولي القطب الأول والثاني إن هذا الترتيب بالزمان إنما أريد به ترتيب العدد إلى أن يكمل اثنا عشر قطبا فقد يكون الثاني عشر أو غيره هو الأول بالزمان وإنما أعلمت بذلك لئلا يتوهم من قد أوقفه الله وأطلعه على العلم بأزمان هؤلاء الأقطاب فيرى هذا الترتيب الذي سقناه فيهم أنه ترتيب أزمانهم فلذلك بينت أنه ترتيب العدد لا غير وحال هذا القطب العلم بالمتشابه من كلام الله الذي ما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله فيعلمه هذا القطب بإعلام الله خاصة ولا يعلم أبدا إلا بإعلام الله فيكون عنده محكما في تشابهه فيعرف من أي وجه كان التشابه فيه فيحصل له علم المناسبة التي جمعت بين الله وبين من وقع معه التشابه في الآية كآيات التشبيه كلها أو ترقع التشبيه من طريق دلالة للفظ المشترك الذي لا يكون إلا لمناسبة خفية فإن المناسبة في التشبيه جلية وفي الاشتراك خفية كالنور للعلم جلي فتسمى العلم نورا والنور نورا كقوله وجَعَلْنا لَهُ نُوراً وجَعَلْناهُ يعني الوحي وهو العلم نُوراً نَهْدِي به من نَشاءُ من عِبادِنا وفي الاشتراك كالعين فالمناسبة في العينية في كل مسمى بالعين خفية فهي عند هذا القطب جلية بإعلام الله وأما أصحاب التأويل بالنظر في ذلك فما هم على علم وإن صادفوا العلم ومن هذا العلم تعلم أن النساء شقائق الرجال أ لا ترى حواء خلقت من آدم فلها حكمان حكم الذكورة بالأصل وحكم الأنوثة بالعارض فهي من المتشابه فإن الإنسانية مجمع الذكر والأنثى وأين حقيقة الفاعل من المنفعل لمن هو فيه فاعل ولا يفعل إلا في مشاكله وذلك أنه أول ما أحدث الانفعال في نفسه فظهر فيه صورة ما ينفعل عنه وبتلك القوة انفعل عنه ما انفعل وظهر كالبديع والمخترع والحق قد قدمنا تحقيق العلم بالعالم أن العلم يتبع المعلوم والعلم صفة العالم والمعطي العلم ما هو المعلوم عليه ثم يعطي العالم إيجاد المعلوم كما يعطي المخترع إيجاد الأمر المخترع وإظهاره في الوجود فمن هنا يعرف لما حبب الله النساء لمحمد صَلَّى اللهُ عَليهِ وسَلَّم فمن أحب النساء حب النبي صَلَّى اللهُ عَليهِ وسَلَّم لهن فقد أحب الله والجامع الانفعال لما كان من إعطاء المعلوم العلم ليقال فيه إنه عالم فهو أول منفعل لمعلوم وظهر في عيسى انفعاله عن مريم في مقابلة حواء من آدم إِنَّ في ذلِكَ لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ فيفهم قول الله عز وجل يا أَيُّهَا النَّاسُ إِنَّا خَلَقْناكُمْ من ذَكَرٍ مثل حواء وأُنْثى‏ مثل عيسى وبالمجموع مثل بنى آدم باقي الذرية فهي الجامعة لخلق الناس ولقد كنت من أكره خلق الله تعالى في النساء وفي الجماع في أول دخولي إلى هذا الطريق وبقيت على ذلك نحوا من ثمان عشرة سنة إلى أن شهدت هذا المقام وكان قد تقدم عندي خوف المقت لذلك لما وقفت‏\n\n\nالخبر النبوي أن الله حبب النساء لنبيه ص‏\n\n\nفما أحبهن طبعا ولكنه أحبهن بتحبيب الله إليه فلما صدقت مع الله في التوجه إليه تعالى في ذلك من خوفي مقت الله حيث أكره ما حببه الله لنبيه أزال عني ذلك بحمد الله وحببهن إلي فإنا أعظم الخلق شفقة عليهن وأرعى لحقهن لأني في ذلك على بصيرة وهو عن تحبب لا عن حب طبيعي وما يعلم قدر النساء إلا من علم وفهم عن الله ما قاله في حق زوجتي رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عند ما تعاونا عليه وخرجا عليه كما ذكر الله في سورة التحريم وجعل في مقابلة\nهاتين المرأتين في التعاون عليه من يعاون رسول الله صَلَّى اللهُ عَليهِ وسَلَّم عليهما وينصره وهو الله وجبريل وصالحو المؤمنين ثم الملائكة بعد ذلك وليس ذلك إلا لاختلاف السبب الذي لأجله يقع التعاون فثم أمر لا يمكن إزالته إلا بالله لا بمخلوق ولذلك أمرنا أن نستعين بالله في أشياء وبالصبر في أشياء وبالصلاة في أشياء فاعلم ذلك وكان ثم أمر وإن كان بيد الله فإن الله قد أعطى جبريل اقتدارا على دفع ذلك الأمر فأعان محمدا صَلَّى اللهُ عَليهِ وسَلَّم في دفعه إن تعاونا عليه وإن رجعا عنه وأعطيا الحق من نفوسهما سكت عنهما كما سكتنا فكان لهما الأمر من قبل ومن بعد وهو نعت إلهي فإنه لحركتهما تحرك من تحرك ولسكونهما سكن الذي أراد التحرك وكذلك صالحو المؤمنين كان عندهما أمر نسبته في الإزالة بصالحي المؤمنين أقرب من نسبته إلى غيرهم فيكون صالِحُ الْمُؤْمِنِينَ معينا لمحمد صَلَّى اللهُ عَليهِ وسَلَّم ثم الملائكة بعد ذلك إذا لم يبق إلا ما يناسب عموم الملائكة التي خلقت مسخرة يدفع بها ما لا يندفع في الترتيب الإلهي إلا بالملائكة مع انفراد الحق بالأمر كله في ذلك والقيام به ولكن الجواز العقلي فأخبر الحق بالواقع لو وقع كيف كان يقع فما يقع إلا كما قاله وما قال إلا ما علم أنه يقع بهذه الصورة وما علم إلا ما أعطاه المعلوم من نفسه أنه عليه بما شهده أزلا في عينه الثابتة في حال عدمه فانظر يا ولي كيف تبدي الأمور حقائقها لذي فهم وقلب جعلنا الله وإياكم من أهل الفهم عن الله ممن لَهُ قَلْبٌ يعقل به عن الله وأَلْقَى السَّمْعَ لخطاب الله وهُوَ شَهِيدٌ لما يحدثه الله في كونه من الشأن‏\n\n\n### [القطب التاسع الذي على قدم لوط ع‏]\n\n\nوأما القطب التاسع الذي على قدم لوط عليه السلام فسورته سورة الكهف ولها العصمة والاعتصام ومنازله بعدد آيها حاله العصمة من كل ما يؤدي إلى سوء الأدب الذي يبعد صاحبه عن البساط فهو محفوظ عليه وقته أبدا وعلمه علم الاعتصام وقد عينه الله وحصره في أمرين الاعتصام به فقال عز من قائل واعْتَصَمُوا بِاللَّهِ والاعتصام الآخر بحبله وهو قوله تعالى واعْتَصِمُوا بِحَبْلِ الله جَمِيعاً فمن الناس من اعتصم بالله ومنهم من اعتصم بحبل الله وقال إن الاعتصام بحبل الله هو عين الاعتصام بالله وهذا القطب جمع بين هذين الاعتصامين والفرق بين الاعتصامين أن حبل الله هو الطريق الذي يعرج بك إليه مثل قوله إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ يَرْفَعُهُ وليس حبله سوى ما شرعه وتفاضل فهم الناس فيه فمنهم ومنهم ولذلك فَضَّلَ الله بَعْضَهُمْ عَلى‏ بَعْضٍ فمن لم يخط طريقه فهو المعصوم والتمسك به هو الاعتصام وعليه حال المؤمنين الذين بلغوا الكمال في الايمان ومثل هؤلاء يعتصمون بالله في اعتصامهم بحبل الله وهو قوله وإِيَّاكَ نَسْتَعِينُ وقوله اسْتَعِينُوا بِاللَّهِ وأما الاعتصام بالله فهوقوله صَلَّى اللهُ عَليهِ وسَلَّم قوله في الاستعاذة وأعوذ بك منك‏\n\n\nفإنه لا يقاومه شي‏ء من خلقه فلا يستعاذ به إلا منه فإن الإنسان لما حصل في سمعه أنه مخلوق على صورة الحق ولم يفرق بين الإنسان الكامل وبين الإنسان الحيوان وتخيل أن الإنسان لكونه إنسانا هو على الصورة وما هو كما وقع له ولكنه بما هو إنسان هو قابل للصورة إذا أعطيها لم يمتنع من قبولها فإذا أعطيها عند ذلك يكون على الصورة ويعد في\n\n\nجملة الخلفاء فلا يتصرف من هو على الصورة إلا تصرف الحق بها وتصرف الحق عين ما هو العالم عليه وفيه وأنت تعلم بكل وجه ما العالم فيه من مكلف وغير مكلف ومما ينكر ويعرف ولا يعرف ما ينكر وما يعرف من العالم المكلف إلا الخليفة وهو صاحب الصورة فالحق له حكم الإنكار لا للعبد فالمعتصم بالله إذا كان صاحب الصورة لا يعتصم إلا منه بأن يظهر به في موطن ينكره عليه وإن كانت صفته فليس له أن يتلبس بها في كل موطن ولا يظهر به في كل مشهد بل له الستر فيها والتحلي بها بحسب ما يحكم به الوقت وهذا هو المعبر عنه بالأدب ولو كان مشهده أنه لا يرى إلا الله بالله وأن العالم عين وجود الحق وأعظم من هذا الصارف عن الإنكار فلا يكون ولكن لا بد من الإنكار إن صح له هذا المقام فهو ينكر بحق على حق لحق ولا يبالي وحجته قائمة\n\n\n### [القطب العاشر الذي على قلب هود ع‏]\n\n\nوأما القطب العاشر الذي على قلب هود عليه السلام فسورته سورة الأنعام ولها الكمال والتمام في الطوالات ومنازله بعدد آيها ولهذا القطب علوم جمة منها علم الاستحقاق الذي يستحقه كل مخلوق في خلقه وعلم ما يستحقه ذلك الخلق من المراتب فأما استحقاق الخلق فقوله أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ وأما المراتب فالتنبيه عليها من قوله تعالى وما قَدَرُوا الله حَقَّ قَدْرِهِ ويا أَهْلَ الْكِتابِ لا تَغْلُوا في دِينِكُمْ وهو أن تزيده على مرتبته أو تنقصه منها وما يتميز العالم العاقل من غيره إلا بإعطاء كل ذي حق حقه وإعطاء كل شي‏ء خلقه ومتى‏\nلم يعلم ذلك فهو جاهل بالحق ومتى علم ولم يعمل بعلمه فهو غير عاقل فلا بد لصاحب هذا المقام أن يكون تام العقل كامل العلم وهذا هو الحفظ الإلهي والعناية العظمى والسلوك على هذه الطريقة المثلى التي هي الطريقة الزلفى هو السلوك الأقوم ولما أتم الله خلق العالم روحا وصورة وأنزل كل خلق في رتبته جعل بين العالم التحاما روحانيا وجسمانيا لظهور أشخاص كل نوع من العالم إذ كان دخول أشخاص كل نوع في الوجود مستحيلا وإنما فعل ذلك ليظهر فضل الفاعل على المنفعل بالذوق فيعلمون فضل الحق على عباده ويعرفون كيف يتحققون معه في عبودتهم ونسب إليهم الخلق فقال وإِذْ تَخْلُقُ من الطِّينِ وقال فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ فذكر إن ثم خالقين الله أحسنهم خلقا فإنه تعالى يخلق ما يخلق عن شهود والخالق من العباد لا يخلق إلا عن تصور يتصور من أعيان موجودة يريد أن يخلق مثلها أو يبدع مثلها وخلق الحق ليس كذلك فإنه يبدع أو يخلق المخلوق على ما هو ذلك المخلوق عليه في نفسه وعينه فما يكسوه إلا حلة الوجود بتعلق يسمى الإيجاد فمن أوقفه الله كشفا على أعيان ما شاء من الممكنات فليس في قوته إيجادها أي ليس بيده خلعة الوجود التي تلبسها تلك العين الثابتة الممكنة أعني بالمباشرة ولكن له الهمة وهي إرادة وجودها لا إرادة إيجادها منه لأنه يعلم أن ذلك محال في حقه فإذا علق همته بوجودها يتعلق الحق القول بالتكوين فتعلم قول ربها من قول الخلق سواء كان القول على لسان الخلق أو كان من الحق بارتفاع الوسائط فيتكون ذلك الشي‏ء ولا بد فيقال في الشاهد فعل فلان بهمته كذا وكذا وإن تكلم يقال قال فلان كذا وكذا فانفعل عن قوله كذا فمن عرف ذلك عرف ما للعبد في ذلك التكوين وما للحق فيه فلذلك قال إنه أَحْسَنُ الْخالِقِينَ فإذا ظهر عين ذلك المكون أي شي‏ء كان تشوفت إليه مرتبته لأن مزاجه يطلبها وأعني المرتبة الأولى فيكتسب الاستعداد لأمور علية أو دنية بحسب ما يعطيه ذلك الاستعداد المكتسب فيظهر في العالم بصورة ذلك فإذا نظر فيه الأجنبي وأعني بالأجنبي الذي لا علم له بالحقائق ونظر إلى استعداده فأعطاه نظره أنه نازل عن رتبته أو رتبته فوق ذلك أعني الرتبة التي ظهر فيها والأمر في نفسه ليس كما ظهر لصاحب هذا النظر فإن الاستعداد المؤثر إنما هو في الخلق وهو استعداد ذاتي وأما الاستعداد العرضي فلا حكم له بل الاستعداد العرضي رتبة أظهرها الاستعداد الذاتي وغاب هذا القدر من العلم عن أكثر الخلق مثال ذلك أن يروا شخصا ساكتا قد تصور العلوم وأحكمها وأعطى من المراتب أخسها ممن لا ينبغي لمن جمع هذه الفضائل والعلوم أن يكون غايته تلك الرتبة فيقال إنه قد حط هذا الرجل عن رتبته وما أنصف في حقه وما عندهم خبر بأن رتبته إنما هي عين تلك الفضائل التي جمعها وتلك العلوم التي أحكمها ومن جملتها هذه المرتبة الخسيسة التي ولاة السلطان عليها إن كان من الولاة وإن لم يكن من الولاة ولا نال شيئا مع هذا الفضل من المناصب قيل فيه إنه محروم وما هو محروم وإنما الموطن اقتضى ذلك وهو أن الدنيا اقتضت أن يعامل فيها الجليل بالجلال في وقت وفي وقت يعامل الجليل بالصغار وفي وقت يعامل الصغير بالصغار وفي وقت يعامل الصغير بالجلال بخلاف موطن الآخرة فإن العظيم بها يعامل بالعظمة والحقير بها يعامل بالحقارة ولو نظر الناظر لرأى في الدنيا من يقول في الله ما لا يليق به تعالى ومن يقول فيه ما يليق به من التنزيه والثناء وأعظم من الحق فلا يكون هذا العبد فمن علم المواطن علم الأمور كيف تجري في العالم وإلى الله يُرْجَعُ الْأَمْرُ كُلُّهُ ما صح منه وما اعتل فلا تنظر إلى المناصب وانظر إلى الناصب الذي يعمل بحكم المواطن لا بما يقتضيه النظر العقلي فإن الناظر إذا كان عاقلا علم بعقله أن موطن الدنيا كذا يعطى ويترك عنه الجواز العقلي الذي يمكن في كل فرد فرد من أفراد العالم فإن هذا الجواز في عين الشهود ليس بعلم ولا صحيح وليكن العاقل مع الواقع في الحال فإن ذلك صورة الأمر على ما هو عليه في نفسه لا تعلق لعاقل بالمستقبل إلا إن أطلعه الله كشفا على أعيان الممكنات قبل وقوعها\n\n\nفي الوجود فلا فرق بينه وبين من شهدها في وقوعها لأن هذا المكاشف يزول عنه حكم الجواز العقلي فيما كوشف به وأطلعه الله عليه فهذا بعض علم هذا القطب‏\n\n\n### [القطب الحادي عشر الذي على قدم صالح ع‏]\n\n\n«و أما القطب الحادي عشر الذي على قدم صالح ع» فسورته من القرآن سورة طه ولها الشرف التام ومنازله بعدد أيها اعلم أن هذا القطب دون سائر الأقطاب أشرف بهذه السورة من سائر الأقطاب لأن هذه السورة أشرف سورة في القرآن في العالم السعيد\nفإنها السورة التي يقرءوها الحق تعالى في الجنة على عباده بلا واسطة وهذا القطب له علوم جمة له البطش والقوة كما قال أبو يزيد البسطامي وقد سمع قارئا يقرأ إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ فقال بطشي أشد وكان حاله حال من ينطق بالله فقول الله عن نفسه أن بطشه شديد على لسان عبده أشد من بطشه بغير لسان عبده ثم بطشه على لسان عبده الطبيعي أشد من بطشه على لسان عبده الإلهي بما لا يتقارب وأكثر علم هذا الإمام في التنزيه والإحاطة وليس التنزيه والإحاطة التي يعلم هو المفهوم المتعارف بل هو تنزيه التنزيه المتعارف وجعله في ذلك علم الإحاطة وذلك أن تنزيهه عدم المشاركة في الوجود فهو الوجود ليس غيره والمعبر عنه عنده بالعالم إنما هو الاسم الظاهر وهو وجهه فما بطن منه عن ظاهره فهو الاسم الباطن وهو هويته فيظهر له ويغيب عنه وأما الآلام واللذات فتقابل الأسماء وتوافقها وبها تكثرت الصور فإنها التي تشكلت فأدرك بعضها بعضا فكان محيطا بها منزها عنها فله الستر عنها والتجلي فيها فتختلف عليه الصور فينكر حاله مع علمه أنه هو وهو ما تسمعه من قول الإنسان عن نفسه إني في هذا الزمان أنكر نفسي فإنها تغيرت علي وما كنت أعرف نفسي هكذا وهو هو ليس غيره فمن حيث تشكل الأسماء له الإمكان ومن حيث العين القابلة لاختلاف الصور الأسمائية عليها له الوجوب فهو الواجب الممكن والمكان والمتمكن المنعوت بالحدوث والقدم كما نعت كلامه العزيز بالحدوث مع اتصافه بالقدم فقال ما يَأْتِيهِمْ الضمير يعود على صور الأسماء إلا الرب من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ فنعته بالحدوث فهو حادث عند صورة الرحمن وما يأتيهم الضمير مثل الأول إلا الرحمن من ذكر من الرحمن محدث فنعته بالحدوث فهو حادث عند صورة الرب فإن تقدم إتيان ذكر الرب كان ذكر الرحمن جوابه وإن تقدم ذكر الرحمن كان ذكر الرب جوابه فالمتقدم أبدا من الذكرين قرآن والثاني فرقان ف لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ للمتقدم منهما وهو القرآن وهُوَ السَّمِيعُ الْبَصِيرُ للآخر منهما وهو الفرقان ف هُوَ الْأَوَّلُ والْآخِرُ كما هو الظَّاهِرُ والْباطِنُ وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ وليس إلا قبول صور الأسماء وكل للاحاطة فانحصر الأمر فيه فما قال كن إلا له ولا كنى بيكون إلا عنه أ لا تراه تسمى بالدهر وأنه يقلب الليل والنهار وليس الدهر غير الليل والنهار وليس التقليب سوى اختلاف الصور فالأيام والساعات والشهور والأعوام هي عين الدهر وفي الدهر وقع التفصيل بما ذكرناه فمن وجه هو ساعة ومن وجه هو يوم وليل ونهار وجمعة وشهر وسنة وفصول ودور\n\n\n> فكل خير هو له *** وكل شر ليس له‏\n\n\n> فهو الوجود كله *** وفقده ما هو له‏\n\n\n> يعلمه من علمه *** يجهله من جهله‏\n\n\n> فإنما أنابه *** في كل أحوالي وله‏\n\n\n> فأنت هو ما أنت هو *** وأنت له ما أنت له‏\n\n\n> ولو صنعت صنعه *** ولو عملت عمله‏\n\n\nفهذا من بعض أنفاس علم هذا القطب وهكذا مجراه في علومه كلها على كثرتها وتفاصيلها\n\n\n### [القطب الثاني عشر الذي على قدم شعيب ع‏]\n\n\n(و أما القطب الثاني عشر) الذي على قدم شعيب عليه السلام فسورته من القرآن سورة تَبارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وهي التي تجادل عن قارئها ومنازله بعدد آيها انظر في جدالها في قوله ما تَرى‏ في خَلْقِ الرَّحْمنِ من تَفاوُتٍ فَارْجِعِ الْبَصَرَ ... كَرَّتَيْنِ ينبه على النظر في المقدمتين هَلْ تَرى‏ من فُطُورٍ يعني خللا يكون منه الدخل فيما يقيمه من الدليل يَنْقَلِبْ إِلَيْكَ الْبَصَرُ وهو النظر خاسِئاً بعيدا عن النفوذ فيه بدخل أو شبهه وهُوَ حَسِيرٌ أي قد عيي أي أدركه العياء وكل آية في هذه السورة فإنها تجري على هذا النسق إلى أن ختم بقوله قُلْ أَ رَأَيْتُمْ إِنْ أَصْبَحَ ماؤُكُمْ غَوْراً فَمَنْ يَأْتِيكُمْ بِماءٍ مَعِينٍ أ لا ترى الوجود كله من غير تعليم هل تراه في حال اضطراره يلجأ إلى غير الله ما يلجأ إلا إلى الله بالذات فلو كان غيرا ما عرفه حتى يلجأ وهو قول العامة فيمن رزئ مالك لما ترجع في رزيتك إلا إلى الصبر والصبر ليس إلا صفة الصابر فتسمى أيضا بالصبور يقول أنا هو ما ثم غيري وهذا عين ما ادعاه في علمه القطب الذي على قدم صالح صلى الله على نبينا محمد وعليه وسلم‏\n\n\n> فيا شعيب ما ثم عيب *** لكنه شاهد وغيب‏\n\n\n> فانظر إلى حكمة وفصل الخطاب *** فيها ما فيه ريب‏\n\n\nولهذا القطب علم البراهين وموازين العلوم ومعرفة الحدود كله روح مجرد لطيفة حاكم على الطبيعة مؤيد للشريعة\nبين أقرانه ضخم الدسيعة يطعم ولا يطعم وينعم ولا يتنعم الغالب عليه التفكر ليتذكروا الدخول في الأمور الواضحة ليتنكر فهو المجهول الذي لا يعرف والنكرة التي لا تتعرف أكثر تصرفه فيما يتصرف فيه من الأسماء الإلهية الاسم المدبر والمفصل والمنشئ والخالق والمصور والبارئ والمبدئ والمعيد والحكم والعدل ولا يرى الحق في شي‏ء من تجليه دون أن يرى الميزان بيده يخفض ويرفع فما ثم إلا خفض ورفع لأنه ما ثم إلا معنى وحرف وروح وصورة وسماء وأرض ومؤثر ومؤثر فيه فما ثم إلا شفع وكل واحد من الشفع وتر فما ثم إلا وتر والْفَجْرِ ولَيالٍ عَشْرٍ والشَّفْعِ والْوَتْرِ فالشفع يطلب الشفع والوتر يطلب الوتر وهو طلب الثأر\n\n\n> فشفعه في وتره ظاهر *** ووتره في شفعه مندرج‏\n\n\n> وجادت السحب بأمطارها *** فكان ما كان بأمر مرج‏\n\n\n> فحدثت أرضك أخبارها *** وأنبتت من كل زوج بهج‏\n\n\n> تفني إذا شاهدت أعيانها *** بعين غير الحق فيها المهج‏\n\n\n> يباين الضد بها ضده *** وشكله بشكله مزدوج‏\n\n\n> ونزهة الأبصار فيما بدا *** في العالم العلوي بين الفرج‏\n\n\n> فكل ما للعين من ظاهر *** عنه إذا حققته ما خرج‏\n\n\nجمع لهذا القطب بين القوتين القوة العلمية والقوة العملية فهو صنع لا يفوته صنعه بالفطرة وله في كل علم ذوق إلهي من العلوم المنطقية والرياضية والطبيعية والإلهية وكل أصناف هذه العلوم عنده علوم إلهية ما أخذها إلا عن الله وما رآها سوى الحق ولا رأى لها دلالة على الحق فكل علم أو مسألة من ذلك العلم له آية ودلالة على الله لا يعرف لها دلالة على غيرها لاستغراقه في الله لأنه مجذوب مراد لم يكن له تعمل فيما هو فيه بل وجد فيه أنه هو ثم فتح عينيه فرأى كل شي‏ء رؤية إحاطة بما رأى فالزيادة التي يستفيدها إنما هي في تفصيل ما رأى دائما أبدا لأنه كل مرئي في الوجود فإنه يتنوع دائما فلا تزال الإفادة دائما وكل استفادة زيادة علم لم يكن عنده في معلوم لم يزل عالما به مشهودا له فهذا قد ذكرنا من أحوال الاثني عشر قطبا ما يسر الله ذكره على لساني والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ فواحد من هؤلاء الأقطاب له الواحد من العدد وهو صاحب التوحيد الخالص وآخر له الثاني من العدد وهكذا كل واحد إلى العاشر والحادي عشر له المائة والثاني عشر له الألف والمفرد له تركيب الأعداد من أحد عشر إلى ما لا نهاية له وذلك للافراد وهم الذين يعرفون أحدية الكثرة وأحدية الواحد جعلنا الله وإياكم ممن فهم عن الله ما سطره في العالم من العلم به سبحانه الدال عليه عز وجل إنه الولي المحسان الجواد الكريم المنان والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Four Hundred and Sixty-Three: Concerning the Knowledge of the Twelve Poles (أقطاب) upon whom the World (عالم) of their Time Revolves.\n\n> The ultimate limit of the Names in number,\n> Is twelve, together with the knot (or covenant).\n> By them is Existence (الوجود) preserved, and whatever\n> Number is contained within the Being of the Real (الحق).\n> He is described by number,\n> And He is described by the One (الأحد).\n> The rulings of their origination appeared\n> In that which stands without pillars.\n> Their governance is perfected in the Pillars (الأركان),\n> In the father among them, and in the son.\n\n### [The Poles of this Community are Twelve Poles]\n\nAllah the Exalted said to His Prophet, peace and blessings be upon him: <<قُلْ هُوَ الله أَحَدٌ>> (Say: He is Allah, the One), and He made Himself known, saying: <<ولِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها وذَرُوا الَّذِينَ يُلْحِدُونَ في أَسْمائِهِ>> (And to Allah belong the Most Beautiful Names, so invoke Him by them, and leave those who deviate [يُلْحِدُونَ] concerning His Names). He means: they incline away from His Names. No, rather, He means: they incline *in* His Names toward a meaning other than that which was intended by them. <<سَيُجْزَوْنَ ما كانُوا يَعْمَلُونَ>> (They will be recompensed for what they used to do) of that. Thus, everyone is recompensed according to what he inclined toward in what We revealed. He says: <<اتَّبِعْ ما أُوحِيَ إِلَيْكَ من رَبِّكَ>> (Follow what has been revealed to you from your Lord), and do not incline with their inclination, for I created you as a follower (*muttabi‘*—active participle), not one who is followed (*muttaba‘*—passive participle). That is why, when mentioning the Prophets, He said to him: <<فَبِهُداهُمُ اقْتَدِهْ>> (So follow their guidance), not them personally. And their guidance is nothing other than the Law (Shar‘) of Allah. He said: <<شَرَعَ لَكُمْ من الدِّينِ ما وَصَّى به نُوحاً>> (He has ordained for you of religion what He enjoined upon Noah), and He mentioned those He mentioned. Thus, the Lawgiver (الشارع) for us is Allah, Who legislated for them. If he (Muhammad) had taken from them, he would have been a follower. Understand this.\n\nThe Poles (أقطاب) of this Community (الأمة) are twelve Poles, upon whom the axis (مدار) of this Community revolves, just as the axis of the corporeal and physical World (العالم الجسمي والجسماني) in this world and the Hereafter revolves upon twelve Zodiacal Signs (بروج). Allah has entrusted them with the manifestation of what occurs in both abodes of customary and non-customary creation (الكون) and corruption (الفساد).\n\nAs for the Solitaries (المفردون), they are numerous. The Two Seals (الختمان) are among them—meaning, among the Solitaries—and they are not Poles. There is no one among the Poles who is upon the heart of Muhammad, peace and blessings be upon him. However, among the Solitaries, there are those who are upon the heart of Muhammad, peace and blessings be upon him, and the Seal (الختم) is one of them—I mean the specific Seal of the Saints (خاتم الأولياء الخاص).\n\nAs for the Twelve Poles, they are upon the hearts of the Prophets, peace be upon them. One of them is upon the heart of a Prophet, or if you wish, you may say upon his spiritual station (قدم), which is more appropriate, for this is how I saw it in the Unveiling (الكشف) in Seville. This is greater in respect (الأدب) toward the Messengers, and respect is our station (مقامنا), which I choose for myself and for the servants of Allah.\n\nThus, we say that the first—meaning, one of them—is upon the spiritual station (قدم) of Noah, peace be upon him; the second upon the station of Abraham the Friend (الخليل), peace be upon him; the third upon the station of Moses, peace be upon him; the fourth upon the station of Jesus, peace be upon him; the fifth upon the station of David, peace be upon him; the sixth upon the station of Solomon, peace be upon him; the seventh upon the station of Job, peace be upon him; the eighth upon the station of Elias, peace be upon him; the ninth upon the station of Lot, peace be upon him; the tenth upon the station of Hud, peace be upon him; the eleventh upon the station of Salih, peace be upon him; and the twelfth upon the station of Shu‘ayb, peace be upon him.\n\nI saw all the Messengers and Prophets, all of them, by direct witnessing (مشاهدة عين). I spoke with Hud, the brother of ‘Ad, among them, but not the rest of the group. I also saw all the believers, by direct witnessing, those who have been and those who will be until the Day of Resurrection. The Real (الحق) manifested them to me on a single plain at two different times. I accompanied and benefited from a group of the Messengers, besides Muhammad, peace and blessings be upon him: among them, Abraham the Friend, to whom I recited the Quran; Jesus, at whose hands I repented; and Moses, who granted me the knowledge of Unveiling (الكشف) and Clarification (الإيضاح), and the knowledge of the alternation of night and day. When this knowledge was attained by me, the night vanished, and the day remained throughout the entire day. No sun set for me, nor did it rise. This Unveiling was a sign from Allah that I have no portion in wretchedness (الشقاء) in the Hereafter. I asked Hud, peace be upon him, about an issue, and he informed me of it, and it occurred in Existence (الوجود) exactly as he informed me. This is up to my time with these individuals. I associated with the Messengers Muhammad, peace and blessings be upon him, Abraham, Moses, Jesus, Hud, and David. The rest were seen, but not accompanied.\n\n### [That every Pole among these Poles has a Duration in the World]\n\nKnow that every Pole (قطب) among these Poles has a duration (لبث) in the World (العالم)—I mean, their mission (دعوة) among those to whom they are sent—with specific, designated lifespans (آجال) that come to an end, and then the mission is abrogated by another mission, just as Laws (الشرائع) are abrogated by Laws. By their mission, I mean the governance (الحكم) and influence (التأثير) they possess in the World. Let us mention the durations of their lives in this worldly existence.\n\nAmong them is one whose life in his spiritual governance (ولاية) was thirty-three years and four months. And among them is one whose duration was thirty years, three months, and twenty days. And among them is one whose duration lasted twenty-eight years, three months, and ten days. And among them is one whose duration lasted twenty-five years. And among them is one whose duration lasted twenty-two years, eleven months, and twenty days. And among them is one whose duration lasted nineteen years, five months, and ten days. And among them is one whose duration lasted sixteen years and eight months. And among them is one whose duration lasted thirteen years, ten months, and twenty days. And among them is one whose duration lasted eleven years, three months, and ten days. And among them is one whose duration lasted two years, nine months, and ten days. And among them is one whose duration lasted eight years and four months. And among them is one whose duration lasted five years, six months, and twenty days.\n\nTheir constant invocation (هجيرهم) is one, which is *Allah, Allah* (with the *ha* silent and the *hamza* realized). They have no constant invocation other than this. Apart from these Poles, there are many other types of Poles: the Poles of villages, regions, and provinces, and the Shaykhs of communities. I will mention in this chapter what is facilitated of them. I only mention this for the sake of the result of that invocation (الذكر) for whoever persists in it, according to the known state of invocation among <<الذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ>> (men and women who remember Allah much). If we did not intend this, there would be no benefit in my mentioning and specifying it in this book. Let us first mention what is facilitated concerning the states of these Poles, along with the oneness (أحدية) of their constant invocation. It is unified because the station of the Pole (مقام القطبية) is unified; thus, that is the constant invocation of the Pole-station, not the constant invocation of the individual person. Each one of them has a constant invocation at times other than this. And he (the Prophet), peace be upon him, said: \"The Hour will not be established until there remains no one on Earth who says: 'Allah, Allah.'\" He means that there will remain no Pole (قطب) upon whom the axis of the World revolves, nor a Solitary (مفرد) through whose spiritual aspiration (همة) Allah preserves the World, even if he is not a Pole. Thus, the Hour will only be established upon the worst of people.\n\n### [The First Pole is upon the Spiritual Station of Noah, peace be upon him]\n\nAs for one of the Poles, he is upon the spiritual station (قدم) of Noah, peace be upon him. His Surah from the Quran is Surah Ya Sin. Indeed, each Pole among these twelve has a Surah from the Quran. Others among the Poles we mentioned may have a Surah from the Quran, or a single verse from the Quran. Some may have more than one Surah, and some may possess the entire Quran, like Abu Yazid al-Bistami, who did not die until he had memorized the entire Quran.\n\nLet us mention the Surahs of the Quran specific to these twelve. This one Pole has Surah Ya Sin, and he is the most perfect of the Poles in governance (حكما). Allah combined for him the two forms, the manifest and the hidden. Thus, he is a Caliph (خليفة) in the manifest realm by the sword, and in the hidden realm by spiritual aspiration (الهمة). I will neither name him nor specify him, for I have been forbidden from doing so, and I know the reason why I was prevented from designating him by name. Among the group of these Poles, none other than this one has been granted the comprehensive qualities (جوامع) required by the station of the Pole (القطبية), just as Adam, peace be upon him, was granted all the Names, and Muhammad, peace and blessings be upon him, was granted the Comprehensive Words (جوامع الكلم). If there were a Pole upon the spiritual station of Muhammad, peace and blessings be upon him, it would be this Pole. However, there is no one upon the station of Muhammad, peace and blessings be upon him, except some of the Great Solitaries (الأفراد الأكابر). Their number is unknown, and they are hidden among creation, innocent, possessing knowledge of Allah. They are neither harmed nor known, lest they be harmed. Their station is Preservation (الحفظ) in what they know. No ambiguity (شبهة) enters their knowledge to confuse them regarding what they have known; rather, they are upon clear evidence from their Lord. This is the state of the Solitaries. Let us return to the mention of this Pole.\n\n### [Every Pole’s Stations correspond to the Number of Verses in his Surah]\n\nWe say that his Stations (منازل) with Allah correspond to the number of verses (آيات) in this Surah. Likewise, every Pole’s Stations correspond to the number of verses in his Surah. Their Surahs are known; I will mention them generally, and then I will mention them in detail, if Allah wills.\n\nThe first, as we said, has Surah Ya Sin; the second, Surah Al-Ikhlas; the third, Surah An-Nasr; the fourth, Surah Al-Kafirun; the fifth, Surah Az-Zalzalah; the sixth, Surah Al-Baqarah; the seventh, Surah Al-Mujadilah; the eighth, Surah Al ‘Imran; the ninth, Surah Al-Kahf (and he is the one whom the Dajjal will kill and who will meet Jesus, peace be upon him); the tenth, Surah Al-An‘am; the eleventh, Surah Ta Ha. This Pole is the Vicegerent (نائب) of the Real (الحق) the Exalted, just as Ali ibn Abi Talib was the deputy (نائب) of Muhammad, peace and blessings be upon him, in reciting Surah Bara’ah (At-Tawbah) to the people of Mecca. He had previously sent Abu Bakr with it, but then retracted that, saying: \"No one shall convey the Quran on my behalf except a man from my household.\" So he called Ali and commanded him to catch up with Abu Bakr. When he reached Mecca, Abu Bakr led the people in Hajj, and Ali conveyed Surah Bara’ah to the people and recited it to them as a deputyship (نيابة) on behalf of the Messenger of Allah, peace be upon him. This indicates to you the validity of the Caliphate of Abu Bakr al-Siddiq and the high station (منزلة) of Ali, may Allah be pleased with both of them. The twelfth has Surah Tabarak al-Mulk.\n\nThese are the Surahs of the Poles from the Quran, except that the possessor of Surah Al-Mujadilah (which begins: <<قَدْ سَمِعَ الله قَوْلَ الَّتِي تُجادِلُكَ في زَوْجِها وتَشْتَكِي إِلَى الله>> [Allah has heard the statement of she who argues with you concerning her husband and complains to Allah])—his actual Surah is Al-Waqi‘ah, and he has a special fondness for this Surah. Likewise, the one who has Surah Al-Ikhlas has no other. Their Stations are as we have mentioned, except that the Stations are according to the verses and what is mentioned and not mentioned within them. The gradation (التفاضل) in the verses is well-known in the manner it has come, and their merit returns to the reciter (التالي) in terms of how the verse is when recited and spoken, not in terms of it being the Word of Allah, for in that there is no gradation. Rather, the gradation occurs in what is spoken, not in His Speech itself. Know this.\n\nAs for the state of this Pole, he possesses influence (التأثير) in the World, both manifest and hidden. Allah strengthens this religion through him. He is manifested by the sword and protected from injustice (الجور), so he rules with justice (العدل), which is the ruling of the Real (الحق) in unforeseen matters (النوازل). It may happen that those who oppose his ruling among the followers of the schools of jurisprudence (المذاهب)—such as the Shafi‘is, Malikis, Hanafis, and Hanbalis, and those who adhere to the saying of an Imam that does not agree with his ruling—this Pole is a Caliph in the manifest realm. If he rules contrary to what the proofs of these Imams require, their followers declare his ruling erroneous, and they undoubtedly sin before Allah, <<وَهُمْ لا يَشْعُرُونَ>> (while they perceive not). For they are not permitted to declare a *mujtahid* (one who exercises independent legal reasoning) erroneous, because the one who is correct, according to them, is one, but not specifically designated. Whoever is in this state should not proceed to declare any scholar among the Muslims erroneous. This is similar to those who spoke against the commandership of Usama and his father Zayd ibn Haritha, until the Messenger of Allah, peace and blessings be upon him, said what he said concerning that. If they impugn one whom the Messenger of Allah, peace and blessings be upon him, appointed and commanded, and they prefer their own judgment over the judgment of the Messenger of Allah, peace and blessings be upon him, then what do you think of their attitude toward the Pole? How far removed is one fame from the other! We have succeeded, and <<يَخْسَرُ الْمُبْطِلُونَ>> (the falsifiers lose). By Allah, no one calls to Allah except he who calls upon clear insight (بصيرة), not he who calls upon conjecture and rules by it. It is inevitable that whoever is in this state has restricted the Community of Muhammad, peace and blessings be upon him, in what Allah had made spacious for them. Thus, Allah will restrict their affair in the Hereafter and intensify the demand and reckoning upon them on the Day of Resurrection, because they made it difficult for the servants of Allah by forbidding them from moving from one school of thought (مذهب) to another in a specific case, seeking to remove hardship. They believed that this was trifling with religion, yet they did not realize that by this very statement, they have departed from the religion. Rather, the Law (Shar‘) of Allah is more spacious, and His ruling is more comprehensive and beneficial. <<وَقِفُوهُمْ إِنَّهُمْ مَسْؤُلُونَ>> (And stop them; indeed, they are to be questioned). <<مَا لَكُمْ لا تَنَاصَرُونَ * بَلْ هُمُ الْيَوْمَ مُسْتَسْلِمُونَ>> (What is the matter with you that you do not help one another? Nay, but that Day they will be submissive). This is the state of these people on the Day of Resurrection, and <<وَلا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُونَ>> (they will not be permitted to offer excuses).\n\nThis Pole possesses the Station of Perfection (مقام الكمال), so no description restricts him. He is the Sage (حكيم) of the Time; he only manifests according to the ruling of the Time and what the state of the era requires. The Will (الإرادة) is governed by his ruling, which is not governed by the Will itself. Thus, he possesses mastery (السيادة), and in him are ten qualities:\n\nThe first is Forbearance (الحلم) coupled with power, because his action is through spiritual aspiration (الهمة). He never becomes angry for himself, but when the sacred limits of Allah are violated, nothing can withstand his wrath, for he is angry for the sake of Allah.\n\nThe second is Deliberation (الأناة) in matters where Allah praises deliberation, along with hastening toward good deeds. Thus, he hastens toward deliberation and knows its proper places.\n\nThe third is Moderation (الاقتصاد) in all things. He does not add anything beyond what the Time demands, for the Balance (الميزان) is in his hand. He weighs the Time and the State (الحال) with it, taking from his state for his time, and from his time for his state, thereby lowering and raising.\n\nThe fourth is Management/Providence (التدبير), which is the knowledge of wisdom (الحكمة). He knows the situations and meets them with the actions that those situations require. As Abu Dujana did when the Prophet, peace and blessings be upon him, gave him the sword with its due right in one of the battles, and he walked with pride (الخيلاء) between the ranks. The Messenger of Allah, peace and blessings be upon him, while looking at his vanity, said: \"This is a walk that Allah and His Messenger hate, except in this situation.\" For this reason, the walk of the Messenger of Allah, peace and blessings be upon him, contained speed, as if he were descending a slope. The possessor of Management (التدبير) looks into matters before they are manifested in the World of Witnessing (عالم الشهادة). He has disposal (التصرف) in the World of the Unseen (عالم الغيب). He takes nothing from the meanings except what wisdom (الحكمة) requires, for <<هُوَ الْحَكِيمُ الْخَبِيرُ>> (He is the All-Wise, the All-Aware). What ought to be manifested generally, he manifests generally; what ought to be manifested in detail, he manifests in detail; what ought to be manifested definitively (محكما), he manifests definitively; and what ought to be manifested ambiguously (متشابها), he manifests ambiguously.\n\nThe fifth quality is Detailed Elucidation (التفصيل), which is the knowledge of that by which things are distinguished from one another, even in what they share. Thus, every matter is separated from its like, its opposite, and its contrary. This applies to the Divine Names (الأسماء الإلهية) that are closely similar, such as the All-Knowing (العليم), the All-Aware (الخبير), the Reckoner (المحصي), the All-Encompassing (المحيط), and the All-Wise (الحكيم). All of them are Names of Knowledge (العلم) and are synonymous with the All-Knowing, except that between each one and the other there is a subtle point (دقيقة) and a reality (حقيقة) by which it is distinguished from the rest. This is the case with every Name that shares a meaning with another.\n\nThe sixth is Justice (العدل), which is a matter employed in governance, division, judgments, and delivering rights to their owners. In terms of rights, it is similar to what Allah mentioned about Himself: that He <<أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ>> (gave everything its creation), and His saying concerning Moses: <<قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ>> (Every group of people has known its drinking place), and His saying concerning the she-camel of Salih: <<لَها شِرْبٌ ولَكُمْ شِرْبُ يَوْمٍ مَعْلُومٍ>> (She has a share of the water, and you have a share of the water on a known day). Related to this is the knowledge of recompense (الجزاء) in the two abodes, and justice between the crime, the prescribed penalty (الحد), and discretionary punishment (التعزير).\n\nThe seventh is Propriety/Spiritual Courtesy (الأدب), which is the knowledge of all comprehensive good deeds (جوامع الخيرات) in every world. It is the knowledge that brings him into the Divine Presence (البساط) and grants him companionship, Witnessing (الشهود), conversation, intimate discourse, narration, retreat (الخلوة), and interaction with what is in the Essence (نفس) of the Real (الحق) in the stations of manifestation (الجلوة). This and its like constitute Propriety.\n\nThe eighth is Mercy (الرحمة). Its object is every weak person and every tyrant (جبار). He brings the tyrant down from his might (جبروت), pride (كبرياء), and grandeur (عظمة) with the slightest effort, through gentleness, compassion, and inner resolve.\n\nThe ninth is Modesty/Shame (الحياء). He feels shame on behalf of the liar concerning the lie. He appears to the liar in the form of one who believes his statement, not in the form of one who ignores him, until the liar believes that his story has been accepted and that the Pole is ignorant of his station and what he has brought. The liar is then humbled in his occupation. Yet, in the sight of his Lord, the Pole is nothing but an intermediary of good, praying for the liar's forgiveness concerning what is between him and Allah when they stand and are questioned on the Day of Resurrection. It has been reported in the Hadith that on the Day of Resurrection, Allah will call an old man and say to him: \"What did you do?\" He will mention what Allah willed of good deeds, and Allah knows that he is lying in his statement. Then He will command him to be taken to Paradise. The angels will say: \"O Lord, he lied in what he claimed.\" The Real (الحق) will say: \"I knew that, but I felt shame (استحييت) before him to belie his old age.\" The Messenger of Allah, peace and blessings be upon him, conveyed this report from Allah to us only so that we might possess this quality, for we are more deserving of it due to our need for the Real (الحق) to treat us with it.\n\nThe tenth is Reconciliation (الإصلاح), the greatest of which is reconciling disputes (إصلاح ذات البين), which is His saying, the Exalted: <<وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ>> (And reconcile matters between you). It has been reported in the Hadith that Allah will reconcile His servants on the Day of Resurrection. The oppressor and the oppressed will be made to stand before Him for judgment and fairness. Then He will say to them: \"Raise your heads.\" They will look at an abundance of good, and they will say: \"For whom is this good?\" Allah will say to them: \"For the one who gives Me the price.\" The oppressed one will say: \"O Lord, who can afford the price of this?\" Allah will say to him: \"You, by your forgiveness of this brother of yours.\" The oppressed one will say: \"O Lord, I have forgiven him.\" Allah will say to him: \"Take your brother by the hand and enter Paradise.\" Then the Messenger of Allah, peace and blessings be upon him, recited: <<فَاتَّقُوا اللهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ>> (So fear Allah and reconcile matters between you), for Allah will reconcile His servants on the Day of Resurrection.\n\n### [The Second Pole is upon the Spiritual Station of Abraham the Friend, peace be upon him]\n\nAs for the second Pole among the twelve, he is upon the spiritual station (قدم) of Abraham the Friend (الخليل), peace be upon him. He is the one whose Surah is Al-Ikhlas, the love of which admitted him to Paradise, and the reciter of which receives the reward of one-third of the Quran. He has Stations (منازل) corresponding to the number of its verses. He is the master of Proof (الحجة) and Speculative Evidence (الدليل النظري). He delves into intellectual matters (المعقولات) and is correct, never erring.\n\nThis is because people have differed concerning Gifted Knowledge (العلم الموهوب) which, by its nature, the rational person can grasp through thought and to which speculative evidence leads. Some said that such knowledge, when Allah grants it to someone, He grants it along with its evidence, so that both the evidence (الدليل) and the proven point (المدلول) are known—this is necessary. I saw Abu Abdullah al-Kattani in the city of Fez, an Imam among the Muslim leaders in the fundamentals of religion and jurisprudence, holding this view. I said to him: \"This is your direct experience (ذوقك); the Real (الحق) granted it to you this way. Your experience is sound, but your ruling is unsound.\" Rather, Allah may grant him the knowledge that is only attained through speculative evidence, but not grant him the evidence itself. Or He may grant him both the knowledge and its evidence, like Abraham the Friend. The Exalted said: <<وَتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ>> (And that was Our proof which We gave to Abraham against his people). This is more perfect than the one who is given the knowledge that is reached by evidence but is not given the evidence. No one stipulates the specification of one piece of evidence over another; rather, evidence is given generally. Indeed, the evidences for a single thing may be numerous. Some are extremely clear, and some are obscure, such as the case of Abraham the Friend concerning the revival of the dead and the causing of the living to die, and his turning to the challenge that his opponent bring the sun from the West instead of the East. Both are evidence for the intended point.\n\nThis Pole is one of those who call to Allah by Divine Command. His dwelling is in the air, in the expanse of the atmosphere, in a house where he sits upon a throne, observing creation. A group of the People of Allah (أهل الله) and His elect are constantly reciting with him. His discourse is concerning the Divine Oneness (الأحدية الإلهية), the Oneness of the One (أحدية الواحد), and the Oneness of Unity (أحدية الوحدانية), using speculative evidences. He did not acquire them through speculation, but the Real (الحق) the Exalted gifted them to him this way. His state is perpetual Presence (الحضور), yet he was not bewildered (حار) like others were. Rather, Allah clarified for him what he stopped at, and did not occupy his mind with what would cause him bewilderment (الحيرة). He has devoted himself with Allah to fulfilling the needs of people. He knows the Divine Names (الأسماء الإلهية) with perfect knowledge. He affirms the negation of similitude (المثلية) in the aspect of the Real (الحق).\n\nThe Real (الحق) informed me, through the customary way He informs His servants in their secrets, that this servant (the Pole) was granted mercy for His servants and connection to his kin. He asked Allah for something, but Allah did not grant it to him, which was that he asked for his station (مقام) to be inherited by his descendants. Allah said to him: \"That is not up to you. The station of the Caliphate (الخلافة) is not by inheritance; that is for knowledge and wealth. As for the Caliphate, every Caliph among a people is according to their time, for the people of their time resemble them more than they resemble their fathers.\" Indeed, the Real (الحق) does not judge a creation except in knowledge and character.\n\nNo one knows that he possesses this rank (المرتبة) except one whom Allah informs of it. I have seen someone whom Allah opened up through my companionship, and he benefited from spiritual states (أحوال) and knowledge, and experienced the breaking of customary laws (خرق عوائد). Allah granted him that due to his excellent interaction with Allah. He informed me that he benefited nothing of what he possesses except from me, yet I have no knowledge of that. I only call to Allah, and Allah knows who responds. <<يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ قالُوا لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ>> (The Day when Allah will assemble the Messengers and say: \"What was the response you received?\" They will say: \"We have no knowledge; indeed, You are the Knower of the unseen\"). And they spoke the truth. This is the case: no one has knowledge except whom Allah teaches. Anything other than this Divine method of teaching is merely preponderance of opinion (غلبة ظن), accidental knowledge (مصادفة علم), or certainty based on illusion (وهم). As for true knowledge, no. For all paths leading to knowledge contain ambiguities (شبه) that prevent the pure soul, which Allah has made aware of these ambiguities, from being certain of attaining knowledge through them, except by the Divine method, which is His saying, the Exalted: <<إِنْ تَتَّقُوا اللهَ يَجْعَلْ لَكُمْ فُرْقاناً>> (If you fear Allah, He will grant you a criterion [Furqan]), and His saying: <<خَلَقَ الْإِنْسانَ * عَلَّمَهُ الْبَيانَ>> (He created man, taught him clear expression). Thus, he expresses what is within himself. This Pole possesses wondrous secrets.\n\n### [The Third Pole is upon the Spiritual Station of Moses, peace be upon him]\n\nAs for the third Pole, he is upon the spiritual station (قدم) of Moses, peace be upon him. His Surah is An-Nasr (<<إِذا جاءَ نَصْرُ الله والْفَتْحُ>>), and his Stations (منازل) correspond to the number of its verses, and it is equivalent to a quarter of the Quran. This Pole was one of the Pegs (الأوتاد) and was then transferred to the station of the Pole (القطبية), just as the second Pole was one of the Imams and was then transferred to the station of the Pole. He is a master of striving (جهد) and endurance (مكابدة), never ceasing to be occupied with creation in the presence of Allah. In the Station of the Call (منزل النداء), Allah granted him twelve thousand sciences by direct experience (ذوقا) in a single night. The Station of the Call is one of the greatest Stations, and we have specified it in the Chapter on Stations in this book, and we have a separate section on it, meaning on the levels and quantities of the Stations.\n\nAmong the sciences of this Pole is the knowledge of Neediness toward Allah, by Allah (علم الافتقار إلى الله بالله). It is a noble science, and I have not seen anyone who has tasted it as I have tasted it. The meaning and secret of this is that Allah informed him that the need of the Names (الأسماء) to influence the Fixed Entities (الأعيان الثابتة) of the contingent things (الممكنات) is greater than the need of the contingent things for the effect to appear in them. This is because the Names possess sovereignty (السلطان) and might (العزة) in the manifestation of their effects, whereas the contingent things may receive an effect by which they are harmed, or by which they benefit, and they are in danger. Their remaining in the state of non-existence (العدم) would be more beloved to them if they were given a choice. For in the witnessing of their immutable state (مشاهدة ثبوتية حالية), they are enjoying an immutable pleasure (التذاذ ثبوتي), with every state isolated from the other. A single entity (عين واحدة) does not combine states in the state of immutability (الثبوت). Rather, they appear in the thingness of Existence (شيئية الوجود) in a single entity. For example, Zayd, who is healthy at one time, is the very same entity who is sick at another time, and the one who is cured at one time is the very same entity who is afflicted at that time. In the state of immutability (الثبوت), it is not like this. For pain in immutability is not in the entity of the one who suffers; rather, it is in its own essence (عينه). Thus, it enjoys its immutability just as it enjoys its existence in the sufferer, while the locus (المحل) suffers by it.\n\nThe reason for this is that immutability (الثبوت) is simple and singular; nothing subsists in anything else. In Existence (الوجود), there is only composition (التركيب): a carrier (حامل) and a carried (محمول). The carried always has the same station in Existence as its station in immutability, in perpetual bliss. The carrier is not like that. If the carried thing necessitates pleasure, the carrier enjoys it; but if it necessitates pain, the carrier suffers. This was not the case for the carrier in the state of immutability. Rather, the carrying entity (العين الحاملة) in its immutability manifests in what it will be in its existence, infinitely. Every state it assumes is beside it, looking at it, not carried within it. Thus, the entity (العين) enjoys its Essence (ذاتها), and the state (الحال) enjoys its Essence. The state of the states does not change its direct experience (ذوقه) through Existence, but the state of the carrier changes through Existence. This is a precious science.\n\nThe Fixed Entities (الأعيان) only know this in immutability by the state looking at them, but they do not know that when they carry it, they will suffer by it, because they are in a Presence (حضرة) where they do not know the taste of pains; rather, they take it as a companion. If the entity knew that it would suffer by that state when characterized by it, it would suffer in its state of immutability merely by the state looking at it, due to its knowledge that it will be clothed in it and carry it in its state of existence. Thus, its familiarity with it in immutability is a bliss for it. This type of knowledge is one of the greatest secrets of Allah’s Knowledge concerning things. I witnessed it through Divine direct experience (ذوقا إلهيا), because among the servants of Allah are those whom Allah informs through Unveiling (كشفا) about the Fixed Entities (الأعيان الثبوتية). They see them in the form we mentioned: of juxtaposition and observation, seeing neither a state (حالا) nor a locus (محلا) in them.\n\n> Rather, every essence (ذات) is in isolation,\n> Without admixture or union (اتحاد),\n> Nor indwelling (حلول) nor transference,\n> Nor agreement nor opposition.\n\nIf you understand the difference between Existence (الوجود) and Immutability (الثبوت), and the rulings that the Fixed Entities (الأعيان) possess in Existence and those they possess in Immutability, you will know that some Fixed Entities do not desire the manifestation of the effect in them through the state, for they have no taste (ذوق) for it. If the taste of pain were presented to them in the state of immutability, they would cry out. For their affair in the state of Existence, when they carry pain, is that they may endure patience or they may not. If we assume them in the state of immutability to be carriers lacking patience, then by the tongue of the state (لسان الحال), they do not possess that neediness (الافتقار) to seek Existence, even if they seek it through the immutable utterance (القول الثبوتي) from Allah. When they come into existence, they say what has been reported from some of them: \"Would that I had not been created,\" or \"Would that ‘Umar’s mother had not given birth to him,\" or \"Would that she had been barren,\" and the like. Thus, the Fixed Entities are less needy than the Names, and the Names are more intensely needy due to the bliss (النعيم) they find in that. Especially since the Names witness the Essential Joy (الابتهاج الذاتي) of the Real (الحق) in Perfection, in terms of the contingent things accompanying His Essence (ذاته) in their immutability, and that He is transcendent above their effect and being affected by them. Thus, in terms of His Essence, He is in perfection, transcendent above being affected, both in the state of the immutability of the Fixed Entities and the state of their existence. This is because He did not increase in knowledge concerning what they were not upon in themselves, for they granted Him knowledge of their affair eternally, and they come into existence in that very form. Juxtaposition (المجاورة) in immutability is indwelling (حلول) in Existence. In immutability, it is beside the entity; in Existence, it is a state within it. This is one science among those sciences. Know this.\n\n### [The Fourth Pole is upon the Spiritual Station of Jesus, peace be upon him]\n\nAs for the fourth Pole, who is upon the spiritual station (قدم) of Jesus, peace be upon him, his Surah from the Quran is Al-Kafirun (<<قُلْ يا أَيُّهَا الْكافِرُونَ>>), and it is equivalent to a quarter of the Quran. His Stations (منازل) correspond to the number of its verses. This Pole is one of the Treasured, Protected Ones (الضنائن المصانين). He possesses Perpetual Theophany (التجلي الدائم). His discourse is concerning Gathering/Synthesis (الجمع) and Existence (الوجود), and the Science of Increase (علم المزيد). If he sees an ambiguity (شبهة) in someone that stands between him and knowledge, he removes it until the image of the Real (الحق) in that matter becomes clear to its possessor. He has six hundred keys to stations (مفتاح مقام), and in every station, there is knowledge as Allah wills. He possesses the knowledge of Balanced Mixture and Composition (علم الامتزاج والتركيب الاعتدالي). He knows neither deviation, deficiency, nor excess. His dwelling is in the Dome of Arin, cut off from creation except for whom Allah wills. He lived a good life with Allah until Allah took his soul. He was also one of the Pegs (الأوتاد) and was then transferred to the station of the Pole (القطبية).\n\nHe says that Existence (الوجود) is the Existence of the Real (الحق), and that Gathering (الجمع) is the Gathering of the Real: the Attributes of Eternity (صفات القدم) and Contingency (الحدوث). This is a strange science concerning Gathering. I have not seen anyone among the People of Allah (أهل الله) who holds this view other than this Pole, for I witnessed these Poles—the Real (الحق) made me witness them, even though they had passed away from the world. It is the knowledge with which the Laws (الشرائع) came concerning the aspect of the Real (الحق). Thus, we say that is the Gathering. According to him, the contingent thing (المحدث) makes a claim regarding those attributes called contingent. Because of his claim, we say it is a Gathering. Otherwise, the matter is one: all are Attributes of Eternity (صفات قدم) in the Eternal, and contingent in the contingent thing, due to their manifestation in it, having not been manifest before. Thus, they became contingent in the one characterized by them. As He said: <<مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ>> (No fresh reminder comes to them from their Lord), yet it is nothing but the Eternal Word of Allah. So, we gathered upon it what belongs to Him, along with its attribution to us. Thus, the one who does this is called the possessor of Gathering (جمع) and Existence (وجود). The ruling of the contingent things is governed by the Existence of the Real (الحق) and nothing else. Whoever understands Gathering (الجمع) in this way knows how matters truly are.\n\n> Whoever knows Gathering in this way,\n> Knows how the matter truly is.\n> He is the Real (الحق), none other than Him,\n> So do not listen to anything else.\n\n### [The Fifth Pole is upon the Spiritual Station of David, peace be upon him]\n\nAs for the fifth Pole, who is upon the spiritual station (قدم) of David, peace be upon him, his Surah from the Quran is Az-Zalzalah (<<إِذا زُلْزِلَتِ>>), and it is equivalent to half of the Quran. His Stations (منازل) correspond to the number of its verses. His state (حال) is Separation/Discrimination (التفرقة), and he possesses the Station of Love (مقام المحبة). He is caused by love (معلول للحب); his ailment is his cure. He has no knowledge in which he surpasses others except the knowledge of the immutability (ثبوت) of Divine and cosmic Love (المحبة الإلهية والكونية). For this reason, he was in the Station of Separation (مقام التفرقة). He was one of the Imams and was then transferred to the station of the Pole (القطبية).\n\nThis Pole says that love is what is immutable (ثبت). Any love that vanishes is not love, or if it changes, it is not love, because the sovereignty of love is too great for anything to remove it. Even heedlessness (الغفلة), which is the greatest sovereignty that governs man, cannot remove love from the lover. It is possible, according to him, for a person to be heedless of himself due to his beloved, but it is not possible for the lover to be heedless of his beloved due to anyone else. That is the true lover, and that is true love.\n\n> The ailment of love is that which does not vanish,\n> And its cure is impossible.\n> So do not rely on anything other than this,\n> And do not listen to what others say.\n\nIt is by the love of Allah that we love Allah, and the love of the Real (الحق) does not change. Thus, the love of the Cosmos (الكون) does not change. He was asked: \"Does the love of the cosmos for the cosmos change?\" He said: \"No, because the cosmos is beloved for its Essence (ذاته), and Essential Love (المحبة الذاتية) cannot vanish.\" He was asked: \"But we have seen those whose affection (مودة) changes.\" He replied: \"That is Will (إرادة), not Love (محبة). If it were love, it would be immutable. Do you not see that it is called *wudd* (affection) due to its immutability and the immutability of its ruling?\" This is because there is no surplus of the lover's Essence (ذاته) for anything other than his beloved, through which the remover could enter upon him. This is the reason for its immutability. For he witnesses the very essence (عين) of his beloved in everything he witnesses, so he never loses him. If it were possible for the lover to witness something other than his beloved in any entity, something would enter upon him that would remove his love. But this does not occur in true love. Thus, the ruling of Will (الإرادة) was confused with the ruling of Love for the one whose state is this. Not every willful person (*murid*) is a lover (*muhibb*), but every lover is willful. Not every willed thing (*murad*) is beloved (*mahbub*), but every beloved thing is willed. The station of this Pole is what we have mentioned. His affair is wondrous, and detailing his state would be lengthy, and our method is brevity.\n\n### [The Sixth Pole is upon the Spiritual Station of Solomon, peace be upon him]\n\nAs for the sixth Pole, who is upon the spiritual station (قدم) of Solomon, peace be upon him, his Surah is Al-Waqi‘ah (The Event), and it possesses Perpetual Life (الحياة الدائمة). His Stations (منازل) correspond to the number of its verses. He is specialized in the Science of Life and Living Beings (علم الحياة والحيوان). He takes none of his states (أحوال) except from his Lord, so his states are the states of his Lord. His guidance is the guidance of the Prophets, just as Allah commanded His Prophet, peace and blessings be upon him, when He mentioned the Prophets, peace be upon them, saying: <<أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ>> (Those are the ones whom Allah has guided, so follow their guidance). He did not say, \"Follow them.\" Thus, we know that Muhammad is equal to all the Prophets He mentioned and those He did not mention. For every Prophet has guidance, as He mentioned: <<لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً>> (For each of you We have appointed a law [shir‘ah] and a way [minhaj]). He, the Glorified, established the Laws and clarified the ways, and gathered all of that in Muhammad, peace and blessings be upon him. So, whoever sees him has seen all the Near Ones (المقربين), and whoever is guided by his guidance is guided by the guidance of all the Prophets.\n\n> It is not strange for Allah\n> To gather the World (العالم) in a single one.\n\nBy my saying that the states of this Pole are the states of his Lord, I mean what the Real (الحق) said about Himself: that He is <<كُلَّ يَوْمٍ فِي شَأْنٍ>> (every day in [a new] affair/concern). This expresses the variation of states. He is among the people who witness the Real (الحق) in His Affairs (شئونه). They look at the Affairs He has in them and are clothed in them by Him. Thus, they are upon clear insight (بصيرة) concerning their states. Whoever is in this state is not like the one whose state is assuming the character of the Divine Names (التخلق بالأسماء الإلهية). Rather, this one has a direct experience (ذوق), and that one has a direct experience. Such a man is unknown in his state, because the stations of the Real (الحق) are hidden; only those whose station is being clothed in the Affairs (الشئون) can grasp them.\n\nThe proof of this is that we have agreed upon the principle that there is no originator (موجد) but Allah, and that He is All-Wise (حكيم), placing matters in their proper places and not exceeding their station. Thus, everything that appears in the World (العالم) is wisdom in its place. We have also agreed that all creation, and most of the People of Allah (أهل الله), say: \"If such-and-such an act, which appeared in Existence (الوجود) at the hands of a person, had been done differently, it would have been better and more appropriate than this act you performed.\" They say this to the one through whom and at whose hands that Divine Act (الفعل الإلهي) manifests. Is this not due to their ignorance of Allah's wisdom concerning the occurrence that prompted such a statement from them? This only occurs from the People of Allah due to their heedlessness (غفلتهم) of Allah, not their ignorance. When they are reminded, they remember. It occurs from those who are not the People of Allah due to their ignorance, not their heedlessness, for they do not abandon the baseness they attributed to that act until Allah's wisdom in it becomes apparent to them. When it becomes apparent, they then confess their ignorance and recognize the deficiency of their knowledge and intellect.\n\nI have not seen anyone who possesses this direct experience (الذوق), nor have I heard that he was seen, even though he is near and extremely manifest. However, personal motives (الأغراض) and desires (الأهواء) prevent the effort to attain him. The argument of those among the people of religion who do not seek to attain him is that the Law (Shar‘) has commanded us to reject certain things and to say that it would have been better to abandon this act, even while knowing that the act belongs to Allah. We say: \"You spoke the truth, but such an objection did not come from a person who understood my rank.\" This is because I said that he was ignorant of Allah's wisdom in the matter he objected to. Whoever objects with the objection of the Law is merely conveying Allah's objection in what he objected to; he is not the true objector. When that objection originates from Allah, the possessor of this direct experience (الذوق) knows its wisdom and station. The possessor of this state commands the right, forbids the wrong, and establishes the prescribed penalties (الحدود), while witnessing the wisdom of all of that and seeing it in the Divine Affairs (الشئون الإلهية) witnessed by him. He only witnesses them specifically at the moment of their creation (تكوينها). This is the station of the possessor of this state.\n\nIndeed, among the People of Allah are also those who witness these Affairs before the Real (الحق) creates them. This is the one who witnesses the Fixed Entities (أعيان الممكنات) of the contingent things in their state of non-existence (عدمها), just as the Real witnesses them. For this reason, the Real designates for creation (التكوين) what He designates from among them, excluding other contingent things, for the Real only brings them into existence exactly as they are in their state of non-existence, without addition or subtraction. Among the People of Allah are those who witness the matter before its manifestation in the senses—this is the other creation (التكوين الآخر). He witnesses it in the Clear Register (الإمام المبين), which is the Preserved Tablet (اللوح المحفوظ) containing erasure and affirmation. Everything contained therein has a first creation in the inscription. This Unveiling (الكشف) is inferior to the Unveiling of the one whom Allah shows the Fixed Entities of the contingent things exactly as they will be in the state of Existence, so he rules concerning them with Allah's ruling. There are many levels of perception for grasping these Affairs before their manifestation in the senses. The highest of them is what we mentioned—meaning, the furthest reach—and after that is the witnessing of the Real (الحق) in their creation (تكوينها), for that is higher than the witnessing of the observer in the Clear Register or elsewhere. Inferior to this Witnessing (الشهود) is every witnessing that occurs for the servant before the creation of the Affair. This is the state of the one who said: \"I have not seen a thing except that I saw Allah with it.\" This state is higher than that of the one who says: \"I have not seen a thing except that I saw Allah before it.\" For the first statement is a word of realization (تحقيق), and although the second is similar in realization, there is a difference between them. The statement of the first is like one who says: \"I saw Zayd doing such-and-such,\" while the other says: \"I saw the Maker doing such-and-such.\" This is the difference between the two individuals in what they witness. For proper nouns (الأسماء الأعلام) were only established for communication when the named entity is absent. In the presence, they are not required, and if they are used, it is either for a propriety (أدب) required by the state or for emphasis in reporting. I have clarified for you the state of this Pole as you have heard. He has many states that I know, but I will not mention all the states of every Pole, because that would expand the scope so much that time would not suffice.\n\n### [The Seventh Pole is upon the Spiritual Station of Job, peace be upon him]\n\nAs for the seventh Pole, who is upon the spiritual station (قدم) of Job, peace be upon him, his Surah is Al-Baqarah (The Cow), which is the White Surah containing the Mistress of the Verses of the Quran (سيدة آي القرآن). His Stations (منازل) correspond to the number of its letters, not its verses. The state (حال) of this Pole is Grandeur (العظمة), such that he sees that the World (العالم) cannot contain him, because his direct experience (ذوقه) is that the Real (الحق) contained his heart. It has been reported in the Hadith that the Real (الحق) says: \"My earth and My heaven did not contain Me, but the heart of My believing servant contained Me.\" Not every heart contains the Real. He said: <<وَلَكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ>> (But the hearts which are in the breasts are blinded). Thus, He clarified the location of the hearts. If it is witnessed by a servant that the Real is in his heart, then just as the World cannot contain the Real, the World also cannot contain this servant. This is the reason for his witnessing the narrowness of the World around him.\n\nI have not seen anyone who has realized this station and witnessed it except a man in Mosul, from the people of Haditha al-Mosul, who was of this rank. The Real (الحق) informed him of a matter but did not inform him of its secret. He was seeking someone to clarify his state for him. Imam Najm al-Din Muhammad ibn Abi Bakr ibn Shay al-Mawsili, the teacher at the Madrasa of Sayf al-Din ibn ‘Alam al-Din in Aleppo, mentioned me to him in this time we are in, which is the year 628 AH. He requested a meeting with us. When he arrived, we mentioned his slip, and I clarified it for him. He was relieved and rejoiced, and he revealed his state to me when he saw that I understood him. I found that he had taken a substantial share of the Station of Grandeur (مقام العظمة), but it was inferior to the direct experience (ذوق) of this Pole in it, because he informed me that phlegm would circulate in his mouth, and he could not spit it out because he could not find a place for it to fall that was empty of the Real (الحق). He knew what came in the Law (Shar‘) concerning the propriety of spitting, so he was bewildered. I saw another like him in Seville, in the lands of al-Andalus. We have narrated concerning Al-Hallaj that he tasted this station until the state of the station manifested upon him. He had a house called the House of Grandeur (بيت العظمة). When he entered it, he would fill the entire space with his essence (ذاته) in the eye of the observer, to the extent that he was attributed to the science of alchemy (السيمياء) due to their ignorance of the states (الأحوال) that the People of Allah (أهل الله) possess.\n\nThe one who is firmly established in this station does not manifest a state that indicates he possesses this direct experience (الذوق). Rather, his descriptions proceed according to the ruling of this station, not his state. For the state (الحال) yields the breaking of customary laws (خرق العوائد), as the author of *Mahasin al-Majalis* said when mentioning that the states are for the seekers (*muridin*): \"And the states are for miracles (*karamat*),\" meaning the breaking of customary laws. Miracles, in the usage of this tongue, are not the breaking of customary laws unless accompanied by uprightness (الاستقامة) in the state, or unless they immediately result in uprightness. This is necessary according to them. The reason for this restriction is that the breaking of a customary law may not be a miracle from Allah to the servant. The most perfect among them in the Station of Grandeur (مقام العظمة) is the one whose state is unknown and who is not recognized, so that what he interacts with is known, and the observer is protected from error concerning him. However, he is upon clear evidence from his Lord and insight into his affair. Whoever wishes to know the states of this Imam should contemplate the verses of Surah Al-Baqarah, verse by verse, until its conclusion. This Pole is the totality of its verses. And success is with Allah.\n\n### [The Eighth Pole is upon the Spiritual Station of Elias, peace be upon him]\n\nAs for the eighth Pole, who is upon the spiritual station (قدم) of Elias, peace be upon him, his Surah is Al ‘Imran, which is also the White Surah. His Stations (منازل) correspond to the number of its verses. I do not mean by my saying \"the first Pole\" and \"the second Pole\" that this is a chronological arrangement. Rather, I intend an arrangement by number until the twelve Poles are complete. The twelfth or another may be the first chronologically. I only made this known so that whoever Allah has informed and granted knowledge of the times of these Poles does not imagine that this arrangement we have presented is the arrangement of their times. Therefore, I clarified that it is merely an arrangement by number.\n\nThe state (حال) of this Pole is the knowledge of the Ambiguous (المتشابه) in the Word of Allah, <<مَا يَعْلَمُ تَأْوِيلَهُ إِلَّا الله>> (whose interpretation [تأويله] none knows except Allah). This Pole knows it specifically through Allah's informing him. It is never known except by Allah's informing. Thus, it becomes definitive (محكما) for him in its ambiguity. He knows from which aspect the ambiguity arose in it. He attains the knowledge of the Correspondence (المناسبة) that unites Allah and the one with whom the similitude (التشابه) occurred in the verse, such as all the verses of similitude, or the patching up of similitude through the indication of the Homonym (اللفظ المشترك), which only occurs due to a hidden correspondence. The correspondence in similitude is manifest, but in homonymy (اشتراك) it is hidden. For example, the correspondence of light (النور) to knowledge (العلم) is manifest, so knowledge is called light, and light is called light, as in His saying: <<وَجَعَلْنَا لَهُ نُورًا>> (And We made for him a light), and <<وَجَعَلْنَاهُ>>—meaning the Revelation, which is knowledge—<<نُورًا نَهْدِي بِهِ مَنْ نَشَاءُ مِنْ عِبَادِنَا>> (a light by which We guide whom We will of Our servants). In homonymy, such as the word *al-‘ayn* (eye/essence/spring), the correspondence in the essentiality (*‘ayniyyah*) of everything named *al-‘ayn* is hidden. But for this Pole, it is manifest through Allah's informing him. As for those who engage in interpretation (التأويل) through speculation concerning this, they are not upon knowledge, even if they happen upon knowledge.\n\nFrom this science, you learn that women are the counterparts (شقائق) of men. Do you not see that Eve (حواء) was created from Adam? Thus, she has two rulings: the ruling of masculinity by origin, and the ruling of femininity by accident. Therefore, she is among the Ambiguous (المتشابه). For humanity (الإنسانية) is the gathering place of the male and the female. Where is the reality of the active agent (*fa‘il*) from the passive recipient (*munfa‘il*) for the one who is an active agent in it, and only acts in what resembles him? This is because the first thing he originated was passivity (الانفعال) within himself, and the form of what is passive to him appeared in him. By that power, what was passive to him became passive and manifested, like the Originator (البديع) and the Inventor (المخترع). As for the Real (الحق), we have previously established the realization of knowledge concerning the knower: that knowledge follows the known thing (المعلوم), and knowledge is an attribute of the knower. The one who grants knowledge is not the known thing upon which the knowledge rests. Then He grants the knower the bringing into existence of the known thing, just as He grants the inventor the bringing into existence of the invented thing and its manifestation in Existence (الوجود).\n\nFrom this, one knows why Allah made women beloved to Muhammad, peace and blessings be upon him. Whoever loves women because the Prophet, peace and blessings be upon him, loved them, has loved Allah. The unifying factor (الجامع) is passivity (الانفعال), because when the known thing granted knowledge so that the knower could be called a knower, the knower was the first to be passive to the known thing. The passivity of Jesus to Mary appeared, in contrast to Eve's origin from Adam. <<إِنَّ فِي ذَلِكَ لَذِكْرَى لِمَنْ كَانَ لَهُ قَلْبٌ>> (Indeed, in that is a reminder for whoever has a heart). Thus, he understands the saying of Allah, the Mighty and Majestic: <<يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُمْ مِنْ ذَكَرٍ>> (O mankind, indeed We have created you from a male)—like Eve—<<وَأُنْثَى>> (and a female)—like Jesus—and by the combination, like the rest of the progeny of Adam. Thus, she (the female principle) is the comprehensive factor in the creation of mankind.\n\nI was among the most averse of Allah's creation to women and to sexual intercourse at the beginning of my entry into this Path, and I remained so for about eighteen years, until I witnessed this station. I had previously feared Allah's displeasure because of this, when I came across the Prophetic report that Allah made women beloved to His Prophet, peace be upon him. He did not love them by nature, but he loved them because Allah made them beloved to him. When I was sincere with Allah in turning to Him, the Exalted, concerning this—out of fear of Allah's displeasure, since I disliked what Allah had made beloved to His Prophet—He removed that from me, praise be to Allah, and made them beloved to me. Indeed, I am the most compassionate of creation toward them and the most observant of their rights, because I am upon clear insight (بصيرة) in this, and it stems from a Divine making-beloved, not from natural love.\n\nNo one knows the true worth of women except he who knows and understands from Allah what He said concerning the two wives of the Messenger of Allah, peace and blessings be upon him, when they cooperated against him and opposed him, as Allah mentioned in Surah At-Tahrim. In opposition to these two women cooperating against him, He appointed those who would cooperate with the Messenger of Allah, peace and blessings be upon him, against them and support him: namely, Allah, Gabriel, the righteous believers (صالحو المؤمنين), and then the angels after that. This is only due to the difference in the cause for which the cooperation occurs. There was an affair that could not be removed except by Allah, not by a creature. For this reason, we were commanded to seek help from Allah in some things, from patience in others, and from prayer in others. Know this. There was an affair, and although it was in Allah's hand, Allah had granted Gabriel the power to repel that affair, so he assisted Muhammad, peace and blessings be upon him, in repelling it, whether they (the wives) cooperated against him or whether they retracted and gave the Real (الحق) His due from their souls—He would remain silent about them, just as we remain silent. The affair belonged to them (the wives) before and after, and this is a Divine description. For by their movement, whoever moved, moved; and by their stillness, whoever intended to move, became still. Likewise, the righteous believers (صالحو المؤمنين): there was an affair concerning them whose removal was closer in relation to the righteous believers than to others. Thus, the righteous believers were helpers to Muhammad, peace and blessings be upon him, and then the angels after that, when nothing remained except what was appropriate for the general body of angels, who were created subservient. By them, what could not be repelled in the Divine arrangement except by angels was repelled, despite the Real (الحق) being alone in the entire affair and maintaining it. However, due to rational possibility, the Real informed of the reality of how it would occur if it did occur. Nothing occurs except as He said, and He said nothing except what He knew would occur in this form. And He knew nothing except what the known thing granted Him from itself concerning what it is upon, through what He witnessed eternally in its Fixed Entity (عينه الثابتة) in its state of non-existence. So look, O friend (ولي), how matters reveal their realities to one who possesses understanding and a heart. May Allah make us and you among the people of understanding from Allah, among those who <<لَهُ قَلْبٌ>> (have a heart) by which they reason from Allah, and who <<وَأَلْقَى السَّمْعَ>> (lend an ear) to the address of Allah, and who <<وَهُوَ شَهِيدٌ>> (are a witness) to the Affair (الشأن) that Allah originates in His cosmos.\n\n### [The Ninth Pole is upon the Spiritual Station of Lot, peace be upon him]\n\nAs for the Ninth Pole (القطب) who is upon the footstep (قدم) of Lot (عليه السلام), his Surah is *Surat al-Kahf* (The Cave). To this Surah belongs infallibility (*al-ʿiṣmah*) and seeking refuge (*al-iʿtiṣām*). His stations (منازل) are equal to the number of its verses. His spiritual state (حال) is the preservation (العصمة) from everything that leads to ill-manners (*sūʾ al-adab*), which distances its possessor from the Divine Carpet (البساط). Thus, his time (وقته) is always preserved for him. His knowledge (علم) is the knowledge of seeking refuge (*al-iʿtiṣām*). God has specified and confined this knowledge to two matters: seeking refuge in Him, as He, Exalted is the Speaker, said: <<وَاعْتَصِمُوا بِاللَّهِ>> (And hold fast to Allah); and the other seeking refuge is in His rope (حبل), which is His saying, Exalted is He: <<وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا>> (And hold fast, all of you, to the rope of Allah).\n\nAmong people, some seek refuge in God, and some seek refuge in the rope of God. It is said that seeking refuge in the rope of God is the very essence (عين) of seeking refuge in God. This Pole (القطب) combines these two forms of seeking refuge. The difference between the two forms of seeking refuge is that the rope of God (حبل الله) is the path (الطريق) by which you ascend to Him, such as His saying: <<إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ>> (To Him ascends the good word, and the righteous deed elevates it). His rope is nothing other than what He has legislated (شرعه), and people’s understanding of it varies, leading to differences among them. For this reason, <<فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَى بَعْضٍ>> (Allah has favored some of them over others). Whoever does not err in his path is the preserved one (*al-maʿṣūm*), and holding fast to it is seeking refuge (*al-iʿtiṣām*). This is the state (حال) of the believers who have reached perfection in faith (الإيمان). Such people seek refuge in God through their seeking refuge in the rope of God, which is His saying: <<وَإِيَّاكَ نَسْتَعِينُ>> (And You alone we ask for help), and His saying: <<اسْتَعِينُوا بِاللَّهِ>> (Seek help through Allah). As for seeking refuge in God, it is the saying of the Prophet (صَلَّى اللهُ عَليهِ وسَلَّم) in seeking protection (*al-istiʿādhah*): \"I seek refuge in You from You.\"\n\nNothing among His creation (خلقه) can resist Him, so refuge is sought in Him only from Him. When a human being hears that he was created upon the form (صورة) of the Real (الحق), and he fails to distinguish between the Perfect Human (الإنسان الكامل) and the animalistic human (الإنسان الحيوان), he imagines that simply by being human, he is upon the Form. This is not the case as he perceives it. Rather, insofar as he is human, he is receptive to the Form (قابل للصورة). If the Form is granted to him, he does not refuse its acceptance. When it is granted to him, he is then upon the Form and is counted among the Caliphs (الخلفاء).\n\nOne who is upon the Form does not act except through the action (تصرف) of the Real (الحق) by means of it. The action of the Real is the very essence (عين) of what the cosmos (العالم) is based upon and contained within. You know in every respect what the cosmos contains, whether obligated (مكلف) or non-obligated (غير مكلف), and what is denied (ينكر) and what is known (يعرف). Yet, no one knows what is denied and what is known within the obligated cosmos except the Caliph (الخليفة), who is the possessor of the Form (صاحب الصورة).\n\nThe Real (الحق) holds the ruling of denial (حكم الإنكار), not the servant. Therefore, the one who seeks refuge in God (*al-muʿtaṣim bi-Llāh*), if he is the possessor of the Form, seeks refuge only from Him, by Him manifesting in a situation that the possessor of the Form denies, even if it is His Attribute (صفته). He is not permitted to clothe himself in that Attribute in every situation, nor to manifest it in every witnessing (مشهد). Rather, he must conceal it and adorn himself with it according to what the moment (الوقت) dictates. This is what is expressed as proper conduct (*al-adab*). Even if his witnessing (مشهد) is that he sees nothing but God, by God, and that the cosmos is the very Essence (عين) of the Existence (وجود) of the Real—and this is the greatest deterrent from denial—denial must still occur if this station (مقام) is truly established for him. Thus, he denies by the Real, against the Real, for the sake of the Real, and he does not care, for his argument is established.\n\n### The Tenth Pole (Qutb) on the Footstep of Hud (Hūd)\n\nAs for the Tenth Pole (القطب) who is upon the heart (قلب) of Hud (عليه السلام), his Surah is *Surat al-Anʿām* (The Cattle). To it belongs perfection (*al-kamāl*) and completion (*al-tamām*) among the long Surahs (*al-ṭiwālāt*). His stations (منازل) are equal to the number of its verses. This Pole possesses abundant knowledge (علوم جمة), including the knowledge of deservedness (*ʿilm al-istiḥqāq*), which every creature (مخلوق) deserves in its creation (خلقه), and the knowledge of the levels (المراتب) that this creation deserves.\n\nAs for the deservedness of creation, it is His saying: <<أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (He gave every thing its creation). As for the levels (المراتب), the warning concerning them comes from His saying, Exalted is He: <<وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ>> (And they did not appraise Allah with true appraisal), and <<يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ>> (O People of the Scripture, do not exceed limits in your religion). This means neither raising a thing above its level nor lowering it below it. The discerning scholar (*al-ʿālim al-ʿāqil*) is distinguished from others only by giving every rightful possessor his due and giving every thing its creation. If one does not know this, he is ignorant of the Real (الحق). If he knows it but does not act upon his knowledge, he is not discerning (*ghayr ʿāqil*). Therefore, the possessor of this station (مقام) must be perfect in intellect (*tāmm al-ʿaql*) and complete in knowledge (*kāmil al-ʿilm*). This is the Divine Preservation (*al-ḥifẓ al-ilāhī*) and the Greatest Providence (*al-ʿināyah al-ʿuẓmā*). Following this ideal path (*al-ṭarīqah al-mutḥlā*), which is the path of proximity (*al-zulfa*), is the most upright path (*al-sulūk al-aqwam*).\n\nWhen God completed the creation of the cosmos (العالم) in spirit (روح) and form (صورة), and placed every creature in its proper level (رتبته), He established a spiritual and physical cohesion (*iltiḥām*) within the cosmos for the manifestation of the individuals (أشخاص) of every cosmic species, since the entry of the individuals of every species into Existence (الوجود) was impossible [without this cohesion]. He did this only so that the superiority of the Agent (الفاعل) over the recipient (المنفعل) might become manifest through spiritual tasting (*al-dhawq*). Thus, they know the favor of the Real (الحق) upon His servants and understand how to realize their servitude (*ʿubūdiyyah*) with Him.\n\nHe attributed creation (الخلق) to them, saying: <<وَإِذْ تَخْلُقُ مِنَ الطِّينِ>> (When you create from clay), and He said: <<فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ>> (So blessed is Allah, the best of creators). He thus mentioned that there are creators, and God is the best of them in creation. For He, Exalted is He, creates what He creates through witnessing (شهود). The creator among the servants (العباد) creates only through an image (تصور) that he forms from existing entities (أعيان موجودة), desiring to create their like or originate their like. The creation of the Real is not like that. He originates or creates the creature (المخلوق) according to what that creature is in its own self and essence (عينه). He only clothes it in the garment of Existence (حلة الوجود) through a relation called bringing into existence (*al-ījād*).\n\nThus, whoever God grants unveiling (*kashf*) regarding the essences (أعيان) of whatever He wills among the possibilities (*al-mumkināt*), it is not within his power to bring them into existence (*ījād*). That is, the robe of Existence (خلعة الوجود) that the fixed, possible entity (العين الثابتة الممكنة) wears is not directly in his hand. However, he possesses spiritual resolve (*al-himmah*), which is the *will* for their existence (إرادة وجودها), not the *will* to bring them into existence *by himself*, because he knows that this is impossible for him. When he attaches his spiritual resolve to their existence, the Real relates the command of 'Be!' (*al-takwīn*). Thus, the entity knows the command of its Lord from the command of creation, whether the command is upon the tongue of creation or comes directly from the Real by the removal of intermediaries (الوسائط). That thing must then come into being. In the witnessed world (*al-shāhid*), it is said: \"So-and-so did such-and-such by his spiritual resolve,\" or if he spoke, it is said: \"So-and-so said such-and-such, and such-and-such resulted from his saying.\" Whoever knows this understands what belongs to the servant in that coming-into-being and what belongs to the Real in it. For this reason, He said that He is <<أَحْسَنُ الْخَالِقِينَ>> (the best of creators).\n\nWhen the essence (عين) of that thing which has come into being manifests, whatever it may be, its level (مرتبته)—meaning its primary level—yearns for it because its temperament demands it. It then acquires the preparedness (*al-istiʿdād*) for high or low matters, according to what that acquired preparedness grants it, and it appears in the cosmos (العالم) in the form of that. If a stranger—and by stranger I mean one who has no knowledge of the Realities (الحقائق)—looks at it and considers its preparedness, his observation may lead him to conclude that it is below its proper level, or that its level is above the rank in which it appeared. But the matter in itself is not as it appears to the observer. For the effective preparedness (*al-istiʿdād al-muʾaththir*) is only in the creation (الخلق), and it is an essential preparedness (*istiʿdād dhātī*). As for accidental preparedness (*istiʿdād ʿaraḍī*), it has no ruling. Rather, accidental preparedness is merely a level manifested by the essential preparedness. This measure of knowledge is hidden from most of creation.\n\nAn example of this is when they see a silent person who has mastered and perfected the sciences, yet he is given the lowest of ranks—a rank that should not be the ultimate station for one who has gathered such virtues and knowledge. It is said that this man has been lowered from his rank and has not been treated justly. They have no knowledge that his rank is the very essence (عين) of those virtues he gathered and those sciences he perfected, and among them is this lowly rank that the ruler has appointed him to, if he is among the appointed. If he is not among the appointed and has attained no position despite this excellence, it is said that he is deprived. But he is not deprived; rather, the situation (*al-mawṭin*) demanded it. This is because the world (*al-dunyā*) demands that the majestic person be treated with majesty at one time, and at another time, the majestic person be treated with lowliness. At one time, the lowly person is treated with lowliness, and at another time, the lowly person is treated with majesty. This is unlike the situation of the Hereafter (*al-ākhirah*), where the great person is treated with greatness and the insignificant person is treated with insignificance.\n\nIf the observer were to look, he would see in the world those who speak about God in a manner unfitting for Him, Exalted is He, and those who speak about Him with fitting transcendence (*tanzīh*) and praise. No servant can be greater than the Real (الحق). Thus, whoever knows the situations (المواطن) knows how matters proceed in the cosmos. <<وَإِلَى اللَّهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Allah all matters are returned), whether sound or unsound. Therefore, do not look at the positions (المناصب), but look at the Establisher (الناصب) who acts according to the ruling of the situations, not according to what rational consideration (*al-naẓar al-ʿaqlī*) dictates. For if the observer is discerning, he knows by his intellect that the situation of the world grants such-and-such, and he abandons the rational possibility (*al-jawāz al-ʿaqlī*) that might apply to every single individual in the cosmos. This possibility, in the very essence of witnessing (عين الشهود), is neither knowledge nor truth. The discerning person should be with what is actualized in the present state (الحال), for that is the form of the matter as it is in itself. The discerning person has no attachment to the future, unless God grants him unveiling (*kashf*) regarding the fixed entities (أعيان) of the possibilities before their occurrence in Existence (الوجود). In that case, there is no difference between him and one who witnesses them during their occurrence, because the ruling of rational possibility is removed from this person of unveiling regarding what God has unveiled and informed him of. This is some of the knowledge of this Pole.\n\n### The Eleventh Pole (Qutb) on the Footstep of Salih (Ṣāliḥ)\n\nAs for the Eleventh Pole (القطب) who is upon the footstep (قدم) of Salih (عليه السلام), his Surah from the Quran is *Surat Ṭā Hā*. To it belongs complete nobility (*al-sharaf al-tāmm*). His stations (منازل) are equal to the number of its verses. Know that this Pole is nobler than all other Poles by virtue of this Surah, because this Surah is the noblest Surah in the Quran in the blessed world (*al-ʿālam al-saʿīd*). It is the Surah that the Real (الحق), Exalted is He, recites to His servants in Paradise without intermediary (واسطة).\n\nThis Pole possesses abundant knowledge. He has might (*al-baṭsh*) and power (*al-quwwah*), just as Abu Yazid al-Bistami said when he heard a reciter reading: <<إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ>> (Indeed, the grasp of your Lord is severe). He said, \"My grasp is more severe.\" His state (حال) was that of one who speaks by God. Thus, God’s saying about Himself that His grasp is severe, when spoken upon the tongue of His servant, is more severe than His grasp without the tongue of His servant. Furthermore, His grasp upon the tongue of His natural servant (*ʿabdahu al-ṭabīʿī*) is incomparably more severe than His grasp upon the tongue of His Divine servant (*ʿabdahu al-ilāhī*).\n\nMost of the knowledge of this Imam lies in transcendence (*al-tanzīh*) and encompassing (*al-iḥāṭah*). The transcendence and encompassing that he knows is not the commonly understood concept; rather, it is the transcendence of the commonly understood transcendence, and he makes this the knowledge of encompassing. This is because his transcendence is the non-participation in Existence (الوجود). He is Existence, and nothing else. What is expressed by him as 'the World' (*al-ʿālam*) is merely the Manifest Name (*al-Ism al-Ẓāhir*), which is His Face (وجهه). What is hidden from His Manifestation is the Inner Name (*al-Ism al-Bāṭin*), which is His Ipseity (هويته). Thus, He manifests to him and is concealed from him.\n\nAs for pains (*al-ālām*) and pleasures (*al-ladhdhāt*), they correspond to the Names (الأسماء) and agree with them. Through them, the forms (الصور) multiplied, for they are what took shape, and some perceived others. Thus, He was encompassing them (محيطا بها) yet transcendent of them (منزها عنها). He has concealment from them and Self-disclosure (التجلي) within them. The forms vary for him, and he denies his own state (حاله) despite knowing that it is He. This is what you hear a person say about himself: \"In this time, I deny myself, for it has changed upon me, and I did not know myself like this,\" yet he is He, and none other.\n\nInsofar as the Names take shape, possibility (*al-imkān*) belongs to Him. Insofar as the receptive Essence (العين القابلة) accepts the variation of the Nominal Forms upon it, necessity (*al-wujūb*) belongs to Him. Thus, He is the Necessary-Possible (الواجب الممكن), the Place (المكان) and the Occupant (المتمكن), described by temporality (*al-ḥudūth*) and pre-eternity (*al-qidam*). Just as His Glorious Speech (كلامه العزيز) is described by temporality despite being characterized by pre-eternity, He said: <<مَا يَأْتِيهِمْ>> (There comes not to them)—the pronoun refers to the Nominal Forms (صور الأسماء)—<<مِن ذِكْرٍ مِّن رَّبِّهِم مُّحْدَثٍ>> (any reminder from their Lord that is newly produced). Thus, He described it as temporal, so it is temporal in the form of the All-Merciful (*al-Raḥmān*). And <<مَا يَأْتِيهِمْ>>—the pronoun is like the first—<<مِن ذِكْرٍ مِّنَ الرَّحْمَنِ مُحْدَثٍ>> (any reminder from the All-Merciful that is newly produced). Thus, He described it as temporal, so it is temporal in the form of the Lord (*al-Rabb*).\n\nIf the mention of the Lord precedes, the mention of the All-Merciful is its answer. If the mention of the All-Merciful precedes, the mention of the Lord is its answer. The preceding of the two mentions is always the Quran, and the second is the Criterion (*al-Furqān*). Thus, <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) belongs to the preceding one, which is the Quran, and <<وَهُوَ السَّمِيعُ الْبَصِيرُ>> (And He is the Hearing, the Seeing) belongs to the latter, which is the Criterion. Thus, <<هُوَ الْأَوَّلُ وَالْآخِرُ>> (He is the First and the Last), just as He is <<الظَّاهِرُ وَالْبَاطِنُ>> (the Manifest and the Inner), and <<وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ>> (And He is, of all things, Knowing).\n\nThere is nothing but the acceptance of the Nominal Forms (صور الأسماء), and all of them lead to encompassing (الإحاطة). Thus, the matter is confined to Him. He only said 'Be!' (*kun*) for Him, and He only alluded to 'coming into being' (*yakūn*) through Him. Do you not see that He named Himself Time (*al-Dahr*) and that He alternates the night and the day? Time is nothing other than the night and the day, and alternation is nothing but the variation of forms. Days, hours, months, and years are the very essence (عين) of Time. Within Time, the detailed differentiation occurred as we mentioned: from one perspective, it is an hour; from another, it is a day, night, day and night, week, month, year, seasons, and cycles.\n\n> Every good belongs to Him,\n> And every evil does not belong to Him.\n> He is Existence entirely,\n> And His loss is not for Him.\n> He is known by whoever knows Him,\n> He is ignored by whoever ignores Him.\n> Indeed, I am His deputy,\n> In all my states and for Him.\n> So you are He, yet you are not He,\n> And you are for Him, yet you are not for Him.\n> Even if you performed His making,\n> And even if you executed His act.\n\nThis is from some of the breaths (*anfās*) of the knowledge of this Pole. This is how his course runs through all his sciences, despite their abundance and detail.\n\n### The Twelfth Pole (Qutb) on the Footstep of Shu'ayb (Shuʿayb)\n\nAs for the Twelfth Pole (القطب) who is upon the footstep (قدم) of Shuʿayb (عليه السلام), his Surah from the Quran is *Surat Tabārak al-Ladhī bi-Yadihi al-Mulk* (Blessed is He in Whose Hand is the Dominion). It is the one that argues on behalf of its reciter. His stations (منازل) are equal to the number of its verses. Look at its argument in His saying: <<مَا تَرَى فِي خَلْقِ الرَّحْمَنِ مِن تَفَاوُتٍ فَارْجِعِ الْبَصَرَ كَرَّتَيْنِ>> (You see no inconsistency in the creation of the All-Merciful. Then return [your] vision... twice). This draws attention to examining the two premises: <<هَلْ تَرَى مِن فُطُورٍ>> (Do you see any flaw?)—meaning a defect that could introduce an error into the proof being established. <<يَنقَلِبْ إِلَيْكَ الْبَصَرُ>> (The vision will return to you)—meaning the gaze—<<خَاسِئًا>> (humbled), far from penetrating it with a defect or semblance of one, <<وَهُوَ حَسِيرٌ>> (while it is weary), meaning it is exhausted, having been overcome by weariness. Every verse in this Surah proceeds according to this pattern until it concludes with His saying: <<قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَاؤُكُمْ غَوْرًا فَمَن يَأْتِيكُم بِمَاءٍ مَّعِينٍ>> (Say, \"Have you considered: if your water was to become sunken [into the earth], then who could bring you flowing water?\").\n\nDo you not see all of Existence (الوجود) without instruction? Do you see it, in its state of distress, resorting to anyone other than God? It resorts only to God essentially (بالذات). If He were other than it, it would not know Him so as to resort to Him. This is like the common saying to one afflicted: \"Why do you resort in your affliction only to patience (*al-ṣabr*)?\" Patience is nothing but the Attribute (صفة) of the patient one, who is also named the Patient One (*al-Ṣabūr*). He says, \"I am He; there is no other.\" This is the very essence (عين) of what the Pole upon the footstep of Salih claimed in his knowledge. May God bless our Prophet Muhammad and him.\n\n> O Shuʿayb, there is no defect,\n> But He is Witnessed and Absent.\n> So look at wisdom and decisive speech,\n> In it there is no doubt.\n\nThis Pole possesses the knowledge of proofs (*al-barāhīn*), the balances of the sciences (*mawāzīn al-ʿulūm*), and the knowledge of definitions (*al-ḥudūd*). He is entirely a subtle, pure spirit (روح مجرد لطيفة), ruling over nature (*al-ṭabīʿah*), supporting the Sacred Law (*al-sharīʿah*). Among his peers, he is vast in generosity (ضخم الدسيعة). He feeds but is not fed, and he bestows grace but does not enjoy grace. Contemplation (*al-tafakkar*) dominates him, so that they may remember entering into clear matters, only to deny them. Thus, he is the unknown (المجهول) who is not recognized, and the indefinite (النكرة) who is not defined.\n\nMost of his action, in what he acts upon among the Divine Names (الأسماء الإلهية), is through the Names: the Disposer (*al-Mudabbir*), the Detailer (*al-Mufaṣṣil*), the Originator (*al-Munshiʾ*), the Creator (*al-Khāliq*), the Fashioner (*al-Muṣawwir*), the Maker (*al-Bāriʾ*), the Initiator (*al-Mubdiʾ*), the Restorer (*al-Muʿīd*), the Judge (*al-Ḥakam*), and the Just (*al-ʿAdl*). He does not see the Real (الحق) in any of His Self-disclosures (تجلي) without seeing the Balance (*al-Mīzān*) in His hand, lowering and raising. There is nothing but lowering and raising, because there is nothing but meaning and letter, spirit and form, heaven and earth, agent and recipient. Thus, there is nothing but a pair (*shafʿ*), and every single one of the pair is odd (*watr*). Therefore, there is nothing but the odd. <<وَالْفَجْرِ * وَلَيَالٍ عَشْرٍ * وَالشَّفْعِ وَالْوَتْرِ>> (By the Dawn, and [by] ten nights, and [by] the even and the odd). The even seeks the even, and the odd seeks the odd, which is the seeking of vengeance (*ṭalab al-thaʾr*).\n\n> His evenness in His oddness is manifest,\n> And His oddness in His evenness is contained.\n> The clouds poured forth their rains,\n> And what was, came to be by a confused command.\n> Your earth related its news,\n> And brought forth every delightful pair.\n> Souls perish when they witness their essences,\n> With an eye other than the Real in them.\n> The opposite is distinguished from its opposite by them,\n> And its like is paired with its like.\n> The delight of the eyes is in what appeared,\n> In the upper cosmos (العالم العلوي) between the openings.\n> Everything manifest to the eye,\n> When you verify it, has not departed from Him.\n\nThis Pole combines the two powers: the theoretical power (*al-quwwah al-ʿilmiyyah*) and the practical power (*al-quwwah al-ʿamaliyyah*). He is a creation whose making is not missed by his innate disposition (*al-fiṭrah*). In every science—whether logical, mathematical, natural, or divine—he possesses a Divine tasting (*dhawq ilāhī*). All categories of these sciences are, for him, Divine sciences. He took them only from God, saw them as nothing but the Real (الحق), and saw no indication in them *away* from the Real. Every science or issue within that science is a sign (آية) and an indication (دلالة) of God for him, and he knows no indication for it toward anything else, due to his absorption in God. This is because he is one drawn (*majdhūb*) and desired (*murād*). He did not strive for the state he is in; rather, he found within himself that he is He. Then he opened his eyes and saw everything with a vision of encompassing (إحاطة) what he saw. The increase he gains is only in the detailing of what he has always and eternally seen, because everything visible in Existence (الوجود) is constantly diversifying. Thus, the benefit is perpetual, and every benefit is an increase in knowledge that he did not possess regarding a known thing that he has always known and witnessed.\n\nWe have thus mentioned concerning the states of the twelve Poles (الأقطاب) what God facilitated for my tongue to mention. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way). One of these Poles has the number one, and he is the possessor of pure Unity (*al-tawḥīd al-khāliṣ*). Another has the number two, and so on for each one up to the tenth. The eleventh has the number one hundred, and the twelfth has the number one thousand. The solitary ones (*al-mufrad*) possess the composition of numbers from eleven to infinity. This belongs to the solitary ones, who are those who know the oneness of multiplicity (أحدية الكثرة) and the oneness of the One (أحدية الواحد). May God make us and you among those who understand from God what He has inscribed in the cosmos concerning the knowledge of Him, Glorified is He, which indicates Him, Mighty and Majestic. Indeed, He is the Protecting Friend (*al-Walī*), the Benefactor (*al-Muḥsān*), the Generous (*al-Jawwād*), the Noble (*al-Karīm*), the Bestower (*al-Mannān*). <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر چار سو تریسٹھ: ان بارہ قطبوں کی معرفت میں جن پر ان کے زمانے کا عالم گردش کرتا ہے۔\n\nعدد میں اسماء کی انتہا\nبارہ پر ہے، عقد (تکمیل) کے ساتھ۔\nپس ان کے ذریعے ہستی (الوجود) محفوظ ہے، اور ذات حق (الحق) کی ہستی (الوجود) میں جو عدد ہے۔\nوہ عدد سے موصوف ہے، اور وہ احد (الأحد) سے موصوف ہے۔\nان کی نشأت کے احکام اس میں ظاہر ہوئے جو بغیر ستونوں کے قائم ہے۔\nارکان میں ان کا حکم مکمل ہوا، ان میں سے ایک باپ میں اور ایک بیٹے میں۔\n\n### [اس امت کے قطب بارہ قطب ہیں]\n\nاللہ تعالیٰ نے اپنے نبی (صَلَّى اللهُ عَليهِ وسَلَّم) سے فرمایا: قُلْ هُوَ الله أَحَدٌ (کہہ دیجیے: وہ اللہ ایک ہے)۔ اور اسے پہچان کروائی، پس فرمایا: وَلِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمائِهِ (اور اللہ ہی کے لیے بہترین نام ہیں، پس تم اسے ان ناموں سے پکارو، اور ان لوگوں کو چھوڑ دو جو اس کے ناموں میں کج روی کرتے ہیں)۔ یعنی وہ اس کے ناموں سے انحراف کرتے ہیں، نہیں بلکہ وہ اس کے ناموں میں اس مراد کے علاوہ کسی اور رخ کی طرف مائل ہوتے ہیں جو ان ناموں سے مقصود ہے۔ سَيُجْزَوْنَ ما كانُوا يَعْمَلُونَ (انہیں جلد ہی ان کے اعمال کا بدلہ دیا جائے گا)۔ پس ہر ایک کو اس چیز کا بدلہ دیا جائے گا جس کی طرف وہ اس وحی میں مائل ہوا، یعنی: اتَّبِعْ ما أُوحِيَ إِلَيْكَ مِنْ رَبِّكَ (آپ اس کی پیروی کیجیے جو آپ کے رب کی طرف سے آپ پر وحی کیا گیا ہے) اور ان کی کج روی کی طرف مائل نہ ہوئیے، کیونکہ میں نے آپ کو متبع (پیروی کرنے والا) پیدا کیا ہے، نہ کہ متبوع (جس کی پیروی کی جائے)۔ یہ اسم مفعول ہے، اسم فاعل نہیں۔ اسی لیے جب انبیاء کا ذکر کیا تو آپ سے فرمایا: فَبِهُداهُمُ اقْتَدِهْ (پس آپ ان کی ہدایت کی پیروی کیجیے)، نہ کہ ان کی پیروی کیجیے۔ اور ان کی ہدایت اللہ کی شریعت کے سوا کچھ نہیں ہے۔ پس فرمایا: شَرَعَ لَكُمْ مِنَ الدِّينِ ما وَصَّى بِهِ نُوحاً (اس نے تمہارے لیے دین میں وہی شریعت مقرر کی جس کی وصیت اس نے نوح کو کی تھی) اور جن کا ذکر کیا ان کا ذکر کیا۔ پس ہمارے لیے شریعت مقرر کرنے والا اللہ ہے جس نے ان کے لیے شریعت مقرر کی۔ اگر آپ ان سے لیتے تو آپ تابع ہوتے، پس سمجھو۔\n\nپس اس امت کے قطب بارہ قطب ہیں، ان پر اس امت کا مدار ہے، جیسا کہ دنیا اور آخرت میں جسمانی اور جسمی عالم کا مدار بارہ برجوں پر ہے، جنہیں اللہ نے دونوں جہانوں میں ہونے والے معمول کے اور غیر معمول کے کون و فساد (ہستی اور زوال) کے ظہور پر مقرر کیا ہے۔\n\nاور رہے افراد (المفردون)، تو وہ بہت ہیں، اور دو ختم (الختمان) ان ہی افراد میں سے ہیں، پس وہ دونوں قطب نہیں ہیں۔ اور قطبوں میں کوئی ایسا نہیں جو محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کے قلب پر ہو۔ اور رہے افراد (المفردون)، تو ان میں سے بعض وہ ہیں جو محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کے قلب پر ہیں، اور ختم (خاتم الاولیاء الخاص) ان ہی میں سے ہے۔\n\nاور رہے بارہ قطب، تو وہ انبیاء علیہم السلام کے قلوب پر ہیں۔ ان میں سے ایک نوح علیہ السلام کے قلب پر ہے، اور اگر آپ چاہیں تو کہہ سکتے ہیں کہ قدم (مرتبہ) پر ہے، اور یہ زیادہ بہتر ہے، کیونکہ میں نے کشف (الکشف) میں اشبیلیہ میں انہیں اسی طرح دیکھا، اور یہ رسولوں کے ساتھ ادب میں زیادہ عظیم ہے، اور ادب ہمارا مقام ہے، اور یہی وہ چیز ہے جسے میں اپنے لیے اور اللہ کے بندوں کے لیے پسند کرتا ہوں۔\n\nپس ہم کہتے ہیں کہ پہلا، یعنی ان میں سے ایک، نوح علیہ السلام کے قدم پر ہے، اور دوسرا خلیل ابراہیم علیہ السلام کے قدم پر ہے، اور تیسرا موسیٰ علیہ السلام کے قدم پر ہے، اور چوتھا عیسیٰ علیہ السلام کے قدم پر ہے، اور پانچواں داؤد علیہ السلام کے قدم پر ہے، اور چھٹا سلیمان علیہ السلام کے قدم پر ہے، اور ساتواں ایوب علیہ السلام کے قدم پر ہے، اور آٹھواں الیاس علیہ السلام کے قدم پر ہے، اور نواں لوط علیہ السلام کے قدم پر ہے، اور دسواں ہود علیہ السلام کے قدم پر ہے، اور گیارہواں صالح علیہ السلام کے قدم پر ہے، اور بارہواں شعیب علیہ السلام کے قدم پر ہے۔\n\nاور میں نے تمام رسولوں اور انبیاء کو مشاہدہ عین (آنکھوں سے دیکھنا) کے ذریعے دیکھا، اور ان میں سے ہود، جو قوم عاد کے بھائی تھے، سے تنہائی میں بات کی۔ اور میں نے تمام مومنین کو بھی مشاہدہ عین کے ذریعے دیکھا، جو ان میں سے گزر چکے ہیں اور جو قیامت تک ہوں گے، ذات حق (الحق) نے انہیں دو مختلف زمانوں میں ایک ہی میدان میں میرے لیے ظاہر کر دیا۔\n\nاور میں نے محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کے علاوہ رسولوں میں سے ایک جماعت کی صحبت اختیار کی اور ان سے فائدہ اٹھایا، ان میں سے ابراہیم خلیل ہیں جن پر میں نے قرآن پڑھا، اور عیسیٰ ہیں جن کے ہاتھ پر میں نے توبہ کی، اور موسیٰ ہیں جنہوں نے مجھے علم کشف (الکشف) اور ایضاح کا علم اور رات اور دن کو پلٹنے کا علم عطا کیا۔ جب یہ علم مجھے حاصل ہوا تو میرے پاس سے رات زائل ہو گئی اور دن پورے دن باقی رہا، پس میرے لیے نہ سورج غروب ہوا اور نہ طلوع ہوا۔ یہ کشف (الکشف) میرے لیے اللہ کی طرف سے نشانیاں تھیں کہ آخرت میں میری بدبختی میں کوئی حصہ نہیں ہے۔ اور ہود علیہ السلام سے میں نے ایک مسئلہ پوچھا تو انہوں نے مجھے اس سے آگاہ کیا، پس وہ وجود (الوجود) میں اسی طرح واقع ہوا جیسا کہ انہوں نے مجھے بتایا تھا۔ یہ میرے زمانے تک ان لوگوں کے احوال ہیں۔ اور میں نے رسولوں میں سے محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، ابراہیم، موسیٰ، عیسیٰ، ہود اور داؤد کی صحبت اختیار کی، اور باقی صرف رؤیت (دیکھنا) ہے، صحبت نہیں۔\n\n### [ان قطبوں میں سے ہر قطب کا عالم میں قیام ہے]\n\nاور جان لو کہ ان قطبوں میں سے ہر قطب کا عالم میں قیام ہے، یعنی ان کی دعوت ان لوگوں میں جن کی طرف وہ مبعوث کیے گئے، مخصوص مقررہ مدتوں تک رہتی ہے جو ختم ہو جاتی ہیں، پھر وہ کسی دوسری دعوت سے منسوخ ہو جاتی ہیں، جیسا کہ شریعتیں شریعتوں سے منسوخ ہوتی ہیں۔ اور میری مراد ان کی دعوت سے وہ حکم اور تاثیر ہے جو انہیں عالم میں حاصل ہے۔\n\nپس ہم ان کی دنیاوی زندگی میں ان کی عمروں کی مدتیں ذکر کرتے ہیں: ان میں سے بعض وہ ہیں جن کی ولایت میں عمر تینتیس سال اور چار ماہ تھی، اور بعض وہ ہیں جن کی مدت تیس سال، تین ماہ اور بیس دن تھی، اور بعض وہ ہیں جن کی مدت اٹھائیس سال، تین ماہ اور دس دن رہی، اور بعض وہ ہیں جن کی مدت پچیس سال رہی، اور بعض وہ ہیں جن کی مدت بائیس سال، گیارہ ماہ اور بیس دن رہی، اور بعض وہ ہیں جن کی مدت انیس سال، پانچ ماہ اور دس دن رہی، اور بعض وہ ہیں جن کی مدت سولہ سال اور آٹھ ماہ رہی، اور بعض وہ ہیں جن کی مدت تیرہ سال، دس ماہ اور بیس دن رہی، اور بعض وہ ہیں جن کی مدت گیارہ سال، تین ماہ اور دس دن رہی، اور بعض وہ ہیں جن کی مدت دو سال، نو ماہ اور دس دن رہی، اور بعض وہ ہیں جن کی مدت آٹھ سال اور چار ماہ رہی، اور بعض وہ ہیں جن کی مدت پانچ سال، چھ ماہ اور بیس دن رہی۔\n\nاور ان کا ورد (ہجیر) ایک ہی ہے، اور وہ ہے \"اللہ اللہ\" (ہاء کے سکون اور ہمزہ کی تحقیق کے ساتھ)۔ ان کے لیے اس کے سوا کوئی ورد (ہجیر) نہیں ہے۔\n\nاور ان قطبوں کے علاوہ بستیوں، سمتوں اور علاقوں کے قطب اور جماعتوں کے شیوخ بہت سی قسمیں ہیں، جن میں سے میں اس فصل میں وہ ذکر کروں گا جو میسر ہو، اور میں یہ ذکر صرف اس ذکر کے نتیجے کے لیے کروں گا جو اس پر اس حال پر قائم رہے جو ذکر میں معروف ہے، جیسا کہ الذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ (اللہ کو کثرت سے یاد کرنے والے مرد اور یاد کرنے والی عورتیں)۔ اگر ہم اس کا ارادہ نہ کرتے تو اس کتاب میں میرے ذکر اور اس کی تعیین کا کوئی فائدہ نہ ہوتا۔\n\nپس ہم پہلے ان قطبوں کے احوال میں سے وہ ذکر کرتے ہیں جو میسر ہو، ان کے ورد (ہجیر) کی احدیت کے ساتھ۔ اور ان کا ورد (ہجیر) صرف اس لیے واحد ہوا کہ قطبیت کا مقام واحد ہے، پس وہ قطبیت کا ورد (ہجیر) ہے، شخص کا ورد (ہجیر) نہیں۔ اور ان میں سے ہر ایک کے لیے اس کے علاوہ اوقات میں بھی ورد (ہجیر) ہے۔\n\nاور نبی (صَلَّى اللهُ عَليهِ وسَلَّم) نے فرمایا: لا تقوم الساعة حتى لا يبقى في الأرض من يقول الله الله (قیامت قائم نہیں ہوگی یہاں تک کہ زمین پر کوئی ایسا شخص باقی نہ رہے جو 'اللہ اللہ' کہتا ہو)۔\n\nآپ کی مراد یہ ہے کہ کوئی ایسا قطب باقی نہیں رہے گا جس پر عالم کا مدار ہو، اور نہ کوئی ایسا فرد (مفرد) باقی رہے گا جس کی ہمت سے اللہ عالم کو محفوظ رکھے، اگرچہ وہ قطب نہ ہو۔ پس قیامت صرف بدترین لوگوں پر قائم ہوگی۔\n\n### [پہلا قطب نوح علیہ السلام کے قدم پر ہے]\n\nاور رہا پہلا قطب، تو وہ نوح علیہ السلام کے قدم پر ہے۔ قرآن کی سورتوں میں سے اس کے لیے سورة يس (سورہ یٰس) ہے۔ کیونکہ ان بارہ قطبوں میں سے ہر قطب کے لیے قرآن کی ایک سورت ہے، اور ان کے علاوہ دوسرے قطبوں کے لیے بھی قرآن کی سورت یا قرآن کی ایک آیت ہو سکتی ہے، اور ان میں سے بعض کے لیے ایک سورت سے زیادہ بھی ہو سکتا ہے، اور ان میں سے بعض وہ ہیں جن کے لیے پورا قرآن ہے، جیسے ابو یزید بسطامی، جو قرآن کو حفظ کیے بغیر فوت نہیں ہوئے۔\n\nپس ہم ان بارہ قطبوں کے لیے مخصوص قرآن کی سورتیں ذکر کرتے ہیں۔ اس پہلے قطب کے لیے سورة يس (سورہ یٰس) ہے، اور وہ حکم میں سب سے کامل قطب ہے، اللہ نے اس کے لیے ظاہری اور باطنی دونوں صورتوں کو جمع کر دیا، پس وہ ظاہر میں تلوار کے ذریعے اور باطن میں ہمت کے ذریعے خلیفہ ہے۔ میں اس کا نام نہیں لوں گا اور نہ ہی اس کی تعیین کروں گا، کیونکہ مجھے اس سے منع کیا گیا ہے، اور میں جانتا ہوں کہ مجھے کس وجہ سے اس کے نام کی تعیین سے روکا گیا ہے۔\n\nاور ان قطبوں کی جماعت میں سے کسی کو بھی قطبیت کے تمام تقاضوں کی جامعیت نہیں دی گئی سوائے اس کے، جیسا کہ آدم علیہ السلام کو تمام اسماء دیے گئے، اور جیسا کہ محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کو جوامع الکلم (جامع کلمات) دیے گئے۔ اگر محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کے قدم پر کوئی قطب ہوتا تو یہی قطب ہوتا، مگر محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کے قدم پر کوئی نہیں ہے سوائے بعض بڑے افراد (الأفراد الأكابر) کے۔ ان کی تعداد معلوم نہیں ہے، اور وہ مخلوق میں پوشیدہ، بے گناہ، اللہ کے عالم ہیں، نہ وہ نقصان پہنچاتے ہیں اور نہ ہی پہچانے جاتے ہیں کہ انہیں نقصان پہنچایا جائے۔ ان کا مقام ان کے علم میں حفاظت ہے، ان کے علم میں کوئی شبہ داخل نہیں ہوتا جو انہیں اس علم میں حیران کر دے، بلکہ وہ اپنے رب کی طرف سے بصیرت پر ہیں۔ یہ افراد (الأفراد) کا حال ہے۔\n\nپس ہم اس قطب کے ذکر کی طرف لوٹتے ہیں۔\n\n### [ہر قطب کے منازل اس کی سورت کی آیات کی تعداد کے مطابق ہیں]\n\nپس ہم کہتے ہیں کہ اللہ کے نزدیک اس کے منازل اس سورت کی آیات کی تعداد کے مطابق ہیں، اور اسی طرح ہر قطب کے منازل اس کی سورت کی آیات کی تعداد کے مطابق ہیں۔ اور ان کی سورتیں معلوم ہیں، میں انہیں اجمالی طور پر ذکر کرتا ہوں، پھر اگر اللہ نے چاہا تو انہیں ذکر کروں گا۔\n\nپس پہلے کے لیے جیسا کہ ہم نے کہا، سورة يس (سورہ یٰس) ہے، اور دوسرے کے لیے سورة الإخلاص (سورہ اخلاص) ہے، اور تیسرے کے لیے سورة إذا جاء نصر الله (سورہ نصر) ہے، اور چوتھے کے لیے سورة الكافرون (سورہ کافرون) ہے، اور پانچویں کے لیے سورة إذا زلزلت (سورہ زلزال) ہے، اور چھٹے کے لیے سورة البقرة (سورہ بقرہ) ہے، اور ساتویں کے لیے سورة المجادلة (سورہ مجادلہ) ہے، اور آٹھویں کے لیے سورة آل عمران (سورہ آل عمران) ہے، اور نویں کے لیے سورة الكهف (سورہ کہف) ہے، اور یہی وہ ہے جسے دجال قتل کرے گا اور عیسیٰ علیہ السلام کو پائے گا۔ اور دسویں کے لیے سورة الأنعام (سورہ انعام) ہے، اور گیارہویں کے لیے سورة طه (سورہ طٰہٰ) ہے۔ اور یہ قطب ذات حق (الحق) کا نائب ہے، جیسا کہ علی بن ابی طالب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کے نائب تھے مکہ والوں پر سورة براءة (سورہ توبہ) کی تلاوت میں۔\n\nحالانکہ آپ (صَلَّى اللهُ عَليهِ وسَلَّم) نے پہلے ابوبکر کو بھیجا تھا، پھر اس سے رجوع کر لیا اور فرمایا: \"میری طرف سے قرآن صرف میرے اہل بیت کا کوئی شخص ہی پہنچائے گا۔\" پس آپ نے علی کو بلایا اور انہیں حکم دیا، تو وہ ابوبکر سے جا ملے۔ جب وہ مکہ پہنچے تو ابوبکر نے لوگوں کو حج کروایا، اور علی نے رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) کی نیابت میں لوگوں کو سورة براءة (سورہ توبہ) پہنچائی اور ان پر تلاوت کی۔\n\nاور یہ چیز آپ کو ابوبکر صدیق کی خلافت کی صحت اور علی رضی اللہ عنہما کے مقام پر دلالت کرتی ہے۔ اور بارہویں کے لیے سورة تبارك الملك (سورہ ملک) ہے۔\n\nپس یہ قرآن میں قطبوں کی سورتیں ہیں، سوائے اس کے کہ سورة المجادلة (قَدْ سَمِعَ الله قَوْلَ الَّتِي تُجادِلُكَ فِي زَوْجِها وَتَشْتَكِي إِلَى الله) کا صاحب، اس کی سورت درحقیقت سورة الواقعة (سورہ واقعہ) ہے، اور اسے اس سورت سے خاص لگاؤ ہے۔ اور اسی طرح وہ جس کے لیے صرف سورة الإخلاص (سورہ اخلاص) ہے۔\n\nاور ان کے منازل جیسا کہ ہم نے ذکر کیا، آیات کی تعداد کے مطابق ہیں، مگر منازل آیات کے مطابق اور ان میں مذکور چیزوں کے مطابق ہیں۔ کیونکہ آیات میں فضیلت مشہور ہے، اس طریقے پر جو آیا ہے، اور ان کی فضیلت تلاوت کرنے والے کی طرف لوٹتی ہے، اس لحاظ سے کہ وہ تلاوت میں متکلم بہا ہے، نہ کہ اس لحاظ سے کہ وہ کلام اللہ ہے، کیونکہ اس میں کوئی فضیلت نہیں ہے۔ فضیلت صرف اس چیز میں ہوتی ہے جس کے ذریعے کلام کیا گیا ہو، نہ کہ اس کے کلام میں۔ پس یہ جان لو۔\n\nاور رہا اس قطب کا حال، تو اس کے لیے عالم میں ظاہری اور باطنی تاثیر ہے۔ اللہ اس کے ذریعے اس دین کو مضبوط کرتا ہے۔ اس نے اسے تلوار کے ذریعے ظاہر کیا اور اسے ظلم سے محفوظ رکھا، پس اس نے عدل کے ساتھ حکم کیا جو کہ ذات حق (الحق) کا حکم ہے نازل ہونے والے معاملات میں۔ اور بسا اوقات اس کے حکم کی مخالفت کرنے والے مذاہب کے لوگ اس میں پڑ جاتے ہیں، جیسے شافعیہ، مالکیہ، حنفیہ اور حنابلہ، اور وہ جو کسی ایسے امام کے قول سے منسوب ہیں جو اس قطب کے حکم میں ان سے موافقت نہیں رکھتا، حالانکہ وہ ظاہر میں خلیفہ ہے۔ پس جب وہ ان ائمہ کے دلائل کے تقاضے کے خلاف حکم کرتا ہے، تو ان کے پیروکار اس کے اس حکم میں اسے غلط قرار دیتے ہیں، اور وہ اللہ کے نزدیک بلا شبہ گنہگار ہوتے ہیں، وَهُمْ لا يَشْعُرُونَ (حالانکہ وہ نہیں جانتے)۔ کیونکہ انہیں کسی مجتہد کو غلط قرار دینے کا حق نہیں ہے، کیونکہ ان کے نزدیک مصیب (درست فیصلہ کرنے والا) ایک ہے جو متعین نہیں ہے۔ اور جس کا یہ حال ہو، وہ مسلمانوں کے کسی عالم کو غلط قرار دینے کی جسارت نہیں کرتا، جیسا کہ لوگوں نے اسامہ اور ان کے والد زید بن حارثہ کی امارت کے بارے میں بات کی، یہاں تک کہ رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) نے اس بارے میں وہ فرمایا جو فرمایا۔ پس جب انہوں نے اس شخص پر طعن کیا جسے رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) نے آگے بڑھایا اور امیر بنایا، اور انہوں نے اپنی رائے کو رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) کی رائے پر ترجیح دی، تو قطب کے ساتھ ان کے احوال کے بارے میں آپ کا کیا خیال ہے؟ اور شہرت کہاں سے کہاں! ہائے افسوس! ہم کامیاب ہوئے اور يَخْسَرُ الْمُبْطِلُونَ (باطل والے خسارہ اٹھانے والے ہیں)۔\n\nپس اللہ کی قسم، اللہ کی طرف دعوت دینے والا وہی ہو گا جو بصیرت پر دعوت دے، نہ کہ وہ جو گمان پر دعوت دے اور اس کے مطابق حکم کرے۔ لا جرم کہ جس کا یہ حال ہو، اس نے محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کی امت پر وہ چیزیں تنگ کر دیں جن سے اللہ نے ان پر وسعت دی تھی، پس اللہ نے آخرت میں ان کے معاملے کو تنگ کر دیا اور قیامت کے دن ان پر مطالبہ اور حساب سخت کر دیا، کیونکہ انہوں نے اللہ کے بندوں پر سختی کی کہ وہ کسی معاملے میں حرج کو دور کرنے کی تلاش میں ایک مذہب سے دوسرے مذہب کی طرف منتقل نہ ہوں، اور انہوں نے یہ اعتقاد رکھا کہ یہ دین کے ساتھ کھلواڑ ہے۔ حالانکہ وہ نہیں جانتے تھے کہ اس قول سے وہ دین سے نکل گئے ہیں۔ بلکہ اللہ کی شریعت زیادہ وسیع ہے اور اس کا حکم زیادہ جامع اور نفع بخش ہے۔ وَقِفُوهُمْ إِنَّهُمْ مَسْؤُلُونَ ما لَكُمْ لا تَناصَرُونَ بَلْ هُمُ الْيَوْمَ مُسْتَسْلِمُونَ (اور انہیں ٹھہراؤ، بے شک ان سے پوچھا جائے گا، تمہیں کیا ہو گیا ہے کہ تم ایک دوسرے کی مدد نہیں کرتے؟ بلکہ وہ آج سر تسلیم خم کیے ہوئے ہیں)۔ یہ قیامت کے دن ان کا حال ہو گا، اور لا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُونَ (انہیں اجازت نہیں دی جائے گی کہ وہ عذر پیش کریں)۔\n\nاور اس قطب کے لیے کمال کا مقام ہے، پس کوئی صفت اسے مقید نہیں کرتی۔ وہ وقت کا حکیم ہے، جو صرف وقت کے حکم سے اور زمانے کے حال کے تقاضے کے مطابق ظاہر ہوتا ہے۔ اس کے حکم سے ارادہ وہ نہیں ہے جو ارادے کے حکم سے ہو۔ پس اس کے لیے سیادت (سرداری) ہے۔\n\nاور اس میں دس خصلتیں ہیں:\n\n**پہلی:** قدرت کے ساتھ حلم (بردباری)، کیونکہ اس کے لیے ہمت کے ذریعے فعل ہے، پس وہ کبھی بھی اپنے لیے غصہ نہیں کرتا۔ اور جب اللہ کی حرام کردہ چیزوں کی خلاف ورزی کی جاتی ہے تو اس کے غصے کے سامنے کوئی چیز کھڑی نہیں ہو سکتی، پس وہ اللہ کے لیے غصہ کرتا ہے۔\n\n**دوسری:** ان امور میں آہستگی (الأناة) جن میں اللہ آہستگی کو پسند کرتا ہے، اس کے ساتھ ساتھ نیکیوں کی طرف تیزی سے بڑھنا۔ پس وہ آہستگی کی طرف تیزی سے بڑھتا ہے اور اس کے مواقع کو جانتا ہے۔\n\n**تیسری:** چیزوں میں اعتدال (الاقتصاد)، پس وہ وقت کے تقاضے سے زیادہ کچھ نہیں کرتا۔ کیونکہ میزان اس کے ہاتھ میں ہے، وہ اس سے زمانے اور حال کو تولتا ہے، پس وہ اپنے حال سے اپنے زمانے کے لیے لیتا ہے اور اپنے زمانے سے اپنے حال کے لیے، پس وہ پست کرتا ہے اور بلند کرتا ہے۔\n\n**چوتھی:** تدبیر (التبدیر)، اور یہ حکمت کی معرفت ہے۔ پس وہ مواقع کو جانتا ہے اور ان سے ان امور کے ساتھ ملتا ہے جن کا وہ مواقع تقاضا کرتے ہیں۔\n\nجیسا کہ ابو دجانہ نے کیا جب نبی (صَلَّى اللهُ عَليهِ وسَلَّم) نے انہیں بعض غزوات میں تلوار دی، تو وہ اس کے حق کے ساتھ دونوں صفوں کے درمیان اکڑ کر چلے، تو رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) نے ان کی اکڑ کو دیکھتے ہوئے فرمایا: \"یہ وہ چال ہے جسے اللہ اور اس کا رسول ناپسند کرتے ہیں، سوائے اس موقع کے۔\"\n\nاسی لیے رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) کی چال میں تیزی تھی، گویا آپ ڈھلوان میں اتر رہے ہوں۔ پس صاحب تدبیر امور کو عالم شہادت میں ظاہر کرنے سے پہلے ان پر غور کرتا ہے، پس اس کے لیے عالم غیب میں تصرف ہے۔ پس وہ معانی میں سے صرف وہی لیتا ہے جو حکمت کا تقاضا ہو۔ پس هُوَ الْحَكِيمُ الْخَبِيرُ (وہ حکیم ہے، باخبر ہے)۔ پس جو چیز اسے اجمالی طور پر ظاہر کرنی چاہیے، وہ اسے اجمالی طور پر ظاہر کرتا ہے، اور جو چیز اسے تفصیلی طور پر ظاہر کرنی چاہیے، وہ اسے تفصیلی طور پر ظاہر کرتا ہے، اور جو چیز اسے محکم (واضح) طور پر ظاہر کرنی چاہیے، وہ اسے محکم طور پر ظاہر کرتا ہے، اور جو چیز اسے متشابہ (مبہم) طور پر ظاہر کرنی چاہیے، وہ اسے متشابہ طور پر ظاہر کرتا ہے۔\n\n**پانچویں خصلت:** تفصیل (التفصیل)، اور یہ ان چیزوں کے علم کا نام ہے جن سے چیزوں کے درمیان امتیاز واقع ہوتا ہے، ان چیزوں سے جن میں اشتراک واقع ہوتا ہے، پس ہر امر اپنے مماثل، اپنے مقابل اور اپنے خلاف سے الگ ہو جاتا ہے۔ اور وہ قریب المشابہ الٰہی اسماء کی طرف آتا ہے، جیسے العلیم (جاننے والا)، الخبیر (باخبر)، المحصی (شمار کرنے والا)، المحیط (احاطہ کرنے والا)، اور الحکیم (حکمت والا)، یہ سب علم کے اسماء ہیں اور العلیم کے معنی میں ہیں، مگر ہر ایک اور دوسرے کے درمیان ایک باریک نکتہ اور حقیقت ہے جس سے وہ باقی سے ممتاز ہوتا ہے۔ اسی طرح ہر اس اسم میں ہوتا ہے جس میں دوسرے کے ساتھ شراکت ہو۔\n\n**چھٹی:** عدل (العدل)، اور یہ وہ امر ہے جو حکومتوں، تقسیموں، فیصلوں اور حقوق کو ان کے اہل تک پہنچانے میں استعمال ہوتا ہے۔ اور یہ حقوق میں اس چیز سے مشابہ ہے جو اللہ نے اپنے بارے میں ذکر کیا کہ اس نے أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ (ہر چیز کو اس کی خلقت عطا کی) اور موسیٰ کے بارے میں اس کا قول: قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ (ہر گروہ نے اپنا گھاٹ جان لیا) اور صالح کی اونٹنی کے بارے میں اس کا قول: لَها شِرْبٌ وَلَكُمْ شِرْبُ يَوْمٍ مَعْلُومٍ (اس کے لیے پانی پینے کا ایک حصہ ہے اور تمہارے لیے ایک مقررہ دن کا حصہ ہے)۔ اور اس سے دونوں جہانوں میں جزا کا علم اور جرم، حد اور تعزیر کے درمیان عدل کا علم متعلق ہے۔\n\n**ساتویں:** ادب (الأدب)، اور یہ ہر عالم میں تمام خیرات کے جامع ہونے کا علم ہے۔ اور یہ وہ علم ہے جو اسے بساط میں حاضر کرتا ہے اور اسے ہم نشینی، شہود (الشہود)، مکالمہ، مسامرہ (رات کی گفتگو)، حدیث اور خلوت عطا کرتا ہے، اور مواطن میں ذات حق (الحق) کے نفس میں موجود جلوہ کے ساتھ معاملہ کرنا۔ پس یہ اور اس کی مثالیں ادب ہیں۔\n\n**آٹھویں:** رحمت (الرحمة)، اور اس کا تعلق ہر کمزور اور ہر جبار سے ہے، پس وہ اپنی رحمت اور لطف سے اسے اس کی جبروت، کبریائی اور عظمت سے نرمی، شفقت اور دل کی گہرائی سے کم سے کم مشقت کے ساتھ نیچے اتارتا ہے۔\n\n**نویں:** حیاء (الحياء)، پس وہ جھوٹے سے جھوٹ کے بارے میں حیاء کرتا ہے اور اس کے سامنے اس شخص کی صورت میں ظاہر ہوتا ہے جو اپنے قول میں سچا ہو، وہ اس کے سامنے اس شخص کی صورت میں ظاہر نہیں ہوتا جو اس سے آنکھیں چرا لے، یہاں تک کہ جھوٹا یہ اعتقاد کر لے کہ اس کی بات چل گئی ہے اور وہ اس کے مقام اور اس چیز سے جاہل ہے جو وہ لایا ہے۔ پس وہ اپنے کام میں ذلیل ہوتا ہے، پھر قیامت کے دن موقف اور سوال کے وقت اس کے حق میں اس کے رب کے نزدیک صرف خیر کا واسطہ ہوتا ہے، جو اس کے اور اللہ کے درمیان تجاوز کی دعا کرتا ہے۔\n\nاور حدیث میں آیا ہے کہ اللہ قیامت کے دن ایک بوڑھے کو بلائے گا اور اس سے پوچھے گا: \"تم نے کیا کیا؟\" تو وہ مقربات میں سے جو اللہ چاہے گا، وہ کہے گا، حالانکہ اللہ جانتا ہے کہ وہ اپنے قول میں جھوٹا ہے۔ پس اللہ اسے جنت میں داخل کرنے کا حکم دے گا۔ تو فرشتے کہیں گے: \"اے رب! اس نے جو دعویٰ کیا اس میں جھوٹ بولا ہے۔\" تو ذات حق (الحق) فرمائے گا: \"میں یہ جانتا تھا، لیکن مجھے اس کی سفیدی سے حیاء آئی کہ میں اسے جھٹلاؤں۔\"\n\nاور رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) نے یہ خبر اللہ کی طرف سے ہم تک صرف اس لیے پہنچائی تاکہ ہم اس صفت پر ہوں، پس ہم اس کے زیادہ حقدار ہیں کیونکہ ہمیں اس کی ضرورت ہے کہ ذات حق (الحق) ہمارے ساتھ اس طرح معاملہ کرے۔\n\n**دسویں:** اصلاح (الإصلاح)، اور اس میں سب سے عظیم اصلاح ذات البین (آپس کے تعلقات کی اصلاح) ہے۔ اور یہ اللہ تعالیٰ کا قول ہے: وَأَصْلِحُوا ذاتَ بَيْنِكُمْ (اور اپنے آپس کے تعلقات کی اصلاح کرو)۔ اور حدیث میں آیا ہے کہ اللہ قیامت کے دن اپنے بندوں کے درمیان اصلاح کرے گا، پس ظالم اور مظلوم کو حکومت اور انصاف کے لیے اپنے سامنے کھڑا کرے گا، پھر ان دونوں سے کہے گا: \"اپنے سر اٹھاؤ۔\" تو وہ بہت زیادہ خیر دیکھیں گے، پس وہ کہیں گے: \"اے رب! یہ خیر کس کے لیے ہے؟\" تو اللہ ان دونوں سے فرمائے گا: \"اس کے لیے جس نے مجھے اس کی قیمت ادا کی۔\" تو مظلوم کہے گا: \"اے رب! اس کی قیمت کون ادا کر سکتا ہے؟\" تو اللہ اس سے فرمائے گا: \"تم نے اپنے بھائی کو معاف کر کے۔\" تو مظلوم کہے گا: \"اے رب! میں نے اسے معاف کر دیا۔\" تو اللہ اس سے فرمائے گا: \"اپنے بھائی کا ہاتھ پکڑو اور جنت میں داخل ہو جاؤ۔\" پھر رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) نے تلاوت کی: فَاتَّقُوا الله وَأَصْلِحُوا ذاتَ بَيْنِكُمْ (پس اللہ سے ڈرو اور اپنے آپس کے تعلقات کی اصلاح کرو)، کیونکہ اللہ قیامت کے دن اپنے بندوں کے درمیان اصلاح کرے گا۔\n\nاور بارہ قطبوں میں سے دوسرا قطب خلیل ابراہیم علیہ السلام کے قدم پر ہے۔\n\nاور یہی وہ ہے جس کے لیے سورة الإخلاص (سورہ اخلاص) ہے، جس کی محبت نے اسے جنت میں داخل کیا، اور اس کے پڑھنے والے کے لیے تہائی قرآن کا ثواب ہے۔ اور اس کے لیے اس کی آیات کی تعداد کے مطابق منازل ہیں۔ اور وہ حجت (دلیل) اور نظری دلیل کا صاحب ہے، اس کے لیے معقولات میں غور و خوض ہوتا ہے، پس وہ درست ہوتا ہے اور غلطی نہیں کرتا۔\n\nاور یہ اس لیے ہے کہ لوگ موہوب علم کے بارے میں اختلاف رکھتے ہیں، جس کی شان یہ ہے کہ عاقل اسے اپنی فکر سے حاصل کرے اور نظری دلیل اسے اس تک پہنچائے۔ بعض نے کہا کہ ایسا علم جب اللہ کسی کو عطا کرتا ہے تو اسے اس کی دلیل کے ساتھ عطا کرتا ہے، پس دلیل اور مدلول دونوں کا علم ضروری ہے۔ اور میں نے ابو عبداللہ کتانی کو فاس شہر میں دیکھا، جو اصول دین اور فقہ میں مسلمانوں کے ائمہ میں سے تھے، وہ اس قول کے قائل تھے، تو میں نے ان سے کہا: \"یہ آپ کا ذوق (الذوق) ہے، ذات حق (الحق) نے آپ کو اسی طرح عطا کیا ہے، پس آپ کا ذوق صحیح ہے اور آپ کا حکم صحیح نہیں ہے۔\" بلکہ اللہ اسے وہ علم عطا کر سکتا ہے جو صرف نظری دلیل سے حاصل ہوتا ہے اور اسے اس کی دلیل عطا نہیں کرتا۔ اور بسا اوقات اسے وہ علم اور اس کی دلیل دونوں عطا کرتا ہے، جیسے ابراہیم خلیل، اللہ تعالیٰ نے فرمایا: وَتِلْكَ حُجَّتُنَا آتَيْنَاهَا إِبْرَاهِيمَ عَلَى قَوْمِهِ (اور یہ ہماری دلیل تھی جو ہم نے ابراہیم کو اس کی قوم کے مقابلے میں عطا کی)۔ اور وہ اس شخص سے زیادہ کامل ہے جسے وہ علم دیا جاتا ہے جو دلیل سے حاصل ہوتا ہے مگر دلیل نہیں دی جاتی۔ اور کوئی بھی کسی دلیل کو کسی دلیل سے خاص کرنے کی شرط نہیں لگاتا، بلکہ اسے اجمالی طور پر ایک دلیل دی جاتی ہے، کیونکہ ایک ہی چیز پر دلائل بہت ہو سکتے ہیں، اور ان میں سے بعض انتہائی واضح ہوتے ہیں اور بعض مبہم، جیسے ابراہیم خلیل کا مسئلہ مردوں کو زندہ کرنے اور زندوں کو مارنے کے بارے میں، اور ان کا سورج کو مشرق سے لانے کے بجائے خصم سے مغرب سے لانے کا مطالبہ، اور یہ دونوں مقصود پر دلیل ہیں۔\n\nیہ قطب الٰہی حکم کے ذریعے اللہ کی طرف دعوت دینے والوں میں سے ہے۔ اور اس کا مسکن ہوا میں، فضا کے خلا میں ایک کرسی پر بیٹھا ہوا گھر ہے، جو مخلوق پر نظر رکھتا ہے۔ اس کے پاس اہل اللہ اور اس کے خواص کی ایک جماعت ہمیشہ تلاوت کرتی رہتی ہے۔ اس کی گفتگو الٰہی احدیت (الأحدية الإلهية) میں، واحد کی احدیت میں اور وحدانیت کی احدیت میں نظری دلائل کے ساتھ ہوتی ہے۔ اور اس نے یہ دلائل نظر سے حاصل نہیں کیے، بلکہ ذات حق (الحق) نے اسے اسی طرح عطا کیے ہیں۔\n\nاور اس کا حال ہمیشہ حضور (الحضور) کا ہے، مگر اس نے اس طرح حیرانی نہیں کی جس طرح دوسروں نے کی، بلکہ اللہ نے اس کے لیے وہ چیز واضح کر دی جہاں وہ ٹھہر گیا، اور اس کے دل کو اس چیز میں مشغول نہیں کیا جو اس کے نزدیک حیرانی کا سبب بنے۔ وہ لوگوں کی ضروریات پوری کرنے کے لیے اللہ کے ساتھ فارغ ہے۔ وہ الٰہی اسماء کی کامل معرفت رکھتا ہے۔ وہ ذات حق (الحق) کے پہلو میں مماثلت کی نفی کا قائل ہے۔\n\nذات حق (الحق) نے مجھے اس طریقے سے خبر دی جس سے وہ اپنے بندوں کو ان کے اسرار میں خبر دینے کا عادی ہے کہ اس بندے کو اپنے بندوں کے لیے رحمت اور اپنے رشتہ داروں کے لیے صلہ رحمی عطا کی گئی ہے۔ پس اس نے ایک معاملے میں اللہ سے سوال کیا، تو اللہ نے اسے جواب نہیں دیا، اور وہ یہ تھا کہ اس نے سوال کیا کہ اس کا مقام اس کی اولاد کو وراثت میں ملے۔ تو اللہ نے اس سے فرمایا: \"یہ تمہارے اختیار میں نہیں ہے۔ خلافت کا مقام وراثت میں نہیں ہوتا، یہ علوم اور اموال میں ہوتا ہے۔ اور رہی خلافت، تو ہر خلیفہ اپنے زمانے کے لوگوں کے مطابق ہوتا ہے، کیونکہ لوگ اپنے زمانے میں اپنے آباؤ اجداد سے زیادہ مشابہ ہوتے ہیں۔\" کیونکہ ذات حق (الحق) اس پر کسی مخلوق کو حکم نہیں دیتا مگر علم اور خلق میں۔\n\nاور یہ مرتبہ صرف وہی جانتا ہے جسے اللہ اس سے آگاہ کرے۔ اور میں نے دیکھا کہ جس پر اللہ نے میری صحبت سے کشف (الکشف) کھولا اور اس نے احوال اور علوم حاصل کیے اور عادات کو توڑا، اللہ نے اسے یہ سب اللہ کے ساتھ اس کے حسن سلوک کی وجہ سے عطا کیا۔ اور اس نے مجھے خبر دی کہ اس نے جو کچھ حاصل کیا ہے وہ مجھ ہی سے حاصل کیا ہے، حالانکہ مجھے اس کا علم نہیں ہے۔ میں تو صرف اللہ کی طرف دعوت دیتا ہوں، اور اللہ جانتا ہے کہ کون جواب دیتا ہے۔ يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ قالُوا لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ (جس دن اللہ رسولوں کو جمع کرے گا، پھر فرمائے گا: تمہیں کیا جواب دیا گیا؟ وہ کہیں گے: ہمیں کوئی علم نہیں، بے شک تو ہی غیبوں کا خوب جاننے والا ہے)۔ اور انہوں نے سچ کہا۔ اور معاملہ ایسا ہی ہے، کسی کو کوئی علم نہیں مگر جسے اللہ سکھائے۔ اور تعلیم کے اس الٰہی طریقے کے علاوہ جو کچھ ہے، وہ صرف غلبہ ظن ہے یا علم کا اتفاق یا وہم پر یقین، اور علم نہیں ہے۔ کیونکہ علم تک پہنچنے والے تمام طریقوں میں شبہات ہیں، جن پر وہ پاکیزہ نفس بھروسہ نہیں کرتا جسے اللہ نے ان شبہات پر مطلع کیا ہے کہ وہ ان سے علم کے حصول کا یقین کر لے، سوائے الٰہی طریقے کے، اور وہ اللہ تعالیٰ کا قول ہے: إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً (اگر تم اللہ سے ڈرو گے تو وہ تمہارے لیے فرقان (حق و باطل میں تمیز) بنا دے گا) اور اس کا قول: خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ (اس نے انسان کو پیدا کیا، اسے بیان سکھایا)۔ پس وہ اپنے نفس میں موجود چیزوں کو بیان کرتا ہے۔ اور اس قطب کے لیے عجیب اسرار ہیں۔\n\n### [تیسرا قطب جو موسیٰ علیہ السلام کے قدم پر ہے]\n\nاور رہا تیسرا قطب، جو موسیٰ علیہ السلام کے قدم پر ہے، تو اس کی سورت إِذا جاءَ نَصْرُ الله والْفَتْحُ (سورہ نصر) ہے، اور اس کے منازل اس کی آیات کی تعداد کے مطابق ہیں، اور اس کے لیے چوتھائی قرآن ہے۔ یہ قطب اوتاد (الأوتاد) میں سے تھا، پھر قطبیت کی طرف منتقل ہوا، جیسا کہ دوسرا قطب ائمہ میں سے تھا، پھر قطبیت کی طرف منتقل ہوا۔\n\nوہ کوشش اور مجاہدے کا صاحب ہے، وہ اللہ کے نزدیک مخلوق کے ساتھ مشغولیت سے کبھی جدا نہیں ہوتا۔ اللہ نے اسے مقام نداء (النداء) میں ایک ہی رات میں ذوق (الذوق) کے بارہ ہزار علوم عطا کیے۔ اور مقام نداء (النداء) عظیم ترین مقامات میں سے ہے، جسے ہم نے اس کتاب میں منزل المنازل میں متعین کیا ہے، اور ہمارے لیے اس میں ایک الگ حصہ ہے، یعنی منازل کے طبقات اور ان کی مقداروں کے بارے میں۔\n\nپس اس قطب کے علوم میں سے ایک علم الافتقار إلی اللہ باللہ (اللہ کے ذریعے اللہ کی طرف محتاجی کا علم) ہے۔ اور یہ ایک شریف علم ہے، میں نے اس کا ذائقہ چکھنے والا کوئی نہیں دیکھا سوائے اس کے جو میں نے چکھا۔ اور اس کا معنی اور راز یہ ہے کہ اللہ نے اسے اس بات پر مطلع کیا کہ:\n\nممکنات کی ہستیوں میں تاثیر کے لیے اسماء (الأسماء) کی ضرورت، ممکنات کی اس تاثیر کے ظاہر ہونے کی ضرورت سے زیادہ عظیم ہے۔ اور یہ اس لیے ہے کہ اسماء (الأسماء) کے لیے اپنی تاثیر کے ظہور میں سلطنت اور عزت ہے، اور ممکنات میں بسا اوقات ایسی تاثیر ظاہر ہوتی ہے جس سے انہیں نقصان پہنچتا ہے، اور بسا اوقات انہیں فائدہ ہوتا ہے، اور وہ خطرے میں ہیں۔ اگر انہیں اختیار دیا جاتا تو عدم کی حالت پر باقی رہنا انہیں زیادہ پسند ہوتا۔ کیونکہ وہ ثبوتی مشاہدے کی حالت میں ہیں، ایک ثبوتی لذت سے لطف اندوز ہو رہے ہیں، ہر حالت دوسری حالت سے الگ تھلگ ہے، ثبوت کی حالت میں ایک ہی ہستی تمام احوال کو جمع نہیں کرتی۔ کیونکہ وہ وجود (الوجود) کی شیئیت میں ایک ہی ہستی میں ظاہر ہوتی ہیں۔ پس زید، مثال کے طور پر، ایک وقت میں صحیح ہے، وہی دوسرے وقت میں بیمار ہے، اور ایک وقت میں عافیت والا ہے، وہی اپنے اس وقت میں مبتلا ہے۔ اور ثبوت میں ایسا نہیں ہے، کیونکہ ثبوت میں درد، درد محسوس کرنے والے کی ہستی میں نہیں ہے، بلکہ اس کی اپنی ہستی میں ہے، پس وہ اپنے ثبوت سے لذت حاصل کر رہا ہے، جیسا کہ وہ درد محسوس کرنے والے میں اپنے وجود (الوجود) سے لذت حاصل کر رہا ہے، اور محل اس سے تکلیف میں ہے۔\n\nاور اس کی وجہ یہ ہے کہ ثبوت بسیط (سادہ) اور مفرد ہے، کوئی چیز کسی چیز کے ساتھ قائم نہیں ہے۔ اور وجود (الوجود) میں صرف ترکیب ہے، پس حامل (اٹھانے والا) اور محمول (اٹھایا جانے والا) ہے۔ پس محمول ہمیشہ وجود (الوجود) میں اس کا مقام وہی ہے جو ثبوت میں ہے، دائمی نعمت میں، اور حامل ایسا نہیں ہے۔ کیونکہ اگر محمول لذت کا سبب ہو تو حامل لذت محسوس کرتا ہے، اور اگر وہ درد کا سبب ہو تو حامل تکلیف محسوس کرتا ہے۔ اور ثبوت کی حالت میں اس کے لیے ایسا نہیں تھا۔ بلکہ حامل ہستی اپنے ثبوت میں اس صورت میں ظاہر ہوتی ہے جس پر وہ اپنے وجود (الوجود) میں ہو گی، لامتناہی تک۔ پس ہر حال جس پر وہ ہو گی، وہ اس کے پہلو میں ہو گی، اسے دیکھ رہی ہو گی، اس میں کوئی محمول نہیں ہو گا۔ پس ہستی اپنی ذات سے لذت حاصل کر رہی ہے اور حال اپنی ذات سے لذت حاصل کر رہا ہے۔ پس احوال کا حال وجود (الوجود) سے اپنا ذوق نہیں بدلتا، اور حامل کا حال وجود (الوجود) سے بدل جاتا ہے۔\n\nاور یہ ایک عزیز علم ہے، اور ہستیاں ثبوت میں یہ نہیں جانتی ہیں مگر حال کے ان کی طرف دیکھنے سے، لیکن وہ یہ نہیں جانتی کہ جب وہ اسے اٹھائے گی تو اس سے تکلیف محسوس کرے گی، کیونکہ وہ ایک ایسی حضوری میں ہے جہاں وہ تکلیفوں کا ذائقہ نہیں جانتی، بلکہ اسے اپنا ساتھی بنا لیتی ہے۔ اگر ہستی جانتی کہ جب وہ اس حال سے متصف ہو گی تو اسے تکلیف ہو گی، تو وہ ثبوت کی حالت میں اس کے دیکھنے سے تکلیف محسوس کرتی، کیونکہ وہ جانتی کہ وہ وجود (الوجود) کی حالت میں اس سے متلبس ہو گی اور اسے اٹھائے گی۔ پس ثبوت میں اس سے اس کی الفت اس کے لیے نعمت ہے۔\n\nاور یہ فن اللہ کے اشیاء میں سب سے بڑے اسرار میں سے ہے، میں نے اسے الٰہی ذوق (الذوق) سے مشاہدہ کیا، کیونکہ اللہ کے بندوں میں سے بعض کو اللہ کشف (الکشف) کے ذریعے ثبوتی ہستیوں پر مطلع کرتا ہے، پس وہ انہیں اس صورت میں دیکھتے ہیں جو ہم نے مجاورت اور نظر کے بارے میں ذکر کی، وہ ان میں کوئی حال اور نہ کوئی محل دیکھتے ہیں۔\n\nبلکہ ہر ذات تنہا ہے، بغیر کسی ملاوٹ اور نہ اتحاد کے۔\nاور نہ حلول ہے، نہ انتقال، نہ اتفاق ہے اور نہ عناد۔\n\nپس جب آپ وجود (الوجود) اور ثبوت کے درمیان فرق کو سمجھ لیں گے، اور جو احکام ہستیوں کے لیے وجود (الوجود) میں ہیں اور جو ثبوت میں ہیں، تو آپ جان لیں گے کہ بعض ہستیاں حال کے ذریعے ان میں تاثیر کا ظہور نہیں چاہتیں، ان کے لیے اس میں کوئی ذوق (الذوق) نہیں ہے۔ پس اگر انہیں ثبوت کی حالت میں درد کا ذوق پیش کیا جاتا تو وہ چیخ اٹھتیں۔ کیونکہ وجود (الوجود) کی حالت میں ان کا معاملہ یہ ہے کہ جب وہ درد اٹھاتی ہیں تو بسا اوقات صبر اٹھاتی ہیں اور بسا اوقات نہیں اٹھاتیں۔ اور ہم نے فرض کیا کہ وہ ثبوت کی حالت میں حامل ہیں اور صبر سے محروم ہیں۔ پس ان کے لیے لسان حال سے وجود (الوجود) کے طلب کی وہ محتاجی نہیں ہے، اگرچہ وہ اللہ سے ثبوتی قول سے طلب کرتی ہیں۔ پس جب وہ وجود پاتی ہیں تو کہتی ہیں، جیسا کہ بعض سے نقل کیا گیا ہے: \"کاش میں پیدا نہ ہوتی، کاش عمر کو اس کی ماں نے نہ جنا ہوتا، کاش وہ بانجھ ہوتی۔\" اور اس طرح کی مثالیں۔ پس ہستیاں اسماء (الأسماء) سے کم محتاج ہوتی ہیں، اور اسماء زیادہ محتاج ہوتی ہیں کیونکہ ان کے لیے اس میں نعمت ہے، خاص طور پر جب وہ ذات حق (الحق) سے کمال کے ذریعے ذاتی خوشی کا مشاہدہ کرتی ہیں، اس لحاظ سے کہ ممکنات کو ان کے ثبوت میں اپنی ذات کے ساتھ رکھنا، اور یہ کہ وہ ان کی تاثیر اور ان کے سبب سے متاثر ہونے سے پاک ہے۔ پس وہ اپنی ذات کے لحاظ سے ہستیوں کے ثبوت اور ان کے وجود (الوجود) کی حالت میں متاثر ہونے سے کمال میں ہے۔ کیونکہ اس نے اپنے نفس میں اس چیز کا علم نہیں بڑھایا جو ان میں نہیں تھی، کیونکہ انہوں نے اسے ازل میں اپنی شان کا علم دیا، اور اسی صورت میں وہ موجود ہوتی ہیں۔ پس ثبوت میں مجاورت وجود (الوجود) میں حلول ہے۔ پس ثبوت میں اس کے پہلو میں ہے اور وجود (الوجود) میں اس میں حال ہے۔ پس یہ ان علوم میں سے ایک علم ہے، پس یہ جان لو۔\n\n### [چوتھا قطب جو عیسیٰ علیہ السلام کے قدم پر ہے]\n\nاور رہا چوتھا قطب جو عیسیٰ علیہ السلام کے قدم پر ہے، تو قرآن میں اس کی سورت قُلْ يا أَيُّهَا الْكافِرُونَ (کہہ دیجیے اے کافرو) ہے، اور اس کے لیے چوتھائی قرآن ہے، اور اس کے منازل اس کی آیات کی تعداد کے مطابق ہیں۔ یہ قطب محفوظ خزانوں (الضنائن المصانین) میں سے ہے، اس کے لیے دائمی ظہور الٰہی (التجلی) ہے۔ اس کی گفتگو جمع (الجمع) اور ہستی (الوجود) کے بارے میں ہے، اور علم مزید کے بارے میں۔ جب وہ کسی میں کوئی شبہ دیکھتا ہے جو اس کے اور علم کے درمیان حائل ہوتا ہے تو اسے دور کر دیتا ہے، یہاں تک کہ اس معاملے میں حق کی صورت اس کے صاحب کے لیے واضح ہو جائے۔ اس کے لیے چھ سو مقام کی چابیاں ہیں، ہر مقام میں اللہ کے چاہے ہوئے علوم ہیں۔\n\nاس کے لیے اعتدالی امتزاج اور ترکیب کا علم ہے، وہ انحراف، کمی اور زیادتی کو نہیں جانتا۔ اس کا مسکن قبة آرین میں ہے، مخلوق سے منقطع ہے سوائے اس کے جسے اللہ چاہے۔ وہ اللہ کے ساتھ پاکیزہ زندگی گزارا یہاں تک کہ اللہ نے اسے وفات دی۔ اور وہ بھی اوتاد (الأوتاد) میں سے تھا، پھر قطبیت کی طرف منتقل ہوا۔\n\nوہ کہتا ہے کہ ہستی (الوجود) ذات حق (الحق) کی ہستی (الوجود) ہے، اور جمع (الجمع) ذات حق (الحق) کا جمع ہے۔ قدم (قدیم) اور حدوث (حادث) کی صفات۔ اور یہ جمع میں ایک عجیب علم ہے، میں نے اہل اللہ میں سے اس قطب کے علاوہ کسی کو اس کا قائل نہیں دیکھا، کیونکہ میں نے ان قطبوں کا مشاہدہ کیا ہے، ذات حق (الحق) نے مجھے ان کا مشاہدہ کروایا، اگرچہ وہ دنیا سے جا چکے ہیں۔ اور یہ وہ علم ہے جو ذات حق (الحق) کے پہلو میں شریعتوں میں آیا ہے، پس ہم کہتے ہیں کہ وہ جمع (الجمع) ہے۔ اور اس کے نزدیک محدث (حادث) ان صفات میں دعویٰ کرنے والا ہے جنہیں محدث کہا جاتا ہے، اور اس کے دعوے کی وجہ سے ہم نے کہا کہ یہ جمع ہے، ورنہ معاملہ ایک ہی ہے، یہ سب قدیم میں قدم کی صفات ہیں اور محدث میں محدث ہیں، کیونکہ ان کا اس میں ظہور ہوا اور وہ ظاہر نہیں تھیں، پس متصف ہونے والے کے نزدیک وہ حادث ہوئیں، جیسا کہ فرمایا: ما يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ (ان کے رب کی طرف سے ان کے پاس کوئی نئی نصیحت نہیں آتی)۔ حالانکہ وہ صرف اللہ کا قدیم کلام ہے۔ پس ہم نے اس پر وہ جمع کیا جو اس کے لیے ہے، اس کی ہماری طرف نسبت کے ساتھ، پس جس نے یہ کیا اسے صاحب جمع اور وجود (الوجود) کہا گیا۔ پس حکم دیا گیا کہ ممکنات کا وجود (الوجود) ذات حق (الحق) کا وجود (الوجود) ہے، اور کوئی نہیں۔ پس جس نے جمع (الجمع) کو اس طرح سمجھا، اس نے امور کو جان لیا کہ وہ کیسے ہیں۔\n\nجس نے جمع کو اس طرح جانا، اس نے امر کو جان لیا کہ وہ کیسا ہے۔\nپس وہ ذات حق (الحق) ہے، اس کے سوا کوئی نہیں، پس اسے نہ سنو۔\n\n### [پانچواں قطب جو داؤد علیہ السلام کے قدم پر ہے]\n\nاور رہا پانچواں قطب جو داؤد علیہ السلام کے قدم پر ہے، تو قرآن میں اس کی سورت إِذا زُلْزِلَتِ (سورہ زلزال) ہے، اور اس کے لیے نصف قرآن ہے، اور اس کے منازل اس کی آیات کی تعداد کے مطابق ہیں۔ اور اس کا حال تفرقہ (التفرقة) ہے۔ اور اس کے لیے محبت (المحبة) کا مقام ہے۔ پس وہ محبت کا مریض ہے، اس کی بیماری ہی اس کی دوا ہے۔ اور اس کے لیے کوئی ایسا علم نہیں ہے جس میں وہ دوسروں پر سبقت لے جائے سوائے الٰہی اور کونی محبت کے ثبوت کے علم کے۔ اور اسی لیے وہ تفرقہ (التفرقة) کے مقام پر تھا۔ اور وہ ائمہ میں سے تھا، پھر قطبیت کی طرف منتقل ہوا۔\n\nیہ قطب کہتا ہے کہ محبت (الحب) ثابت نہیں ہوئی، اور ہر وہ محبت جو زائل ہو جائے وہ محبت نہیں ہے، یا جو بدل جائے وہ محبت نہیں ہے، کیونکہ محبت کی سلطنت اس سے عظیم ہے کہ کوئی چیز اسے زائل کر دے، یہاں تک کہ غفلت جو انسان پر سب سے بڑی حکمران سلطنت ہے، وہ بھی محب سے محبت کو زائل نہیں کر سکتی۔ اس کے نزدیک یہ ممکن ہے کہ انسان اپنے محبوب کی وجہ سے اپنے آپ سے غافل ہو جائے، لیکن محب کے لیے یہ ممکن نہیں کہ وہ کسی اور کی وجہ سے اپنے محبوب سے غافل ہو جائے۔ پس وہی محب ہے اور وہی محبت ہے۔\n\nمحبت کی بیماری وہ ہے جو زائل نہ ہو، اور اس کی شفا محال ہے۔\nپس اس کے سوا کسی اور پر بھروسہ نہ کرو، اور جو وہ کہے اس پر کان نہ دھرو۔\n\nپس اللہ کی محبت سے ہم نے اللہ سے محبت کی، اور ذات حق (الحق) کی محبت نہیں بدلتی، پس کون کی محبت نہیں بدلتی۔ اس سے کہا گیا: \"تو کیا کون کی محبت بدل جاتی ہے؟\" اس نے کہا: \"نہیں، کیونکہ کون اپنی ذات کے لیے محبوب ہے، اور ذاتی محبت کا زوال ممکن نہیں ہے۔\" اس سے کہا گیا: \"ہم نے تو ایسے لوگوں کو دیکھا ہے جن کی محبت بدل جاتی ہے۔\" تو اس نے کہا: \"وہ ارادہ (الإرادة) ہے، محبت نہیں، کیونکہ اگر وہ محبت ہوتی تو ثابت رہتی۔ کیا تم نہیں دیکھتے کہ اسے ود (ود) کہا جاتا ہے اس کے ثبوت اور اس کے حکم کے ثبوت کی وجہ سے؟\" اور یہ اس لیے ہے کہ محب میں اپنے محبوب کے علاوہ کسی اور کے لیے اس کی ذات کا کوئی فضلہ نہیں ہوتا کہ زائل کرنے والا اس میں سے داخل ہو سکے۔ یہ اس کے ثبوت کا سبب ہے۔ کیونکہ وہ ہر اس چیز میں اپنے محبوب کی ہستی (عین) کا مشاہدہ کرتا ہے جسے وہ دیکھتا ہے، پس وہ اسے کھوتا نہیں ہے۔ اگر محب کے لیے یہ صحیح ہوتا کہ وہ کسی چیز میں اپنے محبوب کے علاوہ کسی اور کا مشاہدہ کرے، تو اس میں وہ چیز داخل ہو جاتی جو اس کی محبت کو زائل کر دیتی، اور یہ محبت میں واقع نہیں ہے۔ پس اس شخص پر ارادے کا حکم محبت کے حکم سے مشتبہ ہو گیا جس کا یہ حال ہے۔ اور ہر ارادہ کرنے والا محب نہیں ہوتا، اور ہر محب ارادہ کرنے والا ہوتا ہے۔ اور ہر مراد محبوب نہیں ہوتا، اور ہر محبوب مراد ہوتا ہے۔ پس اس قطب کا مقام وہی ہے جو ہم نے ذکر کیا، اور اس کی شان عجیب ہے، اور اس کے حال کی تفصیل طویل ہے، اور ہمارا مذہب اختصار ہے۔\n\n### [چھٹا قطب جو سلیمان علیہ السلام کے قدم پر ہے]\n\nاور رہا چھٹا قطب جو سلیمان علیہ السلام کے قدم پر ہے، تو اس کی سورت الواقعة (سورہ واقعہ) ہے، اور اس کے لیے حیات دائمی (الحياة الدائمة) ہے، اور اس کے منازل اس کی آیات کی تعداد کے مطابق ہیں۔ وہ علم حیات اور حیوانات کے ساتھ خاص ہے۔ وہ اپنے احوال میں سے کوئی حال اپنے رب کے سوا کسی سے نہیں لیتا۔ پس اس کے احوال اس کے رب کے احوال ہیں۔ اس کی ہدایت انبیاء کی ہدایت ہے، جیسا کہ اللہ نے اپنے نبی (صَلَّى اللهُ عَليهِ وسَلَّم) کو حکم دیا جب اس نے ان کے لیے انبیاء علیہم السلام کا ذکر کیا، فرمایا: أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ (یہ وہ لوگ ہیں جنہیں اللہ نے ہدایت دی، پس آپ ان کی ہدایت کی پیروی کیجیے)۔ اور یہ نہیں فرمایا کہ ان کی پیروی کیجیے۔ پس ہم نے جانا کہ محمد (صَلَّى اللهُ عَليهِ وسَلَّم) ان تمام انبیاء کے برابر ہیں جن کا ذکر کیا اور جن کا ذکر نہیں کیا۔ کیونکہ ہر نبی کے لیے ہدایت ہے، جیسا کہ فرمایا: لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً وَمِنْهاجاً (تم میں سے ہر ایک کے لیے ہم نے ایک شریعت اور ایک طریقہ مقرر کیا)۔ پس وہ سبحانہ و تعالیٰ نے شریعتیں مقرر کیں اور طریقے واضح کیے، اور یہ سب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) میں جمع کر دیا۔ پس جس نے آپ کو دیکھا اس نے تمام مقربین کو دیکھا، اور جس نے آپ کی ہدایت کی پیروی کی اس نے تمام نبیوں کی ہدایت کی پیروی کی۔\n\nاور اللہ پر یہ کوئی انوکھی بات نہیں\nکہ وہ عالم کو ایک میں جمع کر دے۔\n\nاور میرے اس قول سے کہ اس قطب کے احوال اس کے رب کے احوال ہیں، میری مراد وہ ہے جو ذات حق (الحق) نے اپنے بارے میں فرمایا کہ وہ كُلَّ يَوْمٍ فِي شَأْنٍ (ہر دن ایک نئی شان میں) ہے۔ پس یہ احوال کے اختلاف کا اظہار ہے۔ پس وہ ان لوگوں میں سے ہے جو ذات حق (الحق) کو اس کی شانوں میں مشاہدہ کرتے ہیں، پس وہ ان شانوں کو دیکھتے ہیں جو ان میں اس کے لیے ہیں، پس وہ ان سے اس کی طرف سے متلبس ہوتے ہیں۔ پس وہ اپنے احوال پر بصیرت پر ہیں۔ پس جس کا یہ حال ہو، وہ اس شخص کی طرح نہیں ہے جس کا حال الٰہی اسماء سے متخلق ہونا ہے۔ بلکہ اس کے لیے ایک ذوق (الذوق) ہے اور اس کے لیے ایک ذوق (الذوق) ہے۔\n\nپس ایسا شخص حال میں مجہول ہوتا ہے، کیونکہ ذات حق (الحق) کے مواقع پوشیدہ ہیں، انہیں صرف وہی جانتا ہے جس کا مقام شانوں سے متلبس ہونا ہو۔ اور اس کی دلیل یہ ہے کہ ہم نے اس بات پر اتفاق کیا ہے کہ اللہ کے سوا کوئی خالق نہیں ہے، اور وہ حکیم ہے جو امور کو ان کے مواقع پر رکھتا ہے اور انہیں ان کے مقام سے تجاوز نہیں کرنے دیتا۔ پس عالم میں جو کچھ بھی ظاہر ہوا ہے، وہ اپنے مقام پر حکمت ہے۔ اور ہم نے اس بات پر اتفاق کیا ہے کہ تمام مخلوق اور اہل اللہ میں سے اکثر لوگ کہتے ہیں کہ اگر فلاں فعل جو وجود (الوجود) میں کسی انسان کے ہاتھ پر ظاہر ہوا، اس کے بجائے فلاں ہوتا تو اس فعل سے بہتر ہوتا اور زیادہ اولیٰ ہوتا۔ وہ یہ بات اس شخص سے کہتے ہیں جس میں اور جس کے ہاتھ پر وہ الٰہی فعل ظاہر ہوتا ہے۔ تو کیا یہ ان کی اس حکمت سے جہالت کی وجہ سے نہیں ہے جو اس قول کے واقع ہونے میں ان کے لیے واقع ہوئی؟\n\nپس اہل اللہ سے یہ صرف ان کی اللہ سے غفلت کی وجہ سے واقع ہوتا ہے، نہ کہ ان کی جہالت کی وجہ سے۔ پس جب انہیں یاد دلایا جاتا ہے تو وہ یاد کرتے ہیں۔ اور غیر اہل اللہ سے یہ ان کی جہالت کی وجہ سے واقع ہوتا ہے، نہ کہ ان کی غفلت کی وجہ سے۔ کیونکہ وہ اس فعل میں جس برائی کی طرف گئے ہیں، اس سے باز نہیں آتے، یہاں تک کہ ان کے لیے اس میں اللہ کی حکمت ظاہر ہو جائے۔ جب وہ ظاہر ہوتی ہے، تب وہ اپنی جہالت کا اعتراف کرتے ہیں اور اپنے علم اور عقل کی کمی کو جانتے ہیں۔\n\nاور میں نے اس ذوق (الذوق) کے اہل میں سے کسی کو نہیں دیکھا اور نہ ہی سنا کہ وہ دیکھا گیا ہو، حالانکہ وہ انتہائی ظہور کے قریب ہے۔ لیکن اغراض اور خواہشات اسے حاصل کرنے میں تکلف سے روکتی ہیں۔ اور اس کی وجہ یہ ہے کہ اہل دین میں سے جو اسے حاصل کرنے کا ارادہ نہیں رکھتے، ان کی دلیل یہ ہے کہ شریعت نے ہمیں بعض چیزوں کو برا کہنے کا حکم دیا ہے اور یہ کہنے کا کہ اس فعل کو چھوڑ دینا بہتر تھا، حالانکہ میں جانتا ہوں کہ فعل اللہ کا ہے۔ ہم نے کہا: \"آپ نے سچ کہا، لیکن یہ اعتراض اس شخص سے نہیں نکلا جس نے میرے مرتبے کو سمجھا۔\" اور یہ اس لیے کہ میں نے کہا کہ وہ اس حکمت سے جاہل ہے جس پر اس نے اعتراض کیا۔ پس جس نے شریعت کے اعتراض سے اعتراض کیا، وہ اللہ کے اعتراض کو نقل کرنے والا ہے، وہ اعتراض کرنے والا نہیں ہے۔ اور وہ اعتراض جب اللہ کی طرف سے پایا جاتا ہے، تو اس ذوق (الذوق) کا صاحب اس کی حکمت اور اس کے مقام کو جانتا ہے۔\n\nاور اس حال کا صاحب نیکی کا حکم دیتا ہے اور برائی سے روکتا ہے اور حدود قائم کرتا ہے، اور وہ ان سب کی حکمت کا مشاہدہ کرتا ہے اور انہیں مشہود الٰہی شانوں میں دیکھتا ہے، اور وہ انہیں صرف ان کے تکوین (پیدا ہونے) کے وقت ہی دیکھتا ہے۔ یہ اس حال کے صاحب کا مقام ہے۔ کیونکہ اہل اللہ میں سے بعض وہ بھی ہیں جو ان شانوں کو اس سے پہلے دیکھتے ہیں کہ ذات حق (الحق) ان میں ہو، اور وہ وہ ہے جو ممکنات کی ہستیوں کو ان کے عدم کی حالت میں دیکھتا ہے، جیسا کہ ذات حق (الحق) انہیں دیکھتا ہے۔ اور اسی لیے ذات حق (الحق) ان میں سے بعض کو تکوین کے ذریعے متعین کرتا ہے، نہ کہ دوسری ممکنات کو۔ کیونکہ ذات حق (الحق) انہیں صرف اسی صورت میں وجود دیتا ہے جس پر وہ ان کے عدم کی حالت میں ہیں، بغیر کسی کمی یا زیادتی کے۔\n\nاور اہل اللہ میں سے بعض وہ ہیں جو امر کو حس میں ظاہر ہونے سے پہلے دیکھتے ہیں، اور وہ دوسرا تکوین ہے، وہ اسے امام مبین (لوح محفوظ) میں دیکھتے ہیں، جو محو اور اثبات پر حاوی ہے۔ پس اس میں جو کچھ ہے، اس چیز کے لیے تسطیر (لکھنے) میں پہلا تکوین ہے۔ اور یہ کشف (الکشف) اس کشف سے کم ہے جس میں اللہ اسے ممکنات کی ہستیوں کو اس صورت میں دکھاتا ہے جس پر وہ وجود (الوجود) کی حالت میں ہوں گی، پس وہ ان میں اللہ کا حکم جاری کرتا ہے۔\n\nاور حس میں ظاہر ہونے سے پہلے ان شانوں کے ادراک کے بہت سے مدارک ہیں، ان میں سب سے اعلیٰ وہ ہے جو ہم نے ذکر کیا، یعنی سب سے دور کا۔ اور اس کے بعد ذات حق (الحق) کو ان کے تکوین میں مشاہدہ کرنا، کیونکہ یہ مشاہدہ کرنے والے کے لیے امام مبین اور اس کے علاوہ میں ان کے مشاہدے سے زیادہ اعلیٰ ہے۔ اور اس شہود (الشہود) سے کم ہر وہ شہود ہے جو بندے کو شان کے تکوین سے پہلے حاصل ہو۔ یہ اس شخص کا حال ہے جس نے کہا:\n\nما رأيت شيئا إلا رأيت الله معه (میں نے کوئی چیز نہیں دیکھی مگر اللہ کو اس کے ساتھ دیکھا)۔\n\nاور یہ اس شخص سے زیادہ اعلیٰ حال ہے جو کہتا ہے: ما رأيت شيئا إلا رأيت الله قبله (میں نے کوئی چیز نہیں دیکھی مگر اللہ کو اس سے پہلے دیکھا)۔ کیونکہ پہلا کلمہ تحقیق کا ہے، اگرچہ دوسرا بھی تحقیق میں اس جیسا ہے، لیکن ان دونوں کے درمیان فرق ہے۔ پہلے کا قول اس شخص کی طرح ہے جو کہتا ہے: \"میں نے زید کو فلاں کام کرتے ہوئے دیکھا۔\" اور دوسرا کہتا ہے: \"میں نے صانع کو فلاں کام کرتے ہوئے دیکھا۔\" پس یہ دونوں شخصوں کے درمیان فرق ہے اس چیز میں جس کا وہ مشاہدہ کرتے ہیں۔ کیونکہ اسماء اعلام (نام) صرف اس لیے رکھے گئے ہیں کہ ان کے غائب ہونے کی حالت میں ان کے ذریعے مخاطب کیا جائے، اور حضوری میں ان کی ضرورت نہیں ہوتی، اور اگر انہیں لایا بھی جائے تو یا تو یہ اس ادب کی وجہ سے ہوتا ہے جس کا حال تقاضا کرتا ہے، یا خبر میں تاکید کے لیے۔\n\nپس میں نے آپ کے لیے اس قطب کے حال میں سے وہ واضح کر دیا جو آپ نے سنا، اور اس کے بہت سے احوال ہیں جنہیں میں جانتا ہوں، میں ہر قطب کے تمام احوال ذکر نہیں کرتا، کیونکہ اس میں بہت زیادہ وسعت ہو جائے گی، جس سے وقت باقی نہیں رہے گا۔\n\n### [ساتواں قطب جو ایوب علیہ السلام کے قدم پر ہے]\n\nاور رہا ساتواں قطب جو ایوب علیہ السلام کے قدم پر ہے، اور اس کی سورت البقرة (سورہ بقرہ) ہے، اور یہ سفید ہے جو قرآن کی آیات کی سردار کو شامل ہے۔ اور اس کے منازل اس کے حروف کی تعداد کے مطابق ہیں، نہ کہ اس کی آیات کی۔\n\nاس قطب کا حال عظمت (العظمة) ہے، اس طرح کہ وہ دیکھتا ہے کہ عالم اسے نہیں سما سکتا، کیونکہ اس کا ذوق (الذوق) یہ ہے کہ ذات حق (الحق) نے اس کے دل کو سما لیا ہے۔ اور حدیث میں آیا ہے کہ ذات حق (الحق) فرماتا ہے: ما وسعني أرضي ولا سمائي ووسعني قلب عبدي (میری زمین اور میرا آسمان مجھے نہیں سما سکے، لیکن میرے بندے کا دل مجھے سما گیا)۔\n\nاور ہر دل ذات حق (الحق) کو نہیں سما سکتا، اور فرمایا: وَلَكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ (لیکن وہ دل اندھے ہو جاتے ہیں جو سینوں میں ہیں)۔ پس اس نے دلوں کی جگہ بیان کی۔ پس جب کسی بندے کے لیے ذات حق (الحق) کا اس کے دل میں ہونا مشہود ہو، تو جس طرح عالم ذات حق (الحق) کو نہیں سما سکتا، اسی طرح عالم بھی اس بندے کو نہیں سما سکتا۔ پس یہ اس کے لیے عالم کی تنگی کے مشاہدے کا سبب ہے۔\n\nاور میں نے اس مقام اور اس کے شہود (الشہود) سے متحقق ہونے والا کوئی نہیں دیکھا سوائے موصل کے ایک شخص کے، جو حدیثہ موصل کے رہنے والے تھے، وہ اس مرتبے پر تھے، اور ذات حق (الحق) نے انہیں ایک امر پر مطلع کیا اور اس کے راز پر مطلع نہیں کیا تھا۔ اور وہ کسی ایسے شخص کی تلاش میں تھے جو ان کے حال کو واضح کرے۔ پس امام نجم الدین محمد بن ابی بکر بن شائی موصلی، جو حلب میں سیف الدین بن علم الدین کے مدرسے میں مدرس تھے، نے اس زمانے میں جو ہم اس میں ہیں، یعنی سن چھ سو اٹھائیس ہجری میں، میرا ذکر ان سے کیا۔ پس انہوں نے مجھ سے ملاقات کی درخواست کی۔ جب وہ پہنچے تو ہم نے ان کی لغزش کا ذکر کیا، پس میں نے اسے واضح کر دیا، تو وہ خوش ہوئے اور مطمئن ہو گئے، اور جب انہوں نے دیکھا کہ میں انہیں سمجھ گیا ہوں تو انہوں نے اپنا حال میرے سامنے کھول دیا۔ پس میں نے انہیں پایا کہ انہوں نے مقام عظمت (العظمة) سے وافر حصہ لیا ہے، لیکن اس قطب کے ذوق (الذوق) سے کم۔\n\nکیونکہ انہوں نے مجھے خبر دی کہ بلغم ان کے منہ میں گھومتا رہتا تھا، وہ اسے اپنے منہ سے باہر نہیں پھینک سکتے تھے، کیونکہ انہیں کوئی ایسی جگہ نہیں ملتی تھی جو ذات حق (الحق) سے خالی ہو جہاں وہ اسے پھینک سکیں۔ حالانکہ وہ ادب کے بارے میں جانتے تھے جو شریعت میں اسے پھینکنے کے بارے میں آیا ہے۔ پس وہ حیران رہتے تھے۔ اور میں نے اندلس کے شہروں میں سے اشبیلیہ میں ایک اور شخص کو بھی ان جیسا دیکھا۔\n\nاور ہم نے حلاج سے روایت کی ہے کہ انہوں نے اس مقام کا ذوق (الذوق) چکھا، یہاں تک کہ ان پر مقام کا حال ظاہر ہوا، پس ان کا ایک گھر تھا جسے بیت العظمة (عظمت کا گھر) کہا جاتا تھا، جب وہ اس میں داخل ہوتے تو دیکھنے والے کی آنکھ میں وہ اپنی ذات سے اسے پورا بھر دیتے، یہاں تک کہ لوگوں نے انہیں علم سیمیاء (جادو) سے منسوب کر دیا، ان کی جہالت کی وجہ سے کہ اہل اللہ کن احوال پر ہوتے ہیں۔\n\nاور اس مقام میں متمکن شخص پر ایسا حال ظاہر نہیں ہوتا جو یہ بتائے کہ وہ اس ذوق (الذوق) کا صاحب ہے، لیکن اس کی صفات اس مقام کے حکم سے جاری ہوتی ہیں، نہ کہ اس کا حال۔ کیونکہ حال خرق عادات (عادات کو توڑنا) عطا کرتا ہے، جیسا کہ صاحب محاسن المجالس نے اس میں احوال کا ذکر کرتے ہوئے کہا کہ وہ مریدین کے لیے ہیں، اور کہا کہ احوال کرامات کے لیے ہیں، یعنی خرق عادات۔ اور کرامات اس لغت کے عرف میں خرق عادات نہیں ہیں، بلکہ حال میں استقامت کے ساتھ یا فوراً استقامت پیدا کرنا ضروری ہے۔ اور اس تحدید کا سبب یہ ہے کہ خرق عادت بسا اوقات بندے کے لیے اللہ کی طرف سے کرامت نہیں ہوتی۔\n\nپس مقام عظمت (العظمة) میں سب سے کامل وہ ہے جس کا حال مجہول ہو اور وہ پہچانا نہ جائے، پس وہ جانتا ہے کہ اس کے ساتھ کیا معاملہ کیا جاتا ہے اور دیکھنے والا اس میں محفوظ رہتا ہے، مگر وہ اپنے رب کی طرف سے دلیل اور اپنے امر کی بصیرت پر ہے۔ پس جو شخص اس امام کے احوال کو جاننا چاہے، تو وہ سورة البقرة (سورہ بقرہ) کی آیات پر ایک ایک آیت کے بعد غور کرے، یہاں تک کہ اسے ختم کرے۔ پس یہ قطب اس کی تمام آیات کا مجموعہ ہے۔ اور توفیق اللہ ہی کی طرف سے ہے۔\n\nاور رہا آٹھواں قطب جو الیاس علیہ السلام کے قدم پر ہے، اور اس کی سورت آل عمران (سورہ آل عمران) ہے، اور یہ بھی سفید ہے، اور اس کے منازل اس کی آیات کی تعداد کے مطابق ہیں۔ اور میرے اس قول سے کہ پہلا قطب اور دوسرا قطب، میری مراد یہ نہیں کہ یہ ترتیب زمانے کے لحاظ سے ہے، بلکہ میری مراد عدد کی ترتیب ہے، یہاں تک کہ بارہ قطب مکمل ہو جائیں۔ بسا اوقات بارہواں یا کوئی اور زمانے کے لحاظ سے پہلا ہو سکتا ہے۔ اور میں نے یہ اس لیے بتایا تاکہ وہ شخص وہم نہ کرے جسے اللہ نے ان قطبوں کے زمانوں کے علم پر مطلع کیا ہو، اور وہ یہ دیکھے کہ یہ ترتیب جو ہم نے ان میں بیان کی ہے، ان کے زمانوں کی ترتیب ہے۔ اس لیے میں نے واضح کر دیا کہ یہ صرف عدد کی ترتیب ہے۔\n\nاور اس قطب کا حال اللہ کے کلام میں متشابہ (المتشابہ) کا علم ہے، جس کی تأویل (تفسیر) ما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله (اللہ کے سوا کوئی نہیں جانتا)۔ پس یہ قطب اسے اللہ کے بتانے سے خاص طور پر جانتا ہے، اور وہ اسے کبھی بھی اللہ کے بتانے کے بغیر نہیں جانتا۔ پس وہ اس کے نزدیک اس کے تشابہ میں محکم (واضح) ہوتا ہے، پس وہ جانتا ہے کہ اس میں تشابہ کس پہلو سے تھا، پس اسے اس مناسبت کا علم حاصل ہوتا ہے جس نے اللہ اور اس شخص کے درمیان جمع کیا جس کے ساتھ آیت میں تشابہ واقع ہوا، جیسے تشبیہ کی تمام آیات، یا تشبیہ مشترک لفظ کی دلالت کے ذریعے واقع ہو جو صرف کسی پوشیدہ مناسبت کے لیے ہوتا ہے۔ کیونکہ تشبیہ میں مناسبت واضح ہوتی ہے اور اشتراک میں پوشیدہ، جیسے نور کا علم کے لیے واضح ہونا، پس علم کو نور کہا جاتا ہے اور نور کو نور، جیسا کہ اس کا قول: وَجَعَلْنا لَهُ نُوراً (اور ہم نے اس کے لیے نور بنایا) اور وَجَعَلْناهُ (اور ہم نے اسے بنایا)، یعنی وحی جو علم ہے، نُوراً نَهْدِي بِهِ مَنْ نَشاءُ مِنْ عِبادِنا (ایک نور جس کے ذریعے ہم اپنے بندوں میں سے جسے چاہتے ہیں ہدایت دیتے ہیں)۔ اور اشتراک میں جیسے العین (آنکھ/ہستی)، پس ہر اس چیز میں عینی مناسبت پوشیدہ ہے جسے عین کہا جاتا ہے۔ پس یہ اس قطب کے نزدیک اللہ کے بتانے سے واضح ہوتی ہے۔\n\nاور رہے وہ لوگ جو اس میں نظر کے ذریعے تأویل کرتے ہیں، تو وہ علم پر نہیں ہیں، اگرچہ وہ علم کو پا لیں۔\n\nاور اس علم سے آپ یہ جانتے ہیں کہ عورتیں مردوں کی ہم پلہ ہیں (النساء شقائق الرجال)۔ کیا آپ نہیں دیکھتے کہ حوا آدم سے پیدا ہوئیں، پس ان کے لیے دو حکم ہیں: اصل کے لحاظ سے مذکر کا حکم اور عارضی طور پر مونث کا حکم۔ پس وہ متشابہ (المتشابہ) میں سے ہیں۔ کیونکہ انسانیت مذکر اور مونث کا مجمع ہے۔ اور فاعل کی حقیقت منفعل کی حقیقت سے کہاں ہے اس شخص کے لیے جو اس میں فاعل ہے اور صرف اپنے مماثل میں ہی فعل کرتا ہے۔ اور یہ اس لیے ہے کہ اس نے سب سے پہلے اپنے نفس میں انفعال (اثر قبول کرنا) پیدا کیا، پس اس میں اس چیز کی صورت ظاہر ہوئی جس سے وہ منفعل ہوتا ہے، اور اسی قوت سے اس سے وہ چیز منفعل ہوئی جو منفعل ہوئی اور وہ بدیع (انوکھا پیدا کرنے والا) اور مخترع (ایجاد کرنے والا) کی طرح ظاہر ہوا۔\n\nاور ذات حق (الحق) نے ہم نے پہلے ہی تحقیق کی ہے کہ عالم کے علم کی تحقیق یہ ہے کہ علم معلوم کے تابع ہوتا ہے، اور علم عالم کی صفت ہے، اور علم دینے والا وہ نہیں ہے جس پر معلوم ہے، پھر وہ عالم کو معلوم کا وجود (ایجاد) عطا کرتا ہے، جیسا کہ وہ مخترع کو ایجاد کردہ امر کا وجود اور اسے وجود (الوجود) میں ظاہر کرنا عطا کرتا ہے۔\n\nپس یہاں سے یہ معلوم ہوتا ہے کہ اللہ نے محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کے لیے عورتوں کو کیوں محبوب بنایا۔ پس جس نے عورتوں سے محبت کی، نبی (صَلَّى اللهُ عَليهِ وسَلَّم) کی ان سے محبت کی وجہ سے، تو اس نے اللہ سے محبت کی۔ اور جامع انفعال (اثر قبول کرنا) ہے، کیونکہ معلوم نے عالم کو علم دیا تاکہ اسے عالم کہا جائے، پس وہ معلوم کے لیے پہلا منفعل ہے۔ اور عیسیٰ میں مریم سے ان کا انفعال ظاہر ہوا، آدم سے حوا کے مقابلے میں۔ إِنَّ فِي ذلِكَ لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ (بے شک اس میں اس شخص کے لیے نصیحت ہے جس کے پاس دل ہو)۔ پس وہ اللہ عزوجل کے اس قول کو سمجھے گا: يا أَيُّهَا النَّاسُ إِنَّا خَلَقْناكُمْ مِنْ ذَكَرٍ (اے لوگو! بے شک ہم نے تمہیں ایک مذکر سے پیدا کیا) جیسے حوا، وَأُنْثى‏ (اور ایک مونث سے) جیسے عیسیٰ، اور مجموعے سے جیسے بنی آدم کی باقی ذریت۔ پس وہ لوگوں کی تخلیق کے لیے جامع ہے۔\n\nاور میں اس راستے میں داخل ہونے کے آغاز میں عورتوں اور جماع سے اللہ کی مخلوق میں سب سے زیادہ نفرت کرنے والا تھا، اور میں تقریباً اٹھارہ سال تک اسی حال پر رہا، یہاں تک کہ میں نے اس مقام کا مشاہدہ کیا۔ اور میرے نزدیک اس سے پہلے اس پر مقت (ناراضگی) کا خوف غالب تھا، جب میں نے نبی (صَلَّى اللهُ عَليهِ وسَلَّم) کی حدیث پر اطلاع پائی کہ اللہ نے عورتوں کو اپنے نبی (صَلَّى اللهُ عَليهِ وسَلَّم) کے لیے محبوب بنایا۔\n\nپس آپ نے ان سے طبعاً محبت نہیں کی، بلکہ اللہ کے ان کو آپ کے لیے محبوب بنانے کی وجہ سے محبت کی۔ پس جب میں نے اللہ کے ساتھ اس معاملے میں سچائی اختیار کی، اس خوف سے کہ اللہ مجھ پر ناراض ہو جائے گا کیونکہ میں اس چیز کو ناپسند کرتا ہوں جسے اللہ نے اپنے نبی کے لیے محبوب بنایا، تو اللہ نے اپنی حمد سے وہ مجھ سے دور کر دیا اور انہیں میرے لیے محبوب بنا دیا۔ پس میں ان پر سب سے زیادہ شفقت کرنے والا اور ان کے حق کا سب سے زیادہ خیال رکھنے والا ہوں، کیونکہ میں اس میں بصیرت پر ہوں، اور یہ تحبب (محبوب بنائے جانے) کی وجہ سے ہے، نہ کہ طبعی محبت کی وجہ سے۔\n\nاور عورتوں کی قدر صرف وہی جانتا ہے جو اللہ سے وہ بات جانتا اور سمجھتا ہے جو اس نے رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) کی بیویوں کے حق میں فرمائی جب انہوں نے آپ کے خلاف تعاون کیا اور آپ کے خلاف نکلیں، جیسا کہ اللہ نے سورة التحریم میں ذکر کیا۔ اور اللہ نے ان دو عورتوں کے مقابلے میں، جنہوں نے آپ کے خلاف تعاون کیا، ان کو رکھا جو رسول اللہ (صَلَّى اللهُ عَليهِ وسَلَّم) کی ان دونوں کے خلاف مدد کریں گے اور آپ کی نصرت کریں گے، اور وہ اللہ، جبرائیل، صالح مومنین، پھر اس کے بعد فرشتے ہیں۔ اور یہ صرف اس سبب کے اختلاف کی وجہ سے ہے جس کی وجہ سے تعاون واقع ہوتا ہے۔ پس وہاں ایک امر ہے جسے اللہ کے سوا کوئی دور نہیں کر سکتا، مخلوق نہیں۔ اور اسی لیے ہمیں حکم دیا گیا کہ ہم بعض چیزوں میں اللہ سے مدد مانگیں، اور بعض چیزوں میں صبر سے، اور بعض چیزوں میں نماز سے۔ پس یہ جان لو۔\n\nاور وہاں ایک امر تھا، اگرچہ وہ اللہ کے ہاتھ میں تھا، لیکن اللہ نے جبرائیل کو اس امر کو دفع کرنے کی قدرت دی، پس انہوں نے محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کی مدد کی اسے دفع کرنے میں، اگر وہ دونوں آپ کے خلاف تعاون کرتیں یا اگر وہ اس سے رجوع کرتیں اور اپنے نفسوں سے حق کو دیتیں تو آپ ان سے خاموش رہتے، جیسا کہ ہم خاموش رہے۔ پس ان کے لیے امر پہلے بھی تھا اور بعد میں بھی، اور یہ ایک الٰہی صفت ہے۔ کیونکہ ان کی حرکت کی وجہ سے وہ حرکت میں آیا جو حرکت میں آیا، اور ان کے سکون کی وجہ سے وہ ساکن ہوا جس نے حرکت کا ارادہ کیا تھا۔ اور اسی طرح صالح مومنین، ان کے پاس ایک امر تھا جس کی نسبت دور کرنے میں صالح مومنین سے زیادہ قریب تھی، دوسروں کی نسبت سے۔ پس صَالِحُ الْمُؤْمِنِينَ (صالح مومن) محمد (صَلَّى اللهُ عَليهِ وسَلَّم) کے مددگار ہوں گے، پھر اس کے بعد فرشتے، جب صرف وہی باقی رہے گا جو فرشتوں کی عمومیت کے مناسب ہو، جنہیں مسخر پیدا کیا گیا ہے، جس کے ذریعے وہ چیز دفع کی جاتی ہے جو الٰہی ترتیب میں فرشتوں کے بغیر دفع نہیں ہوتی، اس کے باوجود کہ ذات حق (الحق) اس سارے امر میں تنہا ہے اور اس کا قیام کرنے والا ہے، لیکن عقلی جواز ہے۔ پس ذات حق (الحق) نے واقع ہونے والی چیز کی خبر دی کہ اگر وہ واقع ہوتی تو کیسے واقع ہوتی۔ پس وہ صرف اسی طرح واقع ہوتی ہے جیسا کہ اس نے فرمایا، اور اس نے صرف وہی فرمایا جو اسے معلوم تھا کہ وہ اس صورت میں واقع ہو گا، اور اس نے صرف وہی جانا جو معلوم نے اسے اپنے نفس سے دیا کہ وہ اس پر ہے، جسے اس نے ازل میں اس کی ثابت ہستی میں اس کے عدم کی حالت میں مشاہدہ کیا۔\n\nپس اے ولی! دیکھو کہ امور کس طرح اپنی حقیقتوں کو صاحب فہم اور قلب کے لیے ظاہر کرتے ہیں۔ اللہ ہمیں اور آپ کو اللہ سے سمجھنے والوں میں سے بنائے، ان میں سے جس کے پاس لَهُ قَلْبٌ (دل ہو) جس سے وہ اللہ سے عقل کرے، اور أَلْقَى السَّمْعَ (کان لگائے) اللہ کے خطاب کے لیے، اور هُوَ شَهِيدٌ (وہ حاضر ہو) اس شان کے لیے جو اللہ اپنی کائنات میں پیدا کرتا ہے۔\n\n### [نواں قطب جو لوط علیہ السلام کے قدم پر ہے]\n\nاور نویں قطب جو لوط علیہ السلام کے قدم پر ہیں، ان کی سورت سورۃ الکہف ہے، اور ان کے لیے عصمت (العصمة) اور اعتصام (الاعتصام) ہے، اور ان کی منازل اس کے آیات کی تعداد کے مطابق ہیں۔ ان کا حال ہر اس چیز سے عصمت (العصمة) ہے جو سوءِ ادب کی طرف لے جائے اور صاحب کو بساطِ قرب سے دور کر دے۔ وہ ہمیشہ اپنے وقت پر محفوظ رہتے ہیں، اور ان کا علم اعتصام (الاعتصام) کا علم ہے۔ اللہ تعالیٰ نے انہیں دو چیزوں میں متعین اور محدود کر دیا ہے: ایک اللہ سے اعتصام، جیسا کہ اس نے فرمایا:\n**\"واعْتَصَمُوا بِاللَّهِ\"** (اور اللہ کو مضبوطی سے تھام لو)۔\nاور دوسرا اعتصام اس کی رسی سے ہے، جیسا کہ اس کا فرمان ہے:\n**\"واعْتَصِمُوا بِحَبْلِ الله جَمِيعاً\"** (اور سب مل کر اللہ کی رسی کو مضبوطی سے تھام لو)۔\nپس لوگوں میں سے کچھ وہ ہیں جنہوں نے اللہ سے اعتصام کیا، اور کچھ وہ ہیں جنہوں نے اللہ کی رسی سے اعتصام کیا۔ اور انہوں نے کہا کہ اللہ کی رسی سے اعتصام کرنا ہی عین اللہ سے اعتصام کرنا ہے۔ اور اس قطب نے ان دونوں اعتصاموں کو جمع کیا ہے۔ ان دونوں اعتصاموں میں فرق یہ ہے کہ اللہ کی رسی وہ راستہ ہے جو تمہیں اس کی طرف لے جاتا ہے، جیسا کہ اس کا فرمان ہے:\n**\"إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ والْعَمَلُ الصَّالِحُ يَرْفَعُهُ\"** (اسی کی طرف پاکیزہ کلمات چڑھتے ہیں اور نیک عمل اسے بلند کرتا ہے)۔\nاور اس کی رسی اس کے سوا کچھ نہیں جو اس نے شریعت میں مقرر کیا، اور لوگوں کی فہم اس میں مختلف ہے۔ پس ان میں سے کچھ ہیں اور کچھ ہیں۔ اسی لیے اللہ نے ان میں سے بعض کو بعض پر فضیلت دی: **\"فَضَّلَ الله بَعْضَهُمْ عَلى‏ بَعْضٍ\"**۔ پس جس نے اپنا راستہ نہیں چھوڑا، وہی معصوم ہے، اور اس سے تمسک کرنا ہی اعتصام ہے۔ اور یہی حال ان مؤمنین کا ہے جو ایمان میں کمال کو پہنچ چکے ہیں۔ اور ایسے لوگ اللہ کی رسی سے اعتصام کرنے میں اللہ سے اعتصام کرتے ہیں، اور یہی اس کا فرمان ہے: **\"وإِيَّاكَ نَسْتَعِينُ\"** (اور ہم تجھ ہی سے مدد مانگتے ہیں) اور اس کا فرمان: **\"اسْتَعِينُوا بِاللَّهِ\"** (اللہ سے مدد مانگو)۔\nاور جہاں تک اللہ سے اعتصام کا تعلق ہے، تو وہ نبی اکرم صلی اللہ علیہ وسلم کا استعاذہ میں یہ فرمان ہے:\n**\"وأعوذ بك منك\"** (اور میں تیری پناہ مانگتا ہوں تجھ سے)۔\n\nکیونکہ اس کی مخلوق میں سے کوئی چیز اس کا مقابلہ نہیں کر سکتی، لہٰذا اس سے پناہ صرف اسی سے مانگی جاتی ہے۔ جب انسان کے کان میں یہ بات پڑی کہ وہ صورتِ حق (صورة الحق) پر پیدا کیا گیا ہے، اور اس نے انسان کامل (الإنسان الکامل) اور انسان حیوانی میں فرق نہیں کیا، اور یہ گمان کیا کہ انسان ہونے کی وجہ سے وہ اس صورت پر ہے، حالانکہ ایسا نہیں ہے جیسا کہ اسے گمان ہوا، بلکہ وہ انسان ہونے کی حیثیت سے صورت کو قبول کرنے والا ہے، جب اسے وہ صورت دی جاتی ہے تو وہ اسے قبول کرنے سے انکار نہیں کرتا۔ پس جب اسے وہ صورت دی جاتی ہے تو اس وقت وہ اس صورت پر ہوتا ہے اور خلفاء (الخلفاء) کے زمرے میں شمار ہوتا ہے۔\n\nپس جو اس صورت پر ہو وہ اس کے ذریعے حق (الحق) کے تصرف کے سوا کوئی تصرف نہیں کرتا، اور حق کا تصرف عین وہی ہے جس پر اور جس میں عالم (العالم) ہے۔ اور تم ہر لحاظ سے جانتے ہو کہ عالم میں کیا ہے، مکلف اور غیر مکلف میں سے، اور جو انکار کیا جاتا ہے اور جو پہچانا جاتا ہے۔ اور مکلف عالم میں سے جو انکار کیا جاتا ہے اور جو پہچانا جاتا ہے، اسے خلیفہ (الخليفة) کے سوا کوئی نہیں جانتا، اور وہی صاحبِ صورت ہے۔ پس حق کے لیے انکار کا حکم ہے، بندے کے لیے نہیں۔ لہٰذا اللہ سے اعتصام کرنے والا جب صاحبِ صورت ہو تو وہ صرف اسی سے اعتصام کرتا ہے، اس طرح کہ وہ ایک ایسے مقام پر اس کے ذریعے ظاہر ہو جس کا وہ انکار کرتا ہو، اگرچہ وہ اس کی صفت ہی کیوں نہ ہو۔ پس اسے ہر مقام پر اس صفت کو اختیار کرنے کا حق نہیں ہے، اور نہ ہی ہر مشہد میں اس کے ذریعے ظاہر ہونے کا، بلکہ اسے اس میں پردہ پوشی اور اس سے آراستہ ہونے کا حق ہے، اس کے مطابق جو وقت حکم دے۔ اور اسی کو ادب (الأدب) سے تعبیر کیا جاتا ہے۔ اگرچہ اس کا مشاہدہ یہ ہو کہ وہ اللہ کو اللہ کے ذریعے ہی دیکھتا ہے، اور یہ کہ عالم عین وجودِ حق (عين وجود الحق) ہے، اور یہ چیز انکار سے روکنے والی سب سے بڑی چیز ہے۔ لیکن انکار ناگزیر ہے اگر اسے یہ مقام صحیح طور پر حاصل ہو جائے، تو وہ حق کے ساتھ حق پر حق کے لیے انکار کرتا ہے اور پرواہ نہیں کرتا، اور اس کی دلیل قائم رہتی ہے۔\n\n### [دسواں قطب جو ہود علیہ السلام کے قلب پر ہیں]\n\nاور دسواں قطب جو ہود علیہ السلام کے قلب پر ہیں، ان کی سورت سورۃ الانعام ہے، اور طوالات (لمبی سورتوں) میں اس کے لیے کمال (الکمال) اور تمام (التمام) ہے۔ اور ان کی منازل اس کے آیات کی تعداد کے مطابق ہیں۔ اس قطب کے لیے بہت سے علوم ہیں، جن میں سے ایک علم الاستحقاق (علم الاستحقاق) ہے، جو ہر مخلوق اپنی تخلیق میں مستحق ہے۔ اور دوسرا علم ان مراتب کا ہے جن کا وہ مخلوق مستحق ہے۔ جہاں تک مخلوق کے استحقاق کا تعلق ہے، تو وہ اس کا فرمان ہے:\n**\"أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ\"** (اس نے ہر چیز کو اس کی ساخت عطا کی)۔\nاور جہاں تک مراتب کا تعلق ہے، تو اس پر تنبیہ اس کے اس فرمان سے ہوتی ہے:\n**\"وما قَدَرُوا الله حَقَّ قَدْرِهِ\"** (اور انہوں نے اللہ کی قدر نہیں کی جیسا کہ اس کی قدر کرنے کا حق تھا) اور **\"يا أَهْلَ الْكِتابِ لا تَغْلُوا في دِينِكُمْ\"** (اے اہلِ کتاب! اپنے دین میں حد سے نہ بڑھو)۔\nاس کا مطلب یہ ہے کہ تم اسے اس کے مرتبے سے بڑھا دو یا اس سے کم کر دو۔ اور عاقل عالم دوسرے سے صرف اسی صورت میں ممتاز ہوتا ہے جب وہ ہر حقدار کو اس کا حق دے اور ہر چیز کو اس کی تخلیق عطا کرے۔ اور جب تک وہ یہ نہیں جانتا، وہ حق سے جاہل ہے۔ اور جب وہ جان لے اور اپنے علم پر عمل نہ کرے، تو وہ عاقل نہیں ہے۔ لہٰذا اس مقام کے صاحب کے لیے ضروری ہے کہ وہ کامل العقل اور کامل العلم ہو۔ اور یہی حفظِ الٰہی (الحفظ الإلهي) اور عنایتِ عظمیٰ (العناية العظمى) ہے۔ اور اس مثالی طریقے پر سلوک کرنا، جو کہ طریقۂ زلفیٰ (الطريقة الزلفى) ہے، سیدھا ترین سلوک ہے۔\nجب اللہ نے عالم کی تخلیق کو روح اور صورت کے لحاظ سے مکمل کیا اور ہر مخلوق کو اس کے مرتبے پر اتارا، تو اس نے عالم کے درمیان روحانی اور جسمانی التیام (جڑاؤ) پیدا کیا، تاکہ عالم کی ہر نوع کے اشخاص کا ظہور ہو، کیونکہ ہر نوع کے اشخاص کا وجود میں آنا محال تھا۔ اور اس نے یہ اس لیے کیا تاکہ فاعل کی فضیلت منفعل پر ذوق (الذوق) کے ذریعے ظاہر ہو، تاکہ وہ اللہ کی فضیلت اپنے بندوں پر جانیں اور پہچانیں کہ وہ اپنی بندگی میں اس کے ساتھ کیسے متحقق ہوتے ہیں۔ اور اس نے تخلیق کو ان کی طرف منسوب کیا، چنانچہ فرمایا: **\"وإِذْ تَخْلُقُ من الطِّينِ\"** (اور جب تم مٹی سے بناتے تھے) اور فرمایا: **\"فَتَبارَكَ الله أَحْسَنُ الْخالِقِينَ\"** (پس بابرکت ہے اللہ جو سب سے بہترین خالق ہے)۔\nپس اس نے ذکر کیا کہ وہاں خالق ہیں، اور اللہ ان سب میں بہترین خالق ہے۔ کیونکہ وہ جو کچھ تخلیق کرتا ہے وہ شہود (مشاہدے) کے ذریعے کرتا ہے، جبکہ بندوں میں سے خالق صرف تصور (تصور) کے ذریعے تخلیق کرتا ہے، جو موجود اعیان سے تصور کرتا ہے جن کی وہ مثال بنانا یا ایجاد کرنا چاہتا ہے۔ اور حق (الحق) کی تخلیق ایسی نہیں ہے۔ کیونکہ وہ مخلوق کو اس حالت پر ایجاد یا تخلیق کرتا ہے جس پر وہ مخلوق اپنی ذات اور عین میں ہے۔ پس وہ اسے وجود (الوجود) کے لباس کے سوا کچھ نہیں پہناتا، ایک تعلق کے ذریعے جسے ایجاد (الإيجاد) کہا جاتا ہے۔\nپس جسے اللہ کشف (الکشف) کے ذریعے ممکنات میں سے جو کچھ وہ چاہتا ہے، اس کے اعیان پر مطلع کر دے، تو اس کی طاقت میں ان کا ایجاد کرنا نہیں ہے، یعنی وجود کی خلعت جو اس ثابت ممکن عین کو پہنائی جاتی ہے، وہ اس کے ہاتھ میں نہیں ہے، میرا مطلب براہِ راست ایجاد سے ہے۔ لیکن اس کے لیے ہمت (الهمة) ہے، اور وہ اس کے وجود کا ارادہ ہے، نہ کہ اس کی طرف سے اس کے ایجاد کا ارادہ، کیونکہ وہ جانتا ہے کہ یہ اس کے حق میں محال ہے۔ پس جب وہ اپنی ہمت کو اس کے وجود سے متعلق کرتا ہے، تو حق تکوین (التكوين) کے قول کو متعلق کرتا ہے۔ پس وہ اپنے رب کا قول مخلوق کے قول سے جانتا ہے، خواہ وہ قول مخلوق کی زبان پر ہو یا حق کی طرف سے واسطوں کے اٹھ جانے کے ساتھ ہو، تو وہ چیز وجود میں آ جاتی ہے اور یہ ناگزیر ہے۔ پس مشاہدے میں کہا جاتا ہے کہ فلاں نے اپنی ہمت سے ایسا کیا، اور اگر وہ بولا تو کہا جاتا ہے کہ فلاں نے ایسا کہا، اور اس کے قول سے ایسا ہو گیا۔ پس جس نے یہ جان لیا، اس نے جان لیا کہ اس تکوین میں بندے کا کیا حصہ ہے اور حق کا کیا حصہ ہے۔ اسی لیے اس نے فرمایا کہ وہ **\"أَحْسَنُ الْخالِقِينَ\"** (سب سے بہترین خالق) ہے۔\nپس جب وہ وجود میں آنے والا عین ظاہر ہوتا ہے، خواہ وہ کوئی بھی چیز ہو، تو اس کا مرتبہ اس کی طرف متوجہ ہوتا ہے، کیونکہ اس کا مزاج اسے طلب کرتا ہے، اور میرا مطلب پہلے مرتبے سے ہے۔ پس وہ اعلیٰ یا ادنیٰ امور کے لیے استعداد (الاستعداد) حاصل کرتا ہے، اس استعدادِ مکتسب کے مطابق جو اسے عطا ہوتی ہے، اور وہ عالم میں اس صورت میں ظاہر ہوتا ہے۔ پس جب کوئی اجنبی اس میں دیکھتا ہے، اور اجنبی سے میرا مطلب وہ ہے جسے حقائق کا علم نہیں ہے، اور وہ اس کی استعداد کو دیکھتا ہے، تو اس کا نظریہ اسے یہ دیتا ہے کہ وہ اپنے مرتبے سے گرا ہوا ہے یا اس کا مرتبہ اس سے بلند ہے، یعنی اس مرتبے سے جس میں وہ ظاہر ہوا ہے۔ حالانکہ حقیقت میں معاملہ ایسا نہیں ہے جیسا کہ اس ناظر کو ظاہر ہوا۔ کیونکہ مؤثر استعداد صرف تخلیق میں ہوتی ہے، اور وہ ذاتی استعداد (استعداد ذاتي) ہے۔ اور جہاں تک عارضی استعداد (استعداد عرضي) کا تعلق ہے، تو اس کا کوئی حکم نہیں، بلکہ عارضی استعداد ایک مرتبہ ہے جسے ذاتی استعداد نے ظاہر کیا ہے۔ اور علم کا یہ حصہ اکثر مخلوق سے غائب ہے۔\nاس کی مثال یہ ہے کہ وہ کسی ایسے شخص کو دیکھیں جو خاموش ہے، جس نے علوم کا تصور کیا اور انہیں پختہ کیا، اور اسے مراتب میں سے سب سے کمتر مرتبہ دیا گیا، جو ان فضائل اور علوم کو جمع کرنے والے کے لیے مناسب نہیں کہ اس کی انتہا وہ مرتبہ ہو۔ تو کہا جاتا ہے کہ اس شخص کو اس کے مرتبے سے گرا دیا گیا ہے اور اس کے حق میں انصاف نہیں کیا گیا۔ حالانکہ انہیں خبر نہیں ہے کہ اس کا مرتبہ عین وہی فضائل ہیں جو اس نے جمع کیے اور وہ علوم ہیں جنہیں اس نے پختہ کیا، اور ان میں سے یہ حقیر مرتبہ بھی شامل ہے جو حکمران نے اسے دیا ہے، اگر وہ حکمرانوں میں سے ہے۔ اور اگر وہ حکمرانوں میں سے نہیں ہے اور اس فضیلت کے باوجود کوئی منصب حاصل نہیں کیا، تو اس کے بارے میں کہا جاتا ہے کہ وہ محروم ہے، حالانکہ وہ محروم نہیں ہے۔ بلکہ یہ موطن (دنیا) کا تقاضا تھا، اور وہ یہ ہے کہ دنیا کا تقاضا ہے کہ اس میں جلیل القدر کے ساتھ ایک وقت میں جلال کا معاملہ کیا جائے، اور ایک وقت میں جلیل القدر کے ساتھ حقارت کا معاملہ کیا جائے، اور ایک وقت میں حقیر کے ساتھ حقارت کا معاملہ کیا جائے، اور ایک وقت میں حقیر کے ساتھ جلال کا معاملہ کیا جائے۔ برخلاف آخرت کے موطن کے، جہاں عظیم کے ساتھ عظمت کا معاملہ کیا جاتا ہے اور حقیر کے ساتھ حقارت کا۔\nاگر دیکھنے والا دیکھے تو وہ دنیا میں ایسے شخص کو دیکھے گا جو اللہ کے بارے میں وہ کہتا ہے جو اس کے شایانِ شان نہیں، اور وہ بھی جو اس کے شایانِ شان ہے، تنزیہ اور ثناء میں۔ اور حق سے بڑا کوئی نہیں ہو سکتا، لہٰذا یہ بندہ نہیں ہو سکتا۔ پس جس نے مواطن کو جان لیا، اس نے جان لیا کہ امور عالم میں کیسے جاری ہوتے ہیں۔ اور **\"وَإِلَى اللَّهِ يُرْجَعُ الْأَمْرُ كُلُّهُ\"** (اور تمام معاملات اللہ ہی کی طرف لوٹائے جاتے ہیں)، خواہ وہ صحیح ہوں یا معلول۔ پس تم مناصب کو نہ دیکھو، بلکہ اس نصب کرنے والے کو دیکھو جو مواطن کے حکم سے عمل کرتا ہے، نہ کہ عقلی نظر کے تقاضے سے۔ کیونکہ دیکھنے والا اگر عاقل ہو تو وہ اپنی عقل سے جانتا ہے کہ دنیا کا موطن ایسا ہی عطا کرتا ہے، اور وہ عقلی جواز کو چھوڑ دیتا ہے جو عالم کے ہر فرد میں ممکن ہے۔ کیونکہ یہ جواز عین شہود (عین الشهود) میں نہ علم ہے اور نہ ہی صحیح ہے۔ اور عاقل کو چاہیے کہ وہ حال میں واقع ہونے والی چیز کے ساتھ رہے، کیونکہ یہ امر کی صورت ہے جیسا کہ وہ اپنی ذات میں ہے، عاقل کا مستقبل سے کوئی تعلق نہیں، مگر یہ کہ اللہ اسے کشف (الکشف) کے ذریعے ممکنات کے اعیان پر ان کے وقوع سے پہلے مطلع کر دے۔\n\nپس اس میں اور اس شخص میں کوئی فرق نہیں رہتا جس نے انہیں ان کے وقوع کے وقت دیکھا، کیونکہ اس مکاشف سے عقلی جواز کا حکم زائل ہو جاتا ہے اس چیز میں جس کا اسے کشف کرایا گیا اور جس پر اللہ نے اسے مطلع کیا۔ پس یہ اس قطب کے علم کا کچھ حصہ ہے۔\n\n### [گیارہواں قطب جو صالح علیہ السلام کے قدم پر ہیں]\n\nاور گیارہواں قطب جو صالح علیہ السلام کے قدم پر ہیں، ان کی سورت قرآن میں سورۃ طٰہٰ ہے، اور اس کے لیے شرفِ تام (الشرف التام) ہے۔ اور ان کی منازل اس کے آیات کی تعداد کے مطابق ہیں۔ جان لو کہ یہ قطب تمام اقطاب سے زیادہ اس سورت کی وجہ سے شرف والا ہے، کیونکہ یہ سورت سعید عالم میں قرآن کی سب سے زیادہ شرف والی سورت ہے۔ کیونکہ یہ وہ سورت ہے جسے حق تعالیٰ جنت میں اپنے بندوں پر بلا واسطہ پڑھیں گے۔\nاور اس قطب کے لیے بہت سے علوم ہیں، اس کے لیے بطش (القوة - قوت) اور طاقت ہے۔ جیسا کہ ابو یزید بسطامی نے کہا، جب انہوں نے ایک قاری کو یہ پڑھتے ہوئے سنا: **\"إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ\"** (بے شک تمہارے رب کی پکڑ بہت سخت ہے)، تو انہوں نے کہا: \"میری پکڑ زیادہ سخت ہے\"۔ اور ان کا حال اس شخص کا حال تھا جو اللہ کے ساتھ بولتا ہے۔ پس اللہ کا اپنے بارے میں یہ کہنا کہ اس کی پکڑ سخت ہے، اپنے بندے کی زبان پر، اس کی پکڑ سے زیادہ سخت ہے جو اس کے بندے کی زبان کے بغیر ہو۔ پھر اس کے بندے کی طبعی زبان پر اس کی پکڑ، اس کے بندے کی الٰہی زبان پر اس کی پکڑ سے کہیں زیادہ سخت ہے، جس کا کوئی تقابل نہیں ہے۔\nاور اس امام کا زیادہ تر علم تنزیہ (التنزيه) اور احاطہ (الإحاطة) میں ہے۔ اور وہ تنزیہ اور احاطہ جو وہ جانتا ہے، وہ معروف مفہوم نہیں ہے، بلکہ وہ معروف تنزیہ کی تنزیہ ہے اور اسے اس میں علمِ احاطہ بنا دیا ہے۔ اور وہ یہ ہے کہ اس کی تنزیہ وجود (الوجود) میں عدمِ شرکت ہے، پس وہ وجود ہے، اس کے سوا کوئی نہیں۔ اور جسے اس کے نزدیک عالم (العالم) سے تعبیر کیا جاتا ہے، وہ صرف اسمِ ظاہر (الاسم الظاهر) ہے اور اس کا چہرہ (وجہ) ہے۔ پس جو اس کے ظاہر سے باطن ہے، وہ اسمِ باطن (الاسم الباطن) ہے اور اس کی ہویت (Huwiyyah) ہے۔ پس وہ اس کے لیے ظاہر ہوتا ہے اور اس سے غائب ہوتا ہے۔\nاور جہاں تک تکالیف اور لذات کا تعلق ہے، تو وہ اسماء (الأسماء) کا مقابلہ کرتی ہیں اور ان سے موافقت رکھتی ہیں، اور ان ہی کی وجہ سے صورتیں (الصور) کثرت اختیار کرتی ہیں۔ کیونکہ یہ وہی ہیں جنہوں نے شکل اختیار کی، پس بعض نے بعض کو ادراک کیا، تو وہ ان کا احاطہ کرنے والا اور ان سے منزہ (پاک) تھا۔ پس اس کے لیے ان سے پردہ پوشی اور ان میں تجلی (التجلی) ہے۔ پس صورتیں اس پر مختلف ہوتی ہیں، تو وہ اپنے حال کا انکار کرتا ہے، باوجود اس علم کے کہ وہ وہی ہے، اور یہی وہ بات ہے جو تم انسان کو اپنے بارے میں کہتے ہوئے سنتے ہو کہ میں اس زمانے میں اپنے آپ کا انکار کرتا ہوں، کیونکہ وہ مجھ پر بدل گیا ہے، اور میں اپنے آپ کو ایسا نہیں جانتا تھا۔ حالانکہ وہ وہی ہے، کوئی اور نہیں۔ پس جس لحاظ سے اسماء شکل اختیار کرتے ہیں، اس کے لیے امکان (الإمكان) ہے، اور جس لحاظ سے وہ عین ہے جو اسمائی صورتوں کے اختلاف کو قبول کرتی ہے، اس کے لیے وجوب (الوجوب) ہے۔ پس وہ واجب (الواجب) بھی ہے اور ممکن (الممکن) بھی، اور مکان (المکان) بھی ہے اور متمکن (المتمکن) بھی، جو حدوث (الحدوث) اور قدم (القدم) سے موصوف ہے، جیسا کہ اس کے کلامِ عزیز کو حدوث سے موصوف کیا گیا، باوجود اس کے کہ وہ قدم سے متصف ہے، چنانچہ فرمایا:\n**\"ما يَأْتِيهِمْ\"** (ان کے پاس نہیں آتی) – ضمیر اسماء کی صورتوں کی طرف لوٹتا ہے – **\"مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ\"** (ان کے رب کی طرف سے کوئی نئی نصیحت نہیں آتی)۔\nپس اس نے اسے حدوث سے موصوف کیا، تو وہ صورتِ رحمن کے نزدیک حادث ہے۔ اور **\"ما يَأْتِيهِمْ\"** (ان کے پاس نہیں آتی) – ضمیر پہلے کی طرح ہے – **\"إِلَّا الرَّحْمَنُ مِنْ ذِكْرٍ مِنَ الرَّحْمَنِ مُحْدَثٍ\"** (مگر رحمن کی طرف سے کوئی نئی نصیحت)۔\nپس اس نے اسے حدوث سے موصوف کیا، تو وہ صورتِ رب کے نزدیک حادث ہے۔ پس اگر ذکرِ رب کا آنا مقدم ہو، تو ذکرِ رحمن اس کا جواب ہوتا ہے، اور اگر ذکرِ رحمن مقدم ہو، تو ذکرِ رب اس کا جواب ہوتا ہے۔ پس دونوں ذکروں میں سے جو مقدم ہوتا ہے وہ ہمیشہ قرآن (القرآن) ہوتا ہے، اور دوسرا فرقان (الفرقان) ہوتا ہے۔ پس **\"لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\"** (اس کی مثل کوئی چیز نہیں) ان دونوں میں سے مقدم کے لیے ہے، اور وہ قرآن ہے۔ اور **\"وَهُوَ السَّمِيعُ الْبَصِيرُ\"** (اور وہ سننے والا، دیکھنے والا ہے) دوسرے کے لیے ہے، اور وہ فرقان ہے۔ پس **\"هُوَ الْأَوَّلُ والْآخِرُ\"** (وہ اول ہے اور آخر ہے) جیسا کہ وہ **\"الظَّاهِرُ والْباطِنُ\"** (ظاہر ہے اور باطن ہے) اور **\"وَهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ\"** (اور وہ ہر چیز کا جاننے والا ہے)۔ اور یہ اسماء کی صورتوں کے قبول کرنے کے سوا کچھ نہیں، اور سب احاطہ (الإحاطة) کے لیے ہیں۔ پس معاملہ اسی میں محدود ہو گیا۔ پس اس نے \"کن\" (ہو جا) نہیں کہا مگر اسی کے لیے، اور \"کن\" کے ذریعے کنایہ نہیں کیا مگر اسی سے۔ کیا تم نہیں دیکھتے کہ اس نے اپنے آپ کو دہر (الدهر - زمانہ) کہا، اور یہ کہ وہ رات اور دن کو پلٹتا ہے، حالانکہ دہر رات اور دن کے سوا کچھ نہیں، اور پلٹنا صورتوں کے اختلاف کے سوا کچھ نہیں۔ پس ایام، ساعات، مہینے اور سال عین دہر ہیں، اور دہر میں ہی وہ تفصیل واقع ہوئی جو ہم نے ذکر کی۔ پس ایک لحاظ سے وہ ساعت ہے، اور ایک لحاظ سے وہ دن، رات، جمعہ، مہینہ، سال، موسم اور دور ہے۔\n\n> فكل خير هو له *** وكل شر ليس له‏\n>\n> پس ہر خیر اسی کے لیے ہے *** اور ہر شر اس کے لیے نہیں ہے\n>\n> فهو الوجود كله *** وفقده ما هو له‏\n>\n> پس وہ تمام ہستی ہے *** اور اس کا فقدان اس کے لیے نہیں ہے\n>\n> يعلمه من علمه *** يجهله من جهله‏\n>\n> اسے وہ جانتا ہے جو اسے جانتا ہے *** اسے وہ نہیں جانتا جو اسے نہیں جانتا\n>\n> فإنما أنابه *** في كل أحوالي وله‏\n>\n> پس میں تو صرف اس کا نائب ہوں *** اپنے تمام احوال میں اور اس کے لیے\n>\n> فأنت هو ما أنت هو *** وأنت له ما أنت له‏\n>\n> پس تو وہ ہے، مگر تو وہ نہیں ہے *** اور تو اس کے لیے ہے، مگر تو اس کے لیے نہیں ہے\n>\n> ولو صنعت صنعه *** ولو عملت عمله‏\n>\n> اگرچہ تو نے اس کا کام کیا *** اور اگرچہ تو نے اس کا عمل کیا\n\nپس یہ اس قطب کے علم کے بعض سانسوں میں سے ہے، اور اسی طرح اس کے تمام علوم میں اس کا طریقہ جاری ہے، ان کی کثرت اور تفصیلات کے باوجود۔\n\n### [بارہواں قطب جو شعیب علیہ السلام کے قدم پر ہیں]\n\nاور بارہواں قطب جو شعیب علیہ السلام کے قدم پر ہیں، ان کی سورت قرآن میں سورۃ **\"تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ\"** (بابرکت ہے وہ جس کے ہاتھ میں بادشاہی ہے) ہے، اور یہ وہ سورت ہے جو اپنے پڑھنے والے کی طرف سے جھگڑا کرتی ہے۔ اور ان کی منازل اس کے آیات کی تعداد کے مطابق ہیں۔\nاس کے جھگڑے کو اس کے اس فرمان میں دیکھو: **\"ما تَرى‏ في خَلْقِ الرَّحْمنِ من تَفاوُتٍ فَارْجِعِ الْبَصَرَ ... كَرَّتَيْنِ هَلْ تَرى‏ من فُطُورٍ يَنْقَلِبْ إِلَيْكَ الْبَصَرُ خاسِئاً وهُوَ حَسِيرٌ\"** (تم رحمن کی تخلیق میں کوئی فرق نہیں دیکھو گے، پھر نگاہ دوہراؤ... کیا تم کوئی شگاف دیکھتے ہو؟ نگاہ تمہاری طرف ناکام اور تھکی ہوئی لوٹ آئے گی)۔\nیہ دو مقدمات پر غور کرنے کی طرف متوجہ کرتا ہے: **\"هَلْ تَرى‏ من فُطُورٍ\"** (کیا تم کوئی شگاف دیکھتے ہو؟) یعنی کوئی خلل جس سے اس دلیل میں کوئی نقص پیدا ہو جو وہ قائم کرتا ہے۔ **\"يَنْقَلِبْ إِلَيْكَ الْبَصَرُ\"** (نگاہ تمہاری طرف لوٹ آئے گی) اور وہ نظر ہے **\"خاسِئاً\"** (ناکام) یعنی اس میں کسی نقص یا شبہ کے ساتھ نفوذ کرنے سے دور، **\"وَهُوَ حَسِيرٌ\"** (اور وہ تھکی ہوئی) یعنی اسے تھکاوٹ لاحق ہو گئی ہے۔ اور اس سورت کی ہر آیت اسی ترتیب پر چلتی ہے، یہاں تک کہ اس نے اپنے اس فرمان پر ختم کیا: **\"قُلْ أَ رَأَيْتُمْ إِنْ أَصْبَحَ ماؤُكُمْ غَوْراً فَمَنْ يَأْتِيكُمْ بِماءٍ مَعِينٍ\"** (کہو، بھلا بتاؤ تو سہی اگر تمہارا پانی زمین میں اتر جائے تو کون ہے جو تمہارے لیے بہتا ہوا پانی لائے گا؟)۔\nکیا تم نہیں دیکھتے کہ تمام ہستی (الوجود) بغیر تعلیم کے، کیا تم اسے اضطرار کی حالت میں غیر اللہ کی طرف پناہ لیتے ہوئے دیکھتے ہو؟ وہ صرف ذاتِ حق (اللہ) کی طرف پناہ لیتا ہے۔ اگر وہ غیر ہوتا تو وہ اسے پہچانتا ہی نہیں کہ اس کی طرف پناہ لیتا۔ اور یہی عام لوگوں کا قول ہے جب کسی کو کوئی مصیبت پہنچتی ہے: \"مالک، تم اپنی مصیبت میں صبر کے سوا کسی کی طرف کیوں نہیں لوٹتے؟\" اور صبر صابر کی صفت کے سوا کچھ نہیں، پس اسے صبور (صبر کرنے والا) بھی کہا جاتا ہے۔ وہ کہتا ہے: \"میں وہی ہوں، میرے سوا کوئی اور نہیں ہے۔\" اور یہ عین وہی ہے جس کا دعویٰ اس قطب نے اپنے علم میں کیا جو صالح علیہ السلام کے قدم پر ہیں۔ صلی اللہ علی نبینا محمد وعلیہ وسلم۔\n\n> فيا شعيب ما ثم عيب *** لكنه شاهد وغيب‏\n>\n> اے شعیب! وہاں کوئی عیب نہیں *** لیکن وہ شاہد (دیکھنے والا) اور غیب ہے\n>\n> فانظر إلى حكمة وفصل الخطاب *** فيها ما فيه ريب‏\n>\n> پس حکمت اور فیصلہ کن بات کو دیکھو *** اس میں کوئی شک نہیں ہے\n\nاور اس قطب کے لیے بُرہان (البراهين)، علوم کے موازین (موازین العلوم) اور حدود کی معرفت کا علم ہے۔ وہ ایک مجرد روح ہے، ایک لطیفہ ہے جو طبیعت پر حاکم ہے، شریعت کا مؤید ہے۔ اپنے ہم عصروں میں وہ بڑی سخاوت والا ہے، وہ کھلاتا ہے مگر خود نہیں کھاتا، وہ نعمت دیتا ہے مگر خود نعمت نہیں اٹھاتا۔ اس پر تفکر (التفکر) غالب ہے تاکہ وہ واضح امور میں داخل ہونے کو یاد کریں تاکہ وہ اجنبی بن جائیں۔ پس وہ مجہول ہے جسے کوئی نہیں جانتا، اور وہ نکرہ ہے جو پہچانی نہیں جاتی۔\nاس کے زیادہ تر تصرفات جن الٰہی اسماء میں ہوتے ہیں، وہ ہیں: المدبر (تدبیر کرنے والا)، المفصل (تفصیل کرنے والا)، المنشئ (پیدا کرنے والا)، الخالق (تخلیق کرنے والا)، المصور (صورت بنانے والا)، البارئ (وجود بخشنے والا)، المبدئ (شروع کرنے والا)، المعید (لوٹانے والا)، الحکم (حکم دینے والا)، اور العدل (انصاف کرنے والا)۔\nوہ حق کو اس کی کسی بھی تجلی (التجلی) میں نہیں دیکھتا مگر یہ کہ وہ میزان (ترازو) کو اس کے ہاتھ میں دیکھتا ہے جو جھکاتا ہے اور بلند کرتا ہے۔ پس وہاں صرف جھکانا اور بلند کرنا ہے، کیونکہ وہاں صرف معنی اور حرف، روح اور صورت، آسمان اور زمین، مؤثر اور مؤثر فیہ ہے۔ پس وہاں صرف شفع (جفت) ہے، اور شفع میں سے ہر ایک وتر (طاق/فرد) ہے۔ پس وہاں صرف وتر ہے۔ **\"وَالْفَجْرِ وَلَيَالٍ عَشْرٍ وَالشَّفْعِ وَالْوَتْرِ\"** (فجر کی قسم، اور دس راتوں کی قسم، اور جفت کی قسم، اور طاق کی قسم)۔ پس شفع شفع کو طلب کرتا ہے اور وتر وتر کو طلب کرتا ہے، اور یہ انتقام کا طلب ہے۔\n\n> فشفعه في وتره ظاهر *** ووتره في شفعه مندرج‏\n>\n> پس اس کا شفع اس کے وتر میں ظاہر ہے *** اور اس کا وتر اس کے شفع میں شامل ہے\n>\n> وجادت السحب بأمطارها *** فكان ما كان بأمر مرج‏\n>\n> اور بادلوں نے اپنی بارشیں برسائیں *** پس جو کچھ ہوا وہ ایک ملے جلے حکم سے ہوا\n>\n> فحدثت أرضك أخبارها *** وأنبتت من كل زوج بهج‏\n>\n> پس تیری زمین نے اپنی خبریں بیان کیں *** اور ہر خوبصورت جوڑے کو اگایا\n>\n> تفني إذا شاهدت أعيانها *** بعين غير الحق فيها المهج‏\n>\n> جب تو ان کے اعیان کا مشاہدہ کرے تو جانیں فنا ہو جاتی ہیں *** اس میں حق کے سوا کسی اور کی آنکھ سے\n>\n> يباين الضد بها ضده *** وشكله بشكله مزدوج‏\n>\n> اس میں ضد اپنی ضد سے جدا ہوتی ہے *** اور اس کی شکل اپنی شکل سے جڑی ہوتی ہے\n>\n> ونزهة الأبصار فيما بدا *** في العالم العلوي بين الفرج‏\n>\n> اور نگاہوں کی سیر اس میں ہے جو ظاہر ہوا *** عالمِ علوی میں کشادگی کے درمیان\n>\n> فكل ما للعين من ظاهر *** عنه إذا حققته ما خرج‏\n>\n> پس جو کچھ بھی آنکھ کے لیے ظاہر ہے *** جب تو اس کی تحقیق کرے تو اس سے باہر نہیں نکلا\n\nاس قطب نے دو قوتوں کو جمع کیا ہے: قوتِ علمیہ (القوة العلمية) اور قوتِ عملیہ (القوة العملية)۔ پس وہ ایک فطری کاریگر ہے جس کا کام اس سے فوت نہیں ہوتا۔ اور اسے ہر علم میں الٰہی ذوق (ذوق إلهي) حاصل ہے، خواہ وہ منطقی، ریاضیاتی، طبیعیاتی یا الٰہی علوم ہوں۔ اور یہ تمام اصنافِ علوم اس کے نزدیک الٰہی علوم ہیں، اس نے انہیں صرف اللہ سے حاصل کیا، اور انہیں حق کے سوا کسی اور میں نہیں دیکھا، اور نہ ہی اس نے ان کے لیے حق پر کوئی دلالت دیکھی۔ پس ہر علم یا اس علم کا کوئی مسئلہ اس کے لیے اللہ پر ایک آیت اور دلالت ہے، وہ اس کے سوا کسی اور پر ان کی دلالت نہیں جانتا، کیونکہ وہ اللہ میں مستغرق ہے۔ کیونکہ وہ مجذوب مراد (مجذوب مراد) ہے، اس نے جو کچھ حاصل کیا اس میں کوئی کوشش نہیں کی، بلکہ اس نے اپنے آپ کو اس میں پایا کہ وہ وہی ہے، پھر اس نے اپنی آنکھیں کھولیں تو ہر چیز کو احاطہ (الإحاطة) کی رویت سے دیکھا۔ پس جو اضافہ وہ حاصل کرتا ہے، وہ ہمیشہ اس چیز کی تفصیل میں ہوتا ہے جسے اس نے دیکھا، کیونکہ وجود میں ہر مرئی چیز ہمیشہ متنوع ہوتی رہتی ہے۔ پس افادہ ہمیشہ جاری رہتا ہے، اور ہر استفادہ علم میں اضافہ ہے جو اس کے پاس نہیں تھا، باوجود اس کے کہ وہ ہمیشہ سے اس کا عالم اور اس کا مشاہدہ کرنے والا تھا۔\nپس ہم نے ان بارہ اقطاب کے احوال میں سے وہ کچھ ذکر کیا جو اللہ نے میری زبان پر ذکر کرنا آسان کیا۔ **\"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\"** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\nپس ان اقطاب میں سے ایک کے لیے عدد میں سے واحد ہے، اور وہ توحیدِ خالص (التوحيد الخالص) کا صاحب ہے۔ اور دوسرے کے لیے عدد میں سے دو ہے، اور اسی طرح ہر ایک کے لیے دسویں تک ہے۔ اور گیارہویں کے لیے سو ہے، اور بارہویں کے لیے ہزار ہے۔ اور مفرد کے لیے اعداد کی ترکیب ہے، گیارہ سے لے کر لامتناہی تک۔ اور یہ افراد (الأفراد) کے لیے ہے، اور وہ وہ ہیں جو کثرت کی احدیت (أحدية الكثرة) اور واحد کی احدیت (أحدية الواحد) کو جانتے ہیں۔ اللہ ہمیں اور آپ کو ان لوگوں میں شامل کرے جنہوں نے اللہ سے وہ سمجھا جو اس نے عالم میں اپنے علم سے لکھا ہے، جو اس کی ذاتِ پاک پر دلالت کرتا ہے، وہ عزت والا، ولی، احسان کرنے والا، سخی، کریم اور منان ہے۔ **\"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\"** (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب چهارصد و شصت و سوم: در معرفت دوازده قطبی که عالم زمانشان بر مدار آن‌ها می‌گردد»\n\n> نهایت اسماء در عدد، دوازده است با گره (عقد).\n> پس به واسطه آن‌ها هستی (الوجود) و هر آنچه از عدد در هستی حق (وجود الحق) است، حفظ می‌شود.\n> و اوست که به عدد وصف شده، و اوست که به احد (الأحد) وصف شده.\n> احکام نشأت آن‌ها در آن [آسمان‌ها] که بدون ستون برپا شده‌اند، آشکار گشت.\n> حکم آن‌ها در ارکان، در پدری از آن [ارکان] و در فرزندی، کامل شد.\n\n### [اقطاب این امت دوازده قطب هستند]\n\nخداوند متعال به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: قُلْ هُوَ الله أَحَدٌ (بگو او خدای یگانه است) و او را شناساند و فرمود: وَلِلَّهِ الْأَسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمائِهِ (و برای خداست نام‌های نیکو، پس او را با آن‌ها بخوانید و کسانی را که در نام‌های او کج‌روی می‌کنند، رها کنید). می‌گوید: از نام‌های او منحرف می‌شوند، نه، بلکه می‌گوید: در نام‌های او به سمتی متمایل می‌شوند که مقصود از آن نام‌ها نبوده است. سَيُجْزَوْنَ ما كانُوا يَعْمَلُونَ (به زودی به سزای آنچه می‌کردند خواهند رسید) از آن [کج‌روی]. پس هر کس به آنچه در وحی ما به آن متمایل شده است، جزا داده می‌شود. می‌گوید: اتَّبِعْ ما أُوحِيَ إِلَيْكَ مِنْ رَبِّكَ (از آنچه از پروردگارت به تو وحی شده پیروی کن) و با تمایل آن‌ها متمایل مشو، زیرا من تو را پیرو آفریدم نه متبوع (اسم مفعول نه اسم فاعل). به همین دلیل، هنگام ذکر انبیا به او فرمود: فَبِهُداهُمُ اقْتَدِهْ (پس به هدایت آنان اقتدا کن) نه به خود آنان. و هدایت آنان چیزی جز شریعت خدا نیست. پس فرمود: شَرَعَ لَكُمْ مِنَ الدِّينِ ما وَصَّى بِهِ نُوحاً (از دین برای شما تشریع کرد آنچه را که به نوح توصیه کرده بود) و کسانی را که ذکر کرد. پس تشریع‌کننده برای ما، خدایی است که برای آنان تشریع کرد. اگر از آنان می‌گرفت، پیرو می‌بود، پس بفهم. اقطاب این امت دوازده قطب هستند که مدار این امت بر آن‌ها می‌گردد، همان‌گونه که مدار عالم جسمی و جسمانی در دنیا و آخرت بر دوازده برج است که خداوند آن‌ها را موکل کرده است تا آنچه از کون و فساد (معمولی و غیرمعمولی) در دو سرا رخ می‌دهد، آشکار سازند. اما مفردان (المفردون) بسیارند و دو ختم (الختمان) از جمله آن‌ها هستند، یعنی از مفردان. پس آن دو قطب نیستند. و در میان اقطاب کسی نیست که بر قلب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) باشد. اما مفردان، برخی از آن‌ها بر قلب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) هستند و ختم (خاتم الأولياء الخاص) از جمله آن‌هاست. اما دوازده قطب، آن‌ها بر قلوب انبیا (علیهم السلام) هستند. یکی از آن‌ها بر قلب است، و اگر بخواهی بگو بر قدم (قدم) است، و این اولی‌تر است، زیرا من این‌گونه آن را در کشف (الکشف) در اشبیلیه دیدم، و این در ادب با رسولان عظیم‌تر است، و ادب مقام ماست و آن چیزی است که برای خود و بندگان خدا می‌پسندم. پس می‌گوییم: اولی، یعنی یکی از آن‌ها، بر قدم (قدم) نوح (علیه السلام) است. و دومی بر قدم ابراهیم خلیل (علیه السلام). و سومی بر قدم موسی (علیه السلام). و چهارمی بر قدم عیسی (علیه السلام). و پنجمی بر قدم داوود (علیه السلام). و ششمی بر قدم سلیمان (علیه السلام). و هفتمی بر قدم ایوب (علیه السلام). و هشتمی بر قدم الیاس (علیه السلام). و نهمی بر قدم لوط (علیه السلام). و دهمی بر قدم هود (علیه السلام). و یازدهمی بر قدم صالح (علیه السلام). و دوازدهمی بر قدم شعیب (علیه السلام). و من همه رسولان و انبیا را به مشاهده عین دیدم و با هود، برادر عاد، به تنهایی سخن گفتم. و همه مؤمنان را نیز به مشاهده عین دیدم، چه کسانی که بوده‌اند و چه کسانی که تا روز قیامت خواهند بود. حق (الحق) آن‌ها را در یک سرزمین در دو زمان مختلف برای من آشکار ساخت. و با گروهی از رسولان، به جز محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، مصاحبت کردم و از آن‌ها بهره بردم؛ از جمله ابراهیم خلیل که قرآن را بر او خواندم، و عیسی که بر دستان او توبه کردم، و موسی که علم کشف (الکشف) و ایضاح و علم دگرگونی شب و روز را به من داد. هنگامی که این [علم] نزد من حاصل شد، شب از بین رفت و روز در تمام روز باقی ماند، پس نه خورشیدی برای من غروب کرد و نه طلوع نمود. این کشف (الکشف) برای من نشانه‌هایی از جانب خدا بود که در آخرت بهره‌ای از شقاوت ندارم. و از هود (علیه السلام) درباره مسئله‌ای پرسیدم و او مرا از آن آگاه ساخت و آن [مسئله] همان‌گونه که او مرا آگاه ساخت، در هستی (الوجود) واقع شد. این تا زمان این‌ها [انبیا] بود. و با رسولانی چون محمد (صَلَّى اللهُ عَليهِ وسَلَّم)، ابراهیم، موسی، عیسی، هود و داوود معاشرت کردم، و باقی [انبیا] رؤیت بودند نه مصاحبت.\n\n### [اینکه هر قطبی از این اقطاب، مدتی در عالم درنگ دارد]\n\nو بدان که هر قطبی از این اقطاب، مدتی در عالم درنگ دارد، یعنی دعوت آن‌ها در میان کسانی که به سوی آن‌ها مبعوث شده‌اند، آجال (مدت‌های) مخصوص و نام‌گذاری شده‌ای دارد که به آن پایان می‌یابد، سپس با دعوت دیگری نسخ می‌شود، همان‌گونه که شرایع با شرایع نسخ می‌شوند. و منظورم از دعوت آن‌ها، حکم و تأثیری است که در عالم دارند. پس مدت عمر آن‌ها را در حیات دنیوی‌شان ذکر می‌کنیم: از آن‌ها کسی است که عمر ولایتش سی و سه سال و چهار ماه بود. و از آن‌ها کسی است که مدتش سی سال و سه ماه و بیست روز بود. و از آن‌ها کسی است که مدتش بیست و هشت سال و سه ماه و ده روز به طول انجامید. و از آن‌ها کسی است که مدتش بیست و پنج سال به طول انجامید. و از آن‌ها کسی است که مدتش بیست و دو سال و یازده ماه و بیست روز به طول انجامید. و از آن‌ها کسی است که مدتش نوزده سال و پنج ماه و ده روز به طول انجامید. و از آن‌ها کسی است که مدتش شانزده سال و هشت ماه به طول انجامید. و از آن‌ها کسی است که مدتش سیزده سال و ده ماه و بیست روز به طول انجامید. و از آن‌ها کسی است که مدتش یازده سال و سه ماه و ده روز به طول انجامید. و از آن‌ها کسی است که مدتش دو سال و نه ماه و ده روز به طول انجامید. و از آن‌ها کسی است که مدتش هشت سال و چهار ماه به طول انجامید. و از آن‌ها کسی است که مدتش پنج سال و شش ماه و بیست روز به طول انجامید. و ذکر (هجیر) آن‌ها یکی است و آن «الله الله» است، با سکون هاء و تحقیق همزه. آن‌ها ذکری جز این ندارند. و غیر از این اقطاب، اقطاب شهرها، جهات، اقلیم‌ها و شیوخ جماعت‌ها انواع بسیاری هستند که در این فصل آنچه میسر شود را ذکر خواهم کرد. و این را ذکر نمی‌کنم مگر به خاطر نتیجه آن ذکر برای کسی که بر آن مداومت کند، بر حال معروف در ذکر، در زَاكِرِينَ الله كَثِيراً وَالذَّاكِرَاتِ (مردان و زنانی که خدا را بسیار یاد می‌کنند). و اگر این قصد را نداشتیم، در ذکر و تعیین آن در این کتاب منفعتی نبود. پس ابتدا از احوال این اقطاب آنچه میسر است را ذکر می‌کنیم، با وجود احدیت ذکرشان (هجیرهم). و ذکرشان به دلیل توحد مقام قطبیت، واحد شده است؛ پس آن ذکر، ذکر قطبیت است نه ذکر شخص. و هر یک از آن‌ها در اوقاتی غیر از این، ذکر مخصوصی دارند. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: لا تقوم الساعة حتى لا يبقى في الأرض من يقول الله الله (قیامت برپا نمی‌شود تا زمانی که در زمین کسی نماند که بگوید: الله الله).\n\n> منظور این است که قطبی که مدار عالم بر او باشد، باقی نمی‌ماند و نه مفردی که خداوند به همت او عالم را حفظ کند، حتی اگر قطب نباشد. پس قیامت جز بر بدترین مردم برپا نمی‌شود.\n\n### [قطب اول بر قدم نوح (علیه السلام)]\n\nاما یکی از اقطاب، بر قدم (قدم) نوح (علیه السلام) است. سوره یس از قرآن برای اوست، زیرا برای هر قطبی از این دوازده قطب، سوره‌ای از قرآن وجود دارد. و ممکن است برای غیر آن‌ها از اقطابی که ذکر کردیم، سوره یا یک آیه از قرآن باشد. و ممکن است برای یکی از آن‌ها بیش از یک سوره باشد. و ممکن است از آن‌ها کسی باشد که تمام قرآن را داشته باشد، مانند ابویزید بسطامی که نمرد تا اینکه قرآن را حفظ کرد. پس آنچه مختص این دوازده نفر از سوره‌های قرآن است را ذکر می‌کنیم. این قطب اول، سوره یس را دارد. و او کامل‌ترین اقطاب از نظر حکم است. خداوند برای او بین دو صورت ظاهری و باطنی جمع کرده است. پس او در ظاهر با شمشیر و در باطن با همت، خلیفه است. من او را نام نمی‌برم و تعیین نمی‌کنم، زیرا از این کار نهی شده‌ام و دانستم که به چه دلیلی از تعیین او با نامش منع شده‌ام. در میان این گروه از اقطاب، کسی جز او نیست که جامع آنچه قطبیت اقتضا می‌کند، به او داده شده باشد، همان‌گونه که به آدم (علیه السلام) همه اسماء داده شد و به محمد (صَلَّى اللهُ عَليهِ وسَلَّم) جوامع الکلم داده شد. اگر قطبی بر قدم (قدم) محمد (صَلَّى اللهُ عَليهِ وسَلَّم) بود، این قطب می‌بود، اما کسی بر قدم محمد (صَلَّى اللهُ عَليهِ وسَلَّم) نیست، مگر برخی از افراد بزرگ (الأفراد الأکابر) که تعدادشان معلوم نیست و در میان خلق پنهان هستند، مبرا و دانای به خدا. نه زیانی می‌رسانند و نه شناخته می‌شوند تا زیان ببینند. مقام آن‌ها حفظ در دانشی است که دارند. هیچ شبهه‌ای که آن‌ها را در آنچه دانسته‌اند متحیر کند، بر علمشان وارد نمی‌شود، بلکه آن‌ها بر بینه‌ای از پروردگارشان هستند. این حال افراد (الأفراد) است. پس به ذکر این قطب بازگردیم.\n\n### [منازل هر قطب به تعداد آیات سوره‌اش است]\n\nپس می‌گوییم که منازل او نزد خدا به تعداد آیات این سوره است. و همچنین منازل هر قطبی به تعداد آیات سوره‌اش است. و سوره‌های آن‌ها معلوم است که به طور کلی ذکر می‌کنم و سپس اگر خدا بخواهد آن‌ها را ذکر خواهم کرد. همان‌طور که گفتیم، اولی سوره یس را دارد. و دومی سوره اخلاص. و سومی سوره اذا جاء نصر الله. و چهارمی سوره کافرون. و پنجمی سوره اذا زلزلت. و ششمی سوره بقره. و هفتمی سوره مجادله. و هشتمی سوره آل عمران. و نهمی سوره کهف است، و او کسی است که دجال را می‌کشد و عیسی (علیه السلام) را درک می‌کند. و دهمی سوره انعام. و یازدهمی سوره طه. و این قطب، نایب حق تعالی است، همان‌گونه که علی بن ابی طالب نایب محمد (صَلَّى اللهُ عَليهِ وسَلَّم) در تلاوت سوره برائت بر اهل مکه بود.\n\n> و [پیامبر] ابوبکر را با آن [سوره] فرستاده بود، سپس از آن بازگشت و فرمود: «قرآن را جز مردی از اهل بیت من ابلاغ نمی‌کند.» پس علی را فراخواند و به او دستور داد تا به ابوبکر برسد. هنگامی که به مکه رسید، ابوبکر با مردم حج گزارد و علی سوره برائت را به مردم ابلاغ کرد و آن را به نیابت از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) بر آنان تلاوت نمود.\n\nو این [واقعه] دلیلی بر صحت خلافت ابوبکر صدیق و منزلت علی (رضی الله عنهما) است. و دوازدهمی سوره تبارک الملک. این‌ها سوره‌های اقطاب از قرآن هستند، جز اینکه صاحب سوره مجادله که قَدْ سَمِعَ الله قَوْلَ الَّتِي تُجادِلُكَ فِي زَوْجِها وَتَشْتَكِي إِلَى الله (خداوند سخن زنی را که درباره شوهرش با تو مجادله می‌کرد و به خدا شکایت می‌برد، شنید) است، در واقع سوره او واقعه است و او شیفته این سوره است. و همچنین کسی که سوره اخلاص را دارد و بس. و منازل آن‌ها همان‌گونه که ذکر کردیم، به تعداد آیات است، جز اینکه منازل بر حسب آیات و آنچه در آن‌ها ذکر شده است، می‌باشد. زیرا برتری در آیات مشهور است، به شیوه‌ای که آمده است، و فضیلت آن به تلاوت‌کننده بازمی‌گردد، از آن جهت که آیه در تلاوت، متکلم به آن است، نه از آن جهت که کلام خداست، زیرا در آن تفاوتی نیست. بلکه تفاوت در چیزی است که به آن تکلم شده، نه در کلام او. پس این را بدان. اما حال این قطب، او در عالم تأثیر ظاهری و باطنی دارد. خداوند این دین را به واسطه او استوار می‌سازد. او را با شمشیر آشکار ساخت و از ستم حفظ کرد. پس به عدل که حکم حق (الحق) در حوادث است، حکم می‌کند. و چه بسا کسانی که از اهل مذاهب مانند شافعیه، مالکیه، حنفیه و حنابله و کسانی که به قول امامی منتسب هستند که با حکم این قطب موافق نیست، با حکم او مخالفت کنند. او خلیفه در ظاهر است. پس اگر بر خلاف آنچه ادله این ائمه اقتضا می‌کند حکم کند، پیروان آن‌ها حکم او را خطا می‌دانند و بدون شک نزد خدا گناهکار می‌شوند، در حالی که هُمْ لا يَشْعُرُونَ (نمی‌دانند). زیرا آن‌ها حق ندارند مجتهدی را تخطئه کنند، چون مصیب (درستکار) نزد آن‌ها یکی است که معین نیست. و کسی که حالش این‌گونه است، نباید به تخطئه عالمی از علمای مسلمانان اقدام کند، همان‌گونه که کسانی درباره امارت اسامه و پدرش زید بن حارثه سخن گفتند تا جایی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در این باره آنچه گفت، فرمود. پس اگر در کسی که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) او را مقدم داشت و فرماندهی داد، طعنه زدند و نظر خود را بر نظر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) ترجیح دادند، حال آن‌ها با قطب چگونه خواهد بود؟ و شهرت کجا و شهرت کجا؟ هیهات! ما رستگار شدیم و يَخْسَرُ الْمُبْطِلُونَ (باطل‌گرایان زیانکارند). به خدا سوگند، کسی دعوت‌کننده به سوی خدا نیست مگر کسی که بر بصیرت دعوت کند، نه کسی که بر گمان دعوت کند و بر اساس آن حکم نماید. ناگزیر، کسی که حالش این‌گونه است، بر امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) آنچه را که خداوند بر آن‌ها وسعت داده بود، محدود کرد. پس خداوند امر آن‌ها را در آخرت بر آن‌ها تنگ گرفت و در روز قیامت مطالبه و محاسبه را بر آن‌ها سخت کرد، به دلیل اینکه بر بندگان خدا سخت گرفتند که در یک حادثه برای رفع حرج از مذهبی به مذهب دیگر منتقل نشوند و اعتقاد داشتند که این بازی با دین است. و ندانستند که با این سخن از دین خارج شده‌اند. بلکه شریعت خدا وسیع‌تر و حکم او جامع‌تر و نافع‌تر است. وَقِفُوهُمْ إِنَّهُمْ مَسْؤُلُونَ ما لَكُمْ لا تَناصَرُونَ بَلْ هُمُ الْيَوْمَ مُسْتَسْلِمُونَ (آن‌ها را نگه دارید که مسئولند. شما را چه شده که یکدیگر را یاری نمی‌کنید؟ بلکه آن‌ها امروز تسلیم‌شدگانند). این حال آن‌ها در روز قیامت است و لَا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُونَ (به آن‌ها اجازه داده نمی‌شود که عذرخواهی کنند). و برای این قطب مقام کمال است، پس هیچ وصفی او را محدود نمی‌کند. او حکیم زمان است که جز به حکم زمان و آنچه حال زمان اقتضا می‌کند، ظاهر نمی‌شود. اراده به حکم او، نه به حکم اراده است. پس سیادت از آن اوست و در او ده خصلت است: اول: حلم (بردباری) همراه با قدرت، زیرا او با همت (الهمة) فعل می‌کند، پس هرگز برای خود خشمگین نمی‌شود. و اگر محارم خدا هتک شود، هیچ چیز در برابر خشم او نمی‌ایستد، پس او برای خدا خشمگین می‌شود. دوم: تأنی (آهستگی) در اموری که خداوند تأنی در آن‌ها را می‌پسندد، همراه با شتاب به سوی خیرات. پس او به سوی تأنی شتاب می‌کند و مواضع آن را می‌شناسد. سوم: اقتصاد (میانه‌روی) در امور، پس بر آنچه زمان می‌طلبد چیزی نمی‌افزاید، زیرا میزان در دست اوست. با آن زمان و حال را می‌سنجد و از حال خود برای زمانش و از زمانش برای حال خود می‌گیرد، پس پایین می‌آورد و بالا می‌برد. چهارم: تدبیر، و آن معرفت حکمت است. پس مواضع را می‌شناسد و با اموری که مواضع می‌طلبند، با آن‌ها روبرو می‌شود.\n\n> همان‌گونه که ابودجانه عمل کرد، هنگامی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) شمشیر را با حق آن در برخی از غزوات به او داد، و او با تکبر بین صفوف راه رفت. رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در حالی که به غرور او می‌نگریست، فرمود: «این راه رفتنی است که خدا و رسولش آن را دشمن می‌دارند، مگر در این موضع.»\n\nو به همین دلیل، راه رفتن رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) با سرعت بود، گویی در سرازیری فرود می‌آید. صاحب تدبیر در امور می‌نگرد پیش از آنکه آن‌ها را در عالم شهادت آشکار سازد. پس او در عالم غیب تصرف دارد. از معانی جز آنچه حکمت اقتضا می‌کند، نمی‌گیرد. پس هُوَ الْحَكِيمُ الْخَبِيرُ (او حکیم و آگاه است). آنچه را که شایسته است به صورت مجمل آشکار سازد، مجمل آشکار می‌سازد، و آنچه را که شایسته است به صورت مفصل آشکار سازد، مفصل آشکار می‌سازد، و آنچه را که شایسته است محکم آشکار سازد، محکم آشکار می‌سازد، و آنچه را که شایسته است متشابه آشکار سازد، متشابه آشکار می‌سازد. و خصلت پنجم: تفصیل، و آن علم به چیزی است که تمایز بین اشیا به واسطه آن رخ می‌دهد، از آنچه اشتراک به واسطه آن رخ می‌دهد. پس هر امری از مشابه، مقابل و مخالف خود جدا می‌شود. و به اسماء الهی نزدیک به تشابه می‌پردازد، مانند علیم، خبیر، محصی، محیط و حکیم. همه این‌ها از اسماء علم هستند و به معنای علیم می‌باشند، جز اینکه بین هر یک و دیگری نکته دقیق و حقیقتی وجود دارد که به واسطه آن از بقیه متمایز می‌شود. همین‌گونه است در هر اسمی که بین آن و دیگری مشارکتی وجود دارد. و ششم: عدل، و آن امری است که در حکومت‌ها، تقسیم‌ها، قضاوت‌ها و رساندن حقوق به صاحبانشان به کار می‌رود. و در حقوق شبیه به چیزی است که خداوند درباره خود ذکر کرده است که أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ (به هر چیزی خلقتش را عطا کرد) و قول او درباره موسی: قَدْ عَلِمَ كُلُّ أُناسٍ مَشْرَبَهُمْ (هر گروهی آبشخور خود را دانستند) و قول او درباره ناقه صالح: لَها شِرْبٌ وَلَكُمْ شِرْبُ يَوْمٍ مَعْلُومٍ (برای او نوبتی از آب است و برای شما نوبت آبی در روزی معلوم). و علم جزا در دو سرا و عدل بین جنایت و حد و تعزیر به آن مرتبط است. و هفتم: ادب، و آن علم به جوامع همه خیرات در هر عالمی است. و آن علمی است که او را در بساط حاضر می‌سازد و مجالست، شهود (الشهود)، مکالمه، مسامره و حدیث و خلوت و معامله با آنچه در نفس حق (الحق) در مواطن جلوه است، به او می‌بخشد. پس این و امثال آن، ادب است. و هشتم: رحمت، و متعلق آن از او هر مستضعف و هر جباری است. پس با رحمت و لطف خود، او را از جبروت، کبریا و عظمتش با کمترین مؤونه، در نرمی، عطوفت و قلب (جنان) پایین می‌آورد. و نهم: حیا، پس از دروغگو در برابر دروغگو حیا می‌کند و با صورتی از صدق او در قولش بر او ظاهر می‌شود، نه با صورتی که از او چشم‌پوشی کند، تا دروغگو گمان کند که سخن او بر او گذشته است و او به مقام و آنچه آورده است، جاهل است. سپس در کار خود خوار می‌شود، اما در حق او نزد پروردگارش جز واسطه خیر نیست که برای او در تجاوز از آنچه بین او و خداست، هنگام توقف و سؤال در روز قیامت دعا می‌کند. و در خبر آمده است که خداوند در روز قیامت پیری را فرا می‌خواند و به او می‌گوید: چه کردی؟ او می‌گوید: از مقربات آنچه خدا خواست. و خدا می‌داند که او در گفتارش دروغگوست. پس دستور می‌دهد که او را به بهشت ببرند. فرشتگان می‌گویند: پروردگارا، او در آنچه ادعا کرد دروغ گفت. حق (الحق) می‌فرماید: من این را می‌دانستم، اما از او حیا کردم که پیری او را دروغگو سازم.\n\nو رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) این خبر را از خدا به ما نرساند مگر برای اینکه ما نیز دارای این صفت باشیم. پس ما به آن سزاوارتریم، به دلیل نیازمان به اینکه حق (الحق) با ما چنین معامله‌ای کند. و دهم: اصلاح، و بزرگ‌ترین آن اصلاح ذات البین است، و آن قول خداوند متعال است: وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ (و میان خود را اصلاح کنید). و در خبر آمده است که خداوند در روز قیامت میان بندگانش اصلاح می‌کند. پس ظالم و مظلوم را برای حکومت و انصاف در برابر خود نگه می‌دارد. سپس به آن‌ها می‌گوید: سرهای خود را بالا بگیرید. پس به خیر بسیاری می‌نگرند. می‌گویند: این خیر برای کیست؟ خداوند به آن‌ها می‌گوید: برای کسی که بهای آن را به من بدهد. مظلوم می‌گوید: پروردگارا، چه کسی توانایی بهای این را دارد؟ خداوند به او می‌گوید: تو با عفو از برادرت. مظلوم می‌گوید: پروردگارا، من او را بخشیدم. خداوند به او می‌گوید: دست برادرت را بگیر و وارد بهشت شوید. سپس رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) تلاوت کرد: فَاتَّقُوا الله وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ (پس از خدا بترسید و میان خود را اصلاح کنید)، زیرا خداوند در روز قیامت میان بندگانش اصلاح می‌کند.\n\n### [قطب دوم از دوازده قطب، بر قدم خلیل ابراهیم (علیه السلام)]\n\nاما قطب دوم از دوازده قطب، بر قدم (قدم) خلیل ابراهیم (علیه السلام) است. او کسی است که سوره اخلاص را دارد، که محبت او به این سوره او را وارد بهشت کرد. و برای خواننده آن، ثلث قرآن است. و منازل او به تعداد آیات آن است. و او صاحب حجت و دلیل نظری است. او در معقولات غور می‌کند و به صواب می‌رسد و خطا نمی‌کند. این بدان سبب است که مردم در مورد علم موهوبی که شأن آن این است که عاقل با فکر خود آن را درک کند و دلیل نظر او را به آن برساند، اختلاف کرده‌اند. برخی گفتند: چنین علمی، اگر خداوند آن را به کسی ببخشد، آن را با دلیلش می‌بخشد. پس دلیل و مدلول را می‌داند و این ضروری است. و من ابوعبدالله کتانی را در شهر فاس دیدم که امامی از ائمه مسلمانان در اصول دین و فقه بود و به این قول معتقد بود. به او گفتم: این ذوق (ذوق) توست. حق (الحق) آن را این‌گونه به تو داده است. پس ذوق تو صحیح است و حکم تو صحیح نیست. بلکه ممکن است علم را که جز با دلیل نظری حاصل نمی‌شود، به او بدهد، اما دلیل آن را به او ندهد. و ممکن است آن را به او بدهد و دلیلش را نیز به او بدهد، مانند ابراهیم خلیل. خداوند متعال فرمود: وَتِلْكَ حُجَّتُنا آتَيْناها إِبْراهِيمَ عَلى‏ قَوْمِهِ (و این حجت ما بود که آن را به ابراهیم در برابر قومش دادیم). و این کامل‌تر از کسی است که علمی را که با دلیل حاصل می‌شود، به او می‌دهند اما دلیل را نمی‌دهند. و هیچ‌کس شرط نمی‌کند که دلیل خاصی داده شود، بلکه دلیلی به طور کلی داده می‌شود، زیرا ادله بر یک چیز ممکن است زیاد باشد. و برخی از آن‌ها در نهایت وضوح هستند و برخی مبهم، مانند مسئله ابراهیم خلیل در زنده کردن مردگان و میراندن زندگان و عدول او به اینکه خصم، خورشید را که از مشرق می‌آید، از مغرب بیاورد. و هر دو دلیل بر مقصود هستند. این قطب از دعوت‌کنندگان به سوی خدا با امر الهی است. و مسکن او در هوا، در فضای جو، در خانه‌ای است که بر کرسی نشسته است و به خلق می‌نگرد. گروهی از اهل الله و خواص او پیوسته نزد او تلاوت می‌کنند. سخن او درباره احدیت الهی و احدیت واحد و احدیت وحدانیت با ادله نظری است. و او آن‌ها را از طریق نظر به دست نیاورده، بلکه حق تعالی آن‌ها را این‌گونه به او بخشیده است. و حال او همیشه حضور است، جز اینکه مانند دیگران متحیر نشده است، بلکه خداوند آنچه را که باید نزد آن توقف کند، برای او آشکار ساخته و خاطر او را به آنچه موجب حیرت می‌شود، مشغول نکرده است. او با خدا برای برآوردن حوائج مردم فارغ شده است. او اسماء الهی را به معرفت (المعرفة) کامل می‌شناسد. او به نفی مثلیت در جانب حق (الحق) قائل است. حق (الحق) مرا به شیوه‌ای که عادت بر آن جاری است که بندگانش را در اسرارشان آگاه سازد، خبر داد که این بنده، رحمت بر بندگانش و صله رحم را به او داده است. او در مورد امری از خدا سؤال کرد، اما خداوند به او پاسخ مثبت نداد، و آن این بود که از خدا خواست که مقامش را به نسل او به ارث بگذارد. خداوند به او فرمود: این به تو مربوط نیست. مقام خلافت با ارث نیست. این در علوم و اموال است. اما خلافت، هر خلیفه‌ای در میان قومی بر حسب زمان آن‌هاست، زیرا مردم در زمان خود شبیه‌تر به خودشان هستند تا به پدرانشان. زیرا حق (الحق) بر خلق حکم نمی‌کند مگر در علم و خلق. کسی نمی‌داند که او این مرتبه را دارد مگر کسی که خدا او را آگاه سازد. و من دیدم کسی را که خداوند به واسطه مصاحبت با من بر او گشود و احوال و علومی کسب کرد و عادات را شکست. خداوند این را به دلیل حسن معامله او با خدا به او داد. و او به من خبر داد که هیچ‌یک از آنچه بر آن است را جز از من کسب نکرده است، در حالی که من از این امر اطلاعی ندارم. من فقط به سوی خدا دعوت می‌کنم و خدا می‌داند چه کسی اجابت می‌کند. يَوْمَ يَجْمَعُ الله الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ قالُوا لا عِلْمَ لَنا إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ (روزی که خداوند رسولان را جمع می‌کند و می‌گوید: چه پاسخی شنیدید؟ می‌گویند: ما علمی نداریم، تویی که دانای غیب‌هایی). و راست گفتند. و امر همین‌گونه است. هیچ‌کس علمی ندارد مگر کسی که خدا به او بیاموزد. و غیر از این طریق الهی در تعلیم، فقط غلبه گمان یا مصادفه علم یا جزم بر وهم است. اما علم، نه. زیرا همه راه‌هایی که به علم می‌رسند، در آن‌ها شبهه‌ای وجود دارد که نفس طاهری که خداوند او را بر این شبهات آگاه ساخته است، اطمینان نمی‌کند که حصول علم از آن‌ها قطعی باشد، مگر از طریق الهی، و آن قول خداوند متعال است: إِنْ تَتَّقُوا الله يَجْعَلْ لَكُمْ فُرْقاناً (اگر از خدا پروا کنید، برای شما فرقان (جدایی‌انداز) قرار می‌دهد) و قول او: خَلَقَ الْإِنْسانَ عَلَّمَهُ الْبَيانَ (انسان را آفرید، بیان را به او آموخت). پس او از آنچه در نفس اوست بیان می‌کند. و برای این قطب اسرار عجیبی است.\n\n### [قطب سوم که بر قدم موسی (علیه السلام) است]\n\nاما قطب سوم که بر قدم (قدم) موسی (علیه السلام) است، سوره او إِذا جاءَ نَصْرُ الله والْفَتْحُ (هنگامی که یاری خدا و پیروزی فرا رسد) است. و منازل او به تعداد آیات آن است و این سوره ربع قرآن را دارد. این قطب از اوتاد بود، سپس به قطبیت منتقل شد، همان‌گونه که قطب دوم از ائمه بود و سپس به قطبیت منتقل شد. او صاحب جهد و مکابده است و از اشتغال به خلق نزد خدا جدا نمی‌شود. خداوند در منزل ندا، دوازده هزار علم را به صورت ذوق (ذوق) در یک شب به او عطا کرد. و منزل ندا از بزرگ‌ترین منازل است که ما آن را در منزل المنازل از این کتاب تعیین کرده‌ایم و ما در مورد طبقات منازل و کمیت‌های آن‌ها جزء مستقلی داریم. از جمله علوم این قطب، علم افتقار به خدا به واسطه خداست. و آن علم شریفی است که من برای آن ذائقه‌ای مانند آنچه چشیده‌ام، ندیده‌ام. و معنا و سرّ این [علم] این است که خداوند او را آگاه ساخته است که:\n\nحاجت اسماء به تأثیر در اعیان ممکنات، بزرگ‌تر از حاجت ممکنات به ظهور اثر در آن‌هاست. و این بدان سبب است که اسماء در ظهور آثار خود، سلطنت و عزت دارند، در حالی که ممکنات ممکن است اثری در آن‌ها حاصل شود که به واسطه آن ضرر ببینند یا نفع ببرند، و آن‌ها در خطر هستند. اگر مخیر می‌شدند، بقای آن‌ها بر حالت عدم برایشان دوست‌داشتنی‌تر بود، زیرا آن‌ها در مشاهده ثبوتی حالی، به التذاذ ثبوتی لذت می‌برند و هر حالی از حال دیگر منزوی است. احوال در حال ثبوت، عین واحدی را جمع نمی‌کنند، در حالی که در شیئیت هستی (الوجود) در عین واحدی ظاهر می‌شوند. مثلاً زیدِ سالم در یک زمان، همان زیدِ بیمار در زمان دیگر است، و عافیت‌یافته در یک زمان، همان مبتلا در آن زمان است. اما در ثبوت این‌گونه نیست، زیرا درد در ثبوت در عین متألم نیست، بلکه در عین اوست. پس او به ثبوت خود لذت می‌برد، همان‌گونه که به وجود خود در متألم لذت می‌برد، در حالی که محل به واسطه آن متألم است. و سبب آن این است که ثبوت بسیط و مفرد است و هیچ چیزی به چیز دیگری قائم نیست. و در هستی (الوجود) جز ترکیب نیست. پس حامل و محمول وجود دارد. محمول همیشه منزلتش در هستی (الوجود) مانند منزلتش در ثبوت است، در نعمتی دائمی. اما حامل این‌گونه نیست. زیرا اگر محمول موجب لذت شود، حامل لذت می‌برد، و اگر موجب درد شود، حامل متألم می‌شود. و این برای او در حال ثبوت وجود نداشت، بلکه عین حامل در ثبوت خود، در آنچه در هستی (الوجود) بر آن خواهد بود، تا بی‌نهایت ظاهر می‌شود. پس هر حالی که بر آن باشد، در کنار اوست و به آن می‌نگرد و محمولی در آن نیست. پس عین به ذات خود لذت می‌برد و حال به ذات خود لذت می‌برد. پس حال احوال، ذوقش با هستی (الوجود) تغییر نمی‌کند، اما حال حامل با هستی (الوجود) تغییر می‌کند. و این علم عزیزی است. و اعیان این را در ثبوت نمی‌دانند مگر با نظر حال به آن‌ها، اما نمی‌دانند که اگر آن را حمل کنند، به واسطه آن متألم می‌شوند، زیرا آن‌ها در حضرتی هستند که طعم آلام را در آن نمی‌شناسند، بلکه آن را دوست خود می‌گیرند. اگر عین می‌دانست که اگر به آن حال متصف شود، متألم خواهد شد، در حال ثبوت خود با نظر آن حال به او، متألم می‌شد، به دلیل علمش به اینکه در حال هستی (الوجود) به آن متلبس می‌شود و آن را حمل می‌کند. پس الفت گرفتن با آن در ثبوت، برای او نعمت است. و این فن از بزرگ‌ترین اسرار علم خدا در اشیا است که من آن را به صورت ذوق (ذوق) الهی مشاهده کردم، زیرا برخی از بندگان خدا هستند که خداوند آن‌ها را به کشف (الکشف) بر اعیان ثبوتی آگاه می‌سازد و آن‌ها را بر صورتی که ذکر کردیم، از مجاورت و نظر می‌بینند و در آن‌ها حال و محلی نمی‌بینند.\n\n> بلکه هر ذاتی به تنهایی است، *** بدون آمیختگی و بدون اتحاد.\n> و نه حلول و نه انتقال، *** و نه توافق و نه عناد.\n\nپس اگر فرق بین هستی (الوجود) و ثبوت و احکامی که اعیان در هستی (الوجود) و در ثبوت دارند را فهمیدی، می‌دانی که برخی از اعیان نمی‌خواهند اثر در آن‌ها به واسطه حال ظاهر شود، زیرا در آن ذوقی ندارند. پس اگر ذوق درد در حال ثبوت بر آن‌ها عرضه می‌شد، ناله می‌کردند. زیرا امر آن‌ها در حال هستی (الوجود)، اگر درد را حمل کنند، ممکن است صبر را حمل کنند و ممکن است حمل نکنند. و ما فرض می‌کنیم که در حال ثبوت، حامل و فاقد صبر هستند. پس آن‌ها با زبان حال، آن افتقار به طلب هستی (الوجود) را ندارند، و اگر آن را با قول ثبوتی از خدا طلب کنند، هنگامی که موجود شوند، می‌گویند، همان‌گونه که از برخی نقل شده است: ای کاش آفریده نمی‌شدم، ای کاش مادرش او را نزاییده بود، ای کاش نازا بود و امثال این‌ها. پس اعیان کمتر از اسماء افتقار دارند و اسماء به دلیل نعمتی که در آن دارند، شدیدتر افتقار دارند، به ویژه که ابتهاج ذاتی حق (الحق) به کمال را مشاهده می‌کنند، از آن جهت که ممکنات در ثبوت خود همراه ذات او هستند و او از اثر آن‌ها و تأثر به سبب آن‌ها منزه است. پس او از حیث ذات خود در کمال است از تأثر در حال ثبوت اعیان و حال هستی (الوجود) آن‌ها، زیرا در نفس او علمی به آنچه بر آن نبوده‌اند، افزوده نشده است، بلکه آن‌ها علم به شأن خود را از ازل به او داده‌اند و با آن صورت موجود می‌شوند. پس مجاورت در ثبوت، حلول در هستی (الوجود) است. پس در ثبوت در کنار آن است و در هستی (الوجود) حال در آن است. پس این یک علم از آن علوم است. پس این را بدان.\n\n### [قطب چهارم که بر قدم عیسی (علیه السلام) است]\n\nاما قطب چهارم که بر قدم (قدم) عیسی (علیه السلام) است، سوره او از قرآن قُلْ يا أَيُّهَا الْكافِرُونَ (بگو ای کافران) است. و این سوره ربع قرآن را دارد و منازل او به تعداد آیات آن است. این قطب از ضنائن (کسانی که حفظ شده‌اند) و مصانین (کسانی که صیانت شده‌اند) است. او تجلی دائم (التجلی الدائم) دارد. سخن او درباره جمع و هستی (الوجود) و علم مزید است. اگر شبهه‌ای در کسی ببیند که بین او و علم حائل شده است، آن را برطرف می‌کند تا صورت حق (الحق) در آن امر برای صاحبش آشکار شود. او ششصد کلید مقام دارد و در هر مقام از علوم آنچه خدا بخواهد وجود دارد. او علم امتزاج و ترکیب اعتدالی را دارد. انحراف، نقص و زیاده را نمی‌شناسد. مسکن او در قبه ارین است و از خلق منقطع است، مگر کسی که خدا بخواهد. او با خدا پاک زیست تا اینکه خدا او را قبض روح کرد. او نیز از اوتاد بود و به قطبیت منتقل شد. او می‌گوید: هستی (الوجود)، هستی حق (وجود الحق) است و جمع، جمع حق (جمع الحق) است. صفات قدم و حدوث. و این علم غریبی در جمع است که من کسی از اهل الله را ندیدم که به آن قائل باشد جز این قطب. زیرا من این اقطاب را مشاهده کردم و حق (الحق) آن‌ها را به من نشان داد، اگرچه از دنیا رفته‌اند. و آن علمی است که شرایع در جانب حق (الحق) با آن وارد شده‌اند. پس می‌گوییم: آن همان جمع است. و نزد او، مُحدَث (مخلوق) صاحب ادعا در آن صفات نامیده شده به مُحدَث است. و به خاطر ادعای او گفتیم که جمع است، وگرنه امر واحد است. همه آن‌ها صفات قدم در قدیم و مُحدَث در مُحدَث هستند، به دلیل ظهورشان در آن و اینکه قبلاً ظاهر نبودند. پس نزد متصف به آن‌ها حادث شدند، همان‌گونه که فرمود: ما يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ (هیچ ذکری از پروردگارشان به آن‌ها نمی‌رسد مگر اینکه تازه است)، در حالی که آن جز کلام قدیم خدا نیست. پس ما آنچه را که برای اوست با نسبت به ما بر او جمع کردیم. پس کسی که این کار را انجام داد، صاحب جمع و هستی (الوجود) نامیده شد. پس حکم ممکنات، وجود حق (وجود الحق) است و نه غیر آن. پس کسی که جمع را این‌گونه بفهمد، امور را آن‌گونه که هست می‌داند.\n\n> هر کس جمع را این‌گونه بداند، *** امر را می‌داند که چگونه است.\n> پس او حق (الحق) است و نه غیر او، *** پس به غیر او گوش مسپار.\n\n### [قطب پنجم که بر قدم داوود (علیه السلام) است]\n\nاما قطب پنجم که بر قدم (قدم) داوود (علیه السلام) است، سوره او از قرآن إِذا زُلْزِلَتِ (هنگامی که زمین لرزانده شود) است. و این سوره نصف قرآن را دارد و منازل او به تعداد آیات آن است. و حال او تفرقه است. و او مقام محبت را دارد. پس او معلول عشق است. درد او، درمان اوست. و او علمی ندارد که در آن بر دیگری پیشی گیرد، مگر علم ثبوت محبت الهی و کونی. و به همین دلیل در مقام تفرقه بود. و او از ائمه بود و سپس به قطبیت منتقل شد. این قطب می‌گوید: محبت ثابت نشده است. و هر محبتی که زائل شود، محبت نیست، یا اگر تغییر کند، محبت نیست. زیرا سلطان محبت عظیم‌تر از آن است که چیزی آن را زائل کند، حتی غفلتی که بزرگ‌ترین سلطانی است که بر انسان حکم می‌راند، نمی‌تواند محبت را از محب زائل کند. نزد او ممکن است انسان از خود به محبوبش غافل شود، اما برای محب ممکن نیست که به واسطه کسی از محبوبش غافل شود. پس آن، محب است و آن، محبت است.\n\n> فدای محبت آن است که زائل نمی‌شود، *** و شفا برای آن محال است.\n> پس به غیر از این تکیه مکن، *** و به آنچه می‌گوید گوش مسپار.\n\nپس به محبت خدا، ما خدا را دوست داشتیم. و محبت حق (الحق) تغییر نمی‌کند. پس محبت کون تغییر نمی‌کند. به او گفته شد: آیا محبت کونی تغییر می‌کند؟ گفت: نه، زیرا کون محبوب ذات خود است و محبت ذاتی زوال‌پذیر نیست. قیل له: فقد رأينا من تستحيل مودته (به او گفته شد: ما دیده‌ایم کسی را که مودتش تغییر می‌کند). گفت: آن اراده است، محبت نیست. زیرا اگر محبت بود، ثابت می‌ماند. آیا نمی‌بینی که به دلیل ثبوت و ثبوت حکمش، ود (دوستی) نامیده می‌شود؟ و این بدان سبب است که در محب برای غیر محبوبش، فضله‌ای از ذاتش وجود ندارد که زائل‌کننده بتواند از آن وارد شود. این سبب ثبوت آن است. زیرا او عین محبوب خود را در هر چیزی که مشاهده می‌کند، می‌بیند، پس او را گم نمی‌کند. اگر برای محب صحیح بود که غیر محبوب خود را در عین چیزی مشاهده کند، از آن چیزی بر او وارد می‌شد که محبتش را زائل می‌کرد. و این در محبت واقع نمی‌شود. پس حکم اراده با حکم محبت بر من مشتبه شد. و هر مریدی محب نیست و هر محبی مرید است. و هر مرادی محبوب نیست و هر محبوبی مراد است. پس مقام این قطب همان است که ذکر کردیم و شأن او عجیب است و تفصیل حال او طولانی می‌شود و مذهب ما اختصار است.\n\n### [قطب ششم که بر قدم سلیمان (علیه السلام) است]\n\nاما قطب ششم که بر قدم (قدم) سلیمان (علیه السلام) است، سوره او واقعه است. و برای او حیات دائمه است. و منازل او به تعداد آیات آن است. او به علم حیات و حیوان اختصاص یافته است. هیچ حالی از احوال خود را جز از پروردگارش نمی‌گیرد. پس احوال او، احوال پروردگار اوست. هدایت او، هدایت انبیاست، همان‌گونه که خداوند به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) دستور داد، هنگامی که انبیا (علیهم السلام) را برای او ذکر کرد، فرمود: أُولئِكَ الَّذِينَ هَدَى الله فَبِهُداهُمُ اقْتَدِهْ (آنان کسانی هستند که خدا هدایتشان کرده، پس به هدایت آنان اقتدا کن). و نفرمود: فبهم اقتده (پس به آنان اقتدا کن). پس دانستیم که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) با همه کسانی که ذکر کرد و کسانی که ذکر نکرد، مساوی است. زیرا برای هر پیامبری هدایتی است، همان‌گونه که ذکر کرد: لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً وَمِنْهاجاً (برای هر یک از شما شریعت و راهی قرار دادیم). پس او سبحانه شرایع را نصب کرد و راه‌ها را روشن ساخت و همه این‌ها را در محمد (صَلَّى اللهُ عَليهِ وسَلَّم) جمع کرد. پس هر کس او را ببیند، همه مقربان را دیده است. و هر کس به هدایت او هدایت شود، به هدایت همه هدایت شده است.\n\n> پیامبران. و بر خدا عجیب نیست *** که عالم را در یک نفر جمع کند.\n\nو منظورم از اینکه می‌گویم احوال این قطب، احوال پروردگار اوست، همان است که حق (الحق) درباره خود فرمود که: كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ (او هر روز در کاری است). پس این عبارت از اختلاف احوال است. او از قومی است که حق (الحق) را در شئوناتش مشاهده می‌کنند. پس به آنچه از شئونات در آن‌هاست می‌نگرند و به واسطه او به آن‌ها متلبس می‌شوند. پس آن‌ها بر احوال خود بصیرت دارند. کسی که حالش این‌گونه است، مانند کسی نیست که حالش تخلق به اسماء الهی است. بلکه برای این یکی ذوقی است و برای آن دیگری ذوقی. چنین مردی مجهول الحال است، زیرا مواطن حق (الحق) پنهان است و جز کسی که مقامش تلبس به شئونات باشد، آن را درک نمی‌کند. و دلیل بر این امر این است که ما بر این اجماع کرده‌ایم که هیچ موجدی جز خدا نیست و او حکیم است که امور را در جای خود قرار می‌دهد و از موضع آن تجاوز نمی‌کند. پس هر چیزی که در عالم ظاهر شده، حکمتی در موضع خود دارد. و ما اجماع کرده‌ایم که همه خلق و بیشتر اهل الله می‌گویند: اگر فلان کار از کارهایی که به دست انسانی در هستی (الوجود) ظاهر شده، انجام می‌شد، بهتر از این کاری بود که انجام دادی و اولی‌تر بود. این را به کسی می‌گویند که آن فعل الهی در او و به دست او ظاهر می‌شود. آیا این جز به دلیل جهل آن‌ها به حکمت خدا در آنچه برایشان رخ داده است، نیست؟ این [اعتراض] از اهل الله جز به غفلت از خدا رخ نداده است، نه به جهلشان. پس هنگامی که یادآوری می‌شوند، متذکر می‌شوند. و از غیر اهل الله به جهلشان رخ می‌دهد، نه به غفلتشان. زیرا او از آنچه در مورد آن فعل از پستی به آن رسیده است، دست نمی‌کشد تا زمانی که حکمت خدا در آن برای او آشکار شود. هنگامی که آشکار شد، آنگاه به جهل خود اعتراف می‌کند و به کوتاهی علم و عقل خود پی می‌برد. و من کسی از اهل این ذوق را ندیدم و نشنیدم که دیده شده باشد، در حالی که او در نهایت ظهور نزدیک است، اما اغراض و هواهای نفسانی از تلاش برای تحصیل آن جلوگیری می‌کنند. و این بدان سبب است که حجت کسی که از اهل دین است و قصد تحصیل آن را ندارد، این است که می‌گوید: شرع به ما دستور داده است که چیزهایی را انکار کنیم و بگوییم ترک این کار از انجام آن بهتر است، با علم به اینکه فعل از خداست. گفتیم: راست گفتی، اما چنین اعتراضی از شخصی که رتبه مرا فهمیده باشد، صادر نشده است. و این بدان سبب است که گفتم او حکمت خدا را در آنچه اعتراض کرده، ندانسته است. پس کسی که با اعتراض شرع اعتراض کند، او ناقل اعتراض خداست در آنچه اعتراض کرده، نه معترض. و آن اعتراض، هنگامی که از خدا یافت شود، صاحب این ذوق حکمت و منزلت آن را می‌داند. و صاحب این حال به معروف امر می‌کند و از منکر نهی می‌کند و حدود را برپا می‌دارد، در حالی که حکمت همه آن را مشاهده می‌کند و آن را در شئونات الهیه مشهود برای او می‌بیند. و آن را جز هنگام تکوین آن نمی‌بیند. این مقام صاحب این حال است. زیرا از اهل الله نیز کسانی هستند که این شئونات را قبل از اینکه حق (الحق) در آن‌ها باشد، مشاهده می‌کنند. و او کسی است که اعیان ممکنات را در حال عدمشان مشاهده می‌کند، همان‌گونه که حق (الحق) آن‌ها را مشاهده می‌کند. و به همین دلیل، حق (الحق) برخی از آن‌ها را با تکوین تعیین می‌کند نه غیر آن‌ها از ممکنات. زیرا حق (الحق) آن‌ها را جز بر آنچه در حال عدمشان هستند، بدون کم و کاست، موجود نمی‌سازد. و از اهل الله کسانی هستند که امر را قبل از ظهورش در حس مشاهده می‌کنند، و آن تکوین دیگر است. آن را در امام مبین (اللوح المحفوظ) که حاوی محو و اثبات است، مشاهده می‌کند. پس هر چیزی که در آن است، برای آن چیز تکوین اولی در نگارش است. و این کشف (الکشف) پایین‌تر از کشف کسی است که خداوند اعیان ممکنات را بر آنچه در حال هستی (الوجود) بر آن خواهند بود، به او نشان می‌دهد و او حکم خدا را در آن‌ها جاری می‌سازد.\n\nو برای درک این شئونات قبل از ظهورشان در حس، مدارک بسیاری وجود دارد. بالاترین آن‌ها همان است که ذکر کردیم، یعنی دورترین آن‌ها. و پس از آن، مشاهده حق (الحق) در تکوین آن‌هاست. زیرا این بالاتر از مشاهده بیننده آن‌ها در امام مبین و غیر آن است. و پایین‌تر از این شهود (الشهود)، هر شهودی است که برای بنده قبل از تکوین شأن رخ می‌دهد. این حال کسی است که:\n\n> گفت: هیچ چیزی را ندیدم مگر اینکه خدا را با آن دیدم.\n\nو او حالش بالاتر از کسی است که می‌گوید: هیچ چیزی را ندیدم مگر اینکه خدا را قبل از آن دیدم. زیرا اولی کلمه تحقیق است، اگرچه دومی نیز مانند آن در تحقیق است، اما بین آن‌ها دو فرق وجود دارد. قول اولی مانند کسی است که می‌گوید: زید را دیدم که فلان کار را می‌کند. و دیگری می‌گوید: صانع را دیدم که فلان کار را می‌کند. پس این فرق بین دو شخص در آنچه مشاهده می‌کنند، می‌باشد. زیرا اسماء اعلام جز برای مخاطب قرار دادن با آن‌ها در حال غیبت مسمی به آن‌ها وضع نشده‌اند. و در حضور، مطلوب نیستند، و اگر آورده شوند، یا به دلیل ادبی است که حال اقتضا می‌کند، یا تأکید در اخبار است. پس من از حال این قطب آنچه شنیدی را برایت روشن ساختم. و او احوال بسیاری دارد که من آن‌ها را می‌دانم، اما در مورد هر قطبی همه احوال او را ذکر نمی‌کنم، زیرا این کار موجب گسترش بیش از حد می‌شود به طوری که وقت باقی نمی‌ماند.\n\n### [قطب هفتم که بر قدم ایوب (علیه السلام) است]\n\nاما قطب هفتم که بر قدم (قدم) ایوب (علیه السلام) است، سوره او بقره است، و آن سوره سفید است که سیده آیات قرآن را در بر دارد. و منازل او به تعداد حروف آن است نه آیات آن. حال این قطب عظمت است، به طوری که می‌بیند عالم او را در بر نمی‌گیرد، زیرا ذوق او این است که حق (الحق) قلب او را وسعت داده است. و در خبر آمده است که حق (الحق) می‌فرماید: ما وسعني أرضي ولا سمائي ووسعني قلب عبدي (زمین و آسمانم مرا در بر نگرفت، اما قلب بنده‌ام مرا در بر گرفت).\n\nو هر قلبی حق (الحق) را در بر نمی‌گیرد. و فرمود: وَلَكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ (بلکه دل‌هایی که در سینه‌هاست کور می‌شوند). پس مکان قلب‌ها را بیان کرد. پس اگر برای بنده‌ای مشهود باشد که حق (الحق) در قلب اوست، همان‌گونه که عالم حق (الحق) را در بر نمی‌گیرد، عالم نیز این بنده را در بر نمی‌گیرد. پس این سبب شهود تنگی عالم برای اوست. و من کسی را ندیدم که به این مقام و شهود (الشهود) آن متحقق شده باشد، جز مردی در موصل از اهل حدیثه موصل که در این مرتبه بود. و حق (الحق) او را بر امری آگاه ساخت، اما بر سرّ آن آگاه نساخت. و او به دنبال کسی بود که حال او را برایش روشن سازد. امام نجم‌الدین محمد بن ابی بکر بن شای موصلی، مدرس مدرسه سیف‌الدین بن علم‌الدین در حلب، در این زمان که ما در آن هستیم (سال ششصد و بیست و هشت)، او را به من معرفی کرد. پس او خواستار ملاقات با ما شد. هنگامی که رسید، لغزش او را ذکر کردیم و آن را برایش روشن ساختم. پس از او رفع شد و شادمان گشت. و هنگامی که دید من او را فهمیدم، حال خود را برایم آشکار ساخت. او را یافتم که بهره وافری از مقام عظمت گرفته است، اما پایین‌تر از ذوق این قطب در آن است. زیرا او به من خبر داد که خلط سینه در دهانش می‌چرخید و نمی‌توانست آن را از دهانش بیرون اندازد، زیرا محلی خالی از حق (الحق) برای افتادن آن پیدا نمی‌کرد. و او می‌دانست که در شرع در مورد انداختن آن چه آمده است. پس متحیر می‌شد. و دیگری مانند او را در اشبیلیه از بلاد اندلس دیدم. و از حلاج روایت شده است که از این مقام چشید تا جایی که حال مقام بر او ظاهر شد. او خانه‌ای داشت که بیت العظمه نامیده می‌شد. هنگامی که وارد آن می‌شد، تمام آن را با ذات خود در چشم بیننده پر می‌کرد، تا جایی که به دلیل جهل مردم به احوالی که اهل الله بر آن هستند، او را به علم سیمیا نسبت دادند. و کسی که در این مقام متمکن است، حالی که دلالت بر صاحب این ذوق بودن او کند، بر او ظاهر نمی‌شود، اما اوصاف او به حکم این مقام جاری می‌شود، نه حال او. زیرا حال، خرق عادات را به همراه دارد، همان‌گونه که صاحب محاسن المجالس در آنجا گفت، هنگامی که احوال را برای مریدان ذکر کرد، گفت: و احوال برای کرامات است. منظور او خرق عادات است. و کرامات در عرف این زبان، خرق عادات همراه با استقامت در حال یا نتیجه دادن استقامت در فور نیست. این نزد آن‌ها ضروری است. و سبب این تحدید این است که خرق عادت ممکن است کرامت از جانب خدا برای بنده نباشد. پس کامل‌ترین آن‌ها در مقام عظمت کسی است که حالش مجهول باشد و شناخته نشود تا آنچه با او معامله می‌شود، شناخته شود و بیننده در او متحیر شود، جز اینکه او بر بینه‌ای از پروردگارش و بصیرتی از امر خود است. پس هر کس می‌خواهد احوال این امام را بشناسد، باید در آیات سوره بقره، آیه به آیه، تا پایان آن تدبر کند. پس این قطب، مجموع آیات آن است. و توفیق از خداست. اما قطب هشتم که بر قدم (قدم) الیاس (علیه السلام) است، سوره او آل عمران است، و آن نیز سوره سفید است. و منازل او به تعداد آیات آن است. و منظورم از اینکه می‌گویم قطب اول و دوم، این نیست که این ترتیب زمانی است، بلکه منظورم ترتیب عددی است تا دوازده قطب کامل شود. ممکن است قطب دوازدهم یا غیر آن، از نظر زمانی اول باشد. و این را اعلام کردم تا کسی که خداوند او را آگاه ساخته و بر علم به زمان‌های این اقطاب مطلع کرده است، گمان نکند که این ترتیبی که ما در مورد آن‌ها آورده‌ایم، ترتیب زمان‌های آن‌هاست. به همین دلیل بیان کردم که آن فقط ترتیب عدد است. و حال این قطب، علم به متشابه از کلام خداست که ما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله (تأویل آن را جز خدا نمی‌داند). پس این قطب آن را به آگاه ساختن خاص خدا می‌داند. و هرگز نمی‌داند مگر به آگاه ساختن خدا. پس نزد او در تشابهش محکم است. پس می‌داند که تشابه از چه جهتی در آن بوده است. پس علم مناسبتی که بین خدا و کسی که تشابه در آیه با او رخ داده است، جمع شده است، برای او حاصل می‌شود، مانند همه آیات تشبیه، یا تشبیه از طریق دلالت لفظ مشترک که جز به مناسبت پنهانی نیست، رخ می‌دهد. زیرا مناسبت در تشبیه آشکار است و در اشتراک پنهان، مانند نور برای علم که آشکار است. پس علم را نور و نور را نور می‌نامد، مانند قول او: وَجَعَلْنا لَهُ نُوراً (و برای او نوری قرار دادیم) و وَجَعَلْناهُ (و آن را قرار دادیم)، یعنی وحی که همان علم است، نُوراً نَهْدِي بِهِ مَنْ نَشاءُ مِنْ عِبادِنا (نوری که با آن هر کس از بندگانمان را بخواهیم هدایت می‌کنیم). و در اشتراک مانند عین (چشم/چشمه/ذات). پس مناسبت در عینیت در هر مسمایی به عین، پنهان است. پس نزد این قطب با آگاه ساختن خدا آشکار است. اما صاحبان تأویل با نظر در این مورد، بر علم نیستند، حتی اگر به علم برسند. و از این علم می‌دانی که زنان شقایق مردان هستند. آیا نمی‌بینی که حوا از آدم آفریده شد؟ پس او دو حکم دارد: حکم ذکورت به اصل و حکم انوثت به عارض. پس او از متشابه است. زیرا انسانیت مجمع مذکر و مؤنث است. و حقیقت فاعل از منفعل برای کسی که در آن فاعل است، کجاست؟ و جز در مشابه خود فعل نمی‌کند. و این بدان سبب است که او ابتدا انفعال را در نفس خود ایجاد کرد. پس صورت آنچه از آن منفعل می‌شود، در او ظاهر شد. و با آن نیرو، آنچه منفعل شد، از او منفعل شد و مانند بدیع و مخترع ظاهر شد. و ما قبلاً تحقیق علم به عالم را بیان کردیم که علم تابع معلوم است و علم صفت عالم است. و عطا کننده علم، معلوم نیست. سپس به عالم، ایجاد معلوم را عطا می‌کند، همان‌گونه که به مخترع، ایجاد امر مخترع و اظهار آن در هستی (الوجود) را عطا می‌کند. از اینجا دانسته می‌شود که چرا خداوند زنان را برای محمد (صَلَّى اللهُ عَليهِ وسَلَّم) محبوب ساخت. پس کسی که زنان را به دلیل محبت پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) به آن‌ها دوست بدارد، خدا را دوست داشته است. و جامع، انفعال است. زیرا هنگامی که معلوم، علم را عطا کرد تا درباره او گفته شود که عالم است، او اولین منفعل برای معلوم است. و در عیسی، انفعال او از مریم در مقابل حوا از آدم ظاهر شد. إِنَّ فِي ذلِكَ لَذِكْرى‏ لِمَنْ كانَ لَهُ قَلْبٌ (همانا در این، تذکری است برای کسی که قلبی داشته باشد). پس قول خداوند عز و جل را می‌فهمد: يا أَيُّهَا النَّاسُ إِنَّا خَلَقْناكُمْ مِنْ ذَكَرٍ (ای مردم، ما شما را از یک مرد آفریدیم) مانند حوا، وَأُنْثى‏ (و یک زن) مانند عیسی. و با مجموع، مانند باقی ذریه بنی آدم. پس او جامع خلق مردم است. و من در ابتدای ورودم به این راه، از منفورترین خلق خدا نسبت به زنان و جماع بودم و بر این حال حدود هجده سال باقی ماندم تا اینکه این مقام را مشاهده کردم. و قبلاً ترس از مقت (خشم) به دلیل وقوف بر خبر نبوی در من پیش آمده بود که:\n\n> خداوند زنان را برای پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) محبوب ساخت.\n\nپس او آن‌ها را به طبع دوست نداشت، بلکه به دلیل محبوب ساختن خدا برای او، دوست داشت. هنگامی که در توجه به سوی او تعالی در این مورد، از ترس خشم خدا، صادق بودم، زیرا آنچه را که خدا برای پیامبرش محبوب ساخته بود، ناخوش می‌داشتم، خداوند به حمد خود آن را از من زائل کرد و آن‌ها را برایم محبوب ساخت. پس من از دلسوزترین خلق نسبت به آن‌ها و رعایت‌کننده‌ترین حقوق آن‌ها هستم، زیرا در این مورد بر بصیرت هستم و آن از تحبب است نه از حب طبیعی. و قدر زنان را نمی‌داند مگر کسی که بداند و از خدا بفهمد آنچه را که در حق دو همسر رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود، هنگامی که بر علیه او همکاری کردند و بر او خروج کردند، همان‌گونه که خداوند در سوره تحریم ذکر کرد. و در مقابل این دو زن در همکاری بر علیه او، کسی را قرار داد که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) را بر علیه آن‌ها یاری می‌کند، و او خدا و جبرئیل و صالحان مؤمنان و سپس فرشتگان پس از آن هستند. و این جز به دلیل اختلاف سببی که به خاطر آن همکاری رخ می‌دهد، نیست. پس امری در آنجا وجود دارد که جز با خدا، نه با مخلوق، قابل رفع نیست. و به همین دلیل به ما دستور داده شده است که در اموری از خدا، در اموری از صبر و در اموری از نماز یاری بجوییم. پس این را بدان. و امری در آنجا بود که اگرچه به دست خدا بود، اما خداوند به جبرئیل قدرتی برای دفع آن امر داده بود. پس محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را در دفع آن یاری کرد، اگر بر علیه او همکاری می‌کردند و اگر از آن بازمی‌گشتند و حق (الحق) را از نفس خود می‌دادند، همان‌گونه که ما سکوت کردیم، سکوت می‌کرد. پس امر از قبل و بعد برای آن‌ها بود. و این وصف الهی است. زیرا با حرکت آن‌ها، کسی که حرکت کرد، حرکت کرد و با سکون آن‌ها، کسی که قصد حرکت داشت، ساکن شد. و همچنین صالحان مؤمنان، نزد آن‌ها امری بود که نسبتش در ازاله با صالحان مؤمنان نزدیک‌تر از نسبتش به غیر آن‌ها بود. پس صَالِحُ الْمُؤْمِنِينَ (صالح مؤمنان) یاری‌کننده محمد (صَلَّى اللهُ عَليهِ وسَلَّم) است. سپس فرشتگان پس از آن، هنگامی که جز آنچه مناسب عموم فرشتگان است که مسخر آفریده شده‌اند، باقی نمی‌ماند، که با آن چیزی دفع می‌شود که در ترتیب الهی جز با فرشتگان دفع نمی‌شود، با وجود انفراد حق (الحق) به همه امر در آن و قیام به آن. اما جواز عقلی. پس حق (الحق) از آنچه واقع می‌شد، خبر داد که اگر واقع می‌شد، چگونه واقع می‌شد. و جز آن‌گونه که گفت، واقع نمی‌شود. و جز آنچه می‌دانست که به این صورت واقع می‌شود، نگفت. و جز آنچه معلوم از نفس خود به او عطا کرد که بر آن است، به آنچه از ازل در عین ثابت خود در حال عدمش مشاهده کرد، ندانست. پس ای ولی، بنگر که چگونه امور حقایق خود را برای صاحب فهم و قلب آشکار می‌سازند. خداوند ما و شما را از اهل فهم از خدا قرار دهد، از کسانی که لَهُ قَلْبٌ (قلبی دارند) که با آن از خدا تعقل می‌کنند و أَلْقَى السَّمْعَ (گوش فرا دادند) به خطاب خدا و هُوَ شَهِيدٌ (او شاهد است) بر آنچه خدا در کون خود از شأن حادث می‌کند.\n\n### [قطب نهم که بر قدم لوط (علیه السلام) است]\n\nو اما قطب نهم که بر قدم لوط (ع) است، سوره او سوره کهف است و برای او عصمت و اعتصام (چنگ زدن) است. منازل او به تعداد آیات آن سوره است. حال او عصمت از هر چیزی است که به سوء ادب بینجامد و صاحبش را از بساط (حضور الهی) دور سازد. او همیشه بر وقت خود محفوظ است و علم او، علم اعتصام است. و خداوند آن را (اعتصام) در دو امر مشخص و محدود کرده است: اعتصام به او، که فرمود: «و به خدا چنگ زنید» (وَاعْتَصَمُوا بِاللَّهِ)، و اعتصام دیگر به ریسمان او، که فرمود: «و همگی به ریسمان خدا چنگ زنید» (وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا). پس برخی از مردم به خدا اعتصام جسته‌اند و برخی به ریسمان خدا. و او (ابن عربی) می‌گوید که اعتصام به ریسمان خدا عین اعتصام به خداست. این قطب هر دو اعتصام را جمع کرده است.\n\nو فرق میان این دو اعتصام آن است که ریسمان خدا راهی است که تو را به سوی او بالا می‌برد، مانند این سخن او: «سخنان پاکیزه به سوی او بالا می‌رود و عمل صالح آن را بالا می‌برد» (إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ). و ریسمان او چیزی جز آنچه تشریع کرده نیست، و فهم مردم در آن متفاوت است، پس برخی از ایشان چنین و برخی چنانند، و به همین دلیل «خداوند برخی از آنان را بر برخی دیگر برتری داده است» (فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَى بَعْضٍ). پس کسی که راهش را خطا نکند، معصوم است و تمسک به آن راه، همان اعتصام است. و این حال مؤمنانی است که به کمال ایمان رسیده‌اند. و چنین کسانی در اعتصامشان به ریسمان خدا، به خدا اعتصام می‌جویند، و این همان سخن اوست: «و تنها از تو یاری می‌جوییم» (وَإِيَّاكَ نَسْتَعِينُ) و سخن او: «از خدا یاری جویید» (اسْتَعِينُوا بِاللَّهِ). و اما اعتصام به خدا، همان سخن پیامبر (ص) در استعاذه است: «و از تو به تو پناه می‌برم» (وأعوذ بك منك).\n\nزیرا هیچ چیز از خلق او یارای مقاومت با او را ندارد، پس جز از او به او پناه برده نمی‌شود. زیرا انسان هنگامی که شنید بر صورت حق آفریده شده است، میان انسان کامل (الإنسان الکامل) و انسان حیوانی فرق نگذاشت و گمان کرد که انسان به صرف انسان بودن بر آن صورت است، در حالی که چنین نیست. بلکه انسان به واسطه انسان بودنش، پذیرای صورت است؛ اگر آن صورت به او داده شود، از پذیرش آن امتناع نمی‌کند. پس هنگامی که آن صورت به او داده شود، در آن هنگام بر صورت خواهد بود و در زمره خلفا شمرده می‌شود. و کسی که بر صورت است، جز به تصرف حق در آن صورت، تصرف نمی‌کند. و تصرف حق عین همان چیزی است که عالم بر آن و در آن است. و تو از هر جهت می‌دانی که عالم شامل چه چیزهایی است، از مکلف و غیر مکلف، و از آنچه انکار می‌شود و آنچه شناخته می‌شود. و آنچه انکار می‌شود و آنچه شناخته می‌شود از عالم مکلف را جز خلیفه که صاحب صورت است، نمی‌شناسد. پس حکم انکار از آنِ حق است نه بنده. کسی که به خدا اعتصام می‌جوید، اگر صاحب صورت باشد، جز از او اعتصام نمی‌جوید، به این صورت که حق در موطنی بر او ظاهر شود که او آن را انکار کند، هرچند آن صفت، صفت او باشد. پس او حق ندارد که در هر موطنی به آن متلبس شود و در هر مشهدی به آن ظاهر گردد، بلکه باید در آن پوشیده بماند و به حسب حکم وقت به آن آراسته شود. و این همان چیزی است که از آن به ادب تعبیر می‌شود. و حتی اگر مشهد او این باشد که جز خدا را به واسطه خدا نمی‌بیند و عالم عین هستی (الوجود) حق است، و چیزی بزرگتر از این بازدارنده از انکار وجود ندارد، باز هم باید انکار کند، اگر این مقام برای او صحیح باشد. پس او به حق، بر حق، برای حق انکار می‌کند و باکی ندارد و حجت او پابرجاست.\n\n### [قطب دهم که بر قلب هود (ع) است]\n\nو اما قطب دهم که بر قلب هود (ع) است، سوره او سوره انعام است و برای آن کمال و تمامیت در سوره‌های طولانی است. منازل او به تعداد آیات آن است. برای این قطب علوم بسیاری است، از جمله علم استحقاق که هر مخلوقی در آفرینش خود مستحق آن است، و علم آنچه آن خلق از مراتب مستحق آن است. اما استحقاق خلق، سخن اوست: «به هر چیزی آفرینش (خلق) آن را عطا کرد» (أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ). و اما مراتب، تذکر به آن از این سخن خداوند متعال است: «و خدا را آن گونه که شایسته اوست نشناختند» (وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ) و «ای اهل کتاب در دین خود غلو نکنید» (يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ). و غلو آن است که او را بر مرتبه‌اش بیفزایی یا از آن بکاهی. و عالم عاقل از غیر خود متمایز نمی‌شود مگر به دادن حق هر صاحب حقی و دادن آفرینش هر چیزی به آن. و هرگاه کسی این را نداند، جاهل به حق است، و هرگاه بداند و به علم خود عمل نکند، عاقل نیست. پس صاحب این مقام باید عقلش تمام و علمش کامل باشد. و این همان حفظ الهی و عنایت بزرگ است. و سلوک بر این طریقه برتر که همان طریقه قرب (الزلفى) است، استوارترین سلوک است.\n\nو هنگامی که خداوند آفرینش عالم را از حیث روح و صورت کامل کرد و هر خلقی را در مرتبه خود نازل نمود، میان عالم پیوندی روحانی و جسمانی قرار داد تا اشخاص هر نوع از عالم ظاهر شوند، زیرا ورود اشخاص هر نوع به هستی (الوجود) محال بود. و این کار را انجام داد تا فضل فاعل بر منفعل از طریق ذوق آشکار شود، تا فضل حق بر بندگانش را بدانند و بشناسند که چگونه در عبودیت خود با او متحقق شوند. و خلق را به آنان نسبت داد و فرمود: «و هنگامی که از گِل می‌آفریدی» (وَإِذْ تَخْلُقُ مِنَ الطِّينِ) و فرمود: «پس پر برکت است خدا، بهترین آفرینندگان» (فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ). پس ذکر کرد که خالقانی هستند و خداوند بهترین آفرینندگان است. زیرا او تعالی آنچه را می‌آفریند از روی شهود (الشهود) می‌آفریند، در حالی که خالق از میان بندگان جز از روی تصوری که از اعیان موجود در ذهن دارد، خلق نمی‌کند؛ اعیانی که می‌خواهد مانند آن‌ها را بیافریند یا ابداع کند. و آفرینش حق این گونه نیست، زیرا او مخلوق را بر همان صورتی که آن مخلوق در نفس و عین خود بر آن است، ابداع یا خلق می‌کند. پس جز جامه هستی (الوجود) را با تعلقی که ایجاب نامیده می‌شود، بر او نمی‌پوشاند.\n\nپس کسی که خداوند او را از طریق کشف (الکشف) بر اعیان ممکناتی که خواسته است آگاه سازد، در توان او نیست که آن‌ها را ایجاد کند؛ یعنی خلعت هستی (الوجود) که آن عین ثابت ممکن می‌پوشد، به دست او نیست، منظورم به طور مستقیم است. اما او همت دارد، و آن اراده وجود آن ممکنات است، نه اراده ایجاد آن‌ها از جانب خود، زیرا می‌داند که این امر در حق او محال است. پس هنگامی که همت خود را به وجود آن ممکنات معطوف کند، حق، قول به تکوین را به آن تعلق می‌دهد. پس آن ممکنات، سخن پروردگار خود را از سخن خلق می‌آموزند، چه آن سخن بر زبان خلق باشد و چه از جانب حق با برداشته شدن واسطه‌ها. پس آن شیء به ناچار تکوّن می‌یابد. در عالم شهود گفته می‌شود: فلان شخص با همت خود چنین و چنان کرد. و اگر سخن بگوید، گفته می‌شود: فلان شخص چنین و چنان گفت و آن شیء از سخن او چنین و چنان شد. پس هر کس این را بداند، سهم بنده را در آن تکوین و سهم حق را در آن می‌شناسد. به همین دلیل فرمود: «او بهترین آفرینندگان است» (أَحْسَنُ الْخَالِقِينَ).\n\nپس هنگامی که عین آن تکوین یافته، هر چه که باشد، ظاهر شود، مرتبه آن به سوی او مشتاق می‌شود، زیرا مزاجش آن را می‌طلبد، و منظورم مرتبه اول است. پس استعداد برای امور عالی یا دانی را کسب می‌کند، به حسب آنچه آن استعداد اکتسابی به او می‌دهد، و در عالم به صورت آن ظاهر می‌شود. پس اگر بیگانه به او بنگرد، و منظورم از بیگانه کسی است که به حقایق علم ندارد، و به استعداد او بنگرد، نظرش به او این حکم را می‌دهد که او از مرتبه خود پایین‌تر است یا مرتبه‌اش بالاتر از آن است، منظورم مرتبه‌ای است که در آن ظاهر شده است. در حالی که امر در نفس خود آن گونه نیست که برای صاحب این نظر ظاهر شده است. زیرا استعداد مؤثر تنها در خلق است و آن استعداد ذاتی است. و اما استعداد عرضی حکمی ندارد، بلکه استعداد عرضی مرتبه‌ای است که استعداد ذاتی آن را آشکار کرده است. و این مقدار از علم از بیشتر خلق پنهان مانده است.\n\nمثال آن این است که شخصی ساکت را ببینند که علوم را تصور کرده و محکم ساخته است، اما از مراتب، پست‌ترین آن‌ها به او داده شده است، در حالی که شایسته کسی که این فضائل و علوم را جمع کرده، نیست که غایتش آن مرتبه باشد. پس گفته می‌شود که این مرد از مرتبه‌اش پایین آورده شده و در حق او انصاف نشده است. در حالی که آن‌ها خبر ندارند که مرتبه او عین همان فضائلی است که جمع کرده و علومی است که محکم ساخته، و از جمله آن‌ها همین مرتبه پست است که والیان سلطان بر آن گماشته شده‌اند. اگر از والیان باشد، و اگر از والیان نباشد و با وجود این فضل، به هیچ منصبی نرسیده باشد، گفته می‌شود که او محروم است. در حالی که او محروم نیست، بلکه موطن (مقام) چنین اقتضا کرده است. و آن این است که دنیا اقتضا کرده که در یک زمان با شخص جلیل با جلال رفتار شود و در زمانی دیگر با جلیل با حقارت، و در زمانی با شخص صغیر با حقارت، و در زمانی با صغیر با جلال. بر خلاف موطن آخرت، که در آن با شخص بزرگ با عظمت و با حقیر با حقارت رفتار می‌شود.\n\nو اگر بیننده نظر کند، در دنیا کسانی را می‌بیند که درباره خدا چیزی می‌گویند که شایسته او تعالی نیست، و کسانی را می‌بیند که درباره او آنچه شایسته اوست از تنزیه و ثنا می‌گویند. و بزرگتر از حق، این بنده نخواهد بود. پس کسی که مواطن (مقامات) را بشناسد، می‌داند که امور چگونه در عالم جریان می‌یابد. «و همه امور به سوی خدا بازگردانده می‌شود» (وَإِلَى اللَّهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)، چه صحیح باشد و چه معلول. پس به مناصب نگاه نکن، بلکه به نصب‌کننده (ناصب) نگاه کن که به حکم مواطن عمل می‌کند، نه به آنچه نظر عقلی اقتضا می‌کند. زیرا بیننده اگر عاقل باشد، با عقل خود می‌داند که موطن دنیا چنین چیزی را می‌دهد و جواز عقلی را که در هر فرد فرد از افراد عالم ممکن است، کنار می‌گذارد. زیرا این جواز در عین شهود (الشهود)، نه علم است و نه صحیح. و باید عاقل با واقعیت در حال باشد، زیرا آن، صورت امر است بر آنچه در نفس خود بر آن است. عاقل را به آینده تعلقی نیست، مگر اینکه خداوند او را از طریق کشف (الکشف) بر اعیان ممکنات پیش از وقوع آن‌ها در هستی (الوجود) آگاه سازد. در این صورت، فرقی میان او و کسی که وقوع آن‌ها را مشاهده کرده، نیست، زیرا حکم جواز عقلی از این مکاشف در آنچه بر او کشف شده و خداوند او را آگاه ساخته، زائل می‌شود. این بخشی از علم این قطب است.\n\n### [قطب یازدهم که بر قدم صالح (ع) است]\n\nو اما قطب یازدهم که بر قدم صالح (ع) است، سوره او از قرآن، سوره طه است و برای آن شرف تام است و منازل او به تعداد آیات آن است. بدان که این قطب نسبت به سایر اقطاب، به واسطه این سوره شریف‌تر است، زیرا این سوره شریف‌ترین سوره در قرآن در عالم سعادتمند است. چرا که این سوره‌ای است که حق تعالی در بهشت بدون واسطه بر بندگانش می‌خواند. و این قطب علوم بسیاری دارد؛ او دارای بطش (گرفتن/قهر) و قوت است، چنانکه ابویزید بسطامی گفت، هنگامی که شنید قاری‌ای می‌خواند: «همانا قهر پروردگارت سخت است» (إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ)، گفت: «بطش من سخت‌تر است.» و حال او حال کسی بود که به واسطه خدا سخن می‌گوید. پس سخن خدا از جانب خود که بطشش شدید است، بر زبان بنده‌اش شدیدتر از بطش او بدون زبان بنده‌اش است. سپس بطش او بر زبان بنده طبیعی‌اش، به گونه‌ای که قابل مقایسه نیست، شدیدتر از بطش او بر زبان بنده الهی‌اش است.\n\nو بیشتر علم این امام در تنزیه و احاطه است. و تنزیه و احاطه‌ای که او می‌داند، مفهوم متعارف نیست، بلکه تنزیه تنزیه متعارف است و او در آن، علم احاطه را قرار داده است. و آن این است که تنزیه او، عدم مشارکت در هستی (الوجود) است؛ پس او هستی (الوجود) است و جز او نیست. و آنچه نزد او به عالم تعبیر می‌شود، همان اسم ظاهر است و آن وجه اوست. پس آنچه از ظاهرش پنهان است، اسم باطن است و آن هویت اوست، که برای او ظاهر می‌شود و از او غایب می‌گردد.\n\nو اما آلام و لذات، با اسماء مقابله و موافقت می‌کنند و به واسطه آن‌ها صور کثیر شده‌اند. زیرا آن‌ها هستند که شکل گرفته‌اند و برخی، برخی دیگر را درک کرده‌اند. پس او بر آن‌ها محیط و از آن‌ها منزه بود. پس برای او پوشیده ماندن از آن‌ها و تجلی (التجلی) در آن‌هاست. پس صور بر او مختلف می‌شوند و او حال خود را انکار می‌کند، با علم به اینکه او همان است. و این همان چیزی است که از سخن انسان درباره خود می‌شنوی که می‌گوید: «من در این زمان خود را انکار می‌کنم، زیرا بر من تغییر کرده است و من خود را این گونه نمی‌شناختم.» در حالی که او همان است و غیر او نیست. پس از حیث شکل گرفتن اسماء، امکان برای اوست، و از حیث عین پذیرای اختلاف صور اسمائی بر آن، وجوب برای اوست. پس او واجب ممکن و مکان و متمکن است که به حدوث و قدم وصف شده است، چنانکه کلام عزیز او با وجود اتصاف به قدم، به حدوث وصف شده است. پس فرمود: «به آن‌ها نمی‌آید» (مَا يَأْتِيهِمْ) (ضمیر به صور اسماء برمی‌گردد) «مگر پروردگار از ذکری از پروردگارشان که نو پدید آمده است» (مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ). پس آن را به حدوث وصف کرد. پس آن نزد صورت رحمان حادث است. و به آن‌ها نمی‌آید (ضمیر مانند اول است) مگر رحمان از ذکری از رحمان که نو پدید آمده است. پس آن را به حدوث وصف کرد. پس آن نزد صورت رب حادث است.\n\nپس اگر آمدن ذکر رب مقدم باشد، ذکر رحمان جواب آن است، و اگر ذکر رحمان مقدم باشد، ذکر رب جواب آن است. پس آنچه همیشه از این دو ذکر مقدم است، قرآن است و دومی فرقان. پس «چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْءٌ) برای مقدم از آن دو است که قرآن است، و «و او شنوای بیناست» (وَهُوَ السَّمِيعُ الْبَصِيرُ) برای دومی از آن دو است که فرقان است. پس «او اول و آخر است» (هُوَ الْأَوَّلُ وَالْآخِرُ) همان گونه که «ظاهر و باطن است» (الظَّاهِرُ وَالْبَاطِنُ) و «او به هر چیزی داناست» (وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ). و جز پذیرش صور اسماء نیست، و همه برای احاطه است. پس امر در او محدود شد. پس «باش» (کن) را جز برای او نگفت و به «می‌باشد» (یکون) جز از او کنایه نزد. آیا نمی‌بینی که خود را دهر نامیده و اینکه شب و روز را دگرگون می‌کند؟ و دهر غیر از شب و روز نیست، و دگرگون کردن جز اختلاف صور نیست. پس روزها و ساعت‌ها و ماه‌ها و سال‌ها عین دهر هستند. و در دهر تفصیلی که ذکر کردیم واقع شده است. پس از یک جهت ساعت است و از جهتی روز و شب و جمعه و ماه و سال و فصول و دور است.\n\n> فكل خير هو له *** وكل شر ليس له‏\n> پس هر خیری از آن اوست *** و هر شری از آن او نیست\n> فهو الوجود كله *** وفقده ما هو له‏\n> پس او تمام هستی (الوجود) است *** و فقدان او از آن او نیست\n> يعلمه من علمه *** يجهله من جهله‏\n> او را کسی می‌شناسد که او را شناخته *** و کسی که او را نشناخته، او را نادانسته است\n> فإنما أنابه *** في كل أحوالي وله‏\n> پس همانا من در تمام احوال و برای او *** به او بازگشته‌ام\n> فأنت هو ما أنت هو *** وأنت له ما أنت له‏\n> پس تو او هستی، در حالی که او نیستی *** و تو برای او هستی، در حالی که برای او نیستی\n> ولو صنعت صنعه *** ولو عملت عمله‏\n> و اگرچه صنعت او را ساختی *** و اگرچه عمل او را انجام دادی\n\nپس این از برخی از نفحات علم این قطب است. و جریان او در تمام علومش، با وجود کثرت و تفصیل آن‌ها، این گونه است.\n\n### [قطب دوازدهم که بر قدم شعیب (ع) است]\n\nو اما قطب دوازدهم که بر قدم شعیب (ع) است، سوره او از قرآن، سوره «پر برکت است کسی که فرمانروایی به دست اوست» (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ) است، و این سوره همان است که از خواننده خود مجادله می‌کند. و منازل او به تعداد آیات آن است. به مجادله آن در این سخن بنگر: «در آفرینش (خلق) رحمان هیچ تفاوت و خللی نمی‌بینی، پس دوباره چشم بگردان» (مَا تَرَى فِي خَلْقِ الرَّحْمَنِ مِنْ تَفَاوُتٍ فَارْجِعِ الْبَصَرَ كَرَّتَيْنِ). این آیه بر نظر در دو مقدمه تنبیه می‌کند: «آیا هیچ شکافی می‌بینی؟» (هَلْ تَرَى مِنْ فُطُورٍ) یعنی خللی که از آن راهی برای ورود در دلیلی که اقامه می‌کند، باشد. «چشم به سوی تو باز می‌گردد» (يَنْقَلِبْ إِلَيْكَ الْبَصَرُ) و آن همان نظر است، «در حالی که خوار و دور از نفوذ در آن با خلل یا شبهه است» (خَاسِئًا) و «در حالی که خسته و درمانده است» (وَهُوَ حَسِيرٌ)، یعنی خستگی به او رسیده است. و هر آیه‌ای در این سوره بر همین منوال جاری است تا آنجا که با این سخن ختم می‌شود: «بگو: به من خبر دهید، اگر آب شما در زمین فرو رود، چه کسی برای شما آب روان می‌آورد؟» (قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَاؤُكُمْ غَوْرًا فَمَنْ يَأْتِيكُمْ بِمَاءٍ مَعِينٍ).\n\nآیا نمی‌بینی که تمام هستی (الوجود) بدون تعلیم، در حال اضطرار خود به غیر خدا پناه نمی‌برد؟ جز به ذات خدا پناه نمی‌برد. اگر غیر او بود، او را نمی‌شناخت تا به او پناه ببرد. و این همان سخن عوام است در مورد کسی که مصیبتی دیده است: «مالک، چرا در مصیبت خود جز به صبر باز نمی‌گردی؟» و صبر چیزی جز صفت صابر نیست، پس او نیز صبور نامیده می‌شود. می‌گوید: «من او هستم، و غیر من در آنجا نیست.» و این عین همان چیزی است که قطب بر قدم صالح (صلی الله علی نبینا محمد و علیه و سلم) در علم خود ادعا کرد.\n\n> فيا شعيب ما ثم عيب *** لكنه شاهد وغيب‏\n> ای شعیب، در آنجا عیبی نیست *** بلکه او شاهد و غیب است\n> فانظر إلى حكمة وفصل الخطاب *** فيها ما فيه ريب‏\n> پس به حکمت و فصل الخطاب بنگر *** که در آن هیچ شکی نیست\n\nو برای این قطب، علم براهین و موازین علوم و معرفت حدود است. او تماماً روحی مجرد و لطیف است که بر طبیعت حاکم و مؤید شریعت است. در میان همتایان خود، بخشنده و گشاده‌دست است. اطعام می‌کند اما اطعام نمی‌شود، و نعمت می‌دهد اما متنعم نمی‌شود. تفکر بر او غالب است تا دیگران ورود به امور واضح را به یاد آورند تا او ناشناخته بماند. پس او مجهولی است که شناخته نمی‌شود و نکره‌ای است که تعریف نمی‌شود. بیشتر تصرف او در اسماء الهی که در آن‌ها تصرف می‌کند، اسم‌های مدبر، مفصل، منشئ، خالق، مصور، بارئ، مبدئ، معید، حکم و عدل است. و حق را در هیچ یک از تجلیاتش (التجلی) نمی‌بیند مگر اینکه میزان را در دست او ببیند که پایین می‌آورد و بالا می‌برد. پس در آنجا جز پایین آوردن و بالا بردن نیست، زیرا در آنجا جز معنی و حرف، و روح و صورت، و آسمان و زمین، و مؤثر و متأثر نیست. پس در آنجا جز شفع (جفت) نیست، و هر یک از شفع، وتر (فرد) است. پس در آنجا جز وتر نیست. «سوگند به فجر» (وَالْفَجْرِ) و «شب‌های دهگانه» (وَلَيَالٍ عَشْرٍ) و «جفت» (وَالشَّفْعِ) و «فرد» (وَالْوَتْرِ). پس شفع، شفع را می‌طلبد و وتر، وتر را می‌طلبد، و این همان طلب ثأر (انتقام) است.\n\n> فشفعه في وتره ظاهر *** ووتره في شفعه مندرج‏\n> پس شفع او در وترش آشکار است *** و وتر او در شفعش مندرج است\n> وجادت السحب بأمطارها *** فكان ما كان بأمر مرج‏\n> و ابرها با باران‌های خود بخشش کردند *** پس آنچه بود به امری آشفته (مرج) بود\n> فحدثت أرضك أخبارها *** وأنبتت من كل زوج بهج‏\n> پس زمین تو اخبار خود را بازگو کرد *** و از هر زوج شاد و زیبا رویاند\n> تفني إذا شاهدت أعيانها *** بعين غير الحق فيها المهج‏\n> جان‌ها در آن فانی می‌شوند، هنگامی که اعیان آن‌ها را *** با چشمی غیر از حق مشاهده کنی\n> يباين الضد بها ضده *** وشكله بشكله مزدوج‏\n> ضد در آن با ضد خود متمایز می‌شود *** و شکل آن با شکل خود جفت می‌شود\n> ونزهة الأبصار فيما بدا *** في العالم العلوي بين الفرج‏\n> و نزهت چشم‌ها در آنچه آشکار شد *** در عالم علوی میان گشایش‌ها\n> فكل ما للعين من ظاهر *** عنه إذا حققته ما خرج‏\n> پس هر آنچه برای چشم از ظاهر است *** اگر آن را تحقیق کنی، از او خارج نشده است\n\nبرای این قطب، دو قوه جمع شده است: قوه علمی و قوه عملی. پس او صنعتی است که صنعتش به واسطه فطرت از او فوت نمی‌شود. و او در هر علمی ذوقی الهی دارد، از علوم منطقی، ریاضی، طبیعی و الهی. و تمام اصناف این علوم نزد او علوم الهی هستند که آن‌ها را جز از خدا نگرفته و جز حق را در آن‌ها ندیده است و برای آن‌ها دلالتی بر غیر حق ندیده است. پس هر علم یا مسئله‌ای از آن علم، برای او آیه و دلالتی بر خداست و برای آن دلالتی بر غیر آن نمی‌شناسد، به دلیل استغراقش در خدا. زیرا او مجذوب و مراد است و در آنچه در آن است، تکلفی نداشته، بلکه در خود یافته که او همان است. سپس چشمانش را باز کرده و هر چیزی را با رؤیت احاطه به آنچه دیده، مشاهده کرده است. پس افزایشی که کسب می‌کند، تنها در تفصیل چیزی است که همیشه و پیوسته دیده است، زیرا هر دیدنی‌ای در هستی (الوجود) دائماً متنوع می‌شود. پس افاده همیشه ادامه دارد. و هر استفاده‌ای، افزایش علمی است که نزد او نبوده، در معلومی که همیشه به آن عالم و برای او مشهود بوده است. این بود آنچه خداوند ذکرش را بر زبان من آسان کرد از احوال دوازده قطب. «و خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ). پس یکی از این اقطاب، عدد یک را دارد و او صاحب توحید خالص است، و دیگری عدد دو را دارد، و همین طور هر یک تا دهم. و یازدهم عدد صد را دارد و دوازدهم عدد هزار را. و مفرد (فرد) ترکیب اعداد از یازده تا بی‌نهایت را دارد. و این برای افراد است، و آن‌ها کسانی هستند که احدیت کثرت و احدیت واحد را می‌شناسند. خداوند ما و شما را از کسانی قرار دهد که آنچه را او سبحانه در عالم از علم به خود نگاشته و بر او عز و جل دلالت می‌کند، فهمیده‌اند. همانا او ولی، احسان‌کننده، بخشنده، کریم و منت‌گذار است. «و خداوند حق را می‌گوید و او راه را هدایت می‌کند» (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 12
}