{
  "id": 427,
  "title": {
    "ar": "الباب السابع والعشرون وأربعمائة في معرفة منازلة قابَ قَوْسَيْنِ",
    "en": "Chapter Four Hundred and Twenty-Seven, Concerning the Gnosis (المعرفة) of the Station (منازلة) of Two Bow-Lengths (قابَ قَوْسَيْنِ)",
    "ur": "باب چار سو ستائیس (۴۲۷) معرفتِ منزلِ قابَ قَوْسَيْنِ (قابَ قَوْسَيْنِ) کے بیان میں۔",
    "fa": "باب چهارصد و بیست و هفتم در معرفت منزلگاه قابَ قَوْسَيْنِ"
  },
  "content": {
    "ar": "## «الباب السابع والعشرون وأربعمائة في معرفة منازلة قابَ قَوْسَيْنِ»\n\n\n> ما قاب قوسين إلا قطر دائرة *** تعطي التميز بين الكون والله‏\n\n\n> فمن يعاين عينا لا تغايرها *** عين فذاك دنو العالم الساهي‏\n\n\n> وهو الذي فيه أو أدنى وفيه له *** أسرار علم ولا تدري النهي ما هي‏\n\n\n> الشك يظهر في سلطان أو فلها *** حكم المقرب ذي السلطان والجاه‏\n\n\n> فهذه آية في النجم قد نزلت *** دلت على كون أمثال وأشباه‏\n\n\n> وكل من جئته يدريه مختبرا *** عقدا وفعلا لدى التعيق والباه‏\n\n\n> وذاك حين تجلى صورة دائرة *** يقول باللفظ أنت الآمر الناهي‏\n\n\n### [من آيات التي رأى النبي صَلَّى اللهُ عَليهِ وسَلَّم ليلة إسراء كونه تدلى في حال عروجه‏]\n\n\nقال الله تعالى فَكانَ قابَ قَوْسَيْنِ أَوْ أَدْنى‏ إشارة إلى التقريب الصوري‏\n\n\nورد في الخبر النبوي أن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يقول لو دليتم بحبل لهبط على الله‏\n\n\nوقال تعالى الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ وقال صَلَّى اللهُ عَليهِ وسَلَّم ينزل ربنا إلى سماء الدنيا كل ليلة في الثلث الباقي من الليل‏\n\n\nالحديث فحير العقول الضعيفة ونبه العقول المعتكفة على باب حضرته فعلمت ما أراد ولو استزدته لزاد كما قال ثُمَّ دَنا في إسرائه إلى السموات ليريه من آياته فَتَدَلَّى فقوى ذلك منبها ومشيرا على أنه عين الحبل الوارد المذكور في الخبر فدل إن نسبة الصعود والهبوط على السواء في حقه فجمع بين خبر صاحب الحوت‏\nوصاحب الإسراء أنه لم يكن واحد منهما بأقرب إلى الحق من الآخر فهي إشارة إلى عدم التحيز وإن الذات مجهولة غير مقيدة بقيد معين فكان من آياته التي أراه ليلة إسرائه كونه تدلى في حال عروجه وهذا عين ما أشار إليه أبو سعيد الخراز في قوله عن نفسه ما عرفت الله إلا بجمعه بين الضدين ثم تلا هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ فكان بهويته في الجميع في حال واحدة بل هو عين الضدين فلو لا أنت ما كان دنو ولا تدل‏\n\n\n> فلا دنو ولا تدل *** ولا عروج ولا هبوط\n\n\n> فهذه إن نظرت فيها *** محققا كلها خطوط\n\n\nفأنت من حيث هو يتك لا نعت لك ولا صفة قيل لأبي يزيد كيف أصبحت فقال لا صباح لي ولا مساء إنما الصباح والمساء لمن تقيد بالصفة وأنا لا صفة لي فإني بكيت زمانا وضحكت زمانا وأنا اليوم لا أضحك ولا أبكي والصعود والهبوط نعت فلا صعود للعبد ولا هبوط من حيث عينه وهويته فالصاعد عين الهابط فما دنا إلا عين من تدلى فإليه تدلى ومنه دنا فَكانَ قابَ قَوْسَيْنِ وما أظهر القوسين من الدائرة إلا الخط المتوهم وكفى بأنك قلت فيه المتوهم والمتوهم ما لا وجود له في عينه وقد قسم الدائرة إلى قوسين فالهوية عين الدائرة وليست سوى عين القوسين فالقوس الواحد عين القوس الآخر من حيث الهوية وأنت الخط القاسم المتوهم فالعالم في جنب الحق متوهم الوجود لا موجود فالموجود والوجود ليس إلا عين الحق وهو قوله أَوْ أَدْنى‏ فالأدنى رفع هذا المتوهم وإذا رفع من الوهم لم يبق سوى دائرة فلم تتعين القوسان فمن كان من ربه في القرب بهذه المثابة أعني بمثابة الخط القاسم للدائرة ثم رفع نفسه منها ما يدري أحد ما يحصل له من العلم بالله وهو قوله تعالى فَأَوْحى‏ إِلى‏ عَبْدِهِ ما أَوْحى‏ وما عين لنا في الذكر الحكيم ما أوحى ولا ذكر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ما أوحى في ذلك القرب به إليه فكان التلقي في هذا الموطن تلقيا ذاتيا لا يعلمه إلا من ذاقه وليست في المنازلة منازلة تقتضي التقاء النقطة بالمحيط إلا هذه المنازلة فإنه إذا التقى المحيط بالنقطة ذهب ما بينهما فذلك ذهاب العالم في وجود الحق ولم تتميز نقطة من محيط بل ذهب عين النقطة من كونها نقطة وعين المحيط من كونه محيطا فلم يبق إلا عين وجودية مذهبة حكمها وحكم ما ينسب من العالم إليها ذهابا كليا عاما عينا وحكما والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter 427: On the Gnosis of the Station of *Qāba Qawsayn* (Two Bow-Lengths)\n\n*Qāba Qawsayn* is merely the diameter of a circle,\nWhich establishes the distinction between the Cosmos (الكون) and The Real (الله).\nSo whoever witnesses an essence that is identical to it,\nThat is the nearness (دنو) of the heedless world.\nAnd it is that in which is 'or nearer' (أَوْ أَدْنَى), and in it, for him, are\nSecrets of Knowledge (علم), and the intellects (النهي) do not know what they are.\nDoubt appears in a sovereign, or for it is\nThe ruling of the one brought near (المقرب), possessor of authority and high rank.\nSo this is a verse that was revealed in [Surah] al-Najm,\nWhich points to the existence of parallels and similitudes.\nAnd everyone you approach knows it through experience,\nAs conviction (عقد) and action (فعل), in constraint and openness.\nAnd that is when the form of a circle manifests,\nSaying explicitly: \"You are the Commander and the Prohibitor.\"\n\n### [Among the signs that the Prophet, peace and blessings be upon him, saw on the Night of Ascension (Isrā’), was his descent (تدلى) during his ascent (عروج).]\n\nAllah Almighty said: <<فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَى>> (He was two bow-lengths or nearer) [Q 53:9], which is an indication of formal proximity (التقريب الصوري).\n\nIt is reported in the Prophetic tradition (الخبر النبوي) that the Messenger of Allah, peace and blessings be upon him, said: \"If you were to let down a rope, it would descend upon Allah.\"\n\nAnd He Almighty said: <<الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى>> (The Most Merciful settled upon the Throne) [Q 20:5]. And he, peace and blessings be upon him, said: \"Our Lord descends to the nearest heaven every night during the last third of the night.\"\n\nThis hadith confused the weak intellects but alerted the intellects devoted [to contemplation] at the door of His Presence (حضرة), so they knew what He intended. And had they sought more from Him, He would have given more, as He said: <<ثُمَّ دَنَا>> (Then he drew near) [Q 53:8] during his Ascension to the heavens, so that He might show him some of His signs, <<فَتَدَلَّى>> (and descended). This strengthened the alert and pointed out that this [descent] is the very rope mentioned in the tradition, indicating that the ratio of ascent (الصعود) and descent (الهبوط) is equal concerning Him.\n\nThus, He combined the account of the Companion of the Fish [Jonah] and the Companion of the Ascension [Muhammad], showing that neither of them was nearer to The Real (الحق) than the other. This is an indication of non-localization (عدم التحيز) and that the Essence (الذات) is unknown, not restricted by any specific limitation.\n\nThus, among the signs He showed him on the Night of Ascension was his descent (تدلى) during his ascent (عروج). This is exactly what Abu Sa'id al-Kharraz alluded to when he said of himself: \"I did not know Allah except by His combining of the two opposites,\" and then recited: <<هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ>> (He is the First and the Last, the Manifest and the Hidden) [Q 57:3]. Thus, by His Ipseity (هوية), He is in all things simultaneously; rather, He is the very essence of the two opposites. Were it not for you, there would be neither drawing near (دنو) nor descending (تدل).\n\nThere is neither drawing near nor descending,\nNor ascent nor descent.\nIf you look at these things, realizing them,\nThey are all [mere] lines.\n\nSo you, from the perspective of your Ipseity (هوية), have neither description (نعت) nor attribute (صفة). It was said to Abu Yazid [al-Bistami]: \"How are you this morning?\" He replied: \"I have neither morning nor evening. Morning and evening belong only to those who are restricted by attributes, and I have no attribute. I wept for a time and laughed for a time, but today I neither laugh nor weep.\"\n\nAscent and descent are descriptions. Thus, the servant has neither ascent nor descent from the perspective of his essence (عين) and Ipseity. The ascending one is the very essence of the descending one. Therefore, none drew near (دنا) except the very essence of the one who descended (تدلى). To Him he descended, and from Him he drew near: <<فَكَانَ قَابَ قَوْسَيْنِ>> (He was two bow-lengths).\n\nThe two bows (قوسين) are manifested from the circle (دائرة) only by the imaginary line (الخط المتوهم). It is sufficient that you called it 'imaginary' (المتوهم), and the imaginary is that which has no Existence (وجود) in its essence. The circle is divided into two bows. The Ipseity is the very essence of the circle, and it is nothing other than the essence of the two bows. One bow is the very essence of the other bow from the perspective of Ipseity, and you are the imaginary dividing line.\n\nThus, the World (العالم) in relation to The Real (الحق) is imaginary in existence (متوهم الوجود), not truly existent (موجود). The Existent (الموجود) and Existence (الوجود) are nothing but the very Essence of The Real. And this is His saying: <<أَوْ أَدْنَى>> (or nearer). The 'nearer' is the removal of this imaginary [line]. When it is removed from the Imagination (الوهم), nothing remains but the circle, and the two bows are no longer distinct.\n\nSo whoever is in proximity (قرب) to his Lord at this station—meaning, the station of the dividing line of the circle—and then removes himself from it, no one knows what Gnosis (العلم بالله) he attains. And this is His saying, the Almighty: <<فَأَوْحَى إِلَى عَبْدِهِ مَا أَوْحَى>> (And He revealed to His servant what He revealed) [Q 53:10]. The Wise Remembrance (الذكر الحكيم) did not specify for us what He revealed, nor did the Messenger of Allah, peace and blessings be upon him, mention what was revealed to him in that proximity. Thus, the reception (التلقي) in this station (موطن) was a reception of the Essence (تلقيا ذاتيا), known only to him who tastes it.\n\nThere is no station that necessitates the meeting of the point (النقطة) with the circumference (المحيط) except this station. For when the circumference meets the point, what is between them vanishes. That is the annihilation (ذهاب) of the World in the Existence of The Real. Neither the point nor the circumference is distinguished; rather, the essence of the point vanishes from being a point, and the essence of the circumference vanishes from being a circumference. So nothing remains except an essential Existence (عين وجودية) whose ruling, and the ruling of whatever is attributed to it from the World, has been completely and universally annihilated, both essentially and legally. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way) [Q 33:4].",
    "ur": "باب نمبر ۴۲۷: قاب قوسین (قابَ قَوْسَيْنِ) کے مقام کی معرفت میں۔\n\nقاب قوسین (قابَ قَوْسَيْنِ) دائرے کے قطر کے سوا کچھ نہیں ہے،\nجو کائنات اور ذات حق (الحق) کے درمیان امتیاز عطا کرتا ہے۔\n\nپس جو شخص ایسی آنکھ سے مشاہدہ کرے جس میں کوئی دوسری آنکھ تغیر نہ لائے،\nتو یہ غافل عالم کا قرب ہے۔\n\nاور یہی وہ مقام ہے جس میں 'او ادنیٰ' (أَوْ أَدْنىٰ) ہے، اور اس میں اس کے لیے\nعلم کے وہ اسرار ہیں جنہیں عقلیں نہیں جانتیں کہ وہ کیا ہیں۔\n\nشک یا تو سلطان میں ظاہر ہوتا ہے، یا پھر اس کے لیے\nمقرب (قرب یافتہ) کا حکم ہے جو صاحبِ اقتدار اور جاہ و جلال ہے۔\n\nپس یہ سورۃ النجم میں نازل ہونے والی آیت ہے،\nجو امثال اور اشباہ (مثالوں اور مماثلتوں) کے وجود پر دلالت کرتی ہے۔\n\nاور ہر وہ شخص جس کے پاس تم آؤ، وہ اسے تجربے سے جانتا ہے،\nخواہ وہ عقد (عقیدہ) میں ہو یا تعیق (رکاوٹ) اور باہ (طاقت) کے وقت فعل میں۔\n\nاور یہ اس وقت ہوتا ہے جب دائرے کی صورت میں ظہور الٰہی (التجلی) ہوتا ہے،\nاور وہ لفظوں میں کہتا ہے: \"تو ہی حکم دینے والا اور منع کرنے والا ہے۔\"\n\n***\n\n[ان آیات میں سے جو نبی اکرم صلی اللہ علیہ وسلم نے شبِ معراج دیکھیں، ان کا اپنے عروج کے دوران تدلی (نیچے اترنا) کا ہونا]\n\nاللہ تعالیٰ نے فرمایا: \"فَكانَ قابَ قَوْسَيْنِ أَوْ أَدْنىٰ\" (تو وہ دو کمانوں کے فاصلے پر یا اس سے بھی کم رہ گیا)۔ یہ صوری تقرب کی طرف اشارہ ہے۔\n\nحدیث نبوی میں آیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: \"لو دليتم بحبل لهبط على الله\" (اگر تم ایک رسی لٹکاؤ تو وہ اللہ پر گرے گی۔)\n\nاور اللہ تعالیٰ نے فرمایا: \"الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوىٰ\" (رحمن عرش پر مستوی ہے)۔ اور آپ صلی اللہ علیہ وسلم نے فرمایا: \"ينزل ربنا إلى سماء الدنيا كل ليلة في الثلث الباقي من الليل\" (ہمارا رب ہر رات کے آخری تہائی حصے میں آسمان دنیا پر نزول فرماتا ہے۔)\n\nاس حدیث نے کمزور عقلوں کو حیران کر دیا اور اعتکاف کرنے والی عقلوں کو اس کی بارگاہ کے دروازے پر متنبہ کیا، چنانچہ انہوں نے جان لیا کہ اس کا کیا ارادہ تھا۔ اور اگر تم اس سے مزید طلب کرتے تو وہ مزید عطا کرتا، جیسا کہ اس نے فرمایا: \"ثُمَّ دَنا\" (پھر وہ قریب ہوا)۔ آپ صلی اللہ علیہ وسلم کا آسمانوں کی طرف معراج کرنا تاکہ اللہ انہیں اپنی نشانیاں دکھائے، پھر \"فَتَدَلَّى\" (وہ جھکا/نیچے اترا)۔ اس نے اس بات کو مضبوط کیا، متنبہ کیا اور اشارہ کیا کہ یہ وہی رسی ہے جو حدیث میں مذکور ہے۔ پس اس نے دلالت کی کہ ذات حق (الحق) کے حق میں صعود (اوپر چڑھنے) اور ہبوط (نیچے اترنے) کی نسبت برابر ہے۔ چنانچہ اس نے صاحبِ حوت (یونس علیہ السلام) اور صاحبِ اسراء (محمد صلی اللہ علیہ وسلم) کی خبروں کو جمع کیا کہ ان میں سے کوئی بھی ذات حق (الحق) سے دوسرے سے زیادہ قریب نہیں تھا۔ یہ عدمِ تحیز (محدود نہ ہونے) کی طرف اشارہ ہے، اور یہ کہ ذات (الذات) مجہول ہے اور کسی خاص قید سے مقید نہیں ہے۔ پس ان آیات میں سے جو اللہ نے انہیں شبِ معراج دکھائیں، یہ بھی تھا کہ وہ اپنے عروج کی حالت میں تدلی (نیچے اترنا) کر رہے تھے۔ اور یہ بعینہٖ وہی ہے جس کی طرف ابو سعید الخراز نے اپنے قول میں اشارہ کیا تھا: \"ما عرفت الله إلا بجمعه بين الضدين\" (میں نے اللہ کو نہیں پہچانا مگر اس کے دو متضاد چیزوں کو جمع کرنے سے۔) پھر انہوں نے یہ آیت تلاوت کی: \"هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ\" (وہی اول ہے اور وہی آخر، وہی ظاہر ہے اور وہی باطن)۔ پس وہ اپنی ہویت (الہویۃ) کے ساتھ ایک ہی حالت میں سب میں موجود ہے، بلکہ وہ عینِ ضدین (دو متضاد چیزوں کا جوہر) ہے۔ اگر تم نہ ہوتے تو نہ کوئی قرب ہوتا اور نہ کوئی تدلی (نیچے اترنا)۔\n\nنہ کوئی قرب ہے اور نہ کوئی تدلی (نیچے اترنا)،\nنہ کوئی عروج ہے اور نہ کوئی ہبوط (اترنا)۔\n\nپس اگر تم ان میں حقیقت کی نظر سے دیکھو،\nتو یہ سب محض خطوط ہیں۔\n\nپس تم اپنی ہویت (الہویۃ) کے اعتبار سے نہ کوئی نعت رکھتے ہو اور نہ کوئی صفت۔ ابو یزید بسطامی سے پوچھا گیا: \"آپ نے صبح کیسے کی؟\" تو انہوں نے فرمایا: \"میری نہ کوئی صبح ہے اور نہ کوئی شام۔ صبح اور شام تو اس کے لیے ہے جو صفت سے مقید ہو، اور میری کوئی صفت نہیں ہے۔ میں ایک زمانے تک روتا رہا اور ایک زمانے تک ہنستا رہا، اور آج میں نہ ہنستا ہوں اور نہ روتا ہوں۔\" اور صعود (اوپر چڑھنا) اور ہبوط (نیچے اترنا) ایک نعت (صفت) ہے۔ پس بندے کے لیے اس کی عینیت اور ہویت (الہویۃ) کے اعتبار سے نہ کوئی صعود ہے اور نہ کوئی ہبوط۔ پس صعود کرنے والا ہی عین ہبوط کرنے والا ہے۔ جس نے قرب حاصل کیا وہ بعینہٖ وہی ہے جو تدلی (نیچے اترا)۔ پس اسی کی طرف تدلی ہوئی اور اسی سے قرب حاصل ہوا: \"فَكانَ قابَ قَوْسَيْنِ\" (تو وہ دو کمانوں کے فاصلے پر رہ گیا)۔ اور دائرے میں سے قوسین (دو کمانوں) کو ظاہر کرنے والی چیز متوہم (خیالی) خط کے سوا کچھ نہیں ہے۔ اور یہ کافی ہے کہ تم نے اس میں متوہم کہا، اور متوہم وہ ہے جس کا اپنی عین میں کوئی وجود نہ ہو۔ اور اس نے دائرے کو دو قوسوں میں تقسیم کیا ہے۔ پس ہویت (الہویۃ) ہی عین دائرہ ہے اور وہ عینِ قوسین کے سوا کچھ نہیں ہے۔ پس ایک قوس ہویت (الہویۃ) کے اعتبار سے عین دوسری قوس ہے۔ اور تم وہ متوہم تقسیم کرنے والا خط ہو۔ پس ذات حق (الحق) کے مقابلے میں عالم متوہم الوجود ہے، موجود نہیں۔ پس موجود اور ہستی (الوجود) ذات حق (الحق) کے سوا کچھ نہیں ہے۔ اور یہی اس کا قول ہے: \"أَوْ أَدْنىٰ\" (یا اس سے بھی کم)۔ پس 'ادنیٰ' (أَوْ أَدْنىٰ) اس متوہم کو اٹھا دیتا ہے۔ اور جب وہم سے اٹھا دیا جائے تو دائرے کے سوا کچھ باقی نہیں رہتا، چنانچہ قوسین متعین نہیں ہوتیں۔ پس جو شخص اپنے رب سے قرب میں اس مقام پر ہو، یعنی دائرے کو تقسیم کرنے والے خط کے مقام پر، پھر وہ اپنے آپ کو اس سے اٹھا لے، تو کوئی نہیں جانتا کہ اسے اللہ کے علم میں سے کیا حاصل ہوتا ہے۔ اور یہی اللہ تعالیٰ کا قول ہے: \"فَأَوْحىٰ إِلىٰ عَبْدِهِ ما أَوْحىٰ\" (پس اس نے اپنے بندے پر وحی کی جو وحی کی)۔ اور ذکرِ حکیم (قرآن) میں ہمارے لیے یہ متعین نہیں کیا گیا کہ کیا وحی کی، اور نہ ہی رسول اللہ صلی اللہ علیہ وسلم نے اس قرب میں اس وحی کا ذکر کیا جو ان پر کی گئی۔ پس اس مقام پر تلقّی (وحی کا حصول) ایک ذاتی تلقّی تھی جسے صرف وہی جانتا ہے جس نے اسے چکھا ہو۔ اور مقامات میں کوئی ایسا مقام نہیں جو نقطے کے محیط سے ملنے کا تقاضا کرے سوائے اس مقام کے۔ کیونکہ جب محیط نقطے سے ملتا ہے تو ان کے درمیان کی چیز ختم ہو جاتی ہے۔ یہ عالم کا وجود حق (الحق) میں فنا ہو جانا ہے۔ اور نہ نقطہ محیط سے ممتاز رہتا ہے، بلکہ نقطے کی عینیت نقطہ ہونے کے اعتبار سے اور محیط کی عینیت محیط ہونے کے اعتبار سے ختم ہو جاتی ہے۔ پس صرف ایک وجودی عینیت باقی رہتی ہے جس کا حکم اور اس عالم کا حکم جو اس کی طرف منسوب ہے، عیناً اور حکماً کلی اور عام فنا ہو جاتا ہے۔ اور اللہ \"يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (حق فرماتا ہے اور وہی سیدھے راستے کی رہنمائی کرتا ہے)۔",
    "fa": "باب چهارصد و بیست و هفتم در معرفت مقام قابَ قَوْسَيْنِ (قاب قوسین)\n\nقاب قوسین نیست مگر قطر دایره‌ای\nکه تمایز میان کائنات و الله (الحق) را می‌بخشد.\n\nپس هر که چشمی را ببیند که چشم دیگری با آن مغایرت ندارد\nآن نزدیکی عالم غافل (الساهي) است.\n\nو او کسی است که در آن (مقام) یا نزدیک‌تر (أو أدنى) است و در آن برای او\nاسرار علمی است که خردمندان (النهي) نمی‌دانند چیست.\n\nشک در سلطانی آشکار می‌شود یا برای آن (مقام)\nحکم مقربی است که صاحب سلطنت و جاه است.\n\nپس این آیتی است که در سوره نجم نازل شده\nکه دلالت بر وجود امثال و اشباه دارد.\n\nو هر کس نزد او آید، آن را با تجربه درمی‌یابد\nدر اعتقاد و عمل، هنگام تعویق و شکوه.\n\nو آن هنگامی است که صورت دایره‌ای تجلی (التجلی) کند\nکه با لفظ می‌گوید: تویی فرمان‌دهنده و بازدارنده (الآمر الناهي).\n\n### [از آیاتی که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در شب معراج دید، اینکه او در حال عروجش تدلی (آویزان شدن/نزول) کرد]\n\nخداوند متعال می‌فرماید: **فَكانَ قابَ قَوْسَيْنِ أَوْ أَدْنى‏** (پس به اندازه دو کمان یا نزدیک‌تر شد) [نجم: ۹]، که اشاره به تقریب صوری دارد.\n\nدر خبر نبوی آمده است که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) می‌فرماید: «اگر طنابی را آویزان کنید، بر خدا فرود می‌آید.»\n\nو خداوند متعال می‌فرماید: **الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏** (رحمان بر عرش استیلا یافت) [طه: ۵]. و پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «پروردگار ما هر شب در ثلث باقی‌مانده از شب به آسمان دنیا فرود می‌آید.»\n\nاین حدیث عقل‌های ضعیف را متحیر ساخت و عقل‌های معتکف بر درگاه حضرتش را بیدار کرد، پس دانستند که او چه اراده کرده است؛ و اگر از او بیشتر می‌خواستند، می‌افزود، چنانکه فرمود: **ثُمَّ دَنا** (سپس نزدیک شد) [نجم: ۸] در معراجش به سوی آسمان‌ها تا از آیاتش به او نشان دهد، **فَتَدَلَّى** (پس آویزان شد/نزول کرد) [نجم: ۸]. این امر تقویت‌کننده و اشاره‌کننده است بر اینکه او عین همان طنابی است که در خبر ذکر شده است. پس دلالت دارد بر اینکه نسبت صعود و هبوط در حق او (الحق) یکسان است. بنابراین، میان خبر صاحب حوت (یونس) و صاحب معراج (محمد) جمع کرد که هیچ‌یک از آن دو به حق (الحق) نزدیک‌تر از دیگری نبودند. این اشاره‌ای است به عدم تحیّز (عدم محدودیت مکانی) و اینکه ذات (الذات) مجهول است و به قید معینی مقید نیست. پس از آیاتی که در شب معراج به او نشان داد، این بود که او در حال عروجش تدلی (نزول) کرد. و این عین همان چیزی است که ابوسعید خراز در مورد خود به آن اشاره کرد که گفت: «خدا را نشناختم مگر به جمع کردن او میان دو ضد.» سپس این آیه را تلاوت کرد: **هُوَ الْأَوَّلُ والْآخِرُ والظَّاهِرُ والْباطِنُ** (اوست اول و آخر و ظاهر و باطن) [حدید: ۳]. پس او به هویت (الهویة) خود در همه در یک حال است، بلکه او عین دو ضد است. اگر تو نبودی، نه نزدیکی (دنو) بود و نه تدلی (نزول).\n\nنه نزدیکی (دنو) است و نه تدلی (نزول)\nنه عروج است و نه هبوط\n\nپس اگر در این‌ها بنگری\nمحققاً همه خطوطی بیش نیستند.\n\nپس تو از حیث هویت (الهویة) خود، نه نعت (وصف) داری و نه صفت. از ابویزید پرسیدند: چگونه صبح کردی؟ گفت: نه صبحی دارم و نه شامی. صبح و شام برای کسی است که مقید به صفت باشد، و من صفتی ندارم. من زمانی گریستم و زمانی خندیدم، و امروز نه می‌خندم و نه می‌گریم. صعود و هبوط نعت (وصف) هستند، پس برای بنده از حیث عین و هویتش نه صعودی است و نه هبوطی. صعودکننده عین هبوط‌کننده است. پس نزدیک نشد مگر عین کسی که تدلی (نزول) کرد. به سوی او تدلی کرد و از او نزدیک شد، **فَكانَ قابَ قَوْسَيْنِ** (پس به اندازه دو کمان شد). و آنچه دو قوس را از دایره آشکار ساخت، چیزی نیست جز خط موهوم (المتوهم). و همین کافی است که تو در آن، موهوم را گفتی، و موهوم چیزی است که در عین خود وجود ندارد. و دایره به دو قوس تقسیم شده است، پس هویت (الهویة) عین دایره است و چیزی جز عین دو قوس نیست. پس یک قوس از حیث هویت (الهویة) عین قوس دیگر است، و تو آن خط تقسیم‌کننده موهوم هستی. پس عالم در جنب حق (الحق) وجودی موهوم است، نه موجود. موجود و وجود (الوجود) چیزی نیست جز عین حق (الحق)، و این همان قول اوست: **أَوْ أَدْنى‏** (یا نزدیک‌تر). پس «أدنی» (نزدیک‌تر) رفع این موهوم است، و هنگامی که از وهم برداشته شود، جز دایره‌ای باقی نمی‌ماند و دو قوس مشخص نمی‌شوند. پس هر کس در قرب (القرب) به پروردگارش در این مرتبه باشد، یعنی در مرتبه خط تقسیم‌کننده دایره، سپس خود را از آن بردارد، هیچ‌کس نمی‌داند چه علمی از خدا برای او حاصل می‌شود. و این همان قول خداوند متعال است: **فَأَوْحى‏ إِلى‏ عَبْدِهِ ما أَوْحى‏** (پس به بنده خود وحی کرد آنچه را وحی کرد) [نجم: ۱۰]. و در ذکر حکیم (قرآن) برای ما مشخص نکرده است که چه وحی کرد، و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نیز ذکر نکرد که در آن قرب (القرب) به او چه وحی شد. پس تلقی (دریافت) در این موطن، تلقی (التلقی) ذاتی (ذاتیاً) بود که جز کسی که آن را چشیده باشد، نمی‌داند. و در میان مقامات (المنازلة)، هیچ مقامی نیست که اقتضای التقاء نقطه با محیط را داشته باشد مگر این مقام. زیرا هنگامی که محیط با نقطه تلاقی کند، آنچه میان آن دو است از بین می‌رود. این همان فنای (الفناء) عالم در وجود حق (وجود الحق) است، و نه نقطه از محیط متمایز می‌شود. بلکه عین نقطه از حیث نقطه‌بودنش و عین محیط از حیث محیط‌بودنش از بین می‌رود. پس باقی نمی‌ماند مگر عین وجودی (وجودية) که حکم آن و حکم آنچه از عالم به آن نسبت داده می‌شود، ذهاب (فنا) کلی و عام است، هم از حیث عین و هم از حیث حکم. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏** (حق را می‌گوید و او راه را هدایت می‌کند) [احزاب: ۴]."
  },
  "page_count": 2
}