{
  "id": 122,
  "title": {
    "ar": "الباب الثاني والعشرون ومائة في معرفة مقام اليقين وأسراره",
    "en": "Chapter One Hundred and Twenty-Two: On the Knowledge of the Station of Absolute Certainty (مقام اليقين) and its Mysteries.",
    "ur": "باب ایک سو بائیسواں: مقام یقین (مقام اليقين) اور اس کے اسرار کی معرفت میں۔",
    "fa": "باب صد و بیست و دوم در معرفت مقام یقین و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثاني والعشرون ومائة في معرفة مقام اليقين وأسراره)\n\n\n> إن اليقين مقر العلم في الخلد *** في كل حال بوعد الواحد الصمد\n\n\n> إن اليقين الذي التحقيق حصله *** اعكف عليه ولا تنظر إلى أحد\n\n\n> فإن تزلزل عن حكم الثبات فما *** هو اليقين الذي يقوى به خلدي‏\n\n\n### [اليقين هو ما يكون الإنسان فيه على بصيرة]\n\n\nواليقين هو قوله لنبيه صَلَّى اللهُ عَليهِ وسَلَّم واعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ وحكمه سكون النفس بالمتيقن أو حركتها إلى المتيقن وهو ما يكون الإنسان فيه على بصيرة أي شي‏ء كان فإذا كان حكم المبتغي في النفس حكم الحاصل فذلك اليقين سواء حصل المتيقن أو لم يحصل في الوقت كقوله أَتى‏ أَمْرُ الله وإن كان لم يأت بعد ولكن تقطع النفس المؤمنة بإتيانه فلا فرق عندها بين حصوله وبين عدم حصوله وهوقول من قال لو كشف الغطاء ما ازددت يقينا\n\n\nمع أن المتيقن ما حصل في الوجود العيني فقال الله لنبيه ولكل عبد يكون بمثابته اعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ فإذا أتاك اليقين علمت من العابد والمعبود ومن العامل والمعمول به وعلمت ما أثر الظاهر في المظاهر وما أعطت المظاهر في الظاهر\n\n\n### [صاحب اليقين وصاحب علم اليقين‏]\n\n\nواعلم أن لليقين علما وعينا وحقا ولكل حق حقيقة وسيرد ذلك في باب له مفرد بعد هذا من هذا الكتاب إن شاء الله تعالى وإنما جعل له علما وعينا وحقا لأنه قد يكون يقينا ما ليس بعلم ولا عين ولا حق ويقطع به من حصل عنده وهو صاحب يقين لا صاحب علم يقين‏\n\n\n### [هل يصح أن يكون يقين أتم من يقين‏]\n\n\nواختلف أصحابنا في اليقين هل يصح أن يكون يقين أتم من يقين أم لا فإنه‏\n\n\nروى عن النبي صَلَّى اللهُ عَليهِ وسَلَّم أنه قال في عيسى عليه السلام لو ازداد يقينا لمشى في الهواء\n\n\nأشار به إلى ليلة الإسراء وأن باليقين صح له المشي في الهواء وهذا التفسير ليس بشي‏ء فإنه أسرى به ربه ليريه من آياته وبعث إليه بالبراق فكان محمولا في إسرائه‏\nومثل هذا الحديث لا يصح عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إنه أشار بذلك إلى نفسه ومعلوم أنه ليس أحد من البشر يماثله في اليقين لكنه ما مشى في الهواء بيقينه وإنما جاءه جبريل عليه السلام بدابة دون البغل وفوق الحمار تسمى البراق فكان والبراق هو الذي مشى في الهواء ثم إنه صَلَّى اللهُ عَليهِ وسَلَّم لما انتهى البراق به إلى الحد الذي أذن له نزل عنه وقعد في الرفرف وعلا به إلى حيث أراد الله وغفل الناس عن هذا كله فما أسرى به صَلَّى اللهُ عَليهِ وسَلَّم لقوة يقينه بل يقينه في قلبه على ما هو به من التعلق بالمتيقن العام كان ما كان لكنه مما فيه سعادته لأنه وصف به في معرض المدح‏\n\n\n### [شرف اليقين بشرف موضوعه وهو الأمر المتيقن‏]\n\n\nولنا في اليقين جزء شريف وضعناه في مسجد اليقين مسجد إبراهيم الخليل في زيارتنا لوطا عليه السلام فقد يتيقن الجاهل أنه جاهل والظان أنه ظان والشاك أنه شاك فيما هو فيه شاك وكل واحد صاحب يقين قاطع بحاله الذي هو عليه علما كان أو غير علم فإن قلت فأين شرفه قلنا شرفه بشرف المتيقن كالعلم سواء ولهذا جاء بالألف واللام في قوله حَتَّى يَأْتِيَكَ الْيَقِينُ يريد متيقنا خاصا ما هو يقين يقع المدح به بل هو يقين معين‏\n\n\n### [اليقين المستقل الذي ليس له محل يقوم به‏]\n\n\nوقوله تعالى وما قَتَلُوهُ يَقِيناً يريد ما هو مقتول في نفس الأمر لا عندهم بل شُبِّهَ لَهُمْ فهذا يقين مستقل ليس له محل يقوم به فإنهم متيقنون أنهم قتلوه والله ليس بمحل لليقين فلم يبق محل لليقين سوى القتل وهذا من باب قيام المعنى بالمعنى فإن اليقين معنى والقتل معنى فالقتل قد تيقن في نفسه أنه ما قام بعيسى عليه السلام فالقتل موصوف في هذه الآية باليقين وأصدق المعاني ما قام بالمعاني وهذه المسألة عندنا من محارات العقول مما لا يقضي فيها بشي‏ء وعند بعضنا يلحقه بالمحال وعند بعضهم ممكنة واقعة\n\n\n### [اليقين عزيز الوجود في الأمور الطبيعية المعتادة]\n\n\nوبالجملة فاليقين عزيز الوجود في الأمور الطبيعية المعتادة فإن العادة تسرق الطبع ولا سيما في الأمور التي بها قوام البدن الطبيعي فإذا فقد ما به يصل إلى ما به قوامه فإنه يتألم والألم لا يقدح في اليقين فإنه ما يضاده ولكن قل إن يتألم ذو ألم إلا ولا بد أن يضطرب ويتحرك في نفسه ولا سيما ألم الجوع والعطش والبرد والحر والاضطراب يضاد اليقين فإن اليقين سكون النفس إلى من بيده هذه الأمور المزيلة لهذه الآلام فيريد من قامت به الآلام سرعة زوالها طبعا وإذا كان هذا فنسلك في اليقين طريقة غير ما يتخيلها أهل الطريق وهو أن الاضطراب لا يقدح في اليقين إذا كان هبوب اليقين في إزالة تلك الآلام إلى جناب الحق لا إلى الأسباب المزيلة في العادة فإن شاء الحق أزالها بتلك الأسباب أزالها بأن يوجد عنده تلك الأسباب وإن شاء أزالها بغير ذلك فصار متعلق اليقين الجناب الإلهي لا غير وهذا قد يكون كثيرا في رجال الله‏\n\n\n### [درجات اليقين عند العارفين‏]\n\n\nودرجات اليقين عند العارفين مائتان درجة ودرجة واحدة وعند الملامية مائة وسبعون درجة وهو ملكوتي جبروتي له إلى الملكوت نسبة واحدة وعند العارفين نسبتان لأنه عند العارفين مركب من ست حقائق ونشأته عند الملامية من أربع حقائق وله السكون الميت والحي فبالسكون الحي يضطرب صاحبه وبالسكون الميت يتعلق بالله فما يضطرب فيه من غير تعيين مزيل بل بما أراد الله أن يزيله‏\n\n",
    "en": "Chapter One Hundred and Twenty-Two: Concerning the Knowledge of the Station of Certainty (مقام اليقين) and its Secrets.\n\nCertainty (اليقين) is the dwelling place of Knowledge (العلم) in the immortal soul (الخلد),\nIn every state, by the promise of the One, the Eternally Besought (الواحد الصمد).\n\nThe Certainty (اليقين) that Realization (التحقيق) has achieved—\nCling to it, and look not to anyone else.\n\nFor if it wavers from the rule of steadfastness, then it is not\nThe Certainty by which my immortal soul (خلدي) is strengthened.\n\n[Certainty is that wherein the human being possesses insight (بصيرة)]\n\nCertainty (اليقين) is what is meant by His saying to His Prophet, peace and blessings be upon him: <<وَاعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ>> (And worship your Lord until there comes to you the Certainty). Its ruling is the soul's stillness (سكون النفس) regarding the object of certainty (المتيقن), or its movement toward the object of certainty. It is that wherein the human being possesses insight (بصيرة) regarding whatever matter it may be. Thus, if the ruling of the sought-after thing in the soul is the same as the ruling of the thing already attained, that is Certainty, whether the object of certainty has been realized in time or not. This is like His saying: <<أَتَىٰ أَمْرُ اللَّهِ>> (The Command of Allah has come), even though it has not yet arrived; yet the believing soul is absolutely convinced of its arrival, so there is no difference for it between its realization and its non-realization. This is the meaning of the saying of the one who declared: \"If the veil (الغطاء) were lifted, I would not increase in Certainty.\"\n\nThis is true even though the object of certainty has not been realized in concrete existence (الوجود العيني). Thus, Allah said to His Prophet and to every servant who is like him: <<اعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ>> (Worship your Lord until there comes to you the Certainty). When Certainty comes to you, you will know who is the worshipper and who is the Worshipped, and who is the agent and who is the object acted upon. You will know what the Manifest (الظاهر) has imprinted upon the manifestations (المظاهر) and what the manifestations have bestowed upon the Manifest.\n\n[The Possessor of Certainty (صاحب اليقين) and the Possessor of the Knowledge of Certainty (علم اليقين)]\n\nKnow that Certainty (اليقين) has a Knowledge (علم), an Eye (عين), and a Reality (حق), and every Reality has an essential nature (حقيقة). This will be discussed in a separate chapter later in this book, God willing. It is only assigned Knowledge, Eye, and Reality because there may be a Certainty that is neither Knowledge, nor Eye, nor Reality, yet the one who possesses it is absolutely convinced by it. Such a person is a possessor of Certainty (صاحب يقين), but not a possessor of the Knowledge of Certainty (صاحب علم يقين).\n\n[Is it possible for one Certainty to be more perfect than another Certainty?]\n\nOur companions have differed regarding Certainty (اليقين): Is it possible for one Certainty to be more perfect (أتم) than another, or not? For it was narrated from the Prophet, peace and blessings be upon him, that he said concerning Jesus, peace be upon him: \"Had he increased in Certainty, he would have walked upon the air.\"\n\n[Some] referred this [saying] to the Night Journey (الإسراء), suggesting that by Certainty, he was enabled to walk upon the air. This interpretation is baseless, for his Lord carried him on the Night Journey to show him some of His signs, and He sent the Buraq to him, so he was carried during his journey.\n\nFurthermore, it is not sound that the Messenger of Allah, peace and blessings be upon him, referred to himself with that saying [about Jesus]. It is known that no human being equals him in Certainty, yet he did not walk upon the air by his Certainty. Rather, Gabriel, peace be upon him, brought him a beast called the Buraq, smaller than a mule and larger than a donkey, and it was the Buraq that traveled through the air. Then, when the Buraq reached the limit permitted to it, he, peace and blessings be upon him, dismounted and sat upon the *Rafraf* (a celestial cushion), which ascended with him to where Allah willed. People have been heedless of all this. Thus, he, peace and blessings be upon him, was not carried on the Night Journey due to the strength of his Certainty; rather, his Certainty in his heart, with its attachment to the Universal Object of Certainty (المتيقن العام), was what it was. Nevertheless, this [Certainty] is among the things that constitute his felicity, as he was described by it in the context of praise.\n\n[The Nobility of Certainty (اليقين) is due to the Nobility of its Subject, which is the Object of Certainty (المتيقن)]\n\nWe have a noble section concerning Certainty (اليقين) that we placed in the Mosque of Certainty, the mosque of Abraham the Intimate (الخليل), during our visit to Lot, peace be upon him. For the ignorant person may be certain that he is ignorant, the conjecturer certain that he is conjecturing, and the doubter certain that he is doubting the matter he doubts. Each one is a possessor of Certainty (صاحب يقين), absolutely convinced of the state he is in, whether it is knowledge or something other than knowledge. If you ask, \"Where then is its nobility?\" We reply: \"Its nobility is due to the nobility of the object of certainty (المتيقن), just like Knowledge (العلم).\" This is why the definite article (ال) is used in His saying: <<حَتَّى يَأْتِيَكَ الْيَقِينُ>> (Until there comes to you the Certainty), meaning a specific object of certainty, not just any certainty that warrants praise, but a designated Certainty.\n\n[Independent Certainty (اليقين المستقل) that has no locus (محل) in which to subsist]\n\nAnd His saying, the Exalted: <<وَمَا قَتَلُوهُ يَقِينًا>> (And they did not kill him with certainty), means that he was not killed in reality (*fi nafs al-amr*), but only in their perception: <<بَلْ شُبِّهَ لَهُمْ>> (But it was made to appear to them). This is an independent Certainty (يقين مستقل) that has no locus (محل) in which to subsist. For they were certain that they killed him, and Allah is not a locus for Certainty. Thus, no locus for Certainty remains except the killing itself. This falls under the category of the subsistence of a meaning (معنى) in a meaning, for Certainty is a meaning and killing is a meaning. The killing itself was certain that it did not subsist in Jesus, peace be upon him. Therefore, in this verse, the killing is described by Certainty. The most truthful meanings are those that subsist in meanings. This issue, in our view, is among the perplexities of the intellects (محارات العقول) about which nothing definitive can be ruled. Some of us consider it impossible, while others consider it possible and actual.\n\n[Certainty (اليقين) is rare in customary natural affairs]\n\nIn general, Certainty (اليقين) is rare in customary natural affairs, for custom steals away nature, especially in matters upon which the stability of the natural body depends. If that which sustains the body is lost, the person suffers pain. Pain does not invalidate Certainty, for it is not its opposite. However, rarely does a person suffer pain without becoming agitated and inwardly disturbed, especially the pain of hunger, thirst, cold, and heat. Disturbance (الاضطراب) is contrary to Certainty, for Certainty is the soul's stillness (سكون النفس) toward the One in Whose hand are the matters that remove these pains. Thus, the one afflicted by pain naturally desires its swift removal. Given this, we follow a path regarding Certainty different from what the people of the Way (أهل الطريق) imagine. This is that disturbance does not invalidate Certainty, provided that the impulse of Certainty in removing those pains is directed toward the Divine Presence (جناب الحق), and not toward the customary means of removal. If the Real (الحق) wills to remove them through those means, He removes them by making those means available to the person. If He wills to remove them otherwise, He does so. Thus, the object of Certainty becomes the Divine Presence (الجناب الإلهي) and nothing else. This is often the case among the Men of Allah (رجال الله).\n\n[The Degrees of Certainty (اليقين) according to the Gnostics (العارفين)]\n\nThe degrees of Certainty (اليقين) according to the Gnostics (العارفين) are two hundred and one degrees. According to the Malamiyya (الـمـلامـيـة), they are one hundred and seventy degrees. Certainty is of the angelic (ملكوتي) and mighty (جبروتي) realms; it has one relation to the angelic realm (الملكوت), but two relations according to the Gnostics, because, in their view, it is composed of six realities (حقائق), whereas, according to the Malamiyya, its origin is from four realities. Certainty possesses both dead stillness (السكون الميت) and living stillness (السكون الحي). By the living stillness, its possessor is disturbed, but by the dead stillness, he clings to Allah. Thus, he is not disturbed by specifying a remover [of pain], but rather by whatever Allah wills to remove it.",
    "ur": "## (باب ایک سو بائیس: مقام یقین اور اس کے اسرار کی معرفت میں)\n\nیقین علم کا ٹھکانہ ہے ہمیشہ کے لیے، ہر حال میں واحد و صمد کے وعدے کے ساتھ۔\nیقین وہ ہے جسے تحقیق نے حاصل کیا، اس پر جم جا اور کسی اور کی طرف مت دیکھ۔\nاگر وہ ثبات کے حکم سے متزلزل ہو جائے، تو وہ یقین نہیں جس سے میرا دل مضبوط ہوتا ہے۔\n\n### [یقین وہ ہے جس میں انسان بصیرت پر ہوتا ہے]\n\nاور یقین نبی اکرم صلی اللہ علیہ وسلم کے لیے اللہ تعالیٰ کا یہ فرمان ہے:\n**\"اور اپنے رب کی عبادت کرتے رہو یہاں تک کہ تمہیں یقین (موت) آ جائے\"** (الحجر: ۹۹)۔\nاور اس کا حکم یہ ہے کہ نفس کا متقین (جس پر یقین کیا گیا) کے ساتھ سکون یا متقین کی طرف حرکت ہو۔ اور یہ وہ ہے جس میں انسان کسی بھی چیز کے بارے میں بصیرت (بصیرۃ) پر ہوتا ہے۔ پس جب نفس میں طالب کا حکم حاصل شدہ کے حکم جیسا ہو جائے تو یہی یقین ہے، خواہ متقین اس وقت حاصل ہو یا نہ ہو۔ جیسا کہ اللہ تعالیٰ کا فرمان ہے:\n**\"آ گیا اللہ کا حکم\"** (النحل: ۱)۔\nحالانکہ وہ ابھی نہیں آیا، لیکن مومن نفس اس کے آنے کا یقین رکھتا ہے، لہٰذا اس کے نزدیک اس کے حصول اور عدم حصول میں کوئی فرق نہیں۔ اور یہ اس شخص کا قول ہے جس نے کہا: \"اگر پردہ ہٹا دیا جائے تو میرے یقین میں اضافہ نہیں ہو گا\"۔\n\nحالانکہ متقین (جس پر یقین کیا گیا) وجودِ عینی میں حاصل نہیں ہوا تھا۔ پس اللہ تعالیٰ نے اپنے نبی اور ہر اس بندے سے جو ان کے مقام پر ہو، فرمایا: **\"اپنے رب کی عبادت کرتے رہو یہاں تک کہ تمہیں یقین آ جائے\"** (الحجر: ۹۹)۔ پس جب تمہیں یقین آ جائے گا تو تم جان لو گے کہ عابد کون ہے اور معبود کون، اور عامل کون ہے اور جس پر عمل کیا گیا وہ کون، اور تم جان لو گے کہ ظاہر نے مظاہر (ظہور کی جگہوں) میں کیا اثر ڈالا اور مظاہر نے ظاہر میں کیا عطا کیا۔\n\n### [صاحب یقین اور صاحب علم الیقین]\n\nاور جان لو کہ یقین کے لیے علم، عین (آنکھ) اور حق ہے، اور ہر حق کے لیے ایک حقیقت (حقیقۃ) ہے۔ اور اس کتاب میں اس کے بعد ایک الگ باب میں اس کا ذکر آئے گا، ان شاء اللہ تعالیٰ۔ اس کے لیے علم، عین اور حق اس لیے مقرر کیا گیا ہے کہ کبھی ایسا یقین بھی ہوتا ہے جو نہ علم ہوتا ہے، نہ عین اور نہ حق، اور جس شخص کو یہ حاصل ہوتا ہے وہ اس پر یقین رکھتا ہے، اور وہ صاحبِ یقین ہوتا ہے، نہ کہ صاحبِ علم الیقین (علم اليقين)۔\n\n### [کیا ایک یقین دوسرے یقین سے زیادہ کامل ہو سکتا ہے؟]\n\nہمارے اصحاب نے یقین کے بارے میں اختلاف کیا ہے کہ کیا ایک یقین دوسرے یقین سے زیادہ کامل ہو سکتا ہے یا نہیں؟ کیونکہ:\n\nنبی اکرم صلی اللہ علیہ وسلم سے روایت ہے کہ آپ نے عیسیٰ علیہ السلام کے بارے میں فرمایا: \"اگر ان کا یقین بڑھ جاتا تو وہ ہوا میں چلتے۔\"\n\nاس سے آپ نے شبِ معراج کی طرف اشارہ کیا کہ یقین کی وجہ سے آپ کے لیے ہوا میں چلنا صحیح ہوا۔ لیکن یہ تفسیر کوئی حیثیت نہیں رکھتی، کیونکہ آپ کو آپ کے رب نے اس لیے سیر کرائی تاکہ وہ آپ کو اپنی نشانیاں دکھائے، اور آپ کی طرف براق بھیجا گیا، لہٰذا آپ معراج میں سوار تھے۔\n\nاور ایسی حدیث رسول اللہ صلی اللہ علیہ وسلم سے صحیح نہیں ہے کہ آپ نے اس سے اپنی ذات کی طرف اشارہ کیا ہو۔ اور یہ معلوم ہے کہ یقین میں کوئی بھی بشر آپ کے برابر نہیں ہے، لیکن آپ اپنے یقین کی قوت سے ہوا میں نہیں چلے، بلکہ آپ کے پاس جبرائیل علیہ السلام ایک جانور لے کر آئے جو خچر سے چھوٹا اور گدھے سے بڑا تھا، جسے براق کہا جاتا ہے۔ پس آپ اور براق تھے، اور براق ہی تھا جو ہوا میں چلا۔ پھر جب براق آپ کو اس حد تک لے گیا جہاں تک اسے اجازت تھی، تو آپ اس سے اترے اور رفرف (ایک قسم کا بچھونا) پر بیٹھے، اور وہ آپ کو وہاں لے گیا جہاں اللہ نے چاہا۔ اور لوگ ان سب باتوں سے غافل رہے۔ پس آپ صلی اللہ علیہ وسلم کو آپ کے یقین کی قوت کی وجہ سے معراج نہیں کرائی گئی، بلکہ آپ کا یقین آپ کے دل میں متقینِ عام (العام المتيقن) سے تعلق کے اعتبار سے جیسا تھا ویسا ہی رہا، لیکن یہ ان چیزوں میں سے ہے جس میں آپ کی سعادت ہے، کیونکہ اس کا ذکر تعریف کے ضمن میں کیا گیا ہے۔\n\n### [یقین کی شرافت اس کے موضوع یعنی متقین امر کی شرافت سے ہے]\n\nاور یقین کے بارے میں ہمارا ایک شریف حصہ ہے جسے ہم نے ابراہیم خلیل کے مسجدِ یقین میں رکھا تھا جب ہم لوط علیہ السلام کی زیارت کے لیے گئے تھے۔ جاہل کو یقین ہو سکتا ہے کہ وہ جاہل ہے، اور گمان کرنے والے کو یقین ہو سکتا ہے کہ وہ گمان کرنے والا ہے، اور شک کرنے والے کو یقین ہو سکتا ہے کہ وہ جس چیز میں شک کر رہا ہے اس میں شاک ہے۔ اور ہر ایک اپنی اس حالت پر یقین رکھنے والا ہے جس پر وہ ہے، خواہ وہ علم ہو یا غیر علم۔ اگر تم کہو کہ پھر اس کی شرافت کہاں ہے؟ ہم کہیں گے کہ اس کی شرافت متقین (جس پر یقین کیا گیا) کی شرافت سے ہے، بالکل علم کی طرح۔ اور اسی لیے اللہ تعالیٰ کے اس فرمان میں الف لام آیا ہے: **\"یہاں تک کہ تمہیں الیقین (الیقین) آ جائے\"** (الحجر: ۹۹)۔ اس سے مراد ایک خاص متقین ہے، نہ کہ وہ یقین جس کی تعریف کی جاتی ہے، بلکہ یہ ایک معین یقین ہے۔\n\n### [مستقل یقین جس کا کوئی محل نہیں جس پر وہ قائم ہو]\n\nاور اللہ تعالیٰ کا فرمان: **\"اور انہوں نے اسے یقیناً قتل نہیں کیا\"** (النساء: ۱۵۷)۔ اس سے مراد یہ ہے کہ وہ حقیقت میں مقتول نہیں ہے، نہ کہ ان کے نزدیک، بلکہ **\"ان کے لیے مشتبہ کر دیا گیا\"** (النساء: ۱۵۷)۔ پس یہ ایک مستقل یقین ہے جس کا کوئی محل نہیں جس پر وہ قائم ہو۔ کیونکہ وہ یقین رکھتے ہیں کہ انہوں نے اسے قتل کیا، اور اللہ تعالیٰ یقین کا محل نہیں ہے۔ لہٰذا یقین کا کوئی محل باقی نہیں رہا سوائے قتل کے۔ اور یہ معنی کا معنی کے ساتھ قائم ہونے کے باب سے ہے۔ کیونکہ یقین ایک معنی ہے اور قتل ایک معنی ہے۔ پس قتل نے خود ہی یقین کر لیا کہ وہ عیسیٰ علیہ السلام کے ساتھ قائم نہیں ہوا۔ پس اس آیت میں قتل کو یقین کے ساتھ موصوف کیا گیا ہے، اور معانی میں سب سے سچے وہ ہیں جو معانی کے ساتھ قائم ہوں۔ اور یہ مسئلہ ہمارے نزدیک عقلوں کے لیے حیرت انگیز باتوں میں سے ہے جس میں کوئی فیصلہ نہیں کیا جا سکتا۔ اور ہمارے بعض اصحاب کے نزدیک یہ محال (ناممکن) کے ساتھ ملحق ہے، اور بعض کے نزدیک یہ ممکن اور واقع ہے۔\n\n### [یقین کا عام طبعی امور میں نایاب ہونا]\n\nاور خلاصہ یہ کہ عام طبعی امور میں یقین کا وجود نایاب ہے۔ کیونکہ عادت طبیعت کو چرا لیتی ہے، خاص طور پر ان امور میں جن پر طبعی بدن کا قیام ہے۔ پس جب وہ چیز مفقود ہو جاتی ہے جس سے اس کے قیام کی چیز حاصل ہوتی ہے، تو اسے تکلیف ہوتی ہے، اور تکلیف یقین میں نقص پیدا نہیں کرتی، کیونکہ وہ اس کی ضد نہیں ہے۔ لیکن کم ہی ایسا ہوتا ہے کہ کوئی تکلیف والا شخص تکلیف محسوس کرے اور وہ اپنے اندر مضطرب اور متحرک نہ ہو، خاص طور پر بھوک، پیاس، سردی اور گرمی کی تکلیف۔ اور اضطراب یقین کی ضد ہے، کیونکہ یقین نفس کا اس ذات کی طرف سکون ہے جس کے ہاتھ میں یہ امور ہیں جو ان تکالیف کو دور کرتے ہیں۔ پس جس میں یہ تکالیف قائم ہوں وہ طبعاً ان کے جلد زائل ہونے کا خواہاں ہوتا ہے۔ اور جب یہ صورت حال ہو تو ہم یقین میں ایک ایسا طریقہ اختیار کرتے ہیں جو اہل طریق کے تصور سے مختلف ہے۔ اور وہ یہ ہے کہ اضطراب یقین میں نقص پیدا نہیں کرتا، جب یقین کا جھونکا ان تکالیف کو دور کرنے کے لیے جنابِ حق کی طرف ہو، نہ کہ ان اسباب کی طرف جو عادت میں دور کرنے والے ہیں۔ پس اگر حق چاہے تو ان اسباب کے ذریعے دور کر دے، اس طرح کہ وہ اسباب اس کے پاس موجود کر دے، اور اگر چاہے تو اس کے علاوہ کسی اور طریقے سے دور کر دے۔ پس یقین کا تعلق صرف جنابِ الٰہی سے ہو گیا، اور یہ اللہ کے بندوں میں کثرت سے پایا جاتا ہے۔\n\n### [عارفین کے نزدیک یقین کے درجات]\n\nاور عارفین کے نزدیک یقین کے درجات دو سو ایک (۲۰۱) ہیں۔ اور ملامیہ (الملامیۃ) کے نزدیک ایک سو ستر (۱۷۰) درجات ہیں۔ اور یہ ملکوت و جبروت سے تعلق رکھتا ہے، اور ملکوت سے اس کا ایک ہی نسبت ہے۔ اور عارفین کے نزدیک اس کی دو نسبتیں ہیں، کیونکہ عارفین کے نزدیک یہ چھ حقائق سے مرکب ہے، اور ملامیہ کے نزدیک اس کی نشأت چار حقائق سے ہے۔ اور اس کے لیے سکونِ میت (مردہ سکون) اور سکونِ حی (زندہ سکون) ہے۔ پس سکونِ حی سے اس کا صاحب مضطرب ہوتا ہے، اور سکونِ میت سے وہ اللہ سے تعلق رکھتا ہے۔ پس وہ اس میں مضطرب ہوتا ہے بغیر کسی معین زائل کرنے والے کے، بلکہ اس چیز کے ساتھ جسے اللہ نے زائل کرنے کا ارادہ کیا ہو۔",
    "fa": "(باب صد و بیست و دوم در معرفت مقام یقین و اسرار آن)\n\nیقین جایگاه علم در جاودانگی است\nدر هر حال، به وعده خداوند یگانه بی‌نیاز (الواحد الصمد).\n\nیقین، آن است که تحقیق (تحقق) آن را به دست آورده است\nبر آن مداومت کن و به هیچ‌کس منگر.\n\nپس اگر از حکم ثبات خود متزلزل شود\nآن یقینی نیست که جاودانگی‌ام به واسطه آن تقویت گردد.\n\n### [یقین آن است که انسان در آن بر بصیرت باشد]\n\nو یقین همان قول خداوند به پیامبرش (صلی الله علیه و سلم) است: «و پروردگارت را بپرست تا یقین (الیقین) به تو آید» (وَاعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ). حکم یقین، سکون نفس به امر متيقن یا حرکت آن به سوی امر متيقن است. و آن چیزی است که انسان در آن بر بصیرت (بصيرة) باشد، هر چه که باشد. پس اگر حکم امر مطلوب در نفس، حکم امر حاصل شده باشد، آن یقین است؛ چه امر متيقن در آن زمان حاصل شده باشد یا نشده باشد، مانند قول خداوند: «امر خدا آمد» (أَتَىٰ أَمْرُ اللَّهِ)، در حالی که هنوز نیامده است. اما نفس مؤمن به آمدن آن قطعیت دارد، پس نزد او فرقی میان حصول آن و عدم حصولش نیست. و این همان قول کسی است که گفت: «اگر پرده برداشته شود، بر یقین من افزوده نخواهد شد.»\n\nبا وجود اینکه امر متيقن در هستی (الوجود) عینی حاصل نشده است، خداوند به پیامبرش و به هر بنده‌ای که در جایگاه او باشد فرمود: «پروردگارت را بپرست تا یقین (الیقین) به تو آید» (وَاعْبُدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِينُ). پس هنگامی که یقین به تو آید، خواهی دانست که عابد کیست و معبود کیست، و عامل کیست و معمول به چیست؛ و خواهی دانست که ظاهر در مظاهر چه تأثیری گذاشته و مظاهر در ظاهر چه چیزی بخشیده‌اند.\n\n### [صاحب یقین و صاحب علم یقین]\n\nو بدان که یقین دارای علم، عین و حق است، و هر حقی را حقیقتی است. این مطلب در بابی جداگانه پس از این در همین کتاب خواهد آمد، ان‌شاءالله تعالی. و یقین از آن رو دارای علم و عین و حق قرار داده شده است که گاهی یقینی وجود دارد که نه علم است، نه عین و نه حق، و کسی که آن را به دست آورده، به آن قطعیت می‌یابد، و او صاحب یقین است نه صاحب علم یقین.\n\n### [آیا صحیح است که یقینی کامل‌تر از یقین دیگر باشد؟]\n\nاصحاب ما در مورد یقین اختلاف نظر دارند که آیا صحیح است یقینی کامل‌تر از یقین دیگر باشد یا خیر؟ زیرا از پیامبر (صلی الله علیه و سلم) روایت شده است که درباره عیسی (علیه السلام) فرمود: «اگر بر یقینش افزوده می‌شد، در هوا راه می‌رفت.»\n\n(برخی) با این حدیث به شب معراج اشاره کرده‌اند و اینکه به واسطه یقین، راه رفتن در هوا برای او صحیح بود. اما این تفسیر صحیح نیست، زیرا پروردگارش او را به معراج برد تا از آیات خود به او نشان دهد و براق را برای او فرستاد، پس او در معراج خود حمل می‌شد.\n\nو چنین حدیثی صحیح نیست که رسول خدا (صلی الله علیه و سلم) با آن به خود اشاره کرده باشد. و معلوم است که هیچ‌کس از بشر در یقین با او برابری نمی‌کند، اما او با یقین خود در هوا راه نرفت، بلکه جبرئیل (علیه السلام) حیوانی را آورد که کوچک‌تر از قاطر و بزرگ‌تر از الاغ بود و براق نامیده می‌شد. پس او (پیامبر) بود و براق بود که در هوا راه می‌رفت. سپس هنگامی که براق او را به حدی که برایش مجاز بود رساند، از آن پیاده شد و بر رفرف نشست و به جایی که خداوند اراده کرده بود بالا رفت. و مردم از همه این‌ها غافل شدند. پس معراج او (صلی الله علیه و سلم) به خاطر قوت یقینش نبود، بلکه یقین او در قلبش، بر همان حال که از تعلق به امر متيقن (المتیقن) عام بود، هر چه بود، اما از اموری است که سعادت او در آن است، زیرا در مقام مدح به آن توصیف شده است.\n\n### [شرافت یقین به شرافت موضوع آن است که همان امر متيقن است]\n\nو ما در باب یقین، بخشی شریف داریم که آن را در مسجد یقین، یعنی مسجد ابراهیم خلیل، هنگام زیارتمان از لوط (علیه السلام) قرار دادیم. چه بسا جاهل یقین دارد که جاهل است، و گمان‌کننده یقین دارد که گمان می‌کند، و شک‌کننده یقین دارد که در آنچه شک می‌کند، شک دارد. و هر یک از این‌ها صاحب یقین قاطع به حال خود است، خواه علم باشد یا غیر علم. اگر بگویی: پس شرافت یقین کجاست؟ می‌گوییم: شرافت آن به شرافت امر متيقن (المتیقن) است، مانند علم. و به همین دلیل در قول خداوند: «تا یقین (الیقین) به تو آید» (حَتَّى يَأْتِيَكَ الْيَقِينُ)، الف و لام آمده است؛ یعنی امر متيقن خاصی را اراده کرده است، نه یقینی که مدح به واسطه آن واقع شود، بلکه یقینی معین است.\n\n### [یقین مستقل که محلی برای قیام ندارد]\n\nو قول خداوند متعال: «و او را به یقین نکشتند» (وَمَا قَتَلُوهُ يَقِينًا)، یعنی او در نفس‌الامر کشته نشده است، نه نزد آنان، بلکه امر بر ایشان مشتبه شد (شُبِّهَ لَهُمْ). پس این یک یقین مستقل است که محلی برای قیام ندارد. زیرا آنان یقین داشتند که او را کشته‌اند، و خداوند محل یقین نیست. پس محلی برای یقین جز قتل باقی نماند. و این از باب قیام معنا به معنا است؛ زیرا یقین یک معنا است و قتل نیز یک معنا. پس قتل در نفس خود یقین یافته است که به عیسی (علیه السلام) تعلق نگرفته است. بنابراین، قتل در این آیه به یقین توصیف شده است. و صادق‌ترین معانی، آن است که به معانی قیام کند. این مسئله نزد ما از امور حیرت‌انگیز عقول است که نمی‌توان در آن حکمی صادر کرد. و نزد برخی از ما، آن را به محال ملحق می‌کنند، و نزد برخی دیگر، ممکن و واقع شده است.\n\n### [یقین در امور طبیعی معتاد، کمیاب است]\n\nبه طور کلی، یقین در امور طبیعی و معتاد، کمیاب است. زیرا عادت، طبع را می‌رباید، به ویژه در اموری که قوام بدن طبیعی به آن‌ها وابسته است. پس اگر آنچه قوام بدن به آن وابسته است از دست برود، انسان درد می‌کشد. و درد در یقین خللی وارد نمی‌کند، زیرا ضد آن نیست. اما کمتر کسی است که دردی بکشد و در نفس خود مضطرب و متحرک نشود، به ویژه درد گرسنگی، تشنگی، سرما و گرما. و اضطراب ضد یقین است، زیرا یقین سکون نفس به سوی کسی است که این امور زائل‌کننده دردها به دست اوست. پس کسی که دردها به او عارض شده، طبعاً خواهان زوال سریع آن‌هاست. و اگر چنین باشد، ما در باب یقین راهی را می‌پیماییم که غیر از آن چیزی است که اهل طریقت تصور می‌کنند، و آن این است که اضطراب در یقین خللی وارد نمی‌کند، به شرط آنکه توجه یقین در رفع آن دردها به سوی جناب حق (الحق) باشد، نه به سوی اسباب زائل‌کننده در عادت. پس اگر حق (الحق) بخواهد آن‌ها را با آن اسباب زائل کند، با فراهم آوردن آن اسباب نزد بنده، زائل می‌کند؛ و اگر بخواهد، با غیر آن زائل می‌نماید. پس متعلق یقین، تنها جناب الهی می‌شود و نه چیز دیگر. و این امر در میان رجال الله (مردان خدا) بسیار اتفاق می‌افتد.\n\n### [درجات یقین نزد عارفان]\n\nو درجات یقین نزد عارفان (العارفين) دویست و یک درجه است، و نزد ملامتیه (الملامية) صد و هفتاد درجه. و یقین، ملکوتى جبروتى است که به ملکوت یک نسبت دارد، اما نزد عارفان دو نسبت دارد، زیرا نزد عارفان از شش حقیقت ترکیب یافته است و نشأت آن نزد ملامتیه از چهار حقیقت است. و یقین دارای سکون مرده و زنده است. پس با سکون زنده، صاحبش مضطرب می‌شود، و با سکون مرده، به خداوند تعلق می‌یابد. پس در آن اضطرابی نیست مگر بدون تعیین زائل‌کننده، بلکه به آنچه خداوند اراده کرده است که آن را زائل کند."
  },
  "page_count": 2
}