{
  "id": 116,
  "title": {
    "ar": "الباب السادس عشر ومائة في معرفة القناعة وأسرارها",
    "en": "Chapter One Hundred and Sixteen: Concerning the Knowledge (معرفة) of Contentment (القناعة) and its Secrets.",
    "ur": "باب نمبر ایک سو سولہ: قناعت کی معرفت (المعرفۃ) اور اس کے اسرار کے بیان میں",
    "fa": "باب صد و شانزدهم در معرفت قناعت و اسرار آن"
  },
  "content": {
    "ar": "## (الباب السادس عشر ومائة في معرفة القناعة وأسرارها)\n\n\n> إن القناعة باب أنت داخله *** إن كنت ذاك الذي يرجى لخدمته‏\n\n\n> فاقنع بما أعطت الأيام من نعم *** من الطبيعة لا تقنع بنعمته‏\n\n\n> لو كان عندك مال الخلق كلهم *** لم يأكل الشخص منه غير لقمته‏\n\n\n### [القناعة لا تتنافى مع طلب المزيد من الخير من الله‏]\n\n\nليست القناعة عندنا الاكتفاء بالموجود من غير طلب المزيد أرسل الله تعالى على أيوب وهو نبي مكرم قيل فيه نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ وأثنى عليه بالصبر مع دعائه ربه في كشف الضر عنه فازاله‏\n\n\nفلما أرسل عليه رجلا من جراد من ذهب فأخذ يجمعه في ثوبه فقال له ربه أ لم أكن أغنيتك عن هذا فقال يا رب لا غنى بي عن خيرك‏\n\n\nفإن كان فعل هذا لما هو عليه ظاهر الحال فهو ما أردنا وإن كان ليقتدي به في ذلك فما فعل إلا ما هو أولى بالقربة إلى الله من تركه وهو من الَّذِينَ هَدَى الله وأمر الله نبيه صَلَّى اللهُ عَليهِ وسَلَّم بالاقتداء بهداهم وقال لنا لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ\n\n\n### [القناعة لغة هي المسألة والقانع هو السائل‏]\n\n\nوالقناعة عندنا على بابها في اللسان وهي المسألة والقانع السائل والسؤال من الله لا من غيره يقال قنع يقنع قنوعا إذا سأل وهو الذي رفع سؤاله إلى الله وهو قوله في الظالمين يوم القيامة مُقْنِعِي رُؤُسِهِمْ أي رافعين إلى الله يسألونه المغفرة عن جرائمهم ويجتمع الحدان في أمر وهو أن السائلين الله قنعوا به في سؤالهم والتجائهم إليه فلم يسألوا غيره تعالى فهذا معنى قول الأكابر الاكتفاء بالموجود وهو الله بالسؤال عن طلب المزيد وهو أن يتعدى بالسؤال إلى غيره‏\n\n\n### [من سأل غير الله فليس بقانع‏]\n\n\nوالخلق عيال الله أي الفقراء إلى الله فمن سأل غير الله فليس بقانع ويخاف عليه من الحرمان والخسران فإن السائل موصوف بالركون لمن سأله والله يقول ولا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وما لَكُمْ من دُونِ الله من أَوْلِياءَ ثُمَّ لا تُنْصَرُونَ ومن ركن إلى جنسه فقد ركن إلى ظالم فإن الله يقول في الإنسان إِنَّهُ كانَ ظَلُوماً لحمله الأمانة وما من أحد من الناس إلا حملها فلا تركن إلى غير الله واكتف بالله في سؤالك تسعد إن شاء الله‏\n\n\n### [درجات القناعة ونسبها في منظور العارفين‏]\n\n\nوللقناعة درجات عند العارفين من أهل الأنس والوصال وهي ستمائة واثنتان وخمسون درجة ودرجاتها عند العارفين من أهل الأدب والوقوف مائتان وسبع وخمسون درجة ودرجاتها عند الملامية من أهل الأنس والوصال ستمائة وإحدى وعشرون درجة ودرجاتها عند الملامتية من أهل الأدب والوقوف مائتان وست وعشرون درجة وللقناعة الدعوى ولها نسبتان نسبة إلى عالم الجبروت ونسبة إلى عالم الملكوت وليس لها إلى عالم الملك نسبة ظاهرة بل لها نسبة باطنة إلى عالم الملك يظهر ذلك القنوع وهذا القدر كاف فيها والله الموفق‏\n\n",
    "en": "## Chapter 116: Concerning the Gnosis of Contentment (القناعة) and its Secrets\n\n> Indeed, Contentment is a door you enter,\n> If you are that one who is hoped for His service.\n> So be content with the bounties the days have granted\n> From nature, but do not be content with His blessing.\n> If you possessed the wealth of all creation,\n> A person would eat from it nothing more than his own morsel.\n\n### [Contentment does not contradict seeking more good from Allah]\n\nContentment (*al-Qana'ah*) in our view is not merely being satisfied with what is present without seeking more. Allah Almighty sent affliction upon Ayyub (Job), who was an honored prophet—of whom it was said: <<نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ>> (What an excellent servant! Indeed, he was ever-returning [to Allah])—and praised him for his patience, even while he supplicated his Lord to remove the affliction from him, and He removed it.\n\nWhen He sent upon him a swarm of golden locusts, he began gathering them into his garment. His Lord said to him, \"Did I not make you independent of this?\" He replied, \"O Lord, I have no independence from Your goodness (خيرك).\"\n\nIf he did this based on the apparent state of affairs, then that is what we intended [to show]. And if it was done so that others might emulate him in this, then he did nothing but what is more deserving of proximity (القربة) to Allah than abandoning it. He is among those whom Allah guided, and Allah commanded His Prophet (peace and blessings be upon him) to follow their guidance, and He said to us: <<لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ>> (Indeed, in the Messenger of Allah you have an excellent example).\n\n### [Linguistically, Contentment is asking, and the Qani' is the asker]\n\nAnd *al-Qana'ah* (Contentment), in our view, retains its linguistic meaning: it is the act of asking (المسألة), and the *Qani'* (القَانِع) is the asker.\n\nThe asking must be of Allah, not of anyone else. It is said: *qana'a, yaqna'u, qunu'an* when he asked, and he is the one who raised his request to Allah. This is related to His saying concerning the wrongdoers on the Day of Resurrection: <<مُقْنِعِي رُؤُسِهِمْ>> (raising their heads), meaning raising them toward Allah, asking Him for forgiveness for their crimes.\n\nThe two definitions meet in one matter: that those who ask Allah are content (قنعوا) with Him in their asking and their seeking refuge in Him, so they do not ask anyone other than Him, the Exalted. This, then, is the meaning of the saying of the great masters: \"Being satisfied with what is present,\" which is Allah, by asking Him for the seeking of more, which means avoiding asking anyone other than Him.\n\n### [Whoever asks other than Allah is not Qani']\n\nAnd creation (الخلق) are the dependents (*'iyal*) of Allah, meaning they are the poor (الفقراء) toward Allah. So whoever asks other than Allah is not a *Qani'*, and there is fear for him of deprivation (الحرمان) and loss (الخسران).\n\nFor the asker is characterized by reliance (الركون) upon the one he asks, and Allah says: <<وَلَا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وَمَا لَكُمْ مِنْ دُونِ اللَّهِ مِنْ أَوْلِيَاءَ ثُمَّ لَا تُنْصَرُونَ>> (And do not incline toward those who do wrong, lest the Fire touch you. And you have no protectors besides Allah; then you would not be aided).\n\nAnd whoever relies upon his own kind has relied upon a wrongdoer (ظالم), for Allah says concerning humanity: <<إِنَّهُ كَانَ ظَلُومًا>> (Indeed, he was ever a wrongdoer) due to his bearing the Trust (الأمانة). There is no one among mankind who did not bear it. So do not rely upon other than Allah, and be sufficient with Allah in your asking, and you will be happy, God willing.\n\n### [The degrees of Contentment and its relations in the view of the Gnostics]\n\nAnd *al-Qana'ah* has degrees (درجات) according to the Gnostics (العارفين) who are the People of Intimacy (*Uns*) and Union (*Wisal*): 652 degrees.\n\nAnd its degrees according to the Gnostics who are the People of Proper Conduct (*Adab*) and Halting (*Wuquf*): 257 degrees.\n\nAnd its degrees according to the Malamiyya (People of Blame) who are the People of Intimacy and Union: 621 degrees.\n\nAnd its degrees according to the Malamatiyya who are the People of Proper Conduct and Halting: 226 degrees.\n\nAnd *al-Qana'ah* has a claim (الدعوى), and it has two relations (نسبتان): a relation to the World of Power (عالم الجبروت) and a relation to the World of Dominion (عالم الملكوت). It does not have an apparent relation to the World of Sovereignty (عالم الملك), but rather it has an inner relation to the World of Sovereignty, through which that contentment (القنوع) manifests. This much suffices concerning it, and Allah is the Granter of Success.",
    "ur": "(باب نمبر ایک سو سولہ: قناعت کی معرفت اور اس کے اسرار کے بیان میں)\n\nبے شک قناعت ایک دروازہ ہے جس میں تم داخل ہو گے،\nاگر تم وہ ہو جس سے اس کی خدمت کی امید کی جاتی ہے۔\n\nپس ان نعمتوں پر قناعت کرو جو ایام نے طبیعت کی طرف سے دی ہیں،\nاس کی نعمت پر قناعت نہ کرو۔\n\nاگر تمام مخلوق کا مال بھی تمہارے پاس ہو،\nتو بھی شخص اس میں سے اپنی لقمے کے سوا کچھ نہیں کھائے گا۔\n\n### [قناعت اللہ سے مزید خیر طلب کرنے کے منافی نہیں ہے]\n\nہمارے نزدیک قناعت (القناعة) موجود پر اکتفا کر لینا نہیں ہے کہ مزید طلب نہ کی جائے۔ اللہ تعالیٰ نے ایوب (علیہ السلام) پر، جو ایک مکرم نبی تھے اور جن کے بارے میں کہا گیا: نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ (وہ کیا ہی اچھا بندہ تھا، بے شک وہ بہت رجوع کرنے والا تھا) [ص: 44]، صبر کے ساتھ ان کی تعریف فرمائی، باوجود اس کے کہ انہوں نے اپنے رب سے تکلیف دور کرنے کی دعا کی تھی، اور اللہ نے اسے دور کر دیا۔\n\nجب اللہ نے ان پر سونے کی ٹڈیوں کا ایک لشکر بھیجا، تو وہ انہیں اپنے کپڑے میں جمع کرنے لگے، تو ان کے رب نے ان سے فرمایا: کیا میں نے تمہیں اس سے بے نیاز نہیں کر دیا تھا؟ انہوں نے عرض کیا: اے رب! مجھے تیرے خیر (الخیر) سے کوئی بے نیازی (غنی) نہیں۔\n\nاگر انہوں نے یہ عمل ظاہری حال کی وجہ سے کیا، تو یہی ہماری مراد ہے۔ اور اگر انہوں نے یہ اس لیے کیا تاکہ لوگ اس میں ان کی اقتدا کریں، تو انہوں نے وہی کیا جو اسے چھوڑنے کے مقابلے میں اللہ کے قرب کے زیادہ لائق ہے۔ اور وہ ان لوگوں میں سے ہیں جنہیں اللہ نے ہدایت دی، اور اللہ نے اپنے نبی صلی اللہ علیہ وسلم کو ان کی ہدایت کی پیروی کرنے کا حکم دیا، اور ہم سے فرمایا: لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ (بے شک تمہارے لیے رسول اللہ میں بہترین نمونہ ہے) [الأحزاب: 21]۔\n\n### [لغوی اعتبار سے قناعت سوال کرنا ہے اور قانع سائل ہے]\n\nاور ہمارے نزدیک قناعت (القناعة) لغت میں اپنے اصل معنی پر ہے، اور وہ ہے سوال کرنا (المسألة)، اور قانع (القَانِع) سائل (السائل) ہے۔ اور سوال صرف اللہ سے کیا جائے، کسی اور سے نہیں۔ کہا جاتا ہے: قَنَعَ يَقْنَعُ قُنُوعًا (قناعت کی، قناعت کرتا ہے، قناعت کرنا) جب اس نے سوال کیا، اور وہ وہی ہے جس نے اپنا سوال اللہ کی طرف اٹھایا۔ اور یہی قیامت کے دن ظالموں کے بارے میں اس کا قول ہے: مُقْنِعِي رُؤُسِهِمْ (اپنے سروں کو اوپر اٹھائے ہوئے) [إبراهيم: 43]، یعنی اللہ کی طرف اٹھائے ہوئے، وہ اپنے جرائم کی مغفرت طلب کر رہے ہوں گے۔ اور یہ دونوں حدیں ایک معاملے میں جمع ہو جاتی ہیں، اور وہ یہ ہے کہ اللہ سے سوال کرنے والے اپنے سوال اور التجا میں اسی پر قانع (قنعوا) ہوئے، پس انہوں نے اس کے سوا کسی اور سے سوال نہیں کیا۔ پس یہی اکابر کے اس قول کا مفہوم ہے کہ موجود پر اکتفا کرنا، اور وہ اللہ ہے، مزید طلب کرنے کے سوال کے ساتھ، اور وہ یہ ہے کہ سوال میں کسی اور کی طرف تجاوز نہ کیا جائے۔\n\n### [جس نے اللہ کے سوا کسی اور سے سوال کیا وہ قانع نہیں ہے]\n\nاور مخلوق اللہ کا کنبہ ہے، یعنی اللہ کی محتاج ہے۔ پس جس نے اللہ کے سوا کسی اور سے سوال کیا وہ قانع (قَانِع) نہیں ہے، اور اس پر محرومی اور خسارے کا خوف ہے۔ کیونکہ سائل اس پر بھروسہ کرنے والا ہوتا ہے جس سے وہ سوال کرتا ہے۔ اور اللہ فرماتا ہے: وَلا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وَما لَكُمْ مِنْ دُونِ الله مِنْ أَوْلِياءَ ثُمَّ لا تُنْصَرُونَ (اور تم ان لوگوں کی طرف مت جھکو جنہوں نے ظلم کیا، ورنہ تمہیں آگ چھو لے گی، اور اللہ کے سوا تمہارا کوئی مددگار نہیں ہوگا، پھر تمہاری مدد نہیں کی جائے گی) [هود: 113]۔ اور جس نے اپنی جنس پر بھروسہ کیا، تو اس نے ظالم پر بھروسہ کیا، کیونکہ اللہ انسان کے بارے میں فرماتا ہے: إِنَّهُ كانَ ظَلُوماً (بے شک وہ بڑا ظالم تھا) [الأحزاب: 72]، اس امانت کو اٹھانے کی وجہ سے۔ اور لوگوں میں سے کوئی ایسا نہیں جس نے اسے نہ اٹھایا ہو۔ پس اللہ کے سوا کسی پر بھروسہ نہ کرو، اور اپنے سوال میں اللہ پر اکتفا کرو، ان شاء اللہ تم کامیاب ہو جاؤ گے۔\n\n### [عارفین کے نقطہ نظر میں قناعت کے درجات اور اس کی نسبتیں]\n\nاور انس اور وصال (الأنس والوصال) کے اہل عارفین (العارفين) کے نزدیک قناعت (القناعة) کے چھ سو باون (652) درجات ہیں۔ اور ادب اور وقوف (الأدب والوقوف) کے اہل عارفین کے نزدیک اس کے دو سو ستاون (257) درجات ہیں۔ اور انس اور وصال کے اہل ملامتیہ (الملامية) کے نزدیک اس کے چھ سو اکیس (621) درجات ہیں۔ اور ادب اور وقوف کے اہل ملامتیہ کے نزدیک اس کے دو سو چھبیس (226) درجات ہیں۔ اور قناعت کا ایک دعویٰ ہے اور اس کی دو نسبتیں ہیں: ایک نسبت عالم جبروت (عالم الجبروت) کی طرف، اور ایک نسبت عالم ملکوت (عالم الملكوت) کی طرف۔ اور عالم ملک (عالم الملك) کی طرف اس کی کوئی ظاہری نسبت نہیں ہے، بلکہ عالم ملک کی طرف اس کی ایک باطنی نسبت ہے جو اس قنوع (القنوع) کو ظاہر کرتی ہے۔ اور یہ مقدار اس کے لیے کافی ہے، اور اللہ ہی توفیق دینے والا ہے۔",
    "fa": "(باب صد و شانزدهم در معرفت قناعت و اسرار آن)\n\nقناعت دری است که تو وارد آن می‌شوی *** اگر تو آن کسی باشی که برای خدمتش امید می‌رود.\n\nپس به نعمت‌هایی که روزگار از طبیعت (دنیا) به تو داده قناعت کن *** اما به نعمت او (حق) قناعت مکن.\n\nاگر مال همه خلق نزد تو باشد *** شخص از آن جز لقمه خود نمی‌خورد.\n\n### [قناعت با طلب خیر بیشتر از خداوند منافاتی ندارد]\n\nقناعت نزد ما به معنای اکتفا کردن به موجود (آنچه هست) بدون طلب بیشتر نیست. خداوند متعال بر ایوب، که پیامبری گرامی بود و درباره‌اش گفته شد: «نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ» (چه بنده خوبی، او بسیار بازگشت‌کننده [به سوی خدا] است)، فرستاد و او را به صبر ستود، با وجود اینکه پروردگارش را برای برطرف کردن بلا از خود می‌خواند و خداوند آن را برطرف کرد.\n\nپس هنگامی که خداوند بر او بارانی از ملخ‌های طلا فرستاد، ایوب شروع به جمع کردن آن‌ها در جامه‌اش کرد. پروردگارش به او فرمود: آیا تو را از این بی‌نیاز نکرده بودم؟ ایوب گفت: پروردگارا، من از خیر تو بی‌نیاز نیستم.\n\nاگر او این کار را به خاطر ظاهر حال خود انجام داد، همان چیزی است که ما قصد داشتیم؛ و اگر برای آن بود که دیگران به او اقتدا کنند، پس کاری جز آنچه برای تقرب به خداوند اولی‌تر از ترک آن است، انجام نداد. او از «الَّذِينَ هَدَى الله» (کسانی است که خداوند هدایتشان کرده) و خداوند پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) را به اقتدا به هدایت آنان امر فرمود و به ما گفت: «لَقَدْ كانَ لَكُمْ في رَسُولِ الله أُسْوَةٌ حَسَنَةٌ» (قطعاً برای شما در رسول خدا سرمشقی نیکو است).\n\n### [قناعت در لغت همان مسألت است و قانع همان سائل است]\n\nو قناعت نزد ما بر اساس معنای لغوی خود است و آن «مسألت» (درخواست) است و قانع (القَانِع) همان سائل (درخواست‌کننده) است، و سؤال باید از حق (الحق) باشد نه از غیر او. گفته می‌شود: «قَنَعَ يَقْنَعُ قُنُوعاً» یعنی سؤال کرد، و او کسی است که سؤال خود را به سوی خدا بالا برده است. و این همان قول خداوند درباره ظالمان در روز قیامت است: «مُقْنِعِي رُؤُسِهِمْ» (سرها را بالا برده)، یعنی سرها را به سوی خدا بالا برده و از او طلب مغفرت برای گناهانشان می‌کنند. و این دو حد (معنای لغوی و عرفانی) در یک امر جمع می‌شوند، و آن این است که کسانی که از خدا سؤال می‌کنند، در سؤال و پناه بردنشان به او، به او قناعت کرده‌اند و از غیر او تعالی سؤال نکرده‌اند. پس این معنای سخن اکابر است که می‌گویند: «اکتفا به موجود (الوجود)» که همان حق (الحق) است، با سؤال کردن از او برای طلب بیشتر (المزید)، و این طلب بیشتر آن است که سؤال به غیر او تعالی تجاوز نکند.\n\n### [هر کس از غیر خدا سؤال کند، قانع نیست]\n\nو خلق عیال خدا هستند، یعنی فقیران به سوی حق (الحق). پس هر کس از غیر خدا سؤال کند، قانع نیست و بر او از محرومیت و خسران بیم می‌رود. زیرا سائل به تکیه کردن بر کسی که از او سؤال کرده است، وصف می‌شود، و خداوند می‌فرماید: «وَلا تَرْكَنُوا إِلَى الَّذِينَ ظَلَمُوا فَتَمَسَّكُمُ النَّارُ وَما لَكُمْ مِنْ دُونِ اللَّهِ مِنْ أَوْلِياءَ ثُمَّ لا تُنْصَرُونَ» (و بر کسانی که ستم کرده‌اند تکیه نکنید، که آتش شما را فرا می‌گیرد، و جز خدا هیچ سرپرستی ندارید، سپس یاری نمی‌شوید). و هر کس بر هم‌نوع خود تکیه کند، بر ظالم تکیه کرده است، زیرا خداوند درباره انسان می‌فرماید: «إِنَّهُ كانَ ظَلُوماً» (او بسیار ستمکار بود) به دلیل حمل امانت (الأمانة)، و هیچ کس از مردم نیست مگر اینکه آن را حمل کرده است. پس بر غیر خدا تکیه مکن و در سؤال خود به خدا اکتفا کن تا سعادتمند شوی، ان شاء الله.\n\n### [درجات قناعت و نسبت‌های آن از منظر عارفان]\n\nو قناعت نزد عارفان (العارفين) از اهل اُنس و وصال (الوصال) درجاتی دارد که ششصد و پنجاه و دو درجه است. و درجات آن نزد عارفان از اهل ادب و وقوف (الوقوف) دویست و پنجاه و هفت درجه است. و درجات آن نزد ملامیه (الملامية) از اهل اُنس و وصال ششصد و بیست و یک درجه است. و درجات آن نزد ملامتیه (الملامتية) از اهل ادب و وقوف دویست و بیست و شش درجه است. و قناعت دارای ادعا (الدعوی) است و برای آن دو نسبت وجود دارد: نسبتی به عالم جبروت (الجبروت) و نسبتی به عالم ملکوت (الملکوت). و به عالم مُلک (الملک) نسبت ظاهری ندارد، بلکه نسبتی باطنی به عالم مُلک دارد که آن قناعت را آشکار می‌سازد. و این مقدار در آن کافی است و خداوند توفیق‌دهنده است."
  },
  "page_count": 1
}