{
  "id": 62,
  "title": {
    "ar": "الباب الثاني والستون في مراتب أهل النار",
    "en": "Chapter Sixty-Two: Concerning the Levels of the People of the Fire",
    "ur": "باسٹھواں باب: اہل نار کے مراتب کے بیان میں",
    "fa": "باب شصت و دوم در مراتب اهل آتش (نار)"
  },
  "content": {
    "ar": "## (الباب الثاني والستون في مراتب أهل النار)\n\n\n> مراتب النار بالأعمال تمتاز *** وليس فيها اختصاصات وإنجاز\n\n\n> بوزن أفعال قد جاء العذاب له *** بشرى وإن عذبوا فيها بما حازوا\n\n\n> لا يخرجون من النار ولو خرجوا *** تعذبوا فلهم ذل وإعزاز\n\n\n> فذلهم كونهم في النار ما برحوا *** وعزهم ما لهم حد إذا جازوا\n\n\n> في قولنا إن تأملتم لذي نظر *** محقق في علوم الوهب إعجاز\n\n\n> فيه اختصار بديع لفظه حسن *** فيه لطائف آيات وإيجاز\n\n\n> قال الجليل لأهل الحق بينهمو *** يا أيها المجرمون اليوم فامتازوا\n\n\n> مثل الملوك تراهم في نعيمهم *** ولبسهم عند أهل الكشف أخزاز\n\n\n> ومن جسومهم في النار تحسبهم *** كأنهم مثل ما قد قال إعجاز\n\n\n### [أوزان جمع القلة في لغة العرب‏]\n\n\nقولنا بوزن أفعال أريد قوله تعالى لابِثِينَ فِيها أَحْقاباً وهو من أوزان جمع القلة فإن أوزان جمع القلة أربعة افعل مثل أكلب وأفعال مثل أحقاب وفعلة مثل فتية وأفعلة مثل أحمرة وجمع ذلك بعض الأدباء في بيت من الشعر فقال‏\n\n\n> بأفعل وبأفعال وأفعلة *** وفعلة يجمع الأدنى من العدد\n\n\n### [المخذولون من العباد]\n\n\nيقول الله تعالى من كرمه لإبليس وعموم رحمته حين قال له أَ رَأَيْتَكَ هذَا الَّذِي كَرَّمْتَ عَلَيَّ ... لَأَحْتَنِكَنَّ ذُرِّيَّتَهُ إِلَّا قَلِيلًا قالَ اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزاؤُكُمْ جَزاءً مَوْفُوراً واسْتَفْزِزْ من اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ ورَجِلِكَ وشارِكْهُمْ في الْأَمْوالِ والْأَوْلادِ وعِدْهُمْ فما جاء إبليس إلا بأمر الله تعالى فهو أمر إلهي يتضمن وعيدا وتهديدا وكان ابتلاء شديدا في حقنا ليريه تعالى أن في ذريته من ليس لإبليس عليه سلطان ولا قوة ثم إن الذي خذلهم الله من العباد جعلهم طائفتين طائفة لا تضرهم الذنوب التي وقعت منهم وهو قوله والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ وفَضْلًا فلا تمسهم النار بما تاب الله عليهم واستغفار الملإ الأعلى لهم ودعائه لهذه الطائفة وطائفة أخرى أخذهم الله بذنوبهم والذين أخذهم الله بذنوبهم قسمهم بقسمين قسم أخرجهم الله من النار بشفاعة الشافعين وهم أهل الكبائر من المؤمنين وبالعناية الإلهية وهم أهل التوحيد بالنظر العقلي وقسم آخر أبقاهم الله في النار\n\n\n### [المجرمون: طوائفهم وأصنافهم‏]\n\n\nوهذا القسم هم أهل النار الذين هم أهلها وهم المجرمون خاصة الذين يقول الله فيهم وامْتازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ أي المستحقون بأن يكونوا أهلا لسكنى هذه الدار التي هي جهنم يعمرونها ممن يخرج منها إلى الدار الآخرة التي هي الجنة وهؤلاء المجرمون أربع طوائف كلها في النار لا يُخْرَجُونَ مِنْها وهم المتكبرون على الله كفرعون وأمثاله ممن ادعى الربوبية لنفسه ونفاها عن الله فقال يا أَيُّهَا الْمَلَأُ ما عَلِمْتُ لَكُمْ من إِلهٍ غَيْرِي وقال أَنَا رَبُّكُمُ الْأَعْلى‏ يريد أنه ما في السماء إله غيري وكذلك نمرود وغيره والطائفة الثانية المشركون وهم الَّذِينَ يَجْعَلُونَ مَعَ الله إِلهاً آخَرَ\nفقالوا ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ وقالوا أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ والطائفة الثالثة المعطلة وهم الذين نفوا الإله جملة واحدة فلم يثبتوا إلها للعالم ولا من العالم والطائفة الرابعة المنافقون وهم الذين أظهروا الإسلام من إحدى هؤلاء الطوائف الثلاثة للقهر الذي حكم عليهم فخافوا على دمائهم وأموالهم وذراريهم وهم في نفوسهم على ما هم عليه من اعتقاد هؤلاء الطوائف الثلاث‏\n\n\n### [منافذ إبليس إلى المجرمين‏]\n\n\nفهؤلاء أربعة أصناف هم الذين هم أهل النار لا يخرجون منها من جن وإنس وإنما كانوا أربعة لأن الله تعالى ذكر عن إبليس أنه يأتينا من بين أيدينا ومن خلفنا وعن أيماننا وعن شمائلنا فيأتي للمشرك من بين يديه ويأتي للمعطل من خلفه ويأتي إلى المتكبر من عن يمينه ويأتي إلى المنافق من عن شماله وهو الجانب الأضعف فإنه أضعف الطوائف كما إن الشمال أضعف من اليمين وجعل المتكبر من اليمين لأنه محل القوة فتكبر لقوته التي أحسها من نفسه وجاء للمشرك من بين يديه فإنه رأى إذ كان بين يديه جهة عينية فأثبت وجود الله ولم يقدر على إنكاره فجعله إبليس يشرك مع الله في ألوهيته وجاء للمعطل من خلفه فإن الخلف ما هو محل النظر فقال له ما ثم شي‏ء أي ما في الوجود إله‏\n\n\n### [منازل النار لأهل النار]\n\n\nثم قال الله تعالى في جهنم لَها سَبْعَةُ أَبْوابٍ لِكُلِّ بابٍ مِنْهُمْ جُزْءٌ مَقْسُومٌ فهذه أربع مراتب لهم من كل باب من أبواب جهنم جزء مقسوم وهي منازل عذابهم فإذا ضربت الأربعة التي هي المراتب التي دخل عليهم منها إبليس في السبعة الأبواب كان الخارج ثمانية وعشرين منزلا وكذلك جعل الله المنازل التي قدرها الله للإنسان المفرد وهو القمر وغيره من السيارة الخنس الكنس تسير فيها وتنزلها لإيجاد الكائنات فيكون عند هذا السير ما يتكون من الأفعال في العالم العنصري فإن هذه السيارة قد انحصرت في أربع طبائع مضروبة في ذواتها وهن سبعة فخرج منها منازلها الثمانية والعشرون ذلك بتقدير العزيز العليم كما قال كُلٌّ في فَلَكٍ يَسْبَحُونَ وكان مما ظهر عن هذا التسيير الإلهي في هذه الثمانية والعشرين وجود ثمانية وعشرين حرفا ألف الله الكلمات منها وظهر الكفر في العالم والايمان بأن تكلم كل شخص بما في نفسه من إيمان وكفر وكذب وصدق لتقوم الحجة لله على عباده ظاهرا بما تلفظوا به ووكل بهم ملائكة يكتبون ما تلفظوا به قال تعالى كِراماً كاتِبِينَ وقال ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ فجعل منازل النار ثمانية وعشرين منزلا وجهنم كلها مائة درك من أعلاها إلى أسفلها نظائر درج الجنة التي ينزل فيها السعداء وفي كل درك من هذه الدركات ثمانية وعشرون منزلا فإذا ضربت ثمانية وعشرين في مائة كان الخارج من ذلك ألفين وثمانمائة منزل فهي الثمانية والعشرون مائة فما برحت الثمانية والعشرون تصحبنا وهذه منازل النار\n\n\n### [ما به الاشتراك والامتياز بين أهل الجنة وأهل النار]\n\n\nفلكل طائفة من الأربع سبعمائة نوع من العذاب وهم أربع طوائف فالمجموع ثمان وعشرون مائة نوع من العذاب كما لأهل الجنة سواء من الثواب يبين ذلك في صدقاتهم كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنابِلَ في كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ فالمجموع سبعمائة وهم أربعة طوائف رسل وأنبياء وأولياء ومؤمنون فلكل متصدق من هؤلاء الأربعة سبعمائة ضعف من النعيم في عملهم فانظر ما أعجب القرآن في بيانه الشافي وموازنته في خلقه في الدارين الجنة والنار لإقامة العدل على السواء في باب جزاء النعيم وجزاء العذاب فبهذا القدر يقع الاشتراك بين أهل الجنة وأهل النار للتساوي في عدد الدرج والدرك ويقع الامتياز بأمر آخر وذلك أن النار امتازت عن الجنة بأنه ليس في النار دركات اختصاص إلهي ولا عذاب اختصاص إلهي من الله فإن الله ما عرفنا قط إنه اختص بنقمته من يشاء كما أخبرنا أنه يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ وبفضله فالجنة في نعيمها مخالف لميزان عذاب أهل النار فأهل النار معذبون بأعمالهم لا غير وأهل الجنة ينعمون بأعمالهم وبغير أعمالهم في جنات الاختصاص‏\n\n\n### [جنات أهل السعادة]\n\n\nفلأهل السعادة ثلاث جنات جنة أعمال وجنة اختصاص وجنة ميراث وذلك أنه ما من شخص من الجن والإنس إلا وله في الجنة موضع وفي النار موضع وذلك لإمكانه الأصلي فإنه قبل كونه يمكن أن يكون له البقاء في العدم أو يوجد فمن هذه الحقيقة له قبول النعيم وقبول العذاب فالجنة تطلب الجميع والجميع يطلبها والنار تطلب الجميع والجميع يطلبها فإن الله يقول ولَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ أي أنتم قابلون لذلك ولكن حقت الكلمة وسبق العلم ونفذت المشيئة فلا راد لأمره ولا مُعَقِّبَ لِحُكْمِهِ فينزل أهل الجنة في الجنة على أعمالهم ولهم جنات الميراث وهي التي كانت لأهل النار لو دخلوا الجنة ولهم جنات الاختصاص‏\nيقول الله تعالى تِلْكَ الْجَنَّةُ الَّتِي نُورِثُ من عِبادِنا من كانَ تَقِيًّا فهذه الجنة التي حصلت لهم بطريق الورث من أهل النار الذين هم أهلها إذ لم يكن في علم الله أن يدخلوها ولم يقل في أهل النار إنهم يرثون من النار أماكن أهل الجنة لو دخلوا النار وهذا من سبق الرحمة بعموم فضله سبحانه فما نزل من نزل في النار من أهلها إلا بأعمالهم ولهذا يبقى فيها أماكن خالية وهي الأماكن التي لو دخلها أهل الجنة عمروها فيخلق الله خلقا يعمرونها على مزاج لو دخلوا به الجنة تعذبوا وهوقوله صلى الله عليه وسلم فيضع الجبار فيها قدمه فتقول قط قط\n\n\nأي حسبي حسبي فإنه تعالى يقول لها هَلِ امْتَلَأْتِ فتقول هَلْ من مَزِيدٍ فإنه قال للجنة والنار لكل واحدة منكما ملؤها فما اشترط لهما إلا أن يملأهما خلقا وما اشترط عذاب من يملأها بهم ولا نعيمهم وإن الجنة أوسع من النار بلا شك فإن عَرْضُهَا السَّماواتُ والْأَرْضُ فما ظنك بطولها فهي للنار كمحيط الدائرة مما يحوي عليه وفي التنزلات الموصلية رسمناها وبيناها على ما هي عليه في نفسها في باب يوم الإثنين والنار عرضها قدر الخط الذي يميز قطري دائرة فلك الكواكب الثابتة فأين هذا الضيق من تلك السعة وسبب هذا الاتساع جنات الاختصاص الإلهي‏\n\n\nفورد في الخبر أنه يبقى أيضا في الجنة أماكن ما فيها أحد فيخلق الله خلقا للنعيم يعمرها بهم‏\n\n\nوهو أن يضع الرحمن فيها قدمه وليس ذلك إلا في جنات الاختصاص فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ فمن كرمه أنه تعالى ما أنزل أهل النار إلا على أعمالهم خاصة\n\n\n### [الأئمة المضلون‏]\n\n\nوأما قوله تعالى زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ فذلك لطائفة مخصوصة وهم الأئمة المضلون يقول تعالى ولَيَحْمِلُنَّ أَثْقالَهُمْ وأَثْقالًا مَعَ أَثْقالِهِمْ وهم الذين أضلوا العباد وأدخلوا عليهم الشبه المضلة فحادوا بها عن سواء السبيل فضلوا وأضلوا وقالوا لهم اتَّبِعُوا سَبِيلَنا ولْنَحْمِلْ خَطاياكُمْ يقول الله وما هُمْ بِحامِلِينَ من خَطاياهُمْ من شَيْ‏ءٍ إِنَّهُمْ لَكاذِبُونَ في هذا القول بل هم حاملون خطاياهم والذين أضلوهم يحملون أيضا خطاياهم وخطايا هؤلاء مع خطاياهم ولا ينقص هؤلاء من خطاياهم من شي‏ء\n\n\nيقول صلى الله عليه وسلم من سن سنة سيئة فله وزرها ووزر من عمل بها دون أن ينقص ذلك من أوزارهم شيئا\n\n\nفهو قوله ثُمَّ ازْدادُوا كُفْراً فهؤلاء قيل فيهم زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ فما أنزلوا من النار إلا منازل استحقاق بخلاف الجنة فإن أهل الجنة أنزلوا فيها منازل استحقاق مثل الكفار في النار بأعمالهم وأنزلوا أيضا منازل وراثة ومنازل اختصاص وليس ذلك في أهل النار\n\n\n### [فضل الله ورحمته على أهل النار في نفس النار]\n\n\nولا بد لأهل النار من فضل الله ورحمته في نفس النار بعد انقضاء مدة موازنة أزمان العمل فيفقدون الإحساس بالآلام في نفس النار لأنهم ليسوا بخارجين من النار أبدا فلا يموتون فيها ولا يحيون فتتخدر جوارحهم بإزالة الروح الحساس منها وثم طائفة يعطيهم الله بعد انقضاء موازنة المدد بين العذاب والعمل نعيما خياليا مثل ما يراه النائم وجلده كما قال تعالى كُلَّما نَضِجَتْ جُلُودُهُمْ هو كما قلنا خدرها فزمان النضج والتبديل يفقدون الآلام لأنه‏\n\n\nإذا انقضى زمان الإنضاج خمدت النار في حقهم فيكونون في النار كالأمة التي دخلتها وليست من أهلها فأماتهم الله فيها إماتة فلا يحسون بما تفعله النار في أبدانهم الحديث بكماله ذكره مسلم في صحيحه‏\n\n\nوهذا من فضل الله ورحمته‏\n\n\n### [أبواب جهنم‏]\n\n\nوأما أبواب جهنم فقد ذكر الله من صفات أصحابها بعض ما ذكر ولكن من هؤلاء الأربع الطوائف الذين هم أهلها ومن خرج بالشفاعة أو العناية ممن دخلها فقد جاء ببعض ما وصف الله به من دخلها من الأسباب الموجبة لذلك وهي باب الجحيم وباب سقر وباب السعير وباب الحطمة وباب لظى وباب الحامية وباب الهاوية وسميت الأبواب بصفات ما وراءها مما أعدت له ووصف الداخلون فيها بما ذكر الله تعالى في مثل قوله في لظى إنها تَدْعُوا من أَدْبَرَ وتَوَلَّى وجَمَعَ فَأَوْعى‏ وقال ما يقول أهل سقر إذا قيل لهم ما سَلَكَكُمْ في سَقَرَ قالُوا لَمْ نَكُ من الْمُصَلِّينَ ولَمْ نَكُ نُطْعِمُ الْمِسْكِينَ وكُنَّا نَخُوضُ مَعَ الْخائِضِينَ وكُنَّا نُكَذِّبُ بِيَوْمِ الدِّينِ وقال في أهل الجحيم إنه يكذب بِيَوْمِ الدِّينِ وما يُكَذِّبُ به إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ فوصفه بالإثم والاعتداء ثم قال فيهم ثُمَّ إِنَّهُمْ لَصالُوا الْجَحِيمِ ثُمَّ يُقالُ هذَا الَّذِي كُنْتُمْ به تُكَذِّبُونَ وهكذا في الحطمة والسعير وغير ذلك مما جاء به القرآن أو السنة\n\n\n### [المناسبات بين أعمال أهل النار وبين منازلهم في النار]\n\n\nفهذا قد ذكرنا الأمهات والطبقات وأما مناسبات الأعمال لهذه المنازل فكثيرة جدا يطول الشرح فيها ولو شرعنا في ذلك طال علينا المدى فإن المجال رحب ولكن الأعمال مذكورة ولعذاب عليها مذكور فمتى وقفت على شي‏ء من ذلك وكنت على نور من ربك وبينة فإن الله يطلعك عليه بكرمه والذي شرطنا في هذا\nالباب وترجمنا عليه إنما كان ذكر المراتب وقد ذكرناها وبيناها ونبهنا على مواضع يجول فيها نظر الناظر من كتابي هذا من الآيات التي استشهدنا بها في هذا الباب من أوله من أمر الله إبليس بما ذكر له فهل له من امتثال ذلك الأمر الإلهي أمر يعود عليه منه من حيث ما هو ممتثل أم لا وأشباه هذه التنبيهات إن وفقت لذلك عثرت على علوم جمة إلهية مما يختص بأهل الشقاء والنار وهذا القدر في هذا الباب كاف والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Sixty-Two: Concerning the Levels of the People of the Fire\n\nThe levels of the Fire are distinguished by deeds,\nAnd there are no special dispensations or fulfillments therein.\n\nThe torment comes to them according to the measure of their deeds,\nA glad tiding, even though they are tormented therein for what they acquired.\n\nThey do not exit the Fire, and even if they were to exit, they would be tormented,\nThus, they possess both humiliation and exaltation.\n\nTheir humiliation is their perpetual presence in the Fire,\nAnd their exaltation is that they have no limit when they pass beyond.\n\nIn our saying, if you reflect upon it, for one who truly sees,\nA verifier in the sciences of Divine bestowal (علوم الوهب), there is a miracle.\n\nIt contains wondrous conciseness, its wording is beautiful,\nIt holds subtle meanings of verses and brevity.\n\nThe Majestic One (الجليل) said to the people of the Truth (أهل الحق) among them:\n<<يَا أَيُّهَا الْمُجْرِمُونَ الْيَوْمَ فَامْتَازُوا>> (O you criminals, stand apart this Day!)\n\nYou see them like kings in their bliss,\nYet their clothing, to the people of Unveiling (أهل الكشف), is coarse sackcloth.\n\nAnd from their bodies in the Fire, you would reckon them\nAs if they were a miracle, just as He said.\n\n### [The Measures of the Paucity Plural in the Arabic Language]\n\nBy our saying, \"according to the measure of *af'āl* (أفعال),\" I mean His exalted saying: <<لَابِثِينَ فِيهَا أَحْقَابًا>> (Remaining therein for ages [ahqābā]). This is one of the measures of the paucity plural (جمع القلة). The measures of the paucity plural are four: *af'ul* (أفعل), such as *aklub* (dogs); *af'āl* (أفعال), such as *ahqāb* (ages); *fi'lah* (فعلة), such as *fityah* (youths); and *af'ilah* (أفعلة), such as *ahmirah* (donkeys). Some literary scholars summarized this in a line of poetry, saying:\n\nBy *af'ul*, *af'āl*, and *af'ilah*,\nAnd *fi'lah*, the lesser number is gathered.\n\n### [The Forsaken among the Servants]\n\nAllah the Exalted says, out of His generosity (كرمه) to Iblis and the universality of His Mercy (عموم رحمته), when He said to him: <<أَرَأَيْتَكَ هَذَا الَّذِي كَرَّمْتَ عَلَيَّ ... لَأَحْتَنِكَنَّ ذُرِّيَّتَهُ إِلَّا قَلِيلًا>> (Do you see this one whom You have honored above me? ... I will surely seize control of his descendants, all but a few.) He said: <<اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزَاؤُكُمْ جَزَاءً مَوْفُورًا>> (Go, and whoever follows you among them—indeed, Hell will be the recompense for you, an ample recompense.) And: <<وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِي الْأَمْوَالِ وَالْأَوْلَادِ وَعِدْهُمْ>> (And incite whom you can among them with your voice and assault them with your cavalry and infantry and share with them in [their] wealth and [their] children and promise them.)\n\nIblis only came by the command of Allah the Exalted. Thus, it is a Divine command (أمر إلهي) that includes a threat and a warning. It was a severe trial (ابتلاء شديدا) for us, so that the Exalted might show him that among his descendants are those over whom Iblis has no authority or power.\n\nThen, those servants whom Allah has forsaken (المخذولون) He made into two groups: a group whose sins do not harm them, which is His saying: <<وَاللَّهُ يَعِدُكُمْ مَغْفِرَةً مِنْهُ وَفَضْلًا>> (And Allah promises you forgiveness from Him and bounty.) The Fire will not touch them because Allah accepted their repentance and due to the intercession and supplication of the Highest Assembly (الملإ الأعلى) for this group. The other group are those whom Allah seized for their sins.\n\nThose whom Allah seized for their sins He divided into two sub-groups: one group whom Allah extracts from the Fire through the intercession of the intercessors (الشفاعة)—these are the perpetrators of major sins (أهل الكبائر) among the believers, and those who hold to the Oneness of God (أهل التوحيد) based on rational consideration (النظر العقلي), by virtue of Divine care (العناية الإلهية). The other sub-group are those whom Allah leaves permanently in the Fire.\n\n### [The Criminals: Their Groups and Types]\n\nThis latter sub-group are the people of the Fire who are truly its inhabitants. They are specifically the criminals (المجرمون) about whom Allah says: <<وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ>> (And stand apart this Day, O you criminals!) Meaning, those who deserve to be the inhabitants of this abode, which is Hell (جهنم). They populate it, unlike those who exit it for the other abode, which is Paradise (الجنة).\n\nThese criminals are four groups, all of whom are in the Fire and will not be extracted from it:\n\n1.  **The Arrogant (المتكبرون):** Those arrogant toward Allah, like Pharaoh and his likes, who claimed Lordship (الربوبية) for themselves and denied it to Allah. Pharaoh said: <<يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي>> (O eminent ones, I do not know of any god for you other than me) and he said: <<أَنَا رَبُّكُمُ الْأَعْلَى>> (I am your Lord, the Most High)—meaning, there is no god in heaven other than me. This includes Nimrod and others.\n2.  **The Polytheists (المشركون):** Those who associate partners with Allah, <<الَّذِينَ يَجْعَلُونَ مَعَ اللَّهِ إِلَهًا آخَرَ>> (who set up with Allah another god). They said: <<مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى>> (We only worship them that they may bring us nearer to Allah in station). And they said: <<أَجَعَلَ الْآلِهَةَ إِلَهًا وَاحِدًا إِنَّ هَذَا لَشَيْءٌ عُجَابٌ>> (Has he made the gods [into] one God? Indeed, this is a curious thing.)\n3.  **The Deniers/Atheists (المعطلة):** Those who negated the Divine entirely, establishing no God for the cosmos (العالم) nor from the cosmos.\n4.  **The Hypocrites (المنافقون):** Those who outwardly displayed Islam due to the subjugation imposed upon them, fearing for their lives, wealth, and children. Yet, inwardly, they held the beliefs of one of the preceding three groups.\n\n### [Iblis's Inroads to the Criminals]\n\nThese four types are the true inhabitants of the Fire, whether Jinn or humans, and they will not exit it. They are four because Allah the Exalted mentioned that Iblis comes to us from before us, from behind us, from our right, and from our left.\n\nHe comes to the Polytheist from before him, because the Polytheist saw the manifest direction before him, thus affirming Allah's Existence (الوجود) and being unable to deny it. Iblis then caused him to associate partners with Allah in His Divinity (ألوهيته).\n\nHe comes to the Denier from behind him, because the rear is not a place of observation. So Iblis told him, \"There is nothing there,\" meaning, there is no God in Existence.\n\nHe comes to the Arrogant from his right, because the right side is the place of strength. He became arrogant due to the strength he perceived in himself.\n\nHe comes to the Hypocrite from his left, which is the weaker side, for the Hypocrite is the weakest of the groups, just as the left is weaker than the right.\n\n### [The Stations of the Fire for the People of the Fire]\n\nThen Allah the Exalted said concerning Hell (جهنم): <<لَهَا سَبْعَةُ أَبْوَابٍ لِكُلِّ بَابٍ مِنْهُمْ جُزْءٌ مَقْسُومٌ>> (It has seven gates; for every gate is an assigned portion of them.)\n\nThese are four levels (مراتب) for them, with an assigned portion from each of the gates of Hell. These are the stations (منازل) of their torment. If you multiply the four (which are the levels through which Iblis entered upon them) by the seven gates, the result is twenty-eight stations.\n\nSimilarly, Allah established the stations that He decreed for the individual human (الإنسان المفرد)—namely, the Moon and the other five wandering, sweeping planets (السيارة الخنس الكنس)—which travel through and descend into these stations for the creation of beings (إيجاد الكائنات). During this celestial journey, the acts (الأفعال) that come into being in the elemental world (العالم العنصري) occur. These planets are confined within four natures (طبائع) multiplied by their essences (ذواتها), which are seven, resulting in their twenty-eight stations. That is by the decree of the Almighty, the All-Knowing, as He said: <<كُلٌّ فِي فَلَكٍ يَسْبَحُونَ>> (All [celestial bodies] swim along, each in its orbit.)\n\nAmong what manifested from this Divine movement (التسيير الإلهي) in these twenty-eight is the existence of twenty-eight letters (حرفا) from which Allah composed the words (الكلمات). And disbelief (الكفر) and faith (الإيمان) appeared in the world through every person speaking what is in their soul—whether faith, disbelief, lies, or truth—so that the argument (الحجة) of Allah might be established against His servants outwardly by what they utter. He appointed angels over them who write down what they utter. The Exalted said: <<كِرَامًا كَاتِبِينَ>> (Noble recorders), and He said: <<مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ>> (Not a word does he utter but there is a watcher by him ready [to record].)\n\nThus, He made the stations of the Fire twenty-eight stations. And Hell entirely consists of one hundred depths (درك) from its highest to its lowest point, corresponding to the degrees (درج) of Paradise where the felicitous (السعداء) descend. In every one of these depths there are twenty-eight stations. If you multiply twenty-eight by one hundred, the result is two thousand eight hundred stations. These are the twenty-eight hundreds. The number twenty-eight has not ceased to accompany us. These are the stations of the Fire.\n\n### [What is Shared and What Distinguishes the People of Paradise and the People of the Fire]\n\nFor each of the four groups, there are seven hundred types of torment. Since they are four groups, the total is twenty-eight hundred types of torment. This is exactly the same as the reward (الثواب) for the people of Paradise, as explained regarding their charities (صدقاتهم): <<كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ>> (Like a grain which grows seven spikes, in every spike a hundred grains.) The total is seven hundred. And they (the felicitous) are four groups: Messengers, Prophets, Saints (أولياء), and Believers. For every charitable person among these four, there are seven hundredfold of bliss (النعيم) in their deed.\n\nLook at how wondrous the Quran is in its healing explanation and its balancing (موازنته) in His creation in the two abodes, Paradise and the Fire, establishing justice (العدل) equally in the matter of the recompense of bliss and the recompense of torment.\n\nTo this extent, there is a sharing (الاشتراك) between the people of Paradise and the people of the Fire, due to the equality in the number of degrees and depths.\n\nThe distinction (الامتياز) occurs in another matter: the Fire is distinguished from Paradise because there are no depths of Divine specialization (اختصاص إلهي) in the Fire, nor is there torment of Divine specialization from Allah. For Allah has never informed us that He specializes whom He wills with His vengeance, just as He informed us that <<يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ>> (He selects for His Mercy whom He wills) and with His bounty (فضله). Thus, Paradise in its bliss is contrary to the measure of the torment of the people of the Fire. The people of the Fire are tormented solely by their deeds, while the people of Paradise are blessed by their deeds and by what is *not* their deeds, in the Gardens of Specialization.\n\n### [The Gardens of the People of Felicity]\n\nThe people of felicity (أهل السعادة) have three Gardens: the Garden of Deeds (جنة أعمال), the Garden of Specialization (جنة اختصاص), and the Garden of Inheritance (جنة ميراث).\n\nThis is because there is no person, whether Jinn or human, who does not have a place in Paradise and a place in the Fire. This is due to their original possibility (إمكانه الأصلي), for before their existence, it was possible for them to remain in non-existence (العدم) or to be brought into existence. From this Reality (الحقيقة), they possess the capacity to accept bliss and the capacity to accept torment. Paradise seeks everyone, and everyone seeks it. The Fire seeks everyone, and everyone seeks it. For Allah says: <<وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ>> (And if He had willed, He would have guided you all)—meaning, you are capable of that, but the Word (الكلمة) was decreed, the Knowledge (العلم) preceded, and the Will (المشيئة) was executed. There is none to repel His command, nor any to overturn His judgment.\n\nSo the people of Paradise descend into Paradise based on their deeds. They also have the Gardens of Inheritance, which were the places of the people of the Fire had they entered Paradise. And they have the Gardens of Specialization.\n\nAllah the Exalted says: <<تِلْكَ الْجَنَّةُ الَّتِي نُورِثُ مِنْ عِبَادِنَا مَنْ كَانَ تَقِيًّا>> (That is the Garden which We cause to be inherited by those of Our servants who are righteous.) This is the Garden they obtained by way of inheritance from the people of the Fire who are its true inhabitants, since it was not in Allah's Knowledge that they would enter it. He did not say concerning the people of the Fire that they inherit places in the Fire from the people of Paradise had they entered the Fire. This is due to the precedence of Mercy (سبق الرحمة) through His universal bounty (فضله), glory be to Him.\n\nTherefore, those who descend into the Fire among its inhabitants do so only by their deeds. This is why empty places remain therein—the places that the people of Paradise would have populated had they entered it. So Allah creates a creation to populate these places, a creation whose disposition (مزاج) is such that if they entered Paradise, they would be tormented. This is His saying (peace and blessings be upon him): \"The Compeller (الجبار) places His Foot therein, and it says, 'Enough, enough (قط قط).'\" Meaning, \"Sufficient for me, sufficient for me.\" For the Exalted says to it: <<هَلِ امْتَلَأْتِ>> (Have you been filled?), and it replies: <<هَلْ مِنْ مَزِيدٍ>> (Are there any more?).\n\nHe said to Paradise and the Fire, \"Each of you has its fill.\" He only stipulated that they be filled with creation, but He did not stipulate the torment or the bliss of those with whom they are filled.\n\nAnd Paradise is undoubtedly wider than the Fire, for <<عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ>> (its width is the heavens and the earth). What then do you think of its length? Relative to the Fire, it is like the circumference of a circle encompassing what it contains. In the *Tanazzulāt al-Mawsiliyya* (The Mosul Descendings), we drew and explained it as it is in itself, in the chapter on Monday. The width of the Fire is equivalent to the line that distinguishes the two diameters of the sphere of the fixed stars. Where is this narrowness compared to that vastness? The reason for this vastness is the Gardens of Divine Specialization.\n\nIt is mentioned in the tradition (الخبر) that places will also remain empty in Paradise, and Allah will create a creation specifically for bliss to populate them. This is when the All-Merciful (الرحمن) places His Foot therein, and this occurs only in the Gardens of Specialization. <<فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ>> (So judgment belongs to Allah, the Most High, the Grand). <<يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ>> (He selects for His Mercy whom He wills). <<وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ>> (And Allah is the possessor of great bounty). It is part of His generosity that the Exalted only causes the people of the Fire to descend based *specifically* on their deeds.\n\n### [The Misguiding Leaders]\n\nAs for His exalted saying: <<زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ>> (We will increase them in torment over [their] torment), this applies to a specific group: the misguiding leaders (الأئمة المضلون). The Exalted says: <<وَلَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَعَ أَثْقَالِهِمْ>> (And they will surely carry their [own] burdens and [other] burdens along with their burdens.) These are those who misled the servants and introduced misleading ambiguities (الشبه المضلة) to them, causing them to deviate from the straight path (سواء السبيل). Thus, they went astray and led others astray.\n\nThey said to them: <<اتَّبِعُوا سَبِيلَنَا وَلْنَحْمِلْ خَطَايَاكُمْ>> (Follow our way, and we will carry your sins.) Allah says: <<وَمَا هُمْ بِحَامِلِينَ مِنْ خَطَايَاهُمْ مِنْ شَيْءٍ إِنَّهُمْ لَكَاذِبُونَ>> (But they will not carry anything of their sins. Indeed, they are liars) in this statement. Rather, they carry their own sins, and those whom they misled also carry their sins, and the sins of these others are added to their own sins, without diminishing anything from the sins of those others.\n\nThe Prophet (peace and blessings be upon him) said: \"Whoever establishes a bad practice (سنة سيئة) will bear its burden and the burden of whoever acts upon it, without diminishing anything from their burdens.\"\n\nThis relates to His saying: <<ثُمَّ ازْدَادُوا كُفْرًا>> (Then they increased in disbelief). It is about these people that it was said: <<زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ>> (We will increase them in torment over [their] torment). They only descend into the Fire to stations of desert (منازل استحقاق). This is contrary to Paradise, where the people of Paradise descend to stations of desert, just like the disbelievers in the Fire based on their deeds, but they also descend to stations of inheritance and stations of specialization, which is not the case for the people of the Fire.\n\n### [Allah's Bounty and Mercy upon the People of the Fire within the Fire Itself]\n\nThe people of the Fire must inevitably receive Allah's bounty (فضل الله) and Mercy (رحمته) within the Fire itself, after the period balancing the duration of their deeds has expired. They will lose the sensation of pain (الإحساس بالآلام) within the Fire itself, because they will never exit the Fire, nor will they die therein or live [a normal life]. Their limbs will become numb (تتخدر) by the removal of the sensitive spirit (الروح الحساس) from them.\n\nFurthermore, there is a group whom Allah grants, after the balancing of the periods between torment and deed has expired, an imaginary bliss (نعيما خياليا), like what a sleeper sees. And their skin, as the Exalted said: <<كُلَّمَا نَضِجَتْ جُلُودُهُمْ>> (Every time their skins are roasted), this is, as we said, its numbness. During the time of roasting and replacement, they lose the pains, because when the time of roasting is over, the Fire subsides for them. They will be in the Fire like the community that entered it but was not among its permanent inhabitants. Allah causes them to die therein a death, so they do not feel what the Fire does to their bodies. The complete Hadith is mentioned by Muslim in his *Sahih*. This is part of Allah's bounty and Mercy.\n\n### [The Gates of Hell]\n\nAs for the gates of Hell (أبواب جهنم), Allah mentioned some of the descriptions of their inhabitants. Those who entered it—whether from the four groups who are its permanent inhabitants, or those who exited by intercession (الشفاعة) or Divine care (العناية)—came due to some of the reasons that Allah described as necessitating entry. These gates are: the Gate of *al-Jahīm* (The Blazing Fire), the Gate of *Saqar* (The Scorching Fire), the Gate of *al-Sa'īr* (The Raging Fire), the Gate of *al-Hutama* (The Crusher), the Gate of *Ladhā* (The Fierce Flame), the Gate of *al-Hāmiya* (The Burning), and the Gate of *al-Hāwiya* (The Abyss).\n\nThe gates were named after the characteristics of what lies beyond them and what they were prepared for. Those who enter them are described by what Allah the Exalted mentioned, such as His saying concerning *Ladhā*: <<إِنَّهَا تَدْعُوا مَنْ أَدْبَرَ وَتَوَلَّى وَجَمَعَ فَأَوْعَى>> (It calls him who turned his back and went away and gathered [wealth] and hoarded it.)\n\nAnd He mentioned what the people of *Saqar* say when they are asked: <<مَا سَلَكَكُمْ فِي سَقَرَ قَالُوا لَمْ نَكُ مِنَ الْمُصَلِّينَ وَلَمْ نَكُ نُطْعِمُ الْمِسْكِينَ وَكُنَّا نَخُوضُ مَعَ الْخَائِضِينَ وَكُنَّا نُكَذِّبُ بِيَوْمِ الدِّينِ>> (What put you into Saqar? They will say: We were not of those who prayed, nor did we feed the poor, and we used to indulge in vain talk with those who indulged, and we used to deny the Day of Judgment.)\n\nAnd He said concerning the people of *al-Jahīm* that he denies <<بِيَوْمِ الدِّينِ>> (the Day of Judgment), and <<وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ>> (none denies it except every sinful transgressor). Thus, He described him with sinfulness and transgression. Then He said concerning them: <<ثُمَّ إِنَّهُمْ لَصَالُوا الْجَحِيمِ ثُمَّ يُقَالُ هَذَا الَّذِي كُنْتُمْ بِهِ تُكَذِّبُونَ>> (Then indeed, they will [enter and] burn in al-Jahīm. Then it will be said: This is what you used to deny.) And similarly for *al-Hutama*, *al-Sa'īr*, and others mentioned in the Quran or the Sunnah.\n\n### [The Correspondences between the Deeds of the People of the Fire and their Stations in the Fire]\n\nWe have now mentioned the main categories and the classes. As for the correspondences (مناسبات) between the deeds and these stations, they are very numerous and would require a lengthy explanation. If we were to embark on that, the duration would be long, for the field is vast. However, the deeds are mentioned, and the torment for them is mentioned. Whenever you come across something of that, and you are upon a light (نور) from your Lord and clear evidence (بينة), Allah will inform you of it through His generosity.\n\nWhat we stipulated for this chapter and titled it with was the mention of the levels (المراتب), which we have mentioned and explained. We have also drawn attention to points where the observer's gaze may roam within this book of mine, concerning the verses we cited in this chapter from the beginning, regarding Allah's command to Iblis concerning what was mentioned to him. Does his compliance with that Divine command (الأمر الإلهي) result in a matter that returns to him by virtue of his compliance, or not? And similar points of attention—if you are guided to them, you will stumble upon abundant Divine sciences (علوم جمة إلهية) pertaining to the people of wretchedness (أهل الشقاء) and the Fire. This much is sufficient for this chapter. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the way.)",
    "ur": "(اہل نار کے مراتب کے بیان میں باسٹھواں باب)\n\nاہل نار کے مراتب اعمال سے ممتاز ہوتے ہیں،\nاور ان میں کوئی اختصاص (اختصاص) یا انعام نہیں ہوتا۔\n\nعذاب ان کے افعال کے وزن کے مطابق آتا ہے،\nیہ ایک خوشخبری ہے، اگرچہ انہیں اس میں ان کے حاصل کردہ اعمال کی وجہ سے عذاب دیا جاتا ہے۔\n\nوہ آگ سے نہیں نکلیں گے، اور اگر وہ نکل بھی جائیں تو انہیں عذاب دیا جائے گا،\nپس ان کے لیے ذلت بھی ہے اور عزت بھی۔\n\nان کی ذلت یہ ہے کہ وہ آگ میں ہمیشہ رہیں گے،\nاور ان کی عزت یہ ہے کہ جب وہ حد سے تجاوز کرتے ہیں تو ان کے لیے کوئی حد مقرر نہیں ہوتی۔\n\nہمارے اس قول میں، اگر تم غور کرو، تو صاحب نظر محقق کے لیے\nعلوم وہب (الوهب) میں ایک اعجاز ہے۔\n\nاس میں ایک خوبصورت اختصار ہے، اس کے الفاظ حسین ہیں،\nاس میں آیات کی لطافتیں اور ایجاز (اختصار) ہے۔\n\nذات جلیل (الحق) نے اہل حق کے درمیان فرمایا:\n\"يَا أَيُّهَا الْمُجْرِمُونَ الْيَوْمَ فَامْتَازُوا\" (اے مجرمو! آج تم الگ ہو جاؤ)۔\n\nتم انہیں ان کی نعمتوں میں بادشاہوں کی طرح دیکھو گے،\nمگر اہل کشف (الکشف) کے نزدیک ان کا لباس ٹاٹ کا ہوگا۔\n\nاور آگ میں ان کے جسموں کو دیکھ کر تم گمان کرو گے\nکہ گویا وہ اسی طرح ہیں جیسا کہ اعجاز نے کہا ہے۔\n\n### [عربی زبان میں جمع قلت کے اوزان]\n\nہمارے قول \"بوزن أفعال\" سے مراد اللہ تعالیٰ کا یہ فرمان ہے: \"لَابِثِينَ فِيهَا أَحْقَابًا\" (وہ اس میں مدتوں رہیں گے)۔ اور یہ جمع قلت کے اوزان میں سے ہے۔ جمع قلت کے چار اوزان ہیں: افعل جیسے أكلب (کتے)، أفعال جیسے أحقاب (مدتیں)، فعلة جیسے فتية (جوان)، اور أفعلة جیسے أحمرة (گدھے)۔ بعض ادیبوں نے ان سب کو ایک شعر میں جمع کیا ہے:\n\nافعل، أفعال، أفعلة، اور فعلة کے ساتھ\nکم تعداد کو جمع کیا جاتا ہے۔\n\n### [بندوں میں سے خذلان زدہ لوگ]\n\nاللہ تعالیٰ اپنے کرم اور اپنی عام رحمت کی بنا پر ابلیس سے فرماتے ہیں جب اس نے کہا: \"أَرَأَيْتَكَ هَذَا الَّذِي كَرَّمْتَ عَلَيَّ\" (کیا تو نے اس کو دیکھا جسے تو نے مجھ پر فضیلت دی؟) ... \"لَأَحْتَنِكَنَّ ذُرِّيَّتَهُ إِلَّا قَلِيلًا\" (میں اس کی ذریت کو لگام ڈالوں گا سوائے تھوڑے سے لوگوں کے)۔ اللہ نے فرمایا: \"اذْهَبْ فَمَن تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزَاؤُكُمْ جَزَاءً مَّوْفُورًا\" (جا، پس ان میں سے جو بھی تیری پیروی کرے گا، تو جہنم ہی تم سب کی پوری پوری جزا ہے)۔ اور \"وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُم بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِم بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِي الْأَمْوَالِ وَالْأَوْلَادِ وَعِدْهُمْ\" (اور ان میں سے جسے تو اپنی آواز سے بہکا سکتا ہے بہکا لے، اور ان پر اپنے سواروں اور پیادوں کے لشکر چڑھا لا، اور ان کے مالوں اور اولاد میں شریک ہو جا، اور انہیں وعدے دے)۔ پس ابلیس اللہ تعالیٰ کے حکم کے بغیر نہیں آیا، یہ ایک الٰہی حکم ہے جس میں وعید اور دھمکی شامل ہے۔ یہ ہمارے حق میں ایک سخت آزمائش تھی تاکہ اللہ تعالیٰ اسے دکھا دے کہ اس کی ذریت میں ایسے لوگ بھی ہیں جن پر ابلیس کا کوئی تسلط یا طاقت نہیں ہے۔ پھر جن بندوں کو اللہ نے خذلان زدہ کیا، انہیں دو گروہوں میں تقسیم کیا: ایک گروہ وہ جنہیں ان کے گناہوں سے کوئی نقصان نہیں پہنچے گا جو ان سے سرزد ہوئے، اور یہ اللہ کے اس فرمان کے مطابق ہے: \"وَاللَّهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلًا\" (اور اللہ تم سے اپنی طرف سے مغفرت اور فضل کا وعدہ کرتا ہے)۔ پس انہیں آگ نہیں چھوئے گی کیونکہ اللہ نے ان کی توبہ قبول کر لی اور ملأ اعلیٰ (فرشتوں) نے ان کے لیے استغفار کیا اور اس گروہ کے لیے دعا کی۔ اور دوسرا گروہ وہ جنہیں اللہ نے ان کے گناہوں کی وجہ سے پکڑ لیا۔ اور جنہیں اللہ نے ان کے گناہوں کی وجہ سے پکڑا، انہیں دو حصوں میں تقسیم کیا: ایک حصہ وہ جنہیں اللہ نے شفاعت کرنے والوں کی شفاعت سے آگ سے نکال دیا، اور وہ مومنین میں سے کبیرہ گناہوں والے لوگ ہیں، اور الٰہی عنایت سے بھی، اور وہ عقلی نظر سے توحید کے قائل ہیں۔ اور دوسرا حصہ وہ جنہیں اللہ نے آگ میں باقی رکھا۔\n\n### [مجرم: ان کے گروہ اور اقسام]\n\nاور یہ حصہ اہل نار (أهل النار) کا ہے جو اس کے حقیقی اہل ہیں، اور وہ خاص طور پر مجرم (المجرمون) ہیں جن کے بارے میں اللہ فرماتا ہے: \"وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ\" (اور آج تم الگ ہو جاؤ اے مجرمو!) یعنی وہ لوگ جو اس گھر (جہنم) میں رہنے کے مستحق ہیں، وہ اسے آباد کریں گے ان لوگوں کے مقابلے میں جو اس سے نکل کر دوسرے گھر (جنت) میں جائیں گے۔ اور یہ مجرم چار گروہ ہیں، یہ سب آگ میں ہوں گے اور \"لَا يُخْرَجُونَ مِنْهَا\" (وہ اس سے نہیں نکالے جائیں گے)۔\n\n۱. **متکبرین:** وہ ہیں جو اللہ پر تکبر کرتے ہیں، جیسے فرعون اور اس جیسے دوسرے لوگ جنہوں نے اپنے لیے ربوبیت کا دعویٰ کیا اور اللہ سے اس کی نفی کی، چنانچہ اس نے کہا: \"يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُم مِّنْ إِلَهٍ غَيْرِي\" (اے دربار والو! میں تمہارے لیے اپنے سوا کسی معبود کو نہیں جانتا) اور کہا: \"أَنَا رَبُّكُمُ الْأَعْلَى\" (میں تمہارا سب سے بڑا رب ہوں)۔ اس کا مطلب یہ تھا کہ آسمان میں میرے سوا کوئی معبود نہیں ہے۔ اسی طرح نمرود اور دیگر۔\n\n۲. **مشرکین:** اور دوسرا گروہ مشرکوں کا ہے، اور وہ وہ لوگ ہیں جو \"يَجْعَلُونَ مَعَ اللَّهِ إِلَهًا آخَرَ\" (اللہ کے ساتھ کوئی دوسرا معبود بناتے ہیں)۔ انہوں نے کہا: \"مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى\" (ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں)۔ اور انہوں نے کہا: \"أَجَعَلَ الْآلِهَةَ إِلَهًا وَاحِدًا إِنَّ هَذَا لَشَيْءٌ عُجَابٌ\" (کیا اس نے سب معبودوں کو ایک ہی معبود بنا دیا؟ بے شک یہ تو بڑی عجیب بات ہے)۔\n\n۳. **معطلہ:** اور تیسرا گروہ معطلہ (نفی کرنے والے) کا ہے، اور وہ وہ لوگ ہیں جنہوں نے معبود کا کلی طور پر انکار کر دیا، پس انہوں نے نہ تو عالم کے لیے کسی معبود کو ثابت کیا اور نہ عالم میں سے کسی کو۔\n\n۴. **منافقین:** اور چوتھا گروہ منافقوں کا ہے، اور وہ وہ لوگ ہیں جنہوں نے ان تین گروہوں میں سے کسی ایک کے عقیدے پر ہونے کے باوجود، ان پر غالب آنے والے قہر کی وجہ سے اسلام کا اظہار کیا، پس انہوں نے اپنے خون، اپنے مال اور اپنی اولاد کے بارے میں خوف محسوس کیا، جبکہ وہ اپنے دلوں میں ان تین گروہوں کے عقائد پر قائم رہے۔\n\n### [مجرموں تک ابلیس کے راستے]\n\nپس یہ چار قسمیں ہیں جو جنوں اور انسانوں میں سے اہل نار (أهل النار) ہیں اور اس سے نہیں نکلیں گے۔ اور یہ چار اس لیے ہیں کہ اللہ تعالیٰ نے ابلیس کے بارے میں ذکر کیا ہے کہ وہ ہمارے پاس ہمارے آگے سے، ہمارے پیچھے سے، ہمارے دائیں سے اور ہمارے بائیں سے آتا ہے۔\n\nپس وہ مشرک کے پاس اس کے آگے سے آتا ہے، اور معطل (نفی کرنے والے) کے پاس اس کے پیچھے سے آتا ہے، اور متکبر کے پاس اس کے دائیں سے آتا ہے، اور منافق کے پاس اس کے بائیں سے آتا ہے، اور یہ کمزور پہلو ہے، کیونکہ یہ گروہوں میں سب سے کمزور ہے، جیسا کہ شمال (بایاں) یمین (دائیں) سے کمزور ہے۔\n\nاور متکبر کو دائیں طرف سے لایا گیا کیونکہ وہ قوت کی جگہ ہے، پس اس نے اپنی اس قوت کی وجہ سے تکبر کیا جسے اس نے اپنے اندر محسوس کیا۔ اور مشرک کے پاس اس کے آگے سے آیا، کیونکہ جب وہ اس کے سامنے تھا تو اس نے ایک عینی جہت دیکھی، پس اس نے اللہ کے وجود کو ثابت کیا اور اس کا انکار نہ کر سکا، تو ابلیس نے اسے اللہ کی الوہیت میں شریک ٹھہرانے پر لگا دیا۔ اور معطل کے پاس اس کے پیچھے سے آیا، کیونکہ پیچھے کی طرف نظر کا مقام نہیں ہے، پس اس نے اس سے کہا کہ وہاں کچھ نہیں ہے، یعنی ہستی (الوجود) میں کوئی معبود نہیں ہے۔\n\n### [اہل نار کے لیے آگ کے ٹھکانے]\n\nپھر اللہ تعالیٰ نے جہنم کے بارے میں فرمایا: \"لَهَا سَبْعَةُ أَبْوَابٍ لِّكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُومٌ\" (اس کے سات دروازے ہیں، ہر دروازے کے لیے ان میں سے ایک حصہ مقرر ہے)۔ پس یہ ان کے لیے چار مراتب ہیں، جہنم کے ہر دروازے میں سے ان کے لیے ایک مقرر حصہ ہے، اور یہی ان کے عذاب کے ٹھکانے ہیں۔ پس جب تم ان چار (مراتب) کو، جن سے ابلیس ان پر داخل ہوا، سات دروازوں سے ضرب دو گے، تو حاصل اٹھائیس ٹھکانے (منازل) ہوں گے۔\n\nاور اسی طرح اللہ نے وہ منازل مقرر کی ہیں جو اس نے انسان مفرد (فرد واحد) کے لیے مقدر کی ہیں، اور وہ چاند اور دیگر سیارے (السیارة الخنس الکنس) ہیں جو ان میں گردش کرتے ہیں اور ان میں اترتے ہیں تاکہ کائنات کو وجود بخشیں، پس اس گردش کے وقت وہ افعال وجود میں آتے ہیں جو عالم عنصری میں تشکیل پاتے ہیں۔ کیونکہ یہ سیارے چار طبائع میں محدود ہیں جو ان کی اپنی ذاتوں میں ضرب کھاتی ہیں، اور وہ سات ہیں، پس ان سے ان کے اٹھائیس ٹھکانے نکلتے ہیں۔ یہ اندازہ ہے غالب اور جاننے والے کا، جیسا کہ اس نے فرمایا: \"كُلٌّ فِي فَلَكٍ يَسْبَحُونَ\" (ہر ایک اپنے مدار میں تیر رہا ہے)۔\n\nاور اس الٰہی گردش سے ان اٹھائیس میں جو ظاہر ہوا، وہ اٹھائیس حروف کا وجود ہے جن سے اللہ نے کلمات کو مرتب کیا، اور دنیا میں کفر اور ایمان ظاہر ہوا، اس طرح کہ ہر شخص نے اپنے اندر کے ایمان، کفر، جھوٹ اور سچ کے مطابق بات کی، تاکہ اللہ کی حجت اس کے بندوں پر ظاہری طور پر قائم ہو جائے ان باتوں کے ذریعے جو انہوں نے کہیں۔ اور اس نے ان پر ایسے فرشتے مقرر کیے جو ان کی کہی ہوئی باتوں کو لکھتے ہیں۔ اللہ تعالیٰ نے فرمایا: \"كِرَامًا كَاتِبِينَ\" (عزت والے لکھنے والے)۔ اور فرمایا: \"مَا يَلْفِظُ مِن قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ\" (وہ کوئی بات نہیں کہتا مگر اس کے پاس ایک نگہبان تیار ہوتا ہے)۔\n\nپس اس نے آگ کے ٹھکانے اٹھائیس بنائے۔ اور جہنم پوری کی پوری اوپر سے نیچے تک سو درک (درک) ہے، جو جنت کے ان درجات (درج) کے مماثل ہیں جن میں نیک بخت لوگ اتریں گے۔ اور ان درکات میں سے ہر درک میں اٹھائیس ٹھکانے ہیں۔ پس جب تم اٹھائیس کو سو سے ضرب دو گے تو حاصل دو ہزار آٹھ سو ٹھکانے ہوں گے۔ پس یہ اٹھائیس سو ہیں۔ اٹھائیس کا عدد مسلسل ہمارے ساتھ رہا ہے، اور یہ آگ کے ٹھکانے ہیں۔\n\n### [اہل جنت اور اہل نار کے درمیان اشتراک اور امتیاز کی بنیاد]\n\nپس چار گروہوں میں سے ہر گروہ کے لیے سات سو قسم کا عذاب ہے، اور وہ چار گروہ ہیں، تو کل اٹھائیس سو قسم کا عذاب ہوا۔ جیسا کہ اہل جنت (أهل الجنة) کے لیے ثواب میں بھی یہی معاملہ ہے، جسے ان کے صدقات میں بیان کیا گیا ہے: \"كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنبُلَةٍ مِّائَةُ حَبَّةٍ\" (اس دانے کی طرح جس نے سات بالیاں اگائیں، ہر بالی میں سو دانے ہوں)۔ پس مجموعہ سات سو ہوا، اور وہ چار گروہ ہیں: رسول، انبیاء، اولیاء، اور مومن۔ پس ان چاروں میں سے ہر صدقہ کرنے والے کے لیے اس کے عمل میں نعمت کا سات سو گنا اضافہ ہے۔\n\nپس دیکھو کہ قرآن اپنے شافی بیان میں کتنا عجیب ہے، اور دونوں گھروں (جنت اور نار) میں اپنی مخلوق کے درمیان توازن قائم کرتا ہے تاکہ نعمت کی جزا اور عذاب کی جزا کے باب میں عدل کو یکساں طور پر قائم کرے۔ پس اس حد تک اہل جنت اور اہل نار کے درمیان درجات (درج) اور درکات (درک) کی تعداد میں مساوات کی وجہ سے اشتراک پایا جاتا ہے۔ اور امتیاز ایک دوسرے امر سے واقع ہوتا ہے۔\n\nاور وہ یہ ہے کہ آگ کو جنت سے یہ امتیاز حاصل ہے کہ آگ میں اللہ کی طرف سے کوئی درکات اختصاص (اختصاص) الٰہی نہیں ہے اور نہ ہی کوئی عذاب اختصاص الٰہی ہے۔ کیونکہ اللہ نے ہمیں کبھی یہ نہیں بتایا کہ وہ اپنی نقمت (عذاب) کے ساتھ جسے چاہتا ہے خاص کرتا ہے، جیسا کہ اس نے ہمیں خبر دی ہے کہ وہ \"يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ\" (اپنی رحمت کے ساتھ جسے چاہتا ہے خاص کر لیتا ہے) اور اپنے فضل کے ساتھ۔ پس جنت اپنی نعمت میں اہل نار کے عذاب کے میزان سے مختلف ہے۔ اہل نار صرف اپنے اعمال کی وجہ سے عذاب دیے جائیں گے، اور اہل جنت اپنے اعمال کی وجہ سے بھی اور اپنے اعمال کے بغیر بھی جنات اختصاص (اختصاص) میں نعمت پائیں گے۔\n\n### [اہل سعادت کی جنتیں]\n\nپس اہل سعادت کے لیے تین جنتیں ہیں: جنت اعمال، جنت اختصاص (اختصاص)، اور جنت میراث۔ اور وہ اس طرح کہ جنوں اور انسانوں میں سے کوئی شخص ایسا نہیں ہے جس کے لیے جنت میں بھی جگہ نہ ہو اور آگ میں بھی جگہ نہ ہو۔ اور یہ اس کے اصلی امکان کی وجہ سے ہے، کیونکہ اس کے وجود میں آنے سے پہلے یہ ممکن تھا کہ وہ عدم میں باقی رہے یا موجود ہو جائے۔ پس اس حقیقت کی بنا پر وہ نعمت کو قبول کرنے اور عذاب کو قبول کرنے کی صلاحیت رکھتا ہے۔ پس جنت سب کو طلب کرتی ہے اور سب اسے طلب کرتے ہیں، اور آگ سب کو طلب کرتی ہے اور سب اسے طلب کرتے ہیں۔ کیونکہ اللہ فرماتا ہے: \"وَلَوْ شَاءَ لَهَدَاكُمْ أَجْمَعِينَ\" (اور اگر وہ چاہتا تو تم سب کو ہدایت دے دیتا)۔ یعنی تم اس کے قابل ہو، لیکن کلمہ حق ہو چکا، علم سبقت لے گیا، اور مشیت نافذ ہو گئی، پس اس کے حکم کو کوئی رد کرنے والا نہیں اور اس کے فیصلے کو کوئی ٹالنے والا نہیں۔\n\nپس اہل جنت اپنے اعمال کے مطابق جنت میں اتریں گے، اور ان کے لیے جنات میراث بھی ہیں، جو اہل نار کی ہوتیں اگر وہ جنت میں داخل ہوتے، اور ان کے لیے جنات اختصاص (اختصاص) بھی ہیں۔ اللہ تعالیٰ فرماتا ہے: \"تِلْكَ الْجَنَّةُ الَّتِي نُورِثُ مِنْ عِبَادِنَا مَن كَانَ تَقِيًّا\" (یہ وہ جنت ہے جس کا ہم اپنے بندوں میں سے پرہیزگاروں کو وارث بنائیں گے)۔ پس یہ وہ جنت ہے جو انہیں اہل نار (أهل النار) سے وراثت کے طور پر ملی جو اس کے اہل تھے، کیونکہ اللہ کے علم میں یہ نہیں تھا کہ وہ اس میں داخل ہوں گے۔ اور اہل نار کے بارے میں یہ نہیں فرمایا کہ وہ آگ میں اہل جنت کی جگہوں کے وارث ہوں گے اگر وہ آگ میں داخل ہوتے۔ اور یہ اس کی رحمت کے اس فضل کی وجہ سے ہے جو اس کی عمومی فضیلت کے ساتھ سبقت لے گیا۔\n\nپس جو بھی اہل نار میں سے آگ میں اترا، وہ صرف اپنے اعمال کی وجہ سے اترا۔ اور اسی وجہ سے اس میں خالی جگہیں باقی رہیں گی، اور یہ وہ جگہیں ہیں جنہیں اگر اہل جنت داخل ہوتے تو آباد کرتے۔ پس اللہ ایک ایسی مخلوق پیدا کرے گا جو انہیں آباد کرے گی، ایسے مزاج پر کہ اگر وہ اس کے ساتھ جنت میں داخل ہوتے تو عذاب پاتے، اور یہ نبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے: \"پس جبار (اللہ) اس میں اپنا قدم رکھے گا، تو وہ کہے گی: بس، بس۔\" یعنی میرا کافی ہے، میرا کافی ہے۔ کیونکہ اللہ تعالیٰ اس سے فرماتا ہے: \"هَلِ امْتَلَأْتِ\" (کیا تو بھر گئی؟) تو وہ کہتی ہے: \"هَلْ مِن مَّزِيدٍ\" (کیا مزید ہے؟)۔ کیونکہ اس نے جنت اور آگ دونوں سے فرمایا تھا کہ تم میں سے ہر ایک کا بھرنا ضروری ہے۔ پس ان دونوں کے لیے صرف یہ شرط رکھی گئی کہ وہ مخلوق سے بھر جائیں، اور یہ شرط نہیں رکھی گئی کہ جن سے وہ بھری جائیں گی ان کا عذاب ہوگا یا ان کی نعمت۔ اور بلاشبہ جنت آگ سے زیادہ وسیع ہے، کیونکہ \"عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ\" (اس کی چوڑائی آسمانوں اور زمین کے برابر ہے)، تو اس کی لمبائی کے بارے میں تمہارا کیا خیال ہے؟ پس وہ آگ کے لیے اس دائرے کے محیط کی طرح ہے جو اسے گھیرے ہوئے ہے۔ اور ہم نے اسے التنزلات الموصلية (التنزلات الموصلية) میں، جیسا کہ وہ اپنی ذات میں ہے، یوم الاثنین (پیر کے دن) کے باب میں بیان کیا اور واضح کیا۔ اور آگ کی چوڑائی اس خط کے برابر ہے جو ثابت ستاروں کے فلک کے دائرے کے دو قطروں کو ممتاز کرتا ہے۔ پس یہ تنگی اس وسعت کے مقابلے میں کہاں؟ اور اس وسعت کا سبب جنات اختصاص (اختصاص) الٰہی ہے۔\n\nپس روایت میں آیا ہے کہ جنت میں بھی ایسی جگہیں باقی رہیں گی جہاں کوئی نہیں ہوگا، تو اللہ نعمت کے لیے ایک مخلوق پیدا کرے گا اور ان سے اسے آباد کرے گا۔ اور یہ کہ رحمن اس میں اپنا قدم رکھے گا، اور یہ صرف جنات اختصاص (اختصاص) میں ہوگا۔ پس \"فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ\" (پس حکم اللہ ہی کا ہے جو بلند اور بڑا ہے)۔ \"يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاءُ\" (وہ اپنی رحمت کے ساتھ جسے چاہتا ہے خاص کر لیتا ہے)۔ اور \"وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ\" (اور اللہ بڑے فضل والا ہے)۔ پس اس کے کرم میں سے یہ ہے کہ اس نے اہل نار (أهل النار) کو صرف ان کے اعمال کی وجہ سے ہی اتارا ہے۔\n\n### [گمراہ کرنے والے امام]\n\nاور جہاں تک اللہ تعالیٰ کے اس فرمان کا تعلق ہے: \"زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ\" (ہم نے ان کے لیے عذاب پر عذاب بڑھا دیا)، تو یہ ایک مخصوص گروہ کے لیے ہے، اور وہ گمراہ کرنے والے امام ہیں۔ اللہ تعالیٰ فرماتا ہے: \"وَلَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالًا مَّعَ أَثْقَالِهِمْ\" (اور وہ ضرور اپنے بوجھ بھی اٹھائیں گے اور اپنے بوجھوں کے ساتھ دوسرے بوجھ بھی)۔ اور یہ وہ لوگ ہیں جنہوں نے بندوں کو گمراہ کیا اور ان پر گمراہ کن شبہات ڈالے، پس وہ ان کی وجہ سے سیدھے راستے سے ہٹ گئے، خود بھی گمراہ ہوئے اور دوسروں کو بھی گمراہ کیا۔ اور انہوں نے ان سے کہا: \"اتَّبِعُوا سَبِيلَنَا وَلْنَحْمِلْ خَطَايَاكُمْ\" (ہمارے راستے کی پیروی کرو اور ہم تمہارے گناہ اٹھا لیں گے)۔ اللہ فرماتا ہے: \"وَمَا هُم بِحَامِلِينَ مِنْ خَطَايَاهُم مِّن شَيْءٍ إِنَّهُمْ لَكَاذِبُونَ\" (اور وہ ان کے گناہوں میں سے کچھ بھی اٹھانے والے نہیں ہیں، بے شک وہ اس قول میں جھوٹے ہیں)۔ بلکہ وہ اپنے گناہ اٹھانے والے ہیں، اور جنہیں انہوں نے گمراہ کیا وہ بھی اپنے گناہ اٹھائیں گے، اور ان کے گناہ ان کے اپنے گناہوں کے ساتھ ہوں گے، اور ان کے گناہوں میں سے کچھ بھی کم نہیں کیا جائے گا۔\n\nنبی اکرم صلی اللہ علیہ وسلم فرماتے ہیں: \"جس نے کوئی برا طریقہ جاری کیا، تو اس پر اس کا بوجھ ہے اور ان لوگوں کا بوجھ بھی جنہوں نے اس پر عمل کیا، اس کے بغیر کہ ان کے بوجھوں میں سے کچھ کم کیا جائے۔\"\n\nپس یہ اللہ کا فرمان ہے: \"ثُمَّ ازْدَادُوا كُفْرًا\" (پھر انہوں نے کفر میں اضافہ کیا)۔ پس ان کے بارے میں کہا گیا: \"زِدْنَاهُمْ عَذَابًا فَوْقَ الْعَذَابِ\" (ہم نے ان کے لیے عذاب پر عذاب بڑھا دیا)۔ پس وہ آگ میں صرف استحقاق کے ٹھکانوں میں اتارے گئے، بخلاف جنت کے۔ کیونکہ اہل جنت (أهل الجنة) اس میں اپنے اعمال کی وجہ سے استحقاق کے ٹھکانوں میں اتارے گئے، جیسے کفار آگ میں اپنے اعمال کی وجہ سے، اور وہ وراثت کے ٹھکانوں اور اختصاص (اختصاص) کے ٹھکانوں میں بھی اتارے گئے، اور یہ اہل نار (أهل النار) کے لیے نہیں ہے۔\n\n### [آگ میں اہل نار پر اللہ کا فضل اور رحمت]\n\nاور اہل نار (أهل النار) کے لیے آگ میں ہی اللہ کا فضل اور رحمت ضروری ہے، اعمال کے اوقات کے توازن کی مدت ختم ہونے کے بعد، پس وہ آگ میں ہی درد کا احساس کھو دیں گے۔ کیونکہ وہ آگ سے کبھی نہیں نکلیں گے، پس نہ وہ اس میں مریں گے اور نہ زندہ رہیں گے، تو ان کے اعضاء سے حساس روح کے نکل جانے سے وہ بے حس ہو جائیں گے۔ اور ایک گروہ ایسا ہے جسے اللہ عذاب اور عمل کے درمیان مدتوں کے توازن کے ختم ہونے کے بعد ایک خیالی نعمت عطا کرے گا، جیسے سونے والا دیکھتا ہے۔ اور ان کی جلد، جیسا کہ اللہ تعالیٰ نے فرمایا: \"كُلَّمَا نَضِجَتْ جُلُودُهُمْ\" (جب بھی ان کی کھالیں پک جائیں گی)، وہ وہی ہے جو ہم نے کہا کہ وہ بے حس ہو جائیں گی۔ پس پکنے اور بدلنے کے وقت وہ درد کو کھو دیتے ہیں کیونکہ جب پکنے کا وقت ختم ہو جاتا ہے تو ان کے حق میں آگ بجھ جاتی ہے، پس وہ آگ میں اس قوم کی طرح ہوں گے جو اس میں داخل ہوئی اور اس کے اہل میں سے نہیں تھی، تو اللہ انہیں اس میں موت دے دے گا، پس وہ اس چیز کو محسوس نہیں کریں گے جو آگ ان کے جسموں کے ساتھ کرتی ہے۔ یہ حدیث مکمل طور پر مسلم نے اپنی صحیح میں ذکر کی ہے۔ اور یہ اللہ کے فضل اور رحمت میں سے ہے۔\n\n### [جہنم کے دروازے]\n\nاور جہاں تک جہنم کے دروازوں کا تعلق ہے، تو اللہ نے ان کے ساتھیوں کی کچھ صفات کا ذکر کیا ہے، لیکن ان چار گروہوں میں سے جو اس کے اہل ہیں، اور جو شفاعت یا عنایت سے اس میں داخل ہونے کے بعد نکل گئے، وہ ان اسباب میں سے کچھ لے کر آئے جن کی وجہ سے اللہ نے اس میں داخل ہونے والوں کو بیان کیا ہے۔ اور وہ ہیں: باب الجحیم، باب سقر، باب السعیر، باب الحطمة، باب لظیٰ، باب الحامیہ، اور باب الہاویہ۔ اور دروازوں کو ان صفات کے ناموں سے موسوم کیا گیا ہے جو ان کے پیچھے تیار کی گئی ہیں۔ اور ان میں داخل ہونے والوں کو ان صفات سے بیان کیا گیا ہے جن کا اللہ تعالیٰ نے ذکر کیا ہے، جیسے لظیٰ کے بارے میں اس کا فرمان: \"إِنَّهَا تَدْعُو مَنْ أَدْبَرَ وَتَوَلَّىٰ * وَجَمَعَ فَأَوْعَىٰ\" (بے شک وہ اس کو بلاتی ہے جس نے پیٹھ پھیری اور منہ موڑا * اور مال جمع کیا اور اسے سنبھال کر رکھا)۔ اور فرمایا کہ اہل سقر کیا کہیں گے جب ان سے پوچھا جائے گا: \"مَا سَلَكَكُمْ فِي سَقَرَ\" (تمہیں سقر میں کس چیز نے ڈالا؟)۔ وہ کہیں گے: \"قَالُوا لَمْ نَكُ مِنَ الْمُصَلِّينَ * وَلَمْ نَكُ نُطْعِمُ الْمِسْكِينَ * وَكُنَّا نَخُوضُ مَعَ الْخَائِضِينَ * وَكُنَّا نُكَذِّبُ بِيَوْمِ الدِّينِ\" (انہوں نے کہا: ہم نماز پڑھنے والوں میں سے نہیں تھے * اور نہ ہم مسکین کو کھانا کھلاتے تھے * اور ہم باطل میں گھسنے والوں کے ساتھ گھس جاتے تھے * اور ہم روز جزا کو جھٹلاتے تھے)۔ اور اہل جحیم کے بارے میں فرمایا کہ وہ \"يُكَذِّبُ بِيَوْمِ الدِّينِ\" (روز جزا کو جھٹلاتا ہے)۔ اور \"وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ\" (اور اسے وہی جھٹلاتا ہے جو حد سے بڑھنے والا گنہگار ہو)۔ پس اسے گناہ اور زیادتی سے متصف کیا، پھر ان کے بارے میں فرمایا: \"ثُمَّ إِنَّهُمْ لَصَالُوا الْجَحِيمِ * ثُمَّ يُقَالُ هَذَا الَّذِي كُنتُمْ بِهِ تُكَذِّبُونَ\" (پھر بے شک وہ ضرور جہنم میں داخل ہوں گے * پھر کہا جائے گا: یہ وہی ہے جسے تم جھٹلایا کرتے تھے)۔ اور اسی طرح حطمہ، سعیر اور دیگر کے بارے میں بھی ہے جو قرآن یا سنت میں آیا ہے۔\n\n### [اہل نار کے اعمال اور آگ میں ان کے ٹھکانوں کے درمیان مناسبتیں]\n\nپس ہم نے یہاں بنیادی اصول اور طبقات کا ذکر کر دیا ہے۔ اور جہاں تک ان ٹھکانوں کے لیے اعمال کی مناسبتوں کا تعلق ہے، تو وہ بہت زیادہ ہیں جن کی شرح طویل ہو جائے گی، اور اگر ہم اس میں شروع ہوئے تو مدت بڑھ جائے گی، کیونکہ میدان وسیع ہے۔ لیکن اعمال مذکور ہیں اور ان پر عذاب بھی مذکور ہے۔ پس جب بھی تم ان میں سے کسی چیز پر مطلع ہو اور اپنے رب کی طرف سے نور اور دلیل پر ہو، تو اللہ اپنے کرم سے تمہیں اس پر مطلع کر دے گا۔ اور جو ہم نے اس باب میں شرط رکھی تھی اور جس کا عنوان قائم کیا تھا، وہ مراتب کا ذکر تھا، اور ہم نے انہیں ذکر کیا اور واضح کر دیا۔ اور ہم نے ان مقامات پر بھی توجہ دلائی جہاں اس کتاب میں دیکھنے والے کی نظر گھومتی ہے، ان آیات سے جو ہم نے اس باب کے شروع میں اللہ کے ابلیس کو حکم دینے کے بارے میں بطور شہادت پیش کیں۔ پس کیا اس الٰہی حکم کی تعمیل میں اس کے لیے کوئی ایسا امر ہے جو اس پر لوٹتا ہو، اس حیثیت سے کہ وہ تعمیل کرنے والا ہے یا نہیں؟ اور اس طرح کی تنبیہات، اگر تم اس کی توفیق پاؤ، تو تم اہل شقاوت اور اہل نار (أهل النار) سے متعلق بہت سے الٰہی علوم پر مطلع ہو جاؤ گے۔ اور یہ مقدار اس باب میں کافی ہے۔ \"وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "(باب شصت و دوم در مراتب اهل آتش)\n\nمراتب آتش به واسطه اعمال متمایز می‌شود *** و در آن اختصاصات و انجاز (تحقق) نیست\nعذاب برای او به وزن افعال (أفعال) آمده است *** بشارتی است، هرچند به آنچه کسب کرده‌اند در آن عذاب شوند\nاز آتش خارج نمی‌شوند، و اگر هم خارج شوند *** عذاب خواهند دید، پس برایشان خواری و عزت است\nخواری‌شان به سبب ماندنشان در آتش است *** و عزتشان آن است که اگر از حد بگذرند، حدی برایشان نیست\nدر سخن ما اگر کسی که صاحب نظر است تأمل کند *** محقق در علوم موهبتی (الوهب) اعجازی می‌بیند\nدر آن اختصار بدیعی است که لفظش نیکوست *** و در آن لطایف آیات و ایجاز (کوتاه‌گویی) است\n\nحق (الجلیل) به اهل حق در میانشان فرمود:\n«يا أيها المجرمون اليوم فامتازوا»\n(ای مجرمان، امروز جدا شوید)\nآنان را در نعمتشان همچون پادشاهان می‌بینی *** و لباسشان نزد اهل کشف (الکشف) جامه‌های خشن است\nو از پیکرهایشان در آتش گمان می‌کنی *** که آنان همچون آن چیزی هستند که اعجاز (معجزه) گفته است\n\n### [اوزان جمع قله در زبان عرب]\n\nمنظور ما از «به وزن افعال» سخن خداوند متعال است: **«لابِثِينَ فِيها أَحْقاباً»** (در آن روزگارانی درنگ‌کنندگانند). این از اوزان جمع قله است. اوزان جمع قله چهار وزن است: *أفْعُل* مانند *أکلب* (سگ‌ها)، *أفْعال* مانند *أحقاب* (روزگاران)، *فِعْلَة* مانند *فِتْيَة* (جوانان)، و *أفْعِلَة* مانند *أحْمِرَة* (الاغ‌ها). برخی از ادیبان این اوزان را در یک بیت شعر جمع کرده‌اند و گفته‌اند:\n\n«بأفعل وبأفعال وأفعلة *** وفعلة يجمع الأدنى من العدد»\n(با أفعل و بأفعال و أفعلة *** و فعلة، کمترین عدد جمع می‌شود)\n\n### [خوارشدگان از بندگان]\n\nخداوند متعال از روی کرم و رحمت عام خود به ابلیس فرمود، هنگامی که ابلیس گفت: **«أَ رَأَيْتَكَ هذَا الَّذِي كَرَّمْتَ عَلَيَّ ... لَأَحْتَنِكَنَّ ذُرِّيَّتَهُ إِلَّا قَلِيلًا»** (آیا این کسی را که بر من گرامی داشتی دیدی؟ ... قطعاً فرزندانش را جز اندکی، مهار خواهم کرد). خداوند فرمود: **«قالَ اذْهَبْ فَمَنْ تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزاؤُكُمْ جَزاءً مَوْفُوراً»** (فرمود: برو، هر کس از آنان که تو را پیروی کند، جزای شما جهنم است، جزایی کامل). و **«واسْتَفْزِزْ من اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وأَجْلِبْ عَلَيْهِمْ بِخَيْلِكَ ورَجِلِكَ وشارِكْهُمْ في الْأَمْوالِ والْأَوْلادِ وعِدْهُمْ»** (و هر کس از آنان را که توانستی، با صدای خود تحریک کن و با سواره و پیاده‌ات بر آنان بتاز و در اموال و اولادشان شریک شو و به آنان وعده بده). پس ابلیس جز به امر خداوند متعال نیامد. این یک امر الهی است که متضمن وعید و تهدید است و در حق ما آزمایشی سخت بود تا خداوند به او نشان دهد که در میان ذریه آدم کسانی هستند که ابلیس بر آنان سلطه و قدرتی ندارد.\nسپس، خداوند بندگانی را که خوار ساخت، دو گروه قرار داد: گروهی که گناهان واقع شده از آنان ضرری به ایشان نمی‌رساند، و این همان قول خداوند است: **«والله يَعِدُكُمْ مَغْفِرَةً مِنْهُ وفَضْلًا»** (و خداوند از جانب خود به شما مغفرت و فضلی وعده می‌دهد). پس آتش به آنان نمی‌رسد، به سبب توبه‌ای که خداوند بر آنان پذیرفته و استغفار ملأ اعلی (فرشتگان مقرب) برایشان و دعایشان برای این گروه. و گروه دیگری که خداوند آنان را به سبب گناهانشان مؤاخذه کرد. کسانی که خداوند آنان را به سبب گناهانشان مؤاخذه کرد، به دو دسته تقسیم نمود: دسته‌ای که خداوند آنان را به شفاعت شفاعت‌کنندگان از آتش خارج ساخت، و آنان اهل کبائر از مؤمنان هستند و به واسطه عنایت الهی، که همان اهل توحید (التوحید) با نظر عقلی هستند. و دسته دیگری که خداوند آنان را در آتش باقی گذاشت.\n\n### [مجرمان: گروه‌ها و انواعشان]\n\nاین دسته همان اهل آتش هستند که سزاوار آنند، و آنان به طور خاص مجرمانی هستند که خداوند درباره‌شان می‌فرماید: **«وامْتازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ»** (و امروز جدا شوید ای مجرمان). یعنی کسانی که مستحق سکونت در این سرای (جهنم) هستند و آن را آباد می‌کنند، در مقابل کسانی که از آن خارج شده و به سرای دیگر (بهشت) می‌روند. این مجرمان چهار گروه هستند که همگی در آتش‌اند و **«لا يُخْرَجُونَ مِنْها»** (از آن خارج نمی‌شوند):\n۱. **متکبران بر خدا:** مانند فرعون و امثال او که ادعای ربوبیت برای خود کردند و آن را از خدا نفی نمودند و گفتند: **«يا أَيُّهَا الْمَلَأُ ما عَلِمْتُ لَكُمْ من إِلهٍ غَيْرِي»** (ای بزرگان، من برای شما خدایی جز خودم نمی‌شناسم) و گفت: **«أَنَا رَبُّكُمُ الْأَعْلى‏»** (من پروردگار برتر شما هستم)، یعنی می‌خواست بگوید در آسمان خدایی جز من نیست. همچنین نمرود و دیگران.\n۲. **مشرکان:** آنان کسانی هستند که **«يَجْعَلُونَ مَعَ الله إِلهاً آخَرَ»** (با خدا خدای دیگری قرار می‌دهند). پس گفتند: **«ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏»** (ما آنان را نمی‌پرستیم مگر برای اینکه ما را به خدا نزدیک گردانند). و گفتند: **«أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إِنَّ هذا لَشَيْ‏ءٌ عُجابٌ»** (آیا خدایان را یک خدا قرار داده است؟ این قطعاً چیزی شگفت‌انگیز است).\n۳. **معطله (منکران):** آنان کسانی هستند که وجود خدا را به کلی نفی کردند و نه خدایی برای عالم و نه از عالم اثبات نمودند.\n۴. **منافقان:** آنان کسانی هستند که اسلام را از ترس غلبه‌ای که بر آنان حکم شد، از یکی از این سه گروه اظهار کردند و بر جان و مال و فرزندان خود ترسیدند، در حالی که در باطن بر همان اعتقاد این سه گروه باقی ماندند.\n\n### [راه‌های نفوذ ابلیس به مجرمان]\n\nاین چهار صنف، همان اهل آتش هستند که از جن و انس از آن خارج نمی‌شوند. و این که چهار صنف هستند، به این دلیل است که خداوند متعال درباره ابلیس ذکر کرده است که او از پیش رو، از پشت سر، از سمت راست و از سمت چپ ما می‌آید.\nپس برای مشرک از پیش رو می‌آید، و برای معطّل (منکر خدا) از پشت سر می‌آید، و برای متکبر از سمت راست می‌آید، و برای منافق از سمت چپ می‌آید، که این سمت ضعیف‌تر است، زیرا منافق ضعیف‌ترین گروه‌هاست، همان‌طور که چپ از راست ضعیف‌تر است.\nمتکبر را از سمت راست قرار داد، زیرا سمت راست جایگاه قدرت است، پس او به دلیل قدرتی که در خود احساس کرد، تکبر ورزید.\nو برای مشرک از پیش رو آمد، زیرا مشرک چون پیش رویش بود، جهت عینی را دید و وجود خدا را اثبات کرد و نتوانست آن را انکار کند، پس ابلیس او را واداشت تا در الوهیت (الألوهية) با خدا شریک قرار دهد.\nو برای معطّل از پشت سر آمد، زیرا پشت سر جایگاه نظر و دیدن نیست، پس به او گفت: آنجا چیزی نیست، یعنی در هستی (الوجود) خدایی نیست.\n\n### [منازل آتش برای اهل آتش]\n\nسپس خداوند متعال درباره جهنم فرمود: **«لَها سَبْعَةُ أَبْوابٍ لِكُلِّ بابٍ مِنْهُمْ جُزْءٌ مَقْسُومٌ»** (برای آن هفت در است، برای هر دری از آنان بخشی تقسیم شده است). پس این چهار مرتبه برای آنان است که از هر دری از درهای جهنم، بخشی تقسیم شده دارند، و اینها منازل عذابشان است. اگر چهار (که همان مراتبی است که ابلیس از آن بر آنان وارد شد) را در هفت در ضرب کنی، حاصل بیست و هشت منزل خواهد بود.\nهمچنین خداوند منازلی را که برای انسان مفرد (قمر) و دیگر سیارات خُنَّس کُنَّس (سیاراتی که پنهان می‌شوند و باز می‌گردند) مقدر کرده است، قرار داد که در آن سیر می‌کنند و در آن فرود می‌آیند تا کائنات ایجاد شوند. پس در این سیر، آنچه از افعال در عالم عنصری شکل می‌گیرد، به وجود می‌آید. این سیارات در چهار طبیعت محصور شده‌اند که در ذات خودشان ضرب شده‌اند و آنها هفت سیاره هستند، پس منازل بیست و هشت‌گانه از آن خارج شد. این به تقدیر (تقدیر) خدای عزیز و داناست، چنانکه فرمود: **«كُلٌّ في فَلَكٍ يَسْبَحُونَ»** (هر یک در مداری شناورند).\nو از این سیر الهی در این بیست و هشت، وجود بیست و هشت حرفی آشکار شد که خداوند کلمات را از آنها تألیف کرد و کفر و ایمان در عالم ظاهر شد، به این صورت که هر شخصی آنچه در درون خود از ایمان و کفر و دروغ و صدق دارد، به زبان آورد تا حجت خدا بر بندگانش به واسطه آنچه بر زبان آورده‌اند، آشکارا تمام شود. و فرشتگانی را بر آنان گماشت تا آنچه را بر زبان می‌آورند، بنویسند. خداوند متعال فرمود: **«كِراماً كاتِبِينَ»** (بزرگوارانی نویسنده). و فرمود: **«ما يَلْفِظُ من قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ»** (هیچ سخنی بر زبان نمی‌آورد مگر اینکه نزد او نگهبانی آماده است).\nپس منازل آتش را بیست و هشت منزل قرار داد. و جهنم کلاً صد دَرَک (طبقه زیرین) از بالاترین تا پایین‌ترین آن است، که نظیر درجات بهشت است که سعادتمندان در آن فرود می‌آیند. و در هر دَرَک از این دَرَکات، بیست و هشت منزل وجود دارد. پس اگر بیست و هشت را در صد ضرب کنی، حاصل دو هزار و هشتصد منزل خواهد بود. پس این همان بیست و هشت صد است. و این بیست و هشت همواره ما را همراهی می‌کند، و اینها منازل آتش هستند.\n\n### [وجه اشتراک و امتیاز میان اهل بهشت و اهل آتش]\n\nبرای هر گروه از این چهار گروه، هفتصد نوع عذاب وجود دارد، و چون چهار گروه هستند، مجموعاً دو هزار و هشتصد نوع عذاب می‌شود. همان‌طور که برای اهل بهشت نیز به همین میزان ثواب وجود دارد. این امر در صدقاتشان روشن می‌شود: **«كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنابِلَ في كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ»** (مانند دانه‌ای که هفت خوشه برویاند و در هر خوشه صد دانه باشد). پس مجموع هفتصد است. و آنان چهار گروه هستند: رسولان، انبیا، اولیا و مؤمنان. پس برای هر صدقه‌دهنده‌ای از این چهار گروه، هفتصد برابر نعمت در عملشان وجود دارد.\nپس بنگر که قرآن در بیان شفابخش خود و موازنه‌اش در خلقت در دو سرا (بهشت و آتش) برای برپایی عدالت به طور مساوی در باب جزای نعمت و جزای عذاب، چقدر شگفت‌انگیز است.\nبه این میزان، اشتراک میان اهل بهشت و اهل آتش به دلیل تساوی در تعداد درجات (درجات بهشت) و دَرَکات (درکات آتش) رخ می‌دهد.\nاما امتیاز (الامتیاز) به امر دیگری واقع می‌شود، و آن این است که آتش از بهشت متمایز است، زیرا در آتش دَرَکات اختصاصی الهی و عذاب اختصاصی الهی از جانب خدا وجود ندارد. زیرا خداوند هرگز به ما خبر نداده است که انتقام خود را به هر که بخواهد اختصاص می‌دهد، همان‌طور که خبر داده است که **«يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ»** (رحمت خود را به هر که بخواهد اختصاص می‌دهد) و فضل خود را.\nپس بهشت در نعمتش با میزان عذاب اهل آتش متفاوت است. اهل آتش تنها به اعمالشان عذاب می‌شوند و بس، اما اهل بهشت هم به اعمالشان و هم به غیر اعمالشان در جنات اختصاص (جنات الاختصاص) متنعم می‌شوند.\n\n### [بهشت‌های اهل سعادت]\n\nبرای اهل سعادت سه بهشت وجود دارد: بهشت اعمال، بهشت اختصاص و بهشت میراث. این بدان سبب است که هیچ فردی از جن و انس نیست مگر اینکه در بهشت جایگاهی و در آتش جایگاهی دارد. این به دلیل امکان اصلی (إمكانه الأصلي) اوست، زیرا پیش از وجودش ممکن بود که در عدم باقی بماند یا موجود شود. پس از این حقیقت، او پذیرای نعمت و پذیرای عذاب است. بهشت طالب همه است و همه طالب آنند، و آتش طالب همه است و همه طالب آنند. زیرا خداوند می‌فرماید: **«ولَوْ شاءَ لَهَداكُمْ أَجْمَعِينَ»** (و اگر می‌خواست، قطعاً همه شما را هدایت می‌کرد). یعنی شما قابلیت آن را دارید، اما کلمه (حکم الهی) محقق شد و علم سبقت گرفت و مشیت نافذ گشت، پس هیچ بازدارنده‌ای برای امر او و هیچ تعقیب‌کننده‌ای برای حکم او نیست.\nپس اهل بهشت بر اساس اعمالشان در بهشت فرود می‌آیند و جنات میراث (جنات المیراث) را دارند، که همان جایگاه‌هایی است که اگر اهل آتش به بهشت می‌آمدند، از آنِ آنان بود. و همچنین جنات اختصاص را دارند.\nخداوند متعال می‌فرماید: **«تِلْكَ الْجَنَّةُ الَّتِي نُورِثُ من عِبادِنا من كانَ تَقِيًّا»** (این همان بهشتی است که به بندگان پرهیزگارمان به ارث می‌دهیم). پس این بهشتی است که از طریق ارث از اهل آتش که سزاوار آن بودند، به آنان رسیده است، زیرا در علم خدا نبود که آنان وارد بهشت شوند. اما درباره اهل آتش گفته نشده است که آنان جایگاه‌های اهل بهشت را اگر وارد آتش می‌شدند، به ارث می‌برند. این از سبقت رحمت با عموم فضل اوست، سبحانه.\nپس هیچ کس از اهل آتش جز به اعمالشان در آن فرود نیامده است. به همین دلیل، در آن جایگاه‌های خالی باقی می‌ماند، و اینها همان جایگاه‌هایی است که اگر اهل بهشت وارد آن می‌شدند، آن را آباد می‌کردند. پس خداوند خلقی را می‌آفریند که آن را آباد می‌کنند، بر مزاجی که اگر با آن وارد بهشت می‌شدند، عذاب می‌دیدند. و این همان قول پیامبر (صلی الله علیه و سلم) است که: «جبار (خداوند) قدم خود را در آن می‌گذارد، پس می‌گوید: قَطْ قَطْ» (بس است، بس است).\nیعنی: بس است، بس است. زیرا خداوند متعال به آن می‌گوید: **«هَلِ امْتَلَأْتِ»** (آیا پر شدی؟) و او می‌گوید: **«هَلْ من مَزِيدٍ»** (آیا افزون بر این هست؟). زیرا خداوند به بهشت و آتش فرمود: برای هر یک از شما پُریِ آن است. و شرط نکرد جز اینکه آن دو را با خلق پر کند، و عذاب کسانی که با آنها پر می‌شوند یا نعمتشان را شرط نکرد.\nو بهشت بدون شک از آتش وسیع‌تر است، زیرا **«عَرْضُهَا السَّماواتُ والْأَرْضُ»** (عرض آن آسمان‌ها و زمین است). پس گمانت درباره طول آن چیست؟ بهشت برای آتش مانند محیط دایره‌ای است که آن را در بر می‌گیرد. و ما در *التنزلات الموصلیة* آن را در باب روز دوشنبه، همان‌طور که در نفس خود هست، ترسیم و بیان کرده‌ایم.\nو عرض آتش به اندازه خطی است که دو قطر دایره فلک کواکب ثابت را از هم جدا می‌کند. پس این تنگی کجا و آن وسعت کجا؟ و سبب این وسعت، جنات اختصاص الهی است.\nدر خبر آمده است که در بهشت نیز جایگاه‌هایی باقی می‌ماند که کسی در آن نیست، پس خداوند خلقی را برای نعمت می‌آفریند و آن جایگاه‌ها را با آنان آباد می‌کند.\nو این همان است که رحمان قدم خود را در آن می‌گذارد، و این جز در جنات اختصاص نیست. **«فَالْحُكْمُ لِلَّهِ الْعَلِيِّ الْكَبِيرِ يَخْتَصُّ بِرَحْمَتِهِ من يَشاءُ والله ذُو الْفَضْلِ الْعَظِيمِ»** (پس حکم از آنِ خداست، بلندمرتبه و بزرگ. رحمت خود را به هر که بخواهد اختصاص می‌دهد، و خداوند صاحب فضل عظیم است). پس از کرم اوست که خداوند اهل آتش را جز بر اساس اعمالشان فرود نیاورده است.\n\n### [پیشوایان گمراه‌کننده]\n\nاما قول خداوند متعال: **«زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ»** (عذابی بر عذابشان افزودیم)، این برای گروه خاصی است و آنان پیشوایان گمراه‌کننده هستند. خداوند متعال می‌فرماید: **«ولَيَحْمِلُنَّ أَثْقالَهُمْ وأَثْقالًا مَعَ أَثْقالِهِمْ»** (و قطعاً بارهای خود و بارهایی همراه بارهای خود را حمل خواهند کرد). آنان کسانی هستند که بندگان را گمراه کردند و شبهات گمراه‌کننده را بر آنان وارد ساختند، پس با آن از راه راست منحرف شدند و گمراه گشتند و دیگران را نیز گمراه کردند. و به آنان گفتند: **«اتَّبِعُوا سَبِيلَنا ولْنَحْمِلْ خَطاياكُمْ»** (راه ما را پیروی کنید و ما خطاهای شما را بر دوش می‌کشیم). خداوند می‌فرماید: **«وما هُمْ بِحامِلِينَ من خَطاياهُمْ من شَيْءٍ إِنَّهُمْ لَكاذِبُونَ»** (و آنان چیزی از خطاهایشان را بر دوش نمی‌کشند، قطعاً آنان در این سخن دروغگویند). بلکه آنان خطاهای خود را حمل می‌کنند و کسانی که گمراهشان کرده‌اند نیز خطاهای آنان و خطاهای این گمراه‌شدگان را همراه خطاهای خود حمل می‌کنند و از خطاهای اینان چیزی کم نمی‌شود.\nپیامبر (صلی الله علیه و سلم) می‌فرماید: «هر کس سنت بدی را پایه‌گذاری کند، وزر (گناه) آن و وزر کسی که به آن عمل کند، بر عهده اوست، بدون اینکه از گناهان آنان چیزی کاسته شود.»\nپس این همان قول خداوند است: **«ثُمَّ ازْدادُوا كُفْراً»** (سپس بر کفر خود افزودند). درباره اینان گفته شده است: **«زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ»** (عذابی بر عذابشان افزودیم).\nپس آنان در آتش جز در منازل استحقاق فرود نیامده‌اند، برخلاف بهشت. زیرا اهل بهشت در آن در منازل استحقاق (مانند کفار در آتش) به واسطه اعمالشان فرود آمده‌اند، و همچنین در منازل وراثت و منازل اختصاص فرود آمده‌اند، و این در مورد اهل آتش وجود ندارد.\n\n### [فضل و رحمت خداوند بر اهل آتش در خود آتش]\n\nاهل آتش ناگزیر از فضل و رحمت خداوند در خود آتش هستند، پس از پایان یافتن مدت موازنه زمان‌های عمل. در این حالت، احساس درد را در خود آتش از دست می‌دهند، زیرا آنان هرگز از آتش خارج نمی‌شوند، پس نه در آن می‌میرند و نه زندگی می‌کنند. در نتیجه، جوارحشان با زوال روح حساس از آنها، بی‌حس می‌شود.\nو گروهی هستند که خداوند پس از پایان موازنه مدت‌ها میان عذاب و عمل، نعمتی خیالی به آنان می‌دهد، مانند آنچه شخص خوابیده می‌بیند. و پوستشان، چنانکه خداوند متعال فرمود: **«كُلَّما نَضِجَتْ جُلُودُهُمْ»** (هرگاه پوست‌هایشان پخته شود)، همان‌طور که گفتیم، بی‌حس می‌شود. پس در زمان پختگی و تبدیل، دردها را از دست می‌دهند، زیرا:\nهنگامی که زمان پختگی به پایان رسد، آتش در حق آنان خاموش می‌شود. پس در آتش مانند امتی خواهند بود که وارد آن شده‌اند اما از اهل آن نیستند. پس خداوند آنان را در آن می‌میراند، به گونه‌ای که آنچه آتش در بدن‌هایشان انجام می‌دهد، احساس نمی‌کنند. این حدیث به طور کامل در صحیح مسلم ذکر شده است.\nو این از فضل و رحمت خداوند است.\n\n### [درهای جهنم]\n\nاما درهای جهنم، خداوند برخی از صفات صاحبان آنها را ذکر کرده است. اما از این چهار گروه که اهل آن هستند و کسانی که با شفاعت یا عنایت از آن خارج شده‌اند، هر کس که وارد آن شده، با برخی از اوصافی که خداوند برای واردشوندگان به آن ذکر کرده، آمده است. این درها عبارتند از: باب جحیم، باب سقر، باب سعیر، باب حطمه، باب لظی، باب حامیه و باب هاویه.\nاین درها به صفات آنچه در پشت آنهاست و برای آن آماده شده، نامگذاری شده‌اند. و واردشوندگان به آنها با آنچه خداوند متعال ذکر کرده، توصیف شده‌اند. مانند قول خداوند درباره لظی: **«إنها تَدْعُوا من أَدْبَرَ وتَوَلَّى وجَمَعَ فَأَوْعى‏»** (آن شعله‌ها کسی را فرامی‌خواند که پشت کرد و روی گرداند و مال را جمع کرد و در ظرفی نهاد).\nو فرمود که اهل سقر چه می‌گویند، هنگامی که به آنان گفته می‌شود: **«ما سَلَكَكُمْ في سَقَرَ»** (چه چیز شما را به سقر درآورد؟). می‌گویند: **«قالُوا لَمْ نَكُ من الْمُصَلِّينَ ولَمْ نَكُ نُطْعِمُ الْمِسْكِينَ وكُنَّا نَخُوضُ مَعَ الْخائِضِينَ وكُنَّا نُكَذِّبُ بِيَوْمِ الدِّينِ»** (گفتند: ما از نمازگزاران نبودیم و مسکین را اطعام نمی‌کردیم و با فروروندگان (در باطل) فرو می‌رفتیم و روز جزا را تکذیب می‌کردیم).\nو درباره اهل جحیم فرمود که او روز جزا را تکذیب می‌کند: **«وما يُكَذِّبُ به إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ»** (و آن را تکذیب نمی‌کند مگر هر متجاوز گناهکاری). پس او را به گناه و تجاوز توصیف کرد. سپس درباره آنان فرمود: **«ثُمَّ إِنَّهُمْ لَصالُوا الْجَحِيمِ ثُمَّ يُقالُ هذَا الَّذِي كُنْتُمْ به تُكَذِّبُونَ»** (سپس قطعاً آنان وارد جحیم می‌شوند، سپس گفته می‌شود: این همان چیزی است که آن را تکذیب می‌کردید). و همین‌طور در مورد حطمه و سعیر و غیر آن، از آنچه در قرآن یا سنت آمده است.\n\n### [تناسبات میان اعمال اهل آتش و منازلشان در آتش]\n\nما در اینجا اصول و طبقات را ذکر کردیم. اما تناسبات اعمال با این منازل بسیار زیاد است و شرح آن به درازا می‌کشد. اگر به آن بپردازیم، زمان طولانی خواهد شد، زیرا میدان وسیع است. اما اعمال ذکر شده‌اند و عذاب بر آنها نیز ذکر شده است. پس هرگاه بر چیزی از آن وقوف یافتی و بر نور و بینه‌ای از پروردگارت بودی، خداوند به کرم خود تو را بر آن آگاه می‌سازد.\nآنچه ما در این باب شرط کردیم و عنوان قرار دادیم، ذکر مراتب بود، و ما آنها را ذکر کرده و بیان نمودیم. و بر مواضعی که نظر بیننده در این کتاب ما در آن جولان می‌دهد، از آیاتی که در این باب از ابتدا به آنها استشهاد کردیم، تذکر دادیم؛ از جمله امر خداوند به ابلیس درباره آنچه برایش ذکر شد. آیا ابلیس از امتثال آن امر الهی، امری دارد که از حیث مطیع بودن به او بازگردد یا خیر؟ و نظایر این تذکرات. اگر موفق به این کار شوی، بر علوم فراوان الهی که مختص اهل شقاوت و آتش است، دست خواهی یافت.\nاین مقدار در این باب کافی است. **«والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ»** (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 4
}