{
  "id": 230,
  "title": {
    "ar": "الباب الموفي ثلاثين ومائتان في الغربة",
    "en": "Chapter Two Hundred and Thirtieth, Concerning Strangeness (الغربة)",
    "ur": "باب نمبر دو سو تیس، غربت (غربة) کے بیان میں",
    "fa": "باب دویست و سی‌ام در باب غربت (الغربة)"
  },
  "content": {
    "ar": "## «الباب الموفي ثلاثين ومائتان في الغربة»\n\n\n> تغرب عن الأوطان والحال والحق *** عساك تحوز الأمر في مقعد الصدق‏\n\n\n> وكن نافذا في كل أمر ترومه *** ولا تدهشن إن جاءك الحق بالحق‏\n\n\n> ولو لا وجود الفتق في الأرض والسما *** لما دارت الأفلاك من شدة الرتق‏\n\n\n> كذاك سماوات العقول وأرضها *** وأعني بها الطبع المؤثر في الخلق‏\n\n\n> فدارت بأفلاك القوي ثم أبرزت *** معارفها للسامعين من النطق‏\n\n\n### [أن الغربة عبارة عن مفارقة الوطن في طلب المقصود]\n\n\nاعلم أن الغربة عند الطائفة يطلقونها ويريدون بها مفارقة الوطن في طلب المقصود ويطلقونها في اغتراب الحال فيقولون في الغربة الاغتراب عن الحال من النفوذ فيه والغربة عن الحق غربة عن المعرفة من الدهش أما غربتهم عن الأوطان بمفارقتهم إياها فهو لما عندهم من الركون إلى المألوفات فيحجبهم ذلك عن مقصودهم الذي طلبوه بالتوبة وأعطتهم اليقظة وهم غير عارفين بوجه الحق في الأشياء فيتخيلون إن مقصودهم لا يحصل لهم إلا بمفارقة الوطن وأن الحق خارج عن أوطانهم كما فعل أبو يزيد البسطامي لما كان في هذا المقام خرج من بسطام في طلب الحق فوقع به رجل من رجال الله في طريقه فقال له با أبا يزيد ما أخرجك عن وطنك قال طلب الحق قال له الرجل إن الذي تطلبه قد تركته ببسطام فتنبه أبو يزيد ورجع إلى بسطام ولزم الخدمة حتى فتح له فكان منه ما كان فهؤلاء هم السائحون فجعل الله سياحة هذه الأمة الجهاد في سبيل الله واعلم أن هذا الأمر ليس باختيار العبد وإنما صاحب هذا الأمر يطلب وجود قلبه مع ربه في حاله فإذا لم يجده في موضع يقول ربما إن الله تعالى لم يقدر أن يظهر إلى قلبي في هذا الموضع فيرحل عنه رجاء\nالحصول لما علم إن الله تعالى قد رتب أمورا واقتضى علمه أزلا أنه لا يكون كذا إلا بموضع كذا وبطالع كذا وبسبب كذا فلما حكم عليه هذا الإمكان وفقد قلبه في بعض المواطن عن وجود متقدم أولا عن وجود رحل عن ذلك الموطن رجاء حصول البغية هذا سبب اغترابهم عن الأوطان وأمثاله فإن بعضهم قد يفارق وطنه لما كان فيه من العزة فإذا رأى أنه قد زاد عزا بالزهد والتوبة أو لم يكن مذكورا فاشتهر بالتوبة والخير فأورثه عزا في قلوب الناس فوقع الإقبال عليه بالتعظيم فيفر ويغترب عن وطنه إلى مكان لا يعرف فيه لمعرفته بنفسه مع ربه فإن تعظيم الناس للشخص سم قاتل مؤثر فيه أثرا يؤديه إلى الهلاك وهذا أيضا من الأسباب المؤدية إلى مفارقة الموطن والاغتراب عن الأهل فحيث وجد قلبه مع الله أقام أخبرني شيخي أبو الحسين ابن الصائغ الزاهد المحدث بسبتة قال سمعت شيخنا أبا عبد الله محمد بن رزق رحمه الله في سياحة كنا معه فيها اقرأ عليه بعض أجزاء الحديث وكان صاحب رواية يقول مررت في سياحتي بمسجد خراب في فلاة من الأرض فقلت أدخل اركع فيه ركعتين فدخلته فوجدت قلبي فقعدت فيه سنتين فأين زمان ركعتين من سنتين فمطلوبهم بالغربة عن الأوطان وجود القلب مع الله فحيثما وجدوه قاموا في ذلك الموضع قال بعضهم كنت مارا إلى مكة فرأيت في الطريق شابا تحت شجرة وهو يصلي في البرية وحده فقلت له أ لا تمشي إلى مكة فقال لي كنت أسير إلى مكة عام أول فلما مررت بهذه الشجرة وجدت قلبي فلي هنا سنة لا أبرح من هذا الموضع إلا إن فقدت قلبي قال فبعد سنة مررت بذلك الموضع وبتلك الشجرة فلم أجد الشاب فمشيت غير بعيد فإذا بالشاب قائم يصلي فسلمت عليه فعرفني فقلت له رأيتك قد تركت تلك السمرة فقال لي لما فقدت قلبي أخذت في طريقي الذي نويت أولا أريد مكة فانتهيت إلى هذا الموضع فوجدت قلبي فإنا به أيضا مقيم فقلت له من أين طعامك وشرابك قال من عنده يجيئني به في الوقت الذي يريد أن يغذيني قال فتركته وانصرفت وما أدري ما انتهى إليه أمره بعد ذلك فقد يطلبون بالغربة وجود قلوبهم مع الله‏\n\n\n### [غربة العارفين‏]\n\n\nوأما غربة العارفين عن أوطانهم فهي مفارقتهم لإمكانهم فإن الممكن وطنه الإمكان فيكشف له أنه الحق والحق ليس وطنه الإمكان فيفارق الممكن وطن إمكانه لهذا الشهود ولما كان الممكن في وطنه الذي هو العدم مع ثبوت عينه سمع قول الحق له كن فسارع إلى الوجود فكان ليرى موجدة فاغترب عن وطنه الذي هو العدم رغبة في شهود من قال له كن فلما فتح عينه أشهده الحق أشكاله من المحدثات ولم يشهد الحق الذي سارع إلى الوجود من أجله وفي هذه الحال قلت‏\n\n\n> إذا ما بدا الكون الغريب لناظري *** حننت إلى الأوطان حن الركائب‏\n\n\nيقول فأردت الرجوع إلى العدم فإني أقرب إلى الحق في حال اتصافي بالعدم مني إليه في حال اتصافي بالوجود لما في الوجود من الدعوى وطلب حالة الفناء عن الحق للبقاء بالحق هو أن يرجع إلى حالة العدم التي كان عليها فهذه غربة أيضا موجودة واقعة عن وطن بغير اختيار العبد ومن غربة العارفين بالله غربتهم عن صفاتهم عند وجودهم الحق عين صفاتهم وهذه غربة حقيقية فإن الصفة مضافة إليهم بكلام الله وهو الصادق فهم أهل صفة ولكن ما هي تلك الصفة وإلى من تضاف حقيقة فإن العالم يضاف إلى الله بأنه عبد الله كما إن الله مضاف إلى العالم فإنه رب العالمين فإضافة العبد مستندة إلى إضافة الحق فأول غربة اغتربناها وجودا حسيا عن وطننا غربتنا عن وطن القبضة عند الإشهاد بالربوبية لله علينا ثم عمرنا بطون الأمهات فكانت الأرحام وطننا فاغتربنا عنها بالولادة فكانت الدنيا وطننا واتخذنا فيها أوطانا فاغتربنا عنها بحالة تسمى سفر أو سياحة إلى أن اغتربنا عنها بالكلية إلى موطن يسمى البرزخ فعمرناه مدة الموت فكان وطننا ثم اغتربنا عنه بالبعث إلى أرض الساهرة فمنا من جعلها وطنا أعني القيامة ومنا من لم يجعله وطنا فإنه ظرف زماني والإنسان في تلك الأرض كالماشي في سفره بين المنزلتين ويتخذ بعد ذلك أحد الموطنين إما الجنة وإما النار فلا يخرج بعد ذلك ولا يغترب وهذه هي آخر الأوطان آخر الأوطان التي ينزلها الإنسان ليس بعدها وطن مع البقاء الأبدي وأما قولهم في الغربة إنها الاغتراب عن الحال من النفوذ فيه فتلك غربة أخرى وذلك أن أصحاب الأحوال لا شك أن لهم النفوذ والتحكم وبها يكون خرق العوائد لهم المشهورة في العالم فإذا اطلعوا على إن الحال لا أثر له فيما ظهر له من الفعل عند قيامه بهم فيما أعطاه الكشف لم يرضوا به فاغتربوا عنه وقالوا الوقوف معه وبال على صاحبه فيرون أن الغربة عنه غاية السعادة وأنه من أعظم‏\nحجاب يحجب به الإنسان وأنه موضع المكر والاستدراج فإن العاقل لا يقف في مواطن إمكان المكر فيها بل ينبغي له أن لا يقف إلا في موضع يكون على بصيرة فيه كما فعل موسى في غربة الوطن فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ فاغترب بجسمه عن وطنه خوفا منهم فلو كان مثل خروج محمد صلى الله عليه وسلم من مكة إلى المدينة مهاجرا لم يكن خوفه منهم بل كان مشهوده خوفه من الله أن يسلطهم عليه فوهب له مع الرسالة التي كانت له قبل هجرته السيادة على العالمين فإن الهجرة كانت له مطلوبة وهي الاغتراب عن وطنه فعلامة صدق المريد في غربته عن وطنه حصول مقصوده فإذا لم يحصل فخلل في غربته إذا طلبه وجده فليس بصادق وإذا فارقه بالكلية ظاهرا وباطنا فلا بد من حصول المقصود فمن تعلق قلبه بوطنه في حال غربته فما اغترب الغربة المطلوبة وأما الغربة عن الحق التي هي من حقيقة الدهش عن المعرفة\n\n\n### [الوجوب والإمكان‏]\n\n\nفاعلم إن الإمكان موطنه غير موطن الوجوب بل هما موطنان للواجب والممكن وموطن الممكن العدم أو لا وهو موطنه الحقيقي فإذا اتصف بالوجود فقد اغترب عن وطنه بلا شك وكان في حال سكناه في وطنه مشاهدا للحق فإنه جار له إذ وصف العدم له أزلا وصف الوجود لله أزلا فاغترب عن وطنه بالوجود ففارق مجاورة الحق ولزم الحدوث بهذه الغربة والحق غير متصف بهذه الصفة ولم يتصف الحق بالحدوث أزلا في حال عدمه فاغترب عن الحق بحدوثه ولما حصل له الوجود الحادث ووقعت المشاركة في الوجود بينه وبين الحق دهش فإنه رأى ما لا يعرفه فإنه عرف نفسه متميزا عن الحق بحال العدم فلما فارق هذا الحال بالوجود أدركه الدهش عن المعرفة الأولى وهذه الغربة حال رجلين رجل لم يأنس بهذا المقام ولا وصل إليه بطريق استدراج وترق من حال إلى حال بل أتاه بغتة فجاءه ما لم يعهده ولا ألفه فرأى نفسه تضعف عن حمله فيخاف من عدم عينه فيدهش عن تحصيل تلك المعرفة ويرجع إلى حسه عاجلا فيتغرب عن الحق في تلك الرجعة ورأينا من أهل هذا المقام أبا العباس أحمد العصاد المعروف بمصر بالحريري وما رأينا غيره وأما الرجل الآخر فهو رجل ما من معرفة ترد عليه إلا وتدهشه لعظيم ما يرى مما هو أعلى مما حصل له وأمكن فيتغرب عن الحق الذي كان بيده ويحصل من هذه المعرفة حقا يقوم به إلى وقت تجل آخر يعطي فيه معرفة تدهشه لما ذكرناه فيتغرب أيضا عن الحق الذي حصل له في هذه المعرفة دائما أبدا دنيا وآخرة وأما العارفون المكملون فليس عندهم غربة أصلا وإنهم أعيان ثابتة في أماكنهم لم يبرحوا عن وطنهم ولما كان الحق مرآة لهم ظهرت صورهم فيه ظهور الصور في المرآة فما هي تلك الصور أعيانهم لكونهم يظهرون بحكم شكل المرآة ولا تلك الصور عين المرآة لأن المرآة ما في ذاتها تفصيل ما ظهر منهم وما هم فما اغتربوا وإنما هم أهل شهود في وجود وإنما أضيف إليهم الوجود من أجل حدوث الأحكام إذ لا تظهر إلا من موجود فمرتبة الغربة ليست من منازل الرجال فهي منزلة أدنى ينزلها المتوسطون والمريدون وأما الأكابر فما يرون أنه اغترب شي‏ء عن وطنه بل الواجب واجب والممكن ممكن والمحال محال فتعين وطن كل مستوطن ولو قامت غربة بهم لانقلبت الحقائق وعاد الواجب ممكنا والممكن واجبا والمحال ممكنا والأمر ليس كذلك والغربة عند العلماء بالحقائق في هذا المقام غير موجودة ولا واقعة والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## The Chapter Two Hundred and Thirty on Estrangement (الغربة)\n\nEstrange yourself from homelands, the spiritual state (الحال), and The Real (الحق),\nPerhaps you will attain the Matter (الأمر) in the Seat of Truth (مقعد الصدق).\n\nBe penetrating in every matter you seek,\nAnd do not be astonished if The Real comes to you with The Real.\n\nWere it not for the existence of the splitting (الفتق) in the earth and the heaven,\nThe celestial spheres would not revolve due to the intensity of the joining (الرتق).\n\nLikewise, the heavens of the intellects and their earth,\nBy which I mean the Nature (الطبع) that influences Creation (الخلق).\n\nSo they revolved with the spheres of the Powers, and then manifested\nTheir gnoses (معارفها) to those who hear through speech.\n\n### That Estrangement (الغربة) is the separation from the homeland in pursuit of the intended goal\n\nKnow that the term *al-Ghurba* (Estrangement) is used by the Sufi community (الطائفة) to mean separation from the homeland (الوطن) in pursuit of the intended goal (المقصود). They also use it for the estrangement of the spiritual state (الحال), saying that estrangement from the state comes from penetrating it (النفوذ فيه). And estrangement from The Real (الحق) is an estrangement from Gnosis (المعرفة) due to astonishment (الدهش).\n\nAs for their estrangement from homelands by leaving them, it is because they tend to rely on familiar habits (المألوفات), and this veils them from their intended goal, which they sought through repentance (التوبة) and which wakefulness (اليقظة) granted them. Yet, they are not aware of the Face of The Real (وجه الحق) in things. Thus, they imagine that their goal cannot be achieved except by leaving the homeland, and that The Real is outside their homelands.\n\nThis is what Abu Yazid al-Bistami did when he was in this station (المقام): he left Bistam in search of The Real. A man of God met him on the road and said, \"O Abu Yazid, what has taken you away from your homeland?\" He replied, \"The search for The Real.\" The man said to him, \"The One you seek, you left behind in Bistam.\" Abu Yazid was alerted and returned to Bistam, adhering to service until the opening (فتح) was granted to him, and what happened, happened.\n\nThese are the wanderers (السائحون). Allah made the wandering (*siyaha*) of this community (Ummah) to be *Jihad* (struggle) in the path of Allah.\n\nKnow that this matter is not by the servant's choice. Rather, the one concerned with this matter seeks the presence of his heart with his Lord in his state. If he does not find it in a place, he says, \"Perhaps Allah Almighty did not decree that He should manifest to my heart in this location.\" So he departs from it, hoping to attain his goal, knowing that Allah Almighty has arranged matters, and His eternal Knowledge (علمه أزلا) necessitated that such-and-such will only occur in such-and-such a place, under such-and-such a celestial influence, and due to such-and-such a cause. When this possibility (الإمكان) was decreed upon him, and he lost the presence of his heart in certain locations—whether from a prior presence or from no presence at all—he departed from that location hoping to achieve his desire.\n\nThis is the reason for their estrangement from homelands and similar reasons. Some may leave their homeland because of the honor (العزة) they possess there. If he sees that his honor has increased through asceticism (الزهد) and repentance, or if he was previously unknown but became famous for repentance and goodness, which resulted in honor in people's hearts, leading them to approach him with veneration, he flees and becomes estranged from his homeland to a place where he is unknown, due to his knowledge of himself in relation to his Lord. For the veneration of people toward a person is a deadly poison (سم قاتل) that affects him in a way that leads to destruction (الهلاك). This is also among the reasons leading to the separation from the dwelling place and estrangement from family. Wherever he finds his heart with Allah, he settles.\n\nMy Shaykh, Abu al-Husayn ibn al-Sa'igh, the ascetic traditionist in Ceuta, informed me, saying: I heard our Shaykh, Abu Abdullah Muhammad ibn Rizq (may Allah have mercy on him), during a journey (*siyaha*) we were on with him, while I was reading some parts of the Hadith to him—and he was a master of transmission—say: I passed during my wandering by a ruined mosque in a desolate land. I said, \"I will enter and pray two cycles of prayer (*rak'atayn*) in it.\" I entered it and found my heart present, so I sat there for two years. How far is the time of two cycles of prayer from two years!\n\nTheir goal in estrangement from homelands is the presence of the heart with Allah. Wherever they find it, they settle in that place.\n\nOne of them said: I was traveling to Mecca and saw a young man on the road under a tree, praying alone in the wilderness. I said to him, \"Will you not walk to Mecca?\" He replied, \"I was traveling to Mecca last year, but when I passed this tree, I found my heart, so I have been here for a year, and I will not leave this place unless I lose my heart.\" He said: A year later, I passed that place and that tree, but I did not find the young man. I walked a short distance and found the young man standing in prayer. I greeted him, and he recognized me. I said to him, \"I saw that you left that tree.\" He said to me, \"When I lost my heart, I resumed the path I had originally intended, seeking Mecca. I reached this place and found my heart, so I am settled here as well.\" I asked him, \"Where do your food and drink come from?\" He replied, \"They come to me from Him at the time He wishes to nourish me.\" He said: I left him and departed, and I do not know what became of him after that.\n\nThus, they may seek the presence of their hearts with Allah through estrangement.\n\n### The Estrangement of the Gnostics (العارفين)\n\nAs for the estrangement of the Gnostics from their homelands, it is their separation from their possibility (إمكانهم), for the possible (الممكن) has possibility as its homeland. It is unveiled to him that He is The Real (الحق), and The Real does not have possibility as His homeland. Thus, the possible separates from the homeland of its possibility due to this Witnessing (الشهود).\n\nWhen the possible was in its homeland, which is non-existence (العدم), along with the fixity of its essence (ثبوت عينه), it heard the saying of The Real, \"Be!\" (كن), and hastened to Existence (الوجود) so that it might see its Creator. It became estranged from its homeland, which is non-existence, desiring to witness the One who said, \"Be!\" But when it opened its eye, The Real showed it its forms among the originated things (المحدثات), and it did not witness The Real for whose sake it hastened to Existence. In this state, I said:\n\nWhen the strange cosmos appeared to my sight,\nI longed for the homelands, like the longing of riding beasts.\n\nHe says: I desired to return to non-existence, for I am closer to The Real in the state of being qualified by non-existence than I am to Him in the state of being qualified by Existence, due to the claim (الدعوى) inherent in Existence. The seeking of the state of Annihilation (الفناء) from The Real for the sake of Subsistence (البقاء) through The Real is to return to the state of non-existence upon which one was. This is also an existing estrangement, occurring from a homeland without the servant's choice.\n\nAmong the estrangements of the Gnostics of Allah is their estrangement from their attributes (صفاتهم) when they find The Real to be the very essence of their attributes. This is a true estrangement. For the attribute is ascribed to them by the Word of Allah, and He is the Truthful One, so they are people of attribute. But what is that attribute, and to whom is it truly ascribed? For the world (العالم) is ascribed to Allah as His servant (*'abd Allah*), just as Allah is ascribed to the world as the Lord of the Worlds (*Rabb al-'Alamin*). The ascription of the servant is based upon the ascription of The Real.\n\nThe first estrangement we experienced in sensory existence (وجودا حسيا) from our homeland was our estrangement from the homeland of the Grasp (القبضة) when the Lordship (الربوبية) of Allah was witnessed upon us. Then we inhabited the wombs of mothers, and the wombs were our homeland. We became estranged from them through birth. Then the world (الدنيا) became our homeland, and we took dwellings within it. We became estranged from these by a state called travel (*safar*) or wandering (*siyaha*), until we became completely estranged from the world to a dwelling called the Isthmus (البرزخ), which we inhabited during the period of death, and it became our homeland. Then we became estranged from it through the Resurrection (البعث) to the land of *al-Sahira*. Some of us make it a homeland—meaning the Day of Resurrection (القيامة)—and some do not, for it is a temporal container, and man in that land is like a traveler walking between two stations. After that, he takes one of two dwellings: either Paradise (الجنة) or the Fire (النار). He will not leave or become estranged after that. These are the final homelands that man settles in; there is no homeland after them, along with eternal Subsistence (البقاء الأبدي).\n\nAs for their saying regarding estrangement, that it is estrangement from the spiritual state (الحال) by penetrating it (النفوذ فيه), that is another estrangement. This is because the people of spiritual states undoubtedly possess penetration and control, and through this, the breaking of customary norms (*kharq al-'awa'id*) famous in the world occurs for them. When they realize, through the Unveiling (الكشف) granted to them, that the state has no effect on the act that appears when it arises in them, they are not satisfied with it, so they become estranged from it. They say that dwelling with it is a calamity (*wabal*) upon its possessor. They see that estrangement from it is the ultimate happiness, and that it is one of the greatest veils (حجاب) by which man is veiled, and that it is the place of cunning (*makr*) and gradual enticement (*istidraj*). For the rational person does not stop in places where cunning is possible. Rather, he should only stop in a place where he has clear insight (*basira*), as Moses did in the estrangement from his homeland: <<فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ>> (So I fled from you when I feared you, and my Lord granted me judgment and made me one of the Messengers).\n\nHe became estranged with his body from his homeland out of fear of them. Had it been like the departure of Muhammad (peace and blessings be upon him) from Mecca to Medina as a migrant (*muhajir*), his fear would not have been of them, but his witnessing (مشهوده) would have been fear of Allah allowing them to overpower him. Thus, along with the Messengership (الرسالة) he had before his migration, He granted him sovereignty over the worlds. For the migration was sought by him, and it is the estrangement from his homeland. The sign of the seeker's (*murid*) sincerity in his estrangement from his homeland is the attainment of his goal. If it is not attained, there is a defect (*khalal*) in his estrangement. If he seeks it and finds it, he is not sincere. But if he separates from it completely, outwardly and inwardly, the attainment of the goal is inevitable. Whoever's heart remains attached to his homeland during his estrangement has not achieved the required estrangement.\n\nAs for the estrangement from The Real (الحق), which stems from the reality of astonishment (الدهش) concerning Gnosis (المعرفة):\n\n### Necessity (الوجوب) and Possibility (الإمكان)\n\nKnow that the homeland of Possibility (الإمكان) is not the homeland of Necessity (الوجوب). Rather, they are two homelands: one for the Necessary (الواجب) and one for the possible (الممكن). The homeland of the possible is non-existence (العدم) primarily, and that is its true homeland. If it is qualified by Existence (الوجود), it has undoubtedly become estranged from its homeland. While dwelling in its homeland, it was witnessing The Real, for The Real was its neighbor, since the attribute of non-existence belonged to it eternally (أزلا), and the attribute of Existence belonged to Allah eternally.\n\nIt became estranged from its homeland through Existence, thus leaving the neighborhood of The Real and adhering to origination (الحدوث) through this estrangement. The Real is not qualified by this attribute, nor was The Real qualified by origination eternally during its non-existence. So it became estranged from The Real by its origination. When it attained originated Existence (الوجود الحادث) and participation in Existence occurred between it and The Real, it was astonished, for it saw what it did not know. It had known itself as distinct from The Real in the state of non-existence. When it left that state through Existence, astonishment overtook it, separating it from the first Gnosis.\n\nThis estrangement is the state of two types of men. The first is a man who was not familiar with this station (المقام) and did not reach it through gradual enticement (*istidraj*) or progression from one state to another, but rather it came to him suddenly. What came to him was something he had neither known nor been accustomed to. He saw himself too weak to bear it, feared the loss of his essence (*'ayn*), and became astonished, unable to attain that Gnosis. He quickly returned to his senses, thus becoming estranged from The Real in that return. We saw among the people of this station Abu al-Abbas Ahmad al-'Assad, known in Egypt as al-Hariri, and we have not seen anyone else.\n\nThe second man is one for whom no Gnosis comes to him except that it astonishes him, due to the greatness of what he sees, which is higher and more established than what he had attained. Thus, he becomes estranged from the Reality (الحق) that was in his possession. From this Gnosis, he attains a Reality by which he subsists until the time of another Theophany (تجل آخر) which grants him a Gnosis that astonishes him for the reason mentioned. Thus, he also becomes estranged from the Reality he attained in this Gnosis, perpetually, in this world and the Hereafter.\n\nAs for the Perfected Gnostics (العارفون المكملون), they have no estrangement whatsoever. They are Fixed Entities (الأعيان الثابتة) in their places; they have not departed from their homeland. Since The Real is a mirror for them, their forms appear in Him, just as images appear in a mirror. Those images are not their essences, because they appear according to the shape of the mirror, nor are those images the essence of the mirror, because the mirror does not contain within its Essence (الذات) the details of what appeared from them or what they are. Thus, they have not become estranged. Rather, they are people of Witnessing (شهود) within Existence (وجود). Existence is only ascribed to them due to the origination of rulings (حدوث الأحكام), since these rulings only appear from an existent thing.\n\nTherefore, the level (مرتبة) of estrangement is not among the stations of the Men (الرجال); it is a lower station inhabited by the intermediate seekers (المتوسطون) and the novices (المريدون). As for the Great Masters (الأكابر), they do not see that anything has become estranged from its homeland. Rather, the Necessary (الواجب) is Necessary, the possible (الممكن) is possible, and the impossible (المحال) is impossible. The homeland of every dweller is fixed. If estrangement were established for them, the Realities (الحقائق) would be inverted, and the Necessary would become possible, the possible Necessary, and the impossible possible. The matter is not so. Estrangement, according to the scholars of Realities (العلماء بالحقائق) in this station, is neither existent nor actual. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر دو سو تیس: غربت (الغربة) کے بیان میں\n\nوطن، حال (الحال)، اور ذات حق (الحق) سے غربت اختیار کر،\nشاید کہ تو مقامِ صدق (مقعد الصدق) میں امر (حقیقت) کو حاصل کر لے۔\n\nاور ہر اس امر میں نفوذ (گہرائی) حاصل کر جس کا تو ارادہ کرتا ہے،\nاور اگر ذات حق (الحق) تیرے پاس حق کے ساتھ آئے تو حیران (دہش) نہ ہو۔\n\nاگر زمین اور آسمان میں فتق (پھٹاؤ) کا وجود نہ ہوتا،\nتو رتق (بندش) کی شدت کے سبب افلاک گردش نہ کرتے۔\n\nاسی طرح عقلوں کے آسمان اور ان کی زمینیں ہیں،\nاور میرا مطلب اس سے وہ طبیعت ہے جو مخلوق میں اثر انداز ہوتی ہے۔\n\nپس وہ قوتوں کے افلاک کے ساتھ گردش کرتی ہیں، پھر انہوں نے\nاپنی معرفتیں (معارف) سننے والوں کے لیے کلام (نطق) کے ذریعے ظاہر کیں۔\n\n### [کہ غربت (الغربة) مقصود کی طلب میں وطن سے جدائی کا نام ہے]\n\nجان لو کہ اس طائفہ (صوفیاء) کے نزدیک غربت (الغربة) کا اطلاق کیا جاتا ہے اور اس سے مراد مقصود کی طلب میں وطن سے جدائی ہے۔ اور وہ اس کا اطلاق حال (الحال) کی غربت (الاغتراب) پر بھی کرتے ہیں، چنانچہ وہ غربت (الغربة) کے بارے میں کہتے ہیں کہ یہ حال (الحال) سے اس میں نفوذ (گہرائی) حاصل کرنے کی وجہ سے اجنبی ہو جانا ہے۔ اور ذات حق (الحق) سے غربت (الغربة) معرفت (المعرفۃ) سے حیرت (الدهش) کی وجہ سے اجنبی ہو جانا ہے۔\n\nجہاں تک ان کی اوطان سے جدائی کے ذریعے غربت (الغربة) کا تعلق ہے، تو یہ اس لیے ہے کہ ان کے اندر مانوس چیزوں کی طرف جھکاؤ پایا جاتا ہے، اور یہ چیز انہیں ان کے مقصود سے حجاب میں رکھتی ہے جسے انہوں نے توبہ کے ذریعے طلب کیا اور بیداری (الیقظۃ) نے انہیں عطا کی۔ اور وہ اشیاء میں ذات حق (الحق) کے چہرے کو نہیں پہچانتے، چنانچہ وہ یہ خیال کرتے ہیں کہ ان کا مقصود انہیں وطن سے جدائی کے بغیر حاصل نہیں ہو سکتا، اور یہ کہ ذات حق (الحق) ان کے اوطان سے باہر ہے۔\n\nجیسا کہ ابو یزید بسطامی نے کیا جب وہ اس مقام پر تھے، تو وہ ذات حق (الحق) کی طلب میں بسطام سے نکلے۔ راستے میں ان کی ملاقات اللہ کے ایک مرد سے ہوئی، تو انہوں نے ابو یزید سے کہا: اے ابو یزید! تمہیں تمہارے وطن سے کس چیز نے نکالا؟ انہوں نے کہا: ذات حق (الحق) کی طلب نے۔ اس مرد نے ان سے کہا: جسے تم تلاش کر رہے ہو، اسے تم بسطام میں چھوڑ آئے ہو۔ پس ابو یزید متنبہ ہوئے اور بسطام واپس لوٹے اور خدمت کو لازم پکڑا یہاں تک کہ ان پر کشف (الکشف) ہوا، پھر ان سے وہ کچھ ہوا جو ہوا۔ یہ لوگ سیاحت کرنے والے (السائحون) ہیں۔ پس اللہ تعالیٰ نے اس امت کی سیاحت کو اللہ کی راہ میں جہاد بنا دیا۔\n\nاور جان لو کہ یہ امر بندے کے اختیار سے نہیں ہے، بلکہ اس امر کا صاحب اپنے حال (الحال) میں اپنے رب کے ساتھ اپنے قلب (دل) کا وجود تلاش کرتا ہے۔ جب وہ اسے کسی جگہ نہیں پاتا تو کہتا ہے کہ شاید اللہ تعالیٰ نے اس جگہ میرے قلب پر ظہور الٰہی (التجلی) کو مقدر نہیں کیا، چنانچہ وہ وہاں سے کوچ کر جاتا ہے اس امید پر کہ اسے وہ چیز حاصل ہو جائے جو وہ جانتا ہے کہ اللہ تعالیٰ نے امور کو ترتیب دیا ہے اور اس کے ازلی علم کا تقاضا ہے کہ فلاں چیز فلاں جگہ، فلاں طالع کے ساتھ، اور فلاں سبب کے بغیر نہیں ہو سکتی۔ پس جب اس امکان (الإمكان) کا حکم اس پر غالب آیا اور اس نے بعض مقامات پر اپنے قلب کو وجودِ متقدم یا وجود (الوجود) سے خالی پایا، تو وہ اس مقام سے کوچ کر گیا تاکہ اپنی مراد حاصل کرے۔\n\nیہ ان کے اوطان سے غربت (الاغتراب) اختیار کرنے کا سبب ہے اور اس کی مثالیں ہیں۔ بعض لوگ اپنے وطن کو اس لیے چھوڑ دیتے ہیں کہ وہاں انہیں عزت حاصل تھی، پھر جب وہ دیکھتے ہیں کہ زہد اور توبہ کے ذریعے ان کی عزت بڑھ گئی ہے، یا وہ پہلے غیر معروف تھے لیکن توبہ اور نیکی کی وجہ سے مشہور ہو گئے، جس نے لوگوں کے دلوں میں ان کے لیے عزت پیدا کر دی اور تعظیم کے ساتھ ان کی طرف رجوع ہونے لگا، تو وہ بھاگ جاتے ہیں اور اپنے وطن سے کسی ایسی جگہ غربت (الاغتراب) اختیار کر لیتے ہیں جہاں انہیں کوئی نہ پہچانے، تاکہ وہ اپنے رب کے ساتھ اپنے نفس کی معرفت (المعرفۃ) حاصل کر سکیں۔ کیونکہ لوگوں کا کسی شخص کی تعظیم کرنا ایک زہر قاتل ہے جو اس پر ایسا اثر کرتا ہے جو اسے ہلاکت کی طرف لے جاتا ہے۔ یہ بھی وطن سے جدائی اور اہل و عیال سے غربت (الاغتراب) اختیار کرنے کے اسباب میں سے ہے۔ پس جہاں بھی اسے اپنا قلب اللہ کے ساتھ ملتا ہے، وہیں قیام کر لیتا ہے۔\n\nمجھے میرے شیخ ابو الحسین ابن الصائغ الزاہد المحدث نے سبتہ میں خبر دی، انہوں نے کہا کہ میں نے اپنے شیخ ابو عبد اللہ محمد بن رزق رحمۃ اللہ علیہ کو سنا، جب ہم ان کے ساتھ ایک سیاحت میں تھے اور میں انہیں حدیث کے کچھ اجزاء پڑھ کر سنا رہا تھا، اور وہ روایت کے صاحب تھے، وہ کہہ رہے تھے: میں اپنی سیاحت کے دوران زمین کے ایک بیابان میں ایک ویران مسجد کے پاس سے گزرا۔ میں نے کہا کہ میں داخل ہو کر دو رکعت نماز پڑھ لوں۔ میں اس میں داخل ہوا تو میں نے اپنا قلب (دل) وہاں پایا، چنانچہ میں دو سال تک وہیں بیٹھا رہا۔ پس دو رکعت کا وقت دو سال کے مقابلے میں کہاں؟\n\nپس اوطان سے غربت (الغربة) اختیار کرنے سے ان کا مقصود اللہ کے ساتھ قلب کا وجود ہے۔ چنانچہ جہاں بھی وہ اسے پاتے ہیں، اسی جگہ قیام کر لیتے ہیں۔ بعض نے کہا: میں مکہ کی طرف جا رہا تھا، تو میں نے راستے میں ایک نوجوان کو ایک درخت کے نیچے دیکھا جو اکیلا بیابان میں نماز پڑھ رہا تھا۔ میں نے اس سے کہا: کیا تم مکہ کی طرف نہیں چلتے؟ اس نے مجھ سے کہا: میں پچھلے سال مکہ کی طرف سفر کر رہا تھا، جب میں اس درخت کے پاس سے گزرا تو میں نے اپنا قلب یہاں پایا، چنانچہ مجھے یہاں ایک سال ہو گیا ہے، میں اس جگہ سے نہیں ہٹوں گا، مگر یہ کہ میں اپنا قلب کھو دوں۔ راوی نے کہا: ایک سال بعد میں اس جگہ اور اس درخت کے پاس سے گزرا تو مجھے وہ نوجوان نہیں ملا۔ میں تھوڑا آگے چلا تو وہ نوجوان کھڑا نماز پڑھ رہا تھا۔ میں نے اسے سلام کیا تو اس نے مجھے پہچان لیا۔ میں نے اس سے کہا: میں نے دیکھا کہ تم نے وہ درخت چھوڑ دیا ہے۔ اس نے مجھ سے کہا: جب میں نے اپنا قلب کھو دیا تو میں نے اپنے اس راستے پر چلنا شروع کر دیا جس کا میں نے پہلے ارادہ کیا تھا، یعنی مکہ کا ارادہ۔ میں اس جگہ پہنچا تو میں نے اپنا قلب یہاں پایا، چنانچہ میں یہاں بھی مقیم ہوں۔ میں نے اس سے کہا: تمہارا کھانا پینا کہاں سے آتا ہے؟ اس نے کہا: وہ (ذات حق) جس وقت مجھے غذا دینا چاہتا ہے، اس وقت اس کے پاس سے میرے لیے آ جاتا ہے۔ راوی نے کہا: میں اسے چھوڑ کر چلا گیا اور مجھے نہیں معلوم کہ اس کے بعد اس کا کیا انجام ہوا۔ پس وہ غربت (الغربة) کے ذریعے اپنے قلوب کا اللہ کے ساتھ وجود تلاش کرتے ہیں۔\n\n### [عارفین (العارفین) کی غربت (الغربة)]\n\nاور جہاں تک عارفین (العارفین) کی اپنے اوطان سے غربت (الغربة) کا تعلق ہے، تو وہ ان کا اپنے امکان (الإمكان) سے جدا ہو جانا ہے۔ کیونکہ ممکن (الممکن) کا وطن امکان (الإمكان) ہے۔ پس ان پر کشف (الکشف) ہوتا ہے کہ وہ ذات حق (الحق) ہے، اور ذات حق (الحق) کا وطن امکان (الإمكان) نہیں ہے۔ چنانچہ ممکن (الممکن) اس شہود (الشہود) کی وجہ سے اپنے امکان کے وطن سے جدا ہو جاتا ہے۔\n\nاور جب ممکن (الممکن) اپنے وطن میں تھا جو کہ عدم (العدم) ہے، اپنی عین (حقیقت) کے ثبوت کے ساتھ، تو اس نے ذات حق (الحق) کا قول سنا: \"ہو جا (کن)\"، پس وہ وجود (الوجود) کی طرف تیزی سے بڑھا تاکہ اپنے موجد (وجود بخشنے والے) کو دیکھے۔ چنانچہ اس نے اپنے وطن جو کہ عدم (العدم) تھا، سے غربت (الاغتراب) اختیار کی، اس ذات کے شہود (الشہود) کی رغبت میں جس نے اسے \"کن\" کہا تھا۔\n\nپس جب اس نے اپنی آنکھ کھولی تو ذات حق (الحق) نے اسے محدثات (نئی پیدا ہونے والی چیزوں) میں اس کی اپنی شکلیں دکھائیں، اور اس نے اس ذات حق (الحق) کا شہود (الشہود) نہیں کیا جس کی خاطر وہ وجود (الوجود) کی طرف تیزی سے بڑھا تھا۔ اور اسی حال میں میں نے کہا:\n\n> إذا ما بدا الكون الغريب لناظري *** حننت إلى الأوطان حن الركائب‏\n> **ترجمہ:** جب میری نظر کے سامنے یہ اجنبی کائنات ظاہر ہوئی، تو میں نے اپنے اوطان کی طرف اس طرح حنین (اشتیاق) کیا جیسے سواریاں کرتی ہیں۔\n\nوہ کہتا ہے: پس میں نے عدم (العدم) کی طرف لوٹنے کا ارادہ کیا، کیونکہ میں عدم (العدم) کی صفت سے متصف ہونے کی حالت میں ذات حق (الحق) سے زیادہ قریب ہوں بہ نسبت اس کے کہ میں وجود (الوجود) کی صفت سے متصف ہوں۔ کیونکہ وجود (الوجود) میں دعویٰ پایا جاتا ہے۔ اور ذات حق (الحق) سے فنا (الفناء) کی حالت طلب کرنا تاکہ ذات حق (الحق) کے ساتھ بقا (البقاء) حاصل ہو، اس کا مطلب یہ ہے کہ وہ اس عدم (العدم) کی حالت کی طرف لوٹ جائے جس پر وہ پہلے تھا۔ پس یہ بھی ایک غربت (الغربة) ہے جو موجود ہے اور واقع ہوتی ہے، اور یہ بندے کے اختیار کے بغیر وطن سے دوری ہے۔\n\nاور اللہ کے عارفین (العارفین) کی غربت (الغربة) میں سے ایک یہ ہے کہ جب وہ ذات حق (الحق) کو اپنی صفات کا عین پاتے ہیں تو وہ اپنی صفات سے اجنبی ہو جاتے ہیں۔ یہ ایک حقیقی غربت (الغربة) ہے۔ کیونکہ صفت ان کی طرف اللہ کے کلام کے ذریعے منسوب کی گئی ہے، اور وہ سچا ہے، پس وہ صفت والے ہیں، لیکن وہ صفت کیا ہے اور حقیقت میں کس کی طرف منسوب کی جاتی ہے؟ کیونکہ عالم (مخلوق) کو اللہ کی طرف منسوب کیا جاتا ہے کہ وہ اللہ کا بندہ ہے، جیسا کہ اللہ کو عالم کی طرف منسوب کیا جاتا ہے کہ وہ رب العالمین ہے۔ پس بندے کی نسبت ذات حق (الحق) کی نسبت پر مبنی ہے۔\n\nپس پہلی غربت (الغربة) جو ہم نے حسی وجود (وجوداً حسیاً) کے طور پر اپنے وطن سے اختیار کی، وہ ہماری اس قبضے کے وطن سے غربت تھی جب ہم پر اللہ کے لیے ربوبیت (الربوبیۃ) کا اقرار لیا گیا۔ پھر ہم نے ماؤں کے پیٹوں میں زندگی گزاری، پس رحم مادر ہمارا وطن تھا، تو ہم ولادت کے ذریعے اس سے اجنبی ہو گئے۔ پھر دنیا ہمارا وطن بنی اور ہم نے اس میں اوطان بنائے، تو ہم ایک ایسی حالت کے ذریعے اس سے اجنبی ہو گئے جسے سفر یا سیاحت کہا جاتا ہے، یہاں تک کہ ہم کلی طور پر ایک ایسے مقام کی طرف اجنبی ہو گئے جسے برزخ (البرزخ) کہا جاتا ہے۔ پس ہم نے موت کی مدت تک اس میں زندگی گزاری، تو وہ ہمارا وطن تھا۔ پھر ہم بعث (دوبارہ اٹھائے جانے) کے ذریعے اس سے اجنبی ہو کر ارض ساہرہ (قیامت کی زمین) کی طرف منتقل ہوئے۔ پس ہم میں سے بعض نے اسے وطن بنا لیا، یعنی قیامت کو، اور بعض نے اسے وطن نہیں بنایا، کیونکہ یہ ایک زمانی ظرف ہے۔ اور انسان اس زمین میں دو منزلوں کے درمیان اپنے سفر میں چلنے والے کی طرح ہے۔ اور اس کے بعد وہ دو مقامات میں سے کسی ایک کو اپنا وطن بنائے گا، یا تو جنت کو یا دوزخ کو۔ اس کے بعد وہ وہاں سے نہ نکلے گا اور نہ ہی اجنبی ہو گا۔ اور یہ آخری اوطان ہیں، آخری اوطان جن میں انسان اترتا ہے، اس کے بعد ابدی بقا (البقاء الأبدي) کے ساتھ کوئی وطن نہیں ہے۔\n\nاور جہاں تک غربت (الغربة) کے بارے میں ان کے اس قول کا تعلق ہے کہ یہ حال (الحال) سے اس میں نفوذ (گہرائی) حاصل کرنے کی وجہ سے اجنبی ہو جانا ہے، تو یہ ایک دوسری غربت ہے۔ اور وہ یہ ہے کہ اصحابِ احوال (أصحاب الأحوال) کو بلاشبہ نفوذ اور تصرف حاصل ہوتا ہے، اور اسی کے ذریعے دنیا میں ان کے لیے مشہور خرقِ عادات (معجزات) ظاہر ہوتے ہیں۔ پس جب انہیں کشف (الکشف) کے ذریعے یہ معلوم ہوتا ہے کہ حال (الحال) کا اس فعل میں کوئی اثر نہیں ہے جو ان کے ساتھ قائم ہونے پر ظاہر ہوا، تو وہ اس پر راضی نہیں ہوتے اور اس سے غربت (الاغتراب) اختیار کر لیتے ہیں اور کہتے ہیں کہ اس پر ٹھہرنا اس کے صاحب کے لیے وبال ہے۔ چنانچہ وہ دیکھتے ہیں کہ اس سے غربت (الغربة) اختیار کرنا سعادت کی انتہا ہے، اور یہ کہ یہ سب سے بڑا حجاب ہے جس سے انسان کو پردہ دیا جاتا ہے، اور یہ مکر (فریب) اور استدراج (تدریجی گرفت) کا مقام ہے۔\n\nکیونکہ عقل مند شخص ان مقامات پر نہیں ٹھہرتا جہاں مکر کا امکان ہو، بلکہ اسے چاہیے کہ وہ صرف اسی جگہ ٹھہرے جہاں وہ بصیرت پر ہو، جیسا کہ موسیٰ علیہ السلام نے وطن کی غربت (الغربة) میں کیا:\n**فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ**\n**ترجمہ:** \"پس جب مجھے تم سے ڈر لگا تو میں تم سے بھاگ گیا، پھر میرے رب نے مجھے حکم (حکمت) عطا فرمایا اور مجھے رسولوں میں شامل کر دیا\" (القرآن ۲۶:۲۱)۔\n\nپس انہوں نے اپنے جسم کے ساتھ ان کے خوف سے اپنے وطن سے غربت (الاغتراب) اختیار کی۔ اگر یہ محمد صلی اللہ علیہ وسلم کے مکہ سے مدینہ کی طرف ہجرت کرنے جیسا ہوتا، تو ان کا خوف ان سے نہ ہوتا، بلکہ ان کا شہود (الشہود) اللہ کا خوف ہوتا کہ کہیں وہ انہیں ان پر مسلط نہ کر دے۔ پس اللہ نے انہیں اس رسالت کے ساتھ جو ہجرت سے پہلے ان کے پاس تھی، عالمین پر سیادت (سرداری) بھی عطا فرمائی۔ کیونکہ ہجرت ان کے لیے مطلوب تھی، اور وہ اپنے وطن سے غربت (الاغتراب) ہے۔\n\nپس مرید کے اپنے وطن سے غربت (الغربة) میں سچا ہونے کی علامت اس کے مقصود کا حاصل ہو جانا ہے۔ اگر وہ حاصل نہ ہو تو اس کی غربت میں خلل ہے۔ اگر وہ اسے طلب کرے اور اسے پا لے تو وہ سچا نہیں ہے۔ اور اگر وہ ظاہری اور باطنی طور پر کلی طور پر اس سے جدا ہو جائے، تو مقصود کا حاصل ہونا ضروری ہے۔ پس جس کا دل غربت (الغربة) کی حالت میں اپنے وطن سے جڑا رہے، تو اس نے مطلوبہ غربت اختیار نہیں کی۔\n\nاور جہاں تک ذات حق (الحق) سے غربت (الغربة) کا تعلق ہے جو معرفت (المعرفۃ) سے حیرت (الدهش) کی حقیقت میں سے ہے:\n\n### [وجوب (الوجوب) اور امکان (الإمكان)]\n\nپس جان لو کہ امکان (الإمكان) کا وطن وجوب (الوجوب) کے وطن سے مختلف ہے، بلکہ یہ دونوں واجب (الواجب) اور ممکن (الممکن) کے لیے دو وطن ہیں۔ اور ممکن (الممکن) کا وطن پہلے عدم (العدم) ہے، اور یہی اس کا حقیقی وطن ہے۔ پس جب وہ وجود (الوجود) کی صفت سے متصف ہوا تو بلاشبہ اپنے وطن سے اجنبی ہو گیا۔\n\nاور اپنے وطن میں قیام کی حالت میں وہ ذات حق (الحق) کا مشاہدہ (مشاہد) کرنے والا تھا، کیونکہ وہ اس کا پڑوسی تھا، اس لیے کہ عدم (العدم) کی صفت ازل سے اس کے لیے تھی اور وجود (الوجود) کی صفت ازل سے اللہ کے لیے تھی۔ پس وہ وجود (الوجود) کے ذریعے اپنے وطن سے اجنبی ہو گیا، اور ذات حق (الحق) کی ہمسائیگی سے جدا ہو گیا اور اس غربت (الغربة) کے ذریعے حدوث (پیدا ہونے) کو لازم پکڑا۔ اور ذات حق (الحق) اس صفت سے متصف نہیں ہے، اور ذات حق (الحق) عدم (العدم) کی حالت میں ازل سے حدوث (الحدوث) سے متصف نہیں ہوا۔ پس وہ اپنے حدوث (الحدوث) کے ذریعے ذات حق (الحق) سے اجنبی ہو گیا۔\n\nاور جب اسے حادث وجود (الوجود الحادث) حاصل ہوا اور اس کے اور ذات حق (الحق) کے درمیان وجود (الوجود) میں شراکت واقع ہوئی، تو وہ حیران (دہش) ہو گیا، کیونکہ اس نے وہ دیکھا جسے وہ نہیں جانتا تھا۔ اس نے عدم (العدم) کی حالت میں خود کو ذات حق (الحق) سے ممتاز جانا تھا۔ پس جب اس نے وجود (الوجود) کے ذریعے اس حال کو چھوڑا تو پہلی معرفت (المعرفۃ) سے حیرت (الدهش) نے اسے آ لیا۔\n\nاور یہ غربت (الغربة) دو طرح کے لوگوں کا حال ہے: ایک وہ شخص جو اس مقام سے مانوس نہیں ہوا اور نہ ہی وہ استدراج (تدریجی گرفت) یا حال (الحال) سے حال کی طرف ترقی کے ذریعے یہاں پہنچا، بلکہ یہ اس پر اچانک آ گیا۔ پس اس کے پاس وہ چیز آئی جس کا اسے تجربہ نہیں تھا اور نہ ہی وہ اس سے مانوس تھا۔ چنانچہ اس نے دیکھا کہ وہ اسے اٹھانے سے کمزور پڑ رہا ہے، تو وہ اپنے عدم (العدم) کے خوف سے ڈرتا ہے اور اس معرفت (المعرفۃ) کے حصول سے حیران (دہش) ہو جاتا ہے اور جلدی سے اپنے حس (احساس) کی طرف لوٹ جاتا ہے، پس وہ اس رجعت میں ذات حق (الحق) سے اجنبی ہو جاتا ہے۔ ہم نے اس مقام کے اہل میں سے ابو العباس احمد العصاد کو دیکھا جو مصر میں حریری کے نام سے مشہور تھے، اور ہم نے ان کے علاوہ کسی اور کو نہیں دیکھا۔\n\nاور دوسرا شخص وہ ہے کہ اس پر جو بھی معرفت (المعرفۃ) وارد ہوتی ہے، وہ اسے حیران (دہش) کر دیتی ہے، اس عظیم چیز کی وجہ سے جو وہ دیکھتا ہے اور جو اس کے حاصل کردہ سے زیادہ بلند اور ممکن ہے۔ پس وہ اس ذات حق (الحق) سے اجنبی ہو جاتا ہے جو اس کے ہاتھ میں تھی، اور اس معرفت (المعرفۃ) سے ایک حق حاصل کرتا ہے جو اسے اگلے ظہور الٰہی (تجلی) کے وقت تک قائم رکھتا ہے، جس میں اسے ایسی معرفت عطا کی جاتی ہے جو اسے حیران (دہش) کر دیتی ہے، اس سبب سے جو ہم نے ذکر کیا، چنانچہ وہ ہمیشہ دنیا اور آخرت میں اس ذات حق (الحق) سے بھی اجنبی ہو جاتا ہے جو اسے اس معرفت میں حاصل ہوئی تھی۔\n\nاور جہاں تک کامل عارفین (العارفون المكملون) کا تعلق ہے، تو ان کے نزدیک غربت (الغربة) سرے سے موجود ہی نہیں ہے۔ وہ اپنی جگہوں پر ثابت شدہ اعیان (حقیقتیں) ہیں، وہ اپنے وطن سے نہیں ہٹے۔ اور چونکہ ذات حق (الحق) ان کے لیے آئینہ ہے، اس لیے ان کی صورتیں اس میں ظاہر ہوتی ہیں، جیسے آئینے میں صورتیں ظاہر ہوتی ہیں۔ پس وہ صورتیں نہ تو ان کی اعیان (حقیقتیں) ہیں، کیونکہ وہ آئینے کی شکل کے حکم کے مطابق ظاہر ہوتی ہیں، اور نہ ہی وہ صورتیں آئینے کا عین ہیں، کیونکہ آئینے کی ذات میں وہ تفصیل نہیں ہے جو ان سے ظاہر ہوئی ہے۔ پس وہ اجنبی نہیں ہوئے، بلکہ وہ وجود (الوجود) میں شہود (الشہود) والے ہیں۔ اور وجود (الوجود) کی نسبت ان کی طرف احکام کے حدوث (پیدا ہونے) کی وجہ سے کی گئی ہے، کیونکہ وہ موجود (موجود) کے بغیر ظاہر نہیں ہوتے۔\n\nپس غربت (الغربة) کا مرتبہ مردانِ حق (الرجال) کی منازل میں سے نہیں ہے، بلکہ یہ ایک ادنیٰ منزل ہے جس میں متوسطین اور مریدین قیام کرتے ہیں۔ اور جہاں تک اکابر کا تعلق ہے، تو وہ یہ نہیں دیکھتے کہ کوئی چیز اپنے وطن سے اجنبی ہوئی ہے، بلکہ واجب (الواجب) واجب ہے، ممکن (الممکن) ممکن ہے، اور محال (المحال) محال ہے۔ پس ہر وطن گیر کا وطن متعین ہے۔ اور اگر ان کے ساتھ غربت (الغربة) قائم ہو جاتی تو حقائق (الحقائق) پلٹ جاتے اور واجب (الواجب) ممکن بن جاتا، ممکن (الممکن) واجب بن جاتا، اور محال (المحال) ممکن بن جاتا، حالانکہ معاملہ ایسا نہیں ہے۔ اور حقائق (الحقائق) کے علماء کے نزدیک اس مقام پر غربت (الغربة) موجود نہیں ہے اور نہ ہی واقع ہوتی ہے۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ**\n**ترجمہ:** \"اور اللہ حق فرماتا ہے اور وہی سیدھی راہ دکھاتا ہے\" (القرآن ۳۳:۴)۔",
    "fa": "باب دویست و سی‌ام درباره غربت\n\nاز اوطان و حال و حق غربت گزین، باشد که امر را در جایگاه صدق (مقعد الصدق) به دست آوری.\nو در هر کاری که قصد می‌کنی، نافذ باش، و اگر حق با حق به سویت آمد، دچار دهشت مشو.\nو اگر گسست (فتق) در زمین و آسمان وجود نداشت، افلاک از شدت پیوستگی (رتق) نمی‌چرخیدند.\nهمچنین است آسمان‌های عقول و زمین‌های آن‌ها، و منظورم از آن، طبیعت تأثیرگذار در خلق است.\nپس به افلاک قوا چرخیدند و سپس معارف خود را برای شنوندگان از طریق نطق آشکار ساختند.\n\n### [اینکه غربت عبارت است از ترک وطن در طلب مقصود]\n\nبدان که طایفه (الطائفة) غربت را به کار می‌برند و منظورشان از آن، ترک وطن در طلب مقصود است. و آن را در غربت حال نیز به کار می‌برند و می‌گویند: غربت در حال، یعنی غربت از حال (الحال) به سبب نفوذ در آن. و غربت از حق (الحق)، غربت از معرفت (المعرفة) به سبب دهشت (الدهش) است. اما غربت آن‌ها از اوطان به سبب ترک آن‌ها، به دلیل تکیه کردنشان به امور مأنوس است؛ زیرا این امر آن‌ها را از مقصودی که با توبه طلب کرده‌اند و بیداری به آن‌ها عطا کرده، محجوب می‌سازد. و آن‌ها به وجه حق در اشیا عارف نیستند، پس گمان می‌کنند که مقصودشان جز با ترک وطن حاصل نمی‌شود و حق خارج از اوطان آن‌هاست. همان‌گونه که ابویزید بسطامی در این مقام چنین کرد؛ او برای طلب حق از بسطام خارج شد. در راه، مردی از رجال الله به او برخورد و گفت: ای ابویزید، چه چیز تو را از وطنت خارج کرده است؟ گفت: طلب حق. آن مرد به او گفت: آنچه را می‌طلبی، در بسطام ترک کرده‌ای. پس ابویزید متوجه شد و به بسطام بازگشت و ملازم خدمت شد تا اینکه برایش گشایش حاصل شد و آنچه باید، شد. اینان همان سالکان هستند. پس خداوند سیاحت این امت را جهاد در راه خدا قرار داد. و بدان که این امر به اختیار بنده نیست، بلکه صاحب این امر، وجود قلبش را با پروردگارش در حال خود می‌جوید. اگر آن را در جایی نیابد، می‌گوید: شاید خداوند متعال مقدر نکرده است که در این مکان بر قلب من ظاهر شود. پس از آنجا کوچ می‌کند به امید دستیابی به آنچه می‌داند؛ زیرا خداوند اموری را ترتیب داده و علم ازلی او اقتضا کرده است که فلان چیز جز در فلان مکان و با فلان طالع و به فلان سبب محقق نشود. پس چون این امکان (الإمكان) بر او حکمفرما شد و قلبش را در برخی مواطن از وجودی که پیش‌تر بود یا از وجودی که باید باشد، نیافت، به امید حصول مقصود از آن موطن کوچ کرد. این است سبب غربت آن‌ها از اوطان و امثال آن. برخی از آن‌ها ممکن است وطنش را ترک کند به دلیل عزتی که در آنجا داشت؛ زیرا اگر ببیند که با زهد و توبه عزتش افزون شده یا اگر قبلاً مشهور نبوده و با توبه و خیر مشهور شده و این امر در دل مردم برایش عزت ایجاد کرده و با تعظیم به او روی آورده‌اند، فرار می‌کند و از وطنش به مکانی که در آن شناخته شده نیست، غربت می‌گزیند؛ زیرا او به نفس خود در ارتباط با پروردگارش معرفت دارد. زیرا تعظیم مردم نسبت به شخص، سمی کشنده است که تأثیری در او می‌گذارد که او را به هلاکت می‌رساند. این نیز از اسبابی است که به ترک موطن و غربت از اهل می‌انجامد. پس هر جا قلبش را با خدا یافت، اقامت گزید. شیخم ابوالحسین ابن الصائغ، زاهد و محدث در سَبته، به من خبر داد که شنیدم شیخمان ابوعبدالله محمد بن رزق (رحمه الله) در سیاحتی که با او بودیم و من برخی اجزای حدیث را بر او می‌خواندم (و او صاحب روایت بود) می‌گفت: در سیاحتم از مسجدی مخروبه در بیابانی عبور کردم. گفتم: داخل شوم و دو رکعت نماز بخوانم. وارد شدم و قلبم را (آرام) یافتم. پس دو سال در آنجا نشستم. زمان دو رکعت نماز کجا و دو سال کجا! پس مقصود آن‌ها از غربت از اوطان، یافتن قلب با خداست. هر جا آن را یافتند، در آن موضع اقامت کردند. یکی از آن‌ها گفت: در راه مکه بودم. در مسیر، جوانی را زیر درختی دیدم که تنها در بیابان نماز می‌خواند. به او گفتم: آیا به سوی مکه نمی‌روی؟ گفت: سال گذشته به سوی مکه می‌رفتم. وقتی از کنار این درخت گذشتم، قلبم را یافتم. یک سال است که اینجا هستم و از این مکان جدا نمی‌شوم، مگر اینکه قلبم را گم کنم. گفت: پس از یک سال از آن موضع و آن درخت عبور کردم، اما آن جوان را نیافتم. کمی دورتر رفتم، ناگهان دیدم جوان ایستاده و نماز می‌خواند. به او سلام کردم، مرا شناخت. گفتم: دیدم آن درخت را ترک کرده‌ای. به من گفت: وقتی قلبم را گم کردم، راهی را که اول نیت کرده بودم، در پیش گرفتم و قصد مکه کردم. به این مکان رسیدم و قلبم را یافتم. پس من نیز در اینجا مقیم هستم. به او گفتم: خوراک و نوشیدنی‌ات از کجاست؟ گفت: از نزد او می‌آید و در زمانی که می‌خواهد مرا تغذیه کند، آن را برایم می‌آورد. گفت: او را ترک کردم و رفتم و نمی‌دانم سرانجام کارش به کجا انجامید. پس آن‌ها ممکن است با غربت، وجود قلبشان را با خدا طلب کنند.\n\n### [غربت عارفان]\n\nاما غربت عارفان (العارفين) از اوطانشان، ترک امکان (الإمكان) آن‌هاست؛ زیرا وطن ممکن (الممكن)، امکان است. پس برای او کشف (الکشف) می‌شود که او حق (الحق) است، و وطن حق، امکان نیست. پس ممکن به خاطر این شهود (الشهود)، وطن امکان خود را ترک می‌کند. و چون ممکن در وطنش که عدم (العدم) است، با ثبوت عینش قرار داشت، سخن حق را شنید که به او گفت: «باش» (کن). پس به سوی وجود (الوجود) شتافت و موجود شد تا موجِده (ایجادکننده) را ببیند. پس از وطنش که عدم بود، به رغبت شهود کسی که به او گفت «باش»، غربت گزید. اما وقتی چشم گشود، حق، اشکال محدثات را به او نشان داد و حق را که به خاطر او به سوی وجود شتافته بود، مشاهده نکرد. و در این حال گفتم:\n\n> چون کائنات غریب بر دیده‌ام آشکار شد، همچون شتران به اوطان (عدم) حنین (اشتیاق) بردم.\n\n(ابن عربی) می‌گوید: پس خواستم به عدم بازگردم؛ زیرا در حال اتصاف به عدم، به حق نزدیک‌ترم تا در حال اتصاف به وجود، به دلیل ادعایی که در وجود هست. و طلب حالت فنا (الفناء) از حق برای بقا (البقاء) به حق، این است که به حالت عدمی که بر آن بود، بازگردد. این نیز غربتی موجود و واقع شده از وطن است، بدون اختیار بنده. و از غربت عارفان بالله، غربت آن‌ها از صفاتشان است، هنگامی که حق را عین صفات خود می‌یابند. این یک غربت حقیقی است. زیرا صفت به واسطه کلام خدا که صادق است، به آن‌ها اضافه شده است. پس آن‌ها اهل صفت هستند، اما آن صفت چیست و در حقیقت به چه کسی اضافه می‌شود؟ زیرا عالم به خدا اضافه می‌شود به اینکه بنده خداست، همان‌گونه که خدا به عالم اضافه می‌شود به اینکه رب العالمین است. پس اضافه بنده مستند به اضافه حق است. اولین غربتی که ما از وطنمان به صورت وجود حسی غربت گزیدیم، غربت ما از وطن قبضه (قبضه الهی) بود، هنگامی که بر ربوبیت خداوند بر ما شهادت داده شد. سپس شکم مادران را آباد کردیم، پس رحم‌ها وطن ما بود. با ولادت از آن غربت گزیدیم. پس دنیا وطن ما شد و در آن اوطانی اختیار کردیم. با حالتی که سفر یا سیاحت نامیده می‌شود، از آن غربت گزیدیم تا اینکه به کلی از آن به موطنی که برزخ نامیده می‌شود، غربت گزیدیم. پس آن را در مدت مرگ آباد کردیم و وطن ما بود. سپس با بعث به سوی سرزمین ساهره (قیامت) از آن غربت گزیدیم. برخی از ما آن را وطن قرار دادند، یعنی قیامت را، و برخی آن را وطن قرار ندادند، زیرا آن یک ظرف زمانی است. و انسان در آن سرزمین مانند کسی است که در سفر خود بین دو منزل راه می‌رود. و پس از آن یکی از دو موطن را اختیار می‌کند: یا بهشت یا دوزخ. و پس از آن دیگر خارج نمی‌شود و غربت نمی‌گزیند. و این آخرین اوطان است؛ آخرین اوطانی که انسان در آن فرود می‌آید و پس از آن با بقای ابدی (البقاء الأبدي) وطنی نیست. اما قول آن‌ها درباره غربت که آن را اغتراب از حال (الحال) به سبب نفوذ در آن می‌دانند، آن غربتی دیگر است. و آن بدین سبب است که صاحبان احوال، بی‌شک نفوذ و تسلط دارند و به واسطه آن، خرق عادات مشهور در عالم برایشان رخ می‌دهد. پس هنگامی که آگاه می‌شوند که حال در فعلی که از آن‌ها ظاهر شده، هنگام قیام آن حال در آن‌ها، اثری ندارد (بر اساس آنچه کشف (الکشف) به آن‌ها داده است)، از آن راضی نمی‌شوند و از آن غربت می‌گزینند. و گفتند: توقف در آن، وبالی بر صاحبش است. پس غربت از آن را نهایت سعادت می‌دانند و اینکه آن از بزرگ‌ترین حجاب‌هایی است که انسان با آن محجوب می‌شود و موضع مکر و استدراج است. زیرا عاقل در مواطنی که امکان مکر در آن‌ها وجود دارد، توقف نمی‌کند، بلکه شایسته است که جز در موضعی که در آن بصیرت دارد، توقف نکند. همان‌گونه که موسی در غربت وطن انجام داد: **فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِي رَبِّي حُكْماً وجَعَلَنِي من الْمُرْسَلِينَ** (پس چون از شما ترسیدم، فرار کردم. آنگاه پروردگارم به من حکمتی بخشید و مرا از فرستادگان قرار داد). پس با جسمش از وطنش به دلیل ترس از آن‌ها غربت گزید. اما اگر مانند خروج محمد (صلی الله علیه و سلم) از مکه به مدینه به عنوان مهاجر بود، ترس او از آن‌ها نبود، بلکه مشهود او ترس از خدا بود که مبادا آن‌ها را بر او مسلط کند. پس خداوند به او علاوه بر رسالتی که قبل از هجرت داشت، سیادت بر عالمیان را بخشید؛ زیرا هجرت برای او مطلوب بود و آن غربت از وطنش بود. پس نشانه صدق مرید در غربت از وطنش، حصول مقصود اوست. اگر حاصل نشد، خللی در غربت اوست. اگر آن را طلب کند و بیابد، صادق نیست. و اگر به کلی از آن جدا شود، ظاهراً و باطناً، ناگزیر مقصود حاصل می‌شود. پس هر کس در حال غربت، قلبش به وطنش تعلق داشته باشد، غربت مطلوب را نگزیده است. و اما غربت از حق (الحق) که از حقیقت دهشت (الدهش) از معرفت (المعرفة) است:\n\n### [وجوب و امکان]\n\nپس بدان که موطن امکان (الإمكان) غیر از موطن وجوب (الوجوب) است، بلکه این دو موطن برای واجب (الواجب) و ممکن (الممكن) هستند. و موطن ممکن، در ابتدا عدم (العدم) است و آن موطن حقیقی اوست. پس هنگامی که به وجود (الوجود) متصف شد، بی‌شک از وطنش غربت گزیده است. و در حال سکونت در وطنش، شاهد حق بود؛ زیرا حق همسایه او بود، چرا که صفت عدم ازلاً برای او (ممکن) بود و صفت وجود ازلاً برای خدا بود. پس با وجود، از وطنش غربت گزید و از همسایگی حق جدا شد و به واسطه این غربت، ملازم حدوث گشت. و حق به این صفت متصف نیست و حق ازلاً در حال عدم ممکن، به حدوث متصف نشده بود. پس ممکن با حدوث خود از حق غربت گزید. و هنگامی که وجود حادث برای او حاصل شد و مشارکت در وجود بین او و حق واقع شد، دچار دهشت (الدهش) گشت؛ زیرا چیزی را دید که نمی‌شناخت. زیرا او خود را در حال عدم، متمایز از حق می‌دانست. پس هنگامی که با وجود از این حال جدا شد، دهشت از معرفت (المعرفة) اولی او را درگرفت. و این غربت، حال دو مرد است: مردی که به این مقام انس نگرفته و از طریق استدراج و ترقی از حالی به حالی دیگر به آن نرسیده، بلکه ناگهان به او رسیده است. پس چیزی به او رسید که با آن آشنا نبود و به آن الفت نگرفته بود. خود را در حمل آن ضعیف دید، پس از عدم عین خود ترسید و از تحصیل آن معرفت دچار دهشت شد و سریعاً به حس خود بازگشت و در آن بازگشت از حق غربت گزید. و ما از اهل این مقام، ابوالعباس احمد العصاد معروف به حریری در مصر را دیدیم و غیر از او ندیدیم. و اما مرد دیگر، کسی است که هیچ معرفتی بر او وارد نمی‌شود مگر اینکه او را دچار دهشت می‌سازد، به دلیل عظمت آنچه می‌بیند که بالاتر و ممکن‌تر از آن چیزی است که برایش حاصل شده است. پس از حقی که در دست داشت، غربت می‌گزیند. و از این معرفت، حقی را به دست می‌آورد که با آن قیام می‌کند تا زمان تجلی (التجلی) دیگری که در آن معرفتی به او عطا می‌شود که به دلیل آنچه ذکر کردیم، او را دچار دهشت می‌سازد. پس همیشه و ابداً، در دنیا و آخرت، از حقی که در این معرفت برایش حاصل شده بود، غربت می‌گزیند. اما عارفان (العارفون) کامل، اصلاً غربتی نزدشان نیست. آن‌ها اعیان ثابتی در مکان‌های خود هستند و از وطنشان جدا نشده‌اند. و چون حق (الحق) آینه‌ای برای آن‌ها بود، صور آن‌ها در آن ظاهر شد، همانند ظهور صور در آینه. پس آن صور، عین آن‌ها نیستند، زیرا آن‌ها به حکم شکل آینه ظاهر می‌شوند، و آن صور نیز عین آینه نیستند، زیرا آینه در ذات خود تفصیل آنچه از آن‌ها ظاهر شده و آنچه آن‌ها هستند، ندارد. پس آن‌ها غربت نگزیده‌اند، بلکه اهل شهود (الشهود) در وجود (الوجود) هستند. و وجود تنها به دلیل حدوث احکام به آن‌ها اضافه شده است، زیرا احکام جز از موجود ظاهر نمی‌شوند. پس مرتبه غربت از منازل رجال (کاملین) نیست، بلکه منزلتی پایین‌تر است که متوسطان و مریدان در آن فرود می‌آیند. اما اکابر، نمی‌بینند که چیزی از وطنش غربت گزیده باشد، بلکه واجب (الواجب)، واجب است و ممکن (الممكن)، ممکن است و محال، محال است. پس وطن هر مستوطنی معین شده است. و اگر غربتی در آن‌ها پدید می‌آمد، حقایق دگرگون می‌شد و واجب، ممکن می‌شد و ممکن، واجب و محال، ممکن می‌شد، در حالی که امر چنین نیست. و غربت نزد دانایان به حقایق در این مقام، موجود و واقع نیست. و خداوند **يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ** (حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 3
}