{
  "id": 423,
  "title": {
    "ar": "الباب الثالث والعشرون وأربعمائة في معرفة منازلة من غار علي لم يذكرني",
    "en": "Chapter Four Hundred and Twenty-Third: Regarding the Knowledge of the Spiritual Station (منزلة) of the one who envied me yet failed to mention me.",
    "ur": "باب چار سو تیئیس: اس شخص کے روحانی مقامات (منازل) کی معرفت میں جس نے مجھ سے حسد کیا اور میرا ذکر نہیں کیا۔",
    "fa": "باب چهارصد و بیست و سوم در معرفت منزلگاه کسی که بر من غیرت ورزید و مرا یاد نکرد"
  },
  "content": {
    "ar": "## «الباب الثالث والعشرون وأربعمائة في معرفة منازلة من غار علي لم يذكرني»\n\n\n> قلبي على كل حال في تقلبه *** من واحد العين لا كثر ولا عدد\n\n\n> إذا تنزلت الأسماء منه على *** منازل القلب لم يشعر بها أحد\n\n\n> مجهولة العين ما ينفك صاحبها *** في حيرة ما لها نقص ولا أمد\n\n\n> إن قلت إني وحيد قال لي جسدي *** أ ليس مركبك التركيب والجسد\n\n\n> فلا تقولن ما بالدار من أحد *** فالدار معمورة والساكن الصمد\n\n\n> وليس تخرب دار كان ساكنها *** من لا يقوم به غل ولا حسد\n\n\n### [ذكر الله على الطهارة]\n\n\nقال الله تعالى وما وَجَدْنا لِأَكْثَرِهِمْ من عَهْدٍ وإِنْ وَجَدْنا أَكْثَرَهُمْ لَفاسِقِينَ عن الوفاء بالعهد فإنا عهدنا إليهم أن يذكروني فأنفوا أن يذكروني إلا على طهارة كما\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم إني كرهت إن أذكر الله إلا على طهر أو قال على‏\nورأوا هؤلاء نفوسهم غير طاهرة لما فيها من الدعاوي في الخير الذي قام بهم من عند الله فينسبونه لأنفسهم وما أعطوا الله حقه من رد ذلك إليه كما فعل القليل من عباده إلى غير الدعاوي من الأمور التي لا تتصف النفوس بوجودها بالطهارة فهؤلاء غاروا إن يذكروا الله وهم الذين يذكرون الله سرا في نفوسهم وأما الذين يذكرونه علانية فإنهم شاهدوا قلوب العامة في غاية من الغفلة عن الله فقالوا إذا ذكرنا الله فيهم ذكروه فإنهم إذا سمعوا ذكر الله لم يتمكن لهم إلا أن يذكروه فيذكرونه بقلوب غافلة عما يجب لله من التعظيم فإذا كان مشهدهم هذا غاروا على الله فلم يذكروا وكان منهم الشبلي في أول حاله وغيره فما وفي هؤلاء بعهد الله ولا كانوا على معرفة من الله وهذا حال أكثر أهل الطريق ولا سيما أهل الورع منهم فخرجوا بهذا عن العهد الذي عهد إليهم الله من ذكره في قوله اذْكُرُوا الله ذِكْراً كَثِيراً وما قيد حالا من حال وهو قوله عليه السلام الحمد لله على كل حال فإن القلب وإن غفل عن الذكر الذي هو حضوره مع المذكور فإن الإنسان من كونه سميعا قد سمع ذكر الله من لسان هذا الذاكر فخطر بالقلب ووعى ما جاء به هذا الذاكر ولم يجي‏ء إلا بذكر اللسان الذي وقع بالسمع فجرد له هذا القلب ما يناسبه من الذاكرين منه وهو اللسان فذكر الله بلسانه موافقة لذكر ذلك الذاكر المذكر له والقلب مشغول في شأنه الذي كان فيه مع أنه لم يشتغل عن تحريك اللسان بالذكر فلم يشغله شأن عن شأن فما ذكر أحد الله عن غفلة قط وما بقي إلا حضور باستفراغ له أو حضور بغير استفراغ بل بمشاركة ولكن زمان أمره اللسان بالذكر ما هو زمان اشتغاله بغيره فما ذكره غافل قط أي عن غفلة في حال أمر القلب اللسان بالذكر إلا في حال ذكر اللسان‏\n\n\n### [اللسان أدى حق الله في العلانية]\n\n\nثم إن اللسان قد وفى حقه في العلانية من الذكر فإنه من الأشياء المسبحة لله فمن غار على الله لم يعرفه وإنما يغار له لا عليه وأما أهل هذه المنازلة فإنهم غاروا على الله أن يذكره غيره وهم أهل الدعاوي في الذكر وهم يشهدون أن الله هو الذاكر نفسه بلسان عبده فذكروه وهم يعلمون أنهم ما ذكروه مثل قوله إن الله قال على لسان عبده سمع الله لمن حمده وهو من جملة الذكر فرأوا إن الحق لسانهم في الذكر فلم يذكروه بهذا الشهود فصحت المنازلة\n\n\nبقوله من غار علي لم يذكرني‏\n\n\nلأنه عرف من الذاكر ومن المذكور فصار بمعزل عن الذكر في نفس الذكر وما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى‏\n\n\n### [إن تكثر الأسماء الإلهية يوجب اختلاف الآثار الظاهرة في الكون‏]\n\n\nثم إن الأسماء الإلهية ما كثرها الله إلا لاختلاف الآثار الظاهرة في الكون فإذا ذكره العارفون بالأسماء جعلوا الذكر لاسم ما من الأسماء وجعلوا المذكور اسما ما من الأسماء فكانت الأسماء يذكر بعضها بعضا فذلك الذكر ألسنة الأسماء ونحن وسائط فما ذكرناه إلا به ومن ذكرته به فلم تذكره أ لا ترى ذكر من أنعم الله عليه إذا أذكره بنعمته فذلك لسان نعمته وأنت من نعمته فما ذكره إلا إحسانه لا أنت فمن غار على الله لم يذكره مع أنه أكثر عباد الله ذكرا بالصورة ولا ذكر له بالحقيقة فهو عبد حق لأنه الذاكر الصامت والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 423: Concerning the Knowledge of the Station of Him Who Was Zealous Over Me and Therefore Did Not Remember Me\n\nMy heart, in every state of its turning, is from the One Essence (واحد العين), neither multiplicity nor number.\nWhen the Names (الأسماء) descend from Him upon the stations of the heart, no one perceives them.\nUnknown in Essence (مجهولة العين), its possessor remains in a bewilderment (حيرة) that has neither deficiency nor limit.\nIf I say, \"I am alone,\" my body replies to me, \"Is not your composition the structure and the body?\"\nSo do not say, \"There is no one in the dwelling,\" for the dwelling is inhabited and the Resident is the Eternal (الصمد).\nA dwelling shall not be ruined whose Resident is He in whom there is neither malice nor envy.\n\n### [Remembrance of Allah upon Purity]\n\nAllah the Exalted said: <<وَمَا وَجَدْنَا لِأَكْثَرِهِم مِّنْ عَهْدٍ ۖ وَإِن وَجَدْنَا أَكْثَرَهُمْ لَفَاسِقِينَ>> (And We found not for most of them any covenant; and indeed, We found most of them defiantly disobedient) concerning the fulfillment of the covenant. For We covenanted with them that they should remember Me, but they disdained to remember Me except upon purity (طهارة).\n\nJust as the Prophet, peace and blessings be upon him, said: \"I disliked remembering Allah except in a state of purity,\" or he said, \"upon purity.\"\n\nThese people considered their souls impure due to the claims (الدعاوي) they held regarding the good that arose in them from Allah, which they attributed to themselves. They did not give Allah His due right by returning that good to Him, as the few among His servants did, in addition to other claims concerning matters whose existence does not qualify the souls for purity.\n\nTherefore, these people were zealous (غاروا) about remembering Allah, and they are those who remember Allah secretly within their souls. As for those who remember Him publicly, they witnessed the hearts of the common people in the utmost state of heedlessness (غفلة) concerning Allah. So they said, \"If we remember Allah among them, they will remember Him.\" For when they hear the remembrance of Allah, they cannot help but remember Him, yet they remember Him with hearts heedless of the reverence due to Allah.\n\nWhen this was their witnessing (مشهدهم), they became zealous over Allah and thus did not remember Him. Among them was Al-Shibli in his early state, and others. These people did not fulfill the covenant of Allah, nor were they upon gnosis (معرفة) of Allah. This is the state of most people on the Path (أهل الطريق), especially those among them who practice scrupulous piety (الورع). By this, they departed from the covenant Allah entrusted to them concerning His remembrance in His saying: <<اذْكُرُوا اللهَ ذِكْراً كَثِيراً>> (Remember Allah with frequent remembrance). He did not restrict one state from another.\n\nThis is exemplified by his, peace be upon him, saying: \"Praise be to Allah in every state (على كل حال).\" For even if the heart is heedless of the remembrance, which is its presence with the One Remembered (المذكور), the human being, by virtue of being a hearer, has heard the remembrance of Allah from the tongue of this invoker. It occurred to the heart, and the heart comprehended what this invoker brought forth, and what came forth was nothing but the remembrance of the tongue that reached the hearing. So this heart singled out for it what was appropriate from the invokers belonging to it, which is the tongue. Thus, it remembered Allah with its tongue in agreement with the remembrance of that invoker who reminded it, while the heart was preoccupied with the affair it was engaged in, yet it was not preoccupied from moving the tongue with the remembrance. Thus, one affair did not distract it from another.\n\nNo one has ever remembered Allah out of sheer heedlessness (غفلة). What remains is either presence (حضور) with complete emptying (استفراغ) for Him, or presence without emptying, but rather through participation (بمشاركة). However, the time when the heart commands the tongue to remember is not the time when it is preoccupied with something else. Thus, no heedless person ever remembered Him—meaning, out of heedlessness—at the moment the heart commanded the tongue to remember, except during the actual remembrance by the tongue.\n\n### [The Tongue Fulfilled Allah's Right in Public]\n\nFurthermore, the tongue has fulfilled its right in public remembrance, for it is among the things that glorify Allah (المسبحة لله). Therefore, whoever is zealous *over* Allah (غار على الله) has not known Him. Rather, one should be zealous *for* Him, not *over* Him.\n\nAs for the people of this station (منازلة), they were zealous over Allah lest anyone other than Him should remember Him. They are the people of claims (الدعاوي) in remembrance. They witness that Allah is the One remembering Himself through the tongue of His servant, so they remembered Him while knowing that they did not remember Him. Like His saying that Allah spoke through the tongue of His servant, \"Allah hears the one who praises Him,\" which is part of remembrance.\n\nThey saw that the Real (الحق) was their tongue in remembrance, so they did not remember Him based on this witnessing (الشهود). Thus, the station is validated by His saying: \"He who was zealous over Me did not remember Me.\" Because he knew who the invoker (الذاكر) was and who the One Remembered (المذكور) was, he became isolated from the remembrance in the remembrance itself: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَىٰ>> (And you did not throw when you threw, but Allah threw).\n\n### [The Multiplicity of Divine Names Necessitates the Difference in Manifested Effects in the Cosmos]\n\nFurthermore, Allah only multiplied the Divine Names (الأسماء الإلهية) due to the difference in the effects (الآثار) manifested in the Cosmos (الكون). When the Gnostics (العارفون) remember Him through the Names, they assign the act of remembrance (الذكر) to one Name and the One Remembered (المذكور) to another Name. Thus, the Names remember one another. That remembrance is the tongues of the Names, and we are merely intermediaries (وسائط).\n\nWe only remember Him through Him. And if you remember Him through Him, then you have not remembered Him. Do you not see the remembrance of the one upon whom Allah bestowed grace? When He causes him to remember Him through His grace, that is the tongue of His grace, and you are part of His grace. Thus, only His beneficence remembers Him, not you.\n\nTherefore, he who was zealous over Allah did not remember Him, even though he is, in form (بالصورة), the most frequent of Allah’s servants in remembrance. Yet, in reality (بالحقيقة), he has no remembrance, for he is the true servant (عبد حق) because he is the silent invoker. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو تئیس: اس شخص کے مقام کی معرفت میں جس نے مجھ پر غیرت کھائی اور میرا ذکر نہیں کیا\n\nمیرا قلب ہر حال میں اپنی تبدیلی میں ہے، اُس واحد عین (واحد العین) سے، نہ کثرت ہے اور نہ عدد۔\n\nجب اسماء الٰہیہ (الأسماء) اُس سے قلب کے مقامات پر نازل ہوتے ہیں، تو کوئی بھی اُسے محسوس نہیں کرتا۔\n\nوہ عین (العین) میں مجہول ہے، اس کا صاحب ہمیشہ ایک ایسی حیرت میں رہتا ہے جس کی نہ کوئی کمی ہے اور نہ کوئی انتہا۔\n\nاگر میں کہوں کہ میں اکیلا ہوں، تو میرا جسم مجھ سے کہتا ہے: کیا تیرا مرکب، ترکیب اور جسم نہیں ہے؟\n\nپس ہرگز یہ نہ کہنا کہ گھر میں کوئی نہیں ہے، کیونکہ گھر آباد ہے اور اس کا مکین الصمد (الصمد) ہے۔\n\nاور وہ گھر کبھی ویران نہیں ہوتا جس کا مکین وہ ہو جس میں نہ کوئی کینہ ہو اور نہ کوئی حسد۔\n\n### [طہارت پر ذکر الٰہی]\n\nاللہ تعالیٰ نے فرمایا: \"اور ہم نے ان میں سے اکثر میں کوئی عہد (عَهْدٍ) نہیں پایا، اور ہم نے ان میں سے اکثر کو فاسق (فاسِقِينَ) پایا۔\" (سورۃ الاعراف، ۷:۱۰۲) یعنی عہد کی پاسداری سے فاسق۔ کیونکہ ہم نے ان سے عہد لیا تھا کہ وہ میرا ذکر کریں گے، لیکن انہوں نے اس بات سے انکار کیا کہ وہ میرا ذکر طہارت کے بغیر کریں۔ جیسا کہ\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"میں نے ناپسند کیا کہ میں اللہ کا ذکر کروں مگر طہارت پر۔\" یا فرمایا: \"پر۔\"\n\nاور ان لوگوں نے اپنے نفوس کو غیر طاہر سمجھا کیونکہ ان میں ان دعووں کی آمیزش تھی جو اس خیر کے بارے میں تھے جو اللہ کی طرف سے ان کے ساتھ قائم ہوا تھا، مگر وہ اسے اپنی طرف منسوب کرتے ہیں۔ اور انہوں نے اللہ کو اس کا حق نہیں دیا کہ وہ اس خیر کو اللہ کی طرف لوٹا دیں، جیسا کہ اس کے کم بندوں نے کیا۔ اس کے علاوہ دیگر دعوے بھی ہیں جن کے وجود سے نفوس طہارت (الطهارة) سے متصف نہیں ہوتے۔ پس ان لوگوں نے اللہ کا ذکر کرنے پر غیرت کھائی، اور یہ وہ لوگ ہیں جو اللہ کا ذکر اپنے نفوس میں پوشیدہ طور پر کرتے ہیں۔ لیکن جو لوگ علانیہ ذکر کرتے ہیں، انہوں نے عام لوگوں کے قلوب کو اللہ سے غفلت (الغفلة) کی انتہا پر دیکھا۔ تو انہوں نے کہا کہ اگر ہم ان میں اللہ کا ذکر کریں گے تو وہ بھی ذکر کریں گے۔ کیونکہ جب وہ اللہ کا ذکر سنتے ہیں تو ان کے لیے ممکن نہیں ہوتا کہ وہ ذکر نہ کریں، پس وہ ذکر کرتے ہیں لیکن ایسے قلوب سے جو اللہ کے لیے واجب تعظیم سے غافل ہوتے ہیں۔ جب ان کا مشاہدہ (الشہود) یہ تھا، تو انہوں نے اللہ پر غیرت کھائی اور ذکر نہیں کیا۔ ان میں شبلی بھی اپنی ابتدائی حالت میں شامل تھے اور دیگر بھی۔ پس ان لوگوں نے اللہ کے عہد کو پورا نہیں کیا اور نہ ہی وہ اللہ کی معرفت (المعرفۃ) پر تھے۔ اور یہی حال اکثر اہل طریق کا ہے، خاص طور پر ان میں سے اہل ورع کا۔ اس طرح وہ اس عہد سے باہر ہو گئے جو اللہ نے ان سے اپنے ذکر کے بارے میں لیا تھا، جیسا کہ اس کے اس قول میں ہے: \"اللہ کا ذکر کثرت سے کرو۔\" (سورۃ الاحزاب، ۳۳:۴۱) اور اس نے کسی حال کو دوسرے حال سے مقید نہیں کیا، جیسا کہ نبی علیہ السلام کا قول ہے: \"الحمد للہ علی کل حال (ہر حال میں اللہ کے لیے حمد ہے)۔\" کیونکہ اگرچہ قلب اس ذکر سے غافل ہو جائے جو مذکور (المذکور) کے ساتھ اس کی حاضری ہے، لیکن انسان، چونکہ وہ سننے والا ہے، اس ذاکر (الذاکر) کی زبان سے اللہ کا ذکر سنتا ہے، تو وہ قلب میں خطور کرتا ہے اور اس ذاکر کی لائی ہوئی بات کو محفوظ کر لیتا ہے۔ اور وہ بات صرف زبان کے ذکر سے آئی جو کانوں میں پڑی۔ پس اس قلب نے اس کے لیے ذاکرین میں سے جو چیز اس کے مناسب تھی، یعنی زبان، اسے الگ کر لیا۔ پس اس نے اپنی زبان سے اللہ کا ذکر کیا، اس ذاکر کے ذکر کی موافقت میں جس نے اسے یاد دلایا، حالانکہ قلب اپنے اس کام میں مشغول تھا جس میں وہ پہلے تھا، اس کے باوجود وہ زبان کو ذکر کے لیے حرکت دینے سے مشغول نہیں ہوا۔ پس ایک کام نے اسے دوسرے کام سے مشغول نہیں کیا۔ لہٰذا کسی نے بھی اللہ کا ذکر غفلت (الغفلة) سے نہیں کیا، اور باقی صرف یہ رہا کہ یا تو مکمل توجہ کے ساتھ حاضری ہو، یا بغیر مکمل توجہ کے بلکہ صرف شرکت کے ساتھ حاضری ہو۔ لیکن جس وقت قلب نے زبان کو ذکر کا حکم دیا، وہ وقت اس کے کسی اور چیز میں مشغول ہونے کا وقت نہیں تھا۔ پس کسی غافل نے کبھی ذکر نہیں کیا، یعنی قلب کے زبان کو ذکر کا حکم دینے کی حالت میں غفلت سے ذکر نہیں کیا، سوائے زبان کے ذکر کی حالت میں۔\n\n### [زبان نے علانیہ طور پر اللہ کا حق ادا کیا]\n\nپھر یہ کہ زبان نے علانیہ ذکر میں اپنا حق پورا کر دیا، کیونکہ یہ ان چیزوں میں سے ہے جو اللہ کی تسبیح کرتی ہیں۔ پس جس نے اللہ پر غیرت کھائی، اس نے اللہ کو نہیں پہچانا۔ بلکہ غیرت اس کے لیے کھائی جاتی ہے، نہ کہ اس پر۔ لیکن اس مقام (المنازلۃ) کے لوگ، انہوں نے اللہ پر غیرت کھائی کہ کوئی دوسرا اس کا ذکر کرے۔ اور یہ ذکر میں دعوے کرنے والے لوگ ہیں۔ اور وہ یہ شہود (الشہود) کرتے ہیں کہ اللہ ہی اپنے بندے کی زبان سے اپنا ذکر کرنے والا ہے۔ پس انہوں نے ذکر کیا، حالانکہ وہ جانتے ہیں کہ انہوں نے ذکر نہیں کیا۔ جیسے کہ اس قول میں ہے کہ اللہ نے اپنے بندے کی زبان سے کہا: \"سمع اللہ لمن حمدہ (اللہ نے سن لیا جس نے اس کی حمد کی)\" اور یہ ذکر کے جملے میں سے ہے۔ پس انہوں نے دیکھا کہ ذکر میں ان کی زبان ذات حق (الحق) کی زبان ہے، لہٰذا انہوں نے اس شہود کی وجہ سے ذکر نہیں کیا۔ پس یہ مقام اس قول سے صحیح ثابت ہوا:\n\n\"جس نے مجھ پر غیرت کھائی، اس نے میرا ذکر نہیں کیا۔\"\n\nکیونکہ اس نے پہچان لیا کہ ذاکر (الذاکر) کون ہے اور مذکور (المذکور) کون ہے، پس وہ خود ذکر کے عین میں ذکر سے الگ ہو گیا۔ \"اور جب تم نے پھینکا تو تم نے نہیں پھینکا، بلکہ اللہ نے پھینکا۔\" (سورۃ الانفال، ۸:۱۷)\n\n### [اسماء الٰہیہ کی کثرت کائنات میں ظاہر ہونے والے آثار کے اختلاف کا سبب بنتی ہے]\n\nپھر یہ کہ اللہ نے اسماء الٰہیہ (الأسماء الإلهية) کو کثیر نہیں کیا مگر کائنات میں ظاہر ہونے والے آثار کے اختلاف کی وجہ سے۔ پس جب عارفین اسماء کے ذریعے اس کا ذکر کرتے ہیں، تو وہ ذکر کو اسماء میں سے کسی ایک اسم کے لیے قرار دیتے ہیں اور مذکور کو بھی اسماء میں سے کسی ایک اسم کے لیے قرار دیتے ہیں۔ پس اسماء ہی ایک دوسرے کا ذکر کرتے ہیں، اور یہ ذکر اسماء کی زبانیں ہیں، اور ہم صرف واسطے ہیں۔ پس ہم نے اس کا ذکر نہیں کیا مگر اسی کے ذریعے، اور جس کا ذکر تم نے اس کے ذریعے کیا، تو تم نے اس کا ذکر نہیں کیا۔ کیا تم نہیں دیکھتے کہ جس پر اللہ نے انعام کیا، جب میں اسے اس کی نعمت کے ذریعے یاد دلاتا ہوں، تو وہ اس کی نعمت کی زبان ہے۔ اور تم اس کی نعمت میں سے ہو، پس اس کا ذکر صرف اس کا احسان ہے، نہ کہ تم۔ پس جس نے اللہ پر غیرت کھائی، اس نے اس کا ذکر نہیں کیا، حالانکہ وہ صورت کے اعتبار سے اللہ کے بندوں میں سب سے زیادہ ذکر کرنے والا ہے، لیکن حقیقت (الحقیقۃ) میں اس کا کوئی ذکر نہیں۔ پس وہ حق کا بندہ ہے کیونکہ وہ خاموش ذاکر (الذاکر الصامت) ہے۔ اور اللہ حق (الْحَقَّ) کہتا ہے اور وہی راستہ دکھاتا ہے۔ (سورۃ الاحزاب، ۳۳:۴)",
    "fa": "باب چهارصد و بیست و سوم (۴۲۳) در معرفت مقام کسی که بر من (خدا) غیرت ورزید و مرا یاد نکرد\n\nقلب من در هر حالی در دگرگونی‌اش *** از واحدِ عین (حقیقت) است، نه کثرت و نه عدد\n\nهنگامی که اسماء (الهی) از او بر *** منازل قلب فرود آیند، هیچ‌کس آن را درنیابد\n\nعین (حقیقت) آن ناشناخته است، صاحبش پیوسته *** در حیرتی است که نه نقص دارد و نه پایانی\n\nاگر بگویم من یگانه‌ام، جسدم به من گوید *** آیا ترکیب و جسد، مرکب تو نیست؟\n\nپس مگو که در خانه کسی نیست *** زیرا خانه آباد است و ساکن آن صمد (خداوند بی‌نیاز)\n\nو خانه‌ای که ساکنش کسی باشد *** که کینه و حسد در او راه ندارد، ویران نمی‌شود\n\n### [ذکر خداوند بر طهارت]\n\nخداوند متعال فرمود: «و برای بیشترشان عهدی نیافتیم، و در حقیقت بیشترشان را فاسق یافتیم (وَما وَجَدْنا لِأَكْثَرِهِمْ من عَهْدٍ وإِنْ وَجَدْنا أَكْثَرَهُمْ لَفاسِقِينَ)» از وفای به عهد. زیرا ما با آنان عهد بستیم که مرا یاد کنند، اما آنان از اینکه مرا یاد کنند جز بر طهارت، سر باز زدند. چنانکه پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «من ناخوش داشتم که خدا را یاد کنم مگر بر طهارت (إني كرهت إن أذكر الله إلا على طهر)» یا فرمود: «بر...»\n\nاینان (گروهی از صوفیان) نفس‌های خود را غیر طاهر دیدند، به سبب ادعاهایی (الدعاوي) که در خیر برخاسته از جانب خدا در وجودشان داشتند و آن را به خود نسبت می‌دادند، و حق خداوند را در بازگرداندن آن به او ادا نکردند، چنانکه اندکی از بندگانش چنین کردند. علاوه بر این، امور دیگری نیز هست که نفوس با وجود آنها به طهارت متصف نمی‌شوند. پس اینان غیرت ورزیدند که خدا را یاد کنند. اینان کسانی هستند که خدا را در نهانِ نفوس خود یاد می‌کنند. اما کسانی که او را آشکارا یاد می‌کنند، مشاهده کردند که قلوب عوام در نهایت غفلت از خداست، پس گفتند: اگر ما خدا را در میان آنان یاد کنیم، آنان نیز او را یاد خواهند کرد. زیرا وقتی ذکر خدا را بشنوند، چاره‌ای جز یاد کردن او ندارند. پس او را با قلب‌هایی غافل از تعظیمی که برای خدا واجب است، یاد می‌کنند. هنگامی که مشاهده‌شان این بود، بر خدا غیرت ورزیدند و او را یاد نکردند. شبلی در ابتدای حالش و دیگران از این گروه بودند. پس اینان به عهد خدا وفا نکردند و بر معرفت (المعرفة) خدا نبودند. این حال بیشتر اهل طریقت است، به ویژه اهل ورع (پرهیزگاری) آنان. پس با این کار از عهدی که خداوند برای ذکرش با آنان بسته بود، خارج شدند، در آنجا که فرمود: «خدا را بسیار یاد کنید (اذْكُرُوا الله ذِكْراً كَثِيراً)». و هیچ حالی را از حال دیگر مقید نساخت، و این همان قول پیامبر (ص) است: «سپاس خدا را در هر حال (الحمد لله على كل حال)». زیرا قلب، اگرچه از ذکری که همان حضور با مذکور است غافل شود، اما انسان به دلیل شنوا بودن، ذکر خدا را از زبان این ذاکر شنیده است، پس آن ذکر به قلب خطور کرده و آنچه را که این ذاکر آورده است، درک کرده است. و این ذکر نیامده است مگر به واسطه ذکر زبانی که به گوش رسیده است. پس این قلب آنچه را که از ذاکرین با او مناسبت دارد، یعنی زبان، برای آن (ذکر) مهیا ساخت. پس خدا را با زبانش یاد کرد، در موافقت با ذکر آن ذاکرِ یادآورنده، در حالی که قلب مشغول کار خود بود که در آن قرار داشت. با این حال، از به حرکت درآوردن زبان برای ذکر غافل نشد. پس کاری او را از کار دیگر باز نداشت. هیچ‌کس خدا را از روی غفلت یاد نکرده است، و باقی نمی‌ماند مگر حضور با تخلیه (استفراغ) یا حضور بدون تخلیه، بلکه با مشارکت. اما زمان امر کردن زبان به ذکر، زمان اشتغال آن به غیر نیست. پس هیچ غافلی او را یاد نکرده است، یعنی از روی غفلت، در حالتی که قلب زبان را به ذکر امر می‌کند، مگر در حال ذکر زبان.\n\n### [زبان حق خداوند را در آشکارا ادا کرد]\n\nسپس، زبان حق خود را در آشکارا از ذکر ادا کرده است، زیرا زبان از جمله چیزهایی است که خداوند را تسبیح می‌گویند. پس کسی که بر خدا غیرت ورزد، او را نشناخته است. بلکه باید برای او غیرت ورزید، نه بر او. اما اهل این مقام، بر خدا غیرت ورزیدند که غیر او، او را یاد کند، و آنان اهل ادعاها (الدعاوي) در ذکر هستند. آنان شهود (الشهود) می‌کنند که خداوند خود، ذاکر خویش است به زبان بنده‌اش. پس او را یاد کردند در حالی که می‌دانستند که او را یاد نکرده‌اند. مانند این قول که خداوند بر زبان بنده‌اش فرمود: «خداوند سخن کسی را که او را ستایش کند، شنید (سمع الله لمن حمده)» که این خود از جمله ذکر است. پس آنان دیدند که حق (الحق) زبانشان در ذکر است، و با این شهود (الشهود) او را یاد نکردند. پس این مقام با این قول صحیح شد:\n\n«کسی که بر من (خدا) غیرت ورزید، مرا یاد نکرد (من غار علي لم يذكرني)»\n\nزیرا او ذاکر و مذکور را شناخت، پس در نفسِ ذکر، از ذکر کناره گرفت. «و تو پرتاب نکردی آنگاه که پرتاب کردی، بلکه خدا پرتاب کرد (وَما رَمَيْتَ إِذْ رَمَيْتَ ولكِنَّ الله رَمى)».\n\n### [کثرت اسماء الهی موجب اختلاف آثار ظاهری در هستی می‌شود]\n\nسپس، خداوند اسماء الهی (الأسماء الإلهية) را کثیر نساخت مگر برای اختلاف آثار ظاهری در هستی (الکون). پس هنگامی که عارفان (العارفون) او را با اسماء یاد می‌کنند، ذکر را برای اسمی از اسماء قرار می‌دهند و مذکور را اسمی از اسماء قرار می‌دهند. پس اسماء، یکدیگر را یاد می‌کنند. آن ذکر، زبان‌های اسماء است و ما واسطه‌ها (وسائط) هستیم. پس ما او را یاد نکردیم مگر به واسطه او. و کسی که تو او را به واسطه او یاد کنی، او را یاد نکرده‌ای. آیا نمی‌بینی ذکر کسی را که خداوند بر او نعمت داده است، هنگامی که او را به نعمتش یاد می‌کنم؟ آن، زبان نعمت اوست، و تو خود از نعمت او هستی. پس او را یاد نکرده است مگر احسان او، نه تو. پس کسی که بر خدا غیرت ورزد، او را یاد نمی‌کند، با اینکه او از نظر صورت، بیشترین بندگان خدا در ذکر است، اما در حقیقت (الحقیقة) ذکری برای او نیست. پس او بنده حق (الحق) است، زیرا او ذاکر خاموش است. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}