{
  "id": 291,
  "title": {
    "ar": "الباب الحادي والتسعون ومائتان في معرفة منزل صدر الزمان وهو الفلك الرابع من الحضرة المحمدية",
    "en": "Chapter Two Hundred and Ninety-One: Concerning the Knowledge (معرفة) of the Station (منزل) of the Forefront of Time (صدر الزمان), which is the Fourth Sphere (الفلك الرابع) of the Muhammadan Presence (الحضرة المحمدية).",
    "ur": "باب دو سو اکیانوے (۲۹۱) صدر الزمان کے منزل کی معرفت کے بیان میں، اور یہ الحضرة المحمدية کا چوتھا فلک ہے۔",
    "fa": "باب دویست و نود و یکم در معرفت منزل صدر الزمان، و آن فلک چهارم از حضرت محمدیه (الحضرة المحمدية) است."
  },
  "content": {
    "ar": "## «الباب الحادي والتسعون ومائتان في معرفة منزل صدر الزمان وهو الفلك الرابع من الحضرة المحمدية»\n\n\n> أقسمت بالدهر أن الدهر ليس له *** عين ولكنه للعقل معقول‏\n\n\n> فإن حلفت به فاحلف على عدم *** لا في وجود فإن الحنث تعطيل‏\n\n\n> واعلم بأن الذي لا أم تؤنسه *** ولا أب هو في الأحكام مبتول‏\n\n\n> إلا الذي رقيت فيه معارفه *** وكان عنه فذاك الشخص مقبول‏\n\n\n> كما الذي تاه في بحر وليس له *** هاد فذلك بالأهواء معلول‏\n\n\n> وإن نقلت إلى فقر بغير غنى *** فإنكم لدليل العقل مدلول‏\n\n\n### [إن الإنسان على صورة الإلهية]\n\n\nاعلم وفق الله الولي الحميم أن لكل شي‏ء صدرا ومعرفته في هذا الطريق من أرفع العلوم والمعارف إذ كان العالم وكل جنس على صورة الإنسان وهو آخر موجود وكان الإنسان وحده على الصورة الإلهية في ظاهره وباطنه وقد جعل الله له صدرا فما بين الحق والإنسان الذي له الآخرية وللحق الأولية صدور لا يعلم عددها إلا الله فلنعين منها بعض ما يصل إليه فهمك وما يمكن أن يقبله عقلك ونسكت عما لا يصل إليه فهمك ولا يقبله عقلك فلنبتدئ أولا بالأعلى وننزل إلى آخر درجة فنقول إن الصدر في الرتبة الثانية من كل صورة سواء كانت الصورة جنسية أو نوعية أو شخصية فصدر الواجبات الحياة الأزلية المنعوت بها الحق عز وجل وصدر الأسماء المؤثرة العالم وصدر صفات التنزيه نفي المثلية وصدر الأينيات العماء الذي ما فوقه هواء وما تحته هواء وصدر الوجود الممكنات وصدر الموجودات العقل الأول وصدر الدهر ما بين الأزل والأبد وصدر الزمان زمان قبول الهيولى للصورة وصدر الطبيعة كيفية الجسم الأول وصدر الكيفيات تعلق القدرة بالإيجاد وصدر الكميات تقسيم المعاني وصدر الأفلاك الكرسي وصدر العناصر الماء وصدر الليل مغيب الشفق الأحمر وصدر النهار إشراق الشمس لا شروقها وصدر المولدات الحيوان وصدر الإنسان معروف وصدر الأمة زمان إدريس وصدر هذه الأمة القرن الأول وصدر الدنيا وجود آدم وصدر الأيام يوم الإثنين وصدر الآخرة البعث وصدر البرزخ النوم وصدر النار الموبق وصدر الجنة النزول في المنازل منها وصدر العذاب والنعيم رؤية أسبابهما وصدر الدين فلان رسول الله‏\n\n\n### [أن لكل صدر قلبا]\n\n\nواعلم أن لكل صدر قلبا فما دام القلب في الصدر فهو أعمى لأن الصدر حجاب عليه فإذا أراد الله أن يجعله‏\nبصيرا خرج عن صدره فرأى فالأسباب صدور الموجودات والموجودات كالقلوب فما دام الموجود ناظرا إلى السبب الذي صدر عنه كان أعمى عن شهود الله الذي أوجده فإذا أراد الله أن يجعله بصيرا ترك النظر إلى السبب الذي أوجده الله عنده ونظر من الوجه الخاص الذي من ربه إليه في إيجاده جعله الله بصيرا فالأسباب كلها ظلمات على عيون المسببات وفيها هلك من هلك من الناس فالعارفون يثبتونها ولا يشهدونها ويعطونها حقها ولا يعبدونها وما سوى العارفين يعاملونها بالعكس يعبدونها ولا يعطون حقها بل يغصبونها فيما تستحقه من العبودية التي هي حقها ويشهدونها ولا يثبتونها فما تسمع أحدا من الناس إلا وهو يقول ما ثم إلا الله وينفي الأسباب فإذا أخذته بقوله أو نزلت به نازلة شاهد السبب وعمي عمن أثبته وكفر به وآمن بما نفاه فإذا اتفق لبعض الناس أن تلك النازلة ما ارتفعت بهذا السبب الذي استند إليه وانقطعت به الأسباب حينئذ يكفر بها ويرجع إلى الله خالق الأسباب فلم يدر بما ذا كفر ولا بما به آمن ولم يدر ما معنى السبب ولا غيره إذ لو علم إن السبب لا يصح إلا أن يكون عنه المسبب لعلم أن السبب الذي استند إليه في رفعه لهذه النازلة لم يكن سببها بوجه من الوجوه إذ لو كان سببها لرفعها وإنما كان ذلك السبب في منعه رفع النازلة سببا في رجوعه إلى الله في رفعها فلم يزل في المعنى تحت تأثير الأسباب فإن الأسباب محال رفعها وكيف يرفع العبد ما أثبته الله ليس له ذلك ولكن الجهل عم الناس فأعماهم وحيرهم وما هداهم والله يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ بالروح الموحى من أمر الله ف يَهْدِي به من يَشاءُ من عِبادِهِ فقد أثبت الهداية بالروح وهذا وضع السبب في العالم فالوقوف عند الأسباب لا ينافي الاعتماد على الله ولهذا جعل سبحانه الأسباب مسببات لأسباب غيرها من الأدنى حتى ينتهي فيها إلى الله سبحانه فهو السبب الأول لا عن سبب كان به نعم سبب الكون المرتبة لا الذات وسبب المرتبة الكون فسبب الكون في الإيجاد المرتبة وسبب المرتبة في المعرفة الكون فافهم‏\n\n\n### [كلما أضاء النهار للحركة وقعت الولادة للأشياء]\n\n\nفلما أضاء النهار للحركة وقعت الولادة للأشياء بها بها فطهرت الأعيان في عالم الحس غالبا وهبت الرياح في البحار فتلاطمت الأمواج وجرت السفن ورمت البحار ما فيها لتلاطم الأمواج ولما أظلم الليل للسكون سكنت الرياح وسكنت الأمواج وأمسك البحر ما فيه غالبا وظهرت الولادة في البرزخ فكانت الأحلام ورؤيا المبشرات والمفزعات كالصورة القبيحة والجميلة في صور المولدات في الحس من الأفعال والنشآت وأغلب وقوع هذا في صدر الليل وفي صدر النهار لأن الرياح لا نهب إلا بعد طلوع الشمس حينئذ تكون الرياح كما إن رياح النصر لا تهب إلا في صدر العشي وهو بعد الزوال ولهذا يستحب فيه القتال ولما كان الليل محلا للسكون والمسامرة ولا يبيت شخص إلا مع من يحبه ويسكن إليه غالبا ولا يسامر إلا من يأنس به لذلك كان الليل أصل المودة والرحمة حتى إن الذين تعذبهم الملوك لا تعذبهم إلا بالنهار غالبا وأما الليل فلا لأن المعذب يتعذب بالليل إذا عذب للسهر وعدم النوم والذي يلحقه فالليل زمان السكون والراحة والمعذب لا يريد أن يعذب نفسه فيترك العذاب إلى النهار الذي هو محل الحركة فأصل الود والمحبة موجود من الليل وضده موجود بالنهار ثم إن الغيبة أعني غيبة المحبوب عن المحب غيبة تعليم وتأديب لما تعطيه المحبة فإن المحب إذا كان صادقا في دعواه وابتلاه الله بغيبة محبوبه ظهرت منه الحركة الشوقية إلى مشاهدته فيصدق دعواه في محبته فيعظم منزلته وتتضاعف جائزته من التنعيم بمحبوبه فإن اللذة التي يجدها عند اللقاء أعظم من لذة الاستصحاب كحلاوة ورود الأمن على الخائف لا يقوي قوتها حلاوة الأمن المستصحب فهو يزيد به تضاعف النعيم ولهذا أهل الجنة في نعيم متجدد مع الأنفاس في جميع حواسهم ومعانيهم وتجليهم فهم في طرب دائمون فلهذا نعيمهم أعظم النعيم لتوقع الفراق وتوهم عدم المصاحبة ولجهل الإنسان بهذه المرتبة يطلب الاستصحاب والعالم يطلب استصحاب تجديد النعيم والفرق بين النعيمين حتى يقع الالتذاذ بنعيم جديد كما هو في نفس الأمر وإن لم يعرفه كل إنسان ولا شاهدته كل عين ولا عقل فهو متجدد مع الآنات في نفس الأمر وللجهل القائم بهذا الشخص لعدم مشاهدته التجديد في النعيم يقع الملل فلو ارتفع عنه هذا الجهل ارتفع الملل من العالم فالملل أقوى دليل على جهل الإنسان بالله في حفظ وجوده عليه وتجديد آلائه مع الأنفاس فالله يحققنا بالكشف الأتم والمشهد الأعم فما أشرف عين اليقين وما أسعد صاحب مشاهدة الأمور على ما هي عليه ولكن راعى‏\nالله سبحانه بهذا الجهل أصحاب الهموم فهو رحمة في حقهم فإنهم لو شاهدوا تحديدا لهم في كل زمان فرد لم يزل عذابه كبيرا عندهم وآلامه متضاعفة فلما حيل بينهم وبين هذه المشاهدة وتخيلوا أن الهم الأول هو الذي استصحبهم لم يقم عندهم مقام فجأته في الفعل وهان عليهم حمله للاستصحاب الذي تخيلوه رحمة من الله بهم وتخفيفا عنهم إلا في جهنم فإن أهلها مع الأنفاس يشاهدون تجديد العذاب وكلامنا إنما هو في هذه الدار الدنيا محل الحجاب إلا للعارفين فإن لهم مقام الآخرة في الدنيا فلهم الكشف والمشاهدة وهما أمران يعطيهما عين اليقين وهو أتم مدارك العلم فالعلم الحاصل عن العين له أعظم اللذات في المعلومات المستلذة فهم في الآخرة حكما وفي الدنيا حسا وهم في الآخرة مكانة وفي الدنيا مكانا ثم يتصل لهم ذلك بالآخرة من القبر إلى الجنة وما بينهما من منازل الآخرة وهو قوله تعالى لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وهي ما هم فيه من مشاهدة ما ذكرناه وفي الْآخِرَةِ من القبر إلى الجنة فهو نعيم متصل فهذا نعيم العارفين وليس لغيرهم هذا النعيم الدائم ثم إن الحق سبحانه وتعالى في هذا المنزل أمر عبده المعتنى به أن يكون مع خلقه كما كان الحق معه في مثل هذا المشهد وكل ما يؤدي إلى سعادتهم وذلك بالنصيحة والتبليغ ليس بيده من الأمر غير هذا فللعارف إيضاح هذا الطريق الموصل إلى هذا المقام والإفصاح عنه وليس بيده إعطاء هذا المقام فإن ذلك خاص بالله تعالى قال تعالى يا أَيُّهَا الرَّسُولُ بَلِّغْ فلما بلغ قيل له فَإِنَّما عَلَيْكَ الْبَلاغُ لَيْسَ عَلَيْكَ هُداهُمْ إِنَّكَ لا تَهْدِي من أَحْبَبْتَ ولكِنَّ الله يَهْدِي من يَشاءُ وما أحسن قوله في الحقائق وهُوَ أَعْلَمُ بِالْمُهْتَدِينَ فإن العلم أنما يتعلق بالمعلوم على ما هو المعلوم عليه وقال لَعَلَّكَ باخِعٌ نَفْسَكَ أَلَّا يَكُونُوا مُؤْمِنِينَ فوظيفة الرسل والورثة من العلماء إنما هي التبليغ بالبيان والإفصاح لا غير ذلك وجزاهم جزاء من أعطى ووهب والدال على الخير كفاعل الخير فإن الدلالة على الخير من الخير فيتضمن هذا المنزل من علم الاستناد والمستند إليه أعظم الاستنادات وهو الاستناد الإلهي وهو استناد الأسماء الإلهية إلى محال وجود آثارها لتعيين مراتبها واستناد المحال إلى الأسماء الإلهية لظهور أعيانها فهذا أعلى الاستنادات وأعلى المستندات إليها وقد رمينا بك على الطريق فأدرج عليه نازلا وصاعدا ومن هنا يعرف ما تخبط فيه الناس من تفضيل الفقر على الغني والغني على الفقر والخوض في هذه المسألة من الفضول الذي في العالم والجهل القائم به فإن الحالات تختلف والمنازل تختلف وكل حالة كمالها في وجود عينها فالله يقول أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فما تركت هذه الآية لأحد طريقا إلى الخوض في الفضول لمن فهمها وتحقق بها غير إن الفضول أيضا من خلق الله فقد أعطى الله الفضول خلقه ثُمَّ هَدى‏ أي بين أن من قام به الفضول فهو المعبر عنه بالمشتغل بما لا يعنيه وجهله بالأمر الذي يعنيه والفقر في عينه كامل الخلق لا قدم له في الغني والغني في حاله كامل الخلق لا قدم له في الفقر ولو تداخلت الأمور لكان الفقر عين الغني والغني عين الفقر إذ كان كل واحد منهما من مقومات صاحبه والضد لا يكون عين الضد وإن اجتمعا في أمر ما فلا يجتمع الغني والفقر أبدا فليس للفقر منزلة عند الله في وجوده وليس للغني منزلة عند العبد في وجوده فكما لا يقال الله أفضل من الخلق أو الخلق كذلك لا يقال الغني أفضل من الفقر أو الفقر أفضل من الغني فالفقر صفة الخلق والغني صفة الحق والمفاضلة لا تصح إلا فيمن يجمعهما جنس واحد ولا جامع بين الحق والخلق فلا مفاضلة بين الغني والفقر قال تعالى في الغني فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ وقال في الفقر يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ فمن قال بعد علمه بهذا الغني أفضل من الفقر أم الفقر أفضل كمن قال من أفضل الله أم الخلق وكفى بهذا جهلا من قائله وأما الذي بأيدي الناس الذي يسمونه غني فكيف يكون غني وأنت فقير إليه غير مستغن في غناك عن غناك فغناك عين فقرك وهذا على الحقيقة لا يسمى غنى فكيف تقع المفاضلة ما بين ما\n\n\nله وجود حقيقي وهو الفقر وبين ما ليس له وجود حقيقي وهو غناك وإذا سمي الإنسان غنيا فهو عبارة عن وجود السبب المؤثر عنده فيما له فيه غرض في الوقت فيكون بذلك السبب غنيا فيما يفتقر إليه لوجوده به فهو الفقير الذاتي في غناه العرضي وإذا لم يكن عنده وجود السبب المؤثر فيما افتقر إليه سمي فقيرا من غير غنى فالفقر له في الحالين معا لأن ذاته له في الحالين معا والأمر إذا كان على هذا فطلب المفاضلة جهل بين الوصف الحقيقي والإضافي العرضي ومما يتضمنه هذا المنزل ما يلزم العالم والمتعلم والسائل والمسئول فلنبين من ذلك طرفا لمسيس الحاجة إليه فإنه‏\nيقع من الناس في غالب الأوقات وذلك أن الجاهل إذا جاء ليسأل العالم في أمر لا يعلمه من الوجه الذي يسأل عنه ويعلم منه قدر الوجه الذي دعاه إلى السؤال عنه كمن سمع حسا من خلف حجاب فيعلم قطعا إن خلف الحجاب أمرا لا يدري ما هو أو لا يدري محل ذلك الحس ولعله ليس خلف ذلك الستر فيسأل من يعلم محل ذلك الستر هل خلفه ما يمكن أن يحس أم لا وإذا كان فما هو فيتصور السؤال من السائل عما لا يعلم لوجه ما معلوم عنده يتضمن ما لا يعلم إلا بعد السؤال عنه وعلى هذا المقام أورد بعض النظار أشكالا وبهذا القدر ينفصل عن ذلك الإشكال وليس كتابنا مما قصد به النسب الفكرية النظرية وإنما هو موضوع للعلوم الوهبية الكشفية فجرت العادة عند العلماء القاصرين عما ذكرناه أن المتعلم السائل إذا جاء ليسأل العالم عن أمر لا يعلمه فإن كانت المسألة بالنظر إلى حالة السائل عظيمة قال له لا تسأل عما لا يعنيك وهذا ليس قدرك وتقصر عن فهم الجواب على هذا السؤال وليس الأمر كذلك عندنا ولا في نفس الأمر وإنما القصور في المسئول حيث لم يعلم الوجه الذي تحتمله تلك المسألة بالنظر إلى هذا السائل فيعلمه به ليحصل له الفائدة فيما سأل عنه ويستر عنه الوجوه التي فيها مما لا يحتمله عقله ولا يبلغ إليه فهمه فيسر السائل بجواب العالم ويصير عالما بتلك المسألة من ذلك الوجه وهو وجه صحيح إن فات علمه للعالم الفهم الفطن فقد فاته من المسألة بقدر ذلك الوجه فاستوى الفهم الفطن مع الفدم في عدم استيعاب وجوه تلك المسألة فما سأل سائل قط في مسألة ليس فيه أهلية لقبول جواب عنها ولقد علمنا رسول الله صلى الله عليه وسلم من هذا الباب في تأديب الصحابة ما يتأدب به في ذلك وذلك‏\n\n\nأن رجلا جاء إلى رسول الله صلى الله عليه وسلم وهو بين ظهراني أصحابه فقال يا رسول الله إني أسألك عن ثياب أهل الجنة أ خلق تخلق أم نسيج تنسج فضحك الحاضرون من سؤاله فغضب رسول الله صلى الله عليه وسلم وقال أ تضحكون أن جاهلا سأل عالما يا هذا الرجل إنها تشقق عنها ثمر الجنة\n\n\nفأجابه بما أرضاه وعلم أصحابه الأدب مع السائل فأزال خجله وانقلب عالما فرحا وقال الله تعالى وأَمَّا السَّائِلَ فَلا تَنْهَرْ فعمم وإن كان المقصود في سبب نزولها السؤال في العلم لأنه تعليم لحال سابق كان لرسول الله صلى الله عليه وسلم وهو قوله ووَجَدَكَ ضَالًّا فَهَدى‏ أي حائرا فأبان لك عن الأمر فأما السائل إذا جاءك يسألك فإنما هو بمنزلتك حين كنت ضالا فلا تنهره كما لم أنهرك وبين له كما بينت لك كما قال له تعليما لحال سبق له في قوله أَ لَمْ يَجِدْكَ يَتِيماً فَآوى‏ فلم يذلك ولا طردك بالقهر ليتمك وكسرك فأما اليتيم إذا وجدته فلا تقهره والطف به وآوه وأحسن إليه‏\n\n\nقال رسول الله صلى الله عليه وسلم إن الله أدبني فحسن تأديبي‏\n\n\nفينبغي لنا أن نتبع الآداب الإلهية التي أدب الله سبحانه بها أنبياءه مثل هذا ومثل قوله لنوح إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ فرفق به في قوله أعظك لشيخوخته وكبر سنه ومخاطبة الشيوخ لها حد ووصف معلوم ومخاطبات الشباب لها حد معلوم وقال في حق محمد رسوله صلى الله عليه وسلم فَلا تَكُونَنَّ من الْجاهِلِينَ فأين ذلك اللطف من\n\n\nهذا القهر فذلك لضعف الشيخوخة وذا القوة الشباب وأين مرتبة الخمسين سنة من رتبة خمسمائة وأزيد فوقع الخطاب على الحالات في أول الرسل وهو نوح وفي آخرهم وهو محمد صلى الله عليه وسلم وعلى جميع الأنبياء ومن الآداب الإلهية كل ما ورد في القرآن من افعل كذا ولا تفعل كذا فانظره في القرآن تحط بالأدب الإلهي فاستعمله توفق إن شاء الله والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Two Hundred and Ninety-One concerning the Gnosis of the Level of the Zenith of Time (صدر الزمان), which is the Fourth Sphere of the Muhammadan Presence (الحضرة المحمدية)\n\nI swear by Time Absolute (الدهر) that Time Absolute has no specific essence (عين),\nBut it is intelligible (معقول) to the intellect (العقل).\n\nIf you swear by it, then swear upon non-existence (عدم),\nNot upon existence (وجود), for breaking the oath is nullification.\n\nKnow that he who is not comforted by a mother\nNor a father is cut off (مبتول) in the rulings.\n\nExcept for the one whose gnosis (معارفه) has ascended within him,\nAnd who was from Him, that person is accepted.\n\nJust as he who is lost in a sea and has no guide\nIs afflicted by caprices (الأهواء).\n\nAnd if you are transported to poverty (فقر) without richness (غنى),\nThen you are guided by the proof of the intellect.\n\n### [Indeed, Man is upon the Divine Form]\n\nKnow—may Allah grant success to the intimate friend (الولي الحميم)—that everything has a zenith (صدر), and the knowledge of this zenith is among the loftiest sciences and gnoses (المعارف) on this Path. This is because the World (العالم) and every genus is upon the form of the Human (الإنسان), who is the last existent thing, and the Human alone is upon the Divine Form (الصورة الإلهية) in his outward and his inward.\n\nAllah has appointed a zenith for him. Thus, between the Real (الحق) and the Human—who possesses posteriority (الآخرية)—and the Real—Who possesses anteriority (الأولية)—there are zeniths whose number none knows save Allah. Let us specify some of these that your understanding can reach and your intellect can accept, and we shall remain silent concerning what your understanding cannot reach and your intellect cannot accept.\n\nLet us begin first with the highest and descend to the last degree. We say that the zenith (الصدر) is in the second rank of every form, whether that form is generic, specific, or individual.\n\nThe zenith of the Necessities (الواجبات) is the Eternal Life (الحياة الأزلية) by which the Real, Exalted and Glorified, is described. The zenith of the Effective Names (الأسماء المؤثرة) is the World (العالم). The zenith of the Attributes of Transcendence (صفات التنزيه) is the negation of similitude (نفي المثلية). The zenith of the Where-nesses (الأينيات) is the Cloud ('Amā'), above which there is no air and below which there is no air. The zenith of Being (الوجود) is the Contingent Things (الممكنات). The zenith of the Existent Things (الموجودات) is the First Intellect (العقل الأول). The zenith of Time Absolute (الدهر) is what is between Pre-Eternity (الأزل) and Post-Eternity (الأبد). The zenith of Time (الزمان) is the time when Prime Matter (الهيولى) accepts the Form (الصورة). The zenith of Nature (الطبيعة) is the quality (كيفية) of the First Body (الجسم الأول). The zenith of the Qualities (الكيفيات) is the connection of Power (القدرة) with bringing into existence (الإيجاد). The zenith of the Quantities (الكميات) is the division of meanings (المعاني). The zenith of the Spheres (الأفلاك) is the Pedestal (الكرسي). The zenith of the Elements (العناصر) is Water (الماء). The zenith of the Night (الليل) is the disappearance of the red twilight (الشفق الأحمر). The zenith of the Day (النهار) is the illumination of the sun, not its rising. The zenith of the Generated Things (المولدات) is the Animal (الحيوان). The zenith of the Human (الإنسان) is known. The zenith of the Community (الأمة) is the time of Idris. The zenith of this Community is the first century. The zenith of the Lower World (الدنيا) is the existence of Adam. The zenith of the Days (الأيام) is Monday. The zenith of the Hereafter (الآخرة) is the Resurrection (البعث). The zenith of the Isthmus (البرزخ) is Sleep (النوم). The zenith of the Fire (النار) is the Destroyer (الموبق). The zenith of Paradise (الجنة) is the descent into its stations (المنازل). The zenith of Punishment (العذاب) and Bliss (النعيم) is the sight of their causes (أسبابهما). The zenith of the Religion (الدين) is \"So-and-so is the Messenger of Allah.\"\n\n### [That Every Zenith Has a Heart]\n\nKnow that every zenith (صدر) has a heart (قلب). As long as the heart is within the zenith, it is blind (أعمى), because the zenith is a veil (حجاب) over it. If Allah wills to make it seeing (بصيرا), it emerges from its zenith and sees.\n\nThus, the causes (الأسباب) are the zeniths of the existent things (الموجودات), and the existent things are like hearts. As long as the existent thing looks toward the cause from which it originated, it remains blind to the witnessing (شهود) of Allah, Who brought it into existence. If Allah wills to make it seeing, it abandons looking at the cause through which Allah brought it into existence, and looks instead through the specific aspect (الوجه الخاص) that comes from its Lord to it in its creation. Allah then makes it seeing.\n\nAll causes are darknesses (ظلمات) upon the eyes of the effects (المسببات), and in them, those who perish among mankind perish. The Gnostics (العارفون) affirm them [the causes] but do not witness them, and they give them their due right but do not worship them. Those other than the Gnostics treat them in reverse: they worship them but do not give them their due right; rather, they usurp from them the servitude (العبودية) that is their right, and they witness them but do not affirm them.\n\nYou hear no one among the people except that he says, \"There is nothing there but Allah,\" and he negates the causes. Yet, if you take him at his word, or if a calamity befalls him, he witnesses the cause and becomes blind to the One Who established it, disbelieving in Him and believing in what he negated. If it happens to some people that the calamity is not lifted by the cause upon which they relied, and the causes are cut off from them, then they disbelieve in the cause and return to Allah, the Creator of the causes. He does not know what he disbelieved in, nor what he believed in, nor does he know the meaning of the cause or anything else. For if he knew that the cause is only valid if the effect proceeds from it, he would know that the cause upon which he relied to lift this calamity was not its cause in any way. If it had been its cause, it would have lifted it. Rather, that cause, in preventing the lifting of the calamity, became a cause for his return to Allah for its lifting.\n\nThus, he remains essentially under the influence of the causes, for it is impossible to abolish the causes. How can the servant abolish what Allah has established? He does not have that power. But ignorance has covered the people, blinding and confusing them, and not guiding them. <<And Allah guides whom He wills to a straight path>> (وَالله يَهْدِي من يَشاءُ إِلى‏ صِراطٍ مُسْتَقِيمٍ) by the Spirit (الروح) revealed by Allah’s command. <<He guides thereby whom He wills of His servants>> (يَهْدِي به من يَشاءُ من عِبادِهِ). Thus, He established guidance through the Spirit, and this is the placement of the cause in the World (العالم).\n\nStopping at the causes does not contradict reliance upon Allah. For this reason, the Glorified One made causes effects (مسببات) for other causes, starting from the lowest, until they terminate in Allah, the Glorified. He is the First Cause (السبب الأول), not proceeding from any cause. Yes, the cause of the existence (الكون) is the Level (المرتبة), not the Essence (الذات). And the cause of the Level is the existence. Thus, the cause of existence in creation (الإيجاد) is the Level, and the cause of the Level in gnosis (المعرفة) is the existence. Understand this.\n\n### [Whenever the Day Illuminated for Movement, the Birth of Things Occurred]\n\nWhen the day illuminated for movement, the birth (الولادة) of things occurred through it. The essences (الأعيان) were purified, mostly in the sensory world (عالم الحس). The winds blew upon the seas, the waves crashed, the ships sailed, and the seas cast out what was within them due to the crashing waves.\n\nWhen the night darkened for stillness (السكون), the winds calmed, the waves subsided, and the sea mostly held what was within it. Birth appeared in the Isthmus (البرزخ), resulting in dreams and visions—the glad tidings and the terrifying ones—like the ugly and beautiful forms in the images of generated things in the sensory world, consisting of acts and formations.\n\nThe occurrence of this is mostly in the zenith of the night and the zenith of the day, because the winds do not blow until after sunrise; that is when the winds occur. Similarly, the winds of victory do not blow except in the zenith of the afternoon ('Ashiyy), which is after the zenith (Zawal), and for this reason, fighting is recommended during that time.\n\nSince the night is the locus of stillness and intimate conversation (المسامرة), and a person usually only spends the night with one he loves and finds rest in, and only converses intimately with one he feels affinity with, the night is therefore the origin of affection (المودة) and mercy (الرحمة). Even those whom kings punish are usually only punished during the day, but not the night. This is because the punisher himself suffers during the night if he punishes, due to sleeplessness and lack of rest. The night is the time for stillness and rest, and the punisher does not wish to punish himself, so he leaves the punishment until the day, which is the locus of movement. Thus, the origin of affection and love exists from the night, and its opposite exists during the day.\n\nFurthermore, absence—meaning the absence of the beloved from the lover—is an absence of teaching and discipline (تأديب) necessitated by love. If the lover is truthful in his claim, and Allah tests him with the absence of his beloved, the movement of yearning (الحركة الشوقية) to witness him appears from the lover. This confirms his claim of love, thereby magnifying his station and multiplying his reward in the enjoyment of his beloved. For the pleasure he finds upon meeting is greater than the pleasure of constant companionship, just as the sweetness of the arrival of security upon the fearful person is stronger than the sweetness of security that is constantly present. This increases the multiplication of bliss (النعيم).\n\nFor this reason, the people of Paradise are in bliss that is renewed with every breath, in all their senses, meanings, and theophanies (تجليهم). They are in perpetual ecstasy. Therefore, their bliss is the greatest bliss, due to the expectation of separation and the illusion of non-companionship. Due to man's ignorance of this level, he seeks constant companionship. But the Gnostic (العالم) seeks the companionship of renewed bliss and the difference between the two kinds of bliss, so that enjoyment of new bliss occurs, as is the case in reality (نفس الأمر). Even if not every person knows it, nor every eye witnesses it, nor every intellect grasps it, it is renewed with every instant in reality.\n\nDue to the ignorance inherent in this person, stemming from his failure to witness the renewal in bliss, boredom (الملل) occurs. If this ignorance were lifted from him, boredom would be lifted from the world. Boredom is the strongest proof of man's ignorance of Allah regarding His preservation of his existence and the renewal of His bounties (آلائه) with every breath.\n\nMay Allah realize us through the most perfect Unveiling (الكشف الأتم) and the most comprehensive Witnessing (المشهد الأعم). How noble is the Eye of Certainty (عين اليقين), and how fortunate is the one who witnesses things as they truly are!\n\nHowever, the Glorified Allah, through this ignorance, shows consideration for those afflicted by sorrows (أصحاب الهموم). This is a mercy for them. For if they witnessed their renewal in every single moment, their torment would perpetually seem great to them, and their pains multiplied. When a barrier was placed between them and this witnessing, and they imagined that the initial sorrow was the one that remained with them, it did not hold the same place for them as its sudden occurrence in action, and bearing it became easier for them due to the constant companionship they imagined—a mercy from Allah and a lightening of their burden.\n\nExcept in Hell, for its inhabitants witness the renewal of torment with every breath. Our discussion, however, concerns this worldly abode (الدار الدنيا), which is the locus of the veil (الحجاب), except for the Gnostics (العارفين). For them, the station of the Hereafter exists in this world. They possess Unveiling (الكشف) and Witnessing (المشاهدة), two matters granted by the Eye of Certainty (عين اليقين), which is the most perfect attainment of Knowledge (العلم). The knowledge obtained through the Eye possesses the greatest pleasures in the objects of knowledge that are enjoyed. Thus, they are in the Hereafter by ruling and in the world by sensation; they are in the Hereafter by station and in the world by place. This then connects for them to the Hereafter, from the grave to Paradise, and all the stations of the Hereafter in between. This is His saying, the Exalted: <<For them are glad tidings (البُشْرى) in the life of this world>> (لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا), which is the witnessing of what we have mentioned, <<and in the Hereafter>> (وفي الْآخِرَةِ), from the grave to Paradise. This is continuous bliss. This is the bliss of the Gnostics, and this perpetual bliss does not belong to anyone else.\n\nFurthermore, in this station, the Real, Glorified and Exalted, commanded His servant who is cared for (المعتنى به) to be with His creation, just as the Real was with him in such a witnessing, and to do everything that leads to their happiness. This is through sincere advice (النصيحة) and conveyance (التبليغ). Nothing else of the command is in his hands. Thus, the Gnostic must clarify this Path that leads to this station and articulate it clearly, but the granting of this station is not in his hands, for that belongs exclusively to Allah, the Exalted.\n\nThe Exalted said: <<O Messenger, convey>> (يا أَيُّهَا الرَّسُولُ بَلِّغْ). When he conveyed, it was said to him: <<Your duty is only the conveyance. Their guidance is not incumbent upon you>> (فَإِنَّما عَلَيْكَ الْبَلاغُ لَيْسَ عَلَيْكَ هُداهُمْ). <<Indeed, you do not guide whom you love, but Allah guides whom He wills>> (إِنَّكَ لا تَهْدِي من أَحْبَبْتَ ولكِنَّ الله يَهْدِي من يَشاءُ). And how excellent is His saying concerning the Realities (الحقائق): <<And He is most knowing of the guided ones>> (هُوَ أَعْلَمُ بِالْمُهْتَدِينَ). For Knowledge (العلم) only relates to the known thing (المعلوم) as the known thing truly is. And He said: <<Perhaps you will destroy yourself because they will not be believers>> (لَعَلَّكَ باخِعٌ نَفْسَكَ أَلَّا يَكُونُوا مُؤْمِنِينَ). Thus, the function of the Messengers and the inheritors among the scholars is only conveyance through clarification and articulation, nothing else. Their reward is the reward of one who gives and grants, for the one who points to good is like the one who does good, since pointing to good is part of good.\n\nThis station, therefore, encompasses the science of Reliance (الاستناد) and the Object of Reliance (المستند إليه), which is the greatest of all reliance: the Divine Reliance (الاستناد الإلهي). This is the reliance of the Divine Names (الأسماء الإلهية) upon the loci of the existence of their effects (آثارها) in order to define their levels (مراتبها), and the reliance of the loci upon the Divine Names for the manifestation of their essences (أعيانها). This is the highest form of reliance and the highest object of reliance.\n\nWe have now cast you upon the Path, so proceed upon it, descending and ascending. From this, one understands the confusion into which people have fallen regarding the preference of poverty (الفقر) over richness (الغني) or richness over poverty. Delving into this issue is among the superfluous matters (الفضول) present in the world and the ignorance inherent in it. For the states (الحالات) differ, and the stations (المنازل) differ, and the perfection of every state lies in the existence of its essence. Allah says: <<He gave everything its creation>> (أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ). This verse leaves no path for anyone to delve into superfluous matters, provided he understands it and realizes it. However, superfluousness is also part of Allah’s creation. Allah gave superfluousness its creation, <<then guided>> (ثُمَّ هَدى‏), meaning He clarified that the one characterized by superfluousness is described as being occupied with what does not concern him, and ignorant of the matter that does concern him.\n\nPoverty (الفقر), in its essence, is complete in creation; it has no precedence in richness (الغني). And richness, in its state, is complete in creation; it has no precedence in poverty. If the matters were intertwined, poverty would be the essence of richness, and richness the essence of poverty, since each of them is among the constituents of the other. Yet, the opposite cannot be the essence of its opposite, even if they meet in some matter. Thus, richness and poverty never meet. Poverty has no station with Allah in His Existence, and richness has no station with the servant in his existence. Just as it is not said that Allah is superior to creation, or creation [superior to Allah], similarly, it is not said that richness is superior to poverty, or poverty superior to richness. Poverty is an attribute of creation (الخلق), and richness is an attribute of the Real (الحق). Preference (المفاضلة) is only valid between things united by a single genus, and there is no genus uniting the Real and creation. Therefore, there is no preference between richness and poverty.\n\nThe Exalted said concerning richness: <<Indeed, Allah is Rich beyond the worlds>> (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ). And He said concerning poverty: <<O mankind, you are the poor in need of Allah, while Allah is the Rich, the Praiseworthy>> (يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله والله هُوَ الْغَنِيُّ الْحَمِيدُ). Whoever says, after knowing this, that richness is superior to poverty, or poverty is superior, is like one who asks, \"Who is superior, Allah or creation?\" This is sufficient ignorance on the part of the speaker.\n\nAs for what is in the hands of people, which they call richness, how can it be richness when you are poor in need of it, and in your richness, you are not independent of your richness? Thus, your richness is the very essence of your poverty. In reality, this is not called richness. How, then, can a preference occur between that which has true existence, which is poverty, and that which does not have true existence, which is your richness? When a human is called rich, it is merely an expression for the presence of an effective cause (السبب المؤثر) with him concerning something he desires at that moment. By means of that cause, he is rich in respect to what he is poor in need of, due to its existence through it. Thus, he is essentially poor (الفقير الذاتي) in his accidental richness (غناه العرضي). If the effective cause for what he needs is not present with him, he is called poor without richness. Poverty belongs to him in both states, because his essence belongs to him in both states. If the matter is thus, then seeking preference is ignorance between the real attribute and the relative, accidental attribute.\n\nAmong what this station encompasses are the obligations incumbent upon the scholar and the student, the questioner and the answerer. Let us clarify a part of this due to the pressing need for it, as it occurs among people most of the time.\n\nThis is when the ignorant person comes to ask the scholar about a matter he does not know, concerning the aspect about which he asks, yet he knows the extent of the aspect that prompted him to ask about it. This is like someone who hears a sound from behind a veil (حجاب). He knows with certainty that behind the veil there is something, but he does not know what it is, or he does not know the source of that sound, and perhaps it is not behind that screen at all. So he asks someone who knows the location of that screen: \"Is there something behind it that can be sensed, or not? And if there is, what is it?\" Thus, the question from the questioner concerns what he does not know, based on a known aspect he possesses, which implies what will only be known after the question is asked. Some speculative thinkers (النظار) have raised objections concerning this station, but by this measure, that objection is resolved. Our book is not intended for theoretical intellectual relations (النسب الفكرية النظرية); rather, it is dedicated to the sciences of Divine Gift (العلوم الوهبية) and Unveiling (الكشفية).\n\nIt has become customary among scholars who fall short of what we have mentioned that when a student questioner comes to ask a scholar about a matter he does not know, if the question is deemed great relative to the state of the questioner, the scholar tells him: \"Do not ask about what does not concern you. This is not your measure, and you fall short of understanding the answer to this question.\" This is not the case according to us, nor in reality. Rather, the shortcoming lies with the answerer, who failed to know the aspect that the question can bear relative to this specific questioner. He should teach him that aspect so that the questioner gains benefit from what he asked about, while concealing from him the aspects of the question that his intellect cannot bear and his understanding cannot reach. The questioner is thus pleased with the scholar's answer and becomes knowledgeable about that issue from that aspect, which is a valid aspect. If the perceptive, intelligent scholar misses the knowledge of this aspect, he has missed a portion of the issue equal to that aspect. Thus, the perceptive, intelligent person becomes equal to the dullard (الفدم) in failing to encompass the aspects of that issue.\n\nThe Messenger of Allah (may Allah bless him and grant him peace) taught us, concerning this chapter, how to discipline the Companions regarding this matter. A man came to the Messenger of Allah (may Allah bless him and grant him peace) while he was among his Companions and said: \"O Messenger of Allah, I ask you about the garments of the people of Paradise: Are they created [out of nothing] or woven [from material]?\" Those present laughed at his question. The Messenger of Allah (may Allah bless him and grant him peace) became angry and said: \"Do you laugh because an ignorant person asked a knowledgeable one? O man, they split open from the fruit of Paradise.\"\n\nHe answered him with what satisfied him and taught his Companions manners toward the questioner, removing his embarrassment, and the man turned into a joyful scholar. Allah, the Exalted, said: <<And as for the one who asks, do not repel him>> (وأَمَّا السَّائِلَ فَلا تَنْهَرْ). This is general, even if the context of its revelation concerned asking for knowledge, because it is a teaching based on a previous state of the Messenger of Allah (may Allah bless him and grant him peace), which is His saying: <<And He found you lost and guided [you]>> (وَجَدَكَ ضَالًّا فَهَدى‏), meaning confused, and He clarified the matter for you. So, when the questioner comes to you asking, he is in the position you were in when you were lost. Do not repel him, just as I did not repel you, and clarify for him just as I clarified for you. Similarly, He said to him, teaching him about a previous state: <<Did He not find you an orphan and give [you] refuge>> (أَ لَمْ يَجِدْكَ يَتِيماً فَآوى‏)? He did not humiliate you or drive you away with force due to your orphanhood and brokenness. So, when you find an orphan, do not oppress him (لا تقهره), be gentle with him, give him refuge, and treat him kindly.\n\nThe Messenger of Allah (may Allah bless him and grant him peace) said: \"Indeed, Allah disciplined me, and He perfected my discipline.\"\n\nIt is incumbent upon us to follow the Divine Manners (الآداب الإلهية) with which Allah, the Glorified, disciplined His Prophets, such as this, and such as His saying to Noah: <<Indeed, I advise you lest you be among the ignorant>> (إِنِّي أَعِظُكَ أَنْ تَكُونَ من الْجاهِلِينَ). He was gentle with him in saying \"I advise you\" due to his old age and advanced years, for addressing elders has a known limit and description, and addressing youth has a known limit. And He said concerning Muhammad, His Messenger (may Allah bless him and grant him peace): <<So do not be among the ignorant>> (فَلا تَكُونَنَّ من الْجاهِلِينَ). Where is that gentleness compared to this forcefulness? That [gentleness] was due to the weakness of old age, and this [forcefulness] is due to the strength of youth. And where is the level of fifty years compared to the level of five hundred years and more?\n\nThus, the address was tailored to the states: in the first of the Messengers, who was Noah, and in the last of them, who was Muhammad (may Allah bless him and grant him peace), and upon all the Prophets. Among the Divine Manners is everything mentioned in the Quran concerning \"Do this\" and \"Do not do that.\" Look for it in the Quran, and you will be encompassed by the Divine Manner, so employ it, and you will be granted success, if Allah wills. <<And Allah speaks the Truth, and He guides to the Way>> (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏).",
    "ur": "## باب نمبر دو سو اکیانوے: صدر الزمان (زمانے کے سینے) کے مقام کی معرفت میں، جو کہ الحضرة المحمدیۃ (حضور محمدی) کا چوتھا فلک ہے۔\n\nمیں نے زمانے (الدهر) کی قسم کھائی کہ زمانے کی کوئی\nآنکھ نہیں ہے، لیکن یہ عقل کے لیے معقول ہے۔\n\nپس اگر تم اس کی قسم کھاؤ تو عدم پر قسم کھاؤ،\nوجود پر نہیں، کیونکہ قسم توڑنا (حنث) باطل کر دیتا ہے۔\n\nاور جان لو کہ وہ شخص جسے نہ ماں تسلی دیتی ہے\nاور نہ باپ، وہ احکام میں کٹا ہوا (مبتول) ہے۔\n\nسوائے اس شخص کے جس میں اس کی معارف (المعارف) بلند ہو گئیں\nاور وہ اس سے (یعنی دنیا سے) دور ہو گیا، تو وہ شخص مقبول ہے۔\n\nجیسے وہ شخص جو سمندر میں بھٹک گیا اور اس کا کوئی\nرہنما نہیں، تو وہ خواہشات کے سبب بیمار (معلول) ہے۔\n\nاور اگر تم بغیر غنا کے فقر کی طرف منتقل ہو گئے،\nتو تم دلیل عقل کے ذریعے رہنمائی پانے والے ہو۔\n\n### [انسان صورت الٰہیہ پر ہے]\n\nجان لو، اللہ تعالیٰ تمہیں توفیق دے، اے ولی حمیم (قریبی دوست)، کہ ہر شے کا ایک صدر (سینہ/آغاز) ہوتا ہے، اور اس راہ میں اس کی معرفت (المعرفۃ) بلند ترین علوم و معارف (المعارف) میں سے ہے، کیونکہ عالم اور ہر جنس انسان کی صورت پر ہے، اور وہ (انسان) آخری موجود ہے۔ اور انسان اکیلا ہی اپنے ظاہر و باطن میں صورت الٰہیہ پر ہے۔ اللہ نے اس کے لیے ایک صدر (سینہ) بنایا ہے۔ پس حق (الحق) اور انسان کے درمیان، جس کے لیے آخریت ہے اور حق (الحق) کے لیے اولیت ہے، ایسے صدور ہیں جن کی تعداد اللہ کے سوا کوئی نہیں جانتا۔ لہٰذا ہم ان میں سے کچھ کا تعین کرتے ہیں جو تمہاری سمجھ تک پہنچ سکیں اور جنہیں تمہاری عقل قبول کر سکے، اور ہم ان چیزوں پر خاموشی اختیار کرتے ہیں جو تمہاری سمجھ تک نہیں پہنچ سکتیں اور جنہیں تمہاری عقل قبول نہیں کر سکتی۔ پس ہم پہلے اعلیٰ سے شروع کریں گے اور آخری درجے تک اتریں گے۔\n\nتو ہم کہتے ہیں کہ صدر (آغاز) ہر صورت میں دوسری رتبے پر ہے، خواہ وہ صورت جنسی ہو، نوعی ہو یا شخصی۔ پس واجبات کا صدر وہ حیات ازلیہ ہے جس کے ساتھ حق (الحق) عزوجل متصف ہے۔ اور مؤثر اسماء کا صدر عالم ہے۔ اور صفات تنزیہ کا صدر مماثلت کی نفی ہے۔ اور اینیات (کہاں ہونے) کا صدر وہ عماء (غیب مطلق) ہے جس کے اوپر کوئی ہوا نہیں اور جس کے نیچے کوئی ہوا نہیں۔ اور الوجود (ہستی) کا صدر ممکنات ہیں۔ اور موجودات کا صدر عقل اول ہے۔ اور دہر (زمانہ مطلق) کا صدر ازل اور ابد کے درمیان ہے۔ اور زمان (وقت) کا صدر وہ وقت ہے جب ہیولیٰ (مادہ اولیہ) صورت کو قبول کرتا ہے۔ اور طبیعت کا صدر جسم اول کی کیفیت ہے۔ اور کیفیات کا صدر ایجاد کے ساتھ قدرت کا تعلق ہے۔ اور کمیات (مقداروں) کا صدر معانی کی تقسیم ہے۔ اور افلاک کا صدر کرسی ہے۔ اور عناصر کا صدر پانی ہے۔ اور رات کا صدر شفق احمر کا غائب ہونا ہے۔ اور دن کا صدر سورج کا چمکنا ہے نہ کہ اس کا طلوع ہونا۔ اور مولدات (پیدا ہونے والی چیزوں) کا صدر حیوان ہے۔ اور انسان کا صدر معروف ہے۔ اور امتوں کا صدر ادریس علیہ السلام کا زمانہ ہے۔ اور اس امت کا صدر پہلی صدی ہے۔ اور دنیا کا صدر آدم علیہ السلام کا وجود ہے۔ اور دنوں کا صدر پیر کا دن ہے۔ اور آخرت کا صدر بعث (دوبارہ اٹھایا جانا) ہے۔ اور برزخ کا صدر نیند ہے۔ اور آگ (جہنم) کا صدر موبق (ہلاکت کی جگہ) ہے۔ اور جنت کا صدر اس کے منازل میں اترنا ہے۔ اور عذاب و نعیم کا صدر ان کے اسباب کا دیکھنا ہے۔ اور دین کا صدر \"فلاں اللہ کا رسول ہے\"۔\n\n### [ہر صدر کا ایک قلب ہوتا ہے]\n\nاور جان لو کہ ہر صدر (سینہ) کا ایک قلب (دل) ہوتا ہے۔ جب تک قلب صدر میں رہتا ہے، وہ اندھا ہوتا ہے، کیونکہ صدر اس پر حجاب ہے۔ پس جب اللہ چاہتا ہے کہ اسے بصیر (دیکھنے والا) بنا دے تو وہ اپنے صدر سے باہر نکلتا ہے اور دیکھتا ہے۔ پس اسباب موجودات کے صدور ہیں اور موجودات قلوب کی مانند ہیں۔ جب تک موجود اس سبب کی طرف دیکھتا ہے جس سے وہ صادر ہوا، وہ اللہ کے شہود (الشہود) سے اندھا رہتا ہے جس نے اسے وجود بخشا۔ پس جب اللہ چاہتا ہے کہ اسے بصیر بنا دے، تو وہ اس سبب کی طرف دیکھنا چھوڑ دیتا ہے جسے اللہ نے اس کے پاس موجود کیا، اور اس خاص وجہ سے دیکھتا ہے جو اس کے رب کی طرف سے اس کی ایجاد میں اس کی طرف ہے۔ اللہ اسے بصیر بنا دیتا ہے۔ پس تمام اسباب مسببات کی آنکھوں پر تاریکیاں ہیں۔ اور انہی میں وہ لوگ ہلاک ہوئے جو ہلاک ہوئے۔ پس عارفون (عارفین) انہیں ثابت کرتے ہیں لیکن ان کا شہود (الشہود) نہیں کرتے، اور انہیں ان کا حق دیتے ہیں لیکن ان کی عبادت نہیں کرتے۔ اور عارفین کے علاوہ لوگ ان کے ساتھ اس کے برعکس معاملہ کرتے ہیں: وہ ان کی عبادت کرتے ہیں اور انہیں ان کا حق نہیں دیتے، بلکہ ان سے وہ بندگی چھین لیتے ہیں جو ان کا حق ہے، اور وہ ان کا شہود کرتے ہیں لیکن انہیں ثابت نہیں کرتے۔\n\nپس تم کسی بھی شخص کو نہیں سنو گے مگر وہ یہی کہتا ہے کہ اللہ کے سوا کچھ نہیں ہے اور وہ اسباب کی نفی کرتا ہے۔ لیکن جب تم اسے اس کے قول پر پکڑو یا اس پر کوئی مصیبت نازل ہو، تو وہ سبب کا شہود کرتا ہے اور اس ذات سے اندھا ہو جاتا ہے جس نے اسے ثابت کیا، اور وہ اس کا کفر کرتا ہے اور اس چیز پر ایمان لاتا ہے جس کی اس نے نفی کی تھی۔ اور اگر بعض لوگوں کے ساتھ ایسا ہو کہ وہ مصیبت اس سبب سے دور نہ ہو جس پر اس نے بھروسہ کیا تھا، اور اسباب منقطع ہو جائیں، تو اس وقت وہ اس (سبب) کا کفر کرتا ہے اور اللہ کی طرف رجوع کرتا ہے جو اسباب کا خالق ہے۔ پس اسے یہ معلوم نہیں ہوتا کہ اس نے کس چیز کا کفر کیا اور کس چیز پر ایمان لایا، اور نہ ہی اسے سبب یا غیر سبب کا معنی معلوم ہوتا ہے۔ کیونکہ اگر وہ جانتا کہ سبب کا صحیح ہونا ممکن نہیں جب تک کہ مسبب اس سے نہ ہو، تو وہ جان لیتا کہ جس سبب پر اس نے اس مصیبت کو دور کرنے کے لیے بھروسہ کیا تھا، وہ کسی بھی صورت میں اس کا سبب نہیں تھا۔ کیونکہ اگر وہ اس کا سبب ہوتا تو اسے دور کر دیتا۔ بلکہ وہ سبب، مصیبت کو دور کرنے سے روکنے میں، اللہ کی طرف رجوع کرنے کا سبب بنا تاکہ وہ اسے دور کرے۔ پس وہ معنی کے اعتبار سے ہمیشہ اسباب کے اثر کے تحت رہا۔ کیونکہ اسباب کو ختم کرنا محال ہے۔ اور بندہ کیسے اس چیز کو ختم کر سکتا ہے جسے اللہ نے ثابت کیا ہے؟ اسے اس کا حق نہیں ہے۔ لیکن جہالت نے لوگوں کو گھیر لیا، انہیں اندھا کر دیا، انہیں حیران کر دیا اور انہیں ہدایت نہیں دی۔ اور اللہ جسے چاہتا ہے صراط مستقیم کی طرف ہدایت دیتا ہے (وَاللَّهُ يَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ) اس روح کے ذریعے جو اللہ کے حکم سے وحی کی گئی ہے، پس وہ اس کے ذریعے اپنے بندوں میں سے جسے چاہتا ہے ہدایت دیتا ہے (فَيَهْدِي بِهِ مَنْ يَشَاءُ مِنْ عِبَادِهِ)۔ پس اس نے روح کے ذریعے ہدایت کو ثابت کیا، اور یہ عالم میں سبب کا مقام ہے۔ پس اسباب پر ٹھہرنا اللہ پر بھروسہ کرنے کے منافی نہیں ہے۔ اسی لیے اس نے سبحانہ و تعالیٰ نے اسباب کو نچلے درجے سے لے کر دوسرے اسباب کا مسبب بنایا، یہاں تک کہ وہ اللہ سبحانہ و تعالیٰ پر منتہی ہو جاتے ہیں۔ پس وہی سبب اول ہے، نہ کہ کسی ایسے سبب سے جو اس کے ذریعے وجود میں آیا ہو۔ ہاں، کون (وجود) کا سبب مرتبہ ہے نہ کہ ذات، اور مرتبہ کا سبب کون ہے۔ پس ایجاد میں کون کا سبب مرتبہ ہے، اور معرفت (المعرفۃ) میں مرتبہ کا سبب کون ہے۔ پس سمجھو۔\n\n### [جب بھی دن حرکت کے لیے روشن ہوتا ہے، اشیاء کی ولادت واقع ہوتی ہے]\n\nپس جب دن حرکت کے لیے روشن ہوا، تو اشیاء کی ولادت اس کے ذریعے واقع ہوئی، اور زیادہ تر حسی عالم میں اعیان (حقائق) ظاہر ہوئے۔ اور سمندروں میں ہوائیں چلیں، تو لہریں ٹکرائیں، اور کشتیاں چلیں، اور سمندروں نے لہروں کے ٹکرانے کی وجہ سے جو کچھ ان میں تھا اسے باہر پھینک دیا۔ اور جب رات سکون کے لیے تاریک ہوئی، تو ہوائیں تھم گئیں، اور لہریں تھم گئیں، اور سمندر نے زیادہ تر جو کچھ اس میں تھا اسے روک لیا۔ اور برزخ میں ولادت ظاہر ہوئی، تو خواب اور بشارت دینے والے اور ڈرانے والے رؤیا (خواب) آئے، جیسے حسی مولدات (پیدا ہونے والی چیزوں) کی قبیح اور خوبصورت صورتیں افعال اور نشأتوں میں ہوتی ہیں۔ اور اس کا زیادہ تر وقوع رات کے صدر (آغاز) میں اور دن کے صدر میں ہوتا ہے، کیونکہ ہوائیں سورج طلوع ہونے کے بعد ہی چلتی ہیں، تب ہی ہوائیں ہوتی ہیں۔ جیسا کہ نصرت کی ہوائیں صرف صدر العشی (شام کا آغاز) میں چلتی ہیں، جو زوال کے بعد ہوتا ہے، اور اسی لیے اس وقت قتال مستحب ہے۔ اور چونکہ رات سکون اور ہم کلامی کی جگہ ہے، اور کوئی شخص نہیں سوتا مگر اس کے ساتھ جسے وہ محبت کرتا ہے اور جس سے اسے سکون ملتا ہے، اور کوئی ہم کلام نہیں ہوتا مگر اس کے ساتھ جس سے اسے انسیت ہوتی ہے، اس لیے رات مودت اور رحمت کی اصل ہے۔ یہاں تک کہ جنہیں بادشاہ عذاب دیتے ہیں، وہ انہیں زیادہ تر دن میں ہی عذاب دیتے ہیں، رات میں نہیں۔ کیونکہ اگر رات میں عذاب دیا جائے تو معذب کو جاگنے اور نیند نہ آنے کا عذاب بھی ہوتا ہے جو اسے لاحق ہوتا ہے۔ پس رات سکون اور راحت کا وقت ہے، اور عذاب دینے والا خود کو عذاب نہیں دینا چاہتا، لہٰذا وہ عذاب کو دن کے لیے چھوڑ دیتا ہے جو حرکت کی جگہ ہے۔ پس محبت اور مودت کی اصل رات سے موجود ہے اور اس کی ضد دن میں موجود ہے۔\n\nپھر یہ کہ غیبت، یعنی محبوب کا محب سے غائب ہونا، تعلیم اور تادیب کی غیبت ہے جو محبت عطا کرتی ہے۔ پس اگر محب اپنے دعوے میں سچا ہو اور اللہ اسے اپنے محبوب کی غیبت سے آزمائے، تو اس سے محبوب کے مشاہدے کی طرف شوق کی حرکت ظاہر ہوتی ہے۔ پس وہ اپنی محبت کے دعوے میں سچا ثابت ہوتا ہے، تو اس کا مرتبہ بلند ہوتا ہے اور اس کے محبوب کے ذریعے تنعیم (نعمتوں سے لطف اندوز ہونے) کا انعام دوگنا ہو جاتا ہے۔ کیونکہ جو لذت اسے ملاقات کے وقت ملتی ہے، وہ استصحاب (ہمیشہ ساتھ رہنے) کی لذت سے کہیں زیادہ عظیم ہوتی ہے، جیسے خوف زدہ شخص پر امن کے آنے کی مٹھاس، جو ہمیشہ ساتھ رہنے والے امن کی مٹھاس سے زیادہ قوی ہوتی ہے۔ پس اس سے نعمتوں کا دوگنا ہونا بڑھ جاتا ہے۔ اسی لیے اہل جنت ہر سانس کے ساتھ، اپنی تمام حواس، معانی اور تجلی (التجلی) میں، ایک متجدد (نیا ہونے والا) نعیم میں ہوتے ہیں۔ پس وہ ہمیشہ طرب (خوشی) میں رہتے ہیں۔ اسی لیے ان کا نعیم (نعمت) سب سے بڑا نعیم ہے، کیونکہ فراق کے توقع اور مصاحبت کے نہ ہونے کا وہم ہوتا ہے۔ اور انسان اس مرتبے سے ناواقفیت کی وجہ سے استصحاب (ہمیشہ ساتھ رہنے) کا طالب ہوتا ہے، جبکہ عارف (العارف) نعیم کی تجدید کے استصحاب کا طالب ہوتا ہے، اور دونوں نعمتوں کے درمیان فرق کا طالب ہوتا ہے، تاکہ اسے نئی نعمت سے لذت حاصل ہو، جیسا کہ نفس الامر (حقیقت) میں ہے۔ اگرچہ ہر انسان اسے نہیں جانتا اور نہ ہی ہر آنکھ اور عقل اس کا مشاہدہ کرتی ہے، لیکن وہ نفس الامر میں ہر لمحے کے ساتھ متجدد ہوتا ہے۔ اور اس شخص میں موجود جہالت کی وجہ سے، جو نعیم میں تجدید کا مشاہدہ نہیں کرتا، اکتاہٹ (ملال) پیدا ہوتی ہے۔ پس اگر یہ جہالت اس سے دور ہو جائے تو عالم سے اکتاہٹ دور ہو جائے۔ پس اکتاہٹ اس بات کی سب سے قوی دلیل ہے کہ انسان اللہ کے بارے میں جاہل ہے کہ وہ اس کے وجود کو اس پر قائم رکھتا ہے اور ہر سانس کے ساتھ اپنی نعمتوں کی تجدید کرتا ہے۔ پس اللہ ہمیں کشف اتم (مکمل کشف) اور مشہد اعم (عام مشاہدہ) کے ذریعے حقیقت سے آشنا کرے۔ پس عین الیقین (یقین کی آنکھ) کتنی شاندار ہے، اور امور کو ان کی حقیقت پر مشاہدہ کرنے والا کتنا خوش نصیب ہے! لیکن اللہ سبحانہ و تعالیٰ نے اس جہالت کے ذریعے غمگین لوگوں کا خیال رکھا ہے۔ پس یہ ان کے حق میں رحمت ہے، کیونکہ اگر وہ ہر فردِ وقت میں اپنے لیے تجدید کا مشاہدہ کرتے، تو ان کا عذاب ہمیشہ ان کے نزدیک بڑا رہتا اور ان کی تکلیفیں دوگنی ہو جاتیں۔ پس جب ان کے اور اس مشاہدے کے درمیان پردہ ڈال دیا گیا اور انہوں نے یہ خیال کیا کہ پہلا غم ہی ان کے ساتھ ہے، تو وہ ان کے نزدیک فعل میں اچانک آنے والے غم کا مقام نہیں رکھتا، اور انہوں نے اس استصحاب (ہمیشہ ساتھ رہنے) کا بوجھ ہلکا سمجھا جس کا انہوں نے تصور کیا، یہ اللہ کی طرف سے ان پر رحمت اور تخفیف ہے۔ سوائے جہنم کے، کیونکہ اس کے باشندے ہر سانس کے ساتھ عذاب کی تجدید کا مشاہدہ کرتے ہیں۔ اور ہماری گفتگو اس دنیا کے گھر کے بارے میں ہے جو حجاب کی جگہ ہے، سوائے عارفین (العارفین) کے، کیونکہ ان کے لیے دنیا میں آخرت کا مقام ہے۔ پس ان کے لیے کشف (الکشف) اور مشاہدہ (المشاھدۃ) ہے، اور یہ دو چیزیں ہیں جو عین الیقین عطا کرتا ہے، اور یہ علم کے مکمل ترین مدارک میں سے ہے۔ پس آنکھ سے حاصل ہونے والا علم، لذت بخش معلومات میں سب سے بڑی لذت رکھتا ہے۔ پس وہ حکم کے اعتبار سے آخرت میں ہیں اور حس کے اعتبار سے دنیا میں، اور وہ مکانت کے اعتبار سے آخرت میں ہیں اور مکان کے اعتبار سے دنیا میں۔ پھر یہ ان کے لیے آخرت سے قبر سے لے کر جنت تک اور ان کے درمیان آخرت کے منازل تک متصل ہو جاتا ہے۔ اور یہی اللہ تعالیٰ کا قول ہے: ان کے لیے دنیا کی زندگی میں بشارت ہے (لَهُمُ الْبُشْرَىٰ فِي الْحَيَاةِ الدُّنْيَا) اور وہ یہ ہے کہ وہ اس مشاہدے میں ہیں جس کا ہم نے ذکر کیا، اور آخرت میں (وَفِي الْآخِرَةِ) قبر سے لے کر جنت تک، پس یہ ایک متصل نعیم ہے۔ پس یہ عارفین کا نعیم ہے، اور یہ دائمی نعیم کسی اور کے لیے نہیں ہے۔\n\nپھر یہ کہ حق (الحق) سبحانہ و تعالیٰ نے اس منزل میں اپنے معتنیٰ بہ (جس پر خاص توجہ دی گئی) بندے کو حکم دیا کہ وہ اپنی مخلوق کے ساتھ ویسا ہی ہو جیسا کہ حق (الحق) اس مشہد میں اس کے ساتھ تھا۔ اور ہر وہ چیز جو ان کی سعادت کا باعث بنے، اور یہ نصیحت اور تبلیغ کے ذریعے ہو۔ اس کے ہاتھ میں اس کے علاوہ کوئی اختیار نہیں ہے۔ پس عارف (العارف) کے لیے اس راہ کو واضح کرنا ہے جو اس مقام تک پہنچاتی ہے اور اس کا اظہار کرنا ہے، لیکن اس مقام کو عطا کرنا اس کے اختیار میں نہیں ہے، کیونکہ یہ صرف اللہ تعالیٰ کے لیے خاص ہے۔ اللہ تعالیٰ نے فرمایا: اے رسول! پہنچا دیجیے (يَا أَيُّهَا الرَّسُولُ بَلِّغْ)۔ پس جب اس نے پہنچا دیا تو اسے کہا گیا: پس آپ پر صرف پہنچا دینا ہے (فَإِنَّمَا عَلَيْكَ الْبَلَاغُ)، ان کی ہدایت آپ کے ذمے نہیں ہے (لَيْسَ عَلَيْكَ هُدَاهُمْ)، بے شک آپ جسے چاہیں ہدایت نہیں دے سکتے (إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ)، لیکن اللہ جسے چاہتا ہے ہدایت دیتا ہے (وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ)۔ اور حقائق کے بارے میں اس کا قول کتنا عمدہ ہے: اور وہ ہدایت پانے والوں کو خوب جانتا ہے (وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ)۔ کیونکہ علم کا تعلق معلوم سے اسی طرح ہوتا ہے جس طرح معلوم ہوتا ہے۔ اور فرمایا: شاید آپ اپنے آپ کو ہلاک کر دیں گے کہ وہ ایمان نہیں لاتے (لَعَلَّكَ بَاخِعٌ نَفْسَكَ أَلَّا يَكُونُوا مُؤْمِنِينَ)۔ پس رسولوں اور علماء میں سے ان کے وارثوں کا کام صرف بیان اور اظہار کے ذریعے تبلیغ کرنا ہے، اس کے علاوہ کچھ نہیں۔ اور انہیں اس کا بدلہ ملے گا جو عطا کرنے والے اور بخشنے والے کا بدلہ ہے۔ اور خیر کی طرف رہنمائی کرنے والا خیر کرنے والے کی طرح ہے۔ کیونکہ خیر کی طرف رہنمائی کرنا بھی خیر میں سے ہے۔ پس یہ منزل علم استناد (بھروسہ کرنے کا علم) اور مستند الیہ (جس پر بھروسہ کیا جائے) کو شامل کرتی ہے، جو کہ سب سے بڑا استناد ہے، اور وہ استناد الٰہی ہے۔ اور وہ یہ ہے کہ اسماء الٰہیہ کا استناد ان مقامات کی طرف ہو جہاں ان کے آثار موجود ہوں تاکہ ان کے مراتب کا تعین ہو، اور مقامات کا استناد اسماء الٰہیہ کی طرف ہو تاکہ ان کے اعیان (حقائق) ظاہر ہوں۔ پس یہ سب سے اعلیٰ استنادات اور سب سے اعلیٰ مستند الیہ ہیں۔ ہم نے تمہیں راستے پر ڈال دیا ہے، پس اس پر اترتے اور چڑھتے رہو۔ اور یہیں سے معلوم ہوتا ہے کہ لوگ فقر کو غنا پر اور غنا کو فقر پر فضیلت دینے میں جو الجھن کا شکار ہیں، اور اس مسئلے میں بحث کرنا دنیا میں موجود فضول گوئی اور اس پر قائم جہالت میں سے ہے۔ کیونکہ حالات مختلف ہوتے ہیں اور منازل مختلف ہوتے ہیں، اور ہر حالت کا کمال اس کے عین (حقیقت) کے وجود میں ہے۔ اللہ فرماتا ہے: اس نے ہر چیز کو اس کی خلقت عطا کی (أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ)۔ پس یہ آیت کسی بھی شخص کے لیے فضول گوئی میں پڑنے کا راستہ نہیں چھوڑتی، اس شخص کے لیے جو اسے سمجھے اور اس کی حقیقت کو پائے۔ سوائے اس کے کہ فضول گوئی بھی اللہ کی مخلوق میں سے ہے۔ پس اللہ نے فضول گوئی کو اس کی خلقت عطا کی، پھر ہدایت دی (ثُمَّ هَدَىٰ)، یعنی بیان کیا کہ جس میں فضول گوئی پائی جاتی ہے، وہ اس شخص سے تعبیر کیا جاتا ہے جو اس چیز میں مشغول ہے جو اس کے لیے معنی نہیں رکھتی، اور وہ اس امر سے جاہل ہے جو اس کے لیے معنی رکھتا ہے۔ اور فقر اپنی حقیقت میں کامل الخلق ہے، اسے غنا میں کوئی قدم حاصل نہیں، اور غنا اپنی حالت میں کامل الخلق ہے، اسے فقر میں کوئی قدم حاصل نہیں۔ اور اگر امور آپس میں مل جاتے تو فقر عین غنا ہوتا اور غنا عین فقر ہوتا، کیونکہ ان میں سے ہر ایک اپنے ساتھی کے مقومات میں سے ہے۔ اور ضد، ضد کا عین نہیں ہو سکتی، اگرچہ وہ کسی ایک امر میں جمع ہو جائیں۔ پس غنا اور فقر کبھی جمع نہیں ہو سکتے۔ پس فقر کے لیے اللہ کے نزدیک اس کے وجود میں کوئی منزلت نہیں ہے، اور غنا کے لیے بندے کے نزدیک اس کے وجود میں کوئی منزلت نہیں ہے۔ جس طرح یہ نہیں کہا جاتا کہ اللہ مخلوق سے افضل ہے یا مخلوق (اللہ سے افضل ہے)، اسی طرح یہ بھی نہیں کہا جاتا کہ غنا فقر سے افضل ہے یا فقر غنا سے افضل ہے۔ پس فقر مخلوق کی صفت ہے اور غنا حق (الحق) کی صفت ہے۔ اور فضیلت صرف ان میں صحیح ہوتی ہے جنہیں ایک ہی جنس جمع کرتی ہو، اور حق (الحق) اور خلق کے درمیان کوئی جامع نہیں ہے، لہٰذا غنا اور فقر کے درمیان کوئی فضیلت نہیں ہے۔ اللہ تعالیٰ نے غنا کے بارے میں فرمایا: بے شک اللہ تمام جہانوں سے بے نیاز ہے (فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ)۔ اور فقر کے بارے میں فرمایا: اے لوگو! تم اللہ کے محتاج ہو، اور اللہ ہی بے نیاز، قابل تعریف ہے (يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ)۔ پس جو شخص یہ جاننے کے بعد کہے کہ غنا فقر سے افضل ہے یا فقر افضل ہے، وہ اس شخص کی طرح ہے جو کہے کہ اللہ افضل ہے یا مخلوق۔ اور کہنے والے کے لیے یہی جہالت کافی ہے۔\n\nاور جو مال لوگوں کے ہاتھوں میں ہے جسے وہ غنا (دولت) کہتے ہیں، تو وہ کیسے غنا ہو سکتا ہے جبکہ تم اس کے محتاج ہو، اور تم اپنے غنا میں اپنے غنا سے بے نیاز نہیں ہو؟ پس تمہارا غنا عین تمہارا فقر ہے۔ اور حقیقت میں اسے غنا نہیں کہا جاتا۔ پس اس چیز کے درمیان کیسے فضیلت کا موازنہ ہو سکتا ہے جس کا حقیقی وجود ہے، یعنی فقر، اور اس چیز کے درمیان جس کا حقیقی وجود نہیں ہے، یعنی تمہارا غنا؟ اور جب انسان کو غنی کہا جاتا ہے، تو یہ اس سبب مؤثر کے وجود سے تعبیر ہے جو اس کے پاس اس چیز میں موجود ہے جس میں اسے اس وقت غرض ہے۔ پس وہ اس سبب کے ذریعے اس چیز میں غنی ہوتا ہے جس کی اسے ضرورت ہوتی ہے، کیونکہ وہ اس کے ذریعے موجود ہے۔ پس وہ اپنے عرضی غنا میں ذاتی طور پر فقیر ہے۔ اور جب اس کے پاس اس چیز میں سبب مؤثر کا وجود نہ ہو جس کا وہ محتاج ہے، تو اسے بغیر غنا کے فقیر کہا جاتا ہے۔ پس فقر دونوں حالتوں میں اس کے لیے ہے، کیونکہ اس کی ذات دونوں حالتوں میں اس کے لیے ہے۔ اور جب معاملہ یہ ہے، تو فضیلت کا مطالبہ حقیقی وصف اور اضافی عرضی وصف کے درمیان جہالت ہے۔\n\nاور مما یتضمنہ (جو اس میں شامل ہے) یہ منزل وہ چیز ہے جو عالم (جاننے والے) اور متعلم (سیکھنے والے)، اور سائل (سوال کرنے والے) اور مسئول (جس سے سوال کیا جائے) کے لیے ضروری ہے۔ پس ہم اس میں سے ایک حصہ بیان کرتے ہیں کیونکہ اس کی شدید ضرورت ہے، اور یہ اکثر اوقات لوگوں میں واقع ہوتا ہے۔ وہ یہ کہ جب جاہل کسی عالم کے پاس کسی ایسے امر کے بارے میں پوچھنے آتا ہے جسے وہ اس پہلو سے نہیں جانتا جس کے بارے میں وہ پوچھ رہا ہے، لیکن وہ اس پہلو کی مقدار جانتا ہے جس نے اسے سوال کرنے پر مجبور کیا، جیسے کوئی شخص پردے کے پیچھے سے کوئی آواز سنے، تو وہ یقیناً جانتا ہے کہ پردے کے پیچھے کوئی چیز ہے، لیکن وہ نہیں جانتا کہ وہ کیا ہے، یا وہ اس آواز کی جگہ نہیں جانتا، اور شاید اس پردے کے پیچھے کچھ نہ ہو۔ پس وہ اس شخص سے پوچھتا ہے جو اس پردے کی جگہ جانتا ہے کہ کیا اس کے پیچھے کوئی ایسی چیز ہے جسے محسوس کیا جا سکے یا نہیں؟ اور اگر ہے تو وہ کیا ہے؟ پس سائل کا سوال اس چیز کے بارے میں تصور کیا جاتا ہے جسے وہ نہیں جانتا، کسی معلوم پہلو کی وجہ سے جو اس کے پاس ہے، جو اس چیز کو شامل کرتا ہے جسے سوال کے بعد ہی جانا جا سکتا ہے۔ اور اسی مقام پر بعض نظریاتی مفکرین نے اشکالات وارد کیے ہیں، اور اس قدر سے وہ اشکال دور ہو جاتا ہے۔ اور ہماری کتاب نظریاتی فکری نسبتوں کے لیے نہیں ہے، بلکہ یہ علوم وہبیہ کشفیہ (الکشف) کے لیے وضع کی گئی ہے۔ پس ان علماء میں جو اس ذکر کردہ چیز سے قاصر ہیں، یہ عادت جاری ہو گئی ہے کہ جب متعلم سائل کسی عالم کے پاس کسی ایسے امر کے بارے میں پوچھنے آتا ہے جسے وہ نہیں جانتا، تو اگر وہ مسئلہ سائل کی حالت کے لحاظ سے عظیم ہو، تو وہ اسے کہتا ہے: اس چیز کے بارے میں مت پوچھو جو تمہارے لیے معنی نہیں رکھتی، اور یہ تمہاری حیثیت نہیں ہے، اور تم اس سوال کے جواب کو سمجھنے سے قاصر ہو۔ اور ہمارے نزدیک اور نفس الامر میں ایسا نہیں ہے۔ بلکہ قصور مسئول (جواب دینے والے) میں ہے، جہاں وہ اس پہلو کو نہیں جانتا جسے وہ مسئلہ اس سائل کے لحاظ سے برداشت کر سکتا ہے۔ پس وہ اسے اس کے ذریعے تعلیم دے تاکہ اسے اس چیز میں فائدہ حاصل ہو جس کے بارے میں اس نے سوال کیا، اور وہ اس سے ان پہلوؤں کو چھپا دے جو اس میں ہیں اور جنہیں اس کی عقل برداشت نہیں کر سکتی اور نہ ہی اس کی سمجھ وہاں تک پہنچ سکتی ہے۔ پس سائل عالم کے جواب سے خوش ہوتا ہے اور اس مسئلے کے اس پہلو سے عالم بن جاتا ہے، اور یہ ایک صحیح پہلو ہے۔ اگر عالمِ فہم و فراست سے اس کا علم فوت ہو گیا، تو اس نے اس مسئلے میں اس پہلو کی مقدار کھو دی۔ پس فہم و فراست والا شخص اور کند ذہن شخص اس مسئلے کے پہلوؤں کو مکمل طور پر نہ سمجھنے میں برابر ہو گئے۔ پس کسی سائل نے کبھی کسی ایسے مسئلے کے بارے میں سوال نہیں کیا جس کے جواب کو قبول کرنے کی اہلیت اس میں نہ ہو۔ اور رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اس باب میں صحابہ کی تادیب میں وہ چیز سکھائی ہے جس سے اس میں ادب حاصل کیا جاتا ہے۔ اور وہ یہ ہے:\n\nایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، جبکہ آپ اپنے صحابہ کے درمیان تشریف فرما تھے، اور کہا: یا رسول اللہ! میں آپ سے جنت کے لباس کے بارے میں پوچھتا ہوں، کیا وہ خلق کیے جاتے ہیں یا بُنے جاتے ہیں؟ تو حاضرین اس کے سوال پر ہنس پڑے۔ تو رسول اللہ صلی اللہ علیہ وسلم غضبناک ہوئے اور فرمایا: کیا تم ہنستے ہو کہ ایک جاہل نے ایک عالم سے سوال کیا؟ اے شخص! وہ جنت کے پھلوں سے پھاڑ کر نکالے جاتے ہیں۔\n\nپس آپ نے اسے وہ جواب دیا جس سے وہ راضی ہو گیا، اور اپنے صحابہ کو سائل کے ساتھ ادب سکھایا، اور اس کی شرمندگی دور کی، اور وہ خوش ہو کر عالم بن گیا۔ اور اللہ تعالیٰ نے فرمایا: اور سائل کو مت جھڑکو (وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ)۔ پس اس نے اسے عام کر دیا، اگرچہ اس کے نزول کا سبب علم کے بارے میں سوال تھا، کیونکہ یہ رسول اللہ صلی اللہ علیہ وسلم کی ایک سابقہ حالت کی تعلیم تھی، اور وہ یہ ہے کہ اس کا قول: اور اس نے آپ کو بھٹکا ہوا پایا تو ہدایت دی (وَوَجَدَكَ ضَالًّا فَهَدَىٰ)، یعنی حیران پایا تو آپ کے لیے امر کو واضح کر دیا۔ پس جب سائل آپ کے پاس سوال کرنے آئے، تو وہ آپ کی اس حالت میں ہے جب آپ بھٹکے ہوئے تھے، پس اسے مت جھڑکو جیسا کہ میں نے آپ کو نہیں جھڑکا، اور اس کے لیے واضح کرو جیسا کہ میں نے آپ کے لیے واضح کیا۔ جیسا کہ اس نے آپ کو آپ کی سابقہ حالت کی تعلیم دیتے ہوئے فرمایا: کیا اس نے آپ کو یتیم نہیں پایا تو ٹھکانہ دیا؟ (أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ) پس اس نے آپ کی یتیمی اور آپ کے ٹوٹے پن کی وجہ سے آپ کو ذلیل نہیں کیا اور نہ ہی قہر سے دور کیا۔ پس یتیم کو مت دباؤ (فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ)، اور اس کے ساتھ نرمی کرو، اسے ٹھکانہ دو اور اس کے ساتھ احسان کرو۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بے شک اللہ نے مجھے ادب سکھایا اور میرے ادب کو بہترین بنایا (إِنَّ اللَّهَ أَدَّبَنِي فَأَحْسَنَ تَأْدِيبِي)۔\n\nپس ہمیں چاہیے کہ ہم ان آداب الٰہیہ کی پیروی کریں جن کے ذریعے اللہ سبحانہ و تعالیٰ نے اپنے انبیاء کو ادب سکھایا، جیسے یہ اور جیسے نوح علیہ السلام کے لیے اس کا قول: میں تمہیں نصیحت کرتا ہوں کہ تم جاہلوں میں سے نہ ہو جاؤ (إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ)۔ پس اس نے اپنے قول \"میں تمہیں نصیحت کرتا ہوں\" میں ان کی بڑھاپے اور عمر کی زیادتی کی وجہ سے نرمی برتی۔ اور شیوخ سے مخاطبت کی ایک معلوم حد اور وصف ہے، اور نوجوانوں سے مخاطبت کی ایک معلوم حد ہے۔ اور محمد رسول اللہ صلی اللہ علیہ وسلم کے حق میں فرمایا: پس تم جاہلوں میں سے ہرگز نہ ہونا (فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ)۔ پس وہ لطف اس قہر سے کہاں؟ پس وہ (نوح علیہ السلام کے لیے) بڑھاپے کی کمزوری کی وجہ سے تھا اور یہ (محمد صلی اللہ علیہ وسلم کے لیے) جوانی کی قوت کی وجہ سے تھا۔ اور پچاس سال کا مرتبہ پانچ سو اور اس سے زیادہ کے مرتبے سے کہاں؟ پس خطاب حالات کے مطابق ہوا، پہلے رسول (نوح) اور آخری رسول (محمد صلی اللہ علیہ وسلم) کے حق میں، اور تمام انبیاء کے حق میں۔ اور آداب الٰہیہ میں سے وہ سب کچھ ہے جو قرآن میں آیا ہے کہ ایسا کرو اور ایسا نہ کرو۔ پس اسے قرآن میں دیکھو، تم ادب الٰہی سے گھِر جاؤ گے، پس اسے استعمال کرو، ان شاء اللہ تمہیں توفیق ملے گی۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "«باب دویست و نود و یکم در معرفت منزل صدر زمان، که فلک چهارم از حضرت محمدیه است»\n\n(أقسمت بالدهر أن الدهر ليس له *** عين ولكنه للعقل معقول‏)\nسوگند به دهر خوردم که دهر را چشمی نیست، *** اما برای عقل، معقول است.\n(فإن حلفت به فاحلف على عدم *** لا في وجود فإن الحنث تعطيل‏)\nپس اگر به آن سوگند خوردی، بر عدم سوگند خور، *** نه بر وجود؛ زیرا شکستن سوگند، تباهی است.\n(واعلم بأن الذي لا أم تؤنسه *** ولا أب هو في الأحكام مبتول‏)\nو بدان که آن کس که نه مادری دارد که با او انس گیرد *** و نه پدری، در احکام، بریده و ناقص است.\n(إلا الذي رقيت فيه معارفه *** وكان عنه فذاك الشخص مقبول‏)\nمگر آن کس که معارفش در او بالا رفته باشد *** و از او (از دهر) باشد، پس آن شخص پذیرفته است.\n(كما الذي تاه في بحر وليس له *** هاد فذلك بالأهواء معلول‏)\nهمچون کسی که در دریایی سرگردان شده و راهنمایی ندارد، *** پس او به هوس‌ها بیمار است.\n(وإن نقلت إلى فقر بغير غنى *** فإنكم لدليل العقل مدلول‏)\nو اگر به فقری بدون غنا منتقل شدی، *** پس شما برای دلیل عقل، مدلول (دلالت شده) هستید.\n\n### [همانا انسان بر صورت الهی است]\n\nبدان، خداوند ولیّ صمیمی تو را توفیق دهد، که هر چیزی را صدری است و معرفت (المعرفة) آن در این طریق از والاترین علوم و معارف است، زیرا عالم و هر جنس بر صورت انسان است و او (انسان) آخرین موجود بود، و انسان به تنهایی در ظاهر و باطن بر صورت الهی است. خداوند برای او صدری قرار داده است. پس میان حق (الحق) و انسان که برای او آخریت است و برای حق (الحق) اولیت، صدورهایی است که عددشان را جز خدا نمی‌داند. پس ما برخی از آن‌ها را که فهم تو به آن می‌رسد و عقلت می‌تواند بپذیرد، مشخص می‌کنیم و از آنچه فهم تو به آن نمی‌رسد و عقلت نمی‌پذیرد، سکوت می‌کنیم. پس ابتدا از بالاترین شروع می‌کنیم و به آخرین درجه فرود می‌آییم. می‌گوییم: صدر در رتبه دوم از هر صورتی است، خواه آن صورت جنسی باشد یا نوعی یا شخصی. پس صدر واجبات، حیات ازلی است که حق (الحق) عز و جل به آن وصف شده است. و صدر اسماء مؤثر، عالم است. و صدر صفات تنزیه، نفی مثلیت است. و صدر أینیت‌ها (مکان‌ها)، عماء (فضای ابری) است که نه بالای آن هواست و نه زیر آن هوا. و صدر هستی (الوجود)، ممکنات است. و صدر موجودات، عقل اول است. و صدر دهر، ما بین ازل و ابد است. و صدر زمان، زمان قبول هیولی برای صورت است. و صدر طبیعت، کیفیت جسم اول است. و صدر کیفیت‌ها، تعلق قدرت به ایجاد است. و صدر کمیت‌ها، تقسیم معانی است. و صدر افلاک، کرسی است. و صدر عناصر، آب است. و صدر شب، غروب شفق سرخ است. و صدر روز، تابش خورشید است نه طلوع آن. و صدر مولدات، حیوان است. و صدر انسان، معروف است. و صدر امت، زمان ادریس است. و صدر این امت، قرن اول است. و صدر دنیا، وجود آدم است. و صدر ایام، روز دوشنبه است. و صدر آخرت، بعث (برانگیختن) است. و صدر برزخ، خواب است. و صدر آتش، موبق (هلاک‌کننده) است. و صدر بهشت، نزول در منازل آن است. و صدر عذاب و نعیم، دیدن اسباب آن‌هاست. و صدر دین، فلان رسول الله است.\n\n### [همانا هر صدری را قلبی است]\n\nو بدان که هر صدری را قلبی است. تا زمانی که قلب در صدر است، کور است، زیرا صدر حجابی بر آن است. پس هرگاه خداوند بخواهد آن را بینا کند، از صدر خود خارج می‌شود و می‌بیند. پس اسباب، صدور موجودات هستند و موجودات مانند قلب‌ها. تا زمانی که موجود به سببی که از آن صادر شده است، می‌نگرد، از شهود (الشهود) خداوندی که او را ایجاد کرده، کور است. پس هرگاه خداوند بخواهد او را بینا کند، نگاه کردن به سببی را که خداوند آن را نزد او ایجاد کرده است، ترک می‌کند و از وجه خاصی که از جانب پروردگارش در ایجاد او به سوی اوست، می‌نگرد؛ خداوند او را بینا می‌سازد. پس اسباب همگی ظلمت‌هایی بر دیدگان مسببات هستند و در آن‌هاست که هر کس از مردم هلاک شده، هلاک گشته است. عارفان (العارفون) آن‌ها را اثبات می‌کنند اما شهود (الشهود) نمی‌کنند و حقشان را می‌دهند اما عبادتشان نمی‌کنند. و غیر از عارفان، با آن‌ها برعکس رفتار می‌کنند؛ آن‌ها را عبادت می‌کنند و حقشان را نمی‌دهند، بلکه آنچه را که از عبودیت حقشان است، غصب می‌کنند و آن‌ها را شهود (الشهود) می‌کنند اما اثباتشان نمی‌کنند. هیچ کس را نمی‌شنوی مگر اینکه می‌گوید: «جز خدا چیزی نیست» و اسباب را نفی می‌کند. اما وقتی او را به گفتارش بگیری یا مصیبتی بر او نازل شود، سبب را مشاهده می‌کند و از کسی که آن را اثبات کرده، کور می‌شود و به او کفر می‌ورزد و به آنچه نفی کرده بود، ایمان می‌آورد. پس اگر برای برخی از مردم اتفاق افتد که آن مصیبت با این سببی که به آن تکیه کرده بود، برطرف نشود و اسباب قطع شوند، در آن هنگام به آن کفر می‌ورزد و به سوی خدا، خالق اسباب، باز می‌گردد. او نمی‌داند به چه کفر ورزیده و به چه ایمان آورده است و معنای سبب و غیر آن را نمی‌داند؛ زیرا اگر می‌دانست که سبب صحیح نیست مگر اینکه مسبب از آن باشد، می‌دانست که سببی که در رفع این مصیبت به آن تکیه کرده بود، به هیچ وجه سبب آن نبوده است؛ زیرا اگر سبب آن بود، آن را رفع می‌کرد. بلکه آن سبب در جلوگیری از رفع مصیبت، خود سببی بود در بازگشت او به سوی خدا در رفع آن. پس او در معنا همواره تحت تأثیر اسباب است، زیرا رفع اسباب محال است. و چگونه بنده می‌تواند چیزی را که خدا اثبات کرده است، رفع کند؟ این در اختیار او نیست، اما جهل مردم را فرا گرفته و آن‌ها را کور و سرگردان کرده و هدایت نکرده است. و خداوند هر که را بخواهد به راه راست هدایت می‌کند (وَاللَّهُ يَهْدِي مَن يَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيمٍ) به واسطه روحی که از امر خدا وحی شده است، پس هر که را از بندگانش بخواهد، به وسیله آن هدایت می‌کند (يَهْدِي بِهِ مَن يَشَاءُ مِنْ عِبَادِهِ). پس هدایت را به روح اثبات کرده است و این جایگاه سبب در عالم است. توقف نزد اسباب با توکل بر خدا منافاتی ندارد. به همین دلیل، سبحانه اسباب را مسببات اسباب دیگر از پایین‌تر قرار داده تا اینکه در نهایت به خداوند سبحانه منتهی شود. پس او سبب اول است، نه از سببی که به واسطه آن بوده باشد. آری، سبب کون (هستی) مرتبه است نه ذات، و سبب مرتبه، کون است. پس سبب کون در ایجاد، مرتبه است و سبب مرتبه در معرفت (المعرفة)، کون است. پس بفهم.\n\n### [هرگاه روز برای حرکت روشن شد، ولادت اشیاء واقع شد]\n\nهنگامی که روز برای حرکت روشن شد، ولادت اشیاء به واسطه آن واقع شد. پس اعیان در عالم حس غالباً پاک شدند و بادها در دریاها وزیدند و امواج متلاطم شدند و کشتی‌ها به حرکت درآمدند و دریاها آنچه را در خود داشتند به دلیل تلاطم امواج بیرون ریختند. و هنگامی که شب برای سکون تاریک شد، بادها آرام گرفتند و امواج ساکن شدند و دریا غالباً آنچه را در خود داشت، نگه داشت و ولادت در برزخ ظاهر شد. پس خواب‌ها و رؤیاهای بشارت‌دهنده و ترسناک، مانند صورت زشت و زیبا در صور مولدات در حس، از افعال و نشأت‌ها بودند. و اغلب وقوع این امر در صدر شب و در صدر روز است، زیرا بادها نمی‌وزند مگر پس از طلوع خورشید؛ در آن هنگام بادها می‌وزند، همان‌طور که بادهای نصرت نمی‌وزند مگر در صدر عصر، یعنی پس از زوال (ظهر)، و به همین دلیل جنگیدن در آن مستحب است. و چون شب محل سکون و شب‌نشینی است و هیچ کس نمی‌خوابد مگر با کسی که او را دوست دارد و غالباً به او آرامش می‌یابد و شب‌نشینی نمی‌کند مگر با کسی که با او انس می‌گیرد، به همین دلیل شب اصل مودت و رحمت بود، تا جایی که کسانی که پادشاهان آن‌ها را عذاب می‌دهند، غالباً فقط در روز عذابشان می‌دهند، اما شب نه؛ زیرا معذب اگر در شب عذاب شود، به دلیل بیداری و بی‌خوابی عذاب می‌کشد و آنچه به او می‌رسد. پس شب زمان سکون و آسایش است و معذب نمی‌خواهد خود را عذاب دهد، پس عذاب را به روز که محل حرکت است، موکول می‌کند. پس اصل دوستی و محبت از شب موجود است و ضد آن در روز موجود است. سپس، غیبت، یعنی غیبت محبوب از محب، غیبت تعلیم و تأدیب است برای آنچه محبت اقتضا می‌کند. زیرا محب اگر در ادعای خود صادق باشد و خداوند او را به غیبت محبوبش مبتلا کند، حرکت شوقی به سوی مشاهده او از او ظاهر می‌شود، پس ادعای او در محبتش تصدیق می‌شود و منزلتش بزرگ می‌شود و پاداشش از تنعم به محبوبش مضاعف می‌گردد. زیرا لذتی که هنگام ملاقات می‌یابد، بزرگ‌تر از لذت همراهی است، مانند شیرینی رسیدن امنیت به شخص ترسان که شیرینی امنیت مستمر، قدرت آن را ندارد. پس با آن، تضاعف نعیم افزایش می‌یابد. به همین دلیل، اهل بهشت در نعمتی متجدد همراه با هر نفس در تمام حواس و معانی و تجلیات (التجلی) خود هستند، پس آن‌ها در طرب دائمی‌اند. از این رو، نعمت آن‌ها بزرگ‌ترین نعمت است به دلیل توقع فراق و توهم عدم مصاحبت. و به دلیل جهل انسان به این مرتبه، او همراهی مستمر را می‌طلبد، در حالی که عارف (العالم) همراهی تجدید نعیم و تفاوت میان دو نعیم را می‌طلبد تا التذاذ به نعمتی جدید واقع شود، همان‌طور که در نفس‌الامر است، اگرچه هر انسانی آن را نشناسد و هر چشمی آن را مشاهده نکند و هر عقلی آن را درک نکند، اما در نفس‌الامر با لحظات متجدد است. و به دلیل جهلی که در این شخص به دلیل عدم مشاهده تجدید در نعیم وجود دارد، ملال واقع می‌شود. پس اگر این جهل از او برطرف شود، ملال از عالم برطرف می‌گردد. پس ملال قوی‌ترین دلیل بر جهل انسان به خداوند در حفظ وجود او و تجدید نعمت‌هایش همراه با هر نفس است. پس خداوند ما را به کشف (الکشف) اتم و مشهد اعم محقق گرداند. چه شریف است عین الیقین و چه سعادتمند است صاحب مشاهده امور بر آنچه هستند. اما خداوند سبحانه با این جهل، حال صاحبان غم‌ها را رعایت کرده است؛ پس این جهل در حق آن‌ها رحمتی است. زیرا اگر آن‌ها تجدید غم خود را در هر لحظه مشاهده می‌کردند، عذابشان نزد آن‌ها همواره بزرگ و آلامشان مضاعف می‌شد. پس چون میان آن‌ها و این مشاهده حائل شد و تصور کردند که همان غم اول است که همراهشان بوده، جایگاه ناگهانی بودن آن در فعل نزد آن‌ها واقع نشد و حمل آن برایشان آسان شد، که این همراهی را رحمتی از جانب خدا و تخفیفی برای خود تصور کردند، مگر در جهنم؛ زیرا اهل آن با هر نفس، تجدید عذاب را مشاهده می‌کنند. و سخن ما تنها در این سرای دنیاست که محل حجاب است، مگر برای عارفان (العارفون) که مقام آخرت را در دنیا دارند. پس برای آن‌ها کشف (الکشف) و مشاهده است و این دو امری هستند که عین الیقین آن‌ها را می‌دهد و آن کامل‌ترین مدارک علم است. پس علمی که از عین حاصل می‌شود، بزرگ‌ترین لذت‌ها را در معلومات لذت‌بخش دارد. پس آن‌ها در آخرت حکماً و در دنیا حساً هستند و در آخرت مکانتاً و در دنیا مکاناً. سپس این امر برای آن‌ها به آخرت از قبر تا بهشت و منازل آخرت میان آن دو متصل می‌شود و این همان قول خداوند متعال است: لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا (لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا) (بشارت برای آن‌ها در زندگی دنیاست) و آن همان چیزی است که در آن هستند از مشاهده آنچه ذکر کردیم، و فِي الْآخِرَةِ (وَفِي الْآخِرَةِ) (و در آخرت) از قبر تا بهشت، پس آن نعمتی پیوسته است. این نعمت عارفان است و این نعمت دائمی برای غیر آن‌ها نیست. سپس، حق (الحق) سبحانه و تعالی در این منزل به بنده مورد عنایت خود امر کرده است که با خلقش باشد، همان‌طور که حق (الحق) در چنین مشهدی با او بود، و هر آنچه که به سعادت آن‌ها می‌انجامد، و آن با نصیحت و تبلیغ است. در دست او جز این امر دیگری نیست. پس بر عارف است که این راهی را که به این مقام می‌رساند، روشن سازد و آن را آشکار کند، اما اعطای این مقام در دست او نیست، زیرا آن مخصوص خداوند متعال است. خداوند متعال می‌فرماید: يَا أَيُّهَا الرَّسُولُ بَلِّغْ (يَا أَيُّهَا الرَّسُولُ بَلِّغْ) (ای پیامبر، ابلاغ کن). پس هنگامی که ابلاغ کرد، به او گفته شد: فَإِنَّمَا عَلَيْكَ الْبَلَاغُ (فَإِنَّمَا عَلَيْكَ الْبَلَاغُ) (جز این نیست که بر تو ابلاغ است) لَيْسَ عَلَيْكَ هُدَاهُمْ (لَيْسَ عَلَيْكَ هُدَاهُمْ) (هدایت آن‌ها بر عهده تو نیست) إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ (إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ) (تو هر که را دوست داری هدایت نمی‌کنی، بلکه خداوند هر که را بخواهد هدایت می‌کند). و چه نیکوست قول او در حقایق: وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ (وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ) (و او به هدایت‌یافتگان داناتر است)، زیرا علم تنها به معلوم آن‌گونه که معلوم است، تعلق می‌گیرد. و فرمود: لَعَلَّكَ بَاخِعٌ نَّفْسَكَ أَلَّا يَكُونُوا مُؤْمِنِينَ (لَعَلَّكَ بَاخِعٌ نَّفْسَكَ أَلَّا يَكُونُوا مُؤْمِنِينَ) (شاید تو جان خود را از غصه اینکه ایمان نمی‌آورند، هلاک کنی). پس وظیفه رسولان و وارثان از علما تنها ابلاغ با بیان و آشکارسازی است و نه غیر آن. و پاداش آن‌ها پاداش کسی است که عطا کرده و بخشیده است، و دلالت‌کننده بر خیر مانند انجام‌دهنده خیر است، زیرا دلالت بر خیر از خیر است. پس این منزل شامل علم استناد و مستندٌ‌الیه، که بزرگ‌ترین استنادات است، یعنی استناد الهی، می‌شود. و آن استناد اسماء الهی به محل‌های وجود آثارشان برای تعیین مراتبشان است، و استناد محل‌ها به اسماء الهی برای ظهور اعیانشان. پس این بالاترین استنادات و بالاترین مستندٌ‌الیه‌هاست. ما تو را بر سر راه انداختیم، پس بر آن فرود و صعود کن. و از اینجا دانسته می‌شود که مردم در چه چیزی سرگردان شده‌اند، از قبیل برتری دادن فقر بر غنا و غنا بر فقر، و فرو رفتن در این مسئله از فضول (کارهای بیهوده) است که در عالم و جهل موجود در آن است. زیرا حالات متفاوتند و منازل مختلفند و کمال هر حالتی در وجود عین آن است. خداوند می‌فرماید: أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ (أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ) (به هر چیزی خلقتش را عطا کرد). پس این آیه برای کسی که آن را بفهمد و به آن تحقق یابد، راهی برای فرو رفتن در فضول باقی نگذاشته است، جز اینکه فضول نیز از خلق خداست. پس خداوند خلقت فضول را به آن عطا کرده است، ثُمَّ هَدَى (ثُمَّ هَدَى) (سپس هدایت کرد)، یعنی بیان کرد که کسی که فضول در اوست، همان کسی است که به مشغول شدن به آنچه به او مربوط نیست و جهلش به امری که به او مربوط است، تعبیر می‌شود. و فقر در عین خود کامل‌الخلق است و در غنا قدمی ندارد، و غنا در حال خود کامل‌الخلق است و در فقر قدمی ندارد. و اگر امور در هم تداخل می‌کردند، فقر عین غنا و غنا عین فقر می‌شد، زیرا هر یک از آن‌ها از مقومات صاحبش است، و ضد، عین ضد نمی‌شود، اگرچه در امری با هم جمع شوند. پس غنا و فقر هرگز با هم جمع نمی‌شوند. پس فقر در وجودش نزد خدا منزلتی ندارد و غنا در وجودش نزد بنده منزلتی ندارد. همان‌طور که گفته نمی‌شود خدا افضل از خلق است یا خلق، همچنین گفته نمی‌شود غنا افضل از فقر است یا فقر افضل از غنا. پس فقر صفت خلق است و غنا صفت حق (الحق) است، و مفاضله (برتری دادن) صحیح نیست مگر در کسانی که یک جنس آن‌ها را جمع کند، و هیچ جامعی میان حق (الحق) و خلق نیست، پس مفاضله‌ای میان غنا و فقر نیست. خداوند متعال در مورد غنا می‌فرماید: فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ (فَإِنَّ اللَّهَ غَنِيٌّ عَنِ الْعَالَمِينَ) (همانا خداوند از جهانیان بی‌نیاز است). و در مورد فقر می‌فرماید: يَا أَيُّهَا النَّاسُ أَنتُمُ الْفُقَرَاءُ إِلَى اللَّهِ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ (يَا أَيُّهَا النَّاسُ أَنتُمُ الْفُقَرَاءُ إِلَى اللَّهِ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ) (ای مردم، شما نیازمندان به خدا هستید و خداوند همان بی‌نیاز ستوده است). پس کسی که پس از دانستن این، بگوید غنا بهتر از فقر است یا فقر بهتر، مانند کسی است که بگوید خدا بهتر است یا خلق. و همین جهل برای گوینده آن کافی است. اما آنچه در دست مردم است و آن را غنا می‌نامند، چگونه می‌تواند غنا باشد در حالی که تو به آن فقیر هستی و در غنای خود از غنای خود بی‌نیاز نیستی؟ پس غنای تو عین فقر توست. و این در حقیقت غنا نامیده نمی‌شود. پس چگونه مفاضله میان چیزی که وجود حقیقی دارد، یعنی فقر، و چیزی که وجود حقیقی ندارد، یعنی غنای تو، واقع می‌شود؟ و اگر انسان غنی نامیده شود، این تعبیری است از وجود سبب مؤثری نزد او در آنچه در آن وقت غرضی دارد. پس به واسطه آن سبب، در آنچه به آن نیازمند است، به دلیل وجود آن سبب، غنی می‌شود. پس او فقیر ذاتی است در غنای عرضی خود. و اگر وجود سبب مؤثر در آنچه به آن نیازمند است، نزد او نباشد، فقیر نامیده می‌شود بدون غنا. پس فقر در هر دو حال برای اوست، زیرا ذات او در هر دو حال برای اوست. و اگر امر چنین باشد، طلب مفاضله، جهل میان وصف حقیقی و وصف اضافی عرضی است. و از جمله آنچه این منزل در بر می‌گیرد، آنچه بر عالم و متعلم و سائل و مسئول لازم است. پس بخشی از آن را به دلیل نیاز مبرم به آن بیان می‌کنیم، زیرا در اغلب اوقات از مردم واقع می‌شود. و آن این است که جاهل هنگامی که می‌آید تا از عالم در مورد امری سؤال کند که آن را از وجهی که سؤال می‌کند نمی‌داند، اما به اندازه‌ای از وجهی که او را به سؤال واداشته است، می‌داند؛ مانند کسی که صدایی را از پشت حجاب می‌شنود، پس قطعاً می‌داند که پشت حجاب امری است که نمی‌داند چیست، یا محل آن حس را نمی‌داند، و شاید پشت آن پرده نباشد. پس از کسی که محل آن پرده را می‌داند، می‌پرسد که آیا پشت آن چیزی هست که بتوان حس کرد یا نه، و اگر هست، چیست؟ پس سؤال از سائل در مورد چیزی که نمی‌داند، به واسطه وجهی معلوم نزد او تصور می‌شود که متضمن چیزی است که جز پس از سؤال از آن دانسته نمی‌شود. و بر این مقام برخی از نظریه‌پردازان اشکالاتی وارد کرده‌اند و با همین مقدار آن اشکال برطرف می‌شود. و کتاب ما از جمله کتاب‌هایی نیست که مقصود از آن نسبت‌های فکری نظری باشد، بلکه برای علوم وهبی کشفی (الکشف) وضع شده است. عادت در میان علمای قاصر از آنچه ذکر کردیم، بر این جاری شده است که اگر متعلم سائل بیاید تا از عالم در مورد امری که نمی‌داند سؤال کند، اگر آن مسئله با توجه به حال سائل عظیم باشد، به او می‌گوید: «از آنچه به تو مربوط نیست سؤال نکن، این قدر تو نیست و از فهم پاسخ این سؤال قاصر هستی.» و امر نزد ما و در نفس‌الامر چنین نیست، بلکه قصور در مسئول است، زیرا او وجهی را که آن مسئله با توجه به این سائل تحمل می‌کند، ندانسته است تا آن را به او بیاموزد و فایده‌ای را که در مورد آن سؤال کرده است، به دست آورد و وجوهی از آن را که عقلش تحمل نمی‌کند و فهمش به آن نمی‌رسد، از او بپوشاند. پس سائل از پاسخ عالم شاد می‌شود و به واسطه آن وجه، عالم به آن مسئله می‌گردد و آن وجهی صحیح است. اگر علم آن وجه از عالم فهیم و باهوش فوت شود، به اندازه همان وجه از مسئله فوت شده است. پس فهیم باهوش با کندذهن در عدم استیعاب وجوه آن مسئله برابر شده است. هیچ سائل هرگز در مسئله‌ای سؤال نکرده است که اهلیت قبول پاسخ آن را نداشته باشد. و رسول خدا (صلی الله علیه و سلم) در این باب، در تأدیب صحابه، آنچه را که باید در آن تأدیب شود، به ما آموخته است. و آن این است که مردی نزد رسول خدا (صلی الله علیه و سلم) آمد در حالی که ایشان در میان اصحابش بودند، و گفت: «ای رسول خدا، من از شما درباره لباس‌های اهل بهشت می‌پرسم؛ آیا خلقی است که خلق می‌شود یا بافته‌ای است که بافته می‌شود؟» حاضران از سؤال او خندیدند. رسول خدا (صلی الله علیه و سلم) خشمگین شد و فرمود: «آیا می‌خندید که جاهلی از عالمی سؤال کرده است؟ ای مرد، آن‌ها از میوه بهشت شکافته می‌شوند.» پس به گونه‌ای به او پاسخ داد که او را راضی کرد و به اصحابش ادب با سائل را آموخت، خجالت او را برطرف کرد و او عالمی شادمان بازگشت. و خداوند متعال فرمود: وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ (وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ) (و اما سائل را از خود مران). پس این حکم را عمومیت داد، اگرچه مقصود در سبب نزول آن، سؤال در علم باشد، زیرا این تعلیمی است برای حالتی سابق که برای رسول خدا (صلی الله علیه و سلم) بود و آن قول اوست: وَوَجَدَكَ ضَالًّا فَهَدَى (وَوَجَدَكَ ضَالًّا فَهَدَى) (و تو را سرگشته یافت، پس هدایت کرد)، یعنی حیران بودی، پس امر را برای تو آشکار ساخت. پس سائل اگر نزد تو آید و سؤال کند، او در منزلت توست هنگامی که سرگشته بودی، پس او را مران، همان‌طور که من تو را نراندنم، و برای او بیان کن، همان‌طور که برای تو بیان کردم. همان‌طور که به او فرمود، در تعلیم حالتی که برای او پیش از این بود، در قولش: أَلَمْ يَجِدْكَ يَتِيمًا فَآوَى (أَلَمْ يَجِدْكَ يَتِيمًا فَآوَى) (آیا تو را یتیم نیافت، پس پناه داد؟). پس تو را خوار نکرد و با قهر به دلیل یتیمی و شکستگی‌ات طرد نکرد. پس یتیم را اگر یافتی، او را مقهور مکن و با او مهربان باش و پناهش ده و به او نیکی کن. رسول خدا (صلی الله علیه و سلم) فرمود: (إن الله أدبني فأحسن تأديبي) «همانا خداوند مرا تأدیب کرد و تأدیبم را نیکو گردانید.» پس شایسته است که ما از آداب الهی که خداوند سبحانه پیامبرانش را با آن‌ها تأدیب کرده است، پیروی کنیم، مانند این و مانند قولش به نوح: إِنِّي أَعِظُكَ أَن تَكُونَ مِنَ الْجَاهِلِينَ (إِنِّي أَعِظُكَ أَن تَكُونَ مِنَ الْجَاهِلِينَ) (من تو را پند می‌دهم که از جاهلان نباشی). پس در قولش «پند می‌دهم» به دلیل پیری و کهولت سن او با او مدارا کرد، و مخاطب قرار دادن پیران حدی و وصفی معلوم دارد و مخاطب قرار دادن جوانان حدی معلوم. و در حق محمد رسولش (صلی الله علیه و سلم) فرمود: فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ (فَلَا تَكُونَنَّ مِنَ الْجَاهِلِينَ) (پس هرگز از جاهلان مباش). پس آن لطف کجا و این قهر کجا؟ آن به دلیل ضعف پیری است و این به دلیل قوت جوانی. و مرتبه پنجاه سالگی کجا و مرتبه پانصد سال و بیشتر کجا؟ پس خطاب بر حسب حالات واقع شد، در اولین رسولان که نوح بود و در آخرین آن‌ها که محمد (صلی الله علیه و سلم) بود و بر همه انبیا. و از آداب الهی هر چیزی است که در قرآن آمده است از «چنین کن» و «چنین مکن». پس در قرآن بنگر تا به ادب الهی احاطه یابی و آن را به کار ببر تا ان‌شاءالله موفق شوی. وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ) (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 4
}