{
  "id": 341,
  "title": {
    "ar": "الباب الأحد والأربعون وثلاثمائة في معرفة منزل التقليد في الأسرار",
    "en": "Chapter 341: Concerning the Gnosis of the Station of Imitation (al-taqlīd) within the Esoteric Mysteries.",
    "ur": "باب تین سو اکتالیسواں: اسرار (الأسرار) میں منزل تقلید (التقليد) کی معرفت کے بیان میں",
    "fa": "باب سیصد و چهل و یکم در معرفت منزل تقلید در اسرار"
  },
  "content": {
    "ar": "## «الباب الأحد والأربعون وثلاثمائة في معرفة منزل التقليد في الأسرار»\n\n\n> في كل حكم من الأحكام تقليد *** وفيه سلطنة فينا وتأييد\n\n\n> لولاه ما كان لي في علمنا قدم *** به ولا كان تنزيل وتوحيد\n\n\n> إن الخلافة تقليد وسلطنة *** فهي الإمام الذي للحق مشهود\n\n\n> هي الأمانة ما ينفك صاحبها *** في طاعة وهو عند الله محمود\n\n\n> جميع من في وجود الله يرقبه *** في سره فهو في الأكوان مقصود\n\n\n> حلاه ربي بما تعطيه حضرته *** من الصفات فما في العلم موجود\n\n\n> سواه فهو إمام الخلق كلهم *** وهو الإله فمجهول ومحدود\n\n\n### [أن التقليد هو الأصل الذي يرجع إليه كل علم نظري أو ضروري أو كشفي‏]\n\n\nاعلم أيدنا الله وإياك بروحه القدسي أن التقليد هو الأصل الذي يرجع إليه كل علم نظري أو ضروري أو كشفي لكنهم فيه على مراتب فمنهم من قلد ربه وهم الطائفة العلية أصحاب العلم الصحيح ومنهم من قلد عقله وهم أصحاب العلوم الضرورية بحيث لو شككهم فيها\n\n\nمشكك بأمر إمكاني ما قبلوه مع علمهم بأنه ممكن ولا يقبلونه فإذا قلت لهم في ذلك يقولون لأنه لا يقدح في العلم الضروري وأمثلته كثيرة لا أذكرها من أجل النفوس الضعيفة لقبولها فيؤدي ذلك إلى ضرر وهوس فذلك يمنعني أن أبينها ومنهم من قلد عقله فيما أعطاه فكره وما ثم إلا هؤلاء فقد عم التقليد جميع العلماء والتقليد تقييد فما خرج العالم عن حقيقته فإنه الموجود المقيد فلا بد أن يكون علمه مقيدا مثله والتقييد فيه عين التقليد غير أنه ذم في بعض المواطن وهي معلومة وحمد في بعض المواطن وهي معلومة وليس في المنازل أصعب مرتقى من هذا المنزل هو أصعب من منزل عقبات السويق لأن صاحب ذلك المنزل تارة وتارة وصاحب هذا المنزل ثابت القدم فيه فإذا كان التقليد هو الحاكم ولا بد ولا مندوحة عنه فتقليد الرب أولى فيما شرع من العلم به فلا تعدل عنه فإنه أخبرك عن نفسه في العلم به فيما قلدت فيه عقلك من حيث تقليده لفكره الناظر به في دليله وأعطاك نقيضه من العلم به والأصل في العالم الجهل والعلم مستفاد فالعلم وجود والوجود لله والجهل عدم والعدم للعالم فتقليد الحق الذي له الوجود أولى من تقليد من هو مخلوق مثلك فكما استفدت منه سبحانه الوجود فاستفد منه العلم فقف عند خبره عن نفسه بما أخبر ولا تبال بالتناقض في الأخبار فإنه لكل خبر مرتبة ينزل ذلك الخبر فيها وأنت الحضرة الجامعة لتلك المراتب فكن على بينة من ربك لم تقل من عقلك لأنه لا يحيلك إلا على نفسه لأنه خلقك له فلا يعدل بك عنه فإذا تجلى لك في ضرورة عقلك وجدت استنادك ولا بد إلى أمر ما لا تعلمه من حيث تقليدك لهذه الضرورة العقلية فإذا تجلى لك في نظر عقلك وجدت في نفسك أن هذا الذي استندت إليه في وجودك أمر وجودي لا يشبهك إذ عينك وكل ما يقوم بك ويكون وصفا لك محدث مفتقر إلى موجد مثلك فيقول لك عقلك من حيث نظره إن هذا الموجود ليس مثله شي‏ء من العالم وأنت جميع العالم لأن كل جزء من العالم يشترك مع الكل في الدلالة على ما قررناه وإذا تجلى لك في الشرع أبان لك عن التفاوت في مراتب العالم فتجلى لك في كل مرتبة فقلد في ذلك الشارع حتى يكشف لك فترى الأمر على صورة ما أنت به فقلدت ربك فرأيته مشبها ومنزها فجمعت وفرقت ونزهت وشبهت وكل ذلك أنت لأنه تجل إلهي في المراتب وأنت الجامع لها وهي لك وللعالم كله وهي الحاكمة على كل من ظهر فيها فينصبغ في عين الناظر إليه بها ولذلك قلت لك وكل ذلك أنت فإن العالمين من العلامة والعلامة لا تدل إلا على محدود فلا تدل إلا عليك فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ فالعالم لا يدل على العلم بذاته وإنما يدل على العلم بوجوده‏\n\n\n### [أن الحق هو على الحقيقة أم الكتاب‏]\n\n\nفاعلم أن الحق هو على الحقيقة أم الكتاب والقرآن كتاب من جملة الكتب إلا أن له الجمعية دون سائر الكتب ومع هذا فإنه صفة الحق والصفة تطلب من تقوم به والنسبة تطلب‏\nمن تنسب إليه فلذلك قلنا فيه إنه أم الكتاب الذي عنه خرجت الكتب المنزلة واختلفت الألسنة به لقبوله إياها بحقيقته فقيل فيه إنه عربي وإنه عبراني وإنه سرياني بحسب اللسان الذي أنزل به وهذا هو عين الجعل في القرآن وعين نسبة الحدوث إليه في قوله ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ فهو محدث الإتيان وما هو الإتيان عين الإنزال كما أنه ليس بعين الجعل والجعل يكون بمعنى الخلق وبغيره فما ينسب إلى القرآن من قوله محدث فهو من حكم الجعل الذي بمعنى الخلق فلا فرق بين قوله ثُمَّ جَعَلْناهُ نُطْفَةً في قَرارٍ مَكِينٍ وبين قوله إِنَّا جَعَلْناهُ قُرْآناً عَرَبِيًّا في الحكم‏\n\n\n### [أن تحقيق عندية كل شي‏ء راجعة إلى نفسه‏]\n\n\nواعلم أن تحقيق عندية كل شي‏ء راجعة إلى نفسه ولهذا قال ما عِنْدَكُمْ يَنْفَدُ فإن حكمكم النفاد وما عِنْدَ الله باقٍ فإنه له البقاء فلو كانت عندية الشي‏ء غير نفس الشي‏ء ما نفد ما عندنا لأنا وما عندنا عند الله وما عِنْدَ الله باقٍ فنحن وما عندنا باق فتبين لك أن عندية كل شي‏ء نفسه والعندية في اللسان ظرف مكان أو ظرف محلي كالجسم للعرض اللوني الذي يدركه البصر فهو أجلي فيما ترومه من الدلالة فهو بحيث محله وصاحب المكان ما هو بحيث المكان والعندية جامعة للأمرين ولما لم يمكن في التقليد الضروري أن يجحد أحد من استند إليه في وجوده لذلك أقر به من من شأنه الإنكار والجحود فإن قلت فالمعطلة أنكرت قلنا المعطلة ما أنكرت مستندا وإنما أنكرت وعطلت الذي عينتموه أنتم إنه المستند ما عطلت المستند فقلتم أنتم هو كذا فعطلته المعطلة وقالت بل المستند كذا فكما إن أولئك معطلة أنتم أيضا معطلة تعطيلهم لكن اختص أولئك باسم المعطلة وهم على ضروب في التعطيل محل العلم بذلك وأمثاله العلم بالنحل والملل وهو علم لا ينبغي للمؤمن أن يقرأه ولا ينظر فيه جملة كما يتعين على أهل الله أن يعرفوا علم كل نحلة وملة بالله ليشهدوه في كل صورة فلا يقومون في موطن إنكار لأنه تعالى سار في الوجود فما أنكره إلا محدود وأهل الله تابعون لمن هم له أهل فيجري عليهم حكمه وحكمه تعالى عدم التقييد فله عموم الوجود فلأهله عموم الشهود فمن قيد وجوده قيد شهوده وليس هو من أهل الله‏\n\n\n### [أن الله وصف نفسه بالاستواء وبالنزول إلى السماء]\n\n\nواعلم أن الله لما مهد هذه الخليقة جعلها أرضا له فوصف نفسه بالاستواء وبالنزول إلى السماء وبالتصرف في كل وجهة الكون موليها فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرامِ فإنه لا يرفع حكم إن وجه الله حيثما توليت ولكن الله اختار لك ما لك في التوجه إليه سعادتك ولكن في حال مخصوص وهي الصلاة وسائر الأينيات ما جعل الله لك فيها هذا التقييد فجمع لك بين التقييد والإطلاق كما جمع لنفسه بين التنزيه والتشبيه فقال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ فالعالم كله أرض ممهدة لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً هل ترى من تفاوت فَارْجِعِ الْبَصَرَ قُرْآناً عَرَبِيًّا غَيْرَ ذِي عِوَجٍ والحق صفة العالم لأن صفته الوجود وليس إلا لله ولذلك‏\n\n\nورد في الخبر الصحيح كنت سمعه وبصره‏\n\n\nوهكذا جميع قواه وصفاته فلما كان العالم ظرفا مكانيا لمن استوى عليه ظهر بصورته سئل الجنيد عن المعرفة والعارف فقال لون الماء لون إنائه فجعل الأثر للظرف في المظروف وذلك لتعلم من عرفت فتعلم أنك ما حكمت على معروفك إلا بك فما عرفت سواك فأي لون كان للإناء ظهر الماء للبصر بحسب لون الإناء فحكم من لا علم له بأنه كذا لأن البصر أعطاه ذلك فله التجلي في كل صورة من صور الأواني من حيث ألوانها فلم يتقيد في ذاته الماء ولكن هكذا تراه وكذلك تؤثر فيه أشكال الظروف التي يظهر فيها وهو ماء فيها كلها فإن كان الوعاء مربعا طهر في صورة التربيع أو مخمسا ظهر في صورة التخميس أو مستديرا ظهر في صورة الاستدارة لأن له السيلان فهو يسرى في زوايا الأوعية ليظهر تشكلها فهو الذي حمل الناظرين لسريانه إن يحكموا عليه بحكم الأوعية في اللون والشكل فمن لم يره قط إلا في وعاء حكم عليه بحكم الوعاء ومن رآه بسيطا غير مركب علم إن ما ظهر فيه من الأشكال والألوان إنما هو من أثر الأوعية فهو في الأوعية كما هو في غير وعاء بحده وحقيقته ولهذا ما زال عنه اسم الماء فإنه يدل عليه بحكم المطابقة فهذه الأوعية له كالسبل في الأرض للسالك فيها فينسب السالك في كل سبيل منها إلى أنه طالب غاية ذلك السبيل الذي سلك عليه في أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ من صوره فيكون هو الظاهر لا أنت لأن الظهور للصور لا للعين فالعين غيب أبدا والصور شهادة أبدا\n\n\n### [إن الله بين أن في أرض العالم نجدين‏]\n\n\nثم إنه لما خلق من كل شي‏ء زوجين بين لنا أن في أرض العالم نجدين نجدا تكون غايته أنت عند قوم ونجد عند هؤلاء القوم يكون غايته هو أعني الحق وأما عند قوم آخرين‏\nفالنجد الواحد تكون غايته أنت في هو والنجد الآخر يكون غايته هو في أنت وأما عند قوم آخرين فالنجد الواحد تكون غايته أنت عين هو والنجد الآخر تكون هو عين أنت وأما عند قوم آخرين فيكون غاية النجدين هو وعين النجدين أنت وعين السالك هو وأما عند قوم آخرين فيكون غاية النجدين وعين النجدين وإنهما عين اليدين وعين السالك أنت وكل من ذكرناه على صراط مستقيم فتعويج القوس للرمي عين صراطه المستقيم ف لا يَزالُونَ مُخْتَلِفِينَ إِلَّا من رَحِمَ رَبُّكَ فما زلنا من الخلاف لأنهم قد خالفوا المختلفين ولذلك خلقهم فما تعدى كل خلق ما خلق له فالكل طائع وإن كان فيهم من ليس بمطيع مع كونه طائعا\n\n\n### [إن الاستواء صفة للحق على العرش‏]\n\n\nولما كان الاستواء صفة للحق على العرش وخلق الإنسان على صورته جعل له مركبا سماه فلكا كما كان العرش فلكا فالفلك مستوي الإنسان الكامل وجعل لمن هو دون الإنسان الكامل مركبا غير الفلك من الأنعام والْخَيْلَ والْبِغالَ والْحَمِيرَ ليستوي الإنسان على ظهور هذه المراكب وشاركهم في ركوبها الإنسان الكامل فالكامل من الناس يستوي على كل مركوب وغير الكامل لا يستوي على الفلك إلا بحكم التبعية لا لعينه كما ورد في اليقين حين‏\n\n\nقال عليه السلام في عيسى عليه السلام لو ازداد يقينا لمشى في الهواء\n\n\nيشير إلى إسرائه ومعلوم أن عيسى عليه السلام أكثر يقينا منا لا من النبي صَلَّى اللهُ عَليهِ وسَلَّم ونحن نمشي في الهواء بحكم التبعية لمن نحن أمته صَلَّى اللهُ عَليهِ وسَلَّم لا بأنا أكثر في اليقين من عيسى عليه السلام كما إن أمة عيسى عليه السلام قد مشت على الماء كما مشى عليه السلام على الماء ولكن نعلم وإن كان الأمر في هذا في حقنا بحكم التبعية أن كل الأمة ما مشت في الهواء كما مشى محمد صَلَّى اللهُ عَليهِ وسَلَّم لأنه لم يكن بعض أمته تابعا له في كل ما أمر بأن يتبع فيه فمن وفى بحق اتباعه كان له حكمه كما قال أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي وأين المشي في الهواء في الشرف لمن يكون الحق سمعه وبصره في الدءوب على نوافل الخيرات المنتجة أو المنتج ذلك الدءوب عليها لمحبة الله إياه وتلك المحبة أنتجت له أن يكون الحق سمعه وبصره فهذا معنى قولنا بحكم التبعية لما أمر به ونهي عنه لا من كوننا أمة له فقط بل من المجموع وهو اتباع خاص لأنه نبي معين خاص دون غيره فيورث اتباع شريعته بالعمل ما يكون عليه من أحوال‏\n\n\nرسول تلك الشريعة وهذه عناية من الله تعالى فإن أمة كل نبي لا تطيق حال نبيها إذ لو أطاقته لكانت مثلا له فتستقل بالأمر دونه وليس الأمر كذلك فإنه لو طلع حيثما طلع لا يزال تابعا وقد أبان صَلَّى اللهُ عَليهِ وسَلَّم عن مثل هذا فقال من سن سنة حسنة فله أجرها وأجر من عمل بها\n\n\nفله الزيادة عليهم بما له من أجرها الزائد على أجر العاملين بها وليس لهم ذلك الأجر الخاص به فلا يلحقونه أبدا في ذلك المقام فهم تابعون له دنيا وآخرة وكشفا والرسل عليه السلام منهم ظهرت السنن فلا تزال أممهم أتباعا لهم أبدا\n\n\n### [أن الله تعالى مطلق الوجود ولم يكن له تقييد مانع من تقييد]\n\n\nواعلم أن الله تعالى لما كان له مطلق الوجود ولم يكن له تقييد مانع من تقييد بل له التقييدات كلها فهو مطلق التقييد لا يحكم عليه تقييد دون تقييد فافهم معنى نسبة الإطلاق إليه ومن كان وجوده بهذه النسبة فله إطلاق النسب فليست نسبة به أولى من نسبة فما كفر من كفر إلا بتخصيص النسب مثل قول اليهود والنصارى عن أنفسهم دون غيرهم من أهل الملل والنحل نَحْنُ أَبْناءُ الله وأَحِبَّاؤُهُ فإذ وقد انتسبوا إليه كانوا يعمون النسبة وإن كانت خطأ في نفس الأمر فقال لهم الله فَلِمَ يُعَذِّبُكُمْ بِذُنُوبِكُمْ بَلْ أَنْتُمْ بَشَرٌ مِمَّنْ خَلَقَ يقول تعالى النسبة واحدة فلم خصصتم نفوسكم بها دون هؤلاء وإن أخطأتم في نفس الأمر فخطؤكم من عموم النسبة أقل من خطئكم من خصوصها فإن ذلك تحكم على الله من غير برهان وأما طائفة أخرى فجعلوا لله ما يكرهون فقالوا الملائكة بنات الله فحكموا عليه بأنه أَصْطَفَى الْبَناتِ عَلَى الْبَنِينَ فتوجه عليهم الحكم بالإنكار في حكمهم مع كونهم يكرهون ذلك لنفوسهم مع كونهم يقولون في الشركاء ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ مع كونهم جعلوا لله جزءا من عباده فلو أضافوا الكل إليه لم يكن ذلك من الكفر الظاهر بل يكون الحكم فيه بحكم ما نسبوا فإن وقعت النسبة العامة للخلق بكونهم عبيدا سعدوا وإن وقعت بالنبوة طولبوا بما قصدوا فإن استندوا ذلك إلى خبر إلهي سلموا بل سعدوا مثل قوله لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً لَاصْطَفى‏ فأجاز التبني بل فيه رائحة من كون جبريل تمثل لمريم بَشَراً سَوِيًّا وقد وصف الحق تعالى نفسه بالتحول في الصور وأجرى أحكامها عليه وهو علم يومي إليه لأجل الايمان ولا يفشي في‏\nالعموم لما يسبق إلى النفوس من ذلك وبقي تعلق الاصطفاء بمن يتعلق هل بالصاحبة فيكون من باب التجلي في الصور فيكون عين الصورتين لأنه قال لَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً يعني الولد لَاتَّخَذْناهُ من لَدُنَّا وما له ظهور إلا من الصاحبة التي هي الأم فيكون الاصطفاء في حق الصاحبة وهي من لدنه فما خرج عن نفسه كما إن آدم عليه السلام ما خرج عن نفسه في صاحبته فما نكح إلا من هو جزء منه به وبالمجموع يكون نفسه فهو قوله من لَدُنَّا وجاء بحرف لو فدل على الامتناع فلم يكن من الوجهين فإن كان الاصطفاء للبنوة فذلك التبني لا البنوة وإن استندوا إلى غير خبر إلهي وأعني بالخبر الإلهي ما جاء على لسان الرسل في الكتب أو في الوحي فإن كان استنادهم إلى كشف إلهي واطلاع في ذلك فهم تحت حكم ما اطلعوا ولا عذر للمقلدة في ذلك لأن فيهم الأهلية للاطلاع بحكم النشأة فإن لها استعدادا عاما وهو الاستعداد للاطلاع وإن تفاضل الاطلاع فذلك لاستعداد آخر خاص غير الاستعداد العام فأهل الجبر إذا استمسكوا بالخبر سعدوا وإن أخطئوا في التأويل ولم يصادفوا العلم فلهم ثواب الاجتهاد وإن أصابوا فهو المقصود فمنهم من هو عَلى‏ بَيِّنَةٍ من رَبِّهِ بإصابته ومنهم من ليس على بينة من ربه وهو مصيب في نفس الأمر وكل من له متمسك إلهي فهو ناج وأما من كفر بالكل فذلك غاية العمي‏\n\n\n(وصل) في التحضيض الكوني‏\n\n\nوهو سر جعله الله في عباده العامة والسالكين في هذا الطريق وأما الخاصة فلا يقع منهم ذلك أبدا لأنه ليس بنعت إلهي إلا أنه جاء من الله فيما يرجع إلى الكون لا فيما يرجع إليه سبحانه مثل قوله لَوْ لا جاؤُ عَلَيْهِ بِأَرْبَعَةِ شُهَداءَ وأما أداة لو فهي إلهية وتتضمن معنى التحضيض وقد اتصف بها خاصة الله‏\n\n\nفقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم لو استقبلت من أمري ما استدبرت ما سقت الهدى ولجعلتها عمرة ولكني سقت الهدى فلا يحل مني حرام حَتَّى يَبْلُغَ الْهَدْيُ مَحِلَّهُ‏\n\n\nفرائحة التحضيض في لو هو ما يفهم منه كأنه قال لنفسه هلا أحرمت بعمرة ولا يقع التحضيض من الخواص أبدا إلا فيما شغلوا به نفوسهم من الأفعال التي ترضي الله فيبدو لهم في ثاني زمان رضي الله في فعل ما هو أتم وأعلى من الأول إما في جناب الله أو في حق نفسه أو في حق الغير رفقا بهم وشفقة عليهم لا يقع منهم على جهة الاعتراض على الله بأن يقولوا هلا فعل الله كذا عوضا من فعله كذا هذا لا يتصور من الخواص أبدا فإنه سوء أدب مع الله تعالى وترجيح تدبير كوني على تدبير إلهي وما وصف الحق نفسه بأنه يُدَبِّرُ الْأَمْرَ إلا أن يعرفنا أنه ما عمل شيئا إلا ما تقتضيه حكمة الوجود وأنه أنزله موضعه الذي لو لم ينزله فيه لم يوف الحكمة حقها وهو الَّذِي أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ ولذلك لا يمكن أن يظهر لعباده في صفة تحضيض بالنظر إليه فوضعه في اللسان بل في جميع الألسنة ابتلاء لعباده وتمحيصا ليجتنبه أهل العناية فيتميزوا بذلك عن غيرهم‏\n\n\n### [أن السعادة غير كمال الصورة]\n\n\nواعلم أن الاختصاص الإلهي الذي يعطي السعادة غير الاختصاص الإلهي الذي يعطي كمال الصورة وقد يجتمعان أعني الاختصاصين في حق بعض الأشخاص فالاختصاص الذي يعطي السعادة هو الاختصاص بالإيمان والعصمة من المخالفة أو بموت عقيب توبة والاختصاص الذي يعطي كمال الصورة هو الذي لا يعطي إلا نفوذ الاقتدار والتحكم في العالم بالهمة والحس والكامل من يرزق الاختصاصين وأقوى التأثير تأثير من يغضب الله كقوم فرعون حيث قال تعالى فيهم فَلَمَّا آسَفُونا انْتَقَمْنا مِنْهُمْ أي أغضبونا ولله سبحانه نفوذ الاقتدار فانتقم منهم ليجعلهم عبرة للآخرين وجعل ذلك مقابلا لنفوذ الاقتدار الكوني لأنه قال آسَفُونا أ لا ترى إلى علم فرعون في قوله فَلَوْ لا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ من ذَهَبٍ يقول فلو وهو حرف تحضيض أعطى يعني موسى نفوذ الاقتدار فينا حتى لا ننازعه ونسمع له ونطيع لأن اليدين محل القدرة والأسورة وهو شكل محيط من ذهب أكمل ما يتحلى به من المعادن ونفوذ الاقتدار من الاختصاص الإلهي يقول لقومه فما أعطى ذلك موسى والذي يدلك على ما قلناه إن فرعون أراد هذا المعنى في هذا القول أنه جاء بأو بعده وهي حرف عطف بالمناسب فقال أَوْ جاءَ مَعَهُ الْمَلائِكَةُ مُقْتَرِنِينَ لعلمه بأن قومه يعلمون أن الملائكة لو جاءت لانقادوا إلى موسى طوعا وكرها يقول فرعون فلم يكن لموسى عليه السلام نفوذ اقتدار في حتى أرجع إلى قوله من نفسي بأمر ضروري لا نقدر على دفعه فترجعوا إلى قوله لرجوعي ولا جاء معه من يقطع باقتدارهم فَاسْتَخَفَّ قَوْمَهُ أي لطف معناهم بالنظر فيما قاله لهم فلما جعل فيهم هذا حملهم على تدقيق النظر في ذلك ولم يكن لهم هذه الحالة قبل ذلك فأطاعوه ظاهرا بالقهر الظاهر لأنه في‏\nمحل يخاف ويرجى وباطنا بما نظروا فيه مما قاله لهم فلما أخذ قلوبهم بالكلية إليه ولم يبق لله فيهم نصيب يعصمهم أغضبوا الله فغضب فانتقم فكان حكمهم في نفس الأمر خلاف حكم فرعون في نفسه فإنه علم صدق موسى عليه السلام وعلم حكم الله في ظاهره بما صدر منه وحكم الله في باطنه بما كان يعتقده من صدق موسى فيما دعاهم إليه وكان ظهور إيمانه المقرر في باطنه عند الله مخصوصا بزمان مؤقت لا يكون إلا فيه وبحالة خاصة فظهر بالإيمان لما جاء زمانه وحاله فغرق قومه آية ونجا فرعون ببدنه دون قومه عند ظهور إيمانه آية فمن رحمة الله بعباده أن قال فَالْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ يعني دون قومك لِتَكُونَ لِمَنْ خَلْفَكَ آيَةً أي علامة لمن آمن بالله أن ينجيه الله ببدنه أي بظاهره فإن باطنه لم يزل محفوظا بالنجاة من الشرك لأن العلم أقوى الموانع فسوى الله في الغرق بينهم وتفرقا في الحكم فجعلهم سلفا ومثلا للآخرين يعني الأمم الذين يأتون من بعدهم وخص فرعون بأن تكون نجاته آية لمن رجع إلى الله بالنجاة ولما كان الاختصاص الإلهي الكامل في الجمع بين السعادة والصورة كان الكمال للمؤمن بالخلافة في المكان الذي من شأنه أن يظهر فيه كمال الصورة من نفوذ الاقتدار عند الإغضاب وليست الجنة بمحل لهذه الصفة فليست بدار خلافة بل هي دار ولاية محكوم على صاحب تلك الولاية بأمر لا يتعداه ولا تعطي نشأته أن يقبل سواه حتى لو كان فيها تقديرا من شأنه أن يغضب ما قبل صاحب الولاية صفة الغضب لأنه على مزاج خاص بخلاف نشأة الدنيا ولهذا قال إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً ولم يقل في العالم ولو لم تعترض الملائكة ما ابتليت بالسجود فكان ما ابتلوا به عن إغضاب دقيق خفي لا يشعر به إلا الراسخون في العلم وهكذا كل انتقام إلهي يقع بالعالم لا يكون إلا بعد إغضاب لأن الله خلق العالم بالرحمة وليس من شأنها الانتقام كما إن الغضب من شأنه الانتقام لكنه أعني الغضب على طبقات فيظهر الانتقام على ميزانه من غير زيادة ولا نقصان ولا يقع الانتقام أبدا إلا تطهيرا لمن كان منه الإغضاب فلذلك لا يكون الانتقام إلى غير نهاية بل ينتهي الحكم به إلى أجل مسمى عند الله وتعقبه الرحمة به لأن لها الحكم الأبدي الذي لا يتناهى ومن جعل باله لما ذكرناه ودقق النظر فيه رأى علما كبيرا إلهيا من سريان العدل في الحكم الإلهي وشمول الفضل وسبق الرحمة الغضب وإن الحق يجري في حكمه بما هي الحقائق عليه إذ الحقائق لا تتبدل لأنفسها ولا تتحول فهذا الذي ذكرناه في هذه المسألة من الآيات التي جاء بها الحق على لسان المترجم لِقَوْمٍ يَتَفَكَّرُونَ ولِقَوْمٍ يَعْقِلُونَ ليست لغير هذا الصنف فحافظ على تحصيل معرفة الإغضاب على غاية الاستقصاء حتى تجتنبه فإنه من علم الأسرار ما يعرفه كل أحد وهو كان علم حذيفة بن اليمان صاحب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم ولهذا كان أصحاب رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يسمونه صاحب السر لعلمه بهذا العلم وليس فيما يمنح الله أولياءه من العلم به في حقهم أنفع من هذا العلم وما رأيت أحدا له فيه ذوق ولا سمعت عن أحد من أهل الله تعالى بعد حذيفة من ظهر عليه حكم هذا العلم وهو عصمة خفية تكاد لا يشعر صاحبها بها وما في الكشف أتم منه ولا يرزق الله هذا العلم إلا للادباء أهل المراقبة فإنهم يأخذون الأشياء بحكم المطابقة والمناسبة بين الرب والمربوب والخالق والمخلوق ولا يحكم عليهم حاكم الإمكان والجواز لأنه ليس له في هذه الحضرة قدم ولا عين أعني الإمكان وهذا مقام وراء طور العقل لأن العقل يحكم في مثل هذا بالإمكان والأمر في نفسه ليس كذلك ولكن إذا شهده قبله وإذا فكر فيه أدخله تحت الإمكان ويختص هذا المنزل من العلوم بعلم الإيهام والإبهام والرموز والألغاز والأسرار وفيه علم الحروف المركبة التي هي الكلمة وفيه علم الأنوار وما يختص به عالم الشهادة من الشهود وفيه علم الجعل وفيه علم الجمع والتفصيل وفيه علم منازل العلو في الأسماء الإلهية وأحكامها وفيه علم الإعجاز وفيه علم التقرير وفيه علم نتائج الجهل وهو أمر عدمي فكيف يكون له حكم وجودي وفيه علم مقابلة الاقتدار بالاقتدار وفيه علم سريان وجود الحق في العالم ولهذا ما أنكره أحد وإنما وقع الغلط من طلب الماهية فادى إلى الاختلاف فيه الذي ظهر في العالم وفيه علم ما يختص به الحق تعالى لنفسه من غير أن يكون له حكم في العالم وفيه علم الشرائع كلها وأنها بالجعل ولهذا تجري إلى أمد وغايتها حكم الحق بها في القيامة في الفريقين فإذا عمرت الداران وانقضى أمد العقوبة انتشر حكم الرحمة وفيه علم الشفع والوتر وتقدم علم الزوج على الفرد وعلم الحامل والمحمول وعلم شمول النعم في البلايا والرزايا والأمور المؤلمة وفيه علم نفي الطاقة\nالكونية وردها إلى الله وفيه علم قسمة العالم بين الله وبين العالم وما هو عالم لله وعالم للعالم وصفة من يعلم هذا ممن لا يعلمه والعالم به هل يجب عليه ستره أو يعطي ستره لذاته وعلم المحاكمات وتفاضل الناس فيها وعلم المطالبات الإلهية متى تكون ولما ذا تئول وعلم السبب الذي يرد الخلق كلهم إلى المشيئة الإلهية وهل هو رجوع عن علم أو رجوع عن قهر وعلم الفرق بين علم التقليد وعلم النظر وهل ما يربط عليه المقلد يكون في حقه علما أم لا وعلم حكم السابقة على العالم بنقيض ما يعطيه علمهم وعلم العواقب على الإطلاق وهل يعم أثرها في الحال للعالم بها أم لا وعلم الفترات وما حكم أصحابها وعلم الأشراف وما هو وهل في العالم شريف وأشرف أم لا مفاضلة في العالم وإذا وقعت المفاضلة بل هي واقعة هل يؤول الناظر فيها إلى التساوي فيكون كل مفضول يفضل على من فضل عليه وهذا مذهب جماعة منهم أبو القاسم بن قسي صاحب خلع النعلين وفيه علم الحكمة بما جعل الله في العالم من الاختلاف وفيه علم السبب الذي لأجله لزم الشيطان الإنسان وقول النبي صَلَّى اللهُ عَليهِ وسَلَّم إن الله أعانه عليه فأسلم‏\n\n\nوفيه علم حكم من التبس عليه الباطل بالحق وفيه علم الكشف فإنه ليس لمخلوق اقتدار على شي‏ء وأن الكل بيد الله وهو علم الحيرة من أجل التكليف ووقوعه على من ليس له من الأمر شي‏ء وفيه علم أثر الأسباب الإلهية في المسببات هل هو ذاتي أو جعل إلهي وفيه علم الاغتباط بما يعطيه التجلي الإلهي والاعتصام به وفيه علم التوحيد النبوي وفيه علم الحجب التي تمنع من حكم العلم في العالم مع وجود علمه عنده وفيه علم قبول الرجعة إلى الله عند رؤية البأس وحلول العذاب وأن ذلك نافع لهم في الآخرة وإن لم يكشف عنهم العذاب في الدنيا وما اختص قوم يونس إلا بالكشف عنهم في الحياة الدنيا عند رجعتهم فيكون معنى قوله فَلَمْ يَكُ يَنْفَعُهُمْ إِيمانُهُمْ لَمَّا رَأَوْا بَأْسَنا يعني في الدنيا فإن الله يقول وأَخَذْناهُمْ بِالْعَذابِ لَعَلَّهُمْ يَرْجِعُونَ فالراجع مع نزول العذاب به مقبول رجوعه لأنه أتى بما ترجى منه بقوله لَعَلَّهُمْ يَرْجِعُونَ وفيه علم أسرار الحق في العالم وظهور العالم بصورة الحق ومنزلته وفيه علم عموم الولاية في كل نوع وما ينقضي منها وما لا ينقضي وفيه علم الإضافات الإلهية هل هي على طريق التشريف أو على طريق الابتلاء أو منها ما يكون تشريفا ومنها ما يكون ابتلاء وفيه علم مرتبة من جمع بين الظاهر والباطن ممن لم يجمع وفيه علم حكمة الاستناد إلى الوسائط هل هو على طريق الابتلاء أو المقصود به تشريف الوسائط وفيه علم إقامة الحجة الإلهية على المنازعين وحكم من لم ينازع واعترف بالحق لأهله وفيه علم الإحاطة الإلهية بالذات وفيه علم الزيادات هل هي بأن يؤخذ من زيد ما عنده أو بعض ما عنده فيعطي عمرا أو هي زيادات بإيجاد معدوم أو هل منها ما هو إيجاد معدوم ومنها ما هو عن انتقال من شخص إلى شخص وفيه علم ما يختص به الله من العلوم وعلم ما يختص به الكون من العلوم مما لا يجوز في العقل أن يكون ذلك حكما لله وهل حكمه في الشرع كما هو حكمه في العقل أم لا وهو علم الأذواق بالحواس وفيه علم مراتب الشفعاء وعلم صفتهم التي بها يملكون الشفاعة فهذا بعض علوم هذا المنزل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر الثاني والعشرون‏\n\n\n( (بسم الله الرحمن الرحيم))\n\n",
    "en": "The Three Hundred and Forty-First Chapter: Concerning the Knowledge of the Station of Following Authority (التقليد) in the Esoteric Secrets (الأسرار)\n\nIn every ruling among the rulings there is following authority (تقليد),\nAnd in it is sovereignty (سلطنة) within us and confirmation (تأييد).\nWere it not for it, I would have no footing in our Knowledge (علمنا) by it,\nNor would there be Revelation (تنزيل) or affirmation of Unity (توحيد).\nIndeed, the Caliphate (الخلافة) is following authority and sovereignty,\nIt is the Imam who is witnessed by The Real (الحق).\nIt is the Trust (الأمانة); its possessor never ceases\nTo be in obedience, and he is praised by Allah.\nAll those in Allah's Existence (وجود الله) observe him\nIn their secret core (سره), for he is the intended goal (مقصود) in the cosmos (الأكوان).\nMy Lord adorned him with what His Presence (حضرته) grants\nOf the Attributes (الصفات), so nothing exists in Knowledge (العلم)\nOther than him; thus, he is the Imam of all Creation (الخلق),\nAnd He is the God (الإله), both Unknown (مجهول) and Limited (محدود).\n\n[That Following Authority (التقليد) is the Origin (الأصل) to which all theoretical, necessary, or unveiled (كشفي) knowledge returns]\n\nKnow—may Allah support us and you with His Holy Spirit—that following authority (التقليد) is the origin (الأصل) to which all theoretical, necessary, or unveiled (كشفي) knowledge returns. However, people are of different levels (مراتب) concerning it. Among them are those who follow their Lord, and these are the exalted group, the possessors of sound Knowledge (العلم الصحيح). Among them are those who follow their intellect (عقله), and these are the possessors of necessary knowledge (العلوم الضرورية), such that if a skeptic were to cast doubt upon it through a possible matter, they would not accept it, even though they know it is possible, and they will not accept it. If you question them about this, they say it is because it does not invalidate necessary knowledge. Its examples are numerous, but I will not mention them for the sake of weak souls who might accept them, leading to harm and delusion. This prevents me from clarifying them. Among them are those who follow their intellect in what their thought grants them. There are none but these, for following authority (التقليد) has encompassed all scholars. Following authority is restriction (تقييد). Since the world (العالم) has not departed from its reality (حقيقته)—for it is the restricted existent (الموجود المقيد)—its knowledge must necessarily be restricted like it. Restriction (التقييد) in this context is the very essence of following authority (التقليد), except that it is censured in certain known instances and praised in certain known instances.\n\nThere is no station (منزل) more difficult to ascend than this station. It is more difficult than the station of the Obstacles of the Sawiq, because the possessor of that station is sometimes [up] and sometimes [down], while the possessor of this station is firm of foot within it. Since following authority (التقليد) is the necessary ruler, and there is no escape from it, then following the Lord is more appropriate concerning the Knowledge (العلم) He has legislated about Himself, so do not deviate from it. For He informed you about Himself in the Knowledge of Him, even in that wherein you followed your intellect (عقلك) by virtue of its following its thought which looks at its proof, and He gave you the opposite of the Knowledge of Him. The origin (الأصل) of the world (العالم) is ignorance (الجهل), and Knowledge (العلم) is acquired. Knowledge is Existence (وجود), and Existence belongs to Allah. Ignorance is non-existence (عدم), and non-existence belongs to the world. Thus, following The Real (الحق), to Whom Existence belongs, is more appropriate than following one who is a creature (مخلوق) like yourself. Just as you benefited from His Existence, may He be glorified, so benefit from His Knowledge. Therefore, stop at what He reports about Himself, and do not worry about contradictions in the reports, for every report has a level (مرتبة) in which that report descends, and you are the Comprehensive Divine Presence (الحضرة الجامعة) of those levels. Be upon clear evidence (بينة) from your Lord, not what you say from your intellect, for He only refers you back to Himself, because He created you for Himself, and He will not turn you away from Him.\n\nWhen He manifests (تجلى) to you in the necessity of your intellect, you will inevitably find your reliance upon something you do not know, by virtue of your following this intellectual necessity. And when He manifests to you in the consideration of your intellect, you will find within yourself that this upon which you rely for your existence is an existent matter (أمر وجودي) that does not resemble you, since your essence (عينك) and everything that subsists in you and is a description of you is originated (محدث) and requires an originator like you. Your intellect, by virtue of its consideration, will tell you that nothing in the world (العالم) resembles this Existent (الموجود), and you are the entirety of the world, because every part of the world shares with the whole in indicating what we have established. And when He manifests to you in the Law (الشرع), He clarifies for you the differences in the levels (مراتب) of the world, and He manifests to you in every level. So, follow the Lawgiver (الشارع) in that until He unveils (يكشف) for you, and you see the matter in the form that you are. Thus, you followed your Lord, and you saw Him as both likened (مشبها) and transcendent (منزها). So you combined and separated, transcended and likened. All of that is you, because it is a Divine Theophany (تجل إلهي) in the levels, and you are the collector of them. They belong to you and to the entire world, and they rule over everyone who appears within them, so that person is colored in the eye of the observer by them. That is why I said to you, \"All of that is you,\" for the worlds (*al-alamin*) derive from the sign (*al-alama*), and the sign only indicates what is limited (محدود), so it only indicates you. <<إِنَّ اللهَ غَنِيٌّ عَنِ الْعَالَمِينَ>> (Indeed, Allah is free from need of the worlds). Thus, the world does not indicate Knowledge (العلم) by its Essence (ذاته), but rather indicates Knowledge by its Existence (وجوده).\n\n[That The Real (الحق) is, in reality, the Mother of the Book (أم الكتاب)]\n\nKnow that The Real (الحق) is, in reality, the Mother of the Book (أم الكتاب). The Qur’an is a book among the totality of books, except that it possesses comprehensiveness (الجمعية) unlike the rest of the books. Despite this, it is an Attribute (صفة) of The Real, and the Attribute requires that in which it subsists, and the relation requires that to which it is related. Therefore, we said concerning it that it is the Mother of the Book from which the revealed books emerged, and the languages differed concerning it due to its acceptance of them by its reality (حقيقته). Thus, it is said to be Arabic, Hebrew, and Syriac, according to the tongue in which it was revealed. This is the very essence of the making (*al-ja’l*) in the Qur’an and the very essence of the attribution of origination (*al-huduth*) to it in His saying: <<مَا يَأْتِيهِمْ مِنْ ذِكْرٍ مِنْ رَبِّهِمْ مُحْدَثٍ>> (No remembrance comes to them from their Lord that is newly originated). So, it is newly originated in its coming, and the coming is the very essence of the sending down (*al-inzal*), just as it is not the very essence of the making (*al-ja’l*). Making (*al-ja’l*) can mean creation (الخلق) or something else. Therefore, what is attributed to the Qur’an in His saying \"newly originated\" is from the ruling of the making (*al-ja’l*) which means creation. Thus, there is no difference in ruling between His saying: <<ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَكِينٍ>> (Then We made him a drop of semen in a firm resting place) and His saying: <<إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا>> (Indeed, We have made it an Arabic Qur’an).\n\n[That the realization of the 'withness' (*‘indiyya*) of everything returns to its own self]\n\nKnow that the realization of the 'withness' (*‘indiyya*) of everything returns to its own self. For this reason, He said: <<مَا عِنْدَكُمْ يَنْفَدُ>> (What is with you vanishes), for your ruling is vanishing, and <<وَمَا عِنْدَ اللَّهِ بَاقٍ>> (and what is with Allah remains), for permanence (البقاء) belongs to Him. If the 'withness' of a thing were other than the thing itself, what is with us would not vanish, because we and what is with us are with Allah, and what is with Allah remains. Thus, we and what is with us would remain. It is therefore clear to you that the 'withness' of everything is the thing itself. In language, 'withness' (*al-‘indiyya*) is an adverb of place or an adverb of location, like the body for the accidental color perceived by sight. It is clearer in the indication you seek. Thus, it is in the location of its place, and the possessor of the place is not in the location of the place. 'Withness' combines both matters.\n\nSince it is impossible in necessary following authority (التقليد الضروري) for anyone to deny that upon which he relies for his existence, even those whose nature is denial and rejection have affirmed it. If you say, \"But the deniers (*al-Mu’attila*) denied it,\" we reply: The deniers did not deny reliance; rather, they denied and stripped of attributes that which *you* specified as the object of reliance. They did not strip the object of reliance itself. You said, \"It is such-and-such,\" so the deniers stripped it and said, \"No, the object of reliance is such-and-such.\" Just as those are deniers, you are also deniers of their denial. However, those were specifically named *al-Mu’attila*. They are of various types in their denial. The place of knowledge concerning this and its like is the knowledge of sects (*al-nihal*) and religions (*al-milal*), which is a knowledge that the believer should not read or look into at all. Just as it is incumbent upon the People of Allah (*Ahl Allah*) to know the knowledge of every sect and religion *through* Allah, so that they may witness Him in every form, and thus they do not stand in a position of denial. This is because He, the Exalted, permeates Existence (الوجود), and only the restricted (محدود) denies Him. The People of Allah follow Him to Whom they belong, and His ruling applies to them. His ruling, the Exalted, is the absence of restriction (عدم التقييد). Thus, He has the universality of Existence (عموم الوجود), and His people have the universality of Witnessing (عموم الشهود). Whoever restricts his existence restricts his witnessing, and he is not one of the People of Allah.\n\n[That Allah described Himself with Establishment (*al-Istiwā’*) and with Descent to the Heaven]\n\nKnow that when Allah prepared this creation (الخليقة), He made it an earth for Himself, and thus described Himself with Establishment (*al-Istiwā’*), with Descent (*al-Nuzūl*) to the heaven, and with disposal in every direction the cosmos turns: <<فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ>> (So wherever you turn, there is the Face of Allah). <<فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ>> (So turn your face toward the Sacred Mosque). This does not negate the ruling that the Face of Allah is wherever you turn, but Allah chose for you that which brings you happiness in turning toward Him, yet only in a specific state, which is the Prayer (*al-Salat*). In all other locations, Allah did not impose this restriction upon you. Thus, He combined restriction (التقييد) and absolute freedom (الإطلاق) for you, just as He combined transcendence (التنزيه) and likeness (التشبيه) for Himself when He said: <<لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ>> (There is nothing like unto Him, and He is the All-Hearing, the All-Seeing).\n\nThe entire world (العالم) is a prepared earth: <<لَا تَرَى فِيهَا عِوَجًا وَلَا أَمْتًا>> (You will not see in it any crookedness or unevenness). <<هَلْ تَرَى مِنْ تَفَاوُتٍ فَارْجِعِ الْبَصَرَ>> (Do you see any disparity? Then return the gaze). [It is] an Arabic Qur’an, free of crookedness. The Real (الحق) is an Attribute (صفة) of the world, because its attribute is Existence (الوجود), and Existence belongs only to Allah. For this reason, it is mentioned in the sound *Hadith*: \"I was his hearing and his sight.\" And likewise, all his powers and attributes.\n\nSince the world was a spatial vessel for the One Who established Himself upon it, He appeared in its form. Al-Junayd was asked about Gnosis (المعرفة) and the Gnostic (*al-arif*), and he replied, \"The color of the water is the color of its vessel.\" Thus, he attributed the effect to the container upon the contained, so that you may know whom you have known, and realize that you only judged your known object by means of yourself, and thus you have known nothing other than yourself. Whatever the color of the vessel, the water appeared to the sight according to the color of the vessel. So, the one who lacks Knowledge (علم) judges that it is such-and-such because sight gave him that impression. The water has Theophany (التجلي) in every form of the vessels according to their colors. The water itself is not restricted in its Essence (ذاته), but this is how you see it. Likewise, the shapes of the containers in which it appears affect it, yet it remains water in all of them. If the container is square, it appears in the form of a square; if pentagonal, it appears in the form of a pentagon; or if circular, it appears in the form of a circle. This is because it possesses fluidity, and it flows into the corners of the vessels to manifest their shape. It is this flow that leads observers to judge it according to the ruling of the vessels in color and shape. Whoever has never seen it except in a vessel judges it according to the ruling of the vessel. But whoever sees it as simple and uncompounded knows that the shapes and colors that appear in it are merely the effect of the vessels. It is in the vessels just as it is outside a vessel, according to its definition and reality (حقيقته). For this reason, the name 'water' never leaves it, as it indicates it by the ruling of correspondence (*al-mutabaqa*). These vessels are for Him like the paths on the earth for the traveler (*al-salik*) upon them. The traveler on each path is attributed with seeking the goal of that path upon which he traveled. <<فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ>> (In whatever form He willed, He assembled you) from His forms. Thus, He is the Manifest (الظاهر), not you, because manifestation belongs to the forms, not to the Essence (العين). The Essence is always Unseen (غيب), and the forms are always Witnessing (شهادة).\n\n[Indeed, Allah clarified that in the earth of the World (العالم) there are two highways (*Najdayn*)]\n\nThen, when He created everything in pairs, He clarified for us that in the earth of the World (العالم) there are two highways (*Najdayn*): one highway whose goal is you, according to some people, and another highway whose goal, according to these people, is Him—meaning The Real (الحق). As for other people, one highway has its goal as you *in* Him, and the other highway has its goal as Him *in* you. As for yet other people, one highway has its goal as you, the very Essence (عين) of Him, and the other highway has its goal as Him, the very Essence of you. As for still other people, the goal of both highways is Him, the Essence of both highways is you, and the Essence of the traveler (*al-salik*) is Him. As for yet other people, the goal of both highways and the Essence of both highways are [Him], and they are the Essence of the Two Hands, and the Essence of the traveler is you. Every one we have mentioned is upon a straight path (*sirat mustaqim*). The curvature of the bow for shooting is the very essence of its straight path. <<وَلَا يَزَالُونَ مُخْتَلِفِينَ إِلَّا مَنْ رَحِمَ رَبُّكَ>> (And they will continue to differ, except those upon whom your Lord has mercy). We have not ceased to be among the differing ones, because they have differed from the differing ones, and for that He created them. No creation transgresses what it was created for, so all are obedient, even if among them are those who are not obedient while still being obedient.\n\n[That Establishment (*al-Istiwā’*) is an Attribute (صفة) of The Real (الحق) upon the Throne (*al-Arsh*)]\n\nSince Establishment (*al-Istiwā’*) is an Attribute (صفة) of The Real (الحق) upon the Throne (*al-Arsh*), and since man was created upon His form, He made for him a vehicle which He called the sphere (*falak*), just as the Throne was a sphere. Thus, the sphere is the place of establishment for the Perfect Human (الإنسان الكامل). And for those who are less than the Perfect Human, He made a vehicle other than the sphere, consisting of livestock, <<وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ>> (and horses, mules, and donkeys), so that man may establish himself upon the backs of these conveyances. The Perfect Human shares with them in riding these. The perfect among mankind establishes himself upon every ridden thing, while the imperfect does not establish himself upon the sphere except by the ruling of subordination (التبعية), not by his own essence, as is mentioned concerning certainty (*al-yaqin*) when the Prophet, peace be upon him, said regarding Jesus, peace be upon him: \"Had he increased in certainty, he would have walked in the air.\" This refers to his Night Journey (*Isrā’*). It is known that Jesus, peace be upon him, had more certainty than us, but not more than the Prophet, may Allah bless him and grant him peace. We walk in the air by the ruling of subordination to the one whose community we are, may Allah bless him and grant him peace, not because we have more certainty than Jesus, peace be upon him. Likewise, the community of Jesus, peace be upon him, walked on water just as he walked on water. But we know, even if the matter in our case is by the ruling of subordination, that the entire community did not walk in the air as Muhammad, may Allah bless him and grant him peace, walked, because not every member of his community followed him in everything he commanded to be followed. Whoever fulfills the right of following him receives his ruling, as He said: <<أَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَا وَمَنِ اتَّبَعَنِي>> (I invite to Allah upon clear insight—I and those who follow me).\n\nAnd where is walking in the air in honor compared to the one whose hearing and sight The Real (الحق) becomes, through persistence in supererogatory good deeds that produce, or whose persistence in them produces, Allah’s love for him? And that love produced for him that The Real becomes his hearing and sight. This is the meaning of our saying \"by the ruling of subordination\" to what he commanded and forbade, not merely because we are his community, but from the totality, which is a specific following, because he is a specific, designated Prophet unlike any other. Following his Law (*Shari’a*) through action inherits the spiritual states (*ahwal*) that the Messenger of that Law possesses. This is a special providence (*‘inaya*) from Allah, the Exalted, for the community of every prophet cannot endure the spiritual state (*hal*) of their prophet. If they could endure it, they would be his equal and would act independently of him, which is not the case. For even if he ascends wherever he ascends, he remains a follower. The Prophet, may Allah bless him and grant him peace, clarified something similar when he said: \"Whoever establishes a good practice (*sunna hasana*) receives its reward and the reward of whoever acts upon it.\" Thus, he has an increase over them due to his reward for it, which is greater than the reward of those who act upon it. They do not have that specific reward belonging to him, so they will never catch up to him in that station. They are followers of him in this world, the Hereafter, and in Unveiling (كشفا). The Messengers, peace be upon them, are those from whom the practices (*sunan*) appeared, and their communities will forever remain their followers.\n\n[That Allah, the Exalted, is Absolute Existence (مطلق الوجود) and has no restriction preventing restriction]\n\nKnow that since Allah, the Exalted, possesses Absolute Existence (مطلق الوجود) and has no restriction that prevents restriction—rather, all restrictions belong to Him—He is the absolute of restriction. No restriction rules over Him to the exclusion of another restriction. Understand the meaning of attributing absolute freedom (الإطلاق) to Him. Whoever’s Existence is of this nature possesses the absolute freedom of relations (إطلاق النسب). Thus, no relation is more appropriate for Him than another. No one disbelieved except by specializing relations. An example is the saying of the Jews and Christians about themselves, excluding others among the people of religions and sects: <<نَحْنُ أَبْنَاءُ اللَّهِ وَأَحِبَّاؤُهُ>> (We are the children of Allah and His beloved ones). Since they attributed themselves to Him, they generalized the relation, even if it was an error in reality. Allah said to them: <<فَلِمَ يُعَذِّبُكُمْ بِذُنُوبِكُمْ بَلْ أَنْتُمْ بَشَرٌ مِمَّنْ خَلَقَ>> (Then why does He punish you for your sins? Rather, you are human beings from among those He created). He, the Exalted, says: The relation is one, so why did you specialize yourselves with it to the exclusion of these others? Even if you erred in reality, your error in generalizing the relation is less than your error in specializing it, for that is arbitrary judgment against Allah without proof.\n\nAs for another group, they assigned to Allah what they disliked for themselves, saying that the angels are the daughters of Allah. Thus, they judged Him as having <<اصْطَفَى الْبَنَاتِ عَلَى الْبَنِينَ>> (chosen daughters over sons). The ruling of denial was directed against their judgment, even though they disliked that for themselves. This is despite their saying concerning the partners: <<مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى>> (We only worship them that they may bring us nearer to Allah in proximity), even though they assigned a part of His servants to Allah. Had they attributed the whole to Him, that would not have been manifest disbelief. Rather, the ruling concerning it would be according to the nature of what they attributed. If the general relation for creation (الخلق) occurred by their being servants, they would be happy. If it occurred by prophethood, they would be held accountable for what they intended. If they relied on a Divine report (*khabar ilahi*) for that, they would be safe, indeed happy, such as His saying: <<لَوْ أَرَادَ اللَّهُ أَنْ يَتَّخِذَ وَلَدًا لَاصْطَفَى>> (Had Allah intended to take a son, He would have chosen). Thus, He permitted adoption. Moreover, there is a hint of this in Gabriel appearing to Mary as <<بَشَرًا سَوِيًّا>> (a man in all respects). The Real, the Exalted, has described Himself with transformation into forms and applied their rulings to Himself. This is a knowledge hinted at for the sake of faith, and it is not divulged to the general public due to what might occur to souls from it.\n\nThe question remains concerning the object of choice (*istifā’*): Does it relate to the consort (*al-sahiba*)? In that case, it would be from the category of Theophany (التجلي) in forms, being the very essence of the two forms, because He said: <<لَوْ أَرَدْنَا أَنْ نَتَّخِذَ لَهْوًا>> (Had We intended to take a diversion)—meaning a son—<<لَاتَّخَذْنَاهُ مِنْ لَدُنَّا>> (We would have taken it from Our presence). And [the son] only appears through the consort, who is the mother. Thus, the choice is in the case of the consort, and she is from His presence, so He did not depart from Himself. Just as Adam, peace be upon him, did not depart from himself in his consort, for he only married one who was a part of him. By him and by the totality, she is himself. This is His saying, \"from Our presence.\" The particle *law* (if) was used, indicating impossibility, so it did not occur in either aspect. If the choice was for sonship, then that is adoption, not true sonship. If they relied on something other than a Divine report—and by Divine report I mean what came upon the tongue of the Messengers in the Books or in Revelation (*al-wahy*)—If their reliance was upon a Divine Unveiling (كشف إلهي) and insight into that matter, then they are under the ruling of what they perceived. The followers (*al-muqallida*) have no excuse in this, because they possess the capacity for insight by the ruling of their constitution (*nash’a*). For the constitution has a general preparedness, which is the preparedness for insight, even if the insight varies in degree, which is due to another specific preparedness, distinct from the general preparedness. Thus, the adherents of determinism (*Ahl al-Jabr*), if they hold fast to the report, are happy. Even if they err in interpretation (*ta’wil*) and do not attain Knowledge (العلم), they have the reward of striving (*ijtihad*). If they are correct, that is the intended goal. Among them are those who are <<عَلَى بَيِّنَةٍ مِنْ رَبِّهِ>> (upon clear evidence from his Lord) by being correct, and among them are those who are not upon clear evidence from their Lord, yet are correct in reality. Everyone who has a Divine reliance is saved. As for those who disbelieve in the whole, that is the utmost blindness.\n\n(Section) Concerning Cosmic Incitement (*al-Tahdidh al-Kawni*)\n\nThis is a secret (سر) that Allah placed in His common servants and in the travelers (*al-salikin*) on this path. As for the elite (*al-khassa*), this never occurs from them, because it is not a Divine description, except that it came from Allah concerning what relates to the cosmos, not what relates to Him, may He be glorified. An example is His saying: <<لَوْلَا جَاءُوا عَلَيْهِ بِأَرْبَعَةِ شُهَدَاءَ>> (Why did they not produce four witnesses for it?). The particle *lawlā* (why not) is Divine and implies the meaning of incitement (*al-tahdidh*). The elite of Allah have been characterized by it. The Messenger of Allah, may Allah bless him and grant him peace, said: \"Had I faced forward what I faced backward, I would not have driven the sacrificial animal, and I would have made it an *Umra* (minor pilgrimage). But I have driven the sacrificial animal, so nothing forbidden to me will become lawful until <<يَبْلُغَ الْهَدْيُ مَحِلَّهُ>> (the offering reaches its place of sacrifice).\" The scent of incitement (*al-tahdidh*) in *law* (had) is what is understood from it, as if he said to himself, \"Why did I not enter into the state of *ihram* for an *Umra*?\" Incitement never occurs from the elite except concerning actions with which they occupy themselves that please Allah. Then, in a second moment, Allah’s pleasure appears to them in performing an action that is more complete and higher than the first, either in the presence of Allah, or concerning their own right, or concerning the right of others, out of kindness and compassion for them. It does not occur from them as a form of objection to Allah, such that they would say, \"Why did Allah not do such-and-such instead of doing such-and-such?\" This is never conceivable from the elite, for it is bad manners (*su’ adab*) with Allah, the Exalted, and preferring a cosmic arrangement over a Divine arrangement. The Real (الحق) only described Himself as <<يُدَبِّرُ الْأَمْرَ>> (He arranges the matter) so that we may know that He did nothing except what the wisdom of Existence (حكمة الوجود) required, and that He placed it in its proper location, such that if He had not placed it there, He would not have fulfilled the right of wisdom. He is <<الَّذِي أَعْطَى كُلَّ شَيْءٍ خَلْقَهُ>> (the One Who gave everything its creation). Therefore, it is impossible for Him to appear to His servants in the attribute of incitement when viewed in relation to Him. Rather, He placed it in the language—indeed, in all languages—as a trial and purification for His servants, so that the People of Providence (*Ahl al-‘Inaya*) may avoid it, thereby distinguishing themselves from others.\n\n[That Felicity (*al-Sa’āda*) is other than the perfection of form]\n\nKnow that the Divine specialization (*al-ikhtisas al-ilahi*) that grants felicity (السعادة) is different from the Divine specialization that grants the perfection of form (كمال الصورة). These two specializations may sometimes combine in certain individuals. The specialization that grants felicity is the specialization in faith, and immunity (*‘isma*) from transgression, or death immediately following repentance. The specialization that grants the perfection of form is that which grants nothing but the penetration of power (*nufudh al-iqtidar*) and control over the world through spiritual resolve (*himma*) and sensory perception. The perfect one is he who is granted both specializations.\n\nThe strongest influence is the influence of one who angers Allah, such as the people of Pharaoh, concerning whom He, the Exalted, said: <<فَلَمَّا آسَفُونَا انْتَقَمْنَا مِنْهُمْ>> (So when they angered Us, We took vengeance upon them)—meaning, they made Us angry. Allah, may He be glorified, possesses the penetration of power, so He took vengeance upon them to make them a lesson for others. He made this a counterpart to the penetration of cosmic power, because He said, \"they angered Us.\" Do you not see Pharaoh’s knowledge in his saying: <<فَلَوْلَا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ مِنْ ذَهَبٍ>> (Why have not bracelets of gold been put upon him)? He means, why has he—meaning Moses—not been given the penetration of power over us, so that we would not dispute him, and we would listen to him and obey him? This is because the two hands are the locus of power, and bracelets (*aswira*), which are encircling shapes made of gold, are the most perfect adornment among minerals. The penetration of power is from the Divine specialization. He is saying to his people that Moses was not given that. What indicates what we have said is that Pharaoh intended this meaning in this statement, because he followed it with *aw* (or), which is a conjunction of appropriateness, saying: <<أَوْ جَاءَ مَعَهُ الْمَلَائِكَةُ مُقْتَرِنِينَ>> (Or should the angels have come with him in association). This is because he knew that his people knew that if the angels came, they would submit to Moses willingly or unwillingly. Pharaoh is saying: Moses, peace be upon him, did not have the penetration of power over me such that I would submit to his word by myself, through a necessary matter that we cannot repel, causing you to submit to his word because of my submission. Nor did anyone come with him whose power is decisive.\n\n<<فَاسْتَخَفَّ قَوْمَهُ>> (So he made his people lightheaded)—meaning, he made their understanding subtle by considering what he said to them. When he placed this in them, he led them to scrutinize the matter, a state they did not possess before. So, they obeyed him outwardly through manifest coercion, because he was in a position of fear and hope, and inwardly through what they considered of what he said to them. When he completely took their hearts to himself, and no portion remained in them for Allah to protect them, they angered Allah, so He became angry and took vengeance. Thus, their ruling in reality was contrary to Pharaoh’s ruling concerning himself, for he knew the truthfulness of Moses, peace be upon him. He knew Allah’s ruling concerning his outward actions based on what proceeded from him, and Allah’s ruling concerning his inward state based on his belief in the truthfulness of Moses in what he called them to. The manifestation of his faith, which was established inwardly with Allah, was restricted to a specific, appointed time, which could only occur then, and to a specific state. So, he manifested faith when its time and state arrived. The drowning of his people was a sign, and the salvation of Pharaoh by his body, without his people, upon the manifestation of his faith, was a sign. It was out of Allah’s mercy to His servants that He said: <<فَالْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ>> (So this day We will save you in your body)—meaning, without your people—<<لِتَكُونَ لِمَنْ خَلْفَكَ آيَةً>> (that you may be a sign for those who succeed you). That is, a sign for whoever believes in Allah that Allah will save him by his body, meaning by his outward form, for his inward state had always been preserved by salvation from polytheism, because Knowledge (العلم) is the strongest preventative. Thus, Allah made them equal in drowning, but they differed in ruling. He made them predecessors and an example for others—meaning the nations who come after them—and He specialized Pharaoh so that his salvation would be a sign for whoever returns to Allah with salvation.\n\nSince the complete Divine specialization lies in combining felicity (السعادة) and form (الصورة), perfection belongs to the believer through the Caliphate (الخلافة) in the place whose nature it is for the perfection of form—namely, the penetration of power upon angering—to appear. Paradise (*al-Janna*) is not a locus for this attribute, so it is not the Abode of Caliphate (دار خلافة). Rather, it is the Abode of Sainthood (*Wilaya*), and the possessor of that sainthood is ruled by a command he does not transgress. His constitution (*nash’a*) does not allow him to accept anything else, such that even if there were, hypothetically, something whose nature was to cause anger, the possessor of sainthood would not accept the attribute of anger, because he is upon a specific temperament, unlike the constitution of the world. For this reason, He said: <<إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً>> (Indeed, I am placing upon the earth a vicegerent/Caliph), and He did not say \"in the world.\" Had the angels not objected, they would not have been tested by prostration. Thus, what they were tested with resulted from a subtle, hidden angering that only those firmly rooted in Knowledge (الراسخون في العلم) perceive.\n\nLikewise, every Divine vengeance that occurs in the world only happens after an angering, because Allah created the world through Mercy (الرحمة), and vengeance is not its nature. Just as anger is of the nature of vengeance, but anger—I mean—is of degrees, so vengeance appears according to its measure, without increase or decrease. Vengeance never occurs except as a purification for the one from whom the angering proceeded. Therefore, vengeance is not without end. Rather, its ruling terminates at a term appointed with Allah, and Mercy follows it, because Mercy possesses the eternal ruling that has no end. Whoever pays attention to what we have mentioned and scrutinizes it will see a great Divine Knowledge (علما كبيرا إلهيا) concerning the permeation of Justice in the Divine ruling, the comprehensiveness of Grace, and the precedence of Mercy over Anger, and that The Real (الحق) proceeds in His ruling according to what the realities (الحقائق) are, since the realities do not change or transform themselves. What we have mentioned in this matter is among the signs that The Real brought forth upon the tongue of the translator for <<لِقَوْمٍ يَتَفَكَّرُونَ>> (a people who reflect) and <<وَلِقَوْمٍ يَعْقِلُونَ>> (a people who understand). It is not for any other category.\n\nTherefore, strive to acquire the knowledge of angering to the utmost extent so that you may avoid it, for it is among the science of secrets (علم الأسرار) that not everyone knows. This was the knowledge of Hudhayfa ibn al-Yaman, the Companion of the Messenger of Allah, may Allah bless him and grant him peace. For this reason, the Companions of the Messenger of Allah, may Allah bless him and grant him peace, called him the Possessor of the Secret (*Sahib al-Sirr*) due to his knowledge of this science. There is no knowledge that Allah grants His saints (*awliyā’*) concerning Him that is more beneficial for them than this knowledge. I have not seen anyone who has a taste (*dhawq*) of it, nor have I heard of anyone among the People of Allah, the Exalted, after Hudhayfa, upon whom the ruling of this knowledge appeared. It is a hidden immunity (*‘isma*) that its possessor hardly perceives. There is nothing more complete in Unveiling (الكشف) than it. Allah grants this knowledge only to the well-mannered, the People of Vigilance (*Ahl al-Murāqaba*), for they take things according to the ruling of correspondence (*al-mutabaqa*) and appropriateness between the Lord and the lorded, the Creator and the created. The ruler of possibility (*al-imkan*) and permissibility does not rule over them, because possibility has no footing or essence in this Divine Presence (الحضرة). This is a station beyond the sphere of the intellect, because the intellect judges such matters by possibility, whereas the matter in itself is not so. However, if the intellect witnesses it, it accepts it; but if it reflects upon it, it places it under possibility.\n\nThis station is specialized in the sciences of suggestion (*al-iham*), ambiguity (*al-ibham*), symbols (*al-rumuz*), riddles (*al-alghaz*), and secrets (*al-asrar*). In it is the science of compounded letters which constitute the Word (*al-kalima*). In it is the science of lights (*al-anwar*) and what the world of Witnessing (*‘ālam al-shahāda*) is specialized in concerning witnessing (الشهود). In it is the science of making (*al-ja’l*). In it is the science of synthesis (*al-jam’*) and differentiation (*al-tafsil*). In it is the science of the stations of exaltation in the Divine Names (الأسماء الإلهية) and their rulings. In it is the science of inimitability (*al-i’jaz*). In it is the science of confirmation (*al-taqrir*). In it is the science of the results of ignorance (الجهل), which is a non-existent matter, so how can it have an existent ruling? In it is the science of the confrontation of power with power. In it is the science of the permeation of the Existence of The Real (وجود الحق) in the world, which is why no one has denied it. Rather, the error occurred from seeking the quiddity (*māhiyya*), which led to the disagreement concerning it that appeared in the world. In it is the science of what Allah, the Exalted, specializes for Himself without having a ruling in the world. In it is the science of all the Laws (*Sharā’i’*), and that they are by making (*al-ja’l*). For this reason, they run until a term, and their ultimate goal is the ruling of The Real concerning them on the Day of Resurrection for both parties. When the two abodes are inhabited and the term of punishment expires, the ruling of Mercy (الرحمة) spreads. In it is the science of the even (*al-shaf’*) and the odd (*al-witr*), and the precedence of the knowledge of the pair over the single. The science of the carrier and the carried. The science of the comprehensiveness of blessings in trials, calamities, and painful matters. In it is the science of negating cosmic capacity (*al-tāqa al-kawniyya*) and returning it to Allah. In it is the science of the division of the world between Allah and the world, and what belongs to the world of Allah and what belongs to the world of the world. The description of the one who knows this from the one who does not know it. And whether the one who knows it must conceal it, or whether its concealment is granted by its Essence (ذاته). The science of judgments and the differences among people concerning them. The science of Divine demands: when they occur and to what they lead. The science of the reason that returns all creation (الخلق) to the Divine Will (المشيئة الإلهية), and whether that return is based on knowledge or based on coercion. The science of the difference between the knowledge of following authority (علم التقليد) and the knowledge of consideration (علم النظر). And whether what the follower relies upon constitutes knowledge in his right or not. The science of the ruling of precedence (*al-sābiqa*) over the world, contrary to what their knowledge grants them. The science of consequences in absolute terms, and whether their effect extends immediately to the one who knows them or not. The science of intervals (*al-fatarāt*) and the ruling concerning their possessors. The science of nobility (*al-ashraf*) and what it is. And whether there is noble (*sharif*) and nobler (*ashraf*) in the world, or no differentiation in the world. And if differentiation occurs—indeed, it does occur—does the observer of it ultimately conclude equality, such that every inferior person is superior to the one who was superior to him? This is the doctrine of a group, including Abu al-Qasim ibn Qasi, the author of *Khala’ al-Na’layn*. In it is the science of wisdom concerning the difference that Allah placed in the world. In it is the science of the reason for which Satan clung to man, and the saying of the Prophet, may Allah bless him and grant him peace, that Allah helped him against him, so he submitted. In it is the science of the ruling concerning one for whom falsehood is confused with The Real (الحق). In it is the science of Unveiling (الكشف), which is that no creature has power over anything, and that everything is in the Hand of Allah. It is the science of bewilderment (*al-hīra*) due to the imposition of religious duties (*al-taklif*) and its occurrence upon one who has no control over the matter. In it is the science of the effect of Divine causes upon the caused things: is it essential (*dhāti*) or a Divine making (*ja’l*). In it is the science of rejoicing in what the Divine Theophany (التجلي الإلهي) grants and holding fast to it. In it is the science of Prophetic Unity (*Tawhid*). In it is the science of the veils (*al-hujub*) that prevent the ruling of Knowledge (العلم) in the world, despite the existence of that knowledge with the person. In it is the science of the acceptance of returning to Allah upon seeing distress and the descent of punishment, and that this is beneficial for them in the Hereafter, even if the punishment is not lifted from them in this world. The people of Jonah were only specialized by having the punishment lifted from them in the life of this world upon their return. Thus, the meaning of His saying: <<فَلَمْ يَكُ يَنْفَعُهُمْ إِيمَانُهُمْ لَمَّا رَأَوْا بَأْسَنَا>> (But their faith was not to benefit them when they saw Our punishment) means in this world. For Allah says: <<وَأَخَذْنَاهُمْ بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُونَ>> (And We seized them with punishment that perhaps they might return). The return of the one who returns while the punishment descends upon him is accepted, because he brought forth what was hoped for from him by His saying, \"that perhaps they might return.\" In it is the science of the secrets of The Real (الحق) in the world, and the manifestation of the world in the form of The Real and its station. In it is the science of the universality of sainthood (*al-wilaya*) in every species, and what of it expires and what does not expire. In it is the science of Divine attributions: are they by way of honor (*tashrif*) or by way of trial (*ibtila’*), or is some of it honor and some of it trial? In it is the science of the level of one who combines the outward (*al-zahir*) and the inward (*al-batin*) compared to one who does not combine them. In it is the science of the wisdom of relying upon intermediaries (*al-wasā’it*): is it by way of trial, or is the intention to honor the intermediaries? In it is the science of establishing the Divine proof against the disputers, and the ruling concerning one who does not dispute and acknowledges The Real (الحق) for its people. In it is the science of Divine encompassing of the Essence (الذات). In it is the science of increases (*al-ziyādāt*): are they by taking what Zayd has, or part of what he has, and giving it to Amr? Or are they increases by creating something non-existent? Or is some of it the creation of the non-existent, and some of it a transfer from one person to another? In it is the science of the types of knowledge specialized by Allah, and the knowledge specialized by the cosmos, which the intellect deems impossible to be a ruling for Allah. And whether His ruling in the Law (*al-Shar’*) is the same as His ruling in the intellect or not. It is the science of tastes (*al-adhwāq*) through the senses. In it is the science of the levels of intercessors (*al-shufa’ā’*) and the science of the attribute by which they possess intercession. This is some of the knowledge of this station. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks The Truth, and He guides to the Way). The Twenty-Second Volume is concluded.",
    "ur": "## باب تین سو اکتالیس: اسرار (الأسرار) میں منزلِ تقلید (التقليد) کی معرفت کے بیان میں\n\n| عربی متن | اردو ترجمہ |\n| :--- | :--- |\n| فی كل حكم من الأحكام تقليد | ہر حکم میں تقلید (التقليد) ہے، |\n| وفيه سلطنة فينا وتأييد | اور اس میں ہم میں سلطنت اور تائید ہے۔ |\n| لولاه ما كان لي في علمنا قدم | اگر یہ نہ ہوتی تو ہمارے علم میں میرا کوئی قدم نہ ہوتا، |\n| به ولا كان تنزيل وتوحيد | نہ اس کے ذریعے تنزیل ہوتی اور نہ توحید۔ |\n| إن الخلافة تقليد وسلطنة | بے شک خلافت تقلید (التقليد) اور سلطنت ہے، |\n| فهي الإمام الذي للحق مشهود | پس وہ امام ہے جو ذات حق (الحق) کے لیے مشہود (الشہود) ہے۔ |\n| هي الأمانة ما ينفك صاحبها | یہ امانت ہے، اس کا حامل اطاعت میں کبھی جدا نہیں ہوتا، |\n| في طاعة وهو عند الله محمود | اور وہ اللہ کے نزدیک محمود ہے۔ |\n| جميع من في وجود الله يرقبه | اللہ کی ہستی (الوجود) میں موجود ہر شے اپنے باطن میں اس کی نگہبانی کرتی ہے، |\n| في سره فهو في الأكوان مقصود | پس وہ تمام کائنات میں مقصود ہے۔ |\n| حلاه ربي بما تعطيه حضرته | میرے رب نے اسے ان صفات سے آراستہ کیا جو اس کی حضوری عطا کرتی ہے، |\n| من الصفات فما في العلم موجود | پس علم میں کوئی موجود نہیں ہے۔ |\n| سواه فهو إمام الخلق كلهم | اس کے سوا، پس وہ تمام مخلوق کا امام ہے، |\n| وهو الإله فمجهول ومحدود | اور وہ الٰہ ہے، پس وہ مجہول بھی ہے اور محدود بھی۔ |\n\n### [کہ تقلید (التقليد) ہی وہ اصل ہے جس کی طرف ہر نظری، ضروری یا کشفی علم رجوع کرتا ہے]\n\nجان لو، اللہ تعالیٰ اپنی روح قدسی کے ذریعے ہماری اور تمہاری تائید فرمائے، کہ تقلید (التقليد) ہی وہ اصل ہے جس کی طرف ہر نظری (النظري)، یا ضروری (الضروري)، یا کشفی (الکشف) علم رجوع کرتا ہے۔ لیکن وہ اس میں مختلف مراتب پر ہیں۔ پس ان میں سے کچھ وہ ہیں جنہوں نے اپنے رب کی تقلید کی، اور وہ بلند گروہ ہیں جو صحیح علم کے حامل ہیں۔ اور ان میں سے کچھ وہ ہیں جنہوں نے اپنی عقل کی تقلید کی، اور وہ علوم ضروریہ (العلوم الضرورية) کے حامل ہیں۔ اس طرح کہ اگر کوئی شک کرنے والا انہیں کسی امکانی امر کے ذریعے شک میں ڈالے تو وہ اسے قبول نہیں کرتے، باوجود اس کے کہ وہ جانتے ہیں کہ یہ ممکن ہے۔ اور وہ اسے قبول نہیں کرتے۔ جب تم ان سے اس بارے میں پوچھتے ہو تو وہ کہتے ہیں کہ یہ ضروری علم میں قدح نہیں کرتا۔ اس کی مثالیں بہت ہیں، میں انہیں کمزور نفوس کی وجہ سے ذکر نہیں کرتا تاکہ وہ اسے قبول نہ کر لیں، جس سے نقصان اور وہم (ہوس) پیدا ہو سکتا ہے۔ یہی چیز مجھے ان کے بیان کرنے سے روکتی ہے۔ اور ان میں سے کچھ وہ ہیں جنہوں نے اپنی عقل کی تقلید کی اس چیز میں جو ان کے فکر نے انہیں عطا کی، اور بس یہی لوگ ہیں۔ پس تقلید (التقليد) تمام علماء پر عام ہو چکی ہے۔ اور تقلید (التقليد) ایک قید (تقیید) ہے۔ چونکہ عالم (مخلوق) اپنی حقیقت سے باہر نہیں نکلا، پس وہ مقید موجود ہے، لہٰذا ضروری ہے کہ اس کا علم بھی اسی کی طرح مقید ہو۔ اور تقیید (التقييد) بعینہٖ تقلید (التقليد) ہے۔ مگر یہ کہ بعض مقامات پر اس کی مذمت کی گئی ہے جو معلوم ہیں، اور بعض مقامات پر اس کی تعریف کی گئی ہے جو معلوم ہیں۔ اور منازل میں اس منزل سے زیادہ مشکل چڑھائی والی کوئی منزل نہیں ہے۔ یہ منزل عقبات السویق کی منزل سے بھی زیادہ مشکل ہے، کیونکہ اس منزل کا حامل کبھی ایک حال میں ہوتا ہے اور کبھی دوسرے حال میں، جبکہ اس منزل کا حامل اس میں ثابت قدم ہوتا ہے۔ پس جب تقلید (التقليد) ہی حاکم ہے اور اس سے کوئی چارہ نہیں، تو رب کی تقلید (التقليد) اس علم میں جو اس نے اپنے بارے میں مشروع کیا ہے، زیادہ اولیٰ ہے۔ پس اس سے انحراف نہ کرو۔ کیونکہ اس نے تمہیں اپنے بارے میں اس علم میں خبر دی ہے جس میں تم نے اپنی عقل کی تقلید کی، اس لحاظ سے کہ عقل نے اپنے ناظر فکر کی دلیل میں تقلید کی۔ اور اس نے تمہیں اس علم کا نقیض بھی عطا کیا۔ اور عالم (مخلوق) میں اصل جہل ہے، اور علم مستفاد ہے۔ پس علم وجود (الوجود) ہے، اور وجود (الوجود) اللہ کے لیے ہے، اور جہل عدم ہے، اور عدم عالم (مخلوق) کے لیے ہے۔ پس ذات حق (الحق) کی تقلید (التقليد) جس کے لیے وجود (الوجود) ہے، اس کی تقلید سے زیادہ اولیٰ ہے جو تمہاری طرح مخلوق ہے۔ پس جس طرح تم نے اس سبحانہ و تعالیٰ سے وجود (الوجود) حاصل کیا، اسی طرح اس سے علم حاصل کرو۔ پس اس کی خبر پر ٹھہر جاؤ جو اس نے اپنے بارے میں دی ہے، اور خبروں میں تضاد کی پرواہ نہ کرو، کیونکہ ہر خبر کے لیے ایک مرتبہ ہے جس میں وہ خبر نازل ہوتی ہے، اور تم ان مراتب کو جمع کرنے والی حضوری ہو۔ پس اپنے رب کی طرف سے دلیل پر رہو، اپنی عقل کی طرف سے نہ کہو۔ کیونکہ وہ تمہیں صرف اپنی طرف ہی لوٹاتا ہے، اس لیے کہ اس نے تمہیں اپنے لیے پیدا کیا ہے، پس وہ تمہیں اس سے دور نہیں کرے گا۔ پس جب وہ تمہاری عقل کی ضرورت میں تمہارے لیے تجلی (التجلی) فرماتا ہے، تو تم اپنی اس عقلی ضرورت کی تقلید (التقليد) کے لحاظ سے لازمی طور پر ایک ایسے امر کی طرف استناد پاتے ہو جسے تم نہیں جانتے۔ اور جب وہ تمہاری عقل کے نظریے میں تمہارے لیے تجلی (التجلی) فرماتا ہے، تو تم اپنے اندر پاتے ہو کہ یہ جس پر تم نے اپنے وجود (الوجود) میں بھروسہ کیا ہے، وہ ایک وجودی امر ہے جو تمہاری مشابہت نہیں رکھتا، کیونکہ تمہاری ذات اور ہر وہ چیز جو تمہارے ساتھ قائم ہے اور تمہاری صفت ہے، وہ حادث ہے اور تمہاری طرح ایک موجد کی محتاج ہے۔ پس تمہاری عقل اپنے نظریے کے لحاظ سے تمہیں کہتی ہے کہ اس موجود (الموجود) کی مانند عالم (العالم) میں کوئی شے نہیں ہے، اور تم تمام عالم ہو۔ اور جب وہ شریعت میں تمہارے لیے تجلی (التجلی) فرماتا ہے، تو وہ تمہیں عالم (العالم) کے مراتب میں تفاوت کے بارے میں واضح کرتا ہے، پس وہ ہر مرتبے میں تمہارے لیے تجلی (التجلی) فرماتا ہے۔ پس اس میں شارع کی تقلید (التقليد) کرو یہاں تک کہ تمہارے لیے کشف (الکشف) ہو جائے، اور تم اس امر کو اس صورت پر دیکھو جس پر تم ہو۔ پس تم نے اپنے رب کی تقلید (التقليد) کی، تو تم نے اسے مشبہ (تشبیہ دینے والا) اور منزہ (تنزیہ کرنے والا) پایا۔ پس تم نے جمع کیا اور فرق کیا، اور تنزیہ کی اور تشبیہ دی، اور یہ سب کچھ تم ہی ہو، کیونکہ یہ مراتب میں ظہور الٰہی (التجلی الإلهي) ہے، اور تم ان سب کو جمع کرنے والے ہو۔ اور یہ تمہارے لیے اور تمام عالم (العالم) کے لیے ہیں، اور یہ ہر اس شخص پر حاکم ہیں جو ان میں ظاہر ہوتا ہے، پس وہ ناظر کی آنکھ میں ان کے ذریعے رنگین ہو جاتا ہے۔ اور اسی لیے میں نے تم سے کہا کہ یہ سب کچھ تم ہی ہو۔ کیونکہ عالمین (العالمين) علامت سے ہیں، اور علامت صرف محدود پر دلالت کرتی ہے، پس وہ صرف تم پر دلالت کرتی ہے۔ **فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ** (بے شک اللہ تمام جہانوں سے بے نیاز ہے)۔ پس عالم (العالم) اپنی ذات سے علم پر دلالت نہیں کرتا، بلکہ اپنے وجود (الوجود) سے علم پر دلالت کرتا ہے۔\n\n### [کہ ذات حق (الحق) حقیقت میں ام الکتاب ہے]\n\nجان لو کہ ذات حق (الحق) حقیقت میں ام الکتاب (کتاب کی اصل) ہے، اور قرآن تمام کتابوں میں سے ایک کتاب ہے، مگر اس میں دیگر کتابوں کے برعکس جامعیت ہے۔ اس کے باوجود، یہ ذات حق (الحق) کی صفت ہے، اور صفت اپنے موصوف کو طلب کرتی ہے، اور نسبت اس کو طلب کرتی ہے جس کی طرف وہ منسوب ہو۔ اسی لیے ہم نے اس کے بارے میں کہا کہ یہ ام الکتاب ہے جس سے نازل شدہ کتابیں نکلی ہیں، اور اس کی حقیقت کے قبول کرنے کی وجہ سے زبانیں اس میں مختلف ہو گئیں، پس کہا گیا کہ یہ عربی ہے، اور یہ عبرانی ہے، اور یہ سریانی ہے، اس زبان کے مطابق جس میں یہ نازل ہوا۔ اور یہ قرآن میں عین جعل (پیدا کرنا) ہے، اور اس کی طرف حدوث کی نسبت ہے، جیسا کہ اس کے قول میں ہے: **ما یَأْتِیهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ** (ان کے رب کی طرف سے ان کے پاس کوئی نئی نصیحت نہیں آتی)۔ پس یہ آنے کے لحاظ سے محدث (نیا) ہے، اور آنا بعینہٖ نازل ہونا نہیں ہے، جیسا کہ یہ بعینہٖ جعل (پیدا کرنا) نہیں ہے۔ اور جعل (پیدا کرنا) خلق (پیدائش) کے معنی میں بھی ہوتا ہے اور اس کے علاوہ بھی۔ پس جو کچھ قرآن کی طرف محدث (نیا) ہونے کی نسبت کی جاتی ہے، وہ اس جعل کے حکم سے ہے جو خلق کے معنی میں ہے۔ پس اس کے قول **ثُمَّ جَعَلْناهُ نُطْفَةً فی قَرارٍ مَكِینٍ** (پھر ہم نے اسے ایک محفوظ ٹھکانے میں نطفہ بنا دیا) اور اس کے قول **إِنَّا جَعَلْناهُ قُرْآناً عَرَبِیًّا** (بے شک ہم نے اسے عربی قرآن بنایا) کے حکم میں کوئی فرق نہیں ہے۔\n\n### [کہ ہر شے کی عندیت (ساتھ ہونا) کی تحقیق خود اس کی طرف لوٹتی ہے]\n\nجان لو کہ ہر شے کی عندیت (عندية - ساتھ ہونا) کی تحقیق خود اس کی طرف لوٹتی ہے۔ اور اسی لیے اس نے فرمایا: **ما عِنْدَكُمْ یَنْفَدُ** (جو تمہارے پاس ہے وہ ختم ہو جائے گا)، کیونکہ تمہارا حکم فنا ہونا ہے، اور **ما عِنْدَ الله باقٍ** (اور جو اللہ کے پاس ہے وہ باقی رہنے والا ہے)، کیونکہ بقا (البقاء) اس کے لیے ہے۔ پس اگر شے کی عندیت (ساتھ ہونا) خود شے نہ ہوتی، تو جو کچھ ہمارے پاس ہے وہ ختم نہ ہوتا، کیونکہ ہم اور جو کچھ ہمارے پاس ہے وہ اللہ کے پاس ہے، اور **ما عِنْدَ الله باقٍ** (جو اللہ کے پاس ہے وہ باقی رہنے والا ہے)، پس ہم اور جو کچھ ہمارے پاس ہے وہ باقی ہے۔ پس تمہارے لیے واضح ہو گیا کہ ہر شے کی عندیت (عندية) خود وہ شے ہے۔ اور زبان میں عندیت (عندية) ظرفِ مکان ہے یا ظرفِ محلی، جیسے جسم رنگ کے عرض کے لیے ہے جسے بصارت ادراک کرتی ہے۔ پس یہ اس دلالت میں زیادہ واضح ہے جس کا تم ارادہ کرتے ہو، پس وہ اپنے محل کے لحاظ سے ہے۔ اور مکان کا مالک مکان کے لحاظ سے نہیں ہوتا۔ اور عندیت (عندية) دونوں امور کو جمع کرنے والی ہے۔ اور چونکہ ضروری تقلید (التقليد الضروري) میں یہ ممکن نہیں کہ کوئی شخص اس ذات کا انکار کرے جس پر اس نے اپنے وجود (الوجود) میں بھروسہ کیا ہے، اس لیے جس کا کام انکار اور جحود (نافرمانی) ہے، اس نے بھی اس کا اقرار کیا۔ اگر تم کہو کہ معطلہ (انکار کرنے والے) نے انکار کیا، تو ہم کہیں گے کہ معطلہ نے مستند (بھروسے کی جگہ) کا انکار نہیں کیا، بلکہ انہوں نے اس چیز کا انکار کیا اور اسے معطل کیا جسے تم نے مستند قرار دیا تھا۔ انہوں نے مستند کو معطل نہیں کیا، بلکہ تم نے کہا کہ وہ ایسا ہے، تو معطلہ نے اسے معطل کیا اور کہا کہ مستند تو ایسا ہے۔ پس جس طرح وہ معطلہ ہیں، تم بھی ان کے تعطیل (انکار) کے لحاظ سے معطلہ ہو۔ لیکن وہ لوگ معطلہ کے نام سے مخصوص ہو گئے، اور وہ تعطیل میں مختلف اقسام پر ہیں۔ اس کا اور اس جیسی چیزوں کا علم فرقوں اور مذاہب کے علم میں ہے، اور یہ ایسا علم ہے جسے مومن کو بالکل نہیں پڑھنا چاہیے اور نہ اس میں دیکھنا چاہیے۔ جیسا کہ اہل اللہ پر لازم ہے کہ وہ ہر فرقے اور مذہب کے علم کو اللہ کے ذریعے جانیں تاکہ وہ اسے ہر صورت میں مشہود (الشہود) کریں، پس وہ انکار کی جگہ پر کھڑے نہیں ہوتے، کیونکہ وہ (اللہ تعالیٰ) وجود (الوجود) میں جاری و ساری ہے۔ پس اس کا انکار صرف محدود نے کیا ہے۔ اور اہل اللہ اس کے تابع ہیں جس کے وہ اہل ہیں، پس ان پر اس کا حکم جاری ہوتا ہے، اور اس کا حکم عدمِ تقیید (قید نہ ہونا) ہے۔ پس اس کے لیے وجود (الوجود) کا عموم ہے، لہٰذا اس کے اہل کے لیے شہود (الشہود) کا عموم ہے۔ پس جس نے اپنے وجود (الوجود) کو مقید کیا، اس نے اپنے شہود (الشہود) کو مقید کیا، اور وہ اہل اللہ میں سے نہیں ہے۔\n\n### [کہ اللہ نے اپنی ذات کو استواء (الاستواء) اور آسمان کی طرف نزول (النزول) سے موصوف کیا]\n\nجان لو کہ جب اللہ نے اس مخلوق (الخليقة) کو ہموار کیا، تو اسے اپنے لیے زمین بنایا۔ پس اس نے اپنی ذات کو استواء (الاستواء) اور آسمان کی طرف نزول (النزول) سے، اور ہر جہت میں تصرف سے موصوف کیا، **فَأَیْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله** (پس تم جس طرف بھی رخ کرو گے، وہیں اللہ کا چہرہ ہے)۔ پس **فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرامِ** (پس اپنا چہرہ مسجد حرام کی طرف پھیر لو)۔ کیونکہ یہ اس حکم کو ختم نہیں کرتا کہ تم جہاں بھی رخ کرو گے، وہیں اللہ کا چہرہ ہے۔ لیکن اللہ نے تمہارے لیے وہ چیز منتخب کی جس میں اس کی طرف متوجہ ہونے میں تمہاری سعادت ہے، لیکن ایک خاص حالت میں، اور وہ نماز ہے۔ اور دیگر تمام جہتوں میں اللہ نے تمہارے لیے یہ تقیید (قید) نہیں رکھی۔ پس اس نے تمہارے لیے تقیید (قید) اور اطلاق (آزادی) کو جمع کیا، جیسا کہ اس نے اپنی ذات کے لیے تنزیہ اور تشبیہ کو جمع کیا، پس فرمایا: **لَیْسَ کَمِثْلِهِ شَیْ‏ءٌ وهُوَ السَّمِیعُ الْبَصِیرُ** (اس کی مثال کوئی چیز نہیں، اور وہ سننے والا، دیکھنے والا ہے)۔ پس سارا عالم (العالم) ایک ہموار زمین ہے، **لا تَرى‏ فِیها عِوَجاً ولا أَمْتاً** (تم اس میں کوئی کجی یا بلندی نہیں دیکھو گے)۔ **هَلْ تَرى مِنْ تَفاوُتٍ فَارْجِعِ الْبَصَرَ** (کیا تم کوئی فرق دیکھتے ہو؟ پس نگاہ دوڑاؤ)۔ (قرآن عربی غیر ذی عوج)۔ اور ذات حق (الحق) عالم (العالم) کی صفت ہے، کیونکہ اس کی صفت وجود (الوجود) ہے، اور وجود صرف اللہ کے لیے ہے۔ اور اسی لیے صحیح حدیث میں آیا ہے: \"میں اس کا کان اور اس کی آنکھ بن جاتا ہوں\"۔ اور اسی طرح اس کی تمام قوتیں اور صفات ہیں۔ پس جب عالم (العالم) اس ذات کے لیے ایک مکانی ظرف بنا جس نے اس پر استواء (الاستواء) فرمایا، تو وہ اس کی صورت میں ظاہر ہوا۔ جنید سے معرفت (المعرفۃ) اور عارف کے بارے میں پوچھا گیا تو انہوں نے فرمایا: \"پانی کا رنگ اس کے برتن کا رنگ ہوتا ہے۔\" پس انہوں نے اثر کو مظروف میں ظرف کے لیے قرار دیا۔ اور یہ اس لیے ہے تاکہ تم جانو کہ تم نے کس کی معرفت حاصل کی، پس تم جانو کہ تم نے اپنے معروف پر اپنے سوا کسی اور کے ذریعے حکم نہیں لگایا، پس تم نے اپنے سوا کسی کو نہیں پہچانا۔ پس برتن کا جو بھی رنگ تھا، پانی بصارت کے لیے برتن کے رنگ کے مطابق ظاہر ہوا۔ پس جس کے پاس علم نہیں، اس نے حکم لگایا کہ یہ ایسا ہی ہے، کیونکہ بصارت نے اسے یہی عطا کیا۔ پس اس کے لیے تمام برتنوں کی صورتوں میں ان کے رنگوں کے لحاظ سے تجلی (التجلی) ہے۔ پانی اپنی ذات میں مقید نہیں ہوا، لیکن تم اسے اسی طرح دیکھتے ہو۔ اور اسی طرح وہ برتنوں کی شکلوں سے بھی متاثر ہوتا ہے جن میں وہ ظاہر ہوتا ہے، حالانکہ وہ ان سب میں پانی ہی ہے۔ اگر برتن چوکور ہو تو وہ چوکور کی صورت میں ظاہر ہوتا ہے، یا پانچ کونوں والا ہو تو پانچ کونوں کی صورت میں ظاہر ہوتا ہے، یا گول ہو تو گولائی کی صورت میں ظاہر ہوتا ہے، کیونکہ اس میں بہاؤ ہے، پس وہ برتنوں کے کونوں میں سرایت کرتا ہے تاکہ ان کی شکل کو ظاہر کرے۔ پس یہی وہ چیز ہے جس نے ناظرین کو اس کی سرایت کی وجہ سے اس پر رنگ اور شکل میں برتنوں کے حکم کے مطابق حکم لگانے پر مجبور کیا۔ پس جس نے اسے کبھی کسی برتن میں نہیں دیکھا، اس نے اس پر برتن کا حکم لگایا۔ اور جس نے اسے بسیط اور غیر مرکب دیکھا، اس نے جان لیا کہ جو شکلیں اور رنگ اس میں ظاہر ہوئے ہیں، وہ صرف برتنوں کے اثر سے ہیں۔ پس وہ برتنوں میں بھی اپنی حد اور حقیقت کے لحاظ سے ویسا ہی ہے جیسا کہ بغیر برتن کے ہے۔ اور اسی لیے اس سے پانی کا نام زائل نہیں ہوا، کیونکہ یہ مطابقت کے حکم سے اس پر دلالت کرتا ہے۔ پس یہ برتن اس کے لیے زمین میں سالک کے لیے راستوں کی طرح ہیں، پس ہر راستے میں چلنے والے کی نسبت اس طرف کی جاتی ہے کہ وہ اس راستے کی غایت کا طالب ہے جس پر وہ چلا۔ **فِی أَیِّ صُورَةٍ ما شاءَ رَكَّبَكَ** (جس صورت میں چاہا تجھے جوڑ دیا)۔ پس وہ (حق) ظاہر ہوتا ہے، نہ کہ تم، کیونکہ ظہور صورتوں کے لیے ہے نہ کہ عین (ذات) کے لیے۔ پس عین (ذات) ہمیشہ غیب ہے اور صورتیں ہمیشہ شہادت (الشہود) ہیں۔\n\n### [کہ اللہ نے واضح کیا کہ عالم (العالم) کی زمین میں دو نجد (راستے) ہیں]\n\nپھر جب اس نے ہر شے کے جوڑے پیدا کیے، تو اس نے ہمیں واضح کیا کہ عالم (العالم) کی زمین میں دو نجد (راستے) ہیں۔ ایک نجد جس کی غایت بعض لوگوں کے نزدیک تم ہو، اور ایک نجد جس کی غایت ان لوگوں کے نزدیک وہ (حق) ہے۔ اور دوسرے لوگوں کے نزدیک، ایک نجد کی غایت تم ہو اس (حق) میں، اور دوسرے نجد کی غایت وہ (حق) ہے تم میں۔ اور دوسرے لوگوں کے نزدیک، ایک نجد کی غایت تم ہو جو عین وہ (حق) ہے، اور دوسرے نجد کی غایت وہ (حق) ہے جو عین تم ہو۔ اور دوسرے لوگوں کے نزدیک، دونوں نجدوں کی غایت وہ (حق) ہے، اور دونوں نجدوں کی عین تم ہو، اور سالک کی عین وہ (حق) ہے۔ اور دوسرے لوگوں کے نزدیک، دونوں نجدوں کی غایت اور دونوں نجدوں کی عین، اور وہ دونوں عینِ یدین (دو ہاتھ) ہیں، اور سالک کی عین تم ہو۔ اور جن کا ہم نے ذکر کیا، وہ سب صراط مستقیم پر ہیں۔ پس تیر اندازی کے لیے کمان کا ٹیڑھا ہونا بعینہٖ اس کا صراط مستقیم ہے۔ پس **لا یَزالُونَ مُخْتَلِفِینَ إِلَّا من رَحِمَ رَبُّكَ** (وہ ہمیشہ اختلاف کرتے رہیں گے، سوائے ان کے جن پر تمہارے رب نے رحم کیا)۔ پس ہم اختلاف سے نہیں ہٹے، کیونکہ انہوں نے اختلاف کرنے والوں کی مخالفت کی، اور اسی لیے اس نے انہیں پیدا کیا۔ پس ہر مخلوق اس چیز سے تجاوز نہیں کرتی جس کے لیے اسے پیدا کیا گیا ہے، پس سب اطاعت گزار ہیں، اگرچہ ان میں سے کچھ ایسے بھی ہیں جو اطاعت گزار نہ ہونے کے باوجود اطاعت گزار ہیں۔\n\n### [کہ استواء (الاستواء) عرش پر ذات حق (الحق) کی صفت ہے]\n\nاور جب استواء (الاستواء) عرش پر ذات حق (الحق) کی صفت تھی، اور انسان کو اس کی صورت پر پیدا کیا، تو اس نے اس کے لیے ایک سواری بنائی جسے فلک (آسمانی دائرہ) کہا، جیسا کہ عرش بھی ایک فلک تھا۔ پس فلک انسان کامل (الإنسان الکامل) کی سواری ہے۔ اور جو انسان کامل (الإنسان الکامل) سے کم تر ہے، اس کے لیے فلک کے علاوہ چوپایوں، **الْخَیْلَ والْبِغالَ والْحَمِیرَ** (گھوڑوں، خچروں اور گدھوں) میں سے ایک سواری بنائی، تاکہ انسان ان سواریوں کی پشت پر سوار ہو، اور انسان کامل (الإنسان الکامل) بھی ان کی سواری میں شریک ہوا۔ پس لوگوں میں سے کامل ہر سواری پر سوار ہوتا ہے، اور غیر کامل فلک پر سوار نہیں ہوتا مگر تبعیت کے حکم سے، نہ کہ اپنی ذات کے لیے۔ جیسا کہ یقین (الیقین) کے بارے میں آیا ہے جب عیسیٰ علیہ السلام کے بارے میں فرمایا: \"اگر ان کا یقین (الیقین) اور بڑھ جاتا تو وہ ہوا میں چلتے۔\" یہ ان کے معراج کی طرف اشارہ ہے۔ اور یہ معلوم ہے کہ عیسیٰ علیہ السلام ہم سے زیادہ یقین والے تھے، نہ کہ نبی صلی اللہ علیہ وسلم سے۔ اور ہم ہوا میں چلتے ہیں اس کی تبعیت کے حکم سے جس کی ہم امت ہیں صلی اللہ علیہ وسلم، نہ اس وجہ سے کہ ہم عیسیٰ علیہ السلام سے زیادہ یقین میں ہیں۔ جیسا کہ عیسیٰ علیہ السلام کی امت پانی پر چلی، جیسا کہ وہ علیہ السلام پانی پر چلے۔ لیکن ہم جانتے ہیں، اگرچہ یہ معاملہ ہمارے حق میں تبعیت کے حکم سے ہے، کہ پوری امت ہوا میں نہیں چلی جیسا کہ محمد صلی اللہ علیہ وسلم چلے، کیونکہ ان کی امت کا ہر فرد ان تمام امور میں ان کا تابع نہیں تھا جن میں اتباع کا حکم دیا گیا تھا۔ پس جس نے ان کی اتباع کا حق پورا کیا، اس کے لیے ان کا حکم ہو گا، جیسا کہ فرمایا: **أَدْعُوا إِلَى الله عَلى‏ بَصِیرَةٍ أَنَا ومن اتَّبَعَنِی** (میں اللہ کی طرف بصیرت کے ساتھ بلاتا ہوں، میں بھی اور وہ بھی جس نے میری پیروی کی)۔ اور ہوا میں چلنے کی شرافت اس شخص کے مقابلے میں کیا ہے جس کا حق (ذات حق) اس کا کان اور اس کی آنکھ بن جائے، ان نوافلِ خیرات پر ہمیشگی کی وجہ سے جو نتیجہ خیز ہیں، یا وہ ہمیشگی اللہ کی محبت کی وجہ سے اس کے لیے نتیجہ خیز ہوئی، اور اس محبت نے اس کے لیے یہ نتیجہ نکالا کہ حق (ذات حق) اس کا کان اور اس کی آنکھ بن جائے۔ پس یہ ہمارے اس قول کا معنی ہے کہ یہ تبعیت کے حکم سے ہے اس چیز میں جس کا حکم دیا گیا اور جس سے منع کیا گیا، نہ صرف اس وجہ سے کہ ہم ان کی امت ہیں۔ بلکہ مجموعی طور پر، اور یہ ایک خاص اتباع ہے، کیونکہ وہ ایک خاص معین نبی ہیں دوسروں کے برعکس، پس ان کی شریعت کی اتباع عمل کے ذریعے ان احوال کو وراثت میں دیتی ہے جو اس شریعت کے رسول پر تھے۔ اور یہ اللہ تعالیٰ کی عنایت ہے، کیونکہ ہر نبی کی امت اپنے نبی کے حال کی طاقت نہیں رکھتی، کیونکہ اگر وہ طاقت رکھتی تو وہ اس کی مثال بن جاتی اور اس کے بغیر خود مختار ہو جاتی، اور معاملہ ایسا نہیں ہے۔ پس اگر وہ جہاں بھی ظاہر ہو، وہ ہمیشہ تابع ہی رہتا ہے۔ اور آپ صلی اللہ علیہ وسلم نے اس جیسی چیز کو واضح کیا، پس فرمایا: \"جس نے کوئی اچھا طریقہ جاری کیا، تو اسے اس کا اجر ملے گا اور اس کا بھی جو اس پر عمل کرے گا۔\" پس اس کے لیے ان پر زیادتی ہے اس اجر کی وجہ سے جو اس کے لیے خاص ہے، اور وہ اجر عمل کرنے والوں کے اجر سے زیادہ ہے۔ اور ان کے لیے وہ خاص اجر نہیں ہے، پس وہ کبھی بھی اس مقام پر اس کے ساتھ نہیں مل سکتے۔ پس وہ دنیا و آخرت اور کشف (الکشف) میں اس کے تابع ہیں۔ اور رسولوں علیہم السلام میں سے ہی سنتیں ظاہر ہوئیں، پس ان کی امتیں ہمیشہ ان کی پیروکار رہیں گی۔\n\n### [کہ اللہ تعالیٰ مطلق الوجود (الوجود) کا مالک ہے اور اس کے لیے کوئی ایسی قید نہیں جو کسی قید سے مانع ہو]\n\nجان لو کہ اللہ تعالیٰ مطلق الوجود (الوجود) کا مالک ہے، اور اس کے لیے کوئی ایسی قید نہیں جو کسی قید سے مانع ہو، بلکہ اس کے لیے تمام قیدیں ہیں۔ پس وہ مطلق التقیید (قید سے مطلق) ہے، اس پر کوئی ایک قید دوسرے قید کے مقابلے میں حکم نہیں لگاتی۔ پس اس کی طرف اطلاق کی نسبت کا معنی سمجھو۔ اور جس کا وجود (الوجود) اس نسبت کے ساتھ ہو، اس کے لیے نسبتوں کا اطلاق ہے۔ پس کوئی نسبت اس کے ساتھ دوسری نسبت سے زیادہ اولیٰ نہیں ہے۔ پس جس نے کفر کیا، اس نے صرف نسبتوں کو خاص کرنے کی وجہ سے کفر کیا، جیسے یہودیوں اور عیسائیوں کا اپنے بارے میں کہنا، دوسرے مذاہب اور فرقوں کے لوگوں کے برعکس: **نَحْنُ أَبْناءُ الله وأَحِبَّاؤُهُ** (ہم اللہ کے بیٹے اور اس کے پیارے ہیں)۔ پس جب انہوں نے اپنی نسبت اس کی طرف کی، تو انہیں نسبت کو عام کرنا چاہیے تھا، اگرچہ وہ حقیقت میں غلط تھی۔ پس اللہ نے ان سے فرمایا: **فَلِمَ یُعَذِّبُكُمْ بِذُنُوبِكُمْ بَلْ أَنْتُمْ بَشَرٌ مِمَّنْ خَلَقَ** (تو پھر وہ تمہیں تمہارے گناہوں کی وجہ سے کیوں عذاب دیتا ہے؟ بلکہ تم بھی اس کی مخلوق میں سے ایک انسان ہو)۔ اللہ تعالیٰ فرماتا ہے کہ نسبت ایک ہی ہے، تو تم نے ان لوگوں کے مقابلے میں اپنی ذات کو اس کے ساتھ کیوں خاص کیا؟ اور اگر تم حقیقت میں غلطی پر ہو، تو تمہاری غلطی نسبت کو عام کرنے سے کم ہے بہ نسبت اسے خاص کرنے کے، کیونکہ یہ اللہ پر بغیر کسی دلیل کے حکم لگانا ہے۔ اور ایک دوسرا گروہ ہے جس نے اللہ کے لیے وہ چیزیں قرار دیں جنہیں وہ ناپسند کرتے ہیں، پس انہوں نے کہا کہ فرشتے اللہ کی بیٹیاں ہیں۔ پس انہوں نے اس پر یہ حکم لگایا کہ **أَصْطَفَى الْبَناتِ عَلَى الْبَنِینَ** (کیا اس نے بیٹوں کے مقابلے میں بیٹیوں کو چن لیا؟)۔ پس ان کے حکم پر انکار کا حکم عائد ہوا، باوجود اس کے کہ وہ یہ چیز اپنے لیے ناپسند کرتے تھے، اور اس کے باوجود کہ وہ شریکوں کے بارے میں کہتے تھے: **ما نَعْبُدُهُمْ إِلَّا لِیُقَرِّبُونا إِلَى الله زُلْفى‏** (ہم ان کی عبادت صرف اس لیے کرتے ہیں تاکہ وہ ہمیں اللہ کے قریب کر دیں)۔ اس کے باوجود کہ انہوں نے اللہ کے بندوں میں سے ایک حصہ اللہ کے لیے قرار دیا۔ پس اگر وہ سب کو اس کی طرف منسوب کرتے تو یہ ظاہر کفر میں سے نہ ہوتا، بلکہ اس میں حکم اس نسبت کے مطابق ہوتا جو انہوں نے کی۔ پس اگر مخلوق کے لیے عام نسبت ان کے بندے ہونے کی صورت میں واقع ہوتی تو وہ کامیاب ہوتے، اور اگر نبوت کے ساتھ واقع ہوتی تو ان سے ان کے مقصد کے بارے میں پوچھا جاتا۔ پس اگر وہ اس کا استناد کسی الٰہی خبر سے کرتے تو وہ محفوظ رہتے، بلکہ کامیاب ہوتے، جیسا کہ اس کا قول: **لَوْ أَرادَ الله أَنْ یَتَّخِذَ وَلَداً لَاصْطَفى‏** (اگر اللہ چاہتا کہ کوئی اولاد بنائے تو وہ ضرور چن لیتا)۔ پس اس نے گود لینے (تبنی) کو جائز قرار دیا، بلکہ اس میں اس بات کی بو ہے کہ جبریل مریم کے سامنے **بَشَراً سَوِیًّا** (ایک مکمل انسان) کی صورت میں متمثل ہوئے۔ اور ذات حق (الحق) نے اپنی ذات کو صورتوں میں تبدیل ہونے سے موصوف کیا ہے اور ان کے احکام کو اپنی ذات پر جاری کیا ہے، اور یہ ایک ایسا علم ہے جس کی طرف ایمان کی خاطر اشارہ کیا جاتا ہے، اور اسے عام لوگوں میں ظاہر نہیں کیا جاتا، اس چیز کی وجہ سے جو نفوس میں پہلے سے موجود ہے۔ اور اصطفاء (چننا) کا تعلق کس سے ہے، یہ باقی رہا۔ کیا یہ صاحبت (بیوی) سے ہے؟ تو یہ صورتوں میں تجلی (التجلی) کے باب میں ہو گا، پس وہ دونوں صورتوں کی عین ہو گا، کیونکہ اس نے فرمایا: **لَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً** (اگر ہم چاہتے کہ کوئی لہو (اولاد) بنائیں) **لَاتَّخَذْناهُ من لَدُنَّا** (تو ہم اسے اپنے پاس سے بنا لیتے)۔ اور اس کا ظہور صرف صاحبت (بیوی) سے ہوتا ہے جو کہ ماں ہے۔ پس اصطفاء (چننا) صاحبت کے حق میں ہو گا، اور وہ اس کے پاس سے ہے، پس وہ اپنی ذات سے باہر نہیں نکلی، جیسا کہ آدم علیہ السلام اپنی صاحبت میں اپنی ذات سے باہر نہیں نکلے، پس انہوں نے صرف اس سے نکاح کیا جو ان کا ایک حصہ ہے۔ اس کے ذریعے اور مجموعی طور پر وہ خود ہی ہوتے ہیں۔ پس یہ اس کا قول ہے: **من لَدُنَّا** (اپنے پاس سے)۔ اور حرف \"لو\" (اگر) کے ساتھ آیا، پس یہ امتناع (روک) پر دلالت کرتا ہے، پس یہ دونوں صورتوں میں نہیں ہوا۔ اور اگر اصطفاء (چننا) بنوت (بیٹا ہونا) کے لیے ہے، تو وہ تبنی (گود لینا) ہے نہ کہ بنوت (بیٹا ہونا)۔ اور اگر انہوں نے کسی غیر الٰہی خبر پر استناد کیا، اور الٰہی خبر سے میری مراد وہ ہے جو رسولوں کی زبان پر کتابوں میں یا وحی میں آئی ہے، پس اگر ان کا استناد کسی الٰہی کشف (الکشف) اور اس میں اطلاع پر ہے، تو وہ اس کے حکم کے تحت ہیں جس پر انہیں اطلاع ملی۔ اور مقلدین کے لیے اس میں کوئی عذر نہیں، کیونکہ ان میں نشأت کے حکم سے اطلاع کی اہلیت ہے، کیونکہ اس کے لیے ایک عام استعداد ہے، اور وہ اطلاع کی استعداد ہے، اگرچہ اطلاع میں تفاوت ہو، تو وہ کسی دوسرے خاص استعداد کی وجہ سے ہے جو عام استعداد کے علاوہ ہے۔ پس اہل جبر اگر خبر کو مضبوطی سے پکڑیں تو کامیاب ہوں گے، اور اگر تاویل میں غلطی کریں اور علم کو نہ پائیں، تو انہیں اجتہاد کا ثواب ملے گا، اور اگر وہ صحیح پائیں تو یہی مقصود ہے۔ پس ان میں سے کچھ وہ ہیں جو اپنی درستی کی وجہ سے **عَلى‏ بَیِّنَةٍ من رَبِّهِ** (اپنے رب کی طرف سے دلیل پر) ہیں، اور ان میں سے کچھ وہ ہیں جو اپنے رب کی طرف سے دلیل پر نہیں ہیں، حالانکہ وہ حقیقت میں صحیح ہیں۔ اور جس کے پاس بھی الٰہی سہارا ہے، وہ نجات پانے والا ہے، اور جس نے سب کا کفر کیا، تو یہ اندھے پن کی انتہا ہے۔\n\n(فصل) کونی ترغیب (التحضیض الکوني) کے بیان میں\n\nاور یہ ایک راز ہے جسے اللہ نے اپنے عام بندوں اور اس راستے کے سالکین (السالكين) میں رکھا ہے۔ لیکن خواص سے یہ کبھی واقع نہیں ہوتا، کیونکہ یہ کوئی الٰہی صفت نہیں ہے، مگر یہ اللہ کی طرف سے اس چیز میں آئی ہے جو کائنات سے متعلق ہے، نہ کہ اس سبحانہ و تعالیٰ سے متعلق، جیسا کہ اس کا قول: **لَوْ لا جاؤُ عَلَیْهِ بِأَرْبَعَةِ شُهَداءَ** (کیوں نہ وہ اس پر چار گواہ لائے؟)۔ اور جہاں تک لفظ \"لو\" (اگر) کا تعلق ہے، تو یہ الٰہی ہے اور ترغیب (تحضیض) کا معنی شامل ہے۔ اور اللہ کے خواص نے اس سے صفت اختیار کی ہے۔ پس رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"اگر مجھے اپنے معاملے کا وہ حصہ پہلے معلوم ہو جاتا جو بعد میں معلوم ہوا، تو میں قربانی کا جانور ساتھ نہ لاتا اور اسے عمرہ بنا دیتا، لیکن میں قربانی کا جانور ساتھ لایا ہوں، پس مجھ پر کوئی حرام حلال نہیں ہو گا **حَتَّى یَبْلُغَ الْهَدْیُ مَحِلَّهُ** (یہاں تک کہ قربانی اپنی جگہ پہنچ جائے)۔\" پس \"لو\" میں ترغیب (تحضیض) کی بو وہ ہے جو اس سے سمجھی جاتی ہے، گویا انہوں نے اپنے آپ سے کہا کہ کاش میں نے عمرہ کا احرام باندھا ہوتا۔ اور خواص سے ترغیب (تحضیض) کبھی واقع نہیں ہوتی مگر ان افعال میں جن میں انہوں نے اپنے نفوس کو مشغول کیا جو اللہ کو راضی کرتے ہیں، پس انہیں دوسرے وقت میں اللہ کی رضا کے لیے پہلے سے زیادہ مکمل اور اعلیٰ کام کرنے کا خیال آتا ہے، یا تو اللہ کی جناب میں، یا اپنے حق میں، یا دوسروں کے حق میں ان پر نرمی اور شفقت کرتے ہوئے، نہ کہ اللہ پر اعتراض کے طور پر کہ وہ کہیں کہ کاش اللہ نے اس کام کے بجائے ایسا کیا ہوتا۔ یہ خواص سے کبھی بھی متصور نہیں ہو سکتا، کیونکہ یہ اللہ تعالیٰ کے ساتھ سوءِ ادب ہے اور ایک کونی تدبیر کو الٰہی تدبیر پر ترجیح دینا ہے۔ اور ذات حق (الحق) نے اپنی ذات کو **یُدَبِّرُ الْأَمْرَ** (وہ امر کی تدبیر کرتا ہے) سے موصوف نہیں کیا مگر اس لیے کہ ہمیں یہ معلوم ہو جائے کہ اس نے کوئی کام نہیں کیا مگر وہی جو حکمتِ وجود (الوجود) کا تقاضا تھا، اور اس نے اسے اس جگہ پر اتارا جہاں اگر وہ اسے نہ اتارتا تو حکمت کا حق ادا نہ ہوتا۔ اور وہ **الَّذِی أَعْطى‏ كُلَّ شَیْ‏ءٍ خَلْقَهُ** (وہ جس نے ہر چیز کو اس کی خلقت عطا کی) ہے۔ اور اسی لیے یہ ممکن نہیں کہ وہ اپنے بندوں کے لیے اپنی طرف نظر کرتے ہوئے ترغیب (تحضیض) کی صفت میں ظاہر ہو، پس اس نے اسے زبان میں، بلکہ تمام زبانوں میں، اپنے بندوں کے لیے آزمائش اور جانچ کے طور پر رکھا، تاکہ اہل عنایت اس سے بچیں اور اس طرح دوسروں سے ممتاز ہو جائیں۔\n\n### [کہ سعادت (خوشی) کمالِ صورت سے مختلف ہے]\n\nجان لو کہ وہ الٰہی اختصاص جو سعادت (خوشی) عطا کرتا ہے، وہ الٰہی اختصاص نہیں ہے جو کمالِ صورت عطا کرتا ہے۔ اور یہ دونوں اختصاص بعض افراد کے حق میں جمع بھی ہو سکتے ہیں۔ وہ اختصاص جو سعادت (خوشی) عطا کرتا ہے وہ ایمان اور مخالفت سے عصمت کا اختصاص ہے، یا توبہ کے بعد موت کا۔ اور وہ اختصاص جو کمالِ صورت عطا کرتا ہے، وہ صرف اقتدار کے نفاذ اور ہمت و حس کے ذریعے عالم (العالم) میں حکمرانی عطا کرتا ہے۔ اور کامل وہ ہے جسے دونوں اختصاص نصیب ہوں۔ اور سب سے قوی تاثیر اس شخص کی تاثیر ہے جو اللہ کو غضبناک کرے، جیسے قومِ فرعون، جہاں اللہ تعالیٰ نے ان کے بارے میں فرمایا: **فَلَمَّا آسَفُونا انْتَقَمْنا مِنْهُمْ** (پس جب انہوں نے ہمیں غضبناک کیا تو ہم نے ان سے انتقام لیا) یعنی انہوں نے ہمیں غصہ دلایا۔ اور اللہ سبحانہ و تعالیٰ کے لیے اقتدار کا نفاذ ہے، پس اس نے ان سے انتقام لیا تاکہ وہ دوسروں کے لیے عبرت بن جائیں۔ اور اس نے اسے کونی اقتدار کے نفاذ کے مقابلے میں رکھا، کیونکہ اس نے فرمایا: **آسَفُونا** (انہوں نے ہمیں غضبناک کیا)۔ کیا تم فرعون کے اس علم کو نہیں دیکھتے جب اس نے کہا: **فَلَوْ لا أُلْقِیَ عَلَیْهِ أَسْوِرَةٌ من ذَهَبٍ** (تو کیوں نہ اس پر سونے کے کنگن ڈالے گئے؟)۔ وہ کہتا ہے کہ \"فلو لا\" جو کہ ترغیب (تحضیض) کا حرف ہے، یعنی موسیٰ کو ہم میں اقتدار کا نفاذ عطا کیا جاتا تاکہ ہم اس سے جھگڑا نہ کرتے اور اس کی سنتے اور اطاعت کرتے، کیونکہ ہاتھ قدرت کا محل ہیں، اور کنگن (أسورة) جو کہ سونے کا ایک محیط شکل ہے، وہ سب سے کامل زینت ہے جو دھاتوں سے حاصل کی جاتی ہے۔ اور اقتدار کا نفاذ الٰہی اختصاص میں سے ہے۔ وہ اپنی قوم سے کہتا ہے کہ موسیٰ کو یہ عطا نہیں کیا گیا۔ اور جو چیز تمہیں ہماری کہی ہوئی بات پر دلالت کرتی ہے وہ یہ ہے کہ فرعون نے اس قول میں یہی معنی مراد لیا، کہ اس کے بعد اس نے \"أو\" (یا) کا حرف لایا جو مناسبت کے ساتھ عطف کا حرف ہے، پس اس نے کہا: **أَوْ جاءَ مَعَهُ الْمَلائِكَةُ مُقْتَرِنِینَ** (یا اس کے ساتھ فرشتے قطار باندھے ہوئے آتے)۔ کیونکہ وہ جانتا تھا کہ اس کی قوم جانتی ہے کہ اگر فرشتے آتے تو وہ خوشی یا ناخوشی سے موسیٰ کے تابع ہو جاتے۔ فرعون کہتا ہے کہ موسیٰ علیہ السلام کے لیے ہم میں اقتدار کا نفاذ نہیں تھا کہ میں کسی ضروری امر کے ذریعے اپنے نفس سے اس کی بات کی طرف رجوع کرتا جسے ہم دفع نہیں کر سکتے، پس تم میرے رجوع کی وجہ سے اس کی بات کی طرف رجوع کرتے، اور نہ ہی اس کے ساتھ کوئی ایسا آیا جس کے اقتدار سے انکار نہ کیا جا سکے۔ **فَاسْتَخَفَّ قَوْمَهُ** (پس اس نے اپنی قوم کو ہلکا سمجھا) یعنی اس نے ان کے معانی کو اس بات پر غور کرنے سے لطیف کر دیا جو اس نے ان سے کہی۔ پس جب اس نے ان میں یہ حالت پیدا کی تو انہیں اس پر گہرائی سے غور کرنے پر مجبور کیا، اور اس سے پہلے ان کی یہ حالت نہیں تھی۔ پس انہوں نے ظاہری طور پر غالب قہر کی وجہ سے اس کی اطاعت کی، کیونکہ وہ ایک ایسی جگہ پر تھا جہاں خوف اور امید دونوں تھے، اور باطنی طور پر اس بات پر غور کرنے سے جو اس نے ان سے کہی۔ پس جب اس نے ان کے دلوں کو مکمل طور پر اپنی طرف کھینچ لیا اور اللہ کے لیے ان میں کوئی حصہ باقی نہ رہا جو انہیں بچا سکے، تو انہوں نے اللہ کو غضبناک کیا، پس وہ غضبناک ہوا اور انتقام لیا۔ پس ان کا حکم حقیقت میں فرعون کے اپنے حکم کے خلاف تھا، کیونکہ وہ موسیٰ علیہ السلام کی سچائی کو جانتا تھا، اور اس نے اپنے ظاہر میں اللہ کے حکم کو جانا جو اس سے صادر ہوا، اور اپنے باطن میں اللہ کے حکم کو جانا جو وہ موسیٰ کی دعوت کی سچائی کے بارے میں اعتقاد رکھتا تھا۔ اور اس کے باطن میں مقرر شدہ ایمان کا اللہ کے نزدیک ظاہر ہونا ایک مخصوص وقت کے ساتھ خاص تھا جو صرف اسی میں ہو سکتا تھا، اور ایک خاص حالت کے ساتھ۔ پس جب اس کا وقت اور حال آیا تو وہ ایمان کے ساتھ ظاہر ہوا، پس اس کی قوم کا غرق ہونا ایک نشانی تھی، اور فرعون کا اپنے ایمان کے ظاہر ہونے پر اپنی قوم کے بغیر اپنے بدن کے ساتھ نجات پانا ایک نشانی تھی۔ پس اللہ کی اپنے بندوں پر رحمت میں سے ہے کہ اس نے فرمایا: **فَالْیَوْمَ نُنَجِّیكَ بِبَدَنِكَ** (پس آج ہم تجھے تیرے بدن کے ساتھ نجات دیں گے) یعنی تیری قوم کے بغیر، **لِتَكُونَ لِمَنْ خَلْفَكَ آیَةً** (تاکہ تو اپنے بعد والوں کے لیے ایک نشانی ہو جائے)۔ یعنی جو اللہ پر ایمان لائے اس کے لیے ایک علامت کہ اللہ اسے اس کے بدن کے ساتھ نجات دے گا، یعنی اس کے ظاہر کے ساتھ، کیونکہ اس کا باطن شرک سے نجات کے ساتھ ہمیشہ محفوظ رہا، کیونکہ علم سب سے قوی رکاوٹ ہے۔ پس اللہ نے غرق ہونے میں ان سب کو برابر رکھا، اور حکم میں فرق رکھا، پس انہیں بعد میں آنے والی امتوں کے لیے پیشرو اور مثال بنایا، اور فرعون کو خاص کیا کہ اس کی نجات ان لوگوں کے لیے نشانی ہو جو نجات کے ساتھ اللہ کی طرف رجوع کریں۔\n\nاور چونکہ کامل الٰہی اختصاص سعادت (خوشی) اور صورت کو جمع کرنے میں ہے، اس لیے مومن کے لیے کمال خلافت کے ذریعے اس جگہ میں ہے جہاں غضبناک ہونے پر اقتدار کے نفاذ کی صورت کا کمال ظاہر ہونا اس کا خاصہ ہے۔ اور جنت اس صفت کا محل نہیں ہے، پس وہ دارِ خلافت نہیں، بلکہ دارِ ولایت ہے۔ اس ولایت کے حامل پر ایک ایسا حکم نافذ ہے جس سے وہ تجاوز نہیں کرتا، اور اس کی نشأت اسے اس کے سوا کسی اور کو قبول کرنے کی اجازت نہیں دیتی۔ یہاں تک کہ اگر اس میں کوئی ایسی تقدیر ہوتی جس کا کام غضبناک ہونا ہوتا، تو بھی صاحبِ ولایت غضب کی صفت کو قبول نہ کرتا، کیونکہ وہ دنیا کی نشأت کے برعکس ایک خاص مزاج پر ہے۔ اور اسی لیے اس نے فرمایا: **إِنِّی جاعِلٌ فی الْأَرْضِ خَلِیفَةً** (بے شک میں زمین میں ایک خلیفہ بنانے والا ہوں)، اور یہ نہیں فرمایا کہ عالم (العالم) میں۔ اور اگر فرشتوں نے اعتراض نہ کیا ہوتا تو وہ سجدے کی آزمائش میں نہ پڑتے۔ پس جس آزمائش میں وہ پڑے، وہ ایک باریک اور خفی غضب کی وجہ سے تھی جسے صرف علم میں راسخ لوگ ہی محسوس کرتے ہیں۔ اور اسی طرح ہر الٰہی انتقام جو عالم (العالم) پر واقع ہوتا ہے، وہ غضبناک ہونے کے بعد ہی ہوتا ہے، کیونکہ اللہ نے عالم (العالم) کو رحمت کے ساتھ پیدا کیا ہے، اور انتقام اس کا خاصہ نہیں ہے، جیسا کہ غضب انتقام کا خاصہ ہے۔ لیکن غضب، یعنی غضب، مختلف طبقات پر ہے، پس انتقام اپنے میزان کے مطابق ظاہر ہوتا ہے، بغیر کسی زیادتی یا کمی کے۔ اور انتقام کبھی بھی واقع نہیں ہوتا مگر اس شخص کی تطہیر کے لیے جس کی طرف سے غضب ہوا ہو۔ اس لیے انتقام غیر متناہی نہیں ہوتا، بلکہ اس کا حکم اللہ کے نزدیک ایک مقررہ مدت تک ختم ہو جاتا ہے، اور اس کے بعد رحمت اس کی پیروی کرتی ہے، کیونکہ رحمت کے لیے وہ ابدی حکم ہے جو کبھی ختم نہیں ہوتا۔ اور جس نے ہماری ذکر کردہ باتوں پر توجہ دی اور گہرائی سے غور کیا، اس نے الٰہی حکم میں عدل کے سرایت کرنے، فضل کے شمول، اور رحمت کے غضب پر سبقت لے جانے کا ایک عظیم الٰہی علم دیکھا، اور یہ کہ ذات حق (الحق) اپنے حکم میں ان حقائق کے مطابق جاری ہے جن پر وہ ہیں، کیونکہ حقائق اپنی ذات میں نہ بدلتے ہیں اور نہ منتقل ہوتے ہیں۔ پس یہ جو کچھ ہم نے اس مسئلے میں ذکر کیا ہے، یہ ان آیات میں سے ہے جو ذات حق (الحق) نے مترجم کی زبان پر **لِقَوْمٍ یَتَفَكَّرُونَ** (ان لوگوں کے لیے جو غور و فکر کرتے ہیں) اور **لِقَوْمٍ یَعْقِلُونَ** (ان لوگوں کے لیے جو عقل رکھتے ہیں) کے لیے لائی ہیں۔ یہ اس صنف کے علاوہ کسی اور کے لیے نہیں ہیں۔ پس غضبناک ہونے کی معرفت کو پوری طرح حاصل کرنے کی حفاظت کرو تاکہ تم اس سے بچو، کیونکہ یہ علمِ اسرار (الأسرار) میں سے ہے جسے ہر کوئی نہیں جانتا۔ اور یہ علم حذیفہ بن یمان رضی اللہ عنہ، رسول اللہ صلی اللہ علیہ وسلم کے صحابی کا علم تھا، اور اسی لیے رسول اللہ صلی اللہ علیہ وسلم کے صحابہ انہیں صاحب السر (رازدار) کہتے تھے، کیونکہ وہ اس علم کو جانتے تھے۔ اور اللہ اپنے اولیاء کو جو علم عطا کرتا ہے، ان کے حق میں اس علم سے زیادہ نفع بخش کوئی علم نہیں ہے۔ اور میں نے حذیفہ کے بعد اہل اللہ میں سے کسی کو نہیں دیکھا جس میں اس علم کا ذوق ہو، اور نہ کسی کے بارے میں سنا جس پر اس علم کا حکم ظاہر ہوا ہو، اور یہ ایک خفی عصمت ہے جسے اس کا حامل بمشکل ہی محسوس کرتا ہے۔ اور کشف (الکشف) میں اس سے زیادہ مکمل کوئی چیز نہیں ہے۔ اور اللہ یہ علم صرف باادب، اہل مراقبہ کو عطا کرتا ہے، کیونکہ وہ چیزوں کو رب اور مربوب، اور خالق اور مخلوق کے درمیان مطابقت اور مناسبت کے حکم سے لیتے ہیں۔ اور ان پر امکان اور جواز کا حاکم حکم نہیں لگاتا، کیونکہ اس حضوری میں اس (امکان) کا کوئی قدم یا عین نہیں ہے۔ اور یہ مقام عقل کی حد سے ماورا ہے، کیونکہ عقل اس طرح کے معاملے میں امکان کا حکم لگاتی ہے، حالانکہ معاملہ حقیقت میں ایسا نہیں ہے، لیکن جب وہ اس کا شہود (الشہود) کرتا ہے تو اسے قبول کر لیتا ہے، اور جب اس میں غور و فکر کرتا ہے تو اسے امکان کے تحت لے آتا ہے۔\n\nاور یہ منزل علوم میں سے علمِ ایہام (وہم ڈالنا)، ابہام (مبہم کرنا)، رموز، اور اسرار (الأسرار) کے ساتھ خاص ہے۔ اور اس میں مرکب حروف کا علم ہے جو کہ کلمہ ہیں۔ اور اس میں انوار کا علم ہے، اور وہ جو عالمِ شہادت (الشہود) کے ساتھ خاص ہے۔ اور اس میں علمِ جعل (پیدا کرنا) ہے۔ اور اس میں علمِ جمع اور تفصیل ہے۔ اور اس میں الٰہی اسماء اور ان کے احکام میں بلندی کی منازل کا علم ہے۔ اور اس میں علمِ اعجاز ہے۔ اور اس میں علمِ تقریر ہے۔ اور اس میں جہل کے نتائج کا علم ہے، جو کہ ایک عدمی امر ہے، تو اسے وجودی حکم کیسے ہو سکتا ہے؟ اور اس میں اقتدار کا اقتدار سے مقابلہ کرنے کا علم ہے۔ اور اس میں عالم (العالم) میں وجود حق (الوجود الحق) کے سرایت کرنے کا علم ہے، اور اسی لیے کسی نے اس کا انکار نہیں کیا، بلکہ غلطی ماہیت (حقیقت) کو طلب کرنے سے ہوئی، جس کی وجہ سے اس میں وہ اختلاف پیدا ہوا جو عالم (العالم) میں ظاہر ہوا۔ اور اس میں اس علم کا بیان ہے جو حق تعالیٰ اپنی ذات کے لیے خاص کرتا ہے، بغیر اس کے کہ اس کا عالم (العالم) میں کوئی حکم ہو۔ اور اس میں تمام شرائع کا علم ہے، اور یہ کہ وہ جعل (پیدا کرنے) سے ہیں، اور اسی لیے وہ ایک مدت تک جاری رہیں گی، اور ان کی غایت قیامت میں دونوں فریقوں میں حق کا حکم ہے۔ پس جب دونوں گھر (دنیا و آخرت) آباد ہو جائیں گے اور سزا کی مدت ختم ہو جائے گی، تو رحمت کا حکم پھیل جائے گا۔ اور اس میں شفع (جفت) اور وتر (طاق) کا علم ہے، اور فرد پر زوج کے علم کی تقدم کا علم ہے۔ اور حامل اور محمول کا علم ہے۔ اور بلایا (آزمائشوں)، مصیبتوں اور تکلیف دہ امور میں نعمتوں کے شمول کا علم ہے۔ اور اس میں کونی طاقت کی نفی اور اسے اللہ کی طرف لوٹانے کا علم ہے۔ اور اس میں اللہ اور عالم (العالم) کے درمیان عالم (العالم) کی تقسیم کا علم ہے، اور یہ کہ کیا چیز اللہ کے لیے عالم ہے اور کیا چیز عالم (مخلوق) کے لیے عالم ہے، اور اس شخص کی صفت جو اسے جانتا ہے اس شخص سے جو اسے نہیں جانتا۔ اور کیا جاننے والے پر اسے چھپانا واجب ہے یا وہ اپنی ذات کے لیے اسے چھپاتا ہے؟ اور محاکمات (فیصلوں) کا علم اور ان میں لوگوں کے تفاوت کا علم ہے۔ اور الٰہی مطالبات کب ہوں گے اور ان کا انجام کیا ہو گا؟ اور اس سبب کا علم جو تمام مخلوق کو الٰہی مشیئت کی طرف لوٹاتا ہے، اور کیا یہ علم سے رجوع ہے یا قہر سے رجوع؟ اور علمِ تقلید (التقليد) اور علمِ نظر کے درمیان فرق کا علم ہے۔ اور کیا وہ چیز جس پر مقلد بھروسہ کرتا ہے، اس کے حق میں علم ہوتی ہے یا نہیں؟ اور عالم (العالم) پر سابقہ (تقدیر) کے حکم کا علم، اس کے برعکس جو ان کا علم عطا کرتا ہے۔ اور عواقب (انجام) کا مطلق علم، اور کیا اس کا اثر جاننے والے کے لیے حال میں عام ہوتا ہے یا نہیں؟ اور فترات (وقفوں) کا علم اور ان کے حاملین کا حکم۔ اور اشراف (شریف لوگ) کا علم اور وہ کیا ہیں؟ اور کیا عالم (العالم) میں شریف اور اشرف ہیں یا نہیں؟ عالم (العالم) میں فضیلت کا علم، اور جب فضیلت واقع ہو، بلکہ وہ واقع ہے، تو کیا ناظر اس میں مساوات کی طرف لوٹتا ہے، پس ہر مفضول اس پر فضیلت رکھتا ہے جس پر اسے فضیلت دی گئی؟ اور یہ ایک جماعت کا مذہب ہے جن میں سے ابو القاسم بن قسی، صاحبِ خلع النعلین (جوتے اتارنا) بھی ہیں۔ اور اس میں اس حکمت کا علم ہے جو اللہ نے عالم (العالم) میں اختلاف کی صورت میں رکھی ہے۔ اور اس میں اس سبب کا علم جس کی وجہ سے شیطان انسان کے ساتھ لازم ہو گیا، اور نبی صلی اللہ علیہ وسلم کا قول کہ اللہ نے اس پر میری مدد کی تو وہ مسلمان ہو گیا۔ اور اس میں اس شخص کے حکم کا علم ہے جس پر باطل حق کے ساتھ ملتبس ہو گیا ہو۔ اور اس میں علمِ کشف (الکشف) ہے، کیونکہ کسی مخلوق کے لیے کسی چیز پر اقتدار نہیں ہے، اور یہ کہ سب کچھ اللہ کے ہاتھ میں ہے۔ اور یہ تکلیف کی وجہ سے حیرت کا علم ہے، اور اس کا واقع ہونا اس پر جس کے پاس امر میں سے کچھ بھی نہیں ہے۔ اور اس میں مسببات میں الٰہی اسباب کے اثر کا علم ہے، کیا وہ ذاتی ہے یا الٰہی جعل (پیدا کرنا)؟ اور اس میں ظہور الٰہی (التجلی الإلهي) کے عطا کردہ پر خوش ہونے اور اس سے وابستہ رہنے کا علم ہے۔ اور اس میں توحید نبوی کا علم ہے۔ اور اس میں ان پردوں کا علم ہے جو عالم (العالم) میں علم کے حکم کو روکتے ہیں، باوجود اس کے کہ اس کا علم اس کے پاس موجود ہے۔ اور اس میں عذاب کو دیکھنے اور اس کے نازل ہونے پر اللہ کی طرف رجوع کو قبول کرنے کا علم ہے، اور یہ کہ یہ ان کے لیے آخرت میں نفع بخش ہے، اگرچہ دنیا میں ان سے عذاب نہ ہٹایا جائے۔ اور قومِ یونس کو صرف دنیا کی زندگی میں ان کے رجوع کے وقت ان سے عذاب ہٹائے جانے کا اختصاص حاصل ہوا، پس اس کے قول کا معنی یہ ہو گا: **فَلَمْ یَكُ یَنْفَعُهُمْ إِیمانُهُمْ لَمَّا رَأَوْا بَأْسَنا** (پس جب انہوں نے ہمارا عذاب دیکھا تو ان کا ایمان انہیں نفع نہ دے سکا) یعنی دنیا میں۔ کیونکہ اللہ فرماتا ہے: **وَأَخَذْناهُمْ بِالْعَذابِ لَعَلَّهُمْ یَرْجِعُونَ** (اور ہم نے انہیں عذاب میں پکڑا تاکہ وہ رجوع کریں)۔ پس عذاب کے نازل ہونے کے باوجود رجوع کرنے والے کا رجوع مقبول ہے، کیونکہ اس نے وہ چیز پیش کی جس کی اس سے امید کی گئی تھی، اس کے قول **لَعَلَّهُمْ یَرْجِعُونَ** (تاکہ وہ رجوع کریں) کے ذریعے۔ اور اس میں عالم (العالم) میں ذات حق (الحق) کے اسرار (الأسرار) کا علم ہے، اور عالم (العالم) کا ذات حق (الحق) کی صورت اور اس کی منزل میں ظاہر ہونا ہے۔ اور اس میں ہر نوع میں ولایت کے عموم کا علم ہے، اور جو اس میں سے ختم ہو جاتی ہے اور جو ختم نہیں ہوتی۔ اور اس میں الٰہی اضافات کا علم ہے، کیا وہ تشریف (عزت دینا) کے طریقے پر ہیں یا ابتلاء (آزمائش) کے طریقے پر، یا ان میں سے کچھ تشریف ہیں اور کچھ ابتلاء؟ اور اس میں اس شخص کے مرتبے کا علم ہے جس نے ظاہر اور باطن کو جمع کیا، اس شخص کے مقابلے میں جس نے جمع نہیں کیا۔ اور اس میں واسطوں پر بھروسہ کرنے کی حکمت کا علم ہے، کیا وہ ابتلاء کے طریقے پر ہے یا اس سے واسطوں کو عزت دینا مقصود ہے؟ اور اس میں جھگڑنے والوں پر الٰہی حجت قائم کرنے کا علم ہے، اور اس شخص کا حکم جس نے جھگڑا نہیں کیا اور حق کو اس کے اہل کے لیے تسلیم کیا۔ اور اس میں ذات کے ساتھ الٰہی احاطہ کا علم ہے۔ اور اس میں زیادتیوں کا علم ہے، کیا وہ اس طرح ہیں کہ زید کے پاس جو کچھ ہے یا اس کا کچھ حصہ لے کر عمر کو دے دیا جائے، یا وہ معدوم کو وجود میں لانے سے زیادتی ہیں، یا کیا ان میں سے کچھ معدوم کو وجود میں لانا ہے اور کچھ ایک شخص سے دوسرے شخص کی طرف منتقل ہونا ہے؟ اور اس میں ان علوم کا علم ہے جو اللہ کے ساتھ خاص ہیں، اور ان علوم کا علم جو کائنات کے ساتھ خاص ہیں، جن کا عقل میں اللہ کا حکم ہونا جائز نہیں، اور کیا اس کا حکم شریعت میں ویسا ہی ہے جیسا کہ عقل میں ہے یا نہیں؟ اور یہ حواس کے ذریعے ذوق کا علم ہے۔ اور اس میں شفاعت کرنے والوں کے مراتب کا علم ہے، اور ان کی اس صفت کا علم ہے جس کے ذریعے وہ شفاعت کے مالک ہوتے ہیں۔ پس یہ اس منزل کے بعض علوم ہیں۔ **وَالله یَقُولُ الْحَقَّ وهُوَ یَهْدِی السَّبِیلَ** (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔\n\nبائیسواں سفر مکمل ہوا۔",
    "fa": "باب سیصد و چهل و یکم در معرفت منزل تقلید (التقليد) در اسرار\n\nدر هر حکمی از احکام، تقلید (التقليد) وجود دارد\nو در آن سلطنت و تأییدی در ما نهفته است\n\nاگر آن (تقلید) نبود، مرا در علم ما قدمی نبود\nو نه تنزیل (التنزيل) و توحیدی (التوحيد) وجود داشت\n\nهمانا خلافت، تقلید و سلطنت است\nپس او امامی است که برای حق (الحق) مشهود است\n\nاو امانتی است که صاحبش از طاعت جدا نمی‌شود\nو او نزد خداوند ستوده است\n\nهر کس در هستی (الوجود) خداست، او را در سرّش مراقبت می‌کند\nپس او در کائنات مقصود است\n\nپروردگارم او را به آنچه حضرتش از صفات عطا می‌کند، آراسته است\nپس در علم موجود نیست\n\nجز او، پس او امام همه خلق است\nو او اله است، پس مجهول و محدود است\n\n### [اینکه تقلید (التقليد) اصلی است که هر علم نظری، ضروری یا کشفی به آن بازمی‌گردد]\n\nبدان، خداوند ما و شما را به روح قدسی‌اش تأیید کند، که تقلید (التقليد) اصلی است که هر علم نظری، ضروری یا کشفی (الکشف) به آن بازمی‌گردد، اما مردم در آن بر مراتبی هستند. پس برخی از پروردگارشان تقلید کرده‌اند و آنان طایفه علّیه و صاحبان علم صحیح هستند؛ و برخی از عقل خود تقلید کرده‌اند و آنان صاحبان علوم ضروری هستند، به طوری که اگر شک‌کننده‌ای با امری امکانی در آن‌ها شک اندازد، آن را نمی‌پذیرند، با وجود علمشان به اینکه آن امر ممکن است، و آن را قبول نمی‌کنند. پس اگر در این باره به آن‌ها بگویی، می‌گویند: زیرا در علم ضروری قدحی وارد نمی‌کند. مثال‌های آن بسیار است که به خاطر نفوس ضعیف ذکر نمی‌کنم، زیرا پذیرش آن منجر به ضرر و هوس می‌شود، و این مرا از بیان آن‌ها بازمی‌دارد. و برخی از عقل خود در آنچه فکرشان به آن‌ها داده است، تقلید کرده‌اند. و جز این‌ها کسی نیست. پس تقلید همه دانشمندان را فرا گرفته است. و تقلید، تقیید (محدودیت) است. پس تا زمانی که عالم از حقیقت خود خارج نشده است، او موجود مقید است، و ناگزیر است که علمش نیز مانند خودش مقید باشد. و تقیید در آن عین تقلید است، جز اینکه در برخی مواطن مذمت شده است که معلوم است، و در برخی مواطن ستوده شده است که معلوم است. و در میان منازل، منزلی دشوارتر از این منزل برای صعود نیست؛ این منزل دشوارتر از منزل عقبات سُویق است، زیرا صاحب آن منزل گاهی چنین و گاهی چنان است، اما صاحب این منزل ثابت‌قدم در آن است.\n\nپس اگر تقلید (التقليد) حاکم است و ناگزیر و گریزناپذیر است، تقلید از ربّ در آنچه از علم به خود تشریع کرده است، اولی‌تر است. پس از آن روی مگردان، زیرا او تو را از خود در علمی خبر داده است که تو در آن از عقلت تقلید کرده‌ای، از حیث تقلید عقلت از فکرش که با آن در دلیلش می‌نگرد، و نقیض آن را از علم به خود به تو عطا کرده است. و اصل در عالم، جهل است و علم، اکتسابی است. پس علم، وجود است و وجود از آن خداست، و جهل، عدم است و عدم از آن عالم است. پس تقلید از حق (الحق) که وجود از آن اوست، اولی‌تر از تقلید از کسی است که مانند تو مخلوق است. پس همان‌گونه که وجود را از او سبحانه کسب کردی، علم را نیز از او کسب کن. پس نزد خبری که او از خود داده است، توقف کن و به تناقض در اخبار اهمیت مده، زیرا برای هر خبری مرتبه‌ای است که آن خبر در آن نازل می‌شود، و تو حضرت جامع آن مراتب هستی. پس بر بینه‌ای از پروردگارت باش، نه از عقلت، زیرا عقل تو را جز به خودش ارجاع نمی‌دهد، چون تو را برای او آفریده است و تو را از او منحرف نمی‌کند.\n\nپس اگر حق (الحق) در ضرورت عقلت بر تو تجلی (التجلي) کند، خواهی یافت که استناد تو ناگزیر به امری است که آن را نمی‌دانی، از حیث تقلیدت از این ضرورت عقلی. و اگر در نظر عقلت بر تو تجلی کند، در خود خواهی یافت که این امری که در وجودت به آن استناد کرده‌ای، امری وجودی است که شبیه تو نیست، زیرا عین تو و هر آنچه به تو قائم است و وصف تو می‌شود، حادث و نیازمند به مُوجِدی مانند تو است. پس عقلت از حیث نظرش به تو می‌گوید که این موجود، چیزی از عالم شبیه او نیست، و تو همه عالم هستی، زیرا هر جزئی از عالم با کل در دلالت بر آنچه مقرر کردیم، شریک است. و اگر در شرع بر تو تجلی کند، تفاوت در مراتب عالم را برایت آشکار می‌سازد. پس در هر مرتبه‌ای بر تو تجلی می‌کند. پس در آن از شارع تقلید کن تا برایت کشف (الکشف) شود و امر را بر صورتی که تو بر آن هستی، ببینی. پس از پروردگارت تقلید کردی و او را هم مشبّه و هم منزّه دیدی. پس جمع کردی و فرق گذاشتی، و تنزیه کردی و تشبیه نمودی. و همه این‌ها تو هستی، زیرا این تجلی الهی (التجلي الإلهي) در مراتب است و تو جامع آن‌ها هستی، و آن‌ها از آن تو و از آن همه عالم هستند، و بر هر کس که در آن‌ها ظاهر شود، حاکم هستند و در چشم بیننده به آن رنگ می‌پذیرد. و به همین دلیل به تو گفتم: «و همه این‌ها تو هستی.» زیرا عالَمین (جهانیان) از علامت (العلامة) گرفته شده‌اند و علامت جز بر محدود دلالت نمی‌کند، پس جز بر تو دلالت نمی‌کند. زیرا خداوند از جهانیان بی‌نیاز است (فَإِنَّ الله غَنِيٌّ عَنِ الْعالَمِينَ). پس عالم به ذات خود بر علم دلالت نمی‌کند، بلکه بر علم به وجود خود دلالت می‌کند.\n\n### [اینکه حق (الحق) در حقیقت، ام الکتاب است]\n\nپس بدان که حق (الحق) در حقیقت، ام الکتاب (ام الکتاب) است، و قرآن کتابی از جمله کتب است، جز اینکه جامعیت (الجمعية) را دارد نه سایر کتب را. با این حال، قرآن صفت حق است و صفت، کسی را می‌طلبد که به او قائم باشد، و نسبت، کسی را می‌طلبد که به او منسوب شود. به همین دلیل گفتیم که قرآن ام الکتاب است که کتب نازل شده از آن خارج شده‌اند، و زبان‌ها به سبب پذیرش آن‌ها توسط حقیقت قرآن، مختلف شده‌اند. پس گفته شده است که آن عربی است، و عبرانی است، و سریانی است، بر حسب زبانی که به آن نازل شده است. و این عین جعل (الجعل) در قرآن و عین نسبت حدوث به آن است در قولش: هیچ یادآوری تازه‌ای (مُحدَث) از پروردگارشان برایشان نمی‌آید (ما يَأْتِيهِمْ من ذِكْرٍ من رَبِّهِمْ مُحْدَثٍ). پس آمدن آن حادث است، و آمدن عین انزال نیست، همان‌گونه که عین جعل نیست. و جعل گاهی به معنای خلق و گاهی به معنای غیر خلق است. پس آنچه از قول «مُحدَث» به قرآن نسبت داده می‌شود، از حکم جعل است که به معنای خلق است. پس در حکم، فرقی بین قولش: سپس او را نطفه‌ای در قرارگاهی استوار قرار دادیم (ثُمَّ جَعَلْناهُ نُطْفَةً في قَرارٍ مَكِينٍ) و قولش: همانا ما آن را قرآنی عربی قرار دادیم (إِنَّا جَعَلْناهُ قُرْآناً عَرَبِيًّا) نیست.\n\n### [اینکه تحقق «عندیت» (نزدیکی) هر شیء به خودش بازمی‌گردد]\n\nو بدان که تحقق عندیت (نزدیکی) هر شیء به خودش بازمی‌گردد. و به همین دلیل فرمود: آنچه نزد شماست، فانی می‌شود (ما عِنْدَكُمْ يَنْفَدُ)، زیرا حکم شما فناست؛ و آنچه نزد خداست، باقی است (ما عِنْدَ الله باقٍ)، زیرا بقا از آن اوست. اگر عندیت شیء غیر از خود شیء بود، آنچه نزد ماست فانی نمی‌شد، زیرا ما و آنچه نزد ماست، نزد خداست، و آنچه نزد خداست، باقی است. پس ما و آنچه نزد ماست، باقی هستیم. پس برای تو روشن شد که عندیت هر شیء، خود آن شیء است. و عندیت در زبان، ظرف مکان یا ظرف محلی است، مانند جسم برای عَرَضِ رنگی که چشم آن را درک می‌کند. پس در دلالتی که قصد می‌کنی، آشکارتر است. پس آن (عندیت) به منزله محل آن است، و صاحب مکان به منزله مکان نیست. و عندیت جامع هر دو امر است.\n\nو چون در تقلید ضروری ممکن نیست که کسی منکر آن چیزی شود که در وجودش به آن استناد کرده است، به همین دلیل کسی که شأنش انکار و جحود است، به آن اقرار کرده است. اگر بگویی: پس معطله (منکران صفات) انکار کردند؟ می‌گوییم: معطله منکر مُستَنَد نشدند، بلکه منکر و معطل آن چیزی شدند که شما آن را مُستَنَد تعیین کردید. آن‌ها مُستَنَد را معطل نکردند. پس شما گفتید: آن (مستند) چنین است. پس معطله آن را معطل کردند و گفتند: بلکه مستند چنین است. پس همان‌گونه که آنان معطله هستند، شما نیز معطله تعطیل آنان هستید، اما آنان به نام معطله اختصاص یافتند. و آنان در تعطیل بر انواعی هستند که علم به آن و امثال آن، علم به فرقه‌ها و ادیان است. و این علمی است که شایسته نیست مؤمن آن را بخواند و به طور کلی در آن نظر کند، همان‌گونه که بر اهل الله واجب است که علم هر فرقه و دینی را به واسطه خدا بشناسند تا او را در هر صورتی مشاهده کنند و در موطن انکار نایستند، زیرا او تعالی در هستی (الوجود) جاری است، و جز محدود آن را انکار نکرده است. و اهل الله تابع کسی هستند که اهل اویند، پس حکم او بر آنان جاری می‌شود، و حکم او تعالی عدم تقیید است. پس برای او عموم هستی (الوجود) است، و برای اهل او عموم شهود (الشهود) است. پس هر کس وجود خود را مقید کند، شهود خود را مقید کرده است و او از اهل الله نیست.\n\n### [اینکه خداوند خود را به استواء (الاستواء) و نزول (النزول) به آسمان وصف کرده است]\n\nو بدان که خداوند چون این خلقت را آماده ساخت، آن را زمینی برای خود قرار داد. پس خود را به استواء (الاستواء) و نزول (النزول) به آسمان و به تصرف در هر جهت از جهات هستی که رو به آن می‌گرداند، وصف کرد. پس به هر سو رو کنید، آنجا وجه خداست (فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله). پس روی خود را به سوی مسجد الحرام بگردان (فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرامِ). زیرا این حکم را که وجه خدا هر جا رو کنی هست، برنمی‌دارد، بلکه خداوند برای تو آنچه را که سعادت تو در توجه به اوست، انتخاب کرده است، اما در حالتی مخصوص و آن نماز است. و در سایر «کجاها» (الأینيات)، خداوند این تقیید را برای تو قرار نداده است. پس برای تو بین تقیید و اطلاق جمع کرده است، همان‌گونه که برای خود بین تنزیه و تشبیه جمع کرده است و فرمود: چیزی مانند او نیست و او شنوای بیناست (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهُوَ السَّمِيعُ الْبَصِيرُ).\n\nو عالم همه زمینی آماده است که در آن هیچ کجی و بلندی نمی‌بینی (لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً). آیا هیچ تفاوتی می‌بینی؟ پس چشم را بازگردان، قرآنی عربی که هیچ کجی در آن نیست (فَارْجِعِ الْبَصَرَ قُرْآناً عَرَبِيًّا غَيْرَ ذِي عِوَجٍ). و حق (الحق) صفت عالم است، زیرا صفت آن وجود است و وجود جز از آن خدا نیست. و به همین دلیل در خبر صحیح آمده است: «من گوش و چشم او بودم.» (كنت سمعه وبصره)\n\nو همچنین همه قوه‌ها و صفات او. پس چون عالم ظرف مکانی برای کسی بود که بر آن استواء یافت، به صورت آن ظاهر شد. از جنید درباره معرفت (المعرفة) و عارف پرسیدند، گفت: «رنگ آب، رنگ ظرف آن است.» پس اثر را برای ظرف در مظروف قرار داد. و این برای آن است که بدانی چه کسی را شناخته‌ای، پس بدانی که جز به واسطه خودت بر معروف خود حکم نکرده‌ای، پس جز خودت را نشناخته‌ای. پس هر رنگی که ظرف داشت، آب برای چشم بر حسب رنگ ظرف ظاهر شد. پس کسی که علم ندارد، حکم می‌کند که آن چنین است، زیرا چشم این را به او داده است. پس تجلی (التجلي) برای او در هر صورتی از صور ظروف، از حیث رنگ‌های آن‌هاست. پس آب در ذات خود مقید نشده است، اما تو آن را این‌گونه می‌بینی. و همچنین اشکال ظروفی که در آن‌ها ظاهر می‌شود، بر آن تأثیر می‌گذارد، در حالی که در همه آن‌ها آب است. پس اگر ظرف چهارگوش باشد، در صورت چهارگوش ظاهر می‌شود، یا اگر پنج‌گوش باشد، در صورت پنج‌گوش ظاهر می‌شود، یا اگر گرد باشد، در صورت گرد ظاهر می‌شود، زیرا آب خاصیت سیلان دارد. پس در زوایای ظروف جاری می‌شود تا شکل آن‌ها را آشکار سازد. پس این آب است که بینندگان را به دلیل جریانش واداشته است که بر آن به حکم ظروف در رنگ و شکل حکم کنند. پس کسی که آن را هرگز جز در ظرفی ندیده است، بر آن به حکم ظرف حکم می‌کند. و کسی که آن را بسیط و غیر مرکب دیده است، می‌داند که آنچه از اشکال و رنگ‌ها در آن ظاهر شده است، تنها از اثر ظروف است. پس آب در ظروف همان‌گونه است که در غیر ظرف است، با حد و حقیقت خود. و به همین دلیل نام آب از آن زایل نشده است، زیرا به حکم مطابقت بر آن دلالت می‌کند. پس این ظروف برای آن مانند راه‌ها در زمین برای سالک در آن‌هاست. پس سالک در هر راهی از آن‌ها به این نسبت داده می‌شود که طالب غایت آن راهی است که در آن سلوک کرده است. در هر صورتی که خواست، تو را ترکیب کرد (فِي أَيِّ صُورَةٍ ما شاءَ رَكَّبَكَ) از صور او. پس او ظاهر است نه تو، زیرا ظهور برای صور است نه برای عین. پس عین همیشه غیب است و صور همیشه شهادت (الشهود) است.\n\n### [اینکه خداوند بیان کرده است که در زمین عالم دو نجد (راه) وجود دارد]\n\nسپس چون از هر چیزی جفت آفرید، برای ما بیان کرد که در زمین عالم دو نجد (راه) وجود دارد: نجدی که غایت آن نزد قومی تو هستی، و نجدی که نزد این قوم غایت آن اوست، یعنی حق (الحق). و اما نزد قوم دیگری، نجد واحدی که غایت آن تو در او هستی، و نجد دیگر که غایت آن او در توست. و اما نزد قوم دیگری، نجد واحدی که غایت آن تو عین او هستی، و نجد دیگر که او عین توست. و اما نزد قوم دیگری، غایت دو نجد اوست و عین دو نجد تویی و عین سالک اوست. و اما نزد قوم دیگری، غایت دو نجد و عین دو نجد، و آن دو عین دو دست هستند و عین سالک تویی. و هر کس را که ذکر کردیم، بر صراط مستقیم است. پس کجی کمان برای تیراندازی، عین صراط مستقیم اوست. پس پیوسته در اختلاف خواهند بود، مگر کسانی که پروردگارت به آن‌ها رحم کند (فَلا يَزالُونَ مُخْتَلِفِينَ إِلَّا من رَحِمَ رَبُّكَ). پس ما از اختلاف بازنمی‌ایستیم، زیرا آنان با مختلفین مخالفت کرده‌اند، و به همین دلیل آن‌ها را آفریده است. پس هیچ خلقی از آنچه برای آن آفریده شده، تجاوز نکرده است. پس همه مطیع هستند، اگرچه در میانشان کسی باشد که مطیع نیست، با وجود اینکه مطیع است.\n\n### [اینکه استواء (الاستواء) صفتی برای حق (الحق) بر عرش است]\n\nو چون استواء (الاستواء) صفتی برای حق (الحق) بر عرش بود، و انسان را بر صورت خود آفرید، برای او مرکبی قرار داد و آن را فلک نامید، همان‌گونه که عرش فلک بود. پس فلک، مستوای انسان کامل (الإنسان الکامل) است. و برای کسی که پایین‌تر از انسان کامل است، مرکبی غیر از فلک قرار داد، از چهارپایان و اسبان و استران و خران (الْخَيْلَ والْبِغالَ والْحَمِيرَ)، تا انسان بر پشت این مرکب‌ها مستوی شود. و انسان کامل در سوار شدن بر آن‌ها با آنان شریک شد. پس کامل از مردم بر هر مرکوبی مستوی می‌شود، و غیر کامل بر فلک مستوی نمی‌شود، مگر به حکم تبعیت، نه به عین خود. همان‌گونه که در مورد یقین آمده است، هنگامی که پیامبر (صلی الله علیه و سلم) درباره عیسی (علیه السلام) فرمود: «اگر یقینش بیشتر می‌شد، در هوا راه می‌رفت.» (لو ازداد يقينا لمشى في الهواء)\n\nاین اشاره به سیر اوست. و معلوم است که یقین عیسی (علیه السلام) از ما بیشتر است، نه از پیامبر (صلی الله علیه و سلم). و ما به حکم تبعیت از کسی که امت او هستیم (صلی الله علیه و سلم)، در هوا راه می‌رویم، نه به این دلیل که یقین ما از عیسی (علیه السلام) بیشتر است. همان‌گونه که امت عیسی (علیه السلام) بر آب راه رفتند، همان‌گونه که او (علیه السلام) بر آب راه رفت. اما می‌دانیم، اگرچه امر در این باره در حق ما به حکم تبعیت است، که همه امت در هوا راه نرفتند، همان‌گونه که محمد (صلی الله علیه و سلم) راه رفت، زیرا برخی از امت او در هر آنچه امر به تبعیت شده بود، تابع او نبودند. پس هر کس حق تبعیت او را به جا آورد، حکم او را دارد، همان‌گونه که فرمود: من و هر کس که از من پیروی کند، با بصیرت به سوی خدا دعوت می‌کنیم (أَدْعُوا إِلَى الله عَلى‏ بَصِيرَةٍ أَنَا ومن اتَّبَعَنِي). و راه رفتن در هوا در شرف کجا، در مقایسه با کسی که حق (الحق) گوش و چشم او باشد، در مداومت بر نوافل خیراتی که نتیجه‌بخش است، یا آن مداومت بر آن‌ها، محبت خدا را نسبت به او نتیجه می‌دهد، و آن محبت برای او نتیجه داده است که حق گوش و چشم او باشد. پس این معنای قول ماست که «به حکم تبعیت از آنچه امر و نهی شده است»، نه فقط به دلیل اینکه ما امت او هستیم، بلکه از مجموع آن، و آن تبعیت خاص است، زیرا او پیامبری معین و خاص است نه غیر او. پس تبعیت از شریعت او با عمل، احوالی را که بر رسول آن شریعت بوده است، به ارث می‌گذارد. و این عنایتی از جانب خداوند متعال است، زیرا امت هر پیامبری طاقت حال پیامبر خود را ندارند، زیرا اگر طاقت داشتند، مانند او می‌شدند و در امر بدون او مستقل می‌شدند، و امر چنین نیست. زیرا اگر او هر جا که اوج گرفت، باز هم تابع خواهد بود. و پیامبر (صلی الله علیه و سلم) از مثل این امر بیان فرمود و گفت: «هر کس سنت حسنه‌ای را بنا نهد، پاداش آن و پاداش هر کس که به آن عمل کند، برای اوست.» (من سن سنة حسنة فله أجرها وأجر من عمل بها)\n\nپس برای او افزونی بر آنان است به سبب پاداش خاص او که بر پاداش عمل‌کنندگان به آن افزون است، و آنان آن پاداش خاص او را ندارند. پس هرگز در آن مقام به او نمی‌رسند. پس آنان در دنیا و آخرت و کشف (الکشف)، تابع او هستند. و سنت‌ها از رسولان (علیهم السلام) ظاهر شده است، پس امت‌هایشان همیشه تابع آنان خواهند بود.\n\n### [اینکه خداوند متعال مطلق الوجود (مطلق هستی) است و تقییدی که مانع از تقیید باشد، برای او نیست]\n\nو بدان که چون خداوند متعال مطلق الوجود (مطلق الوجود) بود و تقییدی که مانع از تقیید باشد، برای او نبود، بلکه همه تقییدات از آن اوست، پس او مطلق التقیید است و هیچ تقییدی بر او حکم نمی‌کند نه تقیید دیگر. پس معنای نسبت اطلاق به او را بفهم. و کسی که وجودش به این نسبت باشد، برای او اطلاق نسبت‌هاست. پس هیچ نسبتی به او اولی‌تر از نسبت دیگر نیست. پس کسی که کفر ورزید، جز با تخصیص نسبت‌ها کفر نورزید، مانند قول یهود و نصاری درباره خودشان، نه دیگر اهل ادیان و فرقه‌ها: ما فرزندان خدا و دوستان او هستیم (نَحْنُ أَبْناءُ الله وأَحِبَّاؤُهُ). پس چون خود را به او نسبت دادند، نسبت را عمومیت می‌دادند، اگرچه در نفس الامر خطا بود. پس خداوند به آنان فرمود: پس چرا شما را به سبب گناهانتان عذاب می‌دهد؟ بلکه شما بشری از کسانی هستید که آفریده است (فَلِمَ يُعَذِّبُكُمْ بِذُنُوبِكُمْ بَلْ أَنْتُمْ بَشَرٌ مِمَّنْ خَلَقَ). یعنی تعالی می‌گوید: نسبت یکی است، پس چرا خودتان را به آن اختصاص دادید نه این‌ها را؟ و اگرچه در نفس الامر خطا کردید، خطای شما از عموم نسبت کمتر از خطای شما از خصوص آن است، زیرا آن حکم راندن بر خدا بدون برهان است.\n\nو اما طایفه دیگری، برای خدا آنچه را که ناخوش می‌داشتند، قرار دادند. پس گفتند: فرشتگان دختران خدا هستند. پس بر او حکم کردند که آیا دختران را بر پسران برگزیده است؟ (أَصْطَفَى الْبَناتِ عَلَى الْبَنِينَ). پس حکم انکار بر حکم آنان متوجه شد، با وجود اینکه آن را برای خود ناخوش می‌داشتند، در حالی که درباره شریکان می‌گفتند: ما آن‌ها را نمی‌پرستیم مگر برای اینکه ما را به خدا نزدیک کنند (ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏)، با وجود اینکه جزئی از بندگان را برای خدا قرار دادند. پس اگر همه را به او اضافه می‌کردند، آن از کفر ظاهر نبود، بلکه حکم در آن به حکم آنچه نسبت دادند، می‌بود. پس اگر نسبت عام برای خلق به عنوان بندگان واقع می‌شد، سعادتمند می‌شدند. و اگر به نبوت واقع می‌شد، مورد مطالبه قرار می‌گرفتند به آنچه قصد کرده بودند. پس اگر آن را به خبر الهی مستند می‌کردند، سالم می‌ماندند، بلکه سعادتمند می‌شدند، مانند قولش: اگر خدا می‌خواست فرزندی برگزیند، برمی‌گزید (لَوْ أَرادَ الله أَنْ يَتَّخِذَ وَلَداً لَاصْطَفى‏). پس تبنی (فرزندخواندگی) را جایز شمرد، بلکه در آن بویی از این است که جبرئیل برای مریم به صورت بشری معتدل (بَشَراً سَوِيًّا) متمثل شد. و حق تعالی خود را به تحول در صور وصف کرده است و احکام آن‌ها را بر خود جاری ساخته است. و این علمی است که به خاطر ایمان به آن اشاره می‌شود و در عموم فاش نمی‌شود، به دلیل آنچه از آن به نفوس سبقت می‌گیرد. و تعلق اصطفا به کسی که به او تعلق می‌گیرد، باقی ماند. آیا به صاحبه (همسر) است؟ پس از باب تجلی (التجلي) در صور است، پس عین دو صورت است، زیرا فرمود: اگر می‌خواستیم سرگرمی (یعنی فرزند) برگزینیم، آن را از نزد خود برمی‌گزیدیم (لَوْ أَرَدْنا أَنْ نَتَّخِذَ لَهْواً لَاتَّخَذْناهُ من لَدُنَّا). و برای او ظهوری نیست مگر از صاحبه که مادر است. پس اصطفا در حق صاحبه است و او از نزد اوست. پس از خود خارج نشده است، همان‌گونه که آدم (علیه السلام) در صاحبه‌اش از خود خارج نشد. پس جز با کسی که جزئی از اوست، ازدواج نکرد. و با او و با مجموع، خود او می‌شود. پس این قول اوست: از نزد ما (من لَدُنَّا). و با حرف «لو» آمده است، پس بر امتناع دلالت کرد. پس از دو وجه نبود. اگر اصطفا برای بنوت (فرزندی) باشد، آن تبنی است نه بنوت. و اگر به غیر خبر الهی استناد کنند، و منظورم از خبر الهی، آنچه بر زبان رسولان در کتب یا در وحی آمده است، می‌باشد. پس اگر استنادشان به کشف (الکشف) الهی و اطلاع در آن باشد، تحت حکم آنچه مطلع شده‌اند، هستند. و برای مقلده در این باره عذری نیست، زیرا در آن‌ها اهلیت برای اطلاع به حکم نشأت وجود دارد، زیرا نشأت استعدادی عام دارد، و آن استعداد برای اطلاع است، اگرچه اطلاع‌ها متفاوت باشد، و آن به دلیل استعداد خاص دیگری غیر از استعداد عام است. پس اهل جبر اگر به خبر تمسک جویند، سعادتمند می‌شوند، و اگر در تأویل خطا کنند و به علم نرسند، پاداش اجتهاد دارند، و اگر به صواب رسند، مقصود حاصل شده است. پس برخی از آنان با رسیدن به صواب، بر بینه‌ای از پروردگارشان هستند (عَلى‏ بَيِّنَةٍ من رَبِّهِ)، و برخی از پروردگارشان بر بینه نیستند، در حالی که در نفس الامر به صواب رسیده‌اند. و هر کس که تمسک الهی داشته باشد، نجات یافته است. و اما کسی که به همه کفر ورزیده است، آن نهایت کوری است.\n\n(وصل) در تحضیض (ترغیب) کونی\n\nو آن سرّی است که خداوند در بندگان عام و سالکان این راه قرار داده است. و اما خاصه، هرگز از آنان واقع نمی‌شود، زیرا آن نعت الهی نیست، جز اینکه از جانب خدا در آنچه به کَون بازمی‌گردد، آمده است، نه در آنچه به او سبحانه بازمی‌گردد، مانند قولش: چرا چهار شاهد بر آن نیاوردند؟ (لَوْ لا جاؤُ عَلَيْهِ بِأَرْبَعَةِ شُهَداءَ). و اما ادات «لو» الهی است و متضمن معنای تحضیض است و خاصان خدا به آن متصف شده‌اند.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «اگر آنچه را که پشت سر گذاشتم، پیش رو داشتم، قربانی را نمی‌بردم و آن را عمره قرار می‌دادم، اما من قربانی را برده‌ام، پس حرام‌هایم حلال نمی‌شود تا قربانی به محلش برسد.» (لو استقبلت من أمري ما استدبرت ما سقت الهدى ولجعلتها عمرة ولكني سقت الهدى فلا يحل مني حرام حَتَّى يَبْلُغَ الْهَدْيُ مَحِلَّهُ‏)\n\nپس بوی تحضیض در «لو» همان چیزی است که از آن فهمیده می‌شود، گویی به خود گفته است: چرا با عمره احرام نبستم؟ و تحضیض هرگز از خواص واقع نمی‌شود، مگر در آنچه نفوس خود را به آن مشغول کرده‌اند از افعالی که خدا را خشنود می‌سازد، پس در زمان دوم برایشان آشکار می‌شود که رضایت خدا در انجام کاری است که کامل‌تر و والاتر از اولی است، یا در جانب خدا، یا در حق خود، یا در حق دیگری به جهت رفق و شفقت بر آنان. هرگز از آنان بر وجه اعتراض بر خدا واقع نمی‌شود که بگویند: چرا خدا فلان کار را به جای فلان کار انجام نداد؟ این هرگز از خواص متصور نیست، زیرا آن سوء ادب با خداوند متعال و ترجیح تدبیر کونی بر تدبیر الهی است. و حق (الحق) خود را به اینکه امر را تدبیر می‌کند (يُدَبِّرُ الْأَمْرَ) وصف نکرده است، مگر برای اینکه به ما بشناساند که هیچ کاری را انجام نداده است، مگر آنچه حکمت هستی (الوجود) اقتضا می‌کند، و اینکه آن را در موضعی نازل کرده است که اگر در آن نازل نمی‌کرد، حق حکمت را ادا نمی‌کرد. و او کسی است که آفرینش هر چیزی را به آن عطا کرد (الَّذِي أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ). و به همین دلیل ممکن نیست که برای بندگانش در صفت تحضیض، با نظر به او، ظاهر شود. پس آن را در زبان، بلکه در همه زبان‌ها، برای ابتلا و آزمایش بندگانش قرار داد تا اهل عنایت از آن اجتناب کنند و بدین وسیله از دیگران متمایز شوند.\n\n### [اینکه سعادت غیر از کمال صورت است]\n\nو بدان که اختصاص الهی که سعادت می‌بخشد، غیر از اختصاص الهی است که کمال صورت می‌بخشد. و گاهی این دو اختصاص در حق برخی اشخاص جمع می‌شوند. پس اختصاصی که سعادت می‌بخشد، اختصاص به ایمان و عصمت از مخالفت، یا مرگ پس از توبه است. و اختصاصی که کمال صورت می‌بخشد، آن است که جز نفوذ اقتدار و حکم راندن در عالم با همت و حس نمی‌دهد. و کامل کسی است که هر دو اختصاص به او روزی شود. و قوی‌ترین تأثیر، تأثیر کسی است که خدا را به خشم می‌آورد، مانند قوم فرعون، که خداوند متعال درباره آنان فرمود: پس چون ما را به خشم آوردند، از ایشان انتقام گرفتیم (فَلَمَّا آسَفُونا انْتَقَمْنا مِنْهُمْ). یعنی ما را به خشم آوردند. و برای خداوند سبحانه نفوذ اقتدار است، پس از آنان انتقام گرفت تا آنان را عبرتی برای دیگران قرار دهد. و این را در مقابل نفوذ اقتدار کونی قرار داد، زیرا فرمود: ما را به خشم آوردند (آسَفُونا). آیا به علم فرعون در قولش نمی‌نگری: پس چرا دستبندهایی از طلا بر او افکنده نشده است؟ (فَلَوْ لا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ من ذَهَبٍ). می‌گوید: «فلو لا» که حرف تحضیض است، یعنی چرا به موسی نفوذ اقتدار در ما داده نشده است تا با او نزاع نکنیم و سخنش را بشنویم و اطاعت کنیم، زیرا دو دست محل قدرت است و دستبند (الأسورة) که شکلی محیط از طلاست، کامل‌ترین چیزی است که با آن از معادن زینت داده می‌شود. و نفوذ اقتدار از اختصاص الهی است. به قومش می‌گوید: پس این (نفوذ اقتدار) به موسی داده نشده است تا من از روی امر ضروری که نتوانیم آن را دفع کنیم، به قول او از جانب خودم بازگردم و شما به دلیل بازگشت من به قول او بازگردید. و یا کسی همراه او نیامده است که با اقتدارشان قاطع باشند: یا فرشتگان همراه او نیامده‌اند؟ (أَوْ جاءَ مَعَهُ الْمَلائِكَةُ مُقْتَرِنِينَ). زیرا می‌دانست که قومش می‌دانند اگر فرشتگان می‌آمدند، خواه ناخواه تسلیم موسی می‌شدند. فرعون می‌گوید: پس موسی (علیه السلام) نفوذ اقتداری در من نداشت تا به قول او بازگردم، و کسی هم همراه او نیامد که با اقتدارشان قاطع باشند. پس قوم خود را سبک‌مغز یافت (فَاسْتَخَفَّ قَوْمَهُ)، یعنی معنای آنان را با نظر به آنچه به آن‌ها گفت، لطیف ساخت. پس چون این حالت را در آنان قرار داد، آنان را واداشت تا در آن دقیق شوند، و این حالت را پیش از آن نداشتند. پس ظاهراً با قهر ظاهر از او اطاعت کردند، زیرا او در محلی بود که از او می‌ترسیدند و به او امید داشتند، و باطناً به آنچه در آن نظر کردند از آنچه به آنان گفت. پس چون قلب‌هایشان را به طور کلی به سوی خود گرفت و نصیبی برای خدا در آنان باقی نماند که آنان را حفظ کند، خدا را به خشم آوردند. پس خشمگین شد و انتقام گرفت. پس حکم آنان در نفس الامر خلاف حکم فرعون در نفس خود بود، زیرا او صدق موسی (علیه السلام) را می‌دانست و حکم خدا را در ظاهرش به آنچه از او صادر شد، می‌دانست، و حکم خدا را در باطنش به آنچه از صدق موسی در دعوتشان اعتقاد داشت، می‌دانست. و ظهور ایمان مقرر در باطنش نزد خدا، مخصوص به زمانی معین بود که جز در آن واقع نمی‌شد و به حالتی خاص. پس با آمدن زمان و حالش، ایمانش ظاهر شد. پس قومش به عنوان آیه غرق شدند، و فرعون با بدنش بدون قومش هنگام ظهور ایمانش به عنوان آیه نجات یافت. و از رحمت خدا بر بندگانش این است که فرمود: امروز تو را با بدنت نجات می‌دهیم (فَالْيَوْمَ نُنَجِّيكَ بِبَدَنِكَ)، یعنی بدون قوم تو، تا برای کسانی که پس از تو می‌آیند، نشانه‌ای باشی (لِتَكُونَ لِمَنْ خَلْفَكَ آيَةً)، یعنی علامتی برای کسی که به خدا ایمان آورد، که خداوند او را با بدنش نجات می‌دهد، یعنی با ظاهرش، زیرا باطنش همیشه از شرک محفوظ بود، چون علم قوی‌ترین موانع است. پس خداوند در غرق شدن بین آنان مساوات قرار داد و در حکم متفاوت شدند. پس آنان را سلف و مثلی برای دیگران قرار داد، یعنی امت‌هایی که پس از آنان می‌آیند، و فرعون را به این اختصاص داد که نجاتش نشانه‌ای باشد برای کسی که با نجات به سوی خدا بازگردد.\n\nو چون اختصاص الهی کامل در جمع بین سعادت و صورت بود، کمال برای مؤمن به خلافت در مکانی است که شأنش این است که کمال صورت در آن ظاهر شود، از نفوذ اقتدار هنگام به خشم آوردن. و بهشت محل این صفت نیست، پس دار خلافت نیست، بلکه دار ولایت است که بر صاحب آن ولایت به امری حکم شده است که از آن تجاوز نمی‌کند، و نشأت او نمی‌پذیرد که غیر آن را قبول کند، حتی اگر در آن به تقدیر، چیزی باشد که شأنش به خشم آوردن باشد، صاحب ولایت صفت خشم را نمی‌پذیرد، زیرا او بر مزاج خاصی است، برخلاف نشأت دنیا. و به همین دلیل فرمود: من در زمین جانشینی قرار می‌دهم (إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً)، و نگفت در عالم. و اگر فرشتگان اعتراض نمی‌کردند، به سجده مبتلا نمی‌شدند. پس آنچه به آن مبتلا شدند، از به خشم آوردن دقیق و پنهانی بود که جز راسخان در علم آن را درک نمی‌کنند. و همچنین هر انتقام الهی که بر عالم واقع می‌شود، جز پس از به خشم آوردن نیست، زیرا خداوند عالم را با رحمت آفریده است و شأن رحمت انتقام نیست، همان‌گونه که شأن غضب انتقام است، اما غضب بر طبقاتی است، پس انتقام بر میزان آن ظاهر می‌شود، بدون افزایش و کاهش. و انتقام هرگز واقع نمی‌شود، مگر برای تطهیر کسی که به خشم آوردن از او بوده است. به همین دلیل انتقام تا بی‌نهایت نیست، بلکه حکم آن تا اجلی معین نزد خدا پایان می‌یابد و رحمت به دنبال آن می‌آید، زیرا رحمت حکم ابدی دارد که پایان نمی‌پذیرد. و هر کس به آنچه ذکر کردیم توجه کند و در آن دقیق شود، علم بزرگ الهی را از جریان عدل در حکم الهی و شمول فضل و سبقت رحمت بر غضب می‌بیند، و اینکه حق (الحق) در حکم خود بر اساس آنچه حقایق بر آن هستند، جاری می‌شود، زیرا حقایق برای خودشان تبدیل نمی‌شوند و متحول نمی‌گردند. پس این آنچه در این مسئله ذکر کردیم، از آیاتی است که حق (الحق) بر زبان مترجم برای قومی که تفکر می‌کنند (لِقَوْمٍ يَتَفَكَّرُونَ) و برای قومی که تعقل می‌کنند (لِقَوْمٍ يَعْقِلُونَ) آورده است، و برای غیر این صنف نیست. پس بر تحصیل معرفت به خشم آوردن با نهایت استقصا محافظت کن تا از آن اجتناب کنی، زیرا آن از علم اسرار است که هر کسی آن را نمی‌شناسد. و آن علم حذیفة بن یمان، صحابی رسول خدا (صلی الله علیه و سلم) بود. و به همین دلیل اصحاب رسول خدا (صلی الله علیه و سلم) او را صاحب سرّ می‌نامیدند، به دلیل علمش به این دانش. و در میان علومی که خداوند به اولیای خود در حق آنان می‌بخشد، نافع‌تر از این علم نیست. و من کسی را ندیده‌ام که در آن ذوقی داشته باشد و از هیچ یک از اهل الله پس از حذیفه نشنیده‌ام که حکم این علم بر او ظاهر شده باشد. و آن عصمت پنهانی است که صاحبش تقریباً آن را درک نمی‌کند. و در کشف (الکشف) کامل‌تر از آن نیست. و خداوند این علم را جز به ادیبان اهل مراقبه روزی نمی‌دهد، زیرا آنان اشیا را به حکم مطابقت و مناسبت بین ربّ و مربوب و خالق و مخلوق می‌گیرند. و حاکم امکان و جواز بر آنان حکم نمی‌کند، زیرا امکان در این حضرت قدم و عینی ندارد. و این مقامی فراتر از طور عقل است، زیرا عقل در مثل این امر به امکان حکم می‌کند، در حالی که امر در نفس خود چنین نیست، اما اگر آن را مشاهده کند، می‌پذیرد و اگر در آن فکر کند، آن را تحت امکان وارد می‌کند.\n\nو این منزل از علوم به علم ایهام و ابهام و رموز و معماها و اسرار اختصاص دارد. و در آن علم حروف مرکبه که همان کلمه است، وجود دارد. و در آن علم انوار و آنچه عالم شهادت (الشهود) به آن اختصاص دارد از شهود (الشهود) وجود دارد. و در آن علم جعل (الجعل) وجود دارد. و در آن علم جمع و تفصیل وجود دارد. و در آن علم منازل علو در اسماء الهی و احکام آن‌ها وجود دارد. و در آن علم اعجاز وجود دارد. و در آن علم تقریر وجود دارد. و در آن علم نتایج جهل وجود دارد، و آن امری عدمی است، پس چگونه برای آن حکم وجودی است؟ و در آن علم مقابله اقتدار با اقتدار وجود دارد. و در آن علم جریان هستی (الوجود) حق (الحق) در عالم وجود دارد، و به همین دلیل هیچ کس آن را انکار نکرده است، بلکه اشتباه از طلب ماهیت واقع شده است که منجر به اختلافی در آن شده است که در عالم ظاهر گشته است. و در آن علم آنچه حق تعالی برای خود اختصاص داده است، بدون اینکه برای آن در عالم حکمی باشد، وجود دارد. و در آن علم همه شرایع وجود دارد و اینکه آن‌ها به جعل (الجعل) هستند، و به همین دلیل تا مدتی جاری می‌شوند و غایت آن‌ها حکم حق به آن‌ها در قیامت در دو گروه است. پس چون دو سرا آباد شوند و مدت عقوبت سپری شود، حکم رحمت منتشر می‌شود. و در آن علم شفع و وتر و تقدم علم زوج بر فرد وجود دارد. و علم حامل و محمول وجود دارد. و علم شمول نعمت‌ها در بلاها و مصیبت‌ها و امور دردناک وجود دارد. و در آن علم نفی طاقت کونی و بازگرداندن آن به خدا وجود دارد. و در آن علم تقسیم عالم بین خدا و عالم و اینکه چه چیزی عالم برای خدا و چه چیزی عالم برای عالم است، و صفت کسی که این را می‌داند از کسی که نمی‌داند، و آیا بر عالم به آن واجب است که آن را بپوشاند یا پوشاندن آن به ذاتش داده می‌شود، وجود دارد. و علم محاکمات و تفاوت مردم در آن‌ها وجود دارد. و علم مطالبات الهی که چه زمانی و به چه چیزی منجر می‌شود، وجود دارد. و علم سببی که همه خلق را به مشیت الهی بازمی‌گرداند، و آیا آن بازگشت از علم است یا بازگشت از قهر، وجود دارد. و علم فرق بین علم تقلید و علم نظر و اینکه آیا آنچه مقلد بر آن بسته می‌شود، در حق او علم است یا نه، وجود دارد. و علم حکم سابقه بر عالم به نقیض آنچه علمشان می‌دهد، وجود دارد. و علم عواقب به طور مطلق و اینکه آیا اثر آن در حال برای عالم به آن عمومیت دارد یا نه، وجود دارد. و علم فترات و حکم صاحبان آن‌ها وجود دارد. و علم اشراف و اینکه چیست و آیا در عالم شریف و اشرف وجود دارد یا نه، وجود دارد. و علم مفاضله در عالم و اینکه اگر مفاضله واقع شود، بلکه واقع شده است، آیا ناظر در آن به تساوی می‌رسد، به طوری که هر مفضولی بر کسی که بر او فضیلت داده شده، فضیلت یابد؟ و این مذهب جماعتی از جمله ابوالقاسم بن قسی، صاحب خلع النعلین است. و در آن علم حکمت به آنچه خداوند از اختلاف در عالم قرار داده است، وجود دارد. و در آن علم سببی که به خاطر آن شیطان ملازم انسان شد و قول پیامبر (صلی الله علیه و سلم) که خداوند او را بر آن یاری کرد و او مسلمان شد، وجود دارد.\n\nو در آن علم حکم کسی که باطل بر حق بر او مشتبه شده است، وجود دارد. و در آن علم کشف (الکشف) وجود دارد، زیرا هیچ مخلوقی بر چیزی اقتدار ندارد و همه چیز در دست خداست. و آن علم حیرت به دلیل تکلیف و وقوع آن بر کسی است که چیزی از امر در دست او نیست. و در آن علم اثر اسباب الهی در مسببات وجود دارد، که آیا ذاتی است یا جعل الهی (الجعل الإلهي). و در آن علم اغتباط به آنچه تجلی الهی (التجلي الإلهي) می‌دهد و اعتصام به آن وجود دارد. و در آن علم توحید نبوی وجود دارد. و در آن علم حجاب‌هایی که مانع از حکم علم در عالم می‌شوند، با وجود علم آن نزد او، وجود دارد. و در آن علم قبول بازگشت به سوی خدا هنگام دیدن سختی و فرارسیدن عذاب وجود دارد، و اینکه آن برای آنان در آخرت نافع است، اگرچه عذاب در دنیا از آنان برداشته نشود. و قوم یونس جز به برداشته شدن عذاب از آنان در زندگی دنیا هنگام بازگشتشان اختصاص نیافتند. پس معنای قولش: پس ایمانشان هنگامی که عذاب ما را دیدند، برایشان سودی نداشت (فَلَمْ يَكُ يَنْفَعُهُمْ إِيمانُهُمْ لَمَّا رَأَوْا بَأْسَنا)، یعنی در دنیا. زیرا خداوند می‌فرماید: و آن‌ها را به عذاب گرفتار کردیم، شاید بازگردند (وأَخَذْناهُمْ بِالْعَذابِ لَعَلَّهُمْ يَرْجِعُونَ). پس بازگشت‌کننده با نزول عذاب بر او، بازگشتش مقبول است، زیرا آنچه از او امید می‌رفت را با قولش: شاید بازگردند (لَعَلَّهُمْ يَرْجِعُونَ)، آورده است. و در آن علم اسرار حق (الحق) در عالم و ظهور عالم به صورت حق و منزلت آن وجود دارد. و در آن علم عموم ولایت در هر نوع و آنچه از آن سپری می‌شود و آنچه سپری نمی‌شود، وجود دارد. و در آن علم اضافات الهی وجود دارد، که آیا بر طریق تشریف است یا بر طریق ابتلا، یا برخی از آن‌ها تشریف و برخی ابتلا هستند. و در آن علم مرتبه کسی که بین ظاهر و باطن جمع کرده است، از کسی که جمع نکرده است، وجود دارد. و در آن علم حکمت استناد به واسطه‌ها وجود دارد، که آیا بر طریق ابتلا است یا مقصود از آن تشریف واسطه‌هاست. و در آن علم اقامه حجت الهی بر منازعان و حکم کسی که منازعه نکرده و به حق برای اهلش اعتراف کرده است، وجود دارد. و در آن علم احاطه الهی به ذات وجود دارد. و در آن علم زیادات وجود دارد، که آیا به این است که آنچه نزد زید است یا بخشی از آن گرفته شود و به عمرو داده شود، یا زیادات به ایجاد معدوم است، یا برخی از آن‌ها ایجاد معدوم و برخی از انتقال از شخصی به شخص دیگر است. و در آن علم آنچه خدا به خود اختصاص داده است از علوم و علم آنچه کَون به خود اختصاص داده است از علومی که در عقل جایز نیست که آن حکم خدا باشد، و آیا حکم او در شرع همان‌گونه است که حکم او در عقل است یا نه، وجود دارد. و آن علم ذوق‌ها با حواس است. و در آن علم مراتب شفیعان و علم صفت آنان که با آن مالک شفاعت می‌شوند، وجود دارد. پس این برخی از علوم این منزل است. و خداوند حق را می‌گوید و او راه را هدایت می‌کند (الله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ). سفر بیست و دوم به پایان رسید.\n\n(بسم الله الرحمن الرحیم)"
  },
  "page_count": 6
}