{
  "id": 436,
  "title": {
    "ar": "الباب السادس والثلاثون وأربعمائة في معرفة منازلة لو كنت عند الناس كما أنت عندي ما عبدوني",
    "en": "Chapter Four Hundred and Thirty-Six: Regarding the Gnosis of His Station (منازلة): \"If you were to the people as you are to Me, they would not have worshipped Me.\"",
    "ur": "باب چار سو چھتیس: اس منازل (منازلة) کی معرفت میں کہ اگر تم لوگوں کے نزدیک ایسے ہوتے جیسے تم میرے نزدیک ہو، تو وہ میری عبادت نہ کرتے۔",
    "fa": "باب چهارصد و سی و ششم در معرفت منزلتی که اگر نزد مردم چنان بودی که نزد من هستی، مرا نمی‌پرستیدند."
  },
  "content": {
    "ar": "## «الباب السادس والثلاثون وأربعمائة في معرفة منازلة لو كنت عند الناس كما أنت عندي ما عبدوني»\n\n\n> لو أن جنسك والأكوان أجمعها *** يدرون منك الذي أدريه ما عبدوا\n\n\n> سواك إذ كنت مشهودا لهم وأنا *** غيب ولو لا وجود الغيب ما جحدوا\n\n\n> إني حجبتك عن قوم بصورتك الدنيا *** ولو علموا القصوى لما عبدوا\n\n\n> أو أنهم علموا الأسماء ما وقفوا *** مع المثال ولم يصرفهم الجسد\n\n\n> ولا تغير أحوال تقوم بهم *** ولا تراكب أضداد ولا عدد\n\n\n> وكل ذلك مخصوص بصورتنا *** وليس ينكره في ذاتنا أحد\n\n\n> لكنهم غلطوا فينا وقام بهم *** لمثلهم حين لم أعصمهمو حسد\n\n\n### [اختلاف الخلفاء على حسب مراتبهم‏]\n\n\nقال الله عز وجل وما أَرْسَلْناكَ إِلَّا رَحْمَةً لِلْعالَمِينَ وقال إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً وقال لبعض خلفائه ولا تَتَّبِعِ الْهَوى‏ ومن‏\nهنا تعرف مراتب الناس من الخلفاء وأن الخلفاء يفضل بعضهم بعضا وقال رسول الله صَلَّى اللهُ عَليهِ وسَلَّم إن الله خلق آدم على صورته وما خلقه حتى استوى على العرش وما استوى على العرش إلا الرحمن‏\n\n\nولما عمت رحمة الله أبا يزيد البسطامي ولم ير للكون فيها أثرا يزيل عنها حكم العموم قال للحق لو علم الناس منك ما أعلم ما عبدوك وقال له الحق تعالى يا أبا يزيد لو علم الناس منك ما أعلم لرجموك‏\n\n\n### [لا بد للخليفة أن يكسو صفة الله ونعته‏]\n\n\nفاعلم أن الذي يريد أن يستنيب في عباده من يقوم فيهم مقامه لا بد أن يكسوه صفته ونعته فيكون الخليفة هو الظاهر والذي استخلفه الباطن فيكون كسور الأعراف باطنه فيه الرحمة لأنه الحق الذي غلبت رحمته غضبه وظاهره من قبله العذاب فما العذاب في ظاهره وإنما العذاب قبله فيراه قبلا ممن استخلف عليهم وقد حد الحق حدودا له يعاملهم بها ليكون إذا قام بها عند المؤمن بها وبه محمودا لا يتطرق إليه ذم كما لا يتطرق لمن استخلفه ف من يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله فلا يذمه إلا من لا يعرفه ولا يعرف الله فالراحم منا من له رحمتان رحمة طبيعية وهي ذاتية له اقتضاها مزاجه ورحمة موضوعة فيه من الله بخلقه على الصورة وهذه الرحمة تتضمن مائة رحمة التي لله فإن لله مائة رحمة بعدد أسمائه فإن له تعالى تسعة وتسعين اسما ظاهرة وأخفى المائة للوترية فإنه يحب الوتر لأنه وتر فلكل اسم رحمة وإن كان من أسمائه المنتقم ففي انتقامه رحمة سأذكرها في باب الأسماء الإلهية من هذا الكتاب إن شاء الله فللرحيم من العباد مائة رحمة ورحمة من أجل الوترية فإنه يحب الوتر لأنه يحب الله ودرجات الجنة مائة درجة لكل درجة رحمة وللنار مائة درك في كل درك رحمة مبطونة تظهر لمن هو في ذلك الدرك بعد حين فإن الغضب مغلوب وبالرحمة مسبوق فما يظهر في محل إلا والرحمة قد سبقته إلى ذلك المحل فيغالبها فتغلبه لأن الدفع أهون من الرفع فلا حكم للغضب في المغضوب عليه إلا زمان المغالبة خاصة فإن هذا المحل هو ميدانهما فينال هذا المحل من المشقة فيما يطرأ بين الرحمة والغضب بقدر ما تدوم المحاربة بينهما إلى وقت غلبة الرحمة وبالرحمة الطبيعية تقع الشفاعة من الشافعين لا بالرحمة الموضوعة فإن الرحمة الإلهية الموضوعة يصحبها في العبد العزة والسلطان فهي لا عن شفقة والرحمة الطبيعية عنها تكون الشفقة ولو لم تصحب الرحمة الإلهية العزة وتتنزه عن الشفقة ما عذب الله أحدا من خلقه أصلا فهذه الرحمة التي يجدها العبد على خلق الله هي حكم الرحمة الطبيعية لا الرحمة الموضوعة فإن الرحمة الموضوعة لا تقوم إلا بالخلفاء أ لا ترى الإنسان إذا رأى الخليفة يعاقب ويظلم ويجور على الناس كيف يجد الشفقة على المظلومين المعاقبين ويقول ما عنده رحمة ولو قمت أنا مقامه لرحمتهم ولرفعت هذا الظلم عنهم فإذا ولي هذا القائل ذلك‏\n\n\nالمنصب حجبه الله عن الرحمة الطبيعية التي تورث الشفقة وجعل فيه الرحمة التي تصحبها العزة والسلطان فيرحم بالمشيئة لا بالشفقة ولا للحاجة لأنه العزيز الغني في نفسه فيظلم ويعاقب ربما أكثر من الآخر الذي كان يذمه على ذلك قبل حصوله في مقام الخلافة فإذا قيل له في ذلك يقول والله ما أدري إذا لم يكن عالما فإني لا أجد في نفسي إلا ما ترون والآن قام لي عذر الذي تقدمني فيما كان يفعله وكنت أجد عليه في ذلك وأخبرني صادق أن مثل هذا وقع من الإمام الناصر لدين الله رحمه الله أحمد بن الحسن مع أبيه المستضى‏ء بحضور الوزير وإنه عتب مع الوزير في حق أبيه فلما أفضت إليه الخلافة ظهر منه ما ظهر من أبيه مما أخذه عليه فنبهه الوزير على قوله فقال الحال الذي كنت أجده في ذلك الوقت ذهب عني وما أجد الساعة إلا ما ترى أثره والآن قام عندي عذر أبي رحمه الله فمضمون هذه المنازلة أن الله أنشأ المحمدي على ما أنشأ عليه محمدا صَلَّى اللهُ عَليهِ وسَلَّم فأنشأه بالمؤمنين رءوفا رحيما وأرسله رَحْمَةً لِلْعالَمِينَ حتى إن دعاءه على رعل وذكوان من الرحمة بهم لئلا يزيدوا طغيانا فيزدادوا من الله بعدا ومن رحمته‏\n\n\nقال لأزيدن على السبعين أو قال لو علمت إن الله يغفر لهم لزدت على السبعين إذ قيل له إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ الله لَهُمْ‏\n\n\nفلو عرف الناس من محمد صَلَّى اللهُ عَليهِ وسَلَّم ما علم الله منه بما جبله الله عليه ما عبد الله أحد بما كلفه بل كان الناس يتبعون أهواءهم بعلم لأن الله ما أخذ من اتبع هواه إلا لكونه اتبع هواه بغير علم فحرمان الجهل أوقع بهم قال تعالى بَلِ اتَّبَعَ الَّذِينَ ظَلَمُوا أَهْواءَهُمْ ومن أَضَلُّ مِمَّنِ اتَّبَعَ هَواهُ بغير علم وقوله تعالى لداود عليه السلام ولا تَتَّبِعِ الْهَوى‏ فَيُضِلَّكَ عَنْ سَبِيلِ الله ولم يقل عن الله وسبيل الله ما شرعه لدار القرار التي هي محل سعادتك وأما تمام الآية\nفهو من أعجب الإشارة الإلهية لأهل الفهم عن الله وهو قوله إِنَّ الَّذِينَ يَضِلُّونَ عَنْ سَبِيلِ الله لَهُمْ عَذابٌ شَدِيدٌ بِما نَسُوا يَوْمَ الْحِسابِ والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 436: Concerning the Knowledge of the Divine Address: \"If you were to the people as you are to Me, they would not worship Me.\"\n\nIf your kind, and all the universes combined,\nKnew of you what I know, they would not worship\nOther than You, since You were witnessed by them, while I\nAm the Unseen (الغيب); and were it not for the existence of the Unseen, they would not deny.\nIndeed, I veiled You from a people by Your worldly form,\nBut had they known the ultimate Reality (القصوى), they would not have worshipped [it].\nOr had they known the Names (الأسماء), they would not have paused\nWith the similitude (المثال), nor would the body (الجسد) have diverted them.\nNor would the changing states that arise within them [divert them],\nNor the compounding of opposites (أضداد) or numbers.\nAnd all of that is specific to Our form,\nAnd no one denies it in Our Essence (ذاتنا).\nBut they erred concerning Us, and there arose in them\nEnvy toward their like, when I did not protect them [from it].\n\n### [The Variation of Caliphs according to their Levels]\n\nAllah Almighty said: <<وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ>> (And We have not sent you except as a mercy to the worlds [Q 21:107]), and He said: <<إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً>> (Indeed, I am going to place upon the earth a vicegerent [Q 2:30]), and He said to some of His Caliphs: <<وَلَا تَتَّبِعِ الْهَوَى>> (And do not follow [vain] desire [Q 38:26]).\n\nFrom this, you understand the levels (المراتب) of people among the Caliphs (الخلفاء), and that some Caliphs are superior to others. The Messenger of Allah (PBUH) said: \"Indeed, Allah created Adam upon His form (صورته).\" And He did not create him until He had established Himself upon the Throne (العرش), and none established Himself upon the Throne except the All-Merciful (الرحمن).\n\nWhen the Mercy of Allah (رحمة الله) encompassed Abu Yazid al-Bistami, and he saw no trace of the cosmos (الكون) in it that would remove the ruling of universality (حكم العموم), he said to the Real (الحق): \"If people knew of You what I know, they would not worship You.\" The Real Almighty said to him: \"O Abu Yazid, if people knew of you what I know, they would stone you.\"\n\n### [The Caliph Must Be Clothed in the Attribute and Description of Allah]\n\nKnow that the one who desires to appoint a deputy (يستنيب) among His servants to stand in His place (مقامه) must clothe him in His Attribute (صفته) and His Description (نعته). Thus, the Caliph (الخليفة) is the Manifest (الظاهر), and the one who appointed him is the Hidden (الباطن).\n\nThe covering of the boundaries (كسور الأعراف) has its inward aspect (باطنه) as Mercy (الرحمة), because He is the Real (الحق) Whose Mercy overcomes His Wrath (غضبه). And its outward aspect (ظاهره) is the punishment that precedes Him. The punishment is not in His outward aspect, but rather the punishment precedes Him. The Caliph sees this punishment as preceding him from the One who appointed him over the people. The Real has set limits (حدودا) for him by which he deals with them, so that when he upholds them, he is praised by the believer in them and in Him, and no blame can reach him, just as no blame reaches the One who appointed him. For <<مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ>> (He who obeys the Messenger has obeyed Allah [Q 4:80]). Therefore, only one who does not know him, and does not know Allah, blames him.\n\nThe merciful person among us has two mercies: a natural mercy (رحمة طبيعية), which is intrinsic (ذاتية) to him, necessitated by his temperament (مزاجه); and a mercy placed within him (رحمة موضوعة فيه) by Allah, through his creation upon the [Divine] Form (على الصورة). This [second] mercy encompasses the hundred mercies that belong to Allah. Indeed, Allah has one hundred mercies, corresponding to the number of His Names (أسمائه). He has ninety-nine manifest Names, and He concealed the hundredth for the sake of the oddness (للوترية), for He loves the odd (الوتر) because He is the Odd. Every Name has a mercy, even if it is from His Names like the Avenger (المنتقم). In His vengeance, there is a mercy, which I shall mention in the chapter on the Divine Names (الأسماء الإلهية) in this book, if Allah wills. The merciful servant has one hundred mercies and one mercy, due to the oddness, for he loves the odd because he loves Allah. The degrees of Paradise (الجنة) are one hundred degrees, and for every degree there is a mercy. The levels of the Fire (النار) are one hundred levels, and in every level there is a hidden mercy (رحمة مبطونة) that will appear to the one in that level after a time.\n\nWrath (الغضب) is overcome and preceded by Mercy (الرحمة). It does not manifest in any place except that Mercy has already preceded it to that place, but [Wrath] struggles against it and is overcome by it, because repulsion is easier than elevation. Wrath has no dominion over the one upon whom wrath falls except during the time of the struggle (المغالبة) itself. This place is their battlefield (ميدانهما). This place suffers hardship from what arises between Mercy and Wrath, commensurate with the duration of the battle between them, until the time of Mercy's victory.\n\nIntercession (الشفاعة) by the intercessors occurs through the natural mercy (الرحمة الطبيعية), not the placed mercy (الرحمة الموضوعة). The placed Divine Mercy is accompanied in the servant by Might (العزة) and Sovereignty (السلطان); thus, it is not born of compassion (شفقة). Natural mercy is what gives rise to compassion. If the Divine Mercy were not accompanied by Might and were not purified of compassion, Allah would never punish any of His creation at all.\n\nThis mercy that the servant finds toward Allah's creation is the ruling of natural mercy, not the placed mercy. The placed mercy only resides in the Caliphs (الخلفاء). Do you not see that when a person sees the Caliph punishing, oppressing, and acting unjustly toward the people, he feels compassion (الشفقة) for the oppressed and punished, and says, \"He has no mercy! If I were in his place, I would have mercy on them and remove this injustice\"?\n\nWhen this speaker assumes that position (المنصب), Allah veils him from the natural mercy that generates compassion, and places within him the mercy accompanied by Might and Sovereignty. He shows mercy by Divine Will (بالمشيئة), not by compassion or need, because He is the Mighty (العزيز), the Self-Sufficient (الغني) in Himself. He may oppress and punish, perhaps more than the previous one whom he used to criticize for the same actions before attaining the station of Caliphate (مقام الخلافة). If he is questioned about this, he says—if he is not a Gnostic (عالما)—\"By Allah, I do not know! I find nothing in myself except what you see. And now, the excuse of the one who preceded me in what he used to do, and for which I used to criticize him, has become clear to me.\"\n\nA truthful person informed me that something similar happened with Imam al-Nasir li-Din Allah (Ahmad ibn al-Hasan, may Allah have mercy on him) and his father, al-Mustadi', in the presence of the Vizier. He criticized his father to the Vizier regarding a certain matter. When the Caliphate devolved upon him, he exhibited the same behavior that his father had shown, for which he had criticized him. The Vizier reminded him of his previous statement. He replied, \"The state (الحال) I felt at that time has left me, and now I find nothing except the effect you see. Now, the excuse of my father, may Allah have mercy on him, has become clear to me.\"\n\nThe essence of this intimate address (منازلة) is that Allah originated the Muhammadan (المحمدي) upon the same nature upon which He originated Muhammad (PBUH). Thus, He originated him as compassionate and merciful (رءوفا رحيما) toward the believers, and sent him as <<رَحْمَةً لِلْعَالَمِينَ>> (a mercy to the worlds). Even his prayer against the tribes of Ri'l and Dhakwan was out of mercy for them, lest they increase in transgression (طغيانا) and thus increase in distance from Allah. Out of his mercy, he said, \"I will increase beyond seventy,\" or he said, \"If I knew that Allah would forgive them, I would increase beyond seventy,\" when it was said to him: <<إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ>> (If you ask forgiveness for them seventy times, Allah will never forgive them [Q 9:80]).\n\nIf people had known of Muhammad (PBUH) what Allah knew of him, based on the nature upon which Allah molded him, no one would have worshipped Allah according to what He commanded them. Rather, people would have followed their desires (أهواءهم) with knowledge (بعلم). For Allah only punished those who followed their desires because they followed their desires *without knowledge* (بغير علم). The deprivation of ignorance (حرمان الجهل) is what afflicted them. Allah Almighty said: <<بَلِ اتَّبَعَ الَّذِينَ ظَلَمُوا أَهْوَاءَهُمْ>> (Rather, those who committed wrong followed their [vain] desires [Q 30:29]), and <<وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ عِلْمٍ>> (And who is more astray than one who follows his desire without knowledge? [Q 28:50]). And His saying to David (peace be upon him): <<وَلَا تَتَّبِعِ الْهَوَى فَيُضِلَّكَ عَنْ سَبِيلِ اللَّهِ>> (And do not follow [vain] desire, lest it lead you astray from the Path of Allah [Q 38:26]). He did not say \"from Allah,\" but \"from the Path of Allah\" (سبيل الله), which is what He legislated for the Abode of Permanence (دار القرار), which is the place of your felicity.\n\nAs for the completion of the verse, it contains the most wondrous Divine indication (الإشارة الإلهية) for those who understand from Allah. It is His saying: <<إِنَّ الَّذِينَ يَضِلُّونَ عَنْ سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ>> (Indeed, those who go astray from the Path of Allah will have a severe punishment because they forgot the Day of Reckoning [Q 38:26]). And <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Path [Q 33:4]).",
    "ur": "باب نمبر چار سو چھتیس: اس منازل کی معرفت میں کہ \"اگر تم لوگوں کے نزدیک ایسے ہوتے جیسے میرے نزدیک ہو تو وہ میری عبادت نہ کرتے۔\"\n\nاگر تیری جنس اور تمام کائناتیں *** وہ جان لیں جو میں تجھ سے جانتا ہوں تو وہ عبادت نہ کریں\nتیرے سوا کسی کی، جب کہ تو ان کے لیے مشہود (الشہود) ہے اور میں غیب ہوں *** اور اگر غیب (الغیب) کا وجود نہ ہوتا تو وہ انکار نہ کرتے\nمیں نے تجھے دنیاوی صورت میں قوم سے چھپا دیا *** اور اگر وہ انتہا کو جان لیتے تو وہ عبادت نہ کرتے\nیا اگر وہ اسماء (الأسماء) کو جان لیتے تو وہ مثال پر نہ ٹھہرتے *** اور نہ ہی جسم انہیں پھیرتا\nاور نہ ہی وہ احوال بدلتے جو ان کے ساتھ قائم ہیں *** اور نہ ہی اضداد کا اجتماع ہوتا اور نہ ہی عدد کا\nاور یہ سب ہماری صورت کے ساتھ مخصوص ہے *** اور ہماری ذات میں کوئی اس کا انکار نہیں کرتا\nلیکن انہوں نے ہم میں غلطی کی اور ان کے ساتھ حسد قائم ہوا *** ان کے جیسے کے لیے جب میں نے انہیں بچایا نہیں\n\n### [خلفاء کا ان کے مراتب کے مطابق اختلاف]\n\nاللہ عز وجل نے فرمایا: وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ (اور ہم نے آپ کو تمام جہانوں کے لیے رحمت بنا کر ہی بھیجا ہے) اور فرمایا: إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً (میں زمین میں ایک خلیفہ بنانے والا ہوں) اور اپنے بعض خلفاء سے فرمایا: وَلَا تَتَّبِعِ الْهَوَىٰ (اور خواہش نفس کی پیروی نہ کرنا)۔ اور یہیں سے تم خلفاء میں لوگوں کے مراتب کو پہچانتے ہو، اور یہ کہ خلفاء میں سے بعض بعض پر فضیلت رکھتے ہیں۔ اور رسول اللہ صَلَّى اللهُ عَليهِ وسَلَّم نے فرمایا: \"بے شک اللہ نے آدم کو اپنی صورت پر پیدا کیا، اور اسے اس وقت تک پیدا نہیں کیا جب تک کہ وہ عرش پر مستوی نہ ہو گیا، اور عرش پر مستوی نہیں ہوا مگر رحمن۔\"\n\nاور جب اللہ کی رحمت نے ابو یزید بسطامی کو عام کیا اور انہوں نے کائنات کے لیے اس میں کوئی ایسا اثر نہ دیکھا جو اس سے عمومیت کے حکم کو زائل کر دے، تو انہوں نے ذات حق (الحق) سے کہا: \"اگر لوگ آپ کے بارے میں وہ جانتے جو میں جانتا ہوں تو وہ آپ کی عبادت نہ کرتے۔\" اور ذات حق (الحق) نے ان سے فرمایا: \"اے ابو یزید! اگر لوگ تمہارے بارے میں وہ جانتے جو میں جانتا ہوں تو وہ تمہیں سنگسار کر دیتے۔\"\n\n### [خلیفہ کے لیے ضروری ہے کہ وہ اللہ کی صفت اور نعت کو اوڑھے]\n\nپس جان لو کہ جو شخص اپنے بندوں میں کسی کو اپنا نائب (خلیفہ) بنانا چاہتا ہے جو ان میں اس کی جگہ کھڑا ہو، تو ضروری ہے کہ وہ اسے اپنی صفت اور نعت سے آراستہ کرے۔ پس خلیفہ ظاہر ہوتا ہے اور جس نے اسے خلیفہ بنایا وہ باطن ہوتا ہے۔ چنانچہ اعراف (حدود) کا لباس اس کے باطن میں رحمت ہوتا ہے، کیونکہ وہ ذات حق (الحق) ہے جس کی رحمت اس کے غضب پر غالب ہے، اور اس کا ظاہر اس کی طرف سے عذاب ہوتا ہے۔ پس عذاب اس کے ظاہر میں نہیں ہے، بلکہ عذاب اس سے پہلے ہوتا ہے، چنانچہ وہ اسے ان لوگوں کی طرف سے پہلے دیکھتا ہے جن پر اسے خلیفہ بنایا گیا ہے۔ اور ذات حق (الحق) نے اس کے لیے کچھ حدود مقرر کیے ہیں جن کے ذریعے وہ ان سے معاملہ کرتا ہے، تاکہ جب وہ ان حدود پر قائم ہو تو مومن کے نزدیک اور اس کے ذریعے قابل تعریف ہو، اور اس پر کوئی مذمت نہ آئے، جیسا کہ اس پر کوئی مذمت نہیں آتی جس نے اسے خلیفہ بنایا۔ پس مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ (جس نے رسول کی اطاعت کی، اس نے درحقیقت اللہ کی اطاعت کی)۔ پس اسے وہی مذمت کرتا ہے جو اسے نہیں جانتا اور اللہ کو نہیں جانتا۔\n\nہم میں سے رحم کرنے والا وہ ہے جس کے لیے دو رحمتیں ہیں: ایک طبعی رحمت (الرحمۃ الطبیعیۃ) جو اس کی ذاتی ہے اور اس کے مزاج کا تقاضا ہے، اور ایک رحمت جو اللہ کی طرف سے اس میں رکھی گئی ہے، اسے صورت (الصورة) پر پیدا کرنے کے سبب۔ اور یہ رحمت سو رحمتوں کو شامل ہے جو اللہ کے لیے ہیں۔ بے شک اللہ کے لیے سو رحمتیں ہیں جو اس کے اسماء (الأسماء) کی تعداد کے مطابق ہیں۔ کیونکہ اس کے ننانوے ظاہر اسماء ہیں اور اس نے سوویں کو وتر (طاق) ہونے کی وجہ سے چھپا دیا ہے، کیونکہ وہ وتر کو پسند کرتا ہے، اس لیے کہ وہ وتر ہے۔ پس ہر اسم کے لیے ایک رحمت ہے، اگرچہ وہ اس کے اسمائے المنتقم (انتقام لینے والا) میں سے ہو، تو اس کے انتقام میں بھی رحمت ہے جسے میں ان شاء اللہ اس کتاب کے اسمائے الٰہیہ کے باب میں ذکر کروں گا۔\n\nپس بندوں میں سے رحیم کے لیے سو رحمتیں اور ایک رحمت ہے، وتر ہونے کی وجہ سے، کیونکہ وہ وتر کو پسند کرتا ہے، اس لیے کہ وہ اللہ کو پسند کرتا ہے۔ اور جنت کے درجات سو ہیں، ہر درجے کے لیے ایک رحمت ہے۔ اور جہنم کے سو درکات (گہرائیاں) ہیں، ہر درک میں ایک باطنی رحمت ہے جو اس شخص پر ظاہر ہوگی جو کچھ دیر بعد اس درک میں ہوگا۔ کیونکہ غضب مغلوب ہے اور رحمت سے مسبوق (پہلے آنے والا) ہے۔ پس وہ کسی جگہ ظاہر نہیں ہوتا مگر یہ کہ رحمت اس جگہ پہلے پہنچ چکی ہوتی ہے، پھر وہ اس پر غالب آنے کی کوشش کرتا ہے، لیکن رحمت اس پر غالب آ جاتی ہے، کیونکہ دفع کرنا اٹھانے سے زیادہ آسان ہے۔ پس غضب کا مغضوب علیہ پر کوئی حکم نہیں ہوتا مگر صرف غلبہ پانے کے وقت تک، کیونکہ یہ جگہ ان دونوں کا میدان ہے۔ پس اس جگہ کو رحمت اور غضب کے درمیان ہونے والی مشقت سے اتنا حصہ ملتا ہے جتنا ان کے درمیان جنگ جاری رہتی ہے، یہاں تک کہ رحمت غالب آ جائے۔\n\nاور طبعی رحمت (الرحمۃ الطبیعیۃ) کے ذریعے ہی شفاعت کرنے والوں کی شفاعت واقع ہوتی ہے، نہ کہ موضوعہ (رکھی گئی) رحمت کے ذریعے۔ کیونکہ موضوعہ الٰہی رحمت (الرحمۃ الإلٰہیۃ الموضوعۃ) بندے میں عزت اور سلطنت کے ساتھ ہوتی ہے، لہٰذا وہ شفقت کی بنا پر نہیں ہوتی۔ اور طبعی رحمت سے شفقت پیدا ہوتی ہے۔ اگر الٰہی رحمت کے ساتھ عزت نہ ہوتی اور وہ شفقت سے پاک نہ ہوتی تو اللہ اپنی مخلوق میں سے کسی کو بھی عذاب نہ دیتا۔\n\nپس یہ رحمت جو بندہ اللہ کی مخلوق پر پاتا ہے، یہ طبعی رحمت کا حکم ہے نہ کہ موضوعہ رحمت کا۔ کیونکہ موضوعہ رحمت صرف خلفاء (الخلفاء) کے ساتھ ہی قائم ہوتی ہے۔ کیا تم نہیں دیکھتے کہ جب کوئی شخص خلیفہ کو سزا دیتے، ظلم کرتے اور لوگوں پر زیادتی کرتے دیکھتا ہے تو وہ مظلوموں اور سزا پانے والوں پر کیسی شفقت محسوس کرتا ہے اور کہتا ہے: \"اس کے پاس رحمت نہیں ہے، اگر میں اس کی جگہ ہوتا تو ان پر رحم کرتا اور یہ ظلم اٹھا دیتا۔\"\n\nپھر جب یہ کہنے والا اس منصب کا والی بن جاتا ہے تو اللہ اسے اس طبعی رحمت سے حجاب میں کر دیتا ہے جو شفقت پیدا کرتی ہے، اور اس میں وہ رحمت رکھ دیتا ہے جس کے ساتھ عزت اور سلطنت ہوتی ہے۔ پس وہ مشیت (الٰہی) کے ساتھ رحم کرتا ہے، نہ کہ شفقت کے ساتھ اور نہ ہی ضرورت کی بنا پر، کیونکہ وہ اپنی ذات میں عزیز (العزیز) اور غنی (الغنی) ہے۔ پس وہ ظلم کرتا ہے اور سزا دیتا ہے، بسا اوقات اس دوسرے شخص سے بھی زیادہ جس کی وہ خلافت کا مقام حاصل کرنے سے پہلے اس پر مذمت کرتا تھا۔\n\nجب اس سے اس بارے میں پوچھا جاتا ہے تو وہ کہتا ہے: \"واللہ، اگر میں عالم نہ ہوتا تو مجھے معلوم نہیں ہوتا، میں اپنے اندر وہی پاتا ہوں جو تم دیکھتے ہو۔ اور اب میرے لیے اس شخص کا عذر قائم ہو گیا ہے جو مجھ سے پہلے تھا اور جو وہ کرتا تھا اور میں اس پر اعتراض کرتا تھا۔\"\n\nاور ایک سچے شخص نے مجھے خبر دی کہ ایسا ہی واقعہ امام الناصر لدین اللہ احمد بن الحسن رحمہ اللہ کے ساتھ ان کے والد المستضیء کی موجودگی میں وزیر کے سامنے پیش آیا۔ اور انہوں نے وزیر کے ساتھ اپنے والد کے حق میں عتاب کیا تھا۔ پھر جب خلافت ان کے سپرد ہوئی تو ان سے وہی ظاہر ہوا جس پر انہوں نے اپنے والد کو پکڑا تھا۔ وزیر نے انہیں ان کے سابقہ قول کی یاد دلائی تو انہوں نے کہا: \"وہ حال جو میں اس وقت محسوس کرتا تھا، وہ مجھ سے چلا گیا ہے، اور اب میں وہی محسوس کرتا ہوں جس کا اثر تم دیکھ رہے ہو۔ اور اب میرے والد کا عذر میرے نزدیک قائم ہو گیا ہے۔\"\n\nپس اس منازل کا خلاصہ یہ ہے کہ اللہ نے محمدی (المحمدی) کو اسی پر پیدا کیا جس پر محمد صَلَّى اللهُ عَليهِ وسَلَّم کو پیدا کیا تھا، پس اسے مومنوں کے لیے رؤف و رحیم بنا کر پیدا کیا اور اسے رَحْمَةً لِلْعَالَمِينَ (تمام جہانوں کے لیے رحمت) بنا کر بھیجا، یہاں تک کہ رعل اور ذکوان کے خلاف ان کی دعا بھی ان پر رحمت تھی تاکہ وہ سرکشی میں اضافہ نہ کریں اور اللہ سے مزید دوری اختیار نہ کریں۔\n\nاور ان کی رحمت میں سے یہ ہے کہ انہوں نے فرمایا: \"میں ستر سے زیادہ کروں گا،\" یا فرمایا: \"اگر مجھے معلوم ہوتا کہ اللہ انہیں معاف کر دے گا تو میں ستر سے زیادہ کرتا،\" جب ان سے کہا گیا: إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ (اگر آپ ان کے لیے ستر بار بھی استغفار کریں گے تو اللہ انہیں ہرگز نہیں بخشے گا)۔\n\nپس اگر لوگ محمد صَلَّى اللهُ عَليهِ وسَلَّم کے بارے میں وہ جانتے جو اللہ نے ان کے بارے میں جانا، اس فطرت کی بنا پر جس پر اللہ نے انہیں پیدا کیا، تو کوئی بھی اللہ کی عبادت اس طرح نہ کرتا جس کا اسے مکلف بنایا گیا ہے، بلکہ لوگ علم کے ساتھ اپنی خواہشات کی پیروی کرتے، کیونکہ اللہ نے خواہش نفس کی پیروی کرنے والے کو صرف اس لیے نہیں پکڑا کہ اس نے خواہش کی پیروی کی، بلکہ اس لیے کہ اس نے بغیر علم کے خواہش کی پیروی کی۔ پس جہالت کی محرومی نے انہیں نقصان پہنچایا۔ اللہ تعالیٰ نے فرمایا: بَلِ اتَّبَعَ الَّذِينَ ظَلَمُوا أَهْوَاءَهُمْ (بلکہ ظالموں نے اپنی خواہشات کی پیروی کی) اور وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ عِلْمٍ (اور اس شخص سے زیادہ گمراہ کون ہو سکتا ہے جس نے بغیر علم کے اپنی خواہش کی پیروی کی)۔ اور اللہ تعالیٰ کا داؤد علیہ السلام سے یہ فرمان: وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ (اور خواہش نفس کی پیروی نہ کرنا، ورنہ وہ تمہیں اللہ کے راستے سے بھٹکا دے گی)۔ اور یہ نہیں فرمایا کہ \"اللہ سے بھٹکا دے گی\"۔ اور اللہ کا راستہ وہ ہے جو اس نے دار القرار (ہمیشہ رہنے والی جگہ) کے لیے مشروع کیا ہے جو تمہاری سعادت کا مقام ہے۔\n\nاور جہاں تک آیت کے بقیہ حصے کا تعلق ہے، تو یہ اللہ کی طرف سے اہل فہم کے لیے انتہائی حیرت انگیز اشارہ ہے، اور وہ یہ ہے: إِنَّ الَّذِينَ يَضِلُّونَ عَن سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ (بے شک وہ لوگ جو اللہ کے راستے سے بھٹکتے ہیں، ان کے لیے سخت عذاب ہے، اس لیے کہ انہوں نے یوم حساب کو بھلا دیا)۔ وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "باب چهارصد و سی و ششم در معرفت منازله‌ای (گفتگویی) که «اگر نزد مردم چنان بودی که نزد من هستی، مرا نمی‌پرستیدند.»\n\nاگر جنس تو و همه کائنات\nآنچه را که من از تو می‌دانم، می‌دانستند، مرا نمی‌پرستیدند.\n\nجز تو را (نمی‌پرستیدند)، زیرا تو برایشان مشهود بودی و من غیب بودم؛ و اگر وجود غیب (غیبت) نبود، انکار نمی‌کردند.\n\nمن تو را از قومی با صورت دنیوی‌ات محجوب ساختم، و اگر نهایت (حقیقت) را می‌دانستند، (مرا) نمی‌پرستیدند.\n\nیا اگر اسماء (الهی) را می‌دانستند، با مثال (صورت) توقف نمی‌کردند و جسد آنان را منصرف نمی‌ساخت.\n\nو نه دگرگونی احوالی که بر آنان عارض می‌شود، و نه تراکم اضداد و نه عدد (آنان را منصرف می‌ساخت).\n\nو همه این‌ها مخصوص صورت ماست، و هیچ‌کس آن را در ذات ما انکار نمی‌کند.\n\nاما آنان درباره ما دچار اشتباه شدند و چون آنان را حفظ نکردم، حسد برای امثالشان برپا شد.\n\n### [اختلاف خلفا (جانشینان) بر حسب مراتبشان]\n\nخداوند عز و جل فرمود: «وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ» (و تو را جز رحمتی برای جهانیان نفرستادیم) و فرمود: «إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً» (من در زمین جانشینی قرار خواهم داد) و به برخی از خلفای خود فرمود: «وَلَا تَتَّبِعِ الْهَوَىٰ» (و از هوای نفس پیروی مکن). و از اینجا مراتب مردم از میان خلفا (جانشینان) را می‌شناسی و اینکه خلفا برخی بر برخی دیگر برتری دارند. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) فرمود: «إِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ» (همانا خداوند آدم را بر صورت خود آفرید) و او را نیافرید مگر پس از آنکه بر عرش استوا یافت، و بر عرش استوا نیافت مگر رحمان.\n\nو چون رحمت خداوند ابایزید بسطامی را فرا گرفت و او برای کائنات در آن (رحمت) اثری ندید که حکم عمومیت را از آن زایل کند، به حق (الحق) گفت: «اگر مردم از تو آنچه را که من می‌دانم، می‌دانستند، تو را نمی‌پرستیدند.» و حق تعالی به او فرمود: «ای ابایزید، اگر مردم از تو آنچه را که من می‌دانم، می‌دانستند، تو را سنگسار می‌کردند.»\n\n### [لازم است که خلیفه (جانشین) صفت و نعت خداوند را بپوشد]\n\nپس بدان، کسی که می‌خواهد در میان بندگانش جانشینی قرار دهد که در جایگاه او بایستد، ناگزیر باید صفت و نعت خود را بر او بپوشاند. در نتیجه، خلیفه (جانشین) ظاهر است و کسی که او را جانشین کرده، باطن. پس، پوشش اعراف (حدود و احکام) او، باطنش رحمت است، زیرا او حق (الحق) است که رحمتش بر غضبش پیشی گرفته است؛ و ظاهرش از جانب او عذاب است. پس عذاب در ظاهر او نیست، بلکه عذاب پیش از اوست، و او آن را از کسانی که بر آنان جانشین شده است، می‌بیند.\n\nو حق (الحق) برای خود حدودی تعیین کرده است که با آن حدود با بندگان رفتار می‌کند تا اگر خلیفه به آن حدود عمل کند، نزد مؤمن به آن حدود و به خلیفه، ستوده باشد و هیچ نکوهشی متوجه او نشود، همان‌طور که متوجه کسی که او را جانشین کرده است، نمی‌شود. پس: «مَن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللَّهَ» (هر کس از پیامبر اطاعت کند، قطعاً از خدا اطاعت کرده است). بنابراین، او را نکوهش نمی‌کند مگر کسی که او را نشناسد و خدا را نشناسد.\n\nپس، رحم‌کننده از میان ما کسی است که دو رحمت دارد: رحمتی طبیعی که ذاتی اوست و مزاجش آن را اقتضا کرده است، و رحمتی که خداوند با آفرینش او بر صورت (الهی) در او قرار داده است. و این رحمت، صد رحمتی را که از آنِ خداست، در بر می‌گیرد. زیرا خداوند صد رحمت به تعداد اسماء خود دارد؛ نود و نه اسم ظاهر و صدمین را برای وتر بودن (فرد بودن) پنهان کرده است، زیرا او وتر (فرد) را دوست دارد، چون خود وتر است. پس برای هر اسمی رحمتی است، حتی اگر از اسماء او «المنتقم» (انتقام‌گیرنده) باشد؛ زیرا در انتقام او رحمتی است که ان‌شاءالله آن را در باب اسماء الهیه این کتاب ذکر خواهم کرد. پس برای رحیم از میان بندگان، صد رحمت و یک رحمت دیگر به خاطر وتر بودن است، زیرا او وتر را دوست دارد، چون خدا را دوست دارد.\n\nو درجات بهشت صد درجه است که برای هر درجه رحمتی است، و برای آتش صد درک (طبقه) است که در هر درک رحمتی پنهان است که پس از مدتی برای کسی که در آن درک است، آشکار می‌شود. زیرا غضب مغلوب است و رحمت بر آن سبقت گرفته است. پس در هیچ محلی ظاهر نمی‌شود مگر آنکه رحمت به آن محل سبقت گرفته باشد. سپس غضب با رحمت به ستیز برمی‌خیزد، اما رحمت بر آن غلبه می‌کند، زیرا دفع (جلوگیری) آسان‌تر از رفع (برداشتن) است. پس غضب بر مغضوب‌علیه حکمی ندارد مگر در زمان ستیز خاص، زیرا آن محل میدان نبرد آن دو است. در نتیجه، آن محل به اندازه مدت دوام جنگ میان آن دو تا زمان غلبه رحمت، از مشقتی که بین رحمت و غضب عارض می‌شود، بهره می‌برد.\n\nو شفاعت شفاعت‌کنندگان به واسطه رحمت طبیعی واقع می‌شود، نه به واسطه رحمت موضوعه (قرار داده شده). زیرا رحمت الهی موضوعه در بنده با عزت و سلطنت همراه است، پس از روی شفقت نیست. و رحمت طبیعی است که شفقت از آن ناشی می‌شود. و اگر رحمت الهی با عزت همراه نبود و از شفقت منزه نمی‌شد، خداوند هیچ‌یک از خلق خود را عذاب نمی‌کرد. پس این رحمتی که بنده نسبت به خلق خدا می‌یابد، حکم رحمت طبیعی است، نه رحمت موضوعه. زیرا رحمت موضوعه تنها توسط خلفا (جانشینان) برپا می‌شود.\n\nآیا نمی‌بینی که انسان وقتی خلیفه (جانشین) را می‌بیند که مردم را مجازات می‌کند، ظلم می‌ورزد و ستم می‌کند، چگونه نسبت به مظلومان و مجازات‌شدگان شفقت می‌یابد و می‌گوید: «او رحم ندارد، اگر من جای او بودم، به آنان رحم می‌کردم و این ظلم را از آنان برمی‌داشتم»؟ پس هنگامی که این گوینده آن منصب را به دست می‌گیرد، خداوند او را از رحمت طبیعی که موجب شفقت می‌شود، محجوب می‌سازد و رحمتی را در او قرار می‌دهد که با عزت و سلطنت همراه است. پس او به مشیت (اراده) رحم می‌کند، نه به شفقت و نه به خاطر نیاز، زیرا او در ذات خود عزیز و بی‌نیاز است. در نتیجه، ظلم می‌کند و مجازات می‌نماید، شاید بیشتر از دیگری که پیش از رسیدن به مقام خلافت (جانشینی) او را به خاطر آن نکوهش می‌کرد. پس اگر در این باره از او سؤال شود، اگر عالم نباشد، می‌گوید: «به خدا سوگند نمی‌دانم، زیرا در خود جز آنچه می‌بینید، نمی‌یابم. و اکنون عذر کسی که پیش از من بود و کارهایی که می‌کرد و من بر او خرده می‌گرفتم، برایم روشن شد.» و فردی راستگو به من خبر داد که چنین چیزی از امام الناصر لدین الله (رحمه الله)، احمد بن الحسن، با پدرش المستضیء در حضور وزیر رخ داد. و او همراه وزیر در مورد حق پدرش اعتراض کرد. اما هنگامی که خلافت به او رسید، همان چیزی از او ظاهر شد که از پدرش ظاهر شده بود و او بر آن خرده گرفته بود. وزیر او را به سخن پیشینش متذکر ساخت. او گفت: «حالی که در آن زمان داشتم، از من رفته است و اکنون جز آنچه اثرش را می‌بینی، در خود نمی‌یابم. و اکنون عذر پدرم (رحمه الله) نزد من پذیرفته شد.»\n\nپس مضمون این منازله (گفتگو) این است که خداوند انسان محمدی (المحمدي) را بر همان صورتی آفرید که محمد (صَلَّى اللهُ عَليهِ وسَلَّم) را آفرید. پس او را نسبت به مؤمنان رئوف و رحیم آفرید و او را «رَحْمَةً لِّلْعَالَمِينَ» (رحمتی برای جهانیان) فرستاد. حتی دعای او بر رعل و ذکوان از روی رحمت به آنان بود تا طغیانشان افزون نشود و از خداوند دورتر نگردند. و از رحمت او بود که گفت: «حتماً بر هفتاد خواهم افزود» یا گفت: «اگر می‌دانستم که خداوند آنان را می‌آمرزد، بر هفتاد می‌افزودم»؛ هنگامی که به او گفته شد: «إِن تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ اللَّهُ لَهُمْ» (اگر هفتاد بار هم برایشان آمرزش بخواهی، خداوند هرگز آنان را نخواهد آمرزید).\n\nپس اگر مردم از محمد (صَلَّى اللهُ عَليهِ وسَلَّم) آنچه را که خداوند از او می‌دانست، به واسطه آنچه خداوند او را بر آن سرشته بود، می‌شناختند، هیچ‌کس خداوند را به آنچه مکلف کرده بود، نمی‌پرستید، بلکه مردم از روی علم از هوای نفس خود پیروی می‌کردند. زیرا خداوند کسی را که از هوای نفس پیروی کرده، مؤاخذه نکرده است مگر به این دلیل که از هوای نفس خود بدون علم پیروی کرده است. پس محرومیت ناشی از جهل آنان را به هلاکت انداخت. خداوند متعال فرمود: «بَلِ اتَّبَعَ الَّذِينَ ظَلَمُوا أَهْوَاءَهُم» (بلکه کسانی که ستم کردند، از هوای نفس خود پیروی کردند) و «وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَاهُ بِغَيْرِ عِلْمٍ» (و کیست گمراه‌تر از آن کس که بدون علم از هوای نفس خود پیروی کند؟) و سخن خداوند متعال به داوود (علیه السلام): «وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ» (و از هوای نفس پیروی مکن که تو را از راه خدا گمراه سازد) و نفرمود: «از خدا». و سبیل الله (راه خدا) همان چیزی است که او برای دارالقرار (سرای جاودانگی) تشریع کرده است که محل سعادت توست. و اما ادامه آیه، از شگفت‌انگیزترین اشارات الهی برای اهل فهم از جانب خداست، و آن این فرموده اوست: «إِنَّ الَّذِينَ يَضِلُّونَ عَن سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ» (همانا کسانی که از راه خدا گمراه می‌شوند، به سزای آنکه روز حساب را فراموش کردند، عذابی سخت خواهند داشت) و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند)."
  },
  "page_count": 3
}