{
  "id": 515,
  "title": {
    "ar": "الباب الخامس عشر وخمسمائة في معرفة حال قطب كان منزله وظَنَّ داوُدُ أَنَّما فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وخَرَّ راكِعاً وأَنابَ",
    "en": "Chapter Five Hundred and Fifteen: Concerning the knowledge of the state of a Pole (قطب) whose station was: <<And David thought that We had tried him, so he asked forgiveness of his Lord and fell down bowing and repented.>>",
    "ur": "پانچ سو پندرہواں باب: ایک قطب (قطب) کے حال کی معرفت (المعرفۃ) میں جس کا مقام (منزل) یہ تھا: \"اور داؤد نے گمان کیا کہ ہم نے اسے آزمایا ہے، تو اس نے اپنے رب سے مغفرت طلب کی اور سجدے میں گر پڑا اور رجوع کیا۔\"",
    "fa": "باب پانصد و پانزدهم: در معرفت حال قطبی (قطب) که منزل او [این است]:\n«و داود گمان برد که ما او را آزموده‌ایم، پس از پروردگارش آمرزش خواست و به سجده افتاد و توبه کرد.» (وظَنَّ داوُدُ أَنَّما فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وخَرَّ راكِعاً وأَنابَ)"
  },
  "content": {
    "ar": "## «الباب الخامس عشر وخمسمائة في معرفة حال قطب كان منزله وظَنَّ داوُدُ أَنَّما فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وخَرَّ راكِعاً وأَنابَ»\n\n\n> الافتتان هو البلاء بعينه *** فاسكن إذا ما يبتليك بحكمه‏\n\n\n> واستغفر الرب الكريم بسجدة *** منه فأنت معين في علمه‏\n\n\n> واحذر من الفكر الدقيق فإنما *** يؤتى الذي فهم الذي من فهمه‏\n\n\n> الشأن فوق عقولنا وعيوننا *** فاحذر من العقل الذي في زعمه‏\n\n\n> إن العلوم لديه وهو مقيد *** عبد الدليل بكيفه وبكمه‏\n> إن الشريعة قسمته بكيلها *** فلذاك قلت بكيفه وبكمه‏\n\n\n### [داود عليه السلام أشبه بنى آدم بآدم ع‏]\n\n\nلما كان داود عليه السلام في دلالة اسمه عليه أشبه بنى آدم بآدم في دلالة اسمه عليه صرح الله بخلافته في القرآن في الأرض كما صرح بخلافة آدم في الأرض فإن حروف آدم غير متصلة بعضها ببعض وحروف داود كذلك إلا أن آدم فرق بينه وبين داود بحرف الميم الذي يقبل الاتصال القبلي والبعدي فأتى الله به آخرا حتى لا يتصل به حرف سواه وجعل قلبه واحدا من الحروف الستة التي لا تقبل الاتصال البعدي فأخذ داود من آدم ثلثي مرتبته في الأسماء وأخذ محمد صَلَّى اللهُ عَليهِ وسَلَّم ثلثيه أيضا وهو الميم والدال غير إن محمدا متصل كله والحرف الذي لا يقبل الاتصال البعدي جعل آخرا حتى يتصل به ولا يتصل هو بشي‏ء بعده وهوقوله صَلَّى اللهُ عَليهِ وسَلَّم لو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكن صاحبكم خليل الله‏\n\n\nفيتصل به ولا يتصل هو بأحد فناسب محمد آدم عليهما الصلاة والسلام من وجهين الأول مناسبة النقيض بالاتصال بآدم وآدم له الانفصال كداود والميم من آدم كالدال من محمد فجاءنا آخرا لذلك أعني في آخر الاسم منهما والثاني مناسبة النظير التي بين آدم ومحمد في كون الحق عَلَّمَ آدَمَ الْأَسْماءَ كُلَّها وأعطى محمدا صَلَّى اللهُ عَليهِ وسَلَّم جوامع الكلم وعمت رسالته كما عم التناسل من آدم في ذريته فالناس بنو آدم والناس أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم من تقدم منهم ومن تأخر لأنه‏\n\n\nقال صَلَّى اللهُ عَليهِ وسَلَّم آدم فمن دونه تحت لوائي‏\n\n\nفنظر آدم إلى داود دون ولده لما ذكره فاستقل عمره فأعطاه من عمره ستين سنة وهو عمر محمد صَلَّى اللهُ عَليهِ وسَلَّم فلما وصل من عمره إلى الميم من اسمه رأى صورة محمد صَلَّى اللهُ عَليهِ وسَلَّم في الميم فرجع عن داود لأنه قد فارق رؤية الألف والدال فرجع في عطيته التي أعطاها داود من عمره فدخل تحت لواء محمد صَلَّى اللهُ عَليهِ وسَلَّم فأما تصريح الحق بالخلافتين على التعيين في حقهما فقوله تعالى في خلافة آدم عليه السلام إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً يريد آدم وبنيه وأمر الملائكة بالسجود له وقال تعالى في داود عليه السلام يا داوُدُ إِنَّا جَعَلْناكَ خَلِيفَةً في الْأَرْضِ ثم قال فيه ما لم يقل في آدم ولا تَتَّبِعِ الْهَوى‏ وسبب ذلك لما لم يجعل في حروف اسمه حرفا من حروف الاتصال جملة واحدة فما في اسمه حرف يتصل بحرف آخر من حروف اسمه فعلم إن أمره فيه تشتيت لما كان لكل إنسان من اسمه نصيب فكان نصيبه من اسمه ما فيه من التشتيت فأوصاه تعالى أن لا يتبع الهوى لانفراد كل حرف من اسمه بنفسه ثم إن له إلى الفردية وجوها في حركاته فهي ثلاثة وحروفه خمسة فهو فرد من جميع الوجوه فلو لا أنه قابل لما وقعت فيه الوصية من الله ما وصاه ولما علم ذلك داود بما أعلمه الله بطريق التنبيه في نهيه إياه أن لا يتبع الهوى ولم يقل هواك أي لا تتبع هوى أحد يشير عليك واحكم بما أوحيت به إليك من الحق فإن الهوى ما له حكم إلا بالاتصال وحروف اسم داود لا تقتضي الاتصال فعصمه الله من وجه خاص فلما وصاه الحق تعالى استغفر ربه أي طلب الستر من الله الحائل بينه وبين الهوى المضل ليتصل به فيتصف به فيؤثر في الحكم الذي أرسل به رجع إلى الله في ذلك وسقط إلى الأرض اختيارا قبل أن تسقطه الأهواء وتؤثر فيه تأثيرها في الجدار إن القائمة فكان ركوعه رجوعا إلى أصله من نفسه فهو عين الستر الذي طلبه في استغفاره فلما جاء الهوى لم يجد شيئا منتصبا قائما يرده عن مجراه فيؤثر فيه فراح عنه ولم يصبه وعصمه الله وستره وليس الابتلاء مما يحط درجة العبد عند الله بل ما يبتلي الله إلا الأمثل فالأمثل من عباده فَيُضِلُّ بالتأويل في ذلك من يَشاءُ ويَهْدِي من يَشاءُ إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِها من تَشاءُ وتَهْدِي من تَشاءُ أَنْتَ وَلِيُّنا فَاغْفِرْ لَنا وارْحَمْنا وأَنْتَ خَيْرُ الْغافِرِينَ فنفس الأنبياء نفس واحد فمن عباد الله من سترهم الله عن الذنوب فلم تدركهم ولم ترهم ومن عباد الله من يسترهم الله عن المؤاخذة عن الذنب وكل له مقام معلوم‏\n\n\n> فلو إن داود في حكمه *** بحكم الهوى ضل عن نفسه‏\n\n\n> ولكنه سيد منجب *** قد اختاره الله من قدسه‏\n\n\n> له الضوء من ذاته ظاهر *** تبرز فيه على جنسه‏\n\n\n> فما خر عن زلة قد أتى *** بها بل رجوعا إلى أسه‏\n> فداود في ذاته وده *** وفي وده الداء من شمسه‏\n\n\n> فأشبه يعقوب في حزنه *** وأشبه يوسف في حبسه‏\n\n\nواعلم أنه لو لا الابتلاء لقال من شاء ما شاء فأصل الابتلاء وسببه الدعوى ومن الابتلاء ما يكون في غاية الخفاء مثل قوله تعالى فَما أَصْبَرَهُمْ عَلَى النَّارِ ومنه ما يكون في غاية الجلاء مثل قوله ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجاهِدِينَ مِنْكُمْ والصَّابِرِينَ ونَبْلُوَا أَخْبارَكُمْ ولا يعرف مثل هذا إلا من يعرف الجلي والخفي ولما ذا يرجع وهل ثم خفي لنفسه أو هو خفي بالنسبة فإنا نعلم إِنَّ الله لا يَخْفى‏ عَلَيْهِ شَيْ‏ءٌ في الْأَرْضِ وهو المعلوم وكل ما في الطبيعة من الأسرار فإن صورها أرض الأرواح ولا في السَّماءِ وهو المعلوم وكل ما في الأرواح التي بين الطبيعة والعماء وهي التي تشرق هذه الأرض بأنوارها فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Fifteen: Concerning the Knowledge of the State of a Pole (*qutb*) Whose Station Was: <<وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ>> (And David realized that We had tried him, so he sought forgiveness from his Lord and fell down bowing and repented)\n\nThe trial (*al-iftitān*) is the affliction (*al-balā'*) itself,\nSo be still when He tries you by His decree.\n\nAnd seek forgiveness from the Generous Lord with a prostration (*sajda*) from Him,\nFor you are appointed in His Knowledge (*'ilm*).\n\nAnd beware of subtle thought (*al-fikr al-daqīq*), for only he who understands\nIs given that which comes from his understanding.\n\nThe Affair (*al-Sha'n*) is above our intellects and our eyes,\nSo beware of the intellect that makes claims.\n\nIndeed, the sciences are with it, yet it is constrained,\nA slave to the proof by its quality (*kayf*) and its quantity (*kamm*).\nIndeed, the Sacred Law (*al-Sharī'a*) divided it by its measure,\nAnd for that reason, I said: by its quality and its quantity.\n\n### [David (Dawud), peace be upon him, was the most similar of the Children of Adam to Adam, peace be upon him]\n\nSince David (Dawud), peace be upon him, in the indication of his name, was the most similar of the Children of Adam to Adam, in the indication of his name, Allah explicitly declared his vicegerency (*khilāfa*) on Earth in the Quran, just as He explicitly declared Adam's vicegerency on Earth. For the letters of Adam (A-D-M) are not connected to one another, and the letters of David (D-A-W-D) are likewise [disconnected].\n\nExcept that Adam was distinguished from David by the letter *Mīm* (م), which accepts connection both before and after it. Allah brought it last so that no letter could connect to it thereafter. And He made its heart [the *Wāw* (و) in Dawud] one of the six letters that do not accept subsequent connection. Thus, David took two-thirds of Adam's rank in the Names (*al-Asmā'*) and Muhammad, peace and blessings be upon him, also took two-thirds of it, namely the *Mīm* (م) and the *Dāl* (د). However, Muhammad's name is entirely connected, and the letter that does not accept subsequent connection was placed last so that [other things] connect to him, but he does not connect to anything after him. This is [indicated by] his saying, peace and blessings be upon him: \"If I were to take an intimate friend (*khalīl*), I would have taken Abu Bakr as an intimate friend, but your companion is the intimate friend of Allah (*khalīl Allāh*).\" So [others] connect to him, but he does not connect to anyone.\n\nThus, Muhammad was suited to Adam, peace and blessings be upon them both, in two ways. The first is the suitability of the opposite: by connection to Adam, while Adam has separation, like David. The *Mīm* (م) in Adam is like the *Dāl* (د) in Muhammad, so it came to us last for that reason—meaning, at the end of the name for both of them. The second is the suitability of the counterpart (*al-nazīr*) that exists between Adam and Muhammad, in that the Real (*al-Haqq*) taught Adam all the Names (<<عَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا>>), and He gave Muhammad, peace and blessings be upon him, the comprehensive words (*jawāmi' al-kalim*). And his message was universal, just as procreation from Adam was universal among his progeny. So, people are the children of Adam, and people are the community (*umma*) of Muhammad, peace and blessings be upon him, both those who preceded him and those who came after him, because he said, peace and blessings be upon him: \"Adam and all those below him are under my banner.\"\n\nAdam looked upon David, rather than his own son, due to what was mentioned [the similarity in names], and deemed his lifespan short. So, he gave him sixty years from his own lifespan, which is the lifespan of Muhammad, peace and blessings be upon him. When [Adam] reached the *Mīm* (م) of his name in his lifespan, he saw the form of Muhammad, peace and blessings be upon him, in the *Mīm*. He then withdrew from David because he had separated from the vision of the *Alif* (ا) and the *Dāl* (د). Thus, he retracted the gift of lifespan he had given David, and [Adam] entered under the banner of Muhammad, peace and blessings be upon him.\n\nAs for the explicit declaration by the Real (*al-Haqq*) of the two vicegerencies (*al-khilāfatayn*) specifically concerning them both, it is His saying, the Exalted, regarding the vicegerency of Adam, peace be upon him: <<إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً>> (Indeed, I am going to place a vicegerent on the earth), meaning Adam and his children. And He commanded the angels to prostrate to him. And He said, the Exalted, concerning David, peace be upon him: <<يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ>> (O David, indeed We have made you a vicegerent on the earth). Then He said concerning him what He did not say concerning Adam: <<وَلَا تَتَّبِعِ الْهَوَى>> (And do not follow [vain] desire).\n\nThe reason for this is that no letter in his name was made from the letters of connection (*hurūf al-ittiṣāl*) entirely. There is no letter in his name that connects to another letter of his name. Thus, it was known that his affair contained dispersion (*tashtīt*), since every human being has a share of his name, and his share of his name was the dispersion it contained. Therefore, the Exalted commanded him not to follow desire (*al-hawā*) due to the isolation (*infirād*) of every letter in his name. Furthermore, he has aspects of singularity (*fardiyya*) in his movements, which are three, and his letters are five, so he is singular (*fard*) from all aspects. Had he not been receptive to the divine command (*waṣiyya*) that occurred, Allah would not have commanded him.\n\nWhen David knew this, by what Allah informed him through the way of warning in forbidding him from following desire—and He did not say \"your desire\" (*hawāka*)—meaning: \"Do not follow the desire of anyone who advises you, but judge by the Truth (*al-Haqq*) that I have revealed to you.\" For desire has no ruling except through connection (*ittiṣāl*), and the letters of David's name do not necessitate connection. Thus, Allah protected him in a specific way.\n\nWhen the Real, the Exalted, commanded him, he sought forgiveness from his Lord, meaning he sought the veil (*al-sitr*) from Allah, which intervenes between him and the misleading desire, so that he might connect to Him and be characterized by Him, thereby influencing the judgment with which he was sent. He returned to Allah in that matter and fell to the ground voluntarily, before desires could make him fall and affect him as they affect a standing wall. Thus, his bowing (*rukū'*) was a return to his origin from his own self, and it was the very veil (*sitr*) he sought in his seeking of forgiveness (*istighfār*). When desire came, it found nothing upright and standing to repel it from its course and affect it. So, it departed from him and did not afflict him. Allah protected him and veiled him.\n\nThe trial (*al-ibtilā'*) is not something that lowers the rank of the servant before Allah; rather, Allah only tries the best and most excellent of His servants. He misleads whom He wills through the interpretation (*ta'wīl*) of that, and guides whom He wills. <<إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَن تَشَاءُ وَتَهْدِي مَن تَشَاءُ أَنتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الْغَافِرِينَ>> (It is nothing but Your trial [fitna]; You mislead thereby whom You will and guide whom You will. You are our Protector, so forgive us and have mercy upon us; and You are the best of forgivers). The soul (*nafs*) of the Prophets is one soul. Among the servants of Allah are those whom Allah has veiled from sins, so sins neither reached them nor saw them. And among the servants of Allah are those whom Allah veils from accountability for sin. And everyone has a known station (*maqām ma'lūm*).\n\nIf David, in his judgment,\nHad been ruled by desire (*al-hawā*), he would have strayed from his own self.\n\nBut he is a noble master,\nWhom Allah chose from His Holiness (*quds*).\n\nThe light from his Essence (*dhāt*) is manifest for him,\nAppearing therein over his kind.\n\nHe did not fall down due to a slip he committed,\nBut rather as a return to his foundation (*ass*).\n\nDavid is in his Essence (*dhāt*) and his love (*wudd*),\nAnd in his love is the ailment from his sun.\n\nSo he resembled Jacob in his sorrow,\nAnd he resembled Joseph in his imprisonment.\n\nKnow that were it not for the trial (*al-ibtilā'*), whoever willed would say whatever he willed. The origin and cause of the trial is the claim [of spiritual status]. And among trials are those that are extremely hidden, such as His saying, the Exalted: <<فَمَا أَصْبَرَهُمْ عَلَى النَّارِ>> (How patient they are with the Fire!). And among them are those that are extremely manifest, such as His saying: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجَاهِدِينَ مِنكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ>> (And We will surely test you until We make evident those who strive among you and the patient, and We will test your reports).\n\nNo one knows the like of this except one who knows the manifest (*al-jalī*) and the hidden (*al-khafī*), and to what they return, and whether there is a hidden thing in itself, or if it is hidden only relative [to the observer]. For we know that <<إِنَّ اللَّهَ لَا يَخْفَى عَلَيْهِ شَيْءٌ فِي الْأَرْضِ>> (Indeed, nothing is hidden from Allah on the earth), and that is the Known (*al-Ma'lūm*). And all the secrets in Nature (*al-ṭabī'a*), their forms are the earth of the Spirits (*al-Arwāḥ*). Nor <<وَلَا فِي السَّمَاءِ>> (nor in the heaven), and that is the Known. And all that is in the Spirits (*al-Arwāḥ*) that are between Nature and the Cloud (*al-'Amā'*)—which are those that illuminate this earth with their lights—know that. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the way).",
    "ur": "باب نمبر پانچ سو پندرہ قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"اور داؤد نے گمان کیا کہ ہم نے اسے آزمایا ہے، تو اس نے اپنے رب سے مغفرت طلب کی اور جھکتا ہوا سجدے میں گر پڑا اور رجوع کیا\" (وَظَنَّ داوُدُ أَنَّما فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وخَرَّ راكِعاً وأَنابَ)۔\n\nآزمائش (الافتتان) بعینہٖ بلا ہی ہے،\nپس جب وہ تجھے اپنے حکم سے آزمائے تو سکون اختیار کر۔\nاور ایک سجدے کے ذریعے رب کریم سے استغفار کر،\nکیونکہ تو اس کے علم میں مددگار (معین) ہے۔\nاور باریک بینی والی فکر سے بچ، کیونکہ\nسمجھنے والے کو وہی دیا جاتا ہے جو اس کی سمجھ سے ہو۔\nیہ معاملہ ہماری عقلوں اور ہماری آنکھوں سے بالاتر ہے،\nپس اس عقل سے بچ جو اپنے گمان میں ہے۔\nکہ علوم اس کے پاس ہیں، حالانکہ وہ مقید ہے،\nاپنی کیفیت (کیف) اور کمیت (کم) کے ساتھ دلیل کا غلام ہے۔\nشریعت نے اسے اپنے پیمانے سے تقسیم کیا ہے،\nاسی لیے میں نے کہا کہ اپنی کیفیت اور کمیت کے ساتھ۔\n\n### [داؤد علیہ السلام بنی آدم میں آدم علیہ السلام سے سب سے زیادہ مشابہ تھے]\n\nچونکہ داؤد علیہ السلام اپنے نام کی دلالت میں بنی آدم میں آدم علیہ السلام سے سب سے زیادہ مشابہ تھے، جیسا کہ آدم کے نام کی دلالت ان پر ہے، اس لیے اللہ تعالیٰ نے قرآن میں زمین پر ان کی خلافت (الخلافۃ) کی صراحت فرمائی، جیسا کہ آدم کی خلافت کی صراحت فرمائی تھی۔ آدم (آدم) کے حروف ایک دوسرے سے متصل نہیں ہیں، اور داؤد (داؤد) کے حروف بھی اسی طرح ہیں۔ مگر آدم کو داؤد سے حرف میم (م) کے ذریعے ممتاز کیا گیا جو قبلی اور بعدی اتصال کو قبول کرتا ہے، پس اللہ نے اسے آخر میں لایا تاکہ اس کے ساتھ کوئی دوسرا حرف متصل نہ ہو، اور اس کے قلب کو ان چھ حروف میں سے ایک بنایا جو بعدی اتصال قبول نہیں کرتے۔ پس داؤد نے آدم سے اسماء میں ان کے مرتبے کا دو تہائی حصہ لیا، اور محمد صلی اللہ علیہ وسلم نے بھی اس کا دو تہائی حصہ لیا، جو کہ میم (م) اور دال (د) ہیں۔ فرق یہ ہے کہ محمد (محمد) کا پورا نام متصل ہے، اور وہ حرف جو بعدی اتصال قبول نہیں کرتا، اسے آخر میں رکھا گیا تاکہ وہ اس سے متصل ہو جائے لیکن وہ خود کسی چیز سے متصل نہ ہو، اور یہی آپ صلی اللہ علیہ وسلم کا قول ہے: \"اگر میں کسی کو خلیل بناتا تو ابوبکر کو خلیل بناتا، لیکن تمہارا صاحب خلیل اللہ ہے\" (صاحبکم خلیل اللہ)۔\n\nپس وہ (محمد ﷺ) اس سے متصل ہوتے ہیں اور وہ (خلیل اللہ) کسی سے متصل نہیں ہوتے۔ اس طرح محمد صلی اللہ علیہ وسلم دو وجوہ سے آدم علیہما الصلاۃ والسلام کے مناسب ہوئے: پہلی وجہ نقیض کی مناسبت ہے، یعنی آدم سے اتصال کے ذریعے، جبکہ آدم اور داؤد کے لیے انفصال ہے۔ اور آدم کا میم (م) محمد کا دال (د) ہے۔ اسی لیے وہ آخر میں آیا، یعنی ان دونوں کے نام کے آخر میں۔ اور دوسری وجہ وہ نظیر کی مناسبت ہے جو آدم اور محمد کے درمیان ہے، اس لحاظ سے کہ الحق (ذات حق) نے \"آدم کو تمام اسماء سکھائے\" (عَلَّمَ آدَمَ الْأَسْماءَ كُلَّها) اور محمد صلی اللہ علیہ وسلم کو \"جوامع الکلم\" (جامع کلمات) عطا فرمائے، اور آپ کی رسالت عام ہوئی، جیسا کہ آدم کی ذریت میں تناسل عام ہوا۔ پس لوگ آدم کی اولاد ہیں اور لوگ محمد صلی اللہ علیہ وسلم کی امت ہیں، خواہ وہ پہلے گزر چکے ہوں یا بعد میں آئیں۔ کیونکہ آپ صلی اللہ علیہ وسلم نے فرمایا: \"آدم اور جو کوئی ان سے نیچے ہے، وہ میرے جھنڈے تلے ہوں گے\" (آدم فمن دونه تحت لوائي)۔\n\nپس آدم نے داؤد کو ان کے بیٹے کے بجائے دیکھا جب اس کا ذکر کیا گیا، تو انہوں نے ان کی عمر کو کم سمجھا، اور انہیں اپنی عمر میں سے ساٹھ سال عطا کر دیے، جو کہ محمد صلی اللہ علیہ وسلم کی عمر ہے۔ جب وہ اپنی عمر کے میم (م) تک پہنچے تو انہوں نے میم میں محمد صلی اللہ علیہ وسلم کی صورت دیکھی، تو داؤد سے رجوع کر لیا، کیونکہ وہ الف (ا) اور دال (د) کے مشاہدے سے جدا ہو چکے تھے۔ پس انہوں نے وہ عطیہ واپس لے لیا جو انہوں نے داؤد کو اپنی عمر میں سے دیا تھا۔ پس وہ محمد صلی اللہ علیہ وسلم کے جھنڈے تلے داخل ہو گئے۔\n\nجہاں تک الحق (ذات حق) کی طرف سے ان دونوں کے حق میں خلافتین (الخلافتین) کی صراحت کا تعلق ہے، تو آدم علیہ السلام کی خلافت کے بارے میں اللہ تعالیٰ کا فرمان ہے: \"میں زمین میں ایک خلیفہ بنانے والا ہوں\" (إِنِّي جاعِلٌ في الْأَرْضِ خَلِيفَةً)، جس سے مراد آدم اور ان کی اولاد ہے۔ اور فرشتوں کو حکم دیا کہ وہ انہیں سجدہ کریں۔ اور داؤد علیہ السلام کے بارے میں اللہ تعالیٰ نے فرمایا: \"اے داؤد! ہم نے تمہیں زمین میں خلیفہ بنایا ہے\" (يا داوُدُ إِنَّا جَعَلْناكَ خَلِيفَةً في الْأَرْضِ)۔ پھر ان کے بارے میں وہ فرمایا جو آدم کے بارے میں نہیں فرمایا: \"اور خواہشات (الھویٰ) کی پیروی نہ کرنا\" (وَلا تَتَّبِعِ الْهَوى‏)۔ اس کی وجہ یہ تھی کہ ان کے نام کے حروف میں کوئی بھی حرف ایسا نہیں تھا جو مکمل طور پر اتصال قبول کرتا ہو۔ ان کے نام میں کوئی حرف ایسا نہیں ہے جو ان کے نام کے دوسرے حرف سے متصل ہو۔ پس یہ معلوم ہوا کہ ان کے معاملے میں تشتت (بکھراؤ) ہے، کیونکہ ہر انسان کو اس کے نام سے ایک حصہ ملتا ہے۔ پس ان کا حصہ ان کے نام میں موجود تشتت تھا۔ اس لیے اللہ تعالیٰ نے انہیں وصیت کی کہ وہ خواہشات (الھویٰ) کی پیروی نہ کریں، کیونکہ ان کے نام کا ہر حرف اپنی ذات میں منفرد ہے۔ پھر ان کے لیے ان کی حرکات میں فردیت (انفرادیت) کے کئی پہلو ہیں، وہ تین ہیں، اور ان کے حروف پانچ ہیں، پس وہ تمام پہلوؤں سے فرد ہیں۔ اگر وہ اس وصیت کو قبول کرنے کے قابل نہ ہوتے جو اللہ کی طرف سے ان پر نازل ہوئی، تو وہ انہیں وصیت نہ کرتا۔ جب داؤد نے یہ بات جان لی جو اللہ نے انہیں تنبیہ کے ذریعے بتائی تھی کہ وہ خواہشات کی پیروی نہ کریں، اور یہ نہیں فرمایا کہ \"تمہاری خواہش\" (ھواک)، یعنی کسی ایسے شخص کی خواہش کی پیروی نہ کرنا جو تمہیں مشورہ دے، بلکہ اس حق کے ساتھ فیصلہ کرنا جو میں نے تمہاری طرف وحی کیا ہے۔ کیونکہ خواہش (الھویٰ) کا حکم صرف اتصال سے ہوتا ہے، اور داؤد کے نام کے حروف اتصال کا تقاضا نہیں کرتے۔ پس اللہ نے انہیں ایک خاص پہلو سے محفوظ رکھا۔ جب الحق (ذات حق) نے انہیں وصیت کی تو انہوں نے اپنے رب سے استغفار کیا، یعنی اللہ سے پردہ (ستر) طلب کیا جو ان کے اور گمراہ کن خواہشات (الھویٰ) کے درمیان حائل ہو جائے، تاکہ وہ اس سے متصل ہو جائیں اور اس سے متصف ہو جائیں، اور اس حکم میں اثر انداز ہوں جو ان کی طرف بھیجا گیا تھا۔ انہوں نے اس معاملے میں اللہ کی طرف رجوع کیا اور زمین پر اپنی مرضی سے گر پڑے، اس سے پہلے کہ خواہشات انہیں گرا دیتیں اور ان پر اپنا اثر ڈال دیتیں، جیسا کہ گرنے والی دیوار پر ہوتا ہے۔ پس ان کا رکوع ان کی اپنی ذات کے اصل کی طرف رجوع تھا، اور یہی وہ پردہ (ستر) تھا جو انہوں نے اپنے استغفار میں طلب کیا تھا۔ پس جب خواہش (الھویٰ) آئی تو اسے کوئی کھڑی ہوئی چیز نہیں ملی جو اسے اس کے بہاؤ سے روکتی اور اس پر اثر انداز ہوتی، پس وہ ان سے دور ہو گئی اور انہیں کوئی نقصان نہیں پہنچا، اور اللہ نے انہیں محفوظ رکھا اور ان پر پردہ ڈالا۔ آزمائش (الابتلاء) وہ چیز نہیں جو بندے کا درجہ اللہ کے ہاں کم کر دے، بلکہ اللہ صرف اپنے بہترین بندوں کو ہی آزماتا ہے۔ پس وہ اس تاویل کے ذریعے جسے چاہتا ہے گمراہ کرتا ہے اور جسے چاہتا ہے ہدایت دیتا ہے۔ \"یہ تو بس تیری آزمائش (فِتْنَتُكَ) ہے، تو اس کے ذریعے جسے چاہتا ہے گمراہ کرتا ہے اور جسے چاہتا ہے ہدایت دیتا ہے۔ تو ہی ہمارا ولی ہے، پس ہمیں بخش دے اور ہم پر رحم فرما، اور تو بہترین بخشنے والا ہے\" (إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِها من تَشاءُ وتَهْدِي من تَشاءُ أَنْتَ وَلِيُّنا فَاغْفِرْ لَنا وارْحَمْنا وأَنْتَ خَيْرُ الْغافِرِينَ)۔ پس انبیاء کی نفس ایک ہی نفس ہے، پس اللہ کے بندوں میں سے کچھ ایسے ہیں جنہیں اللہ نے گناہوں سے پردہ ڈال دیا، پس وہ ان تک نہیں پہنچ پائے اور نہ ہی انہیں دیکھ پائے، اور اللہ کے بندوں میں سے کچھ ایسے ہیں جنہیں اللہ گناہ پر مؤاخذے سے پردہ ڈال دیتا ہے، اور ہر ایک کا ایک معلوم مقام ہے۔\n\nاگر داؤد اپنے حکم میں\nخواہش (ہویٰ) کے حکم سے اپنی ذات سے گمراہ ہو جاتے،\nلیکن وہ ایک نجیب سردار ہیں،\nجنہیں اللہ نے اپنی قدسیت سے چنا ہے۔\nان کی ذات سے نور ظاہر ہے،\nجو اس میں اپنی جنس پر نمایاں ہوتا ہے۔\nپس وہ کسی لغزش کی وجہ سے نہیں گرے جو انہوں نے کی ہو،\nبلکہ اپنی بنیاد (اصل) کی طرف رجوع کرتے ہوئے گرے۔\nپس داؤد اپنی ذات میں محبت (ود) ہیں،\nاور ان کی محبت میں ان کے سورج سے درد ہے۔\nپس وہ اپنے غم میں یعقوب سے مشابہ ہوئے،\nاور اپنی قید میں یوسف سے مشابہ ہوئے۔\n\nاور جان لو کہ اگر آزمائش (الابتلاء) نہ ہوتی تو جو چاہتا وہ کہہ دیتا جو وہ چاہتا۔ پس آزمائش کی اصل اور سبب دعویٰ ہے۔ اور آزمائش میں سے کچھ انتہائی پوشیدہ ہوتی ہیں، جیسے اللہ تعالیٰ کا فرمان ہے: \"انہیں آگ پر کتنا صبر ہے!\" (فَما أَصْبَرَهُمْ عَلَى النَّارِ)۔ اور کچھ انتہائی واضح ہوتی ہیں، جیسے اس کا فرمان ہے: \"اور ہم تمہیں ضرور آزمائیں گے تاکہ ہم تم میں سے مجاہدین اور صابرین کو جان لیں اور تمہاری خبروں کو جانچ لیں\" (وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَا أَخْبَارَكُمْ)۔ اور اس طرح کی چیز کو صرف وہی جانتا ہے جو ظاہر اور پوشیدہ کو جانتا ہو، اور یہ جانتا ہو کہ وہ کس چیز کی طرف رجوع کرتا ہے، اور کیا وہاں کوئی پوشیدہ چیز اپنی ذات کے لیے ہے یا وہ نسبت کے لحاظ سے پوشیدہ ہے؟ کیونکہ ہم جانتے ہیں کہ \"اللہ پر زمین میں کوئی چیز پوشیدہ نہیں ہے\" (إِنَّ الله لا يَخْفى‏ عَلَيْهِ شَيْ‏ءٌ في الْأَرْضِ)، اور یہی معلوم ہے۔ اور طبیعت میں جو بھی اسرار ہیں، ان کی صورتیں ارواح کی زمین ہیں۔ اور نہ ہی \"آسمان میں\" (وَلا فِي السَّماءِ)، اور یہی معلوم ہے۔ اور وہ سب کچھ جو ارواح میں ہے جو طبیعت اور عماء (العمآء) کے درمیان ہیں، اور یہی وہ ہیں جو اس زمین کو اپنے انوار سے روشن کرتی ہیں۔ پس یہ جان لو، اور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف ہدایت دیتا ہے (وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و پانزدهم در معرفت حال قطبی که منزل او این آیه بود: «وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ» (و داوود پنداشت که ما او را آزموده‌ایم، پس از پروردگارش آمرزش خواست و به رکوع افتاد و توبه کرد.)\n\n***\n\nافتتان (آزمایش) عین بلاست، پس آرام گیر\nآنگاه که تو را به حکم خود می‌آزماید\n\nو از پروردگار کریم با سجده‌ای آمرزش بخواه\nزیرا تو در علم او یاری شده‌ای\n\nو از اندیشه دقیق برحذر باش، زیرا\nبه کسی که فهمیده است، آنچه از فهم اوست داده می‌شود\n\nاین شأن (امر الهی) فراتر از عقل‌ها و دیدگان ماست\nپس از عقلی که در گمان خود است، برحذر باش\n\nهمانا علوم نزد اوست، در حالی که او (عقل) مقید است\nبنده دلیل است با چگونگی (کیف) و چندی (کم) خود\nهمانا شریعت او را با پیمانه خود تقسیم کرده است\nاز این رو گفتم با چگونگی و چندی خود\n\n### [داوود (علیه السلام) شبیه‌ترین فرزندان آدم به آدم (علیه السلام)]\n\nچون داوود (علیه السلام) در دلالت اسمش بر او، شبیه‌ترین فرزندان آدم به آدم (علیه السلام) در دلالت اسمش بر او بود، خداوند به خلافت او در زمین در قرآن تصریح کرد، همان‌گونه که به خلافت آدم در زمین تصریح نمود. زیرا حروف «آدم» به یکدیگر متصل نیستند و حروف «داوود» نیز چنین است. مگر اینکه آدم با حرف «میم» که اتصال قبلی و بعدی را می‌پذیرد، از داوود متمایز شده است. خداوند آن (میم) را در آخر آورد تا حرف دیگری به آن متصل نشود. و قلب آن (اسم) را یکی از شش حرفی قرار داد که اتصال بعدی را نمی‌پذیرد. پس داوود دو سوم مرتبه آدم را در اسماء گرفت و محمد (صلی الله علیه و سلم) نیز دو سوم آن را گرفت که همان «میم» و «دال» است. با این تفاوت که اسم محمد (صلی الله علیه و سلم) کاملاً متصل است. و حرفی که اتصال بعدی را نمی‌پذیرد، در آخر قرار داده شد تا به آن متصل شود و آن (حرف) به چیزی پس از خود متصل نشود. و این همان سخن پیامبر (صلی الله علیه و سلم) است: «لَوْ كُنْتُ مُتَّخِذًا خَلِيلًا لَاتَّخَذْتُ أَبَا بَكْرٍ خَلِيلًا وَلَكِنْ صَاحِبُكُمْ خَلِيلُ اللَّهِ» (اگر قرار بود دوستی برگزینم، ابوبکر را برمی‌گزیدم، اما صاحب شما خلیل (دوست صمیمی) خداست.)\n\nپس به او متصل می‌شود و او به کسی متصل نمی‌شود. بنابراین محمد (صلی الله علیه و سلم) از دو جهت با آدم (علیه السلام) مناسبت دارد. اول: مناسبت نقیض با اتصال به آدم، در حالی که آدم مانند داوود دارای انفصال است. و «میم» در آدم مانند «دال» در محمد است، از این رو در آخر آمد، یعنی در آخر اسم هر دوی آنها. و دوم: مناسبت نظیر که میان آدم و محمد وجود دارد، از این جهت که حق (الحق) به آدم «وَعَلَّمَ آدَمَ الْأَسْمَاءَ كُلَّهَا» (همه نام‌ها را آموخت) و به محمد (صلی الله علیه و سلم) جوامع الکلم (سخنان جامع) را عطا کرد و رسالت او فراگیر شد، همان‌گونه که تناسل از آدم در ذریه‌اش فراگیر شد. پس مردم فرزندان آدم هستند و مردم امت محمد (صلی الله علیه و سلم) هستند، چه پیشینیان و چه متأخران، زیرا او (صلی الله علیه و سلم) فرمود: «آدم و هر که فروتر از اوست، زیر پرچم من است.»\n\nپس آدم به داوود نگریست، نه به فرزندش، به دلیل آنچه ذکر شد. عمر او را کم شمرد و شصت سال از عمر خود را به او بخشید، که این همان عمر محمد (صلی الله علیه و سلم) است. هنگامی که عمرش به حرف «میم» از اسمش رسید، صورت محمد (صلی الله علیه و سلم) را در «میم» دید، پس از داوود روی گرداند، زیرا از رؤیت «الف» و «دال» جدا شده بود. پس از بخششی که از عمرش به داوود داده بود، بازگشت و زیر پرچم محمد (صلی الله علیه و سلم) درآمد.\n\nاما تصریح حق (الحق) به دو خلافت به طور مشخص در حق آن دو، این است که در مورد خلافت آدم (علیه السلام) می‌فرماید: «إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً» (من در زمین جانشینی قرار خواهم داد) که منظور آدم و فرزندان اوست و فرشتگان را به سجده بر او امر کرد. و در مورد داوود (علیه السلام) می‌فرماید: «يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ» (ای داوود، ما تو را در زمین جانشین قرار دادیم). سپس در مورد او چیزی گفت که در مورد آدم نگفت: «وَلَا تَتَّبِعِ الْهَوَى» (و از هوای نفس پیروی مکن).\n\nو سبب آن این است که در حروف اسم او (داوود) هیچ حرفی از حروف اتصال به طور کامل قرار داده نشده است. هیچ حرفی در اسم او نیست که به حرف دیگری از حروف اسمش متصل شود. پس دانسته شد که امر او در آن تشتت (پراکندگی) دارد، زیرا هر انسانی از اسم خود نصیبی دارد. پس نصیب او از اسمش، همان تشتتی بود که در آن وجود داشت. از این رو خداوند به او توصیه کرد که از هوای نفس پیروی نکند، به دلیل انفراد هر حرف از اسمش به تنهایی. سپس او در حرکاتش به سوی فردیت (تنهایی) وجوهی دارد که سه وجه است و حروف اسمش پنج حرف است، پس او از جمیع جهات فرد است. اگر او قابلیت پذیرش آنچه را که وصیت الهی در آن واقع شد، نداشت، خداوند به او وصیت نمی‌کرد. و چون داوود این را دانست، به واسطه آنچه خداوند از طریق تنبیه در نهی او از پیروی هوای نفس به او آموخت (و نگفت «هوای تو»، یعنی از هوای نفس کسی که به تو اشاره می‌کند پیروی مکن)، و حکم کن به آنچه از حق (الحق) به تو وحی کرده‌ام. زیرا هوای نفس حکمی ندارد مگر با اتصال، و حروف اسم داوود مقتضی اتصال نیست. پس خداوند او را از وجهی خاص حفظ کرد.\n\nپس هنگامی که حق تعالی به او وصیت کرد، از پروردگارش آمرزش خواست، یعنی طلب پوشش (ستر) از خداوند کرد که حائل میان او و هوای گمراه‌کننده باشد تا به او متصل شود و به آن متصف گردد و در حکمی که به واسطه آن فرستاده شده است، تأثیر بگذارد. او در این امر به سوی خدا بازگشت و به اختیار خود به زمین افتاد، پیش از آنکه هواهای نفس او را بیندازند و تأثیر خود را در او بگذارند، مانند تأثیر در دیواری که قائم است. پس رکوع او بازگشت به اصل خود از نفسش بود، و این عین همان پوششی بود که در استغفارش طلبیده بود. هنگامی که هوای نفس آمد، چیزی قائم و ایستاده نیافت که آن را از مسیرش بازگرداند و در آن تأثیر بگذارد، پس از او دور شد و به او آسیبی نرساند. و خداوند او را حفظ کرد و پوشاند.\n\nو ابتلا (آزمایش) چیزی نیست که درجه بنده را نزد خدا پایین آورد، بلکه خداوند جز بهترین‌ها را از بندگانش نمی‌آزماید. پس به واسطه تأویل در این امر، هر که را بخواهد گمراه می‌کند و هر که را بخواهد هدایت می‌کند. «إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَاءُ وَتَهْدِي مَنْ تَشَاءُ أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الْغَافِرِينَ» (این جز آزمایش تو نیست که هر که را بخواهی با آن گمراه می‌کنی و هر که را بخواهی هدایت می‌کنی. تو ولیّ ما هستی، پس ما را بیامرز و بر ما رحم کن و تو بهترین آمرزندگانی.) پس نفس پیامبران نفس واحد است. برخی از بندگان خدا کسانی هستند که خداوند آنان را از گناهان پوشانده است، پس گناهان به آنان نرسیده و آنان را ندیده‌اند. و برخی از بندگان خدا کسانی هستند که خداوند آنان را از مؤاخذه بر گناه می‌پوشاند، و هر یک مقامی معلوم دارند.\n\n***\n\nاگر داوود در حکم خود\nبه حکم هوای نفس از خود گمراه می‌شد\n\nولی او سروری نجیب است\nکه خداوند او را از قدس خود برگزیده است\n\nنوری از ذات او آشکار است\nکه در آن بر نوع خود برتری می‌یابد\n\nپس او به خاطر لغزشی که مرتکب شده بود به زمین نیفتاد\nبلکه به خاطر بازگشت به اصل خود بود\n\nپس داوود در ذات و محبت خود است\nو در محبت او دردی از خورشیدش (نور الهی) است\n\nپس در اندوهش شبیه یعقوب شد\nو در محبوس بودنش شبیه یوسف\n\n***\n\nو بدان که اگر ابتلا (آزمایش) نبود، هر کس هر چه می‌خواست می‌گفت. پس اصل و سبب ابتلا، ادعا است. و برخی از ابتلاها در نهایت خفا (پنهانی) هستند، مانند سخن خداوند متعال: «فَمَا أَصْبَرَهُمْ عَلَى النَّارِ» (چه چیز آنان را بر آتش شکیبا ساخته است؟). و برخی از آنها در نهایت وضوح (جلاء) هستند، مانند سخن او: «وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ» (و قطعاً شما را می‌آزماییم تا مجاهدان و صابران شما را بشناسیم و اخبار شما را بیازماییم). و مانند این را نمی‌شناسد مگر کسی که آشکار و پنهان را بشناسد و بداند که چرا بازگشت صورت می‌گیرد، و آیا پنهانی برای خود وجود دارد یا پنهانی نسبت به ماست. زیرا ما می‌دانیم که «إِنَّ اللَّهَ لَا يَخْفَى عَلَيْهِ شَيْءٌ فِي الْأَرْضِ» (همانا هیچ چیز در زمین بر خدا پوشیده نیست) و او معلوم است. و هر آنچه در طبیعت از اسرار است، صورت‌های آن زمین ارواح است. و نه در «وَلَا فِي السَّمَاءِ» (و نه در آسمان) و او معلوم است. و هر آنچه در ارواحی است که میان طبیعت و عماء (ابر غلیظ) قرار دارند، و این ارواح هستند که این زمین را با انوار خود روشن می‌کنند. پس این را بدان. و خداوند «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را می‌نمایاند)."
  },
  "page_count": 3
}