{
  "id": 383,
  "title": {
    "ar": "الباب الثالث والثمانون وثلاثمائة في معرفة منزل العظمة الجامعة للعظمات المحمدية",
    "en": "Chapter Three Hundred and Eighty-Three: Concerning the Gnosis of the Station (منزل) of Comprehensive Majesty (العظمة الجامعة) for the Muhammadan Majesties.",
    "ur": "تین سو تراسیواں باب: محمدیہ عظمتوں کے لیے جامع عظمت کے منزل (منزل) کی معرفت (معرفۃ) میں۔",
    "fa": "باب سیصد و هشتاد و سوم در معرفت منزل عظمت جامع عظمت‌های محمدیه."
  },
  "content": {
    "ar": "## «الباب الثالث والثمانون وثلاثمائة في معرفة منزل العظمة الجامعة للعظمات المحمدية»\n\n\n> إن العظيم إذا عظمته نزلا *** وإن تعاظمت جلت ذاته فعلا\n\n\n> فهو الذي أبطل الأكوان أجمعها *** من باب غيرته وهو الذي فعلا\n\n\n> وليس يدرك ما قلنا سوى رجل *** قد جاوز الملأ العلوي والرسلا\n\n\n> وهام فيمن يظن الخلق أجمعه *** تحصيله وسها عن نفسه وسلا\n\n\n> ذاك الرسول رسول الله أحمدنا *** رب الوسيلة في أوصافه كملا\n\n\n### [حكم صاحب الزمان والأوتاد والأبدال‏]\n\n\nاعلم أن لهذا المنزل أربعة عشر حكما الأول يختص بصاحب الزمان والثاني والثالث يختص بالإمامين والرابع والخامس والسادس والسابع يختص بالأوتاد والثامن والتاسع والعاشر والأحد عشر والأحد عشر والاثنا عشر والثالث عشر والرابع عشر يختص بالأبدال وبهذه الأحكام يحفظ الله عالم الدنيا فمن علم هذا المنزل علم كيف يحفظ الله الوجود على عالم الدنيا ونظيره‏\nمن الطب علم تقويم الصحة كما أنه بالأبدال تنحفظ الأقاليم وبالأوتاد ينحفظ الجنوب والشمال والمغرب والمشرق وبالإمامين ينحفظ عالم الغيب الذي في عالم الدنيا وعالم الشهادة وهو ما أدركه الحس وبالقطب ينحفظ جميع هؤلاء فإنه الذي يدور عليه أمر عالم الكون والفساد وهؤلاء على قلب أربعة عشر نبيا وهم آدم وإدريس ونوح وإبراهيم ويوسف وهود وصالح وموسى وداود وسليمان ويحيى وهارون وعيسى ومحمد سلام الله عليهم وعَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ ولكل واحد ممن ذكرنا طريق يخصه وعلم ينصه وخبر يقصه ويرثه من ذكرناه ممن ليست له نبوة التشريع وإن كانت له النبوة العامة فلنذكر من ذلك ما تيسر فإنه يطول الشرح فيه ويتفرع إلى ما لا يكاد أن ينحصر ولهم من الأسماء الإلهية الله والرب والهادي والرحيم والرحمن والشافي والقاهر والمميت والمحيي والجميل والقادر والخالق والجواد والمقسط كل اسم إلهي من هذه ينظر إلى قلب نبي ممن ذكرنا وكل نبي يفيض على كل وارث فالنبي كالبرزخ بين الأسماء والورثة ولهم من حروف المعجم حروف أوائل السور وهي الألف واللام والميم والصاد والراء والكاف والهاء والياء والعين والطاء والسين والحاء والقاف والنون هذا لهم من حيث الإمداد الإلهي الذي يأتيهم في قلوبهم وإنما الذي يأتيهم من الحروف في صور خيالهم بالإمداد أيضا فالدال فالذال والعين والنون والصاد والراء والألف والطاء والحاء والواو والضاد والغين واللام والميم والتاء والكاف والباء والسين والقاف والياء والهاء والحرف المركب من لام ألف الذي هو للحروف بمنزلة الجوهر وهذه الحروف من عالم الأنفاس الإلهية وما تركب من الكلمات من هذه الحروف خاصة مما وقع عليها الاصطلاح في كل لسان بما تكون به الفائدة في ذلك اللسان فإن تلك الكلمات لها على ما قيل لي خواص في العالم ليست لسائر الكلم وأما الأرواح النورية فعين لهؤلاء الأنبياء منهم أربعة عشر روحا من أمر الله ينزلون من الأسماء التي ذكرناها الإلهية على قلوب الأنبياء وتلقيها حقائق الأنبياء عليه السلام على قلوب من ذكرناه من الورثة ويحصل للفرد الواحد من الأفراد وراثة الجماعة المذكورة فيأخذون علم الورث من طريق المذكورين من الأرواح الملكية والأنبياء البشريين ويأخذون بالوجه الخاص من الأسماء الإلهية علوما لا يعلمها من ذكرناه سوى محمد صَلَّى اللهُ عَليهِ وسَلَّم فإن له هذا العلم كله لأنه أخبر أنه قد علم علم الأولين وعلم الآخرين اعلم أن لله كنوزا في الطبيعة التي تحت عرش العماء اكتنز فيها أمورا فيها سعادة العباد كاختزان الذهب في المعدن وصور هذه الكنوز صور الكلمات المركبة من الحروف اللفظية فلا تظهر إذا أراد الله إظهارها إلا على ظهر أرض أجسام البشر على ألسنتهم وإنفاقها والانتفاع بها عين التلفظ بها مثل قول الإنسان لا حول ولا قوة إلا بالله العلي العظيم فهذه الكلمات من الكنوز المنصوص عليها من الله على لسان رسوله صَلَّى اللهُ عَليهِ وسَلَّم وأول ما أظهرها الله تعالى على لسان آدم عليه السلام فهو أول من أنفق من هذا الكنز في الطواف بالكعبة حين‏\n\n\nأنزله جبريل فطاف به بالكعبة فسأله ما كنتم تقولون في طوافكم بهذا البيت فقال جبريل عليه السلام كنا نقول في طوافنا بهذا البيت سبحان الله والحمد لله ولا إله إلا الله والله أكبر فأعطى الله آدم وبنيه من حيث لا تعلمه الملائكة كلمة لا حول ولا قوة إلا بالله العلي العظيم فقال آدم لجبريل عليه السلام وأزيدكم أنا لا حول ولا قوة إلا بالله العلي العظيم فبقيت سنة في الذكر في الطواف لبنيه ولكل طائف به إلى يوم القيامة فأخبر رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أن هذه الكلمة أعطيها آدم عليه السلام من كنز من تحت العرش‏\n\n\nفالكنوز المكتنزة تحت العرش إنما هي مكتنزة في نشأتنا فإذا أراد الله إظهار كنز منها أظهره على ألسنتنا وجعل ذلك قربة إليه فانفاقه النطق به وهكذا جميع ما اكتنزه مما فيه قربة وما ليس بقربة فما هو مكتنز بل يخلق في الوقت في لسان العبد وكانت صورة اختزانه إذ لا يختزن إلا أمر وجودي أن الله لما أراد إيجاد هذا المكتنز تجلى في صورة آدمية ثم تكلم بهذا الأمر الذي يريد أن يكتنزه لنا أو لمن شاء من خلقه فإذا تكلم به أسمعه ذلك المكان الذي يختزنه فيه فيمسك عليه فإذا أنشأ الله ذلك المكان صورة ظهر هذا الكنز في نطق تلك الصورة فانتفع بظهوره عند الله ثم لم يزل ينتقل في السنة الذاكرين به دائما أبدا ولم يكن كنزا إلا فيمن ظهر منه ابتداء لا في كل من ظهر منه بحكم الانتقال والحفظ وهكذا\nكل من سن سنة حسنة ابتداء من غير تلقف من أحد مخلوق إلا من الله إليه فتلك الحسنة كنز اكتنزها الله في هذا العبد من الوجه الخاص ثم نطق بها العبد لإظهارها كالذي ينفق ماله الذي اختزنه في صندوقه فهذا صورة الاكتناز إن فهمت فلا يكون اكتنازا إلا من الوجه الخاص الإلهي وما عدا ذلك فليس باكتناز فأول ناطق به هو محل الاكتناز الذي اكتنزه الله فيه وهو في حق من تلقفه منه ذكر مقرب كان موصوفا بأنه كنز فهذه كلها رموزه لأنها كلها كنوزه وبعد أن أعلمتك بصورة الكنز والاكتناز وكيفية الأمر في ذلك لتعلم ما أنت كنز له أي محل لاكتنازه مما لست بمحل له إذا تلقنته أو تلقفته من غيرك فتعلم عند ذلك حظك من ربك وما خصك به من مشارب النبوة فتكون عند ذلك على بينة من ربك فيما تعبده به ولا تكون فيما أنت محل لاكتنازه وارثا بل تكون موروثا فتحقق ما ترثه وما يورث منك ومن هذا الباب‏\n\n\nمسألة بلال الذي نص عليها لنا رسول الله صَلَّى اللهُ عَليهِ وسَلَّم في قوله له بم سبقتني إلى الجنة\n\n\nيستفهمه إذ علم أن السبق له صَلَّى اللهُ عَليهِ وسَلَّم فلما ذكر له ما نص لنا قال بهما أي بتينك الحالتين فمن عمل على ذلك كان له أجر العمل ولبلال أجر التسنين وأجر عملك معا فهذا فائدة كون الإنسان محلا للاكتناز وأما تسنين الشر فليس باكتناز إلهي وإنما هو أمر طبيعي‏\n\n\nفإن النبي صَلَّى اللهُ عَليهِ وسَلَّم يقول معلما لنا والخير كله بيديك‏\n\n\nأي أنت الذي اكتنزته في عبادك فهو بجعلك فيهم واختزانك ولذلك يكون قربة إليك العمل به‏\n\n\nثم قال والشر ليس إليك‏\n\n\nأي لم تختزنه في عبادك وهو قوله تعالى ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله أي التعريف بذلك من عند الله والحكم بأن هذا من الله وهذا من نفسك وهذا خير وهذا شر هذا معنى كل من عند الله ولهذا قال في حق من جهل الذي ذكرناه منهم فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً أي ما لهم لا يفقهون ما حدثتهم به فإني قد قلت ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ فرفعت الاحتمال أو نصصت على الأمر بما هو عليه فلما قلت كُلٌّ من عِنْدِ الله يعلم العالم بالله أني أريد الحكم والإعلام بذلك أنه من عند الله لا عين السوء ولما علم ذلك رسول الله صَلَّى اللهُ عَليهِ وسَلَّم قال والخير كله بيديك والشر ليس إليك‏\n\n\nوكذلك قوله تعالى ونَفْسٍ وما سَوَّاها فَأَلْهَمَها فُجُورَها إنه فجور وتَقْواها إنه تقوى ليفصل بين الفجور والتقوى إذ هي محل لظهور الأمرين فيها فربما التبس عليها الأمر وتخيلت فيه أنه كله تقوى فعلمها الله فيما ألهمها ما يتميز به عندها الفجور من التقوى ولذا جاء بالإلهام ولم يجي‏ء بالأمر ف إِنَّ الله لا يَأْمُرُ بِالْفَحْشاءِ والفجور فحشاء فالذكر للأصل وهو القطب والتحميدان أعني تحميد السراء والضراء لما انقسم التحميد بلسان الشرع بين قوله في السراء الحمد لله المنعم المفضل وبين قوله في الضراء الحمد لله على كل حال وما له في الكون إلا حالة تسر أو حالة تضر ولكل حالة تحميد فقسمها كذا على الإمامين فهؤلاء ثلاثة قد بينت مراتبهم ولما كانت الجهات التي يأتي منها الشيطان إلى الإنسان أربعة وهي قوله تعالى لنا في كتابه عن إبليس ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ وقام على كل جهة من هذه الجهات من يحفظ إيمانه منها جعل الأوتاد أربعة للزومهم هذه الجهات لكل وتد جهة أي الغالب عليه حفظ تلك الجهة خاصة وإن كان له حفظ لسائر الجهات‏\n\n\nكأفرضكم زيد وأقضاكم علي‏\n\n\nوكالجماعة تحمل ما لا يقدر الواحد على حمله إذا انفرد به فلكل واحد من الجماعة قوة في حمله وأغلب قوته حمل ما يباشره من ذلك المحمول فلو لا الجماعة ما انتقل هذا المحمول لأن كل واحد واحد لا يقدر على حمله فبالمجموع كان الحمل كذلك هذا الأمر فهذه سبعة وأما الأبدال فلهم حفظ السبع الصفات في تصريف صاحبها لها إذ لها تصرف في الخير وتصرف في الشر فتحفظ على صاحبها تصريف الخير وتقيه من تصريفها في الشر فهذه جملة الأربعة عشر التي ذكرناها لقوم يعقلون من المؤمنين إذا أنصفوا ومن حصل له حفظ ما ذكرناه فذلك المعصوم وتلك العصمة ما ثم غير هذين في الظاهر والباطن والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ وإذا علمت هذا وانفتح لك مقفلة مشيت لكل واحد من الذي عينا لك على ما له مما ذكرناه من الأسماء الإلهية والحروف الرقمية المعينة والأفهام الموروثة من النبيين المذكورين والأرواح النورية فيحصل لك ذوقا جميع ما ذكرناه وكشفا لمعناه فلا تغفل عن استعماله وفي هذا المنزل من العلوم علم الأذكار المقربة إلى الله تعالى وعلم الأسماء الإلهية وعلم‏\nاختصاص الرحمة وشمولها وعلم الأسماء المركبة التي لله وعلم عواقب الأمور وعلم العالم وعلم مراتب السيادة في العالم وعلم الثناء بالثناء وعلم الملك والملكوت وعلم الزمان وعلم الجزاء وعلم الاستناد وعلم التعاون وعلم العبادة وعلم البيان والتبيين وعلم طرق السعادة وعلم النعمة والمنعم والإنعام وعلم أسباب الطرد عن السعادة التي لا يشوبها بها شقاء وعلم الحيرة والمتحيرين وعلم السائل والمجيب وعلم التعريف بالذات والإضافة وأي التعريفين أقوى هذه أمهات العلوم التي يحوي عليها هذا المنزل وكل علم منها فتفاصيله لا تنحصر إلا لله تعالى أي يعلم مع علمه بها أنها لا تنحصر لأنها لا نهاية لها ومنها تقع الزيادة في العلم لمن طلبها ومن أعطيها من غير طلب وهو قوله وقُلْ رَبِّ زِدْنِي عِلْماً فإن تناهي العلم في نفسه فإن المعلوم لا ينتهي‏\n\n\n> وقد نهيت النفس عن قولها *** بالانتهاء فيه فلم تنته‏\n\n\n> لجهلها بالأمر في نفسه *** لذاك قالت إنه ينتهي‏\n\n\n> وقد رأينا نفرا منهم *** بمكة يجول في مهمه‏\n\n\n> قد حكمت أوهامهم فيهم *** فانحاز ذو اللب من الأبله‏\n\n\n### [عالم الإنسان كان ملكا لله تعالى‏]\n\n\nواعلم أن عالم الإنسان لما كان ملكا لله تعالى كان الحق تعالى ملكا لهذا الملك بالتدبير فيه وبالتفصيل ولهذا وصف نفسه تعالى بأن لِلَّهِ جُنُودُ السَّماواتِ والْأَرْضِ وقال وما يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ فهو تعالى حافظ هذه المدينة الإنسانية لكونها حضرته التي وسعته وهي عين مملكته وما وصف نفسه بالجنود والقوة إلا وقد علم أنه تعالى قد سبقت مشيئته في خلقه أن يخلق له منازعا ينازعه في حضرته ويثور عليه في ملكه بنفوذ مشيئته فيه وسابق علمه وكلمته التي لا تتبدل سماه الحارث وجعل له خيلا ورجلا وسلطه على هذا الإنسان فاجلب هذا العدو على هذا الملك الإنساني يخيله ورجله ووعده بالغرور وبسفراء خواطره التي تمشي بينه وبين الإنسان فجعل الله في مقابلة أجناده أجناد ملائكته فلما تراءى الجمعان وهو في قلب جيشه جعل له ميمنة وميسرة وتقدمة وساقة وعرفنا الله بذلك لنأخذ حذرنا منه من هذه الجهات فقال الله تعالى لنا إنه قال هذا العدو ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ وهو في قلب جيشه في باطن الإنسان فحفظ الله هذا الملك الإنساني بأن كان الله في قلب هذا الجيش وهذا العسكر الإنساني في مقابلة قلب جيش الشيطان وجعل على ميمنته الاسم الرب وعلى ميسرته الاسم الملك وعلى تقدمته الاسم الرحمن وفي ساقته الاسم الرحيم وجعل الاسم الهادي يمشي برسالة الاسم الرحمن الذي في المقدمة إلى هذا الشيطان وما هو شيطان الجان وإنما أعني به شيطان الإنس فإن الله يقول شَياطِينَ الْإِنْسِ والْجِنِّ وقال من شَرِّ الْوَسْواسِ الْخَنَّاسِ الَّذِي يُوَسْوِسُ في صُدُورِ النَّاسِ من الْجِنَّةِ والنَّاسِ فإن شياطين الإنس لهم سلطان على ظاهر الإنسان وباطنه وشياطين الجن هم نواب شياطين الإنس في بواطن الناس وشياطين الجن هم الذين يدخلون الآراء على شياطين الإنس ويدبرون دولتهم فيفصلون لهم ما يظهرون فيها من الأحكام ولا يزال القتال يعمل على هذا الإنسان المؤمن خاصة فيقاتل الله عنه ليحفظ عليه إيمانه ويقاتل عليه إبليس ليرده إليه ويسلب عنه الايمان ويخرجه عن طريق سعادته حسدا منه فإنه إذا أخرجه تَبَرَّأَ مِنْهُ وجثا بين يدي ربه الذي هو مقدم صاحب الميمنة ويجعله سفيرا بينه وبين الاسم الرحمن وعرفنا الله بذلك كله لنعرف مكايد فهو يقول للإنسان بما يزين له أكفر فإذا كفر يقول له إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ فَكانَ عاقِبَتَهُما أَنَّهُما في النَّارِ خالِدَيْنِ فِيها لأن الكفر هنا هو الشرك وهو الظلم العظيم ولذلك قال وذلِكَ جَزاءُ الظَّالِمِينَ يريد المشركين فإنهم الذين لبسوا إيمانهم بظلم وفسره رسول الله صَلَّى اللهُ عَليهِ وسَلَّم بما قاله لقمان لابنه يا بُنَيَّ لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ فعلمنا بهذا التفسير أن الله أراد بالإيمان هنا في قوله ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ إنه الايمان بتوحيد الله لأن الشرك لا يقابله إلا التوحيد فعلم النبي صَلَّى اللهُ عَليهِ وسَلَّم ما لم تعلمه الصحابة ولهذا ترك التأويل من تركه من العلماء ولم يقل به واعتمد على الظاهر وترك ذلك لله إذ قال وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله فمن أعلمه الله بما أراده في قوله علمه بإعلام الله لا بنظره ومن رحمة الله بخلقه أنه غفر للمتأولين من أهل ذلك اللسان العلماء به إذا\nأخطئوا في تأويلهم فيما تلفظ به رسولهم إما فيما ترجمه عن الله وإما فيما شرع له أن يشرعه قولا وفعلا وليس في المنازل الإلهية كلها على كثرتها ما ذكرنا منها في هذا الكتاب وما لم نذكر من يعطي النصاف ويؤدي الحقوق ولا يترك عليه حجة لله ولا لخلقه فيوفي الربوبية حقها والعبودية حقها وما ثم إلا عبد ورب إلا هذا المنزل خاصة هكذا أعلمنا الله بما ألهمه أهل طريق الله الذي جرت به العادة أن يعلم الله منه ورثة أنبيائه وهو منزل غريب عجيب أوله يتضمن كله وكله يتضمن جميع المنازل كلها وما رأيت أحدا تحقق به سوى شخص واحد مكمل في ولايته لقيته بإشبيلية وصحبته وهو في هذا المنزل وما زال عليه إلى أن مات رحمه الله وغير هذا الشخص فما رأيته مع أني ما أعرف منزلا ولا نحلة ولا ملكة إلا رأيت قائلا بها ومعتقدا لها ومنصفا بها باعترافه من نفسه فما أحكي مذهبا ولا نحلة إلا عن أهلها القائلين بها وإن كنا قد علمناها من الله بطريق خاص ولكن لا بد أن يرينا الله قائلا بها لنعلم فضل الله علي وعنايته بي حتى أني أعلمت أن في العالم من يقول بانتهاء علم الله في خلقه وأن الممكنات متناهية وأن الأمر لا بد أن يلحق بالعدم والدثور ويبقي الحق حقا لنفسه ولا عالم فرأيت بمكة من يقول بهذا القول وصرح لي به معتقدا له من أهل السوس من بلاد الغرب الأقصى حج معنا وخدمنا وكان يصر على هذا المذهب حتى صرح به عندنا وما قدرت على رده عنه ولا أدري بعد فراقه إيانا هل رجع عن ذلك أو مات عليه وكان لديه علوم جمة وفضل إلا أنه لم يكن له دين وإنما كان يقيمه صورة عصمة لدمه هذا قوله لي ويعطيه مذهبه وليس في مراتب الجهل أعظم من هذا الجهل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر السابع والعشرون بانتهاء الباب الثالث والثمانين وثلاثمائة وحَسْبُنَا الله ونِعْمَ الْوَكِيلُ‏\n\n\nبسم الله الرحمن الرحيم‏\n\n",
    "en": "Chapter Three Hundred and Eighty-Three: Concerning the Knowledge of the Station of Comprehensive Greatness for the Muhammadan Greatnesses.\n\nThe Great One (العظيم), if you magnify Him, He descends,\nAnd if you become great, His Essence (الذات) is exalted in Act.\n\nHe is the One who nullifies all the universes (الأكوان) entirely,\nFrom the door of His jealousy (غيرة), and He is the One who acts.\n\nAnd none comprehends what we have said except a man\nWho has surpassed the High Assembly (الملأ العلوي) and the Messengers.\n\nAnd he wanders in the one whom all creation imagines\nTo be his attainment, and he forgets himself and is consoled.\n\nThat is the Messenger, the Messenger of Allah, our Ahmad,\nThe Lord of the Means (رب الوسيلة), perfected in his attributes.\n\n### [The Rule of the Master of the Time, the Pegs, and the Substitutes]\n\nKnow that this Station (منزل) has fourteen rulings (حكم). The first is specific to the Master of the Time (صاحب الزمان). The second and third are specific to the two Imams (الإمامين). The fourth, fifth, sixth, and seventh are specific to the Pegs (الأوتاد). The eighth, ninth, tenth, eleventh, twelfth, thirteenth, and fourteenth are specific to the Substitutes (الأبدال). By means of these rulings, Allah preserves the world of this life (عالم الدنيا). Whoever knows this Station knows how Allah preserves Existence (الوجود) in the world of this life. Its parallel in medicine is the science of maintaining health.\n\nJust as the regions (الأقاليم) are preserved by the Substitutes (الأبدال), and the South, North, West, and East are preserved by the Pegs (الأوتاد), and the world of the Unseen (عالم الغيب) within the world of this life and the world of Witnessing (عالم الشهادة)—which is what the senses perceive—are preserved by the two Imams (الإمامين), so too is the entirety of these preserved by the Pole (القطب), for he is the one around whom the affair of the world of Generation and Corruption (عالم الكون والفساد) revolves.\n\nThese individuals are upon the heart of fourteen Prophets: Adam, Idris, Noah, Abraham, Joseph, Hud, Salih, Moses, David, Solomon, Yahya, Aaron, Jesus, and Muhammad—peace of Allah be upon them and upon the Messengers, and praise be to Allah, Lord of the Worlds. Each one of those we mentioned has a specific path, a knowledge that is explicitly stated for him, and a report that he relates, which he inherits from the Prophet we mentioned—those who do not possess the Prophethood of Legislation (نبوة التشريع), even if they possess the General Prophethood (النبوة العامة). Let us mention what is facilitated of this, for the explanation is lengthy and branches out into what can scarcely be enumerated.\n\nThey possess the following Divine Names (الأسماء الإلهية): Allah, the Lord (الرب), the Guide (الهادي), the Compassionate (الرحيم), the Merciful (الرحمن), the Healer (الشافي), the Subduer (القاهر), the Giver of Death (المميت), the Giver of Life (المحيي), the Beautiful (الجميل), the Powerful (القادر), the Creator (الخالق), the Generous (الجواد), and the Equitable (المقسط). Each of these Divine Names looks upon the heart of one of the Prophets we mentioned, and each Prophet pours forth (يفيض) upon each heir (وارث). Thus, the Prophet is like the Isthmus (البرزخ) between the Names and the heirs.\n\nThey possess, from the letters of the alphabet, the initial letters of the Surahs: الألف, اللام, الميم, الصاد, الراء, الكاف, الهاء, الياء, العين, الطاء, السين, الحاء, القاف, and النون. This is theirs in terms of the Divine Sustenance (الإمداد الإلهي) that comes to their hearts. However, what comes to them from the letters in the forms of their Imagination (خيالهم) through Sustenance are: الدال, الذال, العين, النون, الصاد, الراء, الألف, الطاء, الحاء, الواو, الضاد, الغين, اللام, الميم, التاء, الكاف, الباء, السين, القاف, الياء, الهاء, and the compound letter لام ألف, which holds the rank of the essence (الجوهر) for the letters. These letters are from the world of the Divine Breaths (الأنفاس الإلهية). And the words composed of these specific letters, which have been conventionally agreed upon in every language to bring benefit in that language—for those words, as I was told, possess properties (خواص) in the world that other words do not.\n\nAs for the Luminous Spirits (الأرواح النورية), they are the very essence of these Prophets. Fourteen spirits from the Command of Allah (أمر الله) descend from the Divine Names we mentioned upon the hearts of the Prophets. The realities (حقائق) of the Prophets, peace be upon them, receive them upon the hearts of the heirs we mentioned. The single individual (الفرد الواحد) among the individuals may attain the inheritance of the entire group mentioned. They receive the knowledge of inheritance through the aforementioned angelic spirits (الأرواح الملكية) and human Prophets. And they receive, through the specific aspect of the Divine Names, knowledges that none of those we mentioned know, except Muhammad, peace and blessings of Allah be upon him, for he possesses all this knowledge, as he informed us that he knew the knowledge of the first ones and the knowledge of the last ones.\n\nKnow that Allah has treasures (كنوز) in the Nature (الطبيعة) that is beneath the Throne of the Cloud ('Arsh al-'Ama'), wherein He has stored matters that contain the happiness of the servants, like the storage of gold in a mine. The forms of these treasures are the forms of the words composed of verbal letters. When Allah wills their manifestation, they only appear upon the surface of the earth of human bodies, upon their tongues, and spending them and benefiting from them is the very act of uttering them, such as a person saying: *La hawla wa la quwwata illa billah al-'Aliyy al-'Azim* (There is no might nor power except with Allah, the High, the Great). These words are among the treasures explicitly mentioned by Allah upon the tongue of His Messenger, peace and blessings of Allah be upon him.\n\nThe first person upon whose tongue Allah manifested them was Adam, peace be upon him. He was the first to spend from this treasure during the circumambulation (Tawaf) of the Ka'ba, when Gabriel brought him down and circumambulated with him around the Ka'ba. He asked him, \"What did you used to say during your circumambulation of this House?\" Gabriel, peace be upon him, said, \"We used to say during our circumambulation of this House: *Subhan Allah, wal-Hamdu Lillah, wa la ilaha illa Allah, wa Allahu Akbar* (Glory be to Allah, and praise be to Allah, and there is no god but Allah, and Allah is Greater).\" Then Allah gave Adam and his children, in a way the angels did not know, the phrase *La hawla wa la quwwata illa billah al-'Aliyy al-'Azim*. Adam said to Gabriel, peace be upon him, \"And I will add for you: *La hawla wa la quwwata illa billah al-'Aliyy al-'Azim*.\" This remained a tradition (sunna) in the remembrance during the circumambulation for his children and for everyone who circumambulates it until the Day of Resurrection. The Messenger of Allah, peace and blessings of Allah be upon him, informed us that this phrase was given to Adam, peace be upon him, from a treasure beneath the Throne.\n\nThe treasures stored beneath the Throne are only stored in our constitution (نشأتنا). If Allah wills the manifestation of one of these treasures, He manifests it upon our tongues and makes that an act of proximity (qurba) to Him. Thus, spending it is uttering it. This is the case for everything He has stored that involves proximity, and also what does not involve proximity—for that is not stored, but rather created instantly upon the servant's tongue. The form of its storage (since only an existent matter can be stored) was that when Allah willed the existence of this stored matter, He disclosed Himself (تجلى) in a human form, and then spoke this matter which He intended to store for us or for whomever He willed of His creation. When He spoke it, He made the place where He stores it hear it, and it holds onto it. When Allah creates the form of that place, this treasure appears in the utterance of that form, and benefit is derived from its manifestation in the sight of Allah. Then it continuously transfers onto the tongues of those who remember it, always and forever. It was only a treasure in the one from whom it first appeared, not in everyone from whom it appeared by way of transfer and preservation. Likewise, anyone who initiates a good tradition (سن سنة حسنة) without receiving it from any created being, but directly from Allah to him—that good deed is a treasure that Allah stored in this servant from the specific Divine aspect. Then the servant utters it to manifest it, like one who spends his wealth that he stored in his box. This is the form of treasuring (الاكتناز), if you understand it. It is only treasuring from the specific Divine aspect; anything else is not treasuring. The first one who utters it is the locus of the treasuring (محل الاكتناز) in which Allah stored it. For the one who receives it from him, it is a proximate remembrance that was described as a treasure. All of these are symbols (رموزه) because they are all His treasures (كنوزه).\n\nAfter I have informed you of the form of the treasure and the treasuring, and the nature of the matter therein, so that you may know what you are a treasure for—that is, the locus of its storage—and what you are not a locus for, if you are taught it or receive it from another. You will then know your lot from your Lord and what He has specifically granted you from the springs of Prophethood (مشارب النبوة). You will then be upon clear evidence from your Lord concerning what you worship Him with. And in what you are the locus of treasuring, you are not an heir (وارث) but rather inherited from (موروث). Thus, realize what you inherit and what is inherited from you.\n\nFrom this chapter is the matter of Bilal, which the Messenger of Allah, peace and blessings of Allah be upon him, explicitly mentioned to us in his saying to him, \"By what did you precede me to Paradise?\" He was asking him, knowing that the precedence belonged to him, peace and blessings of Allah be upon him. When Bilal mentioned what he had explicitly stated to us, the Prophet said, \"By those two states.\" Whoever acts upon that receives the reward for the action, while Bilal receives the reward for establishing the tradition (التسنين) and the reward for your action combined. This is the benefit of a person being the locus of treasuring. As for establishing an evil tradition (تسنين الشر), it is not a Divine treasuring; rather, it is a natural matter.\n\nThe Prophet, peace and blessings of Allah be upon him, says, teaching us: \"And all good is in Your hands.\" Meaning, You are the One who stored it (اكتنزته) in Your servants. It exists by Your placing it in them and Your storing it. Therefore, acting upon it becomes an act of proximity to You. Then he said: \"And evil is not attributed to You.\" Meaning, You did not store it in Your servants. This relates to the saying of the Exalted: <<مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ>> (Whatever good befalls you is from Allah), meaning the definition of that is from Allah, and the judgment that 'this is from Allah' and 'this is from yourself,' and 'this is good' and 'this is evil.' This is the meaning of <<كُلٌّ مِنْ عِنْدِ اللَّهِ>> (All is from Allah). For this reason, He said concerning those who are ignorant of what we mentioned: <<فَمَا لِهَؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا>> (What is wrong with these people that they hardly understand a statement?), meaning, why do they not understand what I told them? For I have said: <<مَا أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللَّهِ وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ>> (Whatever good befalls you is from Allah, and whatever evil befalls you is from yourself). Thus, I removed the ambiguity or explicitly stated the matter as it is. When I said <<كُلٌّ مِنْ عِنْدِ اللَّهِ>> (All is from Allah), the one who knows Allah understands that I intend the ruling (الحكم) and the declaration that it is from Allah, not the essence of the evil (عين السوء). When the Messenger of Allah, peace and blessings of Allah be upon him, knew this, he said, \"And all good is in Your hands, and evil is not attributed to You.\"\n\nLikewise, His saying, the Exalted: <<وَنَفْسٍ وَمَا سَوَّاهَا * فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا>> (And [by] the soul and [by] Him who proportioned it * And inspired it [with discernment of] its folly and its piety). He mentions its folly (فجورها) and its piety (تقواها) to distinguish between folly and piety, since the soul is the locus for the manifestation of both matters within it. Perhaps the matter becomes confused for the soul, and it imagines that all of it is piety. So Allah teaches it, through what He inspires in it, that by which folly is distinguished from piety in its view. Therefore, the term *inspiration* (الإلهام) was used, and not *command* (الأمر), for <<إِنَّ اللَّهَ لَا يَأْمُرُ بِالْفَحْشَاءِ>> (Indeed, Allah does not command immorality), and folly (الفجور) is immorality (فحشاء).\n\nThe remembrance (الذكر) is for the Origin (الأصل), which is the Pole (القطب). The two praises (التحميدان)—meaning the praise in ease and the praise in hardship—are divided between the two Imams (الإمامين), based on the legal division of praise between His saying in ease, \"Praise be to Allah, the Benefactor, the Fulfiller of Grace,\" and His saying in hardship, \"Praise be to Allah in every state.\" The cosmos has only a state that brings joy or a state that brings harm, and for each state there is a praise. Thus, He divided them between the two Imams. These are three whose ranks I have clarified.\n\nSince the directions from which Satan comes to man are four, as stated by the Exalted in His Book concerning Iblis: <<ثُمَّ لَآتِيَنَّهُمْ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمَانِهِمْ وَعَنْ شَمَائِلِهِمْ>> (Then I will surely come to them from before them and from behind them and on their right and on their left), and since there is one standing guard over each of these directions to preserve the believer's faith from it, He made the Pegs (الأوتاد) four, due to their adherence to these directions, with each Peg having a direction—meaning, his primary focus is the preservation of that specific direction, even though he preserves the other directions as well. This is like the saying, \"The most ascetic of you is Zayd, and the best judge among you is Ali.\" And like a group carrying what a single person cannot carry alone. Each member of the group has strength in carrying it, but the majority of his strength is focused on the part of the load he directly handles. Were it not for the group, this load would not be moved, because no single person could carry it. The carrying was achieved by the collective, and this matter is similar.\n\nThese are seven. As for the Substitutes (الأبدال), they are responsible for preserving the seven Attributes (الصفات) in the disposition (تصريف) of their possessor, since these Attributes have a disposition in good and a disposition in evil. They preserve for their possessor the disposition of good and protect him from their disposition in evil. This is the summary of the fourteen we mentioned for a people among the believers who understand, if they are fair-minded. Whoever achieves the preservation of what we mentioned, that is the protected one (المعصوم), and that is the infallibility ('Isma). There is nothing else besides these two, outwardly and inwardly. And Allah is <<بِكُلِّ شَيْءٍ عَلِيمٌ>> (All-Knowing of everything).\n\nIf you know this and the lock is opened for you, you will walk toward each one of those we specified for you, according to what belongs to him of the Divine Names (الأسماء الإلهية), the specific numerical letters (الحروف الرقمية المعينة), the inherited understandings (الأفهام الموروثة) from the mentioned Prophets, and the Luminous Spirits (الأرواح النورية). You will then attain, by taste (ذوقا) and by unveiling (كشفا) of its meaning, everything we mentioned. So, do not neglect its application.\n\nIn this Station are the sciences of the remembrances (الأذكار) that bring proximity to Allah the Exalted, the science of the Divine Names, the science of the specificity and comprehensiveness of Mercy, the science of the compound Names that belong to Allah, the science of the consequences of matters, the science of the World (العالم), the science of the degrees of sovereignty (السيادة) in the World, the science of praise by praise, the science of the Dominion (الملك) and the Kingdom (الملكوت), the science of Time (الزمان), the science of Recompense (الجزاء), the science of Reliance (الاستناد), the science of Mutual Assistance (التعاون), the science of Worship (العبادة), the science of Elucidation and Clarification (البيان والتبيين), the science of the paths to happiness, the science of Grace (النعمة), the Benefactor (المنعم), and the Bestowal of Grace (الإنعام), the science of the causes of expulsion from happiness that is not tainted by misery, the science of bewilderment (الحيرة) and the bewildered, the science of the questioner and the answerer, and the science of definition by Essence (الذات) and by Relation (الإضافة), and which of the two definitions is stronger. These are the mothers of the sciences (أمهات العلوم) contained within this Station. The details of each of these sciences are innumerable except by Allah the Exalted—meaning, He knows, along with His knowledge of them, that they are without limit, because they have no end. From them comes the increase in knowledge for whoever seeks it, or for whoever is given it without seeking, which is His saying: <<وَقُلْ رَبِّ زِدْنِي عِلْمًا>> (And say, \"My Lord, increase me in knowledge\"). For even if knowledge itself reaches its limit, the known (المعلوم) does not end.\n\nAnd I forbade the soul from its saying\nThat there is an end to it, but it did not cease.\n\nDue to its ignorance of the matter in itself,\nFor that reason, it said that it ends.\n\nAnd we saw a group of them\nIn Mecca wandering in a desolate place.\n\nTheir delusions (أوهامهم) ruled over them,\nSo the possessor of intellect (ذو اللب) separated himself from the fool.\n\n### [The World of Man was a Dominion of Allah the Exalted]\n\nKnow that since the world of man (عالم الإنسان) was a dominion (ملك) belonging to Allah the Exalted, the Real (الحق) was the King (ملك) of this dominion through His governance (التدبير) within it and through detailed manifestation. For this reason, He described Himself, the Exalted, by saying: <<وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ>> (And to Allah belong the soldiers of the heavens and the earth), and He said: <<وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ>> (And none knows the soldiers of your Lord except Him). He, the Exalted, is the preserver of this human city (المدينة الإنسانية) because it is His Presence (حضرته) that contained Him, and it is the very essence of His kingdom (مملكته). He only described Himself with soldiers and power because He knew that His Will (مشيئته) had preceded in His creation to create an adversary (منازع) who would contend with Him in His Presence and revolt against Him in His dominion by the penetration of His Will into him and by His prior Knowledge and His Word (كلمته) that does not change. He named him Al-Harith and gave him cavalry and infantry, and granted him authority over this human being. This enemy incites this human dominion with his cavalry and infantry, promising him delusion (الغرور) and through the envoys of his thoughts (خواطره) that move between him and man.\n\nAllah placed His angelic soldiers in opposition to the enemy's soldiers. When the two armies met—the enemy being in the heart of his army—Allah established for the human army a right flank (ميمنة), a left flank (ميسرة), a vanguard (تقدمة), and a rearguard (ساقة). Allah informed us of this so that we might take caution against the enemy from these directions. Allah the Exalted told us that this enemy said: <<ثُمَّ لَآتِيَنَّهُمْ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ أَيْمَانِهِمْ وَعَنْ شَمَائِلِهِمْ>> (Then I will surely come to them from before them and from behind them and on their right and on their left). He is in the heart of his army, within the inner being of man. Allah preserved this human dominion by being in the heart of this human army and host, in opposition to the heart of the army of Satan. He placed the Name *The Lord* (الرب) on its right flank, the Name *The King* (الملك) on its left flank, the Name *The Merciful* (الرحمن) in its vanguard, and the Name *The Compassionate* (الرحيم) in its rearguard. He made the Name *The Guide* (الهادي) walk with the message of the Name *The Merciful* (الرحمن) who is in the vanguard, to this Satan.\n\nI do not mean the Satan of the Jinn (شيطان الجان), but rather the Satan of Man (شيطان الإنس), for Allah says: <<شَيَاطِينَ الْإِنْسِ وَالْجِنِّ>> (Satans of mankind and jinn). And He said: <<مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ>> (From the evil of the retreating whisperer * Who whispers into the breasts of mankind * From among the jinn and mankind). The Satans of Man have authority over the outward and inward aspects of man, while the Satans of the Jinn are the deputies of the Satans of Man in the inner beings of people. The Satans of the Jinn are the ones who introduce opinions to the Satans of Man and manage their state, detailing for them the rulings they manifest therein. The fighting continues to operate specifically upon the believing human. Allah fights on his behalf to preserve his faith, and Iblis fights against him to turn him back and strip him of faith, driving him away from the path of his happiness out of envy. If Iblis drives him out, he disavows him and kneels before his Lord, who is the leader of the right flank, and makes him an envoy between himself and the Name *The Merciful* (الرحمن). Allah informed us of all this so that we might know his stratagems. He says to man, beautifying the act for him, \"Disbelieve!\" If the man disbelieves, Iblis says to him: <<إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ>> (Indeed, I am disassociated from you. Indeed, I fear Allah, Lord of the worlds). <<فَكَانَ عَاقِبَتَهُما أَنَّهُما فِي النَّارِ خَالِدَيْنِ فِيهَا>> (So the outcome for both of them was that they would be in the Fire, abiding eternally therein). Because disbelief (الكفر) here is *shirk* (polytheism), which is the great injustice (الظلم العظيم). For this reason, He said: <<وَذَلِكَ جَزَاءُ الظَّالِمِينَ>> (And that is the recompense of the wrongdoers), meaning the polytheists (المشركين), for they are the ones who clothed their faith with injustice. The Messenger of Allah, peace and blessings of Allah be upon him, interpreted this with what Luqman said to his son: <<يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ>> (O my son, do not associate [anything] with Allah. Indeed, association [with Him] is great injustice).\n\nWe learned through this interpretation that Allah intended by \"faith\" in His saying: <<وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ>> (And have not clothed their faith with injustice) that it means faith in the Oneness of Allah (توحيد الله), because *shirk* is only opposed by *tawhid*. The Prophet, peace and blessings of Allah be upon him, knew what the Companions did not know. For this reason, some scholars refrained from interpretation (التأويل) and relied on the apparent meaning, leaving the matter to Allah, as He said: <<وَمَا يَعْلَمُ تَأْوِيلَهُ إِلَّا اللَّهُ>> (And none knows its interpretation except Allah). Whoever Allah informs of what He intended in His saying knows it through Allah's information, not through his own speculation. It is part of Allah's mercy to His creation that He forgave the interpreters (المتأولين) among the scholars of that language, even if they erred in their interpretation of what their Messenger uttered, whether it was what he conveyed from Allah or what he was legislated to legislate through word or deed.\n\nAmong all the Divine Stations (المنازل الإلهية)—both those we mentioned in this book and those we did not—there is none that grants fairness (الإنصاف), renders rights (الحقوق), and leaves no argument against its possessor, neither for Allah nor for His creation, fulfilling the right of Lordship (الربوبية) and the right of Servitude (العبودية)—for there is nothing there but servant and Lord—except this station specifically. This is how Allah informed us, through what He inspired in the People of Allah's Path, according to the custom by which Allah informs the heirs of His Prophets. It is a strange and wondrous station (منزل غريب عجيب). Its beginning encompasses its entirety, and its entirety encompasses all the stations. I have not seen anyone who realized this station except one perfected person in his sainthood (ولاية). I met him in Seville and accompanied him, and he was in this station and remained upon it until he died, may Allah have mercy upon him. Other than this person, I have not seen anyone, even though I know of no station, sect (نحلة), or disposition (ملكة) for which I have not seen someone claiming it, believing in it, and being fair-minded about it through his own admission. Thus, I only relate a doctrine (مذهب) or a sect based on its adherents who profess it. Even though we may have learned it from Allah through a specific path, Allah must show us someone who professes it so that we may know the favor of Allah upon me and His care for me. I was even informed that there are people in the world who claim that Allah's Knowledge (علم الله) regarding His creation has an end, that the possibles (الممكنات) are finite, and that the matter must eventually revert to non-existence and decay, leaving the Real (الحق) as the Real for Himself, with no world remaining. I saw someone in Mecca who held this view and explicitly stated it to me, believing in it. He was from Souss in the lands of the Far West (Al-Maghrib al-Aqsa). He performed the Hajj with us and served us, and he insisted on this doctrine until he openly declared it in our presence. I was unable to refute him, and I do not know whether he retracted it after leaving us or died upon it. He possessed abundant knowledge and virtue, yet he had no religion (دين); rather, he maintained its form as a protection for his life—this is what he told me, and his doctrine allowed it. There is no rank of ignorance greater than this ignorance. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the truth, and He guides to the way).\n\nThe twenty-seventh journey concludes with the end of Chapter Three Hundred and Eighty-Three. <<حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ>> (Sufficient for us is Allah, and [He is] the best Disposer of affairs).\n\nIn the Name of Allah, the Most Merciful, the Compassionate.",
    "ur": "تین سو تراسیواں باب: محمدی عظمتوں کو جامع عظمت کے مقام (منزل العظمة) کی معرفت میں\n\nعظیم (العظیم) جب تو اس کی تعظیم کرتا ہے تو وہ نزول فرماتا ہے،\nاور اگر تو خود کو بڑا سمجھے تو اس کی ذات (ذاتہ) عمل میں جلالت اختیار کر لیتی ہے۔\n\nپس وہی ہے جس نے اپنی غیرت (غیرتہ) کے سبب تمام اکوان (الأكوان) کو باطل کر دیا، اور وہی ہے جو عمل کرتا ہے۔\n\nاور جو کچھ ہم نے کہا ہے اسے کوئی نہیں سمجھ سکتا سوائے اس شخص کے\nجو ملأ علوی (الملأ العلوي) اور رسولوں سے تجاوز کر چکا ہو۔\n\nاور وہ اس ذات میں گم ہو گیا ہے جس کے حصول کو تمام مخلوق اپنا مقصد سمجھتی ہے،\nاور وہ اپنی ذات سے غافل ہو کر بھول گیا۔\n\nوہ رسول، اللہ کے رسول، ہمارے احمد (صلی اللہ علیہ وسلم) ہیں،\nجو اوصاف میں کامل ہیں اور رب الوسیلہ (رب الوسيلة) ہیں۔\n\n### [صاحب الزمان، اوتاد اور ابدال کا حکم]\n\nجان لو کہ اس مقام (منزل) کے چودہ احکام ہیں۔ پہلا حکم صاحب الزمان (صاحب الزمان) کے لیے مخصوص ہے، دوسرا اور تیسرا دو اماموں (الإمامين) کے لیے مخصوص ہے، چوتھا، پانچواں، چھٹا اور ساتواں اوتاد (الأوتاد) کے لیے مخصوص ہے، اور آٹھواں، نواں، دسواں، گیارہواں، بارہواں، تیرہواں اور چودہواں ابدال (الأبدال) کے لیے مخصوص ہے۔ انہی احکام کے ذریعے اللہ تعالیٰ عالم دنیا کی حفاظت فرماتا ہے۔ پس جو شخص اس مقام کو جان لیتا ہے، وہ جان لیتا ہے کہ اللہ تعالیٰ عالم دنیا پر ہستی (الوجود) کی حفاظت کس طرح فرماتا ہے۔ طب میں اس کی نظیر علم تقویم صحت (صحت کو برقرار رکھنے کا علم) ہے۔\n\nجس طرح ابدال (الأبدال) کے ذریعے اقالیم (علاقے) محفوظ رہتے ہیں، اور اوتاد (الأوتاد) کے ذریعے جنوب، شمال، مغرب اور مشرق محفوظ رہتے ہیں، اور دو اماموں (الإمامين) کے ذریعے عالم دنیا میں موجود عالم غیب اور عالم شہادت (عالم الشهادة) محفوظ رہتے ہیں، جو کہ وہ ہے جسے حواس ادراک کرتے ہیں۔ اور قطب (القطب) کے ذریعے یہ سب محفوظ رہتے ہیں، کیونکہ عالم کون و فساد (عالم الكون والفساد) کا معاملہ اسی کے گرد گھومتا ہے۔ اور یہ سب چودہ نبیوں کے قلب پر ہیں، اور وہ ہیں: آدم، ادریس، نوح، ابراہیم، یوسف، ہود، صالح، موسیٰ، داؤد، سلیمان، یحییٰ، ہارون، عیسیٰ اور محمد (سلام اللہ علیہم وعَلَى الْمُرْسَلِينَ والْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ - اور رسولوں پر بھی، اور تمام تعریفیں اللہ کے لیے ہیں جو تمام جہانوں کا رب ہے)۔\n\nاور ان میں سے ہر ایک کے لیے ایک خاص طریقہ ہے، ایک علم ہے جو اس کے لیے مخصوص ہے، اور ایک خبر ہے جو وہ بیان کرتا ہے، اور اس کا وارث وہ شخص ہوتا ہے جس کے لیے نبوت تشریع (نبوة التشريع) نہیں ہے، اگرچہ اس کے لیے نبوت عامہ (النبوة العامة) ہے۔ پس ہم اس میں سے وہ ذکر کرتے ہیں جو آسان ہو، کیونکہ اس کی شرح طویل ہو جاتی ہے اور ایسی شاخوں میں بٹ جاتی ہے جن کا احاطہ کرنا تقریباً ناممکن ہے۔ اور ان کے لیے اسماء الٰہیہ (الأسماء الإلهية) میں سے یہ ہیں: اللہ، الرب، الہادی، الرحیم، الرحمن، الشافی، القاہر، الممیت، المحیی، الجمیل، القادر، الخالق، الجواد، اور المقسط۔ ان میں سے ہر اسم الٰہی (اسم إلهي) مذکورہ نبیوں میں سے کسی ایک نبی کے قلب پر نظر رکھتا ہے، اور ہر نبی ہر وارث پر فیضان کرتا ہے، پس نبی اسماء (الأسماء) اور ورثاء کے درمیان برزخ (البرزخ) کی مانند ہے۔\n\nاور حروف معجم میں سے ان کے لیے سورتوں کے اوائل کے حروف ہیں، اور وہ ہیں: الف، لام، میم، صاد، را، کاف، ہا، یا، عین، طا، سین، حا، قاف، اور نون۔ یہ ان کے لیے اس الٰہی امداد (الإمداد الإلهي) کے لحاظ سے ہے جو ان کے قلوب میں آتی ہے۔ اور جو حروف ان کے خیال کی صورتوں میں امداد کے ذریعے آتے ہیں وہ یہ ہیں: دال، ذال، عین، نون، صاد، را، الف، طا، حا، واؤ، ضاد، غین، لام، میم، تا، کاف، با، سین، قاف، یا، ہا، اور وہ مرکب حرف لام الف جو حروف کے لیے جوہر (الجوہر) کی مانند ہے۔ اور یہ حروف عالم انفاس الٰہیہ (عالم الأنفاس الإلهية) سے ہیں۔ اور جو کلمات ان حروف سے خاص طور پر مرکب ہوتے ہیں، جن پر ہر زبان میں اصطلاح قائم ہوئی ہے، جس سے اس زبان میں فائدہ حاصل ہوتا ہے، تو مجھے بتایا گیا ہے کہ ان کلمات کے لیے عالم میں ایسی خواص ہیں جو دوسرے کلمات کے لیے نہیں ہیں۔\n\nاور جہاں تک ارواح نوریہ (الأرواح النورية) کا تعلق ہے، تو وہ ان انبیاء کے لیے عین ہیں، ان میں سے چودہ روحیں امر الٰہی (أمر الله) سے ہیں جو مذکورہ اسماء الٰہیہ (الأسماء الإلهية) سے انبیاء کے قلوب پر نازل ہوتی ہیں، اور انبیاء علیہم السلام کی حقائق (حقائق الأنبياء) انہیں مذکورہ ورثاء کے قلوب پر منتقل کرتی ہیں۔ اور افراد میں سے ایک فرد کو مذکورہ جماعت کی وراثت حاصل ہو جاتی ہے، پس وہ ورثاء کا علم مذکورہ ملکی ارواح (الأرواح الملكية) اور بشری انبیاء کے ذریعے حاصل کرتے ہیں، اور اسماء الٰہیہ (الأسماء الإلهية) کے خاص پہلو سے ایسے علوم حاصل کرتے ہیں جنہیں محمد صلی اللہ علیہ وسلم کے سوا کوئی نہیں جانتا، کیونکہ آپ صلی اللہ علیہ وسلم کو یہ سارا علم حاصل ہے، جیسا کہ آپ نے خبر دی کہ آپ کو اولین کا علم اور آخرین کا علم عطا کیا گیا ہے۔\n\nجان لو کہ اللہ تعالیٰ کے لیے طبیعت (الطبیعة) میں، جو عرش العماء (عرش العماء) کے نیچے ہے، ایسے خزانے ہیں جن میں اس نے ایسے امور جمع کر رکھے ہیں جن میں بندوں کی سعادت ہے، جیسے معدن میں سونے کا جمع ہونا۔ اور ان خزانوں کی صورتیں لفظی حروف سے مرکب کلمات کی صورتیں ہیں۔ پس جب اللہ تعالیٰ ان کا اظہار چاہتا ہے تو وہ ظاہر نہیں ہوتیں مگر انسانوں کے جسموں کی زمین کی پشت پر، ان کی زبانوں پر۔ اور ان کا خرچ کرنا اور ان سے فائدہ اٹھانا عین ان کا تلفظ کرنا ہے۔ مثلاً انسان کا یہ کہنا: \"لا حول ولا قوة إلا بالله العلي العظيم\" (نہیں ہے کوئی طاقت اور نہ کوئی قوت مگر اللہ بلند و برتر کی مدد سے)۔ یہ کلمات ان خزانوں میں سے ہیں جن کی نص اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم کی زبان پر بیان فرمائی ہے۔ اور سب سے پہلے اللہ تعالیٰ نے انہیں آدم علیہ السلام کی زبان پر ظاہر فرمایا۔ پس آپ پہلے شخص تھے جنہوں نے کعبہ کے طواف کے دوران اس خزانے کو خرچ کیا، جب جبرائیل علیہ السلام نے انہیں اتارا اور کعبہ کا طواف کرایا۔ پھر جبرائیل نے ان سے پوچھا کہ آپ لوگ اس گھر کے طواف میں کیا کہتے تھے؟ تو جبرائیل علیہ السلام نے فرمایا: ہم اس گھر کے طواف میں کہتے تھے: \"سبحان الله والحمد لله ولا إله إلا الله والله أكبر\" (اللہ پاک ہے، تمام تعریفیں اللہ کے لیے ہیں، اللہ کے سوا کوئی معبود نہیں، اور اللہ سب سے بڑا ہے)۔ پھر اللہ نے آدم اور ان کی اولاد کو وہ کلمہ عطا فرمایا جسے فرشتے نہیں جانتے تھے، یعنی \"لا حول ولا قوة إلا بالله العلي العظيم\" (نہیں ہے کوئی طاقت اور نہ کوئی قوت مگر اللہ بلند و برتر کی مدد سے)۔ تو آدم علیہ السلام نے جبرائیل علیہ السلام سے فرمایا: اور میں اس میں تمہارے لیے اضافہ کرتا ہوں: \"لا حول ولا قوة إلا بالله العلي العظيم\"۔ پس یہ کلمہ ان کی اولاد کے لیے اور ہر طواف کرنے والے کے لیے قیامت تک طواف کے ذکر میں سنت بن گیا۔ اور رسول اللہ صلی اللہ علیہ وسلم نے خبر دی کہ یہ کلمہ آدم علیہ السلام کو عرش کے نیچے کے ایک خزانے سے عطا کیا گیا تھا۔\n\nپس جو خزانے عرش کے نیچے جمع کیے گئے ہیں، وہ درحقیقت ہماری نشأت (نشأتنا) میں جمع کیے گئے ہیں۔ جب اللہ تعالیٰ ان میں سے کسی خزانے کو ظاہر کرنا چاہتا ہے تو اسے ہماری زبانوں پر ظاہر کر دیتا ہے اور اسے اپنی قربت کا ذریعہ بنا دیتا ہے، پس اس کا خرچ کرنا عین اس کا تلفظ کرنا ہے۔ اور اسی طرح وہ سب کچھ ہے جسے اللہ نے جمع کیا ہے، خواہ وہ قربت کا ذریعہ ہو یا نہ ہو۔ جو چیز جمع نہیں کی گئی، بلکہ عین وقت پر بندے کی زبان پر خلق کی جاتی ہے، تو اس کے جمع کیے جانے کی صورت یہ تھی (چونکہ صرف وجودی امر ہی جمع کیا جاتا ہے) کہ جب اللہ نے اس جمع شدہ چیز کو وجود میں لانا چاہا تو اس نے آدم کی صورت میں تجلی (التجلی) فرمائی، پھر اس امر کے ساتھ کلام کیا جسے وہ ہمارے لیے یا اپنی مخلوق میں سے جس کے لیے چاہے جمع کرنا چاہتا تھا۔ جب اس نے کلام کیا تو اس جگہ کو سنایا جہاں وہ اسے جمع کر رہا تھا، پس وہ اسے تھام لیتا ہے۔ پھر جب اللہ اس جگہ کو ایک صورت میں پیدا کرتا ہے تو یہ خزانہ اس صورت کے نطق میں ظاہر ہوتا ہے، اور اللہ کے ہاں اس کے ظاہر ہونے سے فائدہ اٹھایا جاتا ہے۔ پھر یہ ہمیشہ کے لیے ذکر کرنے والوں کی زبانوں میں منتقل ہوتا رہتا ہے۔ اور یہ خزانہ صرف اسی شخص میں خزانہ تھا جس سے یہ ابتداء میں ظاہر ہوا، نہ کہ ہر اس شخص میں جس سے یہ انتقال اور حفظ کے حکم سے ظاہر ہوا۔ اور اسی طرح ہر وہ شخص جس نے کوئی اچھی سنت (سنة حسنة) ابتداء میں قائم کی، بغیر کسی مخلوق سے حاصل کیے، بلکہ اللہ کی طرف سے براہ راست، تو وہ نیکی ایک خزانہ ہے جسے اللہ نے اس بندے میں خاص پہلو سے جمع کیا، پھر اس بندے نے اسے ظاہر کرنے کے لیے اس کا نطق کیا، جیسے کوئی شخص اپنے صندوق میں جمع کیے ہوئے مال کو خرچ کرتا ہے۔ اگر تم سمجھو تو یہ ہے اکتناز (الاكتناز) کی صورت۔ پس یہ اکتناز صرف خاص الٰہی پہلو سے ہی ہو سکتا ہے، اور اس کے علاوہ کوئی چیز اکتناز نہیں ہے۔ پس سب سے پہلے اس کا نطق کرنے والا ہی وہ محل اکتناز ہے جس میں اللہ نے اسے جمع کیا، اور جو شخص اسے اس سے حاصل کرتا ہے، اس کے حق میں وہ ایک مقرب ذکر ہے جسے خزانہ ہونے کی صفت سے موصوف کیا گیا ہے۔ یہ سب اس کے رموز ہیں کیونکہ یہ سب اس کے خزانے ہیں۔ اور جب میں نے تمہیں خزانے اور اکتناز کی صورت اور اس معاملے کی کیفیت سے آگاہ کر دیا ہے، تاکہ تم جان لو کہ تم کس چیز کے لیے خزانہ ہو، یعنی کس چیز کے جمع کیے جانے کا محل ہو، اور کس چیز کے لیے محل نہیں ہو جب تم اسے کسی اور سے تلقین یا حاصل کرتے ہو، تو اس وقت تم اپنے رب کی طرف سے اپنا حصہ اور نبوت کے مشارب (مشارب النبوة) میں سے جو کچھ اس نے تمہارے لیے خاص کیا ہے، جان لو گے۔ پس تم اس وقت اپنے رب کی طرف سے اس عبادت کے بارے میں واضح دلیل پر ہو گے جو تم اس کی کرتے ہو، اور جس چیز کے لیے تم محل اکتناز ہو، اس میں تم وارث نہیں ہو گے بلکہ موروث (جس سے وراثت لی جائے) ہو گے، پس تم اس چیز کو پہچان لو گے جس کے تم وارث ہو اور وہ چیز جو تم سے وراثت میں دی جاتی ہے۔\n\nاور اسی باب سے بلال رضی اللہ عنہ کا مسئلہ ہے جس کی نص ہمارے لیے رسول اللہ صلی اللہ علیہ وسلم نے اپنے اس قول میں بیان فرمائی جب آپ نے ان سے پوچھا: \"تم کس چیز کے سبب مجھ سے جنت میں سبقت لے گئے؟\" آپ صلی اللہ علیہ وسلم نے ان سے استفسار فرمایا، حالانکہ آپ جانتے تھے کہ سبقت آپ صلی اللہ علیہ وسلم کے لیے ہے۔ جب بلال نے وہ چیز ذکر کی جس کی نص ہمارے لیے بیان کی گئی ہے، تو آپ نے فرمایا: \"ان دونوں حالتوں کے سبب۔\" پس جو شخص اس پر عمل کرے گا، اسے عمل کا اجر ملے گا، اور بلال کو سنت قائم کرنے کا اجر اور تمہارے عمل کا اجر دونوں ملیں گے۔ یہ ہے انسان کے محل اکتناز ہونے کا فائدہ۔ لیکن برائی کی سنت قائم کرنا الٰہی اکتناز نہیں ہے، بلکہ وہ ایک طبعی امر ہے۔\n\nکیونکہ نبی صلی اللہ علیہ وسلم ہمیں تعلیم دیتے ہوئے فرماتے ہیں: \"والخير كله بيديك\" (اور تمام بھلائی تیرے ہی ہاتھ میں ہے)۔ یعنی تو ہی ہے جس نے اسے اپنے بندوں میں جمع کیا ہے، پس یہ تیرے انہیں میں رکھنے اور تیرے جمع کرنے کی وجہ سے ہے، اور اسی لیے اس پر عمل کرنا تیری قربت کا ذریعہ ہوتا ہے۔ پھر فرمایا: \"والشر ليس إليك\" (اور برائی تیری طرف نہیں ہے)۔ یعنی تو نے اسے اپنے بندوں میں جمع نہیں کیا۔ اور یہی اللہ تعالیٰ کا قول ہے: \"ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله\" (تجھے جو بھی بھلائی پہنچتی ہے، وہ اللہ کی طرف سے ہے)۔ یعنی اس بات کا تعارف اللہ کی طرف سے ہے، اور یہ حکم کہ یہ اللہ کی طرف سے ہے اور یہ تمہاری طرف سے ہے، یہ خیر ہے اور یہ شر ہے۔ یہ ہے \"كُلٌّ من عِنْدِ الله\" (سب کچھ اللہ کی طرف سے ہے) کا معنی۔ اور اسی لیے ان لوگوں کے حق میں جو اس بات سے جاہل ہیں جو ہم نے ذکر کی، اللہ نے فرمایا: \"فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً\" (پس ان لوگوں کو کیا ہو گیا ہے کہ وہ بات کو سمجھنے کے قریب بھی نہیں آتے)۔ یعنی انہیں کیا ہو گیا ہے کہ وہ اس بات کو نہیں سمجھتے جو میں نے انہیں بتائی ہے؟ کیونکہ میں نے کہا ہے: \"ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله\" (تجھے جو بھی بھلائی پہنچتی ہے، وہ اللہ کی طرف سے ہے) اور \"وما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ\" (اور تجھے جو بھی برائی پہنچتی ہے، وہ تیرے نفس کی طرف سے ہے)۔ پس میں نے احتمال کو ختم کر دیا یا اس امر پر نص قائم کر دی جو اس کی حقیقت ہے۔ جب میں نے کہا: \"كُلٌّ من عِنْدِ الله\" (سب کچھ اللہ کی طرف سے ہے)، تو اللہ کو جاننے والا یہ جانتا ہے کہ میری مراد حکم اور اس بات کی اطلاع دینا ہے کہ یہ اللہ کی طرف سے ہے، نہ کہ عین برائی۔ اور جب رسول اللہ صلی اللہ علیہ وسلم نے یہ جان لیا تو فرمایا: \"والخير كله بيديك والشر ليس إليك\" (اور تمام بھلائی تیرے ہی ہاتھ میں ہے اور برائی تیری طرف نہیں ہے)۔\n\nاور اسی طرح اللہ تعالیٰ کا یہ قول ہے: \"ونَفْسٍ وما سَوَّاها فَأَلْهَمَها فُجُورَها\" (اور نفس کی قسم اور اس ذات کی جس نے اسے درست کیا، پھر اسے اس کی فجور (برائی) کا الہام کیا) کہ وہ فجور ہے، \"وتَقْواها\" (اور اس کی تقویٰ کا) کہ وہ تقویٰ ہے۔ تاکہ فجور اور تقویٰ کے درمیان فرق کیا جا سکے، کیونکہ نفس ان دونوں امور کے ظاہر ہونے کا محل ہے۔ پس بسا اوقات معاملہ اس پر مشتبہ ہو جاتا ہے اور وہ یہ گمان کر لیتا ہے کہ یہ سب تقویٰ ہے، تو اللہ نے اسے اس الہام (الإلهام) کے ذریعے سکھایا جس سے اس کے نزدیک فجور، تقویٰ سے ممتاز ہو جاتا ہے۔ اور اسی لیے یہاں الہام کا ذکر آیا ہے، امر (الأمر) کا نہیں، کیونکہ \"إِنَّ الله لا يَأْمُرُ بِالْفَحْشاءِ\" (بے شک اللہ بے حیائی کا حکم نہیں دیتا) اور فجور بے حیائی ہے۔ پس ذکر اصل کے لیے ہے جو کہ قطب (القطب) ہے، اور دو تحمیدیں، یعنی خوشحالی اور تنگی کی تحمید، چونکہ شرعی زبان میں تحمید تقسیم ہو گئی ہے، خوشحالی میں اس قول کے درمیان: \"الحمد لله المنعم المفضل\" (تمام تعریفیں اللہ کے لیے ہیں جو انعام کرنے والا اور فضل کرنے والا ہے)، اور تنگی میں اس قول کے درمیان: \"الحمد لله على كل حال\" (ہر حال میں اللہ کے لیے تعریف ہے)۔ اور کائنات میں اس کے لیے یا تو خوش کرنے والی حالت ہے یا نقصان پہنچانے والی حالت، اور ہر حالت کے لیے ایک تحمید ہے، پس اس نے اسے اسی طرح دو اماموں (الإمامين) پر تقسیم کر دیا۔\n\nاور چونکہ وہ جہات جن سے شیطان انسان کے پاس آتا ہے چار ہیں، اور وہ اللہ تعالیٰ کا ہمارے لیے اپنی کتاب میں ابلیس کے بارے میں یہ قول ہے: \"ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ\" (پھر میں ان کے پاس ان کے آگے سے، ان کے پیچھے سے، ان کے دائیں سے اور ان کے بائیں سے آؤں گا)، اور ان میں سے ہر جہت پر ایک شخص کھڑا ہے جو اس سے اس کے ایمان کی حفاظت کرتا ہے، اس لیے اوتاد (الأوتاد) کو چار بنایا گیا تاکہ وہ ان جہات کو لازم پکڑیں، ہر وتد کے لیے ایک جہت، یعنی اس پر خاص طور پر اس جہت کی حفاظت غالب ہوتی ہے، اگرچہ وہ باقی جہات کی بھی حفاظت کرتا ہے۔ جیسے تمہارے درمیان سب سے زیادہ فرض شناس زید ہے اور سب سے زیادہ فیصلہ کرنے والا علی ہے۔ اور جیسے ایک جماعت کسی ایسی چیز کو اٹھاتی ہے جسے ایک فرد تنہا نہیں اٹھا سکتا، تو جماعت کے ہر فرد میں اسے اٹھانے کی قوت ہوتی ہے، اور اس کی زیادہ تر قوت اس چیز کو اٹھانے میں صرف ہوتی ہے جس سے وہ براہ راست جڑا ہوتا ہے۔ اگر جماعت نہ ہوتی تو یہ بوجھ منتقل نہ ہوتا، کیونکہ ہر ایک فرد اسے اٹھانے کی طاقت نہیں رکھتا۔ پس مجموعے کے ذریعے یہ بوجھ اٹھایا گیا، اسی طرح یہ معاملہ ہے۔ یہ سات ہوئے۔ اور جہاں تک ابدال (الأبدال) کا تعلق ہے، تو وہ سات صفات کی حفاظت کرتے ہیں جب ان کا صاحب انہیں تصرف میں لاتا ہے، کیونکہ ان صفات کا تصرف خیر میں بھی ہوتا ہے اور شر میں بھی، پس وہ اپنے صاحب کے لیے خیر کے تصرف کی حفاظت کرتے ہیں اور اسے شر کے تصرف سے بچاتے ہیں۔ یہ ان چودہ کی کل تعداد ہے جو ہم نے عقل رکھنے والے مومنوں کے لیے بیان کی ہے، اگر وہ انصاف کریں۔ اور جسے مذکورہ بالا حفاظت حاصل ہو جائے، تو وہی معصوم (المعصوم) ہے، اور یہ عصمت (العصمة) ہے، ظاہر اور باطن میں ان دونوں کے سوا کچھ نہیں۔ \"والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ\" (اور اللہ ہر چیز کا جاننے والا ہے)۔\n\nاور جب تم یہ جان لو گے اور تمہارے لیے بند دروازہ کھل جائے گا، تو تم ان میں سے ہر ایک کے لیے، جنہیں ہم نے تمہارے لیے متعین کیا ہے، اس چیز پر چلو گے جو اسے اسماء الٰہیہ (الأسماء الإلهية)، متعین رقمی حروف (الحروف الرقمية)، مذکورہ نبیوں سے موروثی فہموں، اور ارواح نوریہ (الأرواح النورية) میں سے حاصل ہے۔ پس تمہیں ذوقاً وہ سب کچھ حاصل ہو جائے گا جو ہم نے ذکر کیا ہے، اور اس کے معنی کا کشف (الکشف) ہو جائے گا، لہٰذا اس کے استعمال سے غافل نہ ہونا۔ اور اس مقام (منزل) میں جو علوم ہیں، وہ یہ ہیں: اللہ تعالیٰ کی قربت دلانے والے اذکار کا علم، اسماء الٰہیہ (الأسماء الإلهية) کا علم، رحمت کے اختصاص اور اس کے شمول کا علم، اللہ کے لیے مرکب اسماء کا علم، امور کے انجام کا علم، عالم کا علم، عالم میں سیادت کے مراتب کا علم، ثناء کے ذریعے ثناء کا علم، ملک اور ملکوت (الملک والملکوت) کا علم، زمان (الزمان) کا علم، جزا کا علم، استناد کا علم، تعاون کا علم، عبادت کا علم، بیان اور تبیین کا علم، سعادت کے طریقوں کا علم، نعمت، منعم اور انعام کا علم، اس سعادت سے دور کیے جانے کے اسباب کا علم جس میں کوئی بدبختی شامل نہ ہو، حیرت اور حیران ہونے والوں کا علم، سائل اور مجیب کا علم، ذات اور اضافت کے ذریعے تعریف کا علم، اور ان دونوں تعریفوں میں سے کون سی زیادہ قوی ہے۔ یہ علوم کی وہ امہات ہیں جن پر یہ مقام مشتمل ہے، اور ان میں سے ہر علم کی تفصیلات کا احاطہ صرف اللہ تعالیٰ ہی کر سکتا ہے، یعنی وہ ان کے علم کے ساتھ یہ بھی جانتا ہے کہ ان کا احاطہ نہیں ہو سکتا کیونکہ ان کی کوئی انتہا نہیں ہے۔ اور اسی سے علم میں اضافہ ہوتا ہے اس شخص کے لیے جو اسے طلب کرے، اور اس کے لیے بھی جسے یہ بغیر طلب کے عطا کیا جائے، اور یہی اللہ کا قول ہے: \"وقُلْ رَبِّ زِدْنِي عِلْماً\" (اور کہو: اے میرے رب! میرے علم میں اضافہ فرما)۔ کیونکہ اگرچہ علم اپنی ذات میں متناہی ہے، لیکن معلوم (جس کا علم حاصل کیا جائے) غیر متناہی ہے۔\n\nاور میں نے نفس کو اس کے اس قول سے منع کیا\nکہ اس میں انتہا ہے، مگر وہ باز نہ آیا۔\n\nکیونکہ وہ امر کی حقیقت سے جاہل ہے،\nاسی لیے اس نے کہا کہ یہ ختم ہو جاتا ہے۔\n\nاور ہم نے ان میں سے ایک گروہ کو دیکھا\nجو مکہ میں ایک بیابان میں گھوم رہا تھا۔\n\nان کے وہموں نے ان پر حکومت کر رکھی تھی،\nپس عقل مند بیوقوف سے الگ ہو گیا۔\n\n### [عالم انسان اللہ تعالیٰ کی ملکیت تھا]\n\nاور جان لو کہ چونکہ عالم انسان اللہ تعالیٰ کی ملکیت تھا، اس لیے ذات حق (الحق) تعالیٰ اس ملکیت کا بادشاہ ہے، اس میں تدبیر اور تفصیل کے ذریعے سے۔ اور اسی لیے اس نے اپنی ذات کو اس طرح بیان فرمایا ہے کہ: \"لِلَّهِ جُنُودُ السَّماواتِ والْأَرْضِ\" (اور اللہ ہی کے لیے ہیں آسمانوں اور زمین کے لشکر)۔ اور فرمایا: \"وما يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ\" (اور تیرے رب کے لشکروں کو اس کے سوا کوئی نہیں جانتا)۔ پس وہ تعالیٰ اس انسانی شہر (مدینۃ الإنسانیۃ) کا محافظ ہے، کیونکہ یہ اس کی وہ بارگاہ ہے جو اسے سموئے ہوئے ہے، اور یہ عین اس کی مملکت ہے۔ اور اس نے اپنی ذات کو لشکروں اور قوت سے موصوف نہیں کیا مگر اس لیے کہ وہ جانتا تھا کہ اس کی مشیت (مشیئتہ) اس کی مخلوق میں پہلے ہی گزر چکی ہے کہ وہ اس کے لیے ایک ایسا جھگڑنے والا پیدا کرے گا جو اس کی بارگاہ میں اس سے جھگڑے گا اور اس کی مملکت میں اس پر بغاوت کرے گا، اس میں اس کی مشیت کے نفاذ، اس کے سابقہ علم اور اس کے نہ بدلنے والے کلمے کے ذریعے سے۔ اس نے اسے حارث (الحارث) کا نام دیا، اور اس کے لیے گھڑ سوار اور پیادہ لشکر بنائے، اور اسے اس انسان پر مسلط کر دیا۔ پس اس دشمن نے اپنے گھڑ سواروں اور پیادوں کے ساتھ اس انسانی بادشاہت پر حملہ کیا، اور اسے فریب کا وعدہ دیا، اور اپنے ان خواطر (خواطر) کے سفیروں کے ذریعے جو اس کے اور انسان کے درمیان چلتے ہیں۔\n\nپس اللہ نے اس کے لشکروں کے مقابلے میں اپنے فرشتوں کے لشکر بنائے۔ جب دونوں لشکر آمنے سامنے ہوئے، اور وہ اپنے لشکر کے قلب میں تھا، تو اللہ نے اس کے لیے میمنہ (دایاں بازو)، میسرہ (بایاں بازو)، مقدمہ (آگے کا حصہ) اور ساقہ (پیچھے کا حصہ) بنایا۔ اور اللہ نے ہمیں اس سے آگاہ کیا تاکہ ہم ان جہات سے اس سے بچاؤ اختیار کریں۔ پس اللہ تعالیٰ نے ہمیں بتایا کہ اس دشمن نے کہا: \"ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ\" (پھر میں ان کے پاس ان کے آگے سے، ان کے پیچھے سے، ان کے دائیں سے اور ان کے بائیں سے آؤں گا)۔ اور وہ انسان کے باطن میں اپنے لشکر کے قلب میں ہے۔ پس اللہ نے اس انسانی بادشاہت کی حفاظت اس طرح فرمائی کہ اللہ اس لشکر کے قلب میں تھا، اور یہ انسانی لشکر شیطان کے لشکر کے قلب کے مقابلے میں تھا۔ اور اس کے میمنہ پر اسم الرب (الرب) کو، اور اس کے میسرہ پر اسم الملک (الملک) کو، اور اس کے مقدمہ پر اسم الرحمن (الرحمن) کو، اور اس کے ساقہ پر اسم الرحیم (الرحیم) کو مقرر فرمایا۔ اور اسم الہادی (الہادی) کو مقرر فرمایا کہ وہ مقدمہ میں موجود اسم الرحمن کا پیغام لے کر اس شیطان کی طرف چلے۔ اور یہ جنوں کا شیطان نہیں ہے، بلکہ میری مراد اس سے انسانوں کا شیطان ہے، کیونکہ اللہ فرماتا ہے: \"شَياطِينَ الْإِنْسِ والْجِنِّ\" (انسانوں اور جنوں کے شیطان)۔ اور فرمایا: \"من شَرِّ الْوَسْواسِ الْخَنَّاسِ الَّذِي يُوَسْوِسُ في صُدُورِ النَّاسِ من الْجِنَّةِ والنَّاسِ\" (وسوسہ ڈالنے والے، پیچھے ہٹ جانے والے کے شر سے، جو لوگوں کے سینوں میں وسوسہ ڈالتا ہے، جنوں میں سے بھی اور انسانوں میں سے بھی)۔ کیونکہ انسانوں کے شیطانوں کو انسان کے ظاہر اور باطن پر تسلط حاصل ہے، اور جنوں کے شیطان انسانوں کے شیطانوں کے نائب ہیں جو لوگوں کے باطن میں ہوتے ہیں۔ اور جنوں کے شیطان ہی انسانوں کے شیطانوں پر آراء داخل کرتے ہیں اور ان کی سلطنت کی تدبیر کرتے ہیں، پس وہ ان کے لیے ان احکام کی تفصیل کرتے ہیں جنہیں وہ ظاہر کرتے ہیں۔\n\nاور یہ جنگ خاص طور پر اس مومن انسان پر جاری رہتی ہے، پس اللہ اس کی طرف سے لڑتا ہے تاکہ اس کے ایمان کی حفاظت کرے، اور ابلیس اس پر لڑتا ہے تاکہ اسے اپنی طرف لوٹا لے اور حسد کی بنا پر اس سے ایمان چھین لے اور اسے اس کی سعادت کے راستے سے نکال دے۔ کیونکہ جب وہ اسے نکال دیتا ہے تو \"تَبَرَّأَ مِنْهُ\" (وہ اس سے بیزار ہو جاتا ہے) اور اپنے رب کے سامنے گھٹنوں کے بل بیٹھ جاتا ہے جو صاحب میمنہ کا مقدمہ ہے، اور اسے اپنے اور اسم الرحمن (الرحمن) کے درمیان سفیر بنا دیتا ہے۔ اور اللہ نے ہمیں یہ سب اس لیے بتایا تاکہ ہم اس کی مکاریوں کو جان لیں۔ پس وہ انسان سے کہتا ہے، جو چیز اسے مزین کر کے دکھاتا ہے: \"کفر کر!\" اور جب وہ کفر کر لیتا ہے تو وہ اس سے کہتا ہے: \"إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ\" (میں تجھ سے بیزار ہوں، میں اللہ سے ڈرتا ہوں جو تمام جہانوں کا رب ہے)۔ \"فَكانَ عاقِبَتَهُما أَنَّهُما في النَّارِ خالِدَيْنِ فِيها\" (پس ان دونوں کا انجام یہ ہوا کہ وہ دونوں ہمیشہ کے لیے آگ میں رہیں گے)۔ کیونکہ یہاں کفر سے مراد شرک ہے، اور وہ ظلم عظیم ہے۔ اور اسی لیے اللہ نے فرمایا: \"وذلِكَ جَزاءُ الظَّالِمِينَ\" (اور یہی ظالموں کی جزا ہے)۔ اس سے مراد مشرکین ہیں، کیونکہ وہی ہیں جنہوں نے اپنے ایمان کو ظلم کے ساتھ ملایا۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اس کی تفسیر اس بات سے فرمائی جو لقمان نے اپنے بیٹے سے کہی تھی: \"يا بُنَيَّ لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ\" (اے میرے بیٹے! اللہ کے ساتھ شرک نہ کرنا، بے شک شرک بہت بڑا ظلم ہے)۔ پس ہم نے اس تفسیر سے جانا کہ اللہ کا قول \"ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ\" (اور جنہوں نے اپنے ایمان کو ظلم کے ساتھ نہیں ملایا) میں ایمان سے مراد اللہ کی توحید پر ایمان ہے، کیونکہ شرک کا مقابلہ صرف توحید ہی کرتی ہے۔ پس نبی صلی اللہ علیہ وسلم نے وہ جان لیا جو صحابہ نے نہیں جانا تھا، اور اسی لیے علماء میں سے جس نے تاویل کو ترک کیا، اس نے اسے ترک کر دیا اور اس کا قائل نہیں ہوا، اور ظاہر پر اعتماد کیا اور اس معاملے کو اللہ کے سپرد کر دیا، کیونکہ اللہ نے فرمایا: \"وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله\" (اور اس کی تاویل کو اللہ کے سوا کوئی نہیں جانتا)۔ پس جسے اللہ نے اپنے قول میں اپنی مراد سے آگاہ کیا، اس نے اللہ کے بتانے سے جانا، نہ کہ اپنی نظر سے۔ اور اللہ کی اپنی مخلوق پر رحمت میں سے یہ ہے کہ اس نے اس زبان کے ماہر علماء میں سے تاویل کرنے والوں کو معاف کر دیا، اگر انہوں نے اپنے رسول کے تلفظ کردہ کلام کی تاویل میں غلطی کی ہو، خواہ وہ کلام ہو جو رسول نے اللہ کی طرف سے ترجمہ کیا ہو یا وہ جو اسے قولاً یا فعلاً مشروع کرنے کا حکم دیا گیا ہو۔\n\nاور تمام الٰہی مقامات (المنازل الإلهية) میں، خواہ وہ کثرت سے ہوں جن کا ہم نے اس کتاب میں ذکر کیا ہے یا جن کا ذکر نہیں کیا، کوئی ایسا نہیں جو انصاف دے اور حقوق ادا کرے اور اپنے اوپر اللہ یا اس کی مخلوق کی کوئی حجت باقی نہ چھوڑے، پس وہ ربوبیت (الربوبیۃ) کا حق بھی پورا کرے اور عبودیت (العبودیۃ) کا حق بھی پورا کرے، اور وہاں رب اور بندے کے سوا کچھ نہیں، سوائے اس خاص مقام کے۔ اللہ نے ہمیں اسی طرح آگاہ کیا ہے جس کا الہام اس نے اہل طریق اللہ کو کیا ہے، جس کا یہ معمول ہے کہ اللہ اس سے اپنے انبیاء کے ورثاء کو آگاہ کرتا ہے۔ اور یہ ایک عجیب و غریب مقام ہے، جس کا اول اپنے کل کو شامل ہے اور اس کا کل تمام مقامات کو شامل ہے۔ اور میں نے کسی ایک شخص کو بھی اس میں متحقق (تحقق) نہیں دیکھا سوائے ایک شخص کے جو اپنی ولایت میں کامل تھا، میں اس سے اشبیلیہ میں ملا اور اس کی صحبت میں رہا، اور وہ اسی مقام پر تھا اور اسی پر قائم رہا یہاں تک کہ اس کا انتقال ہو گیا، اللہ اس پر رحم فرمائے۔ اس شخص کے علاوہ میں نے کسی کو نہیں دیکھا، حالانکہ میں کسی مقام، کسی فرقے یا کسی ملکہ (ملکہ) کو نہیں جانتا مگر یہ کہ میں نے اس کا قائل اور اس کا معتقد دیکھا ہے، اور وہ خود اپنے اعتراف سے اس میں انصاف کرنے والا ہوتا ہے۔ پس میں کسی مذہب یا فرقے کا ذکر نہیں کرتا مگر اس کے قائلین کی طرف سے، اگرچہ ہم نے اسے اللہ سے خاص طریقے سے جانا ہے۔ لیکن اللہ کا ہمیں اس کا قائل دکھانا ضروری ہے تاکہ ہم پر اللہ کا فضل اور مجھ پر اس کی عنایت معلوم ہو، یہاں تک کہ مجھے یہ بھی بتایا گیا کہ دنیا میں ایسے لوگ ہیں جو یہ کہتے ہیں کہ اللہ کا علم اس کی مخلوق میں ختم ہو جاتا ہے، اور یہ کہ ممکنات (الممکنات) متناہی ہیں، اور یہ کہ معاملہ لازماً عدم اور فنا سے جا ملے گا، اور حق صرف اپنی ذات کے لیے حق باقی رہے گا اور کوئی عالم نہیں رہے گا۔ پس میں نے مکہ میں ایک شخص کو دیکھا جو یہ قول کہتا تھا اور اس نے میرے سامنے اس کا اعتقاد رکھتے ہوئے صراحت کی، وہ اقصی مغرب کے علاقے سوس کا رہنے والا تھا، اس نے ہمارے ساتھ حج کیا اور ہماری خدمت کی، اور وہ اس مذہب پر اصرار کرتا رہا یہاں تک کہ اس نے ہمارے سامنے اس کی صراحت کر دی۔ اور میں اسے اس سے واپس نہ کر سکا، اور مجھے نہیں معلوم کہ ہمارے جدا ہونے کے بعد اس نے اس سے رجوع کیا یا اسی پر فوت ہوا۔ اس کے پاس بہت سے علوم اور فضل تھا، مگر اس کے پاس دین نہیں تھا، بلکہ وہ اسے اپنے خون کی عصمت (عصمة) کی صورت میں قائم رکھتا تھا، یہ اس کا مجھ سے کہنا تھا اور اس کا مذہب اسے یہی دیتا تھا۔ اور جہالت کے مراتب میں اس جہالت سے بڑھ کر کوئی جہالت نہیں ہے۔ \"والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ\" (اور اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے)۔ ستائیسواں سفر تین سو تراسیویں باب کے اختتام پر مکمل ہوا۔ \"وحَسْبُنَا الله ونِعْمَ الْوَكِيلُ\" (اور ہمارے لیے اللہ کافی ہے اور وہ بہترین کارساز ہے)۔\n\nشروع اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
    "fa": "باب سیصد و هشتاد و سوم در معرفت منزل عظمت جامع عظمت‌های محمدی\n\nآن بزرگ چون بزرگش شماری، فرود آید\nو اگر خود را بزرگ شماری، ذاتش در عمل جلال یابد\n\nاوست که همه هستی‌ها (الأكوان) را از باب غیرت خویش باطل ساخت\nو اوست که عمل کرد\n\nآنچه گفتیم را درک نکند مگر مردی\nکه از فرشتگان علوی و رسولان درگذشته باشد\n\nو در کسی سرگشته شد که همه خلق گمان می‌کنند\nاو را به دست آورده‌اند، و از خود غافل شد و فراموش کرد\n\nآن رسول، رسول خدا، احمد ماست\nصاحب وسیله که در اوصافش کامل شد\n\n### [حکم صاحب الزمان و اوتاد و ابدال]\n\nبدان که این منزل چهارده حکم دارد: اول مخصوص صاحب الزمان است، دوم و سوم مخصوص دو امام است، چهارم و پنجم و ششم و هفتم مخصوص اوتاد است، و هشتم و نهم و دهم و یازدهم و دوازدهم و سیزدهم و چهاردهم مخصوص ابدال است. خداوند به واسطه این احکام، عالم دنیا را حفظ می‌کند. پس هر کس این منزل را بشناسد، می‌داند که چگونه خداوند هستی (الوجود) را بر عالم دنیا حفظ می‌کند. و نظیر آن، در علم طب، علم حفظ الصحه است. همان‌طور که به واسطه ابدال، اقلیم‌ها حفظ می‌شوند؛ و به واسطه اوتاد، جنوب و شمال و مغرب و مشرق حفظ می‌شوند؛ و به واسطه دو امام، عالم غیب که در عالم دنیاست و عالم شهادت (آنچه حس آن را درک می‌کند) حفظ می‌شود؛ و به واسطه قطب، همه این‌ها حفظ می‌شوند، زیرا اوست که امر عالم کون و فساد بر مدار او می‌گردد. و اینان بر قلب چهارده پیامبر هستند، و آنان عبارتند از: آدم، ادریس، نوح، ابراهیم، یوسف، هود، صالح، موسی، داوود، سلیمان، یحیی، هارون، عیسی و محمد، سلام خدا بر ایشان و بر فرستادگان (الْمُرْسَلِينَ) و ستایش از آن خداست که پروردگار جهانیان است (الْحَمْدُ لِلَّهِ رَبِّ الْعالَمِينَ).\n\nو برای هر یک از کسانی که ذکر کردیم، طریقی مخصوص به خود، و علمی که بر آن تصریح شده، و خبری که نقل می‌شود، وجود دارد؛ و آن را کسی به ارث می‌برد که نبوت تشریعی ندارد، هرچند نبوت عامه داشته باشد. پس از آن، آنچه میسر است را ذکر می‌کنیم، زیرا شرح آن طولانی می‌شود و به شاخه‌هایی تقسیم می‌گردد که تقریباً نامحدود است. و برای ایشان از اسماء الهی، این نام‌هاست: الله، الرب، الهادی، الرحیم، الرحمن، الشافی، القاهر، الممیت، المحیی، الجمیل، القادر، الخالق، الجواد، و المقسط. هر یک از این اسماء الهی به قلب پیامبری از پیامبران مذکور نظر می‌کند، و هر پیامبری بر هر وارثی فیض می‌رساند. پس پیامبر مانند برزخ میان اسماء و ورثه است.\n\nو برای ایشان از حروف الفبا، حروف اوایل سوره‌هاست، که عبارتند از: الف، لام، میم، صاد، راء، کاف، هاء، یاء، عین، طاء، سین، حاء، قاف، و نون. این‌ها از جهت امداد الهی است که در قلب‌هایشان به ایشان می‌رسد. و اما آنچه از حروف در صور خیالشان به واسطه امداد نیز به ایشان می‌رسد، عبارتند از: دال، ذال، عین، نون، صاد، راء، الف، طاء، حاء، واو، ضاد، غین، لام، میم، تاء، کاف، باء، سین، قاف، یاء، هاء، و حرف مرکب لام الف که برای حروف به منزله جوهر است. و این حروف از عالم انفاس الهی هستند. و آنچه از کلمات از این حروف به طور خاص ترکیب شده، از مواردی است که در هر زبانی اصطلاح بر آن واقع شده تا فایده در آن زبان حاصل شود. زیرا آن کلمات، بنا بر آنچه به من گفته شده، خواصی در عالم دارند که برای سایر کلمات نیست.\n\nو اما ارواح نوریه، عین این پیامبران هستند. چهارده روح از امر خدا از اسماء الهی که ذکر کردیم، بر قلب‌های پیامبران نازل می‌شوند، و حقایق پیامبران (علیهم السلام) آن را بر قلب‌های ورثه مذکور دریافت می‌کنند. و برای فرد واحد از افراد، وراثت جماعت مذکور حاصل می‌شود. پس آنان علم وراثت را از طریق ارواح ملکی و پیامبران بشری مذکور می‌گیرند، و به وجه خاص از اسماء الهی، علومی را کسب می‌کنند که هیچ یک از کسانی که ذکر کردیم، جز محمد (صَلَّى اللهُ عَليهِ وسَلَّم) آن را نمی‌داند، زیرا او این علم را به طور کامل دارد، چرا که خبر داده است که علم اولین و علم آخرین را دانسته است.\n\nبدان که خداوند را گنج‌هایی (کنوز) در طبیعت زیر عرش عماء است که در آن اموری را برای سعادت بندگان ذخیره کرده است، مانند ذخیره شدن طلا در معدن. و صورت این گنج‌ها، صورت کلمات مرکب از حروف لفظی است. پس اگر خداوند بخواهد آن‌ها را آشکار کند، جز بر روی زمین اجسام بشر و بر زبان‌هایشان ظاهر نمی‌شوند. و انفاق و بهره‌مندی از آن‌ها، عین تلفظ به آن‌هاست، مانند گفتار انسان: «لا حول ولا قوة إلا بالله العلي العظيم» (هیچ نیرو و قدرتی جز به واسطه خدای بلندمرتبه بزرگ نیست). این کلمات از گنج‌هایی هستند که خداوند بر زبان رسولش (صَلَّى اللهُ عَليهِ وسَلَّم) بر آن‌ها تصریح کرده است. و اولین بار که خداوند متعال آن‌ها را بر زبان آدم (علیه السلام) آشکار کرد، او اولین کسی بود که از این گنج در طواف کعبه انفاق کرد، هنگامی که جبرئیل او را فرود آورد و او را به طواف کعبه برد. پس [آدم] از او پرسید: شما در طواف این خانه چه می‌گفتید؟ جبرئیل (علیه السلام) گفت: ما در طواف این خانه می‌گفتیم: «سبحان الله والحمد لله ولا إله إلا الله والله أكبر» (خداوند منزه است و ستایش از آن خداست و هیچ معبودی جز خدا نیست و خدا بزرگ‌تر است). پس خداوند به آدم و فرزندانش کلمه «لا حول ولا قوة إلا بالله العلي العظيم» را عطا کرد، از جایی که فرشتگان آن را نمی‌دانستند. آدم به جبرئیل (علیه السلام) گفت: و من بر شما می‌افزایم: «لا حول ولا قوة إلا بالله العلي العظيم». پس این [ذکر] برای فرزندان او و هر طواف‌کننده‌ای تا روز قیامت، سنتی در ذکر طواف باقی ماند. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) خبر داد که این کلمه از گنجی زیر عرش به آدم (علیه السلام) عطا شده است.\n\nپس گنج‌های ذخیره‌شده زیر عرش، در حقیقت در نشأت ما ذخیره شده‌اند. هنگامی که خداوند بخواهد گنجی از آن‌ها را آشکار کند، آن را بر زبان‌های ما ظاهر می‌سازد و آن را وسیله تقرب به خود قرار می‌دهد، و انفاق آن، نطق به آن است. و همچنین است همه آنچه را که ذخیره کرده است، چه آنچه در آن تقرب باشد و چه آنچه تقرب نباشد. آنچه ذخیره شده نیست، بلکه در همان لحظه بر زبان بنده خلق می‌شود. و صورت ذخیره‌سازی آن، از آنجا که جز امر وجودی ذخیره نمی‌شود، این بود که وقتی خداوند اراده کرد این امر ذخیره‌شده را ایجاد کند، در صورت آدمیت تجلی کرد، سپس با این امری که می‌خواست برای ما یا برای هر که از خلقش بخواهد ذخیره کند، سخن گفت. هنگامی که با آن سخن گفت، آن مکان که در آن ذخیره می‌شود، آن را شنید و بر آن نگه داشت. پس هنگامی که خداوند آن مکان را به صورت [بشری] ایجاد کرد، این گنج در نطق آن صورت ظاهر شد و از ظهور آن نزد خدا بهره برده شد، سپس پیوسته در زبان‌های ذاکرین، همیشه و ابداً منتقل می‌شود. و این [ذکر] تنها در کسی که ابتدا از او ظاهر شده، گنج بوده است، نه در هر کسی که به حکم انتقال و حفظ از او ظاهر می‌شود. و همچنین است هر کس که سنتی نیکو را ابتدا کند، بدون آنکه از مخلوقی دریافت کرده باشد، بلکه مستقیماً از خدا به او رسیده باشد، آن حسنه گنجی است که خداوند آن را در این بنده از وجه خاص ذخیره کرده است، سپس بنده برای آشکار ساختن آن، به آن نطق می‌کند، مانند کسی که مالی را که در صندوق خود ذخیره کرده، انفاق می‌کند. این است صورت ذخیره‌سازی (الاكتناز)، اگر فهمیدی. پس ذخیره‌سازی تنها از وجه خاص الهی است و غیر از آن، ذخیره‌سازی نیست. پس اولین کسی که به آن نطق می‌کند، محل ذخیره‌سازی است که خداوند آن را در او ذخیره کرده است. و در حق کسی که آن را از او دریافت می‌کند، ذکر مقربی است که به گنج بودن توصیف شده است. پس این‌ها همه رموز او هستند، زیرا همه گنج‌های اویند. و پس از آنکه تو را از صورت گنج و ذخیره‌سازی و چگونگی امر در آن آگاه ساختم، تا بدانی که تو گنج چه چیزی هستی، یعنی محل ذخیره‌سازی چه امری هستی و محل ذخیره‌سازی چه امری نیستی، اگر آن را از دیگری تلقین یا دریافت کنی. پس در آن هنگام بهره خود را از پروردگارت و آنچه تو را به آن از مشرب‌های نبوت اختصاص داده است، می‌دانی. پس در آن هنگام در آنچه خدا را به آن عبادت می‌کنی، بر بینه‌ای از پروردگارت خواهی بود، و در آنچه محل ذخیره‌سازی آن هستی، وارث نخواهی بود، بلکه موروث خواهی بود. پس آنچه را به ارث می‌بری و آنچه از تو به ارث برده می‌شود، محقق کن. و از همین باب است مسئله بلال که رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) در مورد آن برای ما تصریح کرد، در این سخن او به بلال که: «به چه چیز بر من در رفتن به بهشت پیشی گرفتی؟» [پیامبر] از او استفهام می‌کند، در حالی که می‌دانست پیشی گرفتن از آنِ خود او (صَلَّى اللهُ عَليهِ وسَلَّم) است. پس هنگامی که بلال آنچه را که برای ما تصریح شده بود، ذکر کرد، [پیامبر] فرمود: «به آن دو [حالت]»، یعنی به آن دو حالت. پس هر کس بر اساس آن عمل کند، پاداش عمل را دارد، و بلال پاداش سنت‌گذاری و پاداش عمل تو را با هم دارد. این فایده محل ذخیره‌سازی بودن انسان است. اما سنت‌گذاری شر، ذخیره‌سازی الهی نیست، بلکه امری طبیعی است.\n\nزیرا پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در حالی که به ما تعلیم می‌دهد، می‌فرماید: «و خیر تماماً در دستان توست»، یعنی تو کسی هستی که آن را در بندگانت ذخیره کرده‌ای، پس به واسطه قرار دادن تو در ایشان و ذخیره‌سازی توست، و به همین دلیل عمل به آن، وسیله تقرب به تو می‌شود. سپس فرمود: «و شر به سوی تو نیست»، یعنی آن را در بندگانت ذخیره نکرده‌ای. و این همان قول خداوند متعال است: «هر نیکی که به تو رسد، از جانب خداست» (ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله)، یعنی تعریف به آن از نزد خداست، و حکم به اینکه این از خداست و این از نفس توست، و این خیر است و این شر. این معنای «همه از نزد خداست» (كُلٌّ من عِنْدِ الله) می‌باشد. و به همین دلیل در حق کسانی که آنچه را ذکر کردیم، ندانستند، فرمود: «این قوم را چه شده که نزدیک نیست سخنی را بفهمند؟» (فَما لِهؤُلاءِ الْقَوْمِ لا يَكادُونَ يَفْقَهُونَ حَدِيثاً)، یعنی چه شده که آنچه را به ایشان گفتم، نمی‌فهمند؟ زیرا من گفته‌ام: «هر نیکی که به تو رسد، از جانب خداست» (ما أَصابَكَ من حَسَنَةٍ فَمِنَ الله) و «هر بدی که به تو رسد، از نفس توست» (ما أَصابَكَ من سَيِّئَةٍ فَمِنْ نَفْسِكَ). پس احتمال را برداشتم یا بر امر آن‌گونه که هست، تصریح کردم. پس هنگامی که گفتم: «همه از نزد خداست» (كُلٌّ من عِنْدِ الله)، عارف به خدا می‌داند که منظور من حکم و اعلام به این است که آن از نزد خداست، نه عین بدی. و چون رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) این را دانست، فرمود: «و خیر تماماً در دستان توست و شر به سوی تو نیست.»\n\nو همچنین است قول خداوند متعال: «سوگند به نفس و آنکه آن را سامان داد، پس فجور و تقوای آن را به او الهام کرد» (ونَفْسٍ وما سَوَّاها فَأَلْهَمَها فُجُورَها وتَقْواها). [خداوند الهام کرد] که فجور، فجور است و تقوا، تقواست، تا میان فجور و تقوا جدایی افکند، زیرا نفس محل ظهور هر دو امر در آن است. پس چه بسا امر بر او مشتبه شود و گمان کند که همه آن تقواست. پس خداوند در آنچه به او الهام کرد، به او آموخت که فجور از تقوا نزد او متمایز شود. و به همین دلیل با الهام آمد و با امر نیامد، زیرا «خداوند به کار زشت فرمان نمی‌دهد» (إِنَّ الله لا يَأْمُرُ بِالْفَحْشاءِ) و فجور، فحشاء است. پس ذکر برای اصل است که قطب است، و دو تحمید، یعنی تحمید در خوشی و تحمید در ناخوشی، هنگامی که تحمید به زبان شرع تقسیم شد، میان قول در خوشی: «الحمد لله المنعم المفضل» (ستایش از آن خداست که نعمت‌دهنده و فضل‌کننده است) و قول در ناخوشی: «الحمد لله على كل حال» (ستایش از آن خداست در هر حال). و در هستی (الکون) برای او جز حالتی که شاد کند یا حالتی که زیان رساند، نیست. و برای هر حالتی تحمیدی است. پس آن را این‌گونه بر دو امام تقسیم کرد. این‌ها سه نفرند که مراتبشان را بیان کردم. و چون جهت‌هایی که شیطان از آن‌ها به انسان می‌آید، چهار جهت است، و آن قول خداوند متعال در کتابش از قول ابلیس است: «سپس از پیش رو و از پشت سر و از راست و از چپشان بر آنان می‌آیم» (ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ)، و بر هر یک از این جهت‌ها کسی ایستاده است که ایمان انسان را از آن حفظ می‌کند، اوتاد را چهار نفر قرار داد، به دلیل ملازمتشان با این جهت‌ها. برای هر وتد یک جهت، یعنی غلبه حفظ آن جهت خاص بر اوست، هرچند حفظ سایر جهت‌ها را نیز داشته باشد. مانند [حدیث]: «فرض‌دان‌ترین شما زید است و قاضی‌ترین شما علی». و مانند جماعتی که چیزی را حمل می‌کنند که یک نفر به تنهایی قادر به حمل آن نیست. پس هر یک از افراد جماعت در حمل آن نیرویی دارد، و غالب نیروی او حمل آن بخشی است که مستقیماً با آن در تماس است. اگر جماعت نبود، این بار منتقل نمی‌شد، زیرا هر یک به تنهایی قادر به حمل آن نیست. پس به واسطه مجموع، حمل صورت گرفت. این امر نیز چنین است. این‌ها هفت نفرند. و اما ابدال، حفظ هفت صفت را در تصرف صاحب آن صفات دارند، زیرا آن صفات تصرفی در خیر و تصرفی در شر دارند. پس ابدال، تصرف خیر را بر صاحبش حفظ می‌کنند و او را از تصرف آن صفات در شر باز می‌دارند. این است مجموع چهارده نفری که برای قومی از مؤمنان که می‌اندیشند، اگر انصاف ورزند، ذکر کردیم. و هر کس حفظ آنچه را ذکر کردیم، به دست آورد، او معصوم است و آن عصمت است. در ظاهر و باطن جز این دو نیست. و خداوند به هر چیزی داناست (والله بِكُلِّ شَيْ‏ءٍ عَلِيمٌ). و هنگامی که این را دانستی و قفل آن برایت گشوده شد، برای هر یک از کسانی که برایت تعیین کردیم، بر اساس آنچه از اسماء الهی، حروف رقمی معین، فهم‌های موروث از پیامبران مذکور، و ارواح نوریه دارد، حرکت می‌کنی. پس همه آنچه را ذکر کردیم، به صورت ذوق و کشف (الکشف) معنای آن برایت حاصل می‌شود. پس از به کار بردن آن غافل مشو. و در این منزل از علوم، علم اذکار مقرب به خداوند متعال، علم اسماء الهی، و علم اختصاص رحمت و شمول آن، علم اسماء مرکبه که از آن خداست، علم عواقب امور، علم عالم، علم مراتب سیادت در عالم، علم ثنا به ثنا، علم مُلک و ملکوت، علم زمان، علم جزا، علم استناد، علم تعاون، علم عبادت، علم بیان و تبیین، علم راه‌های سعادت، علم نعمت و نعمت‌دهنده و انعام، علم اسباب طرد از سعادتی که شقاوت در آن راه ندارد، علم حیرت و حیرت‌زدگان، علم سائل و مجیب، علم تعریف به ذات و اضافه، و اینکه کدام یک از این دو تعریف قوی‌تر است. این‌ها مادران علومی هستند که این منزل در بر دارد. و تفصیلات هر یک از این علوم، جز برای خداوند متعال نامحدود است، یعنی با علم به آن‌ها می‌داند که نامحدودند، زیرا پایانی ندارند. و از این علوم است که افزایش در علم برای کسی که آن را طلب کند یا بدون طلب به او عطا شود، حاصل می‌گردد، و آن قول [خداوند] است: «و بگو پروردگارا، علم مرا زیاد کن» (وقُلْ رَبِّ زِدْنِي عِلْماً). زیرا اگرچه علم در ذات خود متناهی است، اما معلوم پایان نمی‌پذیرد.\n\nو نفس را از گفتن به پایان یافتن [علم] نهی کردم\nاما او پایان نپذیرفت\n\nبه دلیل جهلش به امر در ذات خود\nاز این رو گفت که پایان می‌پذیرد\n\nو گروهی از ایشان را دیدیم\nکه در مکه در بیابانی سرگردان بودند\n\nاوهامشان بر ایشان حکم رانده بود\nپس صاحب خرد از نادان جدا شد\n\n### [عالم انسان، مُلک خداوند متعال بود]\n\nو بدان که چون عالم انسان مُلک خداوند متعال بود، حق (الحق) تعالی نیز به واسطه تدبیر و تفصیل در آن، مالک این مُلک بود. و به همین دلیل، خود را چنین توصیف کرد که: «لشکرهای آسمان‌ها و زمین از آن خداست» (لِلَّهِ جُنُودُ السَّماواتِ والْأَرْضِ) و فرمود: «و لشکرهای پروردگارت را جز او نمی‌داند» (وما يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ). پس او تعالی حافظ این شهر انسانی است، زیرا این شهر، حضرت اوست که او را در خود جای داده و عین مملکت اوست. و خود را به جنود و قدرت توصیف نکرد، مگر آنکه می‌دانست که مشیت او در خلقش سبقت گرفته است که برای او منازعی بیافریند که در حضرتش با او منازعه کند و در مُلک او بر او بشورد، به واسطه نفوذ مشیت او در آن و علم سابق و کلمه او که تبدیل نمی‌شود. او را حارث نامید و برای او سواره و پیاده قرار داد و او را بر این انسان مسلط کرد. پس این دشمن با سواره و پیاده‌اش بر این مُلک انسانی هجوم آورد و او را به فریب وعده داد و با سفیران خواطرش که میان او و انسان در حرکتند. پس خداوند در مقابل لشکرهای او، لشکرهای فرشتگانش را قرار داد. هنگامی که دو لشکر با هم روبه‌رو شدند، و او [انسان] در قلب لشکر خود بود، خداوند برای او میمنه (سمت راست)، میسره (سمت چپ)، مقدمه و ساقه (عقب) قرار داد. و خداوند ما را به این آگاه ساخت تا از این جهت‌ها از او حذر کنیم. پس خداوند متعال به ما فرمود که این دشمن گفته است: «سپس از پیش رو و از پشت سر و از راست و از چپشان بر آنان می‌آیم» (ثُمَّ لَآتِيَنَّهُمْ من بَيْنِ أَيْدِيهِمْ ومن خَلْفِهِمْ وعَنْ أَيْمانِهِمْ وعَنْ شَمائِلِهِمْ). و او در قلب لشکر خود در باطن انسان است. پس خداوند این مُلک انسانی را حفظ کرد به اینکه خداوند در قلب این لشکر و این سپاه انسانی، در مقابل قلب لشکر شیطان قرار گرفت. و بر میمنه آن، اسم «الرب» (پروردگار) و بر میسره آن، اسم «الملک» (پادشاه) و بر مقدمه آن، اسم «الرحمن» (بخشاینده) و در ساقه آن، اسم «الرحیم» (مهربان) را قرار داد. و اسم «الهادی» (هدایت‌کننده) را قرار داد که با رسالت اسم «الرحمن» که در مقدمه است، به سوی این شیطان حرکت کند.\n\nو او شیطان جن نیست، بلکه منظورم شیطان انس است، زیرا خداوند می‌فرماید: «شیاطین انس و جن» (شَياطِينَ الْإِنْسِ والْجِنِّ) و فرمود: «از شر وسوسه‌گر پنهان‌شونده، آنکه در سینه‌های مردم وسوسه می‌کند، از جن و انس» (من شَرِّ الْوَسْواسِ الْخَنَّاسِ الَّذِي يُوَسْوِسُ في صُدُورِ النَّاسِ من الْجِنَّةِ والنَّاسِ). زیرا شیاطین انس بر ظاهر و باطن انسان سلطه دارند، و شیاطین جن، نواب شیاطین انس در بواطن مردم هستند. و شیاطین جن کسانی هستند که آراء را بر شیاطین انس وارد می‌کنند و دولت آن‌ها را تدبیر می‌کنند، و احکامی را که باید در آن آشکار سازند، برایشان تفصیل می‌دهند. و نبرد پیوسته بر این انسان مؤمن به طور خاص در جریان است. خداوند از او دفاع می‌کند تا ایمانش را حفظ کند، و ابلیس بر او می‌جنگد تا او را به سوی خود بازگرداند و ایمان را از او سلب کند و از روی حسد او را از راه سعادتش خارج سازد. زیرا هنگامی که او را خارج ساخت، از او بیزاری می‌جوید (تَبَرَّأَ مِنْهُ) و در برابر پروردگارش که مقدم صاحب میمنه است، به زانو در می‌آید و او را سفیری میان خود و اسم «الرحمن» قرار می‌دهد. و خداوند ما را به همه این‌ها آگاه ساخت تا مکر و حیله‌های او را بشناسیم. پس او به انسان می‌گوید، در حالی که آن را برایش زینت می‌دهد: «کافر شو». و هنگامی که کافر شد، به او می‌گوید: «من از تو بیزارم، من از خدا، پروردگار جهانیان، می‌ترسم» (إِنِّي بَرِي‏ءٌ مِنْكَ إِنِّي أَخافُ الله رَبَّ الْعالَمِينَ). «پس عاقبت هر دوی آن‌ها این شد که در آتش جاودانه باشند» (فَكانَ عاقِبَتَهُما أَنَّهُما في النَّارِ خالِدَيْنِ فِيها). زیرا کفر در اینجا همان شرک است و آن ظلمی بزرگ است. و به همین دلیل فرمود: «و این است جزای ستمکاران» (وذلِكَ جَزاءُ الظَّالِمِينَ)، منظورش مشرکان است، زیرا آنان کسانی هستند که ایمان خود را به ظلم آلودند. و رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آن را به آنچه لقمان به پسرش گفت، تفسیر کرد: «ای پسرک من، به خدا شرک میاور، زیرا شرک ظلمی بزرگ است» (يا بُنَيَّ لا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ). پس با این تفسیر دانستیم که منظور خداوند از ایمان در قولش: «و ایمان خود را به ظلم نیالودند» (ولَمْ يَلْبِسُوا إِيمانَهُمْ بِظُلْمٍ)، ایمان به توحید خداست، زیرا شرک را جز توحید مقابله نمی‌کند. پس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) چیزی را دانست که صحابه ندانستند. و به همین دلیل، کسانی از علما که تأویل را ترک کردند، آن را نگفتند و بر ظاهر اعتماد کردند و آن را به خدا واگذار کردند، زیرا فرمود: «و تأویل آن را جز خدا نمی‌داند» (وما يَعْلَمُ تَأْوِيلَهُ إِلَّا الله). پس هر کس که خداوند او را به آنچه در قولش اراده کرده، آگاه سازد، آن را به اعلام خدا می‌داند، نه به نظر خود. و از رحمت خداوند بر خلقش این است که متأولین از اهل آن زبان را که به آن عالمند، اگر در تأویل خود در آنچه رسولشان به آن تلفظ کرده، خطا کنند، چه در آنچه از جانب خدا ترجمه کرده و چه در آنچه به او تشریع شده که آن را به صورت قول و فعل تشریع کند. و در میان همه منازل الهی، با وجود کثرت آن‌ها، چه آنچه در این کتاب ذکر کردیم و چه آنچه ذکر نکردیم، منزلی نیست که انصاف دهد و حقوق را ادا کند و حجتی برای خدا و خلقش بر خود باقی نگذارد، و حق ربوبیت و حق عبودیت را به طور کامل ادا کند، و جز بنده و رب در آن نباشد، مگر این منزل به طور خاص. خداوند این‌گونه ما را به آنچه به اهل طریق خدا الهام کرده، آگاه ساخته است، که عادت بر این جاری شده که خداوند ورثه پیامبرانش را از آن آگاه سازد. و این منزلی غریب و شگفت‌انگیز است که اول آن شامل همه آن است و همه آن شامل تمام منازل است. و من ندیدم کسی به آن متحقق شده باشد، جز یک شخص کامل در ولایتش که او را در اشبیلیه ملاقات کردم و با او مصاحبت داشتم، و او در این منزل بود و تا زمان مرگش بر آن باقی ماند، خدا او را رحمت کند. و غیر از این شخص، کسی را ندیدم، با اینکه هیچ منزل و نحله و ملکه‌ای را نمی‌شناسم، مگر اینکه قائلی به آن و معتقدی به آن و منصفی به آن با اعتراف از جانب خود دیده‌ام. پس هیچ مذهب و نحله‌ای را نقل نمی‌کنم، مگر از اهل آن که به آن قائلند، هرچند ما آن را از طریق خاص از خدا آموخته باشیم. اما ناگزیر است که خداوند قائلی به آن را به ما نشان دهد تا فضل خدا بر من و عنایت او به من را بدانم. تا جایی که به من اعلام شد که در عالم کسی هست که به پایان یافتن علم خدا در خلقش قائل است و اینکه ممکنات متناهی هستند و امر ناگزیر به نیستی و نابودی می‌پیوندد و حق، حق برای ذات خود باقی می‌ماند و عالمی وجود ندارد. پس در مکه کسی را دیدم که به این قول قائل بود و با اعتقاد به آن برای من تصریح کرد. او از اهل سوس از سرزمین‌های مغرب اقصی بود که با ما حج کرد و به ما خدمت نمود و بر این مذهب اصرار می‌ورزید تا اینکه نزد ما به آن تصریح کرد. و من نتوانستم او را از آن بازگردانم و نمی‌دانم پس از جدایی از ما آیا از آن برگشت یا بر آن مرد. او علوم فراوان و فضلی داشت، اما دین نداشت، بلکه آن را تنها به صورت عصمتی برای خون خود برپا می‌داشت. این گفته او به من است و مذهبش این را به او می‌دهد. و در مراتب جهل، جهلی بزرگ‌تر از این جهل نیست. و خداوند حق می‌گوید و او راه را هدایت می‌کند (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ). سفر بیست و هفتم با پایان یافتن باب سیصد و هشتاد و سوم به اتمام رسید. و خدا ما را کافی است و او بهترین وکیل است (حَسْبُنَا الله ونِعْمَ الْوَكِيلُ).\n\nبه نام خداوند بخشنده مهربان."
  },
  "page_count": 5
}