{
  "id": 524,
  "title": {
    "ar": "الباب الرابع والعشرون وخمسمائة في معرفة حال قطب كان منزله قُلْ لَوْ كانَ الْبَحْرُ مِداداً لِكَلِماتِ رَبِّي لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِماتُ رَبِّي ولَوْ جِئْنا بِمِثْلِهِ مَدَداً",
    "en": "Chapter Five Hundred and Twenty-Four, Concerning the Knowledge of the State of a Pole (قطب) Whose Station (منزل) Was: <<Say: If the sea were ink for the words of my Lord, the sea would surely be exhausted before the words of my Lord were exhausted, even if We brought the like of it as a supplement.>>",
    "ur": "باب پانچ سو چوبیسواں، ایک ایسے قطب (قطب) کے حال کی معرفت (المعرفۃ) میں جس کا مقام یہ تھا: قُلْ لَوْ كانَ الْبَحْرُ مِداداً لِكَلِماتِ رَبِّي لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِماتُ رَبِّي ولَوْ جِئْنا بِمِثْلِهِ مَدَداً (کہہ دو کہ اگر میرے رب کے کلمات کے لیے سمندر سیاہی بن جائے تو سمندر ختم ہو جائے گا اس سے پہلے کہ میرے رب کے کلمات ختم ہوں، اگرچہ ہم اس کی مانند مزید مدد کے لیے لے آئیں۔)",
    "fa": "باب پانصد و بیست و چهارم در شناخت حال قطبی (Qutb) که منزل او این بود: «قُلْ لَوْ كانَ الْبَحْرُ مِداداً لِكَلِماتِ رَبِّي لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِماتُ رَبِّي ولَوْ جِئْنا بِمِثْلِهِ مَدَداً» (بگو: اگر دریا برای کلمات پروردگارم مرکّب شود، پیش از آنکه کلمات پروردگارم پایان یابد، دریا پایان می‌یابد، هر چند همانند آن را به کمک بیاوریم)."
  },
  "content": {
    "ar": "## (الباب الرابع والعشرون وخمسمائة في معرفة حال قطب كان منزله قُلْ لَوْ كانَ الْبَحْرُ مِداداً لِكَلِماتِ رَبِّي لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِماتُ رَبِّي ولَوْ جِئْنا بِمِثْلِهِ مَدَداً)\n\n\n> ولو أن البحار لنا مداد *** وأشجار المهاد لنا يراع‏\n\n\n> وجاء صريفها في اللوح يسعى *** وحركنا لذلكم السماع‏\n\n\n> لما نفدت له كلمات ربي *** وساوى القاع في المجد اليفاع‏\n\n\n### [إن الصور الممكنات هي كلمات الله‏]\n\n\nقال الله عز وجل ولَوْ أَنَّ ما في الْأَرْضِ من شَجَرَةٍ أَقْلامٌ والْبَحْرُ يَمُدُّهُ من بَعْدِهِ سَبْعَةُ أَبْحُرٍ ما نَفِدَتْ كَلِماتُ الله وقال تعالى وكَلِمَتُهُ أَلْقاها إِلى‏ مَرْيَمَ ورُوحٌ مِنْهُ ليست كلمات الله سوى صور الممكنات وهي لا تتناهى وما لا يتناهى لا ينفد ولا يحصره الوجود فمن حيث ثبوته لا ينفد فإن خزانة الثبوت لا تعطي الحصر فإنه ليس لاتساعها غاية تدرك فكلما انتهيت في‏\nوهمك في اتساعها إلى غاية فهو من وراء تلك الغاية ومن هذه الخزانة تظهر كلمات الله في الوجود على التتالي والتابع أشخاصا بعد أشخاص وكلمات أثر كلمات كلما ظهرت أولاها أعقبتها بالوجود أخراها والبحار والأقلام من جملة الكلمات فلو كانت البحار مدادا ما انكتب بها سوى عينها وبقيت الأقلام والكلمات الحاصلة في الوجود ما لها ما تكتب به مع تناهيها بدخولها في الوجود فكيف بما لم يحصره الوجود من شخصيات الممكنات فهذا حكم الممكن فما ظنك بالمعلومات التي الممكنات جزء منها وهذا من أعجب ما يسأل عنه مساوات الجزء والبعض للكل في الحكم عليه بعدم التناهي مع معقولية التفاضل بين المعلومات والممكنات ثم إنه ما من شخص من الأشخاص من المعلومات ولا من الممكنات إلا واستمراره لا يتناهى ومع هذا يتأخر بعضه عمن تقدمه فقد نقص عن تقدمه وفضل عليه من تقدمه وكل واحد لا يتصف في استمراره بالتناهي فقد وقع الفضل والنقص فيما لا يتناهى ووجود الحق ما هو بالمرور فيتصف بالتناهي وعدم التناهي فإنه عين الوجود والموجود هو الذي يوصف بالمرور عليه فالذي لا يتناهى المرور عليه وهو في عينه من حيث إنه موجود متناه لأنه على حقيقة في عينه متميز بها عمن ليست له تلك الحقيقة التي بها يكون هو وليست إلا عين هويته فهو الموجود ولا يتصف بالتناهي ولا يوصف أيضا بأنه لا يتناهى لوجوده فمن حيث إنه ينتهي هو لا ينتهي بخلاف حكم المحدثات في ذلك ولا يعلم المحدثات ما هي إلا من يعلم ما هو قوس قزح واختلاف ألوانه كاختلاف صور المحدثات ثم أنت تعلم أنه ما ثم متلون ولا لون مع شهودك ذلك كذلك شهودك صور المحدثات في وجود الحق الذي هو الوجود فتقول ثم ما ليس ثم لأنك لا تقدر أن تنكر ما تشهد وأنت تشهد كما لا تقدر أن تجهل ما أنت تعلمه وأنت تعلم والمعلوم في هذه المسألة خلاف المشهود فالبصر يقول ثم والبصيرة تقول ما ثم ولا يكذب واحد منهما فيما يخبر به فأين كلمات الله التي لا تنفد وما ثم إلا الله والواقف بين الشهود والعلم حائر لتردده بينهما والمخلص لأحدهما غير حائر منحاز لمن يخلص إليه كان ما كان‏\n\n\n> والحق معط ذا وذا *** فخذ به هذا وذا\n\n\n> ولا تكن عن كل ما *** أعطاكه منتبذا\n\n\n> ومن يكن يعرف ذا *** يكن إماما جهبذا\n\n\n> فكل من يقول ذا *** لا بد أن يقول ذا\n\n\n> بينهما يبدو الذي *** يصرفه عن ذا وذا\n\n\n> وقال أقوام بذا *** وقال أقوام بذا\n\n\n> فهكذا فلتعرف *** الأشياء حقا هكذا\n\n\n### [الوجود كله حروف وكلمات‏]\n\n\nفالوجود كله حروف وكلمات وسور وآيات فهو القرآن الكبير الذي لا يَأْتِيهِ الْباطِلُ من بَيْنِ يَدَيْهِ ولا من خَلْفِهِ فهو محفوظ العين فلا يتصف بالعدم لأن العدم نفي الشيئية والشيئية معقولة وجودا وثبوتا وما ثم رتبة ثالثة فإذا سمعت نفي شيئية فإنما ينفي النافي عن شيئية الثبوت شيئية الوجود خاصة فإن شيئية الثبوت لا تنفيها شيئية الوجود فقوله ولَمْ تَكُ شَيْئاً هو شيئية الوجود لأنه جاء بلفظ تك وهي حرف وجودي فنفاه بلم وكذلك لَمْ يَكُنْ شَيْئاً مَذْكُوراً والذكر وجود فاعلم ذلك والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Five Hundred and Twenty-Four: Concerning the Knowledge of the State of a Pole (Qutb) whose Station was <<Say: If the sea were ink for the words of my Lord, the sea would surely be exhausted before the words of my Lord were exhausted, even if We brought the like of it as a supplement.>> (Quran 18:109)\n\nAnd if the seas were ink for us,\nAnd the trees of the earth were our pens,\n\nAnd their scratching sound came running upon the Tablet,\nAnd we were moved by that audition,\n\nThe words of my Lord would not be exhausted for Him,\nAnd the low ground (al-Qā‘) would equal the high ground (al-Yifā‘) in glory.\n\n### [The Forms of the Contingents are the Words of Allah]\n\nAllah Almighty said: <<And if whatever trees on earth were pens, and the sea, with seven more seas added to it, were ink, the words of Allah would not be exhausted.>> (Quran 31:27) And He Almighty said: <<and His Word which He cast unto Mary, and a Spirit from Him.>> (Quran 4:171)\n\nThe words of Allah (كلمات الله) are nothing other than the forms of the contingents (صور الممكنات), and these are without end (لا تتناهى). That which is without end is not exhausted, nor is it encompassed by Existence (الوجود). From the perspective of its immutability (ثبوته), it is not exhausted, for the Treasury of Immutability (خزانة الثبوت) does not permit limitation. For there is no perceivable limit to its vastness; whenever you reach a limit in your imagination (وهمك) regarding its vastness, it lies beyond that limit.\n\nFrom this Treasury, the words of Allah appear in Existence (الوجود) sequentially and successively, person after person, and word following word. Whenever the first of them appears, the last follows it into Existence.\n\nThe seas and the pens are among the words (الكلمات). If the seas were ink, nothing would be written by them except their own essence (عينها). The pens and the words realized in Existence would remain without anything to write with, despite their finitude (تناهيها) due to their entry into Existence. How then about the individualities (شخصيات) of the contingents that Existence has not encompassed?\n\nThis is the ruling concerning the contingent (الممكن). What then do you think of the objects of Knowledge (المعلومات), of which the contingents are but a part? This is one of the most astonishing matters to inquire about: the equality of the part and the portion to the whole in the judgment of their being without end (عدم التناهي), despite the intelligibility of the difference in rank (التفاضل) between the objects of Knowledge and the contingents.\n\nFurthermore, there is no individual (شخص) among the objects of Knowledge or the contingents whose continuation (استمراره) is not without end. Yet, some of them lag behind those who preceded them, thus falling short of their precedence, while those who preceded them possess superiority over them. Since the continuation of every single one is not characterized by finitude (التناهي), superiority and deficiency have occurred within that which is without end.\n\nThe Existence of the Real (وجود الحق) is not characterized by passage (المرور), so it is not described by finitude or lack of finitude. For He is the very Essence (عين) of Existence (الوجود), and it is the existent (الموجود) that is described by passage over it. Thus, that over which passage is without end, is, in its essence (عينه) insofar as it is an existent, finite (متناه), because it possesses a specific reality (حقيقة) in its essence by which it is distinguished from that which does not possess that reality by which it exists—and that reality is nothing but the very essence of its identity (هويته). Therefore, it is the existent, and it is not characterized by finitude, nor is it described as being without end due to its existence. From the perspective that it ends, it does not end, contrary to the ruling concerning created things (المحدثات) in this regard.\n\nNo one knows what the created things are except he who knows what the rainbow is, and the variation of its colors is like the variation of the forms of the created things. Then you know that there is neither a colored object nor a color, even while you witness it. Likewise is your witnessing (شهودك) the forms of the created things in the Existence of the Real (وجود الحق), which is Existence itself (الوجود). So you say, \"There is what is not there,\" because you cannot deny what you witness while you are witnessing, just as you cannot be ignorant of what you know while you are knowing.\n\nThe known (المعلوم) in this matter is contrary to the witnessed (المشهود). The physical sight (البصر) says, \"It is there,\" while the inner sight (البصيرة) says, \"It is not there.\" Neither of them lies in what it reports. Where then are the words of Allah that are not exhausted, when there is nothing there but Allah?\n\nThe one standing between Witnessing (الشهود) and Knowledge (العلم) is bewildered due to his oscillation between the two, while the one who is sincere to one of them is not bewildered, having inclined toward the one he is sincere to, whatever the outcome may be.\n\nThe Real (الحق) grants both this and that,\nSo take hold of both this and that.\n\nAnd do not be one who rejects\nAll that He has granted you.\n\nAnd whoever knows this\nShall be a brilliant, learned Imam.\n\nFor everyone who affirms this\nMust necessarily affirm that.\n\nBetween the two appears that which\nTurns him away from this and that.\n\nAnd some people spoke of this,\nAnd other people spoke of that.\n\nThus, let the things be known\nTruly, in this manner.\n\n### [All Existence is Letters and Words]\n\nAll Existence (الوجود) is letters (حروف), words (كلمات), chapters (سور), and verses (آيات); thus, it is the Great Quran, <<Falsehood cannot approach it from before it or from behind it.>> (Quran 41:42) Therefore, its essence (العين) is preserved, and it is not characterized by non-existence (العدم).\n\nBecause non-existence is the negation of thingness (الشيئية), and thingness is intelligible both in Existence (وجودا) and in Immutability (ثبوتا), and there is no third level (رتبة ثالثة). So, when you hear the negation of thingness, the negator is only negating the thingness of Existence (شيئية الوجود) specifically from the thingness of Immutability (شيئية الثبوت). For the thingness of Immutability is not negated by the thingness of Existence.\n\nThus, His saying <<and you were nothing>> (Quran 19:9) refers to the thingness of Existence, because He used the word *taku* (تَكُ), which is a letter of existence, and negated it with *lam* (لَمْ). Likewise, <<was he not a thing unmentioned?>> (Quran 76:1). Mention (*dhikr*) is existence, so know that. And Allah <<says the Truth, and He guides to the way.>> (Quran 33:4)",
    "ur": "باب نمبر پانچ سو چوبیس: اس قطب کے حال کی معرفت میں جس کا مقام یہ تھا: \"کہہ دیجیے کہ اگر میرے رب کے کلمات کے لیے سمندر سیاہی بن جائے تو سمندر ختم ہو جائے گا اس سے پہلے کہ میرے رب کے کلمات ختم ہوں، اگرچہ ہم اس کی مدد کے لیے ویسا ہی ایک اور (سمندر) لے آئیں۔\" (سورۃ الکہف، ۱۸:۱۰۹)\n\nاور اگر سمندر ہمارے لیے سیاہی بن جائیں\nاور زمین کے درخت ہمارے لیے قلم بن جائیں\n\nاور ان کی چرچراہٹ لوح میں دوڑتی ہوئی آئے\nاور ہم اس سماع (سننے) کے لیے حرکت کریں\n\nتب بھی میرے رب کے کلمات ختم نہ ہوں گے\nاور پست زمین عظمت میں بلندی کے ساتھ برابر ہو جائے گی\n\n### ممکنات کی صورتیں ہی اللہ کے کلمات ہیں۔\n\nاللہ عزوجل نے فرمایا: \"اور اگر زمین میں جتنے درخت ہیں وہ سب قلم بن جائیں اور سمندر، اس کے بعد سات سمندر اور بھی اس کی مدد کریں، تب بھی اللہ کے کلمات ختم نہ ہوں گے۔\" (سورۃ لقمان، ۳۱:۲۷) اور اللہ تعالیٰ نے فرمایا: \"اور اس کا کلمہ جسے اس نے مریم کی طرف ڈالا اور ایک روح اس کی طرف سے۔\" (سورۃ النساء، ۴:۱۷۱)\n\nاللہ کے کلمات ممکنات کی صورتوں کے سوا کچھ نہیں ہیں، اور وہ لامتناہی ہیں۔ اور جو لامتناہی ہے وہ ختم نہیں ہوتا اور نہ ہی ہستی (الوجود) اسے محدود کر سکتی ہے۔ پس ثبوت کے لحاظ سے وہ ختم نہیں ہوتے، کیونکہ خزانۂ ثبوت محدودیت نہیں دیتی۔ اس کی وسعت کی کوئی ایسی حد نہیں ہے جسے پایا جا سکے، پس جب بھی تم اپنے وہم میں اس کی وسعت کی کسی حد تک پہنچو گے، تو وہ اس حد سے بھی ماورا ہے۔ اور اسی خزانے سے اللہ کے کلمات ہستی (الوجود) میں تسلسل اور پیروی کے ساتھ ظاہر ہوتے ہیں، ایک شخص کے بعد دوسرا شخص، اور ایک کلمے کے بعد دوسرا کلمہ۔ جب بھی ان میں سے پہلا ظاہر ہوتا ہے، تو دوسرا ہستی (الوجود) میں اس کے پیچھے آ جاتا ہے۔\n\nاور سمندر اور قلم بھی کلمات کے زمرے میں شامل ہیں۔ پس اگر سمندر سیاہی بن جاتے تو ان سے صرف ان کی اپنی حقیقت ہی لکھی جاتی۔ اور ہستی (الوجود) میں موجود قلم اور کلمات باقی رہ جاتے جن کے پاس لکھنے کے لیے کچھ نہ ہوتا، باوجود اس کے کہ وہ ہستی (الوجود) میں داخل ہونے کی وجہ سے متناہی ہیں۔ تو پھر ان ممکنات کی شخصیات کا کیا حال ہوگا جنہیں ہستی (الوجود) نے محدود نہیں کیا؟ یہ تو ممکن کا حکم ہے، تو ان معلومات کے بارے میں تمہارا کیا خیال ہے جن کا ممکنات ایک جزو ہیں؟\n\nاور یہ ان عجیب ترین سوالات میں سے ہے جو پوچھے جاتے ہیں کہ جزو اور بعض کو کل کے ساتھ لامتناہیت کے حکم میں برابر قرار دیا جائے، حالانکہ معلومات اور ممکنات کے درمیان تفاضل (فرق) عقلی طور پر موجود ہے۔ پھر یہ کہ معلومات یا ممکنات میں سے کوئی بھی شخص ایسا نہیں ہے جس کا تسلسل لامتناہی نہ ہو۔ اس کے باوجود، ان میں سے بعض اپنے سے پہلے آنے والے سے پیچھے رہ جاتے ہیں، پس وہ اپنے سے پہلے آنے والے سے کم ہوئے اور پہلے آنے والے نے ان پر فضیلت حاصل کی۔ اور ہر ایک اپنے تسلسل میں تناہیت (محدودیت) سے متصف نہیں ہے، پس فضیلت اور کمی لامتناہی چیز میں واقع ہوئی۔\n\nاور ذات حق (الحق) کی ہستی (الوجود) مرور (گزرنے) سے نہیں ہے کہ وہ تناہیت یا عدم تناہیت سے متصف ہو، کیونکہ وہ عین ہستی (الوجود) ہے۔ اور موجود وہ ہے جس پر مرور (گزرنے) کا وصف کیا جاتا ہے۔ پس جس پر مرور لامتناہی ہو، وہ اپنی ذات میں موجود ہونے کے لحاظ سے متناہی ہے، کیونکہ وہ اپنی ذات میں ایک حقیقت پر قائم ہے جس کے ذریعے وہ اس سے ممتاز ہوتا ہے جس کے لیے وہ حقیقت نہیں ہے جس سے وہ 'وہ' بنتا ہے، اور وہ حقیقت اس کی ہویت (ذات) کے عین کے سوا کچھ نہیں۔ پس وہ موجود ہے۔ اور وہ تناہیت سے متصف نہیں ہوتا، اور نہ ہی اپنی ہستی (الوجود) کی وجہ سے یہ وصف دیا جاتا ہے کہ وہ لامتناہی ہے۔ پس جس لحاظ سے وہ ختم ہوتا ہے، وہ ختم نہیں ہوتا، اس معاملے میں محدثات (نئی پیدا ہونے والی چیزوں) کے حکم کے برعکس۔\n\nاور محدثات کیا ہیں، یہ صرف وہی جانتا ہے جو قوس قزح کو جانتا ہے، اور اس کے رنگوں کا اختلاف محدثات کی صورتوں کے اختلاف کی مانند ہے۔ پھر تم جانتے ہو کہ وہاں نہ کوئی رنگین چیز ہے اور نہ کوئی رنگ، باوجود اس کے کہ تم اس کا شہود (شہود) کرتے ہو۔ اسی طرح تمہارا ذات حق (الحق) کی ہستی (الوجود) میں محدثات کی صورتوں کا شہود (شہود) کرنا ہے جو کہ ہستی (الوجود) ہے۔ پس تم کہتے ہو کہ وہاں وہ ہے جو وہاں نہیں ہے، کیونکہ تم اس چیز کا انکار نہیں کر سکتے جس کا تم شہود (شہود) کر رہے ہو، جبکہ تم شہود کر رہے ہو، جیسا کہ تم اس چیز سے ناواقف نہیں ہو سکتے جسے تم جانتے ہو، جبکہ تم جانتے ہو۔\n\nاور اس مسئلے میں معلوم (علم) مشہود (شہود) کے خلاف ہے۔ پس بصر (آنکھ) کہتی ہے کہ وہاں ہے، اور بصیرت کہتی ہے کہ وہاں نہیں ہے۔ اور ان دونوں میں سے کوئی بھی جھوٹ نہیں بولتا جو وہ خبر دیتا ہے۔ تو اللہ کے وہ کلمات کہاں ہیں جو ختم نہیں ہوتے، جبکہ وہاں اللہ کے سوا کچھ نہیں؟ اور جو شخص شہود (شہود) اور علم کے درمیان کھڑا ہے وہ ان دونوں کے درمیان تردد کی وجہ سے حیران ہے، اور جو ان میں سے کسی ایک کے لیے مخلص ہو جائے وہ حیران نہیں ہوتا، وہ اس کی طرف مائل ہو جاتا ہے جس کے لیے وہ مخلص ہوا، جو بھی ہو۔\n\nاور ذات حق (الحق) دینے والا ہے یہ بھی اور وہ بھی\nپس تم یہ بھی لو اور وہ بھی لو\n\nاور جو کچھ بھی اس نے تمہیں عطا کیا ہے\nاس سے کنارہ کش نہ ہو\n\nاور جو شخص یہ جانتا ہے\nوہ ایک بڑا امام اور عالم ہوتا ہے\n\nپس ہر وہ شخص جو یہ کہتا ہے\nاسے لازماً وہ بھی کہنا پڑتا ہے\n\nان دونوں کے درمیان وہ ظاہر ہوتا ہے\nجو اسے اس سے اور اس سے پھیر دیتا ہے\n\nاور کچھ لوگوں نے اس کے بارے میں کہا\nاور کچھ لوگوں نے اس کے بارے میں کہا\n\nپس چیزوں کو اسی طرح جاننا چاہیے\nحقیقت میں اسی طرح\n\n### پوری ہستی (الوجود) حروف اور کلمات ہے۔\n\nپس پوری ہستی (الوجود) حروف، کلمات، سورتیں اور آیات ہے، لہٰذا یہ وہ قرآن کبیر ہے جس کے آگے یا پیچھے سے باطل نہیں آ سکتا۔ پس یہ عین (حقیقت) کے لحاظ سے محفوظ ہے، لہٰذا یہ عدم سے متصف نہیں ہوتا، کیونکہ عدم، شیئیت (شے ہونے) کی نفی ہے، اور شیئیت ہستی (الوجود) اور ثبوت کے لحاظ سے معقول ہے۔ اور وہاں کوئی تیسرا مرتبہ نہیں ہے۔ پس جب تم شیئیت کی نفی سنتے ہو، تو نفی کرنے والا صرف شیئیت الثبوت سے شیئیت الوجود کی نفی کرتا ہے۔ کیونکہ شیئیت الوجود، شیئیت الثبوت کی نفی نہیں کرتی۔ پس اللہ کا قول: \"اور تم کوئی چیز نہ تھے\" (سورۃ مریم، ۱۹:۶۷) یہ شیئیت الوجود ہے، کیونکہ یہ لفظ 'تک' کے ساتھ آیا ہے جو کہ ایک وجودی حرف ہے، پس اس نے 'لم' کے ذریعے اس کی نفی کی۔ اور اسی طرح: \"وہ کوئی قابل ذکر چیز نہ تھا\" (سورۃ الدھر، ۷۶:۱) اور ذکر (یاد کیا جانا) وجود ہے۔ پس یہ جان لو۔ اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے۔ (سورۃ الاحزاب، ۳۳:۴)",
    "fa": "باب پانصد و بیست و چهارم در معرفت حال قطبی که منزل او این آیه بود: «بگو اگر دریا برای کلمات پروردگارم مرکب شود، پیش از آنکه کلمات پروردگارم پایان یابد، دریا به پایان می‌رسد، هرچند همانند آن را به کمک بیاوریم.» (قُلْ لَوْ كانَ الْبَحْرُ مِداداً لِكَلِماتِ رَبِّي لَنَفِدَ الْبَحْرُ قَبْلَ أَنْ تَنْفَدَ كَلِماتُ رَبِّي ولَوْ جِئْنا بِمِثْلِهِ مَدَداً)\n\nو اگر دریاها برای ما مرکب شوند / و درختان این جهان برای ما قلم باشند\nو صدای قلم‌ها در لوح به حرکت درآید / و ما برای آن شنیدن به جنبش آییم\nکلمات پروردگارم پایان نمی‌پذیرد / و پست‌ترین زمین در شکوه با بلندترین تپه برابر می‌شود.\n\n### [همانا صورت‌های ممکنات، کلمات خداوند هستند]\n\nخداوند عز و جل فرمود: «و اگر آنچه در زمین از درخت است، قلم باشد و دریا آن را پس از آن هفت دریای دیگر مدد رساند، کلمات خدا پایان نمی‌پذیرد.» (وَلَوْ أَنَّ مَا فِي الْأَرْضِ مِنْ شَجَرَةٍ أَقْلَامٌ وَالْبَحْرُ يَمُدُّهُ مِنْ بَعْدِهِ سَبْعَةُ أَبْحُرٍ مَا نَفِدَتْ كَلِمَاتُ اللَّهِ) و فرمود: «و کلمه‌اش را به مریم القا کرد و روحی از جانب او بود.» (وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ). کلمات خداوند چیزی جز صورت‌های ممکنات (الممكنات) نیستند و این صورت‌ها نامتناهی‌اند. آنچه نامتناهی است، پایان نمی‌پذیرد و هستی (الوجود) آن را در بر نمی‌گیرد. از حیث ثبوت (الثبوت) پایان نمی‌پذیرد، زیرا خزانه‌ی ثبوت (الثبوت) محدودیت نمی‌پذیرد؛ چرا که وسعت آن غایتی ندارد که درک شود. هرگاه در وهم خود به غایتی در وسعت آن برسی، آن غایت در ورای آن است. و از این خزانه‌ی ثبوت است که کلمات خداوند به صورت پی‌درپی و متوالی در هستی (الوجود) ظاهر می‌شوند؛ اشخاصی پس از اشخاص و کلماتی در پی کلمات. هرگاه اولینِ آن‌ها ظاهر شود، آخرینِ آن‌ها در هستی (الوجود) به دنبالش می‌آید.\n\nدریاها و قلم‌ها نیز از جمله‌ی کلمات هستند. پس اگر دریاها مرکب بودند، جز عین خودشان با آن‌ها نوشته نمی‌شد و قلم‌ها و کلماتی که در هستی (الوجود) حاصل شده‌اند، چیزی برای نوشتن نداشتند، با وجود اینکه به واسطه‌ی ورودشان به هستی (الوجود) متناهی شده‌اند. پس چگونه است حال آنچه هستی (الوجود) آن را در بر نگرفته است، یعنی شخصیات ممکنات (الممكنات)؟ این حکم ممکن است. پس گمان تو درباره‌ی معلومات (المعلومات) که ممکنات (الممكنات) جزئی از آن‌ها هستند، چیست؟ و این از شگفت‌انگیزترین مسائلی است که درباره‌ی برابری جزء و بعض با کل در حکم عدم تناهی (نامتناهی بودن) پرسیده می‌شود، با وجود معقول بودن برتری و تفاوت میان معلومات و ممکنات.\n\nسپس، هیچ شخصی از اشخاص، چه از معلومات و چه از ممکنات، نیست مگر اینکه استمرار او نامتناهی است؛ با این حال، برخی از آن‌ها از دیگری که پیش از او بوده، عقب‌تر است. پس از پیشی گرفتن او کاسته شده و آنکه پیش از او بوده، بر او برتری یافته است. و هر یک از آن‌ها در استمرار خود به تناهی (محدودیت) متصف نمی‌شود. پس برتری و نقص در آنچه نامتناهی است، واقع شده است.\n\nو وجود حق (الحق) با مرور نیست که به تناهی و عدم تناهی متصف شود، زیرا او عین هستی (الوجود) است. و موجود کسی است که مرور بر او وصف می‌شود. پس آنکه مرور بر او نامتناهی است، در عین خود از حیث اینکه موجود است، متناهی است؛ زیرا بر حقیقتی در عین خود است که به واسطه‌ی آن از کسی که آن حقیقت را ندارد، متمایز می‌شود، و آن حقیقت چیزی جز عین هویت او نیست. پس او موجود است و به تناهی (محدودیت) متصف نمی‌شود و همچنین به واسطه‌ی وجودش به نامتناهی بودن نیز وصف نمی‌شود، زیرا از حیثی که پایان می‌یابد، او پایان نمی‌پذیرد، برخلاف حکم مُحدَثات (محدثات) در این باره.\n\nو مُحدَثات (محدثات) را نمی‌شناسد مگر کسی که بداند رنگین‌کمان چیست و اختلاف رنگ‌های آن مانند اختلاف صورت‌های مُحدَثات است. سپس تو می‌دانی که در آنجا نه رنگ‌پذیری هست و نه رنگ، با وجود شهود (الشهود) تو نسبت به آن. همچنین است شهود (الشهود) تو نسبت به صورت‌های مُحدَثات در وجود حق (الحق) که همان هستی (الوجود) است. پس می‌گویی «آنجا هست آنچه آنجا نیست»، زیرا نمی‌توانی آنچه را شهود (الشهود) می‌کنی انکار کنی در حالی که شهود می‌کنی، همان‌طور که نمی‌توانی آنچه را می‌دانی، نادیده بگیری در حالی که می‌دانی. و معلوم (آنچه با علم درک می‌شود) در این مسئله خلاف مشهود (آنچه با شهود درک می‌شود) است. پس بصر (چشم ظاهری) می‌گوید «آنجا هست» و بصیرت می‌گوید «آنجا نیست»، و هیچ‌کدام از این دو در آنچه خبر می‌دهند، دروغ نمی‌گویند. پس کلمات خداوند که پایان نمی‌پذیرند کجایند، در حالی که جز خداوند (الله) آنجا نیست؟ و کسی که میان شهود (الشهود) و علم ایستاده، به دلیل تردید میان آن دو، حیران است؛ و کسی که به یکی از آن دو اخلاص ورزیده، حیران نیست و به هر که اخلاص ورزد، متمایل شده است، هرچه که باشد.\n\nو حق (الحق) بخشنده‌ی این و آن است / پس این و آن را بگیر\nو از هر آنچه به تو بخشیده، دوری مکن\nو هر که این را بشناسد / پیشوایی دانا و زیرک خواهد بود\nپس هر که این را بگوید / ناگزیر باید آن را نیز بگوید\nمیان آن دو، کسی آشکار می‌شود / که او را از این و آن باز می‌دارد\nو اقوامی به این قائل شدند / و اقوامی به آن قائل شدند\nپس اشیاء را به حق این‌گونه بشناس.\n\n### [هستی (الوجود) تماماً حروف و کلمات است]\n\nپس هستی (الوجود) تماماً حروف و کلمات و سوره‌ها و آیات است. آن، قرآن کبیر است که «باطل از پیش رو و از پشت سر به آن راه نمی‌یابد.» (لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ). پس عین آن محفوظ است و به عدم متصف نمی‌شود، زیرا عدم، نفی شیئیت است و شیئیت (ماهیت شیء) در وجود و ثبوت (الثبوت) معقول است و مرتبه‌ی سومی در کار نیست. پس هرگاه نفی شیئیت را شنیدی، نفی‌کننده تنها شیئیت وجود را از شیئیت ثبوت نفی می‌کند، زیرا شیئیت ثبوت را شیئیت وجود نفی نمی‌کند. پس سخن خداوند که می‌فرماید: «و چیزی نبودی» (وَلَمْ تَكُ شَيْئًا)، منظور شیئیت وجود است، زیرا با لفظ «تَکُ» آمده که حرفی وجودی است و آن را با «لَمْ» نفی کرده است. همچنین است آیه: «و چیزی قابل ذکر نبودی» (لَمْ يَكُنْ شَيْئًا مَذْكُورًا)، و ذکر (یاد شدن) وجود است. پس این را بدان. و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند. (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}