{
  "id": 142,
  "title": {
    "ar": "الباب الثاني والأربعون ومائة في معرفة مقام الذكر وأسراره",
    "en": "Chapter One Hundred and Forty-Two: Concerning the Knowledge (Ma'rifa) of the Station (Maqām) of Remembrance (Dhikr) and its Secrets.",
    "ur": "باب ایک سو بیالیس (۱۴۲): مقام الذکر (مقام الذكر) اور اس کے اسرار کی معرفت کے بیان میں۔",
    "fa": "باب صد و چهل و دوم در معرفت مقام ذکر و اسرار آن"
  },
  "content": {
    "ar": "## (الباب الثاني والأربعون ومائة في معرفة مقام الذكر وأسراره)\n\n\n> الذكر ستر على مذكوره أبدا *** وكل ذكر فأحوال وأسماء\n\n\n> وليس ثم سوى ما قلته فإذا *** نظرت فيه بدت للعين أشياء\n\n\n> تدري بها كل من قام الوجود به *** وذلك الحق لا عقل ولا ماء\n\n\n### [الذكر أن تذكر اسم الله من حيث ما هو مدح له وحمد]\n\n\nالذكر نعت إلهي وهو نفسي وملئي في الحق وفي الخلق ومع كونه نعتا إلهيا فهو جزاء ذكر الخلق قال تعالى فَاذْكُرُونِي أَذْكُرْكُمْ فجعل وجود ذكره عن ذكرنا إياه وكذلك حاله‏\n\n\nفقال تعالى إن ذكرني في نفسه ذكرته في نفسي وإن ذكرني في ملأ ذكرته في ملأ خير منهم‏\n\n\nفانتج الذكر الذكر وحال الذكر حال الذكر وليس الذكر هنا بأن نذكر اسمه بل لتذكر اسمه من حيث ما هو مدح له وحمد إذ الفائدة ترتفع بذكر الاسم من حيث دلالته على العين لا في حقك ولا في حقه‏\n\n\n### [القصد من ذكر الله باسمه العلم أو بضمير الغيبة]\n\n\nفإن قلت فقد رجح أهل الله ذكر لفظة الله الله وذكر لفظة هو على الأذكار التي تعطي النعت ووجدوا لها فوائد قلت صدقوا وبه أقول ولكن ما قصدوا بذكرهم الله الله نفس دلالته على العين وإنما قصدوا هذا الاسم أو الهو من حيث إنهم علموا إن المسمى بهذا الاسم أو هذا الضمير هو من لا تقيده الأكوان ومن له الوجود التام فإحضار هذا في نفس الذاكر عند ذكر الاسم بذلك وقعت الفائدة فإنه ذكر غير مقيد فإذا قيده بلا إله إلا الله لم ينتج له إلا ما تعطيه هذه الدلالة وإذا قيده بسبحان الله لم يتمكن له أن يحضر إلا مع حقيقة ما يعطيه التسبيح وكذلك الله أكبر والحمد لله ولا حول ولا قوة إلا بالله‏\n\n\n### [الذكر الذي هو استحضار والذكر الذي هو حضور]\n\n\nوكل ذكر مقيد لا ينتج إلا ما تقيد به لا يمكن أن يجني منه ثمرة عامة فإن حالة الذكر تقيده وقد عرفنا الله‏\nأنه ما يعطيه إلا بحسب حاله في قوله إن ذكرني في نفسه ذكرته في نفسي الحديث فلهذا رجحت الطائفة ذكر لفظة الله وحدها أو ضميرها من غير تقييد فما قصدوا لفظة دون استحضار ما يستحقه المسمى وبهذا المعنى يكون ذكر الحق عبده باسم عام لجميع الفضائل اللائقة به التي تكون في مقابلة ذكر العبد ربه بالاسم الله فالذكر من العبد باستحضار والذكر من الحق بحضور لأنا مشهودون له معلومون وهو لنا معلوم لا مشهود فلهذا كان لنا الاستحضار وله الحضور فالعلماء يستحضرونه في القوة الذاكرة والعامة تستحضره في القوة المتخيلة ومن عباد الله العلماء بالله من يستحضره في القوتين يستحضره في القوة الذاكرة عقلا وشرعا وفي القوة المتخيلة شرعا وكشفا وهذا أتم الذكر لأنه ذكره بكله ومن ذلك الباب يكون ذكر الله له‏\n\n\n### [ما وصف الله بالكثرة شيئا إلا الذكر وما أمر بالكثرة من شي‏ء إلا من الذكر]\n\n\nثم إن الله ما وصف بالكثرة شيئا إلا الذكر وما أمر بالكثرة من شي‏ء إلا من الذكر قال والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ وقال اذْكُرُوا الله ذِكْراً كَثِيراً وما أتى الذكر قط إلا بالاسم الله خاصة معرى عن التقييد فقال فَاذْكُرُوا الله وما قال بكذا وقال ولَذِكْرُ الله أَكْبَرُ ولم يقل بكذا وقال اذْكُرُوا الله في أَيَّامٍ مَعْدُوداتٍ ولم يقل بكذا وقال فَاذْكُرُوا اسْمَ الله عَلَيْها ولم يقل بكذا وقال فَكُلُوا مِمَّا ذُكِرَ اسْمُ الله عَلَيْهِ ولم يقل بكذا\n\n\n### [ذكر الخاصة من العباد الذين يحفظ الله بهم البلاد]\n\n\nوقال صَلَّى اللهُ عَليهِ وسَلَّم لا تقوم الساعة حتى لا يبق على وجه الأرض من يقول الله الله‏\n\n\nفما قيده بأمر زائد على هذا اللفظ لأنه ذكر الخاصة من عباده الذين يحفظ الله بهم عالم الدنيا وكل دار يكونون فيها فإذا لم يبق في الدنيا منهم أحد لم يبق للدنيا سبب حافظ يحفظها الله من أجله فتزول وتخرب وكم من قائل الله باق في ذلك الوقت ولكن ما هو ذاكر بالاستحضار الذي ذكرناه فلهذا لم يعتبر اللفظ دون الاستحضار وإِذا ذَكَرْتَ رَبَّكَ في الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلى‏ أَدْبارِهِمْ نُفُوراً لأنهم لم يسمعوا بذكر شركائهم واشمأزت قلوبهم هذا مع علمهم بأنهم هم الذين وضعوها آلهة ولهذا قال قُلْ سَمُّوهُمْ فإنهم إن سموهم قامت الحجة عليهم فلا يسمى الله إلا الله‏\n\n\n### [درجات الذكر عند العارفين والملامية]\n\n\nودرجات الذكر عند العارفين من أهل الله إحدى وخمسون وتسعمائة درجة وعند الملامية تسع مائة وعشرون درجة\n\n",
    "en": "Remembrance (الذكر) is a veil over the One remembered forever,\nAnd every remembrance consists of states and Names.\n\nThere is nothing there except what I have said, so when\nYou look into it, things appear to the eye,\n\nBy which you know everyone whose Being (الوجود) is established by Him,\nAnd that is the Real (الحق), neither intellect nor water.\n\n### [Remembrance is that you mention the Name of Allah from the perspective of its being praise and glorification of Him]\n\nRemembrance (الذكر) is a Divine Attribute (نعت إلهي), and it is My Self and My Assembly (ملئي) in the Real (الحق) and in Creation (الخلق). Despite its being a Divine Attribute, it is the recompense for the remembrance by the creatures. He, the Exalted, said: <<فَاذْكُرُونِي أَذْكُرْكُمْ>> (So remember Me; I will remember you). Thus, He made the existence of His remembrance dependent upon our remembrance of Him, and such is His state.\n\nHe, the Exalted, said: \"If he remembers Me in himself, I remember him in Myself; and if he remembers Me in an assembly (ملأ), I remember him in an assembly better than theirs.\"\n\nSo remembrance produces remembrance, and the state of remembrance is the state of remembrance. And remembrance (الذكر) here is not merely that we mention His Name, but that you remember His Name from the perspective of its being praise (مدح) and glorification (حمد) of Him. For the benefit is lost by mentioning the Name merely based on its indication of the Essence (العين), neither in respect to you nor in respect to Him.\n\n### [The intention behind remembering Allah by His proper Name or by the pronoun of the absent]\n\nIf you say: \"The People of Allah (أهل الله) have preferred the invocation of the word 'Allah, Allah' and the invocation of the word 'He' (هو) over the invocations that convey an Attribute (النعت), and they found benefits in them.\"\n\nI say: \"They spoke truly, and I agree with them. However, by their invocation of 'Allah, Allah,' they did not intend merely its indication of the Essence (العين). Rather, they intended this Name or the pronoun 'He' (هو) from the perspective that they knew that the One named by this Name or this pronoun is the One whom the created realms (الأكوان) do not restrict, and the One who possesses Perfect Being (الوجود التام).\"\n\nThus, the benefit occurs when this meaning is brought to mind (إحضار) in the soul of the invoker (الذاكر) when mentioning the Name, for it is an unrestricted remembrance. If he restricts it with *Lā ilāha illā Allāh* (There is no god but Allah), it will only yield what this specific indication provides. And if he restricts it with *Subhān Allāh* (Glory be to Allah), he cannot achieve presence (يحضر) except with the reality conveyed by the glorification (التسبيح). And likewise for *Allāhu Akbar* (Allah is Greater), *Al-Hamdu Lillāh* (Praise be to Allah), and *Lā hawla wa lā quwwata illā bi-llāh* (There is no power nor strength save in Allah).\n\n### [The remembrance that is mental presence and the remembrance that is actual Presence]\n\nEvery restricted remembrance (ذكر مقيد) yields only what it is restricted by; it cannot harvest a universal fruit (ثمرة عامة). For the state of the invoker restricts it. We have known Allah, that He only gives according to the invoker's state, based on His saying: \"If he remembers Me in himself, I remember him in Myself,\" the Hadith.\n\nFor this reason, the group (الطائفة) preferred the invocation of the word 'Allah' alone or its pronoun, without restriction. They did not intend the mere word without bringing to mind (استحضار) what the Named One deserves.\n\nAnd in this sense, the remembrance of the Real (الحق) of His servant is by a general Name encompassing all the virtues appropriate to the servant, which stands in correspondence to the servant's remembrance of his Lord by the Name 'Allah'. Thus, the remembrance from the servant is by mental presence (استحضار), and the remembrance from the Real is by actual Presence (حضور). This is because we are witnessed by Him and known to Him, while He is known to us but not witnessed (مشهود). Therefore, mental presence (الاستحضار) belongs to us, and actual Presence (الحضور) belongs to Him.\n\nThe scholars (العلماء) bring Him to mind in the faculty of memory (القوة الذاكرة), and the common people (العامة) bring Him to mind in the faculty of imagination (القوة المتخيلة). And among the servants of Allah are the Gnostics (العلماء بالله) who bring Him to mind in both faculties: they bring Him to mind in the faculty of memory intellectually and legally, and in the faculty of imagination legally and through Unveiling (كشف). This is the most complete remembrance, because he remembers Him with his entirety. And from that door comes Allah's remembrance of him.\n\n### [Nothing has been described by Allah with multiplicity except Remembrance, and nothing has been commanded in multiplicity except Remembrance]\n\nFurthermore, Allah has not described anything with multiplicity (كثرة) except Remembrance, nor has He commanded multiplicity concerning anything except Remembrance. He said: <<وَالذَّاكِرِينَ الله كَثِيراً وَالذَّاكِرَاتِ>> (And the men who remember Allah often and the women who remember Him). And He said: <<اذْكُرُوا الله ذِكْراً كَثِيراً>> (Remember Allah with frequent remembrance).\n\nAnd Remembrance (الذكر) never came except specifically with the Name 'Allah', stripped of restriction. So He said: <<فَاذْكُرُوا الله>> (So remember Allah), and He did not say \"by such-and-such.\" And He said: <<وَلَذِكْرُ الله أَكْبَرُ>> (And the remembrance of Allah is greater), and He did not say \"by such-and-such.\" And He said: <<اذْكُرُوا الله فِي أَيَّامٍ مَعْدُودَاتٍ>> (Remember Allah during [a] number of days), and He did not say \"by such-and-such.\" And He said: <<فَاذْكُرُوا اسْمَ الله عَلَيْهَا>> (So mention the Name of Allah upon them), and He did not say \"by such-and-such.\" And He said: <<فَكُلُوا مِمَّا ذُكِرَ اسْمُ الله عَلَيْهِ>> (So eat of that upon which the Name of Allah has been mentioned), and He did not say \"by such-and-such.\"\n\n### [The remembrance of the Elite servants through whom Allah preserves the lands]\n\nThe Prophet, peace and blessings be upon him, said: \"The Hour will not be established until there remains no one on the face of the earth who says 'Allah, Allah.'\"\n\nHe did not restrict it with anything additional to this utterance, because it is the remembrance of the Elite (الخاصة) among His servants, through whom Allah preserves the world (عالم الدنيا) and every dwelling place where they reside. If none of them remains in the world, there will be no preserving cause left for the world for which Allah preserves it, so it will vanish and be ruined. How many people saying 'Allah' will remain at that time? But they are not invokers (ذاكر) with the mental presence (الاستحضار) we mentioned. Therefore, the mere utterance without the mental presence is not considered.\n\n<<وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلَى أَدْبَارِهِمْ نُفُوراً>> (And when you mention your Lord in the Qur'an, [mentioning Him] alone, they turn their backs in aversion). This is because they did not hear the mention of their partners, and their hearts recoiled, even though they knew that they themselves had set them up as deities. For this reason, He said: <<قُلْ سَمُّوهُمْ>> (Say: Name them). For if they name them, the proof is established against them. Thus, none is named Allah except Allah.\n\n### [The degrees of Remembrance according to the Gnostics and the Malamiyya]\n\nThe degrees (درجات) of Remembrance (الذكر) according to the Gnostics (العارفين) among the People of Allah (أهل الله) are nine hundred and fifty-one degrees, and according to the Malamiyya (الملامية) they are nine hundred and twenty degrees.",
    "ur": "(باب ایک سو بیالیس: مقامِ ذکر اور اس کے اسرار کی معرفت میں)\n\nذکر ہمیشہ اپنے مذکور (جس کا ذکر کیا جائے) پر ایک پردہ ہے،\nاور ہر ذکر احوال اور اسماء (صفات) ہیں۔\nاور وہاں اس کے سوا کچھ نہیں جو میں نے کہا، پس جب\nتم اس میں غور کرو گے تو آنکھ کے لیے چیزیں ظاہر ہوں گی۔\nجن کے ذریعے تم ہر اس شخص کو جان لو گے جس کے ساتھ ہستی (الوجود) قائم ہے،\nاور وہ ذات حق (الحق) ہے، نہ عقل ہے اور نہ پانی۔\n\n[ذکر یہ ہے کہ تم اللہ کے نام کا ذکر اس حیثیت سے کرو کہ وہ اس کی مدح اور حمد ہو]\n\nذکر ایک الٰہی صفت (نعت إلهي) ہے، اور وہ ذات حق (الحق) میں میرا نفس اور میرا بھرپور حصہ (ملئي) ہے، اور خلق میں بھی۔ اور اس کے الٰہی صفت ہونے کے ساتھ ساتھ، یہ مخلوق کے ذکر کا بدلہ بھی ہے۔ اللہ تعالیٰ فرماتا ہے: \"فَاذْكُرُونِي أَذْكُرْكُمْ\" (پس تم میرا ذکر کرو، میں تمہارا ذکر کروں گا)۔ پس اس نے اپنے ذکر کے وجود کو ہمارے ذکر پر موقوف کر دیا، اور اس کا حال بھی ایسا ہی ہے۔\n\nاللہ تعالیٰ نے فرمایا: \"اگر وہ میرا ذکر اپنے نفس میں کرے گا تو میں اس کا ذکر اپنے نفس میں کروں گا، اور اگر وہ میرا ذکر کسی جماعت میں کرے گا تو میں اس کا ذکر ان سے بہتر جماعت میں کروں گا۔\"\n\nپس ذکر نے ذکر کو پیدا کیا، اور ذکر کا حال ذکر کا حال ہے۔ اور یہاں ذکر سے مراد یہ نہیں کہ ہم صرف اس کا نام لیں، بلکہ یہ ہے کہ تم اس کے نام کا ذکر اس حیثیت سے کرو کہ وہ اس کی مدح اور حمد ہو۔ کیونکہ صرف نام کا ذکر اس کی عین (ذات) پر دلالت کی حیثیت سے فائدہ نہیں دیتا، نہ تمہارے حق میں اور نہ اس کے حق میں۔\n\n[اللہ کا ذکر اس کے اسمِ علم یا ضمیر غائب کے ساتھ کرنے کا مقصد]\n\nاگر تم کہو کہ اہلِ اللہ نے لفظ \"اللہ اللہ\" اور لفظ \"ھو\" (ضمیر غائب) کے ذکر کو ان اذکار پر ترجیح دی ہے جو صفت (النعت) کو ظاہر کرتے ہیں، اور اور انہوں نے ان میں فوائد پائے ہیں، تو میں کہوں گا: انہوں نے سچ کہا، اور میں بھی یہی کہتا ہوں۔ لیکن انہوں نے اپنے ذکر \"اللہ اللہ\" سے صرف اس کی عین (ذات) پر دلالت کا ارادہ نہیں کیا، بلکہ انہوں نے اس اسم یا \"ھو\" کا ارادہ اس حیثیت سے کیا کہ وہ جانتے تھے کہ اس اسم یا اس ضمیر کا مسمیٰ وہ ہے جسے کائناتیں مقید نہیں کر سکتیں، اور جس کے لیے ہستی (الوجود) کامل ہے۔ پس جب ذاکر کے نفس میں اس اسم کے ذکر کے وقت یہ معنی حاضر ہو جاتا ہے، تب فائدہ واقع ہوتا ہے، کیونکہ یہ ذکر غیر مقید ہے۔ لیکن اگر وہ اسے \"لَا إِلَهَ إِلَّا الله\" کے ساتھ مقید کر دے، تو اسے صرف وہی حاصل ہو گا جو یہ دلالت دیتی ہے۔ اور اگر وہ اسے \"سُبْحَانَ الله\" کے ساتھ مقید کر دے، تو وہ صرف اسی حقیقت کے ساتھ حاضر ہو سکتا ہے جو تسبیح دیتی ہے۔ اور یہی حال \"الله أكبر\"، \"الحمد لله\"، اور \"لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِالله\" کا ہے۔\n\n[وہ ذکر جو استحضار ہے اور وہ ذکر جو حضور ہے]\n\nہر مقید ذکر صرف وہی نتیجہ دیتا ہے جس کے ساتھ وہ مقید کیا گیا ہو، اس سے کوئی عام ثمرہ حاصل نہیں ہو سکتا۔ کیونکہ ذکر کی حالت اسے مقید کر دیتی ہے۔ اور ہم نے اللہ کو جان لیا ہے کہ وہ صرف اس کی حالت کے مطابق ہی عطا کرتا ہے، جیسا کہ اس کے قول میں ہے: \"اگر وہ میرا ذکر اپنے نفس میں کرے گا تو میں اس کا ذکر اپنے نفس میں کروں گا\" (الحدیث)۔ اسی لیے اس گروہ نے صرف لفظ \"اللہ\" یا اس کے ضمیر کے ذکر کو بغیر کسی قید کے ترجیح دی ہے۔ انہوں نے صرف لفظ کا ارادہ نہیں کیا، بلکہ اس کے ساتھ مسمیٰ کے مستحق معنی کے استحضار (استحضار) کا ارادہ کیا۔ اور اسی معنی کے ساتھ، ذات حق (الحق) کا اپنے بندے کا ذکر ایک ایسے عام نام کے ساتھ ہوتا ہے جو اس کے لیے تمام لائق فضائل کو شامل کرتا ہے، جو بندے کے اپنے رب کا ذکر اسم \"اللہ\" کے ساتھ کرنے کے مقابلے میں ہوتا ہے۔ پس بندے کی طرف سے ذکر استحضار (استحضار) کے ساتھ ہوتا ہے، اور ذات حق (الحق) کی طرف سے ذکر حضور (حضور) کے ساتھ ہوتا ہے۔ کیونکہ ہم اس کے لیے مشہود (دیکھے ہوئے) اور معلوم ہیں، اور وہ ہمارے لیے معلوم ہے لیکن مشہود نہیں۔ اسی لیے ہمارے لیے استحضار ہے اور اس کے لیے حضور ہے۔ پس علماء اسے قوتِ ذاکرہ (یاد رکھنے والی قوت) میں استحضار کرتے ہیں، اور عوام اسے قوتِ متخیلہ (تصور کرنے والی قوت) میں استحضار کرتے ہیں۔ اور اللہ کے بندوں میں سے جو اللہ کے عالم ہیں، وہ اسے دونوں قوتوں میں استحضار کرتے ہیں: قوتِ ذاکرہ میں عقلی اور شرعی طور پر، اور قوتِ متخیلہ میں شرعی اور کشفی (الکشف) طور پر۔ اور یہ سب سے کامل ذکر ہے، کیونکہ اس نے اس کا ذکر اپنے پورے وجود کے ساتھ کیا۔ اور اسی باب سے اللہ کا اس کا ذکر کرنا بھی ہوتا ہے۔\n\n[اللہ نے ذکر کے سوا کسی چیز کو کثرت سے بیان نہیں کیا اور نہ ہی ذکر کے سوا کسی چیز میں کثرت کا حکم دیا]\n\nپھر یہ کہ اللہ نے ذکر کے سوا کسی چیز کو کثرت سے بیان نہیں کیا، اور نہ ہی ذکر کے سوا کسی چیز میں کثرت کا حکم دیا۔ اس نے فرمایا: \"وَالذَّاكِرِينَ الله كَثِيراً وَالذَّاكِرَاتِ\" (اور کثرت سے اللہ کا ذکر کرنے والے مرد اور کثرت سے ذکر کرنے والی عورتیں)۔ اور فرمایا: \"اذْكُرُوا الله ذِكْراً كَثِيراً\" (اللہ کا کثرت سے ذکر کرو)۔ اور ذکر کبھی بھی صرف اسم \"اللہ\" کے ساتھ ہی آیا ہے، جو قید سے پاک ہو، پس اس نے فرمایا: \"فَاذْكُرُوا الله\" (پس اللہ کا ذکر کرو)، اور یہ نہیں کہا کہ فلاں چیز کے ساتھ۔ اور فرمایا: \"وَلَذِكْرُ الله أَكْبَرُ\" (اور اللہ کا ذکر سب سے بڑا ہے)، اور یہ نہیں کہا کہ فلاں چیز کے ساتھ۔ اور فرمایا: \"اذْكُرُوا الله فِي أَيَّامٍ مَعْدُودَاتٍ\" (گنتی کے چند دنوں میں اللہ کا ذکر کرو)، اور یہ نہیں کہا کہ فلاں چیز کے ساتھ۔ اور فرمایا: \"فَاذْكُرُوا اسْمَ الله عَلَيْهَا\" (پس ان پر اللہ کا نام لو)، اور یہ نہیں کہا کہ فلاں چیز کے ساتھ۔ اور فرمایا: \"فَكُلُوا مِمَّا ذُكِرَ اسْمُ الله عَلَيْهِ\" (پس اس میں سے کھاؤ جس پر اللہ کا نام لیا گیا ہو)، اور یہ نہیں کہا کہ فلاں چیز کے ساتھ۔\n\n[خاص بندوں کا ذکر جن کے ذریعے اللہ شہروں کی حفاظت کرتا ہے]\n\nاور نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"قیامت قائم نہیں ہو گی یہاں تک کہ زمین پر کوئی ایسا باقی نہ رہے جو 'اللہ اللہ' کہتا ہو۔\"\n\nپس آپ صلی اللہ علیہ وسلم نے اس لفظ پر کسی زائد امر کی قید نہیں لگائی، کیونکہ یہ اس کے خاص بندوں کا ذکر ہے جن کے ذریعے اللہ دنیا کے عالم اور ہر اس گھر کی حفاظت کرتا ہے جس میں وہ موجود ہوں۔ پس جب دنیا میں ان میں سے کوئی باقی نہیں رہے گا، تو دنیا کے لیے کوئی ایسا سببِ محافظ باقی نہیں رہے گا جس کی خاطر اللہ اسے محفوظ رکھے، چنانچہ وہ زائل ہو جائے گی اور تباہ ہو جائے گی۔ اور اس وقت \"اللہ\" کہنے والے کتنے ہی باقی ہوں گے، لیکن وہ اس استحضار (استحضار) کے ساتھ ذاکر نہیں ہوں گے جس کا ہم نے ذکر کیا ہے۔ اسی لیے لفظ کو استحضار کے بغیر معتبر نہیں سمجھا گیا۔ اور \"وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلَى أَدْبَارِهِمْ نُفُوراً\" (اور جب تم قرآن میں اپنے رب کا اکیلے ذکر کرتے ہو تو وہ نفرت کرتے ہوئے اپنی پیٹھ پھیر لیتے ہیں)۔ کیونکہ انہوں نے اپنے شریکوں کا ذکر نہیں سنا اور ان کے دلوں میں نفرت پیدا ہو گئی، حالانکہ وہ جانتے تھے کہ انہوں نے ہی انہیں معبود بنایا ہے۔ اسی لیے فرمایا: \"قُلْ سَمُّوهُمْ\" (کہو، ان کے نام لو)، کیونکہ اگر وہ ان کے نام لیں گے تو ان پر حجت قائم ہو جائے گی۔ پس اللہ کو صرف \"اللہ\" ہی کہا جاتا ہے۔\n\n[عارفین اور ملامیہ کے نزدیک ذکر کے درجات]\n\nاہلِ اللہ میں سے عارفین کے نزدیک ذکر کے درجات نو سو اکیاون (۹۵۱) ہیں، اور ملامیہ کے نزدیک نو سو بیس (۹۲۰) درجات ہیں۔",
    "fa": "باب صد و چهل و دوم در معرفت مقام ذکر و اسرار آن\n\nذکر همواره پوششی است بر مذکور خود\nو هر ذکری احوال و اسم‌هایی است\n\nو در آنجا جز آنچه گفتم نیست، پس اگر\nدر آن بنگری، چیزهایی برای چشم آشکار می‌شود\n\nکه به واسطه آن، هر کس که هستی (الوجود) به او قائم است را می‌شناسی\nو آن حق (الحق) است، نه عقل و نه آب.\n\n### [ذکر آن است که نام خدا را از آن حیث که مدح و حمد اوست، یاد کنی]\n\nذکر (الذکر) صفتی الهی است و آن در حق (الحق) و در خلق، نفس من و پُرکننده من است. و با وجود اینکه صفتی الهی است، پاداش ذکر خلق نیز هست. خداوند متعال می‌فرماید: **«مرا یاد کنید تا شما را یاد کنم» (فَاذْكُرُونِي أَذْكُرْكُمْ)**. پس وجود ذکر خود را از ذکر ما نسبت به او قرار داد و حال او نیز چنین است.\n\nو فرمود: **«اگر مرا در نفس خود یاد کند، او را در نفس خود یاد می‌کنم، و اگر مرا در جمعی یاد کند، او را در جمعی بهتر از آنان یاد می‌کنم.»** (حدیث قدسی)\n\nپس ذکر، ذکر را نتیجه داد و حال ذکر، حال ذکر است. و ذکر در اینجا صرفاً این نیست که نام او را ببریم، بلکه باید نام او را از آن حیث که مدح و حمد اوست، یاد کنی؛ زیرا فایده با ذکر اسم از حیث دلالت آن بر ذات (العین) حاصل نمی‌شود، نه در حق تو و نه در حق او.\n\n### [قصد از ذکر خدا با اسم عَلَم یا ضمیر غیبت]\n\nاگر بگویی که اهل الله (اهل حق) ذکر لفظ «الله الله» و ذکر لفظ «هو» را بر اذکاری که صفت (النعت) را افاده می‌کنند، ترجیح داده‌اند و برای آن فوایدی یافته‌اند، می‌گویم: راست گفته‌اند و من نیز به آن معتقدم. اما آنان از ذکر «الله الله» صرف دلالت آن بر ذات (العین) را قصد نکرده‌اند، بلکه این اسم یا «هو» را از آن حیث قصد کرده‌اند که می‌دانستند مسمای این اسم یا این ضمیر کسی است که اکوان (جهان‌ها) او را مقید نمی‌سازند و کسی است که هستی (الوجود) تام از آن اوست. پس با حاضر ساختن این معنا در نفس ذاکر هنگام ذکر اسم، فایده حاصل می‌شود؛ زیرا این ذکر، ذکری غیر مقید است. اگر آن را به «لا إله إلا الله» مقید سازد، جز آنچه این دلالت افاده می‌کند، برای او نتیجه‌ای نخواهد داشت. و اگر آن را به «سبحان الله» مقید سازد، نمی‌تواند حاضر شود مگر با حقیقت آنچه تسبیح افاده می‌کند. و همچنین است «الله اکبر»، «الحمد لله» و «لا حول ولا قوة إلا بالله».\n\n### [ذکری که استحضار است و ذکری که حضور است]\n\nهر ذکر مقیدی جز آنچه بدان مقید شده است، نتیجه نمی‌دهد و نمی‌تواند ثمره‌ای عام از آن بچیند؛ زیرا حال ذکر، آن را مقید می‌سازد. و ما دانسته‌ایم که خداوند جز به حسب حال ذاکر، به او عطا نمی‌کند، چنانکه در حدیث قدسی فرمود: «اگر مرا در نفس خود یاد کند، او را در نفس خود یاد می‌کنم.» به همین دلیل، این طایفه (صوفیه) ذکر لفظ «الله» به تنهایی یا ضمیر آن را بدون تقیید ترجیح دادند. آنان لفظ را بدون استحضار (حاضر ساختن) آنچه مسمّا سزاوار آن است، قصد نکردند. و به این معنا، ذکر حق (الحق) بنده خود را با اسمی عام برای تمام فضائل شایسته اوست که در مقابل ذکر بنده پروردگارش را با اسم «الله» قرار می‌گیرد. پس ذکر از جانب بنده با استحضار است و ذکر از جانب حق (الحق) با حضور است؛ زیرا ما برای او مشهود و معلوم هستیم، در حالی که او برای ما معلوم است نه مشهود. از این رو، استحضار برای ماست و حضور برای او. پس علما او را در قوه ذاکره (حافظه) استحضار می‌کنند و عوام او را در قوه متخیله (خیال) استحضار می‌کنند. و از بندگان خدا، علمای بالله کسانی هستند که او را در هر دو قوه استحضار می‌کنند: در قوه ذاکره از نظر عقلی و شرعی، و در قوه متخیله از نظر شرعی و کشفی (الکشف). و این کامل‌ترین ذکر است، زیرا او را با تمام وجودش یاد کرده است. و ذکر خداوند نسبت به او نیز از همین باب است.\n\n### [خداوند هیچ چیز را به کثرت وصف نکرده و به کثرت هیچ چیز جز ذکر امر ننموده است]\n\nسپس، خداوند هیچ چیز را به کثرت وصف نکرده است مگر ذکر را، و به کثرت هیچ چیز امر ننموده است مگر ذکر را. فرمود: **«و مردان و زنانی که خدا را بسیار یاد می‌کنند» (والذَّاكِرِينَ الله كَثِيراً والذَّاكِراتِ)** و فرمود: **«خدا را بسیار یاد کنید» (اذْكُرُوا الله ذِكْراً كَثِيراً)**. و ذکر هرگز نیامده است مگر با اسم خاص «الله» که از هر قیدی عاری باشد. پس فرمود: **«خدا را یاد کنید» (فَاذْكُرُوا الله)** و نگفت با فلان چیز. و فرمود: **«و قطعاً یاد خدا بزرگتر است» (ولَذِكْرُ الله أَكْبَرُ)** و نگفت با فلان چیز. و فرمود: **«خدا را در روزهای معینی یاد کنید» (اذْكُرُوا الله في أَيَّامٍ مَعْدُوداتٍ)** و نگفت با فلان چیز. و فرمود: **«نام خدا را بر آن ببرید» (فَاذْكُرُوا اسْمَ الله عَلَيْها)** و نگفت با فلان چیز. و فرمود: **«از آنچه نام خدا بر آن برده شده بخورید» (فَكُلُوا مِمَّا ذُكِرَ اسْمُ الله عَلَيْهِ)** و نگفت با فلان چیز.\n\n### [ذکر خاصان از بندگان که خداوند به واسطه آنان شهرها را حفظ می‌کند]\n\nو پیامبر (صلی الله علیه و سلم) فرمود: **«قیامت برپا نمی‌شود تا اینکه بر روی زمین کسی که بگوید: الله الله، باقی نماند.»** (حدیث)\n\nپس آن را به امری زائد بر این لفظ مقید نساخت؛ زیرا این ذکر، ذکر خاصان از بندگان اوست که خداوند به واسطه آنان عالم دنیا و هر سرزمینی را که در آن باشند، حفظ می‌کند. پس اگر هیچ یک از آنان در دنیا باقی نماند، برای دنیا سبب حافظی که خداوند به خاطر آن دنیا را حفظ کند، باقی نمی‌ماند و دنیا از بین می‌رود و خراب می‌شود. و چه بسا گویندگان «الله» در آن زمان باقی باشند، اما آنان ذاکر با استحضاری که ذکر کردیم، نیستند. از این رو، لفظ بدون استحضار معتبر نیست. **«و چون پروردگارت را در قرآن به تنهایی یاد کنی، پشت می‌کنند و با نفرت می‌گریزند» (وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلَى أَدْبَارِهِمْ نُفُورًا)**؛ زیرا ذکر شریکان خود را نشنیدند و دل‌هایشان منزجر شد. این در حالی است که می‌دانستند خودشان آن شریکان را به عنوان معبود قرار داده‌اند. به همین دلیل فرمود: **«بگو: آنها را نام ببرید» (قُلْ سَمُّوهُمْ)**. زیرا اگر آنها را نام ببرند، حجت بر آنان تمام می‌شود. پس جز «الله» کسی نامیده نمی‌شود مگر «الله».\n\n### [درجات ذکر نزد عارفان و ملامیه]\n\nو درجات ذکر نزد عارفان (العارفین) از اهل الله، نهصد و پنجاه و یک درجه است و نزد ملامیه نهصد و بیست درجه."
  },
  "page_count": 2
}