{
  "id": 76,
  "title": {
    "ar": "الباب السادس والسبعون في المجاهدة",
    "en": "Chapter Seventy-Six, Concerning Spiritual Striving (المجاهدة)",
    "ur": "باب چھہترواں مجاہدہ (المجاهدة) کے بیان میں",
    "fa": "باب هفتاد و ششم در مجاهده (المجاهدة)"
  },
  "content": {
    "ar": "## (الباب السادس والسبعون في المجاهدة)\n\n\n> سبح إلهك بكرة وأصيلا *** فالنعل يرجع بالهدى إكليلا\n\n\n> جاهد هواك ولا تكن ذا فترة *** فيه وكن للنائبات خليلا\n\n\n> إن المجاهد لا يزال مكابدا *** يهوى الخطوب ويعشق التعليلا\n\n\n> لا تركنن إلى البطالة إنها *** تردى وكن للحادثات وصولا\n\n\n### [حروف العلة والأصناف الأربعة من الأولياء]\n\n\nاعلموا وفقكم الله أني لما شرعت في الكلام على هذا الباب أريت مبشرة عرفت فيها إن الناس لا بد أن ينزل بهم أمر إلهي عارض يحتاجون فيه إلى حمل مشقة وجهد نفسي وحسي وقيل لي لا تغفل في كل باب أن تدرج فيه الحروف الصغار وتبين أن بإشباعها تكون الحروف الثلاثة التي هي حروف العلة وهي حروف العلة وهي حروف المد واللين وهي الحروف المركبة من علة ومعلول ويكون كلامك فيها وإشارتك إلى الأربعة الأصناف وهم العارفون الذين لهم العوارف الإلهية الوجودية الجودية في معرفتهم وأهل المواقف عند الحدود الإلهية لتلقى الأدب بين كل مقامين عند الانتقال في حال لا يتصفون فيه بالمقام الأول ولا بالثاني وهم أهل البرازخ وكذلك أيضا أهل الوصال والأنس تعين ما لهم من الدرجات في كل مقام كما تبين‏\nما لأهل المواقف سواء حتى لا يختلط على السالك وكذلك أيضا المنكرة أحوالهم وهم الملامية الذين يعرفون ولا يعرفون تميزهم من أهل عوارف المعارف وتظهر ما لهم من الكمال وهم العلماء بالله فهؤلاء الأربعة لا بد من تمشية أحوالهم في كل مقام وهم العارفون والملامية وأهل الأنس والوصال وأصحاب المواقف والقول وهم الأدباء فإنك مأمور بالنصح لعباد الله عن أمر الله والدين النصيحة لله ولرسوله ولأئمة المسلمين وعامتهم فلما فرع وارد البرزخ في الواقعة فمنا من مرقدنا وسألنا الله تعالى العصمة في القول والعمل والحال وكنت أرى معي في هذه الواقعة صاحبنا تاج الدين عباس بن عمر السراج وهو الذي كان ينبهني عن الحق تعالى على الكلام في الحروف الصغار التي تتولد عنها حروف العلل الثلاثة فلنبين أولا ما المراد بالحروف الصغار وما مراتب أولادها وهي حروف العلل وإن كنا قد ذكرناها في الباب الثاني باب الحروف من هذا الكتاب فلا بد من ذكر طرف هنا منها لأجل الواقعة\n\n\n### (فصل) [الحروف الصغار ومراتب أولادها]\n\n\nاعلم أن المراد بالحروف الصغار الحركات الثلاثة وهي الضمة والفتحة والكسرة ولهذه الحروف حالان حال إشباع وحال غير إشباع فإذا اتصف واحد منها بالإشباع كان علة لوجود معلول يناسبه فإن أشبعت الضمة كان عنها الواو المعلولة وإن كانت فتحة كان عنها الألف وإن كانت كسرة كان عنها الياء المعلولة وإنما قيدنا الواو والياء بالعلة لأنهما قد يوجدان في مقام الصحة غير موصوفين بالعلية والألف لا توجد أبدا إلا معلولة ولذلك لا يكون ما قبلها إلا مفتوحا أبدا\n\n\n### [حروف العلة خرجت على صورة عللها في الحكم‏]\n\n\nفهذه تسمى حروف العلة أي وجدت معلولة عن هذه العلل فخرجت على صورة عللها في الحكم فأعربت بها الكلمات كما أعربت بعللها تقول زيد أخوك فعلامة الرفع في زيد ضمة الدال وعن إشباع الضمة في قولك أخوك تكون الواو علامة الرفع في أخوك وكذلك في النصب في رأيت زيدا أخاك وفي الخفض مررت بزيد أخيك وكذلك رأيت أخاك زيدا الفتحة في زيد علامة النصب والألف في أخاك المتولدة عن فتحة الخاء علامة النصب وكذلك مررت بأخيك زيد فالكسرة في زيد علامة الخفض والياء في أخيك علامة الخفض فأعطيت الياء حكم معلوله فأعلت الكلمة هذه الحروف فلها حكم ابائها\n\n\n### [الأسماء الإلهية التي لهذه الحروف الصغار وآثارها في الكون‏]\n\n\nإلى الذي هو الرفع له من الأسماء العلى والفتح له من الأسماء الرحمن ما يفتح الله للناس من رحمة والكسر له من الأسماء المتعالي وآثار هذه الأسماء الإلهية في الكون معلومة كما هي في الحق متميزة بحدودها يمتاز بعضها عن بعض وقد بيناها في الباب الثاني من أبواب هذا الكتاب وبينا فيه حركات البناء من حركات الإعراب ومرتبة السكون الحي والميت وإلحاق النون بحروف العلة في حكم الإعراب في الخمسة الأمثلة من الفعل وهي يفعلان وتفعلان ويفعلون وتفعلون وتفعلين وإثباتها إعراب وحذفها إعراب بحسب العوامل الداخلة عليها\n\n\n### [الأعمال مكاسب والأحوال مواهب‏]\n\n\nولما كان المعلول موصوفا بالمرض كان ذا جهد ومشقة لما يقاسيه من ألم العلة القائمة به إذ لا يوجد عن العلة إلا معلول فلهذا جعلناه في باب المجاهدة لأن المجاهدة مشقة وتعب وبها سمي الجهاد جهادا ودين الله يسر وقول الله صدق حيث قال ما «جَعَلَ» عَلَيْكُمْ في الدِّينِ من حَرَجٍ وقال يُرِيدُ الله بِكُمُ الْيُسْرَ ولا يُرِيدُ بِكُمُ الْعُسْرَ ولهذا جعلنا بابا لترك الجهاد وهو الذي يلي هذا الباب وهو الباب السابع والسبعون في ترك المجاهدة لا ترك العمل لأن المجاهدة حال الأعمال في وقت والأحوال مواهب والأعمال مكاسب ولهذا أقيم الكسب مقام العمل والعمل مقام الكسب فجاء في آية وتُوَفَّى كُلُّ نَفْسٍ ما عَمِلَتْ وفي آية ما كَسَبَتْ فسمى العمل كسبا وناب كل واحد منهما مناب صاحبه ولهذا قلنا في الأعمال مكاسب ومن العمال من يكون عليهم في عملهم مشقة وهي المجاهدة ومنهم من لا يجدها فلا يكون صاحب مجاهدة فلو اقتضى العمل المشقة لكانت صفة كل عامل‏\n\n\n### [فصل أصناف المجاهدين الأربعة]\n\n\nواعلم أيدك الله أن المجاهدين هم أهل الجهد والمشقة والمكابدة وهم أربعة أصناف مجاهدون من غير تقييد بأمر وهو قوله تعالى وفَضَّلَ الله الْمُجاهِدِينَ عَلَى الْقاعِدِينَ والصنف الثاني مجاهدون بتقييد في سبيل الله وهو قوله والْمُجاهِدُونَ في سَبِيلِ الله والصنف الثالث المجاهدون فيه وهو قوله والَّذِينَ جاهَدُوا فِينا لَنَهْدِيَنَّهُمْ سُبُلَنا أي نبين لهم حتى يعلموا فيمن جاهدوا فيجاهدون عند ذلك أو لا يجاهدون والصنف الرابع المجاهدون في الله حَقَّ جِهادِهِ فميزهم عن المجاهدين من غير هذا التقييد كالذين يتقون الله حَقَّ تُقاتِهِ ويتلون الكتاب حَقَّ تِلاوَتِهِ فهي مرتبة رابعة في الجهاد\n\n\n### [ما دام التكليف موجودا فالمجاهدة قائمة]\n\n\nوهذه المجاهدة من المقامات المستصحبة للتكليف فما دام التكليف موجودا كانت المجاهدة قائمة العين فإذا زال حكم التكليف زالت المجاهدة ولهذا نفس الله عن المكلفين بصنف المباح لما شفعت فيهم‏\nالصورة التي خلقوا عليها لأنها غير محجور عليها فلما رأت من يشبهها قد حجر عليه سألت فيه رفع الحجر عنه فقيل لها إلى ذلك ما له في الآخرة فقالت فلا بد له أن يكون له حكم في الحياة الدنيا ليكون لي بشرى بقبول الشفاعة فإنك القائل لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ فإن هذه الصورة متنزهى وموضع نظري فإذا رأيت عليها التحجير أرى الانكسار فيها ولا نرى أثرا لعنايتي فيها مع كونها مخلوقة على صورتي ولا تحجير علي‏\n\n\n### [المباح والتكليف والمجاهدة]\n\n\nفشرع الله لها في الدنيا المباح فلا تنظر إليها الصورة الإلهية إلا في وقت تصرفها في المباح وهو أرفع أحوال النفس في الدنيا فإنه من الحياة الأخرى التي لا تحجير فيها فإذا انتقلت من المباح إلى مكروه أو مندوب أعرضت الصورة عن المكلف قليلا ونأت بجانبها مع بعض التفات إليها فإذا انتقلت إلى محظور أو فعل واجب أسدلت الحجاب وأعرضت بالكلية عن ذلك المكلف فلما رأى ذلك من كلفها وحجر عليها وهو الله تعالى أوجب على نفسه ما أوجبه مثل قوله كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ فرفع الحجاب ونظرت الصورة إلى كل واحد في كل حال من أحوال الأحكام‏\n\n\n### [الوجوب على الله وتعلق العلم الإلهي بالمعلومات‏]\n\n\nفانظر يا ولي ما ألطف الله وما أرأفه بعباده حيث شرك نفسه معهم في حكم الوجوب وما أسقط الوجوب عنهم بل أدخل نفسه معهم فيه إذ قد اتصفوا به ابتداء فلو أزاله عنهم لم يقم عندهم مقام إدخال نفسه معهم فيه أي ذقنا ما ذوقناكم هذا وغاية اللطف في الحكم والتنزل الإلهي كما نزل معهم في العلم المستفاد إذ كان علمهم مستفادا فقال ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ وهو العليم فانسهم وفيه حكم إيمان يعتض به من يسمع ممن لا يعرف الله قولهم إن الله لا يعلم الجزئيات وإن كانوا قصدوا بذلك التنزيه وهذه مسألة لا يمكن تحققها بالعقل ما لم يكن الكشف بكيفية تعلق العلم الإلهي بالمعلومات وأنه ليس في حق الحق ماض ولا آت وأن آنه لم يزل ولا يزال لا يتصف آنه بأنه لم يكن ثم كان ولا بانقضاء بعد ما كان وربما يعطي الله هذه القوة لمن شاء من عباده وقد ظهر منها نفحة على محمد صلى الله عليه وسلم علم بها علم الأولين والآخرين فعلم الماضي والمستقبل في الآن فلو لا حضور المعلومات له في حضرة الآن لما وصف بالعلم بها فهذا يعلم أن الله يعلم الجزئيات علما صحيحا غاب عنه من قصد التنزيه بنفيه عن جناب الحق‏\n\n\n### [المجاهدة حمل النفس على المشاق والرياضة تهذيب الأخلاق‏]\n\n\nثم نرجع ونقول إن المجاهدة حمل النفس على المشاق البدنية المؤثرة في المزاج وهنا وضعفا كما إن الرياضة تهذيب الأخلاق النفسية بحملها على احتمال الأذى في العرض والخارج عن بدنه مما لا حركة فيه بدنية ثم إن هذه الحركات البدنية المحمودة شرعا منها حركات في سبيل الله مطلقا وهي أنواع سبيل كل بر مشروع فمنه ما فيه مشقة فيسمى مجاهدة ومنه ما لا مشقة فيه فيرتفع عنها حكم هذا الاسم‏\n\n\n### [أعظم المشاق إتلاف المهج في سبيل الخلاق‏]\n\n\nوهذا الباب مخصوص بما فيه مشقة ولهذا سميناه باب المجاهدة فنظرنا إلى أعظم المشاق فلم نجد أعظم من إتلاف المهج في سبيل الله وهو الجهاد في سبيل الله الذي وصف الله قتلاه بأنهم أحياء يرزقون ونهى أن يقال فيهم أموات ونفى العلم عمن يلحقهم بالأموات للمشاركة في صورة مفارقة الإحساس وعدم وجود الأنفاس‏\n\n\n### [إبطال قياس الفقهاء والعقلاء]\n\n\nوهذا من أدل دليل على إبطال القياس لأن المعتقدين موت المجاهدين المقتولين في سبيل الله إنما اعتقدوه قياسا على المقتول في غير سبيل الله بالعلة الجامعة في كونهم رأوا كل واحد من المقتولين على صورة واحدة من عدم الأنفاس والحركات الحيوانية وعدم الامتناع مما يراد من الفعل بهم من قطع الأعضاء وتمزيق الجلود وأكل سباع الطير والسباع واستحالة أجسامهم إلى الدود والبلى فقاسوا فأخطأ والقياس ولا قياس أوضح من هذا أولا أدل في وجود العلة منه ومع هذا أكذبهم الله وقال لهم ما هو الأمر في المقتول في سبيلي كالمقتول في غير سبيلي ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله أَمْواتاً بَلْ أَحْياءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ فَرِحِينَ فقال لهم ذلك الحكم الذي حكمتم علي ليس بعلم وإذا لم يكن علما لم يكن صحيحا وإذا لم يصح لم يجز الحكم به مع علمنا بأخبار الله أن ذلك ليس بصحيح ثم قال ولا تَقُولُوا لِمَنْ يُقْتَلُ في سَبِيلِ الله أَمْواتٌ بَلْ أَحْياءٌ ولكِنْ لا تَشْعُرُونَ فنفى عنهم العلم الذي أعطاهم القياس فإذا كان حكم هذا القياس على وضوحه وعدم الريب فيه وتوفر أسبابه وظهور علله الجامعة بينه وبين غيره من القتلى وهو باطل بأخبار الله فما ظنك بقياس الفقهاء في النوازل وقياس العقلاء بحكم الشاهد على الغائب في معرفة الله هيهات صدق الله وكذب أهل القياس على الله والله لا أشبه من لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ من مثله الأشياء\n\n\n### [المجاهدون في سبيل الله وصنفا النفوس‏]\n\n\nفلما كان إتلاف المهج أعظم المشاق على النفوس لهذا سمي جهادا فإن النفوس نفسان نفس ترغب في الحياة الدنيا لألفتها بها فلا يريد المفارقة\nوتشق عليها ونفس ترغب في الحياة الدنيا لتزيد بذلك طاعة وأفعالا مقربة ومعرفة إلهية وترقيا دائما مع الأنفاس فشق عليها مفارقة الحياة الدنيا فلهذا سمي جهادا في حق الطائفتين فأما المجاهدون في سبيل الله وهي الطريق إلى الله أي إلى الوصول إليه من كونه إلها فهو جهاد لنيل معرفة المرتبة التي عنها ظهر العالم والأحكام فيه وعنها تكون الخلائف في الأرض فينا لهم في هذه السبل من المشقة ما يناله المسافر في طريقه المخوفة فإنه في طريق عرض نفسه في السلوك فيه إلى إتلاف ماله ونفسه ويتم أولاده وفقد مألوفاته قال تعالى وجاهَدُوا بِأَمْوالِهِمْ وأَنْفُسِهِمْ في سَبِيلِ الله وقال يُقاتِلُونَ في سَبِيلِ الله فَيَقْتُلُونَ ويُقْتَلُونَ‏\n\n\n### [الله اشترى من المؤمنين أنفسهم وأموالهم‏]\n\n\nولما علم الله من العباد أنه يكبر عليهم مثل هذا لدعواهم أن نفوسهم وأموالهم لهم كما أثبتها الحق لهم والله لا يقول إلا حقا فقدم شراء الأموال والنفوس منهم حتى يرفع يدهم عنها فبقي المشتري يتصرف في سلعته كيف يشاء والبائع وإن أحب سلعته فالعوض الذي أعطاه فيها وهو الثمن أحب إليه مما باعه فقال إِنَّ الله اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ وأَمْوالَهُمْ وبعد هذا الشراء أمر أن يجاهد بها في سبيل الله ليهون ذلك عليهم فهم يجاهدون بنفوس مستعارة أعني النفوس الحيوانية القائمة بالأجسام والأموال مستعارة\n\n\n### [الإنسان مجبول على الشفقة الطبيعية]\n\n\nفهم كمن سافر على دابة معارة ومال غيره وقد رفع عنه الحرج مالكها عند ما أعاره إن نفقت الدابة وهلك المال فهو مستريح القلب فما بقي عليه مشقة نفسية إن كان مؤمنا إلا ما يقاسي هذا المركب الحيواني من المشقة من طول الشقة وتعب الطريق وإن كان في قتال العدو فما ينال من الكر والفر والطعن بالأرماح والرشق بالسهام والضرب بالسيوف والإنسان مجبول على الشفقة الطبيعية فهو يشفق على مركوبه من حيث إنه حيوان لا من جهة مالكه فإن مالكه قد علم منه هذا المعبر أنه يريد إتلافه فذلك محبوب له فلم يبق له عليه شفقة إلا الشفقة الطبيعية\n\n\n### [النفوس التي اشتراها الحق والنفوس التي باعتها له‏]\n\n\nفالنفوس التي اشتراها الحق في هذه الآية إنما هي النفوس الحيوانية اشتراها من النفوس الناطقة المؤمنة فنفوس المؤمنين الناطقة هي البائعة المالكة لهذه النفوس الحيوانية التي اشتراها الحق منها لأنها التي يحل بها القتل وليست هذه النفوس بمحل للإيمان وإنما الموصوف بالإيمان النفوس الناطقة ومنها اشترى الحق نفوس الأجسام فقال اشترى من المؤمنين وهي النفوس الناطقة الموصوفة بالإيمان أنفسهم التي هي مراكبهم الحسية وهي الخارجة للقتال بهم والجهاد فالمؤمن لا نفس له فليس له في الشفقة عليها إلا الشفقة الذاتية التي في النفس الناطقة على كل حيوان‏\n\n\n### [المجاهدون بالله هم أرباب الجهاد العام‏]\n\n\nوأما المجاهدون الذين لم يقيدهم الله بصفة معينة لا في سبيل الله ولا فيه ولا بحق جهاد فهم المجاهدون بالله الذي ليس من صفته التقييد فجهاده في كل شي‏ء وهو الجهاد العام ونسبة الجهاد إليه فيه الذي هو المشقة لكونه سماه مجاهدا ولم يقيد فيما ذا يجاهد فهو حكم القضاء والقدر في الأشياء التي يحصل منه الكرة في المقضي عليه بما قضى به عليه والحق لا يريد مساءته لما له بهذا العبد من العناية\n\n\nفقال في هذا المقام ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة عبدي المؤمن يكره الموت وأكره مساءته ولا بد له من لقائي‏\n\n\nيقول ولا بد له من الموت لما سبق به العلم فيقبضه عن مجاهدة مطلقة غير مقيدة بأذى ولا غيره ولكن تنبيهه تعالى بالتردد دليل على حكم مناسب حكم المجاهدة فإنه ما جاء به إلا ليقيدنا العلم بالأمر على ما هو عليه فإنه سبحانه المعلم عباده العلم وهو قوله وقالَ الَّذِينَ أُوتُوا الْعِلْمَ وهو الذي أعطاهم العلم من اسمه الرحمن الذي قال فيه عَلَّمَ الْإِنْسانَ ما لَمْ يَعْلَمْ‏\n\n\n### [المجاهدون الذين لا يتقيدون هم المترددون‏]\n\n\nفالمجاهدون من العباد الذين لا يتقيدون كما أطلقهم الله هم المترددون في الأفعال الصادرة أعيانها فيهم هل ينسبونها إلى الله ففيها ما لا ينبغي أن ينسب إليه أدبا وتبرأ الحق منها كما قال بَراءَةٌ من الله أو ينسبونها لأنفسهم ففيها ما ينبغي أن ينسب إلى الله أدبا مع الله ونسبة حقيقية ورأوا الله يقول وما رَمَيْتَ إِذْ رَمَيْتَ فنفى وأثبت عين ما نفى ثم قال ولكِنَّ الله رَمى‏ فجعل الإثبات بين نفيين فكان أقوى من الإثبات لما له من الإحاطة بالمثبت ثم قال ولِيُبْلِيَ الْمُؤْمِنِينَ في نفس هذه الآية فعلمنا أن الله حير المؤمنين وهو ابتلاؤه بما ذكر من نفي الرمي وإثباته وجعله بلاء حسنا أي إن نفاه العبد عنه أصاب وإن أثبته له أصاب وما بقي إلا أي الإصابتين أولى بالعبد وإن كان كله حسنا وهذا موضع الحيرة ولذلك سماه بلاء أي موضع اختبار فمن أصاب الحق وهو مراد الله أي الإصابتين أو أي الحكمين أراد حكم النفي أو حكم الإثبات كان أعظم عند الله من الذي لا يصيب ذلك فهؤلاء هم المجاهدون الذين فضلهم الله على القاعدين عن هذا النظر أجرا عظيما وما عظم الله فلا يقدر قدره‏\nدرجات منه وما جعلها درجة واحدة كما قال في المجاهدين في سبيل الله حيث جعل لهم درجة واحدة ثم زادهم ما ذكر في تمام الآية\n\n\n### [المجاهدون في الله حق جهاده‏]\n\n\nفهذان صنفان قد ذكرنا وأما الصنف الثالث وهم الذين جاهدوا في الله حَقَّ جِهادِهِ فالهاء من جهاده تعود على الله أي يتصفون بالجهاد أي في حال جهاده صفة الحق كما ذكرنا في التردد الإلهي أي لا يرون مجاهدا إلا الله وذلك لأن الجهاد وقع فيه ولا يعلم أحد كيف الجهاد في الله إلا الله فإذا ردوا ذلك إلى الله وهو قوله حَقَّ جِهادِهِ فنسب الجهاد إليه بإضافة الضمير فكان المجاهد لا هم وإن كانوا محل ظهور الآثار فهم المجاهدون لا مجاهدون‏\n\n\nقال الله لموسى يا موسى اشكرني حق الشكر قال يا رب ومن يقدر على ذلك قال إذا رأيت النعمة مني فقد شكرتني حق الشكر وهذا الحديث خرجه ابن ماجة في سننه‏\n\n\n### [العمل المضاف إلى الله عن ذوق وكشف ومشاهدة]\n\n\nفكل عمل أضفته إلى الله عن ذوق وكشف ومشاهدة لا عن اعتقاد وحال بل عن مقام وعلم صحيح فقد أعطيت ذلك العمل حقه حيث رأيته ممن هو له فحيث ما وقع لك مثل هذا فشرحه ما شرحه به الله على لسان رسوله فبلغه إلينا وهي طريقة موصلة إلى الله سهلة لينة قريبة المأخذ مستوية لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً\n\n\n### [و الذين جاهدوا فينا لنهدينهم سبلنا]\n\n\nوالصنف الرابع هم الذين قال الله فيهم والَّذِينَ جاهَدُوا فِينا لَنَهْدِيَنَّهُمْ سُبُلَنا الذين قلنا لهم فيها ولا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ يعني السبيل التي لكم فيها السعادة وإلا فالسبل كلها إليه لأن الله منتهى كل سبيل ف إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ ولكن ما كل من رجع إليه سعد فسبيل السعادة هي المشروعة لا غير وإنما جميع السبل فغايتها كلها إلى الله أولا ثم يتولاها الرحمن آخر أو يبقى حكم الرحمن فيها إلى الأبد الذي لا نهاية لبقائه وهذه مسألة عجيبة المكاشف لها قليل والمؤمن بها أقل ولما كان سبب الجهاد أفعالا تصدر من الذين أمرنا بقتالهم وجهادهم وتلك الأفعال أفعال الله فما جاهدنا إلا فيه لا في العدو وإذ لم يكن عدوا إلا بها فإذا جاهدنا فيه وتبين لنا بقوله إذا جاهدنا فيه إن يهدينا سبله أي يبين لنا سبلها فندخلها فلا نرى إذا جاهدنا غيرا فاستغفرنا الله مما وقع منا وكان من السبل مشاهدة ما وقع منا إنه الموقع لا نحن فاستغفرنا الله أي طلبنا منه أن لا نكون محلا لظهور عمل قد وصف نفسه بالكراهة فيه فقد ثبت أنه ما في الوجود إلا الله فما جاهد فيه سواه ولو لا ما هدانا سبله ما عرفنا ذلك ولذلك تمم الآية بقوله وإِنَّ الله لَمَعَ الْمُحْسِنِينَ والإحسان أن تعبد الله كأنك تراه‏\n\n\nفإذا رأيته علمت إن الجهاد إنما كان منه وفيه‏\n\n\n### [الكتاب الإلهي والكتابة الإلهية]\n\n\nفهذا قد أعربت لك عن أحوال أهل المجاهدات وهم المجاهدون والكلام يطول في تفاصيل هذا الباب والكتاب كبير فإن استقصينا إيراد ما يطلبه منا كل باب لا يفي العمر بكتابته فإذا ولا بد من الاقتصار فلنقتصر على ما يجري من كل باب مجرى الأمهات لا غير وكل أم مثل حواء مع بنى آدم فإنهم بنوها كلهم فلو أعطانا الله الكتابة الإلهية أبرزنا جميع ما يحويه هذا الكتاب على الاستيفاء في ورقة صغيرة واحدة كما خرج رسول الله صلى الله عليه وسلم بكتابين في يده بالكتاب الإلهي الذي ليس لمخلوق فيه تعمل وأخبر أن في الكتاب الذي في يمينه أسماء أهل الجنة وأسماء آبائهم وقبائلهم وعشائرهم من أول خلقهم إلى يوم القيامة والكتاب الآخر مثله في أسماء أهل الشقاء ولو كان ذلك بالكتاب المعهود ما وسع ورقه المدينة فمثل ذلك لو وقع لنا أظهرناه في اللحظة وقد رأينا تلك الكتابة وهي كالجنة في عرض الحائط والنار وكصورة السماء في المرآة\n\n\n### [درجات أهل الله في المجاهدة]\n\n\nفلنذكر ما لهذه الصفة التي هي المجاهدة من المقامات التي هي مراتبها ومنازلها الذين ينزلها أهلها وهم الملامية وهم قسمان أهل أدب بوقوف عند حد وأهل أنس ووصال وكذلك ما للعارفين من هذا الباب وهم قسمان أهل أدب ووقوف عند حد وأهل أنس ووصال وهذا سار في كل مقام فالذي للملامية منه من الصنف الذي له أدب الوقوف عند الحدود فثلاث وخمسون درجة وإنما عدلنا إلى ذكر الدرجات لما سمعنا الله يقول بالدرجات في فضلهم فاتبعنا ما قال الله فهو أولى بنا والتي للملامية أهل الأنس والوصال من الدرجات في هذا الباب أربعمائة درجة وثلاث وخمسون وأما درجات العارفين أهل الأنس والوصال فلهم أربعمائة درجة وأربع وثمانون درجة وأما الذي لأهل الأدب والوقوف عند الحدود من العارفين فتسع وثمانون درجة تسعون إلا واحدة بينه وبين درجات الأسماء الإلهية عشرة\n\n",
    "en": "Chapter Seventy-Six: Concerning Spiritual Striving (المجاهدة)\n\nGlorify your God morning and evening,\nFor the sandal returns with guidance as a crown.\n\nStrive against your desire (الهوى) and do not be languid in it,\nAnd be a friend to calamities.\n\nIndeed, the striver (المجاهد) ceaselessly endures hardship,\nLoving great matters and devoted to the ultimate reason (التعليل).\n\nDo not incline toward idleness, for it leads to ruin,\nAnd be one who reaches the occurrences.\n\n### [The Letters of Causation and the Four Categories of Saints]\n\nKnow, may Allah grant you success, that when I began to speak on this chapter, I was shown a glad tiding in which I understood that people will inevitably be afflicted by a contingent Divine matter requiring them to bear hardship, both psychological and physical. I was told: \"Do not neglect, in every chapter, to include the small letters and explain that through their prolongation (إشباع), the three letters which are the letters of causation (حروف العلة) are formed. These are the letters of prolongation and softness (حروف المد واللين), and they are the letters composed of cause and effect (علة ومعلول). Let your discourse and reference concerning them point to the four categories [of people]:\n\n1. The Gnostics (العارفون) who possess the Divine, Existential, Generous Gnosis (العوارف الإلهية الوجودية الجودية) in their knowledge.\n2. The People of the Stations (أهل المواقف) at the Divine Boundaries (الحدود الإلهية), who receive discipline (الأدب) between every two stations during transition, in a state where they are described neither by the first station nor the second—these are the People of the Isthmuses (أهل البرازخ).\n3. Likewise, the People of Union and Intimacy (أهل الوصال والأنس), whose degrees in every station you must specify, just as you specify the degrees of the People of the Stations, so that the seeker is not confused.\n4. Likewise, those whose states are denied—the Malamatiyya (الملامية)—who know but are not known, distinguishing them from the People of Gnosis (أهل عوارف المعارف). You must reveal the perfection (الكمال) they possess, for they are the scholars of Allah.\n\nThese four categories must have their states addressed in every station: the Gnostics (العارفون), the Malamatiyya (الملامية), the People of Intimacy and Union (أهل الأنس والوصال), and the People of the Stations and the Saying (أصحاب المواقف والقول), who are the Disciplined Ones (الأدباء). For you are commanded to give sincere counsel (النصح) to the servants of Allah by the command of Allah, and the religion is sincere counsel to Allah, His Messenger, the leaders of the Muslims, and their common folk.\"\n\nWhen the Influx of the Isthmus (وارد البرزخ) concluded in the vision, we awoke from our sleep and asked Allah for protection (العصمة) in speech, action, and state. I saw with me in this vision our companion, Tāj al-Dīn Abbās ibn Umar al-Sarrāj, who was the one alerting me, by the command of the Real (الحق), to speak about the small letters (الحروف الصغار) from which the three letters of causation (حروف العلل) are generated. Let us first explain what is meant by the small letters and the levels of their offspring, which are the letters of causation, even though we mentioned them in the Second Chapter, the Chapter of Letters, of this book. We must mention a portion of it here because of the vision.\n\n### (Section) [The Small Letters and the Levels of their Offspring]\n\nKnow that the small letters (الحروف الصغار) refer to the three short vowels (الحركات الثلاثة): the Damma (الضمة), the Fatha (الفتحة), and the Kasra (الكسرة). These letters have two states: a state of prolongation (إشباع) and a state of non-prolongation. If one of them is characterized by prolongation, it becomes the cause (*'illa*) for the existence of a corresponding effect (*ma'lūl*). If the Damma is prolonged, the resultant Wāw (الواو المعلولة) is generated from it. If it is a Fatha, the Alif (الألف) is generated from it. If it is a Kasra, the resultant Yā’ (الياء المعلولة) is generated from it. We restrict the Wāw and the Yā’ to being effects because they may exist in a state of soundness (الصحة) without being described by causality. However, the Alif is never found except as an effect, which is why the letter preceding it must always be open (مفتوح).\n\n### [The Letters of Causation emerged in the form of their causes in ruling]\n\nThese are called the letters of causation (حروف العلة)—meaning they came into existence as effects of these causes. They emerged in the form of their causes in ruling, so words are inflected by them just as they are inflected by their causes. You say, *Zayd akhūka* (Zayd is your brother). The sign of the nominative case (*raf'*) in *Zayd* is the Damma on the Dāl. Through the prolongation of the Damma in your saying *akhūka*, the Wāw becomes the sign of the nominative case in *akhūka*. Likewise, in the accusative case (*naṣb*), when you say, *Ra’aytu Zaydan akhāka* (I saw Zayd, your brother), and in the genitive case (*khafḍ*), *Marartu bi Zaydin akhīka* (I passed by Zayd, your brother). Similarly, *Ra’aytu akhāka Zaydan*: the Fatha on *Zayd* is the sign of the accusative case, and the Alif in *akhāka*, generated from the Fatha on the Khā’, is the sign of the accusative case. Likewise, *Marartu bi akhīka Zaydin*: the Kasra on *Zayd* is the sign of the genitive case, and the Yā’ in *akhīka* is the sign of the genitive case. Thus, the Yā’ was given the ruling of its effect, and these letters render the word defective (أعلت الكلمة), so they possess the ruling of their parents.\n\n### [The Divine Names corresponding to these Small Letters and their effects in the Cosmos]\n\nThe Nominative case (*raf'*) corresponds to the Name *al-'Alī* (The Exalted). The Fatha corresponds to the Name *ar-Raḥmān* (The Compassionate), as in His saying: <<مَا يَفْتَحِ اللهُ لِلنَّاسِ مِنْ رَحْمَةٍ>> (Whatever Allah opens for mankind of mercy). The Kasra corresponds to the Name *al-Muta'ālī* (The Transcendent).\n\nThe effects of these Divine Names (الأسماء الإلهية) in the cosmos (الكون) are known, just as they are distinct in the Real (الحق) by their boundaries, distinguishing some from others. We have explained them in the Second Chapter of this book, where we also clarified the movements of construction (حركات البناء) from the movements of inflection (حركات الإعراب), the level of the living and dead *sukūn* (rest), and the attachment of the Nūn to the letters of causation in the ruling of inflection in the five forms of the verb (الأمثلة الخمسة): *yaf'alān*, *taf'alān*, *yaf'alūn*, *taf'alūn*, and *taf'alīn*. Their affirmation is inflection, and their omission is inflection, according to the governing factors applied to them.\n\n### [Actions are Acquisitions and States are Gifts]\n\nSince the effect (*ma'lūl*) is described by sickness or defect (المرض), it is characterized by effort and hardship due to the pain it endures from the cause (*'illa*) residing within it—for nothing exists from the cause except the effect. For this reason, we have placed it in the Chapter of Spiritual Striving (المجاهدة), because striving is hardship and fatigue, and it is why *Jihād* is named *Jihād*.\n\nYet, the religion of Allah is ease, and the word of Allah is true where He said: <<مَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ>> (He has not placed upon you in the religion any difficulty), and He said: <<يُرِيدُ اللهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ>> (Allah intends for you ease and does not intend for you hardship). Therefore, we have dedicated a chapter to the abandonment of striving, which follows this chapter—Chapter Seventy-Seven: Concerning the Abandonment of Spiritual Striving (ترك المجاهدة)—not the abandonment of action (ترك العمل), because striving is a state of actions at a certain time, while states (الأحوال) are gifts (مواهب) and actions (الأعمال) are acquisitions (مكاسب).\n\nFor this reason, acquisition is placed in the position of action, and action in the position of acquisition. Thus, in one verse, it says: <<وَتُوَفَّى كُلُّ نَفْسٍ مَا عَمِلَتْ>> (And every soul will be fully compensated for what it did), and in another verse: <<مَا كَسَبَتْ>> (What it acquired). So, action is called acquisition, and each takes the place of the other. This is why we said that actions are acquisitions. Among those who act, some experience hardship in their action, which is striving, and some do not find it, so they are not people of striving. If action necessarily entailed hardship, then it would be the description of every actor.\n\n### [Section: The Four Categories of Strivers]\n\nKnow, may Allah support you, that the strivers (المجاهدون) are the people of effort, hardship, and endurance, and they are of four categories:\n\n1. **Strivers without restriction by an attribute:** This is His saying: <<وَفَضَّلَ اللهُ الْمُجَاهِدِينَ عَلَى الْقَاعِدِينَ>> (And Allah has favored the strivers over the sedentary).\n2. **Strivers restricted to the path of Allah:** This is His saying: <<وَالْمُجَاهِدُونَ فِي سَبِيلِ اللهِ>> (And the strivers in the path of Allah).\n3. **The strivers in Him:** This is His saying: <<وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا>> (And those who strive in Us—We will surely guide them to Our paths). That is, We will clarify them for them so that they may know in whom they strove, and then they may strive or not strive.\n4. **The strivers in Allah, the striving due to Him (حَقَّ جِهَادِهِ):** This distinguishes them from the strivers without this restriction, just as those who fear Allah with the fear due to Him (حَقَّ تُقَاتِهِ) and those who recite the Book with the recitation due to Him (حَقَّ تِلَاوَتِهِ). This is a fourth level in striving.\n\n### [As long as the obligation exists, striving remains]\n\nThis striving (المجاهدة) is one of the stations that accompany the obligation (التكليف). As long as the obligation exists, striving remains manifest. When the ruling of the obligation ceases, striving ceases.\n\nFor this reason, Allah relieved the obligated ones (المكلفين) through the category of the Permissible (المباح) when the Form (الصورة) upon which they were created interceded for them, because that Form is not restricted. When the Form saw that what resembled it was restricted, it asked for the restriction to be lifted. It was told: \"That is his portion in the Hereafter.\" The Form replied: \"Then he must have a ruling in the worldly life, so that I may have glad tidings of the acceptance of my intercession, for You are the One who said: <<لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ>> (For them are glad tidings in the worldly life and in the Hereafter). This Form is My place of recreation and My object of contemplation. If I see restriction upon it, I see brokenness in it, and I do not see the effect of My care in it, despite its being created upon My Form, and there is no restriction upon Me.\"\n\n### [The Permissible, Obligation, and Spiritual Striving]\n\nSo, Allah legislated the Permissible (المباح) for the Form in this world. The Divine Form (الصورة الإلهية) only looks upon the obligated one when he is engaged in the Permissible, for this is the highest state of the soul in this world, as it is part of the other life where there is no restriction.\n\nIf the obligated one moves from the Permissible to the Disliked (مكروه) or the Recommended (مندوب), the Form turns away slightly and withdraws to its side, though with some attention still paid to him. If he moves to the Forbidden (محظور) or performs an Obligatory act (واجب), the Form lowers the veil (أسدلت الحجاب) and turns away completely from that obligated one.\n\nWhen the One who obligated and restricted him—who is Allah the Exalted—saw this, He made incumbent upon Himself what He made incumbent, such as His saying: <<كَتَبَ رَبُّكُمْ عَلَى نَفْسِهِ الرَّحْمَةَ>> (Your Lord has decreed upon Himself mercy), and <<وَكَانَ حَقًّا عَلَيْنَا نَصْرُ الْمُؤْمِنِينَ>> (And it was incumbent upon Us to support the believers). Thus, the veil was lifted, and the Form looked upon every individual in every state of the rulings.\n\n### [Obligation upon Allah and the connection of Divine Knowledge to the known things]\n\nLook, O friend, how subtle Allah is and how compassionate He is toward His servants, where He shared Himself with them in the ruling of obligation (الوجوب). He did not remove the obligation from them, but rather included Himself with them in it, since they were initially characterized by it. Had He removed it from them, His inclusion of Himself with them would not have been established in their view—meaning, \"We have made you taste what We taste.\"\n\nThis is the ultimate subtlety in ruling and Divine descent (التنزل الإلهي), just as He descended with them in acquired knowledge (العلم المستفاد), since their knowledge is acquired. He said: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know), and He is the All-Knowing (العليم). This comforts them, and it contains a ruling of faith that supports those who hear from people who do not know Allah their saying that Allah does not know particulars (الجزئيات), even if they intended transcendence (التنزيه) by that. This is an issue that cannot be realized by the intellect unless there is Unveiling (الكشف) regarding the manner in which Divine Knowledge (العلم الإلهي) relates to the known things, and that in respect to the Real (الحق), there is no past or future, and His Instant (آن) has ever been and ever shall be. His Instant is not described by having not been and then being, nor by ceasing after having been.\n\nAllah may grant this power to whomever He wills among His servants. A breath of this appeared to Muhammad (peace and blessings be upon him), by which he knew the knowledge of the first and the last, knowing the past and the future in the Instant (الآن). Were it not for the presence of the known things to Him in the Presence of the Instant (حضرة الآن), He would not be described by the knowledge of them. This confirms that Allah knows the particulars with sound knowledge, a fact missed by those who intended transcendence by denying it from the Divine Presence.\n\n### [Spiritual Striving is imposing hardship, and Spiritual Discipline is refining character]\n\nWe return now to say that Spiritual Striving (المجاهدة) is the imposition of physical hardships upon the soul (النفس), which affect the temperament (المزاج) with weakness and exhaustion. Spiritual Discipline (الرياضة), on the other hand, is the refinement of psychological character (الأخلاق النفسية) by compelling it to endure harm in reputation and external matters that do not involve physical movement.\n\nFurthermore, these praiseworthy physical movements, according to the Law, include movements in the path of Allah (سبيل الله) absolutely, which are types of the path of every sanctioned righteousness. Some of these involve hardship, so they are called striving (مجاهدة), and some do not involve hardship, so the ruling of this name is lifted from them.\n\n### [The greatest hardships are the destruction of vital spirits in the path of the Creator]\n\nThis chapter is specific to what involves hardship, which is why we named it the Chapter of Spiritual Striving. We looked at the greatest hardships and found nothing greater than the destruction of the vital spirits (إتلاف المهج) in the path of Allah, which is *Jihād fī sabīl Allāh*. Allah described those killed in it as being alive and provided for (أحياء يرزقون), and He forbade calling them dead, denying knowledge to those who equate them with the dead due to the shared appearance of the separation of sensation and the absence of breath.\n\n### [Invalidating the Analogy of the Jurists and Rationalists]\n\nThis is the clearest proof for the invalidation of analogy (إبطال القياس). Those who believe that the strivers killed in the path of Allah are dead only believe this by analogy (*qiyās*) with those killed in other than the path of Allah, based on the unifying cause (العلة الجامعة) that they saw both categories of the killed in the same state: absence of breath and animal movements, and lack of resistance to actions performed upon them, such as cutting limbs, tearing skin, being eaten by birds and beasts of prey, and the decomposition of their bodies into worms and decay. They used analogy and erred. There is no analogy clearer or more indicative of the existence of the unifying cause than this, yet Allah refuted them and told them that the ruling concerning those killed in His path is not the same as those killed in other paths: <<وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ فَرِحِينَ>> (And never think of those who have been killed in the cause of Allah as dead. Rather, they are alive with their Lord, receiving provision, rejoicing). He told them that the ruling they made was not knowledge, and if it is not knowledge, it is not sound. If it is not sound, it is not permissible to rule by it, especially since we have knowledge from the reports of Allah that it is not sound. Then He said: <<وَلَا تَقُولُوا لِمَنْ يُقْتَلُ فِي سَبِيلِ اللهِ أَمْوَاتٌ بَلْ أَحْيَاءٌ وَلَكِنْ لَا تَشْعُرُونَ>> (And do not say about those who are killed in the way of Allah, \"They are dead.\" Rather, they are alive, but you perceive it not). Thus, He denied them the knowledge that analogy had granted them.\n\nIf the ruling of this analogy, despite its clarity, lack of doubt, abundance of its premises, and the manifest nature of its unifying cause between the martyrs and other killed persons, is invalid by the reports of Allah, then what do you think of the analogy of the jurists (قياس الفقهاء) in legal cases, and the analogy of the rationalists (قياس العقلاء) who judge the Unseen by the witnessed in the knowledge of Allah? Far be it! Allah speaks the truth, and the people of analogy concerning Allah lie. Allah is not resembled by anything, for <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him) among the likenesses of things.\n\n### [Strivers in the Path of Allah and the Two Categories of Souls]\n\nSince the destruction of the vital spirits is the greatest hardship for the souls, it is called *Jihād*. Souls are of two kinds: a soul that desires worldly life due to its familiarity with it, so separation is difficult for it and causes hardship; and a soul that desires worldly life in order to increase obedience, acts of proximity, Divine Gnosis (معرفة إلهية), and continuous ascent with every breath, so separation from worldly life is difficult for it. For this reason, it is called *Jihād* (striving) in respect to both groups.\n\nAs for the strivers in the path of Allah (سبيل الله)—which is the path to Allah, meaning to reach Him from the perspective of His being God (إلها)—it is a striving to attain knowledge of the level (المرتبة) from which the world and its rulings appeared, and from which the vicegerents (الخلائف) on Earth arise. They endure in these paths the same hardship that a traveler endures on a dangerous road, for in traversing it, he exposes himself to the destruction of his wealth and life, the orphanhood of his children, and the loss of his familiar things. Allah the Exalted said: <<وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللهِ>> (And they strove with their wealth and their lives in the cause of Allah), and He said: <<يُقَاتِلُونَ فِي سَبِيلِ اللهِ فَيَقْتُلُونَ وَيُقْتَلُونَ>> (They fight in the cause of Allah, so they kill and are killed).\n\n### [Allah purchased the lives and wealth of the believers]\n\nSince Allah knew that such a thing would be difficult for the servants, due to their claim that their lives and wealth belong to them—as the Real (الحق) affirmed for them, and Allah speaks nothing but the truth—He first purchased their wealth and lives from them so that they would relinquish control over them. Thus, the Buyer (Allah) disposes of His commodity as He wills, and the seller, even if he loves his commodity, loves the compensation (الثمن) given for it more than what he sold. So He said: <<إِنَّ اللهَ اشْتَرَى مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوَالَهُمْ>> (Indeed, Allah has purchased from the believers their lives and their properties). After this purchase, He commanded them to strive with them in the path of Allah, to make it easier for them. Thus, they strive with borrowed lives—meaning the animal souls (النفوس الحيوانية) residing in the bodies—and borrowed wealth.\n\n### [Man is naturally inclined to natural compassion]\n\nThey are like one who travels on a borrowed mount and with someone else's wealth, and the owner has relieved him of difficulty by lending it, saying that if the mount perishes or the wealth is lost, he is free of blame. If the servant is a believer, no psychological hardship remains for him except what this animal vehicle endures from the fatigue of a long journey and the difficulty of the road. If he is in combat with the enemy, it is the hardship of charging and retreating, being stabbed by spears, shot by arrows, and struck by swords. Man is naturally inclined to natural compassion (الشفقة الطبيعية), so he feels compassion for his vehicle because it is an animal, not because of its owner, for its owner knows that this vehicle is intended for destruction, and that is beloved to him. Thus, no compassion remains for it except natural compassion.\n\n### [The Souls purchased by the Real and the Souls that sold them to Him]\n\nThe souls (النفوس) that the Real purchased in this verse are the animal souls (النفوس الحيوانية). He purchased them from the believing rational souls (النفوس الناطقة المؤمنة). The rational souls of the believers are the sellers who own these animal souls that the Real purchased from them, because they are the locus of the killing. These [animal] souls are not the locus of faith; rather, the rational souls are described by faith. It is from them that the Real purchased the souls of the bodies, saying: <<اشْتَرَى مِنَ الْمُؤْمِنِينَ>> (He purchased from the believers)—who are the rational souls described by faith—<<أَنْفُسَهُمْ>> (their lives), which are their sensory vehicles (مراكبهم الحسية) that go out for fighting and striving. The believer has no [personal] soul remaining, so his compassion for it is only the inherent compassion that the rational soul has for every living creature.\n\n### [The Strivers by Allah are the masters of General Striving]\n\nAs for the strivers (المجاهدون) whom Allah did not restrict with a specific attribute—neither in the path of Allah, nor in Him, nor with the striving due to Him—they are the strivers *by* Allah (المجاهدون بالله), whose attribute is not restriction. Their striving is in everything; it is the General Striving (الجهاد العام). The attribution of striving to Him, which is hardship, is due to His naming him a striver without restricting what he strives in. This is the ruling of Divine Decree and Destiny (القضاء والقدر) in things, from which the turning back occurs in the one decreed upon, concerning what was decreed upon him. The Real does not intend his distress, due to the care He has for this servant.\n\nIn this station, He said: \"I have not hesitated concerning anything I am to do as I hesitate in taking the soul of My believing servant. He dislikes death, and I dislike distressing him, but he must meet Me.\"\n\nHe says, \"He must die,\" because of what was preceded by [Divine] Knowledge. So He takes his soul from an absolute striving (مجاهدة مطلقة), unrestricted by harm or otherwise. However, His notification of hesitation (التردد) is evidence of a ruling appropriate to the ruling of striving, for He only brought it forth to bind our knowledge to the matter as it truly is, since He, glory be to Him, is the One who teaches His servants knowledge. This is His saying: <<وَقَالَ الَّذِينَ أُوتُوا الْعِلْمَ>> (And those who were given knowledge said), and He is the one who gave them knowledge from His Name *ar-Raḥmān*, concerning which He said: <<عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ>> (He taught man that which he knew not).\n\n### [The Strivers who are not restricted are the Hesitant Ones]\n\nThe strivers among the servants who are not restricted, as Allah left them unrestricted, are the Hesitant Ones (المترددون) regarding the actions whose essences appear through them: Should they attribute them to Allah? For among them are actions that should not be attributed to Him, as a matter of courtesy (أدبا), and which the Real disavowed, as He said: <<بَرَاءَةٌ مِنَ اللهِ>> (A declaration of disassociation from Allah). Or should they attribute them to themselves? For among them are actions that should be attributed to Allah, as a matter of courtesy toward Allah and a true attribution. They saw Allah saying: <<وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللهَ رَمَى>> (And you did not throw when you threw, but it was Allah who threw). He negated and affirmed the very thing He negated, then said: <<وَلَكِنَّ اللهَ رَمَى>> (But it was Allah who threw). Thus, He placed the affirmation between two negations, making it stronger than affirmation alone, due to His encompassing nature of the affirmed thing. Then He said in the same verse: <<وَلِيُبْلِيَ الْمُؤْمِنِينَ>> (And that He might test the believers).\n\nWe thus know that Allah perplexed the believers, and this is His testing them with the aforementioned negation and affirmation of the throwing. He called it a good trial (بلاء حسنا)—meaning that if the servant negated it from himself, he was correct, and if he affirmed it for himself, he was correct. The only question remaining is which of the two correct views is more appropriate for the servant, even though all of it is good. This is the point of perplexity, and that is why He called it a trial (بلاء), meaning a place of testing. Whoever attains the Real (الحق)—which is Allah's intention regarding which of the two correct views or which of the two rulings He desired, the ruling of negation or the ruling of affirmation—is greater in the sight of Allah than one who does not attain that. These are the strivers whom Allah favored over the sedentary (القاعدين) in this contemplation with a great reward, and what Allah magnifies, no one can estimate its measure.\n\nHe made it degrees, and did not make it a single degree, as He said concerning the strivers in the path of Allah, where He assigned them a single degree, then increased them with what is mentioned at the end of the verse.\n\n### [The Strivers in Allah, the striving due to Him]\n\nThese are two categories we have mentioned. As for the third category, those who strove in Allah, the striving due to Him (حَقَّ جِهَادِهِ): the pronoun *hā'* in *jihādihi* refers back to Allah. That is, they are characterized by striving, meaning in the state of His striving, which is an attribute of the Real, as we mentioned in the Divine Hesitation (التردد الإلهي). They see no striver but Allah. This is because the striving occurred *in* Him, and no one knows what striving *in* Allah is except Allah. When they referred that back to Allah, which is His saying *ḥaqqa jihādihi* (the striving due to Him), attributing the striving to Him by the possessive pronoun, the striver was not them, even though they are the locus of the manifestation of the effects; rather, they are the ones being striven, not the strivers.\n\nAllah said to Moses: \"O Moses, thank Me with the gratitude due to Me (حق الشكر).\" Moses said: \"O Lord, who is capable of that?\" He said: \"If you see the blessing as coming from Me, then you have thanked Me with the gratitude due to Me.\" This hadith was transmitted by Ibn Mājah in his *Sunan*.\n\n### [Action attributed to Allah through taste, unveiling, and witnessing]\n\nEvery action that you attribute to Allah through spiritual taste (ذوق), unveiling (كشف), and witnessing (مشاهدة)—not through mere belief or state, but through a station (مقام) and sound knowledge—you have given that action its due, since you saw it as belonging to the One to whom it belongs. Wherever such a thing occurs to you, its explanation is what Allah explained through the tongue of His Messenger, which He conveyed to us. This is a path leading to Allah (طريقة موصلة إلى الله), easy, soft, close to attainment, and straight: <<لَا تَرَى فِيهَا عِوَجًا وَلَا أَمْتًا>> (You will see therein no deviation or unevenness).\n\n### [And those who strive in Us—We will surely guide them to Our paths]\n\nThe fourth category are those concerning whom Allah said: <<وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا>> (And those who strive in Us—We will surely guide them to Our paths). These are the paths concerning which we were told: <<وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ>> (And do not follow [other] ways, for they will separate you from His way)—meaning the path in which you find felicity (السعادة). Otherwise, all paths lead to Him, because Allah is the end of every path: <<إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (To Him is returned the whole affair). However, not everyone who returns to Him is felicitous. The path of felicity is the legislated path and no other.\n\nThe ultimate end of all paths is first to Allah, then the Compassionate (الرحمن) takes charge of them finally, or the ruling of the Compassionate remains in them until the endless eternity of His subsistence. This is a marvelous issue, few are those who unveil it, and fewer are those who believe in it.\n\nSince the cause of striving is actions that issue from those we are commanded to fight and strive against, and those actions are the actions of Allah, we only strove *in Him*, not in the enemy. Since there is no enemy except through Him, when we strive in Him, His saying that He will guide us to His paths (سبله) becomes clear to us—meaning He will clarify His paths for us, so we enter them and, when we strive, we see no other. Thus, we seek forgiveness from Allah for what issued from us. One of the paths is the witnessing that what issued from us was the Doer, not us. So we seek forgiveness from Allah—meaning we ask Him not to be the locus for the manifestation of an action that He described Himself as disliking.\n\nIt is established that there is nothing in Existence (الوجود) but Allah, so we strove in none other than Him. Were it not for His guiding us to His paths, we would not have known that. Therefore, He completed the verse by saying: <<وَإِنَّ اللهَ لَمَعَ الْمُحْسِنِينَ>> (And indeed, Allah is with the doers of excellence). And excellence (الإحسان) is that you worship Allah as if you see Him.\n\nIf you see Him, you know that the striving was only from Him and in Him.\n\n### [The Divine Book and the Divine Writing]\n\nThus, I have expressed to you the states of the people of striving (أهل المجاهدات), who are the strivers. The discussion of the details of this chapter is lengthy, and the book is vast. If we were to exhaustively include everything required of us by every chapter, life would not suffice for its writing. Since we must be concise, let us restrict ourselves to what flows from every chapter as the essentials (الأمهات) and nothing else. Every essential is like Eve (حواء) with the Children of Adam, for they are all her children.\n\nIf Allah were to grant us the Divine Writing (الكتابة الإلهية), we would manifest everything contained in this book completely on a single small sheet of paper, just as the Messenger of Allah (peace and blessings be upon him) emerged with two books in his hand: the Divine Book (الكتاب الإلهي) in which no creature had any hand, and he informed us that the book in his right hand contained the names of the people of Paradise, the names of their fathers, tribes, and clans, from the beginning of their creation until the Day of Resurrection. The other book was similar, containing the names of the people of wretchedness. If that were done with the customary writing, its paper would not encompass the city [of Medina]. If such a thing were to occur to us, we would manifest it in an instant. We have seen that writing, and it is like Paradise on the face of the wall, and the Fire, and like the image of the sky in the mirror.\n\n### [The Degrees of the People of Allah in Spiritual Striving]\n\nLet us mention the stations (المقامات) of this attribute, which is Spiritual Striving (المجاهدة), which are its levels (مراتب) and the stages where its people reside. These are the Malamatiyya (الملامية), who are of two divisions: People of Discipline (أهل أدب) by standing at a boundary (حد), and People of Intimacy and Union (أهل أنس ووصال). Likewise, the Gnostics (العارفون) in this chapter are of two divisions: People of Discipline and standing at a boundary, and People of Intimacy and Union. This applies to every station.\n\nThe portion of the Malamatiyya who possess the discipline of standing at the boundaries consists of fifty-three degrees. We turned to mentioning the degrees because we heard Allah speak of degrees in their favor, so we followed what Allah said, as it is more appropriate for us.\n\nThe degrees belonging to the Malamatiyya who are the People of Intimacy and Union in this chapter are four hundred and fifty-three degrees.\n\nAs for the degrees of the Gnostics who are the People of Intimacy and Union, they have four hundred and eighty-four degrees.\n\nAs for the degrees belonging to the Gnostics who are the People of Discipline and standing at the boundaries, they have eighty-nine degrees—ninety minus one—with a difference of ten between them and the degrees of the Divine Names (الأسماء الإلهية).",
    "ur": "(چھہترواں باب: مجاہدہ کے بیان میں)\n\nاپنے معبود کی صبح و شام تسبیح کر، کیونکہ\nنعل (جوتی) ہدایت کے ذریعے تاج بن کر لوٹتی ہے۔\n\nاپنی خواہشات سے مجاہدہ کر اور اس میں سستی نہ کر،\nاور مصیبتوں کا دوست بن جا۔\n\nبے شک مجاہد ہمیشہ مشقت اٹھانے والا ہوتا ہے،\nوہ مصیبتوں کو پسند کرتا ہے اور (ان کے) سبب کو محبوب رکھتا ہے۔\n\nہرگز کاہلی کی طرف مائل نہ ہو، کیونکہ وہ ہلاک کر دیتی ہے،\nاور حوادث (واقعات) تک پہنچنے والا بن۔\n\n### [حروف علت اور اولیاء کے چار اصناف]\n\nجان لو، اللہ تمہیں توفیق دے، کہ جب میں نے اس باب پر کلام شروع کیا تو مجھے ایک بشارت دکھائی گئی جس میں میں نے جانا کہ لوگوں پر لازماً ایک عارضی امر الٰہی نازل ہوگا جس میں انہیں روحانی اور حسی مشقت اور کوشش اٹھانے کی ضرورت ہوگی۔ اور مجھ سے کہا گیا کہ تم ہر باب میں چھوٹے حروف (حروف صغار) کو شامل کرنے سے غافل نہ ہونا اور یہ بیان کرنا کہ ان کے اشباع (توسیع) سے وہ تین حروف بنتے ہیں جو حروف علت (حروف العلة) ہیں، اور وہ حروف مد و لین ہیں، اور وہ حروف ہیں جو علت (علة) اور معلول (معلول) سے مرکب ہیں۔\n\nاور تمہارا کلام ان میں اور تمہارا اشارہ چار اصناف کی طرف ہوگا، اور وہ عارفین (العارفون) ہیں جن کے لیے ان کی معرفت (المعرفۃ) میں وجودی (الوجود) اور جودی (سخاوت پر مبنی) الٰہی عوارف (معرفتیں) ہیں۔ اور وہ لوگ جو حدود الٰہیہ (الحدود الإلهية) پر مواقف (المواقف) والے ہیں تاکہ ہر دو مقام کے درمیان ادب حاصل کریں جب وہ ایسی حالت میں منتقل ہو رہے ہوں جس میں وہ نہ پہلے مقام سے متصف ہوں اور نہ دوسرے سے، اور وہ اہل برازخ (برزخ والے) ہیں۔ اسی طرح اہل وصال (الوصال) اور انس (الأنس) بھی ہیں، تم ان کے لیے ہر مقام میں ان کے درجات کو متعین کرو گے جیسا کہ تم اہل مواقف کے لیے متعین کرتے ہو، تاکہ سالک (راہرو) پر کوئی التباس نہ ہو۔ اسی طرح وہ لوگ جن کے احوال کا انکار کیا جاتا ہے، اور وہ ملامیہ (الملامية) ہیں جو جانتے ہیں اور پہچانے نہیں جاتے، تم انہیں اہل عوارف المعارف سے ممتاز کرو گے اور ان کے کمال کو ظاہر کرو گے، اور وہ اللہ کے عالم ہیں۔ پس ان چاروں کے احوال کو ہر مقام میں بیان کرنا ضروری ہے، اور وہ عارفین (العارفون)، ملامیہ (الملامية)، اہل انس و وصال (الأنس والوصال)، اور اصحاب مواقف و قول ہیں، اور وہ اہل ادب ہیں۔ کیونکہ تمہیں اللہ کے حکم سے اللہ کے بندوں کو نصیحت کرنے کا حکم دیا گیا ہے، اور دین اللہ کے لیے، اس کے رسول کے لیے، مسلمانوں کے ائمہ کے لیے اور عام مسلمانوں کے لیے نصیحت ہے۔ جب اس واقعہ میں برزخ کا وارد (الہام) ختم ہوا تو ہم اپنی خواب گاہ سے اٹھے اور ہم نے اللہ تعالیٰ سے قول، عمل اور حال میں عصمت (حفاظت) طلب کی۔ اور میں اس واقعہ میں اپنے ساتھی تاج الدین عباس بن عمر السراج کو اپنے ساتھ دیکھ رہا تھا، اور وہی تھے جو مجھے حق تعالیٰ کی طرف سے ان چھوٹے حروف (حروف صغار) پر کلام کرنے کے لیے متنبہ کر رہے تھے جن سے تین حروف علت (حروف العلل) پیدا ہوتے ہیں۔ پس ہم پہلے یہ بیان کریں گے کہ حروف صغار سے کیا مراد ہے اور ان کی اولاد یعنی حروف علت (حروف العلل) کے کیا مراتب ہیں، اگرچہ ہم نے انہیں اس کتاب کے دوسرے باب (باب الحروف) میں ذکر کیا ہے، لیکن اس واقعہ کی وجہ سے یہاں اس کا ایک حصہ ذکر کرنا ضروری ہے۔\n\n### (فصل) [حروف صغار اور ان کی اولاد کے مراتب]\n\nجان لو کہ حروف صغار سے مراد تین حرکات ہیں، اور وہ ضمہ (پیش)، فتحہ (زبر) اور کسرہ (زیر) ہیں۔ اور ان حروف کی دو حالتیں ہیں: اشباع (توسیع) کی حالت اور غیر اشباع کی حالت۔ پس جب ان میں سے کوئی ایک اشباع سے متصف ہوتا ہے تو وہ ایک مناسب معلول (معلول) کے وجود کے لیے علت (علة) بن جاتا ہے۔ پس اگر ضمہ کو اشباع دیا جائے تو اس سے معلول (المعلولۃ) واؤ پیدا ہوتا ہے، اور اگر فتحہ ہو تو اس سے الف پیدا ہوتا ہے، اور اگر کسرہ ہو تو اس سے معلول (المعلولۃ) یاء پیدا ہوتی ہے۔ اور ہم نے واؤ اور یاء کو علت (علة) کے ساتھ اس لیے مقید کیا ہے کہ وہ صحت کے مقام میں بھی پائے جا سکتے ہیں جبکہ وہ علیت (علية) سے متصف نہ ہوں، لیکن الف کبھی بھی معلول (معلولۃ) ہوئے بغیر نہیں پایا جاتا، اسی لیے اس سے پہلے ہمیشہ مفتوح (زبر والا) ہی ہوتا ہے۔\n\n### [حروف علت اپنے حکم میں اپنی علتوں کی صورت پر ظاہر ہوئے]\n\nپس یہ حروف علت (حروف العلة) کہلاتے ہیں، یعنی یہ ان علتوں (علل) سے معلول (معلولۃ) ہو کر پائے گئے، لہٰذا یہ حکم میں اپنی علتوں کی صورت پر ظاہر ہوئے، اور ان کے ذریعے کلمات کا اعراب کیا گیا جیسا کہ ان کی علتوں کے ذریعے اعراب کیا جاتا ہے۔ تم کہتے ہو \"زید اخوک\"، تو زید میں رفع کی علامت دال پر ضمہ ہے، اور تمہارے قول \"اخوک\" میں ضمہ کے اشباع سے واؤ پیدا ہوتا ہے جو اخوک میں رفع کی علامت ہے۔ اور اسی طرح نصب میں \"رأیت زیداً أخاک\" اور خفض (جر) میں \"مررت بزید أخیک\"۔ اور اسی طرح \"رأیت أخاک زیداً\"۔ زید میں فتحہ نصب کی علامت ہے، اور اخاک میں الف جو خاء کے فتحہ سے پیدا ہوا ہے، نصب کی علامت ہے۔ اور اسی طرح \"مررت بأخیک زید\" میں زید میں کسرہ خفض کی علامت ہے، اور اخیک میں یاء خفض کی علامت ہے۔ پس یاء کو اس کے معلول کا حکم دیا گیا، لہٰذا ان حروف نے کلمہ کو معتل (علت والا) بنا دیا، پس ان کا حکم اپنے آباء (علتوں) کا حکم ہے۔\n\n### [ان حروف صغار کے لیے الٰہی اسماء اور کائنات میں ان کے اثرات]\n\n(یہ اشارہ ہے) اس کی طرف جو رفع ہے، اس کے لیے اسماء میں سے العلی (بلند) ہے، اور فتح کے لیے اسماء میں سے الرحمن (رحمٰن) ہے، جو اللہ لوگوں کے لیے رحمت کے دروازے کھولتا ہے، اور کسر (زیر) کے لیے اسماء میں سے المتعالی (بلند و بالا) ہے۔ اور کائنات میں ان اسماء الٰہیہ کے اثرات معلوم ہیں، جیسا کہ وہ حق (الحق) میں اپنی حدود کے ساتھ ممتاز ہیں، جن سے بعض دوسروں سے ممتاز ہوتے ہیں۔ اور ہم نے انہیں اس کتاب کے دوسرے باب میں بیان کیا ہے۔ اور ہم نے اس میں اعراب کی حرکات سے بناء کی حرکات، اور سكون حی (زندہ سکون) اور میت (مردہ سکون) کا مرتبہ، اور فعل کے پانچ امثلہ (یفعلان، تفعلان، یفعلون، تفعلون، اور تفعلین) میں اعراب کے حکم میں نون کو حروف علت (حروف العلة) کے ساتھ ملحق کرنے کو بیان کیا ہے، اور ان کا اثبات بھی اعراب ہے اور ان کا حذف بھی اعراب ہے، جو ان پر داخل ہونے والے عوامل کے مطابق ہوتا ہے۔\n\n### [اعمال کسب ہیں اور احوال عطیات]\n\nاور چونکہ معلول (المعلول) مرض سے متصف ہوتا ہے، اس لیے وہ مشقت اور کوشش والا ہوتا ہے، اس تکلیف کی وجہ سے جو اسے اس علت (العلة) سے پہنچتی ہے جو اس کے ساتھ قائم ہے، کیونکہ علت (علة) سے صرف معلول (معلول) ہی پیدا ہوتا ہے۔ اسی لیے ہم نے اسے باب مجاہدہ (المجاهدة) میں رکھا ہے، کیونکہ مجاہدہ مشقت اور تھکاوٹ ہے، اور اسی کی وجہ سے جہاد کو جہاد کہا جاتا ہے۔ اور اللہ کا دین آسانی ہے، اور اللہ کا قول سچ ہے جہاں اس نے فرمایا: **\"اور اس نے تم پر دین میں کوئی تنگی نہیں رکھی\"** (ما جَعَلَ عَلَيْكُمْ في الدِّينِ من حَرَجٍ) اور فرمایا: **\"اللہ تمہارے ساتھ آسانی چاہتا ہے اور تمہارے ساتھ تنگی نہیں چاہتا\"** (يُرِيدُ الله بِكُمُ الْيُسْرَ ولا يُرِيدُ بِكُمُ الْعُسْرَ)۔ اور اسی لیے ہم نے ترک جہاد کے لیے ایک باب رکھا ہے جو اس باب کے بعد ہے، اور وہ ستترواں باب ہے، مجاہدہ (المجاهدة) کو ترک کرنے کے بارے میں، نہ کہ عمل کو ترک کرنے کے بارے میں، کیونکہ مجاہدہ ایک وقت میں اعمال کی حالت ہے، اور احوال (روحانی کیفیات) عطیات (مواہب) ہیں اور اعمال کسب (مکاسب) ہیں۔ اور اسی لیے کسب کو عمل کی جگہ اور عمل کو کسب کی جگہ قائم کیا گیا، چنانچہ ایک آیت میں آیا: **\"اور ہر جان کو اس کا پورا بدلہ دیا جائے گا جو اس نے عمل کیا\"** (وتُوَفَّى كُلُّ نَفْسٍ ما عَمِلَتْ) اور ایک آیت میں: **\"جو اس نے کمایا\"** (ما كَسَبَتْ)۔ پس عمل کو کسب کہا گیا اور ان میں سے ہر ایک نے دوسرے کی جگہ لی۔ اور اسی لیے ہم نے کہا کہ اعمال کسب ہیں، اور بعض عامل ایسے ہوتے ہیں جن پر ان کے عمل میں مشقت ہوتی ہے، اور یہی مجاہدہ (المجاهدة) ہے، اور بعض ایسے ہوتے ہیں جو اسے نہیں پاتے، لہٰذا وہ صاحب مجاہدہ نہیں ہوتے۔ پس اگر عمل مشقت کا تقاضا کرتا تو یہ ہر عامل کی صفت ہوتی۔\n\n### [فصل: مجاہدین کے چار اصناف]\n\nجان لو، اللہ تمہاری مدد کرے، کہ مجاہدین (المجاهدين) کوشش، مشقت اور مکابدت (سخت محنت) والے ہیں، اور وہ چار اصناف ہیں۔ (پہلا صنف) مجاہدین جو کسی امر کے ساتھ مقید نہیں ہیں، اور وہ اللہ تعالیٰ کا یہ قول ہے: **\"اور اللہ نے مجاہدین کو بیٹھنے والوں پر فضیلت دی\"** (وفَضَّلَ الله الْمُجاهِدِينَ عَلَى الْقاعِدِينَ)۔ اور دوسرا صنف وہ مجاہدین ہیں جو \"فی سبیل اللہ\" (اللہ کی راہ میں) کی قید کے ساتھ ہیں، اور وہ اس کا قول ہے: **\"اور اللہ کی راہ میں جہاد کرنے والے\"** (والْمُجاهِدُونَ في سَبِيلِ الله)۔ اور تیسرا صنف وہ مجاہدین ہیں جو \"فیہ\" (اس میں) کی قید کے ساتھ ہیں، اور وہ اس کا قول ہے: **\"اور جن لوگوں نے ہمارے (فیْنا) لیے مجاہدہ کیا، ہم انہیں ضرور اپنی راہیں دکھائیں گے\"** (والَّذِينَ جاهَدُوا فِينا لَنَهْدِيَنَّهُمْ سُبُلَنا)۔ یعنی ہم ان کے لیے واضح کر دیں گے تاکہ وہ جان لیں کہ انہوں نے کس میں مجاہدہ کیا، پھر وہ اس وقت مجاہدہ کریں گے یا نہیں کریں گے۔ اور چوتھا صنف وہ مجاہدین ہیں جو \"فی اللہ حق جہادہ\" (اللہ میں اس کے جہاد کا حق ادا کرتے ہوئے) مجاہدہ کرتے ہیں، پس اس نے انہیں ان مجاہدین سے ممتاز کر دیا جو اس قید کے بغیر ہیں، جیسے وہ لوگ جو اللہ سے **\"اس کے تقویٰ کا حق ادا کرتے ہوئے\"** ڈرتے ہیں، اور کتاب کی **\"اس کی تلاوت کا حق ادا کرتے ہوئے\"** تلاوت کرتے ہیں۔ پس یہ جہاد میں چوتھا مرتبہ ہے۔\n\n### [جب تک تکلیف موجود ہے، مجاہدہ قائم ہے]\n\nاور یہ مجاہدہ (المجاهدة) ان مقامات میں سے ہے جو تکلیف (شرعی ذمہ داری) کے ساتھ لازم رہتے ہیں، پس جب تک تکلیف موجود ہے، مجاہدہ اپنی اصل کے ساتھ قائم ہے، اور جب تکلیف کا حکم زائل ہو جاتا ہے تو مجاہدہ بھی زائل ہو جاتا ہے۔ اور اسی لیے اللہ نے مکلفین (ذمہ دار بندوں) سے مباح (جائز) کی صنف کے ذریعے تخفیف کی، جب اس صورت (شکل) نے ان کی شفاعت کی جس پر وہ پیدا کیے گئے تھے، کیونکہ اس (صورت) پر کوئی پابندی نہیں ہے۔ پس جب اس (صورت) نے دیکھا کہ اس سے مشابہت رکھنے والے پر پابندی لگائی گئی ہے، تو اس نے اس کے حق میں پابندی اٹھانے کی درخواست کی، تو اسے کہا گیا کہ آخرت میں اس کے لیے وہی ہے جو اس کے لیے ہے۔ تو اس نے کہا: تو دنیا کی زندگی میں اس کے لیے کوئی حکم ہونا ضروری ہے تاکہ میرے لیے شفاعت قبول ہونے کی بشارت ہو، کیونکہ تو ہی فرمانے والا ہے: **\"ان کے لیے دنیا کی زندگی میں اور آخرت میں بشارت ہے\"** (لَهُمُ الْبُشْرى‏ في الْحَياةِ الدُّنْيا وفي الْآخِرَةِ)۔ کیونکہ یہ صورت میری سیر گاہ اور میری نظر کا مقام ہے، پس جب میں اس پر پابندی دیکھتی ہوں تو اس میں ٹوٹ پھوٹ دیکھتی ہوں، اور اس میں اپنی عنایت کا کوئی اثر نہیں دیکھتی، حالانکہ یہ میری صورت پر مخلوق ہے اور مجھ پر کوئی پابندی نہیں۔\n\n### [مباح، تکلیف اور مجاہدہ]\n\nپس اللہ نے دنیا میں اس کے لیے مباح (جائز) کو مشروع کیا، لہٰذا صورت الٰہیہ اس کی طرف صرف اسی وقت دیکھتی ہے جب وہ مباح میں تصرف کر رہا ہو، اور یہ دنیا میں نفس کے بلند ترین احوال میں سے ہے، کیونکہ یہ آخرت کی زندگی میں سے ہے جس میں کوئی پابندی نہیں۔ پس جب وہ مباح سے مکروہ (ناپسندیدہ) یا مندوب (مستحب) کی طرف منتقل ہوتا ہے تو صورت (الٰہیہ) مکلف سے تھوڑا سا منہ پھیر لیتی ہے اور کچھ التفات کے ساتھ ایک طرف ہو جاتی ہے۔ اور جب وہ محظور (حرام) یا واجب فعل کی طرف منتقل ہوتا ہے تو پردہ ڈال دیتی ہے اور اس مکلف سے مکمل طور پر اعراض کر لیتی ہے۔ پس جب اس (صورت) کے مکلف اور اس پر پابندی لگانے والے، یعنی اللہ تعالیٰ نے یہ دیکھا، تو اس نے اپنے اوپر وہ واجب کر لیا جو اس نے واجب کیا، جیسے اس کا قول: **\"تمہارے رب نے اپنے اوپر رحمت لکھ لی ہے\"** (كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ) اور **\"اور ہم پر مومنوں کی مدد کرنا حق ہے\"** (وكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ)۔ پس اس نے پردہ اٹھا دیا اور صورت (الٰہیہ) ہر ایک کی طرف احکام کی تمام حالتوں میں دیکھتی ہے۔\n\n### [اللہ پر وجوب اور معلومات سے علم الٰہی کا تعلق]\n\nپس اے ولی! دیکھو کہ اللہ کتنا مہربان اور اپنے بندوں پر کتنا شفیق ہے، جہاں اس نے وجوب کے حکم میں خود کو ان کے ساتھ شریک کر لیا، اور ان سے وجوب کو ساقط نہیں کیا، بلکہ خود کو ان کے ساتھ اس میں داخل کر لیا، کیونکہ وہ ابتداء میں اس سے متصف ہو چکے تھے۔ پس اگر وہ اسے ان سے ہٹا دیتا تو ان کے نزدیک خود کو ان کے ساتھ اس میں داخل کرنے کا مقام حاصل نہ ہوتا، یعنی ہم نے تمہیں وہی چکھایا جو ہم نے خود چکھا ہے۔ یہ حکم میں انتہائی لطف اور تنزل الٰہی ہے۔ جیسا کہ وہ ان کے ساتھ مستفاد (حاصل کیے گئے) علم میں نازل ہوا، کیونکہ ان کا علم مستفاد تھا، پس اس نے فرمایا: **\"اور ہم تمہیں ضرور آزمائیں گے یہاں تک کہ ہم جان لیں\"** (ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ) حالانکہ وہ العلیم (سب کچھ جاننے والا) ہے۔ پس اس نے انہیں انس دیا، اور اس میں ایمان کا ایک حکم ہے جس سے وہ شخص تقویت حاصل کرتا ہے جو ان لوگوں کی بات سنتا ہے جو اللہ کو نہیں جانتے، ان کا یہ قول کہ اللہ جزئیات کو نہیں جانتا، اگرچہ ان کا مقصد اس سے تنزیہ (پاکیزگی) تھا۔ اور یہ ایک ایسا مسئلہ ہے جس کا ادراک عقل سے ممکن نہیں جب تک کہ کشف (الکشف) کے ذریعے یہ معلوم نہ ہو جائے کہ علم الٰہی کا معلومات سے تعلق کس طرح ہے۔ اور یہ کہ حق (الحق) کے حق میں نہ کوئی ماضی ہے اور نہ کوئی مستقبل، اور اس کا آن (لمحہ) ہمیشہ سے ہے اور ہمیشہ رہے گا، اس کا آن اس صفت سے متصف نہیں ہوتا کہ وہ نہیں تھا پھر ہو گیا، اور نہ ہی ہونے کے بعد ختم ہونے سے۔ اور بسا اوقات اللہ یہ قوت اپنے بندوں میں سے جسے چاہتا ہے عطا کرتا ہے، اور اس کی ایک جھلک محمد صلی اللہ علیہ وسلم پر ظاہر ہوئی، جس سے آپ نے اولین و آخرین کا علم جان لیا۔ پس آپ نے ماضی اور مستقبل کو اسی آن (لمحے) میں جان لیا۔ اگر معلومات آپ کے لیے حضرۃ الآن (موجودہ لمحے کی موجودگی) میں حاضر نہ ہوتیں تو آپ ان کے علم سے متصف نہ ہوتے۔ پس اس سے معلوم ہوتا ہے کہ اللہ جزئیات کو صحیح علم کے ساتھ جانتا ہے، جس سے وہ شخص غافل رہا جس نے جناب حق (الحق) سے اس کی نفی کر کے تنزیہ کا ارادہ کیا۔\n\n### [مجاہدہ نفس کو مشقتوں پر لادنا ہے اور ریاضت اخلاق کی تہذیب ہے]\n\nپھر ہم واپس آتے ہیں اور کہتے ہیں کہ مجاہدہ (المجاهدة) نفس کو بدنی مشقتوں پر لادنا ہے جو مزاج میں کمزوری اور ضعف پیدا کرتی ہیں۔ جیسا کہ ریاضت (روحانی تربیت) نفسانی اخلاق کی تہذیب ہے، اسے عزت اور بدن سے باہر کی چیزوں میں اذیت برداشت کرنے پر مجبور کر کے، جس میں کوئی بدنی حرکت شامل نہ ہو۔ پھر یہ شرعاً محمود بدنی حرکات، ان میں سے کچھ مطلقاً فی سبیل اللہ (اللہ کی راہ میں) حرکات ہیں، اور یہ ہر مشروع نیکی کی راہ کی اقسام ہیں۔ پس ان میں سے کچھ وہ ہیں جن میں مشقت ہوتی ہے تو وہ مجاہدہ (المجاهدة) کہلاتے ہیں، اور کچھ وہ ہیں جن میں مشقت نہیں ہوتی تو ان سے اس نام کا حکم اٹھ جاتا ہے۔\n\n### [سب سے بڑی مشقت خالق کی راہ میں جانیں قربان کرنا ہے]\n\nاور یہ باب خاص طور پر اس چیز کے لیے ہے جس میں مشقت ہو، اور اسی لیے ہم نے اسے باب مجاہدہ (المجاهدة) کا نام دیا ہے۔ پس ہم نے سب سے بڑی مشقتوں پر غور کیا تو ہمیں اللہ کی راہ میں جانیں قربان کرنے سے بڑی کوئی مشقت نہیں ملی، اور یہی جہاد فی سبیل اللہ ہے۔ جسے اللہ نے اس کے مقتولین کو زندہ قرار دیا ہے جو رزق دیے جاتے ہیں، اور منع فرمایا کہ انہیں مردہ کہا جائے، اور اس شخص سے علم کی نفی کی جو انہیں مردوں کے ساتھ ملاتا ہے، کیونکہ وہ احساس سے جدائی اور سانسوں کے نہ ہونے کی ظاہری صورت میں شریک ہیں۔\n\n### [فقہاء اور عقلاء کے قیاس کا بطلان]\n\nاور یہ قیاس کے بطلان پر سب سے بڑی دلیلوں میں سے ہے، کیونکہ مجاہدین مقتولین فی سبیل اللہ کی موت کا عقیدہ رکھنے والوں نے اسے غیر سبیل اللہ میں مقتول پر قیاس کرتے ہوئے مانا، اس علت جامعہ کی بنا پر کہ انہوں نے ہر مقتول کو ایک ہی صورت پر دیکھا کہ ان میں سانسیں اور حیوانی حرکات نہیں ہیں، اور وہ ان افعال سے رکاوٹ نہیں ڈالتے جو ان کے ساتھ کیے جاتے ہیں، جیسے اعضاء کا کاٹا جانا، کھالوں کا پھاڑا جانا، درندوں اور شکاری پرندوں کا انہیں کھانا، اور ان کے جسموں کا کیڑے اور بوسیدگی میں بدل جانا۔ پس انہوں نے قیاس کیا اور غلطی کی۔ اور یہ قیاس، اس سے زیادہ واضح یا علت کے وجود میں اس سے زیادہ مدلل کوئی قیاس نہیں ہے، اس کے باوجود اللہ نے انہیں جھٹلایا اور ان سے فرمایا کہ میری راہ میں مقتول کا معاملہ غیر میری راہ میں مقتول جیسا نہیں ہے۔ **\"اور جو لوگ اللہ کی راہ میں مارے گئے ہیں، انہیں ہرگز مردہ نہ سمجھو، بلکہ وہ زندہ ہیں، اپنے رب کے پاس رزق دیے جاتے ہیں، خوش ہیں\"** (ولا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ الله أَمْواتاً بَلْ أَحْياءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ فَرِحِينَ)۔ پس اس نے ان سے فرمایا کہ وہ حکم جو تم نے لگایا ہے وہ علم نہیں ہے، اور جب وہ علم نہیں تو صحیح نہیں، اور جب وہ صحیح نہیں تو اس کے مطابق حکم لگانا جائز نہیں، جبکہ ہمیں اللہ کی خبروں سے معلوم ہے کہ وہ صحیح نہیں ہے۔ پھر فرمایا: **\"اور جو اللہ کی راہ میں مارے جائیں انہیں مردہ نہ کہو، بلکہ وہ زندہ ہیں، لیکن تم شعور نہیں رکھتے\"** (ولا تَقُولُوا لِمَنْ يُقْتَلُ في سَبِيلِ الله أَمْواتٌ بَلْ أَحْياءٌ ولكِنْ لا تَشْعُرُونَ)۔ پس اس نے ان سے اس علم کی نفی کر دی جو قیاس نے انہیں دیا تھا۔ پس جب اس قیاس کا حکم، اس کی وضاحت، اس میں شک نہ ہونے، اس کے اسباب کی فراوانی اور اس کی اور دوسرے مقتولوں کے درمیان جامع علتوں کے ظاہر ہونے کے باوجود، اللہ کی خبروں سے باطل ہے، تو تمہارا کیا خیال ہے فقہاء کے قیاس کے بارے میں جو وہ نئے مسائل میں کرتے ہیں، اور عقلاء کے قیاس کے بارے میں جو وہ اللہ کی معرفت میں شاہد (حاضر) کے حکم کو غائب پر لگاتے ہیں؟ بہت دور! اللہ نے سچ فرمایا اور اللہ پر قیاس کرنے والوں نے جھوٹ کہا۔ اور اللہ اس سے مشابہ نہیں ہے جس کے **\"جیسا کوئی شے نہیں\"** (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ) اس کی مثال کی چیزوں میں سے۔\n\n### [مجاہدین فی سبیل اللہ اور نفوس کی دو اقسام]\n\nچونکہ جانیں قربان کرنا نفوس پر سب سے بڑی مشقت ہے، اس لیے اسے جہاد کہا گیا، کیونکہ نفوس دو طرح کے ہیں۔ ایک نفس جو دنیاوی زندگی میں اس سے مانوس ہونے کی وجہ سے رغبت رکھتا ہے، پس وہ جدائی نہیں چاہتا اور یہ اس پر شاق گزرتی ہے۔ اور دوسرا نفس جو دنیاوی زندگی میں رغبت رکھتا ہے تاکہ اس کے ذریعے اطاعت، قربت بخشنے والے افعال، معرفت الٰہیہ (المعرفۃ الإلهیۃ) اور سانسوں کے ساتھ دائمی ترقی میں اضافہ کرے، پس اس پر دنیاوی زندگی سے جدائی شاق گزرتی ہے۔ اسی لیے دونوں گروہوں کے حق میں اسے جہاد کہا گیا۔ بہرحال مجاہدین فی سبیل اللہ (اللہ کی راہ میں) وہ راستہ ہے جو اللہ تک پہنچاتا ہے، یعنی اس تک پہنچنا اس حیثیت سے کہ وہ الٰہ ہے۔ پس یہ اس مرتبے کی معرفت (المعرفۃ) حاصل کرنے کے لیے جہاد ہے جس سے عالم اور اس کے احکام ظاہر ہوئے، اور جس سے زمین میں خلفاء (نائب) ہوتے ہیں۔ پس ان راہوں میں انہیں وہ مشقت پہنچتی ہے جو ایک مسافر کو اپنے خوفناک راستے میں پہنچتی ہے، کیونکہ وہ ایک ایسے راستے پر ہے جس میں چلنے سے وہ اپنے مال اور جان کو تلف کرنے، اپنے بچوں کو یتیم کرنے اور اپنی مانوس چیزوں کو کھونے کے لیے پیش کرتا ہے۔ اللہ تعالیٰ نے فرمایا: **\"اور انہوں نے اپنے مالوں اور اپنی جانوں کے ساتھ اللہ کی راہ میں جہاد کیا\"** (وجاهَدُوا بِأَمْوالِهِمْ وأَنْفُسِهِمْ في سَبِيلِ الله) اور فرمایا: **\"وہ اللہ کی راہ میں لڑتے ہیں، پس وہ قتل کرتے ہیں اور قتل کیے جاتے ہیں\"** (يُقاتِلُونَ في سَبِيلِ الله فَيَقْتُلُونَ ويُقْتَلُونَ)۔\n\n### [اللہ نے مومنوں سے ان کی جانیں اور مال خرید لیے]\n\nاور جب اللہ نے بندوں سے یہ جان لیا کہ یہ چیز ان پر گراں گزرتی ہے، کیونکہ وہ دعویٰ کرتے ہیں کہ ان کی جانیں اور مال ان کے ہیں، جیسا کہ حق (الحق) نے ان کے لیے انہیں ثابت کیا ہے، اور اللہ حق کے سوا کچھ نہیں کہتا۔ پس اس نے ان سے مال اور جانیں خریدنے کو مقدم کیا تاکہ وہ ان سے اپنا ہاتھ اٹھا لیں، پس خریدار اپنی چیز میں جیسے چاہے تصرف کرے۔ اور بیچنے والا اگرچہ اپنی چیز سے محبت رکھتا ہو، لیکن جو عوض اسے اس کے بدلے میں دیا گیا ہے، یعنی قیمت، وہ اسے اس چیز سے زیادہ محبوب ہے جو اس نے بیچی ہے۔ پس اس نے فرمایا: **\"بے شک اللہ نے مومنوں سے ان کی جانیں اور ان کے مال خرید لیے ہیں\"** (إِنَّ الله اشْتَرى‏ من الْمُؤْمِنِينَ أَنْفُسَهُمْ وأَمْوالَهُمْ)۔ اور اس خرید و فروخت کے بعد حکم دیا کہ ان کے ذریعے اللہ کی راہ میں جہاد کیا جائے تاکہ یہ ان پر آسان ہو جائے، پس وہ عاریتاً لی گئی جانوں کے ساتھ جہاد کرتے ہیں، میرا مطلب ہے وہ حیوانی نفوس جو اجسام کے ساتھ قائم ہیں، اور مال بھی عاریتاً ہیں۔\n\n### [انسان شفقت طبعی پر پیدا کیا گیا ہے]\n\nپس وہ اس شخص کی طرح ہیں جو عاریتاً لیے گئے جانور اور دوسرے کے مال پر سفر کر رہا ہو، اور اس کے مالک نے اسے عاریت دیتے وقت اس سے حرج اٹھا لیا ہو کہ اگر جانور مر جائے اور مال ہلاک ہو جائے تو وہ دل کا مطمئن ہے۔ پس اگر وہ مومن ہے تو اس پر کوئی نفسانی مشقت باقی نہیں رہتی، سوائے اس مشقت کے جو یہ حیوانی مرکب (جسم) طویل مسافت اور راستے کی تھکاوٹ سے برداشت کرتا ہے۔ اور اگر وہ دشمن سے لڑائی میں ہو تو وہ اس مشقت کو برداشت کرتا ہے جو حملے، پسپائی، نیزوں سے وار، تیروں کی بارش اور تلواروں کے ضرب سے حاصل ہوتی ہے۔ اور انسان شفقت طبعی پر پیدا کیا گیا ہے، پس وہ اپنے مرکب (جسم) پر اس حیثیت سے شفقت کرتا ہے کہ وہ ایک حیوان ہے، نہ کہ اس کے مالک کی طرف سے، کیونکہ اس کا مالک (اللہ) اس عاریت لینے والے سے جانتا ہے کہ وہ اسے تلف کرنا چاہتا ہے، پس یہ اس کے لیے محبوب ہے، لہٰذا اس پر صرف شفقت طبعی ہی باقی رہتی ہے۔\n\n### [وہ نفوس جو حق نے خریدے اور وہ نفوس جو اس کے لیے بیچے گئے]\n\nپس وہ نفوس جنہیں حق (الحق) نے اس آیت میں خریدا ہے، وہ درحقیقت حیوانی نفوس ہیں، جنہیں اس نے ناطق (بولنے والے) مومن نفوس سے خریدا ہے۔ پس مومنوں کے ناطق نفوس ہی بیچنے والے ہیں جو ان حیوانی نفوس کے مالک ہیں جنہیں حق نے ان سے خریدا، کیونکہ یہی وہ ہیں جن پر قتل واقع ہوتا ہے، اور یہ نفوس ایمان کا محل نہیں ہیں۔ بلکہ ایمان سے متصف ناطق نفوس ہیں، اور انہی سے حق (الحق) نے اجسام کے نفوس خریدے، پس فرمایا: **\"مومنوں سے خرید لیا\"**، اور وہ ناطق نفوس ہیں جو ایمان سے متصف ہیں، ان کی جانیں (أنفسهم) جو ان کے حسی مرکب ہیں، اور جو ان کے ذریعے قتال اور جہاد کے لیے نکلتے ہیں۔ پس مومن کے لیے (حیوانی) نفس نہیں ہے، لہٰذا اس پر شفقت میں اس کے لیے صرف وہی ذاتی شفقت ہے جو ناطق نفس میں ہر حیوان پر ہوتی ہے۔\n\n### [اللہ کے ساتھ مجاہدہ کرنے والے جہاد عام کے مالک ہیں]\n\nاور وہ مجاہدین جنہیں اللہ نے کسی خاص صفت سے مقید نہیں کیا، نہ فی سبیل اللہ (اللہ کی راہ میں)، نہ فیہ (اس میں)، اور نہ ہی حق جہاد کے ساتھ، وہ مجاہدون باللہ (اللہ کے ساتھ مجاہدہ کرنے والے) ہیں، جس کی صفت میں قید نہیں ہے۔ پس اس کا جہاد ہر چیز میں ہے، اور وہ جہاد عام ہے، اور اس کی طرف جہاد کی نسبت اس میں ہے جو مشقت ہے، کیونکہ اس نے اسے مجاہد کہا اور یہ قید نہیں لگائی کہ وہ کس چیز میں مجاہدہ کرتا ہے۔ پس یہ اشیاء میں قضا و قدر کا حکم ہے۔ جس سے مقضی علیہ (جس پر فیصلہ ہوا) پر اس فیصلے کی وجہ سے جو اس پر کیا گیا، دوبارہ پلٹنا حاصل ہوتا ہے، اور حق (الحق) اس بندے کے ساتھ اپنی عنایت کی وجہ سے اس کی برائی نہیں چاہتا۔ پس اس مقام پر اس نے فرمایا: **\"میں نے کسی چیز میں جو میں کرنے والا ہوں، اتنا تردد نہیں کیا جتنا اپنے مومن بندے کی روح قبض کرنے میں کرتا ہوں، وہ موت کو ناپسند کرتا ہے اور میں اس کی برائی کو ناپسند کرتا ہوں، حالانکہ اسے مجھ سے ملنا ضروری ہے\"**۔ وہ فرماتا ہے کہ اس کے لیے موت ضروری ہے کیونکہ علم میں یہ بات پہلے سے موجود ہے، پس وہ اسے مطلق مجاہدہ سے قبض کرتا ہے جو نہ کسی اذیت سے مقید ہے اور نہ کسی اور چیز سے۔ لیکن اللہ تعالیٰ کا تردد کے ذریعے متنبہ کرنا مجاہدہ کے حکم کے مناسب حکم کی دلیل ہے، کیونکہ وہ اسے صرف اس لیے لایا تاکہ ہم اس امر کے علم کو اس کی اصل حالت پر مقید کر لیں۔ کیونکہ وہ سبحانہ و تعالیٰ اپنے بندوں کو علم سکھانے والا ہے، اور وہ اس کا قول ہے: **\"اور وہ لوگ جنہوں نے علم دیا گیا، انہوں نے کہا\"** (وقالَ الَّذِينَ أُوتُوا الْعِلْمَ)۔ اور وہی ہے جس نے انہیں اپنے اسم الرحمن (الرحمن) سے علم عطا کیا، جس کے بارے میں اس نے فرمایا: **\"اس نے انسان کو وہ سکھایا جو وہ نہیں جانتا تھا\"** (عَلَّمَ الْإِنْسانَ ما لَمْ يَعْلَمْ)۔\n\n### [وہ مجاہدین جو مقید نہیں ہوتے، وہ متردد ہوتے ہیں]\n\nپس بندوں میں سے وہ مجاہدین جو مقید نہیں ہوتے جیسا کہ اللہ نے انہیں مطلق رکھا ہے، وہ ان افعال میں متردد ہوتے ہیں جن کے اعیان ان میں صادر ہوتے ہیں۔ کیا وہ انہیں اللہ کی طرف منسوب کریں؟ تو ان میں وہ بھی ہیں جنہیں ادب کے طور پر اس کی طرف منسوب نہیں کرنا چاہیے، اور حق (الحق) نے ان سے براءت (علیحدگی) ظاہر کی، جیسا کہ اس نے فرمایا: **\"اللہ کی طرف سے براءت ہے\"** (بَراءَةٌ من الله)۔ یا وہ انہیں اپنی طرف منسوب کریں؟ تو ان میں وہ بھی ہیں جنہیں اللہ کے ساتھ ادب اور حقیقی نسبت کے طور پر اللہ کی طرف منسوب کرنا چاہیے۔ اور انہوں نے دیکھا کہ اللہ فرماتا ہے: **\"اور جب تم نے پھینکا تو تم نے نہیں پھینکا\"** (وما رَمَيْتَ إِذْ رَمَيْتَ)۔ پس اس نے نفی کی اور پھر اسی چیز کو ثابت کیا جس کی نفی کی تھی، پھر فرمایا: **\"لیکن اللہ نے پھینکا\"** (ولكِنَّ الله رَمى‏)۔ پس اس نے اثبات کو دو نفیوں کے درمیان رکھا، لہٰذا یہ اثبات سے زیادہ قوی تھا، کیونکہ اس (اللہ) کو مثبت (ثابت شدہ چیز) پر احاطہ حاصل ہے۔ پھر اسی آیت میں فرمایا: **\"اور تاکہ وہ مومنوں کو اچھی آزمائش میں ڈالے\"** (ولِيُبْلِيَ الْمُؤْمِنِينَ)۔ پس ہم نے جانا کہ اللہ نے مومنوں کو حیرت میں ڈالا، اور یہی اس کی آزمائش ہے جو اس نے پھینکنے کی نفی اور اس کے اثبات کے ذریعے ذکر کیا۔ اور اس نے اسے بلاء حسن (اچھی آزمائش) قرار دیا، یعنی اگر بندہ اس کی نفی کرے تو درست ہے، اور اگر اسے اپنے لیے ثابت کرے تو بھی درست ہے۔ اور اب صرف یہ باقی ہے کہ بندے کے لیے کون سی دو درستیوں میں سے زیادہ بہتر ہے، اگرچہ سب کچھ اچھا ہے۔ اور یہی حیرت کا مقام ہے۔ اور اسی لیے اس نے اسے بلاء (آزمائش) کہا، یعنی امتحان کا مقام۔ پس جس نے حق (الحق) کو پا لیا، اور وہ اللہ کا ارادہ ہے کہ دونوں درستیوں میں سے یا دونوں حکموں میں سے کون سا حکم (نفی کا حکم یا اثبات کا حکم) وہ چاہتا ہے، تو وہ اللہ کے نزدیک اس شخص سے زیادہ عظیم ہوگا جو اسے نہیں پاتا۔ پس یہی وہ مجاہدین ہیں جنہیں اللہ نے بیٹھنے والوں پر عظیم اجر کے ساتھ فضیلت دی، اور جسے اللہ عظیم قرار دے اس کی قدر کا اندازہ نہیں لگایا جا سکتا۔ یہ اس کے درجات ہیں، اور اس نے انہیں ایک درجہ نہیں بنایا، جیسا کہ اس نے مجاہدین فی سبیل اللہ کے بارے میں فرمایا، جہاں اس نے ان کے لیے ایک درجہ مقرر کیا، پھر آیت کے آخر میں جو کچھ ذکر کیا اس سے انہیں مزید بڑھا دیا۔\n\n### [وہ مجاہدین جو اللہ میں اس کے جہاد کا حق ادا کرتے ہیں]\n\nیہ دو اصناف ہیں جن کا ہم ذکر کر چکے ہیں۔ اور تیسرا صنف وہ ہے جن کے بارے میں اللہ نے فرمایا: **\"جنہوں نے اللہ میں اس کے جہاد کا حق ادا کیا\"** (جاهدوا في الله حَقَّ جِهادِهِ)۔ پس \"جہادہ\" (اس کا جہاد) میں ضمیر (ھ) اللہ کی طرف لوٹتی ہے، یعنی وہ جہاد سے متصف ہوتے ہیں، یعنی حق (الحق) کی صفت کے طور پر اس کے جہاد کی حالت میں۔ جیسا کہ ہم نے تردد الٰہی میں ذکر کیا، یعنی وہ اللہ کے سوا کسی کو مجاہد نہیں دیکھتے، اور یہ اس لیے کہ جہاد اس (اللہ) میں واقع ہوا، اور اللہ میں جہاد کی کیفیت کو اللہ کے سوا کوئی نہیں جانتا۔ پس جب انہوں نے اسے اللہ کی طرف لوٹا دیا، اور یہی اس کا قول ہے: **\"اس کے جہاد کا حق\"** (حَقَّ جِهادِهِ)، تو ضمیر کی اضافت کے ذریعے جہاد کی نسبت اس کی طرف کی گئی، پس مجاہد وہ (اللہ) تھا نہ کہ وہ (بندے)، اگرچہ وہ آثار کے ظہور کا محل تھے، پس وہ مجاہدون (محل جہاد) ہیں، نہ کہ مجاہدین (جہاد کرنے والے)۔ اللہ نے موسیٰ علیہ السلام سے فرمایا: \"اے موسیٰ! میرا شکر ادا کر جیسا کہ شکر کا حق ہے\"۔ انہوں نے عرض کیا: \"اے رب! اس کی قدرت کون رکھتا ہے؟\" فرمایا: \"جب تو نعمت کو میری طرف سے دیکھے تو تو نے میرا شکر ادا کر دیا جیسا کہ شکر کا حق ہے\"۔ اور یہ حدیث ابن ماجہ نے اپنی سنن میں روایت کی ہے۔\n\n### [ذوق، کشف اور مشاہدہ سے اللہ کی طرف منسوب عمل]\n\nپس ہر وہ عمل جسے تم نے ذوق، کشف (الکشف) اور مشاہدہ (الشہود) سے اللہ کی طرف منسوب کیا، نہ کہ محض اعتقاد اور حال (کیفیت) سے، بلکہ مقام اور صحیح علم سے، تو تم نے اس عمل کا حق ادا کر دیا، کیونکہ تم نے اسے اس سے دیکھا جس کا وہ ہے۔ پس جب بھی تمہارے لیے ایسا واقع ہو، تو اس کی شرح وہی ہے جو اللہ نے اپنے رسول کی زبان پر بیان کی اور ہم تک پہنچائی، اور یہ اللہ تک پہنچانے والا آسان، نرم، قریب الوصول اور سیدھا راستہ ہے، **\"جس میں تم کوئی کجی اور بلندی نہیں دیکھو گے\"** (لا تَرى‏ فِيها عِوَجاً ولا أَمْتاً)۔\n\n### [اور جن لوگوں نے ہمارے لیے مجاہدہ کیا، ہم انہیں اپنی راہیں دکھائیں گے]\n\nاور چوتھا صنف وہ ہے جن کے بارے میں اللہ نے فرمایا: **\"اور جن لوگوں نے ہمارے (فیْنا) لیے مجاہدہ کیا، ہم انہیں ضرور اپنی راہیں دکھائیں گے\"** (والَّذِينَ جاهَدُوا فِينا لَنَهْدِيَنَّهُمْ سُبُلَنا)۔ جن کے بارے میں ہم نے ان سے کہا: **\"اور (دوسری) راہوں کی پیروی نہ کرو، ورنہ وہ تمہیں اس کی راہ سے جدا کر دیں گی\"** (ولا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ)۔ یعنی وہ راہ جس میں تمہارے لیے سعادت ہے، ورنہ تمام راہیں اسی کی طرف جاتی ہیں، کیونکہ اللہ ہر راہ کی انتہا ہے، پس **\"تمام معاملات اسی کی طرف لوٹائے جاتے ہیں\"** (إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)۔ لیکن ہر وہ شخص جو اس کی طرف لوٹا وہ سعادت مند نہیں ہوا، پس سعادت کی راہ صرف وہی ہے جو مشروع ہے، اور تمام راہیں، ان سب کی انتہا پہلے اللہ کی طرف ہے، پھر آخر میں رحمن (الرحمن) ان کی ذمہ داری لیتا ہے، یا ان میں رحمن کا حکم اس ابد تک باقی رہتا ہے جس کی بقا کی کوئی انتہا نہیں۔ اور یہ ایک عجیب مسئلہ ہے، اس کا کشف (الکشف) کرنے والے کم ہیں اور اس پر ایمان لانے والے اس سے بھی کم ہیں۔ اور چونکہ جہاد کا سبب وہ افعال تھے جو ان لوگوں سے صادر ہوتے تھے جن سے ہمیں قتال اور جہاد کا حکم دیا گیا، اور وہ افعال اللہ کے افعال ہیں، پس ہم نے صرف اسی (اللہ) میں جہاد کیا، نہ کہ دشمن میں۔ اور چونکہ ان افعال کے بغیر کوئی دشمن نہیں تھا، پس جب ہم نے اس میں مجاہدہ کیا اور اس کے قول سے ہمارے لیے واضح ہو گیا کہ جب ہم اس میں مجاہدہ کرتے ہیں تو وہ ہمیں اپنی راہیں دکھاتا ہے، یعنی وہ ہمیں ان کی راہیں واضح کرتا ہے، پس ہم ان میں داخل ہوتے ہیں تو مجاہدہ کرتے وقت کسی غیر کو نہیں دیکھتے، پس ہم نے اللہ سے استغفار کیا اس چیز پر جو ہم سے واقع ہوئی۔ اور ان راہوں میں سے یہ تھا کہ ہم نے مشاہدہ (الشہود) کیا کہ جو کچھ ہم سے واقع ہوا، وہ (اللہ) ہی اسے واقع کرنے والا ہے نہ کہ ہم، پس ہم نے اللہ سے استغفار کیا، یعنی ہم نے اس سے درخواست کی کہ ہم ایسے عمل کے ظہور کا محل نہ بنیں جسے اس نے خود ناپسندیدگی سے متصف کیا ہے۔ پس یہ ثابت ہو گیا کہ وجود (الوجود) میں اللہ کے سوا کوئی نہیں، پس اس میں اس کے سوا کسی نے مجاہدہ نہیں کیا۔ اور اگر وہ ہمیں اپنی راہیں نہ دکھاتا تو ہم یہ نہ جان پاتے۔ اور اسی لیے اس نے آیت کو اپنے اس قول سے مکمل کیا: **\"اور بے شک اللہ احسان کرنے والوں کے ساتھ ہے\"** (وإِنَّ الله لَمَعَ الْمُحْسِنِينَ)۔ اور احسان یہ ہے کہ تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو۔ پس جب تم اسے دیکھو گے تو جان لو گے کہ جہاد درحقیقت اسی کی طرف سے تھا اور اسی میں تھا۔\n\n### [کتاب الٰہی اور کتابت الٰہیہ]\n\nپس یہ میں نے تمہارے لیے اہل مجاہدات (المجاهدات) کے احوال بیان کر دیے، اور وہ مجاہدین (المجاهدون) ہیں۔ اس باب کی تفصیلات میں کلام طویل ہو جاتا ہے اور کتاب بڑی ہے۔ اگر ہم ہر باب کے تقاضے کے مطابق تمام مواد کو مکمل طور پر بیان کریں تو عمر اس کی کتابت کے لیے کافی نہیں ہوگی۔ لہٰذا جب اختصار ضروری ہے تو ہم ہر باب میں صرف ان چیزوں پر اکتفا کریں گے جو امہات (بنیادی اصولوں) کے طور پر جاری ہیں۔ اور ہر ام (اصل) حوا کی طرح ہے بنی آدم کے ساتھ، کیونکہ وہ سب ان کی اولاد ہیں۔ اگر اللہ ہمیں کتابت الٰہیہ (الکتابۃ الإلهیۃ) عطا کرتا تو ہم اس کتاب کے تمام مندرجات کو مکمل طور پر ایک چھوٹے سے ورق میں ظاہر کر دیتے۔ جیسا کہ رسول اللہ صلی اللہ علیہ وسلم اپنے ہاتھ میں دو کتابیں لے کر نکلے تھے، جو کتاب الٰہی (الکتاب الإلهي) تھی جس میں کسی مخلوق کا عمل دخل نہیں تھا، اور آپ نے خبر دی کہ جو کتاب آپ کے دائیں ہاتھ میں ہے اس میں اہل جنت کے نام، ان کے آباؤ اجداد، ان کے قبیلوں اور ان کے خاندانوں کے نام ان کی تخلیق کے آغاز سے لے کر قیامت تک درج ہیں۔ اور دوسری کتاب بھی اسی طرح اہل شقاوت (بدبختی) کے ناموں پر مشتمل تھی۔ اور اگر یہ معمول کی کتابت ہوتی تو اس کا ورق مدینہ کو بھی کافی نہ ہوتا۔ پس اگر ایسا ہمارے لیے واقع ہوتا تو ہم اسے ایک لمحے میں ظاہر کر دیتے، اور ہم نے وہ کتابت دیکھی ہے، اور وہ دیوار پر جنت اور جہنم کی طرح ہے، اور آئینے میں آسمان کی تصویر کی طرح ہے۔\n\n### [مجاہدہ میں اہل اللہ کے درجات]\n\nپس ہم اس صفت، یعنی مجاہدہ (المجاهدة) کے ان مقامات کا ذکر کریں گے جو اس کے مراتب اور منازل ہیں جن میں اس کے اہل اترتے ہیں۔ اور وہ ملامیہ (الملامية) ہیں، اور وہ دو قسم کے ہیں: اہل ادب جو حد پر ٹھہرنے والے ہیں، اور اہل انس و وصال (الأنس والوصال)۔ اسی طرح عارفین (العارفون) کے لیے بھی اس باب میں دو قسمیں ہیں: اہل ادب اور حد پر ٹھہرنے والے، اور اہل انس و وصال۔ اور یہ ہر مقام میں جاری ہے۔ پس ملامیہ (الملامية) کے لیے اس صنف میں جو حدود پر ٹھہرنے کا ادب رکھتا ہے، تریپن (۵۳) درجات ہیں۔ اور ہم نے درجات کے ذکر کی طرف اس لیے رجوع کیا کیونکہ ہم نے اللہ کو ان کی فضیلت میں درجات کے ساتھ فرماتے ہوئے سنا، پس ہم نے اللہ کے قول کی پیروی کی، اور یہی ہمارے لیے زیادہ بہتر ہے۔ اور ملامیہ (الملامية) اہل انس و وصال (الأنس والوصال) کے لیے اس باب میں چار سو تریپن (۴۵۳) درجات ہیں۔ اور عارفین (العارفون) اہل انس و وصال کے درجات چار سو چوراسی (۴۸۴) درجات ہیں۔ اور عارفین (العارفون) میں سے اہل ادب اور حدود پر ٹھہرنے والوں کے لیے نواسی (۸۹) درجات ہیں، یعنی نوے سے ایک کم، اور ان کے اور اسماء الٰہیہ کے درجات کے درمیان دس کا فرق ہے۔",
    "fa": "باب هفتاد و ششم در مجاهده (المجاهدة)\n\nپروردگارت را بامدادان و شامگاهان تسبیح گوی *** زیرا نعل (پای) با هدایت، به تاج تبدیل می‌شود.\n\nبا هوای نفس خود مجاهده کن و سست مباش *** و برای مصیبت‌ها دوست و همراه باش.\n\nهمانا مجاهده‌کننده پیوسته در رنج و سختی است *** بلاها را دوست می‌دارد و عاشق توجیه (الهی) است.\n\nهرگز به بیکاری تکیه مکن که هلاکت‌آور است *** و برای رویدادها (و حوادث) پیوسته در حال رسیدن باش.\n\n### [حروف علت (حروف العلة) و چهار صنف از اولیا]\n\nبدانید، خداوند شما را توفیق دهد، هنگامی که شروع به سخن گفتن در این باب کردم، بشارتی به من نشان داده شد که در آن دانستم که ناگزیر امری الهی و عارضی بر مردم نازل خواهد شد که در آن نیازمند تحمل مشقت و جهد نفسانی و حسی هستند. و به من گفته شد: در هیچ بابی غفلت مکن که حروف صغار (حروف کوچک) را در آن بگنجانی و بیان کنی که با اشباع (سیر کردن) آن‌ها، سه حرفی که حروف علت (حروف العلة) هستند، پدید می‌آیند؛ و آن‌ها حروف مد و لین هستند که حروف مرکب از علت (علة) و معلول (معلول) می‌باشند. و سخن و اشاره تو در آن‌ها باید به چهار صنف باشد: عارفانی که دارای عارفه‌های الهی وجودی جودی (العوارف الإلهية الوجودية الجودية) در معرفت خود هستند؛ و اهل مواقف (أهل المواقف) در مرزهای الهی، برای دریافت ادب میان هر دو مقام هنگام انتقال در حالی که نه به مقام اول و نه به مقام دوم متصف می‌شوند، و اینان اهل برزخ (أهل البرازخ) هستند؛ و همچنین اهل وصال (الوصال) و انس (الأنس) که باید درجات آن‌ها را در هر مقام مشخص کنی، همان‌گونه که درجات اهل مواقف را بیان می‌کنی تا بر سالک مشتبه نشود. و همچنین کسانی که احوالشان انکار شده است، یعنی ملامیه (الملامية) که شناخته می‌شوند اما شناخته نمی‌شوند؛ آن‌ها را از اهل عارفه‌های معارف متمایز کن و کمالی را که دارند آشکار ساز، و آن‌ها علمای بالله هستند. پس این چهار صنف باید احوالشان در هر مقام جاری شود: عارفان، ملامیه، اهل انس و وصال، و اصحاب مواقف و قول که همان ادباء هستند. زیرا تو مأمور به نصیحت بندگان خدا به امر خدا هستی، و دین، نصیحت برای خدا، رسول او، پیشوایان مسلمانان و عموم آن‌هاست. هنگامی که وارد برزخ در واقعه به پایان رسید، از خواب برخاستیم و از خداوند متعال عصمت در قول، عمل و حال را درخواست کردیم. و در این واقعه، صاحب ما تاج‌الدین عباس بن عمر السراج را همراه خود می‌دیدم، و او کسی بود که مرا از جانب حق تعالی بر سخن گفتن درباره حروف صغار که حروف علل سه‌گانه از آن‌ها متولد می‌شوند، آگاه می‌ساخت. پس ابتدا باید بیان کنیم که منظور از حروف صغار چیست و مراتب فرزندان آن‌ها که حروف علل هستند کدامند، اگرچه ما آن‌ها را در باب دوم، باب حروف، از این کتاب ذکر کرده‌ایم، اما به دلیل این واقعه، ذکر مختصری از آن‌ها در اینجا ضروری است.\n\n### (فصل) [حروف صغار و مراتب فرزندان آن‌ها]\n\nبدان که منظور از حروف صغار، حرکات سه‌گانه هستند: ضمه، فتحه و کسره. و این حروف دو حالت دارند: حالت اشباع (سیر شدن) و حالت غیر اشباع. اگر یکی از آن‌ها به اشباع متصف شود، علت (علة) وجود معلولی (معلول) متناسب با خود خواهد بود. اگر ضمه اشباع شود، واو معلول (الواو المعلولة) از آن پدید می‌آید، و اگر فتحه باشد، الف از آن پدید می‌آید، و اگر کسره باشد، یاء معلول (الياء المعلولة) از آن پدید می‌آید. و ما واو و یاء را به علت (علة) مقید کردیم، زیرا ممکن است در مقام صحت یافت شوند در حالی که به علیت (العلية) موصوف نباشند، اما الف هرگز یافت نمی‌شود مگر معلول (معلولة) باشد، و به همین دلیل، ماقبل آن همیشه فقط مفتوح است.\n\n### [حروف علت (حروف العلة) در حکم بر صورت علل خود خارج شدند]\n\nپس این‌ها حروف علت (حروف العلة) نامیده می‌شوند، یعنی معلول (معلولة) از این علل (علل) موجود شده‌اند، و در حکم بر صورت علل خود خارج شدند. پس کلمات با آن‌ها اعراب داده شدند، همان‌گونه که با عللشان اعراب داده شدند. می‌گویی: «زید أخوک» (زید برادر توست)، علامت رفع در «زید»، ضمه دال است، و از اشباع ضمه در «أخوک»، واو علامت رفع در «أخوک» می‌شود. و همچنین در نصب: «رأيت زيدا أخاك» (زید برادرت را دیدم)، و در خفض: «مررت بزيد أخيك» (از زید برادرت گذشتم). و همچنین «رأيت أخاك زيدا»، فتحه در «زید» علامت نصب است و الف در «أخاک» که از فتحه خاء متولد شده، علامت نصب است. و همچنین «مررت بأخيك زيد»، کسره در «زید» علامت خفض است و یاء در «أخیک» علامت خفض است. پس یاء حکم معلول خود را گرفت و این حروف کلمه را معلول ساختند، پس حکم پدران خود را دارند.\n\n### [اسماء الهی که برای این حروف صغار هستند و آثار آن‌ها در کون]\n\n[اشاره به] آنکه رفع (الرفع) برای اوست، از اسماء، العلی (العلى) است؛ و فتح (الفتح) برای اوست، از اسماء، الرحمن (الرحمن) است، آنجا که می‌فرماید: **«ما يَفْتَحِ اللَّهُ لِلنَّاسِ مِنْ رَحْمَةٍ»** (آنچه خدا از رحمت برای مردم بگشاید)؛ و کسر (الكسر) برای اوست، از اسماء، المتعالی (المتعالي) است. و آثار این اسماء الهی در کون (هستی) معلوم است، همان‌گونه که در حق (الحق) با حدود خود متمایز هستند و برخی از برخی دیگر جدا می‌شوند. و ما آن‌ها را در باب دوم از ابواب این کتاب بیان کردیم و در آن حرکات بناء را از حرکات اعراب و مرتبه سکون حی و میت را بیان نمودیم، و همچنین الحاق نون به حروف علت (حروف العلة) در حکم اعراب در پنج مثال از فعل (یفعلان، تفعلان، یفعلون، تفعلون، تفعلین) و اینکه اثبات آن اعراب است و حذف آن اعراب، بسته به عوامل وارد شده بر آن‌ها.\n\n### [اعمال، کسب‌ها هستند و احوال، موهبت‌ها]\n\nو چون معلول (المعلول) به بیماری موصوف است، به دلیل رنجی که از درد علت (العلة) قائم به خود می‌کشد، دارای جهد و مشقت است، زیرا از علت جز معلول پدید نمی‌آید. به همین دلیل، ما آن را در باب مجاهده (المجاهدة) قرار دادیم، زیرا مجاهده مشقت و سختی است و جهاد (الجهاد) به واسطه آن جهاد نامیده شده است. و دین خدا آسانی است، و قول خداوند راست است آنجا که فرمود: **«ما جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ»** (در دین برای شما هیچ سختی قرار نداد) و فرمود: **«يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلا يُرِيدُ بِكُمُ الْعُسْرَ»** (خداوند برای شما آسانی می‌خواهد و برای شما دشواری نمی‌خواهد). و به همین دلیل، بابی را برای ترک جهاد قرار دادیم که پس از این باب می‌آید، و آن باب هفتاد و هفتم در ترک مجاهده (المجاهدة) است، نه ترک عمل؛ زیرا مجاهده حال اعمال در یک زمان است، در حالی که احوال موهبت‌ها هستند و اعمال کسب‌ها (مکاسب). و به همین دلیل، کسب به جای عمل و عمل به جای کسب قرار گرفته است. چنانکه در یک آیه آمده است: **«وَتُوَفَّى كُلُّ نَفْسٍ ما عَمِلَتْ»** (و به هر نفسی آنچه عمل کرده است، به طور کامل داده می‌شود) و در آیه‌ای دیگر: **«ما كَسَبَتْ»** (آنچه کسب کرده است). پس عمل را کسب نامید و هر یک از آن‌ها جای دیگری را گرفت. و به همین دلیل گفتیم که اعمال، کسب‌ها هستند. و برخی از عاملان در عمل خود مشقت دارند که همان مجاهده است، و برخی آن را نمی‌یابند، پس صاحب مجاهده نیستند. اگر عمل مستلزم مشقت بود، صفت هر عاملی می‌شد.\n\n### (فصل) [چهار صنف مجاهدین]\n\nبدان، خداوند تو را تأیید کند، که مجاهدین (المجاهدين) اهل جهد و مشقت و رنج هستند و چهار صنف می‌باشند:\nصنف اول: مجاهدین بدون قید و شرط، که قول خداوند متعال است: **«وَفَضَّلَ اللَّهُ الْمُجاهِدِينَ عَلَى الْقاعِدِينَ»** (و خداوند مجاهدان را بر خانه‌نشینان برتری داد).\nصنف دوم: مجاهدین با قید «فی سبیل الله»، که قول خداوند است: **«وَالْمُجاهِدُونَ فِي سَبِيلِ اللَّهِ»** (و مجاهدان در راه خدا).\nصنف سوم: مجاهدین «فیه» (در او)، که قول خداوند است: **«وَالَّذِينَ جاهَدُوا فِينا لَنَهْدِيَنَّهُمْ سُبُلَنا»** (و کسانی که در [راه] ما مجاهده کردند، قطعاً آن‌ها را به راه‌های خود هدایت می‌کنیم)؛ یعنی راه‌های خود را برایشان آشکار می‌سازیم تا بدانند در چه کسی جهاد کرده‌اند، پس در آن هنگام جهاد کنند یا جهاد نکنند.\nصنف چهارم: مجاهدین **«فِي اللَّهِ حَقَّ جِهادِهِ»** (در راه خدا، حق جهادش). این صنف را از مجاهدین بدون این قید متمایز ساخت، مانند کسانی که **«يَتَّقُونَ اللَّهَ حَقَّ تُقاتِهِ»** (حق تقوای او را رعایت می‌کنند) و **«يَتْلُونَ الْكِتابَ حَقَّ تِلاوَتِهِ»** (کتاب را حق تلاوتش می‌خوانند). پس این مرتبه چهارمی در جهاد است.\n\n### [تا زمانی که تکلیف وجود دارد، مجاهده برقرار است]\n\nاین مجاهده (المجاهدة) از مقاماتی است که همراه با تکلیف (التكليف) است. پس تا زمانی که تکلیف وجود دارد، مجاهده برقرار است. و هنگامی که حکم تکلیف زائل شود، مجاهده نیز زائل می‌شود. و به همین دلیل، خداوند با صنف مباح (المباح) بر مکلفین آسان گرفت، زیرا صورتی که بر آن خلق شدند، در حق آن‌ها شفاعت کرد، چون آن صورت محجور علیه نیست. هنگامی که دید شبیه او محجور علیه شده است، درخواست کرد که حجر از او برداشته شود. به او گفته شد: این امر برای او در آخرت است. گفت: پس باید در زندگی دنیا نیز حکمی برای او باشد تا برای من بشارتی به قبول شفاعت باشد، زیرا تو خود گفتی: **«لَهُمُ الْبُشْرى‏ فِي الْحَياةِ الدُّنْيا وَفِي الْآخِرَةِ»** (برای آن‌ها بشارت در زندگی دنیا و آخرت است). زیرا این صورت، محل تنزه و نظر من است، و اگر بر آن تحجیر ببینم، در آن انکسار می‌بینم و اثری از عنایت خود در آن نمی‌بینم، با وجود اینکه بر صورت من خلق شده و بر من تحجیری نیست.\n\n### [مباح، تکلیف و مجاهده]\n\nپس خداوند مباح (المباح) را در دنیا برای او تشریع کرد. و صورت الهی تنها در هنگام تصرف مکلف در مباح به او نظر می‌کند، و این بالاترین احوال نفس در دنیاست، زیرا از حیات دیگری است که در آن تحجیری نیست. اما هنگامی که از مباح به مکروه یا مندوب منتقل می‌شود، صورت الهی اندکی از مکلف روی برمی‌گرداند و با کمی التفات، به کناری می‌رود. و اگر به محظور (حرام) یا فعل واجب منتقل شود، حجاب می‌اندازد و به کلی از آن مکلف روی برمی‌گرداند. هنگامی که آنکه او را مکلف ساخت و بر او حجر نهاد، یعنی خداوند متعال، این را دید، آنچه را که بر خود واجب کرده بود، واجب ساخت، مانند قولش: **«كَتَبَ رَبُّكُمْ عَلى‏ نَفْسِهِ الرَّحْمَةَ»** (پروردگارتان رحمت را بر خود واجب کرده است) و **«وَكانَ حَقًّا عَلَيْنا نَصْرُ الْمُؤْمِنِينَ»** (و یاری مؤمنان بر ما حق بود). پس حجاب برداشته شد و صورت الهی در هر حالی از احوال احکام به هر یک نظر کرد.\n\n### [وجوب بر خدا و تعلق علم الهی به معلومات]\n\nپس ای ولیّ، بنگر که خداوند چقدر لطیف و مهربان به بندگان خود است، که خود را در حکم وجوب (الوجوب) با آن‌ها شریک ساخت و وجوب را از آن‌ها ساقط نکرد، بلکه خود را با آن‌ها در آن داخل کرد، زیرا آن‌ها ابتدا به آن متصف شده بودند. اگر آن را از آن‌ها زائل می‌کرد، مقام داخل کردن خود با آن‌ها در آن، نزد آن‌ها برقرار نمی‌شد؛ یعنی: این را به شما چشاندیم که به ما چشاندید. و این نهایت لطف در حکم و تنزل الهی است، همان‌گونه که در علم اکتسابی (العلم المستفاد) با آن‌ها تنزل کرد، زیرا علم آن‌ها اکتسابی بود، پس فرمود: **«وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ»** (و شما را می‌آزماییم تا بدانیم)، در حالی که او علیم است. پس با آن‌ها انس گرفت. و در این حکم، ایمانی است که هر شنونده‌ای که خدا را نمی‌شناسد، می‌تواند به قول کسانی که می‌گویند خداوند جزئیات را نمی‌داند، استناد کند، هرچند قصد آن‌ها از این سخن تنزیه (التنزيه) بوده است. و این مسئله‌ای است که تحقق آن با عقل ممکن نیست، مگر اینکه کشف (الكشف) به کیفیت تعلق علم الهی به معلومات حاصل شود، و اینکه در حق (الحق) نه گذشته‌ای هست و نه آینده‌ای، و آنِ او همواره بوده و همواره خواهد بود، و آنِ او به اینکه نبوده و سپس بوده، یا به انقضاء پس از وجود، متصف نمی‌شود. و چه بسا خداوند این نیرو را به هر که از بندگانش بخواهد عطا کند. و نفحه‌ای از آن بر محمد (صلی الله علیه و سلم) ظاهر شد که به واسطه آن علم اولین و آخرین را دانست، پس گذشته و آینده را در آنِ واحد دانست. اگر حضور معلومات برای او در حضره آنِ واحد نبود، به علم به آن‌ها توصیف نمی‌شد. پس این امر می‌فهماند که خداوند جزئیات را به علمی صحیح می‌داند، علمی که از کسی که قصد تنزیه با نفی آن از ساحت حق را دارد، پنهان مانده است.\n\n### [مجاهده (المجاهدة)، واداشتن نفس به مشقت‌هاست و ریاضت، تهذیب اخلاق]\n\nسپس باز می‌گردیم و می‌گوییم که مجاهده (المجاهدة)، واداشتن نفس به مشقت‌های بدنی است که در مزاج تأثیر می‌گذارد و ضعف ایجاد می‌کند، همان‌گونه که ریاضت (الرياضة)، تهذیب اخلاق نفسانی است با واداشتن نفس به تحمل آزار در آبرو و آنچه خارج از بدن است و حرکت بدنی در آن نیست. سپس این حرکات بدنی که شرعاً ستوده شده‌اند، برخی از آن‌ها حرکات مطلق در راه خدا (فی سبیل الله) هستند، که انواع راه هر نیکی مشروعی است. برخی از آن‌ها مشقت دارند که مجاهده نامیده می‌شوند، و برخی مشقتی ندارند، پس حکم این نام از آن‌ها برداشته می‌شود.\n\n### [بزرگترین مشقت‌ها، تلف کردن جان‌ها در راه خالق است]\n\nو این باب مخصوص به چیزی است که در آن مشقت وجود دارد، و به همین دلیل آن را باب مجاهده (المجاهدة) نامیدیم. پس به بزرگترین مشقت‌ها نگریستیم و بزرگتر از تلف کردن جان‌ها (إتلاف المهج) در راه خدا نیافتیم، که همان جهاد فی سبیل الله است. خداوند کشته‌شدگان آن را به زنده بودن و روزی داده شدن توصیف کرد و نهی کرد که درباره آن‌ها گفته شود مردگان هستند، و نفی علم کرد از کسانی که آن‌ها را به دلیل مشارکت در صورت مفارقت احساس و عدم وجود نفس‌ها، به مردگان ملحق می‌سازند.\n\n### [ابطال قیاس فقها و عقلا]\n\nو این از روشن‌ترین دلایل بر ابطال قیاس (القياس) است، زیرا معتقدان به مرگ مجاهدین کشته شده در راه خدا، تنها به قیاس بر کشته شده در غیر راه خدا، به دلیل علت جامع، اعتقاد پیدا کردند. زیرا دیدند که هر یک از کشته‌شدگان بر یک صورت هستند: عدم نفس‌ها و حرکات حیوانی، و عدم امتناع از آنچه از فعل بر آن‌ها اراده می‌شود، مانند قطع اعضا، پاره شدن پوست‌ها، خورده شدن توسط درندگان و پرندگان شکاری، و تبدیل اجسامشان به کرم و پوسیدگی. پس قیاس کردند و خطا نمودند. و هیچ قیاسی روشن‌تر از این یا دال‌تر بر وجود علت (العلة) از این نیست. با این حال، خداوند آن‌ها را تکذیب کرد و به آن‌ها فرمود که حکم من در مورد کشته شده در راه من، مانند کشته شده در غیر راه من نیست: **«وَلا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْواتاً بَلْ أَحْياءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ فَرِحِينَ»** (گمان مبر کسانی که در راه خدا کشته شدند، مرده‌اند، بلکه زنده‌اند و نزد پروردگارشان روزی داده می‌شوند، شادمانند). پس به آن‌ها فرمود: آن حکمی که بر من راندید، علم نیست، و چون علم نیست، صحیح نیست، و چون صحیح نیست، حکم کردن به آن جایز نیست، با علم ما به اخبار خدا که آن صحیح نیست. سپس فرمود: **«وَلا تَقُولُوا لِمَنْ يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْواتٌ بَلْ أَحْياءٌ وَلكِنْ لا تَشْعُرُونَ»** (و به کسانی که در راه خدا کشته می‌شوند، مرده نگویید، بلکه زنده‌اند، ولی شما درک نمی‌کنید). پس علمی را که قیاس به آن‌ها داده بود، از آن‌ها نفی کرد. پس اگر حکم این قیاس با وضوحش، عدم شک در آن، فراهم بودن اسبابش و ظهور علل جامعش بین آن و دیگر کشته‌شدگان، با اخبار خدا باطل است، پس گمانت به قیاس فقها در حوادث و قیاس عقلا به حکم شاهد بر غایب در معرفت خدا چیست؟ هیهات! خداوند راست گفت و اهل قیاس بر خدا دروغ گفتند. و خداوند شبیه کسی نیست که **«لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ»** (هیچ چیز مانند او نیست) از مثل‌های اشیاء.\n\n### [مجاهدان در راه خدا و دو صنف نفوس]\n\nچون تلف کردن جان‌ها (إتلاف المهج) بزرگترین مشقت بر نفوس (النفوس) است، به همین دلیل جهاد نامیده شد. زیرا نفوس دو نوع هستند: نفسی که به دلیل انس با زندگی دنیا، به آن رغبت دارد و نمی‌خواهد جدا شود و این جدایی بر او سخت است؛ و نفسی که به زندگی دنیا رغبت دارد تا با آن طاعت و اعمال مقرب و معرفت الهی و ترقی دائمی با هر نفس را افزایش دهد، پس مفارقت از زندگی دنیا بر او سخت است. به همین دلیل، در حق هر دو طایفه جهاد نامیده شد. اما مجاهدان در راه خدا (في سبيل الله)، یعنی راه رسیدن به او از جهت الوهیتش، جهادی است برای نیل به معرفت مرتبه‌ای که عالم و احکام آن از آن ظاهر شده و خلفا در زمین از آن هستند. در این راه‌ها، مشقتی به آن‌ها می‌رسد که به مسافر در راه پرخطر می‌رسد، زیرا او در راهی است که خود را در سلوک آن در معرض تلف مال و جان و یتیم شدن فرزندان و از دست دادن مأنوسات خود قرار می‌دهد. خداوند متعال فرمود: **«وَجاهَدُوا بِأَمْوالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ»** (و با اموال و جان‌هایشان در راه خدا جهاد کردند) و فرمود: **«يُقاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ»** (در راه خدا می‌جنگند، پس می‌کشند و کشته می‌شوند).\n\n### [خداوند از مؤمنان جان‌ها و اموالشان را خرید]\n\nو چون خداوند می‌دانست که چنین امری بر بندگان سنگین است، زیرا آن‌ها ادعا می‌کنند که نفوس و اموالشان متعلق به خودشان است، همان‌گونه که حق (الحق) آن‌ها را برایشان اثبات کرده است و خداوند جز حق نمی‌گوید، پس ابتدا خرید اموال و نفوس را از آن‌ها مطرح کرد تا دست آن‌ها را از آن‌ها کوتاه کند. پس خریدار (خداوند) در کالای خود هرگونه که بخواهد تصرف می‌کند، و فروشنده، اگرچه کالای خود را دوست دارد، اما عوضی که در مقابل آن دریافت کرده، یعنی بها، نزد او محبوب‌تر از چیزی است که فروخته است. پس فرمود: **«إِنَّ اللَّهَ اشْتَرى‏ مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوالَهُمْ»** (همانا خداوند از مؤمنان جان‌ها و اموالشان را خرید). و پس از این خرید، امر کرد که با آن‌ها در راه خدا جهاد کنند تا این امر بر آن‌ها آسان شود. پس آن‌ها با نفوس مستعاره (نفوس عاریه) جهاد می‌کنند، منظورم نفوس حیوانی است که قائم به اجسام هستند، و اموال نیز عاریه هستند.\n\n### [انسان بر شفقت طبیعی سرشته شده است]\n\nپس آن‌ها مانند کسی هستند که بر مرکبی عاریه و مالی که متعلق به دیگری است سفر می‌کند، و مالک آن هنگام عاریه دادن، حرج را از او برداشته است که اگر مرکب تلف شود و مال از بین برود، او آسوده‌خاطر است. پس اگر مؤمن باشد، مشقت نفسانی بر او باقی نمی‌ماند، مگر مشقتی که این مرکب حیوانی از طول مسافت و خستگی راه تحمل می‌کند، و اگر در جنگ با دشمن باشد، رنجی که از حمله و فرار، نیزه زدن، تیراندازی و شمشیر زدن می‌بیند. و انسان بر شفقت طبیعی (الشفقة الطبيعية) سرشته شده است، پس بر مرکب خود شفقت می‌ورزد از آن جهت که حیوان است، نه از جهت مالک آن؛ زیرا مالک آن می‌دانسته که این معبر (مرکب) قصد تلف شدن دارد، پس این امر برای او محبوب است. بنابراین، جز شفقت طبیعی، شفقت دیگری بر آن باقی نمی‌ماند.\n\n### [نفوسی که حق (الحق) آن‌ها را خرید و نفوسی که آن‌ها را به او فروختند]\n\nپس نفوسی که حق (الحق) در این آیه خرید، همان نفوس حیوانی هستند که آن‌ها را از نفوس ناطقه مؤمن (النفوس الناطقة المؤمنة) خرید. پس نفوس ناطقه مؤمن، فروشنده و مالک این نفوس حیوانی هستند که حق آن‌ها را از آن‌ها خرید، زیرا این نفوس ناطقه هستند که محل قتل می‌باشند. و این نفوس (حیوانی) محل ایمان نیستند، بلکه موصوف به ایمان، نفوس ناطقه هستند. و حق از آن‌ها نفوس اجسام را خرید، پس فرمود: «اشْتَرى‏ مِنَ الْمُؤْمِنِينَ» (از مؤمنان خرید)، و آن‌ها نفوس ناطقه موصوف به ایمان هستند، «أَنْفُسَهُمْ» (جان‌هایشان) که مرکب‌های حسی آن‌ها هستند و برای قتال و جهاد خارج می‌شوند. پس مؤمن نفسی ندارد، و در شفقت بر آن، جز شفقت ذاتی که در نفس ناطقه بر هر حیوانی وجود دارد، ندارد.\n\n### [مجاهدان بالله، اربابان جهاد عام هستند]\n\nاما مجاهدانی که خداوند آن‌ها را به صفت معینی مقید نکرده است، نه در راه خدا، نه در او، و نه به حق جهاد، آن‌ها مجاهدان بالله (المجاهدون بالله) هستند که صفتشان عدم تقیید است. پس جهاد او در هر چیزی است و آن جهاد عام (الجهاد العام) است. و نسبت جهاد به او که همان مشقت است، به دلیل آن است که او را مجاهد نامیده و قید نکرده که در چه چیزی جهاد می‌کند. این حکم قضا و قدر در اشیائی است که از آن، بازگشت بر مقضی‌علیه به آنچه بر او قضا شده، حاصل می‌شود. و حق (الحق) نمی‌خواهد او را ناراحت کند، به دلیل عنایتی که به این بنده دارد.\nپس در این مقام فرمود: **«ما ترددت في شي‏ء أنا فاعله ترددي في قبض نسمة عبدي المؤمن يكره الموت وأكره مساءته ولا بد له من لقائي»** (در هیچ کاری که انجام می‌دهم، تردید نکردم، مانند تردیدم در گرفتن جان بنده مؤمنم که مرگ را ناخوش دارد و من ناخوش داشتن او را ناخوش دارم، در حالی که چاره‌ای جز ملاقات من ندارد).\nمی‌گوید: و چاره‌ای جز مرگ ندارد، به دلیل آنچه علم به آن سبقت گرفته است. پس او را از مجاهده مطلق، غیر مقید به آزار یا غیر آن، قبض می‌کند. اما تنبیه او تعالی به تردید، دلیلی بر حکم مناسب حکم مجاهده است، زیرا آن را نیاورد مگر برای اینکه علم ما را به امر، آن‌گونه که هست، مقید سازد. زیرا او سبحانه معلم بندگانش است، و این قول اوست: **«وَقالَ الَّذِينَ أُوتُوا الْعِلْمَ»** (و کسانی که علم به آن‌ها داده شده گفتند)، و او کسی است که علم را از اسم الرحمن (الرحمن) به آن‌ها عطا کرد، که درباره آن فرمود: **«عَلَّمَ الْإِنْسانَ ما لَمْ يَعْلَمْ»** (به انسان آنچه را نمی‌دانست، آموخت).\n\n### [مجاهدانی که مقید نمی‌شوند، همان مترددین هستند]\n\nمجاهدان از بندگان که مقید نمی‌شوند، همان‌گونه که خداوند آن‌ها را مطلق گذاشت، کسانی هستند که در افعال صادر شده از خودشان تردید دارند که آیا آن‌ها را به خدا نسبت دهند؟ زیرا در میان آن‌ها چیزی هست که از روی ادب نباید به او نسبت داده شود، و حق (الحق) از آن بیزاری جسته است، چنانکه فرمود: **«بَراءَةٌ مِنَ اللَّهِ»** (بیزاری از خدا). یا آن‌ها را به خودشان نسبت دهند؟ زیرا در میان آن‌ها چیزی هست که از روی ادب با خدا و نسبت حقیقی، باید به خدا نسبت داده شود. و دیدند که خداوند می‌فرماید: **«وَما رَمَيْتَ إِذْ رَمَيْتَ»** (و تو پرتاب نکردی آنگاه که پرتاب کردی)، پس نفی کرد و عین همان چیزی را که نفی کرده بود، اثبات کرد. سپس فرمود: **«وَلَكِنَّ اللَّهَ رَمى‏»** (بلکه خدا پرتاب کرد). پس اثبات را میان دو نفی قرار داد، و این اثبات به دلیل احاطه‌ای که بر مثبت دارد، قوی‌تر است. سپس در همین آیه فرمود: **«وَلِيُبْلِيَ الْمُؤْمِنِينَ»** (و تا مؤمنان را بیازماید). پس دانستیم که خداوند مؤمنان را متحیر ساخت، و این همان ابتلای اوست به آنچه ذکر شد، یعنی نفی پرتاب و اثبات آن. و آن را بلای نیکو نامید، یعنی اگر بنده آن را از خود نفی کند، درست گفته است، و اگر آن را برای خود اثبات کند، درست گفته است. و تنها این باقی می‌ماند که کدام یک از این دو در حق بنده اولی‌تر است، اگرچه همه نیکوست. و این موضع حیرت است، و به همین دلیل آن را بلا نامید، یعنی موضع آزمایش. پس کسی که حق را دریابد، یعنی مراد خدا را دریابد که کدام یک از دو اصابت یا کدام یک از دو حکم را اراده کرده است، حکم نفی یا حکم اثبات، نزد خدا عظیم‌تر است از کسی که به آن دست نمی‌یابد. پس این‌ها همان مجاهدانی هستند که خداوند آن‌ها را بر قاعدین (خانه‌نشینان) از این نظر، به پاداشی عظیم برتری داد. و آنچه خداوند عظیم شمارد، قدرش قابل اندازه‌گیری نیست.\nدرجات بسیاری از آن وجود دارد و آن را یک درجه قرار نداد، چنانکه در مورد مجاهدان فی سبیل الله فرمود که برای آن‌ها یک درجه قرار داد، سپس آنچه را که در ادامه آیه ذکر شد، بر آن افزود.\n\n### [مجاهدان در راه خدا، حق جهادش]\n\nاین دو صنف را ذکر کردیم. اما صنف سوم، کسانی هستند که **«جاهَدُوا فِي اللَّهِ حَقَّ جِهادِهِ»** (در راه خدا، حق جهادش را به جای آوردند). ضمیر «ه» در «جهاده» به خدا بازمی‌گردد، یعنی به جهاد متصف می‌شوند، یعنی در حال جهاد او، که صفت حق (الحق) است، همان‌گونه که در تردید الهی (التردد الإلهي) ذکر کردیم. یعنی جز خدا را مجاهد نمی‌بینند، و این به دلیل آن است که جهاد در او واقع شده است، و هیچ کس نمی‌داند که جهاد در خدا چگونه است مگر خود خدا. پس هنگامی که آن را به خدا بازگرداندند، که همان قول اوست: **«حَقَّ جِهادِهِ»** (حق جهادش)، و جهاد را با اضافه ضمیر به او نسبت داد، پس مجاهد آن‌ها نیستند، اگرچه محل ظهور آثار هستند، بلکه آن‌ها مجاهدون (مجاهده‌شدگان) هستند نه مجاهدون (مجاهده‌کنندگان).\nخداوند به موسی فرمود: **«يا موسى اشكرني حق الشكر»** (ای موسی، مرا حق شکر به جای آور). موسی گفت: پروردگارا، چه کسی می‌تواند چنین کند؟ فرمود: **«إذا رأيت النعمة مني فقد شكرتني حق الشكر»** (هرگاه نعمت را از من دیدی، مرا حق شکر به جای آورده‌ای). این حدیث را ابن ماجه در سنن خود آورده است.\n\n### [عملی که از روی ذوق و کشف و مشاهده به خدا نسبت داده شود]\n\nپس هر عملی را که از روی ذوق (ذوق) و کشف (کشف) و مشاهده (مشاهدة) به خدا نسبت دهی، نه از روی اعتقاد و حال، بلکه از روی مقام و علم صحیح، حق آن عمل را ادا کرده‌ای، زیرا آن را از کسی دیده‌ای که صاحب آن است. پس هرگاه چنین امری برای تو رخ داد، شرح آن همان است که خداوند بر زبان رسولش شرح داده و به ما رسانده است، و آن روشی است که به خدا می‌رساند، آسان، نرم، نزدیک به دسترسی و مستقیم است: **«لا تَرى‏ فِيها عِوَجاً وَلا أَمْتاً»** (در آن هیچ کجی و ناهمواری نمی‌بینی).\n\n### [و کسانی که در ما مجاهده کردند، قطعاً آن‌ها را به راه‌های خود هدایت می‌کنیم]\n\nو صنف چهارم کسانی هستند که خداوند درباره آن‌ها فرمود: **«وَالَّذِينَ جاهَدُوا فِينا لَنَهْدِيَنَّهُمْ سُبُلَنا»** (و کسانی که در [راه] ما مجاهده کردند، قطعاً آن‌ها را به راه‌های خود هدایت می‌کنیم). همان‌هایی که درباره آن‌ها گفتیم: **«وَلا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ»** (و از راه‌ها پیروی نکنید که شما را از راه او پراکنده می‌سازد)، یعنی راهی که سعادت شما در آن است. وگرنه همه راه‌ها به سوی اوست، زیرا خداوند منتهای هر راهی است: **«إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ»** (همه امور به او بازگردانده می‌شود). اما هر کس که به سوی او بازگردد، سعادتمند نمی‌شود. پس راه سعادت، راه مشروع است و نه غیر آن. اما غایت همه راه‌ها ابتدا به سوی خداست، سپس رحمان (الرحمن) در آخر، متولی آن‌ها می‌شود، یا حکم رحمان در آن‌ها تا ابد که بقای آن را پایانی نیست، باقی می‌ماند. و این مسئله‌ای شگفت‌انگیز است که مکاشف آن کم و مؤمن به آن کمتر است. و چون سبب جهاد، افعالی است که از کسانی صادر می‌شود که به قتال و جهاد با آن‌ها امر شده‌ایم، و آن افعال، افعال خدا هستند، پس ما جز در او جهاد نکرده‌ایم، نه در دشمن. و چون دشمنی جز به واسطه آن افعال وجود ندارد، پس هنگامی که در او جهاد کردیم، و با قول او برای ما روشن شد که اگر در او جهاد کنیم، ما را به راه‌های خود هدایت می‌کند، یعنی راه‌هایش را برای ما بیان می‌کند، پس وارد آن‌ها می‌شویم و هنگامی که جهاد کردیم، غیری نمی‌بینیم. پس از آنچه از ما سر زده، از خدا طلب مغفرت کردیم. و از جمله آن راه‌ها، مشاهده این بود که آنچه از ما سر زده، اوست که آن را واقع ساخته، نه ما. پس از خدا طلب مغفرت کردیم، یعنی از او خواستیم که محل ظهور عملی نباشیم که خود را به کراهت در آن توصیف کرده است. پس ثابت شد که در هستی (الوجود) جز خدا نیست، پس در او جهاد کردیم نه در غیر او. و اگر ما را به راه‌های خود هدایت نمی‌کرد، این را نمی‌دانستیم. و به همین دلیل آیه را با این قول به پایان رساند: **«وَإِنَّ اللَّهَ لَمَعَ الْمُحْسِنِينَ»** (و همانا خداوند با نیکوکاران است). و احسان (الإحسان) آن است که خدا را چنان بپرستی که گویی او را می‌بینی.\nپس اگر او را دیدی، دانستی که جهاد تنها از او و در او بوده است.\n\n### [کتاب الهی و کتابت الهی]\n\nپس من احوال اهل مجاهدات (المجاهدات) را که همان مجاهدان هستند، برای تو بیان کردم. و سخن در جزئیات این باب به درازا می‌کشد و کتاب بزرگ است. اگر بخواهیم آنچه را که هر باب از ما می‌طلبد به طور کامل بیاوریم، عمر به نگارش آن وفا نمی‌کند. پس ناگزیر باید به اختصار بسنده کنیم، و تنها به آنچه از هر باب به منزله مادران (اصول) است، اکتفا می‌کنیم. و هر مادری مانند حوا برای بنی‌آدم است، زیرا همه آن‌ها فرزندان او هستند. اگر خداوند کتابت الهی (الكتابة الإلهية) را به ما عطا می‌کرد، تمام آنچه را که این کتاب در بر دارد، به طور کامل در یک ورقه کوچک آشکار می‌ساختیم، همان‌گونه که رسول خدا (صلی الله علیه و سلم) با دو کتاب در دستش خارج شد: کتاب الهی (الكتاب الإلهي) که مخلوقی در آن تصرف نکرده بود، و خبر داد که در کتابی که در دست راست اوست، اسامی اهل بهشت و اسامی پدران و قبایل و عشایر آن‌ها از ابتدای خلقت تا روز قیامت است، و کتاب دیگر نیز مانند آن در اسامی اهل شقاوت. و اگر آن با کتابت معمول بود، اوراق آن شهر مدینه را در بر نمی‌گرفت. اگر چنین چیزی برای ما رخ می‌داد، در یک لحظه آن را آشکار می‌ساختیم. و ما آن کتابت را دیده‌ایم، و آن مانند بهشت در عرض دیوار و آتش، و مانند صورت آسمان در آینه است.\n\n### [درجات اهل الله در مجاهده]\n\nپس آنچه را که برای این صفت، یعنی مجاهده (المجاهدة)، از مقامات که مراتب و منازل اهل آن هستند، ذکر می‌کنیم. و آن‌ها ملامیه (الملامية) هستند که دو دسته‌اند: اهل ادب با توقف در حد، و اهل انس (الأنس) و وصال (الوصال). و همچنین آنچه برای عارفان (العارفين) از این باب است، که آن‌ها نیز دو دسته‌اند: اهل ادب و توقف در حد، و اهل انس و وصال. و این در هر مقامی جاری است.\nآنچه برای ملامیه (الملامية) از صنفی که دارای ادب توقف در حدود است، پنجاه و سه درجه است. و ما به ذکر درجات روی آوردیم، زیرا شنیدیم که خداوند در فضیلت آن‌ها از درجات (الدرجات) سخن می‌گوید، پس از آنچه خداوند فرموده پیروی کردیم که برای ما اولی‌تر است.\nو آنچه برای ملامیه اهل انس و وصال (الأنس والوصال) از درجات در این باب است، چهارصد و پنجاه و سه درجه است.\nاما درجات عارفان اهل انس و وصال، چهارصد و هشتاد و چهار درجه است.\nو اما آنچه برای اهل ادب و توقف در حدود از عارفان است، هشتاد و نه درجه است، یعنی نود منهای یک، که بین آن و درجات اسماء الهی ده [درجه] فاصله است."
  },
  "page_count": 5
}