{
  "id": 473,
  "title": {
    "ar": "الباب الثالث والسبعون وأربعمائة في حال قطب كان منزله وإِلهُكُمْ إِلهٌ واحِدٌ",
    "en": "Chapter Four Hundred and Seventy-Three: Concerning the spiritual state of a Pole (قطب) whose station (منزله) was the verse: <<وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ>> (And your God is one God).",
    "ur": "باب چار سو تہتر: اس قطب کے حال کے بیان میں جس کا روحانی منزل (منزل) یہ تھا: \"اور تمہارا معبود ایک ہی معبود ہے\" (وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ)۔",
    "fa": "باب چهارصد و هفتاد و سوم در حال قطبی که منزلگاهش این آیه بود: «و خدای شما خدایی یگانه است» (وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ)"
  },
  "content": {
    "ar": "## «الباب الثالث والسبعون وأربعمائة في حال قطب كان منزله وإِلهُكُمْ إِلهٌ واحِدٌ»\n\n\n> بتوحيد الإله يقول قوم *** وتوحيد الكثير هو الوجود\n\n\n> ومن أسمائه الحسنى علمنا *** بأن الله يَفْعَلُ ما يُرِيدُ\n\n\n> فكان بنا الإله وفيه كنا *** هو المولى ونحن له عبيد\n\n\n### [التوحيد في الألوهية]\n\n\nاعلم أيدنا الله وإياك بروح منه أن الله أمرنا بتوحيده في ألوهته فلا إله إلا هو كما نهانا عن التفكر في ذاته فعصاه أهل النظر في ذلك ممن يزعم أنه من أهل الله كالقدماء وغيرهم من المتكلمين وبعض الصوفية كأبي حامد وغيره في مضنونه وغير مضنونه واحتجوا بأمور هي عليهم لا لهم وبعد استيفاء النظر أقروا بالعجز فلو كان ثم علم وإيمان حق وصدق لكان ذلك في أول قدم فتعدوا حدود الله التي هي أعظم الحدود وجعلوا ذلك التعدي قربة إليه ولم يعلموا أن ذلك عين البعد منه وعند كشف الغطاء يظهر من أعطى ومن أعطى‏\n\n\n> سوف ترى إذا انجلى الغبار *** أ فرس تحتك أم حمار\n\n\nفالصورة صورة فرس والخبرة خبرة حمار هذا الذكر يعطي الذاكر به رجاء عظيما وفتحا مبينا وذلك أن الله تعالى خاطب في هذه الآية المسلمين والذين عبدوا غير الله قربة لي الله فما عبدوا إلا الله فلما قالوا ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏ فأكدوا وذكروا العلة فقال الله لنا إِنَّ إِلهَكُمْ والإله الذي يطلب المشرك القربة إليه بعبادة هذا الذي أشرك به واحد كأنكم ما اختلفتم في أحديته فقال وإِلهُكُمْ فجمعنا وإياهم إِلهٌ واحِدٌ فما أشركوا إلا بسببه فيما أعطاهم نظرهم ومن قصد من أجل أمر ما فذلك الأمر على الحقيقة هو المقصود لا من ظهر أنه قصد كما يقال من صحبك لأمر أو أحبك لأمر ولي بانقضائه ولهذا ذكر الله أنهم يتبرءون منهم يوم القيامة وما أخذوا إلا من كونهم فعلوا ذلك من نفوسهم لا أنهم جهلوا قدر الله في ذلك أ لا ترى الحق لما علم هذا منهم كيف قال وإِلهُكُمْ إِلهٌ واحِدٌ ونبهم فقال قُلْ سَمُّوهُمْ فيذكرونهم بأسمائهم المخالفة أسماء الله ثم وصفهم بأنهم في شركهم قَدْ ضَلُّوا ضَلالًا بَعِيداً أو مبينا لأنهم أوقعوا أنفسهم في الحيرة لكونهم عبدوا ما نحتوا بأيديهم وعلموا أنه لا يَسْمَعُ ولا يُبْصِرُ ولا يُغْنِي عنهم من الله شيئا فهي شهادة من الله بقصور نظرهم وعقولهم ثم أخبرنا الله أنه قضى أن لا نعبد إلا إياه بما نسبوه من الألوهة لهم أي جعلوهم كالنواب لله والوزراء كان الله استخلفهم ومن عادة الخليفة أن يكون في رتبة من استخلفه عند المستخلف عليه فلهذا نسبوا الألوهة لهم ابتداء من غير نظر فيمن جعل ذلك وقول من قال أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً إنما كان من أجل اعتقادهم فيما عبدوه إنهم آلهة دون الله المشهود له عندهم بالعظمة على الجميع فأشبه هذا القول ما ثبت في الشرع الصحيح من اختلاف الصور في التجلي ومعلوم عند من يشاهد ذلك أن الصورة ما هي هذه الصورة وكل صورة لا بد أن يقول المشاهد لها إنها الله لكن لما كان هذا من عند الله وذلك الآخر من عندهم أنكر عليهم التحكم في ذلك كما ثبت في قوله تعالى فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله هذا حقيقة فوجه الله موجود في كل جهة يتولى أحد إليها ومع هذا لو تولى الإنسان في صلاته إلى غير الكعبة مع علمه بجهة الكعبة لم تقبل صلاته لأنه ما شرع له إلا استقبال هذا البيت الخاص بهذه العبادة الخاصة فإذا تولى في غير هذه العبادة التي لا تصح إلا بتعيين هذه الجهة الخاصة فإن الله يقبل ذلك التولي كما\nأنه لو اعتقد أن كل جهة يتولى إليها ما فيها وجه الله لكان كافرا وجاهلا ومع هذا فلا يجوز له أن يتعدى بالأعمال حيث شرعها الله ولهذا اختلفت الشرائع فما كان محرما في شرع ما حلله الله في شرع آخر ونسخ ذلك الحكم الأول في ذلك المحكوم عليه بحكم آخر في عين ذلك المحكوم عليه قال الله تعالى لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً فما نسخ من شرع واتبعه من اتبعه بعد نسخه فذلك المسمى هوى النفس الذي قال الله فيه لخليفة داود إِنَّا جَعَلْناكَ خَلِيفَةً في الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ يعني الحق الذي أنزلته إليك ولا تَتَّبِعِ الْهَوى‏ وهو ما خالف شرعك فَيُضِلَّكَ عَنْ سَبِيلِ الله وهو ما شرعه الله لك على الخصوص فإذا علمت هذا وتقرر لديك علمت أن الله إله واحد في كل شرع عينا وكثير صورة وكونا فإن الأدلة العقلية تكثره باختلافها فيه وكلها حق ومدلولها صدق والتجلي في الصور يكثره أيضا لاختلافها والعين واحدة فإذا كان الأمر هكذا فما تصنع أو كيف يصح لي أن أخطأ قائلا ولهذا لا يصح خطأ من أحد فيه وإنما الخطاء في إثبات الغير وهو القول بالشريك فهو القول بالعدم لأن الشريك ليس ثم ولذلك لا يغفره الله لأن الغفر الستر ولا يستر إلا من له وجود والشريك عدم فلا يستر فهي كلمة تحقيق إِنَّ الله لا يَغْفِرُ أَنْ يُشْرَكَ به لأنه لا يجده فلو وجده لصح وكان للمغفرة عين تتعلق بها وما في الوجود من يقبل الأضداد إلا العالم من حيث ما هو واحد وفي هذا الواحد ظهرت الأضداد وما هي إلا أحكام أعيان الممكنات في عين الوجود التي بظهورها علمت الأسماء الإلهية المتضادة وأمثالها فإذا علمت هذا فقل بعد ذلك ما شئت أما كثرة الأسماء أظهرت كثرة الأحكام وأما كثرة الأحكام أظهرت كثرة الأسماء فإنه أمر لا ينكره عقل ولا شرع فالوجود يشهد له وما بقي إلا ما ذكرناه إلى من ينسب الحكم هل للأسماء الإلهية أم للممكنات الكونية وهما مرتبطان محكوم بهما في عين واحدة\n\n\n> فيا خيبة الجهال ما ذا يفوتهم *** وما ذا يفوت القائلين بجهلهم‏\n\n\n> فقد قلت هذا ثم هذا فإنني *** من أجل الذي قد قلت فيهم من أهلهم‏\n\n\nفمن وحد ما أنصف ومن أشرك فما أصاب هو تعالى واحد لا بتوحيد موحد ولا بتوحيده لنفسه لأنه واحد لنفسه فما أحديته مجعولة ولا أحدية كثرته مجهولة وما ثم إلا عدم ووجود فالوجود له والعدم ليس له لكن له الإعدام ولا يقال والعدم لغيره فتثبت عين ما تنفى فتجوز في اللفظ وما بين الوجود والعدم ما لا يتصف بالوجود ولا بالعدم وهو العالم معطي الأحكام لعين الوجود والصور لعين الشهود والمدلولات لأدلة العقود فشاهد ومشهود وعاقد ومعقود وموجد وموجود وما ثم أمر مفقود فقد تميزت الحدود بل ميزت كل محدود وما ثم إلا محدود لمن عرف العدم والوجود والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## Chapter Four Hundred and Seventy-Three concerning the state of a Pole (Qutb) whose station was: \"And your God is One God\"\n\nSome people speak of the Oneness of the Godhead,\nBut the Oneness of the Multiplicity is Being (الوجود).\n\nFrom His Beautiful Names (الأسماء الحسنى) we have learned\nThat Allah does what He wills.\n\nThus the Godhead was through us, and in Him we were;\nHe is the Master (المولى), and we are His servants.\n\n### [Unity in the Godhead (التوحيد في الألوهية)]\n\nKnow—may Allah support us and you with a Spirit from Him—that Allah commanded us to affirm His Unity (توحيد) in His Godhead (ألوهته), that there is no god but He, just as He forbade us from contemplating His Essence (ذاته).\n\nYet the people of speculation (أهل النظر) disobeyed Him in this, including those who claim to be among the People of Allah (أهل الله), such as the ancients and others among the theologians (المتكلمين), and some Sufis like Abu Hamid [al-Ghazali] and others, both in his well-known and lesser-known works. They argued using matters that counted against them, not for them. After exhausting their speculation, they admitted their incapacity. Had there been true knowledge (علم), faith (إيمان), and sincerity (صدق), this realization would have occurred at the very first step. They transgressed the limits of Allah, which are the greatest of limits, and they made that transgression an act of proximity (قربة) to Him, not knowing that this was the very essence of distance from Him. When the veil (الغطاء) is lifted, it will become clear who gave and who was given.\n\nYou will see, when the dust settles,\nWhether a horse or a donkey is beneath you.\n\nThe form is the form of a horse, but the experience is the experience of a donkey.\n\nThis remembrance (الذكر) grants the one who practices it great hope and a manifest opening (فتحًا مبينًا). This is because Allah the Exalted, in this verse, addresses both the Muslims and those who worshiped other than Allah seeking proximity to Allah. Thus, they worshiped none but Allah. When they said: <<مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللهِ زُلْفَى>> (We only worship them that they may bring us nearer to Allah in proximity), they affirmed this and mentioned the reason. So Allah said to us: <<إِنَّ إِلَهَكُمْ>> (Indeed, your God)—and the God to whom the polytheist seeks proximity by worshiping that which he associates with Him—is One. It is as if you did not differ regarding His Oneness (أحديته). So He said: <<وَإِلَهُكُمْ>> (And your God), thereby gathering us and them, <<إِلَهٌ وَاحِدٌ>> (is One God).\n\nThey only committed polytheism (شرك) because of Him, based on what their speculation granted them. Whoever intends something for the sake of a certain matter, that matter is, in reality (الحقيقة), the intended object, not the one who appears to be intended. Just as it is said: \"Whoever accompanied you for a purpose, or loved you for a purpose, departed when that purpose ended.\" For this reason, Allah mentioned that they will disavow them on the Day of Resurrection. They only took this path because they acted from their own souls (نفوسهم), not because they were ignorant of Allah's measure in that matter. Do you not see how The Real (الحق), knowing this about them, said: <<وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ>> (And your God is One God), and then alerted them by saying: <<قُلْ سَمُّوهُمْ>> (Say: Name them)? So they mention them by their names, which contradict the Names of Allah. Then He described them, saying that in their polytheism they have <<قَدْ ضَلُّوا ضَلَالًا بَعِيدًا>> (certainly gone far astray) or manifestly astray. This is because they cast themselves into confusion (الحيرة) by worshiping what they carved with their own hands, knowing that it neither hears nor sees, nor can it avail them anything against Allah. This is a testimony from Allah regarding the deficiency of their speculation and their intellects (عقولهم).\n\nThen Allah informed us that He decreed that we should worship none but Him, despite the Godhead (الألوهة) they attributed to their idols—meaning, they made them like deputies (النواب) or ministers (الوزراء) for Allah. It was as if Allah had appointed them as vicegerents (استخلفهم). It is customary for a vicegerent (الخليفة) to hold the rank of the one who appointed him, in the eyes of those over whom he is appointed. For this reason, they initially attributed Godhead to them, without considering who established this. And the saying of those who said: <<أَجَعَلَ الْآلِهَةَ إِلَهًا وَاحِدًا>> (Has he made the gods into one God?) was only due to their belief that what they worshiped were gods (آلهة) besides Allah, Whom they witnessed as possessing absolute Greatness over all.\n\nThis saying resembles what is established in the sound Sacred Law (الشرع الصحيح) concerning the variation of forms in the Theophany (التجلي). It is known to the one who witnesses this that the form is not *this* form, yet every form must be declared by the witness to be Allah. However, since the former [the true Theophany] is from Allah, and the latter [the idols] is from themselves, He condemned their arbitrary control (التحكم) in that matter. This is confirmed in His saying, the Exalted: <<فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ>> (So wherever you turn, there is the Face of Allah). This is a Reality (حقيقة). The Face of Allah (وجه الله) is present in every direction one turns toward.\n\nDespite this, if a person were to turn in his prayer (صلاة) toward a direction other than the Kaaba, knowing the direction of the Kaaba, his prayer would not be accepted. This is because he was only legislated (شرع) to face this specific House for this specific act of worship (عبادة). However, if he turns in an act other than this worship, which is only valid by designating this specific direction, then Allah accepts that turning. Similarly, if he believed that every direction he turns toward does not contain the Face of Allah, he would be an unbeliever (كافر) and ignorant (جاهل). Nevertheless, he is not permitted to transgress the limits of actions where Allah has legislated them.\n\nFor this reason, the Divine Laws (الشرائع) differed. What was forbidden in one Law, Allah made lawful in another, and He abrogated that first ruling concerning the subject of the ruling with another ruling concerning the very same subject. Allah the Exalted said: <<لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا>> (For each of you We have appointed a Law [شِرْعَةً] and a Way [مِنْهَاجًا]). Whatever Law is abrogated, and someone follows it after its abrogation, that is what is called the caprice of the soul (هوى النفس), concerning which Allah said to the vicegerent (خليفة) of David: <<إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ>> (Indeed, We have made you a vicegerent upon the earth, so judge between the people with the Truth)—meaning, the Truth which I have revealed to you—<<وَلَا تَتَّبِعِ الْهَوَى>> (and do not follow caprice), which is whatever contradicts your Law, <<فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ>> (lest it lead you astray from the Way of Allah), which is what Allah has specifically legislated for you.\n\nIf you know this and it is established with you, you will know that Allah is One God (إله واحد) in every Law essentially (عينا), yet Multiplicity in form and existence (صورة وكونا). For the rational proofs (الأدلة العقلية) multiply Him through their differences concerning Him, yet all of them are true, and their indications are sincere. The Theophany (التجلي) in forms also multiplies Him due to their variation, while the Essence (العين) remains One.\n\nIf the matter is thus, what should you do, or how can it be right for me to declare any speaker mistaken? For this reason, no one’s error concerning Him is valid. Rather, the error lies in affirming the other (الغير), which is the assertion of a partner (الشريك). This is equivalent to asserting non-existence (العدم). This is because the partner is not there. Therefore, Allah does not forgive it, because forgiveness (الغفر) is concealment (الستر), and only that which has Existence (وجود) can be concealed. The partner is non-existence, so it cannot be concealed. Thus, the statement <<إِنَّ اللَّهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِ>> (Indeed, Allah does not forgive that association [shirk] be made with Him) is a word of verification (تحقيق), because He does not find it [the partner]. If He found it, it would be valid, and forgiveness would have an essence (عين) to which it could relate.\n\nThere is nothing in Existence that accepts opposites (الأضداد) except the World (العالم), insofar as it is one. And in this One, the opposites appeared. These opposites are nothing but the rulings (أحكام) of the Fixed Entities (الأعيان الثابتة) within the very Essence of Being (عين الوجود), through whose manifestation the opposing Divine Names (الأسماء الإلهية) and their likes became known. If you know this, then say what you wish thereafter. Whether the multiplicity of Names manifested the multiplicity of rulings, or the multiplicity of rulings manifested the multiplicity of Names, this is a matter that neither intellect (عقل) nor Law (شرع) denies. Existence bears witness to this. Nothing remains except what we mentioned: to whom should the ruling be attributed? To the Divine Names or to the contingent cosmic entities (الممكنات الكونية)? Both are interconnected and ruled upon within a single Essence (عين واحدة).\n\nO the disappointment of the ignorant! What do they miss?\nAnd what do those who speak in their ignorance miss?\n\nI have said this, and then that, for I am,\nBecause of what I have said concerning them, one of their people.\n\nSo whoever affirms Unity (وحد) has not been fair, and whoever commits polytheism (أشرك) has not been correct. He, the Exalted, is One, not by the affirmation of unity by a unifier (موحد), nor by His own affirmation of unity for Himself, because He is One by Himself. His Oneness (أحديته) is not made, nor is the oneness of His multiplicity unknown. There is nothing there except non-existence (عدم) and Existence (وجود). Existence belongs to Him, and non-existence does not belong to Him, but the acts of annihilation (الإعدام) belong to Him. Nor should it be said that non-existence belongs to another, for then you would affirm the essence of what you negate, thus committing a linguistic transgression.\n\nAnd between Existence and non-existence is that which is not described by Existence nor by non-existence: this is the World (العالم), which grants rulings (الأحكام) to the Essence of Being (عين الوجود), forms (الصور) to the Essence of Witnessing (عين الشهود), and indications (المدلولات) to the proofs of covenants (أدلة العقود). Thus, there is a Witnesser and a Witnessed, a Covenanter and a Covenanted, an Originator and an Originated. There is no missing matter there. The limits (الحدود) have been distinguished; rather, every limited thing has been distinguished. There is nothing there but the limited, for the one who knows non-existence and Existence.\n\nAnd Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب نمبر چار سو تہتر قطب کے حال میں جس کا مقام یہ تھا: \"اور تمہارا معبود ایک ہی معبود ہے\" (وَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ)۔\n\nتوحیدِ الہٰ کے بارے میں ایک قوم کہتی ہے\nاور کثیر کی توحید ہی ہستی (الوجود) ہے۔\nاور اس کے اسمائے حسنیٰ سے ہم نے جانا\nکہ اللہ وہی کرتا ہے جو وہ چاہتا ہے۔\nپس معبود (الإله) ہمارے ساتھ تھا اور ہم اس میں تھے\nوہ آقا ہے اور ہم اس کے بندے ہیں۔\n\n### [الو ہیت میں توحید]\n\nجان لو، اللہ تعالیٰ اپنی روح سے ہماری اور تمہاری تائید فرمائے، کہ اللہ نے ہمیں اپنی الوہیت (الألوهية) میں توحید کا حکم دیا ہے کہ اس کے سوا کوئی معبود نہیں، جیسا کہ اس نے ہمیں اپنی ذات میں غور و فکر کرنے سے منع فرمایا۔ پس اہل نظر نے اس معاملے میں اس کی نافرمانی کی، ان میں سے جو خود کو اہل اللہ سمجھتے ہیں، جیسے قدماء اور دیگر متکلمین، اور بعض صوفیاء جیسے ابو حامد اور دیگر، ان کے گمان کردہ اور غیر گمان کردہ امور میں۔ اور انہوں نے ایسی چیزوں سے دلیلیں پکڑیں جو ان کے حق میں نہیں بلکہ ان کے خلاف ہیں۔ اور جب انہوں نے غور و فکر کو مکمل کر لیا تو عاجزی کا اقرار کیا۔ اگر وہاں حقیقی علم، سچا ایمان اور صدق ہوتا تو یہ پہلے قدم پر ہی ہوتا۔ پس انہوں نے اللہ کی حدود کو پار کیا جو سب سے بڑی حدود ہیں، اور اس تجاوز کو اللہ کا قرب سمجھا، حالانکہ وہ نہیں جانتے تھے کہ یہ اس سے دوری کا عین ہے۔ اور جب پردہ ہٹے گا تو ظاہر ہو جائے گا کہ کس نے دیا اور کس کو دیا گیا۔\n\nجب غبار چھٹے گا تو تم دیکھو گے\nکہ تمہارے نیچے گھوڑا ہے یا گدھا۔\n\nپس صورت تو گھوڑے کی ہے اور تجربہ گدھے کا۔ یہ ذکر اس کا ورد کرنے والے کو عظیم امید اور واضح کشف (الکشف) عطا کرتا ہے۔ اور وہ یہ ہے کہ اللہ تعالیٰ نے اس آیت میں مسلمانوں اور ان لوگوں کو مخاطب کیا جنہوں نے اللہ کا قرب حاصل کرنے کے لیے غیر اللہ کی عبادت کی، پس انہوں نے اللہ کے سوا کسی کی عبادت نہیں کی۔ جب انہوں نے کہا: \"ہم ان کی عبادت صرف اس لیے کرتے ہیں کہ وہ ہمیں اللہ کے قریب کر دیں\" (مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ)، تو انہوں نے تاکید کی اور وجہ بیان کی۔ پس اللہ نے ہم سے فرمایا: \"بیشک تمہارا معبود\" (إِنَّ إِلَٰهَكُمْ)، اور وہ معبود جس کا مشرک قرب چاہتا ہے اس کی عبادت کے ذریعے جس کے ساتھ اس نے شرک کیا، وہ ایک ہی ہے۔ گویا تم اس کی احدیت میں اختلاف نہیں کرتے۔ پس اس نے فرمایا: \"اور تمہارا معبود\" (وَإِلَٰهُكُمْ)، تو اس نے ہمیں اور انہیں جمع کیا، \"ایک ہی معبود ہے\" (إِلَٰهٌ وَاحِدٌ)۔ پس انہوں نے شرک نہیں کیا مگر اسی کے سبب سے جو ان کے نظر نے انہیں عطا کیا۔ اور جس نے کسی چیز کی خاطر قصد کیا، تو حقیقت میں وہی چیز مقصود ہوتی ہے نہ کہ وہ جو بظاہر مقصود نظر آئے۔ جیسا کہ کہا جاتا ہے کہ جس نے کسی غرض کے لیے تمہاری صحبت اختیار کی یا کسی غرض کے لیے تم سے محبت کی، تو وہ اس غرض کے ختم ہونے پر چلا گیا۔ اسی لیے اللہ نے ذکر کیا کہ وہ قیامت کے دن ان سے براءت کریں گے، اور انہوں نے یہ سب کچھ اپنے نفسوں کی طرف سے کیا، نہ کہ وہ اس میں اللہ کی قدر و منزلت سے ناواقف تھے۔ کیا تم نہیں دیکھتے کہ جب ذات حق (الحق) نے ان کی یہ حالت جانی تو کیسے فرمایا: \"اور تمہارا معبود ایک ہی معبود ہے\" (وَإِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ)۔ اور انہیں متنبہ کیا، پس فرمایا: \"کہو، ان کے نام لو\" (قُلْ سَمُّوهُمْ)، تو وہ انہیں ان ناموں سے یاد کرتے ہیں جو اللہ کے ناموں سے مختلف ہیں۔ پھر ان کے شرک کو اس طرح بیان کیا کہ \"وہ یقیناً دور کی گمراہی میں پڑ گئے ہیں\" (قَدْ ضَلُّوا ضَلَالًا بَعِيدًا) یا واضح گمراہی میں، کیونکہ انہوں نے خود کو حیرت میں ڈال دیا، اس لیے کہ انہوں نے ان چیزوں کی عبادت کی جنہیں اپنے ہاتھوں سے تراشا اور وہ جانتے تھے کہ وہ نہ سنتے ہیں، نہ دیکھتے ہیں (لَا يَسْمَعُ وَلَا يُبْصِرُ)، اور نہ ہی اللہ کے مقابلے میں ان کے کسی کام آ سکتے ہیں۔ پس یہ اللہ کی طرف سے ان کی نظر اور عقلوں کی کوتاہی کی گواہی ہے۔\n\nپھر اللہ نے ہمیں خبر دی کہ اس نے فیصلہ کر دیا ہے کہ ہم صرف اسی کی عبادت کریں، اس الوہیت (الألوهية) کی بنا پر جو انہوں نے ان (بتوں) سے منسوب کی، یعنی انہوں نے انہیں اللہ کے نائب اور وزیر بنا دیا، گویا اللہ نے انہیں اپنا خلیفہ بنایا ہے۔ اور خلیفہ کی عادت ہے کہ وہ مستخلف علیہ کے نزدیک اس کے مرتبے میں ہو جس نے اسے خلیفہ بنایا ہے۔ اسی لیے انہوں نے الوہیت (الألوهية) کو ان سے منسوب کیا، بغیر اس پر غور کیے کہ کس نے یہ سب بنایا ہے۔ اور جس نے کہا: \"کیا اس نے سب معبودوں کو ایک ہی معبود بنا دیا؟\" (أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا)، تو یہ صرف اس لیے تھا کہ وہ جن کی عبادت کرتے تھے، انہیں اللہ کے علاوہ معبود سمجھتے تھے، حالانکہ اللہ کی عظمت کا شہود (الشہود) ان سب کے نزدیک تھا۔ پس یہ قول اس بات سے مشابہ ہے جو صحیح شریعت میں ظہور الٰہی (التجلی) کے مختلف صورتوں میں ثابت ہے۔ اور جو اس کا مشاہدہ کرتا ہے، اسے معلوم ہے کہ صورت یہ صورت نہیں ہے، اور ہر صورت کے لیے مشاہدہ کرنے والا ضرور کہے گا کہ یہ اللہ ہے۔ لیکن چونکہ یہ (کعبہ کی طرف رخ کرنا) اللہ کی طرف سے تھا اور وہ دوسرا (بتوں کی طرف رخ کرنا) ان کی طرف سے تھا، اس لیے اللہ نے ان کے اس خود ساختہ حکم پر اعتراض کیا، جیسا کہ اللہ تعالیٰ کے اس قول میں ثابت ہے: \"پس تم جس طرف بھی رخ کرو گے، وہیں اللہ کا چہرہ ہے\" (فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ)۔ یہ ایک حقیقت ہے، پس اللہ کا چہرہ ہر اس سمت میں موجود ہے جس کی طرف کوئی رخ کرتا ہے۔ اس کے باوجود، اگر کوئی شخص نماز میں کعبہ کے علاوہ کسی اور سمت رخ کرے، حالانکہ وہ کعبہ کی سمت جانتا ہے، تو اس کی نماز قبول نہیں ہوگی، کیونکہ اس کے لیے صرف اسی خاص عبادت کے لیے اس خاص گھر کا استقبال مشروع کیا گیا ہے۔ لیکن اگر وہ اس عبادت کے علاوہ کسی اور عمل میں رخ کرے جو اس خاص سمت کے تعین کے بغیر صحیح نہیں ہوتی، تو اللہ اس رخ کرنے کو قبول فرماتا ہے۔ اسی طرح اگر وہ یہ اعتقاد رکھے کہ جس سمت بھی وہ رخ کرتا ہے، وہاں اللہ کا چہرہ نہیں ہے، تو وہ کافر اور جاہل ہوگا۔ اس کے باوجود، اس کے لیے جائز نہیں کہ وہ ان اعمال میں تجاوز کرے جہاں اللہ نے انہیں مشروع کیا ہے۔ اسی لیے شریعتیں مختلف ہوئیں، پس جو ایک شریعت میں حرام تھا، اللہ نے اسے دوسری شریعت میں حلال کر دیا، اور اس پہلے حکم کو اسی محکوم علیہ پر دوسرے حکم کے ذریعے منسوخ کر دیا۔ اللہ تعالیٰ نے فرمایا: \"تم میں سے ہر ایک کے لیے ہم نے ایک شریعت اور ایک طریقہ مقرر کیا\" (لِكُلٍّ جَعَلْنَا مِنْكُمْ شِرْعَةً وَمِنْهَاجًا)۔ پس جو شریعت منسوخ ہو گئی اور کسی نے اس کے منسوخ ہونے کے بعد بھی اس کی پیروی کی، تو اسے نفس کی خواہش (ہویٰ) کہا جاتا ہے، جس کے بارے میں اللہ نے داؤد کے خلیفہ سے فرمایا: \"بیشک ہم نے تمہیں زمین میں خلیفہ بنایا ہے، پس تم لوگوں کے درمیان حق کے ساتھ فیصلہ کرو\" (إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ)، یعنی وہ حق جو میں نے تم پر نازل کیا ہے، \"اور خواہش کی پیروی نہ کرنا\" (وَلَا تَتَّبِعِ الْهَوَىٰ)، یعنی جو تمہاری شریعت کے خلاف ہے، \"ورنہ وہ تمہیں اللہ کے راستے سے بھٹکا دے گی\" (فَيُضِلَّكَ عَنْ سَبِيلِ اللَّهِ)، یعنی وہ راستہ جو اللہ نے خاص طور پر تمہارے لیے مشروع کیا ہے۔\n\nپس جب تم یہ جان لو اور تمہارے نزدیک یہ بات مستحکم ہو جائے، تو تم جان لو گے کہ اللہ ہر شریعت میں ذات کے اعتبار سے ایک ہی معبود (الہٰ) ہے، اور صورت اور وجود کے اعتبار سے کثیر ہے۔ کیونکہ عقلی دلائل اس میں اپنے اختلاف کی وجہ سے اسے کثیر بناتے ہیں، اور وہ سب حق ہیں اور ان کے مدلولات سچے ہیں۔ اور صورتوں میں ظہور الٰہی (التجلی) بھی اپنے اختلاف کی وجہ سے اسے کثیر بناتا ہے، حالانکہ ذات ایک ہے۔ پس جب معاملہ ایسا ہے، تو تم کیا کرو گے یا میرے لیے کیسے صحیح ہو سکتا ہے کہ میں کسی کہنے والے کو غلط ٹھہراؤں؟ اسی لیے اس میں کسی کی غلطی صحیح نہیں ہوتی۔ غلطی صرف غیر کے اثبات میں ہے، اور وہ شریک کا قول ہے، جو کہ عدم (العدم) کا قول ہے۔ کیونکہ شریک وہاں موجود ہی نہیں ہے۔ اور اسی لیے اللہ اسے معاف نہیں کرتا، کیونکہ غفر (معافی) ستر (پردہ پوشی) ہے، اور پردہ پوشی صرف اس کی ہوتی ہے جس کا وجود ہو۔ اور شریک عدم (العدم) ہے، پس اس کی پردہ پوشی نہیں ہو سکتی۔ پس یہ ایک تحقیقی کلمہ ہے: \"بیشک اللہ اسے معاف نہیں کرتا کہ اس کے ساتھ شرک کیا جائے\" (إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ)، کیونکہ وہ اسے پاتا ہی نہیں ہے۔ اگر وہ اسے پاتا تو وہ صحیح ہوتا اور مغفرت کے لیے ایک ذات ہوتی جس سے وہ متعلق ہوتی۔ اور ہستی (الوجود) میں کوئی نہیں جو اضداد کو قبول کرے سوائے عالم کے، اس حیثیت سے کہ وہ واحد ہے۔ اور اسی واحد میں اضداد ظاہر ہوئے، اور وہ کچھ نہیں مگر عین ہستی (الوجود) میں ممکنات کی ذاتوں کے احکام ہیں، جن کے ظہور سے متضاد اسمائے الٰہیہ اور ان کی مثالیں معلوم ہوئیں۔ پس جب تم یہ جان لو، تو اس کے بعد جو چاہو کہو۔ یا تو اسماء کی کثرت نے احکام کی کثرت کو ظاہر کیا، یا احکام کی کثرت نے اسماء کی کثرت کو ظاہر کیا، یہ ایسا معاملہ ہے جس کا نہ عقل انکار کرتی ہے اور نہ شریعت۔ پس ہستی (الوجود) اس کی گواہی دیتی ہے۔ اور باقی صرف وہی ہے جو ہم نے ذکر کیا کہ حکم کس کی طرف منسوب کیا جائے، کیا اسمائے الٰہیہ کی طرف یا کونی ممکنات کی طرف؟ اور یہ دونوں ایک ہی ذات میں مربوط اور محکوم ہیں۔\n\nاے جاہلوں کی محرومی! ان سے کیا فوت ہو رہا ہے\nاور ان سے کیا فوت ہو رہا ہے جو اپنی جہالت سے کہتے ہیں؟\nمیں نے یہ بھی کہا اور وہ بھی کہا، کیونکہ میں\nاس وجہ سے کہ میں نے ان کے بارے میں کہا، ان کے اہل میں سے ہوں۔\n\nپس جس نے توحید بیان کی اس نے انصاف نہیں کیا، اور جس نے شرک کیا اس نے درست بات نہیں کی۔ وہ (اللہ) تعالیٰ واحد ہے، نہ کسی موحد کی توحید سے اور نہ اپنی ذات کے لیے اس کی توحید سے، کیونکہ وہ اپنی ذات کے لیے واحد ہے۔ پس نہ اس کی احدیت بنائی گئی ہے اور نہ اس کی کثرت کی احدیت مجہول ہے۔ اور وہاں عدم (العدم) اور ہستی (الوجود) کے سوا کچھ نہیں ہے۔ پس ہستی (الوجود) اس کے لیے ہے اور عدم (العدم) اس کے لیے نہیں ہے، لیکن اس کے لیے اعدام (عدم میں لانا) ہے۔ اور یہ نہیں کہا جائے گا کہ عدم (العدم) کسی اور کے لیے ہے، ورنہ تم اس ذات کو ثابت کر دو گے جس کی نفی کر رہے ہو۔ پس یہ لفظ میں تجاوز ہے۔ اور ہستی (الوجود) اور عدم (العدم) کے درمیان وہ ہے جو نہ ہستی (الوجود) سے متصف ہے اور نہ عدم (العدم) سے، اور وہ عالم ہے، جو عین ہستی (الوجود) کو احکام عطا کرتا ہے، اور عین شہود (الشہود) کو صورتیں عطا کرتا ہے، اور عقود کے دلائل کو مدلولات عطا کرتا ہے۔ پس وہ شاہد اور مشہود ہے، عقد کرنے والا اور معقود ہے، وجود بخشنے والا اور موجود ہے۔ اور وہاں کوئی گم شدہ چیز نہیں ہے۔ پس حدود ممتاز ہو گئیں، بلکہ ہر محدود کو ممتاز کر دیا گیا ہے۔ اور جس نے عدم (العدم) اور ہستی (الوجود) کو پہچانا، اس کے لیے محدود کے سوا کچھ نہیں ہے۔ اور \"اللہ حق فرماتا ہے اور وہی راستہ دکھاتا ہے\" (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب چهارصد و هفتاد و سوم در بیان حال قطبی که منزل او «و خدای شما خدایی است یگانه» (وَإِلهُكُمْ إِلهٌ واحِدٌ) بود.\n\nگروهی به توحید الهی قائلند *** و توحید کثیر همان هستی (الوجود) است\n\nو از اسمای حسنای او دانستیم *** که خداوند هر آنچه بخواهد انجام می‌دهد (يَفْعَلُ ما يُرِيدُ)\n\nپس اله با ما بود و ما در او بودیم *** او مولاست و ما بندگان او هستیم\n\n### [توحید در الوهیت]\n\nبدان، خداوند ما و تو را به روحی از جانب خود تأیید کند، که خداوند ما را به توحید خود در الوهیتش امر فرمود، که هیچ خدایی جز او نیست؛ همان‌گونه که ما را از تفکر در ذاتش نهی کرد. اما اهل نظر در این امر از کسانی که گمان می‌کنند از اهل الله هستند، مانند قدما و دیگر متکلمین و برخی صوفیه چون ابوحامد و غیر او، در آنچه پنهان داشته و آنچه پنهان نداشته، از این نهی سرپیچی کردند. و به اموری استدلال کردند که علیه خودشان بود نه به نفعشان. و پس از استیفای نظر، به عجز اقرار نمودند. اگر در آنجا علم و ایمان حق و صدق وجود داشت، این اقرار باید در همان قدم اول حاصل می‌شد. پس آنان از حدود الهی که بزرگترین حدود است، تجاوز کردند و این تجاوز را وسیله تقرب به او قرار دادند، در حالی که ندانستند این عین دوری از اوست. و هنگام کشف حجاب (کشف الغطاء) آشکار می‌شود که چه کسی بخشید و چه کسی بخشیده شد.\n\nبه زودی خواهی دید، آنگاه که غبار فرو نشیند *** آیا اسبی زیر توست یا خری\n\nپس صورت، صورت اسب است و تجربه، تجربه خر. این ذکر (آیه) به ذاکر خود امید بزرگی و فتحی آشکار (فتحاً مبيناً) می‌بخشد. و آن این است که خداوند متعال در این آیه، مسلمانان و کسانی را که غیر خدا را برای تقرب به خدا عبادت کردند، مورد خطاب قرار داد؛ پس آنان جز خدا را نپرستیدند. هنگامی که گفتند: ما آنها را نمی‌پرستیم مگر برای اینکه ما را به خداوند نزدیک گردانند (ما نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونا إِلَى الله زُلْفى‏)، تأکید کردند و علت را ذکر نمودند. پس خداوند به ما فرمود: همانا خدای شما (إِنَّ إِلهَكُمْ) – و خدایی که مشرک به واسطه عبادت این شریک، تقرب به او را می‌جوید – یگانه است (واحِدٌ). گویی شما در احدیت او اختلافی ندارید. پس فرمود: و خدای شما (وَإِلهُكُمْ)، و ما و ایشان را جمع کرد، خدایی است یگانه (إِلهٌ واحِدٌ). پس آنان شرک نورزیدند مگر به سبب او (حق) در آنچه نظرشان به ایشان عطا کرد. و هر کس به خاطر امری قصد کند، آن امر در حقیقت همان مقصود است، نه آنکه ظاهراً قصد شده است؛ چنانکه گفته می‌شود: هر کس به خاطر امری با تو مصاحبت کرد یا به خاطر امری تو را دوست داشت، با پایان یافتن آن امر، دوستی‌اش نیز پایان می‌یابد. به همین دلیل، خداوند ذکر کرد که آنان در روز قیامت از معبودان خود بیزاری می‌جویند. و آنان (مشرکان) این کار را تنها از نفس خود انجام دادند، نه اینکه قدر خدا را در این باره ندانستند. آیا نمی‌بینی که حق تعالی چون این را از آنان دانست، چگونه فرمود: و خدای شما خدایی است یگانه (وَإِلهُكُمْ إِلهٌ واحِدٌ)؟ و آنان را آگاه ساخت و فرمود: بگو آنها را نام ببرید (قُلْ سَمُّوهُمْ)؛ پس آنان را با نام‌هایی که مخالف اسمای خداست، یاد می‌کنند. سپس آنان را در شرکشان چنین وصف کرد که به راستی گمراهی دور و درازی گمراه شده‌اند (قَدْ ضَلُّوا ضَلالًا بَعِيداً) یا آشکار؛ زیرا خود را در حیرت افکندند، چون چیزی را پرستیدند که با دستان خود تراشیده بودند و می‌دانستند که نه می‌شنود و نه می‌بیند (لا يَسْمَعُ ولا يُبْصِرُ) و نه می‌تواند چیزی از عذاب خدا را از آنان دور کند. پس این شهادتی است از جانب خدا بر کوتاهی نظر و عقل آنان. سپس خداوند ما را آگاه ساخت که حکم کرده است که جز او را نپرستیم، به سبب آنچه آنان از الوهیت به معبودان خود نسبت دادند؛ یعنی آنان را به منزله نواب و وزرای خدا قرار دادند، گویی خداوند آنان را خلیفه خود ساخته است. و از عادت خلیفه این است که نزد کسی که بر او خلیفه شده، در رتبه کسی باشد که او را خلیفه کرده است. به همین دلیل، آنان الوهیت را به معبودان خود نسبت دادند، بدون توجه به اینکه چه کسی این را قرار داده است. و سخن کسی که گفت: آیا خدایان را خدایی یگانه قرار داده است؟ (أَ جَعَلَ الْآلِهَةَ إِلهاً واحِداً) تنها به دلیل اعتقادشان بود که آنچه می‌پرستند، خدایانی هستند پایین‌تر از خدایی که نزد آنان به عظمت بر همه مشهود است. پس این سخن شبیه چیزی است که در شریعت صحیح در مورد اختلاف صور در تجلی (التجلی) ثابت شده است. و نزد کسی که این را مشاهده می‌کند، معلوم است که صورت، این صورت نیست؛ و هر صورتی را مشاهده‌کننده ناگزیر می‌گوید که آن خداست. اما چون این (تجلی) از جانب خداست و آن دیگری (شرک) از جانب خودشان، خداوند بر این حکم کردنشان ایراد گرفت؛ چنانکه در قول خدای تعالی ثابت است: پس به هر سو رو کنید، آنجا وجه خداست (فَأَيْنَما تُوَلُّوا فَثَمَّ وَجْهُ الله). این یک حقیقت است؛ پس وجه خدا در هر جهتی که کسی رو کند، موجود است. با این حال، اگر انسان در نماز خود با علم به جهت کعبه، به غیر آن رو کند، نمازش پذیرفته نمی‌شود؛ زیرا برای او جز استقبال این خانه خاص برای این عبادت خاص تشریع نشده است. اما اگر در غیر این عبادت که جز با تعیین این جهت خاص صحیح نیست، رو کند، خداوند آن رو کردن را می‌پذیرد. همان‌گونه که اگر معتقد باشد که در هر جهتی که رو کند، وجه خدا در آن نیست، کافر و جاهل خواهد بود. با این وجود، او مجاز نیست که در اعمالی که خداوند تشریع کرده است، از حدود تجاوز کند. به همین دلیل، شرایع مختلف شده‌اند؛ آنچه در شریعتی حرام بود، خداوند در شریعت دیگری حلال کرد و آن حکم اول را در مورد آن محکوم‌علیه، با حکم دیگری در عین همان محکوم‌علیه نسخ نمود. خداوند متعال فرمود: برای هر یک از شما شریعت و راهی قرار دادیم (لِكُلٍّ جَعَلْنا مِنْكُمْ شِرْعَةً ومِنْهاجاً). پس آنچه از شریعتی نسخ شده و کسی پس از نسخ از آن پیروی کند، همان است که هوای نفس (هوى النفس) نامیده می‌شود؛ که خداوند در مورد خلیفه داوود فرمود: همانا ما تو را در زمین خلیفه قرار دادیم، پس میان مردم به حق داوری کن (إِنَّا جَعَلْناكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ) – یعنی حقی که بر تو نازل کردم – و از هوای نفس پیروی مکن (وَلا تَتَّبِعِ الْهَوى‏) – که همان چیزی است که مخالف شریعت توست – که تو را از راه خدا گمراه سازد (فَيُضِلَّكَ عَنْ سَبِيلِ الله) – که همان چیزی است که خداوند به طور خاص برای تو تشریع کرده است.\n\nپس اگر این را دانستی و نزد تو مقرر شد، خواهی دانست که خداوند در هر شریعتی، در عین (عيناً) واحد است، اما در صورت و کون (كوناً) کثیر است. زیرا ادله عقلی با اختلاف خود، او را تکثیر می‌کنند و همه آنها حق هستند و مدلولشان صدق است. و تجلی (التجلی) در صور نیز او را به دلیل اختلاف صور تکثیر می‌کند، در حالی که عین (ذات) یکی است. حال که امر چنین است، چه باید کرد یا چگونه برای من صحیح است که گوینده‌ای را تخطئه کنم؟ به همین دلیل، تخطئه هیچ کس در این باره صحیح نیست. بلکه خطا در اثبات غیر است، و آن همان قول به شریک است. و این قول به عدم است، زیرا شریکی در آنجا نیست. و به همین دلیل است که خداوند آن را نمی‌آمرزد؛ زیرا غفران (الغفر) به معنای پوشاندن (الستر) است و پوشاندن تنها برای چیزی است که وجود دارد (له وجود)، و شریک عدم است، پس پوشانده نمی‌شود. این کلامی تحقیقی است: همانا خداوند نمی‌آمرزد که به او شرک ورزیده شود (إِنَّ الله لا يَغْفِرُ أَنْ يُشْرَكَ به)، زیرا او شریک را نمی‌یابد. اگر او را می‌یافت، صحیح بود و غفران عینی می‌داشت که به آن تعلق گیرد. و در هستی (الوجود) کسی نیست که اضداد را بپذیرد، مگر عالم (العالم) از آن جهت که واحد است. و در این واحد است که اضداد ظاهر شده‌اند، در حالی که آنها چیزی نیستند جز احکام اعیان ممکنات در عین هستی (عين الوجود) که با ظهور آنها، اسمای الهی متضاد و امثال آنها دانسته شد. پس اگر این را دانستی، پس از آن هر چه می‌خواهی بگو. اما کثرت اسما، کثرت احکام را آشکار ساخت؛ و اما کثرت احکام، کثرت اسما را آشکار ساخت. این امری است که نه عقل آن را انکار می‌کند و نه شرع. و هستی (الوجود) بر آن گواهی می‌دهد. و تنها چیزی که باقی می‌ماند، همان است که ذکر کردیم: اینکه حکم به چه کسی نسبت داده می‌شود؟ آیا به اسمای الهی یا به ممکنات کونی؟ و این دو به هم مرتبطند و در یک عین بر آنها حکم شده است.\n\nای وای بر نادانان، چه چیزهایی را از دست می‌دهند *** و چه چیزهایی را گویندگان به جهلشان از دست می‌دهند\n\nمن این را گفتم و سپس آن را، زیرا من *** به خاطر آنچه در موردشان گفتم، از اهل آنان هستم\n\nپس هر کس توحید ورزید، انصاف نداد؛ و هر کس شرک ورزید، به صواب نرسید. او تعالی واحد است، نه به توحید توحیدکننده و نه به توحید خودش برای خودش، زیرا او به ذات خود واحد است. پس احدیت او مجعول نیست و احدیت کثرت او مجهول نیست. و در آنجا جز عدم و وجود نیست. پس وجود از آن اوست و عدم از آن او نیست، اما اعدام (نیست کردن‌ها) از آن اوست. و گفته نمی‌شود که عدم از آن غیر اوست، که در این صورت عین چیزی را که نفی می‌کنی، اثبات می‌کنی؛ پس در لفظ مسامحه می‌کنی. و آنچه میان وجود و عدم است، چیزی است که نه به وجود متصف می‌شود و نه به عدم، و آن همان عالم (العالم) است که احکام را به عین وجود و صور را به عین شهود (الشهود) و مدلولات را به ادله عقود عطا می‌کند. پس شاهد و مشهود، عاقد و معقود، و موجِد و موجود وجود دارد. و در آنجا امر مفقودی نیست. پس حدود متمایز شده‌اند، بلکه هر محدودی متمایز شده است. و برای کسی که عدم و وجود را بشناسد، جز محدود نیست. و خداوند حق را می‌گوید و اوست که راه را می‌نمایاند (وَالله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 2
}