{
  "id": 248,
  "title": {
    "ar": "الباب الثامن والأربعون ومائتان في الذوق",
    "en": "Chapter Two Hundred and Forty-Eight: Concerning Tasting (الذوق)",
    "ur": "۲۴۸ واں باب ذوق (الذوق) کے بیان میں",
    "fa": "باب دویست و چهل و هشتم در ذوق"
  },
  "content": {
    "ar": "## «الباب الثامن والأربعون ومائتان في الذوق»\n\n\n> لكل مبدأ مجلى في تجليه *** ذوق ينبئ عن معنى تخلية\n> إن التجلي بالأسماء يحكمها *** وذلك الحكم من أعلى توليه‏\n\n\n> إذا تدلى إلى أمر يعن له *** كان الدنو إلينا في تدليه‏\n\n\n> لما تلقاه قلبي في منازله *** كان الترقي به إلى تجليه‏\n\n\n### [أن الذوق أول مبادي التجلي وهو حال يفجأ العبد في قلبه‏]\n\n\nاعلم أن الذوق عند القوم أول مبادي التجلي وهو حال يفجأ العبد في قلبه فإن أقام نفسين فصاعدا كان شربا وهل بعد هذا الشرب رى أم لا فذوقهم في ذلك مختلف فيه وقد ذكر عن بعضهم أنه شرب فارتوى نقل عنه ذلك ونقل عن أبي يزيد أن الري محال وكل نطق بحاله ولكل صاحب قول وجه عندنا صحيح في الطريق وعندنا في هذه المسألة تفصيل يرد إن شاء الله فيما بعد في باب الشرب أو الري أو في باب عدم الري إن ذكرنيه الله فابحث عليه في آخر هذه الأبواب من هذا الكتاب‏\n\n\n### [أن لكل تجلى مبدأ]\n\n\nاعلم أن قولهم أول مبادئ التجلي إعلام أن لكل تجل مبدأ هو ذوق لذلك التجلي وهذا لا يكون إلا إذا كان التجلي الإلهي في الصور أو في الأسماء الإلهية أو الكونية ليس غير ذلك فإن كان التجلي في المعنى فعين مبدئه عينه ما له بعد المبدأ حكم يستفيده الإنسان بالتدريج كما يستفيد معاني تلك الصورة المتجلي فيها أو معاني الأسماء كلها كل اسم منها فيرى في المبدأ ما لا يراه من ذلك الاسم بعد ذلك وصاحب المعنى مبدأ كل شي‏ء عينه فلا يستفيد منه بعد هذه الإفادة الكلية فله التفصيل في التعبير عن ذلك الأمر الواحد وهو المراد بقولنا في صدر هذا الكتاب‏\n\n\n> حتى بدت للعين سبحة وجهه *** وإلى هلم لم تكن إلا هي‏\n\n\nفكان مبدؤها عينها وكل ما نأتي به بعد ذلك في جميع كلامنا إنما هو تفصيل لذلك الأمر الكلي تتضمنه تلك النظرة في تلك العين الواحدة وأكثر الناس على خلاف هذا الذوق ولهذا لا ينتظم كلامهم ويطلب الناظر فيه أصلا يرجع إليه جميع أقوالهم فلا يجد وكلامنا مرتبط بعضه بعضه لأنه عين واحدة وهذا تفصيلها ويعرف ما قلناه من يعرف مناسبة آي القرآن في نسق بعضها إلى بعض فيعرف الجامع بين الآيتين وإن كان بينهما بعد ظاهر فذلك صحيح ولكن لا بد من وجه جامع بين الأسين مناسب هو الذي أعطى أن تكون هذه الآية مناسبة لما جاورها من الآيات لأنه نظم إلهي وما رأينا أحدا ذهب إلى النظر في هذا إلا الرماني من النحويين فإن له تفسير للقرآن أخبرني من وقف عليه أنه نحا في القرآن هذا المنحى وما وقفت عليه لكني رأيت بمراكش ببلاد المغرب أبا العباس السبتي صاحب الصدقات يسلك هذا المسلك وفاوضته فيه وكان من أصحاب الموازين‏\n\n\n### [إن الأذواق يختلف باختلاف التجلي‏]\n\n\nثم اعلم أن الذوق يختلف باختلاف التجلي فإن كان التجلي في الصور فالذوق خيالي وإن كان في الأسماء الإلهية والكونية فالذوق عقلي فالذوق الخيالي أثره في النفس والذوق العقلي أثره في القلب فيعطي حكم أثر ذوق النفس المجاهدات البدنية من الجوع والعطش وقيام الليل وذكر اللسان والتلاوة والأمر بالمعروف والنهي عن المنكر والجهاد في سبيل الله ورمى ما تملكه اليدان كان وحده لا تكون له عائلة ولا شيخ فإن كان بين يدي شيخ معتبر يربيه فيرمي ما بيده بين يدي ذلك الشيخ ويخرج عنه بالكلية ظاهرا وباطنا ولا يبقى له ملكا وإن كره ذاك بباطنه لضعفه أو أدركته فيه مشقة فلا ينظر بإخراج ذلك من يده الالتذاذ بذلك بل إذا أخرجه عن مشقة أخرجه بنظر صحيح ثابت لا يتمكن له في نفسه إزالة ما نواه في ذلك وإذا أخرجه عن يده بلذة فما أخرجه بعقله فإن ارتفعت اللذة يمكن أن يدركه الندم بخلاف الكارة فإنه إذا أخرجه مع الكرة ثم بدا له في نفسه بالعناية الإلهية ما أزال الكرة عنه انتقل إلى حالة الالتذاذ بذلك فهو أثبت في المقام وهكذا كان خروجنا عما بأيدينا ولم يكن لنا شيخ نحكمه في ذلك ولا نرميه بين يديه فحكمنا فيه الوالد رحمه الله لما شاورناه في ذلك فإنا تركنا ما بأيدينا ولم نسند أمره إلى أحد لأنا لم نرجع على يد شيخ ولا كنت رأيت شيخا في الطريق بل خرجت عنه خروج الميت عن أهله وما له فلما شاورنا الوالد وطلب منا الأمر في ذلك حكمناه في ذلك ولم أسأل بعد ذلك ما صنع فيه إلى يومي هذا هذا ما يعطي حكم ذوق النفس ولا بد منه لكل طالب وأصله‏\n\n\nإتيان أبي بكر بجميع ما يملكه إلى النبي صلى الله عليه وسلم حين قال له ائتني بما عندك وأتاه عمر بشطر ماله فإنه صلى الله عليه وسلم ما حد لهم في ذلك ولو حد لهم في ذلك ما تعدى أحد منهم ما حده له رسول الله صلى الله عليه وسلم وإنما\nأراد صلى الله عليه وسلم أن تتميز مراتب القوم عندهم فقال لأبي بكر ما تركت لأهلك فقال الله ورسوله وهذا غاية الأدب حيث قال ورسوله فإنه لو قال الله لم يتمكن له أن يرجع في شي‏ء من ذلك إلا حتى يرده الله عليه من غير واسطة حالا وذوقا فلما علم ذلك قال ورسوله فلو رد إليه رسول الله صلى الله عليه وسلم من ماله شيئا قبله لأهله من رسول الله صلى الله عليه وسلم فإنه تركه لأهله فما حكم فيه إلا من استنابه رب المال فانظر ما أحكم هذا وما أشد معرفة أبي بكر بمراتب الأمور وتخيل عمر أنه يسبق أبا بكر في ذلك اليوم لأنه رأى إتيانه بشطر ماله عظيما ثم قال لعمر بن الخطاب ما تركت لأهلك قال شطر مالي فقال رسول الله صلى الله عليه وسلم بينكما ما بين كلمتيكما قال عمر فعلمت أني لا أسبق أبا بكر أبدا\n\n\nوالإنسان ينبغي أن يكون عالي الهمة يرغب في أعلى المراتب عند الله ويوفي كل مرتبة حقها فلم يرد رسول الله صلى الله عليه وسلم على أبي بكر شيئا من ماله تنبيها للحاضرين على ما علمه من صدق أبي بكر في ذلك فإن رسول الله صلى الله عليه وسلم قد علم منه الرفق والرحمة فلو رد شيئا من ذلك عليه تطرق الاحتمال في حق أبي بكر أنه خطر له رفق رسول الله صلى الله عليه وسلم فعوض رسول الله صلى الله عليه وسلم أهل أبي بكر بما يقتضيه نظره صلى الله عليه وسلم وجاءه عبد الرحمن بن عوف بجميع ماله فرده عليه كله وقال أمسك عليك مالك فإنه ما دعاه إلى ذلك ولو دعاه إلى ذلك لقبله منه كما قبله من أبي بكر ويعطي حكم ذوق العقل الرياضات النفسية وتهذيب الأخلاق فتتضمن الرياضة المجاهدات البدنية ولا تتضمن المجاهدة الرياضات والرياضات أتم في الحكم فإن النبي صلى الله عليه وسلم بعث ليتمم مكارم الأخلاق فمن جبل عليها فهو منور الذات مقدس ومن لم يجبل عليها فإن الرياضة تلحقه بها وتحكم عليه والرياضة تذليل الصعب من الأمور فمن ذلل صعبا فقد راضه وأزال عن النفس جموحها فإنها تحب الرئاسة والتقدم على أشكالها والرياضة تمنع النفس من هذا الخاطر وسلطانه ولا ترى لها شفوفا على غيرها لاشتراكها معهم في العبودية وإحاطة القبضة بالكل فبما ذا ترأس فتمتثل أمر الله من حيث إنها مخاطبة من عند الله بذلك وتود أن يكون كل مخاطب من العبيد مسارعا إلى امتثال أمر سيده إيثار الجنابة ما يخطر لها في المسارعة أن تسبق غيرها من النفوس فيكون لها بذلك مزية على غيرها لا يقتضي مقام الرياضة ذلك فإن الرياضة خروج عن الأغراض النفسية مطلقا من غير تقييد وأما الذوق الذي مبدؤه نفس عينه كما قدمنا فلا يحتاج إلى رياضة ولا مجاهدة فإن الرياضة لا تكون إلا في صعب الانقياد كثير الجموح أو منعوت بالجموح والمجاهدة إحساس بالمشقة وهذه العين التي ذكرناها ما تركت صعبا فتحكم عليه الرياضات فهو ذلول في نفسه أعطته ذلك مشاهدة تلك العين دفعة وأما الإحساس بالمشقات البدنية فذلك حس الطبع لا حس النفس فهو صاحب لذة في مشقة يحكم فيها بحكم ما عين الله له من الحقوق حيث‏\n\n\nقال له على لسان المبين عنه وهو رسول الله صلى الله عليه وسلم إن لعينك عليك حقا ولنفسك عليك حقا ولزورك عليك حقا ولأهلك عليك حقا فأعط كل ذي حق حقه‏\n\n\nفالذائق لهذه العين حكمه ما شرع له ليس له ولا عنده رياضة في قبول ذلك أصلا والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ والذوق يعطيك بعد ذلك التجلي العلم ومنه تحقيق ميزانه ومرتبته فيتأدب معه بما يستحقه في النظر إليه فإنه نظير العين فيما لا مساغ لها فيه وهو الذي يورث عندك الظماء إذا لم تكن مؤمنا فإن كنت مؤمنا فالإيمان يعطيك الظماء ويشتد عطشك ويقل على قدر إيمانك ومن ليس بمؤمن لا ظمأ عنده البتة لشرب التجلي وإن أدركه العطش للعلم فمن حيث النظر الفكري وأما لعلوم التجلي فليس إلا الايمان ولا يحصل إيمان إلا والظماء يصحبه فيزيد بالذوق فافهم‏\n\n",
    "en": "Chapter 248: Concerning Spiritual Taste (الذوق)\n\nFor every Origin (مبدأ), there is a manifestation in its Theophany (تجلي),\nA Spiritual Taste (ذوق) that informs of the meaning of purification (تخلية).\nIndeed, the Theophany governs by means of the Names (الأسماء),\nAnd that governance is from the highest authority that appoints it.\n\nWhen it descends to an affair that appears to it,\nThe nearness to us is in its descent.\n\nWhen my heart received it in its stations,\nThe ascent through it was toward its Theophany.\n\n### That Spiritual Taste is the first principle of Theophany and is a state that surprises the servant in his heart\n\nKnow that Spiritual Taste (الذوق), according to the People [Sufis], is the first of the principles of Theophany (التجلي). It is a state (حال) that suddenly overtakes the servant in his heart (قلبه). If he remains in it for two moments or more, it becomes Drinking (شرب). Is there Quenching (رى) after this Drinking or not? Their Spiritual Taste regarding this is a matter of disagreement. It has been reported concerning some of them that he drank and was quenched (ارتوى). This has been transmitted from him. It has also been transmitted from Abu Yazid [al-Bistami] that Quenching is impossible. Every utterance is according to the speaker’s state. For every proponent of a view, there is a valid perspective (وجه صحيح) in the Path (الطريق) according to us. We have a detailed explanation of this matter which will follow, God willing, in the chapter on Drinking or Quenching, or in the chapter on the Absence of Quenching, if God reminds me of it. Therefore, search for it at the end of these chapters of this book.\n\n### That every Theophany has an Origin\n\nKnow that their statement, \"the first principles of Theophany,\" is an announcement that every Theophany has an Origin (مبدأ) which is the Spiritual Taste (ذوق) of that Theophany. This only occurs if the Divine Theophany (التجلي الإلهي) is in forms (الصور) or in the Divine or Cosmic Names (الأسماء الإلهية أو الكونية), and nothing else. If the Theophany is in the Meaning (المعنى), then the essence of its Origin (عين مبدئه) is its very essence (عينه). It does not have a subsequent ruling after the Origin that the human being gains gradually, just as he gains the meanings of the form in which the Theophany occurs, or the meanings of all the Names—each Name individually. Thus, he sees in the Origin what he does not see later concerning that Name. But the possessor of the Meaning (صاحب المعنى)—the Origin of everything is its very essence—does not gain anything from it after this comprehensive benefit. For him, there is only the detailed expression concerning that Single Matter (الأمر الواحد). This is what we meant by our statement at the beginning of this book:\n\nUntil the glory of His Face (سبحة وجهه) appeared to the eye,\nAnd until now, it was nothing but It.\n\nThus, its Origin was its very essence. Everything we bring forth after that in all our discourse is merely a detailed explanation (تفصيل) of that Universal Matter (الأمر الكلي), which is contained within that single glance at that One Essence (تلك العين الواحدة). Most people are contrary to this Spiritual Taste, and this is why their discourse is not coherent. The observer seeks a principle (أصلا) to which all their statements can be traced back, but he finds none. Our discourse, however, is interconnected because it is a single essence, and this is its detailed explanation. What we have said is understood by whoever knows the coherence (مناسبة) of the verses (آي) of the Quran in their sequence, one to another. He will know the unifying element (الجامع) between the two verses, even if there is an apparent distance between them. That is correct, but there must be a unifying and appropriate aspect (وجه جامع) between the two foundations (الأسين) which dictates that this verse is coherent with the verses adjacent to it, because it is a Divine arrangement (نظم إلهي). We have not seen anyone who pursued this line of inquiry except Al-Rummani, one of the grammarians, for he has a commentary on the Quran. Someone who has seen it informed me that he followed this approach in the Quran, though I have not seen it myself. However, I saw in Marrakesh, in the lands of the Maghrib, Abu al-Abbas al-Sabti, the master of the charitable endowments (صاحب الصدقات), following this path. I discussed it with him, and he was one of the People of the Balances (أصحاب الموازين).\n\n### That Spiritual Tastes differ according to the difference in Theophany\n\nFurthermore, know that Spiritual Taste (الذوق) differs according to the difference in Theophany. If the Theophany is in forms (الصور), the Spiritual Taste is imaginative (خيالي). If it is in the Divine and Cosmic Names, the Spiritual Taste is intellectual (عقلي). The imaginative Spiritual Taste (الذوق الخيالي) has its effect upon the soul (النفس), while the intellectual Spiritual Taste (الذوق العقلي) has its effect upon the heart (القلب).\n\nThe ruling effect of the Spiritual Taste of the soul dictates physical strivings (المجاهدات البدنية), such as hunger, thirst, standing in prayer at night, remembrance by the tongue (ذكر اللسان), recitation (التلاوة), enjoining the right and forbidding the wrong, striving in the path of God (الجهاد في سبيل الله), and casting away whatever the two hands possess.\n\nIf he is alone and has no family or Shaykh, he does this alone. If he is under the guidance of a recognized Shaykh who trains him, he casts away what he possesses before that Shaykh and departs from it entirely, outwardly and inwardly, and retains no ownership. Even if he inwardly dislikes this due to his weakness or experiences hardship in it, he does not look upon the removal of that possession from his hand as a source of pleasure. Rather, if he removes it with difficulty, he removes it with a sound, firm perspective (نظر صحيح ثابت) that prevents him from inwardly undoing what he intended in that act. If he removes it from his hand with pleasure, then he has not removed it by his intellect ('aql). If the pleasure vanishes, regret may overtake him. This is contrary to the one who dislikes it: if he removes it despite his dislike, and then, through Divine Providence (العناية الإلهية), something appears within his soul that removes the dislike, he transitions to a state of finding pleasure in it, and thus he is more firmly established in the station (المقام).\n\nThis is how our own departure from what we possessed occurred. We did not have a Shaykh to rule over us in this matter, nor did we cast it before him. We appointed our father (may God have mercy on him) as the judge when we consulted him about it. We abandoned what we possessed and did not entrust its affair to anyone, because we had not returned to the hand of a Shaykh, nor had I seen a Shaykh on the Path. Rather, I departed from it as the dead depart from their family and wealth. When we consulted our father and sought his command in the matter, we appointed him as the judge, and I have not asked what he did with it since that day until now.\n\nThis is what the ruling effect of the Spiritual Taste of the soul dictates, and it is necessary for every seeker. Its origin is:\n\nThe bringing of everything Abu Bakr possessed to the Prophet (peace and blessings be upon him) when he said to him, \"Bring me what you have.\" And Umar brought half of his wealth. The Prophet (peace and blessings be upon him) did not set a limit for them in this. Had he set a limit, none of them would have exceeded what the Messenger of God (peace and blessings be upon him) limited for him. Rather, the Prophet (peace and blessings be upon him) desired that the ranks of the people be distinguished among themselves. He asked Abu Bakr, \"What have you left for your family?\" He replied, \"God and His Messenger.\" This is the ultimate courtesy (غاية الأدب), as he said, \"and His Messenger.\" For if he had only said \"God,\" he would not have been able to return to any part of it unless God returned it to him directly, as a state (حالا) and a Spiritual Taste (ذوقا), without intermediary. Since he knew this, he said, \"and His Messenger.\" Thus, if the Messenger of God (peace and blessings be upon him) returned any of his wealth to him, he would accept it for his family from the Messenger of God (peace and blessings be upon him), for he had left it for his family. He only appointed as judge the one whom the Lord of the wealth (رب المال) had deputized. Observe how sound this is, and how profound Abu Bakr’s knowledge of the levels of affairs was.\n\nUmar imagined that he would surpass Abu Bakr on that day because he considered his bringing half of his wealth to be a great thing. Then [the Prophet] said to Umar ibn al-Khattab, \"What have you left for your family?\" He said, \"Half of my wealth.\" The Messenger of God (peace and blessings be upon him) said, \"The difference between you is like the difference between your two words.\" Umar said, \"Then I knew that I would never surpass Abu Bakr.\"\n\nThe human being should be high-spirited (عالي الهمة), desiring the highest levels (أعلى المراتب) with God, and giving every level its due right. The Messenger of God (peace and blessings be upon him) did not return anything of his wealth to Abu Bakr, alerting those present to what he knew of Abu Bakr’s sincerity in that matter. For the Messenger of God (peace and blessings be upon him) knew his gentleness and mercy. If he had returned anything of it to him, the possibility would have arisen concerning Abu Bakr that the Prophet’s gentleness had occurred to him [as a motive]. Thus, the Messenger of God (peace and blessings be upon him) compensated Abu Bakr’s family according to his (the Prophet’s) own judgment.\n\nAbd al-Rahman ibn Awf came with all his wealth, but [the Prophet] returned all of it to him and said, \"Keep your wealth.\" This was because he had not been called to do that. Had he been called to do that, he would have accepted it from him just as he accepted it from Abu Bakr.\n\nThe ruling effect of the Spiritual Taste of the intellect (ذوق العقل) dictates the disciplines of the soul (الرياضات النفسية) and the refinement of character (تهذيب الأخلاق). Spiritual Discipline (الرياضة) encompasses physical strivings (المجاهدات البدنية), but Striving (المجاهدة) does not encompass Spiritual Discipline. Spiritual Discipline is more complete in its ruling.\n\nIndeed, the Prophet (peace and blessings be upon him) was sent to perfect noble character (مكارم الأخلاق). Whoever is naturally disposed to it is illuminated in Essence (منور الذات) and sanctified. Whoever is not naturally disposed to it, Spiritual Discipline brings him to it and governs him. Spiritual Discipline is the taming of difficult matters (تذليل الصعب من الأمور). Whoever tames a difficulty has disciplined it (راضه) and removed the soul’s obstinacy (جموحها). For the soul loves leadership (الرئاسة) and precedence over its peers. Spiritual Discipline prevents the soul from this thought and its dominion. It does not see itself as superior (شفوفا) to others, due to its shared servitude (العبودية) with them and the encompassing grasp (إحاطة القبضة) over all. By what, then, should it lead?\n\nThus, it complies with God’s command because it is addressed by God concerning it. It desires that every servant addressed should hasten to comply with his Master’s command, preferring the avoidance of sin (إيثار الجنابة). It does not occur to it, in its haste, to surpass other souls so that it might gain an advantage (مزية) over them. The station of Spiritual Discipline does not require that, for Spiritual Discipline is an absolute departure from the soul’s aims (الأغراض النفسية), without restriction.\n\nAs for the Spiritual Taste whose Origin is its very essence (نفس عينه), as we previously stated, it requires neither Spiritual Discipline nor Striving. Spiritual Discipline only occurs in matters that are difficult to obey, highly obstinate, or described by obstinacy. Striving is the feeling of hardship (إحساس بالمشقة). This Essence (العين) we mentioned has left no difficulty untamed for Spiritual Disciplines to govern it; rather, it is inherently docile (ذلول في نفسه). The witnessing of that Essence granted it this docility instantly.\n\nAs for the feeling of physical hardships, that is the feeling of nature (حس الطبع), not the feeling of the soul (حس النفس). The possessor of this state finds pleasure in hardship, ruling according to the rights God has appointed for him, as He said to him through the tongue of the one who clarifies for Him—the Messenger of God (peace and blessings be upon him): \"Indeed, your eye has a right over you, your soul has a right over you, your visitor has a right over you, and your family has a right over you, so give every possessor of a right his due right.\"\n\nThe ruling of the one who tastes this Essence (الذائق لهذه العين) is what has been legislated for him. He has no Spiritual Discipline (رياضة) whatsoever in accepting that. <<وَاللهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way).\n\nSpiritual Taste subsequently grants you Knowledge ('Ilm) after the Theophany, and from that Knowledge comes the realization of its measure and its level (مرتبته). Thus, one behaves courteously with it according to what it deserves in the contemplation of it. For it is the counterpart of the Essence (نظير العين) in that which is not permissible for it.\n\nIt is this [Spiritual Taste] that causes thirst (الظمأ) within you if you are not a believer. If you are a believer, faith (الإيمان) grants you thirst, and your thirst intensifies or diminishes according to the measure of your faith. He who is not a believer has no thirst whatsoever for the drinking of Theophany, even if thirst for knowledge overtakes him, it is only from the perspective of intellectual speculation (النظر الفكري). But for the sciences of Theophany (علوم التجلي), nothing avails but faith, and faith is not attained unless thirst accompanies it, and that thirst increases through Spiritual Taste. Understand this.",
    "ur": "باب نمبر دو سو اڑتالیس: ذوق (Al-Dhawq) کے بیان میں\n\nہر مبدأ کے لیے اس کے ظہور الٰہی (التجلی) میں ایک جلوہ ہے،\nایک ذوق (Al-Dhawq) جو تصفیہ کے معنی کی خبر دیتا ہے۔\nبے شک ظہور الٰہی (التجلی) اسماء کے ذریعے ان پر حکم فرماتا ہے،\nاور وہ حکم اعلیٰ ترین مقام سے اس کی ولایت کرتا ہے۔\n\nجب وہ کسی ایسے امر کی طرف نزول کرتا ہے جو اس کے لیے ظاہر ہوتا ہے،\nتو اس کے نزول میں ہماری طرف قربت ہوتی ہے۔\nجب میرے قلب نے اسے اس کی منزلوں میں پایا،\nتو اس کے ذریعے ظہور الٰہی (التجلی) کی طرف عروج حاصل ہوا۔\n\n[کہ ذوق (Al-Dhawq) ظہور الٰہی (التجلی) کے اولین مبادی میں سے ہے اور یہ ایک ایسا حال (Al-Ḥāl) ہے جو بندے کے قلب پر اچانک وارد ہوتا ہے]\n\nجان لو کہ اہل تصوف کے نزدیک ذوق (Al-Dhawq) ظہور الٰہی (التجلی) کے اولین مبادی میں سے ہے، اور یہ ایک ایسا حال (Al-Ḥāl) ہے جو بندے کے قلب پر اچانک وارد ہوتا ہے۔ اگر یہ دو سانس یا اس سے زیادہ قائم رہے تو یہ شرب (Al-Shurb) بن جاتا ہے۔ اور کیا اس شرب کے بعد سیرابی (Al-Riyy) ہے یا نہیں؟ اس بارے میں ان کا ذوق (Al-Dhawq) مختلف ہے۔ بعض کے بارے میں ذکر کیا گیا ہے کہ انہوں نے شرب کیا اور سیراب ہو گئے، یہ ان سے منقول ہے۔ اور ابو یزید (بسطامی) سے منقول ہے کہ سیرابی (Al-Riyy) محال ہے۔ اور ہر ایک کا قول اس کے حال (Al-Ḥāl) کے مطابق ہے۔ اور ہر صاحبِ قول کے لیے ہمارے نزدیک طریق میں ایک صحیح پہلو ہے۔ اور ہمارے پاس اس مسئلے میں ایک تفصیل ہے جو ان شاء اللہ بعد میں باب الشرب (Al-Shurb) یا سیرابی (Al-Riyy) میں، یا باب عدم سیرابی میں آئے گی، اگر اللہ نے مجھے یاد دلایا، تو اسے اس کتاب کے آخری ابواب میں تلاش کرنا۔\n\n[کہ ہر ظہور الٰہی (التجلی) کے لیے ایک مبدأ (Al-Mabda') ہے]\n\nجان لو کہ ان کا یہ قول کہ \"ظہور الٰہی (التجلی) کے اولین مبادی\" اس بات کا اعلان ہے کہ ہر ظہور الٰہی (التجلی) کے لیے ایک مبدأ (Al-Mabda') ہے جو اس ظہور الٰہی (التجلی) کا ذوق (Al-Dhawq) ہے۔ اور یہ صرف اسی صورت میں ہوتا ہے جب ظہور الٰہی (التجلی) صورتوں میں ہو، یا اسماء الٰہیہ (Al-Asmā’ al-Ilāhiyya) یا اسماء کونیہ (Al-Asmā’ al-Kawniyya) میں ہو۔ اس کے علاوہ نہیں۔ لیکن اگر ظہور الٰہی (التجلی) معنی (Al-Ma‘nā) میں ہو، تو اس کا مبدأ (Al-Mabda') عین وہی ہے، اس کے لیے مبدأ کے بعد کوئی ایسا حکم نہیں ہوتا جسے انسان تدریجاً حاصل کرے، جیسا کہ وہ اس صورت کے معانی حاصل کرتا ہے جس میں ظہور الٰہی (التجلی) ہوا ہے، یا تمام اسماء کے معانی حاصل کرتا ہے، ہر اسم کا۔ چنانچہ وہ مبدأ میں وہ دیکھتا ہے جو اس اسم سے بعد میں نہیں دیکھتا۔ اور صاحبِ معنی (Al-Ma‘nā) کے لیے ہر شے کا مبدأ (Al-Mabda') عین وہی ہے، لہٰذا وہ اس کلی افادہ کے بعد اس سے مزید کچھ حاصل نہیں کرتا۔ پس اس کے لیے اس ایک امر کی تعبیر میں تفصیل ہے، اور یہی مراد ہے ہمارے اس قول سے جو اس کتاب کے آغاز میں ہے:\n\nیہاں تک کہ آنکھ کے لیے اس کے چہرے کی سبحت (نورانیت) ظاہر ہو گئی،\nاور اس کے بعد وہ اس کے سوا کچھ نہ تھی۔\n\nپس اس کا مبدأ (Al-Mabda') عین وہی تھا۔ اور اس کے بعد ہم اپنے تمام کلام میں جو کچھ بھی لاتے ہیں، وہ صرف اسی کلی امر کی تفصیل ہے جو اس ایک عین (ذات) میں اس ایک نظر میں شامل ہے۔ اور اکثر لوگ اس ذوق (Al-Dhawq) کے خلاف ہیں، اسی لیے ان کا کلام منظم نہیں ہوتا، اور جو شخص اس میں غور کرتا ہے وہ کوئی ایسی اصل تلاش کرتا ہے جس کی طرف ان کے تمام اقوال لوٹیں، لیکن وہ نہیں پاتا۔ اور ہمارا کلام ایک دوسرے سے مربوط ہے کیونکہ یہ ایک ہی عین (ذات) ہے اور یہ اس کی تفصیل ہے۔ جو شخص قرآن کی آیات کی ایک دوسرے کے ساتھ ترتیب میں مناسبت کو جانتا ہے، وہ ہماری بات کو پہچان لے گا، اور وہ دو آیات کے درمیان جامع کو جان لے گا، اگرچہ ان کے درمیان ظاہری دوری ہو۔ یہ صحیح ہے، لیکن دو بنیادوں کے درمیان ایک مناسب جامع پہلو کا ہونا ضروری ہے، جس نے یہ عطا کیا کہ یہ آیت اپنے پڑوس کی آیات کے لیے مناسب ہو، کیونکہ یہ ایک الٰہی نظم ہے۔ اور ہم نے کسی کو نہیں دیکھا جس نے اس پر غور کیا ہو سوائے نحویوں میں سے رمانی کے، کیونکہ ان کی ایک تفسیر قرآن کی ہے، جس پر مطلع ہونے والے نے مجھے بتایا کہ انہوں نے قرآن میں یہی طریقہ اختیار کیا ہے۔ میں خود اس پر مطلع نہیں ہو سکا، لیکن میں نے مراکش کے شہروں میں ابو العباس السبتی، صاحب الصدقات کو دیکھا کہ وہ اسی مسلک پر چلتے تھے، اور میں نے ان سے اس بارے میں گفتگو کی، اور وہ اصحاب الموازین (توازن رکھنے والوں) میں سے تھے۔\n\n[بے شک اذواق (Al-Adhwāq) ظہور الٰہی (التجلی) کے اختلاف سے مختلف ہوتے ہیں]\n\nپھر جان لو کہ ذوق (Al-Dhawq) ظہور الٰہی (التجلی) کے اختلاف سے مختلف ہوتا ہے۔ اگر ظہور الٰہی (التجلی) صورتوں میں ہو تو ذوق (Al-Dhawq) خیالی ہوتا ہے، اور اگر اسماء الٰہیہ (Al-Asmā’ al-Ilāhiyya) اور اسماء کونیہ (Al-Asmā’ al-Kawniyya) میں ہو تو ذوق (Al-Dhawq) عقلی ہوتا ہے۔ خیالی ذوق (Al-Dhawq) کا اثر نفس (Al-Nafs) پر ہوتا ہے، اور عقلی ذوق (Al-Dhawq) کا اثر قلب (Al-Qalb) پر ہوتا ہے۔ پس نفس (Al-Nafs) کے ذوق (Al-Dhawq) کا اثر بدنی مجاہدات (Al-Mujāhadāt) کا حکم دیتا ہے، جیسے بھوک، پیاس، رات کا قیام، زبان کا ذکر، تلاوت، امر بالمعروف، نہی عن المنکر، اور اللہ کی راہ میں جہاد، اور جو کچھ دونوں ہاتھوں کی ملکیت میں ہو اسے پھینک دینا۔ اگر وہ اکیلا ہو، اس کا کوئی خاندان یا شیخ نہ ہو، اور اگر وہ کسی معتبر شیخ کے سامنے ہو جو اس کی تربیت کرتا ہو، تو وہ اپنی ملکیت اس شیخ کے سامنے پھینک دے گا اور ظاہراً و باطناً کلی طور پر اس سے نکل جائے گا، اور اس کی کوئی ملکیت باقی نہیں رہے گی، اگرچہ وہ باطنی طور پر اپنی کمزوری کی وجہ سے اسے ناپسند کرے یا اس میں مشقت محسوس کرے۔ پس وہ اسے اپنے ہاتھ سے نکالنے میں لذت کو نہیں دیکھے گا، بلکہ جب وہ اسے مشقت کے ساتھ نکالے گا تو اسے ایک صحیح اور ثابت نظر کے ساتھ نکالے گا، جس میں اس کے لیے اپنے نفس میں اس نیت کو زائل کرنا ممکن نہ ہو۔ اور اگر وہ اسے لذت کے ساتھ اپنے ہاتھ سے نکالے تو اس نے اسے اپنی عقل (Al-Aql) سے نہیں نکالا، پس اگر لذت ختم ہو جائے تو اسے ندامت ہو سکتی ہے۔ اس کے برعکس جو ناپسندیدگی کے ساتھ نکالتا ہے، وہ جب ناپسندیدگی کے ساتھ نکالتا ہے، پھر اگر اس کے نفس میں عنایت الٰہیہ سے کوئی ایسی چیز ظاہر ہو جو اس ناپسندیدگی کو زائل کر دے، تو وہ اس سے لذت کی حالت کی طرف منتقل ہو جاتا ہے، پس وہ مقام میں زیادہ ثابت قدم ہوتا ہے۔ اور اسی طرح ہمارا اپنی ملکیت سے نکلنا ہوا، اور ہمارا کوئی ایسا شیخ نہیں تھا جسے ہم اس میں حاکم بناتے یا اس کے سامنے پھینکتے، پس جب ہم نے والد مرحوم سے اس بارے میں مشورہ کیا تو ہم نے انہیں اس میں حاکم بنا دیا۔ ہم نے اپنی ملکیت چھوڑ دی اور اس کا معاملہ کسی کے سپرد نہیں کیا، کیونکہ ہم نے کسی شیخ کے ہاتھ پر رجوع نہیں کیا تھا اور نہ ہی میں نے طریق میں کوئی شیخ دیکھا تھا۔ بلکہ میں اس سے ایسے نکلا جیسے میت اپنے اہل و مال سے نکلتی ہے۔ جب ہم نے والد سے مشورہ کیا اور انہوں نے ہم سے اس معاملے میں حکم طلب کیا تو ہم نے انہیں اس میں حاکم بنا دیا، اور میں نے آج تک یہ نہیں پوچھا کہ انہوں نے اس کا کیا کیا۔ یہ وہ ہے جو نفس (Al-Nafs) کے ذوق (Al-Dhawq) کا حکم دیتا ہے، اور ہر طالب کے لیے یہ ضروری ہے، اور اس کی اصل یہ ہے:\n\nحضرت ابوبکر (رضی اللہ عنہ) کا اپنی تمام ملکیت نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں لانا، جب آپ صلی اللہ علیہ وسلم نے ان سے فرمایا: \"جو کچھ تمہارے پاس ہے لے آؤ۔\" اور حضرت عمر (رضی اللہ عنہ) اپنا آدھا مال لائے۔ بے شک آپ صلی اللہ علیہ وسلم نے ان کے لیے اس میں کوئی حد مقرر نہیں کی تھی، اور اگر آپ صلی اللہ علیہ وسلم ان کے لیے حد مقرر کر دیتے تو ان میں سے کوئی بھی اس حد سے تجاوز نہ کرتا جو رسول اللہ صلی اللہ علیہ وسلم نے ان کے لیے مقرر کی تھی۔ آپ صلی اللہ علیہ وسلم کا مقصد یہ تھا کہ ان کے مراتب ان کے سامنے ممتاز ہو جائیں۔ پس آپ صلی اللہ علیہ وسلم نے ابوبکر (رضی اللہ عنہ) سے پوچھا: \"تم نے اپنے اہل و عیال کے لیے کیا چھوڑا؟\" انہوں نے عرض کیا: \"اللہ اور اس کا رسول۔\" اور یہ انتہائی ادب ہے کہ انہوں نے \"اور اس کا رسول\" کہا۔ کیونکہ اگر وہ صرف \"اللہ\" کہتے تو ان کے لیے اس میں سے کسی چیز کی طرف رجوع کرنا ممکن نہ ہوتا، مگر یہ کہ اللہ تعالیٰ اسے بغیر کسی واسطے کے، حال (Al-Ḥāl) اور ذوق (Al-Dhawq) کے ذریعے ان پر واپس کر دیتا۔ جب انہوں نے یہ جان لیا تو \"اور اس کا رسول\" کہا۔ پس اگر رسول اللہ صلی اللہ علیہ وسلم ان کے مال میں سے کوئی چیز انہیں واپس کر دیتے تو وہ اسے رسول اللہ صلی اللہ علیہ وسلم کی طرف سے اپنے اہل و عیال کے لیے قبول کر لیتے، کیونکہ انہوں نے اسے اپنے اہل و عیال کے لیے چھوڑا تھا۔ پس اس میں صرف اسی نے حکم دیا جسے رب المال (مالک) نے اپنا نائب بنایا۔ پس دیکھو یہ کتنا حکیمانہ ہے اور ابوبکر (رضی اللہ عنہ) کو امور کے مراتب کی کتنی شدید معرفت تھی۔ اور حضرت عمر (رضی اللہ عنہ) نے خیال کیا کہ وہ اس دن ابوبکر (رضی اللہ عنہ) سے سبقت لے جائیں گے، کیونکہ انہوں نے اپنا آدھا مال لانا بہت بڑا کام سمجھا۔ پھر آپ صلی اللہ علیہ وسلم نے عمر بن خطاب (رضی اللہ عنہ) سے پوچھا: \"تم نے اپنے اہل و عیال کے لیے کیا چھوڑا؟\" انہوں نے عرض کیا: \"میرا آدھا مال۔\" تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"تم دونوں کے درمیان وہی فرق ہے جو تمہارے دو کلمات کے درمیان ہے۔\" عمر (رضی اللہ عنہ) نے کہا: \"تب میں جان گیا کہ میں ابوبکر (رضی اللہ عنہ) سے کبھی سبقت نہیں لے جا سکتا۔\"\n\nاور انسان کو چاہیے کہ وہ بلند ہمت ہو، اللہ کے ہاں اعلیٰ مراتب کی رغبت رکھے اور ہر مرتبے کا حق ادا کرے۔ پس رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر (رضی اللہ عنہ) کا کوئی مال واپس نہیں کیا، تاکہ حاضرین کو اس سچائی پر متنبہ کریں جو آپ صلی اللہ علیہ وسلم ابوبکر (رضی اللہ عنہ) کے بارے میں جانتے تھے۔ بے شک رسول اللہ صلی اللہ علیہ وسلم ان سے نرمی اور رحمت کا علم رکھتے تھے۔ اگر آپ صلی اللہ علیہ وسلم اس میں سے کچھ واپس کر دیتے تو ابوبکر (رضی اللہ عنہ) کے حق میں یہ احتمال پیدا ہو جاتا کہ ان کے دل میں رسول اللہ صلی اللہ علیہ وسلم کی نرمی کا خیال آیا تھا۔ پس رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر (رضی اللہ عنہ) کے اہل و عیال کو اس چیز سے نوازا جو آپ صلی اللہ علیہ وسلم کی نظر کے مطابق تھا۔ اور عبدالرحمن بن عوف (رضی اللہ عنہ) اپنا تمام مال لے کر آئے تو آپ صلی اللہ علیہ وسلم نے وہ سب انہیں واپس کر دیا اور فرمایا: \"اپنا مال اپنے پاس رکھو۔\" کیونکہ آپ صلی اللہ علیہ وسلم نے انہیں اس کی دعوت نہیں دی تھی۔ اور اگر آپ صلی اللہ علیہ وسلم انہیں اس کی دعوت دیتے تو آپ صلی اللہ علیہ وسلم اسے ان سے قبول کر لیتے جیسا کہ ابوبکر (رضی اللہ عنہ) سے قبول کیا۔ اور عقلی ذوق (Al-Dhawq) نفسانی ریاضتیں (Al-Riyāḍāt) اور اخلاق کی تہذیب کا حکم دیتا ہے۔ پس ریاضت (Al-Riyāḍa) میں بدنی مجاہدات (Al-Mujāhadāt) شامل ہوتی ہیں، لیکن مجاہدہ (Al-Mujāhada) میں ریاضتیں شامل نہیں ہوتیں۔ اور ریاضتیں حکم میں زیادہ کامل ہیں۔ بے شک نبی اکرم صلی اللہ علیہ وسلم مکارم اخلاق کی تکمیل کے لیے مبعوث ہوئے تھے۔ پس جو شخص ان پر فطری طور پر پیدا ہوا ہے، وہ منور الذات اور مقدس ہے، اور جو ان پر فطری طور پر پیدا نہیں ہوا، تو ریاضت (Al-Riyāḍa) اسے ان سے ملا دیتی ہے اور اس پر حکم کرتی ہے۔ اور ریاضت (Al-Riyāḍa) مشکل امور کو رام کرنا ہے۔ پس جس نے کسی مشکل کو رام کیا، اس نے اس کی ریاضت کی اور نفس (Al-Nafs) سے اس کی سرکشی کو دور کر دیا، کیونکہ نفس (Al-Nafs) اپنے ہم شکلوں پر سرداری اور سبقت کو پسند کرتا ہے۔ اور ریاضت (Al-Riyāḍa) نفس (Al-Nafs) کو اس خیال اور اس کے تسلط سے روکتی ہے، اور وہ اپنے لیے دوسروں پر کوئی برتری نہیں دیکھتی، کیونکہ وہ ان کے ساتھ عبودیت میں شریک ہے اور قبضۂ الٰہی سب کو محیط ہے۔ پس وہ کس چیز سے سرداری کرے؟ پس وہ اللہ کے حکم کی تعمیل کرتی ہے اس حیثیت سے کہ اسے اللہ کی طرف سے اس کا مخاطب بنایا گیا ہے، اور وہ چاہتی ہے کہ ہر مخاطب بندہ اپنے آقا کے حکم کی تعمیل میں جلدی کرے، اس اجتناب کو ترجیح دیتے ہوئے کہ جلدی کرنے میں اسے دوسرے نفوس پر سبقت حاصل ہو، جس سے اسے دوسروں پر کوئی فضیلت حاصل ہو جائے۔ مقامِ ریاضت (Al-Riyāḍa) اس کا تقاضا نہیں کرتا، کیونکہ ریاضت (Al-Riyāḍa) مطلقاً اور بغیر کسی قید کے نفسانی اغراض سے نکل جانا ہے۔ اور رہا وہ ذوق (Al-Dhawq) جس کا مبدأ (Al-Mabda') عین وہی ہے جیسا کہ ہم نے پہلے بیان کیا، تو اسے نہ ریاضت (Al-Riyāḍa) کی ضرورت ہے اور نہ مجاہدہ (Al-Mujāhada) کی۔ کیونکہ ریاضت (Al-Riyāḍa) صرف مشکل سے فرمانبردار ہونے والے، بہت سرکش، یا سرکشی سے موصوف میں ہوتی ہے۔ اور مجاہدہ (Al-Mujāhada) مشقت کا احساس ہے۔ اور یہ عین (ذات) جس کا ہم نے ذکر کیا، اس نے کوئی مشکل نہیں چھوڑی جس پر ریاضتیں حکم کریں، پس وہ اپنے نفس میں رام ہے، یہ اسے اس ایک عین (ذات) کے مشاہدے نے یکبارگی عطا کر دیا ہے۔ اور رہا بدنی مشقتوں کا احساس، تو وہ طبع کا احساس ہے نہ کہ نفس (Al-Nafs) کا احساس۔ پس وہ مشقت میں لذت کا مالک ہے، جس میں وہ اس حکم کے مطابق فیصلہ کرتا ہے جو اللہ نے اس کے لیے حقوق مقرر کیے ہیں، جہاں:\n\nآپ صلی اللہ علیہ وسلم نے، جو اللہ کی طرف سے بیان کرنے والے ہیں، اس کی زبان پر فرمایا: \"بے شک تمہاری آنکھ کا تم پر حق ہے، اور تمہارے نفس (Al-Nafs) کا تم پر حق ہے، اور تمہارے مہمان کا تم پر حق ہے، اور تمہارے اہل و عیال کا تم پر حق ہے، پس ہر حقدار کو اس کا حق دو۔\"\n\nپس اس عین (ذات) کا ذوق (Al-Dhawq) رکھنے والے کا حکم وہی ہے جو اس کے لیے مشروع کیا گیا ہے، اس کے لیے یا اس کے پاس اسے قبول کرنے میں کوئی ریاضت (Al-Riyāḍa) نہیں ہے۔ اور اللہ تعالیٰ حق (Al-Ḥaqq) فرماتا ہے اور وہی راہ دکھاتا ہے۔ اور ذوق (Al-Dhawq) اس ظہور الٰہی (التجلی) کے بعد تمہیں علم عطا کرتا ہے، اور اس سے اس کے میزان اور مرتبے کی تحقیق ہوتی ہے، پس وہ اس کے ساتھ اس طرح ادب اختیار کرتا ہے جس کا وہ اس کی طرف دیکھنے میں مستحق ہے۔ کیونکہ یہ اس عین (ذات) کا نظیر ہے جس میں اس کے لیے کوئی گنجائش نہیں ہے۔ اور یہی وہ چیز ہے جو تمہارے اندر پیاس (ظمأ) پیدا کرتی ہے اگر تم مومن نہ ہو، لیکن اگر تم مومن ہو تو ایمان تمہیں پیاس عطا کرتا ہے، اور تمہاری پیاس تمہارے ایمان کے مطابق بڑھتی یا کم ہوتی ہے۔ اور جو مومن نہیں ہے، اس کے پاس ظہور الٰہی (التجلی) کے شرب (Al-Shurb) کے لیے بالکل کوئی پیاس نہیں ہوتی۔ اور اگر اسے علم کی پیاس محسوس ہو بھی تو وہ فکری نظر کی وجہ سے ہوتی ہے۔ لیکن ظہور الٰہی (التجلی) کے علوم کے لیے ایمان کے سوا کچھ نہیں، اور ایمان حاصل نہیں ہوتا مگر یہ کہ پیاس اس کے ساتھ ہو، جو ذوق (Al-Dhawq) سے بڑھتی ہے۔ پس سمجھ لو۔",
    "fa": "باب دویست و چهل و هشتم در ذوق\n\nبرای هر مبدئی، در تجلی‌اش، جلوه‌ای است *** که ذوقی است و از معنای تخلیه (تخلية) خبر می‌دهد\nهمانا تجلی (التجلی) با اسماء بر آن‌ها حکم می‌راند *** و آن حکم از بالاترین مرتبه به او واگذار می‌شود\n\nهنگامی که به سوی امری که برایش پیش می‌آید نزول می‌کند *** نزدیکی به ما در نزول اوست\n\nهنگامی که قلبم او را در منازلش دریافت *** ترقی به واسطه آن به سوی تجلی (التجلی) او بود\n\n[اینکه ذوق اولین مبادی تجلی است و حالی است که ناگهان بر قلب بنده وارد می‌شود]\n\nبدان که ذوق (الذوق) نزد این طایفه (صوفیان) اولین مبادی تجلی (التجلی) است و حالی است که ناگهان بر قلب بنده (العبد) وارد می‌شود. اگر دو نفس یا بیشتر بماند، شرب (نوشیدن) است. و آیا پس از این شرب، سیرابی (ری) هست یا نه؟ ذوق (الذوق) آن‌ها در این باره متفاوت است. از برخی نقل شده که نوشید و سیراب شد. و از ابویزید (بسطامی) نقل شده که سیرابی محال است. و هر سخنی مطابق حال صاحب آن است. و هر صاحب قولی نزد ما در این طریق وجه صحیحی دارد. و ما در این مسئله تفصیلی داریم که ان‌شاءالله بعداً در باب شرب یا ری یا در باب عدم ری خواهد آمد، اگر خداوند آن را به یادم آورد. پس آن را در آخر این ابواب از این کتاب جستجو کن.\n\n[اینکه برای هر تجلی مبدئی است]\n\nبدان که قول آن‌ها مبنی بر «اولین مبادی تجلی» اعلام این است که برای هر تجلی مبدئی است که ذوق (الذوق) آن تجلی است. و این جز در صورتی که تجلی (التجلی) الهی در صور یا در اسماء الهی (الأسماء الإلهية) یا کونی باشد، رخ نمی‌دهد. اگر تجلی در معنا باشد، عین مبدأ آن، عین خود آن است؛ پس از مبدأ، حکمی ندارد که انسان به تدریج از آن بهره‌مند شود، چنانکه از معانی آن صورتی که تجلی در آن رخ داده یا از معانی همه اسماء بهره می‌برد. هر اسمی از آن‌ها، در مبدأ چیزی را می‌بیند که پس از آن از آن اسم نمی‌بیند. و صاحب معنا، مبدأ هر چیزی عین آن است، پس بعد از این افاده کلی، از آن بهره‌ای نمی‌برد. از این رو، او در تعبیر از آن امر واحد تفصیل دارد، و این همان مراد ما در صدر این کتاب است:\n\nتا آنکه سبحات وجه او بر چشم آشکار شد *** و تا به امروز جز او نبوده است.\n\nپس مبدأ آن، عین آن بود. و هر آنچه پس از آن در تمام سخنانمان می‌آوریم، تنها تفصیل آن امر کلی است که آن نظر در آن عین واحد در بر دارد. و بیشتر مردم بر خلاف این ذوق (الذوق) هستند و به همین دلیل سخنانشان منظم نیست و کسی که در آن می‌نگرد، اصلی را که همه اقوالشان به آن بازگردد، نمی‌یابد. اما سخن ما به هم پیوسته است، زیرا یک عین واحد است و این تفصیل آن است. کسی که مناسبت آیات قرآن را در پیوستگی برخی به برخی دیگر می‌شناسد، آنچه را گفتیم درک می‌کند؛ او جامع میان دو آیه را می‌شناسد، اگرچه بین آن‌ها دوری ظاهری باشد. این صحیح است، اما ناگزیر باید وجه جامعی مناسب میان دو اساس وجود داشته باشد که باعث شده این آیه با آیات مجاورش مناسبت داشته باشد، زیرا این نظمی الهی است. و ما ندیده‌ایم کسی به این نظر بپردازد مگر رمانی از نحویان، که تفسیری بر قرآن دارد. کسی که بر آن واقف شده به من خبر داد که او در قرآن این روش را دنبال کرده است، هرچند من بر آن واقف نشدم. اما در مراکش در بلاد مغرب، ابوالعباس سبتی، صاحب صدقات، را دیدم که این مسلک را می‌پیمود و با او در این باره گفتگو کردم و او از اصحاب موازین بود.\n\n[همانا ذوق‌ها با اختلاف تجلی متفاوت می‌شوند]\n\nسپس بدان که ذوق (الذوق) با اختلاف تجلی (التجلی) متفاوت می‌شود. اگر تجلی در صور باشد، ذوق خیالی است؛ و اگر در اسماء الهی (الأسماء الإلهية) و کونی باشد، ذوق عقلی است. ذوق خیالی اثرش در نفس است و ذوق عقلی اثرش در قلب. پس حکم اثر ذوق نفس، مجاهدات (المجاهدات) بدنی را در پی دارد، از قبیل گرسنگی و تشنگی و شب‌زنده‌داری و ذکر زبان و تلاوت و امر به معروف و نهی از منکر و جهاد در راه خدا و دور انداختن آنچه دو دست مالک آن است. اگر تنها باشد، نه خانواده‌ای دارد و نه شیخی. اما اگر در محضر شیخ معتبری باشد که او را تربیت می‌کند، آنچه در دست دارد نزد آن شیخ می‌اندازد و به کلی از آن خارج می‌شود، ظاهراً و باطناً، و هیچ مالکیتی برای او باقی نمی‌ماند. حتی اگر در باطن خود به دلیل ضعفش آن را ناخوش بدارد یا در آن مشقتی به او برسد، نباید با بیرون کردن آن از دستش، به آن لذت نگاه کند، بلکه اگر آن را با مشقت بیرون کرد، با نظری صحیح و ثابت بیرون کند که نتواند آنچه را در آن نیت کرده است، در نفس خود از بین ببرد. و اگر آن را با لذت از دست خود بیرون کرد، پس آن را با عقل خود بیرون نکرده است؛ اگر لذت از بین برود، ممکن است پشیمانی به او دست دهد. بر خلاف کسی که کراهت دارد؛ زیرا اگر آن را با کراهت بیرون کند، سپس به عنایت الهی در نفس او چیزی پدید آید که کراهت را از او بزداید، به حالت التذاذ از آن منتقل می‌شود و در مقام ثابت‌تر است. خروج ما از آنچه در دست داشتیم نیز اینگونه بود و ما شیخی نداشتیم که او را در این باره حاکم قرار دهیم یا آن را نزد او بیندازیم، پس هنگامی که با پدرمان (رحمه الله) در این باره مشورت کردیم، او را حاکم قرار دادیم. ما آنچه در دست داشتیم را ترک کردیم و امر آن را به کسی واگذار نکردیم، زیرا ما بر دست شیخی بازنگشته بودیم و شیخی را در این طریق ندیده بودم، بلکه از آن خارج شدم، خروج مرده از خانواده و مالش. پس هنگامی که با پدر مشورت کردیم و او امر آن را از ما خواست، او را در آن حاکم قرار دادیم و تا به امروز نپرسیده‌ام که با آن چه کرد. این چیزی است که حکم ذوق نفس (الذوق) را می‌دهد و برای هر سالکی ضروری است و اصل آن:\n\nآوردن ابوبکر تمام آنچه را که مالک بود نزد پیامبر (صلی الله علیه و سلم) هنگامی که به او فرمود: «آنچه نزد خود داری بیاور.» و عمر نصف مالش را آورد. پیامبر (صلی الله علیه و سلم) در این باره حدی برای آن‌ها تعیین نکرد، و اگر حدی تعیین می‌کرد، هیچ یک از آن‌ها از آنچه رسول خدا (صلی الله علیه و سلم) برایش تعیین کرده بود، تجاوز نمی‌کرد. بلکه پیامبر (صلی الله علیه و سلم) می‌خواست مراتب قوم نزد خودشان متمایز شود. پس به ابوبکر فرمود: «برای خانواده‌ات چه گذاشتی؟» گفت: «خدا و رسولش.» و این نهایت ادب است که گفت: «و رسولش.» زیرا اگر می‌گفت: «خدا»، نمی‌توانست در هیچ یک از آن بازگردد مگر اینکه خداوند بدون واسطه، حالاً و ذوقاً، آن را به او بازگرداند. پس چون این را دانست، گفت: «و رسولش.» پس اگر رسول خدا (صلی الله علیه و سلم) چیزی از مالش را به او بازمی‌گرداند، آن را برای خانواده‌اش از رسول خدا (صلی الله علیه و سلم) می‌پذیرفت، زیرا او آن را برای خانواده‌اش ترک کرده بود و کسی در آن حکم نکرد مگر کسی که صاحب مال او را جانشین خود قرار داده بود. پس بنگر که این چقدر محکم است و معرفت ابوبکر به مراتب امور چقدر شدید است. و عمر گمان کرد که در آن روز از ابوبکر پیشی می‌گیرد، زیرا آوردن نصف مالش را بزرگ می‌دید. سپس به عمر بن خطاب فرمود: «برای خانواده‌ات چه گذاشتی؟» گفت: «نصف مالم.» رسول خدا (صلی الله علیه و سلم) فرمود: «بین شما همان است که بین دو کلمه شماست.» عمر گفت: «پس دانستم که هرگز از ابوبکر پیشی نخواهم گرفت.»\n\nو شایسته است که انسان بلندهمت باشد و به بالاترین مراتب نزد خداوند رغبت داشته باشد و حق هر مرتبه‌ای را ادا کند. رسول خدا (صلی الله علیه و سلم) چیزی از مال ابوبکر را به او بازنگرداند تا حاضران را بر صدق ابوبکر که او (پیامبر) از آن آگاه بود، آگاه سازد. زیرا رسول خدا (صلی الله علیه و سلم) از او رفق و رحمت را می‌دانست. اگر چیزی از آن را به او بازمی‌گرداند، این احتمال در حق ابوبکر راه می‌یافت که رفق رسول خدا (صلی الله علیه و سلم) به ذهنش خطور کرده است. پس رسول خدا (صلی الله علیه و سلم) خانواده ابوبکر را با آنچه نظرش (صلی الله علیه و سلم) اقتضا می‌کرد، عوض داد. و عبدالرحمن بن عوف با تمام مالش نزد او آمد، اما پیامبر همه آن را به او بازگرداند و فرمود: «مالت را نزد خود نگه دار.» زیرا او را به این کار دعوت نکرده بود، و اگر دعوت می‌کرد، آن را از او می‌پذیرفت، چنانکه از ابوبکر پذیرفت. و حکم ذوق (الذوق) عقل، ریاضات (الرياضات) نفسانی و تهذیب اخلاق را در پی دارد. پس ریاضت (الرياضة) شامل مجاهدات (المجاهدات) بدنی می‌شود، اما مجاهده شامل ریاضات نمی‌شود. و ریاضات در حکم کامل‌ترند، زیرا پیامبر (صلی الله علیه و سلم) مبعوث شد تا مکارم اخلاق را به اتمام رساند. پس کسی که بر آن سرشته شده، ذاتش نورانی و مقدس است. و کسی که بر آن سرشته نشده، ریاضت او را به آن ملحق می‌کند و بر او حکم می‌راند. و ریاضت، رام کردن امور دشوار است. پس هر کس دشواری را رام کند، آن را ریاضت داده و سرکشی را از نفس خود زدوده است، زیرا نفس ریاست و تقدم بر امثال خود را دوست دارد. و ریاضت، نفس را از این خاطر و سلطه آن باز می‌دارد و برای خود برتری بر دیگران نمی‌بیند، به دلیل اشتراکش با آن‌ها در عبودیت و احاطه قبضه الهی بر همه. پس به چه چیز ریاست کند؟ پس امر خدا را امتثال می‌کند از آن جهت که از جانب خدا به آن مخاطب شده است و دوست دارد که هر مخاطبی از بندگان به امتثال امر مولای خود بشتابد، به خاطر ترجیح دوری از گناه. در این شتاب، به ذهنش خطور نمی‌کند که از نفوس دیگر پیشی بگیرد تا به این وسیله برتری بر آن‌ها داشته باشد. مقام ریاضت (الرياضة) چنین اقتضایی ندارد، زیرا ریاضت خروج مطلق از اغراض نفسانی است بدون هیچ قیدی. اما ذوقی (الذوق) که مبدأ آن عین خود آن است، چنانکه پیشتر گفتیم، نیازی به ریاضت و مجاهده ندارد. زیرا ریاضت جز در مورد دشوارِ فرمانبردار شدن، یا بسیار سرکش، یا موصوف به سرکشی، نیست. و مجاهده احساس مشقت است. و این عینی که ذکر کردیم، دشواری را باقی نگذاشته تا ریاضات بر آن حکم رانند، بلکه در نفس خود رام است. مشاهده آن عین، این را یکباره به او بخشیده است. اما احساس مشقات بدنی، آن حس طبع است نه حس نفس. پس او صاحب لذت در مشقتی است که در آن به حکم حقوقی که خداوند برایش تعیین کرده، حکم می‌کند، آنجا که:\n\nبر زبان بیان‌کننده از جانب او، یعنی رسول خدا (صلی الله علیه و سلم)، به او فرمود: «همانا چشمت بر تو حقی دارد، و نفست بر تو حقی دارد، و مهمانت بر تو حقی دارد، و خانواده‌ات بر تو حقی دارد. پس حق هر صاحب حقی را به او بده.» (حدیث)\n\nپس حکم کسی که این عین را می‌چشد، همان است که برایش تشریع شده است. او اصلاً ریاضتی در پذیرش آن ندارد و نزد او نیز ریاضتی نیست. و خداوند حَق (الحق) را می‌گوید و او راه را هدایت می‌کند. و ذوق (الذوق) پس از آن تجلی (التجلی)، علم را به تو می‌دهد و از آن، تحقق میزان و مرتبه‌اش حاصل می‌شود. پس با آن به آنچه در نظر به آن سزاوار است، ادب می‌ورزد. زیرا آن (ذوق) نظیر عین است در آنچه برای آن جایز نیست. و این همان چیزی است که اگر مؤمن نباشی، در تو تشنگی (ظماء) ایجاد می‌کند. اما اگر مؤمن باشی، ایمان به تو تشنگی می‌دهد و عطشت به اندازه ایمانت شدت می‌یابد و کم می‌شود. و کسی که مؤمن نیست، اصلاً تشنگی برای نوشیدن تجلی (التجلی) ندارد. و اگر عطش علم به او دست دهد، از جهت نظر فکری است. اما برای علوم تجلی، جز ایمان نیست، و ایمانی حاصل نمی‌شود مگر اینکه تشنگی همراه آن باشد و با ذوق (الذوق) افزایش یابد. پس بفهم."
  },
  "page_count": 3
}