{
  "id": 211,
  "title": {
    "ar": "الباب الحادي عشر ومائتان في اللوائح",
    "en": "Chapter Two Hundred and Eleventh, Concerning the Flashes (اللوائح)",
    "ur": "۲۱۱ واں باب لوائح (اللوائح) کے بیان میں",
    "fa": "باب دویست و یازدهم در لوایح (اللوائح)"
  },
  "content": {
    "ar": "## «الباب الحادي عشر ومائتان في اللوائح»\n\n\n> لوائح الحق ما تبدو لأسرار *** من السمو ومن حال إلى حال‏\n\n\n> وقد تكون بما يبدو لناظره *** من غير جارحة بالعلم والحال‏\n\n\n> من النعوت التي يعطيك شاهدها *** دليلها إنها في الآل كالآل‏\n\n\n### [اللوائح ما يلوح إلى الأسرار الظاهرة من السمو من حال إلى حال‏]\n\n\nاعلم أن اللوائح عند القوم ما يلوح إلى الأسرار الظاهرة من السمو من حال إلى حال وعندنا ما يلوح للبصر إذا لم يتقيد بالجارحة من الأنوار الذاتية والسبحات الوجهية من جهة الإثبات لا من جهة السلب وما يلوح من أنوار الأسماء الإلهية عند مشاهدة آثارها فيعلم بأنوارها أما السمو من حال إلى حال هو أن لا يرجع إلى الحال الذي انتقل عنه في الحال الذي هو فيه إذا انتقل عنه إلى ما هو فوقه والمراد بذلك ما يأتي به الحال من الواردات الإلهية والمعرفة بالله وهي المنازل ما هي الكرامات فإن الأحوال قد تعود مرارا ولكن لا يحمد صاحبها فيها إلا إذا زادته علما بالله لم يكن عنده لا بد من ذلك وتلك الزيادة هي اللائحة فإن لم ترقه تلك الزيادة في الحال فليست بلائحة مع صحة الحال والحال كونك باقيا أو فانيا أو صاحيا أو سكران أو في جمع أو تفرقة أو في غيبة أو في حضور والأحوال معروفة وهي الأبواب التي ذكرناها في هذا الفصل وفيها أمر الله نبيه صلى الله عليه وسلم أن يقول وقُلْ رَبِّ زِدْنِي عِلْماً يرقى به عنده منزلة لم تكن له وهذه الأحوال لا يختص بها البشر ولا موطن الدنيا بل هي دائمة أبدا في الدنيا والآخرة وهي لكل مخلوق فاللوائح كأنها مبادي الكشوف ولهذا قد تثبت وقد يسرع زوالها إلا أنه لا بد لها فيمن تلوح له من زيادة علم يرقى به درجة عند الله تعالى هذا يشترط في اللوائح وقلنا من شرط اللائحة أن يكون الإدراك بالبصر لا بالبصيرة في الحال الذي لا يتقيد البصر بالجارحة المقيدة بالجهة المخصوصة بل بحقيقة البصر المنسوب إلى النفس الناطقة ثم يزاد إلى ذلك أمر آخر وهو أن يكون الحق بصره فهو الشاهد له والبينة من ربه على إن بصره لم يتقيد بالجارحة وقد صح هذا المقام عن رسول الله‏\nصلى الله عليه وسلم كما صح عنه لما سئل عن رؤية ربه بعينه المقيدة ذات الطبقات‏\n\n\nفقيل له هل رأيت ربك أراد السائل رؤية البصر المقيدة بالجارحة فقال نوراني أراه‏\n\n\nأي نور هذا الإدراك يضعف عن ذلك النور الإلهي وإن كان للبصر المقيد إدراك في النور الإلهي على حد مخصوص فإن النور الإلهي كما قيل التشبيه بالمصباح الوارد في القرآن على الصفات المخصوصة المذكورة كذلك يقبل إدراك البصر إياه إذا حصل تلك الشرائط كلها فتدبرها في نفسك ويخرج قوله لا تُدْرِكُهُ الْأَبْصارُ على وجهين الوجه الواحد أنه نفى أن تدركه الأبصار على طريق التنبيه على الحقائق وإنما يدركه المبصرون بالأبصار لا الأبصار والوجه الثاني لا تدركه الأبصار المقيدة بالجارحة كما قررنا فإذا لم تتقيد أدركته وهو عين النور الذي وقع فيه التشبيه بالمصباح وهو النور الذي لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ فلا يقبل التشبيه لأنه لا صفة له وكل من له صفة فإنه يقبل التشبيه لأن الصفات تتنوع في القابلين لها بحسب ما تعطيه حقيقة الموصوف كالعلم يتصف به الحق والسمع والبصر والقدرة والإرادة والقول وغير ذلك من الصفات ويتصف بها المخلوق ومعلوم أن نسبتها إلى المخلوق لا تكون على حد نسبتها إلى الخالق بل نسبتها إلى البشر تخالف نسبتها إلى الملك وكلاهما مخلوقان فاعلم ذلك فهذه اللوائح التي تلوح للبصر مشاهد ذاتية ثبوتية ما هي سلبية فإن الوصف السلبي ليس من إدراك البصر بل ذلك من إدراك العقول وما يدرك بالعقل لا يدخل في اللوائح وأما ما يلوح من أنوار الأسماء الإلهية عند مشاهدة آثارها فتعلم بأنوارها أي تظهرها أنوارها فالاسم الإلهي روح لأثره وأثره صورته والبصر لا يقع من الاسم إلا على أثره الذي هو صورته كما تقع على صورة زيد الجسمية ويصح أن يقال رأى زيدا من غير تأويل ويصدق مع كون زيد له روح مدبرة غيب فيه لها صورة وهي جسديتها فأثر الأسماء الإلهية صور الأسماء فمن شاهد الآثار فقد صدق في أنه شاهد الأسماء فلوائحها أن تجمع بين نسبة ذلك الأثر المشهود وبين الاسم الذي هو روح صورة ذلك الأثر كما ترى شخصا ولكن لا تعرف أنه زيد المطلوب عندك ويراه آخر ممن يعرفه فيعرف أنه رأى زيدا فهذا العارف هو صاحب اللوائح والآخر ليس هو من أصحاب اللوائح لأنه ما لاح له ارتباط الاسم بهذه الصورة والفرق بين الشخصين المدركين معلوم فما كل من رأى علم ما رأى فهذه اللوائح الحالية لمن أراد معرفتها على الاختصار والاقتصاد والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "## The Two Hundred and Eleventh Chapter Concerning the Flashes (اللوائح)\n\nThe Flashes of the Real (الحق) are what appear to the inner secrets (أسرار),\nFrom elevation, and from one spiritual state (حال) to another.\nAnd they may be through what manifests to the beholder,\nWithout a physical organ (جارحة), through Knowledge (العلم) and the spiritual State (الحال).\nThey are among the Attributes (النعوت) whose witnessing grants you\nThe proof that they are in the mirage like the mirage.\n\n### [The Flashes (اللوائح) are what flash to the manifest secrets from elevation, from state (حال) to state (حال)]\n\nKnow that the Flashes (اللوائح), according to the People [the Sufis], are what flash to the manifest secrets (الأسرار الظاهرة) from elevation, from one state (حال) to another. According to us, they are what flash to the sight (البصر)—when it is not restricted by the physical organ (الجارحة)—from the Lights of the Essence (الأنوار الذاتية) and the Glories of the Face (السبحات الوجهية), from the perspective of affirmation (الإثبات), not negation (السلب). They are also what flash from the lights of the Divine Names (الأسماء الإلهية) upon witnessing their effects (آثارها), so that one knows them by their lights.\n\nAs for the elevation from state to state, it means that one does not return to the state from which one departed, in the state one is currently in, having moved to what is above it. What is meant by this is what the state brings forth of Divine Influxes (الواردات الإلهية) and Gnosis (المعرفة) of Allah. These are stations (المنازل), not merely miraculous gifts (الكرامات). For the states (الأحوال) may return repeatedly, but their possessor is not praised therein unless the state increases him in Knowledge (علم) of Allah that he did not previously possess. This increase is necessary. That increase is the Flash (اللائحة). If that increase does not elevate him within the state, then it is not a Flash, even if the state itself is sound.\n\nThe State (الحال) is your being subsistent (باقيا) or annihilated (فانيا), sober or intoxicated, in gathering (جمع) or dispersion (تفرقة), in absence (غيبة) or presence (حضور). The states are well-known; they are the chapters we mentioned in this section. And concerning them, Allah commanded His Prophet (peace and blessings be upon him) to say: <<وَقُلْ رَبِّ زِدْنِي عِلْماً>> (And say: 'My Lord, increase me in knowledge'), by which he ascends to a station (منزلة) with Him that he did not previously possess. These states are not exclusive to humanity nor to the abode of this world, but are perpetual forever, in this world and the Hereafter, and they belong to every creature. Thus, the Flashes are like the beginnings of Unveilings (الكشوف). For this reason, they may become fixed or their disappearance may be swift. However, it is necessary for the one to whom they flash to gain an increase in knowledge by which he ascends a degree with Allah the Exalted. This is the condition stipulated for the Flashes.\n\nWe said that a condition of the Flash is that the perception (الإدراك) must be by sight (البصر), not by insight (البصيرة), in the state where the sight is not restricted by the physical organ (الجارحة) confined to a specific direction, but rather by the reality of sight (حقيقة البصر) attributed to the rational soul (النفس الناطقة). Then another matter is added to this: that the Real (الحق) becomes his sight. Thus, He is the Witness (الشاهد) for him, and the clear proof from his Lord that his sight was not restricted by the physical organ.\n\nThis station (المقام) has been authentically reported from the Messenger of Allah (peace and blessings be upon him), just as it was authentically reported when he was asked about seeing his Lord with his eye, which is restricted and possesses layers. He was asked, \"Did you see your Lord?\"—the questioner intending the vision of the sight restricted by the physical organ. He replied: \"A Light—how could I see Him?\" Meaning, the light of this perception is too weak for that Divine Light (النور الإلهي), even though the restricted sight has a perception of the Divine Light within a specific limit. For the Divine Light, just as the similitude of the Lamp (المصباح) mentioned in the Quran with the specific attributes described, likewise accepts the perception of sight when all those conditions are met. Ponder this within yourself.\n\nAnd His saying <<لَا تُدْرِكُهُ الْأَبْصَارُ>> (Vision comprehends Him not) is interpreted in two ways. The first way is that He negated that the sights (الأبصار) comprehend Him, by way of drawing attention to the Realities (الحقائق). Rather, it is the beholders (المبصرون) who perceive Him by means of the sights, not the sights themselves. The second way is that the sights restricted by the physical organ do not comprehend Him, as we established. But if the sight is not restricted, it perceives Him.\n\nAnd this is the very Light concerning which the similitude of the Lamp was given, and it is the Light of which <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). Thus, He does not accept similitude (التشبيه) because He has no limiting attribute (صفة). Everything that possesses an attribute accepts similitude, because attributes vary among those who receive them according to what the reality of the described entity grants. For example, Knowledge (العلم), Hearing, Sight, Power, Will, Speech, and other Attributes (الصفات) are attributed to the Real (الحق), and they are also attributed to the creature (المخلوق). And it is known that their relation to the creature is not on the same level as their relation to the Creator. Furthermore, their relation to a human being differs from their relation to an angel, and both are creatures. Know this.\n\nThus, these Flashes that flash to the sight are essential, affirmative witnessed realities (مشاهد ذاتية ثبوتية); they are not negative (سلبية). For the negative description (الوصف السلبي) is not part of the perception of sight, but rather the perception of the intellects (العقول). And what is perceived by the intellect does not enter into the Flashes.\n\nAs for what flashes from the lights of the Divine Names (الأسماء الإلهية) upon witnessing their effects, they are known by their lights—meaning, their lights make them manifest. The Divine Name (الاسم الإلهي) is the spirit (روح) for its effect (أثره), and its effect is its form (صورته). And sight (البصر) does not fall upon the Name except through its effect, which is its form, just as it falls upon the physical form of Zayd, and it is correct to say, \"He saw Zayd,\" without metaphorical interpretation. And this is true even though Zayd has a governing spirit hidden within him, which has a form, namely his physical body. Thus, the effects of the Divine Names are the forms of the Names. Whoever witnesses the effects has truly witnessed the Names.\n\nThe Flashes consist of combining the attribution of that witnessed effect with the Name that is the spirit of the form of that effect. Just as you see a person but do not know that he is Zayd, whom you seek, while another person who knows him sees him and knows that he has seen Zayd. This Gnostic (العارف) is the possessor of the Flashes, while the other is not among the possessors of the Flashes, because the connection of the Name to that form did not flash to him. The difference between the two perceiving individuals is known: not everyone who sees knows what he has seen.\n\nThese are the Flashes of the State (اللوائح الحالية) for whoever desires to know them concisely and moderately. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "## باب نمبر دو سو گیارہ لوائح (Al-Lawā'iḥ) کے بیان میں\n\nذات حق (الحق) کی لوائح وہ ہیں جو اسرار (Al-Asrār) پر ظاہر ہوتی ہیں، بلندی (As-Sumū) سے اور ایک حال (Al-Ḥāl) سے دوسرے حال کی طرف۔\n\nاور یہ اس چیز سے بھی ہو سکتی ہیں جو دیکھنے والے پر ظاہر ہو، بغیر کسی حواس ظاہری (الجارحة) کے، علم اور حال (Al-Ḥāl) کے ذریعے سے۔\n\nان صفات (النعوت) میں سے جن کا مشاہدہ کرنے والا تمہیں ان کی دلیل دیتا ہے کہ وہ سراب میں سراب کی مانند ہیں۔\n\n### [لوائح وہ ہیں جو ظاہر اسرار (Al-Asrār) کی طرف اشارہ کرتی ہیں، ایک حال (Al-Ḥāl) سے دوسرے حال کی طرف بلندی (As-Sumū) کے ذریعے]\n\nجان لو کہ اہل تصوف (القوم) کے نزدیک لوائح وہ ہیں جو ظاہر اسرار (Al-Asrār) کی طرف اشارہ کرتی ہیں، ایک حال (Al-Ḥāl) سے دوسرے حال کی طرف بلندی (As-Sumū) کے ذریعے سے۔ اور ہمارے نزدیک لوائح وہ ہیں جو بصر (Al-Baṣar) پر ظاہر ہوں جب وہ حواس ظاہری (الجارحة) کی قید سے آزاد ہو، ذاتی انوار (الأنوار الذاتية) اور سبحاتِ وجہیہ (السبحات الوجهية) میں سے، اثبات (Al-Ithbāt) کی جہت سے نہ کہ سلب (Al-Salb) کی جہت سے۔ اور وہ جو اسماء الٰہیہ کے انوار میں سے ظاہر ہوں جب ان کے آثار کا مشاہدہ کیا جائے، تو ان کے انوار کے ذریعے علم حاصل ہوتا ہے۔\n\nجہاں تک ایک حال (Al-Ḥāl) سے دوسرے حال کی طرف بلندی (As-Sumū) کا تعلق ہے، تو وہ یہ ہے کہ جب سالک اس حال سے جو اس میں ہے، کسی بلند تر حال کی طرف منتقل ہو جائے، تو وہ اس حال کی طرف واپس نہ لوٹے جس سے وہ منتقل ہوا تھا۔ اور اس سے مراد وہ وارداتِ الٰہیہ اور اللہ کی معرفت (المعرفۃ) ہے جو حال (Al-Ḥāl) لے کر آتا ہے، اور یہ منازل ہیں نہ کہ کرامات۔ کیونکہ احوال بار بار لوٹ سکتے ہیں، لیکن سالک اس میں قابل تعریف نہیں ہوتا مگر تب جب وہ حال اسے اللہ کے بارے میں ایسا علم دے جو اس کے پاس پہلے نہ تھا۔ یہ ضروری ہے۔ اور یہی اضافہ لائحة (Lā'iḥah) ہے۔ اگر وہ اضافہ اسے حال میں بلند نہ کرے تو وہ لائحة نہیں ہے، حالانکہ حال صحیح ہو۔\n\nاور حال (Al-Ḥāl) یہ ہے کہ تم باقی (Bāqī) ہو یا فانی (Fānī)، ہوش میں ہو یا مست، جمع (Jam') میں ہو یا تفرقہ (Tafriqah) میں، غیبت (Ghaybah) میں ہو یا حضور (Ḥuḍūr) میں۔ اور احوال معروف ہیں، اور یہی وہ ابواب ہیں جن کا ذکر ہم نے اس فصل میں کیا ہے۔ اور ان احوال میں اللہ تعالیٰ نے اپنے نبی صلی اللہ علیہ وسلم کو حکم دیا کہ وہ کہیں: \"اور کہو: اے میرے رب! مجھے علم میں اضافہ عطا فرما\" (وَقُلْ رَبِّ زِدْنِي عِلْماً) جس کے ذریعے وہ اللہ کے ہاں ایسے مرتبے پر فائز ہوں جو انہیں پہلے حاصل نہ تھا۔ اور یہ احوال نہ تو صرف انسانوں کے لیے مخصوص ہیں اور نہ ہی دنیا کے مقام کے لیے، بلکہ یہ دنیا اور آخرت میں ہمیشہ قائم رہنے والے ہیں، اور یہ ہر مخلوق کے لیے ہیں۔ پس لوائح گویا کشوف (Al-Kushūf) کی ابتدائی جھلکیاں ہیں، اور اسی لیے کبھی یہ ثابت رہتی ہیں اور کبھی ان کا زوال جلد ہو جاتا ہے۔ مگر یہ ضروری ہے کہ جس پر یہ ظاہر ہوں، ان کے لیے علم میں اضافہ ہو جس سے وہ اللہ تعالیٰ کے ہاں ایک درجہ بلند ہو جائیں۔ یہ لوائح کے لیے شرط ہے۔\n\nاور ہم نے کہا کہ لائحة (Lā'iḥah) کی شرط یہ ہے کہ ادراک بصر (Al-Baṣar) کے ذریعے ہو نہ کہ بصیرت (Al-Baṣīrah) کے ذریعے، اس حال میں جب بصر (Al-Baṣar) کسی مخصوص جہت سے مقید حواس ظاہری (الجارحة) کی قید میں نہ ہو، بلکہ اس بصر کی حقیقت کے ذریعے ہو جو نفس ناطقہ (An-Nafs an-Nāṭiqah) سے منسوب ہے۔ پھر اس میں ایک اور امر کا اضافہ ہوتا ہے، اور وہ یہ ہے کہ ذات حق (الحق) ہی اس کا بصر (Al-Baṣar) بن جائے، پس وہی اس کا شاہد ہو اور اس کے رب کی طرف سے دلیل ہو کہ اس کا بصر حواس ظاہری (الجارحة) سے مقید نہیں رہا۔\n\nاور یہ مقام رسول اللہ صلی اللہ علیہ وسلم سے صحیح ثابت ہے، جیسا کہ آپ صلی اللہ علیہ وسلم سے جب آپ کی مقید آنکھ (جس میں پردے ہوتے ہیں) سے رب کے دیدار کے بارے میں پوچھا گیا تو صحیح ثابت ہے۔ آپ صلی اللہ علیہ وسلم سے پوچھا گیا: \"کیا آپ نے اپنے رب کو دیکھا؟\" سائل کا مقصد حواس ظاہری (الجارحة) سے مقید بصر (Al-Baṣar) کا دیدار تھا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: \"وہ نور ہے، میں اسے کیسے دیکھوں؟\" (نوراني أراه) یعنی اس ادراک کا نور اس نور الٰہی کے سامنے کمزور پڑ جاتا ہے، اگرچہ مقید بصر (Al-Baṣar) کے لیے بھی نور الٰہی میں ایک مخصوص حد تک ادراک ممکن ہے۔ کیونکہ نور الٰہی، جیسا کہ قرآن میں مذکور مخصوص صفات کے ساتھ چراغ (المصباح) کی تشبیہ دی گئی ہے، اسی طرح بصر (Al-Baṣar) کا ادراک بھی اسے قبول کرتا ہے جب یہ تمام شرائط پوری ہو جائیں۔ پس تم اپنے اندر اس پر غور کرو۔\n\nاور اللہ تعالیٰ کا یہ فرمان کہ \"نگاہیں اسے پا نہیں سکتیں\" (لَا تُدْرِكُهُ الْأَبْصَارُ) دو وجوہ پر محمول ہوتا ہے: پہلی وجہ یہ ہے کہ اس نے حقائق (Al-Ḥaqā'iq) پر تنبیہ کے طریقے پر ابصار (آنکھوں) کے ادراک کی نفی کی ہے، اور اسے صرف دیکھنے والے (مبصرون) ہی ابصار (آنکھوں) کے ذریعے پاتے ہیں، نہ کہ خود ابصار۔ اور دوسری وجہ یہ ہے کہ اسے وہ ابصار (آنکھیں) نہیں پا سکتیں جو حواس ظاہری (الجارحة) سے مقید ہوں، جیسا کہ ہم نے بیان کیا۔ پس جب وہ مقید نہ ہوں تو اسے پا لیتی ہیں۔ اور یہ وہی نور ہے جس میں چراغ (المصباح) کی تشبیہ واقع ہوئی ہے، اور یہ وہ نور ہے \"جس کی مانند کوئی شے نہیں\" (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)۔ پس یہ تشبیہ کو قبول نہیں کرتا کیونکہ اس کی کوئی صفت نہیں ہے۔ اور ہر وہ ذات جس کی کوئی صفت ہو، وہ تشبیہ کو قبول کرتی ہے، کیونکہ صفات انہیں قبول کرنے والوں میں موصوف کی حقیقت کے تقاضے کے مطابق مختلف ہوتی ہیں۔ جیسے علم، سمع، بصر، قدرت، ارادہ، اور قول وغیرہ صفات سے ذات حق (الحق) بھی متصف ہے اور مخلوق بھی متصف ہے۔ اور یہ معلوم ہے کہ مخلوق کی طرف ان کی نسبت اس حد پر نہیں ہوتی جس حد پر خالق کی طرف ان کی نسبت ہوتی ہے، بلکہ انسان کی طرف ان کی نسبت فرشتے کی طرف ان کی نسبت سے مختلف ہوتی ہے، حالانکہ دونوں مخلوق ہیں۔ پس یہ جان لو۔\n\nپس یہ لوائح جو بصر (Al-Baṣar) پر ظاہر ہوتی ہیں، ذاتی، اثباتی (ثبوتیۃ) مشاہدات ہیں، سلب (منفی) نہیں ہیں۔ کیونکہ وصف سلبی بصر (Al-Baṣar) کے ادراک میں شامل نہیں، بلکہ وہ عقلوں کا ادراک ہے۔ اور جو چیز عقل سے ادراک کی جائے وہ لوائح (Al-Lawā'iḥ) میں داخل نہیں ہوتی۔\n\nاور جہاں تک اسماء الٰہیہ کے انوار کا تعلق ہے جو ان کے آثار کے مشاہدے کے وقت ظاہر ہوتے ہیں، تو ان کا علم ان کے انوار کے ذریعے ہوتا ہے، یعنی ان کے انوار انہیں ظاہر کرتے ہیں۔ پس اسم الٰہی اپنے اثر کے لیے روح ہے، اور اس کا اثر اس کی صورت ہے۔ اور بصر (Al-Baṣar) اسم میں سے صرف اس کے اثر پر پڑتا ہے جو اس کی صورت ہے۔ جیسا کہ بصر زید کی جسمانی صورت پر پڑتا ہے، اور بغیر کسی تاویل کے یہ کہنا صحیح ہے کہ اس نے زید کو دیکھا، اور یہ سچ ہے، حالانکہ زید کے اندر ایک مدبر روح ہے جو اس میں غیب ہے اور اس کی ایک صورت ہے جو اس کا جسم ہے۔ پس اسماء الٰہیہ کے آثار اسماء کی صورتیں ہیں۔ لہٰذا جس نے آثار کا مشاہدہ کیا، اس نے سچ کہا کہ اس نے اسماء کا مشاہدہ کیا۔ پس ان کی لوائح (Al-Lawā'iḥ) یہ ہیں کہ تم اس مشہود اثر کی نسبت کو اور اس اسم کو جو اس اثر کی صورت کی روح ہے، آپس میں جمع کر دو۔ جیسا کہ تم کسی شخص کو دیکھتے ہو لیکن تم نہیں جانتے کہ وہ تمہارا مطلوبہ زید ہے، اور اسے کوئی دوسرا شخص دیکھتا ہے جو اسے جانتا ہے، تو وہ جان لیتا ہے کہ اس نے زید کو دیکھا ہے۔ پس یہ عارف ہی صاحبِ لوائح (Al-Lawā'iḥ) ہے، اور دوسرا شخص اصحابِ لوائح میں سے نہیں ہے، کیونکہ اس پر اسم کا اس صورت کے ساتھ تعلق ظاہر نہیں ہوا۔ اور ادراک کرنے والے ان دونوں اشخاص کے درمیان فرق معلوم ہے۔ پس ہر وہ شخص جس نے دیکھا، اس نے یہ نہیں جانا کہ اس نے کیا دیکھا۔\n\nپس یہ احوال (Al-Aḥwāl) سے متعلق لوائح (Al-Lawā'iḥ) کا مختصر اور جامع بیان ہے ان کے لیے جو انہیں جاننا چاہتے ہیں۔ اور اللہ حق (الحق) فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے۔ (وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ)",
    "fa": "«باب دویست و یازدهم در لوائح»\n\nلوائح (اللوائح) حق (الحق) آن است که بر اسرار (الأسرار) آشکار می‌شود،\nاز تعالی (السمو) و از حالی (الحال) به حال دیگر.\n\nو گاهی آن است که بر بیننده آشکار می‌شود،\nبدون جارحه (الجارحة)، به واسطه علم و حال (الحال).\n\nاز صفاتی که شاهد آن به تو می‌دهد،\nدلیل آن است که در سراب (آل) مانند سراب است.\n\n***\n\n[لوائح (اللوائح) آن است که بر اسرار (الأسرار) آشکار شده از تعالی (السمو)، از حالی به حال دیگر می‌تابد]\n\nبدان که لوائح (اللوائح) نزد قوم (صوفیه) آن است که بر اسرار (الأسرار) آشکار شده از تعالی (السمو)، از حالی به حال دیگر می‌تابد. و نزد ما، آن است که بر بصر (بینایی) می‌تابد، هنگامی که به جارحه (الجارحة) (عضو فیزیکی) مقید نباشد؛ از انوار ذاتی (الأنوار الذاتية) و سبحات وجهی (السبحات الوجهية)، از جهت اثبات نه از جهت سلب. و نیز آن است که از انوار اسماء الهی هنگام مشاهده آثارشان می‌تابد، پس به واسطه انوارشان دانسته می‌شود.\n\nاما تعالی (السمو) از حالی به حال دیگر آن است که شخص به حالی که از آن منتقل شده بازنگردد، در حالی که در آن است، اگر از آن به حال بالاتر منتقل شود. و منظور از آن، چیزی است که حال (الحال) از واردات الهی (الواردات الإلهية) و معرفت (المعرفة) به حق (الله) می‌آورد، و اینها منازل هستند نه کرامات. زیرا احوال ممکن است بارها بازگردند، اما صاحب حال در آن ستوده نمی‌شود مگر آنکه علم به حق (الله) را که قبلاً نداشته، به او بیفزاید؛ این امر ضروری است. و آن افزایش، همان لائحه (اللائحة) است. اگر آن افزایش، او را در حال (الحال) ارتقا ندهد، پس لائحه نیست، حتی با وجود صحت حال. و حال (الحال) عبارت است از باقی (البقاء) بودن یا فانی (الفناء) بودن، هوشیار بودن یا مست بودن، در جمع یا تفرقه بودن، یا در غیبت یا حضور بودن. و احوال شناخته شده‌اند و آنها همان ابوابی هستند که در این فصل ذکر کردیم. و در این احوال است که خداوند پیامبرش (صلی الله علیه و سلم) را امر فرمود که بگوید: «وَقُلْ رَبِّ زِدْنِي عِلْماً» (و بگو: پروردگارا، بر علم من بیفزا) [طه: ۱۱۴]، تا به واسطه آن به منزلتی نزد او ارتقا یابد که قبلاً نداشته است.\n\nو این احوال نه مختص به بشر است و نه به موطن دنیا، بلکه همیشه در دنیا و آخرت دائمی است و برای هر مخلوقی است. پس لوائح (اللوائح) گویی مبادی کشوف (الکشوف) هستند، و به همین دلیل ممکن است ثابت بمانند یا زوالشان سریع باشد. مگر اینکه برای کسی که بر او می‌تابد، ناگزیر باید افزایش علمی به همراه داشته باشد که به واسطه آن نزد خداوند متعال درجه‌ای ارتقا یابد. این شرط در لوائح (اللوائح) است.\n\nو گفتیم از شرط لائحه (اللائحة) این است که ادراک با بصر (بینایی) باشد نه با بصیرت، در حالی که بصر به جارحه (الجارحة) مقید به جهت مخصوص مقید نباشد، بلکه به حقیقت بصر منسوب به نفس ناطقه باشد. سپس امر دیگری به آن افزوده می‌شود و آن این است که حق (الحق) بصر او باشد، پس او شاهد برای بنده است و دلیل از جانب پروردگارش بر اینکه بصر او به جارحه (الجارحة) مقید نشده است. و این مقام از رسول خدا (صلی الله علیه و سلم) صحیح است، چنانکه از او صحیح است هنگامی که درباره دیدن پروردگارش با چشم مقید دارای طبقات سؤال شد.\n\nاز او پرسیده شد: «آیا پروردگارت را دیدی؟» (سائل رؤیت بصر مقید به جارحه (الجارحة) را می‌خواست) پس فرمود: «نورانی أراه» (نوری است که آن را می‌بینم). یعنی نور این ادراک در برابر آن نور الهی ضعیف است، اگرچه بصر مقید نیز ادراکی در نور الهی بر حد مخصوص دارد. زیرا نور الهی، همانطور که تشبیه به چراغ (مصباح) در قرآن با صفات مخصوص ذکر شده آمده است، همچنین ادراک بصر را می‌پذیرد، اگر تمام آن شروط حاصل شود. پس در نفس خود در آن تدبر کن.\n\nو قول خداوند: «لا تُدْرِكُهُ الْأَبْصارُ» (چشم‌ها او را در نمی‌یابند) [انعام: ۱۰۳] بر دو وجه تفسیر می‌شود. وجه اول آن است که نفی کرده است که ابصار (چشم‌ها) او را ادراک کنند، از طریق تنبیه بر حقایق (الحقائق)؛ بلکه بینندگان (مبصرون) او را با ابصار ادراک می‌کنند، نه خود ابصار. و وجه دوم آن است که ابصار (چشم‌های) مقید به جارحه (الجارحة) او را ادراک نمی‌کنند، همانطور که مقرر کردیم. پس اگر مقید نباشد، او را ادراک می‌کند. و آن عین نوری است که تشبیه به چراغ (مصباح) در آن واقع شده است، و آن نوری است که «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (هیچ چیز مانند او نیست) [شوری: ۱۱]. پس تشبیه را نمی‌پذیرد، زیرا صفتی برای او نیست. و هر کس که صفتی داشته باشد، تشبیه را می‌پذیرد، زیرا صفات در پذیرندگان آنها بر حسب آنچه حقیقت موصوف اقتضا می‌کند، متنوع می‌شوند. مانند علم که حق (الحق) به آن متصف می‌شود، و سمع و بصر و قدرت و اراده و قول و غیر آن از صفات؛ و مخلوق نیز به آنها متصف می‌شود. و معلوم است که نسبت این صفات به مخلوق، مانند نسبت آنها به خالق نیست؛ بلکه نسبت آنها به بشر با نسبت آنها به فرشته متفاوت است، در حالی که هر دو مخلوق هستند. پس این را بدان.\n\nپس این لوائح (اللوائح) که بر بصر می‌تابند، مشاهدات ذاتی و ثبوتی هستند، نه سلبی. زیرا وصف سلبی از ادراک بصر نیست، بلکه از ادراک عقول است، و آنچه با عقل ادراک شود، داخل در لوائح (اللوائح) نمی‌شود. و اما آنچه از انوار اسماء الهی هنگام مشاهده آثارشان می‌تابد، پس به واسطه انوارشان دانسته می‌شود، یعنی انوارشان آنها را آشکار می‌سازد. پس اسم الهی روح برای اثرش است و اثرش صورت آن است. و بصر (بینایی) از اسم جز بر اثرش که صورت آن است، واقع نمی‌شود. همانطور که بر صورت جسمانی زید واقع می‌شود و صحیح است که گفته شود زید را دید، بدون تأویل؛ و این صادق است، با وجود اینکه زید روحی مدبر دارد که در او غایب است و آن روح صورتی دارد که همان جسمانیت اوست. پس اثر اسماء الهی، صورت‌های اسماء هستند. بنابراین هر کس آثار را مشاهده کند، صادق است در اینکه اسماء را مشاهده کرده است. پس لوائح (اللوائح) آنها این است که نسبت آن اثر مشهود را با اسمی که روح صورت آن اثر است، جمع کنی. همانطور که شخصی را می‌بینی، اما نمی‌دانی که او زید مطلوب توست؛ و دیگری که او را می‌شناسد، او را می‌بیند و می‌داند که زید را دیده است. پس این عارف، صاحب لوائح (اللوائح) است و دیگری از اصحاب لوائح نیست، زیرا ارتباط اسم با این صورت بر او نتابیده است. و تفاوت میان دو شخص ادراک‌کننده معلوم است؛ پس هر کس که دید، آنچه را که دید، ندانست. اینها لوائح (اللوائح) حالیه است برای کسی که بخواهد آنها را به اختصار و ایجاز بشناسد. و «وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق (الحق) را می‌گوید و او راه را هدایت می‌کند) [احزاب: ۴]."
  },
  "page_count": 2
}