{
  "id": 385,
  "title": {
    "ar": "الباب الخامس والثمانون وثلاثمائة في معرفة منازلة من حقر غلب ومن استهين منع",
    "en": "Chapter Three Hundred and Eighty-Five: Concerning the Knowledge of the Station of the one who, when belittled, overcomes, and the one who, when scorned, is protected.",
    "ur": "باب تین سو پچاسی (۳۸۵): ان منازل کی معرفت میں کہ جس نے حقیر جانا وہ مغلوب ہوا، اور جس کو حقیر سمجھا گیا وہ محروم ہوا۔",
    "fa": "باب سیصد و هشتاد و پنجم در معرفت منازل کسی که تحقیر کرد، غالب شد و کسی که مورد استهزا قرار گرفت، منع گردید."
  },
  "content": {
    "ar": "## «الباب الخامس والثمانون وثلاثمائة في معرفة منازلة من حقر غلب ومن استهين منع»\n\n\n> لا تحقرن عباد الله أن لهم *** قدرا ولو جمعت لك المقامات‏\n\n\n> أ ليس أسماؤه تبدي حقائقهم *** ولو تولتهم فيها الجهالات‏\n\n\n> إلا إذا انتهكوا الشرع الذي انتهكت *** حرمات منتهكية السمهريات‏\n\n\n> ففر من أجل حمى الرحمن أن له *** عينا لمن حكمت فيه الحميات‏\n\n\n> فإن أسماءك الحسنى بأسمائه *** الحسنى تناط وتدنيها العنايات‏\n\n\n### [أن احتقار شي‏ء من العالم لا يصدر من تقي يتقي الله‏]\n\n\nاعلم أيدنا الله وإياك بروح القدس أن احتقار شي‏ء من العالم لا يصدر من تقي يتقي الله فكيف من عالم بالله علم دليل أو علم ذوق فإنه ليس في العالم عين إلا وهو من شعائر الله من حيث ما وضعه الحق دليلا عليه ووصف من يعظم شعائر الله فقال ومن يُعَظِّمْ شَعائِرَ الله فَإِنَّها من تَقْوَى الْقُلُوبِ أي فإن عظمتها من تقوى القلوب أو الشعائر عينها من تقوى القلوب ثم إن كان شعائر الله في دار التكليف قد حد الله لها للمكلف في جميع حركاته الظاهرة والباطنة حدودا عمت جميع ما يتصرف فيه روحا وحسا بالحكم وجعلها حرمات له عند هذا المكلف فقال ومن يُعَظِّمْ حُرُماتِ الله وتعظيمها أن يبقيها حرمات كما خلقها الله في الحكم فإن ثم أمورا تخرجها عن إن تكون حرمات كما تكون في الدار الآخرة في الجنة على الإطلاق من غير منع وهو قوله تعالى نَتَبَوَّأُ من الْجَنَّةِ حَيْثُ نَشاءُ ولَكُمْ فِيها ما تَشْتَهِي أَنْفُسُكُمْ وقوله إِنَّ أَصْحابَ الْجَنَّةِ الْيَوْمَ في شُغُلٍ فاكِهُونَ وارتفع الحجر فربما يقام العبد في دار التكليف في هذا الموطن فيريد التصرف فيه كما تعطيه حقيقته ولكن في موطنه فيسقط حرمات الله في ذلك فلا يرفع بها رأسا ولا يجد لها تعظيما فيفقد خيرها إذا لم يعظمها عند ربه كما قال ومن يُعَظِّمْ حُرُماتِ الله فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ وإنما قال هذا ولم يتوعد بسبب أن أصحاب الأحوال إذا غلبت عليهم كانوا أمثال المجانين ارتفع عنهم القلم فيفوتهم لذلك خير كثير عند الله ولهذا لا يطلب الحال أحد من الأكابر وإنما يطلب المقام ونحن في دار التكليف فما فاتنا في هذه الدار من ذلك فقد فاتنا خيره هنالك فنعلم قطعا أنا لسنا من أهل العناية عند الله بفوت هذا الخير هذا إذا لم تتعمل في تحصيل هذا الحال الذي يفوتنا هذا الخير فكيف بنا إذا اتصفنا بهذا الحكم المفوت للخير عن نظر في أصول الأمور حين نعرف بعض حقائقها فيكون في ذلك البعض المفوت لنا هذا الخير وقد رأينا منهم جماعة كثيرة من أصحاب النظر في ذلك من غير حال ذوقي الله يعيذنا منه حالا ونظرا ولما كان الدليل يشرف بشرف المدلول والعالم دليل على وجود الله فالعالم شريف كله فلا يحتقر شي‏ء منه ولا يستهان به هذا إذا أخذناه من جهة النظر الفكري وهو في القرآن في قوله أَ فَلا يَنْظُرُونَ ... إِلَى السَّماءِ كَيْفَ رُفِعَتْ وإِلَى الْجِبالِ كَيْفَ نُصِبَتْ الآيات النظرية كلها الواردة في القرآن وكقوله أَ ولَمْ يَنْظُرُوا في مَلَكُوتِ السَّماواتِ والْأَرْضِ وقوله إِنَّ في خَلْقِ السَّماواتِ والْأَرْضِ الآية وقوله أَ لَمْ تَرَ إِلى‏ رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وقوله أَ لَمْ تَرَ أَنَّ الله يَسْجُدُ لَهُ‏\nالآية وكقوله سَنُرِيهِمْ آياتِنا في الْآفاقِ وفي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ وأمثال هذه الآيات وأما عند أهل الكشف والوجود فكل جزء في العالم بل كل شي‏ء في العالم أوجده الله لا بد أن يكون مستندا في وجوده إلى حقيقة الإلهية فمن حقره أو استهان به فإنما حقر خالقه واستهان به ومظهره وكل ما في الوجود فإنه حكمة أوجدها الله لأنه صنعة حكيم فلا يظهر إلا ما ينبغي لما ينبغي كما ينبغي فمن عمي عن حكمة الأشياء فقد جهل ذلك الشي‏ء ومن جهل كون ذلك الأمر حكمة فقد جهل الحكيم الواضع له ولا شي‏ء أقبح من الجهل فإن قلت فالجهل من العالم وقد قبحته فقد قبحت من استند إليه الجهل في وجوده قلنا كان يصح هذا لو كان الجهل نسبة وجودية فالجهل إنما هو عبارة عن عدم العلم لا غير فليس بأمر وجودي والعدم هو الشر والشر قبيح لنفسه حيثما فرضته ولهذا\n\n\nورد في الخبر الصحيح أن النبي صَلَّى اللهُ عَليهِ وسَلَّم قال في دعائه ربه تعالى والخير كله في يديك والشر ليس إليك‏\n\n\nفما نسب الشر إليه فلو كان الشر أمرا وجوديا لكان إيجاده إلى الله إذ لا فاعل إلا الله فالوجود كله خير لأنه عين الخير المحض وهو الله تعالى ثم نرجع إلى أصل الباب وهو قولنا من حقر غلب فنبين ذلك في الهمم وذلك أن أصل هذا إن كان كل شخص احتقر شيئا فإن همته تقوى على التأثير فيه وعلى قدر ما يعظم عنده يقل التأثير فيه أو ربما يؤدي إلى أن لا يكون له أثر فيه فإن الانفعال في الأشياء إنما هو للهمم أ لا ترى تأثير همم النساء في السحر المعروف عندهم المؤثر في المسحور ولو لا ما احتقروا المسحور وقطعوا بهمهم إن هذا الذي يفعلونه قولا أو عملا يؤثر في المسحور ما أثر فيؤثر بلا شك ومن ليست له هذه الهمة في قوة ذلك الفعل ويعظم عنده من يريد أن يسحره من الناس أن يؤثر فيه ذلك العمل أو القول وعمله أو قاله فإنه لا يؤثر جملة واحدة فلهذا قلنا من حقر غلب كما قيل لنا في هذه المنازلة فإذا صدق التوجه صح الوجود أ لا ترى الأشياء الكائنة في العالم وهي من العالم تعز أن تكون أثرا عن العالم أو محكومة للعالم فإن الأمثال تأنف من حيث حقيقتها أن يكون المؤثر فيها العالم فتحقر أمثالها أعني جزئيات العالم فتعلق الهمم بإيجاد أمر ما فتنظر في السبب المعين لها على إيجاد ذلك الأمر في العالم وتبحث عنه إن كان من قبل الأفعال أو الأقوال فتشرع في ذلك العمل أو القول فإن كان مما يعز بحيث أن لا تتمكن في الأثر فيه إلا بالتوجه إلى الله فتتوجه في ذلك بالدعاء والصدق إلى الله فتؤثر بذلك التوجه تلك الهمة فإن كان صاحب الهمة مؤمنا احتقر ذلك المؤثر فيه في جنب قوة الله وعظمته وإن لم يكن احتقره في قوة همته وما استعان به على التأثير فيه فهو مغلوب عنده على كل حال وأصله الاحتقار فإن كل شي‏ء في العالم بالنظر إلى عظمة الله حقير وهذا من علم النسب وكل شي‏ء في العالم إذا نظرته بتعظيم الله لا بعظمته فهو عظيم وهو الأدب فإنه لا ينبغي أن ينسب إلى العظيم إلا ما يستعظم فإنه تعظيم عظمته في نفس من نظره بهذا النظر فإن استحقره فلم يعظم في نفسه بوجه ذلك التعظيم الذي في نفس من عظم عنده ذلك الشي‏ء من العالم وربما يحتج بقوله وما ذلِكَ عَلَى الله بِعَزِيزٍ فينبغي للعالم أن لا يتصور هذه الآية إلا حتى يتصور عزة ذلك الشي‏ء على أمثاله فإذا حصلت عنده عزة ذلك الشي‏ء حينئذ يقول وما ذلِكَ عَلَى الله بِعَزِيزٍ وإن كان علينا بعزيز فيثبت العزيز للعزيز هذا هو الأدب والتعظيم فالشي‏ء على عزته حقير بالنسبة إلى عزة الله التي لا تقبل التأثير لأجل هذا الحكم فإن احتج علينا من علم حقيقة ما كنا أومأنا إليه في حال من يسخط الله ويرضيه هل يدخل هذا الأثر الحاصل من الكون في الجناب الإلهي في هذا الباب أم لا قلنا لا يدخل فإن العالم بكل شي‏ء بِيَدِهِ مَلَكُوتُ كُلِّ شَيْ‏ءٍ وتصريف كل شي‏ء إذ هو الموجد أسباب السخط والرضي والإجابة في الدعاء فما خرج عنه شي‏ء يكون لذلك الشي‏ء أثر فيه فهو محرك العالم ظاهرا وباطنا في كل ما يريد كونه فإنه كان ثم أثر فيه فهو الذي أثر في نفسه ما العالم أثر فيه بل غايتنا فيه إن نقول أثر في نفسه إن قلنا بذلك العالم أي بتقدم هذا السبب وهو إيجاده الأمر الموجب للسخط عليه في هذا الشخص فأسخط الله بهذا الفعل الذي أوجده في هذا العبد لشقاوة هذا العبد أو ليظهر فيه عقوبته ومغفرته وحكم رحمته على قدر ما يظهر فيه عقيب الأمر المسخط وأما قوله في المنازلة من استهين منع فقد يكون من استهين في حقه ذلك الشي‏ء منع لأنه جاهل بما طلب فيكون من استهين ذلك المطلوب في حقه منع لما هو أعلى منه فإن الطالب قد يجهل قدر ما يطلب ويعظم عنده لعدمه إياه وهو عند الله بالنسبة إلى هذا الطالب دون هذا الطالب يمنعه مطلوبه فيتخيل‏\nالممنوع منه أن ذلك لإهانته على من بيده إعطاء ما سأل فيه وليس كذلك فيفتح الله إن شاء عين بصيرته ويرزقه الكشف على نفسه وعلى حقيقة ما طلب ويريه الحق في ذلك الكشف أن الذي طلبه ما هو بذلك ويعرف شرف نفسه عن إن يتصف بالافتقار إلى الله في طلب مثل هذا فيعلم إن الله ما منعه لإهانته عليه وإنما منعه لاستهانة ذلك المطلوب بالنسبة إليه فيشكر الله على منع ذلك هذا وجه من وجوه قوله من استهين منع والوجه الآخر أن يطلب الطالب فوق قدره حتى لو أعطيه ما قبله لأنه يضعف عن حمله فيمنع لإهانته بالنسبة إلى ما طلبه وهو عكس الأول فيكون منع الله إياه رحمة به مثل قوله ولَوْ بَسَطَ الله الرِّزْقَ لِعِبادِهِ لَبَغَوْا في الْأَرْضِ لأنهم يضعفون عن القيام بما يستحقه بسط الرزق من الشكر وليس في وقته إلا البغي به والكفر والأشر والبطر ويظهر ذلك في أرباب المناصب في الدنيا فإذا رأيت صاحب المنصب يحكم عليه المنصب فتعلم أنه دون المنصب وأنه مهان بصرفه المنصب بعزته كيف يشاء فلا يزال مذموما بكل لسان من الحق ومن الخلق وإذا رأيت صاحب المنصب يصرف المنصب ويحكم على المنصب فتعلم أنه فوق المنصب فيكون محمودا بكل لسان عند الله وعند العالم فيمنع بحق وحكمة ويعطي بحق وحكمة كما قال الحق عن نفسه ولكِنْ يُنَزِّلُ بِقَدَرٍ ما يَشاءُ وذلك لعلم هذا الشخص بالأوزان فإن الله يقول إِنَّهُ بِعِبادِهِ خَبِيرٌ بَصِيرٌ فيعلم على من يبسط رزقه وعلى من يقبض عنه ذلك القدر الذي بسطة على غيره فبغى به ولذلك ما ذكر إلا عموم البسط في العباد كلهم وأضاف البغي للكل لأنه قد بسط للبعض فوقع منهم البغي فيما بسطة له لأنه شغله عن حاجة نفسه الضرورية بحاجة نفسه التي هي غير ضرورية كملك بسط الله له في الملك فأعطاه افتقاره الأصلي أن يسعى في تحصيل ملك غيره ولم يقنع بما عنده وقد كان قبل حصول ما هو فيه عنده يشتهي أنه يحصل له بعضه ويقنع به فلما أعطاه ما قنع وتشوق إلى الزيادة مما هو في يد غيره فلم يحصل له ذلك إن حصل إلا بالبغي في الأرض فربما أداه ذلك البغي إلى زوال ما بيده فيندم عند ذلك ويعلم أنه ما عاد عليه إلا بغيه فلو كان عزيزا في طلبه غير مهان ما منع هكذا يقول عن نفسه وقد يكون منع الله ذلك في حقه وأخذ ما كان بيده سببا إلى رجوعه إلى الله وتوبته ليسعده الله بذلك فالعاقل ينظر في أحواله وتصرفاته وما أهله الله له ويعلم أن ذلك كله خطاب الحق بالسنة الأحوال فيفتح عين\n\n\nالفهم وسمعه لذلك الخطاب العقلي والحالي فيعمل بمقتضى فهمه فيه فإن قلت فإن كان فهمه فيه ما تعطيه قوة ذلك المنصب قلنا ليس ذلك نريد وما غاب عنا هذا الذي دخلت علينا به ولكن الله قد وضع لنا في العالم الموازين الشرعية لنقيم لها الوزن بالقسط فإذا أعطى ذلك الأمر الذي يريد تمشيته في العالم بالوزن أخذنا منه قدر ما يدخل الميزان وتركنا منه ما لا يحتمله الميزان فإن في مقابلة كفة الموزون مقدارا في الكفة الأخرى وذلك المقدار هو الذي يعين لنا من هذا الموزون وما نحتاج إليه في الوقت وهذا معنى قوله يُنَزِّلُ بِقَدَرٍ ما يَشاءُ وهو القدر الذي في الكفة الأخرى من الميزان وما نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَعْلُومٍ وقد يكون الميزان مكيلا فهو على قدر الكيل والفرق بين المكيال والميزان أن الميزان خارج عنك فنأخذ من الموزون قدر ما يقابله من الكفة الأخرى والمكيال هو عين ذاتك من حيث ما هي متصفة بحالة ما فذلك عين كيلها فلا تأخذ من الأمر إلا بقدر قبولها كما يأخذ المكيال فهو على الحقيقة كما هو في الميزان فإنه إذا رجح بأحد الكفتين فقد خرج عن أن يكون وزنا لأنه خرج عن مقدار ما يقابله إما بتطفيف أو غيره فالنبي صَلَّى اللهُ عَليهِ وسَلَّم لما نزل عليه من الشرائع مكيال لا ميزان والحق لما لم يصح أن يكون محلا للأمر لم ينزل نفسه منزلة المكيال لكن وصف نفسه بأن بيده الميزان يخفض القسط ويرفعه بحسب مراتب العالم فكل خفض في ميزان الحق ورفع فهو عين الاعتدال بين الكفتين في الميزان الموضوع في العالم فإن الحق لا يزن إلا حقا فميزان‏\n\n\nالحق لا بد فيه من خفض ورفع لإحدى الكفتين ولو كان على الاعتدال ما ظهر كون في العالم أصلا ولا عدل فإذا أقيمت موازين الشرع الإلهي في العالم سرى العدل في العالم وكذلك لو أقيم الوزن الطبيعي في العالم لم يكن في العالم مرض ولا موت كما لا يكون في الجنة لأن الميزان الطبيعي في الجنة يظهر حكمه ولذلك هي دار البقاء ويرتفع فيها ميزان الشرع كما ارتفع في الدنيا ميزان الطبع فالمنع والعطاء لو لا الميزان ما كان لهما حكم في العالم والذي يزن هو الموصوف بالمعطي والمانع والضار والنافع وهُوَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ فإن قال قائل من أهل التحقيق إن الجود الإلهي‏\nليس فيه منع قلنا صدقت قال فإذا كنت صادقا وسلمت لي قولي فما حكم الاسم الإلهي المانع وهذا المنع الواقع في العالم لما ذا يرجع فإننا لا ننكره قلنا أما الجود الإلهي فلا منع فيه ولكن لا يقبله إلا الممكن لا يقبله المحال فإذا عرفت القابل عرفت المانع والمنع فالقوابل تقبل من هذا الجود المطلق بحسب استعداداتها كالشقة والقصار في فيض الشمس نورها فتبيض الشقة وتسود وجه القصار إن كان أبيض فيقول لهما الحكيم النور واحد ولكن مزاج القصار لا يقبل من نور الشمس إلا السواد والشقة على مزاج يقبل البياض فمزاجك منعك من قبول البياض ويقال للشقة مزاجك منعك من قبول السواد فلكل واحد من المذكورين أن يقول فالمسألة بحالها لم لم تعطني المزاج الذي يقبل السواد والقصار يقول لم لم تعطني المزاج الذي يقبل البياض قلنا لا بد في العالم من شقة وقصار فلا بد من مزاج يقبل البياض ومزاج يقبل السواد فلا بد منكما كنتما ما كنتما فإن العالم لا بد فيه من كل شي‏ء فلا بد أن يكون فيه كل مزاج والحق تعالى ما هو فعله مع الأغراض التي أوجدها في عباده وإنما هو مع ما تطلبه الحكمة والذي اقتضته الحكمة هو الواقع في العالم فعين ظهوره هو عين الحكمة فإنه فعل الله لا يعلل بالحكمة بل هو عين الحكمة فإنه لو علل بالحكمة لكانت الحكمة هي الموجبة له ذلك فيكون الحق محكوما عليه والحق تعالى لا يكون محكوما عليه فلا يوجب موجب عليه شيئا إلا ما ذكر لنا أنه أوجب على نفسه لا أنه أوجب عليه موجب غيره أمرا ما فأي محل فرضته لمزاج خاص يتصور أن يقول قد منعني غير هذا المزاج وهذا غلط لأن عين المزاج هو عين ما ظهر لا غيره ولا يصح أن يقول الشي‏ء عن نفسه لم لم يكن غيري كما قدمنا في الباب الذي قبل هذا الباب أن التركيب ليس إلا البسائط فالتركيب نسبة والنسب عدمية وقد ظهر أمر لم يكن يظهر لو لا تركيب هذه البسائط وجمعها وما هو هذا الظاهر غير أعيان البسائط وكذلك هذا الظاهر عن هذا المزاج ما هو غير المزاج فما ثم على الحقيقة من يقول لأي شي‏ء منعت وإذا لم يكن ثم لم يصح المنع في الجود الإلهي فبقي المنع والمانع إنما يرجعان إلى نسب مقدرة وما كان أحد أظهره الله على هذا العلم وأمثاله وتنزلت ألسنة الشرائع بحسب ما وقع عليه التواطؤ في ألسنة العالم ولذلك قال تعالى وما أَرْسَلْنا من رَسُولٍ إِلَّا بِلِسانِ قَوْمِهِ فلا ينزل إلا بما تواطئوا عليه فقد يكون التواطؤ على صورة ما هي الحقائق عليه وقد لا يكون والحق تابع لهم في ذلك كله ليفهم عنه ما أنزله في أحكامه وما وعد به وأوعد عليه كما قد دل الدليل العقلي على استحالة حصر الحق في أينية ومع هذا جاء لسان الشرع بالأينية في حق الحق من أجل التواطؤ الذي عليه لسان المرسل إليهم فقال للسوداء أين الله فلو قالها غير الرسول لشهد الدليل العقلي بجهل القائل فإنه لا أينية له فلما قالها الرسول وبانت حكمته وعلمه علمنا أنه ليس في قوة فهم هذا المخاطب أن يعقل موجدة إلا بما تصوره في نفسه فلو خاطبه بغير ما تواطأ عليه وتصوره في نفسه لارتفعت الفائدة المطلوبة ولم يحصل القبول فمن حكمته أن سأل مثل هذه بمثل هذا السؤال وبهذه العبارة ولذلك لما أشارت إلى السماء قال فيها إنها مؤمنة أي مصدقة بوجود الله ولم يقل عالمة فالعالم يصحب الجاهل في جهله بعلمه والجاهل لا يقدر على صحبة العالم على علمه إن لم يكن العالم ينزل إليه في صورة جهله وكل ذلك حكمة إلهية في العالم‏\n\n\n### [المهانة حقيقة العالم‏]\n\n\nواعلم أن المهانة حقيقة العالم التي هو عليها لأنه بالذات ممكن فقير فهو ممنوع من جميع نيل أغراضه وإراداته منعا ذاتيا ولا يحجبنك وقوع بعض مراداته ونيل بعض أغراضه عما قلناه في حقه فإن ذلك ما وقع له إلا بإرادة الحق لا بإرادته فذلك المراد وإرادة العبد معا إنما هما واقعان بإرادة الحق فهو ممتنع بالذات أن يكون شي‏ء في الوجود موجودا عن إرادة العبد ولو كان لإرادة العبد نفوذ في أمر خاص لعم نفوذها في كل شي‏ء لو كان ذلك المراد وقع لعين إرادة الممكن فتعين إن ذلك الواقع وقع بإرادة الله عز وجل فالعالم ممنوع لذاته كما هو ممكن مهان لذاته وإنما كان مهانا لذاته لأن العبودية له لذاته وهي الذلة وكل ذليل مهين وكل مهين محتقر وكل محتقر مغلوب فصح ما جاء في المنازلة من أنه من حقر غلب ومن استهين منع والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter 385: Concerning the Knowledge of the Spiritual Station of Him Who Holds in Contempt Being Overcome, and Him Who is Held in Contempt Being Denied.\n\nDo not hold in contempt the servants of Allah, for they possess a rank,\nEven if all the spiritual stations (المقامات) were gathered for you.\nDo not His Names (أسماؤه) reveal their realities (حقائقهم),\nEven if ignorance (الجهالات) takes charge of them therein?\nExcept if they violate the Law (الشرع) whose sacred limits (حرمات) are violated\nBy those who violate the spears (السمهريات).\nSo flee for the sake of the sanctuary of the All-Merciful (الرحمن), for He has an eye\nUpon him over whom the sanctuaries (الحميات) have ruled.\nFor your Beautiful Names (أسماءك الحسنى) are linked to His Beautiful Names (أسمائه الحسنى),\nAnd the Divine Concerns (العنايات) bring them near.\n\n[That holding anything in the World (العالم) in contempt does not issue from a pious person who fears Allah]\n\nKnow—may Allah support us and you with the Holy Spirit (روح القدس)—that holding anything in the World (العالم) in contempt does not issue from a pious person who fears Allah. How, then, could it issue from one who has Knowledge of Allah (عالم بالله), whether through demonstrative knowledge (علم دليل) or experiential knowledge (علم ذوق)? For there is no entity (عين) in the World (العالم) except that it is one of the symbols (شعائر) of The Real (الحق), inasmuch as The Real established it as a sign pointing to Him. He described those who venerate the symbols of Allah, saying: <<وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ>> (And whosoever venerates the symbols of Allah, indeed, that is from the piety of the hearts).\n\nThat is, their veneration stems from the piety of the hearts, or the symbols (الشعائر) themselves are from the piety of the hearts. Furthermore, if the symbols of Allah are in the Abode of Responsibility (دار التكليف), Allah has set limits (حدودا) for the responsible person (المكلف) in all his outward and inward movements—limits that encompass everything he deals with, spiritually and physically, by Divine Decree (بالحكم). He made these limits sacred things (حرمات) for this responsible person, saying: <<وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ>> (And whosoever venerates the sacred things of Allah).\n\nVenerating them means keeping them as sacred things (حرمات) just as Allah created them in the Decree (في الحكم). For there are matters that remove them from being sacred things, as they are in the Hereafter (الدار الآخرة) in Paradise (الجنة) absolutely, without restriction. This is His saying, the Exalted: <<نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ>> (We shall settle in Paradise wherever we will), and His saying: <<وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنفُسُكُمْ>> (And therein you will have whatever your souls desire), and His saying: <<إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ>> (Indeed, the companions of Paradise, that Day, will be busy in enjoyment).\n\nThe restriction (الحجر) is lifted. Sometimes the servant (العبد) is established in the Abode of Responsibility (دار التكليف) in this station (الموطن) and desires to act therein as his reality (حقيقته) dictates, but within his station. He thus disregards the sacred things (حرمات) of Allah in that action, paying them no heed and finding no veneration for them. Consequently, he loses their goodness (خيرها) if he does not venerate them before his Lord, as He said: <<وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ>> (And whosoever venerates the sacred things of Allah, it is better for him in the sight of his Lord).\n\nHe only said this and did not issue a threat because the people of spiritual states (أصحاب الأحوال), when these states overwhelm them, become like the insane, and the pen (القلم) is lifted from them. Thus, they miss much goodness (خير كثير) with Allah because of this. This is why none of the great masters (الأكابر) seeks the spiritual state (الحال); rather, they seek the spiritual station (المقام). We are in the Abode of Responsibility (دار التكليف). Whatever goodness we miss in this abode, we have missed its goodness there (in the Hereafter). We know with certainty that we are not among the People of Divine Concern (أهل العناية) with Allah due to the loss of this goodness. This is if we did not intentionally strive to attain this state (الحال) that causes us to miss this goodness. What then of us if we are characterized by this decree (الحكم) that causes the loss of goodness, based on a consideration of the fundamental principles (أصول الأمور), when we know some of their realities (حقائقها)? This loss of goodness would then be due to that partial knowledge.\n\nWe have seen many groups among them who engage in intellectual consideration (النظر) of this matter without having an experiential state (حال ذوقي). May Allah protect us from it, both as a state and as a consideration. Since the sign (الدليل) is honored by the honor of the Signified (المدلول), and the World (العالم) is a sign of Allah’s Existence (وجود الله), the entire World is noble. Therefore, nothing in it should be held in contempt or treated lightly (يستهان به).\n\nThis is if we approach it from the perspective of intellectual consideration (النظر الفكري), which is found in the Quran in His saying: <<أَفَلَا يَنظُرُونَ إِلَى السَّمَاءِ كَيْفَ رُفِعَتْ وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ>> (Do they not look at the sky, how it is raised? And at the mountains, how they are fixed?)—all the verses of consideration (الآيات النظرية) mentioned in the Quran—and like His saying: <<أَوَلَمْ يَنظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ>> (Have they not looked into the dominion [ملكوت] of the heavens and the earth?), and His saying: <<إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ>> (Indeed, in the creation of the heavens and the earth...), and His saying: <<أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ>> (Have you not considered your Lord, how He extends the shadow?), and His saying: <<أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ>> (Do you not see that to Allah prostrates...), and like His saying: <<سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ>> (We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is The Real [الحق]), and similar verses.\n\nAs for the People of Unveiling (أهل الكشف) and Existence (الوجود), every part of the World (العالم)—indeed, everything in the World that Allah brought into existence—must necessarily be supported in its existence (وجوده) by the Reality of Divinity (حقيقة الإلهية). Thus, whoever holds it in contempt or treats it lightly has only held its Creator in contempt, treated Him lightly, and treated His manifestation (مظهره) lightly.\n\nEverything in Existence (الوجود) is a wisdom (حكمة) that Allah brought into being, because it is the handiwork (صنعة) of a Wise One (حكيم). Nothing manifests except what is fitting, for what is fitting, in the manner that is fitting. Whoever is blind to the wisdom of things has been ignorant of that thing. And whoever is ignorant of that matter being a wisdom has been ignorant of the Wise One (الحكيم) who established it. Nothing is uglier than ignorance (الجهل). If you say: \"Ignorance (الجهل) is part of the World (العالم), and since you have deemed it ugly, you have deemed ugly that upon which ignorance relies for its existence,\" we reply: This would be correct if ignorance were an existent relation (نسبة وجودية). Ignorance is merely the expression of the absence of Knowledge (عدم العلم), nothing more. It is not an existent matter (أمر وجودي). Non-existence (العدم) is evil (الشر), and evil is inherently ugly wherever you posit it. For this reason, it is mentioned in the sound tradition (الخبر الصحيح) that the Prophet, peace and blessings be upon him, said in his supplication to his Lord, the Exalted: \"And all goodness (الخير) is in Your hands, and evil (الشر) is not attributed to You.\"\n\nThus, evil (الشر) is not attributed to Him. If evil were an existent matter (أمرا وجوديا), its creation would be attributed to Allah, since there is no agent (فاعل) but Allah. Therefore, all Existence (الوجود) is goodness (خير) because it is the very essence of Pure Goodness (الخير المحض), which is Allah, the Exalted.\n\nThen we return to the principle of the chapter, which is our saying: \"He who holds in contempt is overcome.\" We shall explain this concerning spiritual resolve (الهمم). The basis of this is that whenever a person holds something in contempt (احتقر شيئا), his spiritual resolve (همته) gains strength to influence it. Conversely, the more he venerates something, the less influence he has over it, or perhaps he will have no influence over it at all. For the susceptibility of things to influence is due only to spiritual resolves (الهمم). Do you not see the influence of the resolves of women in the sorcery known among them, which affects the bewitched? If they did not hold the bewitched in contempt and firmly resolve with their spiritual resolve (بهمهم) that what they do, whether verbally or practically, will affect the bewitched, it would not affect him. But it does affect him, without doubt.\n\nBut whoever does not possess this spiritual resolve (الهمة) in the power of that action, and who venerates the person he wishes to bewitch, believing that the action or word, if performed or spoken, will affect him, then it will not affect him at all. Therefore, we said: \"He who holds in contempt is overcome,\" just as it was said to us concerning this spiritual station (المنازلة). Thus, if the turning (التوجه) is sincere, Existence (الوجود) is sound. Do you not see that the things existing in the World (العالم), which are part of the World, resist being an effect of the World or being governed by the World? For things of the same kind (الأمثال), by virtue of their reality (حقيقتها), disdain that the World should be the agent influencing them. So, they hold their likes—meaning the particulars (جزئيات) of the World—in contempt. Spiritual resolves (الهمم) then attach themselves to bringing something into existence. They look for the specific cause (السبب المعين) that assists them in bringing that thing into existence in the World, and they search for it, whether it is related to actions or words. Then they embark upon that action or word. If the matter is difficult, such that influence over it cannot be achieved except by turning (التوجه) to Allah, then the person turns to Allah with supplication (الدعاء) and sincerity (الصدق). That spiritual resolve (الهمة) then influences through that turning. If the possessor of the resolve is a believer (مؤمنا), he holds that thing being influenced in contempt compared to the power and greatness of Allah. If he is not a believer, he holds it in contempt due to the strength of his own resolve and what he used to assist him in influencing it. In any case, the thing is overcome (مغلوب) in his view, and its origin is contempt (الاحتقار).\n\nFor everything in the World (العالم), when viewed in relation to the Greatness of Allah (عظمة الله), is contemptible (حقير). This is from the science of relations (علم النسب). Yet, everything in the World, if you view it with the veneration due to Allah, not with its own greatness, is great. This is proper conduct (الأدب), for nothing should be attributed to the Great One (العظيم) except what is deemed great. This is the veneration of His Greatness in the soul of the one who views it with this perspective. If he holds it in contempt, it is not venerated in his soul in the manner of the veneration that exists in the soul of one for whom that thing in the World is great. He might argue using the saying: <<وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ>> (And that is not difficult [عزيز] for Allah). It is incumbent upon the knower (العالم) not to conceive of this verse until he first conceives of the difficulty (عزة) of that thing for its likes. When the difficulty of that thing is established for him, then he says: <<وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ>> (And that is not difficult for Allah), even if it is difficult for us. Thus, he affirms the Difficult (العزيز) for the Difficult. This is proper conduct (الأدب) and veneration (التعظيم). The thing, despite its difficulty (عزته), is contemptible (حقير) compared to the Difficulty (عزة) of Allah, which does not accept influence due to this decree (الحكم). If someone who knows the reality of what we alluded to—concerning the state of one who angers Allah and one who pleases Him—argues against us, asking whether this influence resulting from creation (الكون) upon the Divine Presence (الجناب الإلهي) falls under this chapter or not, we say: It does not fall under it.\n\nFor the Knower of all things, <<بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ>> (in Whose hand is the dominion [ملكوت] of all things), and the disposal of all things, since He is the Originator of the causes of anger, pleasure, and the answer to supplication (الدعاء). Nothing has departed from Him such that that thing could have an influence upon Him. He is the Mover of the World (العالم), outwardly and inwardly, in everything He wills to exist. If there were an influence upon Him, it would be He who influenced Himself, not the World influencing Him. Rather, the utmost we can say is that He influenced Himself—if we speak of the World—meaning by the precedence of this cause, which is His bringing into existence the matter that necessitates His anger upon this person. Thus, Allah became angry through this act which He created in this servant (العبد), either due to the wretchedness (شقاوة) of this servant or to manifest in him His punishment, His forgiveness, and the decree of His Mercy (حكم رحمته), according to what manifests following the matter that causes anger.\n\nAs for the saying in the spiritual station (المنازلة): \"He who is held in contempt is denied (منع),\" it may be that the one for whom that thing is held in contempt is denied because he is ignorant of what he sought. Thus, the one for whom the sought thing is held in contempt is denied something higher than it. For the seeker (الطالب) may be ignorant of the value of what he seeks, and it becomes great in his eyes because he lacks it, while in Allah’s sight, relative to this seeker, it is beneath him. Allah denies him what he sought. The one who is denied then imagines that this is due to his being held in contempt by the One in whose hand is the granting of what he asked for, but this is not the case. If Allah wills, He opens the eye of his insight (عين بصيرته) and grants him Unveiling (الكشف) concerning himself and the reality (حقيقة) of what he sought. The Real (الحق) shows him in that Unveiling (الكشف) that what he sought is not worthy of him, and he recognizes the nobility of his soul (شرف نفسه) above being characterized by need (الافتقار) before Allah in seeking such a thing. He then knows that Allah did not deny him out of contempt for him, but rather denied him because of the contemptibility of that sought thing relative to him. He then thanks Allah for that denial. This is one aspect of the saying: \"He who is held in contempt is denied.\"\n\nThe other aspect is that the seeker asks for something beyond his capacity (قدره), such that even if it were granted to him, he could not accept it because he would be too weak to bear it. He is thus denied due to his contemptibility (إهانته) relative to what he sought. This is the opposite of the first case. Allah’s denial of him is thus a mercy (رحمة) to him, like His saying: <<وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ>> (And if Allah were to extend the provision [الرزق] for His servants, they would surely transgress upon the earth). This is because they are too weak to fulfill the gratitude (الشكر) that the extension of provision (بسط الرزق) necessitates, and at that time, they would only engage in transgression (البغي), ingratitude (الكفر), insolence (الأشر), and arrogance (البطر) through it. This is evident in the holders of high positions (أرباب المناصب) in the world. If you see the holder of a position being governed by the position, know that he is beneath the position and that he is held in contempt (مهان) by the position, which disposes of him by its own difficulty (عزته) however it wills. He remains censured by every tongue, both from The Real (الحق) and from creation (الخلق). But if you see the holder of a position disposing of the position and governing the position, know that he is above the position. He is thus praised by every tongue, both with Allah and with the World (العالم). He denies with truth and wisdom (حكمة) and grants with truth and wisdom, just as The Real (الحق) said about Himself: <<وَلَكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ>> (But He sends down [provision] in due measure [بقدر] as He wills). This is due to this person’s knowledge of the measures (الأوزان).\n\nFor Allah says: <<إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ>> (Indeed, He is of His servants All-Aware, All-Seeing). He knows upon whom to extend His provision (رزقه) and from whom to withhold that measure (القدر) which He extended to others, causing them to transgress (بغى به). That is why He only mentioned the generality of extension (عموم البسط) among all servants and attributed transgression (البغي) to all, because He extended provision to some, and transgression occurred from them concerning what He extended to them. This is because it distracted him from his essential needs (حاجة نفسه الضرورية) by his non-essential needs. Like a king to whom Allah extended dominion (الملك). His original neediness (افتقاره الأصلي) led him to strive to acquire the dominion of others, and he was not content with what he possessed. Before attaining his current state, he had desired to acquire only a part of it and be content with it. But when Allah gave him what he was not content with, he yearned for an increase from what was in the hands of others. He did not achieve this, if he achieved it at all, except through transgression (البغي) on earth. That transgression might lead to the removal of what he possessed, whereupon he regrets and knows that nothing returned to him but his own transgression. If he had been noble (عزيزا) in his seeking, not held in contempt (غير مهان), he would not have been denied—this is what he says about himself.\n\nIt may be that Allah’s denial of that thing in his case, and the taking away of what he possessed, is a cause for his return to Allah and his repentance (توبته), so that Allah may grant him happiness through it. The intelligent person (العاقل) looks at his states (أحواله), his actions, and what Allah has qualified him for, and knows that all of this is the address (خطاب) of The Real (الحق) through the tongues of the states (ألسنة الأحوال). He opens the eye of understanding (عين الفهم) and his hearing to that intellectual and experiential address, and acts according to the dictates of his understanding therein. If you say: \"What if his understanding therein is what the power of that position grants him?\" We reply: That is not what we mean. What you have brought up has not escaped us. However, Allah has established for us in the World (العالم) the legal balances (الموازين الشرعية) so that we may establish the weighing with justice (بالقسط). When that matter which he wishes to implement in the World is given by weight, we take from it only the measure that enters the balance (الميزان) and leave what the balance cannot bear. For opposite the pan of the weighed item is a measure (مقدار) in the other pan, and that measure is what determines for us what we need from this weighed item at the time. This is the meaning of His saying: <<يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ>> (He sends down in due measure as He wills), which is the measure (القدر) in the other pan of the balance. And <<وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَّعْلُومٍ>> (And We do not send it down except in a known measure [بقدر معلوم]).\n\nThe balance (الميزان) may sometimes be a measure of capacity (مكيال), so it is according to the capacity (الكيل). The difference between the measure of capacity (المكيال) and the balance (الميزان) is that the balance is external to you, so we take from the weighed item the measure corresponding to the other pan. The measure of capacity (المكيال) is the very essence (عين ذاتك) of yourself, inasmuch as it is characterized by a certain state (حالة ما). That is the very capacity (كيلها) of it. Thus, you only take from the matter according to your capacity for acceptance, just as the measure of capacity takes. In reality, it is the same as the balance. For if one of the pans outweighs the other, it has ceased to be a weighing, because it has departed from the measure corresponding to it, either by short-changing (تطفيف) or otherwise. When the Law (الشرائع) descended upon the Prophet, peace and blessings be upon him, it was a measure of capacity (مكيال), not a balance (ميزان). Since it is not correct for The Real (الحق) to be a locus (محلا) for the matter, He did not place Himself in the position of the measure of capacity. Rather, He described Himself as having the Balance (الميزان) in His hand, lowering and raising justice (القسط) according to the levels (مراتب) of the World (العالم).\n\nEvery lowering and raising in the Balance of The Real (ميزان الحق) is the very essence of equilibrium (الاعتدال) between the two pans in the balance established in the World. For The Real (الحق) weighs nothing but truth. The Balance of The Real (ميزان الحق) must necessarily involve the lowering and raising of one of the two pans. If it were always in equilibrium, no creation (كون) would appear in the World at all, nor would justice (عدل) exist. Thus, when the balances of the Divine Law (موازين الشرع الإلهي) are established in the World (العالم), justice (العدل) permeates the World. Likewise, if the natural weighing (الوزن الطبيعي) were established in the World, there would be no sickness or death in the World, just as there is none in Paradise (الجنة), because the natural balance (الميزان الطبيعي) manifests its decree (حكمه) in Paradise. That is why it is the Abode of Subsistence (دار البقاء). The balance of the Law (ميزان الشرع) is lifted there, just as the balance of nature (ميزان الطبع) is lifted in this world. Denial (المنع) and granting (العطاء)—were it not for the balance (الميزان)—would have no decree (حكم) in the World. The One who weighs is characterized as the Granter (المعطي), the Denier (المانع), the Harmful (الضار), and the Beneficial (النافع), and <<وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ>> (And He is All-Knowing of everything). If a speaker from the People of Verification (أهل التحقيق) says that the Divine Generosity (الجود الإلهي) contains no denial (منع), we say: You have spoken truly.\n\nHe says: \"If you are truthful and concede my statement, then what is the decree (حكم) of the Divine Name, the Denier (المانع), and to what does this denial (المنع) occurring in the World refer, since we do not deny it?\" We reply: As for the Divine Generosity (الجود الإلهي), there is no denial in it, but only the contingent (الممكن) accepts it; the impossible (المحال) does not accept it. If you know the recipient (القابل), you know the Denier (المانع) and the denial (المنع). The recipients (القوابل) accept from this Absolute Generosity (الجود المطلق) according to their preparedness (استعداداتها), like the linen cloth (الشقة) and the fuller (القصار) regarding the outpouring of the sun’s light. The linen cloth whitens, and the face of the fuller darkens, if it was white. The Wise One (الحكيم) says to them: \"The light is one, but the temperament (مزاج) of the fuller accepts nothing from the sun’s light but blackness, and the linen cloth is of a temperament that accepts whiteness. So, your temperament denied you the acceptance of whiteness.\" And it is said to the linen cloth: \"Your temperament denied you the acceptance of blackness.\"\n\nEach of the two mentioned may say: \"The question remains the same: Why did You not give me the temperament that accepts blackness?\" And the fuller says: \"Why did You not give me the temperament that accepts whiteness?\" We reply: There must be a linen cloth and a fuller in the World (العالم). Thus, there must be a temperament that accepts whiteness and a temperament that accepts blackness. You both must exist as you are, for the World must contain everything, and thus must contain every temperament. The Real (الحق), the Exalted, does not act according to the purposes (الأغراض) He created in His servants (عباده); rather, He acts according to what Wisdom (الحكمة) demands. What Wisdom necessitated is what occurs in the World (العالم). The very manifestation of a thing is the very essence of Wisdom. For the Act of Allah (فعل الله) is not caused by Wisdom; rather, it is the very essence of Wisdom. If it were caused by Wisdom, then Wisdom would be the necessitating factor for that act, and The Real (الحق) would be governed by a decree (محكوما عليه). The Real, the Exalted, cannot be governed by a decree. No necessitating factor (موجب) necessitates anything upon Him except what He mentioned to us that He necessitated upon Himself, not that a necessitating factor other than Him necessitated a matter upon Him. Therefore, any locus (محل) you posit for a specific temperament (مزاج خاص) cannot conceive of saying: \"Something other than this temperament denied me.\" This is an error, because the very essence of the temperament (عين المزاج) is the very essence of what manifested, nothing else. It is not correct for a thing to say about itself: \"Why was I not something else?\" as we presented in the chapter preceding this one: that Composition (التركيب) is nothing but simple elements (البسائط). Composition is a relation (نسبة), and relations are non-existent (عدمية). A matter has appeared that would not have appeared were it not for the composition and combination of these simple elements. Yet, this manifest thing is nothing other than the essences (أعيان) of the simple elements. Likewise, what manifests from this temperament (المزاج) is nothing other than the temperament itself. Therefore, in reality, there is no one who says: \"For what reason was I denied?\" And if there is no one, then denial (المنع) in the Divine Generosity (الجود الإلهي) is not valid. Thus, denial (المنع) and the Denier (المانع) only refer back to posited relations (نسب مقدرة).\n\nNo one was manifested by Allah upon this knowledge (العلم) and its likes. The tongues of the Laws (ألسنة الشرائع) descended according to what was conventionally agreed upon (التواطؤ) in the languages of the World (العالم). For this reason, the Exalted said: <<وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ>> (And We did not send any messenger except with the language of his people). Thus, He only sends down what they have conventionally agreed upon. The conventional agreement may correspond to the form upon which the realities (الحقائق) exist, or it may not. The Real (الحق) follows them in all of this so that what He has sent down concerning His decrees (أحكامه) and what He has promised and threatened may be understood from Him. Just as the intellectual demonstration (الدليل العقلي) has indicated the impossibility of confining The Real (الحق) to a \"where\" (أينية), yet the tongue of the Law (لسان الشرع) came with the \"where\" concerning The Real, due to the conventional agreement (التواطؤ) upon which the language of those addressed was based. So, He said to the black slave woman: \"Where is Allah?\" If someone other than the Messenger had said this, the intellectual demonstration would testify to the ignorance of the speaker, for The Real has no \"where\" (أينية). But when the Messenger said it, and his wisdom (حكمته) and knowledge (علمه) became clear, we knew that it was not within the capacity of this addressee’s understanding to comprehend His existence except through what she had conceived in her soul. If he had addressed her with something other than what she had conventionally agreed upon and conceived in her soul, the desired benefit would have been lost, and acceptance would not have occurred. Thus, it was part of his wisdom (حكمته) to ask such a person with such a question and such an expression. Therefore, when she pointed to the sky, he said of her that she was a believer (مؤمنة)—meaning, affirming the Existence (وجود) of Allah—and he did not say she was a knower (عالمة). The knower (العالم) accompanies the ignorant person (الجاهل) in his ignorance by means of his knowledge, but the ignorant person cannot accompany the knower in his knowledge unless the knower descends to him in the form of his ignorance. All of this is Divine Wisdom (حكمة إلهية) in the World (العالم).\n\n[Contemptibility is the Reality of the World]\n\nKnow that contemptibility (المهانة) is the reality (حقيقة) of the World (العالم) upon which it exists, because essentially (بالذات) it is contingent (ممكن) and poor (فقير). Thus, it is essentially denied (منعا ذاتيا) the attainment of all its purposes and desires. Do not let the occurrence of some of its desires and the attainment of some of its purposes veil you from what we have said concerning it, for that only occurred for it by the Will of The Real (إرادة الحق), not by its own will. That desired thing and the will of the servant (إرادة العبد) together only occur by the Will of The Real (إرادة الحق). It is essentially impossible (ممتنع بالذات) for anything in Existence (الوجود) to exist due to the will of the servant. If the will of the servant had influence over a specific matter, its influence would extend to everything, provided that the desired thing occurred due to the very will of the contingent being (الممكن). Thus, it is determined that what occurs happens by the Will of Allah, the Mighty and Majestic. Therefore, the World (العالم) is denied essentially (لذاته), just as it is contingent (ممكن) and held in contempt essentially (مهان لذاته). It is held in contempt essentially because servitude (العبودية) belongs to it essentially, and servitude is abasement (الذلة). Every abased one is held in contempt (مهين), and every one held in contempt is despised (محتقر), and every despised one is overcome (مغلوب). Thus, what came in the spiritual station (المنازلة) is confirmed: that \"He who holds in contempt is overcome, and he who is held in contempt is denied.\" And <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks The Real [الحق], and He guides to the way).",
    "ur": "باب نمبر تین سو پچاسی: اس منزل کی معرفت میں کہ جس نے حقیر جانا وہ مغلوب ہوا، اور جس کو حقیر سمجھا گیا وہ محروم ہوا۔\n\nاللہ کے بندوں کو ہرگز حقیر نہ جان، بے شک ان کا ایک مرتبہ ہے، اگرچہ تمہارے لیے تمام مقامات جمع کر دیے جائیں۔\nکیا اس (حق) کے اسماء ان کی حقیقتوں کو ظاہر نہیں کرتے؟ اگرچہ ان پر جہالتیں غالب آ جائیں۔\nمگر جب وہ شریعت کی خلاف ورزی کریں، جس کی حرمتیں نیزوں کی طرح توڑ دی گئی ہیں۔\nتو رحمن کی پناہ کی خاطر بھاگ جا، کیونکہ اس کی ایک نظر ہے اس پر جس میں پناہ گاہوں نے حکم کیا ہے۔\nپس بے شک تمہارے اسماء حسنیٰ اس (حق) کے اسماء حسنیٰ کے ساتھ منسلک ہیں اور عنایات انہیں قریب کرتی ہیں۔\n\n### [یہ کہ عالم کی کسی بھی شے کو حقیر جاننا کسی متقی شخص سے صادر نہیں ہوتا]\n\nجان لو، اللہ ہمیں اور تمہیں روح القدس (روح القدس) سے تائید بخشے، کہ عالم کی کسی بھی شے کو حقیر جاننا کسی ایسے متقی شخص سے صادر نہیں ہوتا جو اللہ سے ڈرتا ہو، تو پھر اس شخص سے کیسے صادر ہو سکتا ہے جو اللہ کو دلیل کے علم یا ذوق (الذوق) کے علم سے جانتا ہو؟ کیونکہ عالم میں کوئی بھی عین (حقیقت) ایسی نہیں مگر وہ اللہ کے شعائر (الشعائر) میں سے ہے، اس لحاظ سے کہ حق (الحق) نے اسے اپنی دلیل کے طور پر قائم کیا ہے۔ اور اس نے ان لوگوں کی تعریف کی جو اللہ کے شعائر کی تعظیم کرتے ہیں، پس فرمایا:\n**وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ**\n(اور جو شخص اللہ کے شعائر کی تعظیم کرتا ہے تو یہ دلوں کے تقویٰ میں سے ہے)\nیعنی ان کی تعظیم دلوں کے تقویٰ میں سے ہے، یا شعائر (الشعائر) کا عین دلوں کے تقویٰ میں سے ہے۔\n\nپھر اگر اللہ کے شعائر (الشعائر) دارِ تکلیف (دار التکلیف) میں ہیں، تو اللہ نے مکلف کے لیے اس کی تمام ظاہری اور باطنی حرکات میں حدود مقرر کر دی ہیں، جو روح اور حس کے لحاظ سے اس کے تمام تصرفات کو حکم کے ساتھ شامل ہیں۔ اور اس نے انہیں اس مکلف کے نزدیک اپنی حرمتیں (الحرمات) بنا دیا، پس فرمایا:\n**وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ**\n(اور جو شخص اللہ کی حرمتوں کی تعظیم کرتا ہے)\nاور ان کی تعظیم یہ ہے کہ انہیں حرمتیں ہی رہنے دیا جائے جیسا کہ اللہ نے انہیں حکم میں پیدا کیا ہے۔ کیونکہ پھر کچھ ایسے امور ہیں جو انہیں حرمتیں ہونے سے نکال دیتے ہیں، جیسا کہ آخرت میں جنت میں مطلقاً بغیر کسی ممانعت کے ہو گا، اور یہ اس کا قول ہے:\n**نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ**\n(ہم جنت میں جہاں چاہیں گے ٹھکانہ بنائیں گے)\nاور اس کا قول:\n**وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنفُسُكُمْ**\n(اور تمہارے لیے اس میں وہ سب کچھ ہے جو تمہارے دل چاہیں گے)\nاور اس کا قول:\n**إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ**\n(بے شک جنت والے آج کے دن شغل میں ہوں گے، مزے لوٹنے والے)\nاور وہاں پابندی اٹھا لی گئی ہے۔ پس بسا اوقات بندے کو دارِ تکلیف (دار التکلیف) میں اس مقام پر کھڑا کیا جاتا ہے، تو وہ اس میں تصرف کرنا چاہتا ہے جیسا کہ اس کی حقیقت اسے دیتی ہے، لیکن اپنے مقام میں۔ پس وہ اللہ کی حرمتوں کو گرا دیتا ہے، اور ان کی طرف کوئی توجہ نہیں کرتا اور نہ ہی ان کی کوئی تعظیم پاتا ہے، تو وہ ان کی بھلائی سے محروم ہو جاتا ہے جب وہ اپنے رب کے نزدیک ان کی تعظیم نہیں کرتا، جیسا کہ فرمایا:\n**وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ**\n(اور جو شخص اللہ کی حرمتوں کی تعظیم کرتا ہے تو وہ اس کے لیے اس کے رب کے نزدیک بہتر ہے)\nاور اس نے یہ اس لیے کہا اور وعید نہیں سنائی، کیونکہ اصحابِ احوال جب ان پر غالب آ جاتے ہیں تو وہ دیوانوں کی طرح ہو جاتے ہیں، ان سے قلم اٹھا لیا جاتا ہے، پس اس وجہ سے وہ اللہ کے ہاں بہت سی بھلائی سے محروم ہو جاتے ہیں۔ اسی لیے کوئی بھی اکابر حال (الحال) کا طالب نہیں ہوتا، بلکہ وہ مقام (المقام) کا طالب ہوتا ہے۔ اور ہم دارِ تکلیف (دار التکلیف) میں ہیں، پس جو بھلائی ہم سے اس دار میں فوت ہو گئی، وہ وہاں بھی فوت ہو گئی، پس ہم یقیناً جانتے ہیں کہ اس بھلائی کے فوت ہونے کی وجہ سے ہم اللہ کے ہاں اہل عنایت میں سے نہیں ہیں۔ یہ تب ہے جب ہم اس حال (الحال) کے حصول میں کوشش نہ کریں جو ہمیں اس بھلائی سے محروم کرتا ہے۔ تو ہمارا کیا حال ہو گا جب ہم اس حکم سے متصف ہو جائیں جو بھلائی سے محروم کرنے والا ہے، جب ہم امور کے اصول میں غور و فکر (النظر) کرتے ہیں اور ان کی بعض حقیقتوں کو جانتے ہیں، تو اس بعض میں یہ بھلائی ہم سے فوت ہو جاتی ہے۔ اور ہم نے ان میں سے بہت سے گروہ دیکھے ہیں جو اس میں غور و فکر (النظر) کرنے والے ہیں بغیر کسی ذوقی (الذوق) حال کے۔ اللہ ہمیں اس سے حال (الحال) اور نظر (النظر) دونوں لحاظ سے پناہ دے۔\n\nاور چونکہ دلیل مدلول کے شرف سے شرف پاتی ہے، اور عالم اللہ کے وجود پر دلیل ہے، لہٰذا پورا عالم شرف والا ہے، پس اس کی کسی بھی شے کو حقیر نہیں سمجھا جائے گا اور نہ ہی اس کی توہین کی جائے گی۔ یہ تب ہے جب ہم اسے فکری نظر (النظر) کی جہت سے لیں، اور یہ قرآن میں اس کے قول میں ہے:\n**أَفَلَا يَنظُرُونَ إِلَى السَّمَاءِ كَيْفَ رُفِعَتْ**\n(کیا وہ آسمان کی طرف نہیں دیکھتے کہ وہ کیسے بلند کیا گیا ہے؟)\nاور:\n**وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ**\n(اور پہاڑوں کی طرف کہ وہ کیسے گاڑے گئے ہیں؟)\nقرآن میں وارد تمام نظریاتی آیات، اور اس کے قول کی طرح:\n**أَوَلَمْ يَنظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ**\n(اور کیا انہوں نے آسمانوں اور زمین کی بادشاہت میں غور نہیں کیا؟)\nاور اس کا قول:\n**إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ** (الآية)\n(بے شک آسمانوں اور زمین کی تخلیق میں...) (آیت)\nاور اس کا قول:\n**أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ**\n(کیا تم نے اپنے رب کی طرف نہیں دیکھا کہ اس نے سائے کو کیسے پھیلایا؟)\nاور اس کا قول:\n**أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ** (الآية)\n(کیا تم نے نہیں دیکھا کہ اللہ کو سجدہ کرتے ہیں...) (آیت)\nاور اس کے قول کی طرح:\n**سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ**\n(عنقریب ہم انہیں آفاق میں اور ان کی اپنی جانوں میں اپنی نشانیاں دکھائیں گے، یہاں تک کہ ان پر واضح ہو جائے کہ وہی حق (الحق) ہے)\nاور اس جیسی آیات۔\nاور اہل کشف (الکشف) اور وجود (الوجود) کے نزدیک، عالم کا ہر جز، بلکہ عالم کی ہر شے جسے اللہ نے وجود بخشا ہے، اپنے وجود میں الٰہی حقیقت (الحقیقۃ الإلٰہیۃ) پر مستند ہونا ضروری ہے۔ پس جس نے اسے حقیر جانا یا اس کی توہین کی، تو اس نے درحقیقت اپنے خالق اور اس کے مظہر کو حقیر جانا اور اس کی توہین کی۔ اور وجود (الوجود) میں جو کچھ بھی ہے، وہ ایک حکمت ہے جسے اللہ نے وجود بخشا ہے، کیونکہ یہ ایک حکیم کی صنعت ہے، لہٰذا وہ وہی ظاہر کرتا ہے جو مناسب ہو، اس کے لیے جو مناسب ہو، جیسا کہ مناسب ہو۔ پس جو شخص اشیاء کی حکمت سے اندھا ہو گیا، وہ اس شے سے جاہل ہو گیا، اور جو شخص اس امر کے حکمت ہونے سے جاہل ہوا، وہ اس کو قائم کرنے والے حکیم سے جاہل ہو گیا۔ اور جہالت سے زیادہ قبیح کوئی شے نہیں۔ اگر تم کہو کہ جہالت عالم میں سے ہے اور تم نے اسے قبیح قرار دیا ہے، تو تم نے اسے قبیح قرار دیا جس پر جہالت اپنے وجود میں مستند ہے۔ ہم کہیں گے: یہ تب درست ہوتا اگر جہالت کوئی وجودی نسبت ہوتی۔ جہالت تو صرف عدمِ علم کا اظہار ہے، بس۔ پس یہ کوئی وجودی امر نہیں ہے، اور عدم ہی شر (الشر) ہے، اور شر اپنی ذات میں قبیح ہے جہاں بھی تم اسے فرض کرو۔ اور اسی لیے:\n\nصحیح حدیث میں آیا ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنے رب سے دعا میں فرمایا:\n**والخير كله في يديك والشر ليس إليك**\n(اور خیر سب تیرے ہاتھوں میں ہے اور شر تیری طرف منسوب نہیں)\nپس شر اس کی طرف منسوب نہیں کیا گیا۔ اگر شر کوئی وجودی امر ہوتا، تو اس کا ایجاد اللہ کی طرف ہوتا، کیونکہ اللہ کے سوا کوئی فاعل نہیں ہے۔ پس پورا وجود (الوجود) خیر ہے، کیونکہ وہ عین خیرِ محض ہے، اور وہ اللہ تعالیٰ ہے۔\n\nپھر ہم باب کے اصل کی طرف لوٹتے ہیں، اور وہ ہمارا قول ہے: جس نے حقیر جانا وہ مغلوب ہوا، پس ہم اسے ہمتوں (الہمم) کے حوالے سے واضح کرتے ہیں۔ اور اس کی اصل یہ ہے کہ جب کوئی شخص کسی شے کو حقیر جانتا ہے، تو اس کی ہمت (الہمۃ) اس پر اثر انداز ہونے کے لیے قوی ہو جاتی ہے، اور جس قدر وہ شے اس کے نزدیک عظیم ہوتی ہے، اس پر اثر کم ہوتا ہے، یا بسا اوقات یہ اس بات کا سبب بنتا ہے کہ اس کا اس پر کوئی اثر نہ ہو۔ کیونکہ اشیاء میں انفعال (اثر قبول کرنا) ہمتوں (الہمم) کی وجہ سے ہوتا ہے۔ کیا تم عورتوں کی ہمتوں کا اثر اس جادو میں نہیں دیکھتے جو ان کے ہاں معروف ہے اور مسحور پر اثر کرتا ہے؟ اگر وہ مسحور کو حقیر نہ جانتے اور اپنی ہمتوں سے یہ یقین نہ کر لیتے کہ جو کچھ وہ قولاً یا عملاً کر رہے ہیں وہ مسحور پر اثر کرے گا، تو وہ اثر نہ کرتا، پس وہ بلا شک اثر کرتا ہے۔ اور جس شخص میں اس فعل کی قوت میں یہ ہمت نہ ہو اور وہ اس شخص کو عظیم سمجھے جسے وہ جادو کرنا چاہتا ہے کہ یہ عمل یا قول اس پر اثر کرے گا، اور اس نے وہ عمل کیا یا کہا، تو وہ بالکل اثر نہیں کرے گا۔ اسی لیے ہم نے کہا: جس نے حقیر جانا وہ مغلوب ہوا، جیسا کہ ہمیں اس منزل میں کہا گیا ہے۔ پس جب توجہ سچی ہو جاتی ہے تو وجود (الوجود) درست ہو جاتا ہے۔ کیا تم عالم میں موجود اشیاء کو نہیں دیکھتے، جو عالم میں سے ہیں، وہ اس بات سے گریز کرتی ہیں کہ وہ عالم کا اثر ہوں یا عالم کے زیرِ حکم ہوں۔ کیونکہ امثال اپنی حقیقت کے لحاظ سے اس بات سے نفرت کرتی ہیں کہ عالم ان پر اثر انداز ہو، پس وہ اپنے امثال کو حقیر جانتے ہیں، یعنی عالم کے جزئیات کو۔ پس ہمتیں کسی امر کے ایجاد سے متعلق ہو جاتی ہیں، پھر وہ اس سبب کو دیکھتے ہیں جو انہیں عالم میں اس امر کے ایجاد پر مدد دیتا ہے، اور وہ اس کی تلاش کرتے ہیں، اگر وہ افعال یا اقوال کی طرف سے ہو، تو وہ اس عمل یا قول میں مشغول ہو جاتے ہیں۔ اگر وہ ایسا ہو جو مشکل ہو، اس طرح کہ اس میں اثر اندازی صرف اللہ کی طرف توجہ سے ہی ممکن ہو، تو وہ اس میں دعا اور سچائی کے ساتھ اللہ کی طرف متوجہ ہوتے ہیں، پس وہ ہمت اس توجہ کے ذریعے اثر کرتی ہے۔ اگر صاحبِ ہمت مومن ہو، تو وہ اس مؤثر کو اللہ کی قوت اور عظمت کے مقابلے میں حقیر جانتا ہے، اور اگر وہ مومن نہ ہو، تو وہ اسے اپنی ہمت کی قوت میں حقیر جانتا ہے اور اس چیز میں جس سے اس نے اثر اندازی پر مدد لی، پس وہ بہر حال اس کے نزدیک مغلوب ہے۔ اور اس کی اصل حقیر جاننا ہے۔ کیونکہ عالم کی ہر شے اللہ کی عظمت کے مقابلے میں حقیر ہے، اور یہ علمِ نسب میں سے ہے۔ اور عالم کی ہر شے جب تم اسے اللہ کی تعظیم کے ساتھ دیکھتے ہو، نہ کہ اس کی اپنی عظمت کے ساتھ، تو وہ عظیم ہے، اور یہی ادب ہے۔ کیونکہ عظیم کی طرف وہی منسوب کرنا چاہیے جو عظیم سمجھا جائے، کیونکہ یہ اس شخص کے نفس میں اس کی عظمت کی تعظیم ہے جو اسے اس نظر سے دیکھتا ہے۔ اگر وہ اسے حقیر سمجھے، تو وہ اس تعظیم کے ساتھ اپنے نفس میں عظیم نہیں ہوتا جو عالم کی اس شے کو عظیم سمجھنے والے کے نفس میں ہے۔ اور بسا اوقات وہ اس کے قول سے دلیل پکڑتا ہے:\n**وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ**\n(اور یہ اللہ پر کچھ بھی مشکل نہیں)\nپس عالم کے لیے مناسب ہے کہ وہ اس آیت کا تصور نہ کرے مگر یہ کہ وہ اس شے کی عزت کو اس کے امثال پر تصور کرے۔ پس جب اس کے نزدیک اس شے کی عزت حاصل ہو جائے، تب وہ کہے:\n**وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ**\n(اور یہ اللہ پر کچھ بھی مشکل نہیں)\nاگرچہ وہ ہم پر مشکل ہو۔ پس وہ عزیز کو عزیز ثابت کرتا ہے۔ یہی ادب اور تعظیم ہے۔ پس شے اپنی عزت کے باوجود اللہ کی عزت کے مقابلے میں حقیر ہے، جو اس حکم کی وجہ سے اثر قبول نہیں کرتی۔ اگر ہم پر وہ شخص دلیل لائے جو اس حقیقت کو جانتا ہے جس کی طرف ہم نے اشارہ کیا تھا کہ جو شخص اللہ کو ناراض کرتا ہے اور راضی کرتا ہے، کیا کائنات سے حاصل ہونے والا یہ اثر جنابِ الٰہی میں اس باب میں داخل ہوتا ہے یا نہیں؟ ہم کہیں گے: داخل نہیں ہوتا۔ کیونکہ عالم ہر شے کے ساتھ ہے،\n**بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ**\n(ہر چیز کی بادشاہت اسی کے ہاتھ میں ہے)\nاور ہر شے کا تصرف، کیونکہ وہی ناراضگی اور خوشنودی کے اسباب کو ایجاد کرنے والا ہے اور دعا میں قبولیت دینے والا ہے۔ پس کوئی شے اس سے باہر نہیں نکلی کہ اس شے کا اس میں کوئی اثر ہو، بلکہ وہ عالم کو ظاہر اور باطن میں ہر اس چیز میں حرکت دیتا ہے جسے وہ وجود میں لانا چاہتا ہے۔ پس اگر اس میں کوئی اثر ہوا، تو وہ وہی ہے جس نے اپنے نفس میں اثر کیا، نہ کہ عالم نے اس میں اثر کیا۔ بلکہ اس میں ہماری انتہا یہ ہے کہ ہم کہیں کہ اس نے اپنے نفس میں اثر کیا، اگر ہم نے اس عالم کے ذریعے کہا، یعنی اس سبب کے پیش نظر جو اس شخص میں اس پر ناراضگی واجب کرنے والے امر کو ایجاد کرنا ہے، پس اللہ اس فعل سے ناراض ہوا جسے اس نے اس بندے میں اس بندے کی شقاوت کی وجہ سے یا اس میں اپنی سزا اور مغفرت اور اپنی رحمت کا حکم ظاہر کرنے کے لیے ایجاد کیا، اس قدر کے مطابق جو ناراضگی والے امر کے بعد اس میں ظاہر ہوتا ہے۔\n\nاور جہاں تک اس منزل میں اس کے قول کا تعلق ہے کہ جس کو حقیر سمجھا گیا وہ محروم ہوا، تو بسا اوقات جس کے حق میں وہ شے حقیر سمجھی گئی، اسے محروم کر دیا جاتا ہے، کیونکہ وہ اس چیز سے جاہل ہوتا ہے جو اس نے طلب کی ہے۔ پس جس کے حق میں وہ مطلوب حقیر سمجھا گیا، اسے اس سے اعلیٰ چیز سے محروم کر دیا جاتا ہے۔ کیونکہ طالب بسا اوقات اس چیز کی قدر سے جاہل ہوتا ہے جسے وہ طلب کرتا ہے اور اس کے نہ ہونے کی وجہ سے وہ اسے عظیم سمجھتا ہے، حالانکہ وہ اللہ کے نزدیک اس طالب کے مقابلے میں کم تر ہے۔ اللہ اسے اس کے مطلوب سے محروم کر دیتا ہے، تو محروم ہونے والا یہ خیال کرتا ہے کہ یہ اس کی توہین کی وجہ سے ہے اس ذات کے نزدیک جس کے ہاتھ میں وہ چیز دینا ہے جو اس نے مانگی، حالانکہ ایسا نہیں ہے۔ پس اللہ اگر چاہے تو اس کی بصیرت کی آنکھ کھول دیتا ہے اور اسے اپنے نفس پر اور جو کچھ اس نے طلب کیا اس کی حقیقت پر کشف (الکشف) عطا کرتا ہے، اور اسے اس کشف (الکشف) میں حق (الحق) دکھاتا ہے کہ جو کچھ اس نے طلب کیا وہ اس لائق نہیں تھا۔ اور وہ اپنے نفس کے شرف کو جانتا ہے کہ وہ ایسی چیز کے طلب میں اللہ کے سامنے محتاجی (الافتقار) سے متصف ہو۔ پس وہ جانتا ہے کہ اللہ نے اسے اس کی توہین کی وجہ سے محروم نہیں کیا، بلکہ اس مطلوب کی اس کے مقابلے میں حقارت کی وجہ سے محروم کیا ہے۔ پس وہ اس ممانعت پر اللہ کا شکر ادا کرتا ہے۔ یہ اس کے قول \"جس کو حقیر سمجھا گیا وہ محروم ہوا\" کے وجوہ میں سے ایک وجہ ہے۔\n\nاور دوسری وجہ یہ ہے کہ طالب اپنی قدر سے زیادہ طلب کرے، یہاں تک کہ اگر اسے وہ دے دیا جائے تو وہ اسے قبول نہ کر سکے گا کیونکہ وہ اسے اٹھانے سے کمزور ہو جائے گا۔ پس اسے اس چیز کے مقابلے میں حقیر سمجھے جانے کی وجہ سے محروم کر دیا جاتا ہے جو اس نے طلب کی، اور یہ پہلے کے برعکس ہے۔ پس اللہ کا اسے محروم کرنا اس کے لیے رحمت ہوتا ہے، جیسے اس کا قول ہے:\n**وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ**\n(اور اگر اللہ اپنے بندوں کے لیے رزق کشادہ کر دیتا تو وہ زمین میں سرکشی کرنے لگتے)\nکیونکہ وہ رزق کی کشادگی کے شکر کے حق کو ادا کرنے سے کمزور ہو جاتے ہیں، اور اس وقت ان کے پاس اس کے ذریعے سرکشی، کفر، فخر اور غرور کے سوا کچھ نہیں ہوتا۔ اور یہ دنیا میں عہدوں کے مالکوں میں ظاہر ہوتا ہے۔ پس جب تم کسی عہدے والے کو دیکھو کہ عہدہ اس پر حکم چلا رہا ہے، تو جان لو کہ وہ عہدے سے کم تر ہے اور اس کی توہین کی گئی ہے کہ عہدہ اسے اپنی عزت کے ساتھ جیسے چاہتا ہے پھیرتا ہے۔ پس وہ حق (الحق) اور خلق کی ہر زبان پر ہمیشہ مذموم رہتا ہے۔ اور جب تم کسی عہدے والے کو دیکھو کہ وہ عہدے کو پھیرتا ہے اور عہدے پر حکم چلاتا ہے، تو جان لو کہ وہ عہدے سے بالاتر ہے۔ پس وہ اللہ کے نزدیک اور عالم کے نزدیک ہر زبان پر محمود ہوتا ہے۔ پس اسے حق اور حکمت کے ساتھ محروم کیا جاتا ہے اور حق اور حکمت کے ساتھ عطا کیا جاتا ہے، جیسا کہ حق (الحق) نے اپنے بارے میں فرمایا:\n**وَلَكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ**\n(لیکن وہ ایک اندازے کے مطابق نازل کرتا ہے جو وہ چاہتا ہے)\nاور یہ اس شخص کے اوزان کے علم کی وجہ سے ہے۔ کیونکہ اللہ فرماتا ہے:\n**إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ**\n(بے شک وہ اپنے بندوں سے باخبر، دیکھنے والا ہے)\nپس وہ جانتا ہے کہ کس پر رزق کشادہ کرے اور کس سے وہ مقدار روک لے جو اس نے دوسرے پر کشادہ کی تھی اور اس نے اس کے ذریعے سرکشی کی۔ اور اسی لیے اس نے تمام بندوں میں صرف عمومِ کشادگی کا ذکر کیا اور سرکشی کو سب کی طرف منسوب کیا، کیونکہ اس نے بعض کے لیے کشادہ کیا تو ان سے اس چیز میں سرکشی واقع ہوئی جو اس نے ان کے لیے کشادہ کی تھی، کیونکہ اس نے انہیں ان کی ضروری حاجت سے ہٹا کر ان کی غیر ضروری حاجت میں مشغول کر دیا۔ جیسے ایک بادشاہ جس کے لیے اللہ نے بادشاہت میں کشادگی کی، تو اس کی اصلی محتاجی نے اسے یہ عطا کیا کہ وہ دوسرے کی بادشاہت کے حصول میں کوشش کرے اور جو کچھ اس کے پاس ہے اس پر قناعت نہ کرے۔ حالانکہ اس کے پاس جو کچھ تھا اس کے حاصل ہونے سے پہلے وہ خواہش کرتا تھا کہ اسے اس کا کچھ حصہ مل جائے اور وہ اس پر قناعت کر لے گا۔ پس جب اللہ نے اسے وہ دے دیا جس پر اس نے قناعت کی تھی، تو وہ اس چیز کی زیادتی کا مشتاق ہوا جو دوسرے کے ہاتھ میں ہے، پس وہ اسے حاصل نہیں ہوا مگر زمین میں سرکشی کے ذریعے۔ پس بسا اوقات یہ سرکشی اسے اس چیز کے زوال تک لے جاتی ہے جو اس کے ہاتھ میں ہے، تو وہ اس وقت نادم ہوتا ہے اور جانتا ہے کہ اسے اپنی سرکشی کے سوا کچھ حاصل نہیں ہوا۔ پس اگر وہ اپنی طلب میں عزیز ہوتا، حقیر نہ ہوتا، تو اسے محروم نہ کیا جاتا۔ وہ اپنے بارے میں ایسا کہتا ہے۔ اور بسا اوقات اللہ کا اسے محروم کرنا اور جو کچھ اس کے ہاتھ میں تھا اسے لے لینا اس کے اللہ کی طرف رجوع اور توبہ کا سبب بنتا ہے تاکہ اللہ اسے اس کے ذریعے سعادت بخشے۔ پس عاقل اپنی حالتوں، اپنے تصرفات اور جس کے لیے اللہ نے اسے اہل بنایا ہے، اس میں غور کرتا ہے اور جانتا ہے کہ یہ سب احوال کی زبانوں سے حق (الحق) کا خطاب ہے، پس وہ اس عقلی اور حالی خطاب کے لیے فہم کی آنکھ اور کان کھولتا ہے، اور اس میں اپنے فہم کے تقاضے کے مطابق عمل کرتا ہے۔\n\nاگر تم کہو کہ اگر اس کا فہم اس میں وہ نہ دے جو اس عہدے کی قوت دیتی ہے؟ ہم کہیں گے: ہم یہ نہیں چاہتے، اور جو کچھ تم ہمارے سامنے لائے ہو وہ ہم سے غائب نہیں ہوا، لیکن اللہ نے ہمارے لیے عالم میں شرعی میزانیں (الموازین الشرعیۃ) مقرر کی ہیں تاکہ ہم ان کے لیے انصاف کے ساتھ وزن قائم کریں۔ پس جب وہ امر جسے وہ عالم میں چلانا چاہتا ہے، وزن کے ساتھ دیا جائے، تو ہم اس میں سے اتنی مقدار لیتے ہیں جو میزان میں داخل ہو، اور اس میں سے وہ چھوڑ دیتے ہیں جسے میزان برداشت نہیں کر سکتی۔ کیونکہ تولی جانے والی چیز کے پلڑے کے مقابلے میں دوسرے پلڑے میں ایک مقدار ہوتی ہے، اور وہ مقدار ہی ہمیں اس تولی جانے والی چیز میں سے وہ متعین کرتی ہے جس کی ہمیں وقت پر ضرورت ہے۔ اور یہی اس کے قول کا معنی ہے:\n**يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ**\n(وہ ایک اندازے کے مطابق نازل کرتا ہے جو وہ چاہتا ہے)\nاور وہ وہ مقدار ہے جو میزان کے دوسرے پلڑے میں ہے۔\n**وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَّعْلُومٍ**\n(اور ہم اسے ایک معلوم اندازے کے مطابق ہی نازل کرتے ہیں)\nاور بسا اوقات میزان مکیال (پیمانہ) ہوتا ہے، پس وہ کیل (پیمانے) کی مقدار پر ہوتا ہے۔ اور مکیال (المکیال) اور میزان (المیزان) میں فرق یہ ہے کہ میزان تم سے باہر ہے، پس ہم تولی جانے والی چیز میں سے اتنی مقدار لیتے ہیں جو دوسرے پلڑے میں اس کے مقابل ہو۔ اور مکیال (المکیال) تمہاری ذات کا عین ہے، اس لحاظ سے کہ وہ کسی حالت سے متصف ہے، پس وہ اس کا عین کیل (پیمانہ) ہے۔ پس تم امر میں سے صرف اپنی قبولیت کی مقدار کے مطابق لیتے ہو، جیسا کہ مکیال لیتا ہے۔ پس وہ حقیقت میں ویسا ہی ہے جیسا کہ میزان میں ہے۔ کیونکہ جب وہ دونوں پلڑوں میں سے کسی ایک سے جھک جائے، تو وہ وزن ہونے سے نکل جاتا ہے، کیونکہ وہ اس مقدار سے باہر نکل گیا جو اس کے مقابل ہے، خواہ وہ کم تولنے سے ہو یا کسی اور وجہ سے۔ پس نبی صلی اللہ علیہ وسلم پر جب شرائع نازل ہوئیں تو وہ مکیال (المکیال) تھیں نہ کہ میزان (المیزان)۔ اور حق (الحق) چونکہ امر کا محل نہیں ہو سکتا، اس لیے اس نے اپنے آپ کو مکیال (المکیال) کی منزل میں نہیں اتارا، لیکن اس نے اپنے آپ کو اس طرح بیان کیا کہ میزان (المیزان) اس کے ہاتھ میں ہے، وہ قسط (انصاف) کو کم کرتا ہے اور اسے عالم کے مراتب کے مطابق بلند کرتا ہے۔ پس حق (الحق) کے میزان میں ہر کمی اور بلندی، عالم میں رکھے گئے میزان میں دونوں پلڑوں کے درمیان عین اعتدال ہے۔ کیونکہ حق (الحق) صرف حق (الحق) کو ہی تولتا ہے۔\n\nپس حق (الحق) کے میزان (المیزان) میں دونوں پلڑوں میں سے کسی ایک کا کم ہونا اور بلند ہونا ضروری ہے، اور اگر وہ اعتدال پر ہوتا تو عالم میں کوئی وجود (الکون) اصلاً ظاہر نہ ہوتا اور نہ ہی کوئی عدل ہوتا۔ پس جب عالم میں الٰہی شریعت کی میزانیں قائم کی جاتی ہیں، تو عدل عالم میں سرایت کر جاتا ہے۔ اور اسی طرح اگر عالم میں طبعی وزن قائم کیا جاتا، تو عالم میں کوئی بیماری اور موت نہ ہوتی، جیسا کہ جنت میں نہیں ہو گی، کیونکہ جنت میں طبعی میزان (المیزان الطبعی) کا حکم ظاہر ہوتا ہے، اور اسی لیے وہ دار البقاء ہے، اور اس میں شریعت کا میزان اٹھا لیا جاتا ہے، جیسا کہ دنیا میں طبع کا میزان اٹھا لیا گیا۔ پس ممانعت (المنع) اور عطا (العطاء) اگر میزان نہ ہوتا تو عالم میں ان کا کوئی حکم نہ ہوتا۔ اور جو وزن کرتا ہے وہ عطا کرنے والے (المعطی)، روکنے والے (المانع)، نقصان پہنچانے والے (الضار) اور نفع دینے والے (النافع) سے موصوف ہے،\n**وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ**\n(اور وہ ہر چیز کو جاننے والا ہے)\nپس اگر اہل تحقیق (أهل التحقیق) میں سے کوئی کہنے والا کہے کہ الٰہی جود (الجود الإلٰہی) میں ممانعت (المنع) نہیں ہے، ہم کہیں گے: تم نے سچ کہا۔ اس نے کہا: پس جب تم سچے ہو اور تم نے میری بات تسلیم کر لی، تو الٰہی اسم المانع (المانع) کا کیا حکم ہے، اور عالم میں واقع ہونے والی یہ ممانعت کس چیز کی طرف لوٹتی ہے؟ کیونکہ ہم اس کا انکار نہیں کرتے۔ ہم نے کہا: جہاں تک الٰہی جود (الجود الإلٰہی) کا تعلق ہے، اس میں کوئی ممانعت نہیں ہے، لیکن اسے صرف ممکن (الممکن) ہی قبول کرتا ہے، محال (المحال) اسے قبول نہیں کرتا۔ پس جب تم قبول کرنے والے کو جان لو گے، تو تم مانع (المانع) اور ممانعت (المنع) کو جان لو گے۔ پس قبول کرنے والے اس مطلق جود (الجود المطلق) کو اپنی استعدادوں کے مطابق قبول کرتے ہیں، جیسے دھوبی کا کپڑا اور قصار (کپڑے دھونے والا) سورج کے نور کے فیض میں۔ پس کپڑا سفید ہو جاتا ہے اور قصار کا چہرہ سیاہ ہو جاتا ہے اگر وہ سفید ہو۔ پس حکیم ان دونوں سے کہتا ہے: نور تو ایک ہی ہے، لیکن قصار کا مزاج سورج کے نور سے صرف سیاہی کو قبول کرتا ہے، اور کپڑا ایسے مزاج پر ہے جو سفیدی کو قبول کرتا ہے۔ پس تمہارے مزاج نے تمہیں سفیدی قبول کرنے سے روکا، اور کپڑے سے کہا جاتا ہے: تمہارے مزاج نے تمہیں سیاہی قبول کرنے سے روکا۔ پس مذکورہ بالا میں سے ہر ایک کو یہ کہنے کا حق ہے کہ: مسئلہ اپنی جگہ پر ہے، مجھے وہ مزاج کیوں نہیں دیا گیا جو سیاہی قبول کرتا؟ اور قصار کہتا ہے: مجھے وہ مزاج کیوں نہیں دیا گیا جو سفیدی قبول کرتا؟ ہم نے کہا: عالم میں کپڑے اور قصار کا ہونا ضروری ہے، پس ایسے مزاج کا ہونا ضروری ہے جو سفیدی قبول کرے اور ایسے مزاج کا جو سیاہی قبول کرے۔ پس تم دونوں کا ہونا ضروری ہے، تم جو بھی ہو۔ کیونکہ عالم میں ہر شے کا ہونا ضروری ہے، پس اس میں ہر مزاج کا ہونا ضروری ہے۔ اور حق تعالیٰ کا فعل ان اغراض کے ساتھ نہیں ہے جو اس نے اپنے بندوں میں پیدا کی ہیں، بلکہ وہ اس کے ساتھ ہے جو حکمت کا تقاضا ہے۔ اور جس کا حکمت نے تقاضا کیا ہے، وہی عالم میں واقع ہوا ہے۔ پس اس کا ظاہر ہونا عین حکمت ہے۔ کیونکہ اللہ کا فعل حکمت سے معلول نہیں ہوتا، بلکہ وہ عین حکمت ہے۔ کیونکہ اگر وہ حکمت سے معلول ہوتا، تو حکمت ہی اس کے لیے اسے واجب کرتی، تو حق (الحق) محکوم علیہ ہوتا، اور حق تعالیٰ محکوم علیہ نہیں ہوتا۔ پس کوئی واجب کرنے والا اس پر کوئی شے واجب نہیں کرتا، سوائے اس کے جو اس نے ہمیں بتایا کہ اس نے اپنے نفس پر واجب کیا ہے، نہ یہ کہ کسی دوسرے واجب کرنے والے نے اس پر کوئی امر واجب کیا ہو۔ پس تم جس بھی محل کو کسی خاص مزاج کے لیے فرض کرو، وہ یہ تصور کر سکتا ہے کہ مجھے اس دوسرے مزاج نے محروم کر دیا، اور یہ غلط ہے۔ کیونکہ عین مزاج ہی عین وہ ہے جو ظاہر ہوا ہے، اور کوئی دوسرا نہیں۔ اور شے کے لیے یہ کہنا درست نہیں کہ میں دوسرا کیوں نہیں تھا، جیسا کہ ہم نے اس باب سے پہلے والے باب میں بیان کیا کہ ترکیب (الترکیب) بسائط (سادہ چیزوں) کے سوا کچھ نہیں ہے۔ پس ترکیب ایک نسبت ہے، اور نسبتیں عدمی ہیں۔ اور ایک امر ظاہر ہوا جو ان بسائط کی ترکیب اور ان کے جمع ہونے کے بغیر ظاہر نہ ہوتا، اور یہ ظاہر ہونے والا ان بسائط کے اعیان کے سوا کچھ نہیں ہے۔ اور اسی طرح اس مزاج سے ظاہر ہونے والا مزاج کے سوا کچھ نہیں ہے۔ پس حقیقت میں کوئی ایسا نہیں جو کہے کہ مجھے کس چیز سے محروم کیا گیا؟ اور جب کوئی نہیں ہے، تو الٰہی جود (الجود الإلٰہی) میں ممانعت (المنع) درست نہیں ہوتی۔ پس ممانعت (المنع) اور مانع (المانع) صرف مقدر نسبتوں کی طرف لوٹتے ہیں۔ اور کوئی بھی ایسا نہیں جسے اللہ نے اس علم اور اس جیسے علوم پر ظاہر کیا ہو، اور شرائع کی زبانیں عالم کی زبانوں میں واقع ہونے والے تواطؤ (اتفاق) کے مطابق نازل ہوئیں۔ اور اسی لیے اللہ تعالیٰ نے فرمایا:\n**وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ**\n(اور ہم نے کوئی رسول نہیں بھیجا مگر اس کی قوم کی زبان میں)\nپس وہ صرف اسی چیز کے ساتھ نازل ہوتا ہے جس پر انہوں نے اتفاق کیا ہو۔ پس بسا اوقات تواطؤ ایسی صورت پر ہوتا ہے جو حقائق پر ہوتی ہے، اور بسا اوقات نہیں ہوتا۔ اور حق (الحق) ان سب میں ان کی پیروی کرتا ہے تاکہ اس سے وہ سمجھا جائے جو اس نے اپنے احکام میں نازل کیا ہے اور جس کا اس نے وعدہ کیا ہے اور جس پر وعید سنائی ہے۔ جیسا کہ عقلی دلیل نے حق (الحق) کو کسی جگہ میں محدود کرنے کے محال ہونے پر دلالت کی ہے، اس کے باوجود شرع کی زبان حق (الحق) کے حق میں جگہ کے ساتھ آئی، اس تواطؤ کی وجہ سے جو مرسل الیہم کی زبان پر تھا۔ پس اس نے سیاہ فام عورت سے پوچھا: اللہ کہاں ہے؟ اگر یہ بات رسول کے علاوہ کوئی اور کہتا، تو عقلی دلیل کہنے والے کی جہالت کی گواہی دیتی، کیونکہ اس کے لیے کوئی جگہ نہیں ہے۔ لیکن جب رسول نے یہ کہا اور اس کی حکمت اور علم ظاہر ہوا، تو ہم نے جانا کہ اس مخاطب کی فہم کی قوت میں یہ نہیں تھا کہ وہ موجود کو سمجھے مگر اس کے ساتھ جو اس نے اپنے نفس میں تصور کیا تھا۔ پس اگر وہ اسے اس کے خلاف مخاطب کرتا جس پر انہوں نے اتفاق کیا تھا اور جو اس نے اپنے نفس میں تصور کیا تھا، تو مطلوبہ فائدہ ختم ہو جاتا اور قبولیت حاصل نہ ہوتی۔ پس یہ اس کی حکمت میں سے تھا کہ اس نے ایسے لوگوں سے ایسا سوال اور اس عبارت کے ساتھ پوچھا۔ اور اسی لیے جب اس نے آسمان کی طرف اشارہ کیا، تو اس نے اس کے بارے میں کہا کہ وہ مومنہ ہے، یعنی اللہ کے وجود کی تصدیق کرنے والی، اور یہ نہیں کہا کہ عالمہ ہے۔ پس عالم جاہل کی جہالت میں اپنے علم کے ساتھ اس کا ساتھ دیتا ہے، اور جاہل عالم کے علم پر اس کا ساتھ نہیں دے سکتا، اگر عالم اس کی جہالت کی صورت میں اس کے پاس نہ اترے۔ اور یہ سب عالم میں الٰہی حکمت ہے۔\n\n### [ذلت عالم کی حقیقت ہے]\n\nاور جان لو کہ ذلت (المهانة) عالم کی وہ حقیقت ہے جس پر وہ قائم ہے، کیونکہ وہ بالذات ممکن (الممکن) اور فقیر (محتاج) ہے۔ پس وہ اپنی تمام اغراض اور ارادوں کے حصول سے ذاتی طور پر محروم ہے۔ اور تمہاری بعض مرادوں کے واقع ہونے اور بعض اغراض کے حاصل ہونے سے اس بات سے پردہ نہ پڑ جائے جو ہم نے اس کے حق میں کہی ہے، کیونکہ وہ اسے صرف حق (الحق) کے ارادے سے حاصل ہوا ہے نہ کہ اس کے ارادے سے۔ پس وہ مراد اور بندے کا ارادہ دونوں صرف حق (الحق) کے ارادے سے واقع ہوتے ہیں۔ پس عالم بالذات اس بات سے ممتنع ہے کہ وجود (الوجود) میں کوئی شے بندے کے ارادے سے موجود ہو۔ اور اگر بندے کے ارادے کو کسی خاص امر میں نفوذ ہوتا، تو اس کا نفوذ ہر شے میں عام ہو جاتا، اگر وہ مراد ممکن (الممکن) کے عین ارادے سے واقع ہوتی۔ پس یہ متعین ہوا کہ وہ واقع ہونے والی شے اللہ عزوجل کے ارادے سے واقع ہوئی ہے۔ پس عالم اپنی ذات کے لحاظ سے محروم ہے، جیسا کہ وہ اپنی ذات کے لحاظ سے ممکن اور ذلیل ہے۔ اور وہ اپنی ذات کے لحاظ سے ذلیل اس لیے ہے کہ بندگی (العبودیۃ) اس کی ذات کے لیے ہے، اور وہ ذلت ہے۔ اور ہر ذلیل حقیر ہے، اور ہر حقیر مغلوب ہے۔ پس جو کچھ اس منزل میں آیا ہے وہ درست ثابت ہوا کہ جس نے حقیر جانا وہ مغلوب ہوا، اور جس کو حقیر سمجھا گیا وہ محروم ہوا۔\n**وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ**\n(اور اللہ حق (الحق) فرماتا ہے اور وہی راستہ دکھاتا ہے)",
    "fa": "«باب سیصد و هشتاد و پنجم: در معرفت مقام کسی که تحقیر کرد، غالب شد؛ و کسی که استهانت شد، منع گردید.»\n\nبندگان حق را تحقیر مکن، زیرا آنان را قدری است (لا تحقرن عباد الله أن لهم)\nحتی اگر مقامات (مقامات) برای تو جمع شوند (قدرا ولو جمعت لك المقامات‏)\nآیا اسماء او حقایق آنان را آشکار نمی‌سازد (أ ليس أسماؤه تبدي حقائقهم)\nحتی اگر جهالت‌ها بر آنان چیره شوند؟ (ولو تولتهم فيها الجهالات‏)\nمگر آنکه شریعت را هتک کنند، همان شریعتی که (إلا إذا انتهكوا الشرع الذي انتهكت)\nحرمت‌های هتک‌کنندگان نیز با نیزه‌ها (سمهریات) شکسته می‌شود. (حرمات منتهكية السمهريات‏)\nپس به خاطر حریم (حمی) خداوند رحمان بگریز، زیرا او را (ففر من أجل حمى الرحمن أن له)\nچشمی است بر کسی که غیرت‌ها (حميات) بر او حکم رانده‌اند. (عينا لمن حكمت فيه الحميات‏)\nزیرا اسماء حُسنای تو (ای سالک) با اسماء حُسنای او (فإن أسماءك الحسنى بأسمائه)\nپیوند خورده و عنایات (عنایات) آن را نزدیک می‌سازد. (الحسنى تناط وتدنيها العنايات‏)\n\n[اینکه تحقیر هیچ چیز از عالَم از پرهیزکاری که از خدا می‌ترسد، سر نمی‌زند]\n\nبدان، خداوند ما و تو را به روح‌القدس تأیید کند، که تحقیر هیچ چیز از عالَم از پرهیزکاری که از خدا می‌ترسد، سر نمی‌زند؛ پس چگونه از عارفی بالله که علمش از طریق دلیل یا علم ذوق (ذوق) است، سر زند؟ زیرا در عالَم هیچ عینی نیست مگر آنکه از شعائر الهی (شعائر الله) است، از آن جهت که حق (الحق) آن را دلیلی بر خود قرار داده است. و کسی را که شعائر الهی را بزرگ می‌دارد، چنین وصف کرده و فرموده است:\n«وَمَن يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِن تَقْوَى الْقُلُوبِ» (و هر کس شعائر الهی را بزرگ دارد، این از پرهیزگاری دل‌هاست).\nیعنی بزرگداشت آن از تقوای دل‌هاست، یا خود شعائر عین تقوای دل‌ها هستند. سپس، اگر شعائر الهی در دار تکلیف (دار التکلیف) باشند، خداوند برای مکلّف در تمامی حرکات ظاهری و باطنی‌اش حدودی قرار داده که شامل هر آنچه روحاً و حساً در آن تصرف می‌کند، می‌شود؛ و آن را برای این مکلّف، حُرمات (حرمات) قرار داده است. پس فرموده است:\n«وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ» (و هر کس حُرمات الهی را بزرگ دارد).\nو بزرگداشت آن به این است که آن را همان‌گونه که خداوند در حکم آفریده، حُرمات باقی بدارد. زیرا اموری هستند که آن را از حُرمات بودن خارج می‌سازند، همان‌گونه که در سرای آخرت در بهشت به طور مطلق و بدون منع چنین است. و این همان قول خداوند متعال است:\n«نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ» (در بهشت هر جا که بخواهیم جای می‌گیریم)\nو قول او:\n«وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنفُسُكُمْ» (و در آنجا هر چه دل‌هایتان بخواهد برای شماست)\nو قول او:\n«إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ» (همانا بهشتیان امروز در کاری لذت‌بخش مشغولند).\nو در آنجا حَجر (محدودیت) برداشته شده است. پس چه بسا بنده در دار تکلیف در این موطن اقامه شود و بخواهد در آن تصرف کند، همان‌گونه که حقیقتش اقتضا می‌کند، اما در موطن خود. پس حُرمات الهی را در آن ساقط می‌سازد و به آن توجهی نمی‌کند و تعظیمی برای آن نمی‌یابد. در نتیجه، خیر آن را از دست می‌دهد، زیرا آن را نزد پروردگارش بزرگ نداشته است، چنانکه فرمود:\n«وَمَن يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَّهُ عِندَ رَبِّهِ» (و هر کس حُرمات الهی را بزرگ دارد، پس آن برای او نزد پروردگارش بهتر است).\nو این را فرمود و وعده عذاب نداد، زیرا اصحاب احوال (أصحاب الأحوال) هنگامی که حال بر آنان غلبه کند، مانند دیوانگان می‌شوند و قلم از آنان برداشته می‌شود. از این رو، خیر بسیاری نزد خداوند از دست می‌دهند. به همین دلیل، هیچ یک از بزرگان حال را طلب نمی‌کند، بلکه مقام را می‌طلبد. و ما در دار تکلیف هستیم، پس آنچه در این دنیا از آن (حال) از دست دهیم، خیر آن را در آنجا (آخرت) از دست داده‌ایم. پس قطعاً می‌دانیم که با از دست دادن این خیر، از اهل عنایت (أهل العناية) نزد خداوند نیستیم. این در صورتی است که ما در پی تحصیل این حالی که خیر را از ما فوت می‌کند، نباشیم؛ پس چگونه خواهد بود اگر با نظر در اصول امور، به این حکمِ فوت‌کننده خیر متصف شویم، در حالی که برخی از حقایق آن را می‌شناسیم و در آن بخش، خیر از ما فوت می‌شود؟ ما گروه بسیاری از اهل نظر را در این باره دیده‌ایم که فاقد حال ذوقی (حال ذوقی) بودند. خداوند ما را از آن، چه حال و چه نظر، پناه دهد.\nو چون دلیل به شرافت مدلولش شریف می‌شود و عالَم دلیلی بر وجود خداوند است، پس عالَم تماماً شریف است. بنابراین، هیچ چیز از آن نباید تحقیر یا استهانت شود. این در صورتی است که آن را از جهت نظر فکری بگیریم، که در قرآن در این قول آمده است:\n«أَفَلَا يَنظُرُونَ إِلَى السَّمَاءِ كَيْفَ رُفِعَتْ» (آیا به آسمان نمی‌نگرند که چگونه برافراشته شده است؟)\nو «وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ» (و به کوه‌ها که چگونه نصب شده‌اند؟)\nو تمامی آیات نظری که در قرآن آمده است، مانند قول او:\n«أَوَلَمْ يَنظُرُوا فِي مَلَكُوتِ السَّمَاوَاتِ وَالْأَرْضِ» (آیا در ملکوت آسمان‌ها و زمین نظر نکرده‌اند؟)\nو قول او:\n«إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالْأَرْضِ...» (همانا در آفرینش آسمان‌ها و زمین...)\nو قول او:\n«أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ» (آیا به پروردگارت ننگریسته‌ای که چگونه سایه را گسترانید؟)\nو قول او:\n«أَلَمْ تَرَ أَنَّ اللَّهَ يَسْجُدُ لَهُ...» (آیا ندیده‌ای که خداوند را سجده می‌کند...)\nو قول او:\n«سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ» (به زودی آیات خود را در آفاق و در خودشان به آنان نشان خواهیم داد تا برایشان روشن شود که او حق است).\nو امثال این آیات.\nاما نزد اهل کشف (الکشف) و شهود (الشهود)، هر جزء در عالَم، بلکه هر شیئی در عالَم که خداوند آن را ایجاد کرده است، ناگزیر باید در وجود خود به حقیقت الوهیت مستند باشد. پس هر کس آن را تحقیر یا استهانت کند، در واقع خالق و مظهر او را تحقیر و استهانت کرده است. و هر آنچه در هستی (الوجود) است، حکمتی است که خداوند آن را ایجاد کرده، زیرا ساخته حکیم است. پس جز آنچه شایسته است، برای آنچه شایسته است، آن‌گونه که شایسته است، ظاهر نمی‌شود. پس هر کس از حکمت اشیاء کور شود، آن شیء را نشناخته است؛ و هر کس حکمت بودن آن امر را نشناسد، حکیمِ واضعِ آن را نشناخته است. و هیچ چیز زشت‌تر از جهل نیست.\nاگر بگویی: «پس جهل از عالَم است و تو آن را زشت شمردی، در نتیجه کسی را که جهل در وجودش به او مستند است، زشت شمرده‌ای.»\nمی‌گوییم: این صحیح بود اگر جهل یک نسبت وجودی بود. در حالی که جهل تنها عبارت از عدم علم است و بس، و امری وجودی نیست. و عدم همان شر است، و شر ذاتاً زشت است، هر جا که آن را فرض کنی. به همین دلیل، در خبر صحیح آمده است که پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) در دعای خود به پروردگار متعال فرمود:\n«والخير كله في يديك والشر ليس إليك» (و خیر تماماً در دستان توست و شر به سوی تو نیست).\nپس شر را به او نسبت نداد. اگر شر امری وجودی بود، ایجاد آن به خداوند بازمی‌گشت، زیرا فاعلی جز خداوند نیست. پس هستی (الوجود) تماماً خیر است، زیرا عین خیر محض است و آن خداوند متعال است.\nسپس به اصل باب بازمی‌گردیم، یعنی قول ما: «کسی که تحقیر کرد، غالب شد.» این را در باب همّت‌ها (الهمم) توضیح می‌دهیم. اصل این امر آن است که هر شخصی چیزی را تحقیر کند، همّت او بر تأثیرگذاری در آن قوی می‌شود. و به هر میزان که آن چیز نزد او بزرگ باشد، تأثیرگذاری در آن کم می‌شود، یا حتی ممکن است به جایی برسد که هیچ اثری در آن نداشته باشد. زیرا انفعال در اشیاء تنها برای همّت‌هاست. آیا تأثیر همّت زنان را در سحر معروف نزد آنان که در مسحور تأثیر می‌گذارد، نمی‌بینی؟ اگر مسحور را تحقیر نمی‌کردند و با همّت خود یقین نمی‌کردند که آنچه انجام می‌دهند، چه قولی و چه عملی، در مسحور تأثیر می‌گذارد، تأثیر نمی‌کرد. پس بی‌شک تأثیر می‌گذارد. و کسی که این همّت را در قوت آن فعل ندارد و کسی که می‌خواهد او را سحر کند، نزد او بزرگ است که آن عمل یا قول در او تأثیر کند، اگر آن را انجام دهد یا بگوید، به هیچ وجه تأثیر نمی‌کند. به همین دلیل گفتیم: «کسی که تحقیر کرد، غالب شد»، همان‌گونه که در این مقام (منازلة) به ما گفته شد.\nپس اگر توجه صادق باشد، وجود صحیح می‌شود. آیا نمی‌بینی که اشیاء موجود در عالَم، که خود از عالَم هستند، از اینکه اثری از عالَم باشند یا محکوم عالَم باشند، ابا دارند؟ زیرا امثال، از جهت حقیقت خود، از اینکه عالَم در آن‌ها تأثیر بگذارد، نفرت دارند. پس امثال خود، یعنی جزئیات عالَم، را تحقیر می‌کنند. پس همّت‌ها به ایجاد امری تعلق می‌گیرد. سپس به سبب یاری‌دهنده برای ایجاد آن امر در عالَم می‌نگرند و در مورد آن جستجو می‌کنند، اگر از طریق افعال یا اقوال باشد. پس به آن عمل یا قول می‌پردازند. اگر آن امر چنان دشوار باشد که نتوانند در آن تأثیر کنند مگر با توجه به خداوند، در آن با دعا و صدق به خداوند توجه می‌کنند. پس آن همّت با آن توجه تأثیر می‌گذارد. اگر صاحب همّت مؤمن باشد، آن مؤثر را در برابر قدرت و عظمت خداوند حقیر می‌شمارد. و اگر مؤمن نباشد، آن را در برابر قدرت همّت خود و آنچه برای تأثیرگذاری از آن یاری جسته، حقیر می‌شمارد. پس در هر حال نزد او مغلوب است. و اصل آن تحقیر است. زیرا هر شیئی در عالَم، با نظر به عظمت خداوند، حقیر است. و این از علم نِسب است. و هر شیئی در عالَم، اگر با تعظیم خداوند به آن بنگری، نه با عظمت خود آن، بزرگ است. و این همان ادب است. زیرا شایسته نیست که به عظیم جز آنچه بزرگ شمرده می‌شود، نسبت داده شود. این تعظیم عظمت او در نفس کسی است که با این نظر به آن می‌نگرد. اگر آن را حقیر شمارد، در نفس او به آن تعظیمی که در نفس کسی است که آن شیء از عالَم نزد او بزرگ شمرده شده، بزرگ نمی‌شود. و چه بسا به این قول استدلال کند که:\n«وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ» (و این بر خداوند دشوار نیست).\nپس شایسته است که عارف این آیه را تصور نکند مگر آنکه ابتدا عزت آن شیء را نسبت به امثال آن تصور کند. هنگامی که عزت آن شیء نزد او حاصل شد، آنگاه بگوید: «وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ» (و این بر خداوند دشوار نیست)، اگرچه بر ما دشوار باشد. پس عزیز را برای عزیز ثابت می‌کند. این همان ادب و تعظیم است. پس شیء با وجود عزتش، نسبت به عزت خداوند که تأثیر را نمی‌پذیرد، حقیر است.\nاگر کسی از اهل تحقیق (أهل التحقيق) بر ما احتجاج کند که آیا این تأثیر حاصل از کَون در جناب الهی، که ما به آن در مورد کسی که خداوند را به خشم می‌آورد و راضی می‌کند، اشاره کردیم، در این باب داخل می‌شود یا خیر؟\nمی‌گوییم: داخل نمی‌شود. زیرا عالَم به تمام آن، «بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ» (ملکوت هر چیزی به دست اوست) و تدبیر هر چیزی به دست اوست، زیرا او ایجادکننده اسباب خشم و رضایت و اجابت در دعاست. پس چیزی از او خارج نشده که آن شیء در او تأثیر داشته باشد. او محرک عالَم است، ظاهراً و باطناً، در هر آنچه می‌خواهد موجود شود. اگر در او تأثیری باشد، اوست که در نفس خود تأثیر کرده، نه عالَم در او تأثیر کرده باشد. بلکه نهایت چیزی که می‌توانیم بگوییم این است که اگر بگوییم عالَم در او تأثیر کرده، یعنی با تقدم این سبب، که همان ایجاد امری است که موجب خشم بر او در این شخص می‌شود. پس خداوند با این فعلی که در این بنده ایجاد کرده، به خاطر شقاوت این بنده، یا برای اینکه عقوبت و مغفرت و حکم رحمت خود را در او آشکار سازد، به اندازه آنچه پس از امر خشم‌آور در او ظاهر می‌شود، خشمگین شده است.\nاما در مورد قول در این مقام (منازلة) که «کسی که استهانت شد، منع گردید»، ممکن است کسی که آن شیء در حق او استهانت شده، منع شود، زیرا او نسبت به آنچه طلب کرده، جاهل است. پس کسی که آن مطلوب در حق او استهانت شده، از آن منع می‌شود تا به چیزی بالاتر از آن برسد. زیرا طالب ممکن است قدر آنچه را می‌طلبد نداند و به دلیل نداشتن آن، نزد او بزرگ باشد، در حالی که آن مطلوب نزد خداوند نسبت به این طالب، پایین‌تر از اوست. پس خداوند او را از مطلوبش منع می‌کند. در نتیجه، کسی که منع شده، گمان می‌کند که این منع به دلیل خواری او نزد کسی است که اعطای آنچه را خواسته، در دست دارد. در حالی که چنین نیست. پس اگر خداوند بخواهد، چشم بصیرت او را می‌گشاید و کشف (الکشف) بر نفس خود و بر حقیقت آنچه طلب کرده، روزی او می‌سازد و حق (الحق) را در آن کشف به او نشان می‌دهد که آنچه طلب کرده، آن‌گونه که می‌پنداشته، نیست. و شرافت نفس خود را از اینکه در طلب چنین چیزی به فقر (افتقار) به خداوند متصف شود، می‌شناسد. پس می‌داند که خداوند او را به دلیل خواری‌اش منع نکرده، بلکه به دلیل استهانت آن مطلوب نسبت به او منع کرده است. پس خداوند را بر این منع شکر می‌کند. این یک وجه از وجوه قول «کسی که استهانت شد، منع گردید» است.\nوجه دیگر آن است که طالب چیزی فراتر از قدر خود طلب کند، به طوری که اگر به او داده شود، آن را نمی‌پذیرد، زیرا از حمل آن ناتوان است. پس به دلیل خواری‌اش نسبت به آنچه طلب کرده، منع می‌شود. و این عکس وجه اول است. پس منع خداوند از او، رحمتی به اوست، مانند قول او:\n«وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ» (و اگر خداوند روزی را بر بندگانش گشاده می‌ساخت، در زمین سرکشی می‌کردند).\nزیرا آنان از انجام شکر لازم برای گشایش روزی ناتوانند و در آن هنگام جز سرکشی، کفر، سرمستی و ناسپاسی از آنان سر نمی‌زند. و این در مورد صاحبان مناصب در دنیا آشکار می‌شود. پس اگر دیدی که منصب بر صاحبش حکم می‌راند، بدان که او پایین‌تر از منصب است و با تصرف منصب در او به عزت خود، آن‌گونه که می‌خواهد، خوار شده است. پس پیوسته با هر زبانی، چه از حق و چه از خلق، مذموم است. و اگر دیدی که صاحب منصب در منصب تصرف می‌کند و بر منصب حکم می‌راند، بدان که او بالاتر از منصب است. پس نزد خداوند و نزد عالَم با هر زبانی ستوده است.\nپس منع به حق و حکمت صورت می‌گیرد و عطا نیز به حق و حکمت صورت می‌گیرد، چنانکه حق (الحق) از خود فرموده است:\n«وَلَكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ» (ولی به اندازه‌ای که بخواهد نازل می‌کند).\nو این به دلیل علم این شخص به اوزان است. زیرا خداوند می‌فرماید:\n«إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ» (همانا او به بندگانش آگاه و بیناست).\nپس می‌داند که روزی را بر چه کسی بگستراند و از چه کسی آن مقداری را که بر دیگری گسترانده و او با آن سرکشی کرده، باز دارد. به همین دلیل، جز عموم گشایش در همه بندگان را ذکر نکرده و سرکشی (بغی) را به همه نسبت داده است، زیرا برای برخی گشایش داده و آنان در آنچه برایشان گشاده شده، سرکشی کرده‌اند، چون آن گشایش آنان را از نیاز ضروری نفسشان به نیاز غیرضروری نفسشان مشغول کرده است. مانند پادشاهی که خداوند در مُلک بر او گشایش داده، اما فقر ذاتی‌اش او را واداشته که در پی تحصیل مُلک دیگری باشد و به آنچه دارد قناعت نکرده است. در حالی که پیش از رسیدن به آنچه در آن است، آرزو می‌کرد که بخشی از آن به او برسد و به آن قناعت کند. اما هنگامی که به او داده شد، قناعت نکرد و مشتاق افزایش از آنچه در دست دیگری است، شد. و این افزایش جز با سرکشی در زمین حاصل نمی‌شود. پس چه بسا آن سرکشی به زوال آنچه در دست دارد، منجر شود. در آن هنگام پشیمان می‌شود و می‌داند که جز سرکشی‌اش چیزی به او بازنگشته است. اگر در طلب خود عزیز بود و خوار (مهان) نبود، منع نمی‌شد. این‌گونه از خود می‌گوید.\nو چه بسا منع خداوند در حق او و گرفتن آنچه در دستش بوده، سببی برای بازگشت او به سوی خداوند و توبه‌اش باشد تا خداوند او را به واسطه آن سعادتمند سازد. پس عاقل در احوال و تصرفات خود و آنچه خداوند او را شایسته آن قرار داده، می‌نگرد و می‌داند که همه این‌ها خطاب حق (الحق) با زبان احوال است. پس چشم فهم و گوش خود را برای آن خطاب عقلی و حالی می‌گشاید و بر اساس مقتضای فهم خود در آن عمل می‌کند.\nاگر بگویی: «اگر فهم او در آن، چیزی باشد که قدرت آن منصب به او می‌دهد؟»\nمی‌گوییم: منظور ما آن نیست و آنچه تو با آن بر ما وارد شدی، از ما پنهان نبوده است. اما خداوند در عالَم برای ما موازین شرعی قرار داده است تا وزن را به قسط (عدل) برپا داریم. پس اگر آن امری که می‌خواهد در عالَم به وزن پیش برود، داده شود، ما به اندازه آنچه در میزان می‌گنجد، از آن برمی‌داریم و آنچه را که میزان تحمل نمی‌کند، رها می‌کنیم. زیرا در مقابل کفه موزون، مقداری در کفه دیگر وجود دارد و آن مقدار است که آنچه را از این موزون نیاز داریم، در زمان حال برای ما تعیین می‌کند. و این معنای قول اوست:\n«يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ» (به اندازه‌ای که بخواهد نازل می‌کند)،\nو آن همان مقداری است که در کفه دیگر میزان است. و:\n«وَمَا نُنَزِّلُهُ إِلَّا بِقَدَرٍ مَّعْلُومٍ» (و ما آن را جز به اندازه معلوم نازل نمی‌کنیم).\nو چه بسا میزان، پیمانه (مکیال) باشد، پس بر اساس اندازه پیمانه است. تفاوت بین پیمانه و میزان این است که میزان خارج از توست، پس ما از موزون به اندازه آنچه در کفه دیگر مقابل آن است، برمی‌داریم. اما پیمانه عین ذات توست، از آن جهت که به حالتی متصف است. پس آن عین پیمانه آن است. بنابراین، از امر جز به اندازه قبول آن برنمی‌داری، همان‌گونه که پیمانه برمی‌دارد. پس در حقیقت، همان‌گونه است که در میزان است. زیرا اگر یکی از دو کفه سنگین‌تر شود، از وزن بودن خارج شده است، چون از مقدار مقابل خود خارج شده، یا به دلیل کم‌فروشی یا غیر آن.\nپس پیامبر (صَلَّى اللهُ عَليهِ وسَلَّم) هنگامی که شرایع بر او نازل شد، پیمانه بود نه میزان. و حق (الحق) چون صحیح نبود که محل امر باشد، خود را در جایگاه پیمانه قرار نداد، بلکه خود را وصف کرد به اینکه میزان در دست اوست که قسط را پایین می‌آورد و بالا می‌برد، بر اساس مراتب عالَم. پس هر پایین آوردن و بالا بردنی در میزان حق، عین اعتدال بین دو کفه در میزان قرار داده شده در عالَم است. زیرا حق جز حق را وزن نمی‌کند. پس میزان حق (الحق) ناگزیر باید در آن پایین آوردن و بالا بردن برای یکی از دو کفه باشد. و اگر بر اعتدال بود، اصلاً کَونی در عالَم ظاهر نمی‌شد و عدلی وجود نداشت. پس هنگامی که موازین شرع الهی در عالَم برپا شود، عدل در عالَم جاری می‌شود. و همچنین اگر وزن طبیعی در عالَم برپا می‌شد، در عالَم بیماری و مرگی وجود نداشت، همان‌گونه که در بهشت نیست، زیرا میزان طبیعی در بهشت حکم خود را آشکار می‌سازد و به همین دلیل آنجا سرای بقا (دار البقاء) است و میزان شرع در آن برداشته می‌شود، همان‌گونه که میزان طبع در دنیا برداشته شده است. پس منع و عطا اگر میزان نبود، حکمی در عالَم نداشتند. و کسی که وزن می‌کند، همان است که به معطی (بخشنده)، مانع (بازدارنده)، ضار (زیان‌رسان) و نافع (سودرسان) وصف شده است و «وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ» (و او به هر چیزی داناست).\nاگر یکی از اهل تحقیق (أهل التحقيق) بگوید که جود الهی (الجود الإلهي) منعی در خود ندارد، می‌گوییم: راست گفتی.\nاگر بگوید: پس اگر راست می‌گویی و قول مرا پذیرفتی، حکم اسم الهی «المانع» چیست و این منعی که در عالَم واقع می‌شود، به چه چیزی بازمی‌گردد، در حالی که ما آن را انکار نمی‌کنیم؟\nمی‌گوییم: اما جود الهی منعی در خود ندارد، ولی جز ممکن آن را نمی‌پذیرد و محال آن را نمی‌پذیرد. پس اگر قابل را شناختی، مانع و منع را نیز شناختی. پس قوابل (پذیرندگان) از این جود مطلق بر اساس استعدادهای خود می‌پذیرند، مانند پارچه و گازر (رخت‌شوی) در فیض نور خورشید. پارچه سفید می‌شود و روی گازر سیاه می‌شود، اگرچه سفید باشد. پس حکیم به آن دو می‌گوید: نور یکی است، اما مزاج گازر از نور خورشید جز سیاهی نمی‌پذیرد و پارچه بر مزاجی است که سفیدی می‌پذیرد. پس مزاج تو تو را از پذیرش سفیدی منع کرده است. و به پارچه گفته می‌شود: مزاج تو تو را از پذیرش سیاهی منع کرده است.\nپس برای هر یک از این دو نفر این امکان وجود دارد که بگوید: پس مسئله به حال خود باقی است، چرا به من مزاجی که سیاهی می‌پذیرد، ندادی؟ و گازر می‌گوید: چرا به من مزاجی که سفیدی می‌پذیرد، ندادی؟\nمی‌گوییم: در عالَم ناگزیر باید پارچه و گازر باشد. پس ناگزیر باید مزاجی باشد که سفیدی بپذیرد و مزاجی که سیاهی بپذیرد. پس شما دو نفر ناگزیر هستید، هر چه که باشید. زیرا عالَم ناگزیر باید شامل هر چیزی باشد. پس ناگزیر باید هر مزاجی در آن باشد. و حق تعالی (الحق تعالی) فعلش با اغراضی که در بندگانش ایجاد کرده، نیست، بلکه با چیزی است که حکمت آن را می‌طلبد. و آنچه حکمت اقتضا کرده، همان است که در عالَم واقع شده است. پس عین ظهور آن، عین حکمت است. زیرا فعل خداوند با حکمت تعلیل نمی‌شود، بلکه عین حکمت است. زیرا اگر با حکمت تعلیل می‌شد، حکمت موجب آن می‌شد و در نتیجه حق (الحق) محکوم می‌شد، در حالی که حق تعالی محکوم نمی‌شود. پس هیچ موجبی چیزی را بر او واجب نمی‌کند، مگر آنچه خود به ما خبر داده که بر نفس خود واجب کرده است، نه اینکه موجبی غیر از او امری را بر او واجب کرده باشد.\nپس هر محلی را که برای مزاج خاصی فرض کنی، می‌تواند تصور کند که غیر از این مزاج، او را منع کرده است. و این اشتباه است، زیرا عین مزاج، عین همان چیزی است که ظاهر شده و نه غیر آن. و صحیح نیست که شیء در مورد خود بگوید: چرا غیر من نبودم؟ همان‌گونه که در باب پیش از این باب بیان کردیم که ترکیب جز بسیط‌ها نیست. پس ترکیب یک نسبت است و نِسب عدمی هستند. و امری ظاهر شده که اگر ترکیب و جمع این بسیط‌ها نبود، ظاهر نمی‌شد. و این ظاهر، غیر از اعیان بسیط‌ها نیست. و همچنین این ظاهر از این مزاج، غیر از مزاج نیست. پس در حقیقت کسی نیست که بگوید: چرا منع شدم؟ و هنگامی که چنین کسی نباشد، منع در جود الهی (الجود الإلهي) صحیح نیست. پس منع و مانع تنها به نِسب مقدر بازمی‌گردند.\nو هیچ کس نبود که خداوند او را بر این علم و امثال آن آشکار سازد و زبان‌های شرایع بر اساس آنچه در زبان‌های عالَم بر آن توافق شده، نازل شوند. به همین دلیل خداوند متعال فرمود:\n«وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ» (و ما هیچ پیامبری را نفرستادیم مگر به زبان قومش).\nپس جز به آنچه بر آن توافق کرده‌اند، نازل نمی‌شود. چه بسا توافق بر صورتی باشد که حقایق بر آن هستند و چه بسا نباشد. و حق (الحق) در همه این‌ها تابع آنان است تا آنچه را در احکام خود نازل کرده و آنچه را وعده داده و وعید نهاده، از او بفهمند. همان‌گونه که دلیل عقلی بر محال بودن حصر حق در «أینیة» (کجا بودن) دلالت کرده است، با این حال زبان شرع به دلیل توافقی که زبان مخاطبان بر آن بود، «أینیة» را در حق حق (الحق) آورد. پس از زن سیاه‌پوست پرسید: «أین الله؟» (خدا کجاست؟). اگر غیر از رسول این را می‌گفت، دلیل عقلی به جهل گوینده شهادت می‌داد، زیرا او را «أینیة» نیست. اما چون رسول آن را گفت و حکمت و علم او آشکار شد، دانستیم که در توان فهم این مخاطب نیست که موجودی را درک کند مگر با آنچه در نفس خود تصور کرده است. پس اگر او را با غیر آنچه بر آن توافق کرده و در نفس خود تصور نموده، خطاب می‌کرد، فایده مطلوب از بین می‌رفت و پذیرش حاصل نمی‌شد. پس از حکمت او بود که از چنین کسی با چنین سؤالی و با این عبارت پرسید. به همین دلیل، هنگامی که او به آسمان اشاره کرد، فرمود که او مؤمن است، یعنی تصدیق‌کننده وجود خداوند است و نفرمود عالم است. پس عالم با علم خود با جاهل در جهلش همراهی می‌کند، اما جاهل نمی‌تواند با عالم در علمش همراهی کند، مگر اینکه عالم در صورت جهل او به سوی او فرود آید. و همه این‌ها حکمت الهی در عالَم است.\n\n[خواری (مهانت) حقیقت عالَم است]\n\nو بدان که خواری (مهانة) حقیقت عالَم است که بر آن است، زیرا عالَم بالذات ممکن و فقیر است. پس او ذاتاً از رسیدن به تمامی مقاصد و اراده‌هایش منع شده است. و وقوع برخی از مرادات و رسیدن به برخی از مقاصدش تو را از آنچه در حق او گفتیم، محجوب نسازد؛ زیرا آن امور جز به اراده حق (الحق) واقع نشده‌اند، نه به اراده او. پس آن مراد و اراده بنده هر دو با هم، تنها به اراده حق واقع شده‌اند. بنابراین، محال است که چیزی در هستی (الوجود) از اراده بنده موجود شود. و اگر اراده بنده در امری خاص نفوذ داشت، نفوذ آن در هر چیزی عمومیت می‌یافت، اگر آن مراد به عین اراده ممکن واقع می‌شد. پس ثابت می‌شود که آنچه واقع شده، به اراده خداوند عز و جل واقع شده است. بنابراین، عالَم ذاتاً ممنوع است، همان‌گونه که ذاتاً ممکن و خوار (مهان) است. و خواری او به دلیل ذاتش است، زیرا بندگی (العبودية) برای ذات اوست و بندگی همان خواری (ذلّة) است. و هر خواری، پست (مهین) است، و هر پستی، تحقیر شده است، و هر تحقیر شده‌ای، مغلوب است. پس آنچه در این مقام (منازلة) آمده که «کسی که تحقیر کرد، غالب شد و کسی که استهانت شد، منع گردید»، صحیح است. و خداوند حق (الحق) را می‌گوید و او راه را می‌نمایاند (وَهُوَ يَهْدِي السَّبِيلَ)."
  },
  "page_count": 4
}