{
  "id": 299,
  "title": {
    "ar": "الباب التاسع والتسعون ومائتان في معرفة منزل عذاب المؤمنين من المقام السرياني في الحضرة المرادية المحمدية",
    "en": "Chapter Two Hundred and Ninety-Nine: Concerning the Gnosis of the Station of the Punishment of the Believers, from the Syriac Station (المقام السرياني), in the Muhammadan Willed Presence (الحضرة المرادية المحمدية).",
    "ur": "باب دو سو ننانوے: الحضرة المرادية المحمدية میں المقام السرياني سے مومنین کے عذاب کے منزل کی معرفت (المعرفۃ) میں۔",
    "fa": "باب دویست و نود و نهم در معرفت جایگاه عذاب مؤمنان از مقام سریانی در حضرت مرادیه محمدیه."
  },
  "content": {
    "ar": "## «الباب التاسع والتسعون ومائتان في معرفة منزل عذاب المؤمنين من المقام السرياني في الحضرة المرادية المحمدية»\n\n\n> إن البروج منازل لمنازل *** قد هيئت للسبعة الأنوار\n\n\n> فإذا مشت بالعدل في أفلاكها *** تبدو لعينك أعين الأغيار\n\n\n> فالحق يجري في المنازل حكمه *** والكون في الأكوار والأدوار\n\n\n> والخلق من تحت المنازل ظاهر *** والأمر من فوق المنازل جاري‏\n\n\n> فيقال في لغة الكيان بأنه *** أمر تصرفه يد الأقدار\n\n\n> والكف والقلم العلي مخطط *** في اللوح ما يبدو من الأسرار\n\n\nاعلم وفقنا الله وإياك أن هذا المنزل من أعظم المنازل الذي تخافه الشياطين النارية لقوة سلطانه عليهم وهو منزل عال يتضمن علوما جمة\n\n\n### [إن الله خلق الروح الإنسانى على الفطرة]\n\n\nاعلم أن الروح الإنساني لما خلقه الله خلقه كاملا بالغا عاقلا عارفا مؤمنا بتوحيد الله مقرا بربوبيته وهو الفطرة التي فطر الله الناس عليها\n\n\nقال رسول الله صلى الله عليه وسلم كل مولود يولد على الفطرة وأبواه هما اللذان يهودانه أو ينصرانه أو يمجسانه‏\n\n\nفذكر الأغلب وهو وجود الأبوين فإنه قد يكون يتيما فالذي يربيه هو له بمنزلة أبويه فالروح ليس له كمية فيقبل الزيادة في جوهر ذاته بل هو جوهر فرد لا يجوز أن يكون مركبا إذ لو كان كذلك لجاز أن يقوم بجزء منه علم بأمر ما وبالجزء الآخر جهل بذلك الأمر عينه فيكون الإنسان عالما بما هو به جاهل وهذا محال فتركيبه في جوهره محال فإذا كان هكذا فلا يقبل الزيادة ولا النقصان كما يقبله الجسم لعدم التركيب ولو لا ما هو عاقل بذاته وهو عقل لنفسه ما أقر بربوبية خالقه عند أخذ الميثاق منه بذلك إذ لا يخاطب الحق إلا من يعقل عنه خطابه هذا هو حقيقة\nالإنسان في نفسه ثم إن الله تعالى جعل له في الجسم الذي جعله الله له ملكا واستوى عليه جعل فيه قوى وآلات حسية ومعنوية وقيل له خذ العلوم منها وصرفها على حد كذا وكذا وجعلت له هذه الآلات على مراتب فالقوى المعنوية كلها قوى كاملة إلا قوة الخيال فإنها خلقت ضعيفة والقوة الحساسة وجعلت هاتان القوتان تابعة للجسم فكلما نما الجسم وكبر وزادت كميته كلما تقوى حسه وخياله إذ كانت جميع القوي لا تأخذ الأشياء إلا من الخيال وهي قوة هيولانية قابلة لجميع ما يعطيها الحس من الصور وقابلة لما تفتح فيها القوة المصورة من الصور التي تركبها من أمور موجودة قد أمسكها الخيال من القوة الحساسة وليس في القوي من يشبه الهيولى في قبول الصور إلا الخيال فإذا تقوى الخيال حينئذ وجد الفكر حيث يتصرف ويظهر سلطانه والوهم كذلك والعقل كذلك والقوة الحافظة كذلك فلم تكن لطيفة الإنسان من حيث ذاتها مدركة لما تعطيها هذه القوي إلا بوساطتها فلو اتفق أن تعطيها هذه القوي المعلومات من أول ما يظهر الولد في عالم الحس قبلها الروح الإنساني قبولا ذاتيا أ لا ترى أن الله قد خرق العادة في بعض الناس في ذلك وهو ما ذكر من صبي يوسف حين شهد له بالبراءة وكلام عيسى عليه السلام حين شهد بالبراءة وصبي جريج حين شهد له بالبراءة هذا سبب تأخير التكليف عن الروح الإنساني إلى الحلم الذي هو حد كمال هذه القوي في علم الله فلم يبق عند ذلك عذر للروح الإنساني في التخلف عن النظر والعمل بما كلفه ربه وأول درجات التكليف إذ كان ابن سبع سنين إلى أن يبلغ الحلم وقد اعتبر الله فعل الصبي في غير زمان تكليفه لو قتل لم يقم عليه الحد وحبس إلى أن يبلغ ويقتل بمن قتل في صباه إلا أن يعفو ولي الدم فقد آخذه الله بما لم يعمله في زمان تكليفه والقصد من هذا التمهيد ليقع الأنس بما نورده من عذاب المؤمن فإن الإنسان كما قلنا خلق مؤمنا وإن ألحقناهم بآبائهم في دفنهم في قبورهم معهم ورقهم إذا ملكناهم بطريق الإلحاق لا بطريق الاستحقاق تشريفا وتبيينا لعلو مرتبة ظهور الايمان الذي في الآباء وكما أن الكفر عارض كان الاسترقاق عارضا أيضا والأصل الحرية والايمان فمن إنفاذ الوعيد من حيث لا يشعر به وجود التكليف وهو أول العذاب لقيام الخوف بنفس المكلف فقد عذب عذابا نفسيا مؤلما وهو عقوبة ما جرى منه في الزمان الذي لم يكن فيه مكلفا من الأفعال التي تطرأ بين الصبيان من الأذى والشتم والضرب على طريق التعدي وكل خير يفعله الصبي يكتب له وقد قرر ذلك الشارع حين‏\n\n\nرفعت امرأة إليه صلى الله عليه وسلم صبيا صغيرا وهو في الحج فقالت له يا رسول الله أ لهذا حج فقال لها رسول الله صلى الله عليه وسلم نعم له حج ولك أجر\n\n\nوذلك أن لها أجر المعونة التي لا يقدر الصبي عليها وقد ورد عن رسول الله صلى الله عليه وسلم أن الصبي إذا حج قبل بلوغ التكليف ثم مات قبل البلوغ كتب الله له ذلك الحج عن فريضته وكذلك العبد إذا حج عبدا ثم مات قبل العتق‏\n\n\nوهذا الحديث وإن كان قد تكلم فيه من طريق إسناده فإن الحديث الصحيح يعضده وقد ورد في الصحيح أن الله يقول يوم القيامة في حق العبد يأتي بما فرض الله عليه ناقصا قد انتقص منه شيئا أن يكمل له من تطوعه ما نقص من ذلك‏\n\n\nفقد أقام التطوع مقام الفرض وهو هذا بعينه لأن حج غير المكلف به ليس هو فرض عليه‏\n\n\nقال صلى الله عليه وسلم عن الله تعالى في الحديث الصحيح إنه أول ما ينظر فيه من عمل العبد الصلاة فيقول الله انظروا في صلاة عبدي أتمها أم نقصها فإن كانت تامة كتبت له تامة وإن كان انتقص منها شيئا قال انظروا هل لعبدي من تطوع فإن كان له تطوع قال أكملوا لعبدي فريضته من تطوعه قال صلى الله عليه وسلم ثم تؤخذ الأعمال على ذاكم‏\n\n\nأي فيفعل في الزكاة والصوم والحج مثل ما فعل في الصلاة سواء فلو لم يعتبر الشرع ذلك لم يحكم بهذا وكل ما يفعله الصبي في غير بلوغ زمان التكليف معتبر في الشرع في الخير وفي الشر غير إن الكرم الإلهي جازاه بالخير المعمول في هذا الزمان في الدار الآخرة وادخر له ذلك وأما الشر فلم يدخر له في الآخرة منه شيئا بل جازاه به في الدنيا من آلام حسية ونفسية تطرأ على الصبيان وهي موجودة لا يقدر أحد على إنكارها وهي عقوبات وعذاب لأمور تطرأ من الصبيان يعرف هذا القدر أهل طريقنا حكمة أوقفهم الحق عليها وهي في حق المؤمنين كما قلنا عذاب أوجب لهم الكفارة وفي حق الكفار إذا أدركوا وماتُوا وهُمْ كُفَّارٌ وعوقبوا في الآخرة وقد كانوا عذبوا في الدنيا وهم صغار مثل ما تعذب المؤمنون في حال صغرهم فذلك قوله تعالى زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ يعني الذي عذبوا به في‏\nالدنيا وما شاكل هذا فإن هذا نص في تضاعف العذاب على مراتبه الذي هو واحد من ذلك ومن عذاب المؤمنين ما سلط الله عليهم من أصحاب الأهواء والكفار من الأسر والعذاب والاسترقاق والقتل في الدنيا كل هذا تكفير لهفوات ومزلات نفسية وحسية على قدر ما وقع منهم وما يقع هذا من الكفار بالمؤمنين إلا لأجل إيمانهم قال تعالى يُخْرِجُونَ الرَّسُولَ وإِيَّاكُمْ أَنْ تُؤْمِنُوا فإن وما بعدها بتأويل المصدر كأنه يقول يخرجون الرسول وإياكم من أجل إيمانكم وقال تعالى وما نَقَمُوا مِنْهُمْ إِلَّا أَنْ يُؤْمِنُوا وعليه يخرج تخليد من قتل مؤمنا متعمدا أي قصد قتله لإيمانه ومما يتضمن هذا المنزل علم الابتلاء وليس ذلك إلا لله قال تعالى ولَنَبْلُوَنَّكُمْ وقال عز وجل أيضا لِيَبْلُوَكُمْ وليس للمؤمن أن يبتلي المؤمن إلا بأمر إلهي فيكون الابتلاء لله تعالى ومنه لا منهم مثل قوله تعالى فَامْتَحِنُوهُنَّ فالله أمر بذلك فامتثل العبد أمر سيده كالسلطان يأمر بعذاب شخص فيتولى عذابه من أمر بتعذيبه وإن كان شفيقا عليه ولكن أمر السلطان واجب أن يمتثل للمرتبة لما يقتضيه من الهيبة فالابتلاء لا يكون إلا لله وكل من ابتلى أحدا من المؤمنين بغير أمر إلهي فإن الله يؤاخذه على ذلك وبهذا المقام انفرد الاسم الخبير وهو من أعجب أحكام الأسماء لأن الخبرة إنما جاءت لاستفادة علم المخبر المختبر وهنا في الجناب الإلهي العلم محقق بما يكون من هذا المختبر اسم مفعول فلا يستفيد علما المختبر اسم فاعل فيظهر أنه لا حكم لهذا الاسم وكان الأولى به العبد لجهله بما يكون من المختبر اسم مفعول والعبد ممنوع من الاختيار إلا بأمر إلهي فقد يسمى الله تعالى بما يستحقه العبد فحكمه في جناب الحق إفادة العلم للمختبر في نفسه بهذا الاختبار لإقامة الحجة عليه وله فلهذا لا يلحق الخبير بصفة العلم كما ألحقه أبو حامد والأسفراييني وأكثر الناس ولو كان كما زعموا لكان نقصا\n\n\nوإنما أوقعهم في ذلك قوله تعالى حَتَّى نَعْلَمَ وهو حجة عليهم إن لو كان الأمر على ظاهره فإن الاختبار سبب في تحصيل العلم ما هو نفس العلم وبالخبرة سمي خبيرا فإذا حصل العلم سمي عالما في ذلك الحال وغاية من نزه مثل ابن الخطيب وغيره في قوله حَتَّى نَعْلَمَ تعلق العلم بهذه الحالة وتعلق العلم محدث ولا يؤدي إلى حدوث العلم فبقي العلم على حاله من الوصف بالقدم وإن حدث التعلق فهذا منتهى غايتهم في التنزيه ويقولون لو تعلق العلم بما من شأنه إنه سيكون كائنا أو قد كان فقد علم الشي‏ء على خلاف ما هو به وكذلك لو علم ما هو كائن قد كان أو سيكون أو علم ما كان هو كائن أو سيكون لكان هذا كله جهلا والله يتعالى عن ذلك فأدخلوا على الله الزمان من حيث لا يشعرون والتقدم في الأشياء والتأخر وما علموا إن الله تعالى يشهد الأشياء ويعلمها على ما هي عليه في أنفسها والأزمنة التي لها من جملة معلوماته مستلزمة لها وأحوالها وأمكنتها إن كانت لها ومحالها إن كانت ممن يطلب المحال وأحيازها كل ذلك مشهود للحق في غير زمان لا يتصف بالتقدم ولا بالتأخر ولا بالآن الذي هو حد الزمانين ولهذا لم يرد مع‏\n\n\nقوله صلى الله عليه وسلم عن ربه كان الله ولا شي‏ء معه‏\n\n\nوأتى بكان وهي حرف وجودي لا بفعل ولم يقل وهو الآن فإن الآن نص في وجود الزمان فلو جعله ظرفا لهوية الباري تعالى لدخل تحت ظرفية الزمان بخلاف كان فإن لفظ كان من الكون وهو عين الوجود فكأنه يقول الله موجود ولا شي‏ء معه في وجوده فما هي من الألفاظ التي ينجر معها الزمان إلا بحكم التوهم ولهذا لا ينبغي أن يقال كان فعل ماض في إعرابه على طريقة النحويين وقد بوب عليها الزجاجي وسماها بالحرف الذي يرفع الاسم وينصب الخبر ولم يجعلها فعلا فينجر معها الزمان الماضي والحال والمستقبل وبهذا القدر المتوهم الذي يتخيل في هذه الصيغة التي هي كان ويكون وسيكون من الزمان أشبهت الفعل الصحيح الذي هو قام ويقوم وسيقوم وجعلوا قائما مثل كائن فأجروها مجرى الأفعال من هذا الوجه وإذا كان أمرها على هذا فيطلق من الوجه الذي لا يقبل به ظرفية الزمان على الله تعالى وهو قوله وكانَ الله غَفُوراً رَحِيماً وكانَ الله شاكِراً عَلِيماً وما أطلق عليه الآن لما ذكرناه لأنه نص في الزمان اسم علم له ومعناه الظرف كما جاء الاستواء على العرش بلفظ العرش ولفظ الاستواء وما هو نص في ظرفية المكان بخلاف اسم لفظة المكان فإنه نص بالوضع في ظرفيته والمتمكن في المكان نص فيه فعدل إلى الاستواء والعرش ليسوغ التأويل الذي يليق بالجناب العالي لمن يتأول ولا بد والأولى التسليم لله فيما قاله ورد ذلك إلى علمه سبحانه بما أراده في هذا الخطاب ونفى التشبيه المفهوم منه بقوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ على زيادة الكاف أو فرض المثل‏\nإذ كان لا يستحيل فرض المحال ومما يتضمن هذا المنزل علم العالم العلوي المختص بالفلك الأطلس خاصة ومن عمارة وما تسبيحهم وما يتعلق به عمن يأخذ ولمن يعطي ومن يتلقى منه والعطاء الذاتي وهو عطاء العلة والعطاء الإرادي وهو عطاء الاختيار ومعرفة الآخرة ومعرفة ما يحصل من التجلي في نفس العبد وتأثير الضعيف في القوي وما تؤدي إليه الأغراض والأهواء الربانية السارية في العالم التي يدعيها كل أحد من الحيوان الإنسان وغيره ومعرفة الصلاح الذي تسأله الأنبياء من الله والتصديق الإنساني خاصة ولمن يصدق وبما ذا يصدق وما ذا يرد وهل يلزمه التصديق بما يحيله دليل العقل وما منزلته عند الله وأين ينتهي بصاحبه وهل المؤمنون فيه على السواء أو يتفاضلون وهل يقبل الزيادة والنقص أو هل ينقص في وقت عند قيام شبهة على ما وقع به التصديق وهل إذا قام به النقص في مسألة من مسائل الايمان هل يسرى ذلك النقص في الايمان كله أو يؤثر في زواله بالكلية أو هو مقصور على ما وقعت عليه الشبهة ومعرفة سرعة الأخذ الإلهي ما سببها فإنه لما أطلعني الله تعالى على إنزال هذه الآية بالإنزال الذي يرد على أمثالنا ممن ليس بنبي فإن القرآن وكل كلام ينزل على التالين والمتكلمين في حال تلاوتهم وكلامهم ولو لا ذلك ما تلوا ولا تكلموا وهنا لطائف إلهية لمن نظر فقيل لي اقرأ قلت وما أقرأ فقيل لي اقرأ وكَذلِكَ أَخْذُ رَبِّكَ إِذا أَخَذَ الْقُرى‏ وهِيَ ظالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ فقرأت هذه الآية على ما كنت أحفظها فقيل لي لما وصلت إلى قوله تعالى إِنَّ أَخْذَهُ قيل لي قل بك فقلت ما هو في القرآن ولا نزل كذا فقيل لي لا تقل هكذا بل هكذا هو وكذا نزل قل بك وشدد علي فقرأت إن أخذه بك أليم شديد فطلبت معنى ذلك فأقيم لي شخص كنت أعرفه وكان قد افترى علي فقيل لي هذا مأخوذ بك أي بسببك فاقرأ إن أخذه بك أليم شديد وهو ممدود بين يدي فلما فرغ ذلك التنزيل استدعيت بالشخص وقلت له ما رأيت فتأفف علي وأظهر التوبة وخرج عني وهو على حاله من الفرية فلم يكمل الشهر حتى قتله الله بحجر شدخ رأسه وما أخذ القاتل من ثيابه ولا فرسه ولا ماله شيئا فشاع الخبر وانتهى إلى السلطان وقرروا عند السلطان إني كنت سبب قتله فما التفت السلطان فلما كان يعد ثلاث سنين جاء القاتل واعترف بين يدي السلطان بقتله فسأله ما سبب ذلك فقال ما له سبب ولا فعل معي قبيحا إلا أني مررت عليه وهو نائم في خربة ولجام فرسه في يده فزين لي قتله فعمدت إلى حجر كبير فاقتلعته ووازنت رأسه ورميت عليه الحجر فما تحرك ولا أخذت له شيئا وما طمعت في شي‏ء من ذلك ولا اكترثت فقتله السلطان به وبعث إلى الخبر بذلك وهذا من أعجب التنزلات وجود مثل هذه الزيادة فيعرف العارف من هذا المنزل من أين صدرت وما اسمها وما منزلتها من كلام الحق فإن الأخبار النبوية المروية عن الله لا تسمى قرآنا مع أنها من كلام الله ويتضمن هذا المنزل علم بدء الخلق وإعادته وكيفية إعادته فإن أهل الكشف اختلفوا في الكيفية فذهب ابن قسي إلى كيفية انفرد بها وذهب الآخرون إلى غير ذلك على اختلاف بينهم وكذلك اختلف فيه علماء النظر الفكري ويتضمن علم المحبة الإلهية وثبوتها وعلم الستور التي بين المحبوبين وبين ما يؤدي لو وقع من غيرهم إلى عقوبتهم كما قيل‏\n\n\n> وإذا الحبيب أتى بذنب واحد *** جاءت ملاحته بكل شفيع‏\n\n\nوعلم العرش وعددها وصفاتها وعلم الإرادة المضافة إليه وما تأثيرها في حال العارفين وهل هي من نعوت الجلال أو من نعوت الجمال ويتضمن علم الاعتبار ويتضمن علم الوعيد من أي اسم هو ويتضمن علم النفس الكلية ولما ذا لا يلحقها التغيير وما شرف القرآن على غيره من الكتب والصحف والأخبار المروية عن الله مع أن ذلك كله كلام الله وينجر مع هذا العلم في نفس القرآن شرف آية الكرسي على سائر آي القرآن بالسيادة ويس بالقلبية وإذا زلزلت‏\n\n\nبقيامها مقام نصف القرآن وسورة الكافرون مقام ربع القرآن وكذلك إذا جاء نصر الله وسورة الإخلاص مقام ثلث القرآن ويس مقام القرآن عشر مرار ولما ذا يرجع ذلك ومن هو الموصوف بهذا الفضل هل الدليل أو المدلول أو الناظر في الدليل ويكفي هذا القدر من هذا المنزل والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (انتهى الجزء الثاني من كتاب الفتوحات المكية بحمد الله وعونه وحسن توفيقه ويتلوه المجلد الثالث أوله الباب الموفي ثلاثمائة)\n# [الجزء الثالث‏]\n\n\nالجزء الثالث من كتاب الفتوحات المكية التي فتح الله بها على الشيخ الإمام العامل الراسخ الكامل خاتم الأولياء الوارثين برزخ البرازخ محيي الحق و الدين أبي عبدالله محمّد بن علي المعروف بابن عربي الحاتمي الطائي قدّس الله روحه و نوّر ضريحه آمين طبع على النسخة المقابلة على نسخة المؤلف الموجودة بمدينة قونية وقام بهذا المهم جماعة من العلماء بأمر المغقور له الأمير عبد القادر الجزايرلي رحم الله الجميع وأثابهم المكان الرفيع طبع بمطبعة دار الكتب العربية الكبرى بمصر على نفقة الحاج فدا محمد الكشميري وشركاه‏\nبسم الله الرحمن الرحيم‏\n\n",
    "en": "Chapter Two Hundred and Ninety-Nine: Concerning the Knowledge of the Station of the Punishment of the Believers, from the Syriac Station (المقام السرياني) in the Muhammadan Presence of Divine Will (الحضرة المرادية المحمدية).\n\nIndeed, the constellations (al-buruj) are stations for stations,\nWhich have been prepared for the Seven Lights (al-anwar).\n\nAnd when they move with justice in their spheres (aflak),\nThe eyes of the others (al-aghyar) appear to your eye.\n\nFor The Real (al-Haqq) executes His decree in the stations,\nAnd the Cosmos (al-Kawn) is in cycles (al-akwar) and revolutions (al-adwar).\n\nAnd Creation (al-Khalq) is manifest beneath the stations,\nWhile the Command (al-Amr) flows from above the stations.\n\nSo it is said in the language of existence (al-kiyan) that it is\nA Command managed by the hand of the Divine Decrees (al-aqdar).\n\nAnd the Hand and the Exalted Pen (القلم العلي) delineate\nIn the Tablet (al-Lawh) what appears of the secrets (al-asrar).\n\nKnow—may Allah grant us and you success—that this station (منزل) is one of the greatest stations, which the fiery devils fear due to the strength of its authority over them. It is an elevated station containing abundant sciences.\n\n### [Indeed, Allah Created the Human Spirit upon the Primordial Nature (al-Fitra)]\n\nKnow that when Allah created the human spirit (الروح الإنساني), He created it perfect, mature, intelligent, gnostic (عارفًا), believing in the Oneness (tawhid) of Allah, and affirming His Lordship (rububiyya). This is the primordial nature (al-fitra) upon which Allah fashioned humanity.\n\nThe Messenger of Allah, peace and blessings be upon him, said: \"Every child is born upon the primordial nature (al-fitra), and his parents make him a Jew, a Christian, or a Magian.\"\n\nHe mentioned the most common case, which is the existence of the parents, for a child may be an orphan, and the one who raises him is in the position of his parents. The spirit (الروح) does not possess quantity (kammiyya) such that it accepts increase in the essence of its substance (jawhar dhatihi). Rather, it is a singular substance (jawhar fard) that cannot be composite. For if it were composite, it would be possible for knowledge of a certain matter to reside in one part of it, and ignorance of that very matter to reside in the other part. Thus, the human would be knowing of that which he is ignorant, and this is impossible. Therefore, its composition in its substance is impossible. Since this is the case, it accepts neither increase nor decrease, as the body accepts, due to the absence of composition. Were it not inherently intelligent (عاقل بذاته)—being intellect (aql) for itself—it would not have affirmed the Lordship (rububiyya) of its Creator when the Covenant (al-Mithaq) was taken from it concerning that, for The Real (al-Haqq) only addresses one who can comprehend His address. This is the reality (haqiqa) of the human being in itself.\n\nThen, Allah the Exalted established for the spirit a body, which He made its dominion and over which He established Himself. He placed within it sensory and spiritual faculties (quwa) and instruments (alat). It was told: \"Acquire knowledge from these and employ them according to such and such a limit.\" These instruments were established for it upon various levels (maratib). All the spiritual faculties are perfect faculties, except for the faculty of Imagination (قوة الخيال), which was created weak, and the sensory faculty (القوة الحساسة). These two faculties were made dependent upon the body. Whenever the body grows, increases in size, and its quantity (kammiyya) increases, its sense and imagination strengthen, since all the faculties only receive things from the Imagination (الخيال). The Imagination is a hylomorphic faculty (قوة هيولانية), capable of receiving all the forms (suwar) that the sense provides, and capable of receiving the forms that the formative faculty (القوة المصورة) opens up within it—forms which it constructs from existing matters that the Imagination has retained from the sensory faculty. Among the faculties, none resembles the Prime Matter (al-Hayula) in accepting forms except the Imagination. When the Imagination strengthens, then Thought (al-Fikr) finds a place to operate and manifest its authority, and likewise Delusion (al-Wahm), and likewise Intellect (al-Aql), and likewise the Retentive Faculty (القوة الحافظة).\n\nThe subtle essence (latifa) of the human being, in terms of its own substance (dhat), does not perceive what these faculties provide except through their mediation. If it were to happen that these faculties provided information from the very moment the child appears in the sensory world, the human spirit would accept it with an essential acceptance. Do you not see that Allah has broken the custom (kharaqa al-‘ada) for some people in this regard? This is what was mentioned concerning Joseph’s infant witness who testified to his innocence, and the speech of Jesus, peace be upon him, when he testified to innocence, and the infant of Jurayj when he testified to his innocence. This is the reason for delaying the imposition of religious responsibility (al-taklif) upon the human spirit until puberty (al-hulm), which is the limit of the perfection of these faculties in Allah’s Knowledge. At that point, the human spirit has no excuse for failing to contemplate and act upon what its Lord has commanded it. The first degree of responsibility begins when the child is seven years old until he reaches puberty.\n\nAllah has taken into account the action of the minor (al-sabiyy) outside the time of his responsibility. If he kills, the prescribed penalty (al-hadd) is not carried out upon him; rather, he is imprisoned until he reaches puberty, and then he is executed for the one he killed in his childhood, unless the guardian of the blood (wali al-dam) pardons him. Thus, Allah holds him accountable for what he did outside the time of his responsibility. The purpose of this introduction is to familiarize the reader with what we shall present concerning the punishment of the believer. For the human being, as we said, was created a believer, even if we join them to their parents in burying them in their graves with them, and even if we enslave them when we possess them—this is by way of attachment (ilhāq), not by way of deserving (istihqāq), as an honor and a clarification of the high degree of the manifestation of faith (al-iman) present in the parents. Just as disbelief (al-kufr) is accidental (‘arid), so too is enslavement (al-istirqaq) accidental. The origin (al-asl) is freedom and faith.\n\nPart of the execution of the threat (al-wa‘id), which the person does not perceive, is the existence of religious responsibility (al-taklif), which is the first punishment (al-adhāb), due to the establishment of fear in the soul of the responsible person (al-mukallaf). He is thus punished with a painful psychological punishment (عذاب نفسي). This is the retribution for what occurred from him during the time he was not responsible, such as the actions that occur among children: harm, cursing, and hitting by way of transgression. Every good deed the minor performs is recorded for him. The Lawgiver (al-Shari’) established this when a woman raised a small child to him, peace and blessings be upon him, while they were performing the Hajj, and she said to him, \"O Messenger of Allah, is there Hajj for this child?\" The Messenger of Allah, peace and blessings be upon him, replied, \"Yes, there is Hajj for him, and you have the reward.\"\n\nThat is because she receives the reward for the assistance which the minor is incapable of performing himself. It has been reported from the Messenger of Allah, peace and blessings be upon him, that if a minor performs Hajj before reaching the age of responsibility, and then dies before puberty, Allah records that Hajj for him as his obligatory duty (farida). Likewise, if a slave performs Hajj while enslaved and then dies before being freed.\n\nAlthough there has been discussion regarding the chain of transmission (isnād) of this hadith, it is supported by the sound (sahih) hadith. It is reported in the *Sahih* collections that Allah will say on the Day of Resurrection concerning the servant who comes with what Allah has obligated upon him, but it is deficient, having been diminished in some way: that what is lacking should be completed for him from his voluntary acts (tatawwu').\n\nThus, He established the voluntary act in the place of the obligatory duty (fard), and this is exactly the case here, because the Hajj of one who is not religiously responsible is not an obligatory duty upon him.\n\nThe Prophet, peace and blessings be upon him, said, reporting from Allah the Exalted in the sound hadith: \"Indeed, the first thing that will be examined from the servant's deeds is the Prayer (al-Salat). Allah will say: 'Look at My servant's prayer. Did he complete it or diminish it?' If it is complete, it is recorded for him as complete. If he diminished something from it, He says: 'Look, does My servant have any voluntary acts (tatawwu')?' If he has voluntary acts, He says: 'Complete My servant's obligatory duty from his voluntary acts.'\" The Prophet, peace and blessings be upon him, said: \"Then the rest of the deeds are taken in the same manner.\"\n\nThat is, the same is done for Zakat, Fasting, and Hajj as is done for the Prayer. If the Law (al-Shar’) did not take this into account, it would not have ruled thus. Everything the minor does outside the time of reaching responsibility is considered in the Law, both for good and for evil. However, Divine Generosity (al-Karam al-Ilahi) rewards him for the good performed during this time in the Hereafter (al-Dar al-Akhira) and stores it up for him. As for the evil, nothing of it is stored up for him in the Hereafter; rather, He punishes him for it in this world (al-Dunya) through sensory and psychological pains that afflict children, which are existent and which no one can deny. These are retributions and punishments (‘uqubat wa ‘adhab) for matters that occur from children. The people of our path (ahl tariqina) know this measure as a wisdom upon which The Real (al-Haqq) has informed them. In the case of believers, as we said, it is a punishment that necessitates expiation (kaffara) for them. In the case of disbelievers (al-kuffar), if they reach maturity and die while they are disbelievers, and they are punished in the Hereafter, having already been punished in the world when they were young, just as the believers are punished in their childhood—that is the meaning of His saying, the Exalted: <<زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ>> (We shall increase them in punishment upon the punishment), meaning the punishment with which they were punished in the world.\n\nAnd what resembles this, for this is an explicit text concerning the multiplication of punishment upon its levels, of which this is one. Among the punishments of the believers is what Allah has imposed upon them from the people of caprice (ahl al-ahwa’) and the disbelievers: imprisonment, torment, enslavement (al-istirqaq), and killing in the world. All of this is an expiation (takfir) for psychological and sensory slips and errors (hafawat wa mazallat), according to what occurred from them. This only happens to believers by disbelievers because of their faith (iman). The Exalted said: <<يُخْرِجُونَ الرَّسُولَ وإِيَّاكُمْ أَنْ تُؤْمِنُوا>> (They expel the Messenger and yourselves because you believe). The particle *an* and what follows it are interpreted as a verbal noun, as if He were saying: \"They expel the Messenger and yourselves on account of your faith.\" And the Exalted said: <<وما نَقَمُوا مِنْهُمْ إِلَّا أَنْ يُؤْمِنُوا>> (And they resented them for nothing except that they believed). Based on this, the eternal damnation (takhlid) of one who kills a believer intentionally is understood—that is, he intended to kill him because of his faith.\n\nAmong the contents of this station (manzil) is the science of Trial (علم الابتلاء), and this belongs exclusively to Allah. The Exalted said: <<ولَنَبْلُوَنَّكُمْ>> (And We will surely test you). And He, the Mighty and Majestic, also said: <<لِيَبْلُوَكُمْ>> (That He may test you). It is not permissible for a believer to test another believer except by a Divine Command (amr ilahi). Thus, the trial (al-ibtila’) belongs to Allah the Exalted and originates from Him, not from them. An example is His saying: <<فَامْتَحِنُوهُنَّ>> (Then test them). Allah commanded this, and the servant complied with the command of his Master, just as a ruler commands the punishment of a person, and the one commanded to inflict the punishment carries it out, even if he is compassionate toward the person. However, the command of the ruler must be obeyed due to the rank (martaba) and the awe (hayba) it necessitates.\n\nTherefore, trial (al-ibtila’) belongs only to Allah. Anyone who tries a believer without a Divine Command will be held accountable by Allah for that. By this station, the Name *al-Khabir* (The All-Aware) is distinguished. This is one of the most wondrous rulings of the Names, because *khibra* (awareness/experience) is only used to gain knowledge of the one being tested (the object of the test). Here, in the Divine Presence (al-Janab al-Ilahi), the knowledge of what will occur from the one being tested (the passive participle) is already realized. Thus, the tester (the active participle) does not gain knowledge. It would appear, then, that this Name has no ruling [in the Divine context], and that it would be more appropriate for the servant, due to his ignorance of what will occur from the one being tested (the passive participle). However, the servant is prohibited from testing except by Divine Command. Allah the Exalted may thus be named by what the servant deserves. Its ruling in the Divine Presence (Janab al-Haqq) is to impart knowledge to the one being tested about himself through this test, in order to establish the proof (al-hujja) against him and for him. For this reason, *al-Khabir* is not attached to the Attribute of Knowledge (sifat al-‘ilm), as Abu Hamid, al-Asfara’ini, and most people attached it. If it were as they claimed, it would imply deficiency.\n\nWhat led them into this error is His saying, the Exalted: <<حَتَّى نَعْلَمَ>> (So that We may know). This is an argument against them if the matter were taken literally, for testing is a means of acquiring knowledge, not knowledge itself. By *khibra* (awareness), He is named *Khabir*. When knowledge is acquired, He is named *‘Alim* (Knower) in that state. The ultimate extent of those who uphold transcendence (tanzih), such as Ibn al-Khatib and others, regarding His saying <<حَتَّى نَعْلَمَ>> is that the Knowledge relates to this state, and the relation of Knowledge is originated (muhdath) but does not lead to the origination of the Knowledge itself. Thus, the Knowledge remains in its state of being described as Pre-eternal (qidam), even if the relation is originated. This is the limit of their goal in upholding transcendence. They say: If Knowledge related to something whose nature is that it *will be* as if it *has been*, then the thing would be known contrary to its reality. Likewise, if He knew what *is* as if it *has been* or *will be*, or knew what *was* as if it *is* or *will be*, all of this would be ignorance, and Allah is far exalted above that. Thus, they introduced time (al-zaman) upon Allah without realizing it, along with precedence (taqaddum) and subsequence (ta’akhkhur) in things. They did not know that Allah the Exalted witnesses things and knows them according to what they are in themselves. The times (azmina) that belong to them are among the totality of His known things, necessitated by them, along with their states, their places (amkina) if they have them, their impossibilities (mahallaha) if they are among those that seek the impossible, and their spatial boundaries (ahya’uha). All of this is witnessed by The Real (al-Haqq) in a non-time (ghayr zaman) that is not characterized by precedence, subsequence, or the *now* (al-an), which is the boundary between the two times.\n\nFor this reason, the Prophet’s saying, reporting from his Lord, \"Allah was (kāna), and there was nothing with Him,\" did not include [the word *al-an* (now)]. He used *kāna*, which is a particle of existence (harf wujudi), not a verb, and He did not say, \"And He is now (al-an),\" for *al-an* explicitly denotes the existence of time (al-zaman). If it were made an adverb of time (zarf) for the Identity (huwiyya) of the Creator, He would fall under the temporality of time. This is unlike *kāna*, for the word *kāna* derives from *al-kawn* (being/occurrence), which is the very essence of Existence (al-Wujud). It is as if He is saying: \"Allah is Existent, and nothing is with Him in His Existence.\" It is not among the words that imply time except by way of illusion (tawahhum). Therefore, it should not be parsed as a past tense verb (*fi‘l madin*) according to the method of the grammarians (al-nahwiyyin). Al-Zajjaji categorized it and named it the particle that raises the subject and installs the predicate, and he did not make it a verb that implies past, present, or future time. It is by this illusory measure, which is imagined in the forms *kāna*, *yakūnu*, and *sayakūnu* concerning time, that it resembles the true verb, which is *qāma* (he stood), *yaqūmu* (he stands), and *sayaqūmu* (he will stand). They made *qā’im* (standing) like *kā’in* (being) and treated them as verbs in this respect. Since its matter is thus, it is applied to Allah the Exalted in the sense that does not accept the temporality of time, such as His saying: <<وكانَ الله غَفُوراً رَحِيماً>> (And Allah is ever Forgiving, Merciful), and <<وكانَ الله شاكِراً عَلِيماً>> (And Allah is ever Appreciative, All-Knowing). But *al-an* (now) is not applied to Him for the reason we mentioned, because it is an explicit name for time, and its meaning is the adverb of time. Similarly, the establishment (al-istiwa’) upon the Throne (al-‘Arsh) came with the word *al-‘Arsh* and the word *al-istiwa’*, neither of which explicitly denotes spatiality (zarfiyyat al-makan), unlike the name of the word *al-makan* (place), which explicitly denotes spatiality by convention, and the one who occupies the place explicitly denotes it. Thus, He shifted to *al-istiwa’* and *al-‘Arsh* to allow for the interpretation (ta’wil) that befits the Exalted Presence (al-Janab al-‘Ali) for those who must interpret. The better approach is submission to Allah regarding what He has said, referring that back to His knowledge, the Glorified, concerning what He intended in this address, and negating the anthropomorphism (tashbih) understood from it by His saying: <<لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ>> (There is nothing like Him), whether by the addition of the particle *ka* (like) or by assuming a likeness, since assuming the impossible is not impossible.\n\nAmong the contents of this station (manzil) is the science of the Upper World (العالم العلوي), specifically related to the Atlas Sphere (الفلك الأطلس), its inhabitants, their glorification (tasbih), and what relates to whom they receive from, to whom they give, and from whom they receive. [It includes the science of] the Essential Gift (العطاء الذاتي), which is the gift of causality (al-‘illa), and the Volitional Gift (العطاء الإرادي), which is the gift of choice (al-ikhtiyar). [It includes] the knowledge of the Hereafter (الآخرة), and the knowledge of what occurs of Theophany (التجلي) in the soul (nafs) of the servant, and the influence of the weak upon the strong, and what the Divine Purposes (الأغراض الربانية) and Desires (الأهواء الربانية) that permeate the cosmos lead to—which every living being, human and otherwise, claims. [It includes] the knowledge of the righteousness (الصلاح) that the Prophets ask of Allah, and specifically human affirmation (التصديق الإنساني): whom he affirms, by what he affirms, what he rejects, whether he is obligated to affirm that which the proof of reason (دليل العقل) deems impossible, what his rank is with Allah, where it leads its possessor, whether the believers are equal in it or differ in degree, whether it accepts increase and decrease, or whether it decreases at a time when a doubt (shubha) arises concerning that which was affirmed. And if a deficiency arises in a matter of faith (iman), does that deficiency spread throughout the entire faith, or does it affect its complete removal, or is it restricted to the matter upon which the doubt arose?\n\n[It includes] the knowledge of the swiftness of Divine Seizure (الأخذ الإلهي) and its cause. When Allah the Exalted informed me of the revelation (inzal) of this verse—a revelation that comes to people like us who are not prophets, for the Quran and all speech descends upon those reciting and speaking during their recitation and speech, otherwise they would neither recite nor speak—and here there are Divine subtleties for those who contemplate—I was told: \"Recite.\" I asked, \"What shall I recite?\" I was told: \"Recite: <<وَكَذلِكَ أَخْذُ رَبِّكَ إِذا أَخَذَ الْقُرى‏ وهِيَ ظالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ>> (And thus is the seizure of your Lord when He seizes the towns while they are committing wrong. Indeed, His seizure is painful and severe).\" I recited this verse as I had memorized it. When I reached His saying, the Exalted: <<إِنَّ أَخْذَهُ>> (Indeed, His seizure), I was told: \"Say *bika* (by you).\" I said, \"It is not in the Quran, nor was it revealed thus.\" I was told: \"Do not say it that way; rather, this is how it is, and this is how it was revealed. Say *bika*.\" And it was emphasized to me. So I recited: \"Indeed, His seizure *by you* is painful and severe.\" I sought the meaning of that, and a person whom I knew, who had slandered me, was presented to me. I was told: \"This one is seized *bika* (by you), meaning because of you. Recite: 'Indeed, His seizure *by you* is painful and severe,' and he was stretched out before me.\" When that revelation (tanzil) was completed, I summoned the person and told him what I had seen. He sighed and feigned repentance, then left me while still maintaining his slander. Before the month was complete, Allah killed him with a stone that crushed his head. The killer took nothing from his clothes, his horse, or his wealth. The news spread and reached the Sultan, and they reported to the Sultan that I was the cause of his death. The Sultan paid no attention. Three years later, the killer came and confessed the murder before the Sultan. He asked him the reason, and the killer said: \"There was no reason, and he had done nothing bad to me, except that I passed by him while he was sleeping in a ruin, holding the reins of his horse, and the killing was made appealing to me. I took a large stone, lifted it, aimed at his head, and threw the stone upon him. He did not move, and I took nothing from him, nor did I desire anything of it, nor did I care.\" The Sultan executed him for it and sent me the news of that. This is one of the most wondrous revelations (tanazzulat)—the existence of such an addition. The Gnostic (‘Arif) knows from this station (manzil) whence it originated, what its name is, and what its rank is among the Speech of The Real (كلام الحق).\n\nFor the Prophetic reports (الأخبار النبوية) narrated from Allah are not called Quran, even though they are all the Speech of Allah.\n\nThis station (manzil) includes the science of the beginning of Creation (بدء الخلق) and its return (إعادته), and the modality (kayfiyya) of its return. The People of Unveiling (أهل الكشف) have differed concerning the modality: Ibn Qasi adopted a modality unique to him, while others adopted different modalities, with variations among them. Likewise, the scholars of speculative thought (علماء النظر الفكري) have differed concerning it. [It includes] the science of Divine Love (المحبة الإلهية) and its permanence, and the science of the veils (الستور) between the beloveds, and what leads to their punishment if it were to occur from others, as it was said:\n\n> And when the Beloved commits a single sin,\n> His beauty comes with every intercessor.\n\n[It includes] the science of the Thrones (العرش), their number and their attributes, and the science of the Will (الإرادة) attributed to Him, and its effect on the state of the Gnostics (‘Arifin), and whether it is among the descriptions of Majesty (نعوت الجلال) or the descriptions of Beauty (نعوت الجمال). [It includes] the science of Contemplation (الاعتبار). [It includes] the science of the Threat (الوعيد): from which Name it originates. [It includes] the science of the Universal Soul (النفس الكلية) and why change does not affect it, and the nobility (sharaf) of the Quran over other Books, Scrolls, and reports narrated from Allah, even though all of that is the Speech of Allah. Connected with this science, within the Quran itself, is the nobility of the Verse of the Throne (آية الكرسي) over the rest of the verses of the Quran by virtue of its sovereignty (al-siyada), and *Ya Sin* by virtue of its heart-like quality (al-qalbiyya), and *Idha Zulzilat* (The Earthquake) by its standing in the place of half the Quran, and *Surat al-Kafirun* (The Disbelievers) in the place of a quarter of the Quran, and likewise *Idha Ja’a Nasr Allah* (When the Help of Allah Comes), and *Surat al-Ikhlas* (Sincerity) in the place of a third of the Quran, and *Ya Sin* in the place of the Quran ten times. Why is this referred back to, and who is described by this merit: is it the proof (al-dalil), the proven (al-madlul), or the one who contemplates the proof? This much suffices concerning this station. And Allah <<يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).\n\n(End of the Second Volume of *Al-Futuhat al-Makkiyya*, by the praise of Allah, His aid, and His good success. The Third Volume follows, beginning with Chapter Three Hundred.)\n\n### [Volume Three]\n\nVolume Three of *Al-Futuhat al-Makkiyya* (The Meccan Revelations), which Allah bestowed upon the Shaykh, the Imam, the Practicing Scholar, the Deeply Rooted, the Perfect, the Seal of the Inheriting Saints (خاتم الأولياء الوارثين), the Isthmus of Isthmuses (برزخ البرازخ), Muhyi al-Haqq wa al-Din Abu ‘Abdullah Muhammad ibn ‘Ali, known as Ibn Arabi al-Hatimi al-Ta’i—may Allah sanctify his soul and illuminate his resting place, Amen. Printed based on the copy collated against the author’s own copy found in the city of Konya. This important task was undertaken by a group of scholars by order of the late Amir ‘Abd al-Qadir al-Jaza’irli—may Allah have mercy on all of them and grant them an elevated station. Printed at the Great Arab Books Press in Egypt at the expense of Al-Hajj Fida Muhammad al-Kashmiri and his partners.\n\nIn the Name of Allah, the Most Compassionate, the Most Merciful.",
    "ur": "## باب نمبر دو سو ننانوے: مرادیہ محمدیہ حضرہ میں سریانی مقام سے مومنوں کے عذاب کے منزل کی معرفت میں\n\n> بے شک برج منازل کے لیے منازل ہیں\n> جو سات انوار کے لیے تیار کیے گئے ہیں\n\n> پس جب وہ اپنے افلاک میں عدل کے ساتھ چلتے ہیں\n> تو تیری آنکھ کے لیے اغیار کی آنکھیں ظاہر ہوتی ہیں\n\n> پس حق (الحق) منازل میں اپنا حکم جاری کرتا ہے\n> اور کون (الکون) اکوار (ادوار) اور ادوار میں ہے\n\n> اور خلق منازل کے نیچے سے ظاہر ہے\n> اور امر منازل کے اوپر سے جاری ہے\n\n> پس کیان (الکیان) کی زبان میں کہا جاتا ہے کہ وہ\n> ایک امر ہے جسے تقدیر کے ہاتھ تصرف کرتے ہیں\n\n> اور ہتھیلی اور قلم علوی (القلم العلي) لوح میں\n> ان اسرار کو نقش کرتے ہیں جو ظاہر ہوتے ہیں\n\nجان لو، اللہ ہمیں اور تمہیں توفیق دے، کہ یہ منزل ان عظیم منازل میں سے ہے جس سے ناری شیاطین اس کے ان پر قوی تسلط کی وجہ سے خوف کھاتے ہیں۔ یہ ایک بلند منزل ہے جو بہت سے علوم پر مشتمل ہے۔\n\n### [بے شک اللہ نے روح انسانی کو فطرت پر پیدا کیا]\n\nجان لو کہ جب اللہ نے روح انسانی کو پیدا کیا تو اسے کامل، بالغ، عاقل، عارف، اللہ کی توحید پر ایمان لانے والا اور اس کی ربوبیت کا اقرار کرنے والا پیدا کیا، اور یہی وہ فطرت (الفطرة) ہے جس پر اللہ نے لوگوں کو پیدا کیا۔\n\nرسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"ہر بچہ فطرت (الفطرة) پر پیدا ہوتا ہے، اور اس کے والدین اسے یہودی، یا نصرانی، یا مجوسی بنا دیتے ہیں۔\"\n\nپس آپ نے غالب چیز کا ذکر کیا، جو والدین کا وجود ہے، کیونکہ ہو سکتا ہے کہ وہ یتیم ہو، تو جو اس کی پرورش کرتا ہے وہ اس کے لیے اس کے والدین کے مقام پر ہوتا ہے۔ روح کے لیے کوئی کمیت نہیں ہے کہ وہ اپنے جوہر ذات میں زیادتی قبول کرے، بلکہ وہ ایک فرد جوہر ہے، اور اس کا مرکب ہونا جائز نہیں، کیونکہ اگر ایسا ہوتا تو ممکن تھا کہ اس کے ایک جزو میں کسی امر کا علم ہو اور دوسرے جزو میں اسی امر کی جہالت ہو، تو انسان اس چیز کا عالم ہو جس سے وہ جاہل ہے، اور یہ محال ہے۔ پس اس کے جوہر میں ترکیب محال ہے۔ جب ایسا ہے تو وہ زیادتی یا کمی قبول نہیں کرتا، جیسا کہ جسم قبول کرتا ہے، کیونکہ اس میں ترکیب نہیں ہے۔ اور اگر وہ بذات خود عاقل نہ ہوتا، اور اپنے لیے عقل نہ ہوتا، تو میثاق لیتے وقت اپنے خالق کی ربوبیت کا اقرار نہ کرتا، کیونکہ حق (الحق) صرف اسی سے مخاطب ہوتا ہے جو اس کے خطاب کو سمجھتا ہے۔ یہ ہے انسان کی حقیقت (حقيقة) اس کی اپنی ذات میں۔\n\nپھر اللہ تعالیٰ نے اس جسم میں، جسے اللہ نے اس کے لیے بنایا اور اس پر مستوی ہوا، اس میں حسی اور معنوی قوتیں اور آلات پیدا کیے، اور اس سے کہا گیا کہ ان سے علوم حاصل کرو اور انہیں فلاں فلاں حد پر تصرف کرو۔ اور یہ آلات اس کے لیے مراتب پر بنائے گئے۔ پس تمام معنوی قوتیں کامل قوتیں ہیں، سوائے قوتِ خیال کے، کیونکہ وہ کمزور پیدا کی گئی ہے، اور قوتِ حاسہ (حساسہ) بھی۔ اور یہ دونوں قوتیں جسم کے تابع بنائی گئیں، پس جب بھی جسم بڑھتا اور بڑا ہوتا اور اس کی کمیت بڑھتی، تو اس کا حس اور خیال قوی ہوتا، کیونکہ تمام قوتیں اشیاء کو صرف خیال سے ہی لیتی ہیں، اور یہ ایک ہیولانی قوت ہے جو حس سے ملنے والی تمام صورتوں کو قبول کرنے والی ہے، اور ان صورتوں کو بھی قبول کرنے والی ہے جو قوتِ مصورہ اس میں کھولتی ہے، جنہیں وہ موجود امور سے ترکیب دیتی ہے جنہیں خیال نے قوتِ حاسہ سے پکڑا ہے۔ اور قوتوں میں سے کوئی بھی ہیولیٰ (ہیولانی) کی طرح صورتوں کو قبول کرنے میں خیال سے مشابہ نہیں ہے۔ پس جب خیال قوی ہوتا ہے، تب فکر کو تصرف کرنے اور اپنا تسلط ظاہر کرنے کی جگہ ملتی ہے، اور وہم بھی اسی طرح، اور عقل بھی اسی طرح، اور قوتِ حافظہ بھی اسی طرح۔\n\nپس انسان کی لطیفہ اپنی ذات کے اعتبار سے ان قوتوں کے ذریعے دی جانے والی چیزوں کو ان کے واسطے کے بغیر ادراک کرنے والی نہیں تھی۔ پس اگر یہ قوتیں معلومات کو بچے کے عالمِ حس میں ظاہر ہونے کے فوراً بعد دے دیتیں، تو روح انسانی اسے ذاتی قبولیت کے ساتھ قبول کر لیتی۔ کیا تم نہیں دیکھتے کہ اللہ نے بعض لوگوں میں اس معاملے میں عادت کو توڑا ہے؟ اور وہ وہی ہے جو یوسف کے بچے کے بارے میں ذکر کیا گیا جب اس نے اس کی براءت کی گواہی دی، اور عیسیٰ علیہ السلام کا کلام جب انہوں نے براءت کی گواہی دی، اور جریج کے بچے کا کلام جب اس نے اس کے حق میں گواہی دی۔\n\nیہ روح انسانی سے تکلیف کو بلوغت تک مؤخر کرنے کا سبب ہے، جو اللہ کے علم میں ان قوتوں کی کمال کی حد ہے۔ پس اس وقت روح انسانی کے لیے اپنے رب کی طرف سے عائد کردہ نظر اور عمل سے پیچھے ہٹنے کا کوئی عذر باقی نہیں رہتا۔ اور تکلیف کی پہلی درجہ بندی جب وہ سات سال کا ہوتا ہے، یہاں تک کہ وہ بلوغت کو پہنچ جائے۔ اور اللہ نے بچے کے فعل کو اس کے تکلیف کے زمانے کے علاوہ بھی معتبر قرار دیا ہے، اگر وہ قتل کر دے تو اس پر حد قائم نہیں کی جائے گی، اور اسے بلوغت تک قید رکھا جائے گا اور پھر اسے اس کے قتل کے بدلے قتل کیا جائے گا جو اس نے بچپن میں کیا تھا، مگر یہ کہ ولیِ دم معاف کر دے۔ پس اللہ نے اس کا مواخذہ اس چیز پر کیا جو اس نے اپنے تکلیف کے زمانے میں نہیں کیا تھا۔\n\nاور اس تمہید کا مقصد یہ ہے کہ مومن کے عذاب کے بارے میں جو کچھ ہم بیان کریں گے اس سے انس پیدا ہو جائے، کیونکہ انسان جیسا کہ ہم نے کہا، مومن پیدا کیا گیا ہے، اگرچہ ہم انہیں ان کے والدین کے ساتھ ان کی قبروں میں دفن کرنے میں ان کے ساتھ ملحق کرتے ہیں، اور اگر ہم انہیں غلام بنا لیں تو الحاق کے طریقے پر، نہ کہ استحقاق کے طریقے پر، یہ والدین میں موجود ایمان کے ظہور کے بلند مرتبے کی تعظیم اور وضاحت کے لیے ہے۔ اور جس طرح کفر ایک عارضی چیز ہے، اسی طرح غلامی بھی ایک عارضی چیز ہے، اور اصل آزادی اور ایمان ہے۔\n\nپس وعید کو نافذ کرنے میں سے، جہاں سے اسے تکلیف کا وجود محسوس نہیں ہوتا، وہ پہلا عذاب ہے، کیونکہ مکلف کی جان میں خوف پیدا ہو جاتا ہے۔ پس اسے ایک تکلیف دہ نفسیاتی عذاب دیا گیا، اور یہ ان افعال کی سزا ہے جو اس سے اس زمانے میں سرزد ہوئے جب وہ مکلف نہیں تھا، جیسے بچوں کے درمیان ہونے والے ایذا رسانی، گالی گلوچ، اور زیادتی کے طور پر مار پیٹ۔ اور ہر وہ نیکی جو بچہ کرتا ہے، اس کے لیے لکھی جاتی ہے۔ اور شارع نے اس کا فیصلہ کیا جب:\n\nایک عورت نے رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک چھوٹا بچہ اٹھایا ہوا تھا اور وہ حج میں تھے، تو اس نے آپ سے کہا: \"یا رسول اللہ، کیا اس کے لیے حج ہے؟\" تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: \"ہاں، اس کے لیے حج ہے اور تمہارے لیے اجر ہے۔\"\n\nاور یہ اس لیے کہ اسے اس مدد کا اجر ہے جس پر بچہ قادر نہیں ہے۔ اور رسول اللہ صلی اللہ علیہ وسلم سے مروی ہے کہ جب بچہ تکلیف کی بلوغت سے پہلے حج کرے، پھر بلوغت سے پہلے مر جائے، تو اللہ اس حج کو اس کے فرض کے طور پر لکھ دیتا ہے۔ اور اسی طرح غلام جب غلامی کی حالت میں حج کرے، پھر آزاد ہونے سے پہلے مر جائے۔\n\nاور اگرچہ اس حدیث کے اسناد کے بارے میں کلام کیا گیا ہے، لیکن صحیح حدیث اس کی تائید کرتی ہے۔ اور صحیح میں وارد ہے کہ اللہ قیامت کے دن بندے کے حق میں فرمائے گا جو اس نے فرض کیا ہے وہ ناقص لاتا ہے، اس میں سے کچھ کمی کی ہے، کہ اس کی کمی کو اس کے نفل سے پورا کیا جائے۔\n\nپس اس نے نفل کو فرض کے مقام پر قائم کیا، اور یہ بعینہ یہی ہے، کیونکہ غیر مکلف کا حج اس پر فرض نہیں ہے۔\n\nآپ صلی اللہ علیہ وسلم نے اللہ تعالیٰ سے صحیح حدیث میں فرمایا: \"بے شک سب سے پہلے جس عمل میں اللہ نظر فرمائے گا وہ بندے کی نماز ہے، تو اللہ فرمائے گا: میرے بندے کی نماز میں دیکھو، کیا اس نے اسے پورا کیا یا اس میں کمی کی؟ پس اگر وہ پوری ہو گی تو اس کے لیے پوری لکھی جائے گی، اور اگر اس میں کچھ کمی کی ہو گی تو فرمائے گا: دیکھو کیا میرے بندے کے پاس کوئی نفل ہے؟ پس اگر اس کے پاس نفل ہو گا تو فرمائے گا: میرے بندے کے فرض کو اس کے نفل سے پورا کر دو۔\" آپ صلی اللہ علیہ وسلم نے فرمایا: \"پھر اعمال اسی طرح لیے جائیں گے۔\"\n\nیعنی زکوٰۃ، روزہ اور حج میں بھی وہی کیا جائے گا جو نماز میں کیا گیا، بالکل اسی طرح۔ پس اگر شرع اس کو معتبر نہ سمجھتی تو یہ حکم نہ دیتی۔ اور ہر وہ کام جو بچہ تکلیف کے زمانے کی بلوغت سے پہلے کرتا ہے، شرع میں خیر اور شر دونوں میں معتبر ہے۔ البتہ کرمِ الٰہی نے اس زمانے میں کیے گئے خیر کا بدلہ اسے آخرت میں دیا ہے اور اس کے لیے اسے ذخیرہ کر رکھا ہے، لیکن شر میں سے اس کے لیے آخرت میں کچھ بھی ذخیرہ نہیں کیا، بلکہ اسے دنیا میں حسی اور نفسیاتی تکالیف سے بدلہ دیا ہے جو بچوں پر آتی ہیں، اور یہ موجود ہیں جن کا کوئی انکار نہیں کر سکتا، اور یہ ان امور کی سزائیں اور عذاب ہیں جو بچوں سے سرزد ہوتے ہیں۔ ہمارے طریق کے لوگ اس قدر کو جانتے ہیں، یہ ایک حکمت ہے جس پر حق (الحق) نے انہیں مطلع کیا ہے۔ اور یہ مومنوں کے حق میں جیسا کہ ہم نے کہا، ایک عذاب ہے جو ان کے لیے کفارہ کا موجب بنتا ہے۔ اور کفار کے حق میں، جب وہ بالغ ہوئے اور کفر کی حالت میں مرے، اور انہیں آخرت میں سزا دی گئی، حالانکہ انہیں بچپن میں بھی عذاب دیا گیا تھا جیسا کہ مومنوں کو ان کے بچپن میں عذاب دیا جاتا ہے، تو یہ اللہ تعالیٰ کا فرمان ہے: **\"ہم ان کے لیے عذاب پر عذاب بڑھا دیں گے\" (زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ)** یعنی وہ عذاب جو انہیں دنیا میں دیا گیا تھا، اور اس سے ملتی جلتی چیزیں۔ کیونکہ یہ عذاب کے تضاعف (بڑھنے) میں نص ہے اس کے مراتب پر، جو ان میں سے ایک ہے۔\n\nاور مومنوں کے عذاب میں سے وہ ہے جو اللہ نے ان پر اہل خواہشات اور کفار کو مسلط کیا، جیسے دنیا میں قید، عذاب، غلامی، اور قتل۔ یہ سب نفسیاتی اور حسی لغزشوں اور پھسلنوں کا کفارہ ہے، ان کی طرف سے سرزد ہونے والے اعمال کے مطابق۔ اور یہ کفار کی طرف سے مومنوں کے ساتھ صرف ان کے ایمان کی وجہ سے ہوتا ہے۔ اللہ تعالیٰ فرماتا ہے: **\"وہ رسول کو اور تمہیں نکالتے ہیں اس لیے کہ تم ایمان لائے ہو\" (يُخْرِجُونَ الرَّسُولَ وإِيَّاكُمْ أَنْ تُؤْمِنُوا)**۔ پس **\"أَنْ تُؤْمِنُوا\"** اور اس کے بعد کا حصہ مصدر کی تاویل میں ہے، گویا وہ کہہ رہا ہے کہ وہ رسول کو اور تمہیں تمہارے ایمان کی وجہ سے نکالتے ہیں۔ اور اللہ تعالیٰ نے فرمایا: **\"اور انہوں نے ان سے انتقام نہیں لیا مگر اس لیے کہ وہ ایمان لائے\" (وما نَقَمُوا مِنْهُمْ إِلَّا أَنْ يُؤْمِنُوا)**۔ اور اسی پر اس شخص کی ہمیشہ کی سزا کا حکم نکلتا ہے جس نے کسی مومن کو جان بوجھ کر قتل کیا، یعنی اس نے اسے اس کے ایمان کی وجہ سے قتل کرنے کا ارادہ کیا۔\n\nاور اس منزل میں علمِ ابتلاء (آزمائش) بھی شامل ہے، اور یہ صرف اللہ کے لیے ہے۔ اللہ تعالیٰ فرماتا ہے: **\"اور ہم تمہیں ضرور آزمائیں گے\" (ولَنَبْلُوَنَّكُمْ)**۔ اور عزوجل نے یہ بھی فرمایا: **\"تاکہ وہ تمہیں آزمائے\" (لِيَبْلُوَكُمْ)**۔ اور مومن کے لیے جائز نہیں کہ وہ مومن کو آزمائے مگر کسی الٰہی حکم سے، تو ابتلاء اللہ تعالیٰ کی طرف سے ہوتا ہے، نہ کہ ان کی طرف سے، جیسے اللہ تعالیٰ کا فرمان: **\"پس تم انہیں آزماؤ\" (فَامْتَحِنُوهُنَّ)**۔ پس اللہ نے اس کا حکم دیا، تو بندے نے اپنے آقا کے حکم کی تعمیل کی، جیسے بادشاہ کسی شخص کو عذاب دینے کا حکم دیتا ہے، تو جسے عذاب دینے کا حکم دیا گیا ہے وہ اسے عذاب دیتا ہے، اگرچہ وہ اس پر شفیق ہو، لیکن بادشاہ کے حکم کی تعمیل مرتبے کے لحاظ سے واجب ہے، کیونکہ یہ ہیبت کا تقاضا ہے۔\n\nپس ابتلاء صرف اللہ کے لیے ہوتا ہے۔ اور جو بھی کسی مومن کو بغیر الٰہی حکم کے آزماتا ہے، تو اللہ اس پر اس کا مواخذہ کرتا ہے۔ اور اسی مقام کے ساتھ اسم الخبیر (بڑی خبر رکھنے والا) منفرد ہوا، اور یہ اسماء کے احکام میں سے سب سے عجیب ہے، کیونکہ خبرہ (خبر رکھنا) تو مخبر (آزمائے جانے والے) کے علم کے استفادے کے لیے آتی ہے، اور یہاں جنابِ الٰہی میں، اس مختبر (اسم مفعول) سے جو کچھ ہو گا اس کا علم محقق ہے۔ پس مختبر (اسم فاعل) علم کا استفادہ نہیں کرتا، تو ظاہر ہوتا ہے کہ اس اسم کا کوئی حکم نہیں، اور اس کا زیادہ حقدار بندہ تھا، کیونکہ وہ مختبر (اسم مفعول) سے ہونے والی چیز سے جاہل ہے۔ اور بندے کو اختیار سے منع کیا گیا ہے مگر الٰہی حکم سے۔ پس اللہ تعالیٰ کو اس چیز سے موسوم کیا جا سکتا ہے جس کا حقدار بندہ ہے۔ پس حق (الحق) کے جناب میں اس کا حکم یہ ہے کہ وہ اس آزمائش کے ذریعے مختبر کو اس کی اپنی ذات میں علم کا فائدہ پہنچائے، تاکہ اس پر اور اس کے لیے حجت قائم ہو۔ اسی لیے الخبیر کو صفتِ علم کے ساتھ نہیں ملایا جاتا، جیسا کہ ابو حامد اور اسفرائینی اور اکثر لوگوں نے ملایا ہے۔ اور اگر ایسا ہوتا جیسا کہ انہوں نے گمان کیا، تو یہ نقص ہوتا۔\n\nاور انہیں اس میں ڈالنے والی چیز اللہ تعالیٰ کا فرمان ہے: **\"یہاں تک کہ ہم جان لیں\" (حَتَّى نَعْلَمَ)**، اور یہ ان کے خلاف حجت ہے اگر معاملہ اس کے ظاہر پر ہوتا، کیونکہ اختبار (آزمائش) علم کے حصول کا سبب ہے، نہ کہ خود علم۔ اور خبرہ کی وجہ سے اسے خبیر کہا گیا، پس جب علم حاصل ہو جاتا ہے تو اس حال میں اسے عالم کہا جاتا ہے۔ اور ابن الخطیب وغیرہ جیسے تنزیہ کرنے والوں کی انتہا، اللہ کے قول **\"حَتَّى نَعْلَمَ\"** میں، یہ ہے کہ علم کا تعلق اس حالت سے ہے، اور علم کا تعلق حادث ہے، اور یہ علم کے حدوث کا باعث نہیں بنتا۔ پس علم اپنی حالت پر باقی رہا، یعنی قدیم ہونے کی صفت پر، اگرچہ تعلق حادث ہوا۔ پس یہ تنزیہ میں ان کی آخری حد ہے۔ اور وہ کہتے ہیں کہ اگر علم کا تعلق اس چیز سے ہو جس کی شان یہ ہے کہ وہ ہو گی، یا ہو چکی ہے، تو اس نے چیز کو اس کے خلاف جانا جیسا کہ وہ ہے۔ اور اسی طرح اگر وہ اس چیز کو جانتا جو موجود ہے کہ وہ ہو چکی ہے یا ہو گی، یا اس چیز کو جانتا جو ہو چکی ہے کہ وہ موجود ہے یا ہو گی، تو یہ سب جہالت ہوتی، اور اللہ اس سے بلند ہے۔ پس انہوں نے اللہ پر زمان کو داخل کر دیا جہاں سے انہیں شعور بھی نہیں ہوا، اور اشیاء میں تقدم اور تاخر کو۔ اور انہیں یہ معلوم نہیں کہ اللہ تعالیٰ اشیاء کو دیکھتا ہے اور انہیں جانتا ہے جیسا کہ وہ اپنی ذات میں ہیں، اور ان کے لیے جو ازمنہ ہیں وہ اس کے معلومات میں سے ہیں جو ان کے لیے لازم ہیں، اور ان کے احوال اور ان کے مقامات اگر ان کے لیے ہوں، اور ان کے محال اگر وہ محال کے طالبوں میں سے ہوں، اور ان کے احیاز (جگہیں)، یہ سب حق (الحق) کے لیے غیرِ زمان میں مشہود ہیں، جو نہ تقدم سے متصف ہے اور نہ تاخر سے، اور نہ ہی آن (اب) سے، جو دو زمانوں کی حد ہے۔ اسی لیے یہ اس کے ساتھ وارد نہیں ہوا:\n\nرسول اللہ صلی اللہ علیہ وسلم نے اپنے رب سے فرمایا: **\"اللہ تھا اور اس کے ساتھ کوئی چیز نہیں تھی\" (كان الله ولا شي‏ء معه)**۔\n\nاور \"کان\" (تھا) لایا گیا، اور یہ ایک وجودی حرف ہے، نہ کہ فعل، اور یہ نہیں کہا گیا کہ \"وہ اب ہے\" (وهو الآن)، کیونکہ \"الآن\" (اب) زمان کے وجود میں نص ہے۔ پس اگر اسے باری تعالیٰ کی ہویت کے لیے ظرف بنا دیا جاتا تو وہ زمان کی ظرفیت کے تحت داخل ہو جاتا، بخلاف \"کان\" کے، کیونکہ \"کان\" کون (وجود) سے ہے، اور وہ عینِ وجود ہے۔ تو گویا وہ کہہ رہا ہے کہ اللہ موجود ہے اور اس کے وجود میں اس کے ساتھ کوئی چیز نہیں ہے۔ پس یہ ان الفاظ میں سے نہیں ہے جن کے ساتھ زمان کھینچ کر آتا ہے، مگر وہم کے حکم سے۔ اسی لیے نحویوں کے طریقے پر اس کے اعراب میں یہ نہیں کہنا چاہیے کہ \"کان\" فعلِ ماضی ہے۔ اور زجاجی نے اس پر ایک باب باندھا اور اسے وہ حرف کہا جو اسم کو رفع دیتا ہے اور خبر کو نصب دیتا ہے، اور اسے فعل نہیں بنایا، تاکہ اس کے ساتھ زمانِ ماضی، حال اور مستقبل نہ کھینچ کر آئے۔ اور اسی موہوم مقدار کی وجہ سے جو اس صیغے میں تخیل کی جاتی ہے، جو \"کان\"، \"یکون\" (ہو گا) اور \"سیکون\" (ہو گا) ہے، یہ صحیح فعل سے مشابہ ہو گیا، جو \"قام\" (کھڑا ہوا)، \"یقوم\" (کھڑا ہوتا ہے) اور \"سیقوم\" (کھڑا ہو گا) ہے۔ اور انہوں نے \"قائم\" کو \"کائن\" (ہونے والا) کی طرح بنا دیا، پس انہوں نے اسے اس پہلو سے افعال کے درجے میں رکھا۔ اور جب اس کا معاملہ ایسا ہے، تو اسے اس پہلو سے اللہ تعالیٰ پر اطلاق کیا جاتا ہے جو زمان کی ظرفیت کو قبول نہیں کرتا، اور وہ اس کا فرمان ہے: **\"اور اللہ ہمیشہ سے بخشنے والا، رحم کرنے والا ہے\" (وكانَ الله غَفُوراً رَحِيماً)**، اور **\"اور اللہ ہمیشہ سے قدردان، جاننے والا ہے\" (وكانَ الله شاكِراً عَلِيماً)**۔ اور اس پر \"الآن\" (اب) کا اطلاق نہیں کیا گیا، جیسا کہ ہم نے ذکر کیا، کیونکہ یہ زمان میں نص ہے، اس کا اسمِ علم ہے، اور اس کا معنی ظرف ہے۔ جیسا کہ عرش پر استواء عرش کے لفظ اور استواء کے لفظ کے ساتھ آیا، اور وہ مکان کی ظرفیت میں نص نہیں ہے، بخلاف لفظِ مکان کے اسم کے، کیونکہ وہ وضع کے لحاظ سے اپنی ظرفیت میں نص ہے، اور مکان میں متمکن اس میں نص ہے۔ پس استواء اور عرش کی طرف عدول کیا گیا تاکہ اس تاویل کی گنجائش نکلے جو جنابِ عالی کے لائق ہو، اس شخص کے لیے جو تاویل کرتا ہے، اور یہ ضروری ہے۔ اور بہتر یہ ہے کہ اللہ نے جو کچھ کہا ہے اس میں اس کے لیے تسلیم کیا جائے، اور اس کو اس کے علم کے سپرد کیا جائے، سبحانہ، کہ اس نے اس خطاب میں کیا ارادہ کیا، اور اس سے سمجھی جانے والی تشبیہ کی نفی کی جائے اس کے قول سے: **\"اس کی مثال کوئی چیز نہیں\" (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)**، کاف کی زیادتی کے ساتھ، یا مثل کے فرض کے ساتھ، کیونکہ محال کا فرض کرنا محال نہیں ہے۔\n\nاور اس منزل میں علمِ عالمِ علوی بھی شامل ہے، جو خاص طور پر فلکِ اطلس سے متعلق ہے، اور اس کی آبادی، اور ان کی تسبیح، اور اس سے متعلق کہ وہ کس سے لیتے ہیں اور کس کو دیتے ہیں، اور کس سے وصول کرتے ہیں۔ اور عطائے ذاتی، جو علت کا عطاء ہے، اور عطائے ارادی، جو اختیار کا عطاء ہے۔ اور آخرت کی معرفت، اور وہ معرفت جو بندے کی جان میں تجلی (التجلی) سے حاصل ہوتی ہے، اور ضعیف کا قوی میں اثر، اور وہ ربانی اغراض اور خواہشات جو عالم میں جاری ہیں، جن کا دعویٰ ہر حیوان، انسان اور غیر انسان کرتا ہے۔ اور اس صلاح (نیکی) کی معرفت جو انبیاء اللہ سے مانگتے ہیں، اور خاص طور پر انسانی تصدیق، اور کس کی تصدیق کی جاتی ہے، اور کس چیز سے تصدیق کی جاتی ہے، اور کس چیز کو رد کیا جاتا ہے، اور کیا اس پر اس چیز کی تصدیق لازم ہے جسے دلیلِ عقل محال قرار دیتی ہے؟ اور اللہ کے نزدیک اس کا کیا مقام ہے؟ اور یہ اپنے صاحب کو کہاں تک پہنچاتی ہے؟ اور کیا مومن اس میں برابر ہیں یا ان میں تفاضل ہے؟ اور کیا یہ زیادتی اور کمی قبول کرتا ہے؟ یا کیا یہ کسی وقت کم ہو جاتا ہے جب اس چیز پر شبہہ پیدا ہو جائے جس کی تصدیق کی گئی تھی؟ اور کیا اگر ایمان کے کسی مسئلے میں کمی واقع ہو جائے تو کیا وہ کمی پورے ایمان میں سرایت کر جاتی ہے، یا اس کے زوال پر کلی طور پر اثر انداز ہوتی ہے، یا وہ صرف اسی چیز تک محدود رہتی ہے جس پر شبہہ واقع ہوا تھا؟\n\nاور الٰہی گرفت کی تیزی کی معرفت، اس کا سبب کیا ہے؟ کیونکہ جب اللہ تعالیٰ نے مجھے اس آیت کے نزول پر مطلع کیا، اس نزول کے ساتھ جو ہم جیسے لوگوں پر آتا ہے جو نبی نہیں ہیں، کیونکہ قرآن اور ہر کلام تلاوت کرنے والوں اور کلام کرنے والوں پر ان کی تلاوت اور کلام کی حالت میں نازل ہوتا ہے، اور اگر ایسا نہ ہوتا تو وہ تلاوت نہ کرتے اور نہ کلام کرتے۔ اور یہاں الٰہی لطائف ہیں اس شخص کے لیے جو غور کرے۔ پس مجھ سے کہا گیا: \"پڑھو۔\" میں نے کہا: \"میں کیا پڑھوں؟\" تو مجھ سے کہا گیا: \"پڑھو: **\"اور اسی طرح ہے تیرے رب کی گرفت جب وہ بستیوں کو پکڑتا ہے جبکہ وہ ظالم ہوں، بے شک اس کی گرفت دردناک، سخت ہے\" (وكَذلِكَ أَخْذُ رَبِّكَ إِذا أَخَذَ الْقُرى‏ وهِيَ ظالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ)**۔\" پس میں نے یہ آیت اس طرح پڑھی جس طرح مجھے یاد تھی۔ پس جب میں اللہ تعالیٰ کے قول **\"إِنَّ أَخْذَهُ\"** پر پہنچا، تو مجھ سے کہا گیا: \"کہو: **بِکَ** (تیرے سبب سے)۔\" تو میں نے کہا: \"یہ قرآن میں نہیں ہے اور نہ ہی اس طرح نازل ہوا ہے۔\" تو مجھ سے کہا گیا: \"ایسے نہ کہو، بلکہ یہ ایسے ہی ہے اور اسی طرح نازل ہوا ہے، کہو: **بِکَ**۔\" اور مجھ پر سختی کی گئی، تو میں نے پڑھا: **\"بے شک اس کی گرفت تیرے سبب سے دردناک، سخت ہے\" (إِنَّ أَخْذَهُ بِکَ أَلِيمٌ شَدِيدٌ)**۔ پس میں نے اس کا معنی تلاش کیا، تو میرے سامنے ایک شخص کھڑا کیا گیا جسے میں جانتا تھا اور اس نے مجھ پر بہتان لگایا تھا۔ پس مجھ سے کہا گیا: \"یہ تیرے سبب سے پکڑا گیا ہے، یعنی تیری وجہ سے۔ پس پڑھ: **إِنَّ أَخْذَهُ بِکَ أَلِيمٌ شَدِيدٌ**۔\" اور وہ میرے سامنے دراز تھا۔\n\nجب وہ نزول ختم ہوا، تو میں نے اس شخص کو بلایا اور اس سے کہا کہ میں نے کیا دیکھا ہے۔ تو اس نے مجھ پر ناراضگی کا اظہار کیا اور توبہ ظاہر کی، اور مجھ سے چلا گیا، اور وہ اپنی بہتان کی حالت پر تھا۔ پس مہینہ بھی پورا نہیں ہوا تھا کہ اللہ نے اسے ایک پتھر سے قتل کر دیا جس نے اس کا سر کچل دیا۔ اور قاتل نے اس کے کپڑوں، نہ اس کے گھوڑے، اور نہ اس کے مال میں سے کچھ لیا۔ پس خبر پھیل گئی اور سلطان تک پہنچی، اور انہوں نے سلطان کے سامنے یہ فیصلہ کیا کہ میں اس کے قتل کا سبب تھا۔ پس سلطان نے کوئی توجہ نہیں دی۔ پھر جب تین سال گزر گئے، تو قاتل آیا اور سلطان کے سامنے اپنے قتل کا اعتراف کیا۔ تو سلطان نے اس سے پوچھا کہ اس کا سبب کیا تھا؟ تو اس نے کہا: \"اس کا کوئی سبب نہیں تھا اور نہ ہی اس نے میرے ساتھ کوئی برا کام کیا، مگر یہ کہ میں اس کے پاس سے گزرا جب وہ ایک ویرانے میں سو رہا تھا اور اس کے گھوڑے کی لگام اس کے ہاتھ میں تھی، تو مجھے اسے قتل کرنے کا خیال آیا۔ پس میں نے ایک بڑا پتھر لیا اور اسے اکھاڑا اور اس کے سر کے برابر کیا اور پتھر اس پر پھینک دیا، تو وہ حرکت بھی نہیں کیا، اور میں نے اس کی کوئی چیز نہیں لی، اور نہ ہی مجھے اس میں سے کسی چیز کی لالچ تھی، اور نہ ہی میں نے پرواہ کی۔\" پس سلطان نے اسے اس کے بدلے قتل کر دیا اور مجھے اس کی خبر بھیجی۔\n\nاور یہ عجیب ترین تنزلات میں سے ہے کہ اس طرح کی زیادتی کا وجود ہو۔ پس عارف اس منزل سے جانتا ہے کہ یہ کہاں سے صادر ہوئی، اور اس کا نام کیا ہے، اور کلامِ حق (الحق) میں اس کا کیا مقام ہے۔ کیونکہ اللہ سے مروی نبوی خبروں کو قرآن نہیں کہا جاتا، حالانکہ وہ سب اللہ کا کلام ہیں۔\n\nاور اس منزل میں علمِ بدءِ خلق (تخلیق کی ابتدا) اور اس کی اعادہ (دوبارہ لانا) اور اس کی اعادہ کی کیفیت شامل ہے۔ کیونکہ اہل کشف (الکشف) کیفیت میں مختلف ہوئے ہیں۔ پس ابن قسی ایک ایسی کیفیت کی طرف گئے جس میں وہ منفرد ہوئے، اور دوسرے لوگ اس کے علاوہ کی طرف گئے، ان کے درمیان اختلاف کے ساتھ۔ اور اسی طرح فکری نظر کے علماء بھی اس میں مختلف ہوئے۔\n\nاور اس میں محبتِ الٰہیہ کا علم اور اس کا ثبوت، اور وہ پردے (الستور) جو محبوبوں کے درمیان ہیں، اور وہ چیز جو اگر ان کے علاوہ کسی اور سے سرزد ہو تو ان کی سزا کا باعث بنتی ہے، جیسا کہ کہا گیا ہے:\n\n> اور جب محبوب ایک گناہ کرتا ہے\n> تو اس کی خوبصورتی ہر شفاعت کرنے والے کو لے آتی ہے\n\nاور عرش کا علم، اور اس کی تعداد اور اس کی صفات، اور اس سے منسوب ارادہ (الإرادة) کا علم، اور عارفین کی حالت میں اس کا کیا اثر ہے، اور کیا یہ صفاتِ جلال میں سے ہے یا صفاتِ جمال میں سے؟\n\nاور اس میں علمِ اعتبار شامل ہے۔ اور اس میں علمِ وعید شامل ہے کہ وہ کس اسم سے ہے؟ اور اس میں نفسِ کلیہ کا علم شامل ہے، اور وہ کیوں تغیر کو قبول نہیں کرتا؟ اور قرآن کی فضیلت دیگر کتب، صحیفوں، اور اللہ سے مروی خبروں پر کیوں ہے، حالانکہ وہ سب اللہ کا کلام ہیں؟\n\nاور اس علم کے ساتھ خود قرآن میں آیت الکرسی کی فضیلت تمام قرآنی آیات پر سیادت کے لحاظ سے، اور یٰس کی قلبی حیثیت سے، اور **\"إذا زلزلت\"** کی نصف قرآن کے مقام پر کھڑے ہونے کی وجہ سے، اور سورۃ الکافرون کی چوتھائی قرآن کے مقام پر، اور اسی طرح **\"إذا جاء نصر الله\"**، اور سورۃ الاخلاص کی تہائی قرآن کے مقام پر، اور یٰس کی دس بار قرآن کے مقام پر۔ اور یہ کس وجہ سے لوٹتا ہے؟ اور اس فضیلت سے کون موصوف ہے؟ کیا دلیل، یا مدلول، یا دلیل میں نظر کرنے والا؟\n\nاور اس منزل سے یہ مقدار کافی ہے۔ **اور اللہ حق (الحق) فرماتا ہے اور وہی راہ دکھاتا ہے (وَهُوَ يَهْدِي السَّبِيلَ)**۔\n\n(اللہ کی حمد اور اس کی مدد اور حسنِ توفیق سے کتاب الفتوحات المکیہ کا دوسرا حصہ مکمل ہوا، اور اس کے بعد تیسری جلد شروع ہو گی، جس کا پہلا باب تین سوواں باب ہے)\n\n# [تیسرا حصہ]\n\nالفتوحات المکیہ کا تیسرا حصہ، جو اللہ نے شیخ، امام، عامل، راسخ، کامل، خاتم الاولیاء الوارثین، برزخ البرازخ، محی الحق و الدین، ابو عبداللہ محمد بن علی، جو ابن عربی الحاتمی الطائی کے نام سے مشہور ہیں، پر کھولا، اللہ ان کی روح کو پاک کرے اور ان کی قبر کو منور کرے، آمین۔\n\nیہ نسخہ اس نسخے سے مقابلہ کر کے چھاپا گیا جو مؤلف کے نسخے سے مقابلہ شدہ ہے اور قونیہ شہر میں موجود ہے۔ اور اس اہم کام کو علماء کی ایک جماعت نے مرحوم امیر عبدالقادر الجزائری کے حکم سے انجام دیا، اللہ سب پر رحم فرمائے اور انہیں بلند مقام عطا فرمائے۔ یہ مصر میں دار الکتب العربیہ الکبریٰ کے مطبع میں الحاج فدا محمد کشمیری اور ان کے شرکاء کے خرچ پر چھاپا گیا۔\n\nبسم اللہ الرحمن الرحیم",
    "fa": "باب دویست و نود و نهم در معرفت منزل عذاب مؤمنان از مقام سریانی (المقام السرياني) در حضرت مرادیه محمدیه (الحضرة المرادية المحمدية)\n\nهمانا برج‌ها منزل‌هایی برای منزل‌ها هستند\nکه برای هفت نور (الأنوار) آماده شده‌اند\n\nپس چون به عدالت در افلاک خود حرکت کنند\nچشم‌های اغیار (الأغيار) بر چشم تو آشکار می‌شوند\n\nپس حق (الحق) حکم خود را در منزل‌ها جاری می‌سازد\nو هستی (الکون) در چرخه‌ها و ادوار است\n\nو خلق از زیر منزل‌ها آشکار است\nو امر از بالای منزل‌ها جاری است\n\nپس در زبان کیان (الکیان) گفته می‌شود که آن\nامری است که دست تقدیرها (الأقدار) آن را می‌گرداند\n\nو کف (الکف) و قلم برین (القلم العلي) در لوح (اللوح)\nآنچه از اسرار (الأسرار) آشکار می‌شود را ترسیم می‌کنند\n\nبدان، خداوند ما و تو را توفیق دهد، که این منزل از بزرگترین منازلی است که شیاطین ناری (آتشین) از آن می‌ترسند، به دلیل قدرت سلطه آن بر ایشان. و آن منزلی والاست که علوم بسیاری را در بر می‌گیرد.\n\n### [همانا خداوند روح انسانی را بر فطرت آفرید]\n\nبدان که چون خداوند روح انسانی را آفرید، آن را کامل، بالغ، عاقل، عارف، مؤمن به توحید (توحيد) خدا و اقرارکننده به ربوبیت (ربوبية) او آفرید؛ و این همان فطرتی است که خداوند مردم را بر آن سرشته است.\n\nرسول خدا (صلی الله علیه و سلم) فرمود: «هر مولودی بر فطرت (الفطرة) زاده می‌شود، و پدر و مادرش هستند که او را یهودی یا نصرانی یا مجوسی می‌کنند.»\n\nپس [پیامبر] غالب را ذکر کرد که وجود پدر و مادر است، زیرا ممکن است [کودک] یتیم باشد، پس کسی که او را تربیت می‌کند، برای او به منزله پدر و مادرش است. پس روح کمیت (مقدار) ندارد تا افزایش در جوهر ذاتش را بپذیرد، بلکه جوهری فرد است و جایز نیست که مرکب باشد؛ زیرا اگر چنین بود، ممکن بود که در جزئی از آن، علم به امری وجود داشته باشد و در جزء دیگر، جهل به همان امر، در نتیجه انسان به چیزی که جاهل است، عالم باشد، و این محال است. پس ترکیب در جوهر آن محال است. و چون چنین است، نه افزایش می‌پذیرد و نه نقصان، برخلاف جسم، به دلیل عدم ترکیب. و اگر نه این بود که روح به ذات خود عاقل است و برای خود عقل است، هنگام گرفتن میثاق (پیمان) از او، به ربوبیت خالقش اقرار نمی‌کرد، زیرا حق (الحق) جز با کسی که خطاب او را تعقل کند، سخن نمی‌گوید. این است حقیقت انسان در نفس خود.\n\nسپس خداوند متعال در جسمی که برای او قرار داد، که آن را ملک او ساخت و بر آن استیلا یافت، قوای حسی و معنوی و ابزارهایی قرار داد و به او گفته شد: علوم را از آن‌ها بگیر و به حد معینی به کار ببر. و این ابزارها برای او بر مراتبی قرار داده شدند. قوای معنوی (القوى المعنوية) همگی قوای کاملی هستند، مگر قوه خیال (قوة الخيال) که ضعیف آفریده شده است، و قوه حاسه (القوة الحساسة). و این دو قوه تابع جسم قرار داده شدند. پس هرگاه جسم رشد کند و بزرگ شود و کمیتش افزایش یابد، حس و خیالش نیز قوی‌تر می‌شود، زیرا همه قوا اشیاء را جز از خیال نمی‌گیرند. و خیال، قوه‌ای هیولانی (هيولانية) است که پذیرای تمام صور (تصاویر) است که حس به آن می‌دهد، و پذیرای صورتی است که قوه مصوره (القوة المصورة) در آن می‌گشاید، صورتی که از اموری موجود ترکیب می‌کند که خیال آن‌ها را از قوه حاسه گرفته است. و در میان قوا، جز خیال، چیزی شبیه هیولی (الهيولى) در پذیرش صور نیست. پس هنگامی که خیال قوی شود، آنگاه فکر (الفكر) جایی برای تصرف و ظهور سلطه‌اش می‌یابد، و وهم (الوهم) نیز چنین است، و عقل (العقل) نیز چنین است، و قوه حافظه (القوة الحافظة) نیز چنین است. پس لطیفه انسان (لطيفة الإنسان) از حیث ذات خود، آنچه را که این قوا به او می‌دهند، جز به واسطه آن‌ها درک نمی‌کند. پس اگر اتفاق می‌افتاد که این قوا معلومات را از همان ابتدای ظهور فرزند در عالم حس به او می‌دادند، روح انسانی آن‌ها را با پذیرشی ذاتی قبول می‌کرد. آیا نمی‌بینی که خداوند در مورد برخی افراد در این زمینه عادت را شکسته است؟ و آن همان است که درباره کودک یوسف (شاهد بر بی‌گناهی زلیخا) ذکر شده، و سخن گفتن عیسی (علیه السلام) هنگامی که به بی‌گناهی شهادت داد، و کودک جریج هنگامی که به بی‌گناهی او شهادت داد.\n\nاین سبب تأخیر تکلیف (التكليف) از روح انسانی تا زمان بلوغ (الحلم) است، که در علم خدا حد کمال این قواست. پس در آن هنگام، عذری برای روح انسانی در کوتاهی از نظر و عمل به آنچه پروردگارش او را مکلف کرده، باقی نمی‌ماند. و اولین درجات تکلیف از هفت سالگی تا رسیدن به بلوغ است. و خداوند فعل کودک را در غیر زمان تکلیفش معتبر دانسته است؛ اگر [کودک] مرتکب قتل شود، حد بر او جاری نمی‌شود و تا زمان بلوغ حبس می‌شود و سپس به خاطر کسی که در کودکی کشته، قصاص می‌شود، مگر اینکه ولی دم عفو کند. پس خداوند او را به آنچه در زمان تکلیفش انجام نداده، مؤاخذه کرده است. و مقصود از این مقدمه‌چینی آن است که با آنچه از عذاب مؤمن (عذاب المؤمن) می‌آوریم، انس حاصل شود. زیرا انسان، همان‌طور که گفتیم، مؤمن آفریده شده است، هرچند ما آن‌ها را در دفن در قبورشان با پدرانشان ملحق می‌کنیم، و در بردگی‌شان (استرقاق) اگر مالکشان شویم، از طریق الحاق است نه از طریق استحقاق، برای تشریف و تبیین مرتبه والای ظهور ایمانی که در پدران است. و همان‌طور که کفر عارضی است، بردگی نیز عارضی است، و اصل، آزادی و ایمان است.\n\nپس از جمله اجرای وعید (تهدید الهی) از جایی که [انسان] متوجه آن نیست، وجود تکلیف (التكليف) است، و آن اولین عذاب است، زیرا ترس در نفس مکلف پدید می‌آید، پس به عذابی نفسانی و دردناک معذب شده است. و این عقوبت آن چیزی است که در زمانی که مکلف نبوده از او سر زده است، از افعالی که میان کودکان رخ می‌دهد، مانند آزار، دشنام و کتک زدن از روی تجاوز. و هر خیری که کودک انجام دهد، برای او نوشته می‌شود. و شارع (قانون‌گذار) این را مقرر داشته است، هنگامی که زنی کودکی کوچک را در حج به نزد او (صلی الله علیه و سلم) آورد و گفت: ای رسول خدا، آیا این [کودک] حج دارد؟ رسول خدا (صلی الله علیه و سلم) به او فرمود: «نعم له حج ولك أجر» (بله، برای او حج است و برای تو اجر).\n\nو این بدان سبب است که برای زن اجر کمک و یاری است که کودک بر آن قادر نیست. و از رسول خدا (صلی الله علیه و سلم) روایت شده است که اگر کودک قبل از بلوغ تکلیف حج کند و سپس قبل از بلوغ بمیرد، خداوند آن حج را به جای فریضه او می‌نویسد، و همچنین بنده اگر در حال بردگی حج کند و قبل از آزادی بمیرد.\n\nو این حدیث، اگرچه از جهت سند مورد بحث قرار گرفته است، اما حدیث صحیح آن را تأیید می‌کند. و در صحیح (الحديث الصحيح) وارد شده است که خداوند در روز قیامت در حق بنده‌ای که آنچه را خدا بر او واجب کرده ناقص آورده و چیزی از آن کاسته است، می‌فرماید که از اعمال مستحبی (تطوع) او، آنچه را که ناقص شده، کامل کنند. پس عمل مستحبی را به جای واجب قرار داده است، و این دقیقاً همین مورد است، زیرا حج کسی که مکلف نیست، بر او واجب نیست.\n\nپیامبر (صلی الله علیه و سلم) در حدیث صحیح (الحديث الصحيح) از خداوند متعال فرمود: «إنه أول ما ينظر فيه من عمل العبد الصلاة فيقول الله انظروا في صلاة عبدي أتمها أم نقصها فإن كانت تامة كتبت له تامة وإن كان انتقص منها شيئا قال انظروا هل لعبدي من تطوع فإن كان له تطوع قال أكملوا لعبدي فريضته من تطوعه» (اولین چیزی که از عمل بنده به آن نگریسته می‌شود، نماز است. پس خداوند می‌فرماید: بنگرید به نماز بنده من، آیا آن را کامل انجام داده یا ناقص؟ اگر کامل بود، برای او کامل نوشته می‌شود. و اگر چیزی از آن کاسته بود، می‌فرماید: بنگرید آیا بنده من عمل مستحبی (تطوع) دارد؟ اگر عمل مستحبی داشت، می‌فرماید: واجب بنده مرا از عمل مستحبی او کامل کنید). پیامبر (صلی الله علیه و سلم) فرمود: «ثم تؤخذ الأعمال على ذاكم» (سپس اعمال [دیگر] نیز بر همین منوال گرفته می‌شوند).\n\nیعنی در زکات و روزه و حج نیز دقیقاً مانند نماز عمل می‌شود. و اگر شرع این را معتبر نمی‌دانست، چنین حکمی نمی‌کرد. و هر آنچه کودک در غیر زمان بلوغ تکلیف انجام می‌دهد، در شرع در خیر و شر معتبر است، جز اینکه کرم الهی (الکرم الإلهي) او را به خاطر خیر انجام شده در این زمان، در سرای آخرت پاداش می‌دهد و آن را برای او ذخیره می‌کند. اما شر، چیزی از آن را در آخرت برای او ذخیره نکرده است، بلکه در دنیا او را به خاطر آن مجازات کرده است، از طریق دردهای حسی و نفسانی که بر کودکان عارض می‌شود و وجود دارند و کسی نمی‌تواند آن‌ها را انکار کند، و این‌ها عقوبت‌ها و عذاب‌هایی برای اموری است که از کودکان سر می‌زند. اهل طریقت (أهل طريقنا) ما این مقدار را به عنوان حکمتی می‌شناسند که حق (الحق) آن‌ها را بر آن آگاه ساخته است، و آن در حق مؤمنان، همان‌طور که گفتیم، عذابی است که کفاره را برایشان واجب می‌سازد. و در حق کافران، اگر به بلوغ برسند و در حال کفر بمیرند و در آخرت عقوبت شوند، در حالی که در کودکی در دنیا عذاب شده‌اند، مانند عذابی که مؤمنان در کودکی می‌بینند، این همان قول خداوند متعال است: «زِدْناهُمْ عَذاباً فَوْقَ الْعَذابِ» (بر عذابشان عذابی افزودیم). یعنی عذابی که در دنیا به آن معذب شدند و مانند آن، زیرا این [آیه] نص در تضاعف عذاب بر مراتب آن است که این [عذاب دنیا] یکی از آن‌هاست.\n\nو از عذاب مؤمنان (عذاب المؤمنين) آن است که خداوند بر آنان از سوی اهل هوی و هوس و کافران، اسارت، عذاب، بردگی و قتل را در دنیا مسلط کرده است. همه این‌ها کفاره‌ای است برای لغزش‌ها و خطاهای نفسانی و حسی به اندازه‌ای که از آن‌ها سر زده است. و این [آزار] از کافران بر مؤمنان واقع نمی‌شود مگر به خاطر ایمانشان. خداوند متعال می‌فرماید: «يُخْرِجُونَ الرَّسُولَ وإِيَّاكُمْ أَنْ تُؤْمِنُوا» (پیامبر و شما را بیرون می‌کنند به خاطر اینکه ایمان آورده‌اید). زیرا «أَنْ تُؤْمِنُوا» با تأویل مصدر است، گویی می‌گوید: پیامبر و شما را به خاطر ایمانتان بیرون می‌کنند. و خداوند متعال می‌فرماید: «وما نَقَمُوا مِنْهُمْ إِلَّا أَنْ يُؤْمِنُوا» (و بر آنان عیبی نگرفتند جز اینکه ایمان آوردند). و بر این اساس، جاودانگی کسی که مؤمنی را عمداً کشته است، توجیه می‌شود، یعنی قصد کشتن او را به خاطر ایمانش داشته است.\n\nو از جمله آنچه این منزل در بر می‌گیرد، علم ابتلا (آزمایش) است، و این جز برای خدا نیست. خداوند متعال می‌فرماید: «ولَنَبْلُوَنَّكُمْ» (و قطعاً شما را می‌آزماییم). و عز و جل نیز می‌فرماید: «لِيَبْلُوَكُمْ» (تا شما را بیازماید). و مؤمن را نرسد که مؤمنی را بیازماید مگر به امر الهی، پس ابتلا (الابتلاء) از آنِ خداوند متعال است و از جانب اوست نه از جانب آن‌ها. مانند قول خداوند متعال: «فَامْتَحِنُوهُنَّ» (پس آنان را بیازمایید). خداوند به آن امر کرده است، پس بنده امر مولای خود را اطاعت می‌کند، مانند سلطانی که به عذاب شخصی فرمان می‌دهد و کسی که مأمور به تعذیب شده، عذاب او را بر عهده می‌گیرد، هرچند نسبت به او مهربان باشد، اما امر سلطان به دلیل هیبتی که مرتبه او اقتضا می‌کند، واجب الاطاعه است. پس ابتلا (الابتلاء) جز برای خدا نیست، و هر کس مؤمنی را بدون امر الهی بیازماید، خداوند او را بر آن مؤاخذه می‌کند.\n\nو به این مقام، اسم الخبیر (الخبير) اختصاص یافته است، و این از شگفت‌انگیزترین احکام اسماء است، زیرا خبره (آگاهی) برای کسب علم از سوی خبردهنده (آزماینده) نسبت به آزموده‌شده می‌آید. و در اینجا در ساحت الهی، علم به آنچه از این آزموده‌شده (اسم مفعول) سر می‌زند، محقق است، پس آزماینده (اسم فاعل) علمی کسب نمی‌کند. در نتیجه به نظر می‌رسد که این اسم حکمی ندارد و سزاوارتر به آن، بنده بود به دلیل جهلش به آنچه از آزموده‌شده (اسم مفعول) سر می‌زند، در حالی که بنده از اختیار منع شده است مگر به امر الهی. پس گاهی خداوند متعال به چیزی نامیده می‌شود که بنده سزاوار آن است. پس حکم آن در ساحت حق (الحق)، افاده علم به آزموده‌شده در نفس خود اوست، به واسطه این آزمایش، تا حجت بر او و به نفع او اقامه شود. به همین دلیل، الخبیر (الخبير) به صفت علم ملحق نمی‌شود، چنانکه ابوحامد و اسفراینی و بیشتر مردم آن را ملحق کرده‌اند، و اگر چنان بود که گمان کرده‌اند، نقص محسوب می‌شد.\n\nو آنچه آنان را به این اشتباه انداخته، قول خداوند متعال است: «حَتَّى نَعْلَمَ» (تا بدانیم). و این خود حجتی است علیه آنان، اگر امر بر ظاهرش باشد؛ زیرا آزمایش سبب تحصیل علم است، نه خود علم. و به واسطه خبره (آگاهی) خبیر نامیده می‌شود، پس چون علم حاصل شد، در آن حال عالم نامیده می‌شود. و نهایت کسانی که [خداوند را] تنزیه (تنزیه) کرده‌اند، مانند ابن خطیب و دیگران، در قول «حَتَّى نَعْلَمَ» این است که تعلق علم به این حالت [جدید] است، و تعلق علم حادث است و به حدوث علم نمی‌انجامد، پس علم بر حال خود به وصف قدم (قدیم بودن) باقی می‌ماند، هرچند تعلق حادث شود. این نهایت تلاش آنان در تنزیه است. و می‌گویند: اگر علم به چیزی تعلق گیرد که شأنش این است که خواهد بود، [و خدا] آن را به صورت «بوده است» بداند، یا اگر به چیزی تعلق گیرد که شأنش این است که بوده است، [و خدا] آن را به صورت «خواهد بود» بداند، یا اگر به چیزی تعلق گیرد که شأنش این است که هست، [و خدا] آن را به صورت «بوده است» یا «خواهد بود» بداند، این همه جهل خواهد بود، و خداوند از آن برتر است. پس آنان زمان را ناخواسته بر خدا وارد کرده‌اند، و تقدم و تأخر در اشیاء را [به خدا نسبت داده‌اند]. در حالی که ندانسته‌اند که خداوند متعال اشیاء را مشاهده می‌کند و آن‌ها را بر همان صورتی که در نفس خود هستند می‌داند، و زمان‌هایی که برای آن‌هاست، از جمله معلومات اوست که ملازم آن‌هاست، و احوال و مکان‌هایشان اگر مکان داشته باشند، و محالشان اگر از کسانی باشند که محال را می‌طلبند، و حوزه‌هایشان؛ همه این‌ها برای حق (الحق) در غیر زمان مشهود است، که نه به تقدم متصف می‌شود و نه به تأخر، و نه به «الآن» که حد میان دو زمان است.\n\nو به همین دلیل، در کنار قول پیامبر (صلی الله علیه و سلم) از پروردگارش: «كان الله ولا شي‏ء معه» (خدا بود و هیچ چیز با او نبود)، [لفظ] «كان» آمده است، و آن حرفی وجودی است نه فعل، و نگفته است: «و او الآن است»، زیرا «الآن» نص در وجود زمان است. پس اگر آن را ظرفی برای هویت باری تعالی قرار می‌داد، تحت ظرفیت زمان در می‌آمد. برخلاف «كان» که لفظ «كان» از «کون» (هستی) است و عین وجود (الوجود) است. پس گویی می‌گوید: خدا موجود است و هیچ چیز در وجودش با او نیست. پس این [لفظ] از جمله الفاظی نیست که زمان با آن کشیده شود، مگر به حکم توهم. و به همین دلیل شایسته نیست که «كان» در اعراب (تجزیه و تحلیل نحوی) به روش نحویان، فعل ماضی (گذشته) نامیده شود. و زجاجی بابی را به آن اختصاص داده و آن را «حرفی که اسم را رفع و خبر را نصب می‌دهد» نامیده است و آن را فعل قرار نداده تا زمان ماضی و حال و آینده با آن کشیده شود. و به واسطه همین مقدار موهومی که در این صیغه (کان، یکون، سیکون) از زمان تخیل می‌شود، شبیه فعل صحیح (قام، یقوم، سیقوم) شده است، و «قائم» را مانند «کائن» قرار داده‌اند، پس از این جهت آن را در حکم افعال جاری ساخته‌اند. و چون امر آن چنین است، از جهتی که ظرفیت زمان را نمی‌پذیرد، بر خداوند متعال اطلاق می‌شود، و آن قول اوست: «وكانَ الله غَفُوراً رَحِيماً» (و خداوند همواره آمرزنده و مهربان است) و «وكانَ الله شاكِراً عَلِيماً» (و خداوند همواره شکرگزار و داناست). و «الآن» بر او اطلاق نشده است به دلیل آنچه ذکر کردیم، زیرا «الآن» نص در زمان است و اسم عَلَم برای آن و به معنای ظرف است. همان‌طور که استوا (الاستواء) بر عرش (العرش) با لفظ عرش و لفظ استوا آمده است، و این‌ها نص در ظرفیت مکان نیستند، برخلاف اسم لفظ «مکان» که به وضع، نص در ظرفیت است و متمکن در مکان نیز نص در آن است. پس [خداوند] به استوا و عرش عدول کرد تا تأویلی که شایسته ساحت والای الهی است، برای کسی که ناگزیر تأویل می‌کند، جایز باشد. و اولی آن است که در آنچه خداوند فرموده، تسلیم شویم و آن را به علم سبحان او بازگردانیم که در این خطاب چه اراده کرده است، و تشبیه (التشبيه) فهمیده شده از آن را با قولش: «لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ» (چیزی مانند او نیست) نفی کنیم، چه با فرض زیادت کاف باشد یا فرض مثل، زیرا فرض محال، محال نیست.\n\nو از جمله آنچه این منزل در بر می‌گیرد، علم عالم علوی (العالم العلوي) است که به ویژه مختص به فلک اطلس (الفلك الأطلس) است، و [علم] درباره ساکنان آن و تسبیح (تسبيح) آن‌ها، و آنچه به آن مربوط می‌شود که از چه کسی می‌گیرند و به چه کسی می‌دهند و از چه کسی دریافت می‌کنند. و عطای ذاتی (العطاء الذاتي) که عطای علت است، و عطای ارادی (العطاء الإرادي) که عطای اختیار است. و معرفت آخرت، و معرفت آنچه از تجلی (التجلي) در نفس بنده حاصل می‌شود، و تأثیر ضعیف در قوی، و آنچه اغراض و هواهای ربانی (الأهواء الربانية) جاری در عالم به آن می‌انجامد، که هر موجود زنده‌ای، انسان و غیر انسان، مدعی آن است. و معرفت صلاح (شایستگی) که انبیا از خدا می‌خواهند، و به ویژه تصدیق (التصديق) انسانی، و اینکه چه کسی تصدیق می‌کند و به چه چیزی تصدیق می‌کند و چه چیزی را رد می‌کند، و آیا تصدیق به آنچه دلیل عقل آن را محال می‌داند، بر او لازم است؟ و منزلت آن نزد خدا چیست و صاحبش به کجا می‌رسد؟ و آیا مؤمنان در آن یکسانند یا با هم تفاوت دارند؟ و آیا افزایش و کاهش می‌پذیرد؟ یا آیا در زمانی که شبهه‌ای بر آنچه تصدیق شده است وارد شود، کاهش می‌یابد؟ و آیا اگر نقص در مسئله‌ای از مسائل ایمان در او پدید آید، آن نقص به تمام ایمان سرایت می‌کند یا بر زوال کلی آن تأثیر می‌گذارد، یا محدود به همان چیزی است که شبهه بر آن وارد شده است؟\n\nو معرفت سبب سرعت اخذ (گرفتن) الهی. زیرا هنگامی که خداوند متعال مرا بر نزول این آیه آگاه ساخت، با نزولی که بر امثال ما که پیامبر نیستیم وارد می‌شود (زیرا قرآن و هر کلامی بر تلاوت‌کنندگان و سخن‌گویان در حال تلاوت و سخن گفتنشان نازل می‌شود، و اگر نه این بود، نه تلاوت می‌کردند و نه سخن می‌گفتند). و در اینجا لطایف الهی برای کسی است که نظر کند. پس به من گفته شد: بخوان. گفتم: چه بخوانم؟ گفته شد: بخوان: «وَكَذلِكَ أَخْذُ رَبِّكَ إِذا أَخَذَ الْقُرى‏ وهِيَ ظالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ» (و این‌چنین است گرفتن پروردگارت، هنگامی که شهرها را در حالی که ستمگرند، بگیرد. همانا گرفتن او دردناک و سخت است). پس این آیه را همان‌طور که حفظ داشتم خواندم. هنگامی که به قول خداوند متعال «إِنَّ أَخْذَهُ» رسیدم، به من گفته شد: «بِکَ» را بگو. گفتم: این در قرآن نیست و چنین نازل نشده است. به من گفته شد: این‌گونه نگو، بلکه این‌گونه است و چنین نازل شده است، «بِکَ» را بگو. و بر من سخت گرفته شد. پس خواندم: «إِنَّ أَخْذَهُ بِکَ أَلِيمٌ شَدِيدٌ» (همانا گرفتن او به سبب تو دردناک و سخت است). پس معنای آن را طلب کردم. شخصی که او را می‌شناختم و بر من افترا بسته بود، برایم حاضر شد. به من گفته شد: این به سبب تو گرفته شده است. پس بخوان: «إِنَّ أَخْذَهُ بِکَ أَلِيمٌ شَدِيدٌ» در حالی که او در مقابل من دراز کشیده بود. هنگامی که آن تنزیل (التنزلات) پایان یافت، آن شخص را فراخواندم و آنچه را دیده بودم به او گفتم. او اظهار ناراحتی کرد و توبه ظاهری نمود و از نزد من رفت، در حالی که بر همان حال افترا بود. هنوز ماه تمام نشده بود که خداوند او را با سنگی که سرش را خرد کرد، کشت. و قاتل چیزی از لباس، اسب یا مال او را نگرفت. خبر شایع شد و به سلطان رسید. نزد سلطان مقرر کردند که من سبب قتل او بوده‌ام، اما سلطان توجهی نکرد. پس از سه سال، قاتل آمد و نزد سلطان به قتل او اعتراف کرد. سلطان از او سبب آن را پرسید. گفت: سببی نداشت و کار زشتی با من نکرده بود، جز اینکه از کنار او گذشتم در حالی که در خرابه‌ای خوابیده بود و لگام اسبش در دستش بود. پس [شیطان] قتل او را برایم آراست. سنگی بزرگ برداشتم و آن را بر سرش نشانه گرفتم و پرتاب کردم. او تکان نخورد و من چیزی از او نگرفتم و طمعی به چیزی از آن نداشتم و اهمیتی ندادم. پس سلطان او را به خاطر آن کشت و خبر آن را برای من فرستاد. و این از شگفت‌انگیزترین تنزلات (التنزلات) است که چنین افزایشی وجود داشته باشد. و عارف (العارف) از این منزل می‌داند که این [افزایش] از کجا صادر شده، نامش چیست و منزلتش از کلام حق (كلام الحق) چیست. زیرا اخبار نبوی (الأخبار النبوية) که از خدا روایت شده‌اند، قرآن نامیده نمی‌شوند، با اینکه از کلام خدا هستند.\n\nو این منزل شامل علم آغاز خلقت و اعاده (بازگشت) آن و چگونگی اعاده است. زیرا اهل کشف (أهل الكشف) در چگونگی آن اختلاف کرده‌اند؛ ابن قسی به چگونگی‌ای رفته که در آن منفرد است، و دیگران با اختلافاتی به غیر آن رفته‌اند. و همچنین علمای نظر فکری (النظر الفكري) در آن اختلاف کرده‌اند. و شامل علم محبت الهی (المحبة الإلهية) و ثبوت آن، و علم پرده‌هایی است که میان محبان است و آنچه اگر از غیر آن‌ها سر بزند، به عقوبتشان می‌انجامد، چنانکه گفته شده است:\n\n> وإذا الحبيب أتى بذنب واحد *** جاءت ملاحته بكل شفيع‏\n\n> (و چون دوستدار مرتکب یک گناه شود، زیبایی او با هر شفاعت‌کننده‌ای می‌آید.)\n\nو علم عرش‌ها (العرش) و تعداد و صفات آن‌ها، و علم اراده (الإرادة) منسوب به آن، و تأثیر آن در حال عارفان (العارفين)، و اینکه آیا از نعت‌های جلال (نعوت الجلال) است یا از نعت‌های جمال (نعوت الجمال). و شامل علم اعتبار (پند گرفتن)، و علم وعید (تهدید) که از کدام اسم [الهی] است، و علم نفس کلیه (النفس الكلية) و اینکه چرا تغییر به آن راه نمی‌یابد. و شرافت قرآن بر دیگر کتب و صحیفه‌ها و اخبار روایت شده از خدا چیست، با اینکه همه آن‌ها کلام خدا هستند. و همراه با این علم در نفس قرآن، شرافت آیة الکرسی (آية الكرسي) بر سایر آیات قرآن به سیادت (سروری)، و سوره یس (يس) به قلبی بودن، و سوره زلزال (إذا زلزلت) به جایگاه نصف قرآن، و سوره کافرون (سورة الكافرون) به جایگاه ربع قرآن، و همچنین سوره نصر (إذا جاء نصر الله)، و سوره اخلاص (سورة الإخلاص) به جایگاه ثلث قرآن، و سوره یس به جایگاه ده برابر قرآن، و اینکه چرا این [فضیلت] باز می‌گردد و چه کسی به این فضل موصوف است؟ آیا دلیل است یا مدلول یا نظرکننده در دلیل؟ و این مقدار از این منزل کافی است. و خداوند «يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ» (حق را می‌گوید و اوست که راه را می‌نمایاند).\n\n(پایان جلد دوم کتاب الفتوحات المکیه به حمد و یاری و توفیق نیکوی خداوند. و به دنبال آن جلد سوم می‌آید که آغاز آن باب سیصدم است.)\n\n[جلد سوم]\n\nجلد سوم از کتاب الفتوحات المکیه (الفتوحات المکیه) که خداوند آن را بر شیخ، امام، عامل، راسخ، کامل، خاتم اولیای وارثین، برزخ برزخ‌ها، محیی الحق و الدین، ابوعبدالله محمد بن علی، معروف به ابن عربی حاتمی طائی (محيي الدين محمد بن علي بن محمد بن عربي الطائي الحاتمي) گشوده است. خداوند روح او را پاک گرداند و آرامگاهش را نورانی سازد، آمین. این [جلد] بر اساس نسخه‌ای که با نسخه مؤلف موجود در شهر قونیه مقابله شده، به چاپ رسیده است. و این مهم توسط گروهی از علما به دستور امیر عبدالقادر جزایری مغفور له (رحم الله الجميع وأثابهم المكان الرفيع) انجام شده است. در مطبعه دارالکتب العربیه الکبری در مصر به هزینه حاج فدا محمد کشمیری و شرکا به چاپ رسید.\n\nبسم الله الرحمن الرحیم (به نام خداوند بخشنده مهربان)"
  },
  "page_count": 6
}