{
  "id": 372,
  "title": {
    "ar": "الباب الثاني والسبعون وثلاثمائة في معرفة منزل سر وسرين وثنائك عليك بما ليس لك وإجابة الحق إياك في ذلك لمعنى شرفك به من حضرة محمدية",
    "en": "Chapter Three Hundred and Seventy-Two: Concerning the Gnosis (معرفة) of the Station (منزل) of a Secret (سر) and Two Secrets (سرين), and your Self-Praise (ثناءك) with that which is not inherently yours, and the Real's (الحق) Acceptance of you in that, due to the significance by which He honored you from the Muhammadan Presence (حضرة محمدية).",
    "ur": "باب تین سو بہترواں: سر اور دو سروں کی منزل کی معرفت کے بیان میں، اور تمہارا اپنے آپ پر اس چیز کے ساتھ ثنا کرنا جو تمہاری نہیں ہے، اور اس بارے میں الحق (ذات حق) کا تمہیں جواب دینا، اس معنی کی بنا پر جس کے ساتھ اس نے تمہیں حضرت محمدیہ (حضرة محمدية) سے شرف بخشا ہے۔",
    "fa": "باب سیصد و هفتاد و دوم در معرفت منزل سرّ و دو سرّ و ثنای تو بر خودت به آنچه از آنِ تو نیست و اجابت حق تو را در آن به جهت معنایی که به آن از حضرت محمدیه (الحضرة المحمدية) شرافت یافته‌ای"
  },
  "content": {
    "ar": "## «الباب الثاني والسبعون وثلاثمائة في معرفة منزل سر وسرين وثنائك عليك بما ليس لك وإجابة الحق إياك في ذلك لمعنى شرفك به من حضرة محمدية»\n\n\n> من حاز شطر الكون في خلقه *** وشطره الآخر في خلقه‏\n\n\n> فذاك عين الوقت في وقته *** وبدره الطالع في أفقه‏\n\n\n> فبدره يطلع من غربه *** وضوؤه يغرب في شرقه‏\n\n\n> فكل مخلوق به هائم *** وكلنا نهلك في حقه‏\n\n\n### [إن العالم كله في غاية الجمال‏]\n\n\nورد في الخبر الصحيح في صحيح مسلم عن رسول الله صَلَّى اللهُ عَليهِ وسَلَّم أنه قال إن الله جميل يحب الجمال‏\n\n\nوهو تعالى صانع العالم وأوجده على صورته فالعالم كله في غاية الجمال ما فيه شي‏ء من القبح بل قد جمع الله له الحسن كله والجمال فليس في الإمكان أجمل ولا أبدع ولا أحسن من العالم ولو أوجد ما أوجد إلى ما لا يتناهى فهو مثل لما أوجد لأن الحسن الإلهي والجمال قد حازه وظهر به فإنه كما قال تعالى أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ فهو جماله إذ لو نقص منه شي‏ء لنزل عن درجة كمال خلقه فكان قبيحا ثم هدى أي بين ذلك لنا بقوله أَعْطى‏ كُلَّ شَيْ‏ءٍ خَلْقَهُ‏\n\n\n> ولما رأينا الحق في صورة البشر *** علمنا بأن العقل فيه على خطر\n\n\n> فمن قيد الحق المبين بعقله *** ولم يطلق التقييد ما عنده خبر\n\n\n> إذا ما تجلى لي على مثل صورتي *** تجليت في التنزيه عن سائر الصور\n\n\n> فإن قال ما ذا قلت أنت ذكرت لي *** بأنك تعفو عن ظلوم إذا انتصر\n\n\n> وما أنت مثلي قل فلم خرت صورتي *** ورؤيتى إياكم كما يبصر القمر\n\n\n> فإن كنت مثلي فالتماثل حاكم *** على كل مثل كالذي يقتضي النظر\n\n\n> فكل شبيه للشبيه مشاكل *** على كل حال في القديم وفي البشر\n\n\n> لقد شرع الله السجود لسهونا *** بإرغام شيطان وجبر لما انكسر\n\n\n> فما لك لم تسجد وأنت إمامنا *** فأنت جدير بالسجود كما ذكر\n\n\n> أتيناك نسعى فانثنيت مهر ولا *** وأين خطي الاقدام من خطوة البصر\n\n\nومنها أيضا\n\n\n> فمن فصلنا أو بمن قد وصلتنا *** وما هو إلا الله بالعين والأثر\n\n\n> فشكرا لما أخفى وشكرا لما بدا *** وحاز مزيد الخير عبد إذا شكر\n\n\n> وما هو إلا الحق يشكر نفسه *** ولكن حجاب القرب أرسل فاستتر\n\n\nفالعالم كله جماله ذاتي وحسنه عين نفسه إذ صنعه صانعه عليه ولهذا هام فيه العارفون وتحقق بمحبته المتحققون ولهذا قلنا فيه في بعض عباراتنا عنه إنه مرآة الحق فما رأى العارفون فيه إلا صورة الحق وهو سبحانه الجميل والجمال محبوب لذاته والهيبة له في قلوب الناظرين إليه ذاتية فأورث المحبة والهيبة فإن الله ما كثر لنا الآيات في العالم وفي أنفسنا إذ نحن من العالم إلا لنصرف نظرنا إليه ذكرا وفكرا وعقلا وإيمانا وعلما وسمعا وبصرا ونهيا ولبا وما خلقنا إلا لنعبده ونعرفه وما أحالنا في ذلك على شي‏ء إلا على النظر في العالم لجعله عين الآيات والدلالات على العلم به مشاهدة وعقلا فإن نظرنا فإليه وإن سمعنا فمنه وإن عقلنا فعنه وإن فكرنا ففيه وإن علمنا فإياه وإن آمنا فبه فهو المتجلي في كل وجه والمطلوب من كل آية والمنظور إليه بكل عين والمعبود في كل معبود والمقصود في الغيب والشهود لا يفقده أحد من خلقه بفطرته وجبلته فجميع العالم له مصل وإليه ساجد وبحمده مسبح فالألسنة به ناطقة والقلوب به هائمة عاشقة والألباب فيه حائرة يروم العارفون أن يفصلوه من العالم فلا يقدرون ويرومون أن يجعلوه عين العالم فلا يتحقق لهم ذلك فهم يعجزون فتكل أفهامهم وتتحير عقولهم وتتناقض عنه في التعبير ألسنتهم فيقولون في وقت هو وفي وقت ما هو وفي وقت هو ما هو فلا تستقر لهم فيه قدم ولا يتضح لهم إليه طريق أمم لأنهم يشهدونه عين الآية والطريق فتحول هذه المشاهدة\nبينهم وبين طلب غاية الطريق إذ لا تسلك الطريق إلا إلى غاياتها والمقصود معهم وهو الرفيق فلا سالك ولا مسلوك فتذهب الإشارات وليست سواه وتطيح العبارات وما هي إلا إياه فلا ينكر على العارف ما يهيم فيه من العالم وما يتوهمه من المعالم ولو لا إن هذا الأمر كما ذكرناه ما أحب نبي ولا رسول أهلا ولا ولدا ولا آثر على أحد أحدا وذلك لتفاضل الآيات وتقلب العالم هو عين الآيات وليست غير شئون الحق التي هو فيها وقد رفع بعضها فَوْقَ بَعْضٍ دَرَجاتٍ لأنه بتلك الصورة ظهر في أسمائه فعلمنا تفاضل بعضها على بعض بالعموم والخصوص فهو الغني عن العالمين وهو القائل وما خَلَقْتُ الْجِنَّ والْإِنْسَ إِلَّا لِيَعْبُدُونِ فأين الخالق من الغني وأين القابض منه والمانع وأين العالم في إحاطته من القادر والقاهر فهل هذا كله إلا عين ما وقع في العالم فما تصرف رسول ولا عارف إلا فيه ولكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ وذلك لأن من الناس من في أذنه وقر وعلى بصره غشاوة وعلى قلبه قفل وفي فكره حيرة وفي علمه شبهة وبسمعه صمم وو الله ما هو هذا كله عند العارف إلا للقرب المفرط ونَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ ولكِنْ لا تُبْصِرُونَ ولَقَدْ خَلَقْنَا الْإِنْسانَ ونَعْلَمُ ما تُوَسْوِسُ به نَفْسُهُ ونَحْنُ أَقْرَبُ إِلَيْهِ من حَبْلِ الْوَرِيدِ وأين الوسوسة من الإلهام وأين اسم الإنسان من اسم العالم‏\n\n\n> فمن ليلى ومن لبني *** ومن هند ومن بثنه‏\n\n\n> ومن قيس ومن بشر *** أ ليسوا كلهم عينه‏\n\n\n> لقد أصبحت مشغوفا *** به إذا كان لي كونه‏\n\n\n> فكل الخلق محبوبي *** فأين مهيمي أينه‏\n\n\n> فمن يبحث على قولي *** يجد في بينه بينه‏\n\n\nوأما أهل الجمال العرضي والحب العرضي فظل زائل وغرض مائل وجدار مائل بخلاف ما هو عند العلماء بالله فإن الظل عند العالم بالله ساجد والعارض للوجود مستعد والجدار لم يمل إلا عبادة ليظهر ما تحته من كنوز المعارف التي يستغني بها العارف الواقف فخلق الله الغيرة في صورة الخضر فأقامه من انحنائه لما علم إن الأهلية ما وجدت في ذلك الوقت في رب المال فيقع التصرف فيه على غير وجهه ولتعلمن نبأه بعد حين فلو ظهر اتخذ عبثا وعاثت فيه الأيدي فسبحان واضع الحكم وناصب الآيات ومظهر جمال الدلالات ومن أجملها عينا وأكملها كونا عالم الخيال وبه ضرب الله الأمثال وبين تعالى أنه المنفرد بعلمه فإنه قال ناهيا فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ إِنَّ الله يَعْلَمُ وأَنْتُمْ لا تَعْلَمُونَ وما جاء بهذه الآية إلا عند ما ضرب لنا الأمثال منه فظهر للكون وهو مقدمته أ لا ترى الرؤيا وبعينها يدرك الخيال يرى ما يكون قبل كونه وما كان وما هو الوقت عليه وأي حضرة تجد فيها هذه الجمعية إلا حضرة الخيال وكل من تعشق بأمر ما فما تعشق به إلا بعد أن حصله في خياله وجعل له في وهمه مثالا وطبق محبوبه على مثاله ولو لم يكن الأمر كذلك لكان إذا فارقه من تعلق بصره به أو سمعه أو شي‏ء من حواسه فارق التعلق به ونحن لا نجد الأمر كذلك فدل على إن المحبوب عند المحب على مثال صورة وأنشأه في خياله فلزم مشاهدته فتضاعف وجده وتزايد حبه وصار ذلك المثال الذي صوره يحرض مصوره على طلب من صوره على صورته فإن ذلك الأصل هو روح هذا الخيال وبه بقاؤه وهو الذي يحفظه وما اشتد حب المحب إلا في صنعته وفعله فإن الصورة التي تعشق بها في خياله هي من صنعته فما أحب إلا ما هو راجع إليه فبنفسه تعلق وعلى فعله أثنى فمن علم هذا علم حب الله عباده‏\n\n\nوأنه تعالى أشد حبا فيهم منهم فيه بل لا يحبونه عينا وإنما يحبون إحسانه فإن الإحسان هو مشهودهم ومن أحبه عينا فإنما أحب مثالا صوره في نفسه وتخيله وليس إلا المشبهة خاصة فكل محب فلو لا التشبيه ما أحبه ولو لا التخيل ما تعلق به ولهذا جعله الشارع في قبلته ووسعه قلب عبده وجعله من القرب به كهو أو كبعض أجزائه فمثل هؤلاء عبدوه مثلا وشاهدوه محصلا وأما المنزهة فحائرة في عمياء يخبطون فيها\n\n\nعشواء لا ظل في ظلمتها ولا ما يمنعهم الدليل من التشبيه وما ثم إيمان يفوق نوره نور الأدلة حتى يدرجها فيه فلا يزال المنزه غير قابض على شي‏ء ولا محصل لأمر فهم أهل البيت لأن همهم متفرق والوهم منهم بعيد فنقصهم من كمال معرفة الوجود حكم الأوهام فيهم ولا حكم للأوهام إلا في الكمل من الرجال ولهذا جاءت الشرائع في الله بما تحيله الأدلة فمن تقوى نور إيمانه على نور عقله كما تقوى نور الشمس على نور غيره من الكواكب فما أذهب عين أنوارها وإنما أدرجها في نوره فالعالم مستنير كله بنور الشمس ونور الكواكب ولكنهم لا يبصرون إلا نور الشمس ولا يبصرون المجموع كذلك الكامل من‏\nأهل الله إذا أدرج نور عقله في نور إيمانه صوب رأى المنزهة إذ ما تعدت ما كشفته لهم أنوارها وصوب رأى المشبهة إذ ما تعدت ظاهر ما أعطاها نور إيمانها بما ضرب الله لها من المثل فعرفه الكامل عقلا وإيمانا فحاز درجة الكمال كما حاز الخيال درجة الحس والمعنى فلطف المحسوس وكثف المعنى فكان له الاقتدار التام ولذلك قال يعقوب لابنه لا تَقْصُصْ رُؤْياكَ عَلى‏ إِخْوَتِكَ فَيَكِيدُوا لَكَ كَيْداً لما علم من علمهم بتأويل ما مثل الحق له في رؤياه إذ ما كان ما رآه وما مثل له إلا عين إخوته وأبويه فأنشأ الخيال صور الأخوة كواكب وصور الأبوين شمسا وقمرا وكلهم لحم ودم وعروق وأعصاب فانظر هذه النقلة من عالم السفل إلى عالم الأفلاك ومن ظلمة هذا الهيكل إلى نور هذا الكوكب فقد لطف الكثيف ثم عمد إلى مرتبة التقدم وعلو المنزلة والمعاني المجردة فكساها صورة السجود المحسوس فكثف لطيفها والرؤيا واحدة فلو لا قوة هذه الحضرة ما جرى ما جرى ولو لا أنها في الوسط ما حكمت على الطرفين فإن الوسط حاكم على الطرفين لأنه حد لهما كما إن الآن عين الماضي والمستقبل كما إن الإنسان الكامل جعل الله رتبته وسطا بين كينونته مستويا على عرشه وبين كينونته في قلبه الذي وسعه فله نظر إليه في قلبه فيرى أنه نقطة الدائرة وله نظر إليه في استواءه على عرشه فيرى أنه محيط الدائرة فهو بكل شي‏ء محيط فلا يظهر خط من النقطة إلا ونهايته إلى المحيط ولا يظهر خط من المحيط من داخله إلا ونهايته إلى النقطة وليست الخطوط سوى العالم فإنه بِكُلِّ شَيْ‏ءٍ مُحِيطٌ والكل في قبضته وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فالخلاء ما فرض بين النقطة والمحيط وهو الذي عمر العالم بعينه وكونه وفيه ظهرت الاستحالات من نقطة إلى محيط ومن محيط إلى نقطة فما خرج عنه عز وجل شي‏ء ولا ثم شي‏ء خارج عن المحيط فيدخل في إحاطته بل الكل منه انبعث وإليه ينتهي ومنه بدأ وإليه يعود فمحيطه أسماؤه ونقطته ذاته فلهذا هو الواحد العدد والواحد الكثير فما كل عين له ناظر إلا عين الإنسان ولو لا الإنسان العين ما نظرت عين الإنسان فبالإنسان نظر الإنسان فبالحق ظهر الحق‏\n\n\n> فقلنا فيه حق *** وقلنا فيه خلق‏\n\n\n> وقلنا فيه در *** وقلنا فيه حق‏\n\n\n> فهو الملك والملك *** وهو الفلك والفلك‏\n\n\n> فإذا ما هويته *** قال للحب هيت لك‏\n\n\nأي حسنت هيأتي إذ هيت لك إذ لو لا حسن العالم ما علم حسن القديم ولا جماله ولو لا جمال الحق ما ظهر في العالم جمال فالأمر دوري وبه دار الفلك فدوران الفلك سعيه وما برح من مكانه فهو بكليته المنتقل الذي لم يفارق مكانه تنبيها من الله لعباده أو ضرب مثل أن الحق وإن أوجد العالم ووصف نفسه بما وصف ما زال في منزلة تنزيهه وتمييزه عن خالقه بذاته مع معينه بكل خلق من خلقه بخلاف الخطوط فإنها متحركة من الوسط وإلى الوسط فهي مفارقة وقاطعة منازل وحركة الوسط لم تفارق منزلتها ولا تحركت في غيرها وهي أعجوبة المسائل التي حار فيها المجيب والسائل‏\n\n\n> ألا أيها الفلك الدائر *** لمن أنت في سيركم سائر\n\n\n> إلينا فنحن بأحشائكم *** إليه فسيركم بائر\n\n\n> تعالى عن الحد في نفسه *** وقال هو الباطن الظاهر\n\n\n> تدور علينا بأنفاسنا *** وأنت لنا الحكم القاهر\n\n\n> فشغلك بي شغل شاغل *** وأنت إذا ما انقضى خاسر\n\n\n> فإن كنت في ذاك عن أمره *** فأنت به الرابح التاجر\n\n\n> ومن فوقكم ثم من«1» فوقه *** إله لرتقكم فاطر\n\n\n> تعين بالفتق في رتقكم *** فعقلك في صنعه حائر\n\n\n> لذاك تدور وما تبرحن *** بمثواك والمقبل الغابر\n\n\n> فقف فأبى الجبر إلا السري *** وقال أنا الكاسر الجابر\n\n\n> سترت عيون النهي فانثنت *** وقد علمت أنني الساتر\n\n\n> فسبحان من حكمه حكمة *** ومن عينه الوارد الصادر\n> فلولاك ما لاح في أفقه *** بدورته كوكب زاهر\n\n\nولما خلق الله تعالى العالم واقتضت ذات العالم أن يستحيل بعضه لبعضه بما ركبه الله عليه من الحقائق والاستعداد لقبول الاستحالة طلب بذاته العوارض الإمكانية التي تراها في العالم فمن العالم من له قصد في ذلك الطلب وهو تعيين عارض خاص كقائم يطلب القعود ممن يعقل ومنهم من يطلبه من غير قصد كالشجرة تطلب السقي من أجل الثمرة التي خلقت لها وطلبها لذلك ذاتي على مقدار معلوم إن زاد على ذلك كان حكمه حكم نقصانه في الهلاك وما الماء بحكمها فلا بد من حافظ يحفظ عليها القدر المعلوم وليس إلا خالقها وهذه الأمور العوارض التي تعرض لجوهر العالم منها ما يقال فيه صلاح ومنه ما يقال فيه فساد ولكن في نفس الأمر لا يصح أن يعرض للعالم فساد لا صلاح فيه فإنه يكون خلاف ما أريد له وجوده وأما صلاح لا فساد فيه فهو الواقع المراد لصانع العالم فإنه لذلك خلق العالم وأما الأحوال فذاتية للمعاني فإنها أحكامها وليس لها وجود ولا هي معدومة كالأحمر لمن قامت به الحمرة وهذا حكم لا يتصف بالخلق لأنه معقول لا عين له في الوجود العيني بل المعاني كلها التي أوجبت أحكامها لمن اتصف بها نسب عدمية لا عين لها في الوجود ولها الحكم والحال ولا عين لحكمها ولا لحالها في الوجود فصار الحاكم والمحكوم به في الحقيقة أمورا عدمية مع أنها معقولة فعلى الحقيقة لا أثر لموجود في موجود وإنما الأثر للمعدوم في الموجود وفي المعدوم لأن الأثر للنسب كله وليست النسب إلا أمورا عدمية يظهر ذلك بالبديهة في أحكام المراتب كمرتبة السلطنة ومرتبة السوقية في النوع الإنساني مثلا فيحكم السلطان في السوقة بما تريد رتبة السلطانة وليس للسلطنة وجود عيني وإذا كان الحكم للمراتب فالأعيان التي من حقيقتها أن لا تكون على صورة طبيعية جسمية في نفسها إذا ظهرت لمن ظهرت له في صورة طبيعية جسدية في عالم التمثيل كالملك يتمثل بَشَراً سَوِيًّا وكالتجلي الإلهي في الصور فهل تقبل تلك الصورة الظاهرة في عين الرائي حكم ما لتلك الصورة في التي هي له حقيقة كصورة الإنسان والحيوان فتحكم عليه بالتفكر وقيام الآلام واللذات به فهل تلك الصورة التي ظهرت تشبه الحيوان أو الإنسان أو ما كان تقبل هذا الحكم في نفس الأمر أو الرائي إذا لم يعلم أنها إنسان أو حيوان ما له أن يحكم عليها بما يحكم علي من تلك الصورة عينه كيف الأمر في ذلك فاعلم إن الملك على صورة تخالف البشر في نفسه وعينه وكما تخالف البشر فقد خالفه أيضا البشر مثل جبريل ظهر بصورة أعرابي بكلامه وحركته المعتادة من تلك الصورة في الإنسان هي في الصورة الممثلة كما هي في الإنسان أو هي من الصورة كما هي الصورة متخيلة أيضا ويتبع تلك الصورة جميع أحكامها من القوي القائمة بها في الإنسان كما قام بها الكلام والحركة والكيفيات الظاهرة فهو في الحقيقة إنسان خيالي أعني الملك في ذلك الزمان وله حكم تلك الصورة في نفس الأمر أيضا على حد الصورة من كونها إنسانا خياليا فإذا ذهبت تلك الصورة ذهبت أحكامها لذهابها وسبب ذلك أن جوهر العالم في الأصل واحد لا يتغير عن حقيقته وأن كل صورة تظهر فيه فهي عارضة تستحيل في نفس الأمر في كل زمان فرد والحق يوجد الأمثال على الدوام لأنه الخالق على الدوام والممكنات في حال عدمها مهياة لقبول الوجود فمهما ظهرت صورة في ذلك الجوهر ظهرت بجميع أحكامها سواء كانت تلك الصورة محسوسة أو متخيلة فإن أحكامها تتبعها كما\n\n\nقال الأعرابي لما سمع رسول الله صَلَّى اللهُ عَليهِ وسَلَّم يصف الحق جل جلاله بالضحك قال لا نعدم خيرا من رب يضحك‏\n\n\nإذ من شأن من يضحك أن يتوقع منه وجود الخير فكما أتبع الصورة الضحك اتبعها وجود الخير منها وهذا في الجناب الإلهي فكيف في جوهر العالم ولا يهون مثل هذا عند عالم ولا يقبله متسع الخاطر إلا من عرف أن جوهر العالم هو النفس الرحماني الذي ظهرت فيه صور العالم ومن لم يعلم ذلك فإنه يدركه في نفسه تكلف ومشقة في قبول ذلك في حق الحق وحق كل ظاهر في صورة يعلم أنها ما هي له حقيقة فيتأول ويتعذر عليه في أوقات التأويل فيؤمن ويسلم ولا يدري كيف الأمر بخلاف العالم المحقق الذي قد أطلعه الله تعالى على ما هي الأمور عليه في أنفسها فالعالم كله من حيث جوهره شريف لا تفاضل فيه وإن الدودة والعقل الأول على السواء في فضل الجوهر وما ظهرت المفاضلة إلا في الصور وهي أحكام المراتب فشريف وأشرف ووضيع وأوضع ومن علم هذا هان عليه قبول جميع ما وردت به الشرائع من الأمور في حق الله والدار الآخرة\nوالأمور الغائبة التي لا تدركها العقول بأفكارها وليس لها مدرك إلا بالخير وليست الصور بشي‏ء غير أعيان الممكنات وليس جوهر العالم سوى ما ذكرنا فللإطلاق على العالم من حيث جوهره حكم لا يكون له من حيث صورته وله حكم من حيث صورته لا يكون له من حيث جوهره فمن الناس من علم ذلك على الكشف وهم أصحابنا والرسل والأنبياء والمقربون ومن الناس من وجد ذلك في قوته وفي عقله ولم يعرف من أين جاء ولا كيف حصل له فيشرك أهل الكشف في الحكم ولا يدري على التحقق ما هو الأمر وهم القائلون‏\n\n\nبالعلة والقائلون بالدهر والقائلون بالطبيعة وما عدى هؤلاء فلا خبر عندهم بشي‏ء من هذا الحكم كما إن هؤلاء الطوائف لا علم لهم بما يعلمه أهل الله وإن اشتركا في هذا الحكم فلو سألت علماء طائفة منهم ما أنكر لك عين ما أبانه أهل الله من ذلك وما حكم عليهم القول بذلك الحكم إلا ما عرفه أهل الله هم والقائلون بالعلة لا يشعرون أ لا ترى الشارع وهو المخبر عن الله ما وصف الحق بأمر فيه تفصيل إلا وهو صفة المحدث المخلوق مع قدم الموصوف به وهو الله ولا قدم للعقل في ذلك من حيث نظره وفكره وسبب ذلك لا يعرف أصله ولا يعلم أنه صورته في جوهر العالم بل يتخيل أنه عين الجوهر فإن أردت السلامة فاعبد ربا وصف نفسه بما وصف ونفى التشبيه وأثبت الحكم كما هو الأمر عليه لأن الجوهر ما هو عين الصورة فلا حكم للتشبيه عليه ولهذا قال لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ لعدم المشابهة فإن الحقائق ترمي بها وهُوَ السَّمِيعُ الْبَصِيرُ إثباتا للصور لأنه فصل حي فمن لم يعلم ربه من خبره عن نفسه فَقَدْ ضَلَّ ضَلالًا مُبِيناً وأدنى درجته أن يكون مؤمنا بالخبر في صفاته كما آمن إنه ليس كمثله شي‏ء وكلا الحكمين حق نظرا عقليا وقبولا والله يقول إِنَّهُ بِكُلِّ شَيْ‏ءٍ مُحِيطٌ وعلى كل شي‏ء حفيظ أ تراه يحيط به وهو خارج عنه ويحفظ عليه وجوده من غير نسبة إليه فقد تداخلت الأمور واتحدت الأحكام وتميزت الأعيان فقيل من وجه هذا ليس هذا عن زيد وعمرو وقيل من وجه هذا عين هذا عن زيد وعمرو وإنها إنسان كذلك نقول في العالم من حيث جوهره ومن حيث صورته كما قال الله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وهو يعني هذا الذي ليس كمثله شي‏ء وهُوَ السَّمِيعُ الْبَصِيرُ وحكم السمع ما هو حكم البصر ففصل ووصل وما انفصل ولا اتصل‏\n\n\n> فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ *** ومن شاء فيعجز ومن شاء فلينظر\n\n\n> فمن علم العلم الذي قد علمته *** حقيق عليه إن يسر وأن يشكر\n\n\n> إذا ناله التقوى فكن فطنا بما *** يقول لمن يدري بذلك ويشعر\n\n\n> وما قال هذا القول للخلق باطلا *** ولكنه ذكرى لمن شاء فليذكر\n\n\n> هو الحيرة العمياء لمن كان ذا عمى *** هو المنظر الأجلى لذي بصر يبصر\n\n\n> ولما ظهرنا في وجود عمائه *** علمنا وجود القرب فينا ولم نحصر\n\n\n### «وصل إشارة وتنبيه»\n\n\nاعلم أن كل متلفظ من الناس بحديث فإنه لا يتلفظ به حتى تخيله في نفسه ويقيمه صورة يعبر عنها لا بد له من ذلك ولما كان الخيال لا يراد لنفسه وإنما يراد لبروزه إلى الوجود الحسي في عينه أي يظهر حكمه في الحس فإن المتخيل قد يكون مرتبة وقد يكون ما يقبل الصورة الوجودية كمن يتخيل أن يكون له ولد فيولد له ولد فيظهر في عينه شخصا قائما مثله وقد يتخيل أن يكون ملكا وهي رتبة فيكون ملكا ولا عين للمملكة في الوجود وإنما هي نسبة وإذا كان هذا وكان ما يتخيل يعبر كالرؤيا كذلك يعبر كل كلام ويتأول فما في الكون كلام لا يتأول ولذلك قال ولِنُعَلِّمَهُ من تَأْوِيلِ الْأَحادِيثِ وكل كلام فإنه حادث عند السامع فمن التأويل ما يكون إصابة لما أراده المتكلم بحديثه ومن التأويل ما يكون خطأ عن مراد المتكلم وإن كان التأويل إصابة في كل وجه سواء أخطأ مراد المتكلم أو أصاب فما من أمر لا وهو يقبل التعبير عنه ولا يلزم في ذلك فهم السامع الذي لا يفهم ذلك الاصطلاح ولا تلك العبارة فإن علوم الأذواق والكيفيات وإن قبلت لانتقال ولكن لما كان القول بها والعبارة عنها لإفهام السامع لذلك قالوا ما ينقال ولا يلزم ما لا يفهم السامع المدرك له أن لا يصطلح مع نفسه على لفظ يدل به على ما ذاقه ليكون له ذلك اللفظ منبها ومذكرا له إذا نسي ذلك في وقت آخر وإن لم يفهم عنه من لا ذوق له فيه والتأويل عبارة عما يؤول إليه ذلك الحديث‏\nالذي حدث عنده في خياله وما سمي الإخبار عن الأمور عبارة ولا التعبير في الرؤيا تعبير إلا لكون المخبر يعبر بما يتكلم به أي يجوز بما يتكلم به من حضرة نفسه إلى نفس السامع فهو ينقله من خيال إلى خيال لأن السامع يتخيله على قدر فهمه فقد يطابق الخيال الخيال خيال السامع مع خيال المتكلم وقد لا يطابق فإذا طابق سمي فهما عنه وإن لم يطابق فليس يفهم ثم المحدث عنه قد يحدث عنه بلفظ يطابقه كما هو عليه في نفسه فحينئذ يسمى عبارة وإن لم يطابقه كان لفظا لا عبارة لأنه ما عبر به عن محله إلى محل السامع وسواء نسب ذلك الكلام إلى من نسب وإنما قصدنا بهذه الإشارة التنبيه على عظم رتبة الخيال وأنه الحاكم المطلق في المعلومات غير إن التعبير عن غير الرؤيا رباعي والتعبير عن الرؤيا ثلاثي أي في الرؤيا وهما من طريق المعنى على السواء وعين الفعل في الماضي في تعبير الرؤيا مفتوح وفي المستقبل مضموم ومخفف وهو في غير الرؤيا مضاعف في الماضي والمستقبل مفتوح العين في الماضي وتكسر في مستقبله وإنما كان التضعيف في غير الرؤيا للقوة في العبارة لأنها أضعف في الخيال من الرؤيا فإن المعبر في غير الرؤيا يعبر عن أمر متخيل في نفسه استحضره ابتداء وجعله كأنه يراه حسا فضعف عمن يعبر عن الخيال من غير فكر ولا استحضار كصاحب الرؤيا فإن الخيال هنالك أظهر له ما فيه من غير استحضار من الرائي والمتيقظ ليس كذلك فهو ضعيف التخيل بسبب حجاب الحس فاحتاج إلى القوة فضعف التعبير عنه فقيل عبر فلان عن كذا وكذا بكذا وكذا بتشديد عين الفعل أ لا ترى قولهم في عبور الوادي يقولون عبرت النهر أعبره من غير تضعيف لأن النهر هنا غير مستحضر بل هو حاضر في الحس كما كان ذلك حاضرا في الخيال من غير استحضار فاستعان بالتضعيف لما في الاستحضار من المشقة والاستعانة تؤذن بالتضعيف أبدا حيث ظهرت لأنه لا يطلب العون إلا من ليس في قوته مقاومة ذلك الأمر الذي يطلب العون عليه فكل ما لا يمكن الاستقلال به فإن العامل له لا بد أن يطلب العون والمعين على ذلك فافهم فإنه من هنا تعرف رتبة ما لا يمكن وجوده للموجد له إلا بمساعدة أمر آخر ما هو عين الموجد فذلك الأمر الآخر معين له على إظهار ذلك الأمر وهنا يظهر معنى قوله حَتَّى يَسْمَعَ كَلامَ الله إذا أراد الحق إيصاله إلى أذن السامع بالأصوات والحروف أو الإيماء والإشارة فلا بد من الواسطة إذ يستحيل عليه تعالى قيام الحوادث به فافهم وعَلَى الله قَصْدُ السَّبِيلِ وفي هذا المنزل من العلوم علم ما يفتقر إليه ولا يتصل به وفيه علم بيان الجمع أنه عين الفرق وفيه علم الفرق بين علم الخبر وعلم النظر العقلي وعلم النظر الكشفي وهو الذي يحصل بإدراك الحواس وفيه علم تنبيه الغافل بما ذا ينبه ومراتب التنبيه وفيه علم شرف العلم على شرف الرؤية فقد يرى الشخص شيئا ولا يدري ما هو فيقصه على غيره فيعلمه ذلك الغير ما هو وإن لم يره فالعلم أتم من الرؤية لأن الرؤية طريق من طرق العلم يتوصل بالسلوك فيه من هو عليه إلى أمر خاص وفيه علم ظهور الباطل في صورة الحق وهما على النقيض ومن المحال أن يظهر أمر في صورة أمر آخر من غير تناسب فهو مثله في النسبة لا مثله في العين وهذا هو في صناعة النحو فعل المقاربة يقولون في ذلك كاد النعام يطير وكاد العروس يكون أميرا والحق تعالى يظهر في عين الرائي السراب ماء وليس بماء وهو عنده إذا جاء إليه الظمآن وكذلك المعطش إلى العلم بالله يأخذ في النظر في العلم به فيفيده تقييد تنزيه أو تشبيه فإذا كشف الغطاء وهو حال وصول الظمآن إلى السراب لم يجده كما قيده فأنكره ووجد الله عنده غير مقيد بذلك التقييد الخاص بل له الإطلاق في التقييد فَوَفَّاهُ حِسابَهُ أي تقديره فكأنه أراد صاحب هذا الحال أن يخرج الحق من التقييد فقال له الحق بقوله فَوَفَّاهُ حِسابَهُ لا يحصل لك في هذا المشهد إلا العلم بي إني مطلق في التقييد فإنا عين كل تقييد لأني أنا العالم كله مشهود ومعلوم وهذا هو الكيد الإلهي من قوله وأَكِيدُ كَيْداً ومَكَرُوا ومَكَرَ الله وفيه علم ما هو مربوط بأجل لا يظهر حتى يبلغ الكتاب فيه أجله وفيه علم قيمة المثل وفيه علم تنزيه الأنبياء مما نسب إليهم المفسرون من الطامات مما لم يجي‏ء في كتاب الله وهم يزعمون أنهم قد فسروا كلام الله فيما أخبر به عنهم نسأل الله العصمة في القول والعمل فلقد جاءوا في ذلك بالكبر الكبائر كمسألة إبراهيم الخليل عليه السلام وما نسبوا إليه من الشك وما نظروا\n\n\nفي قول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم نحن أولى بالشك من إبراهيم‏\n\n\nفإن إبراهيم عليه السلام ما شك في إحياء الموتى ولكن لما علم إن لإحياء الموتى وجودها متعددة مختلفة لم يدر بأي وجه منها يكون يحيي الله به الموتى وهو مجبول على طلب العلم فعين الله‏\nله وجها من تلك الوجوه حتى سكن إليه قلبه فعلم كيف يحيي الله الموتى وكذلك قصة يوسف ولوط وموسى وداود ومحمد عليه السلام الإلهي وكذلك ما نسبوه في قصة سليمان إلى الملكين وكل ذلك نقل عن اليهود واستحلوا أعراض الأنبياء والملائكة بما ذكرته اليهود الذين جرحهم الله وملئوا كتبهم في تفسير القرآن العزيز بذلك وما في ذلك نص في كتاب ولا سنة فالله يعصمنا وإياكم من غلطات الأفكار والأقوال والأفعال أمين بعزته وقوته وفيه علم من قام الدليل على عصمته فله إن يثني على نفسه بما أعلمه الله أنه عليه من الصفات المحمودة فإنها من أعظم النعم الإلهية على عبده والله يقول وأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ وفيه علم التسليم والاعتصام وفيه علم رتبة الخيال وأنه حق ما فيه شي‏ء من الباطل إلا إن المعبر عنه يصيب ويخطئ بحسب ما يراه في نزوله بالمواطن فإن المصيب من لم يتعد بالحقائق مراتبها وفيه علم الأسماء وما عبد منها وما لم يعبد وفيه علم معرفة منازل الموجودات وفيه علم الستر والتجلي وفيه علم المفاضلة في العلم وفيه علم الشكر والشاكر وفيه علم الآيات المعتادة وغير المعتادة وفيه علم التبري والتنزيه وما هو تنزيه في حق الله عز وجل وهو تبري في حق المخلوق ولا تنزيه وفيه علم تقاسم أهل الله وطبقاتهم والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ انتهى السفر السادس والعشرون من الفتوح المكي بانتهاء الباب الثاني والسبعون وثلاثمائة بسم الله الرحمن الرحيم‏\n\n",
    "en": "Chapter 372: Concerning the Knowledge of the Station of a Secret and Two Secrets, and Your Self-Praise for That Which Is Not Yours, and the Response of the Real to You Concerning That, Due to the Meaning of the Honor Bestowed Upon You by the Muhammadan Presence.\n\nHe who possesses half of the Cosmos (al-kawn) in his creation (khalq),\nAnd the other half in his character (khuluq),\n\nThat one is the very essence of the Time (al-waqt) in its moment,\nAnd its rising full moon in its horizon.\n\nHis full moon rises from his West,\nAnd his light sets in his East.\n\nEvery creature (makhluq) is passionately devoted to him,\nAnd all of us perish in his Reality (haqq).\n\n[Indeed, the entire World is in the Utmost Beauty]\n\nIt is reported in the sound narration in *Sahih Muslim* from the Messenger of Allah, peace and blessings be upon him, that he said: \"Indeed Allah is Beautiful (Jamil) and loves Beauty (Jamal).\"\n\nHe, Exalted is He, is the Maker of the World (al-Alam) and brought it into existence upon His own Form (surah). Thus, the entire World is in the utmost beauty; there is nothing ugly within it. Rather, Allah has gathered all excellence (husn) and beauty for it. There is nothing more beautiful, more wondrous, or more excellent than the World in possibility (imkan), even if He were to bring into existence what He brought into existence unto infinity. It is the likeness of what He brought into existence, for it has attained and manifested the Divine excellence and beauty. This is because, as He, Exalted is He, said: <<He gave everything its creation>> (Q. 20:50). This is its beauty, for if anything were lacking from it, it would fall from the degree of the perfection of its creation and would thus be ugly. Then He guided, meaning He clarified that for us by His saying: <<He gave everything its creation.>>\n\nWhen we saw the Real (al-Haqq) in the form of humanity (al-bashar),\nWe knew that the intellect concerning Him is in danger.\n\nSo whoever restricts the Manifest Real with his intellect,\nAnd does not release the restriction, he has no knowledge.\n\nIf He discloses Himself to me in a form like mine,\nI disclose myself in Transcendence (Tenzih) from all other forms.\n\nIf He asks, \"What did you say?\" You mentioned to me,\nThat You forgive the oppressor if he triumphs.\n\n\"And You are not like me,\" I say, \"Then why did You choose my form?\nAnd my vision of You is like the moon being seen.\"\n\nIf You are like me, then similarity is a ruler,\nOver every like thing, as sight demands.\n\nFor every similar thing is congruent with its similar,\nIn every state, in the Eternal and in humanity.\n\nAllah has legislated prostration for our forgetfulness,\nBy humbling the devil and mending what was broken.\n\nSo why did You not prostrate, when You are our Imam?\nYou are worthy of prostration, as was mentioned.\n\nWe came to You striving, but You turned away, fleeing,\nAnd where is the path of the feet compared to the step of the sight?\n\nAnd from it also:\n\nBy whom did we separate, or by whom did we connect?\nAnd He is none other than Allah, by the essence (al-ayn) and the trace (al-athar).\n\nSo thanks for what He concealed, and thanks for what He manifested,\nAnd the servant who gives thanks attains an increase of good.\n\nAnd He is none other than the Real thanking Himself,\nBut the veil of proximity (al-qurb) was lowered, so He became concealed.\n\nThe entire World, therefore, has essential beauty (jamal dhati), and its excellence is its very essence, since its Maker fashioned it upon and for itself. This is why the Gnostics (al-Arifun) are passionately devoted to it, and those who realize love (mahabbah) have attained realization through it. This is why we said in some of our expressions concerning it that it is the mirror of the Real (mir’at al-Haqq). The Gnostics see nothing in it but the form of the Real. He, Glorified is He, is the Beautiful, and beauty is loved for its own sake. The awe (haybah) of Him in the hearts of those who behold Him is essential, thus generating both love and awe. Allah only multiplied the signs (ayat) for us in the World and in ourselves—since we are part of the World—so that we might turn our gaze toward Him through remembrance (dhikr), contemplation (fikr), intellect (aql), faith (iman), knowledge (ilm), hearing (sam), sight (basar), and inner core (lubb). He created us only to worship Him and know Him. He did not refer us in this matter to anything except contemplation of the World, having made it the very essence of the signs and indications (dalalat) leading to the knowledge of Him, both by witnessing (mushahadah) and by intellect. If we look, it is to Him; if we hear, it is from Him; if we intellectualize, it is about Him; if we contemplate, it is within Him; if we know, it is Him; and if we believe, it is in Him. He is the One who Self-discloses (al-Mutajalli) in every face, the Sought in every sign, the One looked upon by every eye, the Worshipped in every object of worship, and the Intended in the Unseen (al-Ghayb) and the Witnessed (al-Shuhud). No one among His creation loses Him by their innate nature (fitrah) or disposition (jillah). The entire World is praying to Him, prostrating to Him, and glorifying Him with His praise. Tongues speak of Him, hearts are passionately devoted and loving toward Him, and intellects are bewildered within Him. The Gnostics seek to separate Him from the World but cannot, and they seek to make Him the very essence of the World but cannot realize that. Thus, they are incapable, their understandings fail, their intellects are bewildered, and their tongues contradict themselves in expressing Him. At one time they say, \"He is,\" and at another, \"He is not,\" and at another, \"He is what He is not.\" They find no firm footing concerning Him, nor is a clear path made evident to them, because they witness Him as the very essence of the Sign and the Path. This witnessing prevents them from seeking the end of the Path, since the Path is only traversed toward its ends, and the Intended is with them—He is the Companion (al-Rafiq). Thus, there is neither traveler nor traveled, so the indications vanish, yet they are none other than Him, and the expressions fall away, yet they are none other than Him. Therefore, the Gnostic is not to be blamed for what he is passionately devoted to in the World, nor for what he imagines of the landmarks. If this matter were not as we have described, no Prophet or Messenger would have loved family or child, nor preferred one person over another. This is due to the differentiation of the signs, and the turning of the World is the very essence of the signs, which are none other than the affairs (shu’un) of the Real in which He is present. He has raised some of them <<above others in degrees>> (Q. 43:32), because He appeared in that form through His Names. Thus, we know the differentiation of some of them over others by generality and specificity. He is the Self-Sufficient (al-Ghani) above the worlds, and He is the One who said: <<And I did not create the jinn and mankind except to worship Me>> (Q. 51:56). So where is the Creator (al-Khaliq) compared to the Self-Sufficient? And where is the Withholder (al-Qabid) compared to Him, and the Preventer (al-Mani’)? And where is the All-Knowing (al-Alim) in His encompassing compared to the All-Powerful (al-Qadir) and the Dominant (al-Qahir)? Is all this not the very essence of what occurs in the World? No Messenger or Gnostic acts except within it, <<but most of mankind do not know>> (Q. 7:187). This is because some people have a deafness in their ears, a covering over their sight, a lock on their heart, bewilderment in their thought, and doubt in their knowledge, and deafness in their hearing. By Allah, all this, in the view of the Gnostic, is only due to excessive proximity (al-qurb al-mufrit): <<and We are nearer to him than you, but you do not see>> (Q. 56:85), and <<And We have already created man and know what his soul whispers to him, and We are nearer to him than [his] jugular vein>> (Q. 50:16). And where is whispering (waswasah) compared to inspiration (ilham)? And where is the name of man (al-insan) compared to the name of the World (al-Alam)?\n\nSo who is Layla, and who is Lubna?\nAnd who is Hind, and who is Buthayna?\n\nAnd who is Qays, and who is Bishr?\nAre they not all His essence (aynuhu)?\n\nI have become passionately devoted to Him,\nWhen the Cosmos (kawn) belonged to me.\n\nAll creation is my beloved,\nSo where is my passionately devoted one? Where is he?\n\nWhoever searches my saying,\nWill find in its midst, its midst.\n\nAs for the people of accidental beauty (al-jamal al-aradi) and accidental love, it is a vanishing shadow, a leaning purpose, and a crumbling wall. This is contrary to what is held by the Gnostics of Allah, for the shadow, in the view of the Gnostic, is prostrating, the accident of existence is prepared, and the wall only leaned in worship so that the treasures of Gnosis (ma’arif) beneath it might be revealed—treasures by which the standing Gnostic is enriched. Thus, Allah created Zeal (al-Ghayra) in the form of al-Khidr, who straightened the wall from its leaning when he knew that the owner of the property at that time was not worthy, and the action would be misused. <<And you will know its interpretation after a time>> (Q. 18:70). If it had been revealed, it would have been taken in vain, and hands would have tampered with it. Glory be to the Establisher of the decree, the Setter of the signs, and the Manifestor of the beauty of the indications!\n\nAmong the most beautiful in essence and the most perfect in existence is the World of Imagination (Alam al-Khayal). Through it, Allah sets forth similitudes (amthal). He, Exalted is He, clarified that He is the One singled out by His knowledge, for He said, forbidding: <<So do not coin similitudes for Allah. Indeed, Allah knows, and you do not know>> (Q. 16:74). He only brought this verse when He set forth similitudes for us from Himself, which appeared to the Cosmos, which is its introduction. Do you not see the vision (ru’ya)? By the very eye of the vision, Imagination is perceived. It sees what will be before its existence, what was, and what the present moment is upon. And what Presence (Hadra) do you find that contains this comprehensiveness except the Presence of Imagination?\n\nEveryone who is passionately devoted to something is only devoted to it after having attained it in his Imagination and established a likeness (mithal) for it in his estimation (wahm), and matched his beloved to that likeness. If the matter were not so, then when the one whose sight, hearing, or any of his senses were attached to the beloved departed, the attachment would depart. We do not find the matter to be so. This indicates that the beloved, in the eyes of the lover, is upon the likeness of a form that the lover established in his Imagination, necessitating its witnessing. Thus, his passion (wajd) doubled and his love increased. That likeness which he formed incites its former to seek the one who was formed upon its likeness, for that Origin (asl) is the spirit of this Imagination, and by it is its subsistence (baqa’), and it is the one that preserves it. The lover’s love only intensified in his own making and action, for the form by which he is devoted in his Imagination is from his own making. Thus, he only loved what returns to himself. He became attached to his own self and praised his own action. Whoever knows this understands Allah’s love for His servants.\n\nAnd that He, Exalted is He, is more intense in His love for them than they are for Him. Rather, they do not love Him essentially (aynan); they only love His beneficence (ihsan), for beneficence is what they witness. As for the one who loves Him essentially, he only loves a likeness that he formed within himself and imagined, and this is specific only to the Anthropomorphists (al-Mushabbihah). Every lover, were it not for analogy (tashbih), would not love Him, and were it not for imagination (takhayyul), would not be attached to Him. This is why the Lawgiver (al-Shari’) placed Him in his direction of prayer (qiblah) and made the heart of His servant encompass Him, and made Him, in terms of proximity, like the servant himself or like some of his parts. Such people worship Him as a likeness and witness Him as a realized entity.\n\nAs for the upholders of Transcendence (al-Munazzihah), they are bewildered in a blind darkness, stumbling blindly, having no shadow in their gloom, nor anything that prevents the evidence (dalil) from analogy. There is no faith whose light surpasses the light of the evidences so as to absorb them within it. Thus, the upholder of Transcendence remains grasping nothing and realizing no matter. They are the people of the house (ahl al-bayt) because their concern is scattered, and estimation (al-wahm) is far from them. Their deficiency from the perfection of the knowledge of Existence (al-wujud) is due to the rule of estimations over them, and estimations only rule over the perfect among men. This is why the Divine Laws (al-Shara’i’) came concerning Allah with matters that the evidences deem impossible.\n\nWhoever’s light of faith is stronger than the light of his intellect, just as the light of the sun is stronger than the light of other stars—it does not remove the essence of their lights, but rather absorbs them into its light—the World is entirely illuminated by the light of the sun and the light of the stars, but they only see the light of the sun and do not see the totality. Likewise, the Perfect One (al-Kamil) among the people of Allah, when the light of his intellect is absorbed into the light of his faith, he confirms the opinion of the upholders of Transcendence, since they did not exceed what their lights revealed to them, and he confirms the opinion of the Anthropomorphists, since they did not exceed the apparent meaning granted to them by the light of their faith through the similitudes Allah set forth for them. The Perfect One knows this by intellect and faith, thus attaining the degree of perfection, just as Imagination (al-Khayal) attained the degree of the sensible (al-hiss) and the intelligible (al-ma’na). It refined the sensible and solidified the intelligible, thus possessing complete power.\n\nThat is why Jacob said to his son: <<Do not relate your vision (ru’ya) to your brothers, lest they plot against you a plot>> (Q. 12:5), because he knew, from their knowledge, the interpretation (ta’wil) of what the Real represented to him in his vision. What he saw and what was represented to him was none other than the essence of his brothers and parents. Imagination established the forms of the brothers as stars and the forms of the parents as the sun and the moon, while all of them were flesh, blood, veins, and nerves. Look at this transition from the lower world to the world of the celestial spheres, and from the darkness of this physical structure to the light of that star. Thus, the dense was refined. Then He proceeded to the rank of precedence and high station and the abstract meanings, clothing them in the form of sensible prostration (sujud). Thus, He solidified their subtlety. The vision is one. Were it not for the power of this Presence (Hadra), what occurred would not have occurred. And were it not in the middle (al-wasat), it would not rule over the two extremes, for the middle rules over the two extremes because it is a boundary for them, just as the present moment is the essence of the past and the future.\n\nLikewise, the Perfect Human (al-Insan al-Kamil) is given a rank by Allah that is intermediate between His being established upon His Throne (istiwa’ ala arshihi) and His being in the heart that encompasses Him. He has a view of Him in his heart, seeing Him as the point of the circle, and he has a view of Him in His establishment upon His Throne, seeing Him as the circumference (muhit) of the circle. He encompasses everything (muhit bi-kull shay’). No line emerges from the point except that its end is at the circumference, and no line emerges from the circumference from within it except that its end is at the point. The lines are none other than the World, for He <<encompasses everything>> (Q. 4:126), and everything is in His grasp, and <<to Him all matters are returned>> (Q. 11:123). The void is not posited between the point and the circumference, and it is He who populated the World by His essence and existence. In it appeared the transformations from a point to a circumference and from a circumference to a point. Nothing, Exalted is He, departed from Him, nor is there anything outside the circumference that enters into His encompassing. Rather, everything emanated from Him and returns to Him, from Him it began and to Him it returns. His circumference is His Names (Asma’), and His point is His Essence (Dhat). Therefore, He is the One who is the Number and the One who is the Many. No eye looks upon Him except the eye of the human, and were it not for the human essence, the eye of the human would not look. By the human, the human looks, and by the Real, the Real appeared.\n\nSo we said concerning Him: Real,\nAnd we said concerning Him: Creation.\n\nAnd we said concerning Him: Pearl,\nAnd we said concerning Him: Truth.\n\nHe is the King (al-Malik) and the Dominion (al-Mulk),\nAnd He is the Sphere (al-Falak) and the Angel (al-Malak).\n\nAnd when I loved Him,\nHe said to love: \"Haita laka\" (I am prepared for you).\n\nMeaning, \"My form is excellent,\" for *haita laka* (I am prepared for you). Were it not for the excellence of the World, the excellence of the Eternal (al-Qadim) and His beauty would not be known. And were it not for the beauty of the Real, beauty would not appear in the World. The matter is circular (dawri), and by it the celestial sphere (al-falak) revolves. The revolution of the sphere is its striving, and it has not departed from its place. It is, in its totality, the moving entity that has not left its place—a divine warning to His servants, or the setting of a similitude, that the Real, even though He brought the World into existence and described Himself with what He described, has not ceased to be in the station of His Transcendence (Tenzih) and His distinction from His creation by His Essence, while being with every creature of His creation. This is contrary to the lines, for they move from the center and toward the center, thus departing and traversing stations. But the movement of the center has not departed from its station nor moved into another, and this is the wonder of the issues that have bewildered both the answerer and the questioner.\n\nO orbiting sphere,\nTo whom are you traveling in your course?\n\nTo us, for we are in your depths,\nTo Him, for your course is failing.\n\nHe is exalted above limitation in Himself,\nAnd said: He is the Inner (al-Batin) and the Outer (al-Zahir).\n\nYou revolve over us with our breaths,\nAnd you are the conquering ruler over us.\n\nYour occupation with me is a distracting occupation,\nAnd you are the loser when it is finished.\n\nBut if you are in that by His command,\nThen you are the profitable merchant by Him.\n\nAnd from above you, and then from above it,\nIs a God, the Originator (Fatir) of your mending.\n\nHe is determined by the splitting in your mending,\nSo your intellect is bewildered in His making.\n\nTherefore, you revolve and do not depart,\nFrom your dwelling, both the coming and the past.\n\nSo stop! But compulsion (al-jabr) refused except to travel,\nAnd said: I am the breaker and the mender.\n\nYou veiled the eyes of the prohibitions, so they turned back,\nAnd they knew that I am the Veiler (al-Satir).\n\nSo glory be to the One whose ruling is wisdom,\nAnd whose essence is the Incoming and the Outgoing.\nWere it not for you, no shining star would have appeared\nIn its horizon through its revolution.\n\nWhen Allah, Exalted is He, created the World, and the essence of the World necessitated that some of it transform into others, due to the realities (haqa’iq) and preparedness (isti’dad) for accepting transformation that Allah installed in it, it sought by its essence the possible accidents (al-awarid al-imkaniyya) that you see in the World. Some parts of the World have intention in that seeking, such as a standing person seeking sitting from one who understands. And some seek it without intention, such as a tree seeking water for the sake of the fruit for which it was created. Its seeking of that is essential, according to a known measure. If it exceeds that, its ruling is the same as its deficiency, leading to destruction. The water is not subject to its ruling, so there must be a preserver who maintains the known measure, and that is none other than its Creator.\n\nThese accidental matters that occur to the substance (jawhar) of the World—some are called rectification (salah) and some are called corruption (fasad). However, in reality, it is not valid for corruption to occur to the World without rectification in it, for that would be contrary to the purpose of its existence. As for rectification without corruption, that is the intended reality for the Maker of the World, for He created the World for that purpose.\n\nAs for the states (al-ahwal), they are essential to the meanings (al-ma’ani), for they are their rulings. They have no existence, nor are they non-existent, like redness for that in which redness subsists. This is a ruling that is not described as creation, because it is intelligible (ma’qul) and has no essential entity in concrete existence (al-wujud al-ayni). Rather, all the meanings that necessitate their rulings for those described by them are non-existent relations (nisab adamiyya) that have no essential entity in existence, yet they possess the ruling and the state. Neither their ruling nor their state has an essential entity in existence. Thus, the ruler and that by which the ruling is made are, in reality, non-existent matters, even though they are intelligible.\n\nIn truth, there is no effect of an existent upon an existent. Rather, the effect belongs to the non-existent upon the existent, and upon the non-existent, because the effect belongs entirely to the relations, and the relations are nothing but non-existent matters. This is evident by intuition in the rulings of the Levels (al-maratib), such as the level of sovereignty (al-saltanah) and the level of the common people (al-suqiyyah) in the human species, for example. The sovereign rules over the common people according to what the rank of sovereignty desires, yet sovereignty has no concrete existence.\n\nIf the ruling belongs to the Levels, then the essences (al-a’yan) whose reality is not to be in a natural bodily form in themselves—when they appear to someone in a natural bodily form in the World of Representation (Alam al-Tamthil), such as the angel representing himself as <<a man in perfect form>> (Q. 19:17), or the Divine Theophany (al-Tajalli al-Ilahi) in forms—does that apparent form in the eye of the beholder accept the ruling that belongs to that form in its reality, such as the form of a human or an animal? Does it accept the ruling of contemplation, or the subsistence of pains and pleasures within it? Does that form which appeared, whether resembling an animal or a human or whatever it may be, accept this ruling in reality? Or, if the beholder does not know that it is a human or an animal, is he entitled to rule over it with the same ruling he applies to the essence of that form? What is the matter concerning this?\n\nKnow that the angel, in its essence and entity, is in a form that differs from humanity. Just as it differs from humanity, humanity also differs from it. Gabriel appeared in the form of a Bedouin, with his speech and movement customary to that form in man. Is this customary movement in the represented form the same as it is in man? Or is it from the form, just as the form is also imagined? And does that form follow all its rulings, including the powers subsisting in it in man, just as speech, movement, and the apparent modalities subsisted in it? In reality, it is an imaginary human (insan khayali)—meaning the angel at that time—and it also possesses the ruling of that form in reality, according to the limit of the form being an imaginary human. When that form vanishes, its rulings vanish due to its vanishing.\n\nThe reason for this is that the substance (jawhar) of the World is fundamentally one and does not change from its reality, and every form that appears in it is an accident that transforms in reality in every single moment. The Real continuously brings forth similitudes because He is the Creator continuously, and the possibilities (al-mumkinat) in their state of non-existence are prepared to accept existence. Whenever a form appears in that substance, it appears with all its rulings, whether that form is sensible or imagined. Its rulings follow it, just as the Bedouin said when he heard the Messenger of Allah, peace and blessings be upon him, describe the Real, majestic is His glory, with laughter: \"We shall not be deprived of good from a Lord who laughs.\"\n\nSince it is the nature of one who laughs to be expected to bring forth good, just as the form was followed by laughter, it was followed by the existence of good from it. This is in the Divine Presence. So how is it in the substance of the World? Such a matter is not taken lightly by a Gnostic, nor is it accepted by one of broad mind, unless he knows that the substance of the World is the Breath of the All-Merciful (al-Nafas al-Rahmani) in which the forms of the World appeared. Whoever does not know this finds strain (takalluf) and difficulty within himself in accepting this concerning the Real and concerning every entity that appears in a form which he knows is not its reality. He resorts to interpretation (ta’wil), and at times interpretation becomes difficult for him, so he believes and submits, but does not know how the matter truly stands. This is contrary to the realized Gnostic (al-alim al-muhaqqiq) whom Allah has informed of the true nature of things.\n\nThe entire World, in terms of its substance, is noble, with no differentiation within it. The worm and the First Intellect (al-Aql al-Awwal) are equal in the excellence of the substance. Differentiation only appeared in the forms, which are the rulings of the Levels (al-maratib): noble and nobler, base and baser. Whoever knows this finds it easy to accept all matters concerning Allah and the Hereafter (al-Dar al-Akhirah) and the unseen matters that intellects cannot grasp through their thoughts, and which have no perception except through revelation (al-khabar).\n\nThe forms are nothing other than the essences of the possibilities (a’yan al-mumkinat), and the substance of the World is nothing other than what we mentioned. The attribution of absolute quality (al-itlaq) to the World from the perspective of its substance has a ruling that it does not have from the perspective of its form, and it has a ruling from the perspective of its form that it does not have from the perspective of its substance. Some people know this through Unveiling (al-Kashf)—these are our companions, the Messengers, the Prophets, and the Intimates (al-Muqarrabun). And some people find this in their power and their intellect but do not know where it came from or how it was attained. They share the ruling with the People of Unveiling but do not know the verified reality of the matter. These are those who speak of causality (al-illah), those who speak of time (al-dahr), and those who speak of nature (al-tabi’ah). Apart from these groups, they have no knowledge of any of this ruling, just as these groups have no knowledge of what the People of Allah know, even if they share this ruling.\n\nIf you were to ask the scholars of any of these groups, they would not deny the very thing that the People of Allah have clarified concerning this, yet the ruling was imposed upon them by what the People of Allah know, while those who speak of causality are unaware. Do you not see that the Lawgiver, who reports about Allah, did not describe the Real with any detailed matter except that it is an attribute of the originated (al-muhdath) creature, despite the eternity (qidam) of the One described by it, who is Allah? The intellect has no precedence in this from the perspective of its contemplation and thought. The reason for this is that its origin is unknown, and it is not known that it is its form in the substance of the World. Rather, it imagines that it is the very essence of the substance.\n\nIf you desire safety, worship a Lord who described Himself with what He described, negated analogy (tashbih), and affirmed the ruling as it truly is, because the substance is not the essence of the form, so the ruling of analogy does not apply to it. This is why He said: <<There is nothing like unto Him>> (Q. 42:11), due to the absence of similarity, for the realities reject it, and <<He is the All-Hearing, the All-Seeing>> (Q. 42:11), affirming the forms, because He is a living separation. Whoever does not know his Lord from His own report about Himself <<has strayed into manifest error>> (Q. 4:116). The lowest degree is to be a believer in the report concerning His attributes, just as he believes that there is nothing like unto Him. Both rulings are true, from the perspective of intellectual contemplation and acceptance.\n\nAllah says: <<Indeed, He encompasses everything>> (Q. 41:54) and <<He is over everything a Guardian>> (Q. 34:21). Do you think He encompasses it while being outside of it, and guards its existence without relation to it? Matters have thus intertwined, rulings have unified, and essences have been distinguished. So, from one perspective, it is said, \"This is not that,\" concerning Zayd and Amr, and from another perspective, it is said, \"This is the essence of that,\" concerning Zayd and Amr, and they are both human. Likewise, we say concerning the World from the perspective of its substance and from the perspective of its form, just as Allah said: <<There is nothing like unto Him>>—and He means this very thing that is nothing like unto Him—<<And He is the All-Hearing, the All-Seeing.>> The ruling of hearing is not the ruling of sight, so He separated and connected, yet He neither separated nor connected.\n\nSo let him who wills believe, and let him who wills disbelieve,\nAnd let him who wills be incapable, and let him who wills contemplate.\n\nWhoever knows the knowledge that I have known,\nIt is incumbent upon him to be joyful and to give thanks.\n\nIf piety reaches him, then be astute concerning what\nHe says to him who knows and perceives that.\n\nHe did not speak this saying to creation in vain,\nBut it is a reminder for him who wills to remember.\n\nIt is the blind bewilderment for him who is blind,\nIt is the clearest vision for him who has sight and sees.\n\nAnd when we appeared in the existence of His cloud (ama’),\nWe knew the existence of proximity within us, and we were not confined.\n\nA Connection: Indication and Warning\n\nKnow that every person who utters a saying does not utter it until he imagines it within himself and establishes it as a form that he expresses. This is necessary for him. Since Imagination (al-Khayal) is not desired for its own sake, but rather for its manifestation into sensible existence (al-wujud al-hissi) in its entity—meaning its ruling appears in the sensible—the imagined thing may be a Level (martabah) or it may be something that accepts the existential form. For example, one imagines having a child, and a child is born to him, appearing in his sight as a standing person like himself. Or one imagines being a king, which is a Level, and he becomes a king, yet kingship has no essential entity in existence; it is only a relation (nisbah).\n\nSince this is the case, and since what is imagined is expressed, like the vision (ru’ya), every speech is likewise expressed and interpreted (yata’awwal). There is no speech in the Cosmos that is not interpreted. That is why He said: <<And that We might teach him the interpretation of sayings (ta’wil al-ahadith)>> (Q. 12:21). Every speech is originated (hadith) in the presence of the listener. Some interpretation is an accurate hitting upon what the speaker intended by his saying, and some interpretation is an error concerning the speaker’s intention, even though the interpretation is accurate in every respect, whether it missed the speaker’s intention or hit it. There is no matter that does not accept expression. It is not necessary in this that the listener who does not understand that terminology or that expression should understand it.\n\nAlthough the sciences of spiritual tastes (adhwaq) and modalities (kayfiyyat) accept transmission, when speaking of them and expressing them is for the purpose of making the listener understand, they said, \"What cannot be said.\" It is not necessary that the listener who does not understand it should not agree with himself upon a word by which he indicates what he has tasted, so that this word may be a reminder and a prompter for him if he forgets it at another time, even if one who has no taste for it does not understand him.\n\nInterpretation (al-ta’wil) is an expression of that to which the saying ultimately returns (ya’ul) in his Imagination. Reporting about matters was only called expression (*ibarah*), and the interpretation of dreams was only called interpretation (*ta’bir*), because the reporter crosses (*ya’bur*) with what he speaks—meaning he passes with what he speaks—from the presence of his own self to the self of the listener. Thus, he transfers it from one Imagination to another, because the listener imagines it according to his understanding. The Imagination of the listener may correspond to the Imagination of the speaker, or it may not. If it corresponds, it is called understanding from him. If it does not correspond, he does not understand.\n\nFurthermore, the subject of the report may be reported with a word that corresponds to it as it is in itself. In that case, it is called expression (*ibarah*). If it does not correspond, it is a word but not an expression, because it did not cross (*abara*) from its locus to the locus of the listener. Whether that speech is attributed to whomever it is attributed, our intention with this indication is to draw attention to the greatness of the rank of Imagination (al-Khayal) and that it is the absolute ruler over all known things. However, the expression of non-vision is quadriliteral, and the expression of vision is triliteral—meaning in the vision. They are equal in terms of meaning. The verb form in the past tense for the interpretation of vision is open-voweled, and in the future tense, it is closed-voweled and lightened. In non-vision, it is doubled in the past and future, open-voweled in the past, and broken-voweled in its future.\n\nThe doubling (tadh’if) in non-vision is due to the strength required in the expression, because it is weaker in Imagination than the vision. The interpreter of non-vision expresses a matter imagined within himself that he summoned initially, making it as if he sees it sensibly. Thus, he is weaker than one who expresses Imagination without thought or summoning, like the dreamer, for Imagination there revealed to him what was within it without summoning by the seer. The waking person is not like that; he is weak in imagination due to the veil of the senses, so he needed strength. Thus, the expression concerning it was doubled. It is said, \"So-and-so expressed (*abbara*) such-and-such by such-and-such,\" with the doubling of the middle letter of the verb. Do you not see their saying concerning crossing the valley: \"I crossed (*abartu*) the river, I cross it (*a’buru*),\" without doubling? This is because the river here is not summoned; it is present in the sensible, just as the vision was present in the Imagination without summoning. So, he sought assistance through doubling due to the difficulty in summoning. Seeking assistance always indicates doubling wherever it appears, because help is only sought by one who lacks the power to resist the matter for which help is sought. Everything that cannot be accomplished independently requires the agent to seek help and an assistant for it. Understand this, for from here you will know the rank of that whose existence for its originator is impossible except with the assistance of another matter that is not the essence of the originator. That other matter is an assistant to him in manifesting that matter.\n\nHere appears the meaning of His saying: <<Until he hears the Word of Allah>> (Q. 9:6). If the Real intends to convey it to the ear of the listener through sounds and letters, or through gesture and indication, a medium (wasitah) is necessary, since it is impossible for Him, Exalted is He, to be the locus of originated events (al-hawadith). Understand this. <<And upon Allah is the direction of the path>> (Q. 16:9).\n\nIn this station (manzil) are sciences: the knowledge of what is needed but not connected to; the knowledge of the clarification that the gathering (al-jam’) is the essence of the separation (al-farq); the knowledge of the difference between the knowledge of revelation (ilm al-khabar), the knowledge of intellectual contemplation (ilm al-nazar al-aqli), and the knowledge of unveiled contemplation (ilm al-nazar al-kashfi), which is attained through the perception of the senses; the knowledge of how the heedless person is warned and the levels of warning; the knowledge of the nobility of knowledge over the nobility of sight. A person may see something and not know what it is, so he relates it to another, and that other informs him what it is, even though he did not see it. Thus, knowledge is more complete than sight, because sight is one of the paths of knowledge, by traversing which one reaches a specific matter.\n\nIn it is the knowledge of the appearance of falsehood (al-batil) in the form of the Real (al-Haqq), though they are opposites. It is impossible for one matter to appear in the form of another matter without proportionality. It is similar to it in relation, not similar to it in essence. This is in the science of grammar, the verb of approximation. They say concerning this: \"The ostrich almost flew,\" and \"The groom almost became a prince.\" The Real, Exalted is He, appears in the eye of the beholder as a mirage (sarab) that is water, but it is not water. It is with Him when the thirsty one comes to it. Likewise, the one thirsty for the knowledge of Allah begins to contemplate the knowledge of Him, which benefits him by restricting Transcendence (tenzih) or Analogy (tashbih). When the veil is lifted—which is the state of the thirsty one reaching the mirage—he does not find it as he restricted it, so he denies it. He finds Allah with him, not restricted by that specific restriction, but rather possessing absolute quality (al-itlaq) within the restriction. <<So He paid him his account in full>> (Q. 24:39), meaning His estimation. It is as if the person in this state intended to remove the Real from restriction, but the Real said to him through His saying: <<So He paid him his account in full>>: \"You will not attain in this witnessing except the knowledge of Me, that I am absolute within restriction, because I am the essence of every restriction, for I am the entire World, witnessed and known.\" This is the Divine plotting (al-kayd al-ilahi) from His saying: <<And I plot a plot>> (Q. 86:16) and <<They plotted, and Allah plotted>> (Q. 3:54).\n\nIn it is the knowledge of what is bound by a term (ajal) and does not appear until the Book reaches its term concerning it. In it is the knowledge of the value of the similitude (al-mithal). In it is the knowledge of the transcendence (tenzih) of the Prophets from the enormous calamities attributed to them by the commentators, which did not come in the Book of Allah, yet they claim they have interpreted the Word of Allah concerning what He reported about them. We ask Allah for infallibility (al-ismah) in speech and action. They have indeed committed the greatest of major sins in this, such as the issue of Abraham the Intimate (al-Khalil), peace be upon him, and the doubt they attributed to him. They did not contemplate the saying of the Messenger of Allah, peace and blessings be upon him: \"We are more entitled to doubt than Abraham.\"\n\nAbraham, peace be upon him, did not doubt the resurrection of the dead, but when he knew that the existence of the resurrection of the dead is multiple and varied, he did not know by which aspect Allah would resurrect the dead. Since he was naturally disposed to seek knowledge, Allah specified for him one aspect of those aspects until his heart was reassured, and he knew how Allah resurrects the dead. Likewise, the story of Joseph, Lot, Moses, David, and Muhammad, peace be upon them, concerning the Divine. Likewise, what they attributed in the story of Solomon to the two angels. All of this was transmitted from the Jews, and they violated the honor of the Prophets and angels by what the Jews—whom Allah condemned—mentioned, filling their books of commentary on the Glorious Quran with it, though there is no text for it in the Book or the Sunnah. May Allah protect us and you from the errors of thoughts, sayings, and actions. Amen, by His might and power.\n\nIn it is the knowledge of one whose infallibility is established by evidence, so he is entitled to praise himself for the praiseworthy attributes that Allah informed him he possesses, for they are among the greatest Divine favors upon His servant. Allah says: <<But as for the favor of your Lord, report [it]>> (Q. 93:11).\n\nIn it is the knowledge of submission (taslim) and adherence (i’tisam). In it is the knowledge of the rank of Imagination (al-Khayal) and that it is Real (haqq), containing nothing of falsehood, except that the one who expresses it may be correct or mistaken according to what he sees in its descent into the stations. The correct one is he who does not transgress the realities beyond their Levels (maratib). In it is the knowledge of the Names (al-Asma’) and which of them are worshipped and which are not. In it is the knowledge of the stations of existent things (manazil al-mawjudat). In it is the knowledge of Concealment (al-Satr) and Theophany (al-Tajalli). In it is the knowledge of differentiation in knowledge (al-mufadalah fi al-ilm). In it is the knowledge of gratitude (al-shukr) and the grateful one (al-shakir). In it is the knowledge of customary and non-customary signs (al-ayat). In it is the knowledge of disavowal (al-tabarri) and transcendence (al-tenzih), and what is transcendence concerning Allah, Exalted and Majestic, is disavowal concerning the creature, and not transcendence. In it is the knowledge of the division of the People of Allah and their classes.\n\nAnd Allah <<speaks the Truth, and He guides to the way>> (Q. 33:4).\n\nEnd of the Twenty-Sixth Section (Safar) of *Al-Futuhat al-Makkiyya*, concluding Chapter 372. In the Name of Allah, the Most Gracious, the Most Merciful.",
    "ur": "باب نمبر تین سو بہتر: ایک راز اور دو رازوں کے مقام کی معرفت، اور تمہارا اپنے آپ پر اس چیز کے ساتھ ثنا کرنا جو تمہاری نہیں ہے، اور اس معاملے میں الحق (ذات حق) کا تمہیں جواب دینا، اس شرف کے معنی کی بنا پر جو تمہیں حضرة محمدية (محمدی حضور) سے عطا ہوا ہے۔\n\nجس نے اپنی تخلیق میں کائنات کا ایک حصہ حاصل کیا،\nاور اپنی خُلق (اخلاق) میں اس کا دوسرا حصہ۔\n\nپس وہی اپنے وقت میں وقت کی عین (حقیقت) ہے،\nاور اپنے افق پر طلوع ہونے والا بدر (چودھویں کا چاند) ہے۔\n\nاس کا بدر اس کے مغرب سے طلوع ہوتا ہے،\nاور اس کا نور اس کے مشرق میں غروب ہوتا ہے۔\n\nپس ہر مخلوق اس پر فریفتہ ہے،\nاور ہم سب اس کے حق (سچائی) میں فنا ہوتے ہیں۔\n\n### [بے شک سارا عالم جمال کی انتہا پر ہے]\n\nصحیح مسلم میں رسول اللہ صلی اللہ علیہ وسلم سے صحیح خبر میں آیا ہے کہ آپ نے فرمایا: \"بے شک اللہ جمیل (خوبصورت) ہے اور جمال (خوبصورتی) کو پسند کرتا ہے۔\"\n\nاور وہ (الحق) تعالیٰ عالم کا صانع ہے اور اسے اپنی صورت پر وجود بخشا ہے۔ پس سارا عالم جمال کی انتہا پر ہے، اس میں کوئی چیز قبیح (بدصورت) نہیں ہے، بلکہ اللہ نے اس کے لیے تمام حسن اور جمال جمع کر دیا ہے۔ اور امکان میں عالم سے زیادہ جمیل، زیادہ بدیع، اور زیادہ حسین کوئی چیز نہیں ہے، خواہ وہ جو کچھ بھی وجود میں لائے، لامتناہی تک، وہ اس کے مماثل ہی ہوگا جسے اس نے وجود بخشا، کیونکہ اس نے حسن الٰہی اور جمال کو حاصل کیا اور اس کے ذریعے ظاہر ہوا۔ کیونکہ جیسا کہ اللہ تعالیٰ نے فرمایا: **\"اس نے ہر چیز کو اس کی تخلیق عطا کی\"** (طه: ۵۰)۔ پس یہی اس کا جمال ہے، کیونکہ اگر اس میں سے کوئی چیز کم ہو جاتی تو وہ اپنی تخلیق کے کمال کے درجے سے نیچے آ جاتا اور قبیح ہو جاتا۔ پھر اس نے ہدایت دی، یعنی ہمارے لیے یہ واضح کیا، اپنے اس قول سے: **\"اس نے ہر چیز کو اس کی تخلیق عطا کی\"** (طه: ۵۰)۔\n\nاور جب ہم نے الحق (ذات حق) کو بشر کی صورت میں دیکھا،\nتو ہم نے جان لیا کہ عقل اس میں خطرے میں ہے۔\n\nپس جس نے الحق المبين (واضح حق) کو اپنی عقل سے مقید کیا،\nاور اس تقیید کو مطلق نہ کیا، اسے کوئی خبر نہیں۔\n\nجب وہ مجھ پر میری ہی صورت کی مانند التجلی (ظہور) فرماتا ہے،\nتو میں تمام صورتوں سے تنزیہ میں ظاہر ہوتا ہوں۔\n\nاگر وہ کہے: تم نے کیا کہا؟ تم نے تو مجھے بتایا تھا،\nکہ تم ظالم کو معاف کر دیتے ہو جب وہ غالب آ جائے۔\n\nاور تم میرے جیسے نہیں ہو، کہو! پھر میری صورت کیوں جھک گئی؟\nاور میرا تمہیں دیکھنا ایسا ہے جیسے چاند کو دیکھا جاتا ہے۔\n\nاگر تم میرے جیسے ہو، تو مماثلت حاکم ہے،\nہر مثل پر، جیسا کہ نظر کا تقاضا ہے۔\n\nپس ہر شبیہ (مشابہ چیز) شبیہ کے ساتھ موافق ہے،\nہر حال میں، قدیم میں اور بشر میں۔\n\nبے شک اللہ نے ہمارے سہو (بھول) کے لیے سجدہ مشروع کیا،\nشیطان کو ذلیل کرنے اور ٹوٹی ہوئی چیز کو جوڑنے کے لیے۔\n\nتو تمہیں کیا ہوا کہ تم نے سجدہ نہیں کیا، حالانکہ تم ہمارے امام ہو؟\nپس تم سجدے کے زیادہ لائق ہو جیسا کہ ذکر کیا گیا۔\n\nہم تمہاری طرف دوڑتے ہوئے آئے، تو تم نے مہر (دلہن) کی طرح ناز کیا،\nاور قدموں کے نشان بصارت کے قدم سے کہاں؟\n\nاور اس میں سے یہ بھی ہے:\n\nپس کس نے ہمیں جدا کیا یا کس نے ہمیں وصل کیا؟\nاور وہ آنکھ اور اثر میں اللہ کے سوا کوئی نہیں۔\n\nپس شکر ہے اس کا جو پوشیدہ رہا اور شکر ہے اس کا جو ظاہر ہوا،\nاور اس بندے نے خیر کی زیادتی حاصل کی جس نے شکر کیا۔\n\nاور وہ الحق (ذات حق) کے سوا کوئی نہیں جو اپنا شکر کرتا ہے،\nلیکن قرب (نزدیکی) کا حجاب بھیجا گیا تو وہ پوشیدہ ہو گیا۔\n\nپس عالم کا سارا جمال ذاتی ہے اور اس کا حسن اس کی عین ذات ہے، کیونکہ اس کے صانع نے اسے اسی پر بنایا ہے۔ اسی لیے عارفین اس پر فریفتہ ہوئے اور متحققین نے اس کی محبت کو حاصل کیا۔ اسی لیے ہم نے اس کے بارے میں اپنی بعض عبارات میں کہا ہے کہ یہ الحق (ذات حق) کا آئینہ ہے۔ پس عارفین نے اس میں الحق کی صورت کے سوا کچھ نہیں دیکھا۔ اور وہ سبحانہ الجمیل (خوبصورت) ہے، اور جمال اپنی ذات کے لیے محبوب ہے، اور اس کی ہیبت دیکھنے والوں کے دلوں میں ذاتی ہے۔ پس اس نے محبت اور ہیبت کو وراثت میں دیا۔ اور اللہ نے عالم میں اور ہمارے نفوس میں ہمارے لیے آیات (نشانیاں) کی کثرت نہیں کی، کیونکہ ہم عالم کا حصہ ہیں، مگر اس لیے کہ ہم اپنی نظر کو اس کی طرف پھیریں، ذکر، فکر، عقل، ایمان، علم، سمع، بصر، نہی اور لب (عقل) کے ذریعے، اور اس نے ہمیں صرف اپنی عبادت اور معرفت (پہچان) کے لیے پیدا کیا۔ اور اس نے ہمیں اس معاملے میں کسی چیز پر نہیں ڈالا مگر عالم میں غور و فکر کرنے پر، کیونکہ اس نے اسے علم کے لیے مشاہدہ اور عقل کے ذریعے آیات اور دلالات (رہنمائیوں) کی عین بنا دیا ہے۔ پس اگر ہم دیکھتے ہیں تو اسی کی طرف، اور اگر ہم سنتے ہیں تو اسی سے، اور اگر ہم عقل کرتے ہیں تو اسی کے بارے میں، اور اگر ہم فکر کرتے ہیں تو اسی میں، اور اگر ہم جانتے ہیں تو اسی کو، اور اگر ہم ایمان لاتے ہیں تو اسی کے ذریعے۔ پس وہ ہر چہرے میں التجلی (ظہور) کرنے والا ہے، اور ہر آیت سے مطلوب ہے، اور ہر آنکھ سے دیکھا جانے والا ہے، اور ہر معبود میں معبود ہے، اور غیب و شہود (ظاہر و باطن) میں مقصود ہے۔ کوئی بھی مخلوق اسے اپنی فطرت اور جبلت کے ذریعے نہیں کھوتی۔ پس سارا عالم اس کے لیے نماز پڑھنے والا ہے اور اسی کے لیے سجدہ کرنے والا ہے، اور اسی کی حمد کے ساتھ تسبیح کرنے والا ہے۔ پس زبانیں اسی سے گویا ہیں، اور دل اسی پر فریفتہ اور عاشق ہیں، اور عقلیں اس میں حیران ہیں۔ عارفین چاہتے ہیں کہ اسے عالم سے جدا کر دیں تو وہ قادر نہیں ہوتے، اور وہ چاہتے ہیں کہ اسے عین عالم بنا دیں تو وہ اس میں متحقق نہیں ہو پاتے، پس وہ عاجز ہو جاتے ہیں۔ ان کی فہمیں تھک جاتی ہیں، ان کی عقلیں حیران ہو جاتی ہیں، اور ان کی زبانیں اس کے بارے میں تعبیر میں متناقض ہو جاتی ہیں۔ پس وہ ایک وقت کہتے ہیں کہ وہ ہے، اور ایک وقت کہتے ہیں کہ وہ نہیں ہے، اور ایک وقت کہتے ہیں کہ وہ وہی ہے جو نہیں ہے۔ پس ان کا قدم اس میں مستحکم نہیں ہوتا اور نہ ہی ان کے لیے کوئی واضح راستہ کھلتا ہے، کیونکہ وہ اسے عین آیت اور راستہ کے طور پر دیکھتے ہیں، اور یہ مشاہدہ ان کے اور راستے کی انتہا کی طلب کے درمیان حائل ہو جاتا ہے، کیونکہ راستہ صرف اپنی انتہاؤں تک ہی طے کیا جاتا ہے، اور مقصود ان کے ساتھ ہے، اور وہی رفیق ہے۔ پس نہ کوئی سالک ہے اور نہ کوئی مسلوک (جس پر چلا جائے)، پس اشارات ختم ہو جاتے ہیں حالانکہ وہ اس کے سوا نہیں ہیں، اور عبارات گر جاتی ہیں حالانکہ وہ اس کے سوا نہیں ہیں۔ پس عارف پر اس چیز میں انکار نہیں کیا جائے گا جس پر وہ عالم میں فریفتہ ہوتا ہے اور جن معالم (نشانات) کا وہ وہم کرتا ہے۔ اور اگر یہ معاملہ ایسا نہ ہوتا جیسا کہ ہم نے ذکر کیا، تو کسی نبی یا رسول نے کسی اہل یا اولاد سے محبت نہ کی ہوتی، اور نہ ہی کسی کو کسی پر ترجیح دی ہوتی۔ اور یہ آیات کے تفاضل (برتری) کی وجہ سے ہے، اور عالم کا پلٹنا عین آیات ہے، اور یہ الحق کے ان شؤون (معاملات) کے سوا کچھ نہیں جن میں وہ ہے، اور اس نے بعض کو **\"بعض پر درجات میں بلند کیا\"** (البقرہ: ۲۵۳)، کیونکہ وہ اس صورت کے ذریعے اپنے اسماء میں ظاہر ہوا، پس ہم نے ان میں سے بعض کی بعض پر عموم اور خصوص کے لحاظ سے برتری کو جانا۔ پس وہ عالمین سے غنی ہے، اور وہی فرمانے والا ہے: **\"اور میں نے جنوں اور انسانوں کو صرف اس لیے پیدا کیا کہ وہ میری عبادت کریں\"** (الذاریات: ۵۶)۔ پس خالق غنی سے کہاں ہے؟ اور قابض اور مانع اس سے کہاں ہیں؟ اور عالم اپنے احاطے میں قادر اور قاہر سے کہاں ہے؟ پس کیا یہ سب کچھ عین وہی نہیں جو عالم میں واقع ہوا؟ پس نہ کسی رسول نے تصرف کیا اور نہ کسی عارف نے مگر اسی میں، **\"لیکن اکثر لوگ نہیں جانتے\"** (الاعراف: ۱۸۷)۔ اور یہ اس لیے ہے کہ لوگوں میں سے بعض کے کانوں میں بوجھ ہے، اور ان کی آنکھوں پر پردہ ہے، اور ان کے دل پر قفل ہے، اور ان کی فکر میں حیرت ہے، اور ان کے علم میں شبہ ہے، اور ان کے کانوں میں بہرا پن ہے۔ اور واللہ! عارف کے نزدیک یہ سب کچھ مفرط قرب (حد سے زیادہ نزدیکی) کی وجہ سے ہے: **\"اور ہم تم سے زیادہ اس کے قریب ہیں لیکن تم نہیں دیکھتے\"** (الواقعہ: ۸۵)، اور **\"اور ہم نے انسان کو پیدا کیا اور ہم جانتے ہیں جو اس کا نفس اسے وسوسہ دیتا ہے، اور ہم اس کی شہ رگ سے بھی زیادہ اس کے قریب ہیں\"** (ق: ۱۶)۔ اور وسوسہ الہام سے کہاں ہے؟ اور انسان کا نام عالم کے نام سے کہاں ہے؟\n\nپس لیلیٰ کون ہے اور لبنیٰ کون ہے؟\nاور ہند کون ہے اور بثنہ کون ہے؟\n\nاور قیس کون ہے اور بشر کون ہے؟\nکیا وہ سب اس کی عین (حقیقت) نہیں ہیں؟\n\nمیں اس پر مشغوف ہو گیا ہوں،\nجب اس کی کائنات میری ہو گئی۔\n\nپس ساری مخلوق میری محبوب ہے،\nتو میرا فریفتہ کہاں ہے؟ وہ کہاں ہے؟\n\nپس جو میرے قول پر بحث کرے گا،\nوہ اپنے درمیان میں اس کا درمیان پائے گا۔\n\nاور جہاں تک جمال عرضی اور حب عرضی کے قائلین کا تعلق ہے، تو وہ زائل ہونے والا سایہ، مائل ہونے والا مقصد، اور مائل ہونے والی دیوار ہے، بخلاف اس کے جو علماء باللہ کے نزدیک ہے۔ کیونکہ عالم باللہ کے نزدیک سایہ سجدہ کرنے والا ہے، اور وجود کے لیے عارض (عارضی چیز) تیار ہے، اور دیوار صرف عبادت کے لیے مائل ہوئی تاکہ اس کے نیچے معرفتوں کے وہ خزانے ظاہر ہوں جن سے واقف عارف غنی ہو جائے۔ پس اللہ نے غیرت کو خضر کی صورت میں پیدا کیا، اور اسے اس کے جھکاؤ سے کھڑا کیا، جب اسے معلوم ہوا کہ اس وقت مال کے مالک میں اہلیت نہیں پائی گئی، تاکہ اس میں تصرف غیر مناسب طریقے سے نہ ہو، اور **\"تمہیں اس کی خبر کچھ وقت بعد معلوم ہو جائے گی\"** (الکہف: ۷۰)۔ اگر وہ ظاہر ہو جاتا تو اسے عبث سمجھا جاتا اور ہاتھ اس میں فساد برپا کرتے۔ پس پاک ہے وہ جو حکم کو رکھنے والا، آیات کو نصب کرنے والا، اور دلالات کے جمال کو ظاہر کرنے والا ہے۔ اور ان میں سے سب سے زیادہ حسین عین اور سب سے زیادہ کامل کون (وجود) عالم الخيال (عالم مثال) ہے، اور اسی کے ذریعے اللہ نے مثالیں بیان کیں۔ اور اللہ تعالیٰ نے واضح کیا کہ وہ اپنے علم میں منفرد ہے، کیونکہ اس نے منع کرتے ہوئے فرمایا: **\"پس اللہ کے لیے مثالیں نہ گھڑو۔ بے شک اللہ جانتا ہے اور تم نہیں جانتے\"** (النحل: ۷۴)۔ اور یہ آیت صرف اس وقت آئی جب اس نے ہمارے لیے اپنی طرف سے مثالیں بیان کیں، پس وہ کون (وجود) کے لیے ظاہر ہوا، اور وہ اس کا مقدمہ ہے۔ کیا تم خواب نہیں دیکھتے؟ اور خيال (تخیل) کو اسی آنکھ سے ادراک کیا جاتا ہے۔ وہ دیکھتا ہے جو اس کے وجود سے پہلے ہوگا، اور جو ہو چکا ہے، اور جو وقت اس پر ہے، اور تم کس حضور میں یہ جامعیت پاؤ گے سوائے حضرة الخيال (تخیل کے حضور) کے؟ اور جس کسی نے بھی کسی چیز سے عشق کیا، تو اس نے اس سے عشق نہیں کیا مگر اس کے بعد کہ اس نے اسے اپنے خيال (تخیل) میں حاصل کیا اور اپنے وہم میں اس کے لیے ایک مثال قائم کی اور اپنے محبوب کو اس مثال پر منطبق کیا۔ اور اگر معاملہ ایسا نہ ہوتا، تو جب وہ شخص جس کی بصارت یا سماعت یا کوئی بھی حواس اس سے وابستہ ہو، اس سے جدا ہوتا، تو اس کی وابستگی بھی ختم ہو جاتی۔ اور ہم ایسا نہیں پاتے، پس یہ اس بات کی دلیل ہے کہ محبوب محب کے نزدیک ایک مثالی صورت پر ہے جسے اس نے اپنے خيال میں پیدا کیا، پس اس کا مشاہدہ لازم ہو گیا، تو اس کا وجد دوگنا ہو گیا اور اس کی محبت بڑھ گئی، اور وہ مثال جس کی اس نے صورت گری کی، اپنے صورت گر کو اس کی طلب پر اکساتی ہے جس نے اسے اس کی صورت پر بنایا، کیونکہ وہ اصل ہی اس خيال کی روح ہے اور اسی سے اس کا بقاء ہے، اور وہی اس کی حفاظت کرتا ہے۔ اور محب کی محبت صرف اس کی صنعت اور فعل میں شدید ہوئی، کیونکہ وہ صورت جس سے اس نے اپنے خيال میں عشق کیا، وہ اس کی صنعت سے ہے، پس اس نے صرف اسی سے محبت کی جو اس کی طرف لوٹنے والا ہے۔ پس وہ اپنے نفس سے وابستہ ہوا اور اپنے فعل کی تعریف کی۔ پس جس نے یہ جان لیا، اس نے اللہ کی اپنے بندوں سے محبت کو جان لیا۔\n\nاور یہ کہ وہ (الحق) تعالیٰ ان سے زیادہ محبت کرتا ہے جتنی وہ اس سے کرتے ہیں، بلکہ وہ (عام لوگ) اسے عین ذات کے طور پر نہیں چاہتے، بلکہ اس کے احسان کو چاہتے ہیں، کیونکہ احسان ہی ان کا مشہود (دیکھی ہوئی چیز) ہے۔ اور جس نے اسے عین ذات کے طور پر چاہا، تو اس نے صرف ایک مثال کو چاہا جسے اس نے اپنے نفس میں صورت دی اور تخیل کیا، اور یہ خاص طور پر صرف مشبہہ (تشبیہ دینے والے) ہیں۔ پس ہر محب اگر تشبیہ نہ ہوتی تو اس سے محبت نہ کرتا، اور اگر تخیل نہ ہوتا تو اس سے وابستہ نہ ہوتا۔ اسی لیے شارع نے اسے اس کے قبلہ میں رکھا اور اسے اپنے بندے کے دل میں سمایا، اور اسے قرب (نزدیکی) میں اس کے جیسا یا اس کے بعض اجزاء جیسا بنا دیا۔ پس ایسے لوگ اس کی مثال کے طور پر عبادت کرتے ہیں اور اسے حاصل شدہ طور پر دیکھتے ہیں۔ اور جہاں تک منزہہ (تنزیہ کے قائلین) کا تعلق ہے، تو وہ ایک اندھیرے میں حیران ہیں جس میں وہ ٹامک ٹوئیاں مارتے ہیں، ایک ایسی اندھیری رات جس میں نہ کوئی سایہ ہے اور نہ کوئی ایسی چیز جو انہیں تشبیہ سے روکے۔ اور وہاں کوئی ایسا ایمان نہیں ہے جس کا نور دلائل کے نور سے بڑھ جائے تاکہ وہ اسے اپنے اندر شامل کر لے۔ پس منزہ ہمیشہ کسی چیز پر قابض نہیں ہوتا اور نہ کسی امر کو حاصل کرتا ہے، پس وہ اہل بیت (گھر والے) ہیں کیونکہ ان کی ہمتیں بٹی ہوئی ہیں، اور وہم ان سے دور ہے۔ پس ان میں اوہام کے حکم کی وجہ سے معرفت الوجود (ہستی کی معرفت) کے کمال کی کمی ہے، اور اوہام کا حکم صرف کامل مردوں میں ہوتا ہے۔ اسی لیے شرائع میں اللہ کے بارے میں ایسی باتیں آئیں جنہیں دلائل محال قرار دیتے ہیں۔ پس جس کے ایمان کا نور اس کی عقل کے نور پر غالب آ گیا، جیسا کہ سورج کا نور دوسرے ستاروں کے نور پر غالب آتا ہے، تو اس نے ان کے انوار کی عین کو ختم نہیں کیا، بلکہ انہیں اپنے نور میں شامل کر لیا۔ پس سارا عالم سورج کے نور اور ستاروں کے نور سے روشن ہے، لیکن وہ صرف سورج کا نور دیکھتے ہیں اور مجموعہ کو نہیں دیکھتے۔ اسی طرح اہل اللہ میں سے کامل شخص جب اپنی عقل کے نور کو اپنے ایمان کے نور میں شامل کر لیتا ہے، تو وہ منزہہ کی رائے کو درست قرار دیتا ہے، کیونکہ وہ اس سے آگے نہیں بڑھے جو ان کے انوار نے ان پر کشف کیا، اور مشبہہ کی رائے کو بھی درست قرار دیتا ہے، کیونکہ وہ اس ظاہر سے آگے نہیں بڑھے جو ان کے ایمان کے نور نے انہیں عطا کیا، ان مثالوں کے ذریعے جو اللہ نے ان کے لیے بیان کیں۔ پس کامل نے اسے عقل اور ایمان سے پہچانا، اور کمال کا درجہ حاصل کیا، جیسا کہ خيال (تخیل) نے حس اور معنی کا درجہ حاصل کیا۔ پس محسوس لطیف ہو گیا اور معنی کثیف ہو گیا، پس اسے کامل اقتدار حاصل ہوا۔ اسی لیے یعقوب نے اپنے بیٹے سے کہا: **\"اپنا خواب اپنے بھائیوں کو نہ سنانا، ورنہ وہ تمہارے خلاف کوئی چال چلیں گے\"** (یوسف: ۵)، جب انہیں ان کے علم سے معلوم ہوا کہ الحق نے ان کے خواب میں جو مثال دی تھی اس کی تعبیر کیا ہے، کیونکہ جو کچھ انہوں نے دیکھا اور جس کی مثال انہیں دی گئی، وہ عین ان کے بھائی اور والدین تھے۔ پس خيال نے بھائیوں کی صورت ستاروں کی شکل میں بنائی اور والدین کی صورت سورج اور چاند کی شکل میں، حالانکہ وہ سب گوشت، خون، رگیں اور اعصاب ہیں۔ پس اس نقل کو عالم سفل (نیچے کے عالم) سے عالم افلاک کی طرف دیکھو، اور اس ہیکل کی تاریکی سے اس ستارے کے نور کی طرف۔ پس کثیف کو لطیف کیا گیا، پھر وہ تقدم (آگے بڑھنے) اور بلند منزلت اور معانی مجردہ کے مرتبے کی طرف متوجہ ہوا، پس انہیں سجدہ محسوس کی صورت پہنا دی، پس اس نے ان کے لطیف کو کثیف کر دیا۔ اور خواب ایک ہی ہے۔ اگر اس حضور کی قوت نہ ہوتی تو جو کچھ ہوا وہ نہ ہوتا۔ اور اگر وہ درمیان میں نہ ہوتا تو وہ دونوں اطراف پر حکم نہ کرتا، کیونکہ درمیان دونوں اطراف پر حاکم ہوتا ہے، کیونکہ وہ ان کے لیے حد ہے۔ جیسا کہ الآن (موجودہ لمحہ) عین ماضی اور مستقبل ہے۔ جیسا کہ الإنسان الکامل (انسان کامل) کی رتبہ کو اللہ نے اس کے عرش پر مستوی ہونے اور اس کے دل میں ہونے کے درمیان وسط بنا دیا ہے جس میں وہ سمایا ہے۔ پس اس کی نظر اس کی طرف اس کے دل میں ہے، تو وہ دیکھتا ہے کہ وہ دائرے کا نقطہ ہے، اور اس کی نظر اس کی طرف اس کے عرش پر استواء میں ہے، تو وہ دیکھتا ہے کہ وہ دائرے کا محیط ہے۔ پس وہ **\"ہر چیز پر محیط ہے\"** (النساء: ۱۲۶)۔ اور نقطہ سے کوئی خط ظاہر نہیں ہوتا مگر اس کی انتہا محیط تک ہوتی ہے، اور محیط سے کوئی خط اس کے اندر سے ظاہر نہیں ہوتا مگر اس کی انتہا نقطہ تک ہوتی ہے۔ اور خطوط عالم کے سوا کچھ نہیں ہیں۔ پس وہ **\"ہر چیز پر محیط ہے\"** (النساء: ۱۲۶)، اور سب اس کی گرفت میں ہیں، اور **\"اسی کی طرف تمام معاملات لوٹائے جاتے ہیں\"** (ہود: ۱۲۳)۔ پس نقطہ اور محیط کے درمیان خلاء فرض نہیں کیا گیا، اور وہی ہے جس نے عالم کو اپنی عین اور کون (وجود) سے آباد کیا، اور اسی میں نقطہ سے محیط کی طرف اور محیط سے نقطہ کی طرف استحالات (تبدیلیاں) ظاہر ہوئیں۔ پس اس سے عزوجل کوئی چیز خارج نہیں ہوئی، اور نہ ہی کوئی چیز محیط سے خارج ہے جو اس کے احاطے میں داخل ہو، بلکہ سب اسی سے پھوٹے اور اسی پر ختم ہوتے ہیں، اور اسی سے شروع ہوئے اور اسی کی طرف لوٹتے ہیں۔ پس اس کا محیط اس کے اسماء ہیں اور اس کا نقطہ اس کی ذات ہے۔ اسی لیے وہ الواحد العدد (عددی واحد) اور الواحد الکثیر (کثیر واحد) ہے۔ پس ہر آنکھ جو اسے دیکھتی ہے وہ صرف انسان کی آنکھ ہے، اور اگر انسان کی عین نہ ہوتی تو انسان کی آنکھ نہ دیکھتی۔ پس انسان کے ذریعے انسان نے دیکھا، پس الحق کے ذریعے الحق ظاہر ہوا۔\n\nپس ہم نے اس میں حق کہا،\nاور ہم نے اس میں خلق (مخلوق) کہا۔\n\nاور ہم نے اس میں در (موتی) کہا،\nاور ہم نے اس میں حق کہا۔\n\nپس وہ ملک (بادشاہ) اور ملک (ملکیت) ہے،\nاور وہ فلک (آسمان) اور فلک (کشتی) ہے۔\n\nپس جب میں نے اسے چاہا،\nتو اس نے محبت کے لیے کہا: \"میں تمہارے لیے تیار ہوں\" (هيت لك)۔\n\nیعنی میری ہیئت (شکل) اچھی ہو گئی، کیونکہ میں تمہارے لیے تیار ہوں (هيت لك)۔ کیونکہ اگر عالم کا حسن نہ ہوتا تو قدیم کا حسن اور اس کا جمال معلوم نہ ہوتا، اور اگر الحق کا جمال نہ ہوتا تو عالم میں جمال ظاہر نہ ہوتا۔ پس معاملہ دوری (چکر دار) ہے، اور اسی سے فلک گھومتا ہے۔ پس فلک کا گھومنا اس کی کوشش ہے، اور وہ اپنی جگہ سے نہیں ہٹا۔ پس وہ اپنی کلیت کے ساتھ منتقل ہونے والا ہے جس نے اپنی جگہ نہیں چھوڑی، یہ اللہ کی طرف سے اپنے بندوں کے لیے تنبیہ ہے یا ایک مثال بیان کرنا ہے کہ الحق اگرچہ عالم کو وجود بخشا اور اپنے آپ کو ان صفات سے متصف کیا جن سے اس نے متصف کیا، وہ اپنی تنزیہ اور اپنی ذات کے لحاظ سے اپنی مخلوق سے تمیز کے مقام سے نہیں ہٹا، باوجود اس کے کہ وہ اپنی ہر مخلوق کے ساتھ معین (مددگار) ہے۔ بخلاف خطوط کے، کیونکہ وہ وسط سے اور وسط کی طرف متحرک ہیں، پس وہ جدا ہونے والے اور منازل کو کاٹنے والے ہیں۔ اور وسط کی حرکت نے اپنی منزل کو نہیں چھوڑا اور نہ ہی کسی اور میں حرکت کی، اور یہ مسائل کا وہ عجوبہ ہے جس میں جواب دینے والا اور سوال کرنے والا حیران ہو گیا۔\n\nاے گھومنے والے فلک!\nتم اپنے سفر میں کس کی طرف جا رہے ہو؟\n\nہماری طرف؟ تو ہم تمہارے احشاء (اندرونی حصوں) میں ہیں،\nاس کی طرف؟ تو تمہارا سفر باطل ہے۔\n\nوہ اپنی ذات میں حد سے بلند ہے،\nاور اس نے کہا: وہ الباطن (پوشیدہ) الظاہر (ظاہر) ہے۔\n\nتم ہماری سانسوں کے ساتھ ہم پر گھومتے ہو،\nاور تم ہمارے لیے قاہر (غالب) حکم ہو۔\n\nپس تمہارا مجھ سے مشغول ہونا ایک مشغول کرنے والا شغل ہے،\nاور جب وہ ختم ہو جائے گا تو تم خسارہ پانے والے ہو۔\n\nپس اگر تم اس میں اس کے حکم سے ہو،\nتو تم اس کے ذریعے نفع کمانے والے تاجر ہو۔\n\nاور تمہارے اوپر پھر اس کے اوپر،\nایک معبود ہے جو تمہاری مرمت کے لیے فاطر (پیدا کرنے والا) ہے۔\n\nاس نے تمہاری مرمت میں فتق (پھاڑنے) کے ذریعے مدد کی،\nپس تمہاری عقل اس کی صنعت میں حیران ہے۔\n\nاسی لیے تم گھومتے ہو اور اپنی جگہ سے نہیں ہٹتے،\nاپنے ٹھکانے میں، اور آنے والا اور جانے والا۔\n\nپس ٹھہر جاؤ! تو جبر (زبردستی) نے صرف چلنے سے انکار کیا،\nاور کہا: میں ہی توڑنے والا اور جوڑنے والا ہوں۔\n\nمیں نے نہی (عقل) کی آنکھوں کو چھپا دیا، تو وہ پلٹ گئیں،\nاور انہوں نے جان لیا کہ میں ہی چھپانے والا ہوں۔\n\nپس پاک ہے وہ جس کا حکم حکمت ہے،\nاور جس کی عین (حقیقت) وارد ہونے والی اور صادر ہونے والی ہے۔\n\nاگر تم نہ ہوتے تو اس کے افق میں،\nاس کے گھومنے سے کوئی چمکدار ستارہ ظاہر نہ ہوتا۔\n\nاور جب اللہ تعالیٰ نے عالم کو پیدا کیا اور عالم کی ذات نے یہ تقاضا کیا کہ اس کا بعض حصہ بعض کے لیے تبدیل ہو جائے، ان حقائق اور استعداد کی بنا پر جو اللہ نے اس میں تبدیلی قبول کرنے کے لیے مرکب کیے، تو اس نے اپنی ذات سے امکانی عوارض (عارضی کیفیات) کو طلب کیا جنہیں تم عالم میں دیکھتے ہو۔ پس عالم میں سے بعض وہ ہیں جن کا اس طلب میں خاص مقصد ہوتا ہے، جیسے ایک کھڑا شخص بیٹھنے کو طلب کرتا ہے اس سے جو عقل رکھتا ہے، اور ان میں سے بعض وہ ہیں جو اسے بغیر کسی مقصد کے طلب کرتے ہیں، جیسے درخت پانی مانگتا ہے اس پھل کی خاطر جس کے لیے وہ پیدا کیا گیا ہے، اور اس کا یہ طلب ذاتی ہے ایک معلوم مقدار پر۔ اگر اس سے زیادہ ہو جائے تو اس کا حکم اس کی کمی کے حکم جیسا ہوگا یعنی ہلاکت۔ اور پانی اس کے حکم میں نہیں ہے، پس ایک محافظ کا ہونا ضروری ہے جو اس پر معلوم مقدار کو محفوظ رکھے، اور وہ اس کے خالق کے سوا کوئی نہیں ہے۔ اور یہ عوارض جو عالم کے جوہر پر عارض ہوتے ہیں، ان میں سے بعض کو صلاح (درستگی) کہا جاتا ہے اور بعض کو فساد (بگاڑ) کہا جاتا ہے، لیکن حقیقت میں عالم پر ایسا فساد عارض نہیں ہو سکتا جس میں صلاح نہ ہو، کیونکہ یہ اس کے وجود کے ارادے کے خلاف ہوگا۔ اور جہاں تک صلاح کا تعلق ہے جس میں فساد نہ ہو، تو وہ واقع ہے اور عالم کے صانع کا ارادہ ہے، کیونکہ اس نے عالم کو اسی لیے پیدا کیا۔ اور جہاں تک احوال (کیفیات) کا تعلق ہے، تو وہ معانی کے لیے ذاتی ہیں، کیونکہ وہ ان کے احکام ہیں، اور ان کا نہ کوئی وجود ہے اور نہ وہ معدوم ہیں، جیسے حمرہ (سرخی) اس شخص کے لیے جس میں حمرہ قائم ہو۔ اور یہ ایک حکم ہے جو خلق (تخلیق) سے متصف نہیں ہوتا، کیونکہ یہ معقول ہے اور وجود عینی میں اس کی کوئی عین (حقیقت) نہیں ہے، بلکہ تمام معانی جنہوں نے اپنے احکام کو اس شخص کے لیے واجب کیا جو ان سے متصف ہوا، وہ نسب عدمیہ (عدم سے منسوب نسبتیں) ہیں جن کی وجود میں کوئی عین نہیں ہے، اور ان کے لیے حکم اور حال ہے، اور ان کے حکم اور حال کی وجود میں کوئی عین نہیں ہے۔ پس حاکم اور محکوم بہ (جس پر حکم لگایا گیا) حقیقت میں امور عدمیہ ہو گئے، باوجود اس کے کہ وہ معقول ہیں۔ پس حقیقت میں کسی موجود کا کسی موجود میں کوئی اثر نہیں ہے، بلکہ اثر معدوم کا موجود میں اور معدوم میں ہوتا ہے، کیونکہ اثر نسبتوں کے لیے ہے، اور نسبتیں امور عدمیہ کے سوا کچھ نہیں ہیں۔ یہ مراتب کے احکام میں بدیہی طور پر ظاہر ہوتا ہے، جیسے نوع انسانی میں سلطنت کا مرتبہ اور سوقیہ (عام لوگوں) کا مرتبہ۔ مثال کے طور پر، سلطان عام لوگوں میں وہ حکم لگاتا ہے جو سلطانہ (سلطنت کا مرتبہ) چاہتی ہے، حالانکہ سلطنت کا کوئی وجود عینی نہیں ہے۔ اور جب حکم مراتب کے لیے ہے، تو وہ اعیان (حقیقتیں) جن کی حقیقت یہ ہے کہ وہ اپنی ذات میں جسمانی فطری صورت پر نہ ہوں، جب وہ کسی کے لیے عالم تمثیل میں جسمانی فطری صورت میں ظاہر ہوں، جیسے فرشتہ کا **\"ایک سیدھے سادے بشر\"** (مریم: ۱۷) کی صورت میں متمثل ہونا، اور جیسے الٰہی التجلی (ظہور) کا صورتوں میں ہونا، تو کیا وہ ظاہر ہونے والی صورت دیکھنے والے کی آنکھ میں اس صورت کے حکم کو قبول کرتی ہے جو اس کی حقیقت ہے، جیسے انسان یا حیوان کی صورت، پس اس پر تفکر کا حکم لگایا جائے اور اس میں درد اور لذتوں کا قیام ہو؟ پس کیا وہ صورت جو ظاہر ہوئی، حیوان یا انسان یا جو کچھ بھی تھی، حقیقت میں اس حکم کو قبول کرتی ہے؟ یا دیکھنے والا اگر یہ نہ جانتا ہو کہ وہ انسان یا حیوان ہے، تو اسے اس پر وہ حکم لگانے کا حق نہیں جو وہ اس صورت کی عین پر لگاتا ہے؟ اس معاملے میں کیا حکم ہے؟ پس جان لو کہ فرشتہ کی صورت اپنی ذات اور عین میں بشر سے مختلف ہے، اور جس طرح وہ بشر سے مختلف ہے، اسی طرح بشر نے بھی اس سے اختلاف کیا، جیسے جبرائیل کا ایک اعرابی کی صورت میں ظاہر ہونا، اس کی گفتگو اور اس کی معمول کی حرکت کے ساتھ۔ کیا اس صورت میں جو انسان میں ہے، وہ اس متمثل صورت میں بھی ہے جیسا کہ انسان میں ہے؟ یا وہ صورت سے ہے جیسا کہ صورت بھی متخیلہ ہے؟ اور کیا اس صورت کے ساتھ اس کے تمام احکام بھی آتے ہیں، جیسے وہ قوتیں جو انسان میں اس کے ساتھ قائم ہیں، جیسا کہ اس کے ساتھ کلام اور حرکت اور ظاہر ہونے والی کیفیات قائم ہوئیں؟ پس وہ حقیقت میں ایک خیالی انسان ہے، یعنی فرشتہ اس وقت میں، اور اس صورت کا حکم حقیقت میں بھی اس کے لیے ہے، اس صورت کی حد پر کہ وہ ایک خیالی انسان ہے۔ پس جب وہ صورت چلی جاتی ہے تو اس کے احکام بھی اس کے چلے جانے کی وجہ سے چلے جاتے ہیں۔ اور اس کی وجہ یہ ہے کہ عالم کا جوہر اصل میں ایک ہے جو اپنی حقیقت سے تبدیل نہیں ہوتا، اور ہر صورت جو اس میں ظاہر ہوتی ہے وہ ایک عارضہ ہے جو حقیقت میں ہر فرد وقت میں تبدیل ہوتا رہتا ہے۔ اور الحق ہمیشہ مثالیں وجود میں لاتا ہے، کیونکہ وہ ہمیشہ خالق ہے، اور ممکنات اپنی عدم کی حالت میں وجود کو قبول کرنے کے لیے تیار ہیں۔ پس جب بھی اس جوہر میں کوئی صورت ظاہر ہوتی ہے، وہ اپنے تمام احکام کے ساتھ ظاہر ہوتی ہے، خواہ وہ صورت محسوس ہو یا متخیلہ۔ کیونکہ اس کے احکام اس کے پیچھے آتے ہیں، جیسا کہ اعرابی نے جب رسول اللہ صلی اللہ علیہ وسلم کو الحق جل جلالہ کو ہنسنے سے متصف کرتے ہوئے سنا تو کہا: \"ہم ایسے رب سے خیر سے محروم نہیں ہوں گے جو ہنستا ہے۔\"\n\nکیونکہ ہنسنے والے کی شان یہ ہے کہ اس سے خیر کے وجود کی توقع کی جائے۔ پس جس طرح ہنسنے کی صورت اس کے پیچھے آئی، اسی طرح اس سے خیر کا وجود بھی اس کے پیچھے آیا۔ اور یہ جناب الٰہی میں ہے، تو عالم کے جوہر میں کیسا ہوگا؟ اور ایسی بات کسی عالم کے نزدیک ہلکی نہیں ہو سکتی اور نہ ہی کشادہ دل والا اسے قبول کر سکتا ہے، مگر وہ جو یہ جانتا ہو کہ عالم کا جوہر نفس رحمانی ہے جس میں عالم کی صورتیں ظاہر ہوئی ہیں۔ اور جو یہ نہیں جانتا، تو وہ اپنے نفس میں الحق کے حق میں اور ہر اس ظاہر ہونے والے کے حق میں جسے وہ جانتا ہے کہ وہ حقیقت میں اس کا نہیں ہے، اسے قبول کرنے میں تکلف اور مشقت محسوس کرتا ہے، پس وہ تاویل کرتا ہے، اور تاویل کے اوقات میں اس پر مشکل ہو جاتی ہے، پس وہ ایمان لاتا ہے اور تسلیم کرتا ہے، اور نہیں جانتا کہ معاملہ کیا ہے، بخلاف عالم محقق کے جسے اللہ تعالیٰ نے ان امور پر مطلع کر دیا ہے جو وہ حقیقت میں ہیں۔ پس عالم اپنے جوہر کے لحاظ سے مکمل طور پر شریف ہے، اس میں کوئی تفاضل (برتری) نہیں ہے، اور کیڑا اور العقل الأول (عقل اول) جوہر کی فضیلت میں برابر ہیں۔ اور تفاضل صرف صورتوں میں ظاہر ہوا ہے، اور وہ مراتب کے احکام ہیں: پس شریف، اور اشرف، اور وضیع (کمتر)، اور اوضع (کمترین)۔ اور جس نے یہ جان لیا، اس پر ان تمام امور کو قبول کرنا آسان ہو گیا جو شرائع میں اللہ کے حق میں اور دار آخرت کے حق میں اور غائب امور کے حق میں وارد ہوئے ہیں جنہیں عقلیں اپنی فکروں سے ادراک نہیں کر سکتیں، اور ان کا ادراک صرف خبر سے ہے۔ اور صورتیں ممکنات کی اعیان کے سوا کچھ نہیں ہیں، اور عالم کا جوہر اس کے سوا نہیں جو ہم نے ذکر کیا۔ پس عالم پر اس کے جوہر کے لحاظ سے اطلاق کا ایک حکم ہے جو اس کی صورت کے لحاظ سے نہیں ہوتا، اور اس کا ایک حکم اس کی صورت کے لحاظ سے ہے جو اس کے جوہر کے لحاظ سے نہیں ہوتا۔ پس لوگوں میں سے بعض وہ ہیں جنہوں نے اسے کشف (مکاشفہ) کے ذریعے جانا، اور وہ ہمارے اصحاب، رسول، انبیاء اور مقربین ہیں۔ اور لوگوں میں سے بعض وہ ہیں جنہوں نے اسے اپنی قوت اور اپنی عقل میں پایا، اور نہیں جانا کہ یہ کہاں سے آیا اور کیسے حاصل ہوا، پس وہ اہل کشف کے ساتھ حکم میں شریک ہوتے ہیں، اور حقیقت میں نہیں جانتے کہ معاملہ کیا ہے، اور وہ علت کے قائلین، دہر (زمانہ) کے قائلین، اور طبیعت کے قائلین ہیں۔ اور ان کے علاوہ کسی کو اس حکم کی کوئی خبر نہیں ہے، جیسا کہ ان گروہوں کو وہ علم نہیں جو اہل اللہ جانتے ہیں، اگرچہ وہ اس حکم میں شریک ہیں۔ پس اگر تم ان میں سے کسی گروہ کے علماء سے پوچھو، تو وہ اس چیز کا انکار نہیں کریں گے جو اہل اللہ نے واضح کی ہے، اور ان پر اس حکم کا قول صرف وہی چیز لازم کرتی ہے جو اہل اللہ جانتے ہیں، اور علت کے قائلین کو اس کا شعور نہیں ہے۔ کیا تم نہیں دیکھتے کہ شارع، جو اللہ کی طرف سے خبر دینے والا ہے، نے الحق کو کسی ایسی چیز سے متصف نہیں کیا جس میں تفصیل ہو مگر وہ محدث (پیدا کی گئی) مخلوق کی صفت ہے، باوجود اس کے کہ جس سے وہ متصف ہے وہ قدیم ہے، اور عقل کے لیے اس میں اس کی نظر اور فکر کے لحاظ سے کوئی قدم نہیں ہے۔ اور اس کی وجہ یہ ہے کہ وہ اس کی اصل کو نہیں جانتا اور نہ ہی جانتا ہے کہ یہ عالم کے جوہر میں اس کی صورت ہے، بلکہ وہ یہ تخیل کرتا ہے کہ یہ عین جوہر ہے۔ پس اگر تم سلامتی چاہتے ہو، تو ایسے رب کی عبادت کرو جس نے اپنے آپ کو ان صفات سے متصف کیا جن سے اس نے متصف کیا، اور تشبیہ کی نفی کی، اور حکم کو ثابت کیا جیسا کہ معاملہ ہے، کیونکہ جوہر عین صورت نہیں ہے، پس اس پر تشبیہ کا کوئی حکم نہیں ہے۔ اسی لیے اس نے فرمایا: **\"کوئی چیز اس کے مثل نہیں ہے\"** (الشوریٰ: ۱۱)، عدم مشابہت کی وجہ سے، کیونکہ حقائق اسے رد کرتی ہیں، اور **\"اور وہ سننے والا، دیکھنے والا ہے\"** (الشوریٰ: ۱۱)، صورتوں کو ثابت کرنے کے لیے، کیونکہ وہ ایک زندہ فصل ہے۔ پس جس نے اپنے رب کو اس کی اپنی خبر سے نہیں جانا، **\"تو وہ کھلی گمراہی میں گمراہ ہوا\"** (الاحزاب: ۳۶)۔ اور اس کا ادنیٰ درجہ یہ ہے کہ وہ اس کی صفات میں خبر پر ایمان لائے، جیسا کہ وہ ایمان لایا کہ اس کے مثل کوئی چیز نہیں ہے، اور دونوں حکم عقلی نظر اور قبول کے لحاظ سے حق ہیں۔ اور اللہ فرماتا ہے: **\"بے شک وہ ہر چیز پر محیط ہے\"** (النساء: ۱۲۶)، اور **\"اور ہر چیز پر نگہبان ہے\"** (الاحزاب: ۵۲)۔ کیا تم سمجھتے ہو کہ وہ اس پر محیط ہے حالانکہ وہ اس سے خارج ہے، اور اس کے وجود کی حفاظت کرتا ہے بغیر کسی نسبت کے؟ پس امور آپس میں مل گئے اور احکام متحد ہو گئے، اور اعیان ممتاز ہو گئے، پس ایک لحاظ سے کہا گیا کہ یہ وہ نہیں ہے، زید اور عمرو کے بارے میں، اور ایک لحاظ سے کہا گیا کہ یہ عین وہ ہے، زید اور عمرو کے بارے میں، اور وہ ایک انسان ہے۔ اسی طرح ہم عالم کے بارے میں اس کے جوہر کے لحاظ سے اور اس کی صورت کے لحاظ سے کہتے ہیں، جیسا کہ اللہ نے فرمایا: **\"کوئی چیز اس کے مثل نہیں ہے\"** (الشوریٰ: ۱۱)، اور وہ اس سے مراد لیتا ہے کہ یہ وہ ہے جس کے مثل کوئی چیز نہیں ہے، **\"اور وہ سننے والا، دیکھنے والا ہے\"** (الشوریٰ: ۱۱)۔ اور سمع کا حکم بصر کا حکم نہیں ہے، پس اس نے فرق کیا اور وصل کیا، اور نہ وہ جدا ہوا اور نہ وہ متصل ہوا۔\n\nپس جو چاہے ایمان لائے اور جو چاہے کفر کرے،\nاور جو چاہے عاجز ہو جائے اور جو چاہے غور کرے۔\n\nپس جس نے وہ علم جان لیا جو میں نے جان لیا ہے،\nاس پر لازم ہے کہ وہ خوش ہو اور شکر کرے۔\n\nجب اسے تقویٰ حاصل ہو جائے، تو اس بات پر ہوشیار رہو،\nجو وہ اس شخص سے کہتا ہے جو اسے جانتا اور محسوس کرتا ہے۔\n\nاور اس نے یہ بات مخلوق سے باطل طور پر نہیں کہی،\nلیکن یہ نصیحت ہے اس کے لیے جو چاہے نصیحت حاصل کرے۔\n\nوہ اندھے کے لیے اندھی حیرت ہے،\nوہ دیکھنے والی بصارت والے کے لیے روشن ترین منظر ہے۔\n\nاور جب ہم اس کے وجودِ عماء (غیب مطلق) میں ظاہر ہوئے،\nتو ہم نے اپنے اندر قرب (نزدیکی) کا وجود جان لیا اور ہم محصور نہ ہوئے۔\n\n### «وصل اشارہ اور تنبیہ»\n\nجان لو کہ لوگوں میں سے ہر بات کرنے والا اس وقت تک کوئی بات نہیں کرتا جب تک کہ وہ اسے اپنے نفس میں تخیل نہ کر لے اور اس کی ایک صورت قائم نہ کر لے جس سے وہ تعبیر کرتا ہے، اس کے لیے یہ ضروری ہے۔ اور چونکہ خيال (تخیل) اپنی ذات کے لیے مطلوب نہیں ہوتا، بلکہ وہ اپنے وجود حسی میں ظاہر ہونے کے لیے مطلوب ہوتا ہے، یعنی اس کا حکم حس میں ظاہر ہو، کیونکہ متخیل کبھی مرتبہ ہو سکتا ہے اور کبھی وہ جو وجودی صورت قبول کرتا ہے، جیسے کوئی شخص تخیل کرے کہ اس کا بیٹا ہو، تو اس کے ہاں بیٹا پیدا ہوتا ہے اور وہ اس کی آنکھ میں اس کی طرح ایک کھڑے شخص کے طور پر ظاہر ہوتا ہے۔ اور کبھی وہ تخیل کرتا ہے کہ وہ بادشاہ ہو، اور یہ ایک مرتبہ ہے، تو وہ بادشاہ بن جاتا ہے، حالانکہ مملکت کی وجود میں کوئی عین نہیں ہے، بلکہ وہ ایک نسبت ہے۔ اور جب یہ معاملہ ہے، اور جو کچھ تخیل کیا جاتا ہے وہ تعبیر کیا جاتا ہے، جیسے خواب، اسی طرح ہر کلام کی تعبیر کی جاتی ہے اور اس کی تاویل کی جاتی ہے۔ پس کائنات میں کوئی ایسا کلام نہیں جس کی تاویل نہ کی جائے۔ اسی لیے اس نے فرمایا: **\"اور تاکہ ہم اسے احادیث کی تاویل سکھائیں\"** (یوسف: ۲۱)۔ اور ہر کلام سامع کے نزدیک حادث (نیا) ہوتا ہے۔ پس تاویل (تعبیر) میں سے کچھ وہ ہوتا ہے جو متکلم کی مراد کو پا لیتا ہے، اور تاویل میں سے کچھ وہ ہوتا ہے جو متکلم کی مراد سے خطا کر جاتا ہے، اگرچہ تاویل ہر لحاظ سے درست ہوتی ہے، خواہ وہ متکلم کی مراد سے خطا کرے یا اسے پا لے۔ پس کوئی ایسا امر نہیں جو اپنے بارے میں تعبیر قبول نہ کرتا ہو۔ اور اس میں سامع کی فہم لازم نہیں ہے جو اس اصطلاح یا اس عبارت کو نہیں سمجھتا، کیونکہ اذواق اور کیفیات کے علوم اگرچہ انتقال کو قبول کرتے ہیں، لیکن چونکہ ان کے بارے میں بات کرنا اور ان سے تعبیر کرنا سامع کو سمجھانے کے لیے ہوتا ہے، اسی لیے انہوں نے کہا کہ جو کہا نہیں جا سکتا۔ اور یہ لازم نہیں ہے کہ جو سامع اسے ادراک نہیں کرتا وہ اسے نہ سمجھے، بلکہ وہ اپنے نفس کے ساتھ ایک لفظ پر اصطلاح کر سکتا ہے جو اس چیز پر دلالت کرے جس کا اس نے ذوق حاصل کیا، تاکہ وہ لفظ اس کے لیے تنبیہ اور یاد دہانی کا ذریعہ بنے جب وہ اسے کسی دوسرے وقت بھول جائے، اگرچہ وہ شخص اسے نہ سمجھے جسے اس میں کوئی ذوق نہیں ہے۔ اور تاویل اس چیز کی تعبیر ہے جس کی طرف وہ حدیث لوٹتی ہے جو اس کے خيال میں اس کے پاس واقع ہوئی۔ اور امور کے بارے میں خبر دینے کو تعبیر نہیں کہا گیا اور نہ ہی خواب میں تعبیر کو تعبیر کہا گیا مگر اس لیے کہ خبر دینے والا اس چیز سے تعبیر کرتا ہے جس سے وہ بات کرتا ہے، یعنی وہ اس چیز سے جو وہ بات کرتا ہے، اپنے نفس کے حضور سے سامع کے نفس کی طرف تجاوز کرتا ہے، پس وہ اسے ایک خيال سے دوسرے خيال میں منتقل کرتا ہے، کیونکہ سامع اسے اپنی فہم کے مطابق تخیل کرتا ہے۔ پس کبھی خيال، سامع کا خيال متکلم کے خيال سے مطابقت رکھتا ہے اور کبھی مطابقت نہیں رکھتا۔ پس جب مطابقت رکھتا ہے تو اسے اس کی فہم کہا جاتا ہے، اور اگر مطابقت نہ رکھے تو وہ نہیں سمجھتا۔ پھر جس کے بارے میں بات کی جاتی ہے، کبھی اس کے بارے میں ایسے لفظ سے بات کی جاتی ہے جو اس کی ذات میں اس کے مطابق ہو، تو اس وقت اسے عبارت کہا جاتا ہے، اور اگر وہ اس کے مطابق نہ ہو تو وہ لفظ ہے، عبارت نہیں، کیونکہ اس کے ذریعے اس کے مقام سے سامع کے مقام تک تجاوز نہیں کیا گیا۔ اور خواہ وہ کلام جس کی طرف بھی منسوب ہو، ہمارا مقصد اس اشارہ سے خيال کے مرتبے کی عظمت پر تنبیہ کرنا ہے، اور یہ کہ وہ معلومات میں مطلق حاکم ہے، سوائے اس کے کہ تعبیر کرنے والا اس میں درستگی کرتا ہے اور خطا کرتا ہے، اس کے مطابق جو وہ اس کے مقامات میں نزول کے وقت دیکھتا ہے۔ پس درستگی کرنے والا وہ ہے جو حقائق کے ذریعے ان کے مراتب سے تجاوز نہیں کرتا۔ اور اس میں اسماء کا علم ہے، اور ان میں سے جن کی عبادت کی گئی اور جن کی عبادت نہیں کی گئی۔ اور اس میں موجودات کے منازل کی معرفت کا علم ہے۔ اور اس میں ستر (پردہ) اور التجلی (ظہور) کا علم ہے۔ اور اس میں علم میں تفاضل (برتری) کا علم ہے۔ اور اس میں شکر اور شاکر کا علم ہے۔ اور اس میں معتاد (معمول کی) اور غیر معتاد آیات کا علم ہے۔ اور اس میں تبری (بیزاری) اور تنزیہ کا علم ہے، اور جو اللہ عزوجل کے حق میں تنزیہ ہے وہ مخلوق کے حق میں تبری ہے اور تنزیہ نہیں۔ اور اس میں اہل اللہ کی تقسیم اور ان کے طبقات کا علم ہے۔ اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے (الأحزاب: ۴)۔ الفتوحات المکیہ کی چھبیسویں جلد کا اختتام باب نمبر تین سو بہتر کے اختتام پر ہوا۔ بسم اللہ الرحمن الرحیم۔",
    "fa": "باب سیصد و هفتاد و دوم در معرفت منزل سر و دو سر، و ثنای تو بر خودت به آنچه از آنِ تو نیست، و اجابت حق تو را در آن به جهت شرافتی که به واسطه‌ی حضرت محمدیه (الحضرة المحمدية) به تو بخشیده است.\n\nآن کس که نیمی از هستی (الکون) را در خُلقش (آفرینش) حائز شد *** و نیم دیگرش را در خُلقش (اخلاق)\nاو عین زمان در وقت خویش است *** و ماه تمامِ برآمده در افقش\nماه کاملش از مغربش طلوع می‌کند *** و نورش در مشرقش غروب می‌نماید\nپس هر مخلوقی به او شیفته است *** و همه‌ی ما در حق او (در راه او) فانی می‌شویم.\n\n### [همانا عالم (جهان) تماماً در نهایت جمال است]\n\nدر خبر صحیح در صحیح مسلم از رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) آمده است که فرمود: «إن الله جميل يحب الجمال» (همانا خداوند زیباست و زیبایی را دوست دارد).\n\nو او تعالی سازنده‌ی عالم است و آن را بر صورت خویش ایجاد کرد. پس عالم تماماً در نهایت جمال است و هیچ زشتی در آن نیست، بلکه خداوند همه‌ی حُسن و جمال را برای آن گرد آورده است. و در امکان، زیباتر، بدیع‌تر و نیکوتر از این عالم وجود ندارد، حتی اگر آنچه را که ایجاد کرده تا بی‌نهایت ادامه دهد، باز هم مانند همین چیزی است که ایجاد کرده است؛ زیرا حُسن و جمال الهی آن را در بر گرفته و به واسطه‌ی آن ظاهر شده است. چنانکه حق تعالی فرمود: «أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ» (به هر چیزی آفرینش [و صورت] آن را عطا کرد). پس این همان جمال آن است؛ زیرا اگر چیزی از آن کاسته می‌شد، از درجه‌ی کمال آفرینش خود فرو می‌افتاد و زشت می‌شد. سپس هدایت کرد، یعنی این را برای ما با قولش بیان نمود: «أَعْطى‏ كُلَّ شَيْءٍ خَلْقَهُ» (به هر چیزی آفرینش [و صورت] آن را عطا کرد).\n\nو چون حق (الحق) را در صورت بشر دیدیم *** دانستیم که عقل در این باره در خطر است\nپس هر کس حق آشکار را به عقل خود مقید سازد *** و این تقیید را رها نکند، خبری ندارد\nاگر حق بر من به مانند صورت خودم تجلی (التجلی) کند *** من در تنزیه از سایر صورت‌ها تجلی می‌کنم\nاگر بگوید: چه گفتی؟ تو به من یادآور شدی *** که از ستمکاری که پیروز شود درمی‌گذری\nو تو مانند من نیستی، بگو: پس چرا صورتم فرو ریخت؟ *** و دیدن من شما را مانند دیدن ماه است\nاگر تو مانند من باشی، پس تماثل (همانندی) حاکم است *** بر هر مِثلی، چنانکه نظر اقتضا می‌کند\nپس هر شبیهی در هر حال، با شبیه خود سازگار است *** چه در ازل و چه در بشر\nخداوند سجده را برای سهو ما تشریع کرد *** با به خاک مالیدن بینی شیطان و جبران شکستگی\nپس تو را چه شده که سجده نکردی، در حالی که امام مایی؟ *** تو سزاوار سجده‌ای، چنانکه ذکر شد\nما شتابان به سوی تو آمدیم، اما تو بازگشتی و رمیدی *** و کجا جای پای گام‌ها به پایه‌ی دیده‌ی بصیرت می‌رسد؟\n\nو از آن جمله:\nپس چه کسی ما را جدا کرد یا به چه کسی ما را وصل نمود؟ *** و او نیست مگر الله، هم به عین و هم به اثر\nپس شکر بر آنچه پنهان کرد و شکر بر آنچه آشکار نمود *** و بنده‌ای که شکر کند، خیر افزون را به دست آورده است\nو او نیست مگر حق (الحق) که خود را شکر می‌کند *** اما حجاب قرب فرستاده شد و پنهان گشت.\n\nپس عالم (العالم) تماماً جمالش ذاتی است و حُسنش عین خود اوست، زیرا سازنده‌اش آن را بر این صورت ساخته است. و به همین دلیل است که عارفان (العارفون) شیفته‌ی آن شده‌اند و محققان به محبت آن تحقق یافته‌اند. و به همین جهت در برخی عبارات خود درباره‌ی آن گفته‌ایم که آینه‌ی حق (الحق) است. پس عارفان در آن جز صورت حق ندیده‌اند. و او سبحانه جمیل است و جمال محبوب بالذات است و هیبت او در قلوب ناظران به او ذاتی است. پس محبت و هیبت را به ارث گذاشت. همانا خداوند آیات (نشانه‌ها) را در عالم و در خود ما (زیرا ما جزئی از عالم هستیم) زیاد نکرده است، مگر برای اینکه نظر ما را به سوی خود او معطوف سازد؛ از طریق ذکر، فکر، عقل، ایمان، علم، سمع، بصر، نهی و لُبّ (خرد). و ما را نیافریده است مگر برای اینکه او را عبادت کنیم و بشناسیم. و ما را در این امر به هیچ چیز ارجاع نداده است مگر به نظر کردن در عالم، زیرا آن را عین آیات و دلالت‌ها بر علم به او، هم به صورت مشاهده (الشهود) و هم به صورت عقلی، قرار داده است. پس اگر نظر کنیم، به سوی اوست؛ و اگر بشنویم، از اوست؛ و اگر تعقل کنیم، از اوست؛ و اگر تفکر کنیم، در اوست؛ و اگر بدانیم، اوست؛ و اگر ایمان آوریم، به اوست. پس اوست که در هر وجهی تجلی (التجلی) می‌کند و از هر آیتی مطلوب است و با هر چشمی به او نگریسته می‌شود و در هر معبودی پرستیده می‌شود و در غیب و شهود مقصود است. هیچ یک از خلق او به فطرت و جبلّت خود او را گم نمی‌کند. پس تمام عالم برای او نمازگزار و به سوی او ساجد است و به حمد او تسبیح‌گو. زبان‌ها به او گویاست و قلب‌ها به او شیفته و عاشق است و خردها در او حیران. عارفان می‌خواهند او را از عالم جدا کنند، اما نمی‌توانند؛ و می‌خواهند او را عین عالم قرار دهند، اما این برایشان محقق نمی‌شود. پس عاجز می‌مانند و فهم‌هایشان کُند می‌شود و عقل‌هایشان متحیر می‌گردد و زبان‌هایشان در تعبیر از او متناقض می‌شود. در یک زمان می‌گویند اوست، و در زمانی می‌گویند او نیست، و در زمانی می‌گویند او همان نیست. پس قدمی برایشان در این راه استوار نمی‌شود و راهی روشن به سوی او برایشان آشکار نمی‌گردد؛ زیرا او را عین آیه و راه می‌بینند. و این مشاهده (الشهود) مانع طلب غایت راه می‌شود، زیرا راه تنها به سوی غایاتش پیموده می‌شود، در حالی که مقصود همراه آنهاست و او رفیق است. پس نه سالکی هست و نه مسلوکی. در نتیجه اشارات از بین می‌روند، در حالی که جز او نیستند؛ و و عبارات ساقط می‌شوند، در حالی که جز او نیستند. پس بر عارف خرده گرفته نمی‌شود که به چه چیزی از عالم شیفته می‌شود و چه نشانه‌هایی را توهم می‌کند. و اگر این امر چنان نبود که ذکر کردیم، هیچ پیامبر و رسولی، اهل و فرزندی را دوست نمی‌داشت و کسی را بر دیگری ترجیح نمی‌داد. و این به دلیل تفاوت درجات آیات و دگرگونی عالم است که عین آیات است و چیزی جز شئون حق (الحق) نیست که او در آنهاست. و برخی از آنها را «فَوْقَ بَعْضٍ دَرَجاتٍ» (برخی را بر برخی دیگر درجات برتری داد)؛ زیرا به واسطه‌ی آن صورت در اسماء خود ظاهر شد. پس ما تفاوت برخی از آنها را بر برخی دیگر به عموم و خصوص دانستیم. او غنی از عالمیان است و اوست که می‌فرماید: «وَما خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ» (و جن و انس را نیافریدم مگر برای اینکه مرا عبادت کنند). پس خالق کجا و غنی کجا؟ و قابض و مانع کجا؟ و عالم در احاطه‌ی خود کجا و قادر و قاهر کجا؟ آیا همه‌ی اینها جز عین همان چیزی است که در عالم واقع شده است؟ پس هیچ رسول و عارف (العارف) جز در آن تصرف نکرده است، «وَلَكِنَّ أَكْثَرَ النَّاسِ لا يَعْلَمُونَ» (ولی بیشتر مردم نمی‌دانند). و این بدان سبب است که برخی از مردم در گوششان سنگینی است و بر دیده‌شان پرده و بر قلبشان قفل و در فکرشان حیرت و در علمشان شبهه و در شنوایی‌شان کری است. و به خدا سوگند، همه‌ی اینها نزد عارف جز به دلیل قرب مفرط نیست: «وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْكُمْ وَلَكِنْ لا تُبْصِرُونَ» (و ما به او از شما نزدیک‌تریم، ولی شما نمی‌بینید). و «وَلَقَدْ خَلَقْنَا الْإِنْسانَ وَنَعْلَمُ ما تُوَسْوِسُ بِهِ نَفْسُهُ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ» (و ما انسان را آفریدیم و می‌دانیم که نفسش چه وسوسه‌ای به او می‌کند و ما از رگ گردن به او نزدیک‌تریم). و وسوسه کجا و الهام کجا؟ و اسم انسان کجا و اسم عالم کجا؟\n\nپس لیلی کیست و لُبنی کیست *** و هند کیست و بُثینه کیست؟\nو قیس کیست و بشر کیست؟ *** آیا همه‌ی آنها عین او نیستند؟\nمن شیفته‌ی او شده‌ام *** آنگاه که هستی (الکون) از آنِ من باشد\nپس همه‌ی خلق محبوب من هستند *** پس شیفته‌ی من کجاست، کجاست؟\nهر کس در پی سخن من بگردد *** در میان خود، او را خواهد یافت.\n\nاما اهل جمال عَرَضی و عشق عَرَضی، سایه‌ای زوال‌پذیر و هدفی مایل و دیواری کج هستند. برخلاف آنچه نزد علمای بالله است؛ زیرا سایه نزد عالم بالله ساجد است و عارض (عارضه‌ی وجود) برای وجود مستعد است، و دیوار کج نشد مگر برای عبادت، تا گنجینه‌های معارفی که زیر آن است آشکار شود و عارفِ واقف به واسطه‌ی آن بی‌نیاز گردد. پس خداوند غیرت را در صورت خضر آفرید و او را از خمیدگی‌اش برپا داشت، زیرا می‌دانست که اهلیت در آن زمان در صاحب مال وجود نداشت تا تصرف در آن به وجه صحیح صورت گیرد، و «وَلَتَعْلَمَنَّ نَبَأَهُ بَعْدَ حِينٍ» (و خبر آن را پس از مدتی خواهی دانست). اگر آن گنج آشکار می‌شد، بیهوده گرفته می‌شد و دست‌ها در آن فساد می‌کردند. پس منزه است واضع حکم و برپا کننده‌ی آیات و آشکار کننده‌ی جمال دلالات. و از زیباترین آنها به عین و کامل‌ترین آنها به کَون، عالم خیال (الخيال) است. و خداوند به واسطه‌ی آن مَثَل‌ها زد و تعالی بیان کرد که او در علم خود منفرد است. زیرا او نهی‌کننده فرمود: «فَلا تَضْرِبُوا لِلَّهِ الْأَمْثالَ إِنَّ الله يَعْلَمُ وَأَنْتُمْ لا تَعْلَمُونَ» (پس برای خدا مَثَل‌ها نزنید، همانا خدا می‌داند و شما نمی‌دانید). و این آیه را نیاورد مگر هنگامی که برای ما از جانب خود مَثَل‌ها زد. پس برای کَون ظاهر شد و کَون مقدمه‌ی آن است. آیا رؤیا را نمی‌بینی؟ و خیال (الخيال) با همان چشم درک می‌شود. آنچه را که قبل از وجودش خواهد بود، و آنچه بوده است، و آنچه زمان بر آن است، می‌بیند. و در کدام حضرت این جامعیت را می‌یابی جز حضرت خیال (الخيال)؟ و هر کس عاشق امری شود، عاشق آن نمی‌شود مگر پس از آنکه آن را در خیال خود حاصل کند و در وهم خود برای آن مثالی قرار دهد و محبوب خود را بر مثال آن تطبیق دهد. و اگر امر چنین نبود، هرگاه کسی که چشم یا گوش یا یکی از حواسش به آن تعلق گرفته، از آن جدا می‌شد، تعلقش نیز از آن جدا می‌شد. و ما امر را چنین نمی‌یابیم. پس دلالت می‌کند بر اینکه محبوب نزد محب بر مثال صورتی است که در خیال خود ایجاد کرده است. پس مشاهده‌ی آن لازم می‌آید و وجدش دوچندان و محبتش افزون می‌شود. و آن مثالی که تصویر کرده، تصویرکننده‌اش را بر طلب کسی که او را بر صورت خود تصویر کرده، تحریک می‌کند؛ زیرا آن اصل، روح این خیال (الخيال) است و بقای آن به اوست و اوست که آن را حفظ می‌کند. و محبت محب شدید نشد مگر در صنعت و فعل او؛ زیرا صورتی که در خیالش به آن عاشق شده، از صنعت اوست. پس او جز آنچه به خودش باز می‌گردد، دوست نداشته است. پس به نفس خود تعلق یافته و فعل خود را ستوده است. هر کس این را بداند، محبت خداوند به بندگانش را می‌داند.\n\nو همانا او تعالی محبتش به بندگان شدیدتر است از محبت بندگان به او. بلکه بندگان او را به عین ذاتش دوست نمی‌دارند، بلکه احسان او را دوست دارند؛ زیرا احسان همان مشهود (الشهود) آنهاست. و هر کس او را به عین ذاتش دوست بدارد، در واقع مثالی را دوست داشته که در نفس خود تصویر و تخیل کرده است، و این مخصوص مُشَبّهه (کسانی که خدا را به خلق تشبیه می‌کنند) است. پس هر محبی، اگر تشبیه نبود، او را دوست نمی‌داشت و اگر تخیل نبود، به او تعلق نمی‌یافت. و به همین دلیل است که شارع او را در قبله‌ی خود قرار داد و قلب بنده‌اش او را وسعت داد و او را از نظر قرب به خود، مانند خود یا مانند برخی اجزای خود قرار داد. پس چنین کسانی او را به صورت مَثَل عبادت کردند و او را به صورت حاصل‌شده مشاهده (الشهود) نمودند. اما مُنَزّهه (کسانی که خدا را از هر تشبیهی منزه می‌دانند) در تاریکی کورکورانه‌ای حیرانند که در آن سرگردانند؛ تاریکی‌ای که نه سایه‌ای در آن است و نه چیزی که دلیل، آنها را از تشبیه باز دارد. و در آنجا ایمانی نیست که نورش بر نور ادله فائق آید تا آنها را در خود بگنجاند. پس مُنَزّه همواره بر چیزی دست نمی‌یابد و امری را حاصل نمی‌کند. آنها اهل بیت هستند، زیرا همّتشان پراکنده است و وهم از آنها دور است. پس نقص آنها از کمال معرفت (المعرفة) الوجود، حکم اوهام در آنهاست، در حالی که حکم اوهام تنها در مردان کامل (الکامل) جاری است. و به همین دلیل است که شرایع در مورد خداوند به اموری آمده‌اند که ادله‌ی عقلی آن را محال می‌دانند. پس هر کس نور ایمانش بر نور عقلش قوی‌تر شود، همانند قوی شدن نور خورشید بر نور سایر ستارگان است؛ که عین انوار آنها را از بین نمی‌برد، بلکه آنها را در نور خود می‌گنجاند. پس عالم تماماً به نور خورشید و نور ستارگان روشن است، اما مردم جز نور خورشید را نمی‌بینند و مجموع را نمی‌بینند. همچنین انسان کامل (الإنسان الکامل) از اهل الله، هنگامی که نور عقلش را در نور ایمانش بگنجاند، رأی مُنَزّهه را تأیید می‌کند، زیرا از آنچه انوارشان برایشان کشف کرده، فراتر نرفته‌اند؛ و رأی مُشَبّهه را نیز تأیید می‌کند، زیرا از ظاهر آنچه نور ایمانشان به واسطه‌ی مَثَل‌هایی که خداوند برایشان زده، به آنها داده، فراتر نرفته‌اند. پس انسان کامل او را هم به عقل و هم به ایمان شناخت و به درجه‌ی کمال دست یافت، همان‌گونه که خیال (الخيال) به درجه‌ی حس و معنی دست یافت. پس محسوس را لطیف کرد و معنی را کثیف نمود. از این رو، اقتدار تام برای او حاصل شد. و به همین دلیل یعقوب به پسرش گفت: «لا تَقْصُصْ رُؤْياكَ عَلى‏ إِخْوَتِكَ فَيَكِيدُوا لَكَ كَيْداً» (خوابت را برای برادرانت بازگو مکن که برای تو نیرنگی می‌اندیشند). زیرا او از علم آنها به تأویل آنچه حق (الحق) در رؤیایش برای او مَثَل زده بود، آگاه بود. آنچه او دیده بود و برایش مَثَل زده شده بود، جز عین برادران و پدر و مادرش نبود. پس خیال (الخيال) صورت برادران را به صورت ستارگان و صورت پدر و مادر را به صورت خورشید و ماه ایجاد کرد، در حالی که همه‌ی آنها گوشت و خون و رگ و عصب بودند. پس به این انتقال از عالم سُفل به عالم افلاک و از ظلمت این هیکل به نور این کوکب بنگر. پس کثیف را لطیف کرد. سپس به مرتبه‌ی تقدم و علو منزلت و معانی مجرد روی آورد و به آنها صورت سجده‌ی محسوس پوشاند. پس لطیف آنها را کثیف کرد، در حالی که رؤیا یکی است. اگر نیروی این حضرت (خیال) نبود، آنچه رخ داد، رخ نمی‌داد. و اگر این حضرت در وسط نبود، بر دو طرف حکم نمی‌کرد؛ زیرا وسط بر دو طرف حاکم است، چون حدّی برای آنهاست. همان‌گونه که اکنون عین گذشته و آینده است. همچنین خداوند رتبه‌ی انسان کامل (الإنسان الکامل) را واسطه‌ای قرار داد بین کینونت او که بر عرش مستوی است و کینونت او در قلب بنده‌اش که او را وسعت داده است. پس او در قلب خود به حق نظر می‌کند و می‌بیند که او نقطه‌ی دایره است، و در استوای او بر عرش نظر می‌کند و می‌بیند که او محیط دایره است. پس او «بِكُلِّ شَيْءٍ مُحِيطٌ» (بر هر چیزی احاطه دارد). هیچ خطی از نقطه ظاهر نمی‌شود مگر اینکه انتهایش به محیط است، و هیچ خطی از محیط از درونش ظاهر نمی‌شود مگر اینکه انتهایش به نقطه است. و این خطوط چیزی جز عالم نیستند. پس او «بِكُلِّ شَيْءٍ مُحِيطٌ» (بر هر چیزی احاطه دارد) و همه در قبضه‌ی اوست و «إِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ» (همه‌ی امور به سوی او بازگردانده می‌شود). پس خلأیی بین نقطه و محیط فرض نشده است. و اوست که عالم را به عین و کَون خود آباد کرده است. و در آن، استحالات از نقطه به محیط و از محیط به نقطه ظاهر شده است. پس هیچ چیز از او عز و جل خارج نشده است و چیزی خارج از محیط نیست که بخواهد وارد احاطه‌ی او شود، بلکه همه از او منبعث شده و به او ختم می‌شود و از او آغاز شده و به او باز می‌گردد. پس محیط او اسماء اوست و نقطه‌ی او ذات اوست. به همین دلیل او واحدِ عدد و واحدِ کثیر است. پس هر چشمی که به او می‌نگرد، جز چشم انسان نیست. و اگر انسان نبود، چشم انسان نمی‌نگریست. پس انسان به واسطه‌ی انسان نگریست و حق (الحق) به واسطه‌ی حق ظاهر شد.\n\nپس در او گفتیم حق (الحق) *** و در او گفتیم خلق\nو در او گفتیم دُرّ *** و در او گفتیم حق (الحق)\nپس او مَلِک (پادشاه) و مُلک (مُلکیت) است *** و او فَلَک (سپهر) و فُلک (کشتی) است\nپس هرگاه او را دوست بدارم *** به عشق می‌گوید: «هَيْتَ لَكَ» (آماده‌ام برای تو).\n\nیعنی هیئت من نیکو شد، زیرا «هَيْتَ لَكَ» (آماده‌ام برای تو). زیرا اگر حُسن عالم نبود، حُسن قدیم و جمال او دانسته نمی‌شد؛ و اگر جمال حق (الحق) نبود، در عالم جمالی ظاهر نمی‌شد. پس امر دوری است و فلک به واسطه‌ی آن می‌چرخد. و دوران فلک، تلاش آن است، در حالی که از جای خود جدا نشده است. پس او به کلیت خود منتقل شونده‌ای است که مکان خود را ترک نکرده است. این تنبیهی از جانب خداوند برای بندگانش یا مَثَل زدنی است بر اینکه حق (الحق)، اگرچه عالم را ایجاد کرد و خود را به آنچه وصف کرد، وصف نمود، اما همچنان در منزلت تنزیه و تمایز خود از خالقش به ذات خود باقی است، در عین حال که با هر خلقی از خلق خود همراه است. برخلاف خطوط که از وسط به حرکت درمی‌آیند و به سوی وسط می‌روند. پس آنها جدا شونده و قطع کننده‌ی منازل هستند، در حالی که حرکت وسط از منزلت خود جدا نشده و در غیر آن حرکت نکرده است. و این از عجایب مسائلی است که پرسشگر و پاسخ‌دهنده در آن حیران مانده‌اند.\n\nهان ای فلکِ گردان *** در سیر خود به سوی چه کسی روان هستی؟\nبه سوی ما؟ پس ما در درون شما هستیم *** به سوی او؟ پس سیر شما تباه است\nاو در ذات خود از حد متعالی است *** و گفت: او باطن (الباطن) و ظاهر (الظاهر) است\nبر ما به واسطه‌ی نفس‌هایمان می‌گردی *** و تو برای ما حکم قاهر هستی\nپس مشغولیت تو به من، شغلی مشغول‌کننده است *** و تو اگر این کار تمام شود، زیانکاری\nاما اگر در این کار به فرمان او باشی *** پس تو به واسطه‌ی او سودبرنده و تاجری\nو از بالای شما و سپس از بالای آن *** خدایی است که برای پیوستگی شما آفریننده است\nبه واسطه‌ی گسست در پیوستگی شما یاری شد *** پس عقل تو در صنع او حیران است\nبه همین دلیل می‌گردی و از جایگاه خود جدا نمی‌شوی *** در حالی که آینده و گذشته در آنجاست\nپس بایست! اما جبر (تقدیر) جز حرکت را نپذیرفت *** و گفت: من شکننده‌ی جبران‌کننده هستم\nچشمان خردها را پوشاندی، پس بازگشتند *** در حالی که دانستند من پوشاننده‌ام\nپس منزه است کسی که حکمش حکمت است *** و از عین اوست که وارد و صادر می‌شود\nو اگر تو نبودی، در افقش آشکار نمی‌شد *** به واسطه‌ی گردش تو، کوکبی درخشان.\n\nو هنگامی که خداوند تعالی عالم را آفرید و ذات عالم اقتضا کرد که برخی از آن به برخی دیگر استحاله یابد، به واسطه‌ی حقایقی که خداوند بر آن مرکب کرده و استعداد پذیرش استحاله، ذاتاً عوارض امکانی را که در عالم می‌بینی، طلب کرد. پس برخی از عالم در این طلب قصد دارند، و آن تعیین عارض خاصی است، مانند ایستاده‌ای که از کسی که تعقل می‌کند، نشستن را می‌طلبد. و برخی از آنها بدون قصد آن را می‌طلبند، مانند درختی که برای میوه‌ای که برای آن آفریده شده، آب‌دهی را می‌طلبد. و طلب آن برای این امر ذاتی است، بر مقداری معلوم؛ اگر از آن مقدار بیشتر شود، حکمش مانند حکم نقصانش در هلاکت است. و آب تحت حکم آن نیست، پس ناگزیر باید حافظی باشد که مقدار معلوم را بر آن حفظ کند، و او جز خالق آن نیست. و این امور عارضی که بر جوهر عالم عارض می‌شوند، برخی از آنها صلاح نامیده می‌شوند و برخی فساد. اما در نفس امر، صحیح نیست که فسادی بر عالم عارض شود که صلاحی در آن نباشد؛ زیرا این خلاف چیزی است که وجودش برای آن اراده شده است. اما صلاحی که فسادی در آن نباشد، همان واقعیت مراد سازنده‌ی عالم است، زیرا عالم را برای آن آفریده است. و اما احوال، ذاتی معانی هستند، زیرا آنها احکام معانی‌اند و نه وجود دارند و نه معدومند، مانند سرخی برای کسی که حُمرت (سرخی) در او قائم شده است. و این حکمی است که به خلق متصف نمی‌شود، زیرا معقول است و در وجود عینی، عینیتی ندارد. بلکه همه‌ی معانی که احکام خود را برای متصف‌شوندگان به آنها واجب کرده‌اند، نِسب عدمی هستند که در وجود عینیتی ندارند، اما حکم و حال دارند، و نه حکمشان و نه حالشان در وجود عینیتی ندارد. پس حاکم و محکوم‌به در حقیقت امور عدمی شده‌اند، در حالی که معقول هستند. پس در حقیقت، موجودی در موجودی اثر نمی‌گذارد، بلکه اثر برای معدوم در موجود و در معدوم است؛ زیرا اثر برای نِسب است و نِسب چیزی جز امور عدمی نیستند. این امر به بداهت در احکام مراتب آشکار می‌شود، مانند مرتبه‌ی سلطنت و مرتبه‌ی سوقیه (بازاری) در نوع انسانی، مثلاً سلطان در میان بازاریان به آنچه مرتبه‌ی سلطنت می‌خواهد، حکم می‌کند، در حالی که سلطنت وجود عینی ندارد. و چون حکم برای مراتب است، پس اعیانی که حقیقتشان این است که در نفس خود بر صورت طبیعی جسمی نباشند، اگر برای کسی که بر او ظاهر می‌شوند، در صورت طبیعی جسدانی در عالم تمثیل ظاهر شوند، مانند فرشته که به صورت «بَشَراً سَوِيًّا» (بشری معتدل) متمثل می‌شود، و مانند تجلی (التجلی) الهی در صور؛ آیا آن صورت ظاهری در چشم بیننده، حکم آن صورتی را که حقیقت آن برای اوست، می‌پذیرد؟ مانند صورت انسان و حیوان که بر آن حکم به تفکر و وجود آلام و لذات می‌شود. آیا آن صورتی که ظاهر شده، شبیه حیوان یا انسان یا هر چه بوده، این حکم را در نفس امر می‌پذیرد؟ یا بیننده اگر نداند که آن انسان یا حیوان است، حق ندارد بر آن حکم کند به آنچه بر عین آن صورت حکم می‌کند؟ امر در این باره چگونه است؟ پس بدان که فرشته در نفس و عین خود بر صورتی است که با بشر تفاوت دارد. و همان‌گونه که با بشر تفاوت دارد، بشر نیز با او تفاوت دارد. مانند جبرئیل که به صورت یک اعرابی ظاهر شد. آیا کلام و حرکت معتاد آن صورت در انسان، در صورت متمثل نیز همان‌گونه است که در انسان است؟ یا آن نیز از صورت است، همان‌گونه که صورت نیز متخیّل است؟ و آیا همه‌ی احکام آن صورت، از قوای قائم به آن در انسان، از آن تبعیت می‌کند، همان‌گونه که کلام و حرکت و کیفیات ظاهری در آن قائم شده است؟ پس او در حقیقت یک انسان خیالی است، منظورم فرشته در آن زمان است. و حکم آن صورت را در نفس امر نیز دارد، به همان حدّ صورت که یک انسان خیالی است. پس هرگاه آن صورت از بین برود، احکامش نیز به دلیل از بین رفتن آن از بین می‌رود. و سبب این امر آن است که جوهر عالم در اصل واحد است و از حقیقت خود تغییر نمی‌کند، و هر صورتی که در آن ظاهر می‌شود، عارضی است که در نفس امر در هر زمان فردی استحاله می‌یابد. و حق (الحق) همواره امثال را ایجاد می‌کند، زیرا او خالق دائمی است. و ممکنات در حال عدم خود، مهیای پذیرش وجود هستند. پس هرگاه صورتی در آن جوهر ظاهر شود، با همه‌ی احکامش ظاهر می‌شود، خواه آن صورت محسوس باشد یا متخیّل. زیرا احکامش از آن تبعیت می‌کند، چنانکه\n\nاعرابی هنگامی که شنید رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) حق (الحق) جل جلاله را به خندیدن وصف می‌کند، گفت: «لا نعدم خيرا من رب يضحك» (از پروردگاری که می‌خندد، خیری را از دست نمی‌دهیم).\n\nزیرا از شأن کسی که می‌خندد این است که انتظار وجود خیر از او رود. پس همان‌گونه که وجود خنده از صورت تبعیت کرد، وجود خیر نیز از آن تبعیت کرد. و این در جناب الهی است، پس چگونه در جوهر عالم نباشد؟ و چنین امری نزد هیچ عالمی آسان نیست و هیچ گشاده‌خاطری آن را نمی‌پذیرد، مگر کسی که بداند جوهر عالم همان نَفَس رحمانی (النفس الرحمانی) است که صور عالم در آن ظاهر شده است. و کسی که این را نداند، در پذیرش آن در حق حق (الحق) و حق هر ظاهری در صورتی که می‌داند حقیقت آن برای او نیست، در خود تکلف و مشقت می‌یابد. پس تأویل می‌کند و در اوقات تأویل بر او دشوار می‌شود، در نتیجه ایمان می‌آورد و تسلیم می‌شود، اما نمی‌داند امر چگونه است. برخلاف عالم محقق که خداوند او را بر آنچه امور در نفس خود بر آن هستند، آگاه کرده است. پس عالم تماماً از حیث جوهرش شریف است و تفاضلی در آن نیست، و کرم و عقل اول (العقل الأول) در فضیلت جوهر مساوی هستند. و تفاضل جز در صور ظاهر نشده است، و صور همان احکام مراتب هستند: شریف و شریف‌تر، و پست و پست‌تر. و هر کس این را بداند، پذیرش همه‌ی آنچه شرایع در حق خداوند و سرای آخرت و امور غایب آورده‌اند، بر او آسان می‌شود؛ اموری که عقول با افکار خود آنها را درک نمی‌کنند و مدرکی جز خبر ندارند. و صور چیزی جز اعیان ممکنات نیستند و جوهر عالم نیز جز همان چیزی نیست که ذکر کردیم. پس اطلاق بر عالم از حیث جوهرش حکمی دارد که از حیث صورتش ندارد، و از حیث صورتش حکمی دارد که از حیث جوهرش ندارد. پس برخی از مردم این را از طریق کشف (الکشف) دانسته‌اند، و آنها اصحاب ما و رسولان و انبیا و مقربان هستند. و برخی از مردم آن را در قوه‌ی خود و در عقل خود یافته‌اند، اما ندانسته‌اند که از کجا آمده و چگونه برایشان حاصل شده است. پس با اهل کشف (الکشف) در حکم شریک می‌شوند، اما به تحقیق نمی‌دانند امر چیست. و آنها همان قائلان به علّت و قائلان به دهر و قائلان به طبیعت هستند. و غیر از این طوایف، خبری از این حکم ندارند، همان‌گونه که این طوایف به آنچه اهل الله می‌دانند، علم ندارند، اگرچه در این حکم شریک باشند. اگر از علمای طایفه‌ای از آنها بپرسی، عین آنچه اهل الله بیان کرده‌اند را انکار نمی‌کنند. و حکم به آن قول بر آنها حاکم نشده است، مگر آنچه اهل الله دانسته‌اند، در حالی که قائلان به علّت از آن بی‌خبرند. آیا نمی‌بینی که شارع، که خبردهنده از جانب خداست، حق (الحق) را به امری که در آن تفصیل است، وصف نکرده است، مگر اینکه آن صفتِ مُحدَثِ مخلوق است، با وجود قِدَمِ موصوف به آن که خداست؟ و عقل از حیث نظر و فکر خود در این باره قِدَمی ندارد. و سبب آن را نمی‌داند و نمی‌داند که آن صورت او در جوهر عالم است، بلکه تخیل می‌کند که عین جوهر است. اگر سلامت می‌خواهی، پروردگاری را عبادت کن که خود را به آنچه وصف کرده، وصف نموده و تشبیه را نفی کرده و حکم را چنانکه هست، اثبات نموده است؛ زیرا جوهر عین صورت نیست، پس حکم تشبیه بر آن جاری نیست. و به همین دلیل فرمود: «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست)، به دلیل عدم مشابهت، زیرا حقایق آن را دور می‌اندازند، و «وَهُوَ السَّمِيعُ الْبَصِيرُ» (و او شنوای بیناست)، برای اثبات صور، زیرا او فصلی زنده است. پس هر کس پروردگارش را از خبر او از خودش نشناسد، «فَقَدْ ضَلَّ ضَلالًا مُبِيناً» (به گمراهی آشکاری گمراه شده است). و پایین‌ترین درجه‌ی او این است که به خبر در صفاتش ایمان آورد، همان‌گونه که ایمان آورد که چیزی مانند او نیست. و هر دو حکم، از نظر عقلی و پذیرش، حق است. و خداوند می‌فرماید: «إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ» (همانا او بر هر چیزی احاطه دارد) و بر هر چیزی حافظ است. آیا می‌بینی که او بر چیزی احاطه دارد در حالی که آن چیز خارج از اوست؟ و وجود آن را بدون نسبت به خود حفظ می‌کند؟ پس امور در هم تنیده و احکام متحد شده و اعیان متمایز گشته‌اند. پس از یک جهت گفته شد: این، آن نیست (درباره‌ی زید و عمرو)؛ و از جهتی گفته شد: این، عین آن است (درباره‌ی زید و عمرو)، و همانا او انسان است. همچنین در مورد عالم از حیث جوهرش و از حیث صورتش می‌گوییم، چنانکه خداوند فرمود: «لَيْسَ كَمِثْلِهِ شَيْءٌ» (چیزی مانند او نیست)، و منظور او همین است که چیزی مانند او نیست، و «وَهُوَ السَّمِيعُ الْبَصِيرُ» (و او شنوای بیناست). و حکم شنیدن، حکم دیدن نیست. پس جدا کرد و وصل نمود، و نه جدا شد و نه وصل گردید.\n\nپس «فَمَنْ شاءَ فَلْيُؤْمِنْ وَمَنْ شاءَ فَلْيَكْفُرْ» (پس هر کس می‌خواهد ایمان آورد و هر کس می‌خواهد کفر ورزد) *** و هر کس می‌خواهد عاجز شود و هر کس می‌خواهد بنگرد\nپس هر کس علمی را که من دانستم، بداند *** سزاوار است که شادمان باشد و شکر کند\nاگر تقوا به او رسید، پس زیرک باش به آنچه *** به کسی می‌گوید که آن را می‌داند و درک می‌کند\nو این سخن را برای خلق به باطل نگفت *** بلکه آن تذکری است برای هر کس که بخواهد متذکر شود\nاو حیرت کورکورانه است برای کسی که کور است *** و او آشکارترین منظر است برای صاحب بصری که می‌بیند\nو هنگامی که در وجودِ عَمای (تاریکی) او ظاهر شدیم *** وجود قرب را در خود دانستیم و محصور نشدیم.\n\n### وصل إشارة وتنبيه (وصل: اشاره و تنبیه)\n\nبدان که هر متکلمی از مردم به سخنی، آن را بر زبان نمی‌آورد مگر اینکه آن را در نفس خود تخیل کند و صورتی برای آن برپا سازد که از آن تعبیر کند؛ این برای او ضروری است. و چون خیال (الخيال) برای خودش اراده نمی‌شود، بلکه برای بروز به وجود حسی در عین خود اراده می‌شود، یعنی حکمش در حس ظاهر شود؛ زیرا متخیَّل گاهی مرتبه است و گاهی چیزی است که صورت وجودی را می‌پذیرد. مانند کسی که تخیل می‌کند فرزندی داشته باشد، پس فرزندی برایش متولد می‌شود و به صورت شخصی ایستاده مانند خودش در چشمش ظاهر می‌گردد. و گاهی تخیل می‌کند که پادشاه باشد، و این یک مرتبه است، پس پادشاه می‌شود، در حالی که مُلک (پادشاهی) در وجود عینیتی ندارد، بلکه یک نسبت است. و چون چنین است، و آنچه تخیل می‌شود مانند رؤیا تعبیر می‌شود، همچنین هر کلامی تعبیر و تأویل می‌شود. پس در کَون کلامی نیست که تأویل نشود. و به همین دلیل فرمود: «وَلِنُعَلِّمَهُ مِنْ تَأْوِيلِ الْأَحادِيثِ» (و تا او را از تأویل احادیث بیاموزیم). و هر کلامی نزد شنونده حادث است. پس برخی از تأویل‌ها مطابق با مراد متکلم از سخنش است و برخی از تأویل‌ها خطا از مراد متکلم است، اگرچه تأویل در هر وجهی صحیح باشد، چه مراد متکلم را خطا کند و چه به آن برسد. هیچ امری نیست مگر اینکه قابلیت تعبیر از آن را دارد. و در این باره، فهم شنونده‌ای که آن اصطلاح یا آن عبارت را نمی‌فهمد، لازم نیست. زیرا علوم اذواق و کیفیات، اگرچه قابلیت انتقال دارند، اما چون سخن گفتن و تعبیر از آنها برای فهماندن به شنونده است، از این رو گفته‌اند: «آنچه گفته نمی‌شود». و لازم نیست کسی که آن را درک می‌کند، اما شنونده آن را نمی‌فهمد، با خود بر لفظی اصطلاح نکند که بر آنچه چشیده دلالت کند، تا آن لفظ برای او یادآور و متذکر باشد، اگر در وقت دیگری آن را فراموش کند، حتی اگر کسی که ذوقی در آن ندارد، از او نفهمد. و تأویل (التأویل) عبارت است از آنچه آن حدیث که نزد او در خیالش حادث شده، به آن باز می‌گردد. و خبر دادن از امور، «عبارت» نامیده نشد و تعبیر در رؤیا، «تعبیر» نامیده نشد، مگر به این دلیل که خبردهنده با آنچه سخن می‌گوید، عبور می‌کند، یعنی با آنچه سخن می‌گوید، از حضرت نفس خود به نفس شنونده می‌گذرد. پس آن را از خیالی به خیالی دیگر منتقل می‌کند، زیرا شنونده آن را به اندازه‌ی فهم خود تخیل می‌کند. پس ممکن است خیال شنونده با خیال متکلم مطابقت کند و ممکن است مطابقت نکند. اگر مطابقت کرد، فهم از او نامیده می‌شود، و اگر مطابقت نکرد، فهمیده نمی‌شود. سپس کسی که از او حدیث می‌شود، ممکن است با لفظی از او حدیث کند که با آنچه در نفس خود بر آن است، مطابقت داشته باشد. در این صورت، عبارت نامیده می‌شود. و اگر مطابقت نکند، لفظ است نه عبارت؛ زیرا با آن از محل خود به محل شنونده عبور نکرده است. و فرقی نمی‌کند که آن کلام به چه کسی نسبت داده شود. مقصود ما از این اشاره، تنبیه بر عظمت رتبه‌ی خیال (الخيال) است و اینکه او حاکم مطلق در معلومات است. با این تفاوت که تعبیر از غیر رؤیا چهار حرفی است و تعبیر از رؤیا سه حرفی است (یعنی در رؤیا)، در حالی که از نظر معنی یکسان هستند. و عین الفعل در ماضی در تعبیر رؤیا مفتوح است و در مستقبل مضموم و مخفف است، در حالی که در غیر رؤیا در ماضی و مستقبل مضاعف است، در ماضی مفتوح العین و در مستقبل مکسور العین است. و تضعیف (تشدید) در غیر رؤیا به دلیل قوت در عبارت است، زیرا آن در خیال (الخيال) ضعیف‌تر از رؤیاست. زیرا تعبیرکننده در غیر رؤیا از امری متخیّل در نفس خود تعبیر می‌کند که آن را ابتدا احضار کرده و آن را چنان قرار داده که گویی آن را حساً می‌بیند. پس از کسی که از خیال بدون فکر و احضار تعبیر می‌کند، ضعیف‌تر است، مانند صاحب رؤیا؛ زیرا خیال در آنجا آنچه در اوست را بدون احضار از سوی بیننده برای او آشکار کرده است. اما بیدار چنین نیست، پس به دلیل حجاب حس، تخیلش ضعیف است. پس به قوت نیاز پیدا کرد، در نتیجه تعبیر از آن ضعیف شد. پس گفته شد: فلان از فلان چیز با فلان چیز تعبیر کرد، با تشدید عین الفعل. آیا نمی‌بینی که در عبور از وادی می‌گویند: «عَبَرتُ النهر أعبُرُه» (از رودخانه عبور کردم، عبور می‌کنم) بدون تضعیف؟ زیرا رودخانه در اینجا احضار نشده، بلکه در حس حاضر است، همان‌گونه که آن در خیال بدون احضار حاضر بود. پس به دلیل مشقت در احضار، از تضعیف کمک گرفت. و استعانت همواره به تضعیف اشاره دارد، هر جا که ظاهر شود؛ زیرا کمک خواسته نمی‌شود مگر از کسی که در قوتش مقاومت در برابر آن امری که برای آن کمک می‌خواهد، نیست. پس هر کاری که استقلال در آن ممکن نباشد، عامل آن ناگزیر باید کمک و یاری‌دهنده برای آن طلب کند. پس بفهم، زیرا از اینجا رتبه‌ی چیزی را می‌شناسی که وجودش برای ایجادکننده‌اش ممکن نیست، مگر با کمک امر دیگری که عین ایجادکننده نیست. پس آن امر دیگر، یاری‌دهنده‌ی او بر اظهار آن امر است. و در اینجا معنای قول خداوند ظاهر می‌شود: «حَتَّى يَسْمَعَ كَلامَ الله» (تا کلام خدا را بشنود). اگر حق (الحق) بخواهد آن را به گوش شنونده با اصوات و حروف یا ایما و اشاره برساند، ناگزیر واسطه‌ای لازم است، زیرا قیام حوادث به او تعالی محال است. پس بفهم. و «وَعَلَى الله قَصْدُ السَّبِيلِ» (و بر خداست که راه راست را بنمایاند). و در این منزل از علوم، علم به آنچه به آن نیازمند است و به آن متصل نمی‌شود، وجود دارد. و در آن علم بیان جمع است که عین فرق است. و در آن علم فرق بین علم خبر و علم نظر عقلی و علم نظر کشفی (الکشف) است که با ادراک حواس حاصل می‌شود. و در آن علم تنبیه غافل است که با چه چیزی تنبیه می‌شود و مراتب تنبیه چیست. و در آن علم شرف علم بر شرف رؤیت است. زیرا ممکن است شخصی چیزی را ببیند و نداند چیست، پس آن را برای دیگری بازگو کند و آن دیگری به او بگوید که چیست، اگرچه آن را ندیده باشد. پس علم کامل‌تر از رؤیت است، زیرا رؤیت راهی از راه‌های علم است که با سلوک در آن، کسی که بر آن است، به امر خاصی می‌رسد. و در آن علم ظهور باطل در صورت حق (الحق) است، در حالی که این دو بر نقیض یکدیگرند. و محال است که امری در صورت امر دیگری بدون تناسب ظاهر شود. پس آن در نسبت مانند آن است، نه در عین. و این در صنعت نحو، فعل مقاربه است. در این باره می‌گویند: «کاد النعام یطیر» (نزدیک بود شترمرغ پرواز کند) و «کاد العروس یکون أمیراً» (نزدیک بود داماد امیر شود). و حق تعالی در چشم بیننده، سراب را آب نشان می‌دهد، در حالی که آب نیست. و آن نزد اوست هنگامی که تشنه به سوی آن می‌آید. همچنین کسی که تشنه‌ی علم به خداست، به نظر در علم به او می‌پردازد، پس آن نظر به او تقیید تنزیه یا تشبیه می‌دهد. پس هنگامی که پرده کنار رود، که همان حال رسیدن تشنه به سراب است، آن را چنان که مقید کرده بود، نمی‌یابد. پس آن را انکار می‌کند و خداوند را نزد خود غیر مقید به آن تقیید خاص می‌یابد، بلکه برای او اطلاق در تقیید است. «فَوَفَّاهُ حِسابَهُ» (پس حساب او را به طور کامل داد)، یعنی تقدیر او را. پس گویی صاحب این حال می‌خواست حق (الحق) را از تقیید خارج کند، پس حق با قولش به او گفت: «فَوَفَّاهُ حِسابَهُ» (پس حساب او را به طور کامل داد)؛ در این مشهد جز علم به من برای تو حاصل نمی‌شود که من مطلق در تقیید هستم، زیرا من عین هر تقییدی هستم، چون من تمام عالم هستم که مشهود و معلوم است. و این همان کید الهی است از قول او: «وَأَكِيدُ كَيْداً» (و من نیز نیرنگی می‌زنم) و «وَمَكَرُوا وَمَكَرَ الله» (و مکر کردند و خدا نیز مکر کرد). و در آن علم به آنچه به اجلی بسته است و ظاهر نمی‌شود تا زمانی که کتاب به اجل خود در آن برسد، وجود دارد. و در آن علم ارزش مَثَل است. و در آن علم تنزیه انبیا از طامات (سخنان باطل) است که مفسران به آنها نسبت داده‌اند، اموری که در کتاب خدا نیامده است، در حالی که گمان می‌کنند کلام خدا را در آنچه درباره‌ی آنها خبر داده، تفسیر کرده‌اند. از خداوند عصمت در قول و عمل را می‌خواهیم. به راستی که در این باره مرتکب بزرگ‌ترین گناهان شده‌اند، مانند مسئله‌ی ابراهیم خلیل (علیه السلام) و شکی که به او نسبت داده‌اند، و به این قول رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم) نظر نکرده‌اند:\n\nدر قول رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم): «نحن أولى بالشك من إبراهيم» (ما به شک سزاوارتر از ابراهیم هستیم).\n\nزیرا ابراهیم (علیه السلام) در زنده‌کردن مردگان شک نکرد، بلکه چون می‌دانست که زنده‌کردن مردگان وجودهای متعدد و مختلفی دارد، نمی‌دانست خداوند با کدام وجه از آنها مردگان را زنده می‌کند، در حالی که او بر طلب علم سرشته شده بود. پس خداوند وجهی از آن وجوه را برای او تعیین کرد تا قلبش به آن آرام گیرد و بداند که خداوند چگونه مردگان را زنده می‌کند. و همچنین است داستان یوسف و لوط و موسی و داوود و محمد (علیهم السلام) الهی. و همچنین آنچه در داستان سلیمان به دو فرشته نسبت داده‌اند. همه‌ی اینها از یهود نقل شده است و با آنچه یهود ذکر کرده‌اند، که خداوند آنها را جریحه‌دار کرده است، آبروی انبیا و فرشتگان را حلال شمرده‌اند و کتاب‌های تفسیر قرآن عزیز خود را از آن پر کرده‌اند، در حالی که در این باره نه نصی در کتاب است و نه در سنت. از خداوند می‌خواهیم که ما و شما را از لغزش‌های افکار و اقوال و افعال حفظ کند. آمین به عزت و قوت او. و در آن علم کسی است که دلیل بر عصمت او قائم شده است، پس او حق دارد که خود را به صفات ستوده‌ای که خداوند او را بر آن آگاه کرده، ثنا گوید؛ زیرا آنها از بزرگ‌ترین نعمت‌های الهی بر بنده‌اش هستند. و خداوند می‌فرماید: «وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ» (و اما نعمت پروردگارت را بازگو کن). و در آن علم تسلیم و اعتصام است. و در آن علم رتبه‌ی خیال (الخيال) است و اینکه او حق است و هیچ باطلی در آن نیست، مگر اینکه تعبیرکننده بر اساس آنچه در نزول به مواطن می‌بیند، خطا می‌کند یا به صواب می‌رسد. پس کسی که حقایق را از مراتبشان فراتر نبرد، به صواب رسیده است. و در آن علم اسماء است و آنچه از آنها پرستیده شده و آنچه پرستیده نشده است. و در آن علم معرفت (المعرفة) منازل موجودات است. و در آن علم سِتر و تجلی (التجلی) است. و در آن علم برتری دادن در علم است. و در آن علم شکر و شاکر است. و در آن علم آیات معتاد و غیر معتاد است. و در آن علم تبرّی و تنزیه است، و آنچه در حق خداوند عز و جل تنزیه است، در حق مخلوق تبرّی است و تنزیه نیست. و در آن علم تقسیم اهل الله و طبقات آنهاست. و «وَالله يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ» (و خداوند حق را می‌گوید و او راه را می‌نمایاند). سفر بیست و ششم از فتوحات مکیه با پایان باب سیصد و هفتاد و دوم به پایان رسید. بسم الله الرحمن الرحیم."
  },
  "page_count": 7
}