{
  "id": 22,
  "title": {
    "ar": "الباب الثاني والعشرون في معرفة علم منزل المنازل وترتيب جميع العلوم الكونية",
    "en": "Chapter Twenty-Two: On the Knowledge of the Science of the Station of Stations (علم منزل المنازل) and the Arrangement of all Universal Sciences (العلوم الكونية).",
    "ur": "باب بائیسواں: منزل المنازل (منزل المنازل) کے علم کی معرفت اور تمام کونیاتی علوم کی ترتیب کا بیان",
    "fa": "باب بیست و دوم در معرفت علم منزل المنازل و ترتیب تمامی علوم کونی (جهانی)"
  },
  "content": {
    "ar": "## «الباب الثاني والعشرون في معرفة علم منزل المنازل وترتيب جميع العلوم الكونية»\n\n\n> عجبا لأقوال النفوس السامية *** إن المنازل في المنازل سارية\n\n\n> كيف العروج من الحضيض إلى العلى *** إلا بقهر الحضرة المتعالية\n\n\n> فصناعة التحليل في معراجها *** نحو اللطائف والأمور السامية\n\n\n> وصناعة التركيب عند رجوعها *** بسنا الوجود إلى ظلام الهاوية\n### [ترتيب العلوم وإحصاؤها]\n\n\nاعلم أيدك الله أنه لما كان العلم المنسوب إلى الله لا يقبل الكثرة ولا الترتيب فإنه غير مكتسب ولا مستفاد بل علمه عين ذاته كسائر ما ينسب إليه من الصفات وما سمي به من الأسماء وعلوم ما سوى الله لا بد أن تكون مرتبة محصورة سواء كانت علوم وهب أو علوم كسب فإنها لا تخلو من هذا الترتيب الذي نذكره وهو علم المفرد أولا ثم علم التركيب ثم علم المركب ولا رابع لها فإن كان من المفردات التي لا تقبل التركيب علمه مفردا وكذلك ما بقي فإن كل معلوم لا بد أن يكون مفردا أو مركبا والمركب يستدعي بالضرورة تقدم علم التركيب وحينئذ يكون علم المركب‏\n\n\n### [للنازل للتسعة عشر]\n\n\nفهذا قد علمت ترتيب جميع العلوم الكونية فلنبين لك حصر المنازل في هذا المنزل وهي كثيرة لا تحصى ولنقتصر منها على ما يتعلق بما يختص به شرعنا ويمتاز به لا بالمنازل التي يقع فيها الاشتراك بيننا وبين غيرنا من سائر علوم الملل والنحل وجملتها تسعة عشر مرتبة أمهات ومنها ما يتفرع إلى منازل ومنها ما لا يتفرع فلنذكر أسماء هذه المراتب ولنجعل لها اسم المنازل فإنه كذا عرفنا بها في الحضرة الإلهية والأدب أولى فلنذكر ألقاب هذه المنازل وصفات أربابها وأقطابها المتحققين بها وأحوالهم وما لكل حال من هذه الأحول من الوصف ثم بعد ذلك نذكر إن شاء الله كل صنف من هذه التسعة عشر ونذكر بعض ما يشتمل عليه من أمهات المنازل لا من المنازل فإنه ثم منزل يشتمل على ما يزيد على المائة من منازل العلامات والدلالات على أنوار جلية ويشتمل على آلاف وأقل من منازل الغايات الحاوية على الأسرار الخفية والخواص الجلية ثم نتلو ما ذكرنا بما يضاهي هذا العدد لهذه المنازل من الموجودات قديمها وحديثها ثم نذكر ما يتعلق ببعض معاني هذا المنزل على التقريب والاختصار إن شاء الله تعالى‏\n\n\n### «ذكر ألقابها وصفات أقطابها»\n\n\nفمن ذلك منازل الثناء والمدح هو لأرباب الكشوفات والفتح ومنازل الرموز والألغاز لأهل الحقيقة والمجاز ومنازل الدعاء لأهل الإشارات والبعد ومنازل الأفعال لأهل الأحوال والاتصال ومنازل الابتداء لأهل الهواجس والإيماء ومنازل التنزيه لأهل التوجيه في المناظرات والاستنباط ومنازل التقريب للغرباء المتألهين ومنازل التوقع لأصحاب البراقع من أجل السبحات ومنازل البركات لأهل الحركات ومنازل الأقسام لأهل التدبير من الروحانيين ومنازل الدهر لأهل الذوق ومنازل الإنية لأهل المشاهدة بالأبصار ومنازل اللام والألف للالتفاف الحاصل بالتخلق بالأخلاق الإلهية ولأهل السر الذي لا ينكشف ومنازل التقرير لأهل العلم بالكيمياء الطبيعية والروحانية ومنازل فناء الأكوان للضنائن المخدرات ومنازل الألفة لأهل الأمان من أهل الغرف ومنازل لوعيد للمتمسكين بقائمة العرش الأمجد ومنازل الاستخبار لأهل غامضات الأسرار ومنازل الأمر للمتحققين بحقائق سره فيهم وأما صفاتهم فأهل المدح لهم الزهو وأهل الرموز لهم النجاة من الاعتراض وأما المتألهون فلهم التيه بالتخلق وأما أهل الأحوال والاتصال فلهم الحصول على العين وأما أهل الإشارة فلهم الحيرة عند التبليغ وأما أهل الاستنباط فلهم الغلط والإصابة وليسوا بمعصومين وأما الغرباء فلهم الانكسار وأما أهل البراقع فلهم الخوف وأما أهل الحركة فلهم مشاهدة الأسباب والمدبرون لهم الفكر والممكنون لهم الحدود وأهل المشاهد لهم الجحد وأهل الكتم لهم السلامة وأهل العلم لهم الحكم على المعلوم وأهل الستر منتظرون رفعه وأهل الأمن في موطن الخوف من المكر وأهل القيام لهم القعود وأهل الإلهام لهم التحكم وأهل التحقيق لهم ثلاثة أثواب ثوب إيمان وكفر ونفاق‏\n\n\n### [أحوال أرباب للنازل‏]\n\n\nوأما ذكر أحوالهم فاعلم إن الله تعالى قد هيأ المنازل للنازل ووطأ المعاقل للعاقل وزوي المراحل للراحل وأعلى المعالم للعالم وفصل المقاسم للقاسم وأعد القواصم للقاصم وبين العواصم للعاصم ورفع القواعد للقاعد ورتب المراصد للراصد وسخر المراكب للراكب وقرب المذاهب للذاهب وسطر المحامد للحامد وسهل المقاصد للقاصد وأنشأ المعارف للعارف وثبت المواقف للواقف ووعر المسالك للسالك وعين المناسك للناسك وأخرس المشاهد للشاهد وأحرس الفراقد للراقد\n\n\n### «ذكر صفات أحوالهم»\n\n\nفإنه سبحانه جعل النازل مقدرا والعاقل مفكرا والراحل مشمرا والعالم مشاهدا والقاسم مكابدا والقاصم مجاهدا والعاصم مساعدا والقاعد عارفا والراصد واقفا والراكب محمولا والذاهب معلولا والحامد مسئولا والقاصد مقبولا والعارف مبخوتا والواقف مبهوتا والسالك مردودا والناسك مبعودا والشاهد\nمحكما والراقد مسلما فهذا قد ذكرنا صفات هؤلاء التسعة عشر صنفا في أحوالهم فلنذكر ما يتضمن كل صنف من أمهات المنازل وكل منزل من هذه الأمهات يتضمن أربعة أصناف من المنازل الصف الأول يسمى منازل الدلالات والصنف الآخر يسمى منازل الحدود والصنف الثالث يسمى منازل الخواص والصنف الرابع يسمى منازل الأسرار ولا تحصى كثرة فلنقتصر على التسعة عشر ولنذكر أعداد ما تنطوي عليه من الأمهات وهذا أولها\n\n\n### [منزل المدح‏]\n\n\nمنزل المدح له منزل الفتح فتح السرين ومنزل المفاتيح الأول ولنا فيه جزء سميناه مفاتيح الغيوب ومنزل العجائب ومنزل تسخير الأرواح البرزخية ومنزل الأرواح العلوية ولنا في بعض معانيه من النظم قولنا\n\n\n> منازل المدح والتباهي *** منازل ما لها تناهي‏\n\n\n> لا تطلبن في السمو مدحا *** مدائح القوم في الثرى هي‏\n\n\n> من ظمئت نفسه جهادا *** يشرب من أعذب المياه‏\n\n\nنقول ليس مدح العبد أن يتصف بأوصاف سيده فإنه سوء أدب وللسيد أن يتصف بأوصاف عبده تواضعا فللسيد النزول لأنه لا يحكم عليه فنزوله إلى أوصاف عبده تفضل منه على عبده حتى يبسطه فإن جلال السيد أعظم في قلب العبد من أن يدل عليه لو لا تنزله إليه وليس للعبد أن يتصف بأوصاف سيده لا في حضرته ولا عند إخوانه من العبيد وإن ولاة عليهم كما\n\n\nقال عليه السلام أنا سيد ولد آدم ولا فخر\n\n\nوقال تعالى تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها أي نملكها ملكا لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ فإن الأرض قد جعلها الله ذلولا والعبد هو الذليل والذلة لا تقتضي العلو فمن جاوز قدره هلك يقال ما هلك امرؤ عرف قدره وقوله ما لها تناهي يقول إنه ليس للعبد في عبوديته نهاية يصل إليها ثم يرجع ربا كما أنه ليس للرب حد ينتهي إليه ثم يعود عبدا فالرب رب إلى غير نهاية والعبد عبد إلى غير نهاية فلذا قال مدائح القوم في الثرى هي وهو أذل من وجه الأرض وقال لا يعرف لذة الماء إلا الظمآن يقول لا يعرف لذة الاتصاف بالعبودية إلا من ذاق الآلام عند اتصافه بالربوبية واحتياج الخلق إليه‏\n\n\nمثل سليمان حين طلب أن يجعل الله أرزاق العباد على يديه حسا فجميع ما حضره من الأقوات في ذلك الوقت فخرجت دابة من دواب البحر فطلبت قوتها فقال لها خذي من هذا قدر قوتك في كل يوم فأكلته حتى أتت على آخره فقالت زدني فما وفيت برزقي فإن الله يعطيني كل يوم مثل هذا عشر مرات وغيري من الدواب أعظم مني وأكثر رزقا فتاب سليمان عليه السلام إلى ربه وعلم أنه ليس في وسع المخلوق ما ينبغي للخالق تعالى‏\n\n\nفإنه طلب من الله ملكا لا ينبغي لأحد من بعده فاستقال من سؤاله حين رأى ذلك واجتمعت الدواب عليه تطلب أرزاقها من جميع الجهات فضاق لذلك ذرعا فلما قبل الله سؤاله وأقاله وجد من اللذة لذلك ما لا يقدر قدره‏\n\n\n(منزل الرموز)\n\n\nفاعلم وفقك الله أنه وإن كان منزلا فإنه يحتوي على منازل منها منزل الوحدانية ومنزل العقل الأولي والعرش الأعظم والصدا والإتيان من العلماء إلى العرش وعلم التمثل ومنزل القلوب والحجاب ومنزل الاستواء الفهواني والألوهية السارية واستمداد الكهان والدهر والمنازل التي لا ثبات لها ولا ثبات لأحد فيها ومنزل البرازخ والإلهية والزيادة والغيرة ومنزل الفقد والوجدان ومنزل رفع الشكوك والجود والمخزون ومنزل القهر والخسف ومنزل الأرض الواسعة ولما دخلت هذا المنزل وأنا بتونس وقعت مني صيحة ما لي بها علم أنها وقعت مني غير أنه ما بقي أحد ممن سمعها إلا سقط مغشيا عليه ومن كان على سطح الدار من نساء الجيران مستشرفا علينا غشى عليه ومنهن من سقط من السطوح إلى صحن الدار على علوها وما أصابه بأس وكنت أول من أفاق وكنا في صلاة خلف إمام فما رأيت أحدا إلا صاعقا فبعد حين أفاقوا فقلت ما شأنكم فقالوا أنت ما شأنك لقد صحت صيحة أثرت ما ترى في الجماعة فقلت والله ما عندي خبر أني صحت ومنزل الآيات الغربية والحكم الإلهية ومنزل الاستعداد والزينة والأمر الذي مسك الله به الأفلاك السماوية ومنزل الذكر والسلب وفي هذه المنازل قلت‏\n\n\n> منازل الكون في الوجود *** منازل كلها رموز\n\n\n> منازل للعقول فيها *** دلائل كلها تجوز\n> لما أتى الطالبون قصدا *** لنيل شي‏ء فذاك جوزوا\n\n\n> فيا عبيد الكيان حوزوا *** هذا الذي ساقكم وجوزوا\n\n\nالرمز واللغز هو الكلام الذي يعطي ظاهره ما لم يقصده قائله وكذلك منزل العالم في الوجود ما أوجده الله لعينه وإنما أوجده الله لنفسه فاشتغل العالم بغير ما وجد له فخالف قصد موجدة ولهذا يقول جماعة من العلماء العارفين وهم أحسن حالا ممن دونهم إن الله أوجدنا لنا والمحقق والعبد لا يقول ذلك بل يقول إنما أوجدنا له لا لحاجة منه إلي فإنا لغز ربي ورمزه ومن عرف أشعار الألغاز عرف ما أردناه وأما قوله لما أتى الطالبون قصد النيل شي‏ء بذاك جوزوا من المجازات يقول من طلب الله لأمر فهو لما طلب ولا ينال منه غير ذلك وقوله فيا عبيد الكيان يقول من عبد الله لشي‏ء فذلك الشي‏ء معبوده وربه والله بري‏ء منه وهو لما عبده وقوله حوزوا أي خذوا ما جئتم له أي بسببه وجوزوا أي روحوا عنا فإنكم ما جئتم إلينا ولا بسببنا\n\n\n(منزل الدعاء)\n\n\nهذا المنزل يحتوي على منازل منها منزل الأنس بالشبيه ومنزل التغذي ومنزل مكة والطائف والحجب ومنزل المقاصير والابتلاء ومنزل الجمع والتفرقة والمنع ومنزل النواشي والتقديس وفي هذا المنزل قلت‏\n\n\n> لتايه الرحمن فيك منازل *** فأجب نداء الحق طوعا يا فل‏\n\n\n> رفعت إليك المرسلات أكفها *** ترجو النوال فلا يخيب السائل‏\n\n\n> أنت الذي قال الدليل بفضله *** ولنا عليه شواهد ودلائل‏\n\n\n> لو لا اختصاصك بالحقيقة ما زهت *** بنزولك الأعلى لديه منازل‏\n\n\nيقول إن نداء الحق عباده إنما هو لسان المرسلات تطلب اسما من أسمائه وذلك العبد في ذلك الوقت تحت سلطانها والمرسلات لطائف الخلق ترفع أكفها إلى من هي في يديه من الأسماء لتجود به على من يطلبها من الأسماء والمسئول أبدا إنما هو من له المهيمنية على الأسماء كالعليم الذي له التقدم على الخبير والحسيب والمحصي والمفضل ولهذا قال أنت الذي قال الدليل بفضله والحقيقة التي اختص بها إحاطته بما تحته في الرتبة من الأسماء الإلهية إذ القادر في الرتبة دون المريد والعالم في الرتبة فوق المريد والحي فوق الكل فالمنازل التي تحت إحاطة الاسم الجامع تفتخر بنزوله إليها إجابة لسؤالها\n\n\n(منزل الأفعال)\n\n\nوهو يشتمل على منازل منها منزل الفضل والإلهام ومنزل الإسراء الروحاني ومنزل التلطف ومنزل الهلاك وفي هذه المنازل أقول‏\n\n\n> لمنازل الأفعال برق لامع *** ورياحها تزجي السحاب زعازع‏\n\n\n> وسهامها في العالمين نوافذ *** وسيوفها في الكائنات قواطع‏\n\n\n> ألقت إلى العز المحقق أمرها *** فالعين تبصر والتناول شاسع‏\n\n\nالناس في أفعال العباد على قسمين طائفة ترى الأفعال من العباد وطائفة ترى الأفعال من الله وكل طائفة يبدو لها مع اعتقادها ذلك شبه البرق اللامع في ذلك يعطيها آن للذي نفى عنه ذلك الفعل نسبة ما وكل طائفة لها سحاب يحول بينها وبين نسبة الفعل لمن نفته عنه وقوله في رياحها إنها شديدة أي الأسباب والأدلة التي قامت لكل طائفة على نسبة الأفعال لمن نسبتها إليه قوية بالنظر إليه ووصف سهامها بالنفوذ في نفوس الذين يعتقدون ذلك وكذلك سيوفها فيهم قواطع وقوله إنها ألقت إلى العز أي احتمت بحمى مانع يمنع المخالف أن يؤثر فيه فيبقى على هذا كل أحد على ما هي إرادة الله فيه قال تعالى زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمْ وقوله فالعين تبصر يقول الحس يشهدان الفعل للعبد والإنسان يجد ذلك من نفسه بما له فيه من الاختيار وقوله التناول شاسع أي ونسبته إلى غير ما يعطيه الحس والنفس بعيد المتناول إلا أنه لا بد فيه من برق لامع يعطي نسبة في ذلك الفعل لمن نفى عنه لا يقدر على جحدها\n\n\n(منزل الابتداء)\n\n\nويشتمل على منازل منها منزل الغلظة والسبحات ومنزل التنزلات والعلم بالتوحيد الإلهي ومنزل الرحموت ومنزل الحق والفزع وفي هذا المنزل أقول‏\n\n\n> للابتداء شواهد ودلائل *** وله إذا حط الركاب منازل‏\n> يحوي على عين الحوادث حكمه *** ويمده الله الكريم الفاعل‏\n\n\n> ما بينه نسب وبين إلهه *** إلا التعلق والوجود الحاصل‏\n\n\n> لا تسمعن مقالة من جاهل *** مبني الوجود حقائق وأباطل‏\n\n\n> مبني الوجود حقائق مشهودة *** وسوى الوجود هو المحال الباطل‏\n\n\nيقول لابتداء الأكوان شواهد فيها إنها لم تكن لأنفسها ثم كانت وله الضمير يعود على الابتداء إذا حط الركاب أي إذا تتبعته من أين جاء وجدته من عند من أوجده ولذلك كان له البقاء قال تعالى وما عِنْدَ الله باقٍ فإذا حططت عنده عرفت منزلته منه الذي كان فيها إذ لم يكن لنفسه وتلك منزل الأولية الإلهية في قوله هو الأول ومن هذه الأولية صدر ابتداء الكون ومنه تستمد الحوادث كلها وهو الحاكم فيها وهي الجارية على حكمه ونفي النسب عنه فإن أولية الحق تمد أولية العبد وليس لأولية الكون إمداد لشي‏ء فما ثم نسب إلا العناية ولا سبب إلا الحكم ولا وقت غير الأزل هذا مذهب القوم وما بقي مما لم يدخل تحت حصر هذه الثلاثة فعمى وتلبيس هكذا صرح به صاحب محاسن المجالس وقول من قال مبني الوجود حقائق وأباطل ليس بصحيح فإن الباطل هو العدم وهو صحيح فإن الوجود المستفاد في حكم العدم والوجود الحق من كان وجوده لنفسه وكل عدم وجد فما وجد إلا من وجود كان موصوفا به لغيره لا لنفسه والذي استفاد هو الوجود لعينه وأما المحال الباطل فهو الذي لا وجود له لا لنفسه ولا من غيره‏\n\n\n(منزل التنزيه)\n\n\nهذا المنزل يشتمل على منازل منها منزل الشكر ومنزل البأس ومنزل النشر ومنزل النصر والجمع ومنزل الربح والخسران والاستحالات ولنا في هذا\n\n\n> لمنازل التنزيه والتقديس *** سر مقول حكمه معقول‏\n\n\n> علم يعود على المنزه حكمه *** فردوس قدس روضة مطلول‏\n\n\n> فمنزه الحق المبين مجوز *** ما قاله فمرامه تضليل‏\n\n\nيقول المنزه على الحقيقة من هو نزيه لنفسه وإنما ينزه من يجوز عليه ما ينزه عنه وهو المخلوق فلهذا يعود التنزيه على المنزه‏\n\n\nقال صلى الله عليه وسلم إنما هي أعمالكم ترد عليكم‏\n\n\nفمن كان عمله التنزيه عاد عليه تنزيهه فكان محله منزها عن أن يقوم به اعتقاد ما لا ينبغي أن يكون الحق عليه ومن هنا قال من قال سبحاني تعظيما لجلال الله تعالى ولهذا قال روضة مطلول وهو نزول التنزيه إلى محل العبد المنزه خالقه والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n\n(منزل التقريب هذا المنزل يشتمل على منزلين منزل خرق العوائد ومنزل أحدية كن وفيه أنشدت)\n\n\n> لمنازل التقريب شرط يعلم *** ولها على ذات الكيان تحكم‏\n\n\n> فإذا أتى شرط القيامة واستوى *** جبارها خضع الوجود ويخدم‏\n\n\n> هيهات لا تجني النفوس ثمارها *** إلا التي فعلت وأنت مجسم‏\n\n\nيقول إن التقريب من صفات المحدثات لأنها تقبل التقريب وضده والحق هو القريب وإن كان قد وصف نفسه بأنه يتقرب والمصدر منه التقريب والتقرب ولما قال شرط يعلم وهو قبول التأثير قال ولا يعرف وينكشف الأمر عموما إلا في الآخرة وقال والنفوس ما لها جنى إلا ما غرسته في حياتها الدنيا من خير أو شر فلها التقريب من أعمالها فَمَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ خَيْراً يَرَهُ ومن يَعْمَلْ مِثْقالَ ذَرَّةٍ شَرًّا يَرَهُ‏\n\n\n(منزل التوقع)\n\n\nوهذا المنزل أيضا يشتمل على منزلين منزل الطريق الإلهي ومنزل السمع وفيه نظمت‏\n\n\n> ظهرت منازل للتوقع بادية *** وقطوفها ليد المقرب دانية\n\n\n> فاقطف من أغصان الدنو ثمارها *** لا تقطفن من الغصون العادية\n\n\n> لا تخرجن عن اعتدالك والزمن *** وسط الطريق تر الحقائق بادية\n\n\nيقول ما يتوقعه الإنسان قد ظهر لأنه ما يتوقع شيئا إلا وله ظهور عنده في باطنه فقد برز من غيبه الذي يستحقه إلى باطن‏\nمن بتوقعه ثم إنه يتوقع ظهوره في عالم الشهادة فيكون أقرب في التناول وهو قوله قُطُوفُها دانِيَةٌ أي قريبة ليد القاطف يقول احفظ طريق الاعتدال لا تنحرف عنه والاعتدال هنا ملازمتك حقيقتك لا تخرج عنها كما خرج المتكبرون ومن كان برزخا بين الطرفين كان له الاستشراف عليهما فإذا مال إلى أحدهما غاب عن الآخر\n\n\n(منزل البركات)\n\n\nوهو أيضا يشتمل على منزلين على منزل الجمع والتفرقة ومنزل الخصام البرزخى وهو منزل الملك والقهر وفيه قلت‏\n\n\n> لمنازل البركات نور يسطع *** وله بحبات القلوب توقع‏\n\n\n> فيها المزيد لكل طالب مشهد *** ولها إلى نفس الوجود تطلع‏\n\n\n> فإذا تحقق سر طالب حكمة *** بحقائق البركات شد المطلع‏\n\n\n> فالحمد لله الذي في كونه *** أعيانه مشهودة تتسمع‏\n\n\nالبركات الزيادة وهي من نتائج الشكر وما سمي الحق نفسه تعالى بالاسم الشاكر والشكور إلا لنزيد في العمل الذي شرع لنا أن نعمل به كما يزيد الحق النعم بالشكر منا فكل نفس متطلعة للزيادة يقول وإذا تحقق طالب الحكم الزيادة انفرد بأمور يجهد أن لا يشاركه فيها أحد لتكون الزيادة من ذلك النوع وصاحب هذا المقام تكون حاله المراقبة للحال الذي يطلبه‏\n\n\n(منزل الأقسام والإيلاء)\n\n\nوهذا المنزل يشتمل على منازل منها منزل الفهوانيات الرحمانية ومنزل المقاسم الروحانية ومنزل الرقوم ومنزل مساقط النور ومنزل الشعراء ومنزل المراتب الروحانية ومنزل النفس الكلية ومنزل القطب ومنزل انفهاق الأنوار على عالم الغيب ومنزل مراتب النفس الناطقة ومنزل اختلاف الطرق ومنزل المودة ومنزل علوم الإلهام ومنزل النفوس الحيوانية ومنزل الصلاة الوسطى وفي هذا قلت‏\n\n\n> منازل الأقسام في العرض *** أحكامها في عالم الأرض‏\n\n\n> تجري بأفلاك السعود على *** من قام بالسنة والفرض‏\n\n\n> وعلمها وقف على عينها *** وحكمها في الطول والعرض‏\n\n\nيقول القسم نتيجة التهمة والحق يعامل الخلق من حيث ما هم عليه لا من حيث ما هو عليه ولهذا لم يول الحق تعالى للملائكة لأنهم ليسوا من عالم التهمة وليس لمخلوق أن يقسم بمخلوق وهو مذهبنا وإن أقسم بمخلوق عندنا فهو عاص ولا كفارة عليه إذا حنث وعليه التوبة مما وقع فيه لا غير وإنما أقسم الحق بنفسه حين أقسم بذكر المخلوقات وحذف الاسم يدل على ذلك إظهار الاسم في مواضع من الكتاب العزيز مثل قوله فَوَ رَبِّ السَّماءِ والْأَرْضِ ... بِرَبِّ الْمَشارِقِ والْمَغارِبِ فكان ذلك أعلاما في المواضع التي لم يجر للاسم ذكر ظاهر أنه غيب هنالك لأمر أراده سبحانه في ذلك يعرقه من عرفه الحق ذلك من نبي وولي ملهم فإن القسم دليل على تعظيم المقسم به ولا شك أنه قد ذكر في القسم من يبصر ومن لا يبصر فدخل في ذلك الرفيع والوضيع والمرضى عنه والمغضوب عليه والمحبوب والممقوت والمؤمن والكافر والموجود والمعدوم ولا يعرف منازل الأقسام إلا من عرف عالم الغيب فيغلب على الظن أن الاسم الإلهي هنا مضمر وقد عرفناك إن عالم الغيب هو الطول وعالم الشهادة هو العرض‏\n\n\n(منزل الإنية)\n\n\nويشتمل على منازل منها منزل سليمان عليه السلام دون غيره من الأنبياء ومنزل الستر الكامل ومنزل اختلاف المخلوقات ومنزل الروح ومنزل العلوم وفيه أقول‏\n\n\n> إنية قدسية مشهودة *** لوجودها عند الرجال منازل‏\n\n\n> تفني الكيان إذا تجلت صورة *** في سورة أعلامها تتفاضل‏\n\n\n> وتريك فيك وجودها بنعوتها *** خلف الظلال وجودها لك شامل‏\n\n\nيقول إن الحقيقة الإلهية المعنوية بنعوت التنزيه إذا شوهدت تفني كل عين سواها وإن تفاضلت مشاهدها في الشخص الواحد بحسب أحواله وفي الأشخاص لاختلاف أحوالهم لما أعطت الحقيقة أنه لا يشهد الشاهد منا إلا نفسه كما لا تشهد هي منا إلا نفسها فكل حقيقة للأخرى مرآة المؤمن مرآة أخيه لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ\n\n\n(منزل الدهور)\nهذا المنزل على منازل منها منزل السابقة ومنزل العزة ومنزل روحانيات الأفلاك ومنزل الأمر الإلهي ومنزل الولادة ومنزل الموازنة ومنزل البشارة باللقاء وفيه أقول‏\n\n\n> ومن المنازل ما يكون مقدرة *** مثل الزمان فإنه متوهم‏\n\n\n> دلت عليه الدائرات بدورها *** وله التصرف والمقام الأعظم‏\n\n\nيقول لما كان الأزل أمرا متوهما في حق الحق كان الزمان أيضا في حق الحق أمرا متوهما أي مدة متوهمة تقطعها حركات الأفلاك فإن الأزل كالزمان للخلق فافهم‏\n\n\n(منزل لام الألف)\n\n\nهذا منزل الالتفاف والغالب عليه الائتلاف لا الاختلاف قال تعالى والْتَفَّتِ السَّاقُ بِالسَّاقِ إِلى‏ رَبِّكَ يَوْمَئِذٍ الْمَساقُ وهو يحتوي على منازل منها منزل مجمع البحرين وجمع الأمرين ومنزل التشريف المحمدي الذي إلى جانب المنزل الصمدي وفيه أقول‏\n\n\n> منازل اللام في التحقيق والألف *** عند اللقاء انفصال حال وصلهما\n\n\n> هما الدليل أعلى من قال إن أنا *** سر الوجود وإني عينه فهما\n\n\n> نعم الدليلان إذ دلا بحالهما *** لا كالذي دل بالأقوال فانصرما\n\n\nيقول وإن ارتبط اللام بالألف وانعقد وصارا عينا واحدة وهو ظاهر في المزدوج من الحروف في المقام الثامن والعشرين بين الواو والياء اللذين لهما الصحة والاعتلال فلما في الألف من العلة ولما في اللام من الصحة وقعت المناسبة بينه وبين هذين الحرفين فيلي الصحيح منه حرف الصحة ويلي المعتل منه حرف العلة فيداه مبسوطة بالرحمة مقبوضة بنقيضها وليس للام الألف صورة في نظم المفرد بل هو غيب فيها ورتبة على حالها بين الواو والياء وقد استناب في مكانه الزاي والحاء والطاء اليابسة فله في غيبه الرتبة السابعة والثامنة والتاسعة فله منزلة القمر بين البدر والهلال فلم تزل تصحبه رتبة البرزخية في غيبته وظهوره فهو الرابع والعشرون إذ كانت له السبعة بالزاي والثمانية بالحاء والتسعة بالطاء واليوم أربع وعشرون ساعة ففي أي ساعة عملت به فيها أنجح عملك على ميزان العمل بالوضع لأنه في حروف الرقم لا في حروف الطبع لأنه ليس له في حروف الطبع إلا اللام وهو من حروف اللسان برزخ بين الحلق والشفتين والألف ليست من حروف الطبع فما ناب إلا مناب حرف واحد وهو اللام الذي عنه تولد الألف إذا أشبعت حركته فإن لم تشبع ظهرت الهمزة ولهذا جعل الألف بعض العلماء نصف حرف والهمزة نصف حرف في الرقم الوضعي لا في اللفظ الطبعي ثم نرجع فنقول إن انعقد اللام بالألف كما قلنا وصارا عينا واحدة فإن فخذيه يدلان على أنهما اثنان ثم العبارة باسمه تدل على أنه اثنان فهو اسم مركب من اسمين لعينين العين الواحدة اللام والأخرى الألف ولكن لما ظهرا في الشكل على صورة واحدة لم يفرق الناظر بينهما ولم يتميز له أي الفخذين هو اللام حتى يكون الآخر الألف فاختلف الكتاب فيه فمنهم من راعى التلفظ ومنهم من راعى ما يبتدئ به مخططه فيجعله أولا فاجتمعا تقديم اللام على الألف لأن الألف هنا تولد عن اللام بلا شك وكذلك الهمزة تتلو اللام في مثل قوله لَأَنْتُمْ أَشَدُّ رَهْبَةً وأمثاله وهذا الحرف أعني لام ألف هو حرف الالتباس في الأفعال فلم يتخلص الفعل الظاهر على يد المخلوق لمن هو إن قلت هو لله صدقت وإن قلت هو للمخلوق صدقت ولو لا ذلك ما صح التكليف وإضافة العمل من الله للعبد\n\n\nيقول صلى الله عليه وسلم إنما هي أعمالكم ترد عليكم‏\n\n\nويقول الله وما يَفْعَلُوا من خَيْرٍ فَلَنْ يُكْفَرُوهُ واعْمَلُوا ما شِئْتُمْ إِنَّهُ بِما تَعْمَلُونَ بَصِيرٌ والله يَقُولُ الْحَقَّ فكذلك أي الفخذين جعلت اللام أو الألف صدقت وإن اختلف العمل في وضع الشكل عند العلماء به للتحقق بالصورة وكل من دل على إن الفعل للواحد من الفخذين دون الآخر فذلك غير صحيح وصاحبه ينقطع ولا يثبت وإن غيره من أهل ذلك الشأن يخالفه في ذلك ويدل في زعمه والقول معه كالقول مع مخالفه ويتعارض الأمر ويشكل إلا على من نور الله بصيرته وهداه إلى سواء السبيل‏\n\n\n(منزل التقرير)\n\n\nوهو يشتمل على منازل منها منزل تعداد النعم ومنزل رفع الضرر ومنزل الشرك المطلق وفي ذلك أقول‏\n\n\n> تقررت المنازل بالسكون *** ورجحت الظهور على الكمون‏\n> ودلت بالعيان على عيون *** مفجرة من الماء المعين‏\n\n\n> ودلت بالبروق سحاب مزن *** إذا لمعت على النور المبين‏\n\n\nاعلم أيدك الله أنه يقول الثبوت يقرر المنازل فمن ثبت وظهر لكل عين على حقيقتها أ لا ترى ما تعطيك سرعة الحركة من الشبه فيحكم الناظر على الشي‏ء بخلاف ما هو عليه ذلك الشي‏ء فيقول في النار الذي في الجمرة أو في رأس الفتيلة إذا أسرع بحركته عرضا إنه خط مستطيل أو يديره بسرعة فيرى دائرة نار في الهواء وسبب ذلك عدم الثبوت وإذا ثبتت المنازل دلت على ما تحوي عليه من العلوم الإلهية\n\n\n(منزل المشاهدة)\n\n\nوهو منزل واحد هو منزل فناء الكون فيه يفنى من لم يكن ويبقى من لم يزل وفيه أقول‏\n\n\n> في فناء الكون منزل *** روحه فينا تنزل‏\n\n\n> إنه ليلة قدري *** ما له نور ولا ظل‏\n\n\n> هو عين النور صرفا *** ما له عنه تنقل‏\n\n\n> فأنا الإمام حقا *** ملك في الصدر الأول‏\n\n\n> عنده مفتاح أمري *** فيوليكم ويعزل‏\n\n\n> سمهرياتي طوال *** لست بالسماك الأعزل‏\n\n\n> فالمقام الحق فيكم *** دائم لا يتبدل‏\n\n\n> وهو القاهر منه *** وهو الإمام الأعدل‏\n\n\n> ليس بالنور الممثل *** بل من المهاة أكمل‏\n\n\n> وأنا منه يقينا *** بمكان السر الأفضل‏\n\n\n> فبعين العين أسمو *** وبأمر الأمر أنزل‏\n\n\nيقول حالة الفناء لا نور ولا ظل مثل ليلة القدر ثم قال وذلك هو الضوء الحقيقي والظل الحقيقي فإنه الأصل الذي لا ضد له والأنوار تقابلها الظلم وهذا لا يقابله شي‏ء وقوله أنا الإمام يعني شهوده للحق من الوجه الخاص الذي منه إلي وهو الصدر الأول ومن هذا المقام يقع التفصيل والكثرة والعدد في الصور وجعل السمهريات كناية عن تأثير القيومية في العالم ولها الثبوت ولذا قال لا تتبدل وله القهر والعدل لا يقبل التشبيه فبشهود الذات أعلو وبالأمر الإلهي أنزل إماما في العالم‏\n\n\n(منزل الألفة)\n\n\nهو منزل واحد وفيه أقول‏\n\n\n> منازل الألفة مألوفه *** وهي بهذا النعت معروفه‏\n\n\n> فقل لمن عرس فيها أقم *** فإنها بالأمن محفوفه‏\n\n\n> وهي على الاثنين موقوفه *** وعن عذاب الوتر مصروفه‏\n\n\nهذا منزل الأعراس والسرور والأفراح وهو مما امتن الله به على نبيه محمد صلى الله عليه وسلم فقال لَوْ أَنْفَقْتَ ما في الْأَرْضِ جَمِيعاً ما أَلَّفْتَ بَيْنَ قُلُوبِهِمْ يريد عليك ولكِنَّ الله أَلَّفَ بَيْنَهُمْ يريد على مودتك وإجابتك وتصديقك‏\n\n\n(منزل الاستخبار)\n\n\nوهو يشتمل على منازل منها منزل المنازعة الروحانية ومنزل حلية السعداء كيف تظهر على الأشقياء وبالعكس ومنزل الكون قبل الإنسان وفيه أقول‏\n\n\n> إذا استفهمت عن أحباب قلبي *** أحالوني على استفهام لفظي‏\n\n\n> منازلهم بلفظك ليس إلا *** فيا شؤمي لذاك وسوء حظي‏\n\n\n> وعظت النفس لا تنظر إليهم *** فما التفتت بخاطرها لوعظي‏\n\n\n> لفظتهمو عسى أحظى بكون *** فكانوا عين كوني عين لفظي‏\n\n\n> وقال ومن عجب إني أحن إليهمو *** وأسأل عنهم من أرى وهمو معي‏\n> وترصدهم عيني وهم في سوادها *** ويشتاقهم قلبي وهم بين أضلعي‏\n\n\nيقول إنهم في لساني إذا سألت عنهم وفي سواد عيني إذا نظرت إليهم وفي قلبي إذا فكرت فيهم واشتقت إليهم فهم معي في كل حال أكون عليها فهم عيني ولست عينهم إذ لم يكن عندهم مني ما عندي منهم‏\n\n\n(منزل الوعيد)\n\n\nوهو منزل واحد محوي على الجور والاستمساك بالكون وفيه قلت‏\n\n\n> إن الوعيد لمنزلان هما لمن *** ترك السلوك على الطريق الأقوم‏\n\n\n> فإذا تحقق بالكمال وجوده *** ومشى على حكم العلو الأقدم‏\n\n\n> عادا نعيما عنده فنعيمه *** في النار وهي نعيم كل مكرم‏\n\n\nمنزل روحاني وهو عذاب النفوس ومنزل جسماني وهو العذاب المحسوس ولا يكون إلا لمن حاد عن الطريق المشروع في ظاهره وباطنه فإذا وفق للاستقامة وسبقت له العناية عصم من ذلك وتنعم بنار المجاهدة لجنة المشاهدة\n\n\n(منزل الأمر)\n\n\nوهو يشتمل على منازل منزل الأرواح البرزخية ومنزل التعليم ومنزل السري ومنزل السبب ومنزل التمائم ومنزل القطب والإمامين ولنا فيه‏\n\n\n> منازل الأمر فهو إنية الذات *** بها تحصل أفراحي ولذاتي‏\n\n\n> فليتني قائم فيها مدى عمري *** ولا أزول إلى وقت الملاقاة\n\n\n> فقرة العين للمختار كان له *** إذا تبرز في صدر المناجاة\n\n\nالأمر الإلهي من صفة الكلام وهو مسدود دون الأولياء من جهة التشريع وما في الحضرة الإلهية أمر تكليفي إلا أن يكون مشروعا فما بقي للولي إلا سماع أمرها إذا أمرت الأنبياء فيكون للولي عند سماعه ذلك لذة سارية في وجوده لكن يبقى للأولياء المناجاة الإلهية التي لا أمر فيها سمرا وحديثا فكل من قال من أهل الكشف إنه مأمور بأمر إلهي في حركاته وسكناته مخالف لأمر شرعي محمدي تكليفي فقد التبس عليه الأمر وإن كان صادقا فيما قال إنه سمع وإنما يمكن إن ظهر له تجل إلهي في صورة نبيه صلى الله عليه وسلم فخاطبه نبيه أو أقيم في سماع خطاب نبيه وذلك أن الرسول موصل أمر الحق تعالى الذي أمر الله به عباده فقد يمكن أن يسمع من الحق في حضرة ما ذلك الأمر الذي قد جاءه به أولا رسوله صلى الله عليه وسلم فيقول أمرني الحق وإنما هو في حقه تعريف بأنه قد أمر وانقطع هذا السبب بمحمد صلى الله عليه وسلم وما عدا الأوامر من الله المشروعة فللأولياء في ذلك القدم الراسخة فهذا قد أتينا على التسعة عشر صنفا من المنازل فلنذكر أخص صفات كل منزل فنقول‏\n\n\n### (وصل) [في ذكر أخص صفات كل منزل من المنازل التسعة عشر]\n\n\nأخص صفات منزل المدح تعلق العلم بما لا يتناهى وأخص صفات منزل الرموز تعلق العلم بخواص الأعداد والأسماء وهي الكلمات والحروف وفيه علم السيمياء وأخص صفات منزل الدعاء علوم الإشارة والتحلية وأخص صفات منزل الأفعال علم الآن وأخص صفات منزل الابتداء علم المبدأ والمعاد ومعرفة الأوليات من كل شي‏ء وأخص صفات التنزيه علم السلخ والخلع وأخص صفات التقريب علم الدلالات وأخص صفات منزل التوقع علم النسب والإضافات أو أخص صفات منزل البركات علم الأسباب والشروط والعلل والأدلة والحقيقة وأخص صفات الأقسام علوم العظمة وأخص صفات منزل الدهر علم الأزل وديمومة الباري وجود أو أخص صفات منزل الإنية علم الذات وأخص صفات منزل لام ألف علم نسبة الكون إلى المكون وأخص صفات منزل التقرير علم الحضور وأخص صفات منزل فناء الكون علم قلب الأعيان وأخص صفات منزل الألفة علم الالتحام وأخص صفات منزل الوعيد علم المواطن وأخص صفات منزل الاستفهام علم لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وأخص صفات منزل الأمر علم العبودة\n\n\n### (وصل) [في ذكر المنازل الإلهية التسعة عشر وما يقابلها من الممكنات‏]\n\n\nاعلم أنه لكل منزل من هذه المنازل التسعة عشر صنف من الممكنات فمنهم صنف الملائكة وهم صنف واحد وإن اختلفت أحوالهم (و علم الأجسام ثمانية عشر) الأفلاك أحد عشر نوعا والأركان أربعة والمولدات ثلاثة ولها وجه آخر يقابلها من الممكنات في الحضرة الإلهية الجوهر للذات وهو الأول الثاني الأعراض وهي للصفات الثالث الزمان وهو للأزل الرابع المكان وهو للاستواء أو النعوت الخامس الإضافات للاضافات‏\nالسادس الأوضاع للفهوانية السابع الكميات للأسماء الثامن الكيفيات للتجليات التاسع التأثيرات للجود العاشر الانفعالات للظهور في صور الاعتقادات الحادي عشر الخاصية وهي للاحدية الثاني عشر الحيرة وهي للوصف بالنزول والفرح والقرض وأشباه ذلك الثالث عشر حياة الكائنات للحي الرابع عشر المعرفة للعلم الخامس عشر الهواجس للإرادة السادس عشر الأبصار للبصير السابع عشر السمع للسميع الثامن عشر الإنسان للكمال التاسع عشر الأنوار والظلم للنور\n\n\n(وصل في نظائر المنازل التسعة عشر)\n\n\nنظائرها من القرآن حروف الهجاء التي في أول السور وهي أربعة عشر حرفا في خمس مراتب أحدية وثنائية وثلاثية ورباعية وخماسية ونظائرها من النار الخزنة تسعة عشر ملكا نظائرها في التأثير اثنا عشر برجا والسبعة الدراري نظائرها من القرآن حروف البسملة ونظائرها من الرجال النقباء اثنا عشر والأبدال السبعة وهؤلاء السبعة منهم الأوتاد أربعة والإمامان اثنان والقطب واحد والنظائر لهذه المنازل من الحضرة الإلهية ومن الأكوان كثير\n\n\n### (وصل) [في منزل المنازل أو الإمام المبين‏]\n\n\nاعلم أن منزل المنازل عبارة عن المنزل الذي يجمع جميع المنازل التي تظهر في عالم الدنيا من العرش إلى الثرى وهو المسمى بالإمام المبين قال الله تعالى وكُلَّ شَيْ‏ءٍ أَحْصَيْناهُ في إِمامٍ مُبِينٍ فقوله أَحْصَيْناهُ دليل على أنه ما أودع فيه إلا علوما متناهية فنظرنا هل ينحصر لأحد عددها فخرجت عن الحصر مع كونها متناهية لأنه ليس فيه إلا ما كان من يوم خلق الله العالم إلى أن ينقضي حال الدنيا وتنتقل العمارة إلى الآخرة فسألنا من أثق به من العلماء بالله هل تنحصر أمهات هذه العلوم التي يحويها هذا الإمام المبين فقال نعم فأخبرني الثقة الأمين الصادق الصاحب وعاهدني أني لا أذكر اسمه أن أمهات العلوم التي تتضمن كل أم منه ما لا يحصى كثرة تبلغ بالعدد إلى مائة ألف نوع من العلوم وتسعة وعشرين ألف نوع وستمائة نوع وكل نوع يحتوي على علوم جمة ويعبر عنها بالمنازل فسألت هذا الثقة هل نالها أحد من خلق الله وأحاط بها علما قال لا ثم قال وما يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ وإذا كانت الجنود لا يعلمها إلا هو وليس للحق منازع يحتاج هؤلاء الجنود إلى مقابلته فقال لي لا تعجب فَوَ رَبِّ السَّماءِ والْأَرْضِ لقد ثم ما هو أعجب فقلت ما هو فقال لي الذي ذكر الله في حق امرأتين من نساء رسول الله صلى الله عليه وسلم ثم تلا وإِنْ تَظاهَرا عَلَيْهِ فَإِنَّ الله هُوَ مَوْلاهُ وجِبْرِيلُ وصالِحُ الْمُؤْمِنِينَ والْمَلائِكَةُ بَعْدَ ذلِكَ ظَهِيرٌ فهذا أعجب من ذكر الجنود فأسرار الله عجيبة فلما قال لي ذلك سألت الله أن يطلعني على فائدة هذه المسألة وما هذه العظمة التي جعل الله نفسه في مقابلتها وجبريل وصالح المؤمنين والملائكة فأخبرت بها فما سررت بشي‏ء سروري بمعرفة ذلك وعلمت لمن استندتا ومن يقويهما ولو لا ما ذكر الله نفسه في النصرة ما استطاعت الملائكة والمؤمنون مقاومتهما وعلمت أنهما حصل لهما من العلم بالله والتأثير في العالم ما أعطاهما هذه القوة وهذا من العلم الذي كهيئة المكنون فشكرت الله على ما أولى فما أظن أن أحدا من خلق الله استند إلى ما استند هاتان المرأتان يقول لوط عليه السلام لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى‏ رُكْنٍ شَدِيدٍ وكان عنده الركن الشديد ولم يكن يعرفه‏\n\n\nفإن النبي صلى الله عليه وسلم قد شهد له بذلك فقال يرحم الله أخي لوطا لقد كان يأوي إلى ركن شديد\n\n\nوعرفتاه عائشة وحفصة فلو علم الناس علم ما كانتا عليه لعرفوا معنى هذه الآية والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Twenty-Two: Concerning the Knowledge of the Station of Stations and the Ordering of All Cosmic Sciences\n\nWondrous are the sayings of the elevated souls,\nIndeed, the stations are flowing within the stations.\n\nHow is the ascent from the lowest point to the heights,\nExcept by the subjugation of the Transcendent Presence (الحضرة المتعالية)?\n\nSo the science of analysis (التحليل) in its ascent,\nIs toward the subtleties (اللطائف) and the elevated matters.\n\nAnd the science of synthesis (التركيب) upon its return,\nIs with the light of Being (الوجود) toward the darkness of the abyss.\n\n### [Ordering and Enumeration of Sciences]\n\nKnow, may Allah support you, that since the Knowledge attributed to Allah does not accept multiplicity (الكثرة) nor ordering—for it is neither acquired nor derived, but His Knowledge is the very Essence (الذات) of Himself, like all the Attributes (الصفات) attributed to Him and the Names (الأسماء) by which He is named—the sciences of what is other than Allah must be ordered and enumerated. Whether they are sciences of divine gift (وهب) or sciences of acquisition (كسب), they are not devoid of this ordering which we shall mention: first, the science of the simple (المفرد), then the science of composition (التركيب), then the science of the composite (المركب). There is no fourth category for them. If a thing is among the simples that do not accept composition, its knowledge is simple, and likewise for what remains. For every known thing must necessarily be simple or composite, and the composite necessarily requires the precedence of the science of composition, and only then does the science of the composite exist.\n\n### [For the Descender to the Nineteen]\n\nNow that you have learned the ordering of all cosmic sciences, let us clarify for you the enumeration of the stations (منازل) within this Station (منزل). They are numerous and cannot be counted. We shall limit ourselves to those related specifically to our Law (شرع) and by which it is distinguished, not the stations that are shared between us and others from the sciences of various religions and sects. Their total is nineteen fundamental levels (مراتب أمهات). Some of these branch out into sub-stations, and some do not. So let us mention the names of these levels and assign them the name 'Stations,' for thus we were introduced to them in the Divine Presence (الحضرة الإلهية), and propriety is paramount. Let us mention the titles of these Stations and the descriptions of their masters (أرباب) and their spiritual poles (أقطاب) who have realized them, and their spiritual states (أحوال), and the description corresponding to each of these states. Then, after that, God willing, we shall mention each category of these nineteen and mention some of the fundamental sub-stations that it encompasses, but not the individual stations themselves. For there is a Station that encompasses more than a hundred stations of signs and indications (دلالات) pointing to manifest lights, and it encompasses thousands, or fewer, of stations of ultimate goals containing hidden secrets and manifest properties. Then we shall follow what we have mentioned with the corresponding number of these Stations from the existent things (الموجودات), both ancient and recent. Then we shall mention what relates to some of the meanings of this Station, by way of approximation and abbreviation, God Almighty willing.\n\n### «Mention of Their Titles and the Descriptions of Their Poles»\n\nAmong these are the Stations of Praise (الثناء) and Commendation (المدح), which belong to the masters of unveilings (الكشوفات) and spiritual conquest (الفتح). And the Stations of Symbols (الرموز) and Riddles (الألغاز) for the people of Reality (الحقيقة) and Metaphor (المجاز). And the Stations of Supplication (الدعاء) for the people of allusions (الإشارات) and distance. And the Stations of Acts (الأفعال) for the people of spiritual states (الأحوال) and connection (الاتصال). And the Stations of Beginning (الابتداء) for the people of passing thoughts (الهواجس) and subtle indications (الإيماء). And the Stations of Transcendence (التنزيه) for the people of orientation in debates and inference (الاستنباط). And the Stations of Nearness (التقريب) for the God-aspiring strangers (الغرباء المتألهين). And the Stations of Expectation (التوقع) for the veiled ones, due to the veils of Majesty (السبحات). And the Stations of Blessings (البركات) for the people of movement. And the Stations of Oaths (الأقسام) for the people of governance among the spiritual beings (الروحانيين). And the Stations of Aeon (الدهر) for the people of spiritual taste (الذوق). And the Stations of I-ness (الإنية) for the people of witnessing (المشاهدة) with the eyes. And the Stations of Lām-Alif (اللام والألف) for the intertwining (الالتفاف) resulting from assuming the Divine characteristics (الأخلاق الإلهية), and for the people of the secret that is not unveiled. And the Stations of Confirmation (التقرير) for the people of knowledge of natural and spiritual alchemy. And the Stations of Annihilation of the Cosmoses (فناء الأكوان) for the cherished, secluded ones. And the Stations of Intimacy (الألفة) for the people of security among the dwellers of the chambers. And the Stations of Threat (الوعيد) for those clinging to the pillar of the Most Glorious Throne. And the Stations of Inquiry (الاستخبار) for the people of obscure secrets. And the Stations of Command (الأمر) for those who realize the realities of His secret within themselves.\n\nAs for their descriptions: The people of Commendation possess splendor. The people of Symbols possess salvation from objection. As for the God-aspiring ones, they possess bewilderment through characterization. As for the people of states and connection, they attain the very essence (العين). As for the people of allusion, they experience confusion when conveying the message. As for the people of inference, they experience error and correctness, and they are not infallible. As for the strangers, they possess brokenness. As for the veiled ones, they possess fear. As for the people of movement, they witness the causes (الأسباب). And the governors possess contemplation. And the established ones possess limits. And the people of witnessing possess denial. And the people of concealment possess safety. And the people of knowledge possess judgment over the known thing. And the people of veiling await its removal. And the people of security are in the place of fear of divine cunning (المكر). And the people of standing possess sitting/settling. And the people of inspiration (الإلهام) possess control. And the people of realization (التحقيق) possess three garments: the garment of faith (إيمان), disbelief (كفر), and hypocrisy (نفاق).\n\n### [The States of the Masters of the Descender]\n\nAs for the mention of their states, know that God Almighty has prepared the Stations for the descender, smoothed the strongholds for the rational one, folded the stages for the traveler, elevated the landmarks for the knower, detailed the portions for the divider, prepared the destroyers for the destroyer, clarified the protectors for the protected one, raised the foundations for the settled one, ordered the observatories for the observer, subjugated the mounts for the rider, brought near the paths for the one who goes, inscribed the praises for the praiser, facilitated the goals for the seeker, originated the gnoses (المعارف) for the gnostic (العارف), established the standpoints for the one who stands, made the paths rugged for the traveler (السالك), specified the rites for the devotee (الناسك), silenced the witnessed things for the witness, and guarded the stars for the sleeper.\n\n### «Mention of the Descriptions of Their States»\n\nFor He, glory be to Him, made the descender a determiner, the rational one a contemplator, the traveler one who prepares himself, the knower a witnesser, the divider one who endures hardship, the destroyer one who strives, the protected one a helper, the settled one a gnostic, the observer one who stands firm, the rider one who is carried, the one who goes one who is caused, the praiser one who is questioned, the seeker one who is accepted, the gnostic one who is blessed, the one who stands firm one who is bewildered, the traveler one who is rejected, the devotee one who is distanced, the witness one who is established, and the sleeper one who submits.\n\nThus, we have mentioned the descriptions of these nineteen categories in their states. So let us mention what each category encompasses of the fundamental stations. Every station among these fundamentals encompasses four categories of stations: The first category is called the Stations of Indications (الدلالات), the second is called the Stations of Limits (الحدود), the third is called the Stations of Properties (الخواص), and the fourth is called the Stations of Secrets (الأسرار). They are too numerous to count. So let us limit ourselves to the nineteen and mention the numbers of the fundamentals they contain. This is the first of them:\n\n### [The Station of Commendation]\n\nThe Station of Commendation (المدح) has the Station of Spiritual Conquest (الفتح)—the conquest of the two secrets—and the Station of the First Keys, and we have a section concerning it which we named *The Keys of the Unseen* (مفاتيح الغيوب). And the Station of Wonders. And the Station of Subjugation of the Spirits of the Isthmus (الأرواح البرزخية). And the Station of the Celestial Spirits. And concerning some of its meanings, we have the following verses:\n\nThe Stations of Commendation and Glory,\nStations that have no end.\nSeek not commendation in elevation,\nThe praises of the folk are in the dust.\nHe whose soul thirsts through striving (جهاد),\nDrinks from the sweetest waters.\n\nWe say that the commendation of the servant is not that he describes himself with the attributes of his Master, for that is ill-manners. But the Master may describe Himself with the attributes of His servant out of humility. For the Master has the right to descend, because He is not judged. So His descent to the attributes of His servant is a favor from Him upon His servant, so that He may comfort him. For the Majesty of the Master is too great in the heart of the servant to point to Him, were it not for His descent to him. And the servant does not have the right to describe himself with the attributes of his Master, neither in His Presence nor among his brethren, the servants, even if he governs them, just as he, peace be upon him, said: \"I am the Master of the children of Adam, and no boast.\" And He Almighty said: <<تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها>> (That is the Home of the Hereafter, We grant it)—meaning, We make them possess it as a possession—<<لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ>> (for those who desire neither high status in the land). For Allah has made the earth submissive, and the servant is the submissive one, and submission does not necessitate high status. So whoever exceeds his measure perishes. It is said: No man perished who knew his measure. And his saying, \"Stations that have no end,\" means that the servant has no end in his servitude (عبودية) that he reaches and then returns as a Lord, just as the Lord has no limit that He reaches and then returns as a servant. So the Lord is Lord eternally, and the servant is servant eternally. That is why he said, \"The praises of the folk are in the dust,\" and the servant is more submissive than the surface of the earth. And he said, \"No one knows the pleasure of water except the thirsty one,\" meaning, no one knows the pleasure of being characterized by servitude except he who has tasted the pains when characterized by Lordship and the need of creation for him.\n\nLike Solomon (سليمان), when he requested that Allah place the provision of the servants physically in his hands. All the provisions that were present at that time were brought, and then a creature from the creatures of the sea emerged and requested its sustenance. He said to it: \"Take from this the measure of your sustenance for every day.\" So it ate it until it finished the last of it. Then it said: \"Give me more, for you have not fulfilled my provision. For Allah gives me ten times this amount every day, and there are creatures greater than me and with more provision.\" So Solomon, peace be upon him, repented to his Lord and knew that what belongs to the Creator Almighty is not within the capacity of the created being. For he had requested from Allah a dominion that should not belong to anyone after him. He withdrew his request when he saw that. And the creatures gathered around him, seeking their provisions from all directions, so he was distressed by that. But when Allah accepted his request and relieved him, he found a pleasure in that which cannot be measured.\n\n(The Station of Symbols)\n\nKnow, may Allah grant you success, that although this is one Station, it contains sub-stations. Among them is the Station of Absolute Unity (الوحدانية). And the Station of the First Intellect (العقل الأولي) and the Greatest Throne (العرش الأعظم). And the Echo, and the coming of the scholars to the Throne. And the science of representation. And the Station of Hearts (القلوب) and the Veil (الحجاب). And the Station of the Comprehending Establishment and the Pervasive Divinity. And the derivation of the soothsayers and the Aeon (الدهر). And the Stations that have no permanence, and in which no one has permanence. And the Station of the Isthmuses (البرازخ), Divinity, Increase, and Jealousy. And the Station of Loss and Finding. And the Station of Removal of Doubts, Generosity, and the Hidden Treasure. And the Station of Subjugation and Sinking. And the Station of the Vast Earth. When I entered this Station while I was in Tunis, a cry escaped me, of which I had no knowledge that it had occurred, except that everyone who heard it fell down unconscious. And those women of the neighbors who were looking down upon us from the roof of the house fainted, and some of them fell from the roofs into the courtyard, despite the height, and no harm befell them. I was the first to regain consciousness, and we were praying behind an Imam. I saw no one except those who were thunderstruck. After a while they recovered, and I said: \"What is the matter with you?\" They said: \"What is the matter with you? You uttered a cry that caused what you see in the congregation.\" I said: \"By God, I have no knowledge that I cried out.\" And the Station of Strange Signs and Divine Wisdoms. And the Station of Readiness, Adornment, and the Command (الأمر) by which Allah holds the celestial spheres. And the Station of Remembrance and Negation. And concerning these Stations, I said:\n\nThe Stations of the Cosmos in Existence (الوجود),\nStations, all of them are symbols (رموز).\nStations wherein for the intellects,\nAll the indications are metaphorical.\nWhen the seekers came intending\nTo attain something, that is what they were permitted.\nO servants of the entity, take possession\nOf that which drove you, and pass on.\n\nThe symbol and the riddle is speech whose apparent meaning gives what its speaker did not intend. And likewise, the station of the world in Existence (الوجود): Allah did not bring it into existence for its own sake, but Allah brought it into existence for His own sake. So the world occupied itself with what it was not created for, thus opposing the intention of its Originator. For this reason, a group of gnostic scholars—who are in a better state than those below them—say that Allah brought us into existence for ourselves. But the realized one (المحقق) and the servant do not say that; rather, he says: He brought us into existence for Him, not out of any need from Him for me. For we are the riddle of my Lord and His symbol. And whoever knows the poetry of riddles knows what we intended. As for his saying, \"When the seekers came intending to attain something, that is what they were permitted,\" this refers to metaphors. He means: whoever seeks Allah for the sake of a matter, he is for what he sought, and he will attain nothing else from Him. And his saying, \"O servants of the entity,\" means: whoever worships Allah for the sake of something, that thing is his object of worship and his lord, and Allah is innocent of him, and he belongs to what he worshipped. And his saying, \"Take possession,\" means: take what you came for, i.e., because of it, and \"pass on,\" means: leave us, for you did not come to us nor for our sake.\n\n(The Station of Supplication)\n\nThis Station contains sub-stations. Among them is the Station of Intimacy with the similar. And the Station of Nourishment. And the Station of Mecca, Ta’if, and the Veils. And the Station of the Chambers and Trial. And the Station of Gathering, Separation, and Withholding. And the Station of the Growing Things and Sanctification. And concerning this Station, I said:\n\nFor the bewildered one of the Merciful, there are stations in you,\nSo answer the call of the Real willingly, O so-and-so.\nThe sent ones raise their hands to you,\nHoping for bounty, so the asker is not disappointed.\nYou are the one whose virtue the proof declared,\nAnd we have witnesses and indications concerning it.\nWere it not for your specialization in the Reality (الحقيقة),\nThe stations would not have shone with your supreme descent to them.\n\nHe says that the call of the Real to His servants is only the tongue of the sent ones, seeking a Name from His Names. And that servant at that time is under their authority. And the sent ones are the subtleties of creation, raising their hands to the one who holds them among the Names, so that He may bestow it upon the one who seeks it among the Names. And the one who is always asked is only the one who has dominion over the Names, like the All-Knowing, who has precedence over the All-Aware, the Reckoner, the Enumerator, and the Favorer. For this reason, he said: \"You are the one whose virtue the proof declared.\" And the Reality by which he is specialized is his encompassing of what is below him in rank among the Divine Names. Since the Powerful is lower in rank than the Willing, and the Knowing is higher in rank than the Willing, and the Living is above all. So the stations that are under the encompassment of the Comprehensive Name boast of His descent to them in response to their request.\n\n(The Station of Acts)\n\nAnd it encompasses sub-stations. Among them is the Station of Grace and Inspiration (الإلهام). And the Station of the Spiritual Night Journey. And the Station of Subtlety. And the Station of Destruction. And concerning these Stations, I say:\n\nFor the Stations of Acts (الأفعال) there is a flashing lightning,\nAnd its winds drive the clouds with tempests.\nAnd its arrows are piercing in the worlds,\nAnd its swords are decisive among the existent things.\nIt cast its command toward the Realized Glory,\nSo the eye sees, but the attainment is distant.\n\nPeople regarding the acts of the servants are of two divisions: one group sees the acts as originating from the servants, and another group sees the acts as originating from Allah. And for each group, along with their belief, something like the flashing lightning appears in that matter, which momentarily grants a certain attribution of that act to the one from whom they negated it. And each group has a cloud that intervenes between it and the attribution of the act to the one from whom they negated it. And his saying concerning its winds that they are severe means that the causes (الأسباب) and proofs established for each group regarding the attribution of the acts to the one they attribute them to are strong, when viewed from their perspective. And he described its arrows as piercing the souls of those who hold that belief, and likewise its swords are decisive among them. And his saying that it \"cast its command toward the Glory\" means that it sought refuge in a protective sanctuary that prevents the opponent from affecting it, so everyone remains upon what is the Will of Allah concerning him. He Almighty said: <<زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمْ>> (We have made fair-seeming to every nation their deeds). And his saying, \"So the eye sees,\" means that the senses witness the act belonging to the servant, and the human finds that within himself due to the choice he possesses in it. And his saying, \"but the attainment is distant,\" means that its attribution to what is other than what the sense and the soul grant is far from attainment, except that there must be a flashing lightning in it that grants an attribution of that act to the one from whom it was negated, which one cannot deny.\n\n(The Station of Beginning)\n\nAnd it encompasses sub-stations. Among them is the Station of Harshness and the Veils of Majesty. And the Station of Descents (التنزلات) and the knowledge of Divine Unity (التوحيد الإلهي). And the Station of Mercy/Compassion. And the Station of the Real (الحق) and Terror. And concerning this Station, I say:\n\nFor the Beginning there are witnesses and indications,\nAnd for it, when the riders dismount, there are stations.\nIts ruling encompasses the very essence of contingent events,\nAnd God, the Generous, the Doer, sustains it.\nThere is no kinship between it and its God,\nExcept for the dependence and the resultant Existence (الوجود).\nDo not listen to the saying of an ignorant one,\nThat the structure of Existence is built upon realities and falsehoods.\nThe structure of Existence is manifest realities,\nAnd what is other than Existence is the impossible falsehood.\n\nHe says that the beginning of the cosmoses (الأكوان) has witnesses within them that they did not exist for themselves, and then they came to be. And \"for it\"—the pronoun refers to the Beginning—\"when the riders dismount,\" means: if you trace it back to where it came from, you find it originating from the one who brought it into existence. And for that reason, it possesses Subsistence (البقاء). He Almighty said: <<وَمَا عِنْدَ اللَّهِ بَاقٍ>> (And what is with Allah remains). So when you dismount at His presence, you know its station from Him, which it held when it did not exist for itself. And that is the Station of Divine Primordiality in His saying: He is the First. And from this Primordiality issued the beginning of the cosmos. And from Him all contingent events derive their sustenance, and He is the ruler over them, and they proceed according to His ruling. And the negation of kinship from it, for the Primordiality of the Real sustains the primordiality of the servant. And the primordiality of the cosmos has no sustenance for anything. So there is no kinship except Providence, no cause except the Ruling, and no time except Eternity (الأزل). This is the doctrine of the folk. And what remains that does not fall under the enumeration of these three is blindness and confusion. Thus declared the author of *Maḥāsin al-Majālis*. And the saying of whoever said that the structure of Existence is built upon realities and falsehoods is not correct. For falsehood is non-existence, and this is correct. For derived Existence is in the category of non-existence. And the Real Existence is that whose existence is for itself. And every non-existence that came to exist, only existed from an existence that was described by it for another, not for itself. And what was derived is Existence for its essence. As for the impossible falsehood, it is that which has no existence, neither for itself nor from another.\n\n(The Station of Transcendence)\n\nThis Station encompasses sub-stations. Among them is the Station of Gratitude. And the Station of Distress. And the Station of Resurrection. And the Station of Victory and Gathering. And the Station of Profit, Loss, and Transformations. And concerning this, we have:\n\nFor the Stations of Transcendence (التنزيه) and Sanctification,\nThere is a spoken secret whose ruling is intelligible.\nA knowledge whose ruling returns to the one who transcends,\nA paradise of holiness, a garden watered by dew.\nSo the one who transcends the Manifest Real permits\nWhat he says, and his aim is misguidance.\n\nHe says: The one who truly transcends is he who is pure for himself. And one only performs transcendence for the one upon whom what is transcended from is permissible, and that is the created being. For this reason, the transcendence returns to the one who performs transcendence. The Prophet, peace and blessings be upon him, said: \"They are only your deeds returned to you.\" So whoever’s deed is transcendence, his transcendence returns to him, and his locus becomes transcendent from having a belief concerning the Real that is inappropriate for Him. And from this perspective, whoever said \"Glory be to me\" said it out of magnification of God Almighty’s Majesty (جلال). And for this reason, he said, \"a garden watered by dew,\" which is the descent of transcendence to the locus of the servant who transcends his Creator. And Allah speaks the Truth, and He guides to the way.\n\n(The Station of Nearness)\n\nThis Station encompasses two sub-stations: the Station of Breaking the Norms and the Station of the Oneness of 'Be!' (كن). Concerning it, I recited:\n\nFor the Stations of Nearness (التقريب) there is a known condition,\nAnd they have dominion over the essence of the entity.\nAnd when the condition of the Resurrection comes and its Compeller is established,\nExistence submits and serves.\nFar be it! Souls do not harvest their fruits,\nExcept those that acted, and you are embodied.\n\nHe says that Nearness is among the attributes of contingent things because they accept nearness and its opposite. And the Real is the Near, even though He has described Himself as drawing near. And the verbal noun from it is *taqrīb* (bringing near) and *taqarrub* (drawing near). And when he said, \"a known condition,\" this is the acceptance of influence/effect. He said: And the matter is not known or unveiled generally except in the Hereafter. And he said: And souls have no harvest except what they planted in their worldly life, whether good or evil. So they have nearness from their deeds. <<فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ>> (So whoever does an atom's weight of good will see it, and whoever does an atom's weight of evil will see it).\n\n(The Station of Expectation)\n\nThis Station also encompasses two sub-stations: the Station of the Divine Path and the Station of Hearing. Concerning it, I composed:\n\nStations for Expectation have appeared manifest,\nAnd their clusters are near to the hand of the one brought near.\nSo pluck their fruits from the branches of nearness,\nDo not pluck from the ordinary branches.\nDo not depart from your moderation, and adhere\nTo the middle of the path, and you will see the realities manifest.\n\nHe says that what a human expects has already appeared, because he does not expect anything unless it has an appearance with him in his inner being. It has already emerged from the unseen that he deserves into the inner being of the one who expects it. Then he expects its appearance in the world of witnessing (عالم الشهادة), so it becomes closer to attainment. And that is His saying: <<قُطُوفُها دَانِيَةٌ>> (Its clusters are near), meaning, close to the hand of the plucker. He says: Guard the path of moderation, do not deviate from it. And moderation here is your adherence to your reality, not departing from it, as the arrogant ones departed. And whoever is an isthmus (برزخ) between the two extremes has the ability to look down upon both of them. But if he inclines toward one of them, he is veiled from the other.\n\n(The Station of Blessings)\n\nIt also encompasses two sub-stations: the Station of Gathering and Separation, and the Station of Isthmus-like Contention, which is the Station of Dominion and Subjugation. Concerning it, I said:\n\nFor the Stations of Blessings (البركات) there is a light that shines,\nAnd for it, there is expectation in the seeds of hearts.\nIn them is increase for every seeker of witnessing,\nAnd they aspire toward the very soul of Existence (الوجود).\nWhen the secret of the seeker of wisdom is realized\nBy the realities of the Blessings, the ascent is strengthened.\nSo praise be to Allah, in whose cosmos\nHis entities (أعيان) are witnessed and heard.\n\nBlessings are increase, and they are among the results of gratitude. And the Real Almighty did not name Himself with the Name the Grateful and the Most Grateful except so that we may increase in the deed He legislated for us to perform, just as the Real increases the favors through our gratitude. So every soul aspires to increase. He says: And when the seeker of wisdom realizes the increase, he isolates himself with matters, striving that no one shares them with him, so that the increase may be of that specific kind. And the state of the master of this station is the contemplation of the state he seeks.\n\n(The Station of Oaths and Vows)\n\nThis Station encompasses sub-stations. Among them is the Station of the Comprehending Merciful Realities. And the Station of Spiritual Portions. And the Station of Inscriptions. And the Station of the Falling Places of Light. And the Station of the Poets. And the Station of Spiritual Levels. And the Station of the Universal Soul (النفس الكلية). And the Station of the Pole (القطب). And the Station of the Bursting Forth of Lights upon the World of the Unseen (عالم الغيب). And the Station of the Levels of the Rational Soul. And the Station of the Difference of Paths. And the Station of Affection. And the Station of the Sciences of Inspiration. And the Station of the Animal Souls. And the Station of the Middle Prayer. And concerning this, I said:\n\nThe Stations of Oaths are in the breadth,\nTheir rulings are in the world of the earth.\nThey run by the spheres of good fortune upon\nHim who adheres to the Sunna and the Obligation.\nAnd their knowledge is restricted to their essence,\nAnd their ruling is in the length and the breadth.\n\nHe says: The oath is the result of suspicion. And the Real deals with creation from the perspective of what they are, not from the perspective of what He is. For this reason, the Real Almighty did not swear by the angels, because they are not from the world of suspicion. And it is not for a created being to swear by a created being, and this is our doctrine. And if he swears by a created being according to us, he is disobedient, and there is no expiation upon him if he breaks the oath; he must only repent for what he fell into. The Real only swore by Himself when He swore by mentioning the created things. And the omission of the Name indicates that, by the manifestation of the Name in places in the Glorious Book, such as His saying: <<فَوَرَبِّ السَّماءِ والْأَرْضِ>> (So by the Lord of the heaven and earth) ... <<بِرَبِّ الْمَشارِقِ والْمَغارِبِ>> (By the Lord of the Easts and the Wests). So that was a sign in the places where the Name was not explicitly mentioned, that it was concealed there for a matter He, glory be to Him, intended in that context. This is known by whomever the Real has made it known to, whether a prophet or an inspired saint. For the oath is proof of the magnification of the one sworn by. And there is no doubt that in the oath, mention is made of those who see and those who do not see. So this includes the elevated and the lowly, the one pleased with and the one angered at, the beloved and the hated, the believer and the disbeliever, the existent and the non-existent. And no one knows the Stations of Oaths except he who knows the World of the Unseen. So it is highly probable that the Divine Name is implied here. And we have informed you that the World of the Unseen is the length, and the World of Witnessing is the breadth.\n\n(The Station of I-ness)\n\nAnd it encompasses sub-stations. Among them is the Station of Solomon, peace be upon him, distinct from other prophets. And the Station of Complete Veiling. And the Station of the Difference of Created Things. And the Station of the Spirit (الروح). And the Station of Sciences. Concerning it, I say:\n\nA holy I-ness (إنية) that is witnessed,\nFor its Existence, there are stations among men.\nIt annihilates the entity when it manifests as a form,\nIn a chapter whose signs differ in excellence.\nAnd it shows you its Existence within you by its attributes,\nBehind the shadows, its Existence encompasses you.\n\nHe says that the Divine Reality, meaningful by the attributes of Transcendence, when witnessed, annihilates every essence (عين) other than itself, even if its witnessing differs in excellence within the single person according to his states, and among different persons due to the difference in their states. This is due to what the Reality grants: that the witness among us witnesses nothing but himself, just as It witnesses nothing of us but Itself. So every reality is a mirror for the other. The believer is the mirror of his brother. <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him).\n\n(The Station of Aeons)\n\nThis Station is upon sub-stations. Among them is the Station of Precedence. And the Station of Might. And the Station of the Spiritualities of the Spheres. And the Station of the Divine Command. And the Station of Birth. And the Station of Balance. And the Station of Glad Tidings of the Encounter. Concerning it, I say:\n\nAnd among the stations are those that are determined,\nLike Time (الزمان), for it is imagined.\nThe revolving spheres indicated it by their cycles,\nAnd for it is disposal and the Greatest Station.\n\nHe says: Since Eternity (الأزل) was an imagined matter concerning the Real, Time was also an imagined matter concerning the Real, meaning, an imagined duration cut by the movements of the spheres. For Eternity is like Time for creation, so understand.\n\n(The Station of Lām-Alif)\n\nThis is the Station of Intertwining, and agreement prevails over difference. He Almighty said: <<وَالْتَفَّتِ السَّاقُ بِالسَّاقِ إِلَى رَبِّكَ يَوْمَئِذٍ الْمَسَاقُ>> (And the leg is intertwined with the leg, to your Lord on that Day will be the driving). And it contains sub-stations. Among them is the Station of the Meeting of the Two Seas and the Gathering of the Two Commands. And the Station of Muhammadan Honor which is beside the Self-Sufficient Station. Concerning it, I say:\n\nThe Stations of the Lām in realization (التحقيق) and the Alif,\nAt the encounter, is the separation of their state of union.\nThey are the highest proof for whoever said, \"Indeed, I am\nThe secret of Existence (الوجود) and I am its essence,\" so understand.\nExcellent are the two proofs, for they indicate by their state,\nNot like the one who indicates by sayings, and then ceases.\n\nHe says: Even if the Lām is connected to the Alif and is contracted, becoming a single essence, and this is manifest in the paired letters in the twenty-eighth station, between the Wāw and the Yā’, which possess soundness and defect. Because of the defect in the Alif and the soundness in the Lām, the correspondence occurred between it and these two letters. So the sound part of it follows the letter of soundness, and the defective part of it follows the letter of defect. So His hands are outstretched with Mercy (الرحمة) and contracted with its opposite. And Lām-Alif has no form in the arrangement of the simple letters, rather it is unseen within them, and its rank remains as it is, between the Wāw and the Yā’. And the Zāy, the Ḥā’, and the dry Ṭā’ have acted as substitutes in its place. So in its unseen aspect, it has the seventh, eighth, and ninth ranks. So it has the station of the moon between the full moon and the crescent. So the rank of the Isthmus (البرزخية) constantly accompanies it in its absence and its manifestation. So it is the twenty-fourth, since it had the seven by the Zāy, the eight by the Ḥā’, and the nine by the Ṭā’, and the day is twenty-four hours. So in whichever hour you act by it, your deed will succeed according to the balance of action by convention, because it is in the letters of calculation, not in the letters of nature. Because it has nothing in the letters of nature except the Lām, which is a letter of the tongue, an isthmus between the throat and the lips. And the Alif is not among the letters of nature. So it only substituted for one letter, which is the Lām, from which the Alif is generated when its vowel is fully pronounced. If it is not fully pronounced, the Hamza appears. For this reason, some scholars made the Alif half a letter and the Hamza half a letter in conventional calculation, not in natural pronunciation. Then we return and say: If the Lām is contracted with the Alif, as we said, and they become a single essence, then its two thighs indicate that they are two. Then the expression by its name indicates that it is two. So it is a composite name of two names for two essences. One essence is the Lām, and the other is the Alif. But when they appeared in the form as a single shape, the observer did not distinguish between them, and it was not clear to him which of the two thighs was the Lām so that the other might be the Alif. So the scribes differed concerning it. Some considered the pronunciation, and others considered what the drawer begins with, making it first. They agreed on the precedence of the Lām over the Alif, because the Alif here is undoubtedly generated from the Lām. And likewise, the Hamza follows the Lām, as in His saying: <<لَأَنْتُمْ أَشَدُّ رَهْبَةً>> (You are certainly a greater fear) and its likes. And this letter, meaning Lām-Alif, is the letter of ambiguity in the Acts (الأفعال). So the apparent act performed by the created being was not purified as to whom it belongs. If you say it is for Allah, you speak truly, and if you say it is for the created being, you speak truly. Were it not for that, the religious obligation and the attribution of the deed from Allah to the servant would not be valid. The Prophet, peace and blessings be upon him, says: \"They are only your deeds returned to you.\" And Allah says: <<وَمَا يَفْعَلُوا مِنْ خَيْرٍ فَلَنْ يُكْفَرُوهُ>> (And whatever good they do, they will never be denied it) and <<اعْمَلُوا مَا شِئْتُمْ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ>> (Do what you will; indeed, He is Seeing of what you do). And Allah speaks the Truth. So likewise, whichever of the two thighs you make the Lām or the Alif, you speak truly, even if the practice differs in placing the shape among the scholars of it, for the sake of realizing the form. And whoever indicates that the act belongs to one of the two thighs without the other, that is not correct, and its proponent is cut off and does not remain firm. And another person among the people of that concern contradicts him in that and indicates, in his claim, and the saying with him is like the saying with his opponent. And the matter conflicts and becomes difficult, except for the one whose insight Allah has illuminated and guided to the straight path.\n\n(The Station of Confirmation)\n\nAnd it encompasses sub-stations. Among them is the Station of Enumeration of Blessings. And the Station of Removal of Harm. And the Station of Absolute Association (الشرك المطلق). Concerning that, I say:\n\nThe stations were confirmed by stillness,\nAnd manifestation (الظهور) outweighed concealment (الكمون).\nAnd they indicated, by direct sight, springs\nGushing forth from flowing water.\nAnd they indicated, by lightning flashes, rain clouds\nWhich, when they flash, point to the Manifest Light.\n\nKnow, may Allah support you, that he says permanence confirms the stations. So whoever is permanent and manifests to every essence upon its reality. Do you not see what the speed of movement grants you of resemblance? So the observer judges the thing contrary to what that thing truly is. He says concerning the fire in the ember or the tip of the wick, if it moves quickly horizontally, that it is an elongated line. Or he spins it quickly and sees a circle of fire in the air. And the reason for that is the lack of permanence. And when the stations are permanent, they indicate the Divine sciences they contain.\n\n(The Station of Witnessing)\n\nAnd it is a single station: the Station of the Annihilation of the Cosmos (فناء الكون). In it, whoever did not exist is annihilated, and whoever has always existed remains. Concerning it, I say:\n\nIn the Annihilation of the Cosmos is a station,\nWhose spirit descends within us.\nIndeed, it is my Night of Power,\nIt has neither light nor shadow.\nIt is the pure essence of Light,\nThere is no movement away from it.\nSo I am truly the Imam,\nA king in the first breast/origin.\nWith him is the key to my command,\nSo he appoints you and dismisses you.\nMy Samhari spears are long,\nI am not the unarmed Simāk (star).\nSo the Real Station (المقام الحق) in you\nIs permanent and does not change.\nAnd He is the Subduer from Him,\nAnd He is the Most Just Imam.\nHe is not the represented light,\nBut more perfect than the wild cow (or crystal).\nAnd I am certainly from Him,\nIn the place of the most excellent secret.\nSo by the essence of the Essence (عين العين) I ascend,\nAnd by the command of the Command (أمر الأمر) I descend.\n\nHe says: The state of annihilation has neither light nor shadow, like the Night of Power. Then he said: And that is the true light and the true shadow. For it is the origin that has no opposite. And lights are opposed by darknesses, but this is opposed by nothing. And his saying, \"I am the Imam,\" means his witnessing of the Real from the specific aspect that is from Him to me, which is the first breast/origin. And from this station occurs the detailing, the multiplicity (الكثرة), and the number in the forms. And he made the Samhari spears a metaphor for the influence of the Self-Subsisting (القيومية) in the world. And it possesses permanence, and that is why he said, \"does not change.\" And for Him is subjugation and justice, which does not accept anthropomorphism. So by witnessing the Essence (الذات) I ascend, and by the Divine Command (الأمر الإلهي) I descend as an Imam in the world.\n\n(The Station of Intimacy)\n\nIt is a single station, and concerning it, I say:\n\nThe Stations of Intimacy (الألفة) are familiar,\nAnd by this description they are known.\nSo say to him who celebrates his wedding therein: \"Stay,\"\nFor it is surrounded by security (الأمن).\nAnd it is dependent upon the two,\nAnd diverted from the torment of the single one.\n\nThis is the Station of weddings, joy, and happiness. And it is among what Allah bestowed upon His Prophet Muhammad, peace and blessings be upon him, when He said: <<لَوْ أَنْفَقْتَ مَا فِي الْأَرْضِ جَمِيعًا مَا أَلَّفْتَ بَيْنَ قُلُوبِهِمْ>> (Had you spent all that is in the earth, you could not have reconciled their hearts)—meaning, against you—<<وَلَكِنَّ اللَّهَ أَلَّفَ بَيْنَهُمْ>> (but Allah reconciled them)—meaning, upon your affection, your response, and your confirmation.\n\n(The Station of Inquiry)\n\nAnd it encompasses sub-stations. Among them is the Station of Spiritual Contention. And the Station of the adornment of the fortunate, how it appears upon the wretched, and vice versa. And the Station of the cosmos before the human. Concerning it, I say:\n\nIf I inquire about the beloveds of my heart,\nThey refer me to the inquiry of my utterance.\nTheir stations are only by your utterance,\nO my misfortune for that, and my ill luck!\nI admonished the soul not to look at them,\nBut it did not turn its thought to my admonition.\nI cast them out, hoping to attain a cosmos,\nBut they were the very essence of my cosmos, the essence of my utterance.\nAnd he said: And it is wondrous that I yearn for them,\nAnd ask about them those whom I see, while they are with me.\nAnd my eye watches for them while they are in its blackness,\nAnd my heart longs for them while they are between my ribs.\n\nHe says: They are on my tongue when I ask about them, and in the blackness of my eye when I look at them, and in my heart when I think of them and long for them. So they are with me in every state I am in. So they are my essence, but I am not their essence, since they do not possess of me what I possess of them.\n\n(The Station of Threat)\n\nIt is a single station, containing injustice and adherence to the cosmos. Concerning it, I said:\n\nIndeed, the Threat (الوعيد) is two stations, for him\nWho abandoned the spiritual journey (السلوك) upon the most upright path.\nBut when his existence is realized by perfection,\nAnd he walks according to the ruling of the primordial height,\nThey return as bliss for him, so his bliss\nIs in the Fire, and it is the bliss of every honored one.\n\nA spiritual station, which is the torment of the souls, and a physical station, which is the sensible torment. And it only occurs for him who deviates from the legislated path, outwardly and inwardly. But if he is granted success in uprightness, and Providence preceded for him, he is protected from that, and he finds bliss in the fire of striving (المجاهدة) for the paradise of witnessing (المشاهدة).\n\n(The Station of Command)\n\nAnd it encompasses sub-stations. The Station of the Spirits of the Isthmus. And the Station of Teaching. And the Secret Station. And the Station of the Cause. And the Station of Amulets. And the Station of the Pole and the Two Imams. Concerning it, we have:\n\nThe Stations of Command (الأمر)—it is the I-ness of the Essence (إنية الذات),\nBy which my joys and pleasures are attained.\nWould that I remain standing in them throughout my life,\nAnd not depart until the time of the Encounter.\nThe coolness of the eye for the Chosen One was his,\nWhen he manifested in the origin of the intimate discourse (المناجاة).\n\nThe Divine Command is from the Attribute of Speech (الكلام). And it is blocked off from the saints (الأولياء) from the perspective of legislation. And there is no obligatory command in the Divine Presence unless it is legislated. So nothing remains for the saint except hearing its command when it commands the prophets. So the saint, upon hearing that, experiences a pleasure pervading his existence. But there remains for the saints the Divine intimate discourse in which there is no command, only conversation and narration. So whoever among the people of unveiling (الكشف) says that he is commanded by a Divine command in his movements and stillness that contradicts a Muhammadan legislative obligation, the matter has become ambiguous for him, even if he is truthful in what he said he heard. It is only possible if a Divine Theophany (تجلي إلهي) appeared to him in the form of his Prophet, peace and blessings be upon him, and his Prophet addressed him, or he was established in hearing the address of his Prophet. And that is because the Messenger conveys the command of the Real Almighty, which Allah commanded His servants with. So it is possible that he hears from the Real in a certain Presence that command which His Messenger, peace and blessings be upon him, first brought to him, so he says, \"The Real commanded me,\" but in his case, it is merely an affirmation that He has commanded. And this cause was cut off with Muhammad, peace and blessings be upon him. And regarding commands from Allah other than the legislated ones, the saints have a firm footing in that. Thus, we have covered the nineteen categories of stations. So let us mention the most specific characteristics of each station, and we say:\n\n### (Section) [Mentioning the Most Specific Characteristics of Each of the Nineteen Stations]\n\nThe most specific characteristic of the Station of Commendation is the connection of Knowledge (العلم) to what is endless. And the most specific characteristic of the Station of Symbols is the connection of Knowledge to the properties of numbers and Names (الأسماء), which are the words and letters, and in it is the science of Sympathy/Magic. And the most specific characteristic of the Station of Supplication is the sciences of allusion and adornment. And the most specific characteristic of the Station of Acts is the science of the Now. And the most specific characteristic of the Station of Beginning is the science of the Origin and the Return, and the knowledge of the primordial aspects of everything. And the most specific characteristic of Transcendence is the science of stripping off and divestiture. And the most specific characteristic of Nearness is the science of indications. And the most specific characteristic of the Station of Expectation is the science of kinship and relations. Or the most specific characteristic of the Station of Blessings is the science of causes, conditions, defects, proofs, and the Reality (الحقيقة). And the most specific characteristic of Oaths is the sciences of Magnificence. And the most specific characteristic of the Station of Aeon is the science of Eternity and the permanence of the Creator’s Existence (وجود). Or the most specific characteristic of the Station of I-ness is the science of the Essence (الذات). And the most specific characteristic of the Station of Lām-Alif is the science of the relation of the cosmos to the Originator. And the most specific characteristic of the Station of Confirmation is the science of Presence. And the most specific characteristic of the Station of Annihilation of the Cosmos is the science of the transformation of the essences (الأعيان). And the most specific characteristic of the Station of Intimacy is the science of cohesion/fusion. And the most specific characteristic of the Station of Threat is the science of the dwelling places. And the most specific characteristic of the Station of Inquiry is the knowledge of: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing like unto Him). And the most specific characteristic of the Station of Command is the science of servitude (العبودة).\n\n### (Section) [Mentioning the Nineteen Divine Stations and What Corresponds to Them Among the Contingent Things]\n\nKnow that for every one of these nineteen stations, there is a category of contingent things (الممكنات). Among them is the category of angels, and they are a single category, even if their states differ. (And the science of bodies is eighteen): The spheres are eleven types, the elements are four, and the generated things are three. And they have another aspect that corresponds to them among the contingent things in the Divine Presence (الحضرة الإلهية):\n\n1. The substance (الجوهر) for the Essence (الذات)—and this is the first.\n2. The second: the accidents, and they are for the Attributes (الصفات).\n3. The third: Time (الزمان), and it is for Eternity (الأزل).\n4. The fourth: Space, and it is for Establishment or the descriptions.\n5. The fifth: the relations for the relations.\n6. The sixth: the positions for the Comprehending Reality.\n7. The seventh: the quantities for the Names (الأسماء).\n8. The eighth: the qualities for the Theophanies (التجليات).\n9. The ninth: the influences for Generosity.\n10. The tenth: the affections/passions for the manifestation in the forms of beliefs.\n11. The eleventh: the specific property, and it is for the Oneness (الأحدية).\n12. The twelfth: the bewilderment, and it is for the description by descent, joy, loan, and similar things.\n13. The thirteenth: the life of existent things for the Living.\n14. The fourteenth: Gnosis (المعرفة) for Knowledge (العلم).\n15. The fifteenth: the passing thoughts for the Will.\n16. The sixteenth: the sights for the Seeing.\n17. The seventeenth: the hearing for the Hearing.\n18. The eighteenth: the human for Perfection (الكمال).\n19. The nineteenth: the lights and the darknesses for the Light (النور).\n\n(Section on the Correspondences of the Nineteen Stations)\n\nTheir correspondences from the Quran are the isolated letters at the beginning of the Surahs, and they are fourteen letters in five levels: singular, dual, triple, quadruple, and quintuple. And their correspondences from the Fire are the nineteen guardian angels. Their correspondences in influence are the twelve constellations and the seven wandering stars. Their correspondences from the Quran are the letters of the Basmala. And their correspondences from men are the twelve Chiefs and the seven Substitutes (الأبدال). And these seven include the four Pegs (الأوتاد), the two Imams, and the one Pole (القطب). And the correspondences for these stations from the Divine Presence and from the cosmoses are numerous.\n\n### (Section) [Concerning the Station of Stations, or the Manifest Imam]\n\nKnow that the Station of Stations (منزل المنازل) is an expression for the station that gathers all the stations that appear in the world of this life, from the Throne (العرش) to the dust, and it is called the Manifest Imam (الإمام المبين). Allah Almighty said: <<وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ>> (And all things We have enumerated in a Manifest Imam). So His saying, \"We have enumerated it,\" is proof that He only deposited finite sciences within it. So we looked into whether their number could be confined by anyone, and they escaped confinement despite being finite, because it contains only what has existed from the day Allah created the world until the state of this life ends and the habitation transfers to the Hereafter. So we asked someone whom I trust among the scholars of Allah whether the fundamental sciences contained in this Manifest Imam are confined. He said: Yes. So the trustworthy, faithful, truthful companion informed me—and he made me promise not to mention his name—that the fundamental sciences, each of which encompasses an unquantifiable multiplicity, reach the number of one hundred twenty-nine thousand six hundred types of sciences. And every type contains vast sciences, which are expressed as stations. So I asked this trustworthy person: Has anyone among Allah’s creation attained them and encompassed them with knowledge? He said: No. Then he said: <<وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ>> (And none knows the hosts of your Lord except Him). And since the hosts are known only to Him, and the Real has no contender that these hosts would need to confront, he said to me: Do not wonder, <<فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ>> (So by the Lord of the heaven and earth), there is indeed something more wondrous. I said: What is it? He said to me: That which Allah mentioned concerning two women among the wives of the Messenger of Allah, peace and blessings be upon him. Then he recited: <<وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ وَالْمَلَائِكَةُ بَعْدَ ذَلِكَ ظَهِيرٌ>> (And if you two [wives] cooperate against him, then indeed Allah is his Protector, and Gabriel, and the righteous among the believers, and the angels, moreover, are his supporters). So this is more wondrous than the mention of the hosts. For the secrets of Allah are wondrous. When he told me that, I asked Allah to inform me of the benefit of this matter and what this magnificence is, against which Allah placed Himself, Gabriel, the righteous believers, and the angels. So I was informed of it, and I was never delighted by anything as much as I was delighted by the knowledge of that. And I knew upon whom the two women relied and who strengthened them. And were it not for Allah mentioning Himself in the support, the angels and the believers would not have been able to resist them. And I knew that they had attained such knowledge of Allah and such influence in the world that granted them this power. And this is from the knowledge that is like the hidden treasure. So I thanked Allah for what He bestowed. I do not think that anyone among Allah’s creation relied upon what these two women relied upon. Lot, peace be upon him, says: <<لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلَى رُكْنٍ شَدِيدٍ>> (If only I had strength against you or could take refuge in a strong support). And he had the strong support, but he did not know it. For the Prophet, peace and blessings be upon him, testified to that, saying: \"May Allah have mercy on my brother Lot; he certainly took refuge in a strong support.\" And Aisha and Hafsa knew it. If people knew the knowledge upon which they stood, they would understand the meaning of this verse. And Allah speaks the Truth, and He guides to the way.",
    "ur": "باب بائیسواں: منازل کے منزل کے علم اور تمام کونیاتی علوم کی ترتیب کی معرفت میں۔\n\nتعجب ہے بلند نفوس کے اقوال پر\nکہ منازل، منازل میں جاری و ساری ہیں\n\nپستی سے بلندی کی طرف عروج کیسے ہو\nسوائے اس کے کہ حضرۃ المتعالیہ (الحضرة المتعالية) کو مغلوب کیا جائے\n\nپس تحلیل (التحليل) کی صنعت اپنے معراج میں\nلطائف اور بلند امور کی طرف ہے\n\nاور ترکیب (التركيب) کی صنعت اپنے رجوع کے وقت\nہستی (الوجود) کی چمک کے ساتھ ہاویہ کے اندھیرے کی طرف ہے۔\n\n### [علوم کی ترتیب اور ان کا احصاء]\n\nجان لو، اللہ تمہاری مدد کرے، کہ جب اللہ سے منسوب علم کثرت اور ترتیب کو قبول نہیں کرتا، کیونکہ وہ نہ تو اکتسابی ہے اور نہ ہی مستفاد، بلکہ اس کا علم عین اس کی ذات ہے، جیسا کہ اس سے منسوب دیگر صفات اور جن اسماء سے اسے موسوم کیا گیا ہے۔ اور اللہ کے سوا دیگر علوم کا مرتب اور محصور ہونا ضروری ہے، خواہ وہ علوم وہبی ہوں یا علوم کسبی۔ یہ اس ترتیب سے خالی نہیں ہو سکتے جس کا ہم ذکر کر رہے ہیں: اولاً علم مفرد، پھر علم ترکیب، پھر علم مرکب۔ اور ان کا کوئی چوتھا نہیں ہے۔ اگر وہ مفردات میں سے ہو جو ترکیب کو قبول نہیں کرتے تو اس کا علم مفرد ہی ہوتا ہے، اور باقی بھی اسی طرح ہیں۔ کیونکہ ہر معلوم کا یا تو مفرد ہونا ضروری ہے یا مرکب۔ اور مرکب لازمی طور پر علم ترکیب کے تقدم کا متقاضی ہوتا ہے، اور تب علم مرکب ہوتا ہے۔\n\n### [نازل ہونے والے کے لیے انیس منازل]\n\nیہ تم نے تمام کونیاتی علوم کی ترتیب جان لی۔ اب ہم تمہارے لیے اس منزل میں منازل کے حصر کو بیان کرتے ہیں، جو کہ بے شمار ہیں۔ ہم ان میں سے صرف ان پر اکتفا کریں گے جو ہماری شریعت سے خاص تعلق رکھتے ہیں اور جن میں امتیاز پایا جاتا ہے، نہ کہ ان منازل پر جن میں ہمارے اور دیگر ملتوں اور نحلوں کے علوم کے درمیان اشتراک ہے۔ ان کی کل تعداد انیس (۱۹) مراتب ہیں جو امہات (بنیادی) ہیں۔ ان میں سے کچھ ایسی ہیں جن سے مزید منازل متفرع ہوتی ہیں اور کچھ ایسی ہیں جو متفرع نہیں ہوتی ہیں۔ ہم ان مراتب کے نام ذکر کریں گے اور انہیں منازل کا نام دیں گے، کیونکہ حضرۃ الٰہیہ (الحضرة الإلهية) میں ہمیں اسی طرح ان کی معرفت کرائی گئی ہے، اور ادب اولیٰ ہے۔ ہم ان منازل کے القاب، ان کے ارباب اور ان کے اقطاب (قطب) کی صفات کا ذکر کریں گے جو ان سے متحقق ہیں، اور ان کے احوال اور ان احوال میں سے ہر حال کی کیا صفت ہے۔ پھر اس کے بعد، ان شاء اللہ، ہم ان انیس اصناف میں سے ہر ایک کا ذکر کریں گے اور ان میں شامل امہات المنازل (بنیادی منازل) میں سے کچھ کا ذکر کریں گے، نہ کہ تمام منازل کا۔ کیونکہ وہاں ایک منزل ایسی ہے جو سو سے زیادہ علامات اور دلالات کی منازل پر مشتمل ہے جو واضح انوار پر دلالت کرتی ہیں، اور ہزاروں یا اس سے کم غایات کی منازل پر مشتمل ہے جو پوشیدہ اسرار اور واضح خواص کو اپنے اندر سموئے ہوئے ہیں۔ پھر ہم اس کے بعد ان شاء اللہ، ان منازل کے لیے موجودات (قدیم اور جدید) میں سے اس تعداد کے مماثل چیزوں کا ذکر کریں گے، پھر ہم اس منزل کے بعض معانی سے متعلق امور کو تقریباً اور اختصار کے ساتھ بیان کریں گے۔\n\n### «ان کے القاب اور ان کے اقطاب کی صفات کا ذکر»\n\nان میں سے: منازل الثناء والمدح (تعریف اور مدح کی منازل) اہل کشوفات (الکشوفات) اور فتح کے لیے ہیں۔ منازل الرموز والألغاز (رموز اور معموں کی منازل) اہل حقیقت (الحقيقة) اور مجاز کے لیے ہیں۔ منازل الدعاء (دعا کی منازل) اہل اشارات اور بعد کے لیے ہیں۔ منازل الأفعال (افعال کی منازل) اہل احوال اور اتصال کے لیے ہیں۔ منازل الابتداء (ابتداء کی منازل) اہل ہواجس اور ایماء کے لیے ہیں۔ منازل التنزيه (تنزيه کی منازل) مناظرات اور استنباط میں توجیہ کے اہل کے لیے ہیں۔ منازل التقريب (تقریب کی منازل) متألہین (المتألهين) غرباء کے لیے ہیں۔ منازل التوقع (توقع کی منازل) سبحات کی وجہ سے نقاب پوشوں (أصحاب البراقع) کے لیے ہیں۔ منازل البركات (برکات کی منازل) اہل حرکات کے لیے ہیں۔ منازل الأقسام (قسموں کی منازل) روحانیین میں سے اہل تدبیر کے لیے ہیں۔ منازل الدهر (دہر کی منازل) اہل ذوق کے لیے ہیں۔ منازل الإنية (انیت کی منازل) آنکھوں سے مشاہدہ (المشاهدة) کرنے والوں کے لیے ہیں۔ منازل اللام والألف (لام اور الف کی منازل) اخلاق الٰہیہ سے متخلق ہونے سے حاصل ہونے والے التفاف کے لیے اور اس سر کے اہل کے لیے جو منکشف نہیں ہوتا۔ منازل التقرير (تقریر کی منازل) طبیعی اور روحانی کیمیا کے علم کے اہل کے لیے ہیں۔ منازل فناء الأكوان (اکوان کے فنا کی منازل) مخدرات (پردہ نشینوں) کے لیے ہیں۔ منازل الألفة (الفت کی منازل) غرف (بالا خانوں) کے اہل میں سے اہل امان کے لیے ہیں۔ منازل الوعيد (وعید کی منازل) عرش امجد کی فہرست سے متمسک رہنے والوں کے لیے ہیں۔ منازل الاستخبار (استفسار کی منازل) پوشیدہ اسرار کے اہل کے لیے ہیں۔ منازل الأمر (امر کی منازل) ان کے اندر اپنے سر کی حقیقتوں سے متحقق ہونے والوں کے لیے ہیں۔\n\nجہاں تک ان کی صفات کا تعلق ہے، تو اہل مدح کے لیے زہو (فخر) ہے، اور اہل رموز کے لیے اعتراض سے نجات ہے۔ اور متألہین کے لیے تخلق کے ذریعے تیہ (حیرت) ہے۔ اور اہل احوال اور اتصال کے لیے عین (حقیقت) کا حصول ہے۔ اور اہل اشارہ کے لیے تبلیغ کے وقت حیرت ہے۔ اور اہل استنباط کے لیے غلطی اور درستی دونوں ہیں، اور وہ معصوم نہیں ہیں۔ اور غرباء کے لیے انکسار ہے۔ اور اہل براقع (نقاب پوشوں) کے لیے خوف ہے۔ اور اہل حرکت کے لیے اسباب کا مشاہدہ ہے۔ اور مدبرین کے لیے فکر ہے۔ اور ممکنون (ممکنات) کے لیے حدود ہیں۔ اور اہل مشاہدہ کے لیے جحد (انکار) ہے۔ اور اہل کتم (چھپانے والے) کے لیے سلامتی ہے۔ اور اہل علم کے لیے معلوم پر حکم ہے۔ اور اہل ستر (پردہ پوشی) اس کے اٹھائے جانے کے منتظر ہیں۔ اور اہل امن مکر کے خوف کے مقام پر ہیں۔ اور اہل قیام کے لیے قعود (بیٹھنا) ہے۔ اور اہل الہام کے لیے تحکم (حکم چلانا) ہے۔ اور اہل تحقیق کے لیے تین لباس ہیں: ایمان، کفر، اور نفاق کا لباس۔\n\n### [نازل ہونے والے کے ارباب کے احوال]\n\nجہاں تک ان کے احوال کے ذکر کا تعلق ہے، تو جان لو کہ اللہ تعالیٰ نے نازل (اترنے والے) کے لیے منازل کو تیار کیا، اور عاقل (عقل مند) کے لیے معاقل (پناہ گاہوں) کو ہموار کیا، اور راحل (سفر کرنے والے) کے لیے مراحل کو سمیٹ دیا، اور عالم (جاننے والے) کے لیے معالم (نشانات) کو بلند کیا، اور قاسم (تقسیم کرنے والے) کے لیے مقاسم (حصوں) کو تفصیل سے بیان کیا، اور قاصم (توڑنے والے) کے لیے قواصم (توڑنے والی چیزوں) کو تیار کیا، اور عاصم (بچانے والے) کے لیے عواصم (حفاظت کی جگہوں) کو واضح کیا، اور قاعد (بیٹھنے والے) کے لیے قواعد (بنیادوں) کو بلند کیا، اور راصد (نگرانی کرنے والے) کے لیے مراصد (رصد گاہوں) کو مرتب کیا، اور راکب (سوار) کے لیے مراکب (سواریوں) کو مسخر کیا، اور ذاہب (جانے والے) کے لیے مذاہب (راستوں) کو قریب کیا، اور حامد (حمد کرنے والے) کے لیے محامد (تعریفوں) کو سطر کیا، اور قاصد (ارادہ کرنے والے) کے لیے مقاصد (مقصدوں) کو آسان کیا، اور عارف (معرفت رکھنے والے) کے لیے معارف (معرفتوں) کو پیدا کیا، اور واقف (ٹھہرنے والے) کے لیے مواقف (ٹھہرنے کی جگہوں) کو ثابت کیا، اور سالک (راستہ چلنے والے) کے لیے مسالک (راستوں) کو دشوار گزار بنایا، اور ناسک (عبادت گزار) کے لیے مناسک (عبادتوں) کو متعین کیا، اور شاہد (مشاہدہ کرنے والے) کے لیے مشاہد (مشاہدات) کو خاموش کر دیا، اور راقد (سونے والے) کے لیے فراقد (ستاروں) کی حفاظت کی۔\n\n### «ان کے احوال کی صفات کا ذکر»\n\nبے شک اس (اللہ) نے نازل (اترنے والے) کو مقدر (اندازہ لگانے والا) بنایا، اور عاقل کو مفکر (غور کرنے والا)، اور راحل کو مشمر (تیار رہنے والا)، اور عالم کو مشاہد (مشاہدہ کرنے والا)، اور قاسم کو مکابد (مشقت اٹھانے والا)، اور قاصم کو مجاہد (جہاد کرنے والا)، اور عاصم کو مساعد (مددگار)، اور قاعد کو عارف (معرفت رکھنے والا)، اور راصد کو واقف (ٹھہرنے والا)، اور راکب کو محمول (اٹھایا ہوا)، اور ذاہب کو معلول (علت والا)، اور حامد کو مسئول (جس سے سوال کیا جائے)، اور قاصد کو مقبول (قبول کیا گیا)، اور عارف کو مبخوت (حیران)، اور واقف کو مبہوت (دنگ)، اور سالک کو مردود (رد کیا گیا)، اور ناسک کو مبعود (دور کیا گیا)، اور شاہد کو محکم (مضبوط)، اور راقد کو مسلم (سپرد کرنے والا) بنایا۔ یہ ہم نے ان انیس اصناف کی صفات ان کے احوال میں ذکر کر دی ہیں۔ اب ہم ذکر کرتے ہیں کہ ہر صنف امہات المنازل (بنیادی منازل) میں سے کس چیز پر مشتمل ہے، اور ان امہات میں سے ہر منزل منازل کی چار اصناف پر مشتمل ہے۔ پہلی صنف منازل الدلالات (دلالتوں کی منازل) کہلاتی ہے، دوسری صنف منازل الحدود (حدود کی منازل) کہلاتی ہے، تیسری صنف منازل الخواص (خواص کی منازل) کہلاتی ہے، اور چوتھی صنف منازل الأسرار (اسرار کی منازل) کہلاتی ہے۔ یہ کثرت میں بے شمار ہیں۔ ہم انیس پر اکتفا کرتے ہیں اور ان امہات کی تعداد کا ذکر کرتے ہیں جو ان میں شامل ہیں، اور یہ ان میں سے پہلی ہے۔\n\n### [منزل المدح]\n\nمنزل المدح (مدح کی منزل) کے لیے منزل الفتح (فتح کی منزل) ہے، جو دو سروں کی فتح ہے، اور مفاتیح الاول (پہلی کنجیاں) کی منزل ہے۔ اور اس بارے میں ہمارا ایک حصہ ہے جسے ہم نے مفاتیح الغیوب (غیب کی کنجیاں) کا نام دیا ہے۔ اور منزل العجائب (عجائبات کی منزل)، اور برزخی ارواح کو مسخر کرنے کی منزل، اور علوی ارواح کی منزل۔ اور اس کے بعض معانی کے بارے میں ہماری نظم میں یہ قول ہے:\n\n> منازل المدح والتباهي *** منازل ما لها تناهي‏\n> *ترجمہ:* مدح اور فخر کی منازل / ایسی منازل ہیں جن کی کوئی انتہا نہیں\n> لا تطلبن في السمو مدحا *** مدائح القوم في الثرى هي‏\n> *ترجمہ:* بلندی میں مدح مت طلب کرو / قوم کی مدح تو مٹی میں ہے\n> من ظمئت نفسه جهادا *** يشرب من أعذب المياه‏\n> *ترجمہ:* جس کا نفس جہاد سے پیاسا ہو / وہ میٹھے ترین پانیوں سے پیتا ہے\n\nہم کہتے ہیں کہ بندے کی مدح یہ نہیں ہے کہ وہ اپنے آقا کی صفات سے متصف ہو، کیونکہ یہ سوءِ ادب ہے۔ اور آقا کے لیے تواضعاً اپنے بندے کی صفات سے متصف ہونا جائز ہے۔ آقا کے لیے نزول (نیچے آنا) ہے کیونکہ اس پر کوئی حکم نہیں چلتا، لہٰذا اس کا اپنے بندے کی صفات کی طرف نزول اس پر اس کا فضل ہے تاکہ وہ اسے کشادگی دے۔ کیونکہ آقا کا جلال بندے کے دل میں اس سے کہیں زیادہ عظیم ہے کہ وہ اس پر دلالت کرے، اگر وہ اس کی طرف نزول نہ کرتا۔ اور بندے کے لیے جائز نہیں کہ وہ اپنے آقا کی صفات سے متصف ہو، نہ اس کی موجودگی میں اور نہ ہی اپنے بھائیوں (بندوں) کے سامنے، اگرچہ وہ ان پر حاکم ہی کیوں نہ ہو۔ جیسا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"میں اولاد آدم کا سردار ہوں اور مجھے فخر نہیں\"۔ اور اللہ تعالیٰ نے فرمایا: تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها (یہ آخرت کا گھر ہے، ہم اسے بناتے ہیں) یعنی ہم اسے ملکیت دیتے ہیں، لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا في الْأَرْضِ (ان لوگوں کے لیے جو زمین میں بلندی نہیں چاہتے)۔ کیونکہ اللہ نے زمین کو ذلیل بنایا ہے اور بندہ ذلیل ہے، اور ذلت بلندی کا تقاضا نہیں کرتی۔ پس جو اپنی حد سے تجاوز کرتا ہے وہ ہلاک ہو جاتا ہے۔ کہا جاتا ہے: \"وہ شخص ہلاک نہیں ہوا جس نے اپنی قدر پہچانی\"۔ اور ان کا قول \"ما لها تناهي\" (اس کی کوئی انتہا نہیں) کا مطلب ہے کہ بندے کے لیے اپنی بندگی میں کوئی انتہا نہیں ہے جہاں پہنچ کر وہ رب بن جائے، جیسا کہ رب کے لیے کوئی حد نہیں ہے جہاں پہنچ کر وہ بندہ بن جائے۔ پس رب ہمیشہ کے لیے رب ہے اور بندہ ہمیشہ کے لیے بندہ ہے۔ اسی لیے انہوں نے کہا: \"قوم کی مدح تو مٹی میں ہے\"، اور وہ زمین کی سطح سے بھی زیادہ ذلیل ہے۔ اور انہوں نے کہا: \"پانی کی لذت صرف پیاسا ہی جانتا ہے\"۔ یعنی بندگی کی صفت سے متصف ہونے کی لذت صرف وہی جانتا ہے جس نے ربوبیت کی صفت سے متصف ہونے اور مخلوق کے اس کی محتاج ہونے پر تکلیفیں چکھیں۔\n\nجیسے سلیمان علیہ السلام نے جب یہ طلب کیا کہ اللہ تعالیٰ تمام بندوں کے رزق کو حسی طور پر ان کے ہاتھوں پر رکھ دے۔ اس وقت جو کچھ بھی کھانے پینے کی چیزیں ان کے پاس موجود تھیں، تو سمندر کے جانوروں میں سے ایک جانور نکلا اور اپنا روزانہ کا رزق طلب کیا۔ سلیمان نے اس سے کہا کہ اس میں سے اپنی روزانہ کی خوراک کے مطابق لے لو۔ اس نے وہ سب کھا لیا یہاں تک کہ آخر تک پہنچ گیا۔ پھر اس نے کہا: مجھے اور دو، کیونکہ تم نے میرے رزق کو پورا نہیں کیا۔ بے شک اللہ مجھے ہر روز اس سے دس گنا زیادہ دیتا ہے، اور مجھ سے بڑے جانوروں کا رزق اس سے بھی زیادہ ہے۔ پس سلیمان علیہ السلام نے اپنے رب سے توبہ کی اور جان لیا کہ مخلوق کی وسعت میں وہ نہیں ہے جو خالق تعالیٰ کے لیے مناسب ہے۔ کیونکہ انہوں نے اللہ سے ایسی بادشاہت طلب کی تھی جو ان کے بعد کسی کے لیے مناسب نہ ہو۔ جب انہوں نے یہ دیکھا تو اپنے سوال سے استعفیٰ دے دیا، اور تمام جانور ان کے پاس ہر طرف سے اپنا رزق طلب کرنے کے لیے جمع ہو گئے، جس سے وہ تنگ دل ہو گئے۔ جب اللہ نے ان کا سوال قبول کیا اور انہیں معاف کر دیا، تو انہیں اس کی ایسی لذت ملی جس کا اندازہ نہیں لگایا جا سکتا۔\n\n(منزل الرموز)\n\nجان لو، اللہ تمہیں توفیق دے، کہ اگرچہ یہ ایک منزل ہے، لیکن یہ کئی منازل پر مشتمل ہے، جن میں منزل الوحدانية (وحدانیت کی منزل)، منزل العقل الأولي (عقل اول کی منزل)، عرش اعظم، صدا (گونج)، اور علماء کا عرش تک پہنچنا، اور علم تمثل (تمثل کا علم)، اور منزل القلوب (دلوں کی منزل)، اور حجاب، اور منزل الاستواء الفهواني (فہوانی استواء کی منزل)، اور ساری الوہیت، اور کاہنوں کا استمداد، اور دہر، اور وہ منازل جن میں نہ ثبات ہے اور نہ کسی کے لیے ان میں ثبات ہے، اور منزل البرازخ (برزخوں کی منزل)، اور الوہیت، اور زیادتی، اور غیرت، اور منزل الفقد والوجدان (فقدان اور وجدان کی منزل)، اور شکوک کو دور کرنے کی منزل، اور جود (سخاوت)، اور مخزون (خزانہ)، اور منزل القہر والخسف (قہر اور دھنسانے کی منزل)، اور وسیع زمین کی منزل۔ جب میں اس منزل میں داخل ہوا اور میں تونس میں تھا، تو مجھ سے ایک چیخ نکلی جس کا مجھے علم نہیں تھا کہ وہ مجھ سے نکلی ہے، سوائے اس کے کہ جس نے بھی اسے سنا وہ بے ہوش ہو کر گر پڑا، اور پڑوسیوں کی عورتیں جو گھر کی چھت پر کھڑی ہمیں دیکھ رہی تھیں، وہ بھی بے ہوش ہو گئیں، اور ان میں سے کچھ چھتوں سے صحن میں گر گئیں، باوجود اس کی بلندی کے، اور انہیں کوئی نقصان نہیں پہنچا۔ میں سب سے پہلے ہوش میں آیا، اور ہم ایک امام کے پیچھے نماز پڑھ رہے تھے۔ میں نے سب کو بے ہوش دیکھا۔ کچھ دیر بعد وہ ہوش میں آئے تو میں نے پوچھا: تمہارا کیا حال ہے؟ انہوں نے کہا: تمہارا کیا حال ہے؟ تم نے ایک ایسی چیخ ماری جس نے جماعت میں یہ اثر پیدا کر دیا۔ میں نے کہا: خدا کی قسم، مجھے خبر نہیں کہ میں نے چیخ ماری ہے۔ اور منزل الآیات الغربية (عجیب نشانیوں کی منزل)، اور حکم الٰہیہ (الٰہی حکمتوں کی منزل)، اور منزل الاستعداد والزينة (تیاری اور زینت کی منزل)، اور وہ امر جس سے اللہ نے آسمانی افلاک کو تھام رکھا ہے، اور منزل الذکر والسلب (ذکر اور سلب کی منزل)۔ ان منازل کے بارے میں میں نے کہا:\n\n> منازل الكون في الوجود *** منازل كلها رموز\n> *ترجمہ:* کائنات کی منازل ہستی (الوجود) میں / وہ منازل ہیں جو سب کی سب رموز ہیں\n> منازل للعقول فيها *** دلائل كلها تجوز\n> *ترجمہ:* وہ منازل جن میں عقلوں کے لیے / تمام دلائل مجاز ہیں\n> لما أتى الطالبون قصدا *** لنيل شي‏ء فذاك جوزوا\n> *ترجمہ:* جب طلبگار کسی چیز کے حصول کے ارادے سے آئے / تو انہیں اسی کی اجازت دی گئی\n> فيا عبيد الكيان حوزوا *** هذا الذي ساقكم وجوزوا\n> *ترجمہ:* اے کیان (ہستی) کے بندو! اس چیز کو حاصل کر لو / جو تمہیں کھینچ لائی ہے اور ہم سے دور ہو جاؤ\n\nرمز (رمز) اور لغز (معمہ) وہ کلام ہے جس کا ظاہر وہ معنی دے جو کہنے والے کا مقصود نہ ہو۔ اسی طرح وجود (الوجود) میں عالم کی منزل وہ نہیں ہے جسے اللہ نے اس کی اپنی ذات کے لیے پیدا کیا، بلکہ اللہ نے اسے اپنے لیے پیدا کیا۔ پس عالم اس چیز میں مشغول ہو گیا جس کے لیے وہ پیدا نہیں کیا گیا تھا، اور اس طرح اپنے موجد کے مقصد کی مخالفت کی۔ اسی لیے عارف علماء کی ایک جماعت کہتی ہے، اور وہ ان سے بہتر حال میں ہیں جو ان سے کم ہیں، کہ اللہ نے ہمیں ہمارے لیے پیدا کیا ہے۔ لیکن محقق اور بندہ یہ نہیں کہتا، بلکہ وہ کہتا ہے کہ ہمیں اس کے لیے پیدا کیا گیا ہے، نہ کہ اس کی ہماری طرف حاجت کی وجہ سے۔ پس ہم اپنے رب کا معمہ اور رمز ہیں۔ اور جو شخص معموں کے اشعار کو جانتا ہے وہ ہماری مراد کو جانتا ہے۔ جہاں تک ان کے قول \"جب طلبگار کسی چیز کے حصول کے ارادے سے آئے تو انہیں اسی کی اجازت دی گئی\" کا تعلق ہے، یہ مجازات میں سے ہے۔ وہ کہتے ہیں کہ جو شخص اللہ کو کسی مقصد کے لیے طلب کرتا ہے، تو وہ اسی چیز کے لیے ہے جسے اس نے طلب کیا، اور اسے اس کے سوا کچھ حاصل نہیں ہوتا۔ اور ان کا قول \"اے کیان کے بندو\" کا مطلب ہے کہ جو شخص اللہ کی عبادت کسی چیز کے لیے کرتا ہے، تو وہ چیز ہی اس کا معبود اور رب ہے، اور اللہ اس سے بری ہے، اور وہ اسی چیز کے لیے ہے جس کی اس نے عبادت کی۔ اور ان کا قول \"حوزوا\" (حاصل کر لو) یعنی وہ لے لو جس کے لیے تم آئے ہو، یعنی جس کی وجہ سے تم آئے ہو، اور \"جوزوا\" (دور ہو جاؤ) یعنی ہم سے چلے جاؤ، کیونکہ تم ہمارے لیے یا ہماری وجہ سے نہیں آئے۔\n\n(منزل الدعاء)\n\nیہ منزل کئی منازل پر مشتمل ہے، جن میں منزل الأنس بالشبيه (مشابہت سے انس کی منزل)، منزل التغذي (غذا کی منزل)، منزل مكة والطائف والحجب (مکہ، طائف اور پردوں کی منزل)، منزل المقاصير والابتلاء (مقاصیر اور آزمائش کی منزل)، منزل الجمع والتفرقة والمنع (جمع، تفرقہ اور منع کی منزل)، اور منزل النواشي والتقديس (نواشی اور تقدیس کی منزل)۔ اس منزل میں میں نے کہا:\n\n> لتايه الرحمن فيك منازل *** فأجب نداء الحق طوعا يا فل‏\n> *ترجمہ:* رحمن کے حیران ہونے والے کے لیے تجھ میں منازل ہیں / پس ذات حق (الحق) کی پکار کا خوشی سے جواب دے، اے فلاں!\n> رفعت إليك المرسلات أكفها *** ترجو النوال فلا يخيب السائل‏\n> *ترجمہ:* مرسلات نے تیری طرف اپنے ہاتھ اٹھائے / عطا کی امید میں، پس سوال کرنے والا محروم نہیں ہوتا\n> أنت الذي قال الدليل بفضله *** ولنا عليه شواهد ودلائل‏\n> *ترجمہ:* تو وہ ہے جس کی فضیلت کے بارے میں دلیل نے کہا / اور ہمارے پاس اس پر شواہد اور دلائل ہیں\n> لو لا اختصاصك بالحقيقة ما زهت *** بنزولك الأعلى لديه منازل‏\n> *ترجمہ:* اگر تجھے حقیقت (الحقيقة) کے ساتھ اختصاص نہ ہوتا تو / تیرے اعلیٰ نزول سے اس کے پاس منازل نہ چمکتیں\n\nوہ کہتے ہیں کہ ذات حق (الحق) کا اپنے بندوں کو پکارنا دراصل مرسلات (بھیجی گئی چیزوں) کی زبان ہے جو اس کے اسماء میں سے ایک اسم کو طلب کرتی ہیں۔ اور وہ بندہ اس وقت ان کے تسلط کے تحت ہوتا ہے۔ اور مرسلات خلق کے لطائف ہیں جو اپنے ہاتھ ان اسماء کی طرف اٹھاتی ہیں جن کے ہاتھ میں وہ ہیں، تاکہ وہ اسے اس اسم پر عطا کریں جو اسے طلب کرتا ہے۔ اور مسئول ہمیشہ وہی ہوتا ہے جسے اسماء پر مہیمنیت (غلبہ) حاصل ہو، جیسے علیم (جاننے والا) جسے خبیر، حسیب، محصی اور مفضل پر تقدم حاصل ہے۔ اسی لیے انہوں نے کہا: \"تو وہ ہے جس کی فضیلت کے بارے میں دلیل نے کہا\"۔ اور وہ حقیقت (الحقيقة) جس کے ساتھ اسے اختصاص حاصل ہے، وہ الٰہی اسماء میں سے اس کے نیچے کے رتبے میں موجود چیزوں کا احاطہ ہے۔ کیونکہ قادر رتبے میں مرید سے کم ہے، اور عالم رتبے میں مرید سے اوپر ہے، اور حی (زندہ) سب سے اوپر ہے۔ پس وہ منازل جو اسم جامع کے احاطے میں ہیں، اس کے نزول پر فخر کرتی ہیں جو ان کے سوال کا جواب ہے۔\n\n(منزل الأفعال)\n\nیہ کئی منازل پر مشتمل ہے، جن میں منزل الفضل والإلهام (فضل اور الہام کی منزل)، منزل الإسراء الروحاني (روحانی اسراء کی منزل)، منزل التلطف (لطف کی منزل)، اور منزل الهلاك (ہلاکت کی منزل)۔ ان منازل کے بارے میں میں کہتا ہوں:\n\n> لمنازل الأفعال برق لامع *** ورياحها تزجي السحاب زعازع‏\n> *ترجمہ:* افعال کی منازل کے لیے ایک چمکتی ہوئی بجلی ہے / اور اس کی ہوائیں بادلوں کو شدت سے ہانکتی ہیں\n> وسهامها في العالمين نوافذ *** وسيوفها في الكائنات قواطع‏\n> *ترجمہ:* اور اس کے تیر تمام جہانوں میں نافذ ہیں / اور اس کی تلواریں کائنات میں کاٹنے والی ہیں\n> ألقت إلى العز المحقق أمرها *** فالعين تبصر والتناول شاسع‏\n> *ترجمہ:* اس نے اپنے امر کو عزت محقق کی طرف ڈال دیا / پس آنکھ دیکھتی ہے اور حصول دور ہے\n\nبندوں کے افعال کے بارے میں لوگ دو قسموں پر ہیں: ایک گروہ افعال کو بندوں کی طرف سے دیکھتا ہے، اور دوسرا گروہ افعال کو اللہ کی طرف سے دیکھتا ہے۔ اور ہر گروہ کو اپنے اس اعتقاد کے ساتھ ایک چمکتی ہوئی بجلی کی طرح شبہ ظاہر ہوتا ہے جو اسے ایک لمحے کے لیے اس فعل کی نسبت اس کی طرف کرنے پر مجبور کرتا ہے جس سے اس نے اس فعل کی نفی کی تھی۔ اور ہر گروہ کے پاس ایک بادل ہے جو اس کے اور اس فعل کی نسبت اس کی طرف کرنے کے درمیان حائل ہوتا ہے جس سے اس نے اس کی نفی کی تھی۔ اور ان کا قول \"اس کی ہوائیں شدید ہیں\" یعنی وہ اسباب اور دلائل جو ہر گروہ کے لیے افعال کی نسبت اس کی طرف کرنے پر قائم ہوئے ہیں جس کی طرف انہوں نے نسبت دی ہے، اس کے نزدیک قوی ہیں۔ اور اس کے تیروں کو جہانوں میں نافذ ہونے سے موصوف کیا گیا ہے جو اس کا اعتقاد رکھتے ہیں، اور اسی طرح اس کی تلواریں ان میں کاٹنے والی ہیں۔ اور ان کا قول کہ \"اس نے اپنے امر کو عزت کی طرف ڈال دیا\" یعنی اس نے ایک روکنے والے کی پناہ میں پناہ لی جو مخالف کو اس پر اثر انداز ہونے سے روکتا ہے، تاکہ ہر کوئی اسی پر قائم رہے جو اللہ کا اس میں ارادہ ہے۔ اللہ تعالیٰ نے فرمایا: زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمْ (ہم نے ہر امت کے لیے ان کے عمل کو مزین کر دیا)۔ اور ان کا قول \"فالعين تبصر\" (پس آنکھ دیکھتی ہے) یعنی حس گواہی دیتی ہے کہ فعل بندے کا ہے، اور انسان اپنے اندر سے اسے پاتا ہے کیونکہ اس میں اسے اختیار حاصل ہے۔ اور ان کا قول \"التناول شاسع\" (حصول دور ہے) یعنی اس کی نسبت اس کے علاوہ کسی اور کی طرف کرنا جو حس اور نفس دیتا ہے، دور از دسترس ہے، مگر اس میں ایک چمکتی ہوئی بجلی کا ہونا ضروری ہے جو اس فعل کی نسبت اس کی طرف کرے جس سے اس نے اس کی نفی کی تھی، اور وہ اس کا انکار نہیں کر سکتا۔\n\n(منزل الابتداء)\n\nیہ کئی منازل پر مشتمل ہے، جن میں منزل الغلظة والسبحات (سختی اور سبحات کی منزل)، منزل التنزلات (تنزلات کی منزل)، اور علم بالتوحيد الإلهي (توحید الٰہی کے علم کی منزل)، منزل الرحموت (رحموت کی منزل)، اور منزل الحق والفزع (ذات حق اور گھبراہٹ کی منزل)۔ اس منزل میں میں کہتا ہوں:\n\n> للابتداء شواهد ودلائل *** وله إذا حط الركاب منازل‏\n> *ترجمہ:* ابتداء کے لیے شواہد اور دلائل ہیں / اور جب سواری ٹھہرے تو اس کے لیے منازل ہیں\n> يحوي على عين الحوادث حكمه *** ويمده الله الكريم الفاعل‏\n> *ترجمہ:* اس کا حکم حوادث کے عین پر حاوی ہے / اور اسے اللہ کریم فاعل مدد دیتا ہے\n> ما بينه نسب وبين إلهه *** إلا التعلق والوجود الحاصل‏\n> *ترجمہ:* اس کے اور اس کے معبود کے درمیان کوئی نسب نہیں / سوائے تعلق اور حاصل شدہ ہستی (الوجود) کے\n> لا تسمعن مقالة من جاهل *** مبني الوجود حقائق وأباطل‏\n> *ترجمہ:* کسی جاہل کی بات مت سنو / کہ ہستی (الوجود) کی بنیاد حقائق اور باطل پر ہے\n> مبني الوجود حقائق مشهودة *** وسوى الوجود هو المحال الباطل‏\n> *ترجمہ:* ہستی (الوجود) کی بنیاد مشہود حقائق ہیں / اور ہستی (الوجود) کے سوا محال اور باطل ہے\n\nوہ کہتے ہیں کہ اکوان (کائنات) کی ابتداء کے لیے اس میں شواہد ہیں کہ وہ خود سے نہیں تھے پھر ہو گئے، اور \"لہ\" (اس کے لیے) کی ضمیر ابتداء کی طرف لوٹتی ہے، \"إذا حط الركاب\" (جب سواری ٹھہرے) یعنی جب تم اس کا پیچھا کرو کہ وہ کہاں سے آیا، تو تم اسے اس کے موجد کے پاس سے پاؤ گے، اور اسی لیے اس کے لیے بقا (البقاء) ہے۔ اللہ تعالیٰ نے فرمایا: وما عِنْدَ الله باقٍ (اور جو کچھ اللہ کے پاس ہے وہ باقی رہنے والا ہے)۔ پس جب تم اس کے پاس ٹھہرو گے تو تم اس کی وہ منزل جان لو گے جو اس کے لیے تھی جب وہ خود سے نہیں تھا، اور وہ الٰہی اولیت کی منزل ہے جیسا کہ اس کے قول \"هو الأول\" (وہ اول ہے) میں ہے۔ اور اسی اولیت سے کون (کائنات) کی ابتداء صادر ہوئی، اور اسی سے تمام حوادث مدد لیتے ہیں، اور وہ ان میں حاکم ہے اور وہ اس کے حکم پر جاری ہیں۔ اور اس سے نسب کی نفی کی گئی ہے، کیونکہ ذات حق (الحق) کی اولیت بندے کی اولیت کو مدد دیتی ہے، اور کون کی اولیت کسی چیز کو مدد نہیں دیتی۔ پس وہاں کوئی نسب نہیں سوائے عنایت کے، اور کوئی سبب نہیں سوائے حکم کے، اور کوئی وقت نہیں سوائے ازل کے۔ یہ قوم کا مذہب ہے۔ اور جو کچھ ان تینوں کے حصر میں داخل نہیں ہوا وہ اندھا پن اور فریب ہے۔ صاحب محاسن المجالس نے اسی طرح صراحت کی ہے۔ اور جس نے کہا کہ ہستی (الوجود) کی بنیاد حقائق اور باطل پر ہے، وہ صحیح نہیں ہے، کیونکہ باطل عدم ہے، اور یہ صحیح ہے کہ مستفاد ہستی (الوجود) عدم کے حکم میں ہے، اور حقیقی ہستی (الوجود) وہ ہے جس کی ہستی (الوجود) اس کی اپنی ذات کے لیے ہو۔ اور ہر وہ عدم جو موجود ہوا، وہ صرف اس ہستی (الوجود) سے موجود ہوا جو کسی دوسرے کے لیے موصوف تھی نہ کہ اس کی اپنی ذات کے لیے۔ اور جس نے استفادہ کیا وہ اپنی ذات کے لیے ہستی (الوجود) ہے۔ اور جہاں تک محال باطل کا تعلق ہے، تو وہ ہے جس کی کوئی ہستی (الوجود) نہیں، نہ اس کی اپنی ذات کے لیے اور نہ کسی دوسرے سے۔\n\n(منزل التنزيه)\n\nیہ منزل کئی منازل پر مشتمل ہے، جن میں منزل الشكر (شکر کی منزل)، منزل البأس (سختی کی منزل)، منزل النشر (پھیلانے کی منزل)، منزل النصر والجمع (مدد اور جمع کی منزل)، اور منزل الربح والخسران والاستحالات (نفع، نقصان اور استحالات کی منزل)۔ اور اس بارے میں ہمارا قول ہے:\n\n> لمنازل التنزيه والتقديس *** سر مقول حكمه معقول‏\n> *ترجمہ:* تنزیہ اور تقدیس کی منازل کے لیے / ایک کہا ہوا راز ہے جس کا حکم معقول ہے\n> علم يعود على المنزه حكمه *** فردوس قدس روضة مطلول‏\n> *ترجمہ:* ایک علم جس کا حکم منزہ پر لوٹتا ہے / فردوس قدس ایک شبنم زدہ باغ ہے\n> فمنزه الحق المبين مجوز *** ما قاله فمرامه تضليل‏\n> *ترجمہ:* پس ذات حق (الحق) مبین کا تنزیہ کرنے والا اجازت دیتا ہے / جو اس نے کہا، پس اس کا مقصد گمراہی ہے\n\nوہ کہتے ہیں کہ حقیقی منزہ وہ ہے جو اپنی ذات کے لیے نزاہت رکھتا ہو، اور تنزیہ صرف اس کی کی جاتی ہے جس پر وہ چیز جائز ہو جس سے اسے منزہ کیا جا رہا ہو، اور وہ مخلوق ہے۔ اسی لیے تنزیہ منزہ پر لوٹتی ہے۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"یہ تمہارے اعمال ہیں جو تم پر لوٹائے جاتے ہیں\"۔\n\nپس جس کا عمل تنزیہ ہو، اس کی تنزیہ اس پر لوٹتی ہے، اور اس کا محل اس اعتقاد سے منزہ ہو جاتا ہے جو ذات حق (الحق) کے لیے مناسب نہیں ہے۔ اور اسی سے اس شخص نے کہا جس نے کہا: \"سبحانی\" (میں پاک ہوں)، جو اللہ تعالیٰ کے جلال کی تعظیم کے لیے تھا۔ اور اسی لیے انہوں نے کہا: \"روضة مطلول\" (شبنم زدہ باغ)، اور یہ تنزیہ کا بندے کے محل کی طرف نزول ہے جو اپنے خالق کی تنزیہ کرتا ہے۔ اور اللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔\n\n(منزل التقريب)\n\nیہ منزل دو منازل پر مشتمل ہے: منزل خرق العوائد (عادات کو توڑنے کی منزل) اور منزل أحدية كن (کن کی احدیت کی منزل)۔ اور اس میں میں نے یہ شعر کہا:\n\n> لمنازل التقريب شرط يعلم *** ولها على ذات الكيان تحكم‏\n> *ترجمہ:* تقریب کی منازل کے لیے ایک شرط ہے جو معلوم ہے / اور ان کا کیان (ہستی) کی ذات پر حکم چلتا ہے\n> فإذا أتى شرط القيامة واستوى *** جبارها خضع الوجود ويخدم‏\n> *ترجمہ:* پس جب قیامت کی شرط آ جائے اور اس کا جبار قائم ہو جائے / تو ہستی (الوجود) جھک جاتی ہے اور خدمت کرتی ہے\n> هيهات لا تجني النفوس ثمارها *** إلا التي فعلت وأنت مجسم‏\n> *ترجمہ:* بہت دور! نفوس اپنے پھل نہیں کاٹتے / سوائے ان کے جنہوں نے عمل کیا، اور تو مجسم ہے\n\nوہ کہتے ہیں کہ تقریب محدثات کی صفات میں سے ہے کیونکہ وہ تقریب اور اس کے برعکس کو قبول کرتی ہیں، اور ذات حق (الحق) قریب ہے، اگرچہ اس نے خود کو یہ وصف دیا ہے کہ وہ تقرب کرتا ہے۔ اور اس کا مصدر التقريب (قریب کرنا) اور التقرب (قریب ہونا) ہے۔ اور جب انہوں نے کہا \"شرط يعلم\" (ایک شرط جو معلوم ہے) اور وہ تاثیر کا قبول کرنا ہے، تو انہوں نے کہا کہ یہ معاملہ عموماً صرف آخرت میں ہی معلوم اور منکشف ہو گا۔ اور انہوں نے کہا کہ نفوس کے لیے کوئی پھل نہیں ہے سوائے اس کے جو انہوں نے اپنی دنیاوی زندگی میں خیر یا شر سے بویا۔ پس ان کے لیے ان کے اعمال سے تقریب ہے۔ فَمَنْ يَعْمَلْ مِثْقالَ ذَرَّةٍ خَيْراً يَرَهُ (پس جو کوئی ذرہ برابر بھی نیکی کرے گا وہ اسے دیکھ لے گا) اور ومن يَعْمَلْ مِثْقالَ ذَرَّةٍ شَرًّا يَرَهُ (اور جو کوئی ذرہ برابر بھی برائی کرے گا وہ اسے دیکھ لے گا)۔\n\n(منزل التوقع)\n\nیہ منزل بھی دو منازل پر مشتمل ہے: منزل الطريق الإلهي (الٰہی راستہ کی منزل) اور منزل السمع (سننے کی منزل)۔ اور اس میں میں نے نظم کیا:\n\n> ظهرت منازل للتوقع بادية *** وقطوفها ليد المقرب دانية\n> *ترجمہ:* توقع کی منازل ظاہر ہو گئیں / اور ان کے پھل مقرب کے ہاتھ کے لیے قریب ہیں\n> فاقطف من أغصان الدنو ثمارها *** لا تقطفن من الغصون العادية\n> *ترجمہ:* پس قربت کی شاخوں سے ان کے پھل توڑ لو / اور عام شاخوں سے مت توڑنا\n> لا تخرجن عن اعتدالك والزمن *** وسط الطريق تر الحقائق بادية\n> *ترجمہ:* اپنے اعتدال سے باہر مت نکلنا اور لازم پکڑو / راستے کے وسط کو، تم حقائق کو ظاہر دیکھو گے\n\nوہ کہتے ہیں کہ جو کچھ انسان توقع کرتا ہے وہ ظاہر ہو چکا ہے، کیونکہ وہ کسی چیز کی توقع نہیں کرتا مگر یہ کہ اس کے باطن میں اس کا ظہور ہوتا ہے۔ پس وہ اس غیب سے جو اس کا مستحق ہے، اس کے باطن میں ظاہر ہو چکا ہے جو اس کی توقع کرتا ہے۔ پھر وہ عالم شہادت میں اس کے ظہور کی توقع کرتا ہے، تاکہ وہ حصول میں زیادہ قریب ہو، اور یہی ان کا قول ہے: قُطُوفُها دانِيَةٌ (اس کے پھل قریب ہیں) یعنی توڑنے والے کے ہاتھ کے لیے قریب ہیں۔ وہ کہتے ہیں کہ اعتدال کے راستے کو محفوظ رکھو، اس سے منحرف نہ ہو، اور یہاں اعتدال یہ ہے کہ تم اپنی حقیقت کو لازم پکڑو، اس سے باہر نہ نکلو جیسا کہ متکبرین نکلے۔ اور جو شخص دونوں کناروں کے درمیان برزخ ہو، اسے ان دونوں پر جھانکنے کا موقع ملتا ہے، لیکن اگر وہ ایک کی طرف مائل ہو جائے تو دوسرے سے غائب ہو جاتا ہے۔\n\n(منزل البركات)\n\nیہ بھی دو منازل پر مشتمل ہے: منزل الجمع والتفرقة (جمع اور تفرقہ کی منزل) اور منزل الخصام البرزخى (برزخی جھگڑے کی منزل)، اور یہ منزل الملك والقهر (بادشاہت اور قہر کی منزل) ہے۔ اور اس میں میں نے کہا:\n\n> لمنازل البركات نور يسطع *** وله بحبات القلوب توقع‏\n> *ترجمہ:* برکات کی منازل کے لیے ایک نور چمکتا ہے / اور دلوں کے دانوں میں اس کی توقع ہے\n> فيها المزيد لكل طالب مشهد *** ولها إلى نفس الوجود تطلع‏\n> *ترجمہ:* اس میں ہر مشاہدہ طلب کرنے والے کے لیے زیادتی ہے / اور اسے ہستی (الوجود) کے نفس کی طرف جھکاؤ ہے\n> فإذا تحقق سر طالب حكمة *** بحقائق البركات شد المطلع‏\n> *ترجمہ:* پس جب حکمت کے طالب کا راز / برکات کی حقیقتوں سے متحقق ہو جائے تو وہ مطلع کو مضبوط کر لیتا ہے\n> فالحمد لله الذي في كونه *** أعيانه مشهودة تتسمع‏\n> *ترجمہ:* پس تمام تعریفیں اللہ کے لیے ہیں جس کی کائنات میں / اس کی اعیان مشہود ہیں جو سنی جاتی ہیں\n\nبرکات زیادتی ہے، اور یہ شکر کے نتائج میں سے ہے۔ اور ذات حق (الحق) نے خود کو الشاکر اور الشکور کے نام سے موسوم نہیں کیا مگر اس لیے کہ ہم اس عمل میں اضافہ کریں جو ہمارے لیے مشروع کیا گیا ہے کہ ہم اسے کریں، جیسا کہ ذات حق (الحق) ہمارے شکر سے نعمتوں میں اضافہ کرتا ہے۔ پس ہر نفس زیادتی کی طرف مائل ہے۔ وہ کہتے ہیں کہ جب حکمت کا طالب زیادتی سے متحقق ہو جاتا ہے تو وہ ایسے امور میں منفرد ہو جاتا ہے جن میں وہ کوشش کرتا ہے کہ کوئی دوسرا اس میں شریک نہ ہو، تاکہ اس نوع کی زیادتی حاصل ہو۔ اور اس مقام کے صاحب کا حال اس حال کی نگرانی کرنا ہوتا ہے جسے وہ طلب کرتا ہے۔\n\n(منزل الأقسام والإيلاء)\n\nیہ منزل کئی منازل پر مشتمل ہے، جن میں منزل الفهوانيات الرحمانية (رحمانی فہوانیات کی منزل)، منزل المقاسم الروحانية (روحانی حصوں کی منزل)، منزل الرقوم (نقوش کی منزل)، منزل مساقط النور (نور کے گرنے کی منزل)، منزل الشعراء (شاعروں کی منزل)، منزل المراتب الروحانية (روحانی مراتب کی منزل)، منزل النفس الكلية (نفس کلیہ کی منزل)، منزل القطب (قطب کی منزل)، منزل انفهاق الأنوار على عالم الغيب (عالم غیب پر انوار کے پھٹنے کی منزل)، منزل مراتب النفس الناطقة (نفس ناطقہ کے مراتب کی منزل)، منزل اختلاف الطرق (راستوں کے اختلاف کی منزل)، منزل المودة (محبت کی منزل)، منزل علوم الإلهام (الہام کے علوم کی منزل)، منزل النفوس الحيوانية (حیوانی نفوس کی منزل)، اور منزل الصلاة الوسطى (صلاۃ وسطیٰ کی منزل)۔ اور اس میں میں نے کہا:\n\n> منازل الأقسام في العرض *** أحكامها في عالم الأرض‏\n> *ترجمہ:* قسموں کی منازل عرض میں ہیں / ان کے احکام عالم ارض میں ہیں\n> تجري بأفلاك السعود على *** من قام بالسنة والفرض‏\n> *ترجمہ:* وہ سعد افلاک کے ساتھ جاری ہوتی ہیں / اس پر جو سنت اور فرض پر قائم ہو\n> وعلمها وقف على عينها *** وحكمها في الطول والعرض‏\n> *ترجمہ:* اور اس کا علم اس کے عین پر موقوف ہے / اور اس کا حکم طول اور عرض میں ہے\n\nوہ کہتے ہیں کہ قسم تہمت کا نتیجہ ہے، اور ذات حق (الحق) مخلوق کے ساتھ اس حیثیت سے معاملہ کرتا ہے جس پر وہ ہیں، نہ کہ اس حیثیت سے جس پر وہ خود ہے۔ اسی لیے ذات حق (الحق) نے فرشتوں کی قسم نہیں کھائی، کیونکہ وہ عالم تہمت سے نہیں ہیں۔ اور کسی مخلوق کے لیے جائز نہیں کہ وہ کسی مخلوق کی قسم کھائے، اور یہ ہمارا مذہب ہے۔ اور اگر وہ کسی مخلوق کی قسم کھائے تو ہمارے نزدیک وہ گنہگار ہے، اور اگر وہ قسم توڑ دے تو اس پر کوئی کفارہ نہیں ہے، صرف اس پر توبہ لازم ہے جو اس سے سرزد ہوا۔ اور ذات حق (الحق) نے صرف اپنی قسم کھائی جب اس نے مخلوقات کا ذکر کر کے قسم کھائی، اور اسم کا حذف اس پر دلالت کرتا ہے، جیسا کہ کتاب عزیز میں بعض مقامات پر اسم کا اظہار ہے، جیسے اس کا قول: فَوَ رَبِّ السَّماءِ والْأَرْضِ (پس آسمان اور زمین کے رب کی قسم) ... بِرَبِّ الْمَشارِقِ والْمَغارِبِ (مشرقوں اور مغربوں کے رب کی قسم)۔ پس یہ ان مقامات پر نشانیاں تھیں جہاں اسم کا ذکر ظاہر نہیں ہوا کہ وہاں وہ غائب تھا، کسی ایسے امر کی وجہ سے جو اس نے وہاں ارادہ کیا تھا، جسے وہ شخص جانتا ہے جسے ذات حق (الحق) نے اس کی معرفت کرائی ہو، خواہ وہ نبی ہو یا ولی ملہم۔ کیونکہ قسم مقسم بہ کی تعظیم کی دلیل ہے۔ اور اس میں کوئی شک نہیں کہ قسم میں اس کا ذکر کیا گیا ہے جو دیکھتا ہے اور جو نہیں دیکھتا، پس اس میں بلند اور پست، جس سے راضی ہوا گیا اور جس پر غضب کیا گیا، محبوب اور ناپسندیدہ، مومن اور کافر، موجود اور معدوم سب شامل ہو گئے۔ اور منازل الأقسام کو صرف وہی جانتا ہے جو عالم غیب کو جانتا ہو، پس غالب گمان یہ ہے کہ الٰہی اسم یہاں مضمر ہے۔ اور ہم نے تمہیں بتا دیا ہے کہ عالم غیب طول ہے اور عالم شہادت عرض ہے۔\n\n(منزل الإنية)\n\nیہ کئی منازل پر مشتمل ہے، جن میں منزل سلیمان علیہ السلام کی، دیگر انبیاء کے سوا، اور منزل الستر الكامل (کامل پردہ پوشی کی منزل)، منزل اختلاف المخلوقات (مخلوقات کے اختلاف کی منزل)، منزل الروح (روح کی منزل)، اور منزل العلوم (علوم کی منزل)۔ اور اس میں میں کہتا ہوں:\n\n> إنية قدسية مشهودة *** لوجودها عند الرجال منازل‏\n> *ترجمہ:* ایک قدسی انیت (الإنية) ہے جو مشہود ہے / اس کی ہستی (الوجود) کے لیے مردوں کے پاس منازل ہیں\n> تفني الكيان إذا تجلت صورة *** في سورة أعلامها تتفاضل‏\n> *ترجمہ:* وہ کیان (ہستی) کو فنا کر دیتی ہے جب ایک صورت میں ظہور (التجلی) کرتی ہے / ایسی صورت میں جس کے نشانات میں تفاضل ہے\n> وتريك فيك وجودها بنعوتها *** خلف الظلال وجودها لك شامل‏\n> *ترجمہ:* اور وہ تجھے تجھ میں اپنی ہستی (الوجود) کو اپنی صفات کے ساتھ دکھاتی ہے / سایوں کے پیچھے، اس کی ہستی (الوجود) تجھ پر محیط ہے\n\nوہ کہتے ہیں کہ معنوی الٰہی حقیقت (الحقيقة) تنزیہ کی صفات کے ساتھ جب مشاہدہ کی جاتی ہے تو وہ اپنے سوا ہر عین کو فنا کر دیتی ہے، اگرچہ اس کے مشاہدات ایک ہی شخص میں اس کے احوال کے مطابق اور مختلف اشخاص میں ان کے احوال کے اختلاف کی وجہ سے مختلف ہوں۔ کیونکہ حقیقت (الحقيقة) نے یہ عطا کیا ہے کہ ہم میں سے شاہد صرف اپنے آپ کو دیکھتا ہے، جیسا کہ وہ ہم میں سے صرف اپنے آپ کو دیکھتی ہے۔ پس ہر حقیقت دوسری کے لیے آئینہ ہے۔ \"مومن اپنے بھائی کا آئینہ ہے\"۔ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ (اس کی مثال کوئی چیز نہیں)۔\n\n(منزل الدهور)\n\nیہ منزل کئی منازل پر مشتمل ہے، جن میں منزل السابقة (سبقت کی منزل)، منزل العزة (عزت کی منزل)، منزل روحانيات الأفلاك (افلاک کی روحانیات کی منزل)، منزل الأمر الإلهي (الٰہی امر کی منزل)، منزل الولادة (پیدائش کی منزل)، منزل الموازنة (موازنہ کی منزل)، اور منزل البشارة باللقاء (ملاقات کی خوشخبری کی منزل)۔ اور اس میں میں کہتا ہوں:\n\n> ومن المنازل ما يكون مقدرة *** مثل الزمان فإنه متوهم‏\n> *ترجمہ:* اور منازل میں سے وہ ہیں جو مقدر ہوتی ہیں / جیسے زمانہ، کیونکہ وہ متوہم ہے\n> دلت عليه الدائرات بدورها *** وله التصرف والمقام الأعظم‏\n> *ترجمہ:* گردش کرنے والی چیزوں نے اپنے چکروں سے اس پر دلالت کی / اور اس کے لیے تصرف اور مقام اعظم ہے\n\nوہ کہتے ہیں کہ جب ازل ذات حق (الحق) کے حق میں ایک متوہم امر تھا، تو زمانہ بھی ذات حق (الحق) کے حق میں ایک متوہم امر ہے، یعنی ایک متوہم مدت جسے افلاک کی حرکات طے کرتی ہیں۔ پس ازل مخلوق کے لیے زمانے کی طرح ہے، پس سمجھو۔\n\n(منزل لام الألف)\n\nیہ الالتفاف (لپٹنے) کی منزل ہے، اور اس پر ائتلاف (میل جول) غالب ہے نہ کہ اختلاف۔ اللہ تعالیٰ نے فرمایا: والْتَفَّتِ السَّاقُ بِالسَّاقِ إِلى‏ رَبِّكَ يَوْمَئِذٍ الْمَساقُ (اور پنڈلی پنڈلی سے لپٹ جائے گی، اس دن تیرے رب کی طرف ہانکا جانا ہے)۔ اور یہ کئی منازل پر مشتمل ہے، جن میں منزل مجمع البحرين (دو سمندروں کے ملنے کی منزل) اور جمع الأمرين (دو امور کو جمع کرنے کی منزل)، اور منزل التشريف المحمدي (محمدی شرف کی منزل) جو المنزل الصمدي (صمدی منزل) کے پہلو میں ہے، اور اس میں میں کہتا ہوں:\n\n> منازل اللام في التحقيق والألف *** عند اللقاء انفصال حال وصلهما\n> *ترجمہ:* لام اور الف کی منازل تحقیق میں / ملاقات کے وقت ان کے وصل کی حالت کا انفصال ہے\n> هما الدليل أعلى من قال إن أنا *** سر الوجود وإني عينه فهما\n> *ترجمہ:* وہ دونوں اس شخص کی اعلیٰ دلیل ہیں جس نے کہا کہ میں / ہستی (الوجود) کا راز ہوں اور میں اس کی عین ہوں، پس وہ دونوں ہیں\n> نعم الدليلان إذ دلا بحالهما *** لا كالذي دل بالأقوال فانصرما\n> *ترجمہ:* وہ دونوں بہترین دلیل ہیں جب انہوں نے اپنے حال سے دلالت کی / نہ کہ اس کی طرح جس نے اقوال سے دلالت کی اور ختم ہو گیا\n\nوہ کہتے ہیں کہ اگرچہ لام الف سے جڑ گیا اور ایک عین بن گیا، اور یہ حروف کے مزدوج میں ظاہر ہے جو واؤ اور یاء کے درمیان اٹھائیسویں مقام پر ہیں جن کے لیے صحت اور اعتلال ہے، پس الف میں جو علت ہے اور لام میں جو صحت ہے، اس کی وجہ سے ان دونوں حروف کے درمیان مناسبت واقع ہوئی، پس صحیح کے بعد صحت کا حرف آتا ہے اور معتل کے بعد علت کا حرف آتا ہے۔ پس اس کے دونوں ہاتھ رحمت کے ساتھ پھیلے ہوئے ہیں اور اس کے برعکس کے ساتھ بند ہیں۔ اور لام الف کی مفرد نظم میں کوئی صورت نہیں ہے، بلکہ وہ اس میں غیب ہے اور اپنے حال پر ایک رتبہ ہے جو واؤ اور یاء کے درمیان ہے۔ اور اس کی جگہ پر زاء، حاء، اور طاء یابس نے نیابت کی ہے، پس اس کے لیے اس کے غیب میں ساتواں، آٹھواں اور نواں رتبہ ہے۔ پس اس کے لیے بدر اور ہلال کے درمیان قمر کی منزل ہے۔ پس برزخیت کا رتبہ اس کے غیبت اور ظہور میں ہمیشہ اس کے ساتھ رہتا ہے۔ پس وہ چوبیسواں ہے، کیونکہ اس کے لیے زاء کے ساتھ سات، حاء کے ساتھ آٹھ، اور طاء کے ساتھ نو تھے، اور دن چوبیس گھنٹے کا ہوتا ہے۔ پس تم جس گھڑی میں بھی اس کے ساتھ عمل کرو گے، تمہارا عمل وضع کے میزان پر کامیاب ہو گا، کیونکہ وہ رقم کے حروف میں ہے نہ کہ طبع کے حروف میں، کیونکہ طبع کے حروف میں اس کے لیے صرف لام ہے، اور وہ زبان کے حروف میں سے ہے جو حلق اور ہونٹوں کے درمیان برزخ ہے۔ اور الف طبع کے حروف میں سے نہیں ہے، پس اس نے صرف ایک حرف کی نیابت کی ہے، اور وہ لام ہے جس سے الف پیدا ہوتا ہے جب اس کی حرکت کو اشباع کیا جائے، اور اگر اشباع نہ کیا جائے تو ہمزہ ظاہر ہوتا ہے۔ اسی لیے بعض علماء نے الف کو نصف حرف اور ہمزہ کو نصف حرف قرار دیا ہے، وضعی رقم میں نہ کہ طبعی لفظ میں۔ پھر ہم واپس آتے ہیں اور کہتے ہیں کہ اگر لام الف سے جڑ گیا جیسا کہ ہم نے کہا اور ایک عین بن گیا، تو اس کی دونوں رانیں اس بات پر دلالت کرتی ہیں کہ وہ دو ہیں، پھر اس کے نام سے تعبیر کرنا اس بات پر دلالت کرتا ہے کہ وہ دو ہیں۔ پس یہ دو ناموں سے مرکب ایک نام ہے جو دو عینوں کے لیے ہے، ایک عین لام ہے اور دوسری الف، لیکن جب وہ شکل میں ایک ہی صورت پر ظاہر ہوئے تو دیکھنے والے نے ان میں فرق نہیں کیا اور نہ ہی اس کے لیے یہ تمیز ہوئی کہ کون سی ران لام ہے تاکہ دوسری الف ہو، پس لکھنے والوں نے اس میں اختلاف کیا، پس ان میں سے بعض نے تلفظ کا خیال رکھا اور بعض نے اس کا خیال رکھا جس سے اس کا خاکہ شروع ہوتا ہے، پس اسے پہلے رکھا۔ پس لام کو الف پر مقدم کرنے پر اتفاق ہوا، کیونکہ الف یہاں لام سے بلا شک پیدا ہوا ہے۔ اور اسی طرح ہمزہ لام کے بعد آتا ہے، جیسے اس کے قول لَأَنْتُمْ أَشَدُّ رَهْبَةً (تم زیادہ خوفناک ہو) اور اس کی مثالیں۔ اور یہ حرف، یعنی لام الف، افعال میں التباس کا حرف ہے۔ پس مخلوق کے ہاتھ پر ظاہر ہونے والا فعل اس کے لیے خالص نہیں ہوا، اگر تم کہو کہ وہ اللہ کے لیے ہے تو تم نے سچ کہا، اور اگر تم کہو کہ وہ مخلوق کے لیے ہے تو تم نے سچ کہا۔ اور اگر ایسا نہ ہوتا تو تکلیف صحیح نہ ہوتی اور اللہ کی طرف سے بندے کے لیے عمل کی نسبت صحیح نہ ہوتی۔\n\nنبی اکرم صلی اللہ علیہ وسلم نے فرمایا: \"یہ تمہارے اعمال ہیں جو تم پر لوٹائے جاتے ہیں\"۔\n\nاور اللہ فرماتا ہے: وما يَفْعَلُوا من خَيْرٍ فَلَنْ يُكْفَرُوهُ (اور وہ جو بھی نیکی کریں گے، اس کی ناقدری نہیں کی جائے گی) اور اعْمَلُوا ما شِئْتُمْ إِنَّهُ بِما تَعْمَلُونَ بَصِيرٌ (جو چاہو کرو، بے شک وہ تمہارے اعمال کو دیکھنے والا ہے)۔ اور اللہ يَقُولُ الْحَقَّ (اور اللہ حق کہتا ہے)۔ پس اسی طرح تم جس ران کو بھی لام یا الف بناؤ گے، تم نے سچ کہا، اگرچہ اس کے علماء کے نزدیک شکل کی وضع میں عمل مختلف ہو، صورت کے ساتھ تحقق کے لیے۔ اور جس نے بھی یہ دلالت کی کہ فعل دونوں رانوں میں سے صرف ایک کے لیے ہے، نہ کہ دوسرے کے لیے، تو وہ صحیح نہیں ہے، اور اس کا صاحب منقطع ہو جاتا ہے اور ثابت نہیں رہتا۔ اور اس شان کے دوسرے لوگ اس کی مخالفت کرتے ہیں اور اپنے گمان میں دلالت کرتے ہیں، اور ان کا قول ان کے مخالف کے قول کی طرح ہے، اور معاملہ متضاد اور مشکل ہو جاتا ہے، سوائے اس کے جس کی بصیرت کو اللہ نے منور کیا اور اسے سیدھے راستے کی ہدایت دی۔\n\n(منزل التقرير)\n\nیہ کئی منازل پر مشتمل ہے، جن میں منزل تعداد النعم (نعمتوں کی گنتی کی منزل)، منزل رفع الضرر (نقصان کو دور کرنے کی منزل)، اور منزل الشرك المطلق (شرک مطلق کی منزل)۔ اور اس میں میں کہتا ہوں:\n\n> تقررت المنازل بالسكون *** ورجحت الظهور على الكمون‏\n> *ترجمہ:* منازل سکون سے مقرر ہو گئیں / اور ظہور کو کمون (پوشیدگی) پر ترجیح دی\n> ودلت بالعيان على عيون *** مفجرة من الماء المعين‏\n> *ترجمہ:* اور اس نے عیاں طور پر چشموں پر دلالت کی / جو جاری پانی سے پھوٹ رہے ہیں\n> ودلت بالبروق سحاب مزن *** إذا لمعت على النور المبين‏\n> *ترجمہ:* اور اس نے بادلوں کی بجلیوں سے دلالت کی / جب وہ نور مبین پر چمکیں\n\nجان لو، اللہ تمہاری مدد کرے، کہ وہ کہتے ہیں کہ ثبوت منازل کو مقرر کرتا ہے۔ پس جو ثابت ہو گیا اور ہر عین پر اپنی حقیقت کے ساتھ ظاہر ہو گیا، کیا تم نہیں دیکھتے کہ حرکت کی تیزی تمہیں کیا شبہ دیتی ہے، پس دیکھنے والا چیز پر اس کے برعکس حکم لگاتا ہے جو وہ چیز ہوتی ہے۔ پس وہ انگارے یا بتی کے سرے میں موجود آگ کے بارے میں کہتا ہے کہ جب وہ اسے عرضاً تیزی سے حرکت دیتا ہے تو وہ ایک لمبی لکیر ہے، یا اسے تیزی سے گھماتا ہے تو وہ ہوا میں آگ کا ایک دائرہ دیکھتا ہے۔ اور اس کی وجہ ثبوت کا نہ ہونا ہے۔ اور جب منازل ثابت ہو جاتی ہیں تو وہ ان علوم الٰہیہ پر دلالت کرتی ہیں جو ان میں شامل ہیں۔\n\n(منزل المشاهدة)\n\nیہ ایک ہی منزل ہے، جو منزل فناء الكون (کائنات کے فنا کی منزل) ہے۔ اس میں وہ فنا ہو جاتا ہے جو نہیں تھا اور وہ باقی رہتا ہے جو ہمیشہ سے ہے۔ اور اس میں میں کہتا ہوں:\n\n> في فناء الكون منزل *** روحه فينا تنزل‏\n> *ترجمہ:* کائنات کے فنا میں ایک منزل ہے / اس کی روح ہم میں نازل ہوتی ہے\n> إنه ليلة قدري *** ما له نور ولا ظل‏\n> *ترجمہ:* بے شک وہ میری شب قدر ہے / جس کا نہ کوئی نور ہے اور نہ کوئی سایہ\n> هو عين النور صرفا *** ما له عنه تنقل‏\n> *ترجمہ:* وہ خالص نور کی عین ہے / اس سے اس کا کوئی انتقال نہیں\n> فأنا الإمام حقا *** ملك في الصدر الأول‏\n> *ترجمہ:* پس میں یقیناً امام ہوں / پہلے صدر میں بادشاہ\n> عنده مفتاح أمري *** فيوليكم ويعزل‏\n> *ترجمہ:* اس کے پاس میرے امر کی کنجی ہے / پس وہ تمہیں والی بناتا ہے اور معزول کرتا ہے\n> سمهرياتي طوال *** لست بالسماك الأعزل‏\n> *ترجمہ:* میری سمهریات (نیزے) لمبے ہیں / میں سماک اعزل (ایک ستارہ) نہیں ہوں\n> فالمقام الحق فيكم *** دائم لا يتبدل‏\n> *ترجمہ:* پس ذات حق (الحق) کا مقام تم میں / دائمی ہے جو بدلتا نہیں\n> وهو القاهر منه *** وهو الإمام الأعدل‏\n> *ترجمہ:* اور وہ اس سے قاہر ہے / اور وہ امام عادل ہے\n> ليس بالنور الممثل *** بل من المهاة أكمل‏\n> *ترجمہ:* وہ نور ممثل نہیں ہے / بلکہ مہاۃ (چاندنی) سے زیادہ کامل ہے\n> وأنا منه يقينا *** بمكان السر الأفضل‏\n> *ترجمہ:* اور میں یقیناً اس سے ہوں / بہترین راز کے مقام پر\n> فبعين العين أسمو *** وبأمر الأمر أنزل‏\n> *ترجمہ:* پس میں عین کی عین سے بلند ہوتا ہوں / اور امر کے امر سے نازل ہوتا ہوں\n\nوہ کہتے ہیں کہ فنا (الفناء) کی حالت نہ نور ہے اور نہ سایہ، جیسے شب قدر۔ پھر انہوں نے کہا کہ وہ حقیقی روشنی اور حقیقی سایہ ہے، کیونکہ وہ اصل ہے جس کی کوئی ضد نہیں، اور انوار کے مقابلے میں ظلمتیں ہوتی ہیں، اور اس کے مقابلے میں کوئی چیز نہیں۔ اور ان کا قول \"أنا الإمام\" (میں امام ہوں) یعنی ذات حق (الحق) کا مشاہدہ (الشہود) اس خاص رخ سے جو اس کی طرف سے میری طرف ہے، اور وہ پہلا صدر ہے۔ اور اسی مقام سے صورتوں میں تفصیل، کثرت اور عدد واقع ہوتا ہے۔ اور انہوں نے سمهریات کو عالم میں قیومیت کی تاثیر سے کنایہ بنایا ہے، اور اس کے لیے ثبوت ہے، اسی لیے انہوں نے کہا کہ وہ بدلتا نہیں، اور اس کے لیے قہر اور عدل ہے جو تشبیہ کو قبول نہیں کرتا۔ پس میں ذات کے مشاہدہ (الشہود) سے بلند ہوتا ہوں اور الٰہی امر سے عالم میں امام بن کر نازل ہوتا ہوں۔\n\n(منزل الألفة)\n\nیہ ایک ہی منزل ہے، اور اس میں میں کہتا ہوں:\n\n> منازل الألفة مألوفه *** وهي بهذا النعت معروفه‏\n> *ترجمہ:* الفت کی منازل مانوس ہیں / اور وہ اسی صفت سے معروف ہیں\n> فقل لمن عرس فيها أقم *** فإنها بالأمن محفوفه‏\n> *ترجمہ:* پس جو اس میں شادی کرے اسے کہو کہ ٹھہر جا / کیونکہ وہ امن سے گھری ہوئی ہے\n> وهي على الاثنين موقوفه *** وعن عذاب الوتر مصروفه‏\n> *ترجمہ:* اور وہ دو پر موقوف ہے / اور وتر (اکیلا پن) کے عذاب سے دور ہے\n\nیہ شادیوں، خوشی اور مسرت کی منزل ہے۔ اور یہ ان چیزوں میں سے ہے جن کا اللہ نے اپنے نبی محمد صلی اللہ علیہ وسلم پر احسان کیا، پس فرمایا: لَوْ أَنْفَقْتَ ما في الْأَرْضِ جَمِيعاً ما أَلَّفْتَ بَيْنَ قُلُوبِهِمْ (اگر تم زمین کی تمام چیزیں خرچ کر دیتے تو ان کے دلوں کو آپس میں نہ ملا سکتے) یعنی تمہارے خلاف، ولكِنَّ الله أَلَّفَ بَيْنَهُمْ (لیکن اللہ نے ان کے دلوں کو ملا دیا) یعنی تمہاری محبت، تمہاری اطاعت اور تمہاری تصدیق پر۔\n\n(منزل الاستخبار)\n\nیہ کئی منازل پر مشتمل ہے، جن میں منزل المنازعة الروحانية (روحانی جھگڑے کی منزل)، منزل حلية السعداء كيف تظهر على الأشقياء وبالعكس (نیک بختوں کی زینت بدبختوں پر کیسے ظاہر ہوتی ہے اور اس کے برعکس)، اور منزل الكون قبل الإنسان (انسان سے پہلے کائنات کی منزل)۔ اور اس میں میں کہتا ہوں:\n\n> إذا استفهمت عن أحباب قلبي *** أحالوني على استفهام لفظي‏\n> *ترجمہ:* جب میں نے اپنے دل کے محبوبوں کے بارے میں پوچھا / تو انہوں نے مجھے میرے لفظی استفسار کی طرف لوٹا دیا\n> منازلهم بلفظك ليس إلا *** فيا شؤمي لذاك وسوء حظي‏\n> *ترجمہ:* ان کی منازل تیرے لفظ میں ہیں، بس / پس اس پر میری بدبختی اور بدقسمتی ہے\n> وعظت النفس لا تنظر إليهم *** فما التفتت بخاطرها لوعظي‏\n> *ترجمہ:* میں نے نفس کو نصیحت کی کہ ان کی طرف مت دیکھ / تو وہ اپنے خیال میں میری نصیحت کی طرف متوجہ نہیں ہوا\n> لفظتهمو عسى أحظى بكون *** فكانوا عين كوني عين لفظي‏\n> *ترجمہ:* میں نے انہیں لفظوں سے نکال دیا، شاید میں کون (کائنات) سے حصہ پاؤں / تو وہ میری کون (کائنات) کی عین، میرے لفظ کی عین تھے\n> وقال ومن عجب إني أحن إليهمو *** وأسأل عنهم من أرى وهمو معي‏\n> *ترجمہ:* اور اس نے کہا: اور یہ تعجب کی بات ہے کہ میں ان کی طرف مشتاق ہوتا ہوں / اور جنہیں دیکھتا ہوں ان سے ان کے بارے میں پوچھتا ہوں حالانکہ وہ میرے ساتھ ہیں\n> وترصدهم عيني وهم في سوادها *** ويشتاقهم قلبي وهم بين أضلعي‏\n> *ترجمہ:* اور میری آنکھ ان کی نگرانی کرتی ہے حالانکہ وہ اس کی سیاہی میں ہیں / اور میرا دل ان کا مشتاق ہوتا ہے حالانکہ وہ میری پسلیوں کے درمیان ہیں\n\nوہ کہتے ہیں کہ وہ میری زبان پر ہیں جب میں ان کے بارے میں پوچھتا ہوں، اور میری آنکھ کی سیاہی میں ہیں جب میں ان کی طرف دیکھتا ہوں، اور میرے دل میں ہیں جب میں ان کے بارے میں سوچتا ہوں اور ان کا مشتاق ہوتا ہوں۔ پس وہ ہر حال میں میرے ساتھ ہیں جس پر میں ہوتا ہوں، پس وہ میری عین ہیں اور میں ان کی عین نہیں، کیونکہ ان کے پاس مجھ سے وہ نہیں ہے جو میرے پاس ان سے ہے۔\n\n(منزل الوعيد)\n\nیہ ایک ہی منزل ہے جو جور (ظلم) اور کون (کائنات) سے متمسک رہنے پر مشتمل ہے۔ اور اس میں میں نے کہا:\n\n> إن الوعيد لمنزلان هما لمن *** ترك السلوك على الطريق الأقوم‏\n> *ترجمہ:* بے شک وعید دو منازل ہیں، وہ اس کے لیے ہیں / جس نے سیدھے راستے پر سلوک کو چھوڑ دیا\n> فإذا تحقق بالكمال وجوده *** ومشى على حكم العلو الأقدم‏\n> *ترجمہ:* پس جب اس کی ہستی (الوجود) کمال سے متحقق ہو جائے / اور وہ قدیم بلندی کے حکم پر چلے\n> عادا نعيما عنده فنعيمه *** في النار وهي نعيم كل مكرم‏\n> *ترجمہ:* تو وہ دونوں اس کے نزدیک نعمت بن جاتے ہیں، پس اس کی نعمت / آگ میں ہے، اور وہ ہر مکرم کی نعمت ہے\n\nیہ ایک روحانی منزل ہے جو نفوس کا عذاب ہے، اور ایک جسمانی منزل ہے جو محسوس عذاب ہے۔ اور یہ صرف اس کے لیے ہوتا ہے جو اپنے ظاہر اور باطن میں مشروع راستے سے ہٹ جائے۔ پس جب اسے استقامت کی توفیق مل جائے اور اس کے لیے عنایت سبقت لے جائے تو وہ اس سے محفوظ ہو جاتا ہے اور مجاہدہ کی آگ میں مشاہدہ (الشہود) کی جنت سے لطف اندوز ہوتا ہے۔\n\n(منزل الأمر)\n\nیہ کئی منازل پر مشتمل ہے: منزل الأرواح البرزخية (برزخی ارواح کی منزل)، منزل التعليم (تعلیم کی منزل)، منزل السري (پوشیدہ منزل)، منزل السبب (سبب کی منزل)، منزل التمائم (تعویذوں کی منزل)، اور منزل القطب والإمامين (قطب اور دو اماموں کی منزل)۔ اور اس میں ہمارا قول ہے:\n\n> منازل الأمر فهو إنية الذات *** بها تحصل أفراحي ولذاتي‏\n> *ترجمہ:* امر کی منازل، پس وہ ذات کی انیت (الإنية) ہے / اس سے میری خوشیاں اور لذتیں حاصل ہوتی ہیں\n> فليتني قائم فيها مدى عمري *** ولا أزول إلى وقت الملاقاة\n> *ترجمہ:* کاش میں اپنی پوری عمر اس میں قائم رہوں / اور ملاقات کے وقت تک نہ ہٹوں\n> فقرة العين للمختار كان له *** إذا تبرز في صدر المناجاة\n> *ترجمہ:* مختار (نبی اکرم) کے لیے آنکھوں کی ٹھنڈک تھی / جب وہ مناجات کے صدر میں ظاہر ہوئے\n\nالٰہی امر صفت کلام میں سے ہے، اور وہ اولیاء کے لیے شریعت کی طرف سے بند ہے۔ اور حضرۃ الٰہیہ (الحضرة الإلهية) میں کوئی امر تکلیفی نہیں ہے سوائے اس کے جو مشروع ہو۔ پس ولی کے لیے صرف اس کے امر کو سننا باقی رہتا ہے جب وہ انبیاء کو حکم دیتا ہے، پس ولی کے لیے اسے سنتے وقت اس کی ہستی (الوجود) میں ایک جاری لذت ہوتی ہے۔ لیکن اولیاء کے لیے الٰہی مناجات باقی رہتی ہے جس میں کوئی امر نہیں ہوتا، جو کہ سمر (رات کی گفتگو) اور حدیث ہے۔ پس اہل کشف (الکشف) میں سے جس نے بھی کہا کہ اسے اپنی حرکات و سکنات میں الٰہی امر کا حکم دیا گیا ہے جو کسی محمدی شرعی امر تکلیفی کے خلاف ہو، تو اس پر معاملہ مشتبہ ہو گیا ہے، اگرچہ وہ اپنے اس قول میں سچا ہو کہ اس نے سنا ہے۔ اور یہ صرف اس صورت میں ممکن ہے کہ اس کے لیے نبی اکرم صلی اللہ علیہ وسلم کی صورت میں کوئی ظہور (التجلی) الٰہی ظاہر ہوا ہو، پس اس کے نبی نے اسے مخاطب کیا ہو، یا اسے اپنے نبی کے خطاب کو سننے کے مقام پر کھڑا کیا گیا ہو۔ اور یہ اس لیے کہ رسول ذات حق (الحق) کے اس امر کو پہنچانے والا ہے جو اللہ نے اپنے بندوں کو حکم دیا ہے۔ پس یہ ممکن ہے کہ وہ ذات حق (الحق) سے کسی حضرۃ میں وہ امر سنے جو اس کے رسول صلی اللہ علیہ وسلم نے اسے پہلے پہنچایا تھا، پس وہ کہے کہ مجھے ذات حق (الحق) نے حکم دیا ہے، حالانکہ یہ اس کے حق میں صرف یہ تعریف ہے کہ اسے حکم دیا گیا ہے۔ اور یہ سبب محمد صلی اللہ علیہ وسلم کے ساتھ منقطع ہو چکا ہے۔ اور اللہ کی طرف سے مشروع اوامر کے علاوہ، اولیاء کے لیے اس میں راسخ قدم ہے۔ یہ ہم نے انیس اصناف کی منازل کو بیان کر دیا ہے۔ اب ہم ہر منزل کی خاص صفات کا ذکر کرتے ہیں۔\n\n### (وصل) [انیس منازل میں سے ہر منزل کی خاص صفات کا ذکر]\n\nمنزل المدح کی خاص صفات علم کا اس چیز سے تعلق ہے جس کی کوئی انتہا نہیں۔ اور منزل الرموز کی خاص صفات علم کا اعداد اور اسماء کے خواص سے تعلق ہے، اور وہ کلمات اور حروف ہیں، اور اس میں علم سیمیا ہے۔ اور منزل الدعاء کی خاص صفات اشارہ اور تحلیہ کے علوم ہیں۔ اور منزل الأفعال کی خاص صفات علم الآن (اب کا علم) ہے۔ اور منزل الابتداء کی خاص صفات علم المبدأ والمعاد (ابتداء اور معاد کا علم) اور ہر چیز کی اولیات کی معرفت ہے۔ اور منزل التنزيه کی خاص صفات علم السلخ والخلع (کھال اتارنے اور اتارنے کا علم) ہے۔ اور منزل التقريب کی خاص صفات علم الدلالات (دلالتوں کا علم) ہے۔ اور منزل التوقع کی خاص صفات علم النسب والإضافات (نسبتوں اور اضافوں کا علم) ہے۔ اور منزل البركات کی خاص صفات علم الأسباب والشروط والعلل والأدلة والحقيقة (اسباب، شرائط، علتوں، دلائل اور حقیقت کا علم) ہے۔ اور منزل الأقسام کی خاص صفات علوم العظمة (عظمت کے علوم) ہیں۔ اور منزل الدهر کی خاص صفات علم الأزل (ازل کا علم) اور باری تعالیٰ کی ہستی (الوجود) کی دائمی ہے۔ اور منزل الإنية کی خاص صفات علم الذات (ذات کا علم) ہے۔ اور منزل لام ألف کی خاص صفات کون (کائنات) کی مكون (پیدا کرنے والے) کی طرف نسبت کا علم ہے۔ اور منزل التقرير کی خاص صفات علم الحضور (حاضری کا علم) ہے۔ اور منزل فناء الكون کی خاص صفات علم قلب الأعيان (اعیان کے پلٹنے کا علم) ہے۔ اور منزل الألفة کی خاص صفات علم الالتحام (جڑنے کا علم) ہے۔ اور منزل الوعيد کی خاص صفات علم المواطن (مقامات کا علم) ہے۔ اور منزل الاستفهام کی خاص صفات لَيْسَ كَمِثْلِهِ شَيْءٌ (اس کی مثال کوئی چیز نہیں) کا علم ہے۔ اور منزل الأمر کی خاص صفات علم العبودة (بندگی کا علم) ہے۔\n\n### (وصل) [انیس الٰہی منازل اور ان کے مقابل ممکنات کا ذکر]\n\nجان لو کہ ان انیس منازل میں سے ہر منزل کے لیے ممکنات میں سے ایک صنف ہے۔ ان میں سے فرشتوں کی صنف ہے، اور وہ ایک ہی صنف ہیں اگرچہ ان کے احوال مختلف ہیں۔ (اور اجسام کا علم اٹھارہ ہے): افلاک گیارہ قسم کے ہیں، اور ارکان چار ہیں، اور مولدات تین ہیں۔ اور ان کا ایک دوسرا رخ ہے جو الٰہی حضرۃ میں ممکنات کے مقابل ہے: پہلا جوہر ذات کے لیے ہے، دوسرا اعراض صفات کے لیے ہیں، تیسرا زمانہ ازل کے لیے ہے، چوتھا مکان استواء یا نعوت کے لیے ہے، پانچواں اضافات اضافات کے لیے ہیں، چھٹا اوضاع فہوانیہ کے لیے ہیں، ساتواں کمیات اسماء کے لیے ہیں، آٹھواں کیفیات ظہور (التجلیات) کے لیے ہیں، نواں تاثیرات جود کے لیے ہیں، دسواں انفعالات اعتقادات کی صورتوں میں ظہور کے لیے ہیں، گیارہواں خاصیت احدیت کے لیے ہے، بارہواں حیرت نزول، خوشی، قرض اور اس جیسی چیزوں کے وصف کے لیے ہے، تیرہواں کائنات کی حیات حی (زندہ) کے لیے ہے، چودہواں معرفت (المعرفۃ) علم کے لیے ہے، پندرہواں ہواجس ارادہ کے لیے ہیں، سولہواں ابصار بصیر کے لیے ہیں، سترہواں سمع سمیع کے لیے ہے، اٹھارہواں انسان کمال کے لیے ہے، انیسواں انوار اور ظلمتیں نور کے لیے ہیں۔\n\n(وصل: انیس منازل کے نظائر)\n\nقرآن میں ان کے نظائر سورتوں کے شروع میں آنے والے حروف تہجی ہیں، اور وہ چودہ حروف ہیں جو پانچ مراتب میں ہیں: احدیہ، ثنائیہ، ثلاثیہ، رباعیہ اور خماسیہ۔ اور آگ میں ان کے نظائر انیس فرشتے ہیں جو خازن ہیں۔ تاثیر میں ان کے نظائر بارہ برج اور سات سیارے ہیں۔ قرآن میں ان کے نظائر بسملہ کے حروف ہیں۔ اور مردوں میں ان کے نظائر بارہ نقیب اور سات ابدال ہیں۔ اور ان سات میں سے چار اوتاد ہیں، دو امام ہیں اور ایک قطب ہے۔ اور ان منازل کے نظائر الٰہی حضرۃ اور اکوان میں بہت ہیں۔\n\n### (وصل) [منازل کی منزل یا امام مبین]\n\nجان لو کہ منزل المنازل (منازل کی منزل) اس منزل سے عبارت ہے جو ان تمام منازل کو جمع کرتی ہے جو عالم دنیا میں عرش سے لے کر مٹی تک ظاہر ہوتی ہیں، اور اسے الإمام المبين (امام مبین) کہا جاتا ہے۔ اللہ تعالیٰ نے فرمایا: وكُلَّ شَيْ‏ءٍ أَحْصَيْناهُ في إِمامٍ مُبِينٍ (اور ہم نے ہر چیز کو امام مبین میں شمار کر لیا ہے)۔ پس اس کا قول أَحْصَيْناهُ (ہم نے شمار کر لیا) اس بات کی دلیل ہے کہ اس میں صرف متناہی علوم ہی ودیعت کیے گئے ہیں۔ پس ہم نے دیکھا کہ کیا کوئی ان کی تعداد کو محدود کر سکتا ہے، تو وہ متناہی ہونے کے باوجود حصر سے باہر نکل گئے، کیونکہ اس میں صرف وہی ہے جو اللہ کے عالم کو پیدا کرنے کے دن سے لے کر دنیا کے حال کے ختم ہونے اور آبادی کے آخرت کی طرف منتقل ہونے تک تھا۔ پس ہم نے ان علماء باللہ میں سے ایک سے پوچھا جن پر ہمیں بھروسہ ہے کہ کیا ان علوم کی امہات (بنیادی منازل) کا حصر ممکن ہے جو اس امام مبین میں شامل ہیں؟ تو انہوں نے کہا: ہاں۔ پس اس قابل اعتماد، امین، سچے ساتھی نے مجھے خبر دی، اور مجھ سے عہد لیا کہ میں اس کا نام نہ لوں، کہ ان علوم کی امہات جن میں سے ہر ایک میں بے شمار چیزیں شامل ہیں، ان کی تعداد ایک لاکھ انتیس ہزار چھ سو (۱،۲۹،۶۰۰) انواع تک پہنچتی ہے، اور ہر نوع میں بہت سے علوم شامل ہیں جنہیں منازل سے تعبیر کیا جاتا ہے۔ پس میں نے اس قابل اعتماد شخص سے پوچھا: کیا اللہ کی مخلوق میں سے کسی نے انہیں حاصل کیا ہے اور علم کے لحاظ سے ان کا احاطہ کیا ہے؟ تو انہوں نے کہا: نہیں۔ پھر انہوں نے کہا: وما يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ (اور تیرے رب کے لشکروں کو اس کے سوا کوئی نہیں جانتا)۔ اور جب لشکروں کو اس کے سوا کوئی نہیں جانتا، اور ذات حق (الحق) کا کوئی مقابلہ کرنے والا نہیں ہے جسے ان لشکروں کی ضرورت ہو، تو انہوں نے مجھ سے کہا: تعجب نہ کرو، فَوَ رَبِّ السَّماءِ والْأَرْضِ (پس آسمان اور زمین کے رب کی قسم) وہاں اس سے بھی زیادہ تعجب خیز چیز ہے۔ پس میں نے پوچھا: وہ کیا ہے؟ تو انہوں نے مجھے وہ بات بتائی جو اللہ نے رسول اللہ صلی اللہ علیہ وسلم کی دو بیویوں کے حق میں ذکر کی، پھر انہوں نے یہ آیت تلاوت کی: وإِنْ تَظاهَرا عَلَيْهِ فَإِنَّ الله هُوَ مَوْلاهُ وجِبْرِيلُ وصالِحُ الْمُؤْمِنِينَ والْمَلائِكَةُ بَعْدَ ذلِكَ ظَهِيرٌ (اور اگر تم دونوں اس کے خلاف ایک دوسرے کی مدد کرو گی تو بے شک اللہ ہی اس کا مولیٰ ہے اور جبرائیل اور نیک مومن اور اس کے بعد فرشتے بھی مددگار ہیں)۔ پس یہ لشکروں کے ذکر سے زیادہ تعجب خیز ہے۔ پس اللہ کے اسرار عجیب ہیں۔ جب انہوں نے مجھے یہ بتایا تو میں نے اللہ سے دعا کی کہ وہ مجھے اس مسئلے کا فائدہ اور وہ عظمت دکھائے جو اللہ نے خود کو اس کے مقابلے میں، اور جبرائیل، اور نیک مومنوں، اور فرشتوں کو اس کے بعد مددگار بنایا۔ پس مجھے اس کی خبر دی گئی، اور مجھے کسی چیز سے اتنی خوشی نہیں ہوئی جتنی اس کی معرفت سے ہوئی۔ اور میں نے جان لیا کہ وہ دونوں کس پر بھروسہ کرتی تھیں اور کون انہیں تقویت دیتا تھا۔ اور اگر اللہ خود نصرت میں اپنا ذکر نہ کرتا تو فرشتے اور مومن ان کا مقابلہ نہ کر سکتے۔ اور میں نے جان لیا کہ انہیں اللہ کی معرفت اور عالم میں تاثیر کا وہ علم حاصل ہوا جس نے انہیں یہ قوت دی۔ اور یہ اس علم میں سے ہے جو پوشیدہ کی طرح ہے۔ پس میں نے اللہ کا شکر ادا کیا جو اس نے عطا کیا۔ میرا نہیں خیال کہ اللہ کی مخلوق میں سے کسی نے اس پر بھروسہ کیا ہو جس پر ان دو عورتوں نے بھروسہ کیا۔ لوط علیہ السلام نے کہا تھا: لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلى‏ رُكْنٍ شَدِيدٍ (کاش میرے پاس تمہارے مقابلے کی کوئی قوت ہوتی یا میں کسی مضبوط سہارے کی پناہ لیتا)۔ حالانکہ ان کے پاس مضبوط سہارا تھا اور وہ اسے نہیں جانتے تھے۔\n\nکیونکہ نبی اکرم صلی اللہ علیہ وسلم نے ان کے لیے اس کی گواہی دی، پس فرمایا: \"اللہ میرے بھائی لوط پر رحم کرے، وہ ایک مضبوط سہارے کی پناہ لیتے تھے\"۔\n\nاور عائشہ اور حفصہ نے اسے جان لیا۔ پس اگر لوگ اس علم کو جان لیتے جس پر وہ دونوں تھیں تو وہ اس آیت کا معنی جان لیتے۔ واللہ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)۔",
    "fa": "«باب بیست و دوم در معرفت علم منزلِ منازل و ترتیب تمامی علوم کونی (العلوم الكونية)»\n\nشگفتا از گفتارهای نفوس والا *** که منازل در منازل جاری‌اند\nچگونه عروج از پستی به بلندی ممکن است *** مگر با قهر حضرت متعالیه\nپس صنعت تحلیل در معراج خود *** به سوی لطایف و امور والا می‌رود\nو صنعت ترکیب هنگام بازگشتش *** با فروغ هستی (الوجود) به سوی تاریکی هاویه است\n\n### [ترتیب و شمارش علوم]\n\nبدان، خداوند تو را یاری دهد، از آنجا که علمی که به حق (الحق) منسوب است، کثرت و ترتیب نمی‌پذیرد، زیرا اکتسابی و آموختنی نیست، بلکه علم او عین ذات اوست، مانند سایر صفاتی که به او منسوب است و اسم‌هایی که بدان نامیده شده است. اما علوم غیر حق (ما سوى الله) ناگزیر باید مرتب و محصور باشند، خواه علوم موهبتی باشند یا علوم کسبی. این علوم از ترتیبی که ذکر می‌کنیم خالی نیستند، و آن عبارت است از: اولاً علم مفرد، سپس علم ترکیب، و سپس علم مرکب؛ و چهارمی برای آن‌ها نیست. اگر معلوم از مفرداتی باشد که ترکیب نمی‌پذیرد، علم آن به صورت مفرد است. و همچنین باقی علوم، زیرا هر معلومی یا باید مفرد باشد یا مرکب. و مرکب بالضروره مستلزم تقدم علم ترکیب است، و در این صورت علم مرکب حاصل می‌شود.\n\n### [برای نازل‌شونده به نوزده]\n\nاینک که ترتیب تمامی علوم کونی (العلوم الكونية) را دانستی، برایت حصر منازل در این منزل را بیان می‌کنیم. این منازل بسیارند و قابل شمارش نیستند، اما ما به آن‌هایی اکتفا می‌کنیم که به شریعت خاص ما مربوط می‌شوند و بدان ممتاز می‌گردند، نه منازلی که در آن‌ها با سایر علوم ملت‌ها و نحل‌ها مشترک هستیم. مجموع این منازل نوزده مرتبه اصلی (امهات) است. برخی از آن‌ها به منازل فرعی تقسیم می‌شوند و برخی دیگر نه. اکنون نام این مراتب را ذکر می‌کنیم و آن‌ها را «منازل» می‌نامیم، زیرا در حضرت الهی (الحضرة الإلهية) این‌گونه شناخته‌ایم و رعایت ادب اولی است. القاب این منازل و صفات ارباب و اقطاب متحقق به آن‌ها و احوالشان و وصف هر یک از این احوال را ذکر خواهیم کرد. سپس، ان‌شاءالله، هر یک از این نوزده صنف را ذکر کرده و برخی از منازل اصلی (امهات المنازل) که در بر می‌گیرد را بیان می‌کنیم، نه منازل فرعی؛ زیرا منزلی هست که بیش از صد منزل از منازل علامات و دلالات بر انوار جلیه را در بر می‌گیرد، و همچنین هزاران یا کمتر از منازل غایات حاوی اسرار خفیه و خواص جلیه را شامل می‌شود. سپس، آنچه ذکر کردیم را با موجوداتی که نظیر این تعداد از منازل هستند، اعم از قدیم و حادث، دنبال می‌کنیم. سپس، ان‌شاءالله، آنچه به برخی معانی این منزل مربوط است را به صورت تقریبی و مختصر ذکر خواهیم کرد.\n\n### «ذکر القاب و صفات اقطاب آن‌ها»\n\nاز جمله این منازل: منازل ثنا و مدح، که برای ارباب کشف (الکشف) و فتح است. منازل رموز و ألغاز، برای اهل حقیقت و مجاز است. منازل دعا، برای اهل اشارات و بُعد است. منازل افعال، برای اهل احوال و اتصال است. منازل ابتداء، برای اهل هواجس و ایماء است. منازل تنزیه، برای اهل توجیه در مناظرات و استنباط است. منازل تقریب، برای غریبان متأله است. منازل توقع، برای صاحبان برقع به خاطر سبحات است. منازل برکات، برای اهل حرکات است. منازل اقسام، برای اهل تدبیر از روحانیون است. منازل دهر، برای اهل ذوق است. منازل انیّت (الإنية)، برای اهل مشاهده با ابصار است. منازل لام و الف، برای التفاف حاصل از تخلق به اخلاق الهی و برای اهل سرّی است که منکشف نمی‌شود. منازل تقریر، برای اهل علم کیمیای طبیعی و روحانی است. منازل فنای اکوان (فناء الأكوان)، برای ضنائن مخدرات است. منازل الفت، برای اهل امان از اهل غرف است. منازل وعید، برای متمسکین به قائمه عرش امجد است. منازل استخبار، برای اهل اسرار غامض است. منازل امر، برای متحققین به حقایق سرّ او در ایشان است.\nاما صفات ایشان: اهل مدح، غرور (زهو) دارند. اهل رموز، از اعتراض نجات دارند. متألهون، به واسطه تخلق، تیه (سرگردانی) دارند. اهل احوال و اتصال، به عین (حقیقت) دست می‌یابند. اهل اشاره، هنگام ابلاغ حیرت دارند. اهل استنباط، خطا و صواب دارند و معصوم نیستند. غریبان، انکسار دارند. اهل براقع، خوف دارند. اهل حرکت، مشاهده اسباب دارند. مدبران، فکر دارند. مُمَکَّنون، حدود دارند. اهل مشاهده، جحد (انکار) دارند. اهل کتمان، سلامت دارند. اهل علم، بر معلوم حکم دارند. اهل ستر، منتظر رفع آن هستند. اهل امن، در موطن خوف از مکر الهی هستند. اهل قیام، قعود دارند. اهل الهام، تحکم دارند. و اهل تحقیق، سه جامه دارند: جامه ایمان، کفر و نفاق.\n\n### [احوال ارباب منازل]\n\nو اما ذکر احوال ایشان، بدان که خداوند متعال منازل را برای نازل‌شونده مهیا ساخت، و پناهگاه‌ها را برای عاقل هموار کرد، و مراحل را برای کوچ‌کننده درنوردید، و نشانه‌ها را برای عالم بلند گردانید، و قسمت‌ها را برای تقسیم‌کننده تفصیل داد، و شکننده‌ها را برای شکننده آماده کرد، و نگهدارنده‌ها را برای نگهدارنده بیان نمود، و قواعد را برای قاعد (نشسته) برافراشت، و رصدگاه‌ها را برای رصدکننده مرتب ساخت، و مرکب‌ها را برای سوارکار مسخر کرد، و مذاهب را برای رونده نزدیک نمود، و ستایش‌ها را برای ستایشگر سطر کشید، و مقاصد را برای قصدکننده آسان نمود، و معارف را برای عارف (العارف) ایجاد کرد، و مواقف را برای واقف ثابت نمود، و راه‌ها را برای سالک (السالك) دشوار ساخت، و مناسک را برای ناسک معین کرد، و شاهد را خاموش ساخت، و ستارگان دوردست (فراقد) را برای خفته نگهبانی نمود.\n\n### «ذکر صفات احوال ایشان»\n\nزیرا او سبحانه نازل‌شونده را مقدّر، و عاقل را متفکر، و کوچ‌کننده را آماده، و عالم را مشاهده‌گر (مشاهد)، و تقسیم‌کننده را متحمل رنج، و شکننده را مجاهد، و نگهدارنده را یاری‌دهنده، و قاعد را عارف، و رصدکننده را واقف، و سوارکار را محمول، و رونده را معلول، و ستایشگر را مسئول، و قصدکننده را مقبول، و عارف را مبخوت (مسرور)، و واقف را مبهوت، و سالک را مردود، و ناسک را دورشده، و شاهد را محکم، و خفته را تسلیم‌شده قرار داد.\nاینک صفات این نوزده صنف را در احوالشان ذکر کردیم. اکنون آنچه هر صنف از منازل اصلی (امهات المنازل) در بر می‌گیرد را ذکر می‌کنیم. هر منزل از این منازل اصلی چهار صنف از منازل را شامل می‌شود: صنف اول منازل دلالات نامیده می‌شود، صنف دیگر منازل حدود، صنف سوم منازل خواص، و صنف چهارم منازل اسرار؛ که کثرت آن‌ها قابل شمارش نیست. پس به نوزده صنف اکتفا می‌کنیم و تعداد منازل اصلی که در بر می‌گیرند را ذکر می‌کنیم. و این اولین آن‌هاست:\n\n### [منزل مدح]\n\nمنزل مدح دارای منزل فتح (فتح السرين)، و منزل مفاتیح اول است که ما در آن جزئی به نام «مفاتیح الغیوب» داریم، و منزل عجایب، و منزل تسخیر ارواح برزخی، و منزل ارواح علوی است. در برخی معانی آن این ابیات را سروده‌ایم:\n\nمنازل مدح و فخرفروشی *** منازلی هستند که پایانی ندارند\nدر بلندی‌ها مدح مجوی *** مدایح قوم در خاک است\nهر که نفسش از جهاد تشنه شد *** از گواراترین آب‌ها می‌نوشد\n\nمی‌گوییم: مدح بنده این نیست که به اوصاف مولای خود متصف شود، زیرا این سوء ادب است. اما مولا می‌تواند از روی تواضع به اوصاف بنده خود متصف شود. پس نزول برای مولا جایز است، زیرا حکمی بر او جاری نیست. نزول او به اوصاف بنده خود، تفضلی از او بر بنده است تا او را گشاده‌رو کند؛ زیرا جلال مولا در قلب بنده عظیم‌تر از آن است که بتواند بر آن دلالت کند، اگر نزول او نبود. و بنده را نشاید که به اوصاف مولای خود متصف شود، نه در حضور او و نه نزد برادرانش از بندگان، حتی اگر بر آن‌ها ولایت داشته باشد، چنانکه پیامبر (صلی الله علیه و سلم) فرمود: «أنا سيد ولد آدم ولا فخر» (من سرور فرزندان آدم هستم و فخری نیست). و خداوند متعال فرمود: تِلْكَ الدَّارُ الْآخِرَةُ نَجْعَلُها (آن سرای آخرت را قرار می‌دهیم) یعنی مالک آن می‌گردانیم لِلَّذِينَ لا يُرِيدُونَ عُلُوًّا فِي الْأَرْضِ (برای کسانی که در زمین برتری نمی‌جویند). زیرا خداوند زمین را رام قرار داده و بنده ذلیل است، و ذلت مقتضی برتری نیست. هر کس از حد خود تجاوز کند، هلاک می‌شود. گفته می‌شود: کسی که قدر خود را شناخت، هلاک نشد. و قول او (شاعر) که «پایانی ندارد» می‌گوید: بنده در عبودیت خود به نهایتی نمی‌رسد که سپس بازگردد و رب شود، همان‌طور که رب حدی ندارد که به آن برسد و سپس بنده شود. پس رب تا بی‌نهایت رب است و بنده تا بی‌نهایت بنده است. به همین دلیل گفت: «مدایح قوم در خاک است»، و او از روی زمین ذلیل‌تر است. و گفت: «لذت آب را جز تشنه نمی‌شناسد»، یعنی لذت اتصاف به عبودیت را جز کسی که هنگام اتصاف به ربوبیت و نیاز خلق به او، دردها را چشیده باشد، نمی‌شناسد.\nمانند سلیمان (علیه السلام) که درخواست کرد خداوند روزی بندگان را به صورت محسوس به دست او قرار دهد. تمام آنچه در آن زمان از قوت‌ها نزد او جمع شده بود، حیوانی از حیوانات دریا بیرون آمد و قوت خود را طلبید. سلیمان به او گفت: به اندازه قوت روزانه‌ات از این بردار. آن حیوان همه آن را خورد تا به آخر رسید. سپس گفت: بیشتر بده، زیرا روزی مرا کفایت نکرد. خداوند هر روز ده برابر این را به من می‌دهد و حیوانات دیگر از من بزرگتر و روزی‌شان بیشتر است. پس سلیمان (علیه السلام) به سوی پروردگارش توبه کرد و دانست که آنچه شایسته خالق متعال است، در توان مخلوق نیست.\nاو از خداوند مُلکی را طلبیده بود که پس از او شایسته هیچ‌کس نباشد. هنگامی که این را دید، از درخواست خود استغفار کرد و حیوانات از هر سو جمع شدند و روزی خود را طلبیدند، و او از این امر دلتنگ شد. هنگامی که خداوند درخواست او را پذیرفت و او را معاف کرد، لذتی یافت که قدر آن قابل اندازه‌گیری نیست.\n\n(منزل رموز)\n\nبدان، خداوند تو را موفق بدارد، اگرچه این یک منزل است، اما منازلی را در بر می‌گیرد، از جمله: منزل وحدانیت، منزل عقل اولی، عرش اعظم، صدا، آمدن علما به سوی عرش، علم تمثل، منزل قلوب و حجاب، منزل استواء فهوانی، الوهیت ساری، استمداد کاهنان، دهر، و منازلی که ثباتی ندارند و هیچ‌کس در آن‌ها ثبات ندارد، و منزل برازخ، الوهیت، زیادت، غیرت، منزل فقد و وجدان، منزل رفع شک‌ها، جود و مخزون، منزل قهر و خسف، و منزل زمین وسیع. هنگامی که من در تونس وارد این منزل شدم، صیحه‌ای از من برآمد که خودم از آن آگاه نبودم، جز اینکه هر کس آن را شنید، بیهوش افتاد. زنانی از همسایگان که بر بام خانه مشرف بودند، بیهوش شدند و برخی از آن‌ها از بام به حیاط خانه سقوط کردند، با وجود بلندی آن، و آسیبی ندیدند. من اولین کسی بودم که به هوش آمدم. ما پشت سر امامی در حال نماز بودیم و من همه را مدهوش دیدم. پس از مدتی به هوش آمدند. گفتم: شما را چه شده است؟ گفتند: تو را چه شده است؟ صیحه‌ای زدی که این تأثیر را در جماعت گذاشت. گفتم: به خدا سوگند، خبر ندارم که صیحه‌ای زده‌ام.\nو منزل آیات غریبه و حکم الهی، و منزل استعداد و زینت، و امری که خداوند افلاک سماوی را بدان نگه داشته است، و منزل ذکر و سلب. در این منازل گفتم:\n\nمنازل کائنات در هستی (الوجود) *** منازلی هستند که همگی رموزند\nمنازلی که برای عقول در آن‌ها *** دلایلی است که همگی مجازند\nچون طالبان به قصد *** نیل به چیزی آمدند، به آن مجاز شدند\nای بندگان کیان، این را که شما را کشانده است، به دست آورید و بگذرید\n\nرمز و لغز، کلامی است که ظاهرش چیزی را می‌رساند که گوینده قصد نکرده است. همچنین منزل عالم در هستی (الوجود)؛ خداوند آن را برای خودش ایجاد نکرده، بلکه برای خود ایجاد کرده است. پس عالم به غیر از آنچه برای آن ایجاد شده، مشغول شد و با قصد ایجادکننده‌اش مخالفت کرد. به همین دلیل، گروهی از علمای عارف (العارفين) که حالشان بهتر از دیگران است، می‌گویند: خداوند ما را برای خودمان ایجاد کرد. اما محقق و بنده این را نمی‌گوید، بلکه می‌گوید: ما را برای او ایجاد کرد، نه به خاطر نیاز او به من. زیرا من لغز و رمز پروردگارم هستم. و هر کس اشعار ألغاز را بشناسد، منظور ما را می‌فهمد.\nو اما قول او: «چون طالبان به قصد نیل به چیزی آمدند، به آن مجاز شدند» (از مجازات)، می‌گوید: هر کس حق (الحق) را برای امری طلب کند، برای همان چیزی است که طلب کرده و جز آن به دست نمی‌آورد. و قول او: «ای بندگان کیان» می‌گوید: هر کس خدا را برای چیزی بپرستد، آن چیز معبود و رب اوست و خداوند از او بری است، و او برای همان چیزی است که پرستیده است. و قول او: «به دست آورید» یعنی آنچه را که به خاطر آن آمده‌اید، بگیرید و «بگذرید» یعنی از ما دور شوید، زیرا شما به سوی ما و به سبب ما نیامده‌اید.\n\n(منزل دعا)\n\nاین منزل منازلی را در بر می‌گیرد، از جمله: منزل انس با شبیه، منزل تغذیه، منزل مکه و طائف و حجاب، منزل مقاصیر و ابتلا، منزل جمع و تفرقه و منع، و منزل نواشی و تقدیس. در این منزل گفتم:\n\nبرای سرگشته رحمان در تو منازلی است *** پس ندای حق (الحق) را با رغبت پاسخ ده، ای فلان\nمرسلات دست‌های خود را به سوی تو بلند کرده‌اند *** بخشش می‌جویند، پس سائل ناامید نمی‌شود\nتو کسی هستی که دلیل به فضل او سخن گفت *** و ما بر آن شواهد و دلایلی داریم\nاگر اختصاص تو به حقیقت نبود *** منازل به نزول والای تو نزد او فخر نمی‌کردند\n\nمی‌گوید: ندای حق (الحق) به بندگانش، در واقع زبان مرسلات است که اسمی از اسمای او را طلب می‌کنند، و آن بنده در آن زمان تحت سلطه آن‌هاست. مرسلات، لطایف خلق هستند که دست‌های خود را به سوی کسی که در دست اوست (از اسماء) بلند می‌کنند تا آن را بر کسی که آن را از اسماء می‌طلبد، ببخشد. و مسئول همیشه کسی است که مهیمنی بر اسماء دارد، مانند علیم که بر خبیر، حسیب و محصّی و مفضّل تقدم دارد. به همین دلیل گفت: «تو کسی هستی که دلیل به فضل او سخن گفت». و حقیقتی که او بدان اختصاص یافته، احاطه او بر اسمایی است که در رتبه زیر او هستند، زیرا قادر در رتبه پایین‌تر از مرید است و عالم در رتبه بالاتر از مرید است و حیّ بالاتر از همه است. پس منازلی که تحت احاطه اسم جامع هستند، به نزول او به سوی آن‌ها، در پاسخ به سؤالشان، افتخار می‌کنند.\n\n(منزل افعال)\n\nو این منزل شامل منازلی است، از جمله: منزل فضل و الهام، منزل اسراء روحانی، منزل تلطف، و منزل هلاکت. در این منازل می‌گویم:\n\nبرای منازل افعال برقی درخشان است *** و بادهای آن ابرها را با تندبادها می‌رانند\nو تیرهای آن در عوالم نافذ است *** و شمشیرهای آن در کائنات بُرنده است\nامر خود را به سوی عزت محقق افکند *** پس چشم می‌بیند و دسترسی دور است\n\nمردم در مورد افعال بندگان بر دو دسته‌اند: گروهی افعال را از بندگان می‌بینند و گروهی افعال را از حق (الحق) می‌بینند. برای هر دو گروه، با وجود اعتقادشان، شبه برق درخشانی پدیدار می‌شود که در آن لحظه، نسبتی از آن فعل را به کسی که آن را از او نفی کرده‌اند، می‌دهد. و هر دو گروه ابری دارند که بین آن‌ها و نسبت دادن فعل به کسی که آن را از او نفی کرده‌اند، حائل می‌شود. و قول او در مورد بادهای آن که شدید است، یعنی اسباب و دلایلی که برای هر گروه بر نسبت دادن افعال به کسی که به او نسبت داده‌اند، قوی است، با توجه به دیدگاه آن‌ها. و تیرهای آن را به نفوذ در نفوس کسانی که این اعتقاد را دارند، وصف می‌کند، و همچنین شمشیرهای آن در آن‌ها بُرنده است. و قول او که «امر خود را به سوی عزت افکند» یعنی به پناهگاهی بازدارنده پناه برد که مانع از تأثیر مخالف در آن می‌شود. پس هر کس بر آنچه اراده حق (الحق) در اوست، باقی می‌ماند. خداوند متعال فرمود: زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمْ (ما برای هر امتی عملشان را زینت دادیم). و قول او: «پس چشم می‌بیند» یعنی حس شهادت می‌دهد که فعل از بنده است و انسان این را از نفس خود به واسطه اختیاری که در آن دارد، می‌یابد. و قول او: «و دسترسی دور است» یعنی نسبت دادن آن به غیر از آنچه حس و نفس می‌دهد، دور از دسترس است، اما ناگزیر باید در آن برق درخشانی باشد که نسبتی از آن فعل را به کسی که از او نفی شده، بدهد که انکار آن ممکن نیست.\n\n(منزل ابتداء)\n\nو این منزل شامل منازلی است، از جمله: منزل غلظت و سبحات، منزل تنزلات و علم به توحید الهی، منزل رحموت، و منزل حق (الحق) و فزع. در این منزل می‌گویم:\n\nبرای ابتداء شواهد و دلایلی است *** و چون بار سفر فرود آید، برای آن منازلی است\nحکم آن بر عین حوادث احاطه دارد *** و خداوند کریم فاعل آن را مدد می‌رساند\nبین آن و معبودش نسبتی نیست *** مگر تعلق و هستی (الوجود) حاصل\nسخن جاهل را مشنو *** که بنای هستی (الوجود) حقایق و اباطیل است\nبنای هستی (الوجود) حقایق مشهود است *** و غیر از هستی، محال و باطل است\n\nمی‌گوید: برای ابتدای اکوان شواهدی هست که نشان می‌دهد آن‌ها برای خودشان نبوده‌اند و سپس به وجود آمده‌اند. و ضمیر «له» به ابتداء برمی‌گردد. «چون بار سفر فرود آید» یعنی اگر آن را دنبال کنی که از کجا آمده است، آن را از نزد کسی که ایجادش کرده، می‌یابی. به همین دلیل برای آن بقا بود. خداوند متعال فرمود: وَمَا عِنْدَ اللَّهِ بَاقٍ (و آنچه نزد خداست باقی است). پس اگر نزد او بار افکنی، منزلت آن را نزد او می‌شناسی، که در آنجا برای خودش نبود. و آن منزل اولیت الهی است در قول او: هُوَ الْأَوَّلُ (او اول است). و از این اولیت، ابتدای کون صادر شده و حوادث همه از آن مدد می‌گیرند و او حاکم بر آن‌هاست و آن‌ها بر حکم او جاری هستند.\nو نفی نسبت از آن، زیرا اولیت حق (الحق) اولیت بنده را مدد می‌رساند، و اولیت کون مددی به چیزی نمی‌رساند. پس نسبتی نیست مگر عنایت، و سببی نیست مگر حکم، و زمانی نیست جز ازل. این مذهب قوم است. و آنچه باقی می‌ماند و تحت حصر این سه داخل نمی‌شود، کوری و تلبیس است. صاحب «محاسن المجالس» این‌گونه تصریح کرده است.\nو قول کسی که گفت: «بنای هستی (الوجود) حقایق و اباطیل است»، صحیح نیست. زیرا باطل همان عدم است. و این صحیح است، زیرا هستی (الوجود) آموخته‌شده در حکم عدم است. و هستی حق (الوجود الحق) کسی است که وجودش برای خودش باشد. و هر عدمی که یافت شود، جز از وجودی که برای غیر خود و نه برای خود به آن وصف شده بود، یافت نشده است. و آنکه هستی را آموخته، هستی برای عین خود را آموخته است. اما محال باطل، آن است که نه برای خود و نه از غیر خود، هستی ندارد.\n\n(منزل تنزیه)\n\nاین منزل شامل منازلی است، از جمله: منزل شکر، منزل بأس، منزل نشر، منزل نصر و جمع، و منزل ربح و خسران و استحالات. و ما در این باره می‌گوییم:\n\nبرای منازل تنزیه و تقدیس *** رازی گفتنی است که حکم آن معقول است\nعلمی که حکم آن به منزّه باز می‌گردد *** فردوس قدس، باغی است که شبنم بر آن نشسته\nپس منزّه‌کننده حق (الحق) آشکار، آنچه را که گفته است، جایز می‌شمارد *** پس هدف او گمراهی است\n\nمی‌گوید: منزّه حقیقی کسی است که خود نزاهت دارد. و تنزیه تنها برای کسی است که آنچه از آن تنزیه می‌شود، بر او جایز باشد، و او مخلوق است. به همین دلیل، تنزیه به منزّه‌کننده باز می‌گردد.\nپیامبر (صلی الله علیه و سلم) فرمود: «إنما هي أعمالكم ترد عليكم» (این‌ها اعمال شماست که به شما بازگردانده می‌شود).\nپس هر کس عملش تنزیه باشد، تنزیهش به او باز می‌گردد و جایگاهش از اینکه اعتقادی در او باشد که شایسته حق (الحق) نیست، منزّه می‌شود. از اینجاست که کسی که گفت: «سبحانی» (پاک و منزّه هستم) برای تعظیم جلال خداوند متعال بود. و به همین دلیل گفت: «باغی است که شبنم بر آن نشسته»، و آن نزول تنزیه به محل بنده است که خالق خود را تنزیه می‌کند. و خداوند يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (حق را می‌گوید و او راه را هدایت می‌کند).\n\n(منزل تقریب)\n\nاین منزل شامل دو منزل است: منزل خرق عادات و منزل احدیت «کُن». و در آن سرودم:\n\nبرای منازل تقریب شرطی دانسته شده است *** و برای آن بر ذات کیان حکمرانی است\nپس چون شرط قیامت فرا رسد و جبار آن مستقر شود *** هستی (الوجود) خضوع می‌کند و خدمت می‌نماید\nهیهات، نفوس ثمرات خود را درو نمی‌کنند *** مگر آن‌هایی که عمل کرده‌اند و تو مجسم هستی\n\nمی‌گوید: تقریب از صفات محدثات است، زیرا تقریب و ضد آن را می‌پذیرند. و حق (الحق) خود قریب است، اگرچه خود را به تقرب وصف کرده است. و مصدر آن تقریب و تقرب است. و هنگامی که گفت: «شرطی دانسته شده است»، و آن قبول تأثیر است. و گفت: امر به طور عمومی آشکار و منکشف نمی‌شود مگر در آخرت. و گفت: نفوس ثمری ندارند مگر آنچه در زندگی دنیوی خود از خیر یا شر کاشته‌اند. پس تقرب آن‌ها از اعمالشان است. فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ (پس هر کس به اندازه ذره‌ای کار نیک کند، آن را می‌بیند و هر کس به اندازه ذره‌ای کار بد کند، آن را می‌بیند).\n\n(منزل توقع)\n\nاین منزل نیز شامل دو منزل است: منزل طریق الهی و منزل سمع. و در آن نظم سرودم:\n\nمنازلی برای توقع آشکار شدند *** و میوه‌های آن برای دست مقرب نزدیک است\nپس از شاخه‌های نزدیکی میوه‌های آن را بچین *** و از شاخه‌های معمولی نچین\nاز اعتدال خود خارج مشو و ملازم *** وسط راه باش تا حقایق را آشکار ببینی\n\nمی‌گوید: آنچه انسان توقع دارد، آشکار شده است، زیرا او چیزی را توقع ندارد مگر اینکه ظهوری از آن در باطن او باشد. پس از غیب خود که شایسته آن است، به باطن کسی که توقع دارد، آشکار شده است. سپس او توقع ظهور آن را در عالم شهادت دارد، و در این صورت در دسترس‌تر است. و این همان قول اوست: قُطُوفُها دَانِيَةٌ (میوه‌های آن نزدیک است) یعنی برای دست چیننده نزدیک است. می‌گوید: راه اعتدال را حفظ کن و از آن منحرف مشو. و اعتدال در اینجا ملازمت حقیقت توست، که از آن خارج نشوی، چنانکه متکبران خارج شدند. و کسی که برزخی بین دو طرف باشد، بر هر دو مشرف است. اما اگر به یکی متمایل شود، از دیگری غایب می‌گردد.\n\n(منزل برکات)\n\nاین منزل نیز شامل دو منزل است: منزل جمع و تفرقه، و منزل خصام برزخی، که منزل مُلک و قهر است. و در آن گفتم:\n\nبرای منازل برکات نوری می‌درخشد *** و برای آن در دانه‌های قلب‌ها توقعی است\nدر آن برای هر طالب مشهدی افزونی است *** و برای آن به سوی نفس هستی (الوجود) تطلعی است\nپس چون سرّ طالب حکمت *** به حقایق برکات متحقق شود، محل طلوع را محکم می‌سازد\nپس ستایش خدایی را که در کائنات او *** اعیان مشهودند و شنیده می‌شوند\n\nبرکات، همان زیادت است و از نتایج شکر است. و حق (الحق) خود را به نام شاکر و شکور نامید، مگر برای اینکه در عملی که برای ما تشریع کرده است، بیفزاییم، همان‌طور که حق (الحق) نعمت‌ها را با شکر ما افزایش می‌دهد. پس هر نفسی متطلع به زیادت است. می‌گوید: و هنگامی که طالب حکمت به زیادت متحقق شود، به اموری منفرد می‌شود که تلاش می‌کند کسی در آن‌ها با او شریک نشود تا زیادت از آن نوع باشد. و صاحب این مقام، حالش مراقبت از حالی است که طلب می‌کند.\n\n(منزل اقسام و ایلاء)\n\nاین منزل شامل منازلی است، از جمله: منزل فهوانیات رحمانی، منزل مقاسم روحانی، منزل رقوم، منزل مساقط نور، منزل شعرا، منزل مراتب روحانی، منزل نفس کلی، منزل قطب، منزل انفهاق انوار بر عالم غیب، منزل مراتب نفس ناطقه، منزل اختلاف طرق، منزل مودت، منزل علوم الهام، منزل نفوس حیوانی، و منزل صلاة وسطی. و در این باره گفتم:\n\nمنازل اقسام در عرض *** احکام آن‌ها در عالم زمین است\nبر افلاک سعد بر کسی جاری می‌شود *** که به سنت و فرض قیام کند\nو علم آن موقوف بر عین آن است *** و حکم آن در طول و عرض است\n\nمی‌گوید: قسم نتیجه تهمت است. و حق (الحق) با خلق از حیث آنچه هستند، معامله می‌کند، نه از حیث آنچه اوست. به همین دلیل، حق تعالی برای ملائکه قسم نخورد، زیرا آن‌ها از عالم تهمت نیستند. و برای مخلوق جایز نیست که به مخلوقی قسم بخورد، و این مذهب ماست. و اگر به مخلوقی قسم بخورد، نزد ما عاصی است و اگر حنث کند، کفاره‌ای بر او نیست و فقط باید از آنچه در آن واقع شده، توبه کند.\nحق (الحق) تنها به نفس خود قسم خورد، هنگامی که با ذکر مخلوقات قسم خورد و حذف اسم (خداوند) دلالت بر آن دارد. اظهار اسم در مواضعی از کتاب عزیز مانند قول او: فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ (پس سوگند به پروردگار آسمان و زمین) ... بِرَبِّ الْمَشَارِقِ وَالْمَغَارِبِ (به پروردگار مشرق‌ها و مغرب‌ها)، این‌ها نشانه‌هایی در مواضعی بودند که ذکری آشکار از اسم نیامده بود، که آن اسم در آنجا غایب است، به خاطر امری که سبحانه اراده کرده است و کسی که حق (الحق) آن را به او شناسانده باشد، از نبی و ولی ملهم، آن را می‌شناسد. زیرا قسم دلیل بر تعظیم مقسم‌به است. و شکی نیست که در قسم، از کسانی که می‌بینند و کسانی که نمی‌بینند، ذکر شده است. پس رفیع و وضیع، مورد رضایت و مورد غضب، محبوب و مبغوض، مؤمن و کافر، موجود و معدوم در آن داخل شده‌اند. و منازل اقسام را نمی‌شناسد مگر کسی که عالم غیب را بشناسد. پس غلبه ظن این است که اسم الهی در اینجا مضمر است. و ما به تو شناساندیم که عالم غیب همان طول است و عالم شهادت همان عرض.\n\n(منزل انیّت)\n\nاین منزل شامل منازلی است، از جمله: منزل سلیمان (علیه السلام) بدون دیگر انبیا، منزل ستر کامل، منزل اختلاف مخلوقات، منزل روح، و منزل علوم. و در آن می‌گویم:\n\nانیّت (الإنية) قدسی مشهود است *** برای هستی (الوجود) آن نزد مردان منازلی است\nکیان را فانی می‌کند اگر صورتی تجلی (التجلی) کند *** در صورتی که نشانه‌های آن برتری می‌یابند\nو هستی (الوجود) خود را با نعت‌هایش در تو نشان می‌دهد *** پشت سایه‌ها، هستی (الوجود) آن برای تو فراگیر است\n\nمی‌گوید: حقیقت الهی معنوی با نعت‌های تنزیه، اگر مشاهده شود، هر عین دیگری را فانی می‌کند، اگرچه مشاهد آن در شخص واحد بر حسب احوالش و در اشخاص به دلیل اختلاف احوالشان برتری یابند. زیرا حقیقت این را داده است که شاهد از ما جز نفس خود را مشاهده نمی‌کند، همان‌طور که او از ما جز نفس خود را مشاهده نمی‌کند. پس هر حقیقتی برای دیگری آینه است. مؤمن آینه برادرش است. لَيْسَ كَمِثْلِهِ شَيْءٌ (چیزی مانند او نیست).\n\n(منزل دهور)\n\nاین منزل شامل منازلی است، از جمله: منزل سابقه، منزل عزت، منزل روحانیات افلاک، منزل امر الهی، منزل ولادت، منزل موازنه، و منزل بشارت به لقاء. و در آن می‌گویم:\n\nو از منازل، آنچه مقدر است *** مانند زمان، که آن موهوم است\nدایره‌های آن با گردش‌های خود بر آن دلالت کردند *** و تصرف و مقام اعظم از آن اوست\n\nمی‌گوید: از آنجا که ازل در حق حق (الحق) امری موهوم بود، زمان نیز در حق حق (الحق) امری موهوم است، یعنی مدت موهومی که حرکات افلاک آن را قطع می‌کنند. زیرا ازل برای خلق مانند زمان است، پس بفهم.\n\n(منزل لام الف)\n\nاین منزل التفاف است و غلبه با ائتلاف است نه اختلاف. خداوند متعال فرمود: وَالْتَفَّتِ السَّاقُ بِالسَّاقِ إِلَى رَبِّكَ يَوْمَئِذٍ الْمَسَاقُ (و ساق به ساق بپیچد، در آن روز راندن به سوی پروردگار توست). و این منزل شامل منازلی است، از جمله: منزل مجمع البحرین، جمع الأمرین، و منزل تشریف محمدی که در کنار منزل صمدی است. و در آن می‌گویم:\n\nمنازل لام در تحقیق و الف *** هنگام لقاء، انفصال حال وصل آن‌هاست\nآن دو، بالاترین دلیل برای کسی هستند که گفت: من *** سرّ هستی (الوجود) هستم و من عین آن هستم، پس آن دو را بفهم\nچه نیکو دو دلیلی هستند، زیرا با حال خود دلالت کردند *** نه مانند کسی که با اقوال دلالت کرد و منقطع شد\n\nمی‌گوید: اگرچه لام به الف پیوند خورد و منعقد شد و یک عین واحد شدند، و این در حروف مزدوج در مقام بیست و هشتم بین واو و یاء که دارای صحت و اعتلال هستند، آشکار است. پس به دلیل علتی که در الف است و صحتی که در لام است، مناسبتی بین آن و این دو حرف (واو و یاء) واقع شد. پس حرف صحیح (لام) در کنار حرف صحت (یاء) قرار می‌گیرد و حرف معتل (الف) در کنار حرف علت (واو). و دست‌های او (حق) به رحمت گشاده و به نقیض آن (قهر) بسته است.\nو لام الف در نظم مفرد صورتی ندارد، بلکه در آن غیب است و رتبه‌ای بر حال خود بین واو و یاء دارد. و زای و حاء و طاء یابسه را به جای خود نایب قرار داده است. پس در غیب خود رتبه هفتم، هشتم و نهم را دارد. و منزلت ماه را بین بدر و هلال دارد. پس رتبه برزخیت در غیبت و ظهورش همواره همراه اوست. او بیست و چهارم است، زیرا هفت را با زای، هشت را با حاء و نُه را با طاء دارد. و روز بیست و چهار ساعت است. پس در هر ساعتی که با آن عمل کنی، عملت بر میزان وضع موفق می‌شود، زیرا در حروف رقم است نه در حروف طبع. زیرا در حروف طبع فقط لام را دارد که از حروف زبان است و برزخی بین حلق و شفتین است. و الف از حروف طبع نیست. پس جز نایب یک حرف، یعنی لام، نشد که الف از آن متولد می‌شود، اگر حرکت آن اشباع شود. اگر اشباع نشود، همزه ظاهر می‌شود. به همین دلیل، برخی از علما الف را نصف حرف و همزه را نصف حرف در رقم وضعی قرار دادند، نه در لفظ طبعی.\nسپس باز می‌گردیم و می‌گوییم: اگر لام به الف منعقد شد، چنانکه گفتیم، و یک عین واحد شدند، اما دو ران آن دلالت بر دو بودن آن‌ها دارد. سپس عبارت با اسم آن دلالت بر دو بودن آن دارد. پس آن اسمی مرکب از دو اسم برای دو عین است: یک عین لام و دیگری الف. اما چون در شکل به صورت واحد ظاهر شدند، ناظر بین آن‌ها تفاوتی نگذاشت و برای او مشخص نشد که کدام ران لام است تا دیگری الف باشد. پس کاتبان در آن اختلاف کردند. برخی تلفظ را رعایت کردند و برخی آنچه را که ترسیم آن با آن آغاز می‌شود، رعایت کردند و آن را اول قرار دادند. پس بر تقدم لام بر الف اجماع کردند، زیرا الف در اینجا بدون شک از لام متولد شده است. و همچنین همزه در مواردی مانند قول او: لَأَنْتُمْ أَشَدُّ رَهْبَةً (شما ترسناک‌تر هستید) و امثال آن، لام را دنبال می‌کند.\nو این حرف، یعنی لام الف، حرف التباس در افعال است. پس فعل ظاهری که به دست مخلوق انجام می‌شود، برای کسی که آن را انجام داده، خالص نشد. اگر بگویی برای خداست، راست گفته‌ای. و اگر بگویی برای مخلوق است، راست گفته‌ای. و اگر این‌گونه نبود، تکلیف و اضافه عمل از سوی خدا به بنده صحیح نمی‌شد.\nپیامبر (صلی الله علیه و سلم) می‌فرماید: «إنما هي أعمالكم ترد عليكم» (این‌ها اعمال شماست که به شما بازگردانده می‌شود).\nو خداوند می‌فرماید: وَمَا يَفْعَلُوا مِنْ خَيْرٍ فَلَنْ يُكْفَرُوهُ (و هر کار خیری انجام دهند، هرگز کفران نمی‌شود) و اعْمَلُوا مَا شِئْتُمْ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ (هر چه می‌خواهید انجام دهید، او به آنچه می‌کنید بیناست). و خداوند يَقُولُ الْحَقَّ (حق را می‌گوید). پس همچنین، هر کدام از دو ران را که لام یا الف قرار دهی، راست گفته‌ای، اگرچه عمل در وضع شکل نزد علمای آن برای تحقق به صورت، متفاوت باشد. و هر کس دلالت کند که فعل تنها برای یکی از دو ران است و نه دیگری، آن صحیح نیست و صاحبش منقطع می‌شود و ثابت نمی‌ماند. و دیگری از اهل آن شأن با او مخالفت می‌کند و به گمان خود دلالت می‌کند، و قول او مانند قول مخالفش است. و امر متعارض و مشکل می‌شود، مگر بر کسی که خداوند بصیرتش را نورانی کرده و او را به راه راست هدایت نموده است.\n\n(منزل تقریر)\n\nاین منزل شامل منازلی است، از جمله: منزل شمارش نعمت‌ها، منزل رفع ضرر، و منزل شرک مطلق. و در آن می‌گویم:\n\nمنازل با سکون تثبیت شدند *** و ظهور بر کمون (پنهانی) ترجیح یافت\nو با عیان بر چشمه‌هایی دلالت کردند *** که از آب گوارا جوشیده‌اند\nو با برق‌ها، ابرهای باران‌زا دلالت کردند *** هنگامی که بر نور آشکار درخشیدند\n\nبدان، خداوند تو را یاری دهد، می‌گوید: ثبوت، منازل را تثبیت می‌کند. پس هر کس ثابت شود و بر حقیقت خود برای هر چشمی ظاهر گردد. آیا نمی‌بینی که سرعت حرکت چه شباهتی به تو می‌دهد؟ پس ناظر بر شیء حکم می‌کند که خلاف آن چیزی است که هست. مثلاً در مورد آتشی که در اخگر یا سر فتیله است، اگر با سرعت به صورت عرضی حرکت داده شود، می‌گوید خطی کشیده است، یا اگر آن را سریع بچرخاند، دایره‌ای از آتش در هوا می‌بیند. و سبب این امر، عدم ثبوت است. و هنگامی که منازل ثابت شوند، بر آنچه از علوم الهی در بر دارند، دلالت می‌کنند.\n\n(منزل مشاهده)\n\nاین یک منزل واحد است که منزل فنای کون (فناء الكون) است. در آن، کسی که نبوده، فانی می‌شود و کسی که همیشه بوده، باقی می‌ماند. و در آن می‌گویم:\n\nدر فنای کون (فناء الكون) منزلی است *** روح آن در ما نازل می‌شود\nآن شب قدر من است *** که نه نوری دارد و نه سایه‌ای\nاو عین نور خالص است *** که از آن جابه‌جایی ندارد\nپس من به حق امام هستم *** پادشاهی در صدر اول\nکلید امر من نزد اوست *** پس شما را والی می‌کند و عزل می‌نماید\nنیزه‌های سمهری من بلند است *** من سماک اعزل نیستم\nپس مقام حق (الحق) در شما *** دائمی است و تغییر نمی‌کند\nو او قاهر از اوست *** و او امام عادل‌تر است\nاو نور تمثیل شده نیست *** بلکه از ماه کامل‌تر است\nو من از او به یقین *** در جایگاه سرّ برتر هستم\nپس با عینِ عین بالا می‌روم *** و با امرِ امر نازل می‌شوم\n\nمی‌گوید: حالت فنا نه نور دارد و نه سایه، مانند شب قدر. سپس گفت: و آن همان نور حقیقی و سایه حقیقی است، زیرا آن اصل است که ضدی ندارد، در حالی که انوار را ظلمت‌ها مقابل‌اند. اما این را چیزی مقابل نیست. و قول او: «من امام هستم» یعنی شهود او به حق (الحق) از وجه خاصی که از او به سوی من است، و آن صدر اول است. و از این مقام، تفصیل و کثرت و عدد در صور واقع می‌شود. و «سمهریات» کنایه از تأثیر قیومیت در عالم است. و برای آن ثبوت است، لذا گفت: «تغییر نمی‌کند». و قهر و عدل از آن اوست. او تشبیه را نمی‌پذیرد. پس با شهود ذات بالا می‌روم و با امر الهی به عنوان امام در عالم نازل می‌شوم.\n\n(منزل الفت)\n\nاین یک منزل واحد است و در آن می‌گویم:\n\nمنازل الفت، مأنوس هستند *** و با این وصف شناخته شده‌اند\nپس به کسی که در آن عروسی کرده بگو: اقامت کن *** زیرا آن با امنیت احاطه شده است\nو آن بر دو نفر موقوف است *** و از عذاب فردیت (وتر) منصرف شده است\n\nاین منزل عروسی‌ها، سرور و شادی‌هاست. و این از چیزهایی است که خداوند بر پیامبرش محمد (صلی الله علیه و سلم) منت نهاد و فرمود: لَوْ أَنْفَقْتَ مَا فِي الْأَرْضِ جَمِيعًا مَا أَلَّفْتَ بَيْنَ قُلُوبِهِمْ (اگر آنچه در زمین است، همه را انفاق می‌کردی، نمی‌توانستی بین دل‌هایشان الفت دهی) یعنی بر تو، وَلَكِنَّ اللَّهَ أَلَّفَ بَيْنَهُمْ (ولی خداوند بین آن‌ها الفت داد) یعنی بر مودت تو، اجابت تو و تصدیق تو.\n\n(منزل استخبار)\n\nاین منزل شامل منازلی است، از جمله: منزل منازعه روحانی، منزل حلیه سعادتمندان چگونه بر اشقیا ظاهر می‌شود و بالعکس، و منزل کون قبل از انسان. و در آن می‌گویم:\n\nچون از عزیزان قلبم پرسیدم *** مرا به استفهام لفظی حواله دادند\nمنازل آن‌ها جز با لفظ تو نیست *** پس ای بدبختی من از آن و بدشانسی‌ام\nنفس را موعظه کردم که به آن‌ها نگاه نکند *** اما با خاطرش به موعظه من توجه نکرد\nآن‌ها را رها کردم، شاید به کونی دست یابم *** پس آن‌ها عین کون من و عین لفظ من بودند\nو گفت: و از شگفتی است که من به آن‌ها مشتاقم *** و از هر که می‌بینم، از آن‌ها می‌پرسم، در حالی که آن‌ها با من هستند\nو چشمم آن‌ها را رصد می‌کند، در حالی که در سیاهی آن هستند *** و قلبم مشتاق آن‌هاست، در حالی که بین دنده‌های من هستند\n\nمی‌گوید: آن‌ها در زبان من هستند، هنگامی که از آن‌ها می‌پرسم، و در سیاهی چشم من هستند، هنگامی که به آن‌ها نگاه می‌کنم، و در قلب من هستند، هنگامی که به آن‌ها فکر می‌کنم و مشتاقشان می‌شوم. پس آن‌ها در هر حالی که من باشم، با من هستند. آن‌ها عین من هستند و من عین آن‌ها نیستم، زیرا آنچه من از آن‌ها دارم، آن‌ها از من ندارند.\n\n(منزل وعید)\n\nاین یک منزل واحد است که شامل جور و استمساك به کون است. و در آن گفتم:\n\nوعید دو منزل است، برای کسی که *** سلوک بر طریق مستقیم را ترک کند\nپس چون هستی (الوجود) او به کمال متحقق شود *** و بر حکم علو قدیم راه رود\nآن دو (منزل) نزد او نعمت می‌شوند، پس نعمت او *** در آتش است و آن نعمت هر گرامی است\n\nمنزل روحانی که عذاب نفوس است، و منزل جسمانی که عذاب محسوس است. و این جز برای کسی نیست که از راه مشروع در ظاهر و باطن منحرف شود. پس اگر به استقامت موفق شود و عنایت ازلی شامل حالش گردد، از آن معصوم می‌شود و به آتش مجاهده برای بهشت مشاهده تنعم می‌یابد.\n\n(منزل امر)\n\nاین منزل شامل منازلی است، از جمله: منزل ارواح برزخی، منزل تعلیم، منزل سِرّی، منزل سبب، منزل تمائم، و منزل قطب و امامین. و ما در آن می‌گوییم:\n\nمنازل امر، همان انیّت (الإنية) ذات است *** با آن شادی‌ها و لذت‌های من حاصل می‌شود\nای کاش در تمام عمرم در آن قائم باشم *** و تا زمان ملاقات زائل نشوم\nروشنی چشم برای مختار (پیامبر) بود *** هنگامی که در صدر مناجات آشکار می‌شد\n\nامر الهی از صفات کلام است و از جهت تشریع بر اولیا مسدود است. و در حضرت الهی (الحضرة الإلهية) امر تکلیفی نیست، مگر اینکه مشروع باشد. پس برای ولی جز شنیدن امر آن (حضرت) باقی نمی‌ماند، هنگامی که به انبیا امر می‌کند. پس برای ولی هنگام شنیدن آن، لذتی ساری در هستی (الوجود) او حاصل می‌شود. اما برای اولیا مناجات الهی باقی می‌ماند که در آن امر نیست، بلکه سمر و حدیث است. پس هر کس از اهل کشف (الکشف) بگوید که در حرکات و سکناتش به امر الهی مأمور است که مخالف امر شرعی محمدی تکلیفی باشد، امر بر او مشتبه شده است، اگرچه در آنچه شنیده صادق باشد. و این ممکن است که تجلی الهی (التجلی الإلهي) در صورت پیامبرش (صلی الله علیه و سلم) بر او ظاهر شود و پیامبرش او را خطاب کند، یا در شنیدن خطاب پیامبرش اقامه شود. و این بدان سبب است که رسول، رساننده امر حق تعالی است که خداوند بندگانش را بدان امر کرده است. پس ممکن است که از حق (الحق) در حضرتی، آن امری را بشنود که رسولش (صلی الله علیه و سلم) قبلاً برای او آورده است. پس می‌گوید: حق (الحق) مرا امر کرد، در حالی که در حق او، این فقط تعریفی است که او امر شده است. و این سبب با محمد (صلی الله علیه و سلم) منقطع شد. و غیر از اوامر مشروع از جانب خدا، اولیا در آن قدم راسخ دارند.\nاینک ما نوزده صنف از منازل را آوردیم. اکنون خاص‌ترین صفات هر منزل را ذکر می‌کنیم:\n\n(وصل) [در ذکر خاص‌ترین صفات هر یک از نوزده منزل]\n\nخاص‌ترین صفات منزل مدح، تعلق علم به آنچه پایان ندارد، است. و خاص‌ترین صفات منزل رموز، تعلق علم به خواص اعداد و اسماء است، که همان کلمات و حروف هستند، و علم سیمیا در آن است. و خاص‌ترین صفات منزل دعا، علوم اشاره و تحلیه است. و خاص‌ترین صفات منزل افعال، علم «اکنون» (الآن) است. و خاص‌ترین صفات منزل ابتداء، علم مبدأ و معاد و معرفت اولیات هر چیز است. و خاص‌ترین صفات تنزیه، علم سلخ و خلع است. و خاص‌ترین صفات تقریب، علم دلالات است. و خاص‌ترین صفات منزل توقع، علم نسب و اضافات است. و خاص‌ترین صفات منزل برکات، علم اسباب، شروط، علل، ادله و حقیقت است. و خاص‌ترین صفات اقسام، علوم عظمت است. و خاص‌ترین صفات منزل دهر، علم ازل و دیمومت باری (خداوند) در هستی (الوجود) است. و خاص‌ترین صفات منزل انیّت (الإنية)، علم ذات است. و خاص‌ترین صفات منزل لام الف، علم نسبت کون به مُکَوِّن است. و خاص‌ترین صفات منزل تقریر، علم حضور است. و خاص‌ترین صفات منزل فنای کون (فناء الكون)، علم قلب اعیان است. و خاص‌ترین صفات منزل الفت، علم التیام است. و خاص‌ترین صفات منزل وعید، علم مواطن است. و خاص‌ترین صفات منزل استفهام، علم لَيْسَ كَمِثْلِهِ شَيْءٌ (چیزی مانند او نیست) است. و خاص‌ترین صفات منزل امر، علم عبودیت است.\n\n(وصل) [در ذکر منازل الهی نوزده‌گانه و آنچه از ممکنات در مقابل آن‌هاست]\n\nبدان که برای هر یک از این نوزده منزل، صنفی از ممکنات وجود دارد. از جمله آن‌ها صنف ملائکه است، که یک صنف هستند، اگرچه احوالشان متفاوت است. (و علم اجسام هجده نوع است): افلاک یازده نوع، ارکان چهار نوع، و مولدات سه نوع.\nو وجه دیگری از ممکنات در حضرت الهی (الحضرة الإلهية) در مقابل آن‌هاست:\n۱. جوهر برای ذات، که اول است.\n۲. اعراض، که برای صفات هستند.\n۳. زمان، که برای ازل است.\n۴. مکان، که برای استواء یا نُعوت است.\n۵. اضافات، برای اضافات.\n۶. اوضاع، برای فهوانیت.\n۷. کمیات، برای اسماء.\n۸. کیفیات، برای تجلیات (التجلیات).\n۹. تأثیرات، برای جود.\n۱۰. انفعالات، برای ظهور در صور اعتقادات.\n۱۱. خاصیت، که برای احدیت است.\n۱۲. حیرت، که برای وصف به نزول، فرح و قرض و امثال آن است.\n۱۳. حیات کائنات، برای حیّ.\n۱۴. معرفت (المعرفة)، برای علم.\n۱۵. هواجس، برای اراده.\n۱۶. ابصار، برای بصیر.\n۱۷. سمع، برای سمیع.\n۱۸. انسان، برای کمال.\n۱۹. انوار و ظلمت‌ها، برای نور.\n\n(وصل در نظایر منازل نوزده‌گانه)\n\nنظایر آن‌ها از قرآن، حروف هجایی است که در ابتدای سوره‌ها آمده‌اند، و آن‌ها چهارده حرف در پنج مرتبه هستند: احدیه، ثنائیه، ثلاثیه، رباعیه و خماسیه.\nو نظایر آن‌ها از آتش، خازنان نوزده‌گانه (ملائکه) هستند.\nنظایر آن‌ها در تأثیر، دوازده برج و هفت سیاره (دراری) هستند.\nنظایر آن‌ها از قرآن، حروف بسمله هستند.\nنظایر آن‌ها از مردان، دوازده نقیب و هفت ابدال هستند. و این هفت نفر شامل چهار اوتاد، دو امام و یک قطب هستند.\nو نظایر این منازل از حضرت الهی (الحضرة الإلهية) و از اکوان بسیار است.\n\n(وصل) [در منزل منازل یا امام مبین]\n\nبدان که منزل منازل، عبارتی است از منزلی که تمامی منازلی را که در عالم دنیا از عرش تا ثری ظاهر می‌شوند، جمع می‌کند. و آن «امام مبین» نامیده می‌شود. خداوند متعال فرمود: وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ (و هر چیزی را در امام مبین برشمرده‌ایم).\nقول او: «برشمرده‌ایم» دلیل بر این است که در آن جز علوم متناهی به ودیعه گذاشته نشده است. پس ما بررسی کردیم که آیا تعداد آن‌ها برای کسی قابل حصر است؟ با وجود متناهی بودن، از حصر خارج شدند، زیرا در آن جز آنچه از روزی که خداوند عالم را خلق کرد تا زمانی که حال دنیا منقضی شود و آبادانی به آخرت منتقل گردد، نیست.\nپس از کسی که به او در مورد علم به خدا اعتماد دارم، پرسیدم: آیا منازل اصلی این علوم که این امام مبین در بر می‌گیرد، قابل حصر هستند؟ گفت: بله. پس آن ثقه امین صادق، که با من عهد کرد نامش را نبرم، به من خبر داد که منازل اصلی علوم که هر یک از آن‌ها شامل کثرتی غیر قابل شمارش است، به عدد صد و بیست و نُه هزار و ششصد نوع از علوم می‌رسد. و هر نوع شامل علوم بسیاری است که به آن‌ها منازل گفته می‌شود.\nاز این ثقه پرسیدم: آیا کسی از خلق خدا به آن‌ها دست یافته و علم به آن‌ها را احاطه کرده است؟ گفت: خیر. سپس تلاوت کرد: وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ (و لشکریان پروردگارت را جز او نمی‌داند). و اگر جنود را جز او نمی‌داند و حق (الحق) منازعی ندارد که این جنود نیاز به مقابله با او داشته باشند، گفتم: تعجب نکن. فَوَرَبِّ السَّمَاءِ وَالْأَرْضِ (پس سوگند به پروردگار آسمان و زمین) آنچه شگفت‌انگیزتر است، وجود دارد. گفتم: آن چیست؟ گفت: آنچه خداوند در حق دو زن از زنان پیامبر (صلی الله علیه و سلم) ذکر کرد. سپس تلاوت کرد: وَإِنْ تَظَاهَرَا عَلَيْهِ فَإِنَّ اللَّهَ هُوَ مَوْلَاهُ وَجِبْرِيلُ وَصَالِحُ الْمُؤْمِنِينَ وَالْمَلَائِكَةُ بَعْدَ ذَلِكَ ظَهِيرٌ (و اگر بر ضد او همدست شوید، پس قطعاً خداوند مولای اوست و جبرئیل و صالح مؤمنان و فرشتگان پس از آن پشتیبان هستند).\nاین از ذکر جنود شگفت‌انگیزتر است. اسرار خداوند عجیب است. هنگامی که این را به من گفت، از خداوند خواستم که مرا بر فایده این مسئله و این عظمت که خداوند خود را در مقابل آن قرار داده و جبرئیل و صالح مؤمنان و ملائکه را، مطلع سازد. پس از آن آگاه شدم و به چیزی به اندازه معرفت آن شاد نشدم. و دانستم که آن دو زن به چه کسی تکیه کرده‌اند و چه کسی آن‌ها را تقویت می‌کند. و اگر خداوند خود را در نصرت ذکر نمی‌کرد، ملائکه و مؤمنان توان مقاومت در برابر آن دو را نداشتند. و دانستم که آن‌ها از علم به خدا و تأثیر در عالم به حدی دست یافته بودند که این قدرت را به آن‌ها داده بود. و این از علمی است که به منزله مکنون است. پس خداوند را بر آنچه عطا کرد، شکر کردم. گمان نمی‌کنم کسی از خلق خدا به آنچه این دو زن تکیه کردند، تکیه کرده باشد. لوط (علیه السلام) می‌گوید: لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلَى رُكْنٍ شَدِيدٍ (ای کاش مرا در برابر شما قدرتی بود یا به پناهگاهی محکم پناه می‌بردم). و او رکن شدید را داشت و نمی‌شناخت.\nپیامبر (صلی الله علیه و سلم) بر این امر شهادت داد و فرمود: «يرحم الله أخي لوطا لقد كان يأوي إلى ركن شديد» (خداوند برادرم لوط را رحمت کند، او به رکن شدیدی پناه می‌برد).\nو عایشه و حفصه آن را شناختند. اگر مردم علم آنچه بر آن بودند را می‌دانستند، معنای این آیه را می‌فهمیدند. و خداوند يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ (حق را می‌گوید و او راه را هدایت می‌کند)."
  },
  "page_count": 10
}