{
  "id": 389,
  "title": {
    "ar": "الباب التاسع والثمانون وثلاثمائة في معرفة منازلة إلى كونك وأ لك كوني",
    "en": "Chapter Three Hundred and Eighty-Nine, Concerning the Gnosis of His Descent into your Being, and that your Being is for Him.",
    "ur": "باب تین سو نواسی: تمہاری ہستی (کون) میں اس کے نزول کی معرفت میں اور یہ کہ تمہاری ہستی (کون) اس کے لیے ہے۔",
    "fa": "باب سیصد و هشتاد و نهم در معرفت نزول او (حق) به سوی هستی تو و اینکه تو هستی من باشی"
  },
  "content": {
    "ar": "## «الباب التاسع والثمانون وثلاثمائة في معرفة منازلة إلى كونك وأ لك كوني»\n\n\n> إلي منك الدنو وقتا *** وثم وقتا إليك مني‏\n\n\n> أخذت عنك العلوم فضلا *** وأنت أيضا أخذت عني‏\n\n\n> إنيتي فيك يا حبيبي *** إذا يقول اللسان إني‏\n\n\n> ما أصعب القول منك عندي *** إذ يقول الفؤاد صلني‏\n\n\n> ولم أغب عنه إذ تجلى *** ولو دري لاشتهى التمني‏\n\n\n### [مقام قاب قوسين‏]\n\n\nقال الله تعالى ثُمَّ دَنا فَتَدَلَّى فهذه عين المنازلة لأن كل صورة منهما فارقت مكانها فكانت كل صورة من الأخرى أدنى من قاب قوسين لكل واحدة من الصورتين قوس أظهر التقويس والفرقان بين الصورتين الخط الذي قسم الدائرة بنصفين فكان الأمر عينا واحدة ثم ظهر بالصورة أمران فلما صار الحكم أمرين كان من الأمر الواحد تدليا لأن العلو كان له وفي عين هذا التدلي دنو من الأمر الآخر وكان من الآخر تدان إلى من تدلى إليه فكان دنوه عروجا لأن تدلى الأمر الآخر إليه أعلمنا أن السفل كان قسم هذا الآخر وما تدانى كل واحد من الآخر إلا ليرجع الأمر كما كان دائرة واحدة لا فصل بين قطريها فكلاهما يسعيان في إزالة الخط الذي أوجب التقسيم في الدائرة فموضع التقسيم قوله‏\n\n\nقسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ولعبدي ما سأل‏\n\n\nوما للعبد سؤال إلا إزالة هذه القسمة حتى يعود الأمر كما كان فأجابه الحق إلى سؤاله بقوله ولعبدي ما سأل فقال وإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ‏\n\n\n> فتدليه دنو *** وتدانينا عروج‏\n\n\n> وافترقنا واجتمعنا *** إننا زوج بهيج‏\n\n\n> حدثت حين افترقنا *** في سمائها بروج‏\n\n\n> ولها من أجل كوني *** في ذواتنا فروج‏\n\n\n> فنكاح مستمر *** وولوج وخروج‏\n\n\n### «و من ذلك»\n\n\n> فكان منه التدلي *** وكان مني التداني‏\n\n\n> حتى أراه بعيني *** كما يقول يراني‏\n\n\nولما التقينا عن حب واشتياق خاطبني من أعلم في سرى‏\n> اجعل يديك على الكبد *** تجد الذي منكم أجد\n\n\n> وأبرح إلى طلب الوصال *** وقل له هبني وزد\n\n\n> لو لا وجود العلم فيه *** ما تذكر من عبد\n\n\n> فإن أنكروا هذا فقل *** إن القرآن بذا ورد\n\n\nقال الله عز وجل هذا بَلاغٌ لِلنَّاسِ فخص طائفة بالتعيين ولِيُنْذَرُوا به فعين طائفة أخرى ولِيَعْلَمُوا أَنَّما هُوَ إِلهٌ واحِدٌ فعين طائفة أخرى ولِيَتَذَكَّرَ أُولُوا الْأَلْبابِ فعيننا وهؤلاء هم الذين ذكرناه وهم العلماء بالله وبالأمر على ما هو عليه فلم يكن الخط الذي قسم الدائرة إلا عين تميزي عنه وتميزه عني من الوجه الذي كان به إلها وكنت به عبدا فلما تحقق التمييز ووقع الانفصال بالتكوين وأظهر الخط حكمه ووصفنا بالحجاب عنه ووصف نفسه بحجب الأنوار والظلم عنا وشرع لنا ما شرع وأمرنا بالإنابة إليه ووصف نفسه بالنزول إلينا علمنا أنه يريد رجوع الأمر إلى ما كان عليه بعد علمنا بما قد علمنا وتحققنا بما به تحققنا قال عن نفسه إنه سمعنا الذي نسمع به وبصرنا الذي نبصر به وذكر لنا جميع القوي التي نجدها من نفوسنا وأثبت في هذا الوصل أعياننا فلا يشبه ما رجع الأمر إليه ما كان عليه قبل الفصل لأن الذي أثبته الخط من الحكم ما يزول وإن زال الخط فأثره باق لأنا قد علمنا إن الدائرة قابلة للقسمة بلا شك ولم نكن نعلم ذلك قبل فإذا اتصلت الدائرة فلا يزول العلم منا أنها ذات قسمين من أي جزء فرضته فيها وإنما تقبلها من أي حد فرضته فيها لما ورد في الأخبار الإلهية من اتصاف الحق تعالى بصفات الخلق واتصاف الخلق بصفات الحق كما قال تعالى قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى‏ فإن قلت الرحمن سميته بجميع الأسماء الحسنى وإن قلت الله سميته بجميع الأسماء الحسنى وكذلك تقول الخلق الذي هو العالم يقبل أسماء الحق وصفاته وكذلك الحق يقبل صفات الخلق لا أسماءه بالتفصيل ولكن يقبلها بالإجمال فقبوله بالإجمال مثل قوله يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله وكونه لا يقبل أسماء العالم بالتفصيل فأعني بذلك الأسماء الإعلام وهو قوله قُلْ سَمُّوهُمْ يريد الأسماء الأعلام وما عدا الأسماء الأعلام فيقبلها الحق على التفصيل فإن الحق ما له اسم علم لا يدل على معنى سوى ذاته فكل أسمائه مشتقة تنزلت له منزلة الأعلام ولهذا وقع الاشتراك بالتفصيل في أسماء الحق ولم يقع الاشتراك بالتفصيل في أسماء العالم فتحقق ما نبهنا عليه فأعظم ما أخذه من صفاتنا الذي يدل الدليل على إحالته ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ فما كان بعد هذا فهو أهون من تحوله في الصور وغير ذلك وعلى الحقيقة فكلها نعوته وأعظم من أخذنا نحن منه علمنا به الذي يحيله الدليل وهو قوله لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وقول رسول الله صَلَّى اللهُ عَليهِ وسَلَّم من عرف نفسه عرف ربه‏\n\n\nفأخذنا عنه وأخذ عنا\n\n\n> فيا حيرة أبدت حقائق كونه *** ويا خيبة للعبد حين تفوته‏\n\n\n> فمن كان أحياه يحير ذاته *** ومن لم يحر فيه فعنه يميته‏\n\n\n> إذا كان قوت الخلق كونا محققا *** فإله الحق للعبد قوته‏\n\n\nقيل لسهل بن عبد الله ما القوت قال الله‏\n\n\n### [الإل بكسر الهمزة هو الله تعالى‏]\n\n\nواعلم أن الإل بكسر الهمزة هو الله تعالى والإل أيضا العهد بكسر الهمزة فقوله إلى كونك أي الوهتي ما ظهرت إلا بك فإن المألوه هو الذي جعل في نفسه وجود الإله ولهذا\n\n\nقال من عرف نفسه عرف ربه‏\n\n\nفمعرفتك بالله أنه أهلك أنتجته معرفتك بذاتك ولذلك ما أحالك الله في العلم به إلا عليك وعلى العالم فكل ما ثبت لله تعالى من الأحكام ما ثبت إلا بالعالم فعين الإل من حيث عينه هو الموصوف بهذه الأحكام فلو ارتفع العالم من الذهن ارتفعت الأحكام الإلهية كلها وبقي العين بلا حكم وإذا بقي بلا حكم وإن كان واجب الوجود لذاته لم يلزم أن يكون له حكم الألوهة فوجود أعياننا من وجوده ووجودنا أثبت العلم به في ذواتنا ولو لا إن ذاته أعطت وجودنا ما صح لنا وجود عين وهذا معنى قول العلماء إن العالم استفاد الوجود من الله وأما قوله أ لك كوني فهو عين قوله كنت سمعه وبصره فجعل هويته عين مسمى سمعنا وقوانا وليس العالم إلا بهذا الحكم‏\n\n\n> فإن فنيت لم أكن *** وإن بقيت لم أكن‏\n\n\n> فكلنا لكنا *** وكلنا من قول كن‏\n\n\n> منا ومنه فاعتبر *** تجده فيك يستكن‏\n\n\n> فاستره لا تظهره *** كما أتى في لم يكن‏\n\n\n> فيها بدت مشرقة *** شمس له ما قد سكن‏\n\n\n> فما لنا سواه من *** مستند ومن سكن‏\nفالحق مصرف العالم والعالم مصرف الحق أ لا تراه يقول أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ أ ليست الإجابة تصريفا هل يتصور إجابة من غير نداء وسؤال لا يصح أن يتصرف في نفسه فما له تصرف إلا فينا فتصرفه إيجاده إيانا دائما فأعيان تظهر وأحكام له تحدث وتعلقات لا تنكر\n\n\n> فإن قلت أنا واحد كنت صادقا *** وإن قلت لسنا واحدا لم تكذب‏\n\n\nفيا ليت شعري من يجهل وما ثم إلا الله فالكل عالم بما لا يعلمه ثم يعلمه ولَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ وقد ظهر بعض رشح من هذا المشهد على طائفة من أصحاب النظر لا يعرف من أين جاءهم ذلك فحكى عنهم أنهم يقولون إن الله لا يعلم نفسه لأن العلم بالشي‏ء يقتضي الإحاطة بالمعلوم وهو لا يتناهى وجوده ووجوده عين ماهيته ليس غيرها وما لا يتناهى لا يكون محاطا به إلا أنه لا يتناهى وأحاط علما به أنه لا يتناهى لا له ولا للعالم وهذا وإن كان قولا فاسدا فإن له وجها إلى الصحة وذلك أنه لا يعلم نفسه على جهة الإحاطة بل يعلم نفسه أنها لا تقبل الإحاطة كما يعلم الممكنات وجميع المقدورات أنها لا تتناهى فانظر في هذا الرش من هذا البحر الغمر كيف أثر في العالم نحلة ظهرت في العين وبدت إلى عالم الكون حتى سطرت في الدفاتر وسارت بها الركبان وتسامر بها العلماء وما ثم قائل إلا الله ولا منطق إلا الله وما بقي إلا فتح عين الفهم لتنطق الله من حيث إنه لا ينطق إلا بالصواب فكل كلام في العالم فهو إما من الحكمة أو من فصل الخطاب فالكلام كله معصوم من الخطاء والزلل إلا أن للكلام مواطن ومحال وميادين له فيها مجال رب تتسع ميادينه بحيث أن تنبو عن إدراك غايتها عيون البصائر\n\n\n> فينطق حين ينطق بالصواب *** على ما يقتضي فصل الخطاب‏\n\n\n> وترجع حسرا أبصار قوم *** عموا فيها عن الأمر العجاب‏\n\n\nفإذا أردت السبيل إلى فهم هذه المعاني فتعمل في تكثير النوافل التي لها أصل في الفرائض وإن تمكن لك أن تكثر من نوافل النكاح فإنه أعظم فوائد نوافل الخيرات لما فيه من الازدواج والإنتاج فتجمع بين المعقول والمحسوس فلا يفوتك شي‏ء من العالم\n\n\nالصادر عن الاسم الظاهر والباطن فيكون اشتغالك بمثل هذه النافلة أتم وأقرب لتحصيل ما ترومه من ذلك فإذا فعلت هذا أحبك الحق وإذا أحبك غار عليك أن تشهدك عين أو يقيدك كون فأدخلك في حمى حرمه وجعلك من جملة أحبابه وأهلك له فصرت له أهلا كما\n\n\nقال في الحديث في أهل القرآن إنهم أهل الله وخاصته خرج ذلك الترمذي في منصفه‏\n\n\nوإذا أتخذك أهلا جعلك محلا لإلقائه وعرشا لاستوائه وسماء لنزوله وكرسيا لقدميه فظهر لك فيك منه ما لم تره مع كونه فيك وهو قوله تعالى فَلا تَعْلَمُ نَفْسٌ ما أُخْفِيَ لَهُمْ من قُرَّةِ أَعْيُنٍ لأن جنوبهم تجافت عن المضاجع الطبيعية وصاروا أهلا للموارد الإلهية والشوارد الربانية فمياههم عذبة صافية وعروشهم عن كل ما سوى ما يلقي الله إليهم خاوية آبارهم معطلة وأبوابهم مقفلة وقصورهم مشيدة ضاعت مفاتح أقفالها وتقطعت حبال آبارها فتنظر إلى مياهها ولا تذاق فتستحسن على جهالة فإذا سردت أخبارها قرآنا ظهر إعجازها فلم يستطع أحد معارضتها فيستحليها فإذا سئل عن معانيها لا يدري ما يقول إذ لا ذوق له فيها إلا ما أعطاه الشهود فغايته أن يقول إِنْ هذا إِلَّا سِحْرٌ يُؤْثَرُ لاختلاط ضوئه بظلمته تشبيها بسحر الليل وبالسحر الذي يخرج الهواء الحار ويسوق الهواء البارد لتبقى بذلك الحياة على هيكل الحيوان فلا يدري الناظر فيه أي وجه يستقبل به فإنه مهما أقبل على وجه أعرض عن الآخر إلا أن يكون نبيا فيرى من خلفه كما يرى من أمامه فيكون وجها كله وذلك هو المعبر عنه بالذوق الذي يكون عنه حقيقة الاشتياق والشوق فما ينطق عن هوى إِنْ هُوَ إِلَّا وَحْيٌ يُوحى‏ علمه ذو القوة المتين في صورة شديد القوي ف ما هُوَ عَلَى الْغَيْبِ بِضَنِينٍ وما هُوَ بِقَوْلِ شَيْطانٍ رَجِيمٍ فإنه من عين القرب أخبر لأنه من دَنا فَتَدَلَّى فَكانَ كما تقدم قابَ قَوْسَيْنِ أَوْ أَدْنى‏ وما هو من مرجمات الظنون كما يقولون في أصحاب الكهف الفتية المعلومة ثَلاثَةٌ رابِعُهُمْ كَلْبُهُمْ ويَقُولُونَ خَمْسَةٌ سادِسُهُمْ كَلْبُهُمْ رَجْماً بِالْغَيْبِ يقول ما هو علي تحقيق فيما يخبرون به من عددهم هذا رجم في العدد وأين أنت لو أخذوا في حقيقة المعدود لخاضوا وما حصلوا على طائل‏\nأ لا ترى إلى قوله تعالى لنبيه صَلَّى اللهُ عَليهِ وسَلَّم الذي ليس من شأنه ولا من شأن الأنبياء عليه السلام إن ينهزم ولا إن يقتل في مصاف لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِراراً ولَمُلِئْتَ مِنْهُمْ رُعْباً فوصفه بالانهزام وقوله صدق أ لا ترى ذلك عن رؤيته أجسامهم أ ليسوا أناسا مثله فما ينهزم إلا من أمر يريد إعدامه ولا يملأ مع شجاعته وحماسته رعبا إلا من شي‏ء يهوله فلو لم ير منهم ما هو أهول مما رآه ليلة إسرائه ما امتلأ رعبا مما رآه وقد رأيناهم وما ملئنا رعبا لأنا ما شهدنا منهم إلا صور أجسامهم فرأيناهم أمثالنا فذلك الذي كان يملؤه رعبا وما ذكر الله إلا رؤية عينهم لأنه قال لَوِ اطَّلَعْتَ عَلَيْهِمْ فوصفه بالاطلاع فهم أسفل منه بالمقام ومع هذا كان يولي منهم فرارا خوفا أن يلحق بهم فينزل عن مقامه ويملأ منهم رعبا لئلا يؤثروا فيه كما قلنا من تأثير الأدنى في الأعلى‏\n\n\nكقوله صَلَّى اللهُ عَليهِ وسَلَّم رب ضاحك مل‏ء فيه لا يدري أرضى الله أم أسخطه‏\n\n\nوقال ذلِكَ بِأَنَّهُمُ اتَّبَعُوا ما أَسْخَطَ الله ومن علم الأمر على هذا حقيق عليه أن يولي فرارا ويملأ رعبا هل رأيتم عاقلا يقف على جرف مهواة إلا ويفر خوفا من السقوط فانظر فيما تحت هذا النعت الذي وصف الله به نبيه لو اطلع على الفتية مع علو رتبتهم وشأنهم فعلوه أعلى ورتبته أسنى فعرفنا بذلك ينهنا على علو رتبة نبينا محمد صَلَّى اللهُ عَليهِ وسَلَّم فأعيان الفتية كانت المشهودة لنا ولم نول ولا ملئنا رعبا وأعيان الفتية لو اطلع عليهم نبينا لولى فرارا منهم ولملئ رعبا فانظر إلى ما ذا ترجع صور العالم هل لأنفسهم أو لرؤية الناظر وتدبر ما قلناه كما تعلم قطعا إن حبال السحرة وعصيهم في عينها حبال وعصى وفي نظرنا حيات فهي عين الحيات وهي عين العصي والحبال فانظر ما ترى‏\n\n\n### [إن الله ينكر بالرؤية ولا ينكر بالعلم‏]\n\n\nواعلم ما تنظر وكن بحيث تعلم لا بحيث ترى فإن الله ينكر بالرؤية ولا ينكر بالعلم فإذا لم ينكر بالرؤية فبشاهد العلم لم ينكر والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏\n\n",
    "en": "Chapter Three Hundred and Eighty-Nine: On the Gnosis of His Descent to Your Existence and Your Existence for Him\n\nTo me is the drawing near from You at one time,\nAnd then at another time, to You is the drawing near from me.\n\nI received the sciences from You as a grace,\nAnd You also received from me.\n\nMy I-ness (إنيتي) is in You, O my Beloved,\nWhen the tongue says, \"I.\"\n\nHow difficult is the saying from You to me,\nWhen the heart says, \"Join me.\"\n\nI was not absent from Him when He manifested (تجلى),\nAnd if He knew, He would desire the wish.\n\n### The Station of Two Bow-lengths (مقام قاب قوسين)\n\nAllah the Exalted said: <<ثُمَّ دَنا فَتَدَلَّى>> (Then he drew near and descended) [Quran 53:8]. This is the very essence of the mutual descent (منازلة), because each of the two forms departed from its place, so that each form was nearer to the other than two bow-lengths (قاب قوسين). For each of the two forms there is a bow that manifests the curvature. The distinction between the two forms is the line that divided the circle into two halves.\n\nThus, the Matter (الأمر) was a single Essence (عين واحدة), but then two matters appeared through the form. When the ruling became two matters, the descent (تدليا) came from the Single Matter, because the height (العلو) belonged to it. And in the very essence of this descent, there was a drawing near (دنو) to the Other Matter. And from the Other, there was a drawing near (تدان) to the one who descended to it, so its drawing near was an ascent (عروجا), because the descent of the Other Matter to it informed us that the lower realm (السفل) was the portion of this Other.\n\nNeither of them drew near to the other except for the Matter to return to what it was: a single circle with no separation between its two diameters. Both strive to remove the line that necessitated the division in the circle. The point of division is His saying:\n\n\"I have divided the prayer between Myself and My servant into two halves: half is for Me, and half is for My servant, and My servant shall have what he asks.\"\n\nThe servant’s only request is the removal of this division so that the Matter returns to what it was. The Real (الحق) answered his request with His saying: \"And My servant shall have what he asks.\" Then He said: <<وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ>> (And to Him shall the whole matter be returned) [Quran 11:123].\n\nSo His descent is a drawing near,\nAnd our drawing near is an ascent.\n\nWe separated and we gathered;\nIndeed, we are a joyful pair.\n\nWhen we separated, constellations appeared in its heaven,\nAnd because of my existence (كوني), there are openings in our essences (ذواتنا).\n\nSo it is a continuous marriage,\nAnd an entering and an exiting.\n\n### And from that\n\nSo the descent was from Him,\nAnd the drawing near was from me,\n\nUntil I see Him with my eye,\nJust as He says, \"He sees me.\"\n\nWhen we met out of love and longing, He who knows spoke to me in my secret heart:\n\nPlace your hands upon the liver/heart,\nYou will find what I find from you.\n\nAnd move forth seeking union,\nAnd say to Him, \"Grant me and increase me.\"\n\nWere it not for the existence of Knowledge (العلم) in Him,\nNo servant would be remembered.\n\nIf they deny this, then say:\n\"Indeed, the Quran came with this.\"\n\nAllah Almighty said: <<هَذَا بَلَاغٌ لِلنَّاسِ>> (This is a message for mankind) [Quran 14:52], thereby designating one group; <<وَلِيُنْذَرُوا بِهِ>> (and that they may be warned thereby), designating another group; <<وَلِيَعْلَمُوا أَنَّمَا هُوَ إِلَهٌ وَاحِدٌ>> (and that they may know that He is but one God), designating a third group; and <<وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ>> (and that those of understanding [أُولُو الْأَلْبَابِ] may remember), designating us. These are the ones we mentioned, who are the Gnostics (العلماء) of Allah and of the Matter (الأمر) as it truly is.\n\nThe line that divided the circle was nothing but the very essence of my distinction (تميزي) from Him and His distinction from me, in the aspect by which He was God (إلها) and I was a servant (عبدا). When this distinction was realized and separation occurred through creation (التكوين), and the line manifested its ruling, and we were described by the veil (الحجاب) from Him, and He described Himself by veiling the lights and darknesses from us, and He legislated for us what He legislated, and commanded us to turn back to Him, and described Himself by descending to us—we knew that He desires the return of the Matter to what it was, after our knowledge of what we have known and our realization of what we have realized.\n\nHe said of Himself that He is our hearing by which we hear and our sight by which we see. He mentioned all the faculties (القوي) that we find in our souls and established our Fixed Entities (أعياننا) in this connection.\n\nThus, the state to which the Matter returns does not resemble what it was before the separation, because the ruling established by the line does not vanish, even if the line itself vanishes; its effect remains. This is because we have certainly known that the circle is capable of division, and we did not know that before. So, even when the circle is connected, the knowledge that it possesses two halves, from whatever part you assume it, does not depart from us.\n\nIt accepts this division from whatever boundary you assume in it, due to what is mentioned in the Divine reports (الأخبار الإلهية) concerning the Real (الحق) being qualified by the attributes of creation (الخلق) and creation being qualified by the attributes of the Real. As the Exalted said: <<قُلِ ادْعُوا اللهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَى>> (Say: \"Call upon Allah or call upon the All-Merciful [الرَّحْمَنَ]. Whichever you call upon, to Him belong the Most Beautiful Names [الْأَسْمَاءُ الْحُسْنَى].\") [Quran 17:110]. If you say *al-Rahman*, you have named Him with all the Most Beautiful Names. If you say *Allah*, you have named Him with all the Most Beautiful Names.\n\nSimilarly, you say that creation (الخلق), which is the World (العالم), accepts the Names and Attributes of the Real. Likewise, the Real accepts the attributes of creation, though not its names in detail, but accepts them in summary. His acceptance in summary is like His saying: <<يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللهِ>> (O mankind, you are the needy [الْفُقَرَاءُ] toward Allah) [Quran 35:15]. As for His not accepting the names of the World in detail, I mean by that the proper names (الأسماء الإعلام), which is His saying: <<قُلْ سَمُّوهُمْ>> (Say: \"Name them\") [Quran 13:33], meaning the proper names. But everything other than the proper names, the Real accepts in detail. For the Real has no proper name that indicates a meaning other than His Essence (ذاته). All His Names are derived (مشتقة) and have descended to the status of proper names for Him. This is why the detailed sharing occurred in the Names of the Real, but detailed sharing did not occur in the names of the World. Realize what we have drawn attention to.\n\nThe greatest thing He took from our attributes, which the rational proof indicates is impossible for Him, is: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know) [Quran 47:31]. What comes after this is easier than His transformation into forms and other things. In reality, all of them are His descriptions (نعوته). And the greatest thing we took from Him is our Knowledge (علمنا) of Him, which the rational proof deems impossible, namely His saying: <<لَيْسَ كَمِثْلِهِ شَيْءٌ>> (There is nothing whatever like unto Him) [Quran 42:11], and the saying of the Messenger of Allah (may Allah bless him and grant him peace): \"Whoever knows his self knows his Lord.\"\n\nSo we took from Him, and He took from us.\n\nO astonishment that revealed the realities of His existence (كونه),\nAnd O disappointment for the servant when it escapes him!\n\nWhoever He brought to life, He astonishes his Essence (ذاته),\nAnd whoever is not astonished in Him, He causes him to die away from Him.\n\nIf the sustenance (قوت) of creation is a realized existence,\nThen the God of the Real is the servant's sustenance.\n\nSahl ibn Abdullah was asked, \"What is sustenance?\" He said, \"Allah.\"\n\n### Al-Il (الإل), with a kasra on the hamza, is Allah the Exalted\n\nKnow that *al-Il* (الإل), with a *kasra* on the *hamza*, is Allah the Exalted. *Al-Il* also means the covenant (العهد), with a *kasra* on the *hamza*. So His saying, \"to your existence (كونك),\" means: My Divinity (الوهتي) did not manifest except through you, for the worshipped (المألوه) is the one who establishes the existence of the God (الإله) within himself. This is why He said: \"Whoever knows his self knows his Lord.\"\n\nYour Gnosis (معرفتك) of Allah, that He is your God, is produced by your Gnosis of your own Essence (ذاتك). Therefore, Allah did not refer you, in the Knowledge (العلم) of Him, except to yourself and to the World (العالم). Every ruling (الأحكام) established for Allah the Exalted is established only through the World. The very Essence (عين) of *al-Il*, in terms of its specific reality, is the one described by these rulings. If the World were removed from the mind, all the Divine rulings would be removed, and the Essence would remain without a ruling. If it remains without a ruling, even though it is Necessary of Existence (واجب الوجود) by its Essence, it is not necessarily subject to the ruling of Divinity (الألوهة).\n\nThe existence of our Fixed Entities (أعياننا) comes from His Existence (وجوده), and our existence establishes the Knowledge of Him in our essences (ذواتنا). Were it not that His Essence granted our existence, the existence of an entity would not be valid for us. This is the meaning of the scholars' saying that the World benefited Existence (الوجود) from Allah.\n\nAs for His saying, \"Your existence (كوني) for Him (أ لك),\" this is the very essence of His saying, \"I was his hearing and his sight.\" Thus, He made His Ipseity (هويته) the very designation of our hearing and our faculties (قوانا). The World is nothing but this ruling.\n\nIf I am annihilated (فنيت), I am not;\nAnd if I subsist (بقيت), I am not.\n\nAll of us are for You,\nAnd all of us are from the word 'Be' [كن].\n\nFrom us and from Him, so reflect;\nYou will find Him dwelling secretly within you.\n\nSo conceal Him, do not manifest Him,\nAs it came in 'He was not' [لم يكن].\n\nIn it appeared shining,\nA sun for Him, what had been quiescent.\n\nWe have none besides Him\nAs a support (مستند) or a dwelling (سكن).\n\nThe Real (الحق) is the disposer of the World (العالم), and the World is the disposer of the Real. Do you not see Him say: <<أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ>> (I answer the call of the caller when he calls upon Me)? [Quran 2:186]. Is not the answering a disposal (تصريفا)? Can an answer be conceived without a call and a request? He cannot dispose of Himself, so He has no disposal except in us. His disposal is His continuous bringing us into existence. Thus, entities (أعيان) appear, rulings (أحكام) for Him arise, and dependencies (تعلقات) are undeniable.\n\nIf you say, \"I am one,\" you are truthful;\nAnd if you say, \"We are not one,\" you do not lie.\n\nOh, would that I knew who is ignorant, when there is nothing there but Allah! Everyone knows what he does not know, and then he knows it: <<وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ>> (And We will surely test you until We know).\n\nA certain seepage (رشح) from this spiritual Witnessing (المشهد) has appeared among a group of speculative thinkers (أصحاب النظر), who do not know where it came from. It is related that they say that Allah does not know Himself, because knowledge of a thing necessitates encompassing the known (الإحاطة بالمعلوم), and His Existence (وجوده) is infinite (لا يتناهى). His Existence is the very Essence (عين ماهيته) of His Quiddity, not other than it. What is infinite cannot be encompassed, except that He is infinite, and He encompasses with Knowledge (علما) that He is infinite, neither for Himself nor for the World.\n\nAlthough this is a corrupt saying (قولا فاسدا), it has an aspect of soundness. This is that He does not know Himself by way of encompassing (الإحاطة), but rather He knows Himself as not accepting encompassment, just as He knows the possibilities (الممكنات) and all the determined things (المقدورات) as infinite.\n\nLook at how this seepage from this overwhelming sea has affected the World (العالم), resulting in a doctrine (نحلة) that appeared in the Entity (العين) and became manifest in the realm of existence (عالم الكون), until it was written down in ledgers, traveled by riders, and discussed by scholars. There is no speaker but Allah, and no logic but Allah. All that remains is the opening of the eye of understanding (عين الفهم) so that Allah may speak, since He speaks nothing but the truth (الصواب). Every speech in the World is either from Wisdom (الحكمة) or from decisive discourse (فصل الخطاب). All speech is protected from error and slip, but speech has stations, places, and fields where it has scope. Sometimes its fields are so vast that the eyes of insight (عيون البصائر) fall short of grasping their goal.\n\nSo He speaks, when He speaks, with the truth,\nAccording to what decisive discourse necessitates.\n\nAnd the sights of a people return weary,\nWho were blind therein to the wondrous Matter.\n\nIf you desire the path to understanding these meanings, then strive to increase the supererogatory acts (النوافل) that have an origin in the obligatory duties (الفرائض). If you are able, increase the supererogatory acts of marriage (نوافل النكاح), for it is the greatest benefit among the supererogatory good deeds, due to the coupling (الازدواج) and production (الإنتاج) it contains. Thus, you combine the intelligible (المعقول) and the sensible (المحسوس), and nothing of the World that issues from the Name the Manifest (الظاهر) and the Name the Hidden (الباطن) escapes you. Your engagement in such a supererogatory act will be the most complete and nearest way to achieve what you seek from that.\n\nIf you do this, the Real (الحق) will love you. And when He loves you, He becomes jealous over you, lest any entity (عين) witness you or any existence (كون) restrict you. So He admits you into the sanctuary of His protection (حمى حرمه) and makes you one of His beloved and His own people (أهلك له). Thus, you become worthy of Him, as He said in the Hadith concerning the People of the Quran: \"They are the people of Allah and His chosen ones (خاصته).\" Al-Tirmidhi recorded this in his *Musannaf*.\n\nWhen He takes you as His people, He makes you a locus for His bestowal (إلقائه), a Throne (عرشا) for His establishment (استوائه), a Heaven (سماء) for His descent (نزوله), and a Footstool (كرسيا) for His feet. Thus, there appears to you, within you, something of Him that you did not see, despite its being within you. This is His saying, the Exalted: <<فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ>> (No soul knows what has been hidden for them of comfort for eyes) [Quran 32:17].\n\nThis is because their sides have forsaken their natural resting places (المضاجع الطبيعية), and they have become worthy of the Divine Influxes (الموارد الإلهية) and the Lordly Fugitives (الشوارد الربانية). Their waters are sweet and pure, and their thrones are empty of everything except what Allah casts upon them. Their wells are abandoned, their doors are locked, and their palaces are built high, but the keys to their locks are lost, and the ropes to their wells are cut.\n\nYou look at their waters, but they are not tasted, so they are admired out of ignorance. When their reports are recited as Quran, their miraculous nature (إعجازها) appears, and no one can oppose them, so he finds them sweet. But if he is asked about their meanings, he does not know what to say, for he has no direct taste (ذوق) of them except what the Witnessing (الشهود) granted him. His utmost is to say: <<إِنْ هَذَا إِلَّا سِحْرٌ يُؤْثَرُ>> (This is nothing but magic related [from others]) [Quran 74:24], due to the mixing of its light with its darkness, likened to the magic of the night, and to the magic that expels hot air and drives cold air so that life remains upon the structure of the animal.\n\nThe observer does not know which face to approach it with, for whenever he turns toward one face, he turns away from the other, unless he is a Prophet (نبيا), who sees behind him as he sees in front of him, so that he is entirely a face. That is what is expressed by the Taste (الذوق) from which the reality of longing (الاشتياق) and yearning (الشوق) arises.\n\nHe does not speak from caprice: <<إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى>> (It is nothing but a revelation revealed) [Quran 53:4], taught to him by the Possessor of Mighty Power (ذو القوة المتين) in the form of the intensely strong (شديد القوي). <<وَمَا هُوَ عَلَى الْغَيْبِ بِضَنِينٍ>> (Nor is he stingy with the unseen) [Quran 81:24], and <<وَمَا هُوَ بِقَوْلِ شَيْطَانٍ رَجِيمٍ>> (Nor is it the word of a rejected devil) [Quran 81:25]. He informed from the very Essence (عين) of Proximity, because he is the one who <<دَنَا فَتَدَلَّى فَكَانَ>> (drew near and descended, and was), as preceded, <<قَابَ قَوْسَيْنِ أَوْ أَدْنَى>> (two bow-lengths or nearer) [Quran 53:9].\n\nAnd it is not from the conjectures of the unseen (مرجمات الظنون), as they say concerning the Companions of the Cave (أصحاب الكهف), the known youths: <<ثَلَاثَةٌ رَابِعُهُمْ كَلْبُهُمْ>> (Three, their fourth being their dog), and <<وَيَقُولُونَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًا بِالْغَيْبِ>> (And they say, \"Five, their sixth being their dog\"—guessing at the unseen) [Quran 18:22]. He says: \"It is not based on verification concerning the number they report.\" This is a conjecture regarding the number. Where would you be if they had delved into the reality of the counted? They would have plunged in and gained nothing of value.\n\nDo you not see the saying of the Exalted to His Prophet (may Allah bless him and grant him peace)—who is not characterized, nor are the Prophets (peace be upon them) characterized, by fleeing or being killed in battle—<<لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِرَارًا وَلَمُلِئْتَ مِنْهُمْ رُعْبًا>> (Had you looked upon them, you would have turned from them in flight and been filled by them with terror)? [Quran 18:18].\n\nHe described him with flight, and His saying is true. Did he not see this from seeing their physical bodies? Are they not human beings like him? One only flees from something that seeks to annihilate him, and one is only filled with terror, despite his courage and zeal, by something that horrifies him. Had he not seen something in them more terrifying than what he saw on the Night of his Ascent (الإسراء), he would not have been filled with terror by what he saw. We saw them, and we were not filled with terror, because we only witnessed the forms of their bodies and saw them as our equals.\n\nTherefore, that which would fill him with terror was not mentioned by Allah except as the sight of their very essence (رؤية عينهم), because He said: <<لَوِ اطَّلَعْتَ عَلَيْهِمْ>> (Had you looked upon them), describing him with looking upon them. They are lower than him in station (المقام), yet despite this, he would have turned from them in flight, fearing that he might join them and descend from his station, and he would have been filled with terror by them, lest they influence him, as we said regarding the influence of the lower upon the higher.\n\nLike his saying (may Allah bless him and grant him peace): \"Perhaps a person laughs filling his mouth, not knowing whether Allah is pleased with him or angry with him.\"\n\nAnd He said: <<ذَلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ>> (That is because they followed what angered Allah) [Quran 47:28]. Whoever knows the Matter (الأمر) in this way is truly bound to turn in flight and be filled with terror. Have you ever seen a sane person stand on the edge of a precipice without fleeing for fear of falling?\n\nLook into what lies beneath this description with which Allah described His Prophet had he looked upon the youths. Despite the high rank and status of the youths, his height is higher and his rank is loftier. By this, He warns us about the high rank of our Prophet Muhammad (may Allah bless him and grant him peace). The Fixed Entities (أعيان) of the youths were witnessed by us, and we did not flee nor were we filled with terror. Yet, if our Prophet had looked upon the Fixed Entities of the youths, he would have turned from them in flight and been filled with terror.\n\nConsider, then, to what do the forms of the World return? To their own selves, or to the vision of the observer? Ponder what we have said, just as you know with certainty that the ropes and staffs of the sorcerers are, in their essence (عينها), ropes and staffs, but in our sight, they are snakes. Thus, they are the very essence of snakes, and they are the very essence of staffs and ropes. Look at what you see.\n\n### Indeed, Allah is denied by sight, but not denied by Knowledge\n\nKnow what you look at, and be where you know, not where you see. For Allah is denied by sight (الرؤية) but not denied by Knowledge (العلم). If He is not denied by sight, then by the witness of Knowledge, He is certainly not denied. <<وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (And Allah speaks the Truth, and He guides to the Way) [Quran 33:4].",
    "ur": "باب نمبر تین سو نواسی: تمہاری ہستی کی طرف اس کے نزول اور تمہاری ہستی اس کے لیے ہونے کی معرفت میں\n\n> ایک وقت ہے کہ تیرا قرب میری طرف ہے\n> اور پھر ایک وقت ہے کہ میرا قرب تیری طرف ہے\n> میں نے تجھ سے علوم فضل کے طور پر لیے\n> اور تو نے بھی مجھ سے لیے\n> اے میرے محبوب! میری انیت (میں ہونا) تجھ میں ہے\n> جب زبان کہتی ہے کہ \"میں\"\n> میرے نزدیک تیری طرف سے قول کتنا مشکل ہے\n> جب دل کہتا ہے کہ \"مجھ سے وصل کر\"\n> میں اس سے غائب نہ ہوا جب اس کا ظہور الٰہی (التجلی) ہوا\n> اور اگر وہ جانتا تو تمنا کی خواہش کرتا\n\n### [مقام قاب قوسین]\n\nاللہ تعالیٰ نے فرمایا:\n> ثُمَّ دَنا فَتَدَلَّى\n> (پھر وہ قریب ہوا اور جھک آیا)\nیہ عین نزول (منازلة) ہے، کیونکہ ان دونوں صورتوں میں سے ہر ایک نے اپنی جگہ کو چھوڑا، چنانچہ ہر صورت دوسری صورت سے قاب قوسین (قاب قوسين) سے بھی زیادہ قریب ہو گئی، ہر دو صورتوں کے لیے ایک قوس ہے جس نے تقویس (خم) کو ظاہر کیا، اور دونوں صورتوں کے درمیان فرق وہ خط ہے جس نے دائرے کو دو حصوں میں تقسیم کیا۔ پس امر ایک ہی تھا، پھر صورت کے ذریعے دو امر ظاہر ہوئے۔ جب حکم دو امروں میں بدل گیا، تو اس ایک امر کی طرف سے تدلی (نزول) ہوا، کیونکہ بلندی اسی کے لیے تھی، اور اسی تدلی (نزول) میں دوسرے امر کی طرف دنو (قرب) تھا، اور دوسرے کی طرف سے اس کی طرف تدانی (قریب آنا) تھا جس کی طرف نزول ہوا، چنانچہ اس کا دنو (قرب) عروج تھا، کیونکہ دوسرے امر کا اس کی طرف نزول ہمیں یہ بتاتا ہے کہ پستی اس دوسرے کا حصہ تھی۔ اور ان میں سے ہر ایک دوسرے سے قریب نہیں ہوا مگر اس لیے کہ امر پھر سے ایک ہی دائرہ بن جائے جس کے دونوں قطروں کے درمیان کوئی فصل نہ ہو۔ پس وہ دونوں اس خط کو مٹانے کی کوشش کر رہے ہیں جس نے دائرے میں تقسیم کو واجب کیا تھا۔ تقسیم کی جگہ اس کا یہ قول ہے:\n> قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ولعبدي ما سأل\n> (میں نے نماز کو اپنے اور اپنے بندے کے درمیان دو حصوں میں تقسیم کیا، آدھا میرے لیے اور آدھا میرے بندے کے لیے، اور میرے بندے کے لیے وہ ہے جو اس نے مانگا)\nاور بندے کا سوال صرف اس تقسیم کو ختم کرنا ہے تاکہ امر ویسا ہی ہو جائے جیسا پہلے تھا۔ پس ذات حق (الحق) نے اس کے سوال کا جواب اپنے اس قول سے دیا: \"اور میرے بندے کے لیے وہ ہے جو اس نے مانگا۔\" اور فرمایا:\n> وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ\n> (اور تمام امور اسی کی طرف لوٹائے جاتے ہیں)\n\n> پس اس کا نزول (تدلی) قرب ہے\n> اور ہمارا قریب آنا (تدانی) عروج ہے\n> ہم جدا ہوئے اور ہم جمع ہوئے\n> بے شک ہم ایک خوشگوار جوڑا ہیں\n> جب ہم جدا ہوئے تو اس کے آسمان میں برج ظاہر ہوئے\n> اور میری ہستی (کونی) کی وجہ سے\n> ہماری ذاتوں میں شگاف ہیں\n> پس یہ ایک مسلسل نکاح ہے\n> اور دخول و خروج ہے\n\n### «اور اسی میں سے ہے»\n\n> پس اس کی طرف سے نزول (التدلی) تھا\n> اور میری طرف سے قریب آنا (التدانی) تھا\n> یہاں تک کہ میں اسے اپنی آنکھ سے دیکھوں\n> جیسا کہ وہ کہتا ہے کہ وہ مجھے دیکھتا ہے\n\nاور جب ہم محبت اور اشتیاق کے ساتھ ملے، تو جس نے میرے باطن میں علم ڈالا، اس نے مجھ سے مخاطب ہو کر کہا:\n\n> اپنے دونوں ہاتھ جگر پر رکھ\n> تو وہ پائے گا جو میں تم میں پاتا ہوں\n> اور وصل کی طلب میں آگے بڑھ\n> اور اس سے کہہ کہ مجھے عطا کر اور زیادہ کر\n> اگر اس میں علم کا وجود نہ ہوتا\n> تو کوئی بندہ یاد نہ کیا جاتا\n> اور اگر وہ اس کا انکار کریں تو کہہ\n> کہ قرآن میں یہی آیا ہے\n\nاللہ عزوجل نے فرمایا:\n> هَذَا بَلَاغٌ لِلنَّاسِ\n> (یہ لوگوں کے لیے ایک پیغام ہے)\nپس اس نے ایک گروہ کو خاص کیا، اور\n> وَلِيُنْذَرُوا بِهِ\n> (اور تاکہ وہ اس کے ذریعے ڈرائے جائیں)\nپس اس نے ایک دوسرے گروہ کو خاص کیا، اور\n> وَلِيَعْلَمُوا أَنَّمَا هُوَ إِلَهٌ وَاحِدٌ\n> (اور تاکہ وہ جان لیں کہ وہ ایک ہی معبود ہے)\nپس اس نے ایک تیسرے گروہ کو خاص کیا، اور\n> وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ\n> (اور تاکہ عقل والے نصیحت حاصل کریں)\nپس اس نے ہمیں خاص کیا، اور یہ وہی لوگ ہیں جن کا ہم نے ذکر کیا، اور وہ اللہ کی معرفت (المعرفۃ) رکھنے والے اور امر کو جیسا کہ وہ ہے جاننے والے ہیں۔ پس وہ خط جس نے دائرے کو تقسیم کیا، وہ صرف میری اس سے اور اس کی مجھ سے تمیز (امتیاز) کی عین تھا، اس پہلو سے جس سے وہ الٰہ تھا اور میں بندہ تھا۔ پس جب تمیز متحقق ہوئی اور تکوین (تكوين) کے ذریعے انفصال واقع ہوا، اور خط نے اپنا حکم ظاہر کیا، اور ہمیں اس سے حجاب میں رہنے سے موصوف کیا، اور اس نے خود کو انوار اور ظلمتوں کو ہم سے حجاب میں رکھنے سے موصوف کیا، اور ہمارے لیے وہ شریعت مقرر کی جو مقرر کی، اور ہمیں اپنی طرف رجوع کرنے کا حکم دیا، اور خود کو ہماری طرف نزول کرنے سے موصوف کیا، تو ہم نے جان لیا کہ وہ امر کو اسی حالت پر لوٹانا چاہتا ہے جس پر وہ پہلے تھا، اس علم کے بعد جو ہمیں حاصل ہوا اور اس تحقق کے بعد جس سے ہم متحقق ہوئے۔ اس نے اپنے بارے میں فرمایا کہ وہ ہماری سماعت ہے جس سے ہم سنتے ہیں، اور ہماری بصارت ہے جس سے ہم دیکھتے ہیں، اور اس نے ہمیں وہ تمام قوتیں یاد دلائیں جو ہم اپنی جانوں میں پاتے ہیں، اور اس وصل میں ہماری اعیان (ذاتوں) کو ثابت کیا۔ پس جس امر کی طرف وہ لوٹا ہے، وہ اس جیسا نہیں ہے جو فصل سے پہلے تھا، کیونکہ وہ حکم جو خط نے ثابت کیا ہے وہ زائل نہیں ہوتا، اگرچہ خط زائل ہو جائے، لیکن اس کا اثر باقی رہتا ہے۔ کیونکہ ہم نے جان لیا ہے کہ دائرہ بلا شک تقسیم کو قبول کرتا ہے، اور ہم یہ پہلے نہیں جانتے تھے۔ پس جب دائرہ متصل ہو جائے، تو ہم سے یہ علم زائل نہیں ہوتا کہ وہ دو حصوں والا ہے، خواہ تم اسے کسی بھی حصے میں فرض کرو۔ اور وہ اسے کسی بھی حد سے قبول کرتا ہے جو تم اس میں فرض کرو، کیونکہ الٰہی اخبار میں یہ وارد ہوا ہے کہ ذات حق (الحق) تعالیٰ مخلوق کی صفات سے متصف ہوتا ہے اور مخلوق ذات حق (الحق) کی صفات سے متصف ہوتی ہے۔ جیسا کہ اللہ تعالیٰ نے فرمایا:\n> قُلِ ادْعُوا اللَّهَ أَوِ ادْعُوا الرَّحْمَنَ أَيًّا مَا تَدْعُوا فَلَهُ الْأَسْمَاءُ الْحُسْنَى\n> (کہہ دو کہ اللہ کو پکارو یا رحمن کو پکارو، جس نام سے بھی پکارو، اس کے لیے سب اچھے نام ہیں)\nاگر تم رحمن کہو تو تم نے اسے تمام اسماء حسنیٰ سے پکارا، اور اگر تم اللہ کہو تو تم نے اسے تمام اسماء حسنیٰ سے پکارا۔ اسی طرح تم کہتے ہو کہ مخلوق جو کہ عالم ہے، ذات حق (الحق) کے اسماء اور صفات کو قبول کرتی ہے، اور اسی طرح ذات حق (الحق) مخلوق کی صفات کو قبول کرتا ہے، نہ کہ اس کے اسماء کو تفصیل کے ساتھ، بلکہ اجمال کے ساتھ قبول کرتا ہے۔ اس کا اجمال کے ساتھ قبول کرنا اس کے اس قول جیسا ہے:\n> يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ\n> (اے لوگو! تم اللہ کے محتاج ہو)\nاور اس کا عالم کے اسماء کو تفصیل کے ساتھ قبول نہ کرنا، تو اس سے میری مراد اسماءِ اعلام (نام) ہیں، اور وہ اس کا یہ قول ہے:\n> قُلْ سَمُّوهُمْ\n> (کہہ دو کہ ان کے نام رکھو)\nوہ اسماءِ اعلام مراد لیتا ہے۔ اور اسماءِ اعلام کے علاوہ جو کچھ ہے، ذات حق (الحق) اسے تفصیل کے ساتھ قبول کرتا ہے۔ کیونکہ ذات حق (الحق) کا کوئی اسمِ علم ایسا نہیں ہے جو اس کی ذات کے علاوہ کسی معنی پر دلالت نہ کرتا ہو، پس اس کے تمام اسماء مشتق ہیں جو اس کے لیے اعلام (ناموں) کی منزل میں نازل ہوئے ہیں۔ اور اسی وجہ سے ذات حق (الحق) کے اسماء میں تفصیل کے ساتھ اشتراک واقع ہوا، اور عالم کے اسماء میں تفصیل کے ساتھ اشتراک واقع نہیں ہوا۔ پس اس بات کو سمجھو جس پر ہم نے تمہیں متنبہ کیا ہے۔ اور سب سے بڑی چیز جو اس نے ہماری صفات میں سے لی ہے، جس کے محال ہونے پر دلیل دلالت کرتی ہے، وہ یہ ہے:\n> وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ\n> (اور ہم تمہیں ضرور آزمائیں گے یہاں تک کہ ہم جان لیں)\nاور اس کے بعد جو کچھ ہے وہ اس کے صورتوں میں بدلنے اور دیگر چیزوں سے زیادہ آسان ہے۔ اور حقیقت میں، یہ سب اس کی صفات ہیں۔ اور سب سے بڑی چیز جو ہم نے اس سے لی ہے وہ ہماری اس کی معرفت (المعرفۃ) ہے جسے دلیل محال قرار دیتی ہے، اور وہ اس کا یہ قول ہے:\n> لَيْسَ كَمِثْلِهِ شَيْءٌ\n> (اس کی مثل کوئی چیز نہیں)\nاور رسول اللہ صلی اللہ علیہ وسلم کا یہ قول ہے:\n> من عرف نفسه عرف ربه\n> (جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا)\n\nپس ہم نے اس سے لیا اور اس نے ہم سے لیا۔\n\n> پس اے وہ حیرت جس نے اس کی ہستی (کونہ) کی حقیقتیں ظاہر کیں\n> اور اے بندے کی محرومی جب وہ اس سے فوت ہو جائے\n> پس جسے اس نے زندہ کیا، وہ اس کی ذات کو حیران کرتا ہے\n> اور جو اس میں حیران نہ ہوا، تو وہ اسے اس سے دور کر کے مار دیتا ہے\n> اگر مخلوق کی غذا ایک متحقق وجود (کون) ہے\n> تو ذات حق (الحق) کا معبود بندے کی غذا ہے\n\nسہل بن عبداللہ سے پوچھا گیا کہ غذا کیا ہے؟ انہوں نے کہا: اللہ۔\n\n### [اِل (الإل) ہمزہ کے کسرہ کے ساتھ اللہ تعالیٰ ہے]\n\nجان لو کہ اِل (الإل) ہمزہ کے کسرہ کے ساتھ اللہ تعالیٰ ہے، اور اِل (الإل) ہمزہ کے کسرہ کے ساتھ عہد (وعدہ) بھی ہے۔ پس اس کا قول \"إلى كونك\" (تمہاری ہستی کی طرف) یعنی میری الوہیت (الوهتي) تم ہی سے ظاہر ہوئی، کیونکہ مألوہ (جس کی الوہیت مانی گئی) وہ ہے جس نے اپنے نفس میں الٰہ کا وجود بنایا، اور اسی لیے اس نے فرمایا:\n> من عرف نفسه عرف ربه\n> (جس نے اپنے نفس کو پہچانا اس نے اپنے رب کو پہچانا)\nپس اللہ کی معرفت (المعرفۃ) کہ وہ تمہارا الٰہ ہے، تمہاری اپنی ذات کی معرفت (المعرفۃ) سے پیدا ہوئی ہے۔ اور اسی لیے اللہ نے تمہیں اس کی معرفت (المعرفۃ) میں صرف تم پر اور عالم پر ہی حوالہ نہیں کیا۔ پس اللہ تعالیٰ کے لیے جو بھی احکام ثابت ہوئے ہیں، وہ عالم کے بغیر ثابت نہیں ہوئے۔ پس اِل (الإل) کی عین (ذات) اس پہلو سے کہ وہ عین ہے، ان احکام سے موصوف ہے۔ پس اگر عالم ذہن سے اٹھ جائے تو تمام الٰہی احکام اٹھ جائیں گے اور عین (ذات) بغیر حکم کے باقی رہے گی۔ اور جب وہ بغیر حکم کے باقی رہے گی، اگرچہ وہ بذاتہ واجب الوجود ہو، تو اس پر الوہیت کا حکم لازم نہیں آئے گا۔ پس ہماری اعیان (ذاتوں) کا وجود اس کے وجود سے ہے، اور ہمارے وجود نے ہماری ذاتوں میں اس کی معرفت (العلم) کو ثابت کیا۔ اور اگر اس کی ذات نے ہمارا وجود نہ دیا ہوتا تو ہمارے لیے عین کا وجود صحیح نہ ہوتا۔ اور یہی علماء کے اس قول کا معنی ہے کہ عالم نے اللہ سے وجود حاصل کیا۔ اور جہاں تک اس کے قول \"أ لك كوني\" (کیا میری ہستی تیرے لیے ہے) کا تعلق ہے، تو یہ عین اس کے قول کے مطابق ہے: \"میں اس کی سماعت بن جاتا ہوں اور اس کی بصارت بن جاتا ہوں،\" پس اس نے اپنی ہویت (ہستی) کو ہماری سماعت اور ہماری قوتوں کے مسمیٰ کی عین بنا دیا، اور عالم صرف اسی حکم کے ساتھ ہے۔\n\n> پس اگر میں فنا (الفناء) ہو جاؤں تو میں نہیں ہوں گا\n> اور اگر میں بقا (البقاء) پا جاؤں تو میں نہیں ہوں گا\n> پس ہم سب تیرے لیے ہیں\n> اور ہم سب \"کُن\" (ہو جا) کے قول سے ہیں\n> ہم سے اور اس سے، غور کر\n> تو اسے اپنے اندر پوشیدہ پائے گا\n> پس اسے چھپا، اسے ظاہر نہ کر\n> جیسا کہ \"لم یکن\" (وہ نہیں تھا) میں آیا\n> اس میں اس کے لیے سورج چمکتا ہوا ظاہر ہوا جو ساکن تھا\n> پس ہمارے لیے اس کے سوا کوئی\n> سہارا اور کوئی ٹھکانہ نہیں\n\nپس ذات حق (الحق) عالم کا متصرف (تصرف کرنے والا) ہے اور عالم ذات حق (الحق) کا متصرف ہے۔ کیا تم اسے یہ فرماتے ہوئے نہیں دیکھتے:\n> أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ\n> (میں پکارنے والے کی پکار کا جواب دیتا ہوں جب وہ مجھے پکارتا ہے)\nکیا اجابت (جواب دینا) تصرف نہیں ہے؟ کیا بغیر ندا اور سوال کے اجابت کا تصور کیا جا سکتا ہے؟ وہ اپنے نفس میں تصرف نہیں کر سکتا، پس اس کا تصرف صرف ہم میں ہے۔ پس اس کا تصرف ہمیں ہمیشہ وجود دینا ہے۔ پس اعیان (ذاتیں) ظاہر ہوتی ہیں، اور اس کے لیے احکام پیدا ہوتے ہیں، اور تعلقات ہیں جن کا انکار نہیں کیا جا سکتا۔\n\n> پس اگر تو کہے کہ میں ایک ہوں تو تو سچا ہے\n> اور اگر تو کہے کہ ہم ایک نہیں ہیں تو تو جھوٹا نہیں ہے\n\nکاش میں جانتا کہ کون جاہل ہے، حالانکہ وہاں اللہ کے سوا کچھ نہیں ہے! پس ہر کوئی اس چیز کو جانتا ہے جسے وہ نہیں جانتا، پھر اسے جان لیتا ہے:\n> وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ\n> (اور ہم تمہیں ضرور آزمائیں گے یہاں تک کہ ہم جان لیں)\nاور اس مشہد (شہود) کا کچھ اثر اصحابِ نظر کے ایک گروہ پر ظاہر ہوا ہے، جو نہیں جانتے کہ یہ ان کے پاس کہاں سے آیا۔ پس ان سے یہ حکایت کی گئی ہے کہ وہ کہتے ہیں کہ اللہ اپنے نفس کو نہیں جانتا، کیونکہ کسی چیز کا علم اس کے معلوم پر احاطہ کرنے کا تقاضا کرتا ہے، اور اس کا وجود غیر متناہی ہے، اور اس کا وجود عین اس کی ماہیت ہے، اس کے علاوہ کچھ نہیں۔ اور جو غیر متناہی ہو اس کا احاطہ نہیں کیا جا سکتا۔ مگر یہ کہ وہ غیر متناہی ہے، اور اس نے علم کے ذریعے احاطہ کر لیا کہ وہ غیر متناہی ہے، نہ اس کے لیے اور نہ عالم کے لیے۔ اور اگرچہ یہ قول فاسد ہے، لیکن اس میں صحت کا ایک پہلو ہے، اور وہ یہ ہے کہ وہ اپنے نفس کو احاطہ کی جہت سے نہیں جانتا، بلکہ وہ اپنے نفس کو جانتا ہے کہ وہ احاطہ کو قبول نہیں کرتا، جیسا کہ وہ ممکنات اور تمام مقدورات کو جانتا ہے کہ وہ غیر متناہی ہیں۔ پس اس گہرے سمندر کے اس اثر (رشح) میں غور کرو کہ اس نے عالم میں کیسے ایک نحلہ (عقیدہ) کو متاثر کیا جو عین (ذات) میں ظاہر ہوا اور عالمِ کون (وجود) تک پہنچا، یہاں تک کہ وہ دفتروں میں لکھا گیا اور سواریاں اسے لے کر چلیں اور علماء نے اس پر گفتگو کی، حالانکہ وہاں کہنے والا اللہ کے سوا کوئی نہیں ہے اور منطق (بولنے والا) اللہ کے سوا کوئی نہیں ہے۔ اور باقی صرف فہم کی آنکھ کا کھلنا ہے تاکہ وہ اللہ کی طرف سے بولے، اس پہلو سے کہ وہ صرف حق بات ہی بولتا ہے۔ پس عالم میں ہر کلام یا تو حکمت سے ہے یا فصل الخطاب (فیصلہ کن بات) سے ہے۔ پس تمام کلام خطا اور لغزش سے معصوم ہے، مگر یہ کہ کلام کے لیے مقامات اور محال (جگہیں) ہیں اور میدان ہیں جن میں اس کے لیے گنجائش ہے۔ بسا اوقات اس کے میدان اتنے وسیع ہو جاتے ہیں کہ بصیرت کی آنکھیں ان کی انتہا کو پانے سے قاصر رہ جاتی ہیں۔\n\n> پس جب وہ بولتا ہے تو حق بات بولتا ہے\n> اس کے مطابق جو فصل الخطاب (فیصلہ کن بات) کا تقاضا ہے\n> اور ایک قوم کی آنکھیں حسرت زدہ لوٹتی ہیں\n> جو اس میں عجیب امر سے اندھے ہو گئے\n\nپس اگر تم ان معانی کو سمجھنے کا راستہ چاہتے ہو، تو ان نوافل کو زیادہ کرنے کی کوشش کرو جن کی فرائض میں اصل ہے۔ اور اگر تمہارے لیے نکاح کے نوافل کو زیادہ کرنا ممکن ہو، تو یہ خیرات کے نوافل میں سب سے بڑا فائدہ ہے، کیونکہ اس میں ازدواج (جوڑا بننا) اور انتاج (پیداوار) ہے، پس تم معقول اور محسوس کو جمع کرتے ہو، اور عالم میں سے کوئی چیز تم سے فوت نہیں ہوتی۔ جو اسم الظاہر (ظاہر) اور الباطن (باطن) سے صادر ہوا ہے۔ پس اس طرح کے نفل میں تمہارا مشغول ہونا اس چیز کے حصول کے لیے زیادہ کامل اور قریب ہے جس کی تم اس سے خواہش رکھتے ہو۔ پس جب تم یہ کرو گے تو ذات حق (الحق) تم سے محبت کرے گا، اور جب وہ تم سے محبت کرے گا تو اسے تم پر غیرت آئے گی کہ کوئی آنکھ تمہیں دیکھے یا کوئی وجود (کون) تمہیں قید کرے۔ پس وہ تمہیں اپنے حرم کی پناہ گاہ میں داخل کر دے گا اور تمہیں اپنے محبوبوں اور اپنے اہل میں شامل کر لے گا۔ پس تم اس کے اہل بن جاؤ گے، جیسا کہ حدیث میں فرمایا:\n> في أهل القرآن إنهم أهل الله وخاصته\n> (اہلِ قرآن کے بارے میں کہ وہ اللہ کے اہل اور اس کے خاص لوگ ہیں)\nاسے ترمذی نے اپنی کتاب میں روایت کیا ہے۔\nاور جب وہ تمہیں اپنا اہل بنا لے گا، تو تمہیں اپنے القاء (ڈالنے) کا محل، اپنے استواء (جلوہ افروز ہونے) کا عرش، اپنے نزول کا آسمان، اور اپنے قدموں کی کرسی بنا دے گا۔ پس تم میں اس کی طرف سے وہ ظاہر ہو گا جو تم نے نہیں دیکھا، حالانکہ وہ تم میں ہے، اور وہ اللہ تعالیٰ کا یہ قول ہے:\n> فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ\n> (پس کوئی جان نہیں جانتی کہ ان کے لیے آنکھوں کی ٹھنڈک میں سے کیا چھپا کر رکھا گیا ہے)\nکیونکہ ان کے پہلو طبعی بستروں سے دور رہے، اور وہ الٰہی واردات اور ربانی شوارد (نادر چیزوں) کے اہل بن گئے۔ پس ان کے پانی میٹھے اور صاف ہیں، اور ان کے عرش ہر اس چیز سے خالی ہیں جو اللہ ان کی طرف القاء کرتا ہے اس کے سوا۔ ان کے کنویں معطل ہیں اور ان کے دروازے مقفل ہیں، اور ان کے محل مضبوط بنے ہوئے ہیں جن کی قفلوں کی چابیاں گم ہو چکی ہیں اور ان کے کنوؤں کی رسیاں ٹوٹ چکی ہیں۔ پس تم ان کے پانیوں کو دیکھتے ہو مگر انہیں چکھا نہیں جاتا، پس جہالت کی بنا پر انہیں اچھا سمجھا جاتا ہے۔ پس جب ان کی خبریں قرآن کے طور پر بیان کی جاتی ہیں تو ان کا اعجاز ظاہر ہوتا ہے، پس کوئی ان کی معارضت نہیں کر سکتا، پس وہ اسے شیریں سمجھتا ہے۔ پس جب اس کے معانی کے بارے میں پوچھا جاتا ہے تو وہ نہیں جانتا کہ کیا کہے، کیونکہ اس میں اس کے لیے کوئی ذوق نہیں ہے، سوائے اس کے جو اسے شہود (الشہود) نے عطا کیا ہے۔ پس اس کی انتہا یہ ہے کہ وہ کہے:\n> إِنْ هَذَا إِلَّا سِحْرٌ يُؤْثَرُ\n> (یہ تو بس جادو ہے جو پہلے سے چلا آ رہا ہے)\nاس کی روشنی کا اس کی تاریکی سے اختلاط، رات کے جادو سے تشبیہ دینے کی وجہ سے، اور اس جادو سے جو گرم ہوا کو نکالتا ہے اور ٹھنڈی ہوا کو لاتا ہے تاکہ حیوان کے ڈھانچے پر زندگی باقی رہے۔ پس دیکھنے والا نہیں جانتا کہ وہ کس رخ سے اس کا استقبال کرے۔ کیونکہ وہ جس رخ کی طرف بھی متوجہ ہوتا ہے، دوسرے سے اعراض کرتا ہے، مگر یہ کہ وہ نبی ہو، تو وہ اپنے پیچھے سے بھی دیکھتا ہے جیسا کہ اپنے سامنے سے دیکھتا ہے، پس وہ سب کا سب ایک رخ ہوتا ہے۔ اور اسی کو ذوق سے تعبیر کیا جاتا ہے جس سے اشتیاق اور شوق کی حقیقت پیدا ہوتی ہے۔ پس وہ اپنی خواہش سے نہیں بولتا:\n> إِنْ هُوَ إِلَّا وَحْيٌ يُوحَىٰ\n> (یہ تو صرف وحی ہے جو بھیجی جاتی ہے)\nاسے قوت والے، مضبوط (ذو القوة المتین) نے شدید القوی (سخت قوت والے) کی صورت میں سکھایا۔ پس\n> وَمَا هُوَ عَلَى الْغَيْبِ بِضَنِينٍ\n> (اور وہ غیب پر بخیل نہیں ہے)\nاور\n> وَمَا هُوَ بِقَوْلِ شَيْطَانٍ رَجِيمٍ\n> (اور یہ کسی مردود شیطان کا قول نہیں ہے)\nکیونکہ اس نے عین قرب (قرب) سے خبر دی، کیونکہ وہ\n> دَنَا فَتَدَلَّىٰ فَكَانَ\n> (قریب ہوا اور جھک آیا، پس وہ ہو گیا)\nجیسا کہ پہلے گزرا:\n> قَابَ قَوْسَيْنِ أَوْ أَدْنَىٰ\n> (دو کمانوں کے فاصلے یا اس سے بھی کم)\nاور یہ گمانوں کی سنگ باری میں سے نہیں ہے، جیسا کہ وہ اصحاب کہف کے بارے میں کہتے ہیں، وہ معلوم نوجوان:\n> ثَلَاثَةٌ رَابِعُهُمْ كَلْبُهُمْ\n> (تین ہیں، چوتھا ان کا کتا ہے)\nاور\n> وَيَقُولُونَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًا بِالْغَيْبِ\n> (اور وہ کہتے ہیں کہ پانچ ہیں، چھٹا ان کا کتا ہے، غیب پر اٹکل پچو مارتے ہوئے)\nوہ کہتا ہے کہ جو وہ ان کی تعداد کے بارے میں خبر دیتے ہیں، اس پر مجھے کوئی تحقیق نہیں ہے۔ یہ تعداد میں اٹکل پچو ہے، اور تم کہاں ہو اگر وہ معدود (جن کی گنتی کی گئی) کی حقیقت میں پڑتے تو وہ غوطہ لگاتے اور کسی فائدے پر نہ پہنچتے۔\nکیا تم اللہ تعالیٰ کے اپنے نبی صلی اللہ علیہ وسلم کے لیے اس قول کو نہیں دیکھتے، جن کی شان یہ نہیں ہے اور نہ ہی انبیاء علیہم السلام کی شان یہ ہے کہ وہ میدان جنگ میں شکست کھائیں یا قتل ہوں:\n> لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِرَارًا وَلَمُلِئْتَ مِنْهُمْ رُعْبًا\n> (اگر تم انہیں دیکھتے تو ان سے پیٹھ پھیر کر بھاگ جاتے اور تم ان سے خوف سے بھر جاتے)\nپس اس نے انہیں بھاگنے سے موصوف کیا، اور اس کا قول سچ ہے۔ کیا تم اسے ان کے جسموں کو دیکھنے سے نہیں دیکھتے؟ کیا وہ اس جیسے انسان نہیں تھے؟ پس وہ صرف اس چیز سے بھاگتا ہے جو اسے ختم کرنا چاہتی ہے، اور وہ اپنی شجاعت اور دلیری کے باوجود خوف سے نہیں بھرتا مگر کسی ایسی چیز سے جو اسے خوفزدہ کرے۔ پس اگر اس نے ان میں وہ نہ دیکھا ہوتا جو اس نے شبِ معراج میں دیکھا تھا اس سے زیادہ خوفناک تھا، تو وہ اس چیز سے خوف سے نہ بھرتا جو اس نے دیکھا۔ اور ہم نے انہیں دیکھا اور ہم خوف سے نہیں بھرے، کیونکہ ہم نے ان میں صرف ان کے جسموں کی صورتیں دیکھیں، پس ہم نے انہیں اپنے جیسا دیکھا۔ پس وہ چیز جو اسے خوف سے بھرتی تھی، اور اللہ نے صرف ان کی آنکھوں کے دیکھنے کا ذکر کیا، کیونکہ اس نے فرمایا:\n> لَوِ اطَّلَعْتَ عَلَيْهِمْ\n> (اگر تم انہیں دیکھتے)\nپس اس نے انہیں اطلاع (دیکھنے) سے موصوف کیا۔ پس وہ مقام میں اس سے نیچے ہیں، اور اس کے باوجود وہ ان سے بھاگتے ہوئے پیٹھ پھیرتے تھے، اس خوف سے کہ وہ ان سے مل جائیں گے اور وہ اپنے مقام سے نیچے اتر آئیں گے، اور ان سے خوف سے بھر جاتے تھے تاکہ وہ ان پر اثر انداز نہ ہوں، جیسا کہ ہم نے کہا کہ ادنیٰ کا اعلیٰ پر اثر انداز ہونا۔\nجیسا کہ اس کا قول صلی اللہ علیہ وسلم ہے:\n> رب ضاحك ملء فيه لا يدري أرضى الله أم أسخطه\n> (بہت سے ایسے ہنسنے والے ہیں جو منہ بھر کر ہنستے ہیں، وہ نہیں جانتے کہ اللہ ان سے راضی ہے یا ناراض)\nاور فرمایا:\n> ذَلِكَ بِأَنَّهُمُ اتَّبَعُوا مَا أَسْخَطَ اللَّهَ\n> (یہ اس لیے کہ انہوں نے اس چیز کی پیروی کی جس نے اللہ کو ناراض کیا)\nاور جو اس امر کو اس طرح جانتا ہے، اس پر لازم ہے کہ وہ بھاگ جائے اور خوف سے بھرے۔ کیا تم نے کسی عقل مند کو دیکھا ہے جو کسی کھائی کے کنارے پر کھڑا ہو اور گرنے کے خوف سے نہ بھاگے؟ پس اس صفت کے نیچے غور کرو جس سے اللہ نے اپنے نبی کو موصوف کیا، اگر وہ ان نوجوانوں کو دیکھتے، ان کے بلند مرتبے اور شان کے باوجود، تو ان کا علو زیادہ بلند ہے اور ان کا مرتبہ زیادہ اعلیٰ ہے۔ پس اس سے ہمیں اپنے نبی محمد صلی اللہ علیہ وسلم کے بلند مرتبے پر تنبیہ ملی۔ پس نوجوانوں کی اعیان (ذاتیں) ہمارے لیے مشہود تھیں اور ہم نہ بھاگے اور نہ خوف سے بھرے، اور اگر ہمارے نبی ان نوجوانوں کی اعیان کو دیکھتے تو ان سے بھاگتے ہوئے پیٹھ پھیرتے اور خوف سے بھر جاتے۔ پس غور کرو کہ عالم کی صورتیں کس کی طرف لوٹتی ہیں، کیا ان کے اپنے نفوس کی طرف یا دیکھنے والے کی نظر کی طرف؟ اور جو ہم نے کہا ہے اس پر غور کرو، جیسا کہ تم یقیناً جانتے ہو کہ جادوگروں کی رسیاں اور لاٹھیاں اپنی عین میں رسیاں اور لاٹھیاں ہیں، اور ہماری نظر میں سانپ ہیں، پس وہ عین سانپ ہیں اور وہ عین لاٹھیاں اور رسیاں ہیں۔ پس دیکھو تم کیا دیکھتے ہو۔\n\n### [بے شک اللہ رؤیت (دیکھنے) سے انکار کرتا ہے اور علم سے انکار نہیں کرتا]\n\nاور جان لو کہ تم کیا دیکھتے ہو، اور وہاں رہو جہاں تم جانتے ہو نہ کہ وہاں جہاں تم دیکھتے ہو، کیونکہ اللہ رؤیت (دیکھنے) سے انکار کرتا ہے اور علم سے انکار نہیں کرتا۔ پس جب وہ رؤیت سے انکار نہیں کرتا، تو علم کے شاہد (شہود) سے بھی انکار نہیں کرتا۔ اور\n> وَاللَّهُ يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ\n> (اور اللہ حق کہتا ہے اور وہی راستہ دکھاتا ہے)",
    "fa": "«باب سیصد و هشتاد و نهم: در معرفت فرود آمدن او به سوی هستی تو و اینکه هستی من از آنِ توست»\n\nنزدیکی (دنو) من به تو در یک زمان است *** و سپس در زمانی دیگر، نزدیکی (دنو) تو به من است.\nمن علوم را از فضل تو گرفتم *** و تو نیز از من گرفتی.\n«منیت» من در توست ای حبیب من *** آنگاه که زبان می‌گوید: «من».\nچه دشوار است سخن گفتن از تو نزد من *** آنگاه که دل می‌گوید: «مرا وصل کن».\nو من از او غایب نبودم آنگاه که تجلی (التجلی) کرد *** و اگر می‌دانست، آرزو کردن را مشتاق می‌شد.\n\n### [مقام قاب قوسین (قاب قوسين)]\n\nخداوند متعال فرمود: **«سپس نزدیک شد و فرود آمد» (ثُمَّ دَنا فَتَدَلَّى)**. این عین فرود آمدن (المنازلة) است، زیرا هر صورتی از آن دو، مکان خود را ترک کرد، پس هر صورتی از دیگری نزدیک‌تر از قاب قوسین (قاب قوسين) بود. برای هر یک از دو صورت، کمانی وجود دارد که انحنا (التقويس) را آشکار ساخت. و فرقان میان دو صورت، خطی است که دایره را به دو نیم تقسیم کرد. پس امر، یک عین واحد بود، سپس با صورت، دو امر ظاهر شد. هنگامی که حکم دو امر شد، از امر واحد، فرود آمدنی (تدلّی) بود، زیرا علو از آنِ او بود؛ و در عین این فرود آمدن (التدلي)، نزدیکی (دنو) به امر دیگر بود. و از دیگری، نزدیک شدنی (تدان) به سوی کسی بود که فرود آمده بود؛ پس نزدیکی (دنو) او، عروج بود، زیرا فرود آمدن (تدلّی) امر دیگر به سوی او، ما را آگاه ساخت که سفل، سهم این دیگری بوده است. و هیچ یک از آن دو به دیگری نزدیک نشد، مگر برای اینکه امر به همان صورت که بود بازگردد؛ یعنی دایره‌ای واحد که هیچ فصلی میان دو قطر آن نیست. پس هر دو در تلاش برای از بین بردن خطی هستند که تقسیم را در دایره واجب ساخت. موضع این تقسیم، سخن اوست:\n\n«نماز میان من و بنده ام به دو نیم تقسیم شده است؛ نیمی از آن برای من است و نیمی برای بنده ام، و برای بنده ام هر آنچه درخواست کند.»\n\nو بنده را درخواستی نیست مگر از بین بردن این تقسیم، تا امر به همان صورت که بود بازگردد. پس حق (الحق) به درخواست او با این سخن پاسخ داد: **«و برای بنده ام هر آنچه درخواست کند»**. و فرمود: **«و همه امور به سوی او بازگردانده می‌شود» (وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ)**.\n\nپس فرود آمدن (تدلی) او، نزدیکی (دنو) است *** و نزدیک شدن (تدانی) ما، عروج است.\nاز هم جدا شدیم و گرد آمدیم *** همانا ما زوجی شادمانیم.\nهنگامی که جدا شدیم، در آسمان آن، برج‌هایی پدید آمد.\nو به خاطر هستی (کون) من، در ذات‌های ما شکاف‌هایی (فروج) برای آن است.\nپس نکاحی پیوسته است *** و دخول و خروجی است.\n\n### «و از آن جمله است»\n\nپس فرود آمدن (التدلي) از او بود *** و نزدیک شدن (التداني) از من بود.\nتا او را با چشم خود ببینم *** همان‌گونه که می‌گوید مرا می‌بیند.\n\nو هنگامی که از روی محبت و اشتیاق ملاقات کردیم، کسی که در سرّ من آگاه است، مرا خطاب کرد:\n\nدستانت را بر جگر بگذار *** تا بیابی آنچه را که من از شما می‌یابم.\nو برای طلب وصال، رنج ببر *** و به او بگو: مرا ببخش و بیفزا.\nاگر وجود علم در او نبود *** هیچ بنده‌ای متذکر نمی‌شد.\nپس اگر این را انکار کردند، بگو *** همانا قرآن به این امر وارد شده است.\n\nخداوند عز و جل فرمود: **«این ابلاغی است برای مردم» (هذا بَلاغٌ لِلنَّاسِ)**، پس گروهی را به تعیین اختصاص داد؛ **«و تا به وسیله آن بیم داده شوند» (وَلِيُنْذَرُوا بِهِ)**، پس گروه دیگری را تعیین کرد؛ **«و تا بدانند که او خدایی یگانه است» (وَلِيَعْلَمُوا أَنَّما هُوَ إِلهٌ واحِدٌ)**، پس گروه دیگری را تعیین کرد؛ **«و تا خردمندان پند گیرند» (وَلِيَتَذَكَّرَ أُولُوا الْأَلْبابِ)**، پس ما را تعیین کرد. و اینان همان کسانی هستند که ذکرشان کردیم و آنان دانایان به حق (الحق) و به امر، آن‌گونه که هست، می‌باشند. پس خطی که دایره را تقسیم کرد، چیزی نبود جز عین تمایز من از او و تمایز او از من، از آن وجهی که او به واسطه آن خدا (إله) بود و من به واسطه آن بنده بودم. پس هنگامی که تمایز محقق شد و جدایی به واسطه تکوین (ایجاد) رخ داد و خط، حکم خود را آشکار ساخت و ما را به حجاب از او وصف کرد و خود را به حجاب انوار و تاریکی‌ها از ما وصف کرد و آنچه را که تشریع کرد، برای ما تشریع نمود و ما را به انابه (بازگشت) به سوی خود امر کرد و خود را به نزول به سوی ما وصف نمود، دانستیم که او بازگشت امر را به آنچه پیش از این بود، می‌خواهد؛ پس از آنکه به آنچه دانستیم، علم یافتیم و به آنچه به واسطه آن محقق شدیم، تحقق یافتیم. او درباره خود فرمود که او شنوایی ماست که با آن می‌شنویم و بینایی ماست که با آن می‌بینیم، و تمام قوایی را که از نفوس خود می‌یابیم، برای ما ذکر کرد و در این وصل، اعیان ما را ثابت نمود. پس آنچه امر به سوی آن بازگشته است، شبیه آنچه پیش از فصل بود، نیست؛ زیرا حکمی که خط آن را ثابت کرده است، زائل نمی‌شود، حتی اگر خط زائل شود، اثرش باقی است. زیرا ما به یقین دانستیم که دایره بدون شک قابلیت تقسیم را دارد، در حالی که پیش از آن این را نمی‌دانستیم. پس اگر دایره متصل شود، علم ما به اینکه آن دارای دو بخش است، از بین نمی‌رود، از هر جزئی که آن را فرض کنی. و تنها از هر حدی که آن را فرض کنی، قابلیت تقسیم را می‌پذیرد، به دلیل آنچه در اخبار الهی از متصف شدن حق (الحق) تعالی به صفات خلق و متصف شدن خلق به صفات حق (الحق) وارد شده است. چنانکه فرمود: **«بگو: الله را بخوانید یا رحمان را بخوانید، هر کدام را بخوانید، پس نیکوترین نام‌ها از آن اوست» (قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الْأَسْماءُ الْحُسْنى)**. اگر بگویی «الرحمن»، او را به تمام اسماء حسنی نامیده‌ای، و اگر بگویی «الله»، او را به تمام اسماء حسنی نامیده‌ای. و همچنین می‌گویی: خلق که همان عالَم است، اسماء و صفات حق (الحق) را می‌پذیرد، و همچنین حق (الحق) صفات خلق را می‌پذیرد، نه اسماء آن‌ها را به تفصیل، بلکه آن‌ها را به اجمال می‌پذیرد. پذیرش او به اجمال مانند این سخن اوست: **«ای مردم، شما نیازمندان به سوی خدا هستید» (يا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَراءُ إِلَى الله)**. و اینکه او اسماء عالَم را به تفصیل نمی‌پذیرد، منظورم از آن، اسماء عَلَم (نام‌های خاص) است، و آن سخن اوست: **«بگو: آن‌ها را نام ببرید» (قُلْ سَمُّوهُمْ)**، یعنی اسماء عَلَم. و آنچه غیر از اسماء عَلَم است، حق (الحق) آن‌ها را به تفصیل می‌پذیرد. زیرا حق (الحق) اسم عَلَمی ندارد که بر معنایی جز ذات او دلالت کند، پس تمام اسماء او مشتق هستند که به منزله عَلَم برای او تنزل یافته‌اند. و به همین دلیل، اشتراک به تفصیل در اسماء حق (الحق) رخ داده است، اما اشتراک به تفصیل در اسماء عالَم رخ نداده است. پس آنچه را که به آن توجه دادیم، دریاب. بزرگترین چیزی که او از صفات ما گرفته است و دلیل بر محال بودن آن دلالت می‌کند، این است: **«و قطعاً شما را می‌آزماییم تا بدانیم» (وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ)**. پس آنچه پس از این است، آسان‌تر از تحول او در صورت‌ها و غیر آن است. و در حقیقت، همه آن‌ها نعت‌های او هستند. و بزرگترین چیزی که ما از او گرفته‌ایم، علم ما به اوست که دلیل آن را محال می‌داند، و آن سخن اوست: **«چیزی مانند او نیست» (لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ)** و سخن رسول خدا (صَلَّى اللهُ عَليهِ وسَلَّم): **«هر کس خود را شناخت، پروردگارش را شناخت» (من عرف نفسه عرف ربه)**.\n\nپس ما از او گرفتیم و او از ما گرفت.\n\nای حیرتی که حقایق هستی (کون) او را آشکار ساخت *** و ای ناامیدی برای بنده هنگامی که آن را از دست می‌دهد.\nپس هر کس او را زنده کرد، ذاتش را حیران می‌سازد *** و هر کس در او حیران نشد، او را از خود می‌میراند.\nاگر قوت خلق، هستی (کون) محقق باشد *** پس خدای حق (الحق)، قوت بنده است.\n\nاز سهل بن عبدالله پرسیده شد: قوت چیست؟ گفت: الله.\n\n### [الإل (الإل) با کسره همزه، همان خداوند متعال است]\n\nو بدان که الإل (الإل) با کسره همزه، همان خداوند متعال است. و الإل (الإل) همچنین به معنای عهد با کسره همزه است. پس سخن او «به سوی هستی تو» (إلى كونك) یعنی: الوهیت من جز به واسطه تو ظاهر نشد. زیرا مألوه (معبود) کسی است که وجود إله (معبود) را در نفس خود قرار داده است. و به همین دلیل فرمود: **«هر کس خود را شناخت، پروردگارش را شناخت»**. پس معرفت تو به خداوند که او إله توست، نتیجه معرفت تو به ذات خودت است. و به همین دلیل، خداوند تو را در علم به خود، جز به خودت و به عالَم ارجاع نداد. پس هر حکمی که برای خداوند متعال ثابت شده است، جز به واسطه عالَم ثابت نشده است. پس عین الإل (الإل)، از حیث عینیتش، همان موصوف به این احکام است. اگر عالَم از ذهن برداشته شود، تمام احکام الهی برداشته می‌شود و عین بدون حکم باقی می‌ماند. و اگر بدون حکم باقی بماند، اگرچه واجب الوجود لذاته باشد، لازم نمی‌آید که حکم الوهیت داشته باشد. پس وجود اعیان ما از وجود اوست، و وجود ما، علم به او را در ذات‌های ما ثابت کرد. و اگر ذات او وجود ما را عطا نمی‌کرد، وجود عینی برای ما صحیح نبود. و این معنای سخن علماست که عالَم، هستی (الوجود) را از خداوند کسب کرده است. و اما سخن او «آیا هستی من از آنِ توست» (أ لك كوني)، عین سخن اوست که: «من شنوایی و بینایی او بودم». پس هویت خود را عین مسمای شنوایی و قوای ما قرار داد، و عالَم جز به این حکم نیست.\n\nپس اگر فانی (فناء) شوم، نبوده‌ام *** و اگر باقی (بقاء) بمانم، نبوده‌ام.\nپس همه ما از آنِ تو هستیم *** و همه ما از قول «کُن» (باش) هستیم.\nاز ما و از او، پس عبرت بگیر *** او را در خودت نهفته می‌یابی.\nپس آن را بپوشان، آشکارش مکن *** چنانکه در «نبود» (لم يكن) آمده است.\nدر آن، خورشیدی برای او درخشید *** که آنچه ساکن بود، آشکار شد.\nپس ما را جز او، هیچ تکیه‌گاه *** و هیچ آرامشی نیست.\n\nپس حق (الحق)، گرداننده عالَم است و عالَم، گرداننده حق (الحق). آیا نمی‌بینی که می‌فرماید: **«دعوت دعا کننده را هنگامی که مرا بخواند، اجابت می‌کنم» (أُجِيبُ دَعْوَةَ الدَّاعِ إِذا دَعانِ)**؟ آیا اجابت، نوعی تصرف نیست؟ آیا اجابت بدون ندا و سؤال تصور می‌شود؟ او نمی‌تواند در نفس خود تصرف کند، پس تصرفی جز در ما ندارد. پس تصرف او، ایجاد دائمی ماست؛ اعیانی که ظاهر می‌شوند و احکامی که برای او پدید می‌آیند و تعلقاتی که انکار نمی‌شوند.\n\nاگر بگویی «من واحد هستم»، راست گفته‌ای *** و اگر بگویی «ما واحد نیستیم»، دروغ نگفته‌ای.\n\nای کاش می‌دانستم چه کسی جاهل است، در حالی که جز الله در آنجا نیست! پس همه به آنچه نمی‌دانند، عالم‌اند و سپس آن را می‌دانند: **«و قطعاً شما را می‌آزماییم تا بدانیم» (وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ)**. و پاره‌ای از تراوش این مشهد بر گروهی از اهل نظر آشکار شده است که نمی‌دانند این از کجا به آن‌ها رسیده است. پس از آن‌ها حکایت شده است که می‌گویند: خداوند نفس خود را نمی‌داند، زیرا علم به شیء مستلزم احاطه به معلوم است، و وجود او نامتناهی است و وجود او عین ماهیت اوست و غیر آن نیست، و آنچه نامتناهی است، محاط واقع نمی‌شود. جز اینکه او نامتناهی است و به علم احاطه یافته است که نامتناهی است، نه برای خودش و نه برای عالَم. و این اگرچه قولی فاسد است، اما وجهی به سوی صحت دارد؛ و آن این است که او نفس خود را از جهت احاطه نمی‌داند، بلکه نفس خود را می‌داند که احاطه را نمی‌پذیرد، همان‌گونه که ممکنات و تمام مقدورات را می‌داند که نامتناهی هستند. پس بنگر در این تراوش از این دریای ژرف، چگونه در عالَم تأثیر گذاشته است؛ نحلتی (مکتبی) که در عین ظاهر شد و به عالم هستی (الکون) پدیدار گشت، تا جایی که در دفترها نگاشته شد و سواران آن را با خود بردند و علما با آن شب‌نشینی کردند. و در آنجا هیچ گوینده‌ای جز الله نیست و هیچ منطقی جز الله نیست. و چیزی باقی نمانده است جز گشودن چشم فهم تا الله را به زبان آوری، از آن جهت که او جز به صواب سخن نمی‌گوید. پس هر کلامی در عالَم، یا از حکمت است یا از فصل الخطاب. پس تمام کلام از خطا و لغزش معصوم است، جز اینکه کلام را جایگاه‌ها و محل‌ها و میدان‌هایی است که در آن جولان دارد. چه بسا میدان‌هایش چنان گسترده شود که چشم‌های بصیرت از درک غایت آن بازمانند.\n\nپس هنگامی که سخن می‌گوید، به صواب سخن می‌گوید *** بر اساس آنچه فصل الخطاب اقتضا می‌کند.\nو دیدگان قومی که در آن از امر شگفت‌انگیز کور شده‌اند، با حسرت باز می‌گردد.\n\nپس اگر راهی برای فهم این معانی می‌خواهی، در زیاد کردن نوافلی بکوش که اصلی در فرائض دارند. و اگر برایت ممکن شد که نوافل نکاح را زیاد کنی، پس آن بزرگترین فواید نوافل خیرات است، به دلیل آنچه در آن از ازدواج و تولید (الإنتاج) وجود دارد. پس میان معقول و محسوس جمع می‌کنی و چیزی از عالَم که از اسم ظاهر و باطن صادر شده است، از دستت نمی‌رود. پس اشتغال تو به مانند این نافله، کامل‌تر و نزدیک‌تر است برای به دست آوردن آنچه از آن می‌خواهی. پس اگر این کار را انجام دهی، حق (الحق) تو را دوست می‌دارد. و هنگامی که تو را دوست بدارد، بر تو غیرت می‌ورزد که چشمی تو را مشاهده کند یا هستی‌ای (کون) تو را مقید سازد. پس تو را در حریم حرم خود داخل می‌کند و تو را از جمله دوستان و اهل خود قرار می‌دهد. پس شایسته او می‌شوی، چنانکه در حدیث درباره اهل قرآن فرمود: **«آنان اهل الله و خاصان او هستند»**. این را ترمذی در کتاب خود آورده است.\n\nو هنگامی که تو را شایسته خود قرار داد، تو را محل القای خود، عرش استوای خود، آسمان نزول خود و کرسی قدم‌های خود قرار داد. پس در تو از او چیزی آشکار شد که آن را نمی‌دیدی، با وجود اینکه در تو بود، و آن سخن خداوند متعال است: **«پس هیچ کس نمی‌داند چه چیز از روشنی چشم‌ها برای آن‌ها پنهان شده است» (فَلا تَعْلَمُ نَفْسٌ ما أُخْفِيَ لَهُمْ من قُرَّةِ أَعْيُنٍ)**. زیرا پهلوهایشان از بستر‌های طبیعی دور شده و شایسته موارد الهی و شوارد (امور گریزان) ربانی گشته‌اند. پس آب‌هایشان شیرین و صاف است و عرش‌هایشان از هر آنچه جز آنچه خداوند به سوی آن‌ها القا می‌کند، خالی است. چاه‌هایشان معطل و درهایشان قفل شده است و قصرهایشان برافراشته است، اما کلیدهای قفل‌هایشان گم شده و طناب‌های چاه‌هایشان پاره گشته است. پس به آب‌های آن می‌نگری و چشیده نمی‌شود، و از روی جهالت نیکو شمرده می‌شود. پس هنگامی که اخبار آن به صورت قرآن روایت شود، اعجازش آشکار می‌گردد و هیچ کس نمی‌تواند با آن معارضه کند، پس آن را شیرین می‌یابد. اما اگر از معانی آن پرسیده شود، نمی‌داند چه بگوید، زیرا ذوقی در آن ندارد مگر آنچه شهود (الشهود) به او عطا کرده است. پس نهایت کارش این است که بگوید: **«این نیست مگر سحری که به ارث رسیده است» (إِنْ هذا إِلَّا سِحْرٌ يُؤْثَرُ)**، به دلیل آمیختگی نور آن با ظلمتش، شبیه به سحر شب و سحری که هوای گرم را خارج می‌کند و هوای سرد را می‌راند تا حیات بر پیکر حیوان باقی بماند. پس بیننده در آن نمی‌داند به کدام وجه رو کند، زیرا هرگاه به یک وجه رو کند، از وجه دیگر روی برمی‌گرداند، مگر اینکه پیامبر باشد که از پشت سر خود ببیند، همان‌گونه که از پیش رو می‌بیند، پس تماماً یک وجه باشد. و این همان چیزی است که به ذوق تعبیر می‌شود و حقیقت اشتیاق (الاشتياق) و شوق از آن حاصل می‌شود. پس او از روی هوی سخن نمی‌گوید: **«این نیست مگر وحیی که به او وحی می‌شود» (إِنْ هُوَ إِلَّا وَحْيٌ يُوحى)**، که صاحب نیروی استوار (ذو القوة المتين) در صورت شدید القوی به او آموخته است. پس **«او بر غیب بخیل نیست» (ما هُوَ عَلَى الْغَيْبِ بِضَنِينٍ)** و **«این سخن شیطان رانده شده نیست» (ما هُوَ بِقَوْلِ شَيْطانٍ رَجِيمٍ)**. زیرا او از عین قرب خبر داده است، چون از **«نزدیک شد و فرود آمد» (دَنا فَتَدَلَّى)**، پس همان‌گونه که پیشتر آمد، **«قاب قوسین (قابَ قَوْسَيْنِ) یا نزدیک‌تر» (أَوْ أَدْنى)** شد. و این از گمان‌های پرتاب شده نیست، چنانکه درباره اصحاب کهف، آن جوانان معلوم، می‌گویند: **«سه نفر بودند و چهارمین آن‌ها سگشان بود» (ثَلاثَةٌ رابِعُهُمْ كَلْبُهُمْ)** و می‌گویند: **«پنج نفر بودند و ششمین آن‌ها سگشان بود» (خَمْسَةٌ سادِسُهُمْ كَلْبُهُمْ)**، که این **«پرتاب کردن به غیب است» (رَجْماً بِالْغَيْبِ)**. می‌گوید: آنچه درباره تعدادشان خبر می‌دهند، تحقیقی بر آن نیست. این پرتابی در عدد است، و تو کجا هستی اگر به حقیقت معدود می‌پرداختند، غرق می‌شدند و به نتیجه‌ای نمی‌رسیدند.\n\nآیا به سخن خداوند متعال به پیامبرش (صَلَّى اللهُ عَليهِ وسَلَّم) نمی‌نگری؟ پیامبری که شأن او و شأن انبیا (علیهم السلام) نیست که در میدان نبرد شکست بخورد یا کشته شود. [خداوند فرمود:] **«اگر بر آن‌ها آگاه می‌شدی، از آن‌ها فرار می‌کردی و از آن‌ها پر از ترس می‌شدی» (لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِراراً ولَمُلِئْتَ مِنْهُمْ رُعْباً)**. پس او را به فرار وصف کرد و سخن او راست است. آیا این [ترس] از دیدن اجسام آن‌ها بود؟ آیا آن‌ها انسان‌هایی مانند او نبودند؟ پس کسی فرار نمی‌کند مگر از امری که قصد نابودی او را دارد، و با وجود شجاعت و دلاوری، پر از ترس نمی‌شود مگر از چیزی که او را به وحشت اندازد. اگر او چیزی هولناک‌تر از آنچه در شب معراج دید، از آن‌ها نمی‌دید، از آنچه می‌دید پر از ترس نمی‌شد. در حالی که ما آن‌ها را دیده‌ایم و پر از ترس نشدیم، زیرا ما جز صورت‌های اجسامشان را مشاهده (الشهود) نکردیم و آن‌ها را مانند خودمان دیدیم. پس آن [چیزی که پیامبر را پر از ترس می‌کرد]، همان بود که او را پر از ترس می‌ساخت. و خداوند جز دیدن عین آن‌ها را ذکر نکرد، زیرا فرمود: **«اگر بر آن‌ها آگاه می‌شدی» (لَوِ اطَّلَعْتَ عَلَيْهِمْ)**. پس او را به اطلاع (آگاهی) وصف کرد. پس آن‌ها از نظر مقام پایین‌تر از او بودند، با این حال، او از آن‌ها فرار می‌کرد، از ترس اینکه به آن‌ها ملحق شود و از مقام خود پایین آید، و از آن‌ها پر از ترس می‌شد تا مبادا در او تأثیر بگذارند، همان‌گونه که درباره تأثیر پایین‌تر در بالاتر گفتیم.\n\nمانند سخن او (صَلَّى اللهُ عَليهِ وسَلَّم): **«چه بسا خنده‌کننده‌ای که دهانش پر از خنده است، در حالی که نمی‌داند آیا خداوند از او راضی است یا بر او خشمگین»**.\n\nو فرمود: **«این به سبب آن است که آنان از آنچه خداوند را به خشم آورده، پیروی کردند» (ذلِكَ بِأَنَّهُمُ اتَّبَعُوا ما أَسْخَطَ الله)**. و کسی که امر را بر این اساس بداند، سزاوار است که فرار کند و پر از ترس شود. آیا عاقلی را دیده‌اید که بر لبه پرتگاهی بایستد و از ترس سقوط فرار نکند؟ پس بنگر در زیر این وصفی که خداوند پیامبرش را به آن وصف کرد، اگر بر جوانان آگاه می‌شد، با وجود علو رتبه و شأن آن‌ها، علو او بالاتر و رتبه او والاتر بود. پس با این، ما را بر علو رتبه پیامبرمان محمد (صَلَّى اللهُ عَليهِ وسَلَّم) آگاه ساخت. پس اعیان جوانان برای ما مشاهده (الشهود) شده بود و ما فرار نکردیم و پر از ترس نشدیم، اما اعیان جوانان اگر پیامبر ما بر آن‌ها آگاه می‌شد، از آن‌ها فرار می‌کرد و پر از ترس می‌شد. پس بنگر که صورت‌های عالَم به چه چیزی باز می‌گردد؟ آیا به خودشان یا به رؤیت بیننده؟ و در آنچه گفتیم تدبر کن، همان‌گونه که به یقین می‌دانی که طناب‌ها و عصاهای ساحران، در عین خود طناب و عصا هستند، و در نظر ما مار هستند. پس آن‌ها عین مارها هستند و عین عصاها و طناب‌ها. پس بنگر چه می‌بینی.\n\n### [همانا خداوند با رؤیت انکار می‌کند و با علم انکار نمی‌کند]\n\nو آنچه را می‌نگری، بدان، و در جایی باش که می‌دانی، نه در جایی که می‌بینی. زیرا خداوند با رؤیت انکار می‌کند و با علم انکار نمی‌کند. پس اگر با رؤیت انکار نشود، به شاهد علم نیز انکار نمی‌شود. و خداوند **«حق (الحق) را می‌گوید و او راه را هدایت می‌کند» (وَهُوَ يَهْدِي السَّبِيلَ)**."
  },
  "page_count": 4
}