{
  "id": 555,
  "title": {
    "ar": "الباب الخامس والخمسون وخمسمائة في معرفة السبب الذي منعني أن أذكر فيه بقية الأقطاب من زماننا هذا إلى يوم القيامة",
    "en": "Chapter Five Hundred and Fifty-Five: Concerning the knowledge of the reason that prevented me from mentioning the remaining Poles (الأقطاب) from our time until the Day of Resurrection.",
    "ur": "باب پانچ سو پچپن: اس سبب کی معرفت (المعرفۃ) کے بیان میں جس نے مجھے اپنے اس زمانے سے لے کر یومِ قیامت تک کے باقی اقطاب (الأقطاب) کا ذکر کرنے سے باز رکھا۔",
    "fa": "باب پانصد و پنجاه و پنجم در معرفت سببی که مرا بازداشت از ذکر کردن بقیه اقطاب از زمان ما تا روز قیامت."
  },
  "content": {
    "ar": "## «الباب الخامس والخمسون وخمسمائة في معرفة السبب الذي منعني أن أذكر فيه بقية الأقطاب من زماننا هذا إلى يوم القيامة»\n\n\n> لكل منع سبب ظاهر *** أو باطن لا بد من كونه‏\n\n\n> فمانع يظهر من غيره *** ومانع يظهر من عينه‏\n\n\n> وقد يكون المنع من قربه *** وقد يكون المنع من بينه‏\n\n\n> فمن وجود العقل عن فكره *** تجد وجود الحق في صونه‏\n\n\n> فزينة الإنسان من نفسه *** إدراكه الزينة في شينه‏\n\n\n### [في كل زمان لا بد من وجود قطب‏]\n\n\nاعلم وفقنا الله وإياك أن الكتب الموضوعة لا تبرح إلى أن يرث الله الْأَرْضَ ومن عَلَيْها وفي كل زمان لا بد من وقوف أهل ذلك الزمان عليها ولا بد في كل زمان من وجود قطب عليه يكون مدار ذلك الزمان فإذا سميناه وعيناه قد يكون أهل زمانه يعرفونه بالاسم والعين ولا يعرفون رتبته فإن الولاية أخفاها الله في خلقه وربما لا يكون عندهم في نفوسهم ذلك القطب بتلك المنزلة التي هو عليها في نفس الأمر فإذا سمعوا في كتابي هذا بذكره أداهم إلى الوقوع فيه فينزع الله نور الايمان من قلوبهم كما قال رويم وأكون أنا السبب في مقت الله إياهم فتركت ذلك شفقة مني على أمة محمد صَلَّى اللهُ عَليهِ وسَلَّم وما أنا في قلوب الناس ولا في نفس الأمر ولا عند نفسي بمنزلة الرسول يجب الايمان بي عليهم وبما جئت به ولا كلفني الله إظهار مثل هذا فأكون عاصيا بتركه ولا هذه المسألة بمنزلة قوله تعالى وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ وبسط الرحمة على الكافة أولى من اختصاصها في حقنا وقد فعل مثل هذا القشيري في رسالته حيث ذكر أولئك الرجال في أول الرسالة وما ذكر فيهم الحلاج للخلاف الذي وقع فيه حتى لا تتطرق التهمة لمن وقع ذكره من الرجال في رسالته ثم إنه ساق عقيدته في التوحيد في صدر الرسالة ليزيل بذلك ما في نفس بعض الناس منه من سوء الطوية والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏",
    "en": "Chapter Five Hundred and Fifty-Five: Concerning the knowledge of the reason that prevented me from mentioning the remaining Poles (الأقطاب) from our time until the Day of Resurrection.\n\nEvery prohibition has a cause, whether manifest or hidden, which necessarily exists.\nA preventing factor may manifest from the other, and a preventing factor may manifest from its own essence (عينه).\nThe prohibition may arise from its proximity, or it may arise from its separation.\nFrom the existence of the intellect (العقل) concerning its contemplation, you find the Existence of the Real (الحق) in its safeguarding.\nThe adornment of the human (الإنسان) comes from his own self: his realization of beauty within his defect.\n\n### [In every time, the existence of a Pole is necessary]\n\nKnow—may Allah grant success to us and to you—that the established books will not cease until Allah inherits the earth and those upon it. And in every time, the people of that time must rely upon them. And in every time, there must necessarily be a Pole (قطب) upon whom the axis of that time revolves. If we were to name him and specify him, the people of his time might know him by name and identity but not know his rank (رتبته). For Allah has concealed sainthood (الولاية) among His creation. And perhaps that Pole (القطب) would not hold in their souls the station (المنزلة) that he truly holds in the Reality of the Matter (نفس الأمر). If they were to hear mention of him in this book of mine, it would lead them to fall into error concerning him. Then Allah would remove the light of faith (نور الايمان) from their hearts, as Ruwaym said. And I would be the cause of Allah's wrath (مقت) upon them. Therefore, I abandoned that out of compassion (شفقة) for the Community (أمة) of Muhammad, may Allah bless him and grant him peace. I do not hold the station of a Messenger (الرسول) in the hearts of people, nor in the Reality of the Matter, nor in my own estimation, such that belief in me and what I brought would be obligatory upon them. Nor has Allah obligated me to reveal such a thing, such that I would be disobedient (عاصيا) by omitting it. Nor is this matter equivalent to His saying, the Exalted: <<وَقُلِ الْحَقُّ مِن رَّبِّكُمْ فَمَن شَاءَ فَلْيُؤْمِن وَمَن شَاءَ فَلْيَكْفُرْ>> (And say: 'The Truth is from your Lord, so whoever wills, let him believe, and whoever wills, let him disbelieve'). And extending mercy (الرحمة) to all is preferable to restricting it in our regard. Al-Qushayri did something similar in his *Risala* (Treatise) when he mentioned those men at the beginning of the treatise but did not mention Al-Hallaj among them, due to the controversy (الخلاف) that surrounded him. This was so that suspicion (التهمة) would not attach itself to the men whose mention appeared in his treatise. Furthermore, he presented his creed (عقيدته) concerning Unity (التوحيد) at the beginning of the treatise to remove any ill-will (سوء الطوية) that some people might harbor against him. And Allah <<يَقُولُ الْحَقَّ وَهُوَ يَهْدِي السَّبِيلَ>> (speaks the Truth, and He guides to the Way).",
    "ur": "باب پانچ سو پچپن: اس سبب کی معرفت میں جس نے مجھے اپنے زمانے سے لے کر قیامت تک باقی اقطاب کا ذکر کرنے سے روکا\n\nہر ممانعت کا ایک ظاہر سبب ہوتا ہے\nیا ایک باطن، جس کا ہونا ضروری ہے\n\nایک مانع جو کسی اور سے ظاہر ہوتا ہے\nاور ایک مانع جو خود اس کی ذات سے ظاہر ہوتا ہے\n\nاور کبھی ممانعت اس کے قرب سے ہوتی ہے\nاور کبھی ممانعت اس کے درمیان سے ہوتی ہے\n\nپس عقل کے وجود سے اس کی فکر کے ذریعے\nتم ذات حق (الحق) کے وجود کو اس کی حفاظت میں پاؤ گے\n\nانسان کی زینت اس کی اپنی ذات سے ہے\nکہ وہ اپنی خامی میں بھی زینت کا ادراک کر لے\n\n### [ہر زمانے میں قطب کا وجود ضروری ہے]\n\nجان لو، اللہ ہمیں اور تمہیں توفیق دے، کہ لکھی ہوئی کتابیں اس وقت تک باقی رہیں گی جب تک اللہ زمین اور جو کچھ اس پر ہے، اس کا وارث نہ ہو جائے۔ اور ہر زمانے میں اس زمانے کے لوگوں کا ان کتابوں پر مطلع ہونا ضروری ہے۔ اور ہر زمانے میں ایک قطب کا وجود ضروری ہے جس پر اس زمانے کا مدار ہو۔\n\nپس اگر ہم اس کا نام لیں اور اس کی تعیین کر دیں، تو ہو سکتا ہے کہ اس کے زمانے کے لوگ اسے نام اور ذات سے تو پہچان لیں، لیکن اس کے مرتبے کو نہ پہچانیں۔ کیونکہ ولایت کو اللہ نے اپنی مخلوق میں پوشیدہ رکھا ہے۔ اور بسا اوقات ان کے دلوں میں وہ قطب اس منزلت پر نہیں ہوتا جس پر وہ حقیقتِ امر میں فائز ہوتا ہے۔\n\nپس جب وہ میری اس کتاب میں اس کا ذکر سنیں گے، تو یہ چیز انہیں اس قطب کے بارے میں بدگمانی میں مبتلا کر دے گی، اور اللہ ان کے دلوں سے ایمان کا نور نکال لے گا، جیسا کہ رُوَیم نے کہا ہے۔ اور میں ان پر اللہ کی ناراضگی کا سبب بنوں گا۔ لہٰذا میں نے امت محمد صلی اللہ علیہ وسلم پر شفقت کرتے ہوئے یہ ذکر ترک کر دیا۔\n\nمیں لوگوں کے دلوں میں، نہ حقیقتِ امر میں، اور نہ ہی اپنے نزدیک اس منزلت پر ہوں کہ میں رسول کی طرح ہوں جس پر ایمان لانا اور جو کچھ وہ لائے ہیں اس پر ایمان لانا ان پر واجب ہو۔ اور نہ ہی اللہ نے مجھے اس طرح کی چیز ظاہر کرنے کا مکلف کیا ہے کہ اسے ترک کرنے پر میں نافرمان ٹھہروں۔ اور نہ ہی یہ مسئلہ اس آیت کے درجے میں ہے:\n**\"اور کہہ دیجیے کہ حق تمہارے رب کی طرف سے ہے، پس جو چاہے ایمان لائے اور جو چاہے کفر کرے\"** (وَقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ)۔\n\nاور رحمت کو سب پر عام کرنا ہمارے حق میں اسے خاص کرنے سے زیادہ بہتر ہے۔ قشیری نے بھی اپنے رسالے میں ایسا ہی کیا ہے، جہاں انہوں نے رسالے کے شروع میں ان رجال کا ذکر کیا، لیکن حلاج کا ذکر نہیں کیا، اس اختلاف کی وجہ سے جو ان کے بارے میں واقع ہوا تھا، تاکہ ان رجال پر کوئی تہمت نہ آئے جن کا ذکر ان کی رسالے میں آیا ہے۔ پھر انہوں نے رسالے کے آغاز میں توحید کے بارے میں اپنا عقیدہ بیان کیا تاکہ اس سے بعض لوگوں کے دلوں میں موجود بدگمانی کو دور کر سکیں۔\n\nاور اللہ حق فرماتا ہے اور وہی سیدھے راستے کی طرف رہنمائی کرتا ہے (وَاللَّهُ يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ)۔",
    "fa": "باب پانصد و پنجاه و پنجم در شناخت سببی که مرا بازداشت از اینکه بقیه اقطاب را از زمان ما تا روز قیامت در آن ذکر کنم\n\nبرای هر منعی سببی آشکار است\n*أو باطن لا بد من كونه‏*\nیا باطنی که وجودش حتمی است.\n\nپس مانعی از غیر خود ظاهر می‌شود\n*ومانع يظهر من عينه‏*\nو مانعی از عین خود ظاهر می‌شود.\n\nو گاهی منع از نزدیکی اوست\n*وقد يكون المنع من بينه‏*\nو گاهی منع از میان اوست.\n\nپس از هستی (الوجود) عقل از اندیشه‌اش\n*تجد وجود الحق في صونه‏*\nهستی (الوجود) حق (الحق) را در حفظ او می‌یابی.\n\nپس زینت انسان از نفس اوست\n*إدراكه الزينة في شينه‏*\nادراک او زینت را در عیب خود.\n\n[در هر زمان وجود قطب ضروری است]\n\nبدان، خداوند ما و تو را توفیق دهد، که کتاب‌های نوشته شده از بین نمی‌روند تا زمانی که خداوند «زمین و هر که بر آن است» (الْأَرْضَ ومن عَلَيْها) را به ارث ببرد. و در هر زمان، اهل آن زمان ناگزیر باید بر آن‌ها وقوف یابند. و در هر زمان وجود قطبی ضروری است که مدار آن زمان بر او باشد. پس اگر او را نام ببریم و مشخص کنیم، ممکن است اهل زمانش او را به اسم و عین بشناسند، اما رتبه او را ندانند. زیرا خداوند ولایت را در میان خلق خود پنهان داشته است. و چه بسا آن قطب در نزد آن‌ها، در نفس خودشان، به آن منزلتی که در واقعیت (نفس الأمر) دارد، نباشد. پس اگر در این کتاب من ذکر او را بشنوند، این امر آن‌ها را به ورطه افتادن در او می‌کشاند، و خداوند نور ایمان را از دل‌هایشان برمی‌کَنَد، چنانکه رویم گفت، و من سبب خشم (مقت) خداوند بر ایشان می‌شوم. پس من این کار را از روی شفقت بر امت محمد (صَلَّى اللهُ عَليهِ وسَلَّم) ترک کردم. و من نه در دل‌های مردم، نه در واقعیت (نفس الأمر)، و نه نزد خودم، در منزلت رسولی نیستم که ایمان به من و آنچه آورده‌ام بر آنان واجب باشد. و خداوند مرا مکلف نکرده است که چنین چیزی را آشکار کنم تا با ترک آن عاصی شوم. و این مسئله نیز به منزله سخن خداوند متعال نیست که می‌فرماید: «و بگو حق (الحق) از پروردگار شماست، پس هر که خواهد ایمان آورد و هر که خواهد کفر ورزد.» (وقُلِ الْحَقُّ من رَبِّكُمْ فَمَنْ شاءَ فَلْيُؤْمِنْ ومن شاءَ فَلْيَكْفُرْ). و گسترش رحمت بر همگان (الکافة) اولی‌تر است تا اختصاص دادن آن در حق ما. و قشیری نیز در رساله خود چنین کاری کرد، آنجا که در ابتدای رساله از آن مردان یاد کرد، اما حلاج را به دلیل اختلافی که در مورد او وجود داشت، ذکر نکرد، تا تهمت متوجه کسانی نشود که ذکرشان در رساله او آمده است. سپس او عقیده خود در توحید را در ابتدای رساله آورد تا آنچه از سوء نیت (سوء الطوية) در نفس برخی مردم نسبت به او وجود داشت، از بین ببرد. و خداوند «حق (الحق) را می‌گوید و او راه را هدایت می‌کند.» (والله يَقُولُ الْحَقَّ وهُوَ يَهْدِي السَّبِيلَ‏)."
  },
  "page_count": 1
}